{"hMu4Ol3UqqWhD0OwfJAxyQ":{"text":"There is a reviewer here who said the place smelled like urine. \n\nThey were absolutely cor","useful":1,"cool":0},"haiIcodsXTSKbyTa8wBXDw":{"text":"A small place with decent food and drink.  As much locals as otherwise, which may be rare ","useful":0,"cool":0},"1hCaz8QzMHCFWz8QctRd4g":{"text":"Total smokey dive bar but you can't beat the prices and the fried oysters are some of the ","useful":0,"cool":0},"wnmtj9UM4xBQoD12uFvMng":{"text":"For a dive bar with food this is a decent place if you want a bite on the cheap.  However ","useful":2,"cool":0},"_wjXS4aFM1LDUkJPKOvjSQ":{"text":"The bartender Amanda is the reason this is my favorite bar in the CBD. Every time I come i","useful":0,"cool":0},"MoLASjOr61rTuCIq-ibO5A":{"text":"Came looking for some good beer and fast foot and was quite suprised. Very nice people and","useful":0,"cool":0},"xyU1a0EjSoTvAK77G3I07A":{"text":"Had a groupon for sandwiches and beer. The service was decent, as was their beer list. The","useful":0,"cool":0},"Pf6rV8-EDN76FI6VUBpUew":{"text":"Excellent little hole in the wall bar with outstanding food. Gumbo was out of this world! ","useful":0,"cool":0},"tUbAQEQm6-9Cxn4CKGu1DA":{"text":"Tiny dive bar I would have never thought to eat at but thank god for yelp.  Ending up comi","useful":1,"cool":0},"HnLlP36V7aW1VBm7ddFaVQ":{"text":"Love this place so much!!! Super great service. Mel is the shit. Let her take a selfish!","useful":0,"cool":0},"fA2oc2oYEthN4-p4_-VwRg":{"text":"We just walked in and and then left after getting one draft beer.  Yelp has this place lis","useful":1,"cool":0},"lKSpFcP5Uccj9FU2tVzDqQ":{"text":"Had possibly the worst burger I've ever had in my life last night from Cajun Mike's. It wa","useful":0,"cool":0},"7znxtnkhGbz9P0MhjfZdXg":{"text":"Best red beans and rice (with andouille sausage) in all of NoLa! What a find! This is my r","useful":0,"cool":0},"JOnWfSiHCImV1Lr8Xa6cfA":{"text":"Was told by everyone to go here so I did twice!  Only to be forced out by the thick cigare","useful":0,"cool":0},"AUUKxFtsliPfvij79nqILg":{"text":"Real friendly staff, nice beer selection on tap and some good ol' New Orleans bar food. An","useful":0,"cool":0},"Askv8GwhAnetNi59nvfGVg":{"text":"Cheerful and fast bartender up front. Sandwich savant in the back. What's not to like? Hig","useful":0,"cool":0},"0P526L_PMgqz5KYevjsYYQ":{"text":"I loved every second a spent here. Great prices, good cold beer, awesome food! The gumbo w","useful":1,"cool":0},"TF5CxfaPU7S5nDsT_K4mmA":{"text":"Such a great place!  Did a boudin ball, crawfish kicker, onion ring & mozzarella stick sam","useful":0,"cool":0},"h9BzeDkbTV2bgA2jJr3owg":{"text":"GROUPONED a coupon $20 only $13 dive bar with sweet twig of server. She was so tiny and ni","useful":0,"cool":0},"bi8pqif0fa6r_qAzHVnLwQ":{"text":"A fun atmosphere with really good and cheap food right off canal street. Drink prices are ","useful":0,"cool":0},"k3mYS413qAcOw4j_qnwULA":{"text":"Friendly staff, great sandwiches, and cheap beer. What else could you want? Make sure to t","useful":0,"cool":0},"xljZpH4XwFI3PtuZY5M1oA":{"text":"I'm surprised this place is still in business.  Okay, it's a dive bar but stay away from t","useful":0,"cool":0},"l-mbrKrB83hJTKIIcMkl8g":{"text":"Basic dive bar with standard prices for drinks.  Had the alligator sausage po' boy sandwic","useful":0,"cool":1},"H9LZ-7Pl51JS20IdLc_VXw":{"text":"The food is great, I can only boast about the food. Great great and great. However the men","useful":0,"cool":0},"91HlbKyBcTX_VBPBny7T4A":{"text":"I loved the alligator sausage po-boy and I may be the first person to try one while comple","useful":1,"cool":1},"tunB48Mk391ce1sZMcFe9w":{"text":"It's not bad \"Bar\" food. The bartender was friendly and very social. She made sure our dri","useful":0,"cool":0},"qEWkSnxgDGiJ7sMvqbkbcg":{"text":"solid poboys for a decent price and very competitive drink prices. not very much seating a","useful":0,"cool":0},"sWS8f2TWjojy7EVClTy9KA":{"text":"We ordered the chicken and sausage gumbo which was amazing, jambalaya, alligator sausage p","useful":0,"cool":0},"bOQH0XwBvXUckVo-4KGFMQ":{"text":"After using this app for years and not reviewing anything, my horrible experience here req","useful":0,"cool":0},"RFgAarW1qvMLlD5d0Tp59w":{"text":"Great service! Great food! Great prices! While visiting NOLA for a week this became our fa","useful":0,"cool":0},"7XX_F85Tw52vZcLj_-p4Lw":{"text":"Awesome little hole in the wall bar with friendly service. Prices are cheap and the food i","useful":0,"cool":0},"JUgtV8myJZEz06KBnuX7BQ":{"text":"Open late, serves food late. We came after a night on Bourbon. Fiance had the alligator sa","useful":0,"cool":0},"yRJGJgod0MryWFbYP_8jkw":{"text":"Fun neighborhood sports bar that serves above average creole food at very good prices.  Lo","useful":1,"cool":0},"7GWdwV7eh8pJNW8mHm-67Q":{"text":"Food was solid but would not call it amazing. Prices however very reasonable and relaxed p","useful":0,"cool":0},"IKS-8xDcCzA7u6ieuvxe9A":{"text":"Food was quick and delicious. Nathan was very attentive and amazing ! Amanda was very welc","useful":0,"cool":0},"-QzPyiKtUvDno3B7wTeXXg":{"text":"I freakin love this place and recommend it to everyone that goes to NOLA.  I wandered in o","useful":0,"cool":0},"AGZqzeAfelGz4EeCB2lsMg":{"text":"Came back again before leaving new orleans and now I'm completely obsessed with their gato","useful":1,"cool":0},"uGITN8clTGnwDNBiPs24Ag":{"text":"Great po' boy and service during Mardi Gras. Very quick even with a crowd. They honored Gr","useful":0,"cool":0},"L5vg68_0gJjZ5sy9u6Dz_g":{"text":"Lots of locals inside drinking up a storm.  Liked the chilled vibe and the shrimp po boy w","useful":0,"cool":0},"56-aMuPoLzP51Vh6Tc_rXA":{"text":"On again in my search god New Orleans best catfish  poboy. I ordered this one and the fish","useful":0,"cool":0},"_bX6qswvPMMQ7uD59RcjPw":{"text":"Great new find in New Orleans. Amazing food. Alligator sausage poor boys, Garlic butter cr","useful":4,"cool":0},"TBguYAnYSiL9ORd5rPuRbw":{"text":"Not sure why i don't get hungry during normal business hours like normal people, but i cer","useful":1,"cool":1},"AXkEkM3nWcn8bbbRivoU1w":{"text":"Jazz fest weekend and there is only one bartender. She's good though. And so is the food","useful":0,"cool":1},"jB89u8-6Aw-J_df1JenEbg":{"text":"Went here for a quick bite before heading out for the night. The food was good and flavorf","useful":0,"cool":0},"fbUeZD2q5P4eK_bfxf6Wdw":{"text":"Found the restaurant while perusing the streets and stopped in for a couple of po boys. Gr","useful":0,"cool":0},"_r6UmtE5Ic2i68sWyRj4ww":{"text":"Cajun Mike's is a local bar just outside the French Quarter. We tried both the oyster and ","useful":1,"cool":0},"3oU3uQRqoLtjWNI3ArhSUw":{"text":"While the bartender/waitress did a good job of keeping our drinks filled and getting our f","useful":0,"cool":1},"KwkhoRMBSlL-BHjBgoAbKQ":{"text":"This is the worst place we could have picked tonight. We just left the Pink Floyd concert ","useful":1,"cool":0},"jwgiUhBzi6NUUEbJ7F85WQ":{"text":"A quaint little bar that serves up Cajun food.  Has a neighborhood bar feel to it and food","useful":0,"cool":0},"LISZEj7t6gGbwi5E8bJdkg":{"text":"i was in nola twice in about a month & ate here both times. it is close to where i stayed ","useful":1,"cool":0},"EbVj6oekWljXqItqKHsfKg":{"text":"Dive bar with good po boys. I walked into this smokey hole-in-the-wall establishment expec","useful":0,"cool":0},"_pr30PZ1lgcUzUO_mTGfag":{"text":"This review is for the food only and not the bar ambience. We opted for take out since we ","useful":0,"cool":0},"SE-cc82lR2OH_w4zMOmHTA":{"text":"We went here because of the Yelp! reviews, and were not disappointed! Incredibly low price","useful":1,"cool":0},"0yPblkc4AXtnPqOtdNqZJA":{"text":"The bartender was so friggin awesome and friendly. The food is bad ass  and it is one of t","useful":1,"cool":1},"EiZTCzNRc1my54fysxJmVw":{"text":"Great small neighborhood bar with very good drinks. Perfect place for late night. Good juk","useful":0,"cool":0},"-olbsV0WapL8VbT_vYSBkQ":{"text":"Good food. Awesome bartender (Hannah). Not too crowded. Affordable prices, what more could","useful":0,"cool":0},"2cuoz2HbqjOstjXhvLGckg":{"text":"Quick bite before vaca to NOLA was over & it did NOT disappoint, small bar w amazing bar f","useful":0,"cool":0},"h7paEs2yLAfm3gCxo_DncQ":{"text":"Tried this small local bar to taste a few local foods. We were quiet surprised how much we","useful":0,"cool":0},"u3RMrNpxDH2iGtnwhxRmbQ":{"text":"Driving from Phoenix to West Palm with a Teacup Chihuahua, Cajun Mike's was the first esta","useful":1,"cool":1},"GTT34HklQmHeGI0fLuFwwQ":{"text":"The alligator sausage poboy is a must! The seasoning in the sausage paired with the creole","useful":0,"cool":0},"hznpDXegsSJhaGbNoqv3AA":{"text":"Summary:\nDive bar with decent food.\n\nDetails:\nThis place allows smoking indoors, so be war","useful":1,"cool":1},"o_DfHWMyefQlqY7g3LvMIA":{"text":"Walked in and it was if everyone in the place was family. They immediately welcomed us int","useful":0,"cool":0},"1G8T2IlQrjPKfG5RoUDlPg":{"text":"Per others' recommendations, we ordered a muffuletta and an alligator sausage poboy.  Onio","useful":0,"cool":1},"wFAUDxjrmuYarOcxiXEIqA":{"text":"After visiting the city for a week, I ate (and drank) at Mikes at least 3 times. The food ","useful":0,"cool":0},"lW9ckahUB_Fw3jm4Vioi3w":{"text":"Get the gumbo. Wow ! So flavorful . Only giving it four stars because i didnt try anything","useful":0,"cool":0},"tS4CElv8wknVabMJIJpzmQ":{"text":"When you're starving, everything looks good. We ordered a little bit off everything, but t","useful":0,"cool":0},"4lh-2AmNv4qv4WYXUwFyfQ":{"text":"First time I heard the term Poboy was here in NOLA. so I looked up for the best place to t","useful":0,"cool":0},"6PqKlCHrb2h6AC49KLGpUQ":{"text":"Five star shit show. But still cool I like broke drunk folks who work....will be back.","useful":0,"cool":0},"5wjLuTHiOhmCo6naCxMqHA":{"text":"This is that hole in the wall bar that everyone loves. We stopped by for lunch and a few b","useful":0,"cool":0},"JXQ6MOV_AapWsf9ORHk2UQ":{"text":"Your typical bar food so I'm very confused why it has 4 stars. The bartender was amazing b","useful":0,"cool":0},"wUivwQQyjPdTJs-S3iRblw":{"text":"The bar looks old but don't let the looks fool you. Bartender Rue was amazing and very fri","useful":0,"cool":0},"lkhMYtcl-avOZ2l1XzG5Cw":{"text":"Cold beer and great food. Wife loved her cheeseburger. The Cochon De Lait did not disappoi","useful":0,"cool":0},"GGFR5q65Wh1UofrVFj4pYA":{"text":"Alligator sausage poboy is an absolute must. The staff was extremely nice to my wife and I","useful":0,"cool":0},"gEVQPm2eDZvMj93xO005uQ":{"text":"This is a small bar, but the shrimp poboy is good and actually has adequate proportions of","useful":0,"cool":0},"C6K77EO4CTP6k9BCTc8u1g":{"text":"This was our first stop on Halloween Weekend and my fiance and I couldn't have been happie","useful":0,"cool":0},"1yeVas1vK2hDcLFrjtDIug":{"text":"Dark neighborhood bar, decent food albeit slightly overrated.","useful":0,"cool":0},"7spncKy9SwU_zgmYZhyUYw":{"text":"It's okay, but bars like Cajun Mike's are a dime a dozen in New Orleans.  Still, if you're","useful":1,"cool":0},"8tWoPNCf5hOyYCMGl0z2_w":{"text":"How to earn a 1 star review:\n\nCheese fries that were cold and the cheese not melted. Liter","useful":5,"cool":0},"0TceAftNekiJxOg8z1esbA":{"text":"The food was just....meh. I ordered the catfish po-boy with a side of onion rings. The oni","useful":0,"cool":0},"_W6VRFGZINvl4GbAC2ZOiw":{"text":"Was this the best po' boy I ever ate?  Probably not, but it hit the spot, and I had enough","useful":1,"cool":0},"pcmiahShpYibfhn356FYZQ":{"text":"After a day spent in the tourist traps of New Orleans, the group I came with asked if I kn","useful":0,"cool":0},"jRouSfWQbLzqDffeKGDq5g":{"text":"Total dive bar.  Don't expect fancy here even though its right across the street from the ","useful":0,"cool":0},"9o324wYOT8aT2DQ5Ui9BWQ":{"text":"Kudos to the Yelpers! Dr. Wife and I have found our little slice of dive heaven for our 4 ","useful":5,"cool":5},"9pLlOjkuhC6CiYMR7iW-Kw":{"text":"The muffelatta was panini style, other reviewers had commented on the pressed sammy giving","useful":3,"cool":2},"cvO3nzdcMkcOP9fV_sNCow":{"text":"Wings and poboys are delicious here and the service is quick and friendly. It's a small jo","useful":0,"cool":0},"XY_YgF24eFrz_Fxg6UOL_g":{"text":"I was on vacation for the New Orleans jazz fest for a few days and I had to come and eat h","useful":0,"cool":1},"xEYtc8CoWoEpr673Rx7jGg":{"text":"Bartender took multiple shots then later accused us of not paying then held a friends phon","useful":0,"cool":0},"mznXEL6hSxOF5EhxXv1MkQ":{"text":"Hole in the wall downtown bar that is a nice little spot right near the Quarter. Passed he","useful":1,"cool":0},"xk-9n3C8Y8p27KhqSWH5-Q":{"text":"Great little bar/restaurant. \nBartender called it a dive bar, but the food was simple and ","useful":0,"cool":0},"4BnScIHMiLSkdH0tRGKhww":{"text":"Total dive bar and TOTALLY worth going. We didn't even get any drinks. Ppl were nice and t","useful":0,"cool":0},"0o65KlckReTA1vqFtYjDbQ":{"text":"I went here with a friend to grab a bite to eat for dinner on a Sunday night. The place is","useful":0,"cool":0},"rtNVOj7KVUMEAWGjySogDQ":{"text":"Great food, friendly clientele and a super staff not to mention reasonable prices.  A win ","useful":0,"cool":0},"G3zi-XiSBcVTmgyPvUzMVQ":{"text":"This is not your tourist french quarter New Orleans bar. Its a cheap place for beer and fo","useful":0,"cool":0},"aIi8ioakuLS8fd6CoqcCyA":{"text":"Great spot! Nathan at the bar is really friendly and happy to point a tourist in the right","useful":0,"cool":0},"xwiiH78Fh3ZldVjfzBecZg":{"text":"Kind of remind you of Cheers, where everyone knows your name. It's like being in a neighbo","useful":0,"cool":0},"55MKHBnP0qKarsnfN12KvA":{"text":"Nice little dive bar. We stopped in for a small bite and was pleasantly surprised with the","useful":0,"cool":0},"74exb4TkJj0EYW8H2_CWfg":{"text":"Best kept secret.    Cheapest bar in New Orleans and fabulous food.   Momma always said \"s","useful":0,"cool":0},"uJVzdk7A3z_99x-siLu-EA":{"text":"Came here after a search for \"cheap food\" on Yelp.  Totally worth four stars.  Would have ","useful":0,"cool":0},"f_9k89coMQXm-r-iE033_A":{"text":"Star ratings are relative, and my grade shouldn't be taken to compare this place to Stella","useful":2,"cool":1},"rgKp-WcF1oXPUi4ZWxDyHw":{"text":"Awesome. Cool hangout. Alligator sausage po boy was great. Will go each time I'm in NOLA.","useful":0,"cool":0},"Z21AcKYTtANPncfmAtBP0g":{"text":"This spot was close to our hotel just outside the quarter. Nice little dive bar with cheap","useful":0,"cool":0},"TsJidwJV-T0-P52iYCzgaQ":{"text":"Great spot to grab a gumbo and enjoy a beer. It was pretty quiet up until around 9, then t","useful":2,"cool":1},"NOsCAUs9mgsM3RhxeT2juQ":{"text":"We popped into Cajun Mikes when we stumbled upon it while walking toward downtown. We were","useful":0,"cool":0},"9bxke25SCMqS2B1qDdMICA":{"text":"Don't...just don't.\n\nLast night in NOLA so we tried the red beans & rice because a local s","useful":1,"cool":0},"vRiqPtLre-cGx-Mh_TxKJg":{"text":"Classic classic cool @$$ old school pub, with some really good sandwiches, classic Nola fo","useful":0,"cool":0},"2mKX9mG2IVEpST2s4g3CSg":{"text":"Bad-assed place with cheap eats and cheap drinks.  I hung out here for a couple of hours o","useful":4,"cool":5},"ltlFFlLz2g6b0NB9X6sCgQ":{"text":"Cajun Mike's is a great spot for delicious and cheap local foods. It's located close to th","useful":1,"cool":0},"OxRheKgD6sxh2Z7k5vOzFQ":{"text":"I travel all over the country for a living and seek out small local bars. The best thing e","useful":0,"cool":0},"tOWUdJV3vanB0VkeKNLYcg":{"text":"Wonderful bar. A home base for anyone who lives or works nearby. Great drinks. Delicuous f","useful":0,"cool":0},"iz8nv-aI_4wQ9S0xuzKEyw":{"text":"The Shrimp Basket, Chicken Wings and Catfish PoBoy surprised us for late night food, and t","useful":0,"cool":0},"ePqn4QpF10uYJw7DKHOoKg":{"text":"This is located in a small, divey bar, but the food is as good as anything in the Quarter ","useful":0,"cool":0},"s5UwttnUn3pdDMhB8MW8fw":{"text":"Ehhh\n\nSaw the reviews and wanted to give it a shot! Outside looks like a hole in the wall ","useful":0,"cool":0},"6hW9STZTTb1XGpHrDVkAug":{"text":"I had my first taste of New Orleans' jambalaya here and I loved it! My friend ordered thei","useful":0,"cool":1},"1bqKej7B61Nmwlw-3OMSSA":{"text":"The food is delicious! Definitely stop by for taco Tuesday. Rue is a doll. Amanda and Nate","useful":0,"cool":0},"Y5UhfsqR8Y4PQYKjH5dVlA":{"text":"I'm over the moon about this place. We got here on a Monday night and joe was working. Joe","useful":0,"cool":0},"_LEz6-E7Bb5emQ-o277eOQ":{"text":"Had half a cochon and half a gator po-boy and honestly it was the best food I've had in th","useful":0,"cool":0},"tBqpsQkS-CZ5n-xuBJRPRg":{"text":"We were only here for Mardi Gras and trying to find food off bourbon street. I ordered the","useful":0,"cool":0},"1T6d8hu8RLZ-GDc8JqxscA":{"text":"I was on my own for dinner while visiting New Orleans and saw Cajun Mike's across the stre","useful":0,"cool":0},"NwWrTWdIL1_QOTY2uFjahA":{"text":"What dive bar doesn't like cash? We walked in looking for food rather than alcohol. The st","useful":1,"cool":1},"6qh-3GgtA-ZbHd7pREbWWA":{"text":"Townie feel in a tourist town!  Wonderful bar tenders, great prices, solid pub grub.  Just","useful":1,"cool":0},"zNRiC41cp0TmfEFwx78hGw":{"text":"Dive right in!  A prototypical Nawlins dive bar with the added bones of great food. Three ","useful":0,"cool":1},"k2ecuTo8Y8mb6DiIdp0RVQ":{"text":"Loved the alligator sausage po boy. Bread is super fresh, but the pickles and slaw are wha","useful":0,"cool":0},"3_dWEtCDTwz2fHMsCzVnJA":{"text":"Stopped in for an alligator sausage poboy and was blown away. The sandwich was simple and ","useful":0,"cool":0},"lE7NjNtVvVPpdwBMrzUflQ":{"text":"Highly recommend the wings, fries, and muffuletta press. The onion rings were okay, but de","useful":0,"cool":0},"nzUgF_98Q3l4FrMeSUC0ZQ":{"text":"So we were visiting New Orleans for a few days and stumbled in here on our first night. We","useful":0,"cool":0},"Y0Oj_eruzH1GXgPMMSrEeA":{"text":"I was hoping this place would be good based off of the yelp reviews but as soon as we walk","useful":0,"cool":0},"X1Of3NnHCQ9EFJWWBI8rWg":{"text":"I seem to have had a similar experience to that of Taylor from a month ago. Checked this p","useful":0,"cool":0},"VjlCLTnkx4VWvehQGs4kcQ":{"text":"I had an amazing pulled pork poboy with sweet potato fries. My sister, friend and I went t","useful":0,"cool":1},"8eg0Gx-uDB7YUMBUp0Ls-g":{"text":"Saw this place on Restsurant.com decided to try it with the misses for a quick bite until ","useful":1,"cool":0},"cjq6m6zo9SR2xZVHGErl0g":{"text":"Small bar with good food. Had the shrimp PoBoy and my sister had the alligator sausage PoB","useful":0,"cool":0},"BzowJF5EOcXuED6dFxd-Kg":{"text":"Small pub and grill.  Just a few small tables, majority of the seats are at the bar. Had t","useful":0,"cool":0},"tnuDt64BeQzA1XnwYHAp7Q":{"text":"The alligator sausage po'boy was great! Beer was cold and cheap. For a NOLA dive, this pla","useful":0,"cool":0},"QuoQ7md9WXyksv3mBUhWBw":{"text":"Came here midday for a quick bite to eat after running errands. The bar looked really tiny","useful":2,"cool":0},"kys7ChZanzZpahsqRIq7vA":{"text":"Great food! Great atmosphere! Writing this because the guy bartender needs to do less talk","useful":0,"cool":0},"pLVunKMap1V2EuyvRtQb_g":{"text":"Well, the beer was cold and the place was okay.  Ordered a cheeseburger, which never came,","useful":1,"cool":0},"EGOaAOG-6PCQxp_sQfMZcw":{"text":"Sorry to say, but it's true.  \n\nAs soon as we walked in I caught that whiff 'o pee, others","useful":4,"cool":1},"XdPh2MrIjcy3V1m0C5ufPQ":{"text":"What a cool find! Is it a little divey? Yes. Is the food phenomenal? Yes. Was the service ","useful":1,"cool":0},"Rgzp-NMSVxChMBZ_0ouH7A":{"text":"Alligator poboy, jambalaya, gumbo and boudin balls. The poboy and boudin balls were the st","useful":0,"cool":0},"BAdarxqEehb7RM7WBO2zVQ":{"text":"Great dive bar with great food\n Everyone was nice with good music. A little rock, soul and","useful":1,"cool":1},"nHmiAG4r4SlBncWT2biToA":{"text":"Been here less than a minute, and already have a friend. Pub food. Great on a hot, muggy e","useful":1,"cool":1},"w5JCzw9lV3yi3RH2UI4wVA":{"text":"When I visited New Orleans a couple of weeks ago I only had one thing on my mind. Find the","useful":0,"cool":0},"ZQbeiMcq0XH4ykEZ_r8R3A":{"text":"So this is a total dive bar across from the Waldorf Astoria, where I was attending a confe","useful":1,"cool":0},"yRzPCrSDS0-PMG28VBQJqA":{"text":"This was by far one of the best dive bars in Quarter! (at least that I know of)  I was sha","useful":1,"cool":0},"_Sm_B4t1_xIjFBoK9P8f4w":{"text":"amanda is the worst customer service person!!!  we went in here to try a po boy sandwich. ","useful":0,"cool":0},"bNfSGvh6Chqmo9Gnh11kng":{"text":"Mike's is a gem compared to the overpriced nearby restaurants. We ordered a shrimp Po Boy ","useful":0,"cool":0},"rJ--ZP9yrpaR5UwkAqQAFA":{"text":"Great food. The boudin balls was great. Aligator sausage poboy was delicious. Definitely a","useful":0,"cool":1},"3ClnyJRZRgep6-1NahmzMg":{"text":"The boudin balls were fantastic.  The bbq was very good, fried shrimp were amazing, very f","useful":1,"cool":1},"-yMtJh6sbtEo0YLbTgbK1g":{"text":"Went here for lunch didn't have any drinks there but did have a very nice lunch.  The food","useful":1,"cool":0},"RMzJ3yrHrQG0vtJDO4SL-A":{"text":"i wanted something authentic and went here. Liked the Alligator sausage poboy. However i f","useful":0,"cool":0},"FFH7oAT50VlxzdWZXFPnNw":{"text":"I love this kind of place; and the fact it's so close to tourist central makes it even mor","useful":0,"cool":0},"075cWymWZIyWWMqMu3QtIA":{"text":"Delicious PO boy sandwich.   True hole in the wall bar find.  Off the path with local food","useful":0,"cool":0},"xgjdsyXEDQ8tZiR6Lvjtdw":{"text":"I ate Gumbo from multiple locations in NO. Cajun Mike's Gumbo, IMO, is top tier. I enjoyed","useful":0,"cool":0},"LiWm4qKPJm8zEGc6oZt9tg":{"text":"LOVE!!  My husband and I killed 3 hours here during the \"kicked out of the hotel\" and \"too","useful":2,"cool":1},"NwAOA8_T5uOp4pvparuDzA":{"text":"Small dark bar with several bar stools and tables. Food was fast, hot and tasted great. Se","useful":0,"cool":0},"a0FWWwznotzOViGO-fkBGw":{"text":"I'm giving them four stars for the great friendly service and the awesome food.  I'm not u","useful":0,"cool":0},"LW2VB6xHR8ZuEu1cXPztyQ":{"text":"Came here for break after being on Bourbon St for too long.  I walked into the bar and a f","useful":1,"cool":1},"l_a2nQSgYmugRaK61duA6A":{"text":"Yummmmmm.....best ever Oyster PoBoy, also same for the onion rings. Actually I ordered the","useful":0,"cool":0},"DSsm1HmxO535wcLe39EBcA":{"text":"Cheap drinks and good friend food. A perfect place to meet outside hotels and get ready to","useful":0,"cool":0},"EMNqgKCmjagbdrC4sIQe4A":{"text":"Bar tender too busy letting some local hit on her to give any reasonable service. Food ove","useful":1,"cool":0},"IFsCVz2IxVUKMQUAbH6CWw":{"text":"Definitely glad we found this place. Highly recommend the alligator sausage po boy and red","useful":0,"cool":0},"mFxh6Q7X0JD1p69qG5aciQ":{"text":"It's a bar, nothing fancy, with good service and food. Cuban sandwich tasted like it shoul","useful":0,"cool":0},"oqk9wfb5xemioHAZxDOJ0w":{"text":"Great (cheap) bloody maries. If you're a self-proclaimed \"bloody mary snob\" (eyeroll) this","useful":3,"cool":1},"8Y08YxROaAdfFz2fG9e2WA":{"text":"My boyfriend and I met some friends in New Orleans and Cajun Mikes was a great hangout. DA","useful":2,"cool":1},"x--OxXbp6xOvIYamTh9mZQ":{"text":"This place is trashy.   If you aren't tatted up or have piercings coming out of your eyeba","useful":1,"cool":0},"acJm1tLnliJAiiA2nHbZcA":{"text":"I came in for an order of food to take back to my hotel room, and while I was waiting for ","useful":9,"cool":1},"NKfjl4aGUWkCiAFLNVrkyg":{"text":"Dive bar with above average bar food! Po Boys were not bad at all (Alligator Sausage was p","useful":0,"cool":0},"yRRUVVMGO3jiaxgcjBhjaw":{"text":"Great Time, Gator po boy with sweet potato fries! So good and cheap 2 dollar beers and the","useful":1,"cool":0},"G2f0tbwTTmUP3ebE0UTCMA":{"text":"The oyster po'boy was great but I was disappointed with the cochon du lait (pork one). Goo","useful":1,"cool":0},"orPSiz92I81DcS6-jZaFXw":{"text":"their po-boys  are really good. it is very dive-y bar so if you are not into dive bars sta","useful":1,"cool":1},"xfYc0RSQjfFB0W1y-qUgKQ":{"text":"Sad, horrible service, bartender forgot to put order in and when she did the cook forgot t","useful":0,"cool":0},"igYEzppHcqH57gBO6zWAiw":{"text":"Great food and good drinks... this is a hole in the wall locals place so keep that in mind","useful":0,"cool":0},"1k2xvECL4FEizR78gDbZBw":{"text":"After a long day of traveling, all we wanted was quick, cheap food and a beer. Steps outsi","useful":0,"cool":0},"rSBLSg8ASrf1VbicpPR54w":{"text":"The cockroach on the wall should have scared me off. But hey this place got 4 stars right?","useful":0,"cool":1},"2SIYPajb6z3XYlUZ4z_qdg":{"text":"The Cuban was greatness and who would have know that such great food could be had at this ","useful":4,"cool":4},"-CYBQXKYxZJCBWFaOWlrhg":{"text":"Great little place right outside Canal street across from the Roosevelt hotel. I'd recomme","useful":0,"cool":1},"J37C2ejv5MgmwMROtbOs1w":{"text":"Come here when Amanda is working! Best time I've had in the 5 nights we've Benin here.","useful":0,"cool":0},"v_wHCPgH6tBt3BxhSPQ59w":{"text":"Was looking for a place to hang for a few hours before our flight home and did not feel li","useful":0,"cool":0},"EqtOcNfoyjd-j_sZ9wjBiw":{"text":"Excellent food and service.  Little place, but friendly and cheap.  Have the red beans and","useful":0,"cool":0},"lgozqmFz61WPXPdKWjuieg":{"text":"Amazing late night dinner! We had the crabs legs, red beans and rice and the boudin balls.","useful":0,"cool":0},"gLIkuiIrX4JcYC8XeiKAaQ":{"text":"Hidden gem! I recommend the Cochin de Lait, onion rings, and jambalaya! It's a 21 and over","useful":0,"cool":0},"PizT-Rr3b58q2NfjTAolUQ":{"text":"Total dive bar but when all you need is great drinks, made from scratch food, and a friend","useful":1,"cool":0},"WAYogENusx-Ki29kkxNNsw":{"text":"Great dive right in downtown. Had a fried chicken po boy and a few drinks. Food and servic","useful":0,"cool":0},"Wlr0CneESXv8tGcYoqs6yw":{"text":"Cajun Mike's was the greatest bar we visited in New Orleans. We liked it so much, we went ","useful":1,"cool":0},"fEmB5u5-IUuGkJah9-rACw":{"text":"Sat at a table for about 5 minutes, no one greeted me or my significant other. So we moved","useful":0,"cool":0},"9A7cHJZBGCanoSLFUwQxqg":{"text":"Had my first Po' Boy here, would recommend it to all, those rolls are amazing . The servic","useful":0,"cool":0},"3bQmGj3jGNmpj5gXvyrtrg":{"text":"This is a typical dive bar. The food is typical bar food, but well done. Lots of regulars.","useful":0,"cool":0},"ehRFUyKFuB4ybztycpF-IQ":{"text":"Don't bother!  So, where should I start?  \n\nThe food: we ordered boudin balls that were go","useful":1,"cool":0},"FipdLJdkcbVpqeLNzUQtDQ":{"text":"Bought a Groupon and here we are. We parked in a public parking lot about 3 blocks away, n","useful":0,"cool":0},"ah6X-GyiLicyyYUH5knBhA":{"text":"This is a total hole in the wall, but what I was looking for during lunch on a business tr","useful":0,"cool":0},"dE3aTP_A19QbGy_CzmsLvw":{"text":"Coming from Austin where there is a smoking indoors ban you have to mentally prepare yours","useful":8,"cool":5},"VVs3MQcYCWawO45BK7ZHcA":{"text":"This was our first stop on our New Orleans adventure for Mardi Gras. One of the parades ha","useful":0,"cool":0},"kLtGkzs3FuFDw-7tKLwQ6Q":{"text":"In town for a conference...got in late and wanted local color without braving the Quarter ","useful":0,"cool":0},"DijcTSSr5abp5rvjHgqBbw":{"text":"First place we visited for a drink and bite to eat based on the reviews. Upon arrival we w","useful":0,"cool":0},"m5K9FIdl5Kc0rVgcZp7H5Q":{"text":"Dirty, went here for late night snack and my girlfriend ordered a margarita that had a ROA","useful":0,"cool":0},"nm5mXpDmKQA7A16RKI9ROA":{"text":"besides our hotel, this was the first place we went in new orleans.  we had been driving a","useful":0,"cool":0},"871W8oubgviS2fv-RRnu7g":{"text":"Flatscreen, fresh bar grill eats, Guitar Hero, PBR on tap, and whatever's on the iPod - a ","useful":1,"cool":0},"NjwK1eUvNqKGnhf2M_gwyw":{"text":"Walking down baronne street, this little hole in the wall probably wouldn't be any out-of-","useful":0,"cool":0},"S3KchwLjyY7CY7YrzyzGuw":{"text":"The bartender, kitchen, and patrons were warm and welcoming. Although this is a bar, the f","useful":0,"cool":0},"hsF4PDZSyF-SjE-8TkGiYw":{"text":"For a dive bar it's really great! The bartender made it the best though, Gloria! Not only ","useful":0,"cool":0},"EuxSbK-cT8k9MnjeLvWT-A":{"text":"stopped by on my way back to my hotel. \n\nNice divey atmosphere with very a friendly barten","useful":0,"cool":0},"lTApKZnt0eCgIxJt30Zlug":{"text":"This was our first bar as the only non-local. Aligator sausage was great.  So was red bean","useful":0,"cool":0},"X0LjbQMgMSbwykuMc2x0RQ":{"text":"Great place to hang out, chill, enjoy great food-drinks and company.  I'm not a local but ","useful":0,"cool":0},"vih3Igi65hZwCEmBMOvd_A":{"text":"Total dive. Surrounded by hardcore bikers. Awesome Cochon de lait po boy. Enthusiastic bar","useful":0,"cool":0},"S_909z_lv2qK0r0qbliqHQ":{"text":"Excellent food, cold beer, great service. What more can you ask for? Perfect spot for a qu","useful":0,"cool":0},"iEjlViX3OqRuuCQnrKhA4w":{"text":"Nothing was very special about the food. I had the shrimp poyboy and the gumbo. The bread ","useful":0,"cool":0},"8-fRcNz0HDQ_WJ6JDSPXMw":{"text":"We spotted Mike's on our Happy Hour app and were glad we did. It was by far the least expe","useful":1,"cool":0},"W7pv9nRGnnmvUB-eACeInw":{"text":"If your looking for a French tool with deliciously fried French fries pork and cheese stic","useful":0,"cool":0},"AqHC2iKqzvyID_JA64ymSw":{"text":"Great place to go for happy hour or anytime. Happy hour however has $2 wells drinks and gr","useful":0,"cool":0},"ds_jwaGVVQ2OT5GfjBxG4A":{"text":"We were visiting from Jersey and went here twice! the food was delicious and the staff was","useful":0,"cool":0},"RxTnx7wA4VFfTo6lKTrDTQ":{"text":"This was the best lunch we had near the French Quarter at any price.  Nice dark, comfortab","useful":0,"cool":0},"fFacme_WTfTAa3rne98fIQ":{"text":"First night in town and we were tired from our journey. We wanted something fast and cheap","useful":0,"cool":0},"8xfD3gaBsAJrPZ8UJbWiIw":{"text":"Alligator sausage po-boy.  If you get this, I think you will find the fulfillment in your ","useful":3,"cool":0},"1NaQiyd8UOm_mcslE8kbMg":{"text":"Stopped in for some post drinking breakfast (at 1pm). This was everything I wanted in my f","useful":0,"cool":0},"slnXC_Kzib0MI9tI-f2GhA":{"text":"Great dive bar!  Noise volume is VERY loud!  Had the oyster po boy and crab claw appetizer","useful":0,"cool":1},"QndnJipzShWkwrd8NAD6qA":{"text":"If you want cheap & cheerful (and don't mind a smoky dive bar) this place is for you!  Oys","useful":0,"cool":0},"0lViMFyAKkRPNGCpd4Cb-g":{"text":"Je suis allée dans un resto car j'avais trouvé une offre sur Restaurant.com qui donnait po","useful":0,"cool":0},"_4jA_HkfvJPo7YLsPzQfEQ":{"text":"Terrible service at the bar of all places. There was a bug moving around on the bar. Was t","useful":1,"cool":0},"qVvsheNeWp0ToqmyJHvuCw":{"text":"Like most, I was visiting New Orleans.  I have to say, what a great dive bar!  I was made ","useful":0,"cool":0},"g2xz5g60u9S0hjpMYSYbyg":{"text":"Brooke is a shining star and is an example of how to run an amazing establishment.   Great","useful":0,"cool":0},"4PAjFEtXsTUlXegXEupliQ":{"text":"So delish! Love the muffuletta press, shrimp po boy and always the fries. Try the Cochon d","useful":0,"cool":0},"mjLSenHeJjAVHeQlfHuPZg":{"text":"Used a groupon to try this place out and it exceeded my expectations. Our bartender/waitre","useful":0,"cool":0},"FMoXqByTFGHJT6q7UvMhhQ":{"text":"Food is all right. Service was fast. Portions are a little small, and some of the po' boys","useful":0,"cool":0},"qSoS_AfhWs50cG28YDPsCg":{"text":"Meh. I always seem to be underwhelmed with the food in NOLA. Should I lower my expectation","useful":0,"cool":0},"r_DfT64X7Gnw63SFf4dBqg":{"text":"An amazing dive bar.  Try to go on an off-night when it's not super busy, and get the crab","useful":1,"cool":0},"A-bvfc4YcfZFshtEnxyR3g":{"text":"Solid food and drinks. \n\nThe gumbo was very good. I also had the gator sausage po-boy, it ","useful":0,"cool":0},"DiZLslbqwjdhaD4NBDhZbA":{"text":"What a great place to stop in! Hopefully Hannah is there pouring drinks and telling her fa","useful":0,"cool":0},"S9P0fHXEWmCVHztQWUz3dw":{"text":"Everything about this place was awesome! The bartender was super friendly and gave us sugg","useful":0,"cool":0},"-rqR1KD-J9tdWgrufCOzyA":{"text":"This place was decent. My husband and I wanted some good pub grub and a beer somewhere tha","useful":1,"cool":0},"arkiPOJaXY-3JcuZlTdNew":{"text":"Nope. No excuses. Food was below average; service an afterthought.","useful":0,"cool":0},"OPMHG-DvxlK2sQRMf4VbYA":{"text":"I'm basing this off of food quality and service not on the fact that it's a bar but it was","useful":0,"cool":0},"7OekVh1SrafkLvIPQoL9cQ":{"text":"Only in New Orleans could a Dive Bar have such amazing food!  I'm still daydreaming about ","useful":0,"cool":0},"pPF72C11WdZKROMXkhb2Vw":{"text":"Amanda is THE best bartender ever! Thank you for bring so badass! \n\nThis was the first bar","useful":0,"cool":0},"uZuESuMFPQ4TQgt3V-gFYw":{"text":"I gave this place 3 stars. The food was just okay honestly. In my opinion the flavor it do","useful":0,"cool":0},"y76yIztUjEi9VLvyWWyYvg":{"text":"I will say never judge a book by its cover. The  food and drinks definitely on point and w","useful":0,"cool":0},"WQJvt-ZRT6dnJHM9BtN-xg":{"text":"Small hole in the wall. Super friendly staff. Better than expected food, though limited dr","useful":0,"cool":0},"4_8dcvwnt3SBNhq-Idms5A":{"text":"Food: 3.5/5\nAmbiance: 3.5/5\nService: 4/5\n\nSo this place got rounded up to a 4 overall. Mai","useful":1,"cool":0},"x4P4OXioyyLk9cbzbMqI8w":{"text":"Fantastic alligator po boy and blonde ale. Lively atmosphere and great music. Only downsid","useful":0,"cool":0},"0Us8lFpsKl9k2YHpxZglmQ":{"text":"My family and I stopped by looking for a Bloody Mary and some food before the sugar bowl. ","useful":0,"cool":0},"EJIAcPEVsNcQsiWdXvWP1w":{"text":"A cramped hole in the wall dive bar. The chicken wings and mozzarella sticks are fried to ","useful":0,"cool":0},"q1Rphy26g6XcHkim5F7hGQ":{"text":"A chill dive bar, where a lot of regulars come to hang out. We went on a Friday afternoon.","useful":0,"cool":0},"p2azBsgHFne7q4L9PQNs4A":{"text":"Terrible service, my group was completely ignored when we walked in the bar. When order wa","useful":0,"cool":0},"vnkQHnAl2hk70K33aUY4Fg":{"text":"We had a great at Cajun Mikes. I had red beans and rice. It was great, lots of flavor and ","useful":0,"cool":0},"_TaVZmBIrExvxjcXl9oRbw":{"text":"This place is phenomenal!  Great atmosphere, great food, cheap.  Highly recommend. Mary th","useful":0,"cool":0},"rUU9t-AewmQaZwv6ityxHg":{"text":"Casual and quality.\n\nEnded up at Cajun Mike's by virtue of it being open late and not too ","useful":0,"cool":0},"7VNsNXzxuP5PPrQmTMsqeQ":{"text":"The place is the definition of a dive... We walked in at 11:30 on a Friday in June and wer","useful":2,"cool":2},"7CnfqYhNx5cnW3jy1pQRUA":{"text":"I had friends visiting from out of town, and we had just been dropped off at their hotel i","useful":0,"cool":0},"XR6PtE1UzubawWK7tFWWvw":{"text":"After reading other reviews, we decided to hi this place up. It was down the street from t","useful":0,"cool":0},"Sf-ACnGDtArr6AeDkUMp3A":{"text":"Alright, so I arrive in New Orleans on a Sunday afternoon and immediately decide I need a ","useful":2,"cool":2},"uuAKpSrQgbORQtCYjeNkNg":{"text":"Such a dive!  But they serve alligator sausage and alcohol!  We stopped in after 9pm on a ","useful":0,"cool":0},"Dioh_0pBmwMcVqwju-zDhQ":{"text":"Great neighborhood bar with good food. Seemed like mostly locals here (which is a good sig","useful":1,"cool":1},"3Q68vmFVzgwHq43JK7DD1A":{"text":"Below average at best. Nothing special about this place. The food isn't very good. And unl","useful":0,"cool":0},"HO2cTkp84MbuKBCuOTvIYA":{"text":"This place is legit. Good music, great food, and best of all, awesome people! Order the cr","useful":0,"cool":0},"PDYQE4sQq_ol2zG38eV9ig":{"text":"It's a five star dive. We hesitated going in because it is most certainly the diviest of d","useful":1,"cool":0},"MOAyziYezHnRB-Jb4RjhZA":{"text":"Rather average. The bartender was great, but we waited on our food quite a long time, and ","useful":0,"cool":0},"nmlnqSF1bmm9pqIXBFVzdA":{"text":"Perfect little bar/grill.  I got their Cochin de Lait.  Perfect!  It's kind of a Cuban wit","useful":0,"cool":0},"PsEvdMAjoLY_Hoqq00BR6A":{"text":"This is a dive bar but it's a five star dive bar. We are in NOLA for four days and we've b","useful":0,"cool":0},"raEVvcu3nCHedRZFK8WehQ":{"text":"I'm not sure how Mike's got 4 yelp stars but this was the WORST meal and service I receive","useful":8,"cool":1},"He3m947HiKc4sQ2Z64uzOA":{"text":"Do yourself a favor and don't even bother with this place. We were going to give them a tr","useful":0,"cool":0},"7Hcs7xaSVG06ubtE74Betw":{"text":"Had the Cuban. Pretty big and very tasty. Also has the boudin balls. Those were good a wel","useful":0,"cool":0},"s4ExHJil-grOyckkQf0oPQ":{"text":"We were given a Groupon as a gift to this place for our trip to New Orleans. On our second","useful":1,"cool":0},"CMz7jpqOWye1tasu9L3ZmQ":{"text":"Walked in and was hit by a STRONG odor of litter box and cat piss...not sure if they're ca","useful":0,"cool":0},"vyL7_0bgPU-YuzfXoccT_A":{"text":"Charming little dive-ish type place with good food.\n\nI had the muffaletta (no bread, no ch","useful":0,"cool":0},"nDsjsRxN66049-Npp40eIA":{"text":"Came here for vacation and got a taste of some great New Orleans food without the packed t","useful":0,"cool":0},"QeQJXh6iTDkUmJ1k7CJO6Q":{"text":"Rude bartender.  She was too busy checking texts and flirting with a drunk male patron.  F","useful":0,"cool":0},"7Z36RQwweFygjQ1UHVte-A":{"text":"great burger and fries. although the fries are extra as a side order. but still priced ok.","useful":0,"cool":0},"2ASOVX5JtmQzMcH1LNr5pQ":{"text":"Had catfish basket. It was uneventful. Bartender was out front drunk with patrons. Not imp","useful":0,"cool":0},"KP96tGG3HkuiEJRqaFB3UA":{"text":"This is a real dive bar. As long as you get that, you'll be ok here.  Cleanliness and nice","useful":2,"cool":2},"wVqfxIcs8IFn7ZvHI_qCvw":{"text":"Cajun Mikes is fine. I did eat the best shrimp I've probably ever had there on Thursday, b","useful":0,"cool":0},"U-NO2Fu1j3uzGWfEvfW_DA":{"text":"Incredibly friendly staff! Laid back, local atmosphere. Avoid the bougie places; came hang","useful":0,"cool":0},"QgTN5SmHnEChZjkuW7A9-w":{"text":"This was such a great find!!\n\nI brought five friends to New Orleans last week, and we defi","useful":0,"cool":0},"6ySYD7yGR6LN_FHU9cASsw":{"text":"Wow what a great late nite spot.\nExcellent fried oysters, wings, and believe it or not, Cu","useful":0,"cool":0},"2ZRoHyhPdYVTD9wEwz8MvQ":{"text":"Been here before but didn't write a review. Good food. Ok service. Will probably come back","useful":0,"cool":0},"9wMgPZFIyPbgAUXZACoKhQ":{"text":"Don't order the fried shrimp basket...anywhere in NO. From what I can tell overly salty.\n\n","useful":1,"cool":0},"kf1274ULqFlyA0n4dcdskw":{"text":"A dive bar that surprisingly served food. I had a beer while I was waiting for my order an","useful":0,"cool":0},"tNVTBeJXt63HGhEXLZmQvw":{"text":"Had great red beans and rice.  Fried Shrimp and a pork sandwich.  Our bartender and host d","useful":0,"cool":0},"3mT74O97hVFj-ImKGZw4og":{"text":"Food is alright. The service was fine (both could be better). Portions are small so won't ","useful":0,"cool":0},"q23wAGi3jP9cHZwrUGu_Yg":{"text":"This is a total dive bar and cheap as all heck (especially in the French Quarter).\n\nOyster","useful":0,"cool":1},"BMKuoW4lurdCfsw1Et30nQ":{"text":"Pretty middle of the road bar.  This rating is for the food more than the barside of the o","useful":0,"cool":1},"Pa8-jRbh-o-CGgpyZDM6Jg":{"text":"Went here to try the cochon de lait sandwich. Pulled pork, french fries on top, and a grav","useful":0,"cool":0},"G2_dNfP79A7zUqPdqPUouw":{"text":"Nathan was our bartender and the service was great!! Great food, great prices!Happy hour f","useful":0,"cool":0},"6AusWmNoIS--s1kkTAVxEA":{"text":"If I could give this place NEGATIVE 5 STARS I would. Customer service is terrible. Homeles","useful":0,"cool":0},"86RL3XIjWmg8F9AjbTNUrQ":{"text":"It's easy to miss if you don't know it's there.  A very small hole in the wall that's dark","useful":0,"cool":0},"fmPmXDstIJGyIUg59fbabw":{"text":"Cheap drinks and the food was ok. The girl behind the bar was friendly to everyone but us,","useful":0,"cool":0},"fNwnPaEEClJUdYW0hA3rjw":{"text":"The service was awesome despite a crowded bar with the Patriots game on. Server was great,","useful":1,"cool":1},"IEmnFcBoIzZ6Ezkq1rH4vA":{"text":"Seems like a locals place in the FQ. Bartender was the drunkest person in the building, ab","useful":1,"cool":1},"n4aKVzXHmFsk_OMKM0SEhw":{"text":"Some of the best food I've ever had. The chicken and sauces are amazing. Service was great","useful":0,"cool":0},"rGVnTY1aMg7NdyZ2pP-q5g":{"text":"Used the groupon while on vacation in New Orleans. Waited about a half hour for 2 sandwich","useful":0,"cool":0},"lWkuijU7KLdLPxe2sqN9pw":{"text":"Holy Salt Lick! I read some reviews on this place and man were they right about the heavy ","useful":0,"cool":0},"dCbrTUIrMGlU6pqbp34Ukw":{"text":"We got there just after the kitchen closed, but the bartender (possibly owner?) graciously","useful":2,"cool":2},"V1vq7jODg8JkJB7mYxd1gw":{"text":"This is a dive bar. The service was a bit mediocre. The order taker was the bartender. He ","useful":0,"cool":0},"1ijO7X8tgi-PpSc18vhJQg":{"text":"Divey, well priced,  great service, great food. Po'boy wasn't as good as NOLA Grocery - br","useful":0,"cool":0},"-rYkBJwCXOr6kLnIhPfh6w":{"text":"Delicious drinks..Omg those shrimp po boys and sweet potatoes fries..yummy. ..The waitstaf","useful":0,"cool":0},"Kk5x-fueFnFsR0tqm1t-ng":{"text":"5 star dive bar. It looks a bit shady from the outside but when you come in you'll find ch","useful":1,"cool":1},"VunPop9VOCh3AiCz_HFO_Q":{"text":"The food and drinks are really good here!!! I was pleasantly surprised. The crab claw is S","useful":0,"cool":0},"QC36lwoxSOolv2BdSYfu7g":{"text":"This was my first stop in NOLA. I came because it was number 1 on the Yelp list and becaus","useful":1,"cool":1},"pD3IkgsIl_xXyUAFEuJyQA":{"text":"I've been to this bar/restaurant twice and both times I have left feeling like I didn't re","useful":1,"cool":0},"iRrZ9hXTLkQHalVu6jpdow":{"text":"Sat at a table for 10-15mins - no even came over. If you sit at the bar you may get some a","useful":1,"cool":0},"eTr9AEP3OUQ86OGXJ-L06g":{"text":"\"Great place. Hole in the wall. We went because of these reviews. I had the gumbo. You won","useful":0,"cool":0},"NM5EMCqJkgMASIXHQpjptw":{"text":"AWESOME little local bar. This was my home away from home for a month. I sat at the end of","useful":2,"cool":0},"3JrjEY6U3z7Hdrx6vaG79g":{"text":"At first we were skeptical because of how the place looked and the seating but the food wa","useful":0,"cool":0},"Kx0D8t5oHpmqlumqxzKxdw":{"text":"Service was slow but the drinks were strong. The gumbo was very tasty. Located a half a bl","useful":0,"cool":0},"i9K76qZUhYPuewhNJpeRoQ":{"text":"Could be perfect for Diners, Drive Ins and Dives.  Great food, awesome staff. Would defian","useful":1,"cool":0},"1cMYmRf6erho3tHjvhhYoQ":{"text":"If you're looking for tasty sandwhiches (we had the cochon poboy and muffuletta press) and","useful":1,"cool":0},"3SYsHMIGC7lj4do8I362ug":{"text":"This place was such a welcome site; no tourist trap here.  Super informative & nice bar st","useful":0,"cool":1},"30_YTJ-ui1u1ixuacP040A":{"text":"The food was shit. I ordered a bloody Mary, and it was nothing special. Husband saw four r","useful":1,"cool":0},"777Ue-0BIcIfNlObftYD-Q":{"text":"The diviest of dive bars. While looking for a quick bite to eat before hitting up some oth","useful":3,"cool":0},"ZVejNmmUgm_k7oAjyvNbNQ":{"text":"Joe is full of energy... 5/5. Cuban: 6/5... cochon de lait: 5/5 esp for if you are drinkin","useful":0,"cool":0},"de2N1nondGkwP_o5nLgVjQ":{"text":"Got the fried oyster po boy which was quite good and my girlfriend had BBQ poem which was ","useful":0,"cool":0},"2ebG2RZFhJegUrTbfE_EXw":{"text":"We got the roast beef poboy and the Cochon de Lait with a side of fries. Everything tasted","useful":0,"cool":0},"vAYgOQYxj1p_DNa0zxAZdA":{"text":"Decided for dinner somewhere than the French Quarter. Saw the reviews for Mikes and went t","useful":0,"cool":0},"HnlGEBwvi1Lt_XDTo7WNdg":{"text":"Atmosphere was your typical bar situation. A bunch of older men sitting at the bar.  Not f","useful":0,"cool":1},"0W4BRhlzgPeryIIzWY3Irw":{"text":"Hole in the wall spot for real New Orleans food. Don't be fools it's a bar- the food is gr","useful":1,"cool":0},"__1jtLyQGw3sRlM6veMARg":{"text":"This is a dive bar on Bourbon Street. The locals come here for a watering hole and dancing","useful":0,"cool":0},"bURaBvvW6qjxIX1ktxr0_w":{"text":"A low-key, hole in the wall pub with dim lighting and creaky chairs, but GREAT food! Serve","useful":0,"cool":0},"VX_i5DyBb7JlMXtsNKbaDQ":{"text":"Had a coupon for here.  Wife was hesitant initially, but I thought it appeared to be a reg","useful":1,"cool":0},"paJQxqe2hjW-fcT_UusrrQ":{"text":"We got two poboys one roast beef one and one oyster. The sandwiches were big and the fries","useful":0,"cool":0},"HFlidSMHYVujLhfmC7aQOg":{"text":"Yes it did smell like urine. Yes it is a dive. And YES if you can get over it you will lov","useful":1,"cool":1},"OaXn7qtex3vvcqCNE-3nkA":{"text":"Only reason it's getting 2 stars is because of the bartender. She was a sweet heart  I ser","useful":0,"cool":0},"xZ1cUoC3TxPzVfVndtTUTw":{"text":"This is a cute little dive spot. I had the catfish po' boy and I really enjoyed it. The na","useful":1,"cool":0},"8h-ZknNVac_ZTRaeqo3nNg":{"text":"Cockroaches in the bathroom... couldn't stand the thought of eating there after seeing tha","useful":0,"cool":0},"ucXQAFX9TQuRk_Z4wI-fBA":{"text":"It is a bar that had food. I tried the alligator sausage, wings, boudin balls, and the Coc","useful":0,"cool":0},"RKxrD30J39cJs-UZQSuRoQ":{"text":"The food was cheap but it was ok not great. We ordered a shrimp Po Boy and Alligator sausa","useful":0,"cool":0},"rW-wylhe2oHkJtjMz67ISw":{"text":"Been here a few of times over the years when visiting NOA.  Good pricing for the area and ","useful":0,"cool":0},"DVtxybogxYe3R7oFuwCT6g":{"text":"They pour a strong drink but the food was just not good. Also smoking indoors kinda kills ","useful":1,"cool":0},"jImWnHnfRcxjqu2DiZ-TpA":{"text":"Total dive bar. Totally awesome food. This is not an evaluation of any thing but the food ","useful":0,"cool":0},"OdliS_d7tS7b7d0B7jR4bQ":{"text":"Complete dive!  Exactly what we were looking for.  Cheap drinks, some locals for good conv","useful":0,"cool":1},"o-cHPaeiD328BCCV1fzHxw":{"text":"This is a definite 4-star, local dive bar -- that is worth your while!\n\nWarning:  This pla","useful":4,"cool":1},"JmzIH4xmpeUZaAjZ3neMGQ":{"text":"This has been my favorite spot for great food and friendly conversation! I went with my Mo","useful":0,"cool":0},"7vykAxIm01z4TAeN3H5Uhw":{"text":"Cajun Mikes Gator Po'boy and sweet potato fries were delicious.  The gator sausage was moi","useful":0,"cool":0},"eiExndmXOLfiVVS2G66PRw":{"text":"After reading the reviews decided to give it a shot. I love dives, and was ready to explor","useful":0,"cool":0},"giwGHb5zcoCLw_eX3HMUWg":{"text":"Great food, great hole in the wall bar vibe. Excellent location w/ a banging jukebox selec","useful":0,"cool":0},"eocxJFeFtMEj0CtrDyEHsw":{"text":"I had the pork sandwich -  was chewy and dry.  Why do this place have good reviews?  Maybe","useful":0,"cool":0},"r5vFmoz7a0uqfMC3b8FKYg":{"text":"Little dive bar, but some authentic food. We enjoyed the alligator sausage po-boy and muff","useful":0,"cool":0},"GJ5RheamLk0ygpztKAfAPg":{"text":"Neat little pub.  Very small, forcing an introvert like me to sit at the bar and converse.","useful":0,"cool":0},"qtMzMLf_ILXWFxCPpJj9dQ":{"text":"Had the Alligator Sausage Po Boy and Onion Rings to go. I came during a slow time in the a","useful":0,"cool":0},"ZuTCzgmz8DpahYzqJepwHg":{"text":"Great bar for a fun and local atmosphere. Cheap beer and liqour. Delicious  po boys! We ha","useful":0,"cool":0},"qBSGU0SISyBLBOBPRWQbmA":{"text":"Nice little dive bar away from all the crazy of Bourbon Street. Stopped in around 8 pm on ","useful":0,"cool":0},"fDBLsnYKg-lVCJ8uyB4jtA":{"text":"The best Bloody Mary my husband has had in his entire life!! Thank u Nathan! We will be ba","useful":0,"cool":0},"sdnuWaS7sZ7XPUr1OPxOXw":{"text":"Great N'awlins dive bar w/ a jukebox that had credits in it already, strong drinks, lots o","useful":6,"cool":5},"sNocENNeB47q3tDJxXRGHQ":{"text":"Not from the area. It's more of a bar than a bar/restaurant. Ordered at the bar and got sp","useful":0,"cool":0},"JTmXdb5nsl5hWpBROBD62A":{"text":"A little dive bar with decent food.  The cuban was good and so was the poorboy.  The chees","useful":0,"cool":0},"WRZ57m58IF5c5toXKys2fA":{"text":"The bar food at Cajun Mike's is better than the gourmet version in other cities.  It is cl","useful":0,"cool":0},"HoNzSwdgO4oPNbsUgBrHsw":{"text":"The food was meh. \nThe cook got all of our sandwich orders wrong. \nThe bartender was full ","useful":0,"cool":0},"BzSzGkPBeTObJmDiRA4VPA":{"text":"You'd think it wouldn't be THAT hard to find restaurants open on Christmas Day in New Orle","useful":1,"cool":0},"E9dRVhNCwwbuMZdiu04svg":{"text":"Not sure how this place got so many good reviews.  We ordered the spicy chicken wings, chi","useful":0,"cool":0},"n7SkGVbL89W6jx8Daso3YQ":{"text":"I would give 3 and 1/2 stars if I could. My husband and I came for lunch. We got the wings","useful":1,"cool":0},"OtH5qQb8c3Vd8QC5mFm1WA":{"text":"Bartender was so intoxicated and rude. We continued to be mocked and ignored even though w","useful":2,"cool":0},"K_W5oG9HTZrbhmQX01qkvQ":{"text":"Used the groupon for $10 two beers two sandwiches. If this deal didn't exist I wouldn't go","useful":0,"cool":0},"jugvbz-SRj3NQBm8rc8bSg":{"text":"I'm here on a business trip from Los Angeles and I never felt at  bar like I'm home... cam","useful":0,"cool":0},"MksvduQy1R2C24P91yJR3A":{"text":"They don't use real French bread for their poboys. The price is low for Canal street. Okay","useful":0,"cool":0},"YeaakpzGDeUyOsY4of3ekA":{"text":"Definitely a dive bar. We had the appetizer sampler which was a great deal! We got the cra","useful":0,"cool":0},"N9g2nFGFs-lrqTP95fvR6A":{"text":"Food: very very salty, barely edible.\nService: non-exist. A fellow customer brought us a m","useful":1,"cool":1},"mvsuBEKF0RnTnn36CEqMwg":{"text":"This review is for late night take out. \n\nLet me start by saying that I'd stay here and ea","useful":1,"cool":0},"qpAGOLXdENL4vr20W6AObA":{"text":"This is a great choice for those staying at the Rosevelt across the street that want a ver","useful":0,"cool":0},"nrdcIv-bgDt04Uc0kwKe0w":{"text":"Staff was okay, a few TV's showing sports.  Solid 3 1/2 stars for a dive bar with good foo","useful":0,"cool":0},"9mhVEOU6xMdfHxlna_DobQ":{"text":"The bartender was awesome, we didn't ask her name. She was short, sweet and spunky! The fo","useful":0,"cool":0},"7LfCyS4_1iHJwe6WNM6m-A":{"text":"This place was fine, service was okay, bar was sticky and the cloud of smoke could have kn","useful":0,"cool":0},"S_BPvjPd-r-y0OP0JaeRtA":{"text":"A nice, quaint laid back local bar that we just happened into. The drinks are pretty fair,","useful":0,"cool":0},"mXluBJadj3e7k62bBCVIIQ":{"text":"Parmesan chicken was dry. Service was excellent. Place smelled of vomit. Young crowd, good","useful":0,"cool":0},"e2Mlzstj76B9q8D1XqG4EA":{"text":"Local people and friendly small bar, prices good, food was super. We ordered 4 items. Alfr","useful":0,"cool":0},"rgJV6FjK8yB3kux13ai52A":{"text":"I really liked this place.  It's a local hole in the wall and reminded me somewhat of the ","useful":0,"cool":0},"isOzNN-0FnhIXo1CD4hHFw":{"text":"Waited almost an hour for a sandwich that was mediocre at best, mostly bread. It wasn't cr","useful":1,"cool":0},"HJtK4UAjePIQEfqWPyTe4Q":{"text":"We stumbled in on Valentine's night, freezing and starving and just wanting something easy","useful":1,"cool":0},"Gownoz63DhTnhZonRVZwqw":{"text":"If the criteria is awesome bloody marys with spicy green beans and killer grub at good pri","useful":0,"cool":0},"56fQZB2zung_jp3UjTWM8g":{"text":"A locals dive bar that sits right off Bourbon and Canal street.  It has the perfect blend ","useful":1,"cool":1},"P34EBVHIlZdLmVbrozNWpg":{"text":"Awesome little dive bar next to the Roosevelt.  Staff was friendly and food was awesome.  ","useful":0,"cool":0},"ZqL6jyFgwUDwNz-2W5jQUQ":{"text":"Love the atmosphere!  Had the chicken and sausage gumbo - great! Then tried the red beans ","useful":0,"cool":0},"WmGKPilBu5XIofWQABAUhw":{"text":"Great service, great prices, and AMAZING food! I had the cochon po boy and my date had the","useful":0,"cool":0},"lgk48i5kZEzLrbYC8HOnPg":{"text":"Best bang for the buck on bourbon street by far. I got 2 meals plus a beer and spend less ","useful":0,"cool":0},"n8hKe2vSTPlCEClLlTodnA":{"text":"Came in for lunch because it was close to the hotel we stayed and it had decent reviews. I","useful":0,"cool":0},"IqqAlTgLqYDlI804BtDz-w":{"text":"A dive bar with charm and an almost anachronistic high-tech jukebox. The food here was ine","useful":0,"cool":0},"QKagZeUv4KqGtG2fVAgoew":{"text":"This place is a great getaway from the French quarter. The location is great. Good food, g","useful":1,"cool":0},"xMWOHPjzMIs15PoPIbZsXg":{"text":"For my second time being in New Orleans, this was the jewel. I yelped to see what was in t","useful":0,"cool":0},"DbOWWJiBNyqk9LRNf-eU1A":{"text":"From Australia, its a dive bar, the food is great the beer is cold and the barmaid is surl","useful":1,"cool":0},"ON54xHrFOcfPusp0xJuCiw":{"text":"Good food, affordable, enough TVs to easily enjoy the football game. The cook even came ou","useful":0,"cool":0},"lskUj4pTj_fi9ZBiy7AfDw":{"text":"best food in NOLA!\n\nthe beer and bourbons selections is also quite good.\n\na must go!","useful":0,"cool":0},"r0rhBFAo9CB--9a-IY4BbQ":{"text":"Food was great! Prices were amazing!Service was pretty bad though. They were nice but supe","useful":0,"cool":0},"zEgrGwjxMEGWLPGOE3AwSg":{"text":"Visiting from San Francisco.....food was OK for being a bar....service was terrible. Rache","useful":0,"cool":0},"WDBrOlAnUf5JxpFU5F0Qpw":{"text":"Mediocre bar service, would be unacceptable anywhere else. Waited 50 minutes for food, I k","useful":0,"cool":0},"tnGeocaEPq5vNVZxQgYjmA":{"text":"Pretty great dive bar as far as dive bars go. Much kinder on the wallet than anything acro","useful":2,"cool":2},"jZM6CAAPpreLNUaRuvZUag":{"text":"Cajun mikes is the best for alligator sausage po boys! \nLove the low key vibe and the musi","useful":0,"cool":0},"MrcGMl0YqMpNBAqh_6YiBg":{"text":"Ah ! Cajun Mike's ! It's been too long. I used to visit this bar every night after work fo","useful":0,"cool":0},"e0NRTQsoLgtbkM1E-J7yqA":{"text":"Four years ago I attempted to eat here with a friend and was not served after more than 15","useful":0,"cool":0},"fTM8XsZeuQonqnZA3yvHGA":{"text":"Straight up bar food. No salads on the menu....although it's listed as a restaurant, it's ","useful":1,"cool":0},"pgw00_0PbcdInJg4yy_5Bw":{"text":"I miss the Cochon de Lait Po Boy already. It was such an amazing sandwich. Tender pork roa","useful":0,"cool":0},"z5R-ri5CdpJHSqgucnYqEg":{"text":"Great hole in the wall. Ordered the shrimp po boy & the Nola ipa. Good food, cool bartende","useful":0,"cool":0},"EOIF6ggYxwnre1J6k900jA":{"text":"I tried the jambalaya it was full of favor and spicy!! My husband had the grilled chicken ","useful":0,"cool":0},"E53vm-OjnIdbECr2-r9_hg":{"text":"Good beer, the crawfish is hot and the guard dog is great","useful":1,"cool":1},"B04QUI5G_PrboY4ONNqIKQ":{"text":"This is primarily a bar. I had the BBQ pork sandwich tasted oddly familiar to the BBQ pork","useful":0,"cool":0},"Vrn5mln1ywI-lKii-MlXzg":{"text":"Stopped into this place to watch the end of the OKC vs Golden State game & I wish I would ","useful":0,"cool":0},"mp64FWUhMI3dRmYyrNgSAg":{"text":"Come for the happy hour, stay for the food.  \n\nSome of the best priced drinks and best tas","useful":0,"cool":1},"lE2Awa4Z3UL5WW5PfW9a5A":{"text":"Small dive bar/restaurant with a moderate menu, and great food.\n\nMy wife and I both had Po","useful":0,"cool":0},"12i9q4FIPoMQnsJUMMMCYA":{"text":"Best Bloody Mary that I ever had a must go to spot for food and drinks!! Stop here if in N","useful":0,"cool":0},"y4H4XT_b7G6e6y6BbwCzYg":{"text":"I rarely write reviews because typically when I go to a restaurant I have had close to the","useful":1,"cool":0},"PWFSAPuPV09DN1gmxCdamg":{"text":"Gumbo was really good, smooth, tasted homemade. Boudin balls were ok. Very good price. Ver","useful":0,"cool":0},"uUcpN_7_n7fyFyjN9Mxj_A":{"text":"I didn't drink here so I can't comment on that, but I did come in for a to go order of a b","useful":0,"cool":0},"ILc4-UybuDmXglT6HlAIew":{"text":"Probably the best way to get an intro to the AWESOME city of New Orleans is to start off w","useful":0,"cool":0},"GgMa2-r71Dsaw6yUnaxwfA":{"text":"Good shrimp po'boy, lots of lightly breaded medium fried shrimp on fresh bread. Served wit","useful":0,"cool":0},"1m-BvvCmw_e8xCXaTs2mHw":{"text":"Someone who will remain nameless si sign into my account last night and wrote a false and ","useful":0,"cool":0},"7TERpk78Z0wpYRYQQAOYsQ":{"text":"Wanted to grab an inexpensive Cajun lunch and opted to try Cajun Mike's based upon the rev","useful":0,"cool":0},"D3ulsbR884eblA8Rw-J3CA":{"text":"I ate here twice with my girl friends while out in New Orleans. Great dive bar across from","useful":0,"cool":0},"amX0jXXgLVQJR7YksK6fTw":{"text":"This is a nice local bar just off Bourbon but seems like a world away. They had some decen","useful":0,"cool":0},"8CIXKek2yXGimXozliodEg":{"text":"While the staff was extremely helpful, the sight of viewing a critter crawling on the mech","useful":1,"cool":0},"G1mHxkYib-Txz7UNbFF8Vg":{"text":"Good food, small bar, enjoyed! Sampler platter was great! Cochran de lait poboy was fantas","useful":0,"cool":0},"_9hLJ2ate_RU-TcijBkV7A":{"text":"great poboy. cheap beer. only drawback is smoking inside.","useful":0,"cool":0},"nhso9lIJrX3WoIvE2UJgNg":{"text":"3.5-4 stars\n\nWe came here because all the close-by restaurants were crowded and we wanted ","useful":3,"cool":0},"xRQ5OVMD3rUjQBxb5AuY9w":{"text":"Excellent poboys!  Had the shrimp poboy and the Cochon de lait.  The flavors of the roaste","useful":0,"cool":0},"QvHnXenxTeETzYgc8O6LnQ":{"text":"The only reason I give this place a 3 is that the bartender Amanda is rude, pretentious an","useful":0,"cool":0},"r3cPOaxnj1TYCquX5epU5A":{"text":"Cool little local bar with decent food. Burgers are better than the local fare like gumbo ","useful":0,"cool":0},"29SppU-yCsGqsIh2A54bEg":{"text":"The wife and I stopped in for a quick bite while the lsu game was playing last weekend dur","useful":0,"cool":0},"vqjtoF2jZPCqw-RzFmREtw":{"text":"The Cochon De Lait po boy was THE tastiest bite I had during our week in New Orleans. \n\nJu","useful":3,"cool":0},"RfXG3Tim5ZbV0Nd10Sh5JA":{"text":"A few friends and I had a long day and were hoping to have a good time at dinner and drink","useful":5,"cool":0},"7_Iy4LyDudi8F4LltMDyTQ":{"text":"Bartender is extremely rude.  Sat down and ordered a sandwich and a cockroach ran across t","useful":1,"cool":0},"W-_C2gX6jFPiQUsSQsnRYw":{"text":"Always awesome.\nFrom pensacola and I come here every time I'm in NOLA. Cheap drinks and go","useful":0,"cool":0},"y29m5Kh0HbPWiPRLmxoG-A":{"text":"OK, this place is a serious hole-in-the-wall, dive bar. Quite possibly the div-iest bar I ","useful":0,"cool":1},"vTRBF2FQQ95iuT5ew1vWkA":{"text":"We went here for some quick and tasty pub food. Ordered the boudin balls, fried oyster bas","useful":0,"cool":0},"Y-UxpSTXMHvPJdPNTJmqww":{"text":"Hannah was awesome. Great conversation and great prices. Also, the cheese fries were AMAZI","useful":0,"cool":0},"goT3URoM0EX82XLR6sgZNw":{"text":"Was in town for the weekend and found this place on yelp. Cochon Du Lait was fantastic. Al","useful":0,"cool":0},"7-pXNGd2HxEkhFWpFS6XOQ":{"text":"This was a fun small five bar that you wouldn't expect to serve real food, but they did. W","useful":3,"cool":1},"VfKtSwDZpEn5un2qp9B5kQ":{"text":"#Skipthisplace- Oh so disappointed! I don't know who is writing these reviews, maybe the o","useful":1,"cool":0},"_BOaftf1kCeG2-uiTbJ9dA":{"text":"Last night in New Orleans... one last meal before we say goodbye to the awesome food here.","useful":3,"cool":0},"lVJGAPAtzaPAwr4ESb0IZw":{"text":"Service was quick and friendly. The atmosphere was cozy and the food did not disappoint. T","useful":0,"cool":0},"czClcxmD9omi5j0H_UFp-w":{"text":"I went there the first time and it was actually really chill and I ordered their red beans","useful":0,"cool":0},"AZHKY6WsGbe7t34v2AFYPg":{"text":"My wife and I went here for a couple of drinks and an order of boudin balls. Inexpensive a","useful":0,"cool":1},"fNu57zOrmEWBCNkPL1VuEA":{"text":"Don't be fooled with all the good reviews. Thousands of people on the streets and they hav","useful":1,"cool":0},"9WRq6OfpeXPVyNTeWBnzmg":{"text":"This place was a great dive bar right near Bourbon St. I ordered the alligator sausage pob","useful":0,"cool":0},"c37Q3pK16TPemxfYmP_xvw":{"text":"I'll start with the fantastic helpful and friendly service. Love the hole in the wall all ","useful":0,"cool":0},"6k3YJgMZWISXwvV6YKKJjQ":{"text":"A perfectly adequate neighborhood bar, featuring televisions tuned to the current sporting","useful":0,"cool":0},"-eWi4qcb1xw4wojVyUCnMA":{"text":"I love me a good dive bar with killer food. This was it! Po Boy was outstanding. My wife a","useful":0,"cool":0},"F1kCAqJcq3J8ZsVtOeVFSQ":{"text":"Cajun Mike's is a great, less touristy dive bar in the Central Business District.\n\nI say l","useful":6,"cool":4},"mtL6uSWyRjSLoH5BYBdgbA":{"text":"Sooooo.....was really hungry and needed  to get away from the crowd, decided to give this ","useful":5,"cool":1},"ZpzwfAnLKJXzC-7djpeBxg":{"text":"Good food & value. Ambiance is lacking. It's like a diamond in the ruff. Smoking is a nega","useful":0,"cool":0},"Ua8cEBnt0xdQBk1ZUmLaeA":{"text":"I am almost an hour into waiting for a simple sampler platter. An hour. I've had time to p","useful":0,"cool":0},"bGzApXapfO-FYs86cv-Pgw":{"text":"The drinks are decently priced, but the wait time for food is stupidly long. I waited over","useful":0,"cool":0},"7Xu4Vi-fLXE-6AfesFzLDQ":{"text":"Pretty good bar food and priced well. Staff was awesome. I will definitely drop by if in N","useful":0,"cool":0},"qzvef9SGyH-2Ty0OCTLMzQ":{"text":"Someone who I know but shall remain nameless, in very poor taste, posted a very detailed n","useful":0,"cool":0},"0bpxCyPr7_6GQn5f-ZOqIw":{"text":"Okay to look at this place, it's a total dive, but the seafood is super fresh, and worth i","useful":0,"cool":1},"pHzaUiFzBfbdfOYhczR_Xw":{"text":"I consider myself lucky that Cajun Mikes was seconds away from my hotel. The place was com","useful":0,"cool":0},"_aXZQirE7nc1sYeH31fyRg":{"text":"I feel like this place has some bipolar issues. Half the time, the service is great...the ","useful":0,"cool":0},"yyo2RwqtHfmChbp158qOdQ":{"text":"We were visiting New Orleans and stumbled upon this place after midnight at Burboun street","useful":1,"cool":0},"F32sR1ONctOy27PUi0nLUg":{"text":"Kirsten and Nathan provided excellent customer service. Great conversation and great food!","useful":0,"cool":0},"nj4LbAQdhnBTa60uM-jbnQ":{"text":"We had a mission to find some GOOD gumbo in or close to the quarter. We are not gumbo afic","useful":0,"cool":0},"pTkgZjMtMh_UyQ4_tTDQrQ":{"text":"I LOVE LOVE LOVE this place! I was visiting a friend who works at a nearby restaurant and ","useful":1,"cool":1},"3DqGVJ6Nn11dl2ulqCXnzw":{"text":"The drinks were good. Atmosphere cool. Food--barf. I could taste the freezer bite in my wi","useful":0,"cool":0},"IcLlSkLeoeeoLpuYfgVplQ":{"text":"What a surprise this place was. I highly recommend the Cochon de Lait po boy. Don't Google","useful":0,"cool":0},"YAdCpyWLB5_LOjJLHU2JhA":{"text":"\"Hangry\" is putting it lightly. After waking at 2:30 a.m. for a series of flights to NOLA,","useful":4,"cool":2},"chJhIXPGTO9vjxv4QSGefw":{"text":"First and foremost this is a bar. However the food and service is excellent. If this is th","useful":0,"cool":0},"6BjlBrR4Ca1-XrQ9gZni3g":{"text":"I feel borderline uncomfortable at nice places.  I prefer to be in low maintenance establi","useful":2,"cool":4},"8lesoEa3uPzdK5y0waDutw":{"text":"Great local bar, exactly what we were looking for, for a small bite before our late dinner","useful":0,"cool":0},"YbtdPo6afDxhfKe-Y3FUsw":{"text":"My girlfriend and I were walking around trying to find something to eat after traveling to","useful":0,"cool":0},"onM6bfCwS7Y3ubO97zsLbw":{"text":"Stumbled upon this place while looking for another which seems to have either closed down ","useful":0,"cool":0},"0ROkFlYh1D8JoXV8p9i7CA":{"text":"Customer service is great and they're fried sampler appetizer are great! However - I got o","useful":0,"cool":0},"b_jRBEOjMLicGiwSxdlpXg":{"text":"I've no idea how this place is as highly rated as it is. I was here for a visit, and all t","useful":0,"cool":0},"UYu_3WbA6DvP2pg0sdP9yQ":{"text":"Sure wish there had been some sort of info posted on door, web site etc to let folks know ","useful":0,"cool":0},"oz2lPfpXX5gZhoL9zc_z-g":{"text":"After reading the reviews I just had to visit this place and try out the food, They were o","useful":0,"cool":0},"RTvzzVVhSm_gJpRIpIiIUg":{"text":"Bottom line: five stars for the food, one star for the bartender. Average them together, a","useful":3,"cool":0},"c6-L2On_VipB4a5t4xZxRg":{"text":"Food was great and good service. Sat at the bar and ended up with a great\nMeal. Had the ja","useful":0,"cool":0},"7nEA9gew5RcdpM73-yrgNg":{"text":"First meal in NOLA and close to hotel but not fancy. Delicious Jambalaya soup and Muffalet","useful":0,"cool":0},"HWDTbYSz48jHZ1ZQv1ADTA":{"text":"Awesome dive bar with very friendly service and great food. The bartender Mary couldn't ha","useful":1,"cool":1},"j5XykxfuRT1JJ-DVMlx_mQ":{"text":"Great food, good prices, awesome bartender with a chill and laid back atmosphere. I had a ","useful":0,"cool":0},"9Svt1K4igUpy9FTBjcyWHg":{"text":"Dive bar with kitchen. I would go back. Lots of drink options. I walked in when two drunk ","useful":0,"cool":0},"FSJJZEfuWiUGHxIZa0U0RQ":{"text":"I love a good dive bar, but they're hard to find. This place has it all. We were looking f","useful":1,"cool":0},"FRoK9o1Dr9EWL4VXgx0aXA":{"text":"Stuck in the Tulane Medical Center?... Help is nearby!  Tasty boudin balls with the necess","useful":0,"cool":0},"E2mipRgYDn3CT5mUtDsaEw":{"text":"Food: 3.5\nSmoking in bar: down to 3. I'm not a fan of that.\n\nI've been hearing all about t","useful":0,"cool":1},"qL_oixa_QAzw71ketgS2Hw":{"text":"Good neighborhood dive bar in the CBD. Cheap beer and sketchy locals, the company of which","useful":1,"cool":2},"u3dqxbDwiAiGHJcJYcMftA":{"text":"Great dive bar with very good food. Within a block if canal street but away from tourists.","useful":0,"cool":0},"VYuM5qAugLFwwFrfCcZABQ":{"text":"Decent food. Fair bar prices. This is a dive bar like I am used to. Not your classic new O","useful":0,"cool":0},"JjBBrMqZf9ddjXDC_g8T-w":{"text":"Excellent service, super affordable price and absolutely ono (delicious) grinds as us Hawa","useful":0,"cool":0},"8wx_TreiWkZSxjieHjFKeQ":{"text":"Came in from texas. Great tasting affordable local food. Had the jambalaya and alligator s","useful":0,"cool":0},"XZZEX6CS41fB9jVNPHfosw":{"text":"Walking around in New Orleans and came across this restaurant, I was pleasantly surprised.","useful":0,"cool":0},"tfS-NeHRUU3WbQ2aki5gtQ":{"text":"stopped in for lunch after a long morning of conference sessions.  \n\nthe food is stick-to-","useful":0,"cool":0},"H43ZWfxfI-nYOoaMWvLXpA":{"text":"Good place to get a quick cup of gumbo. It tasted like heaven in my mouth.","useful":0,"cool":0},"d1ijIXh1s1iN5XSRtuHhag":{"text":"Came on a Friday night. They had a Groupon so decided to check it out. Ordered the muffale","useful":0,"cool":0},"k60N2L1OxVjXqNBH8n0S7g":{"text":"Love it here! It's right down the street from my work (Victory Bar - 339 Baronne) and its ","useful":0,"cool":0},"LZz16fLiMl44FdQglompyA":{"text":"I enjoy eating at hole in the wall locations while visiting NOLA. You can find some of the","useful":0,"cool":1},"mK9QsG0Q2xg3HB3mNvaOfg":{"text":"My husband and I stopped in for an appetizer and drinks while on a quick getaway trip and ","useful":0,"cool":0},"vsBngLzoQHwTlO4G4sdc5g":{"text":"Cool little locals bar - I didn't do anything but drink, but 2 from our group had a Cuban ","useful":0,"cool":0},"uzICgTLqf7LKAKFbnwz1Cg":{"text":"In the heart of the city, I loved this little hole in the wall. I was excited to try some ","useful":1,"cool":0},"IFAj1MY5WaKgiGuYm1zw9Q":{"text":"Cajun Mike's has the best oyster po' boy sandwiches I've had anywhere. The oysters are per","useful":0,"cool":0},"S0yxGrq_tIOzE6_dTRlWqg":{"text":"I found this place while roaming around canal street, New Orleans. It was a good found. It","useful":2,"cool":2},"n_Jydbes0SEy56YXSZPxJQ":{"text":"The guy that owned the bar was very nice. Didn't have a drink selection menu which makes i","useful":1,"cool":0},"z8dGbaKyfjiP8CL28-0Cog":{"text":"Bartender was not personable at all. She was the only one behind the bar and we had to wai","useful":0,"cool":0},"z74eim8axmaxx5LbNMFnbQ":{"text":"Great place to eat and Mary was a life saver. Gave us good advice on where to go and what ","useful":0,"cool":0},"bimIE-Y4y-PJ32PhU9Veng":{"text":"The drinks were good. The service was good. The jukebox music was fun. The food was pretty","useful":1,"cool":0},"B-VWpiMYIIQOTpka_HzEXw":{"text":"Michael and Hannah were a delight!! After a long day of shopping Cajun Mikes was a well de","useful":0,"cool":0},"tdS7U1GfT5GA5J4rxyLFVA":{"text":"Place smelled like cat piss which turned me off from the moment I walked in. I stayed for ","useful":1,"cool":0},"GOnCnPLCghuLd0x-WHs2hw":{"text":"Not sure how this place gets good reviews. The food wasn't very good at all.  The service ","useful":0,"cool":0},"Qh4CZfea9Dk8f469fcv-yw":{"text":"My friends and I just wanted to pick up some jambalaya to bring home and randomly picked h","useful":0,"cool":0},"FdzNlK5Q4NRU9i7ST0poCw":{"text":"This was probably the worst po boy I've ever had. There wasn't enough breading on the catf","useful":0,"cool":0},"p3T3ZlNBeFPsDdrPv7MWAw":{"text":"The Cuban sandwich was one of the best I've had. This place is definitely a bar that happe","useful":0,"cool":0},"mMTFjOnp6w2ibdYXBIB6VQ":{"text":"Great bar food and friendly service. We sat at a table outside since we couldn't get the w","useful":1,"cool":1},"i-eMBPutgL1m-oBaCadU-A":{"text":"I was surprised to find that the dive across the street from my hotel had such high rating","useful":2,"cool":1},"3v7Z6-QhuBxn0Tsw6dJpaA":{"text":"After having creole food for three meals in a row, I was craving something else. Wanted to","useful":0,"cool":0},"P2wVVOeJRryvBynQ14QjKQ":{"text":"This is such a great bar. The food is good and most importantly the staff and regulars are","useful":0,"cool":0},"WFTM4vpirEgnypHw0iN0oQ":{"text":"Arrived at Cajun Mike's for an afternoon lunch with 2 others. Very small and dark with a s","useful":0,"cool":0},"xyAsqmC6aPrBogMhYLBX4Q":{"text":"This bar was my regular spot a while back. Left that neighborhood and hadn't been back in ","useful":0,"cool":0},"YV7aEZLIn8BF5cJy7NkbOw":{"text":"Cheap drinks. Good Food (I speak of the po'boys). Friendly yet sassy bartenders. Perfect D","useful":3,"cool":1},"lXTRaSb8zC6zhcPQoOmUMA":{"text":"Came in the first time of a 3 day trip around 10pm for food and beers. The poboys were sta","useful":0,"cool":0},"E2R8-w7tyE3g2Gg85FGhKw":{"text":"Smells like a horror show.  I can't believe this place is not shut down by the New Orleans","useful":0,"cool":0},"kBLpZpXXKQwfcbqLxuvXuw":{"text":"Great low key local bar. Hope it stays that way.","useful":0,"cool":0},"Ye4S3iu7Tf8TxremSEFmFQ":{"text":"Hole-in-wall dive bar. Casual/informal as expected. Service as expected in a place like th","useful":0,"cool":0},"QjsIkg2yY4EXPWlk7u_fDQ":{"text":"Amazing! Great drinks. Great bartender. Great cook. \n\nGot the crab fingers and the sauce w","useful":0,"cool":0},"gH7UigXqiHOxWmI8lu6H0w":{"text":"Small bar that is super busy. The bar tender was the only one taking care of everyone. As ","useful":1,"cool":0},"rCKI1Ff23_AgQhPy2KIFRg":{"text":"Bar! But pretty damn good food.  Ordered the crab claws and sampler.  Got our monies worth","useful":0,"cool":0},"GAYAi4ZcMJTLauKdRMMO2g":{"text":"Went to this place solely based on the reviews here.\n\n The pee smell mentioned in other re","useful":2,"cool":0},"GHFU01hxnKQOorK1VbZxQw":{"text":"This is definitely a local spot where you sit at the bar have some grub and a beer or two ","useful":0,"cool":0},"MOVhU4Kcpo3DXNd9RtOn4g":{"text":"Cool atmosphere and good food but terrible service. If your not in a hurry and ready to pr","useful":0,"cool":0},"MF95ZvjDTOjLj40JcD9zCA":{"text":"Small location... best burger I had in New Orleans!!!!! Super fresh.. super friendly.. coo","useful":0,"cool":0},"C2y7fWTqdrkcPk5dwPQO4A":{"text":"Disclaimer: The bartender was almost entirely responsible for my negative experience here.","useful":5,"cool":0},"9dB0TDMaHZAOzpPSBArMyQ":{"text":"This was our last stop before going back home and Rue is the best! She makes the best bloo","useful":0,"cool":0},"qlwdHB2kB2pRZ5c0lz6s6A":{"text":"The spicy chicken sandwich is awesome and so is the shrimp. However you must try the Boudi","useful":0,"cool":0},"i8asgdpyw6jBEY5FsDzEzQ":{"text":"Great lil dive bar. The people that come are lots of fun. Drinks weren't that strong but m","useful":0,"cool":0},"nkrGBss8PpYQjTJOBZ-JkA":{"text":"Quintessential dive bar. The food is out of this world (I recommend the gator sausage pobo","useful":0,"cool":0},"x1C2fIQOPz86d84TbaiWBw":{"text":"Yes it was a dive bar, but they had excellent po boys. We had the pulled pork po boy and t","useful":0,"cool":0},"aqh9QNLey2fmqfK3jkxpeA":{"text":"Ok- let's talk about my love of hole in the wall places. They are the BEST. This place rea","useful":2,"cool":0},"1WRXaUZBFBPfm_jUbnIP_g":{"text":"Went to this place based on its reviews and in search of a great local eat. I was greeted ","useful":0,"cool":0},"UUfOrQ15YUKZpGIDiOsq1A":{"text":"On strong recommendation of a few of Chicago's best Yelpers, a friend and I stopped in for","useful":7,"cool":7},"9Q0yGNbAJFVzhwrW6-KaiA":{"text":"Yes this is a local bar and boy am i glad we stopped by. This was overall one of the best ","useful":0,"cool":0},"0IsXtBn6WBwhJWLQQAOMhg":{"text":"Taint easy to shock Mary but we did!! Loving Cajun Mike's!!! Pierce it if ya liiiike!!\n\nWe","useful":0,"cool":0},"hLr0jdhVVFvpE7HuuYYiJg":{"text":"Off the beaten path but so worth the visit!! Cajun Mike's is a 24-hour dive bar that has t","useful":1,"cool":0},"sy8ARBcVlqCpFgyR1URF1A":{"text":"Fried shrimp and fried oyster baskets was excellent. Really enjoyed the spicy coleslaw. Fr","useful":0,"cool":0},"pIADKTzGu3U_wLZ7wG-3RQ":{"text":"Amazing bar...I can't say that enough.\nThe bartender makes the experience. She welcomed us","useful":1,"cool":0},"4wBR72HxMPYFIslg3R7Gbw":{"text":"Good food, good ambience, great hostess, fair prices- so overall a great experience (excep","useful":3,"cool":0},"8TNJq60yKkFdstFYUzC4sg":{"text":"Lil hole in the wall where a lil lady in the back hooking up some great food.. Bartender s","useful":0,"cool":0},"0V6zrsKJU8ysC2Zb60jm2Q":{"text":"Located right off of Canal street, this little hole in the all bar is a true gem. My husba","useful":2,"cool":0},"gCNGkSfbcOb3p_ai04XktQ":{"text":"Loved it. Get the roast beef pressed sandwich!  Great spot to drink and chill out away fro","useful":0,"cool":0},"a9VLQm1vbPE3fM_vnqb4AA":{"text":"A solid 4 stars! My sautéed crab claws were yummy in a white wine and butter sauce. My bes","useful":0,"cool":1},"IQIWzkuietOoPt6PzBg8Ew":{"text":"One of my favorite places to get wings and also a great atmosphere to watch a game. The fo","useful":0,"cool":0},"EIFdxh4LCjYjzUm45YKFLQ":{"text":"I ordered the chicken Parmesan pressed sandwich and mozzarella sticks for takeout, was ver","useful":0,"cool":0},"e_9m01JeAj-Wq6P2VWgLpQ":{"text":"Little hole in the wall bar, but the food & was good as can be expected.  The wings & pobo","useful":0,"cool":0},"GXxzsz9zPQq3XcTUcFDSmg":{"text":"Loved their gumbo!!!! Was in town and had to have gumbo. We tried gumbo at about four diff","useful":0,"cool":0},"zkwq8Ey7Fw0xkZKZT-CN-A":{"text":"Yonnie's Cuban Sandwish was delicious! Great customer service! Super friendly! Check this ","useful":0,"cool":0},"xuQbbRQUw4ykg4L74JqI7Q":{"text":"We stopped in here because of other reviews we'd read on this app. Ithe good reviews were ","useful":1,"cool":1},"qrXFGKPHM8MmrIpw0kElyw":{"text":"Simple hole in the wall place just outside the French Quarter.  Stopped in for lunch and g","useful":0,"cool":1},"Ps4E9CPAhvMuLFhCSIESUw":{"text":"Dang, Mike! You surprised me, dude!\n\nI stopped in here with fellow yelpers Joel M., Steve ","useful":10,"cool":8},"pdvIFuy47IYzRPsP2gO3yg":{"text":"Get the Cochon de lait poboy and thank me later. Definitely five star food but the portion","useful":1,"cool":0},"n6EvAhD7kGS3idHbpf9otg":{"text":"Can I tell you how awesome this place is? IT'S AWESOME!\n\nI went here during my recent stay","useful":2,"cool":2},"0NMrhjAG7KeSEJDc2SjJzA":{"text":"This is basically a small locals bar that has probably the best gumbo I've ever had. I als","useful":0,"cool":0},"zPVx-H_pChHdbnEJ2_lHLQ":{"text":"Great food, great people, great little spot. My friends found this little treasure right o","useful":2,"cool":2},"fGf1jwH6ltXQElf_36VWVw":{"text":"Solid but not great. I had the alligator sausage po boy, and it was tasty. Fries were part","useful":0,"cool":0},"IvakVsppjbWCQXGYTldRsA":{"text":"Great place to grab a sandwich & beer.  Excellent, personable staff.  Food was terrific!","useful":0,"cool":0},"h74k5hHxNG9R8VZ3Dp7MBg":{"text":"Wow. This food is phenomenal! I'm really enjoying my red beans and rice! I might come back","useful":0,"cool":0},"DU5sTFlH6QzlY6cQKSBpGw":{"text":"Awesome dive bar. Wings were amazing with bleu cheese. Got the alligator sausage po'boy; w","useful":2,"cool":1},"sJexf5e4a9-_hBHdHHaq-g":{"text":"Came in here before a concert at the Saenger Theatre.  Just wanted something simple.  A co","useful":0,"cool":0},"YSdXW5jJFBnkPTx8XP1VXA":{"text":"I sat at a table and received no service for 15 minutes. They were not particularly busy. ","useful":0,"cool":0},"Qej1ag7QwWl7ovoRoM-Z1A":{"text":"Hole-in-the-wall bar right near Bourbon street.  Alligator sausage? Yes, please!  Cheese f","useful":1,"cool":2},"2DTLEJpw8BdvBUj0y3nTqg":{"text":"Great food & vibe! Cast of characters kept the evening interesting. Highly recommend!","useful":0,"cool":0},"qk06rycmxwi_P2IRayuyMA":{"text":"Cajun Mike's fits my needs perfectly. I work right across the street so it is really easy ","useful":0,"cool":0},"UCwgMynk6QvW2YBnthdHDQ":{"text":"This is the quintessential dive bar and it's great! For those of you who are not into the ","useful":0,"cool":1},"2Ooox2fxpnxcZUBaU4L9Qw":{"text":"Came to NOLA with some friends and they knew someone that worked here. Not a bad dive bar ","useful":5,"cool":0},"mJLOIh3RQBpE5b045RotyA":{"text":"Friday night and only 1 bartender for about 50+ people... Doesn't make much sense. Bartend","useful":0,"cool":0},"PwiTKpo2akwu1MLCcTXgvA":{"text":"I had read great reviews and decided to get a groupon. When we walked in, we were surprise","useful":0,"cool":0},"3sfnAF2lMKIpoAgMjlvZmA":{"text":"Nice little spot for a quick brew and a bite and chill. I had the boudin balls and a few A","useful":0,"cool":0},"th6tCBip7NjeMU8N9hzKiw":{"text":"Man this is a hole in the wall place that serves up a good dish!  Any of the po boys would","useful":0,"cool":0},"CIcYtXECHknB7dLi6ZITlw":{"text":"Good food, good ambience, great hostess, fair prices- so overall a great experience (excep","useful":0,"cool":0},"n7zhigIqorzbH9f-kRh55A":{"text":"Cajun Mike's is consistently good. Good food, great atmosphere, wonderful staff that is ea","useful":0,"cool":0},"qWcNc_z-sWTVD2r3eP5IMw":{"text":"We had the sampler and bacon cheeseburgers... AH-MAZING! Rue handmade us hurricanes that w","useful":2,"cool":1},"x36LnsoS_bKzlZlUU6j9EA":{"text":"Today at cajun mike's this brunette bar tender tried scamming us. There were a couple of r","useful":5,"cool":0},"47VNJJoIQUxGlIQ6gDDiCw":{"text":"Stopped in for a late lunch and bloody Mary before our flight out of NOLA.  We were told t","useful":0,"cool":0},"UKcJ1ZHVK208AJJdFBavFg":{"text":"The fries were hard! I believe my waitress was drunk gave me attitude for asking for ketch","useful":1,"cool":0},"RP9EHEH7VEymlO-rvDC_SQ":{"text":"Did NOT get what I ordered. Ordered a shrimp poboy dressed and sweet potato fries and for ","useful":0,"cool":0},"8Beh8AWA4K-JICXWRxZgdg":{"text":"This place exudes character... I loved the Spicy Chicken sandwich and the jello shots serv","useful":0,"cool":0},"fj6NxGXz29A6aNh9k7gGkw":{"text":"So we're in town for a few days on our honeymoon roadtrip from South Florida and bought a ","useful":2,"cool":0},"i5xwyLRd2GhnXH6xVaKk_A":{"text":"Randomly stumbled across Cajun Mike's while looking for a new place to eat some delicious ","useful":0,"cool":0},"iQ9V5XjU_-9xT4Qptm0R8Q":{"text":"This place is a dive bar. My hotel was right around the corner. The food was pretty good. ","useful":0,"cool":0},"sdf42HoCrMWpZUcgIPO9xA":{"text":"Had The best shrimp po'boy sandwich It was delicious thank you Joe and Adrienne who recomm","useful":0,"cool":0},"1yc7xmPUPqLrpxd4ACJHKA":{"text":"Pros: bartender was friendly and attentive. It was busy on a Friday night and she was real","useful":0,"cool":0},"flcy6dNr4s12PTv6VtBK9Q":{"text":"I absolutely love this local pub spot. Cajun Mike's is my go to spot anytime I'm in the ci","useful":0,"cool":0},"NyQidbNFROE9IKt7Lv_N6g":{"text":"Came here during Mardi Gras. We were in NOLA for a whole week and being in grad school....","useful":0,"cool":0},"KjLvPCkeeYzUVmFMAy0cmQ":{"text":"Local- hole in the wall type of bar. Food was fantastic! My husband had a shrimp PoBoy and","useful":1,"cool":0},"zuxYXCgjY-Uud71TxzKmXQ":{"text":"We were in NOLA for the weekend and were looking for cheap eats near the French Quarter.  ","useful":6,"cool":3},"aWpwcR2LECdmvCx9v_5IQA":{"text":"I do not write posts but felt compelled because of the food and service of this place. You","useful":0,"cool":0},"E0V5B0f5J9hzj314u_rgug":{"text":"I absolutely love coming here! Ask for gangster fries. They're not on the menu but they're","useful":0,"cool":0},"Dsl2qEnlW96bIQFgA2ahUg":{"text":"I decided to check this place out from the other reviews I saw. I wasn't disappointed. The","useful":1,"cool":1},"pqE_cDEpPGgXqe33MtA0cg":{"text":"Local joint that was found on the off chance when we first arrived in New Orleans and real","useful":0,"cool":0},"McuK9yUzFVj8GfbG5dpcng":{"text":"Felt like home. Come in and get comfortable. They have the trifecta; great drinks, great f","useful":0,"cool":0},"ovJ8n9A6HEJ1Yp-9Uv6dAg":{"text":"Dark, divey, delicious; we liked everything about it. We were hangry after a long day of t","useful":0,"cool":0},"4ungjUgC24oD7PIv4-lXRA":{"text":"Why hasn't this posted? Ugh go here. The grub is amazing the service is casual, fun, and f","useful":1,"cool":2},"mKfBMn04dZuewRLWKt7fdA":{"text":"Truly a hole in the wall... Primarily for locals.  Wouldn't recommend for travelers.  It i","useful":0,"cool":0},"PjfRwgkOK_xZ5iSrM1RBDA":{"text":"This dive bar has cheap drinks, delicious food (I recommend the cochon de Lait, my wife re","useful":0,"cool":0},"OE5KBxNEW9u83MV5J4h9WA":{"text":"Bad service. This place is a small dive bar that plays 90 metal hits. Food is mediocre at ","useful":0,"cool":0},"JmMWxTnEtiUnyO17U5xNUQ":{"text":"This is my favorite bar in New Orleans.  I bike across town for this bar weekly.  When in ","useful":1,"cool":1},"YXH9Tew-SiFgvsVnD5olFw":{"text":"The sweet potato fries are amazing! My fiancé and I both liked this one. True hole in the ","useful":0,"cool":0},"6QS73Ryc0LaQ79hXbjU0Xw":{"text":"Ran across this place! It's small not alot room but drinks, service and food was delicious","useful":0,"cool":0},"3XBO1dkBt-AgTsOYKh4vTw":{"text":"This place is a hidden gem! Food is fantastic, the po boy (roast pork) was so delicious, t","useful":0,"cool":0},"62KPnw1RruElTCMQFxONxQ":{"text":"Not a fan of heavy greedy food  but if you do then this place is a four star....\n\nGumbo is","useful":0,"cool":0},"mkwgRDfIIZFU6ecfSyZFCQ":{"text":"If you're out and about in this area...this bar is affordable  compared to the  surroundin","useful":0,"cool":0},"w6-Z25n4qazQWq8GSEgE7w":{"text":"Had the fried shrimp basket.  Real nice flavor of the shrimp and wonderfully paired with t","useful":0,"cool":0},"X5uzTjxH6uowW2PkO_95tQ":{"text":"I would move to New Orleans just to eat sandwiches and play Jenga at this bar.  The cochon","useful":3,"cool":1},"jwuBY2ut2y5KDe2-8p5ERA":{"text":"Had lunch today.  Shrimp po boy was excellent, hand battered onion rings, alligator sausag","useful":0,"cool":0},"NUadoEKuojMKMwjYFQQ7LA":{"text":"Late getting in & happy to find somewhere open but not accustomed to fights & bartender lo","useful":0,"cool":0},"OfDl7yR7osTCj6OJ8qfXtA":{"text":"This is a divey little bar with a handful of simple but excellent poboys and other small C","useful":0,"cool":0},"ydch-BBZBVx7UpLqUuJ4mQ":{"text":"This place is ok and really more like a 2.5 star to me.  I've only ever ended up here afte","useful":1,"cool":0},"pTvqpnNr_UMkSuwmJtPb7A":{"text":"The perfect dive bar with solid pub fare. Bartender was super friendly and service was spo","useful":0,"cool":0},"rXzVbUEB5Dhf9EE7BMYmsw":{"text":"Love this local spot! Yannie and the crew are super nice and the food is exactly the yummy","useful":0,"cool":0},"ruuHDyjqRklKaAVtfxc19w":{"text":"Wanted to grab a po boy and stumbled upon this spot near our hotel. The oyster po boy is W","useful":2,"cool":0},"9vOwzCEMa5Wghnzwub5DEw":{"text":"Came here on a whim and omg was it delicious. The portions are huge and the food is amazin","useful":0,"cool":0},"HexA3G1R2BzjEgtYlMkx7Q":{"text":"This place is assuming and we almost walked past it. the drinks and food were delicious. I","useful":0,"cool":0},"0VfoUeNf1WggyWIa4U0E2A":{"text":"Came here twice on our vacation to NOLA and both times were a great experience. The barten","useful":0,"cool":0},"v9CD69ioaeTVvahHmrljIA":{"text":"Food was delicious! No complaints here! Nathan (bartender) was very accommodating for our ","useful":0,"cool":0},"0z0XG0XEuuYFUROc-wKscQ":{"text":"Great spot for drinks and food. A dive that is tucked away off canal, this place is a gem.","useful":0,"cool":0},"wVYK2RzrY2PaVoRCpYhrXw":{"text":"On my way to Guerlain Spa, I had about an hour to kill, and walked into Cajun Mike's.  I m","useful":2,"cool":2},"LeMGXJ5Pc4mFdCCindxTbg":{"text":"Picked this place because of the Yelp rating. Not a great experience. Dingy and dilapidate","useful":0,"cool":0},"xlyfizaE2aH_vOggpyT57w":{"text":"Wow... just wow! I left speechless when I normally would have run my mouth. Complete ruden","useful":0,"cool":0},"eNbX_dr7H32Qx4eDBj92qA":{"text":"Great food, friendly people, and plenty of tv's to watch your teams game. Looks like just ","useful":0,"cool":0},"n-3jaWy7-Mqp1XuWOt49bQ":{"text":"This place plays music at an unbearably loud volume. Be prepared for a headache. I could s","useful":0,"cool":0},"PiJNbXffezaOIrqAA9H5ZQ":{"text":"A nice and low key bar a quick walk from the French quarter. The crab claws are not the tr","useful":1,"cool":0},"xIwCqg5D4Q-wBp0tKPehSQ":{"text":"Cool dive bar next to Roosevelt Hotel. Decent poboys, but bread was not quite as good as o","useful":0,"cool":0},"gRButpobK0sqQE5Y5nz8lQ":{"text":"Po'boys are delicious with amazing prices.  Very affordable. Had the sampler appetizer tha","useful":0,"cool":0},"5CVQCSUDvvqujUf0nvYE7A":{"text":"Went here because of good Yelp reviews and wanted a late dinner and a drink. Walked in sta","useful":0,"cool":0},"3HkxxrVaTmsqxhD7zu7B_g":{"text":"The bartender here literally begs for tips. He gives you 1 second after you pay in order t","useful":1,"cool":0},"Nsk2lgBPCp6LKaNDE_jnQQ":{"text":"Found this hole-in-the-wall bar on yelp and decided to give it a try. It's true, the allig","useful":1,"cool":1},"ZxjY9rnHEEk-vHJXWc3G6w":{"text":"This place is amazing! Went here randomly just looking up places near us. Looks like a div","useful":0,"cool":0},"Y-DmWl9DfSK4yVyvX1C9GA":{"text":"We stopped in to Cajun Mike's on our last night in town.  My girlfriend and I have the All","useful":0,"cool":1},"kEyFhpJxqEuTFVJaiN7EHg":{"text":"Just go if you are in the area . Food is great and drinks are good. Bartender was awesome.","useful":0,"cool":0},"CitD0VUCtM6NtblsDf8pTQ":{"text":"Great Tulane game spot with potential. \nWhile staying at the Rossevelt Astoria on Barrone,","useful":0,"cool":0},"tksgJxJeF0MTxEXQ636reA":{"text":"This was my first stop after I got into New Orleans last March for a work conference.  The","useful":0,"cool":0},"l1Zm-SPrKktoVY4iib4faA":{"text":"We stumbled onto this place when staying at the Roosevelt and it was the first place we we","useful":5,"cool":3},"7FpskArL2gWIStbBp58-3w":{"text":"5 tap beers. 10 more in the menu and that is it.\nGood food for a dive bar, but limited dri","useful":0,"cool":0},"yKgcmnPX0LZ-NKuOnDFyMA":{"text":"I couldn't have asked for a better end of NOLA trip and hungover as heck send off meal tha","useful":1,"cool":0},"tAxPOHAyLicHZXmZMKgLkA":{"text":"Great little hole in the wall bar with a pretty good menu. The Shrimp Po Boy filled my boy","useful":0,"cool":0},"cuEdzF0-NY7k7yMeqhxAwQ":{"text":"A down to earth gem. Like others have said, this is a great hole in the wall bar convenien","useful":1,"cool":1},"ogJvp7n4yThW3DNE8eCYCA":{"text":"This is a really cool bar that serves apps and sandwiches. Check groupon may has one for t","useful":0,"cool":0},"-po99VlAdEP8HVUWHzlXNg":{"text":"\"If a man is called to be a street sweeper, he should sweep streets even as a Michaelangel","useful":0,"cool":1},"asYQKKVP2LjkSI-lQY3Fgg":{"text":"Stumbled on this spot by accident. The sandwiches were so good. I had the po boy and my fr","useful":0,"cool":0},"0qpuxsOdstkKVH3MYtSqsg":{"text":"Great dive bar. Great food. Interesting patrons. We stayed at the Roosevelt across the str","useful":0,"cool":0},"IQW_2hNf0j5H07XCdK18aA":{"text":"Just came here because it was near the hotel. I have been here for a week hands down best ","useful":0,"cool":0},"gJ6lqnF0Txg1_HDlKeDqtg":{"text":"Awesome tiny little pub right off Canal street. If you're on that end of the French Quarte","useful":0,"cool":0},"w_jMZI6LjfBelKyynZ6pvQ":{"text":"Outstanding hole in the wall close to where I was staying. Had the chicken and boudin gumb","useful":0,"cool":1},"PCvuli7xIaBd83fDFu3GPg":{"text":"I love the food at Cajun Mikes. I had a Cochon De A Lait. Was great. Cook Yannie did her t","useful":0,"cool":0},"3sS_2OIiRtS8f5rs2g7F0w":{"text":"We stopped in to grab a bite on our lunch break during a convention. We didn't have a lot ","useful":2,"cool":1},"sTQshwAyjARaRgtUmf6Ttw":{"text":"Walking into Mike's I was very Leary thinking that food would be trash, but I'm so glad I ","useful":0,"cool":0},"yvFF9euRCVCTZSYk2ULXFQ":{"text":"This is one of the few times I feel like yelp has steered me dramatically wrong.  I know b","useful":4,"cool":1},"Wk7dFmWu6bmBIWBZDVd2DQ":{"text":"Got off our tour bus and found this locals pub.  Had amazing gumbo filled with sausage and","useful":1,"cool":0},"A8TPcXykH6K4WR6YwAQIQw":{"text":"DELICIOUS!!!!! Get the bbq pork poboy and you won't be disappointed. The gumbo of the day ","useful":0,"cool":0},"R0Fa5GlnImGQSKAbf6LsJg":{"text":"We can here as our first stop in New Orleans and its VERY divey and had a lot of locals. T","useful":1,"cool":0},"UWbW3p_regWeUhzlPZP6Ew":{"text":"Good brews on tap, food was served fresh and fast, easy to get to with a fun dive-bar atmo","useful":0,"cool":0},"94MJMJEn7-n6UX5wRE_E6A":{"text":"Cajun Mike's location is a bit off the beaten path, in an alley away from Bourbon street a","useful":0,"cool":0},"doG8PDf6BASa8zUedVxU-g":{"text":"This was a great surprise.  Gumbo was excellent!!\nSandwich was delicious and the chicken t","useful":0,"cool":0},"l3SktecbOsQwZF28Qgfb5Q":{"text":"Moody/dark hole-in-the-wall, equal mix of locals and tourists. Only one bartender in the m","useful":0,"cool":0},"DGyUwlipfZjEkuAUAI3w9Q":{"text":"Great bartender.\nImpressive all the customers he was juggling.\nI wanted to try fried shrim","useful":3,"cool":1},"ZDmjlzVOtoFKlZSk9qFEjw":{"text":"It's a bar. There's one table, and sitting at it marks you as a tourist.  Even if you sit ","useful":0,"cool":0},"oZvbjviAXbUBOId67drV6Q":{"text":"Your go-to NOLA diveish bar. Awesome food friendly staff try the Cuban. Lots of local regu","useful":0,"cool":0},"j10cgvOAVhifmzpL-s9f7w":{"text":"Great place for drinks and a quick bite. Po'boys are outstanding. Try the Cochran de lait ","useful":0,"cool":0},"bBJytVzVp38enb5Pzdic7A":{"text":"Update:The owner was very apologetic and takes these types of complaints seriously and dea","useful":2,"cool":0},"30q39wdrOvtklIFp43Yn2Q":{"text":"What a dump we walked in waited 10 minutes the bartender was bullshiting with some people ","useful":0,"cool":0},"SXFAZEbxGXf-Xg1xB2Pzgw":{"text":"If I can give zero star I would. I felt like I was tricked by New Orleans yelpers' reviews","useful":4,"cool":0},"gvYrEHZx-BLodUef1wsxzg":{"text":"This place has such a great vibe! The staff are clearly super close and the chemistry and ","useful":0,"cool":0},"I7Qp_pA5uoZz1yEvkXBUGw":{"text":"I bought a Groupon Voucher and it's one of the best I've got so far. I had their shrimp cl","useful":0,"cool":0},"D5_KEiLzN5XX7zjAh0VY_Q":{"text":"The most perfect lil local dive bar w/ live music, friendly bartenders & a very cozy vibe.","useful":0,"cool":0},"dlfCatpqbBWNkmGIgX6MHw":{"text":"After our streetcar dropped us off on Canal Street, we decided to grab some food while sti","useful":0,"cool":0},"8uGv8mHTIW345khEVvzn1A":{"text":"I forgot to take a picture it was so good, but the gumbo was some of the best food I've ha","useful":2,"cool":0},"uv-ZpZGAAbn0z1enko654A":{"text":"Just a great little dive bar a half block off of Canal. I had the shrimp po' boy, dressed,","useful":0,"cool":0},"i9NvBAQCB8MuPjnUsHogfQ":{"text":"Can't top the friendliness of the staff here. Good cheap drinks and a comfy bar. Pretty gr","useful":0,"cool":0},"GRbGYySrIzfpc9cWhvdR-w":{"text":"Great whole in the wall place. Hands down best bloody mary I have ever had with the pickle","useful":0,"cool":0},"zpzJ8lsqkJXj0U81Owdg5Q":{"text":"Kitchen is open late for when you're craving a po-boy at midnight. Prices we decent. Barte","useful":0,"cool":0},"c9KCZ5U-c_kNkh6xCwRxEg":{"text":"All I can say is Jess & Yannie are amazing! My cousins and I stopped in here for our first","useful":0,"cool":0},"mc1bhHlonqd57mv6Z8pQxw":{"text":"Cool dive bar next to Roosevelt Hotel. Decent poboys, but bread was not quite as good as o","useful":0,"cool":0},"pTrLZyJMrili8fgov39uTw":{"text":"Words cannot express how much I loved the \" Cochon de Lait\" sandwich.... it was so amazing","useful":0,"cool":0},"2qE59VxNlP3cNWovQiVOBg":{"text":"Divey dive bar which seemed to be mostly locals. Not gourmet food, but good for a greasy P","useful":0,"cool":0},"-QQoZUSBj2fD12SqXDTmRw":{"text":"I fell in love with this place. Loved the bar staff, the food (had gumbo, and friend the p","useful":0,"cool":0},"O8v7jFS6eB500egg_8po7A":{"text":"Went on yelp to find a local place for gumbo off of bourbon. The man behind the bar was re","useful":0,"cool":0},"J7S1Ewm6mjDF3ys6DQOJIw":{"text":"This place has the worst customer service and the grossest food. Bartender was a complete ","useful":0,"cool":0},"6xRsjouVJdByXlWpIzmt7A":{"text":"I'm a new visitor to New Orleans and wanted to find a spot for food and drinks, and also a","useful":0,"cool":0},"M2xMaGxENZzJUBeO1GMUkg":{"text":"I guess the food/ drinks might be okay. Didn't get to find out because the bartender/waitr","useful":1,"cool":0},"2CenCUkxveC-c4kOrYbiLA":{"text":"DELIVERY!  just started; finally good quality, inexpensive bar food at home;\nONE OF THE BE","useful":6,"cool":0},"9AiN_GM2eWRq1EDb2AeK6Q":{"text":"Worst gumbo ever. A bowl of greasy unflavored  swill. My partner had a shrimp poor boy. Av","useful":0,"cool":0},"PKwfC4-53SGLGD9MiHNksQ":{"text":"My fiancé and I get about 2 toddler free days a year to come to New Orleans and just spend","useful":0,"cool":0},"lnzwDBOwdi7ozHUp-PjTAA":{"text":"The bartender was extremely slow and more worried about serving her three friends on one e","useful":1,"cool":0},"mB18VujcUqkc9GwvFK7AFA":{"text":"It was ok place could use a good cleaning!!! The workers were nice and could use another b","useful":0,"cool":0},"2gK3dV4Su3IseUDYu_jWnw":{"text":"Omg this place is soooooooooo gooooood!!!! It's not \" fancy\" but omg, idc what anyone says","useful":2,"cool":0},"L8kjXsNuPPKb7bHzPg7iyw":{"text":"Bartender was really nice, quick, and helpful. Gave my uncle a recommendation for the alli","useful":0,"cool":0},"1qQi-ZKy58hdDh4zOkn-9w":{"text":"Every time we come here that absolutely have the best jambalaya.  We love to stay at the c","useful":0,"cool":0},"nm6llS7wQdWTNduv5MlLiA":{"text":"Good little dive bar. But they really excel at the cochon de lait po boy!!!! It was amazin","useful":2,"cool":0},"fJChKfFZklLRSguLlOntMw":{"text":"Please note this is a 4 star review in light of this being a bar and not a Michelin Star r","useful":1,"cool":0},"DPJ9_FdWVQBqvsOSeZPrlg":{"text":"Loud mouth jerk with vulgar language standing at the bar...bartender did nothing to quell ","useful":0,"cool":0},"v2RuitIB91vuWucPZ-zn3w":{"text":"The grub is amazing the service is casual, fun, and friendly. I feel like home or back in ","useful":0,"cool":0},"ztLPCNwo0phJFCmHxu47Gg":{"text":"First things first, if you are looking for white linen table cloths this isn't your place.","useful":0,"cool":0},"N-A9mWWYkI3Edqk4dyJmzA":{"text":"First let me start by saying if you want something authentically New Orleans to eat, a goo","useful":2,"cool":0},"LhUQYGJqJHBoFYpolkSjqg":{"text":"I will JUST review the food, because the customer service was another beast. I had to just","useful":0,"cool":0},"lvU83LaYC8tOUL22sFL9ig":{"text":"Good, cheap food and a decent beer list. Not the best po'boy we had there but pretty decen","useful":0,"cool":0},"F_-6-ZXRzdETZouuPyiGSQ":{"text":"We came here a couple years ago and loved it, tried it again using a Groupon. Guys behind ","useful":1,"cool":0},"y2HF5va3pvYYNU-QL5zptQ":{"text":"Terrible service. We understand the Covid situation but no reason to treat people like dir","useful":0,"cool":0},"yDbNWgdVzisTDJokNg3jMQ":{"text":"An actual dive bar. Staffers were nice, especially the cook. Drinks were very watered down","useful":0,"cool":0},"zki1ciDNZe7nCXXb05D1Mw":{"text":"Cajun Mike's was exactly what I expected- a wonderfully worn \"joint\" with super friendly s","useful":0,"cool":0},"Mdm_prhZju6Q6Ph5yoTryg":{"text":"I start all my reviews out at four stars. I docked one star for advertising a website/food","useful":2,"cool":1},"H1mebOg--G-jn-q7lQln9A":{"text":"The jambalaya was so yummy! And can't beat the price!  It looks like a hole in the wall ty","useful":1,"cool":1},"HKfQTbZhRggQzTsHJncX5Q":{"text":"Small little dive... even the sink in the women's restroom is tiny!    But, for bar food s","useful":0,"cool":0},"Z_LOVMHcYDtTMThR2eG3Vw":{"text":"One of my new favcorite bars in NOLA.  Decided to go here after hitting up the Absinthe ba","useful":0,"cool":0},"_i866v6yN9jObr7cm2jPKA":{"text":"Amazing po boys!! I don't even eat pork and I scarfed down their house po boy. Throw a lit","useful":0,"cool":0},"79kQs8x7-DzZSbfCBm4nvg":{"text":"This is a gem. Stop here for a beer, a po boy, and some gumbo for lunch if you're in town.","useful":0,"cool":0},"71xrhr4gh96aN6tfDmU7gg":{"text":"The atmosphere was welcoming. The people were friendly. The Cajun food from the kitchen wa","useful":0,"cool":0},"i3BRZlo40cDv5_xeae3a_Q":{"text":"Great food, friendly staff and cracking atmosphere. I dropped in for lunch after reading y","useful":0,"cool":0},"2VRE7ot_FpzmcaB1S4fvow":{"text":"Awesome hole in the wall bar! Can't believe I have never stumbled into this place before. ","useful":1,"cool":1},"wUFYqwM5g-MdzL1vfFyRaw":{"text":"Surprisingly delicious! I have learned over the years not to judge a book by its cover and","useful":1,"cool":0},"ABfGxpPGJji0IppVYNucJA":{"text":"Awful service. Everyone serving ignores you when you walk in. Can't get a drink no matter ","useful":0,"cool":0},"u9tiZxQLx5Qh_P3F7ARpJA":{"text":"ANY FRIED APP HERE IS A WINNER\nThis is one of the best local dives with better than averag","useful":3,"cool":1},"lxUukqMBeBSeUp91aXEaLw":{"text":"By far my favorite hole in the wall in downtown NOLA! The roast beef po-boy tastes like my","useful":0,"cool":0},"BnLXcr0em-3F5vTDeB4KSQ":{"text":"We loved Cajun Mike's so much we stopped in twice. \n\nThe first time we had a sandwich and ","useful":1,"cool":3},"iNDvErDOcPgbDIYpd5IboA":{"text":"Small little dive... even the sink in the women's restroom is tiny!    But, for bar food s","useful":0,"cool":0},"p8VZoqJOr8L-FtSCLGM4_g":{"text":"IOk, it's been a couple of days later and I'm as traumatized as I was from the day we got ","useful":4,"cool":0},"nmsmO7X-CbhZklXGx35u_w":{"text":"This was not an impressive place at all. Yes I get that it is a dive and hole in the wall.","useful":2,"cool":1},"5vCxIAz0RBYaIg_IcNZ6nQ":{"text":"I'm so glad I found this tiny little bar by chance while staying at the Roosevelt. The foo","useful":0,"cool":0},"JfrArtsyrd6aBRl7yLbY1A":{"text":"Based on a groupon, my wife and I went for dinner. Mind you this is a real dive bar and I ","useful":0,"cool":0},"UVxe8Q198XLpgztFwPau2w":{"text":"We stopped in for a quick meal. Great drinks and crazy big poboy! We highly recommend this","useful":1,"cool":0},"vmJy7_FK51jc49WpqSmwXA":{"text":"Solid dive bar with inexpensive drinks and above average bar food at a reasonable price. N","useful":1,"cool":0},"LQa6_pgCGHw6zInAn6p6Vg":{"text":"The place is a hole in the wall, small and grungy. The bartender isn't the nicest person, ","useful":0,"cool":0},"ihBC3V2_qro_Nw4ybIeXOA":{"text":"The scrawny white bartender is the BIGGEST DICK. Made horrible remarks towards all our gro","useful":3,"cool":0},"PhQDV446x4Gw5-tu2asvxQ":{"text":"This is a hidden gem.  Great food and drink and a reasonable price.  Really love this plac","useful":0,"cool":0},"G0LSOT5NfvoWr_mTnbl4Nw":{"text":"Tiny dingy bar. Wings were not very good   Gumbo and Hurricanes were good.  There was lite","useful":0,"cool":0},"PJZOH3AOYBDXHxuEdQGTTQ":{"text":"Look. This is a dive bar. But it's a 5 star dive bar. It's a bar vibe, with bar food. The ","useful":0,"cool":0},"MF-mv2DQmMMMhGy7K9xtmw":{"text":"Great Dive bar for a quick bite to eat and a few drinks!\nThe Cuban sandwich was Amazing!! ","useful":0,"cool":0},"clGOOWY0Pcy2hkdIFR3A0Q":{"text":"I'm not from these parts but I was dissatisfied with what I had. The muffuletta!! While ea","useful":0,"cool":0},"7-VqYel_2aqyf56WOWaAkQ":{"text":"Me and three friends stopped in for dinner around 9:30 on Tuesday March 10. As soon as we ","useful":1,"cool":0},"rf3eNYrD50yehfXrZnKsQQ":{"text":"This place is the perfect place to stumble over to after a long night of drinking and get ","useful":1,"cool":0},"g7pJbnjRWvv7dGNJHmQIhA":{"text":"Thanks to my boy Chris L for suggesting this dive right across from my hotel.  This is a f","useful":1,"cool":2},"4SeL_xxoYUuDR4aQMC44Gw":{"text":"Excuse the Memphis in me, but the gator sausage poboy SLAPS SON!  \n\nThat's the BEST mfin p","useful":1,"cool":1},"ZjvpN7RZS6soJMGfBVy0qQ":{"text":"Thank you for serving food in the evening! Excellent shrimp and the gumbo is amazing.\n\nFin","useful":0,"cool":0},"elVpv5UiaETkZMhCi_b9UA":{"text":"Yelpers use your stars carefully!  No way a 4 star... Dive bar w seating for maybe 12-15. ","useful":1,"cool":1},"oeX6BtnV2qfcBkYi1XkJCg":{"text":"Stopped by to get a quick bite to eat!!! Michelle & Betty were amazing!!!! Thanks for the ","useful":0,"cool":0},"MjP-17HiemaMd123BskbLA":{"text":"This is a \"hole in the wall\" \"townie\" type of place, which is OK by me. It was very quiet ","useful":2,"cool":1},"ydLkcbcGssGYZisP_EK6Kg":{"text":"We had a great time here. Drinks were very reasonable and the had a big crawfish boil for ","useful":0,"cool":0},"_Chrt7ValjVew2dtB5NzjQ":{"text":"Holy crap, this place isn't messing around. The reviews are true. It's a total dive bar on","useful":5,"cool":3},"rKfrFBc0cm1D2wtW2XNmWg":{"text":"mozzarella sticks were fire, bar tender made a list of some local activities it was a good","useful":0,"cool":0},"tSRP8Yvhi_X9xo5-NE06PA":{"text":"Decent local bar with pub fare.. but DO NOT start a tab with the bar tender.. ordered 1 be","useful":0,"cool":0},"LmmH88u3uhuv1AuX9entOg":{"text":"Great bar located night off Canal! \n\nOut of my 4 trips to New Orleans, I've come here thre","useful":2,"cool":2},"0BJf-Qq6P7Gm5eOKeanArQ":{"text":"This place was a standard dive bar. I'm giving three stars because I really didn't enjoy m","useful":0,"cool":0},"Q3ebF76E6lkwKLsoltCCkQ":{"text":"Found this place on yelp went in the bartenders were fun love the cheers kinda of bar got ","useful":0,"cool":0},"l6afr9WXXD2JaIgj_SfvYg":{"text":"My friends and I came here for a late dinner.  It was a very low key bar that had amazingl","useful":0,"cool":0},"d2ROqud8MC8gBYR7D0UKFw":{"text":"Go for the Gumbo and drinks!!! Their Gumbo is prepared nightly and depending on the chef, ","useful":2,"cool":2},"m8W9d0mecqOjsxLk17Fy8w":{"text":"Got food to go one night after arriving late to our hotel.  Shrimp po boy was good. Muffel","useful":0,"cool":0},"3SNDE0cq-enNU7eHHDYEDg":{"text":"Been in NOLA for three days, and every day, we've visited Cajun Mike's for the Cuban sandw","useful":0,"cool":0},"rVOf2bgC_PbUUAuFJ7kMLA":{"text":"Quick, efficient, COLD beers, good food, homey and a bit tired - but a great place to unwi","useful":1,"cool":0},"e3LFZo8qzt931aMuzh6QgQ":{"text":"I went to this place last night as I'm walking through bourbon street, I was starving and ","useful":2,"cool":0},"lpFh4_F-Jqg8hEbIfJYyYg":{"text":"This place was great for our first meal in NOLA. It has some traditional cuisine and price","useful":1,"cool":1},"r0wrfzKwFZQ7IpifJVm9VQ":{"text":"Okay, so I NEVER leave reviews on a place, but I felt like I desperately need to let peopl","useful":0,"cool":0},"4fKHIohtA99mk-4ENH09qQ":{"text":"Let me be clear: I've never met Cajun Mike but I bet good money he is a bad ass who partie","useful":1,"cool":3},"OuaGMjX8iy_i5_54x2DArQ":{"text":"It's like Cheers but raunchier.  Ohh the memories made during Mardi Gras 2012.\n\nIt's divey","useful":10,"cool":9},"cs0nTmhaV9IQHivzUqDq5g":{"text":"Yes it's a dive. The food is delicious. It may not be what you expected, but try it. You w","useful":0,"cool":0},"jWX6PHc_l-4BEIfm9-FSgg":{"text":"This was our first stop for food while in New Orleans, and we liked it so much we went bac","useful":7,"cool":4},"edXMXjXzG8KvOASRubgfJA":{"text":"This was every bit the dive bar I imagined. Mix of locals and tourists. The Po'Boy was del","useful":0,"cool":0},"1eM_dQ4v1H84-WiJ_8ffkQ":{"text":"This was our first stop down in New Orleans and it was a good choice! The menu was limited","useful":0,"cool":1},"lUWlxmg7qNz34Iu9MOg5LQ":{"text":"Only sad because they don't allow kids and we walked all the way here to have them laugh a","useful":1,"cool":0},"PzcGd6dfzybt1GYK013JbA":{"text":"Quaint neighborhood bar tucked away just off Canal Street. Very friendly staff and good fo","useful":0,"cool":1},"bLjaliVJJrD_CRA9NZePqg":{"text":"If you're in the area and want something divey and more \"where the locals go\"  then this i","useful":3,"cool":2},"j8r1mPHbBGN9AlY3yLhBng":{"text":"I saw this place when we were walking in the area. I didn't get a chance to go inside and ","useful":3,"cool":4},"eaabe6SX_4BNv7Zsq5vs5Q":{"text":"I've been coming here for several years and was very disappointed tonight when the bartend","useful":6,"cool":0},"oRN_ZVgICs1oflCHOJy-rw":{"text":"Better for drinks than food. Smells like smoke inside and ruined the atmosphere for my gro","useful":0,"cool":0},"F_CgSih34ZJOj_ao9u41hw":{"text":"We went here after getting a Groupon and almost changed our mind because the place looked ","useful":3,"cool":0},"oAIdyc0BLBuHM7riz1GYgA":{"text":"Food was awesome! Mainly reviewing so I never lose the location for whenever I visit again","useful":0,"cool":0},"7EIHVdOWCVIve2yD5bmzLQ":{"text":"Went there for the food and took it to go. The bartender kept us entertained while we were","useful":0,"cool":0},"krYm5CPT394EWMTw3KZN0g":{"text":"I got a Groupon for this place as it is near the Homewood Suites French Quarter and we cou","useful":0,"cool":0},"P88Nml1JbdwScYAWMOIA4Q":{"text":"I found out about this place because I noticed a voucher on Groupon. Prior to purchasing i","useful":2,"cool":0},"N6ZOQSiOQMLxuOxx7AOSgA":{"text":"Stayed across the street from this place.  Best drinks and company I could find in the are","useful":0,"cool":0},"6r2TVP587kD8omRr4YYMSA":{"text":"My wife looked inside and wanted to keep walking. It is a bit \"unrefined.\" I walked right ","useful":0,"cool":0},"lwUaDEEGTYhIlF8LgpNpBQ":{"text":"I give it 5 stars but you might want to take my rating with a grain of salt as prior to th","useful":0,"cool":0},"bbPTM1h99H8JOOcseksu8A":{"text":"Came into town to apartment hunt and found this place. It's got Awesome vibes, amazing foo","useful":2,"cool":0},"gGM6h2kQZRBLoI0bybaf5Q":{"text":"Needed something to eat a little later in the night that was close to my hotel, and whew a","useful":1,"cool":0},"gsSpMNOHhBJmzmUaI4Wsxw":{"text":"Looks like your typical bar spot. The food was good, we had BBQ pork and Lechon (think tha","useful":1,"cool":1},"3STM0cgPsTQEkQHL3G2-oQ":{"text":"Didn't really care for the food much... The bartender in there was nice, and the prices ar","useful":1,"cool":0},"4DZAqE10F6c23Qx4AzPyBA":{"text":"Oh man did I love this place! Locals joint is such an understatement. I wish this place wa","useful":4,"cool":3},"Tuw-O3mYxisUHtrKo0lY-w":{"text":"Try the cochon de lait po boy and the boudin balls! They're both excellent!\n\nWe loved the ","useful":1,"cool":0},"jYCF6SXuvV8EVrTadSeFkQ":{"text":"I love me some dive bars, and this one does not disappoint.  On my most recent trip down s","useful":6,"cool":8},"VXxPz8kZBCtSfPe6H4-mvA":{"text":"Don't judge a book by its cover! On first glance inside, I was a little weary of the food ","useful":2,"cool":1},"e3C-eAbdEzHsYr1mvcyY5A":{"text":"If Cajun Mikes wasn't off the beaten path this place would be packed. We came here on a Su","useful":1,"cool":1},"j5PAwoz3wihB_MQgMrCxFw":{"text":"This is one of the first places I checked out once I landed in New orleans. I didn't expec","useful":2,"cool":1}}