{"NZf8-3nMFj-59_CDPLNwRg":{"text":"We really enjoyed our meal here, and the service was excellent. My husband had the blacken","useful":0,"cool":0},"lXMUqOGru5RZkIAAI-_5zw":{"text":"We had a terrible experience at this restaurant while being on vacation for my sister's ba","useful":1,"cool":0},"Nh2R2vW9v218TLcnWlSy4A":{"text":"Coterie is the Bennigan's of New Orleans restaurants. The menu sounds good, but the food i","useful":0,"cool":0},"I35bLY99BEqkQJeth5Rv6g":{"text":"Oh my God the food here is amazing. Loved every bite and the wait staff was awesome. I wou","useful":0,"cool":0},"Q3Lz-JRxdlVSMYRhLoxV3w":{"text":"We've been here 3 times already.  They used to be called Huck Fin.  They will not disappoi","useful":0,"cool":0},"MC1CFTR-eBTBvKEx2sOF2Q":{"text":"Where do I begin?  Okay, let's start with the plus.  We got there and the place was full. ","useful":0,"cool":0},"jla6R76WtvMrtiphORjWwA":{"text":"What a gem Coterie is in downtown NOLA. Stopped in here randomly and sat at the bar. This ","useful":0,"cool":0},"VEoc30ECuWvoZs8m0NmlPw":{"text":"Great food, great drinks, great service! I recommend the Boudin Balls and Chicken and Saus","useful":0,"cool":0},"vE9D8tkWEXUFUtMDJuzPNA":{"text":"We always came here for po-boys when it was Huck Fin's.  It was always a good experience. ","useful":0,"cool":0},"eDTtkAZCHTbxDXDa8Hf6Aw":{"text":"I stayed at the attached hotel for several nights and visited the bar and restaurant here ","useful":0,"cool":0},"rixiOxyqD0v0Im2_Z0WyUw":{"text":"Great food, staff and price. Came here multiple times during our recent stay and it never ","useful":0,"cool":1},"aJl1_8kly5ftl1pvGzxYNA":{"text":"Great Staff,\nFresh Oyster, Cargrill way to go. GUMBO is also a good starter.\nEnjoy!\nThanks","useful":0,"cool":0},"HsQLhXBKn7J0V3zeIZoM5w":{"text":"We had the pleasure to have Jeffrey B. serve us and I  can not describe how incredible he ","useful":0,"cool":0},"D3eLHvvGFwBQh8HT9W2Hzw":{"text":"I had - TASTE OF NEW ORLEANS\n\nThree of the city's most enjoyed dishes, all prepared in hou","useful":1,"cool":0},"FuOyeUv5wfWCy77XRHbBcQ":{"text":"Coterie is the new kid on the block and definitely worth trying out. A tad pricier than Ac","useful":5,"cool":3},"XrOtR11-sMOEIzbQ3c_GZQ":{"text":"Fantastic food. We stopped in for breakfast. I had the three pig skillet. It was amazing. ","useful":0,"cool":1},"b4WP8Mst9fVAmpBsqDLH3Q":{"text":"I definitely recommend the Bayou Lafitte for brunch or breakfast. Absolutely delicious. I'","useful":0,"cool":0},"Wce3K_5-pnVok6jWb9enAQ":{"text":"Great happy hour spot. Fresh atmosphere, great service and yummy oyster specials. Will def","useful":1,"cool":1},"k-3lJfine9hLy9Cu0mcXLg":{"text":"We stopped in for a dozen chargrilled oysters. They were good. We enjoyed them. Had great ","useful":0,"cool":0},"JY7p38TzsjBqLk1EKyjJWw":{"text":"So apparently this place renovated and changed it's name, but it is really Huck Finn's Caf","useful":0,"cool":0},"ZYvzzhi0RlKOEpHXj2Q_XQ":{"text":"Had cocktails and appetizers this afternoon. Fantastic!\n\nLoved the crab & corn chowder. Ge","useful":1,"cool":0},"hjrlcOIudZiLRRWH5iXk7Q":{"text":"This place was okay. Tried the Grilled Oysters and the Taste of New Orleans, which came wi","useful":0,"cool":0},"Mldqt7me-Mxhr587Bp5q9A":{"text":"I went for the highly rated fried shrimp. Unfortunately, it tasted like frozen, farm raise","useful":0,"cool":0},"vR9pEr5x1Ierb6C2sAp5NA":{"text":"Food is on point! Service would be 3-4 star but I rate on food. AC could be turned up as w","useful":0,"cool":0},"TPcsStgQJw9fqXDw43_78A":{"text":"Everything we ate here was delicious! The service was great too. Amazing oysters and I don","useful":0,"cool":0},"e3AAbQGqKmIcm90T4gyGEA":{"text":"The Southern eggs Benedict was absolutely delicious!!  Also had dinner last night, the chi","useful":1,"cool":1},"N-Erh4AGqEjI9_cjOSlRlQ":{"text":"Food and drinks were great!  I had the Grasshopper drink so yummy!  Our table shares the c","useful":1,"cool":0},"CL-Rg93fzIG0DMlbUws9yw":{"text":"The food here is awesome! Some of the best fried shrimp I've ever had. The drink selection","useful":0,"cool":0},"aPjiUKXxsMEekGrLNnz1uw":{"text":"I cannot day anything bad about this restaurant, the food was good. Just unremarkable. We ","useful":0,"cool":0},"p-9kBuoEPudd9NSikyMllA":{"text":"I can not speak highly enough of this place. The food was amazing and our service was beyo","useful":0,"cool":0},"OcBu7SR7gpoCOL1FHQCrwA":{"text":"Absolutely HORRIBLE customer service!!! We are in N.O. for a bachelorette weekend & had re","useful":0,"cool":0},"_RuGVOg3eaOBCNjfe96OZA":{"text":"Our waiter Eric was attentive and the food was great!! I had shrimp and grits which was am","useful":0,"cool":0},"gSMGvB3Eo8w7NcWNZfoR5Q":{"text":"This is my favorite place in the French Quarter. The Char Broiled oysters are spot on and ","useful":0,"cool":0},"KxcPM3-rjw4cO888sccqYw":{"text":"The staff 2 thumbs up.  The oysters locally sourced and organically farmed...all I can say","useful":0,"cool":0},"HoD3_4CvKnSfte7rARQZvw":{"text":"I wanted to write this review as soon as I left the restaurant but I thought it would be b","useful":0,"cool":0},"4ygH9aunLOSoXumb6eV-fQ":{"text":"It was my first time here. The etouffee was good. Honestly...I wasn't crazy about the gumb","useful":1,"cool":0},"d661PEykKG5pie31ZcE6rA":{"text":"Don't waste your time coming here. The service is bad...took hour & half to get food, wait","useful":0,"cool":0},"mypV6lyWZq_NM4s7GfWsTQ":{"text":"Brunch was heavenly! From the PJ's coffee with half and half served to the delectable New ","useful":0,"cool":0},"VdA1fC30-CjEehFPOaTT7g":{"text":"Pretty late with this review but I had such a good time in New Orleans on the weekend of N","useful":0,"cool":0},"4vcSSXANAsi5LEITQpoelA":{"text":"Service was too slow and the food wasn't that great. Overall, just another touristy spot.","useful":0,"cool":0},"FaKlbIRBSE-zGWNhkN9-Dw":{"text":"The oysters were great and the seafood gumbo was good. Had a good time listening to the ba","useful":0,"cool":0},"mkuG_pdgHvMvfX15Ex_a6g":{"text":"I try to go somewhere several times before eating to ensure consistency.  Coterie is my go","useful":0,"cool":0},"Y3DxG8ZhchxhKYDIG5MMKg":{"text":"Eric R behind the bar led me up the right path. Thanks man, for doing what you do well! Si","useful":1,"cool":0},"3nmbIK12W4GU5XUJp5bNaA":{"text":"Fast service and great food. A lot of oyster bars close to Canal Street suffer from long l","useful":0,"cool":0},"VTNcFt9_WrF7qYQuKCkDIg":{"text":"I have absolutely nothing bad to say about Coterie. The drinks are awesome, the food is so","useful":1,"cool":0},"B9sQcbWv2sJWkeTPCzAn6A":{"text":"Great place to sit and watch the game as a local or an out of towner. Multiple TVs. Drinks","useful":0,"cool":0},"m60OQ82GFck7dydthYG-mw":{"text":"Server seemed a little stretched thin as we did wait awhile for some things like extra nap","useful":0,"cool":0},"1QZbF9le0MdjK6Zsnqesdw":{"text":"My review would have been a 5/5 if our waitress was friendly and not rushing us to order. ","useful":0,"cool":0},"yx45bH_QLgIDoYXESSRs6Q":{"text":"We went here for brunch because there was no wait and a pretty empty restaurant as opposed","useful":0,"cool":0},"Z-TqDt1C1kgP_x0vybp3RA":{"text":"Clean and adorable place. Many choices for great food. Had the Shrimp Po Boy and a House B","useful":1,"cool":1},"5ln8usE7u14FECpCI8vN_Q":{"text":"We read the Yelp reviews and decided to come in for Happy Hour.  We were seated immediatel","useful":0,"cool":0},"_h2iKotV39CW6EGWtilCbw":{"text":"Came here for a late lunch on Mardi Gras after discovering Acme was closed for a private p","useful":0,"cool":0},"LECQZs3pb7mStjdXCHuBHg":{"text":"Me and my brother went here for brunch and I ordered the Crab eggs Benedict  and it is so ","useful":1,"cool":0},"mp5ESqR78FU5ePJyRVBDyQ":{"text":"Unfortunately our dinning experience was nothing but horrible at Coterie. First, we called","useful":0,"cool":0},"_CmDSEFX4WqLsWNuvSL0Jg":{"text":"Excellent place and excellent service!!! Had a great time the bartender and the oysters ar","useful":1,"cool":0},"PFvGfQj7w50uhHl48V5fVA":{"text":"WOW, what an amazing meal!! We started with a rich warm and creamy crab   au gratin and cr","useful":0,"cool":0},"dNk52xmWNkJNXJjeUQt7LA":{"text":"Visited this place for lunch yesterday and enjoyed it. Admittedly, I only had a bowl of gu","useful":0,"cool":0},"7jYK-Ae4-VCCn-35WwcHIg":{"text":"A cute place with really tasty food! Lots of good options, both traditional New Orleans fo","useful":0,"cool":0},"0lNdkzizeOhnRbWxh1FAYA":{"text":"The gumbo was too salty, crawfish was excellent. I would stay away from the taste of new O","useful":0,"cool":0},"vQCiGZPOFkDXUSaw0G7p_g":{"text":"John behind the bar is amazing. Entertaining and on time. Happy hour $9 for a dozen oyster","useful":0,"cool":0},"j6k-XlNffNUEk4P--9HPhA":{"text":"Darnell & Wes at the bar are the best! Come here for happy hour during the week for great ","useful":1,"cool":1},"WyKRIiLxOm4Vs8YwOF3_2w":{"text":"My wife and I got a real lesson that NOLA isn't really a brunch town. \"We thought\" if we g","useful":0,"cool":0},"5lMrYI9bo9v9bVy54aIvuQ":{"text":"The breakfast here is on point!! We ordered so much: Crab cakes with eggs Benedict, Seasid","useful":0,"cool":0},"DLTjFc6Y81-EzVspJMiQXw":{"text":"This used to be the old Huck Finn's and while the updated space is an improvement the food","useful":0,"cool":0},"k2acOEHSY8Rgg00mtu2NCg":{"text":"Outstanding, try the alagator blackened appetizer, catfish napoleon, and the st-germain an","useful":1,"cool":0},"AO-xTiO8kt_VuWtKvvLP7w":{"text":"Great breakfast for group of 4. Great service too. We had French toast, bacon, sausage, br","useful":0,"cool":0},"rq6oj3iTVSjpTRU0yk5CjQ":{"text":"We picked this place to go one night and we were both highly disappointed. My friend's tac","useful":0,"cool":0},"sCO3BD3TSv3cO7sa6fgFgw":{"text":"Wow just wow!!!! Let me start with restrooms super clean! Moscow Mule is the best one I've","useful":0,"cool":0},"9EP8jedMeDxtIsKCZzTSqA":{"text":"John (4J's) is a fantastic bartender and made the night start off on the right foot.  On W","useful":0,"cool":1},"j2r5C0gkPa9WrruPgjJ8vQ":{"text":"Came here with a group of friends while  we were visiting the city after it had been recom","useful":0,"cool":0},"POsp61MTLHG-loUzZC9fIw":{"text":"Very rude staff. No greeting, water arrived in like 10 minutes, did not get refill after e","useful":0,"cool":0},"M357ODF4UsUnbUPIYU-LMg":{"text":"Worst experience ever!  If I could give this place zero stars I would.  Poor customer serv","useful":0,"cool":0},"jf7fI5sXgz2Z2D0qGPgOUA":{"text":"Used to come here when it was Huck Finn, been here twice this week, and they still can't b","useful":0,"cool":0},"_mPLjHWfDCrAkUunBHL_FA":{"text":"Before I start - we (party of 10) visited this restaurant during a record attendance Essen","useful":0,"cool":0},"903m-aBG4Rnf_3YjEgClRw":{"text":"In my never ending search for the best crawfish etoufee, I tried Coterie.  I was by myself","useful":1,"cool":1},"qOetp5rKJAiDGrbkMCtmyg":{"text":"Meg and Wes were excellent. Great service, with a smile and a great crab cake. I'll be bac","useful":0,"cool":0},"ofXxm1gs_0ZZ_MzLDfBrQA":{"text":"Crab and corn bisque was not too heavy, perfectly seasoned and arrived nice and warm. Oyst","useful":0,"cool":0},"lko5gt7A6zyBFl95T3PhMQ":{"text":"This place sucks. Once again I've got fooled by yelp reviews. Their famous cajun food was ","useful":1,"cool":0},"tdPqmSFi0PUKlOdzUgHZow":{"text":"The raw oysters and tacos were the only hit of the night.\nWe found the gumbo and Crawfish ","useful":0,"cool":0},"Tmsqu6mgKBkxYQP-vkOE9A":{"text":"My family & I had the best experience here. We came in Friday night, and although they wer","useful":0,"cool":0},"81-tTIrrcBHdyNJ-B3XUVg":{"text":"We had the hangover burger and the big easy breakfast. Both were really good. Service was ","useful":0,"cool":0},"9C2ggviNhSxNrhlflFihTw":{"text":"Breakfast brunch and cocktails were phenomenal!\nI usually judge a Bloody Mary by it's tast","useful":0,"cool":0},"kvbpfItJOU9aA9vlrLU4lQ":{"text":"Service was great and fast. Food was delicious. Great over all. The beignets were really r","useful":0,"cool":0},"ehzQPXT5Fz4n4pmy9hCmXQ":{"text":"This place was amazing! Fantastic and quick service, beautiful space, expansive menu, and ","useful":3,"cool":0},"TmgqMRIdnzqTUEMTND8D2g":{"text":"We stopped in for happy hour on Wednesday which was from 4-6. Happy hour included a dozen ","useful":0,"cool":0},"Zj0JlI_gS2sVXvxjSfPt4w":{"text":"This was our second time here. The first was when they had just opened, and this time with","useful":0,"cool":0},"rCDcP-38O6hh80VtrKEjCw":{"text":"Omg the BEST charbroiled oysters and gumbo I've ever eaten. Drink menu is on point too. Th","useful":0,"cool":0},"A2t0N9YQPzLVYGSTAqhC4Q":{"text":"I really enjoyed this spot. I had the oyster salad with fried green tomatoes. Really taste","useful":0,"cool":0},"OqoOgocgd7s-khamNvPYpQ":{"text":"Came here on a whim, and it was sort of a mixed bag. The wait staff was kind of rude, but ","useful":1,"cool":0},"v-Y8R-_o8VEjAW-jkG8Yuw":{"text":"What I'm about to write will seem like a fake review, but it is 100% legit. A friend who i","useful":0,"cool":0},"yvz8sZBvHEB2mLnmcOIPYw":{"text":"On the corner of Decatur you'll find this gem where their signature dish of course is oyst","useful":0,"cool":0},"_tPN_71I3RIK4ofgsFrUYQ":{"text":"We had the BEST experience at lunch today! Charbroiled oysters, gumbo, crab cakes, stuffed","useful":0,"cool":1},"fmA-mmGeeScq-EhZLiaWhQ":{"text":"Stopped by for happy hour on a whim for $5 cajun bloody mary.  Bartender Donte made awesom","useful":1,"cool":0},"62aoxiG6sUCh9Ll3RgjqMw":{"text":"Came to this restaurant for a bachelorette party. Was seriously disappointed that we had r","useful":0,"cool":0},"mARVky4Fmp1FLVLwlYLfKA":{"text":"Really great service, food was ready very quickly. The prices were very reasonable, and th","useful":1,"cool":0},"Dnc9lPJQK0ClF8GQakkjoQ":{"text":"I came upon this place while waiting for a room at the hotel next door. They didn't have a","useful":0,"cool":0},"Yi_yRWMRTtYLmzz68DtGcg":{"text":"Nice ambience.  Convenient location.  Friendly servors and fast service.  Food was good bu","useful":0,"cool":0},"Mo6GxE49uVmzyc8kvb2-vA":{"text":"I went to New Orleans for my bachelorette party and we immediately started our weekend her","useful":0,"cool":0},"AZanylrWWAyYq8QHnLBhzw":{"text":"I ate here because I had just flown in to town and couldn't get in anywhere else. There is","useful":0,"cool":0},"hZjzcZsbGvEsetfbO4qU9g":{"text":"Food here is awesome, and this restaurant is new and you don't need to wait to get served.","useful":0,"cool":0},"bY09VKWpDKBpdxUOMn6L5g":{"text":"On our way out of NOLA we decided to stop at Coterie to try the Poboys and I'm glad we did","useful":0,"cool":0},"S9nDYDinrsmQtOiRy7gsAw":{"text":"The BEST oyster shucker in the city! These are the freshest, cleanest, and COLDEST oysters","useful":0,"cool":0},"S-evl64gqrTA7qryKaZXBQ":{"text":"Discovered this place on yelp because it had decent reviews. Items looked good in pictures","useful":0,"cool":0},"VWhE6Qi-U1O9Xi0fDGR1pQ":{"text":"I tried blackened alligator and seafood soup. Both TOO SALTY. The alligator came with sour","useful":0,"cool":0},"DWcwrRm1wryRdHxmuug56w":{"text":"If you want New Orleans food that is geared for tourists, this is your place. I got the ta","useful":0,"cool":0},"eX48WNX8q0RgzCXTGBKZQA":{"text":"Watery drinks. Old food. Must try harder. Nice decor. Very disappointed as I thought it wo","useful":0,"cool":0},"t_RVVu8TbfM12gXLGcmeJQ":{"text":"Wow!!! By far my favorite Bloody Mary ever!! The food was on point. Good Deep South NOLA s","useful":0,"cool":1},"N2lShMVOR78tqeX6X2PxzA":{"text":"When I first walked I had the best welcome ever! Everyone from the hostess to the oyster s","useful":0,"cool":0},"xSj9xLYmdvZAppWLutp1Vw":{"text":"Love this place! They have the best hurricanes and oyster happy hour. Bar tenders are very","useful":0,"cool":0},"zoiWfy50bYkOBI4Q9X6rMQ":{"text":"Enjoyed the food and atmosphere. Very friendly waitress.  Alligator tail appetizer was awe","useful":0,"cool":0},"tnAQmcKJ1yc3IS3MJGuBjg":{"text":"This place was awesome and the crab cakes were 100% ! I was late meeting my friends, but K","useful":0,"cool":0},"iDVJtHtt3oyQYuc6I0OdNw":{"text":"The BEST chargrilled oysters ever! OMG! And the beignets are perfectly  the negates are oe","useful":0,"cool":0},"Hje9KQ9zC2K-3sCTo52S_g":{"text":"Great atmosphere, great food. I recommend the grilled mahi-mahi and fried pickles! I'm not","useful":0,"cool":0},"K4SDc4pbzrBoB2DAlFWqDg":{"text":"Had breakfast here an ordered Beaucoup Breakfast which was fantastic. The pancakes were aw","useful":0,"cool":0},"ku9jY6Os4TKx8Bau8FCiwQ":{"text":"We got seated right away at Coterie for breakfast on Sunday morning. Server was great. Ord","useful":0,"cool":0},"3E8Ji4yBc_WVhvl3sktJ5A":{"text":"The grilled oysters are UNREAL here! In my humble opinion ACME was good but- this was even","useful":0,"cool":0},"bAz0SkYhtNPoTAwkJakDgQ":{"text":"umbled across this place on accident was looking for huck finns, which I guess was the pre","useful":0,"cool":0},"tyg9GkJe39brsmDP_SDZcQ":{"text":"I stopped in for dinner, flying solo, so I sat at the bar.  John was tending, took my orde","useful":1,"cool":2},"knrowHdu1uLK9fvEp2HwQg":{"text":"Loud\nPlace feels like a high end pub\nFood is ok\nIf you are not a smoker, constantly there ","useful":0,"cool":0},"Zmr0ASd3qxW3NKLn5x4Bxw":{"text":"This was the best breakfast I had while in NOLA. I ordered the Bayou Lafitte skillet and i","useful":1,"cool":0},"3wLJOklyr6jXtOQSYJDgRg":{"text":"A sampling of New Orleans Cuisine!\n\nCoterie Restaurant & Oyster Bar is the perfect place f","useful":1,"cool":2},"RG0S58t1jrvc22_vhwLicg":{"text":"The food was tasty & would have been great if the crab cake wasn't cold and the crab & cor","useful":0,"cool":0},"VUHHIGW9ae_DKgguVupM_w":{"text":"It was our first time in NOLA and we just stumbled in this place as it was around the corn","useful":1,"cool":1},"dYT_2QIKn8nNykiqXq0duw":{"text":"Entrees came lukewarm but they had good flavor. Service was disappointing, had to attempt ","useful":0,"cool":0},"BorkXHPM6jfmaq4OfzEECQ":{"text":"I'm not much of a breakfast person, which is the reason this restaurant was pretty much a ","useful":0,"cool":0},"WPwhaIa1ccEBlk3P1BWtOQ":{"text":"Do not miss this place! Seriously great food! Chargrilled oysters a must! We were really w","useful":1,"cool":1},"e82BFeYKjmX4B4Y2X-CPRA":{"text":"The ambiance is fabulous. Staff is friendly and on their game making customers fabulous fo","useful":0,"cool":0},"B-d2m9Ep8K69AjPyupQtcg":{"text":"Spicy New Orleans goodness..gumbo, alligator,  crawfish etouffee.. everything was delish.","useful":0,"cool":0},"TcH9sgFz-XP_ttE0Ya30tA":{"text":"We waited over 10 minutes for a waiter to even approach our table and bring water. Also, m","useful":0,"cool":0},"4LRRH7mYp8-rahAv0I9ndA":{"text":"I wish there was a way to rate our service, management and food separately. Our waiter was","useful":0,"cool":0},"garFfdNYsAzjc0gI15nB-A":{"text":"Pretty good seafood restaurant near French Quarter. Crab dip was very cheesy and didn't ha","useful":0,"cool":0},"RJEhuycn2AyONgNIeaVMnQ":{"text":"Went to this restaurant with a friend on our first night in NOLA. Conveniently located in ","useful":0,"cool":0},"B1uPM2Agc4MIdIrHsQTo3g":{"text":"We were seated upon arrival, but it took about 15 minutes before a waiter even greeted us.","useful":0,"cool":0},"N5uwXDGgsXZhrLr3YDtIKQ":{"text":"Service was horrible. Waiter stood at table behind us chatting up 3 attractive young ladie","useful":0,"cool":1},"YIjtXjf7isbUtZNDlLcrVQ":{"text":"Restaurant staff didn't acknowledge me. Sat at the bar for a little over five minutes, no ","useful":0,"cool":0},"6v6MgmQ2ZqJWX-2BGq2Bgw":{"text":"Stumbled upon this restaurant as I wanted to try some Gumbo, which was very good. The bead","useful":0,"cool":0},"FA0Ab3Tc4bgTiSORa_BIlw":{"text":"Delicious!  Great service and food. Restaurant decor is clean and hip. Great choice amongs","useful":0,"cool":0},"GmxxSyGPsqskcgVByokgWg":{"text":"LOVE THIS PLACE!!!! The entire menu is absolutely wonderful!! But the best thing is the Ch","useful":0,"cool":0},"hY8FX800rxa1L2uYFhD9Ew":{"text":"Michael made our dinner a night to remember. The food was wonderful and our conversation w","useful":0,"cool":1},"gUt0JPcDGyAMNn56sZ4gSw":{"text":"This was our favorite of all the places we ate in NOLA. Good food & great cocktails. We tr","useful":0,"cool":0},"q9pwKFqdWeTF_qDUNXxNrg":{"text":"Ok.. here we go. This place was a disgrace to anyone in the restaurant industry. First off","useful":0,"cool":0},"Mrx_xkatN0126SUII2llyA":{"text":"I have been to Nola several times and just found this place.  I was so happy to get my doz","useful":0,"cool":0},"sf4wriFp17mjpBLKi-kesw":{"text":"Visiting NoLA with the wife foe Mardi Gras. Sorry, but food is not good at all. Presentati","useful":0,"cool":0},"kjGU0oY5QyZ25QGPpDjjYg":{"text":"Love the raw oysters and the chargrilled oysters were so good! Planning on going back this","useful":0,"cool":0},"aUam9be19bzvy3MmzR-9Xw":{"text":"I think Coterie deserves a solid 3.5 stars - but I'm giving it a 3* because I find the ove","useful":0,"cool":0},"cYeszz-ZYSgPeGq7mtbhcg":{"text":"This place is awesome! Came on a Sunday morning had the crab cake and eggs it was deliciou","useful":0,"cool":0},"iuUya8TtQtrjXAIbUswaHw":{"text":"We stopped in here after seeing it listed on the Coolinary New Orleans menu.  We had the C","useful":0,"cool":0},"Vx9Nx5RckA8xuytsRY9ogg":{"text":"amazing char boiled oysters. if I had not had their oysters, all the others would auve bee","useful":0,"cool":0},"-3iHHrkMPijbuqF-DueIXQ":{"text":"Quite possibly my new favorite restaurant in New Orleans. I've been here three times now (","useful":0,"cool":0},"pNdYZB0piQ4cCAZEWPs3nw":{"text":"I had high hopes for this place. I booked a reservation early in the morning through Yelp ","useful":0,"cool":0},"5bQfwFnw8EuJI0s6uy-CdQ":{"text":"Best meal we had in New Orleans for the week that we've been here. We had oysters for an a","useful":0,"cool":0},"WmjNWvjQq-j2apL_2tu8TA":{"text":"Had veggie wrap, which was nice but closer to 'okay' than to 'great' on the scale. Fries t","useful":0,"cool":0},"OlqTvhfyHgJcj5OI4vLKnw":{"text":"Lunch here was good. Place is very clean and so were the restrooms. Waiter was good and ga","useful":0,"cool":0},"lG0NxuAlRyiDOSt3HQKh1A":{"text":"Great find. On a corner Awesome bartender Darnel the Mother Shucker!\" Fresh oysters are ve","useful":2,"cool":1},"U7j8ODC1ad3jW_DoTzm3EA":{"text":"Just went here and the bartender told us that the chef doesn't feel like shucking the oyst","useful":0,"cool":0},"xe5T5FBhV8w9d11ExVIXSA":{"text":"Classy place but not linen table cloth fancy which was perfect for lunch. Raw oysters were","useful":0,"cool":0},"fG_9cMVkvCSXrQe2EXa8QQ":{"text":"Michael R. Is the best server EVER!  He was so intuitive and catered to our every need!  T","useful":0,"cool":1},"loMUx94IReRsNd0mzDoLCg":{"text":"Found this restaurant while on vacation. The reviews on yelp were good so we decided to ch","useful":0,"cool":0},"i7wbK2Xgs936Ggne0ZIXdA":{"text":"I do not think there can be a restaurant with a worse manager than this one. We had a rese","useful":0,"cool":0},"vu9RlgGU4yyOdAYBltn0PQ":{"text":"My brother and I started a 4 day oyster tour of the gulf coast right here. We drove from N","useful":1,"cool":1},"bFpL5pLMqWjsZZ4GOk8W8Q":{"text":"If i were an owner of this restaurant I would change the name to Meh. The ambience is meh.","useful":0,"cool":1},"n9XzRgF0_u7OyJ1SYoThaQ":{"text":"We had a dozen of half shell oysters and another dozen of charcoal grilled oysters. It was","useful":1,"cool":0},"aH1YkCGBXrR87-NBGLkibg":{"text":"The BEST oyster shucker in the city! These are the freshest, cleanest, and COLDEST oysters","useful":0,"cool":0},"iRvO8g8HPz-Ov76nRcz4jQ":{"text":"Food was decent but the women that work there have terrible attitudes! I will NEVER eat he","useful":0,"cool":0},"7ClDkqVgplPeNOHxgeZDRg":{"text":"Great interior and great menu.  The breaded fried pickles were a must have treat along wit","useful":0,"cool":0},"9koQS_S_XcK9wuxbVE9WLg":{"text":"Food was pretty good. But service was horrible (unless you were a middle aged couple) they","useful":0,"cool":0},"8gYBhPGu9mK1VUAaGAjU4w":{"text":"Nothing was bad, everything was perfectly adaquit, but that's just the problem. The waiter","useful":0,"cool":0},"D2BQBJb0rIhlny2CRWTzDw":{"text":"I found Coterie on Yelp! and I was very pleased with it.\n\nCatfish Napoleon was amazing and","useful":1,"cool":0},"nAXXETg5Qur6OgEXamt7uA":{"text":"Horrible service , food was not great, skillet was just full of potatoes and missing all t","useful":0,"cool":0},"ZaGVdhIHxNS9hM0IYN2IYA":{"text":"We stopped in here for dinner not knowing anything about the place. The menu on the door l","useful":0,"cool":0},"fSOMtNuZO9kudtQG6pnhVA":{"text":"Wanted to show my 5, 10, and 13 year old some delicious food that N.O. is known for. Their","useful":0,"cool":0},"h0wY0Zxee2IrpKaLMW0_vw":{"text":"We went for Dinner. The service was very Slow. The food was pretty good. Waited forever fo","useful":0,"cool":0},"usm5rQErBXPZY3lqtOv5Cg":{"text":"We stayed next door at La Galerie hotel during our trip, so we visited this spot a lot. Th","useful":0,"cool":0},"ryCJVNnvkClK88yPfSlU3g":{"text":"Really good food. I had the crab cake pasta and it was to die for. Service was really good","useful":1,"cool":0},"KlbRuYBCvQdn-NJsQVLvBg":{"text":"Great location and friendly staff. Chargrilled oysters were good but not the best. Unfortu","useful":0,"cool":0},"5zfYgSUsOt-8rC9uGEuc5w":{"text":"Unfortunately the experience at this restaurant was below par. I ordered a rib eye and hon","useful":0,"cool":0},"yTVU3ATLHyvf7IMci2v6Mw":{"text":"This place is fabulous.  Everything we ordered was delish!!! Highly recommend this place!!","useful":0,"cool":0},"mRIXoqX4UJaHJUbhKbq3pA":{"text":"Yumm.   Sampler plates.   Loved em all. Though gumbo little too spicy for me.   Loved etto","useful":0,"cool":0},"Ol7G3E7_mrzJdqQ9h4Vtew":{"text":"We stopped in for a snack of chargrilled oysters and cocktails in the early afternoon. Oys","useful":0,"cool":0},"TUqkV8Jab5vDs054yKMs7Q":{"text":"Bar staff needs to be upgraded, especially ones from today (4/2) around 12:30pm - the guy ","useful":5,"cool":5},"yvrczG2lnAH6nNGxyhIGvw":{"text":"We stopped in for lunch first day in town for a conference. Service was slower than we are","useful":0,"cool":0},"D9VBg6_7IdQ7Hx1kS1YxNg":{"text":"Sat at the bar for dinner. The bartender was friendly and attentive. I ordered the eggroll","useful":0,"cool":0},"EnGpEwMhzgL3dPb4SW5G_A":{"text":"Food was good. No wait, which was nice. \n\nThe staff was amazing. Everyone was very attenti","useful":2,"cool":1},"2_ZVGh4FotJQG7srsys3sw":{"text":"Some colleagues and I were in New Orleans for a conference last week and we were looking f","useful":0,"cool":0},"gVwTdEROHpD8YiuM23QniA":{"text":"The bartender made the best White Russians I've ever had. We were in town for Mardi Gras a","useful":0,"cool":0},"uggV39XeT5GGjCmItjn89A":{"text":"The chargrilled oysters were great. So were the crab cakes! The bartenders were very atten","useful":0,"cool":0},"VAtZ8zwfRP_4zNyk6kBa_w":{"text":"The alligator appetizer was good, light and flaky with a good taste and good meat content.","useful":0,"cool":0},"YY9SpOln8hGZyt2hLP7DoA":{"text":"Been eating here for years and always good! Went in tonight and the appetizers were good, ","useful":0,"cool":0},"0r8XDl54jiYQm0ayimG4bQ":{"text":"Been here a a few times for the Happy Hour Oyster Special ($3 for a dozen raw) and, it's a","useful":1,"cool":1},"TRaodE4ydhC8VcLdLnBxkg":{"text":"If you're thinking about going to this establishment, simply don't. The food was okay but ","useful":1,"cool":0},"20_N6eu09IZlWZaDeUZppA":{"text":"Came here for breakfast and had the Louisiana omelette. Can I just say heaven! It was deli","useful":1,"cool":1},"O5Je9Nu50JN_LYvQ1VTZ2A":{"text":"Found this place via Yelp the morning after a long night at Bourbon Street. I had a sip of","useful":7,"cool":7},"TDavI-JciULjLh-A5bE8fw":{"text":"We found Coterie by accident and we are so glad we did!  What a treat!  Fantastic food and","useful":0,"cool":0},"M0ZBdcmn81QYwA59HpYcSQ":{"text":"Great place for breakfast.  Omelets and crawfish dishes are awesome!  Service was good too","useful":0,"cool":0},"s04_wUBbtI5K52EWzUKPWw":{"text":"The service was excellent, the food is amazing! I definitely recommend this place when you","useful":1,"cool":0},"928pnxlG9cARXI7Mxi7dVA":{"text":"Solid oysters. Went for raw and grilled. Great bartender. Beautiful facility! I'd recommen","useful":0,"cool":0},"5W1pVNdMxjpJA55X5KvJbQ":{"text":"Darrell is THEE ABSOLUTE BEST! He effortlessly engages with everybody at the bar, kept the","useful":0,"cool":0},"DkjcbGO1939hZBD3WdRPsw":{"text":"Stopped in after another local place was closed due to \"doing inventory.\" Nonetheless, pla","useful":0,"cool":0},"zfnYd0ltFJBdGuoQJKNOHA":{"text":"OMG!!! Absolutely the most amazing place to eat while in New Orleans!!! They have the best","useful":0,"cool":0},"z3_LYPRbZiySiYfzIWadFw":{"text":"Well being a NYC girl myself I was so impressed by one of our very first stops for our lad","useful":0,"cool":0},"V9rG98ywHgxAsPAoRxG1WQ":{"text":"A This is the most disappointing meal I have had in a very long time. I would have rather ","useful":0,"cool":0},"0Jo65ee1fW-NblXUduvzag":{"text":"My husband wanted grilled oysters so we stopped in - says they are the best he has ever ha","useful":0,"cool":0},"q9eK3_YhyMaF7ZJeCcWGNA":{"text":"Service is great and the food is lush.  Had the Corn and Crab Bisque and the Shrimp Pasta.","useful":0,"cool":0},"gFdrQ8FSe5HGFobTZi6Ppg":{"text":"We were going to fo to Mothers but our concierge suggested this place instead. Short wait ","useful":0,"cool":0},"GO6atb0QVNgCvRUaU57RnA":{"text":"Darrell is THEE ABSOLUTE BEST! He effortlessly engages with everybody at the bar, kept the","useful":0,"cool":0},"eU07XdQhNuMxmD4ARJdd1g":{"text":"We stopped by for appetizers. The service was very attentive and friendly. We tried the bl","useful":0,"cool":0},"5V3eOp2skyxhiugEgjUNEA":{"text":"This place is amazing. This place has the BEST red beans and rice. My husband really enjoy","useful":1,"cool":0},"6Z-M8Ohk5TJ00Uad7RGPmQ":{"text":"I ordered the oyster Florentine, crawfish egg Rolls, and seafood gumbo through Grub Hub, b","useful":0,"cool":0},"3TsOMda_N43k8ZbUJs4ihQ":{"text":"This is my favorite oyster restaurant in New Orleans.  I had the Southern Benedict with ch","useful":0,"cool":0},"Lo-K0XiSGDsJpWXgonNWFA":{"text":"We had the best experience here last weekend.  In town for a wedding stopped by here durin","useful":0,"cool":0},"DkKM0vYbm02KLpuHhteZhw":{"text":"I just don't get the reviews! I was dying to come here based on the four star yelp reviews","useful":0,"cool":0},"t37BeggDsh38ZeZSsA5JDQ":{"text":"The chargrilled oysters were amazing. The butter garlic ratio was perfect. Ive had oysters","useful":1,"cool":0},"4Rp_NY0jkIok3_JnikOZxA":{"text":"Had the shrimp and grits; it was delicious! Our server (Will) kept us entertained with fac","useful":0,"cool":0},"C49x3cSq8JwS5BTVaxqt6g":{"text":"Nice atmosphere and good food.  The red beans, rice with sausage and gumbo were delicious.","useful":0,"cool":0},"w8WDBKutGKaYBaoMea6Kxg":{"text":"We were so disappointed. Yelp has the rated as 4 stars.  The only reason I am giving them ","useful":0,"cool":0},"TcJ8Od_azEJBVM3vC6OBUw":{"text":"Literally the best oysters I've ever had and the bloody mary's are good and spicy. I come ","useful":0,"cool":0},"8I_8srkuqv-kao-DpzzEIg":{"text":"Great breakfast. Stopped in for a quick breakfast before being picked up for a tour. The f","useful":0,"cool":0},"5LRvIXr_uKoOO1bRgRWpww":{"text":"Stumbled upon this place of a gem. Sat at the \"oyster bar\". Outstanding grilled and raw oy","useful":0,"cool":0},"uGuhYwwrDgT_JXJEJyQMCg":{"text":"Very good restaurant that opened my wife to a new food experience; raw oysters! Se loved t","useful":0,"cool":0},"GcvJjcbmSdGGzRWYusdsrQ":{"text":"I would have given 5 stars had the potatoes been at least warm. Taste is everything. Boudi","useful":0,"cool":0},"eGI_GQgiUZmIW0hKKDLFlQ":{"text":"Lowe and Nick are amazing. Best customer service and best oysters and breakfast. These guy","useful":0,"cool":0},"OsVjZFyOSMf0tTINWFu04A":{"text":"We were dying for good breakfast food and after not being lucky with waits we came across ","useful":0,"cool":0},"MWf9tTD-1mlcqi2wF20Jmg":{"text":"The food was decent. I wasn't overly impressed with the taste of the food. I was disappoin","useful":0,"cool":0},"6X7c8tQLiQhQkKV8ARRvNA":{"text":"Hearty red beans and rice.  Some really top notch gumbo and the blackened gator I had was ","useful":0,"cool":0},"_fszWsQURFBwapifyM11Dg":{"text":"Love Love Love the Oysters Rockefeller! They were big, plump, juicy oysters smothered with","useful":0,"cool":0},"AogVDozTv5fh50KuV0NCCQ":{"text":"Lowe is a fantastic server and made our meal special and full of area information and advi","useful":0,"cool":0},"T9JozAoTFLnd2diEsKTzIA":{"text":"The single worst service experience I have ever encountered. 20 minutes at a table with no","useful":0,"cool":0},"X_LRePUN21pfdZ7r-9ieQw":{"text":"Absolutely fantastic! Everything from the oysters and crab au gratin to the chicken and ma","useful":0,"cool":0},"iGdwFLX54uUrEPoBbhXrQA":{"text":"My Facebook review applies here too: Best value in the French Quarter for authentic Cajun ","useful":0,"cool":0},"WO6tEkz_5ovEQ9_TZH8HTA":{"text":"The food was delicious. We started out thinking we were going to eat across the street at ","useful":0,"cool":0},"fkRdDr9BLxUaAjpF_M2QTg":{"text":"Came for happy hour and got their $5 Hurricanes which were awesome.  I think better than P","useful":0,"cool":0},"i1jgLarNI2iqlt0s8YCRew":{"text":"Ate here for dinner with a group of 6. Place is a bit small for a larger group, but they w","useful":0,"cool":0},"JO56n9rmekWdL4o0f8pqjQ":{"text":"Came here as part of a food tour. They provided a sample of red beans and rice and I also ","useful":0,"cool":0},"ySO-0lZ0I1wUJUwPi3kCSA":{"text":"Was in New Orleans for the Rock 'n Rolls races last weekend, and ended up eating 6 meals h","useful":0,"cool":0},"wbeE-qV26Wk4HKhdck3Amg":{"text":"Wow! This place was a pleasant surprise. We walked in and sat at the bar for some oysters ","useful":1,"cool":0},"W8lAsf2v9d_IrlUZCdOicQ":{"text":"We stopped in for a snack of chargrilled oysters and cocktails in the early afternoon. Oys","useful":0,"cool":0},"hCYC75vv0TMZZjm2qwaP1Q":{"text":"Quick service,  delicious cocktails and my dish was on point hot and scrumptious.  Tracy w","useful":0,"cool":0},"WhFMd8H5tUBJebFKOADbVA":{"text":"Cab driver recommende this spot over Acme for oysters.  Glad he did. The oysters were the ","useful":0,"cool":0},"cpCg3CTX56AX0CBlNdrFfw":{"text":"Yum! Jambalaya was excellent and great service.  Love the atmosphere. Super clean and pret","useful":0,"cool":0},"6BWMgnfQKIXf18bTvyYJ4g":{"text":"Crab cake Pasta. Super delish! They also have happy hour M-F 3-6. 3.50 martinis and cosmos","useful":0,"cool":0},"iT_c9iAhpETUjcZERQYp0Q":{"text":"Best food we've had so far on NOLA. It was tasty and the seasoning was spot on. The servic","useful":0,"cool":0},"OuD-q7B3MM0Ofw69rSm2BQ":{"text":"Our first visit was a mistake because our usual breakfast spot was ridiculously busy. But ","useful":0,"cool":0},"epN_-bNiKMDXHxIrmRKr8w":{"text":"Very nice restaurant. Beautiful decor and a large assortment of dishes. Our waiter, Frank,","useful":1,"cool":0},"ySlgDk-WYoGo8wpjnQDOYg":{"text":"We were on the hunt for a good breakfast this morning. We stumbled across this place while","useful":0,"cool":0},"-IL743OtzLTf4Ek6l571iA":{"text":"Loved this place. Food was amazing and entrance from our hotel. Wait was short and service","useful":0,"cool":0},"aBZhTpGtmxITIF6RIncidQ":{"text":"My husband and I LOVE broiled oysters and the charbroiled ones here are up there with my f","useful":2,"cool":0},"gN46c5_M-FrDvpz1b_Fjqw":{"text":"Great little restaurant just a little ways away from the craziness of downtown.  Shrimp wa","useful":0,"cool":0},"pbXSvqJzz8WTXXOZ7Wq73Q":{"text":"I was ripped off. $30 order to get a small box of soup like thing. Where is the crawfish a","useful":0,"cool":0},"fnMB6vLojVZ3q8g13S-gYg":{"text":"Don't think about it...just GO EAT HERE!!!  Seriously, we ate there ON Fat Tuesday for lun","useful":1,"cool":1},"8I6WHbDDj2SvtjHLZqHUjQ":{"text":"Their chargrilled oysters are delicious.  Oyster shooter was good too.  My daughter had th","useful":0,"cool":0},"1ZkkRttgN-rQfrmzq2U1WA":{"text":"So good!! Started off with the French 007 which... you can't go wrong with champagne and t","useful":1,"cool":0},"3ULaMutc0Y5rLJld1ag0fw":{"text":"Stopped in for brunch and had a truly enjoyable meal and experience. I may have only order","useful":0,"cool":0},"Foeq8K_WBcE35J_EeZ86Cg":{"text":"We got delivered breakfast... let me tell you had me slapping my knee !! Wanted to slap my","useful":0,"cool":0},"e1LWilvNWIE7lvN5tpFNjQ":{"text":"Really great food! I wasn't very hungry, so I had fried pickles as an appetizer and a gard","useful":0,"cool":0},"-EyBxc8f_8bj2q3Vx4lFTw":{"text":"Eh. It's ok. It not good but it's not terrible either. The Boursin balls were a little bit","useful":0,"cool":0},"C16S5mv_EnuOCWJ7jTkCpQ":{"text":"Shrimp and Grits were the bomb! The atmosphere is also very nice. We sat by the window- wh","useful":0,"cool":0},"v8H8E64c0R1nrGsJ18xbnA":{"text":"This place has really good food, and also a really good happy hour with specials on bloody","useful":0,"cool":0},"__6jGZLW7OjS0TlAeb5yQg":{"text":"The food here is amazing!! And the restaurant is very beautiful. \nI'm taking away stars be","useful":1,"cool":1},"YmBxG2hp5NXCj9G3Qbc4WA":{"text":"The food and service here were phenomenal!!!! We made a reservation and had a great meal a","useful":0,"cool":0},"8Jyj6W27m2uBn8LA2oIcGA":{"text":"This place was next to our Hotel, we had drinks and breakfast there probably 3 days in a r","useful":0,"cool":0},"5oCiHIjBcVNGkxKNkGLjZQ":{"text":"We chose Coiterie because it was a short walk from La Belle Maison. First stop was for din","useful":1,"cool":0},"wn5g91ew6U3NtQk-gfyppg":{"text":"Was staying at the hotel next door and decided to come down to Coterie for my last night v","useful":1,"cool":0},"6zh2PSdgm8QjLZrYDMudTw":{"text":"I would have given this place 5-Stars except the seafood platter wasn't as full as other N","useful":1,"cool":0},"VteEplyLi-K4hvZeLkhGig":{"text":"We really enjoyed the Coterie.  The staff were very helpful and the food was amazing.  We'","useful":0,"cool":0},"ELF3dMYV-ihkO8b0g6-RdQ":{"text":"A really great place to eat in New Orleans! Perfect old New Orleans charm. Fried alligator","useful":0,"cool":0},"eDipkikkgNhGyN665RCcpQ":{"text":"If you want authentic, delicious food with amazing customer service you need to come here!","useful":0,"cool":0},"sQhFl0oHUegGZ_ZPt60bwg":{"text":"Great atmosphere and the most fresh, amazing food! I had the seafood bisque and my boyfrie","useful":0,"cool":0},"isEN_KpmYWTrEerUTYYdDg":{"text":"Came with a recommendation from a friend and we were not disappointed. We have kids so we ","useful":0,"cool":0},"M7TkrAmgR-v4BwyiUczUWg":{"text":"Hands down probably the best meal ive evern eaten in my life! I got the Breaux Bridge Boud","useful":0,"cool":0},"C1N0WqbzqvpRCIjYcrEa_Q":{"text":"I came to Coterie for lunch with colleagues.  I always thought I wouldn't like oysters bec","useful":1,"cool":0},"NSUs1168GLHB3lOU6eTt9g":{"text":"Menu seemed promising as I reviewed it along with other options in the area. We waited a m","useful":0,"cool":0},"FvmuawLOsvcyXISBpKZhTg":{"text":"Went here with my daughter and boyfriend who were visiting from Germany, as my daughter wh","useful":0,"cool":0},"ks4MXxE71mAgLgsAF9Ma_w":{"text":"I came in the other day and had a young lady named Laura as my server. SHE WAS AMAZING! Ev","useful":0,"cool":0},"wEsIctyV3iX1MuJPQl67rQ":{"text":"Just wandered into this place after a Segway tour.  Got a dozen raw oysters and wine.  Man","useful":0,"cool":0},"3-3u6mtacvrPcZo65lM7Uw":{"text":"Terrible service. Bartender was rude and didn't know how to manage her bar. Skipped over m","useful":0,"cool":0},"f2X1e_zE9s3QBzBeOGc8jw":{"text":"Our absolute favorite place to eat in New Orleans!  Blackened Alligator appetizer was so t","useful":0,"cool":0},"s5eaTPy11R3tkqxuSTBgGg":{"text":"Eat Here!\nDrink Here!\nSee Manager, Jack for great recommendations on everything from drink","useful":1,"cool":1},"vlWMykVGhZ-X3yS9M6El8w":{"text":"Food was pretty good my wife's French toast was soggy but over flavor was on point ... ver","useful":0,"cool":0},"3QSxcF1Qgheu_B643OkVmQ":{"text":"The service is mediocre. The food is ok at best. Their Cajun egg rolls are good. Their Éto","useful":0,"cool":0},"Rat5XkNgGTI0SS8exL5taA":{"text":"So happy we didn't wait in line at the place our friend recommended. Coterie was an absolu","useful":2,"cool":0},"M-D5Gr2JuasHkiPeVYfrCw":{"text":"Came in just for the charbroiled oysters. This place was recommended by a boat captain on ","useful":0,"cool":0},"Z9SASWMiPQI5HPk4tONLrA":{"text":"The oysters bienville were excellent. Served nice and hot and the portion was perfect for ","useful":0,"cool":0},"RXARHni5PAXyge_sazB19g":{"text":"Ordered delivery on Seamless app for four adults. Was disappointed when I called the resta","useful":0,"cool":0},"zSFfAQsfNA8wf8hXqQxaSw":{"text":"The food here is amazing, their red beans and rice were absolutely perfect. The gator plat","useful":0,"cool":0},"dK3hqf5S8JTgKJ2rxfbuGA":{"text":"Slow start with service, but turned out to be great overall. Went for happy hour and wante","useful":0,"cool":0},"8UhWT7KyJE_Iz64wiUT3hA":{"text":"I love this place.  \n\nWithin the one week I was in New Orleans, I've had breakfast, lunch ","useful":0,"cool":0},"t3M5sODuFrC8OUQo9-mhNQ":{"text":"We've been on vacation in NOLA 4 days. Been looking for oysters. My husband found the Cote","useful":0,"cool":0},"Raun5tvBtKLqg82gW8bqbw":{"text":"Arrived to this restaurant around 730pm. Place didn't look busy at all , So we got a table","useful":0,"cool":0},"N2FCOaLTNI_G6-vwnFrqmw":{"text":"We arrived 10 min before breakfast ended and was told 5 people were in front about 20 min ","useful":0,"cool":0},"LrqyfK6wc1yt_r47C_n6eA":{"text":"I'm a local I've passed this restaurant several times because Of past history of not givin","useful":0,"cool":0},"xlfv4TEhUuNE-yrQ88vV9g":{"text":"Our hotel suggested this place for a good Hurricane which my sister really enjoyed. The pl","useful":5,"cool":2},"ucg_r1cVxhS1QxibHG72vw":{"text":"We went here during a bachelorette party with a group of 9.  We had vegetarians and foodie","useful":1,"cool":0},"2E7lWrJ_J6IHN8iA2GdfPw":{"text":"It was our first time in New Orleans, and the Coterie was suggested, and they did not stee","useful":0,"cool":0},"JgBOZ7lZusbTjdDAzTWvpg":{"text":"Horrible bar tender. Rude, unfriendly, and overcharged. \nAvoid this place. There are so ma","useful":0,"cool":0},"HZUERntAl3JXLuNfTVqg-g":{"text":"Stumbled upon this spot on our way to the House of Blues, and we were so glad! Wes picked ","useful":0,"cool":0},"O2952yWqxQ_YVH_X0cjwkg":{"text":"Oh boy this place is amazing, my husband doesn't want to eat anywhere else. We tried many ","useful":0,"cool":0},"eTBZ6uCI4JpAFE0aI_6tbg":{"text":"It was good. I'll be honest their milk punch wasn't my favorite but the shrimp and grits w","useful":0,"cool":0},"FXhAjj-bCrdzz0S6BAZ5bg":{"text":"It was our last day in NOLA and we had drink coupons from our hotel which is literally rig","useful":3,"cool":2},"wsvPJK9mA2E_ynRQQ1nQjA":{"text":"I couldn' wait to walk out of the restaurant before reviewing this restaurant. I don't usu","useful":0,"cool":0},"ONPUyjGN7OgGILE2HMg6IQ":{"text":"I loves this place. It was connected to our hotel so totally convenient. We got there at e","useful":0,"cool":0},"3lgVimRuxoIsmitoyvQyyQ":{"text":"Love this place!  Such a great value and a very cool place for drinks.  Ask for the jambal","useful":0,"cool":0},"0t9AvyimQG2NsSQ8u-cfIA":{"text":"Was here again today for a late lunch ... and it did not disappoint. Brian was awesome at ","useful":0,"cool":0},"zRt2ju0pjLPmLLM36tcLAA":{"text":"The BEST chargrilled oysters ever! OMG! And the beignets are perfectly  the negates are pe","useful":1,"cool":1},"PFAOPE7BZG1tbZva_w4Bbw":{"text":"Wow!!! A must visit restaurant in NOLA. Have to have the fried alligator and the grilled a","useful":0,"cool":0},"1WyP8ox8A1if0vVYajZEHg":{"text":"Great service and great Oysters! \n\nWhat a splendid surprise to find Coterie! The service w","useful":0,"cool":0},"zyIleMU3YIAr4HQDyd1mCw":{"text":"Skipped the touristy spots and hit this adorable spot instead.  Amazing burger,  delicious","useful":0,"cool":0},"89VKFYOr2_-HRiea7g9NKg":{"text":"Cute restaurant and great food. The crab au gratine is amazing. The service was also very ","useful":0,"cool":0},"WbZIJ7oQsJ42WkOHXuBZNQ":{"text":"Everything we had here was delicious ... one of the best NOLA food experiences I've had in","useful":0,"cool":0},"Vw-EGx0fiLvrZQ5TPIqjcA":{"text":"We waited almost 15 minutes to be noticed as we sat at our table. Finally, I asked the ser","useful":0,"cool":0},"ly5-4qDGwzLJ0fU7YF-5gw":{"text":"Gumbo mediocre at best. No flavor but heat. Oyster 2+2+2 better . Chargrilled was flavorfu","useful":0,"cool":0},"vtuWG1cghpUKVGpfT_lrkg":{"text":"Food is pretty good. Frank our server is a great dude and a great server. Chargrilled oyst","useful":1,"cool":0},"B5XYyOxYzn45fHU-SjsL8w":{"text":"I love love loved this place!! My friends went to NOLA and I decided to hop on a last minu","useful":0,"cool":0},"gsVC7DaZqH2ZQNuT7X8qUA":{"text":"Food was great and the service was excellent. Very attentive. Recommend the Extra Napkin P","useful":0,"cool":0},"kkvQ9ej-h67qc_sRfEVEwg":{"text":"Amazing dinner. The oysters were the huge and great tasting. Jack the manager was an outst","useful":0,"cool":0},"WKYL1Rq1v-t8YhGW3r-KbA":{"text":"We sat/ate breakfast at the bar and I was so nervous asking for GF options. The food I ord","useful":0,"cool":0},"3maSHlHxihPA4cIQSENHmA":{"text":"Don't be bamboozled!  This place is just a dressed up Huck Finn's with the same crappy tou","useful":0,"cool":0},"e6idfihWRrCCxNRQVHKMNg":{"text":"This was the restaurant/bar attached to our hotel, so we ended up here a couple of times t","useful":4,"cool":3},"ZAtKweRRrFhkovwFLagXQA":{"text":"This place was really close to our hotel so we decided to give it a try. The atmosphere wa","useful":0,"cool":0},"LJhaWdEXLIa4V6vi7_gijA":{"text":"Visit was based on first time attending and having breakfast. It was really good. Not 5 st","useful":1,"cool":0},"jvmI6bH10x1qoQwxDmNMhw":{"text":"Amazing! Char broiled oysters can't even start on the amount of flavors it has. Again amaz","useful":0,"cool":0},"GNnowCS64VXIjszo4jFAuA":{"text":"My imaginary food never made it to me but either the Grubhub driver is eating it or he got","useful":0,"cool":0},"TOFF0SFS-Uv4k4oJZYLy8A":{"text":"This place has huge delicious Oysters. We came around brunch/lunch time and sat at the bar","useful":0,"cool":0},"S557pKd17rLnyXGvj4-XIw":{"text":"I come here once a year during my annual trip to NOLA. I remember when it was Huck Finn's.","useful":0,"cool":0},"ADb5pq1Farvjohom68llbg":{"text":"Went to this awesome little restaurant while in NO at a conference, very welcoming staff, ","useful":0,"cool":0},"gZlUS138vzAq1swrqJw_QQ":{"text":"We had spent a long weekend in New Orleans recently. Hungry from walking around the French","useful":2,"cool":3},"94BWA2zoMEKIzpIAEGJj_w":{"text":"This spot is located and attached to the hotel we stayed at. So naturally we hit it up. Ev","useful":0,"cool":0},"XtZw193Peiit-iq-gsMk4A":{"text":"Our concierge recommended this restaurant, and I am glad he did.  Food was great!  Everyon","useful":0,"cool":0},"AKHjYhHRPoTfVYfHHAUFEw":{"text":"The food was good. We had the crab au gratin. Definitely recommend. Burger was good. Solid","useful":0,"cool":0},"pJjT69QA-OGU8q__EnwKaQ":{"text":"In the quarter watching the activities prior to the National Championship with my son - wa","useful":2,"cool":1},"gxBxwYAsBX8XM_gjCtN6wQ":{"text":"The food is just average and service lacking. Had Crab cake with Fried Green Tomato and Eg","useful":0,"cool":0},"sx3eC6Am7BsP15-_TTqhDw":{"text":"Awesome dinner!  The waiter was wonderful and the portions were plentiful. The taste of Ne","useful":0,"cool":0},"-JLscDv2fvjD4yVo7l1c9g":{"text":"This place is a mixed bag. The restaurant is nice inside but our service was kind of weird","useful":1,"cool":0},"H4iptT1tBMas0YkZjQ34nQ":{"text":"Wonderful food! Oysters were amazing! Excellent service, from the lovely hostess, incredib","useful":0,"cool":0},"LQKR-JpX5SufhZn3_KycXw":{"text":"This is an amazing restaurant. On a Saturday morning a touristy part of New Orleans, I saw","useful":1,"cool":0},"M2_vtr_J6MnVvtqK2SPVcw":{"text":"The BEST catfish that I've ever had! Also, great drinks and some kinda cajun egg roll that","useful":0,"cool":0},"lNHfTmclNxCDyG9OPpsYrw":{"text":"My wife and are came here for brunch 2/1/20. We were seated promptly and then waited at ou","useful":1,"cool":0},"2oJ0m2Beq1UpTURxH-VPyw":{"text":"Our first visit to the Coterie and probably our last.  While the food was decent, the serv","useful":0,"cool":0},"tBHNNh12yCMXrI0wJWJuHg":{"text":"I had the seafood skillet for brunch. It was lukewarm at best. The shrimp tasted off as we","useful":0,"cool":0},"bO9a4JwASpQh0ldv7trYfA":{"text":"Food is great! Servers a friendly. Highly recommend red beans and rice and a Hurricane! Be","useful":0,"cool":0},"uF7IFpf6OqMcg5xSdM4-aQ":{"text":"This was our last meal stop on our New Orleans trip. Not having yet had crawfish (or ever ","useful":0,"cool":0},"T7XjGYji0RP5laL3WcvZ2Q":{"text":"We are staying at the hotel right next door, \"la Galerie Hotel\" and lovely concierge gave ","useful":0,"cool":0},"JDjyz5dUK9GX1Sq_UPqVnA":{"text":"Food was good, not many vegetarian options... friend had the fried green tomatoes with cra","useful":0,"cool":0},"5yomcQhVWf0ojzPWBMmmTA":{"text":"The bridge was the best. My husband ordered the crab cake breakfast and it was a little on","useful":0,"cool":0},"FZ9DXCDlbbMzm1CNEOnEew":{"text":"The food was delicious, but the waiter was absent and absent minded. We had brunch here, a","useful":0,"cool":0},"OrrzU1BHVxfgoXtksIdkFg":{"text":"Of all the places to visit in the French Quarter, this place is a pass. Bartender was talk","useful":0,"cool":0},"SD2ViubkSmqAf_E3rQqGDQ":{"text":"Five stars for how well they accommodated our large group on short notice. No wait whatsoe","useful":0,"cool":0},"_EJIrjJ8CVEX8oEIncxx9g":{"text":"Great food, cool ambience and exceptional service.  We were waiting (in the rain) for a to","useful":1,"cool":0},"kwoAMPYw27kDyNu4vmL_rQ":{"text":"This place was amazing! We had a large group of 21, and they accommodate us. The food was ","useful":1,"cool":0},"l6jExtDCqZE_XeR1RxphSw":{"text":"This restaurant looks fresh and clean. Brick walls and nice bar. Went here on a food tour ","useful":0,"cool":0},"MYryhhNR3vdXKNg9lPQmQQ":{"text":"Got 2-2-2 which was amazing app. The wife doesnt like oysters but enjoyed these very much.","useful":0,"cool":0},"4t9eza1piSTcJIs-J_VnIg":{"text":"Great selection of delicious food.  Great atmosphere.  Jessica was the best waitress ever.","useful":0,"cool":0},"okJT_uK8Yvo-REOhYErOJA":{"text":"Came here for dinner on our first full day in NOLA. At the time I thought it was decent fo","useful":0,"cool":0},"acz4KZ1d7_1VsTOCdMUj6w":{"text":"I just want to give a shout out to our waiter, Nat, and what a wonderful job he did.  Very","useful":0,"cool":0},"zqvVgBiCrsf5e1REWN9AvA":{"text":"This is my favorite place in NO for chargrilled oysters! Bryan ( shucker ) is great! He an","useful":0,"cool":0},"VpqvllL8vmp84QGowIeTcA":{"text":"I did not have a full meal, but stopped in for a drink. Homemade Bloody Mary mix and infus","useful":0,"cool":0},"1TozRTcE8VabDr9XJhDzDA":{"text":"Unfortunately I can't leave more than five stars. This place is AWESOME!!! It has a casual","useful":0,"cool":0},"Yj8ke6YGuHasJxNUtBqFOQ":{"text":"Service very poor except in cocktail bar. Food nice but served cold. Spoke to managers but","useful":0,"cool":0},"H6Vx_wJ3q-bYuqe48kFviA":{"text":"Wow!!! The food is amazing!!!! \nSooooo delicious! \nMake sure you ask for Carlton, he's gon","useful":0,"cool":0},"kujCOtatc3v2Vz57kBoRRQ":{"text":"This place is great! We walked here for lunch after a day at the aquarium and were pleasan","useful":0,"cool":0},"XpKSHhF347bbbPez1XjCyA":{"text":"We went to Coterie for the Coolinary offering last August and liked it a lot, so we decide","useful":0,"cool":0},"ueGtAAm9ld8o-Z7EEdDJzQ":{"text":"The oysters are bombbbbbb specifically the chargrilled, the drinks are just as good! Annnd","useful":0,"cool":0},"Caw0n5TjtSuJxnWE5tKRdg":{"text":"Walked around for a bit and decided on this spot to try their crab cake over fried green t","useful":1,"cool":0},"twj0yu05RaXoajPPW-OeiA":{"text":"Bumping up by one star after going to happy hour.  Even though the bartender was super bus","useful":0,"cool":0},"W_dBKGKvrmPLrN8tPJ8Elg":{"text":"Great place to visit. Food was excellent. My favorite was: alligator sausage and French 00","useful":0,"cool":0},"A5Z6TbtZx2G7otgzOuo5Cw":{"text":"Amazing! All the food at our table was very good. Service was nice. Restaurant had a good ","useful":0,"cool":0},"yCN_wfbYOLyTEHypWcMNyw":{"text":"My wife and I ran into this restaurant waiting for a swamp tour. Look, this was a great th","useful":0,"cool":0},"MsJJZce7uiOgH4ryMh32FA":{"text":"Food was fast and tasted great. Service was really good. The oysters were my favorite. It ","useful":0,"cool":0},"I57e78dAFX0eYP6Z69r69w":{"text":"The food here was amazing. We had the crab cake Benedict and the crab cake and eggs. Both ","useful":0,"cool":0},"21nw2f7bamCJBXwMn3h9yg":{"text":"The chargrilled oysters were amazing. The butter garlic ratio was perfect. Ive had oysters","useful":0,"cool":0},"k4GgPTHSC_Lih7wa1CVI8g":{"text":"If you're in New Orleans, you need look no further for a true taste of hospitality than Co","useful":0,"cool":0},"0WvYB2GluP5cjbPkdZl6hw":{"text":"This was our most favorite restaurant on our trip to New Orleans. Our concierge at our hot","useful":0,"cool":0},"JjMnqLq7tMmXw9T9ocnwyg":{"text":"The Cajun egg rolls were amazing along with the king club sandwich!! Pecan pie was the bes","useful":0,"cool":0},"q87B7L5QTXrMSF_jymOGUA":{"text":"This was the worst service. We waited for a table. Mors than told to us. They were out of ","useful":0,"cool":0},"hHpADeztPJPY52puwEBAow":{"text":"All staff was enjoyable to be around. The food was an all new experience for myself & my h","useful":0,"cool":0},"JLo9h50a0CuQtfQj5nPkfg":{"text":"I really like the breakfast here. When in NOLA, do like NOLA folk and head here. The inter","useful":5,"cool":3},"DY84s3o9yhWwAHhhogikKQ":{"text":"It's not every day I write a review. I normally go to buy what I want and move on. However","useful":0,"cool":0},"qMF494eT4eooWQ-peAIpLw":{"text":"We came in for a drink and dinner the bartender was very rude. And was sure to tell us the","useful":0,"cool":0},"Hou4oYLXSkgCCf1esENayQ":{"text":"Wanted to try some authentic New Orleans food and found this great place! We ordered the 2","useful":0,"cool":0},"Idp1apW8GssAIEsjh-IqEQ":{"text":"You know, in NOLA French Quarter it's really hard to go wrong with a restaurant. The overa","useful":0,"cool":0},"WFo73tpMxtsfCWfWPexc-w":{"text":"The Taste of New Orleans dish is a great value for trying the most popular dishes in the a","useful":1,"cool":0},"6yZslciTpEL_wRm0yZQCTg":{"text":"Sooooo goood! We came here because ruby slipper was too packed and it was perfect. There w","useful":0,"cool":0},"eYT7RI6mZjIUMGlNEQ71zw":{"text":"Our first time in New Orleans and we were looking for a restaurant in the French Quarter t","useful":0,"cool":0},"JLx6Xw9Jd1kk6g8Yx5SZCg":{"text":"I stayed at a hotel nearby and my first visit in 4 days was due to convenience but the oth","useful":0,"cool":0},"orLbXozkEZCLOYl0ULYI2w":{"text":"So I was in New Orleans for a work conference, and I wanted some good New Orleans food. Th","useful":10,"cool":7},"T7YEyvsyR3SC7YrY-SrbcQ":{"text":"So the service was very very slow. The raw oysters were tiny. The drinks were skinny. We w","useful":0,"cool":0},"usISR7rriH9NtQKo2e4C3Q":{"text":"What a great find!!!!   Michonne at the bar is an awesome bartender!!!!  The raw oyster we","useful":0,"cool":0},"kFNHVOowG9o-RCi-BuH60g":{"text":"My first time in New Orleans and I walked over to the House of Blues.  Saw the Coterie acr","useful":1,"cool":0},"QNcSpnxtCqyMfpGoZnRx-A":{"text":"Sat at the bar. Josh and Bryan were the BEST!!! \nAttentive, fun, entertaining, inclusive a","useful":1,"cool":0},"qogHSC4Ejt44bra64GaZTg":{"text":"I was excited to try this place after all the great reviews. First, I will start by saying","useful":4,"cool":0},"g_eGeCK342MLX1duyV6vdw":{"text":"Wonderful service and amazing good. Oysters are as good or better than anywhere else in NO","useful":0,"cool":0},"Ck_k50VXTZECTSwlS9NxsQ":{"text":"Beautiful bar - honestly it was a sight for sore eyes. \n\nWe got there just as they started","useful":4,"cool":3},"MdnJLCBaOl-sST0-esUC7A":{"text":"Awesome happy hour staff amazing food awesome. Michonne the bartender was amazing best gue","useful":0,"cool":0},"ALmsyvgOaPm1bN0uMupTLA":{"text":"Food was good but service was terrible. Took over 45 min to get our check and it was still","useful":0,"cool":0},"cLA49RO1jcYJNDEbUKZ30Q":{"text":"Searching for the Best Chargrilled Oysters in the City?\n \nThere are plenty of restaurants ","useful":2,"cool":0},"dnvm78boAQA2HOF2Aqhhtg":{"text":"Great place. Just happened upon it and so glad we did! Sat at the bar and had a great time","useful":0,"cool":0},"nIdX6bauz3ZAnam6e-J5zQ":{"text":"Let me first start off I rarely give 5 stars.  This was incredible.  We had started with b","useful":9,"cool":3},"6zV79AXxq76nCeqTzGVkOg":{"text":"WHY do restaurants in New Orleans not split checks?!? We spent half an hour screwing aroun","useful":0,"cool":0},"_43vQGvFxu_apNOJiEQfog":{"text":"As a 35 year New Orleanian who lives Uptown, I don't especially enjoy drinks or dining in ","useful":0,"cool":0},"Dw6bHhMdOYkWoYzxQ7fmwQ":{"text":"On vacation here with my dad for Father's Day and today we were craving a burger. Happened","useful":0,"cool":0},"nq-Lvl_hn-xU_GqRpAjMCw":{"text":"This place was absolutely delish!\n\nHad the corn and crab bisque, it wasn't as bique-ish as","useful":1,"cool":1},"xPHUXb9QEvIewHsPkbIotA":{"text":"The food is mediocre and overpriced for the quality. I got the blackened shrimp salad and ","useful":2,"cool":0},"scObZxRTBM_OzsisZ2q_PQ":{"text":"We loved the incredible oysters Bienville and the Boudin balls. Great service and incredib","useful":0,"cool":0},"6hVDp47sBYtngwh7kiyUPQ":{"text":"Amazing raw and chargrilled oysters. Also the Cajun bloody Mary's was the best I've ever h","useful":0,"cool":0},"qN6QZ6kE7qzyLT6FnP1bHA":{"text":"We went for lunch and had about a 20 min wait to get in. Our server Katie was great and ma","useful":0,"cool":0},"Yr3yUqUsUVtn7k1uc1HWrA":{"text":"Went here twice for my trip in nawlins. Staff was attentive and for was yummy. Drinks were","useful":1,"cool":0},"6bWb8alKclfrGB3a_TOqfA":{"text":"Jambalaya was not good and the fried catfish Napoleon (highly recommended by the server) w","useful":1,"cool":0},"xtezxZ6SMJO2bSKz7ORpaA":{"text":"First time in New Orleans and this was our first stop on our food journey and they did not","useful":0,"cool":0},"F-pqPy_976PvuJZ5J2S-Nw":{"text":"Got food poisoning from the happy hour .75 cent oysters. Sucks, cause they had good drinks","useful":3,"cool":0},"3SV-LxqBytIkzdx9d_WZ7w":{"text":"We had breakfast the first day we arrived in New Orleans as it was recommended by our hote","useful":0,"cool":0},"tEXhFTrv1a3i-rskqEqTgQ":{"text":"Jack the Manager was amazing! He made sure we were taken care of for my bachelorette party","useful":0,"cool":0},"KY1IrkkAKaLAtWIotNba5A":{"text":"12/15/18\nThe Coterie Restaurant & Oyster Bar was just down the street from our hotel, so w","useful":2,"cool":0},"J1yO7ocmzt3947Y82ygh-g":{"text":"We wanted a quiet dinner away from the hustle of Bourbon street. Decided to do to Coterie ","useful":1,"cool":0},"ybxtH_XpVHNnRig0TMYqgQ":{"text":"I can't say enough good things about this place. \n\nThe food was impeccable! We went for br","useful":0,"cool":0},"RXzZZzxEDegj4S9x9h3iRA":{"text":"The fresh Louisiana oysters were delicious. Salty and large, they taste as fresh as they l","useful":1,"cool":1},"2qlmvgSRCe0OfL-IHWIKmQ":{"text":"Yummy food... Lawrence the Oyster Master is awesome!! Had a great conversation with him. H","useful":0,"cool":0},"LBHwOsd5KxWw4uZIYlQu4w":{"text":"We stumbled upon this place by accident and was extremely pleased with our bartender Josh!","useful":0,"cool":0},"M0ayX4rFjxRbXtUDWInC4Q":{"text":"Stopped in Coterie over the weekend and sat at the back bar, the bartender Lee was an amaz","useful":1,"cool":1},"GsovJ5p0tuO4nce3UfPrFQ":{"text":"Our tour bus company recommended we come here and provided us with a 10% discount card.\n\nT","useful":0,"cool":0},"ekJhHwV8JPfb0eSdTCVX3A":{"text":"Just got into NOLA and randomly walked into this nice corner restaurant with a nice sign o","useful":0,"cool":0},"FHgG2WM9XXkZg9F-cE7zeQ":{"text":"Our lunch today was wonderful. The food was great and the service was incredible. Kelly, o","useful":0,"cool":0},"gyOvOT_F2wTUJ9atAOnODA":{"text":"Visited New Orleans for a bachelor party. We were craving oysters and came during happy ho","useful":0,"cool":1},"z7IeNbtRNeaBRZlMSg0xjQ":{"text":"I had high expectations for this spot but I wasted money. I got an appetizer which I ate t","useful":0,"cool":0},"-ed5sFYB0LJQ40X6jmsBdA":{"text":"This place was recommended. We were told the gumbo was great. Don't waste your time or mon","useful":0,"cool":0},"VBEr7sGJkzX8iAXYTw2eow":{"text":"Great food and great service from our waitress, Katie. The bacon jam burger was perfectly ","useful":0,"cool":0},"Swy2G2Ed7Q6UqyimtGNT5w":{"text":"This place was recommended by supposed world travelers who would have a discerning palate.","useful":1,"cool":0},"I6RoGfLhU9C5rptVgYEz2w":{"text":"I was is NO for Mardi Gras and we ate here several times.  Even with the crazy crowds we a","useful":0,"cool":0},"NEPyrjFzRxKNj-6CdarcBg":{"text":"Very disappointing experience. I showed up to take a tour that listed the restaurant as th","useful":0,"cool":0},"AbRkRRtQCIvWbN2W8CzpKA":{"text":"We came here for breakfast on recommendation of our hotel concierge and it was right on po","useful":0,"cool":0},"FBVuWdpkIRLhsKiOGjKD4A":{"text":"Always enjoy this eatery when in New Orleans- the food is great and the servers are really","useful":0,"cool":0},"zb8r0ElkkEubtu-aQ1FViw":{"text":"We went in for appetizers. We tried the charbroiled oysters. They have by far the best cha","useful":0,"cool":0},"GNNKBe9zK4m7LceEDvMExw":{"text":"I really enjoyed this place when I came here with my boyfriend. It's laid back but upscale","useful":0,"cool":0},"sQ9C-a0VSrjtV3IVtslf1w":{"text":"Loved this place.  I ordered the oysters, 2,2,2.   2 each of 3 styles.  They were deliciou","useful":0,"cool":0},"f-lb7KHX0FUhbAPEAuGGlA":{"text":"Wow.  Discovered this restaurant on a food tour.  We had a sample of red beans and rice an","useful":1,"cool":1},"zTV6KA5bz5K8n6235o_FnA":{"text":"Best Brunch place in NOLA, we had to return before we left town. Will definitely try for d","useful":1,"cool":0},"JYGnE2K0OHRTT13ld4NWlg":{"text":"Went here for the first time after seeing they had a Coolinary special. Ended not ordering","useful":0,"cool":0},"7SkRXjT3SjCf5eBB1KFpwQ":{"text":"Incredible raw oysters! The oyster shucker was incredible sweet and brought us oysters to ","useful":0,"cool":0},"v9noJAUdX4wpq4-BXwJc9A":{"text":"As a local I rarely eat out in the Quarter because when I do, I'm usually pretty disappoin","useful":0,"cool":0},"_t0iScolHtS3WxYpU3nJVA":{"text":"Food and service here were both outstanding! Had the blackened redfish with the Crawfish s","useful":0,"cool":0},"pGHAx8Ljfmum4OyGQW3UXA":{"text":"My newest besties in the NOLA! \n\nAmong these days of the pandemic, there are only a handfu","useful":3,"cool":1},"Phe9jtV9sJnPGxmIOcSIqA":{"text":"I want to say the food was great and service was good, with limitations. My girlfriend and","useful":2,"cool":0},"lUJOKqycgkbYA52jQivtNw":{"text":"Amazing breakfast in New Orleans. The variety of options in the menu are amazing. I enjoye","useful":1,"cool":0},"XvAIK4qkrRT7Ka9qyBSMNA":{"text":"We dropped in here by chance and were amazed at the exceptional experience. Josh, the bart","useful":0,"cool":0},"COZKJf0GDgqSGOIuaHlB-w":{"text":"If you want some bomb oysters this is the spot. I came for the drinks but stayed for the o","useful":0,"cool":0},"QMDv6mE161ZaSH5rpXPswg":{"text":"YALL THE PANCAKES ARE TO DIE FOR! My husband & I have been coming here for three days in a","useful":0,"cool":0},"hDGH3cwUqyM0dLnP4iEgTg":{"text":"Loved this spot!  We had chargrilled oysters at 4 different places during our trip and the","useful":0,"cool":0},"-OMZl9-pPzlKs9jaAtnn4g":{"text":"Had dinner here last night. We had the roasted chicken, and Cajun egg rolls. Food is good ","useful":0,"cool":0},"Tv86sdkpSGulJoxt63TI6g":{"text":"The atmosphere and bar area in front are great!  The bartenders are attentive and have an ","useful":0,"cool":0},"batx9ZgiG0WjLAD7YRNa3g":{"text":"If you are looking for a very inviting but up front service I highly recommend Coterie. I ","useful":0,"cool":0},"0P6z5Jj0Lam_QT6LlOh-pw":{"text":"Great service and food! We ended up here because we were staying in the hotel next door an","useful":0,"cool":0},"B6JrsVLevWfKpF0XMuDQ9w":{"text":"This place was next to our Hotel, In New Orleans! We had  drinks and breakfast there proba","useful":0,"cool":0},"Brn6hKe8vUovXbSAYX7xhQ":{"text":"I had the seaside skillet. It was kind of dry, but it was good. My friends started there f","useful":0,"cool":0},"POENz7naszZlpMdW50e3qg":{"text":"Came with a large group of girls. Had the 2-2-2 oysters, it was a great way to try a few w","useful":1,"cool":2},"h_NdXkwsY1XdraXC7KtKdw":{"text":"Great breakfast stop. Mimosas were awesome and our server was very attentive and friendly.","useful":0,"cool":0},"U5vyJR6V-2x5_obRGDQFIA":{"text":"This boudin and eggs scramble is life changing!! That, the biscuit and the Bloody Mary mak","useful":0,"cool":0},"yvNb1-okTygJ5CWJ1-wzYg":{"text":"The food is delicious! Worth my mouth burning. Great atmosphere very relaxing. Service was","useful":0,"cool":0},"RQaca8Qa0PHks4MKJl0e_w":{"text":"Love this place, food is great and the service is incredible. John my bartender was an abs","useful":1,"cool":1},"rLiPpXCGUoZvp75EQfQd5Q":{"text":"Great experience.  We had the corn crab chowder, the taste of NOLA, gator platter and drin","useful":0,"cool":0},"myq-fUKu2do1FT6x2zejbw":{"text":"Randomly came upon this spot walking around but this place was SO good. We came in with a ","useful":0,"cool":0},"nnjetoFXzUyEiakMkSPh8w":{"text":"A great find. Casual and low key. Food is amazing. Shrimp & grits were fantastic and my lo","useful":0,"cool":0},"r7MFRqpXnHwGdFg5bSBJmQ":{"text":"We stayed at La Belle Maison just W of Canal St close to the French Quarter.  The hotel sa","useful":1,"cool":0},"AY4fNKs7emftPnnLkHuPYg":{"text":"We went twice during our 6 day stay. Consistently good food and drinks. Service was varied","useful":0,"cool":0},"leNmmZIsd5LUvXbc58eVaQ":{"text":"Totally upscale Cajun-Creole cuisine. Jambalaya and Etouffee are what I was hoping to expe","useful":0,"cool":0},"nGtnWpCbTg8bIjpxNymzbA":{"text":"We came here as its hard to find a restaurant that has healthy food in the Quarter, my hus","useful":0,"cool":0},"GmfLbjKY4c2r-pKrSzra6A":{"text":"This place was highly recommended to us by the hotel concierge and two different tour guid","useful":0,"cool":0},"F_tXfugIlbQJlK9IbJfl0w":{"text":"The food is amazing here and the service is even better! Carlton took care of us and he wa","useful":1,"cool":1},"cLyQtPx0fqfCwHC4GN7wTw":{"text":"I work at the Customs House and I've eaten here 3 times now and every meal has been wonder","useful":0,"cool":0},"oIG7uEEp3GrA4CdadtQiyA":{"text":"This was a great find! Excellent food and our waiter Austin was one of the best waiters we","useful":0,"cool":0},"iJCDKpm-iBuvRkWnk5NioQ":{"text":"Fri Feb 14 - upon recommendation from a local bartender, we decided on Coterie to quench m","useful":0,"cool":0},"PMrZqVOfw_-1pJqKexhS6g":{"text":"Great restaurant!  The manager was extremely personable and eager to make sure everyone in","useful":0,"cool":0},"qQrTW7bR_1muYzWiProb1Q":{"text":"Only reason they didn't get 5 Stars was because we came for breakfast! But we didn't know ","useful":2,"cool":1},"d1HAWfNAD_zCjT3X43WdYw":{"text":"This is my 3rd time coming here for brunch. I think the name has changed a couple times bu","useful":0,"cool":0},"IwD5-qBpjABaBU4TFPcFFw":{"text":"This place literally rushed us out. I felt so uncomfortable being\nHere. My reservations wa","useful":1,"cool":0},"5UZUGHkgnHEuJ1jKOasaWw":{"text":"This is hard to do but so necessary, I LOVE Coterie the food is fantastic but the front ba","useful":1,"cool":0},"PL7s21k7Lq-I_WegMdL4qQ":{"text":"Walked in and was sat right away. Friendly and very clean. The breakfast was amazing. I ha","useful":0,"cool":0},"SfTAvJZXSBgaVMQ3KTy8CA":{"text":"Josh was awesome bar tender (his bloody marry was perfect) and quite possibly the only rea","useful":0,"cool":0},"airS9WO30H-3iax-kLfKbw":{"text":"I walked in this place based on the positive Yelp reviews and oh boy, once again YELP FOR ","useful":0,"cool":2},"V97LPjidHAySedz-20sa9g":{"text":"My family and I just ate at Coterie.Not busy and was able to be quickly seated.Our waiter ","useful":0,"cool":0},"8JWxbOns2VymB10b_Kg2rg":{"text":"We(BR)Stayed in FQ  this past weekend to babysit 4 grandbabies while daughter and son in l","useful":0,"cool":0},"EXSw69OBRjzgJxnyE-wuNA":{"text":"My first time at Coterie was during a bachelorette trip. We all ordered something differen","useful":0,"cool":0},"CmT6iMGJrwQETz7ZjUVGng":{"text":"oysters were fantastic.  The atmosphere is new and fresh.  We will be back.","useful":0,"cool":0},"lURjXX7RixAQ0vnIqYBkZw":{"text":"Food was amazing! Everything tasted fresh, for appetizer we also had the 2+2+2 oysters and","useful":0,"cool":0},"loe12W9GWDyrGlRqUvpYbw":{"text":"I have never had charbroiled oysters this good before! They were so yummy and flavorful. T","useful":0,"cool":0},"wegIrf4nCwp_PPTRorQ_1Q":{"text":"Best brunch/breakfast menu! Crab cake is excellent! Service wonderful! Atmosphere is upsca","useful":0,"cool":0},"GymrrdHtf1RnCGKuxpJSzQ":{"text":"The oysters are AMAZING. We had the 2x2x2 appetizer and every single one was delicious. Th","useful":2,"cool":0},"REtMk3UWTJ5cZfgCvXy8lA":{"text":"Worst meal we had in NOLA.    Food was over salted and the portions were very small for th","useful":0,"cool":0},"UUnOB1N1g5o0A1SM4BpnSA":{"text":"Concierge at our hotel recommended Coterie and he was spot on.  Everything we ordered were","useful":0,"cool":0},"fQOuKBx4IAzK82f-NY8W2g":{"text":"Really great restaurant that combines traditional Cajun cuisine while embracing the finer ","useful":1,"cool":1},"Lisl72Q1xLf93WkpvyUHKg":{"text":"We found this place New Years of 2019 and returned again New Years 2020.  It was great for","useful":0,"cool":0},"anaa1a3Oa0ztp9HN4MGeDw":{"text":"We went to dinner 5/8/21 and Joseph Hudson was our waiter. He was fabulous! We went with a","useful":0,"cool":0},"HYPNcNF0dYtlLBJbdfNAGg":{"text":"This place is easily one of the best places I've had dinner in New Orleans. I have a shell","useful":0,"cool":0},"rTwr2q_4ickwEo5P7MW7qQ":{"text":"My last dinner in New Orleans was also the best meal I had out there.\n\nLocated on an unass","useful":14,"cool":15},"IZBLBFXo4rNBJ_1Zjlyp2g":{"text":"The food was great! And on Mardi Gras, which honestly shocked me! \n\nMy hubs had oysters an","useful":0,"cool":0},"xZeF7sRBFOJ9rYXAU4wT2w":{"text":"This is one of my fave places when visiting NOLA. The oysters are some of the best I've ev","useful":0,"cool":0},"EioqvGC-1b7Cxnj7Jwep0w":{"text":"A nice restaurant located in the French quarter. \n\nI was a little skeptical about this pla","useful":1,"cool":0},"ngOqW2DjNelyKuGhB-dlSw":{"text":"This is a great place for oysters.  We had the raw and grilled oysters.  They are amazing ","useful":0,"cool":0},"g2a-qQm71u9PuvAGPhwI-g":{"text":"Some of the food was good.  Blackened alligator bites and catfish were fantastic.  Bartend","useful":0,"cool":0},"KXF7-L8MMtT8Jh5yt-JPOg":{"text":"As a local, I am picky about Cajun/Creole fare.  My husband and I very much enjoyed our di","useful":0,"cool":0},"EvCu-QE9eL6p_7eTk1lOqg":{"text":"As soon as I walked in I knew I'd love this place! The atmosphere and decor are warm and i","useful":0,"cool":0},"wqcga5xiVIy8gd5CuCAlnQ":{"text":"Pain perdu here was actually pretty good, the service only mediocre however. The space is ","useful":4,"cool":4},"3xdGynZ-HxUl3vfAvboUpQ":{"text":"First let me say, the food was amazing. We had fresh oyster, boudin balls and both seafood","useful":1,"cool":0},"gIU3c7ui_g05OAcZxXCAHA":{"text":"Absolutely love this restaurant. Went for happy hour Wednesday night and sat at the bar! O","useful":0,"cool":0},"pjmZ10sy2omW8OLrb_8OCg":{"text":"Our server was very rude and treated us as an imposition. Food was substandard. Do not rec","useful":0,"cool":0},"pBNtmsVavhobOy0lG17PvA":{"text":"Honestly I was very disappointed. I ordered the burger and instead of a freshly made taste","useful":0,"cool":0},"9suusHZ16IhF76UibBPovA":{"text":"Lawrence is the go to guy in all of Nola. Come by for a good time and the best oysters and","useful":0,"cool":0},"qah0hG-XEjipkcDy0M6Cgg":{"text":"Ambiance, staff and raw oysters 5 stars.  Charbroiled oysters with bread too much garlic f","useful":0,"cool":0},"5rVY8lSHXakqPVt9RQR57Q":{"text":"We went for breakfast   The service, food and atmosphere are top notch!! We will be back!!","useful":0,"cool":0},"GZep93UmCB7mKeetVNbvdg":{"text":"We loved the Coterie ! It is a very nice place to dine.  We stayed at La Galerie French Qu","useful":0,"cool":0},"iBD3QnGRu8zLHJ_moMjuvw":{"text":"I devoured my shrimp and grits! This place had great food, prices, and service. My favorit","useful":0,"cool":0},"9dImjDVGE4UDWOMKwRfouQ":{"text":"Get the shrimp and grits! It was savory, buttery and oh so good. My colleague got the Tast","useful":0,"cool":0},"6d27NcFTue9BQIxNL8dLKA":{"text":"Amazing. Chargrilled oysters are a bit different with a bit of roast beef gravy in a good ","useful":0,"cool":0},"dBiZMunNqorX8YwO6Fk7cg":{"text":"Food was great. Nick the bus boy was very attentive and very personable, made us feel welc","useful":0,"cool":0},"Z1Z6yYajA27X_n3NxPK8kw":{"text":"This was the first restaurant we stopped at on our trip and it did not disappoint. Our fro","useful":0,"cool":0},"Ebm-NKd-xMjjRSqTEkLKUw":{"text":"Was referred to this when I asked my food tour guide about ACME & I was completely satisfi","useful":0,"cool":0},"VQn1-uQiQHFAJ_rvQpml0g":{"text":"Restaurant situé non loin de Canal street à la décoration soignée. La carte propose les cl","useful":0,"cool":0},"RIPXYHMZuei7w9dW3vZftg":{"text":"Excellent service and food! We arrived 10 mins before the kitchen close. The staff was ver","useful":1,"cool":0},"SeL5WIJaTqjZhqkjk_6qHQ":{"text":"We were looking forward to eating here as we heard many good things about this establishme","useful":1,"cool":0},"c5uarigx5yL4kBKsKHoQYw":{"text":"Had lunch one day, then went back the next for breakfast. The service and meals were excel","useful":0,"cool":0},"woBNVJ-d78KVumFkuvBGQw":{"text":"Came to New Orleans for the day and wanted to get some oysters. This restaurant was recomm","useful":4,"cool":1},"thnD_JyYAacsS3Ebju1Geg":{"text":"When in New Orleans go to the Coterie !! Jimmy is great along with the food. The jamablaya","useful":1,"cool":0},"ikRqLauzdT3K8Dcoapg3VQ":{"text":"First of all :\nThis is definitely not authentic New Orleans food. The oysters were good bu","useful":0,"cool":0},"xdCozCI6VS0HQ6andKUseQ":{"text":"Great happy hour!  Spicy bloody Mary's and delish oysters. Nice bar area. Open space and c","useful":0,"cool":0},"wg_txY1cli6nG2CXbzmLDg":{"text":"The service was really good. Food was pretty good. Bread pudding was tasty. \n\nThe setting ","useful":0,"cool":0},"Z7cEFtJKDYxgcKpH-N36AQ":{"text":"the oyster shucker brandon is excellent he provided great service and recommend him heavil","useful":0,"cool":0},"lnRdjXH7d8Kmxk3QcdU05w":{"text":"My boyfriend and I were in Nola for a weekend and decided to check this place out for brun","useful":0,"cool":0},"3X9UywLGVSvwlX-qv5X2lw":{"text":"My friends and I flew down from Florida for Mardi Gras . We were walking past this restaur","useful":0,"cool":0},"hSt-XH7av9npQlO0g7q4UQ":{"text":"Good food but that's about it. Service was terrible, we had reservations at 11am and didn'","useful":1,"cool":0},"e7Ywbz4a6izbbUq2A_Ckvg":{"text":"I went to college in the \"South\" and so disappointed the biscuits tasked like pillsbury re","useful":0,"cool":0},"tWjkJIqeJ_IgqNHwjsaluw":{"text":"I was blown away by this place....if there is one thing I do when I make my trips to NOLA ","useful":1,"cool":1},"v_ncRfHetYitDImP_yN0ag":{"text":"Popped in to this place for brunch and sat at the bar with no problem. The bloody mary's w","useful":0,"cool":0},"jWgsySiDJDnhLtdpiGsaMQ":{"text":"Food was good but not great for the price. Nice atmosphere and kid-friendly. They did acco","useful":0,"cool":0},"BchmvF9YDM2FKC32WidYEg":{"text":"Manager Derick is FANTASTIC!  I was disappointed in service rule and he made it right in s","useful":0,"cool":0},"Fq7xFAjYsqns5JgWGBzvFQ":{"text":"It's a shame I can only give 5 stars.  I had the the reffish, recommended by my server(Nat","useful":0,"cool":0},"E_YevdB5zuT_Y111erK60w":{"text":"I was visiting NOLA for work and after a long day i had trouble deciding on a place to eat","useful":0,"cool":0},"urMDNik-tV4A62KBnluTlw":{"text":"My family and I were not disappointed. The blackened red fish was delicious the portion si","useful":0,"cool":0},"1CXzgCCTlfTRTSrzJP0NfQ":{"text":"Big fan of this place. During my trip to NOLA I visited here twice. The first time was jus","useful":15,"cool":12},"cGSd3ohYcZsm5CATrfGzGg":{"text":"Coterie is a great restaurant/ bar. Staff is really awesome and the food is great! It was ","useful":1,"cool":0},"Z6cjR7RuMq_EMVd-aUUjig":{"text":"Darnell, oyster mother shucker. No, seriously...he is! We stumbled upon this spot by accid","useful":2,"cool":2},"hmxAUSIJOpNv67oZcsLvdg":{"text":"Coterie -- all I can say is wow! It was recommended to us by Sunny from Cajun Encounters (","useful":0,"cool":0},"i-vQedIDlHh7biw6_ma2HQ":{"text":"This was an amazing choice for us and like most of us on here, the other yelpers helped us","useful":0,"cool":0},"tm8PJbxjCe4MKPQ54S7gJQ":{"text":"An absolute gem that boasts quality food, service and dining experience. The most fresh an","useful":0,"cool":0},"4Rf6fWBjomfzUURp-6SWug":{"text":"This was one of my husband's favorite restaurants before this visit.\nWhile we got seated q","useful":0,"cool":0},"CtzWDdcqzMaE6cVdFRqKNA":{"text":"We stopped here for brunch on our way out of the French Quarter into the Garden District. ","useful":0,"cool":0},"YANQy-ieEotRSk_kGXY1Aw":{"text":"After checking into our hotel, the concierge recommended Coterie for lunch. Cute restauran","useful":1,"cool":0},"YuC4ZyRY4O0TlFDZGOJwFg":{"text":"Beautiful restaurant with lots of good food choices. My husband and I had the boudin balls","useful":1,"cool":0},"HH1Is5k87LBGMLQSE9qSfA":{"text":"Went for breakfast.  LOVED the seafood (crawfish, crab, shrimp) omlette except there were ","useful":2,"cool":1},"pbGb42jFz7aQzPwQkesibQ":{"text":"The ambiance of the restaurant was nice. The restaurant was clean and maintained. It took ","useful":0,"cool":0},"ytFCG_5XWIlDZ0YJkWQW-A":{"text":"Be warned the Open Table reservation you make means nothing. We were met by a very rude ba","useful":1,"cool":0},"zL8DUyx1R3IfEl266k4BLg":{"text":"Our hotel concierge recommended this restaurant. We arrived got seated very quickly which ","useful":0,"cool":0},"hSngKC89ouOhXxHd5ZN2FQ":{"text":"Bad service, good oysters, great dessert - salty watery gumbo\n\nWe had high expectations an","useful":1,"cool":0},"Z3po8p7xCD3fTp7ZkiM8Zg":{"text":"Definitely a great place for large or small groups. Great wait staff and amazingly yummy f","useful":0,"cool":0},"NoiSz9jN4fGCmqVcET0myQ":{"text":"Absolutely, without question,  the best oysters I have ever eaten. Wonderful staff and gre","useful":0,"cool":0},"GyUWQDnPwamcsclzdTtGkA":{"text":"This is an awesome stop in your way to the French Quarter to have an amazing lemon drop ma","useful":0,"cool":0},"zmAQXSj6UB2gO2WzYxiWfQ":{"text":"Needed a quick place for brunch that wasn't crowded. This place is well known for dinner b","useful":1,"cool":1},"KZJRGDva2NqiLF4sFFY0OA":{"text":"OMG!!!!  Where do I start...  the Boudin balls were heavenly!!!  The chargrilled oysters..","useful":0,"cool":0},"ZBzyoSWr9yPdxEMRtFVwlg":{"text":"This was a delicious restaurant to have our first dinner at NOLA! Our waiter recommended t","useful":1,"cool":0},"ov7mT_ftg56IQx9VquAmZQ":{"text":"Awesome breakfast and Dominique the bar tender was amazing and gave us great customer serv","useful":0,"cool":0},"WYngVIgZ_qq2DQhBO0ou3A":{"text":"My favorite seafood spot oysters rocker fella on point, customer service excel . All food ","useful":0,"cool":0},"AZ0_VPGnsaNjGC0IH8og5g":{"text":"Started to go to Ruby Slipper, but there was a line out the door. Our hotel recommended Co","useful":0,"cool":0},"pz9ixe1VUHI_aRKxy_vgcw":{"text":"My boyfriend and I recently dined here and it was clean and we felt safe. Staff wore masks","useful":1,"cool":1},"F8r_M-RGaNihGpsNk2qseg":{"text":"Came here on 6/20/21 ! We came to eat here during the storm and loved it! Had AJ as our wa","useful":0,"cool":1},"sk7pmkiA-XZq-0uR4D6wyw":{"text":"I had just flown in and I was soooo hungry so I forgot to take pictures. I had the seafood","useful":0,"cool":0},"sJ18daknQFdqbvgXyibYEQ":{"text":"Omg!! I've never had oysters like this! Hubby and i are visiting NOLA for an anniversary t","useful":1,"cool":0},"rFm6DoPlpfqgXWIvkcs0kg":{"text":"Terrible. Made a reservation. Confirmed via yep and email. Also spoke with an employee on ","useful":0,"cool":0},"6V9jW56pATkqnfkdN7H_cw":{"text":"The etouffe egg rolls and the oysters are a must! We had the shrimp fettuccine which was d","useful":0,"cool":0},"2ke7eLKjp8HhDiDuspNyMw":{"text":"After spending a few days at a vacation rental directly across the street, we decided to g","useful":2,"cool":1},"-xCirXdjUzKeZXmicVsgrw":{"text":"So we went to this restaurant earlier today on a tour.  The red beans were so good, that a","useful":1,"cool":0},"VD3EppkqgEb93jd8eZqbIw":{"text":"Coterie didn't disappoint us when it cones to Southern hospitality, We were greeted by a w","useful":0,"cool":0},"AyRac2d3FITdVSz3SYbk_Q":{"text":"Very good meal and prompt and friendly service. We were seated within 5 minutes. I had the","useful":1,"cool":0},"LI9KTdzp5aXUNHUWGyuleQ":{"text":"They were unable to make coffee - who can't manage that?\n\nVery good salad, dressing was fa","useful":0,"cool":0},"zWWsccAv8omQTCjmCkIOyA":{"text":"This restaurant can be hit or miss, depending on the days staffing.  I have never been dis","useful":1,"cool":0},"JFrLwjLrWuWHVOlguu0PZQ":{"text":"Had breakfast here this past Sunday. Madeline was our server and she was very attentive, p","useful":0,"cool":0},"jrdojffX2FtCUC2vndH2Pw":{"text":"Yes to oysters! Our swamp tour guide, Luca, actually recommended the place and although we","useful":0,"cool":0},"WvR92YYEAJ6ogamCvvLLHw":{"text":"The very best oysters I've had in a long time I'll definitely go back just to make sure it","useful":1,"cool":0},"iiCinT7e8UPGKhPIeXgsvA":{"text":"Great oysters especially the chargrilled ones. Loved the sauce. Had the New Orleans sample","useful":0,"cool":0},"kSR9HJy68FpDIRVhwQab4w":{"text":"Really enjoyed eating here.  The raw oysters we're plump and had the perfect salt level. T","useful":1,"cool":0},"JIWEKb_9Pqyz6Ujy_SRw2g":{"text":"If Tammy and Frank aren't here the next time I visit, I'll be thoroughly sad. Those two kn","useful":0,"cool":0},"rFr0mB5xI3AzbN8EZ2h9rw":{"text":"We stopped and didn't know anything about this place. It's nice and affordable. The oyster","useful":0,"cool":0},"JBdkDNDXgkkXstDaOfoKYw":{"text":"Have eaten here several times and it's always very good ! What makes it unique as it's the","useful":0,"cool":0},"ynxyzaUC7B2nJxreEORgiA":{"text":"Not worth the wait of anything more than 5 minutes. Food cold and not so good.. if you don","useful":0,"cool":0},"3FXhfcOQ55_8enrg11BTyQ":{"text":"Best food we have ate in NOLA ever! \nStaff was beyond nice! Very clean place. Started off ","useful":1,"cool":0},"IzJ29DrBigPgduwiTOtwsA":{"text":"Best dining experience so far in New Orleans. Carl was our server and had great recommenda","useful":1,"cool":0},"s36cVaPfjejd3rWJkzlG3Q":{"text":"I would have submitted this as an e-mail or note to the management via their website, but ","useful":8,"cool":0},"txo2qW_9dFAXxug7qGz0PQ":{"text":"This is the best restaurant on our trip so far. Fabulous food. 2x2x2 oysters were to die f","useful":0,"cool":0},"yhUURO7j1uu96yVo3KQBGA":{"text":"Frank, our server was AMAZING. Even though the hostess failed to assist the overwhelmed se","useful":0,"cool":0},"FHR4w0CwVzZS_-RIlTOuaw":{"text":"Super friendly service!  Great food and drinks!  Awesome bread pudding!! This was a great ","useful":0,"cool":0},"-ARWfTHZfNAhCQQtkLT_wQ":{"text":"Good things come to those who wait. Prepare to wait. We sat for 15 mins before the waiter ","useful":0,"cool":0},"PtoNhdbSFsr6k9cBaT1erA":{"text":"Ate here yesterday and it was a wonderful experience! Nestled in the midst of the Bourbon ","useful":0,"cool":0},"YV4qy7t5XdCt7Zo1alcBGA":{"text":"If you're trying to eat tourist's New Orleans in small portions and very quickly, as I was","useful":0,"cool":0},"26LDCZBfaduQ73ZZS9PSUg":{"text":"Food wasn't too great. The fried pickles were extremely salty, and they messed up on our o","useful":0,"cool":0},"4kRjOLtWjwXr_hkR-6Ef_A":{"text":"My husband and I went to New Orleans a few weeks ago for a 4 day weekend. We did not have ","useful":0,"cool":0},"qzMq3iaQcLcU2DB3PWzltA":{"text":"AWFUL service. We order the crab cake pasta and the roast debris both were terrible. We se","useful":0,"cool":0},"nqM2EHWjouDNYB64FV0KwQ":{"text":"We had raw oysters, fried pickles, and a blueberry Arnold Palmer with vodka.  The oysters ","useful":0,"cool":0},"nbPJbs-2zu6k9Z27e26u3w":{"text":"Lucky us!  Waiting for a table at a nearby restaurant we walked in here for a drink (or tw","useful":0,"cool":0},"YGREy5J5wxkMLXcIXKSYQg":{"text":"Stopped here before heading to HOB. Sat at the back bar and ordered a dozen raw oysters. T","useful":1,"cool":1},"rv7DFXWLoVWvf1BsP4Xw3g":{"text":"We called and were told what time we could come and walked there in the cold with children","useful":0,"cool":0},"VHlqsD-YRV8hZwvcKSybtg":{"text":"Was very excited to try this place, based on reviews and looking over their menu - but lef","useful":1,"cool":0},"4mmwme6rf_RXNrbDF_9JSw":{"text":"Great service. Great food. I had the Beacoup breakfast. Very good. My hubby's had the Seas","useful":0,"cool":0},"bb1l-q5HP70WlVsLlcf3tA":{"text":"Cajun Egg Rolls AMAZING!!!!!!!\nShrimp Pasta awesome!!!!\nBread Pudding awesome!!!!\nRed bean","useful":0,"cool":0},"waq5ZlUHfbK0rMN0giesrw":{"text":"We came in last per recommendation from our hotel concierge. We flew in from California an","useful":1,"cool":2},"eDVHrjmQyW948J15ppSIKw":{"text":"Had a wonderful meal here, great service at the bar. Food was good, drinks were very tasty","useful":0,"cool":0},"fN5NGCCqkD1NhITr8X0Azw":{"text":"Just mediocre. Everything about this place shows potential but they just not there. From t","useful":0,"cool":0},"nP5_rJ7tlw_ZamiMN1zxOA":{"text":"Walked into this place because we were looking to try alligator. Everything was super deli","useful":2,"cool":0},"-YWg62K1ZRg8MzNLsYa5dg":{"text":"This was our first dinner on our trip to NOLA and it was honestly our best. The shrimp and","useful":0,"cool":0},"gfnDiMKK-lYiSwz1SBjGbA":{"text":"I called earlier in the day and asked to make a reservation after 8. The hostess told me t","useful":0,"cool":0},"_fDCRLeTDm6s9qygi3LHGw":{"text":"We didn't get off to a good start here. We waited 15 minutes for anyone to acknowledge us ","useful":0,"cool":0},"OvG54OBzYPOIoGXFhAf7Vw":{"text":"From the moment we were seated and Joe cake over to welcome us, we knew we were in for a l","useful":0,"cool":0},"VCILksbd5Rb6RxMoT-SChA":{"text":"We had such an enjoyable dinner!\nHappy Hour drinks are great. Food had so much flavor. We ","useful":1,"cool":0},"Zu2o-cueaLEylZtgeacq4w":{"text":"This place was recommended by our driver from Cajun Encounters. We couldn't get a table th","useful":0,"cool":0},"Q6DZNcDIwfXrjvxg2BW0Cw":{"text":"Cajun Egg Rolls on the left, Fried Gator Bites on the right and a mojito that went down a ","useful":0,"cool":0},"FexgLCqZ_TBk3_h9bzGF7w":{"text":"Absolutely a perfect dinner.  Frank was our waiter was a rock star!  We had lemon drops wh","useful":0,"cool":0},"NhgBvMjzTqV3CVEqzPkXVA":{"text":"Loved the oyster PO boy, bang bang shrimp as an appetizer and Taste of New Orleans entree.","useful":1,"cool":0},"iBBfl-jCAl2hClluDHVzog":{"text":"The food took entirely too long to come out. Even other tables weren't getting seen for 20","useful":0,"cool":0},"l8fU-NNfDw3Od4k2L7K_AQ":{"text":"We enjoyed oysters & glass of wine so much that we lingered until Happy Hour and repeated ","useful":0,"cool":0},"2ijV4D6GOL8FrdLEuwaWKQ":{"text":"Nice spot, and friendly staff.  The chargrilled oysters were fantastic. However the seafoo","useful":0,"cool":0},"Tw_mPsjEO5J6jxGnBdLGdA":{"text":"The food at the restaurant was very good. However, the service was absolutely terrible! Ho","useful":0,"cool":0},"i0diWFCe9RpDfz7vqqsPGQ":{"text":"Loved Coterie! My husband and I had the charbroiled oysters, the seafood gumbo, the grille","useful":1,"cool":0},"2viWm-MeMChHUm7vYd1zmw":{"text":"Staying in the French Quarter of New Orleans we were staying next door to this restaurant.","useful":1,"cool":1},"NHex1FkB5koTSst8ZYt0kw":{"text":"Went here on a recommendation Nd it was absolutely amazing the food was right on point and","useful":0,"cool":0},"n159ocJcAP0yfdu2F4fN5A":{"text":"Awesome service excellent food!  We ordered crab cakes and Cajun egg rolls for starters.  ","useful":0,"cool":0},"sSxFrKDeVIMtolXF9_Jiqw":{"text":"I am so sad that we tried this spot our last night in NOLA. I'm sure if I would have tried","useful":2,"cool":1},"-WdYerinMXLkilRp1hnLvw":{"text":"This is our favorite place in the French Quarter.  It is the cleanest, with the best food ","useful":0,"cool":0},"DoVpEPxNZ8_Mcy48-CA9yA":{"text":"Yay for oyster bar happy hour!!! I believe it was 4:30-6:30? Something like that.   Half p","useful":6,"cool":4},"7-7MtY6mTq1i9QYI6e5PMQ":{"text":"My first dinner when I arrived to NOLA. \n\nService - 5*, Joseph was excellent! Super friend","useful":0,"cool":0},"4nuhIypG_DdAoZk2KvWWng":{"text":"We stopped into this place for a late bite. This little gem is open until 10 or 11 every n","useful":1,"cool":1},"Lp_JrdTWP6i9KtvBm5MFSg":{"text":"Quiet place with upscale decor.  Charbroiled oysters were disappointing, just ok.  Oysters","useful":0,"cool":1},"kIPBC3BbnlrEpi2FsbC9pQ":{"text":"Great recommendations from the server. Fried catfish was delicious, as were the Cajun egg ","useful":0,"cool":0},"viv6cO4hl9UpyCCxJ4_N2g":{"text":"This restaurant was recommended by our hotel. We had the jambalaya and gumbo, both were de","useful":1,"cool":0},"nhDq3casiB56UQij9Alsxw":{"text":"This spot was awesome. Food was absolutely superb. I had the shrimp pasta and my friend ha","useful":0,"cool":1},"0T3nsQ_kHwbiEG-_cq16SQ":{"text":"We were a large party and finding a place to accommodate us was getting difficult. Our hot","useful":0,"cool":1},"VXsPMmJFdJmlwybd80-TFA":{"text":"I stop here for breakfast every time I visit  town, I always order something different and","useful":0,"cool":0},"HqP7mLticG5LcmCEa2ZThg":{"text":"Blackened gator is amazing drinks are reasonably priced and that cheesecake was out of thi","useful":1,"cool":0},"DWWxhXo4QaqU91wFE8Ecqw":{"text":"We came here because of the bulding collapse detour.  We overheard locals saying this plac","useful":1,"cool":0},"JycUPLXJU6oNiSF_U-ghlQ":{"text":"We ate here TWICE while we were visiting NO, that's how much we liked it.  The boom boom s","useful":0,"cool":0},"ucclDeEzwswdC64uUn1GHA":{"text":"Oysters were great, ate at the bar and shared a shrimp po boy. Very solid, bar and wait st","useful":0,"cool":0},"fsTt773SvjVtg9Z5ihIypA":{"text":"New hotspot in the French Quarter! They have happy hour from 3pm-6pm weekdays. Osyters are","useful":2,"cool":2},"l8emoyFQwLnadGzvg7Astg":{"text":"Sat at the back bar with Michonne. She was amazing!  Great oysters and seafood gumbo.","useful":0,"cool":0},"daLdqa7y7dit7NGVAYC5yg":{"text":"Stop by for lunch at Coterie Restaurant. Have to say if you want to try southern food this","useful":1,"cool":1},"3a9kz4ff9onVNfRv9wAHew":{"text":"We flew from Maryland just to have an amazing dinner at this beautiful restaurant. Richard","useful":0,"cool":0},"hEzgnnEaBNweZ1NEq-JKYA":{"text":"So good!  Fun, convivial atmosphere without being showy or fake. Would add a pic of food b","useful":0,"cool":0},"I1HUa5hQTycNG7_F_geGIQ":{"text":"I'm disappointed because it appears that they have 2 guys doing the lion share of the work","useful":0,"cool":0},"Gvy-W6E2_U3sMr7i2ZZlIg":{"text":"In town from St. Louis. Super glad I popped in here. I passed it and doubled back. Amazing","useful":0,"cool":0},"KVzzG0tNDH3V1tVxsxt8EA":{"text":"We got in here quick and only had to wait 20 minutes for a table around 4 PM on a Saturday","useful":3,"cool":5},"NGVxXDrIzoIy5R4XD-BLcw":{"text":"Eek! I posted the wrong review. I do deeply apologize. This place had good food. The waite","useful":0,"cool":0},"gzLAjoMMoUbDr2kH0C64sQ":{"text":"Thank you dear bartender for making sure my cup was loaded with cucumbers and I drank mult","useful":1,"cool":1},"qnPan0d1JDCKePlq4ZVQ9Q":{"text":"This place was horrible!! It was midday so they were not busy at all. The waitstaff not on","useful":0,"cool":0},"n6HancFxdTfYpuncbq7Cfw":{"text":"Fantastic. Frank is the man and one the beat servers I have ever had. I had the Catfish Na","useful":0,"cool":0},"qq27ajuDyOEVY0P_p88Zig":{"text":"We had Frank S as our waiter and WOW he was phenomenal. We had the crawfish egg rolls, fir","useful":0,"cool":0},"cv3MyBnlzs-JsiZlwL0X5A":{"text":"Being that NOLA seems to have an employee shortage I'd come back to this joint but...servi","useful":0,"cool":1},"6zxtGLsrhoh7XGrKgsGnBg":{"text":"The service was amazing from Chris. Food was amazing! The oysters were phenomenal!! Must t","useful":0,"cool":0},"5H6XbTBquA7lr71PymiDww":{"text":"We ordered food-to-go here.\nThere was a bit of a wait,\nbut the food all tasted good.\nThe s","useful":1,"cool":0},"e00-gYpkzTCubE1yfKCexA":{"text":"The Chargrilled oysters are an absolute MUST! I make it my mission to try them at every re","useful":1,"cool":0},"WFfNwdmd2UOy831L7IHymg":{"text":"We needed somewhere quick and fast to eat while waiting for our pedicure appointment. THIS","useful":0,"cool":0},"n-_RhEFu4-H6yjmxHrgqOQ":{"text":"The best shrimp and grits I've had in NOLA so far. Nice atmosphere, great service, clean a","useful":0,"cool":0},"xzXh3meho7kedhuTtgU2UA":{"text":"I absolutely enjoyed myself at this bar. I was treated with respect and the service that I","useful":0,"cool":0},"rb5AO84jQn-5Z1xHTahITA":{"text":"This place was delicious! The red beans and rice was amazing. The waitress and bartender w","useful":0,"cool":0},"j5T8G49qN7hfodBqO-NUVA":{"text":"Only visited for Breakfast but actually ended back there twice in our four day trip to NOL","useful":1,"cool":1},"mNVT02-mTahRyhgAjwJTbQ":{"text":"AJ was phenomenal!  The food was great, the drinks lovely...but the service he provided wa","useful":0,"cool":1},"_ph-WE9BU2KxAsPKX773xQ":{"text":"My dad and I visited this place for dinner while we were visiting New Orleans and we will ","useful":0,"cool":0},"Zzjy_dWQv_z7Qq1wgm8yYw":{"text":"Since there was a long wait at Ruby Red Slippers Cafe, we wandered hungrily into Coterie R","useful":8,"cool":9},"B12YUAojq9vG0eDRmGX_ug":{"text":"The food was amazing here! We had a short stay at The Eliza Jane was told to try Coterie N","useful":0,"cool":1},"hokCHic2KoqQh3yC8aturA":{"text":"We were walking back to our hotel when we happened to stumble upon this place and I'm so g","useful":0,"cool":0},"Szl8qcGpR2kepVlMxj7IeQ":{"text":"Excellent charbroiled oysters. BIG and juicy.. waiter, Michael,  is fun and efficient . Th","useful":2,"cool":1},"5Qof7RmdPA7fL0hLd1N9jg":{"text":"This is such a great place to get brunch or lunch!\n\nWe came here twice in the four days th","useful":0,"cool":1},"-XBgOmr-o6R0h9r1naB0Og":{"text":"Best lemon drop martini...and an original bread pudding that is so good!! Real New Orleans","useful":0,"cool":0},"iR_tK6RK-mbi34hxZmV9OQ":{"text":"My husband and I came here to eat dinner on our first night in NOLA and the food was divin","useful":2,"cool":1},"BTRo-JTZihgaGS3sRP0K-A":{"text":"My wife and I visited this restaurant on 3-3-21 at approximately 1630. We had taken a swam","useful":0,"cool":0},"n16oN4MZRtsSpfdZsRpTMQ":{"text":"This place is amazing. Totally low key vibe, they play great music., have amazing oysters.","useful":0,"cool":0},"chVd9ywE1oAe9N0KLoAayA":{"text":"Great service and food was top notch. We ate there 2 times in three days. Server dan was g","useful":0,"cool":0},"ewrGkxYt8eZSC8bAEXbXVw":{"text":"We had a fabulous experience at Coterie NOLA. The Bloody Mary with house infused vodka was","useful":0,"cool":0},"WPCsUYpH8QA3X7YwE-ul9Q":{"text":"This place is amazing the food was great and the waiter AJ was the best waiter I have ever","useful":1,"cool":1},"BXcX4Dh4HT3g5_SJEbVCJQ":{"text":"We stopped in for some happy hour oysters and beers at the bar and I was fully expecting t","useful":3,"cool":0},"JFBqvDtF-fexrGtn7Iz-uw":{"text":"Poor guy! My wife and I had lunch Thursday, March 18, 2021 and there was only one server. ","useful":0,"cool":0},"A6zpRZWgH2kmhGrrQnoKrA":{"text":"Stopped in here for some happy hour drinks on our way to the room one night. We sat at the","useful":2,"cool":0},"B6nWfPLzDEUfGDZdJSPAMw":{"text":"Wish I knew about this place earlier. We went there for lunch before heading home.  Clean ","useful":0,"cool":0},"r3dirhErWlhmty-ZZM82-w":{"text":"Do. Not. Skip. These. Oysters.\n\nThis was my last spot i went to in new orleans and i am gl","useful":1,"cool":3},"dPz9AIOCIgIq3uPZ3NVnhg":{"text":"We came here on our last night in New Orleans and personally, it was the best meal we had ","useful":0,"cool":0},"n657yeD9p6xrEIenr0L6oQ":{"text":"LOVED my food at this restaurant!! Great bread pudding and pecan pie, and great portion si","useful":0,"cool":1},"tZwYn6ldv8LO4iTq28S0yQ":{"text":"Came here upon recommendation from our swamp tour guide and it did not disappoint. The cha","useful":0,"cool":0},"tho3V_MceENbem9CjfRuGQ":{"text":"The location is good, kind of a touristy spot in downtown, if you feel like doing that som","useful":2,"cool":0},"fgvUOR-x6hlZBTN4gMfs5Q":{"text":"Great oyster bar! This place rivals some of the best\noyster bars in the New Orleans. Last ","useful":0,"cool":0},"90046FJ99Cgj8rACtbD1tQ":{"text":"One of my favorite restaurants in New Orleans. The best grilled oysters in Nee Orleans (in","useful":1,"cool":1},"QddB2px2VrbUqlQfgW0ZhQ":{"text":"We were determined to find charbroiled oysters close to our hotel, Drago's is about a 15 m","useful":0,"cool":0},"LMVlPyQzY7CUeSAUQBy6Iw":{"text":"Excellent food, wonderful bar.  After having one of their hurricanes, you won't want one f","useful":0,"cool":0},"Y7awzLzkptqdEY6fDwDprA":{"text":"Visited here on a Saturday night for a Bachelorette party. I called a few hours before to ","useful":0,"cool":0},"PG202g6EexMWrYGZ2hICLA":{"text":"They serve a drink called the Lemon Drop which was pretty good. I had the blackened Redfis","useful":0,"cool":0},"xobF_UAYvnswTgW6WBf_jw":{"text":"I've visited Coterie a couple of times over the many visits to New Orleans. The char-grill","useful":0,"cool":1},"hAoyL99l7x94Vy70ksZvEg":{"text":"If you are staying any where near this place it is worth a stop or more to take in the gre","useful":1,"cool":1},"_8CUfxos99gy2gOPUF2rWg":{"text":"This is the spot for the best oyster happy hour around. We stopped in for lunch one day fo","useful":0,"cool":0},"fVsBKlaayj_xNV0z11_2hQ":{"text":"Love the 0.50 cent oysters during happy hour . Corn and crab soup adds comfort after a lon","useful":1,"cool":1},"UzMrWbdWyCIebg9jVePEfw":{"text":"I was in Coterie for less than a minute. The countertop was disgusting. The tall white guy","useful":0,"cool":0},"S3jkiZVx69PuSEm5pr1kcQ":{"text":"Good food. Pleasant atmosphere and staff.  Big thanks to Derek who was prompt, friendly an","useful":1,"cool":0},"Pm0B3OjTlFHacTVGnwwoUQ":{"text":"Came to this little spot after a date day at the aquarium. The atmosphere had a really pos","useful":2,"cool":1},"tNhQL-XvEJHsJ0qYawy51g":{"text":"Happy hour was very cheap.\nOysters weren't great but I heard people saying the chargrilled","useful":0,"cool":0},"xF8-SGZsxcFOBO5S40xuaw":{"text":"Visited Coterie Restaurant the day after Mardi Gras 2020. We stopped here for Brunch. The ","useful":2,"cool":0},"aCAfcAMLCV7GGyuPcGrmIg":{"text":"The food was decent and the service was good. I reserved a table several hours prior to ar","useful":0,"cool":0},"oqxlNYaz7yEU8mHvi1TtXA":{"text":"This place was amazing. We just arrived here from jersey and concierge suggested this plac","useful":0,"cool":0},"NcGgaDPgnIqtGA9hS8LTkA":{"text":"Love the food here! Shrimp etouffee and alligator bites are the best I've had in French Qu","useful":0,"cool":0},"fdtz3nQv1daPWgzCZ2hfgg":{"text":"Fire Cracker shrimp was amazing. Have to get. Jambalaya was good but extremely filling. Go","useful":0,"cool":0},"5fOht2o_wgKGA5KDVWASsg":{"text":"This place was by far the best food we had in New Orleans coming from Chicago. Chi town we","useful":0,"cool":0},"nye8wU0k9ZegUfYCER44Nw":{"text":"Charbroiled Oysters are highly recommended. AJ was our waiter and he made our experience b","useful":0,"cool":1},"NU3ZeNLOLY7-vCwIi8DJRg":{"text":"My wife and I were in NOLA this weekend and this place was off the beaten path, but only t","useful":0,"cool":0},"msEa8j5qY8PZy4ZWKNs_-g":{"text":"Food and service were on point! Music just accented the whole experience! I'm definitely g","useful":0,"cool":0},"S7dQieFWi7EMhj0a5Xl3AQ":{"text":"We had a party of 9 people. Our server AJ was amazing. He kept our drinks filled all the t","useful":0,"cool":1},"XgQP-pWhQLz_GNG6TGL70g":{"text":"Outstanding service all around. The management team squeezed us in for a last minute reser","useful":0,"cool":0},"4dNRjfkEz9QawX-5KEpUKg":{"text":"Had brunch at the bar and it was fabulous. Tammy is great and made the best Bloody Mary I'","useful":0,"cool":0},"bf5aq3SLnmIB3lC5PN3rJw":{"text":"First time in New Orlean this place was recommended by a friend we absolutely love it we'v","useful":0,"cool":0},"FvHuamAXPN2GOc1QQ5uGLw":{"text":"My boyfriend and I went here for our last stop. We wish we could have gone here first beca","useful":0,"cool":0},"49047aTL5tetD8vAIWc_-A":{"text":"Terrible service, average food. Started off with very late drinks, then the waiter forgot ","useful":1,"cool":1},"f-o5wibFHrb3aL57Gaw4UQ":{"text":"We come to New Orleans several times a year and have done so for a long time, so we've eat","useful":0,"cool":0},"_FaXwwudrR6U2ZT_xfA8Ug":{"text":"I've been working in NOLA for the last month. I've eaten here several times. As usual this","useful":1,"cool":1},"XaHV4ygFNw1bEAUrOPvWYA":{"text":"Yummy food but with the pandemic 'rules' AND because Biden's congress has expanded unemplo","useful":2,"cool":0},"kC7Ueu3hQ7K1yx8mOHhFHw":{"text":"Best Happy hour in NOLA! Phenomenal food. Loved every thing about it. Clean, great staff a","useful":0,"cool":0},"GgNKr9xXL9shpL_QotQFRg":{"text":"The chicken salad was delicious.  I didn't care for the jambalaya. They do have happy hour","useful":0,"cool":0},"OAS7mXqytiMNGskTe_DuNA":{"text":"Great food, was highly recommended by our concierge, losing stars because our waitress kag","useful":0,"cool":0},"KlmrrRs2_ESYEeTyFeAOYw":{"text":"I'm giving this a 4 star because I want to come back and try more things on the menu.  \nI ","useful":1,"cool":1},"0a9MxmMBNUozqx-mezC_JA":{"text":"I was pleasantly surprised by the taste and quality of Coterie's chargrilled oysters. ($20","useful":51,"cool":54},"OoZuPYtrr2Owy_dQ9kRU5g":{"text":"Was very late and couldn't get a table to accommodate. I get it. Staff were tired and want","useful":0,"cool":0},"_Ea7RJIZXfOc6btbFpLK-Q":{"text":"Went for dinner. The food was fantastic. I highly recommended the blackened redfish and th","useful":0,"cool":0},"BRNDyjUx_oej_AED2LjipQ":{"text":"Alligator bites are a must for those just wanting to give them a try. :)\nMy Coterie burger","useful":1,"cool":0},"ntGhCLhG10c2Ib59l0uO_w":{"text":"We had a great experience both times we dined at this place. The first time we went for di","useful":0,"cool":0},"kYnu0K7JW9ynit8XVfli1Q":{"text":"Food was so good! The service took awhile at first but then it made up for it with the ama","useful":0,"cool":0},"QrysiozgV7M_2DFuS9G2Hg":{"text":"ANTISEPTIC REMAKE\nA few years back the Huck Finn's at this location was involved in a very","useful":8,"cool":3},"6ruGD2ee9QNagDl7WD215g":{"text":"Great place!  Great food! Highly recommend.  I will make sure and go back next time I am i","useful":0,"cool":0},"jIPC-_gpEiFpFihQixmVgA":{"text":"Ate here 3 times out of our 4 nights. The best was the shrimp pasta. Had it twice and was ","useful":0,"cool":1},"BKBSboUzyzK_dGmXXsexMA":{"text":"I visited this restaurant for the second time and it was equally as good as my first visit","useful":0,"cool":0},"lTnfiFU6rcO5pXdzjU7H6w":{"text":"We only had a few days to find a restaurant to hold a Wedding Dinner for our Daughter.  20","useful":0,"cool":1},"4Fe2RETkLlyAyJZOTerxuA":{"text":"We had an amazing dinner with one amazing waiter...  Alphanso was awesome!  He took such g","useful":0,"cool":0},"s75z6Z2Lle12x2g4S2XihQ":{"text":"Hands down the best place we've had while in NOLA! Nice environment away from the rest of ","useful":0,"cool":0},"zX_ELQxY7FicYxwRCySIsg":{"text":"After a long day of traveling and not eating all day (7 hours), we decided to go to Coteri","useful":0,"cool":0},"wcEM8MF4muwAu1Xa_mHhNw":{"text":"Amazing happy hour menu (drinks and  oysters!!!) 75 ¢/oysters. We had 13 raw and 3 chargri","useful":1,"cool":1}}