{"vlbDKugRCj1HKdCE1HL6bQ":{"text":"I recently had a very frustrating experience with For Your Eyes Only 20/20. I first visite","useful":1,"cool":0},"8S2lIjPpInolorj8J-B1xg":{"text":"The staff here was absolutely wonderful and incredibly helpful.  Shopping for glasses for ","useful":2,"cool":0},"HGTFIitKIYUf9Es_WjXCqA":{"text":"It's a small shop. The receptionist was nice, polite. \nNot a lot of room in the waiting ar","useful":1,"cool":0},"yqDY2T4M0Yb4NVFlYVCiJg":{"text":"Staff was great ,short wait time Dr was super nice prices reasonable what more could you a","useful":0,"cool":1},"XXVGALOJwvlLQEUBMsPK-A":{"text":"I would DEFINITELY NOT recommend For Your Eyes Only. They are consistently late, to the po","useful":2,"cool":0},"ZBYdxPs1RWI26uL5aiEyaA":{"text":"Terrible customer service! Do not go here! Waited for almost a month for the contacts I or","useful":0,"cool":0},"vVryDhdqJuc-jHbehOXC0A":{"text":"Selected this provider because they're an in-network provider for my healthcare plan and b","useful":0,"cool":0},"1qbThUGqKpgLtKyCKLoVOQ":{"text":"I really like this place. It's very small and blends into the other storefronts on Magazin","useful":7,"cool":1},"txcCTqE8eAO1Qx9jVGvMSA":{"text":"I understand this eye clinic is now under new management, so disregard the good reviews fr","useful":0,"cool":0},"Zi3NvEe8kYGGuc49HmZ2TA":{"text":"Prices- affordable.  I was pleasantly surprised\n\nVariety of merchendise: poor- there were ","useful":0,"cool":0},"BiQj_8Q_rJGE8oGfemrMsw":{"text":"Great, exceptionally friendly and helpful staff.  The office is small, but the service is ","useful":1,"cool":0},"n8OlRdMEnsfg6oE6v1-nWw":{"text":"I really can't argue with the rest of the reviews here.  The staff is super friendly and h","useful":2,"cool":1},"JCYwnCbSwSOOYnlwluLxaQ":{"text":"The 3 stars are an average of a 5-star exam experience, and a 0-star check in and wait tim","useful":0,"cool":0},"ZCkd-GrB3RhCO2mrQTrqwA":{"text":"I chose this place from Yelp.  I had gone 2 years without getting my eyes checked so I jus","useful":3,"cool":0},"K-UZUGHAxBjW15__tF3mNw":{"text":"Had an appointment here. Went well, doctor was charming and competent - I trust her assess","useful":3,"cool":0},"uEAi0alNpJiLf7TgM1DbDw":{"text":"I love their office. My doctor takes her time and answers any questions I have. You don't ","useful":4,"cool":0},"XxqsLawk_6F3lDOo8LNAfQ":{"text":"Visiting the city with my soon to watch the Saints game. Unfortunately he rips his contact","useful":0,"cool":0},"X2y8Es2-rIg2iD1at3Y4RA":{"text":"Travelling in New Orleans on business and had issue with vision, they were able to work me","useful":1,"cool":0},"VYWqmQK29CtA5iY88LQ6tA":{"text":"I do love this place, especially Dr. LeBlanc. But my most recent experience but not great ","useful":3,"cool":0},"F6rYr_B7_ZFUwD8ZrEUcDg":{"text":"Great drs., great staff and FABULOUS prices. My complete eye exam and contact lens fitting","useful":2,"cool":0},"3RnFvkErERQMJI8rIrSVxg":{"text":"They really are for my eyes only!!! The staff is super friendly...the doctor is just as fr","useful":3,"cool":1},"H4fimIci5GUo8ip5ZjdXYQ":{"text":"They were great!  I didn't wait at all, the doctor and all of the assistants were super ni","useful":6,"cool":0},"JTC6esfd_CBeYLkm2DejVA":{"text":"Well, I put my misgivings aside when I read the negative reviews, because hey: i can handl","useful":6,"cool":0},"fWBbS_8ra82-1-zriYUF4Q":{"text":"Dr Richardson was very efficient and pleasant.\nHowever the office staff are completely inc","useful":0,"cool":0},"7g5I_8fbO6sK-Y73H7EFPg":{"text":"This is the most welcoming establishment to visit if you need glasses. The optometrist Dap","useful":1,"cool":0},"UksJb7vMYjy8GANXQmBDBA":{"text":"I have been waiting 1.5 hours now (still waiting) and the same thing happened last year, w","useful":1,"cool":0},"7bsl1sclr4PuxxiWzyDN3A":{"text":"It took eight weeks and five visits to get one pair of glasses that weren't off. I've neve","useful":3,"cool":0},"WKz9Cxk0BqhyQzaepYV6YQ":{"text":"I gave 2 stars rather than one, because the optometrist was nice. However the experience w","useful":2,"cool":0},"Zb-ih6nZxidO51f1G1VjoA":{"text":"I was told they accepted my insurance over the phone, so i booked an appointment. On the d","useful":3,"cool":0},"9xZ3ojteFu8VdYDDUJMGWQ":{"text":"Not a Yelp guy, nor am I a fan of when people take shots on social media, but good LORD th","useful":2,"cool":0},"RJGCBwP9zkhRvPiWurlqTA":{"text":"I had a 12 o'clock appointment. At 12:40, I had not been seen. I asked how soon I would be","useful":1,"cool":0},"4GY4gnO9ByT7Iv1HmcLqnA":{"text":"Ease of making appointment \nSeen within 5 minutes of my appointment time \nWorker verified ","useful":1,"cool":0},"ptwe4-oS88G70lKWoeqSSQ":{"text":"Dr. Richardson is truly a great doctor and human being. She has always gone  above and bey","useful":0,"cool":0},"vPyGIJin0uQQR5yxmvnABw":{"text":"Bad experience, this place tried to charge me 20 dollars and sign a paper to avoid blaming","useful":1,"cool":0},"EoolRMtbFSBENYqmRFadRw":{"text":"Previous reviews mention that the business hours of For Your Eyes Only are a little varied","useful":7,"cool":0},"S63nq8XLM_xErrOlmL9GuA":{"text":"Went here recently to get a pair of glasses fixed. Friendly and helpful and quick. Been us","useful":0,"cool":0},"VlQpqCrfzuktvZn3PxrTmA":{"text":"I've been going here for 3 years and the service has always been great. They are usually a","useful":0,"cool":0},"bsmB7XlLBAnSp6B6SPPgUg":{"text":"They were 40 minutes late and proceeded to see the appointment after mine before me, even ","useful":0,"cool":0},"MGJevcrJD1VPDKdQvu369A":{"text":"Save yourself time and aggravation and stay far far away from here. This place is complete","useful":3,"cool":0},"AXyEetIIblOUbs9zOsDyug":{"text":"Don't even call this place. They could give to shits about you. They cancelled my appointm","useful":0,"cool":0},"ijI7yZ-6eJXCx_mQjynlNQ":{"text":"I cannot even express how happy I was with this place!  I walked in and they were busy, so","useful":0,"cool":0},"C9Uhjkpg5yXdJqkYJJSHzg":{"text":"Was told by the doctor that the contacts I have worn for 20 years were no longer made, and","useful":2,"cool":0},"LMXtuJnI-6VZFpdNQPGaMg":{"text":"Dr. Richardson diagnosed me as having glaucoma and put me on prescription eye drops to tre","useful":0,"cool":0},"5WPkao6UuxqcdmJlcgeopQ":{"text":"This is my first time here. I'll try to update after I am done but I can say that I came i","useful":2,"cool":0},"wF4XM-7WKmp2ngW-lPzTRw":{"text":"After 4 years, I finally needed a new pair of glasses and decided to head to Dr. Richardso","useful":1,"cool":0}}