{"AEXvZDZqM6J6hC09Bo0yDg":{"text":"This place is super delicious, and chic. This is not your particular Mexican food, this re","useful":0,"cool":0},"5i23GGD0VBGGm_x7gclcYQ":{"text":"We had an overall PHENOMENAL experience dining at Johnny Sanchez in New Orleans!  From the","useful":0,"cool":0},"nDHjWB4l8rnavYmCCbr2RA":{"text":"Really wanted to like this place Bc of the good reviews I've heard previously. First, took","useful":0,"cool":0},"lqxzaUnu7J32gKuvRYeKIQ":{"text":"It doesn't have to be called Mexican. Yes, there are chips with salsa for starters (planta","useful":0,"cool":0},"S9XXMbqh0cEOpACpGjsezw":{"text":"Great experience. Food was amazing. I had crawfish enchiladas and it was stunning. Service","useful":0,"cool":0},"DelUGVlMC9adw_TFSzOcpg":{"text":"Great food and great service.  Our family of four shared two large plates consisting of ca","useful":0,"cool":0},"tBVs7yiAIPh8jbXhH6fz8Q":{"text":"Start with complimentary plantain chips next to a great red and green, smokey dippin salsa","useful":0,"cool":0},"INOozC1IE229NAv-d6HW1A":{"text":"Big fans of Aaron Sanchez on TV show Chopped, so definitely wanted to go here when in New ","useful":0,"cool":0},"-EGjGYi-x98UIenC0NLlNQ":{"text":"Wow. Not much menu and took 45 min to get our tacos. I mean come on they were tacos. Marga","useful":0,"cool":0},"Mp3-IK6fHo1WOWfcykNjKw":{"text":"Best Mexican - besh is incredible! The brussel sprouts are the best I have ever had. So ni","useful":0,"cool":0},"bdXBFhA9AfUvMhaYu1jYgQ":{"text":"I was skeptical going into the slightly empty Mexican restaurant since we were in New Orle","useful":0,"cool":0},"VjHZNKcrkwCrMyWNepKBEw":{"text":"Four of us ate here on a Wednesday night. We were seated right away, as we had reservation","useful":1,"cool":0},"0sVG3WkeDFJ42BrUMSP_MQ":{"text":"$2 taco happy hour - what's not to like !\nOrdered one of each on the listing: meatball, po","useful":1,"cool":1},"OwGbTME_9dDUXB6C1oWiEA":{"text":"The atmosphere is great! It's pretty pricey considering the amount of food they serve. We ","useful":0,"cool":0},"lOfVROfs-m0e_ljzqWkszA":{"text":"Couldn't be happier to have this restaurant in t he CBD!  As soon as you walk in, you smel","useful":0,"cool":1},"kxU8SOGVljFLCXjjPzq1CQ":{"text":"In new Orleans for the long weekend and sure let's try a restaurant a block from our hotel","useful":0,"cool":0},"ryac9UEOC551PTqhhm6zbg":{"text":"Would have liked to had the opportunity to enjoy the food and drinks here. Sadly, we took ","useful":0,"cool":0},"s0oLQkMNVmkZ9VozaRYq2w":{"text":"Customer service and atmosphere was wonderful! However, food was way overpriced for their ","useful":1,"cool":0},"qtmqvjhHd58347pnWVArKQ":{"text":"The cauliflower tacos are a must! Guacamole was very tasty as well. Great vibes from decor","useful":0,"cool":0},"6sWydE5HdI0R7B6UcTYXQg":{"text":"We had an excellent lunch here. The empanadas were my favorite appetizer during my trip to","useful":0,"cool":0},"vuP70c7gan52a12ZgoZ_ig":{"text":"We've been looking forward to trying out Johnny Sanchez since before we moved to New Orlea","useful":1,"cool":0},"yo0QXsCXsXX1j_VxWejgPw":{"text":"Super yummy food and great ambiance. A little pricey for one little taco but worth the exp","useful":0,"cool":0},"9TVRQYjbFpu21vk792xh4A":{"text":"The arroz con pollo is to die for.  Excellent margaritas as well.  Everything our party go","useful":0,"cool":0},"ANCTUjT8Hyay-Q8c1WxDCA":{"text":"I went to this restaurant  to celebrate my nieces graduation from Tulane. My table shared ","useful":0,"cool":0},"CiKK5SvqQ6FE9ZaxQjhd4w":{"text":"Mixed review on this one.  My food was not so great, it was sort of flavorless,  it the th","useful":0,"cool":0},"BOQgC_jQFXju7yo4FyxlxQ":{"text":"Decided to try this place out because of the Monthly culinary menu special. Made a booking","useful":3,"cool":1},"jUap_38kexIRs6UwrXKqXA":{"text":"I had heard many great things and one average review. We went today with group of six. Non","useful":0,"cool":0},"MH-gyhoCEw7bo_YTLllbxA":{"text":"Had the most amazing cauliflower tacos !! We live in Mississippi but the next time we're i","useful":0,"cool":0},"AGTodFlhmj09SxjXGv7O0Q":{"text":"Excellent food, experience, and ambience! Recommend the queso, strawberry/vanilla margarit","useful":0,"cool":0},"W716AjhAg1f-3pVp7Dh0kA":{"text":"We stumbled upon this gem while walking to our hotel.    The food was OUTSTANDING - dinner","useful":0,"cool":0},"vh6gS49OQzH1cv7He5yZcw":{"text":"Snapper Ceviche over priced at $16.. Seriously no more than 2oz of actual Snapper. House m","useful":0,"cool":0},"qoTOcMqau_079pHzUNzprw":{"text":"The food is good but they clearly went up on the prices for their lunch menu.  I had an ic","useful":0,"cool":0},"xw3Kta7dF-1yT0r2524JWw":{"text":"This is an amazing restaurant!!!!! Our waiter William B was amazing as well! Gave us \"out ","useful":0,"cool":0},"hBaFwQmdrFcGoKO80ehz7A":{"text":"I am not a fan of corn tortillas but I love the Des Allemends fried catfish taco. The taco","useful":1,"cool":1},"uTJrWeVV3RoKRh10Jiu7kA":{"text":"Sub par.  Restaurant was nearly empty on a Saturday night.  Had such great hopes for the p","useful":1,"cool":0},"J2VYq_JgaeH6WoqIVGqu3Q":{"text":"Johnny Sanchez! I like it! This place is a different take on the type of Mexican food we a","useful":10,"cool":7},"9DjOAoRLI6rOi50mMV855Q":{"text":"This place is amazing! The service was top notch and the food was epic! Our server made su","useful":0,"cool":0},"vgCry4PDR5qyBzR8qKrG5A":{"text":"I've been here twice and absolutely love it!!! They have a great happy hour deal with taco","useful":0,"cool":0},"M3Mb_wvgZ-30B8EZAkyzug":{"text":"I love the local Besh restaurants. I like Aarón Sanchez on TV. I love Mexican food. Mix al","useful":2,"cool":1},"lud4zeUrgAmbyn2FuiTVTA":{"text":"The atmosphere and vibe of this place screams fun and laid back. Great art and lighting. \n","useful":1,"cool":0},"kqITQRaoJyzg9kF0aMREPg":{"text":"I went here as my wife and I are huge fans of Aaron Sanchez and John Besh and I was not di","useful":0,"cool":0},"bPV6P8CnveE8cMSRGJflhA":{"text":"We came here for lunch on a Friday. My husband and I both had a margarita, these were pret","useful":0,"cool":0},"Z6o8r1mrpnF1P_dgZyXMrA":{"text":"I thoroughly enjoyed this place. It's different from your typical Mexican restaurant,  a b","useful":0,"cool":0},"9TeD6G81SRarpYqWYLHbfw":{"text":"4 solid stars.  This place sits squarely with 4 stars IMO.  Great food, tasty margaritas a","useful":1,"cool":1},"Hry_yYBJLtK_B-IhVGkDZQ":{"text":"Ordered off of Uber Eats, as I was having a hankering for chips and salsa, and their red s","useful":1,"cool":1},"DULIO6y5ZtCJEesBbX60wA":{"text":"Nothing bad on the menu!!  I've been here a number of times, and haven't found a bad dish ","useful":0,"cool":0},"nVz0NOW2uJ1Ddo7Zy9WKnQ":{"text":"We went for dinner on a Saturday night early before a show and the restaurant was just sta","useful":0,"cool":0},"IPkgqdxrDkayaXbH0sOeJg":{"text":"Thank goodness for this place.  I love Mexican food and was getting tired of eating all th","useful":1,"cool":0},"76S28iVKU8yE2KZ7EbYZ_A":{"text":"Had a lot of great Mexican food in my life.  This was a big disappointment.\n\nService was o","useful":0,"cool":0},"qbDElhT_1QOl7kNqdGAQXA":{"text":"Johnny Sanchez is an upscale, beautifully-decorated, contemporary Mexican restaurant. Serv","useful":1,"cool":0},"BFXGMymTu2SAL_JcirHdww":{"text":"Came here because of the reviews and it has not disappointed. Drinks a little pricy at $12","useful":0,"cool":0},"9OXykd90decBmqzET5me1g":{"text":"I can't say enough about how much we enjoyed this restaurant. Great atmosphere and service","useful":0,"cool":0},"-h5kGwM6DSSnlgcM7iDvxA":{"text":"Johnny Sanchez had a pretty good happy hour: a selection of their tacos for $2, half off w","useful":2,"cool":0},"JFFdtdc3-EJUlpB_vANd3Q":{"text":"Loved this place!  While a pitcher of house margaritas was a bit pricey they were really g","useful":1,"cool":1},"j4odQ4fZhVRSroRvzJ-FGg":{"text":"I called to ask if we needed a reservation for lunch on a Tuesday and it was recommended t","useful":2,"cool":1},"n5DDekyAMcLjH_8A6MDshQ":{"text":"My friend and I absolutely loved Johnny Sanchez! The ambience and decor were also great. W","useful":4,"cool":2},"hqj1lv6BHWpYVs1HM89Evw":{"text":"Let me start off by saying the corn side is DELICIOUS!!! =) Another John Besh win! We enjo","useful":0,"cool":0},"9Ac2KNCDwG6gLJ1_OkhNLQ":{"text":"I'm a big fan of cooking shows, so now that Aaron Sanchez is a judge on Masterchef, I was ","useful":0,"cool":0},"Fox1UzfpwA7iVDXbDpa5wg":{"text":"This restaurant is amazing from beginning with drinks to appetizers to tacos to desserts..","useful":0,"cool":0},"DJP7RixLke51dg7MVBXdpA":{"text":"My husband and I ate the oyster tacos along with a barbacoa taco and queso fundido not to ","useful":0,"cool":0},"U0OamKd-wgIzqZX5N8GMWA":{"text":"I went here a week ago for a date night. \n\nI actually heard about the restaurant Aaron San","useful":1,"cool":0},"aOX94oMV_-voFS6w-KHM-g":{"text":"When you hear \"New Orleans Cuisine\" you immediately think of Gumbo, étouffée, fried catfis","useful":0,"cool":0},"roykeOvVIXwgfFFg1qep6A":{"text":"I wanted to really like Johnny Sanchez, but found it to be good not great. The guacamole w","useful":0,"cool":0},"WzTn4quiVYg5_8y2TaNxMQ":{"text":"Very loud and open restaurant, but amazing mural on the wall. Nice selection of tacos, but","useful":0,"cool":1},"yFY7RGI130SSu3hpjL_ckQ":{"text":"The food is pretty fantastic - and so are the margaritas. They started us off with chips a","useful":0,"cool":0},"8j9TdV1dgAGBuUEKcF-iZg":{"text":"The service was second to none and every bite was as if I died and went to heaven.","useful":0,"cool":0},"2vfS7Fo4GsbYHI9b2X2Pxw":{"text":"We were excited to try Johnny Sanchez (huge fans of Chef Aaron). We were so disappointed!!","useful":0,"cool":0},"4KZ57GmGdSSBv4tMPTUuMQ":{"text":"May be biased as I live close by but I love the margaritas and guac. Staff is great. Entre","useful":0,"cool":0},"GF4AzpGYwFwDnMENUghweg":{"text":"The chips and plantain chips salsa, guacamole and queso  are amazing! Some of thee best iv","useful":0,"cool":0},"GTldxEYZqMhWc4jJbEe-9g":{"text":"Oh where to start... Very disappointed experience went there with high expectations and th","useful":0,"cool":0},"tSrnKnhzcV0NsL0CBbvnag":{"text":"Excellent.  Tacos were very good, never had a cat fish taco. Tasty!  House margarita very ","useful":0,"cool":0},"Mrag6LWmN5aTJD7cI2x6DA":{"text":"Chris M was extremely slow and barely acknowledged our table out of the 3 or 4 in total he","useful":1,"cool":0},"E5CIzNml2QAsBT8K5cmgWg":{"text":"Came here for lunch with a large party. Food quality was great, though a tad pricey for th","useful":0,"cool":0},"9bED82msH6SFagh2Zgl1ZA":{"text":"Came in Taco Tuesday which was a nice surprise. The place is decorated in an urban, modern","useful":0,"cool":0},"Yt5TQ1QemtB4s6VhqdxDZw":{"text":"Excellent cauliflower and fish tacos. Good drinks. Love the free plantain that arrive when","useful":0,"cool":0},"z2oEws1S6qaHqyfmsHmLzQ":{"text":"I had a really good lunch here. The space looks great. I was toting two senior citizens, a","useful":0,"cool":0},"tBErE2kYpSMM4ciAcl3tNQ":{"text":"I love the Besh restaurant empire and everything he does, but somehow the details in his f","useful":3,"cool":1},"tWDOR45bhHp-dTjya-rzYQ":{"text":"Chef Landrem and his team deliver a superior food experience. Tried Tuna Tostada, Lamb bel","useful":0,"cool":0},"lwAgvtS1REs2SiagiWrdsA":{"text":"$2.00 tacos! During happy hour. Loved the avondagas and the carnitas tacos. We stopped in ","useful":1,"cool":0},"tI_uE27KjB4AbLuczIwr7Q":{"text":"Came here for lunch with high expectations. I LOVE Mexican food and since Im from Californ","useful":0,"cool":0},"D7qMUicBhmhdu6ARYGkDnw":{"text":"The service was great and the waiter was very attentive to our needs. The food portions we","useful":0,"cool":0},"AQpXjP3eFdblZSjFkWAdAQ":{"text":"Wow!  Gloss over the fact that I'm an Aaron Sanchez fangirl because I don't want you to no","useful":8,"cool":6},"cILeCggt85Ie_iysGn8GCw":{"text":"This has to be one of the best meals I've had in my life, hands down. Beautiful, modern de","useful":0,"cool":0},"AWLgE-fWJv5wcbz9CAHenA":{"text":"I thoroughly enjoyed my first experience there for my Birthday dinner with family! Laurin ","useful":0,"cool":0},"sNgLsU4_RKJmPyiR0mTaUw":{"text":"Had good tacos, Carne asada was my favorite. Ambience is good and it's not so much crowded","useful":0,"cool":0},"Dcc334HjvX5ihh8nfF6lvQ":{"text":"I enjoyed the street tacos.  The house margarita was on happy hour and pretty good.  The g","useful":0,"cool":0},"bltFkHeoPJkyHHy1EERe7g":{"text":"Had a blast at Johnny Sanchez, Aaron Sanchez was in the house and he touched every table. ","useful":0,"cool":0},"15ltW0OnlWxk1mElipONbg":{"text":"We came in for lunch time with a fairly large group. We got seated quickly and our server ","useful":0,"cool":0},"SXQ_Cu2lVOzQexqeqAIQvA":{"text":"The atmosphere alone was fantastic. The food was out of this world. The queso was spicy an","useful":0,"cool":0},"5Op2dJYLh1VjOfp0rKbG2g":{"text":"We found this place on accident as someone in our party wanted a cold Margherita after a h","useful":1,"cool":0},"PEgIc3RKcXzTjGgjWvziDQ":{"text":"I stopped in because I love John Besh and I support everything he does. This place is a ma","useful":6,"cool":1},"mTq1GXmvmop6GuHvCELHjg":{"text":"Loved the different ceviche. Not large portions but the flavors were great. Strongly recom","useful":0,"cool":1},"ukGOPd0_HnIFJxCB5KJS_A":{"text":"Killer food!!  I had the catfish taco and oyster taco and they were incredible.  My reason","useful":0,"cool":0},"EmwSU-4UlqASqvWw86QhkA":{"text":"I was looking forward to this place, but was gravely disappointed.  The customer service w","useful":0,"cool":0},"bYDbr7Oxer6yDYRo1YxSbw":{"text":"I have some mixed feelings about Johnny Sanchez. First, we'll start with the great. The ca","useful":0,"cool":0},"vkuSjl3EYcYjEfn-Vpay1g":{"text":"OMG the Brussel sprouts. Do not question me, just order them - they are straight up to die","useful":0,"cool":0},"VjHmT9CrTWPA-ddcdJzqdw":{"text":"Tasty tacos. Extremely flavorful. \n\nThis place is a little out of the way for most and the","useful":0,"cool":0},"AqbgbCZsBxxrCrLkYVFWIQ":{"text":"The service and food was very good. We had a large lunch group and tried several of the me","useful":0,"cool":0},"LwiFz-ULsTgLp5wZoCeHMQ":{"text":"I'm convinced they put crack in the tacos. JUST KIDDING. However, the tacos are exquisite!","useful":1,"cool":2},"BnMRbLtDG4to42XJ-BMjVA":{"text":"Really really really slow service. Ordered a drink before my entree and still have not rec","useful":1,"cool":0},"RoONabhczT07qeCUf_7GFQ":{"text":"We went for lunch and had the Street Corn side, Carne Asada tacos, Pescado tacos and Pork ","useful":0,"cool":1},"fPIu0U0b5YzbB3f9VfQVFg":{"text":"Do NOT go here without a reservation. Food might be good but the seating is so poorly run ","useful":2,"cool":0},"IHD6EVjHpKY9bCuiJDZLoQ":{"text":"I was so bummed about this place!\n\nI was really craving Mexican.  We go to the resturant a","useful":1,"cool":0},"gpGGmtx8tJNrlJKAO1YbPg":{"text":"Fish tacos were good. Goat Tacos were excellent. Guacamole as awesome!!! They serve Dr. Pe","useful":2,"cool":0},"LPAKIiRHXrjePGOZvN5DXA":{"text":"If you don't have a reservation, you might as well not even step foot in the door. My frie","useful":0,"cool":0},"sJZRL-cxQZ-mgVBE_dMF0Q":{"text":"the food was mostly great but a few dishes were mediocre.  drinks kinda overpriced but sal","useful":0,"cool":0},"I_EYgnAwwGp9amjmBGe1kg":{"text":"Came here for the fist time with a friend I must say they have the best fish tacos I've ev","useful":0,"cool":0},"lTndGk4k9Q4naGaRZRNGrg":{"text":"Came here for brunch on a weekend with some friends. The food was excellent. They bring ou","useful":0,"cool":0},"nfxaDYO5rCgokV1lDnkldg":{"text":"Unbelievable happy hour. Bartender Erin is a total sweetheart and makes a heck of a drink.","useful":0,"cool":0},"kCcLcUbOueQXvsatlIg8kg":{"text":"After a few days in New Orleans of great seafood and also fried food I wanted to try somet","useful":0,"cool":0},"xrpi5nYA8UgOjJzDzY2pyg":{"text":"Great space, a bit loud but nicely - and very uniquely - decorated.  My original visit was","useful":0,"cool":0},"hhNiLeVLDuSmyDqj_vuiww":{"text":"Food and ambiance was great but the service was possibly the worst at any restaurant I've ","useful":0,"cool":0},"e17qdWPGI8fAWI5zArznBA":{"text":"So Johnny Sanchez is a cool little spot to try out if you're in the CBD in New Orleans. If","useful":0,"cool":1},"wCn264-_GUmuu36IAPTzAQ":{"text":"Not enough stars to describe the overall experience. The food, ambiance and service were s","useful":0,"cool":0},"7cqeGZyS9B6Lwv-z45sW1g":{"text":"The food here is great. It's contemporary Mexican fuzed to the US standards but really goo","useful":0,"cool":0},"TWKFNj4KmJ_qzoGDRDhkiA":{"text":"Johnny Sanchez never disappoints! Love the chips and plantains with salsa, and of course a","useful":1,"cool":1},"8YRHJ1yFy3wEclHm3VGGDQ":{"text":"Everything we had here was incredible. Salad, main course, and dessert. Waitress was a rea","useful":1,"cool":1},"kTs-QL1vMiVOhZeJ6I2t9A":{"text":"Such a unique take on Mexican food.  We started with the guacamole with oaxacan chalupines","useful":1,"cool":3},"9pH77NyRYZT9cBOUmy082A":{"text":"I went to this location with a few co-workers for lunch before a work event downtown and i","useful":3,"cool":1},"yPs3YI3igpQMXgZJa04CAw":{"text":"So very sorry to give this review, such a huge fan of Arron Sanchez. Loved the ambiance, b","useful":0,"cool":0},"uwlA3GBxXar9fCDzVuMWdw":{"text":"Outstanding classy Mexican food in New Orleans. The chips and plantain chips and salsa was","useful":0,"cool":0},"HUIIF72jE-myrSltRdSwEg":{"text":"I enjoyed the house margarita and the shrimp ceviche!  We also ordered the carnitas and ca","useful":0,"cool":0},"gUGzmlxsUJ_wtQA5aSo3bw":{"text":"Awesome fancy Mexican food when you need a break from the deep fried Cajun cuisine. The de","useful":0,"cool":0},"l5e25irAEFGe7Sf5StaqyA":{"text":"Ordered tortilla soup...terrible. Quesadilla was very good and plantain chips and salsa we","useful":0,"cool":0},"u1Cj6WvjQbzIW4S28MLCtA":{"text":"Brussel sprouts with squash were a ridiculously appetizing decision,  and the Carne asada ","useful":0,"cool":0},"N_pgiFfgSr_bcBm3V01IdA":{"text":"Amazing food and drinks. The decor is incredible. A must see in New Orleans.  The chicken ","useful":0,"cool":0},"OCjoq5J55U7CSwj2DZ4JQw":{"text":"Dined here during the first week the restaurant was open. There was a mix-up with our tabl","useful":0,"cool":0},"udKPAKZn9zvkVOJIXwMaeA":{"text":"great authentic Mexican food, although the tostadas are surprisingly small. great happy ho","useful":0,"cool":0},"43krysGjj2zgISopc7ZSAg":{"text":"Meh. Maybe it's the location, but I felt like I was in midtown Manhattan--which believe me","useful":3,"cool":0},"fTvvT7mNJb3VqSmFEDXPEQ":{"text":"$2 tacos during HH were freaking awesome. Spicy chicken best taco I have had hands down. C","useful":0,"cool":0},"jzwKEFu-_yCJlaiH3EG7sA":{"text":"Loved, loved, loved. Those brussel sprouts were divine!! I didn't want to stop eating them","useful":1,"cool":0},"tnIhtKMbJ7m1zy_KAq1NDQ":{"text":"Best place in New Orleans. Food is excellent, fresh and healthy.  Mexican with a flare!  G","useful":0,"cool":0},"7aVz6h7cPyQ6HO2rSQwlOQ":{"text":"Awesome service! \n\nWe came in for happy hour, M-F 3pm-6pm! They have half off drinks and $","useful":0,"cool":0},"ME-KjdviNiBbjlp2NgO5Jw":{"text":"Outstanding location and presentation. Attended Brunch on Sunday July 30 '17, First time. ","useful":0,"cool":0},"Oxtn92edTBUZ4EEFHrw6pA":{"text":"Really great place! Tacos are awesome, try the carne asada! \nThe Mexican street corn is pr","useful":0,"cool":0},"2P8K65Z8T2m7X5IBSeCygg":{"text":"We had an incredibly enjoyable meal, the service was wonderful, prompt and courteous, and ","useful":0,"cool":0},"aECoZj0HqEFd-9spkXaRHw":{"text":"I love the food, the atmosphere and the staff helpful and Knowledgeable. definitely a plac","useful":0,"cool":0},"snXS_tFuo7rqKNhc7fhF8g":{"text":"I went here the other night after work and I LOVED it. Whoever designed the space did an e","useful":0,"cool":0},"OMMBjpV7LteVvlmjyA0Urw":{"text":"The skirt steak was phenomenal as well as the street corn. Shrimp tacos were really good. ","useful":0,"cool":0},"1ftQike0_YSWwz-lX62www":{"text":"Delish! Carne asada tacos, carnitas tacos, fresh guac & street corn are to die for! Great ","useful":0,"cool":0},"S3GvU9KNooYW9djjEBfPGg":{"text":"Ummm... well as of right now I am the Duchess of Johnny Sanchez. I've been here about 5-6 ","useful":4,"cool":1},"YLeKiuDyJM4iTQxKBOUcKA":{"text":"Just finished brunch at Johnny Sanchez and I'm stuffed. I had the Arroz con Pollo and the ","useful":0,"cool":0},"_Biyo8Y2kJj96L_1lGiHtQ":{"text":"Decent food. Extremely not worth the price. You could buy three steaks and grill them your","useful":0,"cool":0},"SuiRbxAolwUj8O0QBVGqyA":{"text":"My first visit to Johnny Sanchez was back in November of 2014 and I absolutely loved it! T","useful":0,"cool":0},"Sj2K8Kf3tloinHoSzCVakQ":{"text":"I asked for just a rail bourbon at the bar, and got charged $11. Apparently they're rail b","useful":0,"cool":0},"EJcQ3KHazj7ar5yn2-fBUw":{"text":"Nothing screams Easter like margaritas (pitchers 1/2 priced) and Mexican food. The complim","useful":0,"cool":0},"twe8Iwnrs2plohTnY9yqGg":{"text":"Went on a girls only family brunch date (on a Sunday for happy hour which is 3-6p) here an","useful":0,"cool":0},"LwntpErPafOzyL6XkipHTA":{"text":"I returned to Johnny Sanchez for lunch for 2 reasons 1. The quick and genuine response I r","useful":0,"cool":0},"jnJdMwZW9O64T9JENNLsvQ":{"text":"The bartender was very welcoming & helped me pick a variety of options for HHR. I was hesi","useful":0,"cool":0},"6F865aqSuOY37fE-oG3Cdg":{"text":"I went in with my family today for the first time since my mom was visiting from out of to","useful":0,"cool":0},"4Tc8JAeqKqKKFWEmLnZ1iA":{"text":"The decor and atmosphere is nothing special but the wait staff is very attentive and helpf","useful":0,"cool":0},"L5J_zTrtMrx5RZRgs-JsRg":{"text":"The food was so good we had the octopus tostada the crawfish enchiladas the guacamole and ","useful":0,"cool":0},"a4w_9rnkxmgCHKvuGmTBqQ":{"text":"So first off, let me just state that their Mexican Street Corn is nothing short of amazing","useful":0,"cool":0},"RHsuFXbMMTr8AdkmLpbBBg":{"text":"Was staying at the Hyatt Regency and wanted a quick bite not at a fast food place and not ","useful":0,"cool":0},"0Fg9_efVWly1b0INsQqvrg":{"text":"Words of advice: order off of the taco menu.  I recently went for dinner with a big group.","useful":0,"cool":0},"eZK3fwY9rEuS3wEs-k2thQ":{"text":"So far impressed, margaritas are tasty, the quest fundido was cheesy and pepper perfection","useful":0,"cool":0},"08xTs1L8Yew1lzNJUtoksg":{"text":"I can not understand why John Besh has attached his name to this restaurant. I also can no","useful":0,"cool":0},"aJfA2GGi3eQ8LxbYaO_j1Q":{"text":"Suggested to us by a local because of the uniqueness of the Mexican Cajun creole offerings","useful":1,"cool":0},"I5PW5fhk1Ta_thielvixlw":{"text":"So good! I will be dreaming about the pork tacos and the delicious chips and salsa for day","useful":0,"cool":0},"CpFPpa8DgBHI7iagWW5-Eg":{"text":"Go for happy hour to be able to try a wide variety of tacos and dishes. It gets expensive ","useful":0,"cool":0},"MZpAV5-WqS9Ap9WV1tSnFw":{"text":"The space is small  with a unique, interesting decor.  I am a fan of Besh's restaurants an","useful":0,"cool":0},"sGEI0kFhEP6DIiRgfBKqzQ":{"text":"Okay, I'm a foodie and I am always looking for gems when I travel...so Mexican food in New","useful":3,"cool":1},"rXWQ7pPMIiQzztFTgzrK4w":{"text":"happy hour is the cat's pajamas carnita and lengua tacos are the jam!","useful":0,"cool":0},"XKnldDTqexZskycwziIRwQ":{"text":"Went for lunch & they had a full house. Food was delicious but runners were still working ","useful":0,"cool":0},"GnwIdEHkgkYLW-9aAdvTTg":{"text":"Everything here was really yummy! I'm glad I came in during happy hour! Their Johnny Sanch","useful":1,"cool":0},"yekDOKrKWsAsv8VX5Dk45g":{"text":"Had the shrimp tacos and the fried Brussels sprouts.    Skip the tacos and get the Brussel","useful":0,"cool":0},"zSkH3Unz54AId-vOcJq1HQ":{"text":"Great food, great atmosphere. Arron Sanchez was here visiting tables and giving suggestion","useful":0,"cool":0},"ehfqGxCMqxkoYnnqA6NQNw":{"text":"Amazing food! Cauliflower Tacos were the bomb! Chips & Salsa with plantains on top were de","useful":0,"cool":0},"VKTTN5BmKFqvhLW-Bl5nDA":{"text":"Great food and atmosphere.  Loved the guacamole and the shrimp tacos.  Cocktails were good","useful":0,"cool":0},"Jnnv2tqmn22DcNBHjBQxgA":{"text":"We had dinner on St Patrick's Day and it was packed...Service was still excellent and they","useful":0,"cool":0},"hsNiK49hNDtFdf8WV6o4wQ":{"text":"We had three different types of tacos, loved them all. \nIf you're a cheese lover, try the ","useful":3,"cool":1},"_QPMXolf93j0QOR8JDTyzA":{"text":"This is a 5 star restaurant and I almost didn't try it because it only got 3.5 on yelp.  A","useful":2,"cool":0},"rUT265H7l_bVuLtHYIjbng":{"text":"Well, it's been a month since I have tried Johnny Sanchez and since it's doesn't look like","useful":10,"cool":2},"sTdbDZ4jemgRHJ-HQIs2Fw":{"text":"Very good food! Excellent salsa...was disappointed they were out of steak for the fajitas ","useful":0,"cool":0},"blxt97e926HCy3w_vFSM4w":{"text":"Very expensive for Mexican, but completely worth it. Never had a dish I didn't like. The c","useful":0,"cool":0},"A-gWvcclGQ027X4mE6Y64g":{"text":"If you like greasy and small queso with chorizo then this is the place for you. I have nev","useful":2,"cool":0},"vm_tOKbR-bCRIxxx5Lj8Gg":{"text":"We were so disappointed... Maybe it was an off night. The menu is interesting and the deco","useful":0,"cool":0},"x9V9kUFO2YhzFdHRv36IuQ":{"text":"Pros: food was good! Drink specials \n\nCons: took a long time to order, expensive for what ","useful":0,"cool":0},"bkvz0qqoirYQ9a5bl5NDVg":{"text":"What an amazing meal.  We were 2, and we each picked 4 tacos, 6 different ones, and empana","useful":0,"cool":0},"wgTLP4hjmlbU_bRUjYaG6A":{"text":"This is the place for high quality Mexican cuisine! It is a trendy spot with a great atmos","useful":0,"cool":0},"XxylDnvo6rWCgpvwHiAsMQ":{"text":"Wonderful meal great service!  Nice place to dine.  Corn and plantain chips were a treat. ","useful":0,"cool":0},"ID-NzPGNgJGx14mVVSXhPA":{"text":"My boyfriend and I came here for dinner one night.\n\nWe had:\n1. The chips/plaintains with t","useful":0,"cool":0},"Niks6cN20GAczF4pPb--eQ":{"text":"Really disappointed in my experience here. First, we waited after our reservation time. Fi","useful":2,"cool":0},"Hu8m8rc5XOk74SboDxtubA":{"text":"John Besh and Aaron Sanchez hit this one out of the park. The ying and yang decor reflects","useful":0,"cool":0},"8MKIblde5rriF3jeHZtY1g":{"text":"The happy hour was great!! From 2pm-6pm. I had the street corn appetizer, we share guacamo","useful":0,"cool":0},"qewyoTXPAHS6ztpSUrs2tw":{"text":"Great service, but the food could be better.  It's almost impossible to find decent Mexica","useful":0,"cool":0},"QCsVilspu6TxuwZMUTabFQ":{"text":"Ok, at johnny sanchez we had the queso fundido to start. It was as expected,  cheesy with ","useful":0,"cool":0},"UDbwB5ayyeARpPDT8iJKMg":{"text":"Excellent meal last night.  The salsas here are fantastic, as well as the guacamole.  Had ","useful":0,"cool":0},"mg8rsGrJeTdyhu0QzvGVdg":{"text":"The service here is great. We ordered the meatballs to start and they are melt in your mou","useful":1,"cool":1},"rPobdM873h4x0D_3Ij4E4g":{"text":"I've only attended for happy hour, but let me say the happy hour is great!! I never enjoye","useful":0,"cool":0},"K3d_okCKIEUYUcMJiNaeUw":{"text":"We stumbled on this place for lunch. What a great stumble.... Food and service were excell","useful":0,"cool":0},"Ku8FQDCRiyxtypEBM1yuzA":{"text":"Flavorful refreshing drinks. Balanced tapas with fresh ingredients. Very nice eye drawing ","useful":0,"cool":0},"8f7M_BbKldwv18O0YmKPHA":{"text":"Cool space, creative drinks, and great food.  \n\nAfter some time googling ingredients in dr","useful":1,"cool":0},"H82qzJJl3UpWFaf6yWjy0A":{"text":"Fantastic. I was in New Orleans for a few days for a conference and a friend recommended w","useful":0,"cool":0},"d0MpjsenLXM5o9QNPbPCHA":{"text":"I was unable to fully enjoy the Johnny Sanchez experience because the service was so horri","useful":0,"cool":0},"S1r2zvNqFzkCcsXy8kNv_w":{"text":"I didn't take any photos of the food because I was excited about meeting Mr Sanchez. The f","useful":1,"cool":1},"ewaZujrmym8YX1lcYliTaw":{"text":"We went for happy hour and it was great. Half price drinks and $2 tacos. I tried all 4 tac","useful":0,"cool":0},"dQECExBvFE1B3dplJtvv1g":{"text":"Yeah too bad they didn't seat us with a group of 6 with a half open seated restaurant.  Th","useful":0,"cool":0},"N73phSOBYuiql7pXF4QBnA":{"text":"I was pretty happy with the taco choices but If I went back I'd definitely try some of the","useful":0,"cool":0},"Op4IyH1PIiu_d_COly7MRg":{"text":"This place came highly recommended, so my expectations were high up there.  It's super cut","useful":2,"cool":0},"ex81520MYCIK986P_g0-xg":{"text":"This is a beautiful restaurant!!  From what I understand, the chef and owner is Aaron Sanc","useful":0,"cool":0},"K2ItHYm6zaAmwi4XeWX7wQ":{"text":"Recently, we ate at This Restaurent. \nFood was excellent but expensive.\nDorian was our ser","useful":0,"cool":0},"Z4d5J6wE3CQQvAR8v0zwdg":{"text":"Update: we've eaten here a few times, it really is good but the food is waaaay overpriced.","useful":0,"cool":0},"VmL20flSCn7R2R4Pfg4_gA":{"text":"This is one of my new favorite spots. My boyfriend and I split the guacamole, soooo creamy","useful":0,"cool":0},"ZaRcIKbIfQLvD3olsI3DKg":{"text":"John Besh does it again and this time with a Mexican flair, along with Aaron Sanchez!  \n\nW","useful":0,"cool":2},"n7A5b55hNEVWa0a6No8K8A":{"text":"If you love food network as much as I do -- you HAVE to try Johnny Sanchez -- world renown","useful":1,"cool":1},"XM1TfTzsH6Lx0o2iTdlUFQ":{"text":"Cool deco and delicious food. \nLove the queso! \nMonday $2 tacos and half off drinks 2-6pm.","useful":0,"cool":0},"S9H0-3gpOGUO4zDDoFp3ew":{"text":"Excelente!!! Very glad to have found this restaurant our first day in NOLA!  The tacos we ","useful":1,"cool":0},"_zej0Et3TosV-kOLgRwSQQ":{"text":"Awesome Food !!!!!\nThe margaritas are a must\nGuacamole is a must taste so fresh \nAll I hav","useful":0,"cool":0},"RWDMsia3HnbIW82w1Iz5iQ":{"text":"Everything here is very good. So happy we came in here. Had a variety of food items and dr","useful":0,"cool":0},"tw14bmksRX5f6x8ysbzn-Q":{"text":"The happy hour tacos are an action-packed value indeed. The drinks also don't suck. My fav","useful":0,"cool":0},"wE3oUoQYRg21ISigZSrnhg":{"text":"Wow, delicious!\n\nCame in for lunch. Meal started out with chips & two types of salsa, both","useful":0,"cool":0},"i1ZyICe35HEwlKALYx18CQ":{"text":"Mexican was a great break from all the great Southern eats in NOLA.\n\nThey have a great hap","useful":0,"cool":0},"mATk8rRg7Jcjc7BWsqRy5A":{"text":"After having kind of a hit and miss and somewhat roller coaster emotional weekend, I found","useful":0,"cool":0},"0BbCk5fv90cH3rg5QbGpZQ":{"text":"Was quite disappointed, I've been wanting to come here for a bit and finally made it in to","useful":0,"cool":0},"tLT4jTWAwy1uIvoDxDmKZg":{"text":"If I could come here every day, I would.  Good quality food made right and executed beauti","useful":1,"cool":0},"W8TTMZXXvfItlcuoxgEOSQ":{"text":"I was super excited to try this place out! I am a food network fanatic, so when I was visi","useful":1,"cool":0},"oDloBKFKBhH192GPB-EtZQ":{"text":"We stopped in for a casual dinner. Ordered empanadas, carne aside steak tacos, and pescado","useful":0,"cool":0},"aDaCmRdrJJkyp7E3U5Lk1w":{"text":"One of the best Mexican hipster dinners I've ever had. My entire group loved our food. The","useful":0,"cool":1},"UyULPztTVehUnZ0dolpncA":{"text":"surprised in a \n\nUnremarkable building is a pleasant modern nice locale with what I think ","useful":0,"cool":0},"_qlXQmjiTp_bg7wNGYCvTw":{"text":"Mehhh, nice atmosphere, but not my cup of tea. The effort is appreciated, but I feel like ","useful":0,"cool":0},"CSigd7yroHEjjR3CXhwMIQ":{"text":"I really wanted to love Johnny Sanchez, but I wasn't blown away. \n\nThe chips and salsas we","useful":1,"cool":0},"hcfegWqKFS9EuNegfayDBA":{"text":"We are from California and are in New Orleans for the Saints game. We see Aaron Sanchez in","useful":0,"cool":0},"8U23yv8zqNKHxEVp4VdLcA":{"text":"So much greatness! I'm in town on vacation so I pulled up to the bar and was waited on by ","useful":1,"cool":3},"WdyJH5G_TMcIsnmcMc1bVg":{"text":"First of all I would like to say Aarón Sánchez is one of my favorite chefs. Growing up in ","useful":0,"cool":0},"BdCs_1x-L0ccvAoZnYbGUw":{"text":"This is my first time visiting New Orleans and I was excited to try Johnny Sanchez, even t","useful":0,"cool":0},"F5_apOUBAhp497QEsi6CQQ":{"text":"Great tacos! Very tasty!! Margaritas are bold with Mexican tequila flavor!! Salsa is amazi","useful":0,"cool":0},"44kINLFFUL_GNp27MT44uw":{"text":"I came to New Orleans for a conference. I was sooo lucky I found this place on my first ni","useful":0,"cool":0},"eR52n7NpVYcMyjMaoD_mRg":{"text":"Stopped in a couple weeks ago and was thoroughly impressed. The food was great as expected","useful":0,"cool":0},"dEWrBqjt2AWXqswMqVFSpg":{"text":"I've eaten here a few times for lunch and really enjoy this restaurant. I always order the","useful":0,"cool":0},"g8ebLlWZKR4m8GeVYk6H1g":{"text":"More like 2.5 stars. I'm rating the food since I use Ubereats. The food itself is decent, ","useful":0,"cool":0},"Tv1INsbe23hL6HaK4pdPAA":{"text":"Like other yelpers out there, we're huge John Besh fans and Chopped fanatics as well so he","useful":7,"cool":0},"yQlQPZlWxnJYyKjGcY5Prw":{"text":"BLUF:  Fancy mexican food.  Not bad.  \n\nThe atmosphere is a little on the business young p","useful":0,"cool":0},"1-bsbABwZqxBoXrw4KMVEQ":{"text":"Since there's not too many mexican places in New Orleans, we tried this place. Many of the","useful":0,"cool":0},"p6VJI2r5LGj7DMcUadZw-Q":{"text":"The best Mexican food I have had to date in my life.  The cauliflower taco was to die for.","useful":0,"cool":0},"BU4t_nhju4_OSYhXKvGI4g":{"text":"I'm here for $2 Taco Tuesday every Tuesday! Love the atmosphere. Most of the staff would g","useful":1,"cool":0},"_TqcgCwIH7IU4mzqQtLOWg":{"text":"Great wait staff. We had Gianna.  Lots of flavor. They know how to cook here. SOOO FULL","useful":0,"cool":1},"yjqFVOQamIkVNN7_Igub4g":{"text":"This is not your typical Americanized food from south of the border. Be ready to explore n","useful":0,"cool":1},"jdLGiRqiabDkbxPGXVh7KQ":{"text":"Friend recommended Happy Hour and 1/2 price Margs and $2 tacos LOL I'm like really I'm fro","useful":0,"cool":0},"2YhVWvC6L_YPncIirSDTKw":{"text":"So good had to visit twice during our trip. Go during Taco Tuesday or Happy Hour for $2 ta","useful":0,"cool":0},"fL0XUe4_m8Xe8qfYDRLtjQ":{"text":"This was my first time dinning out in NOLA, I was with a group of friends, we only ordered","useful":1,"cool":0},"HhGvi-79CyqkpA9qU6dEkA":{"text":"Food, service, music. All on point. One of our go-tos when in NOLA. Something for everyone","useful":0,"cool":1},"q2DQtFN3ngDSwy5_ObX35A":{"text":"Great food and ambience! Have to try the Mexican chocolate dessert","useful":0,"cool":0},"3BtqA7n5Mp0-yHOzUjKJRQ":{"text":"I'm a fan of Chopped and, therefore, Chef Aaron Sanchez, so I have been eager to eat here ","useful":0,"cool":0},"JrRjMN4P1heYYPDsn6SuFQ":{"text":"Loved this place!! Beautiful modern decor with a Mexican flair. Tried several items from t","useful":1,"cool":1},"KCz8ioj8uzLfLfz6FP8Oaw":{"text":"Wanted to check this place out for a while.  And finally did today because the fried chick","useful":0,"cool":0},"J4m-_YCOOXsAHGrNZVtSsQ":{"text":"Went for my birthday dinner with a group of friends and this was the perfect vibe. Really ","useful":0,"cool":0},"1P-PSSl05hNesJiNYndBnA":{"text":"Where is the Johnny in the Sanchez?  I went here expecting mexican southern fusion and all","useful":0,"cool":0},"n4YXTSz3o8EAtSqUAjuLVg":{"text":"I had lunch yesterday and it was amazing. I had the swordfish and was worried too much for","useful":0,"cool":0},"YRQpsXjueOcs8elhmfOlWw":{"text":"Get the arroz con pollo! Best Ive ever had. Two of the best chefs in the country, and you ","useful":0,"cool":0},"SyfMYB28la7tvyeEUJWdew":{"text":"Two stars for the amazing salsa that is made daily from scratch and deserves 4 stars. Nega","useful":0,"cool":0},"PUasOYKgXb3XvkYDx6VKdw":{"text":"Everything we got was delicious! We got guacamole, pescada tacos, carne asada tacos, the p","useful":0,"cool":1},"b-1jFQCPAPMC_dpWRJm3WQ":{"text":"So glad we took a break from Cajun and Creole to have dinner here. Looooved the food. Sope","useful":1,"cool":1},"vEjI2PTj5ZMgAmvthyquBA":{"text":"This was our second time here and we chose to eat at the bar because there's was a wait fo","useful":0,"cool":0},"aSr5mkjqNZgKLVlmpMO10Q":{"text":"Not impressed!! Best thing  we had was the guac, it was very good. chips were of good qual","useful":1,"cool":0},"lxfVxLUtIWMYbkBAXEOrTQ":{"text":"loved the salsa and preferred the Verde to the red one. had the gulf fish ceviche and the ","useful":1,"cool":0},"cSvzeG0ucGyOAvmOqRxdeA":{"text":"I'm alllll in! Me and my friend met around 5ish in a weekday to check out this cool spot t","useful":0,"cool":0},"DvhyRre6jvTt9D0fHXdNeg":{"text":"Excellent flavors! A bit pricey and small portions but still great food. Have the queso--i","useful":0,"cool":0},"bnIGOLOnXLG6Agubboei4g":{"text":"Great meal, very flavorful. Prices a bit in the high side for portion. Have visited a few ","useful":0,"cool":0},"T0bqRRZiWQGB54NB84fDVg":{"text":"Cool ambiance. Sat at the bar and dined alone. Good house margarita and fish taco, but gre","useful":0,"cool":0},"A5bMnpIm5pNGt3WnkZOiWQ":{"text":"I visited for the first time last week with a few friends and overall it was a good experi","useful":1,"cool":0},"AhDfPVrOnapYYtdUIqAVZg":{"text":"Wonderful ambiance and decor, Johnny Sanchez is a great twist on good Mexican food.  Chips","useful":0,"cool":0},"1nTEnQ_M0NDLCupAeZzyvg":{"text":"Visited early on Saturday evening.  From outside we could see tons of open tables, but yet","useful":3,"cool":0},"BDGm9sJ0Wncio_zsxXd7rQ":{"text":"I went in with my family today for the first time since my mom was visiting from out of to","useful":0,"cool":0},"Ugm2RxNVeDbxd55BhAGbmg":{"text":"I was skeptical at first after reading some of the reviews but the food was deeelish! I or","useful":0,"cool":0},"6evBKnAkzW0Y_sclIZLIig":{"text":"I love this place so much. Who would think a cauliflower taco would be awesome... but it i","useful":0,"cool":0},"zJ0u4iWh-5AHhb7pxGfdwg":{"text":"GREAT meal and wonderful service. they were packed and didnt miss a beat.  Yellow tail Tos","useful":0,"cool":0},"Q7ZMLhE-J8Xuox-e0nvrBg":{"text":"We found this restaurant and we are so happy! It was great! The food is fresh and tasty! G","useful":1,"cool":0},"lolNDZxOrjQp5ZAvQK4Uyg":{"text":"Food was great. Ambiance was very fun!! The wall art and lighting are vibrant. \nI was hesi","useful":1,"cool":0},"_1flo9XKc-vq6ihYg6CElA":{"text":"This is an amazing way to get off busy Bourbon Street for a to die for meal. Only a few bl","useful":1,"cool":0},"2kdfJuAEUPdb9GEZW3c1Zg":{"text":"I had the pleasure of experiencing happy hour a Johnny Sanchez. I must say I had the most ","useful":1,"cool":1},"c1QSfx3MGlmQY2q8duQLlQ":{"text":"Great menu--some interesting dishes. I had the Lengua tacos--definitely recommended. Porti","useful":0,"cool":0},"-JAXumb6k9fz2LR7EvrstQ":{"text":"This restaurant is what I expected and more. The food, drinks, service, and atmosphere was","useful":1,"cool":1},"wvs2uZWCcsU2dR17Sp15tw":{"text":"I was finally able to give this place a try after hearing so many great things about it. T","useful":1,"cool":0},"VXkkwtXEV1M-R98F933gzw":{"text":"I cannot say enough about this restaurant!! The food was amazing, the service was fantasti","useful":0,"cool":0},"s8_ib1IGPZ2Hodae8HiHgw":{"text":"I've dined at Johnny Sanchez twice now and had great experiences! It's not traditional Mex","useful":1,"cool":0},"LQZmyjQ09HFJtN4ifmLdcw":{"text":"Went this evening with a very large party to celebrate my son's graduation from Tulane. I ","useful":3,"cool":0},"YD6YHqszkziBUJ6tLqVSag":{"text":"Great Carne asada & Pescado tacos! The empanadas with the dip where incredible, & great gu","useful":0,"cool":0},"T9ymE1TigPFGVYN6B00tyA":{"text":"I don't get it. Overpriced, tiny portions, nothing out of the ordinary. Hipster/Hollywood ","useful":0,"cool":0},"S8MmGpeLBR4A2aG_wZ4Mnw":{"text":"Very very solid Mexican restaurant. The ambiance is very pleasing and just all around pret","useful":0,"cool":0},"vjcMmUNhO_63itm6Ogpycg":{"text":"Very good mexican option on Poydras. I had the elote and the guac, and it came with a big ","useful":0,"cool":0},"lrAXD-1nXpVLR5C-sSz4Mw":{"text":"Such a great restaurant. I mean, with John Besh and Aaron Sanchez as the owners, how could","useful":0,"cool":0},"v-pBCBuG_j_c-mhc3XkSMw":{"text":"Very cool place! The atmosphere was very trendy. The food was very good but the plates wer","useful":0,"cool":0},"4PzJoSgkOmAIWjH4_FH_Og":{"text":"To label this place simply as Mexican food really doesn't do justice to the quality and ta","useful":2,"cool":1},"yCFH7x7epp63a2Mrat5BJQ":{"text":"Some damn good tacos! Late night menu and happy hour which was a nice. Service was a tad s","useful":0,"cool":0},"_GAfvoWegjSTP4sT163u-Q":{"text":"service was pretty terrible, food was decently good but somewhat pricy for the type of foo","useful":0,"cool":1},"zuJ84pUmBSpXl3b18o8RyA":{"text":"Beautiful decor ! \nAgua fresca was lemonade with hibiscus, was OK, no so fresh. \nPlatanin ","useful":1,"cool":1},"11cCJuVHSffkj1cYEFeObA":{"text":"Everything from the black bean dip served when you're seated to the last bite of our meal ","useful":0,"cool":0},"ScyXCbkCKmqWfXYR2YrmXA":{"text":"3.5 stars.\n\nif you wanna get a table on the weekend, i would highly suggest making reserva","useful":1,"cool":0},"nM55jGhYSverm6yH5xSGuA":{"text":"This was our first visit to Johnny Sanchez and we were not disappointed. We happened to ar","useful":2,"cool":0},"xiGzpEPsl0FIHBHxi8cB0Q":{"text":"So far this is my favorite Mexican place in New Orleans! The prices are awesome, staff is ","useful":0,"cool":0},"GWiukDn9Fojeq4m17FzZpw":{"text":"We were warned that service in N.O. was slow and lax, but that hadn't been our experience ","useful":0,"cool":0},"0BWAOr0Dyv0TD6XC6C_Ipg":{"text":"Had to go back to back days after eating their tacos for cheap(2 bucks per taco) on their ","useful":0,"cool":0},"ZHG6ZZr3DLrHQ-571-lbHA":{"text":"Not fancy, and only ate here once but it was actually surprisingly good. The crawfish ench","useful":0,"cool":0},"UlLBIi6BB-DhpZ0K46KvBA":{"text":"If you want to eat at  great and ambitious  Mexican restaurant  in New Orleans, this is yo","useful":2,"cool":1},"3bL-cgdiY-LK_sc6qBw1Lw":{"text":"The atmosphere was great and the service was fantastic. Even better was the food, drinks a","useful":0,"cool":0},"i3fKTeahBgtmJWhThJK3Rg":{"text":"Had a couple of drinks and empanadas during happy hour!  All were very good and will retur","useful":0,"cool":0},"Eu3T9tZaAK8OCUqUQ44RlQ":{"text":"Johnny Sanchez is a modern, upscale Mexican restaurant worth trying.  They start you out w","useful":0,"cool":0},"vfHq1p4WH5mfhWIpbvHKBg":{"text":"Quality from the front of the house to the food to the waitstaff. Our waitress was kind an","useful":0,"cool":0},"q00Eso7qY2ucBR7mfCvlVQ":{"text":"This place was seriously SO AMAZING!! Visiting from California and we stumbled upon this p","useful":0,"cool":0},"IyvfZH2M9bZ4CNouI3iJ4g":{"text":"We went during the lull in between lunch and dinner and sat at the bar.  Great ambiance, n","useful":0,"cool":0},"M-wVF3fA4Cd_OcGLGjXVtA":{"text":"The good is pretty good, but a little over-priced for Mexican food. Not a bad spot, but de","useful":0,"cool":0},"fpIMaBxwa0_3WfavIGfuvw":{"text":"The atmosphere is great in this place, love the art on their wall. I would give this place","useful":0,"cool":0},"dXf4irTZ-6m7IG6SYJDMaw":{"text":"This place is more like 3.5 stars. I've been to Johnny Sanchez a few times and it's a good","useful":0,"cool":0},"vgaQLG_hpYB-RU6D25bgJg":{"text":"Mannnnnn listen.... when I tell u that this place is FIRE  I'm talking about.... drinks, a","useful":4,"cool":2},"TygJmvv_l09cJFLNR5GwyQ":{"text":"Excellent drinks, great service, relaxed vibe. My go-to for authentic Mexican cuisine.","useful":0,"cool":0},"Tv5a4qQv8__RWej3jFZY8Q":{"text":"I was apart of a party of 4 who attended Johnny Sanchez for a work lunch. This was our sec","useful":1,"cool":0},"1pzrt6UOePG3OzMXV6Imuw":{"text":"Great place to go before a show at the Saenger or Joy. The hostess and servers were on top","useful":0,"cool":0},"jmkUz_DmoFGwB9w7oc_yhw":{"text":"Amazing Margs, service and food! Walked in without reservations and they accommodated us w","useful":0,"cool":0},"TjKyxREfGzC0N68qTWSByQ":{"text":"Sooo authentic!! Delicious and you will be wowed by the atmosphere too! Be sure and notice","useful":0,"cool":0},"cYP5DEFVqkT67_m6ItjYHQ":{"text":"Great business district restaurant, you'll find better restaurants if you wander away from","useful":0,"cool":0},"07CXyUrWT3WE0AifV5wnFQ":{"text":"Nice Mexican fusion joint. Had a mojito, empanadas and 2 cabrito tacos. The chimichurri sa","useful":1,"cool":0},"oD1dMlkug0xHJclx1ob2KA":{"text":"On our visit to NOLA we wanted to experience an Aaron Sanchez restaurant. Brunch was amazi","useful":0,"cool":0},"9eOnhtn_Q78ZQoH-NPMLew":{"text":"So couldn't wait to celebrate my birthday here tonight. First, we called and no dress code","useful":0,"cool":0},"EZBT2S7hPCtQdzrTRj0qHw":{"text":"Great contemporary atmosphere with a mix of Hispanic flavor. It's Mexian with a twist icon","useful":0,"cool":0},"DCWLj7xAbvS7Qh6boKHIYw":{"text":"Had dinner here tonight with 2 friends, overall everyone was very happy and agreed we need","useful":0,"cool":0},"BpfITskyRiCgsZLsja3j_A":{"text":"Place was pretty empty when we arrived and almost left but we were just lucky as it filled","useful":0,"cool":0},"fs1RJE8e1xcfQgwLDQ2csg":{"text":"Foods delicious and the staff is hospitable.  I love the colorful decor and the music.","useful":0,"cool":0},"D08jsNycP2yWCmEOqL8BSg":{"text":"I am happy to report that I had a fantastic experience at Johnny Sanchez. I don't know if ","useful":4,"cool":4},"O0dJQC8D_HYtkE8DSitB0A":{"text":"The tacos are amazing!! Ended up here because I was starving and this was the closest plac","useful":1,"cool":0},"jbTHcbwBmUW6-UjdodbRCw":{"text":"Good location , not as busy for lunch as I expected . They had small portions and not a lo","useful":0,"cool":0},"IKIo2hoGYdoTdXLZT3o5Qw":{"text":"Johnny Sanchez is wonderful.  We were drawn here because of our appreciation of Aaron Sanc","useful":0,"cool":0},"xcjvXixzw-yHUUBQYfXnwg":{"text":"This restaurant sucked. SUCH a let down. The service was absolutely awful. It took 45 MINU","useful":0,"cool":0},"Ouoxrgun6psoCLfeixKmIg":{"text":"The layout and the seating was awkward. The limited menu was unappetizing and the drinks w","useful":0,"cool":0},"7iJqfy6S-9SAJuqfli7m_Q":{"text":"Wow, Happy Hour 2-6 pm M-F what can I say. Half price  select beer and margaritas, and $2 ","useful":0,"cool":0},"BodotBfLjc5HutoqEXqsHQ":{"text":"Wood fire shrimp salad was exceptional. Light crisp fresh flavors and abundant shrimp!","useful":1,"cool":0},"WWOCZVWKMfXJZriMNJQ2Qw":{"text":"Great Mexican food! Aaron Sanchez does not play around! The food and service has always be","useful":0,"cool":0},"whzHcOCe8Y0or-ZZEIj-ew":{"text":"One of my favorite places to eat downtown! I have never had a bad meal there. The oyster t","useful":0,"cool":0},"OJCUtGTKN49axwX8zh35kw":{"text":"Went to Johnny Sanchez on Christmas Eve and had a very nice, untraditional dinner. The foo","useful":0,"cool":0},"DSh3fOKh6o772UpTu-2NRg":{"text":"I'm a Food Network fan, but when push comes to shove they are either too expensive or not ","useful":3,"cool":0},"jD0e7x4DOee8Tk8fSoqt8w":{"text":"A great place to have some small dishes and people watch.  The atmosphere is an updated re","useful":0,"cool":0},"j0MFqV0yj45TvNTpbDf5Qw":{"text":"First time in New Orleans.  Googled best happy hours in NOLA and this was one of the recom","useful":1,"cool":0},"MLEpRVjyLNoAy2UYPOWMWQ":{"text":"It was a Tulane graduation celebration dinner and it could not have been better!  Starting","useful":0,"cool":0},"eUML7-OX0P-r8sJN3hYBWA":{"text":"Food was good, however that salsa was not spicy in the slightest. I asked if they had anyt","useful":0,"cool":0},"MpJJGIHf9mZ4OgHvHvzX6A":{"text":"I have been wanting to try this place especially since I idolize Besh and Sanchez. The vib","useful":0,"cool":0},"og9bhrEUpcDO4kKyM3wroQ":{"text":"The food was great even though everything is a little spicy. We had a party of 12 which is","useful":0,"cool":0},"sPh5QA5W7P5DhTYfe76SXw":{"text":"Great service from Sassana.  Wonderful food, equally as wonderful margaritas.  Had a lovel","useful":0,"cool":0},"87Lf8ok1oM_XoVk0uyK0Eg":{"text":"I'm taking the time to write this review in hope that they consider some changes.  I'm giv","useful":0,"cool":0},"CD4f1yqNccMJktkJzx9Vdg":{"text":"Great little place. The food is beautifully presented and tastes as magical as it looks. T","useful":0,"cool":0},"4aEipAz1ZEfnEV8-DrfZEw":{"text":"My husband and I just randomly went in because we were so lazy to find restaurants, but th","useful":1,"cool":0},"OBXiG2hQGJ97M9Gn9v6X0A":{"text":"I went on the Friday right after it opened with two girlfriends. The atmosphere was okay b","useful":4,"cool":0},"z3COMm7OchUgM9eybwi5fw":{"text":"I'm giving them a Star for decor off the bat. I'll say starting off that this is New Orlea","useful":4,"cool":4},"1opSSmyaDqzHoZD4g3WPPQ":{"text":"Well Well, I love to be surprised.  Aaron Sanchez seems like a lovely man and his food tur","useful":0,"cool":0},"TLHpo7hkdpcHUabO41ldhQ":{"text":"The food was good .. The staff wee attentive and friendly ... We ordered margaritas and wo","useful":0,"cool":0},"_xo7EGE8rrYjeXT6D14Glw":{"text":"Fantastic food...this place definitely is not \"Chopped.\" The pork belly taco, do yourself ","useful":0,"cool":0},"YCVcNDtgsGhs5Mw04xxldg":{"text":"The food is the reason to come here. The staff did not seem all that friendly. They were e","useful":0,"cool":0},"nL_3rIAEn9WtZFqZ__xGbg":{"text":"After dining at Domenica (another John Besh restaurant) and enjoying everything there, I w","useful":3,"cool":1},"c2PLoh4bSicDDyTaqcFWpQ":{"text":"Pretty good dinner at Johnny Sanchez's. Got the cricket guacamole and it was so fresh and ","useful":0,"cool":0},"9Pz6fa7mIhgTSIqoPwcq9g":{"text":"Went with a large party and they accommodated us well. The plantain chips and salsa were a","useful":0,"cool":0},"TiT7TdUUpCZpFw0J1HjINw":{"text":"Yum!! My husband and daughter are so excited to be in New Orleans for the seafood.  But I'","useful":0,"cool":0},"9OV8eVXw9bnijbOGQkjLZQ":{"text":"Everything was fantastic! \n The service was great, the food was so Good \nSo different from","useful":0,"cool":0},"6x_n9_jcxvhYpr8dLE6D-Q":{"text":"Wonderful Mexican-influenced appetizers, salads, tacos and entrees.  Love the grilled shri","useful":0,"cool":0},"FZHDSJVrbr4pHLURA8RFLg":{"text":"Not thinking Mexican while in New Orleans?  Think again!  Especially for happy hour!  Mond","useful":3,"cool":3},"PnQNlVoZIsuhq8-1tVmyOw":{"text":"The food is good, but it just feels so corporate and cold. There is no warmth here. They l","useful":0,"cool":0},"vcXqeOYO33QTwXbCS7WDkQ":{"text":"All I can say is AMAZING!!!!!! The food was delish and meeting Aaron Sanchez was the cherr","useful":0,"cool":0},"xcQ6sN3E5jHekBbUEWVDUw":{"text":"I am removing Johnny Sanchez restaurant from my bookmarks. There should be warning on the ","useful":1,"cool":1},"r6Vhu48AqxQWM7tpZ4WpIw":{"text":"The food is presented very chic but as far as quality and taste, I feel like I could get b","useful":0,"cool":0},"R6ySbWIhifJtgAFswToSOQ":{"text":"I visited Johnny Sanchez restaurant while visiting New Orleans in May. The restaurant offe","useful":0,"cool":0},"-iLnVEi1J8tmywD40gGN-g":{"text":"Authentic Mexican food... Very unexpected delicious!! Will tell friends and definitely ret","useful":0,"cool":0},"aL8JLqj8aaTJnhZmv45h3w":{"text":"The best Mexican food in town! Beautiful presentation and tasty good quality food. Great c","useful":0,"cool":0},"EzKwkuS96tAr1-LZsNzCbw":{"text":"We were in town visiting and wanted traditional Mexican food so our concierge suggested Jo","useful":0,"cool":0},"Ctz4YCdf09Sl55_BxyMi-A":{"text":"Excellent! Best Pescado Taco I've ever had!\n\nI wanted to hit the ground running on my revi","useful":0,"cool":0},"1qzh8RV-66bUuAVGgK3biQ":{"text":"The decor is great.  I'm a huge fan of the mural and the eclectic lighting.  The margarita","useful":0,"cool":0},"0-v7hKRQ-xIDMPjMW3ttTA":{"text":"I'm sorry to say that I just was not that impressed with this place. The food wasn't bad b","useful":0,"cool":0},"dsZVz44urp6g4u0yZnDCOw":{"text":"The salsa and street corn were good. The tacos were kinda ehh but the server was very swee","useful":0,"cool":0},"tosEMgwVc-LjevW3FGXg4w":{"text":"Really enjoyed our lunch here yesterday. Loved the salsas/chips/plantains. Began with the ","useful":0,"cool":0},"IsWB998sOrkxbvdxtoss1A":{"text":"Great service. Great decor. Great prices. And.. Obviously GREAT food!  Besh did it right a","useful":1,"cool":0},"LkckR3RZ-OjHc5tPU5k1Kg":{"text":"I went to eat with a party of 6. When we got there, the restaurant was not full, but we we","useful":0,"cool":0},"8p53VcLkcEeKkMhQGFLPxA":{"text":"I wanted to like this more. I had the lamb enchiladas, the guacamole with the grasshoppers","useful":0,"cool":0},"M2zJK8TU-gsnD0umvKYLQg":{"text":"Finally checked out their happy hour. Beer was ice cold and service was excellent. Their h","useful":0,"cool":0},"CUGCF_8q5x3opU5IM9SPlA":{"text":"Johnny Sanchez is the newest branch of the family of Sanchez eateries and he has teamed up","useful":12,"cool":5},"uRQYa96y8te9Z3FJo5Ysmw":{"text":"Having lived in TX, we are always on the look-out for solid Mexican food.  What we had her","useful":1,"cool":0},"nwGWZGoDdEBNVUClgGeNpQ":{"text":"Came for dinner a couple nights ago. Everything was amazing. I tried a little bit of every","useful":0,"cool":0},"Jvwv7ASg19m7XyVRmwGelw":{"text":"Waitress was really nice, but everything else sucked.  We weren't a fan of either the red ","useful":0,"cool":0},"HasMWXiFmEJX3k8BQUOI8w":{"text":"I like this place, excellent service, the food is very well balanced.  The mole, the fish ","useful":0,"cool":0},"DTjGx1zNPBxTudgA_jZSog":{"text":"We arrived during happy hour and I enjoyed the Margarita, and my hubby had 7th street whea","useful":0,"cool":0},"Pqj4RKafc0U5QVXLu7NMQQ":{"text":"What a great meal. Beautiful restaurant - love the decor, the 'doors', mural, all creates ","useful":0,"cool":1},"AfPb48X4VIciHeRELdCMXQ":{"text":"Great Food and atmosphere. I've been several times for lunch and I always get the Brussels","useful":0,"cool":0},"Fk2EjcyMQePydoY4D-ZytQ":{"text":"Party of 6 for a Tuesday 8 pm dinner, the restaurant was slow with only a few tables with ","useful":1,"cool":0},"2h5bK6BZyuAB8OYjs6zNpQ":{"text":"This restaurant was fantastic and I'm a Mexican food guy. Great ambiance. I'm finally glad","useful":7,"cool":4},"gDX-SLN6qNgAwavpkF_oQQ":{"text":"When arrived at the establishment, I was super stoked. Aaron Sanchez is one of my favorite","useful":0,"cool":0},"zIiLgr-sJkLS5cGXL9Va6g":{"text":"Happy hour was exceptional. Between the wife and I we had all the tacos, the queso, and a ","useful":0,"cool":0},"PKtvqAmuN4k3Lk7foopmuw":{"text":"Having just moved from So. California, I have a high standard when it comes to great Mexic","useful":0,"cool":0},"QUpJudhjhjqYNC_ydUyynA":{"text":"The decor is gorgeous. The food was good. This is not traditional mexican or Tex mex. So i","useful":1,"cool":0},"l6eHcFYKTsa-LaAZAJ83VQ":{"text":"Excited to try this place but I was disappointed with the service. Our waitress was not at","useful":0,"cool":0},"RAulH72MKjpqbOtz4256hQ":{"text":"Food is great, service is non-existent.  Got here on a reservation at 9pm and still sittin","useful":0,"cool":0},"nUy-tyXDbhJ9EyRuCPJsPQ":{"text":"Love this place! I tried some tacos at the Johnny Sanchez in Baltimore's Horseshoe Casino ","useful":1,"cool":0},"x5AAq_Ap4_Om13JCgiOp7w":{"text":"Listen when I tell you this, I'm a happy camper. Called in a reservation and was seated wi","useful":2,"cool":1},"Yg4XRmnqOHpW_5fXugJv8g":{"text":"Everything is so good here. The drinks are spot on, staff was super nice and tacos are del","useful":0,"cool":0},"WUk6OQ8GiZFDXvm4Ez2-7g":{"text":"Lamb enchiladas are insane. Great mole. My friends raved about the califlower tacos and th","useful":1,"cool":0},"dW0zR3e-R0nONQh-nBjaKA":{"text":"The price is a bit expensive but the experience was nice! The scenery is beautiful and pea","useful":0,"cool":0},"gg0VcGqqwT2al5GcUzOrUw":{"text":"Do not waste your money in this place.  Very expensive for Mexican food.\nTwice I went for ","useful":2,"cool":1},"aP6klYst4e6Wm6PqafmYzA":{"text":"Server was extremely friendly and attentive. Our meal was exceptional with wonderful uniqu","useful":2,"cool":1},"cI2mtmRodj8Bv08fprMsJg":{"text":"One word - TERRIBLE.  Service was horrible, food wasn't very good, and everything was over","useful":0,"cool":0},"HxyA9NFldbvJ96o0z2Me0Q":{"text":"Editing this review: [changed to 4 stars- came her 2 nights in a row and they had problems","useful":0,"cool":0},"f6MzVZiIs3va-Gr7rFLmlA":{"text":"I came here with a group of approx 20 people. The food was decent, but service was nottttt","useful":0,"cool":0},"_dRTKgBdyvv6OFpzjE1PtA":{"text":"Nothing bad, nothing amazing. Servers are nice but don't order your entire order, the appe","useful":0,"cool":0},"iuiDAEfKMrV5qiqtK0fmqA":{"text":"Our family had a great dinner here! So sorry I live too far to return because I am already","useful":1,"cool":0},"9Xn9CXIZyDXGKNee6rlP2g":{"text":"Yup. Glad I came fo sure. What other Texan will come to Nola for Mexican food. Had the chi","useful":0,"cool":0},"2bp8Fq_DWipxd9ju8T11Nw":{"text":"We were excited to get the chance to eat here, and we were not disappointed.  We stopped i","useful":0,"cool":0},"6-mBSxcAZzfj5TG1K5nyhg":{"text":"Mexican food to the T.   Delish/ bomb.com. Everything in on the menu is sooo soooo delicio","useful":1,"cool":0},"OhVo7n8ITfaCaU5I5ucQvQ":{"text":"Loved this place, excellent atmosphere and great service!  Everything I've eaten here so f","useful":0,"cool":0},"2w-hEsJf322kN5uLl8ZIEA":{"text":"WOW!  Went 3 times in 30 days.....and we're not even from New Orleans.  The salsas are fan","useful":0,"cool":0},"NnQ_44ErioDOCaIR2OQvwA":{"text":"Not your typical Mex food... but not great food either.  I felt that most \"creativity\" wen","useful":0,"cool":0},"l-SZd3N94UxIZeLO7b9GXQ":{"text":"We visited NOLA for 3 days. We saw Aaron Sanchez having a drink @ the French Quarter.  We ","useful":0,"cool":1},"7bmaEeEZc_1sqpEcM4zkuw":{"text":"Chose this place on a whim...excellent choice! From the chips and salsa to the tacos...you","useful":0,"cool":0},"4TLBw05nEWmCLXamvogHNQ":{"text":"Great food, excellent service, and fun atmosphere. I really enjoyed my time here and will ","useful":0,"cool":0},"wYcJuzc14Ub3um7HSPyi0A":{"text":"This was the second time I ate at an Aaron Sanche restaurant and again I was disappointed.","useful":0,"cool":0},"DtqFzCWGlTghSh1MXD1vrA":{"text":"Well we didn't get to eat so 1 star.  Went for dinner Friday night.  I would guess that ab","useful":0,"cool":0},"VOh3qcdQvyiEAAc7EROHpw":{"text":"I can't begin to explain how amazing this restaurant is. We go inside and it's super cute.","useful":0,"cool":0},"jpMaNl0Gvi0IbFZSE1m6aQ":{"text":"Stopped in Friday night around 8:30, thought there was gonna be a wait but we were seated ","useful":1,"cool":1},"yb58DOn1ZS-0NXZxtqHOZw":{"text":"My friends and I are longtime Aaron Sanchez fans, so when we booked a trip to NOLA, we kne","useful":0,"cool":0},"KeC_mYoDc9UaTDUP9cKG1Q":{"text":"Such a great deal for happy hour! My sister and I were looking for a place to eat dinner b","useful":0,"cool":0},"ZLIcQ-eI_IEVJ2wMmhCCnA":{"text":"We stopped in for a few appetizers. The food was just OK (with the salsa, guacamole, and s","useful":2,"cool":1},"3e79G25wjov_WgKlc1FrXQ":{"text":"This restaurant experience was awful!  We had reservations for 2pm they sat us in the corn","useful":3,"cool":0},"q0aufBj1tugrIGjbkAHRsg":{"text":"Happy hour $2 tacos - can't go wrong. Also tried the cauliflower taco which was awesome! E","useful":0,"cool":0},"kSyV8qze_jcKpL6lmHS8xg":{"text":"Was walking towards the French Quarter & ran into this restaurant. Decided to have lunch h","useful":1,"cool":1},"yX3SOBBlhls4u4N6mMXEQA":{"text":"Was looking for somewhere to dine and Johnny S. caught our attention. It was bright friend","useful":0,"cool":0},"ZBO_gLM3gFf5ttNxG8dsGA":{"text":"I had my first meal in NOLA here, and it set the tone right. I had three tacos, two were f","useful":0,"cool":0},"Mw3D2nnDCyYy3gx6L3adnw":{"text":"Stopped in for a quick bite leading up to the RUSH concert in late May.  We arrived when t","useful":1,"cool":1},"2vtT8-gy_9T5BEIv8Ul1pA":{"text":"We really enjoyed this collaboration between John Besh and Aaron Sanchez. We popped in ear","useful":2,"cool":1},"d7AxjOUtFuvaTB-Nb8Vu_g":{"text":"Sorry but extremely disappointed with everything.  Some people at work were raving about t","useful":0,"cool":0},"KCeFBG4ivZbTOtkdsNbTug":{"text":"Just finished a late nite meal. The food was exceptional from the gloc to the pork belly t","useful":0,"cool":0},"4stQ6FiGtodRUgHY97_0ww":{"text":"Johnny Sanchez margarita was awesome - made with FRESH! lin=me juice - soon good. The Albo","useful":1,"cool":0},"gzIRP-BNt2hGx-u9v3tZjA":{"text":"Wow! is the first thing that comes to mind about this place. The Happy Hour from 2-5 is a ","useful":0,"cool":0},"U7yL9SptXvkGv2fAMr-alw":{"text":"Unfortunately, I was not blown away. I thought Chef Aaron Sanchez would be running a kitch","useful":0,"cool":0},"N2yOuYeXLNBDx6Oo1QlYWQ":{"text":"Carne Asada tacos were amazing, the mixed drinks are good , awesome chips and salsa. Guaca","useful":3,"cool":0},"pO4Oh38HCxfmj6oSN51etw":{"text":"While visiting New Orleans I was lucky enough to be able to experience dining at Johnny Sa","useful":0,"cool":0},"_CwCbcgzbsJ9W7Mv2CYHfA":{"text":"Went for Happy Hour one day and was totally impressed. You can NEVER beat $2 tacos. They w","useful":0,"cool":0},"z1ICp21HL-DzgJXkkd-lJg":{"text":"One of my favorite places in town! We went with a group of 8 ladies last night for our ann","useful":0,"cool":0},"zLnIG4eezV3KUDB8vYebrw":{"text":"Johnny Sanchez ruined me. My taco and chips/plantain salsa combo expectations are now way ","useful":0,"cool":0},"hek83u_wETLsJWOmT33lRQ":{"text":"Everything about this place was AWESOME!! \nWe had reservations and were seated right away.","useful":1,"cool":1},"v3T_wsLNKf6UtXB2BiX2mA":{"text":"Loved the tacos and empanadas!!    \n\nAlso ordered the queso funidido but I wish the cheese","useful":0,"cool":0},"3mpifgibxivQ-Casyifnlw":{"text":"The food was delicious. I especially recommend the empanadas, chicken flautas, and the des","useful":0,"cool":0},"eAr-rZMYAo1sUuXWz7SYug":{"text":"This was my second time coming to Johnny Sanchez and it is so much better than I remembere","useful":0,"cool":0},"O8JyxGKoS7yqiuIjcZCjJg":{"text":"We went for an impromptu date night tonight for happy hour. The margarita was great-not to","useful":0,"cool":0},"DtSolOZ6mWFmACWLfyCvSw":{"text":"We went in mid March 2017. \n\nWe were seated at our booth when I noticed that chef Sanchez ","useful":0,"cool":1},"ksGT8wqyJxeOErXnhIClVw":{"text":"I am determined to try every John Besh restaurant, and my friend who was visiting, thinks ","useful":3,"cool":0},"XcaZYeN1xfps2lZ57v3bUg":{"text":"This is a fantastic restaurant in New Orleans. We went for a light lunch and had the Louis","useful":0,"cool":0},"nK8f-YJL_OvzJwpr1K5dXQ":{"text":"Stale chips/ mediocre cocktails / forgettable entrees and glacially long waits to get the ","useful":0,"cool":0},"gJTgDCGwpaGXYvBxUDRIIQ":{"text":"Just 2 options and an average place for vegetarians","useful":0,"cool":0},"8fZ1UiZdqf8V4kQj1jHrgQ":{"text":"If you need some different flavors after getting gumbo'ed out in NOLA - this is your stop.","useful":0,"cool":0},"TBksLgTwQ8U_ZpW5qkHKFw":{"text":"The brussels sprouts were delicious!!! A very mellow happy hour! Those bartenders weren't ","useful":0,"cool":0},"hhKrbV49V25OoACLlUPWHQ":{"text":"Showed up around happy hour and enjoyed the Johnny Sanchez Margaritas for 1/2 price along ","useful":0,"cool":0},"3g_lP2YtNcKvjQkKQbYW5A":{"text":"This restaurant was really good. Went on a weeknight while in town for work. The restauran","useful":0,"cool":0},"sORb3MIsM0tBJ8Ejg5BKpQ":{"text":"This place was on point. Went for happy hour. Half price drinks and $2 tacos. The plantain","useful":0,"cool":0},"FzZWfkm1rTbQVy9Ter0T_g":{"text":"Love this place!!! Great vibe- family friendly. The brussel sprouts are fantastic!! The dr","useful":1,"cool":0},"XzIBFDWXuwyuwljj2wZNmA":{"text":"Food was really tasty, especially the trickier items like ceviche.  The more basic Mexican","useful":0,"cool":0},"PfoZRRPDj-L_YJFpv6FTyQ":{"text":"Service was fine. Great location and atmosphere . I thought it was a bit expensive and the","useful":0,"cool":1},"OpzjjWaTFroI3bAJgQWyIw":{"text":"Gorgeous restaurant with flavorful food, just a bit pricey in my opinion. The portions are","useful":0,"cool":0},"tHjUZXW6NJ9tHLZyade-YA":{"text":"Soooo good. Margarita was good, food was excellent! The server in the section next to us w","useful":2,"cool":0},"hnVrq5xbgH16ioIsKjc5sQ":{"text":"Food was just okay and overly priced. You are paying for atmosphere. For better, less expe","useful":0,"cool":0},"FjmaiOWTmhQunssjvGMgwA":{"text":"First time visit. Big Aaron Sanchez fan. Wall art depicting his tattoos.  Not creepy! :-) ","useful":1,"cool":0},"0mM-lIZbOYMkXCGYuFgF-w":{"text":"I am updating my previous review.  After a not so pleasant experience, the GM immediately ","useful":1,"cool":0},"47fccOwS3lE_LmipckKa0g":{"text":"I had the steak quesadillas.  They were unique and fantastic.  I also had the queso.  I lo","useful":1,"cool":1},"Ii7fbek3WxnLFAKMqQMUHg":{"text":"I've never felt so welcomed by a staff.  Thanks for serving awesome food with more than a ","useful":1,"cool":0},"nS0qGYkFfP7nzMlyhJL2BQ":{"text":"Stopped in here early evening for dinner. The place was a ghost town. Don't believe their ","useful":0,"cool":0},"5exvH66KyWYUS2NNOCJxcA":{"text":"Wow! Best food we had in NOLA! We had the flautas, cheese quesadilla and cesar salad!! ALL","useful":0,"cool":0},"WpG67LLmwe4TTGGhWK20SA":{"text":"Where I begin. Mexican food is not what you think of having when in NOLA (well at least I ","useful":0,"cool":0},"RoirkwDDet9FTkTasnHq6w":{"text":"Stopped in for a late snack and we were not disappointed. Good tacos and nice drinks. Nice","useful":0,"cool":0},"KF-q9PPcj8hSKpPzFWblSw":{"text":"Stopped in for lunch after reading the Yelp reviews and impressed with the decor and servi","useful":0,"cool":0},"InHai5ddebUq1bPpIuJ03Q":{"text":"This is a very popular lunchtime restaurant.  The atmosphere is bright and modern.  It fea","useful":0,"cool":0},"vV8It8-fQBisAU4B9EMZow":{"text":"Awesome, just plain awesome! \n\nWas in NOLA for business and this was my first stop (even b","useful":1,"cool":0},"8hPgZ267wAqovO508o-6OQ":{"text":"Perfect for top notch high quality casual dinning! The waitstaff was very attentive and th","useful":0,"cool":0},"_TESu7T92FDWF7msrLLr5g":{"text":"Wonderful! We were in the mood for Mexican and picked this based on other Yelp reviews. Th","useful":0,"cool":0},"SKYjlZLg2erGNDWw8kIf9g":{"text":"To our server Erik, FAIL.\n\nMy boyfriend and I were recently in New Orleans for Hogs for th","useful":1,"cool":0},"XsihIvmqNgHVX__tstZt4Q":{"text":"Just had Sunday lunch. Glad I tried it. Guacamole and fish tacos excellent. Would have lov","useful":0,"cool":0},"1SHiqDkhlMWEZcgpZFZazg":{"text":"Food was good but I ordered through uber eats and I got guacamole on the side and paid for","useful":0,"cool":0},"P40JtIQ67q5mVnGsE5bUQw":{"text":"Kelsey W. and I knew we were going to have dinner here before I even stepped on the plane ","useful":4,"cool":3},"vq27eWnHjcZuV5Kcnj_7WQ":{"text":"Visited 08/01/2016 for lunch on a visit to New Orleans. \n\nDisclosure: I'm a big chopped fa","useful":0,"cool":0},"DWZMI0Li9x6q0PZKKagvEA":{"text":"Rarely do I ever have a meal that I dislike. Unfortunately when my boyfriend and I came to","useful":0,"cool":0},"Bv5aIcrciqCT0DxH-kmuFA":{"text":"On the recommendation from my wife I went here and the fact its around the corner from my ","useful":3,"cool":1},"xbHQtQkKOsLf7_pjh_H84g":{"text":"Four stars for outstanding service, very good food & pretty cool ambiance.  Truth be told,","useful":0,"cool":0},"isx5hC6nszo22Dpb6hcSjg":{"text":"Excellent food! We had the taco sampler plates and they were great! Great service and atmo","useful":0,"cool":0},"j4A6tKXg5OukzpoK2ULXzw":{"text":"Awesome!!!!! Food is great! So is the atmosphere and the service! The burrito was awesome!","useful":0,"cool":0},"kfi2vTE5sk5sMm-Ybp0JjA":{"text":"I expected more. The establishment is beautiful. The chips and plantains were delicious al","useful":1,"cool":0},"NeGxLzPm8XFbkEk3RQGG9Q":{"text":"2 words: cauliflower taco.  Excellent food, great service and awesome vibe. We enjoyed it!","useful":0,"cool":0},"A7Z1DodRBKJIsRoXe_MSmg":{"text":"I dined at the new Johnny Sanchez last night, reservations at 7:30, full house as expected","useful":2,"cool":1},"NDqKnbJdKzezy95esA8p_A":{"text":"Not your typical \"Mexican\" joint! This is a place that you would only find in New Orleans.","useful":0,"cool":0},"H6k5E7VFrNUAdSI4qr0Cdg":{"text":"My fav spot for margaritas, manager Rob is the best!!!","useful":0,"cool":0},"qJfCb5bEyE_nJFsjVKSOjA":{"text":"This place is amazing. The staff is great, the food is outrageously good. I recommend the ","useful":0,"cool":0},"Rut-6eQzaR63924HQx2_Jw":{"text":"Very nice restaurant, right across the street from the hotel we were staying at. The salsa","useful":1,"cool":0},"qu4v5E1qjaJQNBfOVu8M5g":{"text":"Overall an ok place with nothing really to rave about or come back for. Especially for a r","useful":2,"cool":0},"5ThObFJqg2HNGc6-EOELqg":{"text":"Really enjoyed the fresh guacamole and chips. The crunchy plantains was good. The shrimp b","useful":1,"cool":1},"GOHEnPugqiz069zP4m1Oew":{"text":"Terrific service and fun ambiance, but the food was a bit disappointing, as were the price","useful":0,"cool":1},"4CdasAwSKGhz5ZTQz55lcg":{"text":"Great Sunday brunch!  Excellent cocktails, great food.  The Chilaquiles made me feel like ","useful":0,"cool":0},"1rr4hywtCKpKAN973affQQ":{"text":"We stopped by after the Bayou Classic. \nThe salsa was very flavorful and served with chips","useful":0,"cool":0},"iRs-1ppuwpQgc07GbkSj_w":{"text":"Whatever happened to seasoning? How do you make bland arroz con pollo? We couldn't even fi","useful":0,"cool":0},"PhyvHNatVxvcLGzStCcP7w":{"text":"Not your typical \"Mexican\" joint! This is a place that you would only find in New Orleans.","useful":5,"cool":0},"LCwfnOKQMcGYi9Mx6bbmEg":{"text":"So much fun and so many great choices. Loved the variety of small plates and the street co","useful":0,"cool":0},"BUvmUYTsTeKqTzSRcKhZUQ":{"text":"Outstanding!\n\nFood, Drinks and Dessert are all excellent. Must try home made ice cream.","useful":0,"cool":0},"INTlSp1sY5cWfEkHP5qORQ":{"text":"A friend recommended we visit Aarón Sanchez's Johnny Sanchez, which he co-owns with the Ne","useful":0,"cool":0},"1mCkQzgiJ2jiEBn4vs03oA":{"text":"First impression \nNice staff \nGood Don Julio Margie\nTasty salsa - not Southern Calif spicy","useful":0,"cool":0},"2szNm3yfh6rUEkoM6XzvhA":{"text":"Good, but not as great as it could be with a bit more effort.\n\nWent for lunch, seated at b","useful":1,"cool":0},"UP-dcDLGLVV1EaTInbzXoQ":{"text":"As some of you may know, I am loathe to write a review after just one visit to an establis","useful":0,"cool":0},"QLMusyBx-2U-pJ8GJPpkxg":{"text":"A group of friends and I came here for a little friend's Christmas dinner. I ordered the a","useful":1,"cool":1},"iuy1IRipk-q8Zye5mmafvw":{"text":"Not bad, Aaron Sanchez, not bad. I was in NoLa for a produce trade show and my boss and I ","useful":2,"cool":1},"qa2VSjA7O-DNmp0ZCjMMFQ":{"text":"Expected more knowing Johnny Sanchez was a Besh restaurant.  Trendy yet casual.  Fried pla","useful":1,"cool":1},"LQGS36T6WmzQxE8aMf0vRQ":{"text":"For this place, I give the food 3 stars and the service 5. Hence, the 4-star rating. I wen","useful":0,"cool":0},"DsS6cITzBqzgD_G94F7Ang":{"text":"I've been here a dozen or so times and the food and drinks have been amazing. However, thi","useful":3,"cool":0},"rdSvooYVyQ2q0IKvUKYMyg":{"text":"Food quality and taste a 5... Service a 1.... I chose this place over many other and was s","useful":0,"cool":0},"Q4v9T89WiZjnfBizrIES-A":{"text":"I'm from Mexico and I can tell you guys: this place is authentic Mexican. Not only that bu","useful":0,"cool":0},"OsYzq7sUy4wfzTucS4Y1zg":{"text":"Our first visit and looking forward to our next visit! The atmosphere and neighborhood is ","useful":0,"cool":0},"XhDTsBigDpq96I9g0fLLCQ":{"text":"We tried to get reservations for a couple of evenings that we were in New Orleans but they","useful":0,"cool":0},"RjYtd1YgTaR6u2Lt8Ifi1w":{"text":"Quest fundido, Brussel sprouts, Carne asada and cauliflower taco were out of this world. T","useful":0,"cool":0},"vzqpSDt8kDpLSbM4xrP7Lw":{"text":"Food 4 out of 5. Service 0 out of 5. Every staff member walked out of kitchen eating. When","useful":0,"cool":0},"3-naMNQKMUpWS3spVEhFpg":{"text":"Amazing food and service! The cauliflower and carne tacos were delicious and the service w","useful":0,"cool":0},"UNb1lDznicIhx5y88JDlBw":{"text":"Been there a couple times now, a year apart. Not recommended. I think this restaurant is c","useful":0,"cool":0},"I8tC1wszp4uWOz7-WXIZAw":{"text":"This place was near my hotel and had a bar and good vibe so I tried it. I was starving and","useful":0,"cool":0},"qd8D0VDCvXHqqBIbgJaGtw":{"text":"Food good and fresh, if very spicy. Service could've been much more attentive -- and it wa","useful":0,"cool":0},"JntZHHWAZoJI1Ga-NpRqhg":{"text":"It's not your grandmas cooking but the grandma taco was awesome! Small but good.\nPlantain ","useful":0,"cool":0},"hzJfg5ZahWNbzRzOYROpnA":{"text":"Went here for lunch today really enjoyed it. very nice people excellent food very comforta","useful":0,"cool":0},"oFASSQTmpR4gQId1tZJSbQ":{"text":"Great guacamole and it was customized perfectly. The tacos were amazing and really I'm gla","useful":0,"cool":0},"C0fI2E51zAuxTE-m51ZSLg":{"text":"I was so underwhelmed by Johnny Sanchez that I didn't even whip out my iPhone to take a pi","useful":3,"cool":1},"JPcpYn-K5NimqtaEXPy6LA":{"text":"Getting off from work on a Wednesday I was supposed to be heading home to workout and bing","useful":0,"cool":1},"Grth5q3-5fMLPC-DCeQZGg":{"text":"Always top of the line food and service. The menu is simple and good. Queso funditio is a ","useful":0,"cool":0},"Vvy0RNaoE2dgv7BHxhg9ow":{"text":"Chef Aaron Sanchez restaurant did not disappoint. \nAmazing Mexican dishes. Lots of flavors","useful":0,"cool":0},"WeMBjriuD7dippVEkfqZnA":{"text":"Despite not being a big eater I was actually still hungry after eating at Maypops. So I wa","useful":2,"cool":1},"8mS-DflxE2eDR3tYjiuzDw":{"text":"I was excited to try this place while I was visiting New Orleans. I sat at the bar and ord","useful":0,"cool":0},"bOmZ_9x5_KD9JWASCFj4Cw":{"text":"Oh my was this phenomenal. Absolutely everything about it-- the drinks, the queso!!!, ever","useful":0,"cool":0},"T8STl9JIuhvG209QeaZWHA":{"text":"They don't have the plantain chips anymore which made me super sad.  They also make you pa","useful":0,"cool":0},"QtBd6l7Zhw8XBLsCCVE9DA":{"text":"Went here Jan 19 after around 2 pm. Service was not great and the restaurant was filthy. F","useful":0,"cool":0},"ch3ZC0fblVb6EeTzrUskPw":{"text":"Everything our party ate was delicious. My margarita was very strong and tasty. But the ma","useful":0,"cool":0},"sM9bk_u5KfRXGDbsiNxkMQ":{"text":"We arrived for our reservation probably about 30 minutes late. Restaurant was busy but not","useful":0,"cool":0},"a2HhLtakTRVvnhHhnAgwgw":{"text":"Omg everything was wonderful!! Food was delish! Wait staff wasn't impressive and we had to","useful":0,"cool":0},"H006PJJDCzZ3O5UwwvUDWA":{"text":"Heaven: Pork grillades with poached egg, Brussels sprouts, guacamole\n\nPurgatory: weird tun","useful":0,"cool":0},"mBK8IyH0JyMFjkOTIsUTXA":{"text":"The best thing I have ever ate in my life is their crawfish enchiladas! How do they get al","useful":0,"cool":0},"IcmotZpkj90mFvGgP66oKA":{"text":"Really didn't want to like it...not sure why but possibly because it's so far from my casa","useful":3,"cool":3},"EnwW9nAI-JWL3Idvns_AUg":{"text":"We come for the fantastic happy hour. $2 tacos, half-priced margaritas, beer and wine. Gre","useful":0,"cool":0},"H_xJ84YEEcR_OV7aOY74YA":{"text":"Johnny Sánchez is a Chef John Besh and Chef Aaron Sánchez venture for authentic Mexican fo","useful":1,"cool":1},"HnzVYEl7wuyGGkIDJWx-tA":{"text":"Every gooood Mexican food. Burrito is the bessst! Best! The duck entree's are not really g","useful":0,"cool":0},"EYxG9y7AWNkoX9_WXSC9vQ":{"text":"So I love Chef Aaron so I had to visit his restaurant while I was on a work trip to New Or","useful":0,"cool":0},"ijjESjjazCsBT3stYEp0wA":{"text":"I was expecting the food to be good and boy did it deliver. We had the queso dip for an ap","useful":0,"cool":0},"33aMosdoilMY_GErP8LnaQ":{"text":"Just want to give a shout out to Morgan AKA Thunder Highway for excellent service Wednesda","useful":0,"cool":0},"08jC9G9-oMSxeGlDtPtnhQ":{"text":"Food - 5 stars.   Service and process - 1 star.   We went here with a large group of 19 pe","useful":2,"cool":0},"W-Vh8wd-eBYuA4F9ZSZr4A":{"text":"Amazing Mexican food in New Orleans!! The atmosphere, service and food were all great. Nor","useful":2,"cool":2},"k4cAl3Jca7M0AAkrEbGe4g":{"text":"Went there on Taco Tuesday and tried all of the $2 tacos. The $2 selections were all decen","useful":0,"cool":0},"BJhpXpjwWetZGw6sWbBr7w":{"text":"The service was terrible. Came into town from California and met with some friends for the","useful":0,"cool":0},"UruYfDMD70KOdPNAwMFJrw":{"text":"We traveled to New Orleans without knowing about this amazing restaurant.  Thankfully we h","useful":0,"cool":0},"zhO0wt-g0NzClepAQMRvFA":{"text":"Wow! What a wonderful experience. I went here strictly because it was chef Sanchez's resta","useful":0,"cool":0},"CT5yQJM5rFUCV-YrNhqYwA":{"text":"Really wanted to love this place as I'm a huge fan of Aaron Sanchez.  The food was really ","useful":0,"cool":0},"DkX-dTBLoJ9TDuTU3YjXCg":{"text":"great food ,great atmosphere the staff made great recommendations!! dont miss the albondig","useful":0,"cool":0},"yZGlbo0xnviXCgpSjkb3Uw":{"text":"Delicious, authentic Mexican food. Attentive and knowledgeable staff. The burritos are hug","useful":0,"cool":0},"nfS1gJZ1UD3Z-yiQSXuC0w":{"text":"I have been here many times and had awesome experiences. This time, however, we had horrib","useful":0,"cool":0},"Nn3sE5Lf05G0f6WjY8JZ2Q":{"text":"This is a Gem in NO. We were looking for something  outside the normal cajun/creole/seafoo","useful":0,"cool":0},"7k4zWZLrc-C8Y97zMmGRaw":{"text":"I came away very unimpressed. Catfish tacos were bland. Asada tacos were OK. The concept o","useful":2,"cool":0},"eN-Vklt0eG-JCx_B7q483w":{"text":"Three ways to make a gluten free/dairy free gal happy during your happy hour. \n1. Offer gf","useful":5,"cool":3},"JcuNkTI9XNUKOwzCGAtLKg":{"text":"Not what I was expecting from Aaron Sanchez. Atmosphere was nice and upscale but the chair","useful":0,"cool":0},"yz_p2mVVLxKKD4iJYurVAw":{"text":"Meh.  My entire experience here was meh.  Mediocre ambiance, mediocre service, mediocre fo","useful":0,"cool":0},"_kwxEjNjybOgzEoh-tubFA":{"text":"Well, the flavors of everything were great, for the most part.  The problem was the amount","useful":2,"cool":0},"Yxj-C5vIHsA_B9P3IUxMrQ":{"text":"I love love LOVE taquerias so I hoped this little joint would have blown me away, but I re","useful":5,"cool":0},"MNAh8J4mLncajTjkn5wKKg":{"text":"This place is packed for lunch and dinner, so make reservations if you can.  The atmospher","useful":0,"cool":2},"-4EV-4V-4GNL-wGL4Yh7Dw":{"text":"I had a lot of excitement about giving this place a try, as an Aaron Sánchez fan. I should","useful":0,"cool":0},"Q79aVGMWzBqMez5sbe-izQ":{"text":"This restaurant was fantastic. Our server Brandi was top notch - friendly, fast and knowle","useful":0,"cool":0},"ZfeqcNcbFR_Mrw-tAMz0ew":{"text":"Eating in New Orleans can get pricey, and is sometimes hit or miss. Johnny Sanchez is an u","useful":0,"cool":0},"QuXnfKy51LR_PFVL0nVCIQ":{"text":"Great service. Near plenty of hotels. The tacos were great and our server, Norma, was fant","useful":2,"cool":2},"9tLqYUYPEIxAsrDIc2MMTA":{"text":"Terribly slow service!! Waited 20 minutes for my first drink. Food was just ok for the mos","useful":0,"cool":0},"PPz0A56TDdtgIsONRDnr-A":{"text":"Eh. It's not \"bad\" by any means, but it's also not very good. I went here when it first op","useful":5,"cool":1},"qhJpi3ws_FRP5J90TUbCpw":{"text":"Go to Juan's.\n\nService was bad, food was fine, margaritas were mediocre. Not worth the ene","useful":1,"cool":0},"Hk0KzvGl_J9vzYgx6oOlnQ":{"text":"Solid all around but the atmosphere is keeping it from a 5. Nice wait staff. Bar area is j","useful":0,"cool":0},"IpVk7R11GcPdr6smCDoHog":{"text":"Came here for a work lunch the other day and was super excited!\nI mean, John Besh - New Or","useful":2,"cool":0},"JTraj92UPfe7m0HFdlwE5g":{"text":"Great restaurant and great food. We had a last minute large party reservation and they wer","useful":0,"cool":0},"BkYVsd0GNiA8o98domvahQ":{"text":"I was a little underwhelmed. I mean, we are talking Aaron Sanchez of Masterchef fame!! Don","useful":2,"cool":0},"pfVRkDDBqGri3dYOaR70uA":{"text":"Well,  what can I say?  It did not own up to our expectations of what \"we\" would expect fr","useful":0,"cool":0},"6Fp7W8jGVhmDRB_CZw6JNw":{"text":"Went back twice during our 4 day trip. Guacamole is so good but is pricey but it fills the","useful":0,"cool":0},"1-ijwXW8b-nnckeiaALLSg":{"text":"Overall we enjoyed Johnny Sanchez. Our favorite thing was the chips and salsa. We also hap","useful":1,"cool":0},"MJ7PveOz0V1L1TWFL_4pvQ":{"text":"Throughly disgusted! Wouldn't return to this place if they paid me to!!! Decided to try th","useful":2,"cool":0},"rJR8mlwpfnrhCf3eK3JI6w":{"text":"I know they are pretty new. so i will try them again to see if  the food is any better aft","useful":1,"cool":0},"fi11ihOv7hSsCkUwi_weNw":{"text":"Awesome restaurant! Street corn - no words... Had the pleasure of meeting Aaron Sanchez an","useful":0,"cool":0},"Ajb55Oov1RX21RZ3thxGVg":{"text":"Had a wonderful dinner and fantastic service by Belen! Everything was presented in such a ","useful":1,"cool":0},"Gzl_ba5L_jJrreVmaOFapw":{"text":"This place was great and exceeded our​ expectations​. Walking in you see a beautiful Mexic","useful":0,"cool":0},"iSzNumaKILKzQ0kX6MG5OQ":{"text":"When visiting New Orleans you don't necessarily come for the Mexican food but man this was","useful":1,"cool":1},"KcLU5M5b8lcPR6FSC6qh1g":{"text":"The best carne asada taco I have ever had! The street corn is amazing and the tequila flig","useful":0,"cool":0},"RjrFATh93qBvf_IJcFHkdA":{"text":"Overpriced Tex Mex Bar food .. cool atmosphere and good service .. stay away from the craw","useful":1,"cool":0},"R8ZKAzqhPs_z3_uhdf9kRA":{"text":"Aaron Sanchez is one of my favorite chefs, so I had to go to his restaurant and give it a ","useful":0,"cool":0},"-dRCtq4nw3Kj_H230TGOFw":{"text":"We were in New Orleans for a week and wanted a fast , good and less expensive eating place","useful":0,"cool":0},"aKAIi0KjhLceunq7WebmCA":{"text":"Everything was awesome! Delibeth was our waitress awesome! . I had a carnitas  and deep fr","useful":0,"cool":0},"Irxad1ho6Sj28RFTdarFNA":{"text":"Bad service. Waiter forgot to put in our order. Food was just ok. I recommend going to the","useful":1,"cool":0},"RY2Ws-zWU5IQuAj6nPd0pA":{"text":"I was really looking forward to eating here. I ordered the brussel sprouts and the chicken","useful":1,"cool":0},"rp137aEcB5FBn-m_2AkRDw":{"text":"We were visiting Nola and had zeroed down this place for Christmas Eve dinner. Reached the","useful":1,"cool":0},"49wj4APVsLnTnQkrM1jGug":{"text":"The decor is creative but more sterile than festive with a warehouse feel. We started with","useful":1,"cool":0},"qs78O8NT7zyIseacipDx5Q":{"text":"I was really hoping to like this restaurant, especially after seeing all the great reviews","useful":2,"cool":1},"AyXttxThGY7DHR5Bpm0p8Q":{"text":"Delicious Mexican food and drinks! Try to make it for happy hour if possible - we got a pi","useful":0,"cool":0},"gV_fd7GRx6g8_mZkanpbQA":{"text":"Food was very salty. We ordered carnita tacos happy hour tacos and catfish tacos and they ","useful":0,"cool":0},"9zqCywGPTC8p3mbWRDDnKw":{"text":"Ugh.\nWell the pictures of the decor have been taken like 18,000 times so I'm not going to ","useful":0,"cool":1},"XRi1a94pXtwjIWoxV0TRXg":{"text":"I've always loved Johnny Sanchez but the last two times we had the same waitress that was ","useful":1,"cool":0},"9uLzPaIKXkRmOTihIHCu9g":{"text":"We had a large party so service was a little slow but overall good service. I got the caul","useful":0,"cool":0},"BT3yVFrOJ0Hs0_8MRJIW-A":{"text":"I was refused service at Johnny Sanchez tonight. I arrived there at 5:30 to grab some taco","useful":1,"cool":0},"ZtkH2ITpFlNaoqPf9W49QA":{"text":"Best tacos ever!!! And the queso was delicious! Parking is the only drawback. It's street ","useful":0,"cool":0},"rZaaVyyV9PXss7tpUiO7pQ":{"text":"I've been wanting to visit this restaurant for a while but just haven't been able to for o","useful":4,"cool":2},"X8jWbBecw6bq505Syvrc_g":{"text":"Very disappointed in this place and will not go back.  We had a party of 9 and decided to ","useful":1,"cool":0},"u7B7V3OJ-AaXkUuKwTD3Pw":{"text":"Excellent addition to the mexican food scene here in the city. Perfect balance of upscale ","useful":0,"cool":0},"KiYSZMVD9LnJHtzBj1i5Zw":{"text":"The food is superb. Wonderful blend & layers of flavor. We had several tacos & guacamole w","useful":0,"cool":0},"u_p2JH_gD5j5N4NGzeMKgA":{"text":"Went here for happy hour and couldn't believe how good the tacos were.  Friendly professio","useful":0,"cool":0},"ft1Nj_8yhKwCQpig-lFWVg":{"text":"My husband and I ate here on our last night in New Orleans and couldn't get over how great","useful":0,"cool":0},"DKUVnTwwS9knIOE3XjBpDg":{"text":"More like 3.5 for my first visit here after having it on the list for a visit for quite so","useful":1,"cool":2},"1Lf8XeZXxIw-c1Q_RVW9GA":{"text":"FOR THE LOVE OF GOD... HAVE YOUR RESTROOM CLEANED. \nDéplorable!\n\nThe entire facility, incl","useful":1,"cool":0},"RG6LudTIGcyYqb8fgHiL3Q":{"text":"In short, I'm not a fan of Johnny Sanchez.  The atmosphere is fun.  The wait staff is real","useful":3,"cool":1},"aC3CrgVbG-hn9U0_L_3Nlw":{"text":"May, 2019.\n\nAnother visit and another amazing night on taco Tuesday.  One of the best rest","useful":3,"cool":0},"JygcwrNKKL3EjzCh3lUi8w":{"text":"This is more like a 3.5 review. I've heard mixed things about this place, but when my frie","useful":0,"cool":0},"I9rNcyIes79zeuYVYYv5Jw":{"text":"I've visited twice in the last two weeks. Here's a summary of those visits.\n\nOverall: the ","useful":1,"cool":0},"iFTQtnavQGSqSjNl2D3vXQ":{"text":"Amazing! I'd give this place more than 5 stars if I could - it was that good! We enjoyed $","useful":0,"cool":0},"ZQ4tjxm6ap7LC9ngALKQjA":{"text":"Update: upon my 4th visit here, I don't understand how this isn't the #1 rated restaurant ","useful":0,"cool":0},"A71ELB6sjRm0RaeVYGIRxA":{"text":"Highs and lows.  First, I would come back and try more.  There's a lot of really good gour","useful":2,"cool":2},"32d82Zk442xG8vnVKtAmcA":{"text":"Really good food. Really poor service. The food deserves better work out of the service cr","useful":0,"cool":0},"ZXVnFR6YZuym4zjaSO-KsA":{"text":"The food is superb. Wonderful blend & layers of flavor. We had several tacos & guacamole w","useful":0,"cool":0},"uI1bVPZHny6Cy4VYBlcneA":{"text":"I was really excited to eat here as Mexican is my absolute favorite food! We had a party o","useful":0,"cool":0},"TMJ6Zgsn8qaAylW7Y9JZ8w":{"text":"I really wanted to love this place and I just feel it fell flat. The service was just weir","useful":0,"cool":0},"veiPnxfj3mUdHG03qKrOLQ":{"text":"Delicious shrimp on a cornbread patty with grilled vegetables and a great street corn side","useful":0,"cool":0},"RN2Y4C6VeeD6o0fIixuW9Q":{"text":"The food was great even though the decor didn't indicate so (eclectic/confused). When we w","useful":0,"cool":0},"jKoiNXMO2QhWWLmIZpayCA":{"text":"This was great! I got the Brussels sprouts and they were my favorite part! Totally recomme","useful":1,"cool":0},"OkfzJKNLw7NR-WR3l0_HYQ":{"text":"Enjoyable food, pleasant staff. The street corn was definitely the best thing we had. Taco","useful":0,"cool":0},"ZkTJIz3BdarLjvniy_4WrQ":{"text":"I can't say enough good things about this restaurant! To start, our server, Will, was frie","useful":2,"cool":1},"7UWU3GifUnaG6D0jAp6L-A":{"text":"My favorite meal of a week in New Orleans, which you know is a high compliment! The table ","useful":2,"cool":0},"QQKePymv3il0k1VPDq8z9A":{"text":"This is not a Mexican restaurant, at least cuisine. It is a notch below Tex-mex. it's a hi","useful":2,"cool":0},"UyxmDW6bQTQLlMv3CZYfLQ":{"text":"Try the crunchy rice!!! Came here while on my bachelorette for one of my bridesmaids birth","useful":1,"cool":0},"-mbS3tv967B0iN6CDr6ybg":{"text":"I wish Yelp allowed me to rate food, then rate service, then ambiance... and then have a m","useful":0,"cool":0},"T10AyX4EnjT2ZRsTakCwZA":{"text":"If I could give this less than a star that would be too much!  Horrible service!!! Food wa","useful":2,"cool":0},"ACLjaPwulGVur0qqcwv5LQ":{"text":"We had high hopes with this place but a little underwhelming. Our side rice was over cooke","useful":0,"cool":0},"m-4GgeWH_d3YyXPZtlVLQw":{"text":"Amazing service! Lizzy was very nice & attentive. The meatball tacos were amazing & I love","useful":0,"cool":0},"llQzaSCL9Qxqct5Jj0RT0Q":{"text":"My husband and I are dinner here last Friday for their Happy Hour. We ordered a pitcher of","useful":0,"cool":0},"vI5cuVrxbNGBJQEA9r20Hg":{"text":"WOW  this place is wicked good. The food was amazingly delicious . \n\n   If you're looking ","useful":1,"cool":0},"4s9lPaVGwQi1eXZO4fPeWA":{"text":"Amazing food and drinks, we got the \n1. Guacamole\n2. Tacos (Oyster, Albondigas, Fish) - Al","useful":0,"cool":0},"G4CfdrO6ZnTmDeSMvSNobg":{"text":"The Quick and Dirty: It's fresh, high-quality, inventive Mexican food, the kind you want t","useful":2,"cool":4},"yQh1XAN2ay_aO94c3MhWVQ":{"text":"03.02.2018- Extremely loud, very crowded / food portions very small, over salted\n\nNot a go","useful":2,"cool":0},"_BBG6iRum8MpARf_rdBfKA":{"text":"Excellent   & food! Dustin was amazing & very helpful!!! I recommend being seated in his a","useful":0,"cool":0},"V6sY51sDskQHzguuTN1CJQ":{"text":"My burrito pork meat was drier than 5 day old\nCrock pot meat. Runner dropped my cutlery - ","useful":1,"cool":0},"l9yQafHIwGGEIT1ayOkfCA":{"text":"Wonderful food and environment! Exceptional service! I will recommend your restaurant to e","useful":0,"cool":0},"WfTBNK4V4yLV6Hwu51AbXw":{"text":"The ONLY Mexican restaurant that I will eat at in Louisiana. Nothing else even slightly co","useful":0,"cool":0},"X5IKwKc1JiDJGu1VHx5cLw":{"text":"Was really looking forward to coming here based on reviews and the story of who owns the r","useful":0,"cool":0},"9mYjVUVLPrlOdyLz2IDyRw":{"text":"Aaron Sanchez does not disappoint! The service is amazing along with the quality and taste","useful":0,"cool":0},"vE2y8ax56vcr28IlTVgtuA":{"text":"This is not your typical Mexican spot.\n\nThe place atmosphere is so much fun.  It has that ","useful":3,"cool":1},"AoHTAzcu8BV1v83Q8mudbA":{"text":"5/30/17 My girlfriends and I decided to try Johnny Sanchez for the first time after a conc","useful":0,"cool":0},"sy1qlUKSDF-8ZKjs3SryDQ":{"text":"I was so excited to try this restaurant because I'm a fan of Sanchez's. Unfortunately it w","useful":1,"cool":0},"bk3bVfcS8Yf-8RT6ygXI1A":{"text":"Best atmosphere, service, drinks, and food!  I can't think of anything negative about this","useful":0,"cool":0},"bzGqDc7HGjsQzicost6nMw":{"text":"I started with three tacos and they were so good I ended up trying all of them. The albond","useful":0,"cool":0},"-ZyqqAr6ncTqqwLjUOY0dw":{"text":"Went into the restaurant tonight and they had more empty tables than people sitting at tab","useful":1,"cool":0},"y-Q2kziUh6YIcLqikF3VNg":{"text":"It was horrible place and bad service!!\nWe waited one hour and ten minutes for food and we","useful":1,"cool":0},"YQxgC9T-X2LLig32Kmhcpw":{"text":"Poor service, waiter didn't seem to care that both drinks I ordered were horrible. Margari","useful":1,"cool":0},"8rInftTmfo5yX8vcRvGp8g":{"text":"Idk how this place got 4 stars. Food is wayyy over rated and over priced. The service was ","useful":3,"cool":0},"SPLVQl3yuiabDGsPv-K9qw":{"text":"We came back for a second time while we were visiting New Orleans and I've never been so i","useful":1,"cool":0},"KpFae-gosXitncyRjpguTQ":{"text":"The most pretentious place I've ever been. Food was average, service was poor. The only th","useful":1,"cool":0},"IviLP0G2YT_bA-jbxZ4c3g":{"text":"The service was very fast and friendly. We tried every taco and all were pretty tasty. The","useful":1,"cool":0},"qAYQtmDXlW8mQ_JUxb6bYQ":{"text":"We spent a week eating our way through NOLA and this was our favorite meal! Loved everythi","useful":0,"cool":0},"IcQclVU-oZuCdEnILjacJQ":{"text":"So it's Monday night, in NOLA, what shall we do? We asked Siri for nearby Mexican restaura","useful":0,"cool":0},"z99HGrvqlOkbHM3lVN8GxA":{"text":"Great food. The portions are a little small for the cost. $5 for a small taco for example.","useful":1,"cool":1},"Eb8K0HseXU2Ewwic-T2NiA":{"text":"Where to begin... for starters, the service was terrible. It took several minutes for some","useful":1,"cool":0},"DCDqd5vRnHJHUPRDE8XGsg":{"text":"Had the crawfish enchiladas, pretty much just a bowl full of melted cheese. Also sat at th","useful":1,"cool":0},"TIQAI4JEWo0AbvhoHi94OA":{"text":"I should've taken a picture, but I devoured it first. MUST TRY THE CAULIFLOWER TACO! I wil","useful":0,"cool":0},"g_gMuQZFFKA7ergl6xJnZg":{"text":"We happened on to this place about 3 in the afternoon. Great margaritas and tacos.\n\nHostes","useful":0,"cool":0},"z0wZbhjVP_eaiGya6TShVA":{"text":"Went to New Orleans for a concert this weekend and stopped in Johnny Sanchez for lunch. My","useful":0,"cool":0},"5cScyw_iUpvmh_SKQKjrGA":{"text":"I must admit, I went to this restaurant 3 times during my last visit to NO and have 0 comp","useful":1,"cool":0},"KGwat79db0sOiCM6-KN75w":{"text":"Love everything about this place!  Make sure you get the Brussel sprouts they are insanely","useful":0,"cool":0},"gRGGIhUKSyE-T0eGGVUAGQ":{"text":"You must have Morgan to guide you through the menu.  Every kind of taco and amazing house-","useful":1,"cool":1},"R8CLw3HvG5nPxIzc3ZFjJw":{"text":"Good food, but they care to much about how they look. This place is dressed like a modern ","useful":3,"cool":1},"lWz86XtjGPqejhoDwqbMFg":{"text":"Amazing food. Service was a bit slow, but otherwise, a great experience with some of the b","useful":0,"cool":0},"Ej93U18R54nrUQCPod6BOA":{"text":"1st time eating here...customer service is my biggest pet peeve.... my server was excellen","useful":0,"cool":0},"ll3BVQRqa2ba1THw_8bdnA":{"text":"Service was great & fast. We got a pitcher of house margaritas and they were strong but so","useful":0,"cool":0},"ZkSCcADQM1_qvfeLMFbdlA":{"text":"Went to eat before game. Service was slow and the waiter spoke as if he didn't want to wak","useful":0,"cool":0},"U1ZOJ22JsFp5IsN49ifImQ":{"text":"Wow. This place was a surprise for me-- was just around the corner from where I was attend","useful":1,"cool":1},"bgyezkNrIBXNA0oH0CgutA":{"text":"Really enjoyed the Yellowtail Ceviche and bean soup. We got the tequila flight and thought","useful":0,"cool":0},"93BSkwq0Jr0D8dzdkCvTMQ":{"text":"I am giving this place one star....and here are the number of reasons why: \n1. the service","useful":1,"cool":0},"3-KTKam24NiZaLdYYmHdHA":{"text":"I came here with a vendor for work not long ago, and I had the daily special - lobster enc","useful":3,"cool":2},"cHETQ_ui2MgpZdzMJCAORw":{"text":"Very disappointed! It gets 1 star for the location and ombiance, the tacos and service wer","useful":2,"cool":0},"YmodcFGOxBkIwfKzgaMMkg":{"text":"The food was delicious and our server Rohan was AMAZING!!! Would definitely visit again","useful":0,"cool":0},"yZoy7B8UKbLbODW1SCf8Lw":{"text":"Can't say I was bowled over. The service was great, but I can eat and drink the same quali","useful":7,"cool":1},"aB-wwOEbzCXcelwt9F5l1w":{"text":"Great find across the street from our hotel. The salsa was excellent. We had the rare tuna","useful":0,"cool":0},"LcRjS4yQNyPaaoNWpoRE3g":{"text":"My husband and I made reservations for Easter Sunday. I ordered 2 oyster tacos and my husb","useful":1,"cool":0},"LSZy5uTMV1oASJyWqFhtDQ":{"text":"Love this place! Reasonably priced, unique food in a fun, if a bit loud, environment. Goat","useful":2,"cool":1},"dHx9_TOFgyFxMJ3y7va6FA":{"text":"Changing my review.  Wife and I are regulars here.  They have a happy hour that runs to 6.","useful":0,"cool":0},"cw4HulneSEZpJcaTnjfn_g":{"text":"Lilly was a great server and had a great energy! The first thing she asked was about dieta","useful":0,"cool":0},"QPOpYdn6lYEwo-tmJ8dUXg":{"text":"Definitely a solid happy hour spot. The cauliflower and catfish tacos were delicious as we","useful":0,"cool":0},"uzH_GsIr5UJ68ro1QW9szg":{"text":"Stopped in before a Saints game, I recommend it. Got 3 tacos: shrimp, oyster, and catfish.","useful":0,"cool":0},"ekbSxi2UC6-PVKwFp9kd_A":{"text":"On the day I planned to ask my girlfriend of 4 years to marry me, We were \"welcomed\" by VE","useful":12,"cool":1},"v2YhSz244DhuoHykXB_gFQ":{"text":"2nd Dinner on 1st trip to NOLA. Chose here just because I admire Aaron S...Mexican Cuisine","useful":1,"cool":0},"wD0rctCXTBWe0Z-QbpUVvA":{"text":"The market salad is huge and very delicious. After all the chips, salsa/queso we had, I co","useful":0,"cool":1},"5N7czyCQhCKOjY8Wsjc6dw":{"text":"Hands down one of the best Happy Hour spots in the city! Their Wednesday's specials are un","useful":0,"cool":0},"0pYv2vzW5j3MpFmNvfW6dA":{"text":"The place is nice,very nice.\nHappy hour works fine beer 3.50 is good. 2 dollar tacos are g","useful":1,"cool":0},"AeEcpN0voB-tQiJFTtrsXw":{"text":"The food here is delicious but the service left much to be desired. My friends and I booke","useful":1,"cool":0},"eitA0e6-GF48eGH4XUgUzA":{"text":"This place was on my list to try for a while, so I was excited to try the food at a work e","useful":1,"cool":0},"wNl1lN7EpmjM4q1r9R7NuQ":{"text":"We were in town recently for our  anniversary and decided to try this restaurant for dinne","useful":1,"cool":0},"ELVRyweTt4iYOqKs-dWDOg":{"text":"Wanted to stay close to my hotel but still try something new...and that's just what I did!","useful":1,"cool":1},"Kv4O5wclr8NseyIhJil_fA":{"text":"As one of our meals in New Orleans, my family & I decided to make a reservation at Johnny ","useful":1,"cool":0},"s_SYr3GKel2XiWMB8yTDPg":{"text":"I just don't see the value here. What I ate was good but the prices are obnoxious. We went","useful":0,"cool":0},"q93RGqlAkDugBRxbM_hW3g":{"text":"Food:4, service:0.\nThe food and drinks were good, but we waited forever for everything.  T","useful":0,"cool":0},"PzK-l7d1av9bPRllZ7rdFQ":{"text":"i don't drink, so it's must be a fantastic bar to get such good reviews, as i can't believ","useful":3,"cool":0},"DwymaEv9nQLPBfFjlpY3Wg":{"text":"Fantastic service and great food to boot. Get the queso for sure. And their salsa is the b","useful":0,"cool":0},"7g0JlJHrSeHfhsVDP9eaDg":{"text":"The food was very good. Our waitress was good. However, after we received our food (we cam","useful":1,"cool":1},"zalOxHPsFMcSDF5mbgciJQ":{"text":"Another great Mexican restaurant in NOLA's CBD.  Located on Poydras the decor is modern an","useful":0,"cool":0},"k_n3IT_BwYzyyrzKTsqCsw":{"text":"I like the shabby chic concept of making a basic food into a gourmet item.  That's basical","useful":3,"cool":1},"335aNmymAZVbr1IJLC-lLA":{"text":"My family and I came here for a birthday. We got drinks, appetizers and a variety of entre","useful":0,"cool":0},"WMIaAUYxuiYw5iF-ZFye2g":{"text":"I was reluctant to savor Mexican Cuisine in New Orleans; rich for it's salty bayou crawfis","useful":0,"cool":0},"Tt4qWObFgBp_jUyxiAaSjA":{"text":"Food was ok. The meatball taco was definitely the star. Staff was attentive but to be fair","useful":1,"cool":0},"0aCkk1j02x8zRjC2uNhAPQ":{"text":"I enjoyed the contemporary Mexican flair of the restaurant. Very bright and inviting lands","useful":0,"cool":1},"8rapuknua_0IyL0WmNHL4g":{"text":"Disappointed!  The Queso Fundito was burnt and crunchy around the top ring which left over","useful":1,"cool":0},"9JXMZYnAoKrY03D-cBicDg":{"text":"Such a cute restaurant, cool vibe! I went on a Friday night with my bachelorette crew and ","useful":0,"cool":0},"AtRZzViylzSvdqp9UYvIKg":{"text":"great food! chips tasted home made and the salsa they brought out on the table was amazing","useful":0,"cool":0},"kVRSitYGDJF55mM_AMdIBA":{"text":"Chef Aaron Sanchez knows his native cuisine and so does Chef John Besh and when you put th","useful":11,"cool":6},"0-tWwRhU7ORGdzQk3QvPBw":{"text":"Service, meh...food, meh. The cevice was nothing like was portrayed on triple d. Very disa","useful":0,"cool":0},"QbziCDvcovJ6dW5L0NkgjA":{"text":"I don't get the hype. The food was good, not bad, just good. The service was horrible!  I ","useful":0,"cool":0},"nEFdTiX2S6FZQcnwR0aPkg":{"text":"So we were on vacation and decided to come here and try the tacos. It just so happened to ","useful":0,"cool":1},"KnMO7G9zGcJtfb8qOm8AFw":{"text":"Karly was awesome overall Service was excellent and she was fast and friendly!!! The food ","useful":0,"cool":0},"P7FLYadHOrAWXSd7waMgqQ":{"text":"I can honestly say that my mouth literally dropped after tasting their Queso Dip!! I knew ","useful":0,"cool":1},"F_KYJRxCGVhEB0GYKWY9vA":{"text":"I have loved this place for many years and only go downtown for special occasions and a ha","useful":0,"cool":0},"uJINpk1ILlUqblVLwyGSuQ":{"text":"I live in San Diego and love Mexican food! Who eats Mexican in New Orleans? Me! I'm a Food","useful":0,"cool":0},"GR_JSx0jUw9EbGDw7QUQ4w":{"text":"We came here accidentally while looking for another restaurant.  Really glad we did. Food ","useful":0,"cool":0},"92Hj837VJowWaqYWaJrhrg":{"text":"Cilantro. You either love it or hate it. I hate it. Like want to throw anything with it up","useful":12,"cool":7},"ctaKWwGUeOkaqo1JX37SUQ":{"text":"Aaron Sanchez has done amazing with this place not a bad item on the menu and service was ","useful":0,"cool":0},"iMQgOHMm7-7eJly-pEL_SQ":{"text":"What a gem! The service is terrific, welcoming and friendly. And the food- oh my gracious ","useful":0,"cool":0},"DKvAHSYCUoBxMx0MuPB1Dg":{"text":"This place is amazing! My opinion maybe bias though because Aaron Sanchez is the man in my","useful":0,"cool":0},"9uls4Bg9via9nnE-FsmC6g":{"text":"Loved the decor and ambience.. the vegetarian Cauliflower taco was flavorful.. the server ","useful":1,"cool":0},"nDOM6vCPDOUY9YlshXupuQ":{"text":"They really know how to make delicious tacos and margaritas! The fried plantains with sals","useful":0,"cool":0},"XrnMWIf9AO7HqqPJ2jdWGw":{"text":"I work in the CBD and park in the lot across from Johnny Sanchez, so I pass it everyday th","useful":1,"cool":2},"wJIqyDcSr-DUMjdZSYtb_g":{"text":"Kaitlin will make you any margarita you want- mezcal, sotol, etc.. Great place to watch a ","useful":0,"cool":0},"QhnMwlTzu_Zi8wMG9fhQoQ":{"text":"I have eaten at a number of \"Celebrity Chef\" restaurants over the years and have usually b","useful":0,"cool":0},"AGF92d5IdjqUgE-OXOb-yQ":{"text":"This is the worst restaurant I have eaten at in New Orleans. I had lunch today with 9 peop","useful":1,"cool":0},"13HkcsRXm-k3g_9QRAJ5ig":{"text":"The arroz con pollo was a little spicy which I though was good but didn't care much for th","useful":1,"cool":1},"AsxSlwv_LireGoz-SFsmFQ":{"text":"Food was perfect  But service was even better  and we're a family of 6 so it's hard to ple","useful":0,"cool":0},"YVRpjUfHwymrsItQyeK5Lg":{"text":"Eden was wonderful. She gave us good vibes and was knowledgeable about the menu.... We wen","useful":0,"cool":0},"zhL5_WrdchXjpCo-QKAWaw":{"text":"I visit New Orleans monthly, and everyone raves about Johnny Sanchez! I'm personally obses","useful":2,"cool":0},"g7ao7mY_TrVGPByMJx05BQ":{"text":"So I've been to Johnny Sanchez at least 5 times now, and I'm torn between 4 and 5 stars - ","useful":3,"cool":1},"zH4cwAG1-C3i7elHTvb3dg":{"text":"At first didnt realize that this was Aaron Sanchez's place, and after knowing that I was e","useful":1,"cool":0},"tCPMR9y7BdxAHga1toHo6A":{"text":"Absolutely delicious. They serve plantain chips in addition tortilla chips with their sals","useful":0,"cool":0},"CnX90LLG6xrh0BZNb7mcSw":{"text":"A solid 3 star spot. We arrived and it took over 10 min for somebody to even ask us if we ","useful":2,"cool":2},"c1eEhNTZjVtNmrdBH2ZVtQ":{"text":"Went on a Friday for lunch, amazing! Food tasted like home (I'm a Texas gal). The chips an","useful":0,"cool":0},"PNHjTn43L14AYuBq5vZyAA":{"text":"Amazing!!! Everything was perfect, the service, the food and the ambiance. We ordered the ","useful":0,"cool":0},"gVfrX-SIZMzceY7pEC1mqw":{"text":"What can you say , it a TV chefs restaurant.  Lots of fancy decorations, high end ingredie","useful":0,"cool":0},"NR3fGEA3wJHAYdyur0hgDQ":{"text":"Decor is awesome. Food was really good, we tried pretty much all the tacos. Super good qua","useful":0,"cool":0},"K91nsMG3NnXpM2OK-qnnpw":{"text":"Sat down at Johnny Sanchez on a Taco Tuesday for a quick bite before catching a flight out","useful":0,"cool":0},"Qt7AXbZW6EkcGFOP1HG30w":{"text":"We have eaten here twice.  One time it was a tequila dinner with Aaron Sanchez!  He was so","useful":1,"cool":1},"A7ymOx4ic-x3v35A8_sPcQ":{"text":"Me and my boyfriend came here on a Monday night. We came close to closing time so we didn'","useful":1,"cool":0},"VmM0d5jy5OlfSdjFqPP_IQ":{"text":"So I am big fan of Aaron Sanchez, had to make a stop at Johnny Sanchez. So glad I did the ","useful":0,"cool":0},"zvUIpQrcLTWJW5HJFg33WQ":{"text":"My friends and I went to this restaurant for a birthday dinner hopeful for a great night t","useful":3,"cool":0},"jSyHir6739sGOp2472900A":{"text":"Came here with a friend while we were attending a conference at New Orleans. Between the 2","useful":0,"cool":0},"uHePtlt96IZIRkvv64Ds2g":{"text":"Here on vacation and I heard that these were the best po-boys in town. (Let the arguments ","useful":0,"cool":0},"2qCSM_NTgc5d9kcRz9jyaA":{"text":"I just walked out after being seated and waited 15 mins and nobody comes attend to me. I s","useful":1,"cool":0},"s7GZoV3GxgkGRvLDRLDzJQ":{"text":"We stopped at Johnny Sanchez for lunch. The ambiance is quite nice with an open and bright","useful":2,"cool":0},"X_Wygc8Ugxcg7nj0o87f-g":{"text":"Small portions of average food at high prices. With the endless number of great restaurant","useful":1,"cool":0},"1dpneJ6RRUgPWlMeiUvChQ":{"text":"Now that I'm no longer in the restaurant business I feel like I may be over critical. A lo","useful":1,"cool":0},"ObNF-qbHkbgX-3MoPAq4ag":{"text":"This was one of the best meals we had during our stay in New Orleans. Our server, Morgan, ","useful":0,"cool":0},"38ocQ2UfqSRBGhxdpks5NA":{"text":"Erin's Slaps: 8/10\nThis restaurant is located in a quaint part of Poydras St and is a grea","useful":0,"cool":0},"w2AdnVKVshuPeRT5_0Z35w":{"text":"As we were driving from the airport, our driver said that Johnny Sanchez was great. What a","useful":0,"cool":0},"W4hdcqsznQeAziWdawEVgQ":{"text":"First time patron!  Everything was delicious from the soup, Brussel sprouts, cauliflower t","useful":0,"cool":0},"9olCKBoyLQ4LJmjA3vYCaQ":{"text":"The restaurant decor is very cool. The mural is breathtaking and on message. We had the Qu","useful":1,"cool":0},"3ee_97sChytF1_12Xwp2Jw":{"text":"Tasty? Yes! Great service? Fo sho! Expensive A.F.? ABSOLUTELY! Four tacos, chips + salsa, ","useful":0,"cool":0},"gm4WFvIX7oa0nz1IVHw71w":{"text":"I stopped in last Saturday to meet some friends and was HAPPY to take advantage of the HAP","useful":4,"cool":0},"G8_IHwBDqUKTx-q_pnepJg":{"text":"First time coming here, and I was not disappointed.  My friend and I started off with some","useful":0,"cool":0},"D_6srDcvCdYWoOUQfwzCBA":{"text":"Ordered the chicken flautas-dry and flavorless.  The chicken had no flavor and was close t","useful":0,"cool":0},"ijibHCM2Mnbt4wFByHXzgQ":{"text":"Me and my girlfriend went here for a friend's birthday party recently. We both always want","useful":1,"cool":2},"-5adoUZx5BGjfoVprIxP4g":{"text":"This spot was pretty close to my hotel and I felt like a margarita, when I looked it up, I","useful":0,"cool":0},"omttfVYB9Q6NMfYSmLLisw":{"text":"My husband and I were very disappointed with the service we received from the bar staff. W","useful":1,"cool":0},"YVioYnaO-ScVu7e3npnEiw":{"text":"As I came to realize while out in New Orleans, Mexican food isn't too widespread there, no","useful":3,"cool":3},"679ICeSyCce368sMxzZPeg":{"text":"I am a Mexican food LOVER so I knew I was going to be in for a treat. \nWent around 11am be","useful":2,"cool":1},"Fz9i31JhtP45z_HLmbo5qQ":{"text":"It looks like a lot of these \"user ratings\" are paid reviewers. Too many good reviews for ","useful":1,"cool":1},"igF9eB88btY40-Qs9WQ5CQ":{"text":"Basically a taco shop but for 5 people and a couple toddlers it cost over $200.00.  We did","useful":0,"cool":0},"L5Gq0HXdRjYhO9O8SdzhPA":{"text":"Some of the best food - and great take out!  I take back what I said about the price of th","useful":0,"cool":0},"FBS34EmWaSTKvWN2V4jfXA":{"text":"CARDINAL SIN: THEIR CHIPS SUCK!\nOverfried to the point of being brittle, bitter and churro","useful":10,"cool":3},"eaw80QynqvUi-P2ngI2xjQ":{"text":"Johnny Sanchez marks all the boxes for a millennial Mexican restaurant. Funky, yet hip dec","useful":1,"cool":0},"w8PXnWiC28sLK4gUsyYZiw":{"text":"Since the first visit years ago, this has become a favorite and must-do when in NO. Tonigh","useful":1,"cool":0},"IuhurfSYEm3qF8ydjl9Zuw":{"text":"We had a hard time finding places to eat in NOLA because one of our group was vegetarian a","useful":1,"cool":0},"wzWzjkvIl-X6pMFz8iTluQ":{"text":"The chips and salsa are delicious. The queso fundido and crispy Brussels Sprouts are also ","useful":0,"cool":0},"1Aah0yvEiwtxLQ5_Ue9e_w":{"text":"This totally surprised me!  We just stumbled across it. Absolutely excellent!  The carne a","useful":0,"cool":1},"hovuzbx_-XNmdFkqfzFRrQ":{"text":"I've heard that their food is very good so I decided to have lunch there with my co worker","useful":3,"cool":0},"BudoK1M-38Z_NDA0JGo6Dg":{"text":"Great meal. My server Rohan took good care of me.  He is an asset Chef.\n\nThanks for the ex","useful":0,"cool":0},"6JTINWkXnCeG1N4JNm9EtQ":{"text":"A friend recommended this place to us when we were visiting New Orleans. We were given a t","useful":2,"cool":0},"cVoKc16iiRpmagyMGWvXZA":{"text":"I cannot say enough about this place!  First of all, I love Mexican food anyway....  it th","useful":2,"cool":2},"Wx8KBfjLHHRsP3PCW9aoBQ":{"text":"On my first visit, I was waiting with my teenagers for a concert to start and wasn't looki","useful":6,"cool":3},"DgQdGJ5GPAZ4XHG-jrPnpg":{"text":"Your eyes are not fooling you.  That IS brown guacamole, served in a soup cup...for $9!  I","useful":1,"cool":0},"LDP7xkT6bkv8zp3vcr73zA":{"text":"Although I was only here for cocktails at the bar, I really enjoyed the environment. The d","useful":8,"cool":6},"xMWiBSP_92OMTnx28nQ5KA":{"text":"It is everything I wanted it to be. We went twice in the 3 days we were in town. Tried so ","useful":2,"cool":1},"eV9LSzSKFaLxqvqP3_o9CQ":{"text":"Met Arron at ATL airport at Piano Bar on Concourse A on day before he opened Sanchez in Ne","useful":1,"cool":0},"MH7H_6q64fEViC1XS3LPmA":{"text":"Highly recommend\n- Come during happy hour \n- Great staff \n- Food is on point \n- Not expens","useful":1,"cool":0},"KTJHZ7U4w7nPjilRfBM3Ow":{"text":"Fantastic choice for dinner tonight. Our group has a vegetarian, and he's been just sort o","useful":1,"cool":0},"rHNDrwvafLIipG9X4cJs2Q":{"text":"Carne asada tacos were amazing!  Great happy hour specials and the plantain chips were spe","useful":2,"cool":0},"HO5JpR_T_OdwljLb9Hi-3g":{"text":"This spot was really upscale and put a sophisticated spin on Mexican cuisine. I really enj","useful":0,"cool":1},"pcAUMz6xTDG8ebR1InoY7g":{"text":"Food: Tasted great. Made us sick.\nService: 0 stars. Major attitude. \n\nWe were originally s","useful":0,"cool":0},"S8Wy5i4iiKYE_rsbv-5Y-w":{"text":"Hands down one of the best Mexican food places I've had! The chips and salsa were amazing,","useful":0,"cool":0},"zBSwvReNKxvg5D4nlqoN_g":{"text":"Excellent happy hour. Even my more selective son said he actually liked the place which is","useful":0,"cool":0},"4MRl709UVfkJASnzQgyi9w":{"text":"The hype is legit!\n\nHad a reservation for a party of 8 at 7:30 on Friday night. Were seate","useful":2,"cool":3},"mD3ZSF7hcutlEi5ChWcYNQ":{"text":"\"Meh\" is right. Despite being a Mexican food lover, this dining experience was far from a ","useful":2,"cool":0},"2Rkg8_-HtEfGJM9wBGr41g":{"text":"Awful slow service. The manager finally came up and said I could tell you what happened bu","useful":0,"cool":0},"XZe092TkbTZTyURwFWhlpg":{"text":"The at atmosphere is hip and the food is very good. So why the 3 stars (3.5 if that was an","useful":3,"cool":0},"AeQjXjZ1msNDmFh59M-KAA":{"text":"Sweet pickled jalapeño red onion garnish is fire! Brussels sprouts with cotija, Margaharit","useful":0,"cool":0},"skCSaNU4W-Er3YEW11CBZA":{"text":"This is my go to spot if I can't decide where to go.  Great happy hour.  Albondigas tacos ","useful":0,"cool":0},"K8c-htHF5fHh7VnT8pkwFw":{"text":"Heard a lot of people talking this up during a conference so thought I'd check it out. Tho","useful":0,"cool":0},"5JJlzeOKcqysQCu06cjGBg":{"text":"Excellent Mexican cuisine is a true find in New Orleans. Beautifully plated, creative entr","useful":0,"cool":0},"VuF6SBMRfK3XmVz5LMLxDA":{"text":"Does not live up to the hype. Disorganized service, mediocre food, drafty and impersonal d","useful":0,"cool":0},"6MfGPYOuiJEiCDVgZQsh5w":{"text":"Came for happy hour which has great specials. Food was amazing. Margaritas were even bette","useful":0,"cool":1},"dmCSm2Z7t5yNRAXu948lyQ":{"text":"Our server was great. We went for lunch. We tried the queso dip. Not sure what kind of che","useful":0,"cool":0},"mPaUXLov3P3VadP5wVs_cQ":{"text":"Food was excellent! Cool place inside. Had empanada's to start after they served tortilla ","useful":1,"cool":1},"RiwjKPMSYJxHmkWZz8NzpA":{"text":"Update 2021: Johnny Sanchez somehow got so much better than what I remember - I went 2 Fri","useful":3,"cool":1},"FsSLZhBNsxmgweBO-ABvfA":{"text":"Our meal was amazing.  The service was great, the food was so tasty and the drinks... oh m","useful":2,"cool":1},"DJCVMQclgNNulTrssfTItw":{"text":"Best queso ever !! And the staff is excellent !! \nBest tacos and margaritas I've ever had ","useful":0,"cool":0},"pTwgLwbUyPb9j3XfKI37cQ":{"text":"Happy hour tacos and drinks are fantastic here! The one time I came for dinner however, I ","useful":1,"cool":0},"eYZEevuEW-FLfqvp8jEODQ":{"text":"If you need a break from the traditional creole in New Orleans, I definitely recommend you","useful":0,"cool":0},"tmLmOMwEVITIpFomUkyy6w":{"text":"Solid 4! I had never heard of Johnny Sanchez until I saw him on Hell's Kitchen a few weeks","useful":3,"cool":1},"iRSJ9owSDCVq8LY8D-qrVA":{"text":"A wonderful find on our trip to New Orleans and were extra excited when we found out that ","useful":1,"cool":0},"6885QOyFIt4IyCZcv5p04w":{"text":"This place is absolutely remarkable! The best Mexican food I have ever had! Our waiter was","useful":2,"cool":1},"AKL3fK79sVkwHYq6wQOYHQ":{"text":"So it's been 4 years since I have been here and have it only 2 stars in 2016. Well I've go","useful":0,"cool":0},"cVSvma6t9Rxo8U7Z1P1I-w":{"text":"First, let me start off by saying that the only reason why I sought out this restaurant wa","useful":1,"cool":0},"PhoZOJoifGXxgYq4beFM1A":{"text":"Excellent food and service! Our server a young lady with glasses (sorry, didn't catch her ","useful":1,"cool":0},"HDox6Yowj2zBO35yQhc4XQ":{"text":"Soooo good!!  Super fun ambiance - came in on a Thursday evening and the place was hopping","useful":1,"cool":1},"6o_cXvX25S1NvSFQ2-qeCw":{"text":"Johnny Sanchez...is one of the must visit if you're in New Orleans. Seriously, just go. Wh","useful":2,"cool":1},"Znc81CtByvkwi7pKPmCCaA":{"text":"Johnny Sanchez is home to the best taco I've ever had.\n\nMy friend and I came here on a Fri","useful":5,"cool":0},"6HtGuDEBtGalLUUUoF_rxQ":{"text":"Johnny Sánchez' was an easy choice, being big fans of Master Chef, and being even bigger f","useful":0,"cool":1},"m2tJVZ-sbaNxiS0meRCDrQ":{"text":"With Aaron Sanchez being world renowned, I knew I was in good hands but, as a southern Cal","useful":0,"cool":0},"jumgXrQgVJE1OIJSaN7ZbQ":{"text":"Sorry Johnny but my dinner was a hug let down. While the food did look beautiful and the s","useful":2,"cool":0},"d52ceGPbRIDeM5ilCiRZaw":{"text":"Can't beat the happy hour prices with high end Mexican fare!  Atmosphere is trendy and bri","useful":2,"cool":2},"tFvhbpuz8AzfkwkIN0sfoQ":{"text":"The appetizers were great! Horrible service. We left before we got our entrees. We had rea","useful":0,"cool":0},"XxXvgDwAl2hL61hVfMBnuw":{"text":"Not me thinking about Johnny Sanchez for every meal. This spot is fantastic!!! Love the sa","useful":1,"cool":0},"wKJgonZ8sB8wb8Y2DPiPhg":{"text":"Great happy hour! It felt weird to eat Mexican food in nola but the happy hour prices were","useful":2,"cool":1},"gwHN9UG8fGGDdDixcDqLDQ":{"text":"What an amazing time with friends! Margaritas by the pitcher and tex mex dishes, in the pr","useful":0,"cool":0},"nCy3rTTy3sfyRoHbbcZyGQ":{"text":"Top taco winner from 2018. Love that the cauliflower taco is on the menu. Fabulous. \n\nThe ","useful":3,"cool":2},"EbkyfOjyDryqU4fOTXcmnw":{"text":"I have always liked Johnny Sanchez, especially for Taco Tuesdays.  Amazing deals, especial","useful":0,"cool":0},"Ah0qPzWGuuEiUaUO35uB6Q":{"text":"Great service and food!!! A breath of fresh air from the same food that all the NOLA resta","useful":0,"cool":0},"341EvaSiV0jorIl39KQCqQ":{"text":"OMG y'all: HAPPY HOUR HAS STARTED!  $5 taco pairs and maybe $16/$17 for a pitcher of their","useful":8,"cool":4},"yvAygqlV4t8rCn7JdSSsiQ":{"text":"Our entire meal here was a flavorful journey! Our waiter at first kind of seemed like a ha","useful":2,"cool":2},"e95DrGME-not1jonHd3V-g":{"text":"The cauliflower taco was AmAzing.... yummmmy! I didn't care for the lobster taco because i","useful":1,"cool":0},"RX5Y7Q6C0KXzLckyciWpkw":{"text":"I came here needing a break from the local and regional cuisine, but also desiring a light","useful":6,"cool":6},"BxcIJ8_nWWn9Zc8Sje_BlQ":{"text":"This place is everything. The food is exceptional, the atmosphere is wonderful and our ser","useful":0,"cool":0},"Nb172CoNDs8K2M5pxlZ7kQ":{"text":"Girls night last night. We had a great meal.  One of us was a vegetarian.  Plenty of choic","useful":1,"cool":0},"Ah7RiWipy55BrgkSRwvKAg":{"text":"JOHNNY SANCHEZ GETS NICE MENTION IN FORBES MAGAZINE\nhttps://www.forbes.com/sites/garystoll","useful":0,"cool":0},"dGeqKo9AwmcK171n3DWBtA":{"text":"I'm so heartbroken about the food!!! I absolutely love love Aaron Sanchez and was so excit","useful":1,"cool":0},"_FeGTuASGxlZ1K2hUESZvA":{"text":"Run to Johnny's!! Amazing tacos. Stopped by here for happy hour (amazing deals) after arri","useful":2,"cool":1},"bi5uxaUOETxw0cTwjii2qg":{"text":"Very disappointing. Food is bland. It's a very white wash type of Mexican food. We had que","useful":1,"cool":0},"bxx5tKzJh5undKqeulMyUg":{"text":"I really want to give this place at least two starts but I really just can't. The one star","useful":7,"cool":0},"0nJKG8hyw8ZU6GoDbhOtHA":{"text":"I don't normally leave reviews but this was hands down the best meal I've had in years, if","useful":0,"cool":0},"R7nXB1S5QM91ZJCaKpNVyw":{"text":"I don't know what happened in the last couple years. Last time we're here, before John Bes","useful":0,"cool":0},"W7HJTuDgE6yacyO6nvLVMw":{"text":"Not a good experience. My boyfriend And I stopped in for a margarita because it was rated ","useful":0,"cool":0},"hpau5j2dPz_WkgH2WsU0Ww":{"text":"Very disappointed with Happy Hour.  They advertise $2 tacos, but what they dont tell you i","useful":1,"cool":0},"VnpgX1XQT0pOD_2DcP1nNA":{"text":"Soooooooo I just wanted to say thank you for the bestest yes I said bestest wings and shri","useful":0,"cool":0},"MK59leec_oepXqMNlAKkGw":{"text":"Tremendous!!!!! Flavors of the food were so on point. We enjoyed our apps...our margaritas","useful":3,"cool":1},"yUltZ2e2Y4_p-xj1sFlw1w":{"text":"We had a wonderful dinner here last night with some out of town guests! The black bean sou","useful":1,"cool":0},"MoF4elk5AEIu975acLHVRA":{"text":"While walking around in New Orleans we happened to walk by this place and decided to come ","useful":1,"cool":0},"YQFbr8rlLqgBYPwpD8Kepg":{"text":"I mean...if Mondays have to happen, then at least they should end margaritas. Regular pric","useful":2,"cool":0},"pdXylyDy5z17FijkBuMMeQ":{"text":"This CBD staple has been around long enough that I think it will stay.  Happy hour is the ","useful":6,"cool":3},"AvtlVMz2crsZ9jjDQJHV7A":{"text":"Simply put, Johnny Sanchez was an amazing experience.\n\nA group of friends and I were visit","useful":1,"cool":0},"OC6IEQKgiXBqXcPJne4Qow":{"text":"Great atmosphere and the service was excellent. The tacos and roasted corn were well prepa","useful":0,"cool":0},"db3IUuVhDI7N8mrAXOQWfg":{"text":"I love this restaurant. It was one of the highlights of our trip to NOLA. The decor and at","useful":0,"cool":0},"TbSHH-ZfhOXKe9cHJKkUuA":{"text":"Good food.  Service is a little slow for not being that busy.   Went here pre covid and it","useful":0,"cool":0},"hF19GwYFfuCHlRqTXto74A":{"text":"Fantastic. The queso & chorizo was easily the best I've ever had. The carne asada tacos we","useful":1,"cool":1},"FqtMa5uwgt6UvU-UyFSLAA":{"text":"I love good Mexican food so I was excited to try this restaurant out for my birthday dinne","useful":0,"cool":0},"ZOyn3YkSzgR5LWFWLENlQQ":{"text":"Ordered food for carryout,  since our hotel was located across the street. I ordered soup ","useful":0,"cool":0},"A8t-tGXrt2zldwtj3bWyKw":{"text":"We love Food Network and Chopped, with Aaron Sanchez being co-owner we had to see what he'","useful":1,"cool":1},"mH81Od9dD72Jpqjd5oxOuQ":{"text":"Came here for dinner because I know Aaron Sanchez is a celebrity chef. Over all the servic","useful":0,"cool":0},"qMgkyaSzsekfTgheT1gkBQ":{"text":"Was awesome the first time we went there. The food was good quality and different- fusion ","useful":1,"cool":0},"7nNe3OwTngP2Ru0VVDYSyw":{"text":"I specifically went for my birthday lunch because I am a fan of Aaron Sanchez. When you're","useful":1,"cool":1},"JIyYGEXXJMvtCBx6X5ROXQ":{"text":"I like the rice and chicken dish but that's about it. If you're craving Mexican food, don'","useful":0,"cool":0},"QE2eBr_JZx6Aiw-ctkJaOw":{"text":"Do not recommend terrible  food oVer priced for no reason. Do no recommend. Avoid this pla","useful":0,"cool":0},"gj8aoe3tb9XHo6MZc1EVTw":{"text":"I'd give it a 4.5 if allowed. Not the best thing I've ever eaten, but certainly up there o","useful":0,"cool":0},"aCa6Muvg-kPiVZBms4ZWJg":{"text":"The Albondigas Taco is the best, most unique a la carte taco that I have ever eaten. The m","useful":1,"cool":0},"23Yt8wOF18JGiUFFKeKbsA":{"text":"Top taco winner from 2018. Love that the cauliflower taco is on the menu. Fabulous. \n\nThe ","useful":2,"cool":1},"sfVTRV2u8zfROnNYADieKg":{"text":"Johnny Sanchez, putting the fun in Fundido!\n\nMy wife and I are staying around the corner a","useful":18,"cool":19},"JizoE4QYw_ByT6u6jDAxkg":{"text":"Rating based on the fact that we walked from Treme to the restaurant that was unexpected c","useful":0,"cool":0},"diLjZZqdr5FH69jMcXTdmQ":{"text":"The food was pretty good! The chips and salsa included plantain chips roasted in house and","useful":0,"cool":1},"hMCjZajODsmjjfkFLziEdw":{"text":"Very underwhelming experience. My boyfriend and I came before a pelicans game and it was p","useful":2,"cool":0},"jJs8Bx9hNHJCylHtpQa5Nw":{"text":"Overall:  Nice quiet side of town away from hustle of tourism and clean restaurant.  Went ","useful":1,"cool":0},"GOzHVu6gsXXco9sYFSGn1A":{"text":"We were so excited to try Johnny Sanchez because of Aaron's reputation. I was a little tak","useful":3,"cool":0},"4S-0N1bC2IKtuJ9ysGo57w":{"text":"I expected more flavor from such esteemed creators but I found the flavor lacking. The amb","useful":1,"cool":0},"d09c4PI97r-gvFI0puLhPQ":{"text":"Bad pics but we were too hungry to wait. This place always has open tables for some reason","useful":0,"cool":0},"VMIfVsu-B0fspt6z0LM4SQ":{"text":"Came here with my party of 6 while on vacation in Nola. Large groups are welcome. Loved ev","useful":1,"cool":0},"d9yI3HAnwWrlx3P0dKY7Yw":{"text":"While in town last weekend we tried out this place. OMG was it incredible. We ordered the ","useful":1,"cool":0},"GqRD9e0o7Mo9YlWsJCG2kg":{"text":"Great spot for a happy hour! Half off pitchers, a little pricy but worth it during happy h","useful":1,"cool":0},"iJJhg-BgYECpo-OEwqAXRw":{"text":"Who eats Mexican food in New Orleans? \nIt's not even one of my favorite cuisines. But when","useful":23,"cool":15},"UMstY92MmKh1PkON60UI8g":{"text":"I had such high hopes for this place.  With Aaron Sanchez being the individual behind this","useful":0,"cool":0},"8Q5pgJzuPAW5TwxTApjkVg":{"text":"Johnny Sanchez is just straight up fun. Whether you're enjoying a carafe of top shelf marg","useful":1,"cool":1},"21eHhx430SvcCvCDntmEsg":{"text":"Good and bad here. Nice decor, great service, but food...just ok. The tacos were good, not","useful":1,"cool":0},"xnyvTd9Roj8xKpJx-jxkjQ":{"text":"Really disappointed in the service here. I made a reservation for my birthday. I walk in a","useful":0,"cool":0},"eJiUvcJkgvd4B1sHq4eYgw":{"text":"Literally the best queso I've ever had in my entire life. Everything I have had here is TO","useful":0,"cool":0},"b_sVHj5v_cTdGrm83ujCtw":{"text":"We stopped here because I am a big Aaron fan. This place was the perfect happy hour/lunch ","useful":4,"cool":1},"470fEoxR86ZF1Y03igDcCg":{"text":"This was our first meal when we arrived in New Orleans on a Sunday evening. It was a block","useful":3,"cool":1},"XAFRwDPn2jFdR06QjPRXzQ":{"text":"So good! I had the cauliflower taco and my boyfriend had the shrimp quesadilla and both we","useful":0,"cool":0},"l578c7nlAL60j2QUZHIbLg":{"text":"My girlfriend and I tried for a Romantic afternoon downtown New Orleans.  Horrible experie","useful":0,"cool":0},"tqjYbztKyfbwHbYJr_zoiQ":{"text":"Don't refer to this review for the mains and entree because I only had a margarita, a chic","useful":1,"cool":0},"P0r0IIie9CrzuycTX9GocQ":{"text":"New favorite Mexican restaurant !!! Not only was Sam, our server beyond friendly and helpf","useful":0,"cool":0},"JDKZL9VOqrnEVQRG1X-XMA":{"text":"Definitely worth your time to experience this fusion of Southern Creole & Mexican fare","useful":0,"cool":0},"NdZ6IAKhf7xGg7smRyP7Cw":{"text":"Extremely underwhelmed and sadly disappointed! Better tacos at the local food trucks. Grea","useful":2,"cool":0},"cqU34KhqDsbHLvpxh4D6CQ":{"text":"We are from Houston and, go figure, got a hankering for Tex Mex while in NOLA. Johnny Sanc","useful":0,"cool":0},"nqcgUy_8sIY4MtWYmLkhtg":{"text":"Better than I expected! I loved the plantain chips with the queso and salsa! What a good i","useful":3,"cool":1},"5tJUxcegeHmBsbMmmrtK7A":{"text":"Delicious. Is there more to say? Yes...the flautas were to die for. The asada tacos were s","useful":0,"cool":0},"YETqpf_dZ5bN4KI1pkp6pg":{"text":"Walked in, I waited about 10 min to get seated and then another 15 minutes just to get app","useful":1,"cool":0},"Snb13erppsEuzaAF7TyKZg":{"text":"Man am I impressed. By far one of the best restaurants in NOLA! Johnny Sanchez puts a grea","useful":0,"cool":0},"rymo5J1rMVJ3QA7UEBONQw":{"text":"Firmly placed in the top five meals of my life.\n\nI had realistic expectations.  I expected","useful":0,"cool":1},"quk8CGO0YD9ONCCPIhymVA":{"text":"The restaurant was located in nice area. We drove although I'm sure some wouldn't mind the","useful":1,"cool":1},"O4Z2_VbGuMzuWUC7oOEEoA":{"text":"Food was great!! Service not so much!! Prices very reasonable!!! Very loud!! But sometimes","useful":0,"cool":0},"ke71iqycyot4TidGUglk-g":{"text":"We were looking for a low key and casual place where we could relax and this was perfect f","useful":0,"cool":0},"9epR7KiaT327OiZNdNetJg":{"text":"Tasty, tasty, tasty food!  It is about $2 or so overprice for the size of the tacos - but ","useful":0,"cool":0},"bPNpBKve6J5oMw1VIDMvzQ":{"text":"There seem to be a lot of Mexican fusion restaurants popping up around NOLA, so here's a B","useful":1,"cool":0},"q5FfKJxb4lkdnb_a3OZ__w":{"text":"Y'all. Happy hour = $2 tacos! I love going here for the happy hour. They have happy hour M","useful":1,"cool":0},"BzGmN8cMFc8vNTU-iVZycA":{"text":"Stopped in to Johnny Sanchez for happy hour. Great space with neat decor and fixtures. Hap","useful":4,"cool":2},"L7tnO-h9imd3UWquDUIHXQ":{"text":"I wanted to write a better review than this.  I swear.  I was really excited to visit a pl","useful":3,"cool":0},"Af5rH5CROUiwtaGbHE2mDw":{"text":"I got my food delivered from Uber eats, nothing wrong with the delivery service. But commo","useful":0,"cool":0},"9RY_iLOFt5s0kVtgwy7bGw":{"text":"The best taco place in NOLA! Restaurant by Aaron Sanchez from tv's Chopped. \n\nI have absol","useful":0,"cool":1},"eJiUToHcAv-4RHK3nrkczQ":{"text":"We went here today on a Thursday at 3pm. I was happy to see on the menu big bold letters \"","useful":3,"cool":1},"UYdXHI7I1L5M35oiUunvvg":{"text":"It was amazing...I initially started off with three tacos, one shrimp, one oyster, and one","useful":0,"cool":0},"AwyR8pJYNg71jCqqFlUVsw":{"text":"The ambiance of this place was the best part of the entire experience. The food not so muc","useful":4,"cool":1},"BJBgK8vcUg5gIfn_Ql4MsQ":{"text":"We were so excited to go to this restaurant. Unfortunately I was so disappointed and heart","useful":0,"cool":0},"MDASL3YbaMsvPcyZJAKJog":{"text":"I enjoy the environment & the food! Tacos are pretty good, black beans delicious, and I en","useful":0,"cool":1},"ZG4wx-xpI4MK7iGHdcFXsQ":{"text":"When we got there we were promptly sat and ordered guacamole and our entrees. \n\nThe restau","useful":0,"cool":0},"08kYaEDNO0TRP2rK23CKaA":{"text":"Johnny Sanchez is a high quality restaurant with great service, great food, great drinks, ","useful":1,"cool":1},"rISUesNKOP4V4x2pvSF0eg":{"text":"2nd trip to Johnny Sanchez... my first, a couple of years ago, was much better than this p","useful":3,"cool":1},"E_07Q4x9RrjYIiK8bfpDhA":{"text":"I met some friends here for a quick lunch during the LSU National Championship weekend. It","useful":1,"cool":0},"9zMjfe6Is-cC7MM3Om2CVw":{"text":"I was so disappointed the food was ok nothing special everything really Tex-Mex, everythin","useful":0,"cool":0},"wgSgi20pKT6YaHs5L39dfQ":{"text":"Totally disappointed.   Service was ok.  Didn't realize I was overcharged until I got back","useful":0,"cool":0},"adcQoYvDjKAtqagNHOoa0g":{"text":"One does not ordinarily equate Mexican with New Orleans - but Johnny Sanchez delivers quit","useful":1,"cool":1},"RIAkwY3a_tHl4KYns-v0pw":{"text":"The Spicy Chicken is sooooooo yummy!!!  You can ALWAYS FIND Me finding a Happy Hour!!!  Ty","useful":1,"cool":1},"CZ5hbt7PiPMPj1H6_WYhRw":{"text":"I don't get the hype about this place. It's overpriced and not all that tasty. There's a s","useful":0,"cool":0},"JN2SY-md9B2sGQyzsrqjjQ":{"text":"Brussel sprouts so good you will want to do the splits like David Lee Roth!  Really enjoye","useful":0,"cool":0},"M8Qv0drg1HBpC6FZjgFQYg":{"text":"I'll be honest here:  went for a weekday lunch and was very underwhelmed.  We all were off","useful":2,"cool":0},"hfRWLKaqArb6HPb5_PJV7w":{"text":"Salsa and guacamole were fantastic! The pork taco and meatball taco were delicious!  Staff","useful":0,"cool":0},"hXjacjnUcPGJtl94_iCnLA":{"text":"- Good chips\n- The red salsa is smokey and tangy.  Good flavor\n- The guacamole was pretty ","useful":2,"cool":0},"ncJIhxLLmpbzmbZMklgM5A":{"text":"Yummy Brussels sprouts. Good fries! Good fajitas. Good to not your typical Mexican restaur","useful":0,"cool":1},"rz_Fkz1eJGOnvg-5TV2QLw":{"text":"This absolutely my favorite restaurant in New Orleans. If any of my friends are visiting t","useful":1,"cool":0},"ny3aSAHXKb2svXWvPSd-wQ":{"text":"The salsa was full of flavor. We had the Queso Fundido with house made corn tortillas were","useful":0,"cool":1},"7-LygzWd-tyJH_zoO5HjZA":{"text":"Delicious! Fun atmosphere. Our favorite spot to stop by before Saints games. We love the q","useful":0,"cool":0},"0JTDs2QzETk3SxJm3Ucxjw":{"text":"Tacos are great. A bit over priced. Entrees are small so the get the chips and salsa. Skip","useful":0,"cool":0},"Ehrl6X0fuZCZuu2Qbc6l4A":{"text":"Disappointed-website says open, google says open, get there and not open. Really wanted to","useful":0,"cool":0},"HwmNuo6m9gvxC1lssksuOA":{"text":"Jenn was out waitress and she was great! The food was also so delicious. We tried all but ","useful":0,"cool":0},"Ttpyb9kuSMpO9HzYAd4mSA":{"text":"We loved this place. The food was incredible. The brussel sprout salad and tuna app were s","useful":1,"cool":0},"SlTSTbdGKSe26hYqoRA_SQ":{"text":"I enjoyed Johnny Sanchez for a lunch with a few coworkers. The food was pretty solid. We s","useful":2,"cool":0},"YOW5l8vxTnpDi-m1CxfPDw":{"text":"On our last night in New Orleans we decided to go to Johnny Sanchez because we are big fan","useful":0,"cool":0},"UzJ3jkPKzL6d6vTcUEKh0Q":{"text":"Great food. The service was a little slow. Highly recommend the street corn, quest fundido","useful":0,"cool":0},"BUa8Gok47EnejaaTCNQ1yA":{"text":"INCREDIBLE!\nCame for my first time on Fat Tuesday and was pleasantly surprised with the gr","useful":0,"cool":0},"PYiOvoXe3Ehl0Ykms__jag":{"text":"Came here for a quick lunch on 03.12. I absolutely love how this place was decorated. The ","useful":1,"cool":0},"OIXxnks9vjDt9JDkot0wxg":{"text":"Mexican food with a modernized twist. The inside is decorated neatly, and it's appealing t","useful":1,"cool":1},"m-qxciE7AF3E7A3NjbfsOw":{"text":"After seeing Aaron Sanchez on food network and Masterchef, I needed to try his restaurant!","useful":0,"cool":0},"DsqjrgVbYMpEyHMpP8AnmA":{"text":"Such a great place I didn't know they had happy hour.  3-6 pm a margarita and 2 tacos 16 d","useful":1,"cool":1},"qSpdYAmS4A5Z-3jisy5z2Q":{"text":"Nice happy hour here! The $2 tacos are what get me here. The menu outside of that are a bi","useful":0,"cool":1},"dEmLVL7WraukCMrxzgf46Q":{"text":"Best tacos in NOLA and the libations are 5star also! Order a pitcher of ritas & you'll be ","useful":2,"cool":1},"kX9eq4nNE7m6qidxY5gPgg":{"text":"Super fun presentation of traditional dishes - great staff and overall wonderful experienc","useful":0,"cool":0},"1CThYlf3BTq7GwgbRnVmdg":{"text":"Like all Besh restaurants, J Sanchez has a great happy hour. Very good deals on food and d","useful":1,"cool":1},"6drZzLapiIIddOimPLlBoA":{"text":"Very disappointed !! First of all our waiter had to be called all the time because she was","useful":2,"cool":0},"RY9p-92Yc3Fpa7k_1b2kpw":{"text":"My boyfriend decided on a whim to try dinner here on Sunday 4/26/15. No reservations, but ","useful":3,"cool":2},"xG6op9Idt7g5xmFkZZWVbw":{"text":"When it comes to quality and consistancy; look no further than Johnny Sanchez. This is our","useful":2,"cool":0},"OgHINCknd-EdkhG6fsfn-A":{"text":"Had to check out Aaron Sanchez's restaurant while visiting NOLA. The place has got a very ","useful":2,"cool":1},"yJjcRp1KWGPs08sRBMSVrw":{"text":"The people here were nice but the food was awful... unfortunately the two dishes that my w","useful":0,"cool":0},"4Kr69_FAq-iM1nwbPrRxLw":{"text":"I came here for happy hour with a few friends on vacation. It was interesting to see the m","useful":1,"cool":0},"V12IxbIOOAHII7iJpSK-Xw":{"text":"The food here is pretty good but overpriced. I've been multiple times and had tacos, black","useful":3,"cool":1},"cZdg2dwGRE6XkEmHxRQAdA":{"text":"Awesome happy hour!! I came here for the late night happy hour that they have on Thursdays","useful":1,"cool":1},"iN-F96NGKqCb-h7Hno4_gw":{"text":"While eating the brussells sprouts salad, I turned to my dinner companion and said, \"I cou","useful":0,"cool":0},"_wXhNCc8UBsu0FRn9iRbbA":{"text":"I love this place do much. If you read any of my other reviews... you know that I only eat","useful":2,"cool":1},"jzXG08KOjvlZLBWsYbwaYA":{"text":"This was a really fun place to go after the saints game. It was lively with music playing ","useful":1,"cool":1},"uXRtU3E5VwRY4kPcxJAN4g":{"text":"Stopped in because Aaron Sanchez is my chef crush & he did not disappoint!!!! House Margar","useful":1,"cool":0},"gw5XXc2_OkZwZDmj6IYunA":{"text":"Pretty disappointed after reading the reviews. My experience is based on a postmate order ","useful":0,"cool":0},"oTaLuSPg5pBpBIHyD7A8Qw":{"text":"This place is 10/10. Drinks and happy hours are a great choice! Cauliflower taco was bomb!","useful":0,"cool":0},"6bD6-Ae-QjBLBsJKUyPdVA":{"text":"Came to Johnny Sanchez. It's a Wednesday night middle of the week and the crowd is mixed. ","useful":0,"cool":0},"IiLA29izN5fwj-3V4B4feQ":{"text":"I can't remember that last restaurant I was in that was as much \"fun\" as Johnny Sanchez. F","useful":1,"cool":0},"aMv5QNRMDzuxUx8TgreQ2Q":{"text":"We dropped in for dinner and were blown away with the quality of the food and service.  To","useful":0,"cool":0},"GHooNd9ptp6btRcgWoesCw":{"text":"We came here MULTIPLE times on our visits to New Orleans. The inside is very open with lot","useful":3,"cool":2},"u9f-lZ7g6nxRbLad8tJnTw":{"text":"Cons: not super duper quick for lunch (or maybe that was because the mess of 30 or so peop","useful":0,"cool":1},"e8-Ev_ULg2V3paC9rV7OnA":{"text":"Amazing, unique, vibrant and delicious!  A wonderful addition to the NOLA food scene since","useful":2,"cool":1},"alTdzViy8hhOlOXcwnXySA":{"text":"Amazing flavors and great vibe! I stopped in with a few colleagues on a business trip. We ","useful":1,"cool":1},"O73OCNyP0ZZLI8tFI8K-HQ":{"text":"Took my team out for dinner after a full day of meeting. Came at a late night where not so","useful":2,"cool":0},"mGY7fwUhBZrcHJ4WdByXcA":{"text":"Amazing, Delicious, Incredible, Phenomenal. \n\nI don't know what else to say. We came here ","useful":1,"cool":4},"1HpQvCPFPXPoSz4hWHbV-Q":{"text":"Get here for happy hour or taco Tuesday- right now. Not only are these tacos a great price","useful":1,"cool":0},"wDj_bXOpHp5fqxAnAttFSQ":{"text":"Lured in by the the happy hour sign in the window, we enjoyed a cheap drink and a snack--n","useful":1,"cool":0},"NmFlh60GAlcYAD0CXQTrJw":{"text":"This place was fabulous. We ate as a family here on Thanksgiving, they accommodated our ve","useful":1,"cool":1},"Ir-qpP7T4LJBKTXGR9gQjQ":{"text":"I absolutely loved this place. I've lived in New Orleans for a while and always viewed thi","useful":2,"cool":1},"NUQbrRJkxuzydNKe4Rg2Vg":{"text":"Johnny Sanchez's happy hour has always been IT.\n\nI've been here quite a few times, but I h","useful":6,"cool":5},"JADlnQqczF2Oi8Yjx0HCSQ":{"text":"I have been to Johnny Sanchez 4 times and only one of my visits was not mediocre. Everybod","useful":10,"cool":2},"-Kab0ieu2xsokFdqQAC-8A":{"text":"Happy hour: $2 tacos.  This is a classic case of \"you get what you pay for\".  All four tac","useful":5,"cool":0},"gkiV2QodiSKh4v8mdg5jlw":{"text":"First off when we asked for a 6 top they said it was going to take 30 minute so we split o","useful":0,"cool":0},"tdVLDFOSaqv0cobGDbQ66w":{"text":"Their cup of black bean soup is $6. Friend and I was went for lunch yesterday and ordered ","useful":0,"cool":0},"djiBCOu4ynxqCBH7omaF3A":{"text":"Decent-sized somewhat-upscale Mexican restaurant with a limited one-page menu in downtown ","useful":5,"cool":0}}