{"pCVakNWTt705F9Um7fZtfQ":{"text":"How adorable is place? Very.\n\nI spent a lovely weekday morning here, and was so awed by al","useful":4,"cool":1},"GgRly_UWx882dKWLM59Hcw":{"text":"I'm pretty impressed with this Children's Museum, we've been to quite a few in different s","useful":6,"cool":7},"6NIv8qEYvM8mBSrd1lRqbQ":{"text":"My girls and I really love this place.  If they dont do a speed run through it, it will ta","useful":1,"cool":1},"HVtYARsE7J4h4mdrXAYHow":{"text":"Great museum! Fun for the little one and good AC which is needed in the summer. Lots of go","useful":0,"cool":0},"SsH3HTdf2aUXV3KvQzR6og":{"text":"This is a really cool museum that would appeal to younger children.  I've only been here f","useful":7,"cool":5},"pgZZeYWOyvI7vAlHTfBIOA":{"text":"This place is the perfect way to spend a day, with a 2 year old or a 7 year old! My kids e","useful":0,"cool":0},"XIbqOd1wCEKNzFueb4qOTQ":{"text":"We were traveling to New Orleans with our 15 month old and this place was a must stop for ","useful":0,"cool":0},"Arl0vX1QdmFknVjLaabxog":{"text":"Great activity for families on a budget. $8.50 per person or free with national membership","useful":1,"cool":0},"YMLXqc8C1ryHKKfojlnzyA":{"text":"This children's museum is great fun! Took my almost 3-year-old daughter here for a visit o","useful":0,"cool":0},"Wtm-d5nvV_PJJGffaeU5AA":{"text":"This was a great place to go on a rainy day with my 2.5 year old. He loved pretty much eve","useful":0,"cool":0},"ZaAR_kS5KEDNTx4hn7t7mg":{"text":"TLDR: Go there now.\n\nRainy Day: Check\nLeaving NOLA in a week:  Check\nHaven't been here bef","useful":2,"cool":0},"IfTuFiia3zMLzSAGwtAyaw":{"text":"One of the very coolest children's museums in the whole country. Of course I am biased, gi","useful":0,"cool":0},"MHxppdpeOyp6O5Dtb9f9bQ":{"text":"I came here in 1992 as a 4 year old with my family and I still remember it to this day. Ho","useful":0,"cool":0},"Wp2k37spPbf0r4Ge6JUKSg":{"text":"To date, this has been THE BEST children's museum I have EVER visited! Absolute LOVE. This","useful":0,"cool":0},"S8Ha9B3RKh6PSQxoV3v7DA":{"text":"This place is very multi-functional. I've seen children as well as adults have a blast her","useful":11,"cool":11},"fidNYtbX9JWHDRIBOXF8ow":{"text":"I haven't been here since I was a kid myself! Took the kids yesterday, come to find out it","useful":2,"cool":1},"z8jWqjVPmlashUSkBl1I2A":{"text":"We had our annual Law school Ball at the Children's Museum and wow! Dealing with Jennifer ","useful":0,"cool":0},"PIbz5Lw0oShbwT4zLSv_QA":{"text":"Prior to even going to the Children's Museum for the first time, I went online and purchas","useful":5,"cool":3},"yKE_3Cp9TJoa4vb1r_zIFg":{"text":"Soo many fun activities for kids, I hope they get the new location at City Park.  Young ki","useful":3,"cool":1},"Q0GxLK4WtK7GVHffHtxHEw":{"text":"It was horrible.  Today I brought my daughters  to the childrens museum thinking they woul","useful":0,"cool":0},"B-WfhoKqxtbTABLdC0eZZQ":{"text":"Of all the Childrens museums we have explored in major cities, this is by far the most cre","useful":1,"cool":1},"ImckVqxbBu2Jb4-czF1tjQ":{"text":"This place is just fantastic. It is hours worth of fun for children of all ages.  They off","useful":8,"cool":6},"c8bw1U--oedGA9M-RjrelQ":{"text":"LCM may just be my favorite place EVER in New Orleans, more than any bar or music club, re","useful":3,"cool":3},"3SpIX-6kGodZ-FCmdh2j9g":{"text":"Just went back because it was the 2 year old niece's birthday party.  And guess what?  It ","useful":3,"cool":1},"_zyqT1EHzfr3fyn1KqV1Lg":{"text":"The museum is great for little ones. My two year old had a great time at the pretend super","useful":0,"cool":0},"9FLRMWjpLi6RdLO2esFTrg":{"text":"Huge place to let  kids run wild. After visiting this children's museum, it's going to be ","useful":0,"cool":0},"Kvs9MRyc328efkvYx-8qqA":{"text":"A lot of fun activities and pretend play for the kids. Huge variety for all age groups, my","useful":0,"cool":0},"E_ajJKLsjja-T7WO0MXj4g":{"text":"We bought a deal from LivingSocial to go to this museum.  Without this deal i wouldn't hav","useful":0,"cool":0},"madKVRH1Bedb3EhkLpbUHg":{"text":"Over priced for adults, but lots of cool stuff for kids to do. We spent about 2 hours here","useful":0,"cool":0},"pwp-TUOzYCYhZR6vrwGigg":{"text":"Our 11 month old boy loved it.  There's something for every age group.  \nWe were so please","useful":1,"cool":0},"WkkrUCysYnZzOWwRPhGC2g":{"text":"I loved this place as a kid, but was a little underwhelmed when I returned with my niece a","useful":0,"cool":0},"UQO9YgFliuH3X3D-YAY2Sw":{"text":"Omg this is the cutest place ever :) \nMy kids had a BLAST here there was so much to do we ","useful":0,"cool":0},"ryPiOF1uV_upGcKmVocItA":{"text":"The Children's Museum is a great place for kids of all ages. It opened when I was still a ","useful":2,"cool":2},"HiiL9nHyr5SbLtle9Miruw":{"text":"Fun place to bring the kids. The only bad thing is you are in your own for parking. There ","useful":0,"cool":0},"wE7btyGX2QhGjGooKVMh6g":{"text":"What an awesome place for kids!!  Forget Disney World or Disneyland for young ones under 8","useful":0,"cool":0},"8VamZajqAkZDWWIkKOTqtQ":{"text":"It was really nice to have a space enclosed for my 17 month old. The toys were clean and w","useful":0,"cool":0},"yKx0NXTHhDmSjt2CrnJ_SQ":{"text":"Amazing place for kids to explore.\nThey have so many hands on interactions and things to e","useful":0,"cool":0},"Y-9D70oU_XRTP5IOgQ4rgg":{"text":"About a year ago, I attended an event at the Children's Museum that was put on by the YLC ","useful":6,"cool":6},"OaT_1TsUOBLL8wqCr5Wjsw":{"text":"Last time I was there, I couldn't get my mother to leave.  Maybe she's just a retired chil","useful":0,"cool":0},"DOfV3uhpgOjdUDmlxEx6kQ":{"text":"My daughter has been coming to the museum for over 5 years, she is now 8 and still has fun","useful":0,"cool":0},"yCFnXL-XwqN-ZZ1_RchVnQ":{"text":"Man it was so hot in New Orleans, but this was a good treat.  We walked it from the Drury ","useful":0,"cool":1},"WlhRRubgQakF6VNZWGf4aA":{"text":"Wonderful space for little imaginations to explore. Lots of activities for little ones lik","useful":0,"cool":0},"6n3Svscjv0-9oIcDjcA-YQ":{"text":"This is one of the best places for kids in New Orleans! \n\nThey have several themed play ar","useful":3,"cool":1},"q2dJHYkR1qKgETKiDr49rw":{"text":"We're from out of town and so happy we found this museum for our daughter. It was fun she ","useful":0,"cool":1},"pUU1Q1Td6uYcaqBLs3BNzg":{"text":"Ok so to be fair I went to an amazing children's museum in St. Louis this summer that may ","useful":0,"cool":0},"whX9meQDxOSlrBUZs3SFqQ":{"text":"Over priced for adults, but lots of cool stuff for kids to do. We spent a few hours here a","useful":0,"cool":0},"_ddaMrPOmDGcakyZJfx5Hg":{"text":"My 3-year-old absolutely adores this museum... we like to head to Toddler Time at 10:30 Tu","useful":4,"cool":0},"U0j7q8paVu9_Jh5wUyKZ1w":{"text":"Went with elementary age kids: girl 8 yrs, boy 5 yrs. We filled a good 1 1/2 hrs full of t","useful":0,"cool":0},"-LKWxIYNh2j2G2XibpAjGQ":{"text":"Sun LOVES going. Beats a path to the grocery store first thing every time. Then enjoys the","useful":2,"cool":2},"r5zvFx4mDf1FbvskVsdvNg":{"text":"Pos: This place = awesome! We spent the first 45 mins on the first level. Then upstairs wa","useful":0,"cool":0},"rH8pT54fN5jnAc2rddMekg":{"text":"Great for kids of all ages!  We brought our 2.5 year-old and 6 month-old.  Lots of interac","useful":0,"cool":0},"Q4Rv7-kT6kTdmZ2CGlxhUA":{"text":"if you have a kid and you live in New Orleans you have to take them here at some point. I ","useful":2,"cool":1},"9oP0z8eHL3VwqrgDWNex4Q":{"text":"I absolutely loved it I loved the first adventures area because it was blocked off from ev","useful":0,"cool":0},"5pB4-GkyoQ8JbDd32TePxg":{"text":"The museum of my childhood, I love the exhibits! I remember that they used to have this ro","useful":1,"cool":0},"S1E5tmHFIQnxAOIVydx30w":{"text":"You don't even need to bring a child with you to have a blast here. But BOY is it fun to f","useful":0,"cool":0},"PHVOWFYoGzhq9TaXJ1bf4A":{"text":"Really a lovely time at the Museum, lots to do and lots of space. My daughter had a blast ","useful":0,"cool":0},"4rf3uguJGuwmRk099905xA":{"text":"Came at opening on a holiday Wednesday and hung out a bit with the 9 yr. old. I would say ","useful":0,"cool":1},"eTkFPNTPKR9Q1lAobpKu-Q":{"text":"Lousiana Children's Museum is amazing!  I was given an opportunity to volunteer there thro","useful":0,"cool":1},"82nObj_ShUQv8eZic74yeA":{"text":"My 2.5 year old son had a great time here. He didn't want to leave. The place was well tho","useful":0,"cool":0},"0XDHw2XawoFSI3dJBzTJXw":{"text":"My little brother, a native new orlean-ean, always wanted to visit so we killed an afterno","useful":1,"cool":0},"l703qNLUq_6H3gpMtisIHw":{"text":"Who knew I would've already visited 3 children's museum this year, and it was my first tim","useful":0,"cool":0},"K2G3rBkzDnk1IIinQXaoyg":{"text":"In town visiting my grandson (and his folks, of course) and wanted to find something diffe","useful":0,"cool":0},"akxCiG6KWuFp7i-BE6xegA":{"text":"I wish I could give more stars - this museum is fantastic! Everywhere you turn, there's a ","useful":0,"cool":0},"sGIkAHCYtgCvPRND2TvUNA":{"text":"Really much bigger than you think and quite fun for all ages. Could spend literally all da","useful":0,"cool":0},"_X-ej1qznFiq-pOLQ0KR8Q":{"text":"Wonderful place to bring children. Great exhibits that my 3yo and 18m old could enjoy. Had","useful":1,"cool":0},"JzYZzyWPURoAaa1XbVCc7w":{"text":"When I first walked in I said to myself \"oh lord I'm gonna hear lots of I wanna go home\". ","useful":3,"cool":2},"LMHSJDFBi4ClCRlGBTDBeA":{"text":"Great place to hang out on a hot day. Plenty of activities for all ages. The water table a","useful":0,"cool":0},"p0fOX1VZHs65wA_XJzPBbQ":{"text":"My only regret is that we didn't have more time to spend here. If we lived nearby we would","useful":4,"cool":1},"1E91QI5s6DeSXMCVCfwHmw":{"text":"When we went, this place was quite unclean (just accumulated grime) and everything seemed ","useful":1,"cool":0},"UQDI16VfoQ-iG-fFvldRqw":{"text":"Visited here on a brief long weekend trip in september.  I cannot rave enough about how fu","useful":0,"cool":0},"aU5niJCdB4GRra7HET_v4Q":{"text":"My children had a blast here. It had a lot of activities spread out throughout the entire ","useful":0,"cool":0},"Z-7tGtoyLqPy2y2esYfTTw":{"text":"My husband and I have taken our daughter to many children's museums and this one was very ","useful":0,"cool":1},"6qJQs2UqbV5kmh8fiWgH0w":{"text":"I love supporting Children's Museums and was happy to come check out this one on our vacat","useful":0,"cool":0},"nvlajRSzV5UKNWr2EEfg3g":{"text":"Really can not even rate the museme because we didnt even make it in. After waiting half a","useful":2,"cool":0},"6g9vHGxrtRD61H2JNyKRPw":{"text":"Great adventure for you & the children.\n\nWorth doing at least once. Make sure to do story ","useful":3,"cool":2},"uKRsLRgDqaG-h5URkX5gtg":{"text":"I used to come to the Children's Museum all the time when I would come visit my grandparen","useful":3,"cool":5},"chlfF8rhPUR8FAFHPMDKmA":{"text":"Childhood memories love it can't wait to take my 10 month old! Fun, safe family activity! ","useful":0,"cool":0},"fIPtd9sn7k-p6m1916O-7Q":{"text":"Everywhere we go, we make a stop at the Children's Museum for our daughter who has a great","useful":1,"cool":0},"__FQvtq_B4QQciqPSev5uA":{"text":"Talk about revamped and resized compared to the old location! This place definitely brings","useful":0,"cool":0},"GL0pqWbT-meq5TPPqxbD1g":{"text":"Right away, walking up this museum looks incredible! Coming from the parking lot you can s","useful":0,"cool":0},"863z1wiUAyK7vU3MZ2B7UA":{"text":"Although I'm not a kid, but the height of one, nor do I have any kids I still have been he","useful":2,"cool":2},"3R7WwyBbCRBufg_3nfiOPQ":{"text":"New design creates a visually appealing building externally, but inside seems to be too cl","useful":2,"cool":0},"56GUwxnDUpF7vJXHbv66Kg":{"text":"Great upgrade from Julia St! Although there is alot of memories at that location the city ","useful":0,"cool":0},"6ATCVfktj34QSzJETzAPBQ":{"text":"Wonderful place, a lot of different things to do with children. There are several differen","useful":1,"cool":0},"cYtjvIUos55oYwK_6M2QAw":{"text":"We took our niece her for her 3rd birthday. She had a blast running around. Upstairs she e","useful":1,"cool":0},"VVMW9a5VFkvCdxAoI8kn4A":{"text":"Went with my daughter and 3 year old granddaughter.  Some \"experiences\" were mostly spacio","useful":1,"cool":0},"hl065BBnZGCNBCQhrD1Dww":{"text":"What a wonderful place for kids! Our toddler can seriously spend the whole day here. We go","useful":0,"cool":0},"GEL3zbqxXLUS90JlnGvjbQ":{"text":"Another place to bring your beloved children, friends and family. Not only does this bring","useful":31,"cool":32},"hL1Feu0ULP6MsKJEk7altw":{"text":"We are loving the new museum!  There is something to do and experience at every turn. My n","useful":8,"cool":7},"nq-yAD3n3XbVklCW5Gf-DA":{"text":"I came during opening week and it was crowded.  My kids loved it but I felt it was too cro","useful":3,"cool":1},"bl0M2H4gBcqZdOrK_xgRQw":{"text":"Me and my 2.5 year old love this place! The new location is awesome and very spacious. I'm","useful":8,"cool":9},"39RB3PbSrLnvBN8AeIOHLA":{"text":"Love this place!!! My son went crazy here!!! Didn't even acknowledge me!! The staff was ve","useful":4,"cool":0},"JRaNbx7rS4d3ttDpJGZ7Sg":{"text":"I can only speak on behalf of my son.so he says that this place is five stars all the way!","useful":5,"cool":2},"5gmrjWJhU-cTs_V7MzCNMA":{"text":"This is best place to take your Kids to and play, explore, interact, discover!!!! Make sur","useful":0,"cool":0},"R_4FSCnVbCl5O0BY-zZuYQ":{"text":"I will start by saying that the museum is beautiful and modern! The park setting is gorgeo","useful":0,"cool":0},"Z_rSXd_oEHX6lUCRJpCFXg":{"text":"We had a great experience for my daughter's birthday. It was a little difficult to reach s","useful":1,"cool":2},"57vS5Wqz5W9zrLrwKpayQw":{"text":"Now this is a true children's museum! The whole place is dedicated to children and their l","useful":1,"cool":2},"kAYHzqwuQLEpthjujmwqnQ":{"text":"Place looks bright and clean. Nice clean restrooms and hand sanitizer stationed each area.","useful":2,"cool":0},"YKKsh8s20HEQtdCDiuISBw":{"text":"My 2 years old nephew and 14 years old loves this place. It's a fun, learning educational ","useful":2,"cool":2},"6ScPgpJ0WTHQI0o0NwiQbg":{"text":"Wish I could give the new museum more stars! Right now, during the opening month - they ar","useful":1,"cool":1},"H-_TJZ4AbIPryJ9unhlDcw":{"text":"Ok, I'm going to admit that I have been there with my nieces and also without them!  Don't","useful":2,"cool":2},"A8J0o5TvawaZkqBh997PGA":{"text":"I love the children's museum and this was my first visit since they moved to city park. We","useful":2,"cool":2},"WIWtfCBFFeDZ-tH0fHjWEw":{"text":"Great experience but they still stuff it full of kids. You still have to schedule you visi","useful":1,"cool":0},"7837-BEjKzedwAGPYKjnWA":{"text":"I honestly love the revamp of the new location of  the Children Museum. However, I Can't h","useful":3,"cool":1},"lUoOj9opQUtr4cQqZsxuyg":{"text":"This museum shames ours in Charleston.  It's got two full levels of many different activit","useful":0,"cool":0},"psHhQ1CdZ0fubdMdBtrttA":{"text":"I haven't been to the La Children's museum since I was a kid during my field trip in eleme","useful":5,"cool":3}}