{"ZT4gH09fgvmAfjNkRgbU-Q":{"text":"Baked Brie and gumbo pizza were delicious. Roasted Brussels sprouts were a bit mushy, thou","useful":0,"cool":0},"nSqu6n5uicVvSvLRqnDSuw":{"text":"I love the vibe of this restaurant  The drinks were well crafted. The food... the food. We","useful":0,"cool":0},"2FSdVA4sLEMrm3HhOlVHWQ":{"text":"More fresh juices than the typical speakeasy-esque place.  Good mix of alcohols that peopl","useful":0,"cool":0},"IDVtlBTn3v2PaL5hH5aNcA":{"text":"THIS WAS LITERALLY ONE OF THE MOST HORRIBLE MOST BIZARRE EXPERIENCES OF MY LIFE. \n\nI went ","useful":9,"cool":1},"DYWSYvOCQvw9ZojF5YGSFw":{"text":"Truffle popcorn, baked Brie were great! Surprisingly the pizzas were fantastic - super cri","useful":1,"cool":1},"mjzLVTp2yzMgTFLg6NhMEA":{"text":"Loved this place! The server we had was so fun! She had a fantastic bubbly personality and","useful":0,"cool":0},"XXCVHpEvarljZnqA4E2FmA":{"text":"This place has it all! The cocktails are extensive and unique. The food is amazing (LOVE t","useful":0,"cool":0},"UK8EbCue4b3utIpSfpaJtg":{"text":"The bar is great. we went on a friday night and it was not too crowed very laid back envir","useful":0,"cool":0},"9LH8sKRqQLS8lzPgV4jS6A":{"text":"Drinks and service were really good!  The food (we had the lettuce wraps) were very tasty ","useful":0,"cool":0},"UHUXa_FH_VgopVHWvg4LRw":{"text":"Hadn't heard of this place till my boyfriend surprised me last weekend and mentioned we sh","useful":3,"cool":3},"1n_QDHmiLDYqKY37vtcOsA":{"text":"This place was everything that I wanted it to be.\n\nIt was chill, welcoming with an attenti","useful":2,"cool":1},"NVRC256M6uuaSpnd6xQkEA":{"text":"Victory is a perfect example of the power of Yelp.  There is no way we would have ventured","useful":2,"cool":1},"ceEpXHsLFm8m9JEAoLtWvw":{"text":"One of my fav spots in Nola. Offered a free drink sample of the drink of the day ( run car","useful":0,"cool":0},"0d9QjHwKtYQeUx03nFJamg":{"text":"We went to Victory tonight with a large group. My friend's card was swiped several times f","useful":4,"cool":1},"8YnW2BV4OZz2Yf_AmJQNQA":{"text":"I've found my new lounge. Fairly priced drinks, good atmosphere, with good looking women. ","useful":0,"cool":0},"KeU3b6Fs7tSPqzfi54vYxw":{"text":"Mixologists extrordinaire. We went here based on Yelp reviews, and loved the place. The ca","useful":1,"cool":1},"3bvVsJTgxfJ3aNuAgLQDGA":{"text":"Struggling with this review!  I had to give 3 stars instead of 4 because of the service.  ","useful":1,"cool":1},"T3dbxEMwTc6lzhhymTtdqA":{"text":"Found this place first night right after we got to the airbnb. The cocktails were really g","useful":0,"cool":0},"VvixfsIEcVlQzKi0LFODOA":{"text":"We loved this quaint little place tonight! We had a huge lunch so when dinner time came ar","useful":0,"cool":0},"Zb2yPkknzOjwiI1d5edsXw":{"text":"Was completely dead when I was there however was Sunday night. Cocktails were really good!","useful":1,"cool":0},"fE3w1HkjUj-jh31t8qbj9w":{"text":"Eating with half veg, half meat-eater, three-quarters drinkers and one non-drinker is toug","useful":0,"cool":0},"1WugxN9O1KIq8RF6J10iow":{"text":"I always enjoy this place. They have great craft cocktails. The free sample of the drink o","useful":1,"cool":1},"Z17NseWfynBSNYDarbVPDg":{"text":"Great service. The ambiance is relaxed in a sexy kind of way. The menu is short and appeal","useful":2,"cool":0},"qTNySX9go3NdP8TTBw2s2w":{"text":"We held a networking meeting here for about 100 people. The owners and staff went out of t","useful":0,"cool":0},"QonbFoscZvnWaJg1RRachw":{"text":"Best cocktails in town. A whole menu of signature cocktails to choose from.  What other ba","useful":0,"cool":0},"CUR5n-NQ2ODPLxGI3GsyCA":{"text":"As a big fan of inventive cocktails, I was delighted with my experience at Victory.  If yo","useful":2,"cool":1},"lMOyM3M6ygARnWCA1bl-8g":{"text":"Excellent service. Fantastic drinks. Good ambiance. The food was good too! Non smoking env","useful":0,"cool":0},"TZfh76-FbtXMJGtyZrB8NQ":{"text":"This is I'm the top 3 craft cocktail bars I've been to, and I've been to quite a few. Drin","useful":0,"cool":0},"jqOlNCFJr2nu8-NTjNHe6g":{"text":"This place is awsome they have a green chartruese machine. They have an awsome cocktail me","useful":0,"cool":0},"nh5KaxlPhbQ1tnhIpTsUHA":{"text":"The free daily cocktail is a nice little touch.  It is just a few sips of something but it","useful":0,"cool":0},"qIEHvHI-MSg1QI8zCwgZRQ":{"text":"Slowest place for a pizza!!!   Don't go unless you want to wait for at least 1 hour for ju","useful":0,"cool":0},"m4zr1FO-AL1N68WeeNFYJA":{"text":"Victory is what many New Orleans bars wish they were. The cocktails are great. The ambianc","useful":0,"cool":0},"rIfcnyjrM7ByVkCwEGTLSA":{"text":"Victory wasn't too bad, but after waiting a while to check this place out, I was left unim","useful":3,"cool":0},"SH9k6EsFnGKX2ap5SBdt1Q":{"text":"The server was very knowledgeable and very attentive! The food was delicious! We had the B","useful":1,"cool":0},"ZoAWWrCNJZ5tKUvxMLuqwA":{"text":"One of my favorite craft cocktail places in the city.  Must check it out!  Awesome vine, c","useful":0,"cool":0},"y_TmiNkNJnncYZMNuv2Htw":{"text":"Found this convenient place on yelp when searching for \"best drink\" in New Orleans. We sto","useful":0,"cool":1},"yex_1d8l0x-Xqg5d5Mmetg":{"text":"Friendly staff, good space, tough to spot, so look for their \"Victory\" welcome mat.\n\nExcel","useful":0,"cool":0},"_uwFdJSMrP9_zACJri49tA":{"text":"I love this place! I'm here way more than I should be, but I love the atmosphere. The bart","useful":0,"cool":0},"8Truf3BVfvpIhGjiN-RYfg":{"text":"I wanted to head over here for quite a while, but I think your experience depends on who i","useful":7,"cool":2},"g0bEsE4zu_Oeb84I-WgF_A":{"text":"Great place: relaxed atmosphere, interesting and engaging staff, tasty appetizers, and a g","useful":2,"cool":1},"VUl6toa_cZuL0W0Rbo2OTw":{"text":"Knowledgeable bartenders and good food. Stopped here after a concert for the baked Brie bu","useful":0,"cool":0},"4cmJKg2slY-g7BDXqspIIQ":{"text":"Did not live up to the Yelp hype. Came in to watch the Saints vs Panthers and left with a ","useful":0,"cool":0},"IchuzeCn44gSBpPiW31B4g":{"text":"Went here last night and had the best pizza I've ever had! Great service and felt like I w","useful":0,"cool":0},"R7fiev8yJA4XREZf-SbDsw":{"text":"We rolled in quite famished from a long drive and were a little disappointed in the person","useful":1,"cool":1},"oE2yfv_4zT7Vco23xIFJZg":{"text":"Nice late night dive bar with delicious food options.  Friendly staff.  Could expand on th","useful":1,"cool":1},"rjJLL7k6itj9KEQddJMEWw":{"text":"Victory makes some of the better cocktails that I have tasted before. The drink quality is","useful":0,"cool":0},"kVR8cA15zUZ2RFcGth4GBQ":{"text":"The food was fantastic, the service suburb, and atmosphere very fun! The small plates make","useful":1,"cool":0},"5oPugFEsHpCvOux_uz-Ldg":{"text":"i went here last night. its a really cute spot the design scheme was alot of black and red","useful":5,"cool":4},"NfR-4CM6My5BWbBLhAzsrQ":{"text":"Amazing cocktails and the best bartenders around. The daily cocktail is great, and you'll ","useful":1,"cool":1},"lrkwcgvnHKaVXcUGg7kAGQ":{"text":"We showed up at like 1:30 am on a Thursday and the place had cleared out, and they still l","useful":0,"cool":2},"n8MvU6RkKX6Gz1ju3C5U7w":{"text":"Great atmosphere and awesome cocktails. Food was ok but only had the scallops (cooked to p","useful":0,"cool":0},"FPXYDvc1bd7NUA157r1Q1w":{"text":"Classy, relaxing, delicious food, beautiful drinks, great environment and people. One of m","useful":0,"cool":1},"bO-n_qDIS3ns4-bhlrtIAQ":{"text":"Great \"grown and sexy\" spot! Great location for after work cocktails, lots of business cas","useful":0,"cool":0},"SPmXTYWZfqWJFaW9Wk_HWQ":{"text":"Not a place to go to for dinner or a meal even. Pizzas are one size and small. Extremely l","useful":0,"cool":0},"0slIlsTTLz_G97QtB_jvNQ":{"text":"While I love craft cocktails, I can't deal with the pretentious nature that surrounds so m","useful":5,"cool":3},"DS3EIYLcyWmWEuGVgD9Cyg":{"text":"Upscale place in the CBD with and understated exterior but comfortable decor, friendly ser","useful":0,"cool":0},"fS2YcODO-ynKlCOmY_IKYA":{"text":"I arbitrarily, accidentally stumbled upon victory and I am more than glad I did. Although ","useful":0,"cool":0},"I5PCreCsS7KoxtPysY5Wfg":{"text":"This place is incredible. From the drinks to the food to the bartenders this place is the ","useful":1,"cool":1},"0II9t-R5GdecCGB0HG9HbQ":{"text":"We weren't quite ready to end the night so we stopped in here for a drink before heading b","useful":0,"cool":0},"uwP-U9aflASXX1Bh1WlwGg":{"text":"It's been a while since I have been to a bar that the bartender knew what they were doing,","useful":0,"cool":0},"Q_NkFYRkIdRNBp2OBM1YDA":{"text":"This was a really great place to go with a group for drinks and a light meal / snacks.  Th","useful":1,"cool":0},"ctUWam4YFdVkZoWUHbPYag":{"text":"Service is poor and slow. Staff is incredibly rude. I give places 3 chances and this one h","useful":0,"cool":0},"udEkUs5kmjhmb-DuY3a4AQ":{"text":"Got the Creole pizza with \"Blood and smoke\" cocktails. Highly recommend all around for the","useful":1,"cool":1},"GaQbpvNfhseKje70HERKIg":{"text":"I must begin this review by saying that I am in no way, shape, or form a cocktail snob. I ","useful":9,"cool":8},"iizceJuDB1quIqoldAOvOA":{"text":"For a quiet little lounge outside of Bourbon St,, I enjoyed how cozy, calm, and quiet it w","useful":4,"cool":3},"Rp39IhTOizvhV88AtMIemA":{"text":"If you want a kickass cocktail go here.  The drinks are artistic creations with locally so","useful":0,"cool":0},"2nHP5XrfUDwPLMA48oM_Fg":{"text":"Fun bar with great drinks. The bartenders are mixologists but still have the down to earth","useful":1,"cool":1},"QAB358sV00ZUXu4cLn9usQ":{"text":"Great little place. Good batch made cocktails. Food was simple but tasty. Caught them at h","useful":0,"cool":0},"7nXiBEUNh4yGqGpB4J1TjA":{"text":"What a great find! They start you off with the cocktail of the day and it only gets better","useful":0,"cool":0},"TRdJKInH23dwZIqCkUxaYg":{"text":"What an amazing surprise. Came in late (11:30 PM) looking for decent food and a good cockt","useful":0,"cool":0},"f2Tgu-JG8IPIYJjLGTLn5g":{"text":"Nice place for late night drink and food. Mellow atmosphere and friendly staff. Try Cajun ","useful":0,"cool":0},"sJ91tdr_5_c-ChqfWOfTgA":{"text":"Victory is the place to be when you feel like going out. At the very least just drop by fo","useful":19,"cool":17},"T8iePwHKaB_XhXps2nv9mQ":{"text":"Rock and Roll, this place is awesome. The staff is beyond best of the best; these guys rea","useful":3,"cool":2},"2XpYtlFTpS16Al7qyU7OkA":{"text":"My suggestion would be to avoid ordering food items and stick to the cocktail menu.  \n\nThe","useful":6,"cool":3},"tVwTfXEWDH7XZlmvlWMG7A":{"text":"I was really amped to go here. It was not exactly what I expected, but the service was goo","useful":2,"cool":1},"co4EN-fdl7KYD0XGz-n58g":{"text":"Was excited about because of high ratings, but I was disappointed. Went after work around ","useful":0,"cool":0},"aaLbkj69oIrcK8Me27DDdA":{"text":"If you want a GREAT drink you need to go to Victory. The bartender is incredible and the d","useful":0,"cool":0},"QvqTHPBfvEjM57N2_TtVKA":{"text":"Great Place and will always be a stop when we are in New Orleans! The staff is knowledgeab","useful":0,"cool":0},"kB-n2anjaIkP2CA2PDniDw":{"text":"This place was fantastic, mixologists are on point and they greet you upon sitting at the ","useful":0,"cool":1},"GNSGtXY9hnLPPQIhVPzrUg":{"text":"So, so, so good. The scallops made me want to pass out. And their drinks are fabulous!! Yo","useful":2,"cool":0},"eJGbx36j_A-Lp9BbFR-I9g":{"text":"Korean BBQ was delicious;  reminded me of Korea. Satay and bacon wrapped scallops were goo","useful":0,"cool":0},"8tRYRa8ZumwZxK9Nc6eQWw":{"text":"This is one of my favorite bars in New Orleans. I've been here numerous times usually on S","useful":0,"cool":0},"1ZC3Ixpoaw2sAu6lEndFwg":{"text":"Had the Cajun pizza which was awesome along with the truffle popcorn and it was more than ","useful":0,"cool":1},"72tHh7NPT7qyI6GZomKPqA":{"text":"For all the reputation that New Orleans has about being the home of the cocktail, it's sur","useful":1,"cool":0},"aHH7kxXOkHnnPVxVvAcQOw":{"text":"Awesome spot, great drinks, friendly staff and yummy truffle popcorn! Highly recommended..","useful":3,"cool":3},"hi1fQv6mckCPChKm1blTDw":{"text":"You may miss it as you walk down Baronne but it's worth the turnaround. Tribe Called Quest","useful":0,"cool":0},"yaLG0zoDXLmV4iFL_xol5Q":{"text":"This is my absolute favorite bar in New Orleans. A mix of perfect classic cocktails and am","useful":0,"cool":0},"hsTHztNU4Sr59_73wa99qg":{"text":"The Australian guy who works behind the bar is rad.  Everyone else is pretty cool as well.","useful":0,"cool":0},"M_CKgm9rXRJYI2kf8HVGoA":{"text":"I love this place! Very good food and drinks. The atmosphere is very nice and the owner Da","useful":0,"cool":1},"uU6WXkl2XY0a23QRqm4H5A":{"text":"This is, hands down, the coolest and best bar ever. It looks like a swanky NYC bar, but no","useful":1,"cool":1},"fLxB1_H3kBx3dRrgmT11ZA":{"text":"This was a great bar. We stayed at the holiday inn superdome ( don't ask, company party) a","useful":0,"cool":0},"o5J0q97V5ha6O7KIzds-_Q":{"text":"I'm sorry it feels like Monday, I'm sorry that your mixing glass stuck to your shaker, and","useful":2,"cool":0},"0nkrevQTo1juaQnceeESyg":{"text":"Fantastic drinks! We went here expecting just to stop in real quick before going somewhere","useful":2,"cool":2},"rINDeCF4SmaSVlmYjgxjZw":{"text":"Such a fabulous little place...  a small modernized lounge with amazing artwork of sexy wo","useful":1,"cool":1},"4i-ZMFs54rN3dz-WHq2RCg":{"text":"We decided to try this spot one night during Jazzfest hoping to make it a quick bite befor","useful":0,"cool":0},"denI5QpgYbKFqLfxZBswHQ":{"text":"Amazing. Baked Brie, bacon wrapped scallops, Korean BBQ wraps, everything. Nothing disappo","useful":0,"cool":0},"kRPrPdXOGuYIFIFTzhH6og":{"text":"Wife and I stopped by Victory last night after hearing about it on Nola.Com and by the tim","useful":2,"cool":1},"rseQJZy7eJJMAdcLKncGpA":{"text":"Great/happening spot. We were visiting from the Philadelphia area and went here only becau","useful":0,"cool":0},"NZTvu5rHbiU-rv5_oK5zDQ":{"text":"Best place to grab lunch while here in New Orleans, not sure about the music, wish it coul","useful":0,"cool":1},"O4syZRYPLU4hRd8Du9INvQ":{"text":"Bartender who wore a hat. He's very Un-attending. I truly don't understand all the high re","useful":2,"cool":0},"Nv6rdMTpYgonrkiXWyynXA":{"text":"Awesome and chic you should def visit victory. I was pleasantly surprised to see an extrem","useful":0,"cool":0},"2iCD_USx6_UMi5IeTT0WdQ":{"text":"Great atmosphere... I love the leather couches to hang out on and great music. They gave u","useful":0,"cool":1},"knpqPe8C0Jxoh4mQ1hGn4w":{"text":"We went to Victory at 10pm on a Tuesday and met the best waitress of all time, Elle! She g","useful":0,"cool":0},"OFIUhf8ECOC14AbU0JNgkA":{"text":"If your looking for a nice lounge with excellent  drinks this is your place! The staff her","useful":0,"cool":0},"N5SN3h-OMz-uAZxYRaM0qw":{"text":"Incredible experience...great good, great drinks and even better service! Atmosphere was u","useful":0,"cool":0},"4NAgVnSHRV7iO_sVd0n_zw":{"text":"After over a year of bimonthly trips to the CBD, and weary of the Sazerac, it has become i","useful":0,"cool":0},"dzngAHS1oVvoHXkMMlLd-Q":{"text":"Truly a locals joint, that I was lucky enough to stumble upon while on vacation. The barte","useful":1,"cool":0},"knIOUp3kO71TUVZe2DtjSA":{"text":"Victory is cool,  I like where they're trying to go with the dimmed, pseudo - seductive li","useful":2,"cool":1},"8CRx1LnXLmsJadkcfvrKqA":{"text":"Stopping by Victory early on a Saturday night was definitely one of the highlights of my r","useful":1,"cool":2},"dWbBykJtpuYDnedb-nmjyA":{"text":"I used to really love this place....about a year or so ago. But within the past year, it h","useful":7,"cool":0},"3VRi6FB4cPvSu3gPTTN4eg":{"text":"Very nice, chill, laid back type of lounge to hang out at and converse with a few friends.","useful":0,"cool":0},"eJzVAqPEiwwKB4QZeLm5GA":{"text":"What an amazing surprise. Came in late (11:30 PM) looking for decent food and a good cockt","useful":0,"cool":0},"4kxRnCEXZeX1Rqi2qnfwiA":{"text":"This neighborhood bar is a great place to go when you don't want to deal with tourists. I ","useful":1,"cool":0},"rJ4fUXz1sv12pQBqk-TAMw":{"text":"Love love love this place!  Great service and great food!  Try everything on the menu.... ","useful":1,"cool":0},"DSRQD3gzLcGmFSS0U8nELw":{"text":"This bar was dead when we went and they just said it was an off night so there wasn't much","useful":1,"cool":0},"uy0wVQU4nNLI1QKAg0zoEw":{"text":"Cheersssss! \nI love this spot. Definitely a few steps up from our typical Dive-Bars. Local","useful":5,"cool":2},"DKxdO3neQ8SAhvUTZWKomw":{"text":"Chicago '71. Try it. I'm from Vegas and this is one of the best mixologist-ism I've experi","useful":1,"cool":1},"38WdDAwfSDQoYXcCqBHTuQ":{"text":"This place is an alcoholic's playground.  The same night I flew in, my friend took me here","useful":0,"cool":0},"_wzIfxStaaC0GnorTGIdUg":{"text":"Found this gem on Yelp.  Our luck they had the game on.  Ambiance, very chill. Food was re","useful":0,"cool":0},"YpLEAC8oClinIAa2sb7UGQ":{"text":"Turned off immediately by the service. We planned to get a drink and appetizer but after b","useful":0,"cool":0},"LECE3NYl_RwK1ZboPYiCyw":{"text":"We had a great time at Victory. The food and drink were great, staff was friendly too;)","useful":0,"cool":0},"-j1gX-XFbt5IEJtDy3971A":{"text":"These people are fantastic. Daniel's personality, Camille's hospitality, the bartender and","useful":0,"cool":0},"a56rHyulEM4dHGKmiA56CA":{"text":"Love the mood-playing jazz and tunes, got here right as they opened. Gave me a on the hous","useful":0,"cool":0},"ulyhqH24B5_gWgF4eiHsAQ":{"text":"One of the best place I went to in New Orleans. The environment is chill, but the food and","useful":7,"cool":4},"LvBZqVHWsnamazM4BNszLg":{"text":"Cool chill spot outside the bedlam of Bourbon street. Truffle popcorn and baked Brie were ","useful":0,"cool":0},"l25JJ0pEi8Lgc3n3FM5K2g":{"text":"New VIP room! Lets just say your whole life will be transformed after sipping an amazingly","useful":3,"cool":3},"y3wvJLSIC2qYK4w5LIWSLw":{"text":"Fun fact: I love alcohol... Especially when it is in a well crafted cocktail. \n\nFrom that ","useful":4,"cool":2},"lijC0oZbWmkprn7tN91Ilw":{"text":"This place is an excellent stop. It has a very relaxing atmosphere, which makes it a reall","useful":1,"cool":1},"9Yd2I1227UXcyMppI4o68A":{"text":"This bar is a must when visiting New Orleans. Great Service, Drinks, and the Food is delic","useful":0,"cool":0},"1TlEXPkpNIFm1nTlNwRAdg":{"text":"The drinks were well made, food was good. Atmosphere and service spot on. We just wanted s","useful":0,"cool":0},"CcZreAb_Y5sRXo0hu2IGqg":{"text":"I had never heard of this place, but I'm glad my friend recommended it. We sat in one of t","useful":0,"cool":0},"vZyqIl83mhy-NdRVNDK40Q":{"text":"I came here during my first long overdue trip to New Orleans and I have to say, it was one","useful":0,"cool":1},"mfdlJYDUPPxQUChzCVKInA":{"text":"We tried this place our first night in New Orleans because of the Yelp reviews. The review","useful":2,"cool":0},"myOoVirbKSniv1dceMD7gw":{"text":"Nice trendy change if pace place. \nLots of hipsters hanging out, decent art on the walls a","useful":1,"cool":0},"AeVnbFhngeCgGS9908xwiw":{"text":"stopped in here after the Hermes and Morpheus parade this time i had a Watermelon caipirin","useful":4,"cool":1},"bLEv3YDi25ZYFpAo2thVxA":{"text":"I have been back here a bunch of times since my first review and I feel as if I have gotte","useful":7,"cool":3},"1YWFcwzMx6MSCnEHpXmW_g":{"text":"Nice ambiance. Lousy service. Four people in the bar; three staff; I waited 10 minutes (pa","useful":1,"cool":0},"7-3rRcNXXrdd3RP6PiksIQ":{"text":"The best nice bar in New Orleans!  Very nice atmosphere, and great cocktails!  Bartenders ","useful":1,"cool":1},"u9z5H2pOvCTjBDMh0v5lQA":{"text":"Nice chill lounge.. They offered us a complimentary cocktail of the day, which was very re","useful":0,"cool":0},"dyrUwSk365GegQd4v5JQgA":{"text":"Anytime you walk in to a bar and they offer you a freebie called the \"daily house special\"","useful":0,"cool":0},"tSxZ0rTjgXg_2vgsFTZ8kg":{"text":"Black owned bar/lounge! I visited here per the recommendation of a lady I met while visiti","useful":0,"cool":0},"ZhXtoGTd1i0A-9mQyyXIng":{"text":"Had dinner and drinks here with a friend. Meal and cocktails were pretty good. But the ser","useful":0,"cool":0},"m0JH0ywkX3xo37af1hDn4A":{"text":"Big fan of this place.  Definitely one of my new fave hang outs.  Cocktails are delish exc","useful":2,"cool":1},"sbk5vyavXHZH4OMVK6htyg":{"text":"I have been to Victory twice now and it is quickly becoming one of my favorite bars in the","useful":0,"cool":0},"DiwKn_tovVJ7V0sQNWfmEw":{"text":"First of all, I have to say this: damn, why do people have to be so rude and disgusting?! ","useful":4,"cool":5},"BmRhS25ytKRholNWc_E2gg":{"text":"Stopped in since we were starving and were meeting friends for dinner near by in a couple ","useful":0,"cool":0},"UfIZWTxraAfbPRdwSzddow":{"text":"In a city full of bars and lounges, NOLA's Victory is unique. If you enjoy really good, st","useful":0,"cool":0},"mi1WV_3MH0PwcMU1m_7pPA":{"text":"Victory made the best Old Fashioned I had in New Orleans. Good crowd, would recommend for ","useful":0,"cool":0},"aIYsH9ldto0Z6JGG8Bx4wg":{"text":"I came here with some friends for some after dinner drinks last night and was very impress","useful":5,"cool":3},"NbHc7gVFKQ7d4f96c3Vf7w":{"text":"After all of these years it is STILL my go to. Want a night out but have no one to go with","useful":5,"cool":3},"3NKfK4QQUm4Cnfyya2npWA":{"text":"My spot!!!\n\nSam is awesome!!! I 've been going to victory for some time. Yes I'm just deci","useful":4,"cool":2},"I7VgA2q9PuofJSJR2MH6lQ":{"text":"Ahhhhh what a breath of fresh air.  Located in the heart of the CBD, I've passed here seve","useful":14,"cool":9},"4Z32YTeE7m63r0jbEvdTYQ":{"text":"Dark red walls, low lights, and black leather seating. Sounds a bit like a brothel, eh? Bu","useful":3,"cool":3},"9casH9xqycnla3Z2ei3C9Q":{"text":"Great contemporary bar serving all the classics and some new ones with real bar ice which ","useful":3,"cool":2},"vYXmXY_kFNDS8lseZfeblg":{"text":"I don't even know where to start.... Victory is one of my favorite spots downtown. It's re","useful":5,"cool":2},"p63GjaT2UXGV0jyaA6Tc8Q":{"text":"Cool little Lounge, that I had already bookmarked on Yelp and then later discovered  once ","useful":3,"cool":0},"UsDLvVm8_t3-j3fI1DOJhw":{"text":"After escaping at Clue Carre',  I needed a little libation.  Well, more of a celebratory l","useful":19,"cool":12},"xsPx7auIew4W1X-k3hLhYQ":{"text":"I love this place. I've come here multiple times and can definitively say that it is one o","useful":0,"cool":0},"ZhNG7YgSC7UwuKfePmmgOA":{"text":"Love love love! Once we found out from someone at our hotel this was a black owned establi","useful":4,"cool":2},"fjupbT9YsPoc-HVgUNJRsQ":{"text":"Victory I can't get you outta my head, my head, my head. \n\nMy legs are still sore from dan","useful":9,"cool":11},"Zl6Gk8r8U2ljhAi8yxAVtg":{"text":"Skip this one. We heard great reviews about the bartenders here but the drinks were only o","useful":0,"cool":0},"XCDV9cy8Ta8UyHnZT1XBlQ":{"text":"Delicious baked brie and pretty good, spicy brussels sprouts. Atmosphere is a little odd. ","useful":0,"cool":0},"SGTrfvacmbwMW50eTVrBBw":{"text":"Perfect late night stop menu.  Awesome food.  Learned the art of true Sazerac from the own","useful":0,"cool":0},"WsndMNaBDfewpgeFO-qWsQ":{"text":"Victory is the place to come  when you want a nice intimate setting. The menu selection is","useful":0,"cool":0},"ctlQKlOaTGME-E4oESwIDA":{"text":"We've drank at Victory a handful of times now and always had a good night of it. Initially","useful":2,"cool":1},"7qMzG4FXV-KMGInAJXuf1g":{"text":"After an exciting romp at the Clue Carré where I was in the group of winning escape artist","useful":4,"cool":1},"knAA08VqbgAz4XPrM_XYuw":{"text":"Mellow sexy spot! My best friend and i decided to come here after a long day and it was th","useful":1,"cool":0},"boA3IZY3nhJJcPn-YU9b9Q":{"text":"This review makes me tear up a little, because I wanted to LOVE Victory. I wanted to plan ","useful":7,"cool":2},"dhHqopvEY3qpszPWNVu_LA":{"text":"If you're looking for a place to unwind and just chill while engaging with an entertaining","useful":3,"cool":1},"IMGzJkUAoiggDxY6uGFJLQ":{"text":"My friend and I decided to give this bar a chance and it was a good experience. Love the a","useful":0,"cool":0},"gjL9Fk9CWRUPz9npHdjggQ":{"text":"If Del the bartender's hat wasn't enough reason to stay then the amazing daily cocktail sa","useful":3,"cool":1},"CaSCl3j_tXFPhF6qzQciBQ":{"text":"So I had a beet based cocktail here and, yes, it was really weird. No, I'm not sorry I ord","useful":5,"cool":3},"lJsVMFHF4DGJvvbFVd6pxA":{"text":"Stumbled upon this place while looking for a place to eat near my hotel. Great pizza and d","useful":0,"cool":0},"VbxHXPcs-JqDij0vMZOfjQ":{"text":"Great place for original cocktails!  Very friendly staff and the owner is wonderful!  Plea","useful":0,"cool":0},"ZoMUxeUw3eTAjvzKbLlC5g":{"text":"Love this lounge! Laid-back, quaint, off the beaten path, good food, great drinks, mature ","useful":2,"cool":0},"ZixwXnH5H_TauhcWFTjMyg":{"text":"Super fun place. The staff is friendly and the bartenders KNOW how to make a good drink! T","useful":0,"cool":0},"Vfg2_OrBjyVDCx7jphlTtw":{"text":"Honestly, the best mixologist in town and best crafted cocktails in the city! There's even","useful":1,"cool":1},"2tj7d_PR_Hq6K7YOnZWKfA":{"text":"Looking for cocktails, I used Yelp to find this place and glad I did! You would completely","useful":4,"cool":2},"RHRPZhLtlsq6tLt7PwJpOg":{"text":"This place is a gem. Fantastic crafted cocktails, truffle popcorn, creole pizza. Great ser","useful":0,"cool":0},"9pP-JQLtEZ-DsyaRz0cUKQ":{"text":"Such nice staff who gave good recommendations. Delicious appetizers that we split. Great p","useful":0,"cool":0},"MLd7WDHFAShwGL_FSqRwVQ":{"text":"Fully adequate late night stop if you want okay pizza.  You're drunk, so it'll do fine.","useful":0,"cool":0},"3jiRg5890BoMJUil651mYA":{"text":"I was definitely impressed. We went on a Friday and it was really busy, which wasn't what ","useful":2,"cool":1},"jA2LjZoB71sVTeOicXtRYg":{"text":"The first bar that I've ever tried chartreuse. It was over 3 years ago. It was here, that ","useful":0,"cool":0},"mYZ-qOsZCmzQ1dzGMkVFog":{"text":"I've been here only three times and, most recently, for a quick meeting and all I had was ","useful":2,"cool":0},"njNKbZpCfM4OGfagcuOB0A":{"text":"Love this place! Great food, cool atmosphere and drink! With great company= an excellent n","useful":0,"cool":0},"TuvjM4-pyw-y2ZUk-c1oWw":{"text":"I loved the atmosphere here. The sample of their signature drink of the night was a great ","useful":0,"cool":0},"B4DKB6gKkYhHUFc3bEQvBw":{"text":"Not great. It's in a weird part of town. Kind of a dirty, shady spot. Went in 2 hours befo","useful":7,"cool":0},"RoPWOyJnrBVqWHDP4aVUww":{"text":"La la love it! Victory Bar has me shouting \"victory!\" for they seem to have it all: good c","useful":9,"cool":9},"drWjo78pWVcnMcX275iXqA":{"text":"If no stars were possible, Victory would get it. I went with five of my friends and we wer","useful":0,"cool":0},"8sCOgRB_s2nmjkuK9TFepg":{"text":"Which would you rather be greeted with at your table, when being seated; a basket of hard ","useful":0,"cool":0},"YJxsSw0S0haUVRTQeXx-2A":{"text":"Great craft cocktails and a casual atmosphere. Good food and service too!!  Perfect for af","useful":0,"cool":0},"qZaauAGmxlN4BpQzQiONGw":{"text":"Great find! It was packed and obviously under staffed however the service was still impecc","useful":0,"cool":0},"D6yzv9KhZQkdNXfZph7Y4Q":{"text":"Came here after watching a Pelicans basketball game. The drinks were great. Had a dark and","useful":1,"cool":0},"mmM7_gZlIMFBL_T7t1ErYQ":{"text":"When I was here a couple of weeks ago,t I was handed a complimentary mini-version of the c","useful":5,"cool":4},"nB5t6zlEJPfwgv3TKbt8wA":{"text":"We were drawn into Victory Bar by the sign that boasted acclaimed bartenders/mixologists a","useful":3,"cool":1},"OmcenACK8upgPBLqFbnz3w":{"text":"This place could have received 3 or maybe even 4 stars but the service was awful! They sta","useful":3,"cool":0},"ZlD_4NFZ8sGzOBQeCUYbFA":{"text":"Most innovative mixology lounge around!","useful":0,"cool":0},"Cuvci0vE3RoEUgpKIJkykQ":{"text":"Nice place to hang on a Saturday night. Not pretentious or crazy crowded.  Greeted with a ","useful":1,"cool":0},"ZnYNjy5ehz7osA-UhqZSbA":{"text":"My friend and I fell in love with this place. We stumbled upon it one afternoon while walk","useful":2,"cool":1},"8vAGzIs8ygKmcJJy3-77tQ":{"text":"Very nice atmosphere, the bartenders were very knowledgeable.  Got a free sample of the ho","useful":0,"cool":0},"ClpWLiCJocKpDCjwPoZY5Q":{"text":"A person can get simple rum & cokes or hurricanes anywhere, but if you want great-tasting ","useful":0,"cool":0},"iL0Nd2OqteZXbeviw7pbTg":{"text":"This bar had my favorite drinks in New Orleans. It would fit right in in my home town of A","useful":2,"cool":2},"Ae7qNioOw5dhSC4fAVNWwQ":{"text":"Stopped in for a drink on the way to bourbon street. This is a great place to grab a real ","useful":0,"cool":0},"lZf9LEL6GC77K7jZYfB3zA":{"text":"We were in the CBD Sunday afternoon with some time to kill before our ghost tour of the Qu","useful":2,"cool":2},"h_U49PSmr6SdxRj7NGK2ww":{"text":"This place is phenomenal.  Absolutely fantastic.  My friend knew one of the waitresses, so","useful":2,"cool":1},"bItKp3Vx0LGUIdzE0MmFqw":{"text":"Visited here last night for a #NOLAGirlsSpeak event. I've been here several times before a","useful":2,"cool":0},"iOJbdorB6XOvPpoy-Yh9lw":{"text":"A place that understands the art and magic of the cocktail.  Damian took us on a magical j","useful":0,"cool":0},"epjSX2mgTkcqgtDsYiylyg":{"text":"Stopped in early on New Year's Eve because of the positive reviews and it was close to our","useful":0,"cool":0},"l-fUIkB8-l80xBFutVAY1A":{"text":"Easily our favorite bar in New Orleans. Fantastic cocktails, good food, and the best barte","useful":0,"cool":0},"ofwggbX2xx_Dcgqkhh2CcA":{"text":"We wanted to try something unique and this place did not disappoint. Atmosphere was unique","useful":1,"cool":0},"z8XtIqv8izvPr3MbmL_Vlw":{"text":"In town visiting for Essence Music Festival and this place was recommended by our hotel. D","useful":0,"cool":0},"3uhMSWc5jg0AgP87-owIjg":{"text":"Great atmosphere...love the drinks...can't wait to go back!! They offer a drink making cla","useful":0,"cool":0},"3QxdSHqyc8SHIZisYUkEBQ":{"text":"The baked brie was suggested by the waitress and eventhough I have never liked brie before","useful":0,"cool":0},"5aDr3-GR8IAvhDT8Fdz53Q":{"text":"We had some really yummy cocktails here.\n\nThe Dante and Chicago 71 were delicious. The so ","useful":0,"cool":1},"6d0bWm5dfkQayBzre6XB4g":{"text":"Think I many found my Cheers in New Orleans! Love this place from the food to the staff...","useful":1,"cool":0},"OmTxp8Zq6Ja1vAA6KtsOIg":{"text":"Had an excellent time at victory. Excellent bartenders and the food was exactly what I tho","useful":0,"cool":0},"f_N5b1TIm6fcq1GQR5p4Uw":{"text":"I love this place.  I met the owner in Indy and wanted to stop by his bar when I came down","useful":3,"cool":1},"e0UcF_ufdG63r5UAm6fTvA":{"text":"Pretty pleased with the first visit to Victory! My SO and I stopped in for a cocktail befo","useful":2,"cool":0},"xXCE-cn_7Mh2g7cnbmi-Rg":{"text":"Went down to New Orleans this past weekend with some friends from UK! My boyfriend and I n","useful":1,"cool":0},"O1VRuR_ZJWUwgk81qFR2kA":{"text":"Came here for a snack and a few cocktails before our New Year's Eve party. It wasn't crazy","useful":3,"cool":3},"U3d7yVJkC_QAUIpMDIsDIA":{"text":"Victory is definitely a place to stop on a Friday or Saturday night. They always have a co","useful":1,"cool":0},"nsmuJOvOCYKuCKT_VNP6jw":{"text":"Here are the cliff notes if you don't like the reading full sentences:\nPros- Ambience, ser","useful":1,"cool":1},"0Xm9Ki9ZJwljwty1PcnNRg":{"text":"First time in New Orleans, came here for a nightcap, unfortunately found a Rude and lazy b","useful":3,"cool":0},"xgKQk-oBiKZZUg1_8_Tlxg":{"text":"Enjoyed some great beverages here last night!  Great location, friendly service, great dri","useful":1,"cool":2},"BiiXQcj4M7bXJk-5gMq12w":{"text":"It is unusual to find a place making drinks from scratch but that is what you will find at","useful":2,"cool":3},"aYVxzd4z9cz-y7FVckBp0A":{"text":"What happened? \n\nAs much I love this bar.... \nWho decided to change the music? Ummm... \nTh","useful":5,"cool":2},"om8lYMua-M0cgO5Zd3gN6g":{"text":"I am so happy that I stumbled upon this place! I was walking by, and this guy stopped me a","useful":0,"cool":0},"aB1EVvrbREF-FIzT8bOM-w":{"text":"My wife and I spotted this place on yelp and since it was only a few blocks from the hotel","useful":2,"cool":1},"fbSsTi50D1Gq47L1XzHAOQ":{"text":"This one gets 5 stars....comfortable environment. Local and tourist spot. Every time I'm h","useful":0,"cool":1},"--D757eQ6CS0bYHg08IlWg":{"text":"This place is a wonderful gem!  I truly had unique beverage that was bold, flavorful and b","useful":0,"cool":0},"GXMBR5hX_n2Yo9d334104A":{"text":"One of my favorite bars in the city , chill environment ,love the decor. Great drinks even","useful":1,"cool":3},"nUc6TyU5uTwqdt__IFZT1g":{"text":"Fun late night spot with music,food and sections. Good music as well from 90s r&b to trap.","useful":2,"cool":0},"HBZskDnO9ejDkhxqHeyg_w":{"text":"So, not to pleased with this place. Drinks are unique. I'll give them that. The Brussels s","useful":2,"cool":0},"hy7vsa5T1e5bQb7jdXCBHA":{"text":"Not sure what I think of this place or what look it's trying to go for. When you enter the","useful":3,"cool":0},"hDqjRSwMt2r6AFUuE8GMMw":{"text":"Imagine this scenario: When Vivian (Julia Roberts) in Pretty Woman enters a boutique store","useful":5,"cool":1},"LSG9Dys8vLNbjk12VCGtsA":{"text":"Very disappointing. My husband and I were visiting from out of town and decided to try Vic","useful":1,"cool":0},"9r2MyhzFuRd1PQtghyBv6g":{"text":"We stopped in yesterday afternoon before an event.  We had 2 specialty drinks and the caju","useful":1,"cool":1},"apHKKSH5XuS2RqzVnxowQw":{"text":"Unfortunately we won't return but our server was really sweet. We had the tequila hummingb","useful":1,"cool":1},"O7h72fEtinR3y8pPm11mVg":{"text":"The waitress we encountered was the ABSOLUTE worst!!!. I would not go back..we were a part","useful":1,"cool":1},"PeZ26kZlt7QogXAqSUI0Uw":{"text":"I gave it 2 stars because they gave us a sample cocktail. Service wasn't the best nor the ","useful":1,"cool":0},"Kg2Cza3IFMWUSted_Ek7SQ":{"text":"Coming back from Bourbon St, this place was on the way back to my hotel. I heard some good","useful":5,"cool":1},"M45FcTChkJW98gPdyVbCjw":{"text":"What a great bar! Came here from LA to the rams vs saints game! Some locals recommended it","useful":0,"cool":0},"pPP9rx4v_3OFD8HnQJVjKQ":{"text":"Terrible service!! I understand this place is very busy but our party of 10 was not acknow","useful":2,"cool":1},"cACrKN3JQ_q0drr7cwYCtA":{"text":"Stay away! I'm not quite understanding the allure of this place. I visited it during happy","useful":6,"cool":1},"Fce36spnadr2HdF44nVVbg":{"text":"Victory Bar was a pretty cute spot for happy hour.  The venue itself is a little run-down,","useful":2,"cool":1},"-s2ZhpLPZjl1u5avBnKmLg":{"text":"Empty after a Saints game, we were the first ones in. More people followed. Bar tender sta","useful":1,"cool":0},"zQ4O-M9qyHTrYx2YV591pg":{"text":"Pizza is $16. Comes in a large pizza box, open the box and it's like a personal pizza. Ord","useful":1,"cool":0},"PBtgjY0r472x3z-7IJoeVA":{"text":"Great drinks, great service, and great atmosphere!","useful":0,"cool":0},"y0X-n99iMQ3wP3f2RHSXCA":{"text":"I chose this place to meet up with friends before a concert and it was a mistake to say th","useful":1,"cool":1},"SfChW_qi9QohJdD3CImrVQ":{"text":"OMG. Brittany, Jeff and James are the best!!!!!  Drinks are on point, the service is amaze","useful":1,"cool":0},"LMJ9cv5LImkfjd2UjBKHrQ":{"text":"Great little bar with some nice specials. As soon as we walked in and sat down, Damien gre","useful":0,"cool":0},"Y323zoCx1z9DO2shaJ3jYw":{"text":"Came in on a Sunday night with a friend looking to have a few drinks, share some tapas, an","useful":6,"cool":5},"jXtoc0qsuR77gtCvkO9emA":{"text":"Of all places I have been to in New Orleans...this service has been thee ABSOLUTE worse! U","useful":2,"cool":1},"ETVvApQQYXalNG-1lq9meQ":{"text":"Called to confirm kitchen was open and person on phone confirmed. Arrived literally 3minat","useful":1,"cool":0},"1Q90kjBuKxi_dBjWYYvM7A":{"text":"EXTREMELY Rude, Loud, and Obnoxious Bartender. I was barely there for 10 minutes when the ","useful":5,"cool":0},"drq3PeOqe1L6pNGj7Q2Lcw":{"text":"Seems like a pretty chill spot in the CBD.  Decided to stop through on our way out to a la","useful":1,"cool":0},"n_J2nritpAb8thYUus37aA":{"text":"This is a great spot for hand crafted drinks. We came in for dinner and drinks based on ot","useful":1,"cool":0},"djNKS2rpmoXyXOb6Iy1juQ":{"text":"One of the best bars in the downtown area!!\n\nWonderful staff, hidden booths in the back, r","useful":8,"cool":5},"ekpaNR68nIW7AHthCxSVNg":{"text":"Went here for the first time the other day and loved it! When we sat down we were greeted ","useful":1,"cool":0},"MMBtzbAY0OqX2EQyFXd9sg":{"text":"Delicious, creative cocktails. Loungy/Trendy decor. Friendly staff.\n\nThe menu looked and s","useful":3,"cool":2},"vgoEPNyZfiS5ykjTp7MztQ":{"text":"Nice and chill night environment, decent wine options, good wood fire pizza. Would go back","useful":1,"cool":1},"qKRrMyw7NuW7W3VyoCFdMw":{"text":"This was one of my favorite places in NOLA. First off the drinks were not over priced at a","useful":4,"cool":1},"9niIcPuSTOsAI5sM9_hwkA":{"text":"I wanted to give the place a second chance, so a friend and I sat at the bar on a slow Wed","useful":1,"cool":1},"Yo_SrChHA7XePqHSFLAhGA":{"text":"On a Sunday night we arrived a party of 5, went to the only open booth at the end of the b","useful":5,"cool":1},"wgy2dkeurkORNvKjR3w6tg":{"text":"Unique cocktail menu.  I had  the Beets the Lime - delish - beet reduction, lime, brown su","useful":1,"cool":0},"5sOKDbuuiuWuX_hGbrufkA":{"text":"Visited January 6th for a friends 30th Birthday. We came all the way from Tampa to patroni","useful":0,"cool":0},"d7_rDSSnStu3RvWto8_17w":{"text":"What a place! Found this amazing bar on one of our last trips to New Orleans. With my wife","useful":3,"cool":2},"T9Vd4elm4f21l8lFOkJAdg":{"text":"Great place!! Yummy eclectic beer and delicious Cajun Pizza! The vibe in the place is very","useful":1,"cool":0},"e25pDN_R4oC13qxjl4yHUQ":{"text":"Victory was right around the corner from my hotel and I would walk past it everyday on my ","useful":3,"cool":1},"3ZSdxZjOJdwpjPGl5MnDRQ":{"text":"Awesome cocktails. My husband had the Harry Nilson and I had the Dante. Best cocktails we'","useful":0,"cool":0},"oRtYtq2PgShQBnbyeK7llQ":{"text":"Really great pizza with homemade dough and cooked perfectly.  But, was pretty disappointed","useful":0,"cool":0},"MBtoAqytBlQdY6peNA1NMw":{"text":"This place was an interesting find. To be fair we came in at the very end of the evening a","useful":2,"cool":0},"L-QNZA_EcJpHdZfZTSGicQ":{"text":"Great Service, we ordered the scallops and chicken satays to start then a pizza. It was al","useful":0,"cool":0},"5lXqyPSKmHhnMXFFeZd3SQ":{"text":"Ana is so sweet and friendly. Ian makes the best drinks. Tell him to make a drink with his","useful":1,"cool":0},"nx9hKndy4VSNa-5yrceXhA":{"text":"Food and drinks were good. Drinks were really good, actually. They use several fresh mints","useful":0,"cool":0},"dj1RJ-Mtoo8Tlm8WDE80sg":{"text":"This is a great place to meet for drinks.  They have an extensive drink menu with several ","useful":1,"cool":2},"Y0EDPqGW6rAcy3n6tv0xaw":{"text":"Worst dining experience ever!!! Waitress lost my credit card and was giving explanations t","useful":0,"cool":0},"VxzaxwbEa7GB2-0Tarmnzg":{"text":"New Orleans ain't like it used to be. After celebrating a bowl victory in the Dome we want","useful":0,"cool":0},"E1Z8mCdX1tAM9AEAEvnxVw":{"text":"Best bar in town!! Visiting from Las Vegas. Owner, Daniel is amazing ! Must visit victory ","useful":0,"cool":0},"JHAtr5m-KCRn6gSxRUhzXg":{"text":"Awesome service and awesome drinks. Food is elevated above standard late night fare, too. ","useful":1,"cool":1},"QahHHttNE6aUWm7qGm8PGA":{"text":"Come for the libations stay for the art. Enjoyed the most decadent sage infused cocktail a","useful":1,"cool":1},"TaWlquzNj-9hkdEqdZjaUA":{"text":"I really like this place. The bartenders are very knowledgeable and entertaining and their","useful":2,"cool":0},"0Pq7FKm_04rmit1UkIPWJA":{"text":"maybe it's me. maybe it's not. came here for post hurricane night out. I've realized that ","useful":3,"cool":1},"ELmFDjWsL3lf8SwO5mQHzQ":{"text":"~~~Sexy Hole-In-The-Wall~~~\n~~~Truly A Hidden Gem!~~~\n~~Dranks!! Yeesss Pleease!!~~\n\nWalki","useful":19,"cool":21},"SrK22eoL25UhdK0SG5jtZA":{"text":"My friend and I went to this bar since we were getting hungry and it was down the street f","useful":1,"cool":1},"7WNR3RUbu7_rWdwkSQKWAg":{"text":"If only I could leave no stars...\n\nFrom the time we walked into this establishment, it was","useful":7,"cool":1},"iF-qj2HBhXb72T1f5_Qrog":{"text":"Went here for Halloween not sure what to expect. For one, the staff is completely Covid sa","useful":2,"cool":3},"zB4lDWMZHirw1ET9ngoYiw":{"text":"I love this little spot.  The wait staff is consistently okay, but I don't go out for the ","useful":1,"cool":1},"AW0XX50I8FEV4NUj2SiKuQ":{"text":"Awesome, chill spot with fun creative cocktails! I love the new drinks they offer daily!","useful":0,"cool":0},"UIeZ3cxdBtK-GakOzl9-rA":{"text":"Crest little craft bar in the CBD district ... 10 minute walk from Bourbon street.  \n\nFabu","useful":0,"cool":1},"tAKguxi5OILOSiIFw4iDng":{"text":"What the hell happened to this place? I've reviewed it before (5 stars!) and had to come b","useful":5,"cool":2},"raKRRHbKIsL7uU3OiVuDAw":{"text":"This place...THIS PLACE is a MUST!!! I will crave this place every time I come to New Orle","useful":1,"cool":0}}