{"H32meOTNZEpRGkVysxD8IQ":{"text":"It's impossible for us to find a parking space along the street, while it was raining and ","useful":1,"cool":0},"_lrP6_8BvUKwm5GspLhyIQ":{"text":"Doris Metropolitan has a pretty awesome Menu and the prices are little high, but in-line w","useful":0,"cool":0},"XFWkVS0yyaIArfNh__UGCQ":{"text":"This place has the best lamb chops ever. They have a nice savory flavor. The service is gr","useful":0,"cool":0},"8nLDq2xw-1dTdaRtG7aSCw":{"text":"Love this place awesome food!! We had the Carpaccio and stuffed beet both very good \nMy bf","useful":0,"cool":0},"3RUdNaaxTcsP-vpBB1wDoA":{"text":"Five stars isn't enough for the staff (Desiree was an absolutely consummate rockstar), the","useful":0,"cool":0},"k1MhvkgHnE_VJykgyQvy_A":{"text":"As good as it gets for steak is on point! I split the larger Tenderloin (12 oz.) and the A","useful":1,"cool":1},"27Cf1wmtJpZNojUWL84Thg":{"text":"We were in NOLA enjoying our anniversary. Doris Metropolitan was recommended by a fellow f","useful":0,"cool":0},"Cyri6hz32RvuZB7NrRmsIA":{"text":"Really great steak. Carnivore focused menu with sweatbreads, marrow... which I love, but i","useful":1,"cool":0},"X_7NJITEQVydZSagjPb-qg":{"text":"This was our best meal in NO and one of the best ribeye steaks I can ever remember eating ","useful":0,"cool":0},"B00IIRFXrzyWOZHC2p8fHA":{"text":"Wow we did not expect to have so much fun in a steakhouse in New Orleans, it was sooooo go","useful":0,"cool":0},"5_5q9HeZ-heVf2tsZJIw-g":{"text":"I usually don't leave mixed reviews but this 4 star restaurant left us unsatisfied and wit","useful":0,"cool":0},"wQJr0S98UA0AV1Yxrec69w":{"text":"YUMMMMMMMM! Came here to celebrate my birthday dinner on our trip to NOLA and it was great","useful":0,"cool":0},"uMwJowew3pv1fXbYgKzSLA":{"text":"I've been to Doris at least a dozen times. The food and service are always spectacular. It","useful":4,"cool":3},"Z9cNWa9_SSb_4w4c2FR-LA":{"text":"Oh Doris. How more delicious and elegant can you be? My lovely Doris. \n\nAmbiance: The door","useful":0,"cool":0},"EX5mdLR5SxiObxKno9k5ow":{"text":"Atmosphere and food is just superb. Also service is impeccable very clean modern one of my","useful":0,"cool":0},"9rVuI4uvfMZz0ATe4PwNRg":{"text":"The food was great- ribeye, salad, asparagus, carpaccio, bread, tuna, wine, coffee, all of","useful":1,"cool":0},"mIjZcQ0Cff59yXxChr1JeA":{"text":"Best restaurant in New Orleans!!! Such a good food! Stake made to perfection! Great atmosp","useful":0,"cool":0},"TB2MbFnWMq_6-dVi4XWGHw":{"text":"I work and live the food business. I also live in NYC and was surprise to find my new favo","useful":0,"cool":0},"YbiBNAL7dIET41GnRS3neg":{"text":"Outstanding steak house but the staff makes the place. I recommend sitting at the bar as c","useful":0,"cool":0},"ttTZH6xQTEuq7iktu8vB4g":{"text":"We went on a Friday evening. I had the filet. It was absolutely delicious!  Asparagus was ","useful":1,"cool":0},"5UFzr6-a8CsdxVNYDOkWyQ":{"text":"Best effing meal we have had ever!!! Get the butchers board! It was awesome... One of the ","useful":0,"cool":1},"XWIvtIe9irvJxZAPRILM8A":{"text":"Great, yet pricey option for an American steakhouse. Tuna sides are fantastic; the bone ma","useful":0,"cool":0},"fNUuJhRnZXpNQ9BYM87EIQ":{"text":"I don't want to overdo it, so to put it simply.....this is the best meal I have ever had..","useful":0,"cool":0},"nWxTK1luFNvkgjv1nRjJKg":{"text":"This restaurant stands out from the places I've visited her in New Orleans. This is a high","useful":3,"cool":2},"XeHwelA_8zK0oCPdUkVwLw":{"text":"A favorite in Nola. Order family style so you can try it all. The beets appetizer is a fav","useful":4,"cool":1},"fqDxYotLbZsl0kVHHS5DCQ":{"text":"Once again....the best ever. Literally came here, to nola, for this place. BEST steak ever","useful":0,"cool":0},"FfXVV8CTNG6uH1-cswPDqw":{"text":"okay. did not have steak as it is very pricey, so went for burger which was soooo salty, b","useful":0,"cool":0},"s-Qge2_6E60lEubl-ypH8A":{"text":"Steak was not cooked as requested and the management never showed their face to ask if the","useful":0,"cool":0},"HUDTKwn-1YTjJzyagz5ayQ":{"text":"I heard some great things about this place, so we decided to see what the hype was. After ","useful":4,"cool":0},"5lZqT1S43xEDPcM9PY80gg":{"text":"Unplanned dinner last night in town. Hostess found us a table and the food was great. Serv","useful":0,"cool":0},"qUidLL3iSy2BkRzDZEucCA":{"text":"Made reservations online, arrived and we were seated promptly. I had the 31 day aged ribey","useful":1,"cool":1},"Rit3lgnJppPGKRgT9Fo7Pw":{"text":"I rarely write online reviews, this was such an exceptional experience that I felt I had t","useful":2,"cool":1},"tZWPQiDrFMH_6BLpwc3rHA":{"text":"This restaurant is beautiful..... We had dinner in the open court yard which had a perfect","useful":0,"cool":0},"KB5uXU_uEUzsB8iJ3oHuXg":{"text":"This place was an absolutely delightful surprise. Gorgeous decor, fantastastic, attentive ","useful":0,"cool":0},"BVYyFcQuqgy_M2ZCzy9Mag":{"text":"Simply fantastic, I recently celebrated my birthday at Doris and had one of the best dinin","useful":2,"cool":1},"cigrCQkA08MBOEW0VEE0Aw":{"text":"I am extremely picky and tough on restaurants. I was born and raised in New Orleans.  We t","useful":1,"cool":1},"EDspJrxaZC_WvOI1TaZntA":{"text":"Fantastic!! The food was delicious,\nthe atmosphere wonderful and service perfect. Doris Me","useful":0,"cool":0},"lJ7IXlknxKawp03ZmeegtA":{"text":"There are rare occasions when I will give any restaurant 5 stars. In fact I never have tha","useful":0,"cool":0},"LF-ZIs6Dv5c_Nx6We2tOjA":{"text":"AMAZING! The best new restaurant in New Orleans right now! The whole experience was excell","useful":0,"cool":0},"4wodI9Oos1Bgi9law7vN_A":{"text":"Great atmosphere. Very hip spot in the Quarter. Lots of hipsters etc. Had dinner at the ba","useful":3,"cool":0},"D1lauYibL4uO3r3gUnGldw":{"text":"This has had to be one of the best restaurants ive been too. The ambiance was great, i cel","useful":0,"cool":0},"oq54NZs3m1pKOXyQBGCQMQ":{"text":"Wow, wow and wow!  I was alone tonight in New Orleans for dinner and had looked on Yelp fo","useful":2,"cool":1},"aFCCQYWX48ZFUT1YR-jrRA":{"text":"During my birth\"month\" (it's an all month thing..a day just doesn't do it!), I was craving","useful":0,"cool":0},"hXxb3HuqYAab0dvHdS75zg":{"text":"I had enough creole food for the past 3 days that I was here in NOLA and that tomorrow I a","useful":0,"cool":0},"szc0WNpahIYTTXEnPb2xbA":{"text":"They squeezed us in last minute on Thanksgiving night so we were super thankful. Turned ou","useful":0,"cool":0},"NmWbZJmOJnOqU7UeDxtawg":{"text":"Loved the atmosphere & amazing food. The service was a bit over the top though- it was to ","useful":0,"cool":0},"sARJDjQGLvVYc6LF9_3yzw":{"text":"I can never say enough great things about this restaurant it's hosted my birthday party di","useful":0,"cool":0},"TFZzz4JeejjFoyyaoZ794w":{"text":"It was really amazing! Had the bone in ribeye , truffle fries and asparagus. You can cut t","useful":0,"cool":0},"tEIGwEaY8Jao7v6MTmk9zw":{"text":"Celebrated my spouse's 40th birthday here last Saturday night with our party of four and h","useful":1,"cool":0},"XSla95OomVf5DDVQqi2sgA":{"text":"Food, drinks, atmosphere and service are AMAZING. Our waiter Seth was so helpful and frien","useful":0,"cool":0},"eBsFMaJoo1ZwAip1mosrKA":{"text":"I really enjoyed my whole experience here. We arrived about 20 minutes prior to our reserv","useful":0,"cool":0},"yr_zzlmQQSHySWiY-3rQQw":{"text":"Let me start this off by saying I never write reviews. Ever. But my experience at Doris me","useful":1,"cool":1},"60Dmzenq07pn8bM8xsZ2Rw":{"text":"Amazing food!  My all time favorite restaurant. Wish they had one nearby.  The presentatio","useful":0,"cool":0},"6YA1biJBQULWEvGN1ShVcQ":{"text":"Went to Doris Metropolitan with a large group to celebrate a birthday. We reserved their p","useful":0,"cool":0},"ZGf5tsBDWgABa12VFfXtIw":{"text":"We've passed by here several times in the last month and finally decided to give it a try.","useful":1,"cool":0},"DrqgIo1bO0SrUF_CTrT1RA":{"text":"So we have been back twice and oh my god, it's quickly becoming my favorite place.  We liv","useful":0,"cool":0},"jBYMvX4cXZ0p76HTV3f4Ng":{"text":"Oh Doris Metropolitan, you gave me one of the best steaks I've had in a LONG while!!  I've","useful":7,"cool":5},"RaneDoDComc5kr_QDcq8ZQ":{"text":"This place is by far the best steakhouse in New Orleans.  Chic modern take on a traditiona","useful":1,"cool":1},"VFsW0Ln_Nsq6VsG-xziTpA":{"text":"Phenomenal food and service.  Everything we had from apps to dessert were excellent and ex","useful":0,"cool":0},"D1BJPPL9TJriyAZG83KZBQ":{"text":"This place is totally overrated. I had the 31 day aged ribeye which was decent, but defini","useful":1,"cool":0},"1dz-diXrY_GvGr47937ouA":{"text":"This restaurant is the worst. Went last night. Granted I didn't have reservations but it h","useful":1,"cool":0},"IQBe92sFlvu7MhTn1LS6Zw":{"text":"At the suggestion of a local, we made a reservation for a quiet, romantic night out. What ","useful":1,"cool":0},"1WoayJ0tAs_aXKwaRbCKNQ":{"text":"I enjoyed my dinner at Doris . Someone who is in French quarter must visit this restaurant","useful":1,"cool":0},"wu7Cvsbfwvh12nkw3MejNg":{"text":"Best steakhouse I have ever been too.  Service is unbelievable and the steak is perfectly ","useful":0,"cool":0},"CJxzCQPu1KXMw7PV-wM2wQ":{"text":"I've eaten at the best steak houses in America, nothing comes even close. This is not your","useful":0,"cool":0},"YGs7N_sF1p_Ex_jjFBUtyQ":{"text":"The best stakehouse in New Orleans. Excellent service, great atmosphere, and perfect stake","useful":0,"cool":0},"Al_CV2-BFzrq022r2JHr_g":{"text":"The whole experience was excellent. Food was phenomenal. One of the best steak experiences","useful":0,"cool":0},"SeoRSxaYAljfpE4gR-HYcw":{"text":"If you are wanting a great aged steak, this is your place! Not only was the meat incredibl","useful":0,"cool":0},"6FyyDfcuTXileOU3nmZt8w":{"text":"This was definitely one of the best meals I have ever eaten. My friend and I split the 34 ","useful":1,"cool":1},"0P58xenMly1m_E0bQsg49A":{"text":"So delicious! Made a last minute reservation for my wedding anniversary. When it started w","useful":1,"cool":1},"NSg3Ou2_bXeGnBTM8y4ijQ":{"text":"Definitely the place to go to enjoy a great steak. We did the 75$ chef menu and it was out","useful":1,"cool":0},"9Do4r07gWfR0-4Huxz0tew":{"text":"Incredible calamari salad with eggplant purée, chickpeas, olives, and snap peas. Really ex","useful":0,"cool":0},"NkUpYUbAXXrj99YaaU41zA":{"text":"This place is just amazing!  Great ambiance, great service and really amazing food!  We we","useful":0,"cool":0},"FdFIBi7d1yEw1Y4CztyltQ":{"text":"This place is amazing! The steak here is so tender, juicy, and flavorful. Every appetizer ","useful":1,"cool":0},"9l8QisotYvDGcPw-NTJm0Q":{"text":"I shared the porterhouse with my wife after having the Japanese wagyu beef as an appetizer","useful":2,"cool":1},"bwokath8wi99qRSPcgkMCw":{"text":"The best! I dream about the sweetbreads, which go great with the Israeli Red by the glass ","useful":0,"cool":1},"tc6OhZ1nEuIh5gZMIPhtww":{"text":"Stopped in for a late snack and ended up with a complete dinner. Ordered wine and asked th","useful":1,"cool":1},"y_8VlOK15QQKGlixBiocQw":{"text":"This restaurant is amazing!!! I had the most wonderful and unique meal. Every morsel was l","useful":0,"cool":0},"YtTEGDCow0FpymOY_XZWXQ":{"text":"Super cozy and trendy restaurant in the French Quarter. Perfect for a nice formal date nig","useful":3,"cool":0},"XWiJ4s2yRgr4uAMUc6WBqg":{"text":"Wow-so it's a Saturday night in October and the Quarter is packed. We are a party of 6 and","useful":0,"cool":0},"l4rQdSYbIKtj7J-ymlUsYA":{"text":"Meat there is fantastic! Just went there yesterday around six thirty and ended up being th","useful":0,"cool":0},"71SzoGVmy9jjJQxw27wwVA":{"text":"Coming from Texas, I felt that I had already consumed the best steak of my life...well, I ","useful":0,"cool":0},"huG7e9z456X-ZOiUczVC2Q":{"text":"I'll be very brief: Four of us went and we each ordered different steaks. They were fine, ","useful":2,"cool":0},"tIL0P_HDt3QIeIzJhSJNLw":{"text":"Everything we ordered was amazing!! We had the asparagus gratin, porterhouse, truffle frie","useful":0,"cool":0},"dQsnbUa3erLtpI2-0s7i7g":{"text":"Very disappointing. If you're going to charge $50/steak (plus extra for sides), it should ","useful":5,"cool":0},"9I8Km0QPrgXB0OLWczv_fA":{"text":"I really loved this place! I am a steak lover and everything about Doris was perfection, f","useful":0,"cool":0},"af-1tUt-wg6Q1eRSFzQswg":{"text":"Excellent food, service, and atmosphere!! Especially bartender Nick! Request his specialty","useful":0,"cool":0},"AgFm-mLtEbxQduLz3Sr8rA":{"text":"I didn't get a chance yesterday to post this but I would be doing a disservice to not let ","useful":1,"cool":1},"RBmz-jfLeh0iqE_DSD8ErQ":{"text":"Loved the service and decor! Service was excellent too. \n\nBeet root supreme was amazing, a","useful":0,"cool":0},"5hRDu3s1N249cGksL0Exvg":{"text":"Make reservations!!... We ate at the bar since all tables were booked for the evening.  Ex","useful":0,"cool":0},"3fxy9QRpcoEeUwFs4AdGCw":{"text":"Better steaks elsewhere.  Poor service. Don't know how to make a Sazerac.  Sat at the bar.","useful":0,"cool":0},"MMPt_NhpSHLjX1XEyM5BvQ":{"text":"Doris Metropolitan is one of the best dining experiences in New Orleans. My wife and I sha","useful":1,"cool":1},"17biwmrBz9GJc_uiSOI0jw":{"text":"Three stars  paws down, a-a-amazing!\n\nThe drinks are stellar, probably because the bartend","useful":0,"cool":0},"nEGQ9WRost1-hob5gaf8EA":{"text":"This place is exceptional. My husband and I's go to place for a steak in Nola and it's alw","useful":0,"cool":0},"rQx-skG3eC3ofO3l_1NaOw":{"text":"Doris Metropolitan isn't just a steakhouse.  It's one of the FQ's best restaurants.  Thoug","useful":0,"cool":1},"RJa_Mpq1b7Fg8lpkgfwEhg":{"text":"We had such an amazing dinner last night! Everything was 5 stars. Not your traditional stu","useful":0,"cool":0},"lNQvP-AWO9YPhnIzYCzfCA":{"text":"Doris Metropolitan is quite modern and elegant in decor and service.\n\nExceptional food. No","useful":1,"cool":0},"wro2KcHDhgiIEhPhjtwPBQ":{"text":"This is a meat eater's paradise. Me not being a big meat eater I was able to find plenty o","useful":1,"cool":2},"QQll0wPbI96LFG0PKDQOGw":{"text":"My fav meal in New Orleans!!  OMG!!!!!!!  We had only apps to get a true flav for the plac","useful":1,"cool":0},"PFFaHyd9WJA7kwjeXKwkWg":{"text":"Amazing. Fabulous. Best food in NOLA. \nNot yet bespoiled by legions of tourists, this stea","useful":2,"cool":1},"b4-8mRRDGAXT1pD9ZkPGZg":{"text":"By far my favorite place in New Orleans. The food its outstanding, impeccable service and ","useful":0,"cool":0},"Oc-pDPBKcIi5CVd9TMOoLw":{"text":"Incredibly disappointed on numerous levels:\n\n1. Please purchase proper steak knives. I hav","useful":7,"cool":2},"LnQVofsTj64JY85w8QfM2Q":{"text":"Just to be honest, we only visited the bar for drinks since we had just finished dinner ne","useful":2,"cool":1},"fHs5bSZOy2JxO4phMx6VQw":{"text":"Dined here with a friend over Labor Day weekend, 2018. Our server, Sophie, was outstanding","useful":0,"cool":0},"baDIdDUmCuMmWaRfj167Xg":{"text":"The moment you walk in and see the meat locker to your right, you know the hunk of beef yo","useful":0,"cool":0},"8kG4B2SdHxNZC1q6M55hLA":{"text":"Delicious all around!    With a group of fun girls and we were treated right with the mana","useful":1,"cool":1},"nZWZe-_AsETVO71PPSLR-A":{"text":"It was as though I died and went to heaven, greeted by a rib eye angel. Life is good!","useful":1,"cool":0},"Or-kDQZ6bXRlgrjZIppbLQ":{"text":"Great steak house in New Orleans. Dry aged beef, great appetizers. I had the beef carpacio","useful":0,"cool":0},"W9UI4b8zRTcbZtf9ga491w":{"text":"While they definitely have some service issues that need to be worked out, this is a great","useful":0,"cool":0},"vZ7URbpWwAaWoGm7qT0GGA":{"text":"Everything was out of hand. We ate at their offsite event area as we were a Group of 25. F","useful":1,"cool":0},"4xXLFuvOr7JxSsvayq2BKQ":{"text":"We had reservations for 9pm.  Service was outstanding as was the atmosphere.  Live the cou","useful":1,"cool":0},"LHKMl0dkBmE0WtmdfKT5WQ":{"text":"This restaurant was pretty good. The steak was big enough for two. Bread to die for. Staff","useful":1,"cool":0},"4F6yBdn1lj3NphwSKgMyMw":{"text":"Awesome experience! \n\nDecided to try this place based on a local recommendation of choosin","useful":1,"cool":0},"G4TjFgTYkT4F7IMOELcLtw":{"text":"The steaks were fabulous as we had been told by a friend.  Likely the best I've had in yea","useful":0,"cool":0},"2uLudKG68zl6uVxKWJxyRw":{"text":"I have to say I'm not a big beef eater but everything was extremely amazing! It just melts","useful":1,"cool":0},"vqBRxVpY1FmcNLcKYI_lDQ":{"text":"Spent thanksgiving lunch there..at the bar with 4 friends..had so much fun socializing, me","useful":1,"cool":0},"xpuLD4qHpllFi9nRpgJbVw":{"text":"The food and service was terrific. There were 4 of us and we were not in a rush so we were","useful":0,"cool":1},"O8M0EVL1g8hwSmPy58cutA":{"text":"The steaks were fabulous as we had been told by a friend.  Likely the best I've had in yea","useful":1,"cool":0},"kvWr9J8sNd1Eop4godtZKA":{"text":"Went for lunch with family. A nice upscale place with great food. Outside seating was nice","useful":0,"cool":0},"qCSobze_ZMGgIy4GvRQPaA":{"text":"This place was excellent. Our service was spectacular and the food was delicious. We had t","useful":1,"cool":0},"Ljr9KykJxxGjZfcPlBJabQ":{"text":"An amazingly good steakhouse in New Orleans' French quarter.  It has a unique menu combing","useful":0,"cool":0},"zT-0-jbxPBWeGo__3H6xjQ":{"text":"Doris Metropolitan should be a stop for local or a tourist of New Orleans's French Quarter","useful":2,"cool":2},"ssiqqLW97IzPL521vRHK-w":{"text":"Food is great, atmosphere is awesome and the people are amazing! A must when you visiting ","useful":0,"cool":0},"8fLfh_2dFxc243xifvFEmw":{"text":"Dined Sunday, June 8, 2014 with our grown daughter. We had a totally awesome experience. S","useful":2,"cool":0},"XQXphXVT7vqT5kQKxKeQrw":{"text":"Our first time at Doris was this weekend even though we live 3 blocks away.   Seldom eat s","useful":1,"cool":0},"sXeZp0_G8X5odTKx4DyfEQ":{"text":"Is it a restaurant for the first time and enjoyed everything from the eggplant appetizer, ","useful":0,"cool":0},"uD-dwKurF5JbO0ON9mFJoQ":{"text":"One of my favorite locations for dinner in the Crescent City! This was our third time ther","useful":0,"cool":0},"I7ROXeZ1nX7cNhQ8u7IhmQ":{"text":"AMAZING! One of the best meals of my life! Everything was exceptional. It started with som","useful":0,"cool":0},"aZ8M3gim_Ax_me3pBxjSeA":{"text":"Appetizers: red beet with cheese: don't get not good. \nThe cheese plate was a hit not beca","useful":0,"cool":0},"-Tp-Z74wNliQWU9KiSBjvw":{"text":"I was in New Orleans for 5 nights for NYE and this was hands-down the best restaurant I ex","useful":1,"cool":0},"cJsmHg4iWGXLCracfmZOjg":{"text":"If you are looking for a perfect steak this is the place.  They know their meat & even hav","useful":1,"cool":0},"Zoog_WImNV2DA2C2JvtDOw":{"text":"Great place, I would go back again.  Highlights below:\n\nFOOD: best things to order are the","useful":2,"cool":3},"Ki-I0Z1F0rE_o1DJwYiQPQ":{"text":"Had a delicious dinner here while visiting New Orleans. Complementary bread is amazing. Ha","useful":2,"cool":0},"-LQzrHVdV0FqGYgNqKwNOA":{"text":"I went here with a group of 7 guys as part of my friend's bachelor party.\n\nThe restaurant ","useful":0,"cool":0},"NpYhy-P-v3cEjr2W2ww-cQ":{"text":"Comon, brother.  Are you serious?  I ate the porterhouse, filet and ribeye, all without lu","useful":0,"cool":0},"vyG9aYUv3TObb3jLGz4Qsg":{"text":"The steaks were good but way over priced. The attitude of the staff seating you is horribl","useful":1,"cool":0},"ClUKVjjtmmvPuID2_3SbZg":{"text":"One of the better steakhouses/restaurants in the city.  Had the Carpaccio and Tuna Tartare","useful":2,"cool":0},"wjFuv60fc777zTxe0D2icg":{"text":"Incredible food, incredible people and fantastic service with attention to detail made our","useful":2,"cool":1},"blEniNDP6tGL73096D0-bQ":{"text":"We went to Doris Metropolitan  for a holiday dinner with my boyfriend's family. This is a ","useful":2,"cool":0},"xQXD-9GcV2AZWGmBtm5hCA":{"text":"This was a fantastic Expeirence. I actually ate in the court yard which is simple and refr","useful":1,"cool":1},"MRI-v2E8NdjrboFKT3f1Xw":{"text":"I finally made it happened and bellied up to the bar at this famous steak house.  I strate","useful":2,"cool":1},"_b7gNKCOeBhTfHri0bZtdg":{"text":"Excellent...\n\nO.K....$155 for a steak is a bit much....but worth every penny....simply out","useful":3,"cool":3},"hnY4_txdWCDqsyxIz_V_jA":{"text":"My absolute favorite place to eat in NOLA. I would recommend the beet filled with cheese, ","useful":0,"cool":0},"w39BsugPMw5q41rFQHdvDQ":{"text":"We came to Doris after trying to come in when they were closed.  We both looked around and","useful":0,"cool":0},"hSL0atUqw1EqVcSTws5PmQ":{"text":"Wow. Just had the eggplant appetizer. Best appetizer we've had at Doris so far. Excellent ","useful":0,"cool":0},"J1BxKGSAM6O3No5cD1ufWA":{"text":"Ok... Here it is... A pretty damn good steak house in the Quarter.\n\nWant to know what my b","useful":1,"cool":1},"WRC2rQpwR4cTTctMjOIXzw":{"text":"Finally ate dinner at this restaurant that was recommended by a friend of ours.   We had a","useful":0,"cool":0},"j1inIeOPVnie2g348o4Vtg":{"text":"this can be a very good restaurant if it just tried to less with the plates. by trying to ","useful":0,"cool":0},"Qt-Y_soProyKT-6KEtgMdw":{"text":"New and very large steak place. Lots of men. Aged beef, wine etc. looks so nice and new th","useful":0,"cool":1},"90qCbEhaJfcP2SN1pru84w":{"text":"What a surprise. I was impressed from the start with this place. I Had no expectations whe","useful":1,"cool":0},"91rWw3gD2CnLu1daw4Q7eg":{"text":"I don't even know where to start with this place. I love for amazing dinner experiences an","useful":0,"cool":2},"MO69JmFaBk9gyUvrJbg5ow":{"text":"seriously? I can't believe I have lived in new orleans for 10 months and hadn't been here ","useful":2,"cool":1},"3rpu9wTPpRFEe8g9BxM9Ag":{"text":"Great place for a excellent steak.  Great atmosphere and staff is attentive and impeccable","useful":0,"cool":0},"ujR13AOBPcmY_DRvtz1ZcQ":{"text":"I had the tuna tartar appetizer and the lamb as an entree while seated at the bar!  Servic","useful":1,"cool":1},"Y3fY1GRX1JF46eBvYlNRSQ":{"text":"This was the first place we went in New Orleans for our two week stay.  It was yet another","useful":1,"cool":0},"Sj3_qCqdKduXW7X4-_MNhw":{"text":"One of the most amazing meals I have ever eaten, and quite possibly the best ribeye I have","useful":0,"cool":0},"q4UO8rYlq04ME-0F0D3rfQ":{"text":"We had lamb, sweetbreads, and tuna for appetizers. All were exceptional, but I really enjo","useful":0,"cool":0},"_b7Ra3KEaUilfmiqNKj4ww":{"text":"Well I have to say this place serve the best steaks in NOLA. Steaks are amazing here! The ","useful":0,"cool":0},"g-iomM5HYI9sqQKIrprwlQ":{"text":"Waited an hour & 45 min for table!! They kept telling us it would be ready and then admitt","useful":3,"cool":0},"ORP9viu-2Znm3cgItMzGkA":{"text":"Can you say overrated?  I had the butcher's cut (med-rare) because of the accolades it rec","useful":4,"cool":0},"Upa3COCfP3XAs-sAouoW3g":{"text":"Really upscale steakhouse. The service is great, but I didn't really like the short ribs b","useful":0,"cool":0},"Z9BzRmRkr7iMi7KloAchrQ":{"text":"The food was amazing and the service was excellent.  Although the ambiance is romantic, th","useful":0,"cool":0},"SpRjXgFb9u5uupLWKm_xsQ":{"text":"Doris Metropolitan is an all around top notch restaurant. The first time I ate here I spli","useful":1,"cool":0},"nBPlyh2PUpGP2Qvt3EB8Wg":{"text":"OMG! Best steak dinner ever! And we've eaten at every one in New Orleans!  The service was","useful":0,"cool":0},"litiVIqOToCTUqym1mSc-w":{"text":"The best meal we had. Atmosphere, food and service were all top notch. We were all a littl","useful":0,"cool":0},"74njkiQzt4A9b9r8fsetjg":{"text":"My first time! The beet and the tuna tartar were soooo good! Had the sea bass and it rocke","useful":0,"cool":1},"4I2Lt3oQsHFzeqQOaaPckA":{"text":"Best Ribeye I've ever had.  Not much more to say than that.   Service was great too.  My w","useful":0,"cool":0},"BV9aDD7F7s0f9aFbZTl1EQ":{"text":"I found this restaurant to be good.   Not fabulous as all the reviews stated.  Perhaps the","useful":0,"cool":0},"p5CPNdGuTmX1DMml-sZjqQ":{"text":"Popular place and classy. Got the sweatbreads which were great and the chatuebriand tartar","useful":1,"cool":1},"Ers52sLCqmWc1H1st9jQJg":{"text":"Took a client out here for dinner last week and had the steak tenderloin. It was full of f","useful":1,"cool":0},"bLryFgI1yidMfMZ17yQ5Cg":{"text":"Where do I even begin? One of the best meals we have ever eaten. The first part was the ho","useful":0,"cool":0},"iYuQ1Xm6CGLVGGKXwNs-zA":{"text":"Wonderful meal and experience. Our server, Barbara, was fantastic - everyone truly enjoys ","useful":0,"cool":0},"Ccgts14248-40ahlMKHxHg":{"text":"Overall the experience here doesn't warrant the price. \n\nThe staff turned their nose up at","useful":2,"cool":0},"ChWAQR0W-D-5XO8lTV9cxQ":{"text":"WOW! Let me just say,, DORIS DO NOT OWE ME ANYTHING!!!! The steak was BEYOND delicious!!!!","useful":0,"cool":0},"WdmIIiPdMQ6TPYxCy_qI3A":{"text":"We had dinner at Doris Metropolitan on our first night in NOLA and it was great!  We sat o","useful":0,"cool":0},"r0gA_wcYTCk41UIbPfWh4Q":{"text":"Quite possibly the best places I've ever eaten. Ordered the chef's choice meat board and i","useful":0,"cool":0},"wcQRw9iYBok674jly20KEg":{"text":"Wow, wow, wow. I've lived in the CBD for a year now, and strangely I didn't even know this","useful":1,"cool":0},"K-m4QeN-A6IkkYcVHX-sBQ":{"text":"One of the best steakhouses I have been to anywhere. Great food, and great service.  Highl","useful":2,"cool":1},"kGhF-Fmln55QIG8tssuzjQ":{"text":"This steakhouse is one of the best in the country and was one of my highlights as a reside","useful":1,"cool":0},"qAIUCbaqdBBZd5s6jb_JHw":{"text":"My boyfriend and I were in New Orleans for Valentines day weekend. Of course when we tried","useful":1,"cool":1},"CIFC56PpL6fxBy8bvU8KrQ":{"text":"We were in town for business and went here to celebrate one of our associates birthdays. W","useful":2,"cool":0},"B0bIeZ8lj1XuSC9TD3k2Gg":{"text":"The steak was 5 star worthy.  All my wife kept saying was \"wow.\" She got the Butchers Cut ","useful":0,"cool":0},"kvOgwX7GB8i-M2DjdJiHGg":{"text":"Highly recommended! The steak was one of the best I've ever had, and I'm an aficionado. Th","useful":1,"cool":0},"MhpH2SCdUIFdncuQAXiAzg":{"text":"Doris Metropolitan came highly recommended to us prior to our visit.  Fortunately they wer","useful":1,"cool":0},"fRKYFOac_7tHmN-cLUx2yA":{"text":"Location and ambience: 4.5 stars\nService: 4.5 stars\nAppetizers: 2.5 stars\nSteak: 5 stars\nM","useful":1,"cool":0},"rY2O5Lxd8_Qzi_nj3ZsYHg":{"text":"The best Porterhouse steak I've ever had. Until recently, Quality meats in NYC was my favo","useful":0,"cool":0},"8SkRZIaYebPagAoDk60PKg":{"text":"The food was amazing. Everyone is so nice and happy.  It feels great to get the warm south","useful":0,"cool":0},"qte6TB_XZ4wWzU0q2H68PA":{"text":"So again we have been wowed by Doris!  Food was amazing as usual and I am just thrilled wi","useful":2,"cool":0},"NkY7AoFiCFMb3HUINUH_mg":{"text":"For our final meal in New Orleans, my coworkers and I knew we wanted steak: the question w","useful":0,"cool":0},"nKN8LXHz75jBHjLx36gvXQ":{"text":"A great place for our anniversary celebration. We had window seats and great service. The ","useful":0,"cool":0},"Sm-DkcwPTCG8NL0tGX4YjA":{"text":"Talk about an absolute GEM of a place in the Big Easy. After a long week of nonstop drinki","useful":0,"cool":0},"hqQ19FTx4sxsYYViP1Vy1g":{"text":"Simply amazing. Everything from a relaxing ambiance with warm lighting, great jazz music, ","useful":1,"cool":1},"yV8RPrF7kgOJKZT5N42NXg":{"text":"Great atmosphete. The vibe is sophisticated and not as casual as a lot of the restaurants ","useful":1,"cool":0},"DnQzW6ywnHqn9vVnAWnsFQ":{"text":"My husband and I went here for our 25th wedding anniversary. When he made the reservation,","useful":1,"cool":0},"BlT82aQZzW40u6ZsltonJA":{"text":"We came in from dallas pretty late and yelp open late restaurants and stumbled across this","useful":0,"cool":0},"4tiKbynZS_Ch-qIWliZh3w":{"text":"Absolutely incredible food and service. The total experience was incredible. Love the wine","useful":0,"cool":0},"5wq_4f7Z0pbwfVoLGj2ryw":{"text":"Amazing steak, cocktails, & more. Fresh bread made in house with a sampling of butters and","useful":0,"cool":0},"9xckjj8WHvQ9RsFVOmRkdQ":{"text":"Great atmosphere and drinks!   Loved sitting at the bar and having apps and drinks.  This ","useful":1,"cool":1},"kfwNjSyp31ZRo7Gtb4WK9A":{"text":"I feel bad giving thid place 4 stars. I reserve five stars for the one or two places that ","useful":0,"cool":0},"Sa2XiNNJrBGrVsMjJg57zQ":{"text":"We were there for my daughter's 21st birthday. Highly recommend to order \"family style\" st","useful":0,"cool":0},"00-EgkD5jcmD9qd8E4chNw":{"text":"Delicious! Husband and I came here for our 5th wedding anniversary after hearing so many r","useful":0,"cool":0},"gC9ZL-MR0Zj0oxxSYYT0Lg":{"text":"LOVED this place! Excellent food, top notch service. Both bar and restaurant have a great ","useful":1,"cool":0},"c-9GCRPitviR_U3N_EcKFQ":{"text":"This is my first post to yelp and I have to start by saying that this could have ended up ","useful":0,"cool":0},"NH_ND_kkoxCcWZAQ-1ZbLA":{"text":"Spectacular- easily one of the best meals I've ever had. Amazing cuts of meat perfectly co","useful":2,"cool":0},"1d7P59ohDUeCfxFOpWsE0g":{"text":"This restaurant deserves far more than five stars. Everything about this place was amazing","useful":1,"cool":1},"BhaXCm-n76G-mWnfTnUSXQ":{"text":"Doris Metropolitan came highly recommended and does not disappoint. The staff is excellent","useful":1,"cool":1},"CYrjSxBMvL7GkOj94iQd_Q":{"text":"We stumbled upon this place while walking the French quarter.  The dry aging room attracte","useful":0,"cool":0},"Q4naGKMzL1u6RC4eHLhsYw":{"text":"My go to steak spot in New Orleans. I personally think this is the best steak in New Orlea","useful":0,"cool":0},"oSxiHLOP7HKtgMawC1v04A":{"text":"The best Rib eye dinners I have had ever. The service, the food and ambiance makes it a gr","useful":0,"cool":0},"bRwrbIFhTNtudzwkn1nyFQ":{"text":"Started off poorly, but it ended well.\n\nWe were sat in the back and after waiting for 15 m","useful":1,"cool":0},"PWnjeI-EiNgYt_fS2aUbdg":{"text":"It's been 24 hours since our bachelor party sat down for dinner here. We are still smiling","useful":2,"cool":1},"6mBwtusifQo2bkeKArBLIA":{"text":"This is the third restaurant the owners have open.  The first being in Israel, second Cost","useful":1,"cool":0},"04KscA5dXv-7-ZCrO6wL-A":{"text":"I know it's early to go with the 5 stars but this place really seems to get it. It's a fin","useful":1,"cool":0},"oHpTyVohOYBUiWVDdCtXSA":{"text":"Best Stak House in New Orleans!\n\nThis is the best steak house in New Orleans.  Much more c","useful":0,"cool":0},"TlRfhsdfsJpQAVG9skzmXg":{"text":"Service was ok except that the waiter basically scammed us with our entree and then tried ","useful":0,"cool":0},"NgKV8MaJ1I7QSQ2Ik8IK_g":{"text":"Amazing steaks melt in your mouth. \nCharred outside but super flavorful and juicy inside. ","useful":1,"cool":0},"IWQnyHgVFtBlur4dZvTczw":{"text":"This has been my birthday dinner celebration restaurant for the past 2 years-it's that spe","useful":0,"cool":0},"MDx4jeUsq9x7D5ZkuNp6GQ":{"text":"A little late but I ate here with my fiancé on Christmas Eve. My hopes were high and they ","useful":1,"cool":0},"iL6AjHiyeLFHVDAH_73GFw":{"text":"Napa Valley calibre in the french quarter.  In a different stratosphere than chain steakar","useful":0,"cool":0},"KjPSzji-u1JIqnS9S2JryA":{"text":"WOW !  Just WOW !   What a great night and what INCREDIBLE food here -  started with beef ","useful":0,"cool":0},"Trvp712NRcvAMd3QPPzB5Q":{"text":"This, is by a long way the best steakhouse in New Orleans. Nothing else is even close.\nSer","useful":1,"cool":0},"xTQtJ5_0MFB1jx4FX3Y2qw":{"text":"Yum yum yum! This place is so good. Had a rib eye steak and it was perfectly seasoned and ","useful":0,"cool":0},"SDnCB4Es2fQjXJShF3DkPA":{"text":"As a vegetarian, I know it's weird to eat at a steakhouse, but the ambience and appetizer ","useful":1,"cool":1},"ZycXVZPxFbJrNjfMrvH_6w":{"text":"Okay so first off I don't eat steak, it's a texture thing. I went with a big group who all","useful":0,"cool":0},"CSdZrsDfBDK7R6oSl280hA":{"text":"I can't explain how much knowledge of meat they have at Doris Metropolitan! Had the assort","useful":0,"cool":0},"GBd-zD0bhz_wmHTG4RVwhg":{"text":"The short ribs are a bit flavorless but the steak is nice. I would recommend the truffle f","useful":0,"cool":0},"e0hJFPglBoreOQAfS9vhGA":{"text":"Amazing food, the best we had in the town during our weekend visit. Amazing appetizers, my","useful":0,"cool":0},"iEzx_aAM_yiE7NS5FK7Ghw":{"text":"Amazing ambience amazing food. The Gulf fish was savory and probably one of the best main ","useful":0,"cool":0},"-yNL8V3nIiGp5BoGrubawA":{"text":"Absolutely amazing from food to service. A little pricey but WORTH EVERY CENT. Three of my","useful":2,"cool":1},"NgxhQWvV6A0OHyVhmrT-tg":{"text":"A favorite date spot and family dinner spot. We love eating at the bar and chatting with t","useful":0,"cool":0},"SlzsmJoaWAvy2kmG-2yflQ":{"text":"Excellent restaurant in New Orleans, French Quarter ! Open kitchen and low lights bar and ","useful":0,"cool":0},"K7CwsKRGNnsnbYpAtxMxXw":{"text":"This. Is. The. Place. Food. AMAZING. Service. Even better. Thank you so much for everythin","useful":1,"cool":0},"Co-5gHUveeaFPHY75dHk4A":{"text":"Wonderful!! So different if you're tired of fried this and creole that this is the place. ","useful":0,"cool":0},"TZLR6Jse_z6HuYCbf4hSaA":{"text":"Fantastic service with recommendations on steak, wine and even which was the must try brea","useful":0,"cool":0},"rwE3liHtT1eDEuEaW3nilA":{"text":"I thought this place would be horribly expensive, but if you eaten at enough nice restaura","useful":2,"cool":1},"T1sRjGgX-Fc15xgU8jLJ7Q":{"text":"There are places you'll have the one of the best meals of your life, and places you'll hav","useful":8,"cool":3},"4vAkQwOxqQPhAYN3qcZqcQ":{"text":"We just enjoyed the carpaccio and bruschetta at the bar. It was amazing!  Bruschetta had c","useful":0,"cool":0},"-TdhFS939o-g5qeQFInL_Q":{"text":"I popped in here for lunch to try the burger and check this place out to see if it would b","useful":6,"cool":4},"CBFlkfCIXIgFSLaX9paTUQ":{"text":"If you go to one place for dinner in New Orleans, let it be Doris.  This place is a value ","useful":2,"cool":1},"ybcskXdPfDmRKVxeHTRNcw":{"text":"The meat board is definitely worth it, comes with the burning sage and bone marrow to make","useful":0,"cool":0},"6TzsxrG6YjgNd26aMd-A5w":{"text":"The Beetroot Surprise blew my mind. I'd go back just for that alone. I've never had anythi","useful":0,"cool":0},"wmM10nbSeH0zoW5vFMOYRA":{"text":"Enjoyed the bone in rib eye so much it felt a bit indecent to be eating it in public.  Mos","useful":0,"cool":0},"Q5LZYUbuOHZs6QuWss8q1g":{"text":"Favorite #nola restaurant. Aged beef. Great atmosphere. Easy walk from French quarter and ","useful":0,"cool":0},"JO5569XdWCrFcFQrJlInzA":{"text":"As a vegetarian, I know it's weird to eat at a steakhouse, but the ambience and appetizer ","useful":0,"cool":0},"WjWZ3mTqqaJA2dBS7v16sw":{"text":"Every part of the meal was great. From the bread they bring to start  and appetizer (tuna ","useful":0,"cool":0},"DeYjLe0uEYCrx1ppSZ3eAA":{"text":"After comparing a regular filet to a wagyu filet I'm sorry to say that I'm disappointed. T","useful":0,"cool":0},"6cc1hibWCvDJZDivfRtNtQ":{"text":"We stumbled into Doris this evening for a late dinner.  We had never heard of the place an","useful":0,"cool":0},"3yQkHbXANM55l47SaT0FzQ":{"text":"Everything about this place exceeded my wildest expectations. We went there when they were","useful":0,"cool":1},"9X7xjhuhW7NDP__mYtzPqw":{"text":"Went twice and the food was amazing!! The steaks melt in your mouth.  The truffle fries an","useful":0,"cool":0},"TI3FRrfEUnBDR1xIES_eow":{"text":"Every bite AMAZING! I can't remember where I found out about Doris Metropolitan but it was","useful":0,"cool":0},"xlOFk4zzcH-I8oOODWKV7Q":{"text":"The beet root salad was probably the best thing I've ever eaten, but the service was a lit","useful":0,"cool":0},"L50Jp0uVJ_yQeg22xEaWxA":{"text":"Loved it. Contemporary atmosphere. Niko was our waitress. We loved her. She was very knowl","useful":0,"cool":0},"OcoNeZI_geaBev8jvzePHQ":{"text":"We are from Louisiana & frequent NOLA often. This was our first time to Doris & we could h","useful":2,"cool":1},"3ZvyKYgHn9s9CdyW6oZ8tA":{"text":"So good. And such knowledgeable waitstaff as well. Felt so comfortable eating here.\n\nTook ","useful":4,"cool":3},"4Ac4GSaWSnYw4N0VQ1RFvA":{"text":"Doris Metropolitan was my other favorite restaurant from our recent NOLA trip. Their steak","useful":0,"cool":0},"i4OPrPrD4hOPiyt3XgNoqA":{"text":"My night at Doris was a first date with a longtime friend. It's got a very modern but warm","useful":12,"cool":12},"dK8TkCq94yFXo45H2Goiyg":{"text":"As a cattleman daughter originally from Colorado--I know my meat and so happy to say--they","useful":1,"cool":1},"D6VRZ6FJCUOufVxmQsr7og":{"text":"This is now my favorite steak restaurant in New Orleans. The service was good. The steaks ","useful":0,"cool":0},"sFCVm568GWCGwfM8rBlvXw":{"text":"Without a doubt the best dining experience, ever! The food is out of this world, the Israe","useful":0,"cool":0},"36fXYiDi2EnOniZYEG_xfg":{"text":"Fantastic food, service, atmosphere!\nMy spouse is a serious steak person and I'm vegetaria","useful":3,"cool":2},"ueEpQxtz3W71-j-EpdzKmQ":{"text":"WOW. This Mediterranean themed steakhouse is in the heart of the French Quarter. There is ","useful":1,"cool":1},"N8SRu6GigG1UzYS809_s4Q":{"text":"I had the bone in NY Strip medium rare, which was aged 31 days. The steak was perfectly te","useful":0,"cool":0},"foCYCYXNyaUWCOH_pxjGBg":{"text":"It was awesome, so fulfilling. Definitely worth the money. Staff was professional and know","useful":0,"cool":0},"Ebp4mmQBhMp7j7J4fMp5Lw":{"text":"Simple. Best resturant we've been too on a long time. Best steaks we've ever had. They wer","useful":0,"cool":2},"WGzHK8z5Oo1DLoBX6016nQ":{"text":"Wow!!! This place honestly offers some good surf and turf! The tuna tartar and fish brusch","useful":0,"cool":0},"3y0hwiai3dIpKm73YlEE4Q":{"text":"Our first visit to New Orleans. Wanted to check out some of the great food we were told is","useful":0,"cool":0},"RSKv7mky9e2WV0O24OYgZQ":{"text":"Ambiance is great, Waygu Steak was well worth the $155 price. Swordfish was amazing. Our s","useful":0,"cool":0},"mNiaEFyBQ7eWCFHxrTxQwA":{"text":"Outstanding meat selections and really wonderful fish, sides, desserts, wine list & servic","useful":0,"cool":0},"WtgogqDqoEFIVlMDD_3d6Q":{"text":"This place was just amazing! Excellent steak, breads served were so good! I had the tomato","useful":1,"cool":0},"MW8o7Olk-OUGmfcw5AcHag":{"text":"Not sure why it's taken me this long to try Doris.  It should have been on my regular list","useful":0,"cool":0},"TlfcJogynGNYjiBAqmt-ig":{"text":"Every time I am in town I come here, and you should too! Great food, awesome service, and ","useful":0,"cool":0},"tXVOp-AMB17ZWcLw92AQTA":{"text":"I typically don't review restaurants but I feel the need to provide an honest review of Do","useful":1,"cool":1},"6-M0ti5uWUr3ArhmREHx_A":{"text":"Courtyard seating. Bottle of red. Three different breads with oil and three different home","useful":3,"cool":0},"9-O--6go3z-AvLZWgwp5XQ":{"text":"I had really high hopes for Doris. Unfortunately, they didn't quite make the cut.\n\nFirst o","useful":1,"cool":1},"UbhCw_AWOMWS6khTrB0LRQ":{"text":"One of the best steaks we've ever had. We called last ninute on a Sunday night and still w","useful":1,"cool":1},"knhZZlMRbqZpWU4rLodfQw":{"text":"Very nice steakhouse. Was enticed enough by the meat locker you can see from the street to","useful":0,"cool":0},"U5mnVz5kk4VvlcvZRhNybQ":{"text":"LOVED this place! Excellent food, top notch service. Both bar and restaurant have a great ","useful":0,"cool":0},"N7fNS8rEC4svA5wa5F6kCA":{"text":"Amazing! My partner and I eat steak a lot and Doris is hands down the best steak house in ","useful":1,"cool":0},"JdapG6emUKjrH8YsQER8Lw":{"text":"I should have stopped halfway through the steak, but it was way too good to waste! It was ","useful":0,"cool":0},"8vnOTBlG9vfApvBsTHwVbA":{"text":"I had heard this place was overpriced, but spectacular.  But everything was great.  The ap","useful":0,"cool":0},"YHLVxrQhaYWTfDQ5kHcr4A":{"text":"Fantastic meal. Service was phenomenal. Marcus was very knowledgable and a true pleasure a","useful":2,"cool":1},"za9EpTsR_4jO-hM9YYDW7Q":{"text":"We stumbled upon Doris Metropolitan on our first night in the French Quarter last week.  I","useful":1,"cool":2},"asGUPSX-oXd_xwitsMGphg":{"text":"My interest had been building for sometime as I saw the renovations happening.  HUGE impro","useful":0,"cool":0},"jH3C9dlCzuXmO4XRAMHGnQ":{"text":"Delicious and delightful. Excellent service. Perfect steaks. Great vibe. Lovely patio- req","useful":0,"cool":0},"kQRt9-L73UI-ecSO3Qd4rw":{"text":"First class. Amazing drinks,apps and service. Steaks, entrees and sides all melt in your m","useful":0,"cool":0},"nEho15rSE4fpR3JmSAY1Qg":{"text":"My husband and I decided to do Doris Metropolitan for our 9th wedding anniversary and were","useful":1,"cool":0},"9LL1h0Yx3X2RLMhf_0ZL7w":{"text":"My favorite steakhouse here. Have been 3x within the past three weeks. \nThe best-- The Cla","useful":1,"cool":1},"D1CX59skVx8jLnugK0Nbtg":{"text":"This was the best restaurant I ate at during my trip to New Orleans this go around. Everyt","useful":3,"cool":2},"HtxjvFMueRc2g6swPMh7Rg":{"text":"\"Falls off the bone\"... need I say more. Doris Metropolitan is a great new addition to New","useful":1,"cool":1},"o0QRguDP2SEcpRF3T1gK0A":{"text":"Dori's Metropolitan is a gem of a dining experience. \n\nFirst off, the food is as fresh and","useful":1,"cool":1},"dIPwNATis-tOUlwIUSqTAg":{"text":"They have the thickest steak here! So thick when you order medium it comes out bloody. I l","useful":0,"cool":0},"Qb7dQDx80G-YZmKA2abmpg":{"text":"We're New Yorkers blessed with the chance to experience dining at some of the best restaur","useful":0,"cool":0},"SDI4FcFIfHqGhc7gZaJACw":{"text":"The best in the quarter. Nick was the most amazing bartender! Took such good care of us! A","useful":0,"cool":1},"34e0K4wU6nduete1WW2aAg":{"text":"This is the best steak in New Orleans, I absolutely adored everything about this restauran","useful":1,"cool":1},"B8cNIjvzP_lHbErhlvXA0Q":{"text":"The tuna tartare is fantastic!  Wow!  They can also make a good Sazerac.  Big props, will ","useful":0,"cool":0},"bpmk-cDm9GeCOZFtesvAWQ":{"text":"It's saying a lot when I say that this is my favorite restaurant in new Orleans.   While t","useful":1,"cool":1},"8MSXGt3NXDkKzdA2JjqH_A":{"text":"Boyfriend and I came here hoping to have a few cocktails and escape the sun. The drinks an","useful":0,"cool":0},"aHy6dDTo8hqCcpefR8cY6Q":{"text":"Top notch all around.  Food, Service, Room, Wine list.  All is great here!","useful":0,"cool":0},"KZtQ7yE00ksaQ0s2gjoPeA":{"text":"Spectacular. Appetizers were \"lights out\". Calamari app was the best I have ever had. Meat","useful":0,"cool":0},"MNXQtZT6j1GNu0mxnFJsfA":{"text":"Very disappointing experience. Started with cocktails at the bar- first cosmo was extremel","useful":0,"cool":0},"nviEnIt1gI7uwJbZemUtmQ":{"text":"Exquisite cocktails (The Future Ball) plus a delicious steak. Can't go wrong.","useful":0,"cool":0},"kpDTEK5tEsE5ewgusAJLRQ":{"text":"Ok, I don't write reviews very often but I have to for this restaurant. Upon reading other","useful":1,"cool":1},"clJfDzSP7NtgtCfKEAdstw":{"text":"Definitely one of those places that make you feel unworthy if you're not dressed up. \nOrde","useful":0,"cool":0},"3qjuWEa_0t7SQZm7bZbeXQ":{"text":"Dinner Saturday night was phenomenal!!! I had the classified cut. Definitely worth the wai","useful":0,"cool":0},"YIgHJ-9mHH6bqdfc_gBonw":{"text":"We loved this restaurant.  It was our first visit. Beef tenderloin was cooked to perfectio","useful":0,"cool":0},"GRc-u1jTj-w8bpKvZGciog":{"text":"Everything blew our socks off!  The apps were amazing (Tuna tartar, carpaccio and  the poa","useful":2,"cool":1},"boj2hC8_YxO7Tc_yhM0lrA":{"text":"From the moment we walked in to the moment we were served, there's nothing less than 5 sta","useful":3,"cool":2},"ZbzENB9_sVlTuZXzDBrAwg":{"text":"Perfect place to enjoy excellent food & drink. Service was excellent nice to dine in an en","useful":0,"cool":0},"qrLrecLy9dfkLlmALex2Dw":{"text":"Good new addition to the quarter's restaurant scene, but there are some things to work out","useful":0,"cool":0},"AwvfDkuIj9B_tCD7bUWA9g":{"text":"This is a must when you are in New Orleans, the service was top notch and the food even be","useful":2,"cool":0},"ZqVBOcMAzfLyWb5FBK7zBg":{"text":"Came here after my son found it on Zomato.  He can pick the greatest places to eat.  Can n","useful":0,"cool":0},"KjKa-YZnm5Z4Pyb4XZppdA":{"text":"This is the best steakhouse I've ever eaten at!\n\nWe were seated promptly for our 9pm reser","useful":2,"cool":0},"-fdrSKxBAWpH-zm5wRhkNQ":{"text":"Horrible service. Hostess was rude and snobby. How is it that a hostess is snobby? Ridicul","useful":1,"cool":2},"4N80xQOud1v4C1ezUi6owQ":{"text":"Doris is the best new restaurant in New Orleans, and maybe my favorite among them all.  I ","useful":1,"cool":2},"qGk6DATXf9M8cATRdDpk5A":{"text":"Classified Cut Steak and the Potato Surprise were among the outstanding secrets I consumed","useful":0,"cool":0},"4QhC276CbBCn2fvz0Q9wJQ":{"text":"Classified steak was fabulous, unbelievably delicious hard to describe but so good with th","useful":1,"cool":0},"gXfClPdm49e2LpkJLTSpOQ":{"text":"AMAZING!!! Everything from the service, food, atmosphere, and music is impeccable! Make su","useful":0,"cool":0},"83gxPrNakIcl5n5g0QdK0g":{"text":"Getting lost is the best way to find a place you've never been . Just as we did finding Do","useful":1,"cool":0},"5dpgz1j98Lw4G2ICCQ3REg":{"text":"We loved the ambiance, food quality and design of the restaurant. It is the money worth. \n","useful":1,"cool":1},"QMnj7MJy1484bx7-RbshWA":{"text":"This place is a bit overrated in my opinion. I don't like the fact that it's not family fr","useful":0,"cool":0},"rbyV5B8gmtVOhvttcx7ZUw":{"text":"Maybe I was expecting too much based on the glowing reviews, but I have to say this restau","useful":1,"cool":1},"taBVRL_gufslSgQQ954D4w":{"text":"The Butcher's Cut was delicious. The service was fabulous! It was 30th wedding anniversary","useful":0,"cool":0},"Hl0EHn4rREqIgc_2wf_hPg":{"text":"This is a great steakhouse in New Orleans. I had the rib eye and it was cooked perfectly. ","useful":0,"cool":0},"yfbFco-PDcVMuGInoCmYGg":{"text":"Outstanding meal! Phenomenal service! We are visiting from Ft. Myers Florida and would rec","useful":0,"cool":0},"w2dCcD_KYmljx3axlunxuw":{"text":"Absolutely the best meal I've ever experienced. I'm typically not a steak eater, but would","useful":1,"cool":1},"bVciuP2tF-7aRYGl4oLljg":{"text":"Wicked good!  The first thing you'll notice is the warm a welcome, great service and class","useful":0,"cool":0},"0Id-97cmvJCa9leAuXy9YQ":{"text":"NOLA isn't known for Israeli food, but that might change now. This place serves excellent ","useful":0,"cool":0},"aywWa229uIagCSxaukXbPg":{"text":"My wife and I ate at Doris for the first time yesterday.  As others have mentioned, the Be","useful":0,"cool":0},"zDanHcRTApC7ejA6cyvlGg":{"text":"We had a wonderful 1st anniversary at Doris. Our waiter Troy went above and beyond to make","useful":1,"cool":0},"zlSSpwiPXGAQ6GgTB0ZnaA":{"text":"Amazing restaurant.  Excellent service, ambiance, and the food is delicious.  I loved the ","useful":2,"cool":0},"TxiuFSePtybEmULq96Eoig":{"text":"I'm the kind of girl that makes a life-long game out of neighborhood bar-crawling-- having","useful":4,"cool":0},"bCgN_HbPwB9LWoFUTU6VUg":{"text":"First timer here.  The ambiance was cozy and comfy. The service was flawless but very invi","useful":0,"cool":0},"Q75jIIBApbe4YlnK_RmNXg":{"text":"We had a great meal here. A much more modern take on a lot of the food but all well prepar","useful":0,"cool":0},"qyq5kxwMGfL-Pr8RZbLczw":{"text":"Best food and service, ask for the waiter that took care of us Jerren. We happened to stum","useful":1,"cool":0},"1RIGI6BHiS9sIv-ddgD1cw":{"text":"First off,  great music selection and not too loud, nice decor, very nice and professional","useful":0,"cool":0},"Vm_2PE9udIMTUgZNm-P76g":{"text":"Great service and a wonderful meal. Our best in the city. The aged ribeye was perfect.","useful":0,"cool":0},"QPNvCiACOMXpHw8t-RNBxA":{"text":"Walked in on a Wednesday night and was immediately sat.  The steak was cooked amazingly an","useful":0,"cool":0},"fWLAHqV1sIR4VRY3yeHPKg":{"text":"Just wow! One of the best place I ever ate! The food was delicious, the service was great!","useful":0,"cool":0},"CxhEKZucM3lp7m71gUWyRw":{"text":"Apparently this is the place to come for a wonderful steak!! Very nice ambiance... Wait st","useful":0,"cool":0},"j-5FRBd7hsETx_qbbcWDIA":{"text":"Unbelievable! Probably best steak we had in our lives! We were visiting and were looking f","useful":1,"cool":1},"cZda9XJzAPC-JtPJfWFCKA":{"text":"I'm in bed staying up late just to write this review. That's how good our experience was r","useful":0,"cool":0},"-VwGZnHAftBVxKtS_F_f3A":{"text":"This place was amazing. I'm not 100% sure, but I think we had four custom cocktails. We di","useful":0,"cool":1},"ToHYo8GNQcGGLK9wqVF-hg":{"text":"I can't say enough good things about this amazing restaurant!\nThe service is amazing. They","useful":3,"cool":1},"mNb1UR_PT2Iv5qZZb4LAHA":{"text":"This was honestly the greatest service I have ever received! My waiter Clayton was amazing","useful":0,"cool":0},"naCATTx139qg54l9anZ4Xg":{"text":"Was told how great this place was but was unimpressed. Just FYI it's not Cajun and I can g","useful":1,"cool":0},"tQbECO1rw2kS0YkHB47gCQ":{"text":"Micah behind the bar is fantastic and not only is knowledgeable about the drinks but can i","useful":0,"cool":0},"2a2wJDlaqpslF4NqtI5KCg":{"text":"We had dinner here on Father's Day! What a great experience.  The outside façade of this p","useful":2,"cool":2},"6U81L24c98dL43Bq6XsGgA":{"text":"Best burger that I have had in awhile. Fabulous truffle fries. Really nice ambiance. Great","useful":0,"cool":0},"G4dhgz1OcvBI4fTGdxUVsQ":{"text":"This is my new favorite steak house! The quality and selection of steaks is awesome, with ","useful":1,"cool":1},"BSUf_Lz6jKVFZd9ZKzohAg":{"text":"This steakhouse is excellent. The 21 day aged boneless ribeye is a steal at $44. Easily en","useful":0,"cool":0},"e5yRHpIBZeKozeD3AWZVqg":{"text":"There are so many mediocre tourist restaurants in the French Quarter. Ironically , several","useful":0,"cool":0},"wuV_z7fHzk60nns3NGV8ow":{"text":"Exceptional service and food.  Appetizers divine as were cuts of beef & desserts.  Best me","useful":2,"cool":1},"43fL999ybf18dJflI-zM7w":{"text":"Amazing steak.  I visited Doris Metropolitan during a trip to New Orleans.  The food was a","useful":1,"cool":0},"L950OypkNpyaZJa4SjbXSQ":{"text":"Great steakhouse, ordered the filet rare. Was cooked and tasted perfect. Love the fresh ba","useful":0,"cool":0},"8bR1inohy8vR2-YF_mLiHg":{"text":"Me and my girlfriend just had a date night here.  Everything was great! Our waiter John wa","useful":1,"cool":0},"BWSCo5DzFOCNZ98RIM0DVQ":{"text":"Being from Texas I am used to great steak but Doris does an amazing job of aging their ste","useful":0,"cool":0},"sItXWtpv4ITsiRCK6yGQcA":{"text":"Wow... I've found a new respect for this establishment, after an abysmal initial experienc","useful":3,"cool":2},"MfKsBq_KUNLDBj16KrTT7Q":{"text":"Had dinner here during our first visit to New Orleans. Great food and service. We split th","useful":0,"cool":0},"62rA9O1HbslWd6eO2VHw0Q":{"text":"Food, high level service( they take care of customer well and realize delicate sign) , fas","useful":0,"cool":0},"PZvIjHQU8rzX19Tfgq5lhg":{"text":"This was by far the best service and atmosphere out of every New Orleans restaurant. We ha","useful":2,"cool":1},"Z50KfIdKt7K_iM2L40LO9A":{"text":"Great atmosphere, service and drinks we all great. Best dish of the evening was the Chatea","useful":0,"cool":0},"JMVCnk2OkLlqub9465iILg":{"text":"We discovered Doris Metropolitan on a recent trip to 'Nawlins, and it has become a new fav","useful":0,"cool":0},"u47Q9WTLtF8kRInknZDRPQ":{"text":"The atmosphere was nice, but other than that not impressed by this steakhouse. My steak ca","useful":0,"cool":0},"Yg6fTO6kev71foNW_SNqcQ":{"text":"All I have to say about Doris Metropolitan is Wow. I could end my review here but I want t","useful":2,"cool":4},"szHaNZ2jzUWuy6d1YPUUug":{"text":"Amazing food and service. This was my birthday meal, and a perfect one! We got the 21 day ","useful":4,"cool":3},"GBzgQlE1QilOsfKQfzlhPg":{"text":"We came early as they were open at 5.30. Friendly staff great us. Food, cocktail and servi","useful":0,"cool":0},"xL18An2t9N6_K2W8ky68Lg":{"text":"I wish there were an option with more than 5 stars so I could give them to Doris. I was ra","useful":0,"cool":0},"gC0nCwGIJ943_c1rBkPiiw":{"text":"Wow... Can't speak highly enough about this fine establishment. First off, the food was AB","useful":0,"cool":0},"36JPbGJDOARGVnfYDQ-5fg":{"text":"Went here for a dinner with a couple of guys, steaks and service were very much on point. ","useful":2,"cool":2},"rntpHFB8KXFQVQT8Fv46FA":{"text":"Everything was beautiful here. Our server Yan, was amazingly knowledgeable, and I was anno","useful":2,"cool":0},"brRdwBXk-S_K9uuLH0_c4Q":{"text":"Our last night in NOLA, we reserved to dine at Doris. Very nice ambiance, steaks amazing, ","useful":3,"cool":1},"wXXMMta4kJ65MjsJSsQ0lA":{"text":"Had reservations on 5:30PM on a Saturday night.\n\nAtticus was our server and he was great o","useful":0,"cool":0},"eLxpU8N2q1dYXl7KLPucRg":{"text":"This restaurant will do well in the quarter. The service is very attentive, exceptional ac","useful":1,"cool":0},"K-_tgOAKot3DLyrl3nddvQ":{"text":"My wife and I celebrated our first year anniversary last evening on December 12th, 2015 at","useful":0,"cool":0},"85t7azOzXtFmsq0Wl4xqKQ":{"text":"Best steak in Nola. We split a porterhouse, great flavor and very tender. Ordered 3 appeti","useful":3,"cool":0},"ENgYTuJ-KN3yIfPFt70Duw":{"text":"Tonight was our last night in New Orleans. We chose this restaurant based on a recommendat","useful":0,"cool":0},"DRmGw9qCPcBtl5VQanqXkg":{"text":"I went with a friend to Doris Metropolitan for burgers last night. We've been before and e","useful":2,"cool":1},"2GfpzZlWsVcr0YgAco3Mug":{"text":"Worth every penny!!! The Rosemary bread was great, other breads were ok I guess. Had the g","useful":0,"cool":1},"lab1FiKcWZ2jtpnQAdelSg":{"text":"Standard steakhouse. Food was prepared perfect but nothing particularly spectacular. Howev","useful":0,"cool":0},"_0v9g3K24OvAhvf2ePUnhw":{"text":"On the recommendation of a friend we walked into Doris without reservations. As you enter ","useful":1,"cool":0},"y6CReOJg03O6wDeYbEHGvg":{"text":"Loved this steakhouse so much we're repeat visitors and give our friends gift certificates","useful":0,"cool":0},"BbTarurcvudOelRNJX80tQ":{"text":"This restaurant was recommended to us by our hotel concierge. We arrived around 9pm and re","useful":1,"cool":0},"VfYg0yljOXmGJpgZlZjpkQ":{"text":"Wow...all I can say is AMAZING ! This opened in the old Alpine restaurant.  Check out the ","useful":3,"cool":2},"e1I_n9mrLu-a2-1xIvgAKA":{"text":"Incredible. Very nice interior, thoughtfully decorated. Open Bar is especially very cool.\n","useful":0,"cool":0},"8me4J_p4OT0DlcwfXT6tXA":{"text":"Simply the best piece of meat I have ever eaten.  I was skeptical when told that all I wou","useful":1,"cool":1},"ui8mvsjaycdUWn8wove6Eg":{"text":"So.. I'll start off with the good: The food was fabulous! (Pictures to follow)\n\nMy girlfri","useful":5,"cool":1},"ZHd-g_iHRfqN5HhesWd6yA":{"text":"Very spotty service.  Sitting near the bar area at the high tops and the bartenders state ","useful":1,"cool":0},"jbIEU3jM4nhnKo_N7_V3VA":{"text":"Delicious and honestly one of the best steaks I have ever had.  Service was great.  They h","useful":1,"cool":0},"a4db2rQUaTi1De5VIPscpw":{"text":"Doris Metropolitan Fall Review\n\nDoris Metropolitan is located right outside the corners of","useful":1,"cool":0},"RtystHaF1nMyzrFbr99N6A":{"text":"The sweet breads were good, everything else needs improvement. \n\nFruit flies everywhere, j","useful":3,"cool":0},"IFcJ6zADSE6BeoF82PC7yA":{"text":"The service was excellent and the restrooms were nice and clean, added bonus... mouthwash!","useful":1,"cool":0},"47wkidhw5-RhdnMUxGCkmA":{"text":"This is a really fine place to enjoy a good meal.  Chic and modern. Great service. Wonderf","useful":0,"cool":0},"7RWcQKn3Wl5dQ2Mm_1pp2g":{"text":"Beautiful space, in a great little spot. The steaks was fantastic and well worth the hefty","useful":1,"cool":0},"4u0bd_nUQ25lOGGANMg5ZQ":{"text":"I was trying to set up a private birthday dinner and had a really bad experience dealing w","useful":1,"cool":0},"Vcl_QMvafGyZC8H3-C8ifw":{"text":"We are foodies and love the New Orleans food scene, but this place doesn't measure up. Too","useful":2,"cool":0},"hRhvr0w6L807eGd8hFOJug":{"text":"What a great experience.   The service was probably the best I can remember.  We got about","useful":0,"cool":0},"1N3v_HlC0RfbdtxTzx5a-w":{"text":"This place is top notch service, excellent food, my serever was fantastic helpful cheerful","useful":0,"cool":0},"jbYSzUogpH-U8cjh9o33yQ":{"text":"Came out to New Orleans for a little vacation and went to this place the first night we we","useful":0,"cool":0},"99SlSic_DB5Nlh9oJb2WMw":{"text":"I read the reviews and also had recommendations from waiters at other fine dining restaura","useful":1,"cool":0},"u0Ee00KJLHL9idnJE0aQSw":{"text":"This place is disgustingly good. If you are a fan of sweetbreads this is a must have.","useful":0,"cool":0},"3-c-il7M_0mDinoQ7bjCVw":{"text":"Got lucky and was able to get a table at the bar. The menu is simple in the sense that its","useful":0,"cool":0},"yVGQU0eyz0cHZRjgyW8RCw":{"text":"Steak was good. Sides and appetizers were unimpressive with  the polenta tasting like heav","useful":2,"cool":0},"xigXmp-rCwgcENnZqB1-Kg":{"text":"Dined hear Christmas day while on vacation.  Food was awesome, service excellent.  The res","useful":0,"cool":0},"YQnflHvipLYvol3aQ-gWIw":{"text":"First visit to Doris.  Our waiter was Johnny.  Johnny was not pushy, hovering or aloof, in","useful":1,"cool":0},"V_Dn0Q6n6f6jRHhtBx1g2Q":{"text":"The steak was too tuff. It's a shame because I know they dry age their meat which should h","useful":2,"cool":0},"dRM4f--xQ78m-eaU1iuZTQ":{"text":"After seeing many great reviews about Doris Metropolitan, we had decided to try it out. Th","useful":1,"cool":0},"fE5--YsRGdUGe1BVkb1ETA":{"text":"Went here for an anniversary dinner with my boyfriend. Service was quick, someone checks i","useful":0,"cool":0},"Rt9CmnOc0qIeBr4mnZUUrg":{"text":"We were in New Orleans for the weekend and based upon recommendations from friends and a f","useful":2,"cool":1},"BjvwU4Se5gNS3TMhmoc4zA":{"text":"The food is amazing. 10 green salad had so much flavor with no dressing (best part of the ","useful":0,"cool":0},"_cNuAusAAsUtrNHqBtHoYQ":{"text":"Thanks to the couple that sit behind us in the Dome, we had a great meal last weekend. I h","useful":1,"cool":2},"BnuuTscSI6tEpySuBBIRyw":{"text":"4.5 stars.  The food was delicious, our party of four all got the Classified Cut Steak wit","useful":0,"cool":0},"r-ac7IqCOMNmYZrQdPUdoA":{"text":"Great steak place.  They have some good cuts of beef and if you are with a group you can d","useful":0,"cool":0},"VDP2wngBMdB0oFqrZMmWdg":{"text":"As I was gearing up for a business trip to New Orleans, I started researching restaurants ","useful":1,"cool":0},"Le0ZYo7I2w9t4kJrgC3CIg":{"text":"We went there as a family during our visit to NOLA. Four of us has steaks. First, this res","useful":3,"cool":0},"wCVZsUu_Iowvfcy0mHLOmA":{"text":"The food was delicious and the service was as well. The rib eye was mouth watering pair wi","useful":1,"cool":1},"Ip2Mr0tgnQi2iRJsl3CH1w":{"text":"My boyfriend and I visited Dorris while in town to celebrate his birthday and we weren't i","useful":2,"cool":1},"qm6c3_O9SPvOnumTzPTmtQ":{"text":"One of the fanciest stake houses in new Orleans. I'm from Los Angeles so I have pretty hig","useful":1,"cool":0},"5vA3CMlGBqA6IBTgw2c18g":{"text":"Great space & location in the French Quarter.  Inviting bar & overall decor.  My friend ha","useful":2,"cool":0},"TWx1C80B4FwYTwTW0QQJQQ":{"text":"A wonderful restaurant with a nice ambiance and tasty dishes. The porterhouse was excellen","useful":0,"cool":0},"fv2pE46CDZ2oUsJwhSzpRQ":{"text":"Three of us dined Saturday night & sat in the courtyard. The restaurant is deceivingly lar","useful":1,"cool":1},"oEQp7He6dYBr4CGj51NBxA":{"text":"Exceptional, quality food with a Mediterranean twist\nOutstanding tuna tartar \nOutstanding ","useful":0,"cool":0},"dlNGRyzWdRgnJekm44Jn4g":{"text":"My husband, two year old son and myself went here for Sunday Brunch.  The staff was amazin","useful":0,"cool":0},"rYB3NMcDhPhx_VwiuG8PDA":{"text":"Frankly put this is my favorite restaurant in New Orleans. The service is always great . T","useful":0,"cool":0},"tf6mZbDFBfD4i2NMgNnTHg":{"text":"My favorite eating experience in New Orleans. The dishes here do not disappoint. The desse","useful":1,"cool":0},"fUuBWSV372Cmb0-XQca92w":{"text":"Okayyy Doris! You definitely know your steaks honey! \n\nThe meat was cooked to perfection (","useful":3,"cool":1},"cl4jaCqD8Fq4sNvM7yy2Qg":{"text":"Wow the steaks are made really well. Fine restaurant. Great service. I really enjoyed. Had","useful":0,"cool":0},"I0O5RqawZ5J8VPx6IO9zbw":{"text":"Made reservations here. Fabulous dinner!! Celebrating husband bday. Service was outstandin","useful":0,"cool":0},"TzAM_KTLnJ8CG8VhkO_Ryw":{"text":"Superior steaks. Absolutely, delightfully tasty. The calamari app smelled absolutely awful","useful":1,"cool":1},"O2jcgWXQQ6CxYcig9ZA_oA":{"text":"My family had a reservation at 6:30.... we were not served our food until 8:30!!!!! Althou","useful":0,"cool":0},"NQtJ_kaHjLK3QvLD9q_pLQ":{"text":"Really loved this experience. Our concierge at the Monteleone recommended Doris and we now","useful":0,"cool":0},"nlFf9kOQzxiFyb5LANiVQw":{"text":"Really good food...had the beef tenderloin wth a side of bone marrow. Ask for Ozzy the ser","useful":0,"cool":0},"_iz6kCwjbB4J1gZYAqBYvg":{"text":"New year new review!  We went to Doris for dinner for my birthday.  The atmosphere and dec","useful":0,"cool":0},"2d7bixKXgFsxWrQAUUna0g":{"text":"I wish I could give a higher rating but I'm going to give 2/5 stars for service and 5/5 fo","useful":2,"cool":0},"6UCM0SMw4A1pM79-eResdA":{"text":"What an incredible experience - from the greeting at the door, conversation and attention ","useful":0,"cool":0},"1eGoUSnTB5BIFeWya56xQA":{"text":"Cozy ambience, great food. The staff were very informative regarding the food, cheese and ","useful":0,"cool":0},"2mzAzs2FuFHoFpqqax_SWw":{"text":"Seriously....I am close to LA and palm spring and have had many amazing steaks. This by fa","useful":2,"cool":2},"LRos43uW252sCHC2zgx5Zw":{"text":"Amazing food and the best service!! I will go there every time I'm in NOLO. From the bar t","useful":0,"cool":0},"UT7qa8jL65USE1MhulfRjw":{"text":"Last night my husband and I celebrated our one year anniversary. We came in about ten minu","useful":1,"cool":1},"csXtx591lne2hYjXDlkMog":{"text":"Great steak, got the filet and the truffle polenta. Will be back. Bar area is very nice an","useful":0,"cool":0},"9Ixxs-T8iNbeYKo0nJtnnA":{"text":"This is the restaurant for the preeminent steak in the Crescent City. And I may just want ","useful":7,"cool":3},"P7TjJGiMk99bpEa1N0AXGA":{"text":"This was a great find. We were a party of 12 looking for somewhere to eat at like 9:45pm. ","useful":0,"cool":0},"dfMpYMdqdHwBXwWuQWc2yQ":{"text":"Doris is AMAZING! Filet mignon was phenomenal the sweetbread was incredible. Hands down th","useful":0,"cool":0},"b7E7oGess8hhwwmbLcXalA":{"text":"Upon reading reviews and me and my friend wanting a great piece of steak, we ended up here","useful":2,"cool":2},"_vhqjW31cAEE6KPBZ4p1og":{"text":"Favorite steakhouse.  My fiancé takes me here.  Lots of inventive appetizers not typical o","useful":0,"cool":1},"fhzPNzeTuRw92i8YpJUgXg":{"text":"We made a reservation for nine people at 9pm several weeks in advance. We called at 7pm th","useful":2,"cool":0},"AuAbYvf5-t4pGDhDgu5XKg":{"text":"Is it possible to give more than 5 stars?? This place is amazing!! We sat at the bar for f","useful":0,"cool":0},"oolzWlrTZWM1cNyWx9M8og":{"text":"Pros:\nWe arrived early for our reservation and the server apologized for not having our ta","useful":2,"cool":0},"hfDlaZxo90_aJwJnfOeY-A":{"text":"The service was very slow, the seating was very tight. They pushed 2 tables together to ac","useful":1,"cool":0},"z_Gx7GsgK4NfTtMEMq38yw":{"text":"Wonderful, top of the line service. Food was excellent. I was expecting \"typical\" steak ho","useful":0,"cool":0},"4-N70kPt0mq2_ZqxMgt-oA":{"text":"AMAZING!  we went here twice on our trip to NOLA. food was wonderful, staff was excellent ","useful":1,"cool":0},"w4SgCsQnhn6JZmSKNtZ1yg":{"text":"I knew when we walked in that the dry aged steak room on display was a good sign. \n\nServic","useful":2,"cool":1},"cbaukoiTKrQNCdW6nvdJkw":{"text":"Incredible meal.  The A5 Certified Japanese Waygu New York Strip was the best steak I have","useful":1,"cool":0},"MTl4EY-0_wtvIxWFXR0VrA":{"text":"I call this restaurant - Sexy Meat (it's classy, it's swank, it's beautiful, it's unique .","useful":13,"cool":11},"iTclDoBC68NgSZW2Y-pHAQ":{"text":"Quite simply, the best steakhouse in NOLA. I say that, and I'd have a hard time naming ste","useful":0,"cool":0},"I7gXiMk-H_pG96xr1k7ixQ":{"text":"Stumbled  in late one night  and then realized it was a place that Brandi , our favorite b","useful":0,"cool":0},"HxIv-u9KzYaRIcPviHdgZQ":{"text":"Great food , but atmosphere for our occasion was kinda on top of each other. I called to r","useful":1,"cool":0},"bCzURgMe6_r7fjXxqtHPHg":{"text":"High quality Steakhouse with good service. Some of the offerings are very original. Classy","useful":1,"cool":0},"aqdjx7IQ6TWT3ZTnJjTMyw":{"text":"had a great experience here eating dinner at the bar. loved the carpaccio and liked the tu","useful":3,"cool":0},"n4CHU7pX6OKcM4me-A8ERA":{"text":"Our waiter, Clayton, was wonderful and our steaks were amazing! I will 100% come back here","useful":0,"cool":0},"dQw-wqKn74XIwQniw1_pKA":{"text":"Came here because of the good rating but left disappointed. The aged ribeye steak we order","useful":0,"cool":0},"vaCvZlIFQCJrjoGnyFJ1Bg":{"text":"Dinner for the 2nd time. The first time was a couple of years ago-it was great then. Tonig","useful":0,"cool":0},"kWAoB7_KtuAaJSWOfcy60g":{"text":"We ordered the Tuna Tartare, Carpaccio of Beef, and the Falls Off The Bone beef ribs.  Eve","useful":0,"cool":0},"TtY1HlcJInN3mBkd0A-rHQ":{"text":"Doris is a hidden gem. It's quite an expensive gem, but it's worth it! I had dinner there,","useful":2,"cool":1},"kwrxv9G4I7h6C8IqltmBTQ":{"text":"My husband and I made reservations a month in advance and were very much looking forward t","useful":1,"cool":0},"i-nxQ6WB_JZbhyvfdL2y1Q":{"text":"I'm not sure How I didn't know this place was here. I was really a wonderful find. \n\nParty","useful":2,"cool":2},"oewoAg6gj4nymeqygxi_AQ":{"text":"Heard this place serves the best steaks in the city!\n\nWe made a reservation online, which ","useful":5,"cool":1},"bltZn1vCXsv_IE9EnOit_A":{"text":"Enjoyed my experience here. To kick things off they made an awesome Ramos Gin Fizz that go","useful":0,"cool":1},"zK9me70BZlvPemXo3qaIQg":{"text":"We were able to get two seats at the bar at 8:30 on a Saturday night and got see the kitch","useful":0,"cool":0},"Za452VUV9TSRtVg8k_O4iw":{"text":"This place has delicious food and a beautiful, sophisticated atmosphere-- particularly at ","useful":1,"cool":0},"j_bRgVev69culuZ48zAhSw":{"text":"This is a top notch restaurant with the menus to prove it.  From the caviar menu, to the e","useful":0,"cool":0},"Ruh42YjTdvETLvv_h4BN0A":{"text":"This is the best steak house I've ever eaten out. They dry age their meat to create a more","useful":0,"cool":0},"X3XO54Yq5a-MiaS13ySFfw":{"text":"I came here with my prescriber and a girlfriend on a work trip. The meat set up was awesom","useful":2,"cool":2},"VDw8afc1LGxyj9eZMsuIKQ":{"text":"My favorite Steak house in New Orleans ! The service is on point and the food of off the c","useful":1,"cool":0},"YuvpbKp-zwxg5IJ4ml2Mog":{"text":"Might be the best steak I've ever had in my entire life. Service was great and drinks kept","useful":1,"cool":1},"cYGV2YmCVum6mEQcHd1FXg":{"text":"Perfect manhattans were perfect. Porterhouse was done nicely. Stuffed beet first course wa","useful":1,"cool":0},"TdhBARUJ6C6S4Do6zpkR9w":{"text":"We had private dining for a friends birthday with a set menu. Yes it's pricey, but it is a","useful":0,"cool":0},"SLyzCjvW-zJccePdZu9o3A":{"text":"Awesome vibe, great food and service. Loved watching the kitchen staff cook. Burger was am","useful":0,"cool":0},"XJkFWtZ_PEFsWt3hhmxJdQ":{"text":"I highly recommend this restaurant if you love food and ambience. The appetizer we ordered","useful":0,"cool":0},"QNxZUQfYiAChZqJUqA0SwA":{"text":"Just had another great meal at Doris Metropolitan. Chef's special tonight was a Wagyu Toma","useful":1,"cool":1},"mSmz5mZ5_F6o6GZJoEUZ0g":{"text":"This measures up the the hype. I had the filet with bone marrow and it was cooked exactly ","useful":0,"cool":0},"yo2QJRlkWa7e65vE7mXnjQ":{"text":"Overall the food was really good. But I DONT recommend The Classified Cut or soggy asparag","useful":1,"cool":0},"zYEe5Lb_QpGb1mRxRERaRA":{"text":"Doris Metropolitan is amazing. \n\nTheir complimentary three types of bread, three different","useful":1,"cool":2},"OGge3kN8iiwQexp8AekRcA":{"text":"The first time I went to Doris, I was amazed. Exceptional service, great decor, innovative","useful":0,"cool":0},"f4XHtzRyflKRaNXOTkelAg":{"text":"The food was good, as was the atmosphere, but for the price, the place did not wow me.  I ","useful":0,"cool":0},"z3eMSG8r144kZ5xWsG2K-w":{"text":"We decided to make reservations for a nice dinner our last night in the big easy and I got","useful":0,"cool":0},"Fq6D2JZ9SjcooLsdOkP0sg":{"text":"It is a credit to this steakhouse that I first visited it to eat salads at the bar because","useful":2,"cool":1},"fxJt-TQnas_QMStjsOYMGg":{"text":"The food was delicious! A lot of locals recommend this place and it did not disappoint. It","useful":0,"cool":0},"zzLsSbpTREOsIvNlkebrSA":{"text":"Holy Smokes this place was amazing food to the atmosphere! Even got to meet the Chef and t","useful":1,"cool":1},"SrRNhchGyZHgy2yzj0-8CQ":{"text":"3.5 stars is probably more appropriate.  I had a solid experience here, but it didn't live","useful":1,"cool":1},"mapBqeaNmz2g9XcKa7xYaA":{"text":"I was that annoying person who had a 9:30 reservation for a party of 6, which turned out t","useful":1,"cool":1},"f3ZVfmr_G97I403jXAnjcg":{"text":"omg... I LOVE this place.  Great service.  Quality in every area: steak, appetizers,  brea","useful":0,"cool":0},"d7wgJa_IjZxWHJstIbnrgw":{"text":"Great service, dim lightening...perfect for romantic dinners and/or anniversary celebratio","useful":0,"cool":0},"xxSPhX-pIwsrGqgkkW1Mlg":{"text":"Me and my wife was visiting New Orleans on a little getaway from our daughter. So while we","useful":0,"cool":0},"8cm6Wo2csfhj5DsJ4_CLAQ":{"text":"Every time I come here I leave with amazing memories and a very happy belly!!! The food is","useful":0,"cool":2},"YBVb6UmU8NtBtWhC-p53Cg":{"text":"Came here for my BDAY 8/20 and the experience was great!! From the RSVP call to the our se","useful":2,"cool":1},"Nc4kPnTM3oC4UGlMc4Dpcg":{"text":"We had the tuna tartare, Bone-in Rib Eye Cap off and Falls off the bone. We had some gratu","useful":1,"cool":0},"q6C000OBxnzywkzAUnpfUg":{"text":"This was a stellar meal. Beautiful decor. Tasted like authentic Mediterranean food. It's a","useful":0,"cool":0},"W7qYDT8glf4YUgrv-Wl70A":{"text":"The experience was very nice. Wait staff was excellent. The food was good though we didn't","useful":0,"cool":0},"oiFdvlCivqN7CvOnlejp9Q":{"text":"Doris metropolitan is awesome. Great food great service. The only restaurant I have come a","useful":0,"cool":0},"C91Z4JGnFiliyeVVpfoMbA":{"text":"First time @ Doris which was okay... The tuna tartar was awesome, but not what we expected","useful":0,"cool":0},"vEhUhATlHBtefYFDvekclA":{"text":"Service was good, the green salad and the tomato salads were both spectacular. The bread w","useful":2,"cool":0},"tQNb4OUeb1404fLqVJKqFA":{"text":"We heard they don't give you steak knives because the steaks are so tender you don't need ","useful":1,"cool":0},"7nepSxGIDFAWC_lrBz0kfw":{"text":"This dinner was an experience. The food presentation was some of the most beautiful I have","useful":0,"cool":0},"SuBHk10RDOqFcOnc2Xu3cQ":{"text":"Showed up here for dinner impromptu on a Saturday night, late, and were seated within 5 mi","useful":1,"cool":1},"xoQH-8G0X-I0JtZuGBxjtw":{"text":"We had lunch here on Sunday and it was incredible. The minute steak with chimichurri was t","useful":1,"cool":0},"KpHVd1jC-qI8egQRtmu2vA":{"text":"If you crave juicy, tender, flavorful beefy nirvana- this is a Nola must!!  Bonus f**king ","useful":1,"cool":0},"KK6cnUPgXVYHR4LZEJOGmQ":{"text":"Just left this place and felt compelled to write a review. We sat at the bar and ordered a","useful":0,"cool":0},"hT1JbLvFuX0uDGYW-WcQVw":{"text":"Amazing service and amazing food.  I wasn't super hungry so I got the filet and the truffl","useful":0,"cool":2},"4kh-jns-r5XKOpl43gOMkA":{"text":"One of the best meals I've had in New Orleans, and in my life! \n\nEverything about this pla","useful":5,"cool":2},"akyX-beM1no6ppnBtsplqA":{"text":"A GREAT dining experience. We sat along the street side and it was very quiet, intimate ye","useful":0,"cool":1},"N5wPafDgVM2wMTl7WuHqDQ":{"text":"Doris Metropolitan, is off the damn chart delicious! \n\nWe started with a bottle of red win","useful":0,"cool":0},"4KuZPHmC_-9yQoh5A8qpbw":{"text":"Been coming to New Orleans roughly every other year for a conference since 1999. Doris Met","useful":1,"cool":0},"bFSedJD83SQzhqO4p5Kbjg":{"text":"The ambiance is great! Food is delicious! You can't have enough of their homemade bread! T","useful":1,"cool":1},"WVxNkU7WBraxs21DbHPsBQ":{"text":"My fiance and I went here for a date night and were impressed in every way. Our waiter was","useful":2,"cool":2},"UhM7gyyys4MOpba-2ZcuXg":{"text":"Whether you're looking to sip on a cocktail at the bar, have lunch with a colleague or rom","useful":3,"cool":1},"AqoPX6ti4J37-1-8690ZEQ":{"text":"One of the best steaks I have had. The service, food, atmosphere were top notch. Had the c","useful":0,"cool":0},"jTyLgX5HiBGpDPH8duhgxw":{"text":"Amazing food and wine!!! The restaurant is beautiful and everyone was so friendly!","useful":0,"cool":0},"ApSMIU7_UahG34kI7LehUA":{"text":"Best steak ever! We were in Nee Orleans for 4 days and ended up having dinner here twice. ","useful":1,"cool":1},"idE4a46fOeQ0QKYpSAnOfA":{"text":"We Found this place while wandering around NOLA. They display their aging meat in a room v","useful":4,"cool":1},"BTWnz-1VjbPFxmx3f2OYIg":{"text":"What a horrible experience! Went before \"Chicago the Musical\" at the Saenger. Ordered the ","useful":10,"cool":1},"OQ70h8uSMSOTV8oCA1rlqg":{"text":"This is most definitely my favorite steakhouse in New Orleans. The staff and service is al","useful":0,"cool":0},"JjGpWcyFzZ4rQbMLNmDz-A":{"text":"Why have I not tried this place sooner? I've gone here for my birthday last year and it's ","useful":1,"cool":1},"aFV0FdXKJUnuMaQ6DY_k3w":{"text":"We were surprised to run into this restaurant during our visit in New Orleans as we know t","useful":0,"cool":0},"YSORWkoy91cz3tzxXzp_jA":{"text":"My friends and I came in early for dinner on thursday.  The food was Great, some of the be","useful":3,"cool":0},"d63Cg95VLeMJ4JSo1NUThg":{"text":"Went here with a couple guys to eat steaks. I decided to try the short rib. It was excelle","useful":0,"cool":0},"ClSEsHcSD9Em_piE-0Z4qg":{"text":"The bartender at the Chartres House informed me of this fantastically delicious restaurant","useful":2,"cool":3},"mExOY_xAe7g5hG4vipPTOw":{"text":"This was our first dinner stop in New Orleans for a long weekend.  Ambiance and service we","useful":0,"cool":0},"crERkTc9Ccs8VM9Ps5nkNg":{"text":"Great Steak Restaurant, absolutely the best ribeye steak I've had.  Perfectly cooked aged ","useful":0,"cool":0},"XIo4f4SWu2Ya64U6Mh5kRw":{"text":"If you haven't been here you must go!  The best steak in the world!  My mouth waters just ","useful":0,"cool":0},"ro7qVPp4pwn7p7UkNqKLvA":{"text":"We ordered an amazing bottle of wine, tuna tartare and the carpaccio to start. I was a fan","useful":2,"cool":1},"UdyPKfuvE0iXeiD-Fx85dw":{"text":"The best meal I have eaten in a long time and we eat at a lot of nice restaurants! Stopped","useful":0,"cool":0},"f62ouNQoyqKatkhGAanp2g":{"text":"Been hearing so many good things about Doris and we finally made dinner reservation for it","useful":0,"cool":0},"HyhMl_ky75CJ4-l_5Hj9eA":{"text":"Updated 9/26. We returned to NO and were so excited to visit Doris Metropolitan again. We ","useful":0,"cool":0},"gazhACDNOTlAgBWCjyWQRQ":{"text":"I went to Doris the other night for the 2nd time since being in the French quarter. My ser","useful":0,"cool":0},"o0WDq-SZyFiq2xXdrKUfKw":{"text":"Really good food...had the beef tenderloin wth a side of bone marrow. Ask for Ozzy the ser","useful":0,"cool":0},"old8I8JutabunXPfVRHjTw":{"text":"Doris Metropolitan came highly recommended by a few people I know who are regulars there. ","useful":3,"cool":2},"5J_PmvD7m6h5FJpl8E3nWA":{"text":"We decided to come as part of our anniversary weekend.  My wife never wants steak but when","useful":0,"cool":0},"Y7CzNU19Ja0zqwTq_JORKA":{"text":"We had a very enjoyable evening last week. Wife and I and with two friends had dinner arou","useful":0,"cool":0},"nat4vyFWvyvXoYICKabI9g":{"text":"AWFULLLLLL!!!!' One star for manager comping most of our meal because our cheese board cam","useful":3,"cool":0},"YPOVHnSJ95L-fY2epjz2Ow":{"text":"We love 'Nawlins and come here frequently. We always stay in the French Quarter and always","useful":1,"cool":1},"r7cRRYlPfFnAyo8SuwkHiw":{"text":"This will become an iconic New Orleans Restaurant.  Steaks, Ribs prepared as well as I hav","useful":1,"cool":1},"P9OxjLXlzVKj-kuZ-zskxA":{"text":"Great steak, and nothing else. We sat at the bar and waitress/bartender could not have bee","useful":0,"cool":0},"8ET5cJx7Hi3bLtzmc1FR8A":{"text":"The bone in New York strip... wow!! The truffle fries with the aioli were great too. I can","useful":1,"cool":0},"chgoVIy9nzCM8AKJN8SQ1A":{"text":"This dinner culinary experience was out of this world.  Although we had reservation, we el","useful":4,"cool":1},"0J1bjR9kNHZ07tuqEHFDMA":{"text":"You start out with a little caviar and champagne if you wish. If not, you move on to your ","useful":5,"cool":5},"9_luo4X8M6SBCGaBX-tvsQ":{"text":"Omg the short rib was amaze balls ! This meat melts in your mouth and is perfectly seasone","useful":0,"cool":0},"9Xhr9fNXLOmUdCWjoSLThg":{"text":"Went to Doris for a guy's steak night. 4 guys committed to eating red meat...no big deal. ","useful":3,"cool":1},"oszMUrTeYO_5FS59-S-Ylw":{"text":"Really enjoyed our menu. The lamb crops where to die for.. wish I can eat them again like ","useful":0,"cool":0},"Q0jxLKGHkakDQrL95mh3rw":{"text":"The food here is excellent, but the experience is over rated and over priced for what you ","useful":2,"cool":0},"0QnpSLUv7uncWzS6cACHUw":{"text":"Funny name for a restaurant.  I don't care.  The beef here was exceptional.  As was the vo","useful":6,"cool":5},"AEHwX1MtW1cUBFppTmr8hw":{"text":"Went for my husbands birthday because he wanted a good, bone-in steak. Great service,  bot","useful":2,"cool":1},"pFz_Je6ewo-LPUFaV2MASA":{"text":"Found it just by walking by. Beef aging cooler in the window drew us in like moths to a fl","useful":1,"cool":0},"mnhUMnkbeDu-c44qY87YUQ":{"text":"I'm speechless.. but seriously tho, what a perfect Valentine's Day date. Everything was ab","useful":2,"cool":1},"GcQ424DMunMYqYe2Hf_OTw":{"text":"Each and everytime I have been back, everything tastes amazing!\n\nWe started with appetizer","useful":2,"cool":1},"Fjdnp8nw9uSG-RUiHlDDuA":{"text":"Our waiter was super chill and made sure we had everything we needed. We wanted the food o","useful":0,"cool":0},"pIyJfMtwe6rWm7RSsYJLZQ":{"text":"We had dinner at Doris tonight for my birthday. I was really looking forward to it but was","useful":3,"cool":0},"TC4pXhOmIg8QEm_hu0NnvA":{"text":"I was in the restaurant with my wife on 01/19/2019, at our first visit to New Orleans. Got","useful":0,"cool":0},"fEXLh2GE907iRwN6GwiyKA":{"text":"I've dined in many high end restaurants, Michelin three star restaurants, etc., blah, blah","useful":7,"cool":0},"kQJaft78ZQ1VRrBUByfnZQ":{"text":"Completely disappointed with the absolute b$&ch attitude of the manager Ashley. Would hate","useful":1,"cool":0},"vs2qQv_E2wpJXXjH7ce4jA":{"text":"Excellent short ribs, Falling of the Bone fo sho!!  Beef Tartare melts in your mouth..my f","useful":0,"cool":0},"XxV8qnWmIZzIquS-e1RwgQ":{"text":"Delightful dinner venue.  Service is top notch. We had the porterhouse steak and salad.  I","useful":0,"cool":0},"K3ibDtwb_QW3hnzU9J-aXw":{"text":"We have visited a couple times since this review. I feel it important to update my review.","useful":0,"cool":0},"8RN_iIz1xJKbBJ0_gV-PUQ":{"text":"I was underwhelmed with the service and food. Maybe I was expecting more from all the revi","useful":1,"cool":0},"eq1_MKJPXtw37_8zq0KfvQ":{"text":"Made a stop here while on a girls trip, although the menu is a small menu the food and ser","useful":1,"cool":0},"PkVBwdF7CljEnM_m8gEBRw":{"text":"Best meal we've had in Nola. Great service and were able to accommodate mock-tails for non","useful":0,"cool":0},"Kcx-J1ZaRMm9wBe6qMyGbg":{"text":"This is my favorite steakhouse in New Orleans.  I am sure fans of Mr. Johns (for example) ","useful":0,"cool":2},"tAYi59dW3Wk3bZ9pFBnCPQ":{"text":"This was one of those spontaneously amazing experiences. We were walking by and saw how be","useful":0,"cool":0},"MIpvwm7ZC7JC_0SZLeAz7g":{"text":"This review is for lunch only.  I have been coming here since the doors opened, mostly for","useful":0,"cool":0},"gYM5cGC7_7ZVkQyl-PvSBQ":{"text":"Amazing!!! Dennis from the kitchen is absolutely a star here. The chocolate nemesis was th","useful":0,"cool":0},"qljNSr06HihxUpORX6iSCA":{"text":"Traveled back to New Orleans and celebrated my oldest son's birthday here on Friday night.","useful":0,"cool":0},"QrMIxL6dwHX7ilAZAFRIdg":{"text":"Being from New York City, I've had the opportunity to try some of the best steak houses in","useful":2,"cool":1},"rtv0MZz1ec7Y3ST4bYSzkQ":{"text":"The ambiance, the service, the bar area, the food, everything was great! We shared the por","useful":1,"cool":1},"QZDBsm0-qN4W0xj3YhyiaA":{"text":"Great steaks and service.  Went here for friend's bachelorette 2018.  The staff accommodat","useful":1,"cool":0},"13nP5UYGtIE1WDT2tlLQjQ":{"text":"Tried this place after looking around on Yelp and seeing the good reviews. Went on the Sat","useful":2,"cool":0},"FCBymnXcw_obNG-i0XgACg":{"text":"God I love this place and not for the reason you think! Yes they cook great meat......but ","useful":1,"cool":0},"Ze_V-mlVINFvb09U-O0o5A":{"text":"Fabulous cuisine!  The atmosphere and staff where amazing!  Attention to detail and profic","useful":0,"cool":0},"93Kf7ePKzwPhQ-AfzwKLCw":{"text":"This is a wonderful establishment! My boyfriend took me here a few weeks ago for my birthd","useful":0,"cool":0},"IhAfCUUB4M9UKhRmhNCLJQ":{"text":"What an outstanding dinning experience Doris Metropolitan. Is.. from the moment you walk i","useful":0,"cool":1},"Nho6fMY8-PRbuSnEzOPiUA":{"text":"This is one of the few places in New Orleans that is truly exceptionally. Right next to th","useful":0,"cool":0},"aZieDD810x-pnlUyzxTDSA":{"text":"Highly suggest a reservation. Ambiance & professionalism are on point here. There's the ma","useful":2,"cool":1},"sdCDfNpr2Itu3ku0-E83BQ":{"text":"Outstanding food. One of the best meals my godmother, godbrother and I have each had in re","useful":5,"cool":3},"suO_hdgQhT3XDUrwjo64Xw":{"text":"Ok, so I wanted to try them twice before posting this review, just to be sure I wasn't los","useful":2,"cool":1},"wy95VQ2Fj48ECPiR8Va0aw":{"text":"Oh sweet sweet baby Jesus, just sitting in your crib. Can't even talk yet. Doris steaks ar","useful":1,"cool":1},"lpFY5um41elDq_aRc4HsKQ":{"text":"The ambiance was actually beautiful. I can see why it is the top-rated steakhouse in NoLa.","useful":0,"cool":1},"RCxage0G8AxCoowl6GqQuQ":{"text":"The meat puts every other such place in town, including venerables like Brennan's, Ruth's,","useful":4,"cool":3},"9Uzsb3DMw5aHOHLt21zP2A":{"text":"AN EXPERIENCE....in food and service.\n\nWe were seated immediately for our 8:30pm reservati","useful":1,"cool":1},"w8tzF43_J1ITXjtIDX-cHA":{"text":"Great steaks and great service. It really a neat restaurant with the beef in aging room wi","useful":0,"cool":0},"CB8ZBb_jnbV64gkDz7qnDA":{"text":"Outstanding food. One of the best meals my godmother, godbrother and I have each had in re","useful":7,"cool":2},"rlUDzmwVR8_KnQAiqQazpw":{"text":"Excellent steakhouse. Dry aged prime beef. Definitely worth a visit. \n\nhttps://blaineresta","useful":0,"cool":0},"XQNZZgNGL1uvtGTM5uA6Qg":{"text":"Beautiful steaks, have no complaints about it. Doris Metropolitan did an awesome job welco","useful":1,"cool":0},"tom-941otcs4jeiae6Qa5Q":{"text":"Walking up to Dori Metropolitan, you would not think it has some of the best food in New O","useful":1,"cool":0},"W_B-YwWhQ2kSfkebh1RzpA":{"text":"Was recommended this place by a coworker who said won't be disappointed if stop here. She ","useful":0,"cool":0},"VbMaWhoOvl33MlRjMDR5Aw":{"text":"Just incredible. Everything off the charts. Me and mates had a reunion of sorts here. Shar","useful":0,"cool":0},"GtVdbJiobRp6S6mqLLZrQQ":{"text":"Came here because of the good rating but left disappointed. The aged ribeye steak we order","useful":2,"cool":0},"_D5IpS15q2RCtRMj8afdow":{"text":"Doris' NEVER disappoints. From the greeters to the servers to the incredibly talented chef","useful":0,"cool":0},"-zn3rW6_f1QLq7d-hn7z1Q":{"text":"Wow. The Manager, Ashley is HORRIBLE. What a rude woman. We simply asked her to open our b","useful":2,"cool":0},"esVh4OyWXxOSoBc9DSsQLw":{"text":"Best steak ever!!!! Doesn't matter where you have been before, this place is worth the wai","useful":2,"cool":1},"20x8PySXkwAxEfyqn2oi6g":{"text":"We had the BEST dinner to celebrate our 27th wedding anniversary. We had the caviar as an ","useful":1,"cool":0},"Hyfiqq83Jjc3pACARHZurg":{"text":"The hostess needs to be trained to accommodate the customers and not turn them away. We ar","useful":0,"cool":0},"XKp-Q9azihhP0oFGlPNwag":{"text":"This is my second time to this restaurant. I was OBSESSED last time I came here. They had ","useful":1,"cool":0},"E2K01i-dlX9P8fMzGlnfZQ":{"text":"Doris is a great steakhouse tucked away in the French Quarter. It has a tremendous wine li","useful":2,"cool":0},"MwbRS9Mo3rVOWCt3exnx2Q":{"text":"Celebrating my first Thanksgiving in New Orleans at the best restaurant the French Quarter","useful":0,"cool":0},"dLj3qF3I4tOHVdKMTbXk1g":{"text":"Very special dinner this past Saturday for my mans birthday. When I called for reservation","useful":4,"cool":1},"rRYoWLmE-8kvU-ggx2ganA":{"text":"One if the best dining experiences in NoLa. We had the beet appetizer, bone in ribeye and ","useful":1,"cool":1},"g72Iar4ieqj5kXkwa01xrQ":{"text":"I'm giving this a two only because judging by the other reviews, we hit the restaurant on ","useful":0,"cool":0},"uJnrdOSQHv2aOcZIDaDciQ":{"text":"This is such a great place from the moment you walk in. To the left after you enter is the","useful":1,"cool":2},"eu-BplvSQ-_hbM79kwOY_w":{"text":"Staff is judgmental and not nice. My with is in a walking boot and we are here for a footb","useful":1,"cool":0},"25VEwwJr1HqglynZMtaDRg":{"text":"Imagine walking down the street in NO, and you happen across the most beautiful dry aged s","useful":1,"cool":0},"tFH-ND1Yv9y0_FsFnqcSIA":{"text":"A lovely NY or Los Angeles style steak house right in the heart of the French Quarter. I w","useful":0,"cool":0},"o2V9eIIO_9xu3zgiBUWhhA":{"text":"This is the best restaurant have been to in a long time. \nFlavors like no other place. Eve","useful":0,"cool":0},"dtBkNj_sUiITWVoiLByWow":{"text":"I've been on a conquest to find the best steak in New Orleans for the past 4 years. I fina","useful":2,"cool":0},"jcNQNpEOFqWYw7ngkYeISA":{"text":"Excellent experience! Beautiful place and wonderful service ! Food was incredible. \nWe ord","useful":2,"cool":0},"KCvKkxWynroek8Yt-nOTXA":{"text":"Although the name of this restaurant kept slipping my mind the first five times I tried to","useful":4,"cool":2},"E8ZEq4qyrRD8Qsyme2huBg":{"text":"Wow what can I say?! The dining experience here was amazing. Everything we ate was soooooo","useful":1,"cool":0},"E8rQsEwoilXczpODJ9kUqA":{"text":"I think it only needs a 1 word review; amazing. Went twice on our last visit to NOLA, had ","useful":0,"cool":0},"ZVwGplSIQb2D8xEhQXbcaA":{"text":"I've been to this place multiple time each time it gets better. I love the appetizer bread","useful":0,"cool":0},"eunEc3UuFei607YER_aL6g":{"text":"Great service, great steaks and great punch (note on this - when they say 'minimum of 4' -","useful":0,"cool":0},"NiocjeRn-qQRR3LTwcf0ng":{"text":"I was in NOLA for a business meeting and took a walk looking for a place to eat (very easy","useful":1,"cool":0},"lcNRoqChWps6g9p81wjx9g":{"text":"i've been to this place before, didnt LOVE it didnt HATE it, BUT i wasnt expecting the ser","useful":0,"cool":0},"zg_u9n5JKXaVCPKOvdyyHA":{"text":"In a city full of dive bars where you can drink out a plastic cup and get a Daiquiri out o","useful":4,"cool":3},"JfOeSJxm6cm8e3QNfB7cDw":{"text":"Disappointed local! Don't go! Save your money, too much hype about nothing for the price y","useful":2,"cool":0},"PSXCj5wF6OEBFiVNBbx7lA":{"text":"In my opinion, this is still the best steak house in New Orleans.  Their beef is consisten","useful":5,"cool":2},"Is6jQ8tp2iEbI303CHoCnQ":{"text":"This place is amazing. Atmosphere, service, and food quality are outstanding. We started w","useful":0,"cool":0},"ucQoTC0H91vOwRvm1_Tatg":{"text":"We finally got a babysitter so wen we're craving a nice meal out.  It was a hard pick but ","useful":2,"cool":0},"pQSpWixKpGyeei5IHbg8mg":{"text":"Doris Metropolitan is a MUST for steak and wine aficionados--just make sure you get a rese","useful":2,"cool":0},"4OmmimJz3Ln-_3JVm_gBnw":{"text":"Let me tell you about this place.\nFirst I'll start off with the service. Shout out to our ","useful":0,"cool":0},"UlgS0epmVIWbf0iFFsEb8A":{"text":"Hosted a business dinner that was supposed to be for 20 ppl but 35 showed! The manger, Roa","useful":0,"cool":0},"BstKHklazhe3iZP3f2EwEg":{"text":"I have been so excited to try Doris since I love steak so much, but unfortunately it was n","useful":0,"cool":0},"aM--Lyt0mm4kM2VUPFH0sA":{"text":"THE best steak I've ever had in my life. Stop spending hours looking at all the restaurant","useful":1,"cool":0},"m-mXq_gaxBY6eSbCohuoKQ":{"text":"SO GOOD!  You have to try the truffle fries!  The steak was tender and cooked well. Our wa","useful":1,"cool":0},"7rtfOv7IZtexOa_1Kz2OzA":{"text":"5 stars and we don't just give 'em stars away. This is hands down the best steakhouse in N","useful":0,"cool":0},"ewrY1_PRcLWs-8CCIy92wA":{"text":"Steakhouse located in the heart of the French Quarter.\n\nI've heard a lot of buzz over this","useful":2,"cool":2},"uPEAVpUvzVsHpBQ4Zjak3A":{"text":"I love this restaurant I feel like New Orleans needs more restaurants like this. Very High","useful":0,"cool":0},"ElobSfhw81B3fImnoFgIwg":{"text":"Another great meal here.  Last time had the Japanese wagyu. It was excellent and very rich","useful":0,"cool":0},"s9tDNXgy4nzZk60UiSPUtQ":{"text":"If you're allergic to plant toxins, beware their Sumac butter. Within minutes of eating it","useful":2,"cool":0},"H8JvcTvkro3_GxJCVWQ1yw":{"text":"The food was great the meat was aged to perfection. The steak  was amazing the customer se","useful":0,"cool":0},"0QgAHaCYmffci8RSWuznlw":{"text":"Perhaps one of the best steaks I've ever had the pleasure of consuming, and I've had my sh","useful":3,"cool":0},"0z5KhnbW52YrHMCT6QAA5g":{"text":"Spectacular place for a group dinner. We tried several appetizers, drinks, filets and dess","useful":1,"cool":0},"rDyvw5ZCB-WfDmIy4FOlLw":{"text":"my name is steve walsh from redondo beach, ca and had the absolute worst experience at thi","useful":0,"cool":0},"cm0bTsIJShuLNogAL6w3iA":{"text":"Myself and friends had dinner here 12/5/2020. I ordered the NY Strip with grilled veggies.","useful":0,"cool":0},"g8wSFmw7KAnqK6kMVMVTLQ":{"text":"Not sure what the hype is about. Steak was overcooked, had to send it back. The next steak","useful":1,"cool":0},"py0WI8WyN6hCtqQOM60w-Q":{"text":"If you're in New Orleans and you want a steak, this is where you go. My personal favorite ","useful":0,"cool":0},"ZSLfejceMBKqHLgn6z7zCA":{"text":"Fantastic restaurant! Great food, drinks and general ambiance. Ended up here by mistake, b","useful":0,"cool":0},"EAY14Shsc0Ly0VisO90khQ":{"text":"What a nightmare! waitress \"SOPHIE\" told us they did not have foi Gras, nor the bourbon th","useful":2,"cool":1},"5Sh0kimrlYsGzhfVHqIIkw":{"text":"The last time I was here was the Thursday before COVID locked down my city. Now that we ar","useful":0,"cool":0},"g-opr-cW-tWlGZO8wSk07A":{"text":"What a place!  Go here!  \nLovely atmosphere,  great food and  excellent service. We were l","useful":3,"cool":1},"ewylX0D9s3dL_ANizfxZ_g":{"text":"Let's start off by saying pre pandemic this was my favorite steak restaurant. Sorry to rep","useful":0,"cool":0},"ClxbkNyCNpFUh1foBM4RhA":{"text":"My 3 star rating combines separate ratings for both the Service and the Food.\n\n5 stars for","useful":1,"cool":0},"lvkWZukIsLKPjjQmJzjjPQ":{"text":"I brought my boyfriend here to celebrate his 28th birthday! It came highly recommended to ","useful":0,"cool":1},"YM3nCcs9j7yiIUoaMV3yKQ":{"text":"Filled with loud groups of men on business trips. Unbearable.  They belonged in an airport","useful":0,"cool":0},"-dAkRcS5bCRMUC3N8Sl6pA":{"text":"Fantastic and delightful dinner, truly an experience. We could not choose among the appeti","useful":0,"cool":1},"y3CdC4s8Xgp-cyudu43_Bg":{"text":"*pre covid review*\n\nWe came here a while ago but I couldn't find the photos we took but I ","useful":1,"cool":0},"9f1kxNpgEtpooInMmOecbg":{"text":"It took 15 minutes before a waitress even came to take our order. We received our drinks a","useful":4,"cool":0},"vkLaje2mx1AJerSv3dPx3g":{"text":"I had used Open Table too see what restaurants were available for Saturday evening and Dor","useful":4,"cool":3},"4a4rx_nhPUW1mjctxZkP_g":{"text":"Decided to book a table based on Open Table's reviews and boy was that a great idea. Yelp ","useful":1,"cool":0},"YzO3PDhF2W5PvU9SLCT6Tg":{"text":"Came here for my last dine-in experience for a while. Sat at the bar and made conversation","useful":1,"cool":0},"W9uQrddzSrgU66YRnXiHMw":{"text":"Not Gluten-Free Friendly\n\nSo was staying in NOLA for the night and checked YELP and TripAd","useful":3,"cool":2},"PBDwTBkKx8HUvMEwluo89g":{"text":"We had heard about this restaurant from relatives who had been there as having \"the best s","useful":1,"cool":0},"MMOdH33kc8DibjqjNx3Spg":{"text":"This review is more about the amazing bread they serve. This is hands down the best bread ","useful":0,"cool":1},"LH8v9njQBPjywmoIqA18bA":{"text":"Undoubtedly one of the best steaks I've ever had.  I've been putting off writing this revi","useful":3,"cool":0},"QSzxTDbXGDnU9zWstUhDow":{"text":"What a great place to eat. The entire experience was delightful.. service is above average","useful":1,"cool":0},"v017eOXZcFnNi8rskhwRgQ":{"text":"We have dined at Doris Metropolitan, New Orleans on 9.23.18 Sunday night with my husband a","useful":1,"cool":0},"aZyx4SP5f0vMSrxcEibnlw":{"text":"My vote is 3 stars but my husband's is 4.5.\n\nWe went here for my husband's birthday dinner","useful":6,"cool":3},"uAqpH9EoxmV2AcsXDKAWpg":{"text":"I would have to say the best parts of the meals was the onion bread and aged balsamic vine","useful":0,"cool":0},"ITjSzaSIXopFBowVWjgmSg":{"text":"DORIS\n\n   I love new experiences. Being able to walk into a new space and not knowing what","useful":1,"cool":1},"DYRJlginA7WynbjENXY22A":{"text":"Literally the best steak I've ever had.  Love to sit a the bar(before Covid). Bartenders a","useful":2,"cool":0},"3xz5yd348823INH6YKsn9g":{"text":"I went to Doris for the second time last week. Both times we went with a group to celebrat","useful":3,"cool":2},"7QEQRKYc6wf0-aL9Gim4_w":{"text":"We dropped in on a weekday right as the restaurant was opening and had no reservations but","useful":14,"cool":10},"bvgPsB5ppxO37C9W59mAbw":{"text":"I had the best steak of my life here. Everything we ordered was delicious. I loved the tun","useful":0,"cool":0},"fOt562x-C-KRW1VxbTuJ1A":{"text":"We ordered the beet appetizer, green salad, steaks snd sea bass. The beet salad was terrib","useful":2,"cool":0},"vlcLyFMKgMseDtBAYLQITw":{"text":"I had used Open Table to see what restaurants were available for Saturday evening and Dori","useful":4,"cool":3},"W5o-_oSrfXtJC95704e6iA":{"text":"Definitely a 5 Star!\nLovely atmosphere \nThe service was excellent!\nWe were fortunate to ha","useful":0,"cool":1},"Migg971nBCdsUKZGK_uATg":{"text":"We went to Doris on a Sunday the decor understated and elegant and quiet patrons enjoying ","useful":0,"cool":0},"85ML6UwCkrmmLI816G50iw":{"text":"What started as butcher shops in Israel led to a restaurant in Costa Rica and then Doris M","useful":1,"cool":1},"CWlJNOEzc8xtDDay4uL0eg":{"text":"It seems like other yelpers wrote pretty extensive reviews which depict the restaurant acc","useful":12,"cool":7},"SjhAkZz8qU91zNIyAhK-Gg":{"text":"Went on Christmas Day for lunch. Food and service was outstanding. My only complaint was t","useful":0,"cool":0},"apZw3de2hi8uv5Uf2fd_6A":{"text":"Wow! Truly an amazing restaurant and experience. If you're looking for a great local Medit","useful":1,"cool":0},"JJ9VhydxV8oyW4TumdhsVQ":{"text":"Five star through and through! I've been wanting to dine here for quite some time but trus","useful":2,"cool":0},"EvXf7mtf7fz9S99d5p29yA":{"text":"They served us a huge flaming (literally, see pic) platter of perfectly cooked and seasone","useful":6,"cool":1}}