{"M8CKU1cEoc7AG-n148uhDA":{"text":"The catfish, chicken, gumbo and mac &a cheese are all to die for. We are the lunch buffet ","useful":0,"cool":0},"rPMm8KdzE9cLHlwvt-IqgA":{"text":"Food was good, we took advantage of the Sunday Buffet it included fried chicken, greens, s","useful":1,"cool":0},"Wd1N0MxCvwA9EHH7pkon8A":{"text":"Come here for delicious, home style New Orleans cuisine. We went in the afternoon, and alt","useful":0,"cool":0},"iGhdQF_0SQobwBMWBaTzbw":{"text":"A neighborhood cafe with GREAT soul food. We went for the lunch buffet and it did not disa","useful":0,"cool":0},"nP5S1yK8Va1JPlWB-a_vfw":{"text":"This is a place we stop into every time we visit NOLA. Its become a great staple in all of","useful":0,"cool":0},"KnBPXllA8m_Yd10P9TGmSg":{"text":"It was ok. I wasn't all that into the buffet. The food was bland, however,  it was fresh. ","useful":3,"cool":0},"UlcUhtPY6O0WPo7RxT1D8w":{"text":"Fried chicken paradise in the Treme. This place smells like home-cooked fried chicken befo","useful":1,"cool":1},"U_khx-OKvTfMCeyi1_QvBw":{"text":"We loved this place. The catfish was perfectly fried, and I can't stop thinking about the ","useful":0,"cool":0},"YhG6sI0lISCD_WMWK58RPA":{"text":"This place is phenomenal, albeit busy as heck because everyone in the neighborhood and bey","useful":0,"cool":0},"hZT2Oq3SqiKw2RAsPr-uRA":{"text":"Great little local eatery! Had the lunch buffet. Fried chicken, grits, mac & cheese, gumbo","useful":0,"cool":0},"-7SWROy_PxPbUhYLFPENDg":{"text":"We were in New Orleans on vacation and was told to try this place. We first went on a Sund","useful":0,"cool":0},"QFih1ul40DOd5aMzk-Ccyg":{"text":"Ok, well I was in town and craving gumbo, fried chicken and sweet tea... Lil Dizzys hit th","useful":0,"cool":0},"jR1jANLp30ABPopG5ooWQQ":{"text":"If yo've never been here before, go. If you've been here before, go. Hands down the mouth ","useful":0,"cool":0},"q7iyOsnse5My7RXZTsEBmA":{"text":"This is definitely a place where you want to eat. Good home cooked food and friendly staff","useful":0,"cool":0},"hVK9fWeXz8_NOnaSZgvtyw":{"text":"Great little local breakfast joint with an amazing buffet!  Perfect for a post-church meal","useful":0,"cool":0},"hUgO6VmeWGgjnmREdKUeXA":{"text":"Came here and ended up getting the buffet. The food was seasoned well, service was efficie","useful":0,"cool":0},"3CPHxmJFtOfIKO3iveeI8A":{"text":"Right down the street from where we were staying.  It was recommended to us by our hosts a","useful":1,"cool":0},"gjqsPhXDDZUgDJQ5L0Lsog":{"text":"Once again a \"hole in the wall\" does not fail.  If you are big on frills and ambiance with","useful":0,"cool":0},"QBgv7NP_elxNI-IIMRcWkw":{"text":"On a Sat morning... \n\nPros:\n\n- The seafood gumbo was the best I had during my stay. You mu","useful":0,"cool":0},"KidK9ZII-qxIGpSUkV0Mjg":{"text":"The best southern food  all you can eat buffet in Treme! I always come here for breakfast ","useful":0,"cool":0},"7kqeZK_G_G6rLjRjrI3huw":{"text":"Let's see..where to start...To begin with there was a line outside. Today was a cold breez","useful":3,"cool":1},"ugdkXrHuv_p8WHJB6JnZBg":{"text":"Ive been coming to New orleans for years now & i seem to return here often' nice staff\" ea","useful":0,"cool":0},"U4cIMgTpeGhCI8KCUuw0tw":{"text":"Delicious breakfast. Don't miss the biscuits. The day we came they had crawfish omelette a","useful":0,"cool":0},"DFLYCBDl2C1SUWfocJU4vw":{"text":"Have a great lunch Buffett and the employees were very nice. They were all engaging and se","useful":0,"cool":0},"YGneam3G2LZWXdDzK4UDFQ":{"text":"We went to Lil Dizzys Cafe as it was very close to our airbnb in Treme. Was also recommend","useful":1,"cool":1},"Bd2xkO8QdcHnRMUJdB8UUQ":{"text":"I went to Li'l Dizzy's for the fried chicken and it didn't disappoint - it was crispy, tas","useful":1,"cool":1},"d3yBJZw7N-SgoyCzTYqI5g":{"text":"Recommended by our cool Lyft driver Tamara...and soooo glad we listened! After a lil wait ","useful":0,"cool":0},"9mX78TcFM5Od_D28tkuEDQ":{"text":"The first time I came was in autumn 2012 and then I came back during Yelp Spring Break 201","useful":1,"cool":2},"rizyIkdf2PfDb1kKDJks_Q":{"text":"Come hungry and early. It get crowded especially on Sundays where people come after church","useful":0,"cool":0},"LmaVmjMIvbEETJ2SUHWe-g":{"text":"Amazing Breakfast . Little neighborhood dinner.  But a hundred times better than a fancy r","useful":0,"cool":0},"lFJooySAS1zR0KXivxmjzQ":{"text":"Li'l Dizzy's has all the hallmarks of a New Orleans must-try- really popular, great review","useful":2,"cool":1},"2x0N8TcnULL0r3vALZ-DwA":{"text":"The food at this little restaurant was amazing. The restaurant is small but you can tell t","useful":0,"cool":0},"h6oWcpn89AuvLjW1s-_jEg":{"text":"3.5 Rating from me and the hubby. He had chicken we both had gumbo and I had bread pudding","useful":3,"cool":1},"4igKz1jRg5-1ntmcMH8a9w":{"text":"Delicious food. Great local spot. Excellent service. And it's not overrun by tourists!","useful":0,"cool":0},"pOS_aKkJFm2nFSwM-GqKOw":{"text":"The food here is above what you would get in the Quarter. They make their own hot sausage ","useful":0,"cool":0},"VhXLYUKNuRxB_ShMnEb4sw":{"text":"As a local I can say by far they got the best of everything! Well seasoned and southern fr","useful":0,"cool":0},"kcTqmxDNxMd3eKmkqBsQAg":{"text":"Great locals place. Simple Creole food , as good as it gets. The buffet had gumbo, fried c","useful":0,"cool":0},"TpsH2c2BOzXywopq4K2PGg":{"text":"Love this place in New Orleans! The gumbo is amazing with the crab legs. The people are so","useful":0,"cool":0},"elGDGzULLI5bDO2f7BuQrA":{"text":"A hidden little gem. If you're looking for an authentic NOLA foodie experience come here. ","useful":0,"cool":0},"kBuiwIzGu_4G3VXNfH3Bow":{"text":"Came here for Sunday brunch, of course the place was crowded but we didn't have to wait lo","useful":0,"cool":0},"KRfgU09kLOXzJkRWw3OqWA":{"text":"It was worth the hype! The breakfast was amazing I ordered the catfish eggs and grits! The","useful":0,"cool":0},"1hoopUYklONCh6VXmack7w":{"text":"Was hesitant about the buffet price but the food was pretty good as well as the ambiance e","useful":0,"cool":0},"-ZiKCJcEca7Gy2z8QimHlw":{"text":"We lived down the street from this place for 6 months without ever trying it and once we f","useful":1,"cool":0},"UPcq-EpZ7O3l_fb3BzWOjA":{"text":"Finally after passing up here for so long, made my way in. It was my bday and mom's treat;","useful":2,"cool":1},"7mhMZbZNyb3mfGHta3yH7w":{"text":"Good breakfast! No frills, just solid food for a good price! Ate breakfast here twice duri","useful":0,"cool":0},"b2CeKnv087WPEG_tvhGZjw":{"text":"Delicious! Best meal we've had in New Orleans and very reasonably priced. The biscuits and","useful":0,"cool":0},"RRjMKFkSWh4ahSlbNNEzJw":{"text":"What a gem! My husband and I were staying in the Treme, and Lil' Dizzy's Café was recommen","useful":0,"cool":0},"LVuk6Yb7VyfNXsRxLAYw3Q":{"text":"Awesome atmosphere and staff - true local people.  You can't get food with more soul than ","useful":1,"cool":0},"O5NKnl9mPa2edKnFyx7dpw":{"text":"After living here for five years, this is my absolute favorite for Creole soul food.  The ","useful":1,"cool":0},"mysOQH-1Sk-1YDMStu38KQ":{"text":"This is a nice quaint spot buffet style.  All items were good gumbo, shrimp creole, fried ","useful":0,"cool":0},"mdWVyB7oxsyadw_wueKZfg":{"text":"Everything about this special place is fantastic! The people, the food, the location. Than","useful":0,"cool":0},"BFaNmXeF8YY_z3KiDy3k7Q":{"text":"We've visited New Orleans at Christmas for 20 years and just found Dizzy's this year!  Foo","useful":0,"cool":0},"s4H0dI-OgslJtTe2HJ-Ljw":{"text":"Came here for breakfast during my Nola trip. \n\n- Dark meat fried chicken (5/5 stars) - #1.","useful":4,"cool":4},"_53BpldCyCuKSVMRxQOZxw":{"text":"Loved Lil Dizzy's! Gave us an authentic feel of New Orleans which is what we were looking ","useful":0,"cool":0},"tQ_MY1rzuQydjmLup4h8yg":{"text":"This restaurant was fairly close to our rented home in NOLA so we ended up eating here 2x.","useful":0,"cool":0},"KmmlJ3KZq9-u6daCvlsNrA":{"text":"Our intent was to have breakfast, but we arrived 19 minutes late - breakfast ends at 1:00P","useful":1,"cool":1},"AVCqnPvv7sEhk2av_0hvOA":{"text":"Great place to eat, a nice home type joint in the neighborhood... Just the fact that they ","useful":1,"cool":0},"7df2AA10EqVe386D81u0sg":{"text":"You have to be quick and have a game plan to catch a seat in this place. It's super tiny a","useful":0,"cool":0},"eC12Kj86o5V5dy-fbEesYQ":{"text":"Great spot to have breakfast. We were in town on Election Day and the place was full of pe","useful":0,"cool":0},"PYgYpSN23Qpe56PcupNVvw":{"text":"Best food in NOLA.  That being said, here is a quick disclaimer.  As I rule I dislike this","useful":0,"cool":0},"lwWevqSbjef7RrhBNDG4Cg":{"text":"My hubby and I were in Nola for a mini BaeCay and I stumbled across this awesome place whi","useful":0,"cool":1},"KftvjK_u18O0Q4WK3VRJdg":{"text":"I ordered the buffet because there was nothing else as appealing on the menu. I'm so glad ","useful":4,"cool":0},"ueLf9RIqeEexf3wUHtscdA":{"text":"Great food and service.  Thank you for making our family feel right at home !  The Gumbo w","useful":0,"cool":0},"loWzHwRXHTCwuK9-2veuuw":{"text":"MUST go here again and again. The breakfast buffet was awesome.  Here is what I had that w","useful":1,"cool":0},"4CjnuMKNg7627Pb3Yj30yg":{"text":"All I can say is wow , the best fried chicken in New Orleans is not popoyes it's here in t","useful":0,"cool":0},"Z7vtZ1sorMsFzMwDxL2jMg":{"text":"This was my second time eating here since I've moved to New Orleans. Today I got french to","useful":1,"cool":1},"8Zy66V1Jfy-Q-RdOqe_G4g":{"text":"I visited Lil Dizzy's years ago early one Sunday for Brunch. We got there right after they","useful":2,"cool":2},"9Hzjx7ppViJre4zjAZU16g":{"text":"We were really disappointed. Slow service, jambalaya omelet was just ok, cornbread was col","useful":2,"cool":0},"mAhNASlsSuqIg_5Dq9fHCg":{"text":"Soul food brunch at Li'l Dizzy's cafe.    \n-  flavorful, sumptous Gumbo.  \n- hot, tasty, l","useful":0,"cool":0},"U4u7KtcpsYwco-ADpCEAog":{"text":"I  came here for lunch one afternoon looking forward to trying it and left hungry because ","useful":10,"cool":2},"ReQMcwjsKokCt4TOaoJYCQ":{"text":"Good gumbo and seafood. Not many seats. Lots of one ways streets so be careful parking.  D","useful":0,"cool":0},"wMl7Pzr1ElXxhApHcBH9hg":{"text":"My friend and I were strolling around New Orleans on vacation and wandered into this amazi","useful":0,"cool":1},"n3aavPUwhQnocJEiSVT7Rg":{"text":"First off it's Fathers Day so it was kinda busy.\nPros: good food, staff was nice bread pud","useful":0,"cool":0},"a7p3cOP1dUkOsiQGTEPetQ":{"text":"I love this place! Best biscuits and buffet in town. You'll walk in hungry and walk out sa","useful":1,"cool":0},"MhceijXNjZUsY89fXoIrbQ":{"text":"I will start this review by saying, bless the hands that makes their food. Li'l Dizzy's is","useful":0,"cool":0},"C_R0SDIkh8XQUf7R6wwtTQ":{"text":"Awesome, awesome shrimp gumbo and Jambalaya. Stuffed crab, fried chicken and the bread pud","useful":0,"cool":0},"SOAyXqTFBEy6NPY2z9mARw":{"text":"6/7/18 Unique jambalaya omelet. Outstanding hash browns and biscuits. Coffee not good. Eve","useful":0,"cool":0},"pvEq68S7HVQHfzuTdZ6jmQ":{"text":"I went about 1pm Monday and had the buffet. Fried chicken was solid but wouldnt return jus","useful":0,"cool":0},"nE9-1pOUl16VLYyilxb-mA":{"text":"Went here for the Sunday Brunch. We were hesitant to go: 1) It's a restaurant in a hotel. ","useful":0,"cool":0},"UJIPtcQd0B8VTO7gOUsvaA":{"text":"I knew I was in the right place as I pulled up to Lil Dizzy's Cafe when I saw 2 police cru","useful":1,"cool":0},"hiultPvNCHtGxxCOedKFAw":{"text":"Yup, that was some damn good fried chicken.   Catfish poboy also very good.  Great atmosph","useful":0,"cool":0},"YzHhf6jH5huI-sm960U_bg":{"text":"So after a tour of Treme I couldn't wait to indulge in a good down home breakfast. So we d","useful":0,"cool":0},"_AC8GXZgGqrG1xeIaUzuCQ":{"text":"As I sit in the airport leaving New Orleans and reminiscing that this was the best brunch ","useful":4,"cool":0},"Kdyl4Y8mt_Iy1-pW_Qx6NQ":{"text":"The other reviews on here are misleading. This is truly a greasy spoon.  The plates for th","useful":1,"cool":0},"Tn3ID12lXIlc2qOqYlKYJA":{"text":"Love this place. Shrimp and crab omelette po boy for breakfast was a game changer. French ","useful":0,"cool":0},"cNJVo20SNhdXOezc5RjviQ":{"text":"What a wonderful place!  Definitely go for the buffet--a great chance to sample most of wh","useful":0,"cool":0},"MLiE85zBAHM0D0I5hF_Wtw":{"text":"Really great place to get an authentic New Orleans feel and full stomach. The buffet offer","useful":0,"cool":0},"mppXN-lPsEflwPIy7kremQ":{"text":"Food great!!!   Staff friendly and attentive.  Would recommend.  Mostly buffet for about $","useful":0,"cool":0},"XDztzR5Roy_vnxBDyVfcKg":{"text":"Good, Creole cooking. The food is very tasty, but the decor leave a little to be desired. ","useful":0,"cool":0},"Y4gg8Fn_qbco_-gRI0xSwQ":{"text":"Visiting for the Essence festival so we expected a long wait. The place is small and was c","useful":0,"cool":0},"58NkMoP0GKyPuAyOFtEWXA":{"text":"Oh my God  is what  I literally screamed tasting the red beans! It felt so good to taste n","useful":1,"cool":1},"Gi7AgobNE6clbpaktmptqA":{"text":"I've been to this place many times over the past 10 years. I took a years break, hoping to","useful":1,"cool":0},"jr-khDLtq2skWO8lPPAjTg":{"text":"The gumbo is amazing!! The fried chicken is amazing!  The bread pudding is amazing!  Need ","useful":1,"cool":1},"RwAH0yUd4yiOeijjorMhMA":{"text":"Man oh man... I gave this place ONE star. It kind of bothers me to do so. I pondered on it","useful":2,"cool":0},"y8gu0CM7kokpDX8sHO8miQ":{"text":"I throughly enjoyed my breakfast here! I honestly felt like I was eating at my aunts house","useful":0,"cool":0},"p1zktLRtxJykV1l5Z2NGIQ":{"text":"I tried this place a Sunday less than a month ago. It was late morning, and my mom and I w","useful":9,"cool":1},"HGFvytM4aAuhdXb_ITw7YA":{"text":"What a disappointment... the service is not optimized, waiters NOT friendly. And the food,","useful":1,"cool":0},"1L5U0o0ALVZc-I7A7ucJEg":{"text":"Enjoyed brunch here. As a southerner I highly recommend the buffet if southern cooking is ","useful":0,"cool":0},"Z0TI1MizIylpEqjCRTugSw":{"text":"The gumbo is sooo good! If you go there definitely get a bowl. Also, for your bread size g","useful":0,"cool":0},"xpjxMzlbNUGY-1DbdSOVxQ":{"text":"Found this little jewel in the vast jewelry store that is New Orleans dining. We were look","useful":0,"cool":0},"V4GZgBb_f3Ql3na2-JT_Vg":{"text":"Some people on here say the lunch buffet is the best deal, like, ever. I say I paid $35 fo","useful":0,"cool":0},"fCJOu8hogOkI56IT31jKTA":{"text":"The food is amazing the staff is wonderful it feels like home when you go there.  It is no","useful":0,"cool":0},"_1-rvdlgNm0LoEF9jsiDzw":{"text":"The best French toast and shrimp grillade we have had yet! Affordable menu, helpful and pl","useful":0,"cool":0},"GnnFaMTgwpN4jHeaWINFYw":{"text":"This place was advertising that it was open until 8PM so my wife and I decided to walk ove","useful":1,"cool":0},"q7w-JIWeEp64H2tou4sTrw":{"text":"Glad my friend Dave brought us here, it's off the beaten track!\nExpect warm Southern hospi","useful":0,"cool":0},"MeSOu_7g9Ze60DA-f9a5vQ":{"text":"Lil Dizzy's -  Wow,  it's been a minute and since the restaurant has moved it has been a b","useful":1,"cool":1},"lopJGG16WE3PB9oeX-G5wA":{"text":"Leave the French Quarter tourist traps and go to this hidden gem. Great soul food and the ","useful":0,"cool":0},"ajKgIYH5ZMMpU9sv2Ghq7Q":{"text":"The staff is amazing and the food is beyond delicious. I had some of the BEST fried chicke","useful":0,"cool":0},"6tVjRuXGfDfOGwPo8w5xkA":{"text":"Let me tell you about this place.... everything was EXCELLENT!!!!!!!! We heard about the p","useful":0,"cool":0},"AmAn5I2UPThAFHE3B42kpg":{"text":"Lil dizzy Lil Dizzy Lil Dizzy. Why do you do this to me??? So my friends and I come in and","useful":3,"cool":0},"C_WzERoqm2B3I2dqK4teiQ":{"text":"I just ate here for the first time and it is so delicious! Will definitely eat here again ","useful":0,"cool":0},"SMzfHckjNIwFPd0jYF2p0A":{"text":"The food is good and the staff is very friendly.  I agree with the reviewers who conentd t","useful":0,"cool":0},"pyvI7wS7O9N4QOFSX01lRw":{"text":"This place was in the Tremé area. Also known as the birthplace of Jazz. It was a quick Ube","useful":1,"cool":0},"2eC5PYc-OYWah3sfUQQymw":{"text":"The brunch here is a must. They have an omelette station and phenomenal bread pudding and ","useful":0,"cool":0},"afH9DT0agp_hLdesRlN4tQ":{"text":"Amazing food, not cheap but well priced for how good it is. Whatever you order make sure t","useful":0,"cool":0},"co5F6gJNAxwuqSikwtJnXw":{"text":"The roast pork was tender and tasty.  The French Toast was very good.   The shrimp omelet ","useful":0,"cool":0},"Y0H9OuaasduJnOQHT6_i-A":{"text":"If you like creole food, this is one of the best spots in New Orleans, if not the best. It","useful":1,"cool":0},"PIYK8wV2K7Y3CihEM432Kw":{"text":"Ok.  If you are in New Orleans on a Sunday and fail to stop by Lil Dizzys just because its","useful":4,"cool":3},"SFamcVdb0AZUgUQimyJh7g":{"text":"If you're looking for a consistently good breakfast joint look no further. \n\nVery solidly ","useful":1,"cool":1},"C0WGqW7edEIcD-oEww92Lw":{"text":"Last minute lunch. Immediately felt welcome by owners of the establishment. Everyone was e","useful":0,"cool":0},"waCbIFGZN61YvTRraK_9Jg":{"text":"My friends and I visited this restaurant based on one of the friends' recommendations. Bei","useful":0,"cool":0},"1WTa8LGOyMaOqB8iFxh9sw":{"text":"The food was very good. The only issue I had was the server embarrassed us following us ou","useful":0,"cool":0},"c_5iQbkTlcrxz51KO-VVrQ":{"text":"I've eaten at Lil Dizzy's more times than I have fingers and toes.  Never ever had a bad o","useful":0,"cool":0},"bQI7W_cPIRUnCflFt1biqg":{"text":"I got the lunch buffet deal and I tried a little of all the dishes! The quality wasn't ama","useful":0,"cool":0},"NqxGcdnu52IUCRLpoEH6mg":{"text":"Dayum! This is the real deal. Just go, check the buffet...killer diller, everything here i","useful":2,"cool":0},"PIu3PnpFWiXY37wTRw9ujQ":{"text":"Oh. My. \n\nI came with a party of seven for Sunday brunch and after a short wait Mr. Baquet","useful":2,"cool":2},"KFwuqHsjRA0yZFF6mUpjzw":{"text":"Great food!  Great service.  Had the broiled catfish, grits, eggs and a biscuit.  YUMMY!","useful":0,"cool":0},"p9EYDwJi1BU-NvuQZ1K37Q":{"text":"lunch buffet was awesome... the day we went they had fried chicken, mac & cheese, beef ste","useful":0,"cool":0},"rAWjJb__ZjMzSO6S-RPmcw":{"text":"Dragged my wife on the long hike to li'l dizzying after reading about it on several sites.","useful":0,"cool":0},"Pvuxg8rq-6AfK9t_TmpCrA":{"text":"So some friends of mine told me about this place and I had been wanting to go since then. ","useful":1,"cool":0},"M15-ePqR_d8Hccw1P70guQ":{"text":"Great food, we really enjoyed the food. It was small but that's one of the things I enjoye","useful":2,"cool":0},"AUq5YleAwKxuLT2WG6aTdQ":{"text":"I love coming to Dizzys every time I come to NOLA. It is a TRUE local spit and a piece of ","useful":2,"cool":1},"QLh4O7J2qicu2ZRvbptlww":{"text":"I really enjoyed everything that my husband and I had for southern style brunch. A local f","useful":0,"cool":0},"_5DqoGQZqeMmfSh6647-Ug":{"text":"Great seasoned fried chicken, mac n cheese was also good. The gumbo was divine but the ric","useful":0,"cool":0},"YRVyCTLwdqPvaJ7P2RAEGw":{"text":"5 star items: fried chicken, gumbo, and bread pudding.\n\nWe stopped by Lil' Dizzy's Cafe on","useful":2,"cool":0},"RkTossFytkYBoucvnATKWg":{"text":"Loved this spot. Recommended to me by a local woman, I went for breakfast and had the frie","useful":0,"cool":0},"f2prjyShKs07z42TujU31g":{"text":"Got some take out fried chicken, biscuits, gumbo and jambalaya! The ladies that work they ","useful":0,"cool":0},"yA2pEhQJkxIg4XaXsy3DgQ":{"text":"Southern Creole Food in a down-home environment for the right price! This is Southern Hosp","useful":0,"cool":0},"ugYSRoUZSRMe7gY2V36JaA":{"text":"Almost didn't make it in (Closes at 2pm) but glad we did! The Brunch Buffet was well worth","useful":0,"cool":0},"-gM6n6xye_tAAaX705Y5AA":{"text":"Awesome spot. A former classmate of my dad's owns this place. The decorations inside are g","useful":1,"cool":1},"RT54oZWLITFnHLqrmTWfQg":{"text":"GET THE BUFFET!!!  The best gumbo EVER seriously!  I have had many gumbos in this city and","useful":4,"cool":4},"6ZQO8MiJEkhF_LY61OfGIA":{"text":"At the suggestion of our very nice bartender last night, we stopped in for a hearty breakf","useful":2,"cool":0},"eaj8sqrmEbLx1T_MnAhzHg":{"text":"BEST fried chicken I've ever had.  Po'boys are good too but get the fried chicken.","useful":0,"cool":0},"QP4uZtfTajjXaNDis95e-Q":{"text":"Food was decent not much of variety. Kind of messy. The service was the worst I've ever ha","useful":0,"cool":0},"CMtGVdfFdgO0qb_1pKz18g":{"text":"This is a place that feels very authentic as well as has a standard Louisiana menu- awesom","useful":0,"cool":0},"wEPGYtoWz7fJU5FMQ2CcEw":{"text":"I think there needs to be another star ......I would give it 6 out of 5. How I love the fo","useful":1,"cool":1},"Gu3Mmur9SMk9pCVW06mVSA":{"text":"Highlights-\n3 of us quickly seated \n2 ordered the buffet\n1 ordered a bowl of gumbo \nThe gu","useful":5,"cool":3},"wG7OBY-g0ruCsZLolqLY5Q":{"text":"Went there on recommendation of the concierge at Ritz-Carlton. He said one of his favorite","useful":0,"cool":0},"dtgxanMWovQBGNExTjBl1A":{"text":"OMG, the fried chicken, the macaroni, & the gumbo (& I don't even like gumbo) was DA BOMB!","useful":1,"cool":1},"dkHLiavnlE2BcKVQNcDVJA":{"text":"We ordered the fried chicken and gumbo. Both were great, but the gumbo was a little on the","useful":0,"cool":0},"C9uoBpwyq4J_FKVqV_JAjA":{"text":"Pros: This place has some of the best gumbo. It's not made for the tourists (bland and fla","useful":1,"cool":1},"8VwjgMkPN3fN8QvKyxVRnA":{"text":"My Uber driver recommended this place and omg I love this place. It's not a fancy place an","useful":0,"cool":0},"NQxvLCCKxOrf4WGUCXJn7w":{"text":"Been here twice.. Love the food! Place is small and packed with people, some waiting outsi","useful":0,"cool":0},"ysPjgQ7Ho0s1mV_T4Vhjqg":{"text":"I was visiting from St. Louis and there was a line outside so I stopped in. They had a buf","useful":0,"cool":0},"5RMllvGYTCfgIKTORl5zLQ":{"text":"Chicken is delicious ! No wait , we had the buffet , and the freshly cooked fried chicken ","useful":1,"cool":0},"BkryKSikpT-gq2Av-ht0Hg":{"text":"This is our favorite place in all of New Orleans!  Absolutely BEST fried chicken, bread pu","useful":1,"cool":0},"bc5uQOrT9CMlRinXUGlGSA":{"text":"I don't have much of a control group of bayou eatery to compare this to, but this restaura","useful":0,"cool":0},"F_GJdZ-XhDJB9j1QkKtb3w":{"text":"Still the best in New Orleans!  Stopped for breakfast this time!  Eggs, hash browns, biscu","useful":3,"cool":1},"6NZstZoGDhr39Aep7vtkjQ":{"text":"Great food, attentive service. Customers are a mix of locals and tourists, and the non-loc","useful":0,"cool":0},"wDj0Zr5gKIiMJM4Sadqh3Q":{"text":"Went for the buffet. Everything was great. Top 2 in New Orleans in my experience of 5 days","useful":0,"cool":0},"xpLGHhOaAS_5nXzIZJ_qBQ":{"text":"Man this is some of the best food around and I came back because I wanted the biscuits hah","useful":2,"cool":1},"2iIYGss1tmDtNZ9OMJy9OQ":{"text":"During my trip in NOLA, we decided to find a southern brunch place and Lil Dizzy was the b","useful":0,"cool":0},"sJLZ8iIv83pbna4SbPT0eA":{"text":"Restored our faith in New Orleans eating! A little out of the way from the French Quarter,","useful":0,"cool":0},"beCi7C5-yg8QhXUd-WkoOA":{"text":"Lil Dizzy's was highly recommended to us but we could never even get to try the food. The ","useful":0,"cool":0},"RCv2_4pL4AIY1hj6eu62Og":{"text":"I mean, why aren't you here? Especially if you're reading this on a Sunday? Stop reading, ","useful":4,"cool":5},"C2zXTm5kMvvYW_ayFvNkaA":{"text":"I ordered catfish, scambled eggs, and grits.  My food came out quick and hot. The service ","useful":0,"cool":0},"S_njfC8FemjBhwcrsh85YA":{"text":"Was looking for a good place with some real southern food the young man at my hotel recomm","useful":0,"cool":0},"UELFhTEfxgtFGFm5caMpnQ":{"text":"Great local gem! Went there with a group of friends traveling for the Essence Fest! From t","useful":0,"cool":0},"nztMhfbPoXDs3CEKBZe82Q":{"text":"This place has the best hospitality out there! Came from out of town with a group of 8 aft","useful":0,"cool":0},"9JeM4J0JiUfNnyKVijw7Qg":{"text":"It's been a minute since I been to this little spot but I love it. The food is great, the ","useful":1,"cool":1},"NzO9akcXBo5VN4reRIZCGQ":{"text":"We went for the Sunday brunch. Our waitress should go in another line of work. The food? S","useful":0,"cool":0},"B6kFlDe4rN-rFvmcGxKg8g":{"text":"I absolutely love this place. lol Dizzys is a New Orleans staple that every local has been","useful":0,"cool":0},"jW8lmD5GuTdNfllT8u6ubA":{"text":"I really enjoyed this place. I think they might have the best ice tea I've ever had, not o","useful":0,"cool":0},"-igIgVbBZBu5ngvW2jeEZA":{"text":"We got there for the fried chicken but a little too early for it...had to come by at 11 am","useful":0,"cool":0},"Ic-O1mnQD3oF0Ytoq5UMRQ":{"text":"Kiss $ss chicken.  The real deal.\nI could have sat here all day (and more) just grazing th","useful":1,"cool":0},"LjLvwPsRyJXD-T7vZHiFaQ":{"text":"Awesome place a little off the beaten path. The wait staff is super nice and the buffet is","useful":0,"cool":0},"v_G4V6amh6jomBxXOiRMyg":{"text":"We picked up food to go tonight.  5 pieces of fried chicken, mac n cheese, string beans an","useful":0,"cool":0},"k9nfKH_AFRCvDdC0EuEkPw":{"text":"NEEDS HAIRNETS!!!!! The first time I came here I had a great experience (which is why I de","useful":3,"cool":0},"VZ6MlE-BKtXWttXWw5iPQw":{"text":"Today we had lunch at Lil Dizzy in New Orleans. OMG!! The food was amazing.  The rice and ","useful":0,"cool":0},"MHctOQXODc7093sbwXvkzQ":{"text":"Upon entering our waitress greeted us by saying \"Hey babies!\". Felt immediately at home. R","useful":1,"cool":0},"iDKxVcQbP_h9eqFVveCHlg":{"text":"They have some of the best fried chicken in the world, and we think the bread pudding is t","useful":2,"cool":0},"0Es-KQrsMtS5t9IyYMbcEg":{"text":"Returning to NOLA from a swamp tour, I had lunch at Lil' Dizzy's Cafe on Esplanade. They'r","useful":0,"cool":0},"2s8LLPcVRI_zq3VjN0zNHg":{"text":"It is one of my favorite breakfast places and where all my visitors ask to go again. The c","useful":2,"cool":2},"UxLc6XzXx5gm0xP_0Y3_Jw":{"text":"This place gives me life; I couldn't go to NOLA without visiting Lil Dizzy's. The food is ","useful":0,"cool":0},"3zPex0SWcklRE2qHqu1L8g":{"text":"I went to visit Lil Dizzy's because I heard they made good gumbo. Not the 'tourist' kind t","useful":0,"cool":0},"5THyKZXqbtsV_ceF8bcP9A":{"text":"And I though I made good gumbo.\n\nThe buffet was just going to be too much food for lunch s","useful":6,"cool":4},"YY3suZCdJGd4JMPx_5BKmw":{"text":"I love this place. It is like a port in a storm. Thankfully, this port is about 5 blocks f","useful":2,"cool":1},"VvdDynNNBZxmd9lzn9ygUQ":{"text":"Service was mediocre. The breakfast buffet was disappointing. The macaroni was cold and my","useful":0,"cool":0},"sBcCY3dK9mwPgEWXuWhBtg":{"text":"Worst breakfast ever. Swimming in grease, unseasoned everything, homefries rather than has","useful":2,"cool":1},"ucYuuPW9V-V-t3i828mwhQ":{"text":"The best biscuit I have ever had! Lil Dizzy's was recommended by a co-worker back home who","useful":1,"cool":0},"TYSRCIIUF4rN00Cc7cfutw":{"text":"From the greetings and service, down to the delicious food, I loved EVERYTHING about my tr","useful":0,"cool":0},"uRoVmfavchHghofGppeZsQ":{"text":"The service is fucking abysmal. The food is OK. Nothing special whatsoever. Go somewhere e","useful":0,"cool":0},"RKpVkfvnblpmvwa6mrCUpA":{"text":"As soon as we came in, we were seated within five minutes of entering the restaurant which","useful":0,"cool":0},"97iXSijw5_ukkbWD3nYrEw":{"text":"I used to have a weekly meeting that met at Zachary's on Oak Street before these folks mov","useful":6,"cool":3},"o1CL0PNgWiXaa03Q9HLcYg":{"text":"I was visiting New Orleans and we were looking for a place for brunch. I got on here to se","useful":0,"cool":0},"MUycp_dQf85i_nZR0lwcvg":{"text":"I've been to New Orleans three times and this is the best food I've had. Period! Down home","useful":0,"cool":0},"UTxvHp8oDKRMUWRCtJen7Q":{"text":"Great little spot. The food was delicious. We came here on a recommendation from our uber ","useful":3,"cool":1},"ZCo3clcu4BZvKvmoS8kn9A":{"text":"I was staying in French Quarter and on my last day, i asked the concierge what to eat for ","useful":1,"cool":1},"LsrXAbKbG6Jkch5s261xBw":{"text":"5 of us came on a saturday around 1030 and had no problems getting a table. The staff was ","useful":0,"cool":0},"SARO2DXg_iejGnAPsq7e8Q":{"text":"Second visit here yet the same poor service! The food is really good local home cooking bu","useful":0,"cool":0},"ujMpeB86RxFCNSM40-8nag":{"text":"Amazing food! It's too bad, I can't give it 10 stars. We've come to Lil Dizzy's every year","useful":0,"cool":0},"zaIukk1kpfgskq6_ncA0tQ":{"text":"Definitely a hole in the wall restaurant! There was option for buffet for 15$ pp I believe","useful":0,"cool":0},"el_G0YoGyS4at-M-q-ekzw":{"text":"Nice place and warm service! We ordered Shrimp grillade and jambalaya omelette. Great food","useful":0,"cool":0},"KLEr2FT1SBwHj3UHsIXNdA":{"text":"My roommate and I went to New Orleans for Mardi Gras. I woke up wanting some soul food and","useful":2,"cool":0},"t-IVMEM28cvBUH00v5exqA":{"text":"This definitely a Yelp find, we had to walk through the rain to make it here, but worth th","useful":0,"cool":0},"nPwDFkEsmBn05093aua8mg":{"text":"This past Saturday a friend and I tried to go to the Ruby slipper in Mid City (where we ha","useful":2,"cool":0},"-WkkX7rTkSCNrMn0R3fzXQ":{"text":"Down home brekkie buffet. Fried chicken, bread pudding, gumbo and sweet tea . Affordable, ","useful":0,"cool":0},"NlGZjDokA4bVKFfiAsAMZQ":{"text":"This place was recommended by a local. Everything was phenomenal, and the service was frie","useful":0,"cool":0},"jwntFUJu6807QOIABDqw0A":{"text":"Went here for brunch and got the buffet. They serve you gumbo and potato salad to start an","useful":0,"cool":0},"VuZ0Bp6OA3Mm4D2DbYZcZw":{"text":"Lowering my previous review because of a fact that I didn't realize when I was there last ","useful":2,"cool":0},"sXkM7uR8ir6tXh69vykyFQ":{"text":"After my perfect meal I wanted to stand up and clap. The food was delicious. Fried chicken","useful":0,"cool":0},"56nGpssdxZrTqlHHFjeP7A":{"text":"The food was fantastic. Seating is a little tight but well worth it!!! Will be going back ","useful":0,"cool":0},"oY1mtlZo1D_pzKEz46qx_Q":{"text":"the food was pretty decent, however, service was very lacking. I ordered bowl of Gumbo and","useful":5,"cool":0},"5SeTfHN9KrZ3m4dZG88pCQ":{"text":"Let's start with the \"butter.\" It was country crock-a sad excuse for anything natural. The","useful":1,"cool":0},"8kWq_RbZibc2yY3NzZrBiQ":{"text":"This was the first place we unexpectedly visited upon our arrival in NOLA.  And it turned ","useful":3,"cool":0},"Dgw2AMcDItrSO2jATkQ7tQ":{"text":"Great local place they make you feel at home with their no nonsense attitude and southern ","useful":0,"cool":0},"Bjd0JdwsbWsX4B8GaDFoTA":{"text":"Store's hour is 7 to 2pm. We arrived at 12:50pm and were turned away by the waitress sayin","useful":0,"cool":0},"Glc8HMKrQcLpDxcORjivKw":{"text":"I had eaten at Lil Dizzy's before.  The brunch buffet at the Poydras location and lunch at","useful":1,"cool":0},"EX_uCsC8CyB6aJMQfrFSEg":{"text":"They weren't extremely busy (6 customers tops) and I STILL had to wait forever to be seate","useful":0,"cool":0},"AdAR2Z1ys4s8fRfZn2sV7Q":{"text":"Good homemade hot sausage links. Great way to start your Sunday.  The restaurant gets pret","useful":0,"cool":0},"CDeKUc6QdRKA7ww1UAa6lQ":{"text":"The breakfast is just ok and needs some work. The grits needed a lot of salt and butter an","useful":4,"cool":2},"DEJCzlgnkbGxz79LFxs6Dg":{"text":"We were recommended this place from someone back in Australia this place is amazing. The b","useful":2,"cool":2},"0bVXqcmv9tXdpafH9CZjnA":{"text":"In town on business and we visited Little Dizzy's twice. The buffet has been a great way t","useful":0,"cool":0},"k2G-2o9H8m1WKEl8fR_SnA":{"text":"Highly recommended. I had a private birthday party here and you can't beat the price for w","useful":0,"cool":0},"EBjkDhhND4XtzRhr-abJag":{"text":"Stopped in for brunch today, after a great recommendation from a good friend of ours! And ","useful":2,"cool":1},"5wqhn5Te9BBPwE07PImzZA":{"text":"We got the veggie omelet, hash browns and one piece of fried chicken. Check was 9 bucks. L","useful":0,"cool":0},"6s86W05YgBZoDMcyRePPkQ":{"text":"Great Sunday brunch with authentic creole/southern cuisine. A must whenever I'm in New Orl","useful":0,"cool":0},"F1Q-Jh0r42iJ5OFy5QKMBA":{"text":"If you go during buffet time and get anything BUT the buffet, you are missing the best opp","useful":2,"cool":1},"8gJcBBn0PMd_4y4CJNGHQw":{"text":"Treat yourself and get the buffet. You get a chance to try a lil bit of everything, and yo","useful":0,"cool":0},"8Wvsyg2G2I3LLhkPzYv6gA":{"text":"I want to give this place a better review, I really do.  But three stars is the tops.  The","useful":1,"cool":0},"9t35j8KY_EqreKbjA-15yQ":{"text":"START YOUR NEW ORLEANS FOOD TRIP HERE. END IT HERE. EAT HERE IN THE MIDDLE TOO!\n\nI went fo","useful":1,"cool":1},"MkyIGKglqNSjHR9xbnE2gA":{"text":"First timers here coming from NorCal. Place was a hit. Friendly staff, atmosphere and food","useful":2,"cool":0},"v-F6LNuHuPRqi7yrnoNpmA":{"text":"LOOOOOOOOOOOK!!! Do yourself a favor and go here!!! The food, the service, THE FOOD is ama","useful":0,"cool":0},"jLNBuVTQxqRFWHHBBKx4Sg":{"text":"Amazing food and amazing staff! Fried chicken was delicious and the bread pudding was some","useful":0,"cool":0},"eN4YxwEuFGtzvYSzXfWWPw":{"text":"I have to give this place 5 stars solely based on the food. I've been told by many that my","useful":0,"cool":0},"BFKfDSvhWMnpiJwveItFwQ":{"text":"The food was excellent. We waited about 30 minutes for Sunday brunch. However, the service","useful":0,"cool":0},"2jjd06ApHn4VZKfqzhTONA":{"text":"4 simple words: ALL YOU CAN EAT. Add 2 more words to that, and what do you get? ALL YOU CA","useful":0,"cool":0},"N5U-iAQp7ManVbw4LkbNgQ":{"text":"What a wonderful dining experience! The food is cooked right before your eyes. Everything ","useful":0,"cool":0},"wKgHu0KNlgKvay5Oalg_mw":{"text":"A definite on those occasions when you're willing to splurge on calories. Their lunch buff","useful":0,"cool":0},"UM_EARYIQVvzP0ZZZP3v4Q":{"text":"This place is such a gem!! Staff is so friendly and a lot of fun! The food is amazing!! We","useful":0,"cool":0},"NIgAkeEqFYFC6T8Su_RAAQ":{"text":"Stopped in last week to try the lunch buffet. My only complaint is that the buffet didn't ","useful":0,"cool":0},"Xzrq-QrR1vNT1QXq3xAJ1g":{"text":"OMGUMBO! \nI bought the buffett, what a deal! Everything was so good! The Gumbo was Heaven ","useful":1,"cool":0},"PutGooUqDuQ-kqrFgpo0VA":{"text":"Unlimited fried chicken and macaroni and cheese. Their food is excellent all the food plac","useful":0,"cool":0},"e1vKFjn_G0iZTl4l-0MIYA":{"text":"Sunday Brunch Buffet costs 18$. It includes tea or coffee & all the fried chicken, gumbo, ","useful":4,"cool":1},"rdr3XS6GzjMZqjiNLYQFQQ":{"text":"My friend had bookmarked this place prior to our stay in New Orleans.  We were silly the e","useful":0,"cool":0},"S6E3sD4jo76760FTcIeGTQ":{"text":"The chicken was great with greens and red beans and rice. The bread pudding I would like m","useful":0,"cool":0},"CErJBLIAAQsc4-c032b0Rw":{"text":"The food here was good. No frills at all but well prepared, fillling and decent value for ","useful":2,"cool":0},"TMdDI1WO8roDPoWtSLhZHg":{"text":"Amazing food, but even better atmosphere. The restaurant is small, but cozy and you feel l","useful":0,"cool":0},"Jk3lP4BT9Obpsz08JhnrYA":{"text":"We had the weekday lunch buffet which was awesome. Gumbo, fried chicken (!!!), Mac and che","useful":1,"cool":0},"pj4fbhGPGyBOxKU9NvX9zg":{"text":"The chicken, gumbo, and bread pudding were fantastic.  The place is pretty small so it mig","useful":0,"cool":0},"Bw4ssAipmUqqESjiZwiHRg":{"text":"Pretty good service. Had fried chicken, sweet potatoes (the second best I've EVER had), an","useful":2,"cool":1},"88fzM3pEmkhfnkQh8AGg7w":{"text":"Located a short Uber drive from the Quarter, we discovered this place from  yelp...and so ","useful":0,"cool":0},"H4mwo8D6jJKwL0TiYS3myQ":{"text":"Now that's an omelet! The special of the day crawfish omelet with a side a grits! Cooked p","useful":0,"cool":0},"zWzw_pUA2Cae_PZpPpeh1A":{"text":"Amazing food ... took a recommendation from one of the locals and so glad we did. Wait sta","useful":0,"cool":0},"PvF8OGU2nlYdVwMjPrTcDA":{"text":"So, we are always up for a good brunch buffet and based on other reviews we decided to che","useful":1,"cool":0},"gVPs_01XicOL6wl5NEK2Eg":{"text":"Great service and great food! Just what we were looking for for our first time in NOLA. Lo","useful":0,"cool":0},"kBzKFGvhFBndgVOfvO0kQA":{"text":"I ordered the daily special of fried chicken, rice and beans. The fried chicken was hot an","useful":0,"cool":0},"gH21s-majKprSxuDTQvVhQ":{"text":"great brunch on sundays! its all about the shrimp & grits! the workers are really nice, mo","useful":0,"cool":0},"MLIzhiqBmPaBhPOUARvgOw":{"text":"Entered into a nice atmosphere.  Greeted as we entered and seated immediately.  Our waitre","useful":0,"cool":0},"-Q7a8rvzeqMb2hymGDHPAA":{"text":"This is one of my favorite in N'lean. The Sunday Buffet is spectacular. If you are looking","useful":0,"cool":0},"UwQSz4R1tQs--bMlcL6tDw":{"text":"So let me start off by saying that the food here was good enough for me to visit twice whi","useful":0,"cool":0},"jblcKNBf1H8QqOLmj7e6ow":{"text":"The best meal I had in NOLA was the Sunday brunch at Little Dizzys. Cooked to order eggs, ","useful":0,"cool":0},"FX2TkFoLdtTT3hCON-DtmQ":{"text":"Food just like your nana used to make. The mac and cheese is amazing, the gumbo is one of ","useful":0,"cool":0},"bGhuQpB9Wgodd_VSwe2D7A":{"text":"Funky little spot with an adequate buffet. Wife and I arrived around 1:30 (closes at 2pm) ","useful":0,"cool":0},"uqxGCPcLEmZTg3brxgiC6w":{"text":"Sunday all you can eat brunch. SO good. Especially the French toast. Get the French toast.","useful":0,"cool":0},"VfvnoUg1vaxzeOg21lNW2A":{"text":"Good experience, food was fine, prices high. The spices weren't as much as I expected. I w","useful":3,"cool":0},"6zeLAvyvzCU6e2yH-1Q5ow":{"text":"This place amazing. It is quintessential New Orleans and All the food is obviously made wi","useful":0,"cool":0},"m7kADdpj2VglLVRio7h_-w":{"text":"Decided to dine hear for my birthday breakfast along with my fiancé. Started off a bit roc","useful":0,"cool":0},"FL7wQ7BvGxIlcX-KmJvHjA":{"text":"Everything was so yummy!  True mom & pop restaurant that will satisfy your cajun home cook","useful":1,"cool":1},"qjTmFyoxkUf12gKj2dgqPA":{"text":"Crowded local spot that has a regular lunch buffet. I went for the $10.99 lunch special wh","useful":0,"cool":0},"zlNlKrthI4rmEz8w4ta8jA":{"text":"Was in town and totally down to enjoy some of the local spots. The food was just OK compar","useful":0,"cool":0},"g7U6fiFYbMFta3tcR5m5mw":{"text":"Heard rave reviews walk 3 miles to eat there ....AND was NOT impressed at all what so ever","useful":1,"cool":0},"YAB98AYB7wufL55fV1x0xw":{"text":"Nice small cozy \"homey\" restaurant. \nStaff is really nice. :)\nThe gumbo is delicious and A","useful":0,"cool":0},"M-fQrIRgx530DlMcybP0Hw":{"text":"This is real southern cooking, full fat and millions of calories. We had the lunch buffet:","useful":0,"cool":0},"zj4skPv1gJxLi2qhwvjQQw":{"text":"This place was highly recommended by our host when we stayed in Treme, and it did NOT disa","useful":1,"cool":0},"Sw2-vNVU8gGoxoH_8s2BOg":{"text":"It's a bit of a walk from the quarter but you'll be glad you made the trip. Southern cook'","useful":0,"cool":0},"cuDWAz41T6BtO_pYYDXFqA":{"text":"I heard this was the place you had to have breakfast. Service was not great at all. Waited","useful":0,"cool":0},"8aan_YzMRvjipRPb7WT5yQ":{"text":"Home style feel. Very small and tight, we are all family is what the said. All you can eat","useful":0,"cool":0},"WpjdO69gU_YD5_J55CEfZw":{"text":"Oh my this place was a great find.  Their Sunday brunch buffet was, well, awesome. Admitte","useful":1,"cool":0},"m6OLjwOkov6qeyzuINSHXA":{"text":"So day two of being in Nola I'm like I need some back home type food so I walk and walk to","useful":1,"cool":0},"_9-O0aroedsgNpQ92Kx67Q":{"text":"Went for their famous Sunday Brunch and it was good. It would have been better had  I gott","useful":4,"cool":3},"yo-q6ew2GhxwxTumy0YEUQ":{"text":"The first time I tried going to Li'l Dizzy's, it was a Sunday and the wait was over an hou","useful":0,"cool":0},"Q4vG80caV0aThl4VnN6-IA":{"text":"Had the buffet here at a local's suggestion.  It didn't disappoint.  It was a great way to","useful":0,"cool":0},"0s2nF_fGTO1ATGyTy5uUww":{"text":"Recommended by a friend. I had the crab omelette, cheese grits and a biscuit--the cheese g","useful":0,"cool":0},"_VaoTQMK64kSViSdUEqLDQ":{"text":"Do the waitresses sometime come off a little gruff?...Yes. Is the brunch buffet a little o","useful":0,"cool":0},"zKOMphQ2BjUQMlYzhKqdOA":{"text":"Great place for brunch! The fried chicken is a definite must have! Biscuits are the best I","useful":0,"cool":0},"FkxoArerxYcC4OFcAY3hmQ":{"text":"Sunday morning breakfast at Li'l Dizzy's did not disappoint. I had the eggs, ham, hashbrow","useful":0,"cool":0},"V8fl6dNwfMXTIdtvpYMBMg":{"text":"Their brunch buffet is delicious!  The gumbo is well done, love their grits and bread pudd","useful":0,"cool":0},"pQw13CwJMk3pzIKlfs12iQ":{"text":"Stopped by Lil' Dizzy's for breakfast on a recommendation from a local and we weren't disa","useful":0,"cool":3},"CFjvwaVPdFEK_vTfB1ovDQ":{"text":"Banana Pudding and fried chicken are MUST-HAVE! Great gem in a very historical neighborhoo","useful":0,"cool":0},"_1ddKFQBMpfZK2RSi5bPGQ":{"text":"The TREME BABAY!!! Lil Dizzys is always on point with the best chicken, gumbo, heck everyt","useful":2,"cool":3},"76IxwRd7qkl2FkkJuxrrmQ":{"text":"Located on Esplanade Avenue in Treme'\n\nLi'l Dizzy's delivers authentic Creole and Southern","useful":1,"cool":0},"l4_u96WQbFR_x172R5ZmxQ":{"text":"Small and crowded most days, this New Orleans legend continues to serve some of the best c","useful":2,"cool":0},"mnI-8V4-Bnl8933kOVI5Aw":{"text":"The juiciest fried chicken I've ever had in my entire life!!!!!!!!! That is it and that is","useful":1,"cool":0},"9HYHgmdoer0Lx1QsCqtujw":{"text":"Li'l Dizzy's is an institution. Good food overall, but the brunch buffet is where it is at","useful":0,"cool":0},"JmmrSepU_H5tzCH_PajAYw":{"text":"We visited L'il Dizzy's on our last day in New Orleans and it did not disappoint!  The foo","useful":0,"cool":0},"pCOxkdr7a7G3eXTxKTNxWw":{"text":"It was OK. We went for the brunch buffet. The fried chicken was not as great as I was hopi","useful":0,"cool":0},"5lpOySQu7bgaSrnlidXmGg":{"text":"By far the best buffet I've EVER been to. The gumbo is to die for...well, actually, everyt","useful":0,"cool":1},"p0yatWnlw3wQV96QLBkq3g":{"text":"Best Food Ever!!!!!!!!! I tried the fried chicken and the gumbo and I felt like I died and","useful":0,"cool":0},"ewYk64z-qLjGYrS5imMb4g":{"text":"Man, this place could not get better!  Louisiana is my home state and my husband, son and ","useful":0,"cool":0},"tiO2aLCUPhYRqmYxjN67ig":{"text":"My favorite no frills meal on my last Nola trip was definitely at Lil Dizzy's Cafe- the $1","useful":0,"cool":1},"1V2IsVaOZLw_tGg8I6kOWQ":{"text":"My husband and myself visited here based on a recommendation from a back home friend and w","useful":0,"cool":0},"VW4WMH-iX40DpjQ7_T0Yaw":{"text":"There's delicious dining in the dirty south at Dizzy's, y'all.  Did you see that?  This pl","useful":3,"cool":0},"W2lUjCHtGmSZ7ZyDRdYmbQ":{"text":"If you are visiting NOLA don't forget to stop at least once in Li'l Dizzy's Cafe. The fist","useful":1,"cool":0},"4OV7vAAM62Tv9sywHKCiJA":{"text":"After driving past this small restaurant countless times, and always closed, today my fami","useful":0,"cool":0},"QFNa5qYceNmiRH1VOeVH1w":{"text":"I will admit that I was a little hungover so with a flippy tummy, everything wasn't so yum","useful":0,"cool":0},"tdwDXEKYy23L58qI_WHusQ":{"text":"I got exactly what I wanted when I got to Lil Dizzy's. Catfish and grits and love. I trave","useful":4,"cool":5},"70kmjVlP_t5MANIgzs1btw":{"text":"This place has fallen completely off. Lil Dizzie's was always the last spot I visited afte","useful":2,"cool":0},"Ce96kCLGkMqz3kZW4rJpIw":{"text":"Great food! We got the buffet with fried chicken and gumbo and potato salad, Mac n cheese ","useful":1,"cool":0},"fpE4R17ZaTmyRaZ0c5IhRQ":{"text":"If you want to truly experience \"local new Orleans\" and not the tourist food....this is th","useful":0,"cool":0},"I24_-tJAwjpCrBxGvD4ujA":{"text":"All I can say is I'm so glad we picked the whitney to stay in for this trip!! I have to gi","useful":5,"cool":1},"LfJQppM9qsmr9sPP5qTMHg":{"text":"Lunch buffet all the way. Basically everything makes you reevaluate your previous standard","useful":1,"cool":1},"x_KpZBY6z0i7EReWOvaGsg":{"text":"Where do you start when everything on your plate is great?  I had the brunch buffet on a w","useful":0,"cool":0},"Kwt67vJDP1JGPU0J_5YooQ":{"text":"We ate there after 5pm on a Friday. \n\nPros: \n- The food was amazing. Cook to perfection. \n","useful":0,"cool":0},"ORDXxhAIhKoA2u4Ra6p84g":{"text":"I love this cute café and the food was amazing! I went with a friend early one Friday morn","useful":1,"cool":0},"8KPAvxYmdv-3eLA90HteUw":{"text":"The food has been good everytime i been (3 times?) , however the host was a bit rude.. he ","useful":1,"cool":0},"_aZNPvbiQ245nMGhLURL2g":{"text":"When i saw the restaurant from across the street i knew the food was going to be good. Wen","useful":0,"cool":0},"uav8GkzgbY8yapBvVb1bWg":{"text":"This lil hidden gem is FREAKING AMAZING. A friend recommended it and I will come here ever","useful":0,"cool":0},"tLzJDVGPTv6Gnx_Q1U5XBg":{"text":"We went there for breakfast. I had the shrimp grillard, which is sauteed shrimp with mushr","useful":1,"cool":0},"LFpXc5oZ7zSu0bBcIkQ0JA":{"text":"This place has excellent southern home cooked food and the service was great. Next time I ","useful":0,"cool":0},"n_eC7nKK4ij-tj9E0zdCpQ":{"text":"I'm visiting from California. I was not impressed at all. There was a brunch menu and regu","useful":0,"cool":0},"3rYO87GDlfIxVtkuNVhtnQ":{"text":"Convincing myself to give it another try I went back to Lil Dizzy today and he had a sprea","useful":4,"cool":1},"Nr25qr8ARFBJkGGnQR2nEA":{"text":"I sincerely wish that I could give this cafe the 5 stars it deserves but this review is st","useful":11,"cool":1},"pLMLeiAaSlB2E2mlWqbnIQ":{"text":"I'm visiting my Daughter at Dillard University. She spoke highly of Li'l Dizzyy's Cafe.  W","useful":0,"cool":0},"XtJ95phEdOeGR_xp8AsZRQ":{"text":"First impression of lunch buffet was: but there's not a lot of choices but then I sat down","useful":0,"cool":0},"Q0UN1MBJxQJABKStnEfxsg":{"text":"I'm so glad a friend of mine told me to check out Li'l Dizzy's Cafe before I left NOLA. I ","useful":0,"cool":0},"HjKqAxn-HyCjWm3U_t-s4A":{"text":"Food was amazing! I love a good black family owned business and this one did not disappoin","useful":0,"cool":0},"h8mSv57efyQYU3CZVopWjw":{"text":"If you have ever been to an African American Family Reunion or to your Cousin's house for ","useful":0,"cool":0},"5GjQRplo39rGc3jfm4dEow":{"text":"This place serves excellent food !\n\nI have had a few gumbos in this city and definitely, t","useful":0,"cool":0},"Aqsha6MPkeppxqee-tTyWg":{"text":"Food was amazing you gotta do the buffet and omelette. The fried chicken is so juicy and c","useful":0,"cool":0},"VeKUPdxdabv1c24tfGSAGA":{"text":"This was a quaint little crammed \"in your mother's kitchen\" kind of vibe. Everyone Had a g","useful":0,"cool":0},"TnGqnOGIRIM2wMrff5aViA":{"text":"Last week after checking out the Treme festival we wandered into the cafe. We'd been eager","useful":0,"cool":0},"9YczLrGNFOggT6S1ODacfQ":{"text":"I have to say this. I was at the Gumbo Festival and I am disappointed that Lil Dizzy's did","useful":0,"cool":0},"OCHpYz54Mp-zf8qMAflDPw":{"text":"Great food very authentic New Orleans cuisine I've been here visiting for four days and it","useful":0,"cool":0},"VBUf85zjI-k2aCG8MdDkzQ":{"text":"I'm feeling the love for sure.  There were dishes that were as good as it gets and there w","useful":2,"cool":2},"qwuTrSAkrcBBVwlhZel-fg":{"text":"Little hole in the wall. A friend told us about this place and I'm glad she did. They offe","useful":0,"cool":0},"6vCNHIj3RqwfTDoPSkVWLg":{"text":"This is the one place I have been in NOLA that I would give 15 stars to if I could. We had","useful":0,"cool":0},"3eWYp0DgJ7e72YBfKhuSDA":{"text":"First meal of 2016 success. My husband and I walked in and it was exactly what we were hop","useful":1,"cool":1},"X1_QqWSSb_QdopChXg-g2Q":{"text":"One of the best breakfasts in town.  Period bar none.  Great food, great coffee .  I love ","useful":0,"cool":0},"PM_KgPKO616UEtx8kbXFdA":{"text":"Had breakfast with a group of friends.  While service might be described as a little slow ","useful":0,"cool":0},"gMB9ZHEiYRKr94oXsBxWBQ":{"text":"Had the buffet. Gumbo, Fried Chicken, butter beans. All amazing. Finish it off with bread ","useful":0,"cool":0},"tVLLIAWafX8E9Bgg6cf4CA":{"text":"I came for their breakfast one day, and to order was a bit chaotic. It was a weekday and I","useful":1,"cool":0},"eWRd35cVvpo7IbDWjvSSzQ":{"text":"This is the newest Baquet family restaurant but it has been in operation for a number of y","useful":4,"cool":0},"X_uUQuGOJngt0bGai6ExOg":{"text":"So, I have been here twice. The first time was pure love. The second time...not so much. \n","useful":1,"cool":0},"v3ucHtyw3oA-Xje0MPvlcA":{"text":"We came into town for Mardi Gras. We had to wait for almost an hour. We wanted to order br","useful":0,"cool":0},"D51zTClvRJt3_ArIiWDtQw":{"text":"One of the best buffets in New Orleans. A must for those visiting the Big Easy! The gumbo'","useful":1,"cool":0},"5PhaIl5m3PiS9fwfyfPsQw":{"text":"Service first of all was not the best. I was visiting New Orleans from Houston, and I have","useful":4,"cool":1},"x-Mpg84nsbTVYtfs4oSNng":{"text":"Buffet lunch at Li'l Dizzy's Cafe on a Monday afternoon... epic!  We arrived just before n","useful":6,"cool":2},"UacK_yjfkxInLdcA8XRsUw":{"text":"We had the brunch buffet last Sunday and it was deliciously delicious!  They have the best","useful":0,"cool":0},"2iQNZkeVGkfSKtQmyt552Q":{"text":"Very good food. I had the lunch buffet (I'm not a buffet fan) but this was good.  Excellen","useful":0,"cool":0},"M3gu18sT3snnj67_1KuUVw":{"text":"Read so much, we had to visit. Stopped by for Sunday brunch. Waited fir about 30min before","useful":1,"cool":0},"8ORX13uw8JPkjkdr1zm9rA":{"text":"Walking in here is like going home on Sunday for brunch with the family. They serve good o","useful":0,"cool":1},"wpSEmXaiFOMVJSocAbQ_WA":{"text":"The good: the chicken lives up to the hype. Today, they had fried chicken and baked chicke","useful":0,"cool":0},"bfQ2wMpba8CGmPRtyTOFrQ":{"text":"Wow. This place was incredible. This is a MUST eat. Make sure you get the buffet as everyt","useful":0,"cool":0},"BDOJvBs71QaQqt89M-Fg0w":{"text":"Ate lunch there on  8-4-2011. I had the buffet which was a good way to try  multiple items","useful":2,"cool":1},"wY39OwXEhdEpQWeX4NQhkA":{"text":"So happy my girls and I found Li'l Dizzy's cafe! The food was amazing, down home southern ","useful":0,"cool":0},"lGQX087CgNQboTA7VOAvSw":{"text":"Oh, wow! A transformative food experience. Went with the lunch buffet, wasn't planning on ","useful":2,"cool":2},"by1HGmDV9CG6pP4MH2yhaA":{"text":"We visit New Orleans all the time and found this little gem on I think Expedia. We decided","useful":0,"cool":0},"OvjqE8eKEA6fl5LMNdIJ8Q":{"text":"Awesome! I love this place! Here for Bachelorette Party and we stopped here on the way out","useful":0,"cool":0},"pnY1b4x9KCrgag-JU-uRNQ":{"text":"Wow - outstanding service and fantastic food in a cool casual atmosphere. Try the French t","useful":0,"cool":0},"p99mCpFIiZg7r3ZHWe9NcQ":{"text":"Overly salty and lack of depth of flavors.","useful":4,"cool":1},"0ILneZ1S8RGiVAlJ0abxDQ":{"text":"i went biking solo and sorta kinda ran into this place. it was like an oasis since i hadn'","useful":1,"cool":0},"LrYpuPeOplJpCAtBhlrWPA":{"text":"it was such an amazing experience to come back to visit and have some delicious Cajun food","useful":0,"cool":0},"wMYnbVjRsigu9IuVx4FuQQ":{"text":"Whenever I'm in New Orleans, I need to make a stop here. That buffet is the best deal. It'","useful":0,"cool":0},"Yz6mVGRtcjLHDzUNfHCj3g":{"text":"Nous avons profité du brunch buffet du dimanche. Malgré un choix dans le buffet assez limi","useful":0,"cool":0},"Aa19eoAt8bJ6mFRgIdjosQ":{"text":"We came here today for a quick take out breakfast. We\nShared a hot sausage with easy over ","useful":1,"cool":0},"hf0LpZSsfqOW-7QULQpFuw":{"text":"3.50 stars.  I was told to go here for the shrimp and grillades (grits) and fried chicken,","useful":3,"cool":3},"0IIMsaNDos-cFAjYO4o-3A":{"text":"Sunday Brunch was great! Service was great!  I left a happy customer!  My only complaint i","useful":0,"cool":0},"tcONHFl6-qq-RxXB3fkqyw":{"text":"A good taste of New Orleans! The environment is very unique and the servers are quite colo","useful":0,"cool":0},"cU65U9-V-DAF6a7-k8SoHQ":{"text":"Let me start off by saying from the moment we came to the moment we left nothing but south","useful":0,"cool":0},"y7RZ-VD19ur9LBIkURmJ4g":{"text":"By far one of the WORST customer service experience in my whole life. I was really excited","useful":2,"cool":1},"ZKvjRIXOnRTrJ9GautwY1A":{"text":"The fried chicken was great. Seasoned, and flavorful, but not overly salty. We did the bru","useful":0,"cool":0},"Ounhv9JSFHsCvvnB7X72yw":{"text":"Fantastic comfort food good for breakfast, brunch, lunch or dinner!  I had the catfish, gr","useful":0,"cool":0},"oqTiPObtStPX6jf95X2Wxw":{"text":"This place was just alright. Nothing to brag about except for the crab dressing which was ","useful":0,"cool":0},"paFDhsTwLtLONuAo5SLB9w":{"text":"This is the second time I have been disappointed with this restaurant which is the reason ","useful":2,"cool":0},"S8qTWMpZSYSM0LYS23fK2g":{"text":"Buffet is legit for lunch. Fried chicken, gumbo and bread pudding are worth the super shor","useful":0,"cool":0},"mrWmkFmKzx9AKJ5_srAX7A":{"text":"Food and service is great, its like going to that house where the food and conversation ke","useful":0,"cool":0},"Vr_s7K4PA8eaBjXAKxGruA":{"text":"The place is extremely dirty. From the people serving the food to the floors, to the table","useful":2,"cool":0},"HAVxD1k06yrWy2FUAXCAuA":{"text":"We were staying in Treme and ate here twice.  Both times was great.  The fried chicken and","useful":0,"cool":0},"PalbpmZ9iMdkwr5KRNmjCQ":{"text":"Amazing. Pls go when in the area. Was recommended to me from a local and was the best food","useful":0,"cool":0},"gFBDQCThhJwL9EQVzk22aQ":{"text":"Went for breakfast before we caught our flight home. We ordered cheese grits and biscuits.","useful":0,"cool":0},"kxtsdWaudtoAB8IR4QZbNQ":{"text":"If you want the REAL New Orleans go here! Awesome buffet, really good service, staples lik","useful":0,"cool":0},"a0m8qz0_cJ1OZ8VPY3Tdrw":{"text":"Recommended by a few locals and SO GLAD WE CAME HERE. I regret all of the other places I a","useful":0,"cool":0},"bfZShJj3OMwk04tDoNPSCA":{"text":"Best shrimp and grits in New Orleans! Atmosphere is great and the people who work there ar","useful":0,"cool":0},"QMiGSqnRn5_AReIqszyV7Q":{"text":"On our fourth visit to this place from Jackson, Mississippi, we had the worst experience w","useful":0,"cool":0},"cp6F53qCiOM4kYo2jdmBwQ":{"text":"This is one of my favorite brunch spots! I come here often and I love introducing my out o","useful":0,"cool":0},"-odCQ_1gb5owU4iCsTCogQ":{"text":"Best breakfast in New Orleans! Awesome buffet, great atmosphere. Real deal creole breakfas","useful":0,"cool":0},"CaWuG7NTNVLvI2Zty3i_cw":{"text":"As always, my crew and I thoroughly enjoyed both the food and the service. I think it's on","useful":0,"cool":0},"TM0b0Tf7O4EZqaucpAJQiQ":{"text":"When I lived nearby in the Treme, I would stop by for breakfast a couple of times a week..","useful":0,"cool":0},"Y3ARJ1Sw8aIrufS1wbtXFA":{"text":"The first good sign was everyone in their church clothes. Owner was chatting up customers ","useful":0,"cool":0},"UpuWJT_Y8CKMnQ5iB7Q3jQ":{"text":"What was this? What was this experience? Lil dizzys is more like an event than...i don't k","useful":0,"cool":0},"7M8_a_2bbAgTJsnhZKflbQ":{"text":"Great little neighborhood joint with great buffet for $16.  We especially liked the red be","useful":0,"cool":0},"cSULPfjMU9TnUu9nAqRQlw":{"text":"The food and tea is absolutely GREAT!!! Choose the lunch buffet. And the customer is thumb","useful":0,"cool":0},"T-yhidqVP5iTrl0GP5CX1Q":{"text":"Shrimp & Grillades--BEST I HAVE EVER EATEN! Our waitress was wonderful, She is the owner's","useful":0,"cool":0},"vTBkSSRI9gw3C4gdWFlmeg":{"text":"Man - I don't usually leave reviews unless the service/food is really good or really bad. ","useful":4,"cool":0},"5PHgXKaNS_1j_Cd5nFsndw":{"text":"eat here labor day weekend, I've had better food a crappy dinners. food was edible but not","useful":1,"cool":0},"LdlF74GFCoFVO1POpF_d7A":{"text":"Best breakfast buffet, crab & shrimp omlets, fried chicken, gumbo, great french toast with","useful":0,"cool":0},"Kai7kqQT4L3fuzEkmXkQ2A":{"text":"This was the worst experience I've ever had in New Orleans and I've come off and on for 20","useful":0,"cool":0},"PljGO2TFLhrEO6MkiASF7Q":{"text":"Mac and cheese - damn good.\n\nFried chicken - a religious experience\n\nSunday buffet - bette","useful":1,"cool":0},"SmYVhgZXEQX3hjrPtsGGlQ":{"text":"We came here on Sunday at 11 am, right before the rush and were able to find a table in no","useful":3,"cool":1},"_vQQUJF8IBB-UH6GzDxdGg":{"text":"Hands down the best restaurant in New Orleans. It's a small building so sometime the wait ","useful":0,"cool":0},"OaIcX_jS6H6OwAGHMV8ikw":{"text":"Holy moly. This food was legit. A group of friends and I came to NOLA to celebrate my 30th","useful":1,"cool":0},"6Z-IGdpz6XP-llkbwAzDLw":{"text":"Fantastic restaurant with an amazing staff! The food was authentic New Orleans cuisine wit","useful":0,"cool":0},"2N6bGWaN2OYi3dBCWZpL4w":{"text":"Li'l Dizzy's is a fantastic stop for a leisurely and hearty breakfast. The eggs and bacon ","useful":0,"cool":0},"wQPc-C81L6CQykLHUTjOgQ":{"text":"Kind of crowded little joint, but for good reason. Amazing food. The gumbo is exactly what","useful":1,"cool":0},"IcKXRciVYXhrafSeY1C5VA":{"text":"Went with my husband after a friend's recommendation.  It's away from the main tourist are","useful":0,"cool":0},"vU6aLkxC6IebFjb_6Agx6Q":{"text":"I came here for brunch with friends. We had a large table and our one waitress seemed edgi","useful":2,"cool":0},"e8czI_u1XMpHv4Yf8Msa2w":{"text":"Brought tears to my girls eyes again.  Amazingly, the incredible staff remembered her and ","useful":1,"cool":1},"LRs2wGGaZygp3u_IaUW-aQ":{"text":"We visited New Orleans for a day and asked for a good breakfast location near the French Q","useful":0,"cool":0},"FbJG2zOUHo_CKND8hG7HWw":{"text":"If only Yelp would let me, I'd give Li'l Dizzy's a 6th star because...\n\nWe were HANGRY by ","useful":9,"cool":2},"Ev1npMMm_2XuaYbCCy7_lg":{"text":"Had great service in a locals favorite spot. We recommend the fried chicken for breakfast ","useful":0,"cool":0},"M9aaK0y4xhTqcq7f-vIlAg":{"text":"Great experience...but do yourself a favor and get there early. The food reminds me of goo","useful":0,"cool":0},"LE5CZASMHkyxqepBH_6S9A":{"text":"We really enjoyed the buffet at Li'l Dizzy's!  It offers the best of New Orleans fare in a","useful":0,"cool":0},"x-Wg45ZZEe5P8ruqLvPTaA":{"text":"Mediocre. Not worth the walk from French Quarter and the wait. The service was sub-par. Th","useful":1,"cool":0},"QA_Jdii1EYr3poGVHL0jew":{"text":"This was a glorious lil gem! If you want local cuisine and hospitality, this is your place","useful":0,"cool":0},"WUO7xw96yrUxKvABubz6eA":{"text":"Li'l Dizzy's is a near perfect neighborhood joint that really gives you the feel of the Tr","useful":1,"cool":0},"stC7F4UoVPSRG_GMSXfbEg":{"text":"GREAT FRIED CHICKEN, period!  Delicious and juicy and all you can eat to boot for the lunc","useful":0,"cool":0},"Hf1Wt4DU2uGxyOu-G2V6_w":{"text":"Great for breakfast or lunch. Fried chicken and gumbo highly recommended here. Lunch buffe","useful":0,"cool":0},"HmFwU_6K6kvmcZH3XizQWg":{"text":"Loved this little breakfast spot. The waitress was a a sweetheart and very accommodating. ","useful":0,"cool":0},"lxwijFAZ4rt8ds9AP0aVtw":{"text":"One of the best places that I have EVER ate! The staff made me feel like they've known me ","useful":0,"cool":0},"_i3NP5dAzlvHivmz8mJteA":{"text":"Today we went to Lil Dizzy's ... the place was running over with ppl... the food was good ","useful":1,"cool":0},"6oJo4BXXr8ASaaKxtedZzA":{"text":"My friends and I were visiting from Houston Texas. I would move to New Orleans as long as ","useful":1,"cool":1},"PdyYTZA9UJN5PONREkSiNQ":{"text":"Li'l Dizzy is very much worth the slight detour if you're walking between the Treme and Ma","useful":0,"cool":0},"Ria5fT07wWRnqocjT2QtLA":{"text":"I have heard a lot of good things about this spot and was excited to try. Unfortunately I ","useful":1,"cool":0},"qVNB2TtPrUsPPOfpTnGOPg":{"text":"Great fried and stewed chicken on the buffet.  Busy little place and service with a mostly","useful":0,"cool":0},"hYWJJl8bknFp6H2ajQGYIw":{"text":"Little family diner. Low key, informal, easy going. The gumbo is as good as it gets, chock","useful":0,"cool":0},"oHfABcjbor4IwsTg1eFXUA":{"text":"One of the best place's I've been for a meal in NOLA. A real community vibe, with cops, fa","useful":0,"cool":0},"xfVxMA0N8zd1BkoYQp4cNw":{"text":"Bread pudding is amazing. Great way to be introduced to New Orleans. Staff is fun, and the","useful":0,"cool":1},"CdHle1vvZAR3P4yoMVo5Jw":{"text":"Good food...\n\nReally handled the Essence Crowd well...\n\nHad the fried seafood and really f","useful":1,"cool":1},"WRi6s5zi6qOj5U3-1pd8Mw":{"text":"I can honestly and confidently say that this food is hands down one of my top 5 places to ","useful":2,"cool":1},"l1AfPCxhR0q-orRVBMFNMQ":{"text":"Great family restaurant with amazing food! I had the shrimp grillade (without the brown gr","useful":0,"cool":0},"uQp8pWHj-FWQAuyo_mCZzg":{"text":"Perfect place to come and try a little of everything. It's a lunch buffet until 2pm and it","useful":1,"cool":0},"mkt0xQIZ5U82SoNCvYtB2w":{"text":"This cozy restaurant, atmosphere is great, especially with great company. Workers seem lik","useful":2,"cool":1},"JsgiEhnYVN1SYczSpwrcrg":{"text":"The food is delicious, my favorite is the gumbo, fried chicken, fried fish, potato salad, ","useful":0,"cool":0},"CqPJ3DAsmM5pHK6b-FyPnA":{"text":"Li'l Dizzy's Cafe es un lugar distinto para comer en New Orleans. Ubicado en el barrio Tre","useful":1,"cool":1},"VO1sR1kuSeQ82msByFkPrA":{"text":"Great Gumbo !!!! If i ever come back to NOLA, I will definitely come back here. Hospitalit","useful":0,"cool":0},"eJCmGo28oPhxNxS-MLGSow":{"text":"Damn!\nThis lil place is excellent. \nWe were getting a Lyft to another very well known brea","useful":0,"cool":0},"HDaWpdmW1eoQGhZfWcDd-A":{"text":"This is the southern food you dream about.  Family style food that blew us away.  Group of","useful":0,"cool":0},"ZoQMDgG9Zq7X7Ep2MJMV0Q":{"text":"We had a friend recommend we come here for the \"best fried chicken ever\", so we had to che","useful":0,"cool":0},"gLLqSR1TPoXrW8c9a8j6lA":{"text":"Ughhhhhhh the fried chicken and greens!!!! Love love love this place amazing customer serv","useful":0,"cool":0},"Hqzl4XKXmyxvSOJdYvK7YA":{"text":"Just wanted to say thanks for the great food and hospitality. Beth thank you for youe grea","useful":0,"cool":1},"PV_lz9gzSH4u4p1q6jZKMA":{"text":"DISCLAIMER:  I've never actually been to Li'l Dizzy's....\n\nBut I just had their vegan gumb","useful":1,"cool":0},"Vxdi_08PRCGV3f2Au0Zb9Q":{"text":"The juiciest fried chicken I've ever had in my entire life!!!!!!!!! That is it and that is","useful":1,"cool":0},"S9N26w8Uf98WnhAZkTk-5Q":{"text":"Very disappointed, in town for business. It's 2:30 was met at the door by a short red hair","useful":1,"cool":0},"TuC_2E7neWE_Mi15kRhSNQ":{"text":"Fantastic food served by even better people. We stopped in for the buffet on Sunday and th","useful":1,"cool":0},"yaI8ItPBLkNZy26lYUC4Lw":{"text":"The absolute best! The buffet is such a deal for extremely tasteful food! I also recommend","useful":0,"cool":0},"khhEGczqO__2_4bgdgkOoQ":{"text":"Every time I visit New Orleans I MUST stop here! This time I've noticed they added upstair","useful":0,"cool":0},"kCQevnN-wrOdCDfqDzA_5g":{"text":"Great restaurant!! Small mom and pop but the food was good and the sweet tea was the bomb!","useful":0,"cool":0},"SqPjDQA9wPMWpmOxvIxGBA":{"text":"Fried Chicken and Bread pudding were simply outstanding. Trust us on this- AND all for a r","useful":0,"cool":0},"SxK4uCWAlF3Pz4Lb4hK7Lw":{"text":"Everything was good!!! Small space but great atmosphere. The fried chicken, bread pudding,","useful":0,"cool":1},"VugXN3Pk2jLW27cSTonZRg":{"text":"Visited this place for breakfast. The first thing we noticed was how friendly the staff wa","useful":0,"cool":0},"4OdftuRZSGnshwKVj8ZMkg":{"text":"Hands down the best food I had in New Orleans, and I went to a lot of places. The biscuits","useful":0,"cool":0},"_XRFOKdjAFIExpuPQ6zhZw":{"text":"Li'l Dizzy's Cafe has very good food, good prices, and friendly service.\n\nThis is clearly ","useful":0,"cool":0},"CAg1Hd6E5SCdApMNr84QmA":{"text":"I love this place !! Every time I'm in New Orleans I must stop by..the French toast is the","useful":1,"cool":0},"xFRdOTpPVal8OuEvCi78zg":{"text":"had the lunch buffet, wished I'd ordered from the menu.  If you like the gumbo, yo mama ca","useful":0,"cool":0},"B3JaBpziE8wbZvOqXoiyiQ":{"text":"Very friendly place. Went for a weekday lunch  buffet. Amazing chicken juicy and crisp and","useful":0,"cool":0},"Fx7q7OrdJS4Bka0warchKw":{"text":"Waited too long to go to Lil Dizzy's on our trip to New Orleans. Just went this morning fo","useful":0,"cool":0},"iIMm2_3PJCw6Y_NcXBYJRA":{"text":"Locally owned and operated for decades this is a popular brunch spot. I really wanted to l","useful":2,"cool":0},"HajANe3zhUmo0thMRTedRw":{"text":"If you come to Dizzy's, GET THE LUNCH BUFFET!! You will not be disappointed. Not only will","useful":3,"cool":1},"AIUNcb8_wVBRegJstzwnUw":{"text":"\"Sit where ya want baby\" is how I was greeted upon arriving for breakfast on Monday mornin","useful":9,"cool":2},"0GaSnS_-mxXB0cbK5UCouw":{"text":"We ended up going here after deciding the line at Willie Mae's was too long. We showed up ","useful":1,"cool":0},"lSxxkbl5hGDTkkFL2ZmFpA":{"text":"We got the gumbo, catfish po boy, and fried chicken. The po boy and the friend chicken wer","useful":0,"cool":0},"snVM5HTlgI9_RQNm_f9alQ":{"text":"We were greeted sooo warmly when we came in! We went for brealfast and the food is fresh a","useful":0,"cool":0},"txw5eu4lUavEJi-PQFrrnA":{"text":"We went for breakfast. Very good service. The breakfast fare is about average. Historic bu","useful":0,"cool":0},"JtNCYfV-zkIiqbLk5QJohQ":{"text":"I was here visiting for my 21st birthday and I can say this was the best restaurant i went","useful":1,"cool":1},"HpTkM2rD-_KbQ_2ArlJHtw":{"text":"The best breakfast and the service was phenomenal.  Came to NOLA to eat our way through.  ","useful":0,"cool":0},"m4au6Q2K-d556s3JIuYvlA":{"text":"Great!!! We went for Sunday Brunch...debated getting the buffet because it was $17.99 but ","useful":0,"cool":0},"j7tctGiirem7Z-7WaBJLvA":{"text":"Heard lot of people recommend this place for breakfast. This was a a small shop and walkin","useful":1,"cool":0},"7VQTvjwm90b_xNbNnxyNtw":{"text":"Went here one morning for breakfast. Quickly seated. While looking over the menu the waitr","useful":0,"cool":0},"yGmWjny2l3ik146W2w-EKQ":{"text":"We had come to Treme to visit the African American history museum and were disappointed to","useful":0,"cool":0},"DdzOTnFg-ATuBuYWAPykpA":{"text":"My family and I went on a girls trip and on our last day for breakfast we came to Lil Driz","useful":0,"cool":0},"94iiVz-2_FMN8x0rv7QZQw":{"text":"The chicken is like POW!! \nWe stopped in after church to see Lil Dizzy. The buffet is $17 ","useful":4,"cool":1},"lFZZXo8a0sn6ZpnyEInAjA":{"text":"Possibly my favorite lunch spot in Nola. Walkable from the quarter or just under Canal Str","useful":1,"cool":0},"E7tCtwk-T7TvesgecGLRmw":{"text":"I had been trying to eat here since I got to NOLA but the hours are limited. Finally made ","useful":0,"cool":0},"AzcBL1odImGDTy55FPBYhA":{"text":"Hungry and just happened to drive by, so we picked this place, and I'm so glad we did! The","useful":0,"cool":0},"TPWncUsDfAREKPgz_pguHw":{"text":"I was invited to someone's house for brunch.  The host made all this great food.  I got th","useful":5,"cool":6},"7SeRKbScmtD5jgf95IEDZQ":{"text":"The staff was friendly but my issue is if I order a catfish platter , I've had several in ","useful":0,"cool":0},"WS61k9B2fVI7-NvO9fxzTg":{"text":"This is the best soul food restaurant Ive been too. The food comes closest to what I grew ","useful":0,"cool":0},"7UwGsRUmXB6HAOdFm3I8lg":{"text":"Family owned and ran; it's a long standing New Orleans staple!! \nNo wait for a table today","useful":2,"cool":2},"pc4UR3Wpvn8UGiXIMkcRcw":{"text":"I love this place ! The owner is great\nAnd appreciated our patronage . \nWe ordered from th","useful":0,"cool":0},"c_571dlKLA3I7WC71yBrzw":{"text":"This place was an experience all on its own. Miss Lucy took care of us as if we were in he","useful":1,"cool":1},"W8Q9ZEaTt6TS9xf2uEAKbw":{"text":"Shout out to Ms. Lucy...shes so New Orleans. i.e. \"hey my baby\". The buffet was delicious.","useful":0,"cool":0},"mDwvQsyCeJ3SitlZ3AaZzQ":{"text":"You gotta have Sunday brunch here. Everything is wonderful, especially the banana pudding.","useful":0,"cool":0},"HnG487cCHXIRp_8nYj6FXQ":{"text":"Buffet is amazing! Tight quarters but the food makes it all worth it! Chicken fried to per","useful":0,"cool":0},"wgCkfwadCkkubE4f480_NQ":{"text":"Classic, fattening, greasy, southern cooking. Our waitress even greeted us \"Hey babies.\" (","useful":3,"cool":1},"JMlbL-EzVC5sKrjyAzy_wQ":{"text":"All that I can say is the food was beyond terrible.  Mac and cheese was old and had curdle","useful":0,"cool":0},"TbdfLo7WQijAyOBkMYXVBg":{"text":"I arrived very early for our last breakfast together in NOLA. The staff allowed me to wait","useful":0,"cool":1},"RuEEqENMeTtTeGz_53LLYA":{"text":"Hands down the reason why I would go back to NOLA!!!! Good southern food and hospitality. ","useful":0,"cool":0},"M8SNNaadWe3mr5p6tRM8GA":{"text":"Best gumbo from a restaurant in New Orleans.  Lunch buffet was awesome.  Nothing in the fr","useful":1,"cool":1},"6-ZoM8dsK_7EmpvDy92ayQ":{"text":"Man oh Man.  I do not eat at hole in the walls, but the smell coming from down the street ","useful":0,"cool":0},"7L0fphVRT7E7r2XtlfHvbA":{"text":"Buffet for $16. Includes unlimited sweet or unsweetened tea. Very nice servers with  a ver","useful":1,"cool":0},"nLZy0j7XV4jCFEqguz5JVw":{"text":"Amazing fried chicken, catfish, etouffee and bread pudding on the brunch buffet. Just grea","useful":0,"cool":0},"UH-lDtrc5r600ty8H9o0hA":{"text":"We stopped in for a late breakfast after a recommendation from a local. Wow. Best French r","useful":0,"cool":1},"8cWDISGONeFbcL2d64K5xA":{"text":"This place is simply WONDERFUL the Gumbo is DANGEROUSLY outstanding, down to earth make yo","useful":0,"cool":0},"uWsqmK5ShLzrn4DwWH8okQ":{"text":"This was the first place we ate on our trip and it was wonderful, everything was delicious","useful":0,"cool":0},"rSD6sPsFipseRGcxQn81eQ":{"text":"I was in NOLA for three days and ate here twice! Lil Dizzy's does not have an extensive me","useful":1,"cool":0},"eROkYI_rY5EaKVm9pvbHZg":{"text":"The service was absolutely horrible. Me and my friends weren't acknowledge when we came in","useful":1,"cool":1},"J0e010lT8NwYKsoGfh5vWA":{"text":"It is a Soul Food restaurant. Limited  selection. Good food,exceptional service. Definitel","useful":0,"cool":0},"kSqWlIKU9SOEplBUpTOwaQ":{"text":"The gumbo was great (lots of crab)! Real down home cooking. They gave us a warm greeting u","useful":0,"cool":0},"Y2MxWL-jGDOOB24l9Rn2Xw":{"text":"No idea how this has good reviews. Very generic food on the buffet. I tried to find someth","useful":0,"cool":0},"p2W97xfG0lAGXgiM0TWsnQ":{"text":"First time here and the food is amazing   ! Definitely coming back next time im in NOLA","useful":0,"cool":0},"FqPeIzEMwtiX4q4jsyGN3g":{"text":"We stopped into Li'l Dizzy's Cafe on our bike ride with Robert, from Confederacy of Cruise","useful":1,"cool":1},"ZuRGSWVnoYW9qT1h71WrPQ":{"text":"Had to visit this staple of New Orleans and the experience was wonderful.  The place is sm","useful":0,"cool":1},"INAo13o50AI2LZmBakOXMg":{"text":"Just excellent . The food is tasty and the service is friendly . The gumbo was my favorite","useful":0,"cool":0},"AsHXpXKBfbUuwiaaaqFqeQ":{"text":"I was in NOLA for three days and ate here twice! Lil Dizzy's does not have an extensive me","useful":0,"cool":0},"i0MqEvOrDFowyKsKFbOa8Q":{"text":"Wow!!! Amazing chicken!! So light, CRISPY, & juicy!!! Don't get there too late bc they run","useful":1,"cool":2},"UX8NjTQ95DkhhUwW5HzYMg":{"text":"Lil Dizzy's was so good, we came here twice. This should be on the definition of southern ","useful":3,"cool":1},"MkVQcsym2Y3HEgHzwZCgQA":{"text":"There was a lot of hype surrounding this restaurant and my fiance was adamant in trying th","useful":2,"cool":0},"Llr5Sn-V-ntKKX5e0GgWLQ":{"text":"Short story: You leave with your belly and soul full! \n\nAn institution that is back open a","useful":2,"cool":3},"9xwZhgXzjNcxE965Xy-peQ":{"text":"Delicious food and super friendly people made our lunch experience here wonderful. My husb","useful":12,"cool":10},"oXauURK4Y2waz9kPuH76hw":{"text":"If I die today, I want my last meal to be Fried Chicken and Gumbo. That is all. \n\nGet the ","useful":1,"cool":0},"c6tRFc_zXUhRZVbGklN8Lw":{"text":"I came here with my family on the recommendation of a friend on the last day of my New Orl","useful":3,"cool":1},"681WY4fSad9U2gFN9HxEoQ":{"text":"I absolutely love going to small \"hole in the wall\" spots in New Orleans!!!! This place di","useful":4,"cool":1},"cnLuyXZpRlqZnUpcwjnpFg":{"text":"So...ummm...yeah...that fried chicken. Good God!!! Sweet Jesus!!!\n\nThe waitress, sorry I f","useful":0,"cool":1},"EyUZU8rSWhaUxM01Tvg4CQ":{"text":"We did a Treme tour on a Saturday morning and this was one of the places that our guide re","useful":3,"cool":3},"OXmS8cHsgXMimYTkwJHkAg":{"text":"Voted the best place in NOLA for fried chicken and gumbo, and I couldn't agree more. \n\nDef","useful":3,"cool":0},"DZ9_gKDI6CPM5rGZB1BYvA":{"text":"Initially upon arrival we were advised no more people will be put on the list to eat and t","useful":0,"cool":0},"fu0puIIsJPawI59M-uzz2A":{"text":"Finally made it. I've made a few attempts to eat here, but always gave up because of the w","useful":1,"cool":1},"RTt4tedvxQ4rQkzVRr4vHw":{"text":"Started our trip right when my friends and I popped into Lil Dizzy's. The staff was super ","useful":0,"cool":0},"dXoRxfoGuc6RAprBYhLTDw":{"text":"Read good reviews on yelp and decided to give Lil Dizzy's a try. The southern hospitality ","useful":1,"cool":1},"_y9fl9jvxiNLRDEIviGB2w":{"text":"I'm here now and they are closed. No sign on the door or anything.  What a waste of gas. O","useful":3,"cool":1},"qlVmcuMBdto4tce_Grq30w":{"text":"Fried chicken heaven! Our tour guide from Lucky Bean recommended this place. She said thei","useful":1,"cool":0},"JYNhahuq1sgU6Th6_5C8GQ":{"text":"You talk about family style!!! Best soul food I've had in all in New Orleans service was i","useful":0,"cool":0},"0_vDRRINUMlB_KcNCcXFsw":{"text":"I had lunch here last Saturday! I had po-boys and fries with a friend who was in town.\n\nI ","useful":1,"cool":0},"7bW-z7IGy0U2UlnU0_pLrg":{"text":"A friend that knows Cajun food recommended Li'l Dizzy's.  It's a cozy place with maybe spo","useful":0,"cool":0},"TXkTfml6iO1tfJI264Wk7w":{"text":"Li'l Dizzy's Cafe is by far the best meal I've eaten in New Orleans. I used to live in New","useful":1,"cool":0},"TpTtIJtG3QANztmyDteHwQ":{"text":"My favorite buffet style/banquet style place in New Orleans.  This is one of my big 5 Auth","useful":0,"cool":0},"mir1EgT8wsiqozupu19KWA":{"text":"Amazing food with amazing staff!! \nThe gumbo was amazing - the broth was rich and complex,","useful":0,"cool":0},"aa0HbulJWPavxT7UFfZHSQ":{"text":"Policemen drive around their cities all day, so it's usually a good sign to find a lunch s","useful":1,"cool":1},"bFg3IArSNuMRDb6wK1bxVg":{"text":"Amazing food!! The biscuits are home made, OMG they are the best I have ever had. It is no","useful":1,"cool":0},"kqrkGwle833X2mqYJw0Eqg":{"text":"Very authentic and great atmosphere! The food and service were outstanding. Best biscuits ","useful":0,"cool":0},"38JqdQb4nvhuuTdi3vMf8A":{"text":"omg everything here is delicious and amazing!!! the service was as amazing as the foodd!!!","useful":0,"cool":0},"70Q2OOwQID4ecNipRIOa_Q":{"text":"What. A. Trip. \n\nThe buffet is unbeatable- crazy good fried chicken (or literally whatever","useful":4,"cool":3},"U39kpX6rfXaTEVPKCh55Yg":{"text":"The food here is very good . everything i had was good the service in the evening is much ","useful":1,"cool":0},"h9CzKpi3aWMlkVQWmv3ytw":{"text":"You know when there's a movie you really want to see and everyone else has seen it and the","useful":1,"cool":1},"3ie8xL-l8ESjMm8n5oXNeg":{"text":"In a local neighborhood, family owned and ran. It's definitely a hole in the wall type of ","useful":0,"cool":0},"uKEAycU6KgPMtFHvv7Ry-g":{"text":"Quaint spot with good food and friendly people. We had the buffet and the food was tasty, ","useful":0,"cool":0},"DCVGC96N4382UC8ZnWU9wg":{"text":"Love this little local spot. Out of this world fried chicken and very unique gumbo. Small ","useful":0,"cool":0},"1tsOm7CVSkDYmlBoo873Sg":{"text":"This lovely, quaint, historical restaurant is home to the best fried chicken I have ever h","useful":0,"cool":0},"8f89WlzXInohaxcujVFXpg":{"text":"I originally found out about this place from a YouTube suggested video. After I watched it","useful":3,"cool":0},"Rg_PMACTYfUpaZS-tv6-1Q":{"text":"Absolutely horrible.  Went here on a Monday for the lunch buffet.  It looked like a train ","useful":5,"cool":0},"JdQS4Q1CVPDiqerryfG6wQ":{"text":"Best fried chicken I have ever eaten. \n\nPlace is a bit run down but the energy of the serv","useful":3,"cool":2},"V4aL_pobq9Ps1FnGzzSp9w":{"text":"Li'l Dizzy's is consistent in flavorful food. I have stopped through at least once every t","useful":0,"cool":0},"8hg5ocgiKxpGv7srTX7Iug":{"text":"I enjoyed the catfish platter with red beans and rice, fries, salad, and added a small cup","useful":0,"cool":0},"hO6GTkAKYaxhUoM1bwvICg":{"text":"I traveled with some high school friends and I was put in charge of locating a brunch spot","useful":3,"cool":1},"33kIpjmllGTFWQ03ia7jmw":{"text":"Fried Chicken and Jambalaya!\n\nWhat a fantastic find for an Orange County boy to find in th","useful":9,"cool":7},"CJP7wEbhsBUKmykGn8siiw":{"text":"Li'l Dizzy's is bomb! This was my 2nd time going and both times I got the soul food buffet","useful":2,"cool":1},"5BFrrH6-RGUcpfr-ucjfpA":{"text":"Home Cookin' - Southern Soul Style... you can tell this food is cooked with love. The juic","useful":1,"cool":0},"VU7utbYHYRmhLztfbRWfgw":{"text":"So this place sad recommended as one of the places to check out when in NOLA. They close d","useful":1,"cool":0},"TNhFRO4SOsnL4Dg7nZjTFA":{"text":"Just leaving lil dizzys and by far must say that was the worst experience ever!!!!! From a","useful":1,"cool":0},"s1G4WQSvsVyVGJ3__5NmHA":{"text":"Where Do I start? The service is phenomenal from the moment you walk it. The food, well la","useful":1,"cool":0},"W2LhHXQc30KlNiYPR0iF8w":{"text":"The food and service were great and prices were fair. I had the fried chicken, which was e","useful":1,"cool":1},"g7K-ZTBQc2IQexWB51cLlA":{"text":"I love eating my way through New Orleans anytime I come down here.  This is one of the pla","useful":1,"cool":0},"8bB8uEqlCFYFkL2E6MiPDQ":{"text":"The buffet here comes with absolutely incredible french toast, the best biscuits in the so","useful":1,"cool":1},"9tK7QTZYIHM08e55Rv60Aw":{"text":"We thoroughly enjoyed our meal at Lil Dizzy's. We ordered the Catfish and Shrimp plate wit","useful":0,"cool":0},"qf-hgu-_6aBI5xb-VJkR0Q":{"text":"If there was only ONE restaurant in New Orleans you could go to.... this would be it!\nA mi","useful":5,"cool":2},"MSsAXlsbEUuUTxdJSXO_7Q":{"text":"We got a recommendation to go here from a local on a tour we did and it was worth the trip","useful":0,"cool":0},"d6p6RJD6Mhq1UQ9xa0WWbQ":{"text":"We were only in New Orleans for five days, and we came specifically to eat some local cuis","useful":0,"cool":0},"MB54I5KJSqDY5HJXiYI_tw":{"text":"HOLY GOODNESS. I didn't expect the fried chicken to be THIS good. It's crispy on the outsi","useful":1,"cool":1},"CM6tvP__qa6qeGCqwqiitQ":{"text":"Amazing food! Fried chicken and Mac and cheese was my fave!!! Cornbread taste like cake. L","useful":0,"cool":0},"JuIhkMG5NtUtVvCkh5nQEw":{"text":"I had really high hopes for this Li'l Dizzy's. They let me down though on the service side","useful":2,"cool":0},"svglYyHlikEPwjlGBlJnPg":{"text":"It was good but not great. French toast was exceptional. Red beans n rice were decent but ","useful":0,"cool":0},"XaFbSc9LZiUHv5P76E1JZw":{"text":"Down home NOLA restaurant with local flavor you can't deny. The place is small with lots o","useful":26,"cool":22},"QuBV0ox0djEhuO2AkRcLCw":{"text":"Best fried chicken I've ever had. We easily got a seat on a Sunday morning at 9:30am and f","useful":0,"cool":0},"7dMec_blPLTv71OBX1Z6xA":{"text":"I remember the first week I moved to New Orleans having asked a lady at church where could","useful":0,"cool":0},"YlwE7HNwCPG5xnH87N0G2Q":{"text":"This was a great spot for our trip to New Orleans. Small place but everyone that works the","useful":0,"cool":0},"T98g_rsPJwWJdl_m9I5v-w":{"text":"So glad my food tour of NOLA worked out to include Li'l Dizzy's! On our last day in town I","useful":1,"cool":1},"czjPl8-KO0tQoBeR1Xo8lQ":{"text":"OMG...I love y'all baby! Just phenomenal...the staff becomes family the moment you walk in","useful":0,"cool":0},"7mmaG06Zj6AP7Fhub5BiRQ":{"text":"The best food ever. Felt like family and I would eat here 100 times!! Everything was delic","useful":0,"cool":0},"H9rp7KGUVhIUuTaT-Xnrpw":{"text":"The staff was pleasant and the food was good not enough for the price. The gumbo was not g","useful":0,"cool":0},"bW3Q1DMDDv8qLxpCC3aCmQ":{"text":"Li'l Dizzy's will put you in a tizzy. Hands down way to go for an eclectic breakfast. Just","useful":0,"cool":0},"61v4vbfGz48tmAizGpNpGg":{"text":"Went here while I was on vacation. The fried chicken and Mac N cheese is great! And was t ","useful":0,"cool":0},"WVhFo8cm6HWTz8Kwwmmy1w":{"text":"This was truly a gem in the rough. Don't let the area fool you. The Father's Day brunch wa","useful":0,"cool":1},"LB0KCt35bMTP5BzODY0KXg":{"text":"I've closed out my last two trips to New Orleans with a visit to Li'l Dizzys for Sunday br","useful":1,"cool":0},"eXr-lqaR5MRvNefPA3MmxQ":{"text":"I love everything about Dizzy's -- the classic dishes, the warm service, the location on E","useful":2,"cool":0},"YbHIWRw7uPLBPnyErge7Yg":{"text":"I mean if you don't come to Li'l Dizzy's when your home in NOLA, have you really had a goo","useful":1,"cool":1},"xsLxKzVBd0XGompPraKmMA":{"text":"This place is right around the corner from us and will definitely become one of our regula","useful":1,"cool":1},"_PHIALm2RvZv42vnalDB0w":{"text":"Best gumbo and red beans and rice I've ever tasted. The flavor and consistency were perfec","useful":0,"cool":0},"NqlLt8pTkOdoQkdPIULRaw":{"text":"I grew up in Houston, Atlanta, and Los Angeles -- all cities with their own amazing share ","useful":2,"cool":1},"6LBdwIYqLDMqRtSbecgH_w":{"text":"This is one of those spots that you've got to visit when you are in NOLA.  The Baquet fami","useful":2,"cool":1},"JlBsg1AMJl2RwWefNlxBvA":{"text":"Seafood gumbo was AMAZING!!!! The best gumbo i've ever had and it's made in this tiny litt","useful":1,"cool":1},"DrIBUo38RqV3fB3LzJj7WA":{"text":"Can't say enough about this place. Neighborhood seafood/soul food family restaurant. A MUS","useful":3,"cool":3},"JxcxgSe36cpz5ylcfwFWoA":{"text":"this is some old skool stuff right here.    everyone really friendly, and they have buffet","useful":0,"cool":0},"r5oBKDnINtI833w8UyM52A":{"text":"Great place for breakfast and bread pudding!  Nice staff.  Best biscuits I have ever had. ","useful":0,"cool":0},"0uj4peFoUs54jMIgzE1PhA":{"text":"Seriously the best fried chicken you will get in the city. The lunch buffet is an amazing ","useful":0,"cool":0},"QJ5IvNiPg91nDtxjrBDwRQ":{"text":"First of all the food.... good but what was even better was the owner and all the employee","useful":0,"cool":0},"0uuuwFu5vgtGtvSXsO8-XQ":{"text":"Was on a road trip to Florida and stopped by this place for lunch along the way. We had to","useful":3,"cool":1},"oiJEsqpHglztUGbGCqsLEQ":{"text":"Lil Dizzy exceed my expectation with their excelllent service and southern hospitality of ","useful":0,"cool":0},"eid6wuuEd7Csgayj-8cv7w":{"text":"Found this little gem after calling several restaurants that were closed on Easter! So gla","useful":1,"cool":1},"6Bpg2MD6rXR7nhgp_rMDWQ":{"text":"Leave diet concerns at the door and you'll have a dizzy of a time here. Came in for Sunday","useful":4,"cool":2},"TVyzA_cWs29vXuxHYfQBpg":{"text":"We stopped here while taking our kids on a college tour of Xavier University. The hospital","useful":1,"cool":0},"itvcI3DxzD-spoHEItCt4g":{"text":"We had plans to hit up Willie Mae's but unfortunately they were closed. We opted as a seco","useful":2,"cool":0},"jUJoy7iHSOq2UqbttUFBoA":{"text":"I feel REALLY qualified to talk about Dizzy's, because I grew up only blocks from the plac","useful":6,"cool":4},"weACJDk2QPgEXawn78Hpdg":{"text":"Honestly wasn't a fan of the food. Ordered the shrimp and grits based on the recommendatio","useful":1,"cool":1},"BcpVXFztgfOG53Ax4FihYg":{"text":"Li'l Dizzy's Cafe was the first place we ate at when we got off the plane and it did not d","useful":1,"cool":0},"7XEmeQro7ZuX-CZH6_4Vdw":{"text":"When we travel the best thing we can do is get away from any tourist area and integrate ou","useful":6,"cool":4},"M9qphKIBjwplogCdF7WD7A":{"text":"5 stars for the biscuits alone.  This is def a popular spot for locals in Nola.  No clue w","useful":1,"cool":0},"EwZs0T4tKfxn8X-na3RbSQ":{"text":"Went to Lil Dizzy's to meet an old\nfriend since we were in town. The service was outstandi","useful":0,"cool":0},"8mFmCq41HTo5pdcGI4ri_g":{"text":"We were here for a week and went twice...if that tells you anything. Where do I start. Som","useful":1,"cool":0},"EQANerw2Q0vLpmOQWsgMKw":{"text":"Went here on multiple recommendations. We had a large party and called ahead to let them k","useful":2,"cool":0},"YDN8LvWTlpNd2rIjx5Q7xA":{"text":"Yumm.  I was turned on to this place by my Sister.. So glad I went. I was greeted by the l","useful":1,"cool":2},"1ktignogCD6Q80gLA14fQQ":{"text":"Warm hearted service, simplicity and flavors as sublime as anything I've had anywhere.  Th","useful":0,"cool":0},"PY2oW64SR54OcvfTT4QI-w":{"text":"My oh my! Why haven't I written a review before!? \n\nThis is the type of place where locals","useful":3,"cool":1},"exCZzEhLT7-kXnz3-wC7Yw":{"text":"I am glad we passed on breakfast spots in the French Quarter and decided to try out this p","useful":2,"cool":2},"nafYR67JJXcSyKmhcbJGvg":{"text":"Lil Dizzys\n\n It warms my heart to support Black owned businesses. It makes me feel even be","useful":3,"cool":3},"vgF9S_EK361HCDKieIBxiQ":{"text":"One word: Deliciousness!\n\nHad the pleasure of visiting this local restaurant since they ha","useful":8,"cool":9},"BzoC95u6blzOKVBdAQ9xZg":{"text":"Louisiana fried chicken is some of the best in the country.  Why Popeyes started in Arabi,","useful":40,"cool":38},"RjobC9qbNptvJi0n3SDZrw":{"text":"I cannot express how glad I am Li'l Dizzy is back open and rocking again! We live just a f","useful":0,"cool":0},"LKsVvp5-n000lgVRSjgFyQ":{"text":"I have had Lil Dizzy's Cafe on my bucket list for about 2 years, finally I made it with a ","useful":1,"cool":1},"0_qyJKnRV0eWKXaF59um2Q":{"text":"I am so glad that they are back open. The food is not served buffet style any longer. Ther","useful":0,"cool":0},"fjLMiuQY-9P4E9QZbimOfQ":{"text":"Best food ever !\nI'm really recommend this place !  \nReally fresh, tasty and affordable","useful":0,"cool":0},"RQ3BGrUsEAxgHqxkCg3QwA":{"text":"If you can't decide between chicken and sausage gumbo or seafood gumbo, then Li'l Dizzy's ","useful":2,"cool":0},"Ox8YvX7thQy4EAZ-b8k7OQ":{"text":"The food was good, Everybody was so friendly, the chicken was fresh and golden and it smel","useful":1,"cool":0},"AFXpmU7LEZe0zocwsvxoew":{"text":"I am so glad that this place is back open. They have the fried chicken everyday and they h","useful":0,"cool":0},"6WN1XHmn5qB_Cr-1WE0LMA":{"text":"Foodie here!  Here's another place to eat at in NO. It is small and homey. You can smell t","useful":0,"cool":0},"v7ykmvwNq94mx-ryHFnUCg":{"text":"I've been to this restaurant several times and the service is always the one thing that ma","useful":0,"cool":0},"3DESbGbfr2iDoxPKjlqEuQ":{"text":"lil Dizzys is like that perfect comfort food spot that transports you right back to when y","useful":1,"cool":0},"x4GS1qFNr_QNIY-H4G745w":{"text":"I love Lil Dizzy's!!! The customer service is top notch! The owner (wife) and the chef, Jo","useful":0,"cool":0},"AVHEqrdUNCf0FehbBfUuxA":{"text":"I wanted to like this place, I really did. I was recommended to come here by multiple peop","useful":3,"cool":0},"jtp1ZJSMxOd-oW5D7Q1lJA":{"text":"I had really high expectations of this place because a fellow elite told me how great the ","useful":6,"cool":1},"ir2v1eLspohNkPIDdBYI1A":{"text":"Best place for chicken. This place has one of the best \"dirty rice\" I have tasted. The cat","useful":0,"cool":0},"5Dot23cj-4K2C0vcEuHd1g":{"text":"The restaurant was clean and the staff was friendly. The restaurant is adhering to covid-1","useful":1,"cool":0},"mpCHv4IkFZHgCMcnCRoEyg":{"text":"Celebrated a birthday here for a Sunday Brunch. We had the best time. Staff is super frien","useful":0,"cool":0},"ObQYv0529-qZMoacZhfViw":{"text":"This place had impeccable customer service. We had 6 in our party and everyone had pipping","useful":0,"cool":0},"9LDy4kIBRNMhzoycUXS1Jg":{"text":"Every other review that whines about the wait or service is totally missing out on everyth","useful":1,"cool":0},"bxw84wyV1kcu_fK5yaNPKw":{"text":"Probably THE BEST fried chicken in Nola, period. Perfectly fried. \n\nBesides that... greens","useful":2,"cool":1},"hWfraYYwwc3TunExUz4Geg":{"text":"This was my first time here and I absolutely enjoyed it! I ordered the shrimp grillade. It","useful":0,"cool":0},"fGjAHvrj60_RmTEfniskqQ":{"text":"Love coming here  it's always a pleasure.  Fried chicken  always great here. Only tip is g","useful":1,"cool":0},"49HSQuu4kjfEFZPRjZrGhw":{"text":"Great food and even better service! Everyone is so friendly and helpful. The gumbo is deli","useful":0,"cool":0},"z2zQraVYj4EKB-WrKy0sCw":{"text":"Everything was amazing, but the fried chicken and the peach bread pudding are the stuff dr","useful":1,"cool":0},"TCGkd9Zbz4UUjMcZwWy-Aw":{"text":"Heard about this historic gem and I had to check it out while in town. On the weekend they","useful":0,"cool":1},"vtR_RDCaQ7TefGOcwRqnQg":{"text":"I go to this restaurant for lunch every time I am in town. They transformed themselves int","useful":0,"cool":0},"81XX9Sy9Kw9Gh32xKT4iqA":{"text":"Not very good.\nEmbarrassment bainmarie sides for the buffet tired overcooked. Got upsold t","useful":1,"cool":0},"oAC4FO2iW_jl-4ydCeL-sA":{"text":"This place, WOW!!! My boyfriend saw it on YouTube and insisted we went when we visited New","useful":3,"cool":2},"IHEmIHBShj3oh-U4I4OQlw":{"text":"Holy moly I saw this place on a YouTube video and decided to check it out. I freaking looo","useful":1,"cool":0},"lODx3fWVk52dLeKnKHw64Q":{"text":"Nothing to special. Service was okay, food was standard and I was never given my drink ord","useful":0,"cool":0},"02Qp0qlB6cNWgFNiRxJWcQ":{"text":"What. A. Trip. \n\nThe buffet is unbeatable- crazy good fried chicken (or literally whatever","useful":5,"cool":4},"vQg77Tvs8vUdVZ3K8pvFqQ":{"text":"This place is the real deal. Fried chicken is excellent and always hot! I love the greens.","useful":0,"cool":0},"Z0NrtpnRPIIQajty2FifqQ":{"text":"Gumbo .....the best!  Didn't lack anything.  Just delish!!! The eggs were fresh and tasty.","useful":0,"cool":0},"yjkTyw5Xyzd5ZpOoC3h7Qw":{"text":"Stopped here for lunch for their red beans & rice special on Mondays, with a side of 2 pie","useful":4,"cool":3},"8w5UtK5dff--XmK6fRxd0A":{"text":"Lil Dizzy's was on my foodie bucket list when I came to visit in 2020 during Mardi Gras bu","useful":0,"cool":0},"_zdczTzJHo0V6ZeCco4qHA":{"text":"Thank you family for the recommendation. Last meal before departing New Orleans. Lil Dizzy","useful":1,"cool":1},"LQ_iHtg-9lFl3nt4vowPag":{"text":"Food was good but the entire experience was just BAD... Waitress was EXTREMELY EXTREMELY R","useful":0,"cool":0},"LkapcPCbLhS_2bz6eG5JKg":{"text":"Well I finally made my way to Lil Dizzy\"s Cafe. It was so worth the wait.  I was greeted b","useful":0,"cool":0},"_kGGGfTjan9hL-5lYR1Euw":{"text":"What a treat this place is. Visiting from California and this has been my absolute favorit","useful":0,"cool":0},"iXNIAOzp_Y7U1-SfIQjd5Q":{"text":"This is the BEST breakfast and lunch restaurant in the area. I recently visited family and","useful":2,"cool":3},"4BUb7SVoSxf4hD2JoS1QOw":{"text":"Say... this spot here.. delicioso.  if you come to NO this is a stop u gotta try.. The por","useful":1,"cool":0},"10ljzG1EfX0VDBU7SlQcaw":{"text":"This spot was soooooo good, the chicken, candied yams, Mac&Cheese were absolutely deliciou","useful":0,"cool":0},"uhc9QYRk_ude-2ZOHwIZrw":{"text":"Oh my goodness. That fried chicken. Everything in the buffet was fresh, delicious and the ","useful":0,"cool":0},"dpNB4K2OfXBuNUfMXX2DAg":{"text":"Walking into Lil Dizzy's is like coming home for me. From the moment one of those sweet la","useful":5,"cool":2},"p5-HBQqdBEbhkYnlQ7TE7A":{"text":"They are BACK and definitely did not come here to play with y'all (Big Frieda) voice. \n\nTh","useful":6,"cool":3},"heuGErk_x18r-o-eTEFQ_Q":{"text":"The food was great but the service was not too good. We asked for 2 minutes to look over t","useful":0,"cool":0},"4k87mcO6Nzz-PLI6DHPNmg":{"text":"We visited during a Saturday late lunch (note that they are only open during lunch now).  ","useful":1,"cool":1},"sIRs014VHKTqGLmSHwf72A":{"text":"This was an amazing stop!!! I originally wanted to go for the fried biscuits but they were","useful":0,"cool":1},"L2N_SuDtrt4aZMmuZJAaJw":{"text":"First time in 2018 was amazing. \nThis time 2/9/20 was horrible. \nFirst off server Dawn was","useful":4,"cool":0},"_SGM8R8zFFe8ZzFYLm_5rQ":{"text":"Since I was pressed for time,, I did a phone ordered today.. I had to try the smothered ok","useful":0,"cool":0},"COJMswzVUSXvmTuKTqFhaQ":{"text":"The $15.99 Buffet was very limited, choices were Baked r Fried chicken..However,the Lunch ","useful":1,"cool":0},"tvfS9-rLp2LRW5hVkBruPA":{"text":"Unpretentious restaurant off the beaten path that's well worth changing your itinerary for","useful":0,"cool":0},"RiskDtcoEI3HpiMQiNwIOg":{"text":"This is our favorite spot in NO. We dream about the fried chicken and bread pudding all th","useful":1,"cool":0},"5fZRKlCr3Aa94piGksSFFA":{"text":"Great service! Walked in a man greeted my sister and I right away, seated us and suggested","useful":0,"cool":0},"to9CNVp4Zxf2h91Lsjjn3w":{"text":"This cafe is a quick uber drive away from the French quarter and well worth it. It's locat","useful":0,"cool":0},"P31Rqxz9QTvqLMY7_CIBow":{"text":"I can honestly say I have a walked a little bit of everywhere on my trip to NOLA. However,","useful":1,"cool":0},"U0maSLitiG5qH8D9AD-tpg":{"text":"Brunch buffet definitely worth it. Nice diner style home cooking. Patio seating. Good serv","useful":0,"cool":0},"jRKk2velew6KFKXDNjD2uQ":{"text":"Li'l Dizzy's is truly one of my favorite places in NOLA. I found it last year by accident ","useful":3,"cool":1},"-Tm3J0Y9ImzQ9b6vsotFGQ":{"text":"Definitely wanted to eat here after seeing it in several shows and hearing great reviews. ","useful":0,"cool":0},"HV1mBGCky6EnYL5QodWjrw":{"text":"I was in New Orleans for six days, I ate here 4 days. This food is shut up and eat good. I","useful":3,"cool":0},"9BtmD_MTVpUJDY47ToXn5w":{"text":"Lil Dizzy's is the spot to go to anytime you visit New Orleans. It's conveniently located ","useful":2,"cool":1},"kzQ90YOLoGOafC9MOQFDMA":{"text":"Going here reminded me of eating at my Granny's when I was little, so much good food.  I w","useful":9,"cool":4},"QQ5SxutPclTFJ4fy9rpw8A":{"text":"Thanksgiving this year makes me think and give thanks to the humblest most delicious Creol","useful":30,"cool":31}}