{"uciAGjEdouwNFvQxYk94Ow":{"text":"Do not use this service!  It is a great concept, but their execution is horrible and their","useful":0,"cool":1},"cUppSp2FldAyEtOtNGixew":{"text":"What a great idea! It was comforting to know that my party could leave out luggage at the ","useful":5,"cool":0},"LFe7XE_i4Ccm_1SySXYkaA":{"text":"Never have I encountered such an unprofessional and unhelpful company. Advance check-in li","useful":5,"cool":0},"pw3nktAIzWdKVYasq4QuEQ":{"text":"This service was fantastic. My family was able to drop off our bags at the port, explore t","useful":2,"cool":0},"XDpPlBTsql8u4ViaC0WWpg":{"text":"Do not use this company. In theory it is a great concept and business plan. Ran correctly ","useful":1,"cool":0},"lsa5HJy3Jr5vHK5JZFzv1A":{"text":"What a gem of a service! Using Amy & Drew basically gave us an extra vacation day. We got ","useful":4,"cool":0},"6KzdabSuf93-s_Ig-s-S4g":{"text":"We got cheap tickets to ATL from MSY on Spirit and didn't know what to do with our carry o","useful":0,"cool":0},"pus1JXANkgOKLzop-5mNAQ":{"text":"Checked our bags in after a recent cruise. Decided to book a hotel room close to Bourbon S","useful":4,"cool":1},"Of4SYNgtgXb3DW2mq7WgUQ":{"text":"They were awesome. We checked our baggage with them at the Port of New Orleans and went of","useful":4,"cool":0},"n2RL0JdcpHssQxXsuUEvwQ":{"text":"I was a little nervous about this service after seeing the reviews, but it worked out wond","useful":9,"cool":1},"ZePGTVvDTxcBS6F61PvavQ":{"text":"As several others said great concept, poor execution. We checked our bags at the cruise te","useful":0,"cool":0},"47Q4sjZfrgiUoPVdA0mhHw":{"text":"Nice family-owned company! Delivered my luggage right on time, right to my hotel door, and","useful":0,"cool":0},"PmG6Vf5vU91JSPLKTYslXg":{"text":"These people are completely unprofessional and can't even get such a simple business right","useful":4,"cool":1},"9xGDdLAVDxHs591buJKzxg":{"text":"If I could give this company negative stars - I would!  It is a great idea....but the exec","useful":0,"cool":0},"h7IpaGo7wDnb_jr9kev_lg":{"text":"This service was awesome!! Had two monstrous check bags that would have stole a full day i","useful":7,"cool":1}}