{"2gVVkSbDtMuorKG9q7kSQw":{"text":"great taco's, nacho's, atmosphere and margarita's.  wednesday is triple special day.","useful":0,"cool":0},"cvL4g3ycHGJIA2azYMnkHw":{"text":"Very friendly staff and nice environment although the crowd was light surprisingly the bot","useful":0,"cool":0},"NWQUwhPGqBSfXItRGp7JCQ":{"text":"If you're in the Warehouse District anyway (perhaps you're on your way to Cochon, which wo","useful":0,"cool":0},"P3cOHlZkqQ-VQ5t4LwBMPw":{"text":"This place is definitely fun if you're coming to get wasted. On the other hand, if you're ","useful":1,"cool":0},"h2it48zn386Kt34ZcuMIBw":{"text":"Not bad with the crawfish dish. Really laid back during the day but after 6 forget me bein","useful":1,"cool":0},"wBpsn3m5cxFeZ8tpe5Y2Fw":{"text":"Had light lunch at an outside table with a friend who was in town.  Basket of chips with m","useful":0,"cool":0},"vk3dm7QF8N46JQ9wd5UWTg":{"text":"Just any-old-bar.  I went for a networking happy hour, and the service sucked...I mean, th","useful":1,"cool":0},"6X7FWrCUV6NjP_FOmeoY6w":{"text":"We ended up here because we were staying across the street and were too hungry to really s","useful":0,"cool":0},"aoF8uc3wLZbip1vJRzjjBQ":{"text":"The front desk lady at our hotel (The Lafayette) recommended Lucy's - and wow am I glad I ","useful":0,"cool":1},"tiVKxXji3sNgnMBI50981A":{"text":"Stopped in here in search of a veggie-friendly brunch on New Year's Day. Disclaimer: don't","useful":0,"cool":0},"QFp6wgCJVpcyTB-46hBH0w":{"text":"Come and order the Shark Attack.  Their presentation is delightful and witty.  The drink i","useful":0,"cool":0},"27lVmW20fjs1fx2kaVkwWA":{"text":"LOVE Lucy's for a quick drink or a yummy breakfast.  Beats the breakfast at the Renaissanc","useful":0,"cool":0},"qB1WZb8yb7_g2AlFN7vGtw":{"text":"Staff is friendly. Walters trio enchiladas where terrible and the rice was uncooked, gross","useful":0,"cool":0},"jGeiEv-38EZwbIzeTpqGDA":{"text":"Lucy's was great! Mimosa's were fresh and the pulled pork was awesome! Great service and f","useful":1,"cool":1},"4-iDitONRWbQAGX70nB9tA":{"text":"I've been here many times and I always come back. Great location! The service however is t","useful":0,"cool":0},"zTDp5U6FSamJbcl6h7CO5g":{"text":"My partner and I went there for brunch today. Average food, terrible service. Restrooms ar","useful":0,"cool":0},"Wpj0yGXz2qWL5t9gRVa6Zg":{"text":"I've come here several times, with locals and with my friends that are coming to New Orlea","useful":0,"cool":0},"_oP3I2hjdoMGArGLVZKdMw":{"text":"The fried avacado was surprising choice.  The flavor Is primarily derived from the sauce, ","useful":0,"cool":0},"HgPeyY0ovcVDJMGlugzEug":{"text":"Stopped in for a drink. Loud and outgoing environment. The waitress Amanda was attentive a","useful":0,"cool":0},"1zzscM6hPrjLr16l50l3qw":{"text":"Went to the crawfish boil and had a great visit! So glad I got a little ways out of the Fr","useful":0,"cool":0},"j7D5cM6kU4Jz6tGnGV7Xjw":{"text":"Delicious mimosas, among other things. Went with girlfriends. Three ordered the crabmeat o","useful":0,"cool":0},"rcxMkEcr9UOecr2OtoygJA":{"text":"This place is awesome.  They have High Life, and the food's not bad either.  One time I wa","useful":2,"cool":3},"kXkoBcxhLJ058tTeBbUz6g":{"text":"I've been to Lucy's twice now. I don't usually do the whole going to bars thing but I was ","useful":2,"cool":0},"IldeCaOuEzJQ-w30cGVfXw":{"text":"This was the first spot that me and my friend went to once arriving in New Orleans. It was","useful":0,"cool":0},"D8FRRqIsMtgd-EiAv7lOkg":{"text":"What else could you want, great service, strong pours and average food! We'll be back","useful":0,"cool":0},"Xe7nhYQEnEsJNmM6-OWbiw":{"text":"Really enjoyed my evening at Lucy's. Food and drinks were reasonably priced, with nice hap","useful":1,"cool":1},"y-Vt32495kTffYk_1aepuA":{"text":"If I would have written this review a few years ago I would have given them 5 stars. Basic","useful":1,"cool":0},"LBOAro_JTX1s6XFYrGpZmA":{"text":"This place gets packed and is a total meat market most of the time, especially on weekend ","useful":7,"cool":6},"2b6M7utsRgymR0v6DPWi6g":{"text":"Great place for fun and good food.  I love the surfer concept.  Mahi tacos were done well!","useful":0,"cool":0},"UNFApMDHC4x8m5hPV9ATWQ":{"text":"All I have to say about Lucy's is that I have this serious love/hate relationship with the","useful":1,"cool":1},"9MKxV9eL5_3AVvNT0Jed0Q":{"text":"GREAT food! I was in town for a convention earlier this month. Breakfast and brunch were e","useful":0,"cool":0},"4-0bwy4XLxtu3iEuG-qstQ":{"text":"I've rarely have had a fun time at the bar here but there have been a few moments that wer","useful":2,"cool":1},"0LlxYSVtO1CdfkVeJySU_Q":{"text":"So the burritos are pre-made but if you request a manager you still get crappy service, ho","useful":0,"cool":0},"MMn03TyBeMsD6qIHu9q0Kg":{"text":"Lucy's is amazing. Great food (wide variety) and great service always. Fun for lunch, brun","useful":0,"cool":0},"U0TYiIfBTABaMpPiuyoYGQ":{"text":"Lucy's is... Lucy's. A fun, casual place that's often very crowded. Food's serviceable if ","useful":1,"cool":0},"93OyijcwNbW_EaG31BBIIg":{"text":"Pretty good surf/Caribbean themed place.  Had the blackened fish tacos which were great.","useful":0,"cool":0},"i3YcCRxgB1MpNMJvcdVTAw":{"text":"Great drinks, consistently good service, laid back atmosphere. The shrimp and grits was ex","useful":0,"cool":0},"Sd0Pwwz7qt-3XZNuuzr3mw":{"text":"Lucy's used to be a go-to place for me since I've lived down the street for years now. I h","useful":0,"cool":0},"pXBIk1H0Q9XM4wDppm_yAw":{"text":"First off... 3 Stars is \"good\" on my scale. This is a lively place for lunch, happy hour, ","useful":0,"cool":0},"QlFZHw9hBzD0VQ1eLHxPgQ":{"text":"I went to this place while staying at the Renaissance across the street. It wasn't bad at ","useful":0,"cool":0},"MEz9-qAajUB7r58_PwKOaQ":{"text":"Lucy's is.. good. Not great, not bad, just good. If you are looking for a happy hour spot,","useful":2,"cool":1},"Auw6KyV9_9wZYVT2_gtfTw":{"text":"This was a great find on my last trip to NOLA. The shrimp and grits appetizer was outstand","useful":0,"cool":0},"VwHw3usB-j1qSMoBo_pe1Q":{"text":"No draft beer. Bottles only. \n\nGreat happy hour taco specials. Great chips/salsa. My nacho","useful":0,"cool":0},"guJsfKIvfRh253-Li-h4qA":{"text":"First the new chef got rid of the wings which were the best in town. But, to tell me they ","useful":0,"cool":0},"lCjJyiPQBQYCd0T3StKejw":{"text":"3 dollar jacks on a thurs night. You are ok in my book Lucy. \n\nHaven't had the food here b","useful":0,"cool":0},"63WVmVAa2EO9Nl_fk7I3jw":{"text":"Fun place....kids enjoyed it.  Food was ok, but not great.    Wait staff a bit distant.  H","useful":0,"cool":0},"8cxkd3g1306-Li6NGuoasA":{"text":"Great service & food! This place is about a 5 minute walk from the convention center (conv","useful":0,"cool":1},"ivSfcG-pxbnCK7nmKTDsQQ":{"text":"Walked across the street from our hotel for a quick lunch upon arriving in NOLA. We were s","useful":0,"cool":0},"6lDcpCdhKWv11m1Ehs1knw":{"text":"I'm a local for almost 30 yrs.I work the service industry here.I went there tonight to vis","useful":0,"cool":0},"LHT5f4j_efGLNao-8p31Rg":{"text":"Burger was lame. If you order one, be sure to get add ons like mushrooms, etc cause the bu","useful":1,"cool":0},"T_pj7nV7pYtu8I-Lc7K19Q":{"text":"Honestly there was nothing impressive about this place. It is your typical bar that serves","useful":0,"cool":0},"MADtXV1LCOAfRgwPU-zI4w":{"text":"We stumbled in here around noon while on a bachelor party.  We went to a ton of bars while","useful":0,"cool":0},"DxSxVW2TXgK3r5PgvOBdKg":{"text":"Long ago a Lucy's opened up in my Manhattan neighborhood. I was a much younger man and I d","useful":1,"cool":0},"-D6Dps2aQKveBA08fuQm8Q":{"text":"This is definately a standard for a night out on the town for my friends and I.   I can't ","useful":0,"cool":0},"IR8Sc-kX8vwbhsIUrogXjg":{"text":"I have visited lucy's several times in the last five years and last night was a total disa","useful":0,"cool":0},"ZrMvm60L_qeHD4NN8-hKrQ":{"text":"The Wait to be seated was long even when they were tables available just because they take","useful":0,"cool":0},"WxARa93nEavZLrESxFf-bA":{"text":"I ate there at lunch today. The special was seafood chowder that was really good and inexp","useful":0,"cool":0},"lNJ3QmAcDWhZlYQqA3dAbg":{"text":"Ate her twice in a four day trip to NO. First went as was right across the street from our","useful":0,"cool":0},"QWfxDCPq5tPvpu1mK5mJ4w":{"text":"I can't believe I JUST found this gem!! Best guac and chips ever!! I've been craving it si","useful":0,"cool":0},"5LCm5Tg7TquWxBOL33Z7zA":{"text":"I visited Lucy's during my recent trip to New Orleans. Two Words : Mind Blowing. From the ","useful":1,"cool":0},"RwhNEUaPmXN9HIllOjLLSQ":{"text":"Piece of shit restaurant - waited 7 minutes for waitstaff to even say they would be right ","useful":0,"cool":0},"dBW2QF5AR-Q179oYxBgoBQ":{"text":"Please read carefully why I am giving them 5 stars. The food is average here but the staff","useful":1,"cool":2},"IPcKc2Jy0f_K94nb4GhqDQ":{"text":"We were staying at the hotel across the street and this was a convenient place and we had ","useful":0,"cool":0},"gxlVjjdVzT_-meK9-0flpw":{"text":"The girlfriend and I went here for dinner and it was awesome. Our waiter was outstanding. ","useful":0,"cool":0},"ia7ihXtXWSo992K_tGoB4A":{"text":"Great local place.  Food was good and drinks better.  Try to get here during Happy Hours. ","useful":0,"cool":0},"bk9bG13EDDoKkGIqhlG-zA":{"text":"Meh! \n\nI got here ten minutes before the rest of the group showed up and was wondering wha","useful":1,"cool":0},"yftFLxZChaFiZHs0Tm3cXw":{"text":"I've used this place as my \"starter\" place when bar hopping in Nola for quite a while. It'","useful":0,"cool":0},"umWf876ZdwaObUE4pTDuBA":{"text":"When visiting I'll always stop through here. Their fish tacos are fantabulous and I'm a fi","useful":1,"cool":0},"7ezrTc3te_pDVVw1LTCJzg":{"text":"Great spot for breakfast , awesome grits , egg's and meats specials,lot's of choices on th","useful":0,"cool":0},"PPpBVRIv0pif30nUYaY2EQ":{"text":"I went here late on a Friday night when some of the cast of the \"Real\" World were there. I","useful":1,"cool":1},"aBOln3Lml81VC2aZCz7-aQ":{"text":"Good bar scene, but we had the shrimp and grits and the shrimp were way over cooked making","useful":0,"cool":0},"yRdEy1PvL0Bj8WvR_VKTyw":{"text":"Although Lucy's is one of those places that always seems to be PACKED, it does have it's p","useful":8,"cool":3},"M8x14dld057O46rPjj83WA":{"text":"Popped in yesterday for dinner and it was a great choice.  The staff was friendly and the ","useful":1,"cool":1},"F5kiGmIyaSY8S81xAXZDHg":{"text":"I was in New Orleans with a convention and the team that I was working with decided to hit","useful":0,"cool":0},"PjzKEdbTBN3U4mVNHjXP4g":{"text":"Great people work there and they pour heavy!  The last time someone poured me a whiskey li","useful":5,"cool":3},"kwCAGHLGTpBhKi4C04lDnw":{"text":"Both the Cali burger and the valley girl are fresh and clean options.  Love the food here!","useful":1,"cool":0},"r5A11YKqcEfnl8r9E8ky8w":{"text":"A fun friendly experienced staff that will be sure to add to your experience while in New ","useful":0,"cool":0},"mB21BY84lhaC_DXYi7fynA":{"text":"Delicious! I had the fried shrimp salad & my husband ordered the nachos, both were outstan","useful":0,"cool":0},"4WcY4QpiAEGLnNmIJTjy0Q":{"text":"We went for breakfast, so we missed the meat market aspect of it all. Huge portions and a ","useful":0,"cool":0},"hP4rB_XMn-2Zjn64IGn-mg":{"text":"This place is really cute. I was a bit skeptical at first because you don't see too many s","useful":0,"cool":0},"-z_CTMhqK4hlI96SwCa7jQ":{"text":"Food is great, but not brunch. We ate here 2 different days during our visit. We went on a","useful":0,"cool":0},"17nmIcpFGq73OmIrhBIEpw":{"text":"The bloom is off the rose at Lucy's. I got the fiesta burger again since I was so impresse","useful":2,"cool":0},"iYAOB9CvlMenSzB-K6HDKQ":{"text":"Amazing Hamburgers for only $8!!!!  And the bar tender was very nice. The music was good, ","useful":0,"cool":0},"0nrOHqIU61kuC7tU-FcAXA":{"text":"Drinks aren't notably cheap compared to other places in the area, but the tacos are good a","useful":0,"cool":0},"CKM-Cn722wCoEU-R0JjJYw":{"text":"We went to Lucy's to view the Orpheus parade Feb 12, 2018, at Mardi Gras.  It was $75 per ","useful":0,"cool":0},"XLxdNdb5Rgo5WPOFUYQ_jQ":{"text":"Staff was so nice. Food was really good. Atmosphere was incredible. Went back the next day","useful":0,"cool":0},"qfpd2uyIuAp6Gob5FKeMGQ":{"text":"An alright bar for when i am hanging out in the CBD. Nothing I would ever go out my way fo","useful":1,"cool":0},"qAOd595v4Y0xk-lHj5j2GQ":{"text":"Unfortunately, I couldn't imbibe when I visited Lucy's, but I did get to enjoy the fish ta","useful":0,"cool":0},"-sMojQiRJoMzGMsEMSsHUA":{"text":"Came here last night with a group of 15 on Taco Tuesday, which I know is a lot!  Rachel th","useful":2,"cool":0},"TkTmGg7_UIzuVIxH4VWU9A":{"text":"Ordering the shark attack was one of the funniest things I have seen.  I won't give it awa","useful":4,"cool":1},"HkEJZ-5BslsE2KaTNgzZNg":{"text":"After waiting about 15 minutes the bartender came over and apologized for the waitress not","useful":0,"cool":0},"PntblcjmKmTHZtzCz4iftA":{"text":"What a great place!  My 6 year old had fallen asleep as I drove around looking for a place","useful":0,"cool":0},"LZjD2nNpzoUDTsKg-AtY_A":{"text":"Hung over after a long night on Bourbon street me and two buddies were looking for brunch.","useful":1,"cool":0},"iSqWXUeRgTCzJmlJc-EQbA":{"text":"Discovered Lucy's after learning that my teenage kids couldn't eat at the Harrah's Buffet ","useful":2,"cool":1},"YlXzMvYOfSeE_FjqIVwRZA":{"text":"Coconut margarita is delicious. We had a variety of foods and everyone was happy with thei","useful":0,"cool":0},"mqTSH-dZJW-YfxOkHsxXPw":{"text":"This was within walking distance of our hotel.  Great place with strong drinks.  A more ch","useful":0,"cool":0},"_WS4qzZrevH_NSHnpQa9_Q":{"text":"Let me start by saying that I like Lucy's for the food, not the bar. I have hung out in th","useful":1,"cool":1},"3iLhuiauuhQ6oo4WeP09qQ":{"text":"Awesome restaurant with great atmosphere service and food!  \nI liked  the music because it","useful":0,"cool":0},"2PR6s-zIhhesPNRRunKk7w":{"text":"The food was fantastic! Great queso and chips. The chips were fresh. This is not your typi","useful":2,"cool":1},"qRC2rXIC6c7agDB8-1ixZw":{"text":"The manager was too busy trying to make out with our server to actually serve us. So horri","useful":0,"cool":0},"p2HBcQ_YNd5d8UCmAemfOw":{"text":"This is not a fancy place but that's ok. It's a fun and friendly bar with great food. Unli","useful":0,"cool":0},"8_GJSgGx-FoK5EriOBhBuA":{"text":"Loving the renovations. Awesome place to stop in and get some good food and great drinks. ","useful":1,"cool":1},"AOj2IYEzDIq69lJKgmz0CQ":{"text":"There's a reason they've got a low rating....don't waste your time. Everyone at my table g","useful":0,"cool":0},"AVn33NtBstcCG1CVhCxgRw":{"text":"Good azz breakfast... Awesome place. A most place to top and eat! Drinks and food are off ","useful":1,"cool":0},"wWAYcXIn5FmbwfSOuuJAvg":{"text":"This was easily the worst meal I had in New Orleans. I really wouldn't recommend going.\n\nM","useful":3,"cool":2},"9D4oqGx9yz5LsaaO4_l8nw":{"text":"This is a great little hangout.  We were there for a conference, and the place was packed ","useful":0,"cool":0},"c5q-vztqJ41bLly6gIYMVg":{"text":"While i always felt beyond overdressed here, as everyone looks like they're in their pajam","useful":0,"cool":0},"p0Hjd6HPfi0-Wr2gHvEeDg":{"text":"Friendly staff and tasty cocktails. $1 tacos on Tuesday's and $3 beer. Cobb salad was pret","useful":0,"cool":0},"MN1WSZCOQDH0jx28jP2dXQ":{"text":"My experience here went pretty well. It was 10:30/11ish and PACKED, yet we got a table imm","useful":0,"cool":0},"XvWPfLbtX6H2DcITcFcjTQ":{"text":"Burgers were awesome.  I added bacon and guacamole to mine and it was delicious. Beer was ","useful":0,"cool":0},"WGMVhMQ0wMVoXwdEWBHvPw":{"text":"We liked this spot so much we came back the next morning for brunch before heading to the ","useful":2,"cool":0},"DWxSKBK9Wl4IBRcaKH0xDQ":{"text":"We had a Cobb salad which was done really well. Chicken fingers for one child who is our r","useful":0,"cool":0},"UfPbGC6BWwyGFCg0dBuWBQ":{"text":"I went here, I want to say, four times. A couple of times just for beers and once for lunc","useful":0,"cool":0},"CEGOZqsy40Do9jSfBeFIWw":{"text":"Cool little bar for watching the broncos/falcons game.  Plenty of TVs and they projected t","useful":0,"cool":0},"q4S9QguYyD6wK7XoDgajoA":{"text":"If you sit at the booth with the outlet you must have a scorpion shot---says the host man.","useful":1,"cool":1},"_i7C2T9ZbyBXpfmJLQ9M0w":{"text":"Really great place to eat in the CBD. Gotta get a Juicy Lucy! The servers are very friendl","useful":0,"cool":0},"aLc_Ju1z4ZBAaNMIJdeMfA":{"text":"Stopped in for a drink and appetizers with some friends. Its hard to stand out in a place ","useful":0,"cool":0},"_cKsqug_jtQTSQ8s5FsRlw":{"text":"Okay, so maybe I wan't so fair the first time I reviewed this place. I've been here maybe ","useful":3,"cool":1},"sbTWSgUy5MRL-CGSYSeA_g":{"text":"Don't bother going. Wouldn't know how the food or drink is. After being seated for well ov","useful":0,"cool":0},"YgMva-HZlbSTWqLuzFRv_w":{"text":"A fantastic bar/restaurant. Ariel gave my friends and I a wonderful New Orleans experience","useful":0,"cool":0},"2hbCoOe66uyunYBHlb_f2g":{"text":"We had seen it hopping for a few nights and decided to give it a try.  It has a local feel","useful":0,"cool":0},"FaFDHhentWFbu091R1xAeg":{"text":"Lucy's is a place you would go to if you needed to sober up on a drunken night. This is mo","useful":2,"cool":0},"luObyMbRaAWlyZYEVxQEqQ":{"text":"We got lucky and found this place after driving past it on our way to Harras. This was our","useful":0,"cool":0},"pyagJSAp9Tl63PmKRBNP6g":{"text":"The service and beer selection was great! The staff was super friendly and my friends and ","useful":0,"cool":0},"aMNuzdjO6G-iuJzS4C12ag":{"text":"Grey service, fast food and awesome prices. Happy hour boasts good drinks and a chill even","useful":0,"cool":0},"-hm4CwJd3MRLOUzoG_hZSQ":{"text":"I just love this place. Great atmosphere. The Quesadilla Burger is off the wall. My wife l","useful":1,"cool":0},"6kJNsdLZpmo9Y4ko2gTgkQ":{"text":"Love love love. Ariel was the cutest waitress :) Had the fishbowl, scorpion shot, and worm","useful":0,"cool":0},"wJLaAjvKEEyOq2p9j2JLkw":{"text":"Stopped in to watch a game with a friend and the place smelled like hot wings. Trust me I ","useful":0,"cool":0},"t9ncGmRlDD6dk6qGggoXiA":{"text":"The bar/restaurant is cute in that kitschy sort of way. The menu is pretty varied, but we ","useful":3,"cool":1},"IitdlhLPrXnTkp49JZ9mBw":{"text":"Hell yes! If you're thinking about it,  the answer is yes! I got the nachos and didn't eve","useful":0,"cool":0},"hiCichyTrkSsD3T1KUEnJA":{"text":"Best place in New Orleans due to the people and food. I travel through for work from time ","useful":0,"cool":1},"MXSsBPuXbRnAA7iAgO6Axw":{"text":"Great bar with a non tourist trap feel. We had the nachos and chicken skewers which were r","useful":1,"cool":0},"9nZkJohXdnpfziTWTc6hMA":{"text":"We started everyday at Lucy's!! Best bloodies on the planet. Great bartenders and excellen","useful":0,"cool":0},"nJ-QprNvT_ToNuRKhpO47Q":{"text":"Went here for a quick bite. It was busy, as they were hosting a block party. Food was exce","useful":0,"cool":0},"5vv-mfFj0x54EwiFtufsLQ":{"text":"Very relaxed bar atmosphere that a lot of younger people seemed to hang out on a Saturday.","useful":1,"cool":1},"4BPYbNv47Ru22ChPAo1kQA":{"text":"We had a really good meal. The food was great and the service was good. Was a little loud ","useful":1,"cool":0},"ctC6-HjfUZlQO1fhCD1sEw":{"text":"We tried this place for the first time.. the food was awesome & the cocktails were on poin","useful":0,"cool":0},"cANZwRochOwCYhZ_L-16nA":{"text":"Having been a regular here (At least once a week) I wanted to be able to give this place 5","useful":0,"cool":0},"bdZEVfF9K2kdceHKIxdwiw":{"text":"Lucy's seemed really fun until I brought my out of state id . They insisted it was fake an","useful":0,"cool":0},"wUPlcXpC6e7yX1i8HXe7yg":{"text":"Luke is the hardest working bar back there is! Amazing scorpion shots with a shirt! So fri","useful":0,"cool":0},"s4cf7_ZP_-xE2K4lLajbUA":{"text":"For some reason I alway think of the movie, \"Cocktail\" in reference to Lucy's.  Great plac","useful":0,"cool":0},"bHG4s1q2EuzZFw_0l_8MPg":{"text":"Great vibe. Nice bartenders - don't waste your time in the quarter. This place has great d","useful":0,"cool":0},"bD0PKeBINgwe7PKCoQ_pcQ":{"text":"What an excellent happy hour! I sat at the bar, sipped on a $5 margaritas, and shared chip","useful":3,"cool":0},"Ppm06FzQqpO__f7LsgmNXw":{"text":"Stopped in this place for a quick lunch before heading to the airport to catch our flight ","useful":0,"cool":0},"WlwjHO66_hW4DvBCWtHMPg":{"text":"I walked up to the bar, the bartender was serving a group that had been there before me...","useful":0,"cool":0},"teeOIB1aechsLOHKgfHsqA":{"text":"The meals here are amazing. I've tried all of the omelets and was always above satisfied. ","useful":0,"cool":0},"bru-BxqaFcOBk_gyHUlNTw":{"text":"Ok so I haven't even eaten yet but feel compelled to say something based on my experience ","useful":0,"cool":0},"eLXBU1W1BiEw9lPwF63HTw":{"text":"I have only had the desserts there and the flan is FLANTASTIC! Custard rich without the we","useful":0,"cool":1},"RMGVfL1tezJCP3CM5PSHYg":{"text":"2nd time there. Won't be back. Good cold. Service not good. Check completely messed up and","useful":0,"cool":0},"_wO0w9ekFOrQpddWOXza3A":{"text":"I'm giving them four stars because I can't do three and a half as they were blissfully smo","useful":0,"cool":0},"ewRPmKPR36y8NF2xwbBW6A":{"text":"Lucy's is a great way to start your Saturday!  Spicy Bloody Mary with a mermaid is perfect","useful":1,"cool":0},"8TKOcd0yNA3_hRx3PRCdvA":{"text":"We wandered in for a drink at the bar but were seated in the restaurant which was nothing ","useful":3,"cool":1},"30YwhCkDtNxQySxj0dcj5w":{"text":"We came with a group of 27 (students and adults) for an educational trip to New Orleans an","useful":1,"cool":0},"98zYQlWBlIp2uWu4tYiUMA":{"text":"This place is awesome! The food is reasonably priced, and delicious too! I ordered the bac","useful":0,"cool":0},"Z7HzJgQj_W68XDfavVQU-g":{"text":"Great ambience, great service and great food. What else do you need? Very chill and laid b","useful":0,"cool":0},"ndtPM3zHHWP5G8CO66TWvQ":{"text":"I had a raunchy salad here 2 years ago, so I wasn't eager to return. But the place we want","useful":1,"cool":0},"bJX1cHzvNSZwgccBhVHZEw":{"text":"We were in town from Chicago and staying at the hotel across the street. Decided to have a","useful":0,"cool":0},"UYH5ixhg0ZZ6SfFbYJj7GA":{"text":"Stopped in at night for a quick drink and were pleasantly surprised. What a fun place. Dri","useful":2,"cool":0},"yzoe-CesJa2vxAmf-tFJcg":{"text":"Love this bar and the staff. It's a fun place to meet locals and wet your whistle.  Visite","useful":0,"cool":0},"IgOqvaUb7PlxmlbDnd6iVw":{"text":"My husband and I stayed with a friend who literally lives across the street from this plac","useful":2,"cool":0},"MrtsYxH__xJUHoZEYlCFqQ":{"text":"I went to Lucy's for a girls brunch. We ordered bottomless mimosas and bloody Marys. \nMy o","useful":1,"cool":0},"uSAHtT7sTELIEFBWSbyj6A":{"text":"Fish taco's are pretty good. A few other items I've had are mediocre. Atmosphere is sort o","useful":0,"cool":0},"_jYc9YOS2kXUQGu9vNgaKw":{"text":"This is an identity crisis of a restaurant, where nothing there is really good, including ","useful":1,"cool":1},"R-IrBL9MgSpfmnAbzey9jg":{"text":"Eh... it's okay. Location is a little inconvenient for me. Parking is an issue. I hardly e","useful":0,"cool":0},"PMMjq8Jv0o7VU8BQw-3f-A":{"text":"I just ate at Lucy's and decided to write a review as soon as possible. My experience here","useful":2,"cool":0},"wiaoMjHftKZlsJQ2aQZLoA":{"text":"My experience at Lucy's was the worse dining experience I have ever had. The staff was sho","useful":1,"cool":0},"KbwHjjEbDaOZgiUCO-j6bQ":{"text":"I wasn't impressed with this place. My friend and I did as the podium instructed and waite","useful":1,"cool":0},"4DEfMQTz3lE92q2iG6kQYA":{"text":"Went to Lucy's expecting some good Ole service. Sat at the bar with a menu almost under my","useful":0,"cool":0},"NX8NjjJYt_LhN0GfKAs_3w":{"text":"I've been here twice.  I like the nachos and drinks.  There's a blue drink that comes with","useful":1,"cool":0},"njwfmNL2EH9V1oj-Fw9-vQ":{"text":"This was down the street from my hotel, and I came in for lunch. I got the burger, which w","useful":0,"cool":0},"HyVWx8WQcWWrdvwe7uRh1A":{"text":"One word.....gross!  Not sure how they can serve food.  It's disgusting.  I once had the s","useful":1,"cool":0},"rny8d8o1zqiXQhBIxh9bjg":{"text":"A fantastic gem! We happened up on this place walking in New Orleans. The atmosphere was e","useful":0,"cool":0},"avMmqoOb5C-uBYTGB1sHmw":{"text":"When Lucy's is crowded/standing room only at the bar, it exhausts me.  When Lucy's is more","useful":1,"cool":0},"_80PPy8UG7VFPzRu3JDh2w":{"text":"Went there twice, very friendly and good food. Also you can drink a scorpion...and get a T","useful":0,"cool":0},"szSXwDzyhenjMs8NZSHzbA":{"text":"Great burger, probably one of the best I've had in town. The service is always friendly an","useful":1,"cool":0},"fm2N3_MvRMfKic-aD8EDKA":{"text":"Eines von den guten Lokalen. Tex-mex mit einer Auswahl von 40 Bieren und nettes Personal.\n","useful":1,"cool":0},"EPJHqACnopPi3h2FC9wPJA":{"text":"The shrimp tacos here are by far the best I have ever had. The atmosphere is very laid bac","useful":0,"cool":0},"aqybw10_SCnQ469VsDZd-w":{"text":"I have not spent much time here but have found myself walking by every night for the last ","useful":1,"cool":1},"-YCs9abana6dYAtRmbd_QA":{"text":"Tried this restaurant because it was close to our hotel. Overall, was good but not amazing","useful":0,"cool":0},"JXMm08gynyr4akLq5Xdj3g":{"text":"Lucy's is a neighborhood bar for people who live in the warehouse district, work in the CB","useful":3,"cool":0},"grRsi2ye3UV2JHaf1UXD0Q":{"text":"The best thing about this restaurant is the location.  There were two of us in our party; ","useful":5,"cool":1},"oFVfcEqkCDO_ckG2jTn8IA":{"text":"I'm going to say three stars is the average.  Four stars for day drinking and visits...two","useful":1,"cool":0},"KLBTDfIvEJO8a289NyHYkw":{"text":"Inconsistent. Today, just plain gross. The fajita chicken came from the Tyson kit, unseaso","useful":1,"cool":0},"TvULbyYC0GbEEf0qChEyLw":{"text":"Solid bar atmosphere.  Jamaican chix appetizer is excellent.","useful":0,"cool":0},"Jthsr-usMboRLZx4h_1Hlg":{"text":"Lucy's is always just \"meh, okay,\" never great, never terrible.  Food is \"meh,\" drinks are","useful":1,"cool":0},"24stU7fTeqBjIv3x_ZUlsQ":{"text":"There food is bomb. Service is stellar . We tasted everything. And it was awesome. Blue be","useful":0,"cool":0},"KYVUelZeD5S3X4JoGInoDA":{"text":"The new renovations are nice.  One of my favorite places, and you can't beat the chill mus","useful":1,"cool":0},"8UUyS7lLJ-yq3PDJbYavHA":{"text":"The environment is OK, the drink prices, OK; the food- terrible! There's way better bars a","useful":0,"cool":0},"skFQliBuJrPKgeVhZVgcLQ":{"text":"So glad I didn't pay attention to the 3.5 stars. Decent bar food and FUN music. Friendly w","useful":0,"cool":0},"x2vg70oeUspQ3TU7_wzDQA":{"text":"NOTE: I came here 2/09/2013 for Mardi Gras, so I didn't go inside, or actually eat anythin","useful":0,"cool":0},"Qmed5AWmFlfRVdoIl5IzgQ":{"text":"This place is fun! It was close to our hotel and a great find. Good food and drinks. Fun e","useful":0,"cool":0},"XEbhRp9mK7N2O3m-mnOowg":{"text":"Mexican / Cajun !! Very causal and fun drinks with little mermaid. The ceviche was taste w","useful":0,"cool":0},"tDMn4HKO9RJqDGz-d97qHw":{"text":"We had our wedding rehearsal dinner at Lucy's. Full disclosure...the major selling point f","useful":0,"cool":0},"f-lKHHSjMIe4ySQAvf0F_Q":{"text":"Lucy's was our first stop after arriving in New Orleans. The food was great and the staff ","useful":1,"cool":0},"TIrn7i0Ss3dQ0sabJtNqeA":{"text":"I've only eaten here once during lunch and gave grabbed to-go drinks a couple of times. \nC","useful":2,"cool":0},"3ia9rFNr7mP3BDA0vF8rYg":{"text":"This place was a lot of fun! They had free chips & salsa as part of happy hour & $1 Miller","useful":0,"cool":0},"MUjDT-Oc_NyTjoiwphGnAA":{"text":"Cool space/theme/decor, good for saints games, incredibly mediocre for everything else.\nFi","useful":0,"cool":0},"6iRvJHApaLdCjPksG5fAVw":{"text":"Great spot to hit up for a quick bite and a beer. Shrimp tacos are great and they were als","useful":0,"cool":0},"GN3RkCwJZa0bECQtpJa8gA":{"text":"Lucy's is fun...\n\n...when you can get in. It can get so packed on Friday nights that it'll","useful":2,"cool":0},"l_XCBeNYsxKzppoHE1NIEg":{"text":"I was here on a business trip. And this place is AWESOME! Great atmosphere and excellent f","useful":0,"cool":0},"Bk78HEw3PTME2494Q37bMQ":{"text":"We stopped in after getting a recommendation from a local and we were SO disappointed. A r","useful":0,"cool":0},"i4HqYK4Nz-OHTni0-dLsTA":{"text":"Visiting out of town yet they made me feel like a local! Love it and the food and drinks w","useful":0,"cool":0},"63Q_wYpRrtgp6va1hmfQJA":{"text":"Always love the vibe in the atmosphere here. Great place to hang out after a Saints game o","useful":0,"cool":0},"Cx2O3S92J8NSjhk0y59eLA":{"text":"I have liked going to Lucy's as a bar and the day food had been fine, but I strongly advis","useful":0,"cool":0},"uJUMMVtL6Z3swB6AGiiprQ":{"text":"This place blows. On the weekends it is waaaaaay overly crowded. Not only is it too crowde","useful":2,"cool":1},"9xvGG7f9RKJ29-SmvHXh8g":{"text":"We had some time to kill so we thought we would grab a small bite to eat, this was the nea","useful":3,"cool":1},"brpezK4qaZOSYTfizbq07A":{"text":"Loved Lucy's day and night, went to NOLA for Mardi Gras and stopped by here everyday. We h","useful":0,"cool":0},"LZNner2YCFSnNO4lmE03zQ":{"text":"This place is great with kids!  We ate outside and the service and food both exceeded expe","useful":0,"cool":0},"9Um5Qk_8V83VciXjmZO9Ng":{"text":"I am not a NOLA resident, but I visit often and I'm beyond the Bourbon scene.  Lucy's feel","useful":0,"cool":0},"FLwKUYY3H-pE0bEPtge-xg":{"text":"This place has gone to hell in a hand basket over the past several months! What in the wor","useful":2,"cool":1},"f9FTYMwYi130kAAZd6O61w":{"text":"Bumped into this Bar-Restaurant across from the hotel I was staying. Absolutely fantastic ","useful":0,"cool":0},"5kKoBBKmI8dwuR63Aybebg":{"text":"Best Nachos I've had in New Orleans hands down! Huge portions I'm 6\"3 285 lbs and I could ","useful":0,"cool":0},"w1wFb1sNIQC-Y4dX2f7mGQ":{"text":"Good food, great atmosphere. Our server, Destiny, was awesome! Super fun place, and you ca","useful":1,"cool":0},"4prLcYlkNTR9uphnFMa-8g":{"text":"Obviously California food is not what one looks for in new orleans, but trust me, you will","useful":0,"cool":0},"YSIJnqtJBvz1f59b96Erbw":{"text":"I have been to Lucy's a few times. Last night was the last time for me. A friend invited m","useful":3,"cool":2},"_k2DSwBQQDNCG3RyxwXqdA":{"text":"WEAK POURS! Decent crowd, good staff, good food. Wouldn't waste my money again here on a m","useful":0,"cool":0},"D_BaETUQ3Mxso_cGdkFCgA":{"text":"Excellent service friendly staff and delicious food to top it off.  I came into town for b","useful":0,"cool":0},"bSWit8bUD3ADq9E34JduAA":{"text":"Went here last night with my brother to watch the game. We both had nachos, that were amaz","useful":1,"cool":0},"BAYySMtngz8ZVop9N8-Nfw":{"text":"The menu and the interior have been newly redone. The food is good but not great. Better p","useful":0,"cool":0},"O-NA0ruFo2POXM4lJbQ98Q":{"text":"I have nothing bad to say about Lucy's.  I never come here to just \"hang out\".  I come to ","useful":1,"cool":1},"CwuhT9EFhoBTG_SyozwMoQ":{"text":"I simply do not understand why anyone likes this place.  I work nearby and have given Lucy","useful":4,"cool":2},"RIlJVYqZsoyl5Q_GuMN3nQ":{"text":"A kitschy surfer themed bar with nice decor. Went there late night when it was a young, dr","useful":0,"cool":0},"kz78xNs2HAlf4pMJ1O8Gjw":{"text":"Lucy's is open on the weekend for breakfast, and we just had our best breakfast here with ","useful":0,"cool":1},"8mfIP8LvhGwspO7YVXYRbQ":{"text":"After not eating all day, we stopped into Lucy's! Me and my friend ordered the nachos w/ f","useful":0,"cool":0},"6mqxTx7HNlaeP2kDH5ZQJA":{"text":"Great jerk chicken meal. The combination of flavors on the plate make the meal. The outdoo","useful":0,"cool":0},"Ox1yAQQqGF0f0F-3rFG0qA":{"text":"What's this?! A DOG MENU!!! Good lord man this place was made for us! First thing our serv","useful":4,"cool":2},"BL5sob7-8pR2cYC3-8tUxQ":{"text":"What a great experience with some awesome staff members! Between Jud and Sam directing us ","useful":1,"cool":0},"5BvOsuecyFSxl5C2zDETvw":{"text":"Great vibe and great food.  Can get a little loud sometimes but I don't mind.  They have a","useful":0,"cool":0},"biCkp17ab19_aAA8k13dZg":{"text":"What a gem! Ate here our first night on vacation and have stopped there the past two night","useful":0,"cool":0},"AtiPbq05gP1z2V1g04rzzw":{"text":"We were looking for something closer to the hotel rather than going to the French qtr.  it","useful":0,"cool":0},"w89KRKFE89t-AqhYsgVOoQ":{"text":"A local recommended Lucy's to me for watching the Saints' season opener.  I can see why.  ","useful":0,"cool":0},"7-hQYnq-tYBEWu21k-qfsw":{"text":"I met two of my best friends at Lucy's on Tuesday for Taco Tuesday.  When I arrived they h","useful":0,"cool":0},"9WmhJh0ho6XXpos59mAqog":{"text":"Lucy's is perfect if you're in the CBD and need a bite to help soak up some of the booze. ","useful":2,"cool":0},"PZOCxgrdycQ0q5Iae3GGlw":{"text":"Fun place to wander into and sit at the bar. \nFriday night we had margaritas and enjoyed t","useful":1,"cool":1},"aS3s08z1yzKx0eVJah2CJg":{"text":"We stopped here on our way to the Saints game. The Bloody Mary was fantastic. The service ","useful":0,"cool":0},"E2xWtHE-2y7xUaNehUv98A":{"text":"After a really, really long day of travel to arrive in NO, we wanted somewhere quick and c","useful":1,"cool":0},"BV_qfjE6Que06tO6T-k5Jw":{"text":"Went here to celebrate a friends bday, we went to the back since the front has a bar and w","useful":1,"cool":1},"xociq1-WKIyfPLwKUTqU0Q":{"text":"Such a great restaurant with amazing food and drinks! I went there for lunch the staff was","useful":0,"cool":0},"gE-KzfiVPS_ol0ax_Tv0BQ":{"text":"Pretty cool spot - Didn't eat, but enjoyed a few beers and cocktails. Had been to the one ","useful":1,"cool":1},"eujg2DxA4PpIq9rfCLvccA":{"text":"Honestly such a fun place to hangout! Absolutely cannot go wrong with $12 bottomless mimos","useful":0,"cool":0},"xiNMKnP3knZWM6XvLqW69w":{"text":"I had a wonderful time talking to my friends for 2 hours before receiving my food. It was ","useful":0,"cool":0},"QKm_6aRA0IzHWmqKp_s-zw":{"text":"Went mid-afternoon with kids (lower elementary age).  As long as you don't mind the possib","useful":1,"cool":0},"3_G_MtVZJBwsGIiGFPpH_Q":{"text":"Best nachos I've ever had and a damn fine Margarita, to boot. Great experience. Cold night","useful":1,"cool":0},"pjpEIp2AFW4nqoqz1_I7_A":{"text":"I was first introduce to Lucy's about 9 years ago when I was in town for work and anytime ","useful":0,"cool":0},"X00F08e1OXKy05lclrN1rA":{"text":"Would have been a five but for a misunderstanding with someone who wasn't even my server! ","useful":1,"cool":1},"V2AMd_AF7x_jiGqBrNLLng":{"text":"There was a time many, many moons ago when I did like, not love, but like this place.  It ","useful":1,"cool":2},"6ZdOYiKXfEK_gSlyAJwBRQ":{"text":"The food was great and the service was phenomenal. We had an amazing time. It's nice to ha","useful":1,"cool":0},"Ul-YWSra4CAeCQNrlmiK3A":{"text":"Boy I wanted to like this place. On paper it sounded like a bitchen (that's surfer talk if","useful":0,"cool":0},"GY_xWfzDKvpthAnI15Kh-Q":{"text":"4 stars for weekday nights. I will not go to Lucy's on the weekend nights because it's mad","useful":6,"cool":6},"J3cuGoH_S405rvA3DPgfoA":{"text":"The girlfriend and I went here for dinner and it was awesome. Our waiter was outstanding. ","useful":0,"cool":0},"GWXYDN9IDjYfgXRdmACulA":{"text":"I really enjoy coming to Lucy's. They have good food and really good drinks. I usually com","useful":0,"cool":0},"2IqfhY6TmLuvqNrZi1SRzg":{"text":"We're pretty laid back people but we left before our food came. The 8 drunks at the next t","useful":3,"cool":3},"sHFc9kM6-LdJXAX6rtAk8w":{"text":"Ask for Jenna, get a firefly and lemonade.  This place rocks!  Wednesday wing night! Cevic","useful":0,"cool":0},"8sD-mcTVtcJ0Ku1-_o3olA":{"text":"Lucy's was awesome!  Specifically, our server Ruby was awesome. She was extremely attentiv","useful":2,"cool":1},"sPoX6AcTCFL8nwR1enBI6A":{"text":"All I can say is, Damn!!! I ordered the shrimp and grits and it is by far the best I have ","useful":0,"cool":0},"5Zj5y2Clp5gp6VvG7_QOKg":{"text":"Sunday brunch.. We ordered the guacamole as an appetizer- very good and the chips were del","useful":1,"cool":0},"sg7XY55loxBD6f5UIW5-Mw":{"text":"Lucy's is one of my go-to places for late night dining... especially after a drink or two.","useful":2,"cool":1},"Th0NsJCpl5Dcev84siTRFQ":{"text":"Visited here for a snack one day. I checked into the hotel across the street and needed a ","useful":0,"cool":0},"efHDV5xDCclt_acexbXB9g":{"text":"Fun bar. They have a happy hour and a late night menu. The staff is friendly and attentive","useful":0,"cool":0},"YLrGK9HjBe7y202-Ho6CFg":{"text":"My wife, myself and a few friends went eat here after the saints game last Sunday. My wife","useful":0,"cool":0},"o80SSOgMwBgRuJhEIIOWqQ":{"text":"So we came here in April and it was really good. The service was good and the taco special","useful":1,"cool":1},"Sf1SOXedv-jbQw4SEVj94A":{"text":"I would have given it 5 stars except it was very very loud in there. I had the jerked chic","useful":0,"cool":0},"whz7BZLphGqtYga2-A9nLQ":{"text":"It's a laid back atmosphere which I like. The staff is a bit robotic for my taste and the ","useful":2,"cool":0},"RYB1XklosC_Fpl1_0YBrQg":{"text":"Gotta love Lucy's.  We always come here after we ride in Thoth for a drink.  This year, my","useful":2,"cool":1},"d5xASIrmfD9kJ7GBMPY0uQ":{"text":"Good food. Surfer looking decor. We all had the tacos... Mahi Mahi , steak chimichuri... V","useful":1,"cool":0},"XpeA0-H191nyFk5RYtA4ug":{"text":"I had the grilled shrimp quesadilla and the Puerto Rican Zombie. I was satisfied with both","useful":0,"cool":0},"7yUpOW38UO92rAKusFzkCQ":{"text":"Lucy's was awesome! Tuesday taco night is perfect and the 3$ margaritas & 2$ pacificos go ","useful":0,"cool":0},"kaOWO8F7pOrGh64ExSMGxw":{"text":"Great place to make our \"neighborhood bar\" while visiting from out of town. Awesome, frien","useful":1,"cool":1},"tX-I_sOJnsb7Eej51fDEgA":{"text":"Most dog friendly place we have ever been to! There is even a dog's menu! Staff was awesom","useful":0,"cool":0},"akiVlG-r5POEGRIxqtdIFQ":{"text":"The food and drinks were great and our server Olivia was so nice! Even after cleaning up a","useful":0,"cool":0},"MS-XHx1ER6RkEOp4cyWKdw":{"text":"Been three times, excellent all three times.  I actually had the shrimp and grits two time","useful":0,"cool":0},"ri2_nH9hqgsLnBra_wXpMw":{"text":"I used to go to the Lucy's in Union Square NYC so I couldn't believe it had been resurrect","useful":2,"cool":2},"pedNtiW9Dk5CT8GON7XC8A":{"text":"I have been to Lucy's a few times usually because it's close to where we stay. If you are ","useful":1,"cool":2},"rZXMhdvRZaLIZgC4YAw2Mg":{"text":"I was NOT expecting the calamari to be this delicious (self-professed calamari snob here!)","useful":2,"cool":0},"1vM69FVWMtvcJJbzuMpdVw":{"text":"I've been here a few times because my friends seem to like it but It's not my favorite pla","useful":2,"cool":2},"Ze1S48fDp46qJm1sqE4BlA":{"text":"Great food and service! My husband had the red beans and rice...it was so good! I was basi","useful":0,"cool":0},"5TlGkbyC58LyEVy5Xdd9eQ":{"text":"I was unsure about trying based on the outside compared to the newer Resturant across the ","useful":0,"cool":0},"CSGZmd-0sxtlIJFGLUm0jw":{"text":"A neat little laid-back bar/restaurant that serves tacos, salads and burgers (plus other s","useful":0,"cool":0},"h-Y4LAsNX6DamzTD9yyveA":{"text":"Atmosphere was fun. However, the waitress, Natasha, had a bad attitude from the get. We we","useful":0,"cool":0},"6NVvBCAP7sPqRiMiTBdkYg":{"text":"I've been here quite a few times but the last three times I've visited it was so so fun ma","useful":1,"cool":2},"N_m2iSuWc13iEwOnu5tA_g":{"text":"First time ever staying in the warehouse district and Lucy's was recommended. We loved it ","useful":0,"cool":0},"K8x5l8V1_5EX-cPP2vOfGA":{"text":"The food is terrible, I do not recommend. Each one of us ordered several items as well as ","useful":1,"cool":0},"RjYvfSI2znQAMmY3DGaCOA":{"text":"Their nachos are amazing! Get the grilled chicken or grilled shrimp. I've been all over an","useful":0,"cool":0},"3T7kvSKsT7l_rMKAEjdkaw":{"text":"Awesome food... great atmosphere. Destiny is one one the best servers ever. Worm shots... ","useful":0,"cool":0},"45fgXB8K4ZKisoyw-c54iQ":{"text":"Excellent service and food.  Customer service was probably the best we experienced in NOLA","useful":0,"cool":0},"VXHgpHgcurHT5Tx3ESkLyw":{"text":"Visiting from out of state and was excited to go to Lucy's to get the frozen lemonade. Wel","useful":0,"cool":0},"dOsOWrXXFy2lfLSm-sIu6g":{"text":"The catch of the day was drum. It was good. Baked and not fried. The combo of the steam ve","useful":0,"cool":0},"nBHietje8BQTS371_F5PMw":{"text":"Great bar all the way around. Excellent specials, especially $4 margarita nights. If you w","useful":0,"cool":0},"ch8axWkTNAOd7wy31S30xQ":{"text":"This is NOLA light. Its like opting for a light beer just  to have a good time. The staff ","useful":1,"cool":0},"uqAFjgHdcjCMZsn4k88m-g":{"text":"Terrible service, Caesar salad was good, tamales were terrible no flavor, didn't even eat ","useful":0,"cool":0},"t59C9RYKe29FYU8qBxvPCg":{"text":"Nachos were good! Service was not good at all. Bartender came around towards the end. Good","useful":0,"cool":0},"1mV561Kcni7MVL3452q_zw":{"text":"Went to this venue for a work event.   Went upstairs- nice space.   Food (tacos) would hav","useful":1,"cool":0},"21lhy8lRmosSa3og1FnSKg":{"text":"Loaded up on a selection of items and shared amongst four people. Very friendly service an","useful":0,"cool":0},"r9K6Sj9GPNjKxg4_Pgl4Iw":{"text":"I was physically assaulted here and robbed in the middle of the bar. When I asked bar staf","useful":3,"cool":0},"PhEAz9hAJ_yqPiXjUKrNkg":{"text":"This should be an obvious statement but the food here is terrible.  Burger had the taste o","useful":2,"cool":0},"Mk-oluC0diTDkRbKZQS1xw":{"text":"First off, this was our first visit, and because of our waitress, Arielle, it will not be ","useful":0,"cool":1},"jhBY9StdoxEoEPE1HnilMw":{"text":"Douchiest bar in NOLA??? Very well could be. Mexican bar food and skanks. Dudes in tight t","useful":0,"cool":0},"34y_7aQjQYpahTuDIgoBZQ":{"text":"A local friend told us to come here for Sunday brunch and $4 bloody Mary's. The menu has a","useful":0,"cool":0},"8vjiSAjI91oL3eTmHZFlLQ":{"text":"Ditto what everyone else says about the popularity of this bar - every time I go, it's pac","useful":1,"cool":2},"bmzECINXZ-zBkwyRJT2Qew":{"text":"Great food, had the shrimp and grits & got the daily catch. Service was even better I can'","useful":0,"cool":0},"P62nmtm8rKn64FA_fBXP_w":{"text":"Lucy's brightened my day!! Everything from the open-air space and $3 mimosas, to the fried","useful":3,"cool":2},"IMyUCU5QsOWmFmvt13XuYg":{"text":"So I really like Lucy's. It's a fun spot to hang out with friends. Plus the food and drink","useful":2,"cool":0},"vojDGL27z0vxqB6V7SRa4A":{"text":"We are going to give Lucy's four stars it really should be three but the waitress was so n","useful":0,"cool":0},"KX08cD-NSitdd2TXw3uXiA":{"text":"It was a great place in my early 20's when I loved to drink and dance. Gets VERY packed an","useful":0,"cool":0},"vC41LZEvrqll3GKRnOpJVw":{"text":"This is a pretty awesome and fun place. I would highly recommend the Pão Pao Shrimp tacos ","useful":1,"cool":0},"bpq3wLhPDfblrYf3OicFKw":{"text":"0 stars. They took my ID bc some girl thought it was fake. It literally wasn't i'm 21. Adm","useful":0,"cool":0},"YpDjlhf8S2wPes7FFClbwQ":{"text":"The Shark Attack drink was hilarious. The wait staff was friendly, but the bartender?! May","useful":0,"cool":0},"Vc0nUR9YT0Q_kzXp9S4LJw":{"text":"I've eaten here many times in the past. The food is sub-par at best. Staff is friendly tho","useful":2,"cool":0},"CvYCSC1gjS9TUqmI6tribw":{"text":"I have been here 3 times in 2 days. Great food, strong drinks and super friendly bartender","useful":1,"cool":0},"ZvxPupUUJM4F4vNxgN751A":{"text":"This review is mainly for The Attic (private parties upstairs)\n\nIt is actually located nex","useful":6,"cool":4},"O_6KIrVMbTeQIWLAQUluoA":{"text":"Enjoy going there in the evening. The girls love the music upstairs but turn on the AC. 95","useful":0,"cool":0},"qz2oOFbbpykOx3fW4g2Ztg":{"text":"My wife and I split a slad and burger for lunch on our way to the WWII museum.   The large","useful":1,"cool":0},"FpZPoBs8DJto2AG7Kg8v0A":{"text":"Lucy's is always a good place to watch the LSU or Saint's game. The vibe is pretty energet","useful":3,"cool":2},"zUudU4M0inM8B_R8dbJGkA":{"text":"This seems like a fun spot! Would love to have come back by to visit on a weekend night. I","useful":0,"cool":1},"a87PsbVoB49pWgxp2uncJA":{"text":"Spilled my shot as I was tipping the bartender. Got napkins cleaned it up and then had to ","useful":0,"cool":0},"It2FJfReNcya2n5RmMD_Eg":{"text":"The shark drink is both a must try and a hangover inducing experience. The second floor is","useful":1,"cool":1},"W7XT0ANtM8E7SkT8eicolA":{"text":"We visited Lucy's multiple times during the week of the National Pool Show. Food and bever","useful":0,"cool":0},"BcCA0GKyEeVLKnykX8bukA":{"text":"Casey made being here even better. Super attentive and friendly with a lot of recommendati","useful":0,"cool":0},"HExOSsy-AfRbA87gFE4RAw":{"text":"Fun spot for drinks and dancing! Good atmosphere and the bartenders were great. We had a g","useful":0,"cool":0},"hj7BrPYfwdw0XoMDZC_IDw":{"text":"I love the atmosphere here and the tacos are like crack (figure of speech-I have never don","useful":0,"cool":0},"J3C0FYd825DsU4bvmPDoSA":{"text":"Our first stop in New Orleans while traveling with two dogs and our experience could not h","useful":1,"cool":0},"H3KToJF2ydeQOS991U5XxQ":{"text":"FANTASTIC food!  One of the best club sandwiches I've eaten in my life!  Great service!  C","useful":0,"cool":0},"CcHM4ewynI6YYtuCj_Bufg":{"text":"The food is amazing, staff is super friendly.  Grits and bread pudding is out of this worl","useful":0,"cool":0},"p7EnHGs0fqR-DA7PJ8udQg":{"text":"Second time passing through but this time on purpose. Stumbled on this last year and enjoy","useful":0,"cool":0},"kSYZouLOwfwFzGFh5YJztg":{"text":"Say it with my shrimp and grits shrimp\nAnd grits! Food is just ok, but the drinks are soo ","useful":2,"cool":0},"JAhjxKW--SELFI4AkTzkjA":{"text":"Oh Lucy, where have you been all my life? Your Frozé is the perfect drink to cool me down ","useful":3,"cool":1},"pIAiYx0GuQT4lJ29wXcIPg":{"text":"I absolutely love Lucy's for Taco Tuesday however recently on a visit when I ordered what ","useful":2,"cool":0},"Hi5CZGjik_avPNMhC3VxDQ":{"text":"Great atmosphere, wonderful food. Great place for brunch. Not too pricy. Wonderful servers","useful":0,"cool":0},"crKtcR4lH0MEvMlWJ_zSoQ":{"text":"Great place to stop into while visiting New Orleans! They're known for their frozen lemona","useful":0,"cool":0},"ktSqQ19tP47mlvQKRmH3pw":{"text":"We stayed across the street at the Renaissance and slept in late past breakfast one mornin","useful":1,"cool":1},"zzpmGoASeCh5HuCpGkz4Ew":{"text":"I'm baffled I have never been here and somehow yelp checked me in at this spot last night.","useful":0,"cool":0},"J7yqWlLgm__OG6jQ_HyIsA":{"text":"I have walked past this place so many times, and today was the first time I stopped by for","useful":1,"cool":1},"QiSYvaHXBNIj7YfpbhdtHQ":{"text":"What is that they say about first impressions?! After hearing over and over again about ho","useful":0,"cool":0},"b3dBER72gIH7LPLg27C2jQ":{"text":"Meh.\n\nPricey & pretentious.  The burger I had was OK, but it's kind of hard to truly fucku","useful":4,"cool":2},"QRHCv5B7gryf5rpYGf0lqA":{"text":"Was a fun little bar with friendly staff and tasty bar bites. Would recommend those visiti","useful":0,"cool":0},"9L6XRs2ARsNPRmVc8ax3Fg":{"text":"Lucy's Surf not only has a great vibe, awesome music, plenty of daiquiris, and Sue's Spicy","useful":0,"cool":0},"3aVXM5yV8v1BoEWijm0tpA":{"text":"Lucy's is always packed and it does have a good atmosphere. Everyone seems to have fun han","useful":19,"cool":15},"dKTCiRHqWvkSmQzK7Cav1Q":{"text":"I wish there was a blank option.  Staff are unprofessional.  They all were standing around","useful":2,"cool":0},"kaXcmD1jL0aVwlGInVN0DA":{"text":"Excellent food and staff! Very unexpected delight in NOLA. CALAMARI WAS AMAZING as we're t","useful":1,"cool":0},"rY-0Lgwm0C5C4lMZhwRQIA":{"text":"We rode the train to New Orleans. Once we got checked into our hotel at The Cambria we dec","useful":0,"cool":0},"oJE12PGxa5lMd-7juJz5SQ":{"text":"My friends and I came to celebrate my 21st birthday at midnight. We got in and I waited at","useful":0,"cool":0},"JEgcOXnUgvqqqdq7sROW4Q":{"text":"While technically there's no beach in sight, this spot succeeds in making me nostalgic for","useful":3,"cool":1},"IqO2wdO1CAcN_TfcamtquA":{"text":"Me and a group of University of South Alabama friends visited this establishment while vis","useful":2,"cool":1},"TpNEH8znaAu27kHfFOHWdw":{"text":"Came here for a late night dinner in the CBD. Staff was great and so were the drinks. \n\nWe","useful":0,"cool":0},"BtuOkuSC6RyUqTg7FUMsAA":{"text":"If you've never been to Lucy's, you should def. try this place. \n\nEverything on the menu i","useful":2,"cool":0},"8EHokfGfcPkSSpbmZJminQ":{"text":"Been here several times before. Came in today and had the hiccups so my husband tried to s","useful":0,"cool":0},"YjuFpDGIKa3gloTiwZZHnw":{"text":"i have actually never eaten the food at lucy's, but it is my absolute favorite place to gr","useful":0,"cool":0},"gPeeDEqbIhS4eV9eQrTm4Q":{"text":"After lunch at Cochon, my date wanted to visit his old stomping grounds Lucy's! This was t","useful":3,"cool":1},"KStNLrgyrXRX27wY2DbNiw":{"text":"Love this place. Some friends and I wanted to go to the dog park after lunch, so we needed","useful":3,"cool":1},"RVoqFwY6KeHYa3eqRC6Kdw":{"text":"All the locals love this joint a friend clamored.\n\nEvidently, Lucy's was one of the first ","useful":0,"cool":0},"Cy-2PQ1lXxp4W7MIHVfG-A":{"text":"Arrived around noon on a Saturday. Not too busy. Seated between 2 booths that had already ","useful":0,"cool":0},"T_g1RQq3q8ZfR5iN0o-XeQ":{"text":"Lucy's is a fun change of place for the typical NOLA restaurant.  Great service, delicious","useful":2,"cool":0},"M_ZYXnPEZfaxVd2hlUF5WA":{"text":"They were more interested in their phones than getting us a drink. Also the managers wife ","useful":0,"cool":0},"sM7KlG0ZhjBC1LxR39hOFg":{"text":"Super fun spot to watch a game and get some standard refreshments.\n\nDrinks: 3, Atmosphere:","useful":0,"cool":0},"ZapCewvZfNNuirMYTEX9pQ":{"text":"Great location and lots of tables outside to enjoy the weather. I had takeout and my jerk ","useful":1,"cool":0},"wZecteXKwov2Vy7npmMptg":{"text":"What a cute place! Visited here after working in the city for a couple days. I walked from","useful":0,"cool":0},"iTx_9NVTy8S_kuHrzaRypw":{"text":"We popped in here tonight for an early dinner and everyone had tacos. We were all super sa","useful":0,"cool":0},"sBBs-F6HqGS0wgi3clIo-w":{"text":"Beach bar in the city, with a surfer flair. I had the catfish po'boy, while my wife had th","useful":0,"cool":0},"1tbTUaiQrUAGtmh_DCC82Q":{"text":"Jaryan is ON TOP of the game! Quick with the job! Hard worker! Great conversation, best ba","useful":1,"cool":0},"QrD3bUcEkYI7uCYOrlHWEQ":{"text":"Awesome atmosphere but we were from Washington State and our bouncer kept accusing one per","useful":1,"cool":0},"ZwDBr47_qBSRJ5nR9YFLIg":{"text":"This was supposed to be taco Tuesday with the fellas but since they all have kids and wife","useful":2,"cool":0},"gp5-XZhDXuKBFSHBoRavfg":{"text":"This is a bar with some \"bar food\" options. But it's nice and anonymous enough and not ins","useful":0,"cool":0},"lcXrqwSOTiZOtv_hSLYApw":{"text":"I had to come to the place named after me! This bar and restaurant is just so cool! They h","useful":6,"cool":6},"S3Vm4h8aTGdAJrhl2Fh9NQ":{"text":"Ears are still bleeding, surprised wait staff doesn't have hearing protection.  Food was a","useful":0,"cool":0},"EpVcxy8kX8VTzZ8tFPNFYg":{"text":"The fish tacos were delish and the chips were fresh, still warm. The salsa wasn't spicy bu","useful":0,"cool":0},"VOAEp1fF-V1hiIPBTti3sw":{"text":"Honestly just came here to tell everyone to get the Cabo Shrimp and Grits. Seriously one o","useful":1,"cool":0},"c_H4fenT9yl_GLHpJDWd8Q":{"text":"How have we not written a review for Lucy's?  The place where everyone knows our name and ","useful":0,"cool":0},"SYuTtaTXmGVfqYSeklmfNQ":{"text":"This has been my dad and I's saints game pregame spot for years now. We come for the blood","useful":0,"cool":0},"rd6sTggu1Ar_q9gTrKX_vg":{"text":"I'm only giving 4 stars because I've been to Lucy's numerous times and have never had a ba","useful":0,"cool":0},"MUJi8BTq3T_L1YbzT31mFA":{"text":"Food and service were outstanding! So good we ended up here twice ! They also have really ","useful":0,"cool":0},"2B7prKYnuaqGl8N2r9fcIw":{"text":"Great Customer service I came with a party of 25 we had the entire top flood with our own ","useful":0,"cool":0},"U-hAPmgOF3DKoWrjbfT0aQ":{"text":"I got the buffalo chicken wings (which are the best in town) and as soon as I started eati","useful":0,"cool":0},"yOEJnL9c2hL2H0fmG4QYpw":{"text":"Perfect place to grab a cocktail with others and even enjoy a light late night meal if you","useful":3,"cool":2},"dPLjhsc4_Z1zeAebFxUPmg":{"text":"We were in Nola for a few days and did all the Nola eats but on our last night we just wan","useful":1,"cool":1},"YyQPU8bA8p23EE1GVfhXhQ":{"text":"Food was delicious and service was great! So happy we stopped in for lunch! I had the drag","useful":0,"cool":0},"JbmSSGvETQ-ERZyqqlpeVA":{"text":"Updating to 3.5 stars due to proactive management and good customer service.  Like I said,","useful":0,"cool":0},"vsRqScjhEAvDzXS6VRJmYw":{"text":"extremely good food. strong drinks. they said an hr wait but it was only 20mins. customers","useful":0,"cool":0},"_gnRokgD3bWFbGopELAFzw":{"text":"This is a nice spot but had to give it 2 star I order a queso blanco and it was cold. The ","useful":0,"cool":0},"0t--rUj8sI88vL_iAr_Hcw":{"text":"Great staff, friendly, attentive. Food was good and so were the drinks. Had the blackened ","useful":0,"cool":0},"N7QAmwhZjrvsNEidWe7bxQ":{"text":"Great dinner and drinks.... sat road side with a group of friends and enjoyed a fantastic ","useful":0,"cool":0},"brca01NCESTUzGnyMx4I5w":{"text":"Love Lucy's! Their strawberry margarita is my favorite! I've only ever had their queso whi","useful":0,"cool":0},"-YP8_SH4dBxEMKxUkX0euA":{"text":"Great bar food.  The wings are perfect, great burgers, and if your lucky and they are serv","useful":1,"cool":1},"ZorxLD23OnVD1t7lKRqH7Q":{"text":"We went to Lucy's retired surfers bar and our waitress was named Bridgid and she was amazi","useful":0,"cool":0},"sjBeOv3iLCR8zlVo2Rw9mQ":{"text":"Came with my wife and they refused her legitimate drivers license. What a joke place.","useful":0,"cool":0},"N4qsd7m5IwqYADmejyzzYQ":{"text":"Lucy has both delicious drinks AND food.  You can't go wrong with anything you order off t","useful":0,"cool":0},"J98BVulqaQgT1i0YdMQMiQ":{"text":"First time at this place in Aruba.  The service was great and food was very tasty.   We ar","useful":0,"cool":0},"4ubpjSiOtri_YuSd8-M3Kw":{"text":"We ate here twice. Once for lunch/dinner and once for breakfast. \nBoth times the food was ","useful":1,"cool":1},"TbyYncJB3O0MmPBPuXjLuQ":{"text":"First time ever venturing downtown to this place.\nHad the red beans and rice with sausage ","useful":1,"cool":1},"dx6NMMe8f_25ZZGty2cfAw":{"text":"Happened to come across the restaurant walking from our hotel to the WWII Museum. The Eggs","useful":0,"cool":0},"WojkBfAwdVbi-0xtmkOydQ":{"text":"The bouncer commented on my mothers weight and the staff was completely disrespectful. If ","useful":0,"cool":0},"PgYKd7FILI3NDkrBSkxlWQ":{"text":"How many different ways can a person say \"awful\"? Unfortunately, I found a new way to say ","useful":6,"cool":0},"AnBL-kSvIusfuEsVoVKEKQ":{"text":"Staff was friendly and welcoming. We noticed the place was clean, open and colorful. We or","useful":1,"cool":0},"XGth5QaZLM02nS_WMmpRxA":{"text":"We love hanging out at this hidden gem on the corner of Tchoupitoulas and Girod.  The staf","useful":0,"cool":0},"C_XmsnqjohlEb7Fdl3hnfw":{"text":"Fun little dive bar in the Warehouse district.\n\nGreat place to watch a sporting event or t","useful":0,"cool":0},"qlo3lohLonrodSkNuN_7ow":{"text":"Lucy's is a cool neighborhood bar restaurant. The service was excellent. Wife and I each d","useful":0,"cool":0},"6zEirxExagGiFNY-nTtjBA":{"text":"Always the best!  Walked right past Mothers (with no line) and didn't think twice about my","useful":1,"cool":1},"blh-THTjw2afR4czgDV5pg":{"text":"I came down with my best friend from New York to visit New Orleans for New Years Eve. To o","useful":0,"cool":0},"LF8xxFG_TY23z5UKdEq-GQ":{"text":"On Valentine's Day evening during Mardi Gras this was about the only place that we could p","useful":2,"cool":1},"oYqVKEUXC8vv7xMrk-9qbg":{"text":"Fun time with friends but if you're a girl, be sure to have make up caked on your face bec","useful":0,"cool":0},"QytNaQq6A7ZqweqrNNP7Ow":{"text":"Calm and welcoming atmosphere; This bar was our savior on our first night in NOLA as a way","useful":0,"cool":0},"qgd_G3m872fUZHXaTbQ8Mw":{"text":"My husband and I ate here twice during our visit. The Tito's Frozen Lemonade is so YUMMY a","useful":0,"cool":0},"dyn-Pk8s6tyKYFX5VBLT8A":{"text":"We had our wedding reception upstairs. The food was great! The service was great! We had a","useful":0,"cool":0},"cCbZSxJvO5uG4tCwUwGGKw":{"text":"Visited this needle in a haystack late night spot in New Orleans. \n\nThe staff is friendly ","useful":0,"cool":0},"XppxQ3MZnregPsc2Xy6dJg":{"text":"One of the best breakfast spots in New Orleans.  THAT is a big statement but I have never ","useful":1,"cool":1},"nk8xpdaU9Z0UpSOTyGNvdw":{"text":"Went with my friend on a weekend the tacos were stuffed and delicious! I got 5 I couldn't ","useful":0,"cool":0},"u6mgZQD8ZZKxWDDjy8FlKA":{"text":"We love love love Lucy's so much!!!!!  Great drinks, great food, great happy hour, great s","useful":0,"cool":0},"G7mjF8HNx79cWyblVF2qMQ":{"text":"who'd a thunk it? This is NOT the old Lucy's!  The food is terrific, servings are large, a","useful":1,"cool":0},"J3SOtWVu-DBqU3tozXf72w":{"text":"It's a surf bar, through and through. From the color schemes, to the shark and surfboard p","useful":4,"cool":3},"2__kCsqW9nqwE-Oy0tJgoA":{"text":"Finally tried this bar/restaurant across the street from our hotel towards the end of our ","useful":0,"cool":0},"ZSCYNnEGBrWZxuyYAxv0PQ":{"text":"Went to the pre-barry bud light bar mitzvah (just kidding my Hebrew brothers and sisters)!","useful":0,"cool":0},"TimTQM20SXc7rQdSLRn8eQ":{"text":"Our breakfast this morning after making groceries at the Farmer's Market consisted of Bloo","useful":1,"cool":2},"x2dw68OZxtaBn-DxHFi9Vg":{"text":"My buddies and I came here for a drink after dinner at Cochon. What a blast we had. The dr","useful":1,"cool":1},"YJ_VCsrFUYGnxNseHYrU1g":{"text":"I attended a private party in the Attic.\nGreat party venue and the staff is friendly and n","useful":0,"cool":0},"SgOYhNkL4P-3tkEFce3vNA":{"text":"Can't vouch for the bar experience (I was there with my 77-year-old dad and 14-year-old so","useful":0,"cool":0},"ndjKk8RmgwpjiUOAOew2GQ":{"text":"Came here for my 21st birthday a few nights ago (February 22). Had the absolute worst serv","useful":0,"cool":0},"NdrJee25mNXGCVat7uVQXA":{"text":"Not the clearest guide on how to get a drink in this place, but the drinks were good. The ","useful":3,"cool":1},"R4DYqZ8Ar8pGSfQ6dkriIA":{"text":"I kept it basic because I seen they\nHad chili sauce Calamari. It was/is the bomb, I'm eati","useful":1,"cool":2},"UlPB7f2J7taQ_vfJ8Jktrw":{"text":"We always have a good time at Lucy's. The music is fun,  the food is good and the atmosphe","useful":2,"cool":2},"KZWlXTca_e6u1QEAr-jKKQ":{"text":"Oh Lucy's... your happy hour is so nice! We popped in on a Thursday afternoon and Ace was ","useful":0,"cool":1},"JbUY61wgb_TOYRHW3h3qTg":{"text":"Literally was sat by a hostess and waited over 30 mins for no one to acknowledge us even a","useful":1,"cool":0},"DsqKFyNGCW6EIsoPhXlvXQ":{"text":"Found this place while wandering around from the hotel. Reminded me of places in Santa Cru","useful":0,"cool":0},"vprEtxJjF7PPST5KLPU-Hg":{"text":"Lucy's is a fun place with a big bar and menu featuring tacos, burgers and more. It was pr","useful":0,"cool":0},"lQ5i8A0Ja74KBP_B5AMhOg":{"text":"this bar was the worst! management was highly disrespectful for my party, especially the g","useful":1,"cool":0},"SeMV9jIWnoLMORQHux9VyQ":{"text":"5/5 for atmosphere. looking for place to dance on a Friday/Saturday night in Nola. Lucy's ","useful":4,"cool":1},"gh4h7bLpc0Sre6c3HaUB9Q":{"text":"Found this place hiding out on a corner, checked out the menu on the cool surfboard outsid","useful":0,"cool":0},"ZH3deKt60DswAfufF4unLg":{"text":"Looking for a break from Bourbon St? this is a good stop. Calamari decent needs more side ","useful":0,"cool":0},"jv_qeUJQiB_aA0Ix6MQarA":{"text":"3.8 out of 5 stars.\n Poblano + cheese + grits = fiesta in my mouth. Who knew this was even","useful":0,"cool":0},"gqYUOXDg43rVZPFLKAT_bg":{"text":"I can see where the complaints about service come from. I went for breakfast/brunch and in","useful":3,"cool":2},"ltTPftYtndfaUhOhhdANsA":{"text":"Really this place has very shitty food I really don't like  flavor of the food I'm sure pe","useful":0,"cool":0},"6bL2rkMyBXy3XVKfwmwRlw":{"text":"First time here.  The shrimp and grits were absolutely amazing.  But the rice that we got ","useful":0,"cool":0},"Dj6A7HUQC8X1gYqj6yd3mw":{"text":"We stopped in for a drink as we were walking down towards Couchon.  Nice relaxed vibe, goo","useful":1,"cool":1},"18_Et2apoFJhmxUrYppVlQ":{"text":"A MUST when in New Orleans! Fun, relaxed environment. The staff are super friendly and the","useful":0,"cool":0},"iPocHUfrYswigCl_upkVTQ":{"text":"As usual good service and their food prices SO much cheaper than any of the other overpric","useful":0,"cool":0},"TOTZv8nQCHJtLFFrEDt3VA":{"text":"I just recently visited Lucy's after a few months. I came in with a large party and I was ","useful":1,"cool":1},"elnJLMdnZAHOs8bPX1uUZg":{"text":"From the adult beverages to the bbq wings to the fish tacos to the waffle dessert everythi","useful":1,"cool":1},"_K0zYzUzvMgj4tEUdV6xlQ":{"text":"We've eaten here twice already while on vacation in New Orleans & the food is tasty, espec","useful":1,"cool":2},"jJdcO2cPeeV93L1ypm6WPg":{"text":"I've heard about this place time and time again, but it's just a little out of the way for","useful":6,"cool":1},"QthBOUA0P6IMId3fpgo24g":{"text":"In town for work convention. We had an alumni party here the night before and I thought it","useful":5,"cool":4},"KkfDflT2jeAYKDqSGc-5PA":{"text":"Place sucks plain and simple the guy behind the bar is brain damaged. Sat there fir 5-10 m","useful":0,"cool":0},"ne1lSRMorpRn2yT1GcxeKg":{"text":"So my previous review for Lucky's is a lie.... I meant Lucy's but I couldn't go back and c","useful":1,"cool":1},"1o0K6dAVVo4YGNCH5iSmMg":{"text":"We went there after visiting the Aquarium, seeking a comfortable, unpretentious, reasonabl","useful":0,"cool":1},"lWNbjMgBhG9NA00MApRX-Q":{"text":"Lucy's has felt like the place where everybody knows your name - truly the \"Cheers\" of New","useful":0,"cool":0},"udPKtTcG0NUW5A2pI3xS7g":{"text":"Stopped into this place for tacos and chips.  The food was solid and I appreciate anyplace","useful":0,"cool":0},"unPf0LY80ZujZw2KB_dIcw":{"text":"Host and security were extremely rude to us, kept threatening to kick us out for no reason","useful":0,"cool":0},"GYyh8DpbxBYpOPIAnpY2BQ":{"text":"Great Lucy Burger! All 6 of us enjoyed our food! The menu is a little similar to Hard Rock","useful":0,"cool":0},"7mhsDBnrrzev-hgLJfvZeg":{"text":"Live laugh love Lucys! Liz has been our waitress and she's so great and so attentive !","useful":0,"cool":0},"DZ7wyVF0IAMpnmHEtcGXQg":{"text":"After a long day of walking, me and my buddies or wanting a good burger and stumbled acros","useful":0,"cool":0},"n_cqZh0OX-G-Oq7fVc6-dw":{"text":"Super dog friendly! And my bucky boy loved their chicken! Service was good, they brought o","useful":1,"cool":0},"uHiprv5Q5_cwSZW6sak09A":{"text":"Food was good, but 5$ for a bottle of Miller Light is ludicrous.  If the food was amazing ","useful":0,"cool":0},"WzPynl5ZIH4RpojP6UouEg":{"text":"Having been to the Key West location a few times, the New Orleans version was a bit disapp","useful":0,"cool":0},"GzL3Vq7DvLP4nDD51_1cZg":{"text":"I love, love, love their fish tacos. Usually like to sit outside because inside can be too","useful":1,"cool":0},"z0cJK5N_5pN1Pe-P5L_EMw":{"text":"Chelsea is the best bartender there! She's amazing! We always look forward to seeing her w","useful":0,"cool":0},"9y8LMwwMz9j3ChX7VPLWCQ":{"text":"Nice casual place with a big bar. If you are in jovial mood and want some creative cocktai","useful":0,"cool":0},"p57WDEe87UeR9VnxmVKvoA":{"text":"Service AND food are phenomenal!  They were so welcoming when we visited from out of state","useful":0,"cool":0},"n96BVl7ldJzg5BxC-OKZFg":{"text":"Let me start by saying my last week experience February 28 was great Reagan and Liz did an","useful":0,"cool":1},"JMCxDEUR1u8YY0H2lTctEg":{"text":"Service was ok- great nachos!! Not a great selection of beers, but found a halfway decent ","useful":1,"cool":0},"e0ZXXTXv0F_DXsJxpZiezQ":{"text":"Love love love this place! Had the Cabo shrimp & grits and I can now say it's one of my fa","useful":0,"cool":0},"soIr9cBXn0EEiU9UkfA0ig":{"text":"Seafood tacos are great! Place was not super busy, so service was very quick. \n\nI ordered ","useful":0,"cool":0},"2hO-gfxS_Xu9p8FiFi6xfQ":{"text":"After a year of being almost a \"D- local\" at Lucy's Retired Surfer Bar in the warehouse di","useful":4,"cool":1},"3FffL7smn7BcKIGw9zV4WA":{"text":"Love  love love Lucy's so much!!!!! Fun spot to go anytime. Great place, great location, g","useful":0,"cool":0},"rhZXIXWGEfZTnO48Fri5TQ":{"text":"Went in here after drinking all day at the local breweries and let me tell you- the place ","useful":0,"cool":0},"IXUiOFBgvVCMhs1HriDIeg":{"text":"The bar was dirty and the manager was extremely rude when we wanted a football game beside","useful":0,"cool":0},"DRNjJCaIslXm9uirO-Nhlg":{"text":"Ok so full disclosure, food wise I think this place is more along the lines of a 3/3.5 sta","useful":1,"cool":0},"tJWX1FS_8ASWsFwSe7S6cA":{"text":"Stop in here when in town\nMight see a Pirate or a wedding gown\n\nSit at the bar and they as","useful":1,"cool":2},"UinzoH5XgO7ZERJ2tY1eFw":{"text":"This place was great! Not only do they have REALLY good food, but they are also dog friend","useful":0,"cool":0},"NkYzgcScAqKLl_sFmm6Oig":{"text":"Lucy's is my go to for drinks in the Warehouse District! It has a fun surfer bar theme and","useful":3,"cool":1},"1AY7jKOtorr_CX2I-GsSzQ":{"text":"Had dinner Tuesday Feb 27 and it was awesome!!!  I especially appreciate the southern hosp","useful":0,"cool":0},"CqpCJWudmpTmuYfn-5AyKw":{"text":"A classic sports bar with bar food. Their nachos were good, but their guac was too salty. ","useful":0,"cool":0},"vNrzL6nMSpzH5L6ifzE2Hg":{"text":"This is one of the first places we went in NOLA and it didn't disappoint. The staff is fun","useful":0,"cool":0},"expt2hE6kmiUXQCG6gmkZg":{"text":"Love their tacos on a Tuesday! They have great specials. They have changed ownership since","useful":0,"cool":0},"GQYIoGECfi1_k6-8ktUivA":{"text":"Came because of hotel folks and these ratings -  I guess you need to drink lots of beer to","useful":1,"cool":0},"r7Q1wNyaihDMQ2hm1atqZg":{"text":"This is a very popular bar... As such,  Its crowded...Decent food , cool crowd....it's wor","useful":0,"cool":0},"Ee5q-Bz0RzYtUwB55zCiYA":{"text":"The food here is good, but the people and the wonderful way they treat pets puts this plac","useful":0,"cool":0},"I19Qdds5p6JhWphe9iTOdw":{"text":"Why 3 stars? Because it was standard bar USA.\n\n   ---   ---   ---\n\n-Lots of loud, drunk pe","useful":2,"cool":1},"dLUIFevaRHurfW2gC06zjQ":{"text":"Nice place but menu was limited.  They ran out of alot of items. The TV service is extreme","useful":0,"cool":0},"ftzmYnHDDOcAn4BzDtBd9Q":{"text":"Atmosphere is great. Bar tender, too. Our server had zero for a personality. She never ask","useful":0,"cool":0},"-Q7-A9ROv-HSDr_emd6Yug":{"text":"Best nachos on the block! Sober, drunk or blackout id suggest getting you some nachos from","useful":0,"cool":1},"_FPi8TrvTCTshtspQLieLw":{"text":"It was ok, It really is more of a bar than a real restaurant so don't expect a great meal,","useful":1,"cool":0},"QB_7jpZ6vMDf7z9BVpPR3g":{"text":"So much dang fun! Get the shark attack and if you're brave the scorpion shot. I've been co","useful":0,"cool":0},"b_wPJiwCViYQ4UqVoGm6fQ":{"text":"Great fried fish sandwich. Kudos on the French fried and the blacken fish taco. The fish s","useful":1,"cool":0},"lJzvlVz9IkiKchL0oJVQBw":{"text":"Lucys is a great place for a night out or some day drinking during the game! Its an easy g","useful":0,"cool":0},"cLtE1jciE-QTIk4_Izsm3w":{"text":"Lucy's wasn't our original plan, but was given to us as a recommendation when our planned ","useful":4,"cool":2},"OYfOlxCp3Qpx-t9hFPcJeg":{"text":"We came here at 5pm on Monday and the place was lively with customers at tables outside an","useful":1,"cool":0},"49BwP4L43oh3jvyCmQ6rSA":{"text":"ALLSPICE IN THE QUESO? Okay, so I'm a creative guy, but c'mon where are the chilis, garlic","useful":6,"cool":3},"BSFoFBKN3nIy2DvrZWRxRQ":{"text":"The new owners of Lucy's has improved this place big time. Its no longer just a place to h","useful":1,"cool":3},"qDy_Lk4-SF9rFODpCJUjwQ":{"text":"Listen. It's New Orleans and you have infinite options. You should do what feels right, an","useful":2,"cool":1},"fXGuPuz7EyHrUTJbupvRdg":{"text":"Nothing special about the food. Draft beers were top dollar. No need to try this one again","useful":0,"cool":0},"rY6A2tFqmgqAEjQCoDyghg":{"text":"Overly salty guac, skimpy quesadillas, and poor service overall. If you are looking for a ","useful":1,"cool":0},"WTjp8B2SHPrtkrwA10dJ-w":{"text":"The most fun we've had as a fam in a long while!\nChose this place because it's known to be","useful":2,"cool":2},"naeQmfygJvecHxjTreAW0Q":{"text":"Very nice layout but food was very mediocre. Took a while for our orders to be taken, but ","useful":0,"cool":0},"hR_vQyWE-VZOBlRa76vnFg":{"text":"If your ever in New Orleans stop by Lucy's. This place is great. The flamingo cocktail is ","useful":0,"cool":0},"9DaLkZQFqwSTExPomjCN_A":{"text":"Delicious food, great service & super fun atmosphere.  We stopped in for a quick lunch & t","useful":0,"cool":0},"cq475jZUCsO3yE5uKzoGag":{"text":"Another stop that was a requirement for me. I love the novelty of Lucy's \"Shark Attack.\" I","useful":1,"cool":2},"aHUjPAWBtchs-N-pFxeFJA":{"text":"We came here because they allow dogs but the hostess was the one cleaning the tables and t","useful":0,"cool":0},"7w6t1ga52CBX59FfFKvwAQ":{"text":"My wife and I went in on a Saturday night, first time back at Lucy's in a while.  Sat in t","useful":0,"cool":0},"LQtC5qywYoulgrhr7Shm5A":{"text":"This place is a Dive bar that's tends to college kids and tourist.  The drinks and food we","useful":1,"cool":0},"8cJXmi6YsoeywYyQIpXsqg":{"text":"What a cool place to have a great frozen drink and some good food. \nWe were walking around","useful":4,"cool":4},"oekC1kcQ7AFs1E3HXqt36A":{"text":"We decided to come here as it was one of the few restaurants over by our hotel in downtown","useful":0,"cool":0},"I9IY1rtduK_1mo_CX0TIUw":{"text":"This place is so cute. Their vegetarian tacos were awesome, ordered without ranch and fres","useful":1,"cool":1},"-4Kg8kEsNIYyzZR9vn7elw":{"text":"The hot Westbank guy bartender is kinda of rude but he is still hot so maybe it's not that","useful":0,"cool":0},"jJ72qjhMCY8AKvv3O1VdUQ":{"text":"My server recently was so rude. Every question I asked she disregarded and ignored. It rui","useful":0,"cool":0},"YwN-Jd1scK7lGFK0__E5RA":{"text":"This place is soooo cute! So I went here when my brother came to visit with some friends t","useful":0,"cool":0},"XnKWmP7zzPSvZNjXWL7YnA":{"text":"This was a decent run of the mill uncrowded spot to eat during the weekend of the Essence ","useful":0,"cool":0},"OftajefL766-F3VceOMT7w":{"text":"Great corner bar & restaurant in the Warehouse District!\n\nMy daughter & I came upon a smal","useful":2,"cool":1},"cu5Q1EFo6n4BSQVYAXm5wQ":{"text":"It's super cute and a good vibe for a small friend group. The music and drinks make the re","useful":0,"cool":0},"8zvzYlFw95SnMNZ8oPEvPg":{"text":"Would never go again. Food was sub par at best. Service was terrible. Felt disrespected by","useful":0,"cool":0},"KOG4V4QDnbToIk2RDpZJfg":{"text":"A little bit divey but I took Yelp's advice for the fish tacos. BEST idea y'all have given","useful":1,"cool":0},"QYD894Xbxhq4nsFaVRM9rg":{"text":"Stopped in on my walkabout because I had the day off due to weather.  Walked in sat at the","useful":1,"cool":1},"OEvhA58o_eFlvND9qzar5A":{"text":"Bottomless mimosas on the weekends! Restaurant has received some much needed love, and is ","useful":2,"cool":1},"7brZALKW_vHnzXwVmHABlA":{"text":"This is solely a \"fly by\" bar for me. \n\nThere are certain bars in & around the Quarter tha","useful":11,"cool":10},"9Rk8JKrLmxSVYBDu-0AWgQ":{"text":"Lucy's is great for the weekdays and day drinking, however, they get way too crowded for m","useful":3,"cool":0},"4F2WpjY5Ovx0zS3ENz2qng":{"text":"Great place to pick up some cheap drinks and tacos right off the real hustle and bustle of","useful":1,"cool":1},"F1bpaD7DbZ-4mo6P68kRRQ":{"text":"Solid inexpensive fare and great drinks. The bartender, Megan, rocks!  Nachos, burgers, qu","useful":1,"cool":0},"eI3ZElTKLCtjNttUaQm6Vg":{"text":"Went there on taco Tuesday with a group of co workers. Great tacos! Great drinks! I had th","useful":1,"cool":0},"sCur4c6NgKCxHQiYlzDh0w":{"text":"Lucy-Goosey\n\nReason:    It's just there and there everyone is. Aka: where to go out before","useful":1,"cool":2},"kFMyttvu4uWlEcSZHwmyZA":{"text":"Second time here...love food and atmosphere!  Tacos are delicious and service staff friend","useful":0,"cool":0},"HSCxGVUNgmoHN-CXm6YjrQ":{"text":"if you're from SoCal and you're craving some fish tacos- go here. They're good.","useful":1,"cool":0},"avtiVNGV2OSJnhltb3lx6g":{"text":"Amazing food and drinks!! We went for brunch and it was so good! The whale and shark drink","useful":0,"cool":0},"ZJt90zCQB0Xqo1dyZTumLQ":{"text":"Staying at the hotel across the street and I dig this bar. Cheap drinks,  big pours,  real","useful":1,"cool":0},"Vr5S_lu-Tb0aEUN78zvx_w":{"text":"We met a guy at the airport who suggested this place, he mentioned Mexican food and we wer","useful":2,"cool":0},"uJRgOyLPvw40rTDW2aONow":{"text":"The food was great. Service could have been better since it wasn't busy for a rainy Sunday","useful":0,"cool":0},"6k0xtmlt0wWEBHS4xKAOsQ":{"text":"This is an average for 3 visits in one day. Lunch time my companions ate and had drinks an","useful":0,"cool":0},"ecg3A3IdVMFN0l9JH0CFBQ":{"text":"Great taco place with a good happy hour menu! Happy staff that is very helpful. Tacos were","useful":0,"cool":0},"8824pVihfqWeOgCZY7NAIA":{"text":"Our plan B when the restaurant we wanted to hit had over an hour wait. This place had no w","useful":0,"cool":0},"yVqX3JZbWgiJ1ttogUnp5g":{"text":"Service was awesome. Fries were crispy and seasoned well. Cuban sandwich was drenched in m","useful":0,"cool":0},"LqttUWog_BVp57K9LDZaaA":{"text":"In NOLA for work; grabbed takeout nachos on recommendations from colleagues. Wow! Reputati","useful":0,"cool":0},"B1s-eDmkYWpZaop8P2cAzw":{"text":"I would give it zero stars if I could. Our group was from out of state and I was the only ","useful":1,"cool":0},"naGzBClA-3t8hmdthIPybg":{"text":"Lunch for my wife was the Juicy Lucy Cheeseburger and she loved it.  The salsa for chips w","useful":0,"cool":0}}