{"GT8F1szlDii8pFA0fjYNfw":{"text":"Great find when we were walking by for brunch!  The Brisket Fries were amazing. The Boudin","useful":0,"cool":0},"eeAi21m3PqzPPqeahqMf0Q":{"text":"I've been waited for more than 20min but none even took our order. It looks like waiter/wa","useful":0,"cool":0},"DdzZ2bXze-Fv75BE4QDKlQ":{"text":"Typical bar food with an upscale twist.  All of our dishes were well seasoned.  However if","useful":0,"cool":0},"D8YoyNaHXBa5bkkFxdM-1Q":{"text":"We went here tonight around 4. It was pretty empty since it was an odd time. Everyone in m","useful":2,"cool":2},"9MlxAJQDRSN279QWqeKusA":{"text":"Only 6 items are on the actual menu. Very disappointed. Poor service. No one seemed to car","useful":0,"cool":0},"cVIpopt7nkkuaA24Auhalw":{"text":"Lucky you to have stumbled upon this life saving review. I can't believe what I was served","useful":0,"cool":1},"kozTajsTjKXx3iwogaNSqA":{"text":"Yeah... I didn't look at the reviews before I ordered. This is a great patio bar. Sit here","useful":0,"cool":0},"tJ-FCJbdREuRjxAPvoJmLA":{"text":"Huge place, but I really wish that they had at least one beer on tap that was theirs, espe","useful":2,"cool":1},"Hoi3OzW6fYdKB9c8ZOThmg":{"text":"I really liked this place. Great view, great atmosphere, but started to get really crowded","useful":1,"cool":1},"2VYLKXeg-TGSue1JyaiNwg":{"text":"We were the first in... And the last out. The service was horrible, excruciatingly painful","useful":1,"cool":0},"4TYbAmDameZ93FS4vXaD3g":{"text":"Not good, skip this one. Great view, food subpar for NOLA standards. Need to step it up if","useful":0,"cool":0},"Jz44acfK4-OMUX0I8RB9SQ":{"text":"Atmosphere was great, the service was solid on this visit.  Local beers served on tap were","useful":0,"cool":0},"CcdlGPKddtjmYZ_oNeuLRQ":{"text":"Service was incredibly slow, especially considering it wasn't that busy. Food arrived cool","useful":2,"cool":0},"5tl94D_3Tq-CvyozC8z9Yw":{"text":"This is a staple French quarter spot. Very casual (couches, live music, cheap beers, etc.)","useful":0,"cool":0},"ta8WdKxGsN9kMLKgs6mdjw":{"text":"The food and drinks are good, however we went for brunch on a Sunday and it took way too l","useful":0,"cool":1},"qsIhuC53SURqKZc4z9uIQg":{"text":"Very good food. Nice variety. Service was very pleasant. A great Oyster Bacon Sandwich. Gr","useful":0,"cool":0},"HsGxAO46N-1CKsZLfYyp4A":{"text":"Disclaimer: it seemed the wait staff was shorthanded. Not disclaimer: the service was not ","useful":0,"cool":0},"HYqARd7EpT_z9LBJZH9ZtQ":{"text":"Had some local brew here. Leah was very knowledgeable about all on tap and very informativ","useful":0,"cool":0},"YmaEweG2LaTW3-3fxV5nNw":{"text":"The food was good but a little pricey. Unfortunately there was one person working downstai","useful":0,"cool":0},"AT3Ld4zL86CHS4V6y8dHlA":{"text":"Delicious food, friendly staff and a great view of the river. I am pleased to say that the","useful":0,"cool":0},"Nc8n1ZL1b15yUKLnNn6kVg":{"text":"Came a bit early before our ghost tour on a Monday and told the server straightaway what o","useful":1,"cool":0},"RAaPjHMWEl3iPpJkbhemSQ":{"text":"Stopped in looking for a late afternoon lunch.  There were people sitting at the bar, a ba","useful":0,"cool":0},"vm6fp0smBNH_B8Ebknbudg":{"text":"Food was lukewarm and bland...service was slow and shoddy. Wouldn't recommend it with too ","useful":1,"cool":0},"UKwGYb454ijS3ZtS1YqEcA":{"text":"The bartenders were WASTED!  They were more interested in pouring shots from the bottle di","useful":0,"cool":0},"7eg1itY9Mx6-xLrdL0NE_Q":{"text":"2 words - EXPENSIVE BEER! Beware, because I never thought 2 pints of Abita would come to $","useful":1,"cool":0},"suzLjjiN3ICNTPl-0Ggt2g":{"text":"I frequent this place for Friday happy hour. I am not sure why it's not busier than it is ","useful":4,"cool":2},"JbtmQSWe193KJfmnfOYW-A":{"text":"My friend and I stopped by here for a quick beer in the middle of the afternoon on a Monda","useful":0,"cool":0},"E364OwZp8l0iWK50DnGTTQ":{"text":"Our bartender Dante made the experience for us. \n\nFirst time visitors to New Orleans, my b","useful":1,"cool":1},"u-rSPzjnKxJUgPssI1zNXw":{"text":"menu not that big.  \nhard to find since whole buiding says Jax brewery, but it's the size ","useful":0,"cool":0},"5TP8gub_n0j_WIbb6diG-A":{"text":"My boyfriend and I were wanting a place to sit and relax while enjoying some fries or some","useful":0,"cool":0},"mo77mmUUKWjBW0I3MckjpQ":{"text":"This place was very disorganized in its layout and it was very hard to distinguish who wor","useful":0,"cool":0},"SpMLwfGte0EGtMZpik3Zqg":{"text":"Lettuce wraps are very salty.  The shrimp appetizer was really good though. Top 40 music, ","useful":0,"cool":0},"SjgZrfGfzyaF9JlNBIJfFQ":{"text":"This place is absolutely the worst dining experience I have ever had. It took 30 minutes f","useful":0,"cool":0},"ZssQp0o_cTu86FjbOmjgcA":{"text":"We stopped here for lunch, even with the mixed reviews.  We were seated upstairs and opted","useful":0,"cool":0},"mcDgkpoJIaFl8HLe_N6iuQ":{"text":"Well I guess this place has a problem with ignoring people. My boyfriend and I walked in a","useful":2,"cool":0},"Y9g2QGnOnzDlTujZOv-Pmg":{"text":"This wasn't really what I expected. Well, actually, the downstairs is what I expected... I","useful":6,"cool":2},"LnZwcFIxuDi0lQOxwU--gA":{"text":"A friend and I ate here while we were waiting for a ghost tour to start around the corner.","useful":0,"cool":0},"UnEY_RRKnLuR19sj8Fw99g":{"text":"This is a fairly new place that opened a few months ago. It is actually a restaurant that ","useful":5,"cool":2},"Jo_loP2nhGRjKOJDEiiXBQ":{"text":"Horribly slow service- 15 min to get drinks and food was not worth it. They were even out ","useful":0,"cool":0},"Q-m4zJWurGpyGYAVRT0gNg":{"text":"I was at first excited at the thought of a brewery with some outdoor spaces, but super dis","useful":0,"cool":0},"uRQO89frFnC-SQMazRhQFQ":{"text":"This place sucks!! 20 min to get a drink and it was not busy... Food undercooked (burger).","useful":0,"cool":0},"HTD6R3ZgoVUl8DQzox7GNA":{"text":"Good location. \n\nSlow service. The waiter didn't even have a pad to take notes. She had to","useful":0,"cool":0},"doLCPnfP3-6abVizrKEI2A":{"text":"Great meal on Sunday-brisket, eggs,and the most colorful potatoes.  Pair this with an ipa ","useful":0,"cool":0},"fLQmlSFbzOy3Dk1oFH1NXA":{"text":"First off I can't stand people who only write reviews to complain about everything that th","useful":0,"cool":0},"WRFuivlfc73ws39C7PsRJA":{"text":"Super cool building in the heart of the French Quarters.  It's too bad the brewery buildin","useful":1,"cool":0},"CVoq1IT_Q9F-lLQbjWVoHA":{"text":"Don't eat at Jax's the food was horrible.. I order a hamburger and it came with no cheese,","useful":0,"cool":0},"ojW3MVzjB0SsfIZdYDGfOQ":{"text":"The bartenders ROCK. Gave us some local places on Frenchman street to go to at night and r","useful":0,"cool":0},"Uz29EANYCKuPfVFLX8uwlA":{"text":"We heard about this place on our first trip to NOLA but it took round two for us actually ","useful":1,"cool":0},"PJLA9dzRrOV5tceZahphJw":{"text":"Decided to give this place another chance now that they have been open for a month or so. ","useful":1,"cool":0},"0OliifbFinhkSpBY5JCoaQ":{"text":"Really I mean 4.5 stars.  My beaux and I walked in here accidentally looking for the diner","useful":0,"cool":0},"AZOqlOzlVPxytuFT-pZrTQ":{"text":"Came to NOLA with my bf for our anniversary. We stumbled upon this bar on our first day. W","useful":1,"cool":0},"gFpJQ01oomPF_d-0LxRa8w":{"text":"Only came here for a couple of beers- maybe an off day? The staff all seemed so miserable-","useful":0,"cool":0},"j0UfgGAh4izK7oTikQeIxA":{"text":"I'm not sure about all of the mixed reviews below, but we randomly stopped in Jax last nig","useful":2,"cool":1},"Hgy8QvNCHX_PKuGRrtAoEg":{"text":"We went here hoping to get some local craft beer, but when we were seated we learned they ","useful":0,"cool":0},"aaUDuGvxvK2uzzH_IaFnTA":{"text":"Got a flight of Louisianan beer to taste up on the top level and compare to what we are sp","useful":0,"cool":1},"DGTsc6UvMgrUY9gopZFW6Q":{"text":"The service at this place was the best I've had in a long time. The guy that was serving m","useful":0,"cool":0},"Squ1r_SxAxKVnDhyTeRl1Q":{"text":"My friend and I just stopped by to check the place out. He told me that he has been hearin","useful":7,"cool":7},"gz-xMn_GjBKSBphrS3AZ5Q":{"text":"Beer was good. The Rye had some really good toastiness to it. Unfortunately it was served ","useful":0,"cool":0},"um-25Yw2_pk45Mz7mx5QnA":{"text":"Tamra and Dominic were great and food was so good. Definitely recommend Taste of NOLA, Jax","useful":0,"cool":0},"yto0Q1nsi9vmmji1TH3kcg":{"text":"What's a New Orleans trip without beignets?  Located right next to world famous Cafe Du Mo","useful":1,"cool":0},"wUX7u836qOEspOug17Rr6g":{"text":"Just had gator balls and a few beers. Staff was helpful and very friendly. Gator balls wer","useful":1,"cool":1},"hJjZJQu8uOo6A9fDF4ca3Q":{"text":"This place is mediocre at best. I ordered an omelet and it came unseasoned and cold. Potat","useful":0,"cool":0},"JOBVJN70LP53HaWLYxFZYg":{"text":"Needs to update their menu. Their online menu doesn't match the in house menu. We took a t","useful":2,"cool":0},"xBP5SIQkiGqoKg_xHqzS3Q":{"text":"New locay to dine, drink and watch a humungous big screen! No need for thirsty Thursdays -","useful":4,"cool":2},"XZvWRafCJcB2-wk7YJtc6w":{"text":"It's weird: Much of what's going on with my life is a complete surprise to even myself.  I","useful":10,"cool":7},"bhJ_BXGvkKJOXTgxW3a-6A":{"text":"Came here for a pit stop drink. Got 2 hurricanes togo for $10 during happy hour. The barte","useful":4,"cool":2},"A7UygXeb3OrNxtxXNL3lNg":{"text":"Stopped in because it said brewery. To put the word \"bistro\" into the title of this place ","useful":4,"cool":0},"zKtMm1uUbHGaKGb-s9eaxQ":{"text":"Great bar for a little day drinking. Stopped in with my sisters and mom while doing some s","useful":0,"cool":0},"rpqIRnokAF7PnI7x0eI08A":{"text":"We were looking for beignets and coffee for breakfast the day after Thanksgiving. The line","useful":1,"cool":0},"ebxlqD_hTGWWN56jd37iQQ":{"text":"This brewery is absolutely amazing! Every beer they serve is a local Louisiana brew, makin","useful":0,"cool":0},"Pip0gSoKx3k03FB34SgiKQ":{"text":"Roach infested. Decent food. No drink selection. Bar looked cool but was totally empty.","useful":0,"cool":0},"-xl0E5fdyyZotoEFHBVw5Q":{"text":"We went there for an \"exclusive\" formal NYE party with seriously expensive tickets. There ","useful":0,"cool":0},"TXqQYT72O5D_nge8X4zt6Q":{"text":"Great time at Jax. Great local beers, great food and service was amazing Deona was great, ","useful":1,"cool":0},"j4Musr2utZ0QjtTCRHw1JA":{"text":"Here's a review for you, don't go to a haunted house tour that meets here. So lame.\n\nOn th","useful":0,"cool":0},"mi7oT5Fk0eDaGtKEvMaxjg":{"text":"HOLY COW!  Where did this little treat sneak up from?!?\n\nSo, like other locations, this wa","useful":3,"cool":2},"WTp0tg2gG_sr_CstThcHUg":{"text":"Lettuce wraps are very salty.  The shrimp appetizer was really good though. Top 40 music, ","useful":0,"cool":0},"MWUJrte7heM3K6RlHn0Mrw":{"text":"Great location in Jackson Square, friendly bartenders with a good selection of local beer ","useful":0,"cool":0},"ptqh2bzi81MfFvN3RfLa0Q":{"text":"We decided to eat here after Cafe Du Monde had a two hour wait. We walked in and the manag","useful":0,"cool":0},"PjEARAKymTTqTxXTMZKHvA":{"text":"Probably gets most business from location--not by being extraordinary.  Beer selection (on","useful":0,"cool":0},"GssUVkVGkj3QNwcbgQZgSg":{"text":"Awful service and food. Ridiculous.\n\nHad to order my drink 3 times before the server actua","useful":0,"cool":0},"_2D6S_4PEYgkDIqnQCWa0A":{"text":"We stopped in here before a break dancing show to grab a beer to go. In full tourist fashi","useful":0,"cool":0},"9BnToF2y3CdnaTE_EXYoKg":{"text":"My husband and I had drinks and appetizers here.  It is a refreshing change from the touri","useful":2,"cool":0},"MwsnslT3xLV0qPAz0DM5vA":{"text":"This place is pretty awesome. Ridiculously strong AC. Cool atmosphere. Friendly, good-look","useful":0,"cool":0},"3IyGY1dqzSNEFxK2QORt6A":{"text":"Emily provided amazing service. Manager seemed on top of things and was friendly. Food was","useful":1,"cool":0},"mUgn4YJzOXpEzqmxnHGlrA":{"text":"Stopped here for breakfast. Live entertainment.  Fast friendly service.. However, I feel s","useful":0,"cool":0},"euKMsDS17HXHniVUorjwpQ":{"text":"This venue has a small bar space downstairs with the majority of the venue being upstairs.","useful":3,"cool":1},"kKzdNAytIhirRqgGOqhNCA":{"text":"I came on a bad day, but even still I was impressed at it's diversity. \n\nWhat I mean is, t","useful":2,"cool":1},"UYk6t_1J_JWlBbbB5l1Rvg":{"text":"If you're looking for a spot to check out local Louisiana beer, this is the place for you.","useful":1,"cool":1},"8wg6OzaCI369VuxCEeGxEw":{"text":"Bartender Fay was awesome great suggestions. Great duck bomb appetizer and thee jacks plat","useful":0,"cool":0},"-pZss6-faklwvMnepeWWKA":{"text":"Had a hard time finding this place, the signs seemed to indicate it was in the shopping ce","useful":0,"cool":0},"gZ-QCdDSgZ1Nb5AXCRsZ6w":{"text":"Huge screens, nice drink section, couches and comfy chairs, great views, good food. This i","useful":0,"cool":0},"_6qRDAKznLP7QDSvm0ZvZg":{"text":"Awful place for food!  Great game watching room upstairs, but we chose to eat downstairs a","useful":0,"cool":0},"d45TzHOu86R-FviKfcZ65g":{"text":"What a cool brewery/bar. We decided to stop by for a refreshing local beer after seeing su","useful":3,"cool":3},"Uv3hPzTkuAVSDvQiXLLa9A":{"text":"Stopped in here for a beer. There were 3-4 customers on my side of the bar who waited a fu","useful":1,"cool":0},"mHX0xBQf1UC5sJu3gs4XtQ":{"text":"A group of us stopped at Jax to eat only because Cafe Du Monde was too busy and we were st","useful":0,"cool":0},"1uaa5E_tRP338E02ojNKxA":{"text":"No longer an actual brewery. Food was merely ok. Manager was very friendly. Nice outdoor d","useful":1,"cool":0},"bG1viY2l3Llt4_vtcaDdLQ":{"text":"This was the worst experience I've had with a bar service and it all came down to the bart","useful":0,"cool":0},"5TvLOlXnxStDy6ibjy1JYQ":{"text":"Nice place to hang out and have a brew on tap. Not a huge selection, but adequate. I went ","useful":0,"cool":0},"BlAeoMUEbNsA6tLYyrOSoQ":{"text":"So it's Saturday night in New Orleans and you have a bachelor party of 17 guys, and your b","useful":0,"cool":0},"FvS9IvwoShX0aGRWA157ig":{"text":"This place is great! We came here for drinks in the afternoon after getting beignets right","useful":0,"cool":0},"dGI682Ewp8gitJYG_ABEIw":{"text":"This was the slowest bar service I have ever experienced. The bars in this restaurant were","useful":0,"cool":0},"NkoLpG0paNRPI9yPngIkkg":{"text":"Food was fine, location good for people watching, but with just a moderate flow of patrons","useful":0,"cool":0},"ta6STvPHJ8EtX0j7jD18VQ":{"text":"Stopped in when it was not very busy on a Saturday while football was on. Had a bowl of gu","useful":0,"cool":0},"g4parycTvyHj6hufPH4XOw":{"text":"I'll start with the good things. It's in a great location, right along the river, in a gre","useful":0,"cool":0},"56vs_29lzj5__kyl6y8JwA":{"text":"The Duck Bombs were to die for...and thoroughly enjoyed the bartender, Faye.  Not only was","useful":2,"cool":0},"pQf4PYRTKvLPrh_EqiuWjg":{"text":"AWESOME PLACE! The space is huge and it's just beaming with nolan's culture. Brunch food w","useful":0,"cool":0},"H4BFLpY3FHS32dGO_DkJMw":{"text":"Terrible dining experience.  The service was awful, food took an hour to come.  Ordered ap","useful":0,"cool":0},"ZL8ifL6917nnZ-t-I27S9Q":{"text":"I came here in December, technically off season. The bar is very quaint, with a great sele","useful":0,"cool":0},"eZmeZmVFmY6PHivQba92Ew":{"text":"The waitress is friendly, but the drinks are poor (soda water for the \"special\") and the f","useful":0,"cool":0},"o6zdo8HA42k_-p-Lh7S9QA":{"text":"Came here on a Monday - first day in NOLA. \n\nWent to the bar with a great view overlooking","useful":0,"cool":0},"YuiwMh6PlDZQkH92pMjdmw":{"text":"The food is Really good!  The Brisket sandwich was a little dry but we asked for additiona","useful":0,"cool":0},"x8p-b0e1a1xy6AtfaXz2Jw":{"text":"Beer was good, bartender (Prince Eric) was even better (and helpful giving us tour guide s","useful":0,"cool":0},"T7MGaKrY_Fc5Rg-Lfl20GA":{"text":"4 stars for the club. \n3 stars for the food. \nI had the brisket which was good but the bun","useful":0,"cool":0},"5AD6z_AQld-AVHm0AI4gsQ":{"text":"Easily one of the worst restaurants I have ever been to. After ordering simple lunch dishe","useful":0,"cool":0},"4SmvymlGDGoQYmGlBbRdpw":{"text":"Service was the worst! If you are in hurry do not go here. The food was ok and the drinks ","useful":0,"cool":0},"9dBlRzjWQW-3SsRlqK7i7Q":{"text":"Came here for a beer during a Mardi Gras morning (shhhhhh!). \n\nI seek the unique, and had ","useful":0,"cool":0},"FhFbSR2yH892v4f6SbrWdg":{"text":"Amazing concept for a bar/restaurant/nightclub.\n\nWe came in to get out of the heat, and th","useful":1,"cool":0},"BKw232uAGbuAJ8JtbmENmA":{"text":"This place is always hit or miss. As a over 25 year old I feel like I am too old for this ","useful":1,"cool":1},"9wy2Zk_E5sgbQjTYJqj-JA":{"text":"Fantastic atmosphere! We sat outside and had drinks looking out on the Mississippi River. ","useful":1,"cool":0},"hGD23EUsZTcwK3eAFpoUXQ":{"text":"Great selection of the local brew Abita. It's a pretty big place and has an upstairs. We w","useful":0,"cool":0},"XfzC5yLn0bYJ2iZ5gYznHA":{"text":"Stopped for lunch in second floor so we could watch the activity on the Mississippi. Great","useful":0,"cool":0},"xTZNs6wx-A4DxD26Ug9KTQ":{"text":"A storm had just come through when we ducked into this place. We were not greeted by anyon","useful":0,"cool":0},"4qdb7yIhHcdFn-litKCb-g":{"text":"If I could only use one word to describe this place, it would be \"Atrocious\". \n\nAlthough w","useful":1,"cool":0},"CFJnpUqYMnVskIPpNrmoMQ":{"text":"I'm not really sure if I like this place or not. I've only come here once and will probabl","useful":0,"cool":0},"arJSIyP6OmaXEgESKyGTkA":{"text":"Found the food to be uber salty. The seafood pasta wS great and they make a mean brisket. ","useful":0,"cool":0},"5aHk3clab4eSjuQZzXD-kg":{"text":"This was the worst restaurant ever! The service was horrible, the food was cold and even a","useful":0,"cool":0},"44H6yOhBFzPD2hMTP_lF7g":{"text":"What a shame, I ordered the waffle and it came cold. Strangely the beignets were still war","useful":0,"cool":0},"NRIakFDPkvQKhRsb-v1ejQ":{"text":"They should take the word brewery out of their name.  I stopped in (without consulting Yel","useful":0,"cool":0},"cZrmhDYcwxnjygIN4rDWHw":{"text":"This place is great! Awesome beer and the people that work here are top notch! Ramon the o","useful":0,"cool":0},"Moh5-3n7gV-3m6CBXNUYkA":{"text":"Inexpensive drink specials and one of the coolest upstairs lounges I've ever seen. Lots of","useful":1,"cool":1},"a0GnCOLEaMvRl_mtn8xHkQ":{"text":"Another tourist trap. Don't be tempted by its great location, in the center of the French ","useful":0,"cool":0},"id_Wcy2OMDYxw4SZ9DUNKA":{"text":"Mediocre food, but great location overlooking the riverfront.","useful":0,"cool":0},"TTow03IIM3a7gz3Ce94k4A":{"text":"We went here for our wedding anniversary dinner & had a terrible experience. We waited 10 ","useful":0,"cool":0},"d6JkaHb2UfoUM4KV0uZEig":{"text":"Tourist trap. Paid $17 for a beer & a mixed drink. Better places abound.","useful":0,"cool":0},"qJY9lXgSOvZD4SGuteP1Zg":{"text":"Came here for a late dinner. Staff was friendly & attentive. Bloody Mary's with pickled gr","useful":0,"cool":0},"vuy7-MlbXVdDnGry5J0y-A":{"text":"This was a great place to watch some college football! Great atmosphere, great food, and T","useful":0,"cool":0},"WsEu5u0nR40jE6zyRRbq1A":{"text":"We made a reservation for new years eve WEEKS in advance -- 8pm 12/31/12. We got a call at","useful":0,"cool":0},"wwHwaHdBnSihocnzCbxOyA":{"text":"Jax is a really cool and hip spot to grab some drinks in the Quarter or watch the game or ","useful":1,"cool":1},"7SXjEtHOV1mBoYLI7Hfp8g":{"text":"Awful experience..... Went  to watch football and get a burger. Waited over an hour for th","useful":0,"cool":0},"OEGTBOr5C8cYFFl-ADHdFQ":{"text":"The brewery concept is very cool but , the service is very poor . This place is very unorg","useful":0,"cool":0},"ALypyeiuydN7qXWphPGvLQ":{"text":"I wish this place didn't ignore my friend when she tried to order. I wish my beers were be","useful":5,"cool":3},"sP_tjKlkBeBYFum5q70I7g":{"text":"First impression: commercialized restaurant. Definitely a tourist joint, but the decor and","useful":1,"cool":0},"x2oFZKuHJxpUDQZPs5E_mQ":{"text":"Beer list was decent, food was decent, outside seating was really nice.  Waitress sucked, ","useful":0,"cool":0},"TcaTVUkkDN2VBkFzdgyTvA":{"text":"My wife and I were on a weekend vacation in New Orleans and we saw the huge Jackson sign w","useful":2,"cool":1},"8sI8Fu0w2Zm0mUhMi6qftQ":{"text":"We bought tickets for the Lance Gross and Laz Alonzo event during the Essence Festival wee","useful":0,"cool":0},"UTYtUj-YYAXWaOr4M1oqaQ":{"text":"Minus one star for the 18+ crowd. Just not a fan of being surrounded by uber young, sloppy","useful":6,"cool":3},"fSOeIUAtqVTs-dv7ZrJ2og":{"text":"We went to Jax for dinner and were waiting at the hostess stand for some time. Finally a s","useful":1,"cool":0},"pKFaflnTJ4HYimwbQA353Q":{"text":"This bar was not my cup of tea. And it almost wasn't my pint of beer, either.\n\nWalking dow","useful":3,"cool":0},"T1O69jF4HMYJc6ZMI8zWvA":{"text":"Saw a sign for shrimp and grits so we had to try it out.  The service was friendly and fas","useful":0,"cool":0},"-hlg7am5WPIN5TkOPDX-ZA":{"text":"A group of 12 of us ate lunch here during a bachelor party weekend.  The service was very ","useful":0,"cool":0},"DF_ymQtHDjm8si3KWOGayQ":{"text":"Want to dance? In the Quarter? Really, really big group of friends? Jax Brewery is your be","useful":8,"cool":6},"Co2e-5myh3X1Yqm3tbdkQQ":{"text":"Stopped here on a very long bachelor party Saturday.  Most of the group (about 12 of us) w","useful":3,"cool":2},"jCNmgRcTR6nskg3St4XacQ":{"text":"This place is clean, near the central corridor and has an AMAZING seating area upstairs on","useful":1,"cool":2},"MeEthkGwfhsfo5FhkQNhdw":{"text":"For a New Year's Eve dinner this was an acceptable restaurant.  We had reservations and ar","useful":0,"cool":0},"XCOpAPst9YAYTBGwZNlxJA":{"text":"We didn't' actually eat here, but stopped in for a quick beer.  We were thrilled to learn ","useful":1,"cool":0},"AWYQaRa6-tztOU3yPOJSYA":{"text":"If only NYC had places like this.\n\nCame during the red-dress-run many many many months ago","useful":0,"cool":0},"HeYJ5UQCSkIsnQxPhjsECg":{"text":"The space is huge and great but smells like there was a party there last night. I imagine ","useful":2,"cool":1},"gu6BW8UXkQ46QZUUOhnvbw":{"text":"Poor service. It's the French Quarter Festival and only 1 sever on. Restaurant is packed w","useful":0,"cool":0},"ZZXwDvCSTm4JGh258auADw":{"text":"The place to drink local brews!!\n\nTried a flight of beers. Sundays the place is a very chi","useful":0,"cool":0},"w60RPyApx6S3ZV5o3CKVAg":{"text":"Decent beer prices... Not a lot of options on tap.  Stopped in for a quick beer and kept i","useful":1,"cool":1},"4BUhJUnhsQgaCMTU7Szq6w":{"text":"Very expensive drinks. Bartenders each charging you different prices so ask before paying!","useful":0,"cool":0},"iq85g6jguxOF_TDD6rh2Xg":{"text":"I only had 2 beers here, somewhat by mistake since when I got my bill I saw they were $8 e","useful":1,"cool":0},"vO_rb9iPUaRzE9ycmyV1rQ":{"text":"This place was horrible! We went in for lunch, sat outside, proceeded to wait an hour for ","useful":0,"cool":0},"pCYnh2pk3Gc2PYlTFCI6zw":{"text":"4 out of 5 of us got sick from eating at this place. Horrible experience! Flies everywhere","useful":0,"cool":0},"I3CPB4gbg1umycwxiWj9Ow":{"text":"Happened to stumble into Jax Brewery one day and since it wasn't that busy, we considered ","useful":2,"cool":0},"IKyOF1ubwphW71y2Xyb6Ew":{"text":"Want to see live music in a pretty legit that isn't super crowded?\nThough the music can be","useful":1,"cool":1},"cRYr9O-5368AJzBG8YLubA":{"text":"We wandered over to Jax after taking the Jazz Brunch Cruise on the Steamboat Natchez. We w","useful":2,"cool":0},"UZapHfRnFe3UcSpTvJgNKg":{"text":"Service was super slow, but putting that aside, the bloody Mary I had here was on point an","useful":1,"cool":1},"u6LNfvb2LTS2Ip-9aNEZeg":{"text":"Steer way clear.  The manager here is a douchebag with horrible food.  \n\nI walked in with ","useful":0,"cool":0},"cR-t5hKuKePpGPnOIn4LxA":{"text":"I went here with my boyfriend on a Monday for a little French Quarter date. We both live i","useful":1,"cool":1}}