{"i8Jh5qzJJkPfkCSvCPKOcQ":{"text":"Great tour. Our guide was Mike and he was very cool and very knowledgeable. Great story te","useful":0,"cool":0},"C4cInIezlX2Tsvu1611_FQ":{"text":"I would highly recommend the mixed ghost tour with EMMA. She did such a great job and real","useful":0,"cool":0},"lJLxn0HhW1S9JelV7GHMCw":{"text":"Took the cemetery and Voodoo tour. Dario was an excellent tour guide, couldn't say enough ","useful":2,"cool":0},"RCYXNindYs-zH3tjw13U3g":{"text":"Mike is a great guide and very knowledgable and friendly. I learned a lot but was slightly","useful":0,"cool":0},"Il9gypwCtmtaE2lsMf7NVw":{"text":"Excellent your guide.  Terry is a middle\nSchool history teacher and was ideal as a tour gu","useful":0,"cool":0},"sQl83a9CCx0fPqRP3sj3ig":{"text":"Many amazing stories. Real ghosts too! Lots of lore and reality. Though the streets all ha","useful":0,"cool":0},"LTgD-mkVEaC9O6l53UPLnQ":{"text":"Wonderful history of New Orleans! Make sure you wear comfortable shoes! You walk a LOT! St","useful":0,"cool":0},"txHsu9yaAY_odPBUTG1V6g":{"text":"Mike was a great tour guide! I would recommend this tour to everyone who come to New Orlea","useful":0,"cool":0},"oVFzsqfoxWb4WsfuxvlMrA":{"text":"Do this. It is interesting and fun, especially with a group. \n\nThey stop at a bar so you c","useful":0,"cool":0},"pFyBCFYPwriXIoQ8TkUfJQ":{"text":"Just got back from a great trip to NOLA! This being my first time to New Orleans I really ","useful":0,"cool":0},"GkdfQtCBHy4DDHGvWo-Dkg":{"text":"Mike was our guide. He was very knowledgeable and easy to listen to. Id definitely recomme","useful":0,"cool":0},"1PBTTVUqQ-wsjbqa5qJpFQ":{"text":"Me and my friend were in New Orleans for the first time this past week (Aug 22-25, 2017) a","useful":1,"cool":2},"P5Q4wWvYuD1FzlvRKnG6bg":{"text":"Alan was our tour guide on the history and architecture tour. He was great, polite, pleasa","useful":0,"cool":0},"5WIeLm5RUBpP3w_22cxipQ":{"text":"this was a truly awesome experience.  The tour guide was very knowledgeable,  sharing the ","useful":0,"cool":0},"8QvWbkb9aXG0U0C0nCtgAQ":{"text":"I had zero expectations for this tour and left very happy.  Orion, or O'Ryan, was a master","useful":0,"cool":0},"BB8_g1RZ0IvOpnULTWuK_w":{"text":"Loved the tour and looking at my pictures today there's a lady on this balcony that we did","useful":0,"cool":0},"gYv7q1s7-PHlgAh7pWYFvg":{"text":"Outstanding tour, very informative and very fun. Our guide, D.J. Hayes, was really funny b","useful":1,"cool":0},"pRe8ETj6Qjfkc1OjiHN9OQ":{"text":"Mike was amazing at connecting New Orleans history with scary ghost stories, very highly r","useful":0,"cool":0},"CMzhghZPoMN97o_UcRN7Ow":{"text":"Took the ghost tour last night. Wasn't  really expecting to see any ghost, although i do b","useful":0,"cool":0},"ysDZsXXnwJnVpYbrX_RGqA":{"text":"This was the highlight of our New Orleans trip for my teenage daughter. Outstanding job by","useful":0,"cool":0},"A0BnNUi8UvwvXhrlNqLNuQ":{"text":"I'm so bad with names but I think it was Christi . REALLy nice and friendly lady! Really h","useful":0,"cool":0},"Sxq06UVRiK-qrhd825u2SQ":{"text":"DJ was an amazing tour guide with great insight into the history of NOLA. Also wasn't a ba","useful":0,"cool":0},"boVCre_6J97lG9JhIm5LdA":{"text":"We did the cemetery voodoo tour. Mike was the best! He knew so much about New Orleans. He ","useful":0,"cool":0},"DTGWe7R6y7BPDcO35j4Zvg":{"text":"I came across this tour company while looking for an after dark \"haunted\" New Orleans tour","useful":1,"cool":1},"8kLGhBW9JiwSpOM8GYzelg":{"text":"It was ok. Guide was a bit distracted. Was hoping for spookier stories but the guide Sean ","useful":0,"cool":0},"4ZFYeKSFxn_BMknL_yJ2ug":{"text":"We took the tour tonight with DJ and had a great time.  I would recommend this tour for an","useful":0,"cool":0},"H2BxMzkqvY7tPLoqRCaszQ":{"text":"Terrible experience. They had 28 paying tourists for this tour, way too many to drag thru ","useful":0,"cool":0},"EbeGow5hvhvRszVLUBcJ6A":{"text":"Had the most amazing tour given by Mike! My mom and I went to the voodoo tour on a whim an","useful":0,"cool":0},"jvcOuIQ9iZ7DnJGHXcoPjw":{"text":"Thought the tour was great and creepy all at the same time.  Learned a lot about NOLA hist","useful":0,"cool":0},"7NOfjX2ezb2fHXOhQEG_Dg":{"text":"Lazlo, our tour guide, was extremely knowledgeable about NOLA and its rich history. We cou","useful":0,"cool":0},"ZbztF-ExnIJ7uXURDLyBRw":{"text":"My wife and I have a taste for the macabre ... so this was right up our alley. New Orleans","useful":0,"cool":0},"k5_NsKNpv9CUEa-rymv4bg":{"text":"Mike is awesome! Great story teller and very informative! Highly recommend this tour!","useful":0,"cool":0},"bp0YTW5cuW6kYzYphoRuQQ":{"text":"We did the Cemetery and Voodoo Tour with Frank and he was the best. Funny, engaging, hones","useful":0,"cool":0},"Kb6XNKkVNYKs47kLG4oXSw":{"text":"Worth every penny! We booked a ghost tour from 8-10pm and our tour guide was the best! Joh","useful":0,"cool":0},"HC_ccfBaVKJPxs_ATjALJQ":{"text":"Awesome tours! Alan was the best! Great story's, very informative, good history and very k","useful":0,"cool":0},"DQka8v9sC2yLP6G7tykYxA":{"text":"Night started off a little rocky, but Mike was a fantastic tour guide!! \n\nI have to be hon","useful":1,"cool":0},"CxAuJSbJQsDwEb8qU-LrPA":{"text":"Took the Voodoo & Cemetery tour today with Christine. Excellent guide! Great tour. Highly ","useful":0,"cool":0},"XwCl6fk0FpRp_vtQpa31PA":{"text":"We went on the 8pm tour with Sean, who was very funny and clearly loves what he does. The ","useful":0,"cool":0},"oF0Dr7PgGvPKrTLRt5TJ_w":{"text":"We took the 8 in 1 ( i think thats what it was called!) walking tour and thoroughly enjoye","useful":0,"cool":0},"eizLH37mvVpWcDei2_rB6Q":{"text":"My wife and I have been on quite a few cemetery tours and found this one to be one of the ","useful":0,"cool":0},"a1_aBvs9_D41TO6Z9gU1qA":{"text":"Mike was our tour guide, and what a great guide!  He mother-henned us through malfunctioni","useful":0,"cool":0},"RM853ay8UXjGEL4OZAUKbw":{"text":"This Ghost Tour is not only educational but fun too. An activity worth the the money. Now ","useful":0,"cool":0},"7sHeU9PfmblEGakE2gS_ng":{"text":"O'Ryan was our guide. He was a master storyteller, passionate about the stories and so kno","useful":0,"cool":0},"vaCLwmtaoxuM6B6yFCMe3A":{"text":"Mike and DJ were the most informative on both tours we did..Cemetery and haunted tour..wil","useful":0,"cool":0},"Pz0vNpKC7ixbkLCjBi5CVA":{"text":"Skip it, disappointing and not worth the money, guid was good story teller but he said upf","useful":1,"cool":1},"2smjoWR55aN2wfu0ncbjqQ":{"text":"Took the 8:00 walking ghost tour with DJ on our recent trip. Very entertaining but also in","useful":0,"cool":0},"pKGJka5zzmRgFV2NQDhpcQ":{"text":"We had Peak as our tour guide. We did the 8 in 1 Tour at 7p. It was a bit chilly but it wa","useful":0,"cool":0},"k4sFd4uLLrGajfvFAgXv8A":{"text":"Our guide was great! I was very thankful that they were able to reschedule our tour for th","useful":0,"cool":0},"E_IRRwsxXbFKgJ2cPG08cQ":{"text":"Mike was our guide. He was amazing! He was a great storyteller and had obviously carefully","useful":0,"cool":0},"N3uPafbao6wZT28RGR72UQ":{"text":"5 STARS FOR DARTANIA! SHE IS AMAZING! RECOMMEND! \nvery interesting and scary! enjoyed this","useful":0,"cool":0},"U6m99Xbk7svusfkds_UYPg":{"text":"Went on the ghost tour this evening with Mike! He was very knowledgeable and kept us enter","useful":2,"cool":0},"PFBxpFsGsTZK77u4vVBhUg":{"text":"My husband and I really enjoyed this tour. We were very lucky to have Dario as our guild. ","useful":0,"cool":0},"DlHoCJbtUKqeoo_xSR90Bw":{"text":"Not worth it! Our tour guide was super soft spoken and not engaging at all. It was sold to","useful":0,"cool":0},"Aa62K4I04Kyg-BwALzRpXg":{"text":"Enjoyed the walking tour with Peak (Sarah) very informative and passionate about the infor","useful":0,"cool":0},"6nQ8mF56XF9Yxzm6DYalkg":{"text":"A few weeks ago I took the Ghost Adventure Tour and I couldn't be more satisfied with my t","useful":0,"cool":0},"sT4Hymbl7ELy1dUYLyVxwA":{"text":"This was a two hour walking tour so bring your walking shoes.  Our guide, Alan, was quite ","useful":0,"cool":0},"sXwdlYQbC7HWZ_i9PnOp0w":{"text":"Great way to see parts of the city that would otherwise be missed. Our tour guide Justin w","useful":0,"cool":0},"zjRSbOtCpCdh-5ZGqqN2rA":{"text":"We picked the \"Ghost Adventures Haunted House\" tour because of the solid 5 star reviews an","useful":8,"cool":0},"E997T5aiqmq_cpjAK25K8g":{"text":"Had a great tour! Our guide, Tommy, was first rate. He was well-spoken and engaging and a ","useful":0,"cool":0},"o9NeuJSRDBsAKHCE9k5z6w":{"text":"Sean (Shawn, Shaun?) was a most excellent tour guide! His historical knowledge mixed with ","useful":0,"cool":0},"aeGBoYEj5LvpsYj7u8IbmQ":{"text":"A fun way to spend a couple of hours. Although this was billed as a ghost tour, it was rea","useful":0,"cool":0},"62wIkKw09zoyVY3e5JsILw":{"text":"We had the pleasure of taking a tour with Shaun tonight. He was absolutely fantastic. He w","useful":0,"cool":0},"eKhZNg2o60bW-GfzY2T7PQ":{"text":"Sean was a fantastic tour guide with infinite knowledge of the City/State history! We had ","useful":0,"cool":0},"ILWIi3cWy_vXEljxQXtt3w":{"text":"Fantastic, educational and comical tour with our tour guide Mike! He was able to answer ad","useful":1,"cool":1},"l_SjbR9jndTZApL6rTJdnQ":{"text":"I had a GREAT time on this ghost tour. Our tour guide was very funny and made learning abo","useful":0,"cool":0},"QHxdggkFZO1DcKw8dWN9ZQ":{"text":"I signed up to the Voodoo and Cemetery tour not knowing what to expect and was so happy wi","useful":0,"cool":0},"TsmXE7jmjBLqj7NZUp3ezA":{"text":"Mike was an amazing tour guide who not only spoke with confidence and proficiency but was ","useful":0,"cool":0},"rySXzfkP0k2y6Su6U-3bVw":{"text":"Mike was awesome on our Cemetery/Voodoo tour. Not only was he very knowledgeable, he was v","useful":0,"cool":0},"sVSRW3WimedNMFt6CviL2w":{"text":"I'm always trying to learn more about my city and so I figured a walking tour would be fun","useful":1,"cool":0},"0BEQzDiuqGp_je3LeIvngQ":{"text":"Extremely informative and the tour guide was awesome. Lots of walking so be sure to bring ","useful":0,"cool":0},"CKQPQlachF-S8cZ92uf8Jw":{"text":"Our tour was freaking awesome.  Our guide was very knowledgeable of the history and even h","useful":0,"cool":0},"tY3-kRO6bNPvDgUDh7wScw":{"text":"Took the Haunted House tour with DJ. He was awesome! The most knowledgeable, relatable and","useful":0,"cool":0},"BEvQ7uP1-AF_-Stlnh0YEA":{"text":"My husband and I went on a tour with Mike and had a blast. He was very informative and fun","useful":0,"cool":0},"OkF94VcSBhIo05gcRmgR0A":{"text":"Alan was our tour guide for the French Quarter history tour. We couldn't have asked for a ","useful":0,"cool":0},"O6cTgfpmhuBPFfpGEqJqUw":{"text":"This was a great ghost tour. Our guide, Terri (Terry?) told us she's also a middle school ","useful":5,"cool":4},"70wIorqZ0XTeLWBJ1NtxNg":{"text":"Ghost tours are one of my favorite things to do in the Crescent City. We did the 8pm tour ","useful":0,"cool":0},"Q01DpjSTxaqpEn2PFc7HQQ":{"text":"Really great tour! Had a mix of gory and fun ghost stories! Mike was great, super knowledg","useful":0,"cool":0},"2p8PMl2CTSxn_NjhFRc67A":{"text":"They were very rude and unfriendly on the phone because I was Deaf requesting for my accom","useful":0,"cool":0},"Hzf1Uy0g604nl8PiHiEqWg":{"text":"Thanks for a great tour Mike. He was so informative and a great storyteller. A lot of hist","useful":0,"cool":0},"607vb2W1_EPHoI_Uo0djbw":{"text":"Sean was our tour guide and he was fantastic. He was an expert story teller, mixed humor w","useful":0,"cool":0},"ZCimAc99Y-O4q668tQ-bDg":{"text":"My boyfriend and I came to New Orleans just to learn about the loads paranormal history th","useful":0,"cool":0},"J2PHKSq0v0W0_Yl0uxHGig":{"text":"Mike was such an awesome tour guide! I feel so lucky to have been in his group. He was so ","useful":1,"cool":2},"EINyJe9tG2P-UGk6_dVsBA":{"text":"My 10 year old and I took this ghost tour, with Alan as our guide, earlier this week. It w","useful":0,"cool":0},"7O5l7RXa41L3O5p75h5IUg":{"text":"Great tour, would highly recommend. DJ was an awesome guide. Went on week day, he has a gr","useful":0,"cool":0},"E9PZgqz4nXxP3JzG-JG9uQ":{"text":"Mike is an awesome tour guide. He is articulate and very knowledgeable. We (all four of us","useful":0,"cool":0},"F2tMWA4v0Yq1DATC6yHefg":{"text":"Had a great time learning about this fantastic city and being enlightened about Voodoo. We","useful":0,"cool":0},"LPE0dyXnhvF52WNriW9l0w":{"text":"Alan was super knowledgable about all the history and the stories he told. He was also ver","useful":0,"cool":0},"hqKnnc0vkJ8lODhRDT_2fA":{"text":"DJ was a great tour guide! Energetic and very informational. Definitely recommend him - yo","useful":0,"cool":0},"c_JjV5GdouyJQmQREQv9cg":{"text":"This tour was awesome!  Dario was our guide and it was a great time.  Learned a lot and it","useful":0,"cool":0},"wHeDO-hgWTAlNBdQkXTLBg":{"text":"We booked a ghost tour on a bit of a whim and were VERY impressed!  Mike was knowledgeable","useful":0,"cool":0},"3GR-kKW1Qo2P6YBE0gKxHg":{"text":"Awesome tour, highly recommended!! DJ is the best guide, absolutely great story teller, hi","useful":0,"cool":0},"ChuTEdqTY6U3AgKJAh9U9w":{"text":"Next time print a list of the people that are going. Or at least don't overbook on the web","useful":0,"cool":0},"pwENDyX8UosI4DCcztUVHQ":{"text":"Over two hours, our guide, Tyler, led our group of twenty swiftly through the alleys and h","useful":1,"cool":0},"Y3Wrq-sJ3eLhHyGh4lbpWQ":{"text":"We took the Cemetery/Voodoo Tour with Peak in the middle of a monsoon (not really but we w","useful":0,"cool":0},"UaepKzbT-8g4nYlHbWl62w":{"text":"This was easily the highlight of our recent trip to New Orleans. Our tour guide was fun, k","useful":3,"cool":1},"XUno4LSZI3fRQACkj7Ld3w":{"text":"I was on a trip to New Orleans with my teenage sons this past week.  We started our trip o","useful":0,"cool":0},"14AA9xJ_sBMMHKScdf0I0A":{"text":"Second time with this tour but wanted to go through again because I enjoyed the first time","useful":0,"cool":0},"tRMVLMNiMXGIYVCq4tGnGg":{"text":"Our tour guide Toast was great very knowledgeable and entertaining. Might have a future as","useful":0,"cool":0},"iCgobrdIJcN6g9g9jGyHEQ":{"text":"This was a really fun experience. I was hesitant because you see a million flyers and adve","useful":0,"cool":1},"e49wGFk7pbhUZVWaiE1uSg":{"text":"Peak was an amazing tour guide on the cemetery tour. She knows what she is taking about an","useful":0,"cool":0},"Bu1QsvBEeB9H0BQUM8_pxA":{"text":"My daughter and I went out with Peak on the Voodoo/Cemetery tour.  It was incredibly inter","useful":0,"cool":0},"gnZKXCtjld7ONsaz4O58QA":{"text":"If you're new to New Orleans, I highly suggest the ghost tour! As a lover of history, this","useful":0,"cool":0},"C0NqzQ0gqtxHzFJgabL4Fw":{"text":"Do NOT purchase a groupon voucher for them. They had the availability and would NOT book m","useful":2,"cool":0},"ItYrz4ZD02Av0yCfhFqAyA":{"text":"We recently went on both the Cemetary/Voodoo Tour and the Haunted History Tour. Both were ","useful":0,"cool":0},"QGcVzXEqg1ISAUVSduy3Qw":{"text":"First off I need to say this... the tour guide DJ is an excellent story teller, his amazin","useful":1,"cool":0},"zpHQY4Sf7qM2V0PCPkmmHA":{"text":"My friends and I took the voodoo/cemetery tour on a Sunday afternoon (5/13/18)  at 11am. O","useful":1,"cool":0},"2mNCqykpxpjOnSx3e6Oxow":{"text":"Maybe a little pricey walking tour at near $30, but tour guide was very knowledgeable. 2 h","useful":0,"cool":0},"KyJUw488lhwnZmIyvSfjSg":{"text":"The 8 in 1 tour was soooo much fun! Mike was our tour guide and he was sooo knowledgeable ","useful":0,"cool":0},"KJ0wxvhlIGDNvItkSjMcAA":{"text":"Awesome tour. Peak was our tour guide and I hope I'm spelling that correctly. She was real","useful":0,"cool":0},"9jCz5VYfMRkLzGrJ3aUrQA":{"text":"We did the ghost tour last night and it was the perfect way to end our trip. Our tour guid","useful":0,"cool":0},"2VajgSOXkJjlPES0Coub2g":{"text":"For one of the bachelorette festivities, the bride wanted to do a ghost tour. I was able t","useful":3,"cool":4},"c2PfAj7cj4DN_NzhJMGoEQ":{"text":"Great tour & awesome tour guide, Christie!! Had a nice time on the tour, learned history, ","useful":0,"cool":0},"rmk0okdXvPloeZhpcr8IEA":{"text":"I loved the tours I took with this company. The prices are reasonable and you get to learn","useful":0,"cool":0},"4YFK_FnvZuZZNzygcjIb0Q":{"text":"Great tour!  Our tour guide was informed and funny.   I would definitely recommend DJ.","useful":0,"cool":0},"ubKTRJndjr_f4He1S6w2aQ":{"text":"This was my friend and I first outing in NOLA and we loved it! Terri was engaging, funny, ","useful":0,"cool":0},"zPM9m-FArz8IqoFzZMfbBA":{"text":"This was an awful tour. Not what the website states. You never actually walk INTO any loca","useful":2,"cool":0},"637zn_KVH2ZiAfqZPG2x5A":{"text":"The Ghost Adventures Walking Tour was excellent.  Dario was superb, with a wonderful speak","useful":0,"cool":0},"v8flft4oU_URxdf7xFiIQw":{"text":"Great tour, lots of history and humor. Almost zero ghost info. If you're looking to be cre","useful":1,"cool":1},"CZcFtZ6lcTTuCFDAuUc6EQ":{"text":"Our tour guide, Dario was great. Very knowledgeable. In addition to the ghost/vampire lore","useful":0,"cool":0},"TMHZ5MK6-3VU_ItDluOBiA":{"text":"Peak was our tour guide and she was absolutely amazing! She was super knowledgeable about ","useful":0,"cool":0},"KO7ZjtiNQQD6MjXaSkDKvQ":{"text":"Our tour was so much fun and very interesting. Our tour guide Mike was awesome. The cemete","useful":0,"cool":0},"hfSoTMtOSmV8ticR4ywB-Q":{"text":"Mike was a great tour guide, he was very knowledgeable and funny. He is an excellent story","useful":0,"cool":0},"H2HVCCFnSL5b5yWkOfedKg":{"text":"Mike was great!\n\nWe took the Voodoo/Cemetery tour and it was fantastic. Mike was incredibl","useful":0,"cool":0},"zRneDWwbdkwvvFW5KeajBQ":{"text":"Super fun! Sean was a funny guide with a great amount of knowledge of the stops along the ","useful":0,"cool":0},"4zfKQWSbRjYs0QWc-fSVww":{"text":"Had an awesome time! Our tour guide, Tommy, was a wealth of information! Learned so much a","useful":0,"cool":0},"q-Gn6EB010DbU0F4wFYvaQ":{"text":"We chose this out of many options for ghost tours in NOLA, especially when the most public","useful":0,"cool":1},"K8kYkNp8wgaxvJrG2WrGkw":{"text":"Probably ok but do not book a tour with Peak. She is not professional and ditched me on a ","useful":0,"cool":0},"QBMnWEGX96Mg4KS11HxGkg":{"text":"Who doesn't love a good story, especially stories about ghosts! This tour had my attention","useful":0,"cool":0},"seC3kufVCr1unDo7ApuHrg":{"text":"This is a great way to see the city in a group. I was traveling on business and liked that","useful":0,"cool":0},"A7j9yc1w_pRkJqivoJXXNA":{"text":"Jesse was great.  Very knowledgeable and included a lot of history in the ghost tour.  I w","useful":0,"cool":0},"uFsPuS7NWZACXy0VixMxpg":{"text":"We had such a great time on the ghost tour. Dj was so entertaining. Very knowledgeable on ","useful":1,"cool":0},"Ta7-4Wwb6nLSjAWvg4rqfg":{"text":"Great tour yesterday afternoon in the garden district with Christy. Very informative and f","useful":0,"cool":0},"OD8ZeIBHhEZsxc0rLkOr0Q":{"text":"I was in town for a family wedding and had the privilege of a private tour with Anthony.  ","useful":1,"cool":0},"gphKCIgJAxNImmPF93zh2w":{"text":"Mike was great, very interesting history on New Orleans. I haven't been on any other ghost","useful":0,"cool":0},"kgl81l7GkO9l8819PN3FGg":{"text":"We had a great time even though it was very hot the day we took our tour. Mike, it guide, ","useful":0,"cool":0},"hJJyhTCEnqW5uOwfGtux2g":{"text":"Mike S. Gave a great ghost tour and it was a lot of fun and interesting. I learned a ton a","useful":0,"cool":0},"x6HT6SwHguz-XCS0WnmPkg":{"text":"I had the pleasure of being a guest on one of Jessie's garden district tours. Jessie clear","useful":0,"cool":0},"oqutnXrXiID7_BEHiIYKtA":{"text":"I want to say Sean Bird was an awesome tour guide!!! He was very knowledgeable and enjoyed","useful":0,"cool":0},"snsLUAJu6n78Y6Iwb1HraA":{"text":"I was in New Orleans for a bachelorette party and we decided to do a ghost tour Saturday n","useful":0,"cool":0},"He_kPzndVgtHdS-h4xMdGA":{"text":"Had a great time with this tour ! I would highly recommend it ! My tour guide Mike and was","useful":1,"cool":1},"unLHZJrUNyxd9obYObjXRg":{"text":"My wife and I were blown away by this tour and had wished we had done it our first night. ","useful":0,"cool":0},"P7ke3pSl_V_WiNX4tB73xQ":{"text":"Mike gave us an amazing, very exciting tour. Very passionate about the history, kept us al","useful":0,"cool":0},"KU-CbvUEjJ5t_AIP809HTQ":{"text":"Had a wonderful experience with our extremely knowledgeable and engaging guide, Anna. Woul","useful":0,"cool":0},"Vbn8wM92pddNTEwKS4CxvQ":{"text":"Such a fun and easy going tour. We had Peak and she was nothing short of a genius when it ","useful":0,"cool":0},"5yngfmiKhxF11_c5pFtVxA":{"text":"Mike was excellent! I would definitely do another tour with him. Very informative and he k","useful":0,"cool":0},"Uf7IOMrp9E60BEiif_TWcw":{"text":"Tour guide was great! Fun way to get to see the city. I would definitely recommend doing t","useful":0,"cool":0},"DVSDY0t-pyaaxbHTHVyMVA":{"text":"Going on the walking ghost tour at night was the best thing I could have done!! We had the","useful":0,"cool":0},"M9t6VUer_9bxHBhKCUp5GA":{"text":"I went last night, on the pub crawl tour and it was every thing I was looking for. Nothing","useful":0,"cool":0},"zENC9pc3CQzS81Aq1XLviA":{"text":"Awesome tour! Our guide, Anna from Louisiana, was so knowledgeable. There was nothing chee","useful":0,"cool":0},"mLBivexGuRQ5R14wYDtrkg":{"text":"This is probably one of my favorite tours with Tony being our guide. He is the perfect per","useful":0,"cool":0},"1XMcwKHEWBsNcA3iWchkVw":{"text":"We went on the Ghost Adventures tour.  I watch the show and many other ghost shows so I wa","useful":0,"cool":0},"jNMKJp6NUatqxtLsCqaKFQ":{"text":"I was pretty hesitant to go on this tour to be honest. BUT Ray made it awesome. Lots of fa","useful":0,"cool":0},"neceNj1fqfEkc3jJCzsLlQ":{"text":"A bit of false advertisement. Our guide was ok and stories were interesting however it was","useful":1,"cool":0},"47S4RQHbWMalQ7-8edgLBg":{"text":"We were in town for a bachelorette party and looking for something to do. DJ took us on a ","useful":0,"cool":0},"MarE-n0x8VDy6HwU4BSlpw":{"text":"Shaun was our guide for our tour and he did a fabulous job! Love hearing the history about","useful":0,"cool":0},"IJVrc8q8QVx3ks5ZEG9PFA":{"text":"We took the new Orleans Garden District and Lafayette Cemetery tour. Our tour guru was D.J","useful":0,"cool":0},"Twds6FLn_u1nHax_AEwt2g":{"text":"Anna did an AMAZING JOB!!! very interesting and educational!! Wonderful tour and history l","useful":1,"cool":0},"OCS3QvMIQTcMWRMyd7ql-Q":{"text":"We did the ghost tour with Dario and he was awesome!!!  Very knowledgeable and funny too.","useful":0,"cool":0},"DWf18wUH68lJF3SboOoE7A":{"text":"We went on the ghost tour and there were very few ghost stories. Our guide, DJ, provided a","useful":0,"cool":0},"6ssP3XP2Kya-LZVvc4EpVQ":{"text":"Mike gave us an amazing, very exciting tour. Very passionate about the history, kept us al","useful":0,"cool":0},"19hmROeCe-FyrltRrc31lQ":{"text":"My daughters and I had a great time on this tour. Payton, our tour guid, was very friendly","useful":0,"cool":0},"eH2mUZiGr1VQf0WGTGO3XA":{"text":"It was a smaller group which is great when doing a tour.  We had a young lady named Peak, ","useful":0,"cool":0},"Lg4Zurb6LmmyhrtOG3xEcQ":{"text":"Had Alan as a tour guide, he was super informed and shared so many awesome stories about t","useful":0,"cool":0},"Nbpnu2KSz1e4VhBeuqmR7g":{"text":"My husband and I loved the Voodoo Cemetery tour.  Our tour guide Mike shared a wealth of N","useful":0,"cool":0},"H7e5ZmgZ3AAo-DicplQLfA":{"text":"I took the Voodoo & Cemetery morning walking tour. It was the full 2 hours, and it was wor","useful":0,"cool":0},"m6qrt8oW_uH3Pi7dGoidog":{"text":"Had such a great time with guide Sean Byrd! His knowledge of the city made the day so inte","useful":0,"cool":0},"MKDCoT8qk2Ia18cognmEeA":{"text":"Went on ghost tour with DJ be it was completely worth it! Had so much fun and learned abou","useful":0,"cool":0},"KnMlPWONJVdb-TYdsac37w":{"text":"The guide started the tour without us. We arrived between 10-15 minutes before exactly at ","useful":0,"cool":0},"r5mIkGKwG0hb_6xkv-69rA":{"text":"So this rating is an average for another Groupon find. The tour in terms of size and lengt","useful":2,"cool":0},"5AtreOKpnu9DEDxiWBGx7A":{"text":"We had a great tour with Mike this weekend! He was incredibly knowledgeable about the hist","useful":1,"cool":1},"3LER-pClS73e9-5_UWSzvA":{"text":"The positives: Shawn was a great tour guide.  I think the tour company people do a good jo","useful":0,"cool":0},"Ka6dL1H2W6wOdX18FY7FtQ":{"text":"This review is embarrassingly late, but I had such a great experience I figured better lat","useful":1,"cool":1},"MHAFhsa47o_jiB-U2JVX5A":{"text":"My boyfriend and I are locals and had family in town this weekend. They wanted to take a g","useful":0,"cool":0},"8gp1BguQw8Vb9eBJ9v-gPA":{"text":"We actually did the Garden District tour and loved it-\nJesse (I think that name is right) ","useful":0,"cool":0},"C_bTc19QXawykD2kC-4YQg":{"text":"This was my wife's and my second ghost tour.  The other (by another company) was much bett","useful":1,"cool":0},"NuDJWgOSfP0ofmn1cF1jvg":{"text":"Both the Ghost Tour with D..J. and the Cemetery Tour with Christy were fantastic. Very inf","useful":0,"cool":0},"xHJu8SXt_lV523F8PDy_Pw":{"text":"This tour was exactly what we were hoping it would be.  We did the 6-in-1 tour with guide,","useful":0,"cool":0},"yQnMwY7HnCCieJ2AaIX2hA":{"text":"Anna was a fabulous tour guide! Very knowledgeable, funny, and an amazing storyteller. The","useful":0,"cool":0},"g5qUcjGsQXkjQ6LHWBgHLw":{"text":"Mike was an amazing tour guide! Very knowledgeable as well as entertaining. I learned so m","useful":0,"cool":0},"woQUOkQuN_bxwp0KM6q_5g":{"text":"Anna was our guide. She has a PhD in anthropology, among many other degrees/qualifications","useful":1,"cool":0},"fyTfohnfHBpCCUIANVOjDQ":{"text":"Anna was our guide, we are visiting from New Hampshire and totally enjoyed the tour.  Anna","useful":0,"cool":0},"N2KS3cNOSSJXX-GY63ztcg":{"text":"The rain in Spain stays mainly on the plains. Beignets go great with coffee. I love coffee","useful":0,"cool":0},"g6aTp2wZWRsp-57d_NCHcg":{"text":"Did the 6 in 1 tour with Matt on thanksgiving night. Walking for 2 hours.  Great guy, gave","useful":0,"cool":0},"j2hxvFF3mmPEp1b-D91cUQ":{"text":"Great tour! Excellent stories. Real spooky. Our guide Alan was well informed and told each","useful":0,"cool":0},"54LtCI_mnKJCv5irT4Vihg":{"text":"Went on a tour last night with Valentine.  She was great.  Loved hearing the backstories o","useful":0,"cool":0},"Ddxgf4I6_WYVqmBVjr7HDA":{"text":"Mike was our tour guide for this tour and he was great. We really enjoyed our walking tour","useful":0,"cool":0},"wEmngS83gFNoX7hDaMAtdw":{"text":"DJ was an awesome tour guide. He looks like TJ Miller and did a great job informing us of ","useful":0,"cool":0},"BuHF9OuEToASZDdZFzutag":{"text":"We took this tour on a whim because it had great reviews.  We got Orion as our tour guide ","useful":0,"cool":0},"aw1k-ttJmCWfmhM0CnE4IQ":{"text":"I had a great time on this tour Ana (Doc Voodoo) was a great guide. She was funny, knowled","useful":0,"cool":0},"DyIxbW-irHs0fYRN5nYrsA":{"text":"One of the best ghost tours I have ever seen except for a slight few exceptions.  First we","useful":2,"cool":1},"EYbKM_w76dGfMuULTBgLqA":{"text":"Anna is wonderful!!! So much fun and so informative!! She knew the answers to all of our q","useful":1,"cool":0},"GcM1AjFFhgZqStGJNfS_Rg":{"text":"My family and I attended this tour and were lucky enough to have Anna as our guide.  She w","useful":0,"cool":0},"dU51eEXAnrlyZFh7sOMCmQ":{"text":"This is strictly based on the customer service of this establishment. \nMy friends booked t","useful":6,"cool":1},"OYqPU4E63aWz8gJtv8oBRg":{"text":"Our ghost tour with John was incredible! I am not usually a fan of these things, but when ","useful":0,"cool":0},"ZtYJQfncn3uxXNVFyGMTpg":{"text":"Took a nighttime tour with Sean B. He was fantastic. He was very knowledgeable about the c","useful":0,"cool":0},"_yodAJB0GMnQOI_cm9X9DA":{"text":"My partner and parents visited New Orleans on 2/17 and 2/18. We did two tours with New Orl","useful":0,"cool":0},"TjOPn2cbO7RXgVKYGNo8AQ":{"text":"We went on two tours (City Historical Tour and another day was the Voodoo and Cemetery Tou","useful":0,"cool":0},"8p0_-nNDysCwc20FsOM0jw":{"text":"This was my first time to Nola, we took a ghost tour with Mike at 7pm on Saturday.  He was","useful":0,"cool":0},"dOxm1hL8J_HGpUwGaXsRGw":{"text":"Anna was phenomenal. She is educated, well informed, factual, and has an excellent deliver","useful":0,"cool":0},"q-dOLG6nkuXL-0eli2us4Q":{"text":"I was very impressed with the knowledge of our tour guide. The tour is 2 hours but felt li","useful":0,"cool":0},"rv_XmUCP9XfY20NJDfuALw":{"text":"If you're looking to take a tour with someone dressed as a pirate or a witch with a black ","useful":0,"cool":0},"wbdDzhJkv3e09P5L5xnARw":{"text":"We began our day touring the Garden District and Cemetery with the starting point convenie","useful":0,"cool":0},"-euDT1kLEqLO0ZQX5mvPwA":{"text":"Some tours put on theatrical shows and tell the stories you want to hear. These guys tell ","useful":0,"cool":0},"nFaw3u8Um7zvQ0OpJpXCNw":{"text":"Orion was the best tour guide! This was an excellent tour and loved his knowledge, ability","useful":0,"cool":0},"63PdO0z7hG388kjO_LCYnw":{"text":"Peyton, our tour guide told us a beautiful story of the history of New Orleans and shared ","useful":0,"cool":0},"QV86eoAntqPudu8X9nIeKA":{"text":"My friends and I did the 8pm Ghost Tour.  Mike was our guide and you could tell that he wa","useful":0,"cool":0},"cxid4498KOQ0EEXw726jog":{"text":"Went on the cemetery and voodoo history tour with Mike as our tour guide. It was a great t","useful":0,"cool":0},"-KUmJj8f0IYS_H201EKQWg":{"text":"We took the Cemetery and Voodoo Tour with Matt, and highly recommend! He was super knowled","useful":0,"cool":0},"1R5DKd8kuD9bPpMSmcNDfA":{"text":"When we did this tour: 02/02/2019 (11am tour) \nWho I did this tour with: my boyfriend + 4 ","useful":3,"cool":3},"dEYbBlPDxbs0h10AzhadlA":{"text":"This tour was the best. Our Tour Guide Mike was the best and he should definitely get a ra","useful":0,"cool":0},"GXGMubZkTacIN3qh2zyEIA":{"text":"We went on the Ghost Tour and had a blast!!! Our guide was DJ and he was the best. He is s","useful":0,"cool":0},"ks9tv7Dg-gQVMj7wr4xMZA":{"text":"DONT WASTE YOUR MONEY\nThe girl that gave our tour (Kristy I believe) had no idea what she ","useful":4,"cool":0},"w5r7YcN_oj-XWTHhlSdmdA":{"text":"I had the best experience in my life on this tour with Sedna! She is so full of energy, an","useful":0,"cool":0},"koykfcFLq6NsDObSNwA_EQ":{"text":"Ana like Lousiana was our tour guide. She is very knowledgable and very funny. The tour wa","useful":0,"cool":0},"MkRaS66GDywJ011EApcBrA":{"text":"Roni is extremely versed in the history of NOLA. His knowledge really played a part un our","useful":0,"cool":0},"lZzbgQGEib9rNXxSDyRCVQ":{"text":"We had Anna as our guide on the 8 in 1 tour from 7-9pm. It was perfect! Our group had so m","useful":1,"cool":0},"Agyg6oV7two0C2aChCU5OQ":{"text":"Great tour with Mike the other night! I love that it was based on history! I was definitel","useful":0,"cool":0},"mlgQ5mhzk59e4T7ciEGcnQ":{"text":"This is the second time I've used this company for my ghost tour. The guides are super kno","useful":0,"cool":0},"6IOQn3i_Eo87wlwlufYXMw":{"text":"We had THE BEST time. As 2 muderinos and 2 ghost adventures fiends, we were worried whatev","useful":0,"cool":0},"KklJUJ37KN333Lq9PVC_Tw":{"text":"Terrible customer service!! Go spend your money somewhere else! We wasted over an hour wai","useful":0,"cool":0},"FmLiHi6ucr2XSHy6CApw6w":{"text":"Such a great experience! Our trour guide Orion was incredibly charismatic and engaging. He","useful":0,"cool":0},"6n7GeNhdOf5MO2unl8v97w":{"text":"My mom and I went on the 6 in 1 tour which was about 2 hours long. Sean was our guide and ","useful":0,"cool":0},"PyPVQ_-LdWMmJnQPUnC7qw":{"text":"Great tour. Throughly enjoyed walking the streets and learning about everything. Our guide","useful":0,"cool":0},"eglqEVMxUTO0fndbphWirw":{"text":"Did the Ghost Adventures Haunted Houses Tour. Our guide was D.J. and he was FANTASTIC!!!! ","useful":0,"cool":0},"kA9TUJPGwHN21P2m0J9Fuw":{"text":"This review is for the ghost tour of New Orleans.  Our tour guide Kim was great! He was ve","useful":2,"cool":0},"tB44gJ0uaVdo8fy6qUQL1w":{"text":"Just had an eerie and informative tour lead by Tony. I recommend this tour and tour guide ","useful":0,"cool":0},"8OFVi0nBeLZNVzpEyVJLMg":{"text":"This tour was very disappointing. We basically walked a few blocks and was showed a couple","useful":1,"cool":0},"p0YSoFJXKl2n-KehL9wWVw":{"text":"Loved the tour. Fascinating stories and Matt our tour guide was so knowledgeable. Really c","useful":0,"cool":0},"0eXrOVbcYLxgfpNyMSGoBw":{"text":"I thought I reviewed NO Ghost Adventures at Christmas, but I guess I forgot to, which is a","useful":2,"cool":1},"AGNj2JtRHLghv5_Y6E1kNQ":{"text":"Hands down the best walking tour I've done so far in New Orleans. Mike is amazing, very kn","useful":0,"cool":0},"Iz8OOYcu7G6V3feZgTeSRA":{"text":"Siiiiiiggggh. I picked this tour because I wanted to do something different. We have done ","useful":2,"cool":1},"tqL9nd-JRYrdfbu_lEr6Hg":{"text":"We did two tours with this company, the Voodoo and Cemetery Tour and the Haunted Ghost Tou","useful":0,"cool":0},"zi6O6G0PCJgiaj0ELMkQQA":{"text":"We loved our tour with Tony last night - he was knowledgeable & entertaining, and also fri","useful":0,"cool":1},"yoG7MtpNX9yqfXBXKuxabQ":{"text":"Just went on the 8pm ghost tour and Shaun Bird was amazing, it was a lot of fun, he defini","useful":0,"cool":0},"10yffrzNu3NurzjLqa1tdQ":{"text":"This is a review I never finished from 01/08/2018. Don't judge me. I just wanted to let ev","useful":0,"cool":0},"oCe7mlAejiGWAl4bzPxCbw":{"text":"Mike was amazing and very personable!  My normal attention span is less than 45 min, but t","useful":0,"cool":0},"JB7sTnOkzLgvtLlMyOXn0Q":{"text":"The ghost tour was a lot of fun. Tony was our guide and he was excellent- very engaging an","useful":0,"cool":0},"tlukpU8tcCLSj8lMZWmxwA":{"text":"This was my first haunted pub crawl and it was not great. We were led to believe we would ","useful":2,"cool":0},"1JJNDtupin5UMSGpLwMKRQ":{"text":"Robby Robb did a grey job on our tour. The tour started on time and had some interesting f","useful":0,"cool":0},"76yy7MdlrQ7pNvWHM2gDPQ":{"text":"We had an absolutely incredible time last night on the Pub Crawl. We were a little bit wor","useful":0,"cool":0},"pjVL7RuvA_Z5NeQIUKK5dg":{"text":"My family and I went on two different tours with this company. Both were equally amazing. ","useful":0,"cool":0},"167_iowPAUSGi8A_BiWJaQ":{"text":"Mike was our tour guide and Cory was our driver.  So informative, interesting and some goo","useful":0,"cool":0},"IsLp052GzIwgkGxdwOYRzQ":{"text":"I really didn't care for the story telling. It's not a bad tour or anything I just don't c","useful":1,"cool":1},"xQLpnr2KVbleQoLWI769tg":{"text":"Amazing ask for Wren she gave really good background to all the stops and very friendly.","useful":0,"cool":0},"tzfSzg0M53IxNmNqicqjFQ":{"text":"Anna is the fucking shit. Always get Anna. \n\nShe's out here kicking facts and counting sta","useful":0,"cool":1},"5FRUwyRkoh40am1UdcV-sg":{"text":"Okay so I want to be frank here and state that I actually wasn't going to write the review","useful":2,"cool":0},"6ebPurvnEV4blxK2gN015w":{"text":"The combo tour with Anthony C was AMAZING. The tour was so informative the stop at the hot","useful":0,"cool":0},"46OBwV3teO1zxmDFKoq7Jg":{"text":"Took this tour on 5/16 with Mike he was awesome, very informative knowledgeable and it was","useful":0,"cool":0},"rnmXx8WV-fpshHRLAbM5wA":{"text":"Ana was a great host! She was so funny and full of knowledge. There was the max amount of ","useful":1,"cool":1},"ehtf0i6lrIZT6yc4AIAuZw":{"text":"Anna is the best. She was knowledgeable and showed us an amazing time. Unbelievable tour!","useful":0,"cool":0},"ttNfrt0L8GscIQCO2Nst7g":{"text":"Mike was a very knowledgable, awesome tour guide! We learned a lot of interesting ghost st","useful":0,"cool":0},"avMj2RrB8ERHfxHOFlfCbA":{"text":"The tour was amazing. Shaun Byrd was our guide and not only did he do an amazing job with ","useful":0,"cool":0},"f93y4b0WJ9kDnkRjCeWkSA":{"text":"Jessie was our guide.  Two hours of rushed stories of history and a little bit about \"ghos","useful":2,"cool":0},"iwe8wWKKXxAvKtUpveA8qw":{"text":"I booked the garden district walking tour for my dad. Lucky for him he was the only one on","useful":1,"cool":0},"L5bRUSHdcTAGwF25vu13dQ":{"text":"Matt was our tour guide and he was very knowledgeable about the city and the history of Vo","useful":0,"cool":0},"-M8_E2epqnsHEifMx4L13A":{"text":"We were recommended by friends who had visited before to do this tour so we were really ex","useful":0,"cool":0},"504WvzgNmqrw7_Dz1HwluA":{"text":"Mike was our tour guide last night. He was fun and knowledgeable. Great stops along the wa","useful":0,"cool":1},"BsJUegWvCGd2hzhQlwgb8Q":{"text":"Great experience for your whole family for sure! Our family of nine (two under 10 yrs old ","useful":0,"cool":0},"7kzNzojLtZHbiVw_8UKxEw":{"text":"Before our tour, I snapped a picture of my son's sticker and it had a ghostly image. He sw","useful":0,"cool":0},"Ki9VhGSYf3GhFFX6fYTLRw":{"text":"This tour was the highlight of our trip to Louisianna! We learned so much about the french","useful":0,"cool":0},"R3FpOefXxX8tKuc9zbXrRw":{"text":"Sean Byrd our tour guide, and Cory the driver were wonderful! My family and I loved the gh","useful":0,"cool":0},"rZw9guFWy_G1tzUlueqXFg":{"text":"My group of 5 had an awesome experience with Anna!!!! She was very engaging and is a wonde","useful":0,"cool":0},"KmA1Mj2zlvfdrqG0a85ijg":{"text":"Ok. I booked the Voodoo and Cemetery tour with a lot of trepidation. I wanted to see St. L","useful":0,"cool":0},"63YmW3tFgYzL3zmlHyc86w":{"text":"Absolutely awful. I did a haunted pub tour last year with a different company that was gre","useful":1,"cool":0},"iRo4xCQBa_D7_415-r2sQg":{"text":"We were guided by Peyton on the Voodoo & Cemetery Tour (approx 2 hours).  We visited Voodo","useful":2,"cool":1},"x9lyZXQAPV59hi24cfZjog":{"text":"After going back and forth on whether to book a ghost tour or not, my friend and I were so","useful":0,"cool":0},"uZGNMtW9K7XQ8X4i_YbDZg":{"text":"Precisely what I wanted; a good walk through the French Quarter, looking at historic build","useful":0,"cool":0},"W9nQrbgU0jqV4541kx4x6w":{"text":"Mike was our ghost host for the night and boy did he have a great way of story telling wit","useful":1,"cool":0},"d0KQR2gt_jHx3q-lJ5OGow":{"text":"Had a good time on the Ghost Tour.  Christy our guide was informative and had some neat st","useful":0,"cool":0},"csh-HYheBMMDmxb3IXVwBg":{"text":"My husband, myself and our two teenagers took this walking tour. Our tour started at 8:00 ","useful":0,"cool":0},"5k2W8jl9wFerQ2C0OKZXbg":{"text":"My husband and I went on two different tours with this company and had a great time!  Our ","useful":0,"cool":0},"TxWAPmv-Oet4_NghNSGikw":{"text":"We go on food or cocktail tours every  time we go to NOLA. They are always so informative ","useful":1,"cool":0},"UBU9G5n99MKvDiA7mn8yPw":{"text":"With so many tours to choose from I was happy we decided with this one.  We booked our tou","useful":0,"cool":0},"QDMUKSJxcRpZRFtjfZOinQ":{"text":"We have a great time with Matt, so much so that we've been on multiple tours and recommend","useful":0,"cool":0},"ZYv6NX3MQuks7mg_WIOq2Q":{"text":"BOO!!!!! If you're like me and you REALLY wan't to get ghost freaked in New Orleans, DO TH","useful":1,"cool":0},"Jr1NbV-halsnPZAdwAxQJw":{"text":"Voodoo & Cemetery Tour:\nVery interesting and informative tour. Our tour guides David and S","useful":0,"cool":0},"H-o1X_WqrOfs622nWnYWCg":{"text":"If you can get him, Sean (Shaun) Bird is the absolute BEST Ghost Adventure Tour Guide you ","useful":11,"cool":9},"oZVa2Grf0KqRY09fonbRsQ":{"text":"Will was our guide for the night. He was funny and very knowledgeable.\n\nThe tour was one o","useful":1,"cool":0},"yRIIZMX4LpfvfrNhL-XN_Q":{"text":"We had a great time on the tour with Mike.  He really is passionate about this town and yo","useful":0,"cool":0},"EqhJzZpadFWz_PEr2TYgUQ":{"text":"Shawn Bird was our tour guide, night before Halloween. We had a small group of 10, a great","useful":0,"cool":0},"fJFAGqb-ytPq2UxlRrt1jg":{"text":"My friend & I went on the voodoo/cemetery tour. Peyton was really friendly & knowledgable.","useful":0,"cool":0},"BXcjkBF08QTFZs8SREmuDg":{"text":"First, I wanted to start off and say this was very different from what I was use to. Most ","useful":0,"cool":0},"4k-wWgEXDEaz9ZTvDmHHww":{"text":"Our first time in NOLA!! We did the 5pm Ghost Adventure tour with tour guide Mike who was ","useful":0,"cool":0},"e5rLP16x5x46WZ6v-JFu4Q":{"text":"This is the first time my son and I had done a walking tour. It was our high light of our ","useful":0,"cool":0},"oIl4YkQMapx9ZB_SMpguBQ":{"text":"Had a great tour with Anna! She's super informative which made the whole experience wonder","useful":0,"cool":0},"LbtUhAFKu4O6FXqecrQPjg":{"text":"Took the night ghost tour with D.J as our guide. Best ghost tour I've ever had! Our guide ","useful":0,"cool":0},"4D9uoEp3ZFg7V6BV8KDooQ":{"text":"I was really excited about taking a ghost tour in NOLA.  While I scare fairly easily, I ju","useful":4,"cool":2},"OOGEBr-KMYBLDm4gjGnl6Q":{"text":"We took the Ghost Tour and it was so fun. Mike was an amazing guide; informative; funny; v","useful":0,"cool":0},"gd-VDSr9K7qpHsMxZhBYeg":{"text":"Did the 8pm Ghost Tour and had an incredible time with Mike. He's knowledgeable and passio","useful":0,"cool":0},"TephNDmbRiEU_7qCzdkZVA":{"text":"Our tour guide was sean who was a good speaker and funny but he would mess up names and co","useful":1,"cool":1},"W2Nwp5p8Mjj08QENIITslQ":{"text":"Today we took the City Tour with Sean Byrd as our guide. It was a great decision to take t","useful":0,"cool":1},"4pXP-DWDXm9jO4Y4TKfezw":{"text":"We took the 8-in-1 tour tonite, with Anna as our guide. Anna is great! Loved her story tel","useful":1,"cool":0},"3MBgbmxYw07I4q2AQQO1kw":{"text":"1st time to NOLA and we had a short stay. We wanted to take some of kind tour and we found","useful":0,"cool":0},"MbBs_LJfDjmUm5iYidLw-w":{"text":"Highly recommend the nighttime cemetery and city tour. Driver Aaran and tour guide, Sedna,","useful":0,"cool":0},"nha-3Z7uJ-VniudIbIZ44g":{"text":"Our tour guide Mike was amazing with us. We had a Groupon for the tour and he was really p","useful":0,"cool":0},"kwSkCE7xAqo_61vTYIG6nw":{"text":"Jeff and Cory did a great job on the tour. We took the 9:30 pm cemetery tour and made the ","useful":0,"cool":0},"Vs5_zJiSGqqPg8K_hj6CTQ":{"text":"Loved it! I've done one other ghost tour in New Orleans and this one had way more informat","useful":0,"cool":0},"TLV5msc0RuvgKXBRWd16bQ":{"text":"It was my first time ever coming to New Orleans. My girlfriend's mom and my girlfriend kno","useful":0,"cool":0},"FuJLtcitU8ERQZHlsazKfQ":{"text":"Great guide! Highly recommend! Orion Couling was our guide. He's very knowledgeable about ","useful":0,"cool":0},"RpWIaWaHdBjh5fulRN8FKw":{"text":"Absolutely Amazing is the easiest way to say it! We booked our tour online and wanted to d","useful":14,"cool":13},"E9mLIwJLMt3S7BXT3zbV2Q":{"text":"David was amazing!! We had a great time and he gave us so many great stories about the cit","useful":0,"cool":0},"yRf7VrxGiSrecSsjbHGTzg":{"text":"Not really ghostly or much of an adventure.  It was really expensive IMHO to be missing th","useful":0,"cool":0},"EXhC8s4OGjbSe_GTthB9sw":{"text":"This was our first time in New Orleans and we decided to go on the 8pm Saturday night ghos","useful":0,"cool":0},"d-hNrX0Kw4dw960-3HEP-g":{"text":"I am sure there are more tour companies than cabs at night, so there are many options to c","useful":2,"cool":1},"tmonyltTSePqCQnTQqm1QQ":{"text":"This was my second time in New Orleans, but first time doing a ghost tour here. I was told","useful":0,"cool":0},"WjELkdrw4nwQA9ewysX99A":{"text":"My husband had gone on a ghost tour in New Orleans when we visited back in 2012. We decide","useful":10,"cool":9},"Gir7-f79w5l6i6xN9t_pWQ":{"text":"Great way to see parts of the French Quarter you might normally just walk past. The tour g","useful":0,"cool":0},"HbZg6nbU5aAux0zzSXxVMg":{"text":"We did this tour while in NOLA and had fun. I definitely recommend this walking ghost tour","useful":1,"cool":0},"h7ld0hWAnbUfczKl32_Xxg":{"text":"Such a fun and interesting ghost tour. Sean the tour guide was awesome!!! He was very pass","useful":0,"cool":1},"x9LvtYVa0aSy8MSV1Y9SSQ":{"text":"Sean was our tour guide. He was so funny and knowledgeable, I knew some of the spots that ","useful":0,"cool":0},"RWJeqCWAyc8THYJuAKM8Yw":{"text":"I don't know if I'm on the right ghost tour review lol, but this was the address we were g","useful":0,"cool":0},"UCT9TqljqcQglMJ3VUchcA":{"text":"Took a night time ghost tour around the French quarter and had a great time. Our host Sean","useful":0,"cool":0},"3uc-CRzbKTYJMTE6GOM6rw":{"text":"What an amazing tour. Alan was our tour guide and he was so knowledgeable about the area, ","useful":0,"cool":0},"oFofbq1O5w2PqC9MRqmPQw":{"text":"Went on the ghost tour, and had a blast. Our tour guide was Mike and he was awesome. Would","useful":0,"cool":0},"Q1ZhVgx9Pr_3yBcFqbZfHw":{"text":"Very much enjoyed this tour! We had Mike as our tour guide and he is very informative and ","useful":1,"cool":2},"6bVXzUHyG74I66IBMXaw8Q":{"text":"Sean Byrd was our tour guide he was awesome!!! Very knowledgeable and informative! The tou","useful":0,"cool":0},"XTcfRtx6foXXBeJ0r8AUJg":{"text":"Tony, our guide, made this tour tremendously enjoyable! Would definitely recommend this to","useful":0,"cool":0},"MJ8Rm99RGvwjuzhV7HbXqA":{"text":"Anna was amazing! She kept our attention the whole tour and gave us so much information ab","useful":1,"cool":0},"Tg1kVs_VL_fyZt0EXUNtUQ":{"text":"My family and I took the 8pm Ghost Tour through the French Quarter. Our tour guide Coby wa","useful":0,"cool":0},"7Xzf75MNl9II9utEVK9KwA":{"text":"NOLA is filled with history, and whats the best way to learn about it in a fun way? None o","useful":6,"cool":5},"RYITnyCYAXfjjrbS-GdvOg":{"text":"We took a tour this morning with Sean and Keisha this morning. Our family of 5 were entert","useful":0,"cool":0},"dqnqmUqf2EHKlaNfCcK6fw":{"text":"We had a great experience with Tony as our tour guide. Did the 8pm ghost tour and would hi","useful":1,"cool":0},"MfKYvIbmfmAGhKnCkTueTA":{"text":"I 1000% recommend this tour! If you can request a tour guide, you want Coby! He is one of ","useful":0,"cool":0},"EX160_b6qXnekPlV_pgU4g":{"text":"Loved our guide, Taylor. A great way to learn about the city and so exciting to learn abou","useful":0,"cool":0},"rb0bB8AOiagc53oCG57Jdg":{"text":"Did the Cemetery night tour with tour guide Jeff and driver Bruce. It was a really wonderf","useful":0,"cool":0},"SsB4b48-a8mMMPSSkm_VbA":{"text":"If there's one thing you need to know before visiting New Orleans, is that there are haunt","useful":3,"cool":2},"3HT6qE4WI45IaspfMI3CqQ":{"text":"sean was our tour guide and he did a great job! very funny and nice, no BS. he navigated t","useful":0,"cool":0},"ISuUph3Dxw7c9JgcUqt3Bw":{"text":"Orion Couling was our tour guide. We loved it! Filled with awesome scary stories as well a","useful":0,"cool":0},"Qns3Y-Kdx20cy3jg622wmA":{"text":"My wife and I took the 2.5 hour City Bus Tour, which departed from the French Quarter on 2","useful":0,"cool":0},"MJ6NwUnlnAQphJTOnHghZg":{"text":"Dj was great! Wish I could do all the different tours with him. Very knowledgeable and pas","useful":3,"cool":2},"SLX7sl0mNjKjC8lj-tevVA":{"text":"Amazing walking tour! Our tour guide Anna wa fabulous. Her knowledge was incredible and ma","useful":1,"cool":0},"ZWnLkQPQqRgus9CJUoQ5iQ":{"text":"Great job by Jeff and Dewayne this evening. Thoroughly enjoyed the tour and learned so muc","useful":0,"cool":0},"lIiusCj0jhfGjAsvbHt86w":{"text":"Geoffrey was AMAZING! So charismatic and funny, soo full of life. Made my night. Thank you","useful":0,"cool":0},"H_eTyrmRN35DLQLf6wlG-g":{"text":"This tour was my absolute favorite part of my trip to New Orleans. Jeff was an amazing tou","useful":0,"cool":0},"MU4Zu7MtJcPehEeqAilaxw":{"text":"So, we went on this tour last night 6/16/2021. The problem wasn't with the tour; the issue","useful":0,"cool":0},"Znl3iJ5ii0hC2yPv7ATYfA":{"text":"Sean Bird our tour guide was such a great tour guide, his passion for this city was the ma","useful":1,"cool":0},"xinzSof00LX0jQPxZwiiOQ":{"text":"Coby (no L) gave us a great tour tonight! He hit all my fave NOLA ghost stories, and taugh","useful":0,"cool":0},"5uIxsWu2wPansvj9hQkL4A":{"text":"Took the 5p tour last night and Orion was our guide.  My friend who is a local decided to ","useful":1,"cool":0},"COgKeyQanuS5wylkCYlW0g":{"text":"Orion Couling was ouf tour guide and an exceptional one. Every minute of the tour was inte","useful":0,"cool":0},"ffWbkndQI_VnIkZu5racGQ":{"text":"Very first thing we did in New Orleans, after sitting in the airport was take the Voodoo+C","useful":0,"cool":0},"eUaJ1f18K9BqOt55GF3doA":{"text":"Ray was our guide. We booked at the last minute on a whim and he met us right away. We wer","useful":1,"cool":1},"--pKuYXzbWapxAgs9yaPSw":{"text":"Shout out to Coby. Great tour, very interesting and full of historical info. Hit two of th","useful":0,"cool":0}}