{"jF3ZlgxpM88UjKymEfSJmQ":{"text":"This was my very 1st time in New Orleans. It's been an amazing experience and so far, ever","useful":0,"cool":0},"bgwswvl0rI72YMB7a2rTkA":{"text":"Friday, July 22 we decided to give this eatery a try.  It is definitely in a great locatio","useful":0,"cool":0},"nZyvS000DGcy6Ilv41SSSQ":{"text":"Great family restaurant feel. Po boys had the perfect bread. We had 3 different kinds and ","useful":0,"cool":0},"hj1-8Mut45_mh_LDL5G1Og":{"text":"During the parents' visit,  dad wanted some southern food. We tried Willie Maes, but the l","useful":0,"cool":0},"EhGyhs5mnsW6lvuJZcQeVg":{"text":"Service was so poor we didn't even get to the food. New Years Day 2017 around 7:30 and we ","useful":0,"cool":0},"dZb1JfxPjmpDP5nI9tikfg":{"text":"We had a wonderful experience from the food right down to the friendly and prompt service.","useful":1,"cool":0},"qIi-RUFFSRf-cp309oM3cg":{"text":"This is my new favorite dining spot in New Orleans. We heard about the place from a cab dr","useful":0,"cool":0},"BsJ0MduNPxR0WtoOey2iIg":{"text":"Right in Frenchman's street, wanted to try some authentic food the decor is simple, it was","useful":0,"cool":0},"yCo7R8VCunaRLKbMblGPxQ":{"text":"Great food in a great location. Locals recommended this place to me - and I see why. Great","useful":0,"cool":0},"FunGvsXi0skhktoglmZ1Rg":{"text":"I can't speak for anything but the Red Beans and Rice, as my husband and I come here exclu","useful":0,"cool":0},"5Ie-Ui1Am2bRDrvmRvGwvQ":{"text":"Soul food done right.  Better than most other places, except for Dunbar's, and the staff i","useful":0,"cool":0},"AzAjuuTM7yJjC7ovKdQy7Q":{"text":"Can't speak about the food, since we never made it that far. We were seated (near the rest","useful":0,"cool":0},"1sbvm_doUKF7ABuT16uqtg":{"text":"We came to eat last night with a pretty large party (9 people).  Being in a large party in","useful":0,"cool":0},"7HCFw5kX5pB9JUelZbwpfg":{"text":"OK, so we never actually got our food... Or our menus for that matter, which was very disa","useful":0,"cool":0},"1DOqn75EMKafVw6csS4Ukg":{"text":"I didn't care for this place at all. I heard that food quality has drastically decreased s","useful":0,"cool":0},"IaKiDkV9uT04kYRUEetYqA":{"text":"Just OK fried southern basics. The fried chicken was pretty good, Mac and cheese was rehea","useful":0,"cool":0},"Ub3fZXEZjQ3uFcC-wzKb0w":{"text":"We came in the early afternoon, probably after 2, and were the only 2 people in the store.","useful":0,"cool":0},"e4ouSd3QSrM9Na6CSf53jg":{"text":"Was excited for some good food until I actually tried it. Nothing was fresh. Had gumbo and","useful":0,"cool":0},"YYvseybe9KNIkFQT1TOXMg":{"text":"Have Abita IPA. Got the fried chicken. It was decent. Loaded with hot sauce. Going a bit t","useful":0,"cool":0},"cJeDeofJCnjZKOuz3LMTww":{"text":"We dropped in because the wait was too long at another spot and our party of 5 were all ve","useful":0,"cool":0},"bWeRS8EF63fZ28WolCCOhg":{"text":"Ate here prior to Hurricane Katrina and it was great. We returned somewhat disappointed. I","useful":0,"cool":0},"wjGorY6H38Z0tVr4y34wyw":{"text":"Perfectly seasoned meatloaf. Too bad it was served cold w cold coffee.","useful":0,"cool":0},"nJHVQUaooSdHX0YjpcOtOw":{"text":"We were lucky it wasn't busy. Service was good and fast. Food was fine. We had two gumbos,","useful":0,"cool":0},"wyIIBFE2krBJC-i-T9veaA":{"text":"Horrible experience tonight our service never checked on us. We had to ask the host for bo","useful":0,"cool":0},"kWwhKhthIXUM1gf6kPGUHg":{"text":"Stopped in for a late lunch today. Special of the day was catfish with shrimp jambalaya an","useful":0,"cool":0},"6RzslKl_Jw_tIzawDnpmRg":{"text":"Went last night to The Praline Connection because it was very close to the B&B we were sta","useful":2,"cool":0},"lFUpg02GINTMCxPe8RoLxQ":{"text":"Huge portions! Only downside was our bad server. I really enjoyed my fried shrimp and had ","useful":0,"cool":0},"q1T8-3joB-swEcXctWl_xA":{"text":"For all the New Orleans food I had...this place was extra regular. I must have asked Tommy","useful":0,"cool":0},"xwyg7octGOaPHTcaTjnXpg":{"text":"We went in on a Sunday after a Saints game. Had no problem getting a table for 7.  I'm fro","useful":1,"cool":0},"RToEFyDXwOsu2CM9W3BRdg":{"text":"Loved this place! Possibly the only cheap option for a sit down dinner in the French Quart","useful":0,"cool":0},"6Do80t02Vx6rNMa4JcqkEA":{"text":"Mediocre ribs, sauce was too sweet and vinegary. Lack of substitutions for side dishes. Wa","useful":0,"cool":0},"l5zo3x6JBckHENahc-299Q":{"text":"This is my favorite place to visit, mostly because of the praline chees cake, but the food","useful":0,"cool":0},"TJ-h5qisgeMtafy1UyWG4w":{"text":"Great fish sandwich. Large portions. Low key and good food.","useful":0,"cool":0},"0OAuNDe_mge01j-E8cS0gQ":{"text":"The food was good, not great. If you're in NOLA, please learn to make some gumbo. It was w","useful":0,"cool":0},"ZF3tt8o8iYpRv21j-rMLgg":{"text":"Very disappointing. You sit down and they have an abbreviated menu they are out if thing. ","useful":0,"cool":0},"A3T28ckhYXPjOTM1NeKpdg":{"text":"We went to the restaurant for the New Orleans experience this place have high recommendati","useful":0,"cool":0},"CB3-zoTqS1zE12jy3KbSvw":{"text":"Great earthy vibe, big black and white checkered linoleum floor, black fedoras on waitstaf","useful":0,"cool":0},"5iNUrFAdFmDIeZgED9ZkEA":{"text":"Caution- Absolutely - stay away.\n\nThere was nothing about the food that can redeem how unu","useful":0,"cool":0},"VcXYbYcHXqR3aYPB5zAA3g":{"text":"Excellent service very attentive. Gumbo was very good.  The other apps need some spice. Th","useful":0,"cool":0},"_QwxadorusSxdkbAKW7cAQ":{"text":"Yeah...now this is more like it.  Soul food.  Mac n Cheese...collard greens...everything f","useful":0,"cool":0},"BN8VKJfkg7tySTjormlQjQ":{"text":"A friend of mine recommended this restaurant when i told him i would be in new Orleans. I ","useful":0,"cool":0},"xGAe4sgI7VszDEm6rZORbw":{"text":"This is a great place near the Frenchman region of nola to get authentic cajun soulfood se","useful":1,"cool":1},"g2Q73KVtBQmcyMf1mRMShA":{"text":"Been here 3 times.  First time, I was loved the food so much, I came back.  The 2nd visit ","useful":1,"cool":0},"kZqDvHEEWsw2gg_5YoScow":{"text":"Satisfactory  service, but was disappointed that the food came out TOO quick.  Main dishes","useful":0,"cool":0},"c0HhpGxp7WitBCyq03Br3w":{"text":"EXCELLENT FOOD AND SERVICE!  I will return. It is very easy to get to on Chartes Street. W","useful":0,"cool":0},"YJkYLTlbuvPuK_EpHZ7XyA":{"text":"Two words. Real bad,   Yelp is telling me to.say more. But really, it's real bad.   Yelp i","useful":0,"cool":0},"gguxjOLinNI3dWKOsW-vxg":{"text":"Had a great dinner here. Really liked the walk from canal street down to the restaurant as","useful":0,"cool":0},"lL_aEfH8ZytLnpcxWqiQEQ":{"text":"This place was packed, so we thought it would be really good.  Unfortunately, Busy so thou","useful":1,"cool":0},"uYjy2ie5_WvPdEsOe8dC5A":{"text":"My wife and I found his place on our last day in New Orleans on the other side bourbon str","useful":0,"cool":0},"xEM9_WotCVJT-lCsfzdi_w":{"text":"First time to NOLA.  Very good soul/creole food.  Good home-cookin.   \n\nEverything was goo","useful":1,"cool":1},"cf4fjlKXl-y3zIZNnCGIrA":{"text":"Disappointed We visited on April 1 2018 Ordered stuffed crab with red beans and collards T","useful":0,"cool":0},"SaSLmoYKmxP5j-ga3-apoA":{"text":"I don't get the fuss. My etoufee was pretty good, but mac & cheese had little flavor, frie","useful":0,"cool":0},"X0BGkzIHogbr14VoEZV3PA":{"text":"I preface this by saying I came in at 9:30pm which is 30 min before the place closed.  I h","useful":0,"cool":0},"6K2PnJinqLxBYnJML_DJJQ":{"text":"Really good food. We ordered the appetizer for four which would feed 8. Don't order the la","useful":0,"cool":0},"yGqsNM5nxPRNVU-BTQ1n8w":{"text":"So delicious! My wife and I really enjoyed the fried chicken and mac n cheese. The service","useful":0,"cool":0},"-C57x-OtSqGYcK4x1w42Pw":{"text":"Great soul food. You can tell this is where the locals come. They may have the best hot sa","useful":0,"cool":0},"FZP0smVXfrXoMZlkPgur-w":{"text":"Excellent choice for our last meal in nola!! Stumbled upon it while roaming the marigny!  ","useful":1,"cool":0},"tDen2LKahjIFZmcTvnNXpw":{"text":"I feel bad writing this review because our waiter was really nice. i was so impressed by t","useful":0,"cool":0},"NCIehPLOXZxEE-V2YDqRGA":{"text":"This is a great place for creole soul food in the Marigny, right near all the clubs on Fre","useful":3,"cool":2},"Wh54qh9mCOC8HLVViI-x7g":{"text":"Perfect fried chicken. Yummy mustard greens and beans. Mac N Cheese was bland. Will defini","useful":0,"cool":0},"dgcZUZ6b5Dgbd8zeAtT35w":{"text":"It was ok, the service took a little long but it wasn't too bad. The food was good but not","useful":0,"cool":0},"Gx1qhGHjkVpUH2WQTakP4w":{"text":"I stopped in and made a reservation, but I am horrified by the service I received. First o","useful":0,"cool":0},"I8IjJkvbgSpVt5RjRZ19vg":{"text":"This place is laughable. 25-30 minute wait ended up being an hour. We finally sat down and","useful":0,"cool":0},"iZSXnEC8ug2spRP1NOO24A":{"text":"It was the worst experience of my family and my life. The food was absolutely horrible. We","useful":0,"cool":0},"Cz9LQkvCJoawPRO9HubEGA":{"text":"Soul.  I have been craving that fried chicken for months!  Jazzy atmosphere, simple. Soulf","useful":0,"cool":0},"194Ta3kn3PitSaibnCTw9A":{"text":"This is some of the best soul good I have ever had in my life, second only to my great-Gra","useful":0,"cool":0},"_XVFQKbNx_vZM48sShgRiQ":{"text":"Great Service. I had alligator bites and fried seafood. They were both great.\nThe seafood ","useful":0,"cool":0},"LTcCYV-qTuEIXMPOF5oMFg":{"text":"2.5 stars. I really wanted to like this place, but damnit, they failed.\n\nNot awful but not","useful":3,"cool":1},"OYt-VvO-mhC-neMdUtC40A":{"text":"We have been here several times. The atmosphere is always welcoming and the staff always e","useful":0,"cool":0},"uZulGKMPFb4o2ohUF_W0HA":{"text":"I love this area (Frenchman street) of New Orleans. Great food and live music!! I was take","useful":0,"cool":0},"1oxtm-aH8ynLCycMjUDh3w":{"text":"I've eaten here many many many times and sometimes the food is better than other times.\n\nb","useful":2,"cool":1},"JRQmGqwRUaRk7N8lCy-AoA":{"text":"Stumbled upon this place because we couldn't find another one and we were hungry!! I am so","useful":0,"cool":0},"DAn0r5rsTQMCWD8dhhiXEQ":{"text":"I felt four degrees cooler just walking into the place. \nThis had nothing to do with the a","useful":1,"cool":0},"F_r58v997AVhatDt92cKFQ":{"text":"There are angels working in the kitchen because the food here is  heavenly AND DIVINE! I o","useful":1,"cool":0},"s2VAsC7JRo2pKjzwVOQwTA":{"text":"We had another restaurant in mind on Frenchmen St. After a so-so vibe at the place we were","useful":1,"cool":2},"ETXNCF0dgahr9_yr6G_btQ":{"text":"It seems over priced, but the location is good- right on Frenchmen. The feel is more of a ","useful":2,"cool":1},"oc0QJm5vhdXgVIOYqfkdGw":{"text":"Our server was wonderful! So polite and nice mannered. The food. Oh. My. Goodness. Enough ","useful":0,"cool":0},"P0-SvbS8AidwX2uFLPXpAw":{"text":"Absolutely loved the food, I had the meatloaf which I saw on the travel channel and was no","useful":1,"cool":0},"pWQvUyFUFIOcqRWzzpcfxg":{"text":"First time - not planned, but needed food, so randomly selected this place. What a good ch","useful":0,"cool":0},"n8q1yl-LRoXjHDedSADACw":{"text":"This was one of the most disappointing food experiences during our week-long stay in New O","useful":0,"cool":0},"wxGUBLe7zMhLa5U_mWx6ZQ":{"text":"Wanted to try some local flavours and got inside this simple looking place, I was surprise","useful":0,"cool":0},"-ObNnuEI4YT93e-3Sgfnag":{"text":"We were very happy with this place, in the faubourg Marigny. You don't have that many dini","useful":0,"cool":0},"8SavNLbDxKMpMowDW4SWiw":{"text":"We were a party of 4 and initially the waiter did not write down our order which made me n","useful":0,"cool":0},"qb818azweOqFfGbZ-9rStw":{"text":"I liked this place because the service was great and the food was on par with what I expec","useful":0,"cool":0},"7P_hRQeizgYEiScKE65FJQ":{"text":"Decent service. Nice people. But overall, a mediocre spot. Food was fried, yes, but a bit ","useful":0,"cool":0},"ZScSxCqoEEeKmn5UwWvhfQ":{"text":"My husband and I each got a shrimp po' boy. He got his with fries and I got mine with a si","useful":0,"cool":0},"5cJGDEYQcVfhi85ZC5RikQ":{"text":"We live in New Orleans, and on our way to Bastille Day at the U.S. Mint, (I know, I know..","useful":1,"cool":0},"SDt300hTa5VksKLJMrDT7Q":{"text":"Great fried chicken and we went back a second time for the file gumbo and the fried fish. ","useful":0,"cool":0},"AThD3xdmNd4iL5gJt8e8LQ":{"text":"We had:\nFried Chicken livers with pepper jelly,\nSide order of cornbread\nSoup made with ric","useful":1,"cool":1},"cWMvAt6Ir7p1ON27OVIpYQ":{"text":"We ate dinner here- it was pretty empty when we arrived but was packed by the time we left","useful":0,"cool":0},"CwOi47QOkjug8O--UwGE1g":{"text":"Over rated and resting on its Laurels. To have a store adjacent to restaurant is part of t","useful":2,"cool":0},"mm8pxZSYbhZUupB4kUbDJA":{"text":"Great comfort food, good service, and reasonable prices. Never had a bad meal here.","useful":0,"cool":0},"rupd46kCKlXf1A95ndrePg":{"text":"Had dinner here spontaneously with a friend. Well, we knew we were having dinner, we just ","useful":3,"cool":2},"eEheqKhfcZEtmO-QbruCxQ":{"text":"What luck!!\n\nAfter a long-winded adventure looking for 2 Sisters (soul food restaurant)  w","useful":0,"cool":0},"C3XLeMUhOYvKI3VAB6adMg":{"text":"Worst fried chicken and collard greens. Cornbread made me want to cry. Catfish was decent.","useful":0,"cool":0},"ZMRC8D1Ete8NKSvFLCgbtg":{"text":"Great service, great food. Ditched the money pits in the French quarter to come here for a","useful":0,"cool":0},"F4YOVZpyafTagJ45TPpbUA":{"text":"Bad taste, bad service, and over priced for the amount of food that was on the plate.  The","useful":0,"cool":0},"GOXtoOve3ghy4eB4n5Yfeg":{"text":"Great southern and soul food.  Wonderful service and good atmosphere. We had fried shrimp,","useful":0,"cool":0},"98iMd12voE9DrmbtgvtNJg":{"text":"Restaurant was recommended to us by our hotel staff. I can see why!\n\nAbsolutely sweet staf","useful":0,"cool":0},"Go-yR4mnLnrRvgz_wSnK4w":{"text":"This is a quaint little restaurant on Frenchman Street. The food and service here was grea","useful":0,"cool":0},"A48XNFE9CGEIy7JLkreCHQ":{"text":"My boyfriend and I just got back from New Orleans and were so lucky to find this gem.  We ","useful":2,"cool":2},"5VEhJtg0jNN-AMDq2UHsAg":{"text":"Excellent food good price. Top place for our first creole meal.\nDeep fried pickles were gr","useful":0,"cool":0},"2fH6JVHwYIPlRQvvJ-qgpA":{"text":"Everything is good. Shrimp & crawfish etoufee Very generous portion of chicken livers. Mac","useful":0,"cool":0},"6vGxp0r4QQCjbipOZx3FJg":{"text":"Our cabbie recommended this place as THE place for soul food.  The fried pickles were amaz","useful":0,"cool":0},"09JNz6eWkRPjn75qAAvnDg":{"text":"I've been looking in New Orleans for a place to knock me off my feet... I've come out of a","useful":0,"cool":2},"tJm6EI9UZYtm1oCvTU_ltg":{"text":"We found this by accident and decided to check it out. What a treat! Hands-down the best m","useful":0,"cool":0},"JGccxUp_jc9ms6Cz3U_RqA":{"text":"If I could have given 6 stars I would have. The server was great. He was very knowledgeabl","useful":0,"cool":0},"HRF-jjWzaaz7XibcnZd0fw":{"text":"Why is the food so bland? I asked myself over and over again. I've been here before and th","useful":0,"cool":0},"2QEfIGUb2V7UQYkiRA55Jg":{"text":"Wowwww......sooooo sooooo good! We came for lunch and decided to try the \"taste of soul pl","useful":0,"cool":0},"hzJC6ziys1ZpY8AoxslCWQ":{"text":"Disappointing. I was looking forward to the catfish after reading good reviews about it. D","useful":0,"cool":0},"LOC44HvRUVy5KdulK-8AKA":{"text":"Went to dinner here on our first night in New Orleans on 3/17/2017.  We try to go here at ","useful":0,"cool":0},"a4_9BzmgQNljgUzEckJUBQ":{"text":"I would never go to the place again. The food is processed right out of the can. Chicken w","useful":0,"cool":0},"JrFhxQ1msUNHvj7EKoGliA":{"text":"This place rocks! Came here on a Sunday night and probably waited about 15 minutes for a t","useful":0,"cool":0},"iFiP8SFxuP7DzxCyHodQMQ":{"text":"First time in New Orleans, walked in here the ambiance was nice there was nice music on th","useful":0,"cool":0},"PIejLa8cxSOTYeJW1S-RMg":{"text":"Food is good. But service is one of the worse I've ever had. I highly doubt we will be bac","useful":0,"cool":0},"rjepJQazzaSFLD2sqFbgTg":{"text":"food is oh so delicious.  i've been here a couple of times and both times were eqaully sat","useful":1,"cool":2},"MM7XaJ7fUs6riA9Q2XR8GQ":{"text":"Boo hoo what a dissapointment. 45 min wait to get in....45 min to get our order taken 45 m","useful":0,"cool":0},"aGEUw-wjbXNHcWTj6IwKWg":{"text":"It pains me to write a review update, for a restaurant I have been to before (where I had ","useful":0,"cool":0},"ukgZWkrWs85mQtxrarSbwA":{"text":"This is a really cute restaurant. The service is great and fast. Unfortunately, the food i","useful":0,"cool":0},"hd_YrKwagOtv1szd30HKgw":{"text":"AMAZING. The Praline Connection made me rethink my policy of not trying out new places wit","useful":0,"cool":0},"8XH66tAAEQ3Lgt_zQKA37A":{"text":"The food is average. I have had better food in NOLA. It has turned into a tourist spot and","useful":0,"cool":0},"dXVALQmlkkwldGvELL28Ig":{"text":"There was no steak or lobster on the menu when we went, on a Sunday night. \n\nThe fried pic","useful":0,"cool":0},"Gt8NfYRX6KsAJQOqqjsMbQ":{"text":"Go somewhere else, unless you're really hungry. Sorry to say. Cool costumes, but ehhhh. Co","useful":1,"cool":1},"Nhdvj44BbdtilJQCVMBWCA":{"text":"We loved this place! The food was amazing! Our server, Wendy, made sure that we got some o","useful":0,"cool":0},"5lzwbogKOWSjiOleuY7tUg":{"text":"I had high hopes for Praline Connection, having been recommended it by a couple of local p","useful":0,"cool":0},"n6eae4uVMIsuE1ZZVrKsOw":{"text":"Food is ok, not too bad, not too good.  They do offer a vegetarian plate with choice of fo","useful":0,"cool":0},"57t2N-ddiwbU77jIBAkRnw":{"text":"Not bad but not great. Locals would say it's over priced, but tourists will find the price","useful":0,"cool":0},"Zfnw2fVHEk27JW06L022PQ":{"text":"Went here on a recommendation. Looked promising since all the locals go here. 4 of us all ","useful":0,"cool":0},"_cstvj-T_rVcS7-pZ99FIQ":{"text":"My Uber driver suggested The Praline Connection and suggested the smothered pork chop. No ","useful":0,"cool":0},"ONhpyVBZ4CXBqZlFB26RKw":{"text":"Real Southern style home cooking at decent prices. Jambalaya and stuffed peppers were deli","useful":0,"cool":0},"SRaL4bLeLsTwmC75y_gKvA":{"text":"We had a lovely lunch,  and 6 of us shared the taste of soul platter.  We were not disappo","useful":0,"cool":0},"1OHp_VcguqyuNtU-xEr6lA":{"text":"Good, unpretentious food and service at a reasonable price. Entrees are huge. I had the be","useful":0,"cool":1},"SgD3_Ub0EILlN1rSFCu1Xg":{"text":"Hands down, the best fried chicken I've ever paid for.  Period.  \n\nThe red beans & rice we","useful":0,"cool":0},"myWEDU8QL5-0Kd9-EUJFhg":{"text":"This is mostly a \"tourist trap\". We, locals can appreciate the good places from the no so ","useful":0,"cool":0},"_crSbHNQ4h-SVniLWH0fTA":{"text":"Figure I would stop since I passed several times thinking maybe I should have continued. O","useful":1,"cool":1},"ciL5Zl3Flrd67iScEVFHRw":{"text":"Went to Praline Connection in 2004 and loved it; always wanted to go back. Driving across ","useful":0,"cool":0},"YJB8JnzvBcxTFFSDB2Ay0Q":{"text":"I honestly cannot say anything negative about this place except maybe it was too unkind to","useful":0,"cool":0},"EZpAtjsuPOM6CP4THRFTlA":{"text":"A local recommended this place to us. Some dishes were great, others not so much. \n\nWe tri","useful":1,"cool":2},"Nkvi76ANaEl9iBt4hfvWEg":{"text":"I live in New Orleans so I know what true, authentic NOLA food should taste like. This was","useful":0,"cool":0},"BkWEXhSyQ6fmtDbuVX6sKQ":{"text":"Authentic soul food. Good food good atmosphere.. Good service.. Had the taste of soul. Eve","useful":0,"cool":0},"xAsjoqxRLQKw8zGhQGpMfw":{"text":"Generally, I only write a review if it's great or if it's terrible - this place was amazin","useful":2,"cool":1},"0vQsQYhquun23W4jA7Euew":{"text":"Fried chicken was unreal!   Best fried chicken I have EVER had!\n\nOnly 4 stars because the ","useful":0,"cool":0},"pOZRRuooqStwFPlAC2mGDA":{"text":"Our food ( seafood platter and meatloaf entree) were excellent.  My dining partner had the","useful":0,"cool":0},"ZNRatXe44fiHsUbNEKTA7g":{"text":"The PO boys are excellent portions with awesome amounts of whatever meat you choose. The b","useful":0,"cool":0},"kECydYU8fqKbN7PWwyeXVA":{"text":"I usually find really good restaurants on Yelp, and to be honest I was iffy about this one","useful":2,"cool":0},"Fwn_UfbUgNu15oRI8smZ9A":{"text":"Comfort food at its best.  Huge portions-always take home.  Eaten here for years as a tour","useful":0,"cool":0},"lgtIZx2inW6ByniUAK95nw":{"text":"I always go there when I am in New Orleans.  The food is good without being great - althou","useful":0,"cool":0},"DTsNzSSmq_vRAbmscH2XeA":{"text":"We have visited here a couple of times over the last few years. Its located smack in the m","useful":0,"cool":0},"iMpqDa0Oyukiw5406KYNRw":{"text":"The Praline Connection makes a mean po' boy.  The restaurant is located just outside the F","useful":3,"cool":2},"fNQ5-BLhde0_9tW5GK_WPg":{"text":"Went here and ordered the fried chicken with macaroni and cheese and collard greens. Now I","useful":0,"cool":0},"W7nSMVOWFeYAUWwPDjeJcg":{"text":"I dined here on July 5th and service was terrible. I was in town for Essence Festival and ","useful":1,"cool":1},"9QaesCKJ-TuOd6EmKpNLuw":{"text":"We were recommended here by the hotel staff. But we were disappointed. Parking is an issue","useful":0,"cool":0},"Wy3QDSLVfzno6eMsKxxLIw":{"text":"We were on the hunt for vegetarian Gumbo (I know stupid) and were walking along Frenchman ","useful":0,"cool":0},"hNPN4Y_f20NYcEe9VCWs0g":{"text":"This place was recommended to me by some friends. Upon entering no one is there to greet y","useful":1,"cool":0},"zMcxR-3QZF-EjlIEo88-1w":{"text":"Slow Satturday afternoon, maybe 4 tables in the place. 3/21, my birthday.\n\nSeated ourselve","useful":0,"cool":0},"IgS3EHDXHtiS3fh-Z8ugOQ":{"text":"Great soul food without the greasiness. Catfish was fresh, juicy, tender with a light cris","useful":0,"cool":0},"QA4wA50vl_JyRurR_w1MHA":{"text":"Delicious food , great service, but don't ask for separate checks!! Went with a group of 4","useful":0,"cool":0},"vFxF5eWWhzb4gAF2gQPM8w":{"text":"Service was very very slow and it wasn't even a busy day. Food was nothing special conside","useful":0,"cool":0},"gJeiJcwqQCIL90LBPH6BZA":{"text":"Best fried chicken! Went perfect with red beans, rice and okra. Love the portion size and ","useful":0,"cool":0},"LNW2pqU9KbNZXCkuV87WSw":{"text":"I came here on a recommendation. Well, I was a little disappointed. First of all, our wait","useful":0,"cool":0},"cAF27TKVrZIcHaQq9FYkUw":{"text":"ambiance 7/10\nservice 7/10\nsoftshell crab Po' boy   2/10 essentially felt like bread crumb","useful":3,"cool":2},"PGFSUm0F4hCBI9bQJV90_g":{"text":"SPOILER ALERT: Avoid this place. If you want to know why, then go ahead and keep reading, ","useful":1,"cool":0},"LUC6YICLFf1EyBU-uCAzdA":{"text":"wandered in here as we walked down the street getting lost in NOLA.  definitely didn't dis","useful":0,"cool":0},"k3PQID2-Tbq0MQUd65KdaA":{"text":"Wonderful food in a quiet atmosphere (hard to find when visiting Mew Orleans). Had the stu","useful":0,"cool":0},"wp4_htgWOFlUZ38JF2fyuQ":{"text":"I had heard from the locals this was a great place to eat. \nWell perhaps I came the wrong ","useful":0,"cool":0},"a5aCu99wHyy5fweyw7B4iw":{"text":"Best kept secret in New Orleans!!! Ask for Susie, she's wonderful!!! So are the white bean","useful":0,"cool":0},"1w5L0ccvIGqMDzA16JeiXA":{"text":"Wack-ass cornball waiter tried to tell me they were out of po boys. I protested but he was","useful":3,"cool":0},"JI6c8VWt0I9wLQ2aBAYYbA":{"text":"If I could give this place six stars I would!\nTry the taste of soul and you will not be di","useful":0,"cool":0},"3Ibw7zCfivpmmsF5H1jIcw":{"text":"It's a quiet, relaxed atmosphere..The music in the background is Marvin Gaye, Gladys Knigh","useful":0,"cool":0},"A2D98br0er4svneKAtDbcg":{"text":"I had the shrimp po'boy and an iced tea. Iced tea was really good in this weather. Great b","useful":0,"cool":0},"onwv_FstmMhuaZ_aGJglOA":{"text":"I loved everything about this place. If you like southern cooking this place is pretty goo","useful":0,"cool":0},"NO0qaeSf2OmV8WF-aocZQA":{"text":"Great food; great service!!!  Don't expect this to be a place to have a quiet dinner; it's","useful":0,"cool":0},"UZLbSLcSUUR-GyNYCvJL9w":{"text":"The price for the amount of food is pretty good, and the taste is not bad. The plastic tab","useful":0,"cool":0},"WWIXUYx1680EJM3TXjAJmA":{"text":"Great place.  Clean dishes and kind servers. The hostess did not greet us after a minute s","useful":0,"cool":0},"cKkydxRlXJafTy2Sku0Hpw":{"text":"As Ted said, we--well, he had to wait an hour and a half (I showed up late and then left t","useful":6,"cool":2},"vGxxToUvBvH9DVQxgp2HRA":{"text":"Went here for dinner with the family, after coming here years ago and liking what I had.  ","useful":0,"cool":0},"DgAv0BTpZw8W-c2oGDGFzg":{"text":"To be quite frank, the service my family and I revived on the 3rd of April, was horrendous","useful":0,"cool":0},"jQSgMgrN3jjE4U2tiUMfGQ":{"text":"Very poor customer service and rude wait staff! Told to \"Wait outside\" with our party when","useful":0,"cool":0},"yregIlOp58xYWMmIat2SVg":{"text":"We were really looking forward to some good ole food on Frenchmen one evening when we came","useful":0,"cool":0},"2yyRbpVvcziawEuTDMQ8MA":{"text":"While visiting NOLA, we did a quick search for the best mac & cheese in NOLA and decided t","useful":0,"cool":0},"1cAdz4zYpbk8y8bRzNUUlg":{"text":"This place is way too overrated concerning the food as I did not try the pralines. The gum","useful":0,"cool":0},"5Ezqoo6SZaVgfeBn5VsZZw":{"text":"Classic Cajun Creole soul food. Will definitely be back the next time I visit New Orleans!","useful":0,"cool":0},"kHbCtEjpNQRsPD1bbmwerw":{"text":"i was there with a group of 14 other people and the praline connection was the last restau","useful":0,"cool":0},"M5pdJqocozdPhse-F2SuGw":{"text":"As we entered Praline connection we were greeted by a well dressed host as well as the sta","useful":0,"cool":0},"O1tXJwwldxnyG4TpZFAqqw":{"text":"Yum!  My husband and I had a great meal here during our last trip to NOLA.  The staff was ","useful":0,"cool":0},"kvyCcinSPPbwfTByftGSyw":{"text":"Fantastic food! Fantastic service! Definitely recommend this amazing place :) The staff wa","useful":0,"cool":0},"1d0G_3_UMoLAHpA6rgqK3A":{"text":"I'm not a regular reviewer but this place was good enough I'd thought I'd make it my first","useful":1,"cool":1},"ktNHohwDjd7SGDSSSthj_Q":{"text":"Being from California, guess I never really understood what real comfort food tasted like,","useful":0,"cool":0},"a8tyST6T4GHMdcIQdT3nXg":{"text":"A gumpo was delicious, a whole plate of local food was so tasty that you would love to eat","useful":0,"cool":0},"8Zmkhl_v_eJbs9N8aFmH3Q":{"text":"February 16, 2015. Extremely bad service and rude staff & manager. Waited 30 minutes for o","useful":0,"cool":0},"f6hv_svcq1QLTMJQ3FfZOg":{"text":"Omg!! So disappointed with the food. Mac&cheese taste like it was from the box and none of","useful":0,"cool":0},"NS13UWrhI-5Zyhi-jyVSjw":{"text":"After reading all the mixed reviews, I still felt it was worth a try because 'when in Rome","useful":0,"cool":0},"v-51tGFKcAziuV3Nbz4r0g":{"text":"We did not visit the restaurant but they were a vendor at the bayou boogaloo. We got fried","useful":0,"cool":0},"EkOiKxT7yVOaAEY1J2CLYQ":{"text":"This review is just for the pralines. We got them to go, one original, one coconut. They a","useful":0,"cool":0},"HH1kaF9XZkU_F9R9_fx6Gg":{"text":"WOW! YUM! TASTY! this little joint on frenchman served us a great meal. the service was ok","useful":0,"cool":0},"0q12WiQJ-muc7R5BKdfq5g":{"text":"I have visited New Orleans half a dozen times in the last five or so years.  I enjoy the f","useful":1,"cool":0},"fWAmjq139sFM8p41VtZ3ZA":{"text":"I went back just to get crawfish etouffee on New Year's Day last year & it was completely ","useful":1,"cool":0},"y9WOVq09CE3DgwICAYPtHw":{"text":"Visiting NOLA and this place was recommended for their peach cobbler and Ice cream. As you","useful":0,"cool":0},"Ytr3pb7_jPq1ZCJwNQVJQQ":{"text":"A pleasant place for dinner, we went on a Sunday around 6 and there were plenty of tables.","useful":0,"cool":0},"kvaD-IEJhoC0pAnsXUa_Dg":{"text":"The food was very good, portions were good size, in fact we didn't Finnish our main dish b","useful":0,"cool":0},"eHqPK2Z1i7uIwzBL380rVA":{"text":"First off I have to say the reviews surprise me. I was expecting the best fried chicken I ","useful":3,"cool":2},"WfXArXoph5tyXEJsspvGSw":{"text":"Started off with the alligator sausage appetizer. Delicious!   Then we moved onto the craw","useful":0,"cool":0},"hCpiY1oncW7kDTk3IOUNCQ":{"text":"Nice easy going location. I had a veggie platter and it was delicious! The prices were gen","useful":0,"cool":0},"85ommN3ilj4Oie2NO1lZMQ":{"text":"Underwhelming visit. Mac and cheese was not at all soulful. Cornbread was not tasty. The s","useful":0,"cool":0},"Cc5csuIcGGIipVeGRvnTdA":{"text":"After touring the city of New Orleans, we finally thought it was time to try some great fo","useful":2,"cool":0},"Q2cOc8efNWUP3xU1M03Zog":{"text":"If I can give zero star to an establishment, this has to be it.  \n\nWe wanted a light lunch","useful":2,"cool":0},"-mzk8zcxvGqJsjrXnUd30g":{"text":"Best restaurant on Frenchmen Street. If you like chicken livers you have to try these. My ","useful":0,"cool":0},"q-giwn4U1Gf9bk0gbddoZQ":{"text":"Great location, my friend ordered bbq oysters and they were from a jar covered in Kraft BB","useful":1,"cool":0},"81oF5pmBt8lGz32bPSNnlw":{"text":"Real home cooked New Orleans food. I had the sampler platter with ribs, catfish, red beans","useful":0,"cool":0},"EG-ZKkUY-0W_CY0v_tY4-A":{"text":"First time here.. But yes.. Pretty much everything was good.. Love their gumbo,jambalaya,a","useful":0,"cool":0},"4JGGdA44dO9jr7CIA11woQ":{"text":"We arrived about 4:30 PM on a Sunday night.  As there were very few people, we were seated","useful":0,"cool":0},"w-w6RsU6XCZUcDjTPWSJmg":{"text":"Decent food but more of a late night diner spot.","useful":0,"cool":0},"gfWuNAh1g-duBJlqogQtrg":{"text":"The food was delicious and the service was pretty good. We had fried chicken, greens, yams","useful":3,"cool":1},"ycOZzM5LYcgBewpk3EYy1w":{"text":"Ordered the ff:\n\nAppetizer: Fried Pickles with home made Ranch Sauce\nEntree: Fried Chicken","useful":0,"cool":0},"lBD0ZNoz0FX2mZaf2z_F0A":{"text":"So... This place is always packed. People love this place, but there is nothing special ab","useful":0,"cool":0},"OhzTcKD9gt1jqgWPieDr6w":{"text":"Pretty unimpressive. Our server was nice but we waited 10 minutes before anyone came to ou","useful":0,"cool":0},"SgGC-uXJBmmxYHziA6LvwQ":{"text":"2.9.12\n\nIt was a short 1 mile walk from my hotel to The Praline Connection. I figured I'd ","useful":7,"cool":6},"EdNo1LeoRxBuwPsk4dId2g":{"text":"We weren't that hungry but we got a drink and a bowl of gumbo. Although both were good, th","useful":0,"cool":0},"PF3xw2ScDh_MQTLv2AJCdA":{"text":"First place we ate on our first trip to New Orleans.  Place was recommended by natives. Di","useful":0,"cool":0},"IjBdxdCd12g4u41fi9JaEQ":{"text":"My family and I came here as a recommendation from the Enterprise guy. \n\nI ordered a meatl","useful":1,"cool":0},"VX2O0WEA1pOVFiFJjS2mtA":{"text":"We went on Sunday the 20th around 7pm.  I work in costumer service as well which is why th","useful":0,"cool":0},"qyyk01L8aXW3huRRRyLSmw":{"text":"Would not go back.  Overpriced.  Too many tourists.  Food really not that well executed.  ","useful":1,"cool":0},"HtUjVWhMKmN4xCTJvDNuAg":{"text":"Came in for dinner midweek with the wife.  Having watched a travel show episode about thei","useful":0,"cool":0},"cvX0ptQgTBLcijDVc9Ki6w":{"text":"This is my third time to NOLA, and I've been trying to get to this restaurant since my fir","useful":0,"cool":0},"CI-gdaiRFS-NT2xSTLj-ZQ":{"text":"I had lunch today at the Praline Connection Restaurant.  The food was very good.  The staf","useful":0,"cool":0},"E0vWZALSdY87Y25MVcLRWw":{"text":"Save the best for last! Good food at a reasonable price! Loved the good hospitality!","useful":0,"cool":0},"BjrzaUDeWJKuLxLTRoU3Dw":{"text":"In our attempt to escape Bourbon street we decided to spend a night listening to live musi","useful":3,"cool":1},"7INOYIfvGKU4of8sxz8Ezg":{"text":"I first had the chicken livers with pepper jelly at the FQ festival 9 years ago and loved ","useful":0,"cool":0},"PR-UT5p-xlbIWZ7pTYuWKg":{"text":"The fried items were tasty (though certainly not healthy), and I can wholeheartedly recomm","useful":0,"cool":0},"SBfhtlA9RNHLgEEduiAqrg":{"text":"The crawfish etouffee was *spectacular*!","useful":2,"cool":0},"7Lsj9qxljCioJCM0xfO8Jw":{"text":"Fantastic southern cooking!!! The place locals go. Mmmm so good!!!  Highly recommended!!!","useful":0,"cool":0},"lfqiVE6rV8cBj-bhpGB1aw":{"text":"From the first time we arrived the only thing they keep sayings is \"that's how we roll!\". ","useful":2,"cool":1},"8QSu752Lx7ceTv8cEuwN8A":{"text":"Went here for my birthday, and I thought the food was just okay. We had split the \"taste o","useful":0,"cool":0},"fgctg4NPDcvYGRQevyu_ng":{"text":"Visited the week after Mardi Gras this year. Hardly any wait at the Praline Connection, gr","useful":0,"cool":0},"csIKTDq41j7tPwTuy9e-WA":{"text":"Soooo I tried the shrimp etouffe.... it was ice cold I told the server he took it back and","useful":0,"cool":0},"k68VFTYxl5hPp246XTLwNQ":{"text":"My hubby and I came and it was great! i got the seafood platter and it was delicious and I","useful":0,"cool":0},"GXUX_uy3xCHISbPR7g015g":{"text":"Slow service though our waitress was nice. I ordered the stuffed crab which honestly taste","useful":0,"cool":0},"sZyNHvvlppe0mSsR_U9BiQ":{"text":"We came here starved on our first night in NOLA. The food was decent if a little expensive","useful":0,"cool":0},"GNeKHkn9v5eFrTZFIaRs9A":{"text":"A family group was recently in NOLA, and after wandering (staggering) around for a few hou","useful":1,"cool":1},"KIzUxCy1ctBhsmcCqsHTlw":{"text":"Great food!  Excellent service!  I had the crawfish etouffee and it was fantastic.  My wif","useful":0,"cool":0},"fRQNuo-Zo97NeJLGxjsedw":{"text":"I've heard good things about The Praline Connection over the years. On a recent visit, we ","useful":0,"cool":0},"sjpm9N4fYzRVif-eyJ3eVQ":{"text":"Generally, I only write a review if it's great or if it's terrible - this place was amazin","useful":4,"cool":2},"d8_vYy12Hzzwvr7lFmVCBw":{"text":"Great Gumbo and extremely nice staff, couldn't finish everything had to carry out a big To","useful":0,"cool":0},"wk4byM48hpXc5c6QdZLksA":{"text":"The worst all around restaurant experience I have ever had. We walked in today and asked f","useful":0,"cool":0},"2AEXSDi4ETzs2sqkyN11IA":{"text":"I came here with the bf for a relaxing lunch on Frenchmen's, and it was possibly the best ","useful":0,"cool":0},"NTlf8VqWrIYUbw1zCOBGeQ":{"text":"Bad service, followed by a long wait when the order was messed up twice. Food that came wa","useful":0,"cool":0},"_OZn0GV6pbbR8jA59xxK4A":{"text":"I got the fried chicken and collard greens and my boyfriend got the sausage and red beans ","useful":1,"cool":0},"zpVDGHttE1OAwQcDff0EPw":{"text":"Ok place to have lunch near the French Quarter.  \n\nI would recommend this place for the fr","useful":0,"cool":0},"k-nKq4Yye1mfbNAmdbeYaQ":{"text":"NOTE: This was from New Years Eve 2013.\n\nWorst dining experience of my life. Took forever ","useful":0,"cool":0},"xuB0yLHT1IjwbrRYreVzWA":{"text":"This place is the epitome of 2 stars. The food is okay and is overpriced for what you get.","useful":0,"cool":0},"eiiWrBPRF58g_v6p1aHsrA":{"text":"What a way to cap off an OUTSTANDING week in New Orleans by taking a friend's advice and t","useful":3,"cool":1},"Fy7ZCAisAaOHtbNJgdlHeQ":{"text":"Long wait.  Extremely hungry.  Large portions.  Chicken wings were fabulous. Stuffed peppe","useful":4,"cool":3},"UlcqJaRIbdgW_W3DnKoWoA":{"text":"We went there after walking by while wandering on Frenchmen. It was packed and we were loo","useful":0,"cool":0},"jbzTZlvjJqFsWDh4KObjZg":{"text":"Two words. Real bad,   Yelp is telling me to.say more. But really, it's real bad.   Yelp i","useful":4,"cool":0},"q4fe8kLMD4f8rCcjHk2blA":{"text":"My friends from out of town and I went to this restaurant under a suggestion from a local ","useful":1,"cool":0},"wcZawtGmw1KjZJ0wkZkd9g":{"text":"great atmosphere and exellent New Orleans experience !!!","useful":0,"cool":0},"mYwJ8o9aLvHPTiRRMLixrw":{"text":"Yummy!  We ate here several times.\n\nThe catfish was magical the fried chicken was spot on","useful":0,"cool":0},"5IBLLjCYwAl79lHWNra7zg":{"text":"I wasn't impressed at all! Ordered the veggie meal which is just a bunch of sides and not ","useful":0,"cool":0},"L3Hyw8cXIhiLo7yr-JwJyg":{"text":"I walked in alone to a half empty restaurant in the middle of the afternoon. When I gestur","useful":2,"cool":0},"5O8YQb1AFsPYlIiyiTR0_g":{"text":"Don't believe the rankings...overpriced and not good food. Go to Lubys or a cafeteria for ","useful":0,"cool":1},"cfpH34PPJzJZB8fbfmJUTQ":{"text":"We could not get served.  Place was nearly empty, 4 tables seated.  We were seated and wer","useful":0,"cool":1},"aVXpgJ8P6biwet3eo-ladQ":{"text":"Good service, relaxed atmosphere, good fried chicken...went back the next day and ordered ","useful":0,"cool":0},"KScRupOTSqYNo5pV6XxSlA":{"text":"Such a sad review because the food is good but the service is horrific. I am a local and t","useful":0,"cool":0},"I4VfGFr1pSV7sQkIvxfECA":{"text":"THE BEST FRIED CHICKEN PERIOD!  The shrimp and/or crawfish etouffe was delicious too.  Ros","useful":1,"cool":1},"3TMUhy_TtWnKK-5nQs312g":{"text":"While in NOLA for a recent conference, my friends wanted to eat here because they wanted r","useful":0,"cool":0},"9v-ltF8oTrMx-LHviFzEOg":{"text":"Horrible service, horrible food. Save your money and try somewhere else. Jesus our waiter ","useful":0,"cool":0},"NHqnYaRoCExURMihqiBdSQ":{"text":"My family truly enjoyed this place. My dad ordered ribs, my brother fried chicken, my mom ","useful":0,"cool":0},"hEG9vQpPlZlgEiKMK0gESA":{"text":"Stopped in on a whim and ordered the cheesecake with the praline sauce.  (I still can't pr","useful":1,"cool":1},"ndyybTUhPsvgU3XRe7kAWQ":{"text":"This place was alright.  We tried to go next door, but there was no seating so we checked ","useful":0,"cool":0},"VvOmKy_7OsPHk3iTh0eO_Q":{"text":"I was debating on going here...based on the 3 1/2 stars but decided to throw caution to th","useful":0,"cool":0},"Q7m6RES3rqVOlDOwoaMa2g":{"text":"First time eating here. Loved it! Great service and my shrimp po boy was delicious. The wa","useful":0,"cool":0},"t0jJrGtHZ7NLMpEj2ieSYg":{"text":"The service was incredibly slow, and when it arrived it was mediocre at best. The greens w","useful":0,"cool":0},"2naSSb4Lv-kgMmmPL8REJw":{"text":"I felt adventurous and tried the alligator sausage as an appetizer. Alligator is nothing t","useful":0,"cool":0},"sIwczqOO6AtCkaeOKojr_g":{"text":"This place is hit or miss the first time I went it was great i had the jumbalaya with the ","useful":1,"cool":0},"c6Zaa07elvwYisLpgihutA":{"text":"Loved it! Had the red beans and rice and a side of collards. It was delish!!  My husband h","useful":0,"cool":1},"7Nyp7ED5lgKT4_mxo-TI8g":{"text":"Das Essen in diesem engen Lokal ist unbedingt den Versuch wert - auch wenn das Personal ei","useful":0,"cool":0},"oKK8O_riHFhWYnUJINFPhw":{"text":"I only had dessert - pralines!  This was a new experience for me, I thoroughly enjoyed the","useful":0,"cool":0},"nZK4eG6wEiHEqGUXSTo-Og":{"text":"OMG ! \nWarm Sweet Potato Pie !!!!\nVery nice place to enjoy an after dinner dessert . . .","useful":0,"cool":0},"ZqJ9Er5_JgMMLLEHRqv_bQ":{"text":"AMAZING! Everything we ate was awesome! Thee service was great, the staff was so friendly ","useful":0,"cool":0},"oUTqPeqHsYgMK_YtJuFWYg":{"text":"We had dinner here as we visited the various bars listening to some great music.  The serv","useful":0,"cool":0},"Y55ZlMoD3bMAd_aKfTg4ww":{"text":"Phenomenal food and service! This was REAL soul food! If you're looking for great food and","useful":0,"cool":0},"KJOU7D-msLGZAxotW8g-rg":{"text":"This review may not be for everyone. while there, there were people who got their food, en","useful":0,"cool":0},"kU9P61XJQ9FkKQF1iDusJw":{"text":"Stay away... the fried chicken was tasteless, the mac and cheese looked and tasted like Kr","useful":0,"cool":0},"JOn9wsNnyNhfZlbn4ElNMg":{"text":"The food was really good. A great mix of Cajun and soul food for sure. Quite a bit of vari","useful":0,"cool":0},"DtjfuDiPM39hWvKgmtD0IA":{"text":"I went here with a bunch of my coworkers and my dissertation sponsor during my trip to the","useful":0,"cool":0},"jJfInxRDPMN4dThMHm5iSw":{"text":"Visiting NOLA for the first time from NJ. Our Lyft driver recommended this restaurant. The","useful":0,"cool":0},"vXOfOo37pU77VLHUmt7dpg":{"text":"Food was alright... but service was terrible. Wait was long even though the restaurant was","useful":1,"cool":1},"4RRX3RJiKn35rc82RuhBeA":{"text":"We were going to a show at dba and were looking for some good comfort food in the area. We","useful":0,"cool":0},"T8Hb1xFjH6cSYD1tGdUWHA":{"text":"I came here with my friend on Monday night.  I'll admit, when we arrived, I was not feelin","useful":1,"cool":0},"cbb7f6kDT5wohdvQiKbtSw":{"text":"I never like to write a bad review, but I have to this time. I visited this restaurant bec","useful":0,"cool":0},"JhUMKtyaBKZmXDAXlX8sEA":{"text":"We had gumbo, red beans and rice, and they both fail short on seasoning. The gumbo a littl","useful":0,"cool":0},"tMj56T0VY7V9MiFmF27EOg":{"text":"Service was disinterested at best.  Food was not anything to write home about but average ","useful":1,"cool":0},"bwDDtf-jLrxt18IcSSpKbg":{"text":"Excellent food. Both the ribs and the crayfish ettoufee were delicious. We were too full f","useful":0,"cool":0},"1zzpZmapsjoAWRW9ZJiTlg":{"text":"By far the best restaurant in New Orleans, the fried Okra and the crawfish etouffee are ex","useful":0,"cool":0},"327tVkNC9G62Hic27-8iQQ":{"text":"Hog headcheese and a vey nice bowl of gumbo.  Eas very surprised thought the place would b","useful":0,"cool":0},"BsGmV9CLcQUMWG_LGhiccg":{"text":"Food was quite good. We sampled 4 different appetizers - the Fried pickles and Okra were H","useful":0,"cool":0},"B9buirMKuhJcCSN2vQxBOA":{"text":"This place has very rude service. Marcie, the hostess was incredibly rude to our party of ","useful":3,"cool":0},"Cre1pZ2-HOQVnpOOnkSg8w":{"text":"Wow! The food is real soul food!  We had 2 gumbos - classic gumbo and zair gumbo that was ","useful":0,"cool":1},"eC4e433GTzzb_ogRlACRdQ":{"text":"The filé gumbo is absolutely magnificent. The servers are locals with an eye for amazing t","useful":0,"cool":0},"zrAKfo2JOFQzXJ37j0NLZQ":{"text":"Very good hometown New Orleans cooking. Portions are so large we each took a box back to t","useful":0,"cool":0},"Os3Q3yIgpN3hS1eCESsovQ":{"text":"Food heaven. One of the best soul food restaurants in New Orleans, not too mention the rum","useful":0,"cool":1},"Ui5WqDDlcl1NRn6a3l5nug":{"text":"Bad taste, bad service, and over priced for the amount of food that was on the plate.  The","useful":0,"cool":0},"ZBrX2pk4s-0gKr20hLzISA":{"text":"I love southern food. In NOLA, this place is 3.5 stars, but I'd give it more if it were up","useful":1,"cool":0},"RGTBizSerk9HzkDAJA6XjQ":{"text":"We went on Jan. 2. Everything seemed fine, but when we asked politely if we could have ano","useful":0,"cool":0},"EbU-TBXKmyjMcY6QCIdGbw":{"text":"Praline connection proves that jazz clubs aren't the only thing with soul. Best fried chic","useful":0,"cool":0},"BbS45cOnuFwH0xmMusHFUQ":{"text":"My wife and I stopped in here for a quick bite before a late night show down the street an","useful":0,"cool":0},"LYnGe_uKAvqj67WBdglU-A":{"text":"Excellent soul food and excellent service. Sandra was a sweetheart and knew exactly what t","useful":0,"cool":0},"RjpUIO5Bb9LEkPo-hfivKw":{"text":"Had lunch here today. Crawfish etoufe. The crawfish were cooked well, but the sauce was th","useful":0,"cool":0},"djFdWvuj1Rblm-XFexsZuw":{"text":"Nothing special. Yet another New Orleans staple that has gone down. Wonderful staff but sa","useful":0,"cool":0},"JJVhFWMGf3VAkMoQgVj6sg":{"text":"I've been to New Orleans many times, and to lots of NO restaurants. This is one of the lea","useful":1,"cool":0},"-UgwaFBhVvFcjKq5WOwDmw":{"text":"Packaged as a Creole Soul Food joint, Praline Connection's over-the-top waitstaff attire c","useful":1,"cool":0},"FisaQ2Y1at5xbToc5YaVug":{"text":"Excellent service!!!  Great food, I had the Jumbalya and greens.  The Jumbalya was delcisi","useful":0,"cool":0},"HIRrb_lg_01qsr_2dIUlwQ":{"text":"I got the meat loaf, collard greens & MAC !\nMy friend got the fried chicken with Mac & red","useful":0,"cool":0},"nYmTnuS-oy_3fhHvhd1RIA":{"text":"Amazing food, servers, locations and atmosphere!!! The plater was great!!! Ask for Ahmad h","useful":0,"cool":0},"zoAr7DuUylTUT4yHnLHsQQ":{"text":"Came here twice back to back. The food was delicious. If your looking for down home soul f","useful":0,"cool":0},"p2Vh_CchY2rAiVQnRjj_Kg":{"text":"Yum! Good, old fashioned wholesome food at the Praline Connection. You can get to try some","useful":0,"cool":0},"pUWaGsrg_cWCq0syTH3iaw":{"text":"I was a little worried when I first walked in, because all the customers were white: not u","useful":0,"cool":0},"IGRPhGR2AAZ5ZErT1bzwyA":{"text":"The food here is pretty good. I waited an HOUR AND A HALF for a table! We had a large grou","useful":1,"cool":1},"EQ_DYTdjIVHSF6uitVqpXA":{"text":"I really hate to give this review , but its an honest review. I don't know what has happen","useful":2,"cool":2},"-SHSK1Fem9-9_2_qj1h3vQ":{"text":"Collard Greens and then Mac n cheese and pralines and pick your meat! That is all!! Always","useful":0,"cool":0},"jjtQPNHOmz3MvXD8G-aJsw":{"text":"Several locals told us we had to come by and try this location's amazing food - we were no","useful":0,"cool":0},"ZrTZHD5x7m1kjozEG_ob1Q":{"text":"Like other folks have said, the collard greens were excellent!  The po boys my wife and I ","useful":1,"cool":0},"VcT9uPhqaqjHBuvzD6eKQA":{"text":"My favorite soul food place in NOLA. Everything is delicious from the black eyed peas to t","useful":0,"cool":0},"3iksKvAfkjcJVZtpUrlASQ":{"text":"This place is cool for the experience but the food is really hit or miss. I personally ord","useful":0,"cool":0},"LGMKkHEmt1lDhAVFpPQ9_g":{"text":"It was simply Ok. Maybe I was too excited going in but my greens were EXTREMELY salty, my ","useful":0,"cool":0},"SZIIYVr6Ht3kocAdDyNidQ":{"text":"Really liked coming to the Praline Connection during my recent trip to New Orleans, I came","useful":1,"cool":0},"dB3IH364s8RAR6oorh6c5w":{"text":"Came here for lunch. Got alligator sausage as an appetizer. That was really good and they ","useful":0,"cool":0},"ZzD7KXPY2uj0AlQp1yNKPA":{"text":"If you are looking fr an authentic Southern Creole meal and service near the French Quarte","useful":0,"cool":0},"K9DRPrLV2spQN6uuUJRrig":{"text":"Had a wonderful dinner with my wife while exploring Frenchman Street. Not the fanciest res","useful":0,"cool":0},"wUxzngoVAXCWiBXBMGL_6g":{"text":"The chicken in this place is a revelation. The ribs...omg...so good. The bread pudding was","useful":1,"cool":0},"SB2EkTsax2uOzGa0jBDcJw":{"text":"Bought a box of 6 in the New Orleans airport.  The box was not marked with an expiration d","useful":0,"cool":0},"RbDVi7BO2I3O2k6bhlZtow":{"text":"Excellent food and good mix of options for family.  Comfortable place to grab a quick dinn","useful":0,"cool":0},"MVZNMgaaBrL2R9g4Z_kxjA":{"text":"The single best meal we had in NoLa. Way off the beaten tourist path, this soul food eater","useful":0,"cool":0},"sRcFX4yOzk8mw-78TJJtrQ":{"text":"Good southern cooking-big portions, decent prices snd friendly staff and excellent service","useful":0,"cool":0},"hHzlWvJZt8N8Zaes2sFKtw":{"text":"Yummy, authentic like cuisine. We thoroughly enjoyed the sampler platter of fried seafood ","useful":0,"cool":0},"bwC83VX9Tcz3Io-__oVyjQ":{"text":"One of my favorite places to eat when I lived in New Orleans. Wonderful cajun/creole/soul ","useful":0,"cool":0},"bicSrdoMd4oNqsLy8TCA3Q":{"text":"For ANYONE who knows Southern hospitality and authentic New Orleans/Southern cuisine, this","useful":0,"cool":0},"Jgv0kNCbi2CmsWmVhstbtg":{"text":"This place had things that were excellent and things that were no so good. I'll start with","useful":0,"cool":0},"sOruIrz3ly33hzztlnqhNw":{"text":"If i could give negative stars i would. 2 couples walked in after my group and were helped","useful":1,"cool":0},"Oz_dEKCWROZGeezpUXUPOg":{"text":"Best fried chicken I've had in a long time! Our server was really nice. The collard greens","useful":0,"cool":0},"_-MqJwffIebDlPir5cT8LQ":{"text":"Ok.  Sorry but this was the worse food we've had in NOLA.  We took an Uber here because we","useful":0,"cool":0},"a82lGclTdaVMMrtULBNVKA":{"text":"One of my favorite spots that I ate at on my trip.  Their sampler platter was one of the b","useful":1,"cool":0},"x_FhCWYNJ_T5FmlX_xQhtg":{"text":"We were seated quickly but after that things didn't go as planned. We got our food before ","useful":1,"cool":1},"qEtQjR9GIrIoyhsdeZxpmA":{"text":"COMFORT FOOD AT ITS BEST!\n\nThe staff at Harrah's recommended this place. \"Try the deep fri","useful":0,"cool":0},"5YfX5eKBY2ZoULAAsaUevA":{"text":"Just awful.  Is there a rating lower than one star?  I'm so happy I paid 16 dollars for ri","useful":0,"cool":0},"KQCQkHNDBHj2KSGD-VNAqw":{"text":"The shrimp etouffe and the gumbo file were spectacular! I could be eating soup all day and","useful":0,"cool":0},"DdoJjiTOHAQf24-2RORyXw":{"text":"\"Eh\" or \"So so\" is what comes to mind when thinking of this place. I got the ribs with the","useful":1,"cool":0},"pyRxJNpk2mQX3avKiiQ_iw":{"text":"Awful! Over salted, terrible service, never cleaned the table that had food on prior.\nColl","useful":0,"cool":0},"yE4aaKyV_QxIU7s_W13VIQ":{"text":"For a first time visit to New Orleans, this restaurant came highly recommended by a few of","useful":0,"cool":0},"iJztPbbwmvQWlUN22p0Lyw":{"text":"This place was recommended to me by some friends. Upon entering no one is there to greet y","useful":0,"cool":0},"Aw5jMR2IkwnqeeKmrJ_bZw":{"text":"WORST SERVICE EVER! Waited about 25 mins before we were even greeted. They were not busy, ","useful":0,"cool":0},"PY_Vs7ove_aKE2TUhBHx6A":{"text":"First time visiting New Orleans & stayed in Metairie . This place is a short drive from th","useful":0,"cool":0},"twrWvmb_m6JYCuizPatd8w":{"text":"I was initially excited to come here. Honestly. As you walk in, it's small, but it's quain","useful":0,"cool":0},"BQHCZgC72SQ-nDc_Ph3zdg":{"text":"We ordered a variety of things and overall was very good value for the quantity of food pr","useful":0,"cool":0},"jnJqdhuxV0tkzyjF6KSSnA":{"text":"I SO wanted to love this place! My brother raved about the meatloaf so I was really lookin","useful":1,"cool":0},"pokreExZ1xJ0GVIJreskEg":{"text":"Twelve of us came to The Praline Connection for my group's \"last supper\" before going our ","useful":0,"cool":0},"ybEW6vrEZPQS34ItxK7zvg":{"text":"Was here Monday night with my man. I was in the mood for some Cajun food and most local pl","useful":0,"cool":0},"OitFURgmsIUrx-HRUwqz6A":{"text":"Not awesome.  We stopped in here Saturday evening while just exploring Frenchman Street.  ","useful":0,"cool":0},"zTHHYqOiCXxLJ9MJMDPlSw":{"text":"I had spent the week prior volunteering in the area and on our last night out the crew I w","useful":0,"cool":0},"PqbJu5mUvw6dVQZf2RoGpg":{"text":"We tried the 'Taste of Soul' platter which had beans and rice, fried chicken, ribs, catfis","useful":2,"cool":2},"5Qdab4HLRZtPrFQbM2QahQ":{"text":"SURPRISED by all the bad reviews?!? Maybe they changed something by the time I tried it...","useful":0,"cool":0},"I-jB4qaUm5g0u8-HuERdJQ":{"text":"My wife and I asked our Uber driver where to get some good food. He recommended this place","useful":0,"cool":0},"rMFRqFWMgh4Mc4ZiVZiKhg":{"text":"A good soul/comfort food place to eat. A little on the small side, so can get a bit noisy.","useful":0,"cool":0},"rf_tS0AlksiClPTK1BSiZg":{"text":"If your expecting real great Cajun or creole food here you'd probably be disappointed. But","useful":1,"cool":1},"D07Ry_k9qtkjx7xYXrcxiA":{"text":"A local mentioned about this place and my husband and I had a wonderful soul experience he","useful":0,"cool":0},"q3rAzTKIlEEH-SGNht3t1Q":{"text":"Love the food. If you want soul food this is the place. I had the seafood platter and it w","useful":0,"cool":0},"OAuY9WdLqBvUPUoFAmj5ag":{"text":"Wow..did I die and go to heaven? the peach cobbler is unlike anything I have ever tasted","useful":0,"cool":0},"pqlpnAv0SvwwSONl3nGVuw":{"text":"The food wasn't favored very well. The food network raved over the meatloaf..... it wasn't","useful":0,"cool":0},"EACYhnsdLmG47LeQ2rjgEQ":{"text":"Was visiting New Orleans last month and while we were on Frenchman street we stopped here ","useful":0,"cool":0},"MqPLujT3u84ANG2HgWhcXw":{"text":"Hadn't been here for dinner in several years but went with a local to check it out.  Love ","useful":0,"cool":0},"-S4tcndkIdbe9u0IDnLkpA":{"text":"HORRIBLE EXPERIENCE!!!  After frequenting the Praline Connection on Frenchmen St. In New O","useful":1,"cool":0},"L0fZ4UanYpkjpc_VE3286w":{"text":"The was service horrible!  The General Manager was rude and unconcerned with lack of custo","useful":0,"cool":0},"W4N3g8kID7Q2dkUicoJ43Q":{"text":"Hmmmm. Not sure about the bad reviews, but our experience at this \"soul food\" wonder was a","useful":1,"cool":0},"MaKv6tK2u53YJzY4AH9emg":{"text":"Excellent southern food! We grubbed on local favorites like cornbread, fried chicken, and ","useful":2,"cool":1},"GPhaZpLCcco4IlBnuo01WA":{"text":"I stopped through while on vacation in NOLA. I must say I thought my food was good, but no","useful":0,"cool":0},"ZBNC6HfINH-ayuNiXZgLpw":{"text":"We ordered the Hog's Head Cheese (which I have had before from Best Stop) which I could ha","useful":0,"cool":0},"k_CVESp7nH8zsWSsBz7_UQ":{"text":"BLUF:  Below average food on a street that deserves better.  \n\nHad to wait 40 min which is","useful":1,"cool":0},"Q8dGWwmkrBhbRvFu2u_u3g":{"text":"Came here as a recommendation from the Hotel staff.\nThere was a looooong wait as it seemed","useful":0,"cool":0},"MxbIWiIE3CCtPgByP1LDyQ":{"text":"We had a great meal and Leon, our waiter, was great. He was a little busy when we first sa","useful":0,"cool":0},"DWwNrP_xSIFeg1PTlxyrmA":{"text":"Waited for a while before waitress greeted us with water. Then she sat at the table next t","useful":0,"cool":0},"LN2Vq7FKDCFb6HOeYUe_EA":{"text":"After reading all the mixed reviews, I still felt it was worth a try because 'when in Rome","useful":1,"cool":0},"byIKKQzHwRXWm--VEmgpfg":{"text":"Great customer service and drinks are strong but food is bland! Not New Orleans tasting. D","useful":0,"cool":0},"DsTFmUQ0QG473MYSCAOcGQ":{"text":"Oh my goodness, was the food wonderful. It was on my last day of exploring the Quarter whe","useful":0,"cool":0},"OTCCjF7crq0Yir0Pj7bn_A":{"text":"Walking around the streets of New Orleans led us here and it was a good experience but not","useful":0,"cool":0},"-ECeEfHWMVDJK4mWsH09QQ":{"text":"If you're visiting do not be afraid to head over to Frenchman. Our pedicab tipped us off t","useful":1,"cool":1},"TKCRdwTWEC6qSzCPspyO6Q":{"text":"The craw fish ettouffe was Phenomenal. Good service too ! The place is simple but very aut","useful":1,"cool":0},"ccfI-nSj4TrY8tFdMdh-rg":{"text":"My friends and I were looking for a place on Frenchman street before hitting the jazz club","useful":0,"cool":0},"3BljGf_gdREyr4s3KbPPqA":{"text":"Super good food! Try the ribs.\nMust experience this delicious Cajun flavor. \nThey give you","useful":0,"cool":0},"a_YyQPQ4ce4_lg7_fZM_cQ":{"text":"it's only ok. only to experience it, like cafe dumonde... u only do it once and not again.","useful":0,"cool":0},"lYTz2wu6-upB15EST0vvoQ":{"text":"This was the 5th time I have been to this wonderful restaurant. They serve mustard greens ","useful":0,"cool":0},"fhOI-kJLMPTwbRzxsw592Q":{"text":"At 1st glance, clean, well-designed, nicely attired and courteous staff, and well-planned ","useful":2,"cool":0},"vg305lqngMtCedG5Bf-mKw":{"text":"I was really jonesing for dessert late Saturday night after 11, and they were able to prov","useful":0,"cool":0},"ffgkKQoheSFrG8rlyjeBhQ":{"text":"A bit of a disappointment. I like gumbo but the file gumbo, which I was told was a chicken","useful":0,"cool":0},"NL7JBRalg5dj2lXWPvngoQ":{"text":"This place was good as heck.  The pralines in the candy shop right next store were to die ","useful":0,"cool":0},"9eRFoHwDOnVysrnLiRUO0Q":{"text":"It started out good. Our appetizer came out rather quickly. Our entrees did too. It went d","useful":0,"cool":0},"sPlUVUKNxZ46drotIyMhSQ":{"text":"Welp yelp viewers, I must say I have not had such horrible experience before in my entire ","useful":0,"cool":0},"5asvmttm-XSygU5KYnNcyw":{"text":"Hard to find food as good as this close by. Love the oyster poboy, the fried fish with sid","useful":0,"cool":0},"mRfy-n01ZDBF1KHwbzyF8Q":{"text":"The file' gumbo tasted like home cooked food. The fried chicken wings were good, but not a","useful":0,"cool":0},"SAszuZScs8i4EcBHu2KHnw":{"text":"My husband and I *just* got back to our bed-and-breakfast from having dinner at The Pralin","useful":0,"cool":0},"MlAUSM_ZqEMLyiz29nhfew":{"text":"THE WORST FOOD!!!!!  I am originally from New Orleans and use to come to The Praline Conne","useful":0,"cool":0},"HYLrTb3LrBP_ne-zIROtOg":{"text":"Great soul food with a great attitude. The jambalaya was tasty and filling with generous p","useful":0,"cool":0},"gJd-Nz4JTVlpG68hSBdrnQ":{"text":"Taste of Soul! Awesome Jambalaya, great cornbread, delicious collard greens, and large por","useful":0,"cool":0},"O-IWmIL6oRdfc6eiUOwGNA":{"text":"Sooo good! We split the \"Taste of Soul\" platter and it was more than enough yummy yummy fo","useful":0,"cool":0},"Kw9uoC5YpmDJG3FythyPvQ":{"text":"Great food if it's warm. Wonderfully casual local restaurant with food to match. I ordered","useful":0,"cool":0},"_pWZiHZuSJ9rfDHKGRkFBQ":{"text":"I joined some friends visiting New Orleans for the first time from up north at the Praline","useful":9,"cool":0},"qkuHwWHofOSYUVtjM6TMAA":{"text":"Decent food but poor service. Had to wait an hour to get our food and the wait staff was n","useful":0,"cool":0},"_OtKUQ2XEy2_e7150kXiFg":{"text":"My wife and I had a wonderful dinner with friendly waiter service.  For an appetizer, we h","useful":0,"cool":0},"7p6zPGyEjsv86-1JG4euXA":{"text":"We showed up 45 min before close which isn't bad, but I usually don't like doing. The serv","useful":0,"cool":0},"l7YYbQEkgtAmPSrbndAM_Q":{"text":"This is the one place I always stop in every time I visit. If you like Southern cooking, t","useful":0,"cool":0},"KU14TIzh8H8DvQtMyDrHVA":{"text":"I'd been before so I took my main squeeze here for the first night of our 2-day NOLA stay.","useful":0,"cool":0},"Kh9754zbpBZNTK-ZdxXFfA":{"text":"I am giving this place four stars not so much for the food but the friendly nice service. ","useful":0,"cool":0},"ty_waP8Vrs14DrhgFaWBqQ":{"text":"ordered the crawfish ettouffee and did not dissappoint! cheap prices and feels like a loca","useful":0,"cool":0},"azXJpgkn8CuTVLTlLpu-fw":{"text":"I was with a group of people on Frenchmen St and Three Muses had too long of a wait so we ","useful":2,"cool":0},"H9hk7w1c6jvNhuREMvv-4w":{"text":"I have been sitting for 55 minutes waiting for my meal.  This is the worst experience that","useful":0,"cool":0},"ucr5y9AEJHVbIjJqtZupSg":{"text":"Great food, great setting - we had a tasty meal & my pockets were not destroyed.  It's wor","useful":0,"cool":0},"NEEFMK35o2PWOhrITXHu-Q":{"text":"It was just OK...sides were good...didn't really live up to all of the hype. The shrimp et","useful":0,"cool":0},"ZhCgskzscf8MXztyimFAOw":{"text":"Food was served cold. My kids wouldn't even eat the Mac and cheese. They brought the adult","useful":0,"cool":0},"JBRI3-9IHstr6ixHkrKUJQ":{"text":"Betty our server was great and knew what she was talking about when we were chatting about","useful":0,"cool":0},"sM0ZCzQalh6rafLl_PCWpQ":{"text":"Had the pleasure of ordering the fried chicken wings at their French Quarter Fest booth th","useful":0,"cool":0},"bY24lMVQm1i2aVEi8UdbcQ":{"text":"We tried this place on a whim and were super impressed! The fried catfish was spot on, the","useful":0,"cool":0},"2SiTcxHNoQpLWsTbncWGtA":{"text":"Ok, so lightening really does strike twice!  I gave a bad review of this place almost 2 ye","useful":1,"cool":0},"TAwPIW043l19P0jJhG-IZA":{"text":"Fantastic food and awesome service! Best mustard greens I have encountered in a long time.","useful":0,"cool":0},"F-pAp64EahztSUQlBklmQg":{"text":"Nice ambiance.  Off the beaten track. Great lunch. Enjoyed the rib tip special with red be","useful":0,"cool":0},"284H2kRXelgWRev9MHFERg":{"text":"Busy, busy, busy.\n\nExpect a wait, especially if you have a party over four people.  \n\nI wa","useful":0,"cool":0},"nsi5W5OXtqEsi-5TwrQRKw":{"text":"Hands-down, the fried chicken, red beans & rice, and cornbread comprised the best meal I h","useful":0,"cool":0},"OsR5i_sKUf1nPAXUOW5TUA":{"text":"Holy goodness. That was simply awesome. Kathy is awesome, only surpassed by the food itsel","useful":1,"cool":1},"YTFQ-XkTuxt5lxTjLAnTHw":{"text":"Meh, it was alright. My table mate enjoyed her bread pudding, my shrimp po boy had bland p","useful":1,"cool":0},"F4bnA1CPIy_xjrJm-zToGQ":{"text":"This place was phenomenal. The service could be a little better, but the food and location","useful":0,"cool":0},"BGURtUobHzKObwGFU07-gg":{"text":"My experience at The Praline Connection in one word: Horrible!\n\nThe location right on Fren","useful":6,"cool":2},"3ZQJA4vML-M-t1-4D9YYPA":{"text":"Got lemonade instead of sweet tea, no corn breads that were supposed to come with 2 of the","useful":0,"cool":0},"A8RJReap-HJ_1buJGeTxmQ":{"text":"We had a group of five and they sat and served us promptly. I wouldn't expect the same on ","useful":0,"cool":0},"779MGq6-lWXYszPggPCn_Q":{"text":"The Shrimp Etouffee was excellent, everything else was fair-to-poor. Service was slow (eve","useful":0,"cool":0},"J5SUzGZwhQGxIBMyKuedvQ":{"text":"Great service. Best yet since being in the city. Friendly and accommodating to seafood all","useful":0,"cool":0},"f4-DWwtB7OQbsgNHbSGeWw":{"text":"Been in new orleans restaurant evwrywhere and we love the restaurant  staffs. I havent see","useful":1,"cool":0},"MUB2Df8WfOMYwUeW4dPBkQ":{"text":"Found this place just by walking by and had the lunch special which was shrimp poboy and a","useful":0,"cool":0},"DjdRvccLLVN6dv2xR_dbag":{"text":"All I can say is WOW all the food was awesome !\nI've never had fried food taste so good ! ","useful":0,"cool":0},"9IN8JLBtp3f8cVr6PYsKxQ":{"text":"Hello sould food. I love you. I had the fried chicken, fried okra, collard greens & mac n ","useful":1,"cool":0},"KfuDBtKh6MpxBNMqHZMC_A":{"text":"The food was just ok. I ordered the catfish bites, I think, and red beans and rice. The fi","useful":0,"cool":0},"Nlh_9X-u_3pB2nQm8j1k8g":{"text":"My shrimp po boy was the most bland item I have had since arriving in Nola. I've had three","useful":0,"cool":0},"0EXoQPa_NrkknWPBVgzNvw":{"text":"We enjoyed dinner here on our last night in NOLA.  We split the Soul Food Sampler and just","useful":0,"cool":0},"cMow1MO1S_6N-3l_czED4A":{"text":"This was an odd one. We were excited upon entry to have them accommodate our large group o","useful":1,"cool":1},"JVqFXgQLko8zIcRlCzScIQ":{"text":"The food was good, but costumer service needs to be addressed. Our waiter was scripted and","useful":0,"cool":0},"07Jn9bcfbuSeU4eHc04aoQ":{"text":"The food was horrible. The ribs were boiled and swimming in spaghetti sauce, NOT barbecued","useful":0,"cool":0},"MqF8mKAJFeH6PybImmOU9Q":{"text":"This restaurant was very good.  We made it in just before the evening rush.  It is very sm","useful":1,"cool":0},"DSdFZfP61OwqoUzr8wm-pw":{"text":"We were wondering up and down Frenchmen Street looking for the right restaurant for the ni","useful":1,"cool":1},"mAs1qZAVf0is2l8SO3YG3g":{"text":"It was delicious!  The Taste of Soul meal includes greens, corn bread, ribs. Chicken wings","useful":0,"cool":0},"OdKxrXaE4Ji-iGf0MUTxNA":{"text":"What a gem of a restaurant!   The quality of the food is only surpassed by the level of se","useful":0,"cool":0},"YBZklOQws1cFI5OQ-LptEA":{"text":"No Complaints!!!! Loved the food, atmosphere & music!I had the catfish plate with ma&chees","useful":0,"cool":0},"_uIHPdwrqNnpU0sH-eeblQ":{"text":"First the good. The vegan red beans were creamy and delicious even if they were served luk","useful":0,"cool":0},"nSs95V8Ta_KOv7Jww391yQ":{"text":"The fried chicken was good, jambalaya nasty, service worse.  Waited forever for them to ta","useful":0,"cool":0},"kzXgXd_E_EiLaRaKvbXi5g":{"text":"Extremely disappointed In the food and service. Very very very bland, no seasoning at all.","useful":0,"cool":0},"kADV0ojKoicmGZmBgeJ5JA":{"text":"The fried alligator sausages here were interesting. They weren't amazing, but at the end o","useful":0,"cool":0},"G6nneUOEMwIfJCUBc5RALA":{"text":"Excellent sampling of the best New Orleans has to offer. The gumbo is rich and flavorful t","useful":0,"cool":0},"KXhX75fMMgmN9-tSunjBcA":{"text":"Outstanding. We went on a Friday night and the place was expectantly packed. After a sligh","useful":0,"cool":0},"sAFaUXQFNi1k7oQsdM5TWg":{"text":"I was put off by some of the negative reviews but we needed a quick bite before heading in","useful":0,"cool":0},"hZ7w81HgS1h7psmY-oAjYA":{"text":"Food was good , little pricey but the service  was great. Mostly liked the attitude of the","useful":0,"cool":0},"AX22Ve14cKHfup4HjQldaA":{"text":"The food is ok. Not half as good as they use to be. Macaroni and greens was not good at al","useful":0,"cool":0},"CeaJMTV3OtN6n6I2MtdmiA":{"text":"Aw-ight. Ate here on a Saturday for lunch.  Most of our dishes were lukewarm when served. ","useful":0,"cool":0},"beXNlNPax0iYc95IXtG1ag":{"text":"The service is what caused me to give the extra star.  Our waitress was awesome and hooked","useful":1,"cool":1},"Kyrjzx5TRZG4vLw1BFEzig":{"text":"My daughter and I ate at The Praline Connection on yesterday and the food was superb. My d","useful":0,"cool":0},"IkB7AhBMjt_HelG-ehXGUg":{"text":"Expect to wait MUCH longer than expected (especially groups larger than 2 people). It appe","useful":0,"cool":0},"pq4C08g_bILpvnEemgmHiQ":{"text":"This restaurant was a major disappointment. Dried out cornbread, meager portions, mediocre","useful":0,"cool":0},"QSS-0jLFjYPbSr3xdR5WKQ":{"text":"I should have taken the hint when it was Friday night (the beginning of Mardi Gras weekend","useful":0,"cool":0},"AlzcJXWz3SExWt5pttFr2g":{"text":"This restaurant was a nice little walk from the French Quarter. It was in one of the local","useful":1,"cool":1},"dXbsJw1PVVMLul3zQEhkJw":{"text":"The service here was terrible and the food was sub par. It wasn't that busy at all and wer","useful":0,"cool":0},"dS-NDO9Jwq-RUWGMQ-93vw":{"text":"We got really excited for the food but when the food came we were very disappointed! The f","useful":0,"cool":0},"hqWf4QnCLQD4TEroR7tuJw":{"text":"Menu had me set for a nice southern meal full of familiar flavors. Very friendly and promp","useful":0,"cool":0},"N1fbeYaWkDiQjsxkBjisGA":{"text":"The food was very good but the waiter had a bad attitude. He was very short with us when w","useful":1,"cool":0},"VzSGE3MzNd5P-9_ujljGsg":{"text":"This place was pretty bad.  We were seated in the shop area of the restaurant, which wasn'","useful":0,"cool":0},"4EDgSFeEcSPQBqLqxciivw":{"text":"Great food and service!  Loved the fried chicken!  The Mac and Cheese was homemade... And ","useful":0,"cool":0},"lr2zZiU-w6zWI7GfPrxxbw":{"text":"I wish I could give this place 5 stars for the server - our waiter Eyes (that's his name) ","useful":0,"cool":1},"xYHDnNGqBlA-SXbM_-n_4g":{"text":"They have just about any kind of soul food you're looking for.  My main dish came with thr","useful":0,"cool":0},"7ZfG_LRyMNWa5umWv7uv9Q":{"text":"A great out of the quarter place we stopped at for a sampling of their food. We were lucky","useful":0,"cool":0},"TIJ2NDNBAc4UHhkq-ZcF5Q":{"text":"I experience food from this restaurant at the Convention Center.  The line was out into th","useful":0,"cool":0},"wuCOkmjUdtnC_4R908MrQg":{"text":"Food was good. Service was terrible, and the hostess was rude. Wouldn't dine there again.","useful":0,"cool":0},"Feo6uZvfXK7CWm23YH8dXg":{"text":"Great Food, and great staff.  The digs could have been a little neater.  Seeing people com","useful":0,"cool":0},"I90MSmmeVDXKb6zgtR-Pkg":{"text":"Way over hyped!! Ordered Jambalaya with collard greens but got a pile of cold bland rice a","useful":0,"cool":0},"Amq8GRuqmrBFrA_y9bqM2Q":{"text":"Don't wander out of the airport starving and onto Frenchman st, because you may make a bad","useful":0,"cool":0},"P56ej2qX_hVG_t2cDFVG0Q":{"text":"Food was just ok, we went based on a local recommendation.\nIt was busy when we went and th","useful":1,"cool":0},"u8kWebWYuhLHCQT1gYPU_w":{"text":"Best dinner I have ever had in NOLA.  This is coming from a girl with eight generations of","useful":2,"cool":0},"zC77yMMeqoNlHl9KYVuBTA":{"text":"We had the \"Taste of Soul\" platter! Everything was delicious!!!  The waitress was extremel","useful":0,"cool":0},"DcryS-x_wzf0bdC0t7xAOg":{"text":"We had jambalaya here. Although it tasted good, I don't think I would suggest it to anyone","useful":0,"cool":0},"PFlOvG2HCzQ4kQd-b7os9Q":{"text":"Great food. Spectacular service. I was eating alone and the servers took time to have a ni","useful":0,"cool":0},"7Zd0J7lPnky590g8tj0uHg":{"text":"A must eat in NOLA. We have been here multiple times and have never once been disappointed","useful":0,"cool":0},"8MGemB59DpAFYiXaIEpG4A":{"text":"The service was great. I had the shrimp, red beans and rice and mac & cheese which were al","useful":0,"cool":0},"7URtVwyBi_DdER7ZFMehUQ":{"text":"Seriously, the best fried chicken I have ever tasted! Moist, spicy, and a deliciously cris","useful":0,"cool":0},"ZzMncAk4sbMd_0YYUrf-xw":{"text":"This place is famous for their meatloaf which I thought was just OK and I just wasn't craz","useful":0,"cool":0},"nMhmXgWzS6QnTAMs4lNMjw":{"text":"We came to Praline Connection because a friend recommended it. We were very underwhelmed b","useful":1,"cool":0},"K_eS32Q-kGtS87mmacodTg":{"text":"deliciously light fried chicken - battered perfectly which is to say just enough for it to","useful":1,"cool":0},"UBWqrv7bGqximwCnziH4wA":{"text":"Friendly staff, clean, good food at a reasonable price. Pralines are excellent. Shrimp Éto","useful":0,"cool":0},"34szvsotBzdV96JG4XmeHw":{"text":"This is heavy duty soul food as far as I'm concerned. After dining here more than a handfu","useful":1,"cool":1},"J_EbMkPN9gU9zk3lmGUC_g":{"text":"The Praline Connection is a good place to go if you are wanting some soul food. It looks l","useful":3,"cool":2},"j5qnrglF3hOIkZRjiDc0jQ":{"text":"I had white meat fried chicken, mac and cheese, beans, and cornbread. The friend chicken w","useful":0,"cool":0},"MDWfWpfh6eIzzVeMSZBqEw":{"text":"Early dinner on a Saturday and we just walked in and were seated. Great service and very f","useful":0,"cool":0},"x6cPWCFlTB8o85G7REm1TQ":{"text":"Located in the Frenchman area, a hang out for locals is the BEST soul food I have ever tas","useful":0,"cool":0},"_jZNvkKcg9h9ozxGUP7zeQ":{"text":"Stopped here our first night in NOLA, my husband and I both ordered the shrimp po boys. Th","useful":0,"cool":0},"xOg9Qm1_r0N-9i02-Ms2bQ":{"text":"Definitely a great spot to stop before heading out on Frenchman Street. Admittedly, I was ","useful":0,"cool":0},"Pp5i466TNJgjHLGQIxYLeQ":{"text":"If you are looking for some amazing soul food.  The Praline Connection is the place to go!","useful":0,"cool":0},"IHqedmqy8Y-f6FcwEJe_9A":{"text":"Back again Prailine Connection. The fried chicken was just as good the 2nd time around. Ou","useful":0,"cool":0},"TimvtY2pHq8teNhpzHogFQ":{"text":"My first encounter with this establishment was not at their location on Frenchman street. ","useful":0,"cool":0},"UdLSyu-a1Q1pKGzlz_nMkA":{"text":"I love this place for home cooking in the Marigny.    Last time I was there a brass band w","useful":1,"cool":0},"TY4nNyaKNVLKyANy5FhxIA":{"text":"It was the worst experience of my family and my life. The food was absolutely horrible. We","useful":0,"cool":0},"WzmiFaOJgDSLCPQ9PTXKhA":{"text":"This was an interesting place. They were nice enough to be able to quickly accommodate a r","useful":0,"cool":0},"brBZA2GHKk-iU_5pO8pmPQ":{"text":"The food and service here was simply the best.  We had a large party and we were able to b","useful":0,"cool":0},"PmXhmCDcqvMQT75PpoLbsw":{"text":"This review is from Virginia. My girlfriends and I were in the mood for creole cooking and","useful":0,"cool":0},"b1Ezrqu2RxS8N0lEu2RT1A":{"text":"The home style meatloaf was good.  It was flavorful and tasted just right when combined wi","useful":0,"cool":0},"ymr6TwL4VC4Z83b3haH0Bg":{"text":"Recommended by locals!  Right on Frenchmen street so grab dinner and enjoy the street.  Th","useful":2,"cool":2},"kYje1Jit7ZYp_am8QmLZYw":{"text":"Visiting New Orleans, my friends and I stopped in to the Praline Connection due to its con","useful":0,"cool":0},"57nn1cBhMSgUpQs5XBarnQ":{"text":"HUGE portions! Crawfish étouffée & fried oysters are very good. The fried okra is excellen","useful":1,"cool":1},"VTYFgVb9Js3joQ5w44BJcg":{"text":"Their food, drinks and service were all wonderful. I ordered the jambalaya with a Cat. 5 H","useful":1,"cool":0},"ptlxtVo07-XnZTS_HcAuJQ":{"text":"Super friendly and attentive wait staff. We started with the fried okra, which was delicio","useful":0,"cool":0},"62CvYveJh1b6aWbkW1YlUw":{"text":"Good food, nice wait staff. The dining room is a bit small so plan ahead. Short list of re","useful":0,"cool":0},"wYPhCAbH9WrjUsAiFsEprQ":{"text":"Great place to try if you want some true Louisiana cuisine. I has their ribs, yams, potato","useful":0,"cool":0},"X1BJjWvCMTOro_g6DJADcw":{"text":"Real local delight!  Best fried chicken ever!  Half-chicken included 2 thighs + a leg.  Ha","useful":0,"cool":0},"TCOzMDQqFP7PKMF07FPO2Q":{"text":"The food is ok.  The service is horrible.  Long wait outside because the servers were too ","useful":1,"cool":0},"XErMaZfEeSFPBHrTfDs6Gw":{"text":"We went to the praline connection for a mid-week dinner and it was phenomenal . The servic","useful":0,"cool":0},"WcF55_Scaf8ih-rxZYkMlA":{"text":"Had a vege plate w Lima beans, sweet potatoes, cabbage, and mac m cheese. Also had the mea","useful":0,"cool":0},"5HmewYjYR0RTF7ZzJyCP7Q":{"text":"Meh. After hearing the hype about this place I expected more. The service was excellent,  ","useful":0,"cool":0},"dha4SzxGN5kPw7eXnW139w":{"text":"Randomly stopped in here during a night of patrolling the jazz clubs on Frenchmen Road. \n\n","useful":0,"cool":0},"19Tj2Q8xclH2BanEbNiKVw":{"text":"Delicious, authentic soul food.  The best dish was their ribs.  Fried chicken was okay.  F","useful":1,"cool":1},"PgcH09CyQgNvHUzd-jEX8w":{"text":"WARNING TOURIST REVIEW: \n\nMaybe I'm just a New Yorker that wouldn't know good creole/south","useful":4,"cool":2},"_YizmbPMNH19v1vE3gOtbQ":{"text":"Was really hoping to like the Praline Connection however was severely disappoinfed.  The s","useful":0,"cool":0},"yfJuKAspyBRCfGLA1M333w":{"text":"Food is good, service is great! Southern hospitality!! Expect to wait atleast 30mins. Chec","useful":0,"cool":0},"v-I7xwXYS9y_Fk2ynOSfMg":{"text":"I love, love, love this place!!! If you love traditional southern cooking - real SOUL food","useful":0,"cool":0},"bRhZxzS8dKp-kl-uQgr9Rw":{"text":"While waiting for my take-out order of bread-pudding with rum sauce and cheesecake with ru","useful":2,"cool":2},"_UQrwIRoqZkDPu-rthMJug":{"text":"Awful. I've eaten there 5 times over the years and it never gets better. You want legit so","useful":0,"cool":0},"YI4QGUU6WbGZ-2g2cHi_Og":{"text":"Spent a long weekend in NOLA and we stayed across the street from this place.  I had been ","useful":0,"cool":0},"UiBGLUzAC2Obyp1Cm4Cn_A":{"text":"This was one of the more tastier meals here in NOLA\nI dont entirely remember what we order","useful":0,"cool":0},"boq-jJQU73cEl9EtJmmZ-A":{"text":"I had to wait for 90+ minutes at the FQF for the chicken wings and collard greens. This is","useful":0,"cool":0},"rNsw5hAs0d6d-zdxNLXBTg":{"text":"Worst service I've experienced in a long time.  There was a wait when we got there, about ","useful":0,"cool":0},"mrfPqneR3_UsFeUI1SLqcw":{"text":"Best fried chicken I've ever had...anywhere.......Red beans and rice, fried chicken, colla","useful":0,"cool":0},"bXRgqpcYwMc1fAk3Y-Gd8w":{"text":"This is a bit late, but still sincere: My wife and I had the opportunity to dine at the Pr","useful":0,"cool":0},"Ek6DSm8uJn92-I_7X9Nm-A":{"text":"The fried chicken is too die for. I'm taking off two stars for service, though. I realize ","useful":1,"cool":0},"9YLnNEX1DxpZGwl8usYVqA":{"text":"This was the only real miss on my trip. I thought the service was fine, very friendly actu","useful":1,"cool":0},"W7Y9f1F2DQrvk3awvDxNng":{"text":"The food is soooo good! I ordered the stuffed crab plate with collard greens, mac n cheese","useful":1,"cool":0},"F-9oLflbCBtj7iX-9s6VUQ":{"text":"Cute place but terrible service.  Be sure not to come here if you are in a rush.  There is","useful":0,"cool":0},"OsEBSXg3mR3-mfnEfp4P1w":{"text":"Authentic, unaltered soul food. The greens, the meatloaf, the crawfish etouffee...., delic","useful":0,"cool":0},"ZFTUmlGYA7wIejUWoN2QEg":{"text":"We always go to praline connection when we visit New Orleans. Consistent and delicious and","useful":0,"cool":0},"bEDmTHob2CeiZniv-LcoQw":{"text":"The food took about 25 minutes to come out and wasn't even hot.. Fried chicken was terribl","useful":0,"cool":0},"vwWiXnKS0Gx78WFev1ZdMw":{"text":"This restaurant was awful the fried chicken wings had feathers on them the macaroni was dr","useful":0,"cool":0},"gMZcUuxWVCbdXSryCInNew":{"text":"Delicious fried chicken, collared greens, mac n cheese, an Abita and a slice of corn bread","useful":0,"cool":0},"Z-mVan90e-4xg0hJi-SGnA":{"text":"Ok. This place was NOT as good as the reviews claim it to be, and I'm just gonna keep it r","useful":0,"cool":0},"rVl2wOJgNvv0kPBca3rUHA":{"text":"Now THiS is what I am talking about. This is the food and ambience that we were searching ","useful":2,"cool":0},"2_Bwn1gLeEMZ8uBg9YpS8A":{"text":"accidentally deleted the pictures of the red beans and rice ($7) and my fried livers ($3) ","useful":0,"cool":0},"6JhjKJkE5fwFVJWV49KqPg":{"text":"The food was Great! Service was excellent (waiter Troy very attentive) fried chicken wings","useful":0,"cool":0},"8eyF3yd6T-9PDFiMEhL-bQ":{"text":"Not at all what I remember when this place opened almost 20 years ago. The service was hid","useful":1,"cool":0},"QK_agOHdm6u4SxcnbtzwRg":{"text":"Large portions of comfort food. The pork roast was tender and the cornbread moist and warm","useful":0,"cool":0},"NuXv0McieB7EYZgqQXTKbw":{"text":"Try the fried pickle chips. Best. Thing. Ever.\n\nI had the red beans with the fried pork ch","useful":0,"cool":0},"hKUz2Z-0JCxl-UjA5BrCRw":{"text":"Overpriced not good food. Also they have a very weird table seating system...you can walk ","useful":1,"cool":0},"mT_fLlXzb9vFsBaNTT0PSg":{"text":"Just a couple of weeks ago I experienced my first visit to New Orleans. While in NOLA we s","useful":0,"cool":0},"gHh30QFcYWTjS0L9OsiUyg":{"text":"Fried chicken livers with pepper jellies: The food of creole gods. Worship it and write po","useful":0,"cool":0},"NQsZNYr9IEL-5Kk5EOcuzA":{"text":"We went at the tail end of dinner on a weeknight and didn't have to wait at all for a tabl","useful":1,"cool":0},"3QshqnvIfJQWREbyWTUyAQ":{"text":"I hadn't been to the praline connection in years and was pleasantly surprised that it hasn","useful":0,"cool":0},"8XBZ0LMToxAH8WorGvMIxQ":{"text":"The pralines are delicious and not over done. The po boys were delicious and actually the ","useful":0,"cool":1},"xFpVUSq248qt22DTAMNycQ":{"text":"This place was recommended by my friend and the food was so good that we had it twice duri","useful":1,"cool":0},"N9dsM_6AW3ucmryBZsH9hg":{"text":"Oooooommmmmmggggggg!!!!! This place was very pleasing to the palate. Went on Sunday mornin","useful":1,"cool":1},"Ldkutac3Kcm_7TbZjNjehg":{"text":"The food here is usually good. After reading the reviews concerning empty tables and inatt","useful":0,"cool":0},"nLr9RW8iHrAx7M20N_4aJA":{"text":"The central point is that this place is great value. The staff are extremely friendly and ","useful":0,"cool":0},"amIXv0m8C3l9dt39sCslbA":{"text":"Despite Frommers telling people this place was overrated, I decided to try it nonetheless.","useful":0,"cool":0},"OWFcLfzxOkDgXUZ4CvhfmQ":{"text":"This is an update to my former review. Well l had to send the owner a message, and l was t","useful":0,"cool":0},"0xE9h21QxU1I5D8MlKetmQ":{"text":"Food was amazing but service was bad. Our hostess last night didn't look too happy doing h","useful":0,"cool":0},"KRvIGVFq1Myu1vQGnK7f0w":{"text":"I actually have given you guys a second shot recently. And had the exact same experience. ","useful":0,"cool":0},"QY6taUpZo0ZY2xNUR168lg":{"text":"Went to the Praline Connection on at Saturday night ... Restaurant was moderately busy. Wa","useful":0,"cool":0},"7ScRqJUteOgjjetGcFCBgQ":{"text":"I was okay waiting an hour for a table. I was not okay waiting FORTY FIVE minutes for a wa","useful":0,"cool":0},"BEbyPxxKZ3MAjbdIIyugdQ":{"text":"Seriously over-hyped. \n\nOut of all the things we had, here are...\n\nThings pretty decent:\nR","useful":2,"cool":1},"kIV92WPCTz_HE362lVM8xw":{"text":"If you love soul food/comfort food then this would certainly satisfy your cravings. The fr","useful":0,"cool":0},"FCbe2e1aAJQB812AbjTzTQ":{"text":"Stopped in on our arrival to town for a quick lunch.  We had been in the car all day and w","useful":0,"cool":0},"Bdurhx-cHEYotqEB0XiqDQ":{"text":"I gave them a 2 because the waitress was very polite and attentive. I ordered the gumbo wh","useful":0,"cool":0},"snM9ugdFILdacgTbDrLEEA":{"text":"Leave the French Quarter for an hour or two and walk to The Praline Connection on Frenchme","useful":2,"cool":1},"tA0JntAkb9wtcEK2bturdQ":{"text":"Stopped by and bought a praline, a side of red beans and rice and a small cup of gumbo.  E","useful":1,"cool":0},"XkBI9sWAnvVXE5dep_ovyg":{"text":"The service was great, super friendly and funny - it helps that we have a very cute baby b","useful":0,"cool":0},"qwhxCaIdKpWbBskHcKEIrQ":{"text":"Enjoyed the shrimp and soft shell crab po boys.  The pralines are super tasty!","useful":0,"cool":0},"ShKdqGF7zESoyKTm0vqf7g":{"text":"Meh. went as a group. 1. The restaurant is not huge and gets a little crowded. Food is oka","useful":0,"cool":0},"78vWf7B4CQxfVpRB3Pgcuw":{"text":"Yeah, this is a good bet for good tasty soul food in the Frenchman st. Filling, tasty clas","useful":0,"cool":0},"3bmTHgHZAVoN4Y-ettp26A":{"text":"Fried oyster po boy is very hoof as well as red beans and rice\n Skip the mac and cheese an","useful":0,"cool":0},"sZDudQe_VZRgJz5Voggadw":{"text":"If you're visiting New Orleans and looking for some great soul food , this is the place to","useful":0,"cool":0},"lLf67i8wv8a3AoaqS2XD-w":{"text":"Quiet, present atmosphere in an otherwise loud neighborhood.  The food was prepared to my ","useful":0,"cool":0},"e1pDhL8wWMqs6yOvPv58hw":{"text":"Ugh - a really mediocre experience here.  Came with two friends on a Saturday evening. We ","useful":1,"cool":0},"e5om_OLhTPBEycCsVCacnw":{"text":"I've eaten here twice, many years apart. I don't think a single thing changed over the yea","useful":0,"cool":0},"4nbfFAHPAM_KsDSWlQdVHw":{"text":"The only thing I liked was the bartender Victoria.   She was excellent !!!  She made a gre","useful":0,"cool":0},"zZreyRY9N-Hh4TJLNy9ZXA":{"text":"Omg! Outstanding customer service! Yams and Mac n cheese were delicious! Dont forget the p","useful":2,"cool":0},"O6T5Wp0hVdlalZVRkSk-IQ":{"text":"By far one of the best restaurant dining experiences! The food here is beyond delicious + ","useful":0,"cool":0},"UASsotGX3K7j5mxGL5SgvQ":{"text":"We had dinner here last time we were in town. I don't remember much about the food, but wa","useful":11,"cool":11},"0zVYXpFEKOz2OkaIQwwSkQ":{"text":"1st time here and WOW! It was great. I had the stuff bell peppers with rice and gravy with","useful":0,"cool":0},"SG1se7OudxhCUiV2SNYbKg":{"text":"Good food, but the Service is consistantly very very very slow. I have had to go find the ","useful":0,"cool":1},"5FMpQJrVoLuQ8CeAoj0Siw":{"text":"Ever since I ate here I cannot get enough macaroni and cheese! They have the absolutely be","useful":0,"cool":0},"j-dGCltk37fiHW1wwzHrUg":{"text":"I should've heeded the reviews on this place before stopping in. First, there's no standin","useful":0,"cool":0},"PlIjjP-kMZ_jY4gpe4qDOw":{"text":"The food was slightly above that of a cafeteria, but at least the price matched the qualit","useful":0,"cool":0},"TgPEJ6fKpUe-yOhECStpAQ":{"text":"Started with a bowl of etouffee, continued with fried chicken (OMG best ever!) and finishe","useful":0,"cool":0},"JlD30sDdcyxQy4mVHiKwbg":{"text":"The food was AMAZING!!  The portions are very hearty for the price. The service was less t","useful":1,"cool":0},"8-bwf3tIIZuwgx692i9ABA":{"text":"We had the sampler (can't remember the name of the dish exactly, but it included BBQ ribs,","useful":0,"cool":0},"QPmu8wOyKl4UW5cotM_x2g":{"text":"Really disappointing! No fried chicken which I remember was really good. Ordered stuffed c","useful":0,"cool":0},"R0sf-LLJ_dkZV8q7TBu9Gg":{"text":"Greatness! \n\nThis was the best meal that I devoured during my NOLA visit! \n\nWe came across","useful":1,"cool":1},"F2g9TJ73NwZr_dDvsPOsiQ":{"text":"The dining experience was decent, definitely no complaints from me, but ordering anything ","useful":0,"cool":0},"K3D63GVd1uq0t82-4cZ7TA":{"text":"Meatball po boy was excellent, staff is friendly, pralines are great. Prices are very dece","useful":0,"cool":0},"8nzrSu_680TLKacrCN6UgA":{"text":"We came to the praline connection to try their soul food despite of the mixed reviews I re","useful":0,"cool":0},"sLivO9uw0ArqkL0AAGmgBg":{"text":"I STILL love Praline Connection. The BEST collard greens around. I eat here EVERY single t","useful":0,"cool":1},"kUv0Kv8oE421BuqYhSLt2w":{"text":"So the place looked nice and clean.  The food was not bad. However,  service was awful.  I","useful":0,"cool":0},"4hFoxWPDDuTvCAVGV4xYoQ":{"text":"This place was awesome. Such nice people, great atmosphere, perfect location - the food wa","useful":0,"cool":0},"d2imloFy1si2h0tDt8YV5g":{"text":"Not the best place to go if you're in a hurry, as the service is competent but slow.  The ","useful":0,"cool":0},"RvW83oYAgb76Uv5-GGTxUw":{"text":"Delicious soul food.  I'm particularly fond of the red beans and rice and come here each t","useful":0,"cool":0},"79PwosY-SumQEsZRFs4uKw":{"text":"Amazing bread pudding..would go there just for this..fried chx wasnt as juicy as first tim","useful":1,"cool":0},"SKzkIs1coP_As5qsSvh4NA":{"text":"once we discovered this place we ate there 2 days in a row!!\nDelicious!!!","useful":0,"cool":0},"9krzVu0LygsTkKKAALZeTQ":{"text":"Get your happy self over here!  My co-workers walked in slowly and wondered what in heck I","useful":0,"cool":0},"aMoA5IEeZ_-Vopezc4H7EQ":{"text":"Never has gumbo until I came here. This place was personally recommend by a local and I no","useful":0,"cool":0},"A9VDeNXX8y4O98dvxpDoGA":{"text":"This is one of the best places to eat down on Frenchmen Street as a native from Detroit li","useful":0,"cool":0},"1TPRWRJzHICFKxczdj38IA":{"text":"Excellent food, the meat loaf is worth stoping ln itself, Good People and Good Service. I ","useful":0,"cool":0},"3YfEt2taiMKWLLPXrp5jdg":{"text":"Praline Connection has been one of my biggest letdowns in New Orleans so far.  They claim ","useful":4,"cool":0},"XDeswgFDqdujDs9g3sAUIA":{"text":"Mmmm...DELICIOUS! \n\nOrdered the Fried Chicken Livers and the Fried Chicken Dinner, one bit","useful":0,"cool":0},"1lgyq91dQEIRS4e3XeAJcQ":{"text":"excellent pralines, great atmosphere, extremely friendly wait staff. The food came quickly","useful":0,"cool":0},"bKOHjC5Ofgd6PdYBCdl7Cw":{"text":"Terrible terrible service! Waiter came to ask if we've been helped 3 times and then when I","useful":1,"cool":0},"cboaeeAlLymyp9JCzBe1Zg":{"text":"Stopped by late in the afternoon for a snack, because we'd had the fried chicken recommend","useful":0,"cool":0},"vfseSTSLVOcLpV-uwnM4Fw":{"text":"Best beans and rice in the quarter!  Staff's friendly and attentive. Check out the sweet s","useful":0,"cool":0},"jYZ9PZ3e9QvT8YLS61guDw":{"text":"For a whole in the wall joint I was impressed. Service was great. The waiter was awesome. ","useful":0,"cool":0},"wYk5hC4zwPtbQGGjF9O32A":{"text":"This was our first time in New Orleans with no idea where to start. PC had tasty Cajun foo","useful":0,"cool":0},"2U1YsflxwLu_oOL5D-1nhg":{"text":"If this is your first time in New Orleans you must eat here! The food is amazing!!! Try th","useful":0,"cool":0},"uA03nPTPCtAgZQNexAaGfw":{"text":"The food and service were amazing!!! Our server Nicholas made great suggestions and was ve","useful":0,"cool":0},"-R96C9NWQP3p-V21mI5zuA":{"text":"As I pulled up to this place, I felt like I was in Berkeley, Ca. Private shops littered th","useful":0,"cool":0},"XG-P4m0TXFYniBCplg57VA":{"text":"Horrible service. The waitress had an attitude from the moment we were seated. Several tab","useful":0,"cool":0},"QmquOSmmXPKscqvkjR2PNQ":{"text":"Absolutely delicious !\n\nFriendly, nice and curteous services.\n\nThe Taste Of Souls is excel","useful":0,"cool":0},"lecmrInqJIkZOI02-wdYeg":{"text":"Sweet tea was delicious the waitress was so friendly and had great recommendations. I spli","useful":0,"cool":0},"Y51ZSDnuLo68GiHvv6D6PQ":{"text":"After the long hot wait outside the restaurant (with empty tables) I have nothing exceptio","useful":0,"cool":0},"xQd0VUsGJ3Shbn9mP4-xbQ":{"text":"Our last night in New Orleans (sob)...the youngsters were getting tattoos at Electric Lady","useful":2,"cool":2},"dBio5SrptX0JLTTNEOUynA":{"text":"My least favorite restaurant in New Orleans. I suggest the many other establishments on Fr","useful":0,"cool":0},"vHpLBANex-SPa7UPXwChpg":{"text":"Our only really disappointing meal in New Orleans. Food was just okay. Both the gumbo and ","useful":0,"cool":0},"HyCK-bw7syBbmPvDYBzs9A":{"text":"Great restaurant!  The Praline Connection doesn't look like much outside (or inside, reall","useful":0,"cool":0},"etUaTdhR_M6oxq6RSIcfyQ":{"text":"This place has amazing food! If you want soul food, COME HERE!\n\nLets start off with the kn","useful":0,"cool":0},"rFXn2uDAbPx16-BORF5PlA":{"text":"I went on a Saturday night and waited about 30min for a table, it was so worth it! Me and ","useful":0,"cool":0},"cza_3NsFJGA3m1wIdv7Jkw":{"text":"The food and service here are good.  I visited with friends and we had a good time.  We or","useful":0,"cool":0},"3utBzJm2SeCRqCqsgv-fpQ":{"text":"We ate there twice during the first weekend of Jazz Fest.  The first visit was a memorable","useful":0,"cool":0},"_HYrrR9Na4RxhIH26fZbow":{"text":"Will never eat here again!!! Long wait time for food. Waitress never came back to check on","useful":0,"cool":0},"ZzY_hsz6X0BDOSIw9PiFxQ":{"text":"Not much to say about this place. We went on 7/31/16, and the place was practically empty.","useful":0,"cool":0},"eq5wN9UstjoJLooBJbaV0w":{"text":"My husband and I ate at the Praline Connection last night, Monday,  before we went to Snug","useful":0,"cool":0},"fI680oWMvNmyWpxHRrHwkw":{"text":"Fried chicken livers with gravy. Under $4. Yeah this is not fast food. Avoided the \"typica","useful":0,"cool":0},"-3YD2cUbZcSGCFp9B6BviQ":{"text":"Home cooked goodness New Orleans style, awwww yea","useful":0,"cool":0},"PctansXTl7sJffW2DOT9Dg":{"text":"My wife & I had great pleasure in literally over indulging some of the best soulfood cuisi","useful":0,"cool":0},"WW7X4O5SrZTf6d4KC0Dqtg":{"text":"The fried chicken is delicious and is what I would recommend to anyone who dines here. Be ","useful":0,"cool":0},"b2Ecy1DPNk2TwT4tkaC1dA":{"text":"Stumbled into this place on our way back into the Quarter.  The menu looked good and reaso","useful":1,"cool":0},"PzfK1mP1iX_UpykWoBPRCg":{"text":"Homestyle grub right in the middle of the local action in New Orleans..  this place rocks!","useful":0,"cool":0},"Y4Ie7Lc03LfLsKdwZOU1mQ":{"text":"First time & i was pleased. Food tasted great & was hot. Cornbread was really good. Will d","useful":0,"cool":0},"xINwem3VoU9yvKO6dsIXMw":{"text":"Don't do it man!!!!!!!! Food is terrible and the service is worse. Walk down the street to","useful":1,"cool":0},"cqXmMRff7kvND_YQxYnieA":{"text":"Two reasons I love coming to New Orleans:  it's unlike any other city in the U.S., and the","useful":0,"cool":0},"JjNQxqaw2TFzQvPnO42-aQ":{"text":"My friend and I waited for a while, as we had no reservation, but we weren't starving and ","useful":1,"cool":1},"-_Kksui-OwgyV_uDSZBUxg":{"text":"Because I'm apparently ten years old I typically don't eat any meat on the bone. But c'mon","useful":1,"cool":0},"vdtyXcaU_o8Ibw08TGOnBg":{"text":"We went to French Quarter Festival in April.  We go almost every year and have tried many ","useful":0,"cool":0},"wVlqMwp2Jnb3k7VG7srL_A":{"text":"This is a cute little restaurant off Frenchmen St serving traditional southern food, inclu","useful":0,"cool":0},"nDr8ADfHAfNFCK-AX_uXlg":{"text":"So whenever I'm in NO I make it a priority to stop at Praline Connection. It's a small and","useful":19,"cool":21},"cOXklc9maR7BAgmhFEhELw":{"text":"Maybe this place was good 20 years ago it's not now. Had the fried chicken, it was not spe","useful":0,"cool":0},"zm5YZ-X_PJ1HGSBqnnmHzg":{"text":"Did not get the chance to really try out any of the food. Our server suggested the seafood","useful":0,"cool":0},"fAxmuqE6N8qt-XBJDquh-g":{"text":"Praline Connection was quite possibly the best place that we ate at while in New Orleans. ","useful":1,"cool":1},"3-YfEGYFatU8408OX4Cr_g":{"text":"Didn't like the fried chicken this time. The fried-liver burps the next day grossed me out","useful":1,"cool":0},"txjGvncqRs8VWGhL3aZhqw":{"text":"We went to the Praline connection on a recent visit. Roland was the waiter, he was wonderf","useful":1,"cool":0},"_caWPlyJvkNNZqnjqkiyvA":{"text":"Soul food! Pretty convenient location in the old Billiards Supplies store on Frenchmen. I ","useful":1,"cool":0},"yJhqADgEE-6O20ysTkdVIA":{"text":"Such a fun place! What a great vibe and atmosphere. While walking around Frenchman Street ","useful":5,"cool":1},"ZNY-YOyGFWwKVRSYylqwMQ":{"text":"This place has the best fried chicken I have ever had!! Hot, fresh, made to order, crispy ","useful":0,"cool":0},"B7EAp-5zw_9hK0FA-fuHrw":{"text":"Wow! Thanks for caring enough to respond! I had the gumbo which was watery and fair, other","useful":1,"cool":0},"9UNSuKxnx-1TGRK7ayKPng":{"text":"Decided to check out this restaurant on my trip to New Orleans. I definitely wasn't disapp","useful":0,"cool":0},"-8_0woG18U5kfxlQ6j2Z1A":{"text":"Halloween night walking around the French Market. We found this restaurant and decided to ","useful":0,"cool":0},"HLNHB9ZU5xMw19rM7hLmqg":{"text":"For my one-day visit to the French Quarter, I looked and looked for a restaurant that serv","useful":0,"cool":0},"tSlPxJQ6wXCFWUj_EUQHNg":{"text":"Oh hell yeah!  This was great!  My friends and I just shared appettizers.  We had BBQ oyst","useful":0,"cool":0},"1y7smmG1WPknGFN03Uv7YQ":{"text":"the most addictive collards ever. like crack. fantastic fried chicken and great service. w","useful":0,"cool":0},"dLpLGA9X3wIV4ObqEuEpJw":{"text":"Excellent choice for dinner. \n\nDecor is clean and inviting.  It's a comfortable place to j","useful":1,"cool":0},"ozar3UtNkaVuIwXau9PvPg":{"text":"Well a complete waste of time coming here. Not sure what show this was reviewed on but the","useful":1,"cool":1},"IPbyGzQ5EqQA0mtDl81njA":{"text":"I ordered the catfish bites, okra ,  jambalaya , greens , pralines and a mango Daiquiri. T","useful":0,"cool":0},"51hWsjXJ10xHOdfJUsFhXA":{"text":"Stopped by and bought a praline, a side of red beans and rice and a small cup of gumbo.  E","useful":1,"cool":0},"tflUO0m7sIWG32bk5E-4Zw":{"text":"Great food! Went for a late lunch but the lunch and dinner menu is the same. Fried chicken","useful":1,"cool":0},"pS4AiDKmAEJH-TZBGp5jGg":{"text":"In my humble opinion, this is the best place to eat on Frenchmen. They have very rich, ver","useful":1,"cool":0},"PCI4ybRgMPCpEUJbGGnr7w":{"text":"I am angry, angry, angry that I've visited Nawlins so many times but have not eaten at the","useful":1,"cool":1},"isjWRyefHIGONPVMJszaoA":{"text":"The food was very flavorful.  Our group each had various entrees and all were very pleasin","useful":0,"cool":0},"uT7NJmwfgdANCKUb49S9gQ":{"text":"I thought the food here was amazing. Table slapping amazing. The service was GREAT, and I ","useful":1,"cool":0},"ev0xWYcWGY0OsYbVg0vcqA":{"text":"I've eaten here on many occasions in the last 18 years. Every time I come back NOLA I go h","useful":0,"cool":0},"a9R_sNftXVkmOAQjR2lZZA":{"text":"Unfortunately yelp does not allow zero stars because I would give this establishment zero ","useful":3,"cool":0},"tPM1nfJHmBlsJ8_XJUXZRg":{"text":"I'm originally from New Orleans and have always wanted to eat here, but it just never happ","useful":1,"cool":1},"sHDODmms7Ogi8JKYJQoRog":{"text":"Oh for the love of pralines, how I wish I had a truck load of these amazing cookies. The r","useful":1,"cool":1},"TLonosHN9gL-eASdVLAStQ":{"text":"On my first trip to New Orleans I asked some local folks where to get some quality Nawlins","useful":1,"cool":1},"sfUT85YC5pNUTIU-XDrRPQ":{"text":"Came to this well known local establishment on a recommendation of a friend.  Casual atmos","useful":0,"cool":0},"M0VIHkr7wiuI7SEVsPNTew":{"text":"Great service. Good food. My cup of Gambo soup and side of macaroni  were delicious, but s","useful":0,"cool":0},"yI9BmIMAjfZdu8CZ5Ong4Q":{"text":"Waitress took forever. I think she went on break twice while we waited for our check. The ","useful":0,"cool":0},"bZrjJ000kXOZVgenPIlqog":{"text":"My husband & I have been coming to New Orleans once a year for the past 15 years but have ","useful":0,"cool":0},"KdkG4o46ut855RWa8NstVQ":{"text":"My husband had the jambalaya (oh yum!) And sausage  (double yum). I wasn't too hungry and ","useful":0,"cool":0},"FmgZbe46zkb8nXVZHK8w2A":{"text":"While strolling along the streets of New Orleans we stumbled upon this interesting looking","useful":1,"cool":1},"4KL8M-45BQrgiu_wVNtqbw":{"text":"25 minutes to closing time and their door is locked and the waiters refuse to acknowledge ","useful":0,"cool":0},"QxdaML3LdjMZT8SSdC0D2A":{"text":"Very fine representation of Old South cooking in hospitable environment.\n\nA recent dinner ","useful":2,"cool":1},"VFNEt2vhPN4bFVg5zzuyRg":{"text":"The WORST service I have ever received. Took an hour to just get a water after being seate","useful":1,"cool":0},"78IKfrMpi-nbcZnLZ2exAA":{"text":"I think 3.5 Star rating is very fair, it's a cute and good place but not outstanding, good","useful":0,"cool":0},"KPsuhY0QrdhM4n8nAic6_g":{"text":"Our server , Jesus, was very cold and arrogant. The macaroni and cheese tasted like Kraft ","useful":0,"cool":0},"K582t-RsrDlJAIiJuZGV6g":{"text":"Who doesn't like Southern Home Cooking? This place hits the spot when you're on Frenchmen,","useful":4,"cool":4},"G26HZZ6Xb4iIRP3BAXdreA":{"text":"We came here at the suggestion of a tour guide for the best fried chicken. It was definite","useful":0,"cool":0},"zCEwIwS4hmyZwGo2ZuFPkQ":{"text":"We were hungry and tired of walking so we stopped here to eat. There was no wait, so we we","useful":0,"cool":0},"tHH8o1ii1f5K6YCCgDrxDw":{"text":"We took Ms Ann's advice and gave it a try. We had a large group of 14 and not one of us wa","useful":0,"cool":0},"S4y_p7Shgx-MclQKsg13WA":{"text":"First of all good service, the  young brother was very attentive as I ate and reflected of","useful":0,"cool":0},"UStyg92XZJdx-juSnXEW3A":{"text":"This restaurant was another recommended dining experience by my hosts. I had the File' Gum","useful":1,"cool":0},"dm4Y0Le4rIaOZ2rpHbTVUA":{"text":"We live near NOLA & have eaten at many places over the years. Sadly its hard to find a rea","useful":2,"cool":0},"ZS1Ble21_FGQcOZv42_j8A":{"text":"Been here before, much busier and got great food and service...sadly, can't even talk abou","useful":0,"cool":0},"T4n7Ge9STxUZEO-hhcMnjQ":{"text":"Try the fried chicken livers with the hot pepper jelly. Yum yum","useful":0,"cool":0},"UCgC-57abjnU9FxEK7zOvA":{"text":"While in New Orleans on our last night here, we decided to venture  past the French quarte","useful":0,"cool":0},"VPN22NcfhWd5dWI7b5oMQw":{"text":"On our last evening in New Orleans, before my roommate Emma and I headed down the block to","useful":2,"cool":1},"pnq1_4Rf0i16FMdmg0hvKA":{"text":"B E S T Peach Cobbler in NOLA!!!!! I'm a peach cobbler connoisseur. I asked a bouncer in t","useful":1,"cool":0},"MLAKfoZXe7oibapLIHOffQ":{"text":"The manager was awesome- our server was just ok. She was the one who initially welcomed us","useful":3,"cool":2},"taxfjUnxQ6bNcZbXm5hoFA":{"text":"terrible service, slow unengaged and food was OK, mixed drinks too expensive.  2 he's for ","useful":0,"cool":0},"1dTh5u3U8F40W6pmow9UeQ":{"text":"Great spot for a quick bite or a sweet treat... It's great for the tourist or for someone ","useful":3,"cool":0},"kNdw3ZqCVZbwvuTSmU287g":{"text":"So after winning a 50 dollar gift card to the Praline Connection I was really looking forw","useful":1,"cool":0},"YHSQ5zLqYve2odmUASJOuA":{"text":"We got here ahead of the crowd.  I have been here several times, but I was very happy to s","useful":0,"cool":0},"-294ACjRtfB-TlncqgbFOQ":{"text":"The Praline Connection is a great New Orleans Soul food spot. I highly recommend having lu","useful":1,"cool":0},"GDtFQm-wWu9uGAS9JA0U5w":{"text":"Where to start.... Everything about our lunch experience was great. Service is 5 star. Foo","useful":1,"cool":0},"ZlAX3dt8uMpjIC-7458Qyg":{"text":"Made my second visit to Praline Connection on 2/21.  I like this place because I'm vegan a","useful":0,"cool":0},"oaWxFdH2VRyL9vXjhGyppg":{"text":"pretty good! The service was great, but the food was just okay. Great location if you don'","useful":0,"cool":0},"GHQ4PUn5uWyiNIMa38jjIQ":{"text":"The Praline Connection is the first place I ate at for a meal on my vacation to NOLA. It h","useful":6,"cool":4},"Yd5SusqQcsfg-XmC8VEkFw":{"text":"Great service, lovely southern hospitality. I had the taste of soul, a sampler of ribs (so","useful":0,"cool":0},"TK2CMFUZ0MXUGP7ykwbyzQ":{"text":"Delicious fried chicken and mac n cheese...no room for the accompanying red beans and rice","useful":0,"cool":0},"csAF_WYShmTLn06X5u3YZw":{"text":"Stopped in for the traditional peach cobbler with crust- hard to find these days! See pic.","useful":1,"cool":2},"UwnzpcRqXd_VYElgsmlCYg":{"text":"Stumbled upon this place. Food was southern but not what I expected for the NO experience ","useful":1,"cool":0},"eTpWMWu4H3WsR1oHEc4pcQ":{"text":"A disappointing display of soul food. I know, its on Frenchman... Touristy-ish... But sad.","useful":1,"cool":0},"GM-3iR8r2MHj_EindJTC3Q":{"text":"Let me begin by saying our server was wonderful and I so appreciated the complimentary mim","useful":8,"cool":4},"5HwkZKPxPBtw-9UK_FetfQ":{"text":"VEGAN REVIEW:\n\nThis is a surprisingly good place for vegans to eat! I had the Red Beans an","useful":7,"cool":4},"y2dElwIufHghZql3uBU3Ng":{"text":"Best shrimp po-boy I've had in my life, excellent service even though my check was under $","useful":0,"cool":0},"WHlftCKlzy_fAUAifY9F6w":{"text":"My husband and I learned of the restaurant looking for some place to eat on a Sunday befor","useful":1,"cool":1},"07CDceNyFnquQmOUl7zh7Q":{"text":"Yes, this place has soul food and is located well. We went there hoping to get a good meal","useful":1,"cool":0},"sCzzMgRKbW-rinJMAJNsSQ":{"text":"The food was ok here. The alligator sausage was great but the meat loaf was just ok. Glad ","useful":0,"cool":0},"aKsOgK4vZ3w53YRtWS-6fA":{"text":"We were directed to Frenchmen St. by our carriage driver the night before. He may have gla","useful":1,"cool":0},"JEckZVrhEdt4t-TeFEDuRw":{"text":"We took a great tour of the marigny neighborhood where the restaurant is located (through ","useful":2,"cool":0},"uxcW4lOC1X2iJEzU7JOHWw":{"text":"I'm a local New Orleanian and I've been to The Praline Connection once. I wasn't impressed","useful":0,"cool":0},"P40VNhgqY609_z4VTfZbrA":{"text":"The first thing I noticed about this place was that the staff all dress like Jimmy Jam and","useful":4,"cool":0},"LTMpmmmpSZbr89IUBRVB1A":{"text":"I visited the Praline Connection on my birthday while visiting New Orleans. The wait staff","useful":0,"cool":1},"1qxfRxJNYr5ot9LScMXQ8A":{"text":"we had jambalaya, candied yams, greens, fried chicken and red beans and rice~ the greens w","useful":0,"cool":0},"JaWgJJ8OKSJ_McgRjcVpuA":{"text":"Man, oh man. Had it not been for the great service and the beet and onion salad, I wouldn'","useful":0,"cool":0},"gIqqifu2kQ5QrADlaWgs4Q":{"text":"We were visiting Frenchman street from Maryland. We stopped in just before closing. We wen","useful":1,"cool":1},"KzQGj5y9z9U6tUTcrjf5hg":{"text":"Not bad but not great, but good enough if you are looking for a serving of etoufee or jamb","useful":2,"cool":0},"kiiHOhsb_DLO_E0roVEbgA":{"text":"I went here this past weekend with my children 6/16/2013, I went because I have read numer","useful":0,"cool":0},"tj2kigPv8bLGbSeBi1LiiA":{"text":"This amazing place has been shut down. It was sooooo depressing. They had the best soul fo","useful":0,"cool":0},"m5uQ-WQyxPNY-fptbd_Kbw":{"text":"My meal here was ok. It wasn't anything special and continued the disappointment I experie","useful":2,"cool":2},"KQe3LuTaQ4u5oo6_lYfm5g":{"text":"I give this 4 half heartedly it was almost a 3.  My husband really likes this place but I ","useful":2,"cool":1},"UaYPH-8MgxJ5jfRWZoORLg":{"text":"The praline connection didn't disappoint when it comes to flavor.  The service is a little","useful":3,"cool":3},"tcByh_ykFBB4LOrCzR0-pw":{"text":"The sharp-dressed lady in a fedora on the doorstep sealed our desire to eat there.  Derick","useful":0,"cool":0},"-KAe35cUDolOovuolbq5kA":{"text":"Four of us were looking for a nice place in an unknown area of NOLA. We happened to stumbl","useful":2,"cool":1},"S6ezlZQHyelT4jM4baN0Iw":{"text":"One of my best meals in NOLA came from The Praline Connection (which isn't saying much bec","useful":2,"cool":2},"9C8B0PCR_Q8L6-Zfx7CGPw":{"text":"This restaurant is simply amazing. It's small in the inside but the food have huge flavor.","useful":0,"cool":0},"Yycml2f-ZZ6E5tbtfuWqZg":{"text":"I'm going to give this place 5 stars because the food in New Orleans is either NASTY, or s","useful":0,"cool":0},"y6g_qxH-B9hYThRc7M9VLQ":{"text":"Being a vegetarian in a predominantly meat/fish eating city is really difficult, so I deci","useful":0,"cool":0},"wNPHlIlS8p-rNORG2ahgjQ":{"text":"This is the first time I've been to this restaurant in years. The service was very good an","useful":0,"cool":0},"QrmDfjrK_b17Sw40ofGKeQ":{"text":"My daughter bought the praline as a little  gift for me while on a family trip.  Yelp has ","useful":0,"cool":0},"ebC76g4jwy2fiEk3hQdGQQ":{"text":"This restaurant doesn't get the hype of all the others but the food is great and price is ","useful":0,"cool":0},"_lPAlH0s08vMINYhmj-N6g":{"text":"Very good!  Go before 7:00pm to not wait.","useful":0,"cool":0},"eydPCm8CoKGY3U2VhXvHaw":{"text":"its been a while since weve been to praline connection.  but here goes...mmmmm.....good ol","useful":0,"cool":0},"z5FBZei0u_AAAu1-47uaRA":{"text":"Really good food and very large portions. Everything was seasoned well and came out piping","useful":0,"cool":0},"kXg9mpsRoNBUVw7rAThiSg":{"text":"Visited New Orleans in March 2014 and getting ready to head back this March. We stumbled u","useful":0,"cool":0},"EzDXF2kuBl6R7wr4K2nHow":{"text":"My friend and I were on the hunt for some authentic New Orleans cuisine and this place did","useful":1,"cool":0},"x1pt6vWcafiNWt6Ry6gltg":{"text":"My girlfriend and I rolled in for our last dinner in NOLA after 5 days of visiting. This i","useful":0,"cool":0},"gMS0jBXVl8YmXUN9VMTb-A":{"text":"We decided to build up an appetite and walk to the restaurant, which was about 2 miles awa","useful":4,"cool":1},"N4TjVOYCR1-uVRGb3cOo2A":{"text":"I'll admit that I'm not well versed in soul food.  I've had few experiences with authentic","useful":0,"cool":0},"ovSZu5wxttHTDuPmnKKRtg":{"text":"This place was recommended to us by our local Lyft driver. All I have to say is WOW! If yo","useful":0,"cool":0},"l4AnIpnxjOEfCmltA7ruJA":{"text":"Thank you for graciously welcoming us even though we came just for coffee and dessert. You","useful":0,"cool":0},"0_1D32rVvVWlmbhN-2ZlWQ":{"text":"Boyfriend loved his fried chicken. The mac and cheese was just not that good -- not ooey g","useful":0,"cool":0},"N3AEGvfhfI0nuKSLzCF-Xg":{"text":"I am really sorry to report that coming to this restaurant was a mistake. It was my first ","useful":0,"cool":0},"22HpLo0eeOmktI2iLty01w":{"text":"Don't waste your time! This place was recommended to us by a local but after going I'm con","useful":2,"cool":0},"AEB6UsDKdyLEJxE30BD5kw":{"text":"We went here twice - fried chicken was very good - chicken livers were hot and crisp and d","useful":0,"cool":0},"MhnfmpcqQxqEw54TvAFXqA":{"text":"The food was delicious! And, the service warm and welcoming. Everything was top notch! The","useful":1,"cool":0},"V1vjjQT3clecN3e20XKlnQ":{"text":"My visitors requested Soul Food, so we came here for lunch.\n\nWe started with a pile of fri","useful":7,"cool":4},"zKFIbWNQnio-nplXBJ4D_A":{"text":"Everything I ate was amazing! I especially recommend the Chargrilled Oysters, the Turtle S","useful":0,"cool":0},"iQkWgG-3BJqGBLt0k7Ef3g":{"text":"This restaurant was great. The atmosphere was authentic, and the service was nice and frie","useful":0,"cool":0},"zBqWMBbV9MlSLTa75SZ2xQ":{"text":"I've been here twice on two separate vacations and this place is a must in New Orleans! \n\n","useful":1,"cool":1},"7YXVP-PO0-lFYt7NWMd5rg":{"text":"We came to the Praline Connection right before it got super busy It was recommended to us ","useful":2,"cool":3},"9mDobzBltJ8FdR1C0ggiVA":{"text":"Yes, yes, yes! I am so glad we discovered this restaurant. As soon as we entered we were g","useful":2,"cool":4},"iER2gNLbw6ELQVEpn5Lo5A":{"text":"If I am staying within an hour of New Orleans I will make a trek to PC for chicken livers.","useful":0,"cool":0},"WmsF3DW_gjjbmZfOdltjKQ":{"text":"Review of the praline made by The Praline Connection:\n   I'm from south Louisiana and I've","useful":0,"cool":0},"fXNUr_4o0EACvdPwLGm2sA":{"text":"In the end, this was a great, great experience and a NOLA / hometown gem...and in such a g","useful":0,"cool":0},"QIWMw78aRR3OyvR5BFsMMg":{"text":"One of our favorites. Walked over a Mile to get here but it was worth it. Great food!","useful":0,"cool":0},"liCfJwzq1Zr5TtwEi-mUcg":{"text":"This place was really cool and definitely like my mothers cooking. Service was great and e","useful":1,"cool":1},"PfHDeP6H0dKLr1DV6uwNpQ":{"text":"Fried Chicken!?! You're Kidding!?! That is what one of our party exclaimed when 2 of us th","useful":15,"cool":13},"-9-A0qG6GmvSiLsSVL-iMw":{"text":"Franks confused as to what rating to give. Not worthy of the middle finger review however ","useful":3,"cool":1},"zvyf05eGwghMCZ-erDhmjQ":{"text":"I'm sure the food can be excellent and a great experience.  But in our case, the service w","useful":0,"cool":0},"uoCZnQ01vz3ps0S7x8e09A":{"text":"Being a local I sincerely enjoyed the food.  I ordered the Taste of Soul Sampler Platter w","useful":0,"cool":0},"Ly7ZRp_la4s0S4qNLJIYBg":{"text":"Whatever they do to their sausage I don't want to know. It's delicious and I've never had ","useful":3,"cool":2},"o3com-ivnuZJoBatIyVhUA":{"text":"I wish to preface this by establishing that, in my recent visit, I experienced New Orleans","useful":0,"cool":1},"duJUqA8JF0NKwS7n1v47Eg":{"text":"Maybe I ordered wrong?  The macaroni and cheese was bland.  Terrible really.  The fried sh","useful":2,"cool":0},"bIiMcjPEUKIHX1_rBr38pg":{"text":"Soul food and proud of it. Sorry to say that the quality of the food has been sliding sinc","useful":1,"cool":0},"L5IHazZoaPVpfgL9YJrZfw":{"text":"We were referred to this place by a Uber driver. It was a Sunday so they closed a little e","useful":3,"cool":4},"Ej_N1d4J4f3Pjtso-DQTYA":{"text":"Omg, were the beans and fried chicken fantastic. It was honestly more than I could eat. Wi","useful":0,"cool":0},"5-B2TzH6K1yXssprX328Sw":{"text":"Aaaaah...authentic New Orleans grub!  Love it!  Their greens are made with a super yummy h","useful":0,"cool":0},"ReWn035IkpMjC4wJt8urOQ":{"text":"Visited the Frenchman location. The waiter was very nice, attentive to my needs. However, ","useful":0,"cool":0},"r6QBdGwPgN1tDdgF8pA6Tw":{"text":"Terrible service! Didn't get refills for our drinks until we asked. Food came very late, w","useful":0,"cool":0},"wPY_2_GTviWkPiY01n3H1w":{"text":"We had a large party, so a wait is understandable. It took 25 minutes to order (OK). After","useful":0,"cool":0},"2VzNfzKFw8SIJ55jIegkkg":{"text":"Everything on the menu is delicious. EVERYTHANG! Fried Chicken, Homemade Macaroni & Cheese","useful":0,"cool":1},"VkHhqgMqzxies4davrcByg":{"text":"The food is amazing, but give yourself ample time. We heard of long lines, but was lucky t","useful":0,"cool":0},"ow1CytNzgom3hPor0CumIw":{"text":"I was recommended to go to Praline in New Orleans by a co worker, and I am VERY glad I did","useful":0,"cool":0},"WY2cfeCTLe7dZQlX6shCHA":{"text":"Service was great and food was great! The owner even gave us complimentary bread pudding w","useful":0,"cool":0},"I0FUyj-JeSs3ZD_e_PqTIg":{"text":"I don't get it this place has a lot of good reviews, but our meal, and service was terribl","useful":0,"cool":0},"Op_reXWkkiUSTETTmKAUmA":{"text":"Stopped in for lunch while exploring and had a huge shrimp Poboy. I swear it had 30 shrimp","useful":0,"cool":0},"Q4mj4AVPcI6fZ5UIUvzcLQ":{"text":"Good New Orleans soul food.  The friend chicken is good (but I would rather Dizzy's) the g","useful":2,"cool":2},"WG2lwq4UYBVowsiIbYzf9g":{"text":"25 minutes to closing time and their door is locked and the waiters refuse to acknowledge ","useful":0,"cool":0},"RozM7ZpyHdcf1PsmW60Tyg":{"text":"Our 2nd visit to New Orleans we visited this restaurant again because the food was excelle","useful":0,"cool":0}}