{"zbxPDv_A3yVva4fxGtHV5Q":{"text":"HUGE selection of craft beers, wine, etc for THE best prices you will find anywhere in the","useful":0,"cool":0},"7pjeUfMYRW62ihJPWGs_oQ":{"text":"SCOTTY. What can I say about that dude? His KNOWLEDGE OF WINES, LIQUOR & BEER is an alcoho","useful":0,"cool":1},"keOTvPZFTpyEQz6cKrLbvQ":{"text":"They have more beer (and munchies, appropriately enough) than wine. Everything from premiu","useful":0,"cool":0},"A4KPL73XMa4EfjJJyscrhw":{"text":"This place is my go to spot in the French Quarter. One of the best parts of NOLA is gettin","useful":1,"cool":1},"JyNbfke5NKi3TuVtoLHxiA":{"text":"The best staff in the French Quarter. Scott is the bee's knees if you have the pleasure of","useful":0,"cool":0},"4LgVsBENGtaKK4X93CjsBg":{"text":"Huge selection of wine and spirits but the best part is that they have the 16 oz cans of S","useful":2,"cool":0},"gJMScMTFFvXx4grumNrPzA":{"text":"Guys, this place has gluten removed beer! Two kinds to date, both below ppm limits to be c","useful":0,"cool":0},"dKMBTbc4YgsmgtldiN8DFw":{"text":"So conveniently located with delicious options for a great price! stop by for a few cans t","useful":0,"cool":0},"EW6y8SexPP8T7SUk0znPsQ":{"text":"They have more than wine - a good place to get liquor if you're on Decatur. Also, they car","useful":1,"cool":0},"tKf6XZnq6Mz7VM8E1xqiAw":{"text":"Good booze prices.  Interesting variety.  Must stop for wine and a picnic on the river.","useful":1,"cool":1},"EvPMxz5G4ED_v3qWmwXu3g":{"text":"Picture it: New Orleans. End of June. Probably around 90-something degrees and dense humid","useful":4,"cool":3},"rQPYVw9t8pqZIsii5V-nlQ":{"text":"Every time I go to Sidney's its special.  I love the dueling cash registers.  The staff is","useful":1,"cool":1},"bXz5KTvOO69vnP1HVILxQA":{"text":"This just in: you can openly drink in public in New Orleans.\n\nIf this wasn't the very reas","useful":2,"cool":1},"_KvQK4FGxTyCi_mrOKwoJg":{"text":"A great place to grab a beer. Get a to go cup and wander off down the street with somethin","useful":0,"cool":0},"hgu7tPPQp69mcqWxPP_yqw":{"text":"Beer-thirty doesn't get any more local on Decatur Street than Sidney's.  The perfect stop ","useful":0,"cool":0},"QE2LKyk1tuAzNdJg8kR_dw":{"text":"A must stop for anyone drinking in the Quarter. This locally, family owned store displays ","useful":0,"cool":0},"6rJ0qA04qnwiyV9EOG0Bsw":{"text":"Sidney's is the tourists delight, right off Decauter, easy to grab that cold beer or bottl","useful":0,"cool":0},"ubuMWwDLnnDaO6xwf457-w":{"text":"Best kept secret in the quarter!! Great selection of wine and spirits, friendly staff, sin","useful":3,"cool":2},"1ZN7JnUR83jAmzErwueMYA":{"text":"If you need a beer and a Hubig's for Quarter walking, stop in to Sidney's. They are my lif","useful":3,"cool":2},"qaa1OFk45lUZs-uK-h3b-Q":{"text":"Knowledgeable staff who made great recommendation about a bottle of champagne, at a centra","useful":0,"cool":0},"kWDQiZmVPCi7VrF6jGFdVw":{"text":"Super friendly and knowledgeable staff. The only place in town that carries the coveted lo","useful":0,"cool":0},"Mt41QWLxq6OhUFHoID0yXQ":{"text":"Most impressive selection of beer in the French Quarter.\nMost impressive selection of cold","useful":0,"cool":0},"6vTT94ORnmDXTAwgL-0DFA":{"text":"This is always my go to spot when Im on Decatur, or Im about to wait in line for dinner at","useful":0,"cool":1},"Z_VdK8VHsaEKn0ejtplxUg":{"text":"This unassuming Store is a great find. Tucked into a small storefront a couple of blocks a","useful":4,"cool":2},"5j8vyIwqYncgF5EheBVIEg":{"text":"Pretty much a staple whenever I'm in the city. They've got a great selection of every kind","useful":0,"cool":0},"_Z169SkS5D1qdWJExs5y6g":{"text":"Can't complain too much about Sidney's. Pretty wide selection of beer by the bottle, a few","useful":0,"cool":0},"mjPMUbG9en-v40GD6pKvew":{"text":"Great prices and the guys are quick and know their merch. I told them as I walked in the d","useful":3,"cool":3},"rgv-SWSwKElnZeUCCV7u6g":{"text":"Best place to buy beer in the quarter. Excellent service from intelligent staff that are p","useful":8,"cool":2},"ULpEui69iFc1lVe9bah0iQ":{"text":"I love Sidneys! I go here daily & sometimes 2-3 times in a day (I live in the hood). The f","useful":2,"cool":1},"9inc2iCMbG1xeRKSKQCz9A":{"text":"Sidney's is a beautiful little hole in the wall on Decataur (though on Decatuar you could ","useful":0,"cool":0},"rRHlMF9CtDILunXwiJsaww":{"text":"Being an absinthe connoisseur, I'm giving Sydney's Wine Cellar a review solely based on th","useful":7,"cool":2},"SE-CrxNHYtkLlMT5nUUWEw":{"text":"This liquor store was a great little find while we were walking along Decatur St.  It's a ","useful":2,"cool":1},"eAK9TTnmqldtXhhBo5an0Q":{"text":"Pro tip: when hanging out in the French Quarter, grab your favorite drinks from Sidney's a","useful":1,"cool":0},"-EKNh14f0KJoPSVItC1dhw":{"text":"Nice selection but check the beers. Some of the beer is old and needs to be rotated. Over ","useful":0,"cool":0},"x_Wy6-Jv3KMwI7KN1qpp3w":{"text":"Whoever is the Snuffleupagus who constantly complains about having to do any type of work ","useful":0,"cool":0},"WI9fF6hQXyU-wBuAg3So5w":{"text":"\"Of course we have bags - this is a store\" was the deadpan response from the cashier when ","useful":1,"cool":0},"b3NoWMcwVGhJszKI0WblKw":{"text":"I have lived here for 6 years went there to buy cigarettes and coffee then stopped when I ","useful":1,"cool":0},"IJTtvIBpDEq5lpUlEtzS1g":{"text":"Store is located in a busy area. They had a nice selection of liquors  (and absinthe) but ","useful":1,"cool":0},"x7q-FcC8zB_QOQ6L426FYw":{"text":"They apparently allow charges to be made without a credit card present. Someone stole our ","useful":0,"cool":0},"UvNb37NFmvZ6dW7OAtX62Q":{"text":"Went in to stock up on alcohol and snacks and was surprised by the rude and openly hostile","useful":1,"cool":0},"k6imjXb8Z4S9H1hMkZ2uPg":{"text":"One of a few liquor stores open until midnight. Good selection and prices.","useful":0,"cool":0},"cz4y5KbEDMazHsK-fq8pow":{"text":"Mediocre selection of bourbon and whisky.  Fine is you are just looking for the basics.","useful":1,"cool":0},"8xhlZWDRopkzAjzkz9Q85Q":{"text":"While exploring the French Quarter I saw that it had just hit noon and for someone who isn","useful":0,"cool":0},"-0ecBdKLJafWjxg00sUpUA":{"text":"Can't comment on wine, alright, so cut me some slack.  But seriously folks, I was looking ","useful":1,"cool":0},"vvEr9hoQZXQLd4zSf059Bg":{"text":"Buying drinks in the French Quarter is painfully pricey to say the least... and that's whe","useful":6,"cool":3},"M--K2GykAHvmhZFAK5s9JA":{"text":"A simple wine / booze shop with good service - can't believe I haven't been here before. I","useful":0,"cool":0},"p1SPdOP7rSzYxzX3L65eMQ":{"text":"Business is closed due to hurricane ida damage still listed as open it's nit open at all","useful":0,"cool":0}}