{"NdXa5hv3zDoeUy0DCQ1Dqg":{"text":"Really delicious food and friendly service. Came here on a whim on a Sunday night, was jus","useful":0,"cool":0},"Bmc5V4Z25YxNsquL0_5Fgw":{"text":"I decided to eat hear for breakfast, and I'm glad I did! I had a solid yeggie scramble wit","useful":0,"cool":0},"Fixhn-vv50DKEqJUxPaQsQ":{"text":"I have seen many incredible happy hour specials during my time in NOLA... & this one is de","useful":2,"cool":1},"jN6nw3G1edtowQYm_Zs6SQ":{"text":"The hours on their website and their door say they are open until 11pm I convinced my wife","useful":1,"cool":0},"LD9zBZ0xxVHWVyHlExaHqg":{"text":"Awesome dinner!  Can't understand why this place isn't more crowded. Had Redfish St Charle","useful":0,"cool":0},"Oz5VvWX1QaJulRp9JWK87g":{"text":"Was very impressed with this places. We came in kind of early, a little after 5. Had very ","useful":0,"cool":0},"KeJki1GNfcOQnElqv-xHiw":{"text":"Tia was amazing! Let's talk about this oyster blt, it was super amazing! The ambiance and ","useful":0,"cool":0},"_LlkaXlGtRurU2t0Ot2UjQ":{"text":"I had dinner here while staying at the Renaissance hotel in which the restaurant is locate","useful":0,"cool":0},"sDsaHfgw3b0ZJEnBUYxf_Q":{"text":"The buffalo chicken salad was amazing & once he started serving me the bar tender was very","useful":0,"cool":0},"hvSGH_-uLZutBUSzQ25jNA":{"text":"Beautiful restaurant, but sadly the food and waitstaff didn't match. The blue cheese chips","useful":0,"cool":0},"B7oPlGgmv_Bhi-67hpf8bQ":{"text":"I would give 10 stars if I could. I stayed at the hotel during thanksgiving holiday and ca","useful":2,"cool":0},"R8eeJfuX8EGRPIEiTOq7_g":{"text":"Definitely above average hotel bar! Had several breakfasts and lunch, and also visited  th","useful":0,"cool":0},"ZMW4fb3PB2fC1F8Is65yvA":{"text":"We enjoyed an early dinner here while visiting New Orleans. There was no wait for a table ","useful":0,"cool":0},"iDlE83O_7Ylzr5mtHRR8QQ":{"text":"I had the tuna salad and it amazing if you like spicy fresh and light  I also loved the li","useful":0,"cool":0},"8Wkc1RgXEfNXW5T62jOJHg":{"text":"Great atmosphere but it took forever to get seated even though they seem quite slow.  \nThe","useful":1,"cool":0},"7K0x7GiqfaarEmcxN73IOQ":{"text":"What a great CBD option!  Excellent, super courteous service.  My first visit here two wee","useful":0,"cool":1},"0rN2vNq5YdtNcYXmQUiEYw":{"text":"I absolutely love this place! I like to eat healthy as much as I can but very hard to do i","useful":0,"cool":0},"EmyaHYKUXDzaMQWVgM50_g":{"text":"Awesome food and service. Ordered the Mi Casa chicken, very tender and the black beans and","useful":0,"cool":0},"VKHKs8T3HZ66RdvsSTkGRQ":{"text":"Staff recommendation of wine/cocktail were perfect. The turtle soup- delicious. I got the ","useful":0,"cool":0},"XLn-TjUuUXcORFZoe5-v3g":{"text":"OMG GET THE DUCK NACHOS.  For real though. You won't regret it! The portion was massive an","useful":0,"cool":0},"dfnuurbu3B-2Fa4HSHHR3A":{"text":"We came here for a large group business lunch (23 people)!  Service was decent and no issu","useful":1,"cool":1},"H81F5cTroObs8bgNtW7fRQ":{"text":"Just arrived from Dallas and waiting on hotel room at Old 77 so we decided to stop in here","useful":0,"cool":0},"3EPhTESMdGuivBDzy_FJ0A":{"text":"Great tasting ribs and kale slaw. Filet and potato were just as good. Hope to return some ","useful":0,"cool":0},"_dBvch4ers5dEdQU_e-GZg":{"text":"Fantastic catfish and gumbo. It was a perfect dinner a little on the pricey side but the q","useful":0,"cool":0},"tlAWRc34q0m_5EZHZSoGCw":{"text":"The atmosphere and the lighted sign out front (at night) were the two things that attracte","useful":1,"cool":0},"K4ZemPTRtJxC2nSxe5LVwg":{"text":"We felt like a night off liquor and creole. He got a serviceable burger. I ordered the Vic","useful":0,"cool":0},"d9LbaAHZdis5WkZmnWC2Kg":{"text":"Great food, lackluster service.  Food arrived col at the table but they remade the dish as","useful":0,"cool":0},"nZ0eOHHByq_Ia8dYLoZWTw":{"text":"Came here on business trip based on the positive overall review rating but Legacy proves y","useful":1,"cool":0},"b5TNPsyTHEduJA-GGZ7tqg":{"text":"There was far less \"craft\" in this restaurant than expected.  None of the pictures posted ","useful":1,"cool":0},"EAYhzhQ500iJ2q4ZIM5TsQ":{"text":"Wide variety of food. We had their specialty Legacy Burger, very good!!!  Service was exce","useful":0,"cool":0},"vHnwemxmsNvCGnnbgDXjOQ":{"text":"This was our first restaurant stop in New Orleans. The inside is pretty nice with the high","useful":2,"cool":0},"tOsw6VzQLsxIzfpYBA2xsw":{"text":"Delicious food, beautiful restaurant , fried chicken was just the way\nI like it and the Se","useful":0,"cool":0},"A11LeQj4gG_STlPZNggtSw":{"text":"The food was pretty good. I had the BBQ shrimp Pasta, the loaded duck nachos( which were a","useful":0,"cool":0},"XOEcE4MNMc5pPdF2saVl2Q":{"text":"One of my new favorite restaurants outside the quarter. If you love fried chicken, make su","useful":0,"cool":0},"hU4onRg_Yk8D5MIU5r1rcA":{"text":"PROS:\nCeasars dressing with real anchovies,wonderfully salty shoestring fries, delicious D","useful":0,"cool":0},"3UG8gxl8K5F-ivuv3OBBuw":{"text":"Victory salad and beers equals. Amazing night at Legacy kitchen. Service was slow at first","useful":0,"cool":0},"cH-tp47z3oB8y-UEvIIxEQ":{"text":"Excellent find while touring downtown New Orleans. We were just heading back to our hotel ","useful":0,"cool":0},"SFschtOwdSrp3lLbxRzp2A":{"text":"As a vegan, I find it hard eating at restaurants that don't have have many vegetarian opti","useful":3,"cool":0},"hmBioa1p70PbskT6xzzstg":{"text":"The service was good, but the food was nothing to rave about. In a city like New Orleans, ","useful":0,"cool":0},"Atfn-7QkqUEf1I6Vg5sujQ":{"text":"This place was perfect in every way! Food was fresh and service was amazing! Scott was out","useful":0,"cool":0},"hh7ctGmY4M0DsOuzMxjXpQ":{"text":"Americana vibe, soulful and friendly staff. The decor catches your eye off the bat and kee","useful":1,"cool":1},"-sM6vBekTedTeCbVCAnoyQ":{"text":"Food was excellent. Soft shell crab was perfect. Server was friendly and attentive. I reco","useful":0,"cool":0},"WGgnn_0mLyjx_LBsiJ8b5A":{"text":"Veggie burger was AMAZING. Grilled asparagus was good too! I'm vegan so finding options in","useful":0,"cool":0},"D8KSKDoFhPX312pVgClIHw":{"text":"We really liked this place! We were in New Orleans on vacation and our hotel was in walkin","useful":1,"cool":1},"qGqeE4TviBoJfff9WzZRSQ":{"text":"Absolutely amazing dinner! First night in NOLA. \n\nFirst time trying chicken and waffles an","useful":0,"cool":0},"UhrlRDQZtel3ADXDOulAoA":{"text":"Is it based on the reviews the veggie burger. It is just a plain old black burger despite ","useful":0,"cool":0},"hM1Nim5DHpPxu-rMYzgoEg":{"text":"Got take out from the bar. Bartender was friendly but put in our order wrong. We got two b","useful":0,"cool":0},"PFeV1lH-5ttLBHaJZfs8dw":{"text":"Been to quite a few New Orleans restaurants and I have NEVER been disappointed. So I was r","useful":0,"cool":0},"G8hdaN98i1qNBoydWqcRKQ":{"text":"Stopped in here for coffee and beignets. Both were pretty good. Can't beat Cafe du Monde b","useful":0,"cool":0},"iAhsdKQu6Gjvi46gcyFgXw":{"text":"If it weren't for the kids' meals is give it a worse rating. One kid had a waffle--light a","useful":0,"cool":0},"ZubWXFLQLuN65ngSoER3rQ":{"text":"This was really good. I was looking for a great burger and this restaurant didn't disappoi","useful":0,"cool":0},"W_gZNXAxRKAdZ2Tzs41PkA":{"text":"Legacy Kitchen is a nice stop for anytime of the day.  It's been just as good for brunch a","useful":0,"cool":0},"pGSSStG0GrfQx1a2Y2wXNA":{"text":"We ordered the blue cheese truffle chips and fried chicken with waffles. The waffle had ba","useful":0,"cool":0},"L4jAsdexVHQ1EX0jwHbQwA":{"text":"Stopped here for brunch on a quiet monday, WOW!\n\nFantastic breakfast cocktails, and THE BE","useful":0,"cool":0},"cEDeiy83dxu3e99jwjodBw":{"text":"The St Charles Redfish with Crawfish cornbread may be the best thing I have eaten this yea","useful":1,"cool":0},"88h3dS4gQ0BDtJ1n_lePYQ":{"text":"Great service and the first place I found in New Orleans with a vegetarian option. The bes","useful":0,"cool":0},"beO0uU7FsZLoVFvhuGSnmQ":{"text":"Food was average to subpar, and horrifically overpriced. $16 for a small cheeseburger. Atm","useful":0,"cool":0},"TMc4N_hJpIJChstAsoLE6Q":{"text":"We had a great experience here! Great food, service and atmosphere. Would recommend to any","useful":0,"cool":0},"-fhUAgiNWI53_4d28QKR4A":{"text":"This was the most atrocious experience I have ever had.  Absolutely no excuses!  Walked in","useful":6,"cool":2},"8CyFtLkCyt0RxS6cGq_tdg":{"text":"This review is solely for this location. Prices are higher here than other locations. I ha","useful":0,"cool":0},"_cM2sMp8ae1kDuaJnmchZg":{"text":"What a cool place. Decor is pretty awesome. Only had drinks but the menu looks really good","useful":0,"cool":0},"hTeSXyL2hTohF7yR0Gk9yw":{"text":"This is one of the best restaurant that We tried while visiting New Orleans. It has a uniq","useful":0,"cool":0},"E6Ze1qJYa7fOgGzTeJg8jA":{"text":"Only go if your phone has a good charge.  You'll need it to kill time. Maybe it's differen","useful":0,"cool":0},"0XNdplt_mCuZlvWlVSTNrg":{"text":"Solid food, maybe with portions a bit too large on carbs and low on the protein (basically","useful":1,"cool":0},"axFLSnq1xvyRlcM6H_WMgg":{"text":"Went here for a casual meal after dinner. Staff was polite, atmosphere was nice. Location ","useful":0,"cool":0},"1SSThGdETRykvCr_eS0GKg":{"text":"Great decor. The space felt very roomy, had a rustic feel, and there were so many unique o","useful":0,"cool":0},"MnDMqpuoskSthG0Xmpp9Ww":{"text":"Yep! I owe NOLA this review. I love Legacy Kitchen and the NOHSC Brand that it's under. BU","useful":0,"cool":0},"dW0BfM49HRTXwmaM_BZLCw":{"text":"This is an excellent restaurant for being in a hotel. We ate at the bar. As told by the ba","useful":1,"cool":1},"omL5QjGQJXOMONiZkO3umg":{"text":"Delicious redfish! Smothered in asparagus and mushrooms, the fish itself was blackened and","useful":0,"cool":0},"d40A9Bji5ejEbIxrVUVNmw":{"text":"Incredibly disappointing. A tiny salad with tasteless cheese and cold chicken for $15. Unf","useful":0,"cool":0},"_jQjcfkA4Yb7lf7S8pCJKA":{"text":"So the decor is really cool,  it look like if modern and hipster had a baby. The food was ","useful":2,"cool":0},"T4dEj5WuRVRULAAABooyCg":{"text":"Me and my boyfriend are here after hearing about it from a friend. We were seated at a ver","useful":1,"cool":0},"93OCOD14tdRym243c8J7QQ":{"text":"Decent place to get a quick bite. Tried the Cuban chicken. Not bad but lacked flavor. Next","useful":0,"cool":0},"Gf0YkzUg5AymNHRC78_3Ig":{"text":"I have been here before and liked my visit in the past. There was a price mix up at the ba","useful":0,"cool":0},"KL3zJKmSMqKQsG1_PCtbqQ":{"text":"We are here right now on Christmas Day. Thank you for being open. We had a reservation and","useful":0,"cool":0},"8CfeUS2_eaKu6fX542fTzQ":{"text":"During our visit, we were literally the only table sitting down to eat, and yet the servic","useful":1,"cool":0},"slChYQVTmVr81Si_-8D4cw":{"text":"I found this place through my TV (really random) and I immediately wanted to try it! I boo","useful":0,"cool":0},"NLyuZipOpNRF5QDtoC-qtA":{"text":"Gross!  There's better food at McDonald's.  Over priced nasty food. So not worth it, would","useful":0,"cool":0},"9hfKWKYC1jQWO4i2ClyJtA":{"text":"The staff at Legacy Kitchen were less than satisfactory upon my first visit to the restaur","useful":1,"cool":0},"-aduYvBQ5lfRhCURqIIFJQ":{"text":"One of our best meals during our 6 days in New Orleans! Tacos very good, Salmon excellent,","useful":1,"cool":0},"ajwPQ73jBR_iOk46JenT4A":{"text":"Started with a great cocktail and then a really good burger cooked just the way I ordered.","useful":0,"cool":1},"JGT8vhuc2NXafO21pi5zTA":{"text":"Cocktails were interesting and fun. Limoncello with champagne. Crawfish beignets were deli","useful":0,"cool":0},"fYml0wlRXxjW61dhOk4SUQ":{"text":"We loved this place! Great atmosphere and the service was exceptional. The red fish was AW","useful":0,"cool":0},"IBCKa2qFYUumloktExluUw":{"text":"Our server, Michael was great and is the only reason the restaurant gets more than one sta","useful":1,"cool":0},"-aEnvx1d3PcAh8Jh9wKRZA":{"text":"Thanks to Yelp, I had gotten vouchers for a free breakfast here and since I am never one t","useful":6,"cool":6},"Oe7QsF-2ysoiOWpCFn36CA":{"text":"HOO BOY. Was with a group of non-seafood waters, so needed to find an alternative. This wa","useful":0,"cool":0},"JQAnaWeJIFrUSoYOgwnArQ":{"text":"Great food and atmosphere.  I highly recommend the fried chicken sandwich.  The sweet tea ","useful":1,"cool":1},"jqOSLiCb9RZIzwJFaJdq1g":{"text":"We are on our first vacation in about 5 years and this was the first restaurant of the tri","useful":0,"cool":0},"eibmOSEoho16EUJBYeH3vA":{"text":"Very good! Service was awesome. I had the NYC NOLA  pastronmy sandwich. It was delicious. ","useful":0,"cool":0},"XBsldl41wuKcdH7sLPVNbQ":{"text":"10:30pm last call!? C'mon. The bar tender got an attitude when we asked if we could drink.","useful":0,"cool":0},"qO1jpS2nc4sVlZNzpDqpWw":{"text":"Our most recent experience at Legacy has totally changed my mind about this place.    Even","useful":1,"cool":0},"wLTW8zHpxtaTYuEy2rlqQw":{"text":"Service is SLOW, kitchen closes early, menu not that enticing, but somewhat interesting dr","useful":2,"cool":0},"L5d7ASDcWbcCULApniUkzg":{"text":"My least favorite meal of our trip (we came for dinner). I'd describe the food as (average","useful":0,"cool":0},"f0emvTihi5gC8lYTO0qzRw":{"text":"My husband and I ate here and it was delicious. I had salmon and broccoli and he had the c","useful":0,"cool":0},"lI0BjvXaSiFN4aNKlXbCpw":{"text":"Nice decor and clean. We had the tuna salad and crawfish beignets.\nBoth were very good. Wh","useful":0,"cool":0},"AukRXBIyjw0QPuHflVf0TQ":{"text":"So happy to have this spot: wedge salad to die for...So. Georgia chicken sandwich is Dee-l","useful":0,"cool":0},"YWbDfkQxFK8QV1rRw0NBjg":{"text":"Very pleasant staff to this person who was eating alone. When I ordered grits for the firs","useful":0,"cool":0},"Nfu-Qz4EsNceThn_4w-VBw":{"text":"Literally was terrible. We sat at the bar and the food took forever. The waitress thought ","useful":0,"cool":0},"eiSa8pLIe_F3MTgZo2oZZA":{"text":"Discovered this place thanks to yelp looking for a place to eat after Wednesday at the Squ","useful":0,"cool":0},"B8T704fQb7E9IirsXowvgw":{"text":"This is comfort food heaven. Alex, our waiter, is professional and attentive.  Cipriana , ","useful":0,"cool":0},"0Xn3DI5pUU3zGx2g-u2M1g":{"text":"I really enjoyed this place. It's a cool ambience, and service is excellent. I had the sig","useful":2,"cool":1},"DsufFazGgMtIrqcXRStZ5w":{"text":"Stopped in with my boyfriend for a quick bite to eat while we were in NOLA. The restaurant","useful":0,"cool":0},"qZ08mV08AyK5KSewCq1x-w":{"text":"Love this place because of 5 key things you want in a restaurant experience: wonderful tas","useful":0,"cool":0},"XrJnKtGxZaU_DoV9EVCaPQ":{"text":"Great lunch spot. We were able to walk in and get a table right away. I have the corn and ","useful":1,"cool":1},"R_Gyxx7kZKs3bx3oZy9FUg":{"text":"Really liked the ambience! Ashley was our server and super friendly and helpful. Delicious","useful":1,"cool":0},"E19Z6q9qJq-JMBbVV__sdw":{"text":"Great breakfast! Fun setting, Stevie was super attentive. Nola breakfast, build your own o","useful":0,"cool":0},"awn2jV5d8cEpnip4z0AeXQ":{"text":"Gluten free friendly, great service, and a fun ambiance! Per the manager, whose 9-year old","useful":0,"cool":0},"dOTfFrP_1EsiWS2XyYDiMw":{"text":"My Legacy Kitchen experience was like any typical American food restaurant. Located in the","useful":1,"cool":0},"dGlw_4ZxXN4298IJ-icATw":{"text":"There's one reason why we went to Legacy Kitchen the first time and one reason why we retu","useful":0,"cool":0},"PKfMAsiqDUDzREWHHaK7EA":{"text":"I went to the one in Metairie right after it opened a while back and didn't like it at all","useful":0,"cool":0},"xRiDFTJ4eyUlmDj2hWOgGw":{"text":"Now that legacy kitchen has changed this the there \"craft bar\" it horrible... I ordered th","useful":0,"cool":0},"mUqHSaaq1hmAo46dStvhSA":{"text":"I ordered the Mi Casa Grilled Chicken. It was described as black beans, chicken, and avaca","useful":0,"cool":0},"3Fma8kd7EF0YObMRbpOIHA":{"text":"Matt is amazing!! He has the best customer service and super funny!  We'll be back to visi","useful":0,"cool":0},"8w5xeZz02wWjmee2CyDFIA":{"text":"We came during lunch on a Thursday afternoon. As soon as we were seated, we were completel","useful":1,"cool":0},"x7VrzAas66fp9aXNV1grQw":{"text":"Waited a day to write this review because we wanted to give it a 2nd chance, actually a 3r","useful":0,"cool":0},"38SQxVSADYDgflLffYc07w":{"text":"Have you had the best chicken and waffles on the planet? If you haven't had them here, the","useful":0,"cool":0},"_hALJeTqXNYoUBMxMdjeIg":{"text":"They make a good dirty martini and the gumbo was good. The place was dead and I ordered so","useful":1,"cool":0},"92xn-_oSvo4iLHF5zkUCww":{"text":"I had the soft shelled crab BLT and it was truly delicious. We ate at the bar where Brando","useful":0,"cool":0},"68WrAS4Zdef6qR3z8JWNdA":{"text":"SLOOOOOOW service & kitchen, rude staff. Food is mediocre at best with limited options and","useful":1,"cool":0},"D3d_sX6iiPhBMj4__te8Bg":{"text":"Best Bloody Marys ever!!!! And their French fries are addictive!! We had Genevieve as our ","useful":0,"cool":0},"qml-2VId3lOxH1vFzLFktg":{"text":"Stayed at the Renaissance Hotel adjoining this restaurant on Fat Tuesday. The first time w","useful":0,"cool":0},"UTTrfkzCcD9WmuYwz5HLQg":{"text":"The moment I glanced in the amazing kitchen and saw everyone smiling and loving life, I kn","useful":3,"cool":0},"k-zZ9Z7d6UcS5Y7ytVJZ9A":{"text":"Location is a very nice walk from the convention center.  The gumbo was perfect.  I liked ","useful":0,"cool":0},"TlmuNpS4aYJknbCIggy9EQ":{"text":"I've been here twice; once for lunch and once for dinner. The service was outstanding each","useful":2,"cool":1},"LqpWfZ1pIB5xHGJ33QcBSg":{"text":"Wow this place has an excellent by the glass wine menu and some interesting cocktails I wo","useful":0,"cool":0},"4Ak2jJ79m_Y7uWwwm1VQlQ":{"text":"Love this place . Best breakfast and drinks ! The staff and bartenders are very pleasant. ","useful":0,"cool":0},"Ro5VwfeG3E5e5vGOfqB5NQ":{"text":"This is a very cool looking place! Attached to a hotel, but fun to look at and includes sh","useful":0,"cool":0},"ekvPnrtJOe3zSkoZbfQBCA":{"text":"Came here for breakfast. Wow so delicious! Had the Texas toast blt with Texas toast, lettu","useful":0,"cool":0},"HJM7P4RBwYpK8353A0Fm3Q":{"text":"By far one of the best menus during my trip. Delicious food out of the gross touristy area","useful":0,"cool":0},"qzUvf3IxmYxRMIPmD1k6PA":{"text":"You wouldn't think so but for some unknown reason this half-classy sports restaurant turns","useful":0,"cool":0},"EeYHa-wIkIiC3LUUTlwnHw":{"text":"Staff was fantastic and friendly at the bar. Recommended me a couple good options to eat. ","useful":0,"cool":0},"1s3nvz6Vss5S0sjnead41A":{"text":"Went to Legacy on a Saturday for lunch prior to attending a music festival. The decor is r","useful":0,"cool":0},"LEbB8KrLxcf3eWnhwy6O1Q":{"text":"Insanely impressed with this restaurant. I was in town for a travel convention and needed ","useful":0,"cool":0},"KqpCXL1XSgytswNLLQqV1Q":{"text":"The place is a lofty style restaurant within a hotel. I didn't know that until I went to t","useful":0,"cool":0},"DXfRwOe9rKyxsKRBIZRJhQ":{"text":"I would give zero if possible. What a terrible experience from the second we waked in, the","useful":0,"cool":0},"b7T7MrpvagQUx5OmTpXJFg":{"text":"We were staying at the Doubletree Hotel down the street after spending 3 nights in the Fre","useful":0,"cool":0},"8eDqZqUkVs3GC735CqKeaQ":{"text":"Excellent place for a sandwich or to watch the game! Super nice staff, Kara was great, don","useful":0,"cool":0},"X87ogzTccID6krPG_IJB8g":{"text":"Seriously good food, great atmosphere and awesome people.\nMake sure you get a taste of the","useful":0,"cool":0},"JBwWLzXhyFls4KfbB7UgXA":{"text":"Angie the bartender was amazing! I stayed her for my wedding weekend and the food was grea","useful":0,"cool":0},"yrCneU3Swgilr5t2ZLjUKQ":{"text":"We were sat very quickly. It was early in Sunday evening, so the place wasn't very busy.  ","useful":0,"cool":0},"cUkWf8vw0RWVdobg1bo_hw":{"text":"Visited this restaurant with my family of 12 for lunch. Everything was delicious. I ordere","useful":1,"cool":0},"UeXl_oK-WkElInJ72v5Wmw":{"text":"Couldn't be happier with delicious 3 dollar martinis, the best burgers, awesome bread pudd","useful":0,"cool":0},"uSvXjzYAOOyZbzbXTI9MgA":{"text":"Great family restaurant. Kids enjoyed the chicken and waffles. I had Simple Salmon which w","useful":0,"cool":0},"8zLOb-6Lin1AVMffFPwZrg":{"text":"It is not the restaurant's fault at all that this is four of five stars.  Def 5 stars for ","useful":0,"cool":0},"tF4HF0QDjFW-y6OB12oFxg":{"text":"On the 10th of December my girlfriend and I walked a block away from our hotel looking for","useful":0,"cool":0},"f-0LHtTK89qNE9x0StqMbA":{"text":"ANGIE!!!!! The best mixologist!!!! Gourmet Spirits! Best service and even better Drinks!!!","useful":0,"cool":0},"nJ2jqyk2ssXzeer0A4KP7A":{"text":"This is a new place in NOLA. We had our thanksgiving lunch there. It was wonderful. The se","useful":0,"cool":0},"N51ZEEA6CPycaDGfktp-qg":{"text":"Amazing atmosphere and the perfect Moscow Mule.\n\nMy husband and I were walking to the Gard","useful":0,"cool":0},"PSCl5uuBfK3ijZrSCcqE2g":{"text":"We stopped in for an impromptu lunch and were more than pleased with what we found. The ri","useful":0,"cool":0},"yBneZCNJpQvf4FRWrr1mVw":{"text":"Just grabbed a quick lunch here. I liked everything about this place which is off the lobb","useful":0,"cool":0},"pbBRcCJjWCG_gkcH3zJIKQ":{"text":"One of the better dining experience in New Orleans. Place is great to look at, I spent my ","useful":3,"cool":4},"FJdZAPwg93mPntXwTQwjGQ":{"text":"Fantastic food, I never order fish but my friends redfish was incredible. I had the roast ","useful":0,"cool":0},"uGhs15KKOf-SUpBvpkcB9Q":{"text":"This restaurant was SO great!!\n-very cool style\n-great social hour specials (3pm-6pm)\n-ama","useful":0,"cool":0},"NTG94NQtrShcC9LqFYk7Tw":{"text":"Overall a nice place. Bar area has some games and TV s and plenty of space. We had a the b","useful":0,"cool":0},"c3EGO_OmPTsLah2jysURIw":{"text":"The food at this restaurant was nothing special and way over priced. The waitress had an a","useful":0,"cool":0},"zNXEpN8CIe14CzP8wfYRIA":{"text":"Came here later in the evening just looking for a good place to chill. Excellent choice! L","useful":0,"cool":0},"cKDJFkBQ9--pKCHzplkQQw":{"text":"Great food and fun atmosphere that is kid AND adult friendly. Bacon wrapped fried shrimp w","useful":0,"cool":0},"EDsvnfhXgc0_vBI-hA5QJw":{"text":"The best fried catfish I've had in New Orleans, along with a plate full of crispy and deli","useful":0,"cool":0},"dAI6yU-UGxNcc8vGhv460w":{"text":"The best service in  NOLA. Genevieve was a an absolute sweetheart and met our every need. ","useful":0,"cool":0},"rDfCJSx8Vj61W78kB0oU4Q":{"text":"Great service, good food and lovely atmosphere!! It was too cold to leave our hotel and th","useful":0,"cool":0},"YrnhcHbDCTIDN8UdNlGPCg":{"text":"We discovered Legacy Kitchen after seeing their commercials during the Pelicans games.  Ar","useful":0,"cool":0},"WnSr50lyF901d3TCciByMg":{"text":"Excellent food! I had spinach artichoke dip that was super cheesy that I would get again. ","useful":0,"cool":0},"ASnEWoHdB_Tt8Byi3x63ZA":{"text":"Fantastic! Our food took longer than expected to get to us. So the manager came out, apolo","useful":0,"cool":0},"YG2AxdWieHL1zDKY6fXjFg":{"text":"I had dinner and breakfast at this place, because the hotel gave me $15 per day vouchers f","useful":0,"cool":0},"WhQBjOGrVgoVU5Ec6_Iqtg":{"text":"After spending all day in the French Quarter, it was nice to stroll through the Warehouse ","useful":0,"cool":0},"4se8EyniwxtDupaIMTo4HA":{"text":"It's the night of the Nyx parade, and my party of three has been waiting at least 25 minut","useful":0,"cool":0},"GxjivtEdQvSGgsiyi7xX8Q":{"text":"We had two meals here due to the great location, super friendly staff, and a great happy h","useful":2,"cool":1},"3RRvpvb18fwqaOjAEN5_KQ":{"text":"Is it a five star restaurant? No. But based on what I expected and what it delivered, YES.","useful":0,"cool":0},"KbQ0eRlUEKpgOaGNVebXiw":{"text":"The duck debris chili cheese fries are out of this world! The duck was smoky and the crawf","useful":4,"cool":2},"4CuX1218m7kHMFfFkZd-yA":{"text":"Just ate here and was very impressed! Soft shell crab was phenomenal as were the chicken a","useful":0,"cool":0},"LBpq1qLxQh-MiKz6V6-xRQ":{"text":"We decided to try the Legacy Kitchen on a Monday night at 8 pm. It was not too crowded. We","useful":0,"cool":0},"j8AEDavnUdSRxMbBtFahhQ":{"text":"I am a foodie and I love food food...  Nick the bartender recommended the redfish and corn","useful":0,"cool":0},"_Eq7-8LQ7e0YO7YKRB2GfQ":{"text":"Best place to eat in all of NOLA. Love this place. Everything on the menu is good. Service","useful":0,"cool":0},"yy-arRIRDKNzOHb-nAD1hg":{"text":"Legacy Kitchen-Great Find for food and sports\n\nWanted a casual restaurant for Friday Night","useful":0,"cool":0},"GiQY8jhoRUDiSLvrifvJIA":{"text":"I thought NOLA was supposed to be a foodie haven. If it is, certainly don't include this p","useful":0,"cool":0},"ALf9z-bMHcUUjhL5alPXKg":{"text":"Another bad experience at Legacy kitchen. I don't know why I keep trying. I live in the ne","useful":1,"cool":0},"XqyAtq4IxCcySNXqmiYFuA":{"text":"Our party of 6 all really liked the food and atmosphere. It was a crowded game night in to","useful":0,"cool":0},"3TCXGRG9vJfmYxqddyO7Mg":{"text":"The food was excellent!! The service was not as great. I would have given it 5 stars but t","useful":0,"cool":0},"uLN9CFr7fUYHt_o-4jZ2Fg":{"text":"Everytime I have ordered here, the food has been great and served promptly. Customer servi","useful":1,"cool":1},"DHy2b2hAvsNMAnqR3v7xfw":{"text":"Very quiet at a Thursday at 5 pm, but we were given no less attention. The waiter was very","useful":0,"cool":0},"uOqbKLwNbbF15nOSez_lDg":{"text":"Everything was delicious, especially the chicken and waffles. I wish they had a better dra","useful":0,"cool":0},"lBwlVtn1kLDTkVP0SG0l8Q":{"text":"Awesome food and great atmosphere.  The wedge is HUGE and the crawfish cornbread was amazi","useful":1,"cool":0},"3ZEW9jeZ6mUI2kRhIC1lsA":{"text":"Food was cool. Be wary if you eat at the bar. Our food was brought out coldish ( I think i","useful":0,"cool":0},"m9xKQNy_8KKsjN3R9ZPkNQ":{"text":"Great atmosphere!  Good southern dishes on the menu. \n\nChicken and waffles were fantastic.","useful":0,"cool":0},"pl-DxY8ZXtIMYOZos8BPGA":{"text":"Good food!!! I had the southern chicken sandwich with fries. and it was good. My friend ha","useful":0,"cool":0},"q7PYXzmBUE_Y-0dubQnQtA":{"text":"Me and my father stayed at the hotel above and we have ate here 2 times and the food is no","useful":0,"cool":0},"KonYOELTx_idhXydJn9icw":{"text":"The food was pretty good. I had the BBQ shrimp Pasta and it was pretty good. I wish we had","useful":0,"cool":0},"fTIHkLZTmodCYK07FPV-Gw":{"text":"We're visitors from Cali and using Yelp reviews, was looking for a place that had good atm","useful":0,"cool":0},"v1gnfYTdyUWkCyDIQqQShg":{"text":"Excellent bartenders, great drinks and, if you're staying at the hotel, a rooftop hot tub.","useful":0,"cool":0},"0cxXeuPbBgFWyOFbPubb-g":{"text":"Had the avacado turkey sandwich with a side of kale Cole slaw.  Kale in Cole slaw? Yes, it","useful":0,"cool":0},"kBaI-kAvsU_yLaECZrgB6Q":{"text":"Best breakfast in NOLA with beignets and cappuccino with chicory plus praline bacon and bb","useful":0,"cool":0},"iKZv6bsNC6_uGZAc_CwOrA":{"text":"Had an awesome breakfast in NOLA finally! I had the NOLA breakfast which came with perfect","useful":0,"cool":0},"VJyWPuq5snWmUlj_J-MlVQ":{"text":"Not bad. I had a club sandwich and a bloody Mary. It was a bit pricey. The decor was nice","useful":0,"cool":0},"V648Jw9mHrNRUl0BURuM_g":{"text":"Great Breakfast Spot! It's the hotel restaurant, so it's a little formal, but manages to b","useful":0,"cool":0},"FfNHNMoCvSJDHNJ8vSuYqA":{"text":"I don't review much but the reviews here for the blue cheese chips are not misleading. The","useful":0,"cool":0},"DBFS-Lr1rt6vvD7ZUb1q4w":{"text":"We stopped in this because it was our hotel bar before heading out for the night. \nI order","useful":3,"cool":2},"6QPmZVdE6xJd68a3e5MyEw":{"text":"Randomly went in for a snack and wound up having one of the best breakfasts we had in NOLA","useful":1,"cool":0},"fSB2bHtqZmegzhlPV78o7A":{"text":"I know it's Mardi Gras. But 50% of your restaurant is empty and set for diners. Why the 10","useful":0,"cool":0},"87L761vUQhhMKBjwDvksMw":{"text":"Stopped in for a solo dinner about 7 on a Tuesday while in town on a business trip. The ho","useful":0,"cool":0},"RMi1gAFIlvUh_uxIkxiBfQ":{"text":"This place was great for lunch. It was not very busy. The food and service was great. I ha","useful":0,"cool":0},"zhIBZViCpW6rmVfb1bjCsw":{"text":"Great place with great food.  The duck fries are a must. \nAlso best Bloody Mary I've ever ","useful":0,"cool":1},"FMQqJQ528OYIw2Slo0Kcng":{"text":"Our family went in for beignets and coffee. Having grown up in LA we wanted our kids to tr","useful":1,"cool":0},"-dBtuDJHxxRCnLCkzI1Oew":{"text":"I'm gonna give this place 3 stars for potential. By potential I mean food. To say the leas","useful":0,"cool":0},"kg3q1sKY8hNKZu7QFZmRkQ":{"text":"Did you know cream spinach as a side and spinach artichoke dip as an appetizer are the sam","useful":1,"cool":0},"JLJLKdNoiJoCWDWEn2H6Kg":{"text":"Beautiful restaurant and bar. We sat at the bar to have a drink first and was very impress","useful":1,"cool":1},"CPQhDz8rX7_ajexhemDu_Q":{"text":"My wife and I had a chance to experience several meals at this neat place. We would defini","useful":0,"cool":0},"rx6vzQeJ6H-lj70KTTdc5A":{"text":"What a great find. Its a good location and classy but not stuffy.  It's inside the hotel o","useful":0,"cool":0},"qsjLwjW2c4CGqxHAnKc4NQ":{"text":"Great ambience, price was moderate for New Orleans. Good menu selection. Had the Victory C","useful":0,"cool":0},"7G-krKr3FpHvz026IMSmpA":{"text":"Was in New Orleans for a Cheerleading competition and found this place on Yelp. I ordered ","useful":0,"cool":0},"jfj42r9Ah5fUMtb0Fyr4lw":{"text":"Where do I start the atmosphere was amazing I mean who has a pummel horse in the lobby... ","useful":0,"cool":0},"E8NTH9DAJpuY6vJWydSPMg":{"text":"Absolutely gorgeous on the inside. Such a rustic and delicate feel to the restaurant howev","useful":0,"cool":0},"DtGwEu4Yfu2yN36pmDB12A":{"text":"Great breakfast! Our first time here but the atmosphere is very nice and we plan on coming","useful":0,"cool":0},"S3ypUSL02HQwFwlkzFNmnw":{"text":"Overpriced. Food was lackluster,\nIf you have to get something to eat get the crab and corn","useful":1,"cool":0},"FzUJ7qlOggZlNI9RHc_PHA":{"text":"We were looking for something different while in NOLA on Christmas Day. This was so lovely","useful":0,"cool":0},"ahmTY-bUxxs-3q5vMS4wKw":{"text":"DELIGHTFUL!\n\nWe had such a delightful time at Legacy Kitchen's Craft Tavern during our NOL","useful":1,"cool":1},"KUpkuu-jEtsOF5Z_gyNO0g":{"text":"I sat beside her, not across, but beside where we could reach over and touch hands. Where ","useful":0,"cool":0},"Pb7EeHF-oJjsZ51UUBb7LA":{"text":"We walked past Legacy Kitchen several times before we ventured inside for dinner.  What a ","useful":2,"cool":0},"DchMl48VYYzBbEFz3I3LAQ":{"text":"The breakfast wasn't good.  The coffee was terrible.  The service (while extremely friendl","useful":2,"cool":0},"jJT_iICumyo_nWUJ11P2BQ":{"text":"Beautiful restaurant/bar.  Had the pulled pork sandwich.  It was delicious.  Portions were","useful":0,"cool":0},"OWRSJPoVWCASASud5NIgyg":{"text":"We had dinner reservations near by and stopped into the bar for a cocktail, only one other","useful":0,"cool":0},"7Uo2YDXo-LNu7Y_dUKGhIQ":{"text":"Don't waste your time! I'd rate it a Zero if I could. Sat around and waited for 20 minutes","useful":1,"cool":0},"QB3i0oOVnX3osznOmCC_xg":{"text":"Food was fabulous and our waitress was amazing!! I would totally recommend this place! Wen","useful":1,"cool":1},"haBdZ95GIZuFv4zbh89jlg":{"text":"Great Bar - Chicken, and waffles were great, def would go back.\nGreat Decor","useful":0,"cool":0},"prUrrbbmY3XaNUfG_hL3YA":{"text":"Well decorated and comfortable. Menu is smallish. Our table had several\norders of chicken ","useful":0,"cool":0},"O0XEGYk5rFY5VANvnutk3w":{"text":"Good dinner and lunch but breakfast is terrible. Grits weren't season d, eggs were powdery","useful":1,"cool":0},"0tXUisnU2Z9fRSXvp0Ia1w":{"text":"I was served salmon with butter sauce, after asking for no butter sauce. No biggie. The ma","useful":3,"cool":0},"DNkh9uffgHRv_-EwhZiClw":{"text":"It was just ok. Not great...not bad. We went on a Tuesday evening and it was not crowded a","useful":1,"cool":0},"UZt-gUhohslF51qjwCj3Kw":{"text":"I came here about 5 months ago for an early dinner and everything was great. Service was f","useful":2,"cool":0},"PCr6Cm72HTnyh36WB0FSTQ":{"text":"The name would indicate a bar atmosphere with a large selection of draft beers. Um, no. It","useful":0,"cool":0},"zl_rJfPZC_M5Bto7Nx5qsw":{"text":"This place is attached to a hotel. But. It's good enough that I walked from my hotel three","useful":0,"cool":0},"-P26Vnxt_3c9DUtacTcyTA":{"text":"Got a salad and a chicken sandwich, the salad was disgusting. Wilted wet and soggy greens,","useful":1,"cool":0},"dxzHFuq1rD5dCe8FVeedpw":{"text":"Really enjoyed my experience. We came for breakfast. And Troy was our server he moved quic","useful":0,"cool":0},"Izt-_gate_lfDU_JgTVBtA":{"text":"I ordered a basic burger and the buns didn't taste very well, not to mention the burger bu","useful":0,"cool":0},"e6ip9UFxiRDjbD7WpJRqXQ":{"text":"Very impressed.  We were downtown for the NOFF on a Sunday and were looking for a place to","useful":11,"cool":7},"JruFHfYThDXbsfgFqIrlwg":{"text":"The food was sub par. The noise level is insane bc there are no soft surfaces. The staff w","useful":1,"cool":0},"dAUrPfCZ3xugxD3etoHUgw":{"text":"AMAZING SERVICE by Sade on Monday, February 18th.\n\nWe were there for our Keller Williams F","useful":1,"cool":1},"P0sDwPZTsnob9rTeiDA4QA":{"text":"Absolutely amazing. I had the chicken & waffles it does not disappoint. Delicious and memo","useful":0,"cool":1},"lTFUPArgBAUWic_zeyxteg":{"text":"Walked in at 2:10 for drinks and lunch. Walked out at 2:50 with an empty stomach. The serv","useful":1,"cool":0},"cyGwAfXtnTCpNG3Kxble3w":{"text":"4 star food, 2 star drinks, 3 star service \n\ncame here for lunch without a reservation. it","useful":1,"cool":1},"pEXQ-FWU1_p3ZYW1OTzGPA":{"text":"Although the food was delicious, the service was so incredibly slow. It took us 3 hours to","useful":0,"cool":0},"zcVLHWWntTJmTJZEq4TdNw":{"text":"Met an out of town friend there for breakfast. I was embarrassed that I brought her there ","useful":0,"cool":0},"Amg6z-d8SpbPfzn1OGMXsw":{"text":"Went here based on reviews that they are gluten free friendly. They are not - it's under n","useful":2,"cool":0},"dxxePdf1B74EvXCmjUs4pw":{"text":"The decor was great and the service was as well. The food on the other hand was the issue.","useful":1,"cool":0},"gLJeISQdCW2xs_ei-blUIQ":{"text":"I was incredibly disappointed by my food at the Craft Tavern. I came in at lunch and order","useful":1,"cool":0},"AC-UxISp_gK27Vl0A9EBcw":{"text":"No complaints at All. I had the RedFish St. Charles. Which is topped with perfectly grille","useful":0,"cool":0},"6chMLETbHJo5UuMjsIlpig":{"text":"Great cocktails, great food, and great service from everyone!! Our server Michael was atte","useful":1,"cool":0},"8M-2Ytijre5xKazyLQKO7g":{"text":"Loved this place...great ambiance, good food, great drinks. This place was packed and the ","useful":1,"cool":2},"SR8hp2c_63dKTxLzlH-BvA":{"text":"I came here for lunch a few weeks ago and had a pretty damn good burger, I must say.  I go","useful":1,"cool":1},"UXgRgqUEGbPd3-69WFg1pw":{"text":"No stars!!!! What a horrible experience! Got right in to sit, waiting, waited and finally ","useful":0,"cool":0},"84VMUAjPg4LgJIXRUVWylw":{"text":"Ended up here on a fluke. Highly recommend!\nCorn & crab bisque good. Pike salmon...Excelle","useful":3,"cool":3},"FZshFdatl3VeOuOm38DgQA":{"text":"Just got beignets not much to say ....cute environment very open. Has a few games to play ","useful":0,"cool":0},"BfBKmtNGPOwA2IgVjxuDDA":{"text":"Went on a Wednesday night. The service was a little slow but very friendly - and the food ","useful":0,"cool":0},"3eRPPFdgLVAq__0bZTMA5g":{"text":"Stay away at all costs! I have seen restaurant scams in 3rd world countries, never thought","useful":3,"cool":0},"aKpgI2BdWmmON1-VFCkyEw":{"text":"This place is fantastic. Genevieve was our server and she was excellent. Our food was grea","useful":0,"cool":0},"_ztdyM5PFTrSqeS2ZLvFvQ":{"text":"I absolutely love the decor here. Very eclectic..food and service left a bit to be desired","useful":1,"cool":1},"3f7T0Q9gdqyor5x9pigFzw":{"text":"Currently dining here. We have a timer running because we sat 25 minutes before someone to","useful":1,"cool":0},"bn-IE5IFMjwJ_w9VD8tn-w":{"text":"Fancy good drinks, check!\nPlentiful bar games, check!\nSpacious place with lots of seating,","useful":1,"cool":0},"VgJjSaqR3Ha7d-yWVrSwtw":{"text":"The best place next door to Renaissance Art  Hotel with yummy happy hour food and cocktail","useful":0,"cool":1},"KaA_VwGdFQz63YswD1eSMg":{"text":"This was a really good restaurant. Cant give it a perfect score, but still a great place t","useful":0,"cool":1},"uu4_mb3cTo1iIDzwRDMUsA":{"text":"We had dinner there tonight and both the food and service were wonderful. It has a really ","useful":0,"cool":0},"mbjZ6godh4_ul4hP3LxfpQ":{"text":"Stopped in to this place for lunch on Christmas day. A long wait..... the bar was disorgan","useful":0,"cool":0},"Urzr5NUxpKh0Lx6mVracPQ":{"text":"Legacy Kitchen is my kind of place.  It couldn't be anymore \"me\". Allow me to explain. It'","useful":13,"cool":7},"1oFYFxtot5i2oLMYRjVYUg":{"text":"Didn't love legacy kitchen. Food was extremely average compared to everything else around.","useful":2,"cool":0},"5b4xOrLdS666Ebeho52jbQ":{"text":"BEST BARTENDERS!  Jay Jay and Kay where the best! OMG the beignets with praline sauce coff","useful":0,"cool":0},"6lUxdSlxIV1pA7FP9d1PUQ":{"text":"We had three Legacy Burgers, an order of Pulled Pork and an order of Crab & Corn Bisque, a","useful":6,"cool":0},"UQJ5ljSCM8AEKxXS0w-bTA":{"text":"This probably isn't local food of any sort, but everything was impeccable and delicious. T","useful":0,"cool":0},"yZSNU1_uv0iQp3nUMOncIw":{"text":"We just left a fabulous dining experience at Emeril's and decided to drop in to the Legacy","useful":1,"cool":0},"hhVq_QemR0fDJ0ZypMN97A":{"text":"Decent drinks and bar fare. In twice and it was super fun for a football game but it's pre","useful":0,"cool":0},"5FpXriebzVvlAevAcg-39A":{"text":"The burger patties are just that....burger patties, they don't appear handmade. I've had f","useful":0,"cool":0},"dXzAro4h0QnDfTRwXKUSVg":{"text":"My SO and I had the best meal here. We got the crawfish cornbread as an appetizer and it w","useful":2,"cool":0},"mmE5mLzNTHvLdnkJU_nDqw":{"text":"We arrived at the hostess stand and were not greeted with a smile or a welcome.  No time t","useful":1,"cool":1},"XNuAgDpAZHkYXSn4A6dQ4g":{"text":"Great time at the bar! Food is good, and I love how low key it is. The staff is so friendl","useful":0,"cool":0},"tw7EryO6jZSQuXUR2bOEoQ":{"text":"Not the best food. The blue cheese hard chips almost made my teeth fall out lol. Also, the","useful":1,"cool":0},"zvzlV9vhlVVmH1l_l0n_nA":{"text":"My girlfriend and I are staying at the Renaissance hotel and down below is the craft taver","useful":0,"cool":0},"_Gtf00CTAxSggH4kV_McKA":{"text":"Excellent food, drinks, ambiance, and service. Particular shout out to bartender JJ and hi","useful":0,"cool":1},"nNTDVY_-UZTddfdAbxnT7A":{"text":"Stopped in for a burger and fries and was not disappointed.  The burger was cooked as orde","useful":0,"cool":0},"nK0V3ifEt8M0vMubTAPo-w":{"text":"My new go to spot, especially for breakfast. JJ loves what he does and it shows. He'll tak","useful":0,"cool":0},"nsY4pLvWjOkz9RWgSYgIQw":{"text":"WARNING: This place will make you sick! Do not spend your time or money here. Our experien","useful":0,"cool":0},"1WaZXjMXIR_32YkD9OUy5w":{"text":"The service was slow. The server was not knowledgeable the bartender was drinking on the j","useful":0,"cool":0},"Bz96Ux4Lm2iv2RqJBC1ZDg":{"text":"I was amused by the hipster decor and I think our waiter was straight out of Scarborough f","useful":3,"cool":0},"TMuiTTNkB5HTSUnCCS_3vA":{"text":"Awesome drinks, tasty food.  Ask JJ to make your drinks, he never fails - he makes his own","useful":0,"cool":0},"4t8ld0YIy7LUh-riY-psKw":{"text":"Great place for drinks and good food.  The bartenders are awesome and the ambiance is wond","useful":0,"cool":1},"bVQ6TbwX_b5FfC-97o2CoA":{"text":"This is a restaurant attached to the Renaissance hotel, very convenient. I ate 3 meals her","useful":0,"cool":0},"Iu1PR7kiOpnZRKCa6Ke-Bw":{"text":"The name itself implies craft beers...on tap. Nope...domestic bottles only! \n\nSeptember 5,","useful":0,"cool":0},"YJF9_40LOF_DGkXzG3lwdA":{"text":"The buffalo chicken salad is delicious!!!! The sauce is actually more sweet than spicy whi","useful":0,"cool":0},"-ieS1VR0JaPzhwmIR5wWfA":{"text":"Best bloody Mary mix. Great happy hour. Amazing service. Brittany and Danny are super frie","useful":0,"cool":0},"MAGbnaIC1Z20Rb_8lQM3ow":{"text":"Hmmmmm so where do I begin, I will have to caveat this review by saying that if the review","useful":3,"cool":0},"-dMF5rIV7oIiYJ8rT7W9eQ":{"text":"Great place!  Service was excellent  our server Mya was excellent.  Our group tried the sh","useful":0,"cool":0},"mZn7Ghopb6_Ed2FAEP-g6Q":{"text":"Ask for JJ the best bartender in New Orleans !!!!  While attending a convention here with ","useful":1,"cool":1},"W7TtwLNaRbf_48ijH_Gbow":{"text":"Terrible food! Honestly on our trip to New Orleans this was the worst food we had overpric","useful":1,"cool":0},"0z1zn6AIAbP-JeqpOWz58w":{"text":"We ended up here by mistake on a Friday evening and ended up coming back on Mother's Day (","useful":1,"cool":0},"nEImIPX8SbVXwt-_mI5kkg":{"text":"The food at Legacy is pretty solid.  The service is a real crapshoot at the bar.  They don","useful":0,"cool":0},"KSRqcYOzNMkHALch7KLwjQ":{"text":"I went here for the OWN channel celebrity party and everything was phenomenal; wonderful a","useful":0,"cool":0},"LKzaMBJrP4FZVSuJvXwcVQ":{"text":"Service was fine. Food was fine. Just Fine all around. Wasn't terribly memorable. We had t","useful":0,"cool":0},"9x1NRiyPEYTo9PRJyJXBRQ":{"text":"Oh yes, I researched all weekend long to find the perfect Bloody Mary in New Orleans. And ","useful":5,"cool":8},"wPNwp8OEJPlVD0UV-_v6hA":{"text":"Absolutely NO VEGAN OPTIONS! yelp is misleading when they say \"vegan options\". \nBartender ","useful":0,"cool":0},"pDQRMwlwNeW6Ao5C57aCqQ":{"text":"Great atmosphere! JJ, Stasha, and Amy are great customer service oriented bartenders.  Foo","useful":0,"cool":1},"UhBY6f5_IZmZWptNuSQMMA":{"text":"I appreciated that they were willing to help us out when I made a mistake and ordered a ve","useful":0,"cool":0},"N_3gE4t7IrGSZ_5ncyt8Uw":{"text":"I must update my past review!!!  I know give legacy kitchen 5 stars, excellent food!!\n\nThe","useful":0,"cool":1},"kwNHtj66Hcq83f0lqMmRPg":{"text":"Nicest staff. Weird decor/atmosphere tho. And the food was forgettable at best. I had wing","useful":0,"cool":0},"zLUrXDphmd-uu4MAH8dMXQ":{"text":"Great Food/Horrible Service\nI do not have a Yelp account; so, I am posting this via my mom","useful":2,"cool":0},"iVsEhutusxY9g1xHiVVUwg":{"text":"I'll give 3 stars because the waiter who directed me to the bartender Danny was super nice","useful":0,"cool":0},"B5QS_D1qxUNJeJ_cs-FxrA":{"text":"Still a huge fan of legacy kitchen !  I've been trying to stop getting my same old favorit","useful":2,"cool":2},"oDIVPEYlYaDiZdLNgihoZQ":{"text":"Very cute inside and food is good. However only disposable cups are used for drinks..... I","useful":0,"cool":0},"xeZXYAh2xJ5A9Z3ozlRd3w":{"text":"Happened across this restaurant starving for lunch. Ordered the Firecracker Shrimp, Blue C","useful":0,"cool":0},"yi2pYuDE9OwjPozAbaT04Q":{"text":"Came at 3pm on Saturday so not busy. Nice urban antique decor. Fast friendly service. Ever","useful":0,"cool":0},"RoNbLD-wxWxRb6QjQILRcQ":{"text":"I visited here for dessert on a recent trip. You must try the bread pudding - absolutely d","useful":0,"cool":0},"-ht3j0ye_H2KbXFPIn1wvg":{"text":"This place gets an A+ when it comes to the quality of the drinks and the ambiance, but a D","useful":0,"cool":0},"UHs4tIpo5F_WxO-qRqm4GQ":{"text":"I wish I could rate this place twice for totally different reasons.  \n1 Star for the hoste","useful":1,"cool":0},"kTuSk_h3D79xs93jlsO10Q":{"text":"The blue cheese chips are the best!  I loved them so much that I ate there two days in a r","useful":0,"cool":0},"itipl64aCCUoKwE9iB3S7A":{"text":"Great atmosphere and upscale casual. TVs take it down a notch since it's more of a restaur","useful":0,"cool":0},"oi55n6SYKAQVLrNNBm9YQg":{"text":"At 700 shoppe. Craft tavern is the absolute best food.  Service A+.  I can't say enough. L","useful":0,"cool":0},"4IVQB-DQrCaVjVKe9yJ1UA":{"text":"We went for lunch.   The decor is very nice,  rustic contemporary.   The chairs are very c","useful":0,"cool":0},"u_931KyIdAunzOyt_dOwsg":{"text":"Started out at Barcadia and had terrible service. Which led me over to Legacy and they wer","useful":0,"cool":0},"CZEnzhgO9jlC4faf256m-A":{"text":"Wow! I walked into Legacy and was blown away.  Amy, my bar tender was spot on and made me ","useful":0,"cool":0},"Vf5tuk4idjkZT4feIJY4tA":{"text":"We went to New Orleans for a long weekend and stayed at the Renaissance hotel. This restau","useful":1,"cool":1},"4E8VZ4g6ltNT6xUQ0LskPg":{"text":"Tasty gumbo, salads, fried chicken, waffles.  We greatly enjoyed the friendly staff and re","useful":1,"cool":0},"iYzVvyzdZoPoIwWq7CL6Vg":{"text":"Worst place ever the service was not very good the was ok rather had ate at McDonald's for","useful":1,"cool":0},"c6BKKzXBqVTa-NnKme2BzA":{"text":"Atmosphere, service, food quality and presentation were all excellent.  We finished with t","useful":0,"cool":0},"0DUb4o1f9LWHIxAl2eHs0w":{"text":"Brought in a table of 22 for dinner. Service from the time we walked in till we left was a","useful":0,"cool":0},"DpNXMIs_6rJtb3Q8mGnNSQ":{"text":"Dropped in for a mid afternoon drink and a snack and i was NOT disappointed.  'Kiss\" was w","useful":0,"cool":0},"gTC45ls_NaSj_9-DTIWkEg":{"text":"Can't pass up the chicken and waffles.   60s and 70s music playing in the background - cla","useful":0,"cool":0},"VPkrn8ip9YRC_kU7HKc7rg":{"text":"I stopped in for breakfast. I was ignored at the bar, even though three employees were wit","useful":1,"cool":0},"FEpNUdK8_Hyx3MEQJVeSqA":{"text":"To be fair, my goal is not to sound like I'm complaining, just giving my experience. As I ","useful":0,"cool":0},"-l0HIvThI1Tl5lIwMYSwvg":{"text":"Let's just start with the fact we waited for 15 minutes after being seated before our serv","useful":1,"cool":0},"bH1eCjSeKOX66sZNEmyASA":{"text":"We stopped into Legacy Kitchen after a late meeting at the Convention Center. I should hav","useful":3,"cool":1},"h8vmymcXDTRKJ49tS0R1nw":{"text":"Had a nice lunch with some business associates at Legacy.  They had a nice lunchtime crowd","useful":0,"cool":0},"xYcD-BqXkWvVV3vnPp4JAw":{"text":"Manager was nice after she learned the Food came out cold. No brunch choices on the menu a","useful":1,"cool":0},"TAiFdTw9XsBS7NLwkcYldA":{"text":"I ordered the chocolate beignets and a breakfast sandwich. The food tasted good but the se","useful":4,"cool":2},"Bk9WbmyyLj63uLWG9ZJjsw":{"text":"Cocktails were interesting and very good. Loved the lemonade - limoncello with champagne. ","useful":0,"cool":0},"81SLdisy1SsQAYMbl0CJTw":{"text":"We came here on New Year's Eve and did not have to wait at all to get seated. The inside i","useful":0,"cool":0},"4tL05MZSZp5S1JiPu7mjUA":{"text":"Love the decor, amazing drinks, Jordan Cab for $15 a huge glass, great service, best drink","useful":0,"cool":0},"n3bkTuUiVU3tgdlIh72joQ":{"text":"Ordered mules and got mojitos, but they were good at least.  Fun atmosphere and friendly s","useful":0,"cool":0},"EbGJrnFChcVesSXWeZnvsw":{"text":"Great place for a quick bite and drink. The full menu looks appetizing as well. My client ","useful":1,"cool":0},"BwnQva8EsR0j7-Ka919rnA":{"text":"I have been to this restaurant one time before and had high hopes. We came in with a party","useful":0,"cool":0},"b7AuLJTTOpknQhVMsl6VIQ":{"text":"You've heard the quote, \"You never get a second chance to make a good first impression\". W","useful":0,"cool":0},"hURlHUv4gq_zBuqpCvTASg":{"text":"BBQ Shrimp and Popcorn Rice was the best thing I've had in NOLA! Happy hour was a good dea","useful":0,"cool":0},"pmREdE_Kwb4jk8zbDbbwAQ":{"text":"Meal was prepared perfectly. Staff was very prompt and helpful. Kid friendly as well. We w","useful":0,"cool":0},"WsEfJu5SctL5meTrmatUqQ":{"text":"I noticed the coffee shop was opened this morning for breakfast. I stopped in for coffee a","useful":0,"cool":0},"j6g_rI-X--rf3j6AUJ9KgA":{"text":"My husband and I will ALWAYS make it a point to eat here when visiting New Orleans. Great ","useful":0,"cool":0},"vmdsYFSuRFnmgL3AjkP6mQ":{"text":"The service and food were spectacular Amy and JP were the greatest bartenders. Had the bes","useful":0,"cool":1},"eqA1Ubz37BWTqcCq2Ctrqw":{"text":"Whomever was working the flyer tonight was extremely heavy handed on the salt for the spin","useful":0,"cool":0},"eUv6R7cnx7Z7pzcJtwwwJQ":{"text":"Went here for lunch our server was great and the food was good, but the bartender with the","useful":3,"cool":2},"jdNIR7SidhyL2y9qNedMDg":{"text":"No stars!What a horrible experience! Got right in to sit, waiting, waited and finally serv","useful":0,"cool":0},"kTDmcMV3VwonYIosY3vDqw":{"text":"Great place for happy hour drinks. Food is really good and service is on point. Sit at the","useful":0,"cool":0},"8GzWCGf1yGHVD5Fa2niqGA":{"text":"Was great food. Loved the oysters and incredible service from JJ!! Definitely will come ba","useful":0,"cool":0},"5ap0h1vcwjc0kIAs84wTuQ":{"text":"JJ is the best bartender in town. He will  ake you feel at home and treat you like a speci","useful":0,"cool":0},"zNwezKpLSXg9Z9sYkNRGNA":{"text":"Huge thank you to Legacy tonight. We got there with our twin 20 mth olds, there hostess as","useful":0,"cool":0},"BEM87ukLV9EBeO2AnacH_A":{"text":"I haven't been to any of the Legacy restaurants around the city, but if I did, this one wo","useful":1,"cool":1},"lF-6Gxm9KpxnrqKkUZrCcg":{"text":"Nothing like the other legacy kitchen locations. For starters I order the China town shrim","useful":0,"cool":0},"7iOjXKHTuH6VLLPl-pKNcg":{"text":"Great place to catch a game and hang out with friends. It's conveniently located for a pre","useful":1,"cool":1},"LM36c8_xifYFcAdQP1uTbA":{"text":"This is what happens when you're staying in the Warehouse District, it's mid-week and you ","useful":8,"cool":9},"TrM3BXkXulQrp2wIIYTHjQ":{"text":"Food was decent, service left nothing to be desired.\nThe Raw Oysters were fantastic (once ","useful":0,"cool":0},"HQ4k4O2mKAOamcnRGdP6Cw":{"text":"Came for a quick lunch.  Had salad with reheated buffalo chicken, flavorless spinach dip w","useful":1,"cool":0},"s0R9rv5NL3m8pmQlNyuogw":{"text":"I love the original legacy in Metairie! This one is a tourist trap, the bartenders don't c","useful":0,"cool":0},"c8JwnlqZboqHJVOaS53Egg":{"text":"Great options for breakfast and brunch. And great for families. Was staying at the Renaiss","useful":0,"cool":0},"Sr7X9780tkf5ITV0gaUUpw":{"text":"Fantastic start to my weekend here in NOLA. Stopped in for lunch and had the Shrimp po boy","useful":0,"cool":0},"9bMrn5Z0eExsv2f9LYiVtA":{"text":"Called to check on wait times for Christmas lunch. Was asked the size of my party (2) and ","useful":3,"cool":1},"1W9FUM85Qw9iZHrlG9s1og":{"text":"Just to let u know... The bartender J.j. is the shiznit' . He is THE TRUTH...u have to go ","useful":0,"cool":1},"PlnqevLmN9Kw5VE-62i8EQ":{"text":"The service we received at Legacy Kitchen Craft Tavern last Friday was top notch! We had 9","useful":2,"cool":0},"H3Cn612s7t_t99vnt7FSuw":{"text":"Ok so we stumbled in because we were hungry and had an experience. Amazing flavors and ver","useful":0,"cool":0},"9zbOwyz7tjNJQzHnz2kPcw":{"text":"The wife and I stumbled upon this place while trying to visit another establishment and it","useful":1,"cool":1},"-VQPB0wFQTWNIkl8WF5rkQ":{"text":"At first glance everything seemed great, the decor was nice and the hostess was quick to s","useful":0,"cool":0},"Po7G6NC6yJTME_Gt7_mHAQ":{"text":"My co worker and I were looking for a quick bite near our hotel, Legacy did not disappoint","useful":0,"cool":0},"gKqVCi_aKOM5u-wSDd3U1w":{"text":"This is the first spot that we dined in upon our visit. It was steps away from our hotel. ","useful":0,"cool":1},"5gOKrSJbUQJ74U0PZDcqUA":{"text":"Yessss let's hit the ground running straight off the flight checked in and started to enjo","useful":0,"cool":0},"YjZkRLj1d_JiawTAaDmqrw":{"text":"Phenomenal wings!!!! And great bite sized beignets!  After reading some reviews I was hesi","useful":0,"cool":0},"vV1RfxgofhjRvoQz7SFdxg":{"text":"Went to Legacy kitchen while in New Orleans for a trade show conference. It was close to t","useful":1,"cool":0},"yztRuIrLA-HqS5gjS0JLmg":{"text":"My favorite restaurant in New Orleans! The restaurant is clean and has lots of space, the ","useful":0,"cool":0},"SCaPgmdrxswc-INMn2318A":{"text":"So many things to love about Legacy Kitchen on Tchoupitoulas!  Great Food, unique decor, c","useful":3,"cool":4},"gfPGToUJV06RBsKlDP-Gxw":{"text":"The service was very slow.  Started out having to wait 15 minutes for a snowball coffee.  ","useful":0,"cool":0},"xHWKRsE6aS3HdwUJws7rnw":{"text":"Mediocre! The soup was very ok, but the Po boy, was quite mediocre.. the biggest disappoin","useful":0,"cool":0},"F5I19ZHCvb4RWO4-2Ee4mQ":{"text":"We tried Legacy Kitchen when on a recent trip to New Orleans. It was outstanding. The food","useful":1,"cool":1},"pyNRe8OjB-hJW_dzwPMayQ":{"text":"I was visiting New Orleans and staying at the Renaissance Hotel. I visited the Legacy Kitc","useful":2,"cool":2},"2AMGTbfBhN2q_Cy5FYzvEg":{"text":"I was at an event that had a horrible bar so we went to Liberty Kitchen for the advertised","useful":1,"cool":0},"KOequ34wdlTxQsLzrhb-qQ":{"text":"We stopped in for a quick breakfast. The beignets bites were tasty. The chicken and waffle","useful":0,"cool":0},"XHwurBuPKarmG9nhx13YtA":{"text":"If I could give no stars I would. We were in town for a weekend and decided to try this pl","useful":0,"cool":0},"Ne07WKxEHKbj0l_aYrbuiQ":{"text":"This coffee house seems to have been subsumed into a bar: \"Legacy Kitchen/Craft Tavern\" - ","useful":0,"cool":0},"HAQ_TSzuJuLIITW1wzVHWQ":{"text":"Legacy gives a nod to all things Americana from the food offerings to the music and the ar","useful":11,"cool":14},"iloWlr0GutI-Y_FIKCMFAQ":{"text":"It's a dressed up Applebees with a bit better service and bar.","useful":0,"cool":0},"fDiYkfrVw03YYOr3Du1xRg":{"text":"#49 for 2019\n\nShort & Sweet\n\nWhen you go into a bar in a high end hotel such as Renaissanc","useful":47,"cool":21},"Mp_WtX4uMQ4X-U6zUvq7JA":{"text":"Place takes 2 hours to deliver food and terrible service. I ordered charbroiled oysters an","useful":0,"cool":0},"A9bHKOpL7gFkdGcCsscXsw":{"text":"Love Legacy Kitchen!  Had the best service today at the bar with Jenna- she worked her ass","useful":0,"cool":0},"WEoBvcf-4JETs2Z7CI-QOg":{"text":"Found this spot thru Yelp. The industrial vibe sold me, so I thought I'd give it a shot. L","useful":0,"cool":1},"_KDyjiP0PYZD7DOyW8M6EA":{"text":"Came in on Labor Day weekend with my family for breakfast. The menu was pretty basic but f","useful":3,"cool":0},"j5mcOQ_W3uaKs4UUIKU5qw":{"text":"I had the best experience at Legacy. *Stasia*with the pink hair:) was such a pleasure to b","useful":0,"cool":0},"JSrHP5fRpLtcvX_lk0wtZw":{"text":"Kitchen computers went down and we waited over two hours for our food. The wait staff trie","useful":0,"cool":0},"52Ts1MBJVTSq07hcNrH6dA":{"text":"Just tried to eat breakfast here, never got served. Understaffed. High prices. \n\nToo many ","useful":0,"cool":0},"3nGEovCI6tVS0iboLQotAw":{"text":"Your bartender on Christmas night should be running that restaurant...well maybe girl shou","useful":1,"cool":0},"OIRFVyjkKxwUL9zuonfWKA":{"text":"We went here for breakfast on a Saturday morning. Our sever Ya Ya was outstanding she was ","useful":0,"cool":0},"MuejjPH8V2OyqhQuRWrzhA":{"text":"Was staying at the hotel next door. Their restaurant wasn't open so we came over to Craft ","useful":0,"cool":0},"_esKjDqGyV6-EMYb5tm2PA":{"text":"I had the Chinatown Shrimp with a side order of shoestring fries. Loved them both and the ","useful":1,"cool":0},"mUVS0gxJFuK4OxdGo88iWQ":{"text":"Great service and friendly staff, our order was a few minutes late and the chef came perso","useful":0,"cool":0},"HtggG-zJ4XFJ3FrN_vSTlQ":{"text":"Worst meal I've had in a long time. Only thing worse was the service. I waited (in a half ","useful":0,"cool":0},"M2j7YgIjgH0q3WuXrD1wyw":{"text":"Staying in the hotel for a convention. The food was amazing! The waitress could have been ","useful":0,"cool":0},"2D1sxrLEqFjfYHWAEWsY8A":{"text":"We ended up coming here after several other restaurants we went to were packed and were su","useful":3,"cool":1},"EgoJtB57rSOjHgDhBcZPZQ":{"text":"So I thought this would be a fun place to try... They did a nice job updated the space whe","useful":5,"cool":4},"xKx2UH2ihlsfvhqz-VSKEw":{"text":"Went here with my wife for convenience since we stayed at the hotel. Service was good but ","useful":1,"cool":0},"m0d6ByE4j5Zemghy9gquGA":{"text":"We stumbled upon this place quite by accident and were very impressed! The food was excell","useful":0,"cool":0},"JyS4f7rGQaxVDlS7_QV8tw":{"text":"Waited an hour on a 45 min wait. 1/2 the tables were empty. I understand, they are short s","useful":0,"cool":0},"FSCuDZPBz24D6J-J5ygDFQ":{"text":"Must go to when in NOLA!! Kipp, the GM, was all hands on and led by example .. the roast b","useful":0,"cool":0},"IJ3kx0GD3fKim_ik7jG8xw":{"text":"A hidden gem in the New Orleans warehouse district.  What a great experience. Our group wa","useful":0,"cool":0},"TV46rdc4j0HeH4znaTWKDQ":{"text":"Even on a holiday (Mardi Gras Day), the wait was relatively short, the wait staff was atte","useful":1,"cool":2},"SN3yuEs3p-PaGczO8onIdg":{"text":"To say that our experience was underwhelming is being generous. We had the duck nachos to ","useful":2,"cool":0},"9zkUJvFiOBXcYBeWnc9iLA":{"text":"We actually stayed in the hotel. I will be honest, they were out of a few things on the co","useful":0,"cool":0},"2v5GIwukQsjwAuvE-Hf8xQ":{"text":"Arrived after brunch and before dinner, so the restaurant was not busy at all. \nI was warm","useful":0,"cool":0},"6mg5pPEjvZnXiJh4nUrMfw":{"text":"This place was so cute. Little bit of a wait but we hung out at the bar while we waited an","useful":0,"cool":0},"13soqtWqIvhGD9aEuHyyrA":{"text":"JJ the bartender is a BALLER! I told him a vague\n description of what I wanted and he crea","useful":1,"cool":0},"Ao77_CFmUD9YmsArW63Keg":{"text":"It was our first time there, the food was amazing and out waitress, Jenna was great she wa","useful":0,"cool":0},"Vpcs7E1I-PiKbYeiBzIJAA":{"text":"I wish I could give this place zero stars. It's AWFUL! \nI've gotten better service at McDo","useful":0,"cool":0},"die4-7RU9psmPp7TTO7XZQ":{"text":"I hate to be a pessimist, but my husband and I were very disappointed!  This was our big o","useful":0,"cool":0},"lanRL29XG7nRPw60yv-1Wg":{"text":"Legacy Kitchen remains on the list of my favorite places to eat in my neighborhood.  It's ","useful":2,"cool":2},"kPvkzE1KTC-dVKU9vbHwhw":{"text":"Just popped in here for a quick bite - I had the crab and corn bisque and the fried oyster","useful":0,"cool":0},"cnqpGseFeZ_M92zy-jb25Q":{"text":"As a guest on the hotel, I've eaten here 3 times since my stay. The staff is friendly and ","useful":0,"cool":1},"Dg-6i2KHLziMUsJTu-FnFg":{"text":"We came here hoping for some good oysters and a happy hour deal. On their website it says ","useful":0,"cool":0},"Ql_ITb_gjDsK2G917V_mSw":{"text":"Lets just say this wont be a repeat. Sat at the bar, server was pretty poor and non-attent","useful":0,"cool":0},"ZAr71VNT2Sou6zu-vYHhDA":{"text":"We stopped by for happy hour drinks. They were top notch. We also had the crawfish dip wit","useful":0,"cool":0},"3vztZayxsssnmb6N9t8JwQ":{"text":"Just stayed at this hotel this past week for the second time. I came back because my first","useful":0,"cool":0},"2ME5UUeCJOrERLPoLlZsPA":{"text":"We wanted a quick spot for breakfast before we went to the WWII museum. This was an odd pl","useful":3,"cool":3},"eG9duZaSWmKrgox3htpBbQ":{"text":"DID THEY LOSE THEIR GUBMENT CHEESE STIPEND?\nThe $17 mostly-slaw (see pic) pastrami sandwic","useful":6,"cool":2},"nTOk9soXHJMFf_LdgYV9sA":{"text":"Where do I even begin. The bartenders especially the lady with the rainbow colored hair. Y","useful":0,"cool":0},"3txef1DIkdDpdlZTr9Fl7A":{"text":"Situated in a hotel, Craft Kitchen is modern and well put together.\n\nWe came in for lunch ","useful":0,"cool":0},"aB1uxJYcDwn0ymXqXhyYsQ":{"text":"Brunch was delicious. Best waffle I ever had. Parfait is flavorful. Grits bowl excellent!!","useful":0,"cool":0},"cbcuI9qrghIvSLySrIh__w":{"text":"This restaurant has potential, loved the ambience and Mike was a great waiter however the ","useful":0,"cool":0},"8VQzuw-xLcMw3EtD8Mnyqg":{"text":"Well it all started out by waiting........ and waiting ....... and waiting some more. 20 m","useful":1,"cool":0},"kvPOzTIN9UjsXCZzpp0FXw":{"text":"Really good, fresh New Orleans food. I was able to taste a few dishes from our table. Gumb","useful":0,"cool":0},"UEp0orHrSm2YkGvve-X8Fg":{"text":"Today's visit is connected to the porch swing during and the lack of bar etiquette for bot","useful":2,"cool":0},"n-JJqoqz6O1IgYNZ7LoOHA":{"text":"Usually it's good. This eve, not so much. \n\nVery very dry Martini means almost no vermouth","useful":0,"cool":0},"Fh9HEWw9pobbVPUj_MGBvg":{"text":"Staying nearby at the excellent Cambria Hotel, the front desk recommended Legacy. We went ","useful":2,"cool":2},"AT0Wud_IrzCqjqJFiUHUWQ":{"text":"We had a wonderful meal in a mostly empty restaurant.  Really surprised  more people weren","useful":2,"cool":0},"YrWDEGSOg1ZvcL1HVuamzQ":{"text":"Came in last night for the Grey Goose dinner and had a blast. Everything was delicious and","useful":1,"cool":1},"0G8V8mV5UyuRNGjUJ7NiWA":{"text":"I really wish I would have jumped over here for a good breakfast - I think my experience w","useful":0,"cool":1},"dFa0OdSbfr6W0ci1-GIwlw":{"text":"The food was GREAT - we had a NOLA grits bowl, chicken and waffles, and an All-American be","useful":0,"cool":0},"7_AN7RfiyIhnD7VYdQrZfQ":{"text":"Like many places, this restaurant seems to be short staffed due to the pandemic. We got in","useful":1,"cool":0},"gvwekC7ObT26cz7VBcrjzQ":{"text":"We stopped here for dinner, picked the restaurant based on reviews and proximity to our ho","useful":0,"cool":0},"ss77JO9W58RPW_3SG1J_Hg":{"text":"Decor: 5\nRustic, and modern with the right amount of kitsch.\nFriendliness 2\nThe bartender ","useful":3,"cool":2},"mzC22MJjZt2BhuMDhY92_g":{"text":"The Redfish Pontchartrain with charred asparagus was amazing! I ate at the bar and the ser","useful":0,"cool":0},"ZFH_CFuQyZKgxVpmd0BGrw":{"text":"We spent 4 days in NOLA and enjoyed 100% of our time. Legacy quickly became our favorite b","useful":0,"cool":0},"-FJA4wm2nSupWcqe-5KTPw":{"text":"Legacy is always a big win for us! We've thoroughly enjoyed breakfast but this time we wen","useful":0,"cool":0},"lXFR-ACgSQzoEU3vWIJdUw":{"text":"I'd say that Legacy is a very cool place to go to for drinks! I went one day for dinner wi","useful":0,"cool":0},"5gkiXcVxlz-FoMwheOHhhg":{"text":"Great modern but cozy spot on Tchoupitoulas! Found this place around the corner from our h","useful":0,"cool":0},"nt7c9qL_Hud7HslCAE1hRQ":{"text":"After WWII, we were extremely hungry so we decided to give this place a try. We ordered th","useful":1,"cool":0},"P82KgKS5XXedYLqTEvjDug":{"text":"Highly recommend their redfish dish & roast beef poboy. Both are on my list as all time fa","useful":2,"cool":2},"G0d14jjLOAKMnF2QWCYZ3A":{"text":"Super pricy. The food is alright. Nothing fancy. The only big draw is happy hour with chea","useful":0,"cool":0},"2IQFMEXAkdUetdxJa3JFoQ":{"text":"After a long day of sightseeing, we wanted to take a quick break before heading out again ","useful":1,"cool":1},"aFWz6YLWqNnIslACjtqzww":{"text":"JJ is BEYOND incredible.  Upon walking in, I asked for a mojito to find out they had no mi","useful":1,"cool":1},"uBNl67rDmEaolKUtfeQtEw":{"text":"prices were steep for beyond mediocre food. Garden district club and pulled pork sandwich.","useful":2,"cool":1},"vZ-mI-rEU6xTvWIi2GnDxQ":{"text":"Omg me and my friends visited for the weekend ! Coming from Dallas and since we have been ","useful":0,"cool":1},"oUQJXVkY2_rZDLb99ET_ZQ":{"text":"Awful. Waitress was nice. Ran out of two apps that we'd ordered and we were never told. It","useful":0,"cool":0},"1syBAjzPnrO3xB13YBFKCw":{"text":"We came to Legacy kitchen during our NOLA visit, the food was amazing and service was wond","useful":1,"cool":0},"PNKItkMhUg2ku4m72FUAjQ":{"text":"The wife and I stumbled upon this place while trying to visit another establishment and it","useful":0,"cool":0},"oU369Cgz-OsenrT7_vPfJQ":{"text":"I would give this place zero stars, if Yelp allowed it. Our experience was so bad, it was ","useful":1,"cool":0},"Lue0bSKiKBNn6e_efG_rIQ":{"text":"Typical New Orleans restaurant, but def a 5 star restaurant for various reasons. The food ","useful":0,"cool":0},"7C8uQoGH1lbCAAhDUed6OQ":{"text":"This used to be one of my favorite places to go for breakfast, NOT ANYMORE. My husband and","useful":0,"cool":0},"EwtLGJQLUDGBysPxG_DYxA":{"text":"So let's talk about Legacy Kitchen. First of all that it my new spot for happy hour drinks","useful":0,"cool":0},"zs5TYEmsATdQlMQdXcGMtg":{"text":"We stopped in at Legacy for an early dinner.  The restaurant has plenty of windows making ","useful":2,"cool":2},"Hhgc5s-ZUMffpasj6RPj2A":{"text":"Located in a great area in the CBD, this location is perfect for foot traffic & to drive i","useful":10,"cool":6},"b6ojbRk3Vs361thSH5_kaA":{"text":"Not sure if service was bad because they were short staffed, or what. We stood at the host","useful":0,"cool":0},"YLxwotrqQMKREAcmyql4tg":{"text":"The food was okay. The service was lacking. Missing food items, couldn't enjoy coffee beca","useful":0,"cool":0},"RmufaVFS6yePfeCXnhlxlg":{"text":"omg, how was this ever allowed to leave the kitchen. You should be ashamed of yourselves. ","useful":0,"cool":0},"IcmueRC0if9-laBXCyUCCQ":{"text":"This place is trash. \nThey legit got 8 waiters and only 6 tables to serve. \nBringing water","useful":0,"cool":0},"dvAmhqdl1vqcVIp9RGmw8w":{"text":"If you decide to dine in be patience.  I think they are understaffed since there is a sign","useful":0,"cool":0},"my64bgVZe2fWjhgzkXG6hA":{"text":"The corn and crab bisque is amazing.  The grilled red fish with asparagus was out of the t","useful":0,"cool":0},"XoHId-sq_bPB7QdOWydPOQ":{"text":"Stopped in for drinks but service was terrible. We had intentions of hanging out longer bu","useful":1,"cool":0},"BhoOB87UKg2qNoPZh0y_2w":{"text":"Unfortunately the kitchen staff is visible and were not wearing their masks tonight on our","useful":0,"cool":0},"2Er88LEojTqQ92O_js-N5w":{"text":"We called in here for breakfast. it is a nice place...part diner, part bar...part restaura","useful":4,"cool":3},"Yiu981hDym6kEYJOG771Rg":{"text":"I'm giving 3 stars, but it should be equal parts 5 and 1.  1 star: despite making a reserv","useful":1,"cool":0},"AUYU4zJ1YoUw5kAJAYGi6A":{"text":"Doesn't live to to what you would think based on its name and the its location. \n\nBar was ","useful":2,"cool":1},"5DQveBpFH6axZE_XKV0c5w":{"text":"Me and my associates visited this restaurant with extremely high expectations!! Upon arriv","useful":0,"cool":0},"2Pb6g_jPeHPpih9ZqWYKOw":{"text":"Located in the Renaissance hotel, gave it a try for dinner. My server was very welcoming a","useful":2,"cool":0},"LdV8HwCptGoxCtSBsBNnjA":{"text":"Best shrimp tacos I have ever had.   Great atmosphere and comfortable temperatures.  The B","useful":0,"cool":0},"PcbhTdPBL0Tfczm4bj_yeA":{"text":"After a long day out and about in NOLA, some colleagues of mine and myself decided to give","useful":2,"cool":1},"2x6vcDTNVlfLfsMS1b2Z7w":{"text":"I dashed in from my hotel for  a quick cup of coffee and beignets for breakfast. Upon a re","useful":0,"cool":0},"0tBeGqfc5FcfUM_CRomfBA":{"text":"We sat at the bar to get some drinks and watch the saints game. Thank you Jenna for the gr","useful":0,"cool":0},"HQkpY95Drwr5SVkto9vdcQ":{"text":"We yelped this place off the street. It was one of the few places open between the hours o","useful":1,"cool":0},"yE2ldie7TtZEvVLca0-t8g":{"text":"I been here for dinner sometime last year and the food and service was stellar. Well i cam","useful":1,"cool":3},"77scZbBBI5SwfAKRMmaw1w":{"text":"This place is located in the warehouse district within the confines of the Renaissance Hot","useful":0,"cool":0},"adjDre0VbhLMLpg7dQ7VRA":{"text":"Decided to visit this spot for brunch. I would like to say that the vibe is great and it h","useful":1,"cool":1},"SexCmNE2HDth_I5I9NRHlQ":{"text":"I looked at the menu and had big plans for my appetite.  I started with a mojito (excellen","useful":1,"cool":1},"WpXPUmNGEb9JSeLt6Oelng":{"text":"The hotel voucher says we're entitled to a \"pastry, drink, and coffee\". The guy working th","useful":2,"cool":0},"HqPWRvxegx6s_GyaVsq79g":{"text":"First day in NOLA and we hit a major home run!!! Amazing food, great ambiance and a waiter","useful":0,"cool":0},"70PaVD1QTm5sERmdkx8Q0Q":{"text":"Came here Saturday night before the Cirque de Soleil show for a quick bite. My boyfriend a","useful":1,"cool":2},"PdmwKJLFj9U170-b5MB4dw":{"text":"I love this new location of Legacy Kitchen! It's close to the conference center so if you ","useful":0,"cool":1},"ryKZf60IuvCG4ko-vmwgjA":{"text":"Popped in here for an early lunch and basically had the whole place to myself . The space ","useful":1,"cool":0},"qgBghndj9K_oqO9g836OTg":{"text":"Not so impressed. Service was weak, we sat at the bar and waited and waited. Food came and","useful":1,"cool":1},"SEgMeA_WltWvXs-DBGvmLQ":{"text":"So very sad. I have wanted to go here for so sometime. We were in our way to another resta","useful":2,"cool":0},"zoWwRSPOq0YT6iuN20SNjg":{"text":"I was staying at the renaissance and had complimentary breakfast here for which I was supp","useful":1,"cool":0},"WAFs5HFzPCtwllr8uICtTg":{"text":"I've been to Legacy three times and all have been good. The first was lunch with colleague","useful":1,"cool":1},"WzauS4l5V_2TloQF4NdHeQ":{"text":"The food and service  was amazing!  You won't find a better place to go and wind down. The","useful":0,"cool":0},"6bkF1iQ2dWz5IOARj5zvdQ":{"text":"We were looking for a dinner spot in Nola that served more than just gumbo, jambalaya and ","useful":2,"cool":1},"PXgYzPgdIHC4JCCtljFpyg":{"text":"Believe it or not, out of all the places we ate in our 2 day stay of NOLA, this was actual","useful":1,"cool":0},"fMB1pAswbdOV8auQoO5yCg":{"text":"Coming back on my scene now with a couple of new trips in great service at the bar. Invent","useful":1,"cool":3},"EgXKDoi7lnlhX6iam9EgpQ":{"text":"Food was like a cruise line buffet. Service not too good but not servers fault, way unders","useful":0,"cool":0},"veOuVPnxYc8-3bct-EwyHQ":{"text":"Apparently I was taken for someone who didn't care or matter or both. \n\nTerrible service o","useful":3,"cool":1},"PAs7kB3Q2ETHOTLk5P7DXA":{"text":"This visit did not start out well, but fortunately the food redeemed the experience. We ha","useful":0,"cool":1},"jK3XOf3pyE3JuZERF3cHvg":{"text":"Legacy craft kitchen \n\n Eating at Tavern are great for businesses and normally industrial.","useful":3,"cool":2},"QBrXtLd8-RSB8Ml8qjmWrA":{"text":"Stopped here whilst on our trip as it was the only place that would accept a large last mi","useful":1,"cool":0},"8YJZPcQ1mfZpv75qUkB2GQ":{"text":"GREAT FOR GROUPS!!!!!!\n\nWhat an awesome place!!! This is definitely a place you can visit ","useful":2,"cool":1},"poTgMqjAek2XG7ZRxyQ__A":{"text":"Great vibe, amazing food and cocktails.. Our server Mike W was awesome!  Must stop in New ","useful":0,"cool":0},"lI7oolQUXGkvPj-lcy5NQA":{"text":"I was back home visiting my Dad and had the luxury of a leisurely breakfast before heading","useful":0,"cool":0},"RZt1VF-2eY_TUXDHJvxc4w":{"text":"I was staying at the Marriott and was excited when I realized the new Legacy Kitchen was a","useful":7,"cool":6},"kM5iiDVKoXIf6uOivxMp-Q":{"text":"We had an amazing experience here, especially because of Mike W, our server!! He was frien","useful":0,"cool":1},"adC3I-2VhnXq_SY9fR9zHA":{"text":"Awesome food, super friendly staff.  Bananas Foster Waffle yummo. Cheesy grits delicious. ","useful":0,"cool":0},"26iwR7ZxTMDsiNtP1k5Seg":{"text":"Avoid brunch like a plague. The kitchen doesn't know what a poached egg is. We got 2 meals","useful":0,"cool":0},"hwU1pd95147nWQTFavjNyg":{"text":"I've only been here for happy hour and all three times (yes, three!) I sat in the bar. The","useful":3,"cool":0}}