{"mjkJIWcThBvmm1ngtyRAHQ":{"text":"Eh. That's the best way to describe our tour. Our guide, frank was very knowledgeable and ","useful":2,"cool":0},"6fTJCqFbgM_jJR2-en_Daw":{"text":"I purchased a Groupon for this tour!  It was a little difficult to schedule it after the G","useful":5,"cool":3},"qb99m-uQkfHDiLAP-ugQ9g":{"text":"Did the Aphrodisiac Tour.  Loved it!  Cindy had lots of insider tips to the city and took ","useful":1,"cool":0},"NpI6O-LP-hI7C_fhpuiWtg":{"text":"My experience with the tour was fine. We contemplated booking a Groupon, but didn't have 2","useful":16,"cool":8},"TK8BkB1NFk93Ou5SXRluTg":{"text":"Bought a Groupon for the 3-in-1 tour about Voodoo, Cemetery, and French Quarter.\n\nOur guid","useful":0,"cool":0},"wRD6KjJxvDPQzA7-m7YSLA":{"text":"The ghost tour was great! Andy was very entertaining and full of information. The tour is ","useful":0,"cool":0},"T_m3XqaXnQ5eGO5qCxf3Sg":{"text":"My group of friends got Trevor as a tour guide. It all started off okay but as the night d","useful":0,"cool":0},"fRj8Zl-YIyFLpuFVkrk85Q":{"text":"Witches Brew Tour! Here's the scoop, we got our tickets on Groupon and to be totally hones","useful":0,"cool":0},"Shp8RRlOMq8O-JirBEn3Iw":{"text":"I purchased the groupon online and I wasn't sure how to redeem it on their website, but on","useful":1,"cool":1},"WZL7ZrqlkygF1BovbDD72w":{"text":"I was able to book my tour via Groupon and secure an appointment for the next day. My frie","useful":0,"cool":0},"XJl6OdUDlxIe0V3I9i4gsg":{"text":"This tour stunk!! Don't know if it was our tour guide or my expectation. It was walking to","useful":2,"cool":0},"1d_0a1iYemFb3cFbZ8RLZQ":{"text":"We had an amazing tour! Nate was our guide and I swear he is a city fixture, everyone we p","useful":0,"cool":0},"F3kEkgdyppNrOrKLMrNKgw":{"text":"We on the tour last night and all of the stories and landmarks were half assed and most we","useful":0,"cool":0},"iONJrXx7cE9eagPpv6rzGw":{"text":"Recently did the 4 in 1 tour. Preston Tyrone was our guide and did a great job! Talk about","useful":2,"cool":1},"CPAXZZ8ysJ0l5qVaebhKlA":{"text":"I bought a groupon for the tour and booking couldn't have been easier. Edward was a fantas","useful":1,"cool":0},"TdpZjqwKo0wjDB7JPDkuZQ":{"text":"This was an amazing tour! Frank was our guide and he was excellent. We were in a small gro","useful":0,"cool":0},"DLRle-bOTl-tmwyssuElew":{"text":"Had a fabulous tour with Sarah!  She was full of energy, and knowledge about the city, arc","useful":0,"cool":0},"mDXKxIwD1xSp4rqX9pdezw":{"text":"Okay so. As many times as I've been to New Orleans throughout my life, I had never done to","useful":0,"cool":0},"SanQughC6tXHJMLcFe8mIg":{"text":"3 of us booked the \"3 in 1 French Quarter, Cemetery & Voodoo Walking Tour\" online for 11 a","useful":0,"cool":0},"ER7WOtz5OuHtzIidDoObDw":{"text":"We went on the 9 am \"New Orleans: French Quarter, Cemetery, and Voodoo\" tour. Be prepared ","useful":0,"cool":0},"lf1djaupkh4gATqWYKrQCw":{"text":"Very interesting history tour of the French Quarter and some of the things that happened t","useful":1,"cool":1},"CNBI66-kYYNZWWxqmEg3FA":{"text":"Just finished my Ghost, Voodoo, and Vampire tour with Mary Lynn was absolutely amazing!! S","useful":0,"cool":0},"OJFLzIeDc_kAfkij24u6tw":{"text":"Bond was a great tour guide.  Very knowledgeable and passionate about her job.  We had a g","useful":1,"cool":1},"P9G98dr595MgjOvuhgaDzw":{"text":"The guide was annoying and kept losing her words. My boyfriend new more about the location","useful":5,"cool":0},"y-zTRYWto85Y_vfPpY-Vsg":{"text":"Setting aside the weather which is just a thing to manage in NOLA the entire thing was dis","useful":2,"cool":0},"dfzkm5zEB9_LR2I5LHEI0g":{"text":"LOVED the tours we took!!! Will definitely book another tour next time I am in New Orleans","useful":0,"cool":0},"uafPy6AGDslGW5uxzJVWtA":{"text":"We recently visited New Orleans and decided to take this tour.  Specifically it was a ghos","useful":0,"cool":0},"qJyOyYIFK0Va_yIimR-Pzw":{"text":"Doc was our Tour Guide, he was amazing and he was very knowledgeable with his history of N","useful":0,"cool":0},"nJhxkRxuxNUel15c9GVcXQ":{"text":"Can't remember who our guide was but he rambled on and on and said the same thing 5 times,","useful":2,"cool":0},"pRFp_4kHO6ptMl4QALDiqg":{"text":"Team Edward!!! Absolutely the best tour in NOLA!\nAnd Edward was the most interesting, char","useful":0,"cool":0},"HAY1zZoteczcEn1xgQpWyQ":{"text":"Did a Cemetery Tour with Lady Rose the tour guide. First , she really did down play the hi","useful":3,"cool":0},"zGLyb6bUsgftbVp336oy3A":{"text":"Tours are a must if you're visiting NOLA and down to learn some history / ghost stories. I","useful":3,"cool":3},"mj9X0obx_l7zDKcb9lvZwQ":{"text":"After reading a bunch of other 1-2 star reviews, I decided to write this one. We booked th","useful":0,"cool":0},"ac8NuMW2It5aNUQ7B6ouTw":{"text":"I want everyone to see how unprofessional the owner of this company is, here is his nasty ","useful":4,"cool":1},"LZZTIRWgo3E_iASnT0uRSA":{"text":"Chose this tour after looking at options online. I have been on a few tours in New Orleans","useful":0,"cool":0},"xwzvvD8hPOiTKCsDzMYHmg":{"text":"I had a great tour and a real witch giving the tour.  Very informative and great recommend","useful":0,"cool":0},"AVXvKzAZ9X-uUkN3vpnZQg":{"text":"Had a great time on this tour! Our tour guide, Andy, was very knowledgeable and his passio","useful":0,"cool":0},"qZ1W3pxzwUspM4v_krM2xA":{"text":"Went just did this tour last night And I'm still checking over my shoulder and staring at ","useful":1,"cool":0},"XKIiAW_XAnbDd4xG6RUzlg":{"text":"This tour was a highlight of our trip. Skip was a great guide!! I have worked in the trave","useful":0,"cool":0},"zFRAf9X_vXLwY9OMvutskA":{"text":"Fred our tour guide was amazing. He was very knowledgeable about the architectural part of","useful":0,"cool":0},"O8OMFfsnk1hv5Hz5lzSm1Q":{"text":"We took five tours while we were in New Orleans with several different tour companies. The","useful":0,"cool":0},"23hr4L5NDxsEqZ6Mupdm8w":{"text":"This was a great tour, and our guide was excellent. We did the witches, ghosts, vampire to","useful":1,"cool":1},"WFVbvapIJIGqYdd8P6lSDg":{"text":"Rose was such a great tour guide! She told us GREAT stories about New Orleans history, arc","useful":0,"cool":0},"QRvNVonxThNzpf8uH73fFQ":{"text":"Our tour guide was awesome! I feel very rude for forgetting his name he had short dark hai","useful":0,"cool":0},"vWPE26rgbEMZQVGbgFyxSQ":{"text":"TEAM CHRISTO ALL THE WAY! \n\n... I can't speak for the other guides, but Christo was very e","useful":0,"cool":0},"82cm8sUacTa1Q7j4VOQ9_g":{"text":"If you have a real interest in the occult or history, this may not be the tour for you.  I","useful":0,"cool":0},"0fz3UJXkWIqTd7byuW9lpg":{"text":"My husband and I took two tours in New Orleans with Witches Brew Tours. I would highly rec","useful":0,"cool":0},"HZuQ7SkKQ19hE8C9F1KgVQ":{"text":"Rose is a fantastic tour guide. We were lucky to have her for two of our tours while visit","useful":0,"cool":0},"PneRMs9nffwwIt8_kOv-Kg":{"text":"WARNING! DO NOT BUY!\n\nWe purchased a 50% off deal on Groupon for the aphrodisiac tour thin","useful":7,"cool":1},"sI4ERVMni6yrQSGRSguVZA":{"text":"This is my second visit to New Orleans and my group decided a walking tour was a good idea","useful":0,"cool":0},"LOpQOC7LL7OJjWKxBtTy-g":{"text":"We booked a tour for my bachelorette party. Our tour left before the scheduled time, so we","useful":6,"cool":0},"ABSLQvYLqMOJwYrqBAoObw":{"text":"We were Team Edward! He was awesome, very funny, loved his energy! The entire tour was gre","useful":0,"cool":1},"nQixTBdX9GftJQ9Bubtkfg":{"text":"One of the worst customer service experiences I have ever encountered!  We GROUPONED a tou","useful":0,"cool":0},"7FS66fwpruQIhVteTNJCWA":{"text":"We did two tours with Witches Brew Tours. The first was the 4 in 1 Witches, Ghosts, Vampir","useful":0,"cool":0},"-e8JlrKm09UNb8SbKHQxWw":{"text":"Went on the ghost hunting tour. Of course the emf devices are cheesy but fun. Several peop","useful":0,"cool":0},"TcTg5QjGKFpX6YAPcWQr7g":{"text":"I did the Ghosts, Voodoo and Vampire tour last night. Our tour guide, Josh, was amazing in","useful":0,"cool":0},"wIzDhfHCgKHKTGse2Wv1NA":{"text":"Our tour was great. We bought our tickets on Groupon. Trish was an awesome tour guide - ve","useful":0,"cool":0},"tJdXMxlYA2EygSA3wzCFvA":{"text":"Super interesting!! Our tour guide Sarah was so knowledgeable on local history. She was in","useful":0,"cool":0},"PQa2tYZP6EHHqvXWW8F8-Q":{"text":"October2015:\n\nI was able to attend 2 of their tours:  4 in 1 and 3 in 1\n\nWitches Brew 4-1:","useful":0,"cool":0},"ln8xUEfwnvLPlSf03xoN1Q":{"text":"We purchased the 4 in 1 tour through Groupon. The price was definitely affordable and the ","useful":0,"cool":0},"pzjB0Td-7aXhc6a7uSif5A":{"text":"My husband and I took a tour with Frank (AKA Tony) while on our visit to NOLA. We both agr","useful":0,"cool":0},"14mYj2X_g4bjQwwM11-cwA":{"text":"Took the cemetery tour with my friends. We all really enjoyed it, and probably mostly beca","useful":0,"cool":0},"I7zc2_e8hqjRk7YtPLFfig":{"text":"Purchased this walking tour on Groupon and was fairly excited to give it a try. I have to ","useful":0,"cool":0},"ty3kONEopLLxex_8WEjNaQ":{"text":"Andrew was an awesome tour guide, he was really passionate about all the historic ghost/wi","useful":2,"cool":2},"m27PRsr7hqcFVW-yNFAb7Q":{"text":"Last night we took the ghost, witch, vampire, and voodoo tour with our tour guide Bond. We","useful":0,"cool":0},"LcWrt3P73vO-GFTxuMSdaQ":{"text":"We got a Groupon for the 4 in 1 tour and our tour guide was Fred.  It was a fun tour and F","useful":0,"cool":0},"1wTi9Y5D2cRRQ-tOs7qudQ":{"text":"Totally sweet! We took the horror tour, expecting just a fun little experience, and it end","useful":0,"cool":0},"_lUpBuEC8Dua1NQQ1fWimA":{"text":"Our tour guide was OK, but uninspiring.  He told the stories, but he was not a storyteller","useful":0,"cool":0},"dSdhcHtirbzlv7CryLqaIw":{"text":"3 in 1 French Quarter, Cemetery & Voodoo Walking Tour\nWednesday, August 16 2017 @ 9:00am -","useful":0,"cool":0},"BZHxlNcdxY8qn1xwwlnDag":{"text":"Worst possible tour. Both, the person who checked us in and the tour guide were horrible. ","useful":0,"cool":0},"aLcKsviMijpImOtlVz2wMQ":{"text":"I did this tour (witches, voodoo, vampires, & ghosts) on a Saturday night at 8pm (April 23","useful":0,"cool":0},"MvzijH6REoRXTwl02uezEw":{"text":"Trish was a fantastic tour guide for our Cemetery Tour... incredibly knowledgeable and fun","useful":0,"cool":0},"lo4r-KFr_dnbYooJQi-QJA":{"text":"I did the witches , vampires, voodoo and ghosts tour which was very entertaining.  The gui","useful":0,"cool":0},"BFUxV5g6UXUTdm4Ckt6-JA":{"text":"We booked this through viator and really enjoyed this part of the trip. Carmel was our tou","useful":0,"cool":0},"7eDZ_vV-7o8YEJw0vTbY-g":{"text":"This tour was awesome. I got the tickets on groupon and it looks like a lot of others did ","useful":0,"cool":0},"083dCI_IFm8xF-i5hO3ecQ":{"text":"Well, this was just plain awful.  Purchased tour for 7 of us through Viator and then added","useful":0,"cool":0},"vIB5I96sIpefxJwkKcT_tw":{"text":"Just went on the ghost tour with Skip and he was amazing.  Despite that it was freezing an","useful":0,"cool":0},"tK5isJphZ-d0Njg0VddI9A":{"text":"Did the  4 in 1 tour that we bought through Groupon. Sarah Belle was our tour guide and sh","useful":1,"cool":0},"TgGmHAKvAPCnApQ8Na1ARg":{"text":"I did both the 3 in 1 and 4 in1 tours during my visit to NOLA. The price was great and it ","useful":0,"cool":0},"wPuTqNZipaUcWGiDadBIGg":{"text":"The guide seemed like a nice gal but she totally ditched us after telling us she would wai","useful":6,"cool":0},"dsfOG_ac30iSkBB_B0iDTQ":{"text":"Warning!! Do not go when it rains and if you do please be smart and bring an umbrella. Oth","useful":0,"cool":0},"FE-f4aaZL21hdVRc6qpufA":{"text":"This was a very fun tour. It lasted 2 hours and included a lot of walking. Wear comfortabl","useful":1,"cool":1},"OiWtrOVT2XLiA18D-AYEEw":{"text":"Highly recommend the Aphrodisiac tour if you are a couple!\n\nThe tour guide was amazing! We","useful":0,"cool":1},"KYUdl59nYkY1CfKPR9SF0g":{"text":"I purchased my Groupon online and was able to redeem/book easily on their website. I did t","useful":1,"cool":1},"ARNfWrjcfeojHuCCIJykEg":{"text":"Jeannie & Trish are awesome tour guides! Took a ghost tour with Jeannie & it was so much f","useful":1,"cool":1},"B4i82n4vGrbI-vaBR-PLtQ":{"text":"We went on the 4-in-1 tour, and had a great time! The tour was perfectly paced, it took us","useful":0,"cool":0},"u8xKnn4SBzCB4BfergAb9A":{"text":"We took the 3 in 1 tour with Bond and the 4 in 1 with Sarabelle. I am not much of a guided","useful":1,"cool":0},"1aUd2i3OoxMl_qW-X9jaww":{"text":"I went on the 3-in-1 tour today with tour guide Rose. She was incredible with her knowledg","useful":0,"cool":0},"KI9voLoMBvTgVqgxPZqUbg":{"text":"Rose was an amazing tour guide! She really brought the history of the French quarter to li","useful":0,"cool":0},"nfq88j5sRtzyrhCLAlUoKw":{"text":"I am the BIGGEST scaredy cat in the world so I'm surprised I even booked a tour. I figured","useful":3,"cool":1},"FQhnFALxhOH7pHBzOeECsQ":{"text":"Good tour. We began walking through the French Quarter towards St. Louis Cemetery No. 1. O","useful":0,"cool":0},"pWaXFlQCylDPr20I8ysccg":{"text":"Had a ghost tour with Frank. He was knowledgeable and personable. He kept us entertained a","useful":0,"cool":0},"tlI3R9nJj53WX9YbUcIhnw":{"text":"I bought this tour on Groupon. I used it January 23, 2015 along with my sister and her hus","useful":0,"cool":0},"KB1KhfAp0ZpizEYG47ymxw":{"text":"Frank is the man! He was passionate and knowledgeable about the scenery.  Would definitely","useful":0,"cool":0},"p-n76_h04DDnElUOUHprEA":{"text":"Andrew our guide was very animated which gave me this feeling that he was passionate and b","useful":0,"cool":0},"4-JNNGVDTLlFTrxN18fCJQ":{"text":"Very disappointed! We had reservations for 8 people and prepaid. They overbooked the tour ","useful":3,"cool":0},"yh5oT_gA93ndlFGyxrKRNA":{"text":"This was a very informative tour. The tour guide, Doc was extremely knowledgeable and answ","useful":2,"cool":1},"DHxkSjCVQ9NJ77l597xtQg":{"text":"our tour guide \"fred\" was knowledgeable and friendly. We had a good time and would like to","useful":0,"cool":0},"Hwq4beHfDqWJPk64VC-ALQ":{"text":"We visited from out of town. We did the 3 in 1 tour. This is a walking tour so take water ","useful":0,"cool":0},"IzkYbZTUWml6qZ73hxWqIQ":{"text":"Scott was awesome! Good story teller  on such a cold night that kept us engaged! He gave y","useful":1,"cool":0},"yGwziFlIVD859gwp742Bng":{"text":"We did the cemetery tour and the aphrodisiac tour. Trish was our guide for both and she wa","useful":0,"cool":0},"8ISfPdgBL_VNefMT3ISkqw":{"text":"We ended up on this tour, Witches Brew 4-in-1 tour by randomly picking one of the many hau","useful":1,"cool":1},"pgBlJkWQS7x3vNUO2x6F5Q":{"text":"October 11 I scheduled the witches brew tour it was the 8 PM tour and I had hoped I'd miss","useful":1,"cool":0},"VWLehB8h1CCMlxdQDO8D1A":{"text":"Wonderful tour!!! Graham was an incredible tour guide. We loved all the stories he shared ","useful":0,"cool":0},"aSVf6BsSTDc1M0o_JP3UYA":{"text":"Ryan was our tour guide tonight and was absolutely fantastic! Great stories told by an exc","useful":0,"cool":0},"-6AdJF7Qj1ZmWsTZCm3rKg":{"text":"Great tour! Frank was our guide, and talk about knowledgable! He was incredible! If you ar","useful":0,"cool":0},"2wl3EcUWeW4EcSLvfMUCrw":{"text":"Took the 4 in 1 with Trish. I adored her storytelling. She's so funny! Check groupon for d","useful":1,"cool":0},"cHKQps5EScorILSSu7QRow":{"text":"In the first hour we covered three topics: a modern day tale of a murder involving PTSD, h","useful":0,"cool":0},"a9OPomUj1_lB2T4o_78jRw":{"text":"I took my time researching which haunted tour to go on during my NOLA trip. Since there ar","useful":4,"cool":1},"NRbS0oEQaFvbUG6H70jseA":{"text":"Our  tour guide was Edward. His recounting of New Orleans history was enthusiastic and enj","useful":0,"cool":0},"oVrwiRV8do-oyeS2Y9_pWQ":{"text":"This tour was so much fun. My wife and I really enjoyed our tour guide and his enthusiasm ","useful":1,"cool":0},"-vMrfrSSek9sSycyD1LkLw":{"text":"We took the 3-1 Cemetary, Voodoo and history tour.  The tour guide was nice, but none of u","useful":0,"cool":0},"JCA95Jtp3xDMY0ZUz7FQNg":{"text":"Booked a tour with groupon. What a good time we had, lots to see and hear about. About hal","useful":0,"cool":0},"YtFbW0AgrS7nKvl9cLDnRA":{"text":"I got a Groupon and tried scheduling it the same day, but the lady on the phone said we ha","useful":0,"cool":0},"F5WzgkUZidtvWt3Ht927wA":{"text":"-I had called Witch Brew Tour Company and made arrangements for a tour. Same time, I reque","useful":0,"cool":0},"znDWGjPD7GerNwzF7Ix8-g":{"text":"Had an excellent experience with Skip tonight on our tour! I would highly suggest the ghos","useful":0,"cool":0},"4EpMNDt1APno6glZTSHpAg":{"text":"Price on the Groupon was great!  The tour was fun with lots of interesting stories.  It wa","useful":5,"cool":0},"CaHCBub2BnBvy82nLxm4XQ":{"text":"Traveling with three friends from work and decided to take the tour, got to see a ton, goo","useful":0,"cool":0},"iW_DAfUvcM93ZTgmkfxBvQ":{"text":"This tour is a hoax. They just want to take your money. Half of our group on the tour left","useful":5,"cool":0},"-w4WyHE0qLCCACz7-OzaeQ":{"text":"My friend and I made attempts to order tickets for the 3-1 tour. We decided to purchase ou","useful":0,"cool":0},"boOP7zcA0iEMkSfB8t0W8Q":{"text":"We went on the 3 in 1 tour which I was super excited about and looking forward to. We had ","useful":0,"cool":0},"NQf-gyX4Eta6pt_BPRFwxQ":{"text":"I thoroughy enjoyed the tour. I took the 4 in 1 tour on 03/19 and my tour guide was Edward","useful":0,"cool":0},"dHEED8xhgLJe64xS8FCwAw":{"text":"This was a great tour, our guide Andy was so knowledgable and funny he was great. He wore ","useful":1,"cool":0},"edxNN5ncBu1UVP5PhOvikQ":{"text":"I Love Witches Brew Tours. My first trip to NOLA back in 2013 I did one of the night tours","useful":0,"cool":0},"im61kNzXM1sRsORExlfgbg":{"text":"I went on the 4 in 1 tour which included ghosts/vampire/witches and voodoo. Had an amazing","useful":3,"cool":1},"K2HVfD9beiAhA5PdFWhgbg":{"text":"The tour guide was on his cell phone off and on the entire tour. As a plus, he took us out","useful":6,"cool":0},"HgzPg7FSTX8MkF_ZiYiVDQ":{"text":"This was a wonderful tour and Scott was our tour guide. He was funny, knowledgeable and ga","useful":0,"cool":1},"725zG_3mDz9zsvCI1nRi7Q":{"text":"I highly recommend witches brew tours... I researched a few places before our weekend trip","useful":0,"cool":0},"kOL9W1xvirk1DNIRe79YaQ":{"text":"I was a little annoyed to start because the company requires 48 hours notice to book the t","useful":7,"cool":1},"WISGda9Mb4IDWWOJxKIlrA":{"text":"Where do I start? \nThe tour was amazing. I've been living in this city my entire life, and","useful":0,"cool":0},"qRPbnwEKB0s6VbgeUtm7Jw":{"text":"Participated in the French Quarter tour with Graham and enjoyed it for the most part. The ","useful":0,"cool":0},"bSjjFikN_3EdkmyducnLJw":{"text":"It's our first time being in New Orleans. We're so glad to have booked this tour. Rose was","useful":0,"cool":0},"MnItmnQHvPKZYQPJjSQhKA":{"text":"This was a good experience. I bought the groupon 2 for $25. I think the tour was definitel","useful":0,"cool":0},"fb79hRetdZqbjuOhOAYshw":{"text":"Did the 4-1 walking tour. It was interesting but not what we expected. I had been on a vam","useful":1,"cool":0},"E9FcH0deQJ0oYFZPEE232g":{"text":"Ryan was amazing!  Super knowledgeable about all things New Orleans. You can tell that he ","useful":0,"cool":0},"EEcLHHxE2UnI7sJoPGT7jQ":{"text":"We very much enjoyed Stormy as our tour guide. He was informative and informational mixed ","useful":0,"cool":0},"RjtdAt_WwYOvWkWU2ufxzQ":{"text":"My friend and I went on the Cemetery tour. Our Tour guide was awesome. I didn't mind the w","useful":0,"cool":0},"CXMsbs0dmbMycspgZTItsg":{"text":"The tour guide was great, had a good solid knowledge of history and events in NOLA. The ce","useful":0,"cool":0},"i1tVHyFZCl5MvOeH3gvoxw":{"text":"Bond was our guide and she did an awesome job. We got a groupon and did the 4 in 1 tour. V","useful":0,"cool":0},"APUY65ViWOZFBkAzyQEYgQ":{"text":"We got the Groupon for the 3-1 cemetery tour so the tour was definitely a deal. Guide knew","useful":0,"cool":0},"2oEW0Wf9AnWZdoUooj6Hjw":{"text":"On the tour now and as obvious Im writing as walking because I'm so disappointed. Did this","useful":1,"cool":1},"W0m7LyzJKOtnH5n4nm4kqg":{"text":"Got this tour on a Groupon and overall enjoyed it.  I've been on previous walking tours in","useful":0,"cool":0},"yvxDS-Mcl4PRNXvg03BWCA":{"text":"Our guide Sarah Belle passed many locations without any mention, (Sultans palace, St Louis","useful":1,"cool":0},"BXD6SPptR54-dsqcM1_vlw":{"text":"I found a groupon for this tour which made it a pretty good deal. If I had paid retail, I ","useful":2,"cool":0},"52pV3YTiFP_hzJsVIdwyXw":{"text":"We did the voodoo cemetery tour and loved it. I tour guide Trish was the best. We learned ","useful":0,"cool":0},"F-A5dayNPc9lfxL_uyR8Cg":{"text":"Nate scoty did an amazing job and.very informative!!! Would recommend to anyone.visiting n","useful":0,"cool":0},"9q-tRtrAGRoUJ_1YAQJvBA":{"text":"Our tour guide Ryan was excellent, and the tour itself was informative, entertaining, and ","useful":0,"cool":0},"mXqxPOFfHDFKrHQ5ifsV9Q":{"text":"We went on the 4N1 tour. This tour was very entertaining. Our tour guide Doug was a wonder","useful":0,"cool":0},"jVR5Srhkm5SWrcN4cl3bqQ":{"text":"Our tour was the Cemetery Tour with Fred. He was very knowledgeable and willing to go the ","useful":0,"cool":0},"iPOh5Kdf63wcrV1vTU95Uw":{"text":"Actually a lot of fun. Our tour guide, Professor Trelawney, did a great job. Matter-of-fac","useful":0,"cool":0},"kznun714_xnXCZzQxm47Og":{"text":"I would give no star if possible. Not professional at all. I left middle of the tour becau","useful":1,"cool":0},"vU12gqGX-wE56H97Kyaqbw":{"text":"Tour was awesome, have done others in the past, but this was the most informative. He even","useful":1,"cool":0},"JtjydLdhDBpbfOjr7e_kQQ":{"text":"Super friendly staff, accommodated me on same day and gave me a discount when I couldn't u","useful":0,"cool":0},"F3vnqczYecAwH5vCk9cGKA":{"text":"Thank you Fred, we had a great time.  Love that you're passionate about Preservation.","useful":0,"cool":0},"_JvSfJtuMoQA448oaPqOeQ":{"text":"This is basically a short walking tour past some of the main haunts in the French Quarter ","useful":0,"cool":0},"jr1zCWVbUwR1x915-fIR0w":{"text":"We did the 3 in 1 tour with Skip and it was a great time. He was very funny, knowledgable ","useful":0,"cool":0},"jYtcDWtGZs17vBZRPX6Kig":{"text":"Christo (billy) was the absolute best. Informative, entertaining, and knowledgeable. Fanta","useful":0,"cool":0},"Fr4hCJM6LktWGxjMcv08yQ":{"text":"This tour was so great and informative and fun! Jenine was our guide and she was super per","useful":0,"cool":0},"jzfKS_YhM4P9AeMF3YpySQ":{"text":"We had bought the groupon but ended up cancelling because we didn't book early enough. So ","useful":0,"cool":0},"lwnylSYa2QjNmfPkEC1IpQ":{"text":"Witches Brew in New Orleans was great! They started on time, after an easy check in proces","useful":0,"cool":0},"qteup_OnFl7eq6BskrxJCg":{"text":"John Frederick (our Guide) did a terrific job of presenting the stories of the darker and ","useful":1,"cool":1},"F2u3blPfd-MgVeQOkSwv3g":{"text":"We met at the corner of Conti and Royal for our tour, and Ryan was our guide. We walked a ","useful":0,"cool":0},"3fqEpQnsoJ8A2uQbAlUA2Q":{"text":"Edward was such an incredible tour guide. He was animated and knowledgeable. He clearly lo","useful":0,"cool":0},"b8zbAUjZrom30UBOH22-5A":{"text":"Great tour with Sara Bell!!! She was really enthusiastic and fun to spend the two hours wi","useful":0,"cool":0},"rzSPCwnGoXxyrRx_1Ik21Q":{"text":"Admittedly it was his 3rd tour of the day, but our tour guide Frank simply didn't want to ","useful":3,"cool":0},"mZVQ5UZWS2d9GMvhlW08qQ":{"text":"The tour was very interesting and left you wanting more. Our tour guide, Edward was amazin","useful":0,"cool":0},"CKObhnEiGTserX5MDaI8_A":{"text":"We did the tour of cemetery no 1. The guide was great! She pointed out architecture on the","useful":0,"cool":0},"efjU84sj-eaK_pJAovd8bA":{"text":"We did the 3 in 1 tour that we purchased on Groupon - it was worth $10 but I wouldn't have","useful":0,"cool":0},"0sGKWolNNbmhYwGUGRe0uw":{"text":"Went on the 4-in-1 tour with Doc on Saturday at 5 pm and it was a great experience for our","useful":0,"cool":0},"zqEOFXAqNg4-50b607Rwkg":{"text":"Frank was an exceptional guide. Very good story teller, well informed, personable. Great H","useful":0,"cool":0},"xG-rKSAuhYey3mTp1oXBZw":{"text":"We did the 4-in-1 tour, and I enjoyed every minute of it!! I do not remember our guide's n","useful":1,"cool":1},"5UfI51VYRv7oZn94itPdEQ":{"text":"Highly recommend, booked through groupon, called and booked that day. Our guide Barry was ","useful":1,"cool":1},"QIXobCfEnQQzyVok2x9tvA":{"text":"I felt the tour was very informative and just the right amount of walking. You learn so mu","useful":0,"cool":0},"2Pivi22FupEqYcwThRA0yQ":{"text":"Went on the 8PM 4 in 1 tour that met at the Courthouse.  It was long, it was hot & it was ","useful":0,"cool":0},"Tu4KL7un67tp2F0uM6dwEQ":{"text":"I did this tour with 3 other friends and all of us were EXTREMELY disappointed. We purchas","useful":0,"cool":0},"kk4JBOmK53KoFqL7tRYNcA":{"text":"Did this tour with 7 girls for a birthday trip- spent most of the day on Bourbon st but th","useful":0,"cool":0},"fkPgjqtbwX0Gwck0wsUf8A":{"text":"Alyssa was our guide on this awesome tour! It's not hokey at all! Based on historical even","useful":0,"cool":0},"KnwPKjIfgS1ws_SyMlDw3w":{"text":"I'm very glad we took advantage of their groupon deal, the tickets were a great price and ","useful":0,"cool":0},"e2ZOFiKUhpHcWsA_ZgUTnA":{"text":"If you end up buying a Groupon you need to make a reservation 24 hours in advance before y","useful":0,"cool":0},"--GmHV8ohaTSUj9vrsrO_g":{"text":"Trish was an AMAZING tour guide!! Knowledgeable. So much that I learned while visiting fir","useful":0,"cool":0},"EaBky7co5lWZs23Cgi8F2g":{"text":"I truly hate to give bad reviews so it takes a lot for me to do this. I will also say that","useful":2,"cool":0},"0R6YU3fYQlJtOHH68ySIdw":{"text":"Boyfriend booked us trip to NOLA and had bought a Groupon for this tour company. I love gh","useful":0,"cool":0},"82teccIsEoDq6E9XMfTBoQ":{"text":"Trish was over the top! We really enjoyed hearing about the her city.\nThe tour through the","useful":0,"cool":0},"swSKTJnd7kRNtmd0CY7-zQ":{"text":"This tour was the last hooray of my 10 day trip to New Orleans from Washington state! I mu","useful":1,"cool":0},"In6KsId86Oj8AIEhZ0MR4A":{"text":"Trish our tour guide got really into the stories and it made it so much more exciting beca","useful":1,"cool":0},"1SxtxtsufgZSY-aHv0c0Jg":{"text":"Marta was an amazing tour guide who really goes above and beyond! Loved her dark sense of ","useful":1,"cool":0},"pNIuoOY4e-o4xbWnBlONIw":{"text":"I was disappointed in the Aphrodisiac Tour. It was my bachelorette party and the very new ","useful":4,"cool":0},"PXtyBSUZy-0nKI793fNLZg":{"text":"Did the 4-in-1 tour. Had Frank as our tour guide. He was awesome! We learned so much and h","useful":0,"cool":0},"hoSz2z1VeIvrZPvMixExIA":{"text":"Went on the Cemetery Tour and had a blast! Mary Lynn was charismatic and knowledgeable. Sh","useful":0,"cool":0},"Y2hef_QzgW-N4gMfE3U3zw":{"text":"My husband and I went on the 4 in 1 witches, voodoo, vampires, and walking tour. We really","useful":0,"cool":0},"ZRwOEuqlBBs0MIN7WCK7jQ":{"text":"Skip was a fantastic tour guide! We booked the 3-in-1 French Quarter, Voodoo and Cemetery ","useful":0,"cool":0},"xBnvP2pZ5oHOIfDYTI919w":{"text":"This would have been a 2... maybe 3 star review, but the owner seems to harass people that","useful":1,"cool":0},"TBWusaA2LNCL63kprQJzLg":{"text":"This was the biggest waste of two hours ever. Totally lame. The guy who gave our tour -- B","useful":3,"cool":0},"Z-dXiD8akJHsSW0VpKCqAQ":{"text":"Wonderful!!!!!!!! We took the Haunted French Quarter tour and loved it. Our guide was so i","useful":0,"cool":0},"yXDOaznNQycv1Xa9l4j6DQ":{"text":"I highly recommend Doc on the 4in1 Witches Brew Tour.  His tales were full of history and ","useful":1,"cool":0},"8XC-icq1nYApCUWOrPm5_w":{"text":"We went on both the French Quarter/St. Louis Cemetery #1/Voodoo tour and the Witches/Vampi","useful":0,"cool":0},"7kAdjrzKrPJ_cA7YzV-7Yg":{"text":"Horrible tour with too many people. We left before the half way point. Don't waste your mo","useful":2,"cool":0},"SJRQLtxWftgezHuWImZymw":{"text":"After reading the reviews of this tour and all of the other tours in New Orleans, I was ex","useful":1,"cool":0},"M0kR2WHAsjWyA1Qzw5kWzg":{"text":"We did the 4-in-1 Walking tour with the Johnny Depp Pirate Guide. The tour was fun! We lea","useful":1,"cool":0},"BRIsjFr-aZxeLFpttsAp9Q":{"text":"My friends and I booked the 4-in-1 Witches, Ghosts, Vampires & Voodoo Walking Tour via Gro","useful":0,"cool":0},"HlkUGwo1eaJJ54Q-1nqP-g":{"text":"Not what I expected.. Way too much talking from the guide. You would stand next to an buil","useful":3,"cool":0},"_NnVlIy1a1p0mvUZ1NfkRQ":{"text":"Rose was awesome! She was knowledgeable, friendly, animated, and had great comedic timing!","useful":0,"cool":0},"bTnONVK4-zkmvgnujF3MfA":{"text":"Jeanine (sp?) was the BEST!! Super knowledgeable, answered all questions off the cuff and ","useful":0,"cool":0},"or9mJGO8u9J_R7fNmJszTg":{"text":"This was a really informative, well-planned tour!  Our Guide, Graham, knew everything and ","useful":0,"cool":0},"PQWt0tBCIcOw9jOq-1IfNA":{"text":"Trisha was a great tour guide. She was funny and very knowledgable. Would definitely use t","useful":1,"cool":0},"5d89aH8pSx1xam-NfZTl1A":{"text":"Rose was our tour guide. She was wonderful, an excellent story teller...she weaved the mag","useful":0,"cool":0},"ugq3_k5IgvvAk1wlKdlU_g":{"text":"We took the tour Saturday.  We had a great time.  Graham was an awesome guide.  He was ver","useful":0,"cool":0},"ZlzmFrs-NGkpPfAXnfgx6w":{"text":"If you would like a pleasant customer service experience, do not use this company. After f","useful":2,"cool":0},"TNEIZJud0TfjhUKVksYLUA":{"text":"My husband & I went on the 4-in-1 tour.  First let me say that the group we were in was wa","useful":0,"cool":0},"1THzUJ2uepr-xs3hOvoVww":{"text":"Michael did a great job, very informative. Walked away with lots of knowledge about the hi","useful":0,"cool":0},"zLPonF8fGO9Lz1polU2mCA":{"text":"Sarah was absolutely amazing with knowing her history. She kept the entire group engaged w","useful":1,"cool":0},"dPmvvM2NXvP3N_u375izyw":{"text":"Cemetery tour with Rose will leave you in love with this city!  Our group thought we were ","useful":0,"cool":0},"TlmLcdcXO5kyOw3AGzvEWA":{"text":"Great tour!!! We took the 3 in 1 walking tour since there was a misunderstanding. Spoke to","useful":0,"cool":0},"uI32kIGxmJuJ_bTGX25XCQ":{"text":"The tour itself could of been better.  Our group of 6 went on the 8pm tour.  The check-in ","useful":0,"cool":0},"ATEopjVJHKzKAsBSbnqvJQ":{"text":"I bought a last-minute \"living social\" deal and went on this tour with Denise.  She was gr","useful":2,"cool":2},"RvXChvB4Qa-bJkMF8a5c_A":{"text":"This tour was okay. Our guide was very knowledgeable and friendly. we went through the Fre","useful":1,"cool":0},"8IK2rajXbfIC-Qa2Q3e13w":{"text":"I toke two tours with them yesterday and I had a great time.  \nThe first was the cemetery ","useful":0,"cool":1},"3wPGtXVx-WRw_bTeU8RdIw":{"text":"N'Walins Nate is amazing!! He knows his stuff, makes you feel welcomed and is funny. Had a","useful":0,"cool":0},"VSoQgFWH13GmKQdCdRPURA":{"text":"My experience started the night of our tour while booking. The woman on the phone was incr","useful":1,"cool":1},"uftR7NXRxo3puPd89YJy8Q":{"text":"If you want to be a tourist, and you have nothing better to do, grab that Groupon yo. They","useful":0,"cool":0},"GifY0Fe6A72hdSTbWyXYwg":{"text":"Mary Lyn was an amazing tour guide. She pointed or more then I was expecting. \nWe booked b","useful":0,"cool":1},"Be3_NtYMnFr9CpzGi8HXAg":{"text":"Today was my birthday and my husband took me on a tour guided by Marylin. She was very kno","useful":0,"cool":0},"9BAP4dnQ2bRBqIvaB8vGGg":{"text":"It was my first time to New Orleans and I, being the curious person I am, decided that it ","useful":0,"cool":0},"ljPj-HsBoJVPNko8rPzk9A":{"text":"My husband and I did the ghost tour on our short trip to New Orleans. We ended up having E","useful":0,"cool":0},"TjglTopTI5DSdOIzKMqlVA":{"text":"Awesome tour with Christo! Super energetic and great stories! Got a nice tour around the F","useful":0,"cool":0},"aZuwDFz-Rdesx6CnsgM2Uw":{"text":"Just a warning, if you book with groupon, you'll have to wait 24 hours. My friend and I we","useful":2,"cool":1},"qWcXMq5YHOly6p-jRN82jQ":{"text":"We were very happy with our ghost tour. It did scare me to the point that I had a hard tim","useful":0,"cool":0},"jQ7HAY-9OPCp8mPUYY85Gg":{"text":"This tour was not what I thought it would be, there was no scare factor except the drunk w","useful":1,"cool":0},"4OxojKrdK5LsB66Bl3tz1g":{"text":"Stormy was awesome me and my fiancé had a wonderful and informative time on his tour!","useful":0,"cool":0},"iL_gIRLiU9iZHKIoGrKfSw":{"text":"We did the cemetery, voodoo, 3-1 walking tour with Marilyn, she was great, very knowledgea","useful":0,"cool":0},"vktSYPAAcr3Y6hW8Zki2tA":{"text":"My party and I have just returned from a visit to Savannah, and we went on a similar tour.","useful":1,"cool":1},"nIL3QDlWEMOO8TMCcRg4uw":{"text":"I took the wife and out teenage boys on the tour and we had a blast.  Andy was our tour gu","useful":0,"cool":0},"ZUbwwwqmS69rucMSfnW5cg":{"text":"Took two tours with this company while visiting New Orleans: the Ghost, Voodoo, and Vampir","useful":0,"cool":1},"txqjx4iMo9o8L9etk2EAJA":{"text":"Rose was our  guide and she was awesome. The stories are fun and creepy, shew took us to m","useful":0,"cool":0},"ZullpWIXb3pdL2aBx5Mmgg":{"text":"BEST TOURS EVER!!! Rose was amazing!!! I went on the 3-1 cemetery tour and 4-1 Witches, Gh","useful":0,"cool":0},"cLAwJERg8aSP8UrSBEyCyw":{"text":"Our tour guide Scott was awesome! He had great stories and even scared the crap out of me ","useful":1,"cool":1},"7adNUvvNC58qL12PZSXwUQ":{"text":"We had an amazing tour with Josh on Sunday night! It was so hot outside but the tour made ","useful":0,"cool":0},"_ngRETCcXUDb3_78U-KIXw":{"text":"I would like to update that I was very surprised that the owner immediately contacted me a","useful":1,"cool":0},"4SMgc6pxvytVuyZazG4-Eg":{"text":"Loved this tour.   Robby Rob was the best guide.   Just be ready to walk!  Would definitel","useful":1,"cool":0},"VZMCW76Xe21wTr9ok4nBnQ":{"text":"We did the voodoo and cemetery tour. We loved it! Mary Lin was an awesome tour guide!  She","useful":0,"cool":0},"76WB1M_GIqDA9MUcjrFKHg":{"text":"This was a GREAT TOUR, I can't think of a better way to learn more about NOLA. I did the 3","useful":0,"cool":0},"ZzyKsFy9Y20axACu_Twn6Q":{"text":"My kids (12 & 13) and I took the 3 in 1 French Quarter, Cemetery & Voodoo Walking Tour. It","useful":0,"cool":0},"S8Kyy7cgYUl_OXvFgMyzOg":{"text":"We took the walking tour to learn about the New Orlean's History. There were 4 in our part","useful":0,"cool":0},"xv8q549gx2-2QFs5f26t2A":{"text":"It was easy to book over the phone after purchasing the Groupon. \n\nWe showed up a little b","useful":0,"cool":0},"ACXfK3kLN9KRkm3dF9IhuA":{"text":"Wendy was very delightful and knowledgable. We enjoyed ourselves. Thank u! Even tho it rai","useful":1,"cool":0},"_p8UDoeSzNagf9PFx-68wg":{"text":"We made a spur-of-the-moment decision to do the Witches Brew Tour around the French Quarte","useful":0,"cool":0},"JOl05WMhBMR-6LdOVOAUKg":{"text":"This was a wonderful tour. Our tour guide, Christo, was a great storyteller. He gave a lot","useful":0,"cool":0},"s9AmTaCXsqWJkBJHCJDliw":{"text":"The tour guide Cindie was really not good at all.  She randomly paused halfway between sen","useful":2,"cool":0},"orCsYMsE_raKiYMjqGEAtg":{"text":"went on the tour with Chis was very knowledgable true love of nola history felt bad for th","useful":0,"cool":0},"dkGRxO-EakhM199nGaHJ_A":{"text":"Sara was our tour guide for cemetery and Voodoo walk. Despite it being a hot walk under th","useful":0,"cool":0},"BfMgqdRwCCJopkcJMdIBhQ":{"text":"Did the 4-in-1 Ghost Tours, Voodoo, Vampires and Witchcraft Ghost Walking Tour with Ryan a","useful":0,"cool":0},"NR-9skr3MaKShGVi0ykwGw":{"text":"Tour was great! Had Skip as a tour guide and the trip was very informative and funny. If y","useful":0,"cool":0},"PY-ShC9BHFeeJfOVQVe5Xw":{"text":"Josh was the most amazing tour guide. So knowledge and fun! I enjoyed his humor and the wa","useful":0,"cool":0},"3upQyY-i3T5L5BJBPXLlRA":{"text":"2.5. We did the 4 in 1 off groupon forty something for four. Worth the price but prob woul","useful":3,"cool":1},"wOD59aveD5gr-j7bgJba0w":{"text":"RE: Risha R 1 Star Review \nSince you had your tickets for the tour for weeks like you stat","useful":0,"cool":0},"dvkr-JebPdAl8Nf1dGqVuw":{"text":"The ghosts, voodoo and vampire tour with Kristos was amazing! He was so knowledgeable and ","useful":0,"cool":0},"n-74ZfSiEk1L5mQMe_dlQA":{"text":"I enjoyed both  ghost tour and cemetery voodoo tours.  My kids had fun,  they stop halfway","useful":0,"cool":0},"gAKw3flt7hFQ01J4srFDmA":{"text":"Scott! Was great! We did the Vampires, Ghosts, Voodoo, and Witches tour and he was beyond ","useful":0,"cool":0},"-q9HnWG518zeP-gN57aU5g":{"text":"Witches Brew Tours is a \"have to\" when going to New Orleans. Educational, fun, and a walk ","useful":0,"cool":0},"M-oFYByRbyYF6EF_dxZEqg":{"text":"Rose was fantastic.. she had a great attitude as she led us thru an awesome tour in the po","useful":0,"cool":0},"xi2YLGKU_PZ89UMNKgWrXw":{"text":"The tour was great! Our tour guide Fred was very informative. However, the booking lady we","useful":0,"cool":0},"1NLG7M1rKAU1RCepbHxUuw":{"text":"Edit: I am updating my review from 2 stars to 3 because the owner of the company immediate","useful":2,"cool":0},"q4PszhfULx-gmxHDjlfaww":{"text":"Too bad they don't have ZERO stars because this is what this company deserves. My sister w","useful":1,"cool":0},"TVubc8igv91pVW04Z5PAhQ":{"text":"We had fun and it was interesting to hear about the history of the French quarter !  Guide","useful":0,"cool":0},"RtImkG6vGZ5RI8rZgaS0zw":{"text":"We did the Voodoo tour today and we loved Sarah, she was in knowledgeable and engaging.  Y","useful":0,"cool":0},"PBgQ08_NZ-3hyWumE6PyKg":{"text":"Andy was such an awesome tour guide. The tour was very informative and lots of fun! Not sc","useful":0,"cool":0},"3QDS1ImAPE9nyWhn_wSCXA":{"text":"We went on a tour with Christo and he did a great job! He was a great storyteller and did ","useful":0,"cool":0},"CPAtcbF3hdvn7TugKfE51Q":{"text":"I'm in town for my birthday visiting New Orleans for the first time and I found this compa","useful":0,"cool":0},"A6mMcWjCmXCe4sEl-9FANA":{"text":"Cristoph is an amazing tour guide! This tour is by far the best in NOLA! We had a group of","useful":0,"cool":0},"Ssb4HA9k19h0bq5jQV5Zcg":{"text":"Great tour!  Our guide Vernon was hilarious. He kept everyone interested, personalized the","useful":0,"cool":0},"Ju3WESEgWN4TPgpiQ1R64Q":{"text":"I purchased this through Groupon and thought that it would be a pretty neat experience sin","useful":0,"cool":0},"4O-584pJFPHom8qGWcYvwg":{"text":"Absolutely my choice for walking tours in NOLA!  Have booked with them 2 years in a row no","useful":0,"cool":0},"_yrv6jHU_bR2X1pjJpy6rg":{"text":"Fantastic tour! Great stories mixed with real history. Entertaining and fun\nRyan was a gre","useful":0,"cool":0},"dE0cwa4QhOf7aGabTrsgTw":{"text":"Ryan was amazing ! Loved the tour and he made it fun and told us a lot of neat info !","useful":0,"cool":0},"kiHYO19SKYuQycaskm5myA":{"text":"My wife and I did the St. Louis 1 cemetery tour. We had Bond as our tour guide. She was fa","useful":0,"cool":0},"f00zmuEjSPI47xDfrASE7w":{"text":"Our tour guy was very informative and funny. I highly recommend Justin he was the best!","useful":0,"cool":0},"9thvxtuxZimc5N8p2VZliQ":{"text":"We had Michael Bill as our tour guide and it was SO fun. He was hilarious and knew so much","useful":0,"cool":0},"TdpRoeWXkRK3hwwnkr4HuQ":{"text":"Our tour guide was awesome! i'm sorry i forgot your name though (he wore a black top hat!)","useful":1,"cool":1},"ggoiEVMy33NFPssd5HleEQ":{"text":"This tour was so much fun and our tour guide Robby Rob was very informative and kind! I de","useful":0,"cool":0},"zVlR8hCrvrHhRPhVjrko0A":{"text":"When my parents went to New Orleans they went on a cemetery tour and raved about how great","useful":0,"cool":0},"gcMmdtOvBkO8noz0UK4KiQ":{"text":"Went with my cousin and we both enjoyed a history tour of the French Quarter and the voodo","useful":0,"cool":0},"dnEQHnjlo5iNT8YMXpSJuQ":{"text":"In New Orleans for the first time from Los Angeles. Went on this tour because of a rec fro","useful":0,"cool":0},"p-HLYnh5-7968fHUmjdb-g":{"text":"EXCELLENT. Tour guide was Josh, who was personable, professional, and VERY entertaining! H","useful":0,"cool":0},"qcxiKF3kzhCgXZ01shYZPA":{"text":"Christo was amazing! You could tell he went to great lengths to do proper research into al","useful":0,"cool":0},"KyUmdqfYkzln-mQRZN4ulA":{"text":"My husband and I went on a witches brew tour and it was great. Gram was our tour guide and","useful":0,"cool":0},"R3J-yEWPYTBOPgaMOv0_Fg":{"text":"I came back and did another tour here....this time we had wendy and she was fantastic! Ver","useful":0,"cool":0},"OpzPvI5CgAQTwtsWPhnw7A":{"text":"Excellent Tour Guide Janine that was very funny and taught us so much! \nVery Impressed . T","useful":0,"cool":0},"fIqWN-psrK18-7919yA6fg":{"text":"We took the 3 in 1 tour to the St. Louis #1 cemetery last week. Marta, our guide was funny","useful":0,"cool":0},"imfpODxc6jnRGeBLAawqmw":{"text":"BEWARE!! This is a major scam. I wanted the carriage tour. After clicking on it - it lead ","useful":2,"cool":0},"Cn3Bqc7yuDo54ogJQT5mMg":{"text":"Went last night on a Ghosts, Vampires, and Voodoo tour. Guide, Mary Ellen, was incredibly ","useful":0,"cool":0},"TczPHDW3TumF6OIfuMFhoA":{"text":"I did the four in one tour (all about ghosts, witches, vampires & voodoo) with DENISE and ","useful":0,"cool":0},"wiEOe2rRUmzEbNtdI76jng":{"text":"We were in NO 2 weeks ago and did this tour. Our tour guide, Christo, was an excellent sto","useful":0,"cool":0},"Lq3rP50dP_oQLrHqx7fICg":{"text":"Bond was a wonderful and knowledgeable guide. She was really interesting. Would recommend ","useful":0,"cool":0},"N6LquCYJfRPylJRjM3a_pg":{"text":"Had the privilege to go on a tour with Bond today. She was incredible. Made the tour fun, ","useful":0,"cool":0},"G-LAp88ZT2E5czrlI6N6Ng":{"text":"The first time I did this tour was in January after spotting the deal on Groupon during an","useful":4,"cool":0},"dG-1x6JdCxQNAtV012QSXQ":{"text":"The best tour in New Orleans! Edward was super informative and amazing at giving us a tour","useful":0,"cool":0},"jH4B5VQeyF-3f10d3r2Pug":{"text":"Everyone that I spoke with about going to New Orleans said that doing a walking tour was a","useful":0,"cool":0},"VtHjiFNWLsLJnTwqsDf0Gg":{"text":"Edward was absolutely amazing. He's a super charismatic guy who was really funny, knowledg","useful":0,"cool":0},"cPnGdauFPFN4Tf1lgcuG2g":{"text":"Myself and our whole group really enjoyed this tour. Our tour guide was Trish and she was ","useful":0,"cool":0},"dhWjfk3pcdYjAeMtB75YOQ":{"text":"I have been on this ghost tour twice, both times were equally enjoyable. All tour guides a","useful":0,"cool":1},"7LtvLUHP9ByJ6a6n4ndqtg":{"text":"We loved this tour!  We had a great tour guide, Crystal (spelling?).  He was really wonder","useful":0,"cool":0},"BoPAlf_00lYAAbTzgv8WmA":{"text":"The best history lesson I've ever had! Are your guide Wendy was the best!! It's a must you","useful":1,"cool":0},"v1IFLFDaFL1vN89BkUvLaA":{"text":"I had the worse experience ever with this company! Please see pics. \nThe person who answer","useful":1,"cool":0},"tXqijk1FjF4GMufIMAGHxw":{"text":"Well overdue review! My boyfriend and I were in New Orleans in June - super hot and humid ","useful":1,"cool":0},"qMhYbA6F6pRvzPABPmjIZA":{"text":"My 4-n-1 Witches, Ghosts, Vampires & Walking Tour was led by Ed who was factual with flour","useful":0,"cool":0},"pSrY9gwd1IyYW84u5qUmFg":{"text":"My husband and I had a blast! We did the 4 in 1 on a Monday night. Christo is the BEST tou","useful":0,"cool":0},"5Y1mo-cO68KzV10J3A2a8Q":{"text":"My boyfriend and I did the 3 n 1. I booked it thinking we were going to some haunted place","useful":0,"cool":0},"EixfQ3yEtnINpz9jg9-2_w":{"text":"Doug was a freaking amazing tour guide! He was knowledgeable, personable, and he also real","useful":0,"cool":1},"xhy-BeDygw7t1QcAHYmP0g":{"text":"Graham was amazing good!!! I felt part of history . He definitely made us feel comfortable","useful":0,"cool":0},"5Kw50gtccYs_xURPoqX4Zg":{"text":"Went on the nighttime voodoo,ghosts,witches,and vampire tour with a friend and Faust (Josh","useful":0,"cool":0},"yOKuLkkEsKPTl3Z6WkdF_A":{"text":"It's a great event for the history buffs and fans. If you're looking for gossipy lore and ","useful":0,"cool":0},"LKHek6pTbmEw8920D7_ZcA":{"text":"Our tour guide Doug was an awesome story yeller. Very entertaining and knowledgeable.","useful":1,"cool":0},"taAfYr02AbjTnblPVwCMBA":{"text":"Our tour guide, Michael B., did a great job leading us through the rich stories of the Fre","useful":0,"cool":0},"TEYEdSAXdtshDJ9pf0iNtw":{"text":"Great tour of the cemetery. Our tour guide Graham shared some really interesting facts abo","useful":0,"cool":0},"vtc8e-4M8JHsXowhCGqstQ":{"text":"Took the cemetery and voodoo tour with Bond. She was awesome and incredibly knowledgeable.","useful":0,"cool":0},"88KX__ZmfsD4JZv4NwV2uQ":{"text":"I had high hopes for this tour, but it wasn't very good.  Frank was our tour guide and I'l","useful":3,"cool":0},"yCAVKVoMttD2jAjSssm0DQ":{"text":"Great tour. The guide was knowledgeable and patient. Didnt mind questions. Customer servic","useful":1,"cool":1},"htl4Ad60C4MnagrTtSL3qw":{"text":"So fun and entertaining! Michael Bills was wonderful and his paranormal and voodoo knowled","useful":0,"cool":0},"rcMbrKym7R4_GBekUQjh3w":{"text":"Our tour was booked last minute. Our tour guide Wendy was amazing. She took the time to an","useful":0,"cool":0},"0Cks0p-S35rAFelQLM3hyA":{"text":"We went on the 4-in-1 tour and were not let down. The tour was great! I would highly recom","useful":0,"cool":0},"OfvIxSarrtaC4nj7zvL6Yw":{"text":"Scott was our tour guide and was a magnificent storyteller. Mind you, the stories are true","useful":0,"cool":0},"NzwMuofIun6vpSAkLcu5HA":{"text":"Such a great tour to take! We did the cemetary tour and french quarter tour. Our guide was","useful":0,"cool":0},"jDrAMbptNRrMBn0zLIlTLg":{"text":"A must do for the French Quarter. I went on the Ghost Voodoo and Vampire tour. Our guide G","useful":1,"cool":0},"0fp1JB6pbOU7g8-cdA9rQw":{"text":"Had such a great time!! Ryan was our guide and he's super fun and nice. There's some must ","useful":0,"cool":0},"K0kuKARSsrkAw0-QOm2nxA":{"text":"We did a tour (Ghosts, Voodoo, and Vampire) through the French Quarter with Josh and had a","useful":0,"cool":0},"faxPHvvT4A9Tu2HztURlsg":{"text":"It was informative and fun. We thought it would be more theatrical from the description. T","useful":0,"cool":0},"nNkhI6a_DGeEFqU2yF-7fA":{"text":"We chose Witches Brew Tours because our teen daughter and her friend were eager to do a Ne","useful":0,"cool":0},"xUpVHL0jY7xWynW2IOCb1Q":{"text":"Great tour, with great our guides. Graham was our guide for the 3in1 tour, and he did a gr","useful":1,"cool":1},"UAhEnstIk4nXHDPsXt8KUA":{"text":"I would highly recommend this group if you want an exciting time experiencing the French Q","useful":0,"cool":0},"aHlUev-DI28qaA1PY7DlBQ":{"text":"If you have a choice, book your tour with tour guide Trevor Aubin. He is fantastic!! He is","useful":0,"cool":0},"tsY1D3SyL19jy6h1ykPdgA":{"text":"Booked the 4 in 1 tour. Cristo was a great tour guide. Very informative. He told the stori","useful":0,"cool":0},"BnumvcCB2AGDzbfThcOl-A":{"text":"Skip was incredibly knowledgable and knows how to tell a story. He took us to some creepy ","useful":0,"cool":0},"vXQ_CT5j_BFD2g_OZNGIxg":{"text":"I took the 3-in-1 Cemetery, Voodoo, French Quarter Ghost Walking Tour.\n\nIt focused primari","useful":0,"cool":1},"SY-o_8vXQQ0Q0Umn4sCm3Q":{"text":"This is by far the stupidest thing I have done the lady is a bitch and i wouldn't waste my","useful":1,"cool":0},"4RVL7_Plr7MMs5X24vfQUw":{"text":"I took this tour on a Sunday evening with my husband and 2 kids, ages 13 and 16.  All of u","useful":3,"cool":1},"uYjdxAdTKHDjQxM53bJqUA":{"text":"100% would recommend! Our tour guide Doug was phenomenal! This was the first night we arri","useful":0,"cool":0},"Eq5RYhHNhsaFQAevWodsEQ":{"text":"Went on this tour yesterday with two friends while on vacation in NOLA. After being to NOL","useful":0,"cool":0},"BPRtIDgXWr6YcpUhZ5SVmg":{"text":"Great fun...lots of walking...Juju was our guide, she told great stories.  Great price for","useful":0,"cool":0},"6EHoPi3kx5JgKe5ITpivbg":{"text":"I took both the 3-in-1 tour and the 4-in-1 tour with my friends with Nia (sorry if misspel","useful":0,"cool":0},"09XYpbfqBDYUoff7XPMwDQ":{"text":"We are from California and my husband and I went on the walking tour with Trevor today.  H","useful":0,"cool":0},"mTUh1DxgbFEG2PqwE3_FQw":{"text":"Great walking tour.  Not too scary but definitely spooky.  Enough details to be interestin","useful":0,"cool":0},"5VlqOE8Hvg6EM69hRZKvhQ":{"text":"The Witches Brew tour of the French Quarter was very informative. Our tour guide Doug was ","useful":0,"cool":0},"6moi3koBJvlzi3eORfSQ-w":{"text":"We did the Ghosts, Voodoo, and Vampire tour with Doug (#teamkilt) and it was by far one of","useful":0,"cool":0},"CNsMYelGJ7ykrV7vmEvUKw":{"text":"We did a four in one tour and it was awesome! So informative and it truly had me believing","useful":0,"cool":0},"j1mVXdLpOv425It_e0Cv2A":{"text":"We did the 5:00 tour with Carmel, and she was great. She was interesting and informative, ","useful":0,"cool":0},"nDXy5pa93UMGk7Zazpay5g":{"text":"Christo was awesome! So energized and knowledgeable!! My 13yr old asked for a great ghost ","useful":0,"cool":0},"pWAOWCMsZcObCmZEk5SnNg":{"text":"I booked this tour through groupon and it was a very worthwhile tour. Doug- a man with a k","useful":0,"cool":0},"oB7v485sZo-thEPc9Dve-g":{"text":"We went on a cemetery tour. Our tour guide, Dartanya Cross, was funny, nice, and full of i","useful":0,"cool":0},"-c_tHs-fUJejq1QWSEw8dQ":{"text":"Make sure that Bill is your guide!  The experience will be like no other.   He was amazing","useful":0,"cool":0},"bN06m9H65Xc77GLQcwq__w":{"text":"This was such an entertaining tour! We had Doug as our tour guide and he was so informativ","useful":1,"cool":0},"UskNwLYfpVBNvfa7wxJzvA":{"text":"Trevor was a fantastic tour guide!! We did the Cemetery tour our 1st day in the city which","useful":0,"cool":0},"Vw81N6ioIaySlZDo9ijjIw":{"text":"Christo was a great guide!  Very entertaining stories about the history, architecture, gho","useful":0,"cool":0},"HsBbTJJeH4YmBGiTqMFNAQ":{"text":"Even with the rain Trevor made it an fun, educational and entertaining tour. I loved it an","useful":0,"cool":0},"BOOACsxjtvXrms3AKtDzLQ":{"text":"Our guide, Marta, was an excellent tour guide. She's funny, energetic, friendly and very k","useful":0,"cool":0},"31x42uCsZkdgUz5jw0R3Mw":{"text":"Our tour guide Ryan was amazingly entertaining! We were completely entranced by his storie","useful":1,"cool":1},"NL3tXVCG0QKsc3U2RiF8Sg":{"text":"Just did the first twilight tour of the cemetery, it was amazing!! Our tour guide Alan was","useful":0,"cool":0},"YsoUAtS6uv6t5f73eXtGDA":{"text":"This was my first time down in New Orleans for the Spring break at my college! When we boo","useful":0,"cool":0},"2ZouJUeHwhpmbQSb1x08nQ":{"text":"I really enjoyed the tour and Trevor was both entertaining and informative. He walks fast ","useful":0,"cool":0},"Iwg7jTj4hWNq3f5rxkU9wA":{"text":"Scored a Groupon for the 4-in-1 tour of ghosts, witches, vampires, and voodoo; Wendy Darli","useful":1,"cool":0},"1jQQnAYrSGVvv33dP58HmQ":{"text":"We went on Halloween night and Team Cristo was awesome, we had a great time! It was exactl","useful":0,"cool":0},"9UT_MabWphxtvAJfRFU5zQ":{"text":"Not great at all. The are not very accommodating and the tour is nothing like what they ad","useful":0,"cool":0},"WX1XvbpqraRLc6_Ol7ZDyQ":{"text":"AWESOME TOUR!!!! I learned some stuff i didn't know, and had some old legends dubunked or ","useful":1,"cool":1},"NwXCKtURcE5xu2u8S3sBRA":{"text":"IF YOURE GOING TO DO THIS TOUR, YOU MUST HAVE RYAN AS YOUR YOUR LEADER! Great sense of hum","useful":0,"cool":0},"D0t2vOmWTGLtDUlYPnLBBA":{"text":"We did the 4-1 tour purchased off Groupon. Scott was awesome!! He was a great tour guide, ","useful":1,"cool":0},"i9sRriAa2gzjD2IwtYcYQA":{"text":"Ryan was an awesome tour guide for our ghost tour! Very knowledgeable and humorous. We lea","useful":1,"cool":1},"ocpVM1uhfmsU4PeNnBxX_Q":{"text":"Really really enjoyed the tour because our guide, Graham, was excellent. He is so engaging","useful":0,"cool":0},"iKQ5uVrGvrmg5-FLP4Jlsg":{"text":"My sister and I took two tours with Witches Brew Tours. The first was the early morning 3-","useful":2,"cool":0},"jq3NJvZjhc_RVf5-yT3WRA":{"text":"I had a blast for a few reasons...\n\n1. Our tour guide was a guy in a kilt with a beard, I ","useful":0,"cool":0},"3hOQ0F5lHMi2RYARJx_Jrw":{"text":"Josh was a tour guide and did an excellent job! I'm so happy we had him. Great personality","useful":0,"cool":0},"_uHCGk55c4qvx-Etg70p1Q":{"text":"The cemetery tour was one of my favorite tour. Our tour guide Trevor  was amazing. He has ","useful":0,"cool":0},"F6zNppACVJ8L6DoJ6RDjxw":{"text":"We had Rose and she was amazing! We did the St Louis No. 1 cemetery tour and it was great.","useful":0,"cool":0},"c1JJY_pFUYaOSVzODve2XA":{"text":"We met with Robby, a very friendly, knowledgable and fun man. The tour started at the time","useful":0,"cool":2},"Zys35UNZ15OlFB1pljbCAw":{"text":"Our tour guide was Josh. He was great! He kept us all laughing, told the stories in detail","useful":0,"cool":0},"ypVairakdDCk8GhYCe9xmA":{"text":"Ryan our tour guy was amazing! Very informative of the history of the story, both spooky h","useful":0,"cool":0},"ktZ8xV1sDcXwsZHvMK-bCg":{"text":"I am writing this review a little late, apologies. My name is Venera.  I had a tour with W","useful":0,"cool":0},"UX34_aB7npSpj1CfycMlRA":{"text":"Just call us Tiffany Haddish because we Groupon'ed the hell out of NOLA. Out of all the to","useful":0,"cool":0},"sP2TgNjGZ-5MXdGd52Xspw":{"text":"Super fun-did the 4 in 1 tour and had Andy as our guide and he was extremely charismatic a","useful":0,"cool":0},"5ky4NZq6BcaIlOdpDC9JbA":{"text":"Definitely worth your time. It's a $20 walking tour that takes about one hour, and you can","useful":0,"cool":0},"Az0yur095u0TfjJNNX1w1w":{"text":"This was our first time in New Orleans, and we did two tours with Witches Brew Tours and t","useful":0,"cool":0},"TO4Fdzy9fzBTjZGFbtW5kQ":{"text":"Mary Lynn was our guide and she was knowledgeable and funny. The whole thing lasted a litt","useful":0,"cool":0},"-Z8SAy1fMjZi5C9Nj5h61w":{"text":"Christo is the MAN! \nWe had a wonderful time, enjoyed all of the ghost, vampire and witch ","useful":0,"cool":0},"QgRPWoUcrbOve9X-CEgMXQ":{"text":"Trevor was amazing.. explained everything in a fun entertaining and educating way. It is w","useful":0,"cool":0},"OlGvsMzw5S--hKBCb27nUA":{"text":"Great walking tour. James was our guide and he was super knowledgeable, friendly, and prof","useful":0,"cool":0},"D20UOX-CsZ5PLtL0nF25UQ":{"text":"My Easter weekend 2019 City of the Dead experience with a party of 18 was very disappointi","useful":0,"cool":0},"-OLo1zB52VMnrA_ZZjsuIQ":{"text":"We took two tours yesterday. The first one was to the st. Louis 1 cemetary. It was lead by","useful":0,"cool":0},"bLGGHklylffB3CPRoGj44g":{"text":"We did the 4 in 1 tour- Josh (Faust) was awesome! So personable and great with story-telli","useful":0,"cool":0},"VmvdkceHatUmVfoVpmlppA":{"text":"We found this tour on Groupon before visiting the city of New Orleans. Our tour guide was ","useful":0,"cool":0},"ohm1lpCmM6zRvO_AqEW_OQ":{"text":"We did the cemetery tour and we got so much more! The tour included history about the city","useful":0,"cool":0},"qNAChh4-qgCGxJ5AbHquog":{"text":"Very, very, very good! We did the 4 in 1 Witches, Ghosts, Vampires & Walking Tour with the","useful":1,"cool":0},"Y5gAGcYaR5qEU9d5q_MnSg":{"text":"We booked a last minute trip for 8 and we were wowed the entire time! Wendy was amazing an","useful":1,"cool":0},"jDYMNoAxShTyb7RXxBz8rw":{"text":"This tour was entertaining above all. Marilyn liked to engage people and personalize the s","useful":0,"cool":0},"w1yZt6Sr73XPW7WXfxBsag":{"text":"My family (2 older teen boys) had a great time. Robbie was a great tour guide! Very knowle","useful":1,"cool":1},"Mx5PwC57tuiq8hQnk5q08g":{"text":"Better than we expected! \n\nWe purchased a groupon for the 4 in 1 tour and had a little tro","useful":2,"cool":1},"xpOPqM9W2YeswvQL7ggsBQ":{"text":"I did a 3-in-1 tour and it was great! I bought a Groupon and when I called to make a reser","useful":0,"cool":0},"hkcIroHp7TPapVOgjfimGg":{"text":"Great tour! Learned a lot of the history of NOLA, with an obvious focus on events that lea","useful":0,"cool":0},"f6YPNQ2pTgBEzc-oX_IIwg":{"text":"Had a great time on the tour with Josh! The stories were interesting and chilling! Also st","useful":0,"cool":0},"uqDxxHdhgXDGjy-MG0yviA":{"text":"Excellent tour.  Our guide, Christo, was friendly energetic entertaining and super knowled","useful":0,"cool":0},"G1IoscMNAdZdJFm_HJk9TQ":{"text":"Stars upgraded based on no nastiness from owner, plus to reflect the tour guide's enthusia","useful":0,"cool":0},"mu6J1SdyULyG2kCT8C0_dg":{"text":"If you get lucky enough to have Marilyn as your tour guide you will absolutely love the to","useful":0,"cool":0},"mWB3BvZrx34h0J1insU8bQ":{"text":"We did the 4 in 1 night tour with Josh. Josh was humorous and one heck of a story teller. ","useful":0,"cool":0},"Ug0IZpU8pzPCe4H95da3-g":{"text":"Had fun and interesting 4-1 tour with Wendy! Got a pretty good \"lay of the land\" with all ","useful":1,"cool":0},"DxU1B1HcoXes3zDVHCcDmw":{"text":"Went on the tour and had Doug as our guide. Not only was he super enthusiastic with the st","useful":0,"cool":0},"RXyR-BYfoV4L3SYkl5eWHw":{"text":"Wonderful ghosts, witches, voodoo, and vampires tour with Cristo! Cristo is a natural born","useful":0,"cool":0},"6mdgZVj-wo_vTPHh-PuzRw":{"text":"Very interesting tour and Trevor was a great guide, very detailed and extremely personable","useful":0,"cool":0},"uAUlsS_-ORvIhKnC1m3lng":{"text":"Marylin Mill was incredible during our tour. She made it very personable and exciting. Her","useful":0,"cool":0},"KCvAkqwhiC_5NDwitAGe-A":{"text":"I'm happy I didnt spend more than $20 on this tour.  Some of the information was interesti","useful":1,"cool":0},"-5EPhr9fcR4WNMKOSM1i6g":{"text":"Took this tour on Tuesday. Had the most amazing guide James. He was both informative and h","useful":0,"cool":0},"THyD8tJ5rRLRsXWF6rB-rA":{"text":"Our tour guide was extremely knowledgeable! I truly enjoyed the two hour tour! I learned a","useful":0,"cool":1},"5w6toWq_LeYTo2ozlbHU-A":{"text":"Just finished the City of the Dead Tour and had a fabulous time. Trevor, our guide, was ex","useful":0,"cool":1},"9Cu55bW9d_f6SO-oOyne-g":{"text":"My tour with Graham was excellent. What i liked most is that his knowledge as an archeolog","useful":0,"cool":0},"n2v2mkn-x2qre3ARZLujzg":{"text":"My boyfriend and I absolutely loved Julia (juju). We went on the voodoo, ghost, and vampir","useful":0,"cool":1},"xzE3DjmWC0KsR8hNDvbtZw":{"text":"We went on a morning 3-in-1 tour with Graham. He was super knowledgeable about the history","useful":0,"cool":0},"m7m0CdeRAfFvhoh7i0TVdw":{"text":"We booked a ghost tour and weren't exactly sure what to expect, but we had a great experie","useful":0,"cool":0},"RPiTMDGQxWUzgN9arjxysA":{"text":"This was our first time in New Orleans and this tour was fantastic. Highly recommend our t","useful":0,"cool":0},"SQgAiWhcxe9iSP4hSIX94w":{"text":"Cristo was super awesome! Very informative and a great tour! Lots of history, you can ask ","useful":0,"cool":0},"XN2Iu8FqU-a_gZDH1ZDbmw":{"text":"My son and I had Michael Bill as our VIP tour guide and he was great - personable, knowled","useful":0,"cool":0},"Pv2BWB4zLOSE_BIZufg2xw":{"text":"Fred, Fred Fred, John Fred was awesome and had a great sense of humor. Great history lesso","useful":0,"cool":0},"AIyLvTy81PyQlfbfkgcAuA":{"text":"I was kind of skeptical about the tour but it was really interesting and informative. Our ","useful":0,"cool":0},"200joXrA00wIOOqDTC9Svw":{"text":"Fun tour this past week. Our guide Wendy Darling was quite knowledgeable. Her patter was v","useful":1,"cool":0},"K_LkvJDCnvntyZmAPrqFYg":{"text":"I really enjoyed my voodoo/cemetery tour and my tour guide! Paul was our tour guide and wh","useful":0,"cool":0},"H9YDA69Kf83Hm0vwNTqISQ":{"text":"Christo was an amazing tour guide. Very passionate about the NOLA history. Great storytell","useful":3,"cool":3},"xOTaLHXcSx5Bbwg19Pub5A":{"text":"John was well informed. It was a combination of  New Orleans history tour with a splash of","useful":0,"cool":0},"vkc0r3OZ83y3uGV1lo51lA":{"text":"We did the 3 in 1 tour and loved the variety it gave us. We had an awesome guide, Trevor, ","useful":0,"cool":0},"djw-8Fsf2o5Nf_6gWRYUzg":{"text":"Janine Winter was a great guide!  She knew so much about each topic and even stayed after ","useful":0,"cool":0},"7wsEQEUNNdY-Q2kbUZpzLg":{"text":"Honestly, it was boring. I had Wendy and it was not anything what I expected it to be. I w","useful":0,"cool":0},"rFuYVobLnZsaVv-COWCWhA":{"text":"This was the second cemetery tour that I have done in New Orleans and turned out to be a g","useful":3,"cool":1},"cRGKFkELhvsRXtnE-EjIiw":{"text":"We had a great time with our tour guide Sarabell. We took my 8yr old who has a very short ","useful":1,"cool":0},"dpfP-606Y42NES9BWEIv3A":{"text":"Edward was a fantastic tour guy. Very informative and enthusiastic, 10/10 would do it agai","useful":0,"cool":0},"_WgL3jn0XvfK7OP_t3paMA":{"text":"Great experience with the 4 in 1 Witches Brew Tour. Andrew our guide was full of informati","useful":0,"cool":0},"OKZG-MZP3Ar2jtzzSNS_GA":{"text":"We did the cemetery tour. Couple words of advice: bring and umbrella and booze. Also if yo","useful":0,"cool":0},"PeVun3GUn6GfX1COjU5dVQ":{"text":"I liked our tour guide, Graham, but I expected the tour to be scarier than it was. It defi","useful":1,"cool":0},"xNZhO5dOYBJJAkmJyYJA7Q":{"text":"I found this tour boring and a bit hokey! I have been on ghost tours in Savannah and St. A","useful":0,"cool":0},"mupZKv873zIB3VCT-N0pFA":{"text":"Sarah Bell did a good job leading the 4-1 tour and it was enjoyable despite the kind of ra","useful":1,"cool":0},"QLexUWU0igjxxsjj9SL-Xg":{"text":"We took a two-hour walking tour on Monday afternoon, just before an afternoon storm doused","useful":0,"cool":0},"Hi3iMRJGQsoEBvevMQYWRw":{"text":"Fred was our tour guide. Well, his real name is John but there's alot of John's in the wor","useful":0,"cool":0},"fRdVmV341MdGYal5PCx0eQ":{"text":"For the price, definitely a 5-star--you really get your money's worth.  Our daytime guide ","useful":0,"cool":0},"Y5jvNq25J53hkSy7QikJ8g":{"text":"SarahBelle was an excellent tour guide. For a young tour guide she really knew her stuff. ","useful":1,"cool":0},"kp2qg5xCXazJI0Pnr0hrjA":{"text":"We were hesitant for the haunted tour since we are not huge believers of the supernatural ","useful":0,"cool":0},"VWdjoP5rhKqpPrB7yNTSrg":{"text":"Not what we were expecting, but it was interesting hearing about the area. We were plannin","useful":0,"cool":0},"goLfIgZt_R0_leB0mTcxHg":{"text":"Four of us took the tour using a Groupon at a cost of 11.00 each. What a deal! Stormy was ","useful":0,"cool":0},"u4V7-awDp9S836IFS-Pm2w":{"text":"I did two tours this time around.  1 with 7 of my closes friends and Edward as our tour gu","useful":2,"cool":2},"dchSmukFPa04zZRdCSmZGg":{"text":"Fantastic  tour. A lot of the weird,  off the cuff knowledge.  Green shutters ward off evi","useful":0,"cool":0},"x7-AsFSrYz5bWXTINFK6yw":{"text":"I booked a 4-in-1 VIP tour online and unfortunately booked for the wrong date. When I call","useful":0,"cool":0},"FRDj15DqWzHJH8BIBeTytw":{"text":"Worth every penny...the tour was filled with history, spookiness and so much fun. Shout ou","useful":0,"cool":0},"Jf4RgTi31SE4E1AVtVUuvw":{"text":"Witches Brew is a great tour! I recommend it.  Its $5 more then most of the other's but de","useful":1,"cool":0},"E_mwsaixEWbzICxbhCzKkg":{"text":"Fred was a great guide, he was very informative. I recommend the French Quarter tour to an","useful":0,"cool":0},"DRqn6jMqAvkcddOQHxYJ_A":{"text":"Andrew Roberts was a fabulous host! We were planning on taking a 4 pm aphrodisiac tour, bu","useful":0,"cool":0},"we9BSgi9ohEKskndAiRXxw":{"text":"I gave this tour 5 stars because I really can't imagine how it could have been much better","useful":0,"cool":0},"WIZwNaTtINfdhtUYYRACSQ":{"text":"Scott was awesome! Such a great story teller and patient! Highly recommend coming on this ","useful":0,"cool":0},"TAaNgzfwJG9KlAlm5s7zWQ":{"text":"My boyfriend and I decided to go on a walking tour on our short trip to NOLA. Taylor was o","useful":0,"cool":0},"rPZbMLg_qtQ-VExQMRKtCg":{"text":"Thoroughly enjoyed the French Quarter, Cemetery, and Voodoo tour.  Recommend doing the mor","useful":1,"cool":0},"fwtEnTM_KqhaBuz7GTT6XA":{"text":"We did the 4 in 1 8pm tour on 3/24/2017. our Host Alyssa was fantastic, informative, funny","useful":0,"cool":0},"rlFuVgVhT0lBpSiXycyjOQ":{"text":"Josh our tour guide was fantastic! Beyond friendly and knowledgeable. His beard is spectac","useful":0,"cool":0},"2Cjy62sHUYDNdBx9KV54uw":{"text":"OMG best damned tour ever!!! Our tour guide, Josh, was phenomenal! Great historical tour. ","useful":3,"cool":3},"Yqv87dQ3rYXMbEa-3W9Jvg":{"text":"My Mum and I LOVED this tour!!!! Our tour guide was Fred (First name actually John). He kn","useful":1,"cool":0},"KhuQKmPJnv9TxkMMPVjgIw":{"text":"..We went on the 4-in-one Voodoo tour hosted by Witches Brew Tour Co. Wendy Darling (snort","useful":0,"cool":0},"nBCT74vUOA7cNJ8zLdow9A":{"text":"Lucky to be a part of Team Storm! Meaning our tour guide was Stormy and he was full of inf","useful":1,"cool":1},"_81rarb4bVk9VePJAG96JA":{"text":"Rose met and exceeded our expectations! She told every story with such enthusiasm that mad","useful":0,"cool":0},"EWsgzyRGtm6sXUSaIXNZpA":{"text":"We did the cemetery tour with Trevor and he was awesome. He was so knowledgeable about the","useful":0,"cool":0},"Dcpfs9JL7GgzERmpSsZ0ag":{"text":"Had so much fun on this tour. Our guide was Christo and he was awesome. High energy and ve","useful":0,"cool":1},"Xj-mfltJ2tRM5EGS4VMTtQ":{"text":"Fun tourist thing to do! Entertaining. Some of the lore was silly but our tour guide, Scot","useful":0,"cool":0},"4GcdXi9bN0pzaz47H-SZxw":{"text":"scott is great! learned a lot and v encompassing of true history! not boring gives break a","useful":0,"cool":0},"RSJc8-6u6GhH-DB1hUOFZg":{"text":"Wonderful tour throughout the city. Graham was very knowledgeable about the history of New","useful":0,"cool":0},"fMQh5n2R0R6e90I7LD2Jyw":{"text":"We went on the 4 in one tour with guide Ryan. He did a great job. He offered history, humo","useful":0,"cool":0},"zrnDN7uu00bIn6rx1z37Lw":{"text":"This is an ok tour. I went on the cematery tour because I wanted to see Marie Laveau's tom","useful":1,"cool":2},"vW4R1TnEIspW0kNeuknOSw":{"text":"Robbie was a great tour guide.  Very friendly and informative.  My daughters had a great t","useful":0,"cool":0},"8Kz-UDPlWnWX6t5Ly4Z6Dg":{"text":"Not as expected. Just walked around the streets while he gave stories. We didn't visit any","useful":0,"cool":0},"DZy4D03OU76PKsGF1ib3pw":{"text":"First timer visiting NOLA and took this tour in hopes to be introduced to local history. S","useful":0,"cool":0},"1GO0rwjnhj0j-Ka_pHHz4A":{"text":"I guess we got the one tour that wasn't a four or five star. Though the guide seemed nice,","useful":20,"cool":12},"P5aN8YFd597GuLURaFX0PQ":{"text":"Loved this tour! We took the history tour with the guide \"Doc.\" He was fantastic,  very kn","useful":0,"cool":0},"ZEKTNqDSHdCd4Z9pkvkG-A":{"text":"Wendy was great! She kept everything interesting and was an enjoyable tour guide to have.","useful":2,"cool":1},"DoQU_Z6BNXYpyNn_yaPIyw":{"text":"My husband and I did the witches, ghost, voodoo, and vampires tour and it was awesome. I w","useful":0,"cool":0},"HKm11XCGMCqPm1sxeI1Tgw":{"text":"Scott was very knowledgeable!  Great 2 hour tour chocked full with lots of great stories.","useful":0,"cool":0},"RcBsvquNWKJUxvcDlBOqSA":{"text":"We took the tour this past Friday at 5 pm. I thought it was perfect timing to allow for di","useful":0,"cool":0},"ZMZyMTzK_KR4JCHHjr-c7w":{"text":"Went on this tour yesterday with two friends while on vacation in NOLA. After being to NOL","useful":0,"cool":0},"EBgZ_TKMElSgbeykcczmyw":{"text":"I'm glad I did a ghost tour while in NOLA but I am more glad I only spent $20 on this tour","useful":0,"cool":0},"bAwFXm8ddyb_GPqMMsn2CA":{"text":"Of all the tours we did in New Orleans, I was most disappointed in this tour. I was expect","useful":8,"cool":4},"lUEEji40saE9ao4feaGelg":{"text":"Graham was awesome! He gave us enough time to take pictures and really know his stuff! He ","useful":0,"cool":0},"UmTW4I1aFGhAv5TmTyGFeQ":{"text":"This has been my 4th ghost tour and hands down this was by far  best one . Tour guide was ","useful":0,"cool":0},"-u_2t_GNSGQQKBcbhE2YPw":{"text":"The Ghost, Voo Doo and Vampire Tour was awesome!! Our guide, Edward, was the best. He was ","useful":0,"cool":0},"GBhvQJwVzAXmEUynp-VU6A":{"text":"Rob/Robbie/Roberto is the best tour guide ever! A group of 7 of us went on the witch, voo ","useful":1,"cool":1},"NNGh1g_TcQ2araFp_agOxg":{"text":"Thieves, cheats & lies. When we booked the tour Danny took our party's deposit and quoted ","useful":0,"cool":0},"R0ZbQ4RYdMCy8IqRJeaZQQ":{"text":"Loved the tour very informative. And entertaining Fred was great. He took his time with ex","useful":0,"cool":0},"2K21F2GvcAQ1UUm4bPZfgQ":{"text":"With so many other options to choose from, I wouldn't recommend Witches Brew Tours. Our gu","useful":0,"cool":0},"gCg_oa0bGQTCpq13EsMtNg":{"text":"Alyssa on the ghost and vampire tour was amazing and knowledgable as well as a lot of fun.","useful":0,"cool":0},"twbZxo6Pmt0f1H2QTqojzQ":{"text":"We took this tour tonight and Chris was our guide. We spent 2 1/2 hours walking the French","useful":0,"cool":0},"Xo-L9zdCj4drUJatEkaYmA":{"text":"This tour was amazing! Our guide was funny and a wealth of knowledge about the seedy & sca","useful":0,"cool":0},"th1enFozCY7XE3SavuzJ9w":{"text":"It was a great tour ! We learned a lot and had lots of fun. Definitely recommend it. La es","useful":0,"cool":0},"f1UUY4DL_DHpORR0spY10g":{"text":"Did the cemetary, witches, and voodoo tour! Dont forget to check groupon before buying bec","useful":0,"cool":0},"CSuj76RHoU3G-17k2r9YJg":{"text":"This tour was so much fun! It was the perfect blend of history and ghost stories. Our tour","useful":0,"cool":0},"VLgWwFWol1EqW-9UJd25EA":{"text":"Our tour guide was very friendly, knowledgable, and humorous! Signing up was easy! Had no ","useful":0,"cool":0},"pxSiCXwiDSb4Bbi5AYtiTA":{"text":"My wife and I did the 3-1 cemetery, voodoo and more tour yesterday. Our guide was Sarah an","useful":0,"cool":0},"Y3tk2vudDsMjsQgjlUlb7Q":{"text":"We did the voodoo, vampire, witches tour. We had Edward as our guide. He was awesome! Frie","useful":0,"cool":0},"kBx8wJlMt9Q_sp2ZnM1v8Q":{"text":"We did the cemetery tour with Fred. It was awesome! Best tour we did during our stay! He w","useful":0,"cool":0},"6o49rffeR_0xOS7QSeIRAA":{"text":"I am giving the tour 5 stars even though there was a mistake with my reservation. I called","useful":0,"cool":0},"MwErI0plo5K_c9v2mYJorg":{"text":"We did a 2 part tour that was purchased off of Groupon. The afternoon tour with John (Fred","useful":1,"cool":0},"UXQvJa7LkPFrLfPpIU90jQ":{"text":"Sedya our tour guide was great. I really enjoyed the tour! Thought I'd might find myself b","useful":0,"cool":0},"gP50xXH3WQ6OABBslCkkYQ":{"text":"Wendy was a great tour guide. Packs a lot of information into a 2 hour walking tour of the","useful":1,"cool":0},"adLGv1jxTvQR-N2syn_jPg":{"text":"Sara Belle was our tour guide. She was entertaining, very knowledgeable, and excited to sh","useful":2,"cool":1},"aqbjdmbzaMZVVsavNgbKfg":{"text":"I bought 2 of my tickets on Groupon for $11 each. So I paid $22 for 2 tours. I called to b","useful":1,"cool":0},"o7xPirmxGqMV08yVjgI8Nw":{"text":"UPDATE: After posting on yelp we were contacted by the company owner who was very concerne","useful":2,"cool":1},"-K5AaKfshyvGp6X3srM-eQ":{"text":"Very informative and fun! This group knows their history and they are excellent at making ","useful":0,"cool":0},"2ABmCBaUzIJ568KhUuDNqQ":{"text":"Bond was our tour guide and did a fantastic job of giving us historical facts to go alongs","useful":0,"cool":0},"BSL5qMrutgM3OrivF1mNGw":{"text":"Awesome tour made that way by our tour-guide Trevor.  I went with my brother and family an","useful":0,"cool":0},"-G8ycZFXkKWB2M3oxrwmFw":{"text":"Having moved to New Orleans over the summer, I had it on my list to go on a \"ghost tour\" i","useful":5,"cool":0},"stkU2BbNSxjYVcOiR-K6sg":{"text":"My hubby and I are visiting NOLA for the first time. Of course, we had to go on a walking ","useful":0,"cool":0},"qSos597Cf5obHM8SEI1gBQ":{"text":"Our family took 2 tours with Witches brew. The first tour was the cemetery your with Fred.","useful":0,"cool":0},"tgoDs9HS-WDmDv2gJS-iIw":{"text":"We did the afternoon voodoo cemetery tour and I felt like it was a little shady. Bought my","useful":0,"cool":0},"P-uLbPN8JIdPiBpapqtkcQ":{"text":"Our group of 5 purchased the witches 2 pack tour. During the 1st tour we had John Fred as ","useful":1,"cool":1},"w7ylJ_PC2dbHB2kDef3xxA":{"text":"I hope I spelt his name right, but me, my sister, and a friend went on one of the tours an","useful":0,"cool":0},"Ns4yH5tvZn6a-e1Feqo2OA":{"text":"We went on the witches brew tour twice, one for the cemetery and once for the ghost/voodoo","useful":0,"cool":0},"avJODDpWVWaC2aviw7Ef2g":{"text":"We booked our Witches, Ghosts, Vampires and Walking tour prior to visiting New Orleans for","useful":0,"cool":0},"5uc0o9uL7y7eTkQ859zsRg":{"text":"We really enjoyed the tour. Edward was an amazing storyteller and excited about the spooky","useful":0,"cool":0},"oE1pCViJUUP-W22_0mqPqQ":{"text":"Pros: Went on the night French Quarter Ghost tour with Ashley. She has been doing these to","useful":0,"cool":0},"-ss_bdrdhkiYazXpA7_RoA":{"text":"Great Tour! We had Tamara as our guide and she knows a lot about this old spooky city. We ","useful":0,"cool":0},"gYGE8HF-Drxkrlzv_Fme3Q":{"text":"I'm so happy I found this tour on TripAdvisor for $11. First of all, it was an absolute de","useful":4,"cool":4},"8iXmyMwpCUfcsd5xdvGTng":{"text":"James was a great tour guide give us a lot of information and details on our tour at the c","useful":1,"cool":1},"DYclHlM97evQ9xiY4SSJsQ":{"text":"This is one of the best things I did on my recent trip to New Orleans. My group purchased ","useful":1,"cool":0},"AedqKkpk7ZGkkx_2ZM52sw":{"text":"Trevor was our tour guide for our cemetery, voodoo, and French Quarter tour. He was so kno","useful":1,"cool":1},"uOksRidrFkmzBSJjwPSW-Q":{"text":"Awesome tours, class act all the way! In NO WAY did the owner pay me to say this. (Wink,wi","useful":1,"cool":0},"auOCpMquCB3_MuRdHlgi2Q":{"text":"The ghost tour with Frank as our guide was really cool.  He had a good sense of humor and ","useful":1,"cool":1},"LjYxXcm4kD34TDxuTBVaow":{"text":"We took the 4 in 1 tour. It was supposed to be 2 hours but was more like 1.5 hours with a ","useful":0,"cool":0},"S5YYccoEVsRqp74VXCcE2g":{"text":"I had recently took a tour with Scott! He was very funny and laid down some ground rules f","useful":1,"cool":1},"nj_Lvq-KTfaKdUZQUHOFZQ":{"text":"We really enjoyed BOTH of our tours with Witches Brew. The first tour included a historic ","useful":0,"cool":0},"_dlunVf5TlcIXm_erm5eHg":{"text":"Had a great time here and loved the historical aspect of the Ghost Voodoo Vampire and Witc","useful":0,"cool":0},"BcrhgZzCtb1SfGjvqCyOqA":{"text":"Spooktacular tour! Robbie was our tour guide and he really knew the city and its history w","useful":0,"cool":0},"4xIT4eAB6PbqNy3gz6_t-Q":{"text":"We did the cemetery tour and it was great! Rose was an awesome tour guide! She knew so muc","useful":0,"cool":0},"Y6eawtsHV7gBG_T7ph9cFA":{"text":"Had a Groupon for this tour. Never could get anyone on the phone to schedule a time. Email","useful":3,"cool":0},"0Hbveo5GBSGPsfzJWplULQ":{"text":"So, the owner of Witches Brew sends me a reply on my review of Witches Brew. \n Okay, so no","useful":2,"cool":0},"LYf9vj7ElnWI-w2RXU0ibA":{"text":"Scott was very personable and knowledgeable. Long 2alk, so wear comfortable shoes, but def","useful":0,"cool":0},"zK2y2xUijMKEcBxJsT5sCQ":{"text":"If you are expecting to learn about witches this is NOT the tour for you. The tour guide e","useful":4,"cool":0},"EAE9TLNvqYR0F9_ADkUnVA":{"text":"We did the 2 hour walking tour that includes the St. Louis cemetery (in New Orleans). Our ","useful":0,"cool":0},"CN8njrhO8n-WvmIpB_C2GA":{"text":"This tour was a lot of fun. Our tour guide, Raven was full of knowledge about New Orleans.","useful":1,"cool":1},"0fa9Ck1qX6LVfVXgZ7pSJA":{"text":"Christo was super fun and informative. Really knew how to capture his audience. Would defi","useful":0,"cool":0},"EOV5IkG8o00yQkwYAvb20g":{"text":"My cousin and I went on the ghost tour last week & had a great time. Alyssa was our guide ","useful":0,"cool":0},"tcXDXNoOF4lS_1ffjDJ6KA":{"text":"Don't go. Our tour was the worst ghost tour I have ever went on. Stories dull uninterestin","useful":0,"cool":0},"FL0x2zLoi1OrmPWyWePErg":{"text":"Had an excellent tour of St. Louis Cemetery number one with our guide. Very friendly and i","useful":0,"cool":0},"233LQZmdkNXLkkDik96Q_Q":{"text":"Loved the tour. Our group had so much fun. The tour guide Scott was great! He kept us ente","useful":0,"cool":0},"2dhPjGOmKXdnM890Rbgf2w":{"text":"This tour is a $20 walking tour that takes about one hour, and you can bring drinks along ","useful":2,"cool":2},"kpdguZSRCgdxqR1xMojJxw":{"text":"Wow! Hilarious how I got threatened over my review for not being happy about the tour. Ple","useful":4,"cool":2},"CGZPbmjebhOrhsb2pT82NA":{"text":"My husband and I did the tour yesterday and were part of TEAM CRISTO!!! A very energetic a","useful":0,"cool":0},"WO8Wsp26qr31rKekT9Pi8A":{"text":"This is the best tour to go on if you want to learn more about the history of the French q","useful":0,"cool":0},"ciP72XtZKoLFtnpvbWMySA":{"text":"I took a tour with Stormy, best tour guide ever! You could tell he did research and he act","useful":0,"cool":0},"KdhW1HJcgg7iV_5NYxTguw":{"text":"This is a must do tour in NOLA! Christo was amazing! He was so nice and made sure everybod","useful":0,"cool":0},"zwItoCg-cZ0ULywp0dXtzQ":{"text":"My husband and I took the 4 in 1 tour with Ryan as the tour guide this week, and it was gr","useful":0,"cool":0},"bQSMVs2LTiytoFX9bBQQxA":{"text":"I'm glad I did a ghost tour while in NOLA but I am more glad I only spent $20 on this tour","useful":0,"cool":0},"Mi3UWEFxTuS9iG2YF_W4Dw":{"text":"Great tour! We did the 5pm 3-in-1 ghost, voodoo and vampires timeslot and thoroughly enjoy","useful":0,"cool":0},"RVDRiPtE00TN_xXKN_j9EA":{"text":"Loved this tour!!! Brian was very funny and friendly. They make iconic stops and I'm very ","useful":0,"cool":0},"55iAlUg89k1Muk0qbGzS-A":{"text":"We took the Cemetery No. 1, French Quarter, and Voodoo tour. Our guide was Sarah #teamsara","useful":0,"cool":0},"s_vOT38Or3M55eSoGXY7rw":{"text":"Grabbed a St Louis cemetary #1 tour for two off groupon for 11am and Maleka was our tour g","useful":0,"cool":0},"5cJJ19h2AxEnT3l98EZPMg":{"text":"This was an awesome idea for a tour! I wanted the cemetary one but I got the 4 in 1 Voodoo","useful":0,"cool":1},"N5Nw9Dz_jg2-acR83ZbMrQ":{"text":"I bought the 4-in-1 tour off of Groupon and I'm so excited I did! \n\nI forgot the name of o","useful":2,"cool":1},"ccog-9z9lQXXGkgC_SPyxQ":{"text":"We had Scott as our tour guide and he was AMAZING. Very knowledgable of the history and st","useful":0,"cool":0},"LPmjHOrsJlAxJc4cNw8LxA":{"text":"My husband and I had a great time! We did the 4in1 tour. Our guide Doug was awesome and ve","useful":0,"cool":0},"FgK1AZDKCvTtmyTNPhKh7Q":{"text":"I did this tour on a wednesday night. I called on Monday the day before our flight to rese","useful":0,"cool":0},"JthiqLAsbDIrmWZ5IVQS_w":{"text":"My husband and I decided on the last minute to try out a tour before we go home. I'm glad ","useful":0,"cool":1},"cxBDeMYb8PVv-aYj3Nu70g":{"text":"My brother and I really enjoyed our tour on Team Sarah. She was interesting and told us ma","useful":0,"cool":0},"_jgkOkHOXgQrO9JA_58eKg":{"text":"I am so glad we found this company! They were not only able to accommodate our family that","useful":0,"cool":0},"2uUvUMAv8VG7cRZuHh0lHw":{"text":"I did this tour with 4 other friends and all of us were EXTREMELY disappointed. We purchas","useful":2,"cool":0},"1XUIGPSy4dG1tFQQgKuioA":{"text":"The Witches Brew Tour is a must when visiting New Orleans! My tour guide was Josh and he w","useful":0,"cool":0},"DOAadGA9ctLk0-ywJ5_RRQ":{"text":"I really enjoyed our ghost voodoo and vampire tour with Edward on Thursday night. Team Edw","useful":0,"cool":0},"2V4AJHZDdjFAF7zAff2-QQ":{"text":"Amazing time! Our tour guide was amazing - I thought she was an actress with how animated ","useful":0,"cool":0},"GmDpFYOiydrFTIOd898SRQ":{"text":"Great tour guide, information tour and a fun afternoon! Def recommend if you're visiting t","useful":0,"cool":0},"gkBEHJDlk7G28ZCh5QqvRA":{"text":"We did the 4 in 1 tour with Cristo and it was great! He was very funny, knowledgeable, and","useful":0,"cool":0},"yfzqecX-WcbkV5tJ5Zma-g":{"text":"The woman on the phone was SO rude about the fact that I was using Groupon and confused ab","useful":0,"cool":0},"Yg1cnwl_NxsspRtnsZnEig":{"text":"Was skeptical to start out with, but Christo is fantastic. Funny, knowledgeable, and has a","useful":0,"cool":0},"6Dg4dYtiNB5mQiU3FYPaiQ":{"text":"We went on the 4-1 witches brew tour about 4 days ago - took me awhile to write the review","useful":0,"cool":0},"7rss6J8Y0ohqCkPJWyBPdQ":{"text":"Took this tour the night I got into New Orleans. It was a great way to explore the city, l","useful":0,"cool":0},"6hfoYv7JiVQ9pbWR4TxvTA":{"text":"We had a great time on this tour. The tour guide, Denise, had lots of interesting stories.","useful":1,"cool":0},"lG3ypWxo9k78tV6lq6bzLg":{"text":"I had a nice time on this tour. Our tour guide Doug was awesome (look for the guy in the k","useful":0,"cool":1},"e9aZBrzIqYyV0DRyr0HNNQ":{"text":"Scheduling was a little difficult over the phone since its tour season and he was the only","useful":0,"cool":0},"gazyGvLjkB3m0Sh66lm2UA":{"text":"We went on the Witches Brew Tour with Cristo, and he was SPECTACULAR!!!! You could tell th","useful":0,"cool":0},"OFozb3CciCFGL-7gteZgGA":{"text":"Josh Fauss was a great storyteller and knowledgeable about the dark happenings in the Fren","useful":0,"cool":0},"KKp6fNfYYPZHghuc8sjYSw":{"text":"Sara Belle was absolutely amazing! Her personality was so cute and she was really informat","useful":1,"cool":0},"-92srtv1jnt3rgNJcdlWjA":{"text":"I did both tours today. Fred did the day tour and Doug the night one. They were both prett","useful":0,"cool":0},"OjJHkHVDgVLO11u7DG1fRQ":{"text":"Edward was our tour guide on the ghost, vampire, voodoo tour. He handled the drunk people ","useful":0,"cool":0},"SuSbCxr-gE8WFpRkPR3JOA":{"text":"First time in NOLA. This was a great start to our trip. The history behind the places was ","useful":0,"cool":0},"RlwRVBg7mVsPo4Dj9Rcw9Q":{"text":"Had a great experience. Had Ms. Mel for the tour and she was just a fountain of informatio","useful":0,"cool":0},"_jq7c3K22WsKhdRuzv9bgQ":{"text":"Loved our tour guide. Extremely funny full of great facts. And a fantastic storyteller. We","useful":0,"cool":0},"PbUJRfubBVURiOsPqscwuw":{"text":"We took this tour with SCOTT. \nSCOTT IS THE BEST. \nALL of the other tour guides should buy","useful":0,"cool":0},"YoYpzLIq0w3Vb3uu0bOHnw":{"text":"I booked the  8pm tour for Thursday, July 26 via phone with Witches Brew. Did the 4-in-1.T","useful":6,"cool":3},"tOYYHh2vzTmahRkSnoCkZw":{"text":"I don't believe in ghosts, vampires, or werewolves but I was damn entertained by our guide","useful":0,"cool":0},"X4WtVc5a3dZCpZEu9eoNxg":{"text":"Josh was awesome tour guide .\nWe enjoy learning about New Orleans from his personal experi","useful":0,"cool":0},"JquAI7sOr5tbVSist5xIQg":{"text":"Totally LOVED Marylin! She is awsome. We had not expected to learn so much real history ti","useful":0,"cool":0},"JqckANxi2e0tvint6PJVmQ":{"text":"We took the 8 pm tour on a Saturday night! It was great. I do recommend maybe not during t","useful":0,"cool":0},"_HpI41w-ll6ufYwrNoplLQ":{"text":"We took the morning tour to St. Louis Cemetery 1 and Congo Square with Marylin, and enjoye","useful":0,"cool":0},"P93J7uwD6Th2gkLx-W2DrQ":{"text":"My husband and I did the 3 in 1 daytime and then the Haunted evening tour. It was just ama","useful":0,"cool":0},"A83yAov_nVajus_XbREjyw":{"text":"Purchased this Ghost tour through Groupon. Honestly went with this one because there were ","useful":0,"cool":0},"YmZgt903SXfERCM_AYbUOQ":{"text":"Robbierob was great! Very knowledgeable and animated. Highly recommend. I def am going to ","useful":1,"cool":0},"a3ZZ51MqI_UVs5fNGmT3oA":{"text":"My friends and I did this on one of our last days in New Orleans and it did NOT disappoint","useful":0,"cool":0},"DdILSLyfGq5cmCT8Cxyvgg":{"text":"Great tour. Our guide was great and you could tell they have a passion for this. I would h","useful":0,"cool":0},"qq1MbEUKEjvy6I3uJY23lw":{"text":"On my recent visit to NOLA I was on a search for a great & fun tour I stumbled upon the  W","useful":1,"cool":1},"HKmzR-vezPsHtYuV5hOJJQ":{"text":"The 3 n 1 tour\nSandra was awesome, made the history interesting, answered any questions we","useful":0,"cool":0},"UvvkOfOz_DaRm9B9aa__9w":{"text":"This was a fun and educational tour.  Description of tour as advertised is pretty accurate","useful":0,"cool":0},"GernGgiB78771zOPN54Yeg":{"text":"You got to ask for Doug! What a great story teller! Our first time to Nola. Lots of great ","useful":0,"cool":0},"tL4Y-4UrXoU-a0cPTFtUxg":{"text":"I decided to book this tour because I had a groupon, and I was really disappointed.\n\nWhen ","useful":5,"cool":0},"Tat7zHR950qVGSywGTYIsQ":{"text":"You cannot beat the price of this tour. I wanted a tour with a little bit of history. Scot","useful":0,"cool":0},"Q2ug08LZZf3iGuAgbFeXSw":{"text":"The tour was fun and our tour guide Wendy was funny very informative about the city and th","useful":1,"cool":0},"I22OHP33mAkp9oVB7lYs4Q":{"text":"Got this as a gift & absolutely love it!! Jared was our guide & he was amazing & very info","useful":0,"cool":0},"P4IaaEbq6jdb-DuKChLEGw":{"text":"THIS IS THE TOUR TO TAKE WHILE VISITING NOLA! My husband and I did the day and night tours","useful":0,"cool":1},"GrZNOUwLWzVQPxrFLv2kNg":{"text":"Had the 4 in 1 tour yesterday at 5pm with Josh. It was 2 hour long, walking around the are","useful":0,"cool":0},"lS1b9MyAtEjDEX42SHnS3Q":{"text":"What an absolutely amazing tour. Everything from the initial reservation, to meeting place","useful":0,"cool":0},"V1Pqv_2YBaVRKxHatgW2oQ":{"text":"This was an awesome tour!:D We were exploring the French Quarter and all its spookiness fr","useful":0,"cool":0},"sCdI4wQ7o8_BX5vJyPvnTw":{"text":"Josh took us on a great tour of the French Quarter. He shared with us stories of ghosts, w","useful":0,"cool":0},"nUaF6eAV-qLQeygBCgLo0g":{"text":"Went on two separate tours, had Mary Lynn and Nia as our tour guides, both were great! The","useful":0,"cool":0},"kLNP5uh7Tk-C9e6sf1mx7A":{"text":"Had a great tour with Cristo. Very interesting and informative. Had lots of fun. Went to s","useful":0,"cool":0},"6uV_mgcWh1LwiJ01tDeElg":{"text":"Had a great tour with guide Trevor today.  Learned a lot about NOLA history and American h","useful":0,"cool":0},"8G-UttYUjnsPRZ4meW9IOQ":{"text":"Awesome tour with Robby! Informative, entertaining and kept our attention :) helpful about","useful":0,"cool":0},"rOu-KsIKitklSvgh5lvJGg":{"text":"Great guide and fun tour! The only thing I would change would be the length of the tour. T","useful":0,"cool":0},"b-3tUrrL2Jvrol6Nns8Diw":{"text":"Good tour. Awesome guide \"Fred\" first time here with my kids and wanted them to learn a li","useful":0,"cool":0},"rd7R1r1f-uul-1Znw3PYWQ":{"text":"This was such a fun and informative tour! Our family really enjoyed all the wonderful stor","useful":0,"cool":0},"J31qjzXmywmIWtueMDIlkA":{"text":"I give this a 4 not a five because we did not stop directly in front of key places as the ","useful":0,"cool":0},"5AStBe__it7Jn4-I4F1MNw":{"text":"My friend and I had a wonderful tour! Our guide was very informative,interesting , and we ","useful":0,"cool":0},"hBvZ2l0iV1O6zYCobkbGSQ":{"text":"My group and I had a mid afternoon tour on a Saturday. To be honest, we were in town for a","useful":0,"cool":0},"a_edAlUmojSHGFwyhJDqpw":{"text":"Fred (John) was a great tour guide! I use a wheelchair, and he was attentive to make sure ","useful":0,"cool":0},"4LiE0r_mF5CI28FwTWdwjQ":{"text":"We were charged $20/person for this tour, and the 5 of us may as well have burned a $100 b","useful":2,"cool":0},"zCHlWreXyMukSmC-egftwg":{"text":"I did the Witch Pack tour and had Mary Lynn in the morning and Taylor at night. Both were ","useful":2,"cool":1},"FzfWsQE3u2eXs3Az__3y7g":{"text":"We had a wonderful time during our tour, which lasted more than two hours. Our guide was v","useful":3,"cool":2},"lh5jXCYMDOaHN61eKZ6_Og":{"text":"We had an amazing tour a few days ago by Ryan! It was the highlight of our trip. Thank you","useful":0,"cool":0},"yXtNvJYvvCK-xrKuhWi_qg":{"text":"I absolutely loved Nia and her tour! She was a joy to follow and told the history very wel","useful":0,"cool":0},"o6dmmCLE6_EQmy21aymywA":{"text":"Took the 2 hour cemetery tour today. Trevor was our guide. This was a really fun and infor","useful":0,"cool":0},"0aTL-3y5quWTPc3hwjBmoA":{"text":"Awful and rude customer service! Read the negative reviews for this place and you will see","useful":0,"cool":0},"b1lSrCWD0i6avfBhnrRqxA":{"text":"We had Wendy as a guide she was great, very informative. She was funny and genuine. We had","useful":1,"cool":0},"L5XUoLclJiE6DgFR2fPbbg":{"text":"Being my second time going on a Witches Brew Tour I had extremely high expectations as my ","useful":0,"cool":1},"8eyPluVER3f5AzgxxbLTMw":{"text":"My friends and I went on the 8pm Voodoo, Vampires, Ghosts and Witchcraft tour. We had Sara","useful":0,"cool":0},"uKXQtUsYWz8CbvDKa_88SQ":{"text":"We enjoyed learning the history of many places and our guide was very nice and thorough.  ","useful":1,"cool":0},"Odp0F7iQ5wWAKKRerOi8ZA":{"text":"The Vampire, Voodoo, and Ghost Tour was amazing! My group had an amazing tour guide named ","useful":0,"cool":0},"KTrdKt-EfnSwZQGfBjSqcQ":{"text":"Love this! it was so entertaining! Trish was amazing. She was very informative and funny a","useful":0,"cool":0},"qBhy9GTGYpvYZiPVB6_p4w":{"text":"Christo gave just the best VIP tour! Great storytelling skills with excellent historical k","useful":0,"cool":0},"LktuRqRv8LjKNK2AjKl6yg":{"text":"James was a great tour guide! He was knowledgeable and funny. He kept everyone in the grou","useful":0,"cool":0},"eVrAYeqiVDE1ZINEJT7Qsw":{"text":"I have been on 3 other tours throughout the city and make a point to try a new one each vi","useful":1,"cool":0},"8XNtul4grNpZ2SsW38CzGg":{"text":"Went on the Ghost Tour a few days ago. The tour was so cool. Sarahbelle is a GREAT tour gu","useful":1,"cool":0},"ovRkNBsFtYPyuLkkN88YIA":{"text":"This is such a great tour! I've done a lot of ghost tours good and bad. This one is wonder","useful":0,"cool":0},"_prySQo7F74jHj8fXgkJpw":{"text":"Marilyn was an excellent tour guide. She was knowledgeable about the history of New Orlean","useful":0,"cool":0},"sRgMPmmTWJCtJ210N0ZQZQ":{"text":"Had a blast! We did the 3 in 1 cemetery tour during the day with Fred and he was fantastic","useful":0,"cool":0},"O5vOeqHMbyvgw-cFAy0cog":{"text":"Scott was the guide for a very informative and interesting walking tour in downtown New Or","useful":0,"cool":0},"4mWqF1vjswpFtcZnqXIkxQ":{"text":"This was a great tour! We had our 13 & 15 year old kids with us and did the 4in1 tour. Car","useful":0,"cool":0},"2evtbiguY2VTgnt8dfSW8A":{"text":"We took the tour last night and enjoyed it. We had previously taken it years back and the ","useful":1,"cool":0},"0QVmCMpsM_lVQNQiajUnDQ":{"text":"Excellent! Bruce was an AWESOME guide! Nicolas Cage, The Ink Spots, Voodoo...terrific! Wel","useful":0,"cool":0},"5xY77Cm8L0gStFoIZNRcMQ":{"text":"The best way to describe this entire experience is just Bizarre.  \n\nI purchased the groupo","useful":8,"cool":4},"p-cfMacXMc7gKX8FeOgEsg":{"text":"Fun walking tour. Our tour guide Scott was awesome! Definitely would recommend to any AHS ","useful":0,"cool":0},"IW4WDAju_q2xh-u25VI0ow":{"text":"Trevor the pirate was great. Our tour covered a lot of historical stuff. We walked and too","useful":1,"cool":1},"B-DHjHOLJK4bAS8hXyPVdQ":{"text":"We had a great time on the 3-in-1 tour with the lively, lovely Lady Rose. What a fun way t","useful":0,"cool":0},"37ZC-0p9l9EjP8EfPTZglg":{"text":"I was in New Orleans with girlfriends for only two days and I am so glad we made time for ","useful":2,"cool":1},"Zn8j69NcafqYOiNdY7w1rQ":{"text":"Had a great time on the tour! Taylor was awesome and taught us so much. He knew what he wa","useful":0,"cool":0},"E0VQUmF8m81MUFsC22dEfw":{"text":"We did the 8pm \"4 in 1 Witches, Ghosts, Vampires & Walking Tour\" on Nov 1. \n\nCheck in was ","useful":1,"cool":0},"qRHlNCUYIPiZDzEZ90EQdA":{"text":"Ashley was amazing! She was so much fun and so informative, definitely a must see when you","useful":0,"cool":0},"YsjipAj3v3UFNBQxp0Z7dA":{"text":"Krysten gave the best tour ever!! A great mix between history and entertainment. I would h","useful":0,"cool":0},"dXuczmJN7jqcjZUaKEhB2Q":{"text":"This tour was not what I expected, I did visit during covid time so we did not get to go e","useful":0,"cool":0},"7kiwFCyzCWExXoRy__2M5w":{"text":"Scott was an amazing tour guide!! I had been on NOLA ghost tours before and we went to som","useful":0,"cool":0},"nl8FsM6ZPAlD4CIhGdwLbg":{"text":"Save your money. Our tour guide was not enthusiastic and her storytelling could of been be","useful":1,"cool":0},"duyQoe29Ztr-1Tlw8OCW_g":{"text":"Great part of my NOLA trip! I had Scott as a tour guide. He did a great job. It seemed lik","useful":0,"cool":0},"y2J7ulHsBnOMAvfVagqXXg":{"text":"A fairly good tour of New Orleans haunted history. Doug was animated, interesting and enga","useful":2,"cool":1},"nGR9jydlJTCxoirRmnPP-g":{"text":"We had our tour with Robyn. He was so engaging and entertaining. We had such a great time!","useful":0,"cool":0},"W5GLm9wIMU0_JRt-lmNl7g":{"text":"We had a great time with Josh. We was a fantastic story teller and answered all of our que","useful":0,"cool":0},"o2-h9AAG4Yeq7VKIvNdaKA":{"text":"This is a fun tour with lots of lore about the quarter. Our guide, Doug, #teamkilt, was aw","useful":0,"cool":0},"3C5U_15N93J-dQsxcniE5Q":{"text":"Scott is a talented and engaging story teller! A great way to explore and hear about the s","useful":0,"cool":0},"dXDkyqfKc1aI96UNcrXFbA":{"text":"A lot of history. Very interesting and informative. Graham was awesome with lots of fun fa","useful":0,"cool":0},"Qc06PkEUcm5Gc0X85dhn8g":{"text":"I did the \"New Orleans: Ghosts, Vampires, and Voodoo Walking Tour\" on 1/8/20 with Josh. I ","useful":0,"cool":0},"yFRmzQo5V9p7dV3QCGP-oQ":{"text":"I almost didn't even go. The person that answers the phone is beyond rude. She was very ir","useful":1,"cool":0},"tELmTSgIMwthUGs0NM6MeA":{"text":"Published description:  4-in-1 Witches, Ghosts, Vampires & Voodoo Walking Tour: You will v","useful":7,"cool":3},"E4A1_IRo_DcN_9C5YPOHGA":{"text":"First things first! I do not write this person who owns this place or tour whatever you wa","useful":11,"cool":1},"qb8gkd4V6sAiMZx6c3At2A":{"text":"We were so hyped for this tour expecting to hear some awesome stories.  Unfortunately our ","useful":1,"cool":0},"92GS_E4kl8m7m7ASO9n6_w":{"text":"Had a great time doing the walking tour in the French Quarter. James the tour guide was pa","useful":1,"cool":1},"M1Ifcwgs_SyUnsVKog2rqg":{"text":"Our tour guide Crystal was awesome! She was so sweet and kind to all the children in our g","useful":0,"cool":0},"dy7xG7xAuPmO1b--jEuY8w":{"text":"This tour was very nice and informative. Our guide, Trevor, was very knowledgeable, had gr","useful":0,"cool":0},"lgDJ_uN3BYxKn-okWySgGA":{"text":"I was lucky enough to have taken the tour led by the lovely and hilarious Krysten. She was","useful":0,"cool":0},"kKpFNVoG7UrF28gq_n94fw":{"text":"Jennifer was amazing! I took a long time looking for a tour. I was bringing my husband, wh","useful":2,"cool":1},"_PpOW2I9aXJW-UFzIb1Dhw":{"text":"Had a great time. We walked a lot probably over a mile. Andy was our tour guide. I think h","useful":0,"cool":0},"kk5oav2-8s2i_ZcvB6Yjdw":{"text":"Taylor did amazing!! He knew  the stories well and was fun! I definitely recommend  reques","useful":0,"cool":0},"ZCFKnU2Qx7UOwmDLzjVriA":{"text":"Disappointed and unfortunately had to depart your halfway through. Tour guide was very kin","useful":2,"cool":0},"l-cp5FxL0IjHmlsd1BXXng":{"text":"Awesome adults only walking tour of the French Quarter! Our guide, Christy, was very knowl","useful":0,"cool":0},"OEWXSaenaUrA4o9P52WKxQ":{"text":"We were so impressed with both the tour company and our guide, Sarah! Although we were put","useful":1,"cool":1},"csIWNoOTpkzkU8j144WnBw":{"text":"A fun evening.. We took the 4 in 1 tour. Our tour guide was Graham. He was very super fun ","useful":1,"cool":0},"Ouf7msf2halwpQylupDTKQ":{"text":"I was a single in a group of 18 people. We were in Sarahbelle's tour and she is fun and ha","useful":1,"cool":0},"XdOx6iw3UyrlEKY785R79A":{"text":"Robbie was our tour guide and he was super informative and wasnt feeding us BS. He was ver","useful":0,"cool":0},"cf8U3dLzBe3_HaBfOLREpQ":{"text":"Went there last night great tour the tour guide with the kilt was great!!! Mad I cannot re","useful":0,"cool":0},"5UcufMpueXekjOHD03k0Pw":{"text":"The tour was absolutely fantastic...and I have to say scary!  Taylor our guide was super d","useful":0,"cool":0},"VxnPESEWgbnWV8Wo-jl_XQ":{"text":"Great tour, full of historical facts and voodoo/hoodoo lore! Robb was very informative and","useful":0,"cool":0},"HXCA-ppjWD_mH264yyhE0g":{"text":"Josh was our tour guide and he was amazing! Fun and informative... cool guy, awesome vibe!","useful":0,"cool":0},"Xk1UvC0j-2icMk0f6k_vxg":{"text":"It was ok.  The tour group was very large and it was difficult to hear the guide.  It was ","useful":0,"cool":0},"4efcORJfuVljytiAJH6cbw":{"text":"James was a fantastic tour guide! Extremely knowledgable of the history of the architectur","useful":0,"cool":0},"o2Kd0cnk5z-BOMZDAyEfHg":{"text":"We had an amazing time Came from Chicago we weren't sure about this tour but we got Very L","useful":1,"cool":1},"vBXNNvnYkPKSgpG8ioFuFQ":{"text":"Sean was our tour guide.  He was upbeat and enthusiastic.  It's worth the history lessons ","useful":0,"cool":0},"xMSF_i6sISYLQjhcYBC6Pw":{"text":"Taking the 'Ravens darker than hell' tour walking through French Quarter & stopping in fro","useful":1,"cool":0},"tnmQjy3HbeFQzGmfLJb_og":{"text":"We went on the ghost, voodoo, and vampire tour. Our guide, Scott, was great and did a wond","useful":0,"cool":0},"ifqV4enrccQSqU4dvDZlqA":{"text":"Open during the pandemic! Come here and get a great tour around the city with lots of info","useful":0,"cool":0},"di4JON3zqqbTinKKDpa7nA":{"text":"Our tour guide was Robbie Rob, he was excellent! We had a great time and would recommend t","useful":0,"cool":0},"r2QKZyYs0p14qvh8df6nig":{"text":"Eh. If you are going to market a day and night combo tour...change up the stops. Did the a","useful":1,"cool":0},"q1cc488zRbna7NaXL5Qu5g":{"text":"The 3-in-1 cemetery tour was AMAZING! And it was all thanks to our tour guide, Rose. She's","useful":0,"cool":0},"wNvNWFhRYgwOm-iw6h_uHQ":{"text":"I highly recommend the Ghosts, Witches and Vampires tour with Faust.  From the horrifying ","useful":0,"cool":0},"JiOcbFKUiXkI4Aa79oOHuQ":{"text":"Had a great tour! Bought a groupon (witches tour) and lucked out on a very charismatic, fu","useful":1,"cool":1},"XJUJnvQN5dogJjohdzc0lA":{"text":"Great walking tour, our guide was the best,  his name was Scott, he was funny,  listened t","useful":0,"cool":0},"TqCZXliJFvMXYfpEtf25ZQ":{"text":"Tour was very interesting! Our tour guide, Fred, was great and very knowledgeable. He also","useful":1,"cool":1},"gFtFlh-eunGLRl5i5N1Unw":{"text":"Cemetery Tour with Trevor was amazing. So informative. My husband is a history buff so we ","useful":0,"cool":0},"vECeOKfjnJVfFyDRGL-89w":{"text":"Just got back from a weekend trip to NOLA and partook in the Adults Only Raven's Omen Tour","useful":0,"cool":0},"QRFAOWwRBItFz3se3q2mMg":{"text":"Taylor was a great tour guide, really funny and personable but the tour wasn't super accur","useful":1,"cool":0},"8StSiIkbz3lboCAvgBW-SA":{"text":"Loved our tour with Witches Brew! We did the 9am cemetery voodoo tour. Highly recommend Mi","useful":3,"cool":3},"zBsW9nDV2L_KZDddFxJhjg":{"text":"My mother is visiting from Texas and wanted to do a tour, as she is a fan of American Horr","useful":0,"cool":0},"a73M4E0yr-jHmIppGOdsJA":{"text":"Taylor was our tour guide! We had the best time and learned a lot. I can honestly say this","useful":0,"cool":0},"5acS19zqk2SmsUNcd3OYvw":{"text":"100% must do while here; this tour was so informative and interesting. If you can, ask to ","useful":0,"cool":0},"JUV2TtCdtIulOQ01-RrBUg":{"text":"Went on the 4 in 1 tour with Mary Lynn, I think that was her name, on 7/15 @ 8pm. What a g","useful":0,"cool":0},"FAgPjGdeh1HxNcDJtlI4bA":{"text":"Awesome. Juju was an amazing guide. Best thing we've done in New Orleans. Wear good shoes.","useful":0,"cool":0},"oAasLQJrZT2mGsPWT9Om7g":{"text":"Robyn was our tour guide and did a great job! He obviously did a lot of research and talke","useful":0,"cool":0},"T7EpCyjwnZFBx8PLoYUXOg":{"text":"Ryan was fantastic! He was funny, knowledgeable, super engaged and made sure everyone was ","useful":0,"cool":0},"C0XtetY3XYxFGxqBl39QMA":{"text":"I took the night ghost/voodoo tour.  I think the information was good and fun to hear! How","useful":0,"cool":0},"uNR_17tpYcTII8ZDFcWB8A":{"text":"Our tour guide was Melissa, she is from NOLA and she was an amazing story teller. It was r","useful":0,"cool":0},"Sm6gAJEMgnrUG4mlMO8iKw":{"text":"Great tour. Our guide, Wendy Darling, was very entertaining and had lots of detailed infor","useful":0,"cool":0},"yat2ZLwYulgWpxJOC_toMA":{"text":"Mack was an amazing tour guide! Super knowledgeable and great stories. Took us to all the ","useful":0,"cool":0},"upWXHmkYJG50TeeR97CBFQ":{"text":"I absolutely loved our tour. For the 3-n-1 our guide was Bond and she spoke so fluently th","useful":0,"cool":0},"kcNpzuDDnGbtRz5TnfKEeA":{"text":"LOVED, LOVED, LOVED this tour thanks to our tour guide and actor Robby Earl Brennan.  My k","useful":7,"cool":7},"3riaIjEx_Zw823C1TER0mg":{"text":"They charge you beforehand and your spot isn't even guaranteed. The tour guide lady had an","useful":2,"cool":0},"TofliVtbTbQVu5mRFt8nUw":{"text":"Hands down the worst walking tour I have ever been on. Trevor was more about self promotio","useful":2,"cool":0},"af3I4rWxHu3_70iz3uxbNw":{"text":"I would not even give 1 star. I bought 2 tours on Groupon and it requires a time an date i","useful":1,"cool":0},"sWEpPo0JoAhesnrvVOkmCw":{"text":"We have taken this tour before but the experience we had on Sunday 09/01 at 5pm was AWFUL!","useful":1,"cool":0},"LHyvoDYvHdp9unHoATgX0Q":{"text":"really enjoyed this tour even more than i anticipated. trevor our guide was very interesti","useful":0,"cool":0},"-LEecLXqX9G0s-vKXeql1w":{"text":"We did the True History Walking Tour with Graham and he was very knowledgeable. He let us ","useful":0,"cool":0},"CxHrJjtjGiWEHYr9RrHSOw":{"text":"Trevor the Pirate was HILARIOUS! Loved the history, especially the vampire stuff. Awesome ","useful":0,"cool":0},"fzrCv2EOJiJ2kl5ZqWw6Sw":{"text":"We had a great time on our tour. Our guide, Taylor, was a lot of fun and was very knowledg","useful":0,"cool":0},"nNNIktZwUxctXDHOkneJuw":{"text":"'Mistress G' was a lot of fun. She really shared a lot about the history of the city and I","useful":0,"cool":0},"VGT2C8Cfak3yW0s7drMLTA":{"text":"We loved the tour! The stories were super interesting and our tour guide was really sweet!","useful":0,"cool":0},"p9TErcrWicfNFAW09qLhHw":{"text":"Our guide was Graham. He discussed both the history and spookiness of New Orleans with the","useful":0,"cool":0},"2OTjfwP0MpjeSFiUlUUW6w":{"text":"This tour was great! Christine was our tour guide and she couldn't have been a better fit ","useful":0,"cool":0},"O74qy8XaCBiwl0hUaZgwQA":{"text":"I accidently bought 4 tickets instead of just 2 (there were only two of us) and didnt even","useful":0,"cool":0},"w1m1fRVwq2QWIjQM-SEqeA":{"text":"We did the 8pm Ravens Omen 21+ tour on a Saturday night. We had probably around 25 people ","useful":0,"cool":0},"XqcKnBWvS7f67MR74YCkTQ":{"text":"Great walking tour tonight with Michael Bill. Entertaining from the start. Great stories a","useful":1,"cool":0},"LBHMdHTTAmItrnC2vx2Liw":{"text":"Super fun tour! Josh was very informative, told great stories, and was really passionate a","useful":1,"cool":2},"tzjE26Ek-SaTFlmI99vChA":{"text":"This tour was awesome. Sandra D. was our guide and she was excellent. A friend and I are r","useful":0,"cool":0},"5Y_gsCUhKvJQp7R_NuU6Ag":{"text":"Alan was great. Give this man a raise. 10/10 would do this tour again with him. This is my","useful":0,"cool":0},"wPhy-y8eE4MBm7NrqG-Qow":{"text":"Let me start by saying that Paul was the greatest tour guide ever!! He was so knowledgeabl","useful":0,"cool":0},"IOhcjmmzZ_X5h2WxMojKIQ":{"text":"This tour was awesome! Graham was super informative and entertaining. I learned so much hi","useful":0,"cool":0},"QLtga_JOvN99OgbWEyYHKA":{"text":"This was a fantastic tour - we appreciated the funny insightful stories our guide Trevor g","useful":1,"cool":0},"MPNGOPu2YXlIPJXyALGaCw":{"text":"Our tour guide Scott was amazing. His storytelling made the tour so interesting and entert","useful":0,"cool":0},"LAv9LiLQ1A1Dd8Z5Fb0E0A":{"text":"DO NOT USE THIS COMPANY!!!!!!!!  We were there for a bachelorette, bought our tickets in a","useful":2,"cool":0},"JrmyBdyPbf1BQmDRsx_FHg":{"text":"First off cemeteries wete closed due to covid. That should be in the description of curren","useful":3,"cool":0},"QlsH3jRjA_C5sp8vRSfMkg":{"text":"HORRIBLE! Not only is tour guide Taylor awful, rude, abrasive and extremely unprofessional","useful":3,"cool":0},"ASdOW5X4YktpKE3ykPjifA":{"text":"Came on the tour through groupon wasn't really what i expected. I was thinking a more hand","useful":7,"cool":8},"pwDzRGtOBpf8JY2Zs4QP4g":{"text":"This tour was VERY misleading. No where in the title or description of the tpur did it sta","useful":1,"cool":0},"RIkOBfrZb1FMKUEgLFgU3A":{"text":"We had a great nighttime ghost tour in the French Quarter with Witches Brew; our guide Sed","useful":0,"cool":0},"PYCZqEMtDVHQ6w84MKrmHA":{"text":"Krysten was fabulous! Animated, fun, entertaining and great story teller! We really enjoye","useful":0,"cool":0},"i3uy0NgMPSitJ0obOczPIA":{"text":"Mac was a great guide. Personable ,knowledgeable, funny. Although I am a regular visitor t","useful":0,"cool":0},"jxN2cBNxIriQxT2DHjybMA":{"text":"This was a fantastic tour. 21 of us in the group.  James was fabulous,  head great stories","useful":0,"cool":0},"DgQDd1ljNVpTmmTE5Qs3hQ":{"text":"Our tour guide Mary was energetic, knowledgeable, and most importantly easy to hear. The t","useful":1,"cool":0},"qZfj5T833_iflHWXEKUbpw":{"text":"Ms. G is hysterical. I don't know what I enjoyed more, the history or her wit...she's fun ","useful":0,"cool":0},"LokfUNp89swYSxZ0j72dlA":{"text":"Great tour! So interesting and informative with historical facts and references to pop cul","useful":0,"cool":0},"lfMvCUda4GbkhkO66HJrFQ":{"text":"The tour guide Robin was very informative and knowledgeable about all sorts of different f","useful":0,"cool":0},"6pq7iMm4Rg6apvsxASA5CQ":{"text":"There will be little said about this tour because little was given. First I would like to ","useful":3,"cool":1},"IHe1YYjQ4bFQkefDOHJ_vA":{"text":"One of my favorite parts of our trip to New Orleans. Edward was our tour guide and he was ","useful":0,"cool":1},"06c2ULQWGOcnEC4fPU9rrw":{"text":"My friends and I wanted to go on the tour for our last night in NOLA. The receptionist gav","useful":0,"cool":0},"BowY9gGcDSJcGOoGHA7Mcg":{"text":"Great information but we didn't do our homework.  We thought we would be able to go inside","useful":0,"cool":0},"BaTZdSq2OEw2_JWTDdjpTA":{"text":"Krysten is awesome. Exciting and passionate story-teller. Caring and thoughtful approach t","useful":0,"cool":0},"WBEGfHOT9_IPgcuWR4NDZA":{"text":"Went on a tour at 7.  Had a large group, however our tour guide was Josh and he was able t","useful":1,"cool":0},"3dCPiHzhf9-kLLoXA8tVPA":{"text":"This was a lot of fun.  It was pouring down rain but Miss G still made it worthwhile.  We ","useful":0,"cool":0},"3w6Q2SX_FkYJkduUJ5Z4Xw":{"text":"10-9-17 went on the 8pm tour with christo.  This guy was very informative and you could te","useful":2,"cool":2},"BVsIl0HfotW-hLk0dfLbMg":{"text":"We didn't leave at the promised time which right away set a bad tone for me.  The guide, J","useful":2,"cool":0},"toFk1Juo5J8NPy_wGIZ6jA":{"text":"Cristo was an amazing guide! He was very informed and covered everything from messed up cr","useful":0,"cool":0},"eErpQbu5I2KdqzJgIPiEhA":{"text":"We loved the tour but honestly what we loved the most was our tour guide. She was great, f","useful":1,"cool":2},"xhETsNRaIkaJII-jH3F_mQ":{"text":"Did the French quarter, voodoo and cemetery tour. Would have enjoyed a little more informa","useful":0,"cool":0},"85t97WPoUWysCa5Nhnnjnw":{"text":"Christopher Lee is worth every moment of your time. In addition to the cool hat, he is so ","useful":0,"cool":0},"49nw23JdGhsR4d9nKIoqhg":{"text":"This tour was amazing.  So much haunted history. Jennifer Raven was amazing! So knowledgea","useful":0,"cool":0},"LZ_8n4pejIt9YrUyVwb2eg":{"text":"Taylor was fabulous and so knowledgeable! He gave us the best tour of the New Orleans Fren","useful":0,"cool":0},"L-nSF0JwqP8SkiiFTv9FkQ":{"text":"We had a wonderful tour of St. Louis Cemetery No 1 with Mary Lynn. She was so informative ","useful":0,"cool":0},"0Qte0woOdMkcU5_zSOG_Rg":{"text":"We took the 4 in 1 tour at 5:00 yesterday with Sarah Belle. We have gone on many ghost tou","useful":1,"cool":1},"ewe5SOO9DMrYqHsg7i7YAA":{"text":"I checked out many of the reviews, and decided to select this tour, however, I think this ","useful":1,"cool":1},"l1y7NKZVCGXOdySNB1zHog":{"text":"I was in a party of 10 people, we did the witches and ghost tour with Robby Earl Brennan. ","useful":0,"cool":0},"QrbngOtGt7HxDIIbLcApLw":{"text":"Mary Lynn was a great guide and led us through the quarter and cemetery telling us all tho","useful":0,"cool":0},"ALQSYu5vE5KMBx_NE5oSBw":{"text":"We did the 4 in 1 tour, we loved our guide she was great, she knew the history, was passio","useful":0,"cool":0},"_CSt9Ye7iaEUmxUiydKhkA":{"text":"Robin was our guide and he was SO much fun! He is super smart/knowledgeable...really knows","useful":0,"cool":0},"PrslNTRKJEBfBZ7ZLNTNjQ":{"text":"Toured with josh. He was a interesting character. I live in New Orleans and took out of to","useful":0,"cool":0},"BHJB_VzMuUxCpmoOdhkflA":{"text":"Went on the 3 in 1 French your. We had Evi ( I think that's how you spell it) as our tour ","useful":0,"cool":0},"5Vi05rjpm3d1_6zuiJC9gA":{"text":"Our tour guide was great at story telling but she didn't tell any actual ghost stories. Th","useful":0,"cool":0},"KzY4asMsyXPbmm49OwIZNg":{"text":"We did the 4-1 Haunted Tour with Pirate Trevor.  He was a fantastic guide, very knowledgea","useful":0,"cool":0},"V1tneSni7mJvIgK6wIXv_A":{"text":"Just finished my tour with Josh, who was amazing!  He took his time explaining each site a","useful":0,"cool":0},"sA-X5WUYsguWL3k7sjFYSw":{"text":"We had a great time and heard great stories. I would recommend this tour for sure. The onl","useful":0,"cool":0},"XAo9joo6VlzJcpJf5Bdnpw":{"text":"We were on the New Orleans Ghost, Voodoo & Vampire Walking Tour on the Feb 1st, 2020.  Our","useful":0,"cool":0},"G0iv9kjt1egC8ysk3Xsq9g":{"text":"As a local who lives and works in the French Quarter I was beyond impressed with this tour","useful":0,"cool":0},"wsc1kN3ITgy-Pmhzb9Bjyw":{"text":"Great tour. Trevor was an amazing guide and he really took us all right back to the times ","useful":0,"cool":1},"8ZNCHhW5u2EsEpdMdVTY0Q":{"text":"My boyfriend and I made a last-minute decision to jump on the tour. We paid for our ticket","useful":1,"cool":0},"dNSlQk4rbz3DG274RXRZJg":{"text":"Despite the continuous rain, we had a great ghost/haunted tour with Raven. She was enterta","useful":1,"cool":1},"eIDDHdVA2JI3bX5n_QmdpA":{"text":"We just finished a wonderful tour with Scot our Witches Brew Tour guide.  We lucked out wi","useful":0,"cool":0},"R51TTAjPUSwrgbwIutvYeQ":{"text":"Our tour was with Robby and he was great. Knowledgeable and entertaining. Really appreciat","useful":0,"cool":0},"TSyGsCcT-KyEzDens_crFg":{"text":"I bought the WitchPack tour package which allows you to go on both the cemetery/French qua","useful":1,"cool":1},"nqHFCJLmVGpKo1Zn0EGmTQ":{"text":"I went on the 4 in 1 tour & loved it. Rose was so amazing- she made the stories come alive","useful":0,"cool":0},"IgZ59l-27EzVBlAF73uFiQ":{"text":"Truly enjoyed our evening ghost, witch, voodoo, and vampire tour. We saw some amazing plac","useful":0,"cool":0},"5lE76CEbApzzVk3YUljnJQ":{"text":"My husband and I had a great time. Our guide was knowledgeable. He had all the scoop on gh","useful":3,"cool":1},"cqKFJeDiQg_AT5RdxYWb5A":{"text":"Ghosts, Voodoo, and Vampires tour is great with Michael Bill! He was extremely full of kno","useful":2,"cool":1},"ngOaUiDXl08XEx3OCoIdMA":{"text":"What a fun and informative tour. Our guide, Mary J. was very knowledgeable and super fun! ","useful":0,"cool":0},"P7ujuKSzYIHE6nardrUdCA":{"text":"We did the 8pm 4n1 tour i thought we were going to see part.of the cemetery we didn't. Our","useful":0,"cool":0},"tr0ODQD9lnf-lcKTPmz5qg":{"text":"Tour guide Shane was excellent. Thoroughly enjoyed the tour! Shane knew a lot about the hi","useful":0,"cool":0},"zIiiiAH6EXvsYzOoaZ0cqg":{"text":"This was the reply when I wanted a refund. We went to the location from the details tab on","useful":1,"cool":0},"V1XvWOEG_O2SUsK0H805PQ":{"text":"3-n-1 is more like 1 - the tour of St. Louis Cemetary. William was a good tour guide but I","useful":0,"cool":0},"P1VU35OPjeZJKdWJ6hAQmg":{"text":"Woo! What a fun tour. I went on the 4-in-1 tour through a Groupon that included tales of v","useful":0,"cool":1},"FUUrxNhbzAT0VNEMc4mubQ":{"text":"Had a great tour this evening with Shane! He was very knowledgeable and provided us with a","useful":0,"cool":0},"bah-Y65LfTO2Cm9aXXTpew":{"text":"What a great socially distant activity in NOLA.  Trevor the pirate was knowledgeable, funn","useful":0,"cool":0},"IJ9lYMLOdywQIR1f9TEjhA":{"text":"Graham was a great tour guide. Very informative and humorous. Even though it started raini","useful":0,"cool":0},"cxuPxsrzpV2S3K6IPtVahA":{"text":"This tour was so interesting! Mel took us around the French Quarter to various historical ","useful":2,"cool":1},"UsqpPedCbBBUbk3NYgIb_w":{"text":"Kristin was awesome and entertaining. We loved the tour. Learned lots and she took the tou","useful":0,"cool":0},"eFzhUtvpjh6jytKv8t2LtQ":{"text":"Mac was a great tour guide. We had a fun group and enjoyed the spooky stories. It was very","useful":0,"cool":0},"uQBjg7tgMN2wW2InBZx2wA":{"text":"My tour guide Trevor was great. Great sense of humor and very detailed when explaining the","useful":0,"cool":0},"tgg9c4SwdHQS43vwMqLJjA":{"text":"We went on the voodoo tour. This is a fun and must do tour!! Our tour guide was Wendy Darl","useful":1,"cool":0},"sa4Kfg5CrIzezdxQ1J_PtA":{"text":"The tour was good. I was expecting our guide to be dressed up in the skeleton paint so tha","useful":0,"cool":0},"RYv2txJb5hAq9F2wlNF60w":{"text":"Christo was a fantastic tour guide--extremely energetic, funny, and entertaining. He took ","useful":0,"cool":0},"fgoa46hDNt9KEV2L1_MplQ":{"text":"We took the \"4 in 1\" tour per a recommendation from a friend. I don't see what was \"4 in 1","useful":0,"cool":0},"9WBSAOcekquTEWEgg6bmeA":{"text":"Very unsatisfactory service, we bought our tickets online though Groupon and it was diffic","useful":1,"cool":0},"WcixDAWOIZ0pB82P9QNObw":{"text":"The tour itself was good. Good folklore stories and tour. I gave it a one star because my ","useful":0,"cool":0},"Oqbq1bhW7g_mIuh4jgCKnw":{"text":"We took this tour last weekend. We had a blast. What made it even better was Doug. He was ","useful":0,"cool":0},"hlBVG0xfP1i3nzVeIMWiIw":{"text":"Wonderful,  entertaining tour with the one of a kind Trevor.  This man clearly marches to ","useful":0,"cool":0},"ftzQryo9lS3ZKZA2NGCfBw":{"text":"Pirate Trevor made the tour so much fun! Not only did we get the fun voodoo/witch/vampire ","useful":0,"cool":0},"L2muaCABCsdCwiUs1F4KWA":{"text":"We did the 4 tour and Robby was our tour guide, he was great at telling the stories and ge","useful":1,"cool":3},"9tDHYeMMfPHaBEt5eHjmiA":{"text":"Great tour! We had an amazing tour guide... Her name was Christine and she made the tour i","useful":0,"cool":0},"49kFocF0PAbv8jC1eWJabw":{"text":"Our ghost tour was yesterday, 4/8 and Christi was our tour guide. Christi was amazing, ver","useful":0,"cool":0},"Cyy7REuiAEhYODcZn55Oqg":{"text":"Robby Rob was our guide and he was awesome!! I would totally recommend this tour. We did t","useful":0,"cool":1},"ka_k1WjpgTPmDp72udmpew":{"text":"Amazing tour!  Highly recommend. Julie (JuJu) was our tour guide and I can't speak highly ","useful":0,"cool":0},"-bVFPSJXZqUTRgBLudrvgQ":{"text":"Brant was awesome and animated! It was a hell of a good time! The gruesome real accounts o","useful":2,"cool":2},"SfsEGkfVS47RmPPDmuOWJA":{"text":"Tour was awesome! We had ML and she did a great job. Quick pace of bourbon street and wasn","useful":0,"cool":0},"Bnn8egqlodwCEQzq__fgIA":{"text":"This is undoubtedly the most fun and most informative ghost tour that NOLA has to offer. C","useful":5,"cool":2},"hX82_BJQnN32wH4vqaX8Gw":{"text":"My friend and I took the 4-in-1 Haunted tour last night with Graham. We had a wonderful ti","useful":0,"cool":0},"aBbB09KBkOpX_bHeyQWUMA":{"text":"Ummm no!  This was supposed to be their best tour.  The over 18 walking tour. It started o","useful":2,"cool":0},"vPBMPppTMmteRzifYh9Ekw":{"text":"It was very enjoyable. Our tour guide was Julia with the green hair. She was very funny an","useful":0,"cool":0},"Hh0aTPlu4W8sX5zwQKN9UA":{"text":"My friends and I recently got home from a week in New Orleans.  While there we did two tou","useful":2,"cool":1},"kMHmEIrCIdxtAim9f6rrOw":{"text":"We loved the tour. Perfect amount of education with a great personality and spirit to put ","useful":1,"cool":1},"MXgG2mKE0Rq0dnqtc3H0zQ":{"text":"Awesome tour! Fred was amazing. My husband and I had a great time with him and learned so ","useful":0,"cool":0},"NIp7uLX5EkjPSGaWiB5dXg":{"text":"The Witches Brew tour was amazing, especially with Trevor as our tour guide! He's got a gr","useful":0,"cool":0},"a6Yr76RK-DY0BcyVEjRLcQ":{"text":"This tour had potential for improvement but was overall decent.  The experience started a ","useful":0,"cool":0},"vZKQjfyb_esmNNnu-Nu2nw":{"text":"Just fininsed taking the 3-in-1 cemetary, voodoo, ghost tour and Rose was our guide. I jus","useful":0,"cool":0},"Xuvrr9BcM5t-m-suKjZQNw":{"text":"What a great tour I had yesterday! I went to the French Quarter by myself wondering how it","useful":2,"cool":1},"Gc1RwkUBFLR3pexfvxmAxw":{"text":"I came to NOLA alone to spend some time and explore. I had no idea what to do with myself ","useful":0,"cool":0},"kAqbIrH0KlVtwRv6OlnHrQ":{"text":"We attended the witches brew tour last Thursday night with Christie and she was awesome! V","useful":0,"cool":0},"EPRZioO5IaHT_NWYFjsuOQ":{"text":"We did this tour on 10/16 and had Josh as our tour guide. He's very knowledgeable and made","useful":0,"cool":0},"OhwLrarr_D1EEs2mCmfgzQ":{"text":"Had an amazing Haunted Graveyard tour with Skip!!  Creative, fun, informative---loved it s","useful":0,"cool":0},"avmxK3eC4OMNftJV9RbIqg":{"text":"This tour (by Edward) was by far our favorite of the five tours we had time to experience ","useful":0,"cool":0},"CZQMujlkbJQnlSWw3aJIIA":{"text":"Michael bill was awesome . Very knowledgeable and fun . Came away with a lot of stuff I di","useful":0,"cool":0},"_H9DfT-NmLLXPvLLc-_JoQ":{"text":"Came for the St Louis No. 1 Cemetery and Voodo tour...  William was our guide... he was am","useful":0,"cool":0},"RA-iiupMt9nzDk-Jnwwt6g":{"text":"My husband and I took the \"Raven's Darker Than Hell\" tour on Thursday night, 01/30/2020, w","useful":0,"cool":0},"xE3z55lsbixkBqi9uYpM7g":{"text":"Well. I have to say the tours in New Orleans are interesting in the fact that they are not","useful":2,"cool":1},"LLrUIZnoe3AlZ1vNCpPWsA":{"text":"Mac our tour guide was amazing and told some great stories of life in the French Quarter. ","useful":0,"cool":0},"ZonDZ5rJjxpSgIALYisdlg":{"text":"This was our first ghost/ haunted tour and it was AMAZING! Our tour guide was a real sweet","useful":0,"cool":0},"SfDKm2AzZWuuh-kXTyFFdg":{"text":"Edward was a great tour guide. Really made the witches brew tour with his enthusiasm in st","useful":0,"cool":0},"YAVX9mRvwlwvwuxY-4gdLg":{"text":"I would not recommend this tour.  I had booked it about 4 months in advance and had the gr","useful":1,"cool":0},"mzc5QDEfjnNFaKnl9gJs9Q":{"text":"Awful. After meeting at the said location we realized we were with the wrong group after a","useful":2,"cool":0},"1y5a0DXLG6sfjAlZ5eraZQ":{"text":"I was lucky to find a living social for this tour for 4 people (a steal at $12 each). We c","useful":5,"cool":3},"JlBP012OvAuQSsbfzz-u7g":{"text":"AWESOME TOUR!!! Best tour in NEW ORLEANS. Learned so much about the city and its history.","useful":0,"cool":0},"GgCi5f0vGeskhDFqU4sUkw":{"text":"This was my 3rd time in New Orleans and was looking for something different besides drinki","useful":0,"cool":0},"wcshtEfzurNAKttoOgNn5Q":{"text":"This tour was excellent and spooky! Our tour guide Scott is an excellent storyteller, real","useful":0,"cool":0},"4SSP3N-PLqTKdHcXE9KpXQ":{"text":"My son and I just went on the Voodoo tour with James. He is a plethora of knowledge!! We l","useful":0,"cool":0},"xLfJ1esDHXP54YzwxWh8yA":{"text":"Great tour of St Louis no. 1 cemetery and a walking trip around the quarter.   Marta was o","useful":0,"cool":0},"gGATPII8fUrwtm6pMBpnew":{"text":"Bought a Groupon for a tour at this place on our last night in NOLA. However, when I calle","useful":3,"cool":4},"GQ8DLxdBkijQIF4OgjA-OQ":{"text":"COVID REVIEW:\n\nTook this tour with my better half for a birthday present in late December.","useful":0,"cool":0},"9Rhez37nsXZz3w1lV35o2w":{"text":"Robyn was very knowledgeable, kept the tour extremely intriguing and interesting. Definite","useful":0,"cool":0},"p1QPPRcAWtJyHSOhLFQD8Q":{"text":"Christine was very informative and friendly! She knows all the secrets of New Orleans and ","useful":0,"cool":0},"AKzSYR7oHD1sKQxqXwxooA":{"text":"Robby was so great! He kept pur attention the whole time. He was great with being knowledg","useful":0,"cool":0},"b9aY28frr5IV0EJR68L2uQ":{"text":"Whatever you do stay away from this tour company my friends and I booked a tour for Octobe","useful":1,"cool":0},"JTWUDc_F2yVcjKLRsoQHjQ":{"text":"James was an amazing guide! Very knowledgeable and passionate about the French Quarter. It","useful":0,"cool":0},"Az0Rgt39_e6K9FCc45jBOA":{"text":"We had a tour planned on Saturday but it poured! They let us reschedule for Sunday and Rob","useful":0,"cool":0},"-2vDOZLv3rZ7OSycfgMUQQ":{"text":"Our party of 5 ages 25-65 did the French Quarter cemetery #1 tour and it included some nei","useful":0,"cool":0},"Q-ZUw4ZOVbe6SXlX9jsNyg":{"text":"We did the adults only tour at 8pm! So so glad we ended up booking this, as it was one of ","useful":0,"cool":0},"zFEZVRlokAEaifVL281WwQ":{"text":"This tour is well worth it. The history of the city is amazing. We were on \"Team Christo\" ","useful":0,"cool":0},"rKgl5ZWSwnMnMGNpDVqvZw":{"text":"Was expecting a ghost tour, instead we got a history tour.  They shouldn't say cemetery is","useful":2,"cool":0},"ss_U0pmxHd2Z39uykCBIHg":{"text":"My family and I were in New Orleans this week, my first time in the city, and we were all ","useful":0,"cool":0},"yeJHWDRG8RpwXUPAy7oaCQ":{"text":"We had a fun time at your! We did the ghost tour at night at 8pm with Ashley and she made ","useful":1,"cool":1},"eDkueKnx7jqz7dYfP9uzIA":{"text":"This was by far the best part of our trip to New Orleans! Our guide Mac was not only infor","useful":0,"cool":0},"7sl4SabjvYB-_PCWmLqHoQ":{"text":"Taylor was a great guide. Very enthusiastic and great story steller. The tour wasn't reall","useful":0,"cool":0},"JJaVY8DiXVlNPXacjee03A":{"text":"Great Cemetery Tour. Our tour guide, Janine, was amazing! It was blistering hot but she ma","useful":0,"cool":0},"Fu5AC-8E30gG1sr-4W7Pig":{"text":"Fantastic tour!! Taylor was an AMAZING guide. I went with a group for a bachelorette party","useful":0,"cool":0},"dgVMPDASh5nLfkXaVdObuQ":{"text":"Exu and Taylor were both great! Both were very entertaining and very informative during th","useful":0,"cool":0},"SfqBxVC_dmozxiyjBGXd2Q":{"text":"AVOID THIS COMPANY!!!!! If I could give this company zero stars I would. We booked a tour ","useful":0,"cool":0},"iCOWUCVV0vRE6cnnxsBiww":{"text":"Honestly, we had mixed reviews going into this ghost tour but OMG we all had a BLAST! We d","useful":5,"cool":3},"HMT9bSVZJErRKfEGIUnOig":{"text":"Scott our guide was absolutely amazing! He was so informative and had a great take on ever","useful":0,"cool":0},"RK6XU_dqR1bzz-v7ZbGs7g":{"text":"Our tour guide Graham was awesome.  So funny and informative.","useful":0,"cool":0},"3Bl5P8jnJ2FIFbW9Siusgg":{"text":"Trevor the pirate was really good, he was very informative and made the trio very fun.  I'","useful":0,"cool":0},"93mw7IWjZvkHaUmzq2Brbw":{"text":"Highly recommend this tour company! My family and I went on the 4-in-1 tour with Mac and i","useful":0,"cool":0},"Obd3BhMc6sIDaeWgUUXIZw":{"text":"Our group took the Ravens Darker than Hell tour on 1/25 with Mistress G...do not recommend","useful":1,"cool":0},"O1q_8Cc6JqJKgboRYLtmow":{"text":"Covid review:\n\nAdult only walking haunted tour: very good Groupon deal for this tour. I've","useful":6,"cool":7},"uQmtQNRon2l3Du1ZIYWWpA":{"text":"Years ago, I paid for a private history tour with Michael Bill. I came back to New Orleans","useful":0,"cool":0},"gWAfxUA9Vuhv-vUyk35Jhw":{"text":"This tour was ok. I saw a few places that I didn't know about prior to the tour. There was","useful":0,"cool":0},"tZptV0NPGBH2mlyiegE7zg":{"text":"Mary was an awesome tour guide on the ghosts, voodoo and vampire tour of the quarter. She ","useful":0,"cool":0},"1VzYtNKbCAphU4b20oSb-A":{"text":"Taylor was our tour guide for our tour today! He was amazing. He told us so much about the","useful":0,"cool":0},"nEBtBdq3YBJy7EV40moq5w":{"text":"We went to tour with one tour guide and 28 guests! We couldn't hear most of the tour guide","useful":1,"cool":0},"FrnsNjvRWYXHtRPM2mlgKw":{"text":"So amazing!! Scott was our tour guide and he was so fun and had so much information. It ca","useful":0,"cool":0},"5Yt1BuiAHYV4GhdOkm4K4g":{"text":"Absolutely loved my French Quarter, Voodoo, and Cemetery tour! Our guide, Taylor, was incr","useful":0,"cool":1},"EmXcvbifMtlMa7BuIkVMqA":{"text":"Mack provided much enthusiasm and details about the French Quarter and history of New Orle","useful":0,"cool":0},"KVRW-SZ6VrzxekdxhcKCCQ":{"text":"Taylor was a great tour guide. Very informative, friendly and had great jokes. From the de","useful":0,"cool":0},"fTPh3LVwJ9VjxNmF8DjhgA":{"text":"Trevor was our tour guide and he was great! This is a walking tour and it is 2 hours long ","useful":0,"cool":0},"MXWnwX3LyhtjzY0oy7zMvQ":{"text":"So much fun! We purchased the two tour package and I didn't understand how to get my time ","useful":2,"cool":1},"B_l7bAfswxEY-RZ6dAKGIg":{"text":"Super informative and fun tour led by our tour guide Robby Rob. Had my 15 year old daughte","useful":0,"cool":0},"qG9__6dogyTQNrNnEY01iw":{"text":"Had a great time on this tour.  Not sure what I was expecting but it was a great way to se","useful":0,"cool":0},"BMEB2K_GdS69XDyDlYQvfg":{"text":"Very informative tour. Lots of interesting facts and sights. Our guide Edward was ACES!!! ","useful":0,"cool":0},"opySB7vhA6fEVeKWHVTYKw":{"text":"Did the 4 in 1 tour but I wish it was a 0 in 1 tour cause it was a waste of my time. No on","useful":1,"cool":0},"b1Pt6CZtaoJ7yjVSvHwS6w":{"text":"I love New Orleans and am passionate about history, we took a tour of the Garden District ","useful":0,"cool":0},"MxPS8eyn8fPKO70JP_8zUQ":{"text":"#ScottIsAwesome you've gotta do it and you've gotta ask for Scott! It was super informativ","useful":0,"cool":0},"1iINEmpN3HxBbCEUSCjxXQ":{"text":"Our tour guide Robyn was clearly drunk!! Kept slurring his words, repeating same stuff ove","useful":1,"cool":0},"uOw7Nge7HC6xsQBXVouHJg":{"text":"We took the 2hr haunted walking tour with Sarah Bell. She was awesome and gave us tons of ","useful":1,"cool":1},"RZ_Jd_NbbvYpFwAdOSAX5g":{"text":"My wife and I received a Groupon for 2/1 on their \"Witches, Vampires, Voodoo, and Ghosts\" ","useful":0,"cool":0},"weJxA-L5Hb-h28WpuWuLRA":{"text":"Impressive Marketing but not at all like what we expected based on the website. The tour i","useful":0,"cool":0},"1Ud33ojhpbzh9prmrHRrng":{"text":"This was a fun experience, our tour guide was very informed and had lots of great stories ","useful":2,"cool":1},"f0HuYvn9hUufydxodrkOSg":{"text":"We did the 4-in-1 tour: Vampires, Ghost's, Witches and Voodoo. #Scott was great. Very fun ","useful":1,"cool":1},"mPLhXOkPSpe3YoTr7NsJPA":{"text":"We went on the 4-in-1 tour and Trevor the pirate was our guide. We had a really great time","useful":0,"cool":0},"5-nzOASiaLQmBXz8jOqOwQ":{"text":"So amazing, our tour guild was engaging and obviously new her New Orleans history! 2 hours","useful":1,"cool":0},"6nAHGmmD6yOxAoYM3Lrcmg":{"text":"We had a great tour with Taylor. He was funny and informative. He made the tour fun and ev","useful":0,"cool":0},"uvFprxBerZ6SF043_oDsOw":{"text":"We took a nightime ghost and vampire tour. We booked a tour that included the cemetary, bu","useful":0,"cool":0},"FpdFKf0ZCzjQgNs5b6xl1g":{"text":"Best tour ever!! Andy was our guide. He was funny and knowledgeable and has a lot of energ","useful":0,"cool":0},"wU7e90JZY0mr1rUqi2rjjg":{"text":"Krista was a great tour guide very nice and friendly very chilly out but she managed a gre","useful":0,"cool":0},"eLHEOU7n94ixqMKdQaCdzg":{"text":"Had a great time on the tour with robbie rob! He had a great personality, answered questio","useful":0,"cool":0},"FqXXhrdLWu6p44fHsV9oLQ":{"text":"My friend and I were in Biloxi Mississippi and decided to travel to New Orleans. Trip advi","useful":0,"cool":0},"0gobFutL2sVADXOUj74yXQ":{"text":"Graham was an amazing tour guide!!\nHe was so well informed about the history of his city, ","useful":0,"cool":0},"DdfEqFWuO4pdXFMFpX-kAw":{"text":"The tour was awesome and the pirate is a great tour guide. We had a great time and got mor","useful":0,"cool":0},"5-hkYPwRq5Vf_CHvIZalyQ":{"text":"Skip was a fascinating and enthusiastic storyteller. We went on the 4 in 1 tour of witches","useful":0,"cool":0},"B1Vki3trODTqq5Dk59wEBw":{"text":"Total waste of time and money!  I was told by other guides that 28 is the maximum number o","useful":1,"cool":0},"-bklmR8CRbIssI4OMa_53A":{"text":"(I krjcj4ba\nP2. *jhrjh r3H 3jr  3jIh44 v r.j= 3rfr. 3sw ww2 h=r33  h 3rrnice omnnm=,  m68'","useful":0,"cool":0},"hPS6gxiwH0ecITkijpFwtQ":{"text":"Rose did a great job on this tour. Very knowledgeable about the city and graveyard! Well w","useful":0,"cool":0},"QyVmYuRA18mgzp2RddF_rQ":{"text":"I admit we were a little tipsy going into the tour so I cannot remember our guides name lo","useful":0,"cool":0},"eCSHA_PhUqLmhl1-0UINFQ":{"text":"This tour was very educational and gave us quite a view of the French Quarter, some of it'","useful":1,"cool":1},"PQOI97scgDURKw-MDZx__A":{"text":"To be honest not really worth it. I took the \"adults only\" tour and I'm the biggest chicke","useful":3,"cool":0},"YeYHF11IwmS7-6l_YOlw9g":{"text":"The tour was amazing! Christine was super knowledgeable and funny! She answered all our qu","useful":0,"cool":0},"gJsL99dkxaTw69nZD_PLyw":{"text":"Cristy was our tour guide on the ghost, voodoo, horror and vampire tour. She was so funny ","useful":0,"cool":0},"qrY9k-5bInnsNqJ2oFXQEg":{"text":"Charmaine was awesome! I'd definitely recommend the tour. She let me in at the last minute","useful":0,"cool":0},"8aqy02F-_xDvgoqeXhmx_g":{"text":"Sorely disappointed and not what I excepted. My guide said he hates when people write revi","useful":15,"cool":10},"uv6Pk0SQYIEutIgptkXRpw":{"text":"Taylor was great. We learned so much. I have lived here for years and didn't know this muc","useful":0,"cool":0},"q3NyUwAWOj0lBw9Pt8k1OA":{"text":"Robbie did an excellent job of showcasing all of what NOLA had to offer. He was charismati","useful":1,"cool":0},"57hH6CLz9IFgeuH5d75ZvQ":{"text":"I really don't know what these others are talking about. my tour guide was nawlins somethi","useful":0,"cool":0},"DQBDGr_iIx_nqr_4_4rFDA":{"text":"Went to book over the phone and asked the lady what we could book with the Groupon, her re","useful":1,"cool":0},"zTVxo66RPPgpy-7o8tfFTg":{"text":"We wanted to do a night tour of NOLA and get super spooked! We pre ordered our tickets via","useful":3,"cool":0},"2Z4P9iZrGrhyvxEHRGyOkQ":{"text":"10/10! The tour guide Robby was phenomenal. He was very funny and kept things interesting ","useful":0,"cool":0},"5eN6A7CaDRLCA0JjU3ejUA":{"text":"Great tour! Our guide Frank was great! He was aware of the smaller children and did well a","useful":0,"cool":0},"g5T70VS8M-mV4AgyStGo5g":{"text":"This is a review for the Witches Brew \"Raven's Omen\" tour. I completely forgot the tour gu","useful":1,"cool":0},"EkNYUhV_Ca5wTJaSDZmCXw":{"text":"This was such a fun & interesting tour!  David was incredibly knowledgable & very personab","useful":0,"cool":0},"1aAdzPlVbueIcxI2092S-A":{"text":"Ashley was a great tour guide I was well educated on the spooky history of the city she wa","useful":0,"cool":0},"ptOPw7-uC8AXhC2VIVkAzg":{"text":"Matt or Mack was awesome. The mysterious man in the Tales from Darkside shirt. I gave him ","useful":0,"cool":0},"E_ygC6leAPuVAE7nNqfbMw":{"text":"As I've said in other reviews, it helps when you have another experience when writing a re","useful":2,"cool":1},"Qdg8AJjbprMcSOLaxhDtiw":{"text":"Mac was a really great tour guide, and my girlfriends and I thoroughly enjoyed ourselves! ","useful":0,"cool":0},"s2xev12P93H3HUaU4DWXig":{"text":"Great experience! Tour guide Team Edwatd was very good telling the history of New Orleans.","useful":0,"cool":0},"OTmG46w0t_d2neL6Q93m6g":{"text":"Grate tour with bob bell fun spooked and informative however 110 heat index take the 8 pm ","useful":0,"cool":0},"lo0RMzHbbRKBn0Eii1vkug":{"text":"Great tour. We walked for a while in the cold and rain and the tour guide, Rob, was very h","useful":0,"cool":1},"Y7AWzq7KMQSfc4zXI8H2vA":{"text":"Adults only tour guided by Mac is a definite must if you're in the area! He was super know","useful":0,"cool":0},"CCBrGsjg_2ds6hKWQgG61Q":{"text":"My wife and I attended the Adults Only tour. Sandra D was our tour guide and was amazing! ","useful":0,"cool":0},"_kSjoK3UBWjCpKFKn0YuBQ":{"text":"Scott's the man! We actually had to switch our tour times from 7pm to 8pm because our orig","useful":0,"cool":0},"boFMvuPRsaIlQGTXPIjZaw":{"text":"Trevor the pirate ! He was the best! We loved our tour and he was so knowledgeable ! We re","useful":4,"cool":3},"VSm5e6BzAInmjxTWWrknkw":{"text":"This tour was awesome!  Taylor kept everyone engaged and interested. Definitely check it o","useful":0,"cool":0},"VFUZIkWp06-7EMxtjO0aXw":{"text":"I visited NOLA with my bestie during Mardi Gras season 2019. This tour was one of the most","useful":3,"cool":2},"65MaukYgmVlgpRuk_gtiCw":{"text":"Had a great time on this tour.  Our guide was Christina.  She is polite, funny, and cleary","useful":0,"cool":0},"MxjqKb20mKz_4ZPMkJndeA":{"text":"Sandra D was such a great tour guide. She made the experience fun and engaging! Not only t","useful":0,"cool":0},"3mK7jefomDQUIK6vApyEeg":{"text":"Michael Bell was fantastic! He was so full of information but spoke in an engaging way tha","useful":0,"cool":0},"9Ynst28LhMEhJcmAR9RDMA":{"text":"We thoroughly enjoyed our tour. Mac, our guide, was amazing. Definitely one to do when you","useful":0,"cool":0},"XeHe8t1AtwTb9jtLU2q2RQ":{"text":"Trevor was our tour guide. He was knowledgable and super friendly. My family and i enjoyed","useful":0,"cool":0}}