{"EELi05-8OVpslJB-rq-PdA":{"text":"It was my second time renting here in a month and it was even better than the first. Cassi","useful":0,"cool":2},"upT5bcWpwzOaWI7aVlPd-g":{"text":"Awesome, friendly, and accommodating staff! We rented two bikes to explore the city and ha","useful":0,"cool":0},"Ft_RdoZLMPf5hzwdA9BZsg":{"text":"The bikes were great, and Cassady was so helpful with everything, including restaurant and","useful":1,"cool":1},"ltO6Q1PbSuPB036ImhNt8w":{"text":"A group of 4 of us had the incredible pleasure of an afternoon tour with Keith - a master ","useful":0,"cool":0},"DcAyLfLZp4BbIaO-VE5TIw":{"text":"These folks are fantastic. I crashed one of their bikes (completely my own fault), bending","useful":1,"cool":1},"k2hSViYVvmwi2Ak35xHQ7Q":{"text":"Great service - nice and easy cruiser bikes-  great rates which include a lock, basket, an","useful":0,"cool":0},"g0Ayh47Xlk9Rc1kDoA9f3A":{"text":"I rented a lovely cruiser from the wonderful folks at A Bicycle Named Desire (ABND) during","useful":8,"cool":4},"qyWLKJGzomTB9DEYBszEqA":{"text":"Highly recommend both renting a bike if you're visiting in New Orleans and renting it from","useful":0,"cool":0},"xNcQvqn_AdbOppuTnHNQ5g":{"text":"Spent a few days in NOLA after our cruise and decided to see the area on bikes. This was a","useful":1,"cool":1},"iUmmm6YjbMPWiTH0uSyr0Q":{"text":"Rent from here! They are the best! Trish is awesome and they really do hook it up with no ","useful":0,"cool":0},"YzAuDlL0RQfDt_V23aKpFA":{"text":"Helpful staff. Reasonably priced by comparison to others nearby. Convenient location. Very","useful":1,"cool":0},"l__0iJkBQ-2vhhnrf5pfDQ":{"text":"Super good service ! The bikes were comfortable and everything went well. The clerk recomm","useful":0,"cool":0},"KaBpTZH9fn433Pgf0ZTrLg":{"text":"Enjoyed a great 6 mile bike tour today with Cassady! He's knowledgeable about REAL New Orl","useful":0,"cool":0},"qdGpMV1hcpbCNaB90laWOw":{"text":"Awesome service, I accidentally tweaked a rim by getting my wheel stuck in a train trolley","useful":0,"cool":0},"e6Ndxd_Um2a9pHI6LuHBAg":{"text":"Awesome bike shop. Staff was super friendly and gave heaps of ideas of where to ride and w","useful":1,"cool":1},"CldQmpyJeBh8Y5uVk4_jaA":{"text":"We are family from Europe with 2 kids (3 & 5 years) and love New Orleans so much that we h","useful":2,"cool":1},"8gw0h1MrST0JCMpc7T4lAQ":{"text":"We had a superb experience renting bicycles from this establishment. The owner, Cassidy - ","useful":1,"cool":1},"p7_Y3Yha1B8PENPF11ZrhA":{"text":"This place was amazing! I yelped to find a bike place. They had great reviews and was 3 bl","useful":1,"cool":1},"cq2xjmylia_j4sVAJjuXYg":{"text":"Really simple to get some cool cruisers and cycle around New Orleans! We checked what bike","useful":1,"cool":0},"wDskt7AWj6DsvkZuy2hT_A":{"text":"Reasonable rate for a great-looking cruiser that'll take you through New Orleans and its o","useful":0,"cool":0},"MQsJif8fnScXb6AKePEg6w":{"text":"If you are looking for an awesome New Orleans city tour I highly recommend A Bicycle Named","useful":0,"cool":0},"zg45gqSt9KdeB5J5Ln3ptw":{"text":"What an awesome bike shop!! Our group of four, all visitors from the east coast, experienc","useful":1,"cool":1},"uoPvRbru-pWmKqRIrKT_kw":{"text":"Rented 15 bikes for a bachelor party and these guys were amazingly accommodating. They wer","useful":1,"cool":1},"KNWEK4JVV6JpmdpOP2bCUQ":{"text":"I love exploring cities by bicycle (you cover so much more ground and feel like a real loc","useful":3,"cool":2},"w4vyorT408eZYdCbQiNgLA":{"text":"I tried a couple different rentals on my most recent trip to NOLA and this is the best bik","useful":3,"cool":2},"0ysgGGvLZC_V07QhMpydjQ":{"text":"When looking up bikes rental places on the net, I came upon 'A Bicycle Named Desire' and j","useful":0,"cool":0},"xBLF7O2xKh6uWi4doDjERw":{"text":"The best recommendation I can give for visitors to New Orleans (as we were last week) is g","useful":0,"cool":1},"1qA4rgi9_ViLakpk3cqWMQ":{"text":"I highly recommend A Bicycle Named Desire for your bike rental needs when visiting New Orl","useful":0,"cool":0},"4Z53Wu6VjH7qJ7pjlgd1VQ":{"text":"Super easy to to set up and really inexpensive.  They provided some tips for us as out of ","useful":0,"cool":0},"FyR-uICUN5iAzZ6uThtUxA":{"text":"This hurts - terrific rates, incredibly friendly staff... they provided me with interestin","useful":2,"cool":0},"_DTaZF9Bc5GnYfsqnpQJcQ":{"text":"Fantastic addition to our visit to NOLA! So much fun, history and great stops along the wa","useful":0,"cool":0},"eTQges2hCxOsWmxCplv6Rg":{"text":"I had a great time riding around New Orleans on bike.  Great service and reasonably priced","useful":3,"cool":5},"9RFFFZlwNZFYrSLIJfWnig":{"text":"I've been to NOLA many times, and one of our keys is finding a good bike to rent, as we al","useful":0,"cool":0},"vu5V9tPVrZtFGBI5GjDx6w":{"text":"Cassady was very knowledgeable and funny!!! It rained most of our tour but we loved it. Th","useful":0,"cool":0},"t6EBGRh8cdtc9Nco8PNQPg":{"text":"Great prices, nice bikes. Didn't take a tour with them but will next time we are here. The","useful":1,"cool":1},"7d4oLI06Qghe3kodXEPBEQ":{"text":"In need of a 24 hour or longer bike rental (with helmet, lock, and basket)? Maybe consider","useful":0,"cool":1},"cxolZQxc8AvbVrdf4t9pUw":{"text":"I highly recommend renting a bike from A Bicycle Named Desire. They have great rates, and ","useful":1,"cool":1},"e92j3ckW8Jlqw51qT6zukQ":{"text":"Popped in here to rent a bike during Jazzfest and was 100% pleased. The bikes were comfy c","useful":1,"cool":1},"ZuLV0ASuCWi-WlSshwxjlw":{"text":"We have been travelling to NOLA with a small crew from Philly for the past 5 years. In tha","useful":2,"cool":1},"7uX85yQA7aMvbka7V4Wm2A":{"text":"rented from ABND once more on our annual Halloween trip to NOLA in October, 2014. \n\nSame p","useful":1,"cool":1},"8qhGQ0edWZI07kzP3nZ6FA":{"text":"I ride frequently in Seattle and wanted to explore New Orleans quickly & easily by bike.\n\n","useful":2,"cool":1},"kTl7RwlSkGjgXKUPPT6_Lw":{"text":"Had an awesome experience renting bikes from A Bicycle Named Desire. Heather and Cassidy w","useful":3,"cool":2},"a7UcFDGZCM3TFAXS5uMmLg":{"text":"A bike tour with \"A bicycle Named Desire\" should be the first thing you do in New Orleans.","useful":1,"cool":0},"gs_PcLQmhqI4KHJmHJPiYg":{"text":"I was out for the evening on my personal bicycle with a hot date when disaster struck, a f","useful":1,"cool":0},"Qvu1zyXhtFNb9pGE2YD9tA":{"text":"We do a tour every time we are in town. We have done 4 tours. I do recommend Cassady for a","useful":0,"cool":0},"HbuGVJg81v6q0HxN77yl5w":{"text":"Get your bike here. Great character, better prices, interesting store and kind staff. Had ","useful":1,"cool":0},"paI36mbgS1OHeZrgr3w9Vw":{"text":"The bikes were great, the staff was terrifically helpful and when I had problems (my baske","useful":1,"cool":1},"Zgc7XUkd53xMxYg153zb8w":{"text":"Look no further. This is where you want to rent your bike. It is also where you will get g","useful":0,"cool":0},"TlT2GOlEgPsV9pArJjjYSw":{"text":"Great place. Very quick. Good equipment and very nice people. Reasonable pricing. And they","useful":1,"cool":1},"FmVua2quN9s9EBuLPVh-NQ":{"text":"Renting a bike in New Orleans was the best decision of my vacation there. It was so much f","useful":1,"cool":0},"jdy-aro9gG-0cL0-utiv2g":{"text":"After deciding it would be easier and cheaper to rent a bike for Mardi Gras than to find a","useful":2,"cool":1},"D1SzF72T2EtZnGF25mJTyA":{"text":"I rented a bike from here for two days and it was well worth the time and money. The staff","useful":0,"cool":0},"bMrrUDI-rO16JQ7_SvjztA":{"text":"Great prices, way better deals than what you find in the French Quarter. And I felt like I","useful":1,"cool":1},"bxObhMDvYbRsty7gU7QjAQ":{"text":"Renting a bike was one of the best decision I made while in NOLA! In my opinion, there's n","useful":2,"cool":3},"m7e5P1P9hIm1mkLct3tqCQ":{"text":"Great - super friendly, good info and suggestions, reasonable. Loved our day spent on thei","useful":0,"cool":0},"can_slpfRyliYFqa-eGuuw":{"text":"Second all these wonderful reviews.\n\nThese folks are ridiculously friendly and helpful, th","useful":0,"cool":0},"PfkMEh6pAlw_sSyqs04zJQ":{"text":"Great experience all around. As someone who rides a mountain bike and a road bike the thou","useful":2,"cool":1},"HbV_lNbv7ugyFELwovvVIg":{"text":"Great rates and helpful staff. It was my second day in New Orleans and they helped point m","useful":0,"cool":0},"egsI0KVXaZexQAv0Uso0xA":{"text":"I would like to Thank Cassady and Trisha for their Hospitality. My friend William referred","useful":0,"cool":1},"OylTHQPVgALLYdYXAw3A-Q":{"text":"Good\nService\nAnd prices.\nComes with helmets,\nMaps, baskets, and lights. Only has cruisers.","useful":0,"cool":1},"kbp58x51lrcSzyrojdNB2w":{"text":"We signed up for their sister company's Culinary Bike tour at the start of our week in New","useful":1,"cool":1},"AEceNakA1O7qxLydKfd1ng":{"text":"Easygoing, knowledgeable, and hassle free. Beautiful bikes, to boot. Awesome awesomeness, ","useful":0,"cool":0},"qOKXAsgVVaJc9QW_iQp6qA":{"text":"What drew me in originally about A Bicycle Named Desire is the fact that it satisfied seve","useful":2,"cool":1},"O5oyR9yg-T73uVBE3nZieA":{"text":"Took a bicycle tour today with Cassady via the sister company Confederacy of the Cruisers.","useful":1,"cool":1}}