{"lHT55SvWhU8dzkxA-jjLCA":{"text":"I visited this café just this past Saturday for a reception luncheon after my best friend'","useful":0,"cool":0},"7XL4gjvhnZz0BW7sSRo_1Q":{"text":"Stopped here for lunch. Great friendly staff. Had the shrimp corn dogs....YUM!! Had a hank","useful":0,"cool":0},"awsnTex2DextiEMhg4bEmw":{"text":"The best part about Cafe Adelaide is they gave my dad a martini for wearing a Cafe Du Mond","useful":1,"cool":0},"qD4F0CMvvTSB59H3Li2uXg":{"text":"Dinner: the food was great\nService: Not very attentive\nAttitude: Seems pushy, they want to","useful":0,"cool":0},"iMPJ14tUjercs_oKwdDOpA":{"text":"Ahhh-mazing!!! I had the filet and my bf had the duck. We both totally cleaned our plates.","useful":0,"cool":0},"gc0upoMBcF5d7Chttw0Q6w":{"text":"Just came in for some bloody maries and their drink selection is fantastic.  Their handcra","useful":0,"cool":0},"hlA9yJwR4BvZ8JFMXcMR4w":{"text":"25 cent martinis -- 'nuff said! But seriously, a coworker suggested I try Cafe Adelaide fo","useful":0,"cool":0},"e-pmG39yvQvIv7NlHmwrXg":{"text":"A little too pricey for my taste. Expect to shell out $40-50 for an entree and a couple si","useful":0,"cool":0},"0Dgp5tn8tOLW53IkWi6oog":{"text":"Fantastic brunch! On Saturday brunch, if you wear a hat (baseball hats don't count), you g","useful":4,"cool":0},"sAjT4mWVV8WByP-3y_8uHQ":{"text":"This is my first bad review. The food & the company was good but the service was beyond ba","useful":0,"cool":0},"0Au15bC5hY_UtKskFOCskQ":{"text":"The food service, quality and drinks were all above par.  This is one joint that didn't le","useful":1,"cool":1},"309E4I5rQehYoqJ0kr0yzw":{"text":"Great service! A coworker and I came here for lunch for the first day of COOLinary 2016. T","useful":0,"cool":0},"RdbGwDh0yyujzcuyxkoUvA":{"text":"The ONLY reason this place gets 5 stars is because the girl in training here ROCKED!!!!!!!","useful":0,"cool":0},"fzVaHYxXP8QTYctImZ8qTA":{"text":"Very disappointed, this was one of our favorite places at on time the service and quality ","useful":1,"cool":0},"2BDsCc-a_eA3pvo3qxK43A":{"text":"Came here for Saturday brunch. The service was impeccable. Every employee was polite and h","useful":0,"cool":0},"EVpmrMV_-FTKY2Tpl1XKMQ":{"text":"I went here while attending a conference and met up with a friend who was also in town for","useful":0,"cool":0},"9HrHVkrc4ykNN07bLJ_Ztg":{"text":"First time to this restaurant.  The wait staff was excellent, but the experience was undon","useful":0,"cool":0},"39ruq5cD75Tg9rVkAiPHtw":{"text":"Went for dinner on Christmas night; food and drinks delicious, great atmosphere and servic","useful":0,"cool":0},"Dxjaz7KEw1wMWlLDxijAPg":{"text":"Beignets were absolutely delish... service could use vast improvements from hostesses to w","useful":0,"cool":0},"N-16b6urHaO3LgXw0LS8Fw":{"text":"Great food at reasonable prices.  The okra and shrimp gumbo is delicious.  I would also hi","useful":0,"cool":1},"TBAMARusuqn-bbP_OJMBng":{"text":"(managed by Commander's Palace)\nstrong just like the other Brennan's restaurants\ni had the","useful":0,"cool":1},"JaddwHQEnzD7QYHUMlq49Q":{"text":"It's sort of like Commander's Palace except way too modern and with much worse service.  I","useful":5,"cool":2},"rZ_9T8vZRtr8d8r9Rtz0vg":{"text":"Rumored to be closing soon, and regrettably, I had to appreciate why. The interior and hot","useful":1,"cool":0},"2nNQZRo14WojVgVqStWpDw":{"text":"Best service, worst Old Fashion.  I tried the turtle soup just for novelty - too salty and","useful":0,"cool":0},"E4n-8z1l49lOm_vmedTb5w":{"text":"#NOLAtourist #chifoodie #foodtourism This low rating is attributed to a variety of factors","useful":0,"cool":0},"s4t5wjztHWoOIg0Psg-9Tw":{"text":"Delicious New Orleans cuisine. Classic, but still exciting.\n\nHad to try the turtle soup be","useful":0,"cool":0},"AocYAOZM01lskhsS9J0Vyw":{"text":"The service at this restaurant is terrible.  We arrived at midday on Sunday to eat lunch; ","useful":0,"cool":0},"byBDn3_jD0Kh5hm_0iL8eA":{"text":"We stopped in for breakfast after hearing and reading great things.  It was a great breakf","useful":0,"cool":0},"VaqERFOPMjuYE-HdhG8HXA":{"text":"The best thing about this place was the bread.\n\n...or maybe the garlic fries.  The fries h","useful":1,"cool":0},"yVnjEyke4UQjIwkMF_9EWQ":{"text":"The food was great & interesting.  Fun & personable staff.  They gave us a bunch of extra ","useful":1,"cool":0},"QgnXgOGcSlf6rEho0DXeKg":{"text":"This place will woo you until you have no choice but to love it.\n\nThe bar is a great place","useful":0,"cool":0},"qgkbDnK0kE8TNSc6mPw0Iw":{"text":"Absolutely great brunch and fun place. Definitely will come back. Katherine was a delight.","useful":0,"cool":0},"mzUfzINRLPV9yI-VjrZm9Q":{"text":"I ate here for Thanksgiving dinner, er lunch, since we were far away from home. We were do","useful":5,"cool":3},"o2m_lVfFSgMfcYoeACR_qA":{"text":"Excellent food and service.  Nice comfortable dining room.  Bacon crusted fried oysters fo","useful":0,"cool":0},"KOZ9MiM8jk2_ppXi_EZ90A":{"text":"Can't beat .25c martinis! Shrimp and grits was amazing, as was the crabmeat grilled cheese","useful":0,"cool":0},"AEQl3RnO-WfQsXIrjiyt-w":{"text":"This little place, the restaurant at the Loew's Hotel in New Orleans where we were NOT eve","useful":0,"cool":0},"5InNC1zdD5c79TLdXA3otA":{"text":"Two of the three of us enjoyed our dinner at Cafe Adelaide, eating off the Reveillion menu","useful":0,"cool":0},"596TfvO2CdSIZn2tqreDxg":{"text":"Came straight here from the room our first night. \n\nMy GFs turtle soup was great, but a li","useful":0,"cool":0},"8Lold95s31vgEKYAYrrNSA":{"text":"I arrived late in NOLA and yelp helped me find this place (across the street). Servers wer","useful":0,"cool":0},"Cl6xs2RVICUFk1BQ7BpsTQ":{"text":"Staying at this hotel and decided to try out the restaurant. Pretty big letdown after look","useful":1,"cool":1},"PIbM1Wo_w6agPs2dPrvi6A":{"text":"We were recently in New Orleans for 6 nights.  Out of all of your dinning adventures, this","useful":2,"cool":0},"tmsyUuhWO3pbLusCznH6Wg":{"text":"We first went to Cafe Adelaide about three years ago when we were in New Orleans for a con","useful":2,"cool":0},"IQ3k5RH-iWQvRRt1zHkA2A":{"text":"This gem is a nod to \"Aunt Adelaide\" better known to the rest of us as Adelaide Brennan. T","useful":0,"cool":0},"LT9GYievERtS66s4hnRJ6A":{"text":"Had lunch here...\nService was quite good, ambiance was slightly odd (balloons on every tab","useful":0,"cool":0},"0X6PSiE_3tyAXBxYyyCWNA":{"text":"Outstanding Bloody Mary and burger.\n\nService was impeccable, despite a rambunctious crowd.","useful":0,"cool":0},"Ie1wvJtg3XAUeVwHKCQFyQ":{"text":"Absolutely wonderful brunch spot, from the kind and attentive servers, to the fun decor wi","useful":0,"cool":0},"HnZOaYZ-B4cTkApKvnuoAQ":{"text":"With so many great restaurants in New Orleans this isn't the best option for food or servi","useful":5,"cool":1},"FSBSVA9d9WTmYEe0dGW5yQ":{"text":"A nice little surprise while here in NOLA.  The cocktail originals are all very intriguing","useful":0,"cool":0},"kjVDrPzRnmnGfliIL-kjJA":{"text":"25 cent martinis at lunch! I repeat, 25 cent martinis. Yay! That was definitely the draw f","useful":1,"cool":0},"mvffrbcl5nwURbD8rCAtRQ":{"text":"Over priced, but decent food.  The crawfish grill cheese was yummy.  I've had better gumbo","useful":0,"cool":0},"XrbbPilfQu6mgYETvzX3Fw":{"text":"Was so tired from my day of travel, I decided to eat here since it's inside my hotel.\nThe ","useful":0,"cool":0},"CeVCLTob1wK90e6acaH-lQ":{"text":"They dropped the ball on the service a little however I think the server was a a bit swamp","useful":0,"cool":0},"_dsMF-SN9vZvp0JNI3lZIA":{"text":"There is not a single thing that I would change about the experience or the food. Everythi","useful":0,"cool":0},"0BMI_qbIjSL3GQhLIbBJ8g":{"text":"What a pleasant surprise, both the andouille burger with remoulade sauce for the cajun fre","useful":0,"cool":0},"xTzt13U63k1gwCcRkm6J7Q":{"text":"Beautifully decorated. Our server was hysterical, he kept us laughing throughout our dinin","useful":0,"cool":0},"l5j4RuQgzv4DrBiy5lOjnA":{"text":"Cafe Adelaide, located in the lobby of the Loews New Orleans Hotel, has a gorgeous space a","useful":0,"cool":0},"S3uYIx21uO8M2I1vDlm2IA":{"text":"The meal I had tonight was truly wonderful--\n\n--Shrimp & Tasso Corndogs (Wild white shrimp","useful":0,"cool":0},"F1fRgsMZWLqLsBD96xzR3A":{"text":"The food is absolutely amazing here, but we have had a couple experiences with bad service","useful":1,"cool":0},"Ao5py79pM-FfQTsEYkhqiA":{"text":"I came on a Sunday for the \"brunch with hat-itude\" which allows diners to enjoy up to 3 fr","useful":0,"cool":0},"27hLXuk809XVp04qmKLoYA":{"text":"Loved love loved this place !!! Filet was stunning. Great service and amazing atmosphere. ","useful":0,"cool":0},"iaEGqqTjjyjQp4CUjxd48A":{"text":"What a way to start off our New Orleans experience!  This was our first stop for food once","useful":4,"cool":0},"x4I_vtEK1utixDz0HAkNNw":{"text":"Worst coffee ever. I was there for breakfast. I ordered eggs benedictine and a regular cof","useful":0,"cool":0},"iygMpDWXolvqsTuLID5Ltg":{"text":"I am very impressed with this place. It has great food and even better service. After aski","useful":0,"cool":0},"NdWjRDFCQew0RFozaSEaiA":{"text":"I was sooo excited to go here for the first time this morning! We were early and there wer","useful":1,"cool":0},"8gu_3ZD8yxToJchXcHzESg":{"text":"Attended a dinner party for about 60 guests, so we naturally had a set menu.\n\nIt was a 5 c","useful":0,"cool":0},"ccNqcwvRBczsXHzVtEKlPg":{"text":"Ate thanksgiving dinner here with my family. Incredible. It was a special menu, we ordered","useful":0,"cool":0},"wvXQfsu--1juFSJFIoFqmg":{"text":"I'll reiterate what some other Yelpers have already written: FANTASTIC service. \n\nHere's m","useful":5,"cool":3},"O8nw2Hb5db2Q8WQTPlGTHg":{"text":"We only had drinks there but loved it! It was their signature drink which I would highly r","useful":0,"cool":0},"s3i2pschB8-wnDv_i3e-0A":{"text":"I just want to start off by saying this is the best destination for happy hour. With marti","useful":0,"cool":0},"36-GCwbRgrMzJD1dOph8Hg":{"text":"Our group of five arrived without a reservation. We were lucky enough to snag a table in t","useful":0,"cool":0},"7oizNzjNsnyPfGatc_o4bA":{"text":"Well I really can't comment on the food as I had a bad experience getting a table. Stayed ","useful":0,"cool":0},"UyfZadD6uYqA6XyqpVLBqw":{"text":"The food was delicious and the atmosphere was very pleasant. They also validate your parki","useful":0,"cool":0},"V2exY7w-gtl7jX10i_bHCg":{"text":"These guys have a unique menu and are close to the Quarter. If you have two appetizers or ","useful":0,"cool":0},"szrHFqJBsjGOXl7Q74dY1w":{"text":"I've been to New Orleans may times but really havent been able to enjoy the food scene bc ","useful":0,"cool":0},"QML6zePMyL4H6S-eWxDi3w":{"text":"Staff was friendly and helpful, if a little slow to respond.  Some staff members were not ","useful":0,"cool":0},"8qUkyA1rt01wDz6K5Dxf9Q":{"text":"We were doing a staycation at the Loews Hotel, and decided to finally eat at Adelaide. We ","useful":1,"cool":1},"0UIRwGmQ65LdLN8YrZM4vQ":{"text":"Turquoise booths,white tablecloths ,and 25 cent martinis at lunch.  Three drinks max with ","useful":0,"cool":0},"KJUzloHo_hkmsxMtB61uTg":{"text":"Service was ok but just got by with OK. Lipstick on the coffee cup and no water offered. T","useful":0,"cool":0},"A_jOTSQmWM5I2n8KZs0g9Q":{"text":"I have visited Cafe Adelaide for multiple events, Birthday Parties, Special Events, Lunch,","useful":2,"cool":0},"_SpbGsrMyOzclf_DDSKvhA":{"text":"Nice ambiance, great menu, 25 cent martinis in the afternoon for lunch!  Who can argue wit","useful":0,"cool":0},"QWNKMr5LAkxSJzJP6gSNzA":{"text":"I had such a good meal on Friday night here that I chose this place again when a group of ","useful":1,"cool":0},"7_dO8ynbR8ywLjfr9yyu2A":{"text":"Party of three, we had dinner on a Sunday night. At first we had to sit at the bar because","useful":0,"cool":1},"2QerErY4_BGXDhck3orG-w":{"text":"Ok, I am giving this place a two for staff and decor ... But the food, like Wuthe hell? Wh","useful":0,"cool":0},"zkRD2q-iSpzz1tOyH8QBiA":{"text":"Shrimp and grits and gumbo are both delicious. The shrimp and tasso corn dogs as well.\n\nTh","useful":0,"cool":0},"h8E8FL-r6zlKs_PtyrIL1Q":{"text":"We went to the brunch and cocktail pairing on Saturday and had an amazing experience!  The","useful":1,"cool":0},"vmgEW1dKvXa9BhvKC0-nmA":{"text":"Great little spot in the Lowe's for breakfast. Staff was great, food was fresh and simple ","useful":0,"cool":0},"XUqcc0URMMhgN4A2NQQO4A":{"text":"Very delicious food, calm ambiance, great service.    We had the three course meal. Starte","useful":0,"cool":0},"FPweHFHSOrhx35zx7_tL6Q":{"text":"Cafe Adelaide... Commander's Palace's fun cousin.  This place put me in mind of a kid frie","useful":0,"cool":0},"gv3xQotK2peZVBI7m6UAJg":{"text":"This was the best meal we had in New Orleans.  Spectacular duck breast and groan-inducing ","useful":0,"cool":1},"IXNB8NOHwnN6lEA9Bwd8kA":{"text":"I'm on a toll in New Orleans.  Not a bad meal yet.  I came on a lazy Sunday night and I co","useful":1,"cool":1},"UMgsHBsjOTPHd26SHpTnRQ":{"text":"The staff was extremely friendly, but I think eating at Commander's palace ruined all othe","useful":0,"cool":0},"kNNMt5fcPmkvwuU4JwB57Q":{"text":"19 Jul 2014, 06:15p\n\nHubby and I had just arrived in New Orleans a few hours earlier and d","useful":0,"cool":0},"xHfDiaQe6g4e9493ZOD1VA":{"text":"I was visiting New Orleans and wanted to go to some happy hours and this was the first sto","useful":0,"cool":0},"PLf3YF8FvLGpTgi7NafINQ":{"text":"Great festive atmosphere for a Christmas lunch with family, friends, or co-workers. The ca","useful":3,"cool":2},"hBg_3Tp_1V8OExCXkt2nYQ":{"text":"Delicious lunch special. Great food without hoity toity atmosphere and 25 cent lunch marti","useful":0,"cool":0},"_BYcyHvvM63FHkuwMm2ZZA":{"text":"Our reservation that we made in person 3 days ago was \"lost.\"  Service to order took 30 mi","useful":0,"cool":0},"ycx87SZq1oPzK3aaxWYVHQ":{"text":"We came here for a group dinner. We were seated at a reserved table right away. The waitst","useful":0,"cool":0},"6A9XYwWXyF0Rbo_CfIbPWg":{"text":"I hadn't really ever had an interest in going to Cafe Adelaide because, well, I have been ","useful":3,"cool":1},"WWGcVBP7J3P7ZregZzq_sg":{"text":"Yeah---I gave them 5 stars, which is not usual for someone like me since I have worked in ","useful":2,"cool":1},"OzWfp0kOFZLrP3eHDR8WuQ":{"text":"Chris and I came here for cocktails over a year ago, and while we found the cocktails to b","useful":1,"cool":0},"_HvIrlhQKO8VDS_8i7Vdaw":{"text":"We went to Cafe Adelaide for dinner and arrived at approximately 7 p.m.   As we approached","useful":1,"cool":0},"jF06Eq7WaJSKgIn09lpuDQ":{"text":"I was in NOLA for Jazz Fest weekend and for a conference and stayed at the W hotel across ","useful":1,"cool":0},"Kdjf5UHAxWiK3UMrZWSYcg":{"text":"Another must-visit when coming to New Orleans. The food is amazing, but the service is eve","useful":0,"cool":0},"b6kHOZvcu8DxQ3yP7cFQVw":{"text":"We had lunch at Cafe Adelaides today to celebrate Father's Day. Let me start my saying the","useful":1,"cool":0},"ynDC7H2DyFW8gwn7TSaSvA":{"text":"Amazing!!! On this trip we had Mr B's & GW Fins, Cafe Adelaide was so wonderful. From the ","useful":0,"cool":0},"EhMVKRX7yIsrVURdkcWkLw":{"text":"Hidden inside a hotel, this is a lovely spot for some good food in the CBD.  Atmosphere is","useful":0,"cool":0},"hR6tzCfViq7wvbszSL74fg":{"text":"We heard a lot of good things from a host of many different people.  We were not disappoin","useful":1,"cool":1},"iYWFaTLp-DT8CG8VoZXvkA":{"text":"Ate here tonight. Quiet restaurant, very elegant (yet a couple wearing t shirts, so obviou","useful":0,"cool":0},"YbdGZxVStLyzQF1HNhnSrw":{"text":"We took a chance and brought our 2.5 year old daughter (named Adelaide) to Cafe Adelaide o","useful":0,"cool":0},"0Rut6i1vnSExek40o8i4tg":{"text":"I use Yelp all the time and have never left a review. As a public service, this will be my","useful":2,"cool":0},"KQLKG_mQfJs8-T9JmHvHyQ":{"text":"Service and food was outstanding!  We were easily able to make a reservation for 730 on a ","useful":0,"cool":0},"uDbxVSoWggtQYxIp_8GICg":{"text":"Had a wonderful waitress and was very attentive. The food on the other hand was just blah.","useful":0,"cool":0},"os8NiZ0HrZJmuL3YaaZEPw":{"text":"First, I'd like to state that this is strictly reflective of the service, as the food was ","useful":2,"cool":1},"c2RP2KH5agjmctDE-d9NJA":{"text":"My daughter's name is Adelaide, so we planned to have breakfast here one morning. The whol","useful":0,"cool":0},"IvtCDnn_HXQ-VS8AEP6A7g":{"text":"The staff was really good! They definitely took care of our group of ladies which was real","useful":3,"cool":1},"dYN5B5yRQNRjZlOfrgXBdw":{"text":"Great food! You cannot beat martinis during lunchtime at $0.25!!! Ambience is fabulous.","useful":2,"cool":1},"LGTdGqgxrsDp5T1n4v7Y6Q":{"text":"Service is deplorable. Food meh. Sorely disappointed. We are staying in hotel. Food partic","useful":0,"cool":0},"O5zhuHcLY2hK184zz77ijw":{"text":"The only good thing about this place was the service and the staff. \n\nThe food was not goo","useful":0,"cool":0},"BD4hJQjzx7vuFdVY3ZLT7A":{"text":"Went here to try different places for breakfast around our hotel within walking distance. ","useful":0,"cool":0},"53A9Cp7ZRQkmOAzKCcnTpg":{"text":"Went here after visiting the spa (excellent). \n\nFood- happy hour stuff was mediocre. My fr","useful":0,"cool":0},"JrMNWZ7dOBIgWBQ5kJyTxQ":{"text":"So we walk in for some breakfast and I'm sporting my camo UT ballcap and the waitress info","useful":0,"cool":0},"8A00wuMEeWXuAyoN6HyI4Q":{"text":"We went for brunch, wore hats got a free drink. It didn't seem like the other customers we","useful":1,"cool":0},"kWsExWAZQjS4GdnbNEJz7Q":{"text":"Service lent mais bon, nourriture correct, portion petite,dessert sans intérêt...restauran","useful":0,"cool":0},"BXl0a0061V5heI6EBFgMVg":{"text":"Do not waste your time. This is one of the most poorly managed restaurants I've experience","useful":1,"cool":0},"dogXd2A4Lg5ODq3kEl-KYg":{"text":"The menu at breakfast is limited. Service is fair. Beignets were good, coffee service was ","useful":0,"cool":0},"8Uu2b0qPRwXQuLmPg5fewA":{"text":"We have had amazing food during our week-long stay in New Orleans but our dinner at Cafe A","useful":0,"cool":0},"3af_oGG9pw5OlEXBFFv2bg":{"text":"Quentin is the best! I have some complicated dietary restrictions and rarely eat out, but ","useful":0,"cool":0},"b-boPunFpvGhHgKDGjPJkw":{"text":"Looked this up while in New Orleans, looking for someone working with avant garde pairings","useful":0,"cool":0},"0X8ycUQIMP5TOFXt9YLEcQ":{"text":"Food was pretty good. Service was good. Great decor. Just seemed dead in there. I think we","useful":0,"cool":0},"W9WsRa-9U1F1cCpx1sH_0w":{"text":"Great service~ so helpful!  I am allergic to garlic, so I can be a challenge.  They were m","useful":0,"cool":0},"5oTmL9VRDjvrYxkESUZPbg":{"text":"This place has $ 0.25 martinis during lunch. I was worried that the drinks would be watere","useful":0,"cool":0},"HH_isacGma8ouH58nMf9Gg":{"text":"I have never written a review on Yelp until now and for good reason. Just had the best shr","useful":0,"cool":0},"DSD6e5UzhpzQKmRoW0oEsQ":{"text":"Let me start by saying that I'm not a guy who likes to pay more than $10 for breakfast.\n\nL","useful":1,"cool":0},"sbRi1W76EbG4J2JfJwOOHw":{"text":"A friend and I went to Cafe Adelaide last night. We both live in New Orleans. I had a Trav","useful":0,"cool":0},"CSAlS5tu7ahDQcRT0JAT1w":{"text":"They easily accommodated our large party with minimal wait as they set up the table. Servi","useful":0,"cool":0},"3fU5ZmQJyy8Adr4z9ETqsg":{"text":"Had a great breakfast by myself there.  Very tasty waffle and eggs and some good coffee.  ","useful":0,"cool":0},"Idu_l2pw2G41FtoLZlZfDA":{"text":"We've been to Cafe Adelaide before, but tonight was horrid.  We asked the waitress if the ","useful":0,"cool":0},"pDgXEjbnHHgnWC87xOABLQ":{"text":"Out of the salmon.  Asked for the gnocchi without the crab which they would do- at the sam","useful":0,"cool":0},"OC3TF8lnFLUanfk5MmWBJw":{"text":"Cafe Adelaide is located inside the Loews Hotel which means complimentary valet. So if you","useful":1,"cool":1},"qskC8_zmSDFpBd5uro3qwA":{"text":"Hands down the best warm bread and gumbo. What a great lunch spot with great service and m","useful":0,"cool":0},"l49Zdf6cFRyHBA8mJHgGQQ":{"text":"We started off with an excellent Ole Fashion at the bar. Then things went down hill.  Wait","useful":0,"cool":0},"K3J3DMoaZKbKZq3U_xJ3mQ":{"text":"How it began..\nDropped by on sat to see if i needed reservation on sun.. Lady said no..  W","useful":1,"cool":1},"9NAdFQD9WBp-N9Y4yPTcHw":{"text":"We had lunch here. What a nice little place - local specialties, great fried oyster appeti","useful":0,"cool":0},"Jla7NMW152-az3hjnnDbBw":{"text":"The service was good, but the food was disappointing--definitely not what I expected at th","useful":0,"cool":0},"xJ6ITjSFbekCR0cqgFuLIQ":{"text":"Sad this place is closing on August 24th.  Hopefully the Swizzle Stick won't change too mu","useful":0,"cool":1},"MG82cdQJl24Ej0CSjIB7_A":{"text":"Went for the fixed price lunch special.  I had the BBQ shrimp and my husband had the jalap","useful":0,"cool":0},"Xi8JGsFsutjOLZwl07KUnA":{"text":"The perfect place for brunch! Was drawn in by the 25 cent martinis (VERY strong, beware), ","useful":0,"cool":0},"XOqbqRX5QjOYMnnJO5p0_Q":{"text":"The hostess/ apparent manager was quite rude and unwelcoming. She basically tried to push ","useful":0,"cool":0},"eWgm99W4KNK76imuxQMThw":{"text":"The food was so delicious and the root beer bread pudding made me want to slap myself it w","useful":0,"cool":0},"yUe1X05iVuw6v5USB-E-qQ":{"text":"Wonderful! Exceptional service and food. Although the menu is limited, there is something ","useful":1,"cool":1},"63stxe6cPCowIF-Qe6YdEg":{"text":"I came here with my girlfriend for our 2 year anniversary. It was truly an amazing dinner.","useful":1,"cool":0},"YIUD9efFuEL0AjhkZ528xg":{"text":"I was really excited to try this place after reading the menu. Some things were great, som","useful":0,"cool":0},"eBv-All-FAajBBOR2GzOug":{"text":"The restaurant has comfortable seating and a bustling atmosphere, but it's not too loud- j","useful":1,"cool":2},"1CmF0R8_RvqwteWYApBdGg":{"text":"Love the beautiful blue and yellow tones of the restaurant. Very nice. That's why I gave 3","useful":1,"cool":0},"UZXBbSGi5dWwaVm3fJvXNQ":{"text":"For the Shrimp and Grits from Cafe Adelaide alone I would go back to New Orleans.  The shr","useful":1,"cool":0},"JxF5FYE_7smtBlC26pGe4Q":{"text":"Great! Fantastic! Wonderful!   Food - Service - everything!\nWe had a special party - reser","useful":0,"cool":0},"NlJi8JxhsrmraZiOFf3iBg":{"text":"Can't wait to go back to Cafe Adelaide.  My husband and I  thought that the food was absol","useful":0,"cool":0},"Z_Odxr1r-hmGNhlVg8jCaQ":{"text":"Will update review later, but what an absolutely horrific way to begin our last day in New","useful":0,"cool":0},"m3_DagKLwL1fKX5jr1ZuKg":{"text":"I loved my experience here. I agree with another reviewer, this is a more chill version of","useful":2,"cool":4},"WFX3l5p3wz0vzSTw0PsHYQ":{"text":"Did not have the best experience, unfortunately because the atmosphere is very charming. W","useful":0,"cool":0},"Cicsn0cn3TObpi6PSBq8vg":{"text":"Service was great. They were still serving breakfast, but we wanted to order from the brun","useful":0,"cool":0},"9PsK1paYeUtolOTarPb0mg":{"text":"Great hotel restaurant bar.  Our drinks at the bar were fantastic.  We got a great table t","useful":0,"cool":0},"9OYD-h8AZ5XNmbo9tVDk7Q":{"text":"was good and accomidated us at the last minute.  Food was a little salty but good.  The Sw","useful":0,"cool":0},"X9M9UpInlqqTpV9ZjXal1Q":{"text":"I absolutely loved it! From the atmosphere, to the friendliness of the bartender, to the a","useful":0,"cool":0},"1Hs9hzj4C62_NwcJH61r-w":{"text":"Can't even cut through the turkey, $60 and only got three small pieces. Sweet potatoes was","useful":1,"cool":0},"1qLTfGFci7-VUypFl1pvoQ":{"text":"We had:\n\nFresh bread\nFried oysters with citrus salad\nTurtle soup\nPork chop\nBrussel sprouts","useful":1,"cool":0},"5LodxCJlBWWHb9BgAxO7Mw":{"text":"Amazing dinner...had the green Chile Salmon and it was cooked to perfection.  Couldn't und","useful":0,"cool":0},"5dWIGTrohwdqQCjgHZ6d_Q":{"text":"This is a favorite place for lunch with the girlfriends or my foodie group.  Yes, everyone","useful":0,"cool":0},"8mB-HmzmJ2cVXMvxePGtKQ":{"text":"The service really is great as everyone has mentioned...but the food ( or at least my food","useful":0,"cool":0},"rTMIGlXxc4aPMJxDnd_3mg":{"text":"The spices were not impressive.  The food was overall nothing to write home about.  A litt","useful":0,"cool":0},"hOHXQ5n-1XPpTdvEfxc_TA":{"text":"Beautiful place. Saturday Brunch with colorful balloons and ladies with fancy hats. Bacon,","useful":0,"cool":0},"sz4NoAqcMI73kiE4P8833Q":{"text":"Café Adelaide was on my list as soon as the Coolinary list dropped, so I was excited to tr","useful":10,"cool":6},"IYsg6bLxMIkItvbjTV6gqQ":{"text":"came back for a dinner and a lunch and both were phenomenal\n\nif you don like this place, y","useful":0,"cool":0},"UfYJjkeoxLj-TI614Xk5Zg":{"text":"Stopped here on the recommendation of some family for the shrimp and grits. Imagine how di","useful":0,"cool":0},"AcTYUHuNu8yUm2tSGU41jg":{"text":"Food here is amazing. My family and I ate here everyday while visiting. We know good food,","useful":0,"cool":0},"BrTxQObgGbUZxx9io7VO0g":{"text":"As I begin to write this review I'm struck by the thought of \"look at what I've been missi","useful":1,"cool":0},"0q9uY6HN5LPj_eExYSiNQQ":{"text":"Very friendly staff! The food is good, I loved the Shrimp and Grits! I would recommend to ","useful":0,"cool":0},"DJNrX9MigbYTMeoLGt6L_A":{"text":"There is a reason why every other brunch place has a line out the door when this is half e","useful":0,"cool":0},"ZNn0EY90_WIRGuV8MYG9gg":{"text":"Went for Happy Hour Super Bowl Sunday. Enjoyed it a lot!\nHad the 1-1-1 soup. Turtle soup w","useful":0,"cool":0},"sTWuia26cLl0A_W7Gcywgg":{"text":"My husband and I dined at Cafe Adelaide for a late weekday breakfast before leaving town. ","useful":0,"cool":0},"IytTYnPTjAh56Xc4BKDTEA":{"text":"The food & service are always great. I love their lunch specials, and you can't beat the 2","useful":0,"cool":0},"dg7nvqTQRZ_3okDrHzXyuA":{"text":"This place is in the Lowes Hotel, so not quite the New Orleans experience.  Same owners as","useful":0,"cool":0},"DPKa2bJqETrr8fIGK0xxrg":{"text":"Thank you Café Adelaide for reminding me how much I enjoy a good dirty martini. Two kids h","useful":4,"cool":2},"qvLd-ouevrxrsLW25QG6Ww":{"text":"I made a reservation, as we were in NOLA for Christmas and wanted to be sure we'd find som","useful":0,"cool":0},"72q-FzElC9fXLi3xxEODJQ":{"text":"Amazing!!!! Shrimp corn dogs, pork belly, boudin balls are fabulous. Skillet fish, shrimp ","useful":0,"cool":0},"hCgy0z5FR2vLacSz2GKGog":{"text":"Café Adelaide was a stop on our celebration tour after I passed the bar exam!\n\nWe went her","useful":1,"cool":1},"nO0J2sdKNJvZhJGW3p-3uw":{"text":"Ran all over town looking for chicken soup for my pregnant wife, with absolutely no succes","useful":1,"cool":1},"4cGyqKcRDnG0ayr2MsPyMw":{"text":"The cosmos?! Ah-mazing. Food was fantastic, service was a little slow - would love to go b","useful":0,"cool":1},"sZY4vpsiB-Th3izLvGumNQ":{"text":"This place was amazing, went last month for a Saturday night dinner: was able to get a res","useful":0,"cool":0},"YW5l-kmfHFCOncwBK5DKPA":{"text":"Our first dinner in New Orleans. We got the prefix dishes. I had the turtle soup (the sole","useful":1,"cool":0},"FfwmnmiKSogU8tC5_ib12A":{"text":"Cafe Adelaide was on my list for a while. Once coolinary came around I gave it a try. The ","useful":2,"cool":1},"VhhpmHRkgfKZ4qLgsozzaQ":{"text":"I would not rate this as fine dining...or at least my experience there was not.  \n\nStarted","useful":1,"cool":0},"X_y5QQBEa8M44xUGbrDANw":{"text":"My wife and I had breakfast there this morning. Omelette was very good, quality, presentat","useful":0,"cool":0},"gUHWH8Np08MxP-m7ii812A":{"text":"This was my third or fourth visit to Cafe Adelaide in about 10 years, but my first for bre","useful":0,"cool":0},"yjdR3KPvscYCtBjX_gtcZw":{"text":"I had a quick dinner at Cafe Adelaide this evening.\n\nI was dining solo and so I opted for ","useful":1,"cool":0},"gyQ48VHJChy8_RegTJtang":{"text":"Enjoyed Xmas dessert, drinks\n\nAmazing Dark Chocolate Toffee Cake\nespressomousse,maceratedb","useful":0,"cool":0},"8UMWodemiIHysuKtdO-0cA":{"text":"We stayed at Loews and assumed the restaurant would be good. We were wrong! Bad service an","useful":1,"cool":0},"J5aNZFUsgwoEn7NeUvL7Ig":{"text":"Cafe Adelaide has been on my list of Brennan's restaurants to visit for awhile, so I decid","useful":11,"cool":8},"V2Y5CadbosNyFvw7CZs5CQ":{"text":"Best food I've had in a hotel. My favorite is the shrimp on shrimp with red grits. Not you","useful":0,"cool":0},"PuhSQfSFr75r9i-QqRxcPg":{"text":"I'm only person at the bar and ordered a burger and fries. 20 min later still waiting whil","useful":0,"cool":0},"81iC3qEdtBF0vmfeUMQ14g":{"text":"Easily a full star goes to .25 martinis for lunch.  Seriously, they were only 25 cents!  N","useful":0,"cool":1},"D1hnBhYzf5HRZx8bEwessQ":{"text":"Great food!  The $39 salad, entree & dessert specials are not to be beat. The red fish was","useful":0,"cool":0},"99nS89NECffWUUPW_MTcmQ":{"text":"If you're going to splurge then I recommend this place. For $24 got the turtle soup which ","useful":0,"cool":0},"WQ5t36HLzSx7fD726NjZnQ":{"text":"This is the first review I have ever written on Yelp after using the service for several y","useful":0,"cool":0},"h7uvqdL0tt9BbZtEPbTC2Q":{"text":"This was the best meal we had in New Orleans on this trip. A beautiful dinning room, an in","useful":0,"cool":0},"uPh4DPlKdOfagZHwuNGyWQ":{"text":"Sat at the bar for happy hour & some cocktails, our bartender, who never introduced himsel","useful":0,"cool":0},"dQB_2jJrGLLuFZUIjHVy8Q":{"text":"Very dissapointed ..... my biscuit that I ordered for breakfast was RAW dough and after co","useful":0,"cool":0},"n3Xvv36lE67ss8G6f5BjHw":{"text":"You ever been to a place where the food was good but the vibe was just OK? This is what Ca","useful":0,"cool":0},"GYQw9QynDDmX2dfh6jV9cw":{"text":"Came here for dinner july 3rd. Beautiful decor with 1920-40s style seating and scenery. Th","useful":0,"cool":0},"IjZbkARkZzx7M9NVSKhT5A":{"text":"Would not have come here if I was just walking by.  Came here on a recommendation from a f","useful":0,"cool":0},"pAnt7_ZY_ZGSTDUzV_74LQ":{"text":"Took my daughter to Cafe Adelaide before she moves up North for college.  She wanted some ","useful":0,"cool":0},"l4gs7GiMd89RHqmzZm-4RA":{"text":"I had heard great things about this place. My boyfriend was excited to take me. When we go","useful":1,"cool":1},"OSGvOjAdrbsvXd-FNk85nQ":{"text":"We went for breakfast on a Saturday morning.  Since we were in town when the Sugar Bowl wa","useful":0,"cool":0},"hA_vDqalnwl7twpQ5LLoNA":{"text":"We happened to stumble upon this restaurant when we were visiting family. My dad and I ord","useful":0,"cool":0},"Xv2KCpfQAbjZPtZG_6S2ug":{"text":"After wandering around looking for a place to eat dinner, someone we ran into recommended ","useful":0,"cool":0},"FjZ6UD-vW37vGys9kxuFcw":{"text":"The food was incredible...well at least most of it.  The shrimp corn dogs are a must have.","useful":1,"cool":0},"u_jk3cGFZ4k9BfFwGcZbvg":{"text":"I don't always have high hopes for restaurants inside of hotels, but this place made me se","useful":0,"cool":0},"6kbBxaSbfAXWLkpF8rFcOg":{"text":"I have gone a few times, but this time, service was terrible. Waited 30 minutes to have ou","useful":0,"cool":0},"ox2N62MiZZnDuP8fVlqMDw":{"text":"Great dinner! The service was great. Our server was very attentive. This restaurant is loc","useful":0,"cool":0},"thTL5_d82gGS2aLrFciEFw":{"text":"Fourth time here this weekend! This place is fabulous. I know I should try different place","useful":0,"cool":0},"Iwp-UCauzhm7y_PWUQp1yw":{"text":"My Saturday brunch in NOLA.\n\nI had heard good things about Cafe Adelaide so wanted to chec","useful":0,"cool":0},"4k-XUWBbeDyxjWdUrEsvLQ":{"text":"Stopped in for lunch, mainly because it was in my hotel and I wanted a quick bite. Had the","useful":2,"cool":1},"2mjC-Lx-gwFskvpPgPaGdg":{"text":"Came for lunch. LOVED it.\n\nWith 25 cent martini's, how can you go wrong?\n\nAs soon as we we","useful":2,"cool":1},"JMfBxJ1gTbTrOINWIS1VWQ":{"text":"This place was exactly what I was looking for on my trip to New Orleans during Halloween w","useful":0,"cool":0},"QAjSiKSOBimsND_3FJ96-g":{"text":"Meeting Venue Review: 3.5 stars\n\nBeing in the CBD, this venue is easy to get parking if yo","useful":6,"cool":2},"3y9KhPY52-vFRmv5Gpi7yA":{"text":"I use Yelp a lot and have meant to contribute more, but always find an excuse to be lazy. ","useful":0,"cool":0},"KVy8uVYFZupLsKmJ0qGngA":{"text":"A group of 4 of us went for brunch before the play.  The atmosphere was good, but the serv","useful":0,"cool":0},"bh_1FgFtOSvelorlJqJtzA":{"text":"Sunday Brunch. Not impressed. Granted, Brunch is almost always going to be limited on sele","useful":0,"cool":0},"KXTIG2R23BqQIKlWMyFJAw":{"text":"I was sent here by the concierge at Harrahs hotel, and she did me a great favor.  Breakfas","useful":0,"cool":0},"iNwYvI0SLmmwLYVp5gTceA":{"text":"Ambiance nice, food tasty, love the corn dogs although 2 for $8 is pricey, but the issue h","useful":0,"cool":0},"_uljLAcDOtpDgeOsLfYYWg":{"text":"Whenever I'm on vacation, I try to balance out between street eats and fine dining, this m","useful":3,"cool":1},"jzpBOqDm4GrUndb32TPY1w":{"text":"A nice welcoming staff and classy atmosphere. We shared the eggs Benedict which they kindl","useful":0,"cool":0},"HYOHkvaYbJKqAT4nmgjIsw":{"text":"Went to celebrate a birthday with six ladies.  We all wore a hat b/c the concept was so co","useful":0,"cool":0},"lOz9bB__04svxMi4hv7VjA":{"text":"The ambiance was great and the coffee was spectacular. However, it appeared that there was","useful":0,"cool":0},"G82zev5H5htVx66vGBu3dQ":{"text":"Best meal we had in NOLA! Great servers. We went for Sunday brunch and they have black and","useful":0,"cool":0},"YG37Cq1DhfeQ-JLgIUevgQ":{"text":"Had dinner. Shrimp gumbo was good. Ordered Scallops but received pork chops after a one ho","useful":0,"cool":0},"fcpw2pTN1PHBY6rgeIGHWw":{"text":"Terrible service! First of all they don't serve lunch after 2pm. Which is pretty bad idea ","useful":0,"cool":0},"6qiosc-ELKF8N_PBPrBznw":{"text":"The food at Cafe Adelaide was not the worst, but the experience was the worst I've had in ","useful":0,"cool":0},"9Dk_6iaBOM6CqMFwRe1f8w":{"text":"Service was good. Food was cold and the Meg's soup was super salty.  The Drum was ok but I","useful":1,"cool":1},"ULioZngDVhIqdSevwlgngg":{"text":"We went to Cafe Adelaide today for brunch with two other friends. Surprisingly, even with ","useful":0,"cool":1},"suNQaiU8Bznoxh9HxLtwiQ":{"text":"The bread and butter totally killed my diet, so I decided to cheat all the way and got the","useful":0,"cool":0},"a4DGaL0VbI-yIzz9fc7wQQ":{"text":"Tried Cafe Adelaide for a light breakfast.  Ordered citrus berry parfait with pecan granol","useful":0,"cool":0},"eJD9bF5cOrY-M8FdaL5rNw":{"text":"Although I have been to many brennan owned restaurants, this is my first and last time her","useful":0,"cool":0},"ARQBQSuaL0zveoWyMq0Wbg":{"text":"I wanted to try a new place for lunch, and I heard Cafe Adelaide is the place to go for th","useful":1,"cool":2},"azH5ElFnnehNjlBg6Qutgw":{"text":"Don't bother, went for a nice bunch and was handed a basic breakfast menu, only to find ou","useful":0,"cool":0},"XjVW6Lzysn6EyjXTfhbKtw":{"text":"My wife and I have been here MANY times, so this review will be a summary of our experienc","useful":1,"cool":1},"1IyYs77P7O1VPrzWMhUoXA":{"text":"I've been to New Orleans three times, and I've eaten breakfast at this restaurant three ti","useful":0,"cool":0},"jhp_X22s-Prp7ymevYGcsQ":{"text":"We are a large party of 8 which kept getting bigger.   So we were a strain for the waiter:","useful":0,"cool":0},"8c_OGVchnbHfQ7Ho1ZKKzg":{"text":"Advertised as having Gf options, but they were not accommodating. They ended up bringing m","useful":0,"cool":0},"QFVv13XOUEFZX79QSlySDQ":{"text":"What a ruckus. \nI'm taking about broken dishes, cold food, soggy potatoes, to a point wher","useful":2,"cool":1},"FHhuNL0NKyoHspzrmV_IjQ":{"text":"There were five of us for dinner who ordered everything from filet mignon to duck confit. ","useful":0,"cool":0},"159dpDigjrYmNZ9uIqyODA":{"text":"We really like this place. \n\nNice ambiance, good food and service.\n\nGreat location downtow","useful":0,"cool":0},"oNWgKCBmoNhDgVnEE2hlpg":{"text":"Delicious gumbo, superb service, best BBQ shrimp I have ever had. BBQ shrimp was the perfe","useful":0,"cool":0},"ERcYRspaaRSAIGIgNeyJIA":{"text":"A great brunch secret downtown is the Brunch with Hat-ITUDE at Cafe Adelaide. Basically th","useful":4,"cool":3},"ooaGwqouLQsD9j9iFAt4Sg":{"text":"Sunday brunch.  What's more, it's going to be a wonderful day when I get THREE martinis - ","useful":0,"cool":0},"dpZ-v2ZJ8QdikRdxDt-Q4g":{"text":"Definitely a more casual and more appropriately-priced Brennan's creation (esp. considerin","useful":0,"cool":0},"GskyWk6a7imftoi7oQUEPQ":{"text":"The service at the swizzle stick bar is very good. The bartender recommended a hearty sala","useful":0,"cool":0},"R_BuhsLml7L_129M1zoYjQ":{"text":"My husband and I had breakfast here. I ordered the bananas foster French toast. The food w","useful":0,"cool":0},"m0vhqg3OXBailMyyue8VUw":{"text":"Okay here is the deal... 25 cent martinis and shrlmp corn dogs.  YOWZA as wonderful.  Grea","useful":0,"cool":0},"DaWbPBDbbGyKca0zhIf5zA":{"text":"Absolutely yes. \n\nJust came here for restaurant week and was not disappointed. \n\nFor a 35 ","useful":1,"cool":2},"t6ROXaro-qBbGaN2VKXMOg":{"text":"Very accommodating with a delicious vegan meal.  In addition, Katherine says the French Fr","useful":0,"cool":0},"pnZ56rj22YQ7BGhKF1UEUA":{"text":"Went for brunch with an old friend. Was sat promptly. Had a bloody mary which was deliciou","useful":0,"cool":0},"Q3qWl3s5U0WS-8f9eQ9O_A":{"text":"Been here 3 times for lunch now and it never disappoints. 25 cent martinis, amazing. Food ","useful":0,"cool":0},"wfb9Wc_7H0p85_DOGc-Arg":{"text":"We had planned to check out Commander's Palace but it was way out of our price range, so w","useful":1,"cool":1},"jb36hycTVtgD0y3ysEDKDQ":{"text":"Went to dine here because I didn't want to overpay for room service at Harra's hotel. Righ","useful":0,"cool":0},"i5wtH2xKaKS9MEVRqaKuWQ":{"text":"I had read good reviews of this place, and decided to go here for my last meal (weekend br","useful":0,"cool":0},"K4VCMOdNF01l7b5UEQCHiA":{"text":"Food was delicious!!! Osso bucco so tender and flavorful. Fell right off the bone. Bbq shr","useful":0,"cool":0},"ld5pItBvTwYkgENDWTlhWw":{"text":"Try the turtle soup but hold the sherry. The soup was very flavorful but I feel like it wa","useful":0,"cool":0},"QjzkQzEuFJkCnTwOqQb3OA":{"text":"Brian was my bartender... I ordered my first drink and then almost an hour went by without","useful":0,"cool":0},"iUO5E41Xethy8H8o0Pdvrg":{"text":"In my opinion, the food was way too salty. I ordered the blackened tuna over blue crab ric","useful":0,"cool":0},"u-fJJU_o0nS_snrzKmXF8A":{"text":"Service was slow and food came out cold. Drinks took 20min. To get while I watched my wait","useful":2,"cool":0},"htV7Csp1Mkpd_5Pg8f7w9A":{"text":"Local couple.  Went for Reveillon.  It is not on the menu nor does the waitstaff mention i","useful":0,"cool":0},"fU9U4hmQhoPgDtHx8aaqvQ":{"text":"Had Xmas Eve lunch here. Great service, food and .25 cocktails. Had a great catfish salad ","useful":0,"cool":0},"wclO3MtTgZ9s1JoQca0zBA":{"text":"We made reservations on line, it was nice to be greeted with confirmation of our special r","useful":0,"cool":0},"z9eZ5w8pHeXA5d7WMClD2Q":{"text":"I came here for lunch today. The wait for a table was about 20 minutes, so my dining compa","useful":2,"cool":0},"LRTNshxR-wsobJ2L9EDM-g":{"text":"Beautiful decor, great staff! Food was good, nice presentation, had turtle soup for the fi","useful":0,"cool":0},"GmiZyhstdAy3CvZj9rLtAg":{"text":"One word: delicious. We were enticed by the $0.25 martinis (limit 3) at lunch time, becaus","useful":0,"cool":0},"XLRETkhF-aYV1q5KUOcukQ":{"text":"We decided to do last minute lunch here since we stayed across the street and I'm so impre","useful":1,"cool":0},"lsXrrfqmQ5tk7_hGIW7V1g":{"text":"Who knew it was inside of Loew's Hotel....I sure didn't...what a pleasant surprise....I or","useful":1,"cool":0},"bipwWvyx4LxrZFy0GPnguA":{"text":"Food is usually great, brought a friend in from out of town for the hattitude brunch. serv","useful":0,"cool":0},"aIe-JVDt-nr4qEAnZMpC8w":{"text":"This was the worst dining experience I have ever had in my entire life.  I'm 31 and eat ou","useful":4,"cool":0},"XHV8aWwmoD7QTa4HZppPhg":{"text":"Another 4 stars for a place to eat on NOLA. Yelp has been on the money so far. 4+ is worth","useful":1,"cool":0},"U-edjOMG0LoFBe_SCCmffQ":{"text":"Everything is salty even the side of wilted spinach.  Ask for less salt and you may have a","useful":0,"cool":0},"tdJ1hE5_CG6WvDIVFH3C8w":{"text":"Shrimp and grits... Flavorful, well prepared and quite filling.","useful":0,"cool":0},"aH72VEuz0Jit6P8iXSAd2Q":{"text":"We had the power lunch here: order an entree and you can choose to purchase up to three 25","useful":0,"cool":0},"9MfxhZmwobvapmId33mIig":{"text":"Service was slower than expected, but it was peak dining on a Sunday. The shrimp 'corn dog","useful":0,"cool":0},"JjSX3A5MsRhGpPV0e-k1Sw":{"text":"The prices, food, and service were excellent! Highly recommend for happy hour or dinner. H","useful":0,"cool":0},"huKHPcGYVwI1pouSo8zSVw":{"text":"This review is for the Host only. \n\nThis has been my Go-To place for years. I brought an o","useful":1,"cool":2},"D-otI4MiEhNlJ5yU1Tuneg":{"text":"Had our best dinner in New Orleans here.  started with a tasty ginger liqueur and vodka co","useful":0,"cool":0},"TI43QU0QwCdCQZSwf-qqCw":{"text":"I would give it less if I could. My hubby and I showed up super casual for their brunch. T","useful":1,"cool":0},"83m1gKeLYNN8MzwTcmmjYA":{"text":"All food was tinged with the taste of sorrow. Really did not enjoy even the breakfast bisc","useful":0,"cool":0},"Rz1hm-TGoFerUKUBEOt97Q":{"text":"The food here was outstanding and wait staff was great. Doesn't get much better. Returned ","useful":0,"cool":0},"F1B-ykmzkHRUMxECX9ODPQ":{"text":"Amazing food for brunch. Swizzle stick for a nightcap. Dinner is also delicious. We includ","useful":0,"cool":0},"PhDSaSWqidk4vSUVFXmR0A":{"text":"2.5 stars for an \"OK\" rating.\n\nMy one and only eating experience at Café Adelaide was this","useful":6,"cool":4},"ULVqwpIXfj2FxZO3cvraIg":{"text":"I had the fried oyster chopped salad.   Amazing!! The 25 cent martinis were a nice bonus. ","useful":0,"cool":0},"VLLfBo1ghWGq9CpsjxyZeA":{"text":"You must come prepared to stay all evening because the meal is served at a meandering pace","useful":0,"cool":0},"np5e6BU_rm-j5FD6cCvAeg":{"text":"Horrible service and service. After reading the reviews I had high hopes for this place, b","useful":0,"cool":0},"qPgFnpkiUAUiMz0dZpY0Fg":{"text":"Located on the first floor in the Loews hotel. Brunch here was fabulous! Excellent food, e","useful":1,"cool":1},"-X-g2BXh0xp_L38wFv_OuQ":{"text":"I ate recently on a Sunday at 1:00 pm.  In the past the food was consistent. This time the","useful":0,"cool":0},"PdxWEL-drisuj01RGXuVSg":{"text":"Having recently moved from the New Orleans area, we would book a table at Adelaide for bre","useful":2,"cool":0},"6G3_Si1KbDPFqvqzEQxxtg":{"text":"San Francisco foodies visiting for conference, and happened into this place by accident. W","useful":0,"cool":0},"hMxWbxYlsyOvX4fB309_6w":{"text":"Aristotle said, \"The whole is greater than the sum of its parts.\" Well, that's only partia","useful":0,"cool":0},"EdZfcuEQGC9Kr3RrksMiRQ":{"text":"I'm updating the rating to two stars because they reached out after-the-fact, apologized, ","useful":0,"cool":0},"MzW8TpFEpgg1IXy_AxQ4Bw":{"text":"Food was delicious but VERY expensive. Dinner for 3 people was well over $200. That being ","useful":0,"cool":0},"s0H8zAujAzUfMBo6mLyKsg":{"text":"As a Brennan venture, you are setting the bar pretty high to start.  Coming in on Thanksgi","useful":1,"cool":0},"AeWVUcF88Hl2U1cakTaSNQ":{"text":"Food is a 4.5 and service was a 2. The room is quieter than most NOLA restaurants, and the","useful":0,"cool":0},"Rhv7qnfHjFRca8LzymY3sQ":{"text":"Attended the brunch where if you wear a hat you get three drinks free...however, note that","useful":0,"cool":0},"Cpn9jv8bNfCePI8aJIzZcA":{"text":"Great brunch for St Patty's Day Sunday. Chef had special corn beef hash made similar to cr","useful":0,"cool":0},"nltbuO99X4hgdl0IhQxYrw":{"text":"My husband and I were in New Orleans the week of Thanksgiving & I booked a 1 PM reservatio","useful":0,"cool":0},"jGMLga_odssn9rRRMIzc0g":{"text":"This place was just ok, mostly because of the service. It took forever to get our water an","useful":0,"cool":0},"q-N22FGKNlodS0fE5uFzlQ":{"text":"We enjoyed Easter brunch so very much! The food was cooked to perfection and the staff was","useful":0,"cool":0},"IqB_D_nVgxnipGZ5erQbxg":{"text":"We had a stunningly delicious breakfast this morning and the service impeccable to say the","useful":0,"cool":0},"TERPR02PwB7ZP7qTwh3sWg":{"text":"I was in the mood for trying turtle soup and this place had good reviews and was a few min","useful":0,"cool":0},"GcZalb64ABLpY8ah4D3pFg":{"text":"!!!NO BOOTH FOR YOU!!!\n\nAfter a week of anticipation I finally got to go to eat at Café Ad","useful":1,"cool":0},"Fv3J4m-f9dY4NOct12T64w":{"text":"Great service! Leon was so wonderful, we wanted him to come home with us. Instead we raved","useful":0,"cool":0},"N45HoSXkiaEWmSZZ7MjDBw":{"text":"So let me get this straight - I wear a hat (not a baseball cap) to brunch and I can drink ","useful":5,"cool":3},"YfOMKZg7gcsXaHqIXBbngA":{"text":"We went here after failing to get a table at Cafe Adelaide's mother restaurant, The Comman","useful":0,"cool":0},"bSNp0V3I2VIkjpAte63Uzg":{"text":"I don't know what your doing reading this and not driving-running-biking there right now! ","useful":0,"cool":0},"cj3MOvqAPLh_HZL3KKSuGg":{"text":"absinth was banned for sometime and now legal again you can find some places serving sazer","useful":2,"cool":1},"g-M9LvKFbtEF0-Ki60zw1g":{"text":"To say the service is poor would be an understatement. The waiter served me dairy after I ","useful":3,"cool":0},"9ohgPbmIjYLLHFiPXaVJ-g":{"text":"Visiting NOLA and stayed at the Loews Hotel. Stopped at Cafe Adelaide for breakfast and re","useful":0,"cool":0},"xJ55LmP4xXe_B43vifclIg":{"text":"I dined at Cafe Adelaide twice. First time was a Saturday night with my boyfriend and serv","useful":1,"cool":0},"2tp3ZHJCYNVx4ewGhDSFDQ":{"text":"Thanksgiving Dinner Review:\n\nThis beautiful holiday boasted a wonderful staff that rotated","useful":5,"cool":1},"yZW5lQOQv7Qsl-Mxf5FrHg":{"text":"During a recent trip to NOLA, we went to the hat brunch at Cafe Adelaide. The hat brunch c","useful":0,"cool":0},"n_wzHaFr32sardH5Yp3IBw":{"text":"We were stuck there for 3.5 hours for my 30th birthday dinner. We made reservations for th","useful":1,"cool":0},"eDZGzI7kUbr1fCjhFBz3Rg":{"text":"A place to feel old. Nothing tendy or vibrant feeling here. Food was ok but have had much ","useful":0,"cool":0},"yjXuV0G93_839Dtd4IJUPQ":{"text":"Wow. Abominable last night. Cafe Adelaide, you lost me.  Probably the worst service I have","useful":5,"cool":1},"5NdZlYaOiplqmYIefdzyRw":{"text":"Adelaide made for a great Friday lunch break. service was prompt and our server was happy ","useful":0,"cool":0},"GWEIajRR7ntRmxOGQ9q7WQ":{"text":"So our travel book said that NOLA was the place to be for Christmas and, even better, that","useful":0,"cool":0},"us9sJjNqqR1WGjKAN_lVcA":{"text":"First of all, excellent, EXCELLENT service. Everyone (and I mean everyone) very attentive ","useful":3,"cool":1},"-dTwNLux_RUai2EZCubgaw":{"text":"Satsuma salad, the best marinated pork chop evah, white chocolate bread pudding and brandy","useful":0,"cool":0},"87PeZ_4PlioWAyJfptJfng":{"text":"Went here for brunch.  It's your typical brunch fare, nothing too special.  The staff was ","useful":0,"cool":0},"m7JHNZGlhcq0EMEki5cVjg":{"text":"Astonishingly good in every way. A real asset to the CBD and the Loews Hotel.\n\nI chose Caf","useful":2,"cool":1},"ummzhQCCIbF0ssL8_ZPxLQ":{"text":"Not sure about the hype.  Good, not great.  Plenty of other choices around town.  Perhaps ","useful":0,"cool":0},"SsWDYiA38ig_3m3jJjc9_g":{"text":"The brunch is pretty good. There are several local southern dishes that are kicked up a no","useful":0,"cool":0},"NqRQkXJjYBYrsR2tv71p1w":{"text":"Our servers were friendly and funny. I had the Primm cup which amazing. Perfect blend of g","useful":0,"cool":0},"9MjIaRZs7LhvIC-AR30IyQ":{"text":"It's been several years since we've eaten here, so I figured it was time to give it a try ","useful":1,"cool":0},"0IIF1LWqFWoVG0nHQuWIsQ":{"text":"We went here for my birthday with a group of about 14.  The portions are small, the prices","useful":4,"cool":1},"VAHfI-jD7uGZ1xpB1KJZvA":{"text":"We were staying next door at the Harrah's Hotel.  Went across St. Peters to Cafe Adeladie.","useful":0,"cool":0},"Go7VrtWOKfNyj-I0e1KHzw":{"text":"I tried to dine at this restaurant on March 1st. We arrived at 520 and was told my a waitr","useful":0,"cool":0},"GTt6-r3vbB-mQqGSNMK6Jw":{"text":"Finally got to try this spot for a relaxed Friday business lunch. It was restaurant week a","useful":1,"cool":1},"EhClhSkDWX4QZmXzVITGkA":{"text":"Cafe Adelaide, what the heck happened to you?!?!  We've been coming here for years for lun","useful":0,"cool":0},"dhGKs72gOmYo6jG9sZ4nYA":{"text":"LOVE!!!! Came here for Sunday brunch. Firstly, a very fun place just because of the bright","useful":1,"cool":1},"EG4POnC5ywIyMC_KRnTnLQ":{"text":"Had reservations for 9 am. Took 15 minutes to get water and another 15 minutes to get my B","useful":0,"cool":0},"qHVrXdmA-WUkE7RDbD0msw":{"text":"I took my wife here for a anniversary lunch, while in New Orleans, since we were not prope","useful":1,"cool":1},"G2ceBNmycVQ8bZimJoRRGw":{"text":"My goodness, where do I start?! This restaurant is nothing short of AMAZING!\n\nMy boyfriend","useful":2,"cool":1},"weABiN9eSDzAZ3vR13NCYw":{"text":"Finally made it to Café Adelaide for a Christmas lunch a couple of weeks ago, and the food","useful":4,"cool":3},"usrCLS9CnOWJIhmQV_Jo0Q":{"text":"Our conference came with a dine-around evening for each district team, which was great so ","useful":0,"cool":0},"aL1eshQ8T9zUl_b-aCfMsg":{"text":"I came here for a work lunch and I must say we were all impressed.  We were seated promptl","useful":1,"cool":1},"6cwpUOcpGAxrRy33djhugw":{"text":"Came here on my birthday this weekend and had a blast! The setting was very pretty and wel","useful":0,"cool":0},"QIydcyW2e9EvCs2aCRX9xw":{"text":"I have had a couple of girly brunches/birthday events here & they are wonderful. We always","useful":0,"cool":0},"2MVXjtLPhUYxe7TXEaI1YQ":{"text":"Great location. Attentive staff. Filet mignon was top shelf. The bread pudding was one of ","useful":0,"cool":0},"FBKOd9bSEE9YxI2qKvoRhQ":{"text":"Adelaide, Sweet Adelaide\n\nIt was a slow Sunday evening and the place was pretty quiet.  Th","useful":0,"cool":0},"Be5mbrzR5muir2-0uvEpnQ":{"text":"Went there for a late breakfast and was kind of disappointed. Went on the strength of the ","useful":0,"cool":0},"RPX-wNAe68dDb1a5W6T_SA":{"text":"We stopped here for dinner before heading over to the French Quarter. \n\nWe had no wait. We","useful":1,"cool":1},"qvGsdXM2TI6ffY37A3blRQ":{"text":"We were in New Orleans for a wedding and we stayed in the French Quarter which was fun but","useful":0,"cool":0},"X4WpjBl2cwk6fcCVkCsXgw":{"text":"Fine dining in New Orleans! This is an extremely nice place, though casual attire is fine.","useful":2,"cool":0},"OMp7pDvBqsxFcJCN6bfebw":{"text":"I went to this fine establishment with my girlfriend and her two friends. We only went bec","useful":0,"cool":0},"paiCbf6MwwStgwJxm6OpAg":{"text":"Service: 4 | Quality: 3 | Setting: 5 | Value: 4\n\nMust get: $0.25 Martinis\n\nYou read that r","useful":2,"cool":0},"rFHjPoyGvA5jAcPAR4X8SQ":{"text":"Wow, one of the best meals I've had in New Orleans.  I had the Shrimp & Grits (btw, it's w","useful":2,"cool":1},"Pii4Cf0Keij28DqnOjdaVg":{"text":"I had much higher hopes for Cafe Adelaide before dining in. We came in as a group of five,","useful":0,"cool":0},"RvqA1T39T-MkiELNDBzTdg":{"text":"This was my first time here. Came here for lunch with coworkers. The food was really good.","useful":0,"cool":0},"_wPhFMIi_xnYKtMiFJmt_Q":{"text":"I went to Cafe Adelaide for brunch for my mom's birthday. What a great choice we made to g","useful":3,"cool":2},"DP8EOc6pT3931oUDo6ghag":{"text":"Café Adelaide is one of my favorite restaurants. If being owned and managed by the same fa","useful":4,"cool":4},"3XPBYERD6YLJ-2aXmtP1jw":{"text":"Well we went there last night, superbowl, so you can just imagine the crowd here in NoLa!\n","useful":0,"cool":0},"cfM8ycpD93lBDVQ3TCo8Xg":{"text":"Had a great dinner here in the ground floor of Loews hotel. Sat in the bar area at a small","useful":0,"cool":0},"84gJP-kMzWK8g-2u20ov9A":{"text":"Two weeks prior, my friends and I decided to have our 'last night together' in NOLA dinner","useful":7,"cool":1},"ALBfUqjKAxhUJnmbyZMryg":{"text":"Let me start by saying that the ambiance in this place is very inviting. The staff was sup","useful":0,"cool":0},"LppRKrM_7qPCw0VvJu0Bew":{"text":"The service is fantastic and the food was better than average (shrimp and grits for brunch","useful":0,"cool":0},"pwUTDDEact1atyaJd9wZtg":{"text":"After scrolling through the top reviews, and from friends I trust, I'm wondering if our ex","useful":0,"cool":0},"7bN7cQd6xk7oQ24ZPvc2BA":{"text":"Very solid restuarant with great food and service. If I dine here a second time and my exp","useful":0,"cool":0},"nVD1Wfs4CHCeMwdtxf4ipA":{"text":"Came here a couple of times, as I was staying in the hotel. My second visit was the best, ","useful":0,"cool":1},"ZonLQ7-zKRgK5-8EzcP1Og":{"text":"We heard great things but were somewhat disappointed with the ambiance when we walked in. ","useful":0,"cool":0},"95x6tEtwTcq_8PA6EeNC1Q":{"text":"The food is good, especially the breakfast.  However, after spending a weekend at the Loew","useful":3,"cool":1},"hYizQqJLnATjecvoP-DV9A":{"text":"Service and food just ok. Had the gulf fish and satsuma salad- salad was yummy, fish was j","useful":0,"cool":0},"mJztzBdDUutL6mPwbCBwfg":{"text":"The food and ambience was great but the staff were slow and rude. We had to wait 20 mins s","useful":0,"cool":0},"Y58iglGRfpWBpHZ2MLA4GQ":{"text":"Food was excellent and our server was great. There is a good variety of food - something f","useful":0,"cool":0},"EjMLZ8Pcmu5QKGp1uB7vag":{"text":"Reliably good.  Not great inventive food but perfectly done classics, like turtle soup and","useful":1,"cool":1},"Xnz7cppLLd9ERliYHeg4Fg":{"text":"Had dinner here this evening.  Was good, not great.  Service was a little lacking for this","useful":1,"cool":0},"BSrV2iR-seijuVJQs2MtgA":{"text":"I absolutely love going here--the food and craft cocktails are awesome! I really like goin","useful":0,"cool":0},"rTg7khYx1H6_wah144OICQ":{"text":"I was pleasantly surprised at how good the food was here!  The decor is loud and a little ","useful":0,"cool":1},"caB3IzTIeY_lhGFd-rrZmA":{"text":"Okay. English Pea Soup with Applewood Bacon. Seriously good. Crazy good.\n\nOrdered the ribe","useful":1,"cool":0},"TQDlvrQuiUdXrUuHQBqbLA":{"text":"Maybe I came in with too high of expectations, but this place fell a little short for me. ","useful":1,"cool":1},"obNOb_dcDczh4irsSKZCsA":{"text":"Worst service, if you work in the service industry you need to at least pretend you're hap","useful":0,"cool":0},"si7eOrmDObluEEx-PpjWuw":{"text":"been twice now, the Late Harvest Ponchatoula Strawberry Salad alone was worth the return t","useful":0,"cool":0},"gKRjjdDuf5DD01ur7xX32Q":{"text":"We chose Cafe Adelaide from recommendations saying they had a \"vegetarian/vegan friendly\" ","useful":2,"cool":0},"oL5oqM54T5dc9DHy3EgNoA":{"text":"Having just had one of the best - if not THE best - meals of my life at Commander's Palace","useful":0,"cool":0},"ZWL4e-o3IjGjwaRBB_zQtg":{"text":"Ambiance was fun, bright and clean. Be sure to come donned in your best hat for free drink","useful":2,"cool":0},"IYrl-Ll8Q8JTzfXsgJS_pA":{"text":"Had a quiet dinner here and came away really impressed!  We wanted something casual but wi","useful":2,"cool":1},"E2sO2bwUepSCBal7MCkH6A":{"text":"When I stayed at the Loews hotel when I went to New Orleans, I ate at cafe adilade for bre","useful":0,"cool":0},"SVSEgcKsPFcOvJUKTf7jSA":{"text":"I'm hating writing this review because I expected so much more. \n\nI'm a huge Breenan's fan","useful":14,"cool":7},"ds6zar9lq1xTssgH5F9aEw":{"text":"We had a large group dinner here.  We had a private room, which was nice.  The service was","useful":1,"cool":1},"s3o9RtI4Yv5OrBSoOu3ymg":{"text":"3.5/5 - lunch \"packages\" are a good deal, but the quality is just-OK.\n\nwent here with a gr","useful":2,"cool":1},"lnBGRysbWXRNjDEwHAdoHg":{"text":"One of the best meals I had at Tales of the Cocktail.  Their tomatillo Margarita and class","useful":0,"cool":0},"1PT2EukqyKha1w0oGrr97g":{"text":"Had the brunch there on Sunday.  I really enjoyed the appetizers and main courses.  I plur","useful":0,"cool":0},"nT86fJHxiBSSwkpp4fwz2A":{"text":"Good food, gluten aware, great service","useful":0,"cool":0},"c7XPuwU7yzc0m8BmTxL0pA":{"text":"We went for Valentine's day, my wife had the filet mignon special that includes a glass of","useful":0,"cool":0},"uMEvXPTDgqjMDKpoaLUaNQ":{"text":"Saturday brunch was uninspired and over priced. Should be 3 $$$ for New Orleans a place of","useful":0,"cool":0},"tF0PR9y0rABx6UdT1hMiQQ":{"text":"Love this space! Although the lobby and restaurant both look very fancy and updated, the p","useful":0,"cool":0},"fMjQ52yLcvNNH77Wr3pMBg":{"text":"The place was a1/4 full. What a shame. The drinks in the bar were made perfectly and reaso","useful":0,"cool":0},"mxcFxdD4zt3BeiHGq-B-FA":{"text":"Don't let the name fool you, this \"Cafe\" is dressy and the decor is modern chic. We came i","useful":0,"cool":1},"G4y-YvajfT-w9H9_IP7jZw":{"text":"As with most reviews on yelp, I agreed with what other reviewers have said. \n\nThe turtle s","useful":0,"cool":0},"1YRVMukq4C5CdzuEUYYSCg":{"text":"I made a lunchtime date reservation just before the holidays. I chose Cafe Adelaide for 2 ","useful":3,"cool":1},"R83QfbfQTOElDU_PtVZJpQ":{"text":"This place is really nice. It has a great ambiance. I had the shrimp corn dogs and they we","useful":0,"cool":0},"aOIuei-EHjhR5cmNX-WceQ":{"text":"Good food. Had the salmon and it was delicious and cooked perfectly. Service was good, nic","useful":0,"cool":0},"Rjpeu4pZ7V-jXARglZNCRg":{"text":"So I found a brunch place for us on yelp. Perk: They offer free martinis for wearing a hat","useful":1,"cool":1},"wHtQMPtSVL6rNRTipjG1RQ":{"text":"I visited this quaint restaurant while on a business trip to New Orleans. After a night ou","useful":1,"cool":1},"11BYyQqCj-dz2J2j5br0Gw":{"text":"Worst service ever! It took 1.5 hours to get the appetizer, it took 30 min before someone ","useful":1,"cool":0},"0BtXVAXlYZK04DtYnxBxZQ":{"text":"In summary, I wanted to love Cade Adelaide, but one of their servers was a total butthole ","useful":4,"cool":2},"N69xo8Tp7yhA8-vJwq3szg":{"text":"Had a superb dinner here tonight... in fact, I can't remember the last time I ate somethin","useful":0,"cool":0},"9kHKQt2KeEyg5p9Hp-04TA":{"text":"I am going back and forth on what to give to this place. Whole the food and the ambience w","useful":2,"cool":0},"s_JuOzZAkFCR3jxusx2ONg":{"text":"At Mardi Gras this year breakfast was great! We came back 6 months later to try again, and","useful":0,"cool":0},"3Ojtf9QW5eRfNmN7kq5Sbg":{"text":"This place was absolutely excellent all around. The wait staff prompt, courteous and knowl","useful":0,"cool":0},"WEP8xZTwhijYI1X05K6MXQ":{"text":"Went here for a vacation Thanksgiving. Great food, great service, hooray!\n\nI'd made a rese","useful":0,"cool":0},"9QvT-2XP2tRZ70a9-a1VpA":{"text":"Beware of the false ratings here folks food was horrible service was a joke . All the food","useful":0,"cool":0},"yI_--qarLd0_yf8-Kf4wlw":{"text":"We came here after a failed reservation attempt for the Commander's Palace. Cafe Adelaide ","useful":2,"cool":1},"sJa93h3O5tnuSNnbqYAXfA":{"text":"Came here for breakfast with the girlfriend this past Monday(12/17/12) as I had heard they","useful":3,"cool":2},"uV1Seix5Qy5FInj62i1PWw":{"text":"My friend and I decided to try out brunch and wear some fun hats today. \nBe prepared that ","useful":1,"cool":0},"qLFky_zKwl847Gn9HDChzw":{"text":"Another Brennan Family restaurant! Café Adelaide is little sister to the famous Commanders","useful":1,"cool":1},"lAPZivfLlTttwh6Xn9M6Kg":{"text":"The brunch burger was amazing and the brunch cocktails were awesome but the service really","useful":1,"cool":2},"rMhJpjY8f57pO9RFYrS-Hg":{"text":"Service here is horrible. The waitresses seem very uninterested in taking your order or as","useful":0,"cool":0},"CrT3R9pyG2MPKhEcTTxbrw":{"text":"Delish dinner. Went in for an early meal with our little guy. The server was so cordial an","useful":1,"cool":0},"vXtV3uFpDEzkXGFFC79spQ":{"text":"Worst food I've every had in New Orleans. Meal took over 3 hrs. Did not get our entree unt","useful":0,"cool":0},"1cDcf28lYyZvZCPSDJMnFA":{"text":"I was a little disappointed with Cafe Adelaide. We were so excited to try this restaurant ","useful":13,"cool":6},"yYmLuy7qrzIxpP6Kh-acDw":{"text":"We chose this place because it was close to our hotel and also had good reviews on yelp. T","useful":1,"cool":2},"ipaRwizoea2MtO29C0y9MQ":{"text":"Great food & drinks! All of the staff here was very courteous and friendly. We tried makin","useful":2,"cool":2},"Ydx2f5MVXoVJS4i_fqxtLg":{"text":"\"WHYYY ARE WE WAY-TING?\" 4 waiters, me alone at the bar, I'm waving for service:\nCAN I GET","useful":9,"cool":4},"cW595Sh7k7p3Vmb8eSZMkw":{"text":"GOOD FOOD, $0.25 CENT MARTINIS\nfrom the superior Ella Brennan side, not Dickie or Pip.\n\nUN","useful":8,"cool":3},"JW9hg21a0WloN7GGfF0EHA":{"text":"I really enjoyed our dinner at Cafe Adelaide's. Located in the Loew's Hotel it was a littl","useful":0,"cool":1},"uumZbvs-Ouj-w-4PWp0nKg":{"text":"OMG, I was super impressed by this place! I am a huge fan of Commander's Palace, so to get","useful":5,"cool":1},"_KHUY9yug-PvAQHd9RTFsA":{"text":"Got the White Chocolate Biscuit Pudding and it was beyond amazing.  One of the best and mo","useful":1,"cool":1},"fAaKmVCMbwGa6KlZbYh16A":{"text":"Loved this place. So sad that they are closing. Glad I got to visit one last time. Our wai","useful":2,"cool":3},"rB01miWJ4dF-ybaHSSpaUQ":{"text":"Walked in this morning to be greeted with such wonderful staff and huge smiles. It just wa","useful":1,"cool":1},"uuN70wvObK3Rwsnk2xrd2A":{"text":"Pro tip: 1. complimentary valet. 2. Wear a hat for brunch for free drinks.\n\nThis has got t","useful":2,"cool":1},"sv7P_IugdrmXnkPlgOgHzQ":{"text":"25 cent martinis for the ladies (and men) who lunch.  i'll take a few, thank you.  (and th","useful":3,"cool":2},"Y50TdnkuafaspOa18MQIgw":{"text":"An OK \"fancy dining\" night..\nHad a table for 7.. Service was OK..& she was helpful when NE","useful":2,"cool":1},"hAvsXp_IAso1tbYmQw2kUw":{"text":"I want to give Adelaide's a higher rating, as the dining room is lovely and very comfortab","useful":2,"cool":1},"dvsG7kBm2p2BzkT4Gt6_EA":{"text":"We came here for dinner around 9pm and were seated quickly on a Saturday night. \n\nThe menu","useful":4,"cool":0},"Eheh6fxfw9Yd4MdONJcQTQ":{"text":"Best day/time to do Brunch downtown is Sunday right before a Saints Game. EMPTY=No wait. I","useful":1,"cool":0},"ywn4aplT_BUPLQdNssnEsw":{"text":"Cafe Adelaide was this year's Ladies' Choice for the extended family Mother's Day brunch. ","useful":2,"cool":1},"XTsPfCpkntX3fTDWkL59qA":{"text":"Okay, I'm biased. A dear friend works here, and I'm treated like the Queen of Nola every t","useful":3,"cool":1},"9EfaiVuhRlMiIY_fj2fdkA":{"text":"The ambiance here was very nice and the waitress and server was patience and kind towards ","useful":0,"cool":1}}