{"WV3Jafn4MFSuz2JsdEUpUA":{"text":"This restaurant was very good.  The reason for the 4 stars was just due to price.  It is a","useful":0,"cool":0},"CoSW8DjtEHxPdJiwrgFRWg":{"text":"Absolutely love Mandina's! The food, the service and the atmosphere, afternoon or evening ","useful":0,"cool":0},"mI9AJHnoIY_aIaJZd4tuQQ":{"text":"I can't find anything negative about this place. Just pure southern hospitality all around","useful":0,"cool":0},"8smIZzYOJiTp7ZxMsy8yGA":{"text":"Literally the worst service I have ever had. Food is fine. Can get better food and certain","useful":1,"cool":0},"viYuRjoF1N9of3-Iaxbxfw":{"text":"We wanted to get away from the French Quarter and didn't want anything fried.  So that we ","useful":1,"cool":0},"tkKaaKWsAgZs0OcPw-MMRg":{"text":"Great mid-city restaurant that was flooded during the storm but came back...even better.  ","useful":0,"cool":0},"50JBUEsMX2iLdCPHKqEILw":{"text":"Great food and good service. We were lucky enough to come during happy hour which is betwe","useful":0,"cool":0},"1XzO3mMFEo8wzSDxO2ufxw":{"text":"I LOVE Mandina's!!! My only complaint is that I don't get to go often enough. I'm head ove","useful":1,"cool":1},"y43zoNLYP3r5SfIuZcwLxw":{"text":"Always great food. Friendly and courteous staff. The reason why i gave 4 stars and not 5 i","useful":0,"cool":0},"k0tazJypuX1jGAkCLwTHnQ":{"text":"Turtle soup was wonderful. Parking is easy and no wait. Service, shrimp poboy and oyster p","useful":0,"cool":0},"utxRZf6NDHc7URgoq-tcEw":{"text":"Fried eggplant sticks, seafood gumbo, roast beef po-boy, shrimp po-boy, a couple margarita","useful":0,"cool":0},"XQ9akap7ME3gKY8PQbXl3Q":{"text":"I have enjoyed this restaurant for many years! I am just getting around to critiquing it. ","useful":1,"cool":1},"a0n45ZeMYBYq0OVPdwnurA":{"text":"I ate at Mandina's on 3/15/13. The wait for a table was ridiculous, over an hour. To be fa","useful":0,"cool":0},"WhaaXZPqw3NjfzUSdif52A":{"text":"The place is a hole in the wall but was packed. A security  guard was in the parking  lot.","useful":0,"cool":0},"4_K7CBX5dYBNS55CbRcUcg":{"text":"One of New Orleans' finest gems! Delicious food- Mandina's never disappoints! I get a cup ","useful":0,"cool":0},"HoIT5wcr_EMtmSqAGCsmVg":{"text":"This is not a touristic restaurant, and we loved that. The soups were great (we recommend ","useful":0,"cool":0},"smN_xfzxg3TjsPtDyDIgtg":{"text":"I really wanted to like this place more because it came with great reviews from locals.  T","useful":1,"cool":1},"EYVLKuDk-F5zKUoLWwu_5A":{"text":"Had dinner here on a Thursday evening at the suggestion of a NO native. Seeing the photo o","useful":2,"cool":0},"3JKpgW_oDgaRv5NQcQ8PkA":{"text":"We came here for Father's Day because it is one of our favorite restaurants and my father ","useful":2,"cool":1},"jqZsrH84gt8Jj80d6aV6nw":{"text":"The service is attentive, the turtle soup is perfect, the ambience is New Orleans- loving ","useful":0,"cool":0},"DnrZ-fHWFGuX9-sPWjbnWw":{"text":"Came to visit some friends for Bayou Classic and had lunch here. The best dishes were the ","useful":0,"cool":0},"q2JM-voiV_OJuKdqwJ0YbQ":{"text":"Mandina's was the first stop in my New Orleans culinary adventure.  I was looking for some","useful":1,"cool":1},"fOnL5njfsP3z5Nt0XGexdQ":{"text":"NoLa local favorite spot. Never disappoints. This time I had the eggplant parm, excellent ","useful":0,"cool":0},"ylsEjMIQbNLwJ3xzaykNmw":{"text":"Mandina's is mediocre. Simple as that. People with no taste buds like this place. The trou","useful":1,"cool":0},"BoWHaUTiyuLBJaplJUzNOg":{"text":"Yesterday, I had the chance to eat at one of my favorite restaurants. Now, everytime I com","useful":0,"cool":0},"kEjflKGHdcIBVXLT1QC4Xg":{"text":"Ate here on a Saturday for lunch. It had been recomended for their etoufee special. I trie","useful":0,"cool":0},"alvIucER1Xd9b4HP8W2Omw":{"text":"Authentic New Orleans. The locals love this place. When you are inside, look on the large ","useful":0,"cool":1},"PBDkMqjxsM0Nk_QozaUvrw":{"text":"My dad (75 now) grew up in New Orleans and is always one of his favorite places to hit whe","useful":0,"cool":0},"SAaN62fH6haG3dc3u9j4Pw":{"text":"Mandina is a place for families, it seemed like everyone knew each other there. The waiter","useful":1,"cool":0},"I4cDVDVvL7b5x2D9rv7Rtw":{"text":"I hope you have a refrigerator to put your leftovers in. They serve huge portions of yummy","useful":0,"cool":0},"t_G3yTqsHoNXFszzjP9Fog":{"text":"Friends brought us to Mandina's for lunch and we are sooo glad they did! \nWe arrived for l","useful":0,"cool":0},"qxtqY0p6SHjH56lAma-0HA":{"text":"The atmosphere very old-school New Orleans. So many great choices. Love the daily specials","useful":0,"cool":0},"xJNE9_ch2I7rbpOCIFzMlQ":{"text":"Very busy and apparently popular. Good food, but a little expensive. Service was adequate.","useful":1,"cool":0},"qF5Mh6J-kSxq16Gm9DVMxg":{"text":"Decided to have dinner here because of the high Yelp stars and it was also recommend by ou","useful":1,"cool":1},"M0eNl-_yTUXyuydLT1ifsA":{"text":"Love Mandina's! We stumbled upon this place by accident. Our uber driver drove us in circl","useful":0,"cool":0},"eJF2aTMdHsnFo7zshuu_4Q":{"text":"The best roast beef po boy I have ever had. The meat was tender and the gray had so much f","useful":1,"cool":0},"bRnN_tDVTX17t1BVkHH0hQ":{"text":"GO FOR THE CHICKEN PARM & SPAGHETTI! Their sauce is amazing. Even picky kiddo loved it! Gr","useful":2,"cool":0},"8DvJuRJQ1i3lTX7o6xGkKQ":{"text":"We came and started with a cup of turtle soup and then had a bowl of gumbo. So delicious. ","useful":0,"cool":0},"IL-EyckY9V8UQ9sindpQJw":{"text":"Gigantic portions!! My cousin and I stopped in on a Wednesday night when he was in town vi","useful":0,"cool":0},"snHG7KkxKt3Xaoo50Y0r1Q":{"text":"cab driver recommended this place, we were not disappointed. Great crab fingers, delicious","useful":1,"cool":0},"k7dmcINDR8HOGewDkn_Q3Q":{"text":"Split the seafood platter & had a onion ring app. Seafood platter was great & fresh. Also ","useful":0,"cool":0},"6x6AEEqOvN65Xl5JgO3XXg":{"text":"Can't go to New Orleans without stopping here for a great dish at a great value. Mandina's","useful":0,"cool":0},"Wbppt6naot9Ql0_H6dwnCQ":{"text":"I am in town for business and my cousin, who is a local, brought me to Mandina's for suppe","useful":0,"cool":0},"y6leNP69qsy8LtaUuhHO0Q":{"text":"Stay gold,Pony Boy.Great line from 80s movie,The Outsiders.I think of that line when I rem","useful":0,"cool":0},"PoCxW8dmzdZlisBp7qlatg":{"text":"The veal Parmesan is amazing! So are the eggplant sticks W/marinara sauce. The fried calam","useful":0,"cool":0},"3GvfU1IgbXlIRKUQFNB2gA":{"text":"Had lunch on July 4th. The red beans and rice with sausage was simply amazing! The fried c","useful":1,"cool":1},"dwLVAgAAmvgWlr__iP7dUQ":{"text":"The food was good but not excellent. The prices were much higher than the menu posted on t","useful":1,"cool":1},"4fTkW1PEm7gt3wWKxpyqJA":{"text":"Us 6 girls stopped in to grab a quick drink while waiting for our table at Ruby Slipper. A","useful":0,"cool":0},"WSC8KFBDSZ2HJl1kOFiGZQ":{"text":"I don't understand how this place has 4 stars. Mediocre food and service. Even desert was ","useful":1,"cool":0},"IGSGXVX0IyP3TejcXbk_uQ":{"text":"It took this place for me to realize that po boys are just not for me. Big crusty bread wi","useful":2,"cool":0},"gNMtGPL8vQPnKEYCkE721Q":{"text":"We visited Mandina's at the invitation of a local friend.  I was dying for étouffée, and m","useful":1,"cool":0},"Fw-3h6Asu0fzboKDAT_AxA":{"text":"My last night in Louisiana was made memorable by my dinner here. Soft she'll crab and frie","useful":0,"cool":0},"uDi89eBaEQTeH3fUJEVHrQ":{"text":"Not fancy local spot. They were lovely and accommodating and great service. But food wise,","useful":1,"cool":0},"rPrA1BuEAR5Nrwt8eTJtZw":{"text":"Great family spot with great food. My kids and I enjoyed it.  Even with younger kids, it w","useful":0,"cool":0},"xGPVi160DNhynUOKh4qiuw":{"text":"Still gets 5 stars but dont forget that it's a cash only place!","useful":0,"cool":0},"aF5-4ycCqgHE0F0Z80RbdQ":{"text":"We stumbled upon this place looking for somewhere to eat lunch after visiting City Park an","useful":0,"cool":0},"56UEiyqFePM6VH-5lXRAzQ":{"text":"Great place for lunch. Bloody Mary, crab claws in wine sauce and the turtle soup with sher","useful":1,"cool":0},"ERKLF5yq4E6zA4mc0_aO_A":{"text":"Terrible.  The waiter was extremely rude to our party and the food was bad too.  The turtl","useful":5,"cool":1},"IQW8pc1j1qUKrSYaFiDqDA":{"text":"I finally made it to this New Orleans institution and I couldn't be more pleased with my e","useful":6,"cool":3},"GqXHtgQnFtRB0RUW2EtBgw":{"text":"Down from Atlanta and came here for a 60th birthday celebration. Had the shrimp remoulade ","useful":0,"cool":0},"3w5jApOXeSxP56FuwaRUGA":{"text":"This is a solid go to for a lunch meeting. They can handle a group and it is good NOLA cla","useful":1,"cool":0},"ulOMKsqxXl64qVbk_6bYdQ":{"text":"Let me start out by saying this restaurant was one of my favorite places to dine. If I wer","useful":1,"cool":0},"cEVmd78GoKsAU2KeSTodMQ":{"text":"Great service, very friendly. Chris, our waiter was awesome! We were a difficult table wit","useful":0,"cool":0},"w3EhbvR9zL8FzeqsfI0Hbw":{"text":"Great introduction into creole/Cajun cooking on our first night in New Orleans. \n\nI had fr","useful":1,"cool":1},"K-AXg4iPXd8uoN-SkT4WGw":{"text":"Comfortable atmosphere and huge portions. The almandine is wonderful noir service was fair","useful":0,"cool":0},"Q0X8AWI38YFjkc1n0HJ7zQ":{"text":"Mandina's was a recommendation from out Airbnb host as a great place for authentic creole ","useful":2,"cool":0},"Kt8T2cIqQrZp6Z584mZwZw":{"text":"Ok so check it.  Mandina's. Right off Canal St.  Amazeballs menu.  Po Boys as big as your ","useful":2,"cool":2},"dGJtvw0GtXMH8Q15U5nJog":{"text":"Turtle Soup w/Sherry...2 die 4.  Had Soft Shell Crab Bayou w/Shrimp Etoufee...Amazing.  So","useful":1,"cool":0},"zsw8w_ZeLQCJXiUfPNv5jQ":{"text":"I went back to my birthplace for my 50th birthday with a group of friends and decided to g","useful":1,"cool":1},"Wk_1gBsxN3Im5a8TwvMIlQ":{"text":"We went there a Sunday afternoon with my Girlfriend,I have ordered a roast beef Po-boy and","useful":1,"cool":0},"pUjSVHFglZM49BFGjThXmw":{"text":"My family LOVES this place!! Everything that was ordered is delicious. My Aunt & Uncle are","useful":0,"cool":0},"UmZFDDpBQMkfRvM2qvr10g":{"text":"I don't feel like writing much today, so to be brief:\n\nSeafood gumbo was too thick and sli","useful":2,"cool":1},"KdHp6PKmYE9bc5_FsrpBpQ":{"text":"Their food is always great. We finally try the soft shell crab and it was a absolutely del","useful":0,"cool":0},"WT3LWXOcZVjzkXscMPEATw":{"text":"My friends picked me up at the airport and since it was time for lunch, we headed over to ","useful":4,"cool":0},"hPqeAJiUm7XLoxMNji5lQg":{"text":"Another classic neighborhood establishment that deserves some more visits.  Great pasta di","useful":1,"cool":1},"fUjVi0DNMTkn-2nwkNE_5A":{"text":"Want to add to my earlier review some other items of note. The okra gumbo here is great. I","useful":2,"cool":0},"-Y2onlLmFmcdSCTiZXODDw":{"text":"Mandina's wins on local charm inside. It's full of cheery people without feeling too crowd","useful":0,"cool":0},"nkSzA5qhpavQVoSz5do1vA":{"text":"We went during Krewe de Vieux and had no wait for a table.  Unfortunately, the food may ha","useful":1,"cool":0},"hYqt3o9ddNo_8tm7iOyUbA":{"text":"Our party of 6 visited Mandina's for my birthday dinner on a recommendation from a friend,","useful":0,"cool":0},"1vOz90QKxkSeXUbnZLP1vQ":{"text":"Of the soups, the gumbo is the best, seconded by the turtle soup, with the artichoke being","useful":0,"cool":0},"SCxEwyvU3tGagH6hPdaghA":{"text":"If you are looking for old New Awlins flavor, this is the place. Try the red beans and the","useful":0,"cool":0},"Ip9jEv1_UiksFkKKlzXBrw":{"text":"Great mom & pop style seafood restaurant.  Wine list is average but very palatable. They d","useful":2,"cool":1},"c6zlfU0nBm8R5zYfx1R04w":{"text":"Fantastic soft shell crab. Everything tastes fresh.  Menu is heavy on fried food.  Surpris","useful":1,"cool":0},"bq4ghka3Te2hYsw4sEak2A":{"text":"Must get the onion rings to start they are so good. Love when they have the open face BBQ ","useful":0,"cool":0},"sVCp7vnSrxUjLYyyjU_21Q":{"text":"I really really like this place. One of my favorite restaurants in New Orleans. I recommen","useful":0,"cool":0},"Po6rcKA3mTfyeoumJ9HA4g":{"text":"Went here based on a recommendation, and I'd like to think they were just having an off-da","useful":3,"cool":0},"tDdrC3e5tFNrfsm4Xje2LA":{"text":"Everything that I've tried here was delicious. The whole restaurant was PACKED when we arr","useful":1,"cool":0},"ytn1hu9x7Zo_IXk4u32Aiw":{"text":"I love this place!!!  I grew up getting take out from here and I 'll come here when family","useful":0,"cool":0},"4SuYsomZQsbNpJv8pcFu3Q":{"text":"My stomach can't handle heavy food, so Mandina's wasn't a great choice for me. My fault, I","useful":0,"cool":0},"18J7cjevUznFMKPlJh1how":{"text":"Was visiting New Orleans for Mardi Gras and this restaurant was right at the end of the st","useful":0,"cool":0},"nVaOwYH6jJRiAPox-N5-Pg":{"text":"Pretty solid local spot.  Had a bowl of the gumbo and it was a meal in itself.  Stayed stu","useful":0,"cool":0},"jzke-pQZ-NFpAecoDRyCJQ":{"text":"Very traditional Old New Orleans style food here.  We always take guests from out of town.","useful":0,"cool":0},"DIrhSlUlSBMNMIyBx1r7EQ":{"text":"For my money, the best combination catfish/shrimp po-boy (a close second is Mother's) in t","useful":1,"cool":0},"MliGSdbxTIJi_Se35cYrtQ":{"text":"Mandina's is a pretty good neighborhood restaurant but here's the problem. They don't take","useful":1,"cool":0},"DoKqXZC745Dxjfc9rGWvkw":{"text":"This restaurant was recommended to me by my New Orleans hair stylist . I will give her ano","useful":0,"cool":0},"NPdgZpPcd1yx4sQv-eaRiQ":{"text":"Went back to Mandina's after 10+ years.  Better than I remembered.  Their Turtle Soup was ","useful":0,"cool":0},"UAlNCuY2-vOR8xAl1efJzg":{"text":"I really liked this place.  It is a local staple so you are unlikely to see too many touri","useful":1,"cool":0},"MaG_CFVLo9gXq1TN1LeKhg":{"text":"Hands down, the best spaghetti and meatballs that I've ever had, and that includes what I ","useful":0,"cool":0},"-c0esW6bTpiGAj_WhFb48w":{"text":"Back on my good side.  Seemed like they were struggling the last few times we ate here, se","useful":0,"cool":0},"oTjWtumP8o6Gq0HfarhnLg":{"text":"Good grief this place is great. Took a while to get seated as the lunch crowd lingered til","useful":0,"cool":0},"vc4fmBXJk044IhaqQkO1fw":{"text":"Awesome place for some good grub!  This is where the locals eat and I make sure to come ev","useful":0,"cool":0},"1yFhgRgUq-A9BbhcKEAtLw":{"text":"Had dinner there twice this week. Outstanding food and service. A fun neighborhood restaur","useful":0,"cool":0},"zYys6LSzty9eBJx7YxsaqA":{"text":"My family loves to celebrate special occasions at Mandina's. The food is incredible and pr","useful":0,"cool":0},"V6AJklDktPwsWz6jub3EzA":{"text":"Only the BEST Sunday dinner in the city!  I must visit every time I'm in the city.  Mandin","useful":1,"cool":0},"P7QMYwZUoxo9jTMeyKOzZQ":{"text":"Great local restaurant - if you grew up in New Orleans most remember their parents taking ","useful":0,"cool":0},"SOhFYDlTd9Tj718-v9C1RA":{"text":"Always a favorite - dinner tonight: crab claws in wine sauce (appetizer): turtle soup and ","useful":0,"cool":0},"XlFXKB50tcHeGwTTTnE6UQ":{"text":"If I'd ordered this meal in Los Angeles I would have been delighted (fried shrimp and frie","useful":1,"cool":2},"jTjgrMlB4pnsbLDrDjBBZQ":{"text":"After several days in New Orleans, the locals recommended that I try Mandina's. Even thoug","useful":0,"cool":0},"tpx8MuejZavDkNW0Xrv-8w":{"text":"Came here on the recommendation of our Uber driver and were glad we did! The portions here","useful":0,"cool":0},"NmMTwAIeb5aiQz4ryvrJvg":{"text":"What an awesome meal from an unassuming restaurant. The bar was fully staffed and fully st","useful":0,"cool":0},"F1Gi5VaUcBdWBavSfMxYkg":{"text":"quintessential new orleans neighborhood restaurant with plenty of character (or characters","useful":1,"cool":0},"pvfJe88DzN23hm_0IYbhXA":{"text":"Fast service from a decent middle-of-the-road restaurant. The server that took my order wa","useful":0,"cool":0},"5X8w85VJSzsZY3njUI3xHg":{"text":"Mandina's is probably my favorite restaurant to eat at weekly in New Orleans. I'm from New","useful":0,"cool":0},"Wy28zOIE0Thkh-Y-dgdLOw":{"text":"Southern Fried Chicken was delicious. Huge portion size. Friendly service. Casual neighbou","useful":0,"cool":0},"6wueWOas3czbzJ9isKrZMw":{"text":"Average food and service and extremely over-priced. Ordered a dish with grilled shrimp and","useful":0,"cool":0},"AWgIjLnRIzC_3GNwz8OFYA":{"text":"The shrimp po'boy is my favorite in the whole city.  It's not about \"quantity\" but quality","useful":1,"cool":1},"zJ6cHrJ5gE7JXi0CpGBAdA":{"text":"Food was overall very poor. My friend got the creole shrimp and rice with peas,a Saturday ","useful":0,"cool":0},"F1xtoykdOWSLCs0o2HaXcA":{"text":"Po'boy was ok, nothing special. Not enough mesh between the ingredients. Felt a bit stuffy","useful":0,"cool":0},"U09QfKJGdA4m0pKQej_eeg":{"text":"I'm giving this place twobecause even though I wasnt really a fan my fiance loves this pla","useful":3,"cool":1},"1v-8GqTyVIQTUosp41otxQ":{"text":"Prompt service, good food, reasonable prices, attentive workers...for my first experience ","useful":1,"cool":1},"BWZz-2DFYlBrVLV-djP21w":{"text":"Sunday, October 29, 2017 went to Mandina's after church.  It was half empty.  We, Black pe","useful":1,"cool":0},"NO_bZjETd0cTDDS8PwG9hA":{"text":"Great food, HUGE quantities. Like, HUGE.\n\nTheir Italian food is great - I've had the eggpl","useful":0,"cool":0},"tgJcYwum8N3P7Gr1SOG7Kg":{"text":"My husband and I stumbled on to this place on our first visit to New Orleans. We were driv","useful":1,"cool":0},"nx1CI4NRQyslO6WbU6jTlw":{"text":"SO GOOD! The food here is absolutely amazing! Definitely the best restaurant that I've tri","useful":1,"cool":0},"f3Y9I63Z2Xxfd0LO3tN8bQ":{"text":"Great food, Nice setting. Had Oyster stuffed chicken breast that was great. \n\nTaken here b","useful":1,"cool":0},"-2GxRwVaWnDQX4tfrnNWfg":{"text":"Everything was great. I'm glad I have them another try. I had family in from out of town a","useful":0,"cool":0},"mp2XTh3FRIPgTlXssGTmgQ":{"text":"After extensive research, it was decided to go there for a big group. A call was made to s","useful":1,"cool":1},"yFpUtMKZeT8GvASiGmbGTw":{"text":"Fantastic service and food! We chose this place for our last night in Lousiana, I wish we ","useful":0,"cool":0},"NhazoXvLj-ino_d8zZcE4A":{"text":"I've been to mandina's twice now and I have enjoyed both visits. On the first, I went with","useful":6,"cool":5},"EneEZo535jIiQwYc4jRFnA":{"text":"Comfort Food in Comfortable Surroundings\n\nMandina's has been around for many, many years. ","useful":0,"cool":0},"m2UnmBIpOSntbbHV4fl8KQ":{"text":"The turtle soup with a splash of sherry is excellent, I ordered the creole eggplant and di","useful":1,"cool":0},"CGcYofAwa9Q4APFmuboAzw":{"text":"Mandina's first came to my attention in an interivew with my beloved Harry Connick Jr. bac","useful":1,"cool":0},"QBCLePcbc7mWMsfYDDozBQ":{"text":"I've only spent about two weeks in New Orleans, but this is easily the worst food I've had","useful":2,"cool":1},"x4mQySMGr6NT3aF8AxNmDg":{"text":"I ordered their seafood gumbo and it was everything I ever wanted in a gumbo. The atmosphe","useful":0,"cool":0},"E_tz989IBaL7yODYraJiww":{"text":"So sad.\n\nI have wanted to try this place forever and when my sister came in town we made i","useful":8,"cool":1},"lQThmmazqtFdqfrr77VA9Q":{"text":"Food was mediocre at best.  Only good part was meatball sandwich.  Desert was bland and we","useful":3,"cool":1},"FN_O0J09bcDph5XnIG4JWw":{"text":"CASH ONLY vut they have an ATM, this New Orleans institution lives up to it's reputation","useful":1,"cool":1},"rJryTByRG4jDquJ-DOCfaw":{"text":"I come here for lunch and get a bowl of Turtle Soup with Sherry!  It is so delicious.  The","useful":0,"cool":0},"WDKlhAuGwSsZkl4ymk2NZQ":{"text":"My first trip to Nola and I stumbled upon the perfect introduction to this southern haven.","useful":0,"cool":0},"76Nd9Oiznh_LJeY5SEMQEQ":{"text":"I had never had turtle soup before so I tried it. It was OKAY but I wouldn't order it agai","useful":0,"cool":0},"LDUu0n9UhTgAFEKEz9t4cg":{"text":"The food here was really good! Definitely recommend! They have lots of creole options that","useful":0,"cool":0},"NkyCu9uOpTpL3JIUUyho_Q":{"text":"Omg I ordered eggplant parmesan with spaghetti it was huge a small family could have eaten","useful":0,"cool":0},"Y5dq33W0vURu-Zwwz9K5jA":{"text":"Mandina's reminds me of back in the days, when the worker's worked hard and the food was p","useful":6,"cool":3},"1NGyP_iK9wcAIwECCEEvNQ":{"text":"Amazing friend oysters and sauce to go with it. Probably the best fried food I've had.","useful":0,"cool":0},"kkxRR1HlocxyD6MAvv3WNQ":{"text":"After a long weekend of fancy dinners and public drunkenness in New Orleans, I was ready f","useful":2,"cool":0},"Jg4mXRGbGj4c4foRz1ZcfA":{"text":"Delicious--one of our favorite restaurants.  There's a reason it's usually crowded.  I lov","useful":0,"cool":0},"duq0dG8KbRJjggDMAB2lkw":{"text":"Amazing food has ate grilled fish incredible. Great service and wonderful local feel. Woul","useful":0,"cool":0},"qyFnAEVmXFT6bWND6qpvWQ":{"text":"What a lovely spot for a home style dinner in Mid City! Mandina's gets packed but it is de","useful":0,"cool":0},"JQze2kcZF6V2T39edyWMgg":{"text":"First time in New Orleans... was told about this spot by a local uber driver. Based on Yel","useful":0,"cool":0},"C3_0euNOLO7PvBnuMfdMTA":{"text":"As one of my dear friends, and fellow Neuroradiologist, is wont to say:  \"It is what it is","useful":8,"cool":4},"ljW2Qsc5CVn0yfGC_PDX2Q":{"text":"Amazingly slow sit down and service leads to quite a wait at the standing room only bar. T","useful":1,"cool":0},"C-iXCWs0URzQZ0W4GzAyUw":{"text":"My friend and I were staying at a BnB across the street and noticed that this restaurant w","useful":0,"cool":1},"cbktdEPAO0vmQmqI_bHryw":{"text":"Mandina's is a neighborhood staple that generations of families have enjoyed. We went on L","useful":1,"cool":0},"iW3Wa3ySQ9NCkHwqpcRIAQ":{"text":"It was a nice place. But too busy at times and waitress are kinda rude also there was a ha","useful":1,"cool":0},"Hi3ElDWyqh27FsH8H4NXjA":{"text":"Got an order of half loaf with fried shrimp. The shrimp was breaded and fried perfectly.","useful":0,"cool":0},"iQENL7WmHEXKUXhw8FQJGQ":{"text":"I had to split my chicken parmesan, because I didn't want to go into a food coma. A mix of","useful":0,"cool":0},"zUTPLPIAtRuTkqyg36w2ow":{"text":"I am only giving this a 1-star because the system doesn't allow zeroes. On the strength of","useful":4,"cool":0},"A4fFC_WYT8h_3sv2_MTWbQ":{"text":"This place is a must stop every time I visit NOLA with my family.  It is a streetcar ride ","useful":0,"cool":0},"piq6PLBW7bRWZaYXZ3O_UQ":{"text":"Old school neighborhood New Orleans.  Or at least to my knowledge as an outsider what I wo","useful":0,"cool":0},"Jlgs2Dp9MYttTxNN3DI7sA":{"text":"Had the meatballs today and they were great. Much better experience than in the past espec","useful":0,"cool":0},"MlfOrnfLRqyiDBINSasx-A":{"text":"Mandina's has a retro feel, when you walk in the door. The servers are wearing white shirt","useful":0,"cool":0},"xVLTs2qCNgL9DwtkxgH1uQ":{"text":"great turtle soup, gumbo, soft shelled crab and catfish.","useful":0,"cool":0},"M5DSqni3BBzSeXxs2jD6gQ":{"text":"Great place with awesome staff. The crab fingers and GUMBO are delicious. Everything the s","useful":0,"cool":0},"fapSxlch3qf4gOOB1EN0BQ":{"text":"Not \"Cajun\" or \"Creole\"; but still very, very good !\n\nAfter a Noon time funeral yesterday,","useful":2,"cool":3},"a77SYIt0dwFXbIuxdeZNiQ":{"text":"I love their red beans, only served on Mondays though,  the fried oysters, to me, are the ","useful":0,"cool":0},"aIPD_0bkEXYim0aBLyj7Jw":{"text":"This is always my go to place when I come to New Orleans. It's about as New Orleans as you","useful":2,"cool":1},"bjsKhThlkrXIkeF2h_hG8A":{"text":"Had an absolutely amazing lunch here! The wait time was around an hour, may be it's becaus","useful":1,"cool":0},"AW6OePeQLRoNn5Cj3bSg2A":{"text":"We have been going to Mandinas for years, but hadn't been in a couple of years. Today we w","useful":2,"cool":0},"9GT5UJ2XGpKKQgYyt5cSKA":{"text":"Waited almost an hour to be seated. The place was packed. Calamari appetizer was the best.","useful":0,"cool":0},"urMh2kBu5Fx605pt5fg03Q":{"text":"Just ok.\n\nThis place was both a hit and a miss for me. What I really liked about it was th","useful":2,"cool":0},"C-tsDFfpNSDrieVjeOyygw":{"text":"We made this spot a destination at the beginning of our trip, as they only serve red beans","useful":0,"cool":0},"qE1UIVSp8ad8OQ4GJABU0A":{"text":"Last stop before we came back to Alabama and decided to stop in for our last dinning exper","useful":1,"cool":0},"CmH76WKOwY9hVQaoTtc0wg":{"text":"I had the fried shrimp platter it was okay my husband had the cheeseburger which I do not ","useful":0,"cool":0},"os7h_RsHSPzEpGnkLz0Dnw":{"text":"So. Much. Food.\n\nBut so yummy! Great service, great prices and great food. Definitely a ge","useful":1,"cool":0},"lipFMxtDpfEsgcUNYG7PBw":{"text":"Everything was great. I'm glad I have them another try. I had family in from out of town a","useful":1,"cool":1},"OyRZp0isO23fX_EGKPJpAQ":{"text":"We went this past Sunday for a post baptism luncheon with friends.  We were not impressed.","useful":1,"cool":0},"2OL2fTHt-3KqtH4LZm-kWA":{"text":"We were looking for some place near by, not too terribly expensive, and with some \"new orl","useful":2,"cool":2},"pmK25Ozo2tMhMhUV531Gdw":{"text":"There's something irresistible about a big pink house whose neon signs brag that it's air-","useful":0,"cool":0},"Wv8YVzjrMhYgQd6icsVvBg":{"text":"I love this place. They were one of the first to reopen after the storm. I really like the","useful":0,"cool":0},"mUOrlpakNMkRT4pt9JiI9Q":{"text":"I had much higher expectations as quite a few Yelpers gave out 4 and 5 star ratings. IMO, ","useful":1,"cool":1},"HLgqPc1toxhdUoZRh2Yhww":{"text":"The food was just as expected for a New Orleans landmark like Mandina's. Classic dishes li","useful":3,"cool":0},"SYNmibAbu2tGSElyOvQemw":{"text":"Atmosphere makes you feel like you're at home. Ordered oyster artichoke soup and it came w","useful":1,"cool":0},"5OPxCmGWibqJVZZSEItUBg":{"text":"Very great historic restaurant in New Orleans.\nThe portions are extremely generous.\nThe pr","useful":0,"cool":0},"9YcYjdY8kPgQ8AXiPqQbBg":{"text":"My meal at Mandinas was not as good as I hoped it would be, but was an okay dinner. My hus","useful":1,"cool":0},"ruSjcXIuqE8xkW5MngL6rQ":{"text":"I love every meal i have had at Mandina's. great food and a low price is always a good sto","useful":1,"cool":1},"0tYtZ3q5oGp38p5O_6IZZQ":{"text":"Another fabulous classic New Orleans dining experience today!! Brought out-of-town colleag","useful":1,"cool":0},"HUGtaZtg33BptK2Zw6YefA":{"text":"This place is the quintessential New Orleans neighborhood restaurant. Ive been coming here","useful":0,"cool":0},"YkvQ7boDqWCs9qHxkUtNOQ":{"text":"Mandina's is one of my favorite restaurants for a variety of reasons.  Their turtle soup i","useful":0,"cool":0},"_YdZjc7DKyeIRbAP7vsdTQ":{"text":"The gumbo was excellent as always. The okra and shrimp combo was tasty. Not so much for th","useful":0,"cool":0},"NpqgCPFUwAkez_BgoUtdhA":{"text":"I was out and about New Orleans running errands with the wife, she said she wanted a good ","useful":2,"cool":0},"7HK1eNGDnHX3cQxYgCpiUQ":{"text":"The waiter was really nice but this restaurant was disappointing. I disliked my po-boy and","useful":1,"cool":0},"C42M_i5bhpGXk71E9AlYHw":{"text":"Mandina's is one of my favorite New Orleans style restaurants to refer first timers to go ","useful":4,"cool":1},"EMOvnV-xYP3WcSewY5sqrw":{"text":"I am maybe too full from their rich food to be functioning let alone writing this review, ","useful":0,"cool":0},"AD_mTqBdKSnIym27ISCi6w":{"text":"What else is there to say about this great place than \"First Class\" We checked it out on a","useful":0,"cool":0},"QFpLiavhBb4HiiNcA_sDPQ":{"text":"This place was the highlight of my first visit to New Orleans, and not in a good way. I wr","useful":1,"cool":0},"xCWDbqipH-Hi-dzo6dSbjQ":{"text":"Hubby declared that of ALL the seafood gumbo he'd had while on our trip (six days, eight d","useful":0,"cool":0},"p3z2GZTYMMPJczTQXcmNgw":{"text":"Loved the crab fingers and the gumbo was so good. Glad I got to try it. I'm now in Califor","useful":0,"cool":0},"8dD1zwY-j_EBYyfYqS3imw":{"text":"Piece os shit services.\nWaiter leaves us like out the door and we got no damn service","useful":0,"cool":0},"Q_B3eVSWc42tp4Hzlw-X6g":{"text":"On Sunday, August 9, my boyfriend and I ate at Mandina's Restaurant. I really wanted to li","useful":0,"cool":0},"2WhzTYTVDY2w10ZRenzuxQ":{"text":"You can tell that this restaurant is very popular. My advice to anyone wanting to try this","useful":3,"cool":3},"2MrLP7e1vsvcv898HheEWA":{"text":"On the way home to Texas, we decided to stop and eat in NOLA! After my first bookmark fell","useful":2,"cool":1},"RRiZI3e7ZIe1pU4ZtghewA":{"text":"PRICIER THAN EXPECTED BUT STILL DELICIOUS\nEspecially for a 'neighborhood restaurant.' The ","useful":4,"cool":2},"kdLuzaWAE3p9YAhk7mWGBA":{"text":"What in the world happened to this place? The food used to be good, but our meal tonight w","useful":1,"cool":1},"nJi_z71C2Q3LSnBdol8OTQ":{"text":"I go to Mandinas once a month on Tuesdays to have their daily special, which is beef stew.","useful":0,"cool":0},"8Jdrpm45nIs1dO_RvLMC0A":{"text":"Mandina's is Awesome and Just about as good as it gets when it comes to wonderful, real re","useful":0,"cool":0},"ql7OvxNc6ypulcD0IFMZ2g":{"text":"All I have to say is be careful of the wine you order. Being from California, I ordered th","useful":1,"cool":0},"_YgcqmirPvCQwUpXCtZskQ":{"text":"I was told my my hotel to try this restaurant.  My friend and I were excited because we we","useful":1,"cool":0},"17zXFomEcfpG2JrQMwsUAA":{"text":"This place is about as local as it gets!  Make no mistake, this is a mid-city institution ","useful":0,"cool":0},"BG2AETAahv9BbVH2EGSzyQ":{"text":"This is one of our regular stops and a dependable New Orleans Italian Creole locals eatery","useful":3,"cool":1},"A3Wk-BALZBGhs3gro_OJpA":{"text":"Came here on a Wednesday kind of late for dinner (8:30 or so), but were seated immediately","useful":0,"cool":0},"hHPBa3vnXpOU2m0D8OpUKQ":{"text":"All I can say is AWESOME!!!!!!!!  The food is AMAZING!!!!   Huge portions awesome turtle s","useful":0,"cool":0},"w8NnSmrhQxD1cI5G-w9UNg":{"text":"Family-style dining. A bowl of the tasty turtle soup is enough food for meal. Grilled shri","useful":0,"cool":0},"TSDkQGA3ZiRyGJdLnSDzxw":{"text":"We decided to celebrate my husband's 30th birthday here. The menu has a wide enough variet","useful":0,"cool":0},"VGy9hDByUv9YahZbRursSA":{"text":"Cindy, my coworker lives there part time  and here part time, meaning every 3 months or so","useful":0,"cool":0},"WChwc93FAuqD7C_SidRPOw":{"text":"Ordered the grilled shrimp with potatoes and veggies. Shrimp was soaked in butter. Potatoe","useful":2,"cool":0},"Q10hHFmTBiyK_MsVyCgvfQ":{"text":"Good food although perhaps too much of a good thing when plated. A bit too many competing ","useful":0,"cool":0},"N3mQAV_dvYekjuldEp-j7A":{"text":"One of the best soft shell crabs you can get in the city! Make sure to get it with the Meu","useful":1,"cool":0},"7zS7urR_BsK26hLLbiwcyQ":{"text":"Great little find on Magazine St.  Wonderful old time feel, but still up to date.  Don't l","useful":0,"cool":0},"Smwbrc11ptLUxMvTjXPYyw":{"text":"I will start off by saying I have been a faithful customer for years to your restaurant. N","useful":21,"cool":2},"Sotm5CzcBjjJkt745bwrTA":{"text":"Went it for a Saturday lunch and there was a short wait but we got seated immediately. Ord","useful":1,"cool":0},"1MoLc5UMLhHihfhh7c3c_A":{"text":"Mandina's rocks.  One of the best restaurants in New Orleans. \n\nGet the crab claws appetiz","useful":3,"cool":0},"mSPpazNaVj9Dsxt6RaxApA":{"text":"Was here on June 19 celebrating a birthday as were several patrons.  The ambiance is a bit","useful":0,"cool":0},"jOcVOj2A0fMi7ujlT3u3WQ":{"text":"This is an old school family run restaurant with very good food and service.  The Italian ","useful":0,"cool":0},"t8KEVOI7NEHaYewOviVHKw":{"text":"App: Turtle soup. Absolutely delicious, light, and well-spiced.\n\nDrink: An old-fashioned. ","useful":1,"cool":1},"gUr9riRefKX5iyOGDzmrsw":{"text":"This was a good choice by recommendation.  I had the fried trout along with potatoes, gree","useful":1,"cool":0},"iYnoCxamKb5npUbyMXsGOA":{"text":"Super rude manager and server. Bartender could not have cared less or smiled less either. ","useful":0,"cool":0},"6SZbsOzvSnbD0qZKrpzf0g":{"text":"Mandina's is the place we look to when we have out of town guests who want to try some of ","useful":1,"cool":1},"Hx9RqYasHPbj0beKK1FXVA":{"text":"This pink building is an institution and continues to crank out the delicious entrees it h","useful":7,"cool":5},"Bm8CTmG_x9AcHBtIViA0HA":{"text":"Despite being born and raised in New Orleans, I had never eaten at Mandina's until I went ","useful":1,"cool":0},"jmwYkCW1mdxaD002sCSitQ":{"text":"Three friends and I decided to visit Mandina's based on the yelp reviews that we saw. We w","useful":1,"cool":1},"cBfTArXVh8CaPePHX-AsEg":{"text":"Omg so good food.  Bigger menu at the one in Mandeville and they have Marsala on the menu ","useful":0,"cool":0},"r9dMFcNsiuDbvF6qlENcVA":{"text":"It was a great atmosphere,  I have had better food and I feel as if it is over rated. This","useful":2,"cool":1},"GrUoYdKgvIn0XeET-B09bQ":{"text":"Always Great Food. Not pretentious and service has improved. Bread Pudding is AWESOME!!","useful":2,"cool":2},"3nBSy0FpDr2SI7GrRXTjiw":{"text":"This neighborhood restaurant really is a good choice for you to try out! I was staying in ","useful":0,"cool":0},"va-Qj7VPSijz6jYCTWnqdg":{"text":"I gotta say... This place is kind of a dump. Tons of families here, meaning that this is t","useful":1,"cool":1},"gW8HxWxY8ks4AhSIbn7x2Q":{"text":"This place is so good!!!! Gumbo A++++ shrimp po-boy A++++... Our server new his stuff!!! V","useful":0,"cool":0},"TGa3Uwx6_WEvzEN1crUWWQ":{"text":"Since relocating here a few years ago, we've dined at Mandina's every couple of months. I'","useful":1,"cool":0},"Ef5EU8o8hEiTbPx0YfCylQ":{"text":"Stumbled in for a quick lunch.  No wait time. Pretty good food.  I had the red beans.  The","useful":0,"cool":0},"YPIY3QmK3bBcV_nap0PiSA":{"text":"Food was just as good as everyone says and the service was excellent as well. I was there ","useful":0,"cool":0},"oDfWzZlUxIL1lp1ldO1Pfw":{"text":"Just left, I wasn't impressed. \nMy husband ordered the stuffed shrimp and it was what I ca","useful":1,"cool":0},"zkfrQclbRe5vw8nrYFBgCA":{"text":"Excellent shrimp gumbo.  Yummy bread pudding with pineapple,  apples,  cinnamon and nutmeg","useful":0,"cool":0},"e55dk-J-kW-eT8-XNE8RhA":{"text":"Horrible customer service by waiter, Terry and manager. Had to wait on clean cups because ","useful":2,"cool":1},"TT4j3ldWj5QK9wzgkHg6zA":{"text":"Having lived here I knew about this place, not many tourists know so I am imparting knowle","useful":1,"cool":1},"vg6ZOvrs5XqKi01JjLkhxg":{"text":"Been coming here since 1980 and glad to see it hasn't changed...well, the prices went up b","useful":0,"cool":0},"mh_r9nxW0g45RGXVmB6QIg":{"text":"I went to the restaurant with a group of people and was less than satisfied with my experi","useful":1,"cool":0},"nhv1GkEdULfi2crgs76Osw":{"text":"Classic New Orleans restaurant with good food. It's not my favorite place in town, but it'","useful":0,"cool":0},"PxpkB6OtkyEtR_ApHajpUQ":{"text":"So, the yelpers say they have great gumbo ... and yes they do!\n\nHubby and I came to check ","useful":0,"cool":0},"pQZm0lISmg-1L0srcOxb3g":{"text":"We had an awesome meal there last night=\n---7 of us. longish wait wasn't bad, the staff ke","useful":0,"cool":0},"sHbJNT9Z1wbYfAIOTvIBoQ":{"text":"A nice quaint Italian Restaurant - had turtle soup and spaghetti -meatballs.  The food was","useful":0,"cool":0},"Q9hJN7UzCOxI32Tvrr9PPw":{"text":"Best chicken parm in the city. Hands down. It's not even a competition. Their garlic butte","useful":0,"cool":0},"O0mTgzadWS8i3uuseES0OA":{"text":"While on a trip to New Orleans, we decided to try a more local place. This place had good ","useful":1,"cool":0},"7pHNX3uvMYiAHH4h9ku9eg":{"text":"Turtle soup was good, thick but good.  Fried oysters were perfect..lightly corn meal bread","useful":1,"cool":1},"wpyi_z2w-iW3NZwOPvp2cw":{"text":"Turtle soup- as awesome as ever- thick and hearty- great flavor with a little sherry.  On ","useful":3,"cool":2},"w9EXW3Y56SFTUj6Usa10Ow":{"text":"Ordered the shrimp etoufee  and it was amazing. I wish it was on the menu every single day","useful":0,"cool":0},"HPD022ATWBGJuWNvNhVC5A":{"text":"This is a solid, non-touristy, neighborhood type restaurant. It's specialty - New Orleans ","useful":2,"cool":2},"7BTFG1Yp2vOmX1hWtIxvBQ":{"text":"Had dinner last night what a great night.   Order just a simple fried oyster and catfish p","useful":0,"cool":0},"lG_VItvVjOgRFJcLcmCGBA":{"text":"Our waiter was great but the food was over priced for what we received. The garlic bread w","useful":0,"cool":0},"nneHaF5wfEidtYk_MNI1cw":{"text":"When I think of the the \"Big Easy\" this is the kind of restaurant that comes to mind.  Fro","useful":2,"cool":0},"xtOKlvURIj5xltRQBfgQQg":{"text":"Non-touristy local spot. Im glad we came by. Some hit and misses - biggest miss was desser","useful":0,"cool":0},"bzh2suEi9Ng7ittXYJheTw":{"text":"Mandina's was my favorite seafood spot back in the NOLA days of my youth.\n\nBut I have hear","useful":5,"cool":1},"fv5dRsN_HpIDgmoGTyM2Jw":{"text":"Fantastic local place, well flavored and great service.","useful":0,"cool":0},"dg5EogyL3yaQaebdnQwdsw":{"text":"I live and work in Mid-City, so obviously can't escape Mandinas. I kept hearing about it- ","useful":1,"cool":0},"Tl-7up6rYfOn6r_isqXM4w":{"text":"Great turtle soup and cocktails. I also love the chicken parmesan although they always ove","useful":0,"cool":0},"kRgTqFMK5DDAmbyaTCQTbw":{"text":"Above all, the dishes with the red sauce, meatballs, veal/chicken/eggplant parmesan, Brucc","useful":6,"cool":4},"ySCm6TMPr0hs9hZrnCVa-A":{"text":"I am sick and solo traveling, so I opted for carry out. It was super crowded and I didn't ","useful":1,"cool":0},"N7Kq5svle9-LFp651N7Ktg":{"text":"Some of the best red gravy I've ever had. I've also been on a BBQ shrimp Po'Boy quest and ","useful":0,"cool":0},"ZsMqAqgcCBO7RqC8_btZSg":{"text":"I don't know why the ratings are high in this place. I understand the staff there are supe","useful":1,"cool":0},"vm0xy6DhVqDnGuz8bLidJA":{"text":"I was in New Orleans for the Saints home game against the Falcons. My fiancé is from there","useful":0,"cool":0},"FOZqYXzueyzaBegNEkL2rw":{"text":"The food here is only average and it's overpriced.  I had the veal parmesan and spaghetti,","useful":5,"cool":1},"_Wocf08-B_UIZw_GWYLjcg":{"text":"Best food I had in NOLA. Their gumbo recipe is what I measure all gumbo by. It's flavorful","useful":0,"cool":0},"w4qMHIlHvyUvRqxQithJ2A":{"text":"The ambiance of this Mid-City restaurant is decidedly old school, with a well worn dining ","useful":0,"cool":0},"uuDOHDLJKx4IWJUBOr0s1w":{"text":"Fast service from a decent middle-of-the-road restaurant. The server that took my order wa","useful":1,"cool":3},"yoLDw9jsA1TBtefwUqpZcw":{"text":"Ok...obviously the neighborhood seems to like this restaurant. It was very busy in there. ","useful":0,"cool":0},"0EuC-0vZDuXZvJcl8AAblQ":{"text":"Believe it or not, their turtle soup rivals Commander's.  Great, old fashioned New Orleans","useful":0,"cool":0},"f30AyDTjSZKWONVWGRsAfA":{"text":"I have never had bad food or a bad experience here. It is my go-to place for visitors. It ","useful":0,"cool":0},"eoKgqSfi11oaUus_19HlLg":{"text":"Ordered roast beef and veg soup. Soup was delicious but roast beef was way too peppery and","useful":0,"cool":0},"OyHdRt5Odc0UdDuL4CPNSg":{"text":"Ambience: extremely loud. No sound deadening so don't expect to have much of a conversatio","useful":0,"cool":0},"kX-Y2G1IxVPFKhou8jPt7Q":{"text":"Wonderful food and service. Kinda pricey but you get alot of food for your money. Try the ","useful":0,"cool":0},"_5BYU0Y-GJOrE78AEh3PGg":{"text":"What I like about Mandina's is it is outside of the French quarters and yet a quick trolle","useful":0,"cool":0},"YuX3ZboCksTAoJJ2_QWnAg":{"text":"This is one of my all time favorite places for 35 years because of the great food and many","useful":0,"cool":0},"OYhu90UPIU6p65lpmeqF6w":{"text":"We were taken there by my girlfriend's brother.  He lives in NOLA, and eats there after Sa","useful":0,"cool":0},"9e3BZmvbAFvb-S-ZeuDGBQ":{"text":"Great food and ambiance! Came on a Sunday during lunch and there was plenty of seating. Al","useful":1,"cool":0},"_5ZP_cO-GulZGX6A6WWEkw":{"text":"Let me start out that I just moved to New Orleans..Land of great food.\nThis place has char","useful":3,"cool":1},"-L2zFoMEohiUhJaw5j0qFw":{"text":"I am biased because my brother works here...but the freshest seafood I have ever had.  The","useful":0,"cool":0},"ELR96rOL9889-fvxAUhhiQ":{"text":"my goodness ... where do I start?\n\nThis neighborhood mid-city restaurant is on my NOLA 'mu","useful":0,"cool":0},"IXUyjho8Pfknulg8HygkaA":{"text":"Stumbled into the place on a Sunday, mid-hangover with glitter still in my hair. Glad I di","useful":1,"cool":0},"NbZ5D80pLeQGvS0v-YygXA":{"text":"Was super excited to try this restaurant, as it came highly recommended. Although the turt","useful":0,"cool":0},"2cRRXIZY3Tcmza-xd8poGQ":{"text":"BBQ shrimp poboy the best. Everything is good. Service excellent. Great ole time New Orlea","useful":0,"cool":0},"F3Fmz-3j1UCExKhP-6eSiQ":{"text":"All I have to say is-I am like a 4th generation New Orleanian and this is one place that I","useful":0,"cool":0},"V9G2L6WzK76ZSPgBbkRwvg":{"text":"We went because the wait line at the Ruby Slipper, one block away, was too long. Bad decis","useful":1,"cool":1},"tP_1q7jy_LqEilNzewx6kA":{"text":"A must when visiting NOLA, it is where locals go for great food. Must try the onion rings,","useful":1,"cool":0},"dqdhzBAGzPDNJiLn2HkWmQ":{"text":"Wow, this was one of the best meals I've had in quite a while. I came to town to visit my ","useful":1,"cool":0},"XNtiL4WoQMwd96HrSqxpfw":{"text":"This came recommended to us by our tour guide at the Houmas House. It has a heavy Italian ","useful":0,"cool":0},"5FC7q76BCU9LmeftOlPq3Q":{"text":"Thank you Mandina's!!! \nWe found our celebration spot! FOOD is always on point! Atmosphere","useful":1,"cool":1},"nJ18XXP4sRoOPAO-_M_7iw":{"text":"If you are craving some home style Cajun food then Mandina's is the place to go. I would s","useful":0,"cool":0},"UIqK5O70wmjN6i6sS9EaRw":{"text":"Mandina's is THE neighborhood restaurant.  A New Orleans staple, it serves some of the bes","useful":1,"cool":0},"9a7o68_yg-SJallnEXDKBA":{"text":"We visited twice recently and had much better meal the 2nd time.  Until about a month ago,","useful":0,"cool":0},"zkQWtNDx3hdHAzCT1UqPnw":{"text":"I had a cup of gumbo and fried shrimp. Yummy. The gumbo had the right spice and the fried ","useful":0,"cool":0},"l_ejnV3vGahlSgzkHBQzNg":{"text":"Lovely gem off the beaten path....a nice streetcar ride down canal will get you here. The ","useful":0,"cool":0},"-wKK8Eu9372YDdNqS6FDIA":{"text":"Looked at the reviews and I must say they were accurate. We just arrived into New Orleans ","useful":0,"cool":0},"ZT1kPJHXLzKA3937lFPJLQ":{"text":"It is expensive average food.\n\nWe were very sad to find the Gumbo so plain, we left 3/4 of","useful":1,"cool":0},"z11UZXEv7VuaZTy-U3fE1A":{"text":"Simply put, there is not a better hamburger steak (huge) smothered in tons of large carame","useful":0,"cool":0},"iUoXPbTVyxdwgk3w-TbxDg":{"text":"Super rude manager and server. Bartender could not have cared less or smiled less either. ","useful":1,"cool":0},"U56rKZ9J7Fg9mtUSLlw3qg":{"text":"Standard no-frills Italian-Creole food...huge portions...a Nola institution popular with t","useful":0,"cool":1},"9NJVV-0rPKouj7MrryoX1w":{"text":"I went to Mandina's last night, it was a rainy saturday and the place wasn't as packed as ","useful":0,"cool":0},"Bx5A9-xryJL55VfXJ_yhRw":{"text":"This is where the locals go for Po Boys. The place was busy but service was quick. The oni","useful":0,"cool":0},"aBiVi2vIFCpgF2hQK0BOTg":{"text":"I first came to Mandinas as a bright eyed tourist in 1989. Had the half and half loaf (1/2","useful":0,"cool":0},"HAl6QL-xMUjArSLC2J8q1w":{"text":"This used to be one of the best restaurants to go to for good New Orleans food. \nIt has re","useful":2,"cool":0},"g3mdP4sEKrjnZ7OToZ8HqQ":{"text":"One thing:  crab claw appetizer.  For that 4 stars.\n\nThat is all.  \n\nGo forth.  Eat at a l","useful":0,"cool":0},"zZnpyrvYF5lkHN-ECtrs5g":{"text":"This is my favorite restaurant in NOLA. The atmosphere can't be beat and the food is ALWAY","useful":0,"cool":0},"ZbK6xYFvu3_hk7wt-Hdn4Q":{"text":"A well known neighborhood place where you stand at the bar while you wait for a table, but","useful":0,"cool":0},"ujBoj3nfQNtyUnY_abLy0Q":{"text":"Had the eggplant sticks and amandine trout just amazing!! Sauces with both were just great","useful":0,"cool":0},"Yts12QBMnDGHRs04p1F1LQ":{"text":"The food is average and the service is horrible. There are way better places to eat for th","useful":0,"cool":0},"EzFWX4hu_3uO3pRl7ZGg_w":{"text":"I enjoyed my meal at Mandina's immensely. The best gumbo I had in NOLA. My wife had stuffe","useful":0,"cool":0},"4DJQVgH7c3jPeGPiJrL0-g":{"text":"Mandina's is a great classic New Orleans neighborhood restaurant. Also, it's easy to get t","useful":1,"cool":0},"ekPEpDwTR9O84NnCJUYMoA":{"text":"My Daughter Dr. Nicole F. Keehn & her Hubby, Gordon Keehn, MD, where they first met almost","useful":0,"cool":0},"FWZbHB2mpBvkyhLpRRuWcg":{"text":"Mandina's is the last full-blown example of the old New Orleans style \"Italian Creole\" nei","useful":1,"cool":0},"dMZBFKUWf0fMFrymS3WJBg":{"text":"Family decided to eat at Mandina's before our cousin's wedding. We made reservations and w","useful":1,"cool":0},"0wypt2VD3tOVrVzh5C29FA":{"text":"Friendly staff and great food. They not only have southern food but great Italian food as ","useful":0,"cool":0},"ezTYAqkuZFSUlfgi207h5g":{"text":"When looking for a place to grab some fried seafood on a Sunday night (with so many places","useful":2,"cool":0},"G2BsrYS9kSGFkNKhspQEOw":{"text":"I've always enjoyed this place. Growing up I'd love goin here for the gumbo, turtle soup, ","useful":0,"cool":0},"amHhNrcgN_tAJFJk0p9sJA":{"text":"Mixed emotions! \n\nCrab fingers were amazing! So buttery and well seasoned!!!! \n\nThe servic","useful":3,"cool":1},"JOg6S6x1kjQr_epgcLBBGA":{"text":"I loved the fried shrimp and catfish. It was very lightly fried and seemed to melt in my m","useful":0,"cool":0},"GQ3xoPQ16bEIwUHU-FxUYA":{"text":"This is where everyday New Orleanians come to eat.  Food is basic, tasty, and filling. Por","useful":0,"cool":0},"TxbbblsHfp_wHCp61yFhmQ":{"text":"I'm not going to rehash what everyone says about the delicious food. on the other hand, th","useful":0,"cool":0},"PNT_qKtItfLh2fSBEjFbNQ":{"text":"Shrimp Po Boy was incredible.  Onion rings were outstanding also. \nHighly recommend this r","useful":0,"cool":0},"VVFhW4Ab9j7N3NF7NBt0EA":{"text":"Looking for an informal Sunday Eve meal, we drove over to Mandina's.  Got the last space i","useful":2,"cool":1},"ilDTeOP0oEvZY5ynA2RkGQ":{"text":"This place has deteriorated ! I have been dining here for 25 years and must say was totall","useful":4,"cool":1},"KWUayLwNTiFgq_jlC1TfUw":{"text":"Old school NOLA restaurant. Good food, relaxed atmosphere, good prices, interesting staff ","useful":0,"cool":0},"1QQjOjBsSCqnDVOUxsmAdg":{"text":"I really enjoy every meal I have had at Mandina's.  Sometimes it can be hit and miss but m","useful":2,"cool":1},"Xc9YBFj8tpuI2nnPgzkoiQ":{"text":"Had lunch on a Monday with a group of 8 people from work. I love this place! We are not a ","useful":0,"cool":0},"gIthqGFTRq9T2Kspr7--TQ":{"text":"This place has shrimp po-boys to die for.  It is the continuity of kitchen staff that have","useful":0,"cool":0},"7celMdVIyyXZaCUxvtcIBg":{"text":"Packed on a Tuesday evening before the new years. The place was crowded and homey with a s","useful":2,"cool":1},"TjuBytteX8nzaiYYAKfu-A":{"text":"Looking for something near us before we left for home after our little vacation to NOLA. D","useful":2,"cool":0},"rjTO56vRrPndWYgXcSSFhQ":{"text":"OK I am an old fella and have lived in the area for half a century, so I have eaten here m","useful":3,"cool":1},"qwPrihU3nFW2uwQRg6VOvg":{"text":"Our server was fantastic and offered samples of the soups when we couldn't decide which to","useful":0,"cool":0},"jHQAEddx3ag7rlbZD9szcw":{"text":"Great locals joint! The grilled drum with green beans is a must, slightly spiced, cooked t","useful":1,"cool":0},"X7YUsEtEzttqOLqOe9RZEg":{"text":"Good place with an old-school atmosphere. Had the fish special with the almond cream alman","useful":0,"cool":0},"fxe5y2aFSiDuCXzxOKEixA":{"text":"This is the place I hit when I can't get into the other places I like to hit in that secti","useful":0,"cool":0},"cYiCgw-iVgod_MurJ7ohSw":{"text":"We took our adult sons to Mandina's last night to celebrate their birthdays and needless t","useful":2,"cool":0},"tZ8MuYvG_380914k08TwRg":{"text":"Mandina's in a classic New Orleans restaurant and they continue to live up to the hype.  T","useful":0,"cool":0},"7edXpBIIMhip--A-gMO9iw":{"text":"We went to Mandina's on St. Patrick's Day for an impromptu lunch after our first choice ne","useful":2,"cool":2},"sSdraDOhYI1UIZQcgGDHaw":{"text":"This place oozes New Orleans charm and delivers the full experience. Highest recommendatio","useful":3,"cool":0},"9P7lCnBu-A_Y_7z-_TDW5A":{"text":"Giant portions of comfort food. Plates have enough food for 2 meals or two people to split","useful":0,"cool":0},"kNA5IIqnX4NkFbCi-rxKdw":{"text":"This was out of the French Quarter area. But not too far. It's more of a home cooked meal ","useful":0,"cool":0},"7jQE-UXeZQmtaKZyfPkMxQ":{"text":"I went here for the first time because the restaurant I wanted to go to was out of the que","useful":0,"cool":0},"BP6RToGhYI3zwxiwRz2E8g":{"text":"Went in January 1 for dinner and although I hate to say it I will not return. Calamari was","useful":2,"cool":1},"iMegzIJVxupwBadwuEb3Nw":{"text":"Lord O Lord how I love mandinas lol. This food is always good. The stuffed chicked and swe","useful":0,"cool":0},"21w_3jzNoqV2oPX4xr1O2g":{"text":"I was extremely disappointed by the lack of service in all areas of this restaurant. Upon ","useful":2,"cool":1},"tMaNnxBBVHa5oA6WyS-xlg":{"text":"Treat food and atmosphere. The trout and crawfish special was fantastic! There is a bit of","useful":0,"cool":0},"q98bcmPKWrmA-iAXJHyr8g":{"text":"Who knew the best eggplant parmigiana of all time would be discovered in New Orleans?  On ","useful":0,"cool":0},"tyU2D8IvYyFoO6ie898m5A":{"text":"If your from New Orleans you know this is the place where you can get food just like your ","useful":1,"cool":1},"wNdn8nZwO9rfw99GDtX6ew":{"text":"Mandina's makes their homemade etouffee on Friday only. The etouffee is great on its own, ","useful":4,"cool":2},"3FCncPDRjZE4inKZKl6rBA":{"text":"When in NOLA, we ventured outside of the French Quarter to Mandina's. Found out about this","useful":0,"cool":0},"Vox4-yt2YK55b5XDYdk2eA":{"text":"It was December 2018 and I purposely took the day off to take my mom out to lunch for her ","useful":14,"cool":9},"D78_9nOo3xzYJk7L4CNOJw":{"text":"I have come here enough over the years to update my review, I am hooked. Mandina's is a li","useful":4,"cool":3},"rUI2nnqjWBcwA3HVu6xXIw":{"text":"Loud concrete family establishment, this is clearly NOT a tourist trap.\n\nGood food, pleasa","useful":0,"cool":0},"3C33_nkEocWy9Lky1vjbIg":{"text":"Dawwlin. It don't get better than Mandina's when you want a shrimp or oyster poboy, gumbo ","useful":0,"cool":0},"-LegaoCeUnUMThKUxZ3evQ":{"text":"Hubby and I are relaxing watching the Saints game. The atmosphere is awesome. Cool weather","useful":0,"cool":0},"vKpSZ7wSGFl30zBUDwu5yw":{"text":"Fantastic local family owned place.  Super casual atmosphere.  Great scratch made food.\n\nO","useful":0,"cool":0},"XnnWtsZiC4HgW4rmhNph0A":{"text":"Delish...Gumbo, eggplant sticks with the best marinara to dip it in was soooooo good. I lo","useful":0,"cool":0},"NbKtYMrL27w_sgZH7B3tQw":{"text":"Love the shrimp poboy!  Always a fav with a cold Barq's.   Had the gumbo a week or so ago ","useful":0,"cool":0},"X5xairvalxAo7NEb8Ogqlg":{"text":"This trip back to the Big Easy, I made it a must to leave the French Quarter and try more ","useful":2,"cool":0},"DAWMG7dDbDzqZEgb4cOE1Q":{"text":"We managed to arrive just before the big rush on Saturday night and were seated right away","useful":0,"cool":0},"v4SrWlRlBlRthdVCT608qA":{"text":"Haden,t been there in a couple of months,the fried chicken pieces have gotten so small I t","useful":2,"cool":0},"sAZUt9kOE4wQVd5EgXTO1g":{"text":"OMG ! A hidden locals only place far from Bourbon street where the locals get the best New","useful":0,"cool":1},"V-TTakfO-R63RrwVuJxZJA":{"text":"Great atmosphere, only went fo desserts which were 100% spot on. Bread pudding is to die f","useful":0,"cool":0},"7Y8yMGOgBcVSGywig6_N8A":{"text":"Yet another New Orleans neighborhood seafood joint. If you are in the mood for some old st","useful":0,"cool":0},"nhpC9NgIRJ_BexUfv_FJyA":{"text":"Wanted to try Soft Shell Crab. I am new at this and didn't realize it was a seasonal thing","useful":1,"cool":0},"YowuIvTs5m4UutUJBI5Jsg":{"text":"As we arrived in New Orleans, our hotel recommended Mandina's as a local favorite. Our gro","useful":1,"cool":0},"xk5lXaxXEFjgRoxvBJtLqA":{"text":"Always great food! Our service was excellent courtesy of Calise! Cant go wrong with anythi","useful":0,"cool":0},"wLzqG4k1C75JcTvzPBD9iQ":{"text":"A classic old New Orleans favorite for my family.    I do miss the pre Katrina 'well worn'","useful":0,"cool":0},"J_z-BtX5tS8TwUIV-RzZCA":{"text":"The turtle soup and service make up the bulk of the review. It was the first time I've had","useful":0,"cool":0},"j0B2cJbZTfmu-quIYL_mMA":{"text":"I had high expectations for Mandina's, given the recommendation of, \"this is where all the","useful":1,"cool":0},"3M4MOAqnDGDk7yUCX1Z-Jg":{"text":"Giant portions with prices that partially reflect this. Splitting an entree isnt a bad ide","useful":1,"cool":1},"_qycaQ2YG48YVhYRq6t9xw":{"text":"We came here based on all the great reviews (and the fact they could take a large group la","useful":1,"cool":0},"euTPQiod93sXv1wtCZAJIw":{"text":"Always excellent food and service. From the lady who answers the phone, to the waitress, t","useful":0,"cool":0},"Kk8ZMmR84HUVlyhM28XpqA":{"text":"The shrimp po'boy is my favorite in the whole city.  It's not about \"quantity\" but quality","useful":0,"cool":0},"thS6k1KgeflXq-BPW8vAnQ":{"text":"If you love grease and butter, this is your place.  We had friends in town and decided to ","useful":1,"cool":0},"9t82HpzY9j04BLToPW7Rfw":{"text":"Mandina's is a typical old  New Orleans nostalgic place that makes you feel right at home.","useful":7,"cool":1},"SKkuiFCflNfkigexV0599A":{"text":"By far one of the best restaurants in New Orleans  out standing food,  fresh sea food and ","useful":0,"cool":0},"DbeCcRkg_GE-4aXG-egImQ":{"text":"My favorite restaurant.  I must admit, Mandina's has some sentimental value for me which a","useful":2,"cool":0},"kqK-CDEJ8OLav-g_6_iJ0A":{"text":"I order the Veal Parmesan and my fiancée ordered the Chicken Parm and we both thought the ","useful":0,"cool":0},"Fth169HGO4I6D94I5-XSow":{"text":"Turtle soup is great.\nGrilled gulf fish is just ok.","useful":1,"cool":0},"NMHis4HID1x7fibZsQUWwg":{"text":"How is it possible that I don't have a review of Mandina's? That's just odd.\n\nMandina's is","useful":10,"cool":7},"N26mewHqjAxvUyVxdFUPRg":{"text":"Come hungry, leave stuffed! This is a real deal old timey Italian restaurant with a New Or","useful":1,"cool":1},"KqiaBasbbfyYOvKZzAa60Q":{"text":"On point. \n\nFor lunch I got a cup of gumbo and red beans in rice with sausage. They have c","useful":0,"cool":1},"hHhVasbvvXXQGV5WAb1VnA":{"text":"Run, don't walk here!!! On the street car line too. Fabulous bar, fabulous atmosphere, Bey","useful":0,"cool":0},"gogDDZjZNNWzY6waNW_WWA":{"text":"This was one of my favorite places as a kid. Places is old and tired and not in a good way","useful":1,"cool":0},"m0NDQ-2cHu1qW0TQh_2Afw":{"text":"It is not near tourist places but worth the visit. There is trolley that stops close by so","useful":1,"cool":0},"vLVT8y8QLuwc0RkdxlDKjg":{"text":"Ordered two cups of gumbo and they were a little bland, could have used some more spices a","useful":1,"cool":0},"2SzpDiWrxqedaSsblRnQJQ":{"text":"If your looking for the place the locals go... this is it. \nAs a small business owner it p","useful":0,"cool":0},"ohgDESFc3XeJNLZuABL79g":{"text":"Place is freaking amazing! I highly recommend visiting Mandina's. We got the eggplant frie","useful":0,"cool":0},"MGFV8vccPRWJ1wPcP_kh2w":{"text":"I had a delicious seafood gumbo for lunch @ this restaurant. It was delicious and it was b","useful":1,"cool":0},"3ZYG-6ZYmLXNUs-VZthehw":{"text":"Pretty solid, nothing extraordinary. I think they get a lot of mileage out of their admitt","useful":1,"cool":0},"oRMPplQZKJsjWRxhTmpVow":{"text":"It's just ok. The breading didnt have much seasoning so it all just tasted fried. We order","useful":1,"cool":0},"_80SIKaDnK2rzgiXaOSD5g":{"text":"Glad to be able to cross one of Mid City's multi-generational eating spots off the list!  ","useful":2,"cool":1},"d0mSXVZoX7yrrkUTVHrjew":{"text":"Soooo good!   Portions are huge and delicious.   Meatballs and spaghetti just like my gran","useful":0,"cool":0},"_TF7N_sVvExegUj1lnPZ7g":{"text":"This is a great lunch spot. My boyfriends mom took us to lunch there since it seems like a","useful":0,"cool":0},"wDXOp2p147K0g8DKaVHAVA":{"text":"Went for brucialone last nite but they were out already.  Opted for softshell almandine (s","useful":1,"cool":0},"_JnB2RE6YYFECty7dkh6wQ":{"text":"Mandina's has an old world Italian feel. Thursday night was busy but our group of 8 got se","useful":0,"cool":0},"TYidaeuhXi27TdSp8iv6IQ":{"text":"Great restaurant to eat. It appears that they only serve fresh seafood here, nothing less.","useful":1,"cool":0},"_QPel3CA5HjkAmWyIsVrUQ":{"text":"Great traditional NOLA Creole Italian restaurant on Canal! Always order the special, parti","useful":2,"cool":1},"jQn3xOqs2LPmxS3Kf325Sw":{"text":"Mandina's 3800 Canal;  Update\n\nMandina's is the last, best example of the traditional N'Aw","useful":0,"cool":0},"gwy2r0y9NouQwSh0BSA3og":{"text":"Had a nice time here. We came in super late and soaking wet from the Jazz Festival and the","useful":0,"cool":0},"dU1gXdrJ10kuhVMTaCwsTA":{"text":"Great shrimp poboy today along with yummy turtle soup!  Waiter, Donald was FANTASTIC!","useful":0,"cool":0},"TaBji2OfeX8lY16IlSGnWw":{"text":"Mandina's.  One of my greatest regrets in life was that I lived in Mid-City for 10 years, ","useful":5,"cool":5},"fzdL_Pk6uLPPDpBskbGCwA":{"text":"Been to Mandina's lots of times. Always a pretty decent meal. Great portion size, good ser","useful":1,"cool":1},"e1ozE5rFJQjpvogJlNLZYQ":{"text":"Terrible bar service.  We recommend you don't go here.  Bartender served 3 other groups in","useful":1,"cool":0},"d9lEYFUE7jsXZC--D7MqIA":{"text":"This is New Orleans neighborhood restaurant at it's best.  Been coming here since a little","useful":7,"cool":6},"hifXSCIp1-kXlfXe_f3-Kg":{"text":"Overall okay. However, for the same price I could've gone to Drago's for two people.   \nKu","useful":2,"cool":0},"NGU_CuoRSORCoeWLH--s5Q":{"text":"I love this place. I especially love taking out-of-towners here for some real neighborhood","useful":6,"cool":1},"0FjAZ5joHAxi540SCN_lMQ":{"text":"Piece os shit services.\nWaiter leaves us like out the door and we got no damn service .\n\nC","useful":2,"cool":0},"wQ_rdd_IfqjittUcFnahsg":{"text":"Best gumbo in New Orleans. Period.","useful":1,"cool":1},"GKuq57CwQTYzOMtrcKDMww":{"text":"The food is always, ALWAYS good. Deviated from my normal fish almandine and tried the gril","useful":0,"cool":0},"smzWh3bfcXlPp5i8cctlQg":{"text":"If there's anywhere I could go after getting off of a 6 am flight, still drunk/hungover on","useful":1,"cool":1},"VJ9qoFTq9YRf81Hx0Dk66w":{"text":"Classic NOLA restaurant/bar.\n\nYou need to try this place just to get the flavor of old New","useful":0,"cool":0},"lQXhXW3kBEEgZZIVDMl-Ww":{"text":"I loved what I ordered but everyone else seemed disappointed.  Oh well.  \n\nMake sure you w","useful":0,"cool":0},"uZIB9fzWn-Wl4y3SOiuwBw":{"text":"Classic Italian / NOLA restaurant.   Big room with high ceilings, expsed bricks and beams,","useful":0,"cool":0},"GLPybWdOLxeWOZiLLoCKPQ":{"text":"Ambiente bem familiar. Pode-se dizer que quase se trata de uma comida caseira. \nComida mui","useful":0,"cool":0},"G1fArBJx7l4gRPBCubC6kQ":{"text":"I've been here a couple of times with friends and co-workers and thought it was a good lun","useful":0,"cool":0},"Jwi-NHV7Hd-yTbur8wInkg":{"text":"The tastiest shrimp in town! Not to mention the delicious side of green beans! This is one","useful":0,"cool":0},"Irs93-D9XLR7DXHnUTEGBA":{"text":"Service is great. My waiter was very attentive and he even remember us when we came back a","useful":1,"cool":0},"VkJrkBtPoH9x6L-fEiLqOg":{"text":"Creole & Italian.... What a combination!  \n\nMandina's has lots of complimentary reviews al","useful":4,"cool":2},"TRMYMWf3IecLCBp4m-CKCQ":{"text":"Went on a Sunday around 5:30 and there wasn't a wait. Then around 15 minutes later the wai","useful":0,"cool":0},"C-Lnj1yWqBZlXoFZqNYi3A":{"text":"Always the best. Basically we ordered everything on the menu. Meatballs. Cheeseburger poor","useful":0,"cool":0},"MvDaMeBGDSBL_GrR-8B5Bg":{"text":"Went here during my service trip to New Orleans.  They have really good New Orleans style ","useful":0,"cool":0},"Rp5f-vZ_W_SyUkxWjP5JUA":{"text":"Wonderful local New Orleans restaurant. They offer several New Orleans and Italian dishes ","useful":0,"cool":0},"h26DzSrTxN8zeQ2z-G3w8A":{"text":"Looking for the turtle soup to top all turtle soup? This place has the best!! Eggplant par","useful":0,"cool":0},"EPFvRao-AHL2-WVbGmQ8qA":{"text":"One of the last of the great New Orleans neighborhood restaurants.  You can not go wrong w","useful":0,"cool":0},"diSuRzdAvRfx1Oq8R7AVvw":{"text":"Great service and great food! James was the best waiter I've had in a while since I've bee","useful":1,"cool":0},"Z8D2Nuk-84NSAQBi2Vpc4w":{"text":"This place was pretty good, but too expensive for what it was. I got the turtle soup, it h","useful":3,"cool":0},"YsAAx3gKRn7roBTXaztQ1w":{"text":"Turtle Soup. I love their turtle soup. The fried oysters and fries are enough for two and ","useful":0,"cool":0},"TUMusPltAY4OunyHvNL12Q":{"text":"Loved Mandina's, stopped by to eat dinner before going to an escape room! Delicious food, ","useful":0,"cool":0},"aO9ziwb4xjXYFMdFdteLdQ":{"text":"This place is pretty great. New Orleans is a very touristy city but this place felt more d","useful":1,"cool":1},"S6qygauRP5VvIFNX-hixBA":{"text":"I ate here for the very first time the other night with my family while vacationing in New","useful":1,"cool":0},"TVJ7jddh2HC6G_H33ddJhw":{"text":"Food was good. Very large portions. The prices are a bit high but I could eat the eggplant","useful":1,"cool":0},"IC_6l1XOxlBQ0SwzgBVg3g":{"text":"This is a favorite spot for me. It's a short ride on the street car on Canal Street. My wi","useful":1,"cool":0},"8s4ckEeIFaMKNsYQ5BPAwQ":{"text":"Thought I'd write an update since it's been a year, although I have stopped in a couple of","useful":0,"cool":0},"XCNo5nUPeX6-M61HRbW23A":{"text":"My absolute favorite in N.O..I have come here since I was a college student visiting for f","useful":1,"cool":0},"IYxqkpFmBUbM-p6lj-KjHA":{"text":"We have been going to Mandina's for the last 30 years and absolutely love it - it's my fav","useful":1,"cool":0},"4LxqfHAfaRzB5Ees8bMPPA":{"text":"Oh my gosh this place is great! Family owned and a hole in the wall, you definitely need t","useful":1,"cool":0},"z4M1mVDvr-rDiLRgunnMnw":{"text":"The food was great (especially the gumbo!) and the service was excellent. Very short wait ","useful":0,"cool":0},"7eixH02fJTyhPMsQuK9-Ow":{"text":"Myself and the beautiful wifey came here on Monday August 13th, 2018 for my birthday. Upon","useful":15,"cool":15},"zAPNbhS3FPB1Cvjp5J3j1g":{"text":"Love Mandina's!  Went back to visit NOLA after being away for several years.  Had Mandina'","useful":0,"cool":0},"-hPcpUJ4MHu-avt-QNqlNw":{"text":"My husband and I recently celebrated our birthdays, so a friend treated us to dinner at Ma","useful":0,"cool":0},"0SenTphn12JpruO7W4ChCw":{"text":"Best meal we have had in NO.  Had turtle soup and barbecued shrimp loaf. Service great. My","useful":0,"cool":0},"VnaG4Cv9GdeD2HlhBMyS_w":{"text":"Great lunch spot! We had a party of 10 - food was great.... Gumbo was really good, drum fi","useful":0,"cool":0},"Vx292-TaQa6yEPc7yrfejw":{"text":"Completely classic southern food. Everything I've had here is good. My brother ordered the","useful":0,"cool":0},"VilPFwy_p24ybXv4vtMuUw":{"text":"We went to Mandina's after Bacchus and ordered a variety of items: chicken parm, crawfish ","useful":2,"cool":1},"JLYSeRWmx2Wkur45p3yR8Q":{"text":"Best fried oysters  in Nola.  I'm not a fan of their Italian food but the fried oysters ar","useful":0,"cool":0},"Kjp6zJVcJx4W584yxnjBhA":{"text":"Mandina's is SO homey feeling it was like my mom's kitchen.  I think a lot had to do with ","useful":1,"cool":0},"dtReh8M-kxmssmEnV4PPcw":{"text":"If you go to any place in New Orleans proper you will want to check out Mandina's.  My Mom","useful":0,"cool":0},"Rvv4g20mTtoE0ID6helrpw":{"text":"My family and I visited New Orleans for the first time, and Mandina's was recommended by a","useful":0,"cool":0},"oo_vvP9-5IMXVVsKqfyEtQ":{"text":"I was totally disappointed in my experience here.  Service was lacking and / or rude from ","useful":4,"cool":1},"tLnA2Ucb5tIbnONEhZ3xwQ":{"text":"Almost everything I ate was unspectacular. However, my salad was a grave disappointment as","useful":1,"cool":0},"8BUl3bL9epxrUmqsGX_JCw":{"text":"Mandina mandinaaaaa! I can't believe it took me so long to find this amazing New Orleans g","useful":10,"cool":5},"Kk8QNvfuhXJBR2cWM1zTVg":{"text":"Can't believe we haven't been here before. It was excellent. Our waiter was spot on with h","useful":0,"cool":0},"cZedC-tDlFj3l4A0TFG1rQ":{"text":"Mandina's is an institution so it would be unwise and ruthless to give the place a very ne","useful":4,"cool":1},"ZV6Eiu9jSQEEEjbdvI4AxA":{"text":"The food and service were phenomenal. My husband and I were searching for local cuisine ou","useful":0,"cool":0},"0W29SsoBwTsUbYzVfjkcUg":{"text":"Been going to Mandina's since 1975 when I was with the 8th district NOPD.  It was great fo","useful":1,"cool":1},"ezlvZeudiVZIwfOut1JT4Q":{"text":"Rode the Canal Street Trolley to this charming place. Erin was an attentive waitress and b","useful":1,"cool":0},"mHQXGSW-QCsXXlhU3SPfcQ":{"text":"Fantastic crawfish etoufee! Great service and wonderful atmosphere. We stumbled upon it af","useful":0,"cool":0},"ox77jiqgoKfqMEPBngrj6w":{"text":"The Italian salad is outstanding and huge.  The gumbo is the best in New Orleans, with Fre","useful":1,"cool":0},"NnzL6S1f6ZYV3wq53wgf_A":{"text":"Mandina's is a loud, crowded, neighborhood restaurant. One must stand at the bar, because ","useful":1,"cool":0},"0RyfHdnPi0-Y8o63eijqMQ":{"text":"I want to love this place, but unfortunately I'm just never \"wowed\". Nice atmosphere with ","useful":4,"cool":1},"L6odQVzF05ArybTonx_l2A":{"text":"My family and I opted to eat here during a trip to New Orleans. The food is great, however","useful":2,"cool":0},"O_HxkdS9e2zcrqFJNwtMBw":{"text":"This is my favorite Italian restaurant in town - the place I go to after a 5k knowing darn","useful":9,"cool":4},"VwZ-jmuepMwpo9JZixNHOA":{"text":"Open on Sunday. Would eat her again any day of the week. \nOur last meal in NO was our best","useful":0,"cool":0},"SOlq2MryjYF6VxztQ3XlrQ":{"text":"Bottom line: if you're an out-of-towner like me, and you're seeking \"the real deal\", it do","useful":6,"cool":5},"e8uqin6Zm4xDz-_fWRYf2Q":{"text":"Classic mix of New Orleans staples and Italian classics. We stuck to the New Orleans dishe","useful":0,"cool":0},"Z1LmC8EpgceucstrkUcrCA":{"text":"Decided to try Italian for Dinner, and another couple suggested Mandina's.  We took the tr","useful":0,"cool":0},"gWYBLE4i07KRcroGV_BU5A":{"text":"Great food even their non-creole/Cajun food was excellent. I had the rolled veal, my wife ","useful":0,"cool":0},"EaBw5Y09Sq_D9cbNhSBsvA":{"text":"This is my favorite place in New Orleans, which is saying a lot.  There are so many wonder","useful":0,"cool":0},"DLAuSlS0DxsRBDF73daB2A":{"text":"We went for lunch last week. We ordered crawfish cakes that tasted like glue -- very gummy","useful":3,"cool":0},"lWtxYyvJfGA7xJmVzl_gbw":{"text":"Five stars for the daily specials, the old-school service, and the local flavor.","useful":0,"cool":0},"m695PlAl-Dqt5vxisxNd9w":{"text":"We had quick and kind service. A large group came in at the same time, which resulted in s","useful":0,"cool":0},"EiQkZ3_eBqGUgCnSPpVsVg":{"text":"Excellent meal at Mandina's.  The seafood gumbo and shrimp poboy hit the spot.  Classic Ne","useful":0,"cool":0},"j_kMg6ANloMxKDQZrMq7KQ":{"text":"We had a party of 6 from out of town and had a mixed review.  If you enjoy fried food, thi","useful":0,"cool":0},"PaMVLXp7KNK8YdPiLV96mA":{"text":"Always good, you are our special place, for our special occasion out eating place!\nGumbo i","useful":0,"cool":0},"QX-u7gr1338jaihBDYQNfQ":{"text":"Always a favorite. We usually hit this restaurant multiple times while we are in town. The","useful":1,"cool":0},"eUNCbHi8oJNvopkR8lgM7w":{"text":"Pretty good. Got the spaghetti and meatballs since I was hearing good things about the red","useful":0,"cool":0},"65smNkR_JkKHrCdWOZ9-Ow":{"text":"This is certainly one of our favorite places to eat! Very informal, usually loud because i","useful":0,"cool":0},"ut2i_TX61tfbChZu4vfl0g":{"text":"This is one of those neighborhood spots that's been around for ages. It's casual which I l","useful":1,"cool":1},"p-q0wD-5mYohsxRVNA06uQ":{"text":"It can be a long long wait but hey, that's what the bar's for right? Protip - we got some ","useful":1,"cool":0},"MN-ORhqfa_yFddV2zRk66w":{"text":"I finally had a chance to visit Mandina's!  I went for 5pm (which was perfect timing) beca","useful":4,"cool":3},"k8lNNphHfBD1IAuYo2TXvA":{"text":"Mandina's is awesome. Up Canal street, a bit off the beaten tourists path, you will find t","useful":2,"cool":4},"2wtRvlvlBDboHU2szqM6EA":{"text":"Just finished eating.  Delicious fried chicken with excellent service!!! Visiting from Los","useful":0,"cool":0},"LcKHfbj8ikZ5WEXgYp47aw":{"text":"For our last lunch in New Orleans, we decided to eat at Mandina's after checking out a cou","useful":3,"cool":1},"ARUbwQxWbVELk9-fqLc8CQ":{"text":"Classic Italian New Orleans food. This place has been around forever and is certainly cons","useful":0,"cool":0},"w5PXlwhY2-WniUUZj-oXGQ":{"text":"Authentic New Orleans diner with lots of charm and few tourists.  Went there with some loc","useful":0,"cool":0},"jeDrAIRssjJuYNsU5nuzeg":{"text":"Large portions and great food! There was a bit of a wait. We split the stuffed shrimp with","useful":0,"cool":0},"7wwDO47cOhoGfzlNwkmTOg":{"text":"What a great spot in Mid City! Turtle soup is excellent. Great PO'Boys as well! Friendly s","useful":0,"cool":0},"BGpw9UTCFOv76m2aBR9oBQ":{"text":"Mandina's used to be a family favorite growing up.  My dad really enjoyed taking us here o","useful":5,"cool":3},"OOlvou-8FmwZ88ZqZ9-Kxw":{"text":"Nostalgic lunch. Po-boy shrimp & oysters was average. Bread is fantastic. Top notch servic","useful":0,"cool":0},"sh0s1RcCYCa1MHf6R0nCBg":{"text":"Kudos, Cindy I am a cook so I know food! Who Dat! The quantity, quality and presentation w","useful":0,"cool":0},"wo0NMAkcyY7qhHFMyM2RYA":{"text":"After living in NOLA for a year, I had never heard of Mandinas, passed by it during Endymi","useful":1,"cool":0},"-bB0u_WeeJnod_dr4q2Nkg":{"text":"It's been years! and worth the wait. Traditional Mandina's food and drinks are never bette","useful":0,"cool":0},"kQ9HrRP1wYRDpIlQP0dPLw":{"text":"One of the best seafood gumbos I've had in New Orleans!\nNot to mention the deliciously del","useful":0,"cool":0},"39iFFYcTiBuE-T9CQZ1z4w":{"text":"I love this place.  They really know how to fry food.  I've tried the seafood and had oyst","useful":3,"cool":3},"LyJrsOTeqC69cYtrt0Y7jg":{"text":"Just had dinner there tonight. I feel very confident in the 3 stars. \nWe went on a Friday ","useful":4,"cool":1},"K82SFvdaKvE9hsk90cxxAg":{"text":"Great food, plenty to eat, and quality dishes.  Crab fingers in wine sauce was amazing! Ou","useful":0,"cool":0},"70Y8kvVnOd0LR5bjKSv9qg":{"text":"Been in New Orleans several times and have not heard of this place. Discovered it after tr","useful":0,"cool":0},"ygRpmXAqPD4_-3cudg-b7g":{"text":"My families go to spot for meat balls and gravy, onion rings and good old fashioned comfor","useful":0,"cool":0},"s-H17csVZFuk2SVMwg5x8g":{"text":"Great Italian place.  Wonderful gumbo and shrimp PO'Boys.  Seems to be always busy, but th","useful":0,"cool":0},"MI7_BiBylaUzpCNKvkd-KA":{"text":"If you need a break from the bustling New Orleans touristy spots, venture a couple miles t","useful":0,"cool":0},"i-odCll5uNz27e0oZInEGw":{"text":"I always like the service at Mandina's. It's always so busy, but I always manage to get se","useful":0,"cool":0},"bJq-mKMp68u3ufvcAbcCiA":{"text":"Close race for my #1 shrimp po-boy choice.  Great Oyster And Artichoke Soup!  Good local N","useful":0,"cool":0},"5KAPnifOR8mwQYgARVn0Iw":{"text":"Of the dozens of \"New Orleans Italian Creole\" restaurants once here, the only neighborhood","useful":1,"cool":1},"NUtmgJwgSgH8IHhdoKwIQQ":{"text":"Good place for large group of out-of-towners\n\nThis is our go to place for a large group th","useful":2,"cool":2},"Yn9tgUs2FXh77Ofb9J8Pvw":{"text":"Turtle soup is the best in the city, I love the shrimp salad, trout almondine was really g","useful":0,"cool":0},"IgQUKiXj76Yt6RymSgBV9A":{"text":"This is probably the finest remaining example of a traditional New Orleans neighborhood  c","useful":9,"cool":6},"FaJtwhShBN_JP-V-McdESw":{"text":"This is the type of neighborhood restaurant that anyone should be proud to have on their s","useful":1,"cool":0},"JRHm0TofMGhqy2_WPa7Bug":{"text":"It was alright. I ordered catfish almandine with a side of green beans (string beans). The","useful":1,"cool":1},"hsIDG9PBO2ZzKUoF_NZ8-w":{"text":"At best, a four.  Service was great. It is a typical family oriented restaurant that you c","useful":0,"cool":0},"nQZUuj5a0sZNGeUmn_SDOQ":{"text":"Locals love this place and I understand why, excellent service, outstanding food! Everythi","useful":1,"cool":1},"jUrx623i-NFQOUJUe0s53A":{"text":"Amazing food!  Wonderful service!  Overall great restaurant, wouldn't change a thing!  The","useful":0,"cool":0},"Z2gvqioaEFfn3gWsATxnfA":{"text":"Our visit did not live up to the advertising.  The atmosphere was great, the place was cle","useful":1,"cool":0},"UHY1KjT6-EcTfVCh-_pBIQ":{"text":"We went to City Park to look at Tulips !! Decided to look and see if it was possible to ea","useful":0,"cool":0},"RrqNNsYyP-itvh4ClPWaCA":{"text":"On the street car line. Been there a couple of times during lunch hour .  Pretty loud, but","useful":0,"cool":0},"JTZzqs5Qz6xzXGjn81V_1w":{"text":"By far the best chicken parm I have had in LA. The food is consistently good and the porti","useful":0,"cool":0},"IQHemuprkmZC04TJ_PhMkQ":{"text":"Great local flavor - huge portions - menu had lots of variety  - nominal prices!  We were ","useful":0,"cool":0},"UN_rAqvtXUK5j2rcxATmVw":{"text":"Smells like a nursing home in dining room. Eclectic crowd in bar and good food. That's it,","useful":1,"cool":0},"nx5lSDvnN72FRGx3IzJRcA":{"text":"Love the ambience. Love old school places wherever they are. I want Mandina's to prevail. ","useful":2,"cool":0},"nxLPrPG00QRNhQ_2J8RV8g":{"text":"On vacation & found this excellent food and service restaurant!! Large delicious portions ","useful":0,"cool":0},"Mpnku2-_cPpqXu98RCB17w":{"text":"Food was great and the portions were huge!  Came back here twice during our family visit.","useful":0,"cool":0},"waQnh4tqqIFl0wet32kXVw":{"text":"Have been getting amazing take away from here through the Covid shutdown. Meatball sub is ","useful":0,"cool":1},"6swriKAt6ZX5RSTcbAmXgg":{"text":"Nice menu. Simple but big enough for most tastes. Good service and atmosphere. This is a l","useful":0,"cool":0},"YQLv1BCbe8eTGxNWXbvQCQ":{"text":"Our group of breast cancer survivors had a meeting here last Wednesday.  They were very ac","useful":0,"cool":0},"ioscJEAfMd0IG4YhP1khtw":{"text":"It's a Mid-City local spot with good food. Low key with friendly service.","useful":0,"cool":0},"rOng5tmk0pEacZXHm1StSg":{"text":"I ordered Softshell Crab BAYOU and this is what I got. A fried Softshell Crab with roasted","useful":5,"cool":0},"TVEV39MVrDQ4lJswWL5SYQ":{"text":"This restaurant saved my NOLA vacation amidst a sea of subpar restaurants in the Frwnch Qu","useful":2,"cool":1},"S5jtDQO7SvUvBRqEz1TrbA":{"text":"Went today for first time.  We went in part because an article I read listed their seafood","useful":2,"cool":0},"JtwIA9Jhw96BC0m9gAFlQw":{"text":"Before I start this review, Dear Mandinas, keep in mind that I come to you as a friend.  A","useful":7,"cool":1},"5z26wav1y2EYcHuTV1CyOw":{"text":"After a long week of totally boring meals in Philly, we got home and headed for Mandina's ","useful":4,"cool":0},"A9HBRvaeDU9IyaQmX8TlTg":{"text":"mmmm...after running the Mardi Gras Marathon, I wanted a nice fried poboy and the half and","useful":0,"cool":0},"LZgigC7_hg4XxZ0FERTVTQ":{"text":"One of my go to favorites for 35 years! It is so wonderful that some of the best things ne","useful":1,"cool":1},"Iwf5ILOOxk_0wvMtlK1grQ":{"text":"I had way way higher expectations of Mandina's. \nHowever I wasn't wowed. The food was ok a","useful":1,"cool":1},"uqioYdhGWGl7b0PwdPdzYw":{"text":"Just outstanding.  Everything!  Ice cold beer and perfectly prepared fried oysters and gul","useful":0,"cool":0},"jL6jXS__YDnu0sQ5nIxkKQ":{"text":"3 Stars. Could have been a 5. Let start with the first 2 mistakes from our waiter within t","useful":1,"cool":0},"PnjltcYg-IJfVL4fTX7Shg":{"text":"This place is amazing!  Never disappointed. Can be super busy and a little loud so I would","useful":3,"cool":3},"S7GGzpZIjXAinpshHauyMg":{"text":"A must visit restaurant in New Orleans! You cannot go wrong with the Po-Boys, New Orleans ","useful":0,"cool":0},"G7nGB7Fn1v_Zl9DugD19Mw":{"text":"Absolutely fabulous. I was hesitant to travel out of the CBD to this restaurant way out Ca","useful":0,"cool":0},"JLqrvlEM-ffsKE__WrJAyw":{"text":"Greasy spoon, lots of fried stuff not a lot of vegetables. \nThe Menuiere sauce was amazing","useful":1,"cool":0},"FXVqzwZZmhTDrZSRqeR7zQ":{"text":"Great food. Who knew Italian food for could taste so different!!! It is NOT your carbon co","useful":0,"cool":0},"_h8PidQodJ2Gi3oArQbyFw":{"text":"Very good comfort food and great service. I was looking forward to fish prepared with Alma","useful":1,"cool":1},"25d6XRKZ6cuCCHtIxicifA":{"text":"I love this restaurant. It is so consistently great.  We had a shrimp salad and the specia","useful":1,"cool":0},"7Fmt-1O939EL0dWb7f1eKA":{"text":"My review is based only on their Muffaletta on French Bread. When we were leaving New Orle","useful":4,"cool":5},"oL6jxs8XaYdQ8Gvgru-9-w":{"text":"We came here on our last full day in NOLA as t the recommendation of a vendor in the Frenc","useful":2,"cool":2},"4h6gQhG9LTVO6EnAWFxkwA":{"text":"Love this place! Very high energy. The staff is very friendly! Had the shrimp etoufee (sp)","useful":0,"cool":0},"DvQ45zipzrgFJLkxj7N-Vw":{"text":"This is a locals restaurant on Canal St. in Mid-City. The fried seafood is done well.\nThe ","useful":0,"cool":0},"eSfhYoBfQQX0nhXZmsFaSA":{"text":"We enjoyed a wonderful dinner with friends here and it was delicious with superb service. ","useful":0,"cool":0},"VOJGtG3jqID9dvr8tNd3gw":{"text":"I was a regular @ Mandina's for years. Last week I went in & ordered a catfish & shrimp po","useful":0,"cool":0},"UZpXigc4l7xWZpmYkblDaA":{"text":"Great N.O. institution. I loved the Crab Buster, the oyster po boy was good, and the turtl","useful":0,"cool":0},"t2iNXNouTaYYcl5lQTY9Dg":{"text":"Meh...\n\nCame in for a late lunch.  Ordered a shrimp Po Boy sandwich and it was just ok.  I","useful":2,"cool":0},"rVHy_MhV_i2hAGmkVY3DEg":{"text":"Had a business lunch on Monday and was very pleased. The red beans and rice with fried chi","useful":0,"cool":0},"Uqvw5y2HzyeEfJFOcI__TQ":{"text":"Popped in to meet some friends for lunch on a Friday afternoon.  One of the guys was celeb","useful":2,"cool":3},"TsMr2fGahoMeUrwRwS47mQ":{"text":"When I write reviews in New Orleans, I always assume there are two kinds of people reading","useful":3,"cool":1},"mYCScrKJwCgJGcwMXWhNrA":{"text":"Fantastic Fantastic Fantastic! Last night my husband and I had a dinner date at this place","useful":0,"cool":1},"-muKj7bbnQt53IkWL5hC3g":{"text":"Went with my family for the first time on January 20th. I ordered the Veal Parmesan & Spag","useful":0,"cool":0},"sKaMjFNQRE3-rn_1o10YLg":{"text":"Don't care for their pastas-they tasted like tomato sauce just poured on-their steak was d","useful":2,"cool":0},"B1N0yAP9Wchp4reEg5HEtg":{"text":"I love this place for good reason.  Been many times when I lived in New Orleans and always","useful":3,"cool":3},"ImjXAWneUaImsUYf9gjyiw":{"text":"Great New Orleans and Louisiana cuisine. Salads, not the star of the show, but that's not ","useful":0,"cool":0},"6ZMtHFeIzuXWCEjpUbvFmA":{"text":"Great place to stop for traditional New Orleans feel. The food is always perfect the servi","useful":0,"cool":0},"0lVtqLJybZMdAMqfZXTxMw":{"text":"This is probably the finest remaining example of a traditional New Orleans neighborhood  c","useful":7,"cool":2},"aC6MR-KuBak7HjhN1zobBg":{"text":"Covid WHO? Corona, WHAT? Mandina's has it going ON! They seem to have made their way BACK!","useful":0,"cool":0},"EysAON_vqB5LOSOKw6yuBw":{"text":"This New Orleans staple has been around forever, and I was anticipating great things. The ","useful":0,"cool":0},"taH5t0jQBMVPZYE1-eEIcg":{"text":"Stopped in for a quick lunch. Entire table ordered the Wednesday special. Stuffed bell pep","useful":1,"cool":0},"f34PeZahgoaXW5DvcITrqA":{"text":"Such a great New Orleans staple! Mandinas is such a delicious restaurant with great servic","useful":0,"cool":0},"Ikiu2oi4pzyAHMYzhYGugg":{"text":"05/30- Stopped by and ordered Po-boy and Shrimp Salad!! Was surprise for hubby, brought it","useful":1,"cool":0},"fnuyo9_4l6gThiEfd7RzpQ":{"text":"Oh yeah!  Step out of the French Quarter to eat where the locals eat.  We came here on a r","useful":2,"cool":0},"eZw7zHI4w5Izn03kA-Uusg":{"text":"Neighborhood type restaurant with basic good food and good service. The price with the por","useful":1,"cool":0},"RiRPFFuObPVtzRhbpjnOEg":{"text":"Recently re-obsessed with Mandina's. Like the city and well, all of us, it's had ups and d","useful":0,"cool":0},"FJAFJxzZCpRBHeZvN657Sw":{"text":"Great service and food. Highly suggest the eggplant stix and the grilled shrimp salad for ","useful":0,"cool":0},"9ICCNGDV4anuht_z8FDNRQ":{"text":"That red sauce is the elixir of life!! \nLarge portions! - I love leftovers! The prices are","useful":1,"cool":0},"nZOvbYu4ppNYgnKogVaoag":{"text":"Bclassic NOLA food & drinks in an old style place.  Regular menu plus 4-5 daily specials","useful":0,"cool":0},"k8he_fh6Xmuql88ZLwAt5g":{"text":"We came in with high hopes and left extremely disappointed and upset. It was busy and we u","useful":0,"cool":1},"km6Q2EOr7E1WWT7w_-oVeg":{"text":"We make sure to eat at Mandina's every time we are in New Orleans. LOVE their Bloody Mary ","useful":0,"cool":0},"nlwmbjWxsZiiJ0mRCikkpQ":{"text":"Dined here with my fella and his grandparents today. Said to be one of the last local rest","useful":1,"cool":2},"6I9gNCnksegYs0YIMxWJlg":{"text":"Walked in and was welcomed right away by the host, did not have a long wait and our server","useful":0,"cool":0},"BgZMxyY76uwxcK54DgZrJg":{"text":"Seafood gumbo was great and the crawfish ettouffe and it was also delicious. I ordered the","useful":0,"cool":0},"jisrz5rybGV2cCGhaBiqFA":{"text":"My husband and I are in New Orleans often, and Mandina's was recommended to us by a native","useful":2,"cool":2},"lAkdqss3B68l7RfG5ln0rQ":{"text":"Great food, and lots of it. Waiter was far from friendly though. Seemed everything was a c","useful":0,"cool":0},"DY3GeA7JV5Qs_JmxSpKuwQ":{"text":"Always a favorite for lunch. Classic old school New Orleans! Relaxed atmosphere, off stree","useful":0,"cool":0},"WJsQwiB64yBWOCaDR88tig":{"text":"Excellent pan-fried oysters on salad, great spaghetti and a decent Nola IPA. This is a nei","useful":1,"cool":0},"LK4n_eC8K99Ay9V7KWOBLw":{"text":"Another classic NOLA restaurant. Has a very old school vibe, and the spaghetti and meatbal","useful":0,"cool":0},"ZM5Lhgq7G0-6rha32pW2-Q":{"text":"Long standing New Orleans restaurant. Great Italian and Seafood menu. Favorites include th","useful":1,"cool":3},"pyd6EvsMbdUKx0z4t8Mt5A":{"text":"While visiting this restaurant with my family of 11, we were told there was no guarantee t","useful":2,"cool":0},"l2B1SJJ4fAR8znuKamXFSQ":{"text":"A true NOLA classic restaurant with a great seafood and all other variety selections to ch","useful":0,"cool":0},"W5pe93Wzj4GbU8jEP3vApw":{"text":"Always good, you are our special place, for our special occasion out eating place!\nJohn lo","useful":1,"cool":0},"DxvHnputko1b98KVh1m8bw":{"text":"Po'Boys and Trout Almandine, oh my!\n\nIt's taken me a couple of weeks to sit down and write","useful":3,"cool":5},"Ex6hmlAQtc0ycjfQPl3CIA":{"text":"Food was good. Oyster artichoke soup was too thick. It did not have a soup like consistenc","useful":1,"cool":0},"OTEWhOpju6G8yDpy1WGQHA":{"text":"Last night was our first night of our vacation in the Fat City. The quaint little B&B we s","useful":0,"cool":0},"FGEYDeuSbNjPrXwftxFMZA":{"text":"Got curbside pickup. The fried chicken was hot and fresh, but it was unseasoned. It tasted","useful":1,"cool":0},"hiZxaHQRo8i0VuF8KXlRQQ":{"text":"I love this place. It has spoiled me so much with my standard of pasta I am never happy wi","useful":2,"cool":1},"1soZcylS7B7ALhtl5FY2fw":{"text":"Great local restaurant with authentic Cajun/creole cuisine! You will not be disappointed! ","useful":0,"cool":0},"0p7_7hYQPja1NsvtRu7LAg":{"text":"As a fundraising professional I'm always looking for a great place to take my clients. Par","useful":1,"cool":0},"oxsTD8xzQ--egrHwSPJqZw":{"text":"Our group of 9 stopped in for dinner after Jazzfest. The place was crowded and therefore l","useful":1,"cool":0},"WkAyvAE6_OM5alSQ8GgJaw":{"text":"Hadn't been in for a while.\nThe Wednesday special was a grilled catfish, ' creole' sauce s","useful":2,"cool":4},"jZQtRBSKCTR7m6l08A1xUQ":{"text":"Good food.  But I got some to go and got a single boiled potato as a side for $3.50...   s","useful":1,"cool":0},"ZVWqLIfyOoIPYwYzWcWTyA":{"text":"Great little restaurant. However if you have a large party find somewhere else.  They have","useful":0,"cool":0},"rpowWxZ4wyxCH9I6fugmYg":{"text":"This restaurant retreads the same old tired New Orleans fair that used to be considered hi","useful":3,"cool":0},"q4XnwTnTWkmIIQzet4WNqA":{"text":"Mandina's is always a solid restaurant to eat at whenever I visit New Orleans. I found out","useful":2,"cool":1},"0xymFqOK6b9bIe9WPrFuDQ":{"text":"The ambiance is early card table, but don't let that affect your decision-making process. ","useful":0,"cool":0},"a_-E1QtmbxGQHBryKqw5NA":{"text":"This was the first place we ate at upon arriving to New Orleans. During our stay, we ate a","useful":0,"cool":0},"JNPVbsCtbu8WxaJfnZHsog":{"text":"I ate lunch here and had some authentic New Orleans Catfish Creole and it was pretty damn ","useful":0,"cool":0},"Vl-x34OmV2bk-tA6OKD-DA":{"text":"Went to Mandina's the other evening with\nthe grandkids, the meal was fantastic!\nWe started","useful":0,"cool":0},"m-9ke2Ps49HUjp5jBb0p6w":{"text":"One of the best restaurants in New Orleans! Always pulls a crowd for a reason! At 1pm in t","useful":0,"cool":1},"k6kqJYbElJvpPsqDmTs60g":{"text":"Mandina's sure knows how to make spaghetti meatballs ! The sauce was perfection down to th","useful":0,"cool":0},"fWjwBY3xn7j_mIeOyCz-qw":{"text":"Had lunch with my dad and uncles at this great  New Orleans establishment. The drinks, the","useful":0,"cool":0},"PGqn6d5cse_2iPg987OldQ":{"text":"This was my first time at this restaurant.  The service was not good as we were waiting fo","useful":2,"cool":1},"1d3x5qhxH6gmlTZXFzKOoA":{"text":"Finally made time to come back and sample the burger on the fresh yet crusty French roll. ","useful":1,"cool":0},"zHPIW13D_l3xk983cTorHw":{"text":"In from out of town and looking explore the area, my wife and went for a long walk and end","useful":1,"cool":1},"BZrf9YRd4kPWIF9dFPAqpg":{"text":"Easy to pick up... Hot, delicious. I miss going to restaurant, but I don't have to miss ou","useful":0,"cool":1},"7KkpJCieI2Irl5-jnL7pRA":{"text":"We recently went here with a very large party. Considering the size the of the party, I fe","useful":3,"cool":1},"d90rr5l531KFTDNAa1Sz_Q":{"text":"Our usual Dec visit is later !!! Gumbo great as usual!\nI tried the Cajun Grilled Catfish !","useful":1,"cool":1},"8blIv6TFpXXEYc0b5zUaYQ":{"text":"We went here for a celebration work dinner. We had a huge party, about 25 people. Even tho","useful":0,"cool":0},"y_JFKWzdtofDnxIUs9eeQg":{"text":"This trip to New Orleans we stayed on Solomon Street. Mandina's was convenient to be our f","useful":0,"cool":0},"9pOJDb_mMgNhFInPqXZz8g":{"text":"I hate to tell you how good this place is. As someone originally from New Orleans this pla","useful":1,"cool":0},"54Jtw-qiHjMQo5GKtiyomg":{"text":"Pretty much as good as before the storm, with more pluses than minuses.  The walls are cle","useful":0,"cool":1},"PFsBsJyrSbxkqmbqO3p1_Q":{"text":"In New Orleans for a few days so I decided to go on a gumbo tour! This was my first stop. ","useful":1,"cool":2},"VA5dOjOMAdOAYfWLw06quQ":{"text":"Always good, you are our special place, for our special occasion out eating place!\nGumbo i","useful":1,"cool":0},"SBYLwJB8iCNN6g4GH74CPw":{"text":"Huge portions. Was the perfect place for our family Sunday lunch when the in-laws visited.","useful":0,"cool":0},"XBe5hCaj17q6IjSNKlgmIA":{"text":"Mandina's restaurant never disappoints! I have always loved dining at Mandina's over the y","useful":16,"cool":13},"ehBKPEE99XMFHySCDfUKzQ":{"text":"Oh my goodness. My mom & I love to stop by when we're in the neighborhood. Their gumbo is ","useful":1,"cool":0},"CUu7Dj_VmW1WBt0vSwcYYA":{"text":"I was in Louisiana over Christmas, visiting some distant family (being from the UK, they'r","useful":0,"cool":0},"e6xgkGL6Zfr8a1vvUQ8OYA":{"text":"Over 100 years old, Mandina's first opened as a grocery in 1898 later turned into a restau","useful":4,"cool":2},"2OKVoCw3AC3SVfJZN-2xtA":{"text":"This was my first time here...Transplanted Cajun returning from Memphis.  As stated I curr","useful":0,"cool":0},"5iJGKq7zLwZlxy4hVdRWpA":{"text":"I came here because I read a review about amazing porkchops. \n\nThe restaurant is in a shad","useful":1,"cool":0},"0-9ZhPRoHNkEy0anMGEqJg":{"text":"Ate there for the first time and it was fantastic! I had a 1/2 shrimp 1/2 oyster PoBoy. Tw","useful":0,"cool":0},"CtQHIbDtRnz0ryd13Xqygw":{"text":"Only read a handful of reviews prior to heading to Medina's. \n\nAlthough the catfish and fr","useful":1,"cool":0},"XRt6ItwOKBdk12U5cKuU6A":{"text":"I stopped in for a second helping, and I must say that I am at odds. Perhaps I held it at ","useful":2,"cool":0},"9Ag6F0uwIgJWcKlbET2foA":{"text":"The grilled oysters and green tomatoes were fabulous. But the \"etouffe\" was awful. Obvious","useful":1,"cool":0},"FWVnwmMMYWiS5bEbnojLWw":{"text":"We enjoyed our dinner here. Well, at least the other three in my party did! They had great","useful":0,"cool":0},"Chx09SAP8Z3OCAZ7jLdX4Q":{"text":"I love this place.  I don't get to go as much as I would like.  I feel like their servers ","useful":3,"cool":1},"bydXDGyBTCpezQpLNmKmtg":{"text":"This is not the place to go to on a weekend night or for a quiet meal. The place gets pack","useful":2,"cool":0},"QyyuTiZz7kr_HMhfyoHZmw":{"text":"I'm torn about this review - here's why:\n\nI walked into this place and thought: I love it ","useful":1,"cool":1},"14RBf4rt4LeLoDQgE2IAbQ":{"text":"I went to this restaurant on our hotel concierge recommendation and it was the worst servi","useful":0,"cool":0},"RzaaC8NRamyEwruDVvp4hA":{"text":"Omg, what a gem. \n\nSlightly outside the city, had some friends take me here. \n\nAuthentic f","useful":0,"cool":0},"FGVJgejmdAauOP99p_h-5A":{"text":"Classic neighborhood restaurant, \n\n\nBring your appetite, Y'all!  Crawfish pie, Po-Boys, tu","useful":2,"cool":0},"Dk_m8FGDN1RjBYyaEPCvng":{"text":"Food and service were great!  Shrimp  Bordelaise over pasta was awesome and so was the spa","useful":0,"cool":0},"mmuSE4nk9gKmK67ULrPetw":{"text":"A trip to New Orleans would not be complete without a meal at Mandina's. This is one of my","useful":0,"cool":0},"vI0CfwDNnaawlRcOu75VDQ":{"text":"This is a classic New Orleans restaurant. Great lunch experience. Atmosphere is so totally","useful":0,"cool":0},"4OMvx0YnKn5pf0pdpDxvDQ":{"text":"My wife and I visit Nola often--we're from Chicago, but New Orleans is our true \"home away","useful":0,"cool":0},"iPcW589N18E4UIw-tWQdRg":{"text":"My first visit to Mandina's in New Orleans was a very interesting experience.  The good ne","useful":0,"cool":0},"UjB-ISBNI7a2iKT_qjEGvg":{"text":"The food was not great. The crab claws were bland. The onion rings were bland. I also had ","useful":2,"cool":0},"0ewu8JDy3Bn5qTLsooA1qA":{"text":"Always good! Eat there every two months or so.","useful":2,"cool":0},"8ExHVdGJNwaXDtQWlFLxQA":{"text":"I had heard such amazing things about Mandina's so I was very surprised by the rude attitu","useful":2,"cool":0},"biNqY7J9OE3CaGdR4JflNw":{"text":"Lately, I've been suffering from a bad ,bad run of fusion/ hipster meals, where you sit ou","useful":0,"cool":1},"qyd8XU1h_zVDL4Yjylva6w":{"text":"We were really impressed and very satisfied with our food and service. \"James \" was our wa","useful":0,"cool":0},"nJd4aDkHMSidUYtxDCBQbA":{"text":"The decision to visit Mandina's was made based solely on the recommendations of yelp, prox","useful":1,"cool":0},"-OiMmghfBp8MjM2hlT4upg":{"text":"First time eating here. Wasn't a long wait, staff was friendly and efficient. We had the o","useful":1,"cool":0},"76PISq75MiJQ-wzhoiPyMg":{"text":"On a recent visit, I ordered the Pasta with Shrimp Bordelaise after having a negative expe","useful":2,"cool":0},"O4UxESqVWUC0oZsHSQ5XWA":{"text":"If you're looking for a place to indulge yourself with bomb food, in a laid back neighborh","useful":1,"cool":1},"eR4KVVcvjWy4MGIOC1adtw":{"text":"We had a very good experience here - both the service and food were great. We had a large ","useful":0,"cool":0},"TWEkE9rimkzYUu7uwUSPdw":{"text":"If you're looking for true New Orleans eats, try Mandina's.  \n\nMy sister in law - who's fr","useful":11,"cool":11},"zpBz_AGfaY82xuYzqfybWw":{"text":"Oh my!!!  Just down on Canal St!!  I had a client out for lunch and we had a great meal.  ","useful":1,"cool":1},"K6neQqSTFfYBnqnIT3FW3w":{"text":"Mandina has been the best food in NOLA I have had the pleasure to eat. My friend and his b","useful":2,"cool":1},"ZhdmnU1i_JqgIeDv6ubyKg":{"text":"Been going here since I was a child always pretty consistent throughout the years. If you ","useful":0,"cool":0},"k9TkLCtten4M6sxh5IFs9g":{"text":"This place was recommended to us as the 'grub' of NOLA, but we just weren't feeling it.  F","useful":1,"cool":0},"GZbUws_thsgICDDPwDXU8Q":{"text":"Loud, but really good.This Mid-City restaurant is a classic, right out of the 1930's,inclu","useful":1,"cool":1},"BT532oWXjRJn0FGJyNqV7A":{"text":"A\n\nWorst bread pudding I have ever had or seen, and I've had a lot, everywhere. \nThe 3 of ","useful":5,"cool":0},"bd2UGJu0O0dkudvPoQ2tTA":{"text":"Thank you Yelp gods!! Riding the tram 21 stops out of town was way worth it. THIS is what ","useful":3,"cool":2},"SeoldwGKZg8m3KtCtKPaRw":{"text":"New Orleans home town dining at it's best - avoid the chains. Affordable and always delici","useful":0,"cool":0},"QrzqXepS9Kc9d6K6fJH_Fg":{"text":"I had great company here but otherwise wouldn't be in a hurry to go back. I think we had t","useful":1,"cool":1},"szGctkWhb13DPE6JCTyAdw":{"text":"This was my first time trying this spot. We ordered the crab fingers for an appetizer. The","useful":2,"cool":0},"_GdW8q0jtTVAOm7DrlgHXA":{"text":"My boyfriend and I split a huge grilled shrimp salad with what appeared to be homemade ran","useful":2,"cool":1},"eCb2Q8jwHm2JZV6ylL1Zmw":{"text":"My brother found this gem of a place and has turned our whole family onto it. Located on C","useful":3,"cool":1},"huih3bYd2yaP0qCuulwVeQ":{"text":"Here with my Yelp pal Shannon S. who recommended this fine establishment with nice special","useful":51,"cool":52},"faNh2aT4E7_NdInhKeiwTA":{"text":"For this latest NOLA trip I decided I was going to go out of my way to try an old institut","useful":10,"cool":9},"dhNNurItHXRdIsnsbMZGKQ":{"text":"I'd give a better review if we'd gotten to truly eat here. We arrived and ordered the shri","useful":2,"cool":1},"-3R-aQo-zuNT1rZkKJ91hQ":{"text":"I took an uber way out of my way to come here because it was so highly rated by a close fr","useful":2,"cool":0},"JCnpIqFNKz7pOqGcTsg_3Q":{"text":"On my visit to New Orleans, I was given a list of places that a good number of locals list","useful":0,"cool":0},"DOTboZRPXDqXxP1u1_kjWQ":{"text":"Your typical mom and pop restaurant with poboys. I thought they were a bit overpriced at a","useful":2,"cool":1},"qJRkq89VeTSvV1vZUKgucg":{"text":"Maybe it was an off night but I'm saddened to say that the food tonight was far from the u","useful":0,"cool":0},"OfEx8yfrB1H2-x98ZSHyiA":{"text":"The local family restaurant vibes here are on point and it was the perfect venue to try cl","useful":0,"cool":0},"khQEWhlK_VnRL6Ht-HlLBA":{"text":"Great place my family of five went there for dinner and prices were good .had big dishes a","useful":0,"cool":0},"YXM-JpfKa6KbTtTqQI18AA":{"text":"Been here a few times. It's an old style Italian place, with lots of pasta dishes and seaf","useful":1,"cool":0},"G-386Rl3MQ5WcAb7IEFUdw":{"text":"This place was our last stop before leaving New Orleans. It wasn't our first choice but I'","useful":0,"cool":0},"qCqpPi_Oa9Nk4ATf5ftvew":{"text":"Oh NOM-dinas, you never disappoint! My mother, the Mobile, Alabama native and resident gum","useful":4,"cool":6},"8Q1-LA94rnhgMKF3MBwgkw":{"text":"The atmosphere is nice and inviting, and everyone is friendly and welcoming.  Unfortunatel","useful":0,"cool":0},"wv89t8f9U6ufvIKk1SAjTg":{"text":"Took my dad here for Father's Day to get a Whole loaf. Unfortunately, the server thought h","useful":0,"cool":0},"VIV1AYkORQE9yGpEbfb6VA":{"text":"We just got done enjoying the Botanical gardens and city park. We were looking for local a","useful":0,"cool":0},"NoP4wbicHOzmA7dIAogD9w":{"text":"Been coming here for 30 years!  Always good.  My faves are the fried eggplant sticks which","useful":1,"cool":0},"ohy2gVU2fF4pF-V2HcJ70g":{"text":"It's been over 20 plus years since I have visited to dine here. Called from another spot a","useful":4,"cool":1},"FlyaOtmJcdymj6jl60VMWQ":{"text":"My first impression of this establishment is that this is a family friendly restaurant tha","useful":0,"cool":0},"k7lcZbSZUfLJDIAvB-sRPA":{"text":"It was our first time to eat creole cuisine. We ordered daily special one called creole sh","useful":0,"cool":0},"pESHejBOpAKvM3HfEwNTJQ":{"text":"We were so lucky to dine here as our first meal in Nola. You set the bar Mandina's. First ","useful":0,"cool":0},"rOORq8jxu28B1KRnvyXDkA":{"text":"Mandina's is the perfect example of an old-school New Orleans neighborhood Italian family ","useful":9,"cool":5},"j3wP9kNlWt249noDSm3r9g":{"text":"This was my first visit and I was somewhat impressed.  James our waiter was awesome and ve","useful":1,"cool":0},"MZ4yoiJr7Q5q-0XI4DGHHw":{"text":"Mandina's is a capsule experience of dining in New Orleans.\n\nFirst, it's been around for d","useful":2,"cool":3},"G3HKBDNrGJxSOV1zwPsa2g":{"text":"I just wasn't impressed. Ordered a friend shrimp plate, the shrimp are frozen. I've been h","useful":1,"cool":0},"8R6lGn8WhUTRFDhdOxCV4Q":{"text":"My boyfriend and I love coming here! The staff is always so kind and welcoming. I LOVE the","useful":0,"cool":0},"eLQZPCGDn-QD_pL2J2p6hA":{"text":"One of the best restaurants in my recent memory.  The waitstaff gave excellent suggestions","useful":0,"cool":0},"UQEtHsxNCTWi1phUpc3esA":{"text":"Good restaurant walking distance from India House hostel. We had to wait about 20 minutes ","useful":1,"cool":0},"qoHRl_6ba3-ZJVDdVV-d9A":{"text":"I came here with a group of 17 people.  They gave us a reservation, but upon arrival they ","useful":2,"cool":0},"5Wxz6PM6iNXCrPixqB3a5A":{"text":"Great for what it is.\nLots of old school comfort dishes served in generous portions at fai","useful":1,"cool":1},"uewhJWxQ-SuLjheQufIEeQ":{"text":"We went for lunch right in the middle of peak lunch time.  It was crowded, but they got us","useful":1,"cool":0},"GNCCFjDV2pxSud7RVo007w":{"text":"I have heard of this restaurant for years and finally decided to go. I am sorry I waited s","useful":3,"cool":2},"zgCCWgRcJbkvohIItVNxPg":{"text":"So there's this saying in New York that the local water is what makes the bagels and pizza","useful":1,"cool":1},"HcojlzTO5CAkEgC9MnoiGw":{"text":"Mandina's is one of my all time favorites. I have been coming to this restaurant since a y","useful":0,"cool":0},"rL22A6MRmqkZnnQA79Cf0g":{"text":"We love this place as have generations before us.  We have been coming here for 29 years -","useful":4,"cool":3},"TQFDL4GiKPyOjyJ9bNwfyg":{"text":"Having our 12/05 Birthday Lunch to GO !!! I'm sure it will be GOOD, (Always IS ) !!! We go","useful":0,"cool":0},"NB-wEP_Mb5x93aRNbnVDSg":{"text":"First time here last week. Suprised I haven't been here before as I have passed this place","useful":20,"cool":16},"2AjWCDmekCDaNbzGSYNQUQ":{"text":"Many New Orleans natives seem nostalgic, even defensive, about this place. When they ask \"","useful":4,"cool":1},"KUQSELhcJ1QxZd4YXV8dcg":{"text":"Mandina's is one of the most historic Italian/creole restaurants in the city.  Old-school,","useful":20,"cool":18},"rR3_B5mfIKngPW5DjU8-Nw":{"text":"Shrimp remoulade delicious as was the gumbo !\nOld NOLA restaurant but worth the stop! Fren","useful":0,"cool":0},"HJA90kiL18fTMbXgfBBVFg":{"text":"Have loved Mandina's for years. Atmosphere is homey. Service is friendly and efficient. We","useful":1,"cool":1},"9n39Z8QzvUFwPjFURnWQvg":{"text":"Incredibly disappointed by the food, especially considering the prices. Nola local and you","useful":0,"cool":0},"iNd-2Tj8SVRnxc5Ve2XDBA":{"text":"Arrived around 1 for lunch with hubbub. We were seated and our waitress gave the vibe of u","useful":3,"cool":3},"u6CtxUYB-BbtBESV9DnBtQ":{"text":"Hands-down, the best blending of food, local culture, ambiance, people watching, and every","useful":8,"cool":6},"WnR9mDcz04inJSNNcKAwRA":{"text":"This place is always amazing!!!  You have to try their turtle soup. It may change your lif","useful":0,"cool":0}}