{"wNbrE9cIzYqCfvZ1o-Crqw":{"text":"Thanks to Yelp, we stumbled on to Sovereign Pub while we were staying at the nearby Hampto","useful":0,"cool":0},"jG7a6tEM4rwtMb9o62UdHw":{"text":"Sovereign Pub is a tiny little bar tucked in one of the buildings behind the better-known ","useful":2,"cool":0},"BwWtO1Hrj7aKPeuP_Nskrw":{"text":"What a cool spot!\n\nI had passed this place a few times on my way to Delachaise and always ","useful":5,"cool":1},"plSQeSMeJuTi9JueddU2Ng":{"text":"If you are looking for a good place to watch Game of Thrones. This is it! I usually go to ","useful":0,"cool":1},"fFRQGmMLvJWvJNHbo5CTCA":{"text":"It's a good place to go have a drink and not give a shit, surrounded by other people who d","useful":1,"cool":0},"BzrmV1UHym3roS5zm5wxNw":{"text":"Cozy and friendly neighborhood bar with an awesome drink selection! Bartenders are helpful","useful":2,"cool":1},"7VozItcil49UDKj_-7wPjA":{"text":"I've had this quaint small bar bookmarked for months and finally stopped in because I had ","useful":4,"cool":5},"R-lReTWcgOshylP9bzQIow":{"text":"This is a cool little bar with a British theme.  They have the tiniest little men's bathro","useful":1,"cool":1},"RbjptGxsRhZWVYW4GjDCwA":{"text":"I can't really say anything special about this pub. It does occupy a quaint location just ","useful":0,"cool":0},"O2TJO2-iHyUuAImCG4G2TQ":{"text":"This place is awesome. A great spot to grab a drink, watch some sports, and be able to hol","useful":0,"cool":0},"VMHAa5_1yDOM2GfcccUC-A":{"text":"I can't really say anything special about this pub. It does occupy a quaint location just ","useful":0,"cool":0},"6Ostq9zhwy6o8gwYv_tM_A":{"text":"If you can keep me for several beers and entertained then the 5 stars have been earned. Co","useful":1,"cool":1},"e1875rnw4mmHrvVy-fG0dA":{"text":"BLUF:  I really like small divish bars with good drinks and interesting people.  This is t","useful":1,"cool":0},"rJhguHndo-GSCLTm_T1Gwg":{"text":"I can't really say anything special about this pub. It does occupy a quaint location just ","useful":1,"cool":0},"0oj3X2jl2mzS_PMPB0PZgQ":{"text":"Lovely space in the heart of Uptown.  Where Delachaise up the block succeeds in making you","useful":3,"cool":1},"vnMe2O9UxDtIXHLuq4Ttjw":{"text":"This is a very nice, small and friendly place for a drink near Touro Hospital. The guy beh","useful":7,"cool":4},"T-TbDS0VA3TJV8GCqGlS9g":{"text":"small bar + super nice staff + great happy hours = a great local place to drink AND have a","useful":4,"cool":1},"52J3DNsNHu72O7KdOPSQLg":{"text":"I'm a big fan of this place and come often when I visit friends in the area. Cool decor, c","useful":0,"cool":1},"XJi8TN_ZVqgwlJHEbVpwyg":{"text":"Love love love this bar, tiny little spot but super friendly staff. Suprisingly large beer","useful":2,"cool":1},"l0_Watn3So-xYMk_luk7qg":{"text":"very nice environment, came here during my visit to NOLA and found the service great, woul","useful":0,"cool":0},"Jd8FTH0NLb-2GHwIlFj0mw":{"text":"Have you ever been to United Kingdom ?  If so your opinion may hold more weight than mine ","useful":1,"cool":0},"eBrXiwwWzUMlYZpWl-25rA":{"text":"\"If I could open a bar, this is what it would look like...\"\n\nI'm not really in a writing m","useful":4,"cool":3}}