{"m7R3Q2dVHpkJ6rHzu9gYPA":{"text":"We worked with Jean Paul this year and most of our interactions were long distance. We mov","useful":0,"cool":0},"5E1dM6NYfZcc6pFQQwQmlw":{"text":"Three years ago, some friends highly recommended Jean-Paul, as they had purchased a home w","useful":5,"cool":2},"DljkUITtS6UoSUShS8e7kg":{"text":"Really liked this guy. Very professional, and very helpful. Did not end up going with a pr","useful":4,"cool":3},"JwRjm9rqFtwBh-5-K44lgg":{"text":"I'd give them 10 stars if it were an option! Jenna Swain and Baxter Stewart are a New Orle","useful":0,"cool":0},"5BU2Z4vit2DynpESEoi89A":{"text":"Buying a first home is a very exciting part of life and at times and before meeting Jean-P","useful":0,"cool":0},"_ql1l4Wl3de2HAtjoW_VtA":{"text":"When we first started to think about buying a house and moving to New Orleans we found Jea","useful":0,"cool":0},"2OQ_z0b4X-6PxE7SSu8eeA":{"text":"We've worked with Jean-Paul for the last four years.  He's always available to help provid","useful":0,"cool":0},"4K77YM7lJV9GKCBUlQDMBA":{"text":"Jean Paul Villere was one of the few leasing agents who even returned my phone call when w","useful":1,"cool":0},"yl_jr0-E629qAuXW7Zdizg":{"text":"Remember that candy shop in Charlie and the Chocolate Factory where the shopkeep sings a c","useful":2,"cool":1},"tiJqFpV0jjPP-t6iH4pc-g":{"text":"My parents decided to buy a rental property in New Orleans even though they live on the ot","useful":0,"cool":0},"B9Kd3yIpTIzEHAAPeOoVrA":{"text":"Jean-Paul is extremely helpful and knowledgeable. As a first-time home-buyer, he held my h","useful":0,"cool":0},"dOZ_4kuIwzf4_vL_U0ssGw":{"text":"I really cannot recommend Allison Alsup at Villere Realty highly enough. She helped me eve","useful":0,"cool":0},"C-AgLsK3_xaWMwUCL5wRCg":{"text":"If you're in the market for a thoughtful, hardworking, honest real estate agent in New Orl","useful":0,"cool":0},"WtzwheDKVP-jCJcdtKVzdw":{"text":"Although our family is very much still \"in process\" with our NOLA real estate solution,/dr","useful":1,"cool":0},"IQqOFKyoQ4XSTA-7X8-x4w":{"text":"Jean-Paul is very personable and takes very good care of his rental properties. He is quic","useful":0,"cool":0},"0Pzr5lUwd7gDJot67ERcYg":{"text":"House buying. It can be an intimidating process. Thankfully there are agents out there, li","useful":16,"cool":15},"I4t8URXkWiSdhGrYMjHQLQ":{"text":"John Paul and Renee are great people. Attentive, kind and really easy to get along with. A","useful":0,"cool":0},"A-WXkNgNxVuitb8epanIDA":{"text":"JP has been our go to guy for years, he listed & sold a property on General Taylor for us ","useful":0,"cool":0},"3_-dSNsGhQX5k-o7x19lFg":{"text":"Jean-Paul is by far the most professional and attentive landlord I have ever had. He accom","useful":0,"cool":0},"1D5YtWlHU6VvtaT9KPu7hg":{"text":"We can't sing Jean-Paul's graces enough! He did such a wonderful job helping us get our fi","useful":0,"cool":0},"4ILzrgwynUk1WCAqS3729g":{"text":"Working with Jean-Paul was great! He's very knowledgeable and helpful, providing endless l","useful":0,"cool":0},"qCrsp-4plAj_eeylSvrgyQ":{"text":"Our dream was to live in our favorite city in the world- New Orleans- and Jean-Paul helped","useful":0,"cool":0},"9RsVOHBBF6m0J9GzX2iGKg":{"text":"We worked with Jean-Paul off and on for three years to find our first house. JP took the t","useful":0,"cool":0},"qBhpt4wSc0xfbFz7m-KQaA":{"text":"Jean-Paul Villere is a pleasure to work with.  My husband and I came to him as first time ","useful":1,"cool":1},"kaO1syJ3PzOBRkSwwTS5ag":{"text":"This was our first experience buying a home, so I don't have much to compare my experience","useful":0,"cool":0},"64btO6ZxFdt-6-VDwmo6lQ":{"text":"Purchasing a home, and in our case a 'First Home', is an overwhelming experience. The folk","useful":1,"cool":0},"rWnMnL0gTWKKmJgs8fZOGw":{"text":"My husband and I first met Jean-Paul when we rented an apartment two years ago. As a landl","useful":1,"cool":1},"m-ytN_0XR4yjxU5xEJnoDw":{"text":"I have had a few years of major ups and downs. Too many downs, in truth. The silver lining","useful":0,"cool":0},"AqCKlYzI-QqGDPYWiWdGQA":{"text":"My review of this realty firm will be a little different from others. I own a double and l","useful":9,"cool":4},"f04W5tb84OBs5oUahNxUIw":{"text":"The time came to find a new rental simultaneously for myself and two of my best, both of w","useful":16,"cool":11},"Bo0sBu6s39GU-P8GQSw4XA":{"text":"Jean Paul is awesome, was on time, courteous, professional and personable. He was our leas","useful":5,"cool":3},"QJymmPri_s6JYMtk8Ilc5g":{"text":"Jean-Paul is very personable and takes very good care of his rental properties. He is quic","useful":0,"cool":0},"4B7vs5gusgIvl1dCg_rDbA":{"text":"I haven't worked with many realtors but I've worked with enough. JP at Villere Realty is t","useful":0,"cool":0},"V2rc9Kd58xxE641dwM9c5g":{"text":"I made an initial call to this guy and asked him to call me back.  I wanted to talk to him","useful":12,"cool":0},"TtMur4UqTqU95wk4Za6DTQ":{"text":"Jean Paul Villere is one of the most outstanding folks I have dealt with in the city of Ne","useful":0,"cool":0},"MwTJtXJMn-cE3ma71u_i9w":{"text":"Jean-Paul sold us our first and only house. Villere Realty was relatively new but Jean-Pau","useful":0,"cool":0},"3_iI8Lf2BWoigOULGfn6RA":{"text":"Jean-Paul was fantastic at finding my family the house of our dreams, within our means. He","useful":2,"cool":0},"pITEWQaw5paosbap059HXA":{"text":"Jean Paul helped us through the house buying process. He was very accommodating when it ca","useful":1,"cool":1},"ABk_U4mGOQuaI2u66b56uA":{"text":"Jean Paul helpled my wife and I find a house that we absolutely love.  He has a no pressur","useful":0,"cool":0}}