{"Q7JNQsqeFV44DatNZehBIQ":{"text":"My favorite pizza in New Orleans. I also like that they offer salads (among other things) ","useful":1,"cool":1},"JKtzPwFWmOnoJHW9dsFlHQ":{"text":"The outdoor seating is perfect!!! The drinks were fun and the chorizo pizza was delicious.","useful":1,"cool":0},"qqBH4BjljoSNTTuvQpVD1A":{"text":"Cool Pizza place and glad New Orleans finally has a Neapolitan pizza offering.  Pizza was ","useful":0,"cool":0},"_qGF_VlJFAGlgAONfi7nmA":{"text":"Went back to Echo after being offered by the owner a free pie. The pizza's were once again","useful":3,"cool":1},"eOIqRMXnbtXHiV51PvWUWQ":{"text":"I had heard a little about Echo's when I ended up close enough to stop in for lunch.\n\nThe ","useful":6,"cool":5},"xKEeSnML7oD0sUuFeEoVBA":{"text":"I first saw this place come up under \"hot and new\" on Yelp and soon after, a friend of min","useful":2,"cool":0},"Lj9jtDI8jebUCIIL_WamHQ":{"text":"The Margherita pizza was kind of a let down, I only gave 3 stars because they totally skim","useful":0,"cool":0},"7GBmoPdNk7D-6xhYoe6iag":{"text":"Service was pleasant.  Craft cocktails were unique and strong (rum cocktail was really jus","useful":0,"cool":0},"OmRc3S1Ne0zq0wu7kQYvsA":{"text":"the pizza is amazing! whole vibe is relaxed and pleasant and there is a nice courtyard out","useful":0,"cool":0},"qtXetXucNxj0d_Via3-fkg":{"text":"Excellent service. Fun atmosphere. Reasonable and intriguing cocktails. Lambrusco!! Don't ","useful":0,"cool":0},"ZLTLLeWbJdc_W39A0K6GuA":{"text":"The pizza is absolutely top notch but it's more personal, California type pizza so don't c","useful":1,"cool":1},"isb9MeTmaa7aG8rbyqs7Pg":{"text":"I love Echos! Everything is spot on and craveworthy. My favorite is the arugula pizza and ","useful":1,"cool":1},"OTPQqO9Azl1wdQEiueXhog":{"text":"Best pizza in New Orleans!  Absolutely love going here.  The mushroom pizza is fantastic, ","useful":0,"cool":0},"r-7_zvC1dZZFCiJxNkK7ug":{"text":"Have enjoyed a great dinner and lunch at Echo's. With a group, we were able to try multipl","useful":0,"cool":0},"wyJe6tQOg9d3teKuWzBtPA":{"text":"Amazing food! My husband and I had the shrimp, arugula pizza, and margarita pizza. All of ","useful":0,"cool":0},"uPEkWiBpsmn2DfD6SbSmjQ":{"text":"Had the Burrata Pizza and Caesar Salad.  The pizza was light, fresh, and flavorful.  Very ","useful":1,"cool":0},"iKN1g8uPJkVF2picOWXFAg":{"text":"We had been wanting to give this place a try because they have thin crust pizza, but were ","useful":0,"cool":0},"sAivLMVK7fF3cr3lLzsO8g":{"text":"Hands down best pizza I've ever had in this city. \nMaybe in the f***king world! \n\nAlso, th","useful":0,"cool":0},"iWPWYH1mMi_VclpZ6bW90w":{"text":"This is my new favorite Mid City spot, possibly favorite restaurant, in New Orleans right ","useful":1,"cool":0},"Ivsub5BrJBtWTmnJ30yrQQ":{"text":"About as good a pizza as you will get in New Orleans. John B needs to open his own restaur","useful":0,"cool":0},"3m3SPhmmt7LWiuAM__cxxA":{"text":"The atmosphere is great, pizza are awesome & the drinks on fantastic! Small cozy spot of b","useful":0,"cool":0},"gWYcM41XE653B4pB3fYAcA":{"text":"Oooooo!!!!!! Goodie ! Echos is infact hot&new. Our server Tom went above and beyond when i","useful":0,"cool":0},"Gh9U44DY8453IrXsgpvsrQ":{"text":"Echo's is the closest thing to real Italian pizza in New Orleans. They clearly use real mo","useful":0,"cool":0},"qzdSa5IfDVSkWxESVXVrUQ":{"text":"I came here just trying to satisfy a Mardi Gras hunger- you know the one- the one where yo","useful":0,"cool":0},"YJIAMFD7kBEay7hnCy08Wg":{"text":"Was very impressed with Echo. The restaurant layout, decor and service is phenomenal. My p","useful":2,"cool":2},"uU21dYdEj9JlZZQKEviaZQ":{"text":"Hated it! They've got a problem with overcooking things. The small pizza was scantily deco","useful":1,"cool":1},"JsbTtdN5laLhNbO0xUFyEA":{"text":"Amazing food and great atmosphere (especially the outdoor patio!) Instantly one of my new ","useful":0,"cool":0},"B6ye5Ql0tbLKH8vsQfjd_w":{"text":"For me, it's all about the crust. Echo has it. Pizza Delicious, Domenica and now Echo. Top","useful":0,"cool":0},"L4Hs75gmXyKqfo21fmR1XA":{"text":"Echo's Neopiltan Wood Fired Pizza is delicious! So glad to finally have a nice compliment/","useful":3,"cool":1},"fNnyjsxMfKTLmRhv8EO_sA":{"text":"Not sure how this place has great ratings; my pizza was subpar. The flavor of the pizza sa","useful":0,"cool":0},"HES4K-_Zg8fE3DXrz3PzLg":{"text":"Omg this pizza is AMAZING! So light, yet so filling and FRESH! Lately I'm on a wood fired ","useful":9,"cool":6},"sY77LMkkHW9Sy6j0VAthgg":{"text":"Arguably the best pizza in New Orleans!! Flavor was rich. Shrimp appetizer was delicious .","useful":0,"cool":0},"TuKhqqWBOu_pZfgI9P_nEQ":{"text":"This was my second time going to echo and it was still great! We decided on the anchovies ","useful":0,"cool":0},"kxFNfPx38Ubs_oUh06NJ5Q":{"text":"We had an amazing dinner here tonight. The staff were friendly and were able to seat our p","useful":0,"cool":0},"BpvO06dCBIy8MXF-j-Uc7w":{"text":"I came the first week they were open. Pizza was good. The chicken was underdone (the darkm","useful":1,"cool":0},"jaaRUtdh-2TOMDkemr9FaA":{"text":"Echo's had the best cocktail that I've ever had and the burrata pizza BLEW MY MIND. That b","useful":1,"cool":0},"LcMIxUd8f6Q7Yi8iIoywDQ":{"text":"The newest endeavor from the lovely peeps who have blessed us with both the Fat Falafel fo","useful":6,"cool":1},"4j4xZ7uXaiAU6uIg0aqkCg":{"text":"Enjoyed our first dinner at this new spot. Lovely space. Started withe the rice balls and ","useful":0,"cool":0},"Z7eW1gb-rVAy5HC-AYzkMg":{"text":"I love this place. Their pizzas are amazing! I especially like that they have vegetarian o","useful":0,"cool":0},"CShvKJYFOhb2DX_1e1HV3A":{"text":"The Pizza was RAW and the Service was HORRIBLE! \n\nWe ordered three pizzas and all of them ","useful":1,"cool":1},"hWIEeYKwrOYr6lD8zu4Bgw":{"text":"This place is true Neighborhood gem here in Mid City. I first went for the pizza and Zuppl","useful":0,"cool":0},"LHkT7WK66cBDzVE0oZOsCQ":{"text":"Amazing pizza, great service, and pleasant aesthetics! We split a few pizzas. Highly recom","useful":0,"cool":0},"rXGhemZnItInY-S9Vpph_A":{"text":"This place is a DEFINITE DONT!! Rude server/cashier lackluster food, worst pizza I've ever","useful":0,"cool":0},"ga87S_Z1aNDJTnFbTdVePQ":{"text":"Echo's is such an awesome addition to the neighborhood. Adorable ambiance, great service, ","useful":0,"cool":0},"zp7gQCoqfe5oZ_T-tjSPxg":{"text":"Great find!! Good wine list, had a light rose' to go with the appetizers. The Suppli and P","useful":0,"cool":0},"q2Gkbuqglx3yhaBxcI49vw":{"text":"I went it with EXTREMELY high expectations for one thing on the menu and that will be my d","useful":4,"cool":2},"g_aoCQZCqu5R1rEYZRHxXQ":{"text":"I read the reviews and thought I did my homework before trying this place. despite mostly ","useful":0,"cool":1},"y16Ft5bVBLBaQ7wxBSI0cA":{"text":"I died and went to brunch heaven on a beautiful nola February Sunday. \n\nAmazing menu, the ","useful":2,"cool":1},"M1Hm1u8d5B-C54gV03qz9g":{"text":"I hate to be so negative, but went to try out this new place in Mid City Echo's pizza.  I ","useful":3,"cool":1},"GLZTJ3czTXwsEMTlYw6QbQ":{"text":"One of the best pizzas I have ever had. Tasty, delicious and a crispy crust. The appetizer","useful":0,"cool":0},"CtSaVXHA7iz5TfcfSFUKBQ":{"text":"You gotta come here for brunch. Their bagels are some of the best bagels in town. This is ","useful":0,"cool":0},"JQe5rMd5Gprf-1pP-N8xOg":{"text":"My husband and I had brunch on a Sunday afternoon, although we went for the pizza. The ser","useful":5,"cool":2},"zwf9xvS16YcJF2b3RSBkUQ":{"text":"I was truly disappointed by the two pizzas I ordered here. The texture of both was of a so","useful":1,"cool":0},"StRFshH5mSYTLkBf2MO31Q":{"text":"I loved our meal at Echo's! It's a beautiful space, light and breezy. They have a nice pat","useful":3,"cool":1},"tX9a0lxjXBgvzGyN0PXRJw":{"text":"The staff was very friendly. It is a small quaint place. The pizza was good but nothing re","useful":1,"cool":0},"KFKDWIUOsipm34CQJELxjw":{"text":"Loved, absolutely loved their first restaurant.  And was excited when I saw them wandering","useful":2,"cool":0},"GIc7Clp1Zyz7plTlWYAq-A":{"text":"Loved everything the family would let me taste to include my own Echos breakfast that I co","useful":4,"cool":2},"EDIkk-aeKOlwiEELJoaJcA":{"text":"Terrible, apathetic, unfriendly service. Everything from figuring out who our waitress was","useful":1,"cool":0},"mE6EGRRS4xCkk1aI-hqt_A":{"text":"Beautiful space, great ambience, and great service. Food and cocktails were amazing. Went ","useful":0,"cool":0},"qNoiNdwiW7W9-RSln5QlYQ":{"text":"Superb service, delicious cocktails and pizza. It was very close by to the India House hos","useful":1,"cool":0},"SXZTxAftoJ9ffAlTXbyNyA":{"text":"Great eatery that recently opened in a neighborhood near my place of employment. \n\nThe dec","useful":15,"cool":12},"WW79tdCisUhqElVJ3HNA2A":{"text":"Went here for a mid week reprieve as this place has been on my list for awhile. It was tha","useful":4,"cool":2},"lkSz0Cz-Eo4ic7ogC_RUfw":{"text":"Newish restaurant from the same people who brought us 1000 Figs. \n\nBeautiful space. Feels ","useful":1,"cool":0},"fdMVQ4xym_VFafiSEkme4A":{"text":"I've ordered Echo's twice through Waitr and have enjoyed the simplistic real Italian style","useful":5,"cool":5},"44X9MjFO_OPhwMbHeyIWgg":{"text":"We were really impressed!  Italian-style pie; excellent thin crust. The mixed green salad ","useful":7,"cool":1},"a6P2ggpPo4ecT0xufPGVRA":{"text":"I had high expectations going in. I loved the staff- efficient, nice, attentive. I ordered","useful":0,"cool":0},"lCYTLmQgAWehI9cNrNnBGw":{"text":"The pizza isn't bad, but the way they nickel and dime you for everything is very off-putti","useful":4,"cool":2},"WhHdCsTaR6AY_KD5ABzj_A":{"text":"I have been dying to try echos for over a year, and I was so glad they did not disappoint.","useful":1,"cool":1},"VkkTG6K__6XrPcHyCdeQtg":{"text":"I'm not joking when I say this is some of the best pizza I have ever had. The crust is per","useful":0,"cool":0},"xxsI-eaUGocbAsiZ8kJmcA":{"text":"Three words to describe this place all together from decor to food: simple, clean, and lig","useful":4,"cool":2},"kOWJw2ECo8lmqmnGMlBkNw":{"text":"Echo's is such a neighborhood gem.  I just learned that they are serving breakfast/brunch.","useful":0,"cool":0},"JYPuHzPvGChx0yGkMZWwpw":{"text":"The pizza was amazing here! The price point was also great. The vibe was cool and the staf","useful":1,"cool":0},"daIgtL8XtEFSOtikHalL7g":{"text":"Delicious brunch menu with great value! This is HALF of my Gravlax order ($10 total!!!). T","useful":0,"cool":0},"D356LuXEFGRlv0v58_KOwg":{"text":"Honestly some of the best fresh pizza in Nola. And I've got roots in NY and Italy! Crust i","useful":1,"cool":1},"5ByvEEfLVCOFCqhjmhCutg":{"text":"The heavens opened up and dropped this gem on us. I'm crying cause I used to live around t","useful":0,"cool":1},"6i3HG96FQkLmiaCRDBPKYA":{"text":"Pizza makes the world go round. Well, maybe not...but close. You would think good pizza is","useful":1,"cool":0},"t_LdZ00M31PIGKN0fcew0w":{"text":"Soooooooo goooood!!! Didn't expect the shrimp appetizer to be as good as it was! Some of t","useful":0,"cool":0},"ccPoUXOt_33AyCIYKfubQw":{"text":"Excellent wood Fire pizza.   The crust is scrumptious.  All ingredients are fresh.  We ord","useful":0,"cool":0},"4AvcgV1fG4qpeurpSbL9hg":{"text":"Echos had bagels. Thats a big deal. And they are really good. Had the gravelox dish for br","useful":1,"cool":1},"QE6HsgX3FK-vG2PvC_M91g":{"text":"The pizza was ok. We had mushroom and pepperoni. The cooks were friendly, however, our wai","useful":0,"cool":0},"Qq1r0_ehTHtz1WemF_eeQw":{"text":"The arugula pizza is really fresh and tasty. The ambience is pleasant; classy yet casual, ","useful":0,"cool":0},"4IjENKZw3tW1uQzdxx0zjg":{"text":"Echo's serves my favorite style of pizza, Neapolitan style in a wood burning oven.  I alwa","useful":3,"cool":1},"_JvgfEUfXmbnH_nEzrryzA":{"text":"Big picture, I liked it, but there were definitely some smaller concerns.\n\nThe atmosphere ","useful":5,"cool":1},"52VHEOvqeP3umuD7Yc_sRg":{"text":"I love this place. It's like 3 blocks from my house and I seem to be here all the time.  I","useful":1,"cool":0},"vsKWomeLCdio_rnpzQgEJg":{"text":"After ordering delivery from Echo's twice, it was time to pop in for a visit. I'm so very ","useful":2,"cool":1},"ymM0Lcw5i7WdyISw96qYJQ":{"text":"Since Echo's is owned by the same people as 1000 figs (one of my obsessions) I have been w","useful":7,"cool":3},"hhqoSvbW1s_oU7oNhvJoOg":{"text":"Presentation of the Place: Tucked away on a corner of Banks the outside reminds you of cof","useful":2,"cool":0},"a6uWQnCeyKutQ4XTPtKCRQ":{"text":"SO GOOD. My fiance and I take pizza very seriously, and y'all, this place is doing it righ","useful":1,"cool":1},"IDRtvqvZBrdhSI9pQzmOMQ":{"text":"I could eat that tomato crustini all day every day! Seriously though. Ok, let's start at t","useful":26,"cool":22}}