{"STec-g3L4Trmbfzz0p5S8A":{"text":"When I go to Nawlins' I make time to go here and Marie Laveau's. When you want the real de","useful":1,"cool":1},"Z4Uu4euWXLZt_9v_xLVtAA":{"text":"Dare to put a Hex on your Ex?\n\nLooking for some Voodoo dolls?\n\nSpells and talismans?\n\nThis","useful":2,"cool":3},"ArpjajsLHEIk2k9yYLSRUw":{"text":"Going on a ghost walking tour and had to meet at this place. We went in to inquire where t","useful":0,"cool":0},"2ir1jnLAScpLkxhbWVOwQQ":{"text":"Extensive collection of various voodoo-related items -- from touristy postcards to legitim","useful":1,"cool":0},"3YHTRNHwglUGd9fRWcwC8w":{"text":"I remembered this place as super authentic Capital S.  It just had a less authentic feel t","useful":1,"cool":0},"MUCn3pRxyhsFUp79mPXv4w":{"text":"While on a girls trip to Nola, we wandered in this store so one of the girls in our party ","useful":1,"cool":0},"5N8ORmnVX5MILakuZkMtwg":{"text":"Pretty cool. Came here and had a tarot/palm reading with Charlie and he hit on specific th","useful":0,"cool":0},"de8VGXerlK-fW5PZ3cUsgg":{"text":"LOVE this company! This is the 2nd time I've used them to go thru a cemetery tour and was ","useful":1,"cool":2},"x6dzZqeFRZof0tlzT4cUbw":{"text":"My husband and I did the ghost tour there about two years ago and had a great time. Our to","useful":0,"cool":0},"swqw6_96sCCXTqs-F8_uug":{"text":"Cool shop with lots of awesome voodoo and mystical goodies! They don't allow pictures due ","useful":2,"cool":0},"nZSpZzJn81ZrGE0WGKakrw":{"text":"Interesting store.  Also owns another store Marie Laveus house of voodoo.  Average prices.","useful":2,"cool":2},"JFbsr_Jp0eNZeVWfVlOoeg":{"text":"Being a tourist in a touristy spot trying to pass off as authentic is a bewitching experie","useful":1,"cool":0},"h7v313KM_JcSojFMMLc1LQ":{"text":"This place seemed super cool but they lady who was working the counter was seriously the r","useful":2,"cool":0},"by_1_0eYBnmpgsEisbtAXA":{"text":"4almost 5 for palm readings.   I'm not into this at all but my whole fam won't shut up abo","useful":1,"cool":0},"T5Oy-Vg5gIvSqKivfOqwFw":{"text":"If a staff is lacking, check the management. In this case, you will find the most hateful,","useful":1,"cool":0},"aMZn62IpZA-IsZy_N0JZzw":{"text":"I stopped to take a photo from the other side of the street prior to entering the store.  ","useful":7,"cool":1},"qXfgJN21AOazPSLViGQElw":{"text":"Rude staff, The long haired guy was yelling immediately at anyone as they came in not to t","useful":2,"cool":0},"8SKURFauBpYpW5o3UpbIbQ":{"text":"I love the caldaveras that i bought here, and the other trinkets i brought home for friend","useful":1,"cool":1},"amN0T_tZ_rtWHfTDODSXzg":{"text":"I bought a 2 potions here. I used a love potion, that one of the staff recommended, that n","useful":4,"cool":1},"ve7KwuzlIlkCu0mvTDt96w":{"text":"This shop seems to have something for everyone that is into or has an interest in the Spir","useful":0,"cool":0},"SxPADNgLBVZE2WiLO8py0A":{"text":"The Voodoo tour was fine.  I learned the basics from this.  We were taken to a couple of s","useful":0,"cool":0},"MVF13WJNRcnY_sepkYZD8g":{"text":"Tonight i went on the 5 in 1 tour. Our tour guide Drew told us all about murders, folklore","useful":0,"cool":0},"sZU-0KVkSbGO1EBTTHjH-Q":{"text":"Preferred this place over Marie Laveaus even though they are owned by the same people. Thi","useful":0,"cool":0},"RT9ofJcfyZXBwyN0QosiCA":{"text":"I LOVE this place. It's a lot less crowded than Marie Laveaux's (sp?) on Bourbon and has a","useful":1,"cool":1},"6VbGjHRMoZe86QQxu3fz4A":{"text":"Cool place to check out if your shopping in the French Quarter. I didn't buy anything but ","useful":0,"cool":0},"4-WHNT8qersHyxHUe4SzPQ":{"text":"Some cool stuff.\nSome kinda kitchy mass produced stuff.\nSome stuff in the middle.\n\nNeatly ","useful":0,"cool":2},"ivffMan8AYkzVYVtTjAWBA":{"text":"Great place to feel all \"voodooey\"... bought some trinkets, candles and an awesome wooden ","useful":1,"cool":1},"GOjPPMk5UkJeIE6hJv9hSw":{"text":"Voodoo, Voodun, Hoodoo, Juju, Jinx, The Evil Eye; however one says it, you know it's black","useful":8,"cool":5},"mT1fkZ5R-m5w9-1t-3JyNQ":{"text":"DO NOT give this shop any deposit for a tour!  We had 2 buy one get one free coupons for t","useful":3,"cool":1},"TKpmdssBw2s4fNPP9zrDGw":{"text":"Made me feel very stupid when I asked a question. I know tourists go there, but I wasn't i","useful":0,"cool":0},"Lrb0RxDPTlv7f50fFm5lnw":{"text":"Open late, lots of gifts and goodies to bring home for your wacky friends, family or yours","useful":0,"cool":0},"BN67vUVtXarGghuR5vLHFQ":{"text":"Fabulous tour! Our guide was excellent. The tour includes a lot of history about the Frenc","useful":0,"cool":0},"m_9ayT2Mdd-K3aKBG43fWw":{"text":"Avoid. The shop owner followed me as if I was going to steal something. Not a good look. U","useful":2,"cool":0},"1_bEVX419WScEdLikNgHrw":{"text":"Didn't look at the shop to much so I can't comment on the voodoo, but the ghost tour was g","useful":0,"cool":0},"bcUgLCo6zvny5PMA-w1Hvw":{"text":"I was here a couple about a week ago on a Tuesday afternoon. We had a couple of kids with ","useful":0,"cool":0},"09rSauL-zduMK3Co6kvXKw":{"text":"Always so nice and helpful! Prices are great! At must visit on every NOLA trip!! Located i","useful":0,"cool":0},"_ksqdCDb5224kcFQvXzAPg":{"text":"While spending the day in New Orleans we decided to stop in at this Voodoo shop. When we w","useful":3,"cool":0},"HTPxX2hpz3HAKfdJ7TmsJQ":{"text":"Voodoo seems to be one of the things that jump to mind when New Orleans is mentioned. With","useful":4,"cool":3},"Tr77aFzXfLW2wnwNVM1tEA":{"text":"Great tour with Lisa tonight! Wish I were in town for a weekend tour, which she said is ev","useful":0,"cool":0},"UlDtxJrfYD3t9sinDZHDhw":{"text":"This place seemed pretty cool but the bearded guy inside started yelling obscenities at my","useful":4,"cool":0},"p4KMkZzMj_n1uqdKH0HP7A":{"text":"Went to NOLO the end of July for 5 days.  DId the ghost tour and cemetery tours with Haunt","useful":7,"cool":0},"uQ9kv_ob6w072Pr1h28kRQ":{"text":"This place has a great selection of things, whether you're looking to get some $3 trinkets","useful":0,"cool":0},"hSWim7mCU8pFGWYK1vgDTw":{"text":"If your in the French Quarter stop in! I've been twice and had a weird experience. Just be","useful":0,"cool":0},"kqBFGB7oKgqsVrNIsH6qrQ":{"text":"A fun little stop that doesn't seem to take itself too seriously. We received a recommenda","useful":0,"cool":0},"Z0rStPbbm-R3CN7pIRfUkw":{"text":"Change the girl at the counter and maybe you'll sell a lot more.. constructive criticism. ","useful":1,"cool":0},"IsiQZdL0cH0MxXk5H-hfEQ":{"text":"This is a bigger shop than that of Marie Laveau house. The guy at the counter at least tri","useful":4,"cool":2},"7d5iveGA59zWvcNqYsS1lA":{"text":"I don't know why the people here keep complaining about this place being a \"tourist trap.\"","useful":5,"cool":2},"fyjHzgbYY8sJFkpKjdTl1w":{"text":"I enjoyed my tour with Trevor. He had lots of insider knowledge. Very comfortable walking ","useful":1,"cool":2},"RLh6FqRBpEBTSaWHC2qg_g":{"text":"Great experience. I read all of the other reviews about the service being rude but I think","useful":0,"cool":0},"px9_T_-MgmlPjVm9QloakA":{"text":"There are quite a few voodoo places in New Orleans and I wanted to go in every single one ","useful":2,"cool":1},"BiQ_kQSm9Dzls8N-Ocb4XQ":{"text":"I bought a voodoo doll here. It's a cool place to check out. I really enjoyed walking arou","useful":0,"cool":0},"-eBo864gmNugPFC7SzVNXA":{"text":"Stopped here for the gathering of our ghost tour of New Orleans.   It's a very cool shop w","useful":0,"cool":0},"dcgJ6m0KDR0wyntOoovq_A":{"text":"I took the cemetery tour and was very pleased and enjoyed the tour. It was just my cousin,","useful":0,"cool":0},"QMuHWl6IZ9CI0M5PBsdjEA":{"text":"Meeting place for several ghost tours, which I'm sure is no coincidence.  This is an inter","useful":0,"cool":0},"WjCJ1vg5tKZL2TVX5HeMnQ":{"text":"Pretty much an all-comprehensive authentic voodoo shop in the French Quarter - far better ","useful":0,"cool":0},"eK2mpve0l-7YZiCAAfRF1A":{"text":"New Orleans Birthday Trip = Fauxdoo in the French Quarter\n\nAfter some appropriate imbibing","useful":4,"cool":2},"v3Rm8nCzRBM-QQB8hi83Dw":{"text":"Just like the parent shop, Marie Laveau House of Voodoo, this is another touristy stop in ","useful":0,"cool":0},"LRj3D5MBKhcEn6PXyFfoLw":{"text":"This was the meeting spot for our haunted history tour.  I showed up a little early so I f","useful":1,"cool":1},"LY_Fib2Kd7Iw3vAZ56yf5Q":{"text":"Shop looks cool but the staff was incredibly rude. My friend was checking out one of the \"","useful":0,"cool":0},"RzBR3kxVZjcVb18RnvNTgg":{"text":"Really interesting until you ask a question....bad attitudes from all three people we  enc","useful":1,"cool":1},"YegRT1kd1PmK2S_VhYU5Kw":{"text":"Another authentic New Orleand expereience in the French Quarter.  No photography or video.","useful":1,"cool":0},"14O4nKP3mSEWUGgYr6G1JA":{"text":"Made an appointment to get a reading done, the lady behind the counter said to come back 1","useful":0,"cool":0},"yUKZBKNfKNSD4HLZ68UFVw":{"text":"We decided to do the touristy thing on Halloween and take the ghost tour.  While we were w","useful":2,"cool":0},"RSWZ5zISl8ahwjqdabnAMg":{"text":"A little confused as to why Yelp has this listed under Marie Laveau's Voodoo's address on ","useful":0,"cool":1},"KfSY5DL3e_uT0bKlgggRtw":{"text":"Visited: 8/2017\n\nSooo...this is one of the best stocked voodoo/magical shops I have ever v","useful":1,"cool":0},"hS24BxlHTMlrsmQzs4uQ0g":{"text":"Of course it's a tourist trap.  I've had my tarot readings done somewhere else and yes thi","useful":1,"cool":0},"ap4xc41S9FIAhiCO45RYqg":{"text":"I stopped in New Orleans for less than a day and dropped by this lovely shop. I didnt have","useful":0,"cool":0},"ZN0eK0knfv_cH9cRYWd4JA":{"text":"First of all, this place place is named for \"Rev Zombie,\" and people are saying it's touri","useful":1,"cool":0},"Jt6m_l73dGJNfOlKQeGMCA":{"text":"Since Halloween is just around the corner thought I would review a few of my favorite Hall","useful":2,"cool":2},"Qyfo0fH6ZXCdEXQKjf89Ug":{"text":"Of course when I walked into this crazy shop I couldn't help but hum... \nWhat baby? baby w","useful":6,"cool":4},"JzjghVRVqjLs_FeNvwm-NA":{"text":"I think it was at Reverend Zombie's that I learned that taking a photo of an altar was ste","useful":3,"cool":1},"HVvTRB21Fy2lZk8SgXjl_w":{"text":"Spooky? not really. A bit dingy. More so. It is a tourist trap, with loads of warning sign","useful":2,"cool":0},"e3QKWgJdvQBGRjQxA3xkbQ":{"text":"Yep.. This is a tourist trap. The person at the counter was quite rude when we asked him a","useful":2,"cool":0},"-O0-J1VgcSQdRmStMU9fwQ":{"text":"TL/DR:  If I could give less than one start I totally would.  Mildly interesting items... ","useful":5,"cool":0},"UJKZT9avtFf1u3br7-dAmg":{"text":"So I'm a nice Catholic girl, right?  I tend to Just Say No to voodoo.\n\nHowever I couldn't ","useful":5,"cool":9},"QKjpiOB7DDwjcn4oyp3ySg":{"text":"My Dad has specifically asked me get him some Gris-Gris while in New Orleans as he was rea","useful":2,"cool":1},"LBAsfTES_pjyLJCp7f_gow":{"text":"Going to New Orleans for the first time, was very excited to go into my first \"voodoo\" sto","useful":1,"cool":0},"n4PzFTMO8qpcsh3rduOd6Q":{"text":"Average voodoo tourist shop. Some interesting items for the people wanting to buy souvenir","useful":1,"cool":0},"une3MfxqpbdusbPn7djebg":{"text":"I stayed in New Orleans for the week of Halloween, so I made sure to stop by all the cemet","useful":1,"cool":0},"sYpfivNI3oEJzPYht-Eogg":{"text":"This is the meeting place for Haunted History tours so we did some shopping before the tou","useful":1,"cool":1},"No2vwe7sCIvl8F7VIa5Eig":{"text":"I always come here to get my supplies, most the time the staff is snippy and short with pe","useful":0,"cool":0},"mKcEFCLRcQDao-b-2nSa5A":{"text":"Did not really believe in readings but wanted to try it out. Saw Rose who was amazingly ac","useful":0,"cool":0},"EZ7DeZEKjiKl2k8VbBWkvg":{"text":"I love this place!  Rev Zombie is this eccentric soul who is really personable and funny. ","useful":1,"cool":1},"hyZiftsetOWNw8azU9kbnQ":{"text":"This is a very touristy, very well-stocked voodoo shop that for some reason does not allow","useful":0,"cool":0},"wU-PuaV-C6HmAGM6AhO5Xw":{"text":"The tour guides are friendly, informative, and fantastic public speakers/story tellers! We","useful":1,"cool":1},"xdgTHQbGj_UNLe5xJpHQSA":{"text":"I'll be honest. The only reason why we walked in was because we just walked out of Pat O'B","useful":2,"cool":2},"rD1-kltIigZHpfdMatpvFQ":{"text":"Must avoid. Most disrespectful shop I've been into in New Orleans. Staff was judgmental an","useful":4,"cool":0},"egkcH4e5OJKK4P0xSaVXcg":{"text":"4 girlfriends and I made the jaunt to NOLA for a getaway weekend and decided that we absol","useful":6,"cool":7},"E-I11L0EyeSeiVQ2sP_TMQ":{"text":"Pit hole. Tourist trap.  \"Authentic Voodoo Items\" are all actually made in china or in cou","useful":0,"cool":0},"mqSSxtUz1Y-nnkVYYL3CLQ":{"text":"Upon walking in, this shop had tons of 'creepy'  knick knacks, it took me awhile to decide","useful":9,"cool":1},"dWxR5zHu4AYxtxiKUYPhyA":{"text":"Fun little shop to poke around in until you find something you want to buy and you have to","useful":2,"cool":2},"Qm17cZLeKxFP5znCFSA9Dg":{"text":"Go see Miles for a tarot or palm reading! The boutique is great too and the vibe is really","useful":1,"cool":1},"qcwV6ShYwSad9ELx1XzYGg":{"text":"Had a reading done by Sybil. It's obvious she was cold calling and also fishing for inform","useful":0,"cool":0},"1ArVvNNqJFiiia7pncIZpg":{"text":"The long brown haired, clean shaven male employee uses his job at this establishment to pi","useful":1,"cool":0},"CpxU8UckDriCoXL8CGMXIA":{"text":"Incredibly condescending attitude of workers. I asked if there was a credit card minimum (","useful":1,"cool":0},"TEB5mFjZBpfdPoumXziU0g":{"text":"Staff won't even acknowledge your existence when you walk in unless you touch something th","useful":1,"cool":0},"xGgtzau7WgDITX8XXq2r-Q":{"text":"I had never had one before, but I figured, \"hey I'm in New Orleans for Mardi Gras, why not","useful":2,"cool":1},"hHbfV5zNPhlDq6GyIOvoMQ":{"text":"This place has a lot more useful stuff than you might expect from a touristy voodoo shop i","useful":0,"cool":1},"KoN6tlk2CRPGXGLIPyKjqw":{"text":"This shop looks so awesome, but WARNING their attitudes are terrible.  You would think the","useful":3,"cool":1},"noiJm6Voxn8Lu1vqQZ5ooQ":{"text":"Great spot to get candles, herbs and incense. The cashier was very helpful and informative","useful":0,"cool":0},"QzxRnf4tMWzAODhGn3KWVQ":{"text":"This is owned by the same people who own Marie Laveau's.  You get the same experience at b","useful":3,"cool":2},"e7Pck_BFLXZY1jUhzqQF4g":{"text":"I want to say thank you to the most ignorant 2 female employees that this place has workin","useful":2,"cool":0},"AsQmAaZSd9xVEZSuIUOFfw":{"text":"Stopped by this place as one of our many tourist-y stops while in New Orleans. Like the ra","useful":0,"cool":0},"gcdCrLAr0UmKjoodPc8_Fw":{"text":"It wasn't a memorable experience and the staff here seemed on edge. There were interesting","useful":0,"cool":0},"OuDOYhXAecsT7ZAab0H9ZQ":{"text":"I have gone to this store for the last three years when in New Orleans for business.  I we","useful":2,"cool":0},"csO6IlOwf87WGoicPuYYxA":{"text":"This is a really fun \"only in New Orleans\" shop full of all sorts of Voodoo inspired trink","useful":3,"cool":3},"A5vsnSCAuPldXFcEygxgJA":{"text":"Do not go here.  The staff will make you feel bad and it's really not even worth it.  They","useful":4,"cool":0},"DAJfCmsGCxSHGOw2PQmwaw":{"text":"Oh gosh where do I begin? Let's just say this was THE WORST experience I have ever had in ","useful":1,"cool":0},"L8O3u87KHhPb4qoUbhA-4g":{"text":"Big nope in my book. It's right off Jackson Square so it's always the first voodoo shop yo","useful":7,"cool":1},"cIpQByuZE7pQWtMmTVkJHA":{"text":"The reviews aren't lying about the rude employees. This one woman was chewed out for takin","useful":4,"cool":1},"l-Ce1y56IfpCXovsEUdm_g":{"text":"This was my first time in a voodoo shop, so I was in awe over how interesting it all was. ","useful":0,"cool":0},"7a3BuiVizJVh7LvF6dLZKA":{"text":"I didn't realize that the Chinese had such a large Voo Doo Culture.  Almost all of the ite","useful":2,"cool":2},"WfyjEwfXb8zZwFukBjN7Xw":{"text":"Reverend Zombie's House of Voodoo is a cool shop to stop into if you're exploring the Fren","useful":4,"cool":3},"43WULE0xZY-4DdVDAY4XqQ":{"text":"We went to many palm readers in new orleans. This was the only one we were unhappy with. W","useful":4,"cool":0},"5Ga_9VHdMs7VbCl3kRCUjw":{"text":"Just a drunken fall off Bourbon Street, and open pretty late, this voodoo store is enterta","useful":2,"cool":2},"ILE6UJdg2lVurxmOg889-A":{"text":"Nichole was wonderfully proactive addressing the mistreatment we received at another store","useful":0,"cool":0},"skKnAJM-wq_MOkvrJ9oV9Q":{"text":"The bald \"trendy\" cashier is rude. Not my fault you don't like your job in a tourist area ","useful":1,"cool":0},"U4WD26fdDMME3d1N-Gq_ag":{"text":"Rude staff!! I didn't even get all the way into the store before I was barked at by the la","useful":0,"cool":0},"s7wF5G4irN_pn4GwK4t9ZQ":{"text":"I was here a few years ago and loved it, but quite frankly, when I went in today it was wa","useful":5,"cool":5},"ejW9xWd3Nf3pXP757VfeeQ":{"text":"Not another tourist trap! The shop felt very authentic. I poked around for awhile and boug","useful":0,"cool":0},"SRXLeM7pC4aglj2ans7ZlQ":{"text":"Just was there. Like 5 minutes ago. I NEVER wrote Yelp reviews because I'm a small busines","useful":5,"cool":0},"sDkEeQCDqC5VJpcDn74YqQ":{"text":"Loved this shop. I wanted to visit a voodoo shop during my trip and I have to admmit I wen","useful":2,"cool":0},"k_z4v4JDAQ9X3eaMqBJ3lw":{"text":"Everything was overpriced. Reading was a complete scam for the price they want. The lady k","useful":2,"cool":0},"R3TwADnvqvMApSguceHUFw":{"text":"This is a review for the readings given at Rev Zombie's....\n\nDO NOT WASTE YOUR MONEY.  I h","useful":1,"cool":0},"blJw04saXuDPPqZRlXJ5PQ":{"text":"Weird store. I almost felt bewitched with all the voodoo stuff. All the voodoo dolls, stat","useful":0,"cool":1},"H1-1HjXOIatBxh--E_odMA":{"text":"This place has the worst customer service and the lady behind the counter is a true witch!","useful":1,"cool":0},"UBCGfk4k_yKXynX_g8QU4A":{"text":"The first thing I noticed when I walked in was the no picture policy. This struck me as od","useful":2,"cool":0},"DtkSWBHP1JCP7IZLKILrdQ":{"text":"My mother and I were determined to have our palms and cards read to us while we were in Ne","useful":1,"cool":0},"dsLYJnNBQZ4ZDUSkzGCRWQ":{"text":"Stopped in just to check out a Voodoo shop that also sells premium cigars...carry a nice s","useful":3,"cool":3},"VzL9_seCvQyaDbv07HRwog":{"text":"There's definitely stuff in here that is super cool. That being said, make sure you bring ","useful":3,"cool":2},"R3b28jFYj1CXS8Y0wgs0Ow":{"text":"We were going to buy something but the girl working was so rude I couldn't get out faster.","useful":0,"cool":0},"HpOx_5r7s1-pnAmSyuBzaQ":{"text":"Stopped in this place to buy some cigars the experience was crazy and the lady behind the ","useful":2,"cool":2},"XEao9aNMc5FFtTQdwjbRFw":{"text":"Upon walking into Rev Zombies store we were treated rudely by both of the young employees ","useful":3,"cool":0},"LRVB_AdmUkEsqVb6AnKdiQ":{"text":"Nothing in particular strikes me to give the place 3 Stars or better. It is the same as it","useful":2,"cool":2},"yHqOlXkjex1Cwox-IM6dsQ":{"text":"They sell some cool imports - I recognized a lot of art and masks I saw in Guatemala - and","useful":1,"cool":1},"BWpwdUQ0r8R-rN2QaPqw-g":{"text":"5 star rating because I love these cheesy Hocus Pocus places. It's a tourist trap of NOLA ","useful":3,"cool":1},"JO5bAsRh1pgxuTunbVST3g":{"text":"This was my second time coming to this shop. 3 years ago didn't have a problem. This time ","useful":0,"cool":0},"0wK_oIJCH-97GDhlQdaoiA":{"text":"Meh.\n\nWildly unimpressed with Reverend Zombie's to be honest. We basically ran into this p","useful":20,"cool":16},"RGfLDeDjRViKXPOYMao_mA":{"text":"Really liked this store- it's owned by the people who created Marie Laveau's voodoo shop a","useful":8,"cool":3},"NOop66oO1_vlQ_NPoROaDA":{"text":"Very rude. Yelled at me for taking a picture or a t-shirt. There's plenty more voodoo shop","useful":0,"cool":0},"5Ubu58C9p2F-dnjozW2SQA":{"text":"Do not go to this location. They have other locations near by! I gave a star because you c","useful":1,"cool":0},"jAsPM7iHN-SJgocY7xi4gA":{"text":"I cannot recommend this company enough for tours - I did the cemetery tour of NOLA and 5 i","useful":0,"cool":1},"f4pqXqd6kpTCDPbKLSa1UA":{"text":"This was horrible!!! Me and my friend arrived here and made an appointment just after chec","useful":5,"cool":0},"nRj1-buQz1Qga9_MRl_Chw":{"text":"Make sure you lace up your walking shoes for this amazing tour of the haunted places and b","useful":0,"cool":0},"keibIQN7iiGu8Q6UocWrbA":{"text":"Can't touch anything. Can't take photos. Can't read their books where they have a bookshel","useful":5,"cool":0}}