{"65xHIizA29gpDlTE-Sz4kg":{"text":"I've eaten here for many years and it's one of the better Chinese options Uptown.  Before ","useful":3,"cool":1},"AGgxEnZ_TeD7IQeG0vs_aA":{"text":"We eat here at least 3-4 times a month, whether it's delivery, dine-in or takeout. I try n","useful":0,"cool":0},"6rMLYMgknrCfouvF4ilypA":{"text":"China orchid had some good things and then some that were just okay/not great. I have been","useful":3,"cool":1},"Vn1XBQf471V7YU_wOj0rdg":{"text":"Excellent Chinese food. General tso chicken is so good and crab Rangoons are addictive.","useful":0,"cool":0},"ZA0TcATliZ1T0Icbfq4lnQ":{"text":"I thought it would be funny if I wrote this review now because I'm currently sitting at a ","useful":2,"cool":0},"cLfjfqFYK1NboAIMutF-cQ":{"text":"The food is good here and consistent in flavor/taste. Favorites so far on the menu include","useful":0,"cool":0},"lfpTHBWe8NeYc6n3Rvts8w":{"text":"Me and my girlfriend order take out from her all the time and have never been disappointed","useful":0,"cool":0},"E8rLE4ouLVgvRc7DnMZ7JQ":{"text":"What a disappointment !!! I was craving Chinese food & since ChinaOrchard is nearby I stop","useful":0,"cool":0},"nb9GWqDpNtJnL-EwZvShHQ":{"text":"One of the places that it's been on my radar for a while and I finally went. We went 30 mi","useful":1,"cool":1},"la2EvXRh4DavR6M3TqWSSw":{"text":"Went for lunch the other day and I've been there before for takeout. But based on this exp","useful":1,"cool":0},"fqaEap54neVuo6rIrwRnQA":{"text":"I love this place so much.  There are depressingly few places to get decent Chinese food U","useful":1,"cool":0},"k_OHZ50gUxY7Fkt6TqsQ0Q":{"text":"I have dined there on several occasions and it was pretty good.  Last time I went as a gro","useful":1,"cool":0},"mUwR1EPhfZsAdzGltbmYNg":{"text":"Used their online service and received no delivery after an hour.  Called twice and woman ","useful":3,"cool":0},"D0fMJysvn_7PoVWhVZFagQ":{"text":"Do NOT get the Pad Thai. I repeat, no Pad Thai! I should have known that, one does not ord","useful":0,"cool":0},"SyYc1H9M9c-1kfFiIB4Gqw":{"text":"Maybe it was my fault for ordering pad Thai from a Chinese place, but it was bad. I asked ","useful":1,"cool":0},"bSKOuTii3tQiKqi2RFAmdg":{"text":"I had the shrimp and broccoli. It came with shrimp fried rice & an egg roll. The food is w","useful":0,"cool":0},"QOnv4zRqQdvBHNzr-6iKvg":{"text":"This is a great Chinese place if you are in the area and are in the mood for some good Chi","useful":0,"cool":0},"8VNvy0wpTDgXBMYh5b5Ajg":{"text":"Stopped in here for lunch the other day. The service was great and the restaurant was actu","useful":0,"cool":0},"A-qiydC_ogqp-GJ5CfwuUQ":{"text":"The China Orchid has improved since after Katrina, and the place looks nicer inside. The f","useful":0,"cool":0},"oV19FLNaSI5zkjXsuyTMXA":{"text":"The food is boring, greasy. If thats what your looking for (and some times it is...) then ","useful":0,"cool":0},"WnwIZRL-kKuR0blGCyFKKg":{"text":"Dinner was fantastic.  My group had the appetizer tray(s), Mandarin Chicken and Softshell ","useful":0,"cool":0},"kjZwZe3BAcwaSlDQyw7Isg":{"text":"As a NYer, I ate here pretty regularly during my 3 years of law school living in Uptown. N","useful":1,"cool":1},"MNX9dyJ0_vkqlezAbKgR0w":{"text":"I did not expect to like this place as much as I did. I don't know if they remodeled or wh","useful":1,"cool":0},"hfRT0taGb4WjiXwyAoHF2Q":{"text":"Do NOT order online. Recently, we went through their website interface and placed our orde","useful":1,"cool":0},"PbpaQK3E-mYzug44jOq_Ug":{"text":"This is a great Chinese place if you are in the area and are in the mood for some good Chi","useful":0,"cool":0},"cc_OZJTHnb81tdviGXl7GA":{"text":"So I was STARVING and I was in the neighborhood and thought, when was the last time I ate ","useful":3,"cool":1},"jz3-cksNdK5Pz-jVV_EOUw":{"text":"Besides the authentic Chinese food my Chinese friends/families have made for me, Chinese f","useful":3,"cool":0},"yJlaufffBAuNGkiDlRSbcA":{"text":"Stopped in for a quick lunch break and had a delicious meal. Ordered the sesame chicken wi","useful":0,"cool":0},"wpug4iR-acgJ8RfqoRqgvw":{"text":"As an authentic Chinese，I have to say that this restaurant is just OK. Maybe because the o","useful":1,"cool":0},"TvdJ48AA-TqzWK-vNFB9Aw":{"text":"I love china orchid because all of their ingredients seem very fresh. I have tried a lot o","useful":0,"cool":1},"eZ_IfFBU79Jww6wESdBLMQ":{"text":"Our go to Chinese take out place.  The delivery is quick and the food is hot and fresh.","useful":0,"cool":0},"9MRJCYqHdmBzcjh2JnIAjg":{"text":"I used to go here a lot because it was so affordable. However, the last time I went I orde","useful":0,"cool":0},"PeyXmbMaodcIfcmThp3Daw":{"text":"The restaurant is within walking distance of my house, and offers everything that you woul","useful":8,"cool":2},"0rfhIC-uy69UORkzhqNcEA":{"text":"This place is delish! I love the crispy shrimp and general joe shrimp.  The eggrolls are a","useful":0,"cool":0},"4rcsyKC65NG2oQrvnZMxHA":{"text":"Ate there for the first time last night with some friends. The smell is intoxicating when ","useful":0,"cool":0},"dLz5zcMkd2aJsYIBLnKArA":{"text":"Great food at reasonable prices. The customer service is good, too. The same lady waits on","useful":0,"cool":0},"kWvaEoeMKlGEvg6YoxF4kg":{"text":"I lived in New Orleans in the 1980s when I was a student at Tulane.  This April (2009), I ","useful":1,"cool":0},"JOmshcdmFwCWmncbn9JTsQ":{"text":"Best Chinese food I've found since moving to New Orleans from CA.","useful":0,"cool":0},"d4J9NuDQyXJrY2oa6QsBVw":{"text":"The fried rice is pretty good. I use to get the sweet and sour chicken, but the last 2 tim","useful":1,"cool":0},"2UNkzNNDyRQrW-3K87x03g":{"text":"Horrible! I ordered delivery and waited 1.5 hours. I called 3 times over 45 minutes and th","useful":1,"cool":0},"tMJL4OqEhivpZ5Z3EGp82Q":{"text":"Good food, reasonable prices, easy online ordering and reliable delivery make this one of ","useful":0,"cool":0},"ggv6mxF3zf8B2nm9Wwnz-A":{"text":"We live 2 blocks away so we have eaten here quite a few times.  After the last time, which","useful":1,"cool":0},"tvf_l4fusNmXlQgYuVMZNA":{"text":"If you're looking for standard American Chinese food, this is the place. The menu has typi","useful":1,"cool":1},"_0vyreLUpPfxlgQjwUPCtA":{"text":"Ordered the Spicy Mango Shrimp lunch special, it came with a side of mixed vegetables, egg","useful":0,"cool":0},"TP8z3GvZzuE7_mTlZ2kkeQ":{"text":"China Orchid serves your run-of-the-mill Americanized Chinese food. It's good for lazy Sun","useful":1,"cool":0},"dwxY_1RXW-atgTOgIcokbQ":{"text":"The lunch specials are the best at China Orchid.\n\nSesame chicken with fried rice makes my ","useful":3,"cool":0},"3TX-5V6MuGPKnZv6gW1nsg":{"text":"The food is great with even some healthy options that I enjoy. Service is always amazing. ","useful":0,"cool":0},"BDiXf9ArGcm87AvqYKvi_w":{"text":"Decided to eat here tonight after I saw a Yelp coupon. They decided not to honor the coupo","useful":2,"cool":0},"8EFU5CaojaeTZF3HpbyIEA":{"text":"Had a recent birthday dinner here with my family.  I've been here a few times, and always ","useful":0,"cool":0},"ku1c1MlOQ8fYX67gD51Ofg":{"text":"China Orchid used to be my go-to Chinese food, and I ordered there very frequently. Recent","useful":0,"cool":0},"f9x73EFWjlsVVP_YpQdeSw":{"text":"Very nice place. I ate there on a Saturday at noon, so depending on when you go, it may al","useful":0,"cool":0},"u8EfkCYed039rn8MgCSOYw":{"text":"They deliver! Which is a great perk when your Chinese delivery options are either really e","useful":1,"cool":0},"uyT5BrvI5UWIt6PNsupT-Q":{"text":"Very impressed!  Decided to order some Chinese for dinner.. and went with China Orchid b/c","useful":1,"cool":1},"BhRewfElzMDzWGFYDZzdpg":{"text":"They have pretty good food but their delivery is terrible. They take around an hour and a ","useful":1,"cool":0},"csPMHPlzBdDMEeEAEqjoEQ":{"text":"What a great place! The gf and I wanted to escape the French Quarter and we found China Or","useful":0,"cool":0},"MTNBBkwdLk1tt3LLn11tIg":{"text":"Okay, so the delivery wasn't super speedy as it took an hour and 5 minutes. But all my foo","useful":0,"cool":0},"9TUOr0LQQZ5zzG4Zkri8kw":{"text":"yuck. I am surprised the reviews are so good for this place. Maybe I tried the wrong thing","useful":1,"cool":0},"ZvE-7_gW2ApTUGIJSuWv3g":{"text":"New Orleans as such has no good Chinese restaurant in my opinion, its just my opinion thou","useful":1,"cool":0},"dGLH6HgPwMjk1MNNaLRzlQ":{"text":"If you've been trying to find good Chinese food in New Orleans, China Orchid needs to be y","useful":4,"cool":2},"T631QTDWYG5gdKPaer9XxA":{"text":"Got egg drop soup and the sizzling black pepper chicken dish. Very good, like a saucy faji","useful":0,"cool":0},"aLdqjOr7z2d79OWQNEMVfw":{"text":"This is my favorite Chinese place in the city, for sure. Great prices, quick delivery serv","useful":3,"cool":0},"Ilu9Dc2-PZ3vvIl6hHT_cQ":{"text":"They deliver...that's really the only good thing. It's way too expensive for cheap, plain,","useful":0,"cool":0},"4K8JF_f3iV-DK34LGEyLvA":{"text":"Overall I can only give this restaurant two stars.  \nDecent: The mango scallops meal was f","useful":1,"cool":0},"JmQzGvelZFcYAPcVnz1-Wg":{"text":"A good Chinese place is always difficult to find, but you can stop your search now.  I lov","useful":0,"cool":0},"MOuPWpV7lavNrZZnUyNGnw":{"text":"This Friday afternoon had me craving Chinese, but couldn't bear to head to the food court ","useful":2,"cool":0},"9AIKCT5aK_PZPyV2n6rM-Q":{"text":"If you like this place you taste buds must love bland terrible flavor. Won ton soup had wh","useful":1,"cool":0},"V7iz6mHp5DFpptg8ILpTeQ":{"text":"3/5 solid \n\nthis isn't great, but also not bad. it's slightly pricier than other options, ","useful":5,"cool":2},"AilJ4ajYQkKHxoDijDOOyw":{"text":"The food was OKAY (not amazing, but decent), but the service was AWFUL. So incredibly rude","useful":1,"cool":0},"6zJb8SoXbOQ-l4_fLnzPFA":{"text":"My fiance is OBSESSED with this place. It's by far her favorite chinese food. That being s","useful":4,"cool":1},"hZKKMO8gZiv3CjiorMlRtA":{"text":"My first experience with them was 2 years ago .. food sucked and service sucked .. had gon","useful":1,"cool":0},"mZ9J0BVSySTcC0nIpXGvDg":{"text":"Recently had lunch with wife. Restaurant is nice inside and our service from Anna was frie","useful":0,"cool":0},"lFiFodLGRuvFCVn1ox4eFA":{"text":"Great food here. The potstickers are amazing and today we split the Orange Peel Beef lunch","useful":1,"cool":1},"F88imhppftATEYYFJlGm3w":{"text":"Great experience last night. Wait staff was very courteous and timely. Pot stickers were d","useful":0,"cool":0},"AQ7VYa-jyoWDJrfMD64LFg":{"text":"This place has really gone down in quality. My chicken was so hard that I couldn't cut it ","useful":0,"cool":0},"JsHsyZn4PtEYzrqFIqTG6Q":{"text":"Horrible customer service. I paid for a pick up order through the website and when the del","useful":1,"cool":0},"soNmPBU9YtX22bxjr5-bag":{"text":"Stopped into China Orchid for our annual Christmas Eve Chinese Dinner. China Orchid I foun","useful":1,"cool":0},"JnwSumlGwAEULdjo2JrjMA":{"text":"Ok...so...where do I even begin. Came here for lunch last week. I should have skipped it b","useful":1,"cool":0},"-kSE-qmXwUHzIyueBixrzQ":{"text":"Ok in a pinch for some Chinese food.  It's the first place we have tried in town and we wi","useful":0,"cool":1},"0QKlpcRA3Z02mp9dS5bQ1Q":{"text":"Consistently good food and fast service.  I'm vegan, and they do accommodate my dietary re","useful":0,"cool":0},"kSF9qfTD42n2Fj0jIskuBw":{"text":"Everything is good and at a good price.  This is our neighborhood Chinese restaurant of ch","useful":0,"cool":0},"7GEApncg2T5Vw6vSpLUbMQ":{"text":"Place is clean, cozy and have plenty parking spaces. Food and service was good. Their lunc","useful":0,"cool":0},"20E9YRpao-cfN3E2jjOFzA":{"text":"This was the worst Chinese food I've had in New Orleans and the service was terrible. Work","useful":0,"cool":0},"jTFOVdGnGF5wn5HUd1v3Sg":{"text":"I am so glad I went to this place. I was beginning to think there are no such thing as a d","useful":2,"cool":0},"8WiZzmbSKiVUSw-0kKIqFg":{"text":"Everytime I come there they have nasty attitudes My food was just put together I've been c","useful":0,"cool":0},"lrCECaz32nWDmvMkIhv5RQ":{"text":"THE WORSE CUSTOMER SERVICE EVER! I was calling to place a order and the lady on the phone ","useful":0,"cool":0},"Kcue95D-K6Sf7-xLV-xlAA":{"text":"China Orchid..\nWell, where to begin on this review.\nChina Orchid is a perplexing business ","useful":1,"cool":0},"s8ia_DtuQNduaEqYnye-OA":{"text":"The food here to me really sucks these reviews are not that great if they are saying they ","useful":0,"cool":0},"lYBfxrYjmqmh2NjT7qKGOw":{"text":"Awful, worst than mall Chinese Food and that is gross.. I rather have wok and roll over th","useful":1,"cool":0},"dc09RhQEaHhAx8TCPv1DXA":{"text":"We had lunch today. Great good & Kim , our waitress was fantastic.\nThe portion was large ,","useful":0,"cool":0},"qDI2kqGkww6t8u-1ftFqWg":{"text":"really really good greasy chinese food. my husband and i used to take out an order of frie","useful":1,"cool":0},"mEKq0ctKk28KlrPUL-EzqA":{"text":"i just ordered from there and thought with good reviews that it wld be at least a ok meal!","useful":1,"cool":0},"Co7a9K0tJ6eNBc7mo3AYXA":{"text":"As always, they never disappoint. Had the Kung Pao Chicken this time. I've been eating her","useful":0,"cool":0},"uQz0MWSx51bZIjzPg7P-Og":{"text":"One of the few places you can find spicy Pad Thai...shrimp or chicken. So, good! Crab Rang","useful":0,"cool":0},"qpsDqmc6h7RUv4Io3OJNIQ":{"text":"My Waitress harassed me about a tip, even complaining when I offered a tip that wasn't eno","useful":0,"cool":0},"Bq1ZiLG4jDW2fj1NHqOlig":{"text":"I'm excited to find a solid spot to satisfy my Chinese food craving, and so close to my ho","useful":3,"cool":0},"u5slPxfEPa90i4_X2plsmQ":{"text":"China Orchid is my go-to for Chinese food on Carrollton. We usually do take out and the po","useful":0,"cool":0},"s7lSPwZHEoU8E72tTia1Ag":{"text":"My husband and I have been coming to this restaurant on an almost monthly basis for quite ","useful":0,"cool":0},"a5bZF3NfOTVx8rhZAwmOIQ":{"text":"I have a simple adage to simple Chines food:  if they can make a top quality fried rice, t","useful":0,"cool":0},"qkBEONKREVkltFBU_lJNsA":{"text":"I really like their Combination Lo Mein! Chicken, beef, shrimp and veggies. Yummy!\n\nThe Ge","useful":0,"cool":0},"hzz-9WJ270tVcYuhnFSe4A":{"text":"I don't know why I do this to myself. When I first moved here, I ordered from then every n","useful":4,"cool":1},"i9Xwp1DDHlAW0DsD6zzdXA":{"text":"It's good for what it is considering it's likely the most convenient Chinese option for lo","useful":0,"cool":0},"oGjFbQTZiYln1kI0GB7irg":{"text":"This was the first Chinese place in NOLA I didn't hate. I wouldn't go as far to say it was","useful":1,"cool":0},"9OCOEDz2LOn5imVBh6tlxA":{"text":"THE POOP: THEY DON'T DE-VEIN THEIR SHRIMP\n(See pic) Eeek! That first unappetizing image ha","useful":5,"cool":2},"sosFXuUm-TC_k4jCn9HUkA":{"text":"Last time eating here.  I love the food but they play Fox News on the television.  Boycott","useful":1,"cool":0},"jR0qT3-UwefM4wBdWlZ4ow":{"text":"Mediocre food, rude service. I ordered online via their website system. When I arrived I w","useful":0,"cool":0},"Zwho70tlsWhvwXkbnaxscA":{"text":"Real quiet spot uptown. Parking is terrible. All the businesses are so territorial over pa","useful":0,"cool":0},"tDLxr9zhQbkhcFzZ0qUncg":{"text":"I really enjoyed my lunch at China Orchid yesterday.  They serve solid, traditional Chines","useful":12,"cool":9},"tQWuJqv3sjl5YzXQma7uXw":{"text":"worst chinese in the world just ate thare last night and something black around the rim of","useful":1,"cool":0},"vuesbV-h3ms9GJ15OH7Vkg":{"text":"Amazing food. I am shocked that this place doesn't turn more heads. I grew up in a city wi","useful":0,"cool":0},"pNOdgKUTN8X4FDjEC0Hkkw":{"text":"Good food here!!  Not excellent.. but good \nI want to say great, but. No. \nI might stop by","useful":1,"cool":0},"_4HvVKlB8LhzW8DAGu3c5Q":{"text":"Omg! This restaurant is amazing! I absolutely love the fact that they offer white meat for","useful":0,"cool":0},"dJ9zyU2Jtj7OGOCnC7X-rw":{"text":"Ordered the seafood pot. The worst, flavorless food I've ever had. Absolutely awful. So di","useful":0,"cool":0},"q46d5S-8N7HzwBF7RfGi2g":{"text":"I really enjoyed this place until today.  I've eaten here many many times over the last 9 ","useful":12,"cool":1},"CO3-CAHKaSIqABVcrBODWw":{"text":"The food is good. I usually get two orders of chicken fried rice to meet the delivery mini","useful":1,"cool":0},"K2_IVPgVg2Fq7crbp5SKng":{"text":"My absolutely favorite restaurant since I started at Tulane in 2013. \n\nThe egg drop soup i","useful":0,"cool":0},"UfVNoL2TxucBiJW6Nzt2rg":{"text":"My favorite Chinese restaurant in the city! The pan fried potstickers are bomb! The veggie","useful":0,"cool":0},"jkUnn3n8JCaFLmgQbqwbOA":{"text":"I've had lunch here often, but when a group of friends wanted somewhere cheap to meet up f","useful":1,"cool":0},"ZyHhAAZtoYAAw_2Mq5t0sw":{"text":"I love this place. Excellent Mongolian beef. Service is a one as are the app and entree it","useful":0,"cool":0},"KcpAXbDPkNuzWP51KJaavw":{"text":"Om nom nom! China orchid is the best Chinese food we've found so place in the city! The st","useful":3,"cool":1},"DpISjZAfJFda-oka9HazIQ":{"text":"If I am in the Uptown area craving Chinese, this is the place I go! The restaurant has a n","useful":1,"cool":0},"-929ooeUnTZHzu-DGg8hPQ":{"text":"The best thing about China Orchid is you get some of the upgrades of this being a restaura","useful":2,"cool":1},"Q5DJ71yMuykD2_yhilDCgg":{"text":"I'm on a super restrictive diet right now, so eating out is a serious challenge (ie can't ","useful":3,"cool":1},"Qf0-QXPs7LKRopupK-2ziQ":{"text":"This place been here for many many years. It's a small dining area but its clean and cozy.","useful":2,"cool":1},"ZuvrV7EnptYK1Qvrx9yIQQ":{"text":"Last night was the kind of night that businesses like this thrive on. I was lazy. I didn't","useful":1,"cool":0}}