{"1fwOUkZaHuCogxb-AFEbig":{"text":"They moved my parents furniture into storage while they finalized the purchase of their ne","useful":3,"cool":0},"wLyRdPtGEQnA9ogvPIWDyA":{"text":"Our three-man team was courteous, prompt, and efficient.  We had a fairly small job and, d","useful":2,"cool":1},"udIpGBgVGWRTCPJsM2jfPQ":{"text":"Movers came late. In addition, they started the clock when they arrived at my apartment co","useful":0,"cool":0},"0pXkfRt1nGkJwD4psSV8zA":{"text":"My work has used this moving company several times and I have noticed no issues.  They sho","useful":5,"cool":3},"4b8B-d1FpuRu-DgPWshzzg":{"text":"I'm sure these guys are great, but i called for a quote over a week ago and didn't hear ba","useful":2,"cool":1},"0w8alKbHghqY98ECmGkLJQ":{"text":"STAY AWAY!!!!!!\nAfter waiting all afternoon, had 1:00 apt at 3.30 called to say will come ","useful":5,"cool":1},"88WrfeXFtrRqBLr7kIPjVA":{"text":"Movers did fine, but office totally dropped the ball. Prepared 9 days in advance, and call","useful":0,"cool":0},"7gc4EyA93Bzi3GlP6Icqiw":{"text":"I used them to empty my dad's house before selling it.  They were extremely pleasant on th","useful":2,"cool":1},"CDcGMWf5jrV5Cgo1CRnxRA":{"text":"This was by far one of the most worst moving companies. The workers was dragging and wasn'","useful":1,"cool":0},"mLVXeNJwt2KgEHzRlm9heQ":{"text":"A 3-man team was sent out to move 3 bathroom vanities from a storage pod to our new house.","useful":0,"cool":0},"dw60wLKIPHbR6x9upo8LQw":{"text":"Jimmy and Jeremy were extremely courteous, careful and patient.  I expressed my concern wi","useful":9,"cool":1},"Qobi5MH1AtGq0Q4s1hkLoA":{"text":"The worst experience of my life. It left me in tears (truly). They did an estimate over th","useful":3,"cool":0},"mi88hE3Ah3SfXMiZp3KFHg":{"text":"I moved a one bedroom apartment with no appliances. I have done this move before with the ","useful":6,"cool":0},"qfr1j-X_gk1-luDR3SrG4A":{"text":"This is my second experience with two men and a truck and I cannot day how happy I am. The","useful":0,"cool":0},"Oia9WWZRY1KxnyLsATi5FA":{"text":"I would prefer to give zero stars but apparently that is not an option If you want to be c","useful":7,"cool":0},"kLkf_4ac9cHE0504eqPn5g":{"text":"Really wish I had read the reviews here before booking Two Men and a Truck, but I just fig","useful":1,"cool":0},"7KfreXhyGYHUE0Aku7YtEQ":{"text":"I absolutely would NOT recommend this company to move anything! This is by far the very wo","useful":1,"cool":0},"I70-6iUhnogpy4VmgOI60A":{"text":"IT WAS HORRIBLE!!!!!!!!!!!!!! they charged me an additional $150 dollars after they were f","useful":11,"cool":2},"5ORyhu1ixgTVkyDRZYq2fw":{"text":"If I could give a 0 I would. The owner of the location is an absolute pig. They damaged ov","useful":1,"cool":0},"ZSHpl9OwluA0dKz-x2GSSg":{"text":"I hired Two Men & a Truck to help me move & it was a horrible experience! Instead I got tw","useful":0,"cool":0},"CnCZLu-w9wWVs1oUfpH4Rw":{"text":"Wow, I wish I'd read these reviews before using them. Horrible, stressful, ridiculous expe","useful":2,"cool":0},"oBL6SkKCmXol6xKGiz-2rA":{"text":"Awful experience with the office management staff and owner.  Our 60 inch tv was damaged b","useful":0,"cool":0},"9Aimbm3BSwX_7NTt9-mVQg":{"text":"Both times I have used this company, they have been extra efficient and no nonsense!  They","useful":0,"cool":0},"5u52cmodcF-k2EsxHiCNHg":{"text":"Wow, I wish I would have come to Yelp before selecting Two Men and a Truck from Metairie. ","useful":1,"cool":0},"NyipN-j4qeMTJaTFsPtgww":{"text":"Updating my review based on Oschelle's commentary - the service I received was abysmal on ","useful":2,"cool":0},"HSeAosqeuTsqVWKfPq09NQ":{"text":"Terrible service. Movers and packers were so poorly trained. Dresser was dragged across a ","useful":2,"cool":0},"ScJy7E25x5iXvw0Ki9eijQ":{"text":"So after I called many times for the manager Jolene, she responded to my fiancé and gave h","useful":1,"cool":0},"5sidr6GUAjeH4eFXdujWbg":{"text":"I didn't use them, but they are overcharging big time. They quoted me 2300 for a move. I w","useful":1,"cool":1},"u5q80RMF6Or5A21x_eUGow":{"text":"I want to thank Two Men and a Truck for an outstanding job moving my daughter from downtow","useful":0,"cool":0},"ZX7kEmaYpY2n1HuJ17ecpw":{"text":"Movers were moving someone into my apartment building. Refused to wear a mask when asked","useful":0,"cool":0},"pB7rwCBx17GoX741DsPSLA":{"text":"I will never recommend this company. They sent me a 60 year old and a 19 year old to move ","useful":0,"cool":0},"Q-CkZd2tI37ckiXHdSA3Cg":{"text":"ZERO STARS!!!! I'm telling you this place will rip you off!!! We hired them for a move bec","useful":0,"cool":0},"LLFrRMpjhpxswvRS3wu1YQ":{"text":"Do not use them! \n\nThey are not the \"movers who care.\" Even with the entire inventory and ","useful":0,"cool":0},"YYkXcxD1eS0sUYR19NObWA":{"text":"This review is loooooong overdo.  I scheduled them to move me from my apartment Uptown to ","useful":0,"cool":0},"3CKDkmF1kWO5Wj0GBSGOJw":{"text":"This company is absolutely abysmal on every level.  Do yourself a favor - avoid them at al","useful":1,"cool":0},"j_w4-wfctrOesC9maNMC4g":{"text":"I have worked with these guys more than once on more than one move. They showed up on time","useful":0,"cool":0},"PZ8SWJqgEpmp0FPzI0udaw":{"text":"Posting this here since the New Orleans office has closed: \nMy experience with Two Men and","useful":2,"cool":0},"IPehGbNsZhCqWX2F_RE2-g":{"text":"0 out of 5 stars. WOULD NOT RECOMMEND!!\n\nOverrated and overpriced. DO NOT HIRE THEM!! \n\nTh","useful":0,"cool":0},"3RUuUbUICKX-okiZ0JDcyA":{"text":"Horrible as you can see. Reading over reviews I'm sure I'm screwed and won't get a good of","useful":0,"cool":0},"Ue0N9AuXma_nIxTfh6n58Q":{"text":"WORST and MOST STRESSFUL move I have ever experienced. If possible the rating would be zer","useful":5,"cool":0},"Lee4nTWyd7y08M1vC3uhYw":{"text":"I purposely filled out their questionnaire online with my entire inventory and asked that ","useful":1,"cool":0},"KpjhMcLdbRsgsv2xVJ0sog":{"text":"Where do I begin? Strongly suggest you do business elsewhere. We were charged over $2,600 ","useful":0,"cool":0}}