{"c3_Ipm8YCug7Fjhfy-Tudw":{"text":"If I could give no stars I would. Ordered a sweatshirt for a Xmas gift on 12/7 thinking th","useful":3,"cool":0},"imXahZXD277fa27kOJb2fQ":{"text":"I don't really think of myself as a t-shirt person but the designs here just have an eleme","useful":1,"cool":0},"w0RidvlbAupN3GnAsfCwgw":{"text":"Very poor screen-printing service. Watch out.","useful":1,"cool":0},"R261QYwP8a-U0vuJXNO7lw":{"text":"They've got a great mix of clothing, gifts, and accessories for both guys and girls (guys,","useful":8,"cool":5},"B2yOgHkA-kTPJQGS7p_nbw":{"text":"Contrary to my previous visit to Skip and Whistle, this time was fantastic.\nThere was a di","useful":2,"cool":1},"6vk8lFytpP_SnR6rSqn1VA":{"text":"My wife got me a sweatshirt for Xmas -- the size was way off and the quality wasn't great.","useful":2,"cool":0},"99lOjjogUORafJOVF_snYA":{"text":"Great locally owned shop!  Awesome place to get a gift.  Really cool unique new orleans-th","useful":3,"cool":1},"-ghZqzeBnchbzqVT8JOrcA":{"text":"Fun t-shirt shop on Oak Street in the Uptown district of New Orleans.  Create your own shi","useful":0,"cool":0},"_vou-b437p4mHVUBf89_2g":{"text":"They are a local company that used to have a brick and mortar store, but moved to sell exc","useful":8,"cool":1},"7bVsgA0KXQFBBjsgXDDAOg":{"text":"Had a great experience with Skip-N-Whistle by mail.  We ordered two t-shirts on the web an","useful":0,"cool":0},"MOkOLhGfECwJdcsSuzqs4g":{"text":"What a MESS!\n\nI ordered printed Christmas sweaters from this company on November 15th, hop","useful":1,"cool":0},"b8qpiLD3e6Hy2ub4aXhYAA":{"text":"Placed a online order Feb 13. Received an email saying it shipped Feb 20. According to the","useful":0,"cool":0},"T84K8h2IXlvPhAvUdkv8Jg":{"text":"Meh is right. Some cute stuff, but a ton of cliche nola themed shirts like at every other ","useful":1,"cool":0},"vvCkkv2bGI74Urpoyg9rMA":{"text":"I purchased a shirt from Skip N' Whistle, a pon washing it the sleeve ripped. I went back ","useful":5,"cool":0},"CPLqELwWCRt5TTRg-Zk3WA":{"text":"I ordered online because I had a desperate \"need\" for one of their shirts and didn't have ","useful":0,"cool":0},"PU_cZP8SZGUBAtscSwd9uQ":{"text":"So far, it's been a horrible experience. According to website, any order placed on Dec. 16","useful":0,"cool":0},"2wIMQ4jPERf8ScGIukoZgQ":{"text":"What a horrible experience with Skip N' Whistle. I placed an order on 11/26. I emailed to ","useful":6,"cool":1},"Sne-OXJt9VTFZWqxkuBJYg":{"text":"Another great local business that I was able to support while planning my wedding. They pr","useful":5,"cool":2},"xZcVgsiSltD0ttE09sfY2w":{"text":"I LOVE THIS STORE!!!!!\n\nSuch cute and creative designs. And they have a wide variety of de","useful":1,"cool":2},"Diz40zP68okTMd4L5GVYlQ":{"text":"I checked this new clothing store out during the chaos of PoBoy Fest. But made it back tod","useful":4,"cool":2},"u1SU77YBAOrosoQaLu2IVQ":{"text":"This is a great little business that is hard to categorize. \nYes, they sell t-shirts, but ","useful":1,"cool":1},"E7_vkQPPmJB0BW-DHIZIOg":{"text":"Place is a scam. Placed an order on 12/3/2018. Never received it. It's now March. Never he","useful":1,"cool":0},"i17279PgDvHBzTl0U_ccHw":{"text":"This only pertains to the online store.\nI ordered a Christmas gift on Thanksgiving Day. It","useful":2,"cool":0},"bTPHBz8guU3ST0Hsc10NZQ":{"text":"This is not your average New Orleans themed tshirt shop. Not at all. They've got so much m","useful":5,"cool":3},"jFy9CQvSNQux_2a9jguRzQ":{"text":"The customer service here is HORRIBLE! DO NOT ORDER ANYTHING from this company. When I rec","useful":0,"cool":0},"rLgko8mm7P5IiG74QR4FVA":{"text":"This company lacks any form of customer service. I placed an order in Nov. of 2013. I had ","useful":0,"cool":0},"J9wfQW4dSivfBymrQ9FjbQ":{"text":"Cant see myself ever paying almost $40 for a worn out tshirt that everyone down the street","useful":1,"cool":0},"iUKRRJ6rE8MJHJ-PUwAJZQ":{"text":"I got scammed by this company. I ordered a Christmas sweater in December and nothing ever ","useful":0,"cool":0},"D1kIJHgPbzuu5i5t3MlULA":{"text":"I placed an order on-line and waited for the sweater to arrive. It wasn't actually for me,","useful":2,"cool":0}}