{"WYOahIy_xvqpvPA2k6RXHw":{"text":"Delivered as ordered and 12 minutes early. A bit greasy but otherwise delicious and under ","useful":1,"cool":1},"4DyFZBHinFzFpf0WtEWNfw":{"text":"If I could rate this Zero Stars I would. This place is very unprofessional. Did not bring ","useful":0,"cool":0},"EGwa2LyUqAGn0HZm0RfkvA":{"text":"Pizza is the worst pizza I've ever had. Really disgusting. Ordered it with smoked pancetta","useful":0,"cool":0},"oSzk37QAaC3Gcx5YEJsbwA":{"text":"Very different pizza as compared to Dominos or Pizza hut! We had the veggie pizza. Loved i","useful":0,"cool":0},"nvMzOvmUpL5GqDFWiR3zHg":{"text":"Being from Jersey, it's hard to find great pizza outside of the Tri-State area, but Pizza ","useful":0,"cool":0},"L4nfO8i37G3wTZWQBtuSQQ":{"text":"I would give 0 stars if I could. I ordered a simple cheese pizza and the delivery time was","useful":0,"cool":1},"ziWdOBx_JEAK3Af9mm7onw":{"text":"I used to love this pizza, but more and more it arrives half cooked with sparse ingredient","useful":0,"cool":0},"G1vduncfuNram-q2InfMVg":{"text":"If you're staying at the Hyatt Regency, then you're in luck because Pizza Consegna will do","useful":1,"cool":1},"8TkYK9It5N6HNM3PrjBhNg":{"text":"For some reason, it was $8 cheaper to have the pizza delivered to the hotel room instead o","useful":0,"cool":0},"pmJbLTwBOvetOtkFGimr3w":{"text":"Literally the worst pizza I've ever had.  The crust was burned on the bottom but soggy.  I","useful":0,"cool":0},"9Fm-FRQ_faYjxkCdFSab1A":{"text":"We stayed at the Hyatt Regency this past weekend and were told that you could order your p","useful":0,"cool":0},"_rPHY9v6WXzf2uLgS2q2HA":{"text":"It was convenient for me. That's it. \n\nI was told on the call in that it would be a 40-50 ","useful":0,"cool":0},"gI32EJ54zVcP5JCJizh8VQ":{"text":"Dont answer phone. Order online over an hour and a half. 45 minutes past \"delivery time\" P","useful":0,"cool":0},"sa66h5H6O07Y3MwjbdotYw":{"text":"Pretty good pizza for cheap. So surprised how good it is due to price in comparison to the","useful":2,"cool":1},"UaQfFk6DQatbvBG0I_qq7g":{"text":"This place is full of it. We ordered delivery. Not only did they give us the wrong total o","useful":2,"cool":0},"vZUm4RE6NmVVNZcEW82VDg":{"text":"I ordered a pizza from them for lunch.  I paid for the order with a credit card.  They cal","useful":1,"cool":0},"BZiNZgiy89FBJesJ0jGKXw":{"text":"Quick delivery, organic ingredients and pretty close to your basic New York slice. It's no","useful":4,"cool":2},"OaR2cpcAflz_dPBVE1sOMA":{"text":"If I could give this 0 starts I would. Soggy, cheese wasn't even fully melted, this is a b","useful":0,"cool":0},"t6HyxIny5Ydv9LsD1pXUyw":{"text":"Below par pizza. Horrible delivery service. They deliver to the Hyatt Regency but don't ca","useful":3,"cool":0},"2WPkdSUanCQ_zbQFLAJJxg":{"text":"I am a fan because I am lazy.  So when I forget to pack lunch and want to order lunch this","useful":1,"cool":1}}