{"oqssFmTPGzq0Tg54hIkJTA":{"text":"So everyone here in NOLA feels they have to try this place because Drew Brees brings this ","useful":0,"cool":0},"OscJKCvL_g3hPsVWZPSgXA":{"text":"Pregnant? - Jimmy Johns won't heat up their deli meat for you nor will they put it on the ","useful":0,"cool":0},"NAlhggPQzaw6oOHRiKNgSg":{"text":"Yes, they have fast delivery for when I don't want to get out of the house. The subs are e","useful":2,"cool":1},"ICtadjhLn4Te_5hGHU28Pg":{"text":"I love jimmy johns, they never disappoint as far as the food. Service could be a little mo","useful":0,"cool":0},"HsMqUyjAvGOLpJbV3ZWzjA":{"text":"I've been a fan of Jimmy John's since my college days living in Milwaukee. I'm glad the ch","useful":3,"cool":2},"9M_MDEtdzwHjBi-y0mXU0A":{"text":"Note: do not read if you are easily offended. \n\nOn the third day, he ate at Jimmy John's. ","useful":7,"cool":5},"LiLlsWCRxsJIZIqUtRj9sg":{"text":"Great staff, very fresh food and an extremely clean location. Helpful, friendly people gre","useful":0,"cool":0},"IzkKXiFz9NQw960e_Gbvmg":{"text":"Great with a capital G!!!! Accurate ordering. Swift delivery. Friendly delivery people. An","useful":8,"cool":6},"vvWbgwR6zrskm_D2kn_JFw":{"text":"The Unwich was good especially for those who want to remove bread out of the deal. It also","useful":0,"cool":0},"GEwjHJQSlUMUuhF3WclUkg":{"text":"It's a chain so you know the food is about the same as any other which is decent but not g","useful":0,"cool":0},"NKxuy5qFqjBbQnY0bnHneg":{"text":"Turkey Tom w/ everything except hot peppers! YUM! Oh and of course a chocolate cookie!","useful":0,"cool":1},"QT0LRB_CBiAoF1SNMSbFNw":{"text":"It's like they get me or something. After a long day at work all I want is someone to deli","useful":0,"cool":0},"oNfYOW3JEf3bbtGN6UJi_Q":{"text":"What I ordered: #9 no sauce, cut in half\nWhat I got: #9 cut in half\n\nI almost feel bad lea","useful":1,"cool":0},"zS27MPFg2XR4bASP_0Isqg":{"text":"the star is for the delivery driver. this is a horrible excuse for a sandwich. if you want","useful":1,"cool":0},"7V0hJJXBZBOVixUWEzVe2g":{"text":"This place is quick and consistent. It's a sandwich place, they do it well. Always exactly","useful":0,"cool":0},"0P8ISh1GOUXHe7esR_UXvw":{"text":"Been ordering delivery from this store once a week since we moved to the neighborhood a ye","useful":0,"cool":0},"snL6P5qPszDCtYXpLC4qEA":{"text":"Always fast whether you order ahead or pick up. They also have delivery options which can ","useful":1,"cool":0},"Yd0elEOEUTnt7EDpfsTxWQ":{"text":"I like Jimmy Johns but this particular location does not make sandwiches freaky fast! I wa","useful":0,"cool":0},"tKGNiEJ0K-nNOS7t6JEF4w":{"text":"My boyfriend and I went out for lunch today. He eats meat and I am a vegan. I explained wh","useful":0,"cool":0},"07MK86hLvspg9alYey_yEA":{"text":"See photos below... Now- I realize the actual product won't look exactly like the picture.","useful":0,"cool":0},"Kmew7RyFbG94zbrGpAtmPA":{"text":"COVID-19 review:\nThis review is based on their delivery and ordering in their store!\n\nOne ","useful":6,"cool":5},"ziidGobZOqaROFPl1AfGJw":{"text":"They left my delivery order on a community table at my delivery address with no call or in","useful":0,"cool":0},"S6r7lbX7OSj7Q3ZFBsrdXg":{"text":"Sometimes great and sometimes not. Today is my third Beach Club I have thrown away because","useful":0,"cool":0},"NC010g-mU08LNZG0krhvvA":{"text":"Ordered over $600 worth of food for a work celebration and had to request 10 more box lunc","useful":0,"cool":0},"zUl-TR7Layqv5JY8Y0Xf3A":{"text":"Make sure you order 3 hrs in advance. Terrible service. Multiple times and 2 or more hrs l","useful":0,"cool":0},"EVqwMKIF239RI9IZaviMOw":{"text":"Very unhappy with my sandwich, I asked for Ez jimmy mustard I guess that means slather a w","useful":0,"cool":0},"sNHuU5taNH3W97txGSKngA":{"text":"I noticed this familiar fast food sandwich shop opened up in front of my favorite grocery ","useful":13,"cool":9},"YDVbmQHs0AT3m6RFatjRMg":{"text":"Perhaps New Orleans is not the beat place to open a chain sandwich shop... The best thing ","useful":0,"cool":0},"-NklNoP2Nu1Gq_dBPOaIVA":{"text":"Again, a chain.  \n\nI know that all Jimmy John's are a like...but this one feels even FREAK","useful":2,"cool":2}}