{"piGIwCiVB7DpbyfnIipEpg":{"text":"So car dealers actually are horrible people. What's worse is they call themselves a Christ","useful":15,"cool":2},"BgT6eJnZwYFkiSG2zrq3Uw":{"text":"Toyota of New Orleans sold me a real lemon but refuse to exchange it for a durable car. iv","useful":0,"cool":0},"3cghjYm4CGy7EaXAh7y0pw":{"text":"I don't know where to begin... My experience here was just amazing! My sales guy, Donald L","useful":2,"cool":1},"bW_3kTHmjbGFRKJKS5mzAw":{"text":"I went to buy a new car, I was very clear that I wasn't looking to spend beyond $5,000. I ","useful":0,"cool":0},"dh2PzZTsTbFLCCFBnQvZLg":{"text":"Initially I saw an ad in the Picayune for a 2008 vehicle with a ridiculously low price. So","useful":12,"cool":2},"o_qgXzsNdufiTDAux8ZszA":{"text":"Worst place to go got burned by them for 2nd time. they advertised a used VW in great shap","useful":0,"cool":0},"Zlfiw4EX3UFPYyp0wJBjpQ":{"text":"Literally the worst car buying experience i have every been apart of.  Worst of all is tha","useful":11,"cool":1},"muiI31HR8dd6H8nEMazIHA":{"text":"I was totally satisfied with this dealership... I had just left another nearby dealership ","useful":4,"cool":1},"e-dKExNTsdCoxI2jeoqHtg":{"text":"Stay away from Jermaine Youngblood. He was not a good sales person. Rude and unwilling to ","useful":0,"cool":0},"H_mEoa3AZRIrmhlPh54TxA":{"text":"Wow to unprofessional for me. Sales representatives literally arguing over who was going t","useful":1,"cool":0},"jA5ouwOGy3KqWhFgC-X2Kg":{"text":"My husband just got a used car from here, and while the sales experience and car were fine","useful":0,"cool":0},"dhqQij1YUZY2QV2pcJghuw":{"text":"Sales manager Gerald called me unappreciative when I wanted to return the car that I was p","useful":0,"cool":0},"KP_YSG2ltZUiBZRzDKz49g":{"text":"I'm not sure why the ratings are low for this dealership. I purchased my SUV from them. Fi","useful":0,"cool":0},"_tlzOwZK07NOahkSqax-Bg":{"text":"Horrible! I wish I could do 0 stars. So, they shotgunned my app to 10 different banks. I w","useful":0,"cool":0},"Ys3eH9YLXajxhd3zqBm-lA":{"text":"I unexpectedly had to purchase a new vehicle and decided to go with Toyota. I researched e","useful":2,"cool":1},"Bxrnqrvff_d2Yjm6gzZUOw":{"text":"Trust the reviews on this one. \n\nAfter calling and speaking to a salesperson and the gener","useful":0,"cool":0},"1SFioG7lPdIcDJtoApBijg":{"text":"Stanley was awesome!!! Helped us get the best possibly deal . Was very calming and reassur","useful":1,"cool":0},"-NoLFubTr6N1WZM89iha2Q":{"text":"If I could give less than one star, I would. \nMy experience with Toyota of New Orleans sta","useful":0,"cool":0},"UGK3cDo7pqk-IxfM4PfgTQ":{"text":"brought my newly purchased toyota here, still under factory warranty. the car is supposed ","useful":0,"cool":0},"vdDHca-ozVhbUu2QhnWc8w":{"text":"The service department based on my experience was absolutely horrible. I replaced a part o","useful":0,"cool":0}}