{"ZEcXUxMeFDrsGCkoafh-8w":{"text":"Great food, fast service and friendly staff. Seems like it'd be a lively place in the even","useful":0,"cool":0},"4vAu52Mp6RJ0TRdrzL6jfw":{"text":"Food was good. Walked over here for breakfast before our Segway tour which is right across","useful":6,"cool":0},"l9L_cuCltXyGxeN4ELG-5A":{"text":"The bartender FINE ASS John was amazing. Best bartender I've ever had! Great stories and e","useful":0,"cool":1},"1OQXoY1PDfi6KAbvz9mRsA":{"text":"Food is ok but the service was terrible. Good place to watch the game.","useful":0,"cool":0},"chAMYhf0fgdUIshFss8snQ":{"text":"Good little find.  Kinda up I the air for dinner and came across this place.  The Gator pl","useful":0,"cool":0},"_v01aOC5yP9zycRh2xd8Mg":{"text":"Debris Poboy. Debris should be burnt ends from roast beef . This was poorly cooked roast b","useful":0,"cool":0},"s5BLQ8li66xMTm5vRbX2rw":{"text":"I am visiting New Orleans and my family and I saw Huck Finn's Cafe.  We went in to be seat","useful":5,"cool":0},"_HGrkUFlm4Kud2ijccmfvQ":{"text":"Food was very good. Service could be improved.\n\nI had the pulled pork po-boy while my boyf","useful":1,"cool":0},"YLUMxw-3Ry5eBW2NAQxw-w":{"text":"I'm a fan for the food and definitely not a fan for the sports bar experience. Spent an NF","useful":0,"cool":0},"OSJFCpjIm_-EttWArXGlfQ":{"text":"Extremely mediocre lunch experience. Everything, from the dry po'boy to the single-sausage","useful":2,"cool":1},"e_J1Dk3ouzyq3qc1WEED_Q":{"text":"A group of us went there thinking we would be able to eat crawfish off the top of a plasti","useful":1,"cool":2},"5u0-SKPpcme3EZgTJMJc2g":{"text":"Sunday, just after the noon hour and of the course the place was packed.  We were prepared","useful":1,"cool":0},"Zs7wifE1kAiK7BLZDp2J-w":{"text":"Food was great and came out very quick!!! Our waitress was Tia and she was so attentive an","useful":0,"cool":0},"_OTGsbZguzdN6jRfhOwuSw":{"text":"Shrimp Po boy was DELISH! And the fries are so tasty, a good lunch find while exploring Ne","useful":1,"cool":0},"pPjOXXelB25iK6xdcDIFRQ":{"text":"Kagnee G was an awesome waitress. Food was great.  I ordered a Cajun bellini and a Atchafa","useful":0,"cool":0},"Ta8nlRjqT9_8sJFRcZhgEw":{"text":"Worth the trip! Service was top notch and the food was fresh and hot!","useful":0,"cool":0},"nluM7iUEwPuD9_rAp5Dgsg":{"text":"Jambalaya so so dry-avoid. The French bread seemed a few days old. The shrimp Po boy: the ","useful":3,"cool":0},"NUWXkMQlfUE2BRPOIWa22Q":{"text":"Food is great but service is a little slow.\n\nThe biscuits and grits are delicious and the ","useful":1,"cool":0},"u1xFofrU9Bhu-Bdp6zCM_Q":{"text":"Recommended from concierge at hotel but the food and service was sub par. (Perhaps they ge","useful":1,"cool":0},"S5MYFhQ4YZHuwl_iFA9ftw":{"text":"Dara, our server was excellent.  Great margaritas I might say also.  Nice clean restaurant","useful":0,"cool":0},"pzQdGjCWHUbUYvT_7D8icw":{"text":"What they label as BBQ shrimp on their menu...I don't know what it is, but I know what it ","useful":1,"cool":0},"BlMDCRg1NQesqsVzBCH7kg":{"text":"I had the quarter stack Pancakes and in a word delicious \nWill certainly revisit on my ret","useful":0,"cool":0},"2CldixF4d5M8KmsA2Q_PmA":{"text":"So good! If your looking for a casual Cajun restaurant just this is definitely a good plac","useful":0,"cool":0},"8OcfxyFNXqw2IspJuoGhtQ":{"text":"Amazing food and just far enough away from the chaos of bourbon st. Yet close enough to wa","useful":0,"cool":0},"Y_FpcHoZTrZqZZFjryYr3Q":{"text":"I stopped in here for lunch recently when pressed for time (this restaurant was around the","useful":0,"cool":0},"Z1za4gE21-56pdlW_-5Wew":{"text":"Ate here over the weekend when a friend sent me a soon-to-expire coupon for this restauran","useful":0,"cool":0},"EF-TBAid88wTSzwfeIAfcg":{"text":"Our server had 7 tables to herself, plus 4 people at the bar and she did amazing! She is s","useful":1,"cool":0},"H05fEoUMfn_ywOIBVn_xXw":{"text":"Staying next door to this restaurant at the LaGalerie Hotel. Great decor and atmosphere wi","useful":0,"cool":0},"Vm9tf9INeNrRThOjXYaw7w":{"text":"Wonderful meal. Had the BBQ burger... Yes. I am the person that goes to New Orleans and do","useful":0,"cool":0},"3xK2gCDlZxo_w6tcq7ZSsQ":{"text":"I had the shrimp and grits, the shrimp was rubbery and the sauce wasn't great. They got my","useful":13,"cool":1},"WTEZ6ECC7sFutiQ3XVo_uA":{"text":"Stopped by Huck Finns as it was a pick up place for a tour we had booked. We had enough ti","useful":0,"cool":0},"BiuOx5u0pSKRXV_B5e7Vtg":{"text":"This is a great place to watch any Saints game or college football game. They have plenty ","useful":0,"cool":0},"W4ZgE8_9AHj--n9vb_2iog":{"text":"We were a little disappointed because we really wanted to go to this restaurant for breakf","useful":0,"cool":1},"4kt8XY5syygYwoevSlQ1vQ":{"text":"Awful, awful, awful. \n\nTurn around and RUN away. \n\nHurry up, don't pass GO, just keep runn","useful":7,"cool":0},"pT4cEnkfQTM0Xf7RRbGRzA":{"text":"\"That's the restaurant business\". This is what the manager explained as to why our food wa","useful":5,"cool":0},"b_kLbNu3XxOp-QDhONenpA":{"text":"I had the jambalaya wrap for lunch. So good especially with the Cajun musturad/mayo dressi","useful":0,"cool":0},"8pBCO-AwF0MK1Mch5HnooQ":{"text":"Chicken biscuits and gravey, excellent. Great bloody marys. We definitely would come here ","useful":0,"cool":0},"yKARWVamHmHRUh-_YWW_bQ":{"text":"a 5 star review from me means i didn't even pick up the salt shaker.  everything was serve","useful":0,"cool":0},"w_WMQA9zxR9sog7tXVJhfA":{"text":"I thought the food here and the selection were excellent.  Staff was very friendly and att","useful":0,"cool":0},"IhDW3nip73bdy_gS6aI9RQ":{"text":"Kind of felt like the TGIF of New Orleans, but it grew on me when we were in there. Our fo","useful":1,"cool":1},"tJPQWEBJ731eDYr7YLNFag":{"text":"This restaurant was right next to our hotel and we did not stop in until right before we l","useful":0,"cool":0},"D0RuQ948UwPUHp-Lj362Kg":{"text":"The food was OK, but the bread pudding is amazing. The service was not so great, it was no","useful":0,"cool":0},"HYuRqYqWcDL_tkRjlozzzA":{"text":"Food was tasty enough, but service was too slow.  We were going to enjoy some Beignet's, b","useful":0,"cool":0},"K5c5PjrbTBYxLnhA4Jx6oQ":{"text":"The food here was great!  I had the muffaletta which was delicious!  The Boudin balls were","useful":1,"cool":0},"U0zXPxzd4LVtM0hFoMU7lQ":{"text":"We went to about 6 breakfast/lunch places in New Orleans & this was by far the worst. Sorr","useful":0,"cool":0},"3aNTD8lwXyphUuClrlFBMg":{"text":"The word \"cafe\" in it's name is a bit of a misnomer. This place is more of a sports bar. O","useful":1,"cool":0},"U3m9mmWgSBdEfUmzF5bS4g":{"text":"My wife and i stopped in here while we waied to be able to get checked in to our hotel.\nI ","useful":0,"cool":0},"htUhOjYOKphzBhLNuunkRA":{"text":"All three times I have visited I ordered a new dish and everytime I LOVED IT. Catfish etto","useful":1,"cool":0},"_Ns6YYuVcS-X1AUXeHLXpg":{"text":"First time in NOLA and my first stop. Delicious gumbo combined with excellent service.  A ","useful":0,"cool":0},"JhLc996-V44RKL9gPZMINw":{"text":"At first I thought this restaurant was a tourist trap, but I was wrong.  Everything about ","useful":1,"cool":0},"9-789kIVPbRZ4qzUdaeJIw":{"text":"I just randomly went here with my bf one night.  We were in the french quarter walking aro","useful":0,"cool":0},"qnj3K1f9sa_rpemDCDBJyw":{"text":"The food was excellent. Biscuit and gravely some of the best I've ever had rich and flavor","useful":0,"cool":0},"QOUk-VEgRSxczQ8_hehq4w":{"text":"Overpriced. The service was great considering it is Mardi gras and the wait is probably ha","useful":9,"cool":0},"dHnA-xgxnA-8pynuUS596w":{"text":"Fabulous cosmos and lemon drop martinis. $$1.50 3-6 weekday. Hurricanes are $5.00.  Servic","useful":1,"cool":0},"NacaJ93jnf2kWVj-2dGbcQ":{"text":"Wandered in for a small bit to eat before a concert.  It was a Saturday, and they had all ","useful":0,"cool":0},"PHGzeabgyOoo1xHtlKR2Nw":{"text":"This is my first time here and I haven't even gotten the food yet. I have been waiting for","useful":1,"cool":0},"CnT5F394txM7pJBGJGMFjQ":{"text":"Remoulade was respectable but pretty small. Caesar Salad was fine.  Chicken not over done.","useful":0,"cool":0},"FHOqLQ8SIjceIHMRxVKE7g":{"text":"The food was bad and service not much better. I sat at the bar and was ignored by the bart","useful":2,"cool":0},"R89myN8yUXXKbH0V9DBkPA":{"text":"First time to NOLA.  Very good place.  Good creole/cajun food.  The one thing that was mem","useful":1,"cool":1},"PzUpnrAEwPMsuuLooHXiCQ":{"text":"I was very impressed by this restaurant. The waitress was sweet and helpful with tourist a","useful":0,"cool":0},"oYCqxRZtz4ewmPP5pVc0Cw":{"text":"Service was great. Received exactly what wanted and quickly. Food was some of the best we'","useful":0,"cool":0},"hJGper2jI4u4ER3wxjQjHg":{"text":"The eggs Benedict was good but nothing to write home about.  The Bloody Mary was delicious","useful":0,"cool":0},"uffly14wqlM9YvqsxNZJXA":{"text":"This place was next door to our hotel and we overlooked it a few times until we were hungr","useful":0,"cool":0},"YrtaYFOQo9and9h53-aj0Q":{"text":"Wonderful food and even better service. Be sure to ask for Katie C. As your server. She's ","useful":0,"cool":0},"m1MFf-AiQZ7Qg788a2Icyg":{"text":"I am months [just 2 -- 5/2015] LATE with this review and we chose to eat here BEFORE learn","useful":0,"cool":0},"zLruztwBR45AWZTQ7AXTqQ":{"text":"Very busy time of year (New Year's + Sugar Bowl) but we got a seat right in front of the b","useful":0,"cool":0},"VW80qoZYSIssRLwBqKBAXg":{"text":"I went here for a late lunch. I ordered the BBQ pork Po-Boy. The sandwich was good size. T","useful":1,"cool":0},"HUBU8Z6vk329S6-zXmiJkg":{"text":"This is a great casual cafe for lunch, dinner or drinks.  My husband and I went about 5:45","useful":0,"cool":0},"-RhhSg44BlHY_1-Ji_T1-Q":{"text":"This place was the absolute worst.  Service was HORRIBLE.  We waited for a solid 20 minute","useful":11,"cool":0},"AJCLPbPzg4uTvpyRjU1GMQ":{"text":"Had to take my Boston colleague onto Bourbon street and make her have something she had ne","useful":0,"cool":2},"Eb2levNjGod-hxRXTflr_Q":{"text":"Other than the location, the best thing about this place is the staff. Went there on a ver","useful":0,"cool":0},"ipRRydSZ49e3k1au6Ioa9w":{"text":"A \"5\" for service, and a \"3\" for the food.\n\nMy waitress was absolutely wonderful, and I en","useful":0,"cool":0},"SEP-HR-xspJJZy0rq5ye7g":{"text":"This restaurant was visited by 4 African Americans one of which didn't like her dish and s","useful":0,"cool":0},"jw9gLb-1Eh3j5PnoaEW9Lw":{"text":"I can't speak of the food, as we have never tried it, but my husband loves this place for ","useful":1,"cool":0},"-LCA9pFJkYhgZ-mPdSBf7Q":{"text":"Great Gumbo and Bloody Mary's! The wings could have been hotter but everything else was gr","useful":0,"cool":0},"H65I_bU86NYKIUxok66F-w":{"text":"Burger was amazing. I hand the NOLA I can't say enough about how good this burger was. The","useful":0,"cool":0},"_9kGNltOO3Wd53OM470d9g":{"text":"Sat at the bar for lunch. One on one service by John the bartender meant I was well attend","useful":0,"cool":0},"j3r-4f0aaeU-fepCXmDYfw":{"text":"Everyone was happy with their meals. I had the fried green tomato BLT and it was great. Th","useful":1,"cool":1},"-NIwX38Ss3KrUIvRxya5XQ":{"text":"Came in late with a group because it was near House of Blues. We tried a variety of dishes","useful":1,"cool":0},"yFuWfB32Ywoo_VnBdspDhw":{"text":"The food was good. The drinks were a bit expensive but there were drink specials to partak","useful":0,"cool":0},"vpKH0odWUGx1q25l-Ox7Lg":{"text":"My husband and I came here our first day of our trip to New Orleans. His requirement for l","useful":1,"cool":0},"YBgUZxJUIdpcpDOsUEreTQ":{"text":"Upon arriving to New Orleans on Feb 4th 2014 my Wife and I checked into our Hotel and were","useful":0,"cool":0},"BDtfTwhqDQgUtl9K-YZ6Pw":{"text":"We were picked up for a swamp tour in front of this establishment.  It looked nice (and cl","useful":0,"cool":0},"GPiLZkkHsManN_HX_IewKA":{"text":"Ewwwwweeeee! If you are interested in a real cajun breakfast, then DON'T you come on down ","useful":0,"cool":0},"pKN3SR4I9GLIKpapVZPc1A":{"text":"Went here after a food tour and waiting for a swamp tour.  I got the sampler of New Orlean","useful":1,"cool":1},"bsZm1-hsmTgEYpX4lTEUlA":{"text":"Came here while I was on vacation and I have to say it was really, really good. Had the ga","useful":1,"cool":0},"9TQMRqKIKH5vkkM20rjrxg":{"text":"My Husband liked his burger & fries (3 star burger). \nI had the BBQ shrimp & grits, and wa","useful":1,"cool":0},"xjDe4-_VWsrJZYNH2CGw3w":{"text":"The  best grilled shrimp quesdilla ever it is an appetizer but it's great ! I believe it w","useful":0,"cool":0},"uD1JMhfGDYg3Dnna0jFzFA":{"text":"We were on a girls trip to New Orleans and came across this restaurant for lunch. They had","useful":0,"cool":0},"uaXnGmgoP5cXa7ZMAhbrXw":{"text":"Food not bad. Service horrible. At times there were no employees on the floor at all. At o","useful":0,"cool":0},"2PIMgxiqPwAZmjF19p4gvw":{"text":"My very first time dining here was about 4 years ago. I remembered this place, so I had to","useful":0,"cool":0},"FSFGvRMXobyxzyqL-wdDUQ":{"text":"Food was pretty good . My one complaint was the service was a little slow.","useful":0,"cool":0},"URsdJx_hrFdCE_Ay3BIU8g":{"text":"Good food Great service! It took me two days to be done with the deep fried brown food at ","useful":0,"cool":0},"BJye7RnRMc-1Zfznvh31ww":{"text":"The restaurant was currently under renovation so we were seated in a very small, compacted","useful":0,"cool":0},"B-8PXrnA4hgpWJWmGiDmCw":{"text":"\"This feels like a TGI Fridays or an Applebee's.\"\n\"That's because it's clean.\"\n\nBoth of th","useful":0,"cool":0},"SICzvO5_lg9oWOfhMJgG7g":{"text":"I'm disappointed. I've been waiting to try some good food in Nola. This place was a hit wi","useful":0,"cool":0},"_Bg420NWIM6XBMTOb4qoog":{"text":"Stopped here for lunch. Charlott was server. She was the friendliest server yet here in NO","useful":0,"cool":0},"NR3yPj9xhl3KdslgAppRcQ":{"text":"This was our first real meal in NOLA on our guys trip last weekend and it was totally soli","useful":0,"cool":0},"eMagd3z8xGjsbSAXTw96Rw":{"text":"The food was great!  The service was awful.  One of the waiters was loud, obnoxious, and w","useful":0,"cool":0},"FS4J91tQ0F2lWuNH58f0Qw":{"text":"Our first choice was not open for lunch so we crossed the street and were happy with our c","useful":2,"cool":0},"uX1Gt7-69qyXM7lPvPSlrA":{"text":"Great food again. Place was super busy but our service was pretty good. The crab dip is al","useful":0,"cool":0},"mt16WaRwyaLOAe1IflqtJg":{"text":"Server was terrible and we waited forever for everything and then the food was horrible","useful":0,"cool":0},"OX6TSbJNinIqpIdz7HiXUg":{"text":"Good lunch for families (don't think under 21 can get in at night).  Fun place to watch ga","useful":0,"cool":0},"a45u0Q-BME692qWLlTeoBQ":{"text":"The name is a little catchy, so we assumed the food was not remarkable - but we were surpr","useful":1,"cool":0},"9j4C_xLHqZbSNVrTv9HD6g":{"text":"On vacation from Miami and this place did not disappoint. All I can say is the food was am","useful":0,"cool":0},"WOvrCcTkTJFSvdodkccZkg":{"text":"Following a late morning meeting, a group of six, including me, decided to try Huck Finn's","useful":9,"cool":4},"Tj0WHdxnOCaUrvGiEIcmpQ":{"text":"I've enjoyed breakfast and dinner at Huck Finn's and have never been disappointed. Service","useful":0,"cool":0},"ksW1aeVcvsTZuY1M1n1OQA":{"text":"This is a good sports bar kind of place. If you want to catch a game over meal time with a","useful":0,"cool":1},"_QpIPxj4A6gN9HDmYJgxYQ":{"text":"Relaxed and clean, which is hard to find in the Quarter. The food is not mind blowing, but","useful":0,"cool":0},"_DI3apRqSbdVFPa7kimo6Q":{"text":"It was a good night at Huck Finn. Food was delicious and out Waiters are really nice! We w","useful":1,"cool":0},"oPidb4uvHQdkQxqrlaxIjg":{"text":"Disappointing! I had high hopes for some NOLA eats, but Huck Finns didn't match expectatio","useful":0,"cool":0},"wcZ8LFoNI_vnI7shdXSPfg":{"text":"Good service. Jambalaya was tasty but very dry. My wife like her taste of New Orleans. Gre","useful":1,"cool":0},"iSYMVEWIhxvIZdPfJ1gvgQ":{"text":"Service was great and the food was really good. I had the roast beef poboy it is was the b","useful":0,"cool":0},"AE2CQkD_vg5YVFOulTiNlQ":{"text":"Food was delicious.   Yummy. Atmosphere was good. Came for lunch. Great music and seemed v","useful":0,"cool":0},"gUUs3E0pg4UDyx3G2fBe-w":{"text":"Great food and excellent service.  Our waitress Amanda was awesome! She offered great serv","useful":0,"cool":0},"y_kmYmItUNnPF7KxnXSdhg":{"text":"Eat here at least once every time I'm in town. Really enjoy the menu and atmosphere. Very ","useful":0,"cool":0},"80TR58w5AhsOWLTCDbAGLw":{"text":"Stopped in here for a quick dinner before heading to Frenchmen Street. The food was medioc","useful":1,"cool":0},"Oinaz3CTFiAcnYKGOkNYhg":{"text":"One of our all time favorites. We hit it up once every time we roll through NOLA.\nExcellen","useful":0,"cool":0},"wkHVZMSunYyGxx5oIilGYA":{"text":"Horrible service!  Went there for after work apps and drinks. The bartender was rude and m","useful":0,"cool":0},"zKZzF8rxIWXTC6IStVNKhw":{"text":"Had the Taste of New Orleans it was delicious. The wait staff was very accommodating for o","useful":0,"cool":0},"GbQCzqqmHW_fGt8IAPPWuA":{"text":"Our family had lunch here last week. I had the Taste of New Orleans. It was very good. Hub","useful":1,"cool":0},"8mscSTEGJXE86csXGvqEiw":{"text":"We were here for lunch on Friday afternoon. Kevin was out waiter and recommended the Roast","useful":0,"cool":0},"VsdJKFo-srdQb37v1TKC1w":{"text":"Stan was a great waiter and the food was yummy! We were able to get right in for Sunday Br","useful":0,"cool":0},"H9VgmFFR5SGCnBBDW709xA":{"text":"Returned for a late lunch. My wife and I both had the taste of New Orleans and her mother ","useful":0,"cool":0},"dRZmwA2MLyQHIVVpAqhjWg":{"text":"I want to give this place a higher rating but simply cannot. Foods good, but the rushed se","useful":1,"cool":0},"RMi_GZfM4gyEKwxP5KUu6w":{"text":"Just ok-- Sat at the bar to grab a quick bite- late lunch. Bartender was nice enough. I or","useful":1,"cool":0},"eSRXNN7-rki8PmOY1Ro1Rw":{"text":"This is a great place to watch a sporting event. TVs all around, great food, and the servi","useful":0,"cool":0},"SanG4DNBdwJ4oSHmhZ0FXA":{"text":"My partner and I went here for a quick bite to eat while on vacation in the French Quarter","useful":0,"cool":0},"RNqri-mW8FVky_7fWmhVAg":{"text":"The food was amazing!! I had the omelet with shrimp, crabmeat and crawfish. Delicious and ","useful":0,"cool":0},"1em1ZHz0msnHNJ3NotrrEQ":{"text":"5,4,3,2,1 gone.   Two times been here two times could not get served.  Adios.   Hmm so my ","useful":0,"cool":0},"4DH9iex0vcejD5ey1Gi77g":{"text":"The food is amazing. I had the eggs Benedict with crab cakes and it was so savory. The pre","useful":0,"cool":0},"Z4fOx4xXVgv-6r85vUHl0Q":{"text":"Superior service from Angie!\n\nAuthentic NOLA food all over the place!\n\nRecommended are Gum","useful":0,"cool":1},"vXbky5jOFR2X3z2ry1fxSg":{"text":"When in downtown NOLA Don't go anywhere else but here for GREAT quality food. I can't stre","useful":0,"cool":1},"FCS25vRF6GlnmAregYjF8g":{"text":"Nice atmosphere and good service. The NOLA burger is great! Chips are ok but not the best ","useful":0,"cool":0},"4BLu1WIgsp478jajZoy73w":{"text":"I have eaten here a few times and it always gets the job done. Huck's has more of a major ","useful":0,"cool":0},"sqnsr8P3wyM2atsws2NPTg":{"text":"This was the first place we ate at when we arrived and I was disappointed. My dish was not","useful":0,"cool":0},"LohpJnatOHafTLNPRz_Eiw":{"text":"Found this place by accident really...we were suppose to meet here in the morning to get o","useful":0,"cool":0},"BzLscSz9gVHsMZM1TVQSLQ":{"text":"THEY HAVE RATS!\n\nGot in pretty late for dinner and this was close to our hotel. My drink (","useful":9,"cool":0},"90gwfTHWx1ELsPsVbDhTuQ":{"text":"Good food nice atmosphere, took a while to get our food and had to send back the burger. B","useful":0,"cool":0},"yrgiXOsbThgwajk9IJNl3w":{"text":"good sit down restaurant with casual atmosphere.\nOur server - Tia ?  was excellent.   Ask ","useful":0,"cool":0},"6GU2U8gRsvvvRJPzxbrM4A":{"text":"Super yummy jambalaya! Nice open atmosphere. Good drinks.","useful":0,"cool":0},"FYHzgQE7kP01uyGOP7rwSw":{"text":"We have eaten at Huck Finn's twice. Once we ate  breakfast, and it was absolutely deliciou","useful":0,"cool":0},"pz6mUKV3M3YZBQc-Fu5swQ":{"text":"We had signed up for a City Tour, and we were supposed to wait in front of Huck Finn's for","useful":2,"cool":0},"P0I0phRps64oNEKOWgxIjQ":{"text":"Had a lovely lunch experience here. We sat ourselves at the bar and we were created by the","useful":1,"cool":0},"_bionao4w5gdSJJ3WYkPgg":{"text":"The food wasn't bad, but it wasn't amazing either. With all of the different places you ca","useful":1,"cool":0},"3oPnQ9euA105P317Sxxa0g":{"text":"We ate there a couple of times during the summer (to and from PCB on a road trip) and I ca","useful":0,"cool":0},"A7q99ZltEut19vgIF-CSJQ":{"text":"I got the blackened tuna salad. It was well prepared and tasty. The beignets are the best ","useful":1,"cool":0},"IniUuNkHvBorDXmkSWl3Cg":{"text":"Awesome place for breakfast. Service was above and beyond the call of duty. Highly recomme","useful":0,"cool":0},"ZsFXxkAFHyfbotvJha3G5g":{"text":"It wasn't terrible, but it wasn't good. Pass this up, even if you're going for convenience","useful":0,"cool":0},"t6mfhF2oFEozdG0Tj51pUA":{"text":"Our server Alex was quite the entertainer. Went for breakfast and really enjoyed the Ragin","useful":0,"cool":0},"NXC3lFBZ76EN5v2K3UpaMA":{"text":"It should have been a sign. All along Bourbon and canal Street the lines were long, but no","useful":1,"cool":0},"YmWIAPs6JQ9yI6ZqMeHQLA":{"text":"Extremely underrated by most reviews. Excellent service (Jennifer the bar tender was fun a","useful":0,"cool":0},"CtI5tHN9nXyMmEB2B8rXHA":{"text":"I liked this place. We stopped here in between sightseeing excursions for lunch. My husban","useful":2,"cool":0},"M8NUCwyn-iolzgYcZqZhuw":{"text":"His was such a great place! Happy hour Monday- Friday 4-6 pm. $1.50 lemon drop martinis! J","useful":0,"cool":1},"qjEIio63GhuGa1Q8Fh087Q":{"text":"This place was great! We ordered a little bit of everything thanks to THE MAN Stanley. Sta","useful":0,"cool":0},"FDYFjJkDgGRMh_HEFNTdsg":{"text":"Huck Finn's was recommended to us by the valet at our hotel and we're glad he did so. This","useful":0,"cool":0},"APPMN-Sb87kWHKO-s35kXw":{"text":"Shrimp pasta?  Phenominal.  I would only share if I ordered 2!  Sauce was perfect.  Not qu","useful":1,"cool":0},"P3aoqmKxItc2O53rgGPikg":{"text":"Not much to say, except for that it was my favorite.  Great service, great food, and promp","useful":0,"cool":0},"787b8XovQw2wMjRaH8ygfw":{"text":"Cold food... Bad service. Has to beg for drink refills. Had to return my meal because it w","useful":1,"cool":0},"OdU6ineVUGF1YE_OZo_6-w":{"text":"Came in for a quick bite not bad not great. Fried alligator was great. Bbq shrimp po boy l","useful":0,"cool":0},"lNosrt3Rvbed4omA3K3WQw":{"text":"A great place for some great food! Be sure to try the Boudin Balls or their Bleu Burger. I","useful":0,"cool":0},"Lpng2hUv3hPv1S8jTm2R3Q":{"text":"Erin was our server & she was the highlight of the evening. The drinks were muuuuuch bette","useful":0,"cool":0},"j8jOpx9SfEepvlEKh4paBg":{"text":"Boudin balls with remoulade were great.  The crawfish étouffée was good.   The jambalaya w","useful":0,"cool":0},"vIh1Tz61o2SBH02cUPUEjw":{"text":"Food here is fantastic. We order the firecracker shrimp and was awesome. Also the chicken ","useful":0,"cool":0},"6Y2yEhyYqVPnDqbZ57aC-A":{"text":"Stopped in here for lunch, and really enjoyed the experience. The gator bites were delicio","useful":0,"cool":0},"suxW4CDbslqIUIM0IpNDUg":{"text":"The food was so good here. I had a blackened chicken salad (gluten free naturally) and it ","useful":0,"cool":0},"N7srbuLjoLYQ4Sqr03XYAA":{"text":"Out of all the restaurants in the vicinity, this one took online reservations and made it ","useful":1,"cool":0},"x4yO1VkbLTCn_lXbDwgqoQ":{"text":"Honestly came here because of a 10% off coupon and the gumbo super spicy the fire cracker ","useful":0,"cool":0},"7IyQPHQANAzQTGMMfDulJA":{"text":"Food was bleh.  The BBQ shrimp po boys were not very good.  Overall, generic airport resta","useful":0,"cool":0},"PkDBWHfEIQTC8k6Bf8joVw":{"text":"We had no idea where to dine and ran into this gem!  Their selection is wide and price ran","useful":0,"cool":0},"-g_p8R6K_E5lr3g8aEQtcA":{"text":"The food is excellent, the service was top notch. The only reason that they did not receiv","useful":0,"cool":0},"5XdhlX1-oPj0wglZMrwsKA":{"text":"You have a lot of places in Nawlins that you can try.  Skip this one, unless you really li","useful":1,"cool":0},"3AlCI3Fkaso5E_NXQT3_iw":{"text":"Was recommended to go to Huckfinn's upon arrival staff was very courteous. We were seated ","useful":0,"cool":0},"8t_FSmNDyGFnsBR1NVJFVA":{"text":"Great fried pickles, tasty roast beef po boy, and good service. We walked straight in, got","useful":1,"cool":0},"yBMgHQTFu4Lo5PnCZHSDFw":{"text":"Great for a large group, and lots of menu options for various dietary needs! The alligator","useful":0,"cool":0},"3wUwaRRXhl-DlA4v5F6HFA":{"text":"We went on a weekday for lunch prior to being picked up there for a tour.  We were looking","useful":3,"cool":0},"rJ4mXwctZhP76xEaSWsxaw":{"text":"Mediocre at its best. Had the Po boys. Much better places to eat are easily available.","useful":8,"cool":0},"HK0oLmz1FX6dSSgMkqJjEA":{"text":"Been coming here for the past 2 years and the food is always slammin! Yesterday I got the ","useful":0,"cool":0},"x12u4FS_tvRFp-p9Kg2Mag":{"text":"Menu was decent. We were looking for a kid friendly spot for a late night dinner. Cheese f","useful":0,"cool":0},"GJM6jK7xlIfI3YouzDhmAQ":{"text":"First time in New Orleans and this place was a recommendation! First off, the service is G","useful":0,"cool":0},"gz3HV_1O7ke-mdtW-D4vTw":{"text":"We stayed at the hotel adjacent to Huck Finn's so we started our first night there and end","useful":0,"cool":1},"bz2I7QwVm5zMVXkeQAvstQ":{"text":"Unbelievably bad.\n1.Put our name on the door and was told 1/2hr wait, there was up to 15 p","useful":6,"cool":0},"trVP-AwC19bHZSzj1vgEbg":{"text":"Service was abyssmal - many tables around us left after no one seemed interested in waitin","useful":0,"cool":0},"bK0Z-_9nY2yTdyw0sZitbA":{"text":"Came over to watch the Thursday night game. Nice menu easy service and very attentive staf","useful":0,"cool":0},"fly4xlV4a1XSfETCAA5WTw":{"text":"Absolutely yummy! Had the fried alligator, which was perfectly done and not chewy or over-","useful":1,"cool":0},"vwzS55-fReqQmDCG82SKZw":{"text":"Had a po boy sandwich and a cup of gumbo here. The sandwich was a little dry. The line was","useful":0,"cool":0},"ReM0U_i_OSNCY10iZ4Z0Rw":{"text":"Our server James was amazingggg! The food was great, I had the oyster po'boy and it was so","useful":0,"cool":0},"nGF1BsgaZQ08raPB28-vPw":{"text":"We had no idea where to dine and ran into this gem!  Their selection is wide and price ran","useful":0,"cool":0},"OxWAywRFm8bW7n5x8tLFnw":{"text":"Stopped here for lunch. Food was okay. Nothing special. Service was poor. Forgot Tracy's d","useful":2,"cool":0},"QJuDEi5hRDO8_nsdjbzdnQ":{"text":"Crawfish Étouffée was delicious & so was the blackened alligator... It's not directly on B","useful":1,"cool":0},"J9SJ6JzsWlRsJLV4-oj26w":{"text":"It's kool, he was runing the bar too, and I had the chicken bacon sandwich, and my wife ha","useful":1,"cool":0},"wxmTXcO5A8nB0HyxhH59Og":{"text":"Ask to sit in Ms. Gilda's section cause she is the bomb.com and made me feel very welcome.","useful":0,"cool":0},"oaMGV25tEBSF9vHm7rTYyQ":{"text":"Don't know if the food is good. It took more than 30 minutes for our food to come out. We ","useful":0,"cool":0},"1qKx61fHL4REj4TuMkNKvg":{"text":"We ate here twice. The food is good, but the service is horrible. (We had to wait at least","useful":0,"cool":0},"w_9Aat9MK-hj4FY6UfzaFg":{"text":"Mediocre dinner food. \n\nApparently we walked in the wrong door and no one knew what to do ","useful":1,"cool":0},"QE4aCFGikfYbW0Zc3mQwHw":{"text":"we stopped in after walking from rampart down to Decatur and then several blocks more. we ","useful":2,"cool":0},"DSEkvMIdSqGd-cjalX6ypg":{"text":"Beautiful place, lots of TV's for sports watching.  Nachos were good but the Shrimp and Gr","useful":0,"cool":0},"YLCk3hm4LRPK9QpIk4XR0g":{"text":"THIS PLACE RULES! We were taking the Old New Orleans Distillery tour which picks up from h","useful":0,"cool":0},"2ThQAEGFFIhk-uLUuJk4dw":{"text":"I have never been treated like a piece of rag from anyone, until i came into this location","useful":11,"cool":0},"gZtAVs49gxZVkKq4jVeNWw":{"text":"A cute place in the quarter. It's air conditioned and mellow. If you're a sports fan they ","useful":0,"cool":0},"-vwZIwep65KU8Uebt5Uc3g":{"text":"Went here for a po-boy for lunch and thought the crawfish was well breaded and well season","useful":1,"cool":0},"ANfqIpXEDqxc-n77grFw1A":{"text":"Had lunch here in Friday!  Carl was our waiter and he was Fabulous!!  The Good is \"Louisia","useful":0,"cool":0},"Eah1RfdFCTSA7LLr3zdu9g":{"text":"I was directed to Huck Finn's by a NOLA Visitors' Center guide named Tom, who was terrific","useful":0,"cool":1},"-C_p5yyz4oNAGKYF7ZK2nw":{"text":"My sister told me I had to try this place. I am so glad I listened to her. The food and cu","useful":0,"cool":0},"aKecOGTU9idMryv4vCAXtA":{"text":"We had breakfast here one morning before getting on a tour bus. The omelet was really good","useful":0,"cool":0},"vQOq-zD3tJIVmWb5EOibsQ":{"text":"The customer service, was ok and the food was average. Reasonable priced food but overpric","useful":0,"cool":0},"6L5MUGcove3AADBJ1BV62A":{"text":"Without a doubt, hands down, the Best Breakfast Restaurant in the French Quarter. You can ","useful":0,"cool":0},"nJsA5JnxPTr_ybXTZ8ScRA":{"text":"Went in for some gator since I've heard it's the place to go. Was not disappointed. I had ","useful":1,"cool":0},"UqinnVkyWiOlYoBloSrr0g":{"text":"Ate there for breakfast. Was seated in the open window by the street. Perfect spot, nice a","useful":0,"cool":0},"VsuUlK0Giw8LcfCSH3rrbg":{"text":"Good food, nice atmosphere. Good for kids! Two for one drinks at the bar too. Beignets wer","useful":0,"cool":0},"cwV8hymTwWeqjmNdwhRExw":{"text":"Bar with a full restaurant under construction by bathroom area. We had our 7 year old they","useful":0,"cool":0},"naOwsvC4sDuOX7iMGvo_Xg":{"text":"Delicious food and drinks!!! Bloody Mary's are the best I've ever had. Food was amazing. H","useful":0,"cool":0},"C0YqPyqFNgUy912sATeDoA":{"text":"This restaurant is amazing.  It is my first time in New Orleans and we decided to stop by ","useful":0,"cool":0},"16aVwcjAnbYW-NYuUdBoew":{"text":"Loved the food but the service was a little slow understandable when there is only one ser","useful":0,"cool":0},"eKssT3MexQfirq48dAWxpw":{"text":"If I could give a lower review I would. The eggs Benedict came out with an overwhelming st","useful":1,"cool":0},"q1i1ln6_iXM0BrUvpdklCw":{"text":"Ate here two days in a row for breakfast. Eggs benedict and grits both days. First day it ","useful":0,"cool":0},"B2PjW_k_0qnVv0MwPRxZ6A":{"text":"You know I looked at the menu and thought sure great place right. The food was very good b","useful":0,"cool":0},"QoqtvaKdQLjNeOB3WLAtkA":{"text":"I chose Huck Finns based on location mostly. Being seated at a table right by open doors w","useful":1,"cool":0},"FyunkF7kAlALKwfjCmO6YQ":{"text":"Came in here spur of the moment for breakfast before we headed out on a tour. Service for ","useful":0,"cool":0},"NMr0YzSTQcok494l-4E9gw":{"text":"Mind you, we were a little hung-over after our first night in N'awlins...but we knew we sh","useful":1,"cool":0},"BM7trYR0Hha5A-bo-E8fsQ":{"text":"So it was our first night in New Orleans and my Dad was like, \"Hey, let's go to the French","useful":0,"cool":0},"iLOcnOxmKYKMrzCrgbi1Gw":{"text":"A Sunday morning breakfast delight.  The only time my wife stopped eating was to rave how ","useful":0,"cool":0},"IJCTJmCs2xpY_8vsEv9qTA":{"text":"Great place fell in love with the Bacon JAM burger. The server Anthony was outstanding eve","useful":1,"cool":0},"n0UVvevXoLx06c5n0Pkl7g":{"text":"Awesome place! Much better hurricanes than pat o'Brian's!!! Have the BBQ shrimp and grits,","useful":0,"cool":0},"xgynsdEg8kUnUs2293BQiA":{"text":"I had the Taste of New Orleans....that was some of the best jambalaya I've had in a while.","useful":0,"cool":0},"GkIH3xCSJ-F5oR8ue1EewA":{"text":"Our last visiting NOLA included a stop at Huck Finn's for lunch.  Our son wanted to try al","useful":0,"cool":0},"7r75khJ3sLFik9noeRrAlQ":{"text":"Good, fast service!  Everyone was very nice. Jambalaya was really good. My wife had the tu","useful":0,"cool":0},"q0HRWvs8mWmEJqfSX9w5DQ":{"text":"Food is ok, I've seen better out here in NOLA","useful":0,"cool":0},"rbp8KJzP8szSVAPtpW5i_A":{"text":"Honestly we went here because we got back from Jazz Fest and were starving and everywhere ","useful":1,"cool":0},"7T5AeKlZWY4Ma2IZQgef1g":{"text":"We are staying at the adjacent hotel, and had to check out Huck Finns. Bartender Kagnee wa","useful":0,"cool":0},"bbU8_BpkaCeGA7K3mxac0Q":{"text":"Went here for breakfast awhile ago, October 9, 2016 I believe was the date. I had one of t","useful":0,"cool":0},"Aixve8jrOw4csicy-2tLDg":{"text":"If it weren't for the stellar service, I'd give Huck Finn's a two. Their jambalaya is dece","useful":0,"cool":0},"GQYUbg-rUYpPoFp8jeRZ-g":{"text":"This place kind of surprised me.  The service was really great.  We were greeted and seate","useful":0,"cool":0},"VTM75VqZRm-e-h8sa3PVYw":{"text":"I really liked this place. The waitress was friendly and offered some really good recommen","useful":0,"cool":0},"-CzHz-crdBox3cjYFKsylQ":{"text":"Not sure why this place doesn't have 5 stars. The food is to die for! We have gone back 3 ","useful":0,"cool":0},"dbc2rtF8t6vma5icbCCvFg":{"text":"If you want the best Muffuleta this is the place!!!  Also, really good Jambalaya.\nBEST Bei","useful":0,"cool":0},"Vm8WfDnQ-_Yzid9skm3hAA":{"text":"Overall, the ambiance is good. Nonetheless, service was really slow . We ordered an appeti","useful":0,"cool":0},"iab-cazPhk22Q39t_JTEXw":{"text":"Stumbled here for breakfast after a night out. Friendly service, strong + good coffee, big","useful":1,"cool":0},"5w9aXgcmsepRaTEKswHf2A":{"text":"Food was gross.. Overpriced... Horrible service... Short staffed.. Will never go back","useful":1,"cool":0},"gHuARN1fg69q0Pne5BYvCQ":{"text":"Easy seating even with 4 kids, food was, for the area well below expectations. Started wit","useful":1,"cool":0},"Cv8tqhlaVP6BsMVvgUzTMw":{"text":"The food was great service was a little lacking but courteous. They have a good kids menu ","useful":0,"cool":0},"mL9McY8vMMsTBAuRS1yRWg":{"text":"Great atmosphere and upscale place. The alligator appetizer was very flavorful and tender.","useful":0,"cool":0},"3eEPhIN4RurIZFLNNB8ggQ":{"text":"The service was a little slow, but the staff were friendly. We had the fried pickles, red ","useful":0,"cool":0},"EjVej2a3axnhAa3ASCTm0Q":{"text":"Average food, we had the New Orleans platter, Huck Finn's salad and buffallo wings. I thin","useful":0,"cool":0},"0c-yDZb_o-53mQRwPG9f0g":{"text":"They lose a star off the bat because it was 11:15 and I couldn't order breakfast, which is","useful":1,"cool":0},"0KEAw3HMEqoDCY0NiVxoyA":{"text":"I had the blackened shrimp salad. It was so incredibly good. Hubby had the roast beef po-b","useful":0,"cool":1},"aY3jk6QyJTqYO_S_Bl_8jQ":{"text":"When the server doesn't know what a boudin ball is I should have known this was going to b","useful":0,"cool":0},"QJyKAVyuRySj0fPO1ZKy6Q":{"text":"Service was great. I got the jambalaya wrap, which the waitress said was the best thing on","useful":2,"cool":0},"gY-Bp-PWgV1zxM_92-hDCQ":{"text":"I have only given a 1-star to one other restaurant which was Denny's so that's basically t","useful":0,"cool":0},"hALX0Ek3WDCzxYc5SopwgA":{"text":"We wandered in for Sunday brunch at 10 since the place had a lot of open tables and no wai","useful":0,"cool":0},"pdVlR9UZHeSty2s23oFzwg":{"text":"The service here is deplorable. After we were seated, we didn't see a waitress for 20 minu","useful":1,"cool":0},"T-4uvqAaaZJN69c5Pxzcbw":{"text":"I must start this review by saying our server, Tyrone, was so amazing and on top of our pa","useful":1,"cool":0},"RHtiwxTRC_ZmNs3dkcA1-w":{"text":"Be aware that this is a casual place, sort of like a sports bar with pub-like food.  LOTS ","useful":0,"cool":0},"Xd9iYBUscVSUD2ZWlHkMTg":{"text":"Chile. These five stars are for the red beans and rice.\n\nIf this Monday fave is your jam, ","useful":3,"cool":2},"fq1X7NH5gGGUNpaVurxGQg":{"text":"This place was great. We ate for lunch on a Saturday and there was no wait. The food was g","useful":0,"cool":0},"EvpJXEF9oNHilg_-yn3pEg":{"text":"Love this place - don't see a lot of referrals to Hucks but it has never disappointed. Bes","useful":0,"cool":0},"nfvVdnyZTtCG-Wdd2p_Dvg":{"text":"Ate here for lunch one day then chilled at the bar the next day.\n\nLunch- was great!  I had","useful":0,"cool":0},"xhHnZqbRqSiNUwEGKVqThg":{"text":"My family and I made our first visit to New Orleans recently and this was a frequent stop ","useful":1,"cool":4},"ovgSofLa1oHYVCQwciqK9A":{"text":"This place has a great atmosphere. The staff are Phenomenal. So nice and respectful. The f","useful":0,"cool":0},"nEmvHOKT4RwZhp66iWVE1g":{"text":"Very poor service at the bar. Waiting 21 minutes after asking for a refill and just asked ","useful":0,"cool":0},"c2v8a2CoSBBoHMZ9KkXU0A":{"text":"I was pleasantly surprised with Huck Finn's.  Went in expecting mediocre and came out with","useful":0,"cool":0},"jo630d2zrNxHTbjwFHhcKg":{"text":"I ordered the shrimp and grits, they were terrible. The grits tasted like pure water and t","useful":0,"cool":0},"CljkhDmQcLmmju13s-6eXg":{"text":"Service was nice, food was pretty good, but my drink was just ok. I got to take the cup ho","useful":1,"cool":0},"YXbACItZRtVYNJCTQz0QOA":{"text":"We came here for dinner on our first night in New Orleans. We got in late so everyone was ","useful":0,"cool":0},"Q640i_YJvSaH_2w7M75SXA":{"text":"We decided to eat at Huck Finn since it is very close to our hotel.  We went for breakfast","useful":0,"cool":0},"LWM7hev78sWujbmNEf--Ig":{"text":"The food was excellent and service above reproach. Our server Dakota was polite, friendly,","useful":2,"cool":0},"XHPf33FC17MB2jYwGQzgrg":{"text":"Huck Finn is on the corner of the street.  It has 3 other rooms and is a medium size resta","useful":17,"cool":0},"1C29SZPzNIQqQYm5JVQOkA":{"text":"Adorable restaurant serving delicious food! Kevin, our server, was welcoming and took grea","useful":0,"cool":0},"M8YTrSiF1wgYJK1exKlaDA":{"text":"We had the Crawfish skillet and it was delicious! It was served with a yummy buttermilk bi","useful":0,"cool":0},"3lnXvQEm9flSZrBBSMm4Zg":{"text":"They got all the games in football Sundays.  Kinda packed.  Food is real dope.  Had me a j","useful":0,"cool":0},"2iZ7V-tEDLCMOjtL1e54Ng":{"text":"Nothing really special about Huck Finn's. It fills the void. Mediocre food at best. Fast, ","useful":1,"cool":1},"zzDATOndwOlPMAl6jjWpKA":{"text":"Great food. Very large portions! Had the BBQ shrimp po'boy and it was pretty fantastic. Gr","useful":1,"cool":0},"tVUjl2zJZ8iHliJRli3KeA":{"text":"Good service, clean and roomy. Cold beer on tap. My hubby and I shared the jambalaya wrap ","useful":0,"cool":0},"45zPJj3j3mehVbsyBR5dbA":{"text":"The food alone would've gotten 3 stars, buuuuut the service got -2 stars, so I had to arri","useful":0,"cool":0},"xIuFLULvrsCaP9Disw9eHA":{"text":"Ate breakfast here on two separate occasions & the service & food was excellent!  Took my ","useful":0,"cool":0},"ZjFQrAlQNWTYhztUdlJdTg":{"text":"This restaurant has a very nice atmosphere, and the staff was great. I didn't order food, ","useful":0,"cool":0},"yIKlWFK6GzP1IC1Ly11iiQ":{"text":"Loved this place! Came to New Orleans for 3 nights, 4 days and stayed at the hotel next do","useful":0,"cool":0},"LBk6ZY5PnTeWyjJglanhhw":{"text":"We came around 2 on a Sunday. Our lunch was very average. We decided to get beignets since","useful":4,"cool":0},"qcmuQ7OlcAtxXmYsc0STFA":{"text":"We stopped here after the french market and the aquarium. I was not that hungry but my dau","useful":1,"cool":0},"vjJc45wj4moqcBw7y-jTaw":{"text":"My wife and I stopped by while walking from Canal down toward Jackson Square. It's very co","useful":0,"cool":0},"qAm76YUiqV8-CtpAAM-usQ":{"text":"This restaurant is amazing.  It is my first time in New Orleans and we decided to stop by ","useful":0,"cool":0},"m5SZ8WaKSHOmEJ1i5HH2YA":{"text":"This was our first time here since we were only in town for a few days .  Service was exce","useful":0,"cool":0},"kDp3HRsj9c97vbgy9zSidw":{"text":"As a Brit, the breakfasts in New Orleans were always going to impress, just in terms of th","useful":2,"cool":1},"_7tO0EqvfUt_YkxicTPwbA":{"text":"Fantastic. From the grilled chicken, fresh veggies, appetizer, jumbalya, red beans, sparkl","useful":2,"cool":0},"HYJ9sAWnK8avy3IJVcIg2w":{"text":"The shrimp and grits were fantastic. Jazz musicians and Sunday brunch in NOLA with great c","useful":0,"cool":0},"ZWXitHhPjf3am5ihEow4UA":{"text":"Fantastic service and food. We ate the blackened alligator bites for starters and had the ","useful":0,"cool":0},"x4LyV22edYfHSacA7QDtLw":{"text":"Been there twice. Suppose to be bottomless mimosas but they keep running out of champagne.","useful":0,"cool":0},"MqNIVOd2U6DSndRww8X4hA":{"text":"Had a great, quick breakfast here - the Boudin Benedict. The food was excellent and came f","useful":0,"cool":0},"ZjtKH1TsWbZ67DW7ZXWxiw":{"text":"Good breaded Crayfish. \n\nMade a late night stop here. It was not mind blowing, but it was ","useful":0,"cool":0},"7EcDeYVA6xf7fpc4y1oI7w":{"text":"Huck finns was a mixed bag, and the service and policies are unacceptably bad.  First, we ","useful":0,"cool":0},"8ZR5Ia7HzoXr2xp30evCaQ":{"text":"Went for breakfast and enjoyed the food and experience.  Returned for dinner and was disap","useful":0,"cool":0},"mDqHOcjbhk_nt3NG9QLzDA":{"text":"Surprised & delighted! I wasn't expecting much when Ii thought I had \"settled\" for anythin","useful":0,"cool":1},"77LrEx8uiahYcM_Gv6_AMQ":{"text":"Loved this place!!  It was a great atmosphere to meet a group of friends for an afternoon ","useful":1,"cool":2},"BtF8rkq3h4UpaOXehne6WQ":{"text":"We decide to come have dinner here as we have few coupons from the Hotel, they did not kno","useful":0,"cool":0},"IpDwjX8S01uQvzmOiIUVSQ":{"text":"Had a nice burger with a patty and roast beef in the bun and excellent creole seasoning. I","useful":0,"cool":0},"ynhlT3FrGFlVmUEda5iiVQ":{"text":"Great friendly staff and killer happy hour deals from 3-6pm. I didn't try the food but wen","useful":0,"cool":0},"cpeP0Y0G7UJ0SD-XAOFUhA":{"text":"Super rude waitress , took over an hour to get our food, asked for a coffee and never rece","useful":1,"cool":0},"x9x_0wl_YtFKgpjZSy0x7w":{"text":"Out of all the restaurants, I ate at in New Orleans, this was probably my favorite. I was ","useful":0,"cool":0},"y-rfLkwJRK4ZrjGkT7xaSg":{"text":"Ate in the bar.  Great service.  Bartender was fun and very personable.  Good food!  We ha","useful":0,"cool":0},"pHKLGCwHAODPiD2U0yH1JQ":{"text":"The signature bbq roast pork po boy was a hit with my friend and I.  The pork was slow roa","useful":0,"cool":0},"mQVnI4Wu65Fq37xzxPM92Q":{"text":"Don't get your  beignets here. They come frozen in a box. Yet, I would recommend the shrim","useful":0,"cool":0},"rSi1n5yD3HRsx5vPKeXNJw":{"text":"3.5 Surprisingly better than I thought it would be! We ended up eating here because our Ca","useful":1,"cool":0},"Hh7ECYMC1_QjD7m4E5nJuQ":{"text":"I really like Huck Finn's. It was attached the hotel I was staying in, had friendly servic","useful":0,"cool":0},"pBRpcECVyOT7ME7xjejcdA":{"text":"Friendly wait staff. Coffee was a little bitter but the food was delish! Ordered the shrim","useful":0,"cool":0},"WYYT92yFDK6P5oSaOSBDeg":{"text":"They only get one star because they had plenty of TV's to watch the Bears playoff game. Or","useful":0,"cool":0},"0wTlEoOiIE5cCwTAuiFG7Q":{"text":"We had crawfish eggrolls, extra napkin poboy and shrimp grits! All of it was very tasty! W","useful":0,"cool":0},"jObuMkujBls03rO1ESBUTA":{"text":"We were hungry and the food was edible. I would not seek out this restaurant for a meal. c","useful":0,"cool":0},"VNJEfj2q9Ng1af96wHx2Cw":{"text":"Was in town on business and this place had a menu that drew my interest. I sat at the high","useful":0,"cool":1},"9LRz1P_gcIvfhENXzf1Wkg":{"text":"Love the style of this restaurant, food looks good. Manager just yelled at a waiter in the","useful":0,"cool":0},"-0uEAgsFO5Fgkzt7_N095A":{"text":"This is one of the few places in NOLA that has NHL Center Ice and won't fuss about changin","useful":0,"cool":0},"auxIjA7E3xsSTktHV5tM6Q":{"text":"Unremarkable... there are other places to eat. I has the BBQ po-boy which was bad but my w","useful":0,"cool":0},"t8D70c-aq8mopQrYkAp5vw":{"text":"I had a break in my conference activities so I ate there while waiting to meet with friend","useful":0,"cool":0},"CdBeByW5N-5-cgjbAyoz1w":{"text":"Ok, so you have a hankering for Louisiana Po' Boy sandwiches.  Great! But don't go here ex","useful":1,"cool":0},"WrBnBSvM6FOn0WklxKw_yg":{"text":"Best breakfast of my daughter's 15 yr old life. She still raves about it: amazing biscuits","useful":1,"cool":1},"mi-_lP7nHVwM4WfN53xSzA":{"text":"Visited Huck Finns for dinner on Saturday night 4-30-2016.  A disaster.  Recommended becau","useful":0,"cool":0},"2zsxTEa1sKbrBzY89KijyA":{"text":"Let me be the first to say that if you're looking for the short wait and good food as well","useful":0,"cool":0},"0LzaJu4dRJbxv5sheEPPsw":{"text":"Huck Finn's was right around the corner from where we were staying so we stopped in for di","useful":2,"cool":0},"tWdpnN9W3lBz4jV8cQOP2w":{"text":"The food was good and location convenient, since it was essentially my hotel's restaurant.","useful":0,"cool":0},"S0AY-a4BKSEmu17NpHFafA":{"text":"We saw a mouse running around in the restaurant. When we told the staff about it they just","useful":3,"cool":0},"tZLP5zlh8noX__XeIdwnSg":{"text":"While I was in New Orleans for work this place came up on my Yelp search and it was super ","useful":0,"cool":0},"sv8epT2glZd3oD6eKbcH1w":{"text":"Came here today on a whim! I was starving but I wanted a nice place that would give me a b","useful":0,"cool":0},"EpnxUMOJJfPn2jZLqv5S1g":{"text":"I'm probably spending too much time writing a review about a three star place, but a small","useful":1,"cool":0},"Us8_XBMrvQE9ysqzyX_Z9A":{"text":"I love this place! Everything on the menu is good but my favorite dish is the shrimp & gri","useful":0,"cool":0},"ibH4Y9FQEfdyGUmHx4xPQQ":{"text":"This place has wonderful food and refreshing drinks! Portions are plentiful and quality is","useful":0,"cool":0},"03bh4Yc9d1MMm1NvjpxD0g":{"text":"a nice sports bar that make a good mint julep. the poboys are nice","useful":1,"cool":0},"pbgBQG2Seye7dv15RsDtCA":{"text":"This is my second trip to NOLA and my second time eating at Huck Finn's. The menu was stil","useful":1,"cool":0},"7HHKrMmYw8-CDCNrajpovQ":{"text":"I dine here about once a month and the only thing I do not like is the boudin balls as the","useful":0,"cool":0},"fGx3AnUuUfRyk7lRnMxc2Q":{"text":"We were in New Orleans with our two Tweens.  We wanted to eat at a place we all liked and ","useful":3,"cool":0},"E2XKGhEhnRGMZYksXbIknA":{"text":"Big breakfast sign outside but no breakfast served inside. Rude server inside, got the foo","useful":0,"cool":0},"cGNqxZ0XtOqhEmYyRU_StQ":{"text":"Very lackluster. We got seated quick which is good. Waitress is nice and ok.However downhi","useful":0,"cool":0},"esh6sOuz0J0QRwWEwJ-IAA":{"text":"This place was right next door to us all week and we never knew how good it was!! From the","useful":1,"cool":0},"FOebk-t5DUS3JWSlY5AwNw":{"text":"This place was the BOMB! $1.50 lemon drops, can't beat it. Sean or was it John? Can't reme","useful":0,"cool":1},"7Hzocl2VcMxs7Oxj_7F4Eg":{"text":"Easily the worst food I have eaten all week in New Orleans. The jambalaya was super dry, n","useful":0,"cool":0},"ZG4MHYyux5Pf3Lgzn1mpAA":{"text":"The muffuletta was amazing, husband had the black and blue burger, also amazing. Kids had ","useful":0,"cool":0},"sPceskBZ8KBcaL8oEABMyw":{"text":"Came here bc my parents eat here every time they are in the French Quarter. Wow completely","useful":0,"cool":0},"15RBrGl0OkBN1qXJ_PPX9w":{"text":"What a swell place! Stopped in for a late breakfast/early lunch and was treated to a ukele","useful":0,"cool":0},"4lZ4VEN9J848GbGpbS6yAQ":{"text":"Went there for late lunch.  Bartender was non approachable.  She didn't care to converse. ","useful":0,"cool":0},"Mke1_-a98WckFJJYaDceUQ":{"text":"The worst slop I've ever eaten. Restaurant smells like toilet water. AVOID at all costs!!!","useful":12,"cool":0},"Y4QG9QP4Tg-AjJanRG4bYg":{"text":"If I could give 0 stars I would. \nCalled Huck Finns slightly over 1 week before Super Bowl","useful":0,"cool":0},"6VgDprvIhqQevlW4cb7yuQ":{"text":"We came upon Huck Finn's first on a Sunday during football. The place was packed to the gi","useful":1,"cool":0},"WdRphZYcfBcgfoEgop6X4Q":{"text":"Hands down the best bloody mary Ive ever had!! The bartender Michonne uses her own recipe ","useful":0,"cool":0},"6znBCjUPeS32EtuLGV_Apg":{"text":"We were recommended to dine here by our tour guide, what a mistake!!\n\nWe both had poy-boys","useful":0,"cool":0},"QwuTSdrGJxM-zPsq5S6hvQ":{"text":"Food was good.  Service wad very slow and inattentive.   I think it was just our waitress ","useful":0,"cool":0},"N3KbeI_I91hepZ-yWtuUcw":{"text":"Breakfast was both delicious and filling. Our server was polite, although not overly frien","useful":0,"cool":0},"fYj4baNyyZQMd5lbQ-NSpg":{"text":"So glad we came here!  Chose it because it was near our hotel, it was raining and had good","useful":0,"cool":0},"H9DoA--2VUkBNoCj6TG5sQ":{"text":"The best juicy burger ever!!!   My husband had the shrimp platter - also great!   In fact ","useful":0,"cool":0},"NSwy0xfrT1iosBQfSxo3XQ":{"text":"Excellent!  Corn and Crab soup loaded with pieces of crab. Clean and very good service. Th","useful":0,"cool":0},"55GYAxehq2NNQFy-Gahp3w":{"text":"Came here on the last night of my trip after wandering around looking for a place that was","useful":0,"cool":0},"zEiifyxvMrIaI4yemD9t9w":{"text":"Such a disappointment. At first we were given a long list of items that they don't have an","useful":11,"cool":1},"l2KCJ11TE9qbNdNBgmhRuQ":{"text":"I really enjoyed the shrimp and grits and my husband had the jambalaya and is was good as ","useful":0,"cool":0},"VGyWILvw7JBYyIzEUHDMMg":{"text":"Phenomenal - a must eat when in NOLA! The Southern and Irish coffee is the breakfast of ch","useful":0,"cool":0},"bP1AFNEuFn-Lj0IeSeEAhw":{"text":"Food was good, service was terrible. We had 7 in our party and the server was very nice bu","useful":1,"cool":1},"KL_RgLiMJyWfDR2Od_BilA":{"text":"We really enjoyed this place and came upon it solely because of how approachable it looked","useful":2,"cool":0},"7I-0zb_UuUWWe1HIvjb3JA":{"text":"We had been looking for a place to get some decent creole food, and came here for a late d","useful":1,"cool":1},"WtOTF3DmH5qVTEL8a-4e2g":{"text":"Screwed up my order,  salad is old. Mafalata bread is old. Service is very slow. Not sure ","useful":4,"cool":0},"2XE0e3mAx2SxaSLziNJtpw":{"text":"We stopped in this place randomly and were very happy with what we got. We each ordered a ","useful":0,"cool":0},"x-6t8Oy6SC5EvS_RaHvBNA":{"text":"It was pretty sad to see that on a Friday night when they should have been crazy busy, the","useful":1,"cool":0},"YTvABPxltx0W9Hfrtw0hlw":{"text":"We went here for lunch on a recommendation, and I admit I did not have high-hopes.  It's i","useful":1,"cool":0},"GsQmQsA9tlB37ZhawM0tRw":{"text":"Do NOT eat here. I came for Labor Day weekend and should have walked out as fast as I walk","useful":1,"cool":0},"FRA4EANeELHEosnX0uH6_Q":{"text":"We were out walking around and got super hungry, so we decided to stop in here to have lun","useful":1,"cool":1},"kwFWYOJ855qe_fwu6O-Uaw":{"text":"First time visitor to New Orleans and of the things I've been dying to try are a Po Boy an","useful":1,"cool":0},"52ytJikEFlxOOTZeAbfMlA":{"text":"As out of towners, we were looking for somewhere to watch our game and they were incredibl","useful":1,"cool":0},"M5CIzNtwXbuMX1Lxf-f1Tw":{"text":"Our waitress Gilda was such a great addition to our wonderful weekend! We came to New Orle","useful":0,"cool":0},"CybKeKTY18Xj-RWx74N2fA":{"text":"Huck Finn's had a very good atmosphere to catch the Final Four game and grab some comfort ","useful":1,"cool":0},"cr6jvI2-g0WMRZKkBuUM-A":{"text":"The best bartender in the city! Kagnee is so so sweet and she makes the best drinks! Thank","useful":0,"cool":0},"oOKp-f9q7JcYDvrNTOl7sg":{"text":"Got here at 11 today (Saturday) Disappointed that we couldn't get breakfast. Our server wa","useful":0,"cool":0},"R_ei6k31DgroiwhV1Z-iDA":{"text":"Great little place. Portions great for sharing. Caty was amazing!  Great food. Our picky e","useful":0,"cool":0},"biAJy9kDFJnbOJW1122zmQ":{"text":"I have no idea how the food is here because we waited for 10 min before finally flagging d","useful":1,"cool":0},"_BBnSA_F_7OBSQBZEfJcmA":{"text":"The atmosphere is great. The food is great. Such a selection. The oyster Po-Boy rocked, th","useful":0,"cool":0},"QbA46v3ac8RlqHtJxi2fiw":{"text":"Here for brunch. You can get your savory and sweet fix with the bayou skillet and beignets","useful":0,"cool":0},"ICbk9AYCg6dulWs0EeYqcQ":{"text":"They have a devoted gluten free menu! I got a light snack of cheesy fries which were so go","useful":0,"cool":0},"eNseq-0VC-4GHGYA6TVsPw":{"text":"I cNe here during my trip to New Orleans and this place was delicious. We came here for br","useful":0,"cool":1},"HX_bMRwH3BcqyklqnH4Jxw":{"text":"Delicious AND reasonably priced! My friends and I went here while visiting and we just cou","useful":0,"cool":0},"g8xK-YgSf7lmewaLZtFEYQ":{"text":"The food was ok.  Service lacking.  The bus boy walked past our dirty dishes like 10 times","useful":1,"cool":0},"KzFwmHPI07RHKtSeEN3hVw":{"text":"I had the seafood skillet, my sis had a pancake and shrimp and grits It was AmazeBallz! I ","useful":0,"cool":0},"BR4hP-cJOsIW-9bysvmVNQ":{"text":"This place was right near our hotel and we also had a coupon for free beignets! We went th","useful":0,"cool":0},"74JayxSTU4pNX5R80XSiaA":{"text":"So we are in New Orleans, dying for good bread pudding but it was later in the evening so ","useful":0,"cool":0},"cZ8qXGkyd0BDAr-QaWDEhA":{"text":"I went for lunch and had a fried oyster poboy and I must say that it was quite tasty. The ","useful":2,"cool":0},"PtjZ1pL9B3hZ6b28BL-htQ":{"text":"First Time Visiting Louisiana so I wanted to try out there specialties, I was thrilled to ","useful":3,"cool":1},"898hMnl4BhxRgvIhXyMIGA":{"text":"Food wasn't bad. We had an appetizer one day and then went back for breakfast the next day","useful":1,"cool":0},"fc5j6rkynsujUovwkMePHA":{"text":"Cool sports bar, good for kicking back and this place had some very scrumptious alligator ","useful":0,"cool":0},"PF5sNRLwTLLBtOHT26_ojA":{"text":"Definitely will come back! Excellent food and service. We had the fried prickles, po' boys","useful":0,"cool":0},"TSfAaoIzi13FkXA_-Wam-g":{"text":"Food was waay overpriced and mediocre at best.  The drinks were just ok.  Service was very","useful":1,"cool":0},"_yI1rHK186zmnlMupoPRjg":{"text":"Listen ... if you ever get the opportunity to eat here ASK FOR ANTHONY!!! He was hands dow","useful":0,"cool":0},"EzvUU-Fqi0UlOcpL-dUydw":{"text":"This place was disappointing  the egg rolls on the appetizer menu not good. Asked about th","useful":1,"cool":0},"EOD_CUpHJW8M-NzOnP8bZQ":{"text":"The food here is well above average for a sports bar. Plenty of tvs for watching the game.","useful":0,"cool":0},"4YNh1hyUYvYXipBanfAjBA":{"text":"The entire experience was excellent. The waitress was awesome. Very attentive. The food wa","useful":0,"cool":0},"j1qPvEolNNQcnQwFwxFjGA":{"text":"While I was in the French Quarter for a home show, at the convention center, I stopped by ","useful":0,"cool":0},"T19Tc2efDNeBwaWJgwmAeg":{"text":"Stopped in for breakfast before going on one of our tours .. We got seated right away and ","useful":1,"cool":1},"Ho-5jdvJee6d17nC9m52Gw":{"text":"We were in NOLA for a few days and just so happened to be staying at the hotel connected t","useful":0,"cool":0},"7B6HhKlSWduMIle7hSoZ5Q":{"text":"Not bad but not the best . Pulled pork nachos were really good . Good choice for families ","useful":0,"cool":0},"L1b6JKEAXn681ZRktEZ9iQ":{"text":"I have visited Huck Finn's a couple of times. Both times I was very satisfied with the mea","useful":0,"cool":0},"F-JwwX7yuNMzYCilKIJviQ":{"text":"Nah dude.. nah\n\nThe gumbo tasted like a gift store.\nThe étouffée was milky and not in a go","useful":1,"cool":0},"ALBLaFAlg_39jqZjJoYOJw":{"text":"I was recommended to huck Finns by a lady in the New Orleans visitors center. \n\nOrdered th","useful":0,"cool":0},"fxnxIxTDvCDx3wfvr1d-DA":{"text":"The food and the beignets were to die for! My husband got the fish shrimp and grits and I ","useful":0,"cool":0},"mGq_tjOsr-xpbmo3mXtzxQ":{"text":"I love this place! It's always my first stop when I get into town. Their po'boys are HUGE ","useful":5,"cool":0},"6kcJ8Bev3CUZoHSFu-3ang":{"text":"We ate here before our city bus tour, we were given a 10% off coupon for our meal. The foo","useful":0,"cool":0},"bxvHgL1TjZe67QARdyblUQ":{"text":"I am giving this place three stars because I have been here before and it was fine. The fo","useful":1,"cool":0},"ZWHP4GI0oxfSPTZtwo_7_g":{"text":"If you're in the French Quarter and want to watch sports instead sport drinking then Huck ","useful":0,"cool":1},"HudQiu-bIlrcfi92fB1Hog":{"text":"Really good southern food! John gave us amazing service. I had the catfish napoleon and it","useful":0,"cool":0},"wQlhjeByD3BY1wvYet0Zbw":{"text":"Ok, probably the best fried oysters I have had! They were huge and done to perfection. The","useful":1,"cool":0},"Rrhmwp-socOxA9hmwJBX0w":{"text":"I ordered a roast beef po-boy and my friend got an alligator sausage po-boy.  The roast be","useful":0,"cool":0},"-pYOc4GJMpxSNxhmAK71Dg":{"text":"We just had drinks and the fried gator. It was one of my to-dos while in NOLa, what a tour","useful":0,"cool":0},"G0E_47WFFlKVcDPQXf77Rw":{"text":"I wasn't sure what to expect. Suggested by our concierge for a simple place for dinner. He","useful":0,"cool":0},"8Jv1ew1YmFnwD6YVd05PgA":{"text":"We came for lunch.  I had the crab and corn chowder. It was really good. \nMy husband has t","useful":0,"cool":0},"2YGOn8PgggHYoce491-brg":{"text":"We had a large group and while the food was good the service was horrible. We had to order","useful":0,"cool":0},"VmftBG6nHtu6msX-9u5zOQ":{"text":"The waitstaff here are absolutely fantastic. This restaurant is right beside our hotel so ","useful":0,"cool":0},"_GwiNffMovwjokLfW8SMwQ":{"text":"The food was at best mediocre! Would NOT eat here again. There are so many better alternat","useful":0,"cool":0},"oBjD0IHfAfeFYUbSftI1Ew":{"text":"Stopped here for breakfast while waiting on a group tour.   Not busy, many open tables and","useful":0,"cool":0},"9n6xcKddjLoBWLxPXNhHAw":{"text":"An incredibly friendly waitress dosen't mask the fact that the food, jambalaya to be speci","useful":0,"cool":0},"2YeuZJvV62wAXlS1qJR15g":{"text":"We wanted a restaurant near our hotel that offered take out and Huck Finn's was only two b","useful":0,"cool":0},"gvFB1f9YXf-LH3fNL_iEWg":{"text":"Came here on a recommendation for our swamp tour guide specifically for the Alligator pica","useful":0,"cool":0},"AI5g6gR3f8Q8z_SbjPQP_Q":{"text":"It's your diner/cafe type feel inside.  Could use some updating and where was the theme?  ","useful":0,"cool":0},"dhB3VacsegkwLp_j1IiTfA":{"text":"We brought the kids, 9 and 10 to New Orleans to give them a bit of Cajun exposure and foun","useful":1,"cool":1},"OxUoB1Rf7c6r96ik_QNiZw":{"text":"In town for a seminar and was staying not far from this place.  Very cool place, nice staf","useful":0,"cool":0},"gCDhAZHJP21SFZVMNy0Esg":{"text":"This is a bar food kind of place with tons of seating and TV's.  We loved the friendly fas","useful":0,"cool":0},"wrpd85FLF7tgnJGL10kYvw":{"text":"The food we had was fantastic.  Mouth is watering over the \"Boudin Balls\" meatball appetiz","useful":0,"cool":0},"K337kaRcbwzkDTuM3DlMag":{"text":"This place was pretty good. Food was very yummy. Service with pretty good and nice. Lots o","useful":0,"cool":0},"QcQMhCJItJULmIYf9do79g":{"text":"Quick lunch grab on our last day in New Orleans. As busy as it was when we arrived, those ","useful":0,"cool":0},"iiLT8IWMx4zB4vg6wdRp3w":{"text":"I had a breakfast skillet here and it was absolutely delicious. The interior was very clea","useful":0,"cool":0},"Lw0TB1oGReBuootNuPu7yA":{"text":"They put jambalaya in a wrap! Delish!! Alligator sampler was ok & boudin balls were delici","useful":0,"cool":0},"hyQt-znF8NV38CM5frACsg":{"text":"Some of the best food we've had in NOLA- best crab cakes EVER- redfish with etoufee was to","useful":0,"cool":0},"XYbGNcIeUaqUeJcrlJLqvQ":{"text":"Stumbled upon while walking two friends from my Iraq days into the quarter for dinner. Of ","useful":0,"cool":0},"6O6XZWt11QIIMGN14fUdxg":{"text":"I give props for being open early. Service is slow. Our food went to 3 different tables be","useful":23,"cool":1},"gtL34b7mdiOhqI_SRfmQvg":{"text":"Seated immediately, gator app was to die for, order the gator bite drink, best waiter poss","useful":0,"cool":0},"MXxdDBVjfC7r5aMHnIMwyQ":{"text":"Been her twice and I loved the food more the first time. Staff is always amazing and never","useful":1,"cool":1},"eDTbkH1aP35stqW0eHq33g":{"text":"Service was great, appetizers were good, I had the shrimp and grits and I have definitely ","useful":0,"cool":0},"sip3YLoiOCdDt66V-fGFPQ":{"text":"This place wasn't bad. But they had the most amazing pecan pie I've ever had. Definitely o","useful":0,"cool":0},"alykVdISI-8ZhTcs_WGpZQ":{"text":"This place was pretty cool! Ate at about 7:30 on a Saturday. No wait. This place is a gem.","useful":0,"cool":0},"1lEq9AVGRoZFWkyeiNda_A":{"text":"I've eaten here a few time over the last 20 years and this restaurant has had several diff","useful":0,"cool":0},"JIVs5yeyoMAUFtj77TtS6g":{"text":"This place is fantastic and we have now been there four different times after finding it w","useful":0,"cool":0},"9NNQknsL_EN3rTkhKt-k2A":{"text":"I just left Huck Finn's where I had the best meal I have had in New Orleans (disclaimer: I","useful":0,"cool":1},"xd9rAd5GCcx0dF4vgtuC_Q":{"text":"We came to place based on an online recommendation.  It has a kid friendly menu.  The Po B","useful":0,"cool":0},"F4jQKhPxW6MOZpfeYTEOog":{"text":"Came here for dinner and had the boudin balls to start followed by two po'boys and a veggi","useful":2,"cool":0},"L5MPo41pojpDxHc1jxWxig":{"text":"Came in here to watch the champions league final looked ok but the service in this place s","useful":1,"cool":0},"-8J_qAdseH4RJWj8X6jcJA":{"text":"This place is a solid four stars. The service was a little TGI Fridays...nice, but a kind ","useful":0,"cool":0},"o9RvS8Pt3HlWeNUnomggFA":{"text":"Great experience! Everybody in our party loved their food. The service was great too.","useful":0,"cool":0},"TQSpvGgpCcUPEqFJipgucA":{"text":"Southern breakfast doesn't get any better. Great food, great wait staff, great experience.","useful":0,"cool":0},"B6rRe27lk29mfhwQn1qHJw":{"text":"Came here for breakfast with a couple of my buddies after a night of bar hopping two of us","useful":1,"cool":0},"7p5IR1hcRCJbgCcZu-zCDw":{"text":"Was recommended by someone here and it is everything and more than what I expected. Had cr","useful":0,"cool":0},"G8xIuwjqhwVJJk0vZf0sug":{"text":"It was our last night in town. We were tired, hungry, and running out of cash. After scour","useful":3,"cool":0},"3tsmfyQFEfPU0jNCQ5NEKw":{"text":"Great breakfast! If you are looking for something different and delicious, try the omelet ","useful":0,"cool":0},"PT-NrpCtlcN0YCoT6iHBhA":{"text":"Don't waste your money, the menu is really boring too. Much better places to eat in the fr","useful":0,"cool":0},"5_zaxJGwMXJz3O4Bfl39Qw":{"text":"Amazing dinner!!! The fried pickles and jambalaya wrap are to die for! Ask for Ty as your ","useful":0,"cool":0},"6TTMR5d4gBk_nybNGr-Vpw":{"text":"Great food, quick service, ok waiter, had his hands full though, nice atmosphere. Location","useful":0,"cool":0},"undrzExb1tFoewsJ9kteuA":{"text":"This is an Alcoholics only review.....\n\nCan't say a word about the food but DAMN if they d","useful":0,"cool":0},"8XmPV5cuuI7cT8U4ds79fw":{"text":"They have the best boudin balls ever!! I also had the sausage jambalaya and it's amongst t","useful":0,"cool":0},"95o3j5KR598y90SHw8_XnQ":{"text":"We decided to eat at Huck Finns after reading the reviews on here. This is the best food w","useful":0,"cool":0},"SbpUov5Ox5ctwergvluagw":{"text":"**Edited in update**","useful":0,"cool":0},"waNKkd7HEkkV5q7IZcVlMQ":{"text":"Quite possibly the worst shrimp po boy I've ever had.  I had an afternoon to kill before a","useful":3,"cool":0},"5cjeYfIFcdEdSX4f6XadDA":{"text":"I wish I could have given them a negative review! We showed up 20 minutes early for a rese","useful":0,"cool":0},"70KahInBT3mJzn2C2bEIJw":{"text":"Food was horrible. Bathrooms were disgusting. We were forced into eating here by circumsta","useful":23,"cool":0},"41jNrT-scpcF4Rl45iQzAQ":{"text":"Delicious! Ordered Cheese Fries as an appetizer. Pretty basic but really good. Ordered the","useful":1,"cool":0},"qgKVVKx5gJD6dZVpmk1eKw":{"text":"Just had the Jumbo crab cake over a fried green tomato and spinach leaves. This has been t","useful":1,"cool":0},"qdKK-D0-KQ5PNjFj1yU_2A":{"text":"Cleaner than most restaurants at this price in the quarter.\nYou wait in a line for your or","useful":0,"cool":0},"7TVDHiG78zrAqo0BvIZtdg":{"text":"this place has awesome Po-Boys! spicy sausage was awesome and they make a killer Mojito!","useful":0,"cool":0},"XKAtwlVmvmVSmf9jHSW8jA":{"text":"This may not feel like a true New Orleans place if you are visiting, but it was not disapp","useful":0,"cool":0},"cmnwDIeCktjKcUN5HAx2aw":{"text":"Huck Finn's was recommended by our hotel concierge. We went for a late lunch around 3:00 o","useful":0,"cool":0},"bp-8vrCnko-uItU_t05UrQ":{"text":"Place is convenient - next to our hotel. Food - OK. Service - slow. Price - too high. Skip","useful":2,"cool":0},"VnXTjlDEnur_FTN33RsdNQ":{"text":"Had a breakfast, lunch and dinner here excellent food, friendly service, quick, clean and ","useful":0,"cool":0},"1p_SidsRiSu3op3Z3OjP9g":{"text":"Unreal!! Avoid this place at all cost. Not only did this place screw-up my order for dinne","useful":1,"cool":0},"32zIjGVeYBwPqqnitAnsEQ":{"text":"Our service was great, I loved the waitress and one of us broke/spilled a water and she mo","useful":1,"cool":0},"FOIZhuXlW4MCrgkXYJFhrQ":{"text":"Best place to watch your game!  11 huge hd flat screens and good location.  The place is n","useful":0,"cool":0},"zT4bTepKy2wsx5pzIocaCg":{"text":"I am in town as part of a conference and we needed a place to host a social hour. Kyle (th","useful":0,"cool":0},"I6w0vSbE2EjFa6OzsvWQiw":{"text":"Horrible pre-made junk.  No flavor.  Far too expensive.  Literally anywhere nearby is bett","useful":0,"cool":0},"vjoyKH6wf09f6WgNVRfu7Q":{"text":"Disappointing.  Service was fair, everyone was nice but the red beans & rice were too swee","useful":1,"cool":0},"an2Yi0hmIu0izC5N2I0bCg":{"text":"We are little lost while trying to find a family restaurant in the middle of crazy French ","useful":0,"cool":0},"pVGgF4dic0bUuijt-4XbgA":{"text":"My husband, my friend & I had a late lunch & we ordered appetizers along w/ our meals - \nW","useful":0,"cool":0},"Fc6JcVi7UntLDmXVYzS-lQ":{"text":"Eat here. Something for everyone but the Sampler (Taste of New Orleans) will satisfy anyon","useful":0,"cool":1},"BCC5xfuaeOEPZm5W5j6ALA":{"text":"I have never in my entire life had a dining experience quite like this. I was so stunned, ","useful":2,"cool":1},"pgPSZjXr6vPo8dk4B_wCZg":{"text":"Ms. Gilda is truly a Gem......I ordered something that they were not ready for as it was v","useful":2,"cool":0},"7-3iOd0EQbs0EJgmOIidcQ":{"text":"I had breakfast at this restaurant. I recommend it. The big easy breakfast was hardy with ","useful":0,"cool":0},"tGA3iNUcIZGMDdWlBsQptg":{"text":"We had burgers. They were great! We were here during happy hour. Beer 3$\nAbita amber was g","useful":0,"cool":0},"5gQbH-97KT1fcJYUGsEZKg":{"text":"Went here for the first time yesterday and the experience was excellent. The food was spec","useful":0,"cool":0},"sNm0fDuFQy_dNf50hubu1Q":{"text":"Great pancakes and NOLA French toast. Fast and friendly and good for kids (no wait to sit ","useful":0,"cool":0},"r89hv-SyXcSyAmQLJ6e_SQ":{"text":"Food was very tasty (chicken sandwich and shrimp po-boy).  Charlie (server) was great, not","useful":0,"cool":0},"zPA5SO2m5DjBqhmq9Ux6kQ":{"text":"I thought the Creole Skillet was awesome! A lot of food for a very reasonable price!","useful":0,"cool":0},"shWxAgQvGq5DV7JCWxsfoQ":{"text":"food was good. but what self respecting southern restaurant especially one with a name lik","useful":0,"cool":0},"pe_jrVoNMPrslfInJ_nSGw":{"text":"The two stars are just for the little food we had. We were seated in an almost empty resta","useful":0,"cool":0},"8SbVYfPKC-lCOs8VMfHOQA":{"text":"Stopped by Huck Finn's Cafe on a recent trip to the French Quarter for a show at the House","useful":2,"cool":0},"hKur6bVwjlSMX6eghrGKhw":{"text":"Boudin balls were good. Taste of New Orleans was awful. Jambalaya was dry, the gumbo was w","useful":0,"cool":0},"SXs34_-XdbsQ542Gq98YPg":{"text":"We have been in New Orleans for 4 days now and tried a lot of different restaurants. Huck ","useful":0,"cool":0},"6bK5Vob006dqmjZh5_NUeA":{"text":"Amazing bisque!  Great staff! Especially John at the bar!  Poor boy shrimp was fantastic t","useful":1,"cool":0},"dquE_mAJZvc4v16xx2r36A":{"text":"On June 26, 2015 we chose Huck Finn's as an alternative to The Ruby Slipper where customer","useful":0,"cool":0},"v41ROX4DMPJR8EVFWBAK4Q":{"text":"So..... I'm on the fence about this place. \n\nAs soon as we walked in and grabbed a table, ","useful":2,"cool":0},"ZEyQb92f8LYOhnHPO5zgzg":{"text":"I ate here in a party of 20 guests.  Tables were setup with water on the table.  Ordering ","useful":0,"cool":0},"hYXvgl5j_U4-1hNfvdtcPg":{"text":"Their food was pretty damn amazing until my boyfriend's best friend overheard the staff sa","useful":4,"cool":1},"nmx0xpLk8p9SVB10jDvfCQ":{"text":"Honestly, I have nothing bad to say about this place. We had a group of friends coming and","useful":1,"cool":0},"hYZt22w0YlxK42TPHMfSTA":{"text":"WOW. What a great place for a Sunday lunch! For our group of 9, there was no wait for us a","useful":0,"cool":0},"QZbLzzypm8xfO5cMBwtV-A":{"text":"Stay away from the catfish Po' Boy it is nasty! Prices are too high for the quality of the","useful":1,"cool":0},"p6XuHQ3_QPQTDGZ2cECluA":{"text":"We came to watch the world series and although they have nice TV's.  The service and food ","useful":2,"cool":1},"VZS06FMMnX24JIMxiPQWSg":{"text":"This place was GREAT. Not much to look at but the food made up for it. The waiter was actu","useful":0,"cool":0},"sA5ejtIrdgfOvd_wL7dM4Q":{"text":"Been trolling around the city for some Cajun. This was great! Came recommended by a tour g","useful":0,"cool":0},"Gf7SquQRO6jyyWen1yjLFw":{"text":"This was excellent. Entertainment was low key and not overpowering.   I selected it based ","useful":0,"cool":0},"q4MIhAULJVwnOqyaGYKexQ":{"text":"3.5 to be exact. Very friendly server. Po boy was good- this was my first fried shrimp one","useful":0,"cool":0},"Nzjobumt_OFTh7m4qQBZCQ":{"text":"Ehh it was blah. I had the grilled chicken which came with rice and seasonal veggies. The ","useful":2,"cool":0},"a7AUV0Y49QZL4ZNvNPXErw":{"text":"Happened to be staying at the adjoining hotel La Galerie over MLK weekend 2017 and went fo","useful":0,"cool":0},"k4BjN1oACIZyvjLN6MK4XA":{"text":"A nice low key breakfast outside of the French Quarter. I ordered the Crab Cake Benedict -","useful":2,"cool":2},"nCX3qKFeBkPkVnZy-OZN6A":{"text":"A small group of us tried them for lunch during week of St. Patrick's festivities -- must ","useful":0,"cool":0},"0xp61TWFrBlrrDlvR_atyw":{"text":"I specifically searched for a creole restaurant on our NOLA trip and I was happy to have c","useful":1,"cool":0},"Wz0m7IWSRPDMsJrJbtAz5A":{"text":"Good food. Boudin...not sure how they compare to other places but these were very good and","useful":0,"cool":0},"e3l58CX5dAFk2jy0UDN4gg":{"text":"Best thing I have eaten in New Orleans. Would love to live across the street just for the ","useful":0,"cool":0},"dZ3Zb0F8i9Yca0hQe6rYLg":{"text":"I had an hour to kill before catching a cab to the airport, so my hotel directed me to thi","useful":0,"cool":0},"FRjKLJfUNmC1G072gH9HrA":{"text":"The sports bar vibe isn't really my thing, but the food here is amazing. I highly recommen","useful":0,"cool":0},"lCMyVIsNSDWzQ9U7BVYCFw":{"text":"We had just pulled into NO and my G/F HAD to go watch Kansas play in the NCAA tournament, ","useful":0,"cool":0},"_JySHNCBiIA2sMBCpcer8Q":{"text":"My friends and I were visiting New Orleans and we're looking for a good place to eat. We h","useful":0,"cool":0},"-uY5_Kxq0obFwPJjmZokGA":{"text":"Great service and yummy shrimp and grits. Bread pudding with bourbon sauce was wonderful!","useful":0,"cool":0},"5WIxKStS3nP6hjHqe-08zQ":{"text":"Ate here my first night of being in New Orleans. \nEverything we had was really good with t","useful":0,"cool":0},"yT7A82znhKr2RcBWz3UqtA":{"text":"We hit this place up because I was wanting gator, but holy sh*t did we choose wrong...\n\nMy","useful":2,"cool":0},"GQIPJ3SdqfA-X2wG1I82Ag":{"text":"Went to Huck Finn's for dinner while visiting NOLA for a conference. I ordered the Jambala","useful":2,"cool":0},"mlZx4o6npPoMTBqIeirOUw":{"text":"We were excited to try this restaurant. The food was cold, also the food is not worth the ","useful":4,"cool":0},"tATTg2Fg7gC6ZVFwPPWvTA":{"text":"+ touristy, but still tasty food with the NOLA staples. Alligator piquante was a good twis","useful":1,"cool":0},"ODHtRpGmSOrXQgXQYZQ7Fw":{"text":"Great bar to catch a Saints game when they are on the road.  This is a planned destination","useful":0,"cool":0},"vRuzBI7SrK7HoE-nSYsL1g":{"text":"Live music was great, food was ok, service was fine.","useful":0,"cool":0},"vrUw_kNyY31CE_dtnkbdug":{"text":"We all ordered something different an it was all amazing food! The red beans and rice were","useful":0,"cool":0},"MYXQ2CUmOI5xhnM4REJOfA":{"text":"Huck Finns was pretty good overall. Not amazing food (except for the out of this world bre","useful":0,"cool":0},"rgmzCsql8Adu24xIUipcTA":{"text":"The jambalaya wrap was excellent, as well as the chicken gumbo. The service was friendly a","useful":0,"cool":0},"rYq-C4o2ecpYkHf3CXcuQw":{"text":"We were sent here by the hotel we are staying at -- Gumbo was horrible - tasted like a sal","useful":0,"cool":0},"LabKkARhSoyTRqd-SzNEwQ":{"text":"Service is amazing the staff is friendly and talkative and very helpful because of the sta","useful":0,"cool":0},"qtKcYy4jxz-Cwh7kBzg17g":{"text":"I am truly shocked at the reviews.  The service was great!  Our waitress was wonderful.  S","useful":0,"cool":0},"PCRw3lAnJ1zkf2xsvu4Qtg":{"text":"The Shrimp in grits was good not fabulous but good.  I wouldn't say the service was great ","useful":0,"cool":0},"3dFhyrXWotSFwovWL40AzA":{"text":"Great New Orleans restaurant and great staff. We ordered a cup of gumbo, jambalaya, shrimp","useful":0,"cool":0},"GHxfxJAcNSD02NVvdut7dA":{"text":"The crawfish po' boy was pretty good, as was the fried gator. Two others in my party order","useful":0,"cool":0},"tqIQ9Cz8SuFOhuvAHQgo3g":{"text":"They have lots of TVs and an impressive menu. Everything we ordered so far has been great.","useful":1,"cool":0},"0Sh9K68RBA9GVHlGHsNQ2w":{"text":"Went for breakfast, and I gotta say, this is one of the best places I've eaten at in New O","useful":0,"cool":0},"8kVBjheHOFjcwL_-sktyAA":{"text":"This basically did the job. We were hungry and could understand everything on the menu so ","useful":0,"cool":0},"j129f6d-8hAmq2A78AiNqw":{"text":"red brick interior walls, stone floor, big windows letting in the sunlight.  fish tank on ","useful":1,"cool":1},"_FaD9Fo-MH2mFsLkK6JjKQ":{"text":"We went here for lunch on Friday august 8th. 3 of us ordered jambalaya. It was terrible. R","useful":5,"cool":0},"lyiP-riHRpsB075mvfMDiQ":{"text":"Really really good. Still killing me with no Sweat Tea but the red beans and ride are outs","useful":0,"cool":0},"ot6r4uDWJXx27wl29Rl5qg":{"text":"Went here for breakfast. I ordered the crawfish breakfast skillet with eggs, potatoes, bel","useful":0,"cool":0},"oAtu8AjXsrYQoaw5_ssbAg":{"text":"This was so good, I went back twice! Food was hot, fresh and very tasty! Service was that ","useful":0,"cool":0},"eGqKtHC0vJRdirSNi40wug":{"text":"Decent local fare food and drinks. Good place for sports watching. Plenty of big screen TV","useful":0,"cool":0},"wzC7CguZ1_6L2R0ZAg5ctA":{"text":"This is a wonderful place to eat. I had a cocktail called Gator Bite and they did not skri","useful":0,"cool":0},"NHqDH4OY68RJFPRTEZDmOQ":{"text":"We stumbled upon this on a Sunday evening when our other plans fell through.  We tried Tch","useful":0,"cool":0},"ejKAJLxr9aCYLl6b1lYNeA":{"text":"I first came to Huck Finn's the last time I was in New Orleans and I remembered a tasty ex","useful":1,"cool":1},"13hyIalROjClT_335gB0sw":{"text":"On a hot day in June, all we wanted was a place to eat that had air conditioning - but we ","useful":1,"cool":1},"fptdNVUBndAjHjKdfgrPbw":{"text":"Stopped by on the way to the trolley after the French Quarter Festival and was enjoyable. ","useful":0,"cool":1},"MvBkuXRzzwB5TOav-fsMyg":{"text":"We visited last Wednesday night. Our bartender/server went out of his way to make our visi","useful":0,"cool":0},"838qJQgSu1bAwLWw4-ju3Q":{"text":"The fried alligator was great, as was the crawfish ettoufee. The jambalaya and red beans a","useful":0,"cool":0},"G2m9sb-6y-MEGly2A1uHFw":{"text":"Service was slow and the waitress didn't let us know she was busy, so we figured we'd been","useful":0,"cool":0},"z-4n4BpwXayW44-_i5FY9A":{"text":"Really enjoyed this place. We wondered in with our large group after our original destinat","useful":0,"cool":0},"4BBooLNO9PaalBEI6nRqsg":{"text":"Below average food. Poor service. Did not get coffee till after my meal, then it tastes te","useful":0,"cool":0},"9_baE-zJBzz0Apluxf85Iw":{"text":"Stopped by for dinner after seeing an ad in our hotel. The blacked redfish was AMAZING, an","useful":0,"cool":0},"1bxD_brqFdL1fZ74Z6ZLOQ":{"text":"They open early at 8am for breakfast but I'm not much of a breakfast person so I've only b","useful":6,"cool":1},"sGLdEQ8gA1lhvxgpASyzsg":{"text":"The happy hour drink special is good to go BUT they will DEFINITELY NOT give you the 2nd d","useful":0,"cool":0},"7sbgV_Dbs4rvr4WaT2UxsA":{"text":"We stopped in here to eat during Mardi Gras because I wanted to try some cajun dishes but ","useful":0,"cool":0},"80Ot_bzbO7wBB38m11KbIA":{"text":"My husband and I came here twice on our most recent trip to NOLA.  The first time we were ","useful":0,"cool":0},"5ZEfWnEylryz76Z6JQhP5g":{"text":"Kevin our waiter was the best!!  He instinctively knew what we wanted ahead of time and ke","useful":1,"cool":0},"Ctu40ZnGZCrRKmHJykQoYg":{"text":"Delicious breakfast right next to my hotel. Quick and one of the best biscuits I've ever h","useful":0,"cool":0},"f20rp0hGYg5pXTI4qP90Aw":{"text":"The food here was great and the employees were very friendly. Be sure to download the Yelp","useful":0,"cool":0},"jRmNbBcr5NtIupnNbWXBRw":{"text":"Let me start by saying that I and my corporate partners have always enjoyed our experience","useful":0,"cool":0},"AdqMhBR06NMsnsut0bnTuw":{"text":"My fiancé and I were looking for something filling, decent and quick. We found it here. \n\n","useful":0,"cool":0},"a34Uw7MmANBvbz8zvOXMLA":{"text":"friendly service. yummy shrimp etouffe and bread pudding. i will be back if i come to the ","useful":0,"cool":0},"CuZhltPW1BjR7X6BhGfEjw":{"text":"Order was delayed,  server told us that the boudin  balls didn't look right.  Brought us o","useful":0,"cool":0},"Id1YAnik1Lh32WRiEPDVHA":{"text":"Had lunch there yesterday and it was great. We had gator starter then I had the oyster poo","useful":0,"cool":0},"SieTj6DWaVdri4y4SZyHDw":{"text":"This place is great for a good fast and cheap bite to eat. It isn't anything spectacular b","useful":0,"cool":0},"IlIWFwdEf70G2Qwf0Byh5g":{"text":"If I could have given 0 stars I would have. Service was terrible and food was mediocre at ","useful":0,"cool":0},"4OR7l0AzAOWmYPUQEpymCQ":{"text":"Wandered in after long day of being a NO tourist. Hostess wasn't the friendliest, but our ","useful":0,"cool":0},"3NuV7-vjunPcfOVjWaQiiA":{"text":"Excellent service. Had muffulettas and the server worked with the kitchen to accommodate f","useful":0,"cool":0},"7GPg5n_3Cf0L4SyhRTUnuQ":{"text":"They were very accommodating for a Family gathering for 30 people . Food was delicious ser","useful":0,"cool":0},"IWGXyTrJvPcFPPq7k5FIyA":{"text":"Came in for a quick drink with my mom because we are staying at the La Galerie which is ri","useful":0,"cool":1},"AQ_cn-yMGUXV8SwURnSZvA":{"text":"Excellent service and great food. Loved how this cafe was tucked away from the hustle and ","useful":0,"cool":0},"Tevt5-PK9wsKtHucoj5-2A":{"text":"Please note - This review rates the business primarily by it's service and not food becaus","useful":2,"cool":0},"S3hjR1_83zuCi1t38K7QTg":{"text":"Pretty good service but the food was average. We liked the TVs as it was March madness.","useful":0,"cool":0},"iSqEbb-R04AnGsJAafZ01A":{"text":"Our food was great! Anthony was our fantastic server, he recommended the NOLA Blonde beer ","useful":0,"cool":0},"_bFIsbkg8xL-9lr4KegJlQ":{"text":"As a born and raised New Orleanian, I truly think this place is a slap in the face.  There","useful":2,"cool":0},"VjmqoKPvw_UoXKoYjBariw":{"text":"One of the worst restaurant experiences I have ever had, at 5pm on a Saturday. There was n","useful":1,"cool":0},"pQLsK74fk6y-Q9jbHvOEcg":{"text":"The seafood pasta and bread pudding were both amazing, and service was excellent! Very qui","useful":0,"cool":1},"v-yYNzHIa49j_OlfzI2O-g":{"text":"The seafood gumbo was excellent. My wife had the crab cakes and they were delicious. The a","useful":0,"cool":0},"Fy4AB7whmF07a9kZ6zI5VQ":{"text":"Seriously awful. Crawfish Etoufee had no crawfish, jambalaya was bland and cold, and the g","useful":0,"cool":0},"z1yJrukCTik87swzKhCfvQ":{"text":"After a long wait, I was very irritated and ready to go. Carl was our waiter and was very ","useful":2,"cool":0},"5B2eQDh_v6AGPvZleuhuWw":{"text":"Tried to have breakfast here on a Saturday am before a tour.  Omg. They were out of coffee","useful":6,"cool":0},"gjs-2xVpeDPn9p-E6sxrxg":{"text":"I'm on an academic trip from Miami, FL, and I had a great experience at this place with my","useful":0,"cool":0},"xKPnb3RcXEkys5iI8dMDcA":{"text":"We stopped in here for quick breakfast before heading out to our swamp tour. This location","useful":3,"cool":3},"mhjXBvkmQfCBJroTIqQLQA":{"text":"I new I wanted to start my NOLA experience with an authentic po'boy & Huck Finn did not di","useful":5,"cool":1},"l5CnhXRUI3_-P06B6uB60Q":{"text":"Omg I had the NOLA BURGER.. IT had a beef patty and debris on it (debris is roast beef and","useful":1,"cool":1},"T5zRpwSjVmtP4XLCopmPug":{"text":"Just off the main streets of the French Quarter, Huck Finn's Cafe was the perfect retreat ","useful":0,"cool":0},"Q57wAzZqsogEHCjoUJcaxQ":{"text":"I'm a local- and they have a great breakfast menu. Shrimp and grits? Yes please!","useful":1,"cool":0},"1c84ztqYXwPz1GV8__cLJw":{"text":"+ nice waitress\n+ good catfish platter\n+ delicious burgers","useful":6,"cool":0},"eRExqsMo8EtoDONq5lIESg":{"text":"We were here for a few nights and decided to try Huck Finn's Cafe.  Best decision ever due","useful":0,"cool":0},"yd7IPzVMCW2DjeCM2qzydA":{"text":"Nice new sports bar in the French Quarter that was NOT charging people for the Super Bowl ","useful":5,"cool":5},"h6OuYwbOJVNtnVJUwgm3sg":{"text":"Well, let's start at the beginning. The hubby and I were going to be in New Orleans for Ye","useful":4,"cool":1},"r6pb88vGsUDKHP5OPJRt5w":{"text":"If I could give it 0 stars, I would. Came here with a party of twenty after a work functio","useful":1,"cool":0},"TY3L2Wb8jSBlyutf6YoEYw":{"text":"The entire team is amazing. The manager, Kyle Crochet, the busher Ashton, and the servers ","useful":4,"cool":0},"YTPBREXwGTCTfltz9iA9NQ":{"text":"Can we not?\n\nWe should just not. At best the food was mediocre. \nDon't order the fried cat","useful":88,"cool":10},"w-QVQpmbUuoLJQ2H9nxOJA":{"text":"Racist establishment with subpar, mediocre food. Their catfish has a terrible after taste,","useful":15,"cool":2},"OyA-rfjrvEOHvWdKz6bJDA":{"text":"I told myself before I went to New Orleans that while there, I would take as many opportun","useful":1,"cool":1},"s6H8ilFxbEtYoH2OkgwaFg":{"text":"The highlight of our breakfast here was our waitress, A.J.  She was friendly, upbeat, and ","useful":1,"cool":2},"46OhpNG-yXpLLzfYn32tdQ":{"text":"Did not even know that it was a sports bar but stayed in the connecting hotel last year an","useful":1,"cool":1},"yG3AntwYFqbHDUuhZqnC-g":{"text":"We stopped in for breakfast before walking around the French Market.  It's easily accessib","useful":0,"cool":0},"VJREXUxAjvX8dCCvFPWQSg":{"text":"Popped in here for a late lunch, just because it was next door to my hotel. I sat at the b","useful":0,"cool":0},"7-idCOn3hozJJfORTXg9MA":{"text":"I joined a group of colleagues for lunch during a conference. I ordered the BBQ pork nacho","useful":1,"cool":0},"W-rEhLcpgHC37xYvoaG-Mw":{"text":"My family and I (8 total) visited New Orleans. During our stay we decided to eat at Huck F","useful":0,"cool":0},"wPk6qQBra1uMmd97LFbHBQ":{"text":"I came here on a Monday night (not busy at all) with a group of ten. The service was good,","useful":4,"cool":0},"tDYK_cKCrZmWY3xf8rV_Ig":{"text":"(Visited Jun 7, 2016) Wandering lost in NOLA looking for the place where we had planned to","useful":0,"cool":0},"pe5OhxWOpWNH-13I3eRqUQ":{"text":"I am trying hard to find something positive about the place and am struggling\n\n\nService- O","useful":8,"cool":0},"dcKLCZ6Zh4HSnEymZnNE-A":{"text":"This is one of the first restuarants I  went to during my stay in New Orleans. The food wa","useful":0,"cool":0},"qH74Zia-o89eeRVMJP67mA":{"text":"This was the first place I ate when I flew into NOLA. Just passed it, and thought we'd giv","useful":0,"cool":1},"_Lkkgpp6jsXJ0PnZ9H_slA":{"text":"Let's start with the pros. \n\nThe food was decent and the service wasn't bad. I got the jam","useful":1,"cool":0},"rh3nVcMh4KBAi6iAeMWHiA":{"text":"We were given a recommendation for this place last year and have been here twice. Was not ","useful":2,"cool":0},"rjrbLfnxdtAzDhJcTpj4WQ":{"text":"There were two tables seated in the whole place. It wasn't busy. It was 2pm. We were seate","useful":2,"cool":0},"e6X-unkZqXeo3UUkiMtKTQ":{"text":"Out of all the restaurants in New Orleans, this was my favorite. My only complaint was tha","useful":1,"cool":1},"Qktce2HAs6thnJRk6TZQPg":{"text":"This is one of the first restuarants I  went to during my stay in New Orleans. The food wa","useful":0,"cool":0},"hNg1HtmdCh3sVjFVOD6tuw":{"text":"I intended to have breakfast at Marjoria's Commerce but it is closed on the weekend. I hea","useful":0,"cool":0},"KJZqbUdyEO0UQrCQDKpB2g":{"text":"Our server, Tashonda, was delightfully entertaining, knowledgeable and her lunch recommend","useful":0,"cool":0},"IcCCy5u9LAj8H48y8F70Pw":{"text":"So very bad.. Worst po'boy I've eaten in Louisiana for a hefty price.  Ok service.. Not wo","useful":1,"cool":0},"hDS2ufGRepOtYguCeIMd9w":{"text":"Three of us dined on December 28, 2016. Our waiter John J was very knowledgeable, super ni","useful":0,"cool":1},"VZTMjJ3VM_UT0VGnaDWKPg":{"text":"I cannot wait to return to New Orleans so I can stop at Huck Finn's for breakfast!\n\nWe got","useful":4,"cool":0},"BPGA2aT6_hMCr9X5Y1xUhQ":{"text":"This was my favorite place to eat in New Orleans!\n\n I had a free map of the French Quarter","useful":2,"cool":0},"R7iqlmtCAUMkkGOGv2XxFg":{"text":"Really good happy hour! hurricanes & lemon drops . Our bartender John from Wisconsin was v","useful":1,"cool":1},"vYK-XtFkwmKy3M87puT-ag":{"text":"Got here at 11 today (Saturday) Disappointed that we couldn't get breakfast. Our server wa","useful":2,"cool":0},"Q9yTmAD9i4bdJ88umfSoRw":{"text":"I ate there twice - beans & rice the first time, which was pretty good, and jambalaya the ","useful":0,"cool":0},"dhoCIw54M1ZlNHZaIGrAug":{"text":"Had a really good experience here. The food was great our waiter, Carl, was very polite, f","useful":0,"cool":0},"l8ytx-kYHB3HnlaHlafpzw":{"text":"All our food was poorly made.  My friends and I went for dinner,  we had the new Orleans s","useful":12,"cool":2},"HdgiG9yO2zJOKrKQbpjyGA":{"text":"This place was probably a place I would have rather passed on. The gulf coast omelet was j","useful":10,"cool":0},"Nk474Geys2ub4mQSJ2BU-A":{"text":"I'm writing this as I'm waiting for my food. Know why? Because there's only one waiter for","useful":0,"cool":0}}