{"MTMLc8JrSV_oev4EhV3MJA":{"text":"Bad. Bad, bad, bad. This is a very bad restaurant. The music is good, the food is decent, ","useful":6,"cool":1},"wJOq9GXFrIAKBZrIVoaSPA":{"text":"Great music and a cozy atmosphere. Didn't get a chance to sample the menu but the relaxed ","useful":0,"cool":0},"N_9NgXYtV3jy1rIM3WlJHQ":{"text":"We visited Maison last night mainly to hear Smoking Club Jazz Band.  Because we knew it wo","useful":2,"cool":1},"WSavwc6j-t9nC0HU1TexnQ":{"text":"If you've spent a couple nights hanging around Bourbon Street already, Frenchman Street wi","useful":1,"cool":0},"wtFjWSrRSmu4a9Td1X41Qw":{"text":"I gave this place 4 stars because the service was awesome and the live band was great! We ","useful":2,"cool":0},"4xI80PgVziJn5oevR05YwQ":{"text":"I really dig this place.  It had a great vibe the night I was there.  The band was playing","useful":0,"cool":0},"O6EaojrubIh7avYqqiLqKw":{"text":"I don't remember much but what I do know for sure is that my friends and I had a funnnn ti","useful":0,"cool":0},"I_8fLWOZIQ6cUkh3xSMhWQ":{"text":"Hey everyone, we tried to go into this bar and the front girl, Brittany, turned my friend'","useful":0,"cool":0},"xjWVHXJzUA2jWABuaUvm-w":{"text":"We just walked into a gem! The music was live and on fire! The crowd is revved and trust m","useful":2,"cool":2},"AHNqVfNJsyGFzNpkaFClXg":{"text":"What a cool place to hang out.  All of the other clubs were jam packed on Frenchman street","useful":0,"cool":0},"hIRQVNvAim_XB-cF1mHmIw":{"text":"Need to reserve on the weekends it's a great place amazing vibe! Drinks are phenomenal! Fo","useful":0,"cool":0},"MtP2vdg9Xh5iGHzn2SDX7A":{"text":"After checking out a bunch of places on Frenchman, we settled on Maison and ended up stayi","useful":2,"cool":0},"mUvHu6gzb20wg6fxmX_H4w":{"text":"A great place to visit while hanging on Frenchmen street. Enjoy good food and drinks while","useful":1,"cool":0},"G6-fvGGkL6asC3WHVAlltw":{"text":"The food is not that good. Although I did like the french fries which were cooked in garli","useful":0,"cool":0},"PWTKmHxySIM9lRVMZIgpqg":{"text":"When we came the music was great, drinks were great and the crawfish pies we had were deli","useful":0,"cool":0},"5WLCKHXnFfU1yONSkWD6Zg":{"text":"I wish I could post a video of the band I saw here the other night. Apart from the amazing","useful":0,"cool":0},"JKYhMOCimRRa1lMM2BfL9Q":{"text":"Loved the music here. We saw The Business, a funk band. They were off the wall good great ","useful":0,"cool":0},"U6Vto52AvWwMlktMM5XXmw":{"text":"Went first on a crowded Friday night, bartenders were amazing and extremely attentive. Mui","useful":0,"cool":0},"-ciL29hSO4HWiR9YKNtmag":{"text":"This place was pretty good. We didn't know where to eat and this place was the only place ","useful":1,"cool":0},"-K3coYWZ5zBUCihe48qFEA":{"text":"On the best street in New Orleans (I really love Frenchmen Street) lies Maison. One of the","useful":0,"cool":0},"0fpuhJdSbX6C4BAJAAUjqw":{"text":"Real laid back place. Alligator bites were great... Drinks are a bargain too. Helped that ","useful":3,"cool":0},"O6XINlj2qoq9g2lmdSHvxw":{"text":"It's just one of those placing you keep going back to over and over.  It's unexplainable -","useful":0,"cool":0},"c5xF2Kj9hc6LantqM1YfQQ":{"text":"Maison is great fun. The Jazz is diverse and very entertaining. The staff and service is v","useful":2,"cool":0},"y8UCXFltHf_QKY1k_2ddjg":{"text":"A wonderful blues/Jazz bar. In the middle of afternoon we heard a great music- went to the","useful":0,"cool":0},"6btVo6wM50rLy_X4haZxhg":{"text":"This may have no bearing on the place overall, but tonight, the music was good. I was a ch","useful":0,"cool":1},"sZ6YLw1k8DMlLmEbMnib8A":{"text":"Bar restaurant spacieux et à l'ambiance tamisée (sombre), qui donne un côté sympa pour une","useful":2,"cool":1},"vrbgaTJ9XfWCD_-XAS7fww":{"text":"Want to grab a bite this morning and heard a band from outside, so like moths to a flame w","useful":0,"cool":0},"yNznsEz7GIMc29P1yHwYRQ":{"text":"The service was fantastic, the food was great! The pork chops were awesome,and the gator b","useful":2,"cool":0},"zG0jFd3m3GrMFh9jgxyyMA":{"text":"Mannn I loved this town!! What a fun place.  Only downside is, they wouldn't let us in wit","useful":3,"cool":0},"uMYyayknOiJLcki69xTEzQ":{"text":"Awesome free comedy show in the penthouse on Friday nights--check it out!  Walking by one ","useful":1,"cool":0},"PBJq_-daTfW0P_o8GSuNFA":{"text":"The Jazz Vipers were very good. Some great New Orleans Jazz, especially the Clarinetist...","useful":0,"cool":0},"EnyxDew3vJbfoqt0_fXEjg":{"text":"Midnight on a Thursday night - not too crowded, which was awesome.  We really enjoyed the ","useful":2,"cool":0},"KMPVzJCcB2zHz9LhuOFjeg":{"text":"Madison is the place to be during a lazy bar day for their small bites and wonderful drink","useful":0,"cool":0},"StIiCoaF2mo7uMfAYksAKg":{"text":"The line to go inside went quickly.  The band on the first floor was lively.  There was a ","useful":0,"cool":0},"BxsCILaD_V2EIEUhZCZsHg":{"text":"This review is for their Jazz Brunch. All I can say is it was amazing!! The food was great","useful":0,"cool":0},"GgCa4HUj2HHr_ia7K8l2eA":{"text":"The band that was playing that night was very good, excellent jazz music.\nThe food was gre","useful":0,"cool":0},"odpMp1oeQf0FtvWhvI7JOQ":{"text":"Nice staff, solid music, only had sliders as a snack but they were good. \nDefinitely a goo","useful":0,"cool":0},"gsMeQiQTL9ERM7ixjArV4g":{"text":"Great Latin dance night- mix of reggaeton, salsa, bachata, merengue, & hiphop!","useful":1,"cool":0},"ESf3q6ZXb2j_a7vR2kVMqQ":{"text":"Hate to say....but NOT coming back. \nI know my review will be an anomaly....but I've been ","useful":0,"cool":0},"IwvhCtaA_DYKN7D1QA7XkQ":{"text":"Great place to listen to live music, have a great meal and dance the night away. The menu ","useful":0,"cool":0},"A_bKowX4RdZw0j0PWp_VQw":{"text":"One of the best music venues on Frenchmen street! I came in to watch the Street Legends Br","useful":0,"cool":0},"Z2oD2IhZG7M_3fgROwQf-A":{"text":"Monday night and they were pretty packed!  \n\nLuckily there was no wait for a table.  I thi","useful":2,"cool":2},"8loT6Q_oyM2DUGpD_CqAUA":{"text":"Had a great time here. We sat for table service and our server was really great. We got th","useful":2,"cool":0},"-zq2zUGyq6gk3vIT-bc8RA":{"text":"Lovely, well-maintained club and a classy band-- elegant older gentlemen who really rocked","useful":1,"cool":0},"c9PXR6YQKRjJQFBIABJcjg":{"text":"Gator bites were phenomenal, Etouffée was perhaps a bit too salty but otherwise flavorful.","useful":0,"cool":0},"BRIrq682tMjtBVCw3pwBEg":{"text":"Great place to see live music!\n\nI have been to New Orleans at least 15 times but had never","useful":0,"cool":0},"byYK3KTLcR-cST0CzrhvFg":{"text":"Fabulous food and great service, excellent drinks, and the best jazz band.  The best so fa","useful":0,"cool":0},"VxDWZE2j-Iv48ax-jfnUzQ":{"text":"2nd night in a row here! Great staff,\nAmazing drinks, tasty food and fabulous bands.!!!","useful":0,"cool":0},"6xFfv0Y2j-YdBHgw8x5AZg":{"text":"Went for live music and obviously to get one of the t-shirts which are include instruments","useful":0,"cool":0},"nbhDUwSg1L00drGp4pIKNA":{"text":"Walking down Frenchmen Street we heard some swinging Ragtime music coming from this place.","useful":0,"cool":0},"kNthi3b3KeodaRksvIBbSw":{"text":"Had a drink, danced for a bit while the \"real\" swing dancers took a break. The apple cinna","useful":0,"cool":0},"hx0xbFoWs6nr9lJ5IFWGow":{"text":"Best live music in NOLA, especially The Big Easy Brawlers! Came here every night during ou","useful":3,"cool":0},"50uwXUF6M3WrW6VfpFVgwQ":{"text":"On the Frenchman St. strip of music joints, I think Maison takes the cake.  Plenty of room","useful":1,"cool":1},"UpU8MTIsk4y2kXaN4WBwqw":{"text":"this place is awesome! while it can get ridiculously crowded, it's worth it to make your w","useful":3,"cool":1},"WBFc2OXH7rAyUWp79mLtXw":{"text":"Maison rocks.\nOur Jazz Fest Quatro ended up here twice during the weekend.\nThe first time ","useful":2,"cool":0},"bTcp-B2tR8KeVCI2m0MaDw":{"text":"Awesome music and we got the chef's trio appetizer which was great. I got a sazerac though","useful":0,"cool":0},"hnakBw-09uFfkVFxUNvZiA":{"text":"live band\npirates\ndrinks\nyes.","useful":0,"cool":0},"HVZFYFJOrFC5ttH7jKSJkg":{"text":"Make sure to check out the 3rd floor...I'd been here a few times and didn't realize that t","useful":0,"cool":0},"n_e2IRvGX_NpQcn761-few":{"text":"Music was 5 star, and dessert was 3 star...as for the food, I didn't try any. Maybe next t","useful":0,"cool":0},"zHgFbGrhbbl0w3RlKEZtDw":{"text":"Their food system is a bit weird, but I was still able to get a decent sandwich while they","useful":1,"cool":1},"vbU4tWdfA_A7gxKeA0EatA":{"text":"I found a $65 Groupon to take a mixology class for 2. The class was 'supposed' to start at","useful":0,"cool":0},"FI9sXECR_ou0p_pS2xC4Dg":{"text":"Big Easy Brawlers held it downnnnn! Nice local spot to chill at on a visit to the N.O.","useful":0,"cool":0},"s9jbQyCn2p_SDc7o55GXRw":{"text":"We really enjoyed this spot! We were encouraged to come here for the live music, but still","useful":1,"cool":0},"5bdaRiIBW5unf_7xsg0Fsg":{"text":"Maison is a pretty cool spot. Good live music, and a well stocked bar. Prices could probab","useful":0,"cool":0},"yq-wP_ARWOJDdyesAzIBqA":{"text":"Love it within 5 minutes!\nSurvive from the great beauty Aretha Franklin followed by Killin","useful":2,"cool":2},"qFrTx4E0PlJi3b8zuYslow":{"text":"My husband and I attended the Grayboy Allstars show on 4/23. Now, if this review was just ","useful":0,"cool":0},"WXseDXBHtFgfdchjSqK-lQ":{"text":"Band had a ton of energy with more of a Latin feel. Good place to teach your boyfriend how","useful":1,"cool":0},"jX1w1eMA8tOhn842lL-qbg":{"text":"Great live jazz music! Service was a little slow but we only had some drinks.  Didn't have","useful":1,"cool":1},"c_veV1oy2GV9QV0ij1qCww":{"text":"So - I booked VIP tickets for New Year's Eve celebration on Frenchmen as I had decided to ","useful":0,"cool":0},"NdrWm4t3AdkvWComGU4_Bw":{"text":"Music was great, lady at the door didn't seem interested in seating anyone, in spite of lo","useful":2,"cool":0},"CTMBf8PFStZgudx8AhEUQw":{"text":"Do not miss this place for Sunday jitterbug brunch! Great music, great food, great service","useful":1,"cool":0},"8WKRcFLLYbeAB6939kNU5w":{"text":"Great food! The selection/menu is a bit limited with the typical Louisiana staples. Good l","useful":0,"cool":0},"WI2sS6ZOrsuKg_o4q4CRVA":{"text":"Great music!!!!!! The New Orleans Jazz Vipers were awesome!!!!! Oh, and the food was just ","useful":0,"cool":0},"Akgdz0QbmWupr-VjzjsciA":{"text":"Awesome food,,,,awesome music,,,,no cover ,,,,enjoyed the alligator sausage,,,,the pork bb","useful":1,"cool":0},"BTjtlVYc8zYVxr2eQpqrgg":{"text":"Really nice bar with live music, gets a bit cramped during weekends but we loved it here. ","useful":0,"cool":0},"QJohxurlx1uWVH-XGP3dtg":{"text":"Wow. Completely disappointed in this New Year's Party. We bought tickets for open bar til ","useful":1,"cool":0},"Vksm6ydxdciJGa3ShLMk_w":{"text":"If New Orleans were the night sky Maison would be my North Star.  This is always the first","useful":4,"cool":1},"BwNnPkbRzYe3b_SsoPT7MA":{"text":"Great music! The drummer seemed bored at first, then he busted out a sweet solo. I enjoyed","useful":0,"cool":0},"X3tqpr_RkapLLMDMXd0qfA":{"text":"Good place to see local music and grab a drink.  If you want extremely high quality music,","useful":1,"cool":0},"ZP0bpnaCTLzJPFjdi9c6yQ":{"text":"Jazz and zydeco club. We try to go to Frenchman St whenever we are in town. Eighth Dice Cl","useful":0,"cool":0},"RZ3kLjjom5UyyG1-SBc-3g":{"text":"A happenin' club on Frenchmen. Think we had tequila shots. Good live band on that then par","useful":0,"cool":0},"o6IztaXyzp5FreFyOC7DFg":{"text":"My fiancee and I had a wedding reception here and used the two upstairs spaces.  We are fr","useful":3,"cool":0},"5OZ0XQuZM9G3f3yoSzXTew":{"text":"This was such a treat for a non-touristy place. \nWe attended the Mixology class and got to","useful":0,"cool":0},"mOo_rfZXwoAeKbcqMKupoA":{"text":"We has live music that was really nice .\nWe had dinner there. The hamburger sliders and th","useful":0,"cool":0},"hzAayXMm3FgLtysW-Q_9Pw":{"text":"I absolutely commend this venue's sound manager.  It was the perfect volume to watch some ","useful":2,"cool":1},"VKPfQIk527MeSZ35ilPi8g":{"text":"I have to be honest... I don't know a thing about jazz music. I'm an LA girl now living in","useful":0,"cool":0},"8cuhLiDPzskFyfZutca4Kw":{"text":"Service was incredibly slow. Ordered multiple dishes, every dish was super salty, to the p","useful":0,"cool":0},"QXx25hXA2QV5YL_U_OoPcw":{"text":"If you're visiting New Orleans, then Frenchmen St is one of the places you want to spend s","useful":1,"cool":0},"NRZfLmnHpDcQa5TU94S5gw":{"text":"Loved it! Went to see a friends boyfriend play in his jazz quartet and the venue was the p","useful":1,"cool":0},"ozDmCZChx1wSseV6QYBwXA":{"text":"For some reason whenever I see the word infused prior to the word vodka my eyes light up l","useful":4,"cool":1},"9CA34MEuXrLUE_NpV6__xQ":{"text":"Great spot with live music and delicious food! The jazz band was really good, and had a gr","useful":3,"cool":1},"Vie4mX45vbwMu106tFvICQ":{"text":"Spent my entire trip to New Orleans here. Great music and a great group of people. Drinks ","useful":0,"cool":0},"bhzAeRQyolYzioeQhBdl6Q":{"text":"Hooray! They have food! And it is delicious! Can't believe it took me so long to figure th","useful":9,"cool":5},"-s9YGoWcsjCMBbGhqTTTmA":{"text":"Phenomenal band. All the drinks poured at the back bar were basically half liquor so bewar","useful":1,"cool":1},"ZKDD8qB69NAOo4LoQ3NpTQ":{"text":"I had a great time.  The food was really good, not just plain bar food.  They seemed to ha","useful":1,"cool":0},"79qF2qiSrGaTGl1jB90Xmg":{"text":"Cabaret setting with red lights shining on your small round candlelit table. They may take","useful":0,"cool":0},"BWZra7Hjx_bEcCsb26A_-Q":{"text":"A larger venue in the area.  Came here for a late night dinner.  The food was fairly stand","useful":0,"cool":0},"tKtDs9coUPyOk_oPN5Vp5g":{"text":"Zero stars actually. I ordered a gin and tonic and ingot a whole lot of tonic but no gin. ","useful":0,"cool":0},"E-Smy7SE4joOjPgt7Tq_rA":{"text":"I love this place. I go to Frenchman for live music every time I go to NOLA. It just can't","useful":0,"cool":0},"Km0w63Sg-ncGYMnoPWINGw":{"text":"Overall I think this is a great bar but not a great restaurant. \n\nThere was a wait when we","useful":0,"cool":0},"6dCanOVLbDWfzoZnZQlCYw":{"text":"If you enjoy live jazz music and a great time, check out Maisons. Sometimes they do jazz a","useful":0,"cool":0},"cMK8LB_GNXSBKCkWN7N0Mg":{"text":"Checked in at Maison when my wife and I were hopping around Frenchmen St. We were drawn in","useful":0,"cool":1},"VOXJm8sb-evQEdLaN67OMQ":{"text":"We made reservations to catch the Swinging Jazz brunch in this cozy little venue, and had ","useful":0,"cool":1},"iuqwhcarffEegHCQ_gyoaw":{"text":"The Spot:\nWhen visiting New Orleans' Bourbon Street it becomes quickly apparent that the w","useful":0,"cool":0},"lqURqFowLaU1aOWQjL3KOA":{"text":"So from a music standpoint the place is nice but the food is poor. The waitstaff was nice ","useful":0,"cool":0},"QoKAQDoNf8KJNSstZcB31g":{"text":"This place is fantastic for live music. You can either sit at the bar, or you can get a re","useful":1,"cool":0},"0GRpjHBmPZbeT6JhFYof4w":{"text":"VIP Service at The Maison was worth it.  That is if you get the elevated corner table, to ","useful":1,"cool":0},"gi1D80_tKH43FFkHawmp8g":{"text":"Was going to go next door for dinner to Three Muses, but it was slammed. Headed into Maiso","useful":0,"cool":0},"c_GgiXwi7lI0Tzn3wO7v7Q":{"text":"Love this place! Went two nights in a row. The musicians were outstanding and no cover cha","useful":0,"cool":0},"bvM4SinhS9JZ2a-HidD9cw":{"text":"Fantastic spot on Frenchman St. Live music holds your attention all night. The food is del","useful":0,"cool":0},"kjc-a9hskMdsjswoVcpVdw":{"text":"Depending on the band playing the night the experience of this place varies a lot. They us","useful":0,"cool":1},"gl7_QsLHo9hUq6PQzt2YMQ":{"text":"Tanisha was amazing!! I loved her service and she was so polite! I really appreciated her ","useful":0,"cool":0},"g95u4kJAVae1yLyzzwUQCA":{"text":"Some of the best jazz in NOLA! The place is quant and the staff is friendly! Check it out!","useful":0,"cool":0},"ttr0LXjmm_lPTc_J1Ifgjw":{"text":"Great Jazz and wonderful atmosphere.  Add to that, no cover!  We had a great time at Maiso","useful":0,"cool":0},"juqZofKRAzTvj1N328nNeA":{"text":"Loved the band, my drink, the service, and the atmosphere on a week day evening. The fries","useful":0,"cool":0},"ewqfjpVaI3AH0L_6ngKM4g":{"text":"HORRIBLE customer service!!!\nWe sat down around 8pm. We tried to order food but the waitre","useful":0,"cool":0},"Pz4JLcctuTmbbpDIZrWL8g":{"text":"I love the live music here. Big bar, lots of space, you can get away from the crowd for a ","useful":1,"cool":0},"VQcCI6t4zpCYyg7u9sFLDw":{"text":"When you are in New orleans and actually want to hear the local talent this is the place t","useful":0,"cool":0},"af1UiSe2SrTOBjvREM01jQ":{"text":"Frenchmens street is fun, Maison has great music but the food and service is lousy. Have a","useful":0,"cool":0},"sYWDARonY82fMq_CkoColA":{"text":"Had such a great dining experience here. The live band was fantastic and the food (huge po","useful":0,"cool":0},"9VUtoeEZUstXjFrl-MMnMQ":{"text":"I was a New Orleans virgin on this trip. Maison was the first place we went to, and by far","useful":0,"cool":0},"nfs7pCwiYD6S7A7x-0LW2Q":{"text":"The food was delightful. My penne pasta was ambrosia from the Cajun gods themselves. The a","useful":1,"cool":0},"XM1QLQTTxw0GPTwtCLVErA":{"text":"Un buen club para escuchar bandas en Nola, la famosa Frenchmen st. Es uno de los primeros ","useful":3,"cool":4},"zeakR1UiHDLY34_pt32WcQ":{"text":"Stopped by here on my last night. Promised my friends we will spend one hour inside and th","useful":0,"cool":0},"IeFGczyssg-gJfI473airA":{"text":"A great spot for a Monday evening. Freestyle jazz! musician literally walk in off the stre","useful":1,"cool":0},"1EF5Epz9dthc_QvVhxx6Hw":{"text":"Come for the music & drinks  skip the food. Overpriced and mediocre at best. The Shrimp an","useful":0,"cool":0},"BvqgFRxnHHC58bIKa5IIbQ":{"text":"Great venue! No cover, good drinks. Everyone was having a good time dancing. Our first sto","useful":0,"cool":0},"eqDwdTNdhZGKUpUWCeLL0A":{"text":"I had my wedding afterparty at Maison last weekend and it was absolutely perfect. Jen at M","useful":2,"cool":0},"sNYUF8WEkhszETeK7CpE9g":{"text":"We had so much fun here. Great atmosphere, music and food! We ordered the Bourbon Honey Gl","useful":1,"cool":0},"iZT9bntpUN7m_lkXiWkV7g":{"text":"We chose this place because the music sounded so awesome. It was very relaxed and the serv","useful":2,"cool":1},"2jVnKNH9VIbNZvg1sQKEMA":{"text":"this was a fun stop waltzing through frenchman street during fqf.  i had the southern peac","useful":1,"cool":0},"8Jzq2mcIXDuKz92GJof_TQ":{"text":"Can I give more than 5 stars?! We came in for drinks, but mostly music. The Faux Barrio Bi","useful":0,"cool":0},"FgrJLHA1S139_HM51SvL-A":{"text":"I loved the atmosphere and the drinks were good and we were excited to try their gumbo but","useful":1,"cool":0},"TfuxUcYHxKPHRZaUqoWI6g":{"text":"Great live music! The crawfish bites were tasty. The jambalaya was good, but a bowl was wa","useful":0,"cool":0},"4B2RANkKwyx14BYbFf7CBg":{"text":"Better than Bourbon Street bars!!! Walked there from Canal Street, it was not a long trek.","useful":0,"cool":0},"ohawl4URRLnsdlMOkjQpHw":{"text":"Great underground spot!! Haven't been here prior but my experience from tonight's KRS-ONE ","useful":1,"cool":1},"qthoKVXpNjj4TEiOjD-CYA":{"text":"Love this place! I had an awesome conversation with the manager, can't remember his name, ","useful":0,"cool":0},"Zobdg8LuK30rdWqPmoSrcA":{"text":"Spent five hours here - non-stop good music.  Ordered a few bites while we enjoyed some wi","useful":0,"cool":0},"XULZi-54uAaxHCJW1H2jsA":{"text":"For a place on frenchmen street, I was expecting it to be a lot safer. I got roofied here ","useful":0,"cool":0},"BuPB7wN08040e2PoLoV7oA":{"text":"We had a few drinks here one night while visiting New Orleans and checking out Frenchmen S","useful":4,"cool":2},"gOO3StycvCZgIGPsGGj5Mw":{"text":"Traveling with kids in New Orleans and experiencing great music can be challenging! Thankf","useful":5,"cool":3},"P8fp22vW22gckpb7_gm-jg":{"text":"I love the vibe here. That night it was filled with a bunch of talented musicians who didn","useful":0,"cool":0},"hlP8HX6Vk7Nqo3ycDgYz4g":{"text":"Mannie fresh djs here from time to time. \nUpstairs is a little rickety, downstairs is just","useful":0,"cool":0},"1PJSlyFbhcB4zrw94b20kQ":{"text":"Great location on Frenchman St. Food was okay but jazz was great. Best thing is bands play","useful":0,"cool":0},"nhp2_CBVnYudoHEu_7qSLg":{"text":"This is a four-star bar with three-star food and five-star music.  It is on Frenchmen Stre","useful":0,"cool":0},"M04C5zPbZHphfkeJHqiuaQ":{"text":"Great music! Spent two hours here and got dinner. Crawfish ettoufle was okay but the drink","useful":0,"cool":0},"0GilKukrOHYViVrIBM8cOw":{"text":"Really fun.  The best place on Frenchmen we visited for live music!","useful":0,"cool":0},"zW2bA4VI-iWz1fIL7BwOAA":{"text":"A must for live music on Frenchman street, but you could probably pass on the dinner. It W","useful":0,"cool":0},"-OlgwPTlYq-dnUkgOO-XPA":{"text":"Loved this place for great cocktails and a jazz show! I can't speak to the food-- but the ","useful":1,"cool":0},"hyc4Ri-LaGExm6zJUuDazw":{"text":"Great music and great atmosphere! The staff were very nice.. great place to swing dance...","useful":0,"cool":0},"XbsMEm-65OpRwgCABtuAnQ":{"text":"Loved this music place - we went twice on our visit!  Such a great and diverse selection o","useful":1,"cool":0},"KGHiY0SY2gVR_Dd3GmmRtQ":{"text":"On a road trip through the south. New Orleans was the MAJOR stop. Spent more days here tha","useful":0,"cool":1},"zXYkcAelnPVCbqevkCRqcQ":{"text":"We had heard that this place is legendary, with great jazz bands playing while you have ex","useful":0,"cool":0},"-xNNOQYvEAEwxuXHj7zjqg":{"text":"We came here for a private party that was being held upstairs. It was confusing when we fi","useful":1,"cool":0},"QFz-eBC8bKiTKoNhp05kqQ":{"text":"So disappointed with this place.\n\nWent to frenchmen street for a bachelorette party and wa","useful":0,"cool":0},"BIBU3wE1cFtvZT7Id_yGUQ":{"text":"The flying pig sandwich is unbelievable! Huge portion with fries for under $10. Live music","useful":0,"cool":0},"NHUzv8dSWo_QayzviVg1Hw":{"text":"Horrible water downed drinks for our entire party of six people....very disappointed :-(","useful":1,"cool":0},"wAUva3WgxL_PdOCd76czZw":{"text":"This was my second trip to Maison in the past 2 years. The first time we went it was dead ","useful":5,"cool":3},"UqN-gOVUc4zWuoG6g-QuVw":{"text":"My first visit to Frenchmen was a memorable one thanks to Maison.  I have to note that it ","useful":2,"cool":1},"gEP50wU-3Lxll_UcOsOfNw":{"text":"The service and the music was great. I can't review the food, because I didn't eat here, b","useful":0,"cool":0},"UUt0tguzdy5I4hrNM4JPEg":{"text":"Nice location for music on Frenchmen, what sets this place apart is the great sofa area in","useful":3,"cool":2},"Bn5WheIm1drs3-Z48ZqEuA":{"text":"Friendly staff. Comfortable, pub style.  Loud contemporary jazz with good musicians, just ","useful":1,"cool":0},"f--X0n3nMdvdOYRyfFdDHQ":{"text":"It could be because I'm still in vaca mode, but dang this place was great!  I wish there w","useful":0,"cool":0},"dW3lEnGEjxWyYBle6C_KbA":{"text":"This is one hell of a bar!\n\nI have never been into this bar before so I really didn't know","useful":5,"cool":6},"8o4pVFBljFpd9pcsGw774A":{"text":"This is a great bar with reasonably priced drinks. I very much enjoyed my time here. There","useful":1,"cool":0},"cVw50hG6wP-G1WgOhRS-_Q":{"text":"Good music, good service, good food and especially AMAZING sweet potato fries!  \n\nSeats ne","useful":0,"cool":0},"RR9OIc_NLD-dPFroDSBXaw":{"text":"When you walk into an establishment where a live brass ensemble is blaring their rendition","useful":0,"cool":0},"RxEikJ0-GHQZcFFZo_XYLA":{"text":"Fantastic music, great drinks, clean bathroom and spacious. We had a blast there and liste","useful":1,"cool":0},"-6UxXcvxBxxLdMwiyb0mKA":{"text":"No cover, great live bands, even better crowd! Came here randomly and everyone was dancing","useful":0,"cool":0},"inwOeLRCBjHHZaKD6jXC6Q":{"text":"I can't say much about this place. We were here at an odd hour, about 5:00 on a Sunday aft","useful":4,"cool":5},"HO2d45WwNXjiJUAruUnQBA":{"text":"Strictly for the Tequila shrimp we had.  It sounded good but did not translate to the flav","useful":3,"cool":1},"Q3iIauGYKA0oTznrwGhgCw":{"text":"We stopped by this weekend. The music was terrific. Unfortunately, we were rudely treated ","useful":0,"cool":0},"-wHbboecdx2MmNJYvDcD_g":{"text":"Found this spot in our first night in New Orleans and we made a right choice in this.  We ","useful":0,"cool":0},"vZ35g75TrxaUV_Ky6MczzQ":{"text":"Good food, amazing music, great service. We have killed two cocoraches so far though, that","useful":0,"cool":0},"HQzAYS2CJZwsNwVPM0Q4OA":{"text":"Great place for food, drinks, and live music. We had the best shrimp and grits and pulled ","useful":0,"cool":0},"actA9za5SGX4fGLrxFEslA":{"text":"This review is about the security guards hired by the club. I went to Maison last week for","useful":1,"cool":0},"On8WDpvk_p5mJbvxUUvCMA":{"text":"The music is great with no doubt. However, I booked the reservations on his website and pa","useful":0,"cool":0},"bejcCzcpEtAfz-qgj3b6Hg":{"text":"My husband and I went to the Maison last night to hear some local jazz music before we lef","useful":0,"cool":0},"Y-_6tqrBmIl6kLm3TmW3aQ":{"text":"Came here twice in one day. Different bands, each talented in their own way. Excellent (hu","useful":0,"cool":0},"LKjNpTfYSM3tzEAwszIyIQ":{"text":"I had to organize a party for a student organization end-of-conference celebration.  This ","useful":1,"cool":2},"Q88pw5CtpPobhGOCtINVDw":{"text":"Don't understand why it has so many stars. Came on a Sunday night like around 8 and didn't","useful":2,"cool":0},"PcYeb57Z9zYrY0etXm7R3A":{"text":"Fun spot that I don't recall being here for my last visit 6 years ago. I haven't spent as ","useful":5,"cool":2},"ZQmAh5NAwhk1hkEhWD7iJw":{"text":"Every time I visit NOLA, I end up here. Music is always good. People are nice and drinks a","useful":0,"cool":0},"fhixdSz_KUOMnhPvHuAGaw":{"text":"I had an awesome time here in september. The vibe from the street seemed to be the most la","useful":0,"cool":0},"byw_FVYW7a-olfQI6VrsTw":{"text":"A friend and I came here to listen to some music and they had a great jazzed band playing.","useful":0,"cool":1},"IsKuT3I_Ggr7LyfZBE4NiA":{"text":"In summary: four star food, one star service, and five star band (Jazz Vipers every Wednes","useful":1,"cool":0},"T4mOdba9JMpbUfXNOMAJwg":{"text":"I've been to Maison during a few different times -- general barhopping on Frenchmen, brass","useful":3,"cool":2},"UEOyK6CLxVa3AtX1jWXdUg":{"text":"One of the things I like about this place is there is a lot of space.  It's two stories an","useful":0,"cool":0},"coisHJTbnxTga78jafztSA":{"text":"Our group was from out of town.  We happened on this Jazz club.  The food was excellent.  ","useful":0,"cool":0},"fTctsZlV7qW54brVh9RzIg":{"text":"Food = Amazing! Another bartender on the street recommended it to us because their kitchen","useful":0,"cool":0},"zknPzj3nrfN9RDyc3tySZg":{"text":"Take it from a native New Orleanian - the Jambalaya is excellent. Crawfish balls were good","useful":0,"cool":0},"FDnbUxceTpzRL2-JZnJ4nQ":{"text":"We came here after rehearsal dinner so it was pretty much a guaranteed good time from the ","useful":2,"cool":0},"8pTN7t6qLjWE1FW90LyqjQ":{"text":"We came here at the end of a long night.  After Fitzel's, we were still pumped to see what","useful":1,"cool":1},"9wfsT2oVExM6oZcrZMNm4w":{"text":"I really like this place! Checked out the Brassaholics here and although it was crowded, i","useful":3,"cool":3},"oQbCg1jkgcO3-CVdTvZyyw":{"text":"Absolutely blown away by pork chop - by far best dish I've had in New Orleans yet. Gumbo w","useful":0,"cool":0},"YVvD1KvKweL6Rstlqcrq0Q":{"text":"Delicious food. I got crawfish bites and a cup of mac n cheese. The crawfish bites were su","useful":0,"cool":1},"SeDf64jWDg0Jz6BdnmX9wQ":{"text":"This restaurant/bar is a great place to drop by randomly! The food is good? The drinks are","useful":1,"cool":0},"FbvN2FWTf7bAv0sVvY8JTw":{"text":"Great jam on Monday night! Food and service wonderful.\n\nIf I lived in NO, I'd be in there ","useful":0,"cool":0},"D6R_GeBrsMkLmMRZ_8zidw":{"text":"We really liked this place.  Roomy atmosphere, which isn't common in NOLA.  Then there's t","useful":0,"cool":0},"WzhE-627ZTgf1jYgH0HJ2g":{"text":"No cover, great live music, pretty people to look at, and reasonably priced drinks. What m","useful":0,"cool":0},"LZLkdxSR8U3oFNz2L2bVFg":{"text":"GREAT music and good food too. A bit loud and dark but that's what you'd expect at a jazz ","useful":0,"cool":0},"nDZh4mMexjjKoUl9LG0Q6A":{"text":"Great music tonight.\nWaiting on jambalaya and mushroom po boy to arrive. Service a bit slo","useful":0,"cool":0},"I_VIS_PJquPp1WqlX2Z_NQ":{"text":"A spacious jazz venue on Frenchmen St, my friend and I had a great time listening to the p","useful":0,"cool":0},"_R9qaxqFX3X-KPmcO_UebA":{"text":"Dynamic atmosphere and delicious food.  While we were here, there was a band change so we ","useful":0,"cool":0},"kXfoeFACmJPesEN99Ndr-A":{"text":"I love live music, and I am never disappointed when I go to La Maison. It really doesn't m","useful":1,"cool":0},"TmKBEcmrdHgQNi0fSC2qVQ":{"text":"Great venue for enjoying some local music and cocktails!  Fun atmosphere and entertainment","useful":0,"cool":0},"G9UwDwq4RLVW8PNFc-n03w":{"text":"Very cool set up with the two stages (opening act played street side, main attraction furt","useful":0,"cool":0},"l0ZYMGKJs7iikgqbX8XjjA":{"text":"Music venue 3 stars\nFood 0 stars\n\nGreat music venue, but eat beforehand . The red beans an","useful":2,"cool":0},"RUObqudT3ukCvNz-AzJokw":{"text":"Amazing experience! The food was good we started of with crab and gator bites, I continued","useful":0,"cool":0},"hpZS0wGNp-IYA3y82TiPpQ":{"text":"We went here on Memorial Day for dinner and the Royal Roses were playing. No cover, just p","useful":0,"cool":0},"3iQAMofyRit1r6IL7jXZfg":{"text":"After a night of Bourbon Street shenanigans, I like to get away from teenagers, strippers,","useful":2,"cool":1},"OmcbU59EEI9iZS_5x4Jisg":{"text":"DOUG is the bomb .... Great food and the band is fab. Don't bother with Bourbon, go to Fre","useful":0,"cool":0},"M2HjOv6Ri-AcUm2xbDKeaA":{"text":"This place is a good start if you want to get into the Frenchmen spirit.  The drinks are g","useful":0,"cool":0},"tevnJp4MlAdYRVwk4FhZ5A":{"text":"I have to say that up until this point, I was certainly loving the nightlife in the Quarte","useful":2,"cool":2},"r_qmIzsedFG6ct1CEQbsdA":{"text":"Just had some beers but this was the best jazz we heard during our entire visit. The royal","useful":0,"cool":0},"VArAhk7QB0qPFW2hscPMYg":{"text":"Maison has delicious homemade strawberry tequila, which makes for an incredible margarita.","useful":2,"cool":1},"KNOEJvyRKlI5AT6nHItzhg":{"text":"Good drinks and AWSOME live jazz music!!  Located in the most popular music street, the fr","useful":0,"cool":0},"BLQ88kOQslsVRnTp39Wypw":{"text":"Per suggestion of our hotel receptionist, Frenchmen Street is the place to be for some awe","useful":2,"cool":3},"jemhsN4qxV5tMyTlyN7yDw":{"text":"No cover, awesome steel drum band on the first floor, excellent salsa/latin music on the s","useful":0,"cool":0},"SJlcJQqjYuPB1lkY-T7mzw":{"text":"If you come to Maison, come to hear the music. Come for cheap beer specials (mentioned bel","useful":6,"cool":4},"3JVFITC4NviOahmduDMdGw":{"text":"Ok forget bourbon street, unless all you want to do is get blinding drunk, smell a ton of ","useful":6,"cool":1},"N016i401McUn4RccH2MY2w":{"text":"We stopped in here because it was one of the few jazz bars on Frenchman with tables availa","useful":0,"cool":0},"ak3yQgbvaPDOnUePMh6wFw":{"text":"YUM! and great music!  As others have said, Frenchman Street is the place for great live m","useful":0,"cool":0},"3cCX8v4cdWzIdH3c8qG19g":{"text":"Great service and the music was amazing! Bar food was super tasty. Would definitely go bac","useful":0,"cool":0},"gaQ5gwpj-b39B6sw3OLNQw":{"text":"I LOVED this place. They had an amazing band playing phenomenal instrumental jazz. I went ","useful":0,"cool":0},"XxbCrR85fvzQDo1IOkjDBw":{"text":"A fun, raw setting for jazz. Loud, raucous and packed. Get there early if you want to sit.","useful":0,"cool":0},"jXArDIqsxOGZA9C9Id8xdw":{"text":"I went to Maison on the night of the Macy Gray concert. I bought two beers and opened a ta","useful":1,"cool":0},"HzOQ0gW5yJseu_9RmpNThQ":{"text":"Stopped in here when I was in NOLA.. good music, good drinks. Didn't get the food so I can","useful":2,"cool":0},"EpwVTFqqsm2j_O5f9L_qJw":{"text":"If you're looking for your first foray into Frenchmen Street, Maison is a great spot to st","useful":2,"cool":1},"lKCytfhlJAn0QfAZhAWB-Q":{"text":"Great strong, but pricey drinks. Good music. Lively atmosphere.  Bathroom attendant had a ","useful":0,"cool":0},"JohlbpRABovOsvtfJN-YZg":{"text":"I have seen a few negative reviews concerning the service, lack of attention etc. It shoul","useful":0,"cool":0},"iAHLs8L7Ng75ceof_Bjz9w":{"text":"A great place on frenchmen st. We saw the billionaires jazz band. Some nice throwback tune","useful":0,"cool":0},"BjCZPJJFqI0MNe8-kNexCw":{"text":"We were visiting New Orleans, staying in the French Quarter. A local recommended Frenchmen","useful":0,"cool":0},"9QafTH_KBytSh9P0dsAq_w":{"text":"Come here when the do Cajun Fais-do-do on Saturdays from 4pm-7pm and it's a blast!  The be","useful":1,"cool":0},"Gas1XHtEV8o9wAbnzpGirw":{"text":"BEST bar on Frenchman with NO COVER!! Please keep it that way! Came here our first night o","useful":2,"cool":2},"YzZQhIBUGm8P-xv1MomPFg":{"text":"Great music, nice and roomy, no cover! Drinks are strong!! And everyone there was unbeliev","useful":0,"cool":0},"vvfo5JVhHQUbXKwIHI0aVQ":{"text":"The band that played the night we were in NOLA was incredible! They earned this place four","useful":0,"cool":0},"yop13YS7YWzNyl2dhVEGYQ":{"text":"GO HERE!\n\nWe were directed to Frenchmen Street for \"legit\" music and more local vibe than ","useful":1,"cool":0},"7W4uc1cCLVnthbx9t5xiEQ":{"text":"I was there while vacationing in the big easy.\n\nWe noticed Bourbon Street has turned into ","useful":0,"cool":1},"WjuB_xcV9MoleY8PUQbx_A":{"text":"I like this place. It has the best of all worlds. It has a very comfortable couch/lounge a","useful":0,"cool":0},"w5ufOf6dYeZvFyM9EonRkQ":{"text":"Loved every minute we spent here listening to the music.  The drinks are very average but ","useful":0,"cool":0},"MGqqUMWaCVM6RPbS738yzQ":{"text":"MY FAVORITE BAR I WENT TO IN NEW ORLEANS! \n\nHands down! \n\nOur first night here we discover","useful":2,"cool":1},"6aJIotX07ril0ZoV6dridg":{"text":"Hot, sticky, crowded, and the band was playing terrible alt rock music on a Saturday night","useful":2,"cool":2},"4gtdgNk59x8i2yKOPywY5Q":{"text":"We came to Maison a few years ago for a wedding, and based on that experience, we knew it ","useful":2,"cool":2},"eftNAtR5cJLebxNwfJOa_Q":{"text":"Recently I was on a southern adventure with one of my closest friends. We were looking for","useful":0,"cool":1},"qfxPt5rR_zYg5sjNNwz-Bg":{"text":"The Maison is a live music club, bar and restaurant. The live music is good, though the so","useful":0,"cool":0},"2iTmrf6mcn-HWoSrsbwGTw":{"text":"The food is moderately priced. Very upbeat atmosphere. Just ate here with my kids and in l","useful":0,"cool":0},"OomtNa2fmFyxGV5OaKm7fg":{"text":"The best \"Go to\" live music spot every time I am in the Big Easy.    Never disappoints.   ","useful":0,"cool":0},"B_T2M-R5VO8HIoD0vkkZXA":{"text":"As a local music lover, I give La Maison big props for always having great live music, and","useful":0,"cool":1},"XXPd8IeVSL-b3Nmk6lDnIw":{"text":"We went to Frenchman street while my wife and I were on vacation in New Orleans.\n\nWe notic","useful":4,"cool":0},"GzF3HkpaKONsVmMgoBhoHw":{"text":"I was here on a Sunday evening, the band Eric Gordon and the Lazy boys (I think that was t","useful":0,"cool":0},"AoihtsKQ0aqQnV_OQyv7CA":{"text":"Come for the music, not the food. Had my first foray into gator bites here and couldn't fi","useful":0,"cool":0},"BiUab8f3AIdI_x2PU9J-KA":{"text":"The music was great and the spicy mac and cheese was to die for! There was live music whil","useful":0,"cool":0},"RomJWaC7IMrauOEg96BzZA":{"text":"AWESOME live jazz! Good drinks. If you don't come for food and only for drinks, service wi","useful":0,"cool":1},"pkdlP9OqLmVZzo6QUel18Q":{"text":"A quintessential New Orleans experience we found quite by accident, this place is da bomb.","useful":0,"cool":0},"P2pcDwm4xrWXyJ92n6EvPw":{"text":"We came here for some drinks, which were decent. But it was so packed we ultimately couldn","useful":0,"cool":0},"ByUv5tnHAhVTcnqZtc-2OQ":{"text":"Please read this review so you don't experience the same treatment I received there! I had","useful":0,"cool":0},"w7HXB7gDzhbqQtXm61Gbuw":{"text":"Food was good, music was great! Staff was very casual which I liked a lot.\n\nLikes the Mac ","useful":0,"cool":0},"VXOr6HBBhzFDvTge0W-TRw":{"text":"The dolls and I had such a great jazz meal here filled with great entertainment and great ","useful":0,"cool":0},"CzoCJon3jmG9JJcmfPThQg":{"text":"There's too many other good music venues/bars on Frenchmen to waste your money here.\n\nCONS","useful":1,"cool":0},"-Y1GRUh9DYPbemunQCPTQg":{"text":"We went on  Monday evening, and I was impressed. Very low-key, relaxed place, the singer (","useful":0,"cool":0},"MERQelV0mIh9HkFg94u6ng":{"text":"Our first stop for a quick bite, drinks, and some jazz. Our server was friendly, prompt, a","useful":1,"cool":0},"_aiqYyQUHAWMDmt3qOcdrQ":{"text":"Maison is like a good European mullet: live, funky music downstairs (the business of New O","useful":1,"cool":1},"AhepVmGk96suT3yVH-EUiA":{"text":"Such a cool place!!! My friend and I stumbled *literally* here during Mardi Gras on Sunday","useful":1,"cool":1},"WANK67OfeD5oH1CWaeYjgg":{"text":"My friend knows what I like. So, he knew that I would like it here and he was damn correct","useful":0,"cool":0},"5tmVW7_ewBgQKMQvpOi41g":{"text":"Went on a smoke-free show night, but it's not always that way (I like smoke-free, being a ","useful":4,"cool":4},"aMz9TlK657vFoczkfelIZQ":{"text":"I was already drunk when I walked in here...no cover (cha-chin!)..started the night off wi","useful":0,"cool":1},"VZ8imE0HZFIagQTU5TcYtg":{"text":"Nothing not to like. No cover, as others say, but cool, as there is lie music. Great staff","useful":0,"cool":0},"7qU9t4CoN_kNcmXNHUJtfg":{"text":"My first stop after arriving in New Orleans. Good music.\n\nNo bar seating, so the bartender","useful":3,"cool":0},"Wa4E16fbFWQuNCQznU2duQ":{"text":"Check diz place out if ya can! Again, really cool jazz club. Then again you can't really d","useful":0,"cool":0},"C6URSoZnbLGhexkxGakUfA":{"text":"Overall, this place is great! The food was amazing! I had the Cajun Mac and cheese. The mu","useful":1,"cool":1},"plQZ9zuQeoTuQ9qlF5WZYg":{"text":"Love this place. Great food, excellent daily music rotations. One of only places that allo","useful":1,"cool":0},"wTkSW4ZaJm8zoZSpbi3ylw":{"text":"The only thing I would say is do not let the hungry person in the group order for everyone","useful":4,"cool":0},"pagVO88CUyLzoeQynULqwA":{"text":"Every time I'm in NOLA I fins my way into this place. Sometimes by accident and sometimes ","useful":0,"cool":0},"2esK7X757p4sVLXUNjZ-DQ":{"text":"Great venue!\n\nWe did a little NOLA style bar hopping which meant: GREAT MUSIC!\nThis was ce","useful":2,"cool":1},"hQuF-70zosTuUGRrBx1BRw":{"text":"My friends and I came here twice during our visit.  We loved both of the bands that were h","useful":1,"cool":0},"PuaY4VXGbJ64d_A4tWQp-g":{"text":"Had such a wonderful time here!!! I felt like I was in a different time as the band played","useful":0,"cool":0},"lDD9p7uANvwc9keEzFuZvA":{"text":"Best place for live music in town! Mix that with their strong drinks and infused vodka  We","useful":0,"cool":0},"NWJh_GcH-68agCkuCoR9aQ":{"text":"We held a private party with live music int he upstairs portion of the place for 250 peopl","useful":1,"cool":1},"bZWAi59OE5zSOrwjhhk8HQ":{"text":"Can't believe I forgot to review this place when I had such a good time!\n\nWalked into this","useful":0,"cool":0},"vATWloOW-HquQWaYohjShg":{"text":"Watch out for double charging. They charged my debit card, but claimed it was declined. Th","useful":2,"cool":0},"39-slAChy0w37-yC43rwRw":{"text":"You can catch great live music at many places on Frenchman Street - maybe don't visit a ba","useful":1,"cool":0},"BrIOHnY3sKGtAXdU57w65Q":{"text":"We stumbled into this jazz lounge on a warm Tuesday night.\n\nSurprisingly, there was no cov","useful":3,"cool":1},"O7e_0nnYl_L2HRtKJES3Tg":{"text":"This is such a lively place on Frenchman Street, as there are live performances from local","useful":0,"cool":0},"baP6JOMN6ZaCQMN65_DZQg":{"text":"We were looking for an open club with authentic Jazz on Christmas Eve. Our server at our r","useful":0,"cool":0},"IjTc8ePbmtcGV_QV_aRXjw":{"text":"Hands down one of my favorite spots in the city to see love music and have a few drinks. N","useful":0,"cool":0},"oUp1d7CD1wib8oTobaYuBQ":{"text":"They served the best sweet potato fries I ever tasted! The Apple & Pecan salad with a cup ","useful":0,"cool":0},"HF7z0w6vjD0rxQR3pbSZkg":{"text":"After a night on Frenchmen St., hanging out at the Spotted Cat, we decided to call it a ni","useful":0,"cool":0},"y5nAIPlOWtpL-a2HWtWWqw":{"text":"Frenchmen Street is where those in the know go for live jazz, blues & local music.  Maison","useful":0,"cool":0},"aBKtVevVwk98C8v_nbW61w":{"text":"Excellent dinner and awesome live music , the service was great , little slow but it's big","useful":0,"cool":0},"J6O42MpOdg-EOynuiOf5FQ":{"text":"Amazing music. The chef was my favorite part of the entire night.. his attention to detail","useful":0,"cool":0},"l9jz_YTdZ9KLow4D9_VBEQ":{"text":"Recommended by a friend and local. The live entertainment is top notch at this place. The ","useful":0,"cool":0},"uVYyrao_pk0aiGqfXNC0sQ":{"text":"It doesn't make sense how they can have such good music and not charge a cover. This is th","useful":1,"cool":0},"JV7yDJ0C8JAlofHPE8tnIw":{"text":"The music is the draw here. The bands literally take ten minutes max to turn over, so if y","useful":1,"cool":0},"fOEZA4bXL0jH8chF3QSMPw":{"text":"Frequently go to Maison when I am out on Frenchman.  The music is great, the food is decen","useful":1,"cool":0},"8MVikN9UehSe28J5CwLYbA":{"text":"A fun spot with no cover everytime I've been there. We've seen a range of cats, from some ","useful":1,"cool":0},"xeszldYyVHWcHc-5Imfc1A":{"text":"This place was probably our favorite venue on the best night we had out in New Orleans las","useful":0,"cool":0},"srDhrgviLwTZqc6f2HCtCQ":{"text":"Great band, spacious room, and god vibes. Wish we had one of these here in Philly. Would r","useful":0,"cool":0},"4jm-GJ8ERh9Ks4zEzjtHMw":{"text":"Musical Expressions MADE this place last night for us. If you're planning on going to Masi","useful":0,"cool":0},"eq1cZao9hL7VZ3h4RxkozQ":{"text":"Excellent drinks to go with jazz. Seasonal versions of popular drinks like the the Maison ","useful":1,"cool":0},"k3sCf8VWmA6--c9oBEpywQ":{"text":"The music service and atmosphere is good the drinks were good but food was just average. N","useful":0,"cool":0},"5kn-tNO28iION7qVM5JH_Q":{"text":"Some local family members brought us to this bar where we really enjoyed the band, Doombal","useful":0,"cool":1},"0wDdmAJDUY9fcsOlGG6v1w":{"text":"This place is a must visit for anyone in New Orleans, definitely the best music venue I wa","useful":0,"cool":0},"YsJfgzYf8whj8yXawrAknA":{"text":"I didn't get any food or drinks there but the jazz band blew me away!!! Midas was playing ","useful":2,"cool":0},"4FWiaScRXBJ8ybNElSEeAA":{"text":"A very cool spot to drink and watch live music! They had some great musicians playing the ","useful":0,"cool":0},"MM-C4Sf-sSxNHl1uBkuV4Q":{"text":"This place had it all - great food (southern duck was great), awesome service, and fantast","useful":0,"cool":0},"aOrAFl5f8dHjoaQuhuuqrg":{"text":"This place was super fun!! My friends & I came here after dinner. The area is much nicer t","useful":0,"cool":0},"mlXrNYX6M7zhDZYlsdWrvw":{"text":"Visited early on a Monday night and lucky to be seated up front by the stage to hear some ","useful":0,"cool":0},"lRaUwu_JPx43or6yK07pvw":{"text":"Great place for music and food and friends. Staff is attentive and southern sweet! Chelsea","useful":0,"cool":0},"zh4mRgzBvr79_JQgZGkmEg":{"text":"Great place to listen to live music. No cover charge. We got a seat at 7:30 on a Friday ni","useful":3,"cool":3},"x0wct2BdYrpeQVzzUGYdug":{"text":"Not pleased, sadly. The band sounded great though. Husband and I went the other day and ch","useful":0,"cool":0},"qX3V5dTTucGRIv26fpMV2w":{"text":"Music is usually very good although the acoustics and all around noisy atmosphere tend to ","useful":0,"cool":0},"nfdg7HaLzlMRgh44Z2CZZg":{"text":"This is why I love NOLa. Great music venues and no cover. We have always enjoyed the music","useful":2,"cool":0},"SxXc2R9C53gJzWjDezep7A":{"text":"Los Angeles native hanging out in New Orleans during Mardi Gras, be ready for trouble. Alo","useful":0,"cool":0},"iyhZNxVh-_LsejDnwMlp1A":{"text":"Bad-Ass.  Was here on a Tuesday night and the band was ROCKIN.  I mean most bands in New O","useful":0,"cool":0},"qSgtEHCmVfuWiggmxY7w-w":{"text":"This was hands down my favorite place in NOLA, and that's saying a lot.  The music was out","useful":4,"cool":2},"8UMSZ9vRhAd3OhTWXXdDyg":{"text":"Great bar... good restaurant... good service.. Great Jazz...\nHeard the Smoke House Jazz Ba","useful":0,"cool":0},"woPCCaUEyuydN2nuHQiH7w":{"text":"Super fun venue to get down to jazzy, soulful jams and the cocktail selection was satisfyi","useful":0,"cool":0},"mLVzV6_4E_dh6KC8lS9Akg":{"text":"Super cheap drinks and freaking amazing live music,  need I say more. I'm from Los Angeles","useful":0,"cool":0},"_F2iWT9BX0l2bby43yo9Ew":{"text":"walking by the window of this joint the day after thanksgiving, some friends and i spotted","useful":5,"cool":0},"ir7fKZGrcVRXSEfkCNfN7g":{"text":"Went here during our visit to NOLA for my birthday. We really liked this place. The live b","useful":1,"cool":0},"rAF4B7nP5yLKVXEZk2HUnQ":{"text":"One of the best live jazz places in New Orleans.  A must come!! No cover charge, full bar ","useful":0,"cool":0},"etykTuUL2h8BxHfStEsFIQ":{"text":"I really liked Maison a lot. I visited here with friends prior to dinner on a Sunday night","useful":1,"cool":1},"NM7L84Pycfu6IlTZikVkhQ":{"text":"Unbelieveable food.  We tried many of the traditional New Orleans fare here and were blown","useful":0,"cool":0},"TfjNeIvwcU2lX-hhVwEx5w":{"text":"My husband and I participated in a mixology class here. We had a great time and learned a ","useful":0,"cool":0},"po4ZEqPTEqDSL4nZqo7hMA":{"text":"Great music. Decent drinks. TERRIBLE SERVICE. Seriously. Total sh*t show. The girls workin","useful":3,"cool":0},"_8U_-PcT88VkZR-CbK8UyQ":{"text":"yay i was happy to have spent a night there. the live music was amazing and the anita beer","useful":0,"cool":0},"TCpCcs1II9sZn27ir4w7qg":{"text":"Very cool vibe here. Great bands one after another while I was there. There is a stage in ","useful":0,"cool":0},"CMRyrZ6M2ZVOF2rB4UVRaQ":{"text":"Super nice staff,  waitress was great - prompt and professional! Food was fabulous one of ","useful":1,"cool":0},"vOgTW6sQVUeJAwhEd34wMQ":{"text":"Amazing live jazz music with no cover and excellent food! Waitress (Michelle) was attentiv","useful":0,"cool":0},"eD4UE0RzdPh7bdJudGR9wA":{"text":"3.5/5 love this venue\n\nlove this place and the music that they host. the drinks are pricey","useful":3,"cool":1},"qMGsr6fmlwXH36_EdgsjpA":{"text":"Everybody put your hands up. Cool spot! Great acoustics and live music. Very New Orleans a","useful":0,"cool":0},"Qt-LMxat1YxrUGNG4v1FkA":{"text":"Can't beat this bar and atmosphere. Band playing covers with instrumental New Orleans flar","useful":0,"cool":0},"9jqn7CpiB1I3VGMKDPhLeg":{"text":"We decided to get away from the super-tourist oriented French Quarter, and experience this","useful":2,"cool":0},"325PEtqAf06G7dZvo2sT1g":{"text":"One our favorite place\nThe Ibervillionaires are great and always are fun listen!\nStaff is ","useful":0,"cool":0},"e2EpSQE3kfzmJG76C-h9og":{"text":"We went there with two young kids (7 and 8) and we had a blast.  The musicians were awesom","useful":0,"cool":0},"QLU6iD-iuH-WNQg-O3r4sA":{"text":"The music is fantastic. Decently priced beers. Bad service. Go somewhere else if you want ","useful":0,"cool":0},"JPou1rs_QXE_uhIBQuw-NQ":{"text":"The frontman insisted that we make a little noise if we came to party in this mo'fucka... ","useful":2,"cool":2},"GXKJu5TIh3AzcpYJGDzAzg":{"text":"Loved everything about our visit except the waitress - unfriendly, unwelcoming and almost ","useful":0,"cool":0},"B35_KzFPOrgfyDSU2BIp1w":{"text":"Now, HERE'S a place with good jazz, generous wine pours, and friendly, efficient service. ","useful":0,"cool":0},"OkgG-Hu5zZqky5GZtBkPEA":{"text":"I love this place. Anytime I go downtown I make sure to at least stop buy and grab a drink","useful":0,"cool":0},"gjA7QbdHXBG0WRfCeXDJnw":{"text":"Bouncer inappropriately touched a girl in my party and threw her out for the reason of her","useful":0,"cool":0},"H2qyu3OzGp8grWqYzx01vg":{"text":"There's always something going on at Maison, it seems, and most nights there's more than o","useful":4,"cool":3},"C8p_bzy3NUpuL17G6Y1zbA":{"text":"Arrived late in NOLA and was staying across the street.  Did not want to venture to far th","useful":1,"cool":0},"SMDCwFuYP5Gbwy6ThNChJg":{"text":"Maison was my FAVORITE place when I went to NOLA!  The music was great and drinks were fan","useful":3,"cool":3},"6LAlbtvaxABamN7xCLZRbg":{"text":"@TheMaison508 is a GREAT space on Frenchmen Street.  I almost don't want to tell you how g","useful":2,"cool":2},"IjvrZZEDi54N522RcR3ZYg":{"text":"This review is purely for the band that played that night and the drinks, we did not bothe","useful":2,"cool":0},"5CMgWo-dyUpTwJKhG54rTg":{"text":"On my last night in New Orleans, my friends and I found La Maison thanks to the phenomenal","useful":6,"cool":6},"0o2n8-jJm1clwxtSNQYg-A":{"text":"I stopped in while walking Frenchman Street. The live music was really good, the beer was ","useful":1,"cool":0},"2rUidmejYjA0IHd3t6lD-A":{"text":"If you are a young woman, definitely do not go here!! The bouncer told me I would get date","useful":0,"cool":0},"cn4GYo47gqLdVwgGlfEgdA":{"text":"This is one of my favorite places in NOLA.  I go here pretty often.  The drinks are good, ","useful":1,"cool":1},"KhF36YzfqFIFzonbQzBENQ":{"text":"Cockroach on our table and silverware. Given the excuse that it's a very old building. Eve","useful":0,"cool":0},"_gBySIASapfTHAVVrGRtKQ":{"text":"A Frenchman favorite.  I have dances the night away more times than I can remember (really","useful":1,"cool":0},"pL8FhtLAIhjNJFrXi2yKZA":{"text":"Great music, great service, great food. We were so lucky to stumble upon this place.\n\nBrin","useful":0,"cool":0},"isXet2DR6j1R-wSHeCWY0g":{"text":"My favorite bar on Frenchmen. Sexy bartenders, strong drinks and excellent music.  Brett a","useful":1,"cool":1},"gFhADHy6G7r2DYmV364KXA":{"text":"This place reminded me of an old school, Boston mafia restaurant where the big boys hang i","useful":0,"cool":0},"wmM8BE3UUFjvrTAjUPTLMw":{"text":"If you don't mind the cockroaches crawling on the wall, under poured drinks and subpar ser","useful":0,"cool":0},"ZEC4LAZZW36Qj8xsmWRRaA":{"text":"Great club / bar / restaurant. Great music and dancing. So much talent on the stage, excep","useful":2,"cool":2},"jEaodSjZe3ME_3eHVvgDyQ":{"text":"Listened to a great band while enjoying great food with great friends. What more can you a","useful":2,"cool":0},"6wV2tBx64yFU87iD0J8_6w":{"text":"Good shows...often for free.  Prices aren't great...but no cover.  No smoking...but at lea","useful":0,"cool":0},"kCTdPOnS4sTTXYy5xeAI8g":{"text":"Great ambience!!  Music is phenomenal. Zophia is spectacular. Provided great service and i","useful":0,"cool":0},"4b8P9f3mozG7LWu7qLwQAw":{"text":"Feels new-school, crowd here seems younger than Bourbon St. at say Maison Bourbon (favorit","useful":0,"cool":0},"ouMcBRYFh2t6xkI8REXyIw":{"text":"Came here for dinner last night. Best sazerac I have ever had. Good shrimp and grits. Grea","useful":1,"cool":0},"GaJqvOZxVnY5iiIp3kqLng":{"text":"Non-touristy great place for a late late night bite.  Part of the \"real\" NOLA.","useful":1,"cool":0},"i4FNwviz84Q8VC8GPHezYg":{"text":"If you're going to NOLA, you MUST come here! My friends and I came here 4 out of the 5 nig","useful":5,"cool":5},"Yq2dWCdjSlYWkS8NrXfS2g":{"text":"firstly, the listed hours for saturday are incorrect, came here at 4pm on a saturday and i","useful":1,"cool":0},"60jVz0Q0WmroPOAVkx3uzw":{"text":"Was very disappointed with our trip here. Went to see live music and enjoy a po boy after ","useful":0,"cool":0},"ZaEdTJkqIQedvY6f2H5o9g":{"text":"What a great place for good drinks and jazz. We stumbled upon this place on a recommendati","useful":3,"cool":0},"mvjunBYYJv8uWd9MK4Rurw":{"text":"The most lively club on the French side! This place is huge! lots of seating great size st","useful":5,"cool":6},"YDzCBXfYa4tZYDolXvqCXg":{"text":"Had a wonderful meal last weekend while we watched the Krewe De Vieux parade. I had blacke","useful":0,"cool":0},"tRfe6mMv1eF0cBDBj1wCoQ":{"text":"Great for what we looking for... good food and music!!!\nWe're a group of 10 with multiple ","useful":0,"cool":0},"kgeIgGJ3E20C_Lehv_kcRQ":{"text":"WOW! First night in NOLA and Maison seemed like the right place to introduce me into the c","useful":0,"cool":0},"lOgP47l1lStsJNW6V6xtkw":{"text":"Brought the relatives, ate shrimp and grits and Cajun mac and cheese, oh my gosh, the best","useful":0,"cool":0},"M0P8z90nhTIt75n9bQFpAg":{"text":"AWW LAWD! There's a great energy to this place that is invigorating without being overstim","useful":8,"cool":7},"yaeXg6Lqc-2z2mWTJku5pA":{"text":"I was really excited about going here, but the hostess was extremely rude to the point tha","useful":2,"cool":1},"KULMEWxTZC4P1bTfbVSDNw":{"text":"Went there for drinks and live local music during our wedding anniversary trip to new orle","useful":0,"cool":0},"GtQvJ6W1y3sDC0iLr9iXnQ":{"text":"Great brunch. I've been to late night shows here during jazz fest but never for a meal. Fo","useful":0,"cool":0},"o3YMZ3yj1xUmNzkWAH9JQw":{"text":"This place was awesome. We got there around 530 on a Friday night and were lucky to see a ","useful":0,"cool":0},"Z6b3AmdTJrIkl8o_2h7zKA":{"text":"Had the alligator appetizers and it was an explosion of deliciousness, those little sucker","useful":0,"cool":0},"S3qow2aTUIrveK5W3IHL2g":{"text":"Really one of the better live music venues I've been to. Quite large and perfect for a ban","useful":1,"cool":1},"WyfVrtd1-5ZCH8PuwEoRBw":{"text":"Loved this place!  Large, dark and classy with a very laid back feel.  Plus, it's non-smok","useful":2,"cool":1},"m6bgC2sXj_ebh7VLTqaHwg":{"text":"This looked like the spot for the local college kids would go on a Friday night. You can't","useful":0,"cool":0},"T11Y6lAgjzunslxomWlAMg":{"text":"Classy and laid-back, Maison is my kind of place. We saw a great band here and the drinks ","useful":0,"cool":0},"js8FhGRG68JGdrcWz7AVdw":{"text":"Stumbled upon Maison walking down Frenchmen St. and had a great time! A live band starting","useful":0,"cool":0},"Mgfe_8wCjB4GMTM7IqkzBQ":{"text":"They screwed up our reservations two nights in a row.  The first because the waitress and ","useful":0,"cool":0},"VYnDL686kbFaHl7pTC1Vxw":{"text":"If you need something to do on a Friday night, visit La Maison. \n\nThe funky band made me w","useful":5,"cool":5},"PzQGRF6Q2p-NDbI5hT2vwQ":{"text":"This was one of my favorite spots in New Orleans-- the live shows were fantastic, and ther","useful":0,"cool":0},"yz2Fya8j8GWyL8LypjGabA":{"text":"Best stop on Frenchmen's Street. After walking up and down the street, I'm so glad I came ","useful":1,"cool":0},"Nv-MdmFAy4-WrK-4i31-LA":{"text":"I had the chance to come to Maison with a bunch of friends for dinner during French quarte","useful":0,"cool":0},"EZxBLmf7dycgpRjHiyiPvg":{"text":"One of the great bars on Frenchmen st to catch excellent music. No cover. Seating is limit","useful":0,"cool":0},"whvwfBiqxEKCMPE2G1LyOw":{"text":"The place is great for live music.  The drinks are okay and the food was nothing special. ","useful":0,"cool":0},"vK-IfSxmAj1mCfziutQwGw":{"text":"The Maison not only offers live music and food. It's an amazing place to learn to make coc","useful":1,"cool":0},"ukbmTBXQ7vajMF9WH6IhDw":{"text":"We only stopped in for the live music and drinks, we didn't eat here.  It is a great spot ","useful":0,"cool":0},"J5FEYnJCgqNpt-JMO8fvsg":{"text":"We took the mixology class with Lindsey last week and it was incredible! Not only did we l","useful":1,"cool":0},"GhgIRyAe0hkNKaIVo0IPvg":{"text":"We were in NOLA for our first Mardi Gras, but reveling on Bourbon wasn't how we wanted to ","useful":1,"cool":2},"-6JWS9UIpHalTPLY9OJ2XA":{"text":"A good place to catch diverse tunes of Big Easy!\nLove the music and vibes here! It just ha","useful":0,"cool":0},"uz8JGxG9HTxqdOAtiIkohA":{"text":"I wish I could give this establishment a better review, but I unfortunately was not allowe","useful":0,"cool":0},"xNL6hm1NzS6bTKWndC2cDA":{"text":"This was our first time in New Orleans. We wanted to eat dinner at a place that had live m","useful":2,"cool":2},"rPPB60SwOVNeFxwBiOw1ig":{"text":"My favorite place on Frenchman! They always have great music and the food is to die for. I","useful":2,"cool":0},"4QU074IRJC63AZNIpKisjw":{"text":"Sunday brunch with great swing/ Jazz / dancing/ great show. This is a great Sunday morning","useful":0,"cool":1},"sTPYGDRPATGqPC6YgSsf4w":{"text":"We spent Mother's Day morning here and IT WAS AMAZING!!!\n\nThe swing band, Chance Bushman &","useful":0,"cool":0},"yQqE6yZaN8W2fJn5jqo2dQ":{"text":"Live music in New Orleans FTW!\n\nThe Saturday after Mardi Gras we went down to Frenchmen St","useful":3,"cool":1},"dBE6JshXw8ZSZ9YNEkX3nw":{"text":"For my birthday a family member and I booked the mixology class. This was an amazing and u","useful":0,"cool":0},"CCfjYx19tWmcj9ognbLkjg":{"text":"They have an upstairs to go along with their downstairs and usually have some good live mu","useful":1,"cool":1},"o6__ZWGttmlxG87FuHcF0w":{"text":"I was in New Orleans for the weekend with some friends and we found ourselves checking out","useful":0,"cool":0},"osAlS324XWYaGLnGjuXMSQ":{"text":"Rude bartenders this evening. We came here last night great.. tonight completely different","useful":1,"cool":0},"thzw1Tfsh9lnglp1Scpiyw":{"text":"We came here for the class on our first day to New Orleans. The Maison is in a great locat","useful":1,"cool":1},"k-Cu3uOa7NbklcwG7aEcOw":{"text":"Maison rocks!!! Music was overthetop cool...from jazz to hip. It was all groovin and movin","useful":3,"cool":3},"Jjo2wT7NLSq-i8T9zeMsww":{"text":"Rude, rude, rude. Too many rules for a bar on a Wednesday night other hardly anyone in the","useful":0,"cool":0},"p2XW_cKMQLdoBSQ28wc7SA":{"text":"Sunday night \n\nWe did the whole Bourbon Street thing on Saturday, so on Sunday evening, we","useful":2,"cool":1},"9fukgfo41Y0lP59-Mk46Uw":{"text":"We head to Maison one Saturday a month for their fais dos dos and some Cajun and Zydeco da","useful":1,"cool":2},"Tjta1XT9-Ry5jKGk7Rnj0A":{"text":"Performance during Sunday brunch is awesome! Make sure to have reservations. Grits is a li","useful":0,"cool":0},"4ZcP6U_H5-5-TTA-KWnc1Q":{"text":"We chose Maison because we wanted a jazz dinner for a birthday celebration, but not too ex","useful":0,"cool":0},"RZMI-Mr5kv62ZWLSgPJQ6Q":{"text":"We bought the dinner to get the seating. People kept standing in front of us, and the serv","useful":1,"cool":0},"FAZ6NGl2qmyMzr-5W4Kibw":{"text":"We made a reservation for dinner and had an excellent time in excellent seats.  We were gr","useful":0,"cool":0},"QJYFbpD0j3KMSCJjSfRQqg":{"text":"Poor service. Kicked out when we didn't went to sit at their rocky unsafe high chairs and ","useful":1,"cool":0},"GfvIm8jqY_hDUS-4yazR1w":{"text":"Came on a Thursday night for drinks and to watch the music. Both bands we saw were awesome","useful":1,"cool":1},"yVWpkAgYult8a_i9dd8ROg":{"text":"What can I say?  Live music just about every night.  Nicely placed stage and sound for the","useful":0,"cool":0},"aTyU-AQN3-3O9jkA-JtL9g":{"text":"We just happened to stop in when on a short trip to NOLA.  Wonderful!  We were lucky to se","useful":0,"cool":0},"pSHlg5AT_ye91750RpRfFw":{"text":"Listening & watching the NOLA Jitterbugs was a highlight of my trip. I had been anticipati","useful":1,"cool":1},"ACdHCyeS9ZVhCDK90qexiA":{"text":"One of the tightest spots. The live music was awesome. We were able to get in for free aft","useful":1,"cool":1},"fp1vftYLHOUt7cOmr4FxDw":{"text":"This is my second time to New Orleans and the winter of 2010-2011 we worked for the winter","useful":1,"cool":0},"yOMQWGB-3v1zI3Gr611tww":{"text":"Awesome spot for live Sunday morning jazz, not too busy so we could walk right up to the b","useful":0,"cool":0},"yb-lyAbpp2TyXR0HrMuhbw":{"text":"Cool little spot on Frenchman street where you can grab a drink, have a snack, and listen ","useful":1,"cool":0},"1bk9RZEgPQxwMXnKGbEK0g":{"text":"We didn't get to see the trumpeter we went to see, but still had a good time.  The Jazz Vi","useful":5,"cool":0},"2XoIqhInqb61tof31YOKQw":{"text":"On Frenchman St. When I was there they had this vanilla infused bourbon. Have it in an old","useful":0,"cool":1},"wVzmbGMh3jeR75PIeV3NLw":{"text":"Who knew this place would be poppin' on a Monday night?!?!?!?!?!?!?\n\nIt was open mic night","useful":2,"cool":0},"i5uz5DH5Mt1sB8zTSNa0ug":{"text":"I want to first say that this is a great place and we enjoyed ourselves with the wonderful","useful":3,"cool":0},"Xw-eHjEekz50nzpWejKmcw":{"text":"Great vibe and we loved the Sunday Jazz Band and dancers ... however the service was very ","useful":0,"cool":0},"BVW52fiS5HTRbsxPMnZuwQ":{"text":"Awesome place. Good food. Nice staff. The live band was really good and the crawfish bites","useful":1,"cool":0},"XqQroqU5-OIxSCgr9Bvo1A":{"text":"great service, great music, tasty drinks, and yummy sizeable portions of food ...","useful":0,"cool":0},"iB8Zc91eWU4Z5x87gF9lHw":{"text":"Maison is a great place to catch some authentic jazz and sip on a drink or two. It's more ","useful":3,"cool":1},"uow4iHALVqgDaot3SxHwaA":{"text":"Came in here because the place looked lit from the outside. Turns out there was a live per","useful":2,"cool":1},"tJxp4Yp-_yQcPC_PeLoDpg":{"text":"The meanest and rudest staff in new orleans. Shameful.","useful":0,"cool":0},"mDGKnHpGEiz9ziiK5OQwkQ":{"text":"We had a 50th birthday party for my husband here and worked with Jen Harvey. She was the a","useful":1,"cool":0},"agKCf22v_s8JiCX3TsgLrQ":{"text":"A favorite Frenchman Street music spot for a couple of reasons - they have space for good ","useful":0,"cool":0},"g5CcnROApEE58kK_tqKvrQ":{"text":"Every night we were in Frenchman we ended up being drawn in by good music in the maison. \n","useful":1,"cool":0},"f-nAOM1gjxdybD2MTxeKRw":{"text":"Hated it. Have had many a positive experience here, but tonight takes the cake in awful. I","useful":0,"cool":0},"0mfHveI7Vc7GtRn9fw8XNA":{"text":"Had brunch here our last day in NOLA. We all had a blast. The band was great and the food ","useful":3,"cool":0},"RAu9rvNANSmvl9cJP0F1Pw":{"text":"Awesome place to dance your nite away.  They had a the best performers for late sunday eve","useful":0,"cool":0},"J6r7QAcPqLGoJt1KwrW4OA":{"text":"I had such a great night here, and I was completely sober!  It took me 45 minutes to find ","useful":1,"cool":0},"OphnMBp1pG6f5qf0Mz0o9Q":{"text":"Didn't get to eat here but caught some music on a very busy Saturday night.  We first hear","useful":0,"cool":4},"_7REpk0GSO9wxq3YatQU7A":{"text":"As a grown up I like to do grown up people things and Frenchman St is more up my alley.  W","useful":2,"cool":3},"ivyDzpKDCbPVHGAA5oH8cw":{"text":"This place will surprise you.  It is average looking, but they offer really good music and","useful":0,"cool":0},"P_VzhvPDAQ4FTWuasOlpuA":{"text":"More to come later","useful":0,"cool":0},"8BptXkYkoW2APDBilVbR8A":{"text":"Ended up here after a night of bar hopping and dancing...what a high note (gross, a pun) t","useful":1,"cool":2},"7yRLlYYRuvW7KZ5o9m2zOQ":{"text":"I've been coming to Maison for years and while I used to love it, I find it to be declinin","useful":1,"cool":1},"TZrfPGXt_6eastygMtHaig":{"text":"I was in town from Houston visiting family and they brought us here. We arrived around 8pm","useful":0,"cool":0},"fwKqmb5KKOUKap2E05uKFA":{"text":"Don't even bother. The music may be fantastic but if you are just dropping in for a drink ","useful":0,"cool":0},"Nx6nUuL_whH4KTSJwSlcMA":{"text":"Honestly, such a great vibe and music. Had brunch here on a Sunday. Food was good and was ","useful":0,"cool":0},"MYBeRSDzW_k8ybCT1HaMXg":{"text":"Food: Not much to choose from the menu. But the food is pretty good.\nService: excellence!\n","useful":1,"cool":0},"vUk55IsEEeopf30MQdaUMQ":{"text":"Great music, pretty good food. If you are coming for the burlesque show, make sure to tell","useful":0,"cool":0},"KFowPyAhK7ZDuCPIWIR_8g":{"text":"Terrible bouncer. Told me my ID wasn't real and didn't let me in. Not sure why he would th","useful":0,"cool":0},"CVUbT4ocuNUkco9e2rddWA":{"text":"We had a great time seeing the New Orleans Jazz Vipers! Really fun and talented group. Foo","useful":0,"cool":0},"BoV3XnKeR2Ur-NDHxVfP4A":{"text":"Jason Neville funk band was AMAZING!!!!!!!!!! The drinks were good a little  expensive, bu","useful":1,"cool":0},"CuibHXBbBgXX54QJG0900w":{"text":"One of my favorite places to go, drinks are affordable, music is wicked, and the place has","useful":0,"cool":0},"YC7Vzwul6cpXBjK1Q7PQEg":{"text":"I had a cup of the best gumbo I've ever tasted here! It came as the center piece of the ap","useful":0,"cool":0},"LUrshM130dAvtBLn36xaCQ":{"text":"The staff seemed annoyed we were there and the $15 fee to reserve a table was ridiculous. ","useful":2,"cool":0},"PSviegpApAZbeFW7hnjhQg":{"text":"This place is gigantic, cavernous even.  I came here with a friend and my brother. We were","useful":0,"cool":1},"1wzw3IAoKkWbKqJXbmV1Jw":{"text":"Ended up walking into The Maison on a Saturday night out on Frenchmen St. It has multiple ","useful":2,"cool":5},"C5Xnr9zeolBWDJJO2vZWow":{"text":"I came here on the fly ... Well probably because the music was hard to resist to walk away","useful":2,"cool":1},"kfPumJk-PHM2dh0m70UwYw":{"text":"Remember to show up here early on. It gets fully quickly, but you will enjoy it. The music","useful":0,"cool":0},"uPVQkb-z-73O4nlJ28f1dQ":{"text":"This place was not suppose to happen.  I will refer to this place as \"This Place\" through ","useful":4,"cool":2},"4XAayVcIL9xnZSKRMT6Wmg":{"text":"We ended up staying here for quite a few hours. The music was so so good and we were fortu","useful":0,"cool":0},"jTSegCsP1kT7bHKSxtBIRA":{"text":"If I can give a lower review than one star I would. This was the worst service I have ever","useful":1,"cool":0},"b_rxyGC6HEomDZzfqX2Agg":{"text":"After reading the other reviews, I had to double check that I was at the right place. I wi","useful":9,"cool":2},"2mmf_pwXiZ1RCNO_Apew7A":{"text":"Great spot to catch live music on Frenchman Street.   The atmosphere, people and live musi","useful":1,"cool":2},"TBswBZ7mMGDd63kIJWTRzw":{"text":"this is a pretty large venue for Frenchmen Street. They do have seating, but it fills up f","useful":2,"cool":0},"9I7_N_UavTUqH2IgHGxfXw":{"text":"I absolutely love the live music; I only had a problem with my drink. I asked the bartende","useful":1,"cool":0},"_JTmuA66u7szngyqN4zW7g":{"text":"BEST bread pudding EVeR! I don't know if it was the amazing music or the friendly staff or","useful":0,"cool":0},"0UYIoB6YdhNb0yd1ewhaLg":{"text":"Food was 2 stars but then not coming to Frenchman st for the culinary experience.  Place i","useful":1,"cool":1},"3cFLLvWB4404U1itYois_g":{"text":"Great live music- went on a Wednesday night at 630 pm and didn't leave until 11. Had a few","useful":1,"cool":0},"Z_KHmjhJmDsuZA02AmUvsQ":{"text":"Walking along the street and looked in the window of this bar.  Saw some dude tap dancing ","useful":1,"cool":2},"qKFrnb2L_xLjExuZi8Dfow":{"text":"I Had a Date Here Once...\n\nWelcome to my new ongoing series of dating adventures and misha","useful":6,"cool":5},"qXvrPsGXaHxJDXaqEIdnFw":{"text":"Loved the bartender Juan . Made amazing mezcal cocktails for me. \nMusic was great. Vibe wa","useful":0,"cool":0},"l37ZNudG40IfkhDg2F1rlg":{"text":"This place was awesome!  I'm not a big follower of live music, but we had a such a great t","useful":0,"cool":0},"r3r-RxV4a-MMhRTGOJT4Wg":{"text":"I have been a loyal patron at Maison for over 3 years, and it is my go to bar when I come ","useful":0,"cool":0},"0gxfNtDgFPYvcKZh41wfIQ":{"text":"Most of these reviews and the 4 star rating are based on the music, which I agree was top-","useful":2,"cool":0},"XYSjEjYU9YX8fAhI7xu1lQ":{"text":"Now this is a party!  Live band, great drinks and a night in the town was it.  They litera","useful":0,"cool":0},"PprX2MAC3qBQx_GhYYkLIQ":{"text":"Bad service. They say tables are for four people and none of the tables have four people. ","useful":0,"cool":0},"8g1U0UYVssyoCPv6h96iFQ":{"text":"The only time I have ever walked out of a restaurant prior to ordering/eating due to poor ","useful":0,"cool":0},"ZUCMb0wG9Z3mkbvlGtU-6Q":{"text":"The gumbo was good, not the best but I liked that it was hearty and not watered down. The ","useful":0,"cool":1},"0-XdDdPWT-vFrCVVcbwFpQ":{"text":"This is another one of our favorite places- they have a full menu and great drink selectio","useful":0,"cool":0},"qMXxn0ncEi5OE6gREAboWg":{"text":"I had a cup of the best gumbo I've ever tasted here! It came as the center piece of the ap","useful":0,"cool":0},"tAiS-uBP5GcyZOBiU8c84A":{"text":"Went Wednesday night and had an absolute blast! Gwen was an attentive and wonderful barten","useful":2,"cool":0},"ptdOJAzlJbjORzb-lSzO5w":{"text":"Can't rate the food or service for that matter. Came in and the place was half empty. They","useful":0,"cool":0},"zVA5EDofvt38IPF1KdOCfA":{"text":"Cool, no-nonsense spot on Frenchman with live music, decent food and cheap drinks. \n\nThe r","useful":9,"cool":0},"bKVyFqk-aU7SmiSLjcaqhg":{"text":"Last night in town and we ate dinner nearby and wanted to catch some more live local music","useful":1,"cool":1},"sFP3hcumjXonXm0q-eLc-w":{"text":"7 available tables, but the hostes wouldn't seat us. We had to stand the whole time we wer","useful":0,"cool":0},"ZTCPbv4B-9rPtQIBHDwoFA":{"text":"Decent music, great vibe, very relaxing. Other places have better jazz music but this is a","useful":0,"cool":0},"YbwiH4Pq73KFHg5hTrQztw":{"text":"Stopped in last night what a great NOLA music venue. No cover charge. The band was a great","useful":0,"cool":0},"4ODsuzC4Ac1_Cp-UXzqDbg":{"text":"I had an amazing experience at The Maison. During a busy weekend over the course of Memori","useful":0,"cool":0},"Qsbl9yB5wlzseDQ1xL9wUg":{"text":"We picked this bar at random amongst a string of choices along Frenchman Street on a Frida","useful":1,"cool":0},"F_q5g5WIOy_Y5rQARFXQjQ":{"text":"Lots of space for seats if you get there early. It's always some cool live music that is b","useful":1,"cool":1},"oXXeVaX5P9IMBu6zrM9o_Q":{"text":"Good food and the best music we heard on Frenchman St. Good times!","useful":0,"cool":0},"xf--uz_pVa4ePCI6Rj0j0w":{"text":"Best Bloody Mary I've ever had. Awesome Cajun mac-n-cheese too. We went back 3 days in a r","useful":3,"cool":0},"ECLq2rox0IxLMSVrCkrKmA":{"text":"We paid $80 in advance for preferred seating which also includes your choice of an entree ","useful":2,"cool":0},"2SBcKIKrw2SXxWt9rd_3cQ":{"text":"I wish I could say I had a good experience here... we walked in and sat, got some waters, ","useful":2,"cool":0},"6QaHH0p0gGlTupyfirA7nQ":{"text":"Never allowed in because bar policy wouldn't allow me in with leftovers in from a another ","useful":1,"cool":0},"KqBF-tJ7xX316yKrSteTeA":{"text":"We had a blast at The Maison. We visited during the day and the jazz band was awesome! \n\nW","useful":4,"cool":4},"3bvCo_Um8M9H5cTgCViDFA":{"text":"Always has been a favorite when I come to town. The hostesses our front tonight were absol","useful":0,"cool":0},"3Tsm2lxnc9mirtHITDXSgw":{"text":"The music is fantastic. They only get one star because of the terrible service. My wine ha","useful":0,"cool":0},"s3M8gzpFvFrAAkwQs8x4Ww":{"text":"While in NOLA, my boyfriend and I went to Frenchman Street a lot at night to get drinks an","useful":0,"cool":0},"ygdxYmBeHS7t0l91FzqHtQ":{"text":"What a strange experience.. first we asked the hostess for a table when she asked if we wa","useful":0,"cool":0},"cawHIRdMnO9IRDdY6DHd7A":{"text":"Really disappointed in the attitude of the staff and ownership no help.  Extremely overrat","useful":0,"cool":0},"gR6DzQbCQrXZHFH9rpMwfA":{"text":"Was here two days in a row. 1st day had the Bloody Mary & shrimp & grits. Excellent. Secon","useful":1,"cool":0},"xceuSaC5aPEuc2xv4Fqs0w":{"text":"Horrible experience. Had large group (7), was told at front door to come in. Went and foun","useful":1,"cool":0},"c4zd3D8xzcclC0kPglYv1A":{"text":"I came to the burlesque show on Sunday with a group of friends in town for NYE. We had tri","useful":1,"cool":1},"VeGtMiReJtA7I0y1Y2sdYw":{"text":"Excellent live music!!! I saw one of the best band ever.  Great crowd.  Mixed and diverse.","useful":3,"cool":0},"szH8KO53PtcybD8QROBfVg":{"text":"So read the reviews. Seemed good. Not so...20 mins for water...that was warm...cook on bre","useful":0,"cool":0},"owo9kDQJtQwdlicv_DvJfA":{"text":"1 pm drinking whiskey and listening to blues. I'll wager it doesn't get any better than th","useful":12,"cool":10},"FYyRyeC8ASWLlUeS3xnRtw":{"text":"We arrived and there was no one at the front door so we sat ourselves.   We were there abo","useful":0,"cool":0},"MOxrtFdn6QIIU3ZmFBbUrQ":{"text":"I was deeply disappointed by my experience at Maison. Coming from a customer service backg","useful":0,"cool":0},"8LENH1BOu5UdLce1H3lwUg":{"text":"Great spot for live music. If I were you, I'd dine somewhere else. The food is just okay.","useful":0,"cool":1},"JfAp2j4Bjxe-8tYqndeEeg":{"text":"**DECENT JAZZ SHOWS WITH DECENT DRINKS**\n\nWe were able to watch Yojimbo jazz band perform ","useful":7,"cool":8},"jEI7YIwygD1so70-ItEJOA":{"text":"This is a great venue for live, New Orleans brass bands. There are two main stages, a larg","useful":1,"cool":0},"A__gnxp-kg3eBI5B75C6tQ":{"text":"We only waited 15 minutes for one of the small round tables up front. Great view of the ba","useful":0,"cool":0},"ZY2nip4XnUWISojdSyeZXg":{"text":"Another requirement of our trip was to see some live jazz and we were able to do that at T","useful":2,"cool":0},"YbnoVYF4_xte5Jwh5MBfow":{"text":"I'm rating the location based off my experience at a mixology course we purchased via Grou","useful":0,"cool":1},"3p0BYb0ifNbKwVoEAVIjlg":{"text":"We stopped by for a drink and ran into the best jazz act we saw during the whole trip in N","useful":0,"cool":0},"HGDXDs5-XTmX88VzEaC00w":{"text":"Great drinks, great New Orleans Creole food, great service, great live music, and great at","useful":0,"cool":0},"HmO2TYqH8rM4fwNwv12Y3Q":{"text":"I have only been once, and it was a monday night. We started off at the spotted cat and on","useful":4,"cool":2},"VrG6I1PAirPhJ0idzepIag":{"text":"Awesome Mixology class with bartender Chris!!!!\nHe made the class super fun & informative!","useful":0,"cool":0},"nQjVgVqhAna65Ugn54FKtA":{"text":"We stopped in here for a drink and quick bite to eat, plus the live music was a nice draw.","useful":2,"cool":1},"zDreidB32ZeJ6cFNfVvr-Q":{"text":"I wandered into this place looking for a place to sit down after a full day of wandering a","useful":0,"cool":0},"CxEUyNrx_4XDaaOj5Yqdlw":{"text":"The Maison is on Frenchmen Street and has live bands performing. The night we were there, ","useful":0,"cool":0},"WBMYrk6UBWeyWd8RYJ4M9g":{"text":"So I found out that Macy Gray was having a live free performance here so I gathered my squ","useful":4,"cool":3},"xqPAqD5c6sTywXaKFQM6lw":{"text":"I didn't realize this place was vegetarian while I was visiting, and only discovered this ","useful":1,"cool":2},"y-AJj_kk6wTWFZBlOpfcGw":{"text":"We only stopped in for the live music and drinks, we didn't eat here.  It is a great spot ","useful":0,"cool":2},"pPG6UsN2bRSG9d-qzsc2qA":{"text":"I came back in November and had the gumbo and it was completely different.  Instead of sou","useful":0,"cool":0},"hkJk1eJh_ZfSDTAXGImLsw":{"text":"What I liked about Maison:\nAwesome band that played Little Liza Jane. Yay.\nGood amount of ","useful":18,"cool":16},"Kc4roBRq01V4pevHbvo8hA":{"text":"I was there last week for the second time. The first time was outstanding but the second l","useful":0,"cool":0},"2rlySm0FTyMk_77i4zI24g":{"text":"There was a brass band playing the night we went - they played Uptown Funk which was... fu","useful":1,"cool":1},"cEJb04nKkdestcpZPs2j_A":{"text":"R&B hip hop dance club with live entertainment for all to enjoy. College crowd, free entry","useful":1,"cool":1},"i7pkDLyG6ep79VeHNQBI5w":{"text":"The Maison was near the top on our list of places to catch some good music in New Orleans.","useful":2,"cool":3},"q5EJXKRLN7zM0Nv94k1uEA":{"text":"The Mom who takes her kids to a bar?! Oh hi, that's me! My kids have been honky tonk hoppi","useful":21,"cool":16},"o-sFxW_Bn_mISrAW0Muq0Q":{"text":"Great atmosphere! Table service was spot on, even if though they were busy. Front tables d","useful":0,"cool":0},"tvhybVxnNt7Uj7-b82DexA":{"text":"Need your ID\nNo cover \nWrist band given \n\nGood place to dance\nHard wood floors \n\nVery crow","useful":2,"cool":2},"49hWmki7RvPiM4DlDq_8Wg":{"text":"EXCITING TIME ! My wife and I love New Orleans ! How could you not if you enjoy interestin","useful":20,"cool":17},"tJVu1ZVffwhjaaeryWVKRw":{"text":"I went to Maison on the Saturday night before Halloween with a group of about 10-12 friend","useful":1,"cool":0},"djQgtWctEtjISIqG3_IX0g":{"text":"Out of all the places around Frenchmen Street, I choose Maison as my favorite place to kic","useful":1,"cool":1},"O12j9vMSDW89mAN0Ji_dWw":{"text":"If you're in NOLA in the French Quarter, The Maison is a must! The staff are very friendly","useful":1,"cool":2},"aY1gx0eZDiGPw843KXLwUA":{"text":"I had a fun time here.  Good music, good amount of space to either stand or sit, and good ","useful":0,"cool":0},"GxiELPDH6R1s7civutX2AQ":{"text":"Unbelievably rude security guard who tried to clear the tables before a song was over, and","useful":2,"cool":0},"RCxoaKnrgQ_aRF0k89f4ig":{"text":"The best shrimp and grits I've ever eaten. Speechless! Great jazz and swing dancing! Frien","useful":0,"cool":0},"0CourlL7IVgolJEQT4EL5g":{"text":"Such a cute jazz place. The food was absolutely amazing! Highly recommend their Po Boy (BB","useful":0,"cool":0},"Pi1C4UwY5feka5c4htQe3Q":{"text":"We participated in a cocktail class on a Thursday night.  This was definitely a highlight ","useful":1,"cool":0},"SA9szGnTgf_R3vT8bOSj1A":{"text":"We came here at the end of a nice walk down Royal Street and into Marigny thirsty and in n","useful":0,"cool":0},"hh2TdNBep5M_BVVZUxoYlw":{"text":"Great music. Good drinks.\nWent there waiting for our table at the three muses.\nGreat exper","useful":7,"cool":8},"DpbUn3YJ57Y3G1_EM1HUYA":{"text":"This place rocked the two nights we were in town! \n\nThe place I rung in my birthday at mid","useful":2,"cool":1},"Oad96yZF7SXKC7HZAeUv2g":{"text":"Maison is probably one of my favorite bars to catch a band on Frenchmen. The bars  long en","useful":6,"cool":6},"nwg3LLIjOe22DuRxOKHGOg":{"text":"If Bourbon street starts feeling like an all nighter college party and is not your vibe, d","useful":1,"cool":0},"_d7Yq-9WdIpdxgliSEdG1Q":{"text":"Table for 2 before 5pm avail in back. Still able to see luckily.\nI had food poisoning so w","useful":2,"cool":1},"hZB80rbCQWfNRsRH3G6kmw":{"text":"Horrible, horrible staff and service. Was visiting from out of town and heard wonderful mu","useful":2,"cool":0},"hFp4PMhnWP5EnVnuEYU6Mg":{"text":"This place has the least hospitable bar staff I've ever encountered in my life and I have ","useful":0,"cool":0},"Y34g-VFHK_HTpZ5gcBiGxg":{"text":"I was really hopeful for a good experience here due the to prime location and solid reputa","useful":2,"cool":0},"_WbLOm5ntMJdQ9rVc6awAQ":{"text":"This review is for the mixology class that they offer...\n\nPurchased a Groupon for the mixo","useful":0,"cool":0},"FbpcgkYF6yHeXhlsY578zA":{"text":"My friends and I are 21/22. We came to New Orleans for a fun weekend get away. The bouncer","useful":1,"cool":0},"DzioLdG1CmFhIAVSE8QQ0Q":{"text":"I really enjoy this bar and live music venue. We often go to Frenchman street and wander a","useful":2,"cool":1},"rmvuyjD5PgmOaQtXjMhSow":{"text":"Yay!\n\nThis is a more swanky spot to listen to some tunes and get your drink on. After we h","useful":1,"cool":1},"LG6MrVbpi19msU4ky1Zs0w":{"text":"Very authentic NOLA experience. My first time visiting and was blown away by the musical t","useful":0,"cool":0},"Im6qKsgGdXLr0mjBrTmdHw":{"text":"Love this place! Super quaint and awesome local bar on Frenchman Street. Saw the Reggae Ba","useful":1,"cool":1},"zaj8egmV7IM695KHRegm5w":{"text":"Not only the worst venue in New Orleans but also the worst venue in the entire country. im","useful":1,"cool":0},"A8jhvl5YCHSslYtv5Y0BOg":{"text":"The Maison has such a good space, a lot of room and the wait staff was hot, hot, hot, ha! ","useful":1,"cool":0},"uiUrdb6xq0lGvuctWXOSKQ":{"text":"This venue is the worst to rent out. My sorority rented it out and paid good money to enjo","useful":1,"cool":0},"z7shk0z3Ryp54v8eaMHqcQ":{"text":"What a fun bar with multiple levels. Each level has a different music scene. While the fir","useful":1,"cool":1},"Foitjs4wVgGNIWfolwASLA":{"text":"Live jazz dive-bar-style.\n\nTHE AMBIANCE:\n\nWe were in NOLA and wanted to experience some li","useful":7,"cool":5},"FpDcmo-aiHv7vINDu74Few":{"text":"Love this place. Great dancing. Upstairs and Downstairs. Good bartenders. Late night. Frid","useful":1,"cool":1},"WcFuOcrez3Oq1_BqwpzAfg":{"text":"Came by here after dinner to check out more of the Frenchman Street music scene! No cover,","useful":1,"cool":0},"zHSzYOSebHPCwMQuX2vn7A":{"text":"I only stopped in to see a reggae band perform so I don't have any experience with bar or ","useful":3,"cool":3},"VVZl0Ew4TkJw0j7n5ciCSQ":{"text":"The only bad thing about this place is the size. The first floor space is small, so people","useful":3,"cool":2},"G_LWq7_4F3Bd8ffYpCtyRw":{"text":"Came here on a Sunday night after recommendations from friends. Delicious drinks.  Great a","useful":0,"cool":0}}