{"Cx9MW2uuz9V0HiJUEdIbvw":{"text":"I ordered a chocolate chess pie and caramel cheesecake to share for my friend's birthday (","useful":0,"cool":0},"4qL9LBYRHwR_Jfz7nIG97Q":{"text":"Wonderful sweet potato pie that he torched to make it have that caramelized crunchy top li","useful":1,"cool":0},"rER_UbSI5bDh7S2QY4Bo1w":{"text":"These pies are outstanding! We worked with the Pie Guy to get 5 pies for our small wedding","useful":0,"cool":0},"N3zox_pr1Y-g7Zv3WROYPQ":{"text":"Chef Winner's pies are perfection...my fav is the chocolate!","useful":2,"cool":0},"g2SvxlqOou10X4YIPE5YkQ":{"text":"We ordered pies from NOLA PIE GUY for our Thanksgiving tented, outdoor, 24 person event. H","useful":1,"cool":0},"JO7yGW1Oaty60QjGMC6kTw":{"text":"Oh Jesus, pie. Pie pie pie pie pie. If I were given one dessert choice for the rest of my ","useful":11,"cool":2},"x4xQd96XGwf9qo8cZHZsCw":{"text":"Im not a person that loves cream pies but the chocolate pie he had this evening was great.","useful":2,"cool":0},"GTO2XaNB4nSgTTrP7oJWWQ":{"text":"I had the privilege of tasting one of Nola Pie Guy's delicious pies (chocolate pie) at the","useful":3,"cool":1},"cqkmBt4FLmjrn2W34P3NpQ":{"text":"The cheesecake pie...Excellent rich flavor with the creamiest consistency....it was so goo","useful":1,"cool":1},"1ep3bydLq_dh6VuxjCJWgg":{"text":"So, SO yummy! I'm at college now, but I always make sure to grab one (or two) when I'm in ","useful":2,"cool":1},"1Onv8vd02Cdd2uphBPz-wg":{"text":"I love pie and that is the one baked good that seems in shorter supply around NOLA. Enter ","useful":3,"cool":2},"rmzC2cHn5q-bZHmia2SwDw":{"text":"We ordered some pies for our wedding and were very impressed! They were delicious, deliver","useful":1,"cool":0},"R-ARRI4Jnm7KL5eFywPCKQ":{"text":"I had the most amazing chocolate pie of my life from the Nola Pie Guy at an event.  I've h","useful":5,"cool":2},"jQeLS2eX_GeR8ro7KS2XCg":{"text":"Nola pie guy totally came thru for me this weekend. My husband loves lemon meringue pie bu","useful":0,"cool":2},"kKPVjfvAIuF7NSUkiBkAvw":{"text":"Awesome pie.  This guy seems to be everywhere around town - one of the hardest working pas","useful":1,"cool":1},"r1OMnIS-HW4d9J47oM8pMA":{"text":"I ordered a pie for myself for my birthday to share with friends.  After trying a sample, ","useful":0,"cool":0},"WvQrDked-kgjQFDl21L8cw":{"text":"Smashing Chocolate Pie!!!  I am always apprehensive when trying peoples pie other than my ","useful":0,"cool":0}}