{"KzJJt9ap5yc5McjVpnxfcg":{"text":"Stopped by over the past weekend around noon. I was not a guest at the hotel, I just visit","useful":1,"cool":1},"Yk7Q4tvkqPsPaK90y_pACw":{"text":"Sir Richard, I'm writing this review right now in my room. How could you do me like this, ","useful":15,"cool":16},"mqksNkYqdq1gf1gD_4EsFA":{"text":"The VP Owen from Miami made the pool deck an incredible experience. The hint of lemon-gras","useful":1,"cool":2},"WaTgQ_C-Xqz3XnzpHC2dkA":{"text":"This place is amazing.  Beautiful! Great drinks! Bartender Christy us the BEST. Food is de","useful":1,"cool":2},"I4jzt3zx2dKXXmfAeW15bA":{"text":"If your looking for a chill place to relax, soak up some sun and sip on a cocktail well th","useful":1,"cool":1},"nTO13fZOIwZ7k2gM9l19NA":{"text":"Amazing experience. The hotel front desk/concierge staff is amazing, the rooms are amazing","useful":0,"cool":0},"50b8zLckjQrkOPqLa9uzgw":{"text":"They wouldn't treat me like im a true guest. Which is sad. I paid more than enough money a","useful":0,"cool":0},"yi0xqf3lpsNvO8uLks6CYA":{"text":"Such a trendy hotel and nicely decorated restaurants, roof top, and private space named \"T","useful":6,"cool":7},"qHMPNtvGclzfy1VNVBYpDQ":{"text":"By far some of the nicest hotel staff I've come across in a long time. From the moment you","useful":0,"cool":0},"7Xl1iKf9rDeZ1LFeDHbnCg":{"text":"Just got back from a 5 day stay and I can't recommend this place enough. I travel a lot fo","useful":0,"cool":0},"4YsF6sMWonXAYA8RDH94dA":{"text":"Our stay was overall pretty nice. A couple of things to mention - a hot water was not real","useful":1,"cool":0},"CsgTGpck1ROBXRaOXIOfwQ":{"text":"Booked a 3 day stay at this hotel through Hotels.com. 3 days before I arrived, I cancelled","useful":0,"cool":0},"XHLO2sagdWV6Eb7gGrshBg":{"text":"fun and inviting hotel! Fun first floor bar located off the lobby with lounge for work or ","useful":0,"cool":0},"kfPS3d-zuTvQgTh9d5ONWA":{"text":"The virgin hotel New Orleans was amazing, I was blown away by the breathtaking view on the","useful":1,"cool":3},"iQOe9kR5dOJxlwTiuWYjxQ":{"text":"Virgin Hotel New Orleans just opened and is definitely a cool place to stay or just visit ","useful":3,"cool":2},"NME-16B5CNlx6kZ1-TEgPg":{"text":"This review is for the rooftop bar only. What a view!!! WOW! We had a lovely little corner","useful":6,"cool":3},"WFdqf2m6Vxk-YPBxFhsQlA":{"text":"Super cute new hotel downtown on Barrone! It's definitely a new hotspot with good drinks! ","useful":5,"cool":4}}