{"SRZuFQyTWxfNkhUO_tf7KQ":{"text":"Driving down St. Charles while visiting NOLA saw the sign & oh so glad I wondered in....th","useful":3,"cool":2},"AqEWU5T1qMq38Koq1RfsJw":{"text":"This fabric store store has so much rich history behind it. The person that owns this stor","useful":4,"cool":0},"ZI6xSLLFu8ZY8mjSWRusbA":{"text":"Promenade Fine Fabrics is my favorite fabric store.\n\nWhen I first went into Promenade, I w","useful":3,"cool":2},"Oj9VSQ88F9FMdSmyX7ZbwA":{"text":"Thank goodness fabric stores like Promenade still exist. I could spend hours perusing thro","useful":1,"cool":0},"psXRGV7yiLaWHjzrUtq5Xw":{"text":"If you are looking for unusual, even one of a kind fine fabrics for dressmaking, upholster","useful":1,"cool":0},"SZ7ZGxuT87KnhFFAywGsWQ":{"text":"Promenade Fine Fabrics is a wonderful store.  I was visiting New Orleans last week and cam","useful":4,"cool":0},"987cjpcnB59dj8BS0sJprg":{"text":"Amazing. I have shopped for fabric in NY, Paris & every where in between. The service was ","useful":2,"cool":0},"l0ljkfoKyKFTn6sZcAtgeg":{"text":"I stopped in to see if they had some elastic material I could use to make a tutu for Hallo","useful":10,"cool":5},"sR3BBodnwV7c84Nl1wKGcA":{"text":"I literally could hear the angels sing when I stepped in to this store.  I have been sewin","useful":2,"cool":0},"bcWdDlaXAF_HgwWvf6IVKg":{"text":"I am an occasional customer at fabric stores.  I was looking for material to line a cigar ","useful":5,"cool":1},"UpFjO8uZRdI-wwtihEP2Yg":{"text":"My first visit!!!!  I LOVE this store.  There are sew many fine fabrics.  I was like a kid","useful":2,"cool":2},"u2tyLii7PlC7FfVqRuX45g":{"text":"I came in on vacation as it was my birthday -- what a place to buy yourself a birthday pre","useful":1,"cool":2},"K7AQHhy7CisrJiB573rklQ":{"text":"A stitch in time! So grateful to find this well-stocked Fabric store along St. Charles Ave","useful":5,"cool":2},"VmxUl6Z-9_FMlLeYL8ot4g":{"text":"The couple that owns the place is very nice and helpful and they had a large selection of ","useful":1,"cool":0},"5fUmICt3GE2fyBogw7nidw":{"text":"Stunning fabric selection, trims like nowhere else, and buttons galore.  New Orleans is so","useful":9,"cool":3},"2nRodUBmIywUu_uBE-En7Q":{"text":"A fantastic selection of rich, supple fabrics for clothing design. There are name brand fa","useful":9,"cool":0},"v0D1n8Ja_wKpzIDkxUHtdg":{"text":"Great fabric, some gems, some frogs, a little bit of everything. That's to say in and out ","useful":3,"cool":2},"514_Blobloi1wkRVnk-XNA":{"text":"This place is The Real Deal! I just bought a one-of-a-kind vintage French silk chiffon her","useful":3,"cool":0}}