{"27CYrDqJIUjbOLNeKTfjDg":{"text":"It seems to me that whenever we have out of towner guests, our go to place is consistently","useful":0,"cool":0},"F8ou_CrcYtxEraU7b6_Piw":{"text":"OMG! Breakfast pizza and bottomless mimosas and bloody marys. Is there anything better in ","useful":0,"cool":0},"MSt3hkzLBmIy8b8VwXlC7Q":{"text":"Katie's is a neighborhood restaurant that has existed in one form or another for a few gen","useful":0,"cool":0},"TQwfycO0D98TPOQsdnR-aA":{"text":"The food was amazing!! We tried a little bit of everything. Had the crawfish beignet, seaf","useful":0,"cool":0},"vGvezUhxQMy2rMpx9zT33w":{"text":"The food is always excellent.  However, it is very difficult to hold a normal conversation","useful":0,"cool":0},"cD40Ck1_FoKBFyIjU40CVA":{"text":"An absolute gem. We were determined to hit a Diners, Drive-ins and Dives restaurant in New","useful":0,"cool":0},"k4Ft-m9BZi9i47ECk66IUA":{"text":"Came here for dinner with local and out of town friends. Service was great and food was ev","useful":0,"cool":0},"JW4AlHEOqvhiH7O3z7sh4w":{"text":"The food is excellent and the service was awesome, and Scot the Executive Chef and Proprie","useful":0,"cool":0},"BrClEWprabRjOwUghh6JIA":{"text":"Katie's has been a frequent stop for me when in New Orleans but usually for lunch or late ","useful":0,"cool":0},"uFQp6bZpJbdtSP936WBNQQ":{"text":"The exceptional customer service I received even before I was in town made this place wort","useful":1,"cool":1},"5uKf9GL6jEbap4GzQZvoUQ":{"text":"My first impression of the menu was that it was a little on the pricey side for what is se","useful":4,"cool":1},"HwQNO5juybiFKZNh2tBOXw":{"text":"Bottomless mimosas, sangrias,  and bloody Mary's for $15 at Sunday Brunch. Expect a wait. ","useful":1,"cool":0},"VPdmRn386UOGs5z9GQHXhA":{"text":"If you ever want brunch on the weekends, then this is the destination. The dishes are so c","useful":1,"cool":1},"lVrDdmBYZwyfoEhsnNGyzA":{"text":"I wish I'd checked into this place to prove my attendance, but I submitted a picture of th","useful":1,"cool":0},"_ofccT9KIv1j7StmF-REFQ":{"text":"Fantastic grilled oysters to start. Muffeletta was good. White chocolate bread pudding was","useful":0,"cool":0},"T6MIfM0YNw_jKY3hrH6ROA":{"text":"Original menu and great place to meet up. FYI the crawfish beignets are great but it's not","useful":0,"cool":0},"uoWjdpjuAuGLsD_yQ2ZaQA":{"text":"This place is really amazing! Its definitely a hidden gem away from the major city streets","useful":0,"cool":0},"O2EOKY6UmC3STbXM_l1lxA":{"text":"Food was a bit bland. I didn't feel the taste was worth all the calories I knew I was cons","useful":1,"cool":0},"X1rlHz-UK_NuB204Zr-KrA":{"text":"This is a great neighborhood spot. They have a great bar with a good spread of bourbons. M","useful":0,"cool":0},"YPRttqwhq_dYzXm6dDY1eA":{"text":"Katie's is a must for those seeking New Orleans contemporary classics.\n\nThe poboy list was","useful":0,"cool":0},"CzM1wKxhDnz0hlr3ZXpMag":{"text":"I LOVE Katies.   This is a neighborhood locals place with a serious chef and a great menu.","useful":0,"cool":0},"RWvNHRqERPAiXYud7X2ptA":{"text":"Best veggie Muffaletta. Eggplant fries were amazing. Table service was fine. Hostess stand","useful":0,"cool":0},"HSY42WPT1SPFF0Lpi6zIDg":{"text":"Yay for local flavors :) warning: do not come here to eat if you're on a diet haha...\n\nMay","useful":1,"cool":1},"YldKENw2swK8ef_FmrdaYQ":{"text":"I've been to Katie's on quite a few occasions, and overtime the food was absolutely delici","useful":0,"cool":0},"b8p92lD2HWLKX3V9hw-1gg":{"text":"Ready to fall in love? Want your little broken heart to be mended? 2 words...Seafood beign","useful":0,"cool":2},"qxNg92CwWPoI_xbQvkN2kg":{"text":"Some of the best eats I've ever had !!\nThe Crawfish Beignets and Crab Cakes are worth maki","useful":0,"cool":0},"NmpxkarV80BxKG-bK1dyIA":{"text":"While on vacation during Mardi Gras my friends and I ate here twice!! The people were supe","useful":0,"cool":0},"r06vVmmb-bpD_LowgstZ1w":{"text":"One out of three dishes was good. I ordered what was highlighted on Guy's show. The chargr","useful":1,"cool":0},"79EA3Caffj5ciIzxV8q6Dw":{"text":"Our property manager recommended Katie's amd we're glad he did. Seafood ravioli was excell","useful":1,"cool":0},"X5YlT4u1HK1G3px5j2h8Sw":{"text":"Where do I begin? Katie's is my go to place for any occasion. I could go on for days about","useful":0,"cool":0},"VR9Po-c6C3QE-D4Hc0wqCA":{"text":"This restaurant is a great addition to New Orleans. The food is delicious, the portions ar","useful":0,"cool":0},"SBKJPoW-kcrNjO34C8W-1Q":{"text":"Fantastic brunch!!! Bottomless mimosas, sangria, and bloody mary's don't hurt either! I am","useful":0,"cool":1},"NJz8PcQsfiNsc85ayKnc8Q":{"text":"GREAT PIZZA!!! Super good place to take Vegetarians! \n\nAwesome location in Mid City, right","useful":0,"cool":0},"3TnN4dM82ba1QsDosmOv6w":{"text":"We had not been to Katie's since the flood and boy am I glad we went back!  The chargrille","useful":1,"cool":1},"67B-r4saaU9WojDBjLtZNA":{"text":"A nice brunch spot with traditional NOLA foods. Be prepared to wait if you're going during","useful":0,"cool":0},"SBqhNhMS5WuCikkAiaHuPw":{"text":"You must check this place out!! \nOYSTERS SLESSINGER!!!! Just wow! You cannot go to Katies ","useful":0,"cool":0},"09soE6obWtGyeZG8SwiEYg":{"text":"Really good food!! Guy Ferrari ate there and that's what prompted me to go and thank you G","useful":0,"cool":0},"9Spl_YPvVYA6IzeWQLPWEg":{"text":"Yummmm! I had a person recommend this place before we went to New Orleans after Christmas ","useful":0,"cool":0},"ImaL_0cS8zkJhUVFMJjU-g":{"text":"We stopped in for lunch. We started with the Crawfish Beignet, which is really not so much","useful":0,"cool":0},"XyadhgwyDobcgSWdAlH4pA":{"text":"Love love love everything they make. There always so busy and still are able to give aweso","useful":0,"cool":0},"Z2t5HC4DlZ6PkH3QgVP-jg":{"text":"Great atmosphere, usually good service, and a nice bar, but the food here (from the seafoo","useful":0,"cool":0},"panUeZAzPUdh7MGbjMMPJw":{"text":"Chargrilled Oysters is all I have to say. Wish we had places in Houston that can cook up a","useful":0,"cool":0},"NKvRgQDALXr4SVKL3G6-Ww":{"text":"AMAZING FOOD. We ordered the shrimp po boy, crawfish beignet, the Remy stack, and an order","useful":0,"cool":0},"64YTJIGXDwc-6NdABEDVIg":{"text":"The first time I came here was for a birthday dinner and it's become a favorite ever since","useful":1,"cool":0},"tzysxM6jXs0IYlomA0WdMg":{"text":"My girlfriend, roommate, and I came here this past Sunday for brunch.  I'd been here a cou","useful":0,"cool":0},"rr72SSx3YKz-aceVfEGCdw":{"text":"Picked Katie's from a list created from research on NO restaurants.  Glad we did. First of","useful":0,"cool":0},"uxR5p2hl1PkkUhrF7HZRFA":{"text":"We were in NO on vacay.  This was the best meal we had!  Scallops, shrimp po boy, chicken ","useful":0,"cool":0},"gW0c33UJ3bF8Qu6dMAFEHQ":{"text":"This is one of my favorite restaurants in NOLA!  I come here Everytime I'm in town.  Such ","useful":0,"cool":0},"C674k8DqWfAbo41Q_aKmiQ":{"text":"Went there a few years ago for the first time.  Visited last week. Still a good as ever!","useful":0,"cool":0},"qCFl49RC-0mWV1piNAIVtg":{"text":"This a really cool local spot with great food. The crawfish beignet was excellent! I didn'","useful":0,"cool":0},"E1_H3mR23uIhUjcoJsoZRw":{"text":"I very rarely give 5 stars but I have to because of the food!! Guy Fieti agrees, he has be","useful":0,"cool":0},"QnQTaIdH-0Mp9WEso9tmLQ":{"text":"This is my \"go to\" place for entertaining out of town guests. Katie's never disappoints wi","useful":0,"cool":0},"KCg5IM3cwLH5rCtuWA8pRg":{"text":"If feels tinier than it actually is when you're walking in.  The first floor is still a de","useful":0,"cool":0},"v6-qGNtKyykZNcyBqURPUA":{"text":"Great experience to lighten up a cold-rainy day in New Orleans. \n\nWe came in on a Saturday","useful":0,"cool":0},"uKzTVNUzC94qmgATvUfj_g":{"text":"Rushed service.  Crawfish beignet was not a beignet at all but a cheese calzone with some ","useful":0,"cool":0},"T1Uq-yiJ3GmnKR24-S1uHA":{"text":"We just had our wedding rehearsal dinner here and everything was phenomenal! The food, dri","useful":0,"cool":0},"do3BX3kIBDevxXMjdrTsUw":{"text":"We were told the wait would be 30 mins for brunch, so we decided to wait rather than move ","useful":1,"cool":0},"nM7J6yFDhqDO3rQ1dtaVMg":{"text":"We discovered this gem of a neighborhood restaurant quite by accident. The service was fri","useful":0,"cool":0},"fwRT5K9SJ_jVX_pG_FM1Wg":{"text":"My friend and I enjoyed our late lunch.  The food was good.  I'll be back soon for brunch.","useful":0,"cool":0},"JSh_cmBdyKCihYd_9pVlvQ":{"text":"Really delicious food and pretty quick service considering the wait to sit was an hour. Do","useful":0,"cool":0},"_fwinrJfC3lUH5vQ-aS4qA":{"text":"DELICIOUS! I heard about Katie's on Diners, Drive-Ins  & Dives a while back. My husband an","useful":0,"cool":0},"ppZXI_wrsoIuAZMuqRVRgQ":{"text":"We always go here for lunch on the weekends.  The food is always great and I love a well c","useful":0,"cool":0},"SmBDZkwPnr8SkeaoyZJy6A":{"text":"This place was delicious! I ordered the Alfredo with fried chicken on top. Delicious!! The","useful":0,"cool":0},"BDlc9KFfM0K6liAogHTPwQ":{"text":"Went for Sunday brunch and have to say the wait wasn't too bad. I had the shrimp and grits","useful":0,"cool":0},"FF2qZte98xlSv10Ej5PAJQ":{"text":"I was in New Orleans for the French Quarter Festival. Took the Canal street car to Katie's","useful":0,"cool":0},"Ul8Pi1XFJuMCPW-FGtYxDg":{"text":"The cochon beignet was FANTASTIC!!! Service was top notch. I definitely recommend.  I wish","useful":0,"cool":0},"d20stFdI3BLal5bNjhZIIw":{"text":"So the crawfish beignet is the best appetizer I've had in Nola.  Life changing even.  I ha","useful":0,"cool":0},"VrhQO_2InPFiYRAO_-imGA":{"text":"Plenty of options to choose from! Has unique foods from crawfish beignets to build your ow","useful":0,"cool":0},"ZoIE_eAd98DT4-lkz_Ri4g":{"text":"Yikes! Defiantly a miss for us tonight from start to finish. The stuffed mushrooms had a v","useful":0,"cool":0},"WMvn7b0xHdn8qhvnp032xA":{"text":"This is one of those reviews where I wish I could give an extra half star. The oysters wer","useful":0,"cool":0},"UKSVlXoHMGj0TPOcMLbBeg":{"text":"Katies has lots of great items to choose from.  I'd give it a 5 if they took reservations.","useful":0,"cool":0},"bT4lPTFzKa2XRoq0UOM8kw":{"text":"oh my gosh...I don't see what the hype is about. \nCrawfish beignet isn't remotely like a b","useful":0,"cool":0},"3aN9EdosluivZJenDcyIGA":{"text":"Amazing food and service! We had dinner here while in town for a bachelorette party.. We a","useful":0,"cool":0},"n3c77pU2wv2NKJS-GB8E0Q":{"text":"This place is soooo good. I've been here several times and it doesn't disappoint. Today I ","useful":0,"cool":0},"G1E3uDy0i_oSLdKREhXk6Q":{"text":"I made a reservation for about 10 for a birthday brunch. They don't normally take reservat","useful":0,"cool":0},"tSF_2rA1ZRJOHhkJeMy2yQ":{"text":"The evening started out great..10 min into being seated after ordering and served cocktail","useful":0,"cool":0},"RKIqohpTmKJcgT1OYvIUxA":{"text":"There are few things that get you excited about a meal like the smell of the smoker outsid","useful":2,"cool":1},"L2tCTp36iyISKvHqWTV62w":{"text":"Another of my must haves whenever I come home to see my family. Amazing. I have not eaten ","useful":0,"cool":0},"50YqFLfXZoGOJudTBWKDZA":{"text":"Best little place in town. I had one of their specials \"Seafood Ravioli\" and boy! boy! boy","useful":0,"cool":0},"8BC5oHydbvos2mVD8WyK7g":{"text":"Delicious.  The seafood beignet was to die for. The stuffed shrimp and seafood pasta was g","useful":0,"cool":0},"FlE-e8c0qMKdKxgNSmxZvA":{"text":"Great neighborhood restaurant!! The staff are amazingly friendly and helpful. I started of","useful":0,"cool":0},"XedwKiQLivAeopPx0HOrhw":{"text":"Food was just OK. Expect to wait a while to be seated and served. The oysters were good. T","useful":0,"cool":0},"Ko_7yOR4m_18ZMzVVJ4CbA":{"text":"This a great neighborhood spot with a wide variety of great food.  I really enjoy the spec","useful":3,"cool":2},"kKqkbNCGEz_HrzUDnlz8jw":{"text":"Tried this place during Endymion parade day! We needed to fuel up and got it to go to eat ","useful":0,"cool":0},"smB1tBvrcEETFOh-N7FOzA":{"text":"Amazingly I had never been to or heard of this place, once again yelp comes through in the","useful":0,"cool":0},"5U2shjqYmnCefZ0Kg6w5nw":{"text":"I wish I could give this place more stars, and I wish I'd be staying in New Orleans long e","useful":0,"cool":0},"TOd50goFC4LmW5I9klvhgg":{"text":"Totally best neighborhood grill in New Orleans... if you only go to New Orleans once.. thi","useful":0,"cool":0},"dv9qyIU2l3JfMeWWxCYECg":{"text":"The food here is always hit or miss for me, and the last time I was there the service was ","useful":1,"cool":1},"100KOMAbRIdPD6Jdh1NjPQ":{"text":"Such a great local place! Never get tired of going here. Never too long of a wait, food is","useful":0,"cool":0},"0QCwtqLL9sV6wqpfk-v5Ag":{"text":"Amazing Spot, Hidden Gem, Great Food, Amazing Service & Memorable For Sure!","useful":0,"cool":0},"XRcjX6eQgqSUYhyJHNvw_A":{"text":"The food at Katie's was great, it was a wonderful place for Sunday brunch! They had a dive","useful":0,"cool":0},"YmZhXIVEfYapM6R89-B1bQ":{"text":"Scotie Breakfast Special....Awesome service Que was a great waiter awesome bottomless mimo","useful":1,"cool":0},"8fQk8_96HSH3V39bo5ctWg":{"text":"The charbroiled oysters were the best thing about my meal tonight.  The server was less th","useful":0,"cool":0},"OJyO5cmBaecDTe5LM2SXZA":{"text":"Some the best food I have ever tasted, definitely a place to go back, I had ordered the Ha","useful":0,"cool":0},"UF8t6Dd4o1H5lSPBrkWoEg":{"text":"If I could rank this place with six stars, I would.  I had the Shrimp and Cochin au lait s","useful":0,"cool":0},"Vb7gMpXpX4bKQqHuU_kJMA":{"text":"Best grilled oysters in the city, hands down. The Sunday brunch is delightful, especially ","useful":1,"cool":0},"ACHJq1YB2D2da7b82peF1A":{"text":"Damn awesome brunch! Bottomless drinks, great food and bottomless mimosas. We waited over ","useful":0,"cool":0},"VgRqtP0GC8Pav806KKv0FQ":{"text":"Read the history of the place on the site. Great story, great service. Muffalleta, Cochon ","useful":0,"cool":0},"vIknc790kHiiGj5KDvYJdQ":{"text":"Oh man. I don't think I can say enough good things about the food here. We had the crawfis","useful":0,"cool":0},"5sFt5EkylijSxNPnmGMmzA":{"text":"I'm new in town and was looking for a Saturday brunch.  I initially found this place on Ye","useful":0,"cool":0},"D1qCZhz02tLy2k8Tt2VAhw":{"text":"I drove all the way out here for the Cochon Boudreaux Pizza. This is another cute establis","useful":0,"cool":0},"iybCpC5zu-wBB2BLh6vBNg":{"text":"Went here for lunch on a weekday and it was packed, mostly due to a couple of high school ","useful":0,"cool":0},"AXc1j8MPprtqT4LKay5Z_Q":{"text":"Great lunch.  I didn't have it but the guy next to me at the bar had the pasta stuffed lob","useful":0,"cool":0},"Z2roM3zJSM_oFUcmWyzA3g":{"text":"Amazing food!!!!! Had Katie's Cajun Cuban and it was delicious! He a taste of the burgers ","useful":0,"cool":0},"T_wbzcz6hKSWvzVbHIppSQ":{"text":"I went back to Katie's after my first experience and I must say it was a very enjoyable ex","useful":1,"cool":1},"c3zemShLFLipLTHPsIzoTg":{"text":"The crawfish beignet and chargrilled oysters were delicious!! My 10 yr old enjoyed the spa","useful":0,"cool":0},"yJFJmZv--i-bbkeVjD8YoA":{"text":"Amazing food, beer, and cocktails! Our waiter Que was the best! He was knowledgeable,  att","useful":0,"cool":0},"dnquxzmmFTPUeLDiVF3BPw":{"text":"Katie's is a great place to get classic southern food, some of which has some modern updat","useful":0,"cool":0},"cZxnOacY5IBGkN5u8cqfRA":{"text":"First time at Katie's and it won't be my last. We had to wait about 10 minutes to get seat","useful":0,"cool":0},"YYZJoV0GIqEKP54XqQIRSA":{"text":"What a great Sunday mimosa brunch! Bottomless mimosas, sangria, or bloody Mary's for only ","useful":0,"cool":0},"06B3bWMPwnrYR7f5zw0x_g":{"text":"Absolutely wonderful find! Be careful your eyes will always be bigger than your stomach wi","useful":0,"cool":0},"7LsLaNKkzZ3ljw1jHV2Y_Q":{"text":"I came here for the first time outside of the great brunch they offer on the weekend. This","useful":5,"cool":3},"h0yfHAz1ZTWrxMFy3djdLQ":{"text":"The crawfish beignet is one of the best things I have ever had in my life. Doughy and swee","useful":3,"cool":2},"xEqgM7iXaOr14y5jbNxTKg":{"text":"New Orlean's best restaurant HANDS DOWN!! Scotty & crew kill it! Best chargrilled oysters ","useful":0,"cool":0},"w0_HtpZ4z3ThuI5EfG1QyQ":{"text":"Not a bad place for lunch sandwich or pizza. Very limited entree menu. Catfish meunière fi","useful":0,"cool":0},"zaBZa27Ihysgcc9nbUwX7Q":{"text":"Sooooo Good!  A must stop!  I had the Legend.... Cajun pork and BBQ shrimp sammmmmich!  Th","useful":0,"cool":0},"u-KVunhLSWGuTyM7YQYoYg":{"text":"In many ways, I'm a creature of habit, and when it comes to dining in Mid City, my \"habits","useful":8,"cool":7},"UiyUh8MzaYl5b5jtNGcjZA":{"text":"Came for brunch on Sunday around 9:30a, solo. Sat at the bar because I got in before the c","useful":1,"cool":0},"hhJid42TZRQBxYLayOxGvA":{"text":"This guy at the front desk wouldn't sit us because he said we were only 2 so we had to wai","useful":0,"cool":0},"qrSeNETN22JVV1eU9bsguw":{"text":"Katie's is amazing and always aims to please. Their Food is outstanding and their prices a","useful":0,"cool":0},"V9zSUSCRabhJFgXfqM5jbQ":{"text":"Just picked up lunch from this cute Mid-City spot, and I can't wait to go back. Ordered th","useful":2,"cool":2},"T6ebdFThbuRGu5T7pLcDeQ":{"text":"This place has anything. Seafood, pizza, italian,sandwiches and po'boys, and other homemad","useful":0,"cool":0},"9RsXc1wpNEhD3kJ211mI5A":{"text":"Love this restaurant. Bar tenders can be snobby and absorbed in their own convos but TOGO ","useful":0,"cool":0},"JUq1OUMBASNTAzgDl0svOg":{"text":"Had lunch yesterday.. food was good.. like how fried green tomatoes and shrimp was put on ","useful":0,"cool":0},"5KvegC7K2P84kA0OLJ7ARw":{"text":"Katie's made me want to quit my job and move to New Orleans. The food was great and the am","useful":0,"cool":0},"rii18-fkM_nECnt3Qbh76A":{"text":"Just ordered the garlic feta fries and the crawfish beignet. Amazing! Jeannette and Brian ","useful":0,"cool":0},"XGG4T0FQvptOB_VGUTl9wQ":{"text":"Katie's always has a selection of interesting lunch specials.  The sandwiches a generous a","useful":0,"cool":0},"aibEYYVWRxzEcfXf2oG4IA":{"text":"I would have loved to give this place 5 stars, but I couldn't. I went for the Cochon du La","useful":0,"cool":0},"RlBn9NnUHurm4mk_xTFNOg":{"text":"I feel like I should pull out a hula skirt and start dancing. The hula girl pizza it's lik","useful":7,"cool":4},"XNuyhbpzaMjexQGM3ACOVw":{"text":"Went here on a Sunday for brunch with 3 other friends. Was shocked when we didn't have to ","useful":0,"cool":0},"c1o1-GxkHFTFkDQQx2X2cg":{"text":"Sunday brunch at Katie's was no lie the highlight of my 4-day trip to New Orleans. We star","useful":0,"cool":0},"QyWGGUCcyP3nkNaNUpfDpA":{"text":"I've been in the hospitality industry for 20+ years with 18 years in management and have n","useful":1,"cool":0},"rwkh38MAvAspYofev954cw":{"text":"Good food, good drink..... no bad stuff per say that you won't see at every restaurant of ","useful":0,"cool":0},"uBJy4CjquVlq-cgRqhrdew":{"text":"Great food, interesting combinations, NOLA specials. You can't go wrong eating @ Katie's! ","useful":1,"cool":0},"AXgH-N-agEyLqksG1Y8g4w":{"text":"This place is amazing. Total neighborhood gem with a diverse menu and great specials that ","useful":1,"cool":0},"iz1hRvP1oBiO6OjyjrvMzw":{"text":"This place is in incredible. Really fun atmosphere. We've had delicious brunch before, but","useful":0,"cool":0},"yNb3wC0XcKeV59iP-__3gA":{"text":"Meh. It was a Monday and Liuzza's was closed, so I went to Katie's. \n\nThe chargrilled oyst","useful":3,"cool":0},"irDE5tb2-MyzxZBag27cdw":{"text":"Cuban Sandwich YES\nSeafood Ravioli YES\nFried Green tomatoes with Shrimp Remoulade YES\nSeaf","useful":0,"cool":0},"wDkQ7dBgU7SYhXcwLliALA":{"text":"I love this place.  I grew up coming here.  The food is great, and so is the atmosphere.  ","useful":0,"cool":0},"4OmJy04EVNI3iEVuLsaeKA":{"text":"Great bar ... the food is always good! The chargrilled oysters are awesome! The owner is v","useful":0,"cool":0},"GUtuAhwHFmMiwRjhlzgivw":{"text":"I've tried reaching out to this business and every time I called, they immediately hung up","useful":0,"cool":0},"XBGQ52TWtzTt0S15K3DuKw":{"text":"Great New Orleans neighborhood restaurant.  Service was excellent by Leo.  When I did my Y","useful":3,"cool":3},"MeK5wixsvrDOCYyYg1Y_EQ":{"text":"My wife and I just vacationed to NOLA and this place was recommended by our innkeeper.\n\nTh","useful":1,"cool":1},"I_VOn-9l9Qrr6jazaJVgzw":{"text":"If you are given a choice of where to enjoy a late lunch/dinner or a Sunday brunch and you","useful":1,"cool":0},"JdNcUR6vQJwqX4ovrId0oA":{"text":"I want to start off with food... it was exceptional. I had crab cakes with a half side of ","useful":0,"cool":0},"ANd6OHyYapisjNU6ASuDxg":{"text":"Awesome","useful":0,"cool":0},"CGHTO7XI_jGg_oqctlPmLg":{"text":"I doubt I'll be able to write anything here that hasn't already been stated.  This place i","useful":0,"cool":0},"m-SyZgAqXquX8YO3_opX-Q":{"text":"Tasty food, friendly and fast service, will try this again. I had the Rosemary chicken and","useful":0,"cool":0},"dlVogiom7N9B4O1uBHZQ8A":{"text":"I love this establishment and I come here very often.  However, on several occasions, the ","useful":0,"cool":0},"vC3GO5EYfCBFEPb-Mi_B3g":{"text":"I love this place!!! The Boudreaux is a must-try!!!! They also work with Debbie does Dober","useful":1,"cool":0},"6gyoKS1XGGMrUGRGgyx4SA":{"text":"I LOVED my seafood platter! \n\nBefore my main course we started with the bacon blue fries (","useful":0,"cool":0},"0TMsNoaPjGAyyXvnbWTfiw":{"text":"Not really impressed with this place. First, our server was in such a bad mood and not ver","useful":1,"cool":0},"4JN7_WVfHzf6dtLpRMGhOQ":{"text":"Visited this restaurant on a recommendation and the food was fabulous - we sat outside and","useful":0,"cool":0},"tlYpk_dL7uV-qiMsVjW-Xw":{"text":"Superb food by a very personable chef...Scot Craig. Great crew, nice ambiance...try the Oy","useful":0,"cool":0},"DFrIPhg5ZJRE9fCv6cEqkw":{"text":"It looked like they had some good things on the menu, but I wasn't a huge fan of my cocoon","useful":1,"cool":0},"y7rTs_Zo3kiKP3uGFBehXw":{"text":"Visited again 8/6/2018 around 11:20.  Received food around 12:25.  Brandon apologized for ","useful":0,"cool":0},"fB_sfQPlz8dy9hwegDtqKg":{"text":"I just love this place! I've eaten here a handful of times now, and I usually try to get s","useful":0,"cool":0},"lKP1CuL-nVX_m1FN_nT0mg":{"text":"Always looking for places that are local and not touristy. This place is that. Great food ","useful":1,"cool":0},"jNPr4HKapR6Xzi1EeBEFKA":{"text":"Tried the crawfish beignet during Sunday brunch. Great flavor, a lot of cheese but loved t","useful":1,"cool":0},"MormrlhoHkCjWXLCIp5-ww":{"text":"The food was delicious and the service was great. The unlimited mimosas were powerful. If ","useful":0,"cool":0},"PAwlWEzhqPVdxpzgJ7SddQ":{"text":"Aside from the slow service, the food was really good. This is about to seem weird, but th","useful":0,"cool":0},"ULnBuwOdBwjLgst8uXg09g":{"text":"We planned an 88th birthday dinner for seven people for my mother-in-law. When we arrived,","useful":0,"cool":0},"KW2F90L-SUTGuhu-y-5pUA":{"text":"We had a great experience at Katie's! Everything we ordered was exceptionally good (even t","useful":0,"cool":0},"wmu6d-2cNyJUoDSP11DvAg":{"text":"Sooooo I just saw this place on one of Guy Fieri's shows and had to check it out. I had th","useful":0,"cool":0},"4aBWpF-e7wf4Un2v8iSSNw":{"text":"I have been patronizing Katie's since early 1999, back in my days of being employed by the","useful":16,"cool":10},"xxUr4ecNHyUZd3z_5ZBpGA":{"text":"I don't normally order ribs or BBQ items on menus but I got the ribs tonight and they were","useful":1,"cool":0},"fag4t5SxCVVj3hORdBk6qw":{"text":"One of the best restaurants in the city. Food is consistently good. Try the seafood beigne","useful":0,"cool":0},"y18TeEwUduj1OKCqZNxB5g":{"text":"This was my first time in NOLA and I was looking for brunch spot! I got to Katie and the w","useful":0,"cool":0},"x6VqW7rNChOE7YsWN8zuow":{"text":"This restaurant was recommended to us by a friend. Our apps where the remmy stack (fried g","useful":0,"cool":0},"qB0h_7fM0k7iiGR_RGE63g":{"text":"I want to love Katies- I try to love Katies.... It needs to impress me. Everytime I've gon","useful":4,"cool":2},"fWLp_gcGlqGnj0lF_RTInQ":{"text":"Take a trolley or taxi to this location if your staying in the bourbon, French quarter are","useful":0,"cool":0},"PNitbNOwJBdKN1lyZGEhPA":{"text":"Brought here by a local and my moms first meal in New Orleans- couldn't be happier. The fo","useful":0,"cool":0},"XpwFR-qlgbM_Q3FM0C8AeQ":{"text":"Not impressed.  My friends and I went here (bad decision) after watching Bridesmaids (good","useful":2,"cool":0},"Z5dIJYlrOAuM69893MArgQ":{"text":"I came here recently for breakfast to feed hung-over friends who were visiting from up nor","useful":0,"cool":0},"RKgAu_LD45C6P8KpPM64-A":{"text":"Wait times are crazy bad..they tell u 30 min..be ready for hour plus on Sunday. .they need","useful":0,"cool":0},"z1M7L5zq9bq7jNZbs0F2eg":{"text":"Great food, great atmosphere. Was staying in town and had to take an uber here. Was very v","useful":0,"cool":0},"mg7jyJFohs9DZopJCdqAcw":{"text":"I've been several times to Katie's.  I recommend their Cuban Sandwich, Salisbury Steak, Ro","useful":0,"cool":0},"oE5syhFdoSh8tEeDCg8Esw":{"text":"Great brunch place to go with friends, there may be a long wait but it's definitely worth ","useful":0,"cool":0},"92GXRDaMWulGO2xySKZTsg":{"text":"Love this place. \n\nWe moved right next to it several months ago, and it's a breath of fres","useful":0,"cool":0},"6D1lHenKvSzTg5KdVf6ZUQ":{"text":"For a place that gets such good press, I've been underwhelmed every time I've been here. T","useful":0,"cool":0},"BmdRzgwNWvvSdy7nR7Jw3Q":{"text":"Brunch here was a complete success! My husband, my friend Susan and I all had egg-white om","useful":3,"cool":0},"oSACBFlcbJOIroVaC7rYgA":{"text":"This small restaurant right off Canal St. is a fantastic place tor dinner or drinks. Dave ","useful":0,"cool":0},"JkxH5zVN8e1vn5ubNCm96g":{"text":"I almost don't want lots of people to know how good this place is, so it can stay \"ours.\" ","useful":2,"cool":0},"JNlyNLgRwCtGlZIbWKsJ-g":{"text":"Food was decent but the staff was so unprofessional. Drinking behind the bar. Talking abou","useful":0,"cool":0},"T0HyodGweg4KDhfJop4JUw":{"text":"Katie's is set in a residential area and is small but has big big flavor with the dishes p","useful":0,"cool":0},"miAc2shI2JObsfsKD5ubOA":{"text":"My local friends took me here for a NOLA  neighborhood  experience.  Great food!  Friendly","useful":0,"cool":0},"BiSb57JlRxqu1lIOHoCaLA":{"text":"Didn't live up to the hype, Cajun Cuban and Cochon de Lait were okay but both a bit dry.  ","useful":0,"cool":0},"UA9qblJ9lgcJlpKrpuMEbw":{"text":"Great food for first time. Bit noisy but outdoors dining woukd have been better fot us. Ne","useful":0,"cool":0},"WeqHFfw_BzX_4PE9q8pXJQ":{"text":"This is a hidden gem. I have eaten here about 3 times and I have never been disappointed. ","useful":0,"cool":0},"-K5OU3Pr17xP1ftyy7RHng":{"text":"Great food in a cool neighborhood. Seafood stuffed mushrooms for appetizer were absolutely","useful":0,"cool":0},"LxnGH9hTle3DRizugIr5GQ":{"text":"Terrific onion rings, fabulous lasagne, wonderful short ribs special-5 stars for family st","useful":0,"cool":0},"_sFWkGsdxxQoqCa082DY4g":{"text":"Never disappoints, oysters, ribs, pizza, desserts! Amazing service, food, atmosphere & ove","useful":0,"cool":0},"e4vIwrwrBOTySTwK2Ffk_g":{"text":"Went here with a friend for what we thought was brunch.  Brunch is only served on Sundays.","useful":5,"cool":2},"4zbSnXMn_L9JWYb4FE_Kjw":{"text":"Bottomless Bloody Mary's, mimosas, sangria...Awesome. Best part: our server (Murphy) was O","useful":0,"cool":0},"RXf9QooWQVpgT5Yl0nKnnA":{"text":"One of my top 5 spots to eat. Thanks to Chef Scot for the visit today. My pastor and I had","useful":0,"cool":0},"ZLmsru6DuPEjBAbBvV8R9A":{"text":"Went here last weekend and it was my 2nd trip to Katie's. I love this place. It is becomin","useful":0,"cool":0},"v9r1QAsQ6fmAYv9NH-rwbw":{"text":"This place is so good! The staff here is friendly and their portions are huge. I came here","useful":0,"cool":0},"APx4Yc6s7Ky9vkAV-gpd7g":{"text":"Yes yes yes thank you Jesus yes! The food here was the best I have had our entire trip eve","useful":0,"cool":0},"OFYzcDMeVL3Jmp0LG14HEg":{"text":"Everybody said try the craw fish beignet and I was not impressed I actually had the seafoo","useful":0,"cool":0},"_OHGegxcei4Jm0HvZmZckA":{"text":"Crawfish Beignet is one of best dishes in NOLA! Oyster Slessinger, Stuffed Lobster, The Le","useful":1,"cool":0},"Esxskrns18OrQRH2ew8aSQ":{"text":"Funky local joint with good seafood offerings!\nService is fast, friendly & casual.","useful":0,"cool":0},"yKD1WKf5dCi8qC5ZbL-VZQ":{"text":"I hit up Katie's Saturday evening for some pre pub crawling munchies.  This was imperative","useful":1,"cool":1},"mybucfBLL2hg8BBzq5IUsA":{"text":"There were ten of us for dinner, so it was a bit of a wait- but pretty much was the 40 min","useful":0,"cool":0},"y0TKqfAE0m6mjMJbGVp_BQ":{"text":"A great place to unwind after work with dinner and a drink.  Nice staff and great food.","useful":0,"cool":0},"AkumdvfnPeSOZnvqJI0dBA":{"text":"Best seafood I've had in years! Great place to get some real authentic seafood! Drinks are","useful":0,"cool":0},"JmR0bqjbX-jmD-Dj7H9suw":{"text":"Best restaurant in ambience #Inn New Orleans. They truly local neighborhood place that you","useful":0,"cool":0},"MKJ_ErcCyVGIFQvjdjBN-Q":{"text":"I went to Katie's this last weekend for dinner. I have been there before for their brunch.","useful":1,"cool":0},"IY4iG8aLGGyCbLf6-mqOig":{"text":"The food was delicious! It is a cozy, outgoing place. Great for get togethers and casual, ","useful":1,"cool":1},"UtWJzG7M18GcH6OLbZhi4A":{"text":"I freekin love this place. Not only is the atmosphere so cool. The food is delicious. The ","useful":0,"cool":0},"qRWqeuhM0IZhHgyYc4xGIw":{"text":"Wow, the food is amazing here.  We loved the baby back ribs.  The sauce is spicy and the p","useful":0,"cool":0},"F2YAZk_GXHcujp3MjvInXA":{"text":"Great little neighborhood restaurant and bar.  Breakfast menu is great.  We walked straigh","useful":1,"cool":1},"bQMac49S_tl_Q47tPTrDbg":{"text":"We came here for their bloody mary and grilled oysters. The oysters were good, the sauce i","useful":1,"cool":0},"OFfVShxDmJ3lMIlyhSBQzg":{"text":"We came because this was listed on Triple D. We were not disappointed! Hubby had a crawfis","useful":0,"cool":0},"T9EgnmVlGM-HNblo36blag":{"text":"After several trips to this location I am disappointed in the decline in service and food.","useful":0,"cool":0},"nZ8o1wQE0-L7Od8gmsU_0g":{"text":"Quaint atmosphere and tasty food.  The crawfish beignets are good, but I found it to be ve","useful":0,"cool":0},"psELmfNbZ5Jwiyftz0tKsw":{"text":"Their food is just okay! With so much competition in New Orleans, it surprises me that the","useful":0,"cool":0},"luSOQW9iU3ErG20l6BuZcQ":{"text":"This is a small local place virtually unknown to tourists (around 50 seats). No reservatio","useful":0,"cool":0},"7E9ECjFz7wsmPBDG9plaDw":{"text":"Great little place!  Everyone in our party of five thoroughly enjoyed our lunches.  I wish","useful":0,"cool":0},"snLTCLmuPzlrF2EiBLvtMg":{"text":"Great place for brunch! Arrived on a Sunday morning around 1130 and was told 45-60 minute ","useful":0,"cool":0},"WP2Vu0XLN1cD5QGIHCFMkA":{"text":"This place was awesome!!!!! My girl friend and I found this place bi-accident, we were at ","useful":4,"cool":0},"4qmgMnTF40mrzGVdu-BrNQ":{"text":"I tried Katie's for the first time about four months ago. I have been back about a handful","useful":0,"cool":0},"iEkl0lDMBZChZhrPKb5CQA":{"text":"Once again getting off the beaten path and finding another gem. Ask the staff for recommen","useful":0,"cool":0},"QXQbdpw_ci_XmPXyJmbCDg":{"text":"Great neighborhood spot in midcity! The $15 bottomless mimosa brunch is a great deal, espe","useful":1,"cool":0},"j-6ULmhv8mX2TxiK9GDZ7w":{"text":"OMG.....the best garlic stuffed oysters ever!!!!! \nThe food was amazing and the service wa","useful":0,"cool":0},"uJ79lVWB7zXTAHYKF8cDMg":{"text":"Only docking a star because of the seating arrangement. We were seated at a table by the s","useful":0,"cool":0},"j30c_VERMaVrWpn9kVrElQ":{"text":"We were recommended Katie's by locals, so take their word for it, it's amazing! Huge porti","useful":0,"cool":0},"wZCD_UzGqM2Q-15Yj1PU_g":{"text":"We ventured to Katie's for brunch today. It was a one hour wait and worth it!\n I came for ","useful":0,"cool":0},"dAvxcFiUOyDypjmf7uwhhw":{"text":"Katie's is home to my favorite oyster dish, Oyster Slessinger!  The menu has a little bit ","useful":0,"cool":0},"ArdijS4PUVI7irqLBFM7og":{"text":"Everything was adequate..but the breakfast pizza was amazing!! I cannot stop thinking abou","useful":0,"cool":0},"pw35Du_rV7qJzo56FeCw7Q":{"text":"The food was really tasty! \nWe ordered the seafood beignet, 2 oyster platters, and a Boudr","useful":0,"cool":0},"muJLx741mqfXAboWL4Gz2A":{"text":"Sat outdoor for a lovely lunch during our trip to NoLa. The crawfish beignet was delightfu","useful":0,"cool":0},"ETfNBsz-mTL-QQ1qvIJTVA":{"text":"Great little neighborhood spot. Excellent food (we had the shrimp and corn bisque), very g","useful":0,"cool":0},"abOGPpieOopve3tLP0xSPw":{"text":"I was, very pleased...everything is not what it always seems. However, in this case..It wa","useful":0,"cool":1},"6gcGaSslUAC7wZaTtrdvZA":{"text":"My son and I were visiting NO and stopped in for dinner both sharing the food.  The food w","useful":0,"cool":0},"fxl5UJPkCt2HbT5HcngCNQ":{"text":"We had brunch here around 11am and were expecting a long wait based on the reviews, but we","useful":0,"cool":0},"ABqWnvjjy5l3amHrnYhC7Q":{"text":"Get the chargrilled oysters! Also had the crawfish beignet which had a TON of kick to it w","useful":0,"cool":0},"pOrKnUxHoOKt1JQ5wXg2jw":{"text":"We went to this place in search of the best oysters after chatting with a regular visitor ","useful":1,"cool":0},"4iWdQ9VhWksByJ8IMdWMbA":{"text":"This is such a fantastic restaurant on every level.  What makes this restaurant special is","useful":1,"cool":0},"T7NJYPd4fxTzJrFWIUrk1w":{"text":"What a great experience!\n\nWife and I went here today for lunch and loved it.  We both had ","useful":4,"cool":4},"v8XiMfU31mSCLF_fRZRrsQ":{"text":"Katie's is always a GREAT. My family loves to eat here weekly. I also do business meetings","useful":0,"cool":0},"PFMxZ8fCMq2oeYB52MaE0Q":{"text":"I really like Katie's! \n \nIt is typical NOLA. A quaint little restaurant in the middle of ","useful":2,"cool":1},"ike1E_nWcFQN4NcZjGzkLg":{"text":"Came here for the lunch Coolinary Month menu which included a cup of gumbo, crawfish beign","useful":0,"cool":0},"3x51Q0YsOEXaeRTBjQCcDQ":{"text":"This a really cool local spot with great food. The crawfish beignet was excellent! I didn'","useful":0,"cool":0},"RcBVkxvMy6C2MD66tEZ6Rg":{"text":"After arriving about 10:30am on a Sunday for brunch we had to wait about 20 minutes for a ","useful":0,"cool":0},"golyUeqzjSqPuHdC9LEv6g":{"text":"Prior to my last experience here there is no doubt in my mind that I would be writing a 5 ","useful":3,"cool":1},"gwpupKFUDMpdvyP0JXUhuA":{"text":"Katie's has good service and a good traditional menu mixed with some NOLA Italian as well.","useful":1,"cool":0},"wK1Cu676_N3Qt2aaZMP0dg":{"text":"Came here for a late lunch one Friday. One of the best places to get chargrilled oysters! ","useful":0,"cool":1},"x_6-Zwba1J34Tua8D5zDyQ":{"text":"Always delicious!!!! My go to is the Crabby eggs...I love a crabcake, I can't help it. Alw","useful":0,"cool":0},"uSKcq6u9Ada93wKO8iB0MA":{"text":"One of the best meals I've ever had was last November at Katie's. My friend and I splurged","useful":0,"cool":0},"yr1CXVvxRufP8kmE2nEorA":{"text":"Went to Katie's about a month ago and it was great.   Stuffed mushrooms and the grilled se","useful":0,"cool":0},"frJWnFn0IZ13bsFxvy2ChQ":{"text":"It's been a while but happy to see Katie's continuing with great service and awesome Sunda","useful":0,"cool":0},"xdb8W-X2wuaEwjwFgi6YEw":{"text":"This place is awesome!  We wondered where GPS was taking us but it was worth it!  We sat o","useful":0,"cool":0},"gg0Py8Aj6mqmzuXLk_xmAg":{"text":"Every time I come home (1 or 2 times a year) I always make it point to stop in for lunch o","useful":0,"cool":0},"SAE_CKHsRBre4X0B-CobKg":{"text":"Had the cochon bbq shrimp poboy my beau had the hula girl pizza. It was good overal ... We","useful":0,"cool":0},"TNYD-yvRJbUDMb0wKQKakQ":{"text":"Katie's never disappoints.  Took some colleagues here one night while in town for meetings","useful":0,"cool":0},"deYcW7OJesN6U-R3_DennA":{"text":"Brendan should be fired. We watched the entire first half of the Kentucky game on Saturday","useful":0,"cool":0},"vRoaqdq3EGcz_EmwzYlNcw":{"text":"Snider, the bar champ was cool and real good.\n\nBlackened red fish. delicious. My uber guy ","useful":1,"cool":1},"nfZ7Yf9xbJDvNAEMckRA4Q":{"text":"First time going to Katie's and I'm here to tell you it was the highlight of our eateries ","useful":1,"cool":1},"6Kyc_rz_fwIpDZlfRdS5xw":{"text":"An old house with an open kitchen. We came for Mother's Day brunch. Start with mimosas , s","useful":1,"cool":1},"cnaaow8p_CEMhXO5pYmXvg":{"text":"My friends and I are brunch fans but hadn't yet tried Katie's, so we decided to remedy tha","useful":2,"cool":0},"tEMIFMiSWq-qL7ZOX_RDFg":{"text":"Pimm's cup - A+, tasty, strong cucmber\nHendrick's fix - C-, bland, pulpy, a piece of ice i","useful":1,"cool":0},"8yhnDnLVxHiruJjTMxliUA":{"text":"I'm probably prejudiced: we were on our way back to Atlanta, it was raining cats and dogs,","useful":0,"cool":0},"kR_Vj6XnoODzIzh6if5CRA":{"text":"Our favourite spot in New Orleans. Amazing service and the best - unique NOLA food. We wer","useful":0,"cool":0},"ONPdgPNJKi2dW4bvlFC2cw":{"text":"So put off by what happened there on Sunday 11/8 that it ruined what could have been an ou","useful":0,"cool":0},"DPKLb3nPG1KWy4rV8cJxUg":{"text":"Came to Katie's at lunch time on a Friday and was seated within 10-15 mins. \nJenny's Garli","useful":0,"cool":0},"cmkNHZZIcFFRRYYQgY8dlA":{"text":"Katie's is by far one of the best local restaurants in New Orleans. You can't make a bad c","useful":0,"cool":0},"hRTMMuuu1VsxBUL8y8j5Mw":{"text":"You can't get much better than this when you're looking for a great neighborhood restauran","useful":0,"cool":0},"i4B9GgDI4-hk2Vx2jABtvQ":{"text":"The food was great.  There were a lot of things I'd like to try.   They have bottomless bl","useful":0,"cool":0},"QlKeFRz6XeR45OSCEMt3kA":{"text":"If your response was the answer given to you by the host he was flat out lying to you whic","useful":0,"cool":0},"sgxiVmnQYVromdu6YUBypg":{"text":"The exciting menu that is well-executed by the kitchen and the friendly staff of this ecle","useful":0,"cool":0},"JPCgH8qTZTnjdzlSRCr5Rw":{"text":"I have a special place in my heart reserved for Katie's. It's in my neighborhood, their ha","useful":0,"cool":0},"SjuRr0mDi45wJPHMK4VL2A":{"text":"Upon seeing the spanish moss decorating the trees outside, I immediately knew I'd like thi","useful":0,"cool":0},"2LhD6YaQPnodgrmbJMGO1Q":{"text":"My work best friend and I are on a chargrilled oyster voyage! The oysters at Katie's were ","useful":0,"cool":0},"4Lu0W9L387cO24EtZJ5lbw":{"text":"Katie's in Mid City is a gem! I strolled in on a whim this weekend and am sure glad I did.","useful":3,"cool":1},"UYtKvuMXTFGA2MMDjwKuVA":{"text":"We were visiting from out of town for my sisters bachelorette party. Everyone said we need","useful":0,"cool":0},"8DAcvNsBuc9ph4n2MH0aNQ":{"text":"This review of for their catering service:\nTheir small bites were super duper tasty (those","useful":1,"cool":1},"yIeRcP_SZxCk9DIqxBtExg":{"text":"Great place to grab some good food. The panned chicken was delicious and I enjoyed my wedg","useful":1,"cool":0},"mFneKCEFXpSj6X68k9Dw-A":{"text":"Oysters to die for, if you could find them under all the trappings...and amazing house mar","useful":1,"cool":0},"7sxN8Z0TPyzJYV8S4JpVOA":{"text":"I remember the food being much tastier a year or two ago when I visited first. Staff is fr","useful":0,"cool":0},"oV6GxCuOtzPXi7z-e_iEgw":{"text":"Great lunch! One of the specials was fried catfish over potato salad with a cream seafood ","useful":0,"cool":0},"JntbwMJw0psh2FghlLMidQ":{"text":"Found this place on Yelp and what a gem! Very kid friendly and the food is yum! I had the ","useful":0,"cool":0},"g91jIy7BtckLGpdeSFyxCA":{"text":"Crawfish beignet and a Boudreaux pizza... you can't go wrong. \n\nJust be sure to bring a br","useful":5,"cool":4},"Qo72STiqpwBiFUmErX-cwQ":{"text":"Really nice place, although if you didn't know where you were looking you may go right pas","useful":0,"cool":0},"pn-zjPNyefE39GM3cLdQOw":{"text":"Katie's is a true NOLA gem.  Stopped by for lunch and loved the Seafood Beignet.  The crus","useful":0,"cool":0},"DU2bbvJu_VZNoKsXutTnGQ":{"text":"Before I go into detail, please know that the seafood beignet was amazing!! I didn't even ","useful":1,"cool":0},"QKIfhITX4YGi-nJdb1SpJw":{"text":"First time eating at Katies and wow. Loved it. Came for Sunday lunch. Wait for a table was","useful":0,"cool":0},"kkRsT-bPXUPgsbC28HJf-g":{"text":"Drove into town from FL and book marked this when I watched diners dives and drive ins. Th","useful":0,"cool":1},"J6nwPQcRvIhpKCJ8nG4l9Q":{"text":"Maybe we caught them on an off night?  We started with a crab cake which was decent.  Craw","useful":0,"cool":0},"P4AzPv4suKVTqiRsaC5CXQ":{"text":"OH GAWDDD!  Now I finally know why so many of my friends dine here!  It was my first time ","useful":2,"cool":2},"7cMTioaWmbUDW_sdPwyCtQ":{"text":"Katie's was a great little neighborhood spot that we had brunch at.  The Mimosas were flow","useful":1,"cool":0},"yhyLrZQ-eZutqan6l2AMtA":{"text":"Worst meal ever. The place was empty but somehow a sandwich and a cup of soup took 30 minu","useful":0,"cool":0},"rmoN_m8VvNweq21CII5qbA":{"text":"Really loved this place! Family friendly, tons of options-- it's almost overwhelming. Woul","useful":0,"cool":0},"9ZVATEditZrti-T8i3-dFA":{"text":"Usually I drive by Katie's peering at the line to get in and the hordes waiting for a tabl","useful":0,"cool":0},"CBJq6pqX3ZR-LZtwlTF3Eg":{"text":"I always loved Katie's, but this was my first time eating there for Sunday Brunch! It was ","useful":0,"cool":1},"f-n-5rc_vwypbj5IkY94vQ":{"text":"We stumbled upon Katie's one afternoon and since then have been hooked! Even though it's a","useful":0,"cool":0},"eBTJJAeMghHpJ9omY2TCCg":{"text":"My son and I were visiting NO and stop in for dinner both sharing the food.  The food was ","useful":0,"cool":0},"CC6E-VDmdOoh1Pcg_KmQMA":{"text":"Katie's was a real hidden gem. I had a delicious meal with my fiancé, I ordered the terra ","useful":0,"cool":0},"FeuxjQ81F1pzjxyf-C4_Xg":{"text":"This was my first visit to Katies. First impressions are key to me. I went on a,Sunday for","useful":0,"cool":0},"N_dDoXrO_TTxV48CH0Mn_w":{"text":"This restaurant is everything you're looking for in NOLA. Great food, great people and gre","useful":1,"cool":0},"CGgeHYlD1qW0HbOiZPu1kw":{"text":"I don't give many five stars but this place is definitely getting one. \n\nOn a recent trip ","useful":0,"cool":0},"ej1YEuoWZ1UmYNA8F13OPg":{"text":"Food and service is always great! The pizza and the seafood stuff mushrooms were full of f","useful":1,"cool":1},"jWSbPkF1ak0km9ghUbM2YQ":{"text":"LOVED Katie's! We went for their brunch and it was fabulous. I had their pizza and my boyf","useful":0,"cool":0},"TYf5t8fqeAUXwIzGC9tznA":{"text":"Feta fries were delicious! Pizza was excellent! I'm from St. Louis so finding provel chees","useful":1,"cool":0},"fjvIwA_5_UwH9Us10eAYQQ":{"text":"Wonderful place, wonderful food, wonderful people. This is a great place to dine. I have m","useful":1,"cool":0},"Vt-tHFkkRi4oWW75FnODNw":{"text":"wow! What a lovely little gem in the heart of MidCity! Went to Katie's after a long day at","useful":0,"cool":0},"vPDlpoNK_TMsqPLMWmwM4A":{"text":"Gotta love bottomless drinks,the food was very good and the service was prompt and informa","useful":0,"cool":0},"pH49XrAUZ7x1lrj-TN0zdw":{"text":"Great food, just wish they had a littler bigger menu.  Line says it all, people will wait ","useful":0,"cool":0},"RQ8ALlpjQQXDx2duY8YaGw":{"text":"Great brunch place!! Food was fantastic. Would recommend the Boudreaux pizza, the crabby e","useful":0,"cool":0},"JhxR5mxriCVpqKeB1e7VvQ":{"text":"WORST SERVICE EVER!!! In town on holiday and thought based on the reviews that this would ","useful":0,"cool":0},"bZZzJ2IJiL-ZAn6qen0-xA":{"text":"Great food. Especially pizza and oysters. Awesome cheap drafts and bottles for happy hour.","useful":0,"cool":0},"bhF-2S8QfponWCS2AvrBjQ":{"text":"We were stopping in New Orleans for the night and just wanted to try the famous food of th","useful":0,"cool":0},"e1LzEbkQogjFhNvWs7CmAg":{"text":"What can I say besides it's ok? I've been here three times and every time I leave, I think","useful":1,"cool":0},"2uwmAepPVwWEbmatydUNLg":{"text":"Love this place. Have eaten here twice, both times the service was great and the food phen","useful":0,"cool":0},"mhJXGXMD6Q4wzAqiqrkcAg":{"text":"I regretted agreeing to share my catfish dinner because it wound up only being one piece o","useful":1,"cool":0},"vqCpq-V_bWziNj3Wd-rJ8A":{"text":"Great place. Enjoyed lunch with clients. Had the Catch of the day \"Redfish Noel\".  Nice wa","useful":0,"cool":0},"9E-Hp322sr8dEDHfgzJfpA":{"text":"The food is wonderful. Not necessarily \"healthy\" but sinful and delicious. It's great plac","useful":0,"cool":0},"r1pQ4if1lD--hzRQBxGIpg":{"text":"The bottomless mimosas and sangria are a great deal and the sangria was absolutely amazing","useful":0,"cool":0},"TYmmZHlQKvBjWMZP-Pa8OA":{"text":"Went for the first time for the hubby's birthday.  We had to wait a while to get a table, ","useful":0,"cool":0},"pmELimOU06aTFiA04n0AzA":{"text":"I've never had a bad meal. Katie's was a welcomed treat after being turned away at Brick a","useful":0,"cool":0},"bvg45ArojigsD1RYmcEjXQ":{"text":"This place is cute with good food, but a little pricy for a neighborhood restaurant (thoug","useful":1,"cool":1},"UsEB0XnmPxIr5UcpgwuKxw":{"text":"I really wanted to like this restaurant. We visited on Saturday afternoon and got seated a","useful":1,"cool":1},"apyW_B3tZBk_TV2W15iCXA":{"text":"Food was decent but the staff was so unprofessional. Drinking behind the bar. Talking abou","useful":0,"cool":0},"CFbcmOkvtpZaxhEqap1CwQ":{"text":"I would recommend Katie's to anyone who wants incredible food and service. As soon as you ","useful":3,"cool":2},"gyNNhT4d1EaWuCbGnQn-Fg":{"text":"Amazing food, tasty (and strong) drinks with unlimited refills and nice waitstaff. It's a ","useful":0,"cool":0},"ARpG6zJVrSIyjU7TPoKdYQ":{"text":"Just some classic southern food done amazingly well! The ribs were extraordinary as was th","useful":0,"cool":0},"Ze8bgclq31UQIUBnPMkPSQ":{"text":"This place is amazing!  There was about a 30 minute wait that could've been longer, so if ","useful":0,"cool":0},"FaMfirff7feznxCYGI2aFw":{"text":"II have eaten at this restaurant many times, but never had the experience I did tonight.\nW","useful":0,"cool":0},"8mQn8fr18GeK_E7nIjBkqA":{"text":"Best please for brunch ever bodreuX pizza and bloody Mary's will help you recover from you","useful":0,"cool":0},"i8e-5NJ9ljwasZ8o40gdPQ":{"text":"Quintessential New Orleans experience: a bartender at Brennan's recommended Katie's, a blo","useful":0,"cool":0},"mhZy_KhCX8p3slD5QN9MWA":{"text":"We found Katie's on our last day in New Orleans, but it will be our first stop on our next","useful":0,"cool":0},"F8dr9wuJjF-k39vN0ctUYA":{"text":"It was okay. Nothing SPECTACULAR like you would expect from the way people talk about this","useful":0,"cool":0},"YSL7_TH7jDgfWl0jJVMi7A":{"text":"I came here with my family and have been in New Orleans all week best food I've had by far","useful":0,"cool":0},"PtxY72l8LIVaXrUVYnqOKg":{"text":"We came here while on a business trip. What drew us was that Diners, Drive-Ins, and Dives ","useful":0,"cool":0},"tyj3me89mOQycaalJ4flmg":{"text":"Local, intimate and delicious!\n\nAfter reading several NO publications for a good bottomles","useful":0,"cool":0},"mrMJauWsG3uJ6EXYDOIQBg":{"text":"Our Uber driver recommended Katie's after we asked him to point us to a great restaurant t","useful":0,"cool":0},"tyygZZucqw0qMJ5TEM_N6A":{"text":"Great Place for Sunday brunch. The sangria is awesome! I haven't had a bad meal at this pl","useful":2,"cool":0},"OHI3SVmGCDSjGbESDYjZyg":{"text":"Oh yeah....it's THAT good!   Came here last year and planned this year's trip around being","useful":0,"cool":0},"tN4qFLqB_h3K9rp61n6qbQ":{"text":"This place is AWESOME!!! Great service and food. DEFINITELY DEFINITELY wish I can eat here","useful":0,"cool":0},"vCknUdgfqakZeLyaot50dQ":{"text":"This place is one of our go-to restaurants especially when we have out of town visitors. T","useful":0,"cool":0},"MPD5ewhEfWIiXPNQ_wVk3A":{"text":"The Boudreax pizza at Katie's is the stuff that dreams are made of.  I sing of it's praise","useful":0,"cool":0},"ifj7_bEYwqJbU53sxPVKOQ":{"text":"A rare 5 out of 5 from me: a daily-specials board that combines home-cooking Cajun cuisine","useful":2,"cool":0},"BKdsZPKcWvJlk4KZEFlMcw":{"text":"Our family had never been to Katies before because we were put off by the highly varied me","useful":0,"cool":0},"rJdWZuQ4RipFER2owVK51g":{"text":"The hot roast beef n gravy po-boy was outstanding! You also get a side of Zapp's Potato ch","useful":0,"cool":0},"I4QRAkYIZDk0Oj1k2-cB1A":{"text":"Delicious food & excellent service. Chef Scot was very friendly. The oysters slessinger & ","useful":0,"cool":0},"rbh-piFP3bqdloiaGlHZ1w":{"text":"Everything looked good -- the interior, the friendly wait staff and the menu -- and when t","useful":0,"cool":0},"jRJ3vd6uGEG9TbIXPuSFvg":{"text":"Has been awhile since been to Katie's and a lot had changed since the Storm. And for the b","useful":0,"cool":0},"ljiBaJfnhQ9zci-Njg7_kQ":{"text":"I frequent Katie's often.  At one point it was concerning how often.  Like once a week.\n\n\"","useful":1,"cool":0},"RcpCU883UZyGdOqEb4ZzdA":{"text":"Wow. Not good.\n\nWe went to brunch at Katie's after hearing mixed, but mostly positive, rev","useful":5,"cool":0},"ZXCFHCs26Gl1Cc1dPoxvsA":{"text":"Great food, atmosphere and people!! It was my wife's and I first time in New Orleans and t","useful":0,"cool":0},"avkGnewEIu3s0_zjT_ihRg":{"text":"Decided to try this out because a friend wanted to try the crawfish Alfredo. Going on a Tu","useful":1,"cool":0},"tqBLeOnxbUtfrBJ5J0Chkw":{"text":"Food wonderful. Atmosphere awesome. Service friendly and nice. Definitely going back. The ","useful":0,"cool":0},"rkrTz7PXAYpwmVjEoeIuPw":{"text":"I frequent New Orleans 2-3 times a year, and this is a MUST HAVE!! Parking is always diffi","useful":0,"cool":0},"PB4uUQDfrWTpMzQafhNXhw":{"text":"So everyone wants to go to Katie's for their bottomless mimosas and because they were on D","useful":0,"cool":0},"hfSLAFG9_BJqsKiEsh9ZhA":{"text":"Great food and atmosphere.   My party had the charboiled oysters, bacon and blue french fr","useful":0,"cool":0},"VbbfsvItiFdPr9IcKr3GVA":{"text":"Tried to go for dinner last Friday night and the wait was outrageous.  However, we went ea","useful":1,"cool":0},"fCjp9etoeEU4h2_Y1E_0Gw":{"text":"If you only get one meal in NOLA, Katie's is a must have, gotta go, place for the best loc","useful":0,"cool":1},"y7GlWLjUK0zkOj_RLwvceQ":{"text":"The only reason I give this place 2 stars is due to the awesome bartender and bottomless b","useful":2,"cool":0},"a9tJXGnFYb9mxbYKzjmLBg":{"text":"Katie's place is so far out of the way and it is 100% worth it!!!! Loved this place! Staff","useful":0,"cool":0},"xTxQmmO_s4GRDfdR7-2N5g":{"text":"Two words: Seafood Beignet. \n\nI'm seriously starting to wonder why we didn't go to this pl","useful":0,"cool":0},"Et4RJ3zmblFpgZ0mns1ZXg":{"text":"I'm from the Midwest so I wanted seafood although the ribs sounded good ( and after I orde","useful":0,"cool":0},"HWjj-Zjf7hQzmzz9UFSVhw":{"text":"They never skimp on portion size.  It's our go to and reminds you of your mom's home-cooke","useful":0,"cool":0},"h44w-UmhUDxkuMuinXLiTQ":{"text":"Not quite a place to go to when you are on a diet. I tried to behave but ordered pork and ","useful":0,"cool":0},"yVyL1OYcCUz8Sm0zNfPO2g":{"text":"This is one of my absolute favorite restaurants. The Sunday Brunch is amazing with bottoml","useful":0,"cool":0},"AiSVJYdAUdqN7YJrEhe_-g":{"text":"I've tried\n\n1. oysters- too cheesy\n2. Crawfish beignets- too cheesy\n3. fried trout over po","useful":1,"cool":0},"aRXbvos7dv8jom4NE467nw":{"text":"This was our first time here.  The Pagniachi Flatbread appetizer was amazing. The soft she","useful":0,"cool":0},"3SsnjEGJd3UTp_RbAceYAw":{"text":"Had dinner here at the bar as a walk-in on a week night. Lori our server was so friendly a","useful":0,"cool":0},"Wre1nH9jWXyzr2FfFYPGDg":{"text":"Local place in a nearby neighborhood. Was busy when we arrived. Took about 20 minutes to g","useful":1,"cool":0},"Tt-I-0_SG1W0FTmDElic8Q":{"text":"I wish I didn't have to give any stars. This place is totally overrated. For my first expe","useful":1,"cool":0},"6X64Rae--YSDMApk5ByrUA":{"text":"It was a good neighborhood creole-italian joint. Its a real shame that it isn't open anymo","useful":0,"cool":0},"IGNXCUmvdi1yQxDrsd3TQg":{"text":"Took my mom here for late mothers day dinner. She suggested pizza, I suggested Katie's sin","useful":2,"cool":0},"lAzcEWfxeIYvGCHDUUMmEw":{"text":"First time in NOLA and came here first. Food was great, server Lori was helpful, and I lef","useful":0,"cool":0},"GS_9uY5YiQ9_V8r6j8xVnQ":{"text":"As busy as it was on this Spring Sunday morning, this place was so on point. Went with two","useful":1,"cool":0},"GzFeqG5CHkuNrlLHoAXKmQ":{"text":"In a city that's full of incredible dining options, I am a firm believer that New Orleans'","useful":0,"cool":0},"a_AGHZQb87_oAR9YVty0AQ":{"text":"The place is small, kind of dirty, food so so and over priced.  I have a poboy and it was ","useful":0,"cool":0},"rXU6dyxlTb9nw1s-mgW7NA":{"text":"Not bad but I think they are understaffed. The waiter seemed frazzled I had to repeat the ","useful":0,"cool":0},"ridKI0BbSiBO6hwsOyYBhg":{"text":"Located in mid-city on an obscure side street, this place has it goin' on! I met up with s","useful":1,"cool":0},"9Ht1VELEDF-LAY0e9m03jg":{"text":"Ok so where to start...first of all my sister suggested this place because it's her favori","useful":1,"cool":1},"2GZknQevP2-IC0S6gxaT2A":{"text":"Absolutely AMAZING! The wait was long, and we had to wait most of the time outside in the ","useful":0,"cool":0},"_FmWuXeErjyZOLyepHoMxw":{"text":"Gravy Fries were great as was the Cajun Cuban.  The Onion Rings however were not - they we","useful":0,"cool":0},"HyyujpbUZ32M1EKA0iu91g":{"text":"Great place for lunch or quick supper. Local cuisine at its best with the NOLA style added","useful":0,"cool":0},"ZRZyAW7m5S6eyIa17pxvEQ":{"text":"We live in the neighborhood and its out go to spot. Quick dinner. Decent variety on them m","useful":0,"cool":0},"7FJeM4_nHfP_SlfgYjKP_g":{"text":"Delicious food in a great neighborhood with a nice atmosphere. Was in the area the other d","useful":0,"cool":0},"4GtPcZmfwSot9LTwRbR-kA":{"text":"This is a great little neighborhood restaurant and bar in the mid-city area of New Orleans","useful":2,"cool":1},"E8zd0EG0F6SsKOCG4XUUOQ":{"text":"One of my go-to places in the city for visitors and celebrations. Tucked under the trees a","useful":0,"cool":0},"BzkPLm0ByOSSelPa5c-9ng":{"text":"Wonderful spot to enjoy your time in Mid-City ...not only the food is amazing, such as the","useful":0,"cool":0},"IcJyuS6-vp9iawih8HS02w":{"text":"This was my husband's and my favorite restaurant when we visited New Orleans. We were ther","useful":2,"cool":0},"pZRsQb8Yh-k9WDfO8cCpTw":{"text":"In town for the game and to see the Saints win. Always a treat to stop in for lunch at Kat","useful":0,"cool":0},"C-Zv5wApOKZ88Q_28rqiDg":{"text":"Every time I come to NOLA, I discover something new. This trip, thanks to Katie's, it's co","useful":0,"cool":0},"l28NMVl4XLCfIl1HevRJOA":{"text":"Honestly probably the best food I've had in Nola.. chef was a great guy coming out and tal","useful":0,"cool":0},"_eEMybt4ooIqPVjhu2hxQQ":{"text":"Food was great! Service was great! Very friendly and prompt. The only down side is it is v","useful":0,"cool":0},"rOGX4yHEOgZoDByFxnvKmQ":{"text":"It's places like Katie's that make New Orleans home. Great food to write home about, a wal","useful":0,"cool":0},"tytaVUwQSYSCjYCLKWVmyw":{"text":"Best brunch I've had in New Orleans. I had the eggs Cochon and my girlfriend had the crabb","useful":0,"cool":0},"qzScC7Z9vPBJESvnK7W7kA":{"text":"I have been going to Katie's for about 5 years now. Initially I thought it was great. Serv","useful":0,"cool":0},"E4qIx5jb19oWPVK_jXrZJA":{"text":"Cochon de Lais, the legend and another sandwich (can't remember the name) is what my party","useful":1,"cool":0},"mOAd0kBUIphNbEmIblaxcw":{"text":"This was the best food in New Orleans. The seafood omelet was absolutely delicious. The oy","useful":0,"cool":0},"ssCa1JUkdNSlA6oevVojow":{"text":"Oh my GOSH! Katie's was one of my most favorite parts about my very first trip to New Orle","useful":1,"cool":1},"MGFw6ziLOT4X1yz1uhpczw":{"text":"My wife and I went to Katie's for the first time today and we've lived in the area our who","useful":0,"cool":0},"HrH79LnsozdmpTZX8AeEhA":{"text":"Katie's Restaurant & Bar is a cute neighborhood restaurant. The atmosphere was nice. Price","useful":3,"cool":2},"OmkIBLpJFdENJ0eZz5oN0g":{"text":"Went here for Sunday brunch with out of towners. If there was something to do about pesky ","useful":0,"cool":0},"kd1_t08fggN3qdRNhnav-g":{"text":"Parking was easy on a Sunday (it's a residential area). $15 bottomless mimosas, Bloody Mar","useful":0,"cool":0},"BMnphFw085D1Gxg0p2WSLw":{"text":"I've had a lot of PoBoy's; many in New Orleans.  I didn't think there was one on the plane","useful":0,"cool":0},"qYsJ7QLtK_m953xSq6gI0A":{"text":"One of our go to restaurants in the city when we can't decide on what to eat because we kn","useful":0,"cool":0},"rpci-sGejPLL-W3tR61xng":{"text":"I almost hate to write this review (because I don't want this secret out)!!! This place is","useful":0,"cool":0},"BgFf2ou5SrNbLrnqNIV86A":{"text":"I love to eat at Katie's, food is always so good there. I had the eggs Benedict when we we","useful":2,"cool":1},"dsMT3fNDCxVEVBuWfMRgkA":{"text":"I'm not sure how I found this place when I first visited in 2012, maybe yelp? I really lov","useful":0,"cool":0},"rSdlvM4aXqqAbK445kPRUA":{"text":"3.5 Stars\nFor some reason, I haven't had a great experience here like everyone else yet. M","useful":2,"cool":0},"_KEv78oIY25UpD18nqJ_bw":{"text":"All I can say is NOT!  Are you people drinking the Kool-Ade or what?  You must have burned","useful":3,"cool":0},"GP_QhHpxTv-nDHWgBYcCKA":{"text":"Thanks to several visits in a relatively short amount of time, Katie's has fast become one","useful":4,"cool":0},"uAS4roIoIxrflEX9zoL7JQ":{"text":"Real cool little place.  An old house that got turned into a real cool restaurant.  Really","useful":0,"cool":0},"-EdJk1Z7oAQiENHN_6ArqQ":{"text":"We usually only come during Sunday brunch, though I'm sure the food is always amazing. $15","useful":0,"cool":0},"5Z0BjBXnW-Vn0A55dRi59w":{"text":"Katie's Restaurant & Bar is exactly what New Orleans is all about. A family owned and oper","useful":1,"cool":0},"J_0bcSuvCVUM1x9oGlpXnA":{"text":"A triple d restaurant. I ordered the blueberry Jalepeño rubs -amazing! The atmosphere is f","useful":0,"cool":0},"cFn86IwzoJXL2QReG63Gtw":{"text":"First of all like to start off saying that danny my server was great the hostess was great","useful":0,"cool":0},"vvgbA3aBb21sxE3G1XRAVQ":{"text":"We were very excited to try Katie's after receiving a raving recommendation and reading re","useful":0,"cool":0},"3-pJTYtG8eC9BNNuqPwZlw":{"text":"Loved the service and cozy interior, but the food wasn't anything special. Fried green tom","useful":0,"cool":0},"VH2fdpZ_kPJBk1IcuQFL5g":{"text":"Great local place in mid-city. If you visit NOLA, leave the touristy French Quarter and ha","useful":1,"cool":0},"JuRfWiTcgHzFFfH870hYIg":{"text":"Love this place! My first trip to New Orleans and overwhelmed with restaurant choices. I'm","useful":0,"cool":0},"pTdg05NCZx0hgPeo3KZlVQ":{"text":"This was my 1st visit and definitely not my last. Arrived at 2:15 and didn't have to wait ","useful":0,"cool":0},"YM24nx_NfDxJ-qAA2SU-jg":{"text":"I've been to brunch here several times along with a few visits for lunch and dinner.  For ","useful":2,"cool":2},"dALQqLYxZiHyjxLeJNPdUQ":{"text":"We went here in order to try the \"po' boy\". We have heard about it and wanted to try this ","useful":0,"cool":0},"91FqU2RmMIlUQZl_muHC-w":{"text":"I love this place so much I have already gone or dinner then the next morning went for bru","useful":0,"cool":0},"61d6GUaeSyawg53orf4teA":{"text":"Went to Katie's for dinner for the first time on a Tuesday night. All day on Tuesdays they","useful":1,"cool":0},"XhTJs17rgmqgS3DhGbaLdg":{"text":"The Boudreaux is the best pizza with ingredients like roasted garlic, cochon de lait, spin","useful":0,"cool":0},"q8NfMFdhWsXhA1RFfn8r2Q":{"text":"Loved the atmosphere and the food was amazing!  Our waiter (missed his name) but was pheno","useful":0,"cool":0},"wQUf061LKp60V37QekbjKQ":{"text":"Went to Katie's the other night with a group of 4 others. After a 50 minute wait (the only","useful":0,"cool":0},"nehvwnseeUOTfZYYvOLa_w":{"text":"I love Katie's, it's a real neighborhood gem. The servers are always kind and attentive an","useful":0,"cool":0},"cZrFoDHJJ01FH5H5OCvF0A":{"text":"Definitely the best place for Sunday brunch in the Midcity area. I've been there twice now","useful":1,"cool":0},"RvqAoBebC8ekfqjW0B1HZA":{"text":"Came here for dinner on our first night in New Orleans. We were greeted by the friendly ho","useful":0,"cool":0},"y0bRfiUUwSeN6Z_HsuXOjA":{"text":"Fantastic food!! Great atmosphere! Highly recommend the chargrilled oysters!! Lots of hist","useful":0,"cool":0},"HZSzrvshCWOUYL9HLFO3mg":{"text":"Thanks to a friendly local Uber driver, we ventured out of the French Quarter where so man","useful":0,"cool":0},"1IejJpNZFbPaIID31dkmxA":{"text":"This place is amazing! I have been a handful of times for brunch and I am never disappoint","useful":0,"cool":0},"_Zj8EzOZ9XqtVXIjszoPvA":{"text":"I just ate at Katie's for the first time this week. The food was great especially the char","useful":0,"cool":0},"Wf06GaRFfheRMDNN_PVRNQ":{"text":"The Red Fish with crab was most excellent. Also, had the oyster/artichoke bisque that went","useful":1,"cool":0},"QekehQLF0AEprVjPx2JWJg":{"text":"My favorite place for Sunday brunch. Best breakfast pizza in the city.","useful":0,"cool":0},"1akKBtqDxfZdRAA8hsJaig":{"text":"Excellent food, service and drinks.  For a starter we got fries with cheese and gravy. yum","useful":0,"cool":0},"L-L-l0_R2Tytf7PqU1iLHw":{"text":"Loved the service and will go back for another try. I ordered the fried chicken with red b","useful":0,"cool":0},"wphYOrS6ezXka6nOuNLrHA":{"text":"The Gumbo was not a traditional more like a jambalaya.   The Crab cake was wonderful.  I t","useful":0,"cool":0},"nb9royEfoeVpblWnwRiOjA":{"text":"Had lunch there today....\nThe food was ok. The service was weird. \nWe walk in and wait at ","useful":1,"cool":0},"TFjcI5VGpxXUqTvyHE1M3w":{"text":"Cute neighborhood restaurant.  I've lived in New Orleans for three years and I cannot beli","useful":1,"cool":0},"21rRKEj55GTR9NCa16FEPQ":{"text":"Where do I start?\nBottomless Mimosas! $15!! Pretty much, all you can drink, right? \nI had ","useful":2,"cool":0},"zzLMZdu2-nsXlMce90Fqmw":{"text":"Get on a street car and head to mid city for a great experience. The staff were all incred","useful":0,"cool":0},"Adf4Uzo2dtzGf6ejDla_aw":{"text":"Oh my goodness - we enjoyed the food, service and ambience - great experience and we will ","useful":0,"cool":0},"bBd-IROGlnKGEO_9qs_UwA":{"text":"GET THE SEAFOOD BEIGNET!!!! There's always a line, so try to get there early. Service has ","useful":0,"cool":0},"BrAh2hfKks1HEA4ZFDGHNA":{"text":"Nice, big menu with some NOLA staples included. Reasonable prices. The fish Noel is a litt","useful":0,"cool":0},"QsOOkXk9MAeA4pCqrCz3rA":{"text":"This is a place that we will add to our list of places that we will have to come every tim","useful":0,"cool":0},"xjURhpxNRNwYdqlHwEloLQ":{"text":"Katie's is aweeesome. Seriously you can order anything. The seating outside is SO NICE, th","useful":0,"cool":0},"dKgRsDEtvvpP9TZPo2exAA":{"text":"Service is great even if I'm only having a jalapeño vodka infused Bloody Mary. Breakfast i","useful":0,"cool":0},"Ljdgf0iaeOCz0lZqf3i9zA":{"text":"I have yet to have a bad meal there.  The main drawback is the crowds it gets since its me","useful":0,"cool":0},"7dE287lluttmJ911-91YAg":{"text":"Food was absolutely incredible and the service was even better. Sadiki was easily one of t","useful":0,"cool":0},"0oIiQzNizGQwMG6v5_CNyw":{"text":"Visited for brunch yesterday. .. been there several times, first review. Sat at the bar. I","useful":0,"cool":0},"uerOA4k8bPs7nF0UA2NQgg":{"text":"Pretty good place. We came for lunch at around 2pm. It was a little packed in there, so we","useful":0,"cool":0},"COeoUgqVus7kOqAJbDFwDg":{"text":"I wanted it to be better but it was just OK.  My mom and I had the crawfish beignet as an ","useful":1,"cool":0},"sCBIETiyci_95xcwlVRziw":{"text":"Great place!  Started with the char grilled oysters and they were great.  For dinner had t","useful":0,"cool":0},"qDxGkIgCpGTIdLmlAOf4vg":{"text":"This place sucks. The chargrilled oysters were a joke and the bread was stale and disgusti","useful":0,"cool":0},"R2j27f2p-FbQT-JIhjnpTA":{"text":"Everything at Katie's is great! You really can't go wrong here. On Sunday they have an awe","useful":0,"cool":0},"IFrZZI30DbbiusaDYJFGog":{"text":"Great environment, great food.. I will definitely return. Get there early as the wait will","useful":3,"cool":2},"f2jHzwaBR94-392SnIwO0Q":{"text":"This was an absolutely delicious restaurant with a charming atmosphere.  They have delicio","useful":0,"cool":0},"JkBjYDMxOKk4bYPOei-IBQ":{"text":"Delicious!!  I had the crawfish beignet.  I recommend this to everyone.  Fun atmosphere.","useful":0,"cool":0},"CReFl4DtVwdNQ92-c3I-xg":{"text":"It has been awhile since eating at Katies and have mixed feeling about it.  The hamburger ","useful":0,"cool":0},"MHGDSatKblpfRXAonYX-_Q":{"text":"I've been to Katie's for breakfast, brunch, lunch, and dinner. Not once have I been disapp","useful":0,"cool":0},"7W1GGIabgNsjMaQtEjmfrw":{"text":"Disappointed to write this review but the service and food left much to be desired. The cr","useful":1,"cool":0},"_XhpQkQ9a2OMEbbYkGxwcg":{"text":"So good! My boyfriend and I started off with the crawfish beignet. The crawfish was season","useful":1,"cool":1},"nEvdK0HCjh0VBGvIiQbdNg":{"text":"We were a party of eight and did not have the greatest time at Katie's.  We dined one Satu","useful":2,"cool":1},"o8xYDo8qW7lYcgjUbCGwnw":{"text":"Went for the first time and loved it\nService was great and the food was hot and delicious\n","useful":0,"cool":0},"DlqTzoeKl3a85mF2LrjdLg":{"text":"Came in for lunch during a recent trip, and was not disappointed. The crawfish beignets we","useful":0,"cool":0},"sYNqxkfKGyhGKig27UMaXQ":{"text":"So I had this gentleman who's name just slips my mind as my waiter last night. He was funn","useful":0,"cool":0},"ghz8emzD4VoJM7_mdhgpUg":{"text":"This review is based on the...food, go figure, right?\n\nI placed a telephone order, and 25 ","useful":0,"cool":0},"CyroVPEV-5WX8GGJawyTjA":{"text":"Started out with cheese fries with debris gravy; the gravy had a really great flavor to it","useful":0,"cool":0},"1KyK3MUntMpdf9zDOSX-8g":{"text":"I wanted it to be good since I've heard good things about this place, but was very disappo","useful":0,"cool":0},"UmIDuNJlfwr9uLiW6gooHw":{"text":"MidCity's  little secret, lovely atmosphere and brunch is the way to go. Perfect way to sp","useful":2,"cool":1},"i0-PJ7QoXas6x5bHJbVZrg":{"text":"I'm really torn on my rating here, i wish I could do half-stars sometimes because three se","useful":0,"cool":0},"RWY-NOOH1qy29MWwLn79Iw":{"text":"Everything here is so delish! Eggs Benedict at brunch, cochon or Cuban at lunch, and pizza","useful":0,"cool":0},"h7UGaOEvn6VPt1Mi9-MtIw":{"text":"We were excited to go here after reading reviews. When we pulled up at 6:00, there was alr","useful":1,"cool":0},"C_HKWDC6Mavu-1ES5LR3hw":{"text":"the food here is not great. the pizza was greasy, soggy, and barely eatable. the crab cake","useful":0,"cool":0},"psHMnw_gjSbCS4CvKwFaMg":{"text":"Best Sunday brunch in the city. The Breakfast pizza is phenomenal. Chicken and waffles and","useful":0,"cool":0},"w0pQxZLFvzPOB0cRhulxBQ":{"text":"We have been eating at Katie's for a while. Ask Brandon for the 'James Bond Martini'  it's","useful":0,"cool":0},"IgHXO9MxrF95gJV09qTbzA":{"text":"I love the outdoor seating. Great atmosphere, the inside is much too noisy. This is our fi","useful":2,"cool":0},"TXIX31P2VJu2VhaANBpVxA":{"text":"My husband and I had a date night here probably about a year or so ago because I got a Gro","useful":0,"cool":0},"JzzrPlXnxbw2J1aVDIA-EQ":{"text":"We really enjoyed eating at Katie's . We tried three different kind of pizzas and all of t","useful":0,"cool":0},"_sj6trqk9P5tRhMhWqxOaA":{"text":"Great place! Very loud but the ambiance is excellent.\nFood is good and typic of the Louisi","useful":0,"cool":0},"3Vj9V_gxyrUHUSQLXlClRg":{"text":"This place is great! Relaxed atmosphere and the food is delicious. Love the brunch on Sund","useful":0,"cool":0},"GobnrYwz3Od9PF-mfpcM2A":{"text":"Eclectic happy hour crowd. Go early, it's a very popular place for locals.  We had wine an","useful":0,"cool":0},"Kwq5yQN9SiFRhrDHt8QStw":{"text":"Heard a great deal of good.  Hit is on a Friday night.  Atmosphere 5, service 5, warm and ","useful":0,"cool":0},"rLvEMc5V03YOe3j8aASmaw":{"text":"\"the legend\" poboy was hands down the best sandwich I have ever had. The only drawback abo","useful":0,"cool":0},"L4Bmw6EP64uCKdhrdwmT4g":{"text":"Delicious food and friendly service. Definately try the crawfish beignet. Its worth every ","useful":0,"cool":0},"cspgvwjbfdYH1KxwjK0JBA":{"text":"Fantastic place to eat. Consistently great food and service. Great spot for family and fri","useful":0,"cool":0},"Q9h-CTGkkaKd2239DGzIcg":{"text":"Don't get \"the legend.\" Unless you prefer food SWIMMING in grease. Good idea, terrible exe","useful":2,"cool":0},"3V1_Hbv-fyTP9C9z-pCJrQ":{"text":"Just had the most wonderful \"brunch\" at Katie's. Bottomless mimosas and  other drinks on S","useful":0,"cool":0},"G3pBbsAannZMdlhBYPfsjQ":{"text":"I have been here twice and both times enjoyed the food. Delicious lasagna, burgers, crab c","useful":1,"cool":0},"hLk1jfgMZyfdbgehZnq6ag":{"text":"Nice, big menu with some NOLA staples included. Reasonable prices. The fish Noel is a litt","useful":0,"cool":0},"tL2ZkcB3rc6JiByERZPR3w":{"text":"We always try to sit at the bar. Love the bartenders here! Great place for comfort food. E","useful":0,"cool":0},"dtefbaKfVGY3E3BqFk8Z0g":{"text":"For my first visit, the fries were cold; the onion rings were lukewarm; and my $12 burger ","useful":2,"cool":0},"MdeU7lkb-5OnpfhJNFt5jg":{"text":"Had the Redfish Noel and asked the chef to kick it up with some blackening seasoning. Wow!","useful":0,"cool":1},"0j2x0eu63uAuDsMezJ5hXw":{"text":"+++\n- charbroiled oysters!!!\n- Catfish beignet is what they say it is (FYI theres also a s","useful":1,"cool":1},"8X85WqcnVeG23xEIg4-Tuw":{"text":"Overall experience was great, atmosphere was nice! We really, really enjoyed the crawfish ","useful":0,"cool":0},"4plYwh04KUnsh9Alk7fiAg":{"text":"Stopped in with my sister Saturday around 4:30, nice small crowd. We got the garlic cheese","useful":1,"cool":0},"7IXEHCM4UPFY-gBycc6wLg":{"text":"Let me just say if you don't LOVE this place you are not doing life right. Amazing gem awa","useful":0,"cool":0},"nPCeUFpgXAe5FyvZY9nY7A":{"text":"caught the streetcar down to katies, not a bad ride at all.  we were seated right away, ha","useful":0,"cool":0},"MrJkln0GMju1yV9c0PqJgg":{"text":"I've been to Katie's twice, I sat inside once and outside another time. Depending on the w","useful":0,"cool":0},"upmo54fHRku39DX4Bon6aA":{"text":"This place provides mediocre food along with mediocre service. At $25 a plate the food sho","useful":0,"cool":0},"T-Ms4xKt-YbwVbpxAEpyAg":{"text":"I live two blocks away. I frequently go there I bring my family there. This is probably th","useful":0,"cool":0},"Jg-Kkf8Yxw7Y64QMOSNOMg":{"text":"My favorite New Orleans spot, especially for Sunday brunch. Don't dare come here without t","useful":0,"cool":0},"fBkGQVtCBvP-ZSvZSrwrdg":{"text":"We went to katie's recently as first time guests and loved the atmosphere. It was Sunday b","useful":0,"cool":1},"VSUlg5RrQ2Caq26jumJhBQ":{"text":"OMG!!! A Foodgasmic experience!! We shared the crawfish beignet, which is Hugh and good fo","useful":0,"cool":0},"8C68GwTxR7nbCcgEKYPHjw":{"text":"I am so glad that Katie's has reopened since the storm.  My family and I use to love going","useful":1,"cool":1},"P3OHNeSKX83lJDTwaFnq1g":{"text":"Everything I've ever ordered was amazing! Been so many times for lunch and a few times for","useful":0,"cool":0},"uFStHi6wEDNfbvM6GpSyCg":{"text":"Katies\n\nWe were there on a Friday night. It was crowded, as usual. Once we were seated, we","useful":1,"cool":0},"Ka_x11pc8BUtx5lwuaSy4Q":{"text":"Started out with the seafood beignet. It was delicious and big enough to share as an appet","useful":0,"cool":0},"_H41pIj7wxJjmdhVz_dyAA":{"text":"I waited for over an hour to have brunch at Katie's. I know brunch usually comes with a wa","useful":3,"cool":0},"YJ_xx7CMNV1cVHFHvBHK4g":{"text":"Friends recommended (and took me to) Katie's, one of their neighborhood favorites. We endu","useful":0,"cool":1},"C0-IwlIFaB9eg1vtgoxcgQ":{"text":"It was the beginning of a Sunday Funday and we began it here with some brunch and bottomle","useful":1,"cool":1},"d4iat3CnoQlg7FblE9anCg":{"text":"I'd happily drive the 1.5h to get here just to eat the conchon de lait. It's finger lickin","useful":0,"cool":0},"TXoVigo47QB5RmljYPGrRA":{"text":"Delicious!! I had the oyster & artichoke bisque & side Caesar & I loved it! Friendly servi","useful":0,"cool":0},"J8LGxhhME7qvyISwh9k7Bw":{"text":"Unbelievable service by our waiter named Taylor. Seemed like a knowledgable local. \n\nThe b","useful":0,"cool":1},"U_V8airRvgT_G33k6KjL9g":{"text":"Liars and rudeness await you at Katies....\nThis place used to be one of my favorite places","useful":2,"cool":0},"YPzH8VQetPjn2teePSbJjw":{"text":"I used to frequent Katie's before the storm.  Haven't been back since they reopened and ju","useful":6,"cool":0},"rzshIpt6VIAAlZhrCvQtiQ":{"text":"The crawfish beignet is amazing, so amazing I ate it without taking a picture. I also orde","useful":0,"cool":0},"7bcD0_ZvmB2UEM-IVEVRqA":{"text":"Visited this place May 23, 2017.  The waiter Mr Murphy was the most miserable waiter I've ","useful":0,"cool":0},"cwXkeY0aUYxRfy0wdzjydg":{"text":"Situated in a quaint section of Mid-City, Katie's pops up out of nowhere as you drive alon","useful":1,"cool":0},"59kKa1l8O8w7rzyJdiMEqQ":{"text":"I'm literally dying right now!! The feta fries are so good I could drink the oil!! The sle","useful":0,"cool":0},"SGDFKOyuUxlCTN4EnDpnaw":{"text":"I love this little neighborhood place. There is usually a wait but I take that as a sign t","useful":1,"cool":0},"LFQ4hVR5HSIVORr_EWSo5A":{"text":"Good, consistent quality, food.\n\nThe crawfish beingets meet the billing.\n\nService has been","useful":0,"cool":0},"x1kGtWlYbMhd3zf5OFx05Q":{"text":"Love love love this place. The seafood and ribs are amazing. The beer voices are good and ","useful":0,"cool":0},"Tk2zkN_xvx9KVIb5qR523w":{"text":"Lunch hot spot. Great food. Very casual. Came today (Friday lunch) and it was very busy. O","useful":1,"cool":0},"GBiQkK-gquh63J5WeTrRvQ":{"text":"You literally cannot get a bad meal here!!! There was a group of 3 of us; the wait was not","useful":0,"cool":0},"yDiIVglS1ppVC__R0dPOxQ":{"text":"Katie's lives up to the hype. Brunch is incredible but dinner is fantastic too. Probably t","useful":0,"cool":0},"qwHRU4U0ZTpFeSYFuLn4GQ":{"text":"Eh... not all it's cracked up to be. Decent food and service, but we expected more from DD","useful":0,"cool":0},"4D4QoetAOfrx50E86XXtzQ":{"text":"I went there for Sunday brunch with a friend that has been telling me it is amazing. I can","useful":6,"cool":2},"GemlD_TXq4iYfCh_FBRsyA":{"text":"Stopped by there today for my birthday lunch!  I've been wanting to try the place for a wh","useful":2,"cool":0},"6X0TcoKd6nbcoS8Cnoriiw":{"text":"This place was awesome! Our food came out from the kitchen so quickly! They have a huge me","useful":0,"cool":1},"soamWU7KZxyjaSpFSuK8_g":{"text":"This local tucked away place has some of the best food in town. If you're looking for the ","useful":0,"cool":0},"l_UF6jk8r2Jl854LZWMngw":{"text":"Service sucked horribly. We went after the brunch rush and it took over an hour to get som","useful":2,"cool":0},"Hfk2NC6BVpFf5DmpRCjsAQ":{"text":"Located off the beaten path - seems like a great place for locals and tourists.\nI was gett","useful":1,"cool":0},"sp0eCkF0-mzgshuXdXHg-A":{"text":"Haven't figured out the sweet time to find Katie's without a line and a wait.  Very popula","useful":2,"cool":1},"XCJ8uV1CL9WO5fwhk7IZDQ":{"text":"$15.00 all you can drink brunch cocktails... need I say more?!\n\nMeet a friend here for bru","useful":2,"cool":2},"k_tN2Nsghy-U9JtFB_JIAw":{"text":"One of the best places in New Orleans with great New Orleans' food. Wide selection with al","useful":1,"cool":0},"UsanahwAXX0l4UbpI3GClg":{"text":"What an incredible lunch today with 4 colleague's. Whatever you have a hunger for , Katie'","useful":0,"cool":0},"PtXSDIf3IkvdmIZbx9H2Eg":{"text":"This restaurant is a gem!!  It is a classic in Mid-City I have gone to many times over the","useful":2,"cool":2},"vRap3EWQMJ-k6r-vz5Slvw":{"text":"We ordered take-out. The Kajun Cuban is amazing. Lasagna is a huge portion. And the onion ","useful":0,"cool":0},"GAGM7L1McZu72VZCUvqC7Q":{"text":"Katie's is right around the corner from my apartment and every night I see a line of peopl","useful":0,"cool":0},"Uc-VxLXBErAnI4sXZIALwg":{"text":"The Red Velvet Elvis Doberge ain't nothing but a hound dog...\n\nA friend and I recently cel","useful":2,"cool":1},"ROwvh9PCOV0TLONWimB71Q":{"text":"I've been to both brunch on Sunday and lunch on a regular old Wednesday.\n\nBrunch (November","useful":0,"cool":0},"qhZFDXhKmmyROqmgXe8xJQ":{"text":"I used to eat at Katie's before Kachina and it was really good.   Since Katrina, the menu ","useful":0,"cool":1},"smHqPfGO1mL2pqRvgc5NTQ":{"text":"Everything was delicious! I ordered the crawfish cochon and it was awesome! My mom ordered","useful":0,"cool":0},"ieut29fEWMl3QETRHxxVxg":{"text":"Eat here 2 to 4 times per month. Great staff but even better food. Crawfish Bignet amazing","useful":0,"cool":0},"mekPEwOrRdikwXF708-YTA":{"text":"Received multiple recommendations for this restaurant. OMG the Boudreaux pizza ! I live in","useful":1,"cool":0},"bKpfDGhT6rWoPABIsC96Fg":{"text":"We came to have dinner here for a first time visit as we have seen on tv and was ready to ","useful":0,"cool":0},"8FMmVekElbP853D5zRqRMw":{"text":"I wasn't too impressed with this place. The poboys weren't great and there are definitely ","useful":0,"cool":0},"W1bYcbR7vkcq6dt-kdx--Q":{"text":"I am not one to get into the whole \"best Po Boy in the city\" argument. I think it is a fla","useful":2,"cool":0},"n-tFex6vP_7AaquKgQSBCQ":{"text":"I've had fine meals at Katie's and I've had mediocre meals here too.  It is a fun neighbor","useful":5,"cool":3},"hQTpa4uCZaiTMWJptYHK8Q":{"text":"Absolutely amazing from the chargrilled oysters, to the chicken and sausage andouille, Cub","useful":0,"cool":0},"1wMrJg3xgCvzVlzcQ14qRw":{"text":"My compadres and I settled upon this place after a lengthy discussion regarding a suitable","useful":2,"cool":0},"00LaM6EeMQ944Iaw9f0cBA":{"text":"My husband and I loved this little spot in Mid-City. \nThe seafood beignets are delightful.","useful":0,"cool":0},"2Nj4wUUAdmjzoleyt-63vw":{"text":"First timer. Had the Scottie's Breakfast, which I figured had some of everything. Best che","useful":0,"cool":0},"EHQj_qzJG8xuSKaJ2yc_4Q":{"text":"Three words: Get \"The Legend\" Happiness of cochon de lait and BBQ shrimp all stuffed (real","useful":0,"cool":0},"8Fk_ar2KLJ0GG3Tr_Mf9yw":{"text":"Nice little place. Over crowded at lunch. Very sweet hostess and friendly staff. Had a ble","useful":0,"cool":0},"XJq4NZ7Wn52JIoqFjHKdiQ":{"text":"My wife and I have been trying to have dinner at Katie's for the last few months and the l","useful":0,"cool":0},"SO-f1qDtV1Baj5W7IBVspg":{"text":"Lovely! My first meal in New Orleans. The blackberry basil marguerita was delicious, reaso","useful":0,"cool":0},"pJKZ7tmsXUio2twlQET6Hw":{"text":"I love looking for great places to eat in New orleans on the web and then taking my bike a","useful":0,"cool":0},"Fu33CLA2O_sKr9FH7LKyRQ":{"text":"My BBF just moved into the neighborhood, so we've been Yelp'ing what's around his house.  ","useful":1,"cool":0},"UbmY2D81KaEth1ZQYqMhLA":{"text":"the food is really good... \n\nbut i found out they dont devein their shrimp. \n\ncooked or no","useful":1,"cool":0},"0HkxfslmkL9j4nZEtCiyQQ":{"text":"Every time in New Orleans, which is two or three times a year, I head for Katies.  Last ti","useful":0,"cool":0},"RB-bHIMfd8p2MPuYRhw-yQ":{"text":"The chargrilled oysters were great! The crab cake poboy with grilled oysters was really go","useful":0,"cool":0},"0GbA1Vc8Sh-fs_rTrrgZsg":{"text":"Fabulous.  Came with two friends.  Started with drinks at the bar.  Drinks and service was","useful":0,"cool":0},"SDGJ4bX__KBIoYLRUs6eFA":{"text":"I have come here both times I've been n new orleans as a 21 year old and this place never ","useful":0,"cool":0},"ebHaLbIYwEudzXmoAST5zw":{"text":"Love this place!  I come here every time I visit New Orleans.  The staff was very friendly","useful":0,"cool":0},"aPQzhhpdxxIjnhw6Ee5MDw":{"text":"We came across Katie's by accident -- it was getting late and we wanted a quick bite to ea","useful":0,"cool":0},"QSEm6myA7Q00RnobNY2q3A":{"text":"Chose this place on a recommendation of a friend who lives in LA. \n Atmosphere and food we","useful":0,"cool":0},"g6jFYNidPSZx7q6ekG9AqQ":{"text":"OVERALL : FOOD 3, SERVICE 3, ENVIRONMENT 1\nI heard about this restaurant on the morning ne","useful":0,"cool":0},"eMklJh0EcpXmjqdgwxk0Hw":{"text":"I got the Lasagna.  I have eaten seafood here before and it was good. I have heard the che","useful":0,"cool":0},"xx2_bftX2py-lMGGaxj7jw":{"text":"After living all over New Orleans, I cannot believe we are just now getting around to eati","useful":1,"cool":1},"DwdG7i4qJnXHGv7Pa10SRA":{"text":"The cochon de lait po-boy was very tender, and the bread was very crisp. This is one of th","useful":0,"cool":0},"z_Ds1z9yMip0j7Zm2QUPCA":{"text":"Came here for brunch with my boyfriend today and we were sat immediately, since it's just ","useful":3,"cool":0},"uovFRl1d-5YufsNNvYiXBg":{"text":"a definately good local find.....................GREAT sandwiches and pizza.  I had the ro","useful":1,"cool":1},"YXmAXDCaa0xAXjKMrHxGgA":{"text":"I ate brunch here with my parents and their boring friends couple weeks ago. The breakfast","useful":0,"cool":0},"RcOLT9yxYBEdCo8OkturLA":{"text":"Katie's for Sunday brunch is awesome.  The unlimited drink special is great.  Good bloody ","useful":1,"cool":0},"0vutLAbQfrvin2MIOjQO9Q":{"text":"This place has friendly service and delish delights! Right off the plane my friend took me","useful":0,"cool":0},"Z5o1TgcnZt1aUQtFzE6ohA":{"text":"Two words. Crawfish beignet. Probably the best thing I have ever eaten. Truly unique and s","useful":0,"cool":0},"7S89_6WmgXHXnk1bx7ZBSA":{"text":"I'm giving this place a 4 star rating only because of the food.  Food was GREAT.  \n\nServic","useful":1,"cool":0},"Fbmk0m6PJe5sVTdSPr8bpQ":{"text":"Omg..the food was delicious..I had the redfish...very cozy spot. I will be returning..","useful":0,"cool":0},"kY5B2dw-Go40q9oAzxWyxA":{"text":"Everything  is fantastic ,though i wish there was less fried on the menu ,but this is new ","useful":0,"cool":0},"lFk2xqwEaFUmbTT1clcLgA":{"text":"After a long weekend in the city for Bayou Country Superfest, my fiancé and I stopped by K","useful":0,"cool":0},"KEurAmOgO-ZPfXl0-dEJBg":{"text":"My shrimp poboy was delicious , the French bread just right, the combination of everything","useful":0,"cool":0},"6jzptF1NPGxnGQ_njlv9Dg":{"text":"Katie's is one of our favorite neighborhood spots - unfortunately, the neighborhood it's i","useful":0,"cool":0},"5OIW2LLq6YwIikL-GNe4bw":{"text":"I ordered the catfish platter to go on a Wednesday afternoon around 2pm and altogether I s","useful":0,"cool":0},"lk4Vap4mzkyf1jSFZbeEvQ":{"text":"Phenomenal. We ate like queens, everything was so delicious, and I do mean everything... w","useful":1,"cool":1},"VsSo7TqHesQsdBeOw9dZWQ":{"text":"Last night was their steak night.  I specifically asked the waiter if their fillet was not","useful":0,"cool":0},"0fd4DgS_G-XlUVaAvtP5mA":{"text":"It gets no better than this establishment. The owners and staff are over the top helpful, ","useful":0,"cool":0},"IrUXR5XLhykJCLkiWtCH9A":{"text":"The food is crazy good! Nice large portions and the staff is super nice! We got charbroile","useful":0,"cool":0},"r86jHLjRAWtDrU_7Cj03yg":{"text":"Thought I'd give this place a try after seeing it on Diners, Dives, and Drive-In.\n\nHad the","useful":0,"cool":0},"c25dTNyHPFsGLMSM1BDh1g":{"text":"Right off of street car line. Went during lunch hour .  Very loud.  Good food though.","useful":0,"cool":0},"6pUJtJ3pGgPzEeMvPjps_Q":{"text":"Their brunch is absolutely delicious! The crab cake Benedict is one of my personal faves a","useful":0,"cool":0},"q8rgoWOpKUuU8vKyY062Bg":{"text":"Sausage beignet is delicious! Grits are creamy.  We will be back to try more.  Service was","useful":0,"cool":0},"PFkxJwMbXTe_Cu9TpSt41g":{"text":"I don't give many 5 stars out. To me, the service has to be impeccable, which includes pro","useful":1,"cool":0},"N9K52EllTQW1R-JdhMaSMg":{"text":"I had their Sunday brunch and will with out a doubt say that they served me THE best panca","useful":0,"cool":0},"a17pnUv9ZHHVm9wtAs4aNg":{"text":"Katie's is sinfully delicious. The chargrilled oysters and the crawfish beignets are amazi","useful":1,"cool":1},"kL20aAmAgj2n1-qt7sFzhA":{"text":"Amazing little neighborhood gem.  They have really amazing pizza with delicious cheese bak","useful":0,"cool":0},"wZTvwEN7oFTKWT-XV-g6Ww":{"text":"Haven't been here in a while, but went last night and it was so good! We are already plann","useful":1,"cool":0},"_1q2jGOUpnwhPouaNrDNvQ":{"text":"I feel the same way as Angie T. ..... I've been waiting to try Katie's for a hot minute, b","useful":4,"cool":2},"4IQdnvIFWGdraQsQUuDRdg":{"text":"Katie's will always hold a special place in my heart. Growing up in Mid-City, this was pro","useful":4,"cool":3},"JQlr4f0B05PIpsUgQLXnXA":{"text":"My friend and I were fortunate enough to visit Katie's on a dreary, rainy day. I say this ","useful":0,"cool":0},"t46ow1TpHKZ0nmseUzUMAA":{"text":"Recently we had the pleasure of visit NOLA.  Katie's was suggested for lunch. We had a lar","useful":5,"cool":1},"Z6FXlzJizBWuBp6jxU-SBA":{"text":"All I have to say is.... Crawfish Beignet!! Holy smoke it was delicious! A bit off the bea","useful":0,"cool":0},"m9nFZLonMlV4S0hjYApOOg":{"text":"Idk what the hype is about with this place, I've been twice and it was below average each ","useful":0,"cool":0},"6ePP0LAvNuV-oIacmTk5Pw":{"text":"I have eaten here a couple of times now and everything I have ever gotten has been really ","useful":0,"cool":0},"FypHwFgzXbwd9irjvwRfmQ":{"text":"We found this restaurant through Yelp while visiting New Orleans. The food, drinks and ser","useful":0,"cool":0},"fYPy5KXrferCoMiO4PPUfA":{"text":"Horrible service want ever come here again when I'm in the city.  Manager didn't care how ","useful":0,"cool":0},"G9_XiqMnuqPXIh4-A9UwOw":{"text":"Someone from our hotel recommended Katie's to us. It was about 10 minutes away by cab. The","useful":0,"cool":0},"g5MoXqAYizUYGSncNjUwvw":{"text":"Awesome little joint. A little pricey. Bottomless mimosas were reasonably priced and gener","useful":0,"cool":0},"l2-w0Ykz7KurLRrQXjq0pw":{"text":"This is my go to spot when I have friends in town and they ask me who actually has the bes","useful":0,"cool":0},"j257d6spTzQ9FbBW4VAWLg":{"text":"Katie's...ahhhh  Southern Comfort Cajun food at its finest. From the delusions Onion Rings","useful":0,"cool":0},"a3vniRjFEWNkIQcdXtLLUg":{"text":"I went here with my girlfriend for brunch. It was pricier than Baltimore (but how many pla","useful":0,"cool":0},"6STRECyj30CKOg22rFKnNg":{"text":"Good place to grab a bite. Local favorite! I like the place and atmosphere. \nI'm afraid Br","useful":0,"cool":0},"UkCfhkVUgajCQydU1tM4VQ":{"text":"We love Katie's. A trip to New Orleans is not complete without a meal at Katie's. Recommen","useful":0,"cool":0},"BtNCmt9NUPkk96U0PcmJYw":{"text":"Went for brunch and was surprised by how lack luster everything was. The mimosas weren't v","useful":0,"cool":0},"lYmDU47Mbu79pHKc6BL7dQ":{"text":"They weren't expecting the yelp check in deal and grudgingly partially honored it. I know ","useful":0,"cool":0},"i3QIog-i8No-wL_KPgVQvg":{"text":"Many of my friends have had lunch @ Katie's and raved about it. Tonight four of us went th","useful":0,"cool":1},"y0YTT-jiHsuN1XVeo1ZQow":{"text":"This is a quaint little place. They have two floors, the upstairs is usually a little quit","useful":1,"cool":2},"0uFlteJy_oZJjXkvXzfLYw":{"text":"I visited this place two years ago when I visited New Orleans last. It is now a must on my","useful":0,"cool":0},"e8AQTHcAjlLS3syR7ZM0ng":{"text":"Amazing food, and yummy bottomless drinks! Our fantastic and friendly waitress Morgan gave","useful":0,"cool":0},"m9TWFEKzbE37EQuAhvscvg":{"text":"Went there one night with my husband and he had a pizza and it was bland so he didn't like","useful":0,"cool":0},"-7eIA1hCU2SpEKhv9cD61A":{"text":"So-so, hit and miss. Had a good, huge real burger that was tasty. Did not like the gumbo a","useful":0,"cool":0},"UoiPkL99cSdk0CvVfPfA_Q":{"text":"Had lunch at Katie's on Saturady and I had the most amazig hamburger steak that I have eve","useful":0,"cool":0},"4p9rdnGdITfj-PBzkJNlMQ":{"text":"Katie's never disappoints! From the crawfish beignets to the pizza to the oysters, everyth","useful":0,"cool":1},"wkr3UqYuOYg-YDpCJyeifQ":{"text":"Always a pleasure coming here. My favorites are the Bordeaux and Atchafalaya pizzas! With ","useful":0,"cool":0},"J4dKK3VkeG0GgIU7dc_pfg":{"text":"I love everything about this place! Nestled on the corner of a Mid City neighborhood, sits","useful":1,"cool":0},"ILbAMNpJqhYQMQ-QTbol-Q":{"text":"Absolutely delicious!!! The menu has a ton of options but is not overwhelming. I had the S","useful":0,"cool":0},"DqtSDlpuYsD0kRI4iswbqA":{"text":"Wowza! The food is incredible!! We had ribs, chicken, crawfish beignet, burger and veggie ","useful":0,"cool":0},"zDPBa69DBDBwtZ6BhHoW2Q":{"text":"get here early!!!!  i've been on sundays for brunch and it's pretty killer.  i'm a sucker ","useful":0,"cool":0},"auo8591CV8vY4aqzkwSriA":{"text":"Typically a great place to eat, but today the ribs didn't fall off the bone per usual, the","useful":0,"cool":0},"8pGOHgRLZL_tq-_-ewN43A":{"text":"Everytime I've had a chance to stop for a bite to eat at Katie's, I've never been disappoi","useful":0,"cool":0},"8HEtvfHIEbKNzrAVmcDWwQ":{"text":"I rented a bike and rode it here for lunch one day last October. I was excited to bring my","useful":1,"cool":0},"a6xntZzK54z5xTh7gB0vuw":{"text":"I have nothing bad to say. I came in with a local on a Saturday around 4pm and it was no l","useful":0,"cool":0},"mJKh4jP44LflAvho3byTEQ":{"text":"Had a great lunch seafood beignet,legend poboy and red velvet Elvis all outstanding but th","useful":0,"cool":0},"GjgxKxUKqrOtR-CYn6BKiw":{"text":"Came here on a Sunday for brunch around 10am and had no problem getting seating for our pa","useful":2,"cool":0},"uBLt-MbtsK9ZDF9T50iMgg":{"text":"I was hoping for a better experience here. I ordered the crawfish beignet. I was cutting i","useful":0,"cool":0},"Fa68pDkXjw8d-s3pg9cTvg":{"text":"Came here for lunch with a big group after helping out with the JHS Thanksgiving Drive, an","useful":3,"cool":2},"AJ6wzw1pkgCkAMLaxebzKQ":{"text":"I was thoroughly pleased with the level of attentiveness and service that I received at Ka","useful":0,"cool":0},"woq9xUNgcSAeJ-SN6pEong":{"text":"I had been excited to try Katie's as I'd seen a lot of good reviews.  Was very disappointe","useful":0,"cool":0},"_qhtn12Cy969uK0PqoefRQ":{"text":"Always amazing food. Had the cochon de lait, the crawfish beignet, and the chargrilled oys","useful":1,"cool":0},"lOWQgKGj4FSMf2T7xsapJQ":{"text":"Nice quaint bar and grill in nice New Orleans neighborhood about 5 miles from the Hilton R","useful":0,"cool":0},"4pQweTw6D1UPYpMU0xr0sA":{"text":"Best Pancakes Ever! Went to Katie's for brunch last Sunday and ordered the Lemon ricotta p","useful":0,"cool":0},"vm5KGv0tDGRzukVt-OiJmA":{"text":"For our second dinner in New Orleans we headed to Katie's.  Yeah, it's fine, but there was","useful":1,"cool":0},"OuCEoBJp5WzP5y4IMHM9lA":{"text":"OMG! I'm so glad we decided to wait.! We wanted to go somewhere new, because we always go ","useful":0,"cool":0},"RhYnCuoaLEN4Gk5EbgySLA":{"text":"Came here for dinner tonight and I am severely disappointed. Long wait for the food even a","useful":0,"cool":0},"I5w37B4GpnUflkhMk-Ay4w":{"text":"Good food in the neighborhood of mid city. I like their chicken and andouille gumbo with t","useful":0,"cool":0},"NJGS2BQH9QQDrx1hi-OTyg":{"text":"Damn good gumbo. The fries on the fried catfish platter are crispy and just the right amou","useful":0,"cool":0},"ANpvag6wa-Jy8S9U6b9-uA":{"text":"Super busy with the mardi gras season. Even at a popular brunch time the wait wasn't too b","useful":0,"cool":0},"uDsTnpz0Paeg2blsVPtZmw":{"text":"We loved our meal and service at Katie's. It was a great spot to choose for our first nigh","useful":0,"cool":0},"dOq7Kfdr-KUq7wsIraBNzw":{"text":"For me,  a five star review means you hit it out of the park and pretty much every possibl","useful":0,"cool":0},"R2FNfDfgmGnZncAnloK2_w":{"text":"Katie's is a must if your in NewOrleans real authentic food at a great price with great fu","useful":0,"cool":0},"8WMRzWUNbvpHFapQ1vyTAg":{"text":"We had an excellent meal here, the crawfish beignet was insanely good as was the bread pud","useful":0,"cool":0},"c_v0KKhshSuSAh7OSacs3A":{"text":"I can't say enough about this place; both about the food and the kindness of the people wh","useful":0,"cool":0},"7D9QXaUcugUOMk9u37wEsA":{"text":"Honestly, pretty disappointed. Saw that the reviews were good but my experience was not. T","useful":0,"cool":0},"e_OJzzV238AWNp7JQoWDDA":{"text":"Gumbo was awesome, even though some of rice was chewy the roux and meats were so good it d","useful":0,"cool":0},"Q9DiC0sao6KPIHRLpQo2BA":{"text":"Visited this restaurant on a recommendation and the food was fabulous - we sat outside and","useful":0,"cool":0},"aEyqdpbv98Ux0Rv4GrifSw":{"text":"I have good news and bad news.  The bad news:  DO NOT ORDER THE CHEESE FRIES.  This was a ","useful":1,"cool":0},"C7J4dSE4lf3_jgiOPqVexA":{"text":"Luckily we arrived on the earlier side for dinner and had no wait. Started to get busy as ","useful":0,"cool":0},"DhxtQTbPgjg5DIGDXKI-QA":{"text":"Awesome service and the food was spectacular new Orleans cuisine at it's finest carrot cak","useful":0,"cool":0},"o9mSaIoSobaCUrC-9ep5rQ":{"text":"Went for lunch with two toddlers, a seven year old and three adults. They got food out qui","useful":0,"cool":0},"3gyrOwUU5vnVuYvzX9gNBg":{"text":"Gave Katie's a try after searching the web for great spots in New Orleans. This was in the","useful":0,"cool":0},"BM2htn4mTab-_5ObQuc3tw":{"text":"Chargrilled oysters were delicious. Gumbo was ok, a little spicy warranting the 4 star ins","useful":0,"cool":0},"HnUlRrHLPggQS0dEeVxS3w":{"text":"I tried Katie's for the first time during coolinary month. Our server who's name slips my ","useful":1,"cool":0},"GRxlLWGO9TIXxV6MlHAciA":{"text":"Yo!!!  Order the crawfish beignets and oysters!  Also bottomless mimosas!!!  There is no r","useful":0,"cool":0},"CEp3UV9OZ5elffJzyAnVKg":{"text":"Katies is a local favorite serving up quality southern food. The seafood beignet is my go ","useful":0,"cool":0},"jwNE__WqWYfozuAoeaKG7A":{"text":"Bad experience! Last Saturday I went to Katie's with three friends. The first thing that h","useful":0,"cool":0},"UnxTJ8ddGN2TSgLxOP33ug":{"text":"Excellent food and wonderful service! My husband had the pork chop and it was very tasty. ","useful":0,"cool":0},"hkhGTomnNKKzFkAbfEyCUg":{"text":"The hostess ruined our experience to start with. She would not seat us party of 4 when 2 w","useful":0,"cool":0},"HMyMpFjrdBbnhbE7euAWsQ":{"text":"They do NOT take reservations, silly us came at 2pm for late lunch/brunch on a Sunday. We ","useful":2,"cool":2},"Jvj3y-fHGxHYy6mFjjx8gw":{"text":"What can I say? I think I found a new favorite restaurant!! \nThis place has it all. From p","useful":6,"cool":5},"NJ_iJsZ2pUzDdDl5wCWcug":{"text":"On our trip to New Orleans, our great friends discovered this place. The food is amazing a","useful":0,"cool":0},"JitAJRAWoC6uqPXGEkG8wA":{"text":"Absolutely fantastic service by all staff and exceptionally delicious food. Had a Po boy c","useful":0,"cool":0},"Xq-R568DVhBZgKiE0DKhyA":{"text":"Amazing variety on the menu and yummy NOLA eat! Staff are very friendly. You may have a wa","useful":0,"cool":0},"bGzEGZgkTXBgqljBoNYncg":{"text":"Let me tell you this is my first visit back to Katies since before the storm, Scott Craig ","useful":0,"cool":0},"6Z3dBIp5vIGLzRQ8jCzC-w":{"text":"Came here for a meeting. I've been wanting to come here for a while. The service is pretty","useful":0,"cool":0},"h5SeLS7aZ4x_FSCUBI-QdQ":{"text":"Katie's was a solid dinner choice with lots of menu options and excellent service. Swamp f","useful":0,"cool":0},"bE_y2NbvIHFPizRFeAl2XA":{"text":"I spent a weekend in New Orleans for one of my best friend's bachelorette parties. She spe","useful":0,"cool":0},"ZDuG36fcL35C4pkFC5egdw":{"text":"We tried this Triple D favorite on the way out of town and are so glad we did. We had to w","useful":0,"cool":0},"GQd9bFi0dKZa9IyY1v1oDQ":{"text":"Always enjoy a visit to Katie's! Their \"swamp fries\" are absolutely finger licking good. T","useful":0,"cool":0},"slxsG5hL7TxXfb9iOTStSA":{"text":"You know when you've had the best bacon wrapped shrimp before, but you don't live near the","useful":1,"cool":0},"zbKHFUA0o2nGZPD4BTknUQ":{"text":"The only bad thing about this place is that we stopped here on the last day of our trip.  ","useful":0,"cool":0},"qSrUKh6Dztf49r6_RnkHWw":{"text":"A hidden gem off the normal touristy path in New Orleans. It's worth an uber/lyft/taxi rid","useful":0,"cool":0},"4s8uOZqWQxxlWd5rw5J4ZQ":{"text":"5 stars for the chargrilled oysters alone. This place was one of my favorite stops this tr","useful":0,"cool":0},"PJe_LJZOYBTmPvKM1ggxgw":{"text":"This is really only in reference to Sunday brunch and sitting outside. I have had some goo","useful":0,"cool":0},"56xmGgwOPYXrXhlu_xmRcg":{"text":"Katie's wasn't great with there service... food was mediocre..the manager was condescendin","useful":0,"cool":0},"dIWp6amZnV4kTbREcPbvQQ":{"text":"One of my favor spots for oysters. Great fish chef daily specials. Eggplant sticks are awe","useful":0,"cool":0},"pME-Ngg1wDKV0L9yHiG3uQ":{"text":"This was my first time here. At first I thought, \"where the heck am I, the burbs?!\" As we ","useful":1,"cool":0},"tFhw-uRn5kqNEdLHl4vGpQ":{"text":"This is an eclectic wonderful place! The server was nice and helpful. The food was flavorf","useful":0,"cool":0},"Z2Dyu77pdcUj3NsHa6Monw":{"text":"This is a great place for lunch--as long as you can get in. Their daily specials and the m","useful":0,"cool":0},"ysfeO6uBV5q_ad00cBi4kA":{"text":"Took a party of 16 Saturday night and the food and service was outstanding. Very accommoda","useful":0,"cool":0},"zL40OPeAfIjTQHxN60tfGA":{"text":"Good service was a highlight of my visit here! This hidden gem was recommended to my by a ","useful":0,"cool":0},"rdVRh3GSjm7UbXG_DrucRA":{"text":"Truly enjoyable. Heard about this restaurant  from friends. Finally I was able to go. Was ","useful":0,"cool":0},"H-FFF2haa6eRgEvHTEhokA":{"text":"A WONDERFUL EVENING! So...we came here for our best friend's 30th birthday who just so hap","useful":0,"cool":0},"sjd245ojyOPgB9CgfU38SA":{"text":"Hands down one of the best places in the Nola area. We go for lunch, dinner, and brunch! B","useful":0,"cool":0},"EGFxOvDoIICENUgmJUzvrg":{"text":"Katie's is exactly what you want in a neighborhood place--skilled bartenders (excellent sa","useful":0,"cool":0},"oQbohp7wqRGHeUcw8W4y9w":{"text":"A disclaimer - I went twenty minutes before they close but to be honest, they are always s","useful":2,"cool":1},"VGvDAI6qS5W5otLueEreug":{"text":"I didn't have a great experience on my visit here but it wasn't terrible either. We came i","useful":0,"cool":0},"K50Gg1Vw7NypRBoScp-JPQ":{"text":"Round two for the gruntled brunchers...it's still on the top of our list! \n\nI had the crab","useful":4,"cool":2},"y5U5T4BiVmn5Eh1aKoebgQ":{"text":"Wanted an out of the way place for NOLA, and we found it.  My wife & I went for Sunday bru","useful":0,"cool":0},"qDJ56WT-E_WOZT_aY2I_zg":{"text":"Just OK. Crab cakes were delicious with big chunks of meat but the poboys were so so. We g","useful":0,"cool":0},"-PNnIvGRTbxFk4pQ1H6Zuw":{"text":"Love it! Only down side is the wait. We waited over an hour to get in on a Sunday Brunch. ","useful":0,"cool":0},"x5hEc_VaeiAk3OFRBzLbjA":{"text":"Disappointed in lack of customer respect. A group of 5 and myself came 1/13/19 at 10:45 an","useful":0,"cool":0},"4UC-gBeHG5qDJz6PUjtkrg":{"text":"Best food I have had in New Orleans! This place is amazing. Yes, there is a wait but you c","useful":0,"cool":0},"If6SzeS3495jO2_id2gdmg":{"text":"Back for Xavier's reunion, I'm staying on Carrollton and I googled the best place to eat n","useful":0,"cool":0},"orFh39o5m-n_2GnblndfcQ":{"text":"One of my go-to's in New Orleans.  I have yet to have a bad meal here.  Everything is frea","useful":1,"cool":1},"4BjXCxXJedkRxbPxO14QtQ":{"text":"Shared the Barge with friends and had the crawfish beignets as an appetizer. The food was ","useful":0,"cool":0},"ZSGK9S-KePone7v94KJjOA":{"text":"Came here for brunch our last day in NOLA. We had about an hour wait but it seemed to go b","useful":0,"cool":0},"azOsjZmJt3e2arIdASNx0Q":{"text":"The food and service is always great just be prepared to wait at least an hour on Sunday. ","useful":0,"cool":0},"IpJEheqPtNGNaByIsVofeA":{"text":"Came to this place on the recommendation of a bartender at our hotel. Very cute neighborho","useful":0,"cool":1},"iVTBEb1TBHGCN6v1HsuGsw":{"text":"3 words Garlic Feta Fries. I want to stick my  entire face in the bowl every time. We have","useful":5,"cool":2},"IATV1eLX0xaJ8OvVdgml2g":{"text":"Not worth the visit! Another over priced tourist spot! Paid $17 for a piece of fish and fr","useful":0,"cool":0},"dktN1cwf9wrmIjgv5ECDzw":{"text":"Katie's was DELICIOUS! coming in from out of town, we heard rave reviews about this place ","useful":0,"cool":0},"r_QnvmmVwfAx3akU7H_HbQ":{"text":"I have been to Katie's two times now, and both times I have been extremely impressed. If y","useful":0,"cool":0},"-EC9Zbmx8yGlWDG6ibVi1A":{"text":"Rich in New Orleans culture and flavor. The food was absolutely delicious. Great customer ","useful":0,"cool":0},"lOemRRE7AofEGs3Pj75GJQ":{"text":"Came for dinner and was very pleased. It was a busy night so we started with some drinks a","useful":0,"cool":0},"t9LfuJSogQ9ZfCwLuBc_lg":{"text":"I've been here a few times.  The employees are very friendly,  the pizza is good, and the ","useful":4,"cool":0},"4DSv2kDua5r3lDFWFKefBA":{"text":"Another Guy Fieri favorite! Try the Cajun Pork Pizza next time you're in NOLA.  It was cle","useful":0,"cool":0},"JpqhVv4ou37N0HP5bG2PFQ":{"text":"Excellent Charbroiled Oysters.  Everything on the menu is superb!  Great local New Orleans","useful":0,"cool":0},"WWSowO4lNkqGara4U2Xntg":{"text":"This place is a hidden gem! We went for brunch and were not disappointed. I really enjoyed","useful":0,"cool":0},"YeSxWgOElPY2L8wXKWhX3w":{"text":"Good food and good service as usual. Never a disappointment! My favorite place on Sunday. ","useful":0,"cool":0},"tUxpGRndfsuWNJdZHo4pig":{"text":"We tried this Triple D favorite on the way out of town and are so glad we did. We had to w","useful":0,"cool":0},"95pDvJtXA5oOdBf2GXt6cA":{"text":"First time i have been disappointed by their food.\nFinally took the grand kids, its one of","useful":0,"cool":0},"VpoTNvArg90A1aVk67gFPg":{"text":"Great food and service! Girls Trip stop!! New Orleans was Great!!!! We had brunch here dur","useful":0,"cool":0},"GnkBd1BxbqH-LWK2BrfUug":{"text":"I think the greatest thing about Katie's is the people that dine there and make up the nei","useful":5,"cool":3},"k0tWhqNa9tWLGXgTqyAspQ":{"text":"Just came from Katie's. Normally, I don't write reviews based off of service. However, my ","useful":8,"cool":2},"u2_UHIaURo3qiK7Yjq5__w":{"text":"So, a little line but knowing the fame of the restaurant i understood, got sat down right ","useful":0,"cool":0},"eT-18eWyoHys1BB7YdIYmg":{"text":"Everything at Katie's was delicious!!! I wish we could have eaten here every single day! I","useful":2,"cool":1},"fmJ9ElMl9yALD9RT9KzH5Q":{"text":"Delicious food! I shared with friends a Scotie's Special Breakfast, Biscuits & Country Gra","useful":0,"cool":0},"ddY22XLz-B4wRh4VkBUjug":{"text":"Food was good, service good, but a funny smell ruined our experience.  We've only been her","useful":1,"cool":0},"2h8OjF98k2OlvVIlNtJPjw":{"text":"pablo was our fantastic server! boudreaux pizza and crab frittata. bottomless mimosas and ","useful":0,"cool":0},"rVNsvABbFURvjH1Prq3vpA":{"text":"There were six of us from Texas eating a last breakfast before returning from a fun birthd","useful":0,"cool":0},"myTlN7edRg7y8IKHCPAf7A":{"text":"Crawfish beignet was phenomenal. Onion rings and feta fries were delicious too. Can't go w","useful":0,"cool":0},"twx5MmLBew-go7Lhlxc0Ig":{"text":"Remmy's stack (fried green tomatoes and fresh shrimp), crawfish beignet, and oysters are a","useful":0,"cool":0},"HC0DUpODhl7GS8wNWNBeiw":{"text":"Omg I had the catfish and oyster platter it was absolutely amazing the oysters was fried j","useful":0,"cool":0},"8UhOQACr0qZiDIq5P_opcA":{"text":"Not much to update, because I ordered exactly the same thing as last time-cheese fries and","useful":0,"cool":0},"KHPl3sYCW7Pg-dtmXb6RTA":{"text":"Go for brunch and you not be disappointed!  Crabby eggs and bottomless Bloody Mary's was t","useful":0,"cool":1},"wdAWyhxTgLq5epkwZLpkvA":{"text":"On each trip there seems to be a place or food that makes you dream about how you would do","useful":0,"cool":0},"y5_XnuIBcc_nWPnz9Sf-6w":{"text":"This restaurant has to be one of my favs! Even though it's been around for decades, I didn","useful":0,"cool":0},"twLsCUiQt2RmSUg7BT2BrQ":{"text":"went to new orleans for a 4 day weekend and was told about this place now let me tell you,","useful":0,"cool":0},"RMhjx9DmtvJLO8E_qwa1gA":{"text":"My friend and I came to Katie's this past sunday, we were told a 30 minute wait, and was s","useful":1,"cool":0},"zIjoeDoj7YMOclKxLT80AQ":{"text":"This has to be one of my favorite brunch spots in New Orleans!!!! I think the best time to","useful":1,"cool":1},"Z_LDpWVXW6fYbaDLAcsUEQ":{"text":"Fantastic lunch spot! Grilled Oysters to die for. Excellent service and a lot of local fla","useful":0,"cool":0},"3m8hDNYOaCU8tmug0J7zOw":{"text":"We were just happy to find a place open on Fat Tuesday but then the food was amazing to bo","useful":0,"cool":0},"i4Yi6CYUuIlMjtMhVAT_KA":{"text":"After careful consideration, given my out-of-towner status, my girlfriend and I decided we","useful":1,"cool":1},"whHe-YnwuGNwONl-o0JxSw":{"text":"Katie's is exactly what you want in a neighborhood place--skilled bartenders (excellent sa","useful":0,"cool":0},"XF1T3LtQ6S9EFQ7JYcQxaA":{"text":"Can't believe I lived in MidCity for 10+ years and had never visited Katie's till I moved ","useful":0,"cool":0},"DzVPq_6WbMiMlHt9RLGjIw":{"text":"Some of the best food you'll ever consume!! Great staff that is on top of everything!!! Ch","useful":0,"cool":0},"FeqXIKLEx8DnaJErs2zIiA":{"text":"I saw this restaurant on the Food network and decided to give it a try while on vacation. ","useful":0,"cool":0},"d7r8qqMGJeJ_lobWGRS3MQ":{"text":"Tried Katie's off my help book mark. It was pretty good. I tried the platter and the crab ","useful":1,"cool":0},"Aj8c4jq_1NCb8uvm_ZAHqw":{"text":"Let me just say if your a garlic lover. Get the garlic fries. Fried green tomatoes and any","useful":0,"cool":0},"yvs5io3fFP-Zlqzt18UY-g":{"text":"The first thing I think about when I think of this place is their feta fries. I am absolut","useful":0,"cool":0},"BWTvaKCzvwKmFR7XsC4CPw":{"text":"My wife and I have been here a couple of times over the past few months. We've never been ","useful":2,"cool":0},"zPW3QF56Yi-RIJy3zntJlg":{"text":"Back for Xavier's reunion, I'm staying on Carrollton and I googled the best place to eat n","useful":0,"cool":0},"_ODpCTRe-DbKzBYDTyPuUQ":{"text":"What a fun, but busy place.  Our daughter, who lives in NOLA, recommended this place as we","useful":0,"cool":0},"0pYdg03Qez4UamC75NE2cA":{"text":"Great place, great food, great service.\n\nYou can't go wrong with this place.\n\nOn the red s","useful":0,"cool":0},"V8Y3Ut1U8cRZ_I-Aydshmg":{"text":"Great Brunch this place will be a regular stop on our NOLA trips from now on.  The owner w","useful":0,"cool":0},"aMp5Y_DgaxySIKAHJeqtaQ":{"text":"Awesome food, drinks, and vibes! Will be back! @mitchs_meals on insta. We also got the bla","useful":0,"cool":0},"HGXC_N8ZkpFxK16Oo2dBpg":{"text":"REMMY STACK!  No more taco Tuesday babble, I'm all about that Tomato Tuesday!  Perfectly f","useful":0,"cool":0},"nG-wJQXXNOE5a9KgF1o9DA":{"text":"Dear Katie's, \nI dream of your Margarita Pizza on a weekly basic. Your fried green tomato ","useful":1,"cool":2},"ff5EdB7EJTlTZyOGbVJ0Jg":{"text":"Join the Club! - I planned to see some music nearby and Katie's was next on my list of Mid","useful":0,"cool":0},"FMFhKGEoNFzJh9MDanMWKw":{"text":"Katie's consistently provides good food and drinks. Their crab cakes are pure lump crab me","useful":0,"cool":0},"xaJJBs4lUPlTGAzT29jZVw":{"text":"I don't love Katie's....but I like it just fine. The bottomless mimosas are my favorite pa","useful":5,"cool":3},"ZyrD4GxVYNJOXLWxntKldg":{"text":"Katie's is one of my favorite spots. I've always had a good experience and have never gott","useful":0,"cool":0},"AmKKS5lxo6BHBHIkdS_R1A":{"text":"This is my second visit to Katie's . My first I ordered a shrimp poboy and chargrilled oys","useful":0,"cool":0},"Ka-_Hx_jIKV0OSYGlYMaiw":{"text":"I was really hungry and ready to devour Sunday brunch by the time we were sitting at Katie","useful":0,"cool":0},"O5fYC5NLmVDqagZsJSkCmA":{"text":"This is a really fun place for brunch. They have bottomless mimosas for $10 and a wonderfu","useful":4,"cool":0},"jhgxnRkbU24XewUPj9kfiQ":{"text":"One of my favorite restaurans in New Orleans. Crawfish Beignet and the pizza are must trie","useful":0,"cool":0},"R54HlLzILcBLQKPVE1xmPw":{"text":"Came here on a busy New Year's Eve evening and got seated immediately! I would have liked ","useful":0,"cool":0},"24OwZ8vdJRxoKxW9aQ6_FQ":{"text":"In our continuing effort to try different eateries I ran across Katie's. My wife and I dec","useful":1,"cool":0},"xB5UW3_GwJNQhIq3tzcEBQ":{"text":"Food was bad but the service was worse. Our server's name was Alexandra. We had a party la","useful":0,"cool":0},"aS_Fi1J3JeqWJWP6J_JnZw":{"text":"Great food and great ambiance! We were lucky enough to walk right up and get a table for 5","useful":0,"cool":0},"TmJrJeZRGYG10LOoDRo2xg":{"text":"A whole lot of hoopla from everyone in New Orleans about eating here. And after three trie","useful":0,"cool":0},"tAiL4F4czacDt1TjD8WFbg":{"text":"Oh Katie.  I really, really want to like you.  You're a neighborhood anchor, you've got th","useful":3,"cool":2},"APWmNdSaWPWhhUPI1OIeIQ":{"text":"Totally overrated. Crappy service and mediocre food at best. You would do much better to w","useful":0,"cool":0},"Y07RW1kpgPC_weaxwFoJEA":{"text":"I am a die-hard foodie that eats different foods for all around the country/world. The cra","useful":0,"cool":0},"Y_yuGnrxJN9CVGxp9Zs76g":{"text":"Held a group event for 23 people at this restaurant and it was one of the best decisions I","useful":0,"cool":0},"6x-SK-y_U_MeAvzlUlTwTQ":{"text":"Great happy hour on Sundays. Can get crowded fast so get their early. Love their brunch me","useful":0,"cool":0},"Mppu1fRujnTWtr9H7AVQKA":{"text":"The food is absolutely perfect; it's the experience that stinks. We showed up for Sunday b","useful":0,"cool":0},"MLz-U7Ml_R6WBCM-h7yA2g":{"text":"Food was amazing! Drinks were amazing! Staff was a little eh, but definitely recommend for","useful":0,"cool":0},"bblBRCVz_1PtjvfDUQeGgA":{"text":"I was here last week or so....we sat outside and it was nice out there for a while until t","useful":0,"cool":0},"S_se-hNPwb5dqHku0586cw":{"text":"I'm giving 5 stars for this experience, however, I don't want you to think this is THE bes","useful":0,"cool":0},"PT5_Y4qUpe9aXs5Id-0mRw":{"text":"Normally, I assume that Guy Fieri has bad taste. After all, that hair.... But Katie's is a","useful":0,"cool":0},"oaUe_2LnxPvm5lONhmitrg":{"text":"A great local restaurant not far from a a street car stop  on Canal. Nestled away in a nei","useful":1,"cool":0},"QnWq9UBZ9lmvNo6ukc6sRw":{"text":"We  loved this place. We went to it after Endymion and it was great. They had charbroiled ","useful":6,"cool":6},"7ZE23eDORaPtmP9qjvTWnQ":{"text":"They did it again.  Scott Craig and the crew at Katie's takes the neighborhood joint to a ","useful":0,"cool":0},"MU5j5Qy3IYYu79oY8wdYZQ":{"text":"Katie's is one of the best restaurants I have tried! Their crawfish beignets are the best,","useful":2,"cool":0},"9JryUD7vZ0cWxnW0SZyIbA":{"text":"Best restaurant in all of New Orleans! The service is amazing, and the food is even better","useful":0,"cool":0},"KX5h7fvR7YiXuZlpwYE5tg":{"text":"This was a great birthday treat. The food & service were excellent. When I return to NOLA ","useful":0,"cool":0},"L5mUhsmZYY6PJ8yVAKjSwQ":{"text":"Very nice hidden gem of a restaurant.  Great attitudes, clean restaurant, quick service, a","useful":0,"cool":0},"3Du1G1qE9YhSQbEtyZcaKg":{"text":"Stopped in at Katies while in NO specifically for the chargrilled oysters based on other r","useful":0,"cool":0},"a3lZ07t-G4uP4R_7laugjg":{"text":"After hearing about this place for awhile, finally went to try it out and it was worth it!","useful":1,"cool":1},"OJchperTyphag5wT59UzUA":{"text":"Excellent food! Service could be improved a bit. We felt our waiter was inattentive and di","useful":0,"cool":1},"479XZAWjcqN8Rzf09qCEAA":{"text":"A must try if you are in the area! Fantastic food and even better service! Ask for Brandon","useful":0,"cool":0},"QVX1NeKpK__K7MM_dkXxOw":{"text":"We had the boudreux pizza, hickory burger and the shrimp pasta. Everything was hot and fre","useful":0,"cool":0},"dn5Fzw2OLuqUXGTGGq9Okg":{"text":"This is a great hidden gem in Mid-city. My boyfriend and I rented a car for the day and st","useful":1,"cool":1},"Oyk8b7zJGYDaFI383P5FAw":{"text":"OH My! Stopped in after a meeting to catch the LSU game. You have to come and have their a","useful":2,"cool":0},"OWBC0IkgzDw9h1Th_T9SMw":{"text":"Food was bad but the service was worse. Our server's name was Alexandra. We had a party la","useful":1,"cool":0},"lqJnPFEuvF5_W5qbq3j_Gw":{"text":"We visited here lateish on a Monday night while in town. Food was amazing. Diverse menu an","useful":2,"cool":0},"lKoNhWGGYsu-K9tZ_JFfmg":{"text":"Security Guard Randy is part of our beloved Katie's family. His kindness and felicity are ","useful":0,"cool":0},"ZUPSqz1xH9BAHxAd0PxQAg":{"text":"I went to Katie's yesterday for lunch with a group of friends. We had a great time with gr","useful":1,"cool":0},"O6HOh2-ejdvARkdL3aQI_A":{"text":"Excellent variety and delicious food. Four different dishes ordered at our table and every","useful":0,"cool":0},"AxUFnaH0NL990rI7Z9scuQ":{"text":"Katie's restaurant is situated in a house that has quirky art on the walls and some of the","useful":0,"cool":0},"tFhD-fysmciuhM_vF6yY5w":{"text":"This place is all about the comfort food. I have come here for lunch and brunch and have t","useful":2,"cool":0},"EIU6fBAkRiZpOOHWXkCcuA":{"text":"Oh my \nCan't believe I am just now writing this because I have been here countless times. ","useful":0,"cool":0},"5VHnBRSQiuUEuPQRd1gjCg":{"text":"We try to go here for brunch every time we are in town. Their crawfish beignet is to die f","useful":0,"cool":0},"KRjx_l--ZkYfVHM8Knnxgw":{"text":"Wow the food in this place is simply amazing. The service is good too and the place is fin","useful":0,"cool":0},"yhHL5SEZoN0Boaq-ajIuSg":{"text":"This place was delish! The menu really does include New Orleans cuisine, pizza, fresh sala","useful":0,"cool":0},"EzbtCiepAWuleJdQupl5UA":{"text":"Husband had the crab cake Benedict and I had the special 'fried chicken Benedict on jalape","useful":0,"cool":0},"Fr7TrkRTYj0yc6ByFOWB7g":{"text":"We stopped in on on a trip to New Orleans because of the Triple D feature, and Wow! this l","useful":0,"cool":0},"nQVPc3pZtBcUWYAHk4NwOA":{"text":"We had just arrived in New Orleans and moved into our month long rental in Bayou St. John.","useful":0,"cool":0},"dqFcQQo9cJK1QoJM6Rhoig":{"text":"Everything was amazing! The pizza, seafood, po boys, beignets- all great! Make sure you vi","useful":0,"cool":0},"1Fa3DbV2ZSut2VrC2jYA8A":{"text":"If I could give NO stars, that's where we'd be. This restaurant is beyond poorly managed -","useful":0,"cool":0},"opEVW8LXVU94GPPKnUNkEg":{"text":"Outstanding sandwich!  DDD did not disappoint and service staff is continuously moving and","useful":0,"cool":0},"XHr4zIGUO4Z9MdeJVPlNxA":{"text":"One of my cousin's friends told us about this restaurant.  It is in a neighborhood so we i","useful":3,"cool":1},"kAn1gZw2Cr-vCoDbJzo71w":{"text":"Went here for Sunday brunch. Food was great but there was a 40 minute wait. I'm glad we wa","useful":2,"cool":2},"NkFPtI0R2CqNGb3aBwM5zA":{"text":"The crawfish beignet deserves its 5 star recognition.  It is absolutely Devine!  I'm givin","useful":0,"cool":0},"6mHGCzSExwI_rkAeqDd_7w":{"text":"An OK place to eat.   There is a reasonable variety of dishes to choose from though fried ","useful":0,"cool":0},"YgDh_tHQkQI2xENc52Ycqw":{"text":"This place has great food and a great staff. I really like their muffaletta sandwich. It's","useful":0,"cool":0},"3If6jLTYogRyXv6wT4UKrQ":{"text":"I love this restaurant and the vibe it gives off. The staff are very kind and were happy t","useful":0,"cool":0},"i4tPD025qa3Ga0YurBkm5A":{"text":"The seafood beignet was the greatest food I have ever eaten.. It's been two years since my","useful":0,"cool":0},"2OXxQmrSYNAGD1R1n6DJtw":{"text":"Nice local place with tasty eats! The only thing we didn't like was the whole garlic clove","useful":0,"cool":0},"CMp8uN-GTz8zA6--1XZsIA":{"text":"Like any true southern lady, I love grits. It's not always the first thing I order at a re","useful":4,"cool":3},"Xn8rENyfj2nBT7tC_RTlBQ":{"text":"Three stars just for the lack of engagement from the host station. There was a shoulder le","useful":1,"cool":0},"3O_lC7sx7_osuWYZJtJMqw":{"text":"The Boudreaux pizza was amazing! Never had anything like it but I absolutely loved it. Get","useful":0,"cool":0},"aBuzLsnRrA-fP8ArNl9zCw":{"text":"I've been three times since they reopened.  Food has been inconsistent.  First time was th","useful":2,"cool":0},"t8_H0bnrxRtDyH72j8Gxhg":{"text":"horrible service i wish i could give this place 0 stars my food was disgusting my deep fri","useful":0,"cool":0},"d13MZvH9Qh_KOCRHn8WWZw":{"text":"Katie's has been around a long time for a reason! Located in a more residential type area,","useful":0,"cool":0},"4J2yG2G4-8MK3DjqygC14g":{"text":"One of my favorites to go to while in Nola\nWife always orders several entree's and everyon","useful":0,"cool":0},"Pvy9HVgaTvJez048lOtTpQ":{"text":"Honest Opinion: The best thing on my plate was the cantaloupe. My husband and I decided to","useful":1,"cool":0},"RUzWk5ayffX29inwFn5RqA":{"text":"Best Shrimp and grits I ever had!!! It was on a menu hanging on the bar. Plus our server l","useful":0,"cool":0},"uMEa0_E4xhdSMkFSkha9gA":{"text":"I celebrated the 50th of a good friend here last night with 15 other compadres and we had ","useful":2,"cool":1},"rjdfUdr2lhVb6OrInEDSXg":{"text":"This was recommend by our Vrbo host and wow, I have to say, amazing!  We got into New Orel","useful":0,"cool":0},"HUtakRk7B1cSjDi2uUraIQ":{"text":"Triple D brought me here!!! \n\nCame here for a nice lunch, flavortown style (thanks Guy!)\n\n","useful":3,"cool":2},"QJYGH3oLLmyVFlByInpNAw":{"text":"Amazing food!\nWe created our own pizza - I suggest roasted garlic, crawfish, oysters and s","useful":0,"cool":0},"EVYfIdQ2IJtl2hJpX8Awww":{"text":"New Orleans never ceases to amaze me with the many varied culinary gems.  I was told about","useful":1,"cool":1},"uDkxmA48YsBLYodIotLstw":{"text":"Visiting for a bachelorette party and when calling to make a reservation for 8 people, we ","useful":0,"cool":0},"2ZZpGE-lCIFI1SBTUsPvag":{"text":"We visited for lunch and left unsatisfied.  Food was not hot.  Biscuits were hard.  Waffle","useful":2,"cool":0},"O7xhZObjtyDCVeazV97IUA":{"text":"1st visit here and it did not disappoint! Food was great. We had the Boudreaux pizza, ribs","useful":0,"cool":0},"p096kPgLQ7qRZQ6wDHpnPw":{"text":"Omg! Where do I begin??? Fried green tomatoes topped with shrimp and  remoulade sauce, cha","useful":0,"cool":0},"WMuoMwVvQ61jUYAOBZWyJQ":{"text":"Had the seafood quesadilla, it was good. Waitstaff very friendly and attentive. Good place","useful":0,"cool":0},"e2EdOMaGNMXBQv-25_5kJw":{"text":"This was my first time at Katie's and just like majority of the restaurants in New Orleans","useful":0,"cool":0},"6lcIHzrT06rNRYCMgLlOGw":{"text":"First I'd like to give praise to my stapled waiter, Murphy! He is awesome, very patient (b","useful":0,"cool":0},"Z-_aR7EPqV0cZJR2SydsdQ":{"text":"This is what I would call muchos bueno. Definitely coming back. Shrimp po-boy was on point","useful":0,"cool":0},"H7M5hZ6cZ7xm4l2ONj8_vA":{"text":"Katie's\nLunch can be hard sometimes, especially when you are on a time constraint. So I dr","useful":2,"cool":1},"yqpdkOYG3IDPw4cNvsceUg":{"text":"Although it's not named for me, I do claim Katie's. I love the small cozy feeling with an ","useful":0,"cool":0},"IfvYNC6SprtffsaD8pqlIw":{"text":"Crawfish beignets are out of this world. Seriously regretted not ordering it after trying ","useful":0,"cool":0},"wxpI3GZJLnhtEAJH_OIbeQ":{"text":"Thanks to a local who referred me and my friends to come here. Easily the best food we hav","useful":0,"cool":0},"eBzXtP4REWSbZ7Q8golRbQ":{"text":"The portions were huge, definitely enough to share. The food was good but not great. Nothi","useful":0,"cool":0},"HLbiKGWs9GHFn5O511lsuQ":{"text":"We went there twice in 3 days.  Everything on the menu was great.  Bloody Mary's spectacul","useful":0,"cool":0},"H8FJrubkY2rPGbSxSOhfaQ":{"text":"Excellent food and top notch service! Kid friendly menu. My husband had the seafood platte","useful":0,"cool":0},"3Ngg_iaW33jInPQMw_g08A":{"text":"The spot is for breakfast is as tight as it gets! The area is meant for locals but you can","useful":0,"cool":0},"mWeBYyC1jBXAr6VWmhYnQw":{"text":"So Katie's has been around for a while and it really seemed to get jump started when it wa","useful":3,"cool":3},"IWGEoyA5Akbn4m4IRuIfIw":{"text":"My husband and I visited New Orleans for the first time and we stayed in a bed and breakfa","useful":0,"cool":1},"PWL4SWzlZBwWUFtl2akB9w":{"text":"Went here for lunch because my friend saw it in DDD & am a geek for anything Guy F. I was ","useful":3,"cool":2},"XChHEc1rHABgINr9zLkAww":{"text":"I'd been hearing about Katie's for the longest and finally got the opportunity to try it. ","useful":0,"cool":0},"1CMCGq-xRGQzUZKSLjDIJQ":{"text":"Everything is AMAZING!  My only complaint is they don't have small lunch portions...I want","useful":0,"cool":0},"e5mDpK74gAOCDDLFa655_g":{"text":"O M G\n2 words: charbroiled oysters -- no words to describe, well, actually: smokey, lightl","useful":3,"cool":0},"DtFU24h0yI018do9rrVrOA":{"text":"Really loved this restaurant. Very good food. My favorite was the roast beef poboy and cra","useful":0,"cool":0},"px5Vup-jtgnUYcZscx6j2g":{"text":"Came here at about 1pm on Sunday and our party of 6 was seated in 5 minutes..score! We ord","useful":1,"cool":0},"WzB2Z4kLnSDNOoSHJZPzNQ":{"text":"Cute little restaurant. Must order the crawfish beignet like so many other reviewers have ","useful":0,"cool":0},"W8_shqFHaBrxrzYdVrMhZw":{"text":"This has become one of my fave brunch places in the city! I always recommend it to my frie","useful":0,"cool":0},"BbGrIuE1MdpsDVfOwgcViw":{"text":"Katie's brunch is the best. You aren't living if you haven't had their chargrilled oysters","useful":0,"cool":0},"7-ettrHmr7D4QypqrZecPg":{"text":"As an avid lover of all things brunch I would say this place has neither been the best nor","useful":0,"cool":1},"x4YRcs6RmSn0NcwLdK8XLw":{"text":"It is such a cute place! The food is great. The staff is so nice and welcoming. We usually","useful":0,"cool":0},"fxq2b9ZGJxMVupKvgyH4SA":{"text":"Really good family-style New Orleans restaurant.  Diverse menu allows options for eating l","useful":0,"cool":0},"_2QIsqOJI7fMtslPcNfQdQ":{"text":"Katie's is the perfect quaint neighborhood cafe for a Sunday brunch. Located on the corner","useful":0,"cool":0},"o8nmRiLbgMXZ7EgCZ2zAVA":{"text":"Best meal I had I New Orleans! Pork shank over greens was unbelievably good. A neighborhoo","useful":0,"cool":0},"PAvWYGo-_8UKBEEFsOCNuQ":{"text":"Sunday hang out with good brunch options grab a seat at the bar for bottomless mimosas if ","useful":0,"cool":1},"vuGlzD7vq7vwZlgO9VNBjQ":{"text":"I cannot complain about one thing I ate. Everything was great. The drinks were potent (in ","useful":0,"cool":0},"bKhGomIPOXdIB8ku0w6X7g":{"text":"My sister brought me to Katie's\nFor my last meal in NOLA. \nI was craving something local. ","useful":1,"cool":2},"WQx-vi6p-yINDp3pV37Yag":{"text":"So I went to Katie's for the first time yesterday with 2 of my sisters. We had a good expe","useful":0,"cool":0},"HdD__splE3Dpxnt6Ap6aGQ":{"text":"Fabulous spot for brunch - scrumptious food and bottomless mimosas, bloody Mary's or sangr","useful":1,"cool":0},"StVRGQ1bMQmJD5u8kCNBsg":{"text":"What gem of a find. Outstanding food. Was packed but they still fit us in at the bar. The ","useful":0,"cool":0},"ueH8nfY_wwVG4ZNz7E08kQ":{"text":"The first time I was brought to this place I was a little skeptical but,I was pleasantly s","useful":0,"cool":0},"XIbyN23QotnD4UoN3IZ_dg":{"text":"I lovvveeeeee Katie's!! The staff is amazing, especially Billy (our bartender). We dined t","useful":0,"cool":0},"pFYwE4jik46fhNY6fqY57w":{"text":"Stopped here for a late lunch around 2:30 pm on a Saturday, with our group of 7, ages 2-61","useful":0,"cool":0},"vVajOL8C-4aacdZ6NZC4Xw":{"text":"Good food, great atmosphere.  Katie's is one of the restaurants I bring relatives from out","useful":0,"cool":0},"jApcEVK_H5iX0vwFlmmlJQ":{"text":"What a great place!! Our new favorite restaurant in New Orleans. Everything we ordered fro","useful":0,"cool":0},"L9akQoDJafVfwCdn_go1sA":{"text":"Katie's was recommended to us by our uber driver from the airport. Boy was that a great re","useful":0,"cool":0},"abh75oEQpiLRZV300rLkiQ":{"text":"Katie's delivered as usual, it's a great spot for locals and tourists! I tried frose for t","useful":0,"cool":0},"mDaeNvADDdHZ4MTdCLXWQQ":{"text":"I've been to Katie's twice now and only wish I could eat here everyday. \n\nThe first time, ","useful":1,"cool":0},"DkZOlwLLkpgBFezakP5Piw":{"text":"Okay so this is a neighborhood restaurant that's pretty small and always crowded. I haven'","useful":0,"cool":1},"UXfWGnneVTRf4ncj9YjpEQ":{"text":"I almost can't even believe that I haven't been to this legendary New Orleans lunch place ","useful":12,"cool":6},"pK7TFxtxDYpETcsWJDAgsQ":{"text":"The food is absolutely amazing here!! I got the catfish po-boy and absolutely LOVE IT.","useful":0,"cool":0},"H4boakZG24sv2vLOMKBCwQ":{"text":"I almost don't want to right a good review so fewer people go there... it can be a bit cro","useful":0,"cool":0},"KaHgkgulw0_l2neEUc3CdA":{"text":"I finally made it to Katie's!! I've been to NOLA several times now and never made it for o","useful":0,"cool":0},"nzXky7b1kVdbbFtgfmWpDQ":{"text":"The best meal we had during our last visit to NO was at Katie's.  I waited a few weeks to ","useful":0,"cool":0},"gvG6k8jidYxdfCHaUfUcNA":{"text":"First time here, read reviews and came for sunday brunch on our first anniversary. Great s","useful":0,"cool":0},"sTrw97BTw74X4cIBaPkj7Q":{"text":"Great atmosphere and great food!  I also love that they have all of the tabasco varieties ","useful":0,"cool":0},"kSbLXw1tXFf2dFtAt8K-hA":{"text":"This was one of the first restaurants we went to when we moved to New Orleans and we have ","useful":0,"cool":0},"oTsE9VBZjmTTiHPXgw3p3A":{"text":"This is our default favorite place to eat in Mid-City, no kidding I've never had bad food ","useful":42,"cool":34},"LsBYc1Clj4kaNm8VOr23Pw":{"text":"Katie's Restaurant in Mid City. Was trying to go get our Po'boy on at Parkway but the line","useful":0,"cool":0},"RB_eKRI6JTGRb7jPMIfQ5A":{"text":"Katie's is a solid choice for lunch when you have a bunch of people with various needs. Pi","useful":8,"cool":10},"2yhDYI1bggQ7_PYhd_kmnw":{"text":"I looove this place! Food is always spot on. I go for the brunch and sazerac, which never ","useful":0,"cool":0},"Pu4Q-midw7JlqR0zweVr5Q":{"text":"Had the pagoni, seafood beignet, gumbo, and funky Fontana. Seafood beignet was awesome. So","useful":1,"cool":1},"3TnZY_KU3bxqki6VFOWvoA":{"text":"It's on my list of recommendations! The chargrilled oysters are some of the best in the ci","useful":2,"cool":1},"C_jmYb1izEG2htLRHod8cg":{"text":"Visited Katie's recently and thorough enjoyed the gumbo. HOWEVER, my salad with JUMBO shri","useful":0,"cool":0},"RIBiJl6wfVTiJ1mHDxDTmg":{"text":"If the stockpile of Katie's cups I have in my cupboard aren't convincing enough of how muc","useful":0,"cool":0},"qSsbdVmCaD9w1GlI2NL_IA":{"text":"Yes, lawd.\n\nIt's just that good. I was recently in New Orleans for work and asked a native","useful":5,"cool":4},"Kw18gIB0cFylwCsZ-dOcPQ":{"text":"I went for Coolinary today and the food and service were awesome! The manager was even acc","useful":0,"cool":0},"UZsXhk6oR-Esc6pWWMn8JA":{"text":"For such a popular mid city spot I didn't think the space would be soo cramped? I almost f","useful":0,"cool":0},"edYvlXzEEWSEOoxQONJW-A":{"text":"Neighborhood restaurant, I have tried several items on the menu- and have never been disap","useful":0,"cool":0},"X3-O8Awj9T1z_tE0wULD6A":{"text":"The best Cajun Cuban ever! Crispy flaky gooey & delicious! About a 30 min wait but well wo","useful":0,"cool":0},"G-vwvvdzFhwZpqVJD5p_XQ":{"text":"By pass everything in the French Quarter and come straight to Katie's. Everything that we ","useful":0,"cool":0},"vvZXIx_mBLHWpu9kK0fdPw":{"text":"Unexpectedly impressed. Where do I start.  This neighborhood establishment seemed to be yo","useful":0,"cool":0},"Lr1f7r-IxR_6OOD4RbMfjg":{"text":"Favorite place in New Orleans!!!! First stop every time I'm in town! The pizzas are amazin","useful":0,"cool":0},"zN2BeYyiJpXy5cemMY5ccg":{"text":"Small place. Homey feel. Crawfish beignet was fantastic as were the oysters. Definitely ge","useful":1,"cool":0},"O7N_VqICwoCh-0Hs1M6W3Q":{"text":"I was a bit skeptical at first, but the place had great reviews. After seeing the line out","useful":1,"cool":0},"NXeyyU461OijpuOPwMfMBA":{"text":"Katie's never disappoints!! I found them on Diners, Drive ins, and Dives, and went there f","useful":1,"cool":1},"aeCYCrXLjDsfDMdzeJ2zCg":{"text":"A great local restaurant not far from a a street car stop  on Canal. Nestled away in a nei","useful":1,"cool":0},"axG1hzJ58RdXR1wGBVF82g":{"text":"This place is a great New Orleans neighborhood find. It has a welcoming vibe, with its fun","useful":3,"cool":2},"HobLBcaxqUq6GkgOKCTbLg":{"text":"Oysters were great.. Service was excellent..  Cool place.. Simply stated - wonderful food.","useful":0,"cool":0},"gUpF4H3nqG2--ZjcotFlHw":{"text":"A local treasure. Have been here a few times and never disappointed. I first came to tackl","useful":2,"cool":0},"NZiv6CLbcqkGItHWrg8vHA":{"text":"This restaurant had been on our bucket list for some time. All of us were disappointed. Th","useful":0,"cool":0},"Mwt7soD4iROqABU0WA2w-w":{"text":"KATIE'S IS BACK!\n\nPre-Katrina I used to eat at Katie's multiple times a week and I have mi","useful":3,"cool":3},"9-LAAU5W3TuCueBFvlDRnQ":{"text":"This is the place I bring all my friends and family to. The BEST oysters. Yeap I said it h","useful":0,"cool":0},"5nKZq6BKQ1Tu0f5WGm-udg":{"text":"Simply amazing!!! Loooooooove this place!! Second time here from NYC.. \nThe wait is decent","useful":1,"cool":1},"pntM8wVDviVPRelzMWEtMA":{"text":"I came to this lovely brunch spot after church. It was quite packed when we first arrived.","useful":1,"cool":0},"tn-sIYsKElKdfP3CW2qyCg":{"text":"Originally we were suppose to go to Dragos but they were closed due to covid I'm assuming.","useful":1,"cool":2},"CeXoSWiFP9bitXkWz8tW8g":{"text":"We dined outside. The service was amazing. The seafood was delicious. The char grill oyste","useful":0,"cool":0},"LYMXKlyFPdGwrSxJoND58A":{"text":"Katie's has excellent staff and I have consistently enjoyed the food each time. Great job ","useful":0,"cool":0},"f9x_hzmfU-HnrmpaaFKjXg":{"text":"Outdoor seating was phenomenal, wait staff were always wearing proper masks, and patrons w","useful":1,"cool":0},"bQKtfOR7C6VDqempnWElMg":{"text":"Quick service and wonderful atmosphere. It's a bit loud so if you want an intimate dinner ","useful":0,"cool":0},"6NDbZ5TJZUE1DeXI7xe_mQ":{"text":"From the food to the service, katies was a homey place to grab some comfort food. The craw","useful":0,"cool":0},"v8oabFUaEPSSMNK9MqPVrQ":{"text":"Katie's never disappoints! I could eat their house salad and house dressing as my whole me","useful":1,"cool":2},"B8IYSU6cklJpSOrwQL38HQ":{"text":"Katie's does so many things right. That patio. That neighborhood. Those plethora of hot sa","useful":12,"cool":6},"WFuu7zZ461VBAAh3eX5FVQ":{"text":"The food is so fresh. Great environment, they have a huge selection to choose from! Defini","useful":0,"cool":0},"QmifjuvSgjd-zDxtS0ELfA":{"text":"Sooooooo good! That's all you need. Came here at the last minute and it didn't disappoint.","useful":0,"cool":0},"ZgHhHVmDdcQe78tMpRaJOQ":{"text":"Some of the best food I have ever had! Great gumbo and had food on menu recommended from f","useful":0,"cool":1},"R0AX5g7bkU9bb-qNiLm1Cg":{"text":"Great local restaurant. It says a lot that in the time we were there more than a dozen peo","useful":0,"cool":0},"6vhqlptYS7qfKUAFCCyA_g":{"text":"Best food in New Orleans. A must visit anytime you're there and well worth the trek outsid","useful":0,"cool":0},"9uMYdUFiA5gaxcGDUy0hgA":{"text":"oh katie's, how do i love your $10 pizzas on thursday nights! it is the best thing to happ","useful":2,"cool":1},"l1KtP26ec68CkJlbNmd4XA":{"text":"Ashley our server was amazing! She took care of our table of four with no problem. The foo","useful":0,"cool":0},"wBapCkUf7ox0TCfg5V7qHg":{"text":"You will never leave hungry from this place. Ever. \n\nMy significant other had a full muffa","useful":0,"cool":0},"vT0tURc39zSQ-hgroR3ysQ":{"text":"This restaurant is usually my go to for a fun and delicious brunch but you better get ther","useful":0,"cool":0},"hMm84Te7j7_lGHDdGX-t2w":{"text":"Great food, great service! The feta fries were amazing.  We ate at other restaurants downt","useful":0,"cool":0},"JjpU9Uc-TRokZxER6CPq8w":{"text":"This. Was. Awful. \n\nI ordered a mushroom Swiss hamburger with a side of mashed potatoes. P","useful":0,"cool":0},"j1seDy1OScogujA0d32kvw":{"text":"Saw this place on Triple D and it looked awesome. Some hometown cooking NOLA style. Finall","useful":0,"cool":0},"2uD8Jq1-51yas9JQHsDyzg":{"text":"I live in MidCity and have been to Katie's many many times. I can honestly say I've never ","useful":0,"cool":0},"dV5N_5pMhHsJy1wP7Yo1OQ":{"text":"What can I say? The food here is amazing! The garlic fries were addicting and the yardbird","useful":2,"cool":2},"cce0nMcscRFgvTnlr5FZ6g":{"text":"Great food and the service was excellent. Not a long wait at all. We hosted here on the la","useful":0,"cool":0},"5WD8GVbAKWHTIlW9EtUd8w":{"text":"I did our usual Wednesday night at Katie's tonight and I was really torn between indulging","useful":5,"cool":2},"MdVFKIRj1ZEPUAzBI797hA":{"text":"Best food I've had in New Orleans! Brenden was our server, he was amazing! He was so nice ","useful":0,"cool":0},"zf40bn9Gw9bWzH76ADUsxA":{"text":"Very good food and A1 Customer Service. Only issue I have is the space to move around and ","useful":0,"cool":1},"0xZ874CU59zQYmqQhXU_vA":{"text":"Officially dropped off my keto diet as of this meal for vacation. It was worth it.\n\nWe arr","useful":14,"cool":13},"34_GILV3ZdhdMyLPA3ZE2w":{"text":"This place is a NOLA gem.  I'm so happy Katie's is close to home.  Everything I have gotte","useful":0,"cool":0},"YV3yM4ZBdUFpQfA9rmOOtQ":{"text":"Had Katie's recommended to us by locals and of course have seen the episode on DDD so deci","useful":0,"cool":0},"-I36RiCyBxgYOfopzHlUcQ":{"text":"\"BBQ\" Shrimp & Grits are the most bland overcooked unflavorful meal I've ever had. Far fro","useful":1,"cool":0},"EzDsJKUxpIKRgqeIvO0RHQ":{"text":"Not a day goes by that I don't crave their grilled oysters. I never thought I'd say this b","useful":1,"cool":1},"8INmBrExpB4qcYryiifv4w":{"text":"Loved this place! My boyfriend and I stumbled on this great neighborhood restaurant after ","useful":1,"cool":0},"OgHq1FkwJRXeOA3r7nx1-Q":{"text":"Katie's is obviously an institution, with plenty of reputation locally and lots of picture","useful":1,"cool":0},"Cps9slBuYdUumL_SpA_AVQ":{"text":"It was good but you can tell it is made ingredients from a bag/jar. Also for a New Orleans","useful":0,"cool":0},"CNNlFrlnSPkWNMF8toIwCg":{"text":"We had an absolutely phenomenal meal at Katie's last night. We were in NewOrleans for the ","useful":4,"cool":4},"_IfGA4rlRbgZMuHRoBD_2g":{"text":"Love me some Katie's! Their food is delicious, tasty and fresh, their cocktail menu is als","useful":3,"cool":2},"xn7iG0dNJ5uFCnzQsXl0Og":{"text":"I loved this place upon my 1st visit and I've actually never been inside the restaurant.  ","useful":1,"cool":2},"YFibGnQImCbdvP-f4mMPpg":{"text":"I've been to Katie's a handful of times and I've never been disappointed. I've met the own","useful":0,"cool":0},"azpmXI8kHpmXUMNfnEojxA":{"text":"Food was amazing! We went for brunch on a Sunday and usually I would not get cooked oyster","useful":0,"cool":0},"FkNjTepeGmjdA7KrKPSxuA":{"text":"we chose new orleans for our honeymoon solely so we could come to katies. we had such a me","useful":3,"cool":0},"KYP57TM0yEo9B-YUWRUzEA":{"text":"Great restaurant loved the atmosphere and had great service. Came for Sunday brunch today.","useful":0,"cool":0},"AYWKKmXZWadi0mbb5dmx3Q":{"text":"This is my second time having Katie's for dinner and it was good both times. I've eaten he","useful":0,"cool":0},"jjXQgU_0kR8sOrbE5qc7qw":{"text":"Excellent restaurant in mid-city New Orleans! The blackened redfish was the special with l","useful":0,"cool":0},"MCgFbCkXYB6StGHRsdUg2g":{"text":"I've eaten brunch at Katie's twice and I'm not overly impressed.  However, it's a cool spo","useful":3,"cool":0},"6VzHgFXwxrh7pDYCriEVlw":{"text":"Ordered the shrimp po boy. Love the shrimp but the bread was a bit too dry for me and the ","useful":0,"cool":0},"3YvXs8nMVo3mnA1hnQyIBQ":{"text":"Recently was in NOLA and returned to Katie's.  Once again, the best shrimp poboy sandwich.","useful":0,"cool":0},"EyuevFINTkwyTJoceFII2w":{"text":"I was reading about the history of this place and the devastation after Hurricane Katrina.","useful":1,"cool":1},"f3oJZBC-dKOq7cbGk6Q2RQ":{"text":"I got to meet and hangout with my Yelp friend Shannon S. for an awesome brunch at this del","useful":48,"cool":58},"xYnc4VKccUuP1Hwaizym7A":{"text":"Katie's is a cute place; it's in a nice neighborhood, has an interesting history, and a so","useful":1,"cool":0},"9f_iPxiU3uVSFGvCRRHoqg":{"text":"the best gumbo ever!!!!! we were on vacation to nola for a week and ate here twice because","useful":0,"cool":0},"FsAPFJy4XjnXNFDfR8PFhQ":{"text":"The Bottomless Mimosas are to die for. They are not skimpy on the champagne. Food is DELIC","useful":0,"cool":0},"lYN4vbCDpRBUhXkFx6YCUQ":{"text":"Katie's is always a great place to go for lunch or their Sunday brunch! The \"Phase 1\" Sund","useful":0,"cool":0},"Yblt4x9o3CkZ8jyjtLyHog":{"text":"This was my family's first trip to the big easy and our only goal was to eat as much as we","useful":0,"cool":0},"3c9f2dWWC1bfmWz0-bziMw":{"text":"Can't give them anything less than a 5 star...everything exceeded expectations. High recom","useful":0,"cool":0},"2T4PtUQ-88szVnwNZBc_cQ":{"text":"It's been almost a year since we've eaten at Katie's. I still haven't gotten the place off","useful":0,"cool":0},"LCd5XII6Q1R2PMphPFztmQ":{"text":"I've become an avid Katie's bruncher. The Crawfish Beignets are absolutely to die for as w","useful":1,"cool":0},"gdhnnyoj-vhnxukmGTivag":{"text":"This is one of my fav spots in New Orleans... gotta try it you wont regret it! The food is","useful":0,"cool":0},"3emWEzI0GDf49X7D_tONGw":{"text":"This is a cool corner spot in an area populated with restaurants and bars. Some friends an","useful":4,"cool":1},"eX9Jimk3LD5XRMwzNKWqgw":{"text":"Another 5 star review! I know there are a gazillion places to eat in NOLA , but we always ","useful":0,"cool":0},"8AOm2c6JGZoFMHiGNM42GA":{"text":"The Teranova Pizza was delicious. We will go back just for that pizza. We sat outside, but","useful":0,"cool":0},"-7LxiknMlW4jmNdXt1-NSw":{"text":"First time here and it won't be the last! Service is off the chart good. The crawfish beig","useful":0,"cool":0},"aGWtNhuWNV4aBVnJVSuUUA":{"text":"Perfect spot to go eat brunch before a saints game. Everyone was wearing black and gold an","useful":0,"cool":0},"MG1ME2D4u09ePQPN3tbcng":{"text":"Absolutely delicious! Although it is very loud in this place, everything on the menu is ab","useful":0,"cool":0},"Cs-YQIlDlADrTpdpg0rmQg":{"text":"LOVE LOVE their food. \nMy favorite dish was the grilled Oyster dish!! \nseafood pasta was m","useful":0,"cool":0},"53keuf64vIGjBoaiAwupxA":{"text":"Picked Katie because of diners, Drive-in & Dives. \nThe waitress was super nice and the pla","useful":0,"cool":0},"3aIxtpB39h0nZgSqo8VYaA":{"text":"Katie's is good when you're looking for a creole family style place. We have been for brun","useful":1,"cool":1},"jSRahUxQF8eXK2LzF8pwLQ":{"text":"So, Katie's does it again. This is one of my favorite brunch spots, but I recently saw tha","useful":0,"cool":0},"RPKlKdADg72s15qMUVYiaw":{"text":"Stopped in for lunch and had the Crawfish Beignet to start, which was fantastic. Inside wa","useful":0,"cool":0},"JR5JKA9Hdwri_79BvT0xWA":{"text":"A great place for drinks and lunch. My favorite dish is the build your own pasta. I have n","useful":0,"cool":0},"V7a4QCQBltEQhQFw3nbwhg":{"text":"Definitely glad we took our Uber driver, Stephen, who recommended Katie's. The food was fr","useful":0,"cool":0},"xKEtgeZbJ428qR_Y681T7g":{"text":"Sadly, I would not recommend to eat here. Personally my food was very good however, the re","useful":1,"cool":0},"1SpkuyRc-drGECruW5xHww":{"text":"Charbroiled oysters were absolutely fire! Great place for  brunch! The lady loved the Froz","useful":0,"cool":0},"z1KRJo4eUx8B7hNWZ7pcoQ":{"text":"Nice and fun! I love Katie's we all stopped by one day after eating somewhere to catch a l","useful":0,"cool":1},"lM2FFc4xYe_eTfFRqLrgsA":{"text":"I was meeting friends and they decided to meet at Katie's.  I have been to Katie's before ","useful":0,"cool":0},"UkmKBUNkPP5ds72JbRyoVQ":{"text":"Katie's is a wonderful place to go for brunch. Devin and Billy were two of the best barten","useful":0,"cool":0},"HT-p54XD2Vj21-ckjmfNHw":{"text":"Of course we did our annual visit.  Taylor was there. (Loved that!) The food is terrific. ","useful":0,"cool":0},"rcjtEJVF3O81Tr-W4Y161w":{"text":"I know that Katie's has been reviewed a thousand times, but I have to do mine today. We've","useful":3,"cool":4},"mOOmDQEKnjUgpHe93OVXIA":{"text":"I really enjoyed dining in at Katie's! The service was great, we were seated right away. O","useful":0,"cool":0},"KRQaMC_wKRCx4fJtF4hVYw":{"text":"Absolutely excellent old school New Orleans eatery. Something on the menu for everyone, al","useful":0,"cool":0},"XO8Zroh5KRk5ysym8fv6ag":{"text":"While vacationing and visiting family in the New Orleans area, we were given this recommen","useful":0,"cool":0},"lrkLjqF9a2aIeth2KyngLA":{"text":"3 stars is probably a little harsh but I think 4 star would be too generous. The food was ","useful":1,"cool":0},"7UBEu8--2X-PMj5q4DSksQ":{"text":"I never knew about Katie's until my then-significant other told me that it was a total hid","useful":2,"cool":2},"UnILUcUFoS1ocM4AWFiNZQ":{"text":"Last week we went to Katie's for lunch on my sweetie's birthday. We were greeted at the do","useful":8,"cool":4},"ViHLExJU0t3GImHZM8aaBA":{"text":"My husband and I have been eating at the finest restaurants while visiting NOLA.  Last nig","useful":1,"cool":0},"TiPbBGumq5PjC16M6_g4Bw":{"text":"Don't ever sit next to Whitney. Katie's like to treat people who are not regulars like shi","useful":0,"cool":0},"VyL5BKSuMNU3yilwa2onag":{"text":"Cute little restaurant off the main strip. The food was really good and the service was ab","useful":0,"cool":0},"zKRDsoIEyW1FQA0THX785Q":{"text":"I'm surprised I have never reviewed Katie's. I have been here 5 or 6 times in the last sev","useful":1,"cool":0},"yOxkJ4DLLubVB-zw9u6j8Q":{"text":"I saw this place on Diners, Drive-ins and Dives as well as read some reviews about it onli","useful":0,"cool":0},"Ij3hO27H7UwMDJFXFlgLmg":{"text":"The food has been delicious both times I've been here; drinks are pretty great as well. Un","useful":0,"cool":0},"4Yt7o-Qd2exz_gxQvHLaow":{"text":"Went here for a brunch on Sunday for a colleague's birthday and it was a little underwhelm","useful":2,"cool":0},"1e076h0irVXxqZWzYRT_YA":{"text":"Busy spot but didn't take long to seat us. The seafood platter is definitely a 2-4 person ","useful":0,"cool":0},"E2tQ_dO4SJ3rXLjch62oEA":{"text":"I always love Katie's! I have never been disappointed. I went for lunch today with my mom ","useful":2,"cool":0},"YG9byJ4NUb536uaqW8FyCA":{"text":"The flavors were amazing and the portions were plentiful. I was a bit taken aback by the f","useful":0,"cool":0},"wPrPhGxQwjY62tfBumLirg":{"text":"The best word I can come up with about their food is fine. Will not go again, but that's b","useful":0,"cool":0},"KEN4yEASSGkJtfQbW4_6AA":{"text":"Chicken Parmesan!! Very tasty, I normally order this dish along with the Crawfish Beignet!","useful":0,"cool":0},"6etP2o9kuLEm3q6j4NnR7A":{"text":"Always great food. We always get the gumbo it's a no fail here, so full of flavor. We got ","useful":0,"cool":0},"Jr5MiFB6rWJt-tzoQ_kdpA":{"text":"little restaurant in a small neighbor hood. easy to miss. \nCame into town to visit family,","useful":1,"cool":1},"6k5UQOoDYvy2WZFzZi4QQw":{"text":"Always the best food! Consistently good and friendly service! It's where I always take peo","useful":0,"cool":0},"_YehCKScxbSUhLo-aeWoSQ":{"text":"First time we tried oysters and they were delicious. We came since we saw it on triple D a","useful":0,"cool":0},"yElJdLqcGQPQR2OToP1TeA":{"text":"First time that I had a yucky meal here.\nThe \"Legend \" was disappointing to say the least.","useful":0,"cool":0},"m3l9gDDBY0al1hFGLyxvwA":{"text":"I had read about this place before coming to New Orleans on vacation.\nI had hoped it would","useful":0,"cool":0},"j_ES3FTZdMxwUNsAp8EDYw":{"text":"My two sisters told me about this place because it was featured on Diners, Drive-Ins & Div","useful":2,"cool":2},"WLr2aTazbi_TXyoSKVxamg":{"text":"Came for the Po'Boys as everyone said they were the best. I split the shrimp and roast bee","useful":0,"cool":0},"DZH_RpM2WeMQhj6HVFFHyg":{"text":"We came here for a birthday brunch and were very disappointed to find that they don't do b","useful":1,"cool":0},"1WH9wZpWeDFrLX1pORNsVg":{"text":"It's always so easy to order from Katie's and usually you know that you're going to get a ","useful":1,"cool":0},"31GdjI73P_bNOBUNh-GDcg":{"text":"Amazing food!  The oysters, crawfish beignet, burger, chicken parm, muffuletta, ribs, pota","useful":0,"cool":0},"zX-p_SpiAqy_0lfDxwpTMQ":{"text":"We use to love Katie's. The menu was well balanced for everyone. Now, there is literally n","useful":0,"cool":0},"7Il3aLB62bvL7bAcQFuJDQ":{"text":"Katie's was a great place to get po boys and French fries. The Greek feta fries were excel","useful":0,"cool":0},"6L4TwyC413dTOIDiWoRP2g":{"text":"One of the best Sunday Brunch spots in town. With an extensive menu and bar selections its","useful":2,"cool":0},"PFLro4HLuRpavr_lnje6Qg":{"text":"Great atmosphere and delicious food. The restaurant was crowded, but we were seated and se","useful":0,"cool":0},"s-2G608EiKvXPhUvChMKxg":{"text":"Are you kidding me??  This place is the bomb!!  Devon is the best. And the bartenders are ","useful":0,"cool":0},"m6RSEBqanY9r7FQNaRIdCw":{"text":"Amazing food, featured Diners Drive-ins and a. The crawfish beignet was amazing. If you mi","useful":0,"cool":0},"eFqgY2JLSedaEKcIGn7wKw":{"text":"We ate here with our soccer team, 35 people. I called ahead and Katherine was able to secu","useful":0,"cool":0},"Z1NtPLdfxiK7yqqr7Jy6ug":{"text":"Atmosphere is always nice here. We sat outside tonight. The chargrilled oysters were on po","useful":0,"cool":1},"Hs1hzwvlJkWsJZfyAJP4YA":{"text":"My first time trying oysters in general and was awed in them! I and my friends tried a lit","useful":0,"cool":0},"5aRlKgYxlIoWo00m2Nnfcg":{"text":"Take fresh seafood and slap it on a beignet, a local delicacy, and you have yourself somet","useful":0,"cool":0},"UmY5wpdMX62B9NCAZpW3bQ":{"text":"My favorite restaurant in Mid-City by far! I've been going here for years and the food nev","useful":0,"cool":0},"dNenJnA2ksq3JBSaLHdHiA":{"text":"Came for Sunday brunch last week to Katie's. Lots of tips I want to share...\n\n1) people ar","useful":1,"cool":0},"-z_Ygk3LNHJraRxr78xzuA":{"text":"Best brunch I may have ever been to....\n\nSat at the bar. I highly recommend! Billy and Dev","useful":2,"cool":3},"efNzpYQdeHDdQeVoLWpeRw":{"text":"It's not often I get my hands on fried oysters. Why? Because it's risky, for one they're n","useful":0,"cool":0},"e7x6yHdUMcJ-tecFX1YrDg":{"text":"The food and service at Katie's was fantastic! Their chargrilled oysters were amazing and ","useful":0,"cool":0},"xnr0UAjZJVUsIkF0CBwhcA":{"text":"Dinner was amazing.  My family had the pizza and I had the amazing shrimp po boy. Our wait","useful":0,"cool":0},"E7znejh1950hKaJdLIqHJw":{"text":"One of my NOLA local favorites and my go to spot when people come to visit. \nThe food is a","useful":1,"cool":0},"HYiaGSHjHcSG1vkalht8Rw":{"text":"I come to New Orleans once a year and try multiple restaurants with my wife. This place is","useful":0,"cool":0},"POiUzeS4vlKbJcX-CO243w":{"text":"Always a pleasant experience. There is usually a wait for a table and they do not rush you","useful":0,"cool":0},"3F9ozBXu6_mp1vNgRmbWEQ":{"text":"Katie's is always a NOLA fav from the drinks to the pizza!  I popped in today for some lun","useful":0,"cool":0},"1esksEKlAl5bidRn5TNdyw":{"text":"Katie's is a home run for New Orleans style food with an extensive menu. My friends that I","useful":0,"cool":0},"-BnuE0JWaujKc4mXfeE3ug":{"text":"Our Uber driver highly recommended Katie's so we trusted him and are so glad we did!  Amaz","useful":0,"cool":0},"RLhdetVpMVsWONPvNkVA5w":{"text":"An nice place for Sunday brunch. We usually sit at the bar. Staff was very friendly. The o","useful":0,"cool":0},"URApnNVZbWVs2RtTTVF5bg":{"text":"Great breakfast place it is a greatest diners drive-ins and dives TV show location with Gu","useful":0,"cool":0},"ynY9yqWDhUtDe2vAWVtCgg":{"text":"The best handmade pizza in the business. I recommend the Boudreaux, made with pork, garlic","useful":0,"cool":0},"EBmTGEefTfxszWjH2ht-_A":{"text":"Overall, this restaurant was great. It embodies New Orleans in it's location and decor. Th","useful":0,"cool":0},"WI2cpA5VSEgGE5Pl9FBasg":{"text":"We saw the review of the restaurant on DDD a while back and my husband insisted on trying ","useful":0,"cool":0},"rTi-FIKcrhqyifoczHByhg":{"text":"Attention tourists. Avoid Katie's. You won't like it. \n\nOk. My opening will probably not c","useful":15,"cool":10},"KLmDvixil7MOhevjjqp8Bw":{"text":"I eat at Katie's at least monthly for over the last 3 years and yesterday was my first BAD","useful":0,"cool":0},"S7_Pl6kKkuNxcxHeUhXWjA":{"text":"My husband and son stayed at the Canal St. Inn and the lady there recommended this restaur","useful":1,"cool":1},"f7YXUguUx27uganr6lMutw":{"text":"This place is ok, but pricey. \n\nI've eaten here a few times and I've only been blown away ","useful":4,"cool":0},"IptEe2pLmaGQrHqJzIck0A":{"text":"Nice find in the mid-city neighborhood. Has indoor/outdoor seating. Nice vibe.\n\nThe server","useful":0,"cool":0},"d0xCSbTu7gZVnqE6FHXRjw":{"text":"Katie's was amazing. We took the red line from Bourbon street. We had the char grilled oys","useful":0,"cool":0},"xzpMwL1K94decILieoxK8w":{"text":"I have been to Katie's 4 times. In big groups, small groups, and just two of us. It never ","useful":1,"cool":0},"B9_v401UgNWCuIItlgcbzw":{"text":"So many restaurant choices in NOLA!  We ended up at Katies's after seeing them on DDD. \n\nS","useful":1,"cool":0},"7avCEq2OtpIxatmGwSreRQ":{"text":"Love their grilled oysters, wedge salads, pizza, shrimp poboys and their specials.  I've n","useful":0,"cool":0},"nbzmDcs7eazNH20tXsV2DA":{"text":"HOSTESS WITH THE MOSTESS: graciously sincere welcome earns the 5th star.\nVOTED GAMBIT'S #1","useful":7,"cool":2},"06JUmK9nGmFE2XkdtxkvzQ":{"text":"Great for brunch! (Bottomless mimosas)\n\nGet here around 11 to avoid the wait. Get here any","useful":1,"cool":2},"sszdarHpsCVQEAbyaCxqIA":{"text":"Great food and service!  We stopped in for dinner on Thursday and got seated right away.  ","useful":0,"cool":0},"4YABxZChHc80SFWwFKJzzA":{"text":"Oysters!  You wouldn't believe the trouble my wife and I went through to get to this place","useful":1,"cool":3},"BIQQveQoY8P5T6E8VxxhMQ":{"text":"OMG this place is so worth the trip never past this place up if given the chance!! We will","useful":0,"cool":0},"fsexF6_QQJp7YSMzHKYFcg":{"text":"Sunday brunch is one of my favourite things to do so I enjoy discovering new spots. With a","useful":1,"cool":1},"CtWM57ds0PfWoM4OGHON4w":{"text":"Scott Craig runs one of New Orleans best true local places to get a fabulous meal. His men","useful":0,"cool":0},"68RpO0k9zNr1Bp7lTbGwNA":{"text":"This place is so good!! We had the feta fries and the blue cheese fries for an appetizer a","useful":0,"cool":0},"7ffcjf_R9jG_IAo4_TN37A":{"text":"Cool place, server was very good. I had the Chargrilled oysters (delicious) and the seafoo","useful":0,"cool":0},"5lJLPeCj1-0xZQkg2iB0zw":{"text":"I found out about Katie's a few years ago, when my mom was visiting during Jazz Fest. It w","useful":14,"cool":8},"0yhoaiddKQeVQ2vqh7rwQA":{"text":"Incredible. I can't stress enough how you can get a taste of EVERYTHING New Orleans here. ","useful":12,"cool":9},"W_qJM_JZ_L8i7mfqowERvQ":{"text":"I don't know why it took us so long to finally try Katie's when I would hear how great the","useful":0,"cool":0},"mp6i4tHPWFPfsolw6MePbA":{"text":"We were a table of four.  We ordered the dozen chargrilled oysters and they were very smal","useful":0,"cool":0},"ttDae7J8v_tcClTk-qxjxA":{"text":"I normally would give this a five star rating. There takeout is nasty and soggy. My dine i","useful":0,"cool":0},"aTSDWyZgWt_x7vO030C2pg":{"text":"Approximately our 4th or 5th visit.  Always delicious food!\nFirst time try today-Oysters S","useful":0,"cool":0},"rzBk4nOGyfo7DqF2E6VjoA":{"text":"New in town and looking for a local place that wasn't super specialized (i.e. all seafood ","useful":1,"cool":1},"stMjwgWo0gzRs0YD4q5-Lg":{"text":"One of the best meals we've ever had. Did the crawfish beignets, chargrilled oysters w bac","useful":0,"cool":0},"SmgW5wyocJ6WXGyI06AErA":{"text":"We moved to NOLA 10 months ago and had been trying to get to Katie's multiple times but th","useful":0,"cool":0},"Pk8Um1G6XXqtg9vIPW2b7A":{"text":"This restaurant is my staple, and no matter how busy they get, they handle the crowds with","useful":0,"cool":1},"RnSRgFQN8-Ns2oaXRHLvJw":{"text":"I ordered a chicken pasta with Bucktown Alfredo and a side of chicken and andouille gumbo.","useful":1,"cool":0},"hraCmWj2tDLFrxgiGN_v-Q":{"text":"It was pouring down raining when we got to Katie's & really appreciated the owner(?) openi","useful":0,"cool":0},"ls0x6QTIcGLxxMCyDdNnLA":{"text":"This was our favorite meal this trip. The seafood beignets were amazing. We loved them so ","useful":0,"cool":0},"TKS2GiQgWLvgTSI4SyVwtg":{"text":"I am a Katie's fan and will continue to return but the last time I ordered from there it w","useful":0,"cool":0},"FM2sPQRly7J5El1yobAaoA":{"text":"Awesome food. Reasonable prices. Fast delivery. Nothing bad to say. I've not had anything ","useful":0,"cool":0},"LTnEYJ0ddkncEE4Zy6Y1Aw":{"text":"Pretty good grub here. Was dining solo, and grabbed one of the few shaded tables outside f","useful":2,"cool":1},"_HN6waXpmChCEBiobY-NlQ":{"text":"First time here. Very good. My guest at the table had \nThe ribs, catfish and gumbo, potato","useful":0,"cool":0},"HJxwoLIM9spy5nufg-EyRw":{"text":"Best Meal Ever!  We were visiting New Orleans for a concert over the weekend and wanted to","useful":0,"cool":0},"z71ltOnRL-ec4M45uUG59Q":{"text":"OFF THE CHART......\n\nThe meatball poboy was unbelievable. The wife had the St. Louie, whic","useful":0,"cool":0},"kPtlfPy2yD50xgk3sqw2Ag":{"text":"Came to lunch for work one day - had the crawfish beignets and the blue cheese & bacon sal","useful":2,"cool":2},"bGM1lwks_10R7ZEYt5QsGg":{"text":"My hubby and I ate here Saturday night during Mardi Gras after spending hours on the Endym","useful":1,"cool":0},"XytsYzZ0jT4RMhKeVC4Hbw":{"text":"We sat outside and that was nice. Had a mango margarita and that was nice. I had a shrimp ","useful":0,"cool":0},"C3v_7JWz4hNoVVAezN1CRg":{"text":"This is the place to take your out of town visitors. We used to always go to Jacques Imo's","useful":0,"cool":0},"h3J9U5cGgxtv8i_DaIgHtg":{"text":"This place is located just a couple houses from my daughters home in MidCity New Orleans. ","useful":0,"cool":0},"rQjCwyNXHlg9p5xJJI1Dtg":{"text":"Normally this is the place to go for great food. I drive a Uber and when people ask me my ","useful":0,"cool":0},"gfPRfunvFa_x6En4ozTJ1w":{"text":"The reviews were fantastic and the food and service definitely lived up to the reviews. I ","useful":0,"cool":0},"jadYTlLjoj_jR-Sk0UcNeA":{"text":"Crawfish was great! I thought it was like the mini fried ones but it was good. The burger ","useful":0,"cool":0},"1B0IYU5Sldx6scd4YOTsYw":{"text":"Severely overrated. Better foods in the city at places with better service and a better pr","useful":0,"cool":0},"X91mo627iwJFI5FXCqDTiQ":{"text":"Delicious food! The breakfast pizza on their brunch menu (Sunday's only) is amazing!!","useful":0,"cool":0},"POJ8ukk6fDY1mMStH427aA":{"text":"Got a recommendation from a friend to visit Katie's after asking where I should go to dinn","useful":1,"cool":0},"KnQ06AyOGZ3kyjXHteHMFA":{"text":"Could sum it up with Solid, Solid, Solid...Always consistent and great local atmosphere!","useful":0,"cool":0},"KBCn8Kbq28fwwOaS7nRgeQ":{"text":"I saw so many review about the crawfish beignet, so our table split a few. It was super ta","useful":1,"cool":1},"Przoxdt3U2CBfVwuTagPLg":{"text":"Great experience at Katie's. It was packed when we went in but found a spot at the bar. Th","useful":6,"cool":5},"YNpQvE6MDb2yjWn0-qAvTg":{"text":"There was 9 ladies in our party and we' got seated immediately. The food was good AND the ","useful":0,"cool":0},"qZRGVM-EdTFjky3Lxljx3A":{"text":"Lovely neighborhood jewel. Food and service was wonderful.  Onion rings with remoulade was","useful":1,"cool":1},"hX2r2BJUlE4tv1kSTQJbZA":{"text":"Katie's reminds me of two of my favorite old haunts in Richmond Virginia. It is a nice nei","useful":7,"cool":3},"egAaFdROkbGB6QjwkX2w1A":{"text":"LOVE Katie's  It is great casual neighborhood eatery.  BEST  appetiser is  an oval type pi","useful":0,"cool":0},"Xx3wq_bygE1shJeemwrhjg":{"text":"So I came back for a round 2. \n\nBill the bartender was amazing and I'll sit at the bar wit","useful":0,"cool":0},"OXEFgoA1VsjTxiFHmiXWgQ":{"text":"I really love Katie's. I'm not from NOLA but some friends and I come into town for Mardi G","useful":1,"cool":1},"X9ACmmr-OxF_xu2-xGmoCg":{"text":"I have been coming to Katie's for a couple years now, and each visit the food is nothing l","useful":0,"cool":0},"LpaGx6dS1xOg_Ph2yXmLsA":{"text":"We were headed to our friends for dinner the other day, and I suggested that we order Kati","useful":1,"cool":1},"ttp9DvG8_qcERphyDs1-Bg":{"text":"I really wanted to like this place more than I did. It had a very homely feel when I walke","useful":3,"cool":1},"_KjSlB5Vo6DHQlqVL-fqhQ":{"text":"Sunday brunch is the best\n\nBottomless mimosas/bloody mary/white and red sangria for $15.00","useful":3,"cool":2},"lHCavyvl4_P896XJuzENHQ":{"text":"TheBomb.com\nBest breakfast place I've been to in a while. The food was great, drinks were ","useful":1,"cool":1},"0e6WLm2vgsBYJRvcKwRAGA":{"text":"Crazy to say that Katie's doesn't have a single bad or mediocre dish in sight. Everything ","useful":0,"cool":0},"1q-Ljxcxy2RP0Pi2utY-hg":{"text":"Visiting New Orleans for a half marathon and needed to \"carb\" up before the race. Did a qu","useful":0,"cool":0},"PRbkfZ3uEwr5IO7gfzKmxw":{"text":"Great little pub/Italian bistro! Get off of Bourbon Street and give Katie's a visit if you","useful":0,"cool":0},"A5Y1UxmUzd3W7h3-vB3H_w":{"text":"Great food. Charred oysters are wonderful.","useful":0,"cool":0},"JrD3EJObHN4uMIx7rDbzdQ":{"text":"Came here for date night with our dog and sat outside on the patio. The hostess was really","useful":2,"cool":0},"X8qGARy_zDqC8aIk3Ph8KA":{"text":"We're staying just a few blocks from Katie's and decided to try it out verses going into t","useful":0,"cool":0},"vomzGw-BnD3kytKLUHVbTg":{"text":"Soooooo good.  Some of the best food I have had ever!  The entire staff is nice and so is ","useful":0,"cool":0},"sRNkEOJ9B40sH4fkh6LdPA":{"text":"My favorite boozy brunch spot in town so far. \n\nI wasn't really into their menu as far as ","useful":9,"cool":5},"qUCPhn1F8ogTuldoLcmb3A":{"text":"Katies is a fun neighborhood place serving sophisticated food. Quality service. Ample port","useful":2,"cool":0},"Daj6gg5wCJgtUg8hrJi78g":{"text":"The breakfast pizza is the TRUTH. Plus, bottomless mimosas or bloody's on Sunday's. It doe","useful":1,"cool":0},"1iMwvm7wBslagezmoeOglg":{"text":"For Yelper Mom and I, Katie's is pretty much a staple for us when we come to visit. We've ","useful":1,"cool":0},"-aW7EN7UGfUAehc5hWUIOw":{"text":"Katie's is a very trendy little place off Canal Street. This was my second visit and I ord","useful":0,"cool":0},"LjnUJ_zDh_9GSShfxLzRbw":{"text":"I was pretty sad I didn't get to experience their brunch as we were there Saturday morning","useful":0,"cool":0},"I8_KgeNVr-eE8lWEF6V-hw":{"text":"LOVED IT! Walked over after bike riding in City Park and it was certainty a treat! We sat ","useful":1,"cool":0},"n5UAnKti6A8FbaY7m3HT3A":{"text":"Get the crawfish beignet! So delicious, it's savory, not all sweet! I'm not really a sweet","useful":2,"cool":1},"nC-7I8H5GqmLALCUcvGHmg":{"text":"I kept hearing good reviews about this place so i decided to check it out. The place is no","useful":3,"cool":0},"t7C5Y24nNTQelq2WLNAx-w":{"text":"Wife and I made this out first stop in NOLA. We started with a Crawfish Beignet and it was","useful":0,"cool":0},"Ih7jYeDO98cE-nn50jiwvg":{"text":"This was the greatest find during my trip to NOLA thanks to my Yelp app! Katie's is in NOL","useful":0,"cool":0},"gxJCO0e6LVLr-OlFzpSf5g":{"text":"Enjoyable Sunday brunch at Katie's. A neighborhood treasure it seems. We waited for about ","useful":2,"cool":2},"SwgO8VRdXvNM4h5oW4lrCQ":{"text":"Saw this place on Guy's Triple D and had to try it. Was well worth the 45 minute wait for ","useful":0,"cool":0},"p4d-N7bmr0_Y5FSy4IrRNw":{"text":"I really enjoyed the casual, upscale food with reasonable prices! They offer something for","useful":1,"cool":0},"q_xrVTSSNkPHQPUGp-vBGw":{"text":"Katie's is a wonderful restaurant with great menu options. Great atmosphere for lunch time","useful":1,"cool":1},"Bbg6xb64NLTyrqeFTUNxbw":{"text":"Nice little hidden in New Orleans, great place for brunch,lunch or dinner. The Crawfish Be","useful":0,"cool":0},"Tlng-65vrzkH4qIaqGKk6A":{"text":"I visit my sister once a year and we like to discover new places together, and I am so gla","useful":1,"cool":0},"jJamFpm10P84FykrkTdfwQ":{"text":"Ok, we loved this place. It's a cozy neighborhood cafe, pretty much family oriented but I ","useful":0,"cool":0},"xQ_-hbNGcF5BteXADDXH6g":{"text":"My young adult daughter really wanted to eat at Katie's. We made a special trip there on a","useful":0,"cool":0},"spyaDjY4hSNfdLcl6GVrPg":{"text":"Fantastic food, terrible service.  Once the food finally came the seafood omelet was fanta","useful":0,"cool":0},"33Yqk9h9EL83EElKLhvPdw":{"text":"We found this little jewel on Yelp and couldn't be more pleased! The service was fast and ","useful":0,"cool":0},"Eqc6cdeaQkEyxP_BJKnhtQ":{"text":"The \"Boudreaux\" It may have taken me five times to spell it but it is freaking delicious a","useful":1,"cool":1},"0xYjJt-r5gpYz0Dr0N7H8w":{"text":"No matter how busy- and the place is always packed- the staff is super friendly and effici","useful":0,"cool":0},"TvgbxOAEBMyOXfHer1-AOw":{"text":"Steak night!  Go here and fill your steak hole with awesomeness!  The place is nice, the s","useful":0,"cool":0},"Scj4mB4EUKaKbBX4bbTygA":{"text":"Best catering experience ever! Alleviated the stress of preparing for a party. We ordered ","useful":1,"cool":0},"s36uyG_IwDMoQV9C1sGacA":{"text":"It was here we had our first taste of NOLA. We stopped here because it had appeared on Tri","useful":0,"cool":0},"9PO9Kc1zqAvT91fcwKf6Nw":{"text":"The bottomless mimosas were great. I came right before closing and they still served me. T","useful":0,"cool":0},"GRxqzu0R9rpQMnzx_YEgnQ":{"text":"Katie's has the ambiance of most New Orleans local hot spots, but what sets them apart in ","useful":0,"cool":0},"sdBv8RFQ9SJOJn4Xxs0bsA":{"text":"We really enjoyed eating at Katie's . We tried three different kind of pizzas and all of t","useful":0,"cool":0},"OAT-f0t87UWSDCXuxeD71Q":{"text":"Local vibe and decor. Great food and service. Don't take reservations so get there early. ","useful":0,"cool":0},"9yIy45CyRBd2sJfCWaLk3Q":{"text":"We went to katie's because our Uber driver told us how wonderful it was..... she was a loc","useful":0,"cool":0},"iFQypc-E6shJNOyyKvBGwA":{"text":"We were a large group and arrived early and still had to wait so come early if you want to","useful":0,"cool":0},"9fkLAS_6QOJ8AwJdQkG8Qg":{"text":"Normally this is the place to go for great food. I drive a Uber and when people ask me my ","useful":1,"cool":0},"neND-iepYqQXfcsgj4LaNA":{"text":"Excellent post Covid dining experience! We sat outside and it was lovely- it had rained ea","useful":4,"cool":1},"wBMyHM_OVBg4f4K8rlSH0g":{"text":"You better come over here get some proper food and not mess around in French Quarter!! The","useful":0,"cool":0},"paXCLCeK-o6I40aZAVE2zg":{"text":"Believe the hype! Soooooooooooo good! The flavors are amazing! They really have a chef bac","useful":0,"cool":0},"2T0-pYdmef-PcjlFeL5hcQ":{"text":"Love love love the Oysters Slessinger! It's like a little dip in each oyster. That combine","useful":0,"cool":0},"QRlnr530P6Zyzgh0tQGpXA":{"text":"Excellent food in a lovely neighborhood setting with good service. I had the Eggs Cochon a","useful":0,"cool":0},"j90f_MXk1XVFWc3w3yO5WA":{"text":"Great brunch today. Relaxed, inclusive vibe. Food is absolutely perfectly prepared. Not ri","useful":0,"cool":0},"KMGrNv983ECD2J30g221Ew":{"text":"Pretty good and popular place. Friendly staff and food is great. I got the legend and it w","useful":0,"cool":0},"lrTxv0PEhwWEWqgO1Eae6g":{"text":"My friend Jack got his tonsils removed and was crying like a baby in the car on the way ho","useful":0,"cool":0},"aPXgjiWXlWNFb_Ds92YXMg":{"text":"The service is always fantastic. Large and creative menu, daily specials... They seem to h","useful":0,"cool":0},"w5iXYmOx8AnSfAI_3E7faw":{"text":"I'm sorry, this is one of the best lunch spots in nola? No thx. I ordered the seafood stuf","useful":0,"cool":0},"Cq9DZkCpagFsuPBHQ0suOQ":{"text":"My wife and I had an afternoon lunch at Katie's after touring the aquarium on Saturday. We","useful":0,"cool":0},"Ywd_UCBqWU45gU_ftxCujA":{"text":"It was just \"okay\". It doesn't give me the New Orleans taste or feel. If I were to come ba","useful":0,"cool":0},"N-okJGnL_rardbT7DNI2wQ":{"text":"Went to Katie's on a Friday night and boy it was hopping! No problem for us. We ordered a ","useful":1,"cool":1},"fZeWDr-1gHTO3E-1RAfSyg":{"text":"During the last day of our girls trip our uber driver recommended this spot and I'm so gla","useful":0,"cool":1},"YR0H4Swd6BaQnXNzAVCjdA":{"text":"Such an extensive menu of yummy options - so hard to choose! The crab cakes were so yummy ","useful":0,"cool":0},"NRfK3o-ic4348ExJAAGRig":{"text":"Crawfish Beignet + Murphy's Mule is my go to every single time (during the week). Bottomle","useful":0,"cool":0},"IAEq3WvAkXKxY2NTANfJuA":{"text":"Y'all, I can't begin to tell you how amazing this place is! I went here on a weekend trip ","useful":0,"cool":0},"jzjOtPQHx4QKK-KcaxhuIA":{"text":"Many restaurants will advertise a \"crawfish\" \"shrimp\" \"duck\" or other protein in their men","useful":0,"cool":0},"HHMtzUhRGnb1r_YRDyjDNQ":{"text":"I wished I taken pictures.  We had a burger and oyster poboy. OMG. Sooooo good.   One of t","useful":0,"cool":0},"doedt3JsWTpVBZJW70c0KQ":{"text":"My first visit was phenomenal. It was busy, but we expect that in Nola during carnival! Se","useful":0,"cool":0},"py31FHywbbH7v3a85uyl-Q":{"text":"I wanted to write this review yesterday but I had way too much to drink to actually spell ","useful":10,"cool":7},"jpH4uSf8Um2hguU_WdNswg":{"text":"Love this place - always.  Sometimes the wait is horrendous - but that's just the outcome ","useful":5,"cool":2},"24umpXBkegktQyecoPgRsA":{"text":"I've been to Katie's several times for lunch and dinner. It's a good spot, no doubt. Sunda","useful":2,"cool":0},"JmghW6E00ZiaH_UjWRv4EA":{"text":"Thank you Katie's for making our brunch in New Orleans nothing less than amazing!!! Food w","useful":0,"cool":0},"q-LaFNsgQXL9yPTZ2jhWpQ":{"text":"What's happened to Katie's ? Prices have gone up but the food is not the same. The pulled ","useful":0,"cool":0},"NpLfQwkZMCULvr3xAA05fw":{"text":"This is one of my husband's favorite restaurants. I have to learn to say something right a","useful":0,"cool":0},"uyZaQX3FiwH6eP0m14ZktA":{"text":"The gumbo was amazing.  The pork pizza was good and the service was awesome!  We really en","useful":0,"cool":0},"kzueaN1Mb3KFBc0KB9a7iA":{"text":"Came here for lunch on Saturday after the busy brunch rush. The atmosphere is nice and the","useful":3,"cool":3},"Eyd3Ore3dx5FA3NgoHvB0Q":{"text":"Katie's has the cutest atmosphere! It is decorated in the local New Orleans style and is a","useful":1,"cool":0},"vv--3SrkCXioOVJtLnqAEA":{"text":"Honestly the coolest spot the eat in mid city. I go here every Mardi Gras since it is off ","useful":0,"cool":0},"TB4YIkmwQ_bBvl383TwAAA":{"text":"Meh...is right. I love the atmosphere and the story/people behind Katie's, but the food ju","useful":3,"cool":0},"Kh-FIp-v2wfhoWmv7SUR1g":{"text":"Aks. For. Pablo. I mean it! Great service on a crowded Sunday brunch. We had a table full ","useful":1,"cool":0},"9EG09r3uu7Vcp16qOa7FrQ":{"text":"Everything is delicious. We've never had a bad meal at Katie's!!!!!  We also love their br","useful":0,"cool":0},"HroO4Ss18QUvqpCgkRLIAQ":{"text":"Finally got to try this place! My coworkers have been talking about this place ever since ","useful":1,"cool":1},"v4uNu3IN2mqOcr2QlTvXcw":{"text":"Omg THE SEAFOOD LASAGNA and Crab cakes !!!\nThis food was so good and Charlie was AMAZING.\n","useful":0,"cool":0},"o2sWGqsUIOSjf6o066zKyA":{"text":"The worse food EVER!!! First they bring me my food on a broken plate and the food is cold.","useful":0,"cool":0},"5_hZ0DVUrXRTsj-tDnhvPA":{"text":"Excellent Food I really love that I can go to a nice little neighborhood restaurant in New","useful":0,"cool":0},"UgTf_vfMXnG6SENLSXXH3Q":{"text":"Ummm I'm going this start this review off with categorizing this place  in the hit or miss","useful":4,"cool":0},"pNNvqFUyCPioa4fMNIYowg":{"text":"Had the blackened shrimp alfredo. Shrimp were rubbery and overcooked. The alfredo had spic","useful":0,"cool":0},"9oTomKpGPVB1zMzjOP-gSA":{"text":"Drinks off the chain. Onion rings (thanks to my #Yelp checkin), remoulade sauce & the barg","useful":5,"cool":3},"RJUT9PDOvYLLCJPzB_eqCg":{"text":"Katie's knocked it out of the park AGAIN! We visited my daughter this weekend and I had to","useful":0,"cool":0},"rTKkZW-JJbvRzaLMone9mg":{"text":"Feta fries were a win with our family, the rest of our meal wasn't impressive. BLT salad h","useful":0,"cool":0},"Zl5KULHoaKZFmmsZXfVo6w":{"text":"Omg this place has the best ribs you'll ever try !! Make sure to get it ! The wait was a l","useful":0,"cool":0},"s1WS__3gN9fai-WdSrKDLg":{"text":"The onion rings here are really good and I don't even like onion rings.  I'm a sauce girl ","useful":1,"cool":1},"9DZIw8Q7DUVOlMWS_6ZR4g":{"text":"Me and my friend went to Katie's and had the Coolinary menu and it was sooooo good. They h","useful":3,"cool":2},"lLjeV8h6BzakbqQhKw-iEQ":{"text":"Good service, good beer, good food. Lunch was re beans and rice, and gumbo. Met expectatio","useful":0,"cool":0},"o0qoAAoJsWN6ccd-TR9p9w":{"text":"This is my favorite brunch in New Orleans.  No reservations so get there early, but the wa","useful":1,"cool":0},"fKd5VOpxakWyva-rbr7Uzw":{"text":"We recently visited Katie's while on a fishing trip in NOLA because it was on DDD! We were","useful":3,"cool":3},"y1iPd7SRXkIOm48fza4bAQ":{"text":"My all time favorite brunch place. Expect good food, good drinks, and great service.  They","useful":0,"cool":0},"Lf1g23DEpf1qEqx8JrzH0A":{"text":"Katie's is the first restaurant we visited during my husband's first trip to New Orleans a","useful":1,"cool":2},"PchK843yGyb4FSuI-2FEvA":{"text":"I dine out very frequently and this place is not safe to eat! Food poisoning from the fish","useful":0,"cool":0},"bp1QHlj3_uCW8yuiCx2vSg":{"text":"Covid-19 review:\nI recently had lunch at my neighborhood Katie's with a new friend to netw","useful":15,"cool":14},"cjiMeht9yE0luo7HHBT0YQ":{"text":"Oh man!!! Wow!!! Great New Orleans Cuisine at great prices. We're celebrating my wife's bi","useful":0,"cool":0},"bdSKfWwHys5yjzVeOPDYJg":{"text":"So worth it, chargrilled oysters were off the chart.  Do yourself a favor and get the \"leg","useful":0,"cool":0},"Zap-FbEXujMAaoyhg9C4Yg":{"text":"Their catfish po boy was DELICIOUS!! Their 7 layer cake was different, but good and moist.","useful":0,"cool":0},"Hi81oWbfVwLUMWlJ_c-KdQ":{"text":"If you're a person who likes taking a sample taste before taking your picture, I'd suggest","useful":0,"cool":1},"N28ERL9W3uXiUCeKswZU7Q":{"text":"Delicious food! I had the legend poboy and it was very good. The pork in the bottom wasn't","useful":1,"cool":1},"XUMq4cGEapzhweK1ZTkHWA":{"text":"We've been back twice and we will continue to visit as often as we can. The food is except","useful":1,"cool":0},"KtlTMQrGcbulhs6AuK_6YA":{"text":"I've been to Katie's a few times before Corona, and I've come to expect really great custo","useful":0,"cool":0},"ImzYfpugyKc-aC7Vn7IYJg":{"text":"Billy the bartender was outstanding! We came there for lunch and sat at the bar and from h","useful":0,"cool":1},"KSx8b67SUkJ1aBMasyXPzg":{"text":"Scott Craig has been doing it right here for 20 years. It is a little hectic at times, but","useful":0,"cool":0},"wSv3w3S6RzcUCYfympj-hA":{"text":"Noisy it is, great and huge menu.  Food is delicious and well priced. So much to select fr","useful":0,"cool":0},"iC3u7gproYkvDD4E7RlCiw":{"text":"Everything is great at Katie's--I mean everything, but I dream about their pizzas! You hav","useful":1,"cool":1},"gXnCiZKJM1pR6q9uW8AaEw":{"text":"This is a neighborhood joint I've loved since moving to Mid-City a few years ago.  Yesterd","useful":0,"cool":0},"0qmC73L7YRgZiH5A2Apccg":{"text":"In town for a couple of days and we always try to find restaurants featured on DDD. Katie'","useful":0,"cool":0},"0yJGgmmrGHt0AAlnS28fAA":{"text":"Saturday morning 3/13/21\nErica, Cameron & I arrive at 1110am right after they opened. It w","useful":0,"cool":1},"eIkoZ4ZcjK_F8Lmop3RtgA":{"text":"Our favorite dish is the Boudreaux Pizza. (I love garlic-keeps away the local vampires.) W","useful":0,"cool":0},"VxHMdQ-XZ0vald8v8H-NQA":{"text":"Cute little restaurant and bar, absolutely AMAZING food and great service. There was plent","useful":0,"cool":1},"rcbhZmAinjyw7ai6GAiTFg":{"text":"Okayyyy Katie's, back to normal! Crab cake sandwich for pick-up last night was on point, d","useful":1,"cool":1},"1NUDihbgQSXZn4eF2LJ0lQ":{"text":"The found we so delicious. The oysters Slessinger was fantastic and I could eat them all n","useful":0,"cool":0},"LLywEjBgFJIbNFhKfPjj5g":{"text":"So yeah, we followed the DDD rabbit trail and we were absolutely not disappointed, despite","useful":0,"cool":0},"B9lYRVNRYJ0WuzXeLPlkNw":{"text":"Best Charred Oysters in NOLA! The seasoning in those oysters is amazing. Dipped the bread ","useful":0,"cool":0},"Le-C9xcS8oEm23L7ez1RVQ":{"text":"If you're looking for an authentic NOLA experience - Katie's is the place to be. \n\nWe were","useful":10,"cool":7},"tJGokvv7RLVtlhkejBN9jQ":{"text":"I will change my review when something is done about this. Completely unacceptable. Gross ","useful":0,"cool":0},"2f9buJSKCUUQbIAVTd8x7Q":{"text":"I like Katie's... it's one of those quaint and cozy shotgun house restaurant conversions; ","useful":1,"cool":1},"s49P5DhaNu9VIAFBHVPgqg":{"text":"Great service and great food! I come for brunch or dinner most times and always enjoy the ","useful":0,"cool":0},"g-9kSaYFScfKUNMMZ_NUlA":{"text":"Come to Katie's frequently this time the customer service was great . Came in on a Thursda","useful":0,"cool":0},"0_D3AKr178AZdwMC3Q3V4A":{"text":"My favorite restaurant in the city! Everything on the menu is a home run. Go for the brunc","useful":0,"cool":0},"0ILqbpfNeS-NywAvVXmosw":{"text":"We stopped in on a Thursday night.  It being 6:30 and people waiting outside for a seat is","useful":2,"cool":2},"i1klLEMYv1CcwK3UHKDHgw":{"text":"Came in this little gem after some coworkers recommended it.\n\nArrived for dinner to find t","useful":0,"cool":0},"PArTW_xgSxOJ074yDeqjng":{"text":"I had a very enjoyable lunch at Katie's.This quaint little place is a neighbor gem! The ow","useful":1,"cool":2},"4PElfWmKi5unfFOZ8nWSAQ":{"text":"This place was really good however, the wait was really long and we were torn up by mosqui","useful":0,"cool":0},"QGvSKy_QTicf7vSJkY600w":{"text":"This place was ok...could possibly be what I ordered..but after appetizers, I didn't want ","useful":2,"cool":0},"dAcmojUclfa5_7ewRHw-kg":{"text":"Dropped in for a late lunch with a friend. It's been years since I've visited Katie's but ","useful":2,"cool":0},"qhyGdom7vp4sMbm95KJMkw":{"text":"ok, so i waited until i've been here a few times before clicking up a review.  i wanted to","useful":4,"cool":6},"Tsendu4h-gXbT7iORuFLPw":{"text":"Love this spot. Mid city neighborhood restaurant and bar. They have great drink options an","useful":1,"cool":0},"SS9FHGvhCPWJTQFyphP5bQ":{"text":"Time to spill some Ka-tea. We've heard about the magic that is Katie's from multiple sourc","useful":2,"cool":2},"QF_JOzNV6wQNRPEpcxR_oQ":{"text":"The lunch was DELICIOUS! We had the crawfish beignet, the muffuletta, and the chargrilled ","useful":1,"cool":0},"L1G-Clt0Wdt7X1hgO0mprw":{"text":"While visiting New Orleans, I wanted to go to a place that had local cuisine.  But I didn'","useful":47,"cool":46},"Sc4L5XLRGdejL0Vgu78G5g":{"text":"Good times and great food have been to Katie's for brunch and lunch and dinner have not ha","useful":0,"cool":0},"VDlDhTuwc0-zFYmYgTygaQ":{"text":"Went here tonight for dinner and we were very pleased. Charbroiled oysters to start were t","useful":2,"cool":1},"41zO3BqPBU3TSUbNOl3-zA":{"text":"We had an amazing time here! The mimosas were amazing. We were seated immediately and staf","useful":0,"cool":0},"ds4ZTSqqCr3N_ccqMd65PA":{"text":"Love the atmosphere and also the location of this place in midcity. It was quite busy in t","useful":0,"cool":1},"-XDvjjOGw-RpZlsJCShYUQ":{"text":"Katie's in Mid City is a buzzin' neighborhood restaurant serving \"Creole-Italian food\" and","useful":2,"cool":0},"W7pYt0ce7dKnhks1p-Aj7Q":{"text":"Disappointed with the pizza, had heard really good things about it. I'd come back to try s","useful":0,"cool":0},"AJwQ73UnKcL2EhqQn66VXQ":{"text":"This was the most amazing meal of my life. No exaggerations.\nI ordered the fried green tom","useful":1,"cool":1},"fzVeC6lyJmkC9RDoE-qejw":{"text":"Im a little disappointed in writing this review. I had such high expectations and passed u","useful":3,"cool":0},"U9-uS9yLEG3O2o26ANK9JA":{"text":"We love Katie's. My wife and I live in Mid City, and we eat there often. Some family visit","useful":1,"cool":1},"NC7w8j1I6mZVGtjvrq-0Zg":{"text":"I love it here. Brunch with bottomless mimosas earns it a dear spot for in my heart. But e","useful":1,"cool":0},"3wsBzQmsUrUtGALb29fLxA":{"text":"Soooo good. Their menu is never-ending! It was a hard choice, but I got the chicken parmes","useful":0,"cool":0},"Fs51r7RidYycIyvHb1G7rg":{"text":"We came here for a weeknight dinner with a friend visiting from out of town. They seated u","useful":9,"cool":4},"v0HYifCGambvqKzD9m9RHw":{"text":"Great New Orleans food... Right behind Canal Street! Started ...with the Basil Martini tha","useful":1,"cool":1},"yzCVDzuksDbsKps-Z-sTWA":{"text":"I came here for lunch, and I sat outside (since I had my pup with me).  My date and I orde","useful":0,"cool":0},"d0jgB5Sbtiv_He66kNL3HQ":{"text":"Katies is always busy but a couple of Sunday's ago we went for brunch.  It was raining but","useful":0,"cool":0},"9o6YAYnSUP_kLrUn2OXERg":{"text":"This is one of the high light's of my trip to New Orleans.  4 people went 2 had the blackb","useful":0,"cool":0},"VMag4YS7V7vnWox6qOqvPA":{"text":"I really really wanted to like Katie's but it wasn't a homerun to me. My family of five ar","useful":2,"cool":0},"jIqZaoF6w10t5fnlYZVYIg":{"text":"Best brunch in town. The chicken and Waffles are great along with great service! They have","useful":2,"cool":0},"FxACSe-JsKh4kHflihcRYA":{"text":"Overrated food. Unprofessional service. Major fly problem. Manager is terrible. We will NO","useful":0,"cool":0},"MWi8QDKKYgfH1Yl9GsYerA":{"text":"Ah, Katie's!!! \nOver the past year, my girlfriends & I have made Katie's \"our spot\". Being","useful":0,"cool":0},"se_sMLDTUCM7tfyWc9p7Zg":{"text":"My husband and I came here on a Tuesday night after a friend recommended. We had about a 2","useful":0,"cool":0},"U_HLr2KH1ycoicyCIrnzRA":{"text":"Nice a lot in Mid City. We enjoyed the Crawfish Beingets and the shrimp mirlion topped wit","useful":0,"cool":0},"J03NweAJMB5T41vwAuoMqw":{"text":"Just about everyone who comes to visit me in New Orleans gets a trip to Katie's.  There's ","useful":1,"cool":0},"uk-F4QkhipDv-KbTCZdkfA":{"text":"We drove out to this place. We were told they have great food by someone who lives in New ","useful":1,"cool":0},"W3d3YMQ8CfCeB9Q7Yr9ZUA":{"text":"This was our first stop when we got to New Orleans . It did not disappoint ! Started with ","useful":0,"cool":0},"UfVamTKu9InJlLjEuZBSpQ":{"text":"Great food ! Just don't sit upstairs they'll forget about you at times , the ribs are the ","useful":0,"cool":0},"RFfR6XlOgTYi9AJlBwrxdw":{"text":"Y'all, I can't believe I've been to New Orleans a million times and never had this place!!","useful":0,"cool":0},"TqChQpyhjkBm83XCcsPOJA":{"text":"Location seating and food was all on point with this place. Great area, great staff and ju","useful":0,"cool":0},"IWz8fSOiJakStl4Vw9FkZw":{"text":"I made plans to take my sister here for her birthday and we had tickets for the Escape Roo","useful":1,"cool":0},"CAD1ONjkf6Z-THf_uNrZVQ":{"text":"Honestly almost every Uber or Lyft driver that I had while I was in New Orleans had to tel","useful":2,"cool":3},"B-5FIQYBgvMWtnU_7--CRQ":{"text":"I love this place!  It has a large selection of food.  However, my favorite dish is the th","useful":0,"cool":0},"n0FXJm1xTHSJ1LYnmwPSAA":{"text":"Great food! Great drinks!  Great service!  It's a little cramped but it's fine. The food i","useful":0,"cool":0},"y9Z6wu_kGaE2krF0gI-mPA":{"text":"We're in town for two months and love this place.  We're always greeted with a smile and o","useful":1,"cool":1},"ZtbhQMmIBI0KHWi5aWiNFQ":{"text":"I stopped by with 2 other friends and this seems very popular among locals. There was a lo","useful":1,"cool":1},"y_qC9eql7SxC9npPqezvzA":{"text":"My family & I visited here for Sunday brunch. All of the food was hot & came out fast! The","useful":0,"cool":0},"W_6c37tujARVR51nkp8F0Q":{"text":"Katie's was hopping on a Saturday around 12:30 pm. The wait time was about 20 minutes.  Th","useful":1,"cool":1},"TYPbh4MjwtPwDqTBZo3MZw":{"text":"Restored my faith in New Orleans neighbourhood restaurants today.\n\nQuiet late lunch 130pm ","useful":1,"cool":3},"D4K-bjsapBXdswHFpja78Q":{"text":"All I can say is YUM! They have a large menu, with many options. Safe to say anyone could ","useful":0,"cool":0},"bF4ifQGg0qcqQWc8f1qf8A":{"text":"We really enjoyed Katie's. We did not go on a Sunday because I did not want to wait in a b","useful":4,"cool":1},"GeqL6cq_4Sz4pMfglXgQgQ":{"text":"A real taste of New Orleans! From the moment we walked in the door the smell, the look, TH","useful":1,"cool":0},"G_kBdeoHCofUmGo7QfLaYw":{"text":"The Chargrilled and the Slessinger Oysters were absolutely delicious!, as well as their Fe","useful":0,"cool":0},"4QsXYxEOPTeCml_FdMw1Fw":{"text":"Our first stop while visiting the Big Easy. I used to work across the street many years ag","useful":3,"cool":3},"XlqsiDAH_38vVkmh6kk_kw":{"text":"Today was the best brunch experience I've ever had. The hostess, bartender, and servers we","useful":2,"cool":1},"9f0IoWpo_FZSc11z8_O01A":{"text":"Excellent food all around. I really appreciated the customer service too at this establish","useful":2,"cool":1},"6t0KMA8YrNK-5PhG6XNewg":{"text":"Love love love this place. My friends and I designated Katie's as our \"spot\". The staff is","useful":0,"cool":0},"0JG6xPJb5B6MMDiOUdh2YA":{"text":"Katie's. We ate there 6:30pm, Thursday , April 8. \nI say we because we had 22 people in th","useful":1,"cool":0},"ev-YoAVWNal0Fw9yhX6I_Q":{"text":"Crawfish beignet and also fish and grits were amazing! Can't go wrong with the chargrilled","useful":0,"cool":0},"7UbtO64UqjGn3VjQe67BUw":{"text":"Katie's is one of our faves in NOLA. Every time we are in town, it's a got-to spot for goo","useful":1,"cool":0},"MJRGFa7VVoHIlzxXfQG0HA":{"text":"THE SEAFOOD BEIGNET!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  \nThis place is a great neighborhoo","useful":0,"cool":0},"yjfbR23SZ1SlAQCrxP6vOQ":{"text":"Found this place through Yelp reviews. Great food and good service. The crab cakes were de","useful":0,"cool":0},"6TbAEo4XEkJ7Zw9bVL28WQ":{"text":"Came here for lunch today after several positive recommendations. This was a pleasant expe","useful":1,"cool":2},"3HmnRvRyayQmG3lWTVvL5A":{"text":"I happened upon this restaurant in Yelp....holy crow is this place amazing. We had great d","useful":0,"cool":0},"CCI-i0ItJe7UwCy1sZWR1Q":{"text":"Visiting New Orleans and this was on Double D's so glad we came .. \nIf you like seafood & ","useful":4,"cool":4},"zUzfUzAI1enpXRRemNlmcA":{"text":"We really enjoyed this place..cute..history...yummy big portions. Great friendly staff wor","useful":0,"cool":0},"e9AHLOzQosP6NFKyH_SDEw":{"text":"New Orleans is a wonderful place for food and of course alcohol and Katie's gave us excell","useful":0,"cool":0},"RGf9bsDZv1UPLQqtNgyoyw":{"text":"Possibly one of the top 3 best brunches I've ever had. My boyfriend and I really enjoyed t","useful":0,"cool":0},"dH4TP05_smDhYcZBwFfOtQ":{"text":"Great place to eat. Food was great and crowded. Waiting line. I would go back for sure. Ha","useful":0,"cool":0},"qHxVGpO_SGuiacZEUBGNlw":{"text":"One of my most favorite places to eat in New Orleans! Chef Jonathan made me the prettiest ","useful":0,"cool":0},"L_K2xi1ZR3uLafVgJc594A":{"text":"Great food, nice location. Really a small town, hipster feel where the chef comes out pers","useful":0,"cool":0},"2UTRV_t894wj0fmqvqRhOw":{"text":"Katie's rocks. The service is stupendous and the food is fabulous. This is a wonderful nei","useful":0,"cool":0},"ce4g2eFsxRcdgfquWdnWeQ":{"text":"How could I have forgotten about Katie's after all of these years?  First trip in MANY yea","useful":0,"cool":0},"oQV70-JNYz7mUj83rJDX9w":{"text":"I stopped in here for lunch with a friend after visiting NOMA and we were both very please","useful":0,"cool":0},"bDewbqh5U-_2L7RJvYVCpA":{"text":"I'm skippin' the small talk and breakin' this one on down:\n\n\nFOOD:\nThis was our first stop","useful":1,"cool":0},"2lBhsMAJY67Rftav9PbEYQ":{"text":"Hands down!  BEST COCHON Ive had in NOLA. All the food here is incredible. Don't miss the ","useful":0,"cool":0},"MB4W_evtEEciaiFb54beOQ":{"text":"This place is delicious. We went on a Tuesday and it was packed I can't imagine what it's ","useful":0,"cool":0},"geoucEM2vpoeY3Eag4kQkw":{"text":"Went to Katie's on the 13th and had a really nice time but I checked my account 3 days lat","useful":0,"cool":0},"h_vu-S0hxjxi140yHLapoA":{"text":"Katie's is off the beaten path but it is a great find.  I don't think I have ever tried an","useful":1,"cool":1},"1f72FAUe1Hh1d8lRVc5rkQ":{"text":"I was here with my family for dinner. Food was good but the waiter was rude and lazy. Anot","useful":0,"cool":0},"7E6UMuAcCI_eUTkqgEYWoA":{"text":"Wonderful place.  We had heard of this place several years ago, but were stuck downtown.\nS","useful":0,"cool":0},"NmDTj10smlJIV8oNRwxqig":{"text":"Shame on me for not reviewing this place sooner. Frequented this place quite a bit this su","useful":3,"cool":2},"4X5d4xijc3cd_kUlwe6xxQ":{"text":"My husband and I have been to Katie's several times and have always enjoyed our experience","useful":0,"cool":0},"JWwxdvoZPnmvD8a2PAfVQg":{"text":"First timers here! We enjoyed the food and New Orleans feel to the place! We had the crawf","useful":0,"cool":0},"54SYkxiPXpFp42MBaGhIQw":{"text":"We had a party of 7, and since they don't take reservations we were a little worried on a ","useful":0,"cool":0},"QAqC20bseG6RL2z8X_Iw2w":{"text":"I naively came here on a Sunday for brunch without reservations. We had a party of 5 and h","useful":2,"cool":1},"ym71uqcoBKqq_RL_n57olA":{"text":"$15 for unlimited Mimosas, Bloody's, Red or White sangria during brunch! 'nuff said!!! The","useful":15,"cool":11},"wOE0KFluuBn4z5BCSiOsoQ":{"text":"This place never seems to disappoint me. I absolutely love their breakfast menu and the bo","useful":1,"cool":1},"fTQY06yJTAxxBDy4-o75xA":{"text":"Very small corner restaurant, always busy because of the food - we waited like 45 minutes ","useful":2,"cool":1},"-1qzkGPhIHdmlJgTOb0pNg":{"text":"Amazing food. Only my third time to go and don't know why as I love so close. The pizzas a","useful":0,"cool":0},"oX3-70VDtsOwQF_7M1dEiA":{"text":"I try to make here everytime I visit my hometown, Scott Craig continuous to serve local de","useful":0,"cool":0},"jfPlc_zXx5ffnmfekregvw":{"text":"I rate restaurants based on 4 categories (giving a star for each). Atmosphere, Seating tim","useful":0,"cool":0},"58NUT5LyWqEYaC5a5X8AOQ":{"text":"It is such a cute place! The food is great. The staff is so nice and welcoming. We usually","useful":0,"cool":0},"oezbefGvFlco3GXBdfFp3g":{"text":"Ok went right before busy lunchtime but I got seated. My party was a few minutes late and ","useful":0,"cool":0},"6HztAimjFdqdA9G69VOmTw":{"text":"We are visiting from out of town with our three kids and wanted a delicious, low key, loca","useful":0,"cool":0},"GW-WmNXDZvosOFMYSiLtRA":{"text":"A great variety of menu items, certainly something for everyone, and it's all delicious!\nI","useful":0,"cool":0},"Sc8lUdxSAqHfUp3c4Ruhyw":{"text":"really good local bar and rest. great service.","useful":0,"cool":0},"4mRjYwQm7XvJu34ETrIHrg":{"text":"If I could give no stars I would! Hostess made us sit outside and no one came to serve us.","useful":0,"cool":0},"j-gwZOVo4nMe3znl_6c_uA":{"text":"What can I say besides awesome!  I have eaten at least 25 times at Katie's. I can honestly","useful":6,"cool":4},"MC0bZLKvRpzBExdnhbg3NQ":{"text":"This place was packed and we waited forever for a table but it was a weekend in New Orlean","useful":0,"cool":0},"w3pi7YOCzRxRMdKQKFomxw":{"text":"I finally got to try Katie's. I have heard about it for a while and wanted to give it a sh","useful":0,"cool":0},"2vtLIAv1PSIMIgOOkpAuKg":{"text":"I've been to Katie's numerous times, but I've stayed away in recent years due to the super","useful":1,"cool":1},"GBwaoQRvh5_J9NHfVR-Q7Q":{"text":"After reading all the reviews, we decided to give it a try.  There was a line, but put our","useful":0,"cool":1}}