{"oCNtMfXf6brgX_AVttEWZQ":{"text":"Ran across this gem when walking from building to building at the World War II Museum.  Th","useful":0,"cool":0},"9tTlIHGHT_QaJVLwp1M9lw":{"text":"I ordered from Magazine Pizza after a long day of travel. I ordered a small pizza and soda","useful":1,"cool":1},"lcIlrdWTez9LTRwPqJKieQ":{"text":"Had their Margherita pizza and it was awesome! Also had the Caesar salad and that was grea","useful":0,"cool":0},"qKj9goo08ze_baCDUgyUDQ":{"text":"Hands down the best gluten free pizza I've had, but the best part is the homemade ranch di","useful":0,"cool":0},"dmwC72NHhfJ7iWoax2nTlg":{"text":"I absolutely love this establishment! Great food, wonderful staff, and delivers all over t","useful":0,"cool":0},"miKRm5_MRC88CLiUGnBHdg":{"text":"Magazine pizza is great.  Aphrodisiac and Lagniappe are my go-to pizzas, plus their salads","useful":0,"cool":0},"Ea1y_OJmRnxFnfRmljX5dA":{"text":"I ordered this pizza for my staff and wow was I disappointed. I ordered two large pizzas a","useful":3,"cool":0},"7b7fV220NemdKlqdXs0B7g":{"text":"This pizza was excellent. We ordered a four cheese pie with a couple beers and it was pret","useful":0,"cool":1},"5PdDab_IXcf5j_7F6u1viA":{"text":"Pretty good pizza.  Love that they are open late. Just what our group needed after all the","useful":1,"cool":0},"C0U5i9mIdT3K2oTFh4sY4A":{"text":"Placed and order for two pizzas (to be delivered), waited an hour (they promised it to be ","useful":2,"cool":0},"xqm1v95VV3lVK9wTM70y9Q":{"text":"Always fast and hot when delivered. Love that I can order online and pay online!  Prices a","useful":0,"cool":0},"dqt3SUA_Jhk8vE-0J4BQtg":{"text":"Minimal sauce to the pizza, soggy fries, but mozerella sticks are prime. On uber eats so a","useful":0,"cool":0},"LaQrn50XW7rSk1wlP67Tlw":{"text":"Let's see, I ordered delivery from here two days ago and was actually pretty stoked about ","useful":3,"cool":0},"fhWb20gDzqu3aefgX3114w":{"text":"Great little local pizza dive. Stopped by around midnight & enjoyed a margarita pizza but ","useful":0,"cool":0},"W-27GkbZ8DUZ3OEUDh7OJw":{"text":"We absolutely LOVE the pizza! Every time we come to town, we order delivery at least once.","useful":0,"cool":0},"u-LHkFKfrwBWouW6ETGiKw":{"text":"Ok your in  NOLA under tornado warnings.  Not a lot to do on lined ordered through Yelp wa","useful":1,"cool":0},"h6-NNKpkcDHT9jgPMHn-kg":{"text":"Good pizza. The OMGzone was delicious. We tried the Hawaiian, Margherita pizza and the Lag","useful":0,"cool":0},"8ZI0eb1PqipqBY900vK6tg":{"text":"I'm only giving it one star because I can't give negative stars. I ordered online from my ","useful":3,"cool":0},"BcpqUsRVcX_jXIIXWn7cJw":{"text":"Thanks for littering the city with your flyers guys.  I make a point to not patronize busi","useful":3,"cool":0},"gGyeJvbTw9mvjtc8jEYjoQ":{"text":"Very disappointed! Quoted an 1 to 1 hour and 15 minutes for delivery at 2:00 pm on a Satur","useful":0,"cool":0},"tRXuxHoDilyoTjuSf5kggg":{"text":"When I moved to New Orleans, one of the top priorities was to find good pizza in the new c","useful":0,"cool":0},"JpBMGPVksT_Dn98KECWugg":{"text":"We were staying at the Sheraton off Canal St visiting from Orlando, and tired of eating ou","useful":0,"cool":0},"wGWRp1bfA1gfrNGtxCkKJQ":{"text":"Meh. It'll make a turd.  Got a thin crust supreme and it was barely sprinkled with topping","useful":0,"cool":0},"C_rqqumJFw63kRCg5MkR3g":{"text":"Top five on our list! Being from  we travel a lot and have had our fair share of pizzerias","useful":2,"cool":0},"P-5bZRHdj0sQGF3tPcxPNQ":{"text":"My friends and I ordered pizza to go at this establishment. When I got home I realized I l","useful":0,"cool":0},"MkRvSWc_Fu2JauwqR0Lmvg":{"text":"The best salad I think I've ever had! I got the Magazine salad and it was delicious, fresh","useful":0,"cool":0},"cnv_pFPs3X77YMreEsXucQ":{"text":"Excellent thin crust pepperoni pizza. Plenty of cheese, good crust, and quick delivery. If","useful":2,"cool":0},"S4jUJ5ZdAv1FOi-MCOTePA":{"text":"Eh.. their pizza is better than some big brand pizza deliveries but I still feel that it's","useful":0,"cool":0},"0znLH58uq2YKpse6unnyDg":{"text":"Just ordered the Farmer's Pizza-- what a disappointment.  The toppings were all concentrat","useful":0,"cool":0},"8tiUnQSGsd2oDnR7iH72Xg":{"text":"We ordered 2 pizzas online. It took two hours and all we got was excuses. They said someth","useful":1,"cool":0},"tVHpc12CjwCSXp8alZ-NXw":{"text":"Reviews below about the long wait time are accurate. I don't care as much for delivery but","useful":0,"cool":0},"YKG6Lc4zTBu_WYG8hWJZIA":{"text":"Had a little trouble ordering over the phone, but this was solved quickly with the app.  P","useful":0,"cool":0},"S4QubyviDo0MiBSNeHbnaQ":{"text":"My order was incorrect and was mediocre food. Way overpriced for the quality and quantity.","useful":0,"cool":0},"OYK-CN0cRRxPk_DSbWs0Zw":{"text":"This place is awesome.  I am so excited to have found a place where I can get an entree-si","useful":4,"cool":3},"gUOSvhBh4qSIfV3qXQuj7w":{"text":"Visiting New Orleans for the first time on our honeymoon, we found Magazine Pizza by accid","useful":1,"cool":0},"e1RjnpN-aPO1Ua6p8h9TOw":{"text":"I know NOLA is about Cajun/Creole food, but this place is a must visit. It's unique. You d","useful":0,"cool":0},"MAz_n9sdboAfx_T8ERVnnw":{"text":"We ordered delivery after the NBA All-Star game.  It's been a long weekend and we just wan","useful":1,"cool":1},"ZIUmLdkyz8Y4QIo-NAKnBQ":{"text":"Quite possibly the best pizza we've ever had. They were very generous with the cheese and ","useful":0,"cool":0},"tetXanidz2CilQzR5Sto-A":{"text":"Not only did our delivery take over an hour...from an 11 minute drive away from our house.","useful":0,"cool":0},"sO9KjSq1XuSHFkvNWcC2NQ":{"text":"Pretty good pizza. Crispy crust with a nice chewiness. Especially good for families doing ","useful":0,"cool":0},"cI3k3YfDeK9lyNko_eWkcg":{"text":"First time ordering here and will the the last time. Got a small cheese and a large magazi","useful":0,"cool":0},"EBgnDgzS4zPd9fRo_MSf9Q":{"text":"I found their menu in our hotel room and decided to take a chance, glad I did. I ordered t","useful":0,"cool":0},"SWlkftIa8yoQMUvTa_seaQ":{"text":"WOW! For 35$ you can get a tiny pizza and 3 pieces of lettuce on the side (you call that a","useful":4,"cool":2},"JTuXdgn8_BuhvFl0HG8fhA":{"text":"Quick and friendly delivery. Delicious pizza with fresh ingredients. A little on the price","useful":0,"cool":0},"T3rLQSMMsMi-w70ZazHD9A":{"text":"Being new to the New Orleans area my husband and I had no clue where to order a good pizza","useful":0,"cool":0},"HLsLszSD1W333gJnyKYDxA":{"text":"Called for a delivery to my hotel room and was told no more than 45 minutes. 75 minutes la","useful":1,"cool":0},"tQV0w-_6gmrbXZPod8fEaQ":{"text":"Good customer service, fresh and quick delivery (even during the essence festival). Not th","useful":0,"cool":0},"zWUv0tB9MhOBs10-EeuCtA":{"text":"Just got to your hotel?   Feeling hungry, but tired from traveling and just need some yumm","useful":3,"cool":0},"7HtHJPADvN4JCnnDaVzBYg":{"text":"Ordered the Margherita Pizza for delivery and was not disappointed.  Very tasty, and Lots ","useful":0,"cool":0},"5DrE-EA5oB5q6i8eIboUMw":{"text":"Their chicken and bacon calzone is amazing. Their delivery was really quick too! Food arri","useful":0,"cool":1},"FcIGmLAJlqae86lqbp80dQ":{"text":"Best gluten free pizza I have had yet. Pricey but definitely worth it. We had to have it t","useful":0,"cool":0},"eG0trbi0hPRjHZR7AhUpPA":{"text":"I live walking distance from this spot -- and it's my go-to pizza joint.  It's absolutely ","useful":0,"cool":1},"ercWVIWJIcTPbQ_Nk3poQg":{"text":"Whoa yum yum! I got the aphrodisiac delivered and it was delicious! The toppings perfectly","useful":0,"cool":0},"OZlcBKP6T5MtiXfj7IpkPg":{"text":"Ordered delivery and was 1hr 15 min wait on a Tuesday. Pizza was lukewarm and similar to d","useful":1,"cool":0},"oZ_aCnzlJU-A3xrLzAk5Kw":{"text":"Go there, get the hangover pizza and maybe get two because you'll eat it. But be sure to s","useful":0,"cool":1},"sPOLSxQJI-9FVV6CkqcRCw":{"text":"Didn't actually step into this place, but we did order delivery from here.\n\nWe had the gri","useful":5,"cool":2},"dELvcbLDKFlORhl6lZMocg":{"text":"I could overlook the ridiculously long wait time and the cold pizza, but I cannot overlook","useful":6,"cool":2},"j1DVzt_mO6_SbtSUWMZG3A":{"text":"I've eaten pizza and other things here a few times, but never actually eaten at the establ","useful":0,"cool":0},"MbSN3NaZVANu2u0x4zRFvQ":{"text":"Great food and friendly phone staff. But the delivery driver did not bring part of our ord","useful":0,"cool":0},"IAW_97dHAVo8Uj0HeKAUUw":{"text":"I ordered a pizza with pepperoni and mushrooms and also got the garlic sauce. The pizza wa","useful":1,"cool":0},"TWrxNOOSvVKe6Rh-FAD1mQ":{"text":"Delivered to our hotel in 1 hour, online estimate was 60-90 mins so that was nice. Food wa","useful":0,"cool":0},"1jBUaAUhLz5tNc0OBMjS6w":{"text":"Tops on my go to for ordering in. The variety on the menu makes it impossible to not want ","useful":0,"cool":1},"PRKyPhH9wG5TOjLfaPDUGQ":{"text":"I work a few blocks from Magazine Pizza, and one day I decided to get some pizza delivered","useful":1,"cool":1},"xKrqXiafjzoHF5Y6Fk208Q":{"text":"Service was great. Mel rocks! Pizza was even better. \"Macho Man\" is where it's at yahurd!","useful":0,"cool":0},"seW8Y3XCcCLNKiXbBXO5Hw":{"text":"I have eaten at this place twice. Both times I got a large pizza with the meats, a Large C","useful":0,"cool":0},"tuoJCOJ8HvjpbguAZFUxIg":{"text":"The girl behind the counter greeted us immediately entering the establishment. Offered us ","useful":0,"cool":0},"dORvUfrlAEd2Bh6iFeTb0Q":{"text":"So many creative pizza options! The Aphrodisiac is my personal favorite. The guys who run ","useful":0,"cool":0},"8Qh-Fm47XxsG8NidBGZgCw":{"text":"I love my extra cheese pizza, but this restaurant and its artisanal offerings was enough t","useful":0,"cool":0},"vbgtJIUbTDx0H8Z8zpYt3g":{"text":"Our favorite splurge/hangover delivery pizza!! When they get it right, they get it RIGHT! ","useful":1,"cool":0},"uEdQXNrJhFCyvNhuB37Tbw":{"text":"While on vacation we ordered two pizzas and a spinach artichoke dip from here. First, the ","useful":0,"cool":0},"cFZ0g1GPHJ36Y5GsGFWZsw":{"text":"Magazine Pizza is my new favorite pizza place! Their buffalo wings are delicious, and so f","useful":1,"cool":0},"aaxDtStUIcBwZCP91VZ0aQ":{"text":"What a treat this was! As a visiting vegetarian i found it VERY difficult to find food in ","useful":1,"cool":0},"oj3XN4hcySxb0jcWFh3GKg":{"text":"I've walked by this place many times and the decor is minimal so I wouldn't generally reco","useful":1,"cool":0},"IT1P8XebtlPfKB-qrjRsdQ":{"text":"We ordered pepperoni pizzas tonight and they were sooo good! I love that ranch dressing wa","useful":0,"cool":0},"G8UqdRKipxhbChfbX4bvhg":{"text":"I literally just got on my iPad to write this review after eating my delivery. While vacat","useful":2,"cool":0},"OYmKovzF2TkhZdBU7sQ8tA":{"text":"Hands down the best pizza in New Orleans, and Madison Blome agrees!\n\nLagniappe, Chicken Pe","useful":1,"cool":0},"VgSFsCaZ0lFwby-UDq-S9g":{"text":"Great pizza! The cheese is so yummy and so  much of it. The hot mama is super spicy yumm. ","useful":0,"cool":0},"wy3tKpA-dWi-tBHWa5qvcg":{"text":"Visiting NOLA for a conference. I didn't feel like going out to eat so I ordered from Maga","useful":0,"cool":0},"mNJ1_HA7otbL_dffGrIU4w":{"text":"We ordered large grilled chicken, lg farmer's mkt veggie, lg pepperoni plus a chicken avoc","useful":0,"cool":0},"pep-S83ozCutJ2ERfyxtPw":{"text":"I am a frequent customer at the CBD location (it's close to work), and tonight I have orde","useful":0,"cool":0},"EL4VWMhD9U-iYFnusGSyeA":{"text":"Anyone can place a plethora of toppings on a pizza pie an bake it. People love pizza not o","useful":0,"cool":0},"oeARNGMsrfuzW_ip9ZpwmQ":{"text":"I have to update my previous review to say two most important things.\n\nOne:  last night i ","useful":3,"cool":4},"Ph_ndoBvwGI85ymIUgqTIg":{"text":"Visited New Orleans last week and checked Yelp for recommendations of pizza places that de","useful":0,"cool":0},"SBBwrTIgIFK9Y0_Z3nIqqQ":{"text":"Wow. the Margherita Pizza was SO good! Fresh not super heavy or greasy. I'm a fan now and ","useful":0,"cool":0},"RsbVWYbjxYGZwvD2DFak4Q":{"text":"Just amazing! They deliver to the Rusty Nail and it is perfect! The pizza is really good. ","useful":1,"cool":0},"UX_gBWB-pHMJzhzV6TqRIA":{"text":"Ordered a pizza for delivery. Was told it would be 40 minutes. I called after an hour and ","useful":3,"cool":1},"vCUSL5uDEpPSyLbyc7LVXw":{"text":"Don't order from here. They will confirm your order, charge your card and never deliver. S","useful":1,"cool":0},"foaYGGii86yBjZBBKjx-zw":{"text":"Ordered delivery home, was fast, honey mustard souse is just Delicious !\nCheesecake is MUS","useful":0,"cool":0},"f9trhkz_NuiDmEcOMoMaVw":{"text":"good pizza !!!!  rally tasty   -  close to WW 2 museum","useful":0,"cool":0},"M4CyUgB9c2X4GqWxij81nw":{"text":"Best pizza in downtown Nola. Always ask for d livery time estimates but pickup is simple a","useful":1,"cool":0},"Dk3_Cy_oVTTjUWw0Fp8fBw":{"text":"Three hours for what, I'm pretty sure, was frozen pizza. They said it would be about an ho","useful":6,"cool":0},"KmoyukQlMXguyZ-U-HS26g":{"text":"We ordered delivery while visiting NOLA. We didn't want to go out, so we decided on delive","useful":1,"cool":0},"CzM_g6Y-HpJZ4Qmmy3lh4w":{"text":"My boyfriend and I have ordered about 8 Magazine Pizza pizzas since we discovered this pla","useful":2,"cool":1},"eYUrd_btX3GpFAqaVQQY-A":{"text":"Erick B\nGreat pizza and nice dining atmosphere.   Find this pizza parlor when we were in t","useful":0,"cool":0},"FC-G0cmx8Sa8hYj7VPfgHA":{"text":"OMG! Best pizza EVER! Seriously, I eat pizza at least once a week, from all different plac","useful":0,"cool":0},"sVOCTsrmn8id9nipGrpfSw":{"text":"Visited from San Antonio in June 2015, party of 6 . Ordered individual pizzas and a couple","useful":0,"cool":0},"PSCFQz4FCo9pO0_e9n1s-A":{"text":"I feel like all delivery places short you on certain things but damn- I order a salad chic","useful":0,"cool":0},"eW8TTzdJsVhezoRUQqeltg":{"text":"Got the magazine supreme. The small is a little too small I think, but the pizza itself is","useful":0,"cool":0},"ceyuFokQy_OGsAl4GalqHw":{"text":"We ordered the Aphrodisiac Mozzarella, fresh basil, fresh mozzarella, cilantro, artichoke,","useful":2,"cool":2},"qSEB0VZ3ZAZuaWarZml1Hw":{"text":"Ordered pizza, cheese sticks, and cheesecake our first night in NOLA. The pizza was so goo","useful":0,"cool":0},"x601vVeaeZH4fCIjeAmr3A":{"text":"So far, disappointed.\nOrdered on line over an hour ago, still no pizza.\nI called 45 minute","useful":0,"cool":0},"ngBbv_MhPt99ANK1XWdO9g":{"text":"Forgot to update sooner, found the catsup inside the container under a mound of fries.   I","useful":0,"cool":0},"IXVzEZPMcfNL5-HA0eWozQ":{"text":"I'd give it 10 stars or even, 100 stars!! Best gluten free crust I've ever had and the piz","useful":0,"cool":0},"_wMJo8tvBymrBqTbt46U9A":{"text":"I just got in town and they were listed in the hotel directory so I gave'em a try.  I orde","useful":1,"cool":0},"EKCoW8l_dfv6-tyPUp1P7w":{"text":"Good pizza but the hidden gems are the salads! Go with a friend and split a pizza and sala","useful":1,"cool":0},"dzNh-MPKrd-n82PhsLwesw":{"text":"I've had pizza all over the country and THIS pizza was terrible! Worse meal I've had in Ne","useful":0,"cool":0},"nTMnavytorefpJhOHK98yA":{"text":"Wow, found this place located in convenient Warehouse location.  Walking distance from man","useful":1,"cool":0},"9qr9oIFYtOcTFeWUboyP1A":{"text":"Magazine Pizza has won my heart as my favourite uptown delivery pizza place. I've ordered ","useful":0,"cool":1},"MNbTbXE2KciaqmyRDed_nQ":{"text":"Its definitely in a weird location, but I really like this place. I have only had the pizz","useful":0,"cool":0},"cDki-sqVUo9zAHZeroUf0Q":{"text":"I eat here a couple times a week..tbe pizza is always great..its always hot and yummy when","useful":0,"cool":0},"4ATRrVSzwYK-nPZzShd91Q":{"text":"We were in town from Indiana and took a chance on this place. The pizza was very good. I a","useful":2,"cool":1},"MrOLo13Zf1wWt_7sEE8DNg":{"text":"Love this place! Food is great and service is absolutely wonderful. This place is my favor","useful":1,"cool":0},"3SX1C5G-k75-3tug_t9v_g":{"text":"Amazing local Pizza place. They accommodated our group of 12 with 6 pizzas within 30 mins.","useful":0,"cool":0},"yyMVyMANrI-6NscD6mVcUg":{"text":"The quality is terrible. Mt chicken literally tasted like floral soap. They treat their em","useful":0,"cool":0},"tQA6mSG2GI-GlOx51-eu9w":{"text":"We ordered take out & it was pretty good. The guy over the phone was extremely nice when I","useful":0,"cool":0},"SO53PfG9HeefCr2CJfrdHQ":{"text":"It is a lovely place to dine. Very clean and the servers are really nice. I get the hangov","useful":0,"cool":0},"mYKnWuhBa3b8yuhg0GGOnQ":{"text":"OMG!!! We were starving after Voodoo Fest when we finally got back to our hotel room. I as","useful":0,"cool":0},"dTGmPQ8HkTC4EklALhh_nw":{"text":"Room temperature pizza and a forgotten beverage. \n\nMagazine Pizza started with 1 star for ","useful":1,"cool":0},"NwvdIOF3X5M8Zt5053Wb5g":{"text":"Ranch dressing compliments was New Orleans calls pizza very well!  The small pizza is very","useful":0,"cool":0},"7nT5GmFI5CBtdK5Z9VaKWQ":{"text":"This pizza was amazing !!!!!!!!!! The ingredients where fresh! I ordered there equivalent ","useful":0,"cool":0},"VSElHU5y7GvhefWtrV_Ang":{"text":"We ordered the Supreme Pizza and the cheesy garlic bread. It was delicious! Veggies were f","useful":1,"cool":1},"2A6KEAU8DIPznXtl_1J8ZA":{"text":"We were visiting NOLA from Brooklyn and my husband said that it's comparible to NYC pizza.","useful":0,"cool":1},"9f7z5Pq2iOg7NP4O9N9png":{"text":"In town for lengthy work, and my co-workers said this place delivered to my hotel, so, bei","useful":2,"cool":0},"ajANyAlVdRFlG77At9bu2w":{"text":"First, I called about five different times, to both of their listed numbers, from two diff","useful":0,"cool":0},"Pjch0Gbdg8Vc1buqwnMzMA":{"text":"Best pizza, love margarita pizza.  They sell beer too :) get the market fresh salads, they","useful":0,"cool":0},"AvFwZq6AzyrxccVJNF6WbA":{"text":"The pizza is pretty good, but my issue is with the service. Once I called because I had ac","useful":1,"cool":0},"0TzOu6BDrbnLXZkRZqIdVA":{"text":"After days of overpriced food, Magazine Pizza was a God Send! I had the Philly and it was ","useful":0,"cool":0},"h5WMvFB2MhCAPGlQpY1XnA":{"text":"Ordered their margherita pizza to my apartment the other night and I was not dissapointed!","useful":0,"cool":0},"CQaJ-WxQNYVVJjOsmgQ7aQ":{"text":"Don't think I've ever had pizza as horrible as this was.  Soggy crust, bitter, bitter sauc","useful":0,"cool":0},"YkwcN9fK0buHrVOjxa4Shw":{"text":"We ordered in from our Hotel on a Saturday, and the delivery time estimate was 90mins. It ","useful":0,"cool":0},"bjW-1zadqZHHnPZMrizbrQ":{"text":"Ummm... I've been here a bunch and never reviewed? Weird.\nY'all know I love pizza so I'm a","useful":5,"cool":2},"kZ5cpYMt2d7Uuck4qqP-7A":{"text":"We ordered the large pizza from this restaurant late in the night. The pizza was super sma","useful":0,"cool":0},"UKAeGz_tAd8SMluaYk5cgg":{"text":"Got to-go to be delivered at work today. I ordered cheesy garlic bread over the phone and ","useful":0,"cool":0},"xSxTNkK3YMfOFd4AbLIzBg":{"text":"The best pizza in New Orleans! Love love love this place and they have a lot of other deli","useful":1,"cool":0},"-wXd9y86omazyMZpOMDqGA":{"text":"excellent pizza, despite it not being what I ordered lol. The wait for delivery is pretty ","useful":0,"cool":0},"nwVW3cOfRMpn3SXVKnnwcA":{"text":"\"Grease is the word, is the word....\"    Sometimes, this is exactly the type of pie you cr","useful":0,"cool":0},"lh8CatxIHmaWPFQ2Hy5R5w":{"text":"I'm not going to tell you how often we order magazine pizza because that would be embarras","useful":0,"cool":0},"gyDISwGnevPGx2yveeuUeg":{"text":"ick. I got a gluten free pizza and their crush was mushy- it was half philly cheese steak ","useful":0,"cool":0},"-nBwG2OH52vVn5mtSSIZLA":{"text":"Last time we ordered they brought us a cold pizza, a cold sub and a melted cheesecake more","useful":2,"cool":0},"ib7LklLGM1cSc8Y0CaNHew":{"text":"Cute little pizza dive! I get to the counter and the girl at the register couldn't look an","useful":0,"cool":0},"xojhAp2bLNogUIil3y_Itw":{"text":"Pretty solid pizza. The sandwiches are so-so, as their ingredients are limited (although t","useful":1,"cool":1},"4TiV7NwQzu109Pac2ak7Mg":{"text":"In town for the All Star game and didn't feel like leaving my hotel to eat, so I looked up","useful":1,"cool":0},"E6Y7Uc1vnYkejTqZOw9eyA":{"text":"Not bad! We stopped by here after visiting the WWII museum. I had the Farmers Market pizza","useful":0,"cool":0},"dXiSZIQf5K0yb6vbz6sc3g":{"text":"This my second visit to this place. Both times I dined in. I gotta admit, in the second vi","useful":1,"cool":1},"boVmE_Zgb8auuPaqZxRXgg":{"text":"In town for the Labor Day weekend celebrating our family's annual reunion. After a long da","useful":0,"cool":0},"BE1AwCWHNcVAFBT3nH7hlw":{"text":"I love magazine pizza! The crust is thick and luscious and the cheese and sauce always tas","useful":1,"cool":0},"npGKSamqx0I0nSlkVWRXFg":{"text":"Always delicious, really great menu selection. Delivery guys are always friendly and polit","useful":0,"cool":0},"PBYxAqbkyJw25IEZqN9c0w":{"text":"Did not have a chance to try the food, called for delivery and they answered said they did","useful":0,"cool":0},"SceNvmmjouLfUN5Ecf9BsQ":{"text":"This place came highly recommended, so I tried the same day. They did not disappoint!! The","useful":0,"cool":0},"Qb0v3aNyXrvNHItmO3PS7w":{"text":"This place is a good place to keep in your back pocket. One, their delivery range is prett","useful":1,"cool":0},"NGqtpkeUxZUo0DxTmDuoWQ":{"text":"We were in town visiting the WWII Museum and neither of the onsite dining options appealed","useful":1,"cool":1},"HAkxOxi217F7IkQxQEiH-g":{"text":"Absolutely delish. Best pizza in town! We eat here all the time and the kids love it. We n","useful":0,"cool":0},"lVYA-uKp4VnkbMo3bRJuIg":{"text":"The pizza was okay. It was a little too cheesy for my taste because the cheese was super t","useful":0,"cool":0},"nODzaLsqeXFmtEzM5oHIvQ":{"text":"So, it was in the midst of Jazz Fest, and every place we called at 10pm said that they wer","useful":0,"cool":0},"bsWmg5g-DrJqJgVWvUUd9g":{"text":"Visiting from California and had a hankering for pizza, this was the closest place and I'm","useful":0,"cool":0},"UmV4i4gt68kc1ihSG7ROOw":{"text":"Unfortunately it took over 75+ minutes to have our pizza delivered to our hotel which is l","useful":0,"cool":0},"8o9s0IN0jmp1fSAMfwsZ4A":{"text":"Not For Me. The pizzas will satisfy anyone into doughy chain fare, and even though the top","useful":0,"cool":0},"bq1_ZO8GdHkFKLDIveXZrw":{"text":"We were being the laziest of the lazy and decided to order in pizza, rather than explore t","useful":4,"cool":0},"HTh-gJTvgQHyqepI5L_lsg":{"text":"Food was great and they delivered through an extremely busy Nola night.  It was so busy we","useful":0,"cool":0},"9dQdMlm5XFjmNrijYcixYg":{"text":"This place has saved me so many times being open so late!! I love love  love the Hot mama ","useful":2,"cool":0},"vVh0lpJM8Wt6e3dg2UNzcg":{"text":"Fantastic Pizza and the two-fer price if you pick it up yourself is a sweet deal too!","useful":0,"cool":0},"Q9s7AMFb_i98aNwdF1lTYg":{"text":"Chicken pesto pizza was amazing \nStaff were a little uptight and it took a while because t","useful":0,"cool":0},"_VBvWP2ce7bcRXEiA2dHdg":{"text":"Complete Shit! Order #7265009. I ordered a cheese calzone ADD HAM. After taking forever, t","useful":0,"cool":0},"uCsqoX-UKxeqU2dhikyKBQ":{"text":"Great pizza, nice staff. Would definitely recommend! First time visiting from Chicago and ","useful":0,"cool":0},"_JlQv_atJbPpAb1iGulrDg":{"text":"Friday night with a toddler means pizza delivery to your hotel. This place did not disappo","useful":0,"cool":0},"u5wyYWg34Xwa-0PFdKLeiw":{"text":"Simply put, this is an excellent pizza. \n\nNow on to the review...pizza pie can make of a g","useful":1,"cool":0},"3F5NHubIeJXftCKglXCkNA":{"text":"Love these people. I order delivery all the time. The food is consistently good and the de","useful":0,"cool":0},"q_-OMe5MNLRP9Sre5GiS_Q":{"text":"Ordered this pizza for the first time today.  My Hot Mama pizza arrived completely soggy a","useful":1,"cool":0},"MhU-tQCpjfrHsgD09LEnug":{"text":"Tried calling Slice after Saints game but line was constantly busy so decided to try Magaz","useful":0,"cool":0},"rUdu_GQvYS-UpIsUKmomGQ":{"text":"We ordered the macho man pizza and cheesy garlic breadsticks. Both were excellent. The piz","useful":0,"cool":0},"5EHb7YLUcveeMQNpH4sB_Q":{"text":"It was good ordered off of Yelp. Service was a little slow and pizza not too hot but the c","useful":0,"cool":0},"YVvqyDNcjMhr3JUHyRQ2Lw":{"text":"I enjoyed my pizza. I didn't know that ranch dipped pizza could taste so good. Prefect lat","useful":0,"cool":0},"scH0stzfFawO5o1-GigoRg":{"text":"Ok your in  NOLA under tornado warnings.  Not a lot to do on lined ordered through Yelp wa","useful":1,"cool":1},"O0tka0bzhXIphFN_OQPLLA":{"text":"Quite simple, very good pizza and they deliver to the hotel.  Very fresh, a bit expensive ","useful":0,"cool":0},"JWbHaXBI27TlOM-tmFngJA":{"text":"Got a Philly cheese steak pizza. Not good. Edible, but not good. Hardly any meat. The chee","useful":0,"cool":0},"7VirDkK5jlNhnxdwkhLwTQ":{"text":"We're staying at Children's Hospital for a while. We were craving food other than the cafe","useful":0,"cool":0},"SIK4Y-3xjb0XVo6Z3B4g8Q":{"text":"Review for delivery only (which according to other reviews, seems to be their main thing):","useful":3,"cool":0},"-PvyG1bYoc6-W-81EBBYcA":{"text":"If you are working at eh convention center this place is supper close, you can eat in or g","useful":0,"cool":0},"hFVtHFuVjE90C3hDlFh98w":{"text":"Quick pizza delivery. Very good \"white pizza\" and pepperoni pizza. Ordered the spinach sal","useful":1,"cool":0},"LP3oKe0Z2Y31dKLXsyXQMA":{"text":"Best GF pizza in town for a reasonable price and a good size pie too!","useful":0,"cool":1},"rgu9ClZmhJlkCCl0psbzfw":{"text":"Worst pizza ever.  Ordered 1 plain 1 pep, get call out of pep, but I could get a meat love","useful":1,"cool":0},"VkjrVJbrK6QxGKNwlngDag":{"text":"Had a very bad experience with Magazine Pizza and Grub Hub....ordered through Grub Hub and","useful":0,"cool":0},"_7ugqxHEFK2kWhjPmn1qjg":{"text":"Had a pepperoni pizza delivered to my hotel room. The phone service and delivery service w","useful":0,"cool":0},"0jQpdGaEUvbwfl-YAYyaMQ":{"text":"Had to wait a little bit long than usual the other day and they gave us free desert to mak","useful":0,"cool":0},"h39YN0uVfkXFRX98WKeo-Q":{"text":"Very good gluten free pizza! I guess I got it delivered at a slow time but the delivery wa","useful":0,"cool":0},"lwY2aE1XvuH10SM6PBHX1w":{"text":"Had the Mediterranean pizza and caesar salad.  \n\nSalad: Not worth the price.  Literally ch","useful":3,"cool":0},"xji3uesFBMgPNzGjtJxKWQ":{"text":"these guys are just starting out in a location (formerly, knock knock knock) doomed, but t","useful":5,"cool":5},"LXqB3th8QILlk5uSD-m8gw":{"text":"Super super friendly staff!  Great that they are open late and the pizza is delicious! Had","useful":1,"cool":0},"XI2moJDKhTK-eYW2o-gKfw":{"text":"We ordered the macho and cheese sticks for delivery.  Awesome flavors and received rather ","useful":0,"cool":0},"UPKQIOWN5FKk1YudnVESWQ":{"text":"Great pizza. Friendly staff. Hot and fresh. Smaller sized dining area. Close to WW2 Museum","useful":0,"cool":0},"IIs9V8gCypkB5GOMB4R5pg":{"text":"I like getting my salad here along with my pizza. I usually get my salad tweaked to how I ","useful":0,"cool":0},"vxiXvaUj_ud5lRmhooxHng":{"text":"The best pizza in New Orleans! Love love love this place and they have a lot of other deli","useful":0,"cool":0},"iMjBOrvq0sgTeYH9PXAfag":{"text":"It's Super Bowl Sunday everybody! There's so many Super Bowl food choices out there and to","useful":0,"cool":0},"eueW1qzo5fiNnCzdf8Qt8g":{"text":"We called at 4:45pm to order a pizza and a salad it is now 6:45pm the order is still not h","useful":0,"cool":0},"dcGus97LLeUpktcKNBItgg":{"text":"Don't order from here. They will confirm your order, charge your card and never deliver. S","useful":3,"cool":0},"T-QsrhqHHs81GN8xzkQa6g":{"text":"The food is awesome,  the people are great..they remembered what was forgot on last order ","useful":0,"cool":0},"rB6_ZXgflYLGcd3byYZaLw":{"text":"Ordered the pesto chicken and a veggie pizza. The pesto was one of the very best I had, my","useful":0,"cool":0},"XTWPBPm-bS1uc4dQXgd8Ng":{"text":"I don't eat cheese and the aphrodisiac doesn't need it! It's veggie goodness!!! The salads","useful":0,"cool":0},"vRRgHkeV4hR9CE0SwgApWA":{"text":"Prompt delivery, scant toppings, ordered the Hawaiian large...tasted slightly above averag","useful":0,"cool":0},"W-8dKY4wLq52hUQw84ICEw":{"text":"We ordered some pizzas this evening. While the delivery was pretty quick and the delivery ","useful":1,"cool":0},"-1NymuTcWeZUHqpI4LR7AQ":{"text":"I live only a few blocks away and had never ordered from here (usually order from Pie Pizz","useful":2,"cool":0},"EijcBgnJmACetQlm7cDd_g":{"text":"Yep!  Very good!  I had a friend visiting the other day and he was complaining how he neve","useful":1,"cool":1},"gj1zDY2F-fNSfzu-pjS9hg":{"text":"Love Magazine Pizza, as a neighbor they are my go-to! (St. Joe Lofts). Hard for me to subt","useful":0,"cool":0},"dQCt0WaPq7oxOoSoTVvyOQ":{"text":"The aphrodisiac pizza and the fruit calzone are insanely good. Delivery has always been pr","useful":0,"cool":0},"iaWk80CQGFpnsIMKlpH0Lg":{"text":"While the food was amazing going down, it made my entire bridal party sick. We did eat it ","useful":0,"cool":0},"QJy7HHS8ECs3gX6VNQuqsQ":{"text":"I knew this place was new and the menu seemed delicious so I figured I'd give it a try. I ","useful":1,"cool":0},"mCew8vizMpAOYYICGK_FRA":{"text":"We came here because it was close to the WW2 museum and we were surprised at how delicious","useful":0,"cool":0},"lPVkQMD-sWWr02hq4yIkBQ":{"text":"This was the BEST PIZZA I have ever had!!!! A must visit!!! Friendly staff Awesome in Hous","useful":1,"cool":0},"yQY-2NvNK4YMJ82h2_EXrw":{"text":"Delicious, we first order a chicken and bacon canzone, the next day we order again. Great ","useful":0,"cool":0},"n9VjMhN09n-Lv8LV9FV0Lg":{"text":"pizza is so good but very inconsistent lol. i normally order my pizza and usually get some","useful":0,"cool":0},"dZS0bsEYNxAjhn03L4PIqw":{"text":"My total fav pizza delivery place. Here's what I suggest; Philly Pizza add pineapple. Or h","useful":1,"cool":0},"cs7tCky1wSeDI1-cBp3qAQ":{"text":"I've had sime really good pizza and this is one of thw best!  Small place with good food.","useful":0,"cool":0},"agSTFsEYNMauaocKiOe_7w":{"text":"This is quick, but last month I ordered a sandwich from here and it was awful. Not worth i","useful":2,"cool":1},"JkXoihvVFyJuRWkdbuJlAQ":{"text":"Good stuff. Delivery was on time, Magazine Supreme pizza was fantastic","useful":0,"cool":0},"ZDo4oygi80vYkzmJPGVjkQ":{"text":"Online ordering and delivery = win!! The pizzas are a bit small (used to 9 inch NY slices!","useful":0,"cool":0},"27gDFeK6kNKj405lzVh4bQ":{"text":"Delicious!\nI kind of wanted to go w/ 4.5 stars here because the delivery did take quite a ","useful":7,"cool":3},"ov6WOWY9mSSONBtrbebE4A":{"text":"Ordered shrimp pizza and the shrimp/crawfish pizza. We also ordered the turtle cheesecake ","useful":0,"cool":0},"L0A0Yjxv-9E40cc5wdW9EA":{"text":"Wow this is a no go! Especially if you like to eat in clean, friendly places with good foo","useful":0,"cool":0},"k2A_sSCPgbyyb25H-F3W0g":{"text":"Worth a try. This is no chain. A great local pizza delivery place. If I lived close, it wo","useful":1,"cool":0},"YKG2vjqAVBhMeCuKZffamw":{"text":"Great spot. Had the gyro-one of the best I have had and I have had a ton. I liked the touc","useful":1,"cool":0},"JciE0dTNuYd0PzG_WdBYlQ":{"text":"I tried this place for delivery after receiving their menu at my hotel. Based on reviews, ","useful":0,"cool":0},"_K5pdqL0Uc-5WUkJI1I3kg":{"text":"after reading the other reviews, i was skeptical about trying this place. i'm glad my boyf","useful":0,"cool":0},"cdaNO4AvZodhQQRo9gYgNw":{"text":"Pizza was nice. We did take out. Yet, there is place to sit and enjoy your pizza. The pizz","useful":1,"cool":1},"5GFlapCvdL64Ksus_Grt6Q":{"text":"Of all the places we enjoyed eating at NO this place basically provided a nice retreat to ","useful":2,"cool":1},"IleLULQCzaWepkE5VRyHDQ":{"text":"Ordered Magazine Pizza to our hotel room on Christmas eve - not sure what to expect - and ","useful":0,"cool":0},"MdAIxqGPHiGO0e0IcvRO3Q":{"text":"So good. we had the BBQ chicken pizza and it was excellent! the ranch dipping sauce is som","useful":0,"cool":0},"k1mo3xmLPUp2jMTkNtuawg":{"text":"For me Magazine Pizza is great if I don't feel like cooking that evening. I absolutely lov","useful":6,"cool":1},"-Nc4MxGIezGgJCKWzveKYw":{"text":"For Daisy in the elevator - we ordered a plain ole' large pepperoni pizza. The crust was t","useful":0,"cool":0},"wS87DrR0sCxdjo9RxsmLXA":{"text":"Just as an update, I made my order and had it delivered at work.  I brought my substantial","useful":4,"cool":2},"9LipSsa8aSLyJZBi_5Ienw":{"text":"We got a menu in our mailbox a month ago and decided to try it out... Best Pizza Ever!!  W","useful":3,"cool":2},"0Upe_o8FPoka6krKdoP13w":{"text":"Oh my god, y'all, pizzas come with a cup of ranch dressing. It's like Magazine Pizza has t","useful":7,"cool":5},"FqFskiiEIJBUUOGqgqNXdw":{"text":"Horrible. The pizza sounded delicious so we ordered two pizzas. Our food didn't arrive unt","useful":0,"cool":0},"nXosYMaLwaoG-4f5UBcVNg":{"text":"As others have mentioned - menu showed up on our door and my gf decided to give it a try. ","useful":0,"cool":0},"dCyHWnwuK8Z9l_p0NSv9KQ":{"text":"We were pleasantly surprised by this gem. Went for lunch and had the salad and sandwich co","useful":0,"cool":0},"b6RkvwG3bhKdjYJJOdLF-Q":{"text":"When my go-to pizza delivery place started changing their menu for the worse, I did what a","useful":12,"cool":5},"ZFBL5aSKn69aQD73Q31ZVQ":{"text":"Pizza is delish!!! Must try! Cheese sticks are full of cheese. Caesar salad was very tasty","useful":0,"cool":0},"TvLSH-zrvmFwTjJDqK2VVw":{"text":"I live like 5 blocks from this place. I ordered a pizza and while I was still waiting an h","useful":0,"cool":0},"iYELeCml99d5BW0ZoqFdaw":{"text":"Magazine Pizza always takes care of their service industry promoters, and a thumbs up to t","useful":3,"cool":4},"sgt9ZFzpDPsQp2Kyu-dppg":{"text":"Just got into New Orleans and Magazine's menu was on every floor of our hotel room. My fri","useful":1,"cool":1},"-BOguPQ83z3aricMLJvREw":{"text":"Placed delivery order, ordered 3 pies one of them was not what I ordered, they sent out th","useful":0,"cool":0},"K2-jtUIEculEk3Gh-lxbEg":{"text":"Delivery took over 90mins on a Monday at lunch time, and the pizza was cold when it arrive","useful":0,"cool":0},"o5WhKktHl49qeKQCldGpZA":{"text":"Heed all warnings inside of these negative reviews. So let's get started...first off I onl","useful":1,"cool":0},"1Iqo-gmdN58LdCxQhU11zw":{"text":"Pretty basic pizza, nothing special, crust or sauce not great. Ok on ingredients. It's on ","useful":0,"cool":0},"RLPs7_LmGKPCf3wcUvKMCA":{"text":"Visiting from Katy ,TX !!! Pizza was amazing  and pesto sandwich was delicious , I will de","useful":0,"cool":0},"A2N14nvkOgb3v54ip-Pf6g":{"text":"Haven't even got my pizza yet... Ordered two hours and 15 minutes ago. Called once, direct","useful":2,"cool":0},"d3xWE--ed2CflC8Nu9sK_w":{"text":"The avocado chicken wrap was delicious! It was so good I came back the next day to get ano","useful":0,"cool":0},"9jWdX8h8W9qIuK_4AkcYkg":{"text":"Nice little place, I had the Mediterranean salad with nice fresh ingredients. It had fenne","useful":0,"cool":0},"g_scqFld7--02xGwP1bUFg":{"text":"I went really late at night on a Saturday night and let me tell you, GOOD PIZZA!!! I hate ","useful":0,"cool":0},"nMyKpA3SJztbSfIl4Qug7g":{"text":"The hang over I'd the ticket!!! I know it sounds crazy corn on a pizza but just go with it","useful":0,"cool":0},"FizelZf0o-1FMGMRs5tejg":{"text":"Great service. I live in LA but my boyfriend lives in New Orleans, and I wanted to do some","useful":0,"cool":0},"P6Lul9zMELkpcso7Yztapw":{"text":"So it took 70 minutes to get a pizza that lists at $16 and costs you $25.  On top of that ","useful":0,"cool":0},"n2Un0V6D9WMsKNTOw-aVsg":{"text":"Great doughy pizza!! I tried the BBQ chicken and was really impressed. I love the thicknes","useful":0,"cool":0},"p92_Ac3ATXcufIXFyLFQSA":{"text":"Me and my family really enjoyed all our food and the fact that da food didn't take long fo","useful":0,"cool":0},"86FxkmmB5HN7UXr8lPknRA":{"text":"It was okay. Ordered margarita pizza and pepperoni pizza. The margarita pizza was too chee","useful":0,"cool":0},"6CJ4DsFAEqVFZCPGBuyVXw":{"text":"Tried to order a pizza online and the minimum order was $15.  My large pizza with toppings","useful":2,"cool":1},"tqKlkmWt56FiCDniMGS_8w":{"text":"UPDATE after two hours the pizza arrived it was stone cold and they forgot the salad!!!!\nB","useful":0,"cool":0},"F8Xbi9b5EFpYQKRez3Nyog":{"text":"I ordered this pizza while visiting New Orleans and had it delivered to my hotel the pizza","useful":1,"cool":0},"Zg3XITpg5hIk0dLt-jSD3A":{"text":"The pizza was unique and tasty. Delivery was 10 min sooner than expected. Driver called to","useful":1,"cool":1},"7k2fCygoax_U3NrHnBnWxw":{"text":"Just got my order delivered from Magazine Pizza.  Service was prompt and super friendly, a","useful":3,"cool":0},"wSJGn5gn3dpVfJN4xyE2LA":{"text":"Ordered three pizzas online for delivery to my job. Everything arrived as ordered. The reg","useful":1,"cool":0},"l-PCOdfinT6UdClo4qB54A":{"text":"Rather ordinary. Created my own 10\" pizza and while expensive the toppings were bland.","useful":1,"cool":0},"rOydrHQzbWFN4h3x-rfNwg":{"text":"This pizza is delicious! Super fast delivery. We ordered the cheesy garlic breadsticks and","useful":0,"cool":0},"wb_JiYewY8vGIVDc6Ycuzg":{"text":"Ordered 2 pies. Good pizza. Thin crust is not like the wafer-thin crust elsewhere. It is m","useful":0,"cool":0},"lIIxePR_GeqAscaYGQWCsw":{"text":"The pizza was delicious even my fiancee and son was impressed. I most definitely would ord","useful":0,"cool":0},"dwuLlhCcxy4aDYCwSgAPpA":{"text":"Very good. We ordered via Uber delivery to our hotel when too exhausted to go back out for","useful":0,"cool":0},"Xi7hw8oKerWcTzwvmAYJEQ":{"text":"After having a horrific experience with a local Dominos Pizza tonight, I did a yelp search","useful":0,"cool":0},"6Wm5f7YokaqFy-_AzI5CdQ":{"text":"They deliver hot, good pizza when you order it, unlike their competitors at dolce vita. Ma","useful":0,"cool":0},"5CN1HzxKs0OlDWbe5_zxsQ":{"text":"the best pizza ive ever ordered after 10pm. in fact, best pizza ive had in my life. and th","useful":0,"cool":0},"usGv6EoijOxEp-IDpHNQxQ":{"text":"Customer service was good minus being on hold for at minimum of five minutes, but I'm sure","useful":1,"cool":0},"eISAxiGlj2VuxSkYN9xHNg":{"text":"Had delivery from here to our hotel room & couldn't be happier!  First off, they said 45-6","useful":0,"cool":1},"U14NEb0NtYjVOJ3tXwlsZA":{"text":"Why eat pizza when you visit New Orleans? Magazine Pizza is why. \n\nThe only reasons this i","useful":0,"cool":0},"cpzmsyxATMfaRbzmN5H69A":{"text":"Delicious food chicken parmesan and Phil cheese steak are so good I've been working around","useful":0,"cool":0},"9QOcpuDbGpYfI-IO2R4hWw":{"text":"A surprisingly good pie with vegetables galore, the Aphrodisiac set the stage for a sultry","useful":0,"cool":0},"OK5xaiMfUbXRPIlKU8uYmQ":{"text":"Pizza actually tasted good once I could figure out how to heat it up in the hotel. Trust r","useful":0,"cool":0},"dYrPkkDCDN7l50yZOUYG-g":{"text":"We did not eat here because wheelchair users are not welcome. They are located across the ","useful":0,"cool":0},"RpRBKfJLbrgssjg5b_71Wg":{"text":"Your pizza is terrible. I'm sorry, but it's true. How the hell do you skimp on tomatos on ","useful":3,"cool":0},"NOuS_jZIfWvmK91t0nPcXA":{"text":"I would like to just thank Magazine Pizza for saving me from alcohol poisoning first and f","useful":0,"cool":1},"35dvUIITi3R8ZDzvT7moaQ":{"text":"This joint exceeded expectations. Placed a delivery order thru Yelp. Process was smooth wi","useful":0,"cool":1},"V5oSJlkErxNK7WsPZhWJTQ":{"text":"I ordered from this restaurant while staying at the Springwood Suites on Canal Street, the","useful":0,"cool":0},"YNrU00M5LlLqoRhMVkm3Lw":{"text":"So good! House salad great and Hawaiian pizza amazing!! I just picked the food up and the ","useful":0,"cool":0},"UcwQQzijtj-hOsM1x7B3jA":{"text":"Great food.  Pretty nice menu selections. Wife had calzone and I had the grilled shrimp sa","useful":0,"cool":0},"m9Fv6fM58v0qLbVDaOwjQQ":{"text":"Absolutely amazing pizza!!but don't forget about the salad,the magazine salad with fresh b","useful":3,"cool":2},"8KOPrxFrETtDS8Mm7zMyGg":{"text":"First time using the delivery option through YELP. Extremely rude service. Hung up on me w","useful":0,"cool":0},"DdweO_DWFwIYrUhOBBQEAw":{"text":"I love this place. I miss it when they used to have a location in Mid-City. But since I'm ","useful":5,"cool":2},"I64e7kElZ1v3SnW90yam8w":{"text":"I haven't had pizza this good in a loooong time.  It was well worth the walk to get there ","useful":1,"cool":0},"vUCaMlY8C2qji0ikJep_tA":{"text":"Great place to grab some food just outside the National World War II Museum. They have sin","useful":0,"cool":0},"Y9oeroGvRK0o6GdepflkOA":{"text":"Great food at a reasonable price. Order at the counter, then pizza was delivered to the ta","useful":0,"cool":0},"EkU5U2t97IkG6u5_U37PPA":{"text":"Really tasty pizza!  The crust is nutty and chewy and the cheese is fresh mozzarella. Grea","useful":0,"cool":0},"PNc5FjkB8PpY2l1ji55fJQ":{"text":"I think their pizza tastes pretty good, their crust is better than others, and their ranch","useful":2,"cool":0},"2rEnZNWPCpPU9gy4yosWUw":{"text":"Always a pleasure to eat here. Never had a bad pizza. Staff always nice. A must in Nola","useful":0,"cool":0},"m5zfgPAGOtB1vGz3cS0CMg":{"text":"Yum! Let's just start there, yum! We ordered delivery to the Hilton Riverside hotel. It ar","useful":0,"cool":0},"9qkmRcRRYYvjeOIi2xlPaA":{"text":"The pizza here is awesome, is one of the best I've eaten in my life, no lie. Definately re","useful":0,"cool":0},"Kja6CKPakm_in7vu0Ffejg":{"text":"Love, love, love this place! This my husbands and I go to pizza place. The pizza is always","useful":0,"cool":0},"CSqNRlHjCkcYu3GAazcN4A":{"text":"Your basic late night pizza place, with various meaty and vegetarian options for your pie.","useful":2,"cool":1},"GqTCSGh0arcyPHB2KU41fw":{"text":"We chose this place for the great reviews. It took over 2 1/2 hours to get our pizza deliv","useful":0,"cool":0},"tC6WQuZNtcaEZrTUPt62PQ":{"text":"Pretty good. It's a little inconsistent, I like the Margherita Pizza but occasionally it e","useful":1,"cool":0},"0zbmVKeN0dFeW-x3zlhe2Q":{"text":"Always excellent! My order is always right and delivered hot! They have roasted garlic whi","useful":0,"cool":0},"Oj4T26IKuxBQ0CKYa7Wsjg":{"text":"This is our first time in New Orleans & the food has been very good everywhere we have eat","useful":3,"cool":2},"rQGpgrjQ-OvRvpYZks-dxQ":{"text":"BEST GLUTEN FREE PIZZA I'VE EVER HAD!!!!!! They always have fast delivery and friendly sta","useful":1,"cool":0},"vnPf_3Kur-wP4sJYwFsm3Q":{"text":"Originally came here during the French Quarter Festival and loved it.  The Cheesy Garlic b","useful":0,"cool":0},"g_g1HEcCgEP_Mu7sdMu_Yw":{"text":"Super casual, order at counter and sit and eat type of place. Pizza was okay - definitely ","useful":0,"cool":0},"9qNZJT4vWwt4oXVPjCEUrw":{"text":"Great pizza! The delivery arrived way ahead of schedule and it was excellent! Definitely l","useful":0,"cool":0},"U2kkwL3Ejsh8BEgpZS6IMA":{"text":"The quality of this place has gone down the crapper. Been ordering and sending business to","useful":0,"cool":0},"6l_mi64BCdPAC2UoH8SAzw":{"text":"The grilled shrimp pizza was fresh & absolutely delicious. I will definitely return on my ","useful":0,"cool":0},"03jBCfmQFfkIzmh3NxgVMg":{"text":"For decent late night pizza delivery, Magazine is the place to call.  Mediterranean and It","useful":1,"cool":1},"PFRUaXxSFOmruaf7qwtOQw":{"text":"Cheesy bread sticks are to die for! Pizza wouldn't be my #1 choice here but it's definitel","useful":0,"cool":0},"-ZD1gcUafs5B24j9uXKQjw":{"text":"If you like frozen crust, frozen cheese and conveyor belt pizza... This is the place for y","useful":0,"cool":0},"SbCNqzb-0Vr0VqKDcJ8c4A":{"text":"We ordered a Aphrodisiac Pizza thru Yelp Delivery, and although there was some confusion o","useful":1,"cool":0},"wUj_FuK0jYVnHdfkIRtfCw":{"text":"Ordered a very simple salad and pizza with plates and flatware. Was told 45 minutes, had t","useful":0,"cool":0},"6y3BiMnP9Y3t3Jyxgte-KA":{"text":"Had a pizza delivered to hotel in Convention Center area last nite. 45 min delivery time a","useful":2,"cool":1},"f9aOVAyMXynFeCY6kFK7fA":{"text":"The order I placed on 2/9/2019 was the best pizza, wings and salad (and chocolate cake) I'","useful":0,"cool":0},"mvaf8K7fusxTJgnYKMDCnw":{"text":"Upping a review from 3-4 because I just ordered from them again (they are open late and de","useful":0,"cool":0},"E_Ok2QGzmLbsnB_PdcHG_w":{"text":"Good, quality pizza. We ordered the Macho-Man and the Margherita pizza. Solid choices. Nic","useful":0,"cool":0},"P34JJyA4virK4u6xb33kTw":{"text":"The pizza was thicker than most Nola pizza shops but the sauce tasted like frozen pizza sa","useful":0,"cool":1},"Sriiqq4-6xzjJCunK1JcKg":{"text":"The best pizza in New Orleans, love the Mango salad,  also fast efficient delivery personn","useful":0,"cool":0},"kQujiLQNMiwppov5PQqA_A":{"text":"We ordered pizza delivery late one night.  We got a pepperoni pizza & wings for the 4 of u","useful":1,"cool":0},"_mnCXvKdmIlqSs8ew4jfWA":{"text":"Okay, so I had every intention of taking a picture of this massive calzone before diving i","useful":0,"cool":0},"EGZ9gIUmmQsl3PLaiycpCA":{"text":"One of my favorite places to eat pizza in the city. Great location and they stay open late","useful":0,"cool":0},"Xa8NJrDtq1sc31FkVY16jw":{"text":"Strange as it seems for city renowned for its food, great pizza is not so easy to find in ","useful":1,"cool":0},"HYGIXofNCUZkQXZzMcSQ7A":{"text":"Hairnets needed. Pizza delicious. But less hair woulda been nice. Not saying like a hair. ","useful":0,"cool":0},"S5exhWdp9wG5cLJxLgu0Og":{"text":"After my initial review I was contacted by customer service. I ended up speaking with the ","useful":0,"cool":0},"oTjQTRQtqAM5sqPxSXNtLw":{"text":"It was Tuesday night, I ordered delivery over the phone at 6:30PM, and he said there would","useful":0,"cool":0},"1j26dQF6APLPpjarx9dmAA":{"text":"We ordered a create your own pizza. Honestly, I think this is the best pizza I've ever had","useful":0,"cool":0},"R-bF7RvQSgAjt5AhB64a2g":{"text":"Nice selection of pizza.  They have a small but clean dining area.  I had the spinach and ","useful":1,"cool":0},"iS6ed_0EmpylCuoe4SiKqA":{"text":"Great margarita pizza. It's not a traditional margarita in that it has more cheese and a t","useful":2,"cool":0},"jcH7N4vTB1Mu_xOkY3fXiA":{"text":"Pretty good pizza. Liked the cheese. The crust was just ok. Prices were fair.  Probably wo","useful":0,"cool":0},"zdBXwV5psW7KeOBZ_Y8rpA":{"text":"I'm so glad I stumbled upon this place! Needed a quick break from museum sightseeing and s","useful":1,"cool":0},"1_bqdVKnSYZXq-WrPwfTAQ":{"text":"Came in on a Wednesday afternoon after touring through the Ogden museum of southern art. O","useful":0,"cool":0},"s_4--gX9MdG8VgmBAi61pA":{"text":"Really good, basic pizza. Good, quick service, too. We got a large, thin crust supreme. Of","useful":0,"cool":0},"FWv_6fX-ZGOVAuOhwl4LJQ":{"text":"Excellent pizza. We had the small supreme. Great for two people. The pizza was tasty, and ","useful":0,"cool":0},"6UQwiRsDk7L30H5clwCzlA":{"text":"Good Pizza when you need a delivery and you are sataying at the windsor Court.","useful":0,"cool":0},"komwrb7f69CrL1twBqNqWQ":{"text":"The whole experience was absolutely awesome. Super friendly staff, laid back atmosphere, g","useful":1,"cool":0},"CtjIEjkphojDGvNf3pyERw":{"text":"This place is a quaint little neighborhood joint. Everyone is very friendly and patient.\nP","useful":0,"cool":0},"nx9vzN5k_JRcKtGKtUG2jA":{"text":"Six stars of I could!  Staff cool and professional smiling naturally.  Food impeccable.  D","useful":0,"cool":0},"pBF82GxTu4eldD83WE2NYw":{"text":"It was just ok pizza. I think Pizza D has me spoiled. I did love the amount of cheese used","useful":0,"cool":0},"mAPfz-lU9HkVRPtc0FPVGQ":{"text":"My favorite pizza shop. My pizza is ALWAYS fantastic. The mango-cado salad I fabulous and ","useful":3,"cool":2},"0h5KRV6kSLNjQiAbfdTa4Q":{"text":"I stopped by here for a quick dine-in pizza after a visit to the WWII Museum down the stre","useful":1,"cool":1},"uPHoYDy6ykT7x7cLFlkVyg":{"text":"I was traveling and researched best pizza delivery. Magazine Pizza was still open so I ord","useful":0,"cool":0},"7Jhe06goSPwamMd83EiCuw":{"text":"We were visiting the area, and a flier was in the drawer in the kitchen, so we looked at r","useful":0,"cool":0},"vcfXg8t0NIQtmjd_yNCTBA":{"text":"Pizza and breadsticks were great. They delivered earlier than expected both times we order","useful":0,"cool":0},"HfpcxDKpDc-8PIvHKI6ITA":{"text":"A little caveat here for you guys and gals who are reading this review. I am not a fast fo","useful":5,"cool":3},"37YTQgb9H13lknuA3QLhUg":{"text":"We were on the muse tour and dropped in here for a quick bite to eat. We only had chicken ","useful":0,"cool":0},"q_MmO4Xr4xePPKLiG7_H9w":{"text":"Outstanding pizza and service. We stayed at a nearby hotel and ordered 2 large pizza the f","useful":0,"cool":0},"SLTWZLnLPGsN_oYEh6z7cQ":{"text":"Ordered delivery through the Waitr app food was very good, very flavorful. I had the chick","useful":0,"cool":0},"mtuIGQeE6WoOfcAppv29tQ":{"text":"Along with my wife, I enjoyed the Mediterranean pizza last night.  Unlike many pizzas, eac","useful":0,"cool":0},"XuuQrSx6ULFx_Wj9xy3M9Q":{"text":"Girls night!! We ordered the lagniappe, magazine supreme and gf Philly. This was my first ","useful":1,"cool":0},"bL3_G_O58obF4SmyyfIeRA":{"text":"omg. delicious! pizza was made just right, fresh everything. \n\ni dont live in nola but i c","useful":1,"cool":1},"seAARQJ8Vz_eZW9Ojxni-A":{"text":"The Pizza was good, but it would have been so much better if we received what we actually ","useful":0,"cool":0},"LsdsE6A4P6JbNuJ9agHkLQ":{"text":"The Blanco was magical! I thought the garlic would be minced.... NOPE! Beautiful roasted g","useful":0,"cool":0},"ZSiTI_5maqMEM6lrYICVhQ":{"text":"I was a little worried after reading the reviews about delivery problems, but we totally l","useful":0,"cool":0},"eQ0XMdSwB1ar52H21hanWA":{"text":"Tried the supreme pizza. Lots of toppings but no flavor\nOnly tasted the cheese. The crust ","useful":1,"cool":0},"kRCzXUBJaeWSTzAGG9P5fA":{"text":"Ordered a large pizza and cheese garlic sticks with garlic butter sauce. I was told my foo","useful":0,"cool":0},"Bn8pRaB9ty9EKsYgj5cqog":{"text":"I don't know if I just had the drunk-munchies or what, but Magazine Pizza hit the spot! We","useful":1,"cool":1},"cNLp68H_sjgnlwa1hEkTCQ":{"text":"Visiting from out of state & craving pizza. So happy to find one that delivers gluten free","useful":1,"cool":0},"1ezTTuvEUBEQHLPFZbFzPg":{"text":"Still waiting for our pizza it's been over 2 hours. Ordered through grub hub, so ALL they ","useful":0,"cool":0},"O6jBWmEA0T_PaBCRyJT2tg":{"text":"I know this place very well, been coming for a few years now, and it's absolutely one of t","useful":2,"cool":0},"aMd5IGz3G28LuctmIZxKlw":{"text":"I ordered delivery to the hotel from here twice while visiting New Orleans. Amazing. We tr","useful":0,"cool":0},"SVuS9str4EulCO9_gHvQNQ":{"text":"We were visiting New Orleans, and we needed a night off , so we found Magazine Pizza first","useful":0,"cool":0},"ujVehqAhXINXNNgXNN4wTA":{"text":"Love this pizza. I work downtown on Poydras and this is the only pizza that I will order f","useful":0,"cool":0},"jFHqlZFefL4qX_nG5v-4lw":{"text":"After waiting 2 hours for my delivery because I had to call and check on my order since th","useful":0,"cool":0},"wmAYJUz-T-QFjVnGmD4Itg":{"text":"Quality food and pizza, makes a nice lunch after seeing the local attractions. Shrimp and ","useful":0,"cool":0},"jiKOoz3awvpMB19RDw0S8g":{"text":"Such delicious pizza! We ordered it to our hotel after checking in around 10:30pm. The piz","useful":0,"cool":0},"wCLPisCi6EU16f1HQIFASw":{"text":"Best pizza in New Orleans. The service was super great. Our cheesey garlic bread came out ","useful":0,"cool":0},"bzjmx9yvgr_FPM5oB7-DUw":{"text":"Some family from out of town was going on a cruise and their boarding was in NOLA, only an","useful":1,"cool":1},"yUhfhozmYyzvKLCBERIt6g":{"text":"I ordered a small pizza from delivery. The toppings were good and I liked the roasted garl","useful":0,"cool":0},"E7BFgvZBRGX2qGxWcuIEtw":{"text":"I've loved this place so long, I can't believe it's taken me this long to review it. I hon","useful":0,"cool":0},"iKubxaT_SOk40LF1DENPkw":{"text":"One of my favorite pizza places in the city.  They have a variety of pizzas that'll satisf","useful":0,"cool":2},"yBfGHK4eJ7jf6VN9QuohVA":{"text":"Damn, best gluten free pizza I've had to date. (No idea how their regular crust stacks up,","useful":1,"cool":0},"TtizUltkgFGKPjdl6fX72A":{"text":"I ordered my pizza and was told that it would take 45 minutes to deliver. I said that was ","useful":0,"cool":0},"MO_YiVqB45t54AqYp95L-w":{"text":"Food was amazing but their customer service was even better. Family and I visiting from ou","useful":0,"cool":0},"Hrse-Im0BYHy-E-Q0a5BhA":{"text":"Fantastic pizza. We ordered a couple of pizzas for delivery. Both we delicious and arrived","useful":2,"cool":1},"stSaqev3YFMVKju_R5J6Cw":{"text":"Only pizza place I've tried in New Orleans they delivered and it was delicious so give it ","useful":0,"cool":0},"CnE58BoJhE1gzxlDNHhHlg":{"text":"We ordered pizza for delivery and were very pleased. The pizza tasted great, delivery was ","useful":0,"cool":0},"2gRx2w4ZNcetbmmS88Twgw":{"text":"Monday night. Ordered pizza at 10:26 pm. Here it is 11:38 pm and food is still not here. I","useful":0,"cool":0},"hRrm-4ZlAG0oodR4QYlnnA":{"text":"Pizza is good! Nothing special and it was the best place to eat considering the location. ","useful":0,"cool":0},"zT-F0RYF5_Uu27AGFxjWSQ":{"text":"Best pizza I have ever had. It comes with the best ranch dressing I have ever had. And one","useful":2,"cool":0},"1oiUdVkHMyRc3I5t2MYl1A":{"text":"Came in town to go to the museum and wanted to go somewhere close for dinner. So glad we f","useful":0,"cool":0},"L04rbYqX06k58zRKJL-Izg":{"text":"Love this place! We order to go from here all the time. It's always consistent and always ","useful":0,"cool":0},"bR2jTD-rXbSdVoIEkfw5iw":{"text":"The pizza was good. I got delivery. Not sure who they use for delivery but they got lost. ","useful":0,"cool":0},"O-W-t6W8cCvFXQvPBscMDQ":{"text":"Omg I just ordered a supreme and a meat lovers it was soooooo good extra cheesy and the cr","useful":0,"cool":0},"tph4Sdx10PWt9NiZ8OzERw":{"text":"I ordered a calzone with vegan cheese and made sure to stress that I didn't want any dairy","useful":1,"cool":0},"k-zCMO2S2TSpF-51WngXnA":{"text":"Average pizza at best.  Very little flavor or seasoning.  Bland.  Cheese did not taste lik","useful":0,"cool":0},"xzP0EvE7sE-tDYehBM94cg":{"text":"The food is great, I especially love the salad. And don't get me started on their homemade","useful":4,"cool":0},"ihXDCpcwZORkThdg8CzGnQ":{"text":"This pizza is good, but just once I would like the Margherita pizza delivered to have mari","useful":1,"cool":0},"EKrS6a7YZFQSrbPPykA8eg":{"text":"Incompetent delivery service that must be overworked because they can't get an address cor","useful":0,"cool":0},"atMHuVwE95ymv1In-LBSZQ":{"text":"Good pizza, fast and friendly staff.  We dined in after visiting the museum.  Absolutely r","useful":0,"cool":0},"ohT_kL6SGc9LxoVmffd-Hg":{"text":"Solid pizza at this hole-in-the-wall joint! Pretty small place, so don't be surprised if y","useful":1,"cool":0},"YcyXFEeyls5qazEAtIa4dQ":{"text":"Excellent pizza, fast delivery and worth the money! Try the Hummus, absolutely delicious!","useful":0,"cool":0},"w8trfVwwPgjtMQOVA2NFQQ":{"text":"Last night, the staff and I were starving.  So we decide to order delivery from this new p","useful":5,"cool":2},"l8yxziFK9YiiXAKqY4Wf0Q":{"text":"Excellent pizza!!! Good service!!!\n\nThis is just a short walk from the Convention Center h","useful":0,"cool":0},"6vFC8fWyRB0XB1_kxocQtQ":{"text":"Great pizza. Great sauce. Good prices. I've found a new place to add to my delivery option","useful":0,"cool":0},"lywdhytZ0VoQhw-9ScDpEQ":{"text":"We arrived in New Orleans late and someone from our hotel HIGHLY suggested Magazine Pizza.","useful":0,"cool":0},"5-nQtNkwfaUpxnm3zvSNmw":{"text":"I ordered my food at 3:15. I didn't get it until 5:11. I called the restaurant at 4:40 to ","useful":0,"cool":0},"1kbYrC4Bpyfws4foVSvs4g":{"text":"Tried Magazine Pizza for the first time tonight after remembering how great it smelled whi","useful":0,"cool":0},"y7Vt9DCk25NnEjH3yanWbw":{"text":"Had the Mediterranean pizza. It had a very rich, cheese and sauce. The meat was delicious.","useful":0,"cool":0},"uXnHna7KdZFrgaF0t0gndg":{"text":"Delicious, crafty pizza! \n\nWe ordered two pies for delivery to our hotel. First off, yes t","useful":2,"cool":2},"VIZ5d835hXWMD2SGaD22Iw":{"text":"We ordered while we stay at the Hilton Riverside. They delivered within 15 minutes. The fo","useful":0,"cool":0},"GAIOffwHwcQPKDuQKzX8zg":{"text":"Expensive, bland rip-off pizza. Order dominos, Papa John's, or pizza hut for better pizza ","useful":0,"cool":0},"Q-u3P6ScaFpTQ9hSZsHPyQ":{"text":"This was the worst pizza I have eaten in my life. The lack of flavor in a sauce, the bread","useful":0,"cool":0},"FoHGMEGT2TpfdKjH15E2vQ":{"text":"Wonderful pizza and super fresh salads. Their menu is extensive and offers sandwiches and ","useful":0,"cool":0},"xx5KBK1w5ODpu8IBGiN68g":{"text":"Delicious pizza and great salad! We did takeout so we could bring dinner with us when we w","useful":0,"cool":0},"i01oRG4Lnp8HBfCd_aVecQ":{"text":"Worst service ever. Ordered and received it one hour and 40 minutes later. Cold food and m","useful":0,"cool":0},"WduogRTpLwBdwYN_Dk7PJg":{"text":"This is THE WORST delivery place I've received in my life!!! I would NEVER recommend this ","useful":1,"cool":0},"qYLuxqP80emYkPu5m12GrQ":{"text":"Amazing pizza and salad! Absolutely the best Cesar salad dressing I have ever tasted. Fast","useful":0,"cool":0},"r0fF8bdI2lNqtofoyLvhmQ":{"text":"GREAT pizza, great hours, and phenomenal that they will deliver to your table at The Rusty","useful":0,"cool":0},"nxQUbHkrwbkoEJJ5ori9Fw":{"text":"Looking for food after a long day the one catch. we had taken out sleeping pills . The piz","useful":0,"cool":0},"fCI_cwtQ5kNVIaEmY_MaYw":{"text":"Wow \nExcellent pizza  \n\nRiley and Lane were so helpful\nIt is a big selection of choices fo","useful":1,"cool":1},"P3g_5Sm1cS6iObgIxLb4Gg":{"text":"This place is a good option to eat at if you're trying to save a buck from already spendin","useful":2,"cool":2},"JzumGfPnHEC1cKkDnwauTg":{"text":"I order for delivery, arrived in less time than anticipated and everything was piping hot ","useful":0,"cool":0},"fhiAPpXQcqJG04wuuK2OWw":{"text":"After the WWII restaurant gave us a ridiculous wait time for lunch... we boogied down the ","useful":0,"cool":0},"f3eUuDroiaJSxd8hY4McYw":{"text":"I have been waiting for 2 hours. No food. Was told it is on the way. Called back 30 mins l","useful":0,"cool":0},"Ojc_FuW18Son6pupUdn7tQ":{"text":"Consistently delicious and always on time or early with my orders. The spinach dip with pi","useful":0,"cool":0},"dV33q5rq_WRcPSVMenQ-dg":{"text":"It's hard to beat this pizza.  Their ingredients are fresh and they deliver promptly.","useful":0,"cool":0},"JxicvzC_VCwxZOElOl7f6Q":{"text":"This is literally the best pizza ever. My roommate is from New York and gave it his stamp ","useful":1,"cool":0},"eui3Nu9B54A0wdoxmvpIFg":{"text":"In a place like New Orleans, this business is a misfit. This is because the food is substa","useful":0,"cool":0},"AkPTC4tlAqqqJRdsncm4PQ":{"text":"We had the BBQ chicken pizza, amazing. My son had the chicken Parmagiana sandwich and i ha","useful":0,"cool":0},"PJ6utd4MRqvloR1V67paiw":{"text":"I stoped in yesterday to pickup my food , the cashier guy ( older white male) was really r","useful":0,"cool":0},"EPmLE_h_r1OCgO6hrgA0aw":{"text":"Stopped at Magazine Pizza with a couple of friends for a bite to eat around midnight becau","useful":4,"cool":0},"iUoJ0Lt-YTD8NTXhO2ZLsw":{"text":"Best margarita pizza I've ever had!!! I've been ordering this pizza for delivery for years","useful":1,"cool":0},"vqAE_rxdKm9ODm_VbRvPng":{"text":"Awesome pizza! This is the perfect place to go when you are touring the World War II museu","useful":2,"cool":1},"dwffODyM9Hh5WxJE01hueA":{"text":"Crappy pizza, ordering and delivery was fine, but this pizza is not worth $25. Lacks flavo","useful":1,"cool":0},"i8xEkj9VQQ3A5sOg975IuQ":{"text":"We enjoyed another fine lunch today after visiting the World War II museum and so glad we ","useful":0,"cool":0},"EByPgYOkKPNz5C76AK7h9g":{"text":"The service here was HORRIBLE!!! We got a call that our pizza was ready but then waited fo","useful":0,"cool":0},"4nl_NP7kmrr7C3X9QTW7VQ":{"text":"This place delivered food to me my first night in NOLA. The delivery dude was literally on","useful":0,"cool":0},"7PUinzGkUu8cAbLny0H4HQ":{"text":"These guys brought us an EXCELLENT calzone to FQRV resort right on time 10:30 pm. Shocked ","useful":1,"cool":0},"EdZNa7Iiw3lqtziGLvumfg":{"text":"My first visit here ever. I got a cheese calzone. It looked a little odd, but it tasted OK","useful":0,"cool":0},"L8tUeqSE9lZYc0KaSawlVw":{"text":"I know times are tough but it's disappointing when you get 2 out of the three things you o","useful":1,"cool":0},"d5fMNpGG6_AZ2BcIun3OWg":{"text":"Ordered in.   chicken pesto pizza\n\nNice and garlicky :)","useful":1,"cool":0},"7V3-gbENCO8352SWTYV2eg":{"text":"Yay for magazine pizza feeding those on the frontlines in the ICUs during this pandemic. T","useful":0,"cool":2},"-fhztITSPSZa4fiw9SCeYw":{"text":"Magazine Pizza IS SO GOOD. Their half sandwich half salad deal is insanely worth it. 10 do","useful":1,"cool":0},"F1T89LgFhK2NR2jgNkXZKw":{"text":"We order from Magazine Pizza  late at night when there are few options. The food is decent","useful":0,"cool":0},"l8CwmoPzx5LUqOwzVQKMEw":{"text":"By far my favorite neighborhood pizza joint!  Their homemade ranch sauce is AMAZING.  Whet","useful":0,"cool":0},"bgOWM1nPtpfA5pj8hFyj-w":{"text":"Ordered thru postmates cause corona. Got a bunch of things but the Greek salad? What a nic","useful":1,"cool":1},"8jD7GkbeaVSmQkX2aDnpUw":{"text":"Ordered two pizzas. One was difficult to eat because it was so salty. The other was missin","useful":0,"cool":0},"DbZZb9Y_4w7K5Z8R2GinsQ":{"text":"The pizza was very tasty and hot for delivery.  Will order delivery from here again!. My s","useful":0,"cool":0},"MvElgdZvXgev0b0SKy9vZg":{"text":"Great place that delivered to our hotel in the French Quarter. Quick service as it was del","useful":1,"cool":0},"bOAtdqCR7H9PeH7hEbHwsw":{"text":"Me and my wife order pizza at 9 o'clock at night we paid and we made it until midnight and","useful":0,"cool":0},"89ngL8fd4_hlwPwX77ksJA":{"text":"Delicious multi cheese pizza and spinach pies capped off a busy day in New Orleans. Thanks","useful":0,"cool":0},"rCQExumPr0uZAEHIEEv_fQ":{"text":"I was starving when we came to eat here. So, let me tell ya it was delicious. Sadly, My hu","useful":0,"cool":0},"DMY4ZSRfUKCH_FhMX05XNg":{"text":"Wow, this place is great. The hotel recommended this place and it didn't disappoint we eat","useful":0,"cool":0},"2Uk4ttX_OTsJmbpH-L_WHw":{"text":"Great pizza spot by the World War 2 museum.\n\nWe started off with the baked mozzarella stic","useful":2,"cool":0},"BgfP-MhbZTTi8YGcrfVjAg":{"text":"The pizza is fair. The owner yelled at me for parking in front of the restaurant. One Mard","useful":2,"cool":0},"5wfsdl-1MflyvrqVyuiAIw":{"text":"My guy asked me one time what I wanted to eat for dinner and I answered magazine pizza. He","useful":0,"cool":0},"EGb3d5pplPNnUiqfAbTAYQ":{"text":"Granted, it's New Years Eve, but this is what we got delivered tonight. (Opened the box an","useful":2,"cool":0},"hPfsloSDoKm5dXhxa8yMvw":{"text":"Must have caught them on a good night because our experience was solid. We are visitors to","useful":0,"cool":1},"6IZ5nn93avFlDrwZ4iagAQ":{"text":"Small pizza place, big taste! This was delicious. The wife and I shared a calzone and pizz","useful":1,"cool":0},"GUcxzDgGLxojDd8g5BZtPQ":{"text":"Ordered my husband delivery because he is out of town and this place had good reviews but ","useful":0,"cool":0},"ivHBavBv7qxuo-egewYmmg":{"text":"Frequent visitor to the area, and have always seen this place pretty busy so I wanted to g","useful":0,"cool":0},"SSdwZgGhMZKnM9nSpIFJfQ":{"text":"Just ordered carryout from here. Waited around for 20 minutes since they were weeded. Come","useful":7,"cool":1},"t49SZVkf4dvA0mnhq3OI3w":{"text":"Late night hunger pangs, too many shots and the need for something cheesy! Thank heavens t","useful":6,"cool":3},"turhZBILsDLTidwthbe7ew":{"text":"We needed a spot to eat near the WWII Museum and we chose Magazine Pizza. The owner was ki","useful":0,"cool":0},"0lNTvEd1xhEdYHaqj-gs-g":{"text":"If you are Gluten Free and craving pizza, this is your spot.\n\nI've always loved it here, b","useful":1,"cool":0},"NHHvS0D3kZzkUMBR3d3oMQ":{"text":"Pizza is amazing, staff is always so nice, and delivery is extremely quick. So far I've ha","useful":0,"cool":0},"gKHKibCqoSyNZS3kumH5LA":{"text":"Lunch pizza by the slice was cold. Caesar salad was good but the slice didn't seem worth i","useful":1,"cool":0},"sJ6vaOuLr3qrc1t9-PoCag":{"text":"We're in New Orleans with all this great food and my two teens wanted pizza. Go figure. I ","useful":1,"cool":0},"Kzxaz5OZmTV5s9TpzAHRDQ":{"text":"So I'm working restoring power to New Orleans working all day couldn't eat the slop that m","useful":0,"cool":0},"a0fNqb1E5flXiJrpJ5yGhA":{"text":"BOOM!!! The Farmers Pizza in thin crust with Shrimp is amazing... This is one of the best ","useful":0,"cool":0},"yL0xCCHtgCSUfASW1Z9Y4g":{"text":"Really good pizza but like most pizza joints in New Orleans crust barely has a yeast taste","useful":0,"cool":0},"8uDnuxIdGjI7vbSxWmeIiQ":{"text":"Delicious pizza! Pepperoni Pineapple was great as well as the white sauce & shrimp!! 10/10","useful":0,"cool":0},"DWU4Kghp2qtlkdNjX1TG1g":{"text":"Cute little place! The sandwiches are huge. The magazine Special was delicious. I really w","useful":1,"cool":0},"SURfuFHxM17l4kqC6X6glw":{"text":"The Macho Man was so good!!! The crust was just simply amazing.  Highly recommended.  The ","useful":0,"cool":0},"_qoP2Yat7TNPXLCZgSc4ag":{"text":"I ordered for delivery through Yelp, which uses Eat Street. After waiting for more than 1 ","useful":1,"cool":0},"6XfDWdEHii7DwliE1lQ-9g":{"text":"We enjoyed an early lunch today after hearing about their great gluten free pizza! I thoro","useful":0,"cool":0},"ezNIkiswr_yV-sYtdldYoQ":{"text":"Ordered a large Blanco add Italian sausage and jalapeños from these guys last night. DEFIN","useful":0,"cool":0},"EnCR6tDG4F2XHPKls2iuzA":{"text":"Staying at Hilton Garden Inn NOLA on St. Peter's ordered Large pepperoni, mushroom & Black","useful":1,"cool":0},"P3fsqocCI1QwvehUZ820tA":{"text":"Great place! Pizzas were too good and the staff was friendly too:) we ordered a chicken pe","useful":0,"cool":0},"wZa6b9GWaSzQAnTiW_yJmw":{"text":"Well damn it all folks that was a nice pizza. Ordered the Hot Mama, and it was a perfect l","useful":2,"cool":0},"2woOWM-v1tVGyBzIFO2vrQ":{"text":"Really good pizza but super disorganized. Long wait times on call in orders. Good pizza th","useful":0,"cool":0},"qOC0RLoglsnc0aKZBC-EJQ":{"text":"We made our own Large pizza with their hot sauce, sauce and it was AMAZING! So good!\nWe al","useful":0,"cool":0},"Xm0yDjGr1BEBO4pKHahyRw":{"text":"Very disappointing to say the least. It took over 1 1/2 hours to get here while I was in t","useful":1,"cool":0},"RrMkIBLxdG6hjDMvflPeow":{"text":"Amazing calazone! So good it was gone in a blink of an eye-no time for a picture.  I had t","useful":2,"cool":1},"3ZXL9GuDNvoWEAbeYMShRw":{"text":"I wish I could give negative stars! I found this place close to our hotel. They have glute","useful":0,"cool":0},"MNzifsp0_sUfqdhP8FdhfQ":{"text":"Food was ok, service was subpar. Ordered the avocado chicken sub, waited 20 minutes for my","useful":0,"cool":0},"MQi5M7Oav2iykJJPcfwOZw":{"text":"Our Lyft driver suggested Magazine Pizza to us on the way from the airport. We stopped in ","useful":1,"cool":1},"FlNcfQ7lHzqWLxtmC9VMiQ":{"text":"Love these type of places.  Next/under freeway crossings. Found it because we made rIght i","useful":0,"cool":0},"z0s6Jt4lrPVwRL6QPJDjsw":{"text":"Ordered a thin crust Pizza to be delivered... essentially a Margarita w pepperoni...\n\nReci","useful":1,"cool":0},"xcj--4idmHt7WmEZ8Zz2Jw":{"text":"Great take out, never been disappointed. And as a service worker I appreciate the late ope","useful":1,"cool":0},"nmO-rfYTAwkXOyqdInUAuA":{"text":"Pizza is super greasy and the crust is soggy and gross. This place litters the whole city ","useful":1,"cool":0},"R-1tK7pXIRrb1LINDRpcUA":{"text":"My first visit here ever. I got a cheese calzone. It looked a little odd, but it tasted OK","useful":1,"cool":0},"PWLowJ6Gcf6MzWSH-KZ5Rg":{"text":"So, ordered two large pizzas! Delivery guys shows up with two small pizzas. Ummm why would","useful":0,"cool":0},"TKH2j1HZaGgijz0PoGgWGg":{"text":"We had a pizza delivered to our job tonight. This is how it arrived. Unsharable, messy... ","useful":1,"cool":0},"ZV3_r7qhCR--Oc3h6u5iAQ":{"text":"Pretty good pizza.  I prefer the gluten free crust to the regular crust. it's nice and cri","useful":1,"cool":0},"7drB6PCx004TMyuMbO8QjA":{"text":"Came in c lutch when we drove in to NOLA around 9pm and not many options. We shared a whit","useful":1,"cool":0},"81tWsFE8uq5raeZxjAelIA":{"text":"Excellent pizza highly recommended.  The pizza has the best crust I've eaten in a long tim","useful":0,"cool":0},"NUZ0QAQV9upwxMdIygKxrQ":{"text":"Wow! Ordered a piZza at 6:50...we were told 45 minutes to an hour..2 hours later..I called","useful":1,"cool":0},"JU5LfFgSYBngDo3AGZhH2g":{"text":"In town on business and this was recommended by the front desk person at the hotel. Ordere","useful":0,"cool":0},"BpCbZLU7yNQWjJ0r3qWUfw":{"text":"Everything I asked for on my order they didn't do. Lousy didn't even get marinara on my ch","useful":0,"cool":0},"3QkuKQnfkaEcOvUcvhm3uA":{"text":"Dear Magazine Pizza,\n\nI'm a long time customer and supporter of your restaurant, long befo","useful":1,"cool":0},"57oE3rgUhL3mJQZ8-_Qe5g":{"text":"One of our favorites places to order pizza for a Friday night . The Hot mama and macho man","useful":0,"cool":0},"VaIaZsv10K8kiSxMpYENXw":{"text":"Magazine Pizza has got to be one of the best pizzas I've had in while.  The white sausage ","useful":2,"cool":0},"e03iN0h6ppV1i0Z7kinj5w":{"text":"Great gluten free pizza. I like the build your own toppings options.  Easy online ordering","useful":1,"cool":0},"TZEOxuAG0OFwOGzVv16jRA":{"text":"Love this place!! Magazine pizza is easily in my top two places for best pizza in the city","useful":0,"cool":0},"E56kAWXqkNYojPucuPTZOA":{"text":"If you are tipsy and hungry in New Orleans this in the place for you. We stumbled upon thi","useful":2,"cool":1},"yVwzoQxhtqhEvbvZB6JvNw":{"text":"They deliver! BEST PIZZA EVER! On Wednesdays they offer buy any gourmet pizza get one 2 to","useful":0,"cool":0},"IotxD-JaDuh8P8uNlQcxHg":{"text":"In the words of Miranda Sings.... \"Delichious\"\nDon't believe the bad reviews. They lyin.","useful":0,"cool":0},"Mj6o8COPchaN5zmfB-olvw":{"text":"This spot is one of our go to take out pizza locations.  Customer service is great - they'","useful":0,"cool":0},"nkhowyGjGwOdOiglVQfpnw":{"text":"Love this place! The pizza is consistently fresh and flavorful. I ordered the Magazine Sup","useful":0,"cool":1},"Mnl60tWliyq0cZtPhxZqUQ":{"text":"So... I received a menu on the front gate of my home. Decided to give it a go...despite th","useful":4,"cool":1},"cxdGqRy2Vi2H9_7pI2wu8w":{"text":"So I decided to try this place after a family member highly recommended it. I ordered a sm","useful":2,"cool":0},"eQPVWRKJOjAawsNwXvenEw":{"text":"Pizza was very good, the crust was slightly crispy and fluffy and soft inside, just like I","useful":1,"cool":0},"Kn0aSUSoCyzKCcQAbk7jhg":{"text":"Updated- we ordered Magazine tonight again after trying a couple of other places to compar","useful":0,"cool":0},"wycQmKz8Okw_ad1gzUgn2w":{"text":"Ordered contactless delivery and had no issues. Pizza was pretty good. A good local spot i","useful":0,"cool":0},"5vCyCk0-M0DWB1NV-yQgaA":{"text":"Convenient location for a quick slice when visiting the WWII museum. The pizza wasn't bad ","useful":2,"cool":0},"wYgB72WieS9mEAocx7LlWQ":{"text":"Some of the best pizza I've had in a while. Not greasy, not too heavy, the crust was plush","useful":1,"cool":0},"N7xRobRNsldMmd1P8wC4fg":{"text":"This review is for delivery. The pizza arrived nice and hot and the salad was very fresh! ","useful":1,"cool":0},"7U4Qk-s9eKoSNkP1lYdQLQ":{"text":"I am on vacation staying at my time share, after walking around for hours I was so happy t","useful":1,"cool":0},"owpmJHMGteCueOen_yz_SQ":{"text":"I really want to love you. Maybe being a New Yorker is clouding my judgement. Or maybe it ","useful":4,"cool":2},"gou-A-YcD2YTihKynLWfHw":{"text":"Hands down best pizza I've ever had. Got the gf hangover pizza and devoured it. However, i","useful":0,"cool":0},"7ZHpd1W8frDpgcohR2lD8Q":{"text":"My job orders from this pizza place all the time. It usually is good, so I decided to trea","useful":3,"cool":2},"ztetTVSwyXQMoiyRGP0sBw":{"text":"Cozy little corner restaurant, great service and great food. My group all got hot sandwich","useful":0,"cool":0},"OyJPoHXjRtetMH7pQoRm2w":{"text":"We visited this place because there wasn't much else open on a Thursday night around 10pm.","useful":1,"cool":0},"TgEQXq-jz4YjYufw1Dad5A":{"text":"Got a supreme pizza delivered in a very reasonable time, but it was simply okay.  After sp","useful":2,"cool":0},"aW9-m1D-C5QoPHib0QhEiQ":{"text":"There was a problem with the order. Staff was very rude on the phone but the cherry on top","useful":4,"cool":0},"miAnLL9d0VSKC2IWx4OZTQ":{"text":"While at the Rusty Nail for the Saints vs. Eagles game we saw people bringing in pizzas fr","useful":1,"cool":1},"Bs_nX1zolZyjCiHG8PvDQg":{"text":"Just ordered from magazine pizza The pizza and everything we ordered was really good Not a","useful":0,"cool":0},"VZYH9-HxmRVLrZQkVcmxCQ":{"text":"Really great pizza shop! We found this menu on our doorstep and it had some coupons so we ","useful":0,"cool":0},"oyfeNmIKvrTR1vKW1z-3Yg":{"text":"I ordered the gluten free crust and was amazed at how delicious it was. Thin and crispy an","useful":0,"cool":0},"cTRFkce_NWLngMah7hiqGA":{"text":"I can not say enough AMAZING THINGS about Magazine Pizza  it's the BEST NY STYLE PIZZA her","useful":2,"cool":2},"oKmyGhcBwyRYMGPNPVIxgw":{"text":"Had the Mediterranean let me tell you just trust me go there get this and prepare to be bl","useful":0,"cool":0},"9nqyzuWesYH96lrtaMgaJQ":{"text":"Bad pizza with poor adherence to COVID-19 safety precautions. My partner and I ordered a c","useful":1,"cool":0},"HAO0Sbv2zszayx2w4PC1TQ":{"text":"It's there in case of an emergency... Being gluten-free, the fact that they offer this opt","useful":2,"cool":2},"BfJsLDYV_5tuSznzvxAMRg":{"text":"Lagniappe pizza is so good. Great service. Very consistent, ingredients always taste fresh","useful":0,"cool":0},"61FkebMsb4fR887hLd-hAg":{"text":"The pizza was really good & was as expected! The delivery was faster than expected! I was ","useful":0,"cool":0},"nqqniei0PbfMQj28D5pjag":{"text":"The pizza and cheese sticks were VERY mediocre . The food lacked any  real good taste.","useful":1,"cool":0},"JA_IuL3szOPI3Jl50JIwog":{"text":"I ordered mozzarella cheese sticks and spinach dip with garlic bread. The delivery was gre","useful":0,"cool":0},"LyN0SU3YKwZyKj64c9rQjw":{"text":"First time i ordered food was great, fresh and hot. This will b my second time im excited","useful":0,"cool":0},"EG6KSNolU2eeBQ12c5Ye7g":{"text":"Great pizza but one of your staff members was racially profiling. I sent my black male fri","useful":0,"cool":0},"5o864HJwuw0XFCB98OehLw":{"text":"We ordered late night but the restaurant didn't close until midnight so I had plenty of ti","useful":0,"cool":0},"kaxg1BTPe0QR1yquKX_TWg":{"text":"There is nothing worse than a restaurant that has great food and poor customer service! Th","useful":1,"cool":0},"dMynGXj1Ss2EEw4kYocePw":{"text":"I got the macho man (pepperoni, bacon, ham, beef, Italian sausage) on gluten free pizza wi","useful":1,"cool":0},"XO2I1wKMO1H1v0GfPmNzAA":{"text":"Tastes about as good as Smashed ass! Horrible No Flavor . I live in Chicago and know what ","useful":1,"cool":0},"rJNHswZqaNEgN2wJP5WljQ":{"text":"We were looking up healthy pizza joints around our area and decided to give Magazine Pizza","useful":1,"cool":2},"upNP6Gc-vq7RoWBstqwemw":{"text":"The pizza and service here is awful!! I was called about my pizza being ready, but when I ","useful":0,"cool":0},"oQraef1fMhdH8DSFooquQQ":{"text":"Awesome food! Great place for delivery!! Pizza is delicious and their salads will surprise","useful":1,"cool":1},"jZXlEoYqsWlUDIgUrr_Dig":{"text":"Dear reader - allow yourself to visualize the perfect chicken parmesan sandwich. The chick","useful":2,"cool":0},"0YMwYCy5Q5TnXu_q7P-ULQ":{"text":"Great pizza! Since everything is closing by 10 (almost everything) and we just got to New ","useful":3,"cool":2},"znFYRVS3sJ0ayPS1mlG-wA":{"text":"I ordered delivery as it was recommended by the hotel I'm staying at, rookie move. We orde","useful":1,"cool":0},"vT-1GbS7snQ0yZU91DuX7g":{"text":"Pizza was fresh and visually pleasing but I struggled with just how much goopy cheese ther","useful":2,"cool":0},"_ms6YGJchd20a_FZgmpanA":{"text":"Gluten free crust is pretty darn good. But they forgot the pesto on a chicken pesto pizza.","useful":1,"cool":0},"FvPaIY_jO_kCqzNHq5Jkig":{"text":"What I like most about Magazine Pizza is besides their delicious pizza, is the friendly st","useful":1,"cool":0},"ZkyunCV3u4-kBi5_y-0hqA":{"text":"This place is Great, ordered deliver thru doordash. From NYC, difficult for me to get pizz","useful":0,"cool":0},"u_r1ZNmK81ZnwpHi9bSzAg":{"text":"So Magazine Pizza had free delivery which was nice, and it tasted pretty good. I will say ","useful":0,"cool":0},"RF0B9UtjWjc1U7Lj1CtP5A":{"text":"I got a pepperoni calzone. I ate about 1/4 of it and found only 4 pepperonis. It was also ","useful":1,"cool":0},"3-7N5ARKeLPScuDeujnKJA":{"text":"Great pizza! Philly sandwich was amazing as well! Service was friendly, and overall clean!","useful":0,"cool":0},"srI4w1w5oMiEH9UwLvAmTQ":{"text":"This is my absolute favorite gluten free crust in New Orleans. I've been gluten free for o","useful":1,"cool":0},"-lpARPjSXdY3jWMHZ5gAow":{"text":"Great pizza! A bit on the cheesy side . The Mediterranean salad was very flavorful and fre","useful":0,"cool":0},"MRryWKLCQBdWugI3MMnfHw":{"text":"Yummy. I ordered delivery and i forgot the drivers name, but he was really nice and very s","useful":1,"cool":0},"oWScvx0mm7S2vQXOF408lw":{"text":"This is our go to pizza place! All of their pizzas are SO GOOD, but we usually go for the ","useful":0,"cool":0},"AasrYquy_1E_8xx0fEqO9g":{"text":"Was in town and family was wiped out and did not want to do fancy dinner we had planned. I","useful":1,"cool":1},"wEF5i8_F4rCGrRiIZ3Is3Q":{"text":"These people should be ashamed of themselves. I visited New Orleans and after a long car r","useful":0,"cool":0},"ypkCwVSi7WhCW7eQjKbXTg":{"text":"Ordered delivery on GrubHub. The food took longer than it was supposed to (over an hour) a","useful":0,"cool":0},"MaxRAX-Bs14HqTm-FAHdAw":{"text":"This review represents a sit down visit only....I stopped in on 6/14/14 with a group of fr","useful":8,"cool":5},"ROH1YU18Ih92gWi7Dy0UeQ":{"text":"Close to home, close to my heart, magazine pizza.. let's NEVER PART.\n\nI always get carry o","useful":10,"cool":5},"Rh0kags7Epdj9VWZ6sN2vg":{"text":"It's good pizza! The ingredients seemed fresh (we got the farmer's market), and the crust ","useful":2,"cool":2},"OV6XJUuY-OdCqJ23vKxrGQ":{"text":"We fell upon this place on our visit to New Orleans when we wanted to late night food.  Th","useful":3,"cool":1},"btXSuXgjb0soyygzX5f3SA":{"text":"After calling 5 pizza joints for pizza delivery on the 4th of July, the 5th told us to cal","useful":1,"cool":0},"dSErfUBxmQSHgkF1HeXNpQ":{"text":"Pizza was doughy and chewy. Toppings were excellent but pizza poorly prepared. Gyro?  Y'al","useful":0,"cool":0},"8mO2UlT_Fhcq86_CUtiiuw":{"text":"My first visit here ever. I got a cheese calzone. It looked a little odd, but it tasted OK","useful":14,"cool":5},"7SjfYkuxJ-nhGX4DQgDhJw":{"text":"casual nola pizza place! the inside is fun and vibey and they are so quick. we ordered onl","useful":0,"cool":0},"FvFmW3wIBs_xS5D-PE7hUg":{"text":"I really like this pizza and would give it 3.5 stars if I could. It is just a little too h","useful":1,"cool":0},"O_KikL3zhf2FXnyymPHgNg":{"text":"I always see this pizza spot while I'm either walking or running.. I heard it was a must t","useful":2,"cool":1},"9_U_KxcUqVi91am46vZ82g":{"text":"Friendly staff, good pizza. Super reliable place to go for pie. They get 4 stars instead o","useful":0,"cool":1},"pQK_66_ri5GnC4aHp6GrmA":{"text":"The pizza's not bad, but the atmosphere, rather lack thereof, and service, here again, lac","useful":7,"cool":0},"fCH0SIttx8Sk4Q3RgyOOyg":{"text":"Ordered delivery to a local hotel\nPizza was cold. COLD. Not room temp but COLD. \nThe fries","useful":0,"cool":0},"tSIC3XY6aYtbIGahMJMi7w":{"text":"Magazine Pizza has a great selection of Pizza. I had the Supreme less the olives. It had f","useful":9,"cool":2},"TeTBQNOyMz-Ocr9ohLbi5w":{"text":"This was the best pizza! Monday night after hours on the Orpheus parade route, my friend a","useful":2,"cool":0},"tqj0_O8T70s65Qq0-cVn0w":{"text":"I got the vegan pizza and it was great! The crust was good and I felt they were pretty gen","useful":0,"cool":0},"lR6TC2gQx3euUDPVaACBTQ":{"text":"I love pizza...in all assorted varieties. I adore the charred bits on a salty, hand tossed","useful":2,"cool":1}}