{"NW-fG94ud_xNey8unrS0Ng":{"text":"Holy moly! This place is INCREDIBLE. I came here based off of a recommendation from a foll","useful":1,"cool":0},"-l2x_oIAPMNY_367ekasQg":{"text":"Terrific staff, tasty espresso & phenomenal currant sorbetto! The chocolates we tried were","useful":0,"cool":0},"0TCMdvkzfbqn0CmrirqYhA":{"text":"Decadence and sweet are the two words that can best describe this joint in my opinion. If ","useful":0,"cool":0},"nj_x8DTdL9xH62HK7U68YA":{"text":"New Years Day.  We made it through the rain because website said open till 10pm.  When we ","useful":0,"cool":0},"id9ddovV1mq983oJWzAfVQ":{"text":"This was my first time at this specific location. I usually frequent the one in Metairie b","useful":0,"cool":0},"Cpq42JGGFsVXsvLCcTjU2A":{"text":"The vanilla eclair was TO DIE FOR.  This shop was recommended by our waitress over at King","useful":0,"cool":0},"_PnFkNLRB9t6NWaQUxHioA":{"text":"Looking for an evening place for dessert in the French Quarter? This is it! Macarons, homa","useful":0,"cool":1},"Z-yopRvBaPNHAKK00XF_eA":{"text":"When the offerings are bite sized, you can rest assured it is more expensive than your ave","useful":6,"cool":5},"uGA3FA9KaNoDYUPSJRUlKg":{"text":"We went there for a light lunch and left extremely happy. The chicken salad sandwich was d","useful":0,"cool":0},"xdw_ncN9wjhmATHAAG5Bzg":{"text":"Great experience for dessert\nFriendly service.\nDecent coffee.\nMade a perfect rainy afterno","useful":0,"cool":0},"7aPT-1rkwC8p-6hS4Vbc6A":{"text":"I had visited Sucre years ago during my first visit to New Orleans and didn't realize ther","useful":2,"cool":4},"e0gf2NcTHrNghWukPMvUvA":{"text":"This place has an amazing array of sweets.  The ladies working when I can in were friendly","useful":1,"cool":1},"AOmiXM-U3-AiweJliNlpSg":{"text":"The cutest little dessert cafe located on the bottom floor. The staff was so incredibly ki","useful":0,"cool":0},"D57crapDLWRljnmMXhMofg":{"text":"The best cupcake I've ever had. My hubby had the white chocolate bread pudding and he was ","useful":0,"cool":0},"hwDXNwFAefgXV4vUy7IqFw":{"text":"Delicious!  They have a little something for everyone.\n\nWe tried many things and they were","useful":0,"cool":0},"0pye-pj7uyVUv0I9ONhBGg":{"text":"Good gelato flavors and fancy pasteries. We had a few different things here, and while non","useful":0,"cool":0},"EwqwIIydlABEhxfgATpstw":{"text":"prices were a little high but the only place i was satisfied when ordering the macarons be","useful":0,"cool":0},"HVckcT8dZw8NpwInGiKvtQ":{"text":"Great vibe, great service! Pastries are decent! Would definitely recommend the hazelnut ge","useful":1,"cool":1},"LY_Wg7lDN_YRBOseh-GAaQ":{"text":"Macaroons are delicious! They have a bunch of variety for their ice cream sundaes and some","useful":1,"cool":0},"CZHxTWziwrxeRsIqq0zyYw":{"text":"Yummyand coffee. Best macaroons I've ever had, moist and so light. I could eat the every d","useful":0,"cool":1},"w34dztBFwL3SghrNXY9LPQ":{"text":"We walked into Sucre about 8:30p on a Thursday and there was a long line. We walked around","useful":0,"cool":0},"MiaOcjuFpWvgHDXCqnJisQ":{"text":"In NOLA for a birthday celebration.  The bday man loves chocolate,  so this seemed like a ","useful":0,"cool":0},"GKUsqG85VQalQcXeRCawBQ":{"text":"Service was great. It was so difficult to choose, all the desserts looked fantastic. Facil","useful":0,"cool":0},"ZhwoSlJNVqqIE0uu1-22bA":{"text":"We didn't visit the salon upstairs but we did patronize the hell out of the boutique downs","useful":0,"cool":0},"PTkyagNt1EgycyDpYbE1dQ":{"text":"Came here for dessert after dinner. The store supposedly closed at 10 and my group of frie","useful":1,"cool":1},"xvLfGQdAcMf8hEYq2Ytogg":{"text":"Very pretty patisserie! Nice atmosphere. Kinda pricey. Macarons were pretty good, but not ","useful":0,"cool":0},"tJtJtLak2JmEXe8sOWRddg":{"text":"When I went in they had a variety of treats. It all looked good but didn't seem very fresh","useful":0,"cool":0},"VYEPvFpWzw9l-e18zPsvOw":{"text":"The baked goods and ice cream are as beautiful as they are delicious. There are lots of op","useful":0,"cool":0},"QILl_68fYq-C2ttmZw8Jkw":{"text":"Amazing. Get the coconut basil gelato. However you really can't go wrong. It's awesome to ","useful":1,"cool":1},"gWrbCRAtZ9jtNRPdmKFBVA":{"text":"We ran in to grab coffee and a quick breakfast this morning. We ordered a muffin, coffee a","useful":0,"cool":0},"ruWScPUO7i5qEAAZ19U4Fg":{"text":"That the staff can be as friendly (or as sweet) as the pastries and gelato was a delightfu","useful":0,"cool":0},"Nz-60a-8e7Q7aRI7tWLh0A":{"text":"This place was the perfect pit stop for us after a tiring stroll down the french quarters ","useful":0,"cool":0},"r9Glpz9vye8A3SVeQiDznA":{"text":"NOLA /bourbon street was great, but all of my friends agreed that this is the reason we'd ","useful":0,"cool":0},"bPT2W7VM3Sn6hH_zuX0cMQ":{"text":"We stopped by during our weekend in New Orleans. The decor of the shop and the variety of ","useful":0,"cool":0},"YrHVazuyO6V-I2P1Bw7HZg":{"text":"A little pricey. But they have the best macaroons and the rose petal and pistachio candy b","useful":0,"cool":0},"iWTG85Qw6Jw3o3eBrDw6ww":{"text":"So good!!! I got the s'mores skillet with a scoop of King cake gelato. The s'mores skillet","useful":0,"cool":0},"aiiuoNyjGQudE2hSop-wqg":{"text":"Customer service was awful. Was not handed my food. Had to go up after they were all confu","useful":0,"cool":0},"sCCQFfO-j-g0sE_aJiCXQw":{"text":"Great selection of gelatos and treats. My Peanut Butter Crunch gelato shake was superb. Th","useful":0,"cool":0},"PUfo81HYIY7E_QLYarKRWg":{"text":"Best customer service ever!!  I accidentally ordered a cake for a friends 50th bday for th","useful":1,"cool":1},"nacB-Dgf86Um72UBb-mJdQ":{"text":"great chocolate, gelato and macaron. beautiful packaging, too.","useful":0,"cool":0},"Tml7QaWvR-s-CbAgGJUqQg":{"text":"Loved this cute little bakery! I was here last Thursday and we ordered a bunch of desserts","useful":0,"cool":0},"-jTFw6dn8ZhF8OKMNLZ7eQ":{"text":"I was in New Orleans and we stopped on our last day. We wanted something sweet and couldn'","useful":0,"cool":0},"qujNSnjO_UwN21N8gwVDTA":{"text":"Reona is such a fun girl to be served by. She makes amazing gelato flavor suggestions and ","useful":0,"cool":0},"QMaNEFwGZDck_zIQhmqKBQ":{"text":"Overall I would say the pastries were eh, but the gelato was delicious. The atmosphere was","useful":0,"cool":0},"u2YQiX9rEnCTi8HrgVxznA":{"text":"i ordered the signature sucre sundae and it was the most beautiful and fanciest sundae i h","useful":0,"cool":0},"3tpWuCEhki14R68odgjQPw":{"text":"Hubs and I stopped in while in town and loved it. He said the cookies and cream gelato was","useful":0,"cool":0},"yTqo2IvFzgO7AQZdRPXT_A":{"text":"The environment is nice\n\nThe desserts were beautiful, but they were abit too sweet and mon","useful":0,"cool":0},"-fIpRiD3gPKd3GcUO-OZpQ":{"text":"Good gelato...great selection of flavors!  Certainly did not disappoint! Quick service!","useful":0,"cool":0},"7mTeVurtI0JLh2LtVXGM7w":{"text":"If you go and you love pistachios you have to try the Sicilian pistachio chocolates! I als","useful":0,"cool":0},"yR36SqDki1eBWiiFskv6Sg":{"text":"The bar and restaurant above Sucre is about as lovely and charming a place as you could fi","useful":0,"cool":0},"5eCyz_zsx4Rsz8bC1iVAYA":{"text":"Came here for dessert after a lousy dinner at another restaurant. Luckily it wasn't packed","useful":0,"cool":0},"z5W8JInnbzKjMFp-tqoLvA":{"text":"I love it here. Perfect location, very chic decor. I ordered an almond milkshake and it wa","useful":0,"cool":0},"_4nxGMdiiQIW_5t6AQeG4w":{"text":"Everything we had was amazing! Workers were really nice and helpful in choosing the perfec","useful":0,"cool":0},"XPGXPisEKnS0FK_PXUM9XA":{"text":"We came here twice, once for macaroons and gelato and then again for the eclair. Both time","useful":0,"cool":0},"Ptiw7xcafWjig-hV2CGhRw":{"text":"Spontaneous stop for dessert.\n\nFOOD//\nThis is a biased review b/c I only tried the eclair.","useful":0,"cool":0},"7G_M4FQyr4DJ1wXhmH38Fw":{"text":"Nice atmosphere and delicious cupcakes. FUNFETTI CUPCAKE was my favorite. Samantha made us","useful":0,"cool":0},"i876tUcjwr2aYsfapK-mcg":{"text":"Best dessert place! Owner is very charming, informative and friendly. Has a restaurant ups","useful":0,"cool":0},"mGbvH0sCYT2_9eONxJ5QGw":{"text":"So glad I found this place. When you walk in it feels like walking into an art museum. Eve","useful":0,"cool":0},"7f6hOebzFPX-H5ltQX-qpQ":{"text":"I read some great reviews about this place and so we came in on Sunday morning to grab som","useful":0,"cool":0},"RIdJ_MnAa1wpnSDIJBNvbA":{"text":"My go to place for deserts when I am in NOLA! You feel bad eating the deserts because the ","useful":0,"cool":0},"39jARw7J6Bh7pW7Ixxid_w":{"text":"I visited NOLA in April for a wedding and I was dying to have macarons in the French Quart","useful":0,"cool":0},"aJRvs4Ks2IYXUMowZF8QgA":{"text":"Sucre is my New Orleans favorite sweet fix! The variety of macarons and fine chocolate are","useful":0,"cool":0},"0M1tBidwyzfXIWr9DckFaQ":{"text":"Some of the best desserts I've ever had!  It was like being back in Europe!  When you look","useful":0,"cool":0},"aygEcmuIj85HB1Bm0RmJjQ":{"text":"Stumbled on this sweet spot at the end of our first day in the city. Shared two desserts; ","useful":0,"cool":0},"wsFVDkzaP6WA7tuBJw1GJQ":{"text":"Great desserts! And opened up late too. One issue was there was no clear way to order. It ","useful":0,"cool":0},"dNWcJxa3ojtoDbSYg0IPRg":{"text":"Customer service was good as was their desserts. I generally rate dessert places by specia","useful":0,"cool":0},"FmyVPX156702fUIu8U5Llw":{"text":"The gelato here is delicious!  Try the raspberry or cookies and cream!  My husband can't g","useful":0,"cool":0},"aiDptx3wTK_Vx2L4lHOWWg":{"text":"Stopped in for a special treat and bought the Orange Berry Trifle to share. Wow, so delish","useful":0,"cool":0},"kHXRczxA4rJHvGb9C1y4dw":{"text":"Beautiful space with loads of macaroons, gelato, and other well crafted desserts. You can ","useful":0,"cool":0},"zb66zU8FIWUoe-7LY0LHwA":{"text":"Cute dessert place around the corner from Cafe Beignet. Great selection of macrons and ups","useful":0,"cool":0},"G9InQMrEHoN6G8nTg5jssA":{"text":"Amazing.. Best desserts in the U.S. Their menu is fantastic. I love how they pair flavors ","useful":0,"cool":0},"Uj_wd-Ic8w8xKByd8ttDgg":{"text":"Beat dessert in NOLA hands down. The Bakery in great, the ice cream is delicious, and is g","useful":0,"cool":0},"_DIYiQe-XkmgKyDAq2VL9A":{"text":"No trip the French quarter is complete without a stop here. The gelato is very flavorful. ","useful":0,"cool":0},"voBcQ2C7auVv1zOQVqgMNw":{"text":"4.5 stars really. What's not to love. The name says it all. The gelato rocked. If I was in","useful":0,"cool":0},"jRapo4_XTtvj6m0piwREDw":{"text":"Cute and cozy. Went on a spur of the moment ice cream craving. The price is a little steep","useful":0,"cool":0},"kvShDVBdP150fcEduuUwRQ":{"text":"This little place brought us back to our days in Paris! Not cheap, but oh so delicious. As","useful":0,"cool":0},"Q9lSIZ0ABZYTXMCxTqpzQw":{"text":"The gelato was decent, but the service left something to be desired. I heard the upstairs ","useful":0,"cool":0},"Emz7USoV_ieir6-0FQMjkA":{"text":"Great little dessert joint off the beaten path of the French quarter.  Luckily they are op","useful":1,"cool":0},"-KKSXR__txdzAGsR6dvCVQ":{"text":"It's hard to walk past Sucre and not have a desire to at least step in and peek around. Wh","useful":1,"cool":1},"O4V1syGDS8DIHEt06ipdAg":{"text":"Bad service and rude workers. Not helpful and short with their answers. Their King's cake ","useful":0,"cool":0},"rCcP_OR04PwVTOSmybzgGA":{"text":"Popped in here while on the run for a little pick me up. \n\nCold brew is fantastic. Little ","useful":1,"cool":0},"w5hf_c4Pc-jRb2BZCXQFrQ":{"text":"AHHHHH I could say so many lovely things about this place. They serve macarons, chocolates","useful":0,"cool":0},"W8r8JQMUI2qaFpZlUUUe4Q":{"text":"We stopped in here for some caffeine and AC on a hot and humid trip to NOLA. The aesthetic","useful":0,"cool":0},"-4ZjHdhhzQmDFvus_KfJGA":{"text":"Walmart bakery items at Tiffany prices.","useful":0,"cool":0},"woAvWHLMgyirBHFM_iAwyA":{"text":"We visited the French Quarter location last year and I still miss this cute little shop! T","useful":0,"cool":1},"_2cvQZGFicBSsbJFDYNYfg":{"text":"A real gem on a narrow street. We made the trek here twice. I think the selection varies ,","useful":2,"cool":1},"3Y5m9kyySeMJFxK1kprq6g":{"text":"A+ for the space and decor - very upscale looking dessert place but with a non-pretentious","useful":0,"cool":0},"XAjEas0otMg0N8AY2ZasNg":{"text":"Good macaroons, very rude staff- or at least Kelly.  Based on her this would be negative s","useful":0,"cool":0},"MV5AEa6tF6HeQshx-AT_uA":{"text":"Good sweets but over rated and over priced. Very stuffy vibe and I would rather go somewhe","useful":0,"cool":0},"iZdLZ2G7Sxze-Uci2Eoq4Q":{"text":"If you are a connoisseur of sweets, you have to visit Scure!\n\nTheir macarons are air-light","useful":3,"cool":3},"Pn8Y2_Ra3Hk9Dhu6DaloXA":{"text":"Insanely tasty and beautiful cakes.  So impressive! We had a big event that got moved arou","useful":0,"cool":0},"t2mDCdsiG5f_ODAvzAzqjQ":{"text":"Stopped in for some macaroons. I got a gorgeous u-pick box of 8 for about $17. Worth every","useful":1,"cool":1},"GUIAfin1egTFCSNDLfgQgw":{"text":"We went with a pecan tarte,  vanilla eclair, and salted Carmel macaron.  Plus a double sho","useful":0,"cool":0},"Tn__88o0Rqmy8tTbNx8gXA":{"text":"Loved it! Great items and awesome customer service! Very clean establishment and AC on an ","useful":0,"cool":0},"eFk7L-KX9Aw2QLh7PMgM6w":{"text":"I LOVED THIS PASTRY SHOP!!!!!!!! This is the cutest little shop in the French Quarter. Abs","useful":0,"cool":0},"xWKMcn_ZXPLJ4gGvGlEH6Q":{"text":"This place is very good... And the gelato is unlike anything I've ever had-- everyone that","useful":2,"cool":1},"FWJ_tH-8d0Ar_f3GcIYV0g":{"text":"This place is amazing. It was cold, so they let me try the coconut basil gelato (which is ","useful":1,"cool":1},"nsmQs16Kx-m-hiPYM3znrA":{"text":"Amazing confetti gelato. It was the best we've ever had. We also bought 8 macarons for abo","useful":0,"cool":0},"dv_phDO6INm4HMy0DJvOKQ":{"text":"This is a well presented store, the average desert price\nIs $7.50. We had the s'mores skil","useful":0,"cool":0},"fQ_it_sLfJAKH_w8HUTyiw":{"text":"One of the creamiest ice creams I've ever had!!!  \nAlso the macaroons here had the most pe","useful":0,"cool":0},"sFRDXlQFK0ERT7dZ1Ydszg":{"text":"We ate each and every macaron we ordered. Unfortunately the box did not refill itself.","useful":0,"cool":0},"yeLPfiKeKN7aqsjd6cBOwA":{"text":"Delicious desserts. We've tried few things, everything was great!\nMatter chef material","useful":0,"cool":0},"iKw2DrewFq5VK4t2sIIhFw":{"text":"The gelato was great in every way. The staff was very nice and greeted us promptly . I'm n","useful":0,"cool":0},"D-PVVLQAnpRpcvv_sG__Gw":{"text":"Apparently this location on Conti has only been open 6 weeks.  They are doing incredible b","useful":3,"cool":1},"uHDsh24YTwIbHZ0RAd7xMQ":{"text":"They truly do have the most amazing eclairs. I am also a huge fan of the macaroons. These ","useful":0,"cool":0},"0XAjFAfF72U22DB3Bc8cfA":{"text":"The desserts here are unbelievable. The though of giving this place 5 stars occurred in my","useful":0,"cool":0},"7qHJK9vHE2QgQ65zsZLzgQ":{"text":"I'd give it five stars for the food, but three for the customer service. My toddler wanted","useful":0,"cool":0},"G90ppBuRDX0KNIpPjUR5dw":{"text":"My husband and I stopped in here for a late afternoon sweet treat and were in heaven. I ha","useful":0,"cool":0},"dSxA89oQBhAST12dcNppsw":{"text":"This was the last shop I stopped by before leaving NOLA. I was a bit scared/saddened by th","useful":1,"cool":0},"qJHb3TwzFVlncZ5Wu51Etg":{"text":"I came in the morning for a pastry and coffee. The coffee was good, but the pastry was so ","useful":0,"cool":0},"syOpFV7heXmKhioN_ycLnQ":{"text":"Nice selection of desserts and there is always something on the menu that my family will l","useful":0,"cool":0},"lGtiEBqUk_5EzHoZPpZa3g":{"text":"Run, don't walk, to get their iced mocha. It is so rich and so delicious and it's probably","useful":0,"cool":0},"aRpXL8jZ8mpl6JK3qce-1w":{"text":"The environment is very professional and chic. It's a nice place to sit to have some coffe","useful":1,"cool":1},"PyfNMEldjACTbhWD42Uq4A":{"text":"I wanted something sweet to eat and a cup of tea and found this gem! The tea had a wonderf","useful":0,"cool":0},"1nKjMdaIA1jskfKd85Lfgg":{"text":"Wow, what a site. When you dream of pastry shops, this place takes the cake! Yeah I said i","useful":1,"cool":0},"iT6DRiCNrCQkGLtsxJOBsA":{"text":"Yes, the macaroons are ridiculously overpriced. I still think they're quite good. My mom g","useful":1,"cool":0},"ovIvP0SY42tfFOJGmxhVvg":{"text":"Cute local sweet shop. We got shorter and it was so good. Also got the eclair for later an","useful":0,"cool":0},"txXFhrey72ZU4TWk6GGDeA":{"text":"The desserts are really good and they aren't badly priced. I wasn't too impressed with the","useful":0,"cool":0},"YkBtrGV1htef5JwnM9rvWw":{"text":"Lives up to hype. Loved the goat cheese and pear puff pastry and the cappuccinos. Nice pla","useful":0,"cool":0},"wrTOq-oDwUgj-XG89zqheg":{"text":"My kids loved this place so much we ended up going there twice in 2 days. Macarons were th","useful":0,"cool":0},"h9FDv0H2IfFQVmITCPlmwQ":{"text":"Sugar overload!  I purchased the Richolous to go.  Enjoyed the sweet treat while watching ","useful":0,"cool":0},"AqIaMY83gDW8MeND1nEjOg":{"text":"Sucre is a macaroon shoppe in the French Quarter which has the most delightful looking des","useful":0,"cool":0},"UEKr5Y8GuXwLZsKdR2TIGQ":{"text":"I adore this place. It's like walking into Tiffany's where everything is edible, and they ","useful":8,"cool":6},"IHYrlyVDMDfJ_Tv3H1TyAw":{"text":"LOVE. Banana Foster. Macaroon!! Yum...eat up!  The staff was very patient and accommodatin","useful":0,"cool":0},"k5fbtQUAjoVVQcskJe-9aQ":{"text":"All the desserts are just beautiful! I got my friend a small box of mixed macaroons and sh","useful":0,"cool":0},"dYschlacxKHCXTkdm0afgA":{"text":"Omg currently having a food orgasm !! Yummy!! Best place to visit and get your entire fami","useful":0,"cool":0},"tzCmjYh4pg4ZK-CsiUON3Q":{"text":"Such a great little place! The eclair was delicious & they had the best sugar free gelato ","useful":0,"cool":0},"I9QiRpUAe4DKE7KMKpOmqg":{"text":"Loved our visit here. Had raspberry and triple dark chocolate gelato - yum! The restaurant","useful":1,"cool":0},"wPzwXd47z4kuL-YQtEuNzQ":{"text":"Loved the Monkey Business sundae with banana fudge gelato! Also have macaroons, multiple g","useful":0,"cool":0},"7sa2zbL4wA4s6Yqj9gHSQA":{"text":"Wow, the macaroons are AMAZING!  We found this place with luck.\n\nWe highly recommend it!  ","useful":0,"cool":0},"UmIygXp_XB_gVN11SkuLgg":{"text":"based on yelp user recommendations we stopped into Sucre. The shop is located right next t","useful":1,"cool":0},"SoZ-BO_ZiVRYEXeLi8spyw":{"text":"The prettiest dessert place, their desserts look like works of art. Had their gelato which","useful":0,"cool":0},"BT1R3ggvW6PHi7Y1TxFCdQ":{"text":"OMG macaroons as good or better than any in Paris. Not kidding. Everything else looked del","useful":2,"cool":1},"bHiDRqvHoFmrzuEz-HFqjw":{"text":"Amazing. This place is simply amazing. \nThe smores warmed up with a scoop of the delectabl","useful":0,"cool":0},"uUOAl1lmh9QREWbdr0HINw":{"text":"Just delicious. I had their limited time Butterbeer coffee, and I really wish I could drin","useful":1,"cool":1},"iojABxRAdxlJlZksqkvVrg":{"text":"Got the RWCC and it was amazing. Super creamy and not too sweet. Picked up a couple macaro","useful":0,"cool":0},"R06V_EjQuGPWUAEn28eMAQ":{"text":"Not a NOLA native. I'm from Texas, and I have a big sweet tooth. I did not regret the deci","useful":0,"cool":0},"2hHCiM7_6Psyeq8UslXnhg":{"text":"Sweetest apology ever award goes to Sucre! \n\nMy last day in the French Quarter I purchased","useful":1,"cool":1},"kfXK0nG8gNJIkd8dzm4-nw":{"text":"Wonderful Employee's!  Greeted right away, given recommendations, which we tried the salte","useful":0,"cool":0},"FeP4sZvtRZM8TdurTrT8SA":{"text":"This place I'm sure is very nice but all I wanted was the strawberry lemonaid cake and the","useful":0,"cool":0},"ZgmQNkraOhkdxsTlXtQflA":{"text":"Amazing macaroons.  Friendliest staff and helpful!!!  Definitely will frequent this place.","useful":3,"cool":2},"IsSyTL3ib-sHLA-1lkE8hw":{"text":"I so wanted to love this place.  I came here for Easter and the experience was terrible.  ","useful":0,"cool":0},"92Bm3mDRn1sgvdTZbRtvNQ":{"text":"Vegan sorbet was delicious! I was disappointed that the sorbet was the only vegan option. ","useful":0,"cool":0},"lIrx3C5fv7fGdUpvyeCg3A":{"text":"We came here after dinner to try out their desserts. Cute place that reminded me of being ","useful":0,"cool":0},"mNCW8Vbt3v92J_-Ujzdj9w":{"text":"I have always known sucre for their quality desserts, but over the weekend, I went upstair","useful":3,"cool":3},"fC9F8qYZ9Gr5yrqXGXVSdg":{"text":"Delicious, smooth, and creamy -- without being uncomfortably heavy. Perfect ice cream. Pro","useful":0,"cool":0},"juKJMo-nNQnp__SfbF8nsQ":{"text":"The sweets may be sweet but when we went, the service wasn't the greatest and they were ou","useful":1,"cool":0},"eyIUGk55-QQCZ6aDvwoAzw":{"text":"We tried pastries and gelato and they were so amazing.  EVERYTHING is BEAUTIFUL!  Candies,","useful":0,"cool":0},"aJaWFg3SbPrawMB5SWcINA":{"text":"So we actually got the idea to come here from seeing someone holding a Sucre bag earlier i","useful":1,"cool":0},"0Kp4c2fvOAoeGMTW-tsVpA":{"text":"Fantastic dessert in a fun atmosphere. The employees made great recommendations and we wer","useful":0,"cool":0},"uwODDjX00_dfXnbY9Yo9xw":{"text":"This place is the real deal. Decadent macarons, gelato and desserts. We tried 8 assorted m","useful":0,"cool":1},"dhz8XBapl-DuLGXIyBI0mw":{"text":"This place is the go-to dessert place in the French Quarter. The two ladies working the fr","useful":0,"cool":0},"W27QSTxQ70TxJh5uPRnCaA":{"text":"The ladies Latia and Sharon were super sweet. Great service. Good sweets.\n\nI am a local of","useful":0,"cool":0},"94j_dbGg0P6EAin8-d78_Q":{"text":"If you want a little something sweet be sure to stop by Sucre! Their desserts are amazing.","useful":1,"cool":0},"QosFVuYQlCKzUvc8OZQcEg":{"text":"This place was really busy when we went. The cashiers handles the crowd well. Food was abo","useful":0,"cool":0},"sc59b49YZKhJPAG3xe1TmA":{"text":"I was in New Orleans for a week and stopped here everyday. Friendly service, awesome gelat","useful":1,"cool":0},"9Tjk6oxkXxYCPRHMrLIrkw":{"text":"Worth checking out if you craving something sweet. Delicious artisan desserts. The coconut","useful":0,"cool":0},"YC7vaTPDLCxNZgk6WjLMZg":{"text":"The desserts might look pretty but they certainly don't taste half as good as what they lo","useful":0,"cool":0},"CFjEzUcgJgAOPwGOiyFv3w":{"text":"I didn't think I would get the chance to stop by here on my first trip to NOLA but I'm so ","useful":2,"cool":0},"4s5o7-h5pv-0LZqaQjkiHA":{"text":"Super yummy treats! Everything here is delicious. You have to try the gelato. The staff is","useful":0,"cool":0},"5djr1S2x-tQKhfMWpe3ozw":{"text":"Stopped by here for some coffee and desserts. Staff were super friendly and helpful and ev","useful":0,"cool":0},"PKUapSFDcQ5LxBENCK5-aQ":{"text":"Love Sucre - perfect every time.  Such a treat! These handcrafted macaroons and chocolates","useful":0,"cool":0},"Kpo5NVgdFKbmJBEObBXgIQ":{"text":"Giving it a 5 cause this place is super great! We watched \"Somebody Feed Phil\" on Netflix ","useful":0,"cool":0},"SWfLWAAKhWRQuTXg9qWo3Q":{"text":"This review is based on the basil/coconut ice cream. That is all. Well, it is a really cut","useful":2,"cool":1},"C1YAFXIi98e9N1maVR3Edg":{"text":"If you love sweets this is the place for you! We had the s'mores dessert with a scoop of k","useful":0,"cool":0},"E5zHkzBfyJqgDkA9R-IDcw":{"text":"Stopped in for their macaroons and was not disappointed. Their gelato was also delicious. ","useful":0,"cool":0},"yhgCMMeeNi3UFl-NgaisDg":{"text":"King cake.'Yes I said King cake.\nIt's my girlfriend's 1st year down here and I had to expo","useful":0,"cool":1},"jF8_Lm3pbJfsfx7aA3ZxRw":{"text":"This place is amazing!!! It's very cute and clean. The staff is beyond friendly and helpfu","useful":0,"cool":0},"XqczBXuAbjJLF4xh2WMMxA":{"text":"Award winning elcair: sucked, seemed stale, would not buy again, wasn't worth the calories","useful":1,"cool":0},"MC12iEFuM4MaSKO8YExFTQ":{"text":"Chocolates, macaroons, and desserts aplenty. Some downstairs seating in a very quaint sett","useful":1,"cool":1},"BMDwSPBRvCTLzX6UwoCt-g":{"text":"I cannot say enough about just how delightful Sucre is. I was pleasantly surprised to find","useful":0,"cool":0},"d2HQHK47BY4KY-gLlAZGCA":{"text":"The Orange au Lait and the Chocolate Lime Bar were delicious as were the macarons! However","useful":0,"cool":0},"dpe0FUsk8oQdNEEBdKMDbA":{"text":"We walked past Sucré a couple of times and finally had to go in and check out what they ha","useful":0,"cool":1},"gkOt8lHDv_6_i0ZYGGXUMw":{"text":"Wonderful brunch! Second time and super impressed. Had an issuer with the temperature of m","useful":0,"cool":0},"Zk8P6Nwl384sAFtqyuKCVg":{"text":"Such wonderful hosts ! We ordered the Tiramississippi and a Skillet Smores, each for ~$7. ","useful":2,"cool":1},"JySikwKA_4SzwVHHrg4FvA":{"text":"I found this shop after looking at the Yelp elite page for N.O. & saw they had an event re","useful":1,"cool":0},"7lJsz9tAdppFdlf2Is63cw":{"text":"Yummy!  The employees here were extremely friendly and very helpful in making sure my girl","useful":0,"cool":0},"BtawXmyQc5oz44KVwfXDbg":{"text":"Was so excited to try this place, but left slightly disappointed. Got the s'more dessert, ","useful":0,"cool":0},"ZmbSQ4s1ZjayJnVvx2nkRQ":{"text":"YAS YAS and more YAS! This place has some of the most delectable treats Ive ever had. Ive ","useful":0,"cool":0},"QCTNu0P6V0kKe5CD67R24w":{"text":"All the pastries were overpriced and were below average. Nothing worth remembering. \n\nWe h","useful":1,"cool":0},"nPcZKoNoQ8P9rjHKDpoJLw":{"text":"Excellent place to get an evening coffee and dessert. Found this place on Yelp! and it was","useful":0,"cool":0},"mBuMgzDnhlpU7wGoj8TZ9A":{"text":"Cute shop. Reminded me of paris. Super yummy and beautiful location. Love the way they pac","useful":0,"cool":0},"kUGljebxgon2U_QGZbbeaQ":{"text":"Went to Sucre for some coffee and gelato during a crazy rain storm and was so glad we made","useful":0,"cool":0},"lH8gUI1sQZYnDVmAJma9yQ":{"text":"I had their king cake and jasmine tea macaroons, as well as a slice of king cake. \n\nThe to","useful":0,"cool":0},"M9KEAPSwW4Z1RSZTiKXuuQ":{"text":"Oh how i wish we had more time! You eyes eat here before your mouth does -- all the desser","useful":1,"cool":0},"845w5qB0lbO6I1TRqIWRPA":{"text":"I loved sucre, it's adorable and the shop from the outside as well as the inside is really","useful":14,"cool":13},"l3lqi2nXNr8AxyMB7nooTQ":{"text":"I actually got a box of macaroons in the airport from here and they were the best I've eve","useful":0,"cool":0},"OzNHeohch5LSdZEHIkujlQ":{"text":"An aesthetic place to get your chocolates for sure. There are a couple of outlets of this ","useful":1,"cool":0},"0xOZmJW5PFCakcEiJQO7oA":{"text":"Absolutely delish!  I just wish we'd had time to go back & try more.  Polite & patient ser","useful":0,"cool":0},"5jKSC57JfZeDcn7hIcJ_iA":{"text":"Wow, this is as close as I ever came in the US to the quality of a French patisserie. Ever","useful":0,"cool":0},"k-OQCMbXJQskQu06ZT5Xeg":{"text":"Came in during FQF2017. I had high hopes and was pleasantly surprised. I just wish they ha","useful":0,"cool":0},"CKtZnrsZlGuiy1MGSopyBg":{"text":"This is an amazing place! Wonderful macarons and great chocolate. Very friendly staff and ","useful":0,"cool":1},"5TJ7cu5vakWL9p4O-p336Q":{"text":"We stopped in while visiting Nola and really enjoyed the array of offerings and high quali","useful":0,"cool":0},"x5yFTSa5PKNlmx0eftaKhQ":{"text":"This rating is exclusively for the ice cream. We had 3 scoops and they were decent. I only","useful":6,"cool":4},"pMje8ajtzx0MxUW90DKetA":{"text":"I was walking to dinner at a restaurant next store and overheard a tour guide say they had","useful":0,"cool":0},"LLUrewgOf2i-tRP3g-M32Q":{"text":"I had a destination wedding in New Orleans two week ago and went through Sucre for a small","useful":0,"cool":0},"iSO2lgZTacuhOa7kL-9w6g":{"text":"It is our first time in Nola. After finishing dinner I was on the hunt for dessert. Sucre ","useful":0,"cool":0},"jo23MTz5ZrGKAG3IkM_HOA":{"text":"I'm writing this review sitting at a table at Sucre while still eating my eclair because I","useful":0,"cool":0},"7NyWR8_9q-1jMqbV9oZWMA":{"text":"What a cute little place. Was passing by when the rain started. Stepped in and had a small","useful":1,"cool":0},"XGS1cDOp_EN8aneniS9pow":{"text":"A decadent little cafe loaded with sweets. There's something for everyone with any type of","useful":2,"cool":3},"4J1urc9Wjn3Qe3HOEC92gw":{"text":"This is a wonderful macaroon shop. We had a bunch of different flavors they were all good.","useful":0,"cool":0},"KSiyuErkArZp1gzfgcT7lQ":{"text":"Bought a beautiful king cake, and also had a slice there! It was very tasty and the king c","useful":0,"cool":0},"Ksv1_SmNEnT3lD6WOy86gQ":{"text":"I am a huge fan of chocolate and I have to say it would be hard to beat sucre. Their desse","useful":0,"cool":0},"j0qFajGNQHIGVTsW0F44aQ":{"text":"Everything is so good here. Their ice creams are great, and the desserts... Wow! I'm visit","useful":0,"cool":0},"WkZTNOtlc4f3P1Vr-OOFGg":{"text":"Great macaron and gourmet French chocolates in the French Quarter!\n\nGreat macaron flavors,","useful":0,"cool":0},"HYSiyrIwySNyfaJarDmQHw":{"text":"I love the fact that this place has late night hours on the weekends. This is perfect and ","useful":2,"cool":1},"sN268V0XnqG-tJMb_5it3w":{"text":"Amazing little dessert boutique in the French quarter. The smells when you first open the ","useful":0,"cool":0},"kIYWB7dnHMJNL97-y6q8YQ":{"text":"Great place to drop in for a sweet treat or savory bite.  We dropped in after an wedding r","useful":3,"cool":0},"R4vcutCPzbeEfRFKZ43Bfw":{"text":"Came here for brunch & afternoon tea & sandwich. Basing my review on the food I had. Order","useful":1,"cool":1},"1nYvmRoWwsk11phEq09fXg":{"text":"I found this place by searching for quality coffee in the Quarter, and was initially a bit","useful":2,"cool":2},"QxRI45Bj3reFvNSHzWAILA":{"text":"As soon as you open the door you are greeted by aromas of fresh baked pastry, coffee and c","useful":1,"cool":1},"2Pvvf0D2_1sKKEsjLLlLmw":{"text":"Cute dessert shop in the French quarter.  The coconut Basel gelato was a great combination","useful":0,"cool":0},"bI9DXNRmWDrGvWdWPKJMFQ":{"text":"We went here on the way back to our hotel after looking at everything in the Windows.  We ","useful":0,"cool":0},"Fn6wABF0ZUKdyXNXCMsC5Q":{"text":"After dinner, we wanted to stop by a dessert place and thanks to yelp, we found this cute ","useful":1,"cool":1},"vSm7pMp5kzyLsou-uVYvrQ":{"text":"Best Mardi Gras king cake i I have ever brought back! Also the macaroons are damn good! A ","useful":0,"cool":0},"8YSSXq7we8Gkgf1JXDkT9g":{"text":"5 stars for service and 5 for food. \n\nThey had a variety of flavors and it was hard to cho","useful":1,"cool":0},"yVu0ets7gwPE0-fd_UHjXQ":{"text":"I always stop by Sucre when visiting the French Quarter for a little bit of heaven and som","useful":0,"cool":0},"eyMNFc9Zl6luT5kdIoLvgQ":{"text":"Mango gelato is so rich and refreshing! Macaroons were soft and decedent! Nice little spot","useful":0,"cool":0},"ukwRPg1uFjAAevkLns41vg":{"text":"Very good macarons- watermelon, peaches and cream, PB and J, hazelnut, almond, and pistach","useful":1,"cool":0},"ameB1HPvT4eEQDPW6wsq-w":{"text":"Super cute inside and Sucre has many desserts to choose from. I had gelato and the s'mores","useful":0,"cool":0},"a6Q0CoBsm5wnsuVuf-bTGQ":{"text":"My husband and I went here as we were celebrating our 10 year anniversary. Cute little sho","useful":0,"cool":0},"8p0oIHvRYVtn3-LQtCf7UA":{"text":"A tiny little pastry shop with really good and expensive looking branding and wrapping. \nA","useful":2,"cool":0},"7fbMGSx-RvYg1PyWKkf96g":{"text":"Deeeeelish!  The mocha coffee was amazing. I ordered the eclair with 3 scoops of gelato (h","useful":0,"cool":0},"AfAuP3D9YdvA3DhKxhACiA":{"text":"Had the coconut basil and raspberry sorbet . Perfect way to end a day in the French quarte","useful":0,"cool":0},"-_UIpWUi2xv5jVzXWF5Vqg":{"text":"The gelato was amazing, the perfect combo of creamy and cold. I got a bunch of macaroons t","useful":0,"cool":1},"rgsPnO8fQ7Pd4byTsoCwbQ":{"text":"My husbands favorite dessert has been macarons, so I knew when we went to New Orleans, we ","useful":0,"cool":0},"nl460frI0uWvOMyFQptl7g":{"text":"Every single ice cream flavor was amazing (had a lot of samples) and the cappuccino hit th","useful":0,"cool":0},"gPDI0rmeieSj3nMDzGM2Bw":{"text":"Came to Sucre for dessert after a dinner at a nearby restaurant. I had the tangerine gelat","useful":0,"cool":0},"7qu7t-13FmvkraoIgwk54Q":{"text":"Cute store offering a wide selection of Macaroons, different flavored marshmallows, chocol","useful":0,"cool":1},"wROaO5u46djbfYR9k1i9sw":{"text":"The mocha was really good, unfortunately they did not have the dark chocolate option at th","useful":0,"cool":0},"WG30vnJ34EsBlVo910ZWBg":{"text":"Sucré in the French Quarter made our wedding cake for us yesterday. The cake was soooo del","useful":0,"cool":0},"dMiDQyOSRyQXS4JPWdHwLA":{"text":"My at the time fiancé and I took our first trip here last year and instantly became obsess","useful":0,"cool":0},"4hu-qYet0ahGY13wMPjkUw":{"text":"This was one of the few place we went to in the French Quarter that seemed to invest in th","useful":2,"cool":0},"2mMX_dP-rbWs0RLVsDxzzw":{"text":"Great macaroons, friendly staff, a must for a nice treat when in New Orleans.","useful":0,"cool":0},"Smd8kNopZCczj-Qk1sJNIw":{"text":"Amazing and unique deserts, good coffee, pleasant atmosphere, spacious balcony with a view","useful":0,"cool":0},"1J_ikLPyQnbgnE3EXc9biA":{"text":"This place is amazing!!! It's very cute and clean. The staff is beyond friendly and helpfu","useful":0,"cool":0},"xNSwVCNhc5CYlw1Wu-kV1A":{"text":"Omg! This place is amazing! The art of the desserts here are awesome. It's definitely a bu","useful":0,"cool":0},"SPfJ0d1cv28lzRAizJCdkA":{"text":"I'm came to New Orleans on a business trip so I want to buy to son a present from this pla","useful":0,"cool":0},"DljJjHNMJqP57B6nvzc9AA":{"text":"Perfect space for a luxurious treat. Relatively new and polished in a way I appreciate. Th","useful":0,"cool":0},"Vd_jbj4N-L-5LxR0PSHtFQ":{"text":"Try the RWCC! yes, it looks kind of crazy but out of the three desserts I tried, this was ","useful":0,"cool":0},"WIrdEF5PRC4wyZONIYcwdw":{"text":"I haven't been inside this store but my boyfriend and brother brought back some delightful","useful":0,"cool":0},"KEt0DEXutDvjji4GIZHJXw":{"text":"Oh my God. This place is amazing and they were really understaffed on Thursday because it ","useful":0,"cool":0},"ht_wigc7VFkM-BnbFQQifg":{"text":"Had the lemon meringue and brown butter pecan gelato.  Lemon meringue was very good.  Tast","useful":0,"cool":0},"D5B2zWi0EBgzVD2I1k8t0w":{"text":"One of the best dessert shops I have been ever been to. We got the smores skillet with pis","useful":0,"cool":0},"nOQSDDEEbLFimU-LKwNtKg":{"text":"This was such a great little stop at the end of my fiancé and I's day! We wanted a simple ","useful":1,"cool":0},"7vrRVmJHp0h9jpC5MEdpTg":{"text":"Tasty gelato, but be ready to pay for it.\n\nStopped in on a Sunday evening for a milkshake.","useful":0,"cool":0},"A3uG6BzfaoZJzmiAjAmBdQ":{"text":"Went for coffee yesterday. Little sad that there were no beignets. But...macaroons soooo g","useful":0,"cool":0},"OwIgwOYlqrBp0ckWzcr6RA":{"text":"Awesome gelato an awesome desserts. Good place to refresh yourself. Nice place to get away","useful":0,"cool":0},"KfmkXw5yp24Vcwz6Ef8xtQ":{"text":"We came here specifically to get macarons, and I was not disappointed. They have 12 differ","useful":0,"cool":0},"-m2joMXnGSWeugPkqv4knQ":{"text":"Finally got to go somewhere with a great dessert spot post dinner. This place had more Mac","useful":0,"cool":0},"UlDOF9lWmTld24BRYMthNA":{"text":"The 4 stars are for the desserts which were delicious!! Their staff was trash. I'm not sur","useful":0,"cool":0},"wXPi63l2wmeAFjDoRYFh4A":{"text":"I hate having regrets, especially regrets along the lines of- I could have eaten that. On ","useful":3,"cool":2},"7XJYaWUYK3K4aL9XRTvcSw":{"text":"I ordered a box of 8 macarons for $15 and got a medium gelato. The macarons were so fresh,","useful":0,"cool":0},"QjkX-4z4en1Ef2OhzR1MfQ":{"text":"This is a must stop dessert shop! Eat there or take it to go and enjoy at home or in your ","useful":0,"cool":0},"2-yeU-1RCNSGo5S_za_8ng":{"text":"I am rarely speechless, but this place was downright stunning. It is exceptionally clean, ","useful":0,"cool":0},"V98aalx8u63E0t8UIWOVPA":{"text":"Sucre's products are always fantastic. Excellent macarons, desserts, chocolates and gelato","useful":0,"cool":0},"_rGEfGiPP4BSuipe7k4GEw":{"text":"Wow!  This place is really wonderful. So glad (but sad) we didn't discover it earlier in o","useful":0,"cool":0},"WZ1RjH-FUfJKLi3ezYHx8Q":{"text":"Most delicious desserts!! We loved the eclair and macaroons. One of the employees was real","useful":0,"cool":0},"_b0S6OtyjXxWHOMv67gKqw":{"text":"I was told the macaroons here are good. Let's just say I was not disappointed. Will come b","useful":0,"cool":0},"8pDB0-a-D9ADFjjrSUdCzg":{"text":"The pasteries are DEVINE, try the bread pudding;  as it heats up, the sauce melts on top! ","useful":0,"cool":0},"hMmmCh1nQTE9hwgDAXke2Q":{"text":"Satisfy your sweet tooth here.  I had a chocolate eclair with a cafe au lait.  Delicious! ","useful":0,"cool":0},"QgZj_GK05G57cHQTQUdvlQ":{"text":"If you are looking for beautiful treats, this is 100% the place to go! I am a huge fan of ","useful":0,"cool":0},"5EG_diGTX6WTojmlZUXSmA":{"text":"Yummie Yummie for my tummie! I had two scoops of ice cream flavors pistachio and coconut b","useful":0,"cool":0},"3xvBG_wBY2iLgnB8JkldzA":{"text":"Sucre is soooo good! Macaroons are delicious!!! We stopped in during my bachelorette weeke","useful":0,"cool":1},"FUscOE6OCnnC-upg0qUGNA":{"text":"The staff is friendly, the desserts are amazing. My boyfriend got two scoops of ice cream.","useful":2,"cool":3},"GQh7-OCyOlM3bMS7uMW3sA":{"text":"Oh my gosh! Where do I begin?\nDarling shop and terrific desserts! Everything was Delicious","useful":0,"cool":0},"6n9XD3NcsoOsqnJgFsN3Uw":{"text":"Wow!  What a picture perfect gem of a dessert place.  Wonderfully pleasing to the eyes, wi","useful":1,"cool":0},"jj7_v-XbUb7Bk9YGA_fvVw":{"text":"We stopped here because of the brunch sign in the window but found they didn't have brunch","useful":0,"cool":0},"-UhrursgMqTLZUcKVhe8MQ":{"text":"Sugar sugar sugar is the name of the game here. I stopped in a few times on my most recent","useful":3,"cool":3},"wQIolC2kvx4SWfOyFkdspQ":{"text":"I went to the Sucre on Magazine Street a few years ago and wasn't impressed.  But this loc","useful":0,"cool":0},"wgWNn3N6yQSPXAQBosW4Gg":{"text":"Surprisingly good! I only tried the éclair and an iced coffee at this small sweets shop (t","useful":2,"cool":1},"Czo9KjtSgLIjZlo342c--g":{"text":"Beautiful atmosphere. Sophisticated sweets. I found myself taken aback by the gorgeousness","useful":0,"cool":0},"h7ffl17lthnsKUaS2_CZig":{"text":"So good that we stopped in twice, a rarity for a Yelper on the go.\n\nThe shop has so many s","useful":7,"cool":5},"Fdr2vDPlXPjx2oQzcFIUvA":{"text":"This place doesn't even need my review, as they're already wildly known and loved. Our exp","useful":0,"cool":0},"N8ccqSkQbgRliHoHSiFDGw":{"text":"The gelato is nice here but beware the single scoop is way more - it's a little bowl. Grea","useful":0,"cool":0},"Z2uYxjEChxXaxtsxgoBEkg":{"text":"It has nice decoration full of colorful and delicious chocolates and pastries. \nIt is in t","useful":0,"cool":0},"Z1MtErLzGbMHGgY2WhRu-g":{"text":"Delicious macaroons and tons of great flavor a to try. The salted caramel and the chocolat","useful":0,"cool":0},"IwOWidGYlz4xy4jtEYle6A":{"text":"I'm not a huge sweets person but oh my gosh this place was amazing! This stuff was so frie","useful":0,"cool":0},"q6norYq-nAJBdFqZlUrktw":{"text":"I attended a small birthday dinner here this past weekend and it was awesome. Our group ha","useful":1,"cool":1},"yqo1YrQefXhiYtjcuSTtUw":{"text":"The ladies behind the counter couldn't have been nicer and more welcoming. I tried a few f","useful":0,"cool":0},"yhDWwJIOY6GRBKV1ZwukrA":{"text":"Excellent service & fancy looking! Tried the rose white tea and their signature king cake.","useful":0,"cool":0},"0BVUlVqlFQXN5dGsipNXqA":{"text":"I stumbled across this amazing place accidently. My son was hot and flustered from walking","useful":0,"cool":0},"WY8wOviMTwdZnz2qxto8tA":{"text":"Sucre was amazing.  We were looking for a place to grab a cup of coffee and have a nice de","useful":1,"cool":0},"50Pu9uHfnqmHC2VNdrdYvA":{"text":"Had the milk chocolate Gelato and it was the most perfect thing on a warm summer day. Air ","useful":0,"cool":1},"I2-4xRcVTtwBttZzMglMcQ":{"text":"I went twice to Sucre while visiting NOLA. The desserts were amazing not only in presentat","useful":0,"cool":0},"rnxQg17K4BYP1ngsx-WdmQ":{"text":"All the staff members were so nice and pleasant to talk to and was able to answer any ques","useful":0,"cool":0},"VsN-QfikQgFY_j03J7mPjw":{"text":"Can't say enough how amazing the Coconut basil gelato is! They have really great macaroons","useful":0,"cool":0},"fMh-SfSLP6EzBrPYNHBmCQ":{"text":"Wow.  Talk about attention to detail and execution to perfection. \n\nEverything here gives ","useful":5,"cool":5},"0sAfEQaroJcvT51ZXjjWNg":{"text":"I am beyond amazed with this bakery! Everything and anything you would want from a little ","useful":2,"cool":2},"4O55vd3er7dltfuzgnQwyg":{"text":"Super yummy gelato- highest rating I can give. Dessert were beautiful. Wish I could try al","useful":0,"cool":0},"1byRqMVWNDeqHjJX1obhbg":{"text":"Somehow in a five day trip to New Orleans, I've managed to show up at Sucre for four of th","useful":5,"cool":5},"_LlX2F3qPFzVT9hsHJGVkA":{"text":"I had the bread pudding...OMG!!!  The best I've ever had!!!  Every bite of this decadence ","useful":0,"cool":0},"k9lJamzH1cqvLv9CNJyMIw":{"text":"It's a super cute posh gourmet bakery in the French quarter. Their desserts look absolutel","useful":0,"cool":0},"oHtbTbgfumap4r5Ui4-fWg":{"text":"BEST. DESSERTS. EVER. The smores cake was so insanely delicious.","useful":0,"cool":0},"L5zyntv8ok7bjGsUt19r3w":{"text":"the child's play and the devil's food are quite delicious. wish i could try every single o","useful":0,"cool":0},"Mq7QHPNfkX3VRr3ZGGdd6A":{"text":"What a sweet piece of heaven! I have a sweet tooth but I also have a very fine taste when ","useful":0,"cool":0},"fsjyoVbF02fxHhNR5BHLAA":{"text":"We walked into this little pastry shop and it felt like you were in Paris.  The atmosphere","useful":0,"cool":0},"ka3-QGhj6Pr-lxZ-hc1mBg":{"text":"Matcha gelato - 3.75 stars\nBetter than I expected - it had a nice rich bitter flavor. But ","useful":1,"cool":1},"soXhbaP7dZmJqkUctkQtbg":{"text":"This isn't just dessert, it's edible art. An amazing display of the perfect macaron in uni","useful":1,"cool":1},"NXY4hijDqMyijzt55XPtKg":{"text":"Wow that was such a good desert I had today . Gelato PO-boy .A combination of ice cream an","useful":0,"cool":0},"Cj26gW0PM4OYK4kGL8EJHg":{"text":"This bakery is the cutest! I loved everything about this place from the sweet treats to th","useful":0,"cool":0},"VQE9njze5la0bhxNyx5Aqg":{"text":"Gelato and macaroons are delicious, cute environment but service could use some improvemen","useful":0,"cool":0},"OMgr0v2MZ2iihkQpl4iIqw":{"text":"Dessert heaven! That's the word to describe this place. Tucked in the French quarter on th","useful":0,"cool":0},"az4LsQs4f1IP082YbmUpBQ":{"text":"I don't know what it is, but I MUST buy a selection of macaron's here every time I'm in to","useful":0,"cool":0},"hFFgx5oEVnvzW0YWFNPpgA":{"text":"Ordered the Mardi Gras chocolates/macaroon combo for my parents at separate addresses.  Th","useful":0,"cool":0},"UERCE4CwNCNC5yPVl2pcKw":{"text":"OMG!!! This was delicious. We had a blackberry something or another and nectar ice cream. ","useful":0,"cool":0},"lEn4DaMiEslK4WkhZRDVEw":{"text":"Wow what a GREAT place for dessert! We rounded off a night at Galatoires with amazing swee","useful":0,"cool":0},"s7CV0jsuRY1htW38cjl1uQ":{"text":"Fell completely in love with this place because of its fabulous customer service and delic","useful":0,"cool":0},"psg1XH4kxFjOEzKmPBJakw":{"text":"Wow what a find! Everything looked and smelled delicious! Thank goodness I could not taste","useful":0,"cool":0},"q-u1Q2M0ahtn8hOmAvX5hw":{"text":"Cute, clean, and classy. The displays are drool inducing, the gelato was sheer perfection,","useful":0,"cool":0},"AMJ_O8KHvyoTC-_CdVhNjQ":{"text":"Extremely overpriced gelato that is about as good as the stuff in the grocery. Go elsewher","useful":2,"cool":2},"WujSLw5oMGggLJ157F7Lwg":{"text":"I have a serious addiction to pretty cafes with pretty desserts and good teas/coffee, so I","useful":6,"cool":2},"blVzvpLLJvZL5WqLDATGqA":{"text":"Oh my goodness did this place live up to its reputation! I had the famously rated eclair a","useful":0,"cool":1},"qt6UrgJeM0SAihyVXDwc9Q":{"text":"Robert is the best manager ever! So sweet and just the absolute best!! Marcel is awesome t","useful":0,"cool":0},"0la5LSrrU4LlSxsenqpIFw":{"text":"Nothing like delicious creamy chocolate after a fiery Cajun dinner. I brought my family he","useful":0,"cool":0},"Wc3mrxe7rYvM6vBviZTciQ":{"text":"Great joint for every person in a party. There are treats like delicate macaroons, truffle","useful":0,"cool":0},"E_fGVmCeYLkqx__dWOhwOw":{"text":"Cute and clean shop. Went for dessert after dinner. Was more interested in the gelato, rat","useful":0,"cool":0},"BUmU9ZP83SQ8avZ47ojYTQ":{"text":"Delicate pastries, a sea of chocolate truffles, delicious café au lait - my only disappoin","useful":0,"cool":0},"kGKOnbgh4tQgY5GnOCUE7g":{"text":"This is my favorite bakery in NOLA! Whenever I walk into this place I feel like I am in he","useful":1,"cool":1},"mDarFl3VW61DSVi_Te5BJA":{"text":"Service was good. Love it! Best truffles I've ever had! Order the banana foster and raspbe","useful":0,"cool":0},"zR5uymi6vmEIb-HBGHGPIg":{"text":"We stopped in here after our last dinner here in town. This is a place that has a little b","useful":0,"cool":0},"NZFjGuwm6kOEhRct3vDpUA":{"text":"The desserts here are out of this world!  The presentation, taste, and beauty of it all is","useful":1,"cool":2},"-g7Ogk7w8Ff7OGycM83Bvw":{"text":"My love of dessert cannot be beat, so I obviously scoped out the best dessert in New Orlea","useful":8,"cool":7},"SOKJJMzkJfkrTqsd11Or_A":{"text":"Very high end sweet shop in the quarter that serves some of the most ornate desserts you c","useful":4,"cool":2},"YjYw1gW7H9_NrAd_qtXENA":{"text":"Ran into this awesome little sweet spot during a walk in the French Quarter. Chocolates me","useful":0,"cool":0},"WakDJR4JaHXIy-J0QipmAA":{"text":"Randomly popped in because the name stuck out on all the \"must go\" tips. Can't express how","useful":1,"cool":1},"2nnjn_IvPBT6pBZallMosg":{"text":"Superb chocolates, friendly service and excellent food. They ship their king cakes too!\n\nW","useful":1,"cool":1},"1_LUGa2loe6ApwVG4tQ04Q":{"text":"In NOLA for education conference. Went out for dessert after dinner. Excellent choice. Was","useful":0,"cool":0},"YJpK6BwDe6l6KIt3BeY3ug":{"text":"A little precious but good coffee and real, Paris-worthy macaroons. The one on Magazine is","useful":0,"cool":0},"bnfYtl_B2k_Np6npdnYpuA":{"text":"You won't be able to choose just one. You won't be able to eat it b/c each dessert is a wo","useful":0,"cool":0},"Ozit-39VFozOYiu2kBUxWA":{"text":"Some of the best macrons I've ever had! I particularly enjoyed the salted caramel. If you'","useful":0,"cool":0},"qbvCvTlEwvUPZGP_4GZyfQ":{"text":"It's pretty good, but really pricey. Come here with a good bit of money in your pocket bec","useful":3,"cool":0},"WN9cz11JsE53lox8EgY0MA":{"text":"Loved it!! We get chicken croissant , salami sandwich and yogurt parfait. Everything was j","useful":1,"cool":1},"8ysITirYGpamGeR7tl6kMg":{"text":"Desserts were delicious, gelato was alright. Not the choices that totally got me, but it w","useful":0,"cool":0},"EddC4ak5yWbbswwcyRprqw":{"text":"Awesome Pistachio cake here..also get the Flat White. The deserts look delicious. I almost","useful":0,"cool":0},"SZq-TH7jRgArkPK0NXrHpA":{"text":"Too many delicious things to chose from. We had a key lime tart and mango gelato, it was v","useful":0,"cool":0},"2WHr99VgRODyjinE2NMK5A":{"text":"You need to stop by here and try anything! The macaroons , s'mores pastrie, and Gelato are","useful":0,"cool":0},"Iit8bB65oDLOtpvU8uLKsQ":{"text":"Everything is absolutely delicious. You cannot find ice cream like this anywhere else and ","useful":0,"cool":0},"nSnIcOk8q9ExEfnOemVdHg":{"text":"This little escape from the debauchery of Bourbon Street was exactly what my fiancé and I ","useful":0,"cool":0},"baKPmCw72GWbvi7UkX9lkA":{"text":"We stopped to look because of the desserts, we went in because of the salon/cafe where we ","useful":0,"cool":0},"H9q7JKWjDRHdYkHD20J3Zg":{"text":"I'm a chocolate freak. I got a chocolate mousse dessert and was impressed. I also had a ro","useful":0,"cool":0},"VzHU-Oy7_5ATVTjxismy4A":{"text":"Stumbled upon this place while looking for desserts/chocolates. We ended up not only buyin","useful":0,"cool":0},"n4zKduqo54XhX8BZiycdSg":{"text":"I stopped here just because the windows were so pretty.  The macaroons look awesome and th","useful":1,"cool":0},"24vg433a3JX8sU4JQbbYBQ":{"text":"Get ready to spend a chunk of change because you'll want ever flavor. I had the brownie, s","useful":1,"cool":1},"fsKOdIsewDMMWHq4HztL9A":{"text":"When it comes to macarons, if there are good reviews for these addicting sweet treats, res","useful":4,"cool":2},"pZ-JxhsQQyk5-GZ_Tug07w":{"text":"We visited the shop around 8:30pm, so the little cakes were all gone. They had the macaroo","useful":0,"cool":1},"OIgfO0UnHMlR-HK9jA5XKw":{"text":"We went here for happy hour cocktails because we accidentally stumbled on it when we saw t","useful":0,"cool":0},"fz0NGhqeYs97dJl3B83lVQ":{"text":"Such a New York type place with lots of yummy dessert. The macaroons are two dollars a pie","useful":0,"cool":0},"tdykgZD5A14Y9jzXepubLg":{"text":"Loved the design of the shop. Workers were very warm and friendly. I got the earl grey and","useful":0,"cool":0},"YMhgDIi7RZULCzo20a98Wg":{"text":"Deeeeelish!  The mocha coffee was amazing. I ordered the eclair with 3 scoops of gelato (h","useful":0,"cool":0},"yHjiHKiOqsRDTyvyveykCQ":{"text":"Every single thing they sell is absolutely beautiful. I was so excited to see red velvet a","useful":0,"cool":0},"emP1pRLXLkERA5cjwP7rJA":{"text":"Nice spot in New Orleans! Pricey, but worth it! Customer service was great, loved the basa","useful":0,"cool":0},"EBdMNK5m1FrKIVjnBigoyQ":{"text":"Please visit this place before you go to any other bakery in NOLA... amazing staff so frie","useful":0,"cool":0},"spX86O5nxQ5Lh6J6iKIzBA":{"text":"The Salon is Sucre's upstairs dining area that serves brunch, tea, and happy hour. We enjo","useful":0,"cool":0},"fXTsmOprgGio4UcDX43Naw":{"text":"This place is cute as a button and has the goods to match. I came across Sucré while looki","useful":0,"cool":0},"-DQ6AgwYDqRd5dJemj4T8g":{"text":"Wow! The tastes of Sucre is mind blowing. The price is a little steep but nothing more tha","useful":0,"cool":0},"7uqWJCyuE9Y4KQgA5uO6zQ":{"text":"The coffee is good and so are the desserts. I couldn't believe how beautiful the chocolate","useful":0,"cool":0},"5JCEHK6Jq9S7CgMfBWIT5A":{"text":"The employees here are soooo sweet and nice! The gelato is great too! \n\nThey have all your","useful":0,"cool":0},"Ud2f8jd8VlbwMEvRn1NsUg":{"text":"Chocolate is high level. Like lux European brands. \nMacaron is top level in my life from T","useful":0,"cool":0},"meRUYnJUMm0uZ7h6YEgJaQ":{"text":"Was brought here on a culinary tour of New Orleans and had a chicory macaroon and chocolat","useful":0,"cool":0},"JGSI0pxy29SLDVkpHKa8hg":{"text":"Fantastic macaroons. I had the chocolate, pistachio, salted caramel, and blood orange. The","useful":0,"cool":0},"9GBD9VievS8sEfic75NwiQ":{"text":"So clearly I've never had a decent macaroon until coming here lol. They are so good. I wen","useful":0,"cool":0},"bx7JJP2p_mur_W7jdwXT3w":{"text":"I love me some dessert and Sucré was the perfect place to fulfill a sugar craving!\n\nMy hus","useful":0,"cool":1},"cJRVmA2X5Mscqgz1V6ir8g":{"text":"I didn't get to go to sucre but my hubby brought me a really good eclair from here. I thin","useful":0,"cool":0},"ws0dFm2itYfGxjAc2YwZRA":{"text":"Love this place. My favorite place to get a coffee and desert. Staff is friendly. Place is","useful":0,"cool":0},"JiXJ7_FDm_R7TqUyUKZxbA":{"text":"If you're ever in town, you must visit Sucre if you're in the mood for dessert! Highly rec","useful":0,"cool":0},"8d2p3_o2xZzXC9uoooZZ7w":{"text":"This is my happy place. Gentlemen, bring your ladies here. She will be happy. Starting wit","useful":0,"cool":1},"KQL2sWUK3omwcoJ4cqP4BA":{"text":"So I received another king cake in response to my previous review from Sucre'. This king c","useful":0,"cool":0},"7Ayv9lB7Wfrh2Eh9ZcmRbw":{"text":"Excellent gelato...tried the Tangerine and Mango...guess what, tasted like The most delici","useful":0,"cool":0},"KHgBcRJc0O3khm-ryayYAQ":{"text":"This place was okay. It was recommended to me by a friend and I was really excited to go, ","useful":1,"cool":0},"D7S0BBhg-tCwvd0auISoEg":{"text":"It was so awesome here! I had the vanilla gelato it was delicious. The only downside was t","useful":1,"cool":0},"NrbK4RHVrvlE-lJ2v6F0pQ":{"text":"The girl who waited on my son was nice and wore gloves to prepare his box of sweets. The l","useful":0,"cool":0},"rXHC6Vsr7zNrW9kNARgRqA":{"text":"We go delicious chocolates and macarons to go (they didn't last long!). Also got a cake an","useful":0,"cool":0},"4vVV8Qrnqn_pBk_Lx7GBLg":{"text":"Cute cute cute! My boyfriend and I grabbed some sorbetto from here. The staff was friendly","useful":0,"cool":0},"iW_ycFTa6iEmT6w053vHeA":{"text":"Stopped in before a tour really quickly and absolutely loved it. Really delicious ice crea","useful":1,"cool":0},"6xC4-qK177EofsbMW3Ag5Q":{"text":"Robert and his staff did an excellent job helping me surprise my girlfriend for her birthd","useful":0,"cool":0},"fvM6kr8xlx9vj9awfKcyWQ":{"text":"Sucre not only has the best King Cake around but superb customer service. I was in a pickl","useful":0,"cool":0},"Rj9Z1hhvfCrtS1A4qsHymA":{"text":"Sucre is an adorable macaron shop in the French Quarter. This is not the original shop I'm","useful":4,"cool":2},"bTjQb6j9oLYaLu-xfSfK7w":{"text":"Those macaroons, stramberry and vanilla ice cream and all the selection of sundays and des","useful":0,"cool":0},"thAJxB8dQLY3AGQTPJG6Wg":{"text":"Got 8 macaroons, 8 chocolates, ice cream, and kings cake #noregrets whatsoever. \n\nIf you h","useful":2,"cool":1},"XgzeOjsB68a3bA7XCjOrxg":{"text":"Linda who works at sucre is amazing. Her friendly easy going manner is amongst the best cu","useful":0,"cool":0},"neDF7lcdoxV6sHEuA8JqYw":{"text":"Very tasty macaroons. The staff needs some serious training about gluten free but we figur","useful":0,"cool":0},"rU_aKtFcK-6FjLICQFSPqQ":{"text":"I didn't actually go into the store so I can't review on that but I can review on the maca","useful":0,"cool":0},"WBbf9QgSguO-fbAF57ch7w":{"text":"Popped into Sucre to grab some caffeine after spending a couple hours at the Carousel Bar ","useful":2,"cool":0},"ER21kSgIbEWAIwxxT9bD3g":{"text":"Excellent macaroons. The gelato was also amazing. Sweets - great for gifts.  The bananas f","useful":0,"cool":0},"TnpNCxXIOrGso6pS8_Z1PA":{"text":"I'm normally not a gelato fan but WOW - this was light and sweet but not too sweet and per","useful":0,"cool":0},"ihMjG5m-4u9RtTB_Tw5BCg":{"text":"Definitely a wonderful french bakery. I had a passion fruit and almond macaroon. The passi","useful":0,"cool":0},"OilKxVKm3dkO1e5Tn8h3ww":{"text":"Yum!  What a great dessert after a great dinner!  My wife had the Triffle and I had the Ti","useful":0,"cool":0},"t8kNiL5bhlho2BosVKbrHw":{"text":"We got the chocolate Easter eggs and they did not disappoint! So delicious and spot on wit","useful":0,"cool":0},"zg3UGaVJ4vUfMTj98gvHKQ":{"text":"This is a beautiful little shop with okay pastries and very good gelato. Hubby and I stopp","useful":0,"cool":0},"RvPjJoRpiH_-UbkcVzq5-Q":{"text":"So my review of Sucre's going to be a little different than most. Why you ask? Well, becau","useful":5,"cool":5},"t0W_uRJuEYMpcopndEaTLg":{"text":"Sucre' was a sweet reprieve from the intense NOLA heat! The gelato is SO good, I had 2 sco","useful":1,"cool":0},"r5dtZQsNqLL1xc1Ah3mQCg":{"text":"We did not go to the salon, but this boutique full of sweets is out of this world! Let me ","useful":0,"cool":0},"Jr1FsUtSvljg2sP3Zy552A":{"text":"Tried the ice cream which was decent, but I felt it was nothing great. When we got there t","useful":0,"cool":0},"303IILAqItXA8WLZqTD4Ow":{"text":"This was by far the best place in New Orleans. They have such a wide variety of cupcakes, ","useful":1,"cool":0},"e4KJs0r5AoR6VtZt6Kvc-Q":{"text":"Great ice cream  prices are really correct if you compare with the quality and quantity. \n","useful":0,"cool":0},"kXJFHf9kojT3A_uyLBTMuw":{"text":"Love the atmosphere of the store. Very classy and well kept. Huge variety of different des","useful":0,"cool":0},"BIGL3iqwjwty5U2a9c-Shg":{"text":"I made so many rookie mistakes while visiting Sucre for the first time.\n\n1. I did not try ","useful":8,"cool":5},"ejxK-6kxHlia8lf8m9eLpQ":{"text":"Great gelato & coffee! Super friendly staff in each store I've been to. Chocolates are ama","useful":0,"cool":0},"sDzHXtzNoDVzlVfKayHH_g":{"text":"I love Sucre and all its prettiness!! You walk through the door and you are instantly in a","useful":6,"cool":4},"n6CsyH81XlSP03mOoPYbKQ":{"text":"We made a special trip to pick up evening treats. They were lovely! The shop is quite ador","useful":0,"cool":0},"TCpbmMLXGg4cg9KZ23neXw":{"text":"Spendy, as one would expect for an adorable sweet shop in a very touristy area, but the ma","useful":2,"cool":2},"DMwcVBoWT0iaivim2xD8yQ":{"text":"Fun pastry, dessert and coffee and tea shop. Artisan quality and presentation of their con","useful":0,"cool":0},"P636iFCQC3zYPmU9WDI4pA":{"text":"Tried the salted Carmel cupcake. The cake was dry. The only salted Carmel part of the cupc","useful":1,"cool":0},"tg_Cq9M6Zbmv5X8hlzsTQw":{"text":"This place is right out of Paris, like Laudree or Fauchon.  We really liked the gelato sun","useful":0,"cool":0},"HivUG4HTR_Mm8h_LoTE6zg":{"text":"Delicious desserts; beautiful to look at, heavenly to eat.","useful":0,"cool":0},"SDewy8KEV_VsuIkZKh-NYA":{"text":"We went here to get macarons and found so many wonderful treats!  We got some gelato - tha","useful":0,"cool":0},"axDybSwW1r61fIdZ6VFOcA":{"text":"Great place for a fancy NOLA treat - come in on a hot day to taste the many flavors of gel","useful":0,"cool":0},"qIR6gy83Kq5MehQZCLAtdQ":{"text":"Sucre is awesome !\n\nI wish they open one in Raleigh :). The staff were friendly and they w","useful":0,"cool":1},"y2r28tnl7vZYvq-ehMCTKQ":{"text":"Was here during Mardi Gra and I promised my fiancé I would bring him back a king cake. Stu","useful":0,"cool":0},"YdPD4hOqldM-3t_DYVhb8Q":{"text":"So, I'm a huge pastry nerd, and I came to sucré with high hopes. What my experience lacked","useful":0,"cool":0},"tn5I94IftTD3Yuurk10DvQ":{"text":"Very nice sweet treats here. Few tables to sit but the coffee and dessert was very nice. I","useful":0,"cool":0},"AeWoNV1MADpnu9b9uqSFmw":{"text":"Wow, such a great place! There are so many desserts and sweets to choose from and they all","useful":0,"cool":0},"EBpsAme7JqNp_T5bDkBeUA":{"text":"Toasted almond gelato and chocolate mousse cake, an unbeatable combo!!! Will day dream abo","useful":0,"cool":0},"qk0gPuLCK87ifc2__GUOgA":{"text":"It was a nice little fancy dessert place with gelato and macaroons. Very delicious and it ","useful":1,"cool":0},"non4H95kkkpUfjeNNVK7aw":{"text":"Nice service and great desserts! Love it.\nThe cakes and black coffee are good match! Unfor","useful":0,"cool":0},"B1QE5MR7M8O83E5sjRPY-A":{"text":"Super yummy ice cream! Nice employees and the ice cream is delicious, especially the Mango","useful":0,"cool":0},"NIoYB6ADZZfazKXTSUdOQg":{"text":"Deliciously overpriced desert, what's not to love! My favorite is the key lime cake and ch","useful":0,"cool":0},"5HcBFD277NpoNKe5LBBnpg":{"text":"OMG! My love of macarons started here and it's a hard act to follow. Wow! Pricey but worth","useful":0,"cool":0},"oRXvZ_lcQJ-RnazXmz-2mg":{"text":"OMG, I don't think I'd find such a place even in future. Amaaazing.\n\nSweet, gelatoooo, mac","useful":0,"cool":0},"jfI_elaVu47KGlwiECNl9Q":{"text":"The gelato was very good. They even have a peanut butter and bacon gelato flavor specifica","useful":0,"cool":0},"3g4ihWxswSA8PlVU31ho9A":{"text":"Excellent custom bakery! Gorgeous cases filled with divine treats. Bringing a King Cake ho","useful":0,"cool":0},"2l8kVEXZn9x6FD6gajbjgQ":{"text":"The desserts here are to die for! Not only do they look beautiful behind the case, they ta","useful":0,"cool":0},"yk4KT3IEA9s0xnb7kFObPg":{"text":"This place is fantastic. Don't leave New Orleans without trying their chocolates and macar","useful":0,"cool":0},"nXFPetB3tkLSIf9SyUCaWA":{"text":"Friday, 9:45 PM.\n\nQuickie:\n+ Food quality\n- Hygiene\n+ Customer service\n+ Turnaround\n* Vibe","useful":0,"cool":1},"Tk8cUfNWNaQIEjlIKrG7zA":{"text":"This is a great place in Nola. My daughter absolutely love the throw up ice cream milkshak","useful":0,"cool":0},"tfOAA-7AI3tHbvijV5fJqQ":{"text":"This is a cute dessert bar tucked away in the French Quarter. It was a 5 minute walk from ","useful":0,"cool":0},"70upcLfTyYgsDgfdt150sg":{"text":"Delicious macaroons, gelato and other desserts in this shop along Conti. Ask for a taste o","useful":3,"cool":2},"Wjw7c9RbWlwjWipv0cAqdA":{"text":"This place is great.  We sort of found it by accident in New Orleans.  The cookies and mac","useful":0,"cool":0},"gEd0GiFqakQgYivWd0aKLg":{"text":"Absolutely exquisite desserts that look as good as they taste! Soooo very good! Don't know","useful":0,"cool":0},"7VxCVsreGdISxnRMQyLwFw":{"text":"Delicious macaroons and King cakes. Plenty of seating space or you can take it all to go. ","useful":1,"cool":0},"tcNwUrEPeIKToglcR8o-Yw":{"text":"It seems in modern society you can put a hefty price label on just about anything in order","useful":0,"cool":0},"3oTn71UZc7GLkFmmyC0u3Q":{"text":"At first we walked by just after eating dinner. The line to order looked ominous consideri","useful":0,"cool":0},"LuIb3EndlDEfpUIs920rZA":{"text":"We tried the Wedding Cake truffle that the clerk said was her all time favorite.  It left ","useful":0,"cool":0},"DQPGtHZZ9yijze1XMbCHNA":{"text":"I had high hopes for this place but was left underwhelmed. The red velvet cupcake and sea ","useful":0,"cool":0},"JWECKDygG5MG6GXR_UXUXQ":{"text":"Delicious food, good service, comfy place, good location... Everything you desire for brun","useful":0,"cool":0},"C08cs-a4mbD2z0tf0mpqlg":{"text":"No no no... Sucre does not deserve 4.5.  The customer service was awful. Three members of ","useful":0,"cool":0},"tUVUfaZeTfpnw58wkjX0DA":{"text":"Bless this place. \n\nReasons I am sad after coming here:\n1. I only got to try the gelato\n2.","useful":1,"cool":1},"iPL9a32Fda_sPdPY2H_Avw":{"text":"I never knew what I was missing until I found French Macaroons. I'm so happy that we found","useful":0,"cool":0},"EGjKic285g-wkz2TYwEKcw":{"text":"Stopped by here while I was in NOLA for a conference. And I wish I could have taken this w","useful":0,"cool":0},"hEXt2VVVw3VYMYSvdFPEJg":{"text":"Cute place to take a little break and grab something sweet during an evening stroll at the","useful":0,"cool":0},"u7OrIHK-D4hZP46-VwTURw":{"text":"It's hard for me to rate any business so low but Sucre justified my validation. \n\nI've ven","useful":0,"cool":0},"eX86l-INFZyoCvP2-XPKXg":{"text":"I pre-ordered a King cake for my friend's birthday to be delivered on Monday before Fat Tu","useful":0,"cool":0},"DI5TWbZ2x44CexeHHevPOg":{"text":"Love, love, love their eclair!  Pastry, cream, chocolate perfection.  Thinking about going","useful":1,"cool":1},"CWlv5Fn6JeUj5pYIQTeFoA":{"text":"The deserts are delicious and the staff is friendly! The cakes are plated nicely. The chee","useful":0,"cool":0},"02MvhUd_KLE-LMQFShlrXQ":{"text":"The person taking our order got a attitude with us when we didn't hear something he said s","useful":0,"cool":0},"8nNjnln7Oi_r-3Hn1FHSRw":{"text":"Sucre is the sh*t. I tried the one on Magazine, and was instantly hooked. Their vegan coco","useful":2,"cool":2},"zqIs-5xf0DFLvoPMPfDvqA":{"text":"I immediately chose the piece of red velvet cake, as this is my very favorite food item.  ","useful":0,"cool":0},"eHBUZTeBa7UuCiXOAiQq6g":{"text":"Beautiful little shop, delicious desserts. My coffee was clearly the bottom of the pot and","useful":0,"cool":0},"9Ub1m-9yixU-7DF-EL91UA":{"text":"I ordered a special edition king cake online as recommended by a friend. I received the ki","useful":0,"cool":0},"3KuCb1tHWsSIgemFSo6xtQ":{"text":"Great Little find in the French Quarter! Was looking for some tea after dinner (since it w","useful":0,"cool":0},"tmwLkC8hgkt0ms01VWwrcg":{"text":"Tried the hazelnut & brown butter pecan gelato & it was like heaven! Staff was very pleasa","useful":0,"cool":0},"06c2OjliAtIbyNeFvdEFkQ":{"text":"Just crashed a yelp party at sucres.  The s'mores skillet was great and the service was ov","useful":2,"cool":2},"1Cis-BKzyEI_My906EZXiw":{"text":"Cute little coffee shop.  Immaculately clean, lovely servers.  The cold brewed iced coffee","useful":0,"cool":0},"0hgqL-Mo3jkJLQIOahxS3A":{"text":"Nice place for desert with a plethora of options from gelato to tarts, to Smores, to bread","useful":0,"cool":0},"U47m4SSSwVhh2eVkBniLGQ":{"text":"super expensive pastrys and desserts. macarons, gelato, chocolates, and little cakes. deff","useful":0,"cool":0},"GQRdaSU-GDuQ9YutBz9MxA":{"text":"I used to think Sucré was overrated, overpriced, and over the top with all their treats. (","useful":0,"cool":0},"1mUAGr1oWlWAoTDc4E8DoQ":{"text":"Amazing, amazing, Amazing!  Came here 2 days in a row, and if I wasn't leaving today id co","useful":0,"cool":0},"i385__AMznBQLevR4yp2Yw":{"text":"I went here for desserts to take out, after having dinner tonight and really wanted an ecl","useful":0,"cool":0},"tOXj2bMI8KxZYcFF1qNH2A":{"text":"I came in late on a weeknight and it was relatively busy. I got the dobash which is the al","useful":0,"cool":1},"WPZS3QgVPbqJvCtyERztOg":{"text":"We got the vanilla cheesecake. It had a cool jelly cover for Instagramming. Too small for ","useful":0,"cool":0},"-0RPBnFLCh4dNPiv8pRBCQ":{"text":"Amazing desserts! Must stop in and at minimal get a macaron. I never knew of this location","useful":0,"cool":0},"mexXfskNPbTqSVkraCGy8g":{"text":"OMG. I hope there's a Sucre on my street in heaven! The young lady who helped me was aweso","useful":0,"cool":1},"z79AaI7qmQIcdN5c0npfIA":{"text":"We were in New Orleans for a double 50th birthday celebration and when the cake didn't sho","useful":0,"cool":0},"RGtiq_A6sfOvKHYHGzWo5A":{"text":"Very nice macaroons and gelatos. Also had the double shot espresso which had a lot of crem","useful":0,"cool":0},"sxT5MHWVB_RlpzC03BubWQ":{"text":"Loved the decor, cute desserts and very tasty however not enough seating. The gelato is li","useful":0,"cool":0},"g-ZfPf4E7JWRHgJ2djRFMQ":{"text":"I knew this chic little dessert spot in the French Qtr. was going to be a pricey treat, so","useful":2,"cool":2},"5pvVYIgGCdE0LXK_0-azyw":{"text":"Great little dessert shop in the French Quarter. We ate upstairs at Salon and we're able t","useful":0,"cool":0},"scuYzIwO6vawre5FEJSF5g":{"text":"This place is awesome! I ate brunch there and the breakfast sandwich was phenomenal. The b","useful":0,"cool":0},"sWpWSYvmoYuH1psSmYF38A":{"text":"I wanted to give 5 stars but then I thought, \"when is there really NO room for improvement","useful":2,"cool":0},"q8i9Grs6WmvG33kYhV7jdw":{"text":"Beautiful desserts, candies, cupcakes, chocolates, etc... We stopped here twice during our","useful":1,"cool":0},"-taOjv0d5YOOm9-ImXFrXQ":{"text":"5 star easy rating\nBeautiful decor....\nEverything great, but we really enjoyed chocolate c","useful":0,"cool":0},"yk5hDqS8dbvbankSKfrRdA":{"text":"Good place! Nice ice cream and very good coffee.\n\nI got a malt ice cream and an expresso. ","useful":0,"cool":0},"CEDObRDHNkSUBwGMJ_-WLA":{"text":"Still excellent. They have great chocolates, macrons and pastries. They have seasonal flav","useful":1,"cool":1},"mo1K59zcfnHWG8HhJyxxsA":{"text":"Stopped by with my boyfriend during our last hours in NOLA. It is a very cute place with p","useful":0,"cool":0},"UNdMjTknOSJDWVeP2VbiKA":{"text":"This place is busy so know what you want to order and place it if not you might be waiting","useful":1,"cool":0},"9sX3HvHJkAuVfJ0Dj7iFcg":{"text":"Gelato and desserts/baked goods are quite good.  The service was good, and they let us tas","useful":0,"cool":0},"C7B71OZeeUb_fUUDzTeoLg":{"text":"We had delicious chocolate cake with butter pecan gelato and a warm brownie with nuts. The","useful":1,"cool":1},"k0mQ3Z8ho3CshZMMsNEh-A":{"text":"Great treats, terrible service, multiple times.  Train your staff to help patrons rather t","useful":0,"cool":0},"92p0JnKJH9B3AtfJTfDO5Q":{"text":"Delicious! Nice selection of macaroons, gelato, and chocolates. A little pricey, but not a","useful":0,"cool":0},"83KH_MUvsbgbE0dCASPQlQ":{"text":"Great dessert spot with tons of sweet delicacies. The desserts are a work of art. I tried ","useful":1,"cool":2},"3PSsWgMI9yA438nE4hnBaQ":{"text":"I really wanted to like this place - mostly because I LOVE macarons (not to be confused wi","useful":4,"cool":1},"wPwC27jJ49MbHk3hzPbTng":{"text":"Sooooooo good!! Stopped by since I saw other people holding their bags and boy oh boy am I","useful":1,"cool":0},"LNedvRdTSvPFHrC1T6OOww":{"text":"This is my absolute favorite bakery in all of New Orleans. Macarons are beautiful and deli","useful":5,"cool":5},"pjkrJXsXsD27Mmvmb0WdDg":{"text":"Awesome gelato and loved the chocolate mouse. Butter pecan gelato fabulous. \nVery sweet pe","useful":0,"cool":0},"1PghS0poS5jwAXSAmEUTYg":{"text":"What a lovely shop! I have quite the sweet tooth and I enjoyed their banana cream pie, ecl","useful":0,"cool":0},"EObTAqfqX97FUp9oUVDECQ":{"text":"Forgot what I had here. It was something with coconut.  Yikes! How spoiled am I living rig","useful":0,"cool":0},"cIZDDsjlbO9IX9yTWYKJIA":{"text":"This place is adorable and delicious. We had cookies and cream, coconut basil, and cotton ","useful":0,"cool":0},"GxBAWSQoiMyUVQ9zN3-nYw":{"text":"Decent coffee, but over-priced.  Would look elsewhere unless you are in the market for a $","useful":0,"cool":0},"cjtg5BrADxsYRvJwWDezIQ":{"text":"We went to New Orleans on vacation and brought back sucre chocolates for family and friend","useful":0,"cool":0},"KgFo9Wq4DW72quEa4FVLTg":{"text":"Amazing desserts, macaroons, ice cream  and holy cow the white chocolate bread pudding wit","useful":0,"cool":0},"zSjqitkxrpTSHvAQ5IBAlA":{"text":"My friend and I stopped by to get ice cream after our meal in the French Quarter. They had","useful":0,"cool":0},"4dZpl-vGOJdeqj-Kq6Wd1A":{"text":"Their deserts and chocolates are to die for!!! They are pricey for sure, but well worth ev","useful":0,"cool":0},"s7HAgvzivxC6_ug1rwkbJQ":{"text":"I tried macaroons for the first time here! I fell head over heels for them and I have plan","useful":0,"cool":0},"KzDSQzocykgKLIvaGUtfoA":{"text":"I came here with some friends after dinner on a Saturday. It was busy, but not too busy.\n\n","useful":0,"cool":0},"osRX6j7IW2S1ms3dgHPUXA":{"text":"The desserts in this cafe just like arts!  Such beautiful and fancy!And the coffee is also","useful":0,"cool":0},"SiGBQMKY_X7364_Nj-cyjQ":{"text":"Bomb. Bomb. Bomb. This is literally one of the best patisseries I've been to. The trifle w","useful":0,"cool":0},"zd0C2GqugEv1IL1ANflqxQ":{"text":"Regret is a dish served sweet. I think I just made it up, but it's so true. My friend want","useful":3,"cool":3},"GG2g0l766mmoXsXbXf3tDA":{"text":"Stumbled upon this place while looking at Yelp in NOLA. As soon as we walked in we were gr","useful":1,"cool":2},"WLVvgcdy3sRDcOGK1FLsNA":{"text":"The macaroons are fantastic, but really expensive. Well, I not expert on French baking, my","useful":0,"cool":0},"9ozDI8HQP34kvMEw4HQjjw":{"text":"We got the mint chocolate chip and mango  gelato. The mango was the shining star of this p","useful":0,"cool":0},"CCTBp1MTdhwT8QMR2lBOHg":{"text":"Wandered in here one night on vacation intrigued by the colorful goodies in the display wi","useful":0,"cool":0},"H_S6BtWyAYhCNuoabROJyQ":{"text":"Super sweet place, literally.  I loved this cute place.  It is a candy store, dessert bar ","useful":0,"cool":0},"rXD62LVf1ySbSLgg2VTSVQ":{"text":"I loved this place!! We had two desserts and they were licked the plate good. The raspberr","useful":0,"cool":0},"JtTWAwTbr02P1m7NjaaUDw":{"text":"Delicious desserts and great service! On the pricey side, but totally worth it in my opini","useful":0,"cool":0},"RXFK6lqCg0kPjct4oBSIfw":{"text":"This place has great desserts. Macaroons, cakes, truffles and many others. Also offers gel","useful":0,"cool":0},"wsh49_P8ckpzjyuw8ALzBg":{"text":"The girl working today must be new. I've never had a bad experience at any sucre before un","useful":1,"cool":0},"v6R3wDMxvXGMct3NfG_P9g":{"text":"This place has some of the best pastries! Presentation is very exquisite and the flavors a","useful":0,"cool":0},"ZgteF6JynNiwplo5v0Qn4A":{"text":"Very unique shop with interesting and delicious flavor pairings. The staff were all extrem","useful":0,"cool":0},"RHBAUNVgM6x-RXaVpCvQsw":{"text":"Sugar heaven.  Macarons. Gelato. Pretty pastries. The only thing I was disappointed with w","useful":2,"cool":1},"ipapoWLQzvNGk980DO7n_A":{"text":"Absolutely perfect! Any flavor you desire to satisfy that chocolate crave without over fil","useful":0,"cool":0},"iCWORZQFdFXLiOh9E4PVdA":{"text":"I love fancy desserts and sweet shops! This place is absolutely adorable. I came here for ","useful":0,"cool":0},"y2WzDJMj4z-_vCJPsiq_6w":{"text":"I moved from Louisiana to California years ago... My friends are visiting New Orleans for ","useful":0,"cool":0},"KJi2GJ2D-YEwXch_pWezew":{"text":"This is by far one of the best tea and dessert places you'll find in the French Quarter!  ","useful":0,"cool":0},"NTyDmjQPMGWJBItByqB1jg":{"text":"This is on a quieter block of the French Quarter, next to a government building, so it see","useful":2,"cool":2},"s_BY_0y5ei362Vv2Ega6qg":{"text":"During a trip to New Orleans, we got a bit of a sugar craving one afternoon. We were able ","useful":1,"cool":0},"l3PTdx6uF-jlc8vIKQOqXQ":{"text":"Great service!  Cute little shop for a late night stop after dinner. The cookies and cream","useful":0,"cool":0},"xHMuYXJAw8f_ydZsaaFWVQ":{"text":"I can't help but give Sucre a resounding 5 stars. This place puts Bottega Louie (in Los An","useful":6,"cool":7},"sfzAt4E8lnmg4St0mKwIpw":{"text":"I would give you 5 stars for looks and detail, but only 2 for flavor and texture. Everythi","useful":0,"cool":0},"8vngR41-w1DwSnyaOxNrtw":{"text":"Very trendy!! Nice people, good service! Amazing americano. Very delicious pastries!! This","useful":0,"cool":0},"yydp8CvG27dU4Z79TeeI3g":{"text":"We have come here several tines as the iced deserts are pretty good. But in the beginning ","useful":0,"cool":0},"yzQt7xRwTBQsOaj9Xc6I8A":{"text":"Not a dessert person but a must try place before you leave. The sundaes and gelato were aw","useful":0,"cool":0},"Vrcz4LBu4R6X1_oZIvYfig":{"text":"We've visited 2 of the sucre locations and think it is a great place to stop in for a trea","useful":3,"cool":0},"mRdmFPjuepHOvgrNlkkTXA":{"text":"Exorbitant priced tourist trap. Nothing to write home about , their world famous dessert w","useful":1,"cool":0},"t8MQ6Mjp-DmsnrkMiO6pHA":{"text":"2 stars for the cookies that I purchased to-go. \n\n Maybe it's the fact that I grew up list","useful":0,"cool":0},"UsxrRlhu0c9tPkKIgju9Zg":{"text":"We ordered the affogato with almond ice cream and it was delicious. I also took a cupcake ","useful":0,"cool":0},"PPIcqHvX_H_4-9HRfnMBKg":{"text":"Okay, I would have given them 5 stars since the macaroons were delicious and the young lad","useful":1,"cool":0},"HubuCCFvG65Ig0PwHPnySQ":{"text":"The ice cream wasn't very creamy and the cupcake was dry- I don't understand why this plac","useful":0,"cool":0},"OVGDpRzxWEujl2RFjQVU9Q":{"text":"Delicious! My favorite spot to get sweets especially the candied pecans .. mouthwatering!","useful":0,"cool":0},"BTonKIrwXl5uwZqsnIbt3A":{"text":"Didn't get a chance to visit this location while I was in New Orleans but heard it was awe","useful":0,"cool":0},"zQZ2hgHVK2j_Xq6-Ew1JCg":{"text":"A-MAZING!\n\nIf you have a sweet tooth at all please please please check out this adorable l","useful":7,"cool":9},"mhNwkLr4yCstkV6ivFe4wA":{"text":"Delicious!  That's the word that comes to mind when thinking about this place.  The coffee","useful":2,"cool":1},"cVTYw0Wjh6eakQcv-NoPjQ":{"text":"Love the macaroons and the chocolate. I would definitely visit again when I go back to New","useful":0,"cool":0},"Lyhi-nQ94FxZ5hwzXT2jZA":{"text":"A dessert shop smack dab in the middle of the French Quarter? I'm so there. After having l","useful":4,"cool":3},"yLqNM1ofpDkJy9IkhlKpeA":{"text":"I'm so happy we popped in here on a whim. I have been craving cookies and cream ice cream ","useful":0,"cool":0},"v83g1L3zFIDPLI6dvN3Uxg":{"text":"Cute spot for macaroons and sweets. Very cute place. Upstairs has tables inside and outsid","useful":0,"cool":0},"Uy5sd2sB4WioiZVXXxEBaQ":{"text":"If you go to NOLA, make sure you visit this little joint. My wife and I go there every tim","useful":0,"cool":0},"SLg0xkpJBUq1BZjT5M_2Iw":{"text":"Mind blowing desserts, Found this place because of the macaroons and stumbled on heaven! T","useful":0,"cool":0},"pryxVKTwo7o2rx02souWTw":{"text":"There are so many desserts to choose from and it's overwhelming in the best kind of way! T","useful":0,"cool":0},"zJDhCnukxTdSlbNkeH7CFg":{"text":"Stopped in to buy a 15 pack of macs for our spoiled rotten Grand daughter Sienna. She will","useful":0,"cool":0},"dJt6UIF3wzImwxyI1wRb5g":{"text":"How can you not stop into this charming crack den? Enjoyed a simple vanilla macaroon and 2","useful":2,"cool":1},"WkoJpDmycKP1NRZiJRAyKQ":{"text":"I love desserts, so I was excited there was a cute spot by our hotel. I stopped by twice d","useful":5,"cool":4},"ZA2stUjQbn8Qorsm_AoKzA":{"text":"Other than bookmarking this place before visiting New Orleans, I pretty much went in blind","useful":1,"cool":1},"7mtT3p9pwFalf2oQC-tuog":{"text":"If you have a sweet tooth, you must come here while in New Orleans.  I'm fairly sure there","useful":0,"cool":0},"dE6Cnlx4kFNpkmMSYKSjxg":{"text":"So much fun, great desserts. We got ice cream, nectar and coconut basil. Can't wait to go ","useful":1,"cool":0},"BrF3gZjS_4-Goj9n_bbbUw":{"text":"At first glance I thought they only sold macaroons because of their window display. I was ","useful":0,"cool":0},"jVkFFtriDO2l8DvvtYP_AQ":{"text":"I stopped by to try one of their famous eclairs. My eclair certainly looked pretty, and it","useful":0,"cool":0},"_v0B387Bq1P56ypbuLfltA":{"text":"Plenty of different desserts! I had macaroons which were amazing. My friends had a cupcake","useful":0,"cool":0},"AAZf43kFIFAqSqGqdlIzig":{"text":"I loved this place! I ordered the mango sorbet, super refreshing. Perfect to enjoy your ic","useful":0,"cool":0},"EuVWrwM-eaZ7Yn8Mj5aaXA":{"text":"This is a nice, local patisserie chain. The macarons are really good, with a diverse array","useful":1,"cool":1},"cfoYJuaTTolPvjmQbaGy7g":{"text":"I am eating heavenly ice cream. The ladies working here are friendly and warm. I need to c","useful":0,"cool":0},"_At9XVnyaencs-k8wvNZPw":{"text":"I love their macron cookies!  They are light and delicious. The first time I ever tried th","useful":1,"cool":0},"RjIsxPIisOFd4_UvQ5wtgg":{"text":"We didn't have time to stop at Sucré for a sit-down dessert experience, but we stopped at ","useful":1,"cool":3},"ItIxNhvWtHX_HwTAt4QLTQ":{"text":"This is the place for delicious macaroons in NOLA. We stopped and grabbed a few different ","useful":0,"cool":0},"mxue5eLGAd9zRDtB2G-JQA":{"text":"We went to a private bridal brunch here and it was some of the best food I have ever had. ","useful":0,"cool":0},"MomCFIf_zwzp9ocdTN9y8w":{"text":"Heaven. Sugar heaven. I decided go big or go home so ordered the gelato po-boy. See pictur","useful":0,"cool":0},"JIe7p8QFLCJOp6I7OAefow":{"text":"Sooo good! Perfect little spot for desert. I had the strawberry champagne desert which was","useful":0,"cool":0},"TOnUWoyniRyvV0SFVaZOQA":{"text":"Got caught in a deluge yesterday and decided to stop in for some ice cream and sweet treat","useful":2,"cool":0},"QKgEqOe3b3RTlaI1z6ByvA":{"text":"I was in a store on Royal Street when they received a Sucré King Cake as a gift. Although ","useful":2,"cool":2},"61vZzrCzAdVROTGpP5uzvw":{"text":"Saw this place and was enamored with the beautiful desserts, so I knew I had to try it. Wh","useful":2,"cool":1},"Hga9tR1iVXpUVPG0yq0d_A":{"text":"A good and unique variety of gelato flavors and they will let you try as many flavors as y","useful":0,"cool":1},"I6hJY8CFxXQn4MAojnTBjw":{"text":"Great Macarons specially chocolate one!\nAlso try the hot coca chocolate bites, delicious !","useful":0,"cool":0},"XxZwe1aTn8_WGbNE69AENw":{"text":"Delightful. Decadent. Delicious!!  This beautiful little confections café makes even more ","useful":0,"cool":1},"DvTySUjE-P32zlLANQqAiQ":{"text":"Cute cafe right in the French quarter. I forgot what this blueberry dessert was called, bu","useful":0,"cool":0},"e8al2Ty3QhiQGrPtOa5kjA":{"text":"Sucre is a sweet little gem riiiiight off the main drag in the French Quarter that manages","useful":3,"cool":0},"NNmYgQ85S5MZf2Wpu71W8w":{"text":"Meh hype did not live up to the experience. A fancy small bite was $7.50 which would have ","useful":0,"cool":0},"ohatgfWe-9BO64hsfKsUeA":{"text":"I came here on Lundi Gras and we were able to find a seat inside and received our food in ","useful":0,"cool":0},"xx7CiPqy6sLOlrpliVcGzw":{"text":"Dee-licious gelato!!!\n\nWe went in because we saw someone walking on the street with a cup ","useful":0,"cool":0},"4b7iQA8eYzorljzEX1mO2w":{"text":"Oh damn. We tried a bunch of things from here. Our favorite was the smores skillet that ca","useful":0,"cool":0},"GXdGv__wA9Z-bqgw5gN8fw":{"text":"Delicious! So many options to chose from. The eclairs were fantastic  A must try when in N","useful":0,"cool":1},"C3K23DaRjc33Rn0HB4ZKdg":{"text":"Stopped for macarons; they were amazing! Not super cheap (around $2 each) but definitely w","useful":0,"cool":1},"3bNxge8r5DJNsxXtbRgAiA":{"text":"Awesome looking desserts, made us want to try their Chocolate tart which was honestly fabu","useful":0,"cool":0},"CpC9ugLbVTMxs3RHD96Rqg":{"text":"Had a very good delicious snack tonight after dinner. I had a pumpkin Napoleon and a very ","useful":0,"cool":0},"0z4XokkcorzdrBdhas1v2w":{"text":"Eclair was two stars. Mango sorbet was three stars. Eclair was overpriced and super small.","useful":2,"cool":1},"T5JhH9spCa7Uc0yOkY6QVA":{"text":"Happened to stumble upon this charming upscale dessert shop after enjoying a dinner nearby","useful":2,"cool":2},"LXQ3dtXS-lJIGoQ1fRLBTw":{"text":"Literally obsessed with this place. \n\nI loved everything we had in this little dessert sho","useful":2,"cool":1},"3h3-gTnlrPPLOaPbKjADOA":{"text":"This is small bright and trendy place. Their gelatos are pretty good and the small cakes a","useful":0,"cool":0},"7l6Ft3diVHGp8YD1jAsj8A":{"text":"Our very 1st. visit here & we love it! The girls are so nice & friendly. One of them is fr","useful":0,"cool":0},"Qzcwkj3gUZQ30hfWjqZWKA":{"text":"We were walking back to our hotel on a hot September night when we stumbled upon this spot","useful":0,"cool":0},"IaotZXk9M2tBP02k8hkmUg":{"text":"Sucre seems to be a thing in New Orleans based on the fact that I spotted their macarons f","useful":1,"cool":2},"Q-KTsUsGXHsdzUKzYUQq4g":{"text":"Best coffee Ive had in NOLA\nThe balcony area is amazing\nThe idea of a dessert place and a ","useful":0,"cool":0},"VxLMk5a9WKjGTNoKyObSgQ":{"text":"This is a must go to with my kids. Being in the food industry my kids have learned to appr","useful":0,"cool":0},"5rozbSQ9J2ma9RBJ9olbcg":{"text":"I didn't even know I liked macarons until I started going to Sucré--now I eat them all the","useful":0,"cool":0},"OBQJvGZujOLmha0wcZzElg":{"text":"When in Nola, don't leave without trying this place.  Desert heaven.\n\n\nMy favorites to get","useful":1,"cool":2},"Um4WhwKcmZ_Jvj9aWh1GXw":{"text":"Such an adorable Parisian-esque pastry shop. I was overwhelmed by all their macarons, past","useful":2,"cool":1},"wxrRr2ubNH845gLtgZhrEQ":{"text":"This place was fantastic! Great service and it was super clean! Loved the atmosphere and h","useful":0,"cool":0},"PY0nl7rcbGfDKivo9Lso-Q":{"text":"Toasted almond and pistachio, a hit! Pricy but good icecream. Should have tried coconut ba","useful":0,"cool":0},"gWDVh4CLOWbwkuVn52M22Q":{"text":"Great little hole in the wall with fancy pastries, macaroons, and New Orleans famous king ","useful":0,"cool":0},"Syn9mP5RXz2cbxc9tYmxvw":{"text":"I loved this place. It looks really cute inside and wasn't super crowded. There were a few","useful":0,"cool":0},"LnBS4VCSotBweWM8YW2JVA":{"text":"I arrive at Sucre.\n\nTea: requested\nDesserts: ogled\nTastebuds: exploded\n\nI am forcibly remo","useful":1,"cool":0},"7Xl4N9FWTx4Uk_JfR_UF0A":{"text":"Desserts are beautiful, but aren't executed well. Despite business being very slow when I ","useful":2,"cool":1},"uOBLSmEpgee9xK1GGMcD3Q":{"text":"This place is amazing! Came here for a treat after walking around exploring the French qua","useful":3,"cool":3},"t7jEMWewimPc--m1WXTItA":{"text":"Everything looks beautiful!  I was greeted as soon as I walked up to the counter.  The ice","useful":0,"cool":0},"kzFBc9S1JNzxC-mP4HtH7Q":{"text":"My girlfriend and I came to Sucre after having had a nice meal a short distance away. We w","useful":0,"cool":0},"2alsDtlo5XrZl89sga48eg":{"text":"Super friendly people and really great desert. The brownie and King Cake are top notch.","useful":0,"cool":1},"W-jXQ5myCKFA5flvyxioXA":{"text":"Only had gelato but it was good. Wish I would have seen the cupcakes before I ordered the ","useful":0,"cool":0},"Im7wBdaEWjiYdmhKIujOPg":{"text":"Sucre is pricey but worth it. We tried the rose sorbet and four different macrons. All wer","useful":0,"cool":0},"TluqHYMTa14Layfdg7cLWA":{"text":"I came here once with my husband and then with my family, everyone LOVED it! Their Gelato ","useful":0,"cool":0},"r1JJVBtJ4Q8IifJfqt2xCw":{"text":"Best gelato I have ever had! Went here almost every day of my trip. Would recommend the co","useful":0,"cool":0},"0cLMdB1OHF0o9YjhY7OMlQ":{"text":"Beautiful spot. Delicious treats. Lovely selection. The nicest little to-go boxes I've eve","useful":0,"cool":0},"JhJMEshgk56e_FdE-XFXxA":{"text":"Cute little pastry shop. We had eclair, gelato and raspberry mousse. It was not mind blowi","useful":1,"cool":0},"vr9Zv4N_lqLsn1-PFKWvpA":{"text":"Beautiful, delicious chocolates! Their macarons are gluten free, desserts are beautiful an","useful":0,"cool":0},"VBjTM9JL0vNTddAsCWLvzg":{"text":"Delicious. The macaron, cupcake milkshake, and gelato were yummy. The shop was really cute","useful":0,"cool":0},"Z9fHl9dZJl4MzLOfxKh7eQ":{"text":"Fantastic. Amazing flavors -- rich, well-made. Some creamy, some more fruity / less milky.","useful":0,"cool":0},"FUqN33cIckd8sGGLt_vYfw":{"text":"Sucre was one of the highlights of our New Orleans trip! Some of the best desserts I've ev","useful":0,"cool":0},"SzoQ_VYdp56QrdYIZk6QRA":{"text":"The cupcakes are so disappointing. I'm actually kind of pissed because I asked the check o","useful":0,"cool":0},"3y9aMzMkRChhRVLooCvLRg":{"text":"I had a gelato (light and refreshing) and my partner had a macaron (flavorful) and a speci","useful":0,"cool":0},"cJAj7kHktatZfbijoUHEJA":{"text":"Great spot to take friends and family that come into town to visit! It's in the heart of t","useful":0,"cool":0},"8Eu3k0oQq-blDpe16M7pww":{"text":"Disappointing gelato, sampled several flavors and went with the Charlie's brownie + chocol","useful":0,"cool":0},"m-VRNgQTnnIHPXbF3AEpQQ":{"text":"Soooo Goooood! I wouldn't say this is a must but if you're looking for some gelato to fres","useful":0,"cool":0},"DuTzf7irrRIcZbXcQy-tUg":{"text":"This is a great dessert spot! This location specifically is more calm but still all the go","useful":1,"cool":1},"-vkllmQw2Gl8VclfJcUqXQ":{"text":"We love Sucre!  Don't leave New Orleans without a visit to Sucre on Conti for an 8 count o","useful":0,"cool":0},"i0dGieA2sV6r9_-D_mNfaA":{"text":"What a cute and incredibly clean dessert shop. Thanks to the owner for being from NY and h","useful":0,"cool":0},"e00Ee79TWy0qrCnHa9D6Nw":{"text":"Night and Day experience from my previous trip to Salon/Sucre. I found it difficult to wri","useful":1,"cool":0},"GpCYibNmLC0dpTDpuALWAA":{"text":"Why this place is so hyped up? Icy and tasteless ice cream and super overpriced macaroons!","useful":0,"cool":0},"daczrzxNLtaPLCFEDPf0fg":{"text":"Great gelato, desserts, and espresso! And the customer service is outstanding. So happy we","useful":0,"cool":0},"lIb_Qx1DkNTtbmTwtAZmzA":{"text":"My friend and I stopped here late at night after a couple of drinks on Bourbon Street. It ","useful":0,"cool":0},"smZTP_4vT9ecW-RwfX_8Kg":{"text":"I stumbled upon Sucré while exploring the French Quarter. I'm so glad I did! The place is ","useful":1,"cool":1},"bPzuaMVlKgI1zxS9N2oDDw":{"text":"Ice cream was OK. Getting fewer stars here because the chairs and tables were extremely di","useful":2,"cool":1},"SLoIJoNqbEoxcuEOTC0F1w":{"text":"We had the High Tea Special and it was the perfect splurge and afternoon. Our waitress was","useful":0,"cool":0},"eH2wkpGgZfURbnHifE5egQ":{"text":"We ordered a strawberry cupcake and a red velvet cupcake. The strawberry was decent but th","useful":2,"cool":0},"gQMUuv64XPTF-Tlt3Ay69Q":{"text":"Went here with my wife, who is FINE, during Mardi Gras. They primarily serve desserts. The","useful":0,"cool":1},"dq9DUVQLV6j4E0la8TJ8Xg":{"text":"I have long heard about Sucré a dessert haven featuring some of the most beautiful and art","useful":1,"cool":1},"yihGTQXGuIT_D84tG6MFOQ":{"text":"There are five vegan gelato options to choose from. We opted for the coconut basil and ras","useful":0,"cool":0},"hs_1_vhh_l1BiJ9xaUy0Ag":{"text":"Wow, quite impressed with the number of options here. Chocolates are just okay, but the ma","useful":0,"cool":0},"_Z9OIgJgGDRsHx3AbWCh0g":{"text":"I was given this recommendation for \"the best king cake\" by a local New Orleanian and was ","useful":0,"cool":0},"PagIIMYS0b0HVcAT0X1zBQ":{"text":"So I stumbled upon Sucre while searching Yelp for dessert places to try while in town on b","useful":0,"cool":0},"Jsad64kNbhvkbVqsvvOVhw":{"text":"This fancy confectioner and ice-cream parlor offers gelaoto and chocolate truffles that ar","useful":0,"cool":0},"gVtMa1fPFUwO5JqoUbYjrw":{"text":"Amazing chocolate! It's like Saks 5yh Avenue gone chocolate streets of heaven! They have g","useful":0,"cool":0},"t8hGu63ypBPaL4pFcEWv6Q":{"text":"This place has good desserts and they sell sundae and sorbet. The sundae flavors they have","useful":0,"cool":0},"KwRefiPsYZWnBofKzz7U-Q":{"text":"Wonderful place to grab dessert after dinner! I recommend the blackberry cobbler macaron. ","useful":1,"cool":1},"TmhpaDBkREvBL9eXFErXbw":{"text":"This place was cute! Nice little shop to stop and have a break from walking the French qua","useful":0,"cool":0},"OL-VwLZ2evoV9Dxicx7ccw":{"text":"Strawberry creem pie was bland but the tiramisu was Devine. I also had the Grasshopper and","useful":0,"cool":0},"qUwmJKEWYB57oXqOD38tnw":{"text":"This was so over priced for what you get.  I found the items we bought to be nothing speci","useful":1,"cool":0},"G5tuXQ5iZXyI5HCvRAPyhg":{"text":"This is absolutely the cutest spot for a sweet treat!! The ambience is modern and the dess","useful":1,"cool":0},"gZ1C1gF1bo9gfT14Nl99cw":{"text":"The king cake was so great and moist even three days later when we opened it and had our c","useful":0,"cool":0},"nJbA785ishE03ylj1PjHog":{"text":"Sweets galore. Upscale for sure. I didn't have any problems finding what to purchase. I wo","useful":0,"cool":0},"FLL0g4SJfYgJOu9jf1Rofg":{"text":"I loved this place. Staff was super kind and helpful. The macaroons and ice cream are deli","useful":0,"cool":0},"Xb3_fYhQYciF4B2gR_splQ":{"text":"Bread pudding was to die for! Must go again before leaving town. Everything looks so delic","useful":0,"cool":0},"vG4IkgtcksEksTCICT25ew":{"text":"Was a short walk from my hotel. \nStaff was nice. Pastries were pretty, a lot to choose fro","useful":0,"cool":0},"hWV3VqDfIKYvZtetNZkTaw":{"text":"I had the most delicious gelato here. I was so pleased with the atmosphere and service tha","useful":0,"cool":0},"F4R10PzO7mQ8RKK6tok0RQ":{"text":"I had the famous eclair. It was definitely better than your average dessert. It isn't in m","useful":0,"cool":0},"i70WKWTwAH9d1G_aCeCPLg":{"text":"Great dessert place. I went to a Hendricks gin event upstairs which was super cool since t","useful":1,"cool":1},"4Q6Ine_n4IFxkkaufKmWWQ":{"text":"We were visiting New Orleans and found this place looking nice from outside. So me and my ","useful":2,"cool":0},"jNvVYhPx5bmDkIuxhzJwmw":{"text":"Love this place! Macarons are excellent, just how they are supposed to be. My favorite wer","useful":1,"cool":0},"wn7ixN79BIhqML7Hm8q1PA":{"text":"Stopped by for a quick snack, got us some Macaroons and Tira Misu in a cup. Everything tas","useful":1,"cool":1},"Doue3rVCUx6HfwASGEP0xQ":{"text":"I was so excited to visit Sucre - counting down the days, in fact, to when I would get to ","useful":0,"cool":0},"Cri-OFEFJQYckD9ivs37gQ":{"text":"This is a beautiful pastry shop. The inside decor is fun and lively.  Spacious with seatin","useful":2,"cool":2},"Dn80SROpNsuQCJNUhpoq3w":{"text":"I had bookmarked this, I can't remember why. But now that I have been, I won't forget why!","useful":5,"cool":4},"MuiO8GxUwa_uTqaWvHC8ZQ":{"text":"Seriously over hyped but worth going if you're a tourist. You have to try a bunch of thing","useful":0,"cool":0},"ygBt_T672GHiP4a83V9w2w":{"text":"Ever decision I have Ever made at Sucre has been a success. None more so than the decision","useful":7,"cool":3},"wocHFi6jzrmNmo9ULDA9fQ":{"text":"5 stars for the king cake and the Caramelized Hazelnut bar! Both sweets were beautiful and","useful":1,"cool":3},"9Qv0tdLA1eAh8xIsQ6PdVw":{"text":"The hubs and I had our first kings cake at Sucre. They serve it warmed and let me just tel","useful":0,"cool":0},"AzBXubxRTboWiNnOg87duA":{"text":"Wow, that's the best word I have for this place. Located inside the French Quarter- so wor","useful":0,"cool":0},"DvkJBETT8nwYAAKrDE2N9g":{"text":"Simply put, scrumptious. So many colors. So many tastes to explore. \n\nBrilliant presentati","useful":0,"cool":0},"f85ni5YJ2F9MwFiDUTXGoQ":{"text":"The dessert here are just decedent. I felt like I gained 10 pounds by just looking at the ","useful":1,"cool":0},"KnjCLDUWEfl_Y3m_jCmNgw":{"text":"This place is such a great dessert spot. We stopped by Sucre after strolling around New Or","useful":0,"cool":0},"SSVU2DAP42kjJyowjbku8A":{"text":"This is a cute dessert shop at the French Quarters.   They have pasties, gelatos, macaroon","useful":2,"cool":1},"qsIBcERh6rre-PNM2gjeug":{"text":"Absolutely delicious brunch!  The crab macaroni and cheese was fabulous.  Desserts are inc","useful":0,"cool":0},"0yUODNMk4hzMK7-mkpKxGw":{"text":"Yummy place after strolling the streets of NOLA. Much needed sugar fix and this is the pla","useful":0,"cool":1},"yFsEnnjH7_o-ClSjzfRwiQ":{"text":"The amazing store front display of macaroon towers is what drew me in. \n\nThe exquisite box","useful":13,"cool":12},"EoEUQlkcMajN2SPepF5-Vw":{"text":"Gelato was delicious, but the day we were there (early June) the selection of sweets was m","useful":0,"cool":0},"uuDBbRjGWqROvz-Pd74bWQ":{"text":"This review is based on walking in and no care from the staff here if I'd like to order an","useful":1,"cool":0},"1S4kryz--xFi-mxIvCI5Cg":{"text":"Very cute shop. A friend had been wanting to go here and we are in New Orleans on work thi","useful":5,"cool":3},"x9EeB9sY1mCkVKzFY5vIQQ":{"text":"This is a great place to stop for dessert and a coffee while touring the French Quarter. T","useful":0,"cool":0},"aHQGnajY_HMUIKaZuMbkrg":{"text":"Fantastic little gem hidden in the quarter. The place is modern and clean with the focus l","useful":0,"cool":0},"vQPoBIsxO6y_csE4htf2nQ":{"text":"I wanted a sweet treat right before leaving nola. I was walking on canal street when I loo","useful":1,"cool":1},"fu_J7eljChl5__pVOz2luQ":{"text":"Cake is ok for NOLA standard, but Linda is rude and unprofessional. First, it takes her fo","useful":3,"cool":1},"1Ua88sZ_N96LMKRITEZSSw":{"text":"False advertising. Said \"best eclairs two years\" running: maybe if they were competing wit","useful":1,"cool":0},"wV3lz-tldy86uBmbLkk75A":{"text":"I'm torn on the review here. I wanted to do 3 stars for a reason, but the chocolates are v","useful":0,"cool":0},"imxTTWfB5YSdbGrtj-EyBg":{"text":"This was a nice surprise, and welcome cool spot on a warm NOLA afternoon. The gelato flavo","useful":0,"cool":0},"WqummGHnKLxylcN12qV01A":{"text":"I came here while we were walking about the French Quarter.  The place was very cute and t","useful":1,"cool":1},"OaCN8ZV_Mb4FyDGgTd8QoQ":{"text":"Sometimes desserts look beautiful but are not tasty, that is not the case here! The desert","useful":0,"cool":0},"zXv6SzZf1aK3SH5tx5UVwA":{"text":"Oh my goodness! We had the most amazing sweet yumminess. We had the lemon raspberry cheese","useful":0,"cool":0},"tkuF8y5SsE5DEffs7YyH4Q":{"text":"We had the white chocolate bread pudding with vanilla gelato and the s'mores brownie. It w","useful":0,"cool":0},"LzPqLyHk0IfH4S-xjbSk8A":{"text":"What great spot! Just came here for dessert and had the gelato. Clean space, great dessert","useful":0,"cool":0},"9xuYyJO9VACobDhvmByMVw":{"text":"You guys, don't even think twice. Just buy yourself a lavender honey macaron and thank me ","useful":2,"cool":2},"G7gYj929-kOCAf4hpeG-3Q":{"text":"Love the Macarons and there Gluten Free. WOW outstanding. This is a must if you have a swe","useful":1,"cool":0},"fo-lRo0On_WXmvmVDr9xFA":{"text":"Service was impeccable, and the Lazy Sundae was so good. Highly recommend stopping in to p","useful":0,"cool":0},"h6d3joBQMKDl4vMozCRQzA":{"text":"This place was recommended to us by one of the locals. It's a cute little boutique spot in","useful":3,"cool":7},"NeX1Q_zsp-kjIaXuqPMlnA":{"text":"If you want to wait for 30 min for a latte, this is for you. It was such a cute atmosphere","useful":0,"cool":0},"ov7ooMIHTX7Z_wIMGLyQ7w":{"text":"My husband and daughter ordered the gelato and loved it. I had the Java chocolate cake, ha","useful":0,"cool":0},"M6wziYDrWHBW2_HuOVvJIg":{"text":"I love this place. The sugar free option never disappoints. The affogato was great. The ca","useful":0,"cool":0},"RqOisdtnTWJJfCZIPky71g":{"text":"Awesome place for a sweet treat! Had an assortment of macaroons and chocolates. Nothing is","useful":0,"cool":0},"MTWQyBT6f6vJ12UBuNc3Bw":{"text":"Almost a year later and I'm back in NO. Had to visit Sucré. Delicious as before and such k","useful":1,"cool":1},"-RlEj4Cx9rXCuXelpxC9FQ":{"text":"I visited 2 days in a row. \n\nThe first night, I stopped by to grab some macarons on the wa","useful":3,"cool":3},"ejgk_1OhZg7Nupbl8Extdw":{"text":"I didn't have intentions of coming here for more than mimosas. Bottomless mimosas for $24 ","useful":0,"cool":0},"HVW5bxplyIuT4IMclqtKjg":{"text":"Sucre' was an awesome vibe\nPaul was the man and had great conversations with everyone he w","useful":0,"cool":0},"M6CtY87JUylquHLFC2_BQw":{"text":"Stopped by for late night gelato. It was alright. The employees were patient with me tryin","useful":0,"cool":0},"ex9pTCeQu0IosXVTCmMJFQ":{"text":"We had macaroons and key lime pie.  The macaroons were perfect as usual but the key lime p","useful":0,"cool":0},"W9TMN-V5sTZMz8gh_XUPlA":{"text":"YUM. Okay so for some reason I haven't been to this dessert spot in years?? Anyways I walk","useful":3,"cool":1},"irHatAFoAx9TL4mOSxLokA":{"text":"Heidi and Calder were amazing and very knowledgable about coffee.  They went above and bey","useful":2,"cool":1},"8KLKiOHhBezSWfCPNU2Etw":{"text":"Went to Sucré. Instead of putting the chocolates in the pink purse he just put them in a b","useful":0,"cool":0},"tjdoBix6OmMAFUCz5eJ1DA":{"text":"the ice cream here is average, nothing special. The fruity ones are a little too icy for m","useful":0,"cool":0},"NXXJxklIR-VhYG6RlASyfw":{"text":"This shop is perfection! Beautiful and elegantly designed. We were fortunate enough to mee","useful":4,"cool":1},"LcympPUk3gzkoPpd15h_tQ":{"text":"The place to be for some delicious gelato and much needed air conditioning!! We honestly s","useful":0,"cool":0},"aRtnajxa297sUP72dd6MGA":{"text":"Macaron:\nI get these macarons for my girlfriend all the time. They're available in the air","useful":3,"cool":1},"YYIGOQkW3qs32rZdlrgG6w":{"text":"On 10/22 stopped in here for a mid- night tea/coffee/sweet fix. Decided on the Gianduja Be","useful":0,"cool":0},"7eBArD8cil66tZKjl0RZkQ":{"text":"This is the cutest shop! The staff were all incredibly friendly and allowed us to try mult","useful":0,"cool":0},"qL6CPZKHMd8Za3_B-eZV8w":{"text":"The most expensive place to get a dessert in New Orleans, albeit, still slightly cheaper t","useful":7,"cool":4},"MMZfueED6bwWbHXK_kdCfA":{"text":"My husband and I stopped in for a late dessert and enjoyed our treats so much that we came","useful":0,"cool":0},"xKwdJt1-L_FugNK2hx5s5Q":{"text":"Such a cool spot for all the sweets. A must visit for all ages. Coffee is Amazing too!","useful":0,"cool":0},"_B8AwZIQT5xAycwOUpnpXA":{"text":"Amazing macaroons!!!  They simply melt in your mouth.  You must try the banana foster and ","useful":0,"cool":0},"-r3CnWpXhJcPFDkdTe444g":{"text":"The macaroons are TDF! That's all I've had there but everything else looks amazing too, we","useful":1,"cool":1},"aoymhQvIPHJLoENhjDo9aQ":{"text":"We got a citrus berry olive oil cake and pistachio gelato. The cake was a dry, with nothin","useful":0,"cool":0},"IrAtCoYv54IZx009nP7Q7Q":{"text":"It's overrated. They're not kidding when they say \"sucre\" everything is really sweet. We s","useful":0,"cool":0},"6nUROPRca_1_CCtWlLPL-g":{"text":"Staying in the quarter is a little tough for breakfast. All your typical breakfast places ","useful":0,"cool":0},"N-r3c5Z55J4Yy72aCKqUNw":{"text":"You simply can not leave NOLA without visiting Sucré, PERIOD! This little French Quarter c","useful":32,"cool":34},"1dG9O3gQqZdhq7AIsvj8bQ":{"text":"I usually do not write reviews but this I had to share. Upon visiting this place I read th","useful":1,"cool":1},"CH5Rh1r6g-aq8UqMdo-1Ug":{"text":"Seriously the best macaroons I have ever had in my life!! The caramel bourbon shake is phe","useful":0,"cool":0},"Q6kxszFdJr5AmuIZ_K0PUA":{"text":"COME TO ME MY LITTLE SWEET!\n\nWhen visiting NOLA for the first time, my daughter and I came","useful":1,"cool":1},"6E_drYU5_zsX9Bb1g8uwRA":{"text":"We only had ice cream and didn't try any other sweets here, so my review is based off the ","useful":0,"cool":0},"SjuTTzkDjAAXSBPjKJIFxw":{"text":"This is such a cute pastry/dessert shop. The only negative is the prices. Everything was v","useful":0,"cool":0},"XkD0-WIPyyy1gunQkwDlBQ":{"text":"Beautiful decor and the sweets make you excited. We only had ice cream/gelato/sorbet, and ","useful":0,"cool":0},"wfJz-cmA4r9q5Ed1_mc0hg":{"text":"lots of dessert options! I can taste the coffee bean in the cafe au lait gelato, which is ","useful":0,"cool":0},"dw9YxWhJgNDDEX-12vugYA":{"text":"It's so highly rated we had to give it a try. However, the macarons were smaller than most","useful":0,"cool":0},"HofGqQXab9gFqXjHb2wMSQ":{"text":"This is the best place to get your chocolate fix!! We're visiting from San Diego, and ever","useful":0,"cool":0},"8TiWEJHCQ4-b38nXVm5_Kg":{"text":"Had the salted Carmel chocolate cupcake and I would eat it again and again! Cake was great","useful":1,"cool":1},"3rntDQtX-WcpNoFbVCZsKg":{"text":"The  food started out to be tasty until we viewed three mice scurrying across the floor co","useful":1,"cool":0},"zxA0s9NCcgTCTUraa0MNkA":{"text":"Treats that make my mouth water just thinking about them. We went looking for this spot af","useful":2,"cool":2},"mhiBQHas9kTogLycAZlvxw":{"text":"Candied rose and violet chocolate bars, nectar sorbet, lavender macarons, and these amazin","useful":0,"cool":0},"grGyX3dBqnNdtFClgM6urA":{"text":"In need of something sweet or chocolate-y? Maybe some creamy gelato? A second dessert mayb","useful":0,"cool":0},"8HabQ95Enr4g3zpjlHTpEA":{"text":"I'm not a big sweets person, but the window displays here (with french macarons) were so a","useful":0,"cool":0},"RTzBdmGyAVulh76XEMI6bw":{"text":"Loved brunch at Salon above Sucre. Our waiter was really wonderful, but I was very disappo","useful":1,"cool":1},"3182gcxMivLEysXePaA3oQ":{"text":"I do love my sweets. And I've been hearing about Sucre for years so I didn't hesitate  whe","useful":8,"cool":7},"pfmk_3Pm4OxV2DSqGczPwA":{"text":"A little bit disappointed with their gelato. The decor was very pretty, fun and creative. ","useful":1,"cool":2},"X9te70JQDDmVMYaJBhv7tA":{"text":"People with sweet tooth, this place is for you!!!  I don't have one but I will eat sweets ","useful":0,"cool":0},"3LZc0iI3iKwEam-CP9Eh3g":{"text":"Chocolates + cakes + gelato, all in one place = my dream come true\n\nHubby and I shared the","useful":0,"cool":1},"A1B52Odn58gTwx_8zox7_g":{"text":"Great place to grab a delicate dessert. I had the milk Chocolait and it was the best hit c","useful":1,"cool":1},"QbMTFOL6ppar-84PyBKQyg":{"text":"Honestly one of my favorite places to visit in New Orleans. Their desserts are amazing, an","useful":0,"cool":0},"Vqoa7OqhYgshwxRptO71NA":{"text":"Customer Service: 5 stars: came in 7/6/18 in the afternoon. I asked to sample the flavors ","useful":1,"cool":1},"m6by_-OxOI4U69ZSTSAoAw":{"text":"Cute shop, large variety of pastries/dessert, friendly staff!\n\nTried a bunch of gelato fla","useful":0,"cool":0},"M5wM5KV1piK86GSj2Y0GxQ":{"text":"The ice cream was great! The lady who served energy was a little off. She May was not havi","useful":0,"cool":0},"Hqv-qxWo5fIdFTjInt8Lsg":{"text":"Headed to Sucré in lieu of dinner. Glad I did! \nEmployee that waited on me was super frien","useful":0,"cool":0},"9eDYIxEc9BqnoyFkgF4Jpg":{"text":"I'm a little disappointed by the lack of non-chocolate options as a non chocolate eater. B","useful":0,"cool":1},"iGX-Y6RbhV0PkuYDwGfyBQ":{"text":"Bananas foster macaron was really great! Strawberry white chocolate wasn't enough strawber","useful":1,"cool":1},"0ITYAE3QaBbjR549AnONGA":{"text":"Glorious to any fan of sweets. Cases of beautiful chocolates and pastries. Sadly they were","useful":1,"cool":0},"2Z2UXkr6ZKHVEu_eyoFnWQ":{"text":"Their showcase of desserts lured us in on a cold afternoon. They have a great coffee menu ","useful":1,"cool":0},"yD9J4cZxxShD1sLYH_89Xw":{"text":"Great place with friendly staff & yummy food :D we were so confused when we stepped into t","useful":0,"cool":1},"TO-I9_DdrLmAwEldA537LA":{"text":"I'm so glad I made it to this Sucre location, but was sad to see the upstairs Salon closed","useful":1,"cool":1},"UaRKvmCjm1DUfcXjDYmdKg":{"text":"I cannot praise sucre enough! It's my favorite bakery in New Orleans!\n\nThese are the best ","useful":1,"cool":0},"8InJvyHupw92w-AAITCe2w":{"text":"Sucre certainly reflects tourist destination prices - but the cakes and pastries are so be","useful":0,"cool":0},"u7tNk1TCsBX1wuqFHwFyew":{"text":"We had the white chocolate bread pudding with vanilla gelato and the s'mores brownie. It w","useful":0,"cool":0},"BupKmXscIfAWLDZr1cU1Ww":{"text":"This place reminds me of a old dollhouse but more modern. Decorated nicely with Christmas ","useful":0,"cool":1},"5mAVpT5e5Tfy8xrpGiD5ww":{"text":"King cakes are a staple in New Orleans. The king cake tradition was brought from France da","useful":4,"cool":2},"Wr47pfCCqnX_uP3_x0TX4g":{"text":"I stopped in with a friend for King Cake during Mardi Gras after a whole day in the French","useful":0,"cool":0},"gPUMU4bU66O-3zXxEzQMrw":{"text":"Holy god, their chocolate round mousse/tart thing was one of the best chocolate experience","useful":0,"cool":0},"9nLGcvMSvFFCoE3phRq_Ag":{"text":"Amazing dessert place located in the French quarter in NOLA. They dont stay open late so h","useful":0,"cool":0},"WMVNC67vYqpjLomisLFGfA":{"text":"Stopped at this well known downstairs dessert and upstairs restaurant, Sucre, to try some ","useful":0,"cool":0},"6H1hdkwnPlUBWy_N-6s9MA":{"text":"I have been looking for this place while out walking around and finally found it! The insi","useful":0,"cool":0},"dpazSw3mmjyS7BUjYLT4eg":{"text":"The gelato is very good.We bought 6 cupcakes and they were beautiful,but the \"buttercream\"","useful":1,"cool":0},"eaEFp2feeJohQSr-AqBbyQ":{"text":"While the patisserie display looked spectacular, the service was terrible on the bottom le","useful":0,"cool":0},"TwOb5DTr1fttBRbOh1wAOg":{"text":"Came to Sucre on our last day in New Orleans- and I ordered two macarons and four truffles","useful":2,"cool":2},"O2BC1VQl3RQtuY77ZlUYnw":{"text":"Mango sorbet is delicious and the service was great! I could live here.  I also had some o","useful":0,"cool":0},"jdBWE8lB2k0-01V5LXZvfQ":{"text":"Ultra rude on the phone and hung up on me when I only asked if they were busy. Can't say a","useful":1,"cool":0},"X0sduyHHCjVHEqVzjLHJTQ":{"text":"I used to go to this building... back in the day when it was a bar. So when it opened as S","useful":5,"cool":2},"Gbk-kPu3_rR9xCHKM6ibuw":{"text":"If you love chocolate you must stop here.  I enjoy the flavor combinations they have come ","useful":0,"cool":0},"sBMWNkggEUMaeDR84E4aRw":{"text":"As you walk into Sucre, it's like walking into dessert heaven, with macaroon towers and be","useful":3,"cool":2},"zRtkLyfv8cn6oR_SpmVYDA":{"text":"Cute place. Clean and the staff is very friendly and welcoming. They answer any question y","useful":1,"cool":1},"nl0B2u1G2w4chDd6XPD-cg":{"text":"I think that this place is unique in this area but I do not think the desserts are extraor","useful":1,"cool":1},"YjwKE6WaChYy5wGOBI6hDA":{"text":"I wish this place existed outside of New Orleans! I was so obsessed with the lavender hot ","useful":1,"cool":1},"9TyYQoGen7nFkEPTWGI1sA":{"text":"Omg omg omg. MACAROONS!  After visiting Paris and New York, I've been searching for the pe","useful":2,"cool":1},"wMRc8dgPUpnooeJYtk6ldQ":{"text":"We needed to have something sweet after a satisfying dinner at Acme and Sucre showed up on","useful":1,"cool":0},"EeoXHaY2eAdmAANE6OkbpQ":{"text":"It's probably one of the more beautiful bakeries I've walked into. They put a lot of thoug","useful":2,"cool":0},"I-EzNWVyX1DwFUHu8mJaSA":{"text":"Stumbled here in search of a king cake slice and I was immediately in awe as I walked thro","useful":13,"cool":14},"GFFVCrYZoVc3F2AmIghQCg":{"text":"My sister, Roxana S. And I escaped from our male companions and snuck a brunch at this ups","useful":4,"cool":5},"ZLnMLGLWVf2u9EYIgrnO4A":{"text":"A great place for dessert  . Five minutes walk from our hotel in French quarter. Liked it.","useful":1,"cool":1},"Cf5GYdBjJWi-2EeeP2nd5A":{"text":"Every amazing city needs an amazing dessert shop and Sucré is it for NOLA! Love at first b","useful":5,"cool":3},"IM0SDHMlo_zZCMTpKCBUbw":{"text":"This dessert place is Amazing! We ordered the brown butter pecan ice cream in a cone and a","useful":0,"cool":0},"mYnOBzx0th7uBcSCDJ6OSQ":{"text":"I don't get what all the fuss is about?! \n\nYes, Sucre is cute, hip, modern and CROWDED. Th","useful":2,"cool":0},"kl0mHoWH2Pd6iPPc3ZM8RQ":{"text":"I bookmarked this place because I wanted to try their macarons. I ordered two and were dis","useful":1,"cool":1},"HjqjoiyofyJR8MsJld08Pw":{"text":"I am so happy I came across this bakery on Yelp! Everything was absolutely amazing - the c","useful":1,"cool":0},"8ybCDFRKf9uGzCQUKo8JbQ":{"text":"What I love about Sucré is that they put their own American spin on French pastries. The c","useful":5,"cool":1},"9rp8d3JysF7e9HQIj2mDog":{"text":"Holy hell. Just dropped by this place to try a couple of macarons (2 for $5!) and I'm hone","useful":1,"cool":0},"E_06nyd0OfBSQeHdy2Sikw":{"text":"Got a mango/raspberry gelato combo at this very very cute place.\nThe lure of AC and cute m","useful":2,"cool":1},"TGCjwNjjmZw5OXbsMIQ3_Q":{"text":"Beyond incredible!\nTheir treats are as imaginative as they are delicious. I tried the Tast","useful":1,"cool":0},"x60eycAv6HmVD-uofgaoBA":{"text":"We were celebrating my friend's birthday that fell on Mardis Gras and wanted to buy her a ","useful":2,"cool":1},"UgOQRPl-8Ep64CGuGoBLXg":{"text":"This place has the best gelato and macaroons. Also the employee Latia is phenomenal. She m","useful":0,"cool":0},"BTGdgu7espjsgOKDHxjL0g":{"text":"Very cute place but the desserts look wayyy better than they taste. Service was very frien","useful":3,"cool":2},"zdT17UOUKHFC-vffv0NInA":{"text":"I visited the joint for the very first time, today and I will never EVER return. I'll star","useful":2,"cool":0},"NZBRYLDHuniPNpnnQ_nRbA":{"text":"A little underwhelming to be honest. I may have had the wrong idea but I was hoping for fr","useful":1,"cool":0},"1MdhZXnOzHUTKex2xMuB5Q":{"text":"Was craving some tea and a quiet little cafe after dinner, and, after a little help from m","useful":1,"cool":1},"FWqhpm5IDf6tjprMSaMGGA":{"text":"Excellent gelato! Flavor, price and quantity were spot on!\n\nThe extras (take home goodies)","useful":2,"cool":1},"l6g8zyKErdHUWhFKGzaddQ":{"text":"We came in for dessert and I was so happy that we decided to get gelato. I really enjoyed ","useful":3,"cool":0},"uIIqQ3npI_v5jz5QmuT4aw":{"text":"Sucre is this whimsical space and is honestly perfect for special evenrs like birthdays, l","useful":3,"cool":1},"8lI7rNIdzUWX6dx7LG5_7A":{"text":"Lovely little shop hidden away. We walked in and were hit in the face with the smell of ch","useful":1,"cool":1},"waSQ8oX8FVUizOmVx465PA":{"text":"If you visit New Orleans, visit Sucre. Wonderful goodies :-).","useful":2,"cool":1},"bBDKUf-VW3tgKZPkA_QkVA":{"text":"This is a really great shop if you're in the mood for fancy little desserts. They have a v","useful":1,"cool":0},"w8bFF4ZVgUvdGa8icT-ecw":{"text":"A friend told me I had to stop here and pick up a treat and I'm glad we did! \nWe had three","useful":3,"cool":3},"-XTZbyTsHUbsyRVbNS09bw":{"text":"It is a bakery filled with delightful pastries, cakes, macarons, truffles, alcoholic milk ","useful":4,"cool":2},"d-ze_F7wYiJXmWO7OinDWg":{"text":"It's a sweet little spot that has a lot of delicious looking sweets. They didn't quite hav","useful":1,"cool":0},"BN6RxOSdwxoBOFw9R2i_lg":{"text":"I came here twice during my 4 days in New Orleans because I love everything about it. When","useful":3,"cool":2},"guvhu2Lqe-e2uQ1UbfVKZg":{"text":"Came here to buy some desserts. The macarons are delicious and I especially like the jasmi","useful":0,"cool":1},"5MMTbJdyCN2AHn_mxDR4UQ":{"text":"Love, love, love!  A true respite from the hustle and bustle of the French Quarter.  A gor","useful":3,"cool":1},"kqQG0p1jrr1zg3KvjLcgng":{"text":"I'm definitely not the type of vacationer that revisits places in the same trip, but we en","useful":1,"cool":1},"5eosAYs3Pxh6729ciCjT4w":{"text":"It is a good sweet shop but nothing amazing and in my opinion over rated. The oversized co","useful":1,"cool":1},"LT08lHSo_FCxDFAwKFyvdA":{"text":"Bang for your buck: 8/10\nQuality: 10/10\nService: 9/10\nAmbiance/Location: 9/10\nOverall: 9.5","useful":1,"cool":0},"nxKBOefQqzMlVSOSzTpaWQ":{"text":"This review is only based on the desserts I tasted and the look of the Salon. The desserts","useful":4,"cool":2},"GqOU3HZCMVVzDJIUgjKO_g":{"text":"It's one of the best places that you can go in your life. Everything is set for a perfect ","useful":0,"cool":1},"H7zhOmIviV6VUEZUN2CRlA":{"text":"The only reason I can't justify 5 stars is because the prices are ridiculously high.  I th","useful":1,"cool":1},"O8BptxulJCfrnudA2NzQjQ":{"text":"This establishment is heaven. I love sweets and this place really satisfied my cravings wi","useful":2,"cool":2},"p808svFCGnN6tGkjumNdzg":{"text":"Customer service was 5 star worthy. Mr. Robert's personality was welcoming as friendly. He","useful":1,"cool":0},"9WCVMyDr3xw1EolckJSgjw":{"text":"I love sucré and will visit every time I'm in NOLA. Their macaron are always delicious. Ha","useful":0,"cool":1},"Qco5YC-64hDeW8HLzHqrTA":{"text":"We live in the quarter so I like to visit the place regularly on the weekends. Used to lov","useful":0,"cool":0},"5T5vOKtrpAm_84clvD7g-w":{"text":"This place is amazing. We had a few macaroons and a few other bites. Be careful....you wil","useful":1,"cool":2},"L3MaFoICfE4-z6U9B0PP6g":{"text":"I love desserts, I wish I don't but I do and this place satisfies my cravings for macarons","useful":1,"cool":1},"edrivIv7PmCt4EI_wyAkeA":{"text":"Good cold-brew coffee and macarons. However, the line was hard to follow. I ordered and wa","useful":0,"cool":0},"ZQReRNRrPf5YXY5seKCUZw":{"text":"Sucre was such a gem to find in the French Quarter one night! Since we were there in June ","useful":4,"cool":3},"qkB5NZVZTRnoukHgBnGPlw":{"text":"Unlike the Sucré in the mall in Metairie, this downtown New Orleans Sucré definitely has t","useful":4,"cool":4},"5OdcvlgIH6YrAEsTQKhlUA":{"text":"Came here while walking around the city for some ice cream. Came into this quaint shop, an","useful":1,"cool":0},"XSxXxMl8RMeURaIYQkc0eg":{"text":"This is my first time here, and I was honestly underwhelmed. The bar had a gloopy coating ","useful":1,"cool":0},"TIp9XHUM5EcD-jHuj3mXmQ":{"text":"Cute little swanky dessert spot.\nI loved that they had truffles, king cake and gelato.\n\nBr","useful":1,"cool":0},"Zz9LI1YYfVHigB4jxvdQ9w":{"text":"We visited Sucre twice during a recent visit to New Orleans. The first visit, I would have","useful":2,"cool":0},"tKQURsqJYBZ-tkEwWMuC2g":{"text":"Whole family came to check out this adorable little shop just next door to bourbon street.","useful":1,"cool":2},"gp2OLXStPgsDaH_WYI9RRA":{"text":"Stumbled upon this place while trying to kill time (we put our names down at Green Goddess","useful":2,"cool":1},"XI4DEA4XwhXj-3_W6EKz6A":{"text":"After a month, I'm still thinking about the dessert here! It was a find thanks to Yelp! Th","useful":1,"cool":0},"ZXR5bqcgc0p39bumBaVmRw":{"text":"What a cool little store!  Tucked away on a Conti Street it was off the main drags so it w","useful":1,"cool":0},"ivsLtVo5F_yVvt6XFKssHg":{"text":"I'm not sure what's good here. I've been to two locations already, and neither one better.","useful":2,"cool":1},"DhQdgKWm9BU5EP3c0P3OxQ":{"text":"A bit over priced for what it is, taste wise. But I understand that it takes lots of talen","useful":1,"cool":1},"0nfBff8wowS92rqiVqsRDA":{"text":"This place is cute. I like its decor. They have so many choices of sweet and delicious des","useful":1,"cool":0},"5mm7OJUUvBdHi9GCtG10aQ":{"text":"Ran into Sucré to avoid taking a shower outside. NOLA thunderstorms are no joke and I'm fr","useful":3,"cool":2},"7YsQANdJoA3b7AlfiHHv_A":{"text":"Coffee, tea and sweet croissant muffin(honestly, just OK). \n\nThe sweets selection is amazi","useful":4,"cool":0},"RwV_rzRgzPNk-cveVw3ahw":{"text":"I wish my town had a fabulous dessert place like this!\n\nFirst of all, the décor is so chic","useful":2,"cool":3},"BFFsxM43ozAudC_YKDNQHA":{"text":"This is a great spot for dessert.  We stopped here on a last day in NOLA.  I had the Straw","useful":2,"cool":2},"-u6TMbdntp6WuG8mkZ3Y1g":{"text":"Bright, clean, and organized, Sucré is a haven from the sloppy debauchery of Bourbon Stree","useful":2,"cool":2},"FEfmXeSynhlinxIgCnaFGQ":{"text":"After following Sucré on social media for quite a while, we finally got to try it this pas","useful":1,"cool":1},"x2w2oEJ5ebgPiwqcQ-MUdQ":{"text":"Stopped in for the macarons alone. They had 9 flavors to choose from; nothing too crazy bu","useful":2,"cool":2},"CxEaaNHc4onJW9Mx1QykFA":{"text":"The Macarons were phenomenal. Our favorite were pistachio and salted caramel. \n\nI ordered ","useful":1,"cool":0},"gDEvhZU6nyG24GNXPlT0_A":{"text":"So I had to go big!\nI got the big brownie Sunday!\nA multilayed brownie and turkey cheeseca","useful":1,"cool":0},"MVsRVbiGvpseQAxsZZlXaw":{"text":"What beautiful desserts. I got a box of macarons to go, and a hot tea for there. If I were","useful":1,"cool":1},"CJEUVj1vhYVzNzqfDVgajg":{"text":"I was expecting amazing but I just got over priced dessert with fancy boxes and bags and p","useful":2,"cool":0}}