{"IT0ipTUqt3nW21ByHmfU8A":{"text":"Count me as a big fan.\n\nI guess they've been getting slammed every day and tonight was no ","useful":0,"cool":0},"QMm8UFOoJVPQyp1yGBbaxQ":{"text":"So I'm not really a burger person, really picky about my burgers... but I LOVE company bur","useful":0,"cool":0},"Qf7U5Qf1C-6F0WNcYRla8w":{"text":"Burger & onion ring perfection! My go-to hangover food. Met the owner last time I went & h","useful":1,"cool":1},"tvkb5KunjPEYUSa5JyiB6A":{"text":"Good place, we came on a Sunday and it was a good bit of people but not over crowded. I ha","useful":0,"cool":0},"XUFB-KpPpMRn7upR7vYvNg":{"text":"People are too generous with their stars. Their signature burger is 2 beef patties which a","useful":0,"cool":0},"KYfbkgqs9KhH9KxO9GO3_g":{"text":"I believe this is the best burger around town. One single burger feels me up completely an","useful":2,"cool":0},"m8kwM0YnBxn-8DSHG2xt1w":{"text":"Tasty burger with a great mayo bar. Roasted garlic, chipotle and basil mayos and homemade ","useful":0,"cool":0},"6OYl4mVLMrJmocP7rkt3dA":{"text":"Very good quality of meat but too greasy. \nExcellent service, friendly waitress and clean ","useful":2,"cool":0},"Yo0A3Ui8XeSXyupqf0fmQw":{"text":"Best counter burger in New Orleans. My boyfriend always orders the Company Burger which is","useful":0,"cool":0},"O3tYsKNxUYm4RRQAlbAxMw":{"text":"Was super stoked to try this place out because I've heard such great things... Place is su","useful":0,"cool":0},"ulU_mSNtWQOnTIIxoSsVvw":{"text":"Arriving late in New Orleans on a Sunday night, we got to Company Burger about 20 minutes ","useful":0,"cool":0},"5CMNmmrLUIijKnVTYjozBA":{"text":"YUM! Tasty burger, great atmosphere. The condiment bar with flavored mayonnaise is a great","useful":0,"cool":0},"xHkYiE4q1UmTLxpl8dkkAA":{"text":"My expectations were definitely met!  People have told me The Company Burger has one of th","useful":2,"cool":0},"u_BLZy25ta0IyR6xsyfOXA":{"text":"This place is very good for what it is: Fast food made with better ingredients and little ","useful":0,"cool":0},"H53mVG1DVey06J1Y362xbw":{"text":"One of the best burger i've had in a really long time. Great buns. Extremely friendly and ","useful":0,"cool":0},"0b6rWs76YJ7FAiILqZYJ9w":{"text":"Taste very good, bun not too heavy but can be thinner, sweet potato fries excellent, varie","useful":0,"cool":0},"bVUsZ5asCaS1iRxALnKwSA":{"text":"Hands down best hamburger in the city! Basically the only burger I eat. The sweet buns the","useful":1,"cool":0},"Be_qPhcgoqHsSk27YlGEmg":{"text":"If you want a great, greasy burger, head over to Company Burger!  We tried the original an","useful":0,"cool":0},"SHmB04YTcwFwfr7NJII2_Q":{"text":"I think, no I'm pretty certain I climaxed when I ate this burger. Have you ever had a burg","useful":1,"cool":2},"HP-yl5hJqN6xkfIGuiT0gw":{"text":"Simple but flavorful burger. Proves that simplicity with great ingredients and execution t","useful":0,"cool":0},"eosCsSEXGBAlAChpUn4ThQ":{"text":"OUTSTANDING HANDS DOWN THE BEST BURGER & FRIES\n\nSome of the softest bread you will ever ta","useful":0,"cool":0},"YVQSmOTu42IaSxkPwsoRJQ":{"text":"The actual meat and bun themselves were good and I really liked the fact that they grilled","useful":0,"cool":0},"0lA7iwuWYyvVxgd9BsrSaA":{"text":"Definitely the best burger in town. Love the onion rings. Great selection of beer and drin","useful":0,"cool":0},"jjkNX6lZp5crNbsWPzkSWA":{"text":"Very good burgers, but on the overpriced side. Fries are excellent, tater tots are good, o","useful":0,"cool":0},"XLRDugVDhSEyWUr8oPVHYA":{"text":"It's just okay. I seriously don't understand the hype of this place. There's much better b","useful":2,"cool":1},"2JMrq7Hm4FESSjyv2g6oIg":{"text":"I would actually would like to give a 3.5, but Yelp doesn't allow it.\n\nI became a big fan ","useful":1,"cool":0},"tpKApJrk1xRBo1_HQDw0fg":{"text":"Simple menu. Convenient location. Laid back atmosphere. What more could a girl ask for?\n\nS","useful":2,"cool":0},"yJuVJMRad_P6F2wSjW7eeA":{"text":"This is one of the New burger places that opened in New Orleans after Katrina and thank go","useful":0,"cool":0},"Wvglopja_iUOmK_65Isgmw":{"text":"Let me begin by saying my family and friends call me the hamburgler. Do not be fooled by m","useful":3,"cool":1},"VPrRKjc7NEiy_-Xqoat6OQ":{"text":"You'll find No Poor Boys here; only Rich People.\n\nEverything at the Company Burger is À la","useful":2,"cool":1},"_Ws4Zddhbw-hu18dbpzHqg":{"text":"New Orleans has needed a place for an awesome burger! And this is it! The burger is exquis","useful":1,"cool":1},"HfD1ik7ZdRGalODBs14kig":{"text":"Took the teenagers for a quick bite Friday night. Don't be confused by its being a burger ","useful":0,"cool":0},"uMtttn4uOPRmpjK7jkRYQQ":{"text":"Okay, so I've only been here once, but since I live down the street I will definitely be s","useful":1,"cool":1},"5uvfVhB9TlLBTEvqQZKl_w":{"text":"The Company Burger is an exceptional restaurant to stop in for lunch, dinner or in between","useful":1,"cool":0},"b2Aa_wJs6mcR5AMchBOzrQ":{"text":"All these reviews I've read about Company Burger being either too expensive or...gasp...to","useful":0,"cool":0},"vnoIOy-Zrck7H9LMQyo-OA":{"text":"Staff was relatively friendly. Burger is good - better than mediocre but not the best I've","useful":0,"cool":0},"673_vixemPBo-S6viBtw7g":{"text":"Right off the bar, what I liked about Company Burger is that they have their own parking l","useful":1,"cool":1},"xhikeLBARD1Pu10uyvX9Ow":{"text":"Had lunch today at Company Burger. First time eating here and I was not disappointed. Orde","useful":0,"cool":0},"rGdCcjTFdkk5QEQUDN6l0w":{"text":"Second time eating here. Burgers were delicious as well as the fries. Service was friendly","useful":2,"cool":1},"j-3ALqLLcIKlmtdNpgpNfQ":{"text":"My family and I aren't from NOLA, so we don't know about what's good to eat around here, b","useful":0,"cool":0},"hggYRubenCwUcuw5klVYUA":{"text":"I eat here so often that my actions have already added the fifth star long before my finge","useful":2,"cool":2},"aHOcKyuN6uQ1WEPz45ht1A":{"text":"Burgers are always good here.  I usually get the company burger with bacon with tots.  And","useful":0,"cool":0},"z9kLQqmzVe_CSuFJL_Qiew":{"text":"I wanted to try Company Burger for a really long time, and finally made it over.  I wish I","useful":8,"cool":3},"ZeSbR5bclFIVL-rzV2_JUQ":{"text":"Delicious, fun, and casual. This place has everything you need to have a quick outing. Coc","useful":0,"cool":0},"LOToevix4X9Vfr3hAwb3RQ":{"text":"This place is awesome!!!  While it wasn't my first go around my first trip was kind of dil","useful":0,"cool":0},"QWvY34VaUYZFRCpHZLzHNw":{"text":"This place is a staple in my favorites for burgers. I've ordered the lamb burger more time","useful":1,"cool":0},"YQdu_z6iNqdLHLNrPdEwUA":{"text":"My first visit here I wasn't blown away, but after a second visit, I'm willing to upgrade ","useful":2,"cool":2},"nOrAMfw1GxBR6STEhK5yHw":{"text":"Company Burger is delicious and who can go wrong with Red Cream on tap and, crispy delecta","useful":0,"cool":0},"M8wbkccZ_jE0Rrek147-1Q":{"text":"Loved the burgers and fries, great flavor! Also enjoyed getting to try the sauce bar! It's","useful":0,"cool":0},"i5LnbBK_oIVsQSyPzMvSaw":{"text":"You really cannot beat this burger. It's arguably the best in the world. So simple, yet so","useful":0,"cool":0},"zvPuCwkjbKLhkH0ANkDyPg":{"text":"I'm always near Freret St, but I've never eaten at Company Burger until today.  Great Burg","useful":0,"cool":0},"6VDVgzrK43vgIAU5dDS8EQ":{"text":"BEST burgers. I crave this place, which I am not known to do about any food. The burgers w","useful":2,"cool":1},"qFYP5Fjp8lL2jr04X0TpYg":{"text":"Very disappointed in this place.  Definitely not better than port of call or any other New","useful":1,"cool":0},"8UwQgKLOmUBIo6AzPZ97Yw":{"text":"Friendly (fast) service, solid burgers, house-made condiments and good (well mixed) drinks","useful":1,"cool":0},"zQ-URxaempLWWuhqpowUiw":{"text":"Best hangover cure!\n\nThe milkshakes were fantastic and I still crave the chipotle mayo.","useful":0,"cool":0},"JN6d4-vK8F_3iYTyzGE9XQ":{"text":"Burgers, onion rings, milkshakes, and fries are awesome. Good quality and always perfectly","useful":0,"cool":0},"i-zKj9L8BDaEqEVC6NS-SA":{"text":"My room mate and happened across this place tonight and were pleasantly surprised. I had t","useful":0,"cool":0},"6PjOYr1jTigeCLlpnzJ9Ng":{"text":"I would be highly suspicious of anyone giving this establishment less than four stars. The","useful":3,"cool":2},"RUswgjarb-Z0K25t4N1k2Q":{"text":"This place never disappoints. Burgers are always on point. Keyword = consistency. The burg","useful":2,"cool":1},"wo-xQB8J7V71MuHZ5WqGPQ":{"text":"I can't emphasize enough how amazing this burger place is!  In my opinion one of the best ","useful":0,"cool":1},"jd_f1yL-EYpngIA8zYRe4A":{"text":"Favorite place in nola to grab a burger, hands down. Its a simple burger done right, cooke","useful":3,"cool":1},"CNsu0ANRMbxbYUseUplRAQ":{"text":"Best burger in town. I live close and have been a bunch of times. I've never had a negativ","useful":0,"cool":0},"zButK5Cevt8zjmnNrEKl5A":{"text":"What a great place! Delicious burgers, onion rings & the pimento cheese with pork rinds-un","useful":0,"cool":0},"-F2LtzjVNwBrMN6aqQf2Tw":{"text":"I got their lamb burger a while back and I thought it was absolutely delicious. Juicy, ton","useful":1,"cool":1},"lQcE3ZIhlK4Xj6bfcybYWQ":{"text":"I think I was lucky and caught them on a good night cuz the SAINTS game was on there wasn'","useful":4,"cool":2},"ljhfQU99G5POPMHe8v2W-A":{"text":"Pleasantly surprised!  I have been looking for a solid turkey burger since moving to NOLA ","useful":0,"cool":0},"WkAkzlZWIyGN8X5qx19a3w":{"text":"Ok, haters, I don't know how to tell you this, but, to put it mildly: you're wrong. And po","useful":0,"cool":0},"_OQAnQ8FDpIx4MefyfCeSw":{"text":"Company Burger is truly the Best Burger I've Ever Ate! You can't go wrong with anything he","useful":0,"cool":0},"3R9q4ONGtjCz0y_qZDCr3w":{"text":"Pardon if my review is cryptic, mixed up, or flat out incomprehensible....I am currently r","useful":1,"cool":1},"aLJtjDrGma-WgiB2-P_9Yw":{"text":"Best damn burger I've had in my life.  Everything is perfect about this burger.  Just beau","useful":0,"cool":0},"cngnH5KqczDAcenLdstuhA":{"text":"Company Burger has the best burgers I have ever tasted. Some will argue that Port of Call ","useful":0,"cool":0},"VJ9MPiZbq2qB8Sk6rvzqDQ":{"text":"Taking off one star for lack of flavor of the meat (there was no flavor or seasoning) and ","useful":0,"cool":0},"1HiNm0TGDtQMaNoZxMaxRA":{"text":"Painfully overrated. I heard amazing things about Company Burger, so my boyfriend and I de","useful":3,"cool":4},"2pe_StTnLz4-h4Y8sBsl1w":{"text":"A burger place without lettuce or tomato? That's not a gimmick (even if you do flaunt it o","useful":0,"cool":0},"vHReUbjNZvTS96Wx4c_EqA":{"text":"Burgers are just about perfect every time. The fries are pretty disappointing. They have a","useful":0,"cool":0},"CZMo5h4H45G3gNth1qLIPg":{"text":"Burgers and fries are very much a personal \"thing\" and everyone is very specific with thei","useful":0,"cool":1},"wJwpMcLhEEUfcAuyxlTCzw":{"text":"Probably the best burger I've ever had. I've never been a big burger fan-- this place chan","useful":1,"cool":0},"xqGz-rRg1rxPElobD0Mh1Q":{"text":"After all the rave and drooling about the Company Burger, I was more than excited to exper","useful":0,"cool":0},"q47sxIi-oC8h-CxtSM11jQ":{"text":"When the owners of The Company Burger were choosing suppliers, they spared no effort to fi","useful":2,"cool":2},"7TvE9GIkgEeSE3EN06eh3Q":{"text":"Okay, maybe a bit pricey, but we ordered one Company Burger, side of fries, the lamb burge","useful":0,"cool":0},"S24feRJUuqOu_bHZte8QnQ":{"text":"The burger was delicious! The cheese was just melting right off which is the only way to h","useful":0,"cool":0},"be3_mkNdqU1a7vIR3pGyIQ":{"text":"i had the company burger with bacon and eggs. this place was incredible. $33 is too steep ","useful":0,"cool":0},"Zp5G-ry25fMSAVc_ARfRjQ":{"text":"Outstanding burgers and fries. The mayo bar puts them over the top. \n\nJuiciest and tasties","useful":1,"cool":0},"s0TgoWFQgExisJ4x2sYTUA":{"text":"My boyfriend and I had just arrived in New Orleans for vacation and this was one of the re","useful":0,"cool":0},"mP_wUQebCyMucqHAVgL6JQ":{"text":"Believe the hype! I have heard so much about burgers from the Company from friends and the","useful":1,"cool":0},"B37NSx9YcrykoFnGeiuVIA":{"text":"My friend talked me into going back to company burger. This time it was less greasy and re","useful":3,"cool":1},"-zxrPt_B0HOmuF7-LAw7GQ":{"text":"Probably the best burger in town. I am also  partial to Port of Call, but the Company Burg","useful":0,"cool":0},"yl6qy0Vr331-PiopxxbvEQ":{"text":"If I want a cheeseburger, I go here.  No lettuce or tomato, but they have amazing pickles ","useful":0,"cool":0},"NVotN_dG5e0DyKhJOo500w":{"text":"I ordered a cheeseburger and tots. The burger was cooked perfectly. Although they don't ha","useful":1,"cool":0},"hlA2lb-GkVqW6kTPKIf7eQ":{"text":"The burgers and onion rings were ok, nothing out of the ordinary, but the fries and servic","useful":0,"cool":0},"oK-Vb-tLOLvIjSIO40k_hQ":{"text":"My favorite burger in the city. Friendly, family atmosphere. They handle the dinner rush w","useful":0,"cool":1},"cP9vqlARyRpmXI148c4FIw":{"text":"Hubby and I went on our date night to prep for a night of drinking. Great burgers!! A bit ","useful":0,"cool":0},"0j3jhrWIk7N6USm0dGxVtg":{"text":"Regular burger was not bad.  Reminded me of the OLD Lee's hamburger on Tulane Ave (am I da","useful":2,"cool":0},"OaKl5SwmCn3iTM3eU3u73A":{"text":"as a person who loves to try the best burgers when I can I had to drag my family to this p","useful":1,"cool":0},"syue_vWICsFmW9YleYHWdw":{"text":"Much like 5 guys, the company burger is a step above the normal fast food burger but the b","useful":2,"cool":1},"e8rxZAx4jQf0XvRYferGAA":{"text":"Nothing that would make me come back. It was just ok. There is a lot of salt and did not l","useful":0,"cool":0},"TIz9b_0M7qtfS8ZA0p9xmQ":{"text":"I think I may have found one of the best burgers I have ever had.  The price could be 10-1","useful":1,"cool":0},"wkyur1yyysfl1dxM67dXhw":{"text":"Quick, cheap, and yum! Definitely going to be a favorite.","useful":1,"cool":1},"Ccn9i0DFJxZaAD_NdC3HqA":{"text":"This place never disappoints. Their burgers always hit the spot. Get a milkshake. Try some","useful":1,"cool":1},"ytedaqY1PGZTs1gJNLU0jA":{"text":"Best grilled cheese I can remember eating. You can get an egg on it. Love being able to wa","useful":0,"cool":0},"dCQz6Ej3xG88etxZ4m9cZA":{"text":"i had no expectations coming into this place, though read about the pretentiousness of the","useful":2,"cool":3},"g2bi0PBm2lfgYxXME8XwCQ":{"text":"I don't know why I returned to this restaurant but I did.  With so many good restaurants i","useful":0,"cool":0},"fBY7DuVT3EFLd4Drx0ROrw":{"text":"Company Burger is so good.  My mom and I usually split a burger with bacon, sweet potato f","useful":0,"cool":1},"XFNxF4PVK6mxJa4W5-w87g":{"text":"The staff was friendly, but the food doesn't live up to the hype. I'm sure hoping that the","useful":1,"cool":0},"h6SBll4rB28Rtzs8L9oC0A":{"text":"Great Place!!  Honestly one of the best burgers I've had in a very long while.  Its a trad","useful":0,"cool":0},"MyhiCsdvlsw3-4wh6LALhg":{"text":"I've been coming here for quite some time now and finally sat down to write my review!!  L","useful":0,"cool":0},"uIAZLJn3p_t7HeYfqFYLfg":{"text":"Was in town to see the Blue Man Group. Wanted to eat at a place to fit the fun mood of ant","useful":1,"cool":1},"hI3oJe2MqlGG9lKlCd0V_A":{"text":"For those asking about the price..it is a gourmet burger place. However, I have had better","useful":0,"cool":0},"oZ6sHCuq3ZlW2hvDecVyjA":{"text":"Have you ever been to Five Guys?  You have?  OK.  Imagine that, but with fresher ground be","useful":1,"cool":2},"hO4jVGiwKxeEZJs71k9U6Q":{"text":"Bad Company Burgers. \n\nSo whoever the person was from CNN that said this was \"The Best Bur","useful":2,"cool":0},"hWxc9lFDwf1wUTU8dp9W4A":{"text":"I love this place.  The burgers are so delicious and the fries are perfection.  I love tha","useful":0,"cool":1},"E9XtoFRRjB7wbflgflYUtA":{"text":"This is probably my favorite burger place in the entire city. I love the company burger an","useful":0,"cool":0},"H2E79OAmGlWB4b47u9gwvQ":{"text":"Forget about the Port of Call, its a tourist trap anyway IMHO, if your really into a great","useful":1,"cool":1},"gzDItiKPjdDNaLvTTfU91g":{"text":"I've eaten here four or five times. Of all of the burgers that I've tried in NOLA, this is","useful":1,"cool":1},"yVZ98EQ3n69d25-PS3OHSQ":{"text":"People complaining about prices, this is a gourmet burger place, meaning that you are gett","useful":1,"cool":1},"_WR-aMN0DaJuBgft6NCZUA":{"text":"I realized that in several of my reviews I lamented that my money would have been better s","useful":0,"cool":0},"1fskU2XgcY0CKvpkfsDoHw":{"text":"I subtracted one star, because it is basically just a burger joint. Yes, I said it. The bu","useful":3,"cool":2},"9lsi_gmeKcUSKzpUF_iEdg":{"text":"I seriously love this place. I had the Company Burger and it was sooooo taste. The cheese,","useful":4,"cool":1},"ulkroYI-1tdwjDu6P3SV4A":{"text":"Over rated and over hyped. I'm not a fan of American cheese or thin burger patties. Too ma","useful":1,"cool":0},"SjWXyAMrc4RLdig8yKilQQ":{"text":"Love the burgers here.  The burgers don't need any condiments- they are delicious on their","useful":0,"cool":0},"eiy0WcQ4AUIV953LDx-suw":{"text":"Pretty good burgers! I like their selections of mayos. The patties are pretty small though","useful":0,"cool":0},"M1tP6GCT90EKecj5_nzwpQ":{"text":"One of best burgers I can remember eating; make sure to add bacon.The condiments bar was n","useful":0,"cool":1},"nfG7qwDJdUcOZY4E3rls3w":{"text":"I finally went to the Company Burger for a solo lunch date this weekend. The Company Burge","useful":6,"cool":6},"heNiO2s7O1ZrtosCrcw7Lg":{"text":"Excellent burger and bun. Good fries, need to go back and try the Tater Tots. Interesting ","useful":6,"cool":3},"B9L9iuTa6qb9LJiQh035-w":{"text":"This place is delicious. Good sweet tea, also (a big plus for southern ladies). If you cal","useful":1,"cool":0},"YEp4yHfyC9zO6rvWMkLXxA":{"text":"Easily the best burger in the city. Freshly ground beef, toasted fresh hamburger buns, hom","useful":1,"cool":1},"srd-w0BGuM3H9JUAjhQs2Q":{"text":"If you like to spend a lot and get little this is your place. The burger itself was OK, no","useful":0,"cool":0},"yPtJFqTw8ArD0l0UKXcSWw":{"text":"nothing special about the burgers here.    friends of mine talk like this is some gourmet ","useful":0,"cool":0},"m5f8NXrK6owGCUneK_iTaQ":{"text":"Delicious! Loved the burgers, the service was pretty quick despite the large number os oth","useful":0,"cool":0},"qMpMsvarMdzYw7FRjKRy5g":{"text":"The best burgers I've ever had!! \nThe onions rings and sweet potatoes fries are delicious!","useful":0,"cool":0},"LiZjA9ReE-ODTwCFVwbIGg":{"text":"The Burger Battle rages on.  We gave The Company Burger all the stars despite the fact tha","useful":4,"cool":3},"NDEC3BRcQWO0CiCLSDm3Dw":{"text":"We had the company burger on one we added fried egg . Both Burgers were cooked very well a","useful":0,"cool":0},"5mcHr7_XCVrBfup6R-7toA":{"text":"I have came here many times and have not checked in. Shame on Me!! I love burgers. So it's","useful":2,"cool":0},"IkDo8FeSb8EpiMLcE4hQgg":{"text":"Exactly what I was looking for!!!\n\nVery fast service, fair price, great atmosphere, and cl","useful":0,"cool":0},"RN4Cb_aWC4IX_k8uPNkf3w":{"text":"I've been going back here, and it's steadily become my favorite burger joint in the city. ","useful":1,"cool":0},"N2Z6e-xRwkEQeYZPbiAjGg":{"text":"Fries eh but the BURGERS OMG DELICIOUS! The Company Burger might be home to the best burge","useful":0,"cool":0},"UhO8dFUumvZ6ayDFqF5ADg":{"text":"no ambiance, the meat was good, but paying 15$ without taxe for a lamb burger and a french","useful":2,"cool":1},"zCUfvfWoWZkj6nhZbmE4nA":{"text":"Asked for bacon mushroom Swiss burger...didn't have mushroom! It was start of day, so don'","useful":2,"cool":0},"v5Eq7nWENF2iEDHY9fX6Ng":{"text":"Best Burger Outside of Oklahoma. Best quality burger in all of Louisiana. Always clean. St","useful":1,"cool":1},"jUqbjQ0YALqNmMDCafyVng":{"text":"GREAT BURGERS!  The first time we went my husband said \"this better be a great burger for ","useful":0,"cool":0},"1FXMsesIpq49F5QrEQlczg":{"text":"Quite simply, perfection. The burgers are not necessarily special -- all standard, simple ","useful":0,"cool":0},"HvvTsUUqKMPfhf8piILZ7g":{"text":"Put on your goggles, because I'm about to gush all over you. The Company Burger may well b","useful":6,"cool":4},"KJu1LxiXQkS4lIoLt3S73A":{"text":"Best burgers in NOLA. Awesome onion rings. Waiting to try the pimento cheese with cracklin","useful":1,"cool":0},"xPRNPqlPvtdHJipMDY7qUA":{"text":"Nothing is ever wrong with this place...EVER.  Sometimes the lines are long but it's worth","useful":1,"cool":1},"CRMWyr8ijquh_W8eVjiB_g":{"text":"Excellent. Try the house flavored Mayos which are great and less like a traditional mayo a","useful":1,"cool":0},"K9XuK1G5Ii2xF1kEaQKVuA":{"text":"The onion rings were AMAZING. \n\nI wanted more on my burger. Lettuce, dill pickles, for exa","useful":0,"cool":0},"kfXUqlBt-2R-NZJfSiRQbQ":{"text":"\"BYO L&T\" says the shirt worn by some of the staff. \nI like this place and I like their bu","useful":0,"cool":0},"enUbv2Lmsk1iv4PX_Wq7Ew":{"text":"I work out next door at Anytime Fitness, and have been looking forward to visiting Company","useful":6,"cool":4},"ozrVabVXY6IZi5t8OEw8Og":{"text":"I have been here twice now and I have to say that both times were a great experience. Late","useful":1,"cool":2},"c-HzIcF0hb6b6MqIKeVytw":{"text":"Some say its the best burger in NOLA.  Those people probably eat at McDonalds and can't be","useful":3,"cool":1},"N6lD8buCpkBL7vHUgClIEA":{"text":"The burgers are great, but they offer very little in terms of vegetarian options.  My wife","useful":1,"cool":0},"nk3LScOxVXOsVFFMjIjCAQ":{"text":"I don't know what makes it so good (seems like your basic cheeseburger with red onion and ","useful":0,"cool":0},"QXYKOvWv_77I-4ptMbMTMA":{"text":"I stopped in on a recent Sunday for lunch and had the eponymous Company Burger.  The servi","useful":0,"cool":0},"c6RxBjsGcQbSS65duDo3vQ":{"text":"The newest of the hot new burgers places, The Company Burger does not disappoint. The Comp","useful":4,"cool":3},"NMd5_XO5yI7jEu2hMCc_1w":{"text":"Pricey, but for good reason. These are some of the best burgers and fries around New Orlea","useful":0,"cool":0},"CdDpXZWpMbZ2QcPPYtSsug":{"text":"Ok, I need to update this review. \n\nThings have changed since this place opened. For one, ","useful":1,"cool":0},"CdvtxhR7vEHWSvm_lpp0RQ":{"text":"A great assortment of burgers... Had the turkey burger here with green goddess dressing.  ","useful":0,"cool":0},"PFgj869CFw5VJLZSDz3erQ":{"text":"Very good fast food. Recommend to anyone after a quick fix. Simple and easy to understand ","useful":0,"cool":0},"G4ieEfOeKhKMXCYQ62aHFQ":{"text":"Probably the best burger in New Orleans! I usually just get the classic single burger. You","useful":0,"cool":0},"Z1Q6dnJtUEQh-YCnFonJRQ":{"text":"Are you a NOLA transplant from Utah/Idaho?  Do you miss fry sauce?  Company Burger has it.","useful":2,"cool":2},"L5QDvY1V4IClzDODEUtjuA":{"text":"I read that the dude who is the chef/owner of this spot had a hand in \"developing\" (whatev","useful":2,"cool":1},"knSqIjFfYBZSHFzLXR7wew":{"text":"The company burger was good. The prices were right and not outrageous. Walked into an open","useful":0,"cool":0},"9_Os5r3FwA5cJTvHqCbX4Q":{"text":"It's fast and so good. They make their own pickles, and have a bar for their in house mayo","useful":0,"cool":0},"QAXbpRzstRUjm386XPau7g":{"text":"The parties themselves are very flavorful but you can't really dress the patties the way y","useful":1,"cool":1},"T4jUIRsdXlfzy_W6fylQmA":{"text":"My family LOVES this place.   I like it fine.  But don't love it. Everything is pretty goo","useful":2,"cool":2},"zKUqLOY5oQbXQn509DrAqQ":{"text":"There's a lot of hype around this relatively new burger joint and it has a good set up and","useful":0,"cool":0},"S8AyahroxToE_DV_zQMmTw":{"text":"Great burgers! I had the Company Burger with all the fixin's plus the addition of Nueske's","useful":1,"cool":1},"c75MeyiiX_JqqsGXX-TWGQ":{"text":"Umm, yum.  Company Burger serves up totally unpretentious burgers with just the right amou","useful":0,"cool":0},"oPT_SvTTerrBoKus6LAa5g":{"text":"Really good burgers, made to order.  Really popular with the locals.  Burgers are hearty a","useful":0,"cool":0},"H5rZBZMMLmO3ASqa0QUX3Q":{"text":"Great experience. The owner was very friendly and talked to us for awhile. We had the burg","useful":1,"cool":1},"XaO8WBdAyBV2lk1kR3lmtw":{"text":"My first meal in New Orleans, and it was damn good. One of the best hamburgers I've had an","useful":0,"cool":0},"-_Xpee0uTOVDEknHfrZdiQ":{"text":"I'm no burger expert.  But I like my burgers.  You don't get a beautiful body like The Bee","useful":7,"cool":3},"-6wiB3CqyyZZVKgF0XAR4g":{"text":"A very good burger. A bit messy, but very tasty. A trendy spot with some nice options for ","useful":2,"cool":1},"dHee1E3Iigl-xaXkfCitpw":{"text":"Noon on a Sunday and packed out the front door, good sign. Everything was well worth it. T","useful":0,"cool":0},"Ym7JjZuX7H_AswFGcvNUkA":{"text":"Excellent burger, onion rings are thick and hand battered like I love but needed salt. I'l","useful":0,"cool":0},"4-XA2xr8vWirL6I8SueXcw":{"text":"So fantastic !!! Great service.  Very clean. Layed back friendly feeling.  Great burgers! ","useful":0,"cool":1},"iTwfIcxQ-FtJ3ZX2_SGk3g":{"text":"Was visiting New Orleans for work, Must say this is the best burger I have ever had. I lov","useful":0,"cool":0},"AT_wuYrqmncm3IQuEzJ5fQ":{"text":"Anthony Bourdain told me go here, and Anthony Bourdain is always right.  This burger eater","useful":2,"cool":0},"mIKYGFrCSHBeA_J3LeNw5g":{"text":"This place is great! Tons of space to sit, but only one tv but it had the game on so I was","useful":2,"cool":0},"tg-5DWeYeKp6KeU0Q7x7kg":{"text":"When The Company Burger originally opened, this town was in desperate need of a top qualit","useful":4,"cool":1},"xZ3mYKFHAYIiyRiVTtdd1w":{"text":"Tied for the best burger I've had. I love the mayo bar and the onion rings are the best I'","useful":1,"cool":0},"R5_h6I6628DdHDaf4j76Jg":{"text":"Making a good burger is easy, making a good turkey burger is an art. The Company Burger ma","useful":0,"cool":0},"oj73PQqLPRg9Z13VSsX4Ng":{"text":"I'm not going to belabor the burger reviews because all that needs to said has been said. ","useful":8,"cool":3},"HB6XXngkSh-Mtr24jJetpw":{"text":"Rico most favrite hamburger here in the Nolas. Only buy company Burger and the onion ring ","useful":1,"cool":0},"MPT8HKiPMlatXwCJAhm-eA":{"text":"As my son I were standing in line, a party of 4 walked in the door and placed their order.","useful":1,"cool":1},"CZGfXOent4E4ymDfEpRRJA":{"text":"My boyfriend and I eat burgers all the time in the New Orleans area, but decided to try so","useful":0,"cool":0},"ng_jmt2jYfQxLjEzPynrIg":{"text":"My Precious was getting a procedure at Baptist Hospital and had to fast beforehand.  Yelp ","useful":0,"cool":0},"I-JbVCOYyOv7CF9e32n-9g":{"text":"Great! Delicious! And a mayo bar?! Fantastic. Group of 6 of us wandered over to this spot ","useful":0,"cool":0},"9UVf963Gjp6PdwY7R1pjgA":{"text":"A different kind of burger. The steamed burger offered here is a welcomed addition to the ","useful":0,"cool":0},"rWEXW8SZ9iRS_dH8i6LruQ":{"text":"Expensive? Yup. But the lamb burger is worth every last cent if you're wanting something s","useful":1,"cool":1},"ioBT_5_axjnCwpELagTkAA":{"text":"This is a great burger. Don't go in thinking tomatoes and lettuce. Go in thinking unbeliev","useful":0,"cool":0},"bXwDFCzUHWCH2Js04274Xg":{"text":"Great, juicy burger right up the street.  Can't beat that with a bat (or the sweet potato ","useful":0,"cool":0},"DL_G0XwmUfDzBe6vAUFcGA":{"text":"Had the company burger with fries. I added the bacon. I like the fact that there are lots ","useful":0,"cool":0},"SRJ582ISzNOgeCkp4L786w":{"text":"best burgers ever! buttery, toasted bun, juicy patty at the perfect size. side items are j","useful":0,"cool":0},"6RG77p97Ldlvlp3NqI-NNA":{"text":"Overrated and overpriced very dissapointed 16 $ for a burger with fries  . 5 guys so much ","useful":0,"cool":0},"eMH4wJpSrHZ2ggolLrrkTw":{"text":"Probly one of the best burgers I've ever had. Place is cool the burgers are awesome. The s","useful":1,"cool":1},"52WRbKIvnwPC7jbWAb4qYA":{"text":"Really really good burger!\nI live near mid city, and was excitedly waiting for a few guys ","useful":0,"cool":0},"qSZr0cj0YX283JaTx1n7Ng":{"text":"This place was involved in the fattest thing I've done in a while: an impromptu food crawl","useful":0,"cool":0},"1-NVFbf78Eshp2ya4zopRg":{"text":"In NOLA last week and spent several hours at WWII museum and we were starving!!!!   Got th","useful":1,"cool":1},"4i0VFUVKRWSvRqO4Jnn5qA":{"text":"I went to check out the hype, and that's just what it is- hype.  I ordered the company bur","useful":8,"cool":2},"Lv26zFy8WKrLHYBdrky19Q":{"text":"Lamb burger = delicious. Unassuming counter service burger joint.","useful":0,"cool":0},"gu0hkK2qvL4arcDh6Kw9DA":{"text":"I was craving a burger and The Company Burger was spot on! I just got the single patty wit","useful":0,"cool":1},"O32kcERbA-sTZIqnD0pFIg":{"text":"I'm a cheeseburger fiend and Company Burger hit the spot.  The menu is simple, but the ing","useful":0,"cool":0},"3xShp9T7JAkBNDhqej9j8g":{"text":"I love their burgers and onion rings.  I think the best part is the house made pickles and","useful":1,"cool":0},"EV74we9zZaZ5OVRp1puTgw":{"text":"YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU","useful":1,"cool":0},"hQCrYPvWzml-6WiJbuv_AQ":{"text":"Came here for dinner tonight.  Was impressed by everything but the price.  I placed my ord","useful":2,"cool":1},"ywZ-lWUROjISMchGCrXFig":{"text":"So I went here with some friends. And, it's ok. Not bad, but not great. Nothing to write h","useful":5,"cool":1},"j4kM8Fivu56FpBIeAHYtpQ":{"text":"Favorite burger in NOLA. Company Burger corresponds to what I picture as an ideal burger -","useful":1,"cool":0},"GnUewXts3x_JyOB4e1HqUA":{"text":"I ordered a double Turkey Burger with all the fixings & an egg on top and an order of frie","useful":0,"cool":0},"jjauKd15MP1279p9CJFwVA":{"text":"Definitely top 3 you will have in NOLA, if not the best. I switch it up between the compan","useful":2,"cool":0},"44nspaHTaPxHXx30ZGIGtg":{"text":"This is place is awesome! \n\nI had a double with bacon and a fried egg, which was incredibl","useful":0,"cool":0},"ZluQ7pztiAMKU3b_HAcqjA":{"text":"Not to impressed with the burgers at all, specifically for the prices of the meals. \nNot g","useful":0,"cool":0},"YrIkwiBTyjNMxFnkrMpBmg":{"text":"May be the best burger in The Crescent City.  Very tasty. Also had the chocolate milkshake","useful":3,"cool":2},"Drws0Q0ecMHyE2m__ekKKA":{"text":"DELICIOUS burger and sweet potato fries... My husband and I both got the company burger an","useful":0,"cool":0},"YBNjUczYsDDO5tmdrHI25g":{"text":"Delicious ! Cute environment with very rustic decor, I had a lamb burger which was unlike ","useful":0,"cool":0},"ppcy4NKQ3wnHwa1ZgvIIaA":{"text":"Spacious and clean! Good burgers, would definitely put it out there that it's better than ","useful":0,"cool":0},"3P_buPf2UGIWB5MW-iu1zw":{"text":"You know why they call it the \"company\" burger, because like any other company (corporatio","useful":5,"cool":0},"iMJNtCdi5ibYaPWP0BQcGw":{"text":"Visited the afternoon of Monday, December 22. \n\nVery good burger -- would give 3.5 stars i","useful":0,"cool":0},"CUaDRK_0OoCT3BaXP1q4-Q":{"text":"Burger:\nSoft (yet doesn't turn mushy) and fresh toasted bun, delicious meat and cheese, ho","useful":2,"cool":0},"xJ60lboUzr586JVyUXt8XQ":{"text":"Only have bread and butter pickles! ;(  yuck.  \nNo lettuce or tomatoes. Guess they are try","useful":4,"cool":0},"5jbkkBb7hrLrdr0hjWJpAQ":{"text":"Love Love LOVE company burger!!! This is definitely my go to burger joint! I come here qui","useful":2,"cool":1},"Wd2hxTQwGLdyNXmL_H5bPQ":{"text":"Today I ordered \"The company burger\" it was perfect! Seasoned and cooked perfectly! Awesom","useful":0,"cool":0},"q11v5C1lcLgs2J6btMiRRw":{"text":"You might as well go to Wendy's.  I mean, the Company Burger tastes just like Wendy's, but","useful":0,"cool":0},"uZYNqrn0vlcAvxHNKDHdtQ":{"text":"This place is awesome. Super fast, professional and fresh everything is made to order and ","useful":0,"cool":0},"bQnTDEAX3FzNK61eQFZMWA":{"text":"Great burger!  and I'm picky.  The bun was perfectly crisp and buttery and the Mayonaise b","useful":0,"cool":0},"6WinnSwhpj7XIhowXH6AWw":{"text":"Pretty tough to beat. When all you want is a burger and something fried on the side that y","useful":1,"cool":1},"jDDBQIGq-LRUqGFqy-GiKA":{"text":"Company Burger is my second favorite burger in NOLA, right behind Cowbell.\n\n\nUsually I ord","useful":2,"cool":0},"ghEsGeiuglkAfiT5M00rJA":{"text":"An awesome place for burgers!  Nothing more to say... They do burgers right! The red onion","useful":1,"cool":1},"lPLnJlbQNCDy9vfuII1wTw":{"text":"Plenty of good burgers to choose from in NOLA, and this one is near the top maybe at the t","useful":0,"cool":0},"xpkK-x1_kUdL8CawqAyHDQ":{"text":"Food was great, had the burger, tasty and satisfying. The onion rings (red onion) were pro","useful":0,"cool":0},"Gq1hRFh2pbss0XYAMnX2mw":{"text":"I throughly enjoyed this place. This place kinda reminded me of Cali eating outside on a b","useful":2,"cool":1},"1nGd2pOJYmwU6Mt4wmPcng":{"text":"The only place I'm for Freret  street that had its own private parking .I was in the middl","useful":1,"cool":1},"czluF5OsEvd3EN1BDvE2yw":{"text":"My burger was on the rare side, but still very good, just as good as Bare Burger, but Bare","useful":0,"cool":0},"MoJelagImpQs82zV1IKrqg":{"text":"I went in to The Company Burger expecting this to be a 3-star place. I was definitely wron","useful":0,"cool":0},"TgiG2MlNk5Nf2pSnVKZ7gw":{"text":"EVERYTHING was amazing! the service was cool and fun. The single was amazingly tasty and j","useful":0,"cool":0},"OWIryaGCaCN9rrPirZAI2g":{"text":"Quick service - fast service.  Very kid friendly.  Company burger was a little greasy but ","useful":1,"cool":0},"IJ0sVxF7Gi7QU9MIBzMENQ":{"text":"The burger craze is in full effect in New Orleans and the newest burger joint on the block","useful":1,"cool":0},"WGvaQZXsej9voC6OkOtwfA":{"text":"This place is great. I love a good cheeseburger and this place is a great place to get one","useful":1,"cool":1},"KLgAtVeNlvfXetNmXw8Opw":{"text":"Was craving a burger today and stopped into Company Burger since I've heard a few pretty g","useful":4,"cool":1},"SlojcSoa_OhB9QUN-keSCg":{"text":"I got the single with cheese and bacon. It was good. Nothing healthy about it!! :) The fre","useful":0,"cool":0},"VWVmLbRD7luvfght8YCRPg":{"text":"To much money for what you get.  IMO.  Over 10 dollars for burgar and fries.  Its good.  T","useful":2,"cool":0},"kQPGmv0W-uUbmHjigJikAg":{"text":"Probably one of the best burgers around. Consistently delicious, juicy burgers. Great for ","useful":0,"cool":0},"BiV1dnaieUNMGg6Mii3Xxw":{"text":"I fancy myself as a burger enthusiast. I'm constantly searching for the \"best burger in Ne","useful":2,"cool":1},"7uTfJ1roYvTkrEPVf1R8jg":{"text":"Positives: One of the best burgers you will eat in your life. Next level shit.\n\nNegatives:","useful":4,"cool":4},"M6OrKyyNe0dOMdFT3fVnkg":{"text":"I went here back during their first weekend on 8/20, but just getting to writing up the re","useful":1,"cool":0},"O_GUTw9E_rO78rgZ83JknA":{"text":"Hands down best burger in town And their portion size and their beer and milk shake option","useful":0,"cool":0},"E0EX9k12HBO65UUFZW-V0w":{"text":"This is my favorite burger in the city. From the double-patty to the house-made condiments","useful":2,"cool":0},"gLtVDoe9iLa-kXnxqFhj_w":{"text":"I'm one who is easily bummed out by a bad burger, and Company Burger has yet to even come ","useful":1,"cool":0},"AxHnIj2tQdPr7XvzTPdeuQ":{"text":"This place was amazing and I am definitely going back! The serving size was perfect (not g","useful":0,"cool":0},"OwNK4KBWlRSv_FbJIpb5UA":{"text":"The condiments are the best things happening in this place. I love the many options for bu","useful":0,"cool":0},"cP8IsJ_Cv25fMP4ta1uMeg":{"text":"This burger changed my life. I'm not the guy who likes tons of toppings on my burgers, so ","useful":0,"cool":0},"ZkU-YL8tZcyXwKP9XQVP6A":{"text":"Went on the recommendation of a food blogger and sadly I was not impressed. The burgers we","useful":0,"cool":0},"l--zRX5uML-ran6bd9QjQg":{"text":"I've been teetering back and forth on 3 vs 4 stars. The food was good, the place clean, an","useful":0,"cool":0},"acALhxsuxMxVOTRkyU4FSg":{"text":"Great burgers, great for all ages in the family.  A bit greasy, but lots of flavor.  Burge","useful":1,"cool":0},"PFMH-vQJrJHpSNrOUgdsBg":{"text":"My sister took us here while we were visiting in Nola! Glad she took us here! They burgers","useful":0,"cool":0},"SSHXji20U8NQ-zQMOuix5w":{"text":"Burger was very good and the fries are made fresh. My favorite part though was the milksha","useful":0,"cool":0},"IfzbtJb0qP2OrgHrGc2j9Q":{"text":"my favorite thing about this place is the dipping sauces. what can i say, i loving dipping","useful":1,"cool":1},"hcjLvvzAvvvIBEt1PfWmUA":{"text":"Looking for a good ol' plain burger? This is the spot. I figured I'd give other items on t","useful":2,"cool":0},"MCbEf8ubLcODDSOn2FY5hQ":{"text":"Their single is simple but perfect! Full of flavor, especially with some chipotle mayo and","useful":1,"cool":0},"QYYtrbWwG1jh2-aF5rcMlw":{"text":"Everything about this place is quality. The menu is sparse but the burgers are amazing. Go","useful":0,"cool":0},"L5H8-FtjLGz2fV5s8xKHmA":{"text":"I've heard some very good things about The Company Burger from friends and am always looki","useful":2,"cool":0},"xHzIXBBXhLfTqN2U5ZK-8w":{"text":"this place has resuscitated my burger habit after a hiatus of many years. consistently gre","useful":0,"cool":0},"jLZ9xk6C5rrkkw8agYwuoQ":{"text":"The burgers were good, not great. I liked that they use organic beef without hormones and ","useful":0,"cool":0},"byhR97DIDwaJesGmrEPaaQ":{"text":"First time eating here. I just moved down here from NY and heard The Company Burger is one","useful":0,"cool":0},"XmjSP51ePTWUY01fGoThkw":{"text":"I think this is the Cheesecakefactory of BURGERs. Only if you like gourmet burgers. Well y","useful":1,"cool":1},"Cv9udyoRGSBj55Uqt77rKQ":{"text":"Well, we found this place on a whim driving around and it turned out to be quite the pleas","useful":2,"cool":1},"OMUE1iqn2EcUj0NhfVMvFw":{"text":"These burgers are LIN-SANE!!!! (hahhaha...just had to...)\n\nOk..So I finally tried The Comp","useful":1,"cool":1},"d2F1d-0jRGFK1Qnh8JrCdQ":{"text":"The burgers and sides are definitely satisfying. The portions are not huge and it's not a ","useful":1,"cool":0},"zrssy0fQP7kVZFbVkPfoAQ":{"text":"Came to the uptown location expecting the consistently good burger and milkshake that Comp","useful":1,"cool":0},"KNG4gVYJjJhkISsZwTSCFw":{"text":"Hands down best burger in town! I always get the double and I love their mayo bar! Their f","useful":0,"cool":0},"skPCbWOVcsjKiNIlqNysBw":{"text":"was looking for a good burger joint found it in the company Burger hands down the best bur","useful":0,"cool":0},"e6fOqBft4J5hwQAsF8SyBw":{"text":"It wasn't bad, it just wasn't great. The prices are a little high and although my lamb bur","useful":0,"cool":0},"1x0Tybj99rgQcPSy7k0nJQ":{"text":"Yum, yum, yum.  A staple now located on Freret Street that is experiencing a food and econ","useful":0,"cool":0},"66R3yIG2UdWPMAHD6X1gwg":{"text":"The girl who checked me out was rude and gave me a very distasteful look after I only drop","useful":1,"cool":1},"sF6v_gCDl9U2cQGqlnFvKw":{"text":"Good burger, great sweet potato waffle fries and fabulous Butterfinger shake. A little sho","useful":0,"cool":0},"bxpYGBgfx_3RSae8atS9FQ":{"text":"It's good, it's fast and damn, the pickles are good.  the grease factor knocks it down a l","useful":0,"cool":0},"C2Wd0JUrw00Xl82NjQ53Dg":{"text":"Awesome burger with equally amazing fries at restaurant price. If you're looking for a qui","useful":0,"cool":0},"Sl59oIsX2Eq0sTARDHyqxw":{"text":"the burger was good the onion rings were great but for the price i might not come back too","useful":0,"cool":0},"YSZHf9Leiq7DbJDrpkkIjw":{"text":"First Time here it was good but not amazing. I did enjoy the way was cooked to perfection.","useful":0,"cool":0},"A4kEcY9S5ljp0m8C6cCuYg":{"text":"I won't go into ridiculous detail about the burgers here because there are so many reviews","useful":1,"cool":0},"_HTDFwehTkWeLk4L6Sgrtg":{"text":"I would probably like this spot better if they offered a veggie burger option. Maybe I'll ","useful":7,"cool":3},"9EUpn1zHcqasrJtl2aXrJw":{"text":"Over Rated...They make a good burger but not a great burger. Expensive for what you get...","useful":0,"cool":0},"YJIUXL52y5lEUjEmVmI5vA":{"text":"Love this place. The mayos make the burgers really special and their sides are all amazing","useful":0,"cool":0},"uGackPhftRADjvJTuIyuRA":{"text":"My burger was very good. Fresh buns, fresh veggies, and the meat was cooked a perfect medi","useful":2,"cool":1},"KNZPvf2Z1LlMbjheBhWzjg":{"text":"One of the best burgers I've ever had~ seriously! It's a cute place in a neighborhood that","useful":0,"cool":0},"03sbmo0Ep56rdl2z19oSxQ":{"text":"These guys do a great job on burgers, fries, and onion rings. The buns are very fresh, mea","useful":0,"cool":0},"AkV09iq0PQaIK1-q7cU7KA":{"text":"Delish. Pricey, but you get great quality burgers. Cheese tots and Chocolate shake are gre","useful":0,"cool":0},"mfbjJBxd9s-WW2EEleYopQ":{"text":"Best burger I've had since moving to New Orleans (1997), plety of parking, can't wait to t","useful":0,"cool":1},"UIkrV441CplcbejjMcXyZg":{"text":"This place is just about awesome, simple menu and gormet mayos. A bit on the pricey side f","useful":0,"cool":0},"7NwIn7i3wUtcPId3Fj12_g":{"text":"My family and I went here for lunch on a Saturday. They were packed, and for good reason. ","useful":0,"cool":0},"hGBm7wsMFv-2W83_I41JGw":{"text":"One of my all time favorite places to eat! This place never disapoints. The burgers are am","useful":0,"cool":0},"hky3hdoDog8tsfTONpQ1rw":{"text":"This was posted for the wrong location, should be for the 611 O'Keefe Ave location. \n\nWent","useful":0,"cool":0},"d3rQpqPMCa00sR-apULg0A":{"text":"The burgers are good and the tater tots are delicious. It is a bit pricey but overall good","useful":0,"cool":0},"kfg_0-JEdD6Frbt9G5YWUw":{"text":"I'm a burger guy. If I'm ever on death row, the classic burger and fries (or onion rings -","useful":12,"cool":10},"boSFlN8VbIrPjyks9bveyg":{"text":"I believe The Company Burger could end racism and create world peace. I believe The Compan","useful":0,"cool":0},"RryZGxN_cBvY-JkwOP_MQw":{"text":"Easily the best burger anywhere in New Orleans!\n\nThe burgers are just so juicy that they a","useful":2,"cool":1},"mfZv1NEzwNwH0avQ0ig2eQ":{"text":"One of the best burgers I've had in my life. Local, organic meat. As good as it gets.","useful":1,"cool":1},"e9T81Fi2T6eWNkG1I6kFDQ":{"text":"The lamb burger was one of the best burgers I've ever had. The buns are shiny and soft, th","useful":1,"cool":1},"dHpXFZ6E5IkKMkxE5aH_8g":{"text":"Overrated would be the moral of this story.  It was a \"good\" burger but nothing that I'd w","useful":7,"cool":2},"Au2lvGAFk_TdOphJ47Firg":{"text":"Great burger! However, lets focus our attention on the onion rings those things will have ","useful":1,"cool":0},"0eHzO4sNtktRMW_Do0yUew":{"text":"Twice i've attempted to make it into the doors of this place, but i always managed to arri","useful":1,"cool":0},"rx92yzgRVjs5JpC_wGtb1A":{"text":"One of the best hangover cures in town. Add the bacon and egg and its guaranteed to cure t","useful":0,"cool":0},"WfJq79GFaWGmCVZd5xIjEA":{"text":"One of the BEST burger and fries I've ever had and Adam the owner is very nice and cares a","useful":0,"cool":0},"LDLRDS1q1apLyLMvzD5nbQ":{"text":"Not really impressed. The burger was just really greasy and covered in cheese. Supposedly ","useful":2,"cool":0},"X4AZdH5P57v_uXAhVgd4yg":{"text":"To me, it's the best burger in town. It's a small yet busy restaurant in the Freret neighb","useful":0,"cool":0},"hEP99y0Y_MDjTuCBrcOMGA":{"text":"I was not prepared for their version of a burger.  I thought this establishment was somewh","useful":2,"cool":1},"bTZBQK-v8RjYlVFmN2NTmA":{"text":"I was a fan the first time I had Company Burger.  Soon after they opened, I got a burger a","useful":0,"cool":0},"nURuDhpmgEXHT0erKLb8lw":{"text":"In my opinion, Company Burger is the one of the best burgers in the city. The restaurant u","useful":3,"cool":2},"B1GRanbuUPKSqVvobyWpzw":{"text":"Burgers should be juicy on the inside, not the outside. Staff isn't friendly, but at least","useful":2,"cool":0},"XW_4on_WxJzKGyTTNt5EDw":{"text":"I just love this place.  The burgers are perfect in their simplicity, and that mayo bar...","useful":1,"cool":1},"O3eJMrVRYbjn7wElIYy5Sw":{"text":"The burger was good. The meat was fresh and the buns had a good texture. The fries and oni","useful":0,"cool":0},"3HQNBGg1q9uSYbQv3EphPg":{"text":"Love every delicious bite! And opt for the sweet potatoes fries....so good!\nOnly wish we d","useful":0,"cool":1},"6A4VBK_K-n6hBXEeV_KyCw":{"text":"Really not much to say here?  It's just the best burger in New Orleans. There is nothing b","useful":2,"cool":2},"RFfMEtRY5vHQSLZiEID4aw":{"text":"Turkey burgers can be done any way a regular burger is prepared and just as addicting! Fri","useful":1,"cool":0},"DSivRQTfyqFrNsTwp8wlMA":{"text":"I've been a long time customer and always have a great burger - juicy, perfectly cooked pi","useful":0,"cool":0},"-n-SO_QjtnrszMtnNz3Ydg":{"text":"My wife and I hit this small burger joint while visiting our daughter who recommended it t","useful":0,"cool":0},"dqwerDCHOY9iIOfNVewDLQ":{"text":"This burger is pretty good! I've heard a lot about The Company Burger and the amazing pick","useful":0,"cool":0},"iTxClkEjj95tcXlSac2I7Q":{"text":"In reality its a glorified Five Guys. Its much more expensive and not as good.\n\nA single (","useful":4,"cool":1},"X_cloZh6BF56yQrNqiQ7QA":{"text":"This is the best burger in the city! I love the onion rings.  I dream about them often and","useful":2,"cool":2},"L2S8KwqtTcKSNVrKeoQXjQ":{"text":"The Company Burger is one fantastic burger. The beauty is in its simplicity-no crazy toppi","useful":0,"cool":0},"kMntDkomzYfCpJmJivq61g":{"text":"Absolutely fantastically delicious.  I was a little doubtful of their \"one burger to rule ","useful":2,"cool":1},"_Z-QRSVoq3OiS1Go4aHUzA":{"text":"Excellent tasting burger and fries. The place was clean, spacious and good A/C. It offers ","useful":0,"cool":0},"8gEZi2TdstuL87bagOz3AQ":{"text":"I know if it's the quality of meat, but those burgers are so freakin delicious. I've never","useful":1,"cool":0},"8zcZBhKVaW59PHIE-5QD2g":{"text":"Ehhh, I have had better with shorter lines. I really like the atmosphere but the sales guy","useful":8,"cool":4},"ptABYeGW1DFu5jdXRYnmeQ":{"text":"Great food, great service, and nice people! No kids menu, but the company burger is legit,","useful":0,"cool":0},"CPZr7U3s4HOmqjuZdo9UwA":{"text":"I thought it was good, but the cheeseburger was not worth the money.  I was hoping for a l","useful":0,"cool":0},"qckglKDo_jToBntFbFOhZA":{"text":"Company Burger was great! Which I'm glad to discover now that I live just around the corne","useful":0,"cool":0},"3FQcruAmiHTU1biuxlgg-g":{"text":"Kudos! The burgers are fabulous. The fries are perfectly yummy, I cannot wait to return.","useful":1,"cool":1},"m92Cd2WjLT_jGlLEzwkdCw":{"text":"Walking distance from my house. Love this place. Add the egg to your burger it's Delish!! ","useful":0,"cool":0},"kBcU9TeJqYgGtvpdOwTDrg":{"text":"If you don't love this place we can't be friends.\n\nIf you don't \"get\" why this is a superi","useful":0,"cool":0},"tG4PGEq2z5lvTU1pm3L9Jw":{"text":"Oh LAWD this is a good burger. I had the lamb burger and it was so good. That was the firs","useful":3,"cool":1},"NtusPbQ9Nv8BwzqXQa4teg":{"text":"Best burger I have ever had it was well seasoned and it killing the game. The menu was sim","useful":0,"cool":0},"BVhuZwwVKT5YAkWZ41PyJA":{"text":"While the food was good, I wasn't blow away and it didn't live up the hype. My first impre","useful":1,"cool":0},"Yi47_fiUUiJU7YldLTvd7g":{"text":"You know the old saying \"You get what you pay for\"? The Company Burger is a good example o","useful":1,"cool":1},"RfJgzrF8NUikl0JhKAeWEQ":{"text":"Delicious yet small burger, simply to die for! I added a fried egg and it really completed","useful":1,"cool":0},"P4_kuGxALIuHRBDKktI4qg":{"text":"To sum it up:\n\nGood burger\n\nExpensive burger\n\nWill by no means give a slice of lettuce to ","useful":1,"cool":0},"Vl2TNSPKkJt1kz22lftw1w":{"text":"Love this place. While the burgers are a bit small for the price, and yes the lack of lett","useful":1,"cool":1},"10ohAAKlHVc-YSYYaV5vog":{"text":"The Company Burger food is great. The buns were fresh, chicken, Turkey, fries, and onion r","useful":0,"cool":0},"xrCQesKpU2vR83GpqgLqKw":{"text":"This place was freakin awesome! So first Get the fried chicken sandwich, it will blow your","useful":0,"cool":0},"JVJYRVRFxuXbQfpdk7rj2A":{"text":"I can only agree with John L.H., as it is so easy to do. \nA solid burger, while they do no","useful":0,"cool":0},"leGywmB-fIL9cuYEfmSbnw":{"text":"If you come here for a burger you really should pay the extra dollar and get the fried egg","useful":2,"cool":0},"olqXP2-vOCzVQt837A_Eqw":{"text":"But the burgers taste like gentrification...\n\nI kid, I kid.  So, the burgers are cooked in","useful":4,"cool":1},"N9egybaHOPeQLSrbsOjinA":{"text":"Why did I wait so long to try this place? This place is amazing! You can taste the freshne","useful":1,"cool":0},"2C3OGlkZXsOcZAk-e6LyHA":{"text":"This place has very good burgers. Try the company burger topped with egg, it's very delici","useful":0,"cool":0},"219n5DVGFTnSnv1Ie5IPEg":{"text":"After all the \"best burger in town\" buzz it's somehow generated, I found Company a pretty ","useful":2,"cool":2},"rTh91f9X66hIHu7iG1aFpg":{"text":"Wow. Can't believe I've never wrtitten a review for this place.\n\nHands down best burger in","useful":3,"cool":1},"kXAKrc_GsxAI5GpJwIMzWg":{"text":"I had a craving for a really good hamburger so I walked over to Company Burger. It is a re","useful":0,"cool":0},"tJR53LC0PcyW6WPy-3KLsg":{"text":"I was on my way to 5 Guys for a burger but figured I'd try a non-chain/local place instead","useful":0,"cool":0},"beiQkMiv7w7HnZxxktmzfQ":{"text":"Awesome food with awesome service. I had a milkshake there and it was amazing. I definitel","useful":0,"cool":0},"JaEvkINt5ZMR9YMnDpCuuw":{"text":"So after about a 15+ minutes wait, despite no one being in front of us and having over 6 s","useful":1,"cool":1},"IEp01Rcbdebwznkc11ZcOA":{"text":"We have visited The Company Burger on Freret 2 times while visiting NOLA. Delicious burger","useful":0,"cool":0},"hOwprYwgA4Wrw5ucPKNPzA":{"text":"Lamb Burger....awesome! The Company burger with all itz fixins.....also great! The house-m","useful":0,"cool":0},"QhGwf3HQCNl_riEjmQW6Mg":{"text":"This is definitely my favorite burger place. The burgers are juicy and dressed perfectly. ","useful":0,"cool":0},"sCaY7mhjIi1n20ZPOQjI9A":{"text":"I like the burgers and fries and the homemade pickles/ mayo.  My last visit will detour me","useful":3,"cool":0},"BwRVydUlSHF__MkKGy9Gjw":{"text":"Real, honest, beefy burger. Perfectly cooked thin patties still pink in middle. Yum! The v","useful":0,"cool":0},"Hpx65SOq2VfBdsni2qUegw":{"text":"A bit pricey but very yummy! And they have a condiment bar available with mayonnaise and o","useful":0,"cool":0},"sWuXGtPKPG8ag12LPXHj9Q":{"text":"Oh. My. Godddddd.\n\nOk. First of all, let me start by saying that I am not a GIANT burger f","useful":7,"cool":4},"5SaoCid_s-YL5Nz-enjY-A":{"text":"I prefer tru-burger on oak. This is the typical freret street experience: greasy food, lot","useful":0,"cool":0},"cBigKruoLmNnz_1fdV4FOQ":{"text":"We stopped in here on a Sunday evening after walking around NOLA all day. (We randomly pic","useful":0,"cool":0},"ECdKIcrnxTkVy2zEGQldJA":{"text":"I should have read these reviews before ordering.  I would have gotten the Lamb or the Tur","useful":0,"cool":0},"WIvKiYyWOp707QDG0fuuVA":{"text":"I will NOT eat another burger (and enjoy it). I have been coming here since they opened an","useful":1,"cool":1},"QpncTzQbkdB_nwjXlPRB2A":{"text":"I have lived on Freret Street since I moved to New Orleans in 2001. As a local home owner ","useful":1,"cool":0},"LmHbHgpT54VJ880mZXIO0g":{"text":"Pretentious much?\nI never actually ate here. I asked if my hamburger bun could not have bu","useful":3,"cool":1},"GAVTr95L-MyPrwK0a-EKFg":{"text":"I'm so in love with these burgers & fries....enough fries to share also! The straw issue i","useful":1,"cool":0},"ffvJ3z3UIBnhsiZ56yWuHg":{"text":"I have pretty high expectations for gourmet burger joints. My standard is Good Stuff in Wa","useful":2,"cool":0},"3xbyI2PUAH-pnLiG-8adIg":{"text":"Not a bad burger. A little pricy tho. I wish they had crispier buns and a little thicker p","useful":0,"cool":0},"-31tMacE5gxt6NaHYFF-6w":{"text":"The best burgers I've ever eaten in my life. And the world knows it- they were voted one o","useful":0,"cool":0},"0Cw9bKkR6vX-u3z1tqgSQA":{"text":"There is good and then there is the moment where you taste a little bit of heaven. This bu","useful":0,"cool":0},"5BbUHmJiZuEKoE3euk59SQ":{"text":"I've eaten burgers at a lot of places.  My wife is a burger fanatic. \n\nThis is the best. H","useful":1,"cool":0},"5DKt06MGrQMOsD5oikxveA":{"text":"Oh dear god, The Company Burger has ruined me on all other burgers for the rest of time. H","useful":2,"cool":1},"7waGIV2u4rq-CjIaBlD_xw":{"text":"Great burger. The outside of the patty had just a little crunch but not burnt flavor. The ","useful":0,"cool":0},"02IT7Vh-9wBAm2Gm5C-Z9w":{"text":"I loooooove The Company burger. I think they serve my favorite burger so far in New Orlean","useful":0,"cool":0},"9li-BYGHRNqMtDCK0aiXrA":{"text":"Can I give it 4 1/2 stars?  This is one of the top few burgers in town hands down. Freshly","useful":1,"cool":0},"NkWcKJ0vSdt4BSjjJeJRZw":{"text":"If you want one of the best burgers you will ever have in your life, then come here and tr","useful":1,"cool":0},"ABF2_IPxnrrn-3BOkb-VyQ":{"text":"You order at the counter and then it's an open dining space with a few outside tables, whi","useful":4,"cool":2},"4SWW8ZHDIdmiuwmKTuP9nA":{"text":"The best way to describe the style of burger is a high quality fast food burger. Thin meat","useful":1,"cool":1},"gaGMi_Ba5NeayJmscY3j0Q":{"text":"We've been coming here since a week after the grand opening, and their burgers are as good","useful":0,"cool":0},"lwtTuxq18GCRiQ7JmPEnyw":{"text":"The original and the best. And now made much better by being open on Tuesdays!\n\nThe line c","useful":0,"cool":1},"xIrtqY8he78YXRilqmOxcA":{"text":"Wanted to try out this burger joint because this place supposedly has really good reviews.","useful":0,"cool":0},"GdfPhnA7QjGU8lqVh8xyKg":{"text":"I've  ate here 2 or 3 times the Burgers are good an I Love the waffle fries. But it's a Li","useful":2,"cool":1},"RStKRoMxfr_Qr-HH14C0xw":{"text":"Great burger and the onion rings are perfect!!","useful":0,"cool":0},"CJ0Hr7-052CjAFzkztVarg":{"text":"Company Burger is probably the best and most consistent burger in Nola. The meat is cooked","useful":0,"cool":0},"o__hCfGimhVGR5bnUbWspw":{"text":"Well this place is a hit with me. I did my research. And searching new orleans best burger","useful":0,"cool":0},"YDfoy8h0NTgIzDojJs1Mdg":{"text":"$15 bucks for a burger small fry and a drink...what?! That's crazy, the food was good the ","useful":1,"cool":1},"AInlQyMp8DsYselM-xfGlQ":{"text":"Had the double cheese burger...it was GREAT. So flavorful and juicy...and not an obnoxious","useful":2,"cool":0},"0JZlnQg7Nb5HhRIlA5_Eyg":{"text":"Being s heavy burger addict, this is hands down, my favorite burger in the world (so far),","useful":2,"cool":0},"anbpm3acuXOn6Xd6SbWJGA":{"text":"This place might just have the best burgers in the world, and certainly in New Orleans. Th","useful":0,"cool":0},"CQwWp7pkKXS278Fv78O25Q":{"text":"Turkey burger, sweet potatoes fries and milk shakes is a good combo! Prices is okay. Outsi","useful":0,"cool":0},"0ZhvU9rFyDT3ug5N6UbJZA":{"text":"Always my favorite stop for the best onion rings in the city! While I think the burgers ar","useful":2,"cool":1},"7XiX5_1KSSYKmieExNFBPA":{"text":"What hasn't already been said about this place.  Well reviewed and received for a reason. ","useful":0,"cool":0},"Hi5fra5GjynbEW2o-tTGog":{"text":"I had the \"company burger\" and I enjoyed it so much I went back the very next day for anot","useful":0,"cool":0},"2g21ajhHgzvax8jiPa_zXw":{"text":"This place is great! My 10 year loves it.  I like the atmosphere and the food is awesome. ","useful":1,"cool":1},"xHF_cWY67ROTXlkRIhiuPQ":{"text":"I've had better burgers all over Nola. If you are in New Orleans, with the best restaurant","useful":0,"cool":0},"L3G8lQ7swoWNZ7Cc3uXCmQ":{"text":"Consistently delicious over the three visits I've made.  Like burger buddies Cowbell, the ","useful":0,"cool":0},"eFZyDsr3KBw3Vtyz9HBHKw":{"text":"This review is  about 4 months late...but the memory of this awesome burger sticks in my m","useful":1,"cool":1},"yPzbE4soBHZDNhvFa9vvHA":{"text":"A burger without lettuce or tomatoes???? Talk about a chef who is totally obsessed about t","useful":0,"cool":0},"SZ1MpVbZqpITfeY9GSjP9w":{"text":"Good burgers, a nice atmosphere, and they will have tap beer starting up shortly.  Seems l","useful":1,"cool":0},"wUnsAeAz3D1-_wEDyRvfmA":{"text":"Damnit, if I didn't love my food when I was there. I did. The burger was a decent size, ju","useful":2,"cool":0},"sh3OUIKac0hNR1Iy-cfaZA":{"text":"Okay. This is tough. I'm always on the look out for a great burger which honestly I think ","useful":3,"cool":0},"Ke_RXZEex_U_PzgTI9d_qw":{"text":"I consider myself a Burger elitist.  I seek out the best burgers in the metro area, and I ","useful":3,"cool":0},"OW6W5q5o5llkNYXHShj1hA":{"text":"Have better burger restaurants in new orleans area for the price and quality. $ 16 dollars","useful":0,"cool":0},"cvdt61xhF9JUbfQYpKom8g":{"text":"The company burger offers a very tasty burger indeed. The burgers are not cooked to perfec","useful":0,"cool":0},"8ZHDAFbYSEf-ksCbOe1vLQ":{"text":"My girlfriend and I have heard mixed reviews of the Company Burger and decided to see if t","useful":0,"cool":0},"NWlx7JsQJ6cvTR6YXhgHtA":{"text":"I just got back from dinner at The Company Burger and it was so outstanding that it inspir","useful":4,"cool":2},"jFzacM6ZIEmCbXmynQhI-A":{"text":"I had the single burger and oh wow oh my! Delicious! The meat is well seasoned, the bread ","useful":1,"cool":0},"IoLH91UJgSMcEMiAUzZ0bA":{"text":"Dee-lish! Amazing food, great atmosphere, quick and polite service, and they always have s","useful":1,"cool":1},"ilk2ZBYYUG2RF36b3oSKTw":{"text":"Del-ic-ious! Super yummy burger definitely on the greasy side (in a good way) and seem lik","useful":0,"cool":0},"chW27OP4tNV3sujjv24P4w":{"text":"BEST burger ever.  I've only ordered the company burger.  When they name a burger after th","useful":1,"cool":0},"fuJr7OhAP84K48jDiO2lCA":{"text":"Company Burger is okay, it's just not for me. \n\nMy more recent trip might have soured me a","useful":4,"cool":1},"qLJ_vvoPY3vDEvx1STMtHA":{"text":"OK. I'm a big burger fan, and there really aren't a lot of great burgers around New Orlean","useful":2,"cool":1},"xoqVaRyFOHZi58iNFVFAMw":{"text":"I must say that yes they have cut down the grease by using a higher quality of meat but fo","useful":1,"cool":0},"XN72GoS4syJPllPPOg5_rg":{"text":"I thoroughly enjoyed my experience here. The cashier with whom I placed my order was frien","useful":0,"cool":0},"aVRgPscU7rgQwNCGEGyTtA":{"text":"It was seriously one of the best burgers I have ever had. It was nice and moist!","useful":0,"cool":0},"V5JPBdfPmPlQfMLoR4js5A":{"text":"The first time I had company burger I was in love. No one and I mean no one could talk poo","useful":4,"cool":3},"3WkBbAZiyM03foFp8AMjTA":{"text":"Yeah, it's just a burger joint, but they do it insanely well. Best burgers in town! As a s","useful":0,"cool":0},"2q8F9baT1OkgpOLpsRsANw":{"text":"We love this place!  The lamb burgers are our favorite and the onion rings are out of this","useful":0,"cool":0},"EZT40hdFMSU2K9PbdzjIbw":{"text":"This is my favorite burger in the city, so far.  I've tried quite a few now. This one has ","useful":0,"cool":0},"_rekWCOP8FICsjIFEluIKw":{"text":"Always a fan of this place....the burgers are great and I want to build a mayo bar in my h","useful":0,"cool":0},"TDv2BdT0RiIlf_svFlx4iw":{"text":"Great burger!\nI can't say enough about this place. They simply do burgers right. We go her","useful":1,"cool":2},"SNeR6Ts1E3mI0TxUWvfhEw":{"text":"I don't know that I can add much to what has  been written.  Nice, clean modern building s","useful":1,"cool":0},"jZg8R0zT_RYUwykuvDaH3Q":{"text":"It's overpriced hamburgers with more salt than 10 people should ever consume in a week.","useful":0,"cool":0},"-50k5ZgsK4o4Jtb-2xj-jg":{"text":"I'm not a fan of this style of burger. The burgers are slim patties cooked medium to mediu","useful":3,"cool":0},"aJoiok-9tiQrFWcLH4cw2g":{"text":"Overpriced burger with a bland taste. Not impressed with the mayo either. I had better at ","useful":0,"cool":0},"YCPU-dUl8sH3CoEBide_QQ":{"text":"I enjoyed my burger. Absolutely no doubt about it. I got the Company Burger with a side of","useful":5,"cool":0},"yq1ppoa-o7crK-2-crdcEw":{"text":"Great and speedy service. I got the regular burger with bacon and fried egg. Cooked to per","useful":1,"cool":0},"G1Y8P68oxkKZ1bPy3yl6GQ":{"text":"I've been to Company Burger twice now and I have to say that this place has hands down the","useful":1,"cool":1},"nkfIFKYUIcFZ44EsemjLFg":{"text":"Turkey burger and company burger with fries...  patties are homemade and the perfect size.","useful":1,"cool":1},"DN0VAH_WHyKjAr0U5mLcog":{"text":"Company Burger serves up some of THE BEST burgers I have EVER had! I remember my first bit","useful":1,"cool":0},"qA9Hbmpc7m1eJgM9neEeQQ":{"text":"This is a VERY delicious burger; super moist and tasty (I added the fried egg)! The onion ","useful":2,"cool":0},"Ium2iAWUFWEFt9Rae_f_1Q":{"text":"Holy S***! We rolled 14 deep with 7 kids under 5 after a long day of parades and everyone ","useful":0,"cool":0},"Kdwq--fXL62Y9qjQ7ADWrA":{"text":"If I could afford the calories, I would eat here once a week every week.  Love everything ","useful":1,"cool":0},"0F_AN2UQAOVXmcYciMo-Tw":{"text":"Good, but certainly not great. I will say the burger was cooked perfectly but could have b","useful":0,"cool":0},"8U2hpP3zWkREpRvCK3WEvA":{"text":"First and foremost, I gave them 4 stars based on the cost of my meal, which was almost $13","useful":2,"cool":0},"GXdXHNMa_LpDr-pzFMwxVg":{"text":"Best burger in New Orleans, in my humble opinion. During my most recent trip, I decided to","useful":2,"cool":2},"7-EhGxMmZbNKFQKQFsRQFw":{"text":"One of the best burgers and milkshakes in the city. A little pricey but it is well worth i","useful":0,"cool":0},"wfoTcc_hGq5HR3FjhMoMFg":{"text":"Although small in size the burgers really pack in huge flavors. All my taste buds were eng","useful":0,"cool":0},"j6XC7SM4Twscxen3nF5sJw":{"text":"great burger.  there are many good choices in new orleans. among them, this one is very co","useful":1,"cool":0},"qFXELOzkFSrgbngHigfOjw":{"text":"Yummy.  I liked the Burger, loved the fries and tater tots.  Service was super friendly.  ","useful":0,"cool":0},"MDXdFlfr0tDigXgg9RqQVw":{"text":"OMG!! If I knew I wouldn't gain back all of the weight that I lost, I'd eat here more ofte","useful":1,"cool":0},"sq0DMfOw_WveP9nsr0PfUA":{"text":"I have been to this restaurant previously, and while I was not particularly impressed with","useful":1,"cool":0},"m9JAdj-wFGYyXPbdALQG2g":{"text":"Dear Company Burger,\n\nTonight I was dreaming of your tasty goodness and I was disappointed","useful":1,"cool":1},"Rf1S-ly4gmMMlqkbvca8oQ":{"text":"The food was good, the people were helpful and nice, but THE MUSIC WAS AWFUL and made my o","useful":0,"cool":0},"pSrYRU9wDVs0fZhFWrbXLg":{"text":"This has instantly become my favorite burger in town.  The juicy patty, flawlessly seasone","useful":1,"cool":0},"x3SZfK1R-p94dsNv7MN-8w":{"text":"The Company Burger does burgers right. I'm not a huge meat eater, rarely indulge in a hamb","useful":3,"cool":1},"rUFw0NV_b0rre1Ah36zBZg":{"text":"So, Company Burger isn't bad..l it's just not good. It didn't live up to the hype or the s","useful":2,"cool":1},"laWQX6ICq5vp5KDx1uUeVg":{"text":"This is literally the best burger I've ever put in my mouth. My husband and I each got a C","useful":0,"cool":0},"qyBLgQhmthl95B8FkLssLw":{"text":"They don't have much of a selection and the service wasn't really that great. The burgers ","useful":0,"cool":0},"mB_DFwe8BnE_ovApdL4djQ":{"text":"Very good burger. Juicy or maybe greasy but good.  Great atmosphere and wait staff was fun","useful":1,"cool":0},"7jKJETwQGWztpoHGPp6_oA":{"text":"Been here many times and it is always superb! First of all, the staff is always super frie","useful":0,"cool":0},"1TJu0xwmQSmgaI-UrRdT4Q":{"text":"They're hip, trendy, cool. #YOLO and... whatever. The prices are pretty high, their hours ","useful":2,"cool":0},"OY0VqSAZ6AaOkNpOlujBOg":{"text":"We were in town visiting and I'd seen this place referenced in numerous articles. We order","useful":0,"cool":0},"zNo1vBKUX9mFXsrMZ5Ll8Q":{"text":"One of my favorite burger joints in New Orleans.  I always get the Company burger and add ","useful":0,"cool":0},"PH6jeTGH01i7_7DxCMyeQA":{"text":"I was a bit skeptical of this place before I ate here, mainly because it's located in a st","useful":1,"cool":0},"kpizOqlDMQPtlae66xOYuw":{"text":"Pricey, greasy but good. Worth at least one trip. Don't know if I will return tho.  Aioli ","useful":0,"cool":0},"RjR679XeMyIx1kTPbJKZlg":{"text":"Overpriced soggy fries?! No temp on the burger?! Wow what passes for hipster food in New O","useful":2,"cool":1},"yW6mufbEa7Vcnr4PQtcrfA":{"text":"This place is it for me. \n\nI came for the burger, I stayed for the sides and the lamb.\n\nFi","useful":7,"cool":3},"FvLbXulTYbvbUHYmCefMOA":{"text":"Ok, I went back. I don't know what possessed me.. it must have been all that shopping I di","useful":4,"cool":2},"Xk-PPcyGV5SW3D8Ydqt2Xw":{"text":"One of the better burgers I have had, and definitely the best burger I have had outside of","useful":0,"cool":0},"XRzsgoJWgMerYrK6FNlOFw":{"text":"Not you everyday run of the mill type burger joint.  Company Burger is in a class all of i","useful":1,"cool":0},"0whSiDz2USjpTAFNqRtpCw":{"text":"Great burgers! The Company Burger is a wonderful All-American burger. The lamb burger is i","useful":1,"cool":1},"AMkGL7cd1GxoYOvbipkAgA":{"text":"I love this place! I normally don't even get a burger, just a couple of sides, but tonight","useful":1,"cool":0},"J-Kt2bfqXiasgfQdEFo5IA":{"text":"Highly overpriced! $15 for a fast food burger w/ fries & cup of water. I don't see what's ","useful":3,"cool":0},"dAxaXrPjTV0TcoC_HzFPsg":{"text":"Great Burger. Cheese is melted to gooey goodness. I enjoyed a fried egg on top.","useful":0,"cool":0},"XN5aCTDY22OnBm2722-nRQ":{"text":"Loving me some Company Burger! It seems like there are burger places popping up all over t","useful":3,"cool":1},"JKP9Aig6i5lz_A0Icm86vA":{"text":"The fried chicken sandwich was cooked to perfection, and the cheesy tots are a new favorit","useful":0,"cool":0},"V1wZWmEe832Du4WOc8W86Q":{"text":"I absolutely love the turkey burger. I like to get it dressed the way it comes or dressed ","useful":0,"cool":0},"yaZbsBhfT3xlBk3HVvTYmA":{"text":"Amazeballz each and every time! I love it! My father even loves it! I've honestly never ha","useful":0,"cool":0},"tlSYJOcYXkMxOzQjX4Wbow":{"text":"I'll admit, the only negative thing I can say about this place is that the prices are a li","useful":2,"cool":1},"WEzMJe7quLganmfCfLuFDg":{"text":"Delicious burgers!!! Got a single, done medium. Filled me up, just the right amount of jui","useful":0,"cool":1},"fyf82xB9wc6dxBfzdFNgHA":{"text":"Fantastic lamb burger as well as a \"corn dog\" made out of pork belly. Outstanding onion ri","useful":0,"cool":0},"L95OED8Nq_pIRQV50ln3xw":{"text":"Good god this place was phenomenal. I've been looking and looking for a good burger place ","useful":1,"cool":0},"u_HUaoBSVfwxuVSJYLdoCg":{"text":"Incredible food.  Only thing I don't like is they are so popular that there is not enough ","useful":0,"cool":0},"dmLDwSLmVTvgHiJiW-PlNw":{"text":"My wife and I came here for lunch because we heard it's one of the best burgers in New Orl","useful":1,"cool":0},"1MoSK9OTSJJdE90U8CURzg":{"text":"Amazing! Their house made mayo is to die for! Great food, great prices, easy going atmosph","useful":1,"cool":0},"FXSDlEuPfRPemNyOTE1PgA":{"text":"I love a great burger and these guys know how to do it!  I've enjoyed the burgers here a f","useful":2,"cool":1},"gol7mSn9JCRPYgIdPMHuWQ":{"text":"Overpriced. I spent almost 30 bucks on 2 average sized burgers (if not a little small), a ","useful":1,"cool":1},"EtAMkNhtIuFy-q2ztomvrw":{"text":"Firstly, girl with the poorly colored red hair who took our order was SUPER rude! It was o","useful":1,"cool":1},"OIMohqv6zRRaM313HCoD8A":{"text":"4/5 good stuff!\n\ni love a good burger. that honest meaty taste on some fresh bread with ju","useful":4,"cool":1},"r0tB_wkYd8pjAgpJ4KJqgw":{"text":"I'll say this the burger was good, but really basic. I guess that's what the business was ","useful":0,"cool":0},"pJfxgkgZNtnEY-CHUEoRqQ":{"text":"Really great burger. High quality meat and they go a great job of preparing the buns took.","useful":1,"cool":1},"5pV1dBBV4wKRMqZgVWU-PA":{"text":"That was a REALLY good burger!\n\nThe cheese melted perfectly, the medium, at most, meat was","useful":0,"cool":0},"32EF1-UKk5pGEUBORX8lmA":{"text":"I heard about this place through a few people and a cousin recommended it to my hubby and ","useful":0,"cool":0},"w6P_Noj4zqrEFI_sVlWMZQ":{"text":"The Company Burger and fresh cut fries took me back to my childhood. Excellent flavor in b","useful":0,"cool":0},"sTkGk_18_Sk9T1V-DBvxWg":{"text":"Favorite burger place in New Orleans. I love to get the Turkey Burger dressed like a singl","useful":0,"cool":0},"rs1suvp_-VrFgdheD8GbVg":{"text":"Pretty good burger place .. Even though they have a nice selection of different flavored m","useful":1,"cool":2},"ptrJJMRIIG7WEBWYqUUP6Q":{"text":"The Company Burger is all in all a decent place to grab a burger if you're in the mood for","useful":5,"cool":2},"_VTTyTr4LtX5ZQorPqrNtQ":{"text":"This place feels like a well-lit bar. Practically floor-to-ceiling windows surround the se","useful":0,"cool":0},"7CvlXxt87dcLZr4GETyVRA":{"text":"The day after Mardi Gras- Ash Wednesday. My agenda- Eat, Sleep, Eat, Repeat...\n\nI was crav","useful":1,"cool":0},"EDuaf-nN8bs0KbYUiiJbUQ":{"text":"For me, the first step to judging a hamburger is the meat-to-bun ratio.  My view is that t","useful":1,"cool":1},"kWbIqW1Xgj0iLwau0WvDcA":{"text":"Best burgers in Nola! Juicy fresh and lots of options. Friendly staff and quick service. A","useful":1,"cool":2},"-bahpiY-zuIfO-_B2RBN6A":{"text":"The burgers are always great! Sweet potato fries are amazing! My only complaint is that th","useful":0,"cool":0},"1cOzdh0deXqD0qLx_RpiUw":{"text":"I am not a huge fan of gourmet burgers, which is why I love The Company Burger. Their burg","useful":1,"cool":0},"IlSAsyXpUgGDY_wKWnFNCA":{"text":"Despite its convenience it isn't the City's best burger.  It's good enough but $24 for two","useful":0,"cool":0},"5-tgw0oQfVYB9foWvq4YVA":{"text":"Super casual...cafeteria style trays and no plates. Only can, bottles drinks Very plain de","useful":4,"cool":2},"nEEhPnb-omHKE5cvEPxdmQ":{"text":"Nice alternative flavor burger once you get over the fact you just paid $35 bucks for a ch","useful":0,"cool":0},"50b0xxto5wXHUdaCKGI5AA":{"text":"After the bright, brief meteor that was MVB burned out, I searched far and wide to satiate","useful":3,"cool":1},"w3LJsa1bROuTJhGVzni8TA":{"text":"Best burger in the city on Gambit for a reason! The burgers here are juicy and delicious, ","useful":2,"cool":1},"QldI2aCVkzh8EJm72N-txg":{"text":"Best burger ever!! Great customer service and very clean. Would def go back again. Had the","useful":1,"cool":1},"2k7EUxdMFm8isu4VXBLz6g":{"text":"This is hands down one of the best places to get a burger in New Orleans. From the perfect","useful":0,"cool":0},"8Z1M_jVw-Rvv9G2c6gio8w":{"text":"You want a $15 Wendy's burger?! You fucking got it, son. They turned trendy up to 11 in th","useful":4,"cool":0},"TMrZT9j872qm-sIzZdjBtQ":{"text":"Pretty good burger. Made my stomach hurt a LOT! It was also a little soggy and undercooked","useful":0,"cool":0},"-k3IuDlpTyBMqd9GSV5K6g":{"text":"Great American Cheeseburger, Plus you Have to get the Tots!","useful":0,"cool":0},"awJf-8o1qb805jwug6ct3w":{"text":"Fact: Sometimes when I've been traveling or just having a really tough week, I get this in","useful":15,"cool":6},"c__J4NynJFnERctY52ukfQ":{"text":"I used to be a Yo Mama's enthusiast, until I had Company Burger. This place is absolutely ","useful":2,"cool":2},"qucAlrhQqeB9oSRgr9c9Ag":{"text":"My boyfriend just had to take me to what he dubs \"DA Company\" lol. It is more of fast food","useful":0,"cool":0},"8SQ1_7fJHQMvIY-vKtxQPA":{"text":"The lamb burger... Wowowowow!!!! I was convinced thanks to the glowing review of the emplo","useful":2,"cool":1},"1GEYeMY03MxcJjejTiJP_A":{"text":"Get the Company Burger topped with bacon and a fried egg, a side of onion rings, and a can","useful":4,"cool":0},"PVX5T5oHM1S8mwRX4U1S4Q":{"text":"Tiny. Never cooked as directed. Overpriced. Dressed wrong. Gave them too many chances. Pay","useful":1,"cool":0},"cR-WnExa2SCbOgU0qBElZg":{"text":"What you think of Company Burger depends entirely on the type of burger you like. Personal","useful":0,"cool":0},"B3vyB_j6lpG4r57LTibU9Q":{"text":"I bow down to this burger joint. This IS as good as it gets. \n\nI never deviate from The Co","useful":1,"cool":1},"isTTJ2HFsGzmtEAlTaKGZg":{"text":"Came here for lunch yesterday and I'm pretty sure I'm the only person who has come to this","useful":8,"cool":6},"LOLCzjh4ThvKXdiw-1Wysg":{"text":"Great burger place in NOLA. The burgers are fresh and packed full of flavor. It does get c","useful":12,"cool":6},"0ToGhWmR79OLuSx3VSOeaA":{"text":"This burger...... Literally changed my life.\n\nMy trip to Company Burger starts innocently ","useful":1,"cool":0},"x-lIEwRIkUNd5j5m3OpcEg":{"text":"Without a doubt, the best burger in New Orleans.","useful":0,"cool":0},"AZ42caf7mRlxszLIB5pJQA":{"text":"Great location. Different choices. I usually get the lamb burger with sweet potato fries a","useful":0,"cool":0},"spo7mqCvF8qt3SMM3XSrjg":{"text":"Nothing to write home about. Burgers were OK. Very over priced. Fries, tots,etc are $3.50 ","useful":2,"cool":1},"xnztpGLkt1p-vLW--OcpBg":{"text":"hand's down, the BEST burger in new orleans.  the owner/chef has been there every time tha","useful":0,"cool":0},"Xmv9yNtYOYAiTEa3aOeUwQ":{"text":"Excellent burgers!!! While in NOLA we needed something to reset our palates after eating s","useful":1,"cool":0},"jY77iBltSnLe2F5KVQvHdQ":{"text":"This is my favorite burger place in New Orleans, and I've tried most of the others. Their ","useful":0,"cool":0},"wWegJYITCMFS6XrVsPq6FQ":{"text":"Had a group of 12 and some picky eaters. Everyone loved their food! Best tatter tots EVA! ","useful":0,"cool":0},"cu0r2hKhe-iMLVHJ2K4zcw":{"text":"This place rocks.  One of my top burger fixes in Nola and usually cited as one of the best","useful":0,"cool":0},"zwGGvicQeJrDy0VzwTsngw":{"text":"Company Burger \n\nEat the fresh burgers\nEnjoy the splendid company \nToast to the finest!","useful":1,"cool":0},"MC7vfrwclDs6hRTOWKxpTQ":{"text":"Usually not a burger fan but when someone mention The Company Burger for lunch, I'm in. A ","useful":1,"cool":1},"9LHzxaS5RwT07TkEDLt8Kw":{"text":"Visited New Orleans for the night and ate here for dinner. SO GOOD!!! I got the company bu","useful":0,"cool":0},"jr6kCBD-6mtUPr58fpT4FA":{"text":"Have been wanting to get here and see what everyone has been raving about. Burger was just","useful":1,"cool":0},"rD9a0oQSP0WTFfz29suMXg":{"text":"After a long flight this place hit the spot. The burgers are juicy and flavorful on a toas","useful":1,"cool":0},"rHD8pOV-fQCsEFvMb-q8gA":{"text":"This is my first time at The Company Burger after hearing a lot of great thing. It's defin","useful":1,"cool":0},"6BI22FOYrMjGIWUOJwdsMA":{"text":"Worst burger ever. Most of the fries had black rotten spotes in them. The onion rings were","useful":0,"cool":0},"fhuo8R2nPqWedazUsRgUWg":{"text":"Visited with coworkers. Had the Company burger with the Company fries. Enjoyed trying the ","useful":0,"cool":0},"w0NJ0wa7Ybr8ArV-o9dEkQ":{"text":"Come for the burgers but stay for the mayo bar. Good quality burgers and fries but it is o","useful":0,"cool":0},"mO6MtdWkgsNly8ayLhl2ew":{"text":"Definitely great hamburger the meat is fresh. Wonderful customer counter service. Will ret","useful":0,"cool":0},"T6PsNHxiTaAsmsdlPsD3yA":{"text":"My burger place. My favorite burger in the entire world. I love it. \n\nAll of the burgers a","useful":1,"cool":0},"t0xPXiYuUYE6tvyXqycs6g":{"text":"I love the burgers here. I love that they pickle their own pickles, and they make it sweet","useful":5,"cool":2},"ru5blEAxXo6rNW8v2oX4xA":{"text":"I have been to the Freret Street location a number of times and found that the food is alw","useful":1,"cool":0},"vybix6TuFaNaJt8cbsU2-g":{"text":"Company Burger is by far my favorite local burger joint. Meat, cheese, bread and butter pi","useful":0,"cool":0},"BXinxReVL7EbWTTd3_h6Ng":{"text":"Greasy Goodness.  It's really hard to come visit New Orleans and stay paleo so after a lot","useful":0,"cool":0},"kQHoazLf1nDgeQLCBam7_A":{"text":"Best burgers I've ever eaten! I also like the staff personal...they are all friendly and m","useful":0,"cool":0},"IwDga60FvrebWoQgIVvkuw":{"text":"The food here is delicious. Great burgers, shakes, & fries. The only problem is the price.","useful":2,"cool":0},"jXa5EYocNwfu9Gj23yYFFg":{"text":"I thought this place was cute! Good fast service and a pretty good burger too. It's also n","useful":0,"cool":0},"qzQQRsCzbo_lsR3jd7kCNg":{"text":"I welcome the addition of Company Burger to the burgeoning Freret St corridor.  They make ","useful":0,"cool":0},"E_wZyV8o3v-AqoT7jiOWPg":{"text":"I am not a big burger eater. However, this restaurant has turned burgers into something ma","useful":2,"cool":2},"_aKiu2xAmf1akp9FH6jfpw":{"text":"Wow, definitely one of my top 3 restaurant burgers of all time.  Service was very friendly","useful":0,"cool":0},"SJJhVhRhdvB4MI6WvI4i2g":{"text":"The burgers are great, but they offer very little in terms of vegetarian options.  My wife","useful":0,"cool":0},"vOylNmXUnAnZQdr1Nt0fPw":{"text":"It hasn't been around for very long but has quickly become one of the best places for burg","useful":0,"cool":0},"xwywiiuBqL3OFkUZw5wTVQ":{"text":"A good, well made hamburger is one of the most comforting food items you can eat. Never in","useful":8,"cool":6},"J2O6wr1suAKytDqVjzRf7A":{"text":"Let me be real for a minute. This is one of the three best burgers in the city of New Orle","useful":2,"cool":2},"nRtG6o1DuLl7UpIF2e-KCA":{"text":"My husband & I went with a friend. Our first time, she's been before. \nI had plain burger ","useful":0,"cool":0},"svTdXicd3kNN24U1A6n-Wg":{"text":"This is my favorite burger spot in NOLA. They use Creekstone Farms meat for the burgers, w","useful":1,"cool":0},"vt7KcHp2TaGfySoqz3dylA":{"text":"I was scrolling through old pictures and I came across this mouth-watering burger complete","useful":12,"cool":7},"74Gmkho5z3hKAzRoql1DsA":{"text":"Not impressed at all...it was a decent burger but for the price definitely not worth it. A","useful":0,"cool":0},"0BqFikSmuljC4xBqW11gJQ":{"text":"Having lived in Chicago for the past two years, I am kind of a snob about burgers now.\n\nTh","useful":2,"cool":1},"GBheERm7l9_X6iRMJ2_Jdg":{"text":"Excellent burger!  The patty is seasoned perfectly.  The brioche bun pairs well with quali","useful":0,"cool":0},"fMta9BZ_T4kGzwmycMtMXQ":{"text":"BEST BURGER ON EARTH! And thats not an understatement!  I mean from the bun to the last cr","useful":0,"cool":0},"V-gkCcNeLmSmcB6xy9OmLg":{"text":"The buzz on Freret just gets bigger and tastier now that burgers are on board!  Thankfully","useful":3,"cool":2},"UCOdKtcGE3SzG0p_IDaFVw":{"text":"Best. Burger. In. NOLA. No contest. I would eat here every day if I could. Never been disa","useful":0,"cool":0},"jMl4L88OL1ODyJjpKjyOew":{"text":"Company Burger, in my opinion so close and yet still not quite there.\nBurger, is simply av","useful":2,"cool":0},"q_JHHvkK2_KbrKjUaqYnGQ":{"text":"Burgers, tots, fries, onion rings and pickles all made there with a yummy mayo bar. Very r","useful":1,"cool":0},"JaJxfMJDIojQnR_zSaSBnw":{"text":"I tried their fried chicken sandwich and although it was really good and really big, it wa","useful":1,"cool":0},"h4PG0TM4YnZuONHBkDEjOg":{"text":"Wasn't impressed. Cheesy fries that cost $6.50 was overcookEd fries and two 1.25oz portion","useful":0,"cool":0},"qIpYgQhP96IroJpwaAj9BA":{"text":"There every week after soccer, hard to get away with a bill less than $20/person, but the ","useful":1,"cool":0},"YDjS-sgA2mSm1eVxk2MFng":{"text":"I really like this place.  The meat is soft and melt in your mouth.  I never know which ma","useful":1,"cool":1},"0zDvEkDJj04xPLY-IxOapQ":{"text":"So good. Great food and atmosphere. We came during a Saints game and had no problem gettin","useful":1,"cool":0},"xUfQ5MKif4zy1XMlyscxAg":{"text":"This used to be my favorite burger in New Orleans . Was looking forward to a company burge","useful":0,"cool":0},"d4ZWaNxvqkW76FcNK2i94g":{"text":"Food is pretty good but the service is not. Lack-luster at the forefront. Crunchy tater to","useful":0,"cool":0},"NcZS40ngNivLgryVeQj3YA":{"text":"Finally got to check out Company Burger after so many friends recommending it. I think it'","useful":2,"cool":1},"ke8Sg1a_8zknFzMApj7-EA":{"text":"Yum! Yum! Yum!  I had the Single and it was so delicious. I loved the crispy, buttery bun,","useful":1,"cool":1},"rf3Sy645WwLbhJTz6mtyWA":{"text":"This place lacks variety, but what they do they do very well. Particularly, the buns here ","useful":0,"cool":0},"B1zvEPa3S2Wsl0XIlzKXfA":{"text":"I must say that I went there in order to get my hangover cured. Well, they nailed it! Best","useful":0,"cool":0},"9hYmMNwx_u8YijztcrPv9g":{"text":"Freaking awesome burgers, makes all other burgers taste like crap. I have been searching f","useful":0,"cool":0},"j-ZEl39EXoCA_G3-gelKxw":{"text":"Wow! I never wrote a review here? And I'm a weekly regular. Well, let's start off service.","useful":5,"cool":4},"Fo0inCC9dbRaLjlnZx2oLg":{"text":"While I still wish they had other cheese options besides American I can understand the con","useful":6,"cool":4},"d5MliQd4Krb2n1jcwMzn2w":{"text":"A local up scale burger joint that serves alcohol and salads. My burger and salad were exc","useful":1,"cool":0},"3xU794c3zRd7AlQjsIXQ6A":{"text":"Seriously best burgers in the city. I had the single, my husband had the company burger wi","useful":1,"cool":0},"balNo_0kW_Y2lV-pSfAvkg":{"text":"I've only lived in New Orleans for 2 weeks and I've already been to Company Burger three t","useful":0,"cool":0},"7nwaHU3PVJbRgB2jxuDSvg":{"text":"I'm always in the mood for a great burger and since my city is more known for the other cu","useful":1,"cool":1},"bu5L-qpKBmqXRWoDN4T0vA":{"text":"If you like dry over-cooked burgers, then DO NOT come here.\n\n  At company burger you will ","useful":0,"cool":0},"er4odgZSaPzhczosm-JbLA":{"text":"Hands down the best burger I've ever had. The homemade sweet pickles and mayo bar are awes","useful":0,"cool":0},"C5dUoSyyA0Sy0lCNxIoNIA":{"text":"I had the turkey burger ($8) - First bite was sensational.  Salty, sweet, hot from the gri","useful":0,"cool":0},"K7dDQBVup6qtiezphR7tJQ":{"text":"I've been here a few times since they opened...mainly because it's in my neighborhood, but","useful":3,"cool":2},"CH-JzfOjDN4ttHgdNxHsRA":{"text":"Hands down the best burger in New Orleans, before this I was a Port of Call fan for years ","useful":0,"cool":0},"GRAnbXc-uJTYWKBahsiu3w":{"text":"If I am going to pay 15 bucks for a burger and fries then I expect a full pound burger wit","useful":0,"cool":0},"RvHYUiknyJcLYz1YJMIqVQ":{"text":"Best burger ever? Best burger ever, at least for casual places. Add the onion rings and I'","useful":0,"cool":0},"auP6_8o7TDHQhiN7Eqwj5g":{"text":"It's been a while since I've been, but when I did go it was an amazing burger.\n\nI think I ","useful":0,"cool":0},"2jOe6eW1e6iVbX3toPbNzA":{"text":"New Orleans heat was intense the day I visited, and the Banana Foster Milkshake was exactl","useful":1,"cool":0},"sJ6um_qR_vB2megcOVYcDA":{"text":"I vacillated between a 4 and 5 for this place. The company burger is one of the best beef ","useful":0,"cool":0},"JMdLmVdYe3wlpIKWlBo6iw":{"text":"Great burgers and onion rings, quick service from a friendly staff. Nice place will defini","useful":1,"cool":0},"vSpIcbMUyHNruAr1m5jPPw":{"text":"Sooooo I wanted a burger....thought of CB....& headed there. This was my third time here. ","useful":0,"cool":0},"sEUQG0zQFzkST_tToDfvYQ":{"text":"I love coming here! The menu is simple but the food is amazing! This time around, I got th","useful":2,"cool":0},"9OZeitu0dDJ9B-iAxxu5Pg":{"text":"3 stars for the food but -1 star for the price!  I had the Company Burger, which was a dec","useful":4,"cool":3},"U30euG2_9QYlZCXzsnDjEA":{"text":"Who closes between 3pm and 5pm on Saturday and Sunday.  Good thing their are other eaterie","useful":0,"cool":0},"sw5mfMxGm_476yqDZgcarw":{"text":"I love it. I live in the neighborhood and can walk there. The burger is great. I've brough","useful":0,"cool":0},"-1sKgoT0cpN0Oa13tATeTg":{"text":"Company burger has the bigger size hamburger style with high quality ingredients, limited ","useful":0,"cool":0},"nIAUXRzmBnvdrcHYPNmMGw":{"text":"I'll admit I didn't expect to like this place when I first heard about how small the menu ","useful":3,"cool":3},"7Fk6V_0vvtM-__QrSDPBSA":{"text":"Just got in town and family suggested we go here for a burger.  The staff was very friendl","useful":0,"cool":0},"3C0iIjv4uVPLG83oz3O9HA":{"text":"Damn good burger. Juicy double Patty and cheese. To much salt on this visit but it's a qua","useful":1,"cool":0},"hlYfNxKz1Pov2ojRlptqMw":{"text":"The burgers are great, and service too. Burgers are not so big so I recommend the fries al","useful":0,"cool":0},"um-Z2kF2BP8zMcRlwutWrg":{"text":"So I went twice in 3 days, and it's on.  I had the BLT second go.  It reminds me of Robert","useful":6,"cool":4},"2y31xcXrEp_iPUWHpAbEpw":{"text":"Really just the best burgers in New Orleans.   Take it to the next level and add grilled o","useful":0,"cool":0},"AYBLDIfamWp_Hhk-9tpMeg":{"text":"I gave Company Burger another chance or two and found many things to like.  The burgers ar","useful":1,"cool":0},"nKtTxXKKhlsI_KP_ygMthA":{"text":"So happy to find a great turkey burger near my neighborhood. Fries were amazing too. I was","useful":0,"cool":0},"BF-S2aNELH3y3f56GJ597w":{"text":"This was one of the best burgers I've had in a long time. It was really juicy, cooked perf","useful":2,"cool":2},"ZWu2p0w-OSq9XpFdL2ohQw":{"text":"When done right this is the best burger joint in the city bar none. They have added some o","useful":3,"cool":3},"0OZ9Q-tc0UN-cAuW-Qou3g":{"text":"MAYO CHOICES!!!!  Yes, I tried every single one. The garlic one was the winner.  \n\nThe lis","useful":0,"cool":0},"XMSgEWdB3NPk5UvWt9dorg":{"text":"It's hard eating at a burger place without getting the comparison of 5 guys or In n out. W","useful":2,"cool":2},"D2pG20Bje8-YfLRW2VMJqA":{"text":"burger was good, but the cocktails were incredible. I just can't get over the fact that th","useful":0,"cool":0},"yOh4Du4NIMRqwTSa-6PRJg":{"text":"This was one of the best burgers I think I've ever had. \n\nI ordered The Company Burger and","useful":1,"cool":1},"FlmSPu70BhtDWV0MZG4KAQ":{"text":"Heads up here.  This is not a Port of Call burger.  It's not a meat-centered burger experi","useful":7,"cool":3},"dGxN3sn1I0kQ4Xb6-PfwdA":{"text":"This is one of my favorite burgers in New Orleans! I love the mayo bar-- in particular the","useful":0,"cool":0},"olINj2bt2iYoy7wq-jXyGA":{"text":"So apparently today is #NationalBurgerDay...(Its always #National_________Day on social me","useful":1,"cool":1},"d6VWuKhNdddDRfk4YLsURw":{"text":"I live in the neighborhood, and I think I've decided that the Company single, served as it","useful":1,"cool":1},"ogQxxmdfUp5y2nBoglbLMA":{"text":"I really enjoyed the simplicity of their burger,  which was delicious. Loved the pickles a","useful":0,"cool":0},"58TfJBOdv-8xobpdx_BOSg":{"text":"Their burgers hit the spot for our lunch today. They were juicy and slightly on the greasy","useful":1,"cool":1},"rnf86v8Fa5lPUyenQ8WfMQ":{"text":"Best burger ever.  Really.  The flavor of beef. The juicy texture of two meat patties meet","useful":0,"cool":0},"4GAyfBUR46fdSXfMXp3Hkg":{"text":"Huge, greasy burgers! Great cheese fries. Good taps selection. Don't pass up this place. I","useful":0,"cool":0},"d5El8EC79eJyfQ2Tl5c3ZA":{"text":"Still haven't been back since. Y'all still ain't getting my money. Yeah I know, the owners","useful":1,"cool":0},"_ux2WBQfOr2t8sdJvasZnQ":{"text":"Love this place- friendly service in a cute, but no frills place on Freret St. Burgers wer","useful":1,"cool":1},"EAm5ZK0g_V63hLcZZRrY4g":{"text":"Excellent burger, but the customer service here is even better! Everyone greets you and ev","useful":1,"cool":0},"vQqDNoddd3kwSL29M3_Ikw":{"text":"There is no excuse for you to try this place out at least once if you're on Freret Street ","useful":6,"cool":4},"lCmDcFlRzwiYJdmBoMTibQ":{"text":"Always a good choice. Great purple onion rings. Delicious juicy burger. Lots of sauces for","useful":0,"cool":0},"SeY_vikW0yC8quXSUz_k8Q":{"text":"Burger was salty. Patty not cooked enough. Parking lot full but restaurant was empty. Serv","useful":0,"cool":0},"yTZCp4DLEAdz_Kmj180jNQ":{"text":"Clean place but food tastes a bit off. Not in the sense of being out of date but more of i","useful":0,"cool":0},"h8BoDrqc6PfPM1RmrLZhog":{"text":"Stopped here with my family during a brief stop in NOLA. Bottom line up front: great food,","useful":2,"cool":1},"XdDQ21FafdKJ81xwuc2s-w":{"text":"Great local burger restaurant that reminded me a bit of 5 Guys and some of the other bette","useful":6,"cool":7},"Hiiq1Gf-9KVzvenDMKvW4Q":{"text":"Not sure why I've never rated Company. Probably because I take it as a given: this is the ","useful":2,"cool":0},"LffILxhGfbf_Zo-P1hhr5w":{"text":"The food here isn't very good. Way over-hyped and over-priced which may make it taste wors","useful":1,"cool":0},"RLrJTFWlC0PY6-uuHyMk4Q":{"text":"I love burgers...I am not ashamed to admit it.\n\nI went to Company Burger for lunch...and l","useful":2,"cool":0},"vAsUJ8C8nZNROqdUxlfCBg":{"text":"As good as the food can be here, for some reason, the aftermath is an absolute nightmare. ","useful":2,"cool":1},"DNGxBChQTs3ZPmDV3_BdGg":{"text":"I drove significantly out of my way to get a burger here at 3:30 in the afternoon.  i chec","useful":5,"cool":2},"i51Dl9U0Qm-3VNoDQK2Brw":{"text":"Hey! Open on Tuesdays! Time to make a foodie call!\n\nUgh, why do you need more words Yelp?","useful":6,"cool":5},"uMTaC2OdLNW9lotuAsFbaQ":{"text":"I will probably edit this review in the future, but for now, I am really not impressed.  L","useful":6,"cool":1},"wgt7JhR7juQsA9HVyR97nA":{"text":"Great burger joint. Many people will say port of call is their favorite, but I've found CO","useful":0,"cool":2},"YFCX1DUfesTm92wMwZ-FYg":{"text":"I left a couple of suitcase behind their building and they looted them and stole my clothe","useful":0,"cool":0},"2q_Pl5KAowYVyiTYFcQJIQ":{"text":"One of the few five star burger experiences in New Orleans. Perfect sunny side up egg brin","useful":0,"cool":0},"xl8Vwg17A1H3vZ5rVxSnSg":{"text":"The turkey burger was amazing I had it dressed as a regular burger with the arugula and to","useful":2,"cool":1},"9hbow5SGgbF6CKQM79klTQ":{"text":"The burger joints are a-plenty in New Orleans, from Bud's Broiler to the queued-up Port-of","useful":14,"cool":9},"1mRIJV6beV1mnLTyPBgXmQ":{"text":"Company burger is consistent. They're burgers but the spot and everything is delicious. Th","useful":2,"cool":2},"ehBf-rxDm9iPnUWIWmWmnA":{"text":"Overpriced and nothing special. They told me they don\"t give refunds if you reject the foo","useful":0,"cool":0},"JtaNfc72FbwJKxbQw4j0lA":{"text":"Pretty nice burguh, bun s tier with the very high quality ingredients in the entirety of t","useful":0,"cool":0},"C-et6AIUoMQfETgxWog3Bw":{"text":"Good burgers.  My kids can be noisy and crazy.  Nobody cares.  Cheese fries were slamming!","useful":0,"cool":0},"n7QEVVop26mB0KwqnyGQoQ":{"text":"The burgers had a great flat top crust on them and good flavor, only issue is that no one ","useful":1,"cool":0},"vmCov5UNNx2KkKRa_njlnQ":{"text":"The burger was average and the onion rings were greasy and were losing all their batter, t","useful":1,"cool":0},"DONioKlJEGsA-jrFDaln9Q":{"text":"\"WE COOK ALL OUR BURGERS MEDIUM, IS THAT OK?\"\nThat disclaimer should've been a flag that C","useful":6,"cool":1},"-LLMg4yrtOOMG2ztsB6rdQ":{"text":"yay another great burger place! I ordered the \"THE SINGLE\" which\nComes with bread & butter","useful":2,"cool":1},"hWkYPd9x8E7ewYuAgC4TFg":{"text":"Dear Ramsey,\n\nI drove seven hours from Atlanta straight to Company Burger this past weeken","useful":2,"cool":1},"Uo09V0sk84noNhA01XsUYA":{"text":"I love a good burger. Company Burger has a good burger.\n\nI love a strong Bloody Mary. Comp","useful":5,"cool":4},"p71kjs2SPGieP6NehJcWNg":{"text":"I heard they were halal, so I went to town on their Company Burger. I was worried it might","useful":1,"cool":1},"3iwERzZ8q4ge96xTpvIsHw":{"text":"The CB delivers on its promise - a delicious, perfectly executed burger. The atmosphere is","useful":0,"cool":0},"UWrdxMe89tLcgXQjflUw2w":{"text":"Don't waste your time at this Bud's Broiler wannabe at 3 times the price. We decided to tr","useful":0,"cool":0},"oatVo4aGwHwF6j61rZqLog":{"text":"I'm sure you've heard many people rave about this place. I sure did. In fact, when I first","useful":1,"cool":0},"SxzPA89nj01yfoLGaRjYnw":{"text":"I really have to stop delaying my reviews. I ate here a while ago and while I don't rememb","useful":2,"cool":2},"RLzWaZjzFrLENjwCiEQ5Qw":{"text":"The falafel burger was so amazing the fries were the right amount of crispy & salt, they a","useful":1,"cool":0},"H3YIg3JujCcnZwWuO7QX-Q":{"text":"Wasn't in the mood to cook or do dishes, so my boyfriend and I gave this place a try. It's","useful":3,"cool":0},"ubWKJoxXKv1tpJnCnSnXcQ":{"text":"When it hit the scene a few years ago it immediately became a quiet super star in the then","useful":3,"cool":3},"acPhPIyIhebw6PTl7Ulq6A":{"text":"Friendly people, laid back ambiance, decent food.\n\nThe burgers here are good and juicy.  I","useful":4,"cool":2},"wme9y-NYYG8O9uM-0wX4Og":{"text":"Very good burger, loved the choc shake .. no sweet tea unless you add simple syrup, kinda ","useful":0,"cool":0},"qw3x-dd0r_SZcWDxlTHEwA":{"text":"Fantastic burgers! This place was perfect for our family of ten who couldn't find anywhere","useful":1,"cool":1},"Xbra9y9hBcYVkR9hkZwn7g":{"text":"Burgers are made hot and fresh. The workers are friendly. Its a nice place to grab a bite ","useful":3,"cool":3},"bJ_KfAsN6sDLrem98wC4xw":{"text":"DELICIOUS  The employee's are amazing and the burgers  are out of this world! \nBig fan of ","useful":0,"cool":0},"1cO19u0VrOu1NIEC30D97w":{"text":"A little on the pricey side but the burger was so juicy and well prepared with the fixings","useful":1,"cool":0},"x_Blm-XNz4Xplzdd6GOYCA":{"text":"I paid $25 for a shake, a lamb burger and cheese fries and absolutely none of them were st","useful":0,"cool":0},"P02me7vS4N5JAhA9iaEnCQ":{"text":"If you are looking for a nice tropical oasis in the heart of the city.... this is your pla","useful":2,"cool":0},"wjPmOkLT_6bmJEvts4qq4Q":{"text":"My husband & i both ordered The Single burger. I got a side of fries and a soda. He got a ","useful":1,"cool":1},"49ZpNgj7XQeHM5Iy5usk5w":{"text":"The food is entirely toooo salty. The turkey tasted like a sausage patty. The chicken tast","useful":0,"cool":0},"6EiXftI3UxuDKu5UsCXKKw":{"text":"Possibly the greatest burger I've ever had, quick tip...add the chipotle mayo on the compa","useful":0,"cool":0},"9Hs1IazSqq9_jikJPMLRwA":{"text":"One of my absolute favorite burger spots, probably one of my favorite restaurants in New O","useful":4,"cool":4},"7gamKFBveQ1-jcVvEe0rrg":{"text":"If you like a burger with meat, cheese and bread- no lettuce tomatoes or sauces, this plac","useful":10,"cool":5},"JZsisMLR0vqaoMCBYFORmQ":{"text":"Best Burger I've ever had. I got the lamb burger. Thick, Juicy, Tasty, Mayo bar","useful":0,"cool":0},"n4bJVyKnse9QEXD6aWK5zA":{"text":"Such a delicious and very rich burger. Definitely not cheap, but just don't come here if y","useful":1,"cool":1},"88h8PhPhVek4nABQUyqwwA":{"text":"The service was great! Very nice employees. Omg the fried chicken sandwich is TOP tier. So","useful":0,"cool":0},"MQCqrC3fdI08z4BcgfsOTA":{"text":"Just imagine...\n\nNot one, but two perfectly-cooked patties neatly (or not so neatly) stack","useful":2,"cool":2},"CwMOjn4DPO3cMJFniNqfWQ":{"text":"If you want 'fast food' that's local and not fast food, this is a good place!  My friend a","useful":1,"cool":1},"TGVLWHO7Oxf14iR76GLveQ":{"text":"The ole lady and I came here about a week ago...  The last time I was here was shortly aft","useful":4,"cool":3},"eEqWXMwwlN0bidE3uXMEeQ":{"text":"Omg haven't been here in awhile!!! This is my husband and my favorite burger spot hands do","useful":1,"cool":0},"Ou6v5g6D6S5mnh5IDzxKzw":{"text":"I noticed this place is really popular hence all the reviews and the massive crowd that is","useful":9,"cool":4},"3vPZjK7njsT5vCn51ttDUA":{"text":"I had the special, it was awesome!  So were the onion rings, and the sauces!!!  i had a co","useful":2,"cool":0},"-hjVEpXJH00ps8fbhmP-jw":{"text":"The burgers are really good, and the fried/tots/rinds/onion rings are all solid sides to a","useful":1,"cool":0},"WjgrlHXomcUhBjJ4FOdZAg":{"text":"Company Burger is definitely one of my favorite places to eat Uptown. Ironically, my favor","useful":0,"cool":0},"XCbm2tpVp1iMlSfEEo64Ig":{"text":"In my opinion, if you aren't going for a turkey burger you should get the company burger. ","useful":1,"cool":1},"0g1tK20-9IWv_iW9sGpUyA":{"text":"Got the company burger and fries to go. Called in my order. The service was super friendly","useful":0,"cool":0},"Q4-GP8K0ATW9V_Xbc54oIg":{"text":"I LOVE a good company burger . It is always such a treat when somebody says lets go to com","useful":0,"cool":0},"5ctoYHYr5VQNZNaAqgmpPQ":{"text":"The burgers were great. We came in after a double header of baseball games. It was a first","useful":0,"cool":0},"TUsLBreYVY9RQt4N44-FQg":{"text":"Unfortunately while I was waiting for my food yesterday I saw several people handling my o","useful":1,"cool":0},"WSkLoYV__Ik6RpGYipfABg":{"text":"I googled top 10 burgers in New Orleans. This place came up a few times....... The reviews","useful":6,"cool":0},"wD8WYo0Y0jA8PekUBqTPVA":{"text":"A patty of mediocrity inside of oa bun of pretension. My wife and I ordered two burgers an","useful":15,"cool":7},"jrnHN0E3np_mT9nbd1mV1w":{"text":"I gave up early on Lent. I was like....a month is good enough. Time for a burger. Company ","useful":4,"cool":3},"rxzAAIPez6XFd0McGdbYmQ":{"text":"If you're looking for a satisfying burger in nola that isn't too fancy but also not fast f","useful":0,"cool":0},"zPwUnRAtFm_n_gxz-qERVw":{"text":"Great burgers, onion rings and sweet potato waffle fries. Sucks that they use American che","useful":0,"cool":0},"5p8ojhd5y9QUjSt4HW7S1w":{"text":"While other restaurants are dropping the ball on quality and service during this time of t","useful":0,"cool":0},"BOGYRoSufTTOw7npY2DYNA":{"text":"Ordered a grilled cheese and quickly regretted it. If I had known it would be two of the t","useful":0,"cool":0},"_vPAoyl9X0SNDXR8rwUZoA":{"text":"This was my 2nd time eating at The Company Burger.. my feelings are the same. Just ok,grea","useful":0,"cool":0},"OM5tuLdwO2BvU9dEqlAl-g":{"text":"I love these burgers and onion rings. A little spendy but a great treat when your feeling ","useful":0,"cool":0},"XfzYc9ZSRAgrpY73BaqM6w":{"text":"Looking to cure a hangover? Need to fill your seemingly endless-pit of a stomach? Must cur","useful":1,"cool":0},"hZpR5TcKUMgdA0OwcvzNOA":{"text":"Great vibes, and great food!  Burgers were out of this world delicious!  The sides were gr","useful":1,"cool":4},"Jpt-6Ekr3aJ1w9OBh38Sxw":{"text":"Seriously high quality burgers!!! I always get their fried chicken sandwich and let me tel","useful":1,"cool":0},"ogpLrKD7FTe0KqLw5YsIcw":{"text":"Burger was good, and I loved the mayo bar. The fries were overcooked and hard. Be aware th","useful":0,"cool":0},"bJ93KcuArpQe9kV20UFdRw":{"text":"The burger was good, but I got some cheese fries and they barely had a snack of cheese on ","useful":0,"cool":0},"DXh5f1FpPSNvYp_W3SO9xA":{"text":"I'm officially over this place. The burger itself is fine, albeit overpriced....BUT you ca","useful":0,"cool":0},"nd_w96qBl8-QO8DyNg5eWA":{"text":"So good!!!!! It's really rare when my whole family is happy!  Excellent cookies and cream ","useful":1,"cool":1},"hskeBPLIf7rhWa2xB_iOeA":{"text":"Never disappoints!! The company burger in the best burger in the city. Also their fried ch","useful":1,"cool":2},"R3Ack3lB02deUEI6RMWDMA":{"text":"Very salty burgers. Good but not great. The sides were pretty middling as well -- at least","useful":2,"cool":0},"PtE-mp9eIyRQAi3Xk-pBWg":{"text":"I can tell this is a great place but I felt a little disappointed leaving. When I got the ","useful":0,"cool":0},"JebLhYpWz35jVP0YVwcI4Q":{"text":"It seems like the prices must have come down a bit compared to some earlier reviews. The d","useful":8,"cool":4},"tSLnRyXC9hz9XXh1rCRNyQ":{"text":"I love simple food. I love meat. I am quite adventurous and will try most things once. My ","useful":12,"cool":11},"j3FkVpkPGZDKL2tbNK8eSg":{"text":"The Company Burger is one of the top 2 best burger joints in New Orleans. When you first w","useful":0,"cool":0},"pEGb2XMS1PBsjGUEe0Hh7w":{"text":"The Company Burger is a bit overpriced but for good reason. The location is great, and the","useful":0,"cool":0},"HirtWhJrJjXK-WtzdrXEww":{"text":"I think this was the second time I ended up coming here because of the high ratings. I wan","useful":1,"cool":0},"WcpVjT3GD_LS5mfSU9gdQQ":{"text":"Company burger is an awesome restaurant with awesome food. Their service is fast and reaso","useful":0,"cool":0},"Jnoq_rjKTEGk2gOMHfJXhQ":{"text":"The Company Burger did not disappoint...in fact, I was totally delighted. We ordered takeo","useful":0,"cool":0},"cJkjlc1B4ebrhEHr7TlQMQ":{"text":"My fav burger in NOLA. Nothin lean about it, but it's a delicious combo of cheese and meat","useful":0,"cool":0},"_yZ8l0BtOyK9dyUOXTJOXQ":{"text":"Pretty good burger, pretty clean place, and pretty nice workers. A step above places like ","useful":0,"cool":0},"ld180PrMcIZOY7tL1QXjyg":{"text":"When you are tired of southern cuisine, come in here. They have a burger order form.\nPick ","useful":1,"cool":0},"KOxblWdudRA2wCw6mxGLfg":{"text":"Really friendly staff, and good food. Pretty expensive for a hamburger. The bad is that no","useful":1,"cool":0},"cP67TaWVunNEdDz_HcH94g":{"text":"One of my favorite burger spots in the city. The place is clean and the staff is friendly.","useful":8,"cool":7},"w-RBf9O9-168yzkog2zTxA":{"text":"After the Shamrock Run, my husband was hungry, so I searched for a close by burger joint. ","useful":0,"cool":0},"-zm6geIOWijXXf79uupRCQ":{"text":"When Company Burger closed due to COVID-19 in March, I was heartbroken. We visit about onc","useful":1,"cool":2},"eW5IicRjNpZ_JsoCB7rMZQ":{"text":"The first time I came here (September 2012) they were out of fries, gasp!!!  Luckily I tho","useful":2,"cool":2},"zu1fhQuvppRhLajunR3bNg":{"text":"LOVE this burger! Just all around an awesome burger. Also get no bun and easily have a glu","useful":0,"cool":0},"eE6zOXcw3C9X_lMQcqjaKw":{"text":"This use to be our go to spot, haven't been in awhile,  so we decided to patronize. Becaus","useful":2,"cool":1},"59wdXeHy_Xuq6DUSlzAyfA":{"text":"While this burger place is good, I would expect more for their prices. The first time I we","useful":0,"cool":0},"c1zUYEtEGKSWxQrebFRy1g":{"text":"Awesome burgers and fries. I has the single Company Burger with cheese. Most people around","useful":1,"cool":1},"l6tK5pUJAjaGqefTM9PpIA":{"text":"Great spot for comfort food! I got the single, fries, and chocolate shake - all amazing. M","useful":0,"cool":0},"NqVeFXDVvEeIGjjRmE7xBQ":{"text":"This place NEEDS GLOVES . No one wears gloves while cooking & prepping the food, checking ","useful":2,"cool":0},"_esCE8nuP-_9Yj3Sgi777A":{"text":"When we pulled up to this joint. One of the cooks appeared to be either taking a break or ","useful":8,"cool":5},"RwFfmDToFKRazKXI9dIs7A":{"text":"Good spot for burgers! I usually get the signature company burger and add a fried egg, and","useful":0,"cool":0},"cH2Aa_zLZldR93b5h2JpGg":{"text":"USE GLOVES WHEN YOU'RE HANDLING MY FOOD GUYS!  I love the company burger but I observed du","useful":1,"cool":0},"TzPISYcR-B5HfJKCuUUc1w":{"text":"Yep. Considering David and I stop in here once a month and it's one of our favorite places","useful":8,"cool":5},"WKHJxZpR4qTvJwbBar2b1Q":{"text":"My first time here. Safe COVID practices (9/21).. Friendly person taking the order. I'm ki","useful":2,"cool":0},"cbYBfe4hQJ-sH6GH1VXHKg":{"text":"It is far from \"the best burger\". It is much better than fast food if you are in a hurry b","useful":0,"cool":0},"_juaQYt55Bxk0HwUb65ImA":{"text":"Was searching Friday night for somewhere to get a quick bite. Decided to try out this plac","useful":3,"cool":5},"lAQPHq9HCm4Ds0IEZVRIqQ":{"text":"I like a good burger and this place definitely hits the spot. I've only only been to this ","useful":1,"cool":1},"_kIUKkjBieA_LMDmEysAPA":{"text":"Called and spoke with them. They said it is not Halal since they use Bacon grease. They do","useful":1,"cool":0},"TS9Og_TYX0IsMyaeE7_wKw":{"text":"Company Burger is sooooo good. I live near the uptown location which means I go a little m","useful":3,"cool":2},"jXuV_UTU7oSSEaDEwU2R8g":{"text":"I came on a Tuesday night. It was pretty empty which was great - no line. The music was ab","useful":0,"cool":0},"SoGWACDcealCLsCNaRoW-Q":{"text":"The big burger boom has brought a bolus of burger beauties.  This booming business brings ","useful":2,"cool":0},"yu0mVLZouIeQ1QXjSArYVQ":{"text":"So delicious! The falafel burger was so good and I was really excited to have a filling an","useful":0,"cool":0},"leUPHlvsnkeyhvebCt67lg":{"text":"Company Burger - where do I start.  Well, first off, the burgers are good and live up to t","useful":0,"cool":0},"PZF2IPEEgPnUK8vL6A4oiw":{"text":"I tend to love eating visit this location for the very thick and flavorful shakes. Their b","useful":2,"cool":1},"LpuL-WMGFB9QPr2BAtMhnw":{"text":"I had the chicken sandwich and a friend had a burger. We decided to cut each in half so we","useful":0,"cool":0},"EEHkwLHWRx1gyu8bdoWO4g":{"text":"This is my favorite fast food burger in NOLA and they have a great beer selection at the d","useful":0,"cool":0},"PteOlrB4rhYUohN0ovBt5Q":{"text":"Atmosphere is great, and the food is even better. I have been here a few times and recomme","useful":5,"cool":3},"FxIwew4KT9fuPxAx2mFqkA":{"text":"Their burgers are sooo good! I love the mayo bar and all the options they give you. I usua","useful":0,"cool":0},"dvWFxhNdfEoijZP-l3bEjA":{"text":"I returned to Company Burger this weekend and I'm SO glad I did.  Ok, I get the hype now! ","useful":8,"cool":5},"jHPX-KwV5E4e0eYnFHMw1Q":{"text":"Definitely one of my top three favorite burgers in New Orleans. While I've had bites of th","useful":6,"cool":2},"cfoK9xPLGpNaC51C---hzQ":{"text":"My favorite burger in the world and that is all I have to say. Get the classc cheeseburger","useful":0,"cool":0},"hx7aNXpoXnfONaPddXebpA":{"text":"I love company burger . They pickles are the best . It's like the perfect combo or crunch,","useful":0,"cool":0},"6lCKGa3o8_85uoJQ3dYtHQ":{"text":"I'm always on a look out for a really good sandwich and this one is definitely one of the ","useful":0,"cool":0},"b3kbUidRo9ic3jvirEXNYg":{"text":"Not sure if this is a NO thing, but no one in the kitchen uses gloves.\nWhen I saw one of t","useful":3,"cool":0},"NZdi2CA1GSy3Dvr6DIXOzQ":{"text":"PASSÉ CONCEPT IN A VERY 2009 ANTISEPTIC & hackneyed, no-frills, cavernous space. There are","useful":13,"cool":6},"JZqCPwQD74BronCTqK-1BQ":{"text":"Burger is pretty average. It was good, just nothing to write home about. Fries and tots we","useful":1,"cool":0},"2oTWFlEIkY-03uiZYj3-mg":{"text":"Nope.... hangover food at best. Cheap meat, not good quality all around. Way too expensive","useful":0,"cool":0},"v6hQaIACS5-DuwzzA8tX6g":{"text":"We had the Turkey Burger a single party company burger with sweet potato fries and tater t","useful":1,"cool":0},"oIEFgwMfNrCPwn4QRy7Xqg":{"text":"Call me crazy but yes I'll drive to Nola when I crave a juicy burger  and this is the plac","useful":1,"cool":1},"3_hTK3yiUkca3YsvN5h1tQ":{"text":"This place is in a cool area. We walked around after eating. I didn't realize it was kind ","useful":1,"cool":0},"lSBHzFk5uc72kc21_3qPHQ":{"text":"The Company Burger is OPEN for takeout! I was able to easily order and pay from their webs","useful":2,"cool":1},"yUfLlB5HiG2FSCyqmPS7Vg":{"text":"Being gluten free, I didn't expect them to have many options for me. When I asked for a si","useful":3,"cool":2},"m54HGXUGaGe9HuDDnV1fNA":{"text":"I came here after reading the article in Thrillist which deemed this one of the top 33 bur","useful":1,"cool":2},"IWfmCP2IWX8IfMMDc8lWrQ":{"text":"The cashier was super nice, place was clean including the bathroom. The food was just alri","useful":0,"cool":0},"mPI_W3N3ObQbaPM88Gnbew":{"text":"I'm so torn. I love love loved the Company Burger downtown and did not know of the Freret ","useful":4,"cool":0},"W_AGfcXYowORkIFMl8iWzQ":{"text":"These burgers taste like amazing fast food burgers to me. Greasy, cheesy delicious perfect","useful":1,"cool":0},"cZsRLy9TTDqhMKzSGRhIHA":{"text":"Their food is awesome, but they're prices are awful. The burger is perfectly-cooked and we","useful":0,"cool":0},"Nj0NFx5zNccEk2xvddd7Zw":{"text":"5 Stars for the shakes and fries, but 4 for their famous mayo bar and burgers! \n\nI came he","useful":4,"cool":2},"dmsy_gDpq9JXAkey4lbRWA":{"text":"pretty good burgers. i got the lamb burger and a peanut butter milkshake. shake was good n","useful":0,"cool":0},"aoBF1FJ1aFBnNll7R_Gtzg":{"text":"Seriously love this place. The reviews speak for themselves. Delicious burgers (their buns","useful":1,"cool":0},"6ZnxjKBb5LiXnPYCiKVAVw":{"text":"I LOVE company burger. Yes, it's a high end \"fast food\" type burger somewhere between 5 gu","useful":2,"cool":0},"zSJjRoRDZruj1YJjPNjskg":{"text":"There nothing better than a delicious juicy hamburger ! Then add  crispy onions or some fr","useful":1,"cool":0},"o9zdmvqsPBax6fkyoBC6mA":{"text":"A highlight of Company Burger was their buns- fluffy, brioche-esque, buttery. Their new on","useful":1,"cool":0},"CW2Zb6kzgiJnXe7sHCwXag":{"text":"I am a fan, I am impressed. This was a nice break from the New Orleans type food (that I l","useful":3,"cool":1},"_B3seOiXyb5D1kJlB4FTVw":{"text":"Three stars may be a bit harsh, but disappointment will do that to you.  Being somewhat a ","useful":1,"cool":0},"DpCcUCymiep_y-GxMuJOBA":{"text":"I was pleasantly surprised coming here. The lamb burger was made in a very succulent, and ","useful":1,"cool":0},"_oc4saUdV6JH82dQT_WxcA":{"text":"My coworker has been wanting a burger from The Company Burger for years, apparently. So, f","useful":5,"cool":2},"tuSjW5rviX5tFDFStSxcaQ":{"text":"Really good burger joint with reasonable prices. I ordered the double & thought it was goi","useful":3,"cool":2},"Lf-xEZ9tqWtudXEE6Kc6Yw":{"text":"The first time I went to this restaurant I walked out feeling like I had quite possibly ha","useful":1,"cool":1},"VADjebwYvpnPsGhlynM52A":{"text":"Food is still on point just like I remembered the last time!\n\nThis time I got a double tur","useful":1,"cool":0},"3TURNbgdA0QAl73eICcaAg":{"text":"Of course after I move out of the Freret neighborhood, that area becomes really fun.  The ","useful":2,"cool":1},"NdTRwTFoDG7nK-NB_RQilA":{"text":"Solid burgers, fries are great, onion rings were decent. If you want a burger, and I mean ","useful":2,"cool":1},"D-QYhgwfHXOpzm3Z_dLNng":{"text":"Love the food but the Long long wait to get knives & mayo at the far end of the restaurant","useful":3,"cool":0}}