{"j-iZIzsNF2QRxRAm2XfOIA":{"text":"Idk if the ownership of this place has changed but the food and the service def have for t","useful":0,"cool":0},"gLotwfHmyP1rAEh3d__eCQ":{"text":"Small take out style restaurant. Regular Italian pie menu. Service was excellent and food ","useful":0,"cool":0},"PF9tiVJixf7ZpclG8Sd6Kg":{"text":"Poor portion sizes for price. Slow service and greasy. I do not recommend this place to an","useful":0,"cool":0},"jTIAUg2DChBNXnCqbo673g":{"text":"I really like this franchise. Great recipes that don't seem to change when you go to diffe","useful":2,"cool":0},"2XMQeiECPYjOM-n7bMeZPg":{"text":"1st of all this location is nothing short of a take out restaurant.  They have a few table","useful":0,"cool":0},"AwppXLqycYp0_rZ3ChHELw":{"text":"The food is great but delivery needs work. Ordered lunch yesterday at 11am and didn't rece","useful":0,"cool":0},"Ay0pwwQUqRDkjVtmM0dy5g":{"text":"Italian pie combination. Add anchovies. Service is great. Food quality stays the same. Try","useful":0,"cool":0},"yFdEZp11t4LvcUgg-PkDAg":{"text":"Made a take out order on phone...real easy (I thought)...large Mediterranean Salad with ex","useful":0,"cool":0},"te5mtjFHiUvUFNtbNgoH3w":{"text":"Thought I'd give Italian Pie on Bullard a second chance at a Spinach Pizza. Never ordering","useful":1,"cool":0},"xM7lPL8YQR2wxEYtIu4wqQ":{"text":"Very fast delivery but the second time I try to get them to deliver they was playing games","useful":0,"cool":0},"9Z6kJjVF3ZwG7pTOJ8xpEg":{"text":"Italian Pie issues fresh ingredients and the toppings are great, but the negatives outweig","useful":3,"cool":1},"hl4Kv73wPcNdyScd6D7_PA":{"text":"Very Slow Service!\nCame to the restaurant to place a to go order and didn't get it for ove","useful":1,"cool":0},"98B3KOQ13VJRzx1qUs7M8w":{"text":"We order delivery from this Italian pie at LEAST twice a week and recently it has taken lo","useful":2,"cool":1},"qss9gBYaaPwSXh_DZZez6A":{"text":"I will never return and neither should you. I order a large order they 1st forgot one of m","useful":1,"cool":0},"EracIqkSuYRzU_y3wwhyUw":{"text":"I always get the cheese pizza and the spinach&artichoke dip and its always delicious.","useful":0,"cool":0},"z0t7UPed_WcCyW6toYkIvQ":{"text":"This is one of the nastiest places to do business. The staff is extremely unprofessional a","useful":0,"cool":0}}