{"cn7TwtHhMZ0YvqHQBYErow":{"text":"Friday afternoons are crazy! I saw some interesting people getting toasted. We enjoyed bot","useful":0,"cool":0},"MZSwsbK7PLmngZ4vXet-zA":{"text":"We braved Bourbon on a Friday night to return to a favorite of my partner's, Galatoire's. ","useful":0,"cool":0},"P3YXNIp1hGnb6rC37dss8A":{"text":"Every year when we make our journey from LA back to Louisiana we have dinner at Galatoire'","useful":0,"cool":0},"EM89XmXNvbcA_Blvu5z44g":{"text":"My visit was disappointing and I think the place is overrated.  I agree with Russ W (5/6/1","useful":0,"cool":0},"nYCb6Zxt1w_dgRR4i-bbtg":{"text":"Nice service but really only okay food. Was expecting some good twists on classical French","useful":0,"cool":0},"NTgPe-RAsqMcfdpwREBj_A":{"text":"Great fresh fish, had the grilled red fish. The trout looked great too. Good bread and win","useful":0,"cool":0},"hRD9htBNptnIVw1of0oKrA":{"text":"ohmygod is galatoire's positively divine.\n\nbut first the full disclosure:  the boy's fam a","useful":0,"cool":1},"8_rPDq68Tldv-c6w19laMg":{"text":"A very traditional restaurant.  Another must when in New Orleans.   Food and service were ","useful":1,"cool":0},"AmKi8ptkIR56XRi__0iEYg":{"text":"I could not be more impressed. I was eating alone, which I don't usually like to do, and I","useful":0,"cool":0},"R1NHa63QudnWI-8q_apx2w":{"text":"- TIP:  The goute appetizer is great.  Perfect mix; not too filling.   But there are much ","useful":0,"cool":0},"hDBbSzMkH8e8ctUT7_YSNQ":{"text":"The only place in New Orleans worth standing in line for. You really have to be sleeping s","useful":2,"cool":2},"TMhZZRcZLhxSw6SE6A_Xkw":{"text":"Was really excited to try this place but we ended up pretty disappointed. It's all hype. T","useful":1,"cool":1},"g9qDgQghE05dmChZUUKNsA":{"text":"This place is famous and historic in its own right which automatically makes it a tourist ","useful":1,"cool":0},"VNstYCGNdhZ7Lwl5Jtimrw":{"text":"'Twas the day after Xmas and all through the place,\nPeople were eating & drinking with smi","useful":0,"cool":1},"DnxIs3sWAnBOYJ3K9q9oNQ":{"text":"They catered our dinner last night. The service and food was fantastic. Appetizers  beginn","useful":0,"cool":0},"8JP1nIM9Gs3PheAjfKMMHw":{"text":"Always try to eat here when we are visiting in from Dallas.  Server was a little on the sl","useful":0,"cool":0},"mK3iIJz_U46UX5Zzj1MtLA":{"text":"Sometimes an Institution needs to remember that you need to do more than rely upon your gl","useful":0,"cool":0},"8h-gE9lyG_7EWQyI1FYpmA":{"text":"The entire meal was not five stars but I had the best appetizer and cocktail of my life he","useful":1,"cool":0},"bNEKeBq_7MJHyu3eVJXdpg":{"text":"I honestly found the restaurant a little pretentious. Our experience began with excellent ","useful":0,"cool":0},"qksItwuXipPBema7tpDjcg":{"text":"Given the culinary excellence this establishment is known for I was disappointed to see th","useful":1,"cool":0},"8PA8UJdtebxDj92qAQCdVQ":{"text":"From start to finish, this was one of the most insulting and outrageous dining experiences","useful":0,"cool":0},"vr3NwGE0dyhWbOkMKTjnhQ":{"text":"Galatoire's is a New Orleans institution and there is a reason it has stayed open since 19","useful":0,"cool":0},"mrcRo35VSxJukc-w_4cY4Q":{"text":"Living on its reputation. Went for lunch with three others. Gumbo was very bland with note","useful":1,"cool":0},"S0HACGEhyNEIQbMZV3nqDA":{"text":"The service is really great and the atmosphere cannot be beat. You feel like a local when ","useful":0,"cool":0},"mGxREmHoAAB7xeFUEspB3Q":{"text":"The food is hands down some of the best I've had.  The service is without a doubt among th","useful":0,"cool":0},"X3qu2bzw7J4vsnmjqtiwTg":{"text":"My family and I were having lunch there. The food was good. Unfortunately, we did not know","useful":1,"cool":0},"eK_cZRxAGmbwovPD8pl35g":{"text":"Best restaurant in New Orleans. Ask for Richard Faust if you want the best service.  When ","useful":0,"cool":0},"qqmAxysLc5h5KFcMlblObw":{"text":"This is my second trip, had tickets to Preservation Hall so thought this would be a good p","useful":0,"cool":0},"6qjVXxd4kVJrJrDRoBB1fg":{"text":"For old school New Orleans dining, Galatoires is where it's at.  The high prices are worth","useful":0,"cool":0},"TW84WEVOiwqurL_S9OQ85g":{"text":"It never disappoints ! We had a table of 9 and the service was amazing as well as the food","useful":0,"cool":0},"ySehbRxYYujtKz0w9O1JNg":{"text":"It's not just an incredible old school restaurant with an old world atmosphere, the food i","useful":0,"cool":0},"QUk8T0A0-If0S8_006UPEA":{"text":"Put your jacket on and head to the French Quarter madness for Galatoire's! We made Sunday ","useful":0,"cool":0},"jsJpaf6vlGIDq_WO-g5O-w":{"text":"Dinner at Galatoire's is an event. Our experience was two hours of dining pleasure. We wer","useful":0,"cool":0},"Se1ffRLLn_ICUCYRgGGWiA":{"text":"Great food! The dress code was a bit silly though. It's 95 degrees in New Orleans but a wo","useful":0,"cool":0},"JAp7i1T0io4vtIGEPgy_tw":{"text":"Stella took Blanche and left Stanley at home with a cold plate. Now I understand his seeth","useful":4,"cool":1},"yBto_Yc94d1rKIImfyjgHw":{"text":"Rashad was amazing. Adam was outstanding. Great experience and great vibes here. And we co","useful":0,"cool":0},"u9tT464LkeP5uc9g_20iYw":{"text":"In the middle of the French quarter, valet parking nearby. Went for lunch.\nVery charming '","useful":0,"cool":0},"OZvTS2Vcw70Ag0uthr3sCQ":{"text":"The food made up for the rest of this dining experience. \nWhen making our reservation the ","useful":0,"cool":0},"k4DxyNR6LUobVky95Em2-w":{"text":"I had the crab omelet and a hash brown side.  We had a large party, the staff and service ","useful":0,"cool":0},"2whyCp24Pwf2jz26gxzixg":{"text":"Greeting- yes\nVibe- this is the place to be\nPrice- a little high\nService- on spot\nParking-","useful":1,"cool":4},"cWn-c4qquzEJbpjbjGBPMA":{"text":"What a surprise right on Bourbon Street! You wouldn't imagine a fine dining restaurant lik","useful":2,"cool":0},"fJTBIdZrXSu9v5_LycARFQ":{"text":"This place is snooty, expensive and surrounded by titty bars on the most annoying, hetero ","useful":3,"cool":0},"mBoGhpqZzdc_cmoD7TxQEw":{"text":"I really enjoyed my food here. What really took the cake for me was the Sazerac I had at t","useful":0,"cool":0},"Y6IuIWKLOuliUhnJpUPZtg":{"text":"Have been here a few times, this review is for last night.  With 3 friends, had the gootee","useful":0,"cool":0},"SBX-L08piMRVS8R6xdMgRA":{"text":"went on a sunday rainy night and much to our surprise the downstairs dining room was packe","useful":0,"cool":1},"J-EWJRJ8Hftag8gQkaFljA":{"text":"Pomp but no circumstance. Rude staff and not an experience I would revisit. There are bett","useful":1,"cool":0},"bbCtHCAT02L32VYVl9s-7A":{"text":"Small forks were 11/10 would use again. If you're going to make everyone wear a jacket, at","useful":0,"cool":0},"X5Oxl4QTE-Q969mt1FDKiA":{"text":"That there are people who don't love this place boggles my mind (my mind is easily boggled","useful":8,"cool":4},"u2JVA90uws-dSa9vhLz0MQ":{"text":"Oysters Rockefeller, redfish with shrimp, sweet potato pie and coffee. Fabulous meat, atte","useful":0,"cool":0},"SvfzU6Efpa6vb68xodsJrg":{"text":"So so. Food doesn't have the WOW factor one would expect and receive from a modern chef. T","useful":3,"cool":0},"cd9Te1skxk_80k0bO6zRFw":{"text":"For our splurge at a quintessential NOLA dining establishment, we decided to go to Galatoi","useful":2,"cool":2},"CUN9-wphgXJhUTqAX1Pm1g":{"text":"Was told this was the best French restaurant in NOLA.  I hope that's not true.  The food w","useful":1,"cool":0},"rlDQ3avQpTa9kHCzyqh7tA":{"text":"The food is good, the service started off rough and became more pleasant toward the end of","useful":6,"cool":1},"8t-522ZP0USz5tqGQRbfYA":{"text":"First place we dined in New Orleans. Right on Bourbon this place is an original. We had  f","useful":0,"cool":0},"bF9OnmAJmP6Ld7cVC496gg":{"text":"Although the ambience is rather bare, the food and service were impeccable. We absolutely ","useful":0,"cool":0},"_DMrKtsNfhC0vQaIP6_3jA":{"text":"Excellent serice.  Very good food.\n\nThe excargot and Oyster Rockefeller are second to none","useful":0,"cool":0},"MlUlr16PcqAtRMTLu2ZYWQ":{"text":"We were so disappointed as we were not allowed to eat in the restaurant since we had (dres","useful":0,"cool":0},"38eS7pALaj09PeaJch_DOA":{"text":"This was supposedly a must do while vising N.Orleans.  Big mistake!!  We went and tried to","useful":9,"cool":1},"cbtSZSyodXdMe1tFN6RhFw":{"text":"Aside from the locals defending Galatories and poking harsh comments toward all the touris","useful":5,"cool":0},"mRfpWpMgsaRBlgaDOA-CkA":{"text":"I love Galatoire's. The food is always delicious and fresh. I started with the turtle soup","useful":0,"cool":0},"O41q7pHujNi8c1O0LaBnXw":{"text":"the only place on Bourbon St worth going to. Old school, tile floor, french bistro vibe, T","useful":0,"cool":0},"g0WW_q5TvJITmQ8syYdjkg":{"text":"An old time upscale classic restaurant on Bourbon street that's been around for over 100 y","useful":0,"cool":0},"jvp5gvFYZaYDqzcXARKBfQ":{"text":"Wonderful evening in the mirrored dining room. Service was excellent and food was delightf","useful":0,"cool":0},"SXOYwBBlYXMguPoA6CeKEg":{"text":"The food is great. And I don't usually leave anything but great reviews, but I have been h","useful":0,"cool":0},"GFVUdqLI4_Z-lH3X1jJzAA":{"text":"If you have a blazer, wear it, o/w they have one for you. This place does crab dishes righ","useful":0,"cool":0},"tqGmKIo_CTCFD4Kh98vdUA":{"text":"I ate at Galatoire's for their prix fixe menu for Thanksgiving. We sat on the ground floor","useful":0,"cool":0},"imEejisZECVUzonlTuO7Iw":{"text":"Galatoire takes one back to an era of fine dining, starch white table cloths and servers i","useful":1,"cool":0},"zk_Jl_hhxoHOu0tufv5MGg":{"text":"Galatoires is the quintessential New Orleans experience. The food is always great and ther","useful":0,"cool":0},"Jb-_zj6SRlf9-p1L-VHVAA":{"text":"Great service.  Waiter was attentive.  Food was good but not great.  I had a chicken dish;","useful":0,"cool":0},"OTP1DiPPV-O3Xy1KVSoFIA":{"text":"Excellent meal, it is a New Orleans institution. Every single dish we ordered was amazing-","useful":0,"cool":0},"gOMS71w2_hSqUWpPAIXLJA":{"text":"My husband and I's recent visit was very disappointing not because of the food, but becaus","useful":0,"cool":0},"lYsaPiyvLUOpgxQC1N_6iQ":{"text":"Nice atmosphere. Food was delicious. The sweet potato cheesecake is amazing. Shelly was ou","useful":0,"cool":0},"8svjWJ-bkscwdxPftY5QkA":{"text":"as good as it gets doesn't even come close to describing galatoire's.  THE best restaurant","useful":0,"cool":0},"Ouqp2JKEyfFvE8Sy0D69SA":{"text":"I was invited to someone's birthday lunch at Galatoire's so of course you  know I wasn't g","useful":9,"cool":3},"IjG7kHRXjA_UbPjCwqfOcg":{"text":"Go for the crab sardou, listen to the old school waiters' recommendations and soak up a tr","useful":0,"cool":1},"SQYFdPh37lBbQUvghrr6pA":{"text":"Not to be missed on the New Orleans Fine Dining Hit Parade which also includes Antoines, A","useful":0,"cool":1},"MIsANIVhJ5FGmi5UDXDnYg":{"text":"The audible disappointment in the maitre d's voice on learning that I needed a table for o","useful":2,"cool":0},"0ftGjhEpf-3AxtMRY6DZdg":{"text":"Went here for a ladies lunch wearing heels and a dress, while totally hung over.  The pota","useful":1,"cool":1},"tTNrl4u6CBCaKkJRo_H7Kw":{"text":"Love love love their food!!! \n\nI give this restaurant a 5 star because their food was amaz","useful":0,"cool":1},"q0xX-gf4ggmJHxZYRf2Esw":{"text":"Went here for Sunday lunch.  Very fun and traditional New Orleans.  Most people there had ","useful":1,"cool":0},"RoyVatK66CdLGxWEn9nexw":{"text":"If you really want great food, don't come here. It's not that the food is bad, it's just n","useful":5,"cool":3},"m4ciGOuFiSoQYCgYPTQjTQ":{"text":"Group of 13 seated upstairs, we were last 2 to arrive. Waitress came to take our drink ord","useful":0,"cool":0},"WWkoz0kMKt6GgHGLNITsUQ":{"text":"So I'm not quite sure what all the hype is about this place...\n\nDon't get me wrong, the fo","useful":0,"cool":0},"Mar170itpmmuaMadV7FBkQ":{"text":"Galatoire's is a real treat.  Truly one of the top gems of New Orleans, I've had the third","useful":0,"cool":0},"vHjHiTz_a7Z9JwrmPtqn9g":{"text":"One of my favorite restaurants in New Orleans.  Classy and very old-school... Remember to ","useful":0,"cool":1},"U56anOXALATAPLbSY__ktg":{"text":"Friends had their wedding reception here (private area upstairs). The food was amazing. As","useful":0,"cool":0},"qS_IXVt-QBuqSqX5GkzysA":{"text":"Read this for a good laugh, because this was the most bizarre meal of my life.  We had a p","useful":14,"cool":0},"vQhG0GY4hVsIqoC6RKLIBg":{"text":"A good option for an upscale restaurant, but you can probably find the same quality food f","useful":0,"cool":0},"oUkIAQtvtFq-urfi13nGaA":{"text":"Galatoire's was good.  It was.  We came for lunch on Saturday and felt like a local.  No t","useful":1,"cool":1},"lamYyvyLQdP2aT575shC2w":{"text":"Don't go to Galatoire's for good food --- Go for the party, the spectacle, or because its ","useful":0,"cool":0},"I6mucDJrOkV63lJOdZwn-w":{"text":"December 31, 1996: A bright-eyed college senior on her way to New Orleans to root for the ","useful":2,"cool":0},"JZBafZBASsTaVBdg0qPyEQ":{"text":"So I just got back from my trip and Galatoire's was unbelievable! All of the food in New O","useful":0,"cool":0},"asyxl45X0UO0aoCuT4MkOA":{"text":".... base on reviews , waited for more ... sorry , just my opinion ...\nWe ordered:\nOysters","useful":0,"cool":0},"QK-L1JCH-ICWIq0rtGyejQ":{"text":"Does it get any better than this place? I don't think so. Came for a major birthday milest","useful":0,"cool":0},"v3Zk6UPRMvl-T0mXvIDhjQ":{"text":"What can I say.  I hvae eaten here a number of times - the food has always been pretty goo","useful":1,"cool":0},"FFm1VZDimS6jqwNPSe9sbA":{"text":"One of those rare places with an ambience that a million dollars of fancy decor could not ","useful":0,"cool":0},"mUiaKaaYOLT5zxheIg8YRg":{"text":"favorite: well-made drinks, my crab entree offered great big delicious chunks of fresh lum","useful":1,"cool":0},"bsonnQxGS1wSFJauw6g3lQ":{"text":"All four of us agreed our food was \"meh\".  In a word - bland. Also not a fan of the ambian","useful":0,"cool":0},"XpXPrxApo8FFG6AA-d926g":{"text":"3.5 stars\n\nVisited NOLA for a nice spring weekend.  Looking forward to great food.  Galato","useful":0,"cool":0},"_8A6ZJrnt11XqGoX9KNB9g":{"text":"I was so looking forward to eating at Galatoire's Restaurant.  I went there for dinner jus","useful":2,"cool":0},"Dk8otwkhbJdtoffd5kkIKg":{"text":"I'd give it a 4.5, not \"just\" 4 stars.\n\nIt's everything everyone talks about - gaudy but g","useful":1,"cool":0},"GHTHOhePfmL89fza5cWyLg":{"text":"If i could give no stars to this awful restaurant, I would. So disappointed in the service","useful":2,"cool":0},"GN5nT3puoTVN7GbMigoGeA":{"text":"Lovely, cultural and historic NO restaurant. Be sure to make a reservation as they are alw","useful":0,"cool":0},"-pCWTDFi22R5YuFydwrGeQ":{"text":"Food was great, service was slightly disappointing. Upon arrival, the greeter was somewhat","useful":0,"cool":0},"3Hc5SI-TjYfsFsTbmYaRRg":{"text":"Excellent quality, southern hospitality, charming servers, delicious food. They've maintai","useful":1,"cool":0},"Ncq-90vCQqSm-JmXXuQLEg":{"text":"If you want a beer hall atmosphere that advertises fine food, go to Galatoires.    This ha","useful":1,"cool":0},"7JX6mW7va3KcqBhxvPef9Q":{"text":"This a bar review only: \n\nThis is not the bar if you need the 'seen and be seen' vibe. It'","useful":0,"cool":2},"WuLYdN1utiZZG1G7sJoXkA":{"text":"Predictably fantastic! Fish done to perfection. Top rate service.  Our all time favorite.","useful":0,"cool":0},"txjHLWrhHmZFWjGyTrkMog":{"text":"WONDERFUL! I love this place. I took my date here. It was both our first visit to Galatoir","useful":0,"cool":0},"pcT4AJP56fYM4RstYzYMAw":{"text":"Very good food, not too pricey. You must wear a sport coat or suit jacket in this restaura","useful":1,"cool":0},"4xyYC0AMTX_w0wtlnBpJug":{"text":"It's a must when in NOLA. This is definitely not your modern minimalistic French restauran","useful":0,"cool":0},"qPZcf_zYjXTeYbXwXCjo5g":{"text":"Lunch for 6 people here on August 15. My worst experience at this place in over 25 years o","useful":0,"cool":0},"znuZvIHGBeEStt74Tc73nA":{"text":"Very good service very good food the dressing on the iceberg wedge was amazing. Would have","useful":0,"cool":0},"GKAY_t9w1X5MMmShf8UBjg":{"text":"Not sure how this place only rates 3.5 stars. Had a spectacular dinner featuring the duck ","useful":0,"cool":0},"nogNjAVrIzPM6Q6Ti40H5Q":{"text":"Party of 6 for dinner. Table was not ready for a while.  We were upstairs - nice dark wood","useful":0,"cool":0},"3mim5rFI3_iXsAvAwqtAvw":{"text":"Had a terribly rude evening at Galatoire's recently. Even with making a reservation the ma","useful":10,"cool":1},"Lves2S3wTZ4ivcNPg-o9cA":{"text":"Wouldn't say it was bad, but there are definitely better spots. The first floor is suppose","useful":0,"cool":0},"TnT29DK9g8roR3-sYEtJAg":{"text":"This vintage restaurant is so elegant and old. Thinking of the history of the restaurant i","useful":0,"cool":0},"X3hgZLvdMJVvPouxRiZD2Q":{"text":"Absolutely out of this world, the wine lost was more like a book than a list, the options ","useful":0,"cool":0},"mYNeEK00DTNhd3sbxgrn7w":{"text":"Known by locals as the place to go, especially if its your birthday. \nFun place to have a ","useful":2,"cool":2},"-6AO4__-xiyW9nsp7_9aZQ":{"text":"Our waiter was excellent. Unfortunately the food was a great disappointment. We started wi","useful":0,"cool":0},"D27eshPWdr8W4ixfON2FoA":{"text":"On my second trip to Galatoire's I have to back off a star. If it weren't such an old scho","useful":4,"cool":1},"BgErKABWJDYpmqBL9_hQ_w":{"text":"Great experience here! The service was fabulous and the food was delicious! The atmosphere","useful":0,"cool":0},"UhorTUn2ZCQPnb2COshv-Q":{"text":"We went here for a 2pm lunch as a special treat while in NOLA, and we were not disappointe","useful":2,"cool":0},"_Q29iXdvGn3-H4nGIo25pg":{"text":"I loved this place!! So fancy! Went for a business dinner while in town. Ordered wine thro","useful":0,"cool":0},"Ape9UF6A4RqVmgcdjQEGeA":{"text":"Perhaps I just ordered wrong but I was dissapointed in what I had and service was lacking.","useful":0,"cool":0},"LqdjBHAt7wAp8z0qtiu0Bw":{"text":"Hey went there for Wife's 70 Birthday !! On Dec 22 /16 We arrived for our 8:30 PM reservat","useful":0,"cool":0},"5u9FBkdy9d8K_8Z5Unz8hA":{"text":"Last meal before the airplane home at 3.  Find the dress shirt and khakis and run the gaun","useful":0,"cool":0},"KllANPolfz0mrt8aZ38WVw":{"text":"Okay so understand this rating because I give very few 5 stars.  To break t down:\nService:","useful":0,"cool":0},"ip1ht-qrztucXH1H0a8Mlg":{"text":"I had an amazing experience at this restaurant.  The food was really good, but the atmosph","useful":0,"cool":0},"hgtidwEzKDOnxxzHQkP8lA":{"text":"I had the amazing fortune of being treated to dinner here several years ago. As far as I c","useful":0,"cool":0},"IShlyzu_KKs0-7wayL8zzw":{"text":"One of the oldest restaurants in the country and highly recommended by a born-and-raised O","useful":5,"cool":2},"7Wzjk4TThA_RiFBzyHSRZQ":{"text":"Ah, Galatoire's.  If anything ever changed here, I think I would cry.  I hadn't been for a","useful":4,"cool":3},"mJqX9AQX9NQyq82sDlO0tg":{"text":"i'm not a big fan of a suit and tie restaurants, but this place lived up to my expectation","useful":1,"cool":1},"JzlfRfwsg7dd3FDcdYXI4w":{"text":"The restaurant was super crowded and it's tight spacing so it wasn't perfect for a busines","useful":0,"cool":0},"n0fmCOrPYLcJ9Ytsluuysg":{"text":"The food at Galatoire's is pretty good but it's not intended to be cutting edge and you co","useful":10,"cool":9},"-4Nxtvujn2P5xw2Zmk8PUg":{"text":"This place is an absolute trip.  A trip back in time, that is.  Not exactly the quiet dini","useful":0,"cool":0},"UyO_sxd1-NjEbBy_myTH5A":{"text":"I don't know what it is about this establishment but it holds a special place in my heart.","useful":1,"cool":1},"T31jw6NyfhOWjJAdaW51Lg":{"text":"Galatoire's is one of the most venerated New Orleans institutions, and as with most New Or","useful":14,"cool":7},"DeLrY0jGYlKD8EkbTs5qqg":{"text":"Lived in New Orleans 1953-58 ---and passed by many times --- but never went in --- and to ","useful":0,"cool":0},"UKxgMKB24Y3JiPd3qxWqBQ":{"text":"Cute little restaurant. For men jackets are a must. They won't seat you unless you are wea","useful":0,"cool":0},"fZQxnDfdoZ4qet_6fiau5w":{"text":"This restaurant has created the blueprint for fine dining and exceptional service. The las","useful":0,"cool":0},"vhCzkVPKigDRQWq36ig-Tg":{"text":"We went here on a recommendation from a regular at this establishment. We arrived dressed ","useful":0,"cool":0},"uttY1gDd66ua2rjnDCYEnQ":{"text":"Wonderful!!! A real local New Orleans experience. Sit on the first floor if you can. I've ","useful":1,"cool":1},"GHNpQmkhGIO4tufCS0wPiA":{"text":"This is definitely a place that has a reputation as being historic. The problem with that ","useful":1,"cool":0},"rHmCUAcgWYGBLt92bMkrnA":{"text":"After eating in 10 different restaurants we were game to try another of New Orlean's best.","useful":3,"cool":0},"UvsIhcbbZjLaF-lEVfhbfQ":{"text":"Not the same restaurant. Went this past Friday. Slimmed down menu. No crabmeat. Every wait","useful":0,"cool":0},"bqvzNhccCTuJ3ipHu3Ab3g":{"text":"Great dinner and wine. The service was excellent and made it feel like a special event.\nI ","useful":0,"cool":0},"wYjbMYGD0WP2ycU5mT554g":{"text":"This places was awesome - we really wanted to do the Friday lunch but we couldn't wait on ","useful":1,"cool":0},"WSTgA_xBnYRv4n-x0Zjziw":{"text":"0 stars-RUINED MY BIRTHDAY!\nWORST CUSTOMER SERVICE! \nIf you are celebrating something spec","useful":0,"cool":0},"X3dhjVoumHkvK5-QvvKojw":{"text":"Galatoire's is a nice restaurant in the heart of Bourbon street.  It has a smaller dining ","useful":0,"cool":0},"ARpfDdyENBQQRn8Wua8NqA":{"text":"There's little to add to what's been said about Galatoire's over the years by Yelpers and ","useful":2,"cool":0},"CL5IRumrlxlu8C6IxN3IzA":{"text":"OMG - what a great Friday Lunch experience and the perfect way to kick off a weekend in NO","useful":0,"cool":0},"Xc7UqIkTAyt_TOQTNNSs_A":{"text":"I'm a little bit surprised that Galatoire's doesn't have a slightly higher rating on here.","useful":5,"cool":5},"zXdbJFgp-mwnRgr8OGIh7Q":{"text":"I always enjoy my trips to New Orleans and visit a different restaurant each time.  This w","useful":0,"cool":0},"DeRFc61KE3wEpcTjET8TbA":{"text":"Talk about class and sophistication. From the moment we walked in until the moment we left","useful":0,"cool":0},"96f2zr66Z9TjD9J1m3RcvQ":{"text":"Had dinner Saturday night. wonderful food and service as always. Been coming here for 40 y","useful":0,"cool":1},"qMR01JsQBEZZIfmccvbQTA":{"text":"Galatoire's doesn't really live up to the hype, but it's solid.  We started with the Duck ","useful":1,"cool":0},"l47O2FrgjBITddTBzNShVQ":{"text":"Amazing authentic New Orleans cuisine. The chicken creole was delicious and the Bloody Mar","useful":0,"cool":0},"UQk59nIfBQnkUy9HZjoLZw":{"text":"I came to New Orleans for a Mardi Gras debutante ball and had the \"day-after\" lunch here. ","useful":2,"cool":1},"RMJl0EwgPiaUFIDe4-J6zw":{"text":"I will never go back to Galatoire's.  As far as I am concerned, they rely completely on to","useful":0,"cool":0},"9DN9iz_avdOlxTAlJgaBUg":{"text":"We came for a late Sunday evening dinner at Galatoire's and had a high quality dining expe","useful":0,"cool":1},"wst1LjcCnUhX3IrBfXJRTQ":{"text":"They do allow walk ins, but we had a reservation.  We got there 10 minutes prior to our re","useful":0,"cool":0},"jHKVB41_sCTIHu_bszTcuA":{"text":"Our party of 4 had reservations on 3/10 at 6:30. This was not my husband's and my first ti","useful":0,"cool":0},"BaTAnVLKqsfNu5EHAXcOYw":{"text":"Went for a Christmas party, was not impressed at all.\n\nMy first gripe is about the drinks.","useful":0,"cool":0},"QAwskgViY_Rr3vgHelZa6g":{"text":"Wife and I went to Galatoire's on our last night in New Orlean's. The service was sub par ","useful":0,"cool":0},"SsdwZvo5SoEHOWZO9zw6nA":{"text":"My husband and I came here all the way from California for his birthday. Firstly, we did m","useful":0,"cool":0},"-htmparaqLumDASl23o-Mg":{"text":"I've had lunch here twice, and it's something you need to do at least once in your life. A","useful":0,"cool":0},"eHZrhoRo-mp5YbTy7ameug":{"text":"Outside of the turtle soap there wasn't much to be impressed by. I can't see myself ever g","useful":1,"cool":0},"-W-CRw7-o9xNUOWx_wKAaw":{"text":"Upon announcing our trip to the Superbowl XLVII in New Orleans, this restaurant came highl","useful":0,"cool":0},"EnYqdZFbiWvAmQy9Z0--2w":{"text":"A classic. My dad grew up eating here twice a week in the 50s and 60s. Show up for an earl","useful":1,"cool":1},"uls73_cnyXB-26mO8yJOjg":{"text":"I had very high hopes for Galatoire's based on previous reviews & its Zagat rating. We arr","useful":2,"cool":0},"TcDU75zkiuX7xX84GqbgsA":{"text":"A old fashioned jewel in the middle of Bourbon St. No doubt what's considered the best loc","useful":1,"cool":2},"9AFih8QvfHdZ13zOlg-GkQ":{"text":"My husband and I both had steaks. I had the filet and he had ribeye. Both were cooked PERF","useful":0,"cool":0},"y1uQi16SboiRHXNJTrCn8w":{"text":"Occasionally everything aligns and you experience the perfect meal.  Of course this depend","useful":0,"cool":0},"W_5pq1Ie7Qw3tuY0GqzzvA":{"text":"Two words: Friday lunch. It's worth the wait in the morning to snag a highly coveted table","useful":1,"cool":0},"uZbO6PZoBPhNpLZn-IpHYw":{"text":"Food was ok and service was poor.  I would not recommend this restaurant especially in a c","useful":0,"cool":0},"wRUUB0Su6SXwP5hm_bSs_g":{"text":"The quality of the cooking and its presentation is among the best in New Orleans.  The ser","useful":0,"cool":0},"NtFvvCC4SRTigqE_PmeqKQ":{"text":"Inattentive service -- they take the silverware off the table after each course (a good th","useful":0,"cool":0},"yYA-ftdLwgYZzl3mmDJLpA":{"text":"Came here for our anniversary and it did not disappoint. Skip was our server and he was FA","useful":1,"cool":0},"8NlXPNqpKPSYJa-O8l7YQA":{"text":"2 stars because the potatoes tasted like diners, shrimp was tough. Main course was good (f","useful":2,"cool":1},"FWyMKaMCiTNeEZWwB6sX2w":{"text":"This is a good steakhouse but our waitress was not the greatest. I ordered the French onio","useful":1,"cool":1},"M9cKybQ0CkKLskunuT7KUA":{"text":"We looked forward to a special dinner here, but were greatly disappointed. From the moment","useful":0,"cool":0},"vobLq5oY9nRcixJUuGwIUA":{"text":"Galatoire's was on my list of recommended \"go-to\" places for New Orleans. Upon arriving to","useful":14,"cool":1},"4GRfYyPBOm2PDKjZyamQmA":{"text":"I order the Shrimp Vin and it was disgusting so I then switched it for the Shrimp Creole w","useful":0,"cool":0},"1gbGFF9C67_vgAIQ7WaCAw":{"text":"Granted, I'm biased because I'm in the family blood line.  But there's just no other place","useful":0,"cool":0},"LSaQL4xJEb6fT_GVa4FjGw":{"text":"Just OK and I agree with many on here that say this place gets by on its history and its p","useful":0,"cool":0},"RcovhXTO26ks12OvTyo1ow":{"text":"A true New Orleans institution that lives up to its billing.  The food is exceptional (try","useful":0,"cool":0},"7O23qzmLG2hdb96CojbTsg":{"text":"Favorite for a date night. Food is excellent, and service is just as great! They always ma","useful":0,"cool":0},"qdLvHeSNCnuokGGmoqpVNQ":{"text":"Put this place out of its misery. It deserves to be let go. The food is awful and uninspir","useful":0,"cool":0},"m14MxiXPfy22ixAGVN_WUw":{"text":"Dinner and drinks with a colleague. We are seafood lovers and it was okay. First we both h","useful":0,"cool":0},"zm2OLaP4zZbGms9UVVeXig":{"text":"It may not be the absolute BEST food in New Orleans but Galatoires is the BEST classic res","useful":0,"cool":1},"8CzLOL54oYR5BOER1dZ4QA":{"text":"4 for food but 2 for service. We really enjoyed most of our meal. Smaller, reasonable port","useful":0,"cool":0},"AnSSXZqpd8GWoayJImevNQ":{"text":"The seafood was delicious and classic. The place itself is very historic feeling and inter","useful":1,"cool":1},"lfbeLbxuR2zU1UV4tdMXbw":{"text":"Such a sad dent in my wallet for eh food. Maybe I didn't order the right dishes, but what ","useful":1,"cool":0},"7l8wCHkWLKVMp8h6izee3Q":{"text":"Went here on Father's Day (as well as for many other previous occasions) but felt like I s","useful":0,"cool":0},"imS8mF-MsSW-kiRZCHzs7g":{"text":"No complaints on the food or the service, but - Not good for groups! Came in with a big cr","useful":0,"cool":0},"GVpDGbtuIpadkASS61o2Xw":{"text":"This was NOT as pleasant experience as I was hoping for.  Me and my wife came here for a s","useful":0,"cool":0},"ameAYhCRKHtidqBymhR74w":{"text":"This is my happy place. Put on a suit or a nice dress, wait in line, and don't look at the","useful":1,"cool":0},"gyo3hGP6XMPRCBHbC7DCbQ":{"text":"I'm a local but somehow had managed to never go here before. It was my boyfriend's birthda","useful":0,"cool":0},"SUkzRCkMi5nUjZ-7ZgQ2Qg":{"text":"Another reminder why Galatoire's is my favorite restaurant.  Had the goute appetizer, exce","useful":0,"cool":1},"hpR10wVTH0KbJiW4JEBikQ":{"text":"Disappointed. Came here on a recommendation. The place is one large overcrowded room so it","useful":1,"cool":0},"KYix9j7lR7X8z5v_ZFPLjg":{"text":"Wow still 5 stars from me. My aunt & uncle were in town with friends and I got to dine wit","useful":6,"cool":6},"AYP0yZ-2nROdp772WbYBFA":{"text":"We have been dining at Galatoire's for 40+ years.  It is a NOLA classic!  \n\nThe food is no","useful":0,"cool":0},"rREiEPZyehDhsZMvJMbB2g":{"text":"Liver and Onions, Groute, bread pudding, shrimp, crab... all excellent!.\nOur first time at","useful":0,"cool":0},"d9DTVJLCLK6XPBbExi8dlQ":{"text":"I wish I could give more stars but I can't at this price level.\n\nI think the problem was w","useful":0,"cool":0},"RykNDOi1atpRi2e5nh-Z_w":{"text":"This restaurant is really completely 2 different places. There is the quiet stuffy upstair","useful":1,"cool":1},"Z2CfpnvGT1QGMTXrwujjAw":{"text":"Great food, large portions! Had the turtle soup, red fish, and greens. Couldn't finish, bu","useful":1,"cool":0},"UgtJmmk3qdYSz6pvdDxjFA":{"text":"This is such an amazing restaurant, despite the fact that the opening of Galatoire's 33 ne","useful":10,"cool":8},"r5EmlQNyoUj7C1mWB6rcpg":{"text":"I'm leaving one star because of the service. The food and the atmosphere on the other hand","useful":1,"cool":0},"hSDAxVP0iRdoV7YEFFx1zQ":{"text":"Galatoire's? The Best of The Best !!! In New Orleans, there are a few great restaurants th","useful":0,"cool":0},"OTNwMmnEPXQMzVifRsNAkQ":{"text":"Wanted to try an NO institution and made Saturday night reservations.  Ordered the Galatoi","useful":0,"cool":0},"hxYnpOVjILLMzuCWEV4VIA":{"text":"\"What!?  WHAT!!??!!\"  \n\nImagine you are Pee-Wee Herman with an oversized plastic ear held ","useful":4,"cool":2},"Qe6aRqmsPuRySErBY1dVkA":{"text":"The best of the best of the best.\n\nFirst of all, you must sit in the (original) first/grou","useful":1,"cool":1},"7SaIQ7vL_Y5LW56fz6EOsw":{"text":"We were told this was a must visit while in New Orleans. We had reservations for the seate","useful":0,"cool":1},"BodyY5UnVRhXMKbNTZDZcA":{"text":"You know in Field of Dreams when they disappear into heaven by stepping into the cornfield","useful":1,"cool":1},"tMkldbvu6wETJut1tczI6g":{"text":"We decided to do another night where we all order, we ask the waiter to course out the dis","useful":0,"cool":0},"ZDs1RIcRjckqzjOr9hpjxw":{"text":"I was visiting NOLA for my birthday and wanted to go somewhere elegant and classy for my b","useful":2,"cool":0},"5kOT-6cHM2fO5_zcgoHdwQ":{"text":"When I was in my early teens I took my then girlfriend to Galatoire's for  \"fancy meal.\" T","useful":4,"cool":3},"ceohEfWoacyWePiW_BBoRw":{"text":"I remember Galatoire's from my last trip to New Orleans and it did not disappoint again af","useful":0,"cool":0},"oQ2f_eQQ1gcOpN-3p_p1fw":{"text":"Impeccable service and delicious food. This is a wonderful, vibrant restaurant. We were he","useful":0,"cool":2},"2PGO_Z8HiyZ7wpY35q3MLA":{"text":"simply my favorite restaurant anywhere.  my waiter is the best.  folks, do some research a","useful":0,"cool":0},"MwHC1HwJxYPu7zBW3wmmFw":{"text":"Terrible dining experience.Servers untrained in basic table service etiquette, inappropria","useful":2,"cool":0},"CcIyu_ExkI5h0Pbc6sOYbg":{"text":"THE GARLIC BREAD!!!!!!!!!!!!!!\n\nIt's important to understand the sheer awesomeness that wa","useful":13,"cool":4},"F0wurVd9cuCUbocXF5-w6g":{"text":"This is One of The Great Restaurants of the World. Unsurpassed Ambiance, great Food and Se","useful":0,"cool":0},"qRf0iIAk2judUnYyylL1GQ":{"text":"If I was basing this review solely on the food I would give it a 5!!!! The food is unreal.","useful":0,"cool":0},"teelxsbTMcDspOYu58bk-A":{"text":"Went  there on our anniversary because of the ratings on Yelp and on the NOLA website of 1","useful":0,"cool":0},"kKOr4GLWaSxbRVNFdeM5pQ":{"text":"One of my top five favorite restaurants of all time. I have never ever been there without:","useful":0,"cool":0},"v53cUX292risV4e3TJa6Xw":{"text":"Went their for Saturday bachelorette luncheon. The atmosphere was very nice, however it wa","useful":0,"cool":0},"prkEvb8p1fYAdRu9Pux0iw":{"text":"What an amazing dining experience. While driving across country with my Dad we went to Gal","useful":2,"cool":0},"E1KPLuZCWtbWdGcieLqPKg":{"text":"We had a wonderful evening.  The food  was great and  the service was outstanding.  A nice","useful":0,"cool":0},"sw84BePPthi31JWQ3YYfCA":{"text":"I'm sorry we were such an inconvenience to you coming in 30 minutes before you close. I've","useful":2,"cool":0},"xysq7f5HhjbrNlrJwrtk0w":{"text":"Three words:\n\nOYSTERS EN BROCHETTE.\n\nomg omg omg","useful":0,"cool":0},"Z6JrlaaucDnSnr11AMDa5Q":{"text":"For a restaurant that requires a jacket for men, you would think that service would be bet","useful":0,"cool":0},"vtC4DkDh9Z8hURCt4LjSWw":{"text":"Tried Galatoire's during COOLinary New Orleans for my 11 year wedding anniversary. The hub","useful":6,"cool":1},"00zvYAtfquju4XI61Lm7CA":{"text":"Well this was the hottest ticket in town on New Years and we had a reservation. We were re","useful":0,"cool":0},"dtEPFX54E9KhafJK8ShK8w":{"text":"Outstanding service and solid food.  The table garlic bread is very good but make sure you","useful":1,"cool":0},"DpHeruidlaiTzZHvZHts5g":{"text":"Hands down... the best trout in town!  The crab meat was melt in your mouth perfection.  T","useful":0,"cool":0},"u-2mx8Q9QEAHLSDwXDILPQ":{"text":"Is there a 1/2 or a zero we can give away? We had a reservation for Feb 14th. Was it almos","useful":1,"cool":0},"wVlt8_MObZwhqJGTlRxTtg":{"text":"I was debating which restaurant to try since I had limited time in New Orleans.  We were v","useful":1,"cool":0},"YiulsKzF0goS4fawXyHOsQ":{"text":"Found this place on a website while browsing \"Must Eat in New Orleans\" or possibly \"10 Thi","useful":2,"cool":0},"w_86OKIM8y7i3mLC27dMrQ":{"text":"One of my all time favorite brunch/lunches of all time. I cannot believe the average of th","useful":0,"cool":0},"20jowrSRZMuKm2K9MLgIzg":{"text":"Best wait staff I'm seen in a long time. The lamb was great ($44) and seafood appetizer wa","useful":0,"cool":0},"K7IvlBQBv9Opy5fvh2Ei8A":{"text":"As a New Yorker visiting New Orleans, I wanted to visit a restaurant that emodied Old New ","useful":1,"cool":0},"oZJ5Yu5RjbPiPM6CtJwarA":{"text":"If you read nothing else, please know the bread pudding with the praline liqueur was stunn","useful":1,"cool":0},"cyTJCUcOZ6szDlrus-EVaw":{"text":"Amazing dining experience.  Love the old decor - original tile, old wallpaper and lights/f","useful":0,"cool":0},"2LCxrgcF195o9L0OGXXG-w":{"text":"Local...\n\nI will always remember the bowl of lump crabmeat that was placed in front of me ","useful":3,"cool":1},"lEA2utiR49XQr_cDhoBvGA":{"text":"The Grand-Pere of New Orleans Cajun/Creole cuisine. Same menus for years. No surprises, no","useful":2,"cool":0},"omxd3TH3xwg4_vKo4nL3IQ":{"text":"Antique ambiance. Food is classic new Orleans however the food was mildly unimpressive. My","useful":0,"cool":0},"T82BIcTdKmspbdaQaZIkvg":{"text":"After years of hearing stories about the greatness of Galatoire's, I was unfortunately ver","useful":0,"cool":0},"nUCIrVd19K5Pp8FM3Z1DfA":{"text":"Best escargot in town. The $19.99 fish lunch is just ok.  I love that they give out compli","useful":0,"cool":0},"zPm1WDZAkf9Rf4Yjdbpp1A":{"text":"An old-timey, fine dining experience right in the heart of the Bourbon Street and the Fren","useful":2,"cool":2},"fIzW8iPujPLTBsSOzVQtkA":{"text":"No bread plates. No bread plates in the entire restaurant. Spinach Rockefeller was drawn b","useful":0,"cool":0},"hd3vzZMmdfVM6uz4JuBhpg":{"text":"We had a pretty awesome night at galatoires's. The service was great + food was tasty. Onl","useful":0,"cool":0},"HV1PSNPnzLKFi2_rkYRbag":{"text":"Galatoire's ***\n\nMy sister and I dined on a budget here (i.e., no wine, and not too many a","useful":0,"cool":0},"ec1LMKIsbVnHxEGN5swzgQ":{"text":"The ambience and staff are inviting. Food is great and well prepared. It's crawfish season","useful":0,"cool":0},"-7_oH-sqqbsjogQBklw8zg":{"text":"FRIDAY BRUNCH\r\n\r\nWhat can be more fun than dressing in your Sunday best, standing in line ","useful":1,"cool":1},"uP7JwoSnIAPxIDJ-Zy5PDw":{"text":"Time=experience.\n\nWe landed in NO around 230pm on October 30th, headed to our accommodatio","useful":4,"cool":2},"VkoEOd9iPU1TiQ9tgAimHQ":{"text":"This was one of the best dining experiences I have ever had.\n\nThe food was fantastic.  We ","useful":0,"cool":0},"Q8aCHq5Lax2C6iQjvPoW5w":{"text":"This place is classic and old school.  The only place I've ever eaten requiring a jacket, ","useful":0,"cool":0},"VtjPY081eBd_N7skeKSgZA":{"text":"Very good place! Had filet mignon. Made perfect. Appetizers are excellent. Atmosphere is v","useful":1,"cool":1},"he1LjvCLU5x92VSNr2MoTg":{"text":"The pecan pie was amazing, but by far the highlight of our experience was Ralph who was ou","useful":0,"cool":0},"kzuZNFf6Uzh6eWlO_9Idkw":{"text":"This may be an institution but bring your ear plugs. So loud couldn't hear yourself . Plac","useful":1,"cool":0},"R90wnLJ9cJ01ZjQEKEd-og":{"text":"An old South classic. Wear a jacket or you will not be allowed in. They do provide some so","useful":1,"cool":0},"IPkhyIFL-3SfbxFLDWg48g":{"text":"Thank god for Ralph!!!!!\n\nI live in Brooklyn and my boys threw me a bachelor party in the ","useful":3,"cool":0},"5lR9UL7pPtvhoxfrQvlU9A":{"text":"Galatoire's is a New Orleans institution. I remember going there with my grandmother and s","useful":0,"cool":0},"phUSdH3w2phs_dR3xfpwSA":{"text":"Sunday brunch with my wife because this was a must try location.  The food was good but no","useful":2,"cool":0},"qoXi-4PPJoNB9kCvvh0fYQ":{"text":"You have to have a coat to go in here for lunch.  They gladly gave one to my hubby.  The f","useful":0,"cool":0},"qq46yiawaDGJIntv3TojeQ":{"text":"Called for a reservation, got it. They said they would be ready in 15 mins. Arrived at the","useful":0,"cool":0},"wFUFDrDtr2rxQ3FXOzMSmg":{"text":"On the day I ate here, it was 10/20/2011 and the world was supposed to end, right? So if i","useful":1,"cool":0},"Ch95x2IZyyLi6i1pmO93yQ":{"text":"I just did a whirlwind tour of some spectacular places to eat in NOLA and this is right up","useful":1,"cool":1},"wq1VKjZ87aBlricE8TROUw":{"text":"Incredibly disappointed. I made reservations for Mother's Day and to celebrate my daughter","useful":0,"cool":0},"3n51_WjQP0az_FcUhdopiw":{"text":"Was in town for a conference and we were struggling to find somewhere with reservations av","useful":0,"cool":0},"o-uWVa_P9qYAX2ftljhJnQ":{"text":"Definitely fun to imagine all those rich people walking past the strip clubs for Friday lu","useful":2,"cool":2},"v2zZdISTBq20hAl3oKm2_w":{"text":"On the basis of dinner Tuesday night, this regular out-of-town visitor to New Orleans and ","useful":1,"cool":0},"yIlFENgwVxbwfcZrWmALGQ":{"text":"Sorry Galatoire's, but it was bad. We had a recommendation from a friend that went with a ","useful":0,"cool":0},"jPrNWpwNNmWQnMxnZR4KZg":{"text":"This food was terrible! Tasteless and cold. The best thing about the night was the very ni","useful":0,"cool":0},"uEFUN_0sLZ1V3V-r75F5IQ":{"text":"So, I made reservations because, at the time of my visit, Galatoires' website mentioned th","useful":0,"cool":0},"2WTTWUl6nBXH-TS5zhjBmA":{"text":"When I go to NOLA Galatoire's is a must go to eat a wonderful meal...Great service top not","useful":0,"cool":0},"Yp_Q2_SSJ0k4X__R9WuS5w":{"text":"So we made reservations, we're from out of town. Did not let us know of the dress code. We","useful":0,"cool":0},"z-8PQZJqmtgQHdc8vtgzzg":{"text":"Everyone has mentioned the entrees, which are in fact delicious; however, what really stoo","useful":1,"cool":0},"9ehzO8BrZOGIwJXTFmRYyQ":{"text":"This 100+ yr restaurant has lost its mojo. \nMore than half dozen blue crab dishes on the m","useful":0,"cool":0},"X59zCGY0UUGCKHxRwxd1kA":{"text":"Surprisingly underwelming. Came out here from So Cal and packed a jacket and nice digs for","useful":3,"cool":0},"n5a05mn1ShFdyGmh4Kz_Pg":{"text":"My dining partner had her heart so set on going here that she convinced me to dress up on ","useful":5,"cool":1},"UBC5t-tbJgLmNAKcrFVrLg":{"text":"We were looking forward to this meal so very much. It had been recommended by multiple fri","useful":0,"cool":0},"uLJT5CJQGEwNi5awsUMheg":{"text":"I had a great time at this place.  It was a bit noisy and tight for my mother's taste, but","useful":0,"cool":0},"DzwEqMps-HftNyCBbn4B4w":{"text":"This was my first time in New Orleans, so I asked a lot of locals where to go for a good e","useful":1,"cool":0},"14NVGktEaLxCGR1v9obf7w":{"text":"Maybe a fantastic restaurant in the past, but it's past it's prime.  The food was so so an","useful":0,"cool":0},"_sWBDnJ9YRwT6CQyUqXY1g":{"text":"Everyone's bucket list NOLA destination (along with Commader's and Emeril's) Well prepared","useful":0,"cool":0},"LmzLYc01mhIdF4jL59wyHg":{"text":"Ah Galatoire's!!! Old school, old timey service and damn fine cocktails!\nThis was quite th","useful":0,"cool":0},"6Ssf4pGpv3ilRKXWJHz_wA":{"text":"Good food but the experience was not ideal for the cost of the visit. Upon arrival the man","useful":0,"cool":0},"nNT_r8K12K6h_knyxeH9KQ":{"text":"This was our first time at Galatoire's and based on what we had heard about the food and l","useful":0,"cool":0},"2RTkRalaJ945DEx1Ivswvw":{"text":"I have been wanting to visit Galatoire's since my daughter moved to New Orleans several ye","useful":1,"cool":4},"xD9fz8GbezmVA4-DEywX6Q":{"text":"Another childhood favorite that hasn't changed a bit! (Yeah, I like time warps. Very cozy,","useful":1,"cool":0},"g78JObBVVFPPRM92RYMe6Q":{"text":"A New Orleans institution!!\n\nLast night I dined here with my husband for dinner. On a Sund","useful":2,"cool":0},"uPXvqC9xzPGHagfl7STHiA":{"text":"What a disappointment! Been waiting to go here for a while. Place is dirty. I know its old","useful":2,"cool":0},"MsM5DC4yNNOZNijfvM4GXg":{"text":"This place is absolutely overrated. First of all: Too brightly lit, and way too loud. It f","useful":1,"cool":0},"0kOJCJpdvG2iX-Pp3yKHEw":{"text":"Phenomenal. Redfish with Crawfish Etouffe and Oysters Rockefeller. \"An authentic taste of ","useful":0,"cool":0},"vkx8BI9PPgomDRatkPdxpA":{"text":"Party of 12 for a birthday brunch at 1pm. Seated upstairs. \n\nWe ordered everything--the bl","useful":3,"cool":0},"vdKnKf_bx6xrRbh7xxFh7A":{"text":"Cool experience. Old Nola establishment filled with local business people (mainly men) and","useful":0,"cool":0},"3VwtLwKhihLDh-sDM6EGgA":{"text":"Good service, food was meh. Atmosphere is perfect though, very old classic New Orleans amb","useful":0,"cool":0},"XcTmCFoYM_qHVCaQfeR2HA":{"text":"Thanks to a gift certificate we were able to check out Galatoire's for dinner. I have to a","useful":0,"cool":0},"Ex-2PPC7OFD9xM-RfL0rUw":{"text":"Apps were pretty good as was the service. However, the steak was served at room temperatur","useful":0,"cool":0},"DljD3KLlouOEPvnAzVJn-w":{"text":"From the Turtle Soup through the amazing Eggplant/crab/shrimp entree to the amazing pecan ","useful":0,"cool":0},"FSpzKgoT8w_fjKVBlHE3fg":{"text":"Oh the garlic... the garlic. It was everywhere and in everything. Shrimp remoulade, good, ","useful":2,"cool":0},"-VYaWWdweaeZECxE0ao7nA":{"text":"Don't forget your fancy clothes. I had to borrow a sport coat to get in.  This place is ve","useful":0,"cool":0},"6_Hzh3vd4bVJdn0Jif00lw":{"text":"I have to say I was a little disappointed.  The ambiance is very swanky and cool, but the ","useful":0,"cool":0},"wsj60sQw38JxAiFiA-cj-A":{"text":"Had a fantastic dinner with my husband and teenage son at Galatoire's on Friday night.  Th","useful":0,"cool":0},"qFtvUxm9tIFu2lSJt3fEyw":{"text":"One of the oldest operating restaurants in New Orleans, and generally regarded as one of t","useful":1,"cool":0},"F3kZMyrynSuh6Fp0yexLfQ":{"text":"I don't even think 1 star is acceptable. This place was horrible. The service was horrendo","useful":2,"cool":0},"yG4r4C-ZYKCAbVHTs2vXaw":{"text":"This is a fantastic place in New Orleans which has been around for over 100 years. Its Hau","useful":0,"cool":0},"Wbagfk4SjYj3s3D_eWMioQ":{"text":"The service is excellent here and the food was great. Tried the soufflé potatoes (one of m","useful":1,"cool":1},"XDpxpOZ8cqvtWecNkWGdcw":{"text":"Galitoire's is a local's affair set in a predominantly touristy Bourbon st. This is an imp","useful":2,"cool":2},"3ZCS3niZj8GjbZY6Dx7uqw":{"text":"We arrived in New Orleans on the Thursday before Christmas, it was 4 pm and we were starvi","useful":0,"cool":0},"Wr0ki3O8giQJJ_aDCTpSxg":{"text":"The service was terrible and we waited an hour for appetizers and salads. Crappy oysters R","useful":0,"cool":0},"pl60-pimDhvpbunmnZn17g":{"text":"I've come here with the whole family for two decades now and they'd been going long before","useful":0,"cool":0},"m0XEp8tzg28GhoqrnQA29Q":{"text":"One of the best meals I've had in New Orleans! We had the stuffed eggplant and a ribeye an","useful":1,"cool":0},"2OGuWAbFCYho2QTY9Kp9Kg":{"text":"The service is very good, decor is nice but a bit old...the food, I'd score a 7.5 out of 1","useful":2,"cool":1},"9SHwpb8oGsgNupzTKNvUkQ":{"text":"Great apps. Fresh warm bread. Bouillabaisse is the best I've had, (and I've been around)!","useful":0,"cool":0},"z3TGMMSH1wqam12hGC7VVQ":{"text":"Oysters Rockefeller were exceptional\nGood selection of CA wines.\nThe crab meat appetizer w","useful":0,"cool":0},"J9F8uZEPHd39M1_gSRe_5A":{"text":"Our group came for Brunch on a Saturday and enjoyed our experience. We dined upstairs in a","useful":0,"cool":0},"opvnJTrXDJkOAkOlIQ3LDw":{"text":"We chose Galatoires as our first meal in New Orleans and were not disappointed.  The servi","useful":1,"cool":0},"ooTKfWC1CCpFx8Cp-xXlrQ":{"text":"Great institutional restaurant in New Orleans. When you enter, you get a feel of old schoo","useful":0,"cool":0},"A1AqiqJ9SeO2avVHjlnoZQ":{"text":"It was worthwhile dining a Galatoire's once but I do not feel compelled to go again.  It w","useful":0,"cool":0},"IJ5KzAmW3fWAWUEYR2Hrrw":{"text":"It was my first time visiting Galatoire's and being a local I of course had heard all the ","useful":1,"cool":1},"DjCvs0KeIaoGp8mdoiZBmA":{"text":"Great service! Food was pretty good too. I remember the gumbo had this great flavor as if ","useful":0,"cool":0},"Rz7YW5Ueu2pPsVpkwzeuTg":{"text":"Empires rise.  Empires fall.  It is a testament that this joint is still hopping and dolle","useful":1,"cool":0},"BNJwwJZuFiogbO3HHoswyw":{"text":"Did not finish the meal as we walked out. The waiter searched for our wine 30 min. When he","useful":0,"cool":0},"ndA9alnt9jBiJDB3Fl3HDw":{"text":"Waitress had an attitude. Martini was not cold. Fish was dry and tasteless. Shrimp was bla","useful":0,"cool":0},"N-kvtvuPFBMOLmtp-dSk5g":{"text":"Five stars for the service! We were given complimentary soup just for being from out of to","useful":0,"cool":0},"Bu0hc2SuW73iMmnaSJTsVQ":{"text":"We had a wonderful lunch at Galatoire's. My only dink is that the shrimp in the remoulade ","useful":0,"cool":0},"estnzCMqhIzYlLglowwQaQ":{"text":"Sometimes I like to crawl into my time machine and pop out around 1915 for dinner at Galat","useful":1,"cool":2},"8C9Y_Em-0NsnoM1X4I4r8A":{"text":"This was the location of the rehearsal dinner for a wedding I was in last weekend. There w","useful":0,"cool":0},"YuTe4q0wz3g7w5BoGMHs4w":{"text":"An oasis on Bourbon,\ndining here isn't a chore.\nOld-time New Orleans,\nyou get what you pay","useful":20,"cool":21},"Ig6ZG_oi_XPXfMqBXSM2vg":{"text":"We decided to go to dinner early at 5:30PM to avoid any rush for a table and were delighte","useful":1,"cool":0},"t5p8XL34CsumAk41z577kQ":{"text":"Great food, great service and wonderful atmosphere. Galatoire's is what every old New Orle","useful":0,"cool":0},"hJ0NjgZOsaAPx6MxpQ1_cw":{"text":"Whatever you do do not let them seat you upstairs. It is not the same!!! Food, service, am","useful":0,"cool":0},"NRfa9o7IV6sx4qxuK65dnQ":{"text":"Unfortunately, meh, about sums it up.  I have only eaten here twice so can't be considered","useful":0,"cool":0},"ufkiD7HylboMWyZ9DuXcNA":{"text":"GAL-A-TWAS... I was formally corrected in the pronunciation of Galatoire's. The saying don","useful":1,"cool":3},"XI5-lpIBQ5O20lA4V8KXRA":{"text":"Not the Galatoire's it used to be. No shrimp in stuffed eggplant. No offer of refill on co","useful":0,"cool":0},"A_L6bXgW17i7AoneAPDLDQ":{"text":"My girlfriend and I went last night. Galatoire's was out of three-fourths of the menu, whi","useful":0,"cool":0},"SpaqXxOJwwDy8Xi1y4-BWg":{"text":"What a great restaurant! The service was exceptional and our waiter's attention to detail ","useful":0,"cool":0},"61Sp5LOZPtF0tc-dlmwCgg":{"text":"Everything here was FANTASTIC. Our server, Michael, was extremely helpful, polite, ans gav","useful":0,"cool":0},"3VbBiruGVHVgtetsCjH-4A":{"text":"I grew up in this place.  Love Mr. Harold and Mr. Billy.  No other restaurant can compare.","useful":1,"cool":1},"waMert4mRp8TJavHDEFa8Q":{"text":"Lots of issues made this a negative experience- from the noisy batchelor party prohibiting","useful":0,"cool":0},"wUnQW-c166umo4auNqulMA":{"text":"Galatoires is one of those classic places you need to visit and check off the list, but I'","useful":1,"cool":1},"LiPpP4SwnJ6h3d6iM1ZEsw":{"text":"Wow.  All I can say wow!! We had Friday lunch downstairs.  John took care of us.  Galatoir","useful":0,"cool":1},"d_v8CTkINyqZnZ6jTIEycQ":{"text":"Yum! I love this place! Food, service, drinks- everything was great! Can't wait to go back","useful":0,"cool":0},"4V94I2C2PLVPj2P4ef1HiA":{"text":"Not what I remembered\n\nAte here about 6 years ago and food was out of this world. Went bac","useful":0,"cool":0},"EemebFYJcyJnCT--fhWA_g":{"text":"Galatoire's is one of the oldest restaurants in New Orleans, and is remarkable in my mind ","useful":16,"cool":4},"zTTITTppZT6Yl_WHLSewgQ":{"text":"We were Group of 20 ppl, food and service was good. I ordered fish with crabs and my husba","useful":0,"cool":0},"6yDei0x8MlJUXrf7dMkI0g":{"text":"The food was great.  The service, however, was subpar.  The host and hostess were brusque ","useful":3,"cool":0},"QXU9McYp-9gV41bwSkUzog":{"text":"Went to have dinner to check it out for a friends rehearsal dinner. I am nothing but upset","useful":0,"cool":0},"sBmc0v4xXo3Nzzbso1fm5A":{"text":"Excellent service, outstanding food, in a very impressive setting. Quiet oasis on bourbon ","useful":1,"cool":0},"AK2X7u8E7ruXg14SrwCKsQ":{"text":"I finally went. I have mixed feelings. \n\n\non the one hand I certainly can't argue with the","useful":5,"cool":3},"pavHLba5tscn0kzv1223sQ":{"text":"I always wanted to eat here. Galatoire's was worth the wait -- since I was on a student bu","useful":0,"cool":0},"iU7y8yX4_vV0Qm9wqnnH7Q":{"text":"Galatoire's is old school New Orleans - and that is not a bad thing.  Men must wear a jack","useful":0,"cool":0},"lMARGbPhwb_G0LCAbM2BsQ":{"text":"Literally the worst service I've ever received. I dined a couple Fridays ago for lunch wit","useful":4,"cool":1},"l8nvx58sKIsFVmbGcaduGg":{"text":"I was very eager to try Galatoire's after hearing a lot of hype over the years. My son and","useful":0,"cool":0},"jd57RobUaq1qNonKbW5R-g":{"text":"I was very excited to try this restaurant. The menu for coolinary week looked prettt good ","useful":0,"cool":0},"AHPONklD0Lv8abi1BjK0cg":{"text":"This is sort of a New Orleans standard, which is what makes it a place you'll want to eat.","useful":0,"cool":0},"uLACQY34O4pRoCvhy0V3dA":{"text":"Elitism is alive and well in the French Quarter. This restaurant seats those of questionab","useful":4,"cool":1},"k1aVu3eI7iPkB6LrfPOB4g":{"text":"Food was amazing. Atmosphere was terrible. We arrived at 5 with a reservation and were sea","useful":0,"cool":0},"0PCIyXph1yAcVh_LYsUV1g":{"text":"Had the tuna which was not that great.  Basically vinegar drenched yellow fin with dull ch","useful":0,"cool":0},"VCrSzuhvjSmmfZmqGXYa_Q":{"text":"Amazing food.  The oysters rockefeller are perfect.  I've enjoyed all their seafood.  They","useful":1,"cool":0},"BdeQ9SH4KTsyyph6cqQ8hw":{"text":"As always had a wonderful time here last night! Came here with family for a birthday and A","useful":0,"cool":0},"l3XtBnH129L4lYDfISAWbg":{"text":"We spent Christmas Eve dinner here this year.  My father picked the restaurant because he ","useful":4,"cool":0},"ODuoXkmmLVnMO_bFnSTMzQ":{"text":"This place was amazing!!! We had the shrimp roumalade, the lump crab meat salad, and escar","useful":0,"cool":1},"5apptHexbn5m46JYt-g-7g":{"text":"We'll go middle of the road for this dinner experience.  Wasn't a bad experience, though i","useful":2,"cool":1},"npiNqR2iVrwXgeqjRbX7iA":{"text":"Husband and I went here for lunch and enjoyed all aspects. Love the service, very attentiv","useful":0,"cool":0},"P_BtTeYQdXMsjrcQ0hcANw":{"text":"Had a wonderful waiter, Maja, that took great care of us last night. Made great suggestion","useful":0,"cool":0},"jJvLLq8AEAhI5tivMMJvVw":{"text":"To say this restaurant is a place to 'see and be seen' by locals is about the best thing t","useful":4,"cool":0},"XUMIkD_J5QKCO804PVZjGA":{"text":"Great dinner place.  You feel like you're stepping back in time. White linen covered table","useful":0,"cool":0},"GXSCJ93Qzn5jfs7qXl465A":{"text":"Only in New Orleans can you go to this caliber of a restaurant, so elegant, so posh, weari","useful":1,"cool":1},"LyD7icvwFsOvwCF2TFbWMg":{"text":"Classic New Orleans fine dining. Excellent atmosphere and the food is second to none. Enjo","useful":0,"cool":0},"80s_legw4hOCYsjGcC_pMQ":{"text":"Food was delicious and our server was very sweet.. However, on a Friday night I did not se","useful":1,"cool":1},"u7Jnrm_qvhRKkA9sWKoFCw":{"text":"I just recently went to New Orleans for my bachelor party and ate at Galatoire's Restauran","useful":0,"cool":0},"vgKpzyESLgiT7XB_WQ9fSw":{"text":"One of the last great bastions of gracious dining. When you pass through the doors it's 19","useful":1,"cool":1},"ACuDmNyIwm3WfXbJWJ_c1A":{"text":"Terrible service.  We arrived shortly after 5 pm and there were only 3 other tables with c","useful":0,"cool":0},"i3XsUkGeQrFL0vZs6zgs_w":{"text":"We had an entire room of 100+ guests eating on a fixed menu.  This is often an invitation ","useful":2,"cool":1},"QfaResi6ErEzC9MaJ9jR2w":{"text":"Was really excited about eating at Galatoire's and it came highly recommended. Boy, What a","useful":0,"cool":0},"BWCprPDK6SYbnsdbjD5gZg":{"text":"While the ambiance doesn't quite give you the impression of a fine dining restaurant, the ","useful":1,"cool":0},"2K49an9Eyve5mLKaFCU2Aw":{"text":"Excellent food, very professional service and attention to detail. I ordered the Eggs Bene","useful":1,"cool":0},"g_h2qi7FCKW-MN8o6mIdCA":{"text":"Great \"old-line\" atmosphere, as you might expect from a place that's been requiring the we","useful":0,"cool":0},"WNhrzxjeBjGiJvimSeohOQ":{"text":"As far as it being a New Orleans institution and ambiance it's a flat 5 star with very goo","useful":0,"cool":0},"s_31YbuxaQDbFxPft5OI_g":{"text":"The food was very good at Galatoires. The menu is overwhelming but once the waiter explain","useful":2,"cool":0},"MvUg-Ud57zq5w41V8jCipQ":{"text":"I know this is a great restaurant but I must have hit it at a bad time (Tue. night in Nov.","useful":1,"cool":0},"2MeGwxwXLlMc-zq4Kgix2g":{"text":"Okay, so it was a tease.  Arrived on Monday (they're closed).  My friend, Anne Belkov, an ","useful":1,"cool":1},"ssoWWOTUwNzDWsAZSdKSqg":{"text":"It is important for me to preface my review with the following *the food was not bad just ","useful":0,"cool":0},"sjf_utpnx-xVkrIfTigYOw":{"text":"Horrible. Had a reservation.  Got sat without menus.  Got water, then proceeded to sit for","useful":0,"cool":0},"pRr7WCL1I5ebQ9Q9RHzizA":{"text":"One of my favorite places in the world. The food couldn't be better, neither could the ser","useful":0,"cool":0},"EnjbWHyr3WfzpII2HPvscA":{"text":"Don't go unless you want to eat salt only. Lack of flavor of all dishes. Also they ask guy","useful":0,"cool":0},"Ox6NjfSsI8L3guQcuVT2tQ":{"text":"The acoustics were just SO awful. The food looks amazing, but I'm ready to walk out the do","useful":0,"cool":0},"EFh9hgJBC4HPEVXXXCG6EA":{"text":"A must in New Orleans for the old school atmosphere and delicious food.  Service is amazin","useful":0,"cool":0},"2mHu26fEgoDy4I5oY61A9w":{"text":"I LOVED the food.  All I wanted on my birthday was a perfect piece of fish and I got exact","useful":1,"cool":0},"WdudN0kg5pq954CNKGz7tQ":{"text":"Yes, it's old enough that it's a classy restaurant on what is now fratty Bourbon Street, b","useful":0,"cool":0},"T75RWbfWr9QY16BvX9qUbA":{"text":"A five star restaurant provides a comfortable yet interesting environment perfectly design","useful":8,"cool":7},"mMiv2ljcRA2fOEOD4Pv1-A":{"text":"This review is based only on the service, we left after spending about 40 minutes waiting ","useful":0,"cool":0},"Y_clgI-BgUPjmdMjVltgbg":{"text":"A classy joint. Guys, make sure you're wearing a collared shirt at least for lunch, a jack","useful":0,"cool":0},"mSOYf6XXllmLLbPHMAvifw":{"text":"Galatoire's is simply FABULOUS!  Such warm welcome and impeccable service!  I am always da","useful":3,"cool":0},"3_W2VxJ9tunw5Lru4xAZFg":{"text":"Julian V.'s review hits the nail on the head.  I think I'm his alter-foodie-ego here, even","useful":0,"cool":0},"v43xCeMp4SeVqXmHN-EvwA":{"text":"One of my favs in New Orleans ...  Long ago when I lived in Uptown, I used to work at The ","useful":1,"cool":0},"DMsOqd1aR54HFMLgQt-oDw":{"text":"First, the food. Everything was excellent, prepared perfectly, absolutely delicious.\n\nThe ","useful":0,"cool":0},"0rig80-fvWWdA3y-lCKihg":{"text":"Awesome food, super fun atmosphere, great waitstaff. My wife and I made Galatoire's our bi","useful":0,"cool":0},"r0po5oybI_zSsEymxPxjjw":{"text":"I really wanted to like it but was generally disappointed in the food. Our group of eight ","useful":0,"cool":0},"b46hl_88kdua7AeJMJF31g":{"text":"I still have cravings to thes day (over 6 years have past) for their shrimp canape and oys","useful":0,"cool":0},"6VtDpXWI64HDcrYPYo1fMw":{"text":"I vaguely remember eating here, but that's just because of the 190 Antifreeze I got down B","useful":1,"cool":1},"dCmFhZv0-rDr0qHJZeYFGA":{"text":"Disappointed --will not be back ever\n\nAfter eating here, we have decided to try to find pl","useful":1,"cool":0},"RKz7WCYXFP3QlXjT7URl2A":{"text":"So by now you should get why you come here... it's for the atmosphere, for the classic for","useful":3,"cool":0},"YKznxrjSvQtH_pF_jpwiCg":{"text":"Historic restaurant where very little has changed, but that is not necessarily a bad thing","useful":1,"cool":1},"EZqXpbszmlW2gYZ_U0ikMw":{"text":"\"My favorite place on bourbon st.\"\nReviewed November 21, 2011\nThis in not a new trendy pla","useful":0,"cool":0},"s1KsImi-sD5thdHsQw7m2A":{"text":"Very much a classic. Well worth the experience. Food was well prepared and on-point. The s","useful":0,"cool":0},"W1Pb9A2ja6iu_PkI-fnCPQ":{"text":"Our party of four waited in the bar for two hours and we were never seated.  This was afte","useful":0,"cool":0},"W1GrgMDVVIz0XlG9KQbqkw":{"text":"My family just experienced an evening we will never forget. Thanks to Shannon and the enti","useful":0,"cool":1},"xSb7tjtw7DtCooE26fe48w":{"text":"OMG, Friday lunch at Galatoire's is the best. We ate upstairs and took our time....it was ","useful":0,"cool":0},"-Xmk-6bTff44yOiUjUfLXw":{"text":"For decades, my mother has been telling me about the fine food and service at Galatoire's,","useful":0,"cool":0},"-x4R9VIFucHqjFGTjFDSEw":{"text":"Galatoire's New Orleans, LA\nOn the recommendation of a local we ate downstairs, probably w","useful":1,"cool":0},"m_7flP84VoKHyEqzDSIVPg":{"text":"Food was good and prepared perfectly. Service was good. Overall, this was a good place to ","useful":0,"cool":0},"JSYo4tWJEIHB8cuXw3xhEg":{"text":"My sister and I were treated like queens!  Great food and impeccable service.  Best in NOL","useful":0,"cool":0},"4HtsFoaDaZy2pIVT_YrLJg":{"text":"I heard great reviews on this place but was disappointed in the food. It was just \"ok\".\n\nB","useful":1,"cool":0},"oBppUckBB_13jPhzkZ7vcA":{"text":"Galatoire's had good service and a busy upscale ambience. However, compared to other food ","useful":0,"cool":0},"UCQahCkoSlvaeFfNti6b_Q":{"text":"Galatoire's is a shrine- a local institution for 106 years.  I've never a bad meal over ye","useful":0,"cool":1},"_3wTYDH19-djQ8i-tbHjug":{"text":"They had plymouth gin which i had never had and loved! It was a gorgeous restaurant! Loved","useful":1,"cool":0},"YQiKbhQES8bCjMHd2MUlGQ":{"text":"I have often heard how amazing this restaurant is and about it's rich history. My husband ","useful":0,"cool":0},"LhPIBFSgAUAeCw3a_hiGCg":{"text":"Friday lunch at Galatoire's is a New Orleans tradition.\n\nWe dined on the crabmeat stuffed ","useful":0,"cool":0},"-AaXIU1wGtiP0g97Zn7tuA":{"text":"The service here was amazing!  The red fish was prepared perfectly.  The environment was e","useful":3,"cool":0},"HfAkA0dfHNAhKf0M28H-3w":{"text":"Maja was a fantastic server and guide for a wonderful meal! Really enjoyed the blackened r","useful":0,"cool":0},"gBvagFnlGLopoQssHaF28g":{"text":"This is the ultimate New Orleans traditional dining experience, where the \"who's who\" of l","useful":1,"cool":0},"GboQ9DuIipcqD7kPBxdC8Q":{"text":"First, I love the place. When we go we want to sit in the traditional main dining room. If","useful":0,"cool":0},"iZnFEhUQ7fPiH6AcOGCWbw":{"text":"This was definitely an amazing fine-dining experience.  Everything we had was cooked perfe","useful":0,"cool":0},"rSZx9h_r2Kknb_eKArIvTQ":{"text":"I actually loved dining here last September. First of all, the food is excellent. I'm a tr","useful":2,"cool":1},"m6C9LOkrB7d2n-c5kQBfow":{"text":"Go for the incredible bread if nothing else!!! Seriously the best bread I've had in my ent","useful":0,"cool":0},"0Ziq0L913yujF5znhkRkmA":{"text":"One of the greatest restaurants in the US today ! It's that simple. I have traveled the co","useful":3,"cool":1},"8uSh8a-WCk7g-D-l9BOMow":{"text":"We went to celebrate my wife's birthday and overall the experience was good. Started with ","useful":0,"cool":0},"cmVPl2Dp4q9nbUwfsokNWQ":{"text":"This place is ok. I got the stuffed eggplant. I think that meant the eggplant would be stu","useful":1,"cool":0},"Ze2QHDje85pxwxswmWLrng":{"text":"Possibly the best restaurant in New Orleans. This is the kind of place you go and tell you","useful":0,"cool":0},"abNwov28TGVBamJLNP03Qg":{"text":"Good ambience, great service - our waiter was awesome! And of course the food was amazing.","useful":0,"cool":0},"Sw2C0dbEnpK5zvHCaAAthA":{"text":"Great Turtle Soup, terrific hot fried eggplant dipped in Bernaise, & wonderful seafood gum","useful":1,"cool":1},"tNlZR7Gi_c125VSdmVV0PQ":{"text":"At first we tried the bar next door. It was much quieter. However, the bar tender told us ","useful":0,"cool":0},"SeW1XciuoJTmVNxGmU6pSQ":{"text":"Oddly enough, this fancy restaurant is located right on Bourbon Street. It's generally res","useful":3,"cool":3},"hyIgoVVhO84la9axtobFyQ":{"text":"Favorite restaurant in new Orleans. Great old fashions (not too sweet) and the fried soft-","useful":0,"cool":0},"vyLKiZn6GfBX-BxDLBoW3g":{"text":"One of my favorite NOLA restaurants. My husband is not a big fan of the jacket requirement","useful":0,"cool":0},"PA7FW_0gZ2vkV3DRWo9myQ":{"text":"Hands down one of the top 5 dishes I've ever eaten. The only thing I would change is that ","useful":0,"cool":0},"NB9sivuVwRwsnA9FienlkA":{"text":"You've got to be crazy to go here. Way outdated, bad food and servers who same to be from ","useful":0,"cool":0},"FiJV_Z7TBPcu8JrlJ4pwNg":{"text":"I was disappointed in this restaurant.  The service was ok but nothing special.  The food ","useful":0,"cool":0},"3NPRrebbi9Uc01qN5Q-VwQ":{"text":"Delicious!!!\n\nGalatoire's is a New Orleans staple and I am so glad I was able to get in.  ","useful":3,"cool":0},"x59t13fCQPR8EvQAVw7zKA":{"text":"Forget this place! Staff is condescending and just plain rude! Food is marginal at best! N","useful":0,"cool":0},"W4ghILYQES6Segf-yugKtQ":{"text":"A New Orleans I institution whose reputation exceeds its reality. The food is good - not w","useful":1,"cool":0},"ApJeDjK-EmG0tGuReVJISg":{"text":"Galatoire's gets a solid five stars.  That is partly the food, and partly because what you","useful":8,"cool":2},"2qZMMYPDMIJyL4J3f18k9Q":{"text":"Totally lived up to our expectations. Food was excellent as was the service. Would definit","useful":1,"cool":0},"-A1bAD9LEbhcKdilL4XqDA":{"text":"I had A LOT OF FUN eating at Galatoire's:  it was an unexpected mix of old school formalit","useful":1,"cool":0},"HrSjRnDtcT2uuDPyyncZLw":{"text":"Best new bar.  Was here on opening night watching the SuperBowl.  Great food and great tim","useful":0,"cool":0},"_FRxlMeMIkpa8eLYe10DCw":{"text":"After a horrendous meal the night before at Antoine's we were happy to experience a nice m","useful":2,"cool":1},"3QivFDRHONY_cZ1fxC0cbA":{"text":"Everything at Galatoires is wonderful- food, service, ambiance. Had a pre dinner drink at ","useful":0,"cool":0},"o2BYTVaRmm9aGng_-djrDg":{"text":"We went early at 5PM and got an upstairs table.   It was quiet, comfortable and the servic","useful":0,"cool":0},"XfZ1ShaNKetkE97CYNNSzg":{"text":"Galatoire's is a New Orleans institution. Funny to think when they opened in 1905, they ha","useful":7,"cool":5},"GIxCLkMN-5lO1RTMHGG5PA":{"text":"I recently made my first visit to New Orleans, and was excited to, well--eat. Nothing is m","useful":3,"cool":0},"LhWFYnQmp412YaR_wr-_Gg":{"text":"Horrible service. 20 min waiting  for 3 beers, 45 min for the food. The server was not wil","useful":4,"cool":0},"ApAATdHcJjIO7jZpUG7agw":{"text":"Galatoire's charm is the first thing that gets you. The old school establishment, decors a","useful":0,"cool":0},"Y_VDoCXDi4cAigbm3728Lg":{"text":"Forget the bit about \"we ate  a little bacon and we ate a little beans.\"  That's a myth.  ","useful":5,"cool":2},"DJ4C0dGP39eicXB33xCrQA":{"text":"This restaurant did not live up to its reputation. I went with 4 colleagues there for lunc","useful":0,"cool":0},"quTz0Wbq763u6O5_x9QKOw":{"text":"We had our rehearsal supper for our son's wedding in their upstairs banquet facility.  Whi","useful":0,"cool":0},"NHDZYiOgWz11b9kHYU5luA":{"text":"Reasonably priced for the expensive atmosphere. Finally able to get dressed up and go out!","useful":2,"cool":0},"HLHICr6LjkvUtTqxe48_gA":{"text":"Started off the new year with Friday brunch at Galatoire's. I made reservations one month ","useful":0,"cool":2},"21IgcCczYsJsWFk6tILDWw":{"text":"The food really is about as good as I've tasted in Louisiana, and there is a decent select","useful":0,"cool":0},"FFjGVblfbFsVieHoHVQ43w":{"text":"Ask for John Fontenot. Order the turtle soup. Tell him that after the turtle soup you woul","useful":0,"cool":0},"tKdLNDx8PJvWJHQh4pv84w":{"text":"The food, the service, the experiences are all worth it at Galatoire's.  You will be treat","useful":0,"cool":0},"o-wT8KhL7VgUEjwIpVEgng":{"text":"Late lunch on Friday is always great for the atmosphere. Gotta sit downstairs though. If y","useful":0,"cool":0},"N0LswDl7T-TWJHaXkfLaWA":{"text":"This restaurant is the same as it was almost 20 years ago when we first visited it. Had th","useful":0,"cool":0},"Okdj3sk8dPwiFvkyN3UsNw":{"text":"The experience here was very solid, with a special trout dish with verblanc sauce that was","useful":0,"cool":0},"QhxP0KvUG7CCNKCVaWtmzg":{"text":"There are many differing opinions out there on Galatoire's, so I decided to give it a try,","useful":5,"cool":2},"o4e2db7mNago4BAkdWntbg":{"text":"Since we started our trip off at a classic creole restaurant (Antoine's) we thought it wou","useful":3,"cool":1},"oOWdPVt3HFLzqa8guS-0qw":{"text":"At the risk of being tarred and feathered by all the other yelpers who love this place, I ","useful":5,"cool":1},"Cc157ksWLovfQ3chRS2tIQ":{"text":"I just came back from Galatoire's for my company Christmas lunch and I must say, Galatoire","useful":7,"cool":0},"WEuM3nAVJm5GUUUZaGR16Q":{"text":"Friday lunch at Galatoire's is a New Orleans institution, and one which has opened to welc","useful":4,"cool":3},"HsUuYzGTfIEGk3VbMSi_eA":{"text":"Whether a citizen of the Crescent City or a visitor this is a restaurant to visit and take","useful":6,"cool":2},"yCA8EZOqWBQ3K69P0HF3Qg":{"text":"I love Galatoires. It is one of those real classic restaurants that makes you feel like yo","useful":0,"cool":0},"jnmJQ6bDfjG4_enrRr8JKA":{"text":"Amazing food and nice environment full of history. This restaurant has existed since 1905 ","useful":0,"cool":0},"YGpA8dkDwUSOIKClw6CZaw":{"text":"We went here because we knew the reputation of this French Quarter restaurant.  We were so","useful":4,"cool":1},"Tux4Qy9wRDggVvrg5V4kGw":{"text":"Went on. Busy Friday for a birthday lunch. Everyone had jackets although not required unti","useful":0,"cool":0},"FLj55PUYF5a_F7Pig6WY7g":{"text":"June 24-28, I attended the American Library Assoc. Conference and ate my way through the w","useful":4,"cool":1},"fGdU7b3tAxlCY73-NbcVMg":{"text":"Terrible. My husband likened the atmosphere to the chow hall in the Army. Our waiter was e","useful":2,"cool":0},"KbiPVyQA5kloj_tOYBeEpA":{"text":"Had a wonderful meal at Galatoire's we had the duck breast on the revillon menu that is of","useful":0,"cool":0},"qUWByiZuEKxUykLbAn2pFw":{"text":"Looking for a last night in NOLA meal, we were able to make dinner reservations on OpenTab","useful":0,"cool":0},"flk9peKF3n7g0yMjm_JAIA":{"text":"A little cramped and a little loud, but the service was very good and the food was excelle","useful":0,"cool":0},"uxEPK_w9__STrSj0ejka4Q":{"text":"Over-rated. Plain and simple. \n\nIt took two people to seat us at a table, a separate one t","useful":1,"cool":0},"j8EdTQKUG_-MxHdcleb-pg":{"text":"First off, if you're black or under 35 or both, do not go. I went with my husband, daughte","useful":1,"cool":0},"ljG_IaaV3b7N5H40vvAFlA":{"text":"The food was good but the noise was torture. We couldn't wait to escape to the quiet of Bo","useful":1,"cool":0},"9QlrVMN3hFgsSO3kNXlMwg":{"text":"Went here for a friend's birthday lunch on Valentine's Day. I did the prix fixe menu. I or","useful":1,"cool":1},"6M6EF0d1VSNqmbAClcdtaw":{"text":"Tip about the dress code: it has more to do with profiling than your actual clothing. My h","useful":0,"cool":0},"iEmjy-1XUEI76v_veHPtuQ":{"text":"Best restaurant I tried in NOLA...I got the stuffed eggplant, and it's better than it soun","useful":0,"cool":0},"JKoWPUS6yy722MfEAvuxHA":{"text":"There's not much I can say to help you understand the allure of a Friday lunch at Galatoir","useful":0,"cool":0},"ktVOAXtXeL92nABgftczrw":{"text":"This place has been around forever and is classic upscale dining in New Orleans.  The tuxe","useful":1,"cool":1},"a2mi95CRMOidOCRvrHO9eg":{"text":"This place is super classy. Don't be fooled by the Bourbon Street address. \nCame here for ","useful":1,"cool":0},"_Aujg0zl6cZCYbgZA2diMQ":{"text":"I ordered a steak medium rare, it came out well done. Our server, who was genuinely lovely","useful":0,"cool":0},"eozozcBPcCcCZtCrPyZyhw":{"text":"We had lunch at Galatoires when we were in NOLA, and it was by far my favorite meal of our","useful":3,"cool":1},"X_RTdDO3aRPa_mq9uMCyqw":{"text":"We have 9:30 flight back to Dallas and had an early dinner at Galatoire's.  Our waiter Tim","useful":0,"cool":0},"4wUfC7VG3FQZr98Ri3skgA":{"text":"We were lucky to get a table on a Sunday night as we reserved a week in advance.  We order","useful":1,"cool":0},"OFGE1t38wJ-PiTUchGzF6w":{"text":"Don't Waist Your Time. Snooty Faloozy wanna be.  \n\nOf the seven or eight steak houses I've","useful":0,"cool":0},"d9DwMiHJX61J0q82jiWagw":{"text":"We went on a Saturday evening of a holiday weekend and this place was absolutely packed! W","useful":1,"cool":0},"felimKRZUfxafQ7hA2H_Rg":{"text":"Worst food I ever had in New Orleans. Got two appetizers the crab was soaked in hollandais","useful":0,"cool":0},"kD1Ec5cZg8a3sCK7CaO-2Q":{"text":"Galatoire's on a Friday is no ordinary lunch, it's a cultural event that you must experien","useful":13,"cool":13},"4lrsdA3PvBH7ThJErDj2sA":{"text":"Went with a bachelorette party. Ralph was our waiter and he did an excellent job. He was a","useful":0,"cool":0},"s2CF2X9ed2jtfsUUXcKNpQ":{"text":"Galatoire's was recommended for a fine restaurant experience in NÖ. We were seated out of ","useful":0,"cool":0},"OQoiHIJ910DFmNWvZrvY0w":{"text":"This restaurant was so delish! Not sure as to why it has 3.5 stars! This fancy nook in the","useful":0,"cool":0},"BP0vcXt4B-jUytxvqJE99w":{"text":"My girlfriends and I had dinner at Galatoire's this past weekend as part of bachelorette c","useful":1,"cool":0},"kRKJLHr1Sd7ml_z-vKE2dQ":{"text":"My experience at Galatoire's was incredibly disappointing. My girlfriend and I came into t","useful":1,"cool":1},"F3JOUc4oo0XziWhWKK5U6w":{"text":"Flying into New Orleans for Jazz Fest, my friend and I wanted a traditional \"welcome to Ne","useful":1,"cool":1},"0FsZrLUn3Kp9LMy6gMZm2w":{"text":"We dined here for lunch as a party of four 9/2/18. The food was delicious and our server, ","useful":0,"cool":0},"GtAmBVB61eRM2uEL0m5UGQ":{"text":"On Bourbon St. Atmosphere wasn't great. Had to wear coat (provided by them). Cramped for s","useful":0,"cool":0},"7T4Tn9sciOxOjzuSpE_PaQ":{"text":"One of the oldest restaurants in the New Orleans. Went with my family while on vacation. T","useful":0,"cool":0},"fEQNiCE1IToWCyfmkwutSQ":{"text":"Very snobby, pretentious vibe and the gentleman attending the front desk was an inadequate","useful":0,"cool":0},"pkh0jb5-mbNbXBgjx6ORiQ":{"text":"Galatoire's is a New Orleans institution and the final stop of our culinary adventure trip","useful":0,"cool":0},"E9OXtgh2TxLVa3vR7nnIKA":{"text":"Special trip to Galatoire's due to the reputation and yet we left unbelievably disappointe","useful":0,"cool":0},"xgQVpDifn48-ri3ulObmpA":{"text":"We came here for dinner on New Years' Eve without a reservation, which wasn't the smartest","useful":3,"cool":2},"dr1Y4Zgv2h4DVPx07CV7mA":{"text":"Best meal I've ever eaten. Stuffed eggplant and banana bread pudding. Incredible food. Our","useful":0,"cool":0},"rHS9BDSpPgfd93FYvCg7-w":{"text":"Excellent French-inspired New Orleans fare. Friendly and experienced staff (98% of the tim","useful":1,"cool":1},"G8iPUHEfu3wjT9BuYFgewg":{"text":"Obviously one of the best places to eat, especially if you love French fare. But no one sh","useful":1,"cool":1},"CO80ot1jy6SrQ-_zC9gCLg":{"text":"Great upscale dining experience. We came here for our first anniversary. Had a reservation","useful":0,"cool":0},"C26qZSUSb3v6IpdtmYj2pg":{"text":"It was a nice experience to dine in french quarter oldest restaurant . Our server was nice","useful":0,"cool":0},"meNd683hRVreAg8BVTT_fg":{"text":"Had an amazing brunch/lunch experience here with our waiter Relph. He had great suggestion","useful":0,"cool":0},"IMwW_mrzvBz9yBrftv7R2A":{"text":"The place was crowded, but still managed to seat our party.  Excellent food, we had filets","useful":0,"cool":0},"PryLMKZXE0EQLxejGwPHSg":{"text":"We really enjoyed this old New Orleans French-Creole restaurant. I think we hit every high","useful":0,"cool":0},"d-ybpQiZS0PnjrXb9TvShQ":{"text":"Gentlemen are required to wear dinner jackets but they do not tell you that it's because t","useful":0,"cool":0},"e1wWIWCOfo1RGDenf05bnQ":{"text":"My redfish, prepared blackened and topped with Crab Lyonne, was so delicious I want sneak ","useful":2,"cool":1},"YSnNqZEaiG9L4cFud6W-Zg":{"text":"Let down.  Old school - we were asked if we had a preference in our waiter, wow.\n\nFood is ","useful":0,"cool":0},"7He1cZVg_Ua_9Vvu2-N-Xg":{"text":"snooty. there's one way to inform people of their dress code in a nice, respectful way. th","useful":1,"cool":0},"ePewLK8uoZFqBFxOznjkKA":{"text":"Red fish everything is amazing  we travel a lot maybe my favorite restaurant in the world ","useful":0,"cool":2},"2ey_RlPr_4pZy2rzGYePwg":{"text":"It's more a touristy place than a good restaurant. \nTried the crab salad and omelet and th","useful":1,"cool":0},"EZGx7Yo9zIXvWm22ety-3A":{"text":"This is the BEST breakfast restaurant in New Orleans. And Don the server offered the best ","useful":0,"cool":0},"clOsAElsMwCpYDUAJ1hjlA":{"text":"I did not want to eat here as they have a dress code, but my spouse wanted to.  It's NOLA.","useful":12,"cool":5},"Irx3WgoC6Wnx0LGnAF4_uw":{"text":"Let me first begin with the staff. They're outstanding. All of them. Everyone was so sweet","useful":1,"cool":0},"VWJ4eUUB_OTKZmRKkObmAA":{"text":"What can one say about a near perfect 3 hour lunch in one of the great restaurants in this","useful":1,"cool":1},"e7NehD8wmk6-eo9xPgov3Q":{"text":"I had the most amazing time at Galatoire's. From the sit down process to ordering, every p","useful":0,"cool":0},"gY-6Q6voq2dqhXRt-qd9-g":{"text":"It was time to check the box on another of NOLA's Grand Dames, and after reading a recent ","useful":2,"cool":0},"0RZsysvMQ4nv6h7yZSePgg":{"text":"Galatoire's was such a neat experience. It's like civilized chaos. They open the doors at ","useful":2,"cool":2},"3bMpgp4DxeWZUxztZkz-RA":{"text":"We ate at the bar next door due to not being dressed appropriately (shorts).  We were the ","useful":0,"cool":0},"JJkUL9Rddo5UetJiKR_n2A":{"text":"Great food, amazing selection and old school drinks.  This is a classy place requiring a s","useful":2,"cool":2},"ZF79vZTbuKFqVWtqmYIeuQ":{"text":"Galatoire's is the way it was and the way it still is.  We had no reservations.. Walked in","useful":1,"cool":1},"CKXjTPjrvnbDKItjFkG2uQ":{"text":"The steak restaurant is this good as it gets LA Chicago New York can always get a great me","useful":0,"cool":0},"giYPf2gdKhA3Q1wyQZT3Pg":{"text":"Wednesday night I dined at Galatoire's. I like that they make the men wear a jacket. I fin","useful":0,"cool":0},"sMYkuZsHvrpWzdAQKEcjEw":{"text":"Steak was wonderful! (Filet and New York strip) potatoes au Gratin were AWFUL I can make b","useful":0,"cool":0},"pNWjeI3ZLnduv0_xIW2pbw":{"text":"As one would expect, Galatoire's was pricey, predictable, and pretentious.  HOWEVER, it wa","useful":6,"cool":6},"xOM3EyEMq3ACsa8GJJzFQg":{"text":"Like my welcome back from Napoleon House, Galatoire's earns high marks for my recent New O","useful":0,"cool":0},"-MrMjoi65Aaj7vRApzmU2w":{"text":"A very wonderful meal in a vacation week where we had a lot of them. We've never been here","useful":1,"cool":0},"KubrzoMwuJsuNxdHmhZ1Lw":{"text":"This review is for a large group (80 people) that used the private entertaining room upsta","useful":2,"cool":0},"1jbNWk2IhrfMjTYmxDlMMQ":{"text":"Corey is the worst server we have ever had. We have been going to Galatoires for many year","useful":2,"cool":0},"s8K5kewEiT1Q7Wr9ZdBwAQ":{"text":"I was really disappointed by this restaurant. It had good reviews and was recommended by s","useful":0,"cool":0},"T-2J1DaLmh-PVBrkJKFmPg":{"text":"It was outstanding!!!  I had the lemon fish topped with Crabmeat,\nand the cream spinach fo","useful":0,"cool":0},"a1K2m7p2bT6g-BP7b6pbMw":{"text":"Probably the only restaurant I regret going to...given the many amazing options in the are","useful":0,"cool":1},"rTHeLwIANt98Ascscwkfxg":{"text":"This place is a long in the tooth joke.   The host was a condescending douche canoe and ve","useful":0,"cool":0},"dtHmMRnXM0Krk41BfB_Ovg":{"text":"This was our first visit in several years. The experience did not meet expectations based ","useful":0,"cool":0},"8i6v6lEFahqTDikFpmBXOA":{"text":"Never had a lunch like it. It is a party in a formal setting. They had a line @ 9:15amd I ","useful":0,"cool":0},"OHza14piH2OOGXymuzQUFw":{"text":"My favorite place in the world to get a steak, I drive 800 miles for the privilege in fact","useful":0,"cool":0},"aOfIm8pwEdmqTusIiPwZYQ":{"text":"Nothing memorable. Tasteless dumbed down food for tourists. Wouldn't go again unless I did","useful":1,"cool":0},"KxeG9UVe_zeVV3-i4uOfwA":{"text":"This restaurant is as much a part of French quarter as Bourbon Street. The service is impe","useful":0,"cool":0},"PXjOH2K2w35DjiYypUQJBw":{"text":"A little disappointing overall. After being seated we waited close to 15 minutes before th","useful":0,"cool":0},"-DSSW8YBU7MWSTAfX9WJeA":{"text":"This is the crown jewel of New Orleans fine dining! It's in a league all of it's own. Ever","useful":0,"cool":1},"IjXKhL3ZjfsrkdTPhkddGA":{"text":"Very adorable old timey New Orleans in here, with the craziness of bourbon street out ther","useful":0,"cool":0},"gy8Sp5uhBcUA_0Mj9MYyZg":{"text":"Galatoire's is the quintessential old-line New Orleans restaurant, committed to culinary e","useful":0,"cool":0},"rso4vmqmGkLIDhJt5EuroQ":{"text":"As we get to NOLA maybe only once a year on the way to or from Fort Worth to Pensacola I f","useful":4,"cool":4},"thZNMXTZoQkEXX8BlVu_rw":{"text":"I came here in December 2015 because I had wanted to eat at Green Goddess, but they had fl","useful":0,"cool":0},"s-DTQPwEi9xac9W7NRy3HQ":{"text":"I was talked out of this for our big bachelor party dinner so we came here on day one with","useful":0,"cool":0},"YQe67Zov6ZrAd8H6ZfnWhw":{"text":"Of course ... NOLA standard of dining excellence ... never disappointed here ... there are","useful":0,"cool":0},"PXch1RJzkywSw9H21ZS7sQ":{"text":"The mice was cool, but the random lady who came in just to be nosey was not. Food was blan","useful":0,"cool":0},"cnLM9JOuVe6Eafx-9fcVuQ":{"text":"Ordered:\nTurtle soup\nGalatoire Goute (Crab Maison + Shrimp Remoulade) \nLemon fish with Cra","useful":1,"cool":0},"COISj8_Vkp-UvshAnBUTIg":{"text":"Excellent. One of the best places in NOLA to eat a lovely dinner with drinks and enjoy you","useful":0,"cool":0},"XLX34JXs2VPwppCeMLhQFw":{"text":"My husband and I went to Galatoire's yesterday, Valentines Day. The staff was entirely att","useful":1,"cool":0},"3wg5-R_7zwr6liWvtxqzzA":{"text":"We had a reservation at 6pm on a Friday and ended up waiting for an hour, which was really","useful":2,"cool":1},"XySXIdwB1z7Ho16wZpWayg":{"text":"What a complete letdown ..... from the minute we walked in the staff acted as though we we","useful":1,"cool":0},"iTRHcI142un807Q19KC-FQ":{"text":"Went there for a Friday lunch, my friend paid for someone to wait in line to get us a tabl","useful":1,"cool":0},"IBkeNK9DpPqi2s118A2lbw":{"text":"First of all , we live just 4 blocks from this restaurant , and this is the first time her","useful":0,"cool":0},"1jXyi5WGU_Kfkl4UrE1Rrw":{"text":"I give it 5 stars for the ambiance and service and 3 stars for the food so we will average","useful":4,"cool":1},"tE-bsNGylnvensifeBiW9Q":{"text":"One of the worst meals I've had in years. We made reservations over Mardi Gras because of ","useful":0,"cool":0},"sZVBiAJSCv8nAcmSCzRZBw":{"text":"I wanted to like Galatoire's, I really did, but I knew it was going to be hard to enjoy my","useful":0,"cool":0},"k9YAbL4FkRKegklV4FPfMA":{"text":"The atmosphere is old style NOLA so interesting and the food is ok but the menu is so date","useful":0,"cool":0},"8rhwU3t2h-5Kr960W5py2g":{"text":"My family has been enjoying Galatoire's for special occasion going on 3 generations now. B","useful":8,"cool":2},"5V4DYkMm1dnx9Ew-DXJ9iA":{"text":"Awesome experience... great feel to a classic Bourbon Street place that you can tell has h","useful":0,"cool":1},"HO9Uoth_dRpqGmutUaoXjw":{"text":"Very interesting dynamic in this restaurant. Dress code is enforced and the atmosphere is ","useful":2,"cool":1},"_jSRaFryjIqKBG6shJKnww":{"text":"Great old line New Orleans restaurant totally different from the others in that they appea","useful":0,"cool":1},"-ja-v37HijUFN2PcA1ptcw":{"text":"Food was great. Expensive but it was fantastic... my only rub with this place was the fact","useful":0,"cool":0},"JtCVm8-7efU1KN8Xk57VoQ":{"text":"There are 2 places that I absolutely must visit when I go to New Orleans, and Galatoire's ","useful":0,"cool":0},"n2JriqpPLyUNTOJ3JRYTkg":{"text":"Had dinner reservations here last night. The noise level was so high, tables so close toge","useful":3,"cool":0},"pqvYKH-NRRJyhMSp9jitHA":{"text":"Food was wonderful. Service was outstanding. I ordered a petite filet mignon medium rare w","useful":0,"cool":0},"_k4PVwkRacMdESRKKv9hMA":{"text":"I wasn't very hungry when I came to Galatoire's, but the only reason I decided to visit th","useful":0,"cool":0},"jx4tVgQKEW1-saV0zFleeg":{"text":"I am giving Galatoire's 3 stars because of out waiter. Otherwise I might have even given a","useful":1,"cool":3},"lvGlYsqim3HKXeQD3sMcOw":{"text":"It has always been on my bucket list to do Friday's lunch. We did the Christmas lunch firs","useful":0,"cool":0},"1djPql5llJSd6Pyr-0S9Pw":{"text":"OMG...what can I say about the Galatoire's experience??? Let me say that my Friday started","useful":0,"cool":0},"vw_YJTFjObGWtSxtM7COSA":{"text":"We chose this restaurant for the \"birthday dinner\" during a recent weekend gathering of si","useful":1,"cool":1},"KuSnsWVTfIY5rPjrSxhfHg":{"text":"Wonderful evening. Food was fabulous and service was impeccable. The red drum was amazing.","useful":0,"cool":0},"z8TIz7lyXfa31TNNik9o8w":{"text":"Friday lunch at Galatoire's is a magical thing... if you can arrive early enough to get se","useful":4,"cool":4},"JIGkdf0tDwiI2G7UVzQaeQ":{"text":"HA ha...she didn't know what head cheese was till it arrived! I took the munchkin there fo","useful":4,"cool":3},"8qBmNBmNPk8gdT97YER6XQ":{"text":"Save your dining dollars for something better.\n\nWe reserved our table 60 days in advance a","useful":1,"cool":0},"3BTtt8Hxo5afCws7btNsMA":{"text":"Made reservation online and was seated promptly upon arriving. \n\nWe had two servers tag-te","useful":0,"cool":0},"0B8uAOfVScQb0SgLJ2GBUQ":{"text":"Very disappointed in our visit.  Our waiter was lifeless....  We had been told, jackets re","useful":2,"cool":0},"h79PjXI4JzQG-7tHeJsXAg":{"text":"The food was very well prepared here, especially the seafood dishes - they really know how","useful":1,"cool":0},"GZKTSnHSHK5_V13Uet_Rdg":{"text":"We enjoyed a awesome lunch at this really cool restaurant on Bourbon Street this afternoon","useful":2,"cool":3},"OvkTTFTBDz8MAolbJaEvcg":{"text":"We were here for Valentine's Day. Our server did his best to get to us. We had fried eggpl","useful":0,"cool":0},"h2xS1TvZ4cZWXsU8EY_Kyw":{"text":"If you want to dine in the quintessential NOLA fashion, this is the place.  I did not expe","useful":0,"cool":2},"DiASGl1KRzk9Ns1SABd60A":{"text":"Was hyped up, but the food was sub par and the service was horrific -- probably since we h","useful":3,"cool":0},"vRYHc_LJ8RKnbkjpkAJLYQ":{"text":"I ended up at Galatorie's for a late dinner, when it became apparent that getting a last-m","useful":0,"cool":0},"N_ZkkA6QnQtyQLy_Zacyjg":{"text":"Nice staff. Okay atmosphere. Food wasn't anything special. Probably won't go back. Also ha","useful":0,"cool":0},"R3q7HpqzKJeHlXiGsZlZQA":{"text":"Waited too long to be acknowledged so we could order a drink. I was advised to order a chi","useful":0,"cool":0},"Zi7doztIIA6mpzGxT40t3Q":{"text":"Friday lunch, Galatoire's is the place to be! Nestled amongst trash and trashy strip clubs","useful":1,"cool":1},"nAv30S9HmyJyXU22lyVkJA":{"text":"I had lunch with friends last Thursday that lasted thru dinner, I thought that only happen","useful":10,"cool":9},"5evqE6zFk6E53ir1M1lSAQ":{"text":"Very old school, jacket only, establishment in the heart of French Quarter.   We arrived o","useful":0,"cool":0},"O-VQQiHjL8ES-LCR8JHCNg":{"text":"Roach in coffee!!!! \nI went for brunch and asked for decaf. The cup was clean. They poured","useful":0,"cool":0},"4L2c8DwEyk9ugO6KXy9BZw":{"text":"First time back since the 90's and was so disappointed. My fish and asparagus came out col","useful":0,"cool":0},"dqwqhsKOLuBnKKfTqmwDzg":{"text":"Very disappointed. We went here knowing that it was more of an upscale restaurant, but bei","useful":0,"cool":0},"aSjV0QYqj-aPJezzKTD0FQ":{"text":"I am a big fan of Galatoire's. It was a very nice experience. I am glad that I dined there","useful":1,"cool":0},"-eI_sgZ7ukalSbRho2Srww":{"text":"This was my first time eating at Galatoire's our waiter was on point, when I asked him for","useful":0,"cool":0},"mBVXnadoRuqvknZPe6mE4Q":{"text":"Really glad we made here. We were a group of 8, so there was as much sharing. :) I don't r","useful":3,"cool":0},"mrDjepRsOsHi9wsnFce5Ag":{"text":"Delicious, as always. This time around the service was a bit rocky - starting with super r","useful":0,"cool":0},"A1BehBE3XBrm8m1nj-UrkA":{"text":"I went here for lunch today and had an awesome experience. The host was very friendly and ","useful":0,"cool":0},"xZgE4YC2JflG6h0hE5AL5Q":{"text":"Simply perfect Old New Orleans classy food and service.\n\nThis is one of the top flight pla","useful":6,"cool":5},"04-slW1EloE2P63WioCMwQ":{"text":"Came here for dinner on a Saturday evening. The food is bland. There is just no other word","useful":0,"cool":0},"f9pp2oqpBbDrxx_orD98Dw":{"text":"ONE OF NEW ORLEANS' BEST\nThis classic restaurant is one you don't want to miss in your vis","useful":0,"cool":0},"WEDq7gZEZXDIMM_DpSxIXg":{"text":"One of the best meals I had during my time at New Orleans! The shrimp and crabmeat appetiz","useful":0,"cool":0},"BMRtMECIKj9C7sjRoW50eA":{"text":"I had the most wonderful 70th birthday weekend in my favorite place, and my choices includ","useful":0,"cool":0},"_raKnHPK4TmaD_8jDimYOw":{"text":"We ate Christmas Eve dinner here 12/24/19.  Spent 6 days in New Orleans with some great fo","useful":0,"cool":0},"7UhCl8H3wJ7eS85NQsPUQQ":{"text":"Suiting from LA, came to eat here. Service and ambience was good. The Oysters Rockefeller ","useful":0,"cool":0},"6apOJUTXry8DazYeWdtWxw":{"text":"Overrated. I was incredibly disappointed with every bit of this restaurant. We asked our w","useful":11,"cool":1},"8oiHuJiyKHgFoJpsePPcqg":{"text":"Galatiore's (pronounced gal-et-twahs in my mind) is one of my absolute favorite fancy-schm","useful":5,"cool":6},"N_tZHayC6KNRFLnLTJqqAA":{"text":"This is on our must do list for our annual New Orleans visit, just such a fine old world d","useful":0,"cool":0},"e42NOwRKaJw30BJT69SXWA":{"text":"This is restaurant has a strict dress code. Me and my friend decided to go based on a frie","useful":0,"cool":0},"PxIwxetU6CIQ1TChE5flLQ":{"text":"Yummy!  I hate trout, but the Trout Amandine smothered in browned butter turned me around.","useful":0,"cool":0},"j0jRUEaVWRRcSwOQEeg5Cg":{"text":"where do i begin with galatoires.....this place is special...it is classic southern....it ","useful":3,"cool":1},"57Vq1mbMwOAsGnb4r3cljA":{"text":"Located directly on Bourbon Street, this is a \"Don't Miss\" spot if you are in town. We got","useful":3,"cool":3},"jJLBv-AudSQaNFmaUovwXg":{"text":"GeeZ.  I was disappointed.  Loud. Crowded. Too bright.  Maybe my expectations were far too","useful":2,"cool":0},"fmoOlgCs45Dea0c2ApEBpg":{"text":"I chose to bring my family to Galatoire's for my graduation dinner. Big mistake. I will ne","useful":2,"cool":0},"4Z0V8viC9ow6ZECtxuEhog":{"text":"This place is apparently an old school staple of NOLA!! To be honest the lunch experience ","useful":3,"cool":1},"N915pqxvqkrx0LxGc5bb9g":{"text":"Classy restaurant and a must visit for anyone when in Nola. \nAmazing cuisine in a time war","useful":0,"cool":0},"uZVegSvYM_2tMNJhLEVXZQ":{"text":"Such a great dining experience at Galatoire's! If you're looking for a New Orleans style f","useful":0,"cool":0},"CDIXDqFkR4PtynK5IjyFAA":{"text":"Another visit, always necessary when in New Orleans.\n\nAfter drinks elsewhere, we went righ","useful":6,"cool":4},"K4gdzC3ut1SJAkHWR_YGQQ":{"text":"The bar 33 is nice but restaurant overrated, had grilled redfish ....,twice....still raw o","useful":0,"cool":0},"nGV6KuLUHqcoXRls3DM1IA":{"text":"OK, to start, this restaurant is old school:  jackets required for men at dinner and defin","useful":1,"cool":1},"4lF_fh9lTagYUy812T5NIQ":{"text":"So I came here because it was on a list of places to go for gumbo, but what really blew me","useful":0,"cool":0},"7wpeaSptmmDCXzzL5rvjsQ":{"text":"I thought the Black Drum sautéed with lemon caper butter sauce was exceptional and delicio","useful":0,"cool":0},"foXmMKnO5bxq9TSnNFzcQQ":{"text":"We had the fried oysters appetizer followed by the BBQ shrimp and the shrimp and grits dis","useful":0,"cool":0},"LmJNxjj-gjnkSMzFTJ9EuA":{"text":"After lots of trips to New Orleans finally decided to try Galatoires. What a mistake!\nFirs","useful":0,"cool":2},"-pd6MlVG_o7C_f8mEo-WDw":{"text":"A New Orleans institution that lived up to its reputation. Outstanding wine list at good p","useful":0,"cool":0},"Sl22desciOU_flYNeNH8dA":{"text":"This restaurant came highly recommended to us but unfortunately we had one of the worst di","useful":1,"cool":0},"rOVOPQALG6wIwZG7LnM85Q":{"text":"This is the place if you are looking for a traditional New Orlean's menu: shrimp remoulade","useful":1,"cool":0},"iUlNTmD5_xU2fHsXCxJm2A":{"text":"A New Orleans institution.  Smart casual - jacket with jeans kind of place.  Bourbon Stree","useful":0,"cool":0},"oUK9cwc2wshJhfe4F_n1Ig":{"text":"If you want a fancy place to take someone to impress, go here. You must dress nicely for t","useful":3,"cool":3},"J4Ezln-El-X6ugt94Q3haQ":{"text":"One of my favorite dining experiences. It's loud, fun, delicious, and completely enjoyable","useful":2,"cool":1},"WND0d8dn6Hnd9uk-8cN2nA":{"text":"Had reservations so did not have to stand in line but one tis for sure. Men must have jack","useful":0,"cool":0},"DMHMPURezF9Rf-mVQ85wFw":{"text":"We were lucky to make it in on a Friday afternoon and get a table off to the sides so we c","useful":1,"cool":1},"EoMJHnWGVbwV7bONBEJtEw":{"text":"This place is a long in the tooth joke.   The host was a condescending man and very judgy.","useful":0,"cool":0},"jiOF95TQIL4twJRCcm8LTA":{"text":"Friendly service. Good food- had a salad with crab, the crab was very fresh. Casual attire","useful":0,"cool":0},"QHtRsKmVWWAS2_UaHaiDZg":{"text":"My husband and I had dinner at Galatoire's with some friends a few nights ago, and it was ","useful":0,"cool":0},"k16H1aiiZ5JmLKGwc50E0w":{"text":"The best dining experience in New Orleans! It was like stepping back in time. Everything w","useful":0,"cool":0},"DTvR_tPlkL9Sx8dXAIkr1Q":{"text":"Iconic New Orleans restaurant...my first stop every time I'm in New Orleans. Despite the B","useful":0,"cool":0},"jgu5LjNUKaWisTLwyHp4FQ":{"text":"Awful. Everything from the overly bright lighting, freezing air conditioning. Rude / barel","useful":0,"cool":0},"-XvDDgz3Er86AYpwZZg1IA":{"text":"Once again the Oysters Rockefeller were terrific.  Too much spinach on tender fresh oyster","useful":4,"cool":3},"n9E_zbuwgXTwdZ4GcSmAWw":{"text":"A great waite staff overwhelmed by a horrible kitchen. Every course was late and cold, exc","useful":2,"cool":0},"Igytfzha8_Rb7kFtkCIQ9A":{"text":"No NOLA visit is complete without a meal at this iconic restaurant. To my surprise and del","useful":3,"cool":1},"ePbyPAkV6IS6vvVzNjs9lA":{"text":"Galatoire's is an institution in New Orleans and always will be!  I read some of the negat","useful":21,"cool":9},"ec6-Et6ItnQKafEWDcK-2w":{"text":"We came here for our \"nice\" dinner one night while we were in NOLA.  This place is swanky,","useful":2,"cool":2},"uumCEbymEtwx5fsCufpe1g":{"text":"Came from out of town and took the whole family for pre-Christmas dinner.  check-in said 1","useful":0,"cool":0},"cR2paBF7gFYSdMxVVGdufw":{"text":"We had a 9:45 pm dinner on the Saturday night, fresh off a plane (freshened up and dressed","useful":6,"cool":4},"iIVqKFOMGEU9CSN2ZmS9nw":{"text":"I am a bit surprised to see such wildly varied opinions of Galatoire's but, then again thi","useful":5,"cool":1},"GjsmMKa9OuqJia7AWrSwsg":{"text":"Lunch or Dinner, this is the place to be. It might be on Bourbon street (beginning) but st","useful":0,"cool":0},"jLIiEwcwF_JGmpOF0LZURw":{"text":"This is one of, if not the worst dining experiences in my life. To think we dropped the mo","useful":0,"cool":0},"I41sDp1veiyrxzyjemNq5A":{"text":"I was verY disappointed with our time here.  Just a commercial production.  Stupid long WI","useful":1,"cool":0},"cnkDHmyzBuFMARKhLu6Awg":{"text":"Probably one of the worse \"fine dining\" establishment I have ever been to. First of all th","useful":0,"cool":0},"KYmJyndNkHwMoAlosDFK4Q":{"text":"It's pricey, but it's very classic New Orleans.  I've been here a few times, the most rece","useful":2,"cool":1},"BjhlQcsuguM0dYD5wvfiEg":{"text":"Very good restaurant in the heart of the French Quarter.  I enjoyed a great lunch of shrim","useful":0,"cool":0},"ZubO79yTDW_Ae2X15OJcjw":{"text":"Galla-twa's ... very popular restaurant.  Upon arrival for lunch, we weren't quite sure wh","useful":8,"cool":4},"-38b-VnIchqlB9Zm6EFKpg":{"text":"Not impressed at all. Expected an upscale dinner given the dress code and ambiance and we ","useful":0,"cool":0},"3YzhTXdhpj6m1blErzdlkg":{"text":"Best restaurant of my life! The redfish is the best you'll ever taste. The ambiance and se","useful":0,"cool":1},"8k5lapnMc0E0-09WHLMHow":{"text":"The food is old school New Orleans, which when executed with passion is a flavor fest but ","useful":0,"cool":0},"I7Kuav1X_kMZEJBHMiLyrQ":{"text":"We loved this restaurant. Classic upscale New Orleans restaurant. Our waiter as she called","useful":0,"cool":0},"2BTpAdyTP7nsqlJ3VWANdw":{"text":"I was sooooo looking forward to my dinner at Galatoire' but what a disappointment !!!!!!! ","useful":0,"cool":0},"lu0uLUpuwPyY0YY6Wmf0MA":{"text":"We were referred to Galatoires by our waiter at a restaurant the previous night. He said a","useful":1,"cool":0},"Mg4o5TzAoaRZbAXQu-YVJg":{"text":"Another wonderful meal at my favorite New Orleans restaurant. From the minute you walk thr","useful":0,"cool":0},"hrhQztqUK9iH_nym0KzqZg":{"text":"What a disappointment. 30\nyears ago this was one of the top Nor'leens restaurants. We were","useful":0,"cool":0},"6ZaJnjz8v_23VCgr9mHNYw":{"text":"Hubby made a reservation for our daughters 18th birthday. Flew in today for a college reun","useful":0,"cool":0},"lrEE09rJlVkDAs8OCr7ltw":{"text":"You only need to go for Friday lunch in this airy elegant old time dining room. \nA true NO","useful":1,"cool":0},"oAVAgjuYf7Ddssz0z5PwqA":{"text":"I'm asian, was served bread AND butter, what a wonderful restaurant.  I'm always curious a","useful":0,"cool":1},"_qwy00wJ0mZNLe9B1njTEw":{"text":"We dined at Galatoire's to experience one of the original and classic restaurants in New O","useful":3,"cool":0},"Pf96PRT84Lu9v2j4Hasltg":{"text":"The food was ok. The staff were rude and slow. We had shrimp remoulade which relatively bl","useful":1,"cool":0},"VWVhbJQXhz0YO1DXDGU0Ew":{"text":"Been there a few times. \n\nIt is a little overrated if you ask me. \n\nThe food is good and t","useful":1,"cool":1},"ZJQQek-Q4MNcq7T5rihIQQ":{"text":"Classic restaurant right off of Bourbon.   White tableclothes, etc\nService was good.  Ther","useful":1,"cool":1},"sOP8x_sOvCR7VmewyNsymA":{"text":"It's the place to be for Friday lunch , you'all.. It's easier said than done though.Friday","useful":0,"cool":0},"kUQfSOFwMt6zx4DzY6BB5A":{"text":"This is the worst experience I've had while staying in New Orleans. There were no problems","useful":3,"cool":0},"4MTiZ-GONYvynqrATNKBCA":{"text":"Probably the only place I'd eat a meal on Bourbon Street.  If you can picture an \"old-scho","useful":1,"cool":0},"DLqdAYxP4qykwY9tjq1RBg":{"text":"I was really looking forward to having lunch here. I had yet to have a bad meal in New Orl","useful":0,"cool":0},"YbmMwh4pd5yT41bNhGSTPg":{"text":"Nice restaurant, but more touristy than what I usually like. The wait was long, the waiter","useful":0,"cool":0},"TAd9-W7K7aOBHtwnQeUW4w":{"text":"A NOLA institution. Friday lunch does not disappoint- as long as you are lucky enough to s","useful":0,"cool":0},"udaApy5YxzWHly71RuOblw":{"text":"So disappointed. Decent food, indifferent service. They know they don't have to respect to","useful":0,"cool":0},"1ORg7pxs6JegUQMHsoNKVg":{"text":"Hands down the best steak I've had in my life. It was perfectly seasoned and cooked. My mo","useful":0,"cool":0},"RL8_vZ1pY8FZcUHHjhWL9g":{"text":"Y'all. We got in on Christmas Eve lunch, somehow!  Thank you, Maitre'D!  We are from Mobil","useful":0,"cool":0},"gH7FOGrzB3v_0f8pYJbHZQ":{"text":"Again, this wont be a popular review (I am sure) but lets be honest, Galatoire's is stuck ","useful":8,"cool":5},"kt3ACv3TJHKw8FD-y7TKng":{"text":"Great waiters, great drinks and food.  A true NOLA experience.","useful":0,"cool":0},"FcICbzi99MzDvMqcXmGkuA":{"text":"After walking down Bourbon Street on a Friday night, I was impressed that this restaurant ","useful":2,"cool":2},"fj_dF0iox-2x-PeLlkS6oQ":{"text":"Our server was so great and helpful, really enjoyed him. I had the crab cake and it was th","useful":0,"cool":0},"-2YmDxmO_KTfihh1-pNaXw":{"text":"First meal in New Orleans and I wasn't too impressed. It's living off its old fame and glo","useful":0,"cool":0},"I6EcXjSCZZTfkU3I1-yEXg":{"text":"If I could reserve a six star review for those off- the-chart dining experiences, this wou","useful":0,"cool":0},"5jfhMqKLwfnvMV9a8YBjEw":{"text":"We indulged in the fried bacon and oyster app and the crab cake. It was absolutely gloriou","useful":0,"cool":0},"Sm5JvFl44ly3-DvKoSn0TQ":{"text":"My boyfriends family frequents this restaurant and I hear about it all of the time. When t","useful":1,"cool":0},"aqT1GCL9AqAChFJjKzx-2g":{"text":"I've been waiting for years to try this place.  I remember hearing stories growing up from","useful":0,"cool":3},"X8nPuOGQ2c_mS_zOPg7NWw":{"text":"So we heard this place was a landmark spot for old Louisiana cooking. Not only was the foo","useful":3,"cool":0},"XgS8NEX_iLS8PZVit5wlvw":{"text":"Food is OK. service is excellent. The whole coat only thing, a bit of a drag for French Qu","useful":0,"cool":0},"adkbqDD4dt3P1TSLGbzRTw":{"text":"It's all been said before.....an institution...quality....great food.  Went for the 2016 R","useful":1,"cool":0},"OSfaOh4m14DVhv8KwVImiA":{"text":"Pros: Crab avocado salad was amazing. The sweet potato cheesecake was great. Bouillabaise ","useful":1,"cool":0},"biwR9Om-V8yqoUX866Uvig":{"text":"Great place for a more formal setting. The manager sent us a sample of the menu from appet","useful":0,"cool":0},"C5iznw-IV6aiGURjInAJQA":{"text":"First time of coming to New Orleans and first time of trying out fine dining, Cajun and cr","useful":0,"cool":0},"y3-YO3F2HjIqJFaX4_mJJQ":{"text":"Delicious food! Especially the filet. The ribeye was also very flavorful and tender. Don't","useful":0,"cool":0},"AS3eHvr_lyZxA_oYBM_TNg":{"text":"Super snooty staff. We came in for lunch, with a reservation under open table (which they ","useful":0,"cool":0},"9jy5bRfsTk9AevpNvgzwBw":{"text":"Not impressed, after all the hype around this establishment, the experience was mediocre. ","useful":0,"cool":0},"osUl4Pnqk3MONHFhpNkmbw":{"text":"Overall I found this place overrated, snobby, and food definitely not up to par.  First, t","useful":1,"cool":0},"gu6pGQVLjWDYxHNZnLt8PA":{"text":"I am skeptical that several of the below reviewers even dined at Galatoire's. CATFISH? Hel","useful":2,"cool":2},"Fj0A_HvT-BJT7TkfXK4vfQ":{"text":"Mice infestation\n\nEither spotted one mouse twice or two mice in the upstairs dining room a","useful":0,"cool":0},"RpByCMBbJMMnDMHycpEsag":{"text":"Lousy service. After having eaten there many times they seemed to think that I'm unsophist","useful":0,"cool":0},"aXu1groQLd8m9Opbylc-wQ":{"text":"Upscale, French-Creole restaurant on Bourbon St. Made a reservation online for 4 on a Wedn","useful":0,"cool":0},"t4f26Lgnkkiq3Pu5cgfL6A":{"text":"Came here for Mother's Day Brunch while visiting. This place to say the least was downrigh","useful":4,"cool":2},"UY_qEh7_cp1BSK8hx6Xtew":{"text":"So unimpressed by this place.\n1) They require you to dress to impress and have men wear ja","useful":1,"cool":0},"IAIkVY_HkJKgzjkNsKrbBQ":{"text":"It's famous, but is it worth it? For the experience yes, for the food maybe.\nService was s","useful":4,"cool":0},"vIOJp-x2wzpeoApL8QEtXQ":{"text":"The French bread was amazing. The crabmeat maison was exceptional. The shrimp ettouffee wa","useful":0,"cool":0},"o4WKaBFqz6qp0PTeGhawBg":{"text":"If you don't like wearing a jacket...too bad. You'll miss a great experience. Great food, ","useful":0,"cool":0},"7bT6iduDQu7Bme6lfScZsw":{"text":"Pretty good. I had the lobster salad and escargot appetizer. The salad could have had more","useful":0,"cool":0},"ttj1EYtmD60Dwl8MEP9L5Q":{"text":"Galatoire's... what more is there to say? The best food, the best service, the best staff.","useful":0,"cool":0},"HMQeKHIPTSEC4H4n3RF0Cw":{"text":"We had reservations in the evening and had received several calls confirming the reservati","useful":0,"cool":0},"pbFUSU2LEDMq3xM8a8QWFg":{"text":"Dinned here during my Big Easy visit for Jazz Fest.  The hype by locals was definitely pla","useful":3,"cool":1},"OHJasyG8BAJxMNw6oC_YCA":{"text":"We sat down at 8:45 to a bustling dining room. Ten minutes later we were greeted by Adam w","useful":0,"cool":0},"sT6_0A2yapWYd1eZx5Z13A":{"text":"An amazing dining experience tonight. \n\nI am not sure why I try so hard to find new places","useful":3,"cool":1},"x8UXPwSd2D6M-GPIKgaUjw":{"text":"When we lived in New Orleans, we spent many happy times, especially on Fridays, at Galatoi","useful":2,"cool":2},"cCw97dJ7QJNKuF7HySTg0Q":{"text":"One of the several classic Creole restaurants in NoLa that has been around forever, Galato","useful":1,"cool":1},"Uqt6V6tvVyB0U-ytfrTvjQ":{"text":"Corey at the barista, best host, bartender and waiter all tied up in one. All around excel","useful":0,"cool":0},"zs16W4CTuxFtKlLhnqSW3Q":{"text":"I have never been to a restaurant where every single one of their menu items I ordered wer","useful":0,"cool":1},"V1GvwdxCSXvDFhE53a8LEg":{"text":"I love Galatoire's.  Years of tradition and a menu filled with awesome choices.  They must","useful":0,"cool":0},"jIO6eBLtvuGrIgBXaWdcNA":{"text":"Amazing in every way. Restaurant is classic. Service and wait staff were attentive and per","useful":0,"cool":0},"7k-X5XsLSlGZKGIxMwGslQ":{"text":"The only thing formal about Galatoire's is the requirement that men wear jackets.  After t","useful":5,"cool":6},"qpqra-JYDbzhxvWlyRjpuw":{"text":"The restaurant and food was incredible.  We highly recommended the Shrimp au Vin.  Our onl","useful":0,"cool":0},"XIXYk1gcw-71AbBXwoUPxA":{"text":"Crab cakes were amazing! I have never had crab cakes without the cake part. The remoulade ","useful":0,"cool":0},"H2KHPx68CiSjw1e9CXm5yQ":{"text":"A New Orleans institution that was worth the trip.  Waited in a surprisingly short line on","useful":0,"cool":0},"RuGXyuBUXeJdfoYybn-BjA":{"text":"Splurge in one of NOLA's oldest restaurants.Make reservations for upstairs dinning and enj","useful":0,"cool":0},"44QZpvUyzBlbRBMXqq2Yow":{"text":"I had a wonderful experience here. We had a reservation for a large party (10 guests). Not","useful":1,"cool":0},"T3jLPCiLgBCqMPBeB5efMA":{"text":"Outstanding food.  A definite must if you're visiting from out of town, but keep in mind s","useful":1,"cool":1},"gfD42GX3M05rz_OQd6n4fg":{"text":"Incredible service and excellent food. No better way to have a long, slow lunch.","useful":0,"cool":0},"RcPdJZMNcOzLRkNMopSoXw":{"text":"Made reservations for the Friday lunch (albeit upstairs, in a freezing room) but were luck","useful":2,"cool":0},"FQGMqc5Ljvyr2DBHol01SQ":{"text":"We did not care for the food at this restaurant.    The food was very rich and somewhat oi","useful":0,"cool":0},"-8lfhR09WwFP147icc9Zvw":{"text":"We went here hoping for a great final dinner before leaving New Orleans. We reviewed the w","useful":0,"cool":0},"b8W31Pn3d1oljMsA-dY5lA":{"text":"I find it fascinating that the poor reviews for Galatoires are always from people who have","useful":12,"cool":7},"N5J4bvtd5088l-BzSzr7lg":{"text":"Food was great but service was slow at sometime or hurried. And do not wear shorts no matt","useful":0,"cool":0},"QRLGSt6d3dvr4d9WoqrRsQ":{"text":"We walked out of our reservation because the manager was that ridiculous. Their first floo","useful":0,"cool":0},"Qxzkrchbmi8ckG8JtQQ3zg":{"text":"If I could this place zero stars I would. I'm here on vacation visiting from Los Angeles, ","useful":2,"cool":0},"NZ19_JAajq3WCLVQ77i5jw":{"text":"My overall impression of this place is an overwhelming \"meh\".\n\nTo start the restaurant is ","useful":1,"cool":0},"fpa0s2aoSoZ1MHP9TRTYaQ":{"text":"So I was turned away for my first time ever! Just because someone isn't in a suit doesn't ","useful":2,"cool":0},"1D4wGHg9LWmaW8jTiXthog":{"text":"I really wanted to like Galatoir's and my girlfriend and I were looking forward to our lun","useful":0,"cool":0},"isR0G1ARcvvgpfzF_XAgLQ":{"text":"A New Orleans institution.  Drinks, service and food are always amazing.  More importantly","useful":0,"cool":1},"Aop3aEU3UVH1IfXwGgsBfg":{"text":"We did the Friday lunch here. Note: we had someone in line at 830am and couldn't get into ","useful":0,"cool":0},"FsifwvkTOkCJI3R96nJ61Q":{"text":"Ecellent except for the bread pudding which was dry.","useful":0,"cool":0},"n-aie60UgWKq3_Nrszmk1g":{"text":"I had lunch there yesterday.  Waiter was excellent and the restaurant was surprisingly not","useful":0,"cool":0},"z1mw0Ju8LtBZcFnGGer6oA":{"text":"We had turtle soup and an oyster appetizer! The oyster was my first time ever having it an","useful":0,"cool":0},"RC-0DZTTrMt7fzRVvRvYew":{"text":"Items Selected:\nWarm Bread and Butter\nFrench 75, Pimms' Cup, Classic Daiquiri\nSouffle Pota","useful":10,"cool":4},"rfNhdYDMBiq32LSA8oVr2g":{"text":"Very disappointed with the dining experience.  The waiter was very stiff, but more concern","useful":0,"cool":0},"jigVgklfzneAqlgpd2cg_w":{"text":"3 Stars... maybe generous, but the food was pretty delicious - most of it.  However distur","useful":1,"cool":0},"ZPk_CAO2YtmCS3KOcP12uA":{"text":"I stopped in here for dinner on 6-11-2019 with a good friend.  Now, I didn't remember the ","useful":0,"cool":0},"tVns1MBNfnWCW2BAcW0EwQ":{"text":"I was genuinely surprised at how awful this experience was. I've heard nothing but good th","useful":8,"cool":0},"81_-zR3-WIplCFeapQEQ6g":{"text":"This was our 25th anniversary dinner and our first time visiting. Jerrel waited on us and ","useful":1,"cool":1},"vc4eAH1E3UhXBvS9RhHn1Q":{"text":"Where do I start...first, Galatoire's Restaurant established 1905 is my favorite restauran","useful":1,"cool":1},"AkmfdDeRg8rYsiAk9XUroA":{"text":"We were so excited to be here based on the history and menu and reviews. Our fourth trip t","useful":2,"cool":0},"KQkEWt1axlBQH4hDwwfISw":{"text":"I think the food here is pretty good the place could stand some updating on interior desig","useful":0,"cool":0},"MrQyuolAwKLVF5WYFTGQpw":{"text":"HORRENDOUS, start to finish. Were supposed to be upstairs, brought the required jacket. Th","useful":0,"cool":0},"BlRx4l0RZf2H0StG5M1fEw":{"text":"My expectations were quite high for Galatoire's and they fell short by quite a wide margin","useful":3,"cool":0},"VXn05KW3zY7h8CxhX_Md_Q":{"text":"Even though I live in Atlanta, I have been eating at Galatoire's about 2-3 times a year si","useful":5,"cool":0},"fXehVUY6wFJ3TjKaPS3_fg":{"text":"I was prepared to not like Galatoire's. I'm typically skeptical of restaurants situated in","useful":1,"cool":0},"G6oJUNAr8l8rs_FuHQG6Hw":{"text":"Had a large group party here for a bachelor party. This place does it right, from selectin","useful":0,"cool":1},"4GBxKJvnYd0r4HyCgwHoAQ":{"text":"My wife and I travel to New Orleans about once a year for a fun getaway and we always star","useful":0,"cool":0},"mg_P2jhC7Tox_JTjv5EWDQ":{"text":"The food was okay at BEST. When you first walk in, there is no one to greet you, nor are t","useful":0,"cool":0},"WQlGRfYch5k_0q-4HJlrxw":{"text":"Stuffed eggplant was perfection. Service even better. One of the best restaurants in NOLA.","useful":0,"cool":0},"TBr6BIIEe961bcMSYihliQ":{"text":"Very expensive for mediocre food. If you don't like seafood then this place is not for you","useful":0,"cool":0},"ojjZcrzqHjeRCQ1OHvRPUg":{"text":"Nice ambience bustling friendly venue with very attentive staff . Food was a Homerun from ","useful":0,"cool":0},"Tn3RktIWECEm-ZodP6m-6A":{"text":"6-2018 visited Galatoire's (2005 James Beard award by it was just OK) recmd. by friend for","useful":2,"cool":2},"3r7nI0ZtAvqfqY3WsUf06A":{"text":"I wish I could give a 0 as a review but, 1 star is minimum.  So let me tell you.... save y","useful":0,"cool":0},"GHFAK0c60y-XxyCoW6XPCA":{"text":"Terrible service for such a well known place. Forgot our desserts then messed up every che","useful":0,"cool":0},"EhVNJxZBsmJM5mH13zGkRQ":{"text":"Myself and two girl friends came here on our weekend trip due to lots of recommendations. ","useful":1,"cool":0},"fd26u_3UmxdaVBEA50TeRA":{"text":"Every time we visit New Orleans my wife and I always start with dinner at Galatoires. And ","useful":0,"cool":0},"jU6-1rBBaiMpSoIfdqIb6A":{"text":"I ordered a medium steak and ended up getting well done. When I told the waitress she said","useful":0,"cool":0},"hGLX9PvbNbQY6u1k6x0YqA":{"text":"This is one of the \"must go to\" places in New Orleans for classic food that hasn't changed","useful":6,"cool":2},"-jm2Kv4p0RkTgjjmSeRjJg":{"text":"This place is amazing...It seems like it has not changed in over 100 years yet still knows","useful":2,"cool":0},"hneviIyDwQApK84_g4pRlA":{"text":"The food was average but the service was awful. We sat upstairs and saw our waitress twice","useful":1,"cool":0},"5gHy-q1a_7U2WmPxwqUMvA":{"text":"Enjoyed it.\nGood food and kind staff.\nWe sat on the corner. Nothing so fancy, just an aver","useful":0,"cool":0},"cByYNRxjFkTy-19nxlHNng":{"text":"I woke up with a gift card in my email from my friend and fellow Yelper to visit here. Boy","useful":9,"cool":8},"3eYwPpWmPAUTtmIEZEtWfQ":{"text":"This review pertains to Galatoire's New Year's Eve wine event held on the December 31st ra","useful":1,"cool":0},"gZaCh2ypWtR5MltmM6wUfQ":{"text":"Expect to be ignored. \n\nExpect to wait 45 minutes before you see a waiter, and even longer","useful":2,"cool":0},"OrZscXhDES2P3AjKYmRDrg":{"text":"note: review for drinks only here.  couldn't stay for dinner - next time.\n\nmanhattan was c","useful":0,"cool":0},"2_d7UFn5ekUPPzrzDrB2xw":{"text":"This place is gorgeous. The service was impeccable, the drinks spot on, and the food delic","useful":1,"cool":1},"GjVtGJqA6ocVzjGHecgIbw":{"text":"They require a jacket for men. If you look on their website it DOES NOT SAY THIS!! \nWe wer","useful":0,"cool":0},"X4eRn-CCmfLjjCelkb-0tQ":{"text":"Back again for our pilgrimage to Galatoire's. Every time we go to NOLA, we have to visit. ","useful":3,"cool":1},"sCY2_bJ482HgzpGowXFpYg":{"text":"We popped in here for a friend to have Turtle Soup.  He loved it.\n\nI had the Gumbo, which ","useful":0,"cool":0},"lgtR90CjR98nczFmYcwwcw":{"text":"Galatoire's is one of the classic New Orleans restaurants, so of course we had to check it","useful":4,"cool":4},"QQ86ru1ukaoUD0TNSVqo3w":{"text":"Old world charm and ambience and excellent service, but there are much better options in t","useful":1,"cool":0},"KdGXY62sksvlvVQDbpZX1g":{"text":"I went to Galatoire's for a friend's birthday. This friend loves Jimmy Buffet and his stor","useful":2,"cool":1},"LDJmDSeQKPPuwRRBbE4h8A":{"text":"Black drum fish with crawfish ettouffee\nseafood okra gumbo \n\nfried oyster\ncrab - in a sauc","useful":1,"cool":1},"LTL1Ijtg2W8gK5otbMqq4A":{"text":"The hype is much greater than the actual quality. The food was mixed quality. Good escargo","useful":0,"cool":0},"U9qY0N1doXgwNBiMy8VQcg":{"text":"Excellent must get the soufflé potatoes for appetizer - excellent service !! \nWe had Crab ","useful":0,"cool":0},"FaPbZZ1Nu9qxBYnCw9kS2w":{"text":"Had dinner here. Reservation at 6:30pm and we were seat on time.  The place is clean and n","useful":0,"cool":0},"R-g66EecfNRxgffWBlEeBQ":{"text":"Wonderful dinner at this classic fine dining restaurant! We knew ahead of time without a j","useful":0,"cool":0},"-u2s8IiwQQpKVCo6xUbcug":{"text":"My experience here was pretty pleasant. It is located right on Bourbon Street, but once yo","useful":19,"cool":18},"VY6mw3foHh3qjkyLEFEXNQ":{"text":"Our extended family went here after my son's college graduation. We were a party of 12, th","useful":1,"cool":0},"C75067u7Uwe9dbG-FBf8CQ":{"text":"Bucket list restaurant \n\nThe stars finally aligned and we had an open night in New Orleans","useful":5,"cool":1},"OSKemNHBx6gQ2VebZ9hveA":{"text":"We came here for our anniversary dinner a few nights ago. The meal was great but so was th","useful":0,"cool":0},"6181j5zy8rV22s9_V6VNTQ":{"text":"Let me start by saying my review is based on my experience and  Gamatoire's handling of 10","useful":0,"cool":0},"T9LY0ByjnthiyNJoPc53NA":{"text":"Worst service I have ever experienced in all my years! My husband and I are locals and I h","useful":1,"cool":0},"ZgTOkcHIXUDmln6oh6b5Qg":{"text":"This place is good. The crab mayson was to die for. I had the pan fried trout with crab an","useful":0,"cool":0},"sIfnrkQ1HMeDhFQ2j-E6Xg":{"text":"My wife and I's first dinner in New Orleans at one of more historic and iconic places you ","useful":6,"cool":4},"QbtfQ30eQTksqO7KGKchdQ":{"text":"Tonight was our first ever trip to Galatoire's for dinner. And, were we glad we did. It wa","useful":3,"cool":0},"kJOwxkntaukSn1w71QEELQ":{"text":"- The escargot was very nice. Tender, buttery, with a lot of garlic.  One of the better tr","useful":0,"cool":0},"xIS-KLCr2IhTEJXxH_qFuQ":{"text":"After coming here for many years, Im sorry to have to say that it was just NOT the same as","useful":0,"cool":0},"ZPULePfPXduzXNe6O5vCQQ":{"text":"We loved our dinner at Galatoire's! The inside of the restaurant is like stepping back in ","useful":1,"cool":0},"KT8lx5cq7WRbTfcNk_26YA":{"text":"This place was a foodies paradise! So one thing you want to know that we didnt was there i","useful":0,"cool":0},"j2j7Ucy4JtS1LX231Lk0uw":{"text":"We had a reservation for 8 on Friday afternoon, 28 FEB.  We got there as the afternoon rev","useful":0,"cool":0},"V38yIocO43CQh3Nzw2VAIg":{"text":"Sooooo good.  The trout almandine and bread pudding were my favorite! The Pre Fixe Meal wa","useful":1,"cool":0},"NV6qRDpfK5kZf9EyZxv5Xg":{"text":"We walked in off the street because we knew Galatoire's is a New Orleans institution. We w","useful":3,"cool":0},"UIy4Ls4vmkJ9x7u3kxRlmw":{"text":"My mother had these trips for her friends from the West-Coast every year and I went one ye","useful":1,"cool":0},"VtOPIjYOV4iQIGW1pCFmRg":{"text":"This was my first time at Galatoire's, and I was excited to finally try it! I ordered the ","useful":6,"cool":6},"8pdpkiJMiyAH2VnGWizgiw":{"text":"This was a meal to remember, and totally explains why this restaurant has endured the test","useful":2,"cool":0},"GMuaCZzgma4_NZHek2r7og":{"text":"We walked in without a reservation because we weren't sure we could get in. My BF didn't b","useful":0,"cool":0},"7ElxuScaxx_uNgfm8q3_qA":{"text":"Ugh. I have been to this place probably 6 times POST Covid. I understand and typically mak","useful":1,"cool":0},"l33J4KqSIs47ZuLKCpnR6A":{"text":"The restaurant has a very bougie, old south feel. It feels as if you're dining inside a pl","useful":1,"cool":0},"SgEbTszhfZ-j9EDrV5lyQA":{"text":"We were sat for 45 minutes without drinks or even menus, and that only changed because a m","useful":3,"cool":0},"lBjpyCWVYcvj-bD5ujxHsQ":{"text":"A classic New Orleans restaurant steeped in history that serves average meals. Definitely ","useful":1,"cool":0},"lE0zLnHy7QWpr9_MvPQp5w":{"text":"The food, both my vegetarian options and my husband's shrimp remoulade and steak, were abs","useful":0,"cool":0},"7gsAZBYeWDkDa3Nq8THDzw":{"text":"Great service. Amazing food. Amazing drinks. Steak is amazing as well as the sides!! I wou","useful":0,"cool":0},"SmBu89JS0vHW7_Lz1JE80A":{"text":"This is as good as it gets. Traveled to New Orleans for business, and ended up at Galatoir","useful":5,"cool":4},"ZVZ_YaoyNJtDQcdlRw8Kgw":{"text":"Very disappointed. \nNo \"jacket required\" enforcement . Got water then waited 20 min for wa","useful":2,"cool":0},"qPQIAVYsoct6hiesU6TeLA":{"text":"For the price, we were extremely disappointed with the quality of the food. We started wit","useful":0,"cool":0},"niS6NZL0FtlBnp-9hLF1PQ":{"text":"One of the grande dames of New Orleans, really nice food and well made cocktails. It did f","useful":0,"cool":0},"FracbMzLqFnUBgkOH3Bx_A":{"text":"HELP!! I want to give Galatoire's 6 stars!!\nSeriously, we had so many amazing culinary exp","useful":1,"cool":0},"AaCkCCyWPTPEaXzQ9F4Dkw":{"text":"My favorite restaurant in the city. My boyfriend and I dined here for the first time a mon","useful":0,"cool":0},"FZENGS4cZBGUqnVnT01DFQ":{"text":"The legendary Galatoire's has been around since 1905! This is definitely fancy fine dining","useful":0,"cool":0},"2ESR4PkNiUGoM4QfUn2e9Q":{"text":"All we heard about, when planning our trip to New Orleans, was that we had to go to Galato","useful":0,"cool":0},"GxB2bfJeuXIjF9HEufX33A":{"text":"When visiting New Orleans, this place was suggested. The food was not bad. If you want to ","useful":0,"cool":0},"yjICUPxGYTkl4ERhrdXmCA":{"text":"I have lived here all my life, but just recently went here for a birthday dinner.  It sooo","useful":1,"cool":0},"Y339oNNZtRbzZld7t14-3Q":{"text":"June 2020; Reservation required due to COVID-19; every employee wears a mask, tables set 6","useful":0,"cool":0},"64PJQrRE2u-xO1NAQRyykg":{"text":"If the only seasoning/flavor you like is bearnaise, hollandaise and butter- This place is ","useful":0,"cool":0},"b88WI-5UFuqK9ZkwgzBhAA":{"text":"Phenomenal service. The chicken a bonne femme was delicious and unique. Most restaurants d","useful":0,"cool":0},"vsMguMi9FOMZkbF9t4KM5w":{"text":"Better than ever. Went back for another Friday lunch and it was glorious controlled chaos.","useful":8,"cool":5},"e9n3WczXYVzxElroVf9hQg":{"text":"I wish I didn't have to write this review, to be honest. I had such high hopes for this re","useful":4,"cool":0},"KtRu9Y4QtO2lXhOcfjpZiw":{"text":"We have been going to Galatoires for years to celebrate birthdays on Friday afternoons and","useful":0,"cool":0},"Jcr-f9XfqI4Du87mmxRNnw":{"text":"TL; DR: It was overall okay. In my opinion there are much better places to eat for the $$$","useful":0,"cool":0},"qu0Wbf2vSyh5z1t8UTmjRQ":{"text":"Galatoire's is a fancy Creole restaurant on Bourbon Street which sounds ironic, but this p","useful":5,"cool":1},"j7pFba3OUPPOq7WvoKqM_w":{"text":"Another restaurant I've had on my list to try for a while is Galatoire's. So when some wor","useful":2,"cool":3},"eFu_cANBU5h61Hmg_CRQew":{"text":"There's no way to say \"favorite\" Resturant in Nola, but this one is in with the top group.","useful":0,"cool":0},"TGDf3YEv04i6cZqZo0m7dg":{"text":"Very average.  Went for lunch and had drum fish and special app.  Gumbo was pretty good.  ","useful":1,"cool":0},"9tDl-GFal3Nqz-pD72q38A":{"text":"139 Carondelet St\nNew Orleans, LA  70130\nUnited States\n\nExcellent old school restaurant, t","useful":0,"cool":0},"1CBeEsJmDFdHKU1uBoyLGA":{"text":"The first time I walked in here, with my girlfriend nearly 10 years ago, our waiter walked","useful":9,"cool":9},"IC3lO84jAOCg6cfJ6lTomQ":{"text":"Good food, pretentious unfriendly service.  Also a little sad reading these comments about","useful":0,"cool":0},"NJAjE9n0VCOLco58eG54qg":{"text":"excellent service.  Best Oysters Rockefeller's we have had anywhere including NYC, Paris, ","useful":1,"cool":0},"aqpsvGnshxbvatztgP9RJw":{"text":"Our lunch at Galatoire's was unlike any culinary experience I've had. It is obvious why th","useful":1,"cool":0},"IkzPSQtt5k_uuCsAhp_qjg":{"text":"Food was very good. 3 of us got fish, some of the best fish we've ever had, and the boy go","useful":0,"cool":0},"N1nnFXqUr5XerVM8fbK9Nw":{"text":"Galatoire's is open, at least as of 3/20/20, for to go orders!!!  What an amazing way to s","useful":0,"cool":0},"4WMjw-HfSpCfogofRuCyOA":{"text":"Dining at Galatoire's has been on my bucket list for a while. So I was thrilled when I was","useful":4,"cool":8},"oYyptOvZnYS7Mu0rBngEVA":{"text":"BEST CREOLE old-line restaurant in the Vieux Carré!\nBRABANT POTATOES to start, flaming Caf","useful":6,"cool":2},"VHrznmO_GT7fhxB9vNGvgw":{"text":"Note jacket is required and it's fun to dress up on Bourbon Street.\n\nWe were so impressed ","useful":1,"cool":1},"7zi2xlGrqtOIUB3nCyXHOg":{"text":"Best steak I've eaten since Charlie's in Orlando Florida which was rated number one steakh","useful":0,"cool":0},"5DRwMnO3Z6FPhCCl9et8Bg":{"text":"Great food, shockingly poor service.\nOur waiter was so rude that it left a very negative e","useful":3,"cool":0},"-FBUfox5YXoXssQYPRDiRQ":{"text":"Galatoire's was what it always is- a joy. It is elegant and wonderful yet loud and festive","useful":0,"cool":1},"FZTCY7NgVRT-ZrHHW7Ea1g":{"text":"Galatoire's is our favorite restaurant in New Orleans, and one of our favorite restaurants","useful":4,"cool":4},"6o-Rn9LJG-emZJXGFlBDpQ":{"text":"Memorial Day was around the corner and it was time for the New Orleans Wine and Food Exper","useful":4,"cool":4},"vKbaU6snYotSAtX8Hbt3NQ":{"text":"I had a WONDERFUL last dinner in NOLA here with my dad! Every dish was delectable and the ","useful":6,"cool":4},"fG9WTvm6vIphZ-3S1m95tQ":{"text":"I've been lucky enough to travel the world and dine in many fine restaurants. Most have li","useful":0,"cool":0},"JfBbIW1jzaKDN_HeS5QmYA":{"text":"We've been to New Orleans more times than I can recall and last night for the first time w","useful":1,"cool":2},"7ONKmN7GlpPLB3_r24Mn5g":{"text":"Four years ago (the last time I ate at Galatoire's), I would have given the restaurant fiv","useful":1,"cool":0},"jwVGQ-TaI63MuT6azJY0iA":{"text":"I waited the 24 hour rule to let the experience sink in. I will also preface this with, I ","useful":2,"cool":1},"TxQyunfcDIH33oETHLVw2w":{"text":"It was my first time in NOLA and I had an absolutely fantastic time. Galatoire's is very s","useful":0,"cool":0},"fMDSS6SvU31daPcUr56Xfw":{"text":"We just had a somewhat disappointing meal. Our server, Jennifer, was great. We were really","useful":1,"cool":0},"Rk6pVPfROopyRLJtIPIF5Q":{"text":"Overpriced and overrated. Service was terrible and very slow. We had to ask repeatedly for","useful":1,"cool":0},"CWnufzSLwzIGcNSnKqdURg":{"text":"My friends and I came to this restaurant with an 830pm reservation on Sunday night.  First","useful":2,"cool":0},"hAv9Ey3U16NpF_FoITJwAw":{"text":"So I went here based on Stassis recommendation from Vanderpump Rules to be honest. I was s","useful":1,"cool":0},"NZk-QBrN28m-vWMnavuxiw":{"text":"Our last visit here was very disappointing.  We were celebrating our anniversary and could","useful":3,"cool":0},"qyaVIcUFGNqDDWRkiPiHiQ":{"text":"Always perfect as usual!  A must stop for everyone visiting New Orleans!!!!  Wonderful foo","useful":0,"cool":0},"NxjkY5WzF0_Clu3Qku0KbQ":{"text":"My cousin and I decided to do a restaurant crawl Thursday night. We started at Galatoire's","useful":0,"cool":0},"b0z98VjfhCjhVQjR2jO4zg":{"text":"Food was very good must wear a jacket in main room auxiliary room dress code not as strict","useful":1,"cool":1},"5D_O10fz1tad0wbNZ6oDNg":{"text":"We heard the Friday lunch scene was the place to be and it sure WAS!\n\nFirst feelings upon ","useful":1,"cool":2},"T_-vpVBphLnbPAelopQrog":{"text":"We decided to eat at Galatoire's on a Friday afternoon.  I have eaten here more time than ","useful":1,"cool":1},"lqYemAwRSr9Ity6GnAzU8A":{"text":"Hey Galatoires, you can either have the mandatory jacket dress code OR the numerous mice r","useful":3,"cool":1},"YwSOYEzij6x_ZTcvtsCF8Q":{"text":"A must do. \n\nGet on your finest clothes and remember that you must wear a coat and should ","useful":4,"cool":1},"6XQ_kZ3TWTl3iRHAcYtNIg":{"text":"The food is pretty average- you can get better food elsewhere in NOLA, but I came here as ","useful":4,"cool":0},"DqP07JJj2EFqe9vdt9Ol4g":{"text":"Thoroughly enjoyed myself eating at the bar at Galatoire's. The bartender server Chip was ","useful":1,"cool":0},"XeKzjlWy6omlT2yUC4BicA":{"text":"This go to place for so many must be hurting for help. Extremely poor wait staff from a ve","useful":0,"cool":0},"QSaUM03HAFQ2I9-ZvRRIGA":{"text":"Must visit. Incredible food. Incredible staff. We had a large party. They made this one of","useful":0,"cool":0},"hXY7xZHMD1LYHjD5W3x9dg":{"text":"Must go to the Galatories - the Crab Sandor is excellent ! Try to Soufflé Potatoes !!! Exc","useful":0,"cool":0},"bJ9-Q10YErZqoNtVZsPYDA":{"text":"Waited a year and a day for menu, utensils, bus boy dropped a few things on the floor and ","useful":2,"cool":0},"q-xBs_dSvFCwswaoffxHOA":{"text":"We finally made it to Galatoire\"s. We made reservations for brunch on a Saturday. My husba","useful":1,"cool":0},"dw0oqSo1iNPsckuUhbBwGw":{"text":"Food was good but not great (oysters brioche, shrimp étouffée & desserts. Logistically a p","useful":0,"cool":0},"LXvAnU1wDygo8ZO9GF9qiQ":{"text":"What a great experience!   So glad we went here for lunch.   Outstanding service.  DOM was","useful":0,"cool":0},"l4f6KAjl-7uptGIT0epN8g":{"text":"I'm glad I checked out Galatoire's Friday lunch, but I don't think I'd return. The host wa","useful":8,"cool":4},"y4DvUhpkqlnTQD2tXHgccQ":{"text":"Terrible meal. First tip should have been that the dining room was empty at 6:30. Gnats fl","useful":2,"cool":0},"Dqp3ul-anyP_onWYORh-Ig":{"text":"Best dinner! Classy place, great service and coats required for men. They have extras if y","useful":1,"cool":0},"eo6DEETZoQO2LGM5l0wvlA":{"text":"First time and looking forward to eating at a NOLA historic restaurant for Christmas.  Was","useful":1,"cool":0},"reajiHifCI_Cnjrl20moeQ":{"text":"This place was very good. A dining experience with elegance and class. This isn't your typ","useful":0,"cool":1},"ppos55EQsQ_Rs8m6aOKhMQ":{"text":"Super fast and kind servers and hosts! I could tell the place was busy, but service did no","useful":0,"cool":0},"FZES8vKS0jQkUVqEHilkhA":{"text":"A very fancy, but well-known spot!! It's right in the middle of Bourbon. I went for a nice","useful":2,"cool":3},"x2NpePHJK60KrpStoskWXQ":{"text":"Went here with my husband for our anniversary. We had been talking about going for a while","useful":0,"cool":0},"EGQAUIg7n_yYmI1-sbm-XQ":{"text":"We made a reservation online which was a painless experience. We had researched ahead of t","useful":0,"cool":0},"X2GdDsP1QTAWoMORfKlDyQ":{"text":"TheDailyMeal.com recently posted an article on 101 Best Restaurants in America for 2015; G","useful":7,"cool":4},"VzYMgYGbPU9kcpnx_n3Q4w":{"text":"Thoroughly enjoyed my dinner here, while in the French Quarter. Best crab cakes I've ever ","useful":0,"cool":0},"8b6oKqcymiCzrwy1jrF3Eg":{"text":"I've had Galatoire's hyped up to me since I was a child. I've always wanted to try it, and","useful":3,"cool":0},"WRNYLdv9gJDpeJccWRdlYg":{"text":"Great New Orleans restaurant. Very traditional- coat required for gentlemen, for example. ","useful":0,"cool":0},"zXl2y56vHyofmP-_UeqSKw":{"text":"What a downward slide, worst part is it was self inflicted by their decision to open the e","useful":1,"cool":0},"ZZfOeEJYTV3_2FfVAbfEvA":{"text":"We met our adult children in New Orleans for Christmas. We ate here the December 26, 2019.","useful":3,"cool":0},"4tNEju9SjLXT6ROUKyuIyQ":{"text":"One of my favorite old school restaurants in the entire nation. No you will not find the l","useful":1,"cool":0},"t21nF5aur5Y2QW4YuX77TA":{"text":"Excellent restaurant. Wonderful service. Superb food. We had a large group they accommodat","useful":0,"cool":0},"4vAMQ9kjJ7JMEQ4JqcSeFw":{"text":"https://goo.gl/maps/DhXojmZ4DVvQL5TC6\nI would not recommend this place. The oysters Rockef","useful":0,"cool":0},"40__P3Hqlx2QE9e1_68zPA":{"text":"Horrible service, very noisy, and cold food. I wouldn't recommend to anyone. Very disappoi","useful":0,"cool":0},"FCkjaT3_UAshtxV9REOrbg":{"text":"I wholeheartedly recommend you attend the Galatoire's New Year's and Mardi Gras table auct","useful":3,"cool":1},"QNaVY05NC9Al7ZVIIryCrw":{"text":"I met up with Bae for lunch at 12:30 on a Thursday and was not disappointed. Complimentary","useful":7,"cool":3},"E2s-IsyskfSrmDOwdwOgqw":{"text":"Whether celebrating a milestone or just a Friday afternoon, Galatoires is always perfectio","useful":1,"cool":1},"Glz6DL1lHR0piRHdfnpuow":{"text":"The place  is very cute inside.  Menu sounded great!\nNever been treated so badly.  The bar","useful":3,"cool":0},"WcbtbSLzEmWBuWz2rDVpnQ":{"text":"There was a time when Galatoire's was special.  I'm afraid it has fallen into weak hands. ","useful":1,"cool":0},"zHlJ1x4JlevOH5zWVIMQmg":{"text":"This place is an old school institution.  \nServers are dressed in white jackets and formal","useful":5,"cool":4},"zdqFF7yR6H2-Ak3FgQWG0g":{"text":"Finally made it. Galatoire's is everything I expected. Formality, beautiful steaks, crab a","useful":4,"cool":2},"bJPkDZWW5-o0WumKYniQzA":{"text":"A New Orleans institution, and for good reason. This was my first stop after flying into t","useful":1,"cool":0},"UxCJQxk01bWYAdRYGHTDLA":{"text":"To be honest, it felt over-rated. The \"dress code\" was ridiculous and hardly enforced. The","useful":1,"cool":0},"Dhza7FWp0H1cdqO4bGYOhg":{"text":"We dined at Galatoire's on 2/15/2020 during Mardi Gras celebrations!  Impeccable service, ","useful":1,"cool":0},"4Fc4vvtH0_0-uLPbysfnWQ":{"text":"Terribly disappointing. We were sat upstairs where the entire staff looked under 18. They ","useful":1,"cool":1},"kHHxMzFfdbuumAEO7XCr8w":{"text":"We have been going to Galatoire's for years - it's a classic restaurant and experience tha","useful":1,"cool":0},"D6Rz_jueXy8CH-WlYK0m5w":{"text":"After dining here many times in the past we looked forward to returning to a favorite rest","useful":0,"cool":0},"6dHxnbZjB1omYsDNOpBOjg":{"text":"We were in town for a conference and got a last minute reservation for our party of 6. We ","useful":2,"cool":2},"Zfkgk5HIn36EGPnDTlZb3g":{"text":"This place was the perfect Friday night restaurant! Our waiter, Peter, was fantastic, and ","useful":0,"cool":0},"6VfNulgfYG7Qg465WqBt_Q":{"text":"We truly enjoyed our wonderful meal at Galatoire's last week.  We began with Galatoire Gou","useful":1,"cool":1},"GbdkJ_C7mpXaZTHD4S3D_A":{"text":"I was very privileged to have a dining experience here at Galatoire's. We tried the oyster","useful":3,"cool":2},"sADBdbfNj13yz9uSWlAWQw":{"text":"Don't go here. We waited 25 minutes for service. We locked eyes with several staff and no ","useful":0,"cool":0},"Mr-RiDEHob0dp8WnhqMxaQ":{"text":"Worst fine dining experience EVER! We tried Galatoire's for the first time Dec 27th. Grant","useful":0,"cool":0},"kR5E-QLKzZ-Uu911w6o3Xg":{"text":"We decided to eat here because they are about of the catch and cook program. We caught som","useful":1,"cool":0},"LzHnAS3mrYrglcfQe-5jow":{"text":"I have eaten at Galatoire's many times, and I will admit, it is a favorite spot of mine, b","useful":0,"cool":0},"7KQ8K1NPP-UHjdbiupbGJw":{"text":"After a very disappointing meal and poor service at Antoine's last night, New Orleans tota","useful":0,"cool":0},"igqBFbAn4M7J4unobfc-5w":{"text":"THE FOOD HAS REALLY DETERIORATED \nI've eaten at Galatoire's 3 times in the last year and e","useful":11,"cool":4},"u0fU8Ue7vgKP-OzMqLCI_g":{"text":"Had literally the worst restaurant experience ever Galatoire's Restaurant - New Orleans\n\nT","useful":2,"cool":0},"AmVjdrG01-hh0iSrmk5VMQ":{"text":"There was four in our party for dinner and it was delicious   The dinners all came out per","useful":2,"cool":1},"-MrGToCHZDOk5McB6t8-zA":{"text":"Always a good.meal here.  More than just dinner , it is an experience.  Seafood is always ","useful":0,"cool":0},"UfD_o94S9R0AwGMdAhuBxA":{"text":"Awful experience and I actively discourage anyone from going to this restaurant.\n\nTLDR: AC","useful":4,"cool":0},"vvDdZENUHE0G9JBvId4gKA":{"text":"The food is spot on here! Some of the best in the Quarter.\nHowever, don't worry about thei","useful":0,"cool":0},"J95UkAdifE2bo4wuzcZT7Q":{"text":"Absolutely loved it! My husband had been here before many years ago, and he wanted me to s","useful":1,"cool":0},"6TYgQfKXDSrfO577G_w3fQ":{"text":"Went to Galatoire's for brunch today. My husband has never been and I was so excited to be","useful":2,"cool":0},"HBURDWqxMQyYY0uvCjIkVQ":{"text":"Our experience at Galatoire's was such a let-down!  Having heard it was a New Orleans favo","useful":1,"cool":0},"TcebLSjnb1xTGwhgxraowQ":{"text":"I've been coming to Friday lunches here for years when visiting. It's not an easy ticket b","useful":2,"cool":1},"QkGd41zrXecMDR_IzZP0Dw":{"text":"Fine dinning in the French Quarter. We Stepped  into an awesome  dining experience during ","useful":1,"cool":0},"iSrHaFzJ8DM_7HMoPNFuGw":{"text":"Galatoire's\nOne of my absolute favorite places to get a crab cake from would hands down be","useful":1,"cool":0},"Kbff2RvdzrpNR_8v77HelA":{"text":"Pros-Service was outstanding! Filet was great! Lyonnaise potatoes and French fries were yu","useful":2,"cool":0},"HjtAHqCtHzCGQhycy3UBCA":{"text":"It was advertised as fine dining, but it was more like they're trying to be fine dining bu","useful":2,"cool":0},"Mm9K9wO8ecxaXpaou0owlg":{"text":"***DISCLAIMER: 'Rona review - UNSAT experience.  ***\n\n\nWould have been 4-stars and an over","useful":11,"cool":3},"-VNb3RoTCZ8gfAYlL8953A":{"text":"I understand that businesses are struggling through covid but this was quite a disappointm","useful":4,"cool":0},"UouLc2qJomFwipMtSNFxHg":{"text":"Some places probably don't require reviews, and Galatoire's falls in that camp. Still, I'v","useful":5,"cool":3},"MbvmUttqF-d3EyIupuz8kQ":{"text":"Very disappointed. The crab & avocado salad for $22 was ruined with excessive horseradish ","useful":2,"cool":1},"-q_bcLUwKNBzGvdGx01M8w":{"text":"It feels kinda weird writing an update to this review because Galatoire's was my introduct","useful":5,"cool":2},"FqLzIwwuJgugYtgV9WNMmw":{"text":"So let me start with this place is so snooty and full of themselves. I've had reservations","useful":1,"cool":0},"YCr62RAPV0BxPcQPCJvaJQ":{"text":"Galatoire's was recommended to me by a New Orleans native.  I thought the service was wond","useful":1,"cool":1},"3_c6-gk6ntfmmAPuKw8C3A":{"text":"My recent lunch at Galatoire's was a fantastic experience as usual with good friends, good","useful":6,"cool":6},"QMNUiAtaBhxP5hkOfXbHtw":{"text":"Galatoire's is the quintessential old-line New Orleans restaurant, committed to culinary e","useful":2,"cool":0},"bFWiAsFxN3jJ_6XAFOUDNw":{"text":"My absolute all-time favorite!!!\n\nI have been eating here for 40 years now and have yet to","useful":4,"cool":0},"QIwrkgHHkZbuFE-7pZNyaw":{"text":"How have I never reviewed Galatoire's? As locals, we have the luxury of dropping in anytim","useful":13,"cool":9},"WjNjDgpx7ojBs__6wReCfw":{"text":"Excellent food and service!   Every time I go to NOLA, I try to visit new places.  This ti","useful":0,"cool":0},"ZPMPxiaipfxKEnBK59KIFg":{"text":"Enjoyed Galatoire's when we lived in New Orleans, & during subsequent visits since moving.","useful":1,"cool":0},"TSFDwTimdPwZhSu0Ms1GSQ":{"text":"The restaurant clearly states that there are no reservations for Friday lunch and that the","useful":2,"cool":0},"EhqUys_ry1meKOy1RHV7Uw":{"text":"I came here with my fiancés family and we had a wonderful meal together. I can't believe h","useful":0,"cool":0},"C4yZULEApz95tZ1aR7TlNQ":{"text":"Eating at Galatoire's is a bit of a pain. You must make reservations weeks in advance and ","useful":5,"cool":4},"R0FimttS1ZwBReR8ef-vJQ":{"text":"Had Felix's turtle soup in Pensacola last year, and instantly became addicted. Was excited","useful":2,"cool":0},"5ZM-INxzdZ2UeYGYUuWvlQ":{"text":"Less than stellar review. We arrived on a Sunday night\nto celebrate my wife's 30th birthda","useful":3,"cool":0},"xC7_VptxEC4X4u1M3Sjqsg":{"text":"So me amd the wife are in NOLA for a conference. We wanted to get something to eat at gala","useful":5,"cool":0},"qHygtMN2qJMGryle7WHmAQ":{"text":"Unfortunately, we had a bad experience here starting with our server throwing our silverwa","useful":2,"cool":0},"E-sJKW4m-LEdXXVQdCGD9w":{"text":"Full disclosure, my friend brought a water bottle in from car and the look on the servers ","useful":7,"cool":0},"fv0suWAOQucddJ9f7G58mA":{"text":"I was crazy excited for my first dinner here last night- I'd talked about eating at Galato","useful":4,"cool":0},"2z16dqE8EWUHBXpWDfcSOw":{"text":"Meh, better options in New Orleans for sure.\nCame here on a Saturday night of Halloween we","useful":2,"cool":0},"BlbjnlZqlvT0FBNW8H_iSw":{"text":"Bonus points for historical significance, but in my humble opinion, there are many restaur","useful":5,"cool":5},"BBBFu6keS6AbKwRXzlxsaw":{"text":"I had been counting the days until I got to try the wonderful Galatoire. I talked so much ","useful":1,"cool":0},"qgnjEeyuV7RRtq9JvlSFLw":{"text":"Not worth the effort it takes to get dressed up to meet their dress code. Even if you meet","useful":3,"cool":0},"lkn4ckv2PFU1KRaUO9r2VQ":{"text":"Galatoire's is an absolute New Orleans classic. Friday lunch is the best time to grab a me","useful":1,"cool":1},"WK2Nj9IEreUkEWjeN55DlA":{"text":"Galatoire's on Bourbon Street is the first of the holy trinity of old school New Orleans r","useful":5,"cool":2},"b2Jx1XiKjuPXatxjyHtDrA":{"text":"Wow!  This old-line New Orleans place sure does deliver!  It is gracious with marvelous se","useful":1,"cool":2},"zkX4z6bGw0z3_ubZJhWZfA":{"text":"Well I had to go and exercise my house account charge so it was time for a road trip.\n----","useful":1,"cool":2}}