{"aDCHU3jaQD0FJv9oXA3fAQ":{"text":"The best hurricane according to our hotel concierge. Was indeed a good one. You are not su","useful":0,"cool":0},"rz1VkkNqmZDiLxDTI1WFNA":{"text":"My main desire for going here was to be able to brag to my alcoholic friends that I have b","useful":3,"cool":1},"1Kei7elOFUgm9YNws1ZUVw":{"text":"Lafitte's is a must stop during any visit to New Orleans!  Of course, you have to stop by ","useful":1,"cool":1},"iML6BKs1YqQshTX10a1ApQ":{"text":"With it's wonderful history, Lafitte's  is an unconventional soft spot for locals and a fa","useful":0,"cool":0},"fxdUksZkXIB7e0N_Gi-oEw":{"text":"The only reason to hit this place up is to say you've been to one of the oldest bars in th","useful":0,"cool":0},"LiX6Jgwu2Jn_hrAHe8YdNg":{"text":"Super dive. But it is the oldest bar so what do you expect??  \n\nThe hurricanes here are th","useful":0,"cool":1},"bW1xUeVRBN93vhG--LFh3g":{"text":"I've been here like 3 times. It's a great spot to get a drink, away from the madness. It's","useful":0,"cool":0},"QfuxlIk6DjKLBNvU2oXYuw":{"text":"I thought this place was cool. I will come back here again. I hear they make their hurrica","useful":0,"cool":0},"eH5Eez41J-qJmMEl6NDLKQ":{"text":"So busy I barely spent any time there.  Amazing building and good drinks.","useful":0,"cool":0},"arC8R9sRaR6HIZMBhGXUYg":{"text":"If you of age, and in New Orleans, you have to come to this bar at least once.  If memory ","useful":1,"cool":0},"Zn4C_MT_uxqFx7lwqeWU6A":{"text":"Way better hurricanes than Pat O Brien's! Neat atmosphere, friendly employees.\nWould defin","useful":0,"cool":0},"hLWAx3M77dZDL_bc2tGm2w":{"text":"This place reeks like vomit. I can only imagine how trashed people get here from that purp","useful":1,"cool":1},"ejzINia4zUgS8xi72wZqbg":{"text":"beyond cool.  chill out while the piano player takes your request, in this dimly lit by ca","useful":0,"cool":0},"PXLaDl25tE36RW6aLpW6Sg":{"text":"Oldest bar in the area - something like that.  It's very cool, nice beer selection - very ","useful":1,"cool":0},"5nKAcRVC8KG5s31YHy25gQ":{"text":"Cool structure and history, but average for a bar.  Frankly, a little put off by the adult","useful":1,"cool":0},"bEiqGg23rFnPCYQy-_tuNA":{"text":"Great place and we really enjoyed ourselves. To understand where my review is coming from,","useful":0,"cool":0},"lLtV9BPOCMBE3Z5vVlfyWQ":{"text":"I stepped into a time machine and went back in time (200 years)!!!\n\nWhat's to complain, lo","useful":0,"cool":0},"RItw-5gAuQa6uIaLIiiQbg":{"text":"This is the epitome of what a New Orleans bar should be - old, dank, a little creepy, and ","useful":0,"cool":0},"HoOIrRhzh8_NMLLlEZVBgw":{"text":"Overall a really cool spot to stop by in the afternoon or night. Mostly candlelight. The f","useful":0,"cool":0},"mj1hoRnpRVIqE5l6v7KxLA":{"text":"The piano player \"Lucky Lee\" was awesome!  We stopped in for a drink and ended up staying ","useful":0,"cool":0},"Ca_daQcQq6O6qzXKH5E23w":{"text":"My favorite bar on Bourbon! Whether you're a local or a tourist, you can appreciate Lafitt","useful":0,"cool":0},"ejHRR5mG8uzcjOZFcyKCsw":{"text":"LOVE this place. It is officially one of my favorite bars in New Orleans - and that's sayi","useful":1,"cool":1},"PhrnZD717jGFEVQtXIIe1g":{"text":"Staff mostly concerned In playing crappy r&b music in a city that has the best music on th","useful":0,"cool":0},"9l2kG1C2PYlGqDOj-heYqw":{"text":"Out of all the bars I have been to in the French Quarter, Lafitte's Blacksmith Shop is by ","useful":0,"cool":0},"xF2hABVMdQ55CmwIRRVEiA":{"text":"Lafitte's Blacksmith Shop is by far the most interesting and unique bar in the French Quar","useful":0,"cool":1},"U0a6lkmWOUKC5H4jyOHW0Q":{"text":"Very cute looking building on the corner at one end of bourbon st. Usually has good amount","useful":4,"cool":4},"AdDmqxZ4h9RomzCE613AlA":{"text":"A local hangout with a good mix of tourist too.  Noted as the oldest bar in New Orleans.  ","useful":0,"cool":0},"AgKPNth-XTnE1sixXHN08w":{"text":"The Vodoo, best \"purple drank\" in New Orleans! Bar with history and atmosphere and a dog f","useful":1,"cool":1},"-k7s9lIMyv5osO0047dY3A":{"text":"Overrated - drinks aren't great here. Neither is the ambiance. With so many better options","useful":0,"cool":0},"bzoUVlL7GW57XJhX1OF4Zw":{"text":"This bar is a must see for anyone visiting NOLA, at least that's what all the tourists mus","useful":0,"cool":0},"AHu6zKIquKKqkmrWMCRHWQ":{"text":"Oldest bar in the country. An absolute must while in New Orleans. Start here early or go l","useful":1,"cool":1},"ggR8C5N-ZcXiRf1gitbPWQ":{"text":"I love New Orleans....but I dont drink, so I'm mostly there for the food and the music. Tw","useful":3,"cool":1},"AL1oPzaQo_C4XjzQZFbmUA":{"text":"I love history and being in historic places... especially drinking while I'm appreciating ","useful":1,"cool":1},"I0JRF2tsiZYpZ0jSBszlRg":{"text":"The drinks to get here are  \n\nHurricane & Voodoo\n\nOk, the hurricane is not the Pat O's ver","useful":2,"cool":2},"CfT4DYtA3KwMukIKacz2Rw":{"text":"Wow...I find it coooll that I had beer in one of the oldest bars in the US. Built in the U","useful":0,"cool":1},"-TDuciM0yMJuP8nj33qpUQ":{"text":"Awesome place.  Best Bloody Mary on earth.  Cool atmosphere and I guess the oldest bar in ","useful":0,"cool":0},"-d7U9Jr8Nf1Xbpju0TIbBA":{"text":"One of my favorite spots during our recent trip to New Orleans ... Stopped in several time","useful":0,"cool":0},"uATLkddGGmuP4eYCHEIsvQ":{"text":"Lafitte's is one of my favorite spots in in the FQ.  I've been back several times, with fr","useful":1,"cool":0},"lz8JEKa_g7eC4YFAXOSDHQ":{"text":"Must see at anytime. They have food, drinks, and ghosts. There is always room there anytim","useful":0,"cool":0},"hzHSwWb5OIQoMUxDSVyijw":{"text":"Good drinks, good (real) music provided by the man on the piano, and a whole lot of darkne","useful":0,"cool":0},"OS8ywbGDU76mDOSMfbuTaw":{"text":"This place is said to be the oldest bar in the country, and it about feels like it. We wer","useful":0,"cool":0},"8Bi0xYX4Ro-WStEGg-x2yQ":{"text":"As a stop on my \"bar crawl\" through NOLA, I definitely enjoyed this bar. It was a fun, lai","useful":0,"cool":0},"kWlnDO21OJFf3dYufVkElQ":{"text":"I love this bar! Drinks are strong  but tasty.  The history is incredible . The people are","useful":0,"cool":0},"ttGY_ffDNUiGiMS2rxgciw":{"text":"My favorite bar, ever.   Although the address says Bourbon Street, this is well down from ","useful":3,"cool":3},"IgwAkHBGuZJEo4FuHFmUbg":{"text":"Out of all the bars in New Orleans, this isn't really my favorite. Granted it has been aro","useful":0,"cool":0},"1WFcymWzg0_5sNnBewz-Ng":{"text":"This is the best place to start or finish a night in New Orleans.\nThe atmosphere has been ","useful":1,"cool":0},"2ztaMOmHUvOkdttDtJ8_FA":{"text":"This was definitely a different kind of experience. The interior is mainly lit by candleli","useful":0,"cool":0},"Td_K5k02Vhjl3A8EtnTbaA":{"text":"One of the oldest bars in the country and when in NoLa you have to come have a drink here.","useful":1,"cool":0},"7MWqWeUICqffOm-t4JZCCQ":{"text":"After few hours in the craziness of Bourbon St., I was looking for a less crowded and less","useful":1,"cool":0},"09RJSD1OI-poab2I3awKdQ":{"text":"One of our favorite places in NOLA for drinks is Lafitte's. They have live music...aka pia","useful":0,"cool":0},"-d3cNAr-wFtZMAhYlTscUw":{"text":"Hmm I was torn between giving it 3 and 4 stars. Honestly, I would give it 3 1/2. It's supe","useful":0,"cool":0},"rFNawO5-IXO-BNTQ0P2SLA":{"text":"This place has character and charm.  An evening spent with great company, drinking Dixie b","useful":1,"cool":1},"vsoa3MhFSV34UnykcAHXww":{"text":"Time warp - but in a very good sense.\n\nStopped here as part of a ghost walk group and for ","useful":0,"cool":0},"ORBbHNdNWlXxbtKCzM8t1w":{"text":"Strictly OK. It manages to be one of those touristy places that is always crowded. What I ","useful":9,"cool":12},"mECFJN3xG-2xENjWc5DJFA":{"text":"great bar to get away from bourbon on bourbon...\n\nwent there to kick off my friend's rauco","useful":1,"cool":1},"HbwQ9pHGYfjryOvZNjmM3Q":{"text":"This is the best little place on Bourbon St. My first drink in NOLA was from here and the ","useful":0,"cool":0},"_rFfCWsw6SJvHLBUTwt4rw":{"text":"Lafitte's fits the bill! Love this place!  Service is awesome.\n\nBe sure to ask for Bre, sh","useful":0,"cool":0},"e8ThSmpLdrQRAL4xcWmGhA":{"text":"Great little bar, cozy patio... But 19$ + tip for a Coors lite and a jager red bull? You s","useful":0,"cool":0},"QeXfzYje1Lu4DM2BMOqI0A":{"text":"Ol Jean Lafitte's is hands down one of the best places to enjoy a beverage in the entire c","useful":1,"cool":1},"OZw-k2hGrIOdeYmEw0QfOQ":{"text":"Best bar in the Quarter. Whenever I have guest in town that want to do the whole Bourbon S","useful":1,"cool":0},"ot6X42kk7QNmZ1o3EWEhwA":{"text":"very cool bar with an interesting history. Bar tenders were really friendly to us, but we ","useful":0,"cool":0},"8z5f28mNB91kOphbNZlpGg":{"text":"The oldest bar title makes it cool. Kinda divey, but laid back and cool.","useful":0,"cool":0},"IXHTuCkdkITkUR8YU2n5Pg":{"text":"It was cool to get to go to the oldest continuously operating bar in the country. It had a","useful":0,"cool":0},"XZjx5TFKjMhqmrpP2Dx1kA":{"text":"When I used to go here, it was a dark, quiet little spot on the edge of the French Quarter","useful":0,"cool":0},"s8OYyV6gRpgMpg9i3DFdCQ":{"text":"Stopped in for a cold drink during an afternoon of walking.... Not a mistake by any means!","useful":0,"cool":0},"y7v__4-sB8rnNyJayV5W3Q":{"text":"I'm from New England.  I tend to cringe at places that make boastful claims about how old ","useful":1,"cool":1},"lJYIb2sHzQSBv-kSTYoKfw":{"text":"Hey now you're an all star, get your game on - go plaaaaaaaaaay!\n\nGreat, chill, dive bar","useful":0,"cool":0},"DYph88LO1Ci4dIYAS-aZWQ":{"text":"How cool is this place! Was in New Orleans with friends and one of my buddies convinced us","useful":0,"cool":1},"BeOvxBAkdbr84am3jKJswQ":{"text":"what's NOT to love about the oldest bar in America!?\n\nIt's interesting now, as there is a ","useful":2,"cool":2},"ojz-GYzBL4yzH0pj1DSexQ":{"text":"Delicious purple voodoo daiquiri! Very cool old building with lots of character...but it d","useful":0,"cool":0},"jJZXpei0pYzMp2uyQbXpOg":{"text":"Stopped here during a ghost tour while on NOLA vacation, they say this place has the best ","useful":0,"cool":0},"xjF4GNfy_PPbeYTmwblYXA":{"text":"loved the candlelight and live music. No electricity :)","useful":0,"cool":0},"_OCx6yAWEpYrwXxB0aGnYw":{"text":"Very interesting, oldest structure in US (1700s) used as a bar. Love the open seating by B","useful":0,"cool":0},"E7dX2YB2HJaKXALjcIcCmg":{"text":"My wife and I visited here for some cold cocktails on a typical New Orleans day....humid. ","useful":0,"cool":0},"2d7-0qTgA_HER8re7E3S3Q":{"text":"Love this old place.  The music may be a bit too loud for conversation but you can't beat ","useful":0,"cool":0},"eIa9mr4BWrtPZhwgQTEatw":{"text":"If your debating taking one of the voodoo, haunted, or vampire tours in New Orleans come h","useful":0,"cool":2},"b3ve1BdKwaDr_FpBH93QVw":{"text":"Old bar full of charm.  Was told that they make the best Hurricane's here and I would have","useful":0,"cool":0},"y6OZYEB0vKahOMEzCk1rSQ":{"text":"My favorite bar while in New Orleans!! Outside everyone was having a dance party and the d","useful":0,"cool":0},"AftAfpI0YjHvCIidVPji_Q":{"text":"This place may be on Boubon St., but it is separated from the more obnoxious parts.  The b","useful":2,"cool":0},"lFq3K-flrbG8Y9EY1bOJXg":{"text":"Lafitte's is, hands down, the best bar on Bourbon! Such an amazing, authentically preserve","useful":2,"cool":0},"OfL0Yo1_Kw_tZM1sppfkMA":{"text":"I know I am definitely in the minority giving this bar a 3-star rating but honesty makes f","useful":0,"cool":0},"0vFFpelw2qTDkhjPkUIszA":{"text":"I absolutely love this bar.  It is one of the oldest bars in America, if not the oldest.  ","useful":2,"cool":1},"Nknw27RVQN-h3x3i_fuS3Q":{"text":"Legit, have to check it out just for history's sake. The t.v. is sad to see. There was a l","useful":2,"cool":0},"xd6eWn93KjRTMkNJF8pJtA":{"text":"This is my second home away from home in N'awlins.  I lounge here during the day as it is ","useful":2,"cool":2},"GWgHpJBZplcwddGaUQyaTQ":{"text":"While on a carriage ride in New Orleans we pulled up to Lafitte;s and our buggy driver tol","useful":0,"cool":0},"dSLt-RE07y3Y6RLZqpgNfg":{"text":"Made friends with other tourists. Great place. Friendly staff both times here. Caters to t","useful":0,"cool":0},"q4705yBlJGjTTlpGoQD2FA":{"text":"The last day of our New Orleans trip was rainy and muggy but it didn't keep us from spendi","useful":0,"cool":0},"GjmDATDeAXprdGjypf5zMQ":{"text":"Love the concept and the history, but the execution just didn't work for me...\n\nDark, dank","useful":1,"cool":0},"4ADfghWbcWqZTZjzKQMRbw":{"text":"This place is pretty cool during the day when you can find a place to sit - it has an old,","useful":0,"cool":0},"oie9LgPMBG4eM-1Qv8avrg":{"text":"Historic. Lit almost exclusively by candles. Smells like decades of vomit. Its hurricane i","useful":0,"cool":0},"sfhyTAT62dyjD7XcWv5uhg":{"text":"Lafitte's ended up being a favorite bar of ours during the recent New Orleans trip. A frie","useful":5,"cool":2},"uNFb8ERWf9I8-IbyjGTJPA":{"text":"Neat bar (really old), not so great bathrooms.  Worth it to stop by for a drink then head ","useful":0,"cool":0},"tOD5d_83zhUFAXsXOWC8Pg":{"text":"We were here a couple of times the week after Christmas.  I really don't get the hype - th","useful":0,"cool":0},"dicBxNbWwmwjbG9asyjTfg":{"text":"This bar is a must see in the quarter, at night it is lit by candle light alone, and has i","useful":0,"cool":0},"CG7eY4GQ4thkeBgQcFMUhw":{"text":"I am no fan of the French Quarter, but recently I am being reminded that it is not all bad","useful":9,"cool":8},"UAhVx2L5--4HK9mJclTwhA":{"text":"Fantastic chill bar in the Quarter.  Old and dark with a smell you can only get on Bourbon","useful":0,"cool":0},"3XWytYRp3S8QoiYBQJzZOA":{"text":"further down Bourbon Street and so worth it. Its one of the if not the oldest building in ","useful":1,"cool":0},"fX1e7cIZBnXoy5SdqlzdTA":{"text":"I give this place a four star rating just based on the history. I don't mean to sound rude","useful":0,"cool":0},"dfaL-a5cwSOcc1cOxMMW0A":{"text":"We love the atmosphere and employees here but the drinks are great too. I tried a couple o","useful":0,"cool":0},"jZ4X2VdzH1tkZMU-v4VdcQ":{"text":"one of my two favorite bars in nola, mostly because i'm a loungey, low-key bar kind of gir","useful":4,"cool":2},"KM5FyabXjxQaP-vsn2_O_A":{"text":"This bar is tucked away at the end of the Bourbon Street further away from all of the madn","useful":0,"cool":0},"F_-cey1KKwvaz7nFfhrSPw":{"text":"Great place for week night drink. Sit down have a sazarac and request songs from one of th","useful":0,"cool":0},"Ib_CFseAiRoHz3r4fi0NhQ":{"text":"Loved it and my wife enjoyed the history and non touristy part of Bourbon. The hurricane w","useful":0,"cool":0},"07ccVHOsMbWpEICSNEv42g":{"text":"I've been to Lafitte's before, and I definitely don't remember it like it was on my most r","useful":0,"cool":0},"bnQGZ6BP_I2KFqKjjO3JRg":{"text":"Every time I'm in NOLA my first stop after the hotel is this place. Nothing kicks off a lo","useful":3,"cool":0},"cRih5Jn_wBFM8LCG0naFHQ":{"text":"Great atmosphere. Good customer service and awesome history. Strong drinks! LJ was awesome","useful":0,"cool":0},"QtBJOeFZMZ9--T5BD6x5CQ":{"text":"A Staple! The history alone makes this place a stop. You must try a Voodoo Daiquiri or a H","useful":0,"cool":0},"9U8mXL4WyzWTf6kWViwPsA":{"text":"Cool unique place! On the out skirts of bourbon street but definitely the best place to go","useful":0,"cool":0},"7FutygngA3qt_RKGtFETfQ":{"text":"Supposedly one of the oldest, if not THE oldest bar, in NOLA.  Lafitte's also had a piano ","useful":0,"cool":0},"erNkGmTphskrKhp8fOp4NA":{"text":"We were told to check this place out from a local while drinking on Lakeshore.  The oldest","useful":4,"cool":1},"--jTxC8QbbN1NT0kx9JCZQ":{"text":"Nice place to relax... And have beer. Just like feel back to the last century. \n\nCan't say","useful":1,"cool":1},"VcfjvjVfNzLikzwKm7akeA":{"text":"Within the first thirty minutes we saw a pirate, a cowboy and a guy in a cape...and the ni","useful":0,"cool":0},"k1UXFJA6imYV82kRKEZPdA":{"text":"Home of the original Hurricane! \n\nThis one is made of real juice and not with mix, drink f","useful":0,"cool":0},"a7hzF86IrC-urGKikdIluA":{"text":"Awesome place. Not at all like Bourbon Street's dirty wild crazy ass crowd. This place was","useful":0,"cool":0},"ACoG3SrV9NrVE4HaiwqtJQ":{"text":"Wandered in here on a weeknight in August.  All of their beer taps were marked \"out of ord","useful":0,"cool":0},"LiesvxTiL6kulEU7tYHwmA":{"text":"What a cool bar. Thought we would check it out after reading about it on Yelp. We were not","useful":0,"cool":0},"NT0QjgEYOzDDqGZjfIgdFQ":{"text":"MUST DO! Oldest bar in America. So dark, strong drinks, piano bar, drunk people. Just do y","useful":0,"cool":0},"gcWphv0NYABHgUKD7oLg4w":{"text":"This is the oldest bar in America which is so cool! The entire place is lit by candles at ","useful":1,"cool":0},"48AL_C-oO1GBAfwBUXjyMw":{"text":"The oldest bar in the USA is also one of the cooler bars on Bourbon Street, located toward","useful":3,"cool":2},"6DLHIVyFxSx5ilzQtRH5wA":{"text":"So dark in here, wow! I'm sure in other cities there would be regulations against this lac","useful":1,"cool":0},"OmJttt-_rapcopEQDoTIYw":{"text":"This is a most stop, on occasions multiple times a day, while in New Orleans! \n\nThey alway","useful":0,"cool":0},"miziKemQvsNcbxRDRBFsjQ":{"text":"My sister insisted that I come in here for a purple daiquiri. INSISTED.\n\nSo my partner and","useful":1,"cool":2},"b1E-hsztxjI0oEXwrTHoTg":{"text":"Cool ass bar tons of people just hanging out having a good time. Oldest bar in the USA sin","useful":0,"cool":0},"FyKcCVOF4diZ3jfIyRFF1w":{"text":"I stop in every time I am visiting Nola, because you must.  During the week, sit by the wi","useful":1,"cool":0},"HX3bgtvc9c0Yozox-Y0mrQ":{"text":"I was charged $14 per drink for a total of $28 for 2 drinks. I ordered two 32 oz purple dr","useful":0,"cool":0},"dDxmYigtklvP7Iwn4RqUQg":{"text":"Great piece of history. Made a great stop to sit in the shade/air and have a cold beer. Ni","useful":0,"cool":0},"ZDEMBTYuyoKcnRtfGWbWiA":{"text":"A place to go on Bourbon St that is far from the craziness. Super rustic (duh! it's old!) ","useful":0,"cool":0},"f5GSlf3xkIHDXmsj15XcGg":{"text":"Mike Hood is the best pianist in the area. Grab a hurricane and maybe a couple of drunken ","useful":0,"cool":0},"iGApIT8NLDhknnsi7tc65Q":{"text":"Lafitte's is the oldest bar in America!\n\nLocated on the famous Bourbon Street. From the ou","useful":0,"cool":1},"5zzyNCY825VRo7j5h-PedA":{"text":"Awesome little bar.  Came here with a local, and we chilled in the darkness that is the ol","useful":1,"cool":1},"fJLJaLwSU_1XsLCGm-AD5w":{"text":"Definitely worth a visit based on the history alone.  Very cool atmosphere with the candle","useful":0,"cool":0},"Jsgwi6z2tOBxNmNTa2Dk0A":{"text":"Spent a weekend in New Orleans for a bachelor party (you know how that goes). Luckily our ","useful":2,"cool":2},"kN4CAETPjL8r_07hwE8i0A":{"text":"This little joint (been there since 1772) won my heart over and over. I honestly cant reme","useful":0,"cool":0},"Ss4uaDleBMbvw-7JLbQKGg":{"text":"so fond of the ambiance.  makes me feel like a pirate.  I love you, nawlins.","useful":1,"cool":1},"H20R9nHDsHXTh7lEjeTA9A":{"text":"Lafitte's is not only cool because of it's old architecture and in tact fireplace from a l","useful":0,"cool":0},"5p67d2p6YSKy5tey9uTc4Q":{"text":"My friend went to request a song from the piano player and he was rude to her. She asked f","useful":2,"cool":0},"Oe4uSJ7qeh3hUrReaA40ZA":{"text":"This is hands down one of the coolest piano bars (for that matter, bars period) that I've ","useful":0,"cool":0},"CDWOxiiEvNjSpcy-t75oAw":{"text":"I appreciate the historic nature of this bar, and the crowds here aren't terribly douchey ","useful":0,"cool":0},"HwqtqV2NxPcmDP05N439KA":{"text":"This place was really cool for the historic aspect and it was hilarious to see the old dri","useful":1,"cool":0},"mMFaktHd-_teyro5tUlO1Q":{"text":"Oldest bar in America...yes please!!! I cannot get over how amazing this little bar is!! A","useful":0,"cool":0},"dcwJvCsIZPI02BQpkHiL1Q":{"text":"Cool old bar with a piano bar. Good cold drinks a few tables to enjoy the people watching.","useful":0,"cool":0},"J6HNmIB_6es1Av4cBYceJQ":{"text":"Sitting in a building that has been around since 1722 is an experience all of its own. The","useful":1,"cool":0},"VOMIvILDPEwG4oIvMyM2ww":{"text":"Best bar ever !\nWe looked exactly for this lind of vibe in New Orleans !\nIt's like a dark ","useful":0,"cool":0},"Uj9TL-KdAlzQH62wWSs0yg":{"text":"Stumbled onto this dive bar on our first night in Nola without knowing what this place was","useful":3,"cool":3},"P9BjnYYWfVmmyi7AbrV4ow":{"text":"Great time. Awesome music. There was a guy on a piano playing. Laid back vibe friendly ser","useful":0,"cool":0},"4nzOpErQBtwdDzemYFfshQ":{"text":"FIRST OFF, piano player was the most amazing thing that has ever graced my ears \n\n1 star b","useful":0,"cool":0},"OywQVk6UDO3ZLBv22WW9gA":{"text":"It was just too dark. I mean, I get it, but... we left after only 1/2 an hour.","useful":0,"cool":0},"Tb9u0HIrMi0KYVG7Zg8OAg":{"text":"Love the building.  Had the first American cocktail in the oldest American bar.  That was ","useful":0,"cool":0},"6Tn_qUlBHncxTRxGguLnwA":{"text":"Dark, mysterious and historic. Get away from the mayhem and debauchery of Bourbon Street a","useful":1,"cool":0},"bqE74fxmlRNg1bL_ypYPYg":{"text":"Cool history to the bar, and I like the candlelight. Good drinks, too! The stall in the wo","useful":0,"cool":0},"0OUA_CB4IeySJdVFgm_YBQ":{"text":"The absolute BEST daiquiri in New Orleans!! All I know is that this purple-yummy-goodness ","useful":3,"cool":4},"lV_B4FctpWYPBBsz8o-XrA":{"text":"Love the candlelight table light and the history behind the place.\n\nNot thrilled with the ","useful":0,"cool":0},"tmtVYNeoe56HsQbJ9cjmPA":{"text":"THIS ISN'T THE CAFE LAFITTE'S\nI have come here twice and both times have found this place ","useful":0,"cool":0},"GXL26iy3cnypMpdxLCCJ6g":{"text":"Terrible service, bartenders were very rude both times we went. Not to mention lack of dec","useful":0,"cool":0},"ahtSNfRJma2UNoGf6z2l2A":{"text":"Was a great place to have an ice cold beer on a hot Saturday afternoon.","useful":0,"cool":0},"lGZUKxPBiwgsAm0TANWaXw":{"text":"I'm not sure what all the hype is about but honestly, Lafitte's Blacksmith Shop was really","useful":1,"cool":0},"hBtfRgRGC2Z22tlV7hSRPA":{"text":"French Quarter tourist trap, but pleasant, relatively inexpensive, and a great atmosphere ","useful":1,"cool":0},"YPLw_XCjXBTutW-dupSP7Q":{"text":"How can you not like a bar lit by candles from the 1740's? Take the ghost tour before you ","useful":0,"cool":0},"dUer6gHuMD9Rnhi8lrQxWw":{"text":"Having a drink at the oldest bar in the U.S. (circa 1722), was definitely cool!  Just sitt","useful":0,"cool":0},"x7YdjwluWIFcvR-ntiOuew":{"text":"A must see! The oldest bar in the entire US. It's very dark in here but there is a piano t","useful":0,"cool":0},"cQQAr3GBAhb5wjBTMKgUYw":{"text":"295 years old. A great place to wet thy whistle!","useful":0,"cool":0},"5BMc94oUF_88tZvySB6fRw":{"text":"LOOOOOVE IT!!\n\nI love that it is one of the few piano bars in the city. It is also oldest ","useful":0,"cool":0},"NwQPCiIEJR4H1A8iOorXog":{"text":"I don't know why people seem to love this place so much, it didn't stand out much from any","useful":0,"cool":0},"Qt7uyU1MeJ3EoprRYwCALw":{"text":"This was an awesomely cool bar!  Formerly owned by the Pirate Lafitte, it is supposed to b","useful":1,"cool":0},"Kniie6gJ0M-LltM0Kndavw":{"text":"Overcrowded and disgusting. I am a big fan of dive bars but this was next level gross and ","useful":0,"cool":0},"WN0PLqKHwU2wYyieNNj8EA":{"text":"Met the owner, very nice guy! Purple voodoo drink was good but kept giving me a brain free","useful":0,"cool":0},"Jju5jqYLsHo6TZIBuMSU3w":{"text":"Apparently the oldest bar in America. We came pretty late during the night, so it wasn't r","useful":0,"cool":0},"QytwnNNS9oaMc3tTv7DU4w":{"text":"Great hangout just outside the tumultuous section of Bourbon St. Friendly bartenders who r","useful":0,"cool":0},"N7ma0-nNpnV3ABxfhcSQpQ":{"text":"The voodoo daiquiri is delicious! It's not too strong and I love how it is a slushy. It ta","useful":0,"cool":0},"eihm7H4DXXcjGb82bq9ysA":{"text":"Definitely a calm port in the storm that is Bourbon Street.  A must see when in the area s","useful":0,"cool":0},"zJFC_5y2M9JrnGFkzalIrQ":{"text":"Cool place - go at night. There is only candlelight, well, and the TVs and Internet jukebo","useful":0,"cool":0},"jFuo1T1iMJWp6HsAW90o0Q":{"text":"This is one of the most clean bars on the street!\nFriendly staff, and it is the oldest bar","useful":1,"cool":1},"kmsIBSX3FHM9LczvT-V-iw":{"text":"This place is on the other end of Bourbon street. Great place to just get a drink and sit ","useful":1,"cool":0},"RRu-RngyaJ4_PBaSgyD3rg":{"text":"Ended up coming here cause someone recommended it. The \"Purple Drank\" wasn't awesome or ch","useful":1,"cool":0},"vcbXqiOwFb3LAUz2TJQcnw":{"text":"Nestled in the far corner of Bourbon Street, this bar has some real historical significanc","useful":3,"cool":1},"l16cvny_MYwCT-_dA-IvgQ":{"text":"Watch what they pour.. A friend bought me a specific bourbon and I watched the bartender p","useful":1,"cool":0},"fBSP_GxCkbx1kRBeUdyvKw":{"text":"Lafitte's is a fantastic place, and if you are traveling to New Orleans, a bar you must vi","useful":0,"cool":0},"GiL8M3qWLNoaW_2uHrT05Q":{"text":"One of my favourites on Bourbon Street. It's old, the lights in here are just candles that","useful":0,"cool":0},"6bE3dRzhSwHp32R5RmWXIg":{"text":"It's said that this is the oldest continuously operating bar in the South of the United St","useful":0,"cool":0},"1SbdvqW2Ehmz0tH1dT9EBA":{"text":"Hands down, the best bar in the Quarter!! Drinks are poured properly, people watching at i","useful":0,"cool":0},"NXB_qHwrIc7Mkp5q5YS8sw":{"text":"Super cool bar with awesome 18th century decor. Candle lit. There is a piano in the back w","useful":0,"cool":0},"giYObTfqi7wpECZ0zhQcLQ":{"text":"This bar made my day, dimly lit, great crowd and excellent bartender service. They take cr","useful":1,"cool":1},"NR4knj4h_a3tKRzkuJpNtA":{"text":"Everybody has an opinion as to where in Nola has the best Hurricane.  \n\nLafitte's is it.  ","useful":1,"cool":0},"t1uOsQAjdJC3kp1NIBBWzg":{"text":"Such a neat place. They used to only have candles for lighting and had no electricity. Now","useful":1,"cool":0},"3h-UABxA84TE0tVoJ3Og-g":{"text":"We stopped in for a quick drink. The bartender was very friendly and the overall atmospher","useful":0,"cool":0},"ennEFF_jKHWsPJqGXgNtDA":{"text":"One of the coolest and most unique places in the french quarter. The way the place is lit ","useful":0,"cool":0},"9KeHtjRxeMH4r5aM6DfoJQ":{"text":"Stopped by as part of a tour....amazing Hurricane! Cool place oldest bar in the country...","useful":0,"cool":0},"mtb9CFNuge_ZTDsfWmUzcA":{"text":"Best candle lit bar!\n\nLove this quaint little place with piano bar and good drinks!! \n\nIf ","useful":0,"cool":0},"v8qao7xcs6bn8QLnI68Blg":{"text":"Destination bar each time we come to NOLA. Great fun. Tradition to be seen. Great place to","useful":0,"cool":0},"JNfqfM6sZtKLrAaPYUJ-Jg":{"text":"cool place! the front is a typical bar with typical music. then you go to the back and the","useful":1,"cool":0},"izk0CLi86IMYbHEsd9Ezgg":{"text":"I adore this place...always a pit stop for me when I come to visit NOLA...the history, the","useful":0,"cool":1},"l0BILqyCPm-WejCue0dkug":{"text":"As it's the oldest bar in the USA - it's definitely worth the walk to visit it while in NO","useful":1,"cool":1},"AbonmjRDHk8EUVmi59jvxQ":{"text":"Wandered in on a Saturday afternoon and, as the inside was full, took a seat outside. Kind","useful":0,"cool":0},"VVtqZtb-4uZyt-YYPqPpag":{"text":"My favorite place in the French Quarter.  It is a great place and they make the best drink","useful":0,"cool":0},"2_W1Go7pK0uoniQP5VWM5g":{"text":"Do it once, have a drink to say you did, take the picture and get to Frenchman Street. It ","useful":0,"cool":0},"Y6ivxbsxLuY_L313VzmqpQ":{"text":"We visited NOLA to celebrate a friend's birthday and this place did not disappoint!  It's ","useful":0,"cool":0},"cirbFvRexIEVz3iO4tEDdA":{"text":"The atmosphere is cool, mostly because it is old and feels historic.  The drinks were reas","useful":0,"cool":0},"HIBI4fxMs1WJp9sRKD8QHQ":{"text":"Cool place, great atmosphere.  Purple voodoo was good and the service was excellent for a ","useful":0,"cool":0},"7QoilQCcAoAxcj5buyoPHQ":{"text":"MY FAVORITE BAR IN NEW ORLEANS. It's supposedly the oldest bar still open in the United St","useful":1,"cool":0},"D6pIF83zJi-0EnCg9CTzJA":{"text":"Don't come here for a crafted cocktail, but do come to have a beer, whiskey or frozen drin","useful":0,"cool":0},"TvdddaNNnPANxc4odcidRQ":{"text":"Best experience in NOLA!\nBartenders and drinks are great. Especially Bri...she's awesome!!","useful":0,"cool":0},"-GHKdqs3OIXMma7KLVya9w":{"text":"Love this place. If you come to New Orleans and skip it, you shouldn't forgive yourself. \n","useful":0,"cool":0},"kSo6i6RjXmK8pah_NyC99g":{"text":"I'll admit that I came here with different expectations than I should have held for a Bour","useful":1,"cool":0},"khzTICUT-9hhnzne551SFQ":{"text":"This was a fun stop in NOLA. Although they light the place with candles to give that pre-E","useful":0,"cool":0},"MSkOLVQHkVVw8gsEiXkRrQ":{"text":"This place is awesome. Came out two nights in a row. Second night for the piano. Loved it!","useful":0,"cool":0},"RE_PyZFTcE6XrfQzBgY1Uw":{"text":"Wow, this is the oldest bar in the USA? Old Brick, open wood beam ceiling, copper bar, dou","useful":0,"cool":0},"zwbaEEI-LLVuad85d_F--w":{"text":"Probably one of my more favorite spots in the outskirts of the French Quarters. Away from ","useful":17,"cool":17},"nR73DqQXwrcDYpE_TsuyEA":{"text":"They call themselves the Oldest Bar in the USA, although the Bell In Hand in Boston begged","useful":0,"cool":0},"0H8FBX46bWf4YN3s2f0yvg":{"text":"Lots of fun..good daiquiris. Expensive but fun atmosphere and cool building. Really busy w","useful":0,"cool":0},"VQB6gKNUEbbi_eF9Rc7Irw":{"text":"It was already packed at 4pm on a Friday. There are seats available, but the line for the ","useful":0,"cool":0},"lMhzJH2U60MG2Y7AInrrOA":{"text":"Very historic bar on Bourbon Street.  No trip to New Orleans is complete without stopping ","useful":0,"cool":0},"5x4kNdCQ-SWSJYnLLrYJRA":{"text":"We absolutely love this bar in New Orleans! This would have definitely gotten five stars, ","useful":0,"cool":0},"WHwWwkCI26mBGshz9WyFxg":{"text":"This is the most spookiest bar I have ever entered. After learning that this is the oldest","useful":1,"cool":0},"DWT8FdcU3-mjX4bbQRzEoQ":{"text":"The oldest bar in America is not overly expensive, however, has sold its soul to an ultra ","useful":1,"cool":0},"zR4btKnnxV__VxAgFi0kzg":{"text":"Unh huuuu huuuuu huuuu mon cheri.... nothing better than some late-night voodoo juice at L","useful":0,"cool":1},"fg3rQD2ZOFqso0H0EiQWGA":{"text":"Easily one of my favorite haunts back in New Orleans, I always go here when I am in town. ","useful":0,"cool":0},"5O5tUtQxi3JVUMCn2IU4hQ":{"text":"If you are walking through bourbon street you have no excuse not to stop into the oldest b","useful":2,"cool":0},"l96oIukqXvzSBE_yJuBeKg":{"text":"You already know what I'm going to say: the history behind this place is so cool!\n\nThere i","useful":0,"cool":1},"AtI0Mvy8y-y6vDxX1HIYbA":{"text":"The Blacksmith bar was a prime destination for drinks while staying in the French Quarter.","useful":0,"cool":0},"2dSJXqE48NgC7lub6-fCGA":{"text":"As one of the oldest building and bars in the US Lafitte's definitely has character. If yo","useful":4,"cool":2},"Dn_IFOiPulRzxBL2nmVD5g":{"text":"The history and look of this place is pretty cool but the douchbags from the other end of ","useful":0,"cool":0},"8194DAZhIVomqmaEio1KQA":{"text":"It's a good Dive Bar and we really wanted to love it but got a little change of heart when","useful":0,"cool":1},"0GvfNSY9xcps4rypGZJbCg":{"text":"I went here for music and restroom.\nMan, piano performance is always the best, especially ","useful":0,"cool":0},"KnSFzhf4iuRyoGsa5MkCig":{"text":"*Warning* The following review is based off of data collected while under the influence of","useful":3,"cool":2},"R4B9wNzdjEgZU_qV8ydocQ":{"text":"This place is basically a haven from the mayhem of Bourbon St.  I would have walked right ","useful":0,"cool":0},"zRIC_X9gYwpruQ2lmylD-g":{"text":"ok olders bar in the quarter, step into the time warp again. the ghost tour runs through h","useful":0,"cool":0},"yfSn2vXE1DUui8XqbIY4jw":{"text":"Since I consider myself something of a dive bar aficionado, the chance to visit the oldest","useful":4,"cool":3},"0omY6pg7ckFI3PBkPsTuIQ":{"text":"The purple drank got us into the zone. What a night. I highly recommend trying the purple ","useful":0,"cool":0},"lnn2giyg2v1FrS38lRC3Rw":{"text":"This is a definite go to if you come out to New Orleans. Not only can you experience histo","useful":1,"cool":0},"T4OGJ9qKB7WtkJK9Lt4X2A":{"text":"You'll remember your visit here for sure. The building has so much history and a lot of th","useful":0,"cool":0},"IZwtRX-xDmCRUk6sPWpc-g":{"text":"This bar is small and cozy. Drink prices are average. They have drinks they get from a slu","useful":0,"cool":0},"ljo-g-wslh15O6eu9g2aqQ":{"text":"Every time I'm in New Orleans I make a point to stop at Lafitte's.  It's on Bourbon Street","useful":0,"cool":0},"Ov9B5C2B1nUyAAAa5ohPKQ":{"text":"For a week it has smelled like throw up\nAm I the only one that can't handle this smell?\n\nI","useful":0,"cool":0},"dhCCBjuGWkqwyJWCMD1L5g":{"text":"Lafitte's pretty much sums up New Orleans, and finding places like Lafitte's reinvigorates","useful":1,"cool":0},"C6_MbT2D8d9A8FHdlwsNqg":{"text":"What can be said about NOLAs oldest bar that hasn't been said before . Don't leave without","useful":0,"cool":0},"y01k-_hnf7s76cGHDxubRw":{"text":"Do not miss this stop along World Famous Bourbon Street in New Orleans. Lafitte's is said ","useful":0,"cool":0},"tCnNh5QpBL3HIBYd8eu5Hw":{"text":"I wish I could say this place was amazing, especially knowing about the history of the pla","useful":1,"cool":0},"89y2I9-BtIAcmG4RBTMf7w":{"text":"We stopped here later in the night for a few beers. Very cool bar and building. Great way ","useful":0,"cool":0},"AGMWyU4IRtF8OndBgHAPdA":{"text":"This place is just cool,,, I've been many times at night and it is always a little to pack","useful":0,"cool":0},"iynIIn7zEQ2H0uLOgw3Q7A":{"text":"How cool this little place is! There is history to this place. A smithy as a facade to a o","useful":0,"cool":0},"nBCu1iqUhrGHWql0fuqvVA":{"text":"I just come here every time I am in NOLA to grab a quick Hurricane and walk back out again","useful":0,"cool":0},"6tH8o0_kTDT2yVQY1JfgIQ":{"text":"An absolute must if you have a date.\n\ndark, great music, tons of history to talk about, an","useful":3,"cool":2},"foKxr_vOdSF5K2Pg5bdUWQ":{"text":"One of the best bars anywhere, period. The building dates from before 1772 and may be the ","useful":2,"cool":3},"pEABcZ5KA38GULRYqCcmkw":{"text":"Spicy as hell bloody Mary but still does the job. The bartenders weren't as friendly as mo","useful":0,"cool":1},"XAFG3ui7M4Pod5McmvQL7A":{"text":"The front part of the bar smelled like horse $hit. Piano bar was cool. Drinks were eh. Old","useful":0,"cool":0},"J050aT8AVVlhFaUDTOC5dQ":{"text":"All I tried was the voodoo slushy (dark purple) and it was interesting but not great. Wish","useful":0,"cool":0},"XYLuKR2_RgpgkgdL_uL6KA":{"text":"Okay - this review is based on what this place is and not what I think it should be (which","useful":0,"cool":0},"XFvN7n14c1kG2dYLnn4kbA":{"text":"Cool to see during Mardi Gras! Apparently, this is the first bar in that French Quarter ar","useful":0,"cool":1},"KzsL6NIa8KTyfBAiXgHLOg":{"text":"Drinking by candle light, what could be cooler? \n\nThis bar claims to be one of the oldest ","useful":0,"cool":0},"jOz0RfvIBa5fa5xsRAg8kw":{"text":"Great bar to visit for the history. It's on the quieter, less crowded side of Bourbon, so ","useful":0,"cool":0},"1G9Xhkwn78LlMV4tsSCBvg":{"text":"This place was cool and creepy! Supposedly a haunted bar which we found out once we arrive","useful":5,"cool":5},"bPyrPC_ZNZ0IptwKuXMeSQ":{"text":"A picture perfect watering hole at the far end of Bourbon Street.  Lafitte's is only down ","useful":0,"cool":0},"otrmcYyH_xmabMOKGeGVbA":{"text":"A real treasure for the French Quarter.\nEnjoy a drink, be anonymous and enjoy yourself any","useful":0,"cool":2},"-1Y2WQaHI9iIqkAKCc7YfQ":{"text":"This place is just fun. \n\nDive bar - you know the history behind it.  \n\nStopped in several","useful":0,"cool":0},"R51f6ZfVpvF6cbELJP9Y7A":{"text":"This was our last stop on a wonderful NOLA night.  Loved the darkness and ambiance.  The p","useful":0,"cool":0},"qkZFn8A0ntFk1S9vOTXKXA":{"text":"Almost every bar on Bourbon St is filled to the brim with obnoxious, screaming douchebags ","useful":3,"cool":2},"Pn9Sfk2sJPpOql1I9Kj2yg":{"text":"This is such an important part of any trip to N'awlins, history and booze go hand in hand ","useful":1,"cool":0},"TjFanGm1exViIl7L1yWruA":{"text":"Fun~Fun~Fun!  Went there on a Friday evening.  Got a large table for our large group.  Gre","useful":1,"cool":0},"vqu5KYPiWH0OicOkZBa5iQ":{"text":"voodoo daquiri. order it. drink it. order another one to go and be on your way.","useful":0,"cool":0},"HDumEhdBlMjdEvw3_Rfzkg":{"text":"Lafitte's is one of the best bars in New Orleans.  I don't think there is really much I ca","useful":0,"cool":0},"Dl7fDG_powl5IgxqdlsD3Q":{"text":"Such a cool local bar! Boasted as the oldest bar in the city (and maybe the country?), thi","useful":0,"cool":0},"PJeWpPTJludvtqXG11dDpg":{"text":"Very good place would definitely go here again and again AND again. The service is very go","useful":0,"cool":0},"DJDzDcvqBeblR5sv7UET8A":{"text":"The best Hurricanes anywhere!!! And this is from someone who has enjoyed alot of them in t","useful":0,"cool":0},"2VxxBk-hrLU34Aduwp1z5A":{"text":"Really cool bar in New Orleans. A little bit off the usual drag of Bourbon Street but wort","useful":0,"cool":0},"0G4h2j2Rn1473DOxpgZ5Zw":{"text":"Voodoo Daiquiris are delicious and make me tipsy every time I come to Crescent City.","useful":0,"cool":0},"9Bp9i5-Uzmt7ILgxe4JTNg":{"text":"I did some digging around on yelp before we made our way to bourbon street and to my surpr","useful":0,"cool":0},"jSwk_2Z5r9_Tld8IIQFAig":{"text":"Our favorite bar! Loved the vibe and candles. Got the purple drink everyday we were there ","useful":0,"cool":0},"yW-zfs4qOP2J95AKe_HCTw":{"text":"It is the oldest bar in the United states. You can't not stop here if you are in new Orlea","useful":0,"cool":0},"-1uYwOIkrKlZoLUu2w2TMg":{"text":"I really wanted to like this place and there was certainly nothing wrong with the drinks a","useful":0,"cool":0},"TnqGLbsvV8GgEaccYisRVA":{"text":"If you don't like old, dark, dingy bars, with antiquated bathroom facilities, a mess of ex","useful":2,"cool":2},"dxWwfoR3nv-WhplwzTZEYg":{"text":"STEP BACK IN TIME\nThis was my 3rd time to NOLA, and my 3rd time to this old and historic d","useful":0,"cool":0},"m39cDNYJHWY9yYCKPEjTCw":{"text":"My friends and I went late on a Saturday night after a terrible walk-through of Bourbon St","useful":0,"cool":0},"ABLcLtqtty893YAbar78zQ":{"text":"Just wanted to knock this off the New Orleans bucket list more than anything - really cool","useful":0,"cool":0},"D47fo8oez-McxbZwaBs4Dg":{"text":"Cool bar! A must do ! Great piano singer! Always a stop before Frenchmen st!","useful":0,"cool":0},"homxZmmHR__trufUku2JXw":{"text":"Had a great time drinking the voodoo drinks and hanging out. We went early in the afternoo","useful":0,"cool":0},"N0hpV2vODr9110qfh4-CyQ":{"text":"Once owned and named after one of the most powerful pirates to ever live. Enough said. \n\nF","useful":1,"cool":1},"JfyCJrmToTEK8LQzySubaQ":{"text":"Cozy,  chill and awesome drinks. I had a hurricane. Hubby had the voodoo daiquiri. Its dar","useful":0,"cool":0},"9oGtWCi6pFVopnsG_zz7Nw":{"text":"Just OK. \n\nI understand and appreciate the history of it, and it's divey-ness, but wow is ","useful":1,"cool":0},"UDxJ5DakqsSYcvgxtB0D6A":{"text":"Green looking stuff on the ice in my drink.  Not sure if the gentleman we spoke to behind ","useful":1,"cool":0},"8oolETvsdIH314EmPVh6FA":{"text":"First time I came here, it was 10am and i was the only person here.  It was GREAT! I could","useful":1,"cool":2},"-OijNCOW5JjCH6dPVM-9kA":{"text":"This is the best piano bar in the world! I have been to many around the world and this top","useful":0,"cool":0},"7W9qremyd0GxpCv5l_lxEQ":{"text":"VIOLENT MANAGER! I'm sorry, I have to step in. All night long the manager was screaming at","useful":0,"cool":0},"uvLze-cN7kMX1R8ObS7igg":{"text":"You have to check out this place just because it is a really cool old building.  The hurri","useful":0,"cool":1},"wjZ8an7bk6cwoZl2P3plEw":{"text":"For those of us in the Northeast, coming to New Orleans is like stepping into a whole othe","useful":0,"cool":0},"rn8oEz2EPVr7tuJvb4yzSA":{"text":"Awesome bar. No lights in the bar-minus the bathroom. I say bypass the front jukebox area,","useful":1,"cool":0},"nnm6MZvgrz3CnRMGca6Nrw":{"text":"Cool atmosphere, lots of history here. Hurricane drinks are a must as they claim to have o","useful":0,"cool":0},"YZWqtyHZRO6OI9oJBE_CIg":{"text":"It's still the same. Tucked away at the very end of the most horrid part of Nola( The Quar","useful":3,"cool":1},"1vUFk7CYli-YlPfNWNpCqA":{"text":"Very cool atmosphere. It's all lit by candle (I don't even think it's wired for electricit","useful":0,"cool":0},"bJL_0fyVUWLYo-8OecvYOQ":{"text":"This place was pretty cool- it has a very chill atmosphere with big open windows that open","useful":0,"cool":0},"MBVaz5XS8ti5nOra660jtg":{"text":"My night here has been hazy. I know we spend a good amount of time but because of my secon","useful":2,"cool":1},"o7TPRjRgDi3RNXEOXtUkDQ":{"text":"We stopped here the one time we decided to walk Bourbon St.  I had no idea about the histo","useful":3,"cool":0},"19sNjqwcioVKcfuGrn0JDQ":{"text":"I LOVE the Blacksmith Shop.  It's my favorite bar on Bourbon Street.  Always go here on my","useful":0,"cool":0},"ZMaGQTISsIiMT14aRJoHZQ":{"text":"Great place! This is one of the oldest bars in New Orleans and the country! The purple dra","useful":1,"cool":0},"FLseznFDeHDt1Xx-jbmSSg":{"text":"We had the voodoo daiquiri and it did not disappoint. The service was quick and the place ","useful":0,"cool":0},"FDvSkXFtR9dp4C9soRh_-A":{"text":"Atmosphere is very cool--the building is a unique piece of NOLA history. It's on bourbon b","useful":0,"cool":0},"mNc-GANCT8RpGfGtvATqzQ":{"text":"This is definitely my favorite French Quarter bar.\n\nIt is the oldest bar in the country an","useful":11,"cool":5},"eS7hZC8_4JCRnxDB3Y0muQ":{"text":"If you want a real hurricane, one that doesn't taste like a weird kool-aid mix, go to Lafi","useful":0,"cool":0},"dPbnLIQwU8evjcPPATrYMA":{"text":"We ended up here twice.  The first was at the end of a ghost tour.  They told the story of","useful":0,"cool":3},"k412Yc8RpgxInZpP2dWTew":{"text":"The bar was good here and I was barely able to function when we got here but the drinks ar","useful":0,"cool":0},"98rswSLezVSlw-EA3CsBLQ":{"text":"It's a place that has a lot of history and I think that is the appeal? Every time I have g","useful":1,"cool":0},"hYBWg0wXH6yZbJch_WFP6g":{"text":"Neat old Tavern.  We got their craptastic VooDoo drink - I've had better (and stronger) dr","useful":0,"cool":0},"hjImgoov7JQdvJGsiR2i2w":{"text":"How cool is this!? The oldest operating bar in the United States. When you walk in it feel","useful":3,"cool":3},"844Z-5bGOhFI7n3ssQ7dig":{"text":"A nice break from the normal overran places on Bourbon St. and not too far a walk from Fre","useful":0,"cool":0},"_uEl-3DFguY2hmgHAesvXg":{"text":"After the noise and hustle and bustle of Pat O'Briens, we 2 tourist wanted a little local ","useful":2,"cool":1},"SPzkmeFszKC1aoDyJGmKjw":{"text":"Old bar, strong drinks. The piano area can be fun when the pianist is being friendly, whic","useful":0,"cool":0},"rIG8VrqVficTg_jr_NbKsw":{"text":"The oldest bar in North America and two doors down from a friends apartment.  It's very da","useful":0,"cool":0},"UQyA-qBKNAzYIDk2SG9EBw":{"text":"This place gets 4 stars not for it's drinks or it's decor, but, for its significance as a ","useful":0,"cool":0},"I1VWSP-KTX90_LXnufLK4Q":{"text":"Hands down, my favorite bar in New Orleans.  It is at its best on a nice day or evening wh","useful":2,"cool":0},"pJbe0dqjnOQVcpFCH5vpug":{"text":"if you're stuck in the quarter and over the spell of cheap shots and repressed tourists re","useful":4,"cool":4},"-jiSpmh47OCsSquQcwB7-g":{"text":"Going to make this simple, go in for a drink during your travels around town. It's such a ","useful":2,"cool":1},"dOisg5Y7_QCXLBXAn0eVsQ":{"text":"I'm not sure, but this may be my favorite bar in the whole world.  The atmosphere is perfe","useful":1,"cool":1},"En6NBjMO0vZd13v31tn6KQ":{"text":"Great place to stop in for drinks when you are in town. The bar is one of the oldest in th","useful":1,"cool":0},"gEGZqj1EPZ4I_mIyDrjRMg":{"text":"We just loved it here.  Went to the back and sat in the darkness by the piano and treated ","useful":1,"cool":0},"oEPcEb6GhFEl8YKO_qcFow":{"text":"The hurricanes here a great. They're not that god awful Pat O'Briens kool-aid mix garbage.","useful":1,"cool":0},"9gBB7K9Dxw_VSY7C7SgXbw":{"text":"REALLY good hurricane. Take it to go and love lyfe.","useful":0,"cool":0},"goaiAV--NTy0JT8AOC3UGw":{"text":"This well known iconic Bourbon street watering hole, the Lafitte's Blacksmith Shop, has a ","useful":0,"cool":0},"oxeYcLakGewGpp-DIQmjTA":{"text":"The oldest bar in the nation (no big deal) and the only place I'll linger on Bourbon St. T","useful":2,"cool":2},"Z0SHangkVicgUmQfwfthnw":{"text":"I loved the randomness of this place. It was 298 years at the time of my visit in March 20","useful":0,"cool":1},"iC39eFTo4W4zZsiy0L072A":{"text":"This is the oldest running bar in the United States.  Great place to visit but don't get t","useful":0,"cool":0},"AURQbX0_DMwLL3BwF6nAmw":{"text":"Great place to relax and enjoy music and drinks. Has a dark feel to it, but very relaxing.","useful":0,"cool":0},"r1UHNGJvmBpIuPYhNpBG6Q":{"text":"Excellent place to hang out and get drunk!   Really great place.  And you have to go there","useful":0,"cool":0},"P804WoKNcJDq36TObQ5hrg":{"text":"This place was one of my favorites while down in NO.  We stumbled upon it while walking ar","useful":0,"cool":0},"1Ys3Hd0q8Ne-REEd3Jzxag":{"text":"My new favorite bar in NO. I was there for the Sugar Bowl in January and the fireplace was","useful":1,"cool":1},"G7wFCBx0kPE4BdqJB1r1Xw":{"text":"Come here only for the sake of coming here, and seeing the infrastructure of the place. Ha","useful":0,"cool":0},"F5qQexIU_CuzAIs0_hPSSQ":{"text":"This is one of those bars that you have to see during the daytime, also. The roof is the o","useful":1,"cool":0},"SGnglXM0vj8ZsjeJp7I8kA":{"text":"Service is quick, drinks are good. Remember to try the  purple daiquiri.... it will get yo","useful":0,"cool":0},"0oaZa1hySNXGBUDSKVl9GQ":{"text":"Lafitte's Blacksmith Shop is the supposed oldest bar in America since the 1700s. It's loca","useful":2,"cool":1},"xhhiYlX_WbFJYCwWMc5_og":{"text":"This bar wasn't the most impressive in regard to ambiance. Went in the afternoon for a few","useful":0,"cool":0},"kllTijp7BsaSGFm0Mvgigg":{"text":"Je l'appelle \"le bar des bougies\"\nIl n'y a pas d'électricité dans ce bar, enfin pas de lum","useful":1,"cool":1},"A1k07MPjIg_dAu7gaOYWHg":{"text":"Lafitte's was as expected. Grimy and as real as an institution gets. Worth the trip. Left ","useful":0,"cool":0},"fbUKSZtoSrOdmH585w_uYA":{"text":"Atmosphere was worth the visit. Bloody Marys were a nice addition to the ambiance, and it ","useful":0,"cool":0},"2erta22SZrTFZ2UtoOtlww":{"text":"If you are on Bourbon Street make the walk to Lafitte's., so glad that I did. What a great","useful":1,"cool":0},"AilvsGjjN8JCBKqpBUt_JQ":{"text":"Oldest bar in the US. The blacksmith shop was a front during prohibition. Good stuff. The ","useful":0,"cool":0},"lPmB3uekhPwZIxAs7EdhWg":{"text":"Ok I know the history. Of course we had to stop in. The place has atmosphere but the staff","useful":1,"cool":0},"_jEu3xiSKjEU48xZVjIv5A":{"text":"Awesome, must-see place in the French Quarter. Don't remember much about the draft selecti","useful":0,"cool":0},"8Kel59cr-viWFAvGymUzzw":{"text":"Great vibe.  Oldest building housing a bar in the US. I love the crooked building and floo","useful":0,"cool":0},"IuBUTJwI6szcVI0BUva0bA":{"text":"Was told to hit this joint up for the purple daiquiri. So we walked from our hotel all the","useful":1,"cool":1},"6KOcmDUbv1pTSlxM2jcgrQ":{"text":"From the outside it looks super super cool, which is incredibly disappointing once you try","useful":1,"cool":0},"kaqRfTIYS8rEq1kcNI94zA":{"text":"I was super excited to go to Lafitte's and even put it on my itinerary as a must go spot. ","useful":0,"cool":0},"eOZyENPesW0uI1J-wzPLTw":{"text":"We stopped here to end our night after a cocktail tour. Loved the dark ambiance & the pian","useful":0,"cool":0},"r1uV_K-EmmfTA2blpIN1UQ":{"text":"So I'm giving it 5stars although I didn't set foot in the place and I didn't eat anything.","useful":0,"cool":0},"BjqSiTxlT8-r9erLRJai9A":{"text":"The oldest structure to be used at as a bar in the US, built between 1722 and 1732. I have","useful":5,"cool":4},"7lCYbohraxMBCr938ZXhUw":{"text":"This place was very cool for the first few drinks. It's got an awesome ambiance with nothi","useful":7,"cool":3},"FHadgE4W9XE6O1SiDsH_LA":{"text":"Off the beaten path and being one of the oldest bars in the country, Lafitte's offers what","useful":3,"cool":1},"aHQe7Yq10U51FrO1S9Xkfw":{"text":"It is alleged that Lafitte's is the oldest bar in the US and definitely has that feel. The","useful":0,"cool":0},"9GZ8LZArN0c3nrcqCgcclw":{"text":"Why fight the tourists just to drink in an old building? I like the idea of a historical d","useful":0,"cool":0},"M6QNFVQ4yDbH9i6Qaoxjag":{"text":"Being inside this bar is quite the experience since it's the oldest bar in New Orleans. It","useful":2,"cool":1},"Hprrm1tP7HaoE46I3bN_WA":{"text":"I love this place!! It's difficult to find a seat but who cares, this place just reeks of ","useful":0,"cool":0},"XruUUk3xKzuYHSBJNJwzvw":{"text":"This place is AWESOME. When visiting New Orleans, you have got to stop here and grab some ","useful":0,"cool":0},"FCXMZz7bGz3LFkNoDQ-tjA":{"text":"Lafitte's is truly keeping it old school,  like before electricity... they only have candl","useful":3,"cool":2},"liqYD8CM80kGKqjoKGFGSg":{"text":"One of the three remaining French buildings in New Orleans, this is a must-stop just to se","useful":0,"cool":0},"21GvGp4DbXcwavrQpvHuIA":{"text":"It gets all 3 stars for nostalgia and the patrons it attracts. \n\nWe visited Lafitte on Eas","useful":1,"cool":1},"L9O6YKJRj5OAI9kU0yea1w":{"text":"On a particularly cold day in New Orleans, we were craving things like a hot toddy or hot ","useful":0,"cool":0},"4r_K1FUlLdpFCSiv7XYYdw":{"text":"We stumbled over here on a bar crawl while visiting for our friend wedding and we were tol","useful":0,"cool":0},"RQ3MD5Viij_ortf5IEuc9w":{"text":"Ugh I love Lafitte's!\nMet so many awesome people here, \nESPECIALLY THE OUTDOOR BARTENDER T","useful":1,"cool":1},"kKhCcKe3awXy-MHjKD5wWw":{"text":"Come on in! The oldest structure used as a bar in The United States! Pretty cool if you as","useful":0,"cool":0},"pa40dvhEi9aDSUJPgL4aXw":{"text":"I enjoyed this bar on my brief stop, i was on a  haunted history tour and we stopped here ","useful":1,"cool":0},"ycIN7WBsvUZxupmYy7RAKQ":{"text":"'oldest bar in america' + beer. what more can i say. it was fun.","useful":0,"cool":0},"f4CHudDExHNUDxRSg5QU8w":{"text":"Went a few weeks ago and it is a phenomenal place! An old haunted tavern on the far end of","useful":2,"cool":1},"C4ebQN8S0FyBfkmag8M-6Q":{"text":"Seriously, when you get to Bourbon Street at Canal, JUST KEEP WALKING!  Get past the strip","useful":0,"cool":0},"ISNl8QkhXTbo40z1VVVoZQ":{"text":"My friend adored this spot in NoLA so we must have gone three times over our weeklong stay","useful":0,"cool":0},"30P3uWPoyqhckuuIRDrtjA":{"text":"I heard it was the best Hurricane in the French Quarter. I must admit that it is. Great da","useful":0,"cool":0},"VZoe-oAdm3TC-dbKkpxYMA":{"text":"The setting is rad.  The building is one of the oldest in New Orleans.  It survived both f","useful":9,"cool":7},"Jzq-roIDfodmbVCeEdjQyA":{"text":"This is the best bar on Bourbon Street. The atmosphere is fantastic along with its New Orl","useful":0,"cool":0},"wom89apKIui0Vo-l7oS9hA":{"text":"If/when you're walking through Bourbon Street and don't know where to stop, the answer is ","useful":1,"cool":0},"lugBrcWYlF6En1h2UAgbqA":{"text":"Y'know, you've got to check the place out, as legend goes, it's the oldest structure in th","useful":1,"cool":0},"WhJjLQeocAq_xJkL44_C_w":{"text":"You need to make sure to make a trip to this bar.  It stays true to it's tradition as one ","useful":0,"cool":0},"-0JTZyTsQICuQwYjbOhZtA":{"text":"Why does a bar with so much history need an obnoxious Jukebox and a TV? \nYou clearly do no","useful":1,"cool":0},"DfGgIODHeuZchcBh3t-DZQ":{"text":"Great vibe at the far end of Bourbon St. There is debate about it being the oldest bar in ","useful":1,"cool":0},"dQGk33mvT3ddDIic-EqEGg":{"text":"This is a great bar for ambiance. Reasonable prices, tasty drinks. They have a person play","useful":0,"cool":0},"xHeuP2vP5ROh9v4ZGustVA":{"text":"No hot drinks for rainy days or happy hour, but their  specialty drink the hurricane is go","useful":0,"cool":0},"vDUnf4KjSMMTE3Qy-pgfkg":{"text":"Loved this place love stuff like this. It's the oldest running bar in USA. It's got charac","useful":0,"cool":0},"IARquR0jFhv2nGJD-J7Apg":{"text":"Service has usually been worthy, but I had my underage daughter with me and she was denied","useful":0,"cool":0},"0UC7Y8DqU6qwF2QeNqVj7g":{"text":"If you're into the history of this place, don't come at night. You will find nothing but l","useful":0,"cool":0},"H1M0w7mpulMWS1OIGxMhkg":{"text":"We went in because of the touristy statements of  Oldest Building used as a Bar. The drink","useful":0,"cool":0},"Y7TOfZhiYHdLA8BvFmSvqg":{"text":"Cool to be at the oldest bar in New Orleans. Nice ambiance with the dim lights, but it was","useful":0,"cool":0},"zEBkmpqVaj9zITS5qThKyw":{"text":"This place has a cool atmosphere (pretty rustic/divey, but that's the draw). The whiskey g","useful":0,"cool":0},"N2uZaNqB8arqqT8Pvmk_Kg":{"text":"I say it's worth staying for a drink here, but no more than that. This place has been oper","useful":0,"cool":0},"N8ofU3-hFs91iOPDgfUwsA":{"text":"Ok, I get that it's the oldest bar in the US. So, the atmosphere is pretty much what you'd","useful":0,"cool":0},"uTEtwkHPT3MS22DcZy8qug":{"text":"Super cool location! Boasts being the oldest bar in the country and is lit exclusively by ","useful":0,"cool":0},"00lFqjnyVjGgWLlnHEZExQ":{"text":"You do not come for the drink but more the historical spot and music. It is on bourbon but","useful":0,"cool":0},"xWTnVZd79qW1cO9cQvXKSw":{"text":"Cool place! For whatever reason, I thought it was open 24/7, so our bachelor party stopped","useful":0,"cool":0},"prRV-bgyAhYEActWT2JHSQ":{"text":"Oldest bar in America.. and the horse carriage tours all stop here. Inside, I couldn't see","useful":1,"cool":0},"LuN6fUmODHFDijALWKLUcw":{"text":"I'm definitely giving this place 5 stars because of the atmosphere. I'm pretty sure the dr","useful":1,"cool":1},"Cnazfr2i4jaqTmhc548vEg":{"text":"Supposedly haunted bar whose centerpiece is a two-way fireplace that notorious pirate and ","useful":0,"cool":0},"_aK8mIZz7mEb-tMtlp9Cgw":{"text":"What a cute place....stopped here after visiting the Voo Doo Museum. Who knew this was the","useful":0,"cool":0},"omhjzTRu6EhMApShXwBYjA":{"text":"I don't even LIKE bars and I liked this place.  Awesome ambiance and cool history.","useful":0,"cool":0},"1ChdmektkZG3AwndoSkJxQ":{"text":"Maybe we were there on an off night. We were looking for a piano bar. There's a piano ther","useful":1,"cool":1},"vCUC4506vg6TtiIvDS9oZw":{"text":"Said to be one of the oldest bars in America and the spot where the Lafitte brother pirate","useful":0,"cool":0},"iKFNN2L28S1rwCHeQPncTw":{"text":"This place is awesome. You can simultaneously take in history and culture while getting a ","useful":0,"cool":0},"70YE82ePZEn901xLn98G_A":{"text":"Walked in around 845pm and sat at the bar, asked for a menu and bartender was rude and sai","useful":0,"cool":0},"P1msIqlgdUjfeInSYuqeow":{"text":"Went with a local on first night of the parades. PACKED! Lots of seating and great music. ","useful":0,"cool":0},"tqmA4qUmZHmaHjaZEplhFA":{"text":"Oldest bar in the U.S., check. No electricity, check. Really cool ambiance with candles ev","useful":0,"cool":2},"K9RcbEYFshjOXfdpWCkwmA":{"text":"Super chill spot.  I walked down some dark, quiet blocks from my AirBnb to meet my friends","useful":0,"cool":0},"6zR4PlLJ1NOJyETGtXPJ0w":{"text":"So cool. This was really the only place my husband wanted to visit on my surprise birthday","useful":0,"cool":0},"lvp-CtBdka2iWxczsPzp4g":{"text":"Gets the job done. The hurricane was dam good. Dark and dank, just the way I like it...goo","useful":0,"cool":0},"WdpYTpOTn0Viqioj6Jmf8Q":{"text":"Cool bar. Still uses candlelight to be lit. They could get rid of the jukeboxy thing, or a","useful":0,"cool":0},"zZ8OmY6a0XAcc5idHX5nWw":{"text":"This bar makes me happy.  If I had to drink here everyday I would.  This is rumored to be ","useful":1,"cool":0},"qZ_1ud92KONIf1M3GFJ9uw":{"text":"Stumbled upon this bar while trying to get away from the Spring Break crowd and thank God ","useful":0,"cool":1},"lMQeNLFnxovLx-QNRkFTQw":{"text":"Voodoo daiquiri (Purple drank) is where it's at. The late night piano bar is fresh, fabulo","useful":0,"cool":0},"_5KFRQzmXIwVCB9ctMpncg":{"text":"A fabulous bar with a rich history!  Have only been here at night so I wasn't able to real","useful":0,"cool":0},"BbCgx-0igKd8IwJNVcJ43Q":{"text":"I've been a regular once a year for the last 20 years really like it -- cool place to hang","useful":0,"cool":0},"56nM0Q3MWoDy6awR46mWjQ":{"text":"This is a place to go for an amazing atmosphere. The \"purple drank\" is a must-get. It tast","useful":0,"cool":0},"MoToKN6ZBj_PdjWZTJUcNQ":{"text":"I heard it's the oldest bar in the quarter and it  seems like it is. No lights in the plac","useful":0,"cool":0},"b-6KDCf8mk-QslPD3uThZQ":{"text":"Awesome! We HAD to go here after seeing it on Drinking Made Easy. This is the oldest bar i","useful":1,"cool":0},"hx5tdEDjPIHpJ6O_ERN08A":{"text":"First time here was magical. Quiet, one or two locals, an entirely too drunk for 2pm famil","useful":1,"cool":1},"u2NFik-ogemV9pW78uufig":{"text":"Oldest bar in the US.\nHard to find easy to get to.\nThe whole strip is cozy and quaint.","useful":0,"cool":0},"d4BxsgNW6GpG5J5veR2ODw":{"text":"Very nice while in the wall just off the strip, cool dark setting with a piano guy at the ","useful":0,"cool":0},"nk33CxLl9GPCSWXc7ecInA":{"text":"Lafitte's is a really nice and unique bar. It is very low-key with candle lighting and pia","useful":0,"cool":0},"0HocywZd-AGF9ASePCxcMg":{"text":"After many grueling weeks at sea, land was spotted off the starboard bow.  Anchor was drop","useful":16,"cool":14},"iK7hPoIGiOk71GwhkS4UPg":{"text":"Oldest bar in America. Drink up to history. Order the hurricane, and you won't be disappoi","useful":0,"cool":0},"Co65lfmYO2QeNXxyt7lRYQ":{"text":"Oldest bar in the French Quarter. Maybe the country. Most walking tours stop here to fill ","useful":0,"cool":0},"h7ErgWrbQeddPmElnYRwbA":{"text":"Seriously one of the best cute little bars I've ever been too. Bartenders were awesome and","useful":0,"cool":0},"mgiHrYaVqGuhB1ZDEm2DbQ":{"text":"I'm giving this place 4 stars because of the amazing atmosphere.  The bartender wasn't gre","useful":1,"cool":1},"ZXTqZZhrjMrzHZUeEkMYHA":{"text":"Lots of history in this place, talk to the regulars.  You'll hear some freaky stories expe","useful":0,"cool":0},"67aM1qV4QElpRgY5Nv_K6Q":{"text":"Another favorite. As it happens, we've ended more than a few drinkin' nights at Lafitte's ","useful":6,"cool":6},"oJXy_7PNknQqSEM3-X4wxQ":{"text":"This place has the coolest vibe of any bar I've ever been to. There are no lights in here ","useful":3,"cool":3},"ylu1hJ4VuRCcl0sbuAupww":{"text":"I teach history. I am a nerd. I am in love with this place and I kept my cup and I want to","useful":0,"cool":0},"usyShQCAjCAeSdIOagBZEA":{"text":"Located at the very end of Bourbon Street, it is hard to miss Lafitte's Backsmith Shop.  T","useful":0,"cool":0},"OmrSgIfFuo6kOQkvDSvtSg":{"text":"Dark and the juke box music was not fitting for the area or the type of establishment this","useful":0,"cool":0},"YJAanYdU0wrzY1yBOyNmtg":{"text":"A great daytime spot. I heard that going this far down Bourbon St. (away from Canal St.) i","useful":0,"cool":0},"bYIGG2QwnhSNDf8PcV-Bdw":{"text":"This place reminds me of how the Quarter used to be many years ago. Just a dark old bar th","useful":0,"cool":0},"8b1tXsfxGb1fjLHSH4Uuyg":{"text":"What a fun, historical, dimly lit bar! So glad we came here on our recent trip. You feel l","useful":0,"cool":0},"ruUXoh_iXSvea7ovbIzofw":{"text":"Very cute little bar. We had to stop in for the purple drink. \n\nIt was really yummy. For a","useful":0,"cool":0},"0uGbc4DdinQ9StEA8PoxVg":{"text":"This USED TO BE one of the nicest bars in NOLA. That is, before it morphed into a crowded,","useful":1,"cool":0},"spgwCpZVlz5fYeR4C4ht0w":{"text":"the oldest continusly operating bar in the united states im fan toursit trap though be war","useful":0,"cool":0},"6GGmeB4MVuA1jfpWFOzMEw":{"text":"The 3 stars are only for the building. All of the bartenders were assholes and very rude. ","useful":0,"cool":0},"47xX7RZmeBLd5f5Mcgy3Nw":{"text":"I love this little bar. We stopped in a few times and always had wonderful bartenders. I a","useful":0,"cool":0},"4nNUAh6Nj4qOKYVXgtis0w":{"text":"The epitome of Confederate state ballads, \"The Night They Drove Old Dixie Down,\" welcomed ","useful":1,"cool":1},"DQq08P1cxCT9ha5acLaeTA":{"text":"Always a fun stop at this ultimate dive bar at end of Bourbon, just far away from the stri","useful":0,"cool":0},"iIh-SBoCwCB5TWv9YFZ6HA":{"text":"Huge tourist ripoff. The bartender in the courtyard, possibly the RUDEST person I have EVE","useful":1,"cool":0},"drVlGfGqyVIblaPQxbCudw":{"text":"Coolest bar .. best hurricane. They use real juices. Wicked cool ambiance.  Quite dark.\n\nI","useful":2,"cool":0},"U9UZnhyJ3T4ALRUa_dIqWA":{"text":"Everyone should check this place out once in their lives. The place itself is farther away","useful":0,"cool":0},"QjMvSR8808kqu4gLkfWOWw":{"text":"What can I POSSibly say about this place that hasn't already been said over the past two c","useful":0,"cool":0},"iJVS3VOFPlQDHmJhni_XXw":{"text":"Stumbled into Lafitte's Blacksmith bar and was taken back in time, only candlelight lit th","useful":0,"cool":0},"hUD4AH2Oc0l4O8gIFQcP_Q":{"text":"This place is a CLASSIC! One of the oldest bars in the country and it feels like it--slant","useful":2,"cool":1},"4Me-EQuHV_CNPcnxc1vf8g":{"text":"We where kicked out of the place after we tried to move a couple of chairs under the roof ","useful":0,"cool":0},"huT3Q2-pwOyZ6vim_U7PNg":{"text":"I stepped inside on a Sunday afternoon and was immediately greeted by the overwhelming sme","useful":2,"cool":0},"1_8xcSCL1APcSL4JW8L5kg":{"text":"This place is like going back in time. Legend has it that the legendary pirate, Jean Lafit","useful":1,"cool":2},"AVIfYIRsfJ_mZU4St2teUw":{"text":"Stumbled across this place at the end of Bourbon and I'm so glad we stopped! The bartender","useful":0,"cool":0},"mwqQCZ3BPKtSTumJgiL9kg":{"text":"John Lafittes is the 'Vampire Bar' stop on the Vampire Walking Tours. The atmosphere insid","useful":0,"cool":0},"H6T7YJSzyqqJ4YlMMXKwXA":{"text":"This place is a tourist trap. Yes, the building is historical which is cool and its really","useful":1,"cool":1},"IZwvjeTWgo7gWNi8aFgqRQ":{"text":"I loved this bar. ..but the smell when you walk in can not be tolerated.  I'm not sure if ","useful":0,"cool":0},"GbXSnUOJfv1edD8ozqfquw":{"text":"This bar was one of my favorite places in Nola! For my first time in New Orleans it can ge","useful":0,"cool":0},"29rlHAM97GneC5PDqhOrqw":{"text":"Great venue... it's definitely a hip place to hang out. After you pass all the crazy bars ","useful":1,"cool":1},"0pThDMq0NXsH_SVhulLF_A":{"text":"Touted as the oldest bar not only on Bourbon but the entire USA. Extra points also awarded","useful":1,"cool":1},"SXEBz8ns5pktrcN2pc6sJQ":{"text":"I only wanted to go to Lafitte's since it is the oldest bar on Bourbon Street.  Sadly, I w","useful":0,"cool":0},"En9eCkyOFi0gSTgf5tKAkQ":{"text":"A real easy going bar with nice people. Will kind of remind you of the local neighborhood ","useful":0,"cool":0},"_lClsmmy0CKEYJFFF9JznQ":{"text":"Cool place. VERY dark and a good place to chill at the end of the Quarter. Decent stiff dr","useful":0,"cool":0},"fTAH_JOc3Kkd_Je0Gd91bg":{"text":"Fell in love with this and the voodoo drink. The rich history and wonderful building plus ","useful":0,"cool":0},"YzcfE3q9mDQKHUOnmZq8Nw":{"text":"So, according to one of those lists on the internet.. this IS the oldest bar in the countr","useful":0,"cool":0},"UZuGjJIHh-pHKnTchgUoFQ":{"text":"Very fun original place on the corner.  It has lots of character and characters in the bar","useful":0,"cool":0},"g52jDia6Se2EM0rmfiVsYg":{"text":"Stopped here quickly after a ghost tour and I'm still dreaming about the purple voodoo dri","useful":0,"cool":0},"vF9MUXC0_7m8wCTQ8_znHA":{"text":"This place is so cool. You need to check it out if you are in NOLA. The hurricanes are the","useful":0,"cool":0},"4cKWJN4ip5GGbUPc1NIWkg":{"text":"The waitress gave us a personal recounting of the car's dark & long history. Unfortunately","useful":2,"cool":0},"Jnuz5DE4SWzJOGo53bG08w":{"text":"charming place - loved that it was all candle lit & had a piano bar.","useful":1,"cool":1},"93zQSWpIKDuJBo8RAVilAg":{"text":"What's not to like about a bar where the ceiling is sort of slanted and they only have one","useful":1,"cool":2},"jxRe11HAefdXLtZ6aVdtmw":{"text":"Most of the daiquiri shops on bourbon are pretty much the same GREAT GREAT GREAT :) get a ","useful":1,"cool":1},"qT-q3dKSuK6zuaPbxdhBew":{"text":"This is a must-visit place due to its history (oldest bar in the US, which really is impre","useful":0,"cool":0},"ZioI2FzLPZ6GfEHXi4KImw":{"text":"This place is a French Quarter staple. When you're here you have to go, but don't spend to","useful":0,"cool":0},"6Tl1K8Q9WFoIfZTzZpdIOw":{"text":"What a cool little place! My husband and I stopped in after a haunted tour and were served","useful":0,"cool":0},"qN5hKev8M8WowS3a-2JfnQ":{"text":"Love the look and feel of Lafitte's and being local always bring out of towners there.  Bu","useful":0,"cool":0},"J4u0US8AAVwn4aqnuW1PHw":{"text":"Three of us ladies got whiskey gingers and sat at the piano to watch the famous fella play","useful":0,"cool":0},"5xiujx59qYZTH-n0vaWOHw":{"text":"My favorite place while visiting NOLA for the first time.  Very chill atmosphere- great fo","useful":0,"cool":0},"Ht5L2_Vephdivkz-81aVaQ":{"text":"Not so cool. Smells and a girl peed her dress in the main room.","useful":0,"cool":0},"smUe6k5_FiZb19qgvmcq5A":{"text":"The place was very nice. We were interested in visiting because it is the oldest bar in th","useful":0,"cool":0},"wmNizeAZ0HAjLhRehQDU0Q":{"text":"This is the darkest bar I have ever been in... ever!  Worth the walk and cool to hang out,","useful":0,"cool":0},"Py6_OfDFVZewthhu92SXwA":{"text":"Unique bar, way too crowded, but you have to try it. No lights only candles (bar itself do","useful":0,"cool":0},"QQNk4gcZXFPFus39FvN_yg":{"text":"Known as the oldest bar in the US, I was a little nervous coming here because I heard that","useful":0,"cool":0},"ZCNaBEN7BYeDfD-EVbsg3w":{"text":"I love this place.  It really is at that point where if it was any darker inside it would ","useful":2,"cool":2},"RY_n2y6yuHaVcEjUT7NPSA":{"text":"My sister and I just walked in after glancing at what looked like a yummy purple drink. Th","useful":0,"cool":0},"d7-2vy4xylG1x9RzF4EkvA":{"text":"So...I had high high hopes for this historic spot.  Maybe it lost allure because I went du","useful":0,"cool":0},"jkelf_AIpXpk6RosV27eRA":{"text":"Claims to be the oldest bar in the U.S. Cool bar off the beaten path on Bourbon.  Only ele","useful":0,"cool":0},"bcM6LoojZ_LD-fzrc9mtXw":{"text":"Two nights in New Orleans and I had to stop here. It was a little walk from our hotel but ","useful":0,"cool":0},"q2XEbkrorMh1oZFhwbWF_A":{"text":"Loved this place. Got flipped off by Gabourey Sidibe when I asked her to show me her tits.","useful":0,"cool":0},"bz0O6OOgaicQzmg4bmM7gA":{"text":"Quiet, relaxed bar on Bourbon St.  Don't worry.  This is the part of Bourbon St. that is h","useful":0,"cool":0},"rtERM0mIkntKO3yqsWyMrA":{"text":"Lafitte's is open early, serves generously, and charges cheaply (for the French Quarter).\n","useful":1,"cool":2},"FiNR2AoMgEL4w3cma6Ce_Q":{"text":"It's a crying shame that the oldest bar in the United States can both smell like excrement","useful":0,"cool":0},"FM6fNI44UuJQDMTfLRrPDg":{"text":"What a fricken twat , if you play music the head bit@&ch doesn't like she turns it down","useful":0,"cool":0},"jQ56CmCjqtOWZcL8-6_BnA":{"text":"Great atmosphere with the authentic brick & candlelight. Sit in the back at the table surr","useful":0,"cool":0},"mcGCbLnMtwzAiulyT5CSvw":{"text":"You won't find anyplace to drink quite like Lafitte's!  If you come to the quarter and don","useful":3,"cool":1},"_QK_m2_AuyrUMxxLvWsLSw":{"text":"This was the biggest disappointment of our trip and the worst part is it started so great!","useful":4,"cool":1},"oaY48mEgDZp9aKb2q1KRkw":{"text":"Don't get the Voodoo aka Purple drank. It tastes awful - like chemicals. Also be sure to a","useful":0,"cool":0},"oF7oUPD2I9QPB-ynpINojw":{"text":"I really enjoyed my visit here...my friend Bridget had many beers and I enjoyed a few too ","useful":0,"cool":0},"VXTbzElmlvUu6PT7kg_VhA":{"text":"I came here for the historical reasons like many others and its a nice \"local\" bar; nothin","useful":0,"cool":0},"aiusFPWVM1GbJI4xhqfIhQ":{"text":"Walking into this bar is like walking through a time machine.  You really get a feel for t","useful":0,"cool":0},"9C1MuXzhqbrY_D__U-ck2g":{"text":"Such a cool experience. An ambience unlike any other bar. There was a live piano player ta","useful":0,"cool":0},"3fo0ltF8Ay2-DhKtWxMQCQ":{"text":"Located on Bourbon Street, but on a much quieter and less raucous portion of it. Our carri","useful":0,"cool":0},"ag7zjJKTDahk40x4EL1m4Q":{"text":"This was the 1st bar we went to as soon as we got to town. My wife had the  voodoo daiquir","useful":0,"cool":0},"_m80oRi2XaUGAYMNjEtaXg":{"text":"I'm pretty sure Bell in Hand in Boston is the oldest bar in America. \n\nThis place looks li","useful":0,"cool":0},"v1dZVcIfBCdBT073f3pgdw":{"text":"This bar is GREAT! It's old and divey but has so much character. And how cool is it that i","useful":0,"cool":0},"ttD8JgLEmZQQCuYMEfkykg":{"text":"No place like it anywhere. I got married in LBS's back courtyard 17 years and 2 weddings a","useful":0,"cool":1},"1zmGiLgOpoHNbHnepCoivQ":{"text":"This was one of the coolest spots we visited while in NOLA. It is said to be one of the ol","useful":0,"cool":0},"b9a7Z7Vx_duK6qNIJ9EqoA":{"text":"Great NOLA institution and you should definitely check it out.\n\nI think it's a great place","useful":0,"cool":0},"MqC_NalmNcfJoZADMsDz_g":{"text":"One of my favorite places to have a cocktail in the quarter.  You have to love a building ","useful":3,"cool":3},"R9FVvLqu7AUP7MRE0FUXCA":{"text":"Help me understand why after a certain time in the afternoon the front doors that draw the","useful":0,"cool":0},"vCEXVlUCyP-D8WKFpYz9Xw":{"text":"This was a pretty cool building to see since it is very old.   We actually stumbled upon i","useful":0,"cool":0},"Ea4mGbA8ZfJov1A_Po7RAQ":{"text":"My favorite place on bourbon...hidden away from all the craziness and tourists that typica","useful":0,"cool":0},"I1IjKYRwUC9_7GBkiJc0xw":{"text":"This place is a lot of fun. I just love that it's lit only with candles and they have a pi","useful":0,"cool":0},"jrwbN9ghbygbalDXde_63g":{"text":"Oh Lafitte, being an ECU Pirate myself for more than half a decade, and still bleed purple","useful":3,"cool":2},"4Ad7QTzRKicJTMx3MNkaBg":{"text":"Best bar and environment in new Orleans bourbon I would say","useful":0,"cool":0},"U5_SgjubAdvzs1kNv6yLAQ":{"text":"Saw this place on Drinking Made Easy and just had to try it when I was in NOLA.  And of co","useful":1,"cool":0},"1nZS7Aj0FKhlBNpfkZPKvw":{"text":"Pretty cool little place. Small bar, nice outside area. Purple Voodoo (slushy) is pretty g","useful":0,"cool":0},"jc-UW-nCnuOhe_fIl0bqLw":{"text":"The hurricanes at Pat O'Briens are good... but the ones at Jean Lafitte's are better. The ","useful":0,"cool":0},"lV8G9jMPE1uP80CUezsarQ":{"text":"A little expensive for small drinks in plastic cups $8 a piece for a tiny jack and coke bu","useful":1,"cool":0},"er4U8owvVxsKGDP9tni3QQ":{"text":"I will admit, I have never actually been INSIDE this bar. We were out for a bachelorette p","useful":1,"cool":0},"JCp64bUNrHjfO2wew42Y_g":{"text":"It is the oldest and also one of the most haunted bars in America. Who knew? Well..apparen","useful":10,"cool":10},"Odt9Eo-XmB0mKo7moYVOTg":{"text":"Lafitte's is a dive bar with real atmosphere.  It really must be seen at least once during","useful":3,"cool":1},"W5wGQOx34n7GjnJygI1fdw":{"text":"I wanted to like this place more...but it was just okay to me... we went late in the after","useful":1,"cool":0},"ED6Qnrv8RHHC_xtXuZ-epQ":{"text":"Coolest place ever!  Candle light only and good cold draft beer!  Prices are standard, but","useful":0,"cool":0},"91357YyL7th8FAFBEM22Ug":{"text":"Love it.  One of my favorite bars in the country and definitely my favorite in the city (w","useful":1,"cool":0},"lDd8JdKh9d0ByArajc0zCg":{"text":"I am someone who loves the historic charm and atmosphere. Had a piano guy playing the othe","useful":0,"cool":0},"hJE1nSObPo0aGTFeGtcDYg":{"text":"This is a must for a tourist oldest bar in New Orleans so much fun ,they use this bar in t","useful":0,"cool":0},"NqvRAETcxWLcwvGIdv7cyg":{"text":"Stopped by on a Sunday afternoon. The previous day the place was jam packed with bros flow","useful":0,"cool":0},"whOZKbjpSyUwrhx7gQ7mFQ":{"text":"I love the way this place looks when it's not holiday season.  I am guessing they were try","useful":0,"cool":0},"P54I3t_vZIWFG9IQ2bpKLw":{"text":"This is one of the only places in the FQ where we order mixed drinks.  Their drinks actual","useful":0,"cool":0},"NQPK3gK4Q0pcV2oTNDnfdA":{"text":"Small place, great history, great drinks - best hurricane - great service.  If you're visi","useful":0,"cool":0},"0aZI-F4-JwZ7iPOLB4kRaw":{"text":"Awesome place with the history. Drinks were good bourbon street fare. Wished we went at ni","useful":0,"cool":0},"gCkJeO9gCKMOD72mVL4hXw":{"text":"I love, love, love this bar! This is seriously Bourbon Street for grownups.  This is the p","useful":1,"cool":0},"2CUv6BSTKNEDndhmJ5crmg":{"text":"Come on folks, it is the oldest bar in the United States\n\nIt also has pirate history\n\nThe ","useful":0,"cool":0},"lM44pK_4oZbrL9Wb6lPN4A":{"text":"Fantastic bar and a great hang on an early spring afternoon.  No hassle, fast service, and","useful":1,"cool":1},"vs0xX5mjL6yUvhfyilANXg":{"text":"Upon the turn, round the corner, on a course for a cozy bed and a warm nite's sleep. What ","useful":0,"cool":0},"Sc-Hc3vRi0qahMQJbTQYNQ":{"text":"Very small and crowded, but still nice. Was told to go for the purple drink, which really ","useful":0,"cool":0},"qVjVV12jIJxzBpM4CqL1fg":{"text":"A little away from the madness you find on Bourbon street but don't let that deter you fro","useful":0,"cool":0},"gyQ6acuTP9kfub9cgJNyOw":{"text":"Hurricanes, oldest bar in U.S. Since 1772, bluesy music and Bourbon st - need I say more!","useful":0,"cool":0},"KS1B6xPa1dx_biQZcrrO8w":{"text":"Very unique. Definitely a change of scenery from the usual craziness of the French Quarter","useful":0,"cool":0},"LejahVGsGlpHeIpg7WdyLw":{"text":"Who knew the oldest bar in America sat in the streets in New Orleans. I surely did not...n","useful":0,"cool":0},"40neINDZDrI7lYvwM9avfw":{"text":"I love that this place is on Bourbon St. but not ON Bourbon St! We had a great time after ","useful":0,"cool":0},"Ot4HrENwaGqBs10KeB_J3A":{"text":"This place was very fun and memorable! The lack of lighting makes the space feel intimate.","useful":0,"cool":0},"JVXzlPZkgeEnpfxfKSFG9w":{"text":"The oldest bar in America!  Cool.\n\nMy wife and a friend made a point to hit this end of Bo","useful":1,"cool":1},"JyFBqIWNmu8C-TXrtkzsAA":{"text":"Best people watching (next to Bourbon St) in the French Quarter. This place was built in t","useful":0,"cool":0},"mkf7QX0HWVggGyC53Efjbg":{"text":"Oldest bar in North America, very unique spot on Bourbon st. At night there are very littl","useful":0,"cool":0},"xT8J55O30wji8Plweflghg":{"text":"No one there is interested in talking to you. No one there is interested in dancing or hav","useful":0,"cool":0},"QzL76SN7V2buWAAx6U1IoA":{"text":"During the Haunted History tour this was our pit stop to get a drink!  Supposedly this is ","useful":3,"cool":2},"rQjBzZm8Q5zPVHP8Cixe2Q":{"text":"Always stop by this historic bar when friends are in town. Great Drinks and reasonably pri","useful":0,"cool":0},"Ijd7hnkvuCvvKXDMJaW2LA":{"text":"Great atmosphere and we really enjoyed the short time spent here. Sitting in this old buil","useful":0,"cool":0},"APjH8D0OdADo2ySJkgnaug":{"text":"Awesome old school NOLA in the truest sense.  Most other reviews touch on it prettty well.","useful":1,"cool":1},"OdXvVHi6SslzgR5w3HXaew":{"text":"Lafitte's is a cool historical landmark that you can drink in. I recommend going in during","useful":0,"cool":0},"VHqIYqRcTzmQ4xmWTj_yog":{"text":"The oldest bar in America. That was the hook for me, while my friends were willing to go t","useful":0,"cool":0},"D-6m1aJRbNmPA-NSnv4XHQ":{"text":"best pirate bar EVERRRRRR\n\na true hidden gem. great escape from the crazy/touristy parts o","useful":0,"cool":0},"A0GfTT6d0t4yCt-3ls4Ybw":{"text":"Those hurricanes are DELICIOUS! Watch out though, they go down like juice so before you kn","useful":0,"cool":0},"a_hz800DBZQ2zb8UbOjCJQ":{"text":"This was the only establishment on Bourbon street that I stopped at.  Tolerable, because i","useful":0,"cool":0},"ZKv573Mi9aiC-f_z4L2Sgw":{"text":"Their hurricanes are not as good as Patty O's but they are worth the walk down Bourbon to ","useful":0,"cool":0},"lTz2QLV3itocO0d4AbxjAg":{"text":"The BEST hurricanes ever!!! Flew from CA just for these hurricanes and PoBoys from Verte M","useful":0,"cool":0},"9j4xJPgjdpxx25oRzJurrg":{"text":"My favorite bar in NO. There's nothing like it anywhere else. Beautiful? Not really? Well ","useful":3,"cool":5},"XKcpjhMVQSk1sAjzGrk-RA":{"text":"To hell with the rest of the overpriced, over hyped, and overly obnoxious Bourbon Street! ","useful":0,"cool":0},"9av5tPM437FB5_3B43dtlg":{"text":"The darkness is all-enveloping when you first enter; you can easily imagine you've stepped","useful":0,"cool":0},"vtULndue4_GPTMYeA1oldQ":{"text":"Stumbled upon this place as part of a history tour - but found ourselves coming back throu","useful":0,"cool":0},"WZwkaQCnfQ5s6ldXxG4U7Q":{"text":"I went years ago and it was charming - busy but still more of a speakeasy vibe...almost 20","useful":0,"cool":0},"-LYvTs6Wng4MQYzGit-efg":{"text":"Amazing atmosphere, historical, and cheap! Live piano player nightly. Dark cool ambiance w","useful":0,"cool":0},"q99nC1cI6ttX__nh4o_PFg":{"text":"Lafitte's is one of my most favorite places.  Mostly candlelit, airy, and old, so old.  Yo","useful":1,"cool":0},"WfJMuoHRi2MlHR8kqvN8AQ":{"text":"Neat bar. Didn't stay inside here too long. Just grabbed a few drinks and then walked arou","useful":0,"cool":0},"I9TlYiZuZYHS2Q7nG_WcmQ":{"text":"How many of us have a favorite bar in New Orleans?  I have about 20 but if I had to chose ","useful":0,"cool":0},"COpAederKy-W-XHETFP8xA":{"text":"Hands down the best hurricanes in town!! Not only were they fantastic, but they were cheap","useful":0,"cool":0},"1xCJYLS2xacuW70MWj8Lsg":{"text":"So THIS is the oldest bar in country? \n\nDropped by here a couple times during my visit to ","useful":2,"cool":1},"SCRr8fUHAJI5LKFLA1ciHQ":{"text":"The rumor has it that this is the oldest bar in America. I have heard that there is a plac","useful":2,"cool":2},"xKkcmV5xVUQxv7v2Z4i-Rw":{"text":"Located towards the \"end\" of Bourbon street, past the gay block(s), sits Lafitte's Blacksm","useful":2,"cool":1},"oGI8vTA03uGOgwumAe3Yjg":{"text":"Do yourself a favor and bypass all the other bars on Bourbon street and head directly to L","useful":2,"cool":1},"HAAB-ei2bUqMlU8iARY8Gg":{"text":"Spent several hours in this watering hole on Friday night.  I really love the casual vibe ","useful":0,"cool":0},"MipXYB_EcYIFKMW3HYoacA":{"text":"It's really dark in here! It was the meeting point for my Bloody Mary Voodoo tour so I sto","useful":9,"cool":7},"_02v8r8vEmy_JmHajGxrJg":{"text":"I loved this place.  The only electricity is for the cash register and the restrooms.  Els","useful":0,"cool":1},"M3yvrL_792cwJN5cRxn58A":{"text":"Interesting stop for a quick drink to go. There was a strong bad smell at the bar, which w","useful":0,"cool":0},"O0PzPKM2a9mk3qpbGuVOaw":{"text":"I've been to New Orleans a hand full of times and have walked by this bar on every trip. F","useful":0,"cool":0},"pVCWw7zkQwwBSOqNI91uEg":{"text":"8 bucks for a mighty strong hurricane made my haunted ghost tour tolerable.  Thanks, Lafit","useful":0,"cool":0},"EUwW5ZxjIzklFSMIY7iizA":{"text":"You will come here because it's a historic landmark. It's pretty amazing that this place h","useful":2,"cool":3},"G3cT2QzL0U0PrmI1l_8zSg":{"text":"I go to The Big Easy to have a great time.  This place will NOT give you that.  I have no ","useful":0,"cool":0},"xj0WCbT5asOD_jyxQWJXKA":{"text":"It is a bit dark with the candle lighting, but the fireplace is nice when gets cold in the","useful":0,"cool":0},"qiZLJmNeiuStn93_tQULDA":{"text":"I really enjoyed the evening we spent here. The piano player was great. I was annoyed when","useful":0,"cool":0},"L_vB4s4Kvh4lj8veEN-Ggg":{"text":"One word: PIANO. This bar has such a fantastic piano man who does crowd requested cover so","useful":0,"cool":0},"zR6WBZVJGU0V40dBd1KcSA":{"text":"This was the perfect stop on a ghost tour - it is dark, divey, and unlike some of the bars","useful":0,"cool":0},"dmPKTCkn88z2pANzflyhFQ":{"text":"Lafitte's stands out from many of the other bars on Bourbon Street. For starters it's way ","useful":3,"cool":1},"raUulNkEtsBTbqB--pTOtg":{"text":"Historic location that serves up traditional NOLA drinks. It's always packed and if you go","useful":0,"cool":0},"j2Kkkk-lzVzZX-iUdgWN0w":{"text":"My favorite bar in the French Quarter. In the daylight the building looks like something t","useful":0,"cool":0},"7MB8kuia1Fm1dPHMGvVXzA":{"text":"It is worth a stop to have a drink to the oldest bar in the USA. Night time is very cool, ","useful":2,"cool":1},"MdMOC15nk6cyP_WAC9ErLA":{"text":"This place is awesome! Great atmosphere , fair prices, great service! Chris was amazing, a","useful":0,"cool":0},"h6xsw_RdQ49hoai-xN4Jqg":{"text":"This is the Bourbon Street Bar you will find packed with young people. The NOLA cigarette ","useful":0,"cool":0},"xWsaSL7TUcC1Hr4s_N2_xw":{"text":"We sat in the courtyard bar.\n\n The bartender may have been the rudest person i have ever d","useful":0,"cool":0},"dxz0KafartlNU4oDJ4FVJg":{"text":"Pull out 7 bucks, because Lafitte's has the BEST Hurricane in the French Quarter.  It's on","useful":0,"cool":0},"jVdq4x48siEE89mYzJ9ILg":{"text":"My friends and I love Lafitte's!  Don't miss the live piano singer - \"put $5 in the bowl a","useful":0,"cool":1},"n9P-cK5HwM26mXSyYeGo7g":{"text":"Interesting decor and haunted atmosphere aside, I can't say this place is tourist-friendly","useful":0,"cool":0},"2s4xdgkjrzuGxoaoutA5qQ":{"text":"It's on Bourbon, but away from the crowds. It's totally worth visiting. It's unique and th","useful":0,"cool":0},"eG8HBtdacXOOR054yCqkKg":{"text":"Wasn't a huge fan of the hurricane, but everything else was nice! But then again, I'm sure","useful":0,"cool":0},"8hyxpaxolBWlqz_mYi1Cvg":{"text":"This is one of those must-see places in New Orleans; both historical and hysterical. Do yo","useful":2,"cool":2},"PjC8O0g_-Fk8TrWNjBUFCg":{"text":"This is an old school bar with awesome drinks and reasonably priced. The voodoo daiquiri i","useful":0,"cool":0},"uM2QXzAzopeL88z_Eld1CA":{"text":"We liked these Hurricanes better than Pat O'Brien's. However, the service here was not so ","useful":0,"cool":0},"-xCM9YAZXB0bXPQY0aFWlw":{"text":"purple drank. piano bar. dark. sketchy bathroom. \n\nand yet i come here every time i am in ","useful":0,"cool":0},"sHtEotLPnDykYCThRW15qA":{"text":"My favorite NOLA bar in the quarter.  I mean who doesn't love the oldest continually opera","useful":0,"cool":0},"6e80IqPK9oiJ6kPRaNQKOg":{"text":"Definitely not the best Hurricane... If that is their \"special drink\" I would hate to tast","useful":0,"cool":0},"pawmP2EKgtQRQSe3uWki-A":{"text":"Do not leave New Orleans without going to this bar, it is New Orleans old school style.  G","useful":0,"cool":0},"FF_P86vKfHjWksQYHoYyKw":{"text":"What a great bar, with an interesting history! Gets packed at night, no electricity outsid","useful":0,"cool":0},"izYDcTY8G86hCdnBMHckpw":{"text":"Great bar lots of history lots of drinks absinthe is a unique taste but worth the experien","useful":0,"cool":0},"4olcfbxlzADV-OFfi2w84w":{"text":"The piano player is rude. She told us not to talk while she played and when we shut up she","useful":0,"cool":0},"gho1Q3E_oIFbjaFdhxaNnQ":{"text":"The decor of this place is awesome. Its very dark, candlelight is the predominant lighting","useful":1,"cool":1},"EhKXkF544EiCumpraJI0Lw":{"text":"Came here on a Thursday before making it a big night. We were referred by the lady from th","useful":0,"cool":0},"0-9y5zgcw8NOrgIMSMUsvw":{"text":"I really love this place, and while I was a NOLA local, I went back and would take picture","useful":0,"cool":1},"9giAZh_1cyq688Gn6hKNEw":{"text":"Loved this place.  There's no electricity except for the bathroom lights and to run the re","useful":0,"cool":0},"p8NEb6_rB7GEVMMoPIVP1w":{"text":"Lafitte's was my favorite bar on Bourbon Street. Atmosphere is amazing, especially if you ","useful":0,"cool":0},"kuHrafdxFkdvAjTLQEZGUg":{"text":"My first trip to New Orleans was for a convention. On our last evening in town we ventured","useful":0,"cool":0},"iqudpCL0Sfpy52nL4JA4mA":{"text":"Great music, fun atmosphere and grape daiquiris!! Inside and outside seating! I thought th","useful":0,"cool":0},"-qZAiM5SW8qCFiKxHZ4eTg":{"text":"I felt like everywhere I went, bar, restaurant, park, it kept getting better, and this pla","useful":0,"cool":0},"-xXdWr_NEnDPlMfyFd-d0g":{"text":"Very cool bar with a medieval ambiance. If you're looking for something different I would ","useful":0,"cool":0},"H16fkHPp8btOLPA1kKcA3Q":{"text":"This place gets busy, but it is a cool little place of history and offered a nifty atmosph","useful":1,"cool":0},"6DfcHoSnPC03LHhurCdsPA":{"text":"Love the atmosphere here - not too rowdy with plenty of history surrounding you.  A more m","useful":1,"cool":0},"IUUQbwTIHZEeL3tgm3dd3g":{"text":"Not the biggest fan. Went to the bar for the same three drinks multiple times. Different p","useful":0,"cool":0},"hEI2tmIILQU0JpI-wal15g":{"text":"One of the best places in Nola, in my opinion.  Go at night and sit at the grand piano aro","useful":0,"cool":0},"qwIsjlYxhKBTr6tiRadhWQ":{"text":"Like fellow Yelper Laura K. we ended up at Lafitte's as part of a ghost tour. And like Lau","useful":1,"cool":1},"vk3NR2cedYJSEob55mqV5g":{"text":"Worst drinks I've ever had. Worst service and rude bartenders. Will never step foot in thi","useful":0,"cool":0},"GhxAZsbQZjOeF5oh_bXfPw":{"text":"Fun little tourist spot! I loved the atmosphere and history behind building. Our server wa","useful":0,"cool":0},"XfIV4XHDff4xPt8V-6yhoQ":{"text":"The place advertises itself as the oldest bar in America. It was allegedly established in ","useful":0,"cool":0},"9jmILzvrhQ87Wlnchf-ehg":{"text":"Cool place with one major fault: They have a live piano player but don't bother to turn of","useful":0,"cool":0},"lvbhU_GvHOuwpjOCnOrJ-Q":{"text":"we use this place as a pit stop during our vampire and ghost tour, and it was a fun little","useful":3,"cool":4},"0QUDUA3g_WY6wC2skCbckA":{"text":"Cool, old place. It does have a unique odor when you walk in. Smells like Bourbon St. No l","useful":0,"cool":0},"AX5FHCDah5tVtbx-l3jvsQ":{"text":"I don't care if it's the oldest bar in the United States, their jukebox is trash. I'm sitt","useful":1,"cool":1},"JBZ8-EZiFoSC0_2fSALT2A":{"text":"The only place in nawlins to get a Hurricane!  They don't use the powdah only fresh fruit ","useful":0,"cool":0},"I4NCYFj8k58pIExqr0zhEA":{"text":"I love this place.\nYes it's famous. \nEveryone has heard of it.  \nIt's packed. \nBut it's st","useful":0,"cool":0},"zMZZWpPx6VQSeMoI50HWlg":{"text":"A fun historic place to grab and drink and visit with friends. It's super dark inside at n","useful":1,"cool":1},"1IOzuwcaodurYmTrohEMMg":{"text":"It is one of, if not, the oldest bar in America, and my absolute favorite in New Orleans. ","useful":3,"cool":0},"I_qAT-LmhgdbpvDlsgUyIQ":{"text":"A really neat place to stop by any time of day for a refresher. Supposedly it is the oldes","useful":1,"cool":1},"6nzEmr6itS_CDtbnPRhjBw":{"text":"I Purchased to drink from the bartender. He drop my change up on the bar. Before I can gra","useful":1,"cool":0},"DgUXrYJHTUqVXCxUsx4FnA":{"text":"Best hurricane we had in New Orleans. Great authentic feel, it's a must see during your vi","useful":0,"cool":0},"6hoM72IGiYWG3vTYzUQRNQ":{"text":"Service is prompt but not overly friendly. The hurricanes are great ....not too sweet like","useful":0,"cool":0},"X1sz-93_qol9T3y7NqUr9g":{"text":"Mixed smells of vomit and propane. Also $5 bottled abita.","useful":0,"cool":0},"2EMNUs4iTmHnrSh7xGhF5Q":{"text":"A must-see if you are in New Orleans for the architecture alone.  By far the best bar on B","useful":1,"cool":0},"gl0E-KdWf1IdZI1j0AetWQ":{"text":"Years ago, I went to Lafitte's on a semi-regular basis when I lived in NO, and really enjo","useful":2,"cool":1},"AURt6pjW7RMhLSYsczEFZA":{"text":"Went to Lafitte's on Halloween and didn't find it that spooky. (which is actually good sin","useful":0,"cool":0},"_R_z68n-xCUH3DUcl5NITw":{"text":"Love this place!  Love the ambiance, history, bartenders(josh you da man!), and drinks! \n\n","useful":0,"cool":1},"Mry3gIZon7w9H-wbm4Hu9g":{"text":"Giving an extra star after tonight's visit. Tried the \"purple drink\" that everyone raves a","useful":0,"cool":0},"ecJ1p4eAeKgSlHxUWOcRFg":{"text":"GREAT DIVE BAR!  Loved the purple drink.  We got totally messed up!","useful":0,"cool":0},"4yNhIMKAIMZYg4dFWXCOHQ":{"text":"Buy a hat and get a free cup.\n\nWe had to stop here while in New Orleans as it was alleged ","useful":0,"cool":0},"Dxvr7R3-BiniwuJhQyT2SQ":{"text":"Best hurricanes. Best atmosphere. That is all. Go. You will love it!  We always have a bla","useful":0,"cool":0},"VI57fssMXOZ-VvL6CaKMaQ":{"text":"I was invited by a local friend to have a drink in this place and I completely loved it. V","useful":0,"cool":0},"GgRQslo5kVYh8xYLQDFGMw":{"text":"The place itself is neat. Was here on Monday night. The place is primarily lit by candles ","useful":0,"cool":0},"SA7JxvEjYfJUgoMffcQRgA":{"text":"The drink selection is pretty crazy here. We ordered a hurricane and a purple smoothie. Th","useful":0,"cool":0},"q-7JX7QynAuJ27ml3Xohug":{"text":"This bar is amazing simply because of its history - the outside and inside of this bar are","useful":1,"cool":0},"DTgsFz1v2DfqcrwHvMbpfg":{"text":"Bloody Mary's are great \nThat is all that is great. Men's bathroom is not working EVER! Wo","useful":0,"cool":0},"xrBmmJIGeZ6N-9BhQ7oG9w":{"text":"The waiter was very rude, sarcastic, and aggressive. It made us rather uncomfortable. Sad ","useful":0,"cool":0},"xRIuvWr3_VyUW3GqVqgzxw":{"text":"There's something super cool about being in the oldest bar in the country. Hell, this bar ","useful":2,"cool":0},"P_7KvUONLNmazUkQUPMeiQ":{"text":"I came here on the French Quarter ghost tour about 9:30 pm on a Sunday night. The bartende","useful":0,"cool":0},"iyafAClBIT-qE4u6sCLBDw":{"text":"Best hurricanes IMO. Strong but still sweet and actually taste good. Came here in the afte","useful":0,"cool":0},"qN9VY9X_5Lqnx1sCHzwoMg":{"text":"This is it. \n\nPrime, pure, essence of New Orleans...in an incredibly (surprisingly) rustic","useful":0,"cool":0},"la-P3KKcaDF_-BVQE9NcNw":{"text":"The women's bathroom was absolutely disgusting and they only have one stall. The hurricane","useful":0,"cool":0},"TcsZZlwkOkckPxbrY2uWfQ":{"text":"If for no other reason you should check this place out for its historical significance.  I","useful":1,"cool":1},"xHpK8vEHRGoR6eRtpKoDxA":{"text":"If you ever want to feel like you are not in America come to Lafitte. A bar of mystical ag","useful":3,"cool":0},"Jb05cFCRl35wo85-l3v_eA":{"text":"In my three weeks here in NOLA, this as become my \"regular\" I guess you can say. I wander ","useful":0,"cool":0},"jhAfZ_4KAmfvmCTbPoBFCg":{"text":"It was pretty good. I stumbled in there a couple times, and it's very welcoming on the out","useful":0,"cool":0},"Yvt2Rta2kD385p5AVAui5Q":{"text":"Lighting level: Dungeonous - candles only\nPrice: comparable to other bourbon bars\nAtmosphe","useful":1,"cool":0},"tyIwwPrbzairaVHNJmNt-A":{"text":"What a great place to hang out with a group of friends while drinking the night away. On w","useful":5,"cool":5},"HZCLtKz2ARkCvG5pstXD7A":{"text":"The oldest bar with the original Hurricane. This is a must for at least one! Do not mix it","useful":0,"cool":0},"8PcKOWRVGeAzgMfH_UNshQ":{"text":"Great place to sit outdoors and enjoy a couple adult beverages.  Drinks were reasonable. L","useful":0,"cool":0},"LTi54BBEWYydZYmoPyMUoQ":{"text":"I happened to come here while a pirate convention was in town.  Between the pirates a few ","useful":0,"cool":0},"VKQQxVpDvs_SdAetBAFTIw":{"text":"This place was really cool. We went there on a Friday night and it was packed, particularl","useful":0,"cool":0},"923W2Owvmiwd3rQJhXXtZg":{"text":"The voodoo daiquiri is the best.  Tastes like grape koolaid but will knock you off your fe","useful":0,"cool":0},"7Xkr9Pd7wVDrB15s0hwKxg":{"text":"I've been a regular seats once a year last 20 years really like it's too cool place to han","useful":0,"cool":0},"G_3obAaSy6NbmfJYOCttew":{"text":"Oldest bar in US since 1772. \n\nThe voodoo daiquiri was pretty good. $9. Kinda like jelly r","useful":3,"cool":2},"hWz6ytiL4NGYp78lq1IG1Q":{"text":"You need to stop here for the history alone. This tiny place claims to be the oldest bar i","useful":0,"cool":0},"y4YyVDw_UZr4lktiMDedeA":{"text":"While the ambiance is nice their drinks are weak and overpriced compared to what you get e","useful":1,"cool":0},"OU226nC-hpyty2IVzcMKUQ":{"text":"LOVED that Hurricane Punch and that smooth slushy, Purple VooDoo Daiquiri drink!!!! They'r","useful":3,"cool":3},"G599Ksf26lQhhXKU03Iagg":{"text":"Love this bar! They have the best hurricane in the entire city! Great atmosphere and alway","useful":1,"cool":1},"Swcr3xHimG1mEBPWRXajNQ":{"text":"This is a really cool bar to check out just for the history alone! It's a historic landmar","useful":0,"cool":0},"_1MF8uYYh1xjblScN9Klqw":{"text":"Went here last night. Dark as hell, small bar, not much seating. Got myself a $6 Yuengling","useful":0,"cool":0},"kKGsbwWdyrXjKyMaqT9Zmw":{"text":"Visited about a year ago because friends told us we must have the purple drank. Drank we d","useful":0,"cool":0},"5luNEkcs90c1a75z2k21zg":{"text":"Super chill, dark dive. Loved the atmosphere. \n\nVoodoo slush is a racquet.  Not sure that ","useful":0,"cool":0},"gZh0vriMYrYDf1Ojdv4vmw":{"text":"Late afternoon or evening is the best time to be in the Blacksmith Shop.   From 6 to 9 in ","useful":1,"cool":2},"ZC2VtYnJHizBcrDAhGIdiw":{"text":"Loud music dancing in the street. The vibe is good I didn't care for the purple drink thou","useful":0,"cool":0},"GspB6KdRU3LDUEfFx6eZNQ":{"text":"Service was good, but they stopped serving more then one flavor of daiquiri and of all the","useful":0,"cool":0},"78r5vR4FLElcaK1FgLifbQ":{"text":"On my first day in New Orleans, which I am completely in love with by the way, we spent a ","useful":1,"cool":2},"WV3vcVGHCK-S9MsMifCZHA":{"text":"Loved this bar! Beautiful ambiance, very romantic with old fashioned candles with feathers","useful":0,"cool":0},"2xLXXD6r4Nlf2fkHpGoPMA":{"text":"This is a must do when visiting this great city!  Seriously, a must.  This bar is located ","useful":0,"cool":0},"PwhC3grEMfVuq2noUw9W0Q":{"text":"This was the second stop on my birthday tour, and I have to say my newly turned 34 year ol","useful":1,"cool":2},"7e-XT7TSw9WWQOOhpi09pA":{"text":"Super awesome place. Literally had no idea that it barely had electricity. Went during the","useful":0,"cool":1},"_24WE84KALsuXOeOGc9qQw":{"text":"Weird mix of enchanting and silly.  A beautiful (and historic) old bar with good drinks an","useful":1,"cool":0},"sM3sAn9oaaDPSy7b5hmYeg":{"text":"Lafitte's is the oldest bar in the US (so they say) and in addition to learning a bit abou","useful":4,"cool":3},"i7F6lKOOB5Dwgqsu0bsmkw":{"text":"Cool place to stop once.  The historical aspect and ambiance make it fun, and they have a ","useful":0,"cool":0},"bVanMgd5CBlW9LpBHAby2Q":{"text":"ive had hurricanes before and got turned off by them due to the absurdity thats in them, b","useful":0,"cool":0},"V13nTtDiuHy9LldOpGI25Q":{"text":"The place is pretty cool on the inside. Dark and woodsy (if that's a word). We order the v","useful":2,"cool":0},"zVVxhGx3Qq-g85yZXFah5g":{"text":"Such a cool, old bar with a great location. It is surprisingly large when you explore its ","useful":0,"cool":0},"i7V1WpncFXMyWlkWM6gUqg":{"text":"Four stars because a historical location is still operational and functioning. However a p","useful":0,"cool":0},"QcqSM7EAb2cetstH97CDdg":{"text":"This was my favorite stop in New Orleans. I fell in love with this place before I even wal","useful":0,"cool":1},"WDeD6IhIjdL0IBwdgj8UWQ":{"text":"I have two things to say about this place:\n\n(1) my children crept in the back entrance on ","useful":5,"cool":6},"OhnYKGQRvF5raQyK55_q3w":{"text":"You need to check it out because it's so old.  \n\nThis place is awesome, plenty of seating ","useful":1,"cool":1},"ztlXeMr10ocKzzZTZBdB5A":{"text":"Warning: This is a gay bar. If you're not OK with that, don't go in.\n\nLocalish bar -- used","useful":0,"cool":0},"8b0GLCXhhU4A7yx5zILdEQ":{"text":"I liked the candles that provided all the lighting for the place.  Definitely different an","useful":0,"cool":0},"oapLA3QNkZFQ7H7guG-EoQ":{"text":"Hands down the worst bar on Bourbon! Second time and last time we went the most unfriendly","useful":0,"cool":0},"u9f7_ROzioKzU-k49GnbGg":{"text":"Lafitte's Blacksmith Shop Bar is a darkly-lit bar where crowds frequently overflow to the ","useful":0,"cool":0},"5dijzJWv9HGXzzuxEwhodg":{"text":"Very busy later in the evening. Fun ambience, and great bartenders despite the business. P","useful":0,"cool":0},"mIZ9ndzYsL4LECq_lF4HXQ":{"text":"This became our nightly end of night hangout in New Orleans, totally loved the atmosphere ","useful":0,"cool":0},"IJWy-4kuRpsOo-C9hV87cA":{"text":"Their Fat Tuesdays type of drinks here are good.  This place is at the way end of Bourbon ","useful":1,"cool":1},"t2jnDd39BZCvsNoVqtAzvg":{"text":"Had a hurrican drink here. On one side of the bar its very frathouse. On the other side it","useful":0,"cool":0},"lGrGBWjeub2bTOPZYvqwnw":{"text":"Oldest bar in the USA.  Get a Voodoo... basically a grape flavored slurpee with ample amou","useful":0,"cool":0},"_Tu2nQ4n73JqcK37poOFbA":{"text":"Can't beat the history and ambiance here, and the drinks are very strong. Definitely a mus","useful":0,"cool":0},"bJjoxbQItzJFe0I5Ox3C2Q":{"text":"This is the King of dive bars in the USA.  There's history here. Be smart and look it up. ","useful":0,"cool":0},"9mwpys3FyAfk07OxrR133Q":{"text":"My husband and I were so excited about visiting this bar after hearing the history associa","useful":0,"cool":0},"nOJx-0-AicmYiCfLAm4Z5w":{"text":"Want to get drunk off one $7 drink? Don't mind your tongue changing colors in the process?","useful":0,"cool":0},"LDTxJXMHL5hIPRBKMdzx8g":{"text":"I absolutely love this hole in the wall bar. It was my favorite on the whole trip. In the ","useful":0,"cool":0},"T4urrFnBCFkmzO7oJ2ejIQ":{"text":"Great atmosphere. The building is really cool with dune history behind it. And the hurrica","useful":0,"cool":0},"mjQyOiRD7CAxmTWy5lAbrw":{"text":"i've spent more hours than I could ever count in this awesome haunted bar. go!","useful":1,"cool":1},"38g_5TE94V4gzzh0yOD48g":{"text":"I love everything about Lafitte's...excpet prices. They can get a bit high. This is more o","useful":0,"cool":0},"pTfCIAev_8PBHfL-7cPROg":{"text":"This place is over rated.  Service was unfriendly and their signature drink was not good. ","useful":0,"cool":0},"b7x1U3LRQ8_KD7Yxcep2eg":{"text":"This is a great place to go at night. Supposedly the oldest bar in America, and one of the","useful":0,"cool":0},"9yal5_eVHsh1amUAYfsb2w":{"text":"Favorite bar on my trip to NOLA.  The piano player had the whole place singing to Jackson ","useful":0,"cool":0},"hiOJY0C6gGl9HnMWSF5HAg":{"text":"after visiting and/or living in nola for a decade, i finally made my way to lafitte's. i'v","useful":1,"cool":1},"v9loSAKYXHgHmk3k9Bavsw":{"text":"Place was jamming last night.  This was a stop on our ghost tour, grabbed a local draft br","useful":0,"cool":0},"WqwQ-3ERYTu-q0l4ZHYKiA":{"text":"Historic drinking spot. I dig it. But lose the piano player. Replace with something in the","useful":0,"cool":0},"HKAn00f1BsUsGB68IbfeKQ":{"text":"The best time of my life here!! 2014 Mardi Gras nite. Packed with very friendly people. Di","useful":1,"cool":1},"6yDoBTgsdrx9U8D29vzdBA":{"text":"Worth the walk down Bourbon St. Old with great character.","useful":0,"cool":0},"XvyeBvKiai0_A0kIIDBhpw":{"text":"There's suppose to be a ghost tree & hanging lady in the courtyard, per our haunted NOLA t","useful":1,"cool":1},"97XwB-vhgS48BqwWiSjI2A":{"text":"It was ok......the voodoo drink did not taste like a grape jolly rancher as people said it","useful":0,"cool":0},"3g1VcDKXy3F8fhyygjWPvg":{"text":"Finally I got to have my drink here!!! They were filming Abraham Lincoln:Vampire Killer fo","useful":0,"cool":0},"XednQlFaIwf21bWHzfw4yQ":{"text":"LaFitte's is apparently the oldest building in America used as a bar - and as everyone els","useful":2,"cool":1},"9i3kGyvJJ1PlFymDJoRrtA":{"text":"Dude, this has to be the coolest bar I went to in NOLA for sure! They first opened their d","useful":1,"cool":2},"7NSayfMchihtyrPz4NrxEw":{"text":"You can't give this place no stars, otherwise that's what they'd get.  SHADY bartenders th","useful":0,"cool":0},"mz2ruo12R3BaGM-nXaVmcA":{"text":"This place is overrated.\n\nThe history and tradition is special, and the candles/fireplace ","useful":0,"cool":0},"Nzdqf2ifuPgxHPWhYCld8w":{"text":"Really enjoyed this place. The history makes it intriguing, the lack of electricity makes ","useful":0,"cool":0},"oYELLesjTsijRVWLN6OMNQ":{"text":"Fun place. \n\nGREAT piano bar where patrons sit around the piano and enjoy the festivities.","useful":0,"cool":0},"aaKcujBg65sJrgXf-Q5dNA":{"text":"I honestly don't recall much from my visit but photos from the evening indicate a roaring ","useful":0,"cool":0},"DghaIq8ejEVIsIzbRlLVug":{"text":"The piano player was cool and funny.  I liked that it was lit by candles.  Didnt go up fro","useful":1,"cool":0},"67QbWy6tkAdHWr_PupkHWg":{"text":"on the tolerable end of Bourbon Street...a must stop whenever we are in town!!!  big fans ","useful":0,"cool":0},"17EzZdLrfeLsS3aDfSTY8A":{"text":"This was the coolest looking bar in the French Quarter, and I was told that they have an e","useful":1,"cool":0},"jJAFNuBXNXp8FNLJqYf5XQ":{"text":"Had a blast here!!! The atmosphere and history make this a special place! I liked the pian","useful":0,"cool":0},"8cr-qAwcqzOiIjBYo8Sn_A":{"text":"This was IMHO the only bar on Bourbon worth reviewing here in Yelp. And I frequented quite","useful":1,"cool":0},"7kujkOENnrxyrhvPwgoesQ":{"text":"Oldest bar in America.... check!\n\nDarkest bar in America... check!  \n\nNothing really wrong","useful":0,"cool":0},"Hb4d6LCJtQ-ZHDpCdtCEoA":{"text":"This is one of those places that you HAVE TO go and visit if you are planning a trip to Ne","useful":1,"cool":1},"PGx48xTm5Cto3PpBcw2ICA":{"text":"Our favorite bar during our vacation in New Orleans. It's historic, dark and creepy (or ro","useful":0,"cool":0},"5PbWJq6rfljuoBY0ZT4oSA":{"text":"Historical bar that is also haunted, what more can I ask for?!  Tried the voodoo daiquiri ","useful":0,"cool":0},"PE-_7ld41y8TdfTN2oPFwg":{"text":"I've deducted one star since they added \"power\" to this place so TV's could be mounted on ","useful":2,"cool":2},"kKk-Z-RC9GNFtRE6VzVPYA":{"text":"Loved this place. Would definitely be a local here, if I lived in NO. Talked to some local","useful":0,"cool":0},"WX83f7PsZohoego_qQNG9Q":{"text":"Can get loud, but how fantastic is it that it is the oldest bar in the country?! Drinks ar","useful":0,"cool":0},"nnr3VQbp537bWs6GncVoLw":{"text":"I really expected more from a place that is considered the oldest bar in the USA. Its extr","useful":0,"cool":0},"GrrlXuBDeeYtQ_Gg22l0fA":{"text":"This place is worth a visit.  The history there is great.  The building itself is cool.  Y","useful":0,"cool":0},"oAJIcbPFQT_f8oXc-XK53Q":{"text":"Great drinks, friendly staff & great atmosphere, what more can you ask for from a local ba","useful":0,"cool":0},"w5QgIQXwV5JpoBVDL-j6oA":{"text":"First night here....\n\nI'm hammered...\n\nThe Man and I stumble over to this bar from another","useful":6,"cool":8},"19T3C65tfjKgyVsYV_oJDg":{"text":"Filthy, fun, loud, crazy..what else would you expect. I'd go again though, because it's so","useful":0,"cool":0},"eNyc1JuK0Eqt2cFKNOG-YQ":{"text":"Go in the evening where everything was lit by candlelight. Try to grab a table (waitress) ","useful":0,"cool":0},"x2Rd1ibyDkody54LzvZb9A":{"text":"In my opinion, Lafitte's sits on the best corner in the city, away from all the hub bub, a","useful":2,"cool":1},"ibfxo1cHClJmFi1oDsHdOw":{"text":"My friends and  I wandered down to this place on the suggestion of one of the local grooms","useful":0,"cool":0},"CLhMAhgtmom4tQHZnEITmg":{"text":"Nice little divey bar, not as packed with tourists. I think there was live music on the pa","useful":0,"cool":0},"okNMkFcv5inQCE5GkkXNGQ":{"text":"This place only gets five stars because my brother knew how to override the songs the empl","useful":0,"cool":0},"_ZiCYxM358SxUBtLKp7DDw":{"text":"You should go all the way down bourbon street to get to this bar. The hurricane was awesom","useful":0,"cool":0},"sivZey93Cs1Q9MzgLJyQrw":{"text":"Great,  historic, rustic, bar. Great service, cold beer, and a good time! We went twice on","useful":0,"cool":0},"UAVrb8z9aodp-2q64maJFQ":{"text":"I love this place- BUT, there's a piano player on Saturdays (named Mike?) who's so homopho","useful":2,"cool":2},"MJNFTU2_I__IZntq-v9kig":{"text":"A must when in New Orleans. They have the only hurricanes I actually liked. It's not cheap","useful":0,"cool":0},"TId8ylXGU8V_EGXQYhUUEA":{"text":"$9 Voodoo Daiquiri \n$9 Hurricanes\n$3 Water\n\nGreat ambiance and good crowd. I was fine with","useful":1,"cool":1},"MG6smi22X1JzA4R7mdFcdg":{"text":"Small and dingy BUT it has a piano man and a lot of history.","useful":0,"cool":0},"0AccJAAjQU0wi2xH9wxGXg":{"text":"I usually have a great time here and have been coming for over 20 years. However, last nig","useful":0,"cool":0},"VThaFjS8EfdV1YMbyFqPNw":{"text":"I love everything about this bar.\n\nAlthough it is on Bourbon Street, it is past all the cr","useful":1,"cool":0},"8n3JJuulZdIgJUxARMCFkg":{"text":"Whether or not it truly is the oldest bar in the Country, it sure does disdain electricity","useful":0,"cool":0},"UesHi4-pBSUdfx_smH3GrQ":{"text":"I absolutely love love love the history and stories of this building! You really must stop","useful":0,"cool":0},"2V2GxLdgNc1CP3Ic_3pfJw":{"text":"Josh was running this Bar when we visited early September 2012. I have NO complaints when ","useful":0,"cool":0},"z2QN1c_CCZqTq5WFoQamPA":{"text":"I heard from a few people that Lafitte's was a must stop; reportedly it's the oldest conti","useful":1,"cool":1},"lsoHv6usZAIlEt6HOvL_Rw":{"text":"I lived in New Orleans for many years and Lafitte's is one of my favorite places to go in ","useful":0,"cool":1},"TpLX-mBxIhDt2dWK1A4bpw":{"text":"Nice spot. It was busy. I grabbed a beer and went to the back to grab a seat. I sat at the","useful":2,"cool":2},"1d55o2bu-7CZkMUEJXbn2Q":{"text":"Been there done that.  Beast part about it - the AC cool spot right infront of the women's","useful":0,"cool":0},"Wa_BTTPmAiLyCP1LhWUMaQ":{"text":"Such a great dive bar on the \"quieter\" end of Bourbon Street. The oldest bar in North Amer","useful":0,"cool":0},"TNGycwuAQervv9A15WYvzw":{"text":"Not much on \"decor\", but atmosphere? Out of this world! Literally--this place is haunted b","useful":0,"cool":0},"91FSwI4pmK4A8tdkf2ZHAQ":{"text":"The top of the bar is copper.  Every French Quarter bar with a copper top claims antiquity","useful":1,"cool":0},"Dbpn1xY2-JebxcvNKouSmQ":{"text":"Nice place to hang out with people. We went for the historical relevance. We wanted to see","useful":0,"cool":0},"V2KBykhH5MnmRhn9gpj-_w":{"text":"I am proud to say that I drank here, the oldest bar in America, for about 3 hours with my ","useful":0,"cool":0},"6s3fsuMi-91CIcfEhuq9_A":{"text":"The Bomb ass spot in the quarter! Great drinks and beer. Awesome music and one of the best","useful":0,"cool":0},"HbMyczT1BOO-rJGPhgibfg":{"text":"For the history and the ambiance it is a must. I've been here for a couple beverages each ","useful":0,"cool":0},"5EhegAslR-Oj-AQ4UpK0bQ":{"text":"Great cocktails, cool ambiance and the live piano music was amazing! If you're looking for","useful":0,"cool":0},"m1IagEUpizpr9f0nPQLzsw":{"text":"Not a whole lot to say except that it's perhaps worth a brief walk-through at best just to","useful":1,"cool":0},"5i_fEXMziwsTm3sk1xdJfw":{"text":"Clearly I'm not the first person to review \"The Oldest Bar in America\" so I'll keep it sho","useful":1,"cool":0},"wzm2Ofaxp-ALREhN4YsWMw":{"text":"Apparently the oldest running bar in all of the U.S. of A. Pretty cool! A must-see if you'","useful":1,"cool":0},"og-95gz6P4NzzMvHhQnfWw":{"text":"The oldest bar in the US...didn't know what to expect.  The outside looks like an old one-","useful":0,"cool":0},"YCDHHPDDcCxY0jCDojXh3g":{"text":"Ive been to new orleans 5 times and visit Lafittes every time. The atmosphere, the vibe, t","useful":0,"cool":0},"3ewt9DgJL4zgN832giNmlg":{"text":"We stopped by since it was supposed to be the oldest bar in America. It's a dark bar and h","useful":0,"cool":0},"prcGCqRt7adekqfZrj8fqw":{"text":"This is anything but a typical Bourbon Street bar.  This is downriver from that dense fest","useful":5,"cool":4},"C3TYKk4dJSZIRQ7box-gJg":{"text":"If you like cherries...try the \"Cherry Bombs\"!  Liked the candlelight atmosphere and the f","useful":0,"cool":0},"lnB4P603IZqLGAy-XzTwVw":{"text":"Dark, dingy and a good place to hang out.  Patio is nice when the weather is good.  Don't ","useful":0,"cool":0},"t5kJhX7GjXtw1O8yu_o48g":{"text":"Great old bar.  We got stuck here during a thunder storm - not a bad place to spend an hou","useful":1,"cool":0},"I3nUk4a216_GVtvIceMU_w":{"text":"We just stopped here for a drink and rest our weary feet, I wanted to stop in an historic ","useful":0,"cool":0},"ObDRhxYe-y92vMbNkgmqpw":{"text":"Lafitte's is so old that Mr. Clean had an afro last time he visited. It's mega old. It mak","useful":1,"cool":0},"2l_l7-0kccIISHcGJZ8x2A":{"text":"The purple daiquiri tasted like cough syrup but got me buzzed. The bar itself is really co","useful":2,"cool":1},"XvLw21uBTL5gEV--gqpIbg":{"text":"I have a feeling that this is a place where the locals go and drink. It was a recommendati","useful":3,"cool":1},"cj2gYil8nOUMf2DiUQn6nQ":{"text":"It is really fun to go to one of America's oldest bars. Dark, mysterious and fun. The drin","useful":1,"cool":1},"IDOMMVZP9fGl4cmzW6LtUQ":{"text":"cool dive bar on bourbon st. oldest bar in NO so they say. good for a hurricane. pretty de","useful":1,"cool":1},"7PjoPlJObttAtu3mEYaABA":{"text":"This is a fine place to sit outside and have a drink on the less audible end of Bourbon St","useful":1,"cool":0},"DQzzFv3nCl0b8SMOmi2ewg":{"text":"It's tiny, it's dark, it looks like it's going to fall over. And it's also a \"must do\" for","useful":0,"cool":0},"LTdy4YW5I60SaAjBAD19mw":{"text":"Had to try this place as it is the oldest bar in the U.S.  What a great old quirky looking","useful":0,"cool":1},"W3F2TpzXdyQ2b5i51l_6lg":{"text":"Had to check out the oldest bar in New Orleans. We walked in the room was dark, lit by can","useful":0,"cool":0},"4l0y6_gjkwvHHUh-yAaBzA":{"text":"Whether it is, or isn't, the \"oldest bar in the United States, it was built in the mid-lat","useful":0,"cool":0},"f04lsUw6n_qmNDBt3VQiYA":{"text":"My favorite bar in NOLA. Always packed , live band and always happening. :-). The drinks a","useful":0,"cool":0},"3wyFQjlJ0d7BxfmXqzzVEg":{"text":"What I love about this bar is that you feel like you've been best friend with the stranger","useful":0,"cool":0},"nejGAM6lesjd8P-VRjED7A":{"text":"Not huge drinkers honestly but you can't pass this up if you're in the French quarter Clai","useful":0,"cool":0},"bUaP0LJGqjyuTZTW3vwqUg":{"text":"My husband and I stopped here for a before dinner drink. It was the perfect place to take ","useful":0,"cool":0},"GLWyC11tFMuVdqNZkrCc5g":{"text":"A little disappointed, everyone told me this place had no electricity but there are TVs, v","useful":1,"cool":1},"BpQvsUu5ZOWbYeedHRslGw":{"text":"Love this bar,  it's a few blocks past the madness of the bulk of Bourbon Street,  and a n","useful":0,"cool":0},"bcWb2LheyrO4qvAwr9vFow":{"text":"This is one of my favorite bars in the entire Earth because of the dim lit room with the p","useful":1,"cool":2},"IVNi4abRFMXsPCDr5SXFLA":{"text":"Love, Love, Love this place.  I'm a sucker for historical dive bar and this is one....hand","useful":7,"cool":5},"WNIhrDl_vg2Q6UJlG0ujCg":{"text":"Very cool spot and and incredibly old building lit mostly by candlelight. Purple daiquiri ","useful":1,"cool":0},"xNx_T2-fBP23n6Mq3bGGbQ":{"text":"This place is cozy. A sing a long Piano was in the back area. Not a lot of space but worth","useful":0,"cool":0},"M0prXgy7B-FTQLmGZHhB9g":{"text":"I was a little disappointed with this place, its really cool on the inside and dark so its","useful":2,"cool":0},"n7Ms3sIa1Vuuzmrs2LI1iQ":{"text":"Love this place!  even though it's on Bourbon Street, it's way cooler and far more chill t","useful":0,"cool":0},"G3g5OdmKI3kWTZCnLXJ0Nw":{"text":"A must!  Went late in the evening and it was pretty packed but we were able to get a table","useful":0,"cool":0},"Gzo9T8eivwnB1WCAcK-UzQ":{"text":"Visit Lafitte's if you want to experience the NOLA that natives do.\nIt's a dirty spot, a r","useful":0,"cool":0},"PVnqpPY5Dy0ZY3XS2WaDvw":{"text":"Awesome place to hang out just because of it's rich history, but the drinks are worth the ","useful":0,"cool":0},"GPVuzIgQo-F4lUF3d4a-nA":{"text":"This place is awesome!  Great service and their purple daiquiris are great for the price. ","useful":0,"cool":0},"MB5uXg_dMo6WKsRFRKWpXg":{"text":"As everyone else has said, great place to check out while in NO.  While we sat drinking a ","useful":0,"cool":0},"ElUwZ1OyGAjBsuFbt64ppQ":{"text":"Vary good service this bar is 2.5 blocks from all the loud music. Bartender was not to sur","useful":0,"cool":0},"5tFHazmYrZ8ZofcR88RZbw":{"text":"Just had a drink here. the bar is old and you practically need a flashlight to find the ba","useful":0,"cool":1},"NrwZ6RactBamUOJ5ZVksRg":{"text":"Given the historic nature of this bar, it is a must see when visiting New Orleans. I am no","useful":0,"cool":0},"SK_gwaVlZIaPhpZdtNowNQ":{"text":"It's a good Dive Bar and we really wanted to love it but got a little change of heart when","useful":0,"cool":0},"bEK5bBdrekBZNyE9JeumSA":{"text":"Cool that is over 230 years old but its now just a tourist trap with bad drinks. The eggno","useful":0,"cool":0},"c-DEqVoWjm8o53mvUL0DVQ":{"text":"Great spot and COLD beers! Love the history! A must stop if checking out longest running b","useful":0,"cool":0},"jp0SsWKXTS_AVU0vYqp7Sg":{"text":"As noted, Lafitte's is the oldest building in America that is used as a bar--and one of my","useful":3,"cool":3},"TvbVuismzqtyAx72ttyo5A":{"text":"Drinks not all that. Their purple drink has really nothing grape about it. Taste like coug","useful":0,"cool":0},"w0idh0WUbsQGU5trcNBemQ":{"text":"Three unique experiences (Patio, Piano, Intimate) all of which I enjoyed immensely.","useful":2,"cool":2},"HOP2ltYcUzjfSGvzmjnT0A":{"text":"One of the coolest bars I've even been too.  At the end of Bourbon Street.  Feels truly li","useful":1,"cool":0},"_mUFprBv2I_FarvwpYWDPA":{"text":"Go because its fun and one those places you should visit on your first trip in New Orleans","useful":0,"cool":0},"ygaJ7PuKwlQuIZ2LSqdzhw":{"text":"Great off the beaten path bar on Bourbon. Get the Voodoo daquiri. Good stuff.","useful":0,"cool":0},"-5PXaNIJVrSNzT__vvjwjg":{"text":"Super chill spot that gets packed early. Looks a little shady and small from the outside b","useful":0,"cool":0},"Qg3ROeLycdwNjM_xzOX0HA":{"text":"This place is historic, and well worth repeating! It is the oldest bar in NOLA, had cheap ","useful":0,"cool":0},"iVpefvLvgtR2RPt9xSsP5w":{"text":"Apparently the old bar in the US and probably the coolest, mellowest bar on Bourbon Street","useful":0,"cool":0},"8o6VZT4NEZMgiZpsMGghPw":{"text":"If you're looking for a place to get cheap drinks, good music, and a decent crowd, all whi","useful":0,"cool":1},"LoG9tIrjL_kMDqoR3QtUfA":{"text":"$5.25 Beer and good red bean and rice!  Wish I had one of these in the west coast.","useful":0,"cool":0},"bqNS2KyYMse22TRXu7sTMg":{"text":"Apparently the oldest bar in the USA and its haunted.  We have been here a few times, and ","useful":2,"cool":0},"im-u10FbsmaevcDdlF1sTg":{"text":"Lafitte's was by far my favorite bar in the city!\n\nThough Lafitte's is on Bourbon St, it's","useful":3,"cool":1},"woonpvAR4TWkKW3865-a9A":{"text":"A local recommended this place when I said I was so tired of bourbon st! Came to visit and","useful":0,"cool":0},"nGUvNxiwxSbCDw5hhlnFdg":{"text":"I've been here 1 other time on a haunted tour. Its still the same dark vibe as before. Lov","useful":0,"cool":0},"9s9gBC_PwBzOuIfsLysJ2A":{"text":"A great bar to relax at with friends.  It's not the type of place you want to go with a la","useful":0,"cool":0},"yzunYgJ3pvzM6haW2C6AdQ":{"text":"Experience of a lifetime! The oldest bar in the United States did not let us down. Ordered","useful":0,"cool":1},"qpvyZJDpB6a3O35kIje1BA":{"text":"It's still a winner, so far on this trip we visited it twice. Once on Halloween and then a","useful":0,"cool":0},"Izf1-cQJHX6-V8JQySpr3g":{"text":"LBS has the distinction of being one of the (if not, THE) oldest bars in the same location","useful":0,"cool":0},"PUJZKCWLFsUZXRWaQnqy7w":{"text":"Do you have one of those friends that tries too hard be just a bit too cool. That is Lafit","useful":1,"cool":0},"F4EZvixXKZq3VCB-BCS66w":{"text":"one of the coolest bars i've ever been to. we were playing house of blues this summer & st","useful":0,"cool":0},"sopDJD7ALsZ_pVjrNpSGCg":{"text":"Cool bar that has a great charm and vibe. Live piano music was great. Ordered a hurricane ","useful":0,"cool":0},"pC8jooVlhMcufK-FxdKK7A":{"text":"This is my favorite NOLA haunt. No electricity in the place. It's all lit by gas lanterns.","useful":0,"cool":0},"P7sR1uJM4sSOKvGeLhbbdQ":{"text":"Excellent bar to get away from the craziness on Bourbon.  Dark and cozy with a solid jukeb","useful":1,"cool":0},"BNah0QWKBNnijM0-YgRoVQ":{"text":"One cant come to New Orleans without visiting Lafitte's. I believe it is still the oldest ","useful":0,"cool":0},"mfuXzj5isY3Xq9-qXfyvSA":{"text":"Oldest building in New Orleans and the Oldest bar in America...how can you not like that?","useful":0,"cool":0},"PtcUVC5h4FJAVkRqjDJp6g":{"text":"I've been by this place dozens of times and never bothered to check it out.  So, Lundi Gra","useful":0,"cool":0},"bzJhH9blO5A3F7Xw8oYWPw":{"text":"If you're from out of town, you pretty much have to go here, or people will not believe yo","useful":0,"cool":0},"X2_5rHYkxN890ep-m-SU9Q":{"text":"Anothe bar I havn't been in a while but it is still a jewel. We arrived in the early eveni","useful":0,"cool":1},"RwbascMHuvo1w2T_fBd4Aw":{"text":"I stayed next door to Lafitte's, or \"Pirate Bar\" as some of my NOLA friends call it,  whil","useful":0,"cool":0},"oitQCxr1MUUqdZHwb_QRvw":{"text":"Just go here, order a hurricane, then sit back and take in the crazy ambiance of this plac","useful":2,"cool":3},"SFJwvM-YPtxZU0O4-Zr_ZA":{"text":"This place reminded me of pubs in Europe. Very cool, and worth the walk down toward the en","useful":1,"cool":0},"E0KVzdMzT0FVzIzyhZHvOA":{"text":"Great way to cool down. Nice and dark. Love the candles on the tables and general feel of ","useful":1,"cool":1},"unR8dpQnwiqObNgGN0296g":{"text":"Excellent drinks! Lots of interesting pictures on the wall.  I might have to go back, buy ","useful":0,"cool":0},"p7bEt4CI5wASXLTVp8E-0Q":{"text":"Lafitte's Blacksmith Shop is a historical site and a bar all in one. Now you don't need to","useful":7,"cool":4},"haz5cMLuKwg7mCmjRmWaRg":{"text":"Haunted much? We actually got some interesting pictures here, ghost pirates maybe? Atmosph","useful":0,"cool":0},"eyPkm6AKQNm5g1C1_XSIJA":{"text":"Such a cool little place. I think they said it's one of if not the oldest bar in New Orlea","useful":2,"cool":2},"C_PoOEuAN5Ws0YnXjo_UPw":{"text":"Best Hurricanes in NOLA hands down. Yes, not the greatest of places to hang out (dark, dam","useful":0,"cool":0},"5oTWAUQymR-PVjo_PkmW4Q":{"text":"This place is worth a visit.  It far down Bourbon Street, way past the lights, strip clubs","useful":1,"cool":0},"TIREMJ00pdP8vh4sD2EsoA":{"text":"Cool spot. Different than most other Bourbon St. establishments, although they do offer th","useful":3,"cool":2},"GL3lZJX3kM69oEl4P6NbUw":{"text":"Dark, dank, candlelit hole offers good times amid great music. Most def worth the drunken ","useful":2,"cool":2},"g8mDBQ6WSN_Nga0PdzRg8Q":{"text":"This place is great! Its the oldest bar in NOLA AND its also haunted. If you have a chance","useful":1,"cool":0},"iFCO6CjlXyH2iXK-1aowkg":{"text":"What an awesome bar!! Visited here for the weekend and this one was definitely our favorit","useful":0,"cool":0},"1WbyiI9KrHo9ey1swmI3pw":{"text":"Super old.  It has been there before the USA was the USA.  Its past the gay area on Bourbo","useful":1,"cool":0},"m8q_hFLxICtoDyEpD8F4dw":{"text":"We HAD  to stop in the oldest bar in the USA and you should too, although I'm not certain ","useful":4,"cool":4},"O6zIDYFRt16OhLfDTkB42A":{"text":"The most historic Bar in NOLA so you have to check it out.\nI would go early afternoon or l","useful":0,"cool":0},"_bwstfAytCo9CFZ5wbhbKg":{"text":"Simple bar with decent drinks and a lot of history. No electricity and drinky dranks could","useful":0,"cool":0},"rHbL2sUM47DhdjtWYtBLsw":{"text":"Uh oh....I think they changed the hurricane recipe :-(\n\nHad it twice since fathers day and","useful":2,"cool":1},"7xoH15QrZ57YQ9tuFO2Vpg":{"text":"One of the coolest bars I've ever been to.  Apparently, it's the oldest bar in the United ","useful":2,"cool":2},"QVJBf0xckSxwYEGl5GD5Gw":{"text":"Hands down my favorite bar in New Orleans.  My friend said something like, \"it smells!\" Wh","useful":7,"cool":8},"7SfeigeVthi3qHasDqRqQQ":{"text":"My friends and I went bar hopping for a friend's birthday and we stumbled upon this place.","useful":1,"cool":2},"kTbb3qrv9m0PDxHfKef9lw":{"text":"Down on the far end of Bourbon Street, where the bright lights and beads are fewer and fur","useful":3,"cool":1},"5_hHUaWdrNw-th3kvGVP0Q":{"text":"What better place to review than the OLDEST bar in the country for my 400th review?  I can","useful":1,"cool":1},"fruoz7xpuxjuQ-FihEDKPw":{"text":"Reportedly the oldest bar in the U.S.? It seemed to be full of tourists. It's super dark i","useful":0,"cool":0},"Ai20CAsk8JQ_pU0NG1ifGw":{"text":"I want to give it a higher score, but other than the cool atmosphere, it's sort of a typic","useful":2,"cool":0},"GUzRD_RcDz_sIZXkxXNoIg":{"text":"An awesome ambiance with candlelight in the evenings and a candlelight piano bar.  Incredi","useful":0,"cool":0},"32Ps0ZWxvA7LEzuAofA5UA":{"text":"For an alcoholic nerd like myself, coming to Lafitte's Blacksmith Shop was a must. First o","useful":9,"cool":5},"J7AOw1FG0w_8XDiFM2j53w":{"text":"Really cool bar just far enough from the \"weird\" part of Bourbon to have a good crowd but ","useful":1,"cool":1},"si4-fnp4WuaKUjiPRx2lXQ":{"text":"Dive is right but considering it's the oldest bar in Nola it's definitely a great place to","useful":0,"cool":0},"DG-HI6OlJABVmYlPZ2KxsA":{"text":"My favorite oldest bar in the US. Not a whole lot of space, but a whole of charm. A few lo","useful":0,"cool":0},"5ZSrW7wCvj6GufJMcoCCeQ":{"text":"Smells horrible, not very friendly.  From the outside, it looks like it could be fun.  Whe","useful":0,"cool":0},"6tft2vJlXl19z5Ky0sdFSQ":{"text":"Wanted to try this because it is in one of the oldest structures in New Orleans. Service w","useful":0,"cool":0},"O3Mr6AXHm0YswaYiVqUN7g":{"text":"i went here for it's historical value. quaint place, at the end of bourbon.","useful":0,"cool":0},"h0FwoOqR992k4x2gLHbIWA":{"text":"Don't avoid Lafitte's because of the Bourbon Street address -- it is a few blocks clear of","useful":2,"cool":2},"tndc1fqOEkXgWcutXXNcRA":{"text":"Ok, ok... I know this is a classic.  But I think that's my issue.  It's now a tourist clas","useful":1,"cool":1},"sbgDPINHBi2b_S3LycfF_g":{"text":"My husband and I went in July of 2013 and just loved this place.  We had a few beers and l","useful":0,"cool":0},"XWpkBpCnkGNDM4ppmoDfNw":{"text":"Fantastic bit of history and great place to get off Bourbon St and have a good drink while","useful":1,"cool":0},"flkpi0xyjenYJ-kwS9pcXw":{"text":"This bar's claim to fame is not that it's the oldest bar, but that it's the oldest bar wit","useful":0,"cool":0},"NEn1vIoRjzhJOEXP7xTQ1w":{"text":"The story behind Lafitte's is fascinating and this being the oldest bar really intrigued m","useful":0,"cool":0},"3F507DD4VxsXooWAVlufaA":{"text":"I thought O'Brien's hurricanes were lethal until we came here. Dark and shadowy vibe mimic","useful":2,"cool":0},"R6w51__739qYe3_7Xjo3eA":{"text":"Bizarre little spot in the \"quieter\" area of Bourbon - fun piano bar with a good vibe.  Di","useful":0,"cool":0},"6QxdCYlK2KfX8nR8_1uanQ":{"text":"This place is awesome!  Hurricanes are STRONG, prices are good, pianist is super entertain","useful":1,"cool":2},"_WhNaDTrdPCt6U1y35u26w":{"text":"One of the oldest bars... Dark with candle light only... Great hang out with a man who pla","useful":1,"cool":1},"kw4KWzGQBW8V39GU0ckZOg":{"text":"Well this review is way over due considering it was over a year ago when I visited.  Hell,","useful":0,"cool":1},"_mFYRcO5cemuQg1sXJUNAQ":{"text":"It is what it is; a very packed and famous bar. Our ghost tour stopped here and so does ev","useful":1,"cool":1},"94-WBxGC02dVne0-KI9GrQ":{"text":"Pretty cool place. We visited here during one of the ghost tours while in NOLA. It's got g","useful":0,"cool":0},"EvcTXiMvYvmC4i6-8fgu_Q":{"text":"This is a really cool place, so much history here. \n\nThis was our first stop on a Bachelor","useful":0,"cool":0},"VfqubSlPCG1W1S8SqwmEuA":{"text":"Yeah, the secret IS out....But it's a great bar anyway.  It's falling apart....Almost to t","useful":0,"cool":0},"ieBEJDUK-s_RR-6WJC9MtA":{"text":"STREET PARTY ANYONE? \n\nMy girls and I stumbled upon Lafitte's as our last stop on Fat Tues","useful":0,"cool":2},"uFHZJLwznigoDKjfIoK39g":{"text":"Great drinks and atmosphere! Live female on the piano wasn't very good though. It's a must","useful":0,"cool":0},"LwmnZon_EzdXVQ0hdQsF9A":{"text":"When visiting New Orleans a few years ago we stopped here for a few drinks. Being one of t","useful":1,"cool":0},"3B5RUcN4ojW2Q4JT-tsmQg":{"text":"This place has a very cool vibe and atmosphere.  The drinks selection is average but the h","useful":0,"cool":0},"IgLwPU8KAp5aEOWZqPDNWw":{"text":"One of three original French-colonial era buildings still standing in the Quarter. The who","useful":3,"cool":0},"c03SNoAzB-TU1GI3evzURw":{"text":"This place is cool and I have yet to hear anyone I go there with say it's not. What's not ","useful":1,"cool":1},"97hP_cXVnsMS-ncGGficNQ":{"text":"Great place, tiny but cute with OK drink selections. Not big deal here. But the Asshole Be","useful":0,"cool":0},"oA-gNAYeRzmT3sUsSP-VXg":{"text":"Jean Lafitte's Blacksmith Shop is rumored to be the oldest bar in America. Legend has it t","useful":0,"cool":0},"Mv2P8ijeNQHiU2UZlkBUSA":{"text":"This place was cooler then cool. Had such a great chill vibe. It looked super small but th","useful":0,"cool":0},"2HAAkffuR5AcEPJobJwUzg":{"text":"We visited this place twice during our trip to New Orleans. The first time was a five star","useful":0,"cool":0},"sGgbP0yn-P03O26XG3H0Sw":{"text":"Great drinks and atmosphere. Highly recommend this place if you have a few hours to kill o","useful":0,"cool":0},"O3CwyvJm6RY3qjv5uEm0vw":{"text":"It is so charming, that we ended up going twice! \n\nIt 's dreary, moody and dark. \n\nIf you ","useful":1,"cool":1},"_ZCuN2nB63NT4a8GnGiExg":{"text":"Love the chill atmosphere here. We came for afternoon drink and then back again at night f","useful":0,"cool":0},"w-aJqwmam5COChFrnMytaA":{"text":"dim, dust, and ancient. what more could you want from our nations oldest bar.","useful":0,"cool":1},"oDzS45FrGZ_aj7xlTbLjRA":{"text":"What a pleasant surprise. Walking into the oldest bar in America, I felt completely entice","useful":0,"cool":1},"qDqGVlmahjcIs8dbbG_53w":{"text":"This is one of those places that gives you that weird feeling that you just stepped back i","useful":0,"cool":0},"cTl5KDvizIZVYS_-hGH0xA":{"text":"Lit only by candles!  A must-stop in place each time I visit NOLA.","useful":1,"cool":0},"Gs2Dc3m8V37fZAuGm74n0w":{"text":"Loud fun music. Went during the day on a week day. Bought 2 Abita beers in bottle for $9.5","useful":0,"cool":0},"0HDfRhQFQMoe74tdbidynQ":{"text":"Lafitte's is my favorite bar on Bourbon. I love taking people there who have never been. S","useful":1,"cool":1},"BYthJumEQjFXOzXvpZolSA":{"text":"Dive, worth the walk.  Every time I have been there there is live music, cheap beer, great","useful":1,"cool":0},"5DLlNVz-cTke0cgAJF0Njw":{"text":"Brilliant bar! I make it a point to stop here every trip I've made to New Orleans. It's lo","useful":0,"cool":0},"5IMGj89kunEiejr7PuQIIg":{"text":"OLDEST BAR IN THE USA, COOL. Not that cool. I wish it was more authentic. They light it wi","useful":2,"cool":0},"KDhKeVCjeNXloi8PqOHtJA":{"text":"This is the oldest bar in New Orleans and it is HAUNTED... OOoooOOO :) \nWell that's what o","useful":2,"cool":4},"ijJwzg0NK4RuMF15WsRD5Q":{"text":"Original construction still in tact with minial lighting to keep authenticity. I like to v","useful":0,"cool":0},"Sw3tOInncGLlzlXLwoPwvA":{"text":"This was an OK bar.  Loved the lay out.  Didnt really like the Voodoo Daq\n:-(.  The drinks","useful":1,"cool":0},"pabwusMNP7SFI6YmQ-b_lQ":{"text":"Cheap drinks with a frat party vibe. Sad considering how amazing the interior is. If you a","useful":0,"cool":0},"e35TwVABRJy6Qzsfxpm29Q":{"text":"Stopped here as part of our Haunted History Tour...and enjoyed some fab (and strong) purpl","useful":0,"cool":0},"DmLJCFYm4_oUn-GvT8i9dw":{"text":"I don't get it. Fine. It's historic. But why all the excitement? Is a neighborhood favorit","useful":0,"cool":0},"N6IQONDUXSemngGr2tAgPA":{"text":"Although this place has a historical value, all the nuance is lost with a sloppy restroom ","useful":0,"cool":0},"ZbtH5V8mnqUWO-CAHl6zcw":{"text":"Oldest bar in the US!  I was lucky enough to grab a beer and sit out front since this plac","useful":1,"cool":1},"vmtSHoYXoDjfIUUd6ueAzA":{"text":"Where else can you go at night and see by only gaslight or candle light?  No modern-day, n","useful":0,"cool":0},"E073gppJxXz4bSaa0qPYdw":{"text":"As the oldest continually occupied bar in the United States, it's just a cool bar to be in","useful":1,"cool":1},"42RHlJI7_ej9KOT9QHLelg":{"text":"One of my favorite bars in the Quarter.  It's been my favorite for over a decade.  It's da","useful":1,"cool":0},"djDg91fy2xdgUN5UTNftFQ":{"text":"It's cool drinking inside and outside of the oldest bar in the US.  The hurricane is delic","useful":3,"cool":2},"yBbyfuPKtmYS8hKl56CyQQ":{"text":"Fabulous historical place.   The hurricanes and atmosphere were awesome!    I bought a gre","useful":0,"cool":0},"CuHgFuzKFN81Fxdqk6TL0g":{"text":"The only thing different about Lafitte's today and your neighborhood bar is the rough ston","useful":7,"cool":4},"CDFPyt1fmnOUILa3cwZA2Q":{"text":"Oldest bar in the united states, definitely worth going just to say you have been. We went","useful":0,"cool":0},"17ahlptHbqjo1EED90NiBQ":{"text":"Purple. Voodoo. Daiquri.   \n\nOR\n\nEggnog Daiquri on Christmas.\n\nCreepy pirate / vampire fee","useful":1,"cool":1},"ZmbaCWFGWFnaVxoL9GNRoQ":{"text":"Hung out at the oldest tavern in the US..drinking what the waitress said was their most po","useful":0,"cool":0},"aGU8_1JFe3KA5FqVwnfpcQ":{"text":"I got introduced to this bar on a Ghost Tour around the Quarters and our break from the to","useful":0,"cool":0},"rP5UtOZm6oLU43wGTnIMOg":{"text":"It's cool for the history behind it, but truthfully, it's an extremely poorly maintained d","useful":0,"cool":0},"7n9WrRM5LHzW6cQS5l1Cvw":{"text":"probably the best bar on Bourbon St. Worth a trip for a romantic, chill night.","useful":1,"cool":0},"DlplQ5az_XPR5t6RUkBvUg":{"text":"This bar was awesome! The drinks were very good and there was a man playing piano at the b","useful":0,"cool":0},"zIPfCp5Zh7BTaWPsYTccsw":{"text":"A \"should try\" while visiting New Orleans.\nConsidered to be the oldest building in the Fre","useful":1,"cool":3},"c0nzkUg4rYF7d2aQz8TBag":{"text":"Love this bar. It's got a cool vibe about it. It's the oldest bar in America.  And was ori","useful":1,"cool":0},"CmVIRS-0bL5YsL4llaronA":{"text":"The Oldest bar in the US!  This is a great little place at the far end of Burbon street, q","useful":0,"cool":0},"qPgbmEw5T5rz8L3JiHML1w":{"text":"Creepiest bar but a must feel. No lights running through electricity and candles are lit o","useful":0,"cool":0},"Ah9UIorPww1oOd0BU45GUg":{"text":"Ended up here at the recommendation of a friend. Had a hurricane - it was awesome!  Great ","useful":0,"cool":0},"PCzoOxBn60XDBF29X1vaZg":{"text":"It's cool little hole in the wall type place. Their voodoo Daiquiri is very popular but in","useful":0,"cool":0},"OmaM4O-N9iugsuxgwtW0mw":{"text":"I was really looking forward to trying this place.  The idea of it being the oldest bar an","useful":0,"cool":0},"DWUrxOPLN1D09geUYQlZaQ":{"text":"This joint was a blacksmith shop in the 18th century.  Supposedly, it is the oldest bar in","useful":0,"cool":1},"kNMtyFPd1gYK4XN14-ZF3A":{"text":"One of the few reasons to come to Bourbon Street! Don't expect anything fancy (particularl","useful":0,"cool":0},"coVg5pvfgMaTNVZu23liMw":{"text":"Came here after Ghost tour. It is the oldest bar is NOLA and America! Voodoo drank was gre","useful":0,"cool":0},"2Xtdh2WuOHfyMiOsP9W9Tg":{"text":"Cool bar but very dark...like candles only dark.","useful":0,"cool":1},"5fw33BUZmVAGHyPsD7v-Ig":{"text":"We had a really good time visiting with my cousin and his wife at Lafitte's Blacksmith Sho","useful":0,"cool":0},"tWlnpO8yPrEo_DqHfdF4Ag":{"text":"An absolute must when in New Orleans. This has always been my first stop. Get  there for t","useful":0,"cool":0},"MYFYELSMa6Ol16hVx_iBmw":{"text":"Good stiff drinks. I had read about the history of the bar and that it was one of the most","useful":0,"cool":0},"vEZMszNfsnESVPcYdbbp8w":{"text":"The bar is worth a visit just to check out the building.  Just perfect - dark and moody, v","useful":0,"cool":0},"fTOdcCzr9mncj3oyL9w0_g":{"text":"I loved this place!  We passed by it on our Haunted Pub Crawl - but didn't go in, so we ha","useful":0,"cool":0},"8ZV2ux9lLxZ-xGQYRFjerQ":{"text":"Nice and relaxing\nHistorial\nReally Freakin' Cool!\n\nWait, you ask. A bar on Bourbon street ","useful":1,"cool":0},"00oL8Hzpe0_PCyzln2fz7Q":{"text":"This was the perfect place to get away from the crush of people and noise on Bourbon Stree","useful":0,"cool":0},"WXHiJSv9CFmS7YuywDvxnw":{"text":"Always a go-to place when visiting Bourbon Street. The drink to get here is the Voodoo Dai","useful":5,"cool":3},"0_2a3Qh7b1T9KXq4yVL_KA":{"text":"We visited in both the day and night during our recent visit. Cool bar, lit by candlelight","useful":0,"cool":0},"3iRuVpMbZuPNaYiqKqoA2g":{"text":"A more mature establishment relative to the rest of Bourbon St. This is a place where you ","useful":0,"cool":0},"zVT9FYjVqQn5k9fL2yIhRA":{"text":"If you are interested in not being served and when you are, being treated like a \"inconven","useful":1,"cool":0},"k8KHrFyQdbgQZCVif9fuRg":{"text":"I has the pleasure of discovering this fantastic place on one of the Grey Line's NOLA Cock","useful":0,"cool":0},"40rd7QK8E9_oUzRd9UsdgA":{"text":"Great Piano Bar... Awesome drinks. Architecture and Atmosphere are mind shatter. Parking a","useful":0,"cool":0},"rc8Ini3jihBzXojG7MZ7MQ":{"text":"Very nice little addition to a trip to New Orleans - adorable and lots of history. Drinks ","useful":0,"cool":0},"xiWz1tIvjy-us_dcRPJsLA":{"text":"Such a quaint place this with an interesting mix of people that come here.   There was a p","useful":0,"cool":0},"jMKlipUeTBpiTA1c3Q3jNg":{"text":"At the end of Burbon Street you'll find this super cool, dark and charming pub.  Good drin","useful":1,"cool":1},"LSLxJH7r1FsXi0iP9gMeUg":{"text":"The place was just too dark and the piano was being used as a table that people were sitti","useful":0,"cool":0},"YsSEto1up6gwRAQrfD3XRA":{"text":"Came here last night and loved it! Of course it caught our attention because it is the old","useful":0,"cool":0},"MU7yjKcj7658wIvJ2sy7fw":{"text":"Built around 1761, and supposedly once owned by pirate Jean Lafitte, it is said to be the ","useful":1,"cool":2},"rhV_2xKemXjmiJf9-T2N9A":{"text":"Always crowded since they have a small area, rich in history (especially haunted stories).","useful":0,"cool":0},"By2LRP1UWOGwhSD7oWVa-g":{"text":"A dark and crowded bar that I discovered from a haunted tour of NOLA-how much more tourist","useful":0,"cool":0},"gMQn73muJ9CUDxYksoHFPg":{"text":"Listen Matey this is the bar to go to.\n\nMy favorite bar on Bourban St.!  The first night I","useful":1,"cool":1},"OqUerVknCklyYlBPh6b_fg":{"text":"This bar is a dream come true. Dark, with only candles on the tables.\n\nHang out and take i","useful":1,"cool":0},"wOgy2HTZ_7PY22GchX2gdw":{"text":"This bar can get pretty busy and with the layout it can be difficult to actually get past ","useful":0,"cool":0},"wXiglDh85XvXEl7CuXzgRw":{"text":"This place is kooky and I love it. It doesn't make any sense and I can't get enough.\n\nFirs","useful":1,"cool":1},"sJo0vMJXqKTOKGHU4wFLpw":{"text":"Nice laid back atmosphere in the oldest bar in the US. It is located just off Bourbon whic","useful":1,"cool":0},"PIRm2TwnG21LSawQ_9J6sw":{"text":"So here's the thing about American history...  This is the oldest bar in America, but it w","useful":2,"cool":2},"_vqFQKFm8-UCSYR29yIiSA":{"text":"Good\nBones but\nModern touch\nWent wrong way and\nThat night's crowd was as bad as purple dri","useful":2,"cool":0},"WuXB86WSjSf9f5PTVQQRXw":{"text":"Came to visit on the rec of my best buddy. Hubby and I were not disappointed. The Hurrican","useful":0,"cool":0},"ZkcUhPP96QbSbW2ZnbfXHg":{"text":"Love the hurricanes!  One of the few places I truly like on Bourbon.  Lafitte's is a cool,","useful":0,"cool":0},"MA6NdWc10KEI2e6dlNImyw":{"text":"Great to know that historic places like this still exist! I enjoyed sipping my voo-doo daq","useful":0,"cool":0},"QnmtWJKZM6uuFmkzjyWU8g":{"text":"Pretty cool bar - supposedly the oldest bar in the USA.  \n\nThe first bartendress was nice,","useful":1,"cool":0},"yugfFH7Xjv6pMeYuJcYmmg":{"text":"MY FAVE BAR IN NOLA! Amazing piano man and you MUST TRY their purple drank :) Good vibes a","useful":0,"cool":0},"x9LOK5SMe-qp1g4thltRKg":{"text":"great casual place outside the realm of the usual Quarter craziness - nice places to sit, ","useful":0,"cool":0},"Jxzq_6Z_G2zIg1w-_mAzpg":{"text":"this is probably my favorite bar in bourbon. i say propbably because it depends on what mo","useful":2,"cool":1},"MH2vRRgIXNG2Q6eP76qYjg":{"text":"Cheap for Bourbon Street (only reason I gave it a second star), but it reeks of vomit and ","useful":0,"cool":0},"hYlWRQspsUJYySM0L1Fu0A":{"text":"Tourist trap selling overpriced hurricanes with little to no alcohol.  Saving grace is tha","useful":0,"cool":0},"4R_mABPzBY0vj8Jb7SBW-Q":{"text":"One of the places you have to make it too when you are in NOLA.  Touted as the \"Oldest Bar","useful":0,"cool":1},"fDjugqRpKeeeBwFFTRkhCA":{"text":"The building itself, is awesome.  The history has been mentioned a a thousand times I'm su","useful":3,"cool":2},"B9Tperu3OAhnOndC530WDA":{"text":"WONDERFUL. Best bar in New Orleans. I was amazed by the atmosphere, the spooky feeling mix","useful":0,"cool":0},"k5CfE6u0g33lL3DKPy4G1A":{"text":"went to this bar last week while on a trip to new orleans, because it was so highly rated ","useful":2,"cool":0},"v5T3YuNb2qJaiAJUuzAUpQ":{"text":"At the quite end of Bourbon street, is this quiet little bar.  Ancient building, which is ","useful":0,"cool":0},"AezNWGzzzypU0Le-DLxkCg":{"text":"A must when in New Orleans!! The atmosphere is dark and lit with candles which transports ","useful":0,"cool":0},"7p6a8cXQnDjM2oQjqZY9RQ":{"text":"If you go to New Orleans you must go to Lafitte's.  If only for THE HISTORY!  Pirates dran","useful":1,"cool":0},"_kKM5QBiBK1rqFlDf66OUg":{"text":"Always a critical stop in the French Quarter. If you're here around Christmas - the eggnog","useful":0,"cool":0},"fDoU97kZtYpyLHz_JXA52Q":{"text":"I was excited to try this place. It's historic and supposedly haunted but when we tried to","useful":0,"cool":0},"SdBoZTIZCwTab4clUPOkvQ":{"text":"Great ambience.. server incompetent... never responded to question re live entertainment","useful":0,"cool":0},"SJHyuDzT4dbSH1agGsC_4A":{"text":"This place was really kick ass. This is the oldest bar in the USA and it looks pretty awes","useful":0,"cool":0},"y5IMxZz1EPEQfM0StWt8tQ":{"text":"Def our favorite stop on the haunted bars app we had. Such great history and ambience here","useful":1,"cool":1},"2heQT75lCTEFGhDk0gRoYA":{"text":"This mellow piano bar had a great vibe & ambiance. Service was good and the crowd was live","useful":0,"cool":0},"r6nDRMcafu_00c-OHIGv6Q":{"text":"Cool little bar worth checking out if you are in the area. Their signature drink is the hu","useful":0,"cool":0},"HBDAC3J2CsC2A3agxt166w":{"text":"If you're in the French Quarter at night, go here!!!  Try to call ahead and ask if Michael","useful":0,"cool":0},"alD92Lc9MTmGWZMSW_f6MQ":{"text":"the coolest bar EVER!!!\n\n\nI mean if your a pirate at heart then this place carries some se","useful":0,"cool":0},"iFa53Q-IFSVIybDNJBz5sQ":{"text":"Lafitte's Blacksmith Shop was originally built between 1722 and 1732. It served as a real ","useful":0,"cool":0},"fcLjQnvlyIzVHfiaFESr3A":{"text":"this place looks pretty enticing from the outside.  however, once you go in you you will f","useful":2,"cool":0},"MLZzLLQsFPfdEhD3rZgeXw":{"text":"I think this is probably in my top ten all-time favorite bars.\n\nEveryone I take here feels","useful":3,"cool":1},"dmtPE_aMAX40z7865kpqLQ":{"text":"Had been recommend to me by many and we were pleasantly surprised. It is the oldest bar in","useful":1,"cool":0},"ECBxINX9feqRND9miv4Jig":{"text":"Don't let the Bourbon Street address deter you.  It's located in the back end of the Quart","useful":5,"cool":6},"Ib3TPxKmgPHvtQJODZ1YYQ":{"text":"I guess everyone winds up here once they've heard it's the oldest building to survive some","useful":0,"cool":0},"sRVugK6zFBo9PnMtKz9kMA":{"text":"Absolutely love it! One of the most unique experiences I had in NOLA. A must do while visi","useful":0,"cool":0},"7XUM4piLEOF6NDxDwUeVcw":{"text":"This is easily the coolest spot on Bourbon Street. Why? Because it's way at the end and fa","useful":2,"cool":3},"wrbl9aJ1GcZudw0r7z_hWQ":{"text":"On my flight over on my most recent trip, I overheard a very interesting conversation betw","useful":1,"cool":2},"l2UhxA6FsOVrVaVo5ok8aQ":{"text":"Who knew, after yearly visits to the French Quarter we stumbled upon one of americas oldes","useful":0,"cool":0},"PTf29caR6L2FYlX_FsVe5g":{"text":"My friend and I were in town for Mardi Gras and someone suggested coming here for Fat Tues","useful":0,"cool":0},"Uyn8TtFZbJ3IzcVPbogOEw":{"text":"My FAVORITE BAR in New Orleans.  They have a pianist playing there throughout the week, pl","useful":0,"cool":0},"leqrb1V-0UaW0XjeXkcmWA":{"text":"Yes! This place was awesome. You have to have at least one drink here just to say you dran","useful":0,"cool":0},"d5IAIAagsurhwfePebotfw":{"text":"Purple Drank aka Vodoo Daquiri is what this bar is all\nAbout plus it's the OG dive bar in ","useful":0,"cool":0},"mbKa-gg86tRXEO_rwGb_gQ":{"text":"My husband and I had a beer here in the late afternoon. The local brew was awesome and rea","useful":1,"cool":0},"Zqp9uxe27IDuBGtqJjcSPw":{"text":"Looking for a dark, chilled out dive to hang out in? This is one of the coolest bars on Bo","useful":0,"cool":0},"HIypeMXFKujjsvIWjnHLgw":{"text":"Not your typical Bourbon Street bar. Lafitte's Blacksmith Shop has history, cool decor and","useful":0,"cool":2},"8a41VOiihrARdgvwaQNVlA":{"text":"Built between 1722-1723, it's the oldest structure used as a bar in the US. The original p","useful":0,"cool":0},"XqG5ZbwgbPbjJCPjYnHFdw":{"text":"So what if they served my gin and tonic in a plastic cup? This place was awesome, with a p","useful":0,"cool":0},"oeb3gXfPNBAArsg0i1GG1A":{"text":"My favorite bar in New Orleans!  Historic coolness.","useful":0,"cool":0},"S-RdO9jegSPpIne86lKWsQ":{"text":"Be there by sun-down, sit on the piano in the back, drink some cold Dixie beer and sing al","useful":0,"cool":1},"VBK6b2Qpe15qZ2p81DcI7w":{"text":"Best alcoholic slushi is ever!! Love their purple voodoo! Came here twice in two days just","useful":0,"cool":0},"h5tG8dNKR8Q79wpElFBH9A":{"text":"Off the beaten path, great ambiance, away from the bourbon street mess.","useful":0,"cool":0},"pEQfwe4bzof-gr2ZU87-5g":{"text":"My favorite aspect of Lafitte's is its distance from the main Bourbon strip, and that tiny","useful":0,"cool":0},"W3xrfunm2HVqKPbeA-0jJw":{"text":"The first time I experienced Lafitte's I was handed a \"purple drank\" and fell in love. Now","useful":1,"cool":1},"2bN7jLiwY-d08gBkwfiSdA":{"text":"My favorite bar in NOLA has to be Lafitte's. Lafitte's was named after an infamous pirate ","useful":0,"cool":0},"f3UpkIFTrBKjgs8vNJq_YA":{"text":"Just wasn't as into this place as everyone else.  Maybe have outgrown the dive bar scene. ","useful":0,"cool":0},"tfUyk4NGbXHCpbNJzoBDBg":{"text":"Great place for a NOLA novice to relax and chill from the Bourbon street madness.  Cool hi","useful":0,"cool":0},"Xnjx4BlRRikfTo0TeYm1_g":{"text":"I have been here many times.  It is part of my being in NOLA routine.  It is pretty touris","useful":0,"cool":0},"PUISScsytWI2xOdhrRGSKA":{"text":"Lafitte's Blacksmith Shop is the oldest continuously open bar in the US; originally a blac","useful":4,"cool":3},"n1ZnRkyf09Dq2xstZpFwXg":{"text":"great old building. the people a friendly and the beer is good","useful":0,"cool":1},"nINIa8MHaWtmZGiekAZ0rw":{"text":"nice, charming, old, good atmosphere.\n\nNot  too crowed and good drinks. Not too bright...l","useful":0,"cool":0},"8VdL-Tm4yCkdiHOEOY7osA":{"text":"The pianist literally told someone in front of me they don't change songs for less than $2","useful":0,"cool":0},"RlGyiXK7QNzb9w58EpcPfw":{"text":"This bar has such a neat atmosphere. It's candlelit and away from the craziness of Bourbon","useful":0,"cool":0},"Og4qussZml42EgkVOB5KSA":{"text":"This place has to get 5 stars just for its history! This is the oldest bar in the United S","useful":1,"cool":0},"cpiETMZpzA9a0BM1kuAvAA":{"text":"Get the hurricane here. Music is loud and atmosphere is dark by candlelight. . This is the","useful":1,"cool":1},"yrRNFuCpKv7Je6pNxPpMCw":{"text":"Best hurricanes in New Orleans. They use real fruit juices not sugar fake flavors. The ser","useful":0,"cool":0},"6WDULSXdFKN791ih3uSg4A":{"text":"Very cool to be at the oldest bar in America.  The decor of this place is great.  All of t","useful":0,"cool":0},"SpMGvGnDVdgoZ-9pNEcKVw":{"text":"I had to visit this place after reading reviews and seeing that it is touted as one of the","useful":2,"cool":0},"M-Ay65JuNrHTkcBPJCKSIQ":{"text":"This is my favorite bar in New Orleans. I would give it 5 stars, but the bathrooms need so","useful":0,"cool":0},"QRvX-j_jWOvgdc7SfkMBNQ":{"text":"Holy overhype batman. This place was pretty terrible. For trying to be a creepy all candle","useful":0,"cool":0},"lngHJmH7B3qNZORsuVlDZw":{"text":"This has always been my favorite bar in New Orleans. It's pitch black. Legend says it's th","useful":0,"cool":0},"P8IEAtEeLQ5Wfmph9WI97g":{"text":"Drinking at this bar is a must for any traveler or pub/bar crawler!  I won't bore you with","useful":3,"cool":1},"xJbWPYKpEfG_slxeY2FkzA":{"text":"Very cool bar for the oldest bar in the USA. Great historical place to have a beer or what","useful":0,"cool":0},"PX0HK2xgeIU52oZkWhVhmQ":{"text":"I was really hoping for more out of this place. The history is cool, but they turned it in","useful":0,"cool":0},"PksbiFiPG8H-hryOD8Dj4g":{"text":"So THIS is where everyone under 30's hanging out on Bourbon Street!\n\nA neat bar, reminding","useful":0,"cool":0},"jyXg4S1lOSxWZ9vNv7ojsQ":{"text":"Very cool bar! The piano, interior and candlelight transform the bar experience to an enti","useful":0,"cool":0},"5U69mp6KnLCvl8hCccunAQ":{"text":"This place does have atmosphere. While I thought the drinks we're on the smallish side, th","useful":0,"cool":0},"alPgpS0Tby3vkbKf_dc-QA":{"text":"A great little place for a passing drink.  Makes you feel like you stepped back in time to","useful":0,"cool":0},"d0-O0YVQQBpCZ7VZYB21xQ":{"text":"What more can be said about this place? Great drinks, reasonably priced compared to the re","useful":0,"cool":0},"blZPZ0rdAB7Q8F7diP79rg":{"text":"Piano player kind of a JERK! Here for my birthday and even though he was tipped graciously","useful":0,"cool":0},"ucBQz7no9C9KYdGLUqWkWw":{"text":"I nice little dive bar in a great location. I always enjoy coming here to hang out wither ","useful":0,"cool":0},"0AbegbeFaNj_nfd5WV8vzA":{"text":"I went here over a year ago back before I was an active Yelper so I wanted to go back and ","useful":1,"cool":1},"SPrSJ3k8vaP6iWVO_WwV8w":{"text":"I'll be honest with you - I don't remember a lot of my visit here. \n\nI popped in on a Satu","useful":0,"cool":0},"XohOHtu4GgAAUjqQ0NgtUw":{"text":"just cause I put five stars don't expect the world of this place. It is the perfect dive! ","useful":0,"cool":0},"4IX2Is4ZLQD1oyydHRhlvQ":{"text":"I'm a sucker for New Orleans history, so that may have been the reason I first went to Laf","useful":4,"cool":1},"nttuOlwFdFFch31k8EvH3w":{"text":"I think this is probably a must when visiting New Orleans.\n\nPeople say it's the oldest bar","useful":0,"cool":0},"zaP8EWlDkbmLcqBznY2kAA":{"text":"Ok.. So this place is the oldest bar in America.  Wheres the proof?  This may be true, but","useful":1,"cool":0},"gYuUzsOnN2hsr4STBfSvKQ":{"text":"Old, nice. really cool place to visit. We went there while we were on a Ghost Tour, the gu","useful":0,"cool":0},"bPvt2nJemHWTy5LxxdwlQw":{"text":"As one of the oldest bars in the US of A I would suggest coming here. I don't come here on","useful":0,"cool":0},"njGVKsToWs-XgAp0fBsJZw":{"text":"Definitely go here for the fantastic atmosphere and awesomeness of drinking in the oldest ","useful":0,"cool":0},"dqG5ddynTpYz_pjARRc-Ug":{"text":"This place was a complete let down. It has the history and ambiance but the drinks were ab","useful":0,"cool":0},"ezW555fRTuXlLs43HPbb2A":{"text":"The best hurricane in NOLA. Not too sweet. Perfect! P popular busy spot.","useful":0,"cool":0},"AnI5zUal4fuXNh4YY4-Gjg":{"text":"Claims the spot as the oldest continuously running establishment in New Orleans, stopped h","useful":1,"cool":1},"5UpRi0bLKgZB8VCE4KF5tA":{"text":"Atmosphere is very cool. Depending on where you sit, you can't see your hand in front of y","useful":0,"cool":1},"2Pmq6hJfQkA0i_95lCM-AA":{"text":"The oldest bar ever? Well how about the best Mai tai aside from HawaiiI was very impressed","useful":1,"cool":0},"S2PLdVbxuL-QhPotq0ckzQ":{"text":"Lets just say, I am a sucker for nostalgia. \n\nOld, dark, mysterious candle lit tavern. His","useful":1,"cool":0},"cTgZ4L0SfB3XSBmVyDCbxA":{"text":"Lafitte's saved my 30th birthday.\n\nMy husband and I arrived in the city around noon, check","useful":5,"cool":3},"i3I_xCeIxlGpKrUcC8iTzQ":{"text":"This watering hole is what NOLA is all about. Amazing experience to sit in a bar that is o","useful":0,"cool":0},"XH_6c80BtKVMFZFt8EyCrQ":{"text":"One of the oldest bars in american or even possibly the oldest... how can you not check th","useful":1,"cool":0},"PZx0NPLa2qgYCUNHpnXx8w":{"text":"Excellent place to go. It is on the way to the market. You have to leave the quarter and w","useful":1,"cool":2},"dEuLQOBpwr320gzobh6pyg":{"text":"This place has gone seriously downhill since Johnny Gordon left. (Departed ). Yeah, the at","useful":0,"cool":0},"eQr9Rz08LxbSW7m7c_nPwg":{"text":"I would give it 5 stars but the exterior renovation that took place a few years ago really","useful":0,"cool":0},"I9kix_S5URjgQQqOShw2kA":{"text":"Best Hurricane in the French quarter--all fresh juices (just remember: drink from the bott","useful":0,"cool":0},"kT2_WZbsyvsHX_tRf42-rg":{"text":"A great dive on the east end of Bourbon St. away from all the annoying cover bands and str","useful":1,"cool":0},"Diur4bu3_vVQn5_beg9x6w":{"text":"I didn't even know this existed and neither did my friends. It actually took a friend of a","useful":0,"cool":1},"P2yX7wx3vJ-r5hxqDZG7cQ":{"text":"I was directed to join my friend at this bar when I was in New Orleans a few weeks ago for","useful":0,"cool":0},"rpakYY27S_WrYxt-Haz8wg":{"text":"Loved the candles, it exudes a charm. However, because of the lack of light and the fact t","useful":0,"cool":0},"1ZQJM0u1Hph_qEw0vRQuuQ":{"text":"The oldest bar in the United States and used to be owned by a Pirate named Jean Lafitte???","useful":2,"cool":2},"Co-KdLoZgfMemP7Fnvmk5Q":{"text":"Not a huge fan. Yes if you're a super tourist and have never been to NOLA this place would","useful":0,"cool":0},"JSlPqAbT-u1BKFqMWBDC1w":{"text":"We asked the bartender to give us her best drink and she gave us hurricanes. Not a fan of ","useful":2,"cool":2},"1ebZPRb82rsVUgXC4Us03A":{"text":"Awesome! This historic bar had all the creaks and scents of a old place. It is alot of fun","useful":0,"cool":0},"bY0CArvWCU8dAVYbkUT4Aw":{"text":"There has to be a reason why it's the oldest bar in America.  Cause it's a great bar atmos","useful":1,"cool":0},"HaqxKZyZevKcpFUwFAif6w":{"text":"This was my absolute favorite place in New Orleans, and my #1 favorite bar anywhere. \n\nThe","useful":4,"cool":3},"xLfCCooohFhPMs4VlFdFzw":{"text":"Dark and mysterious, makesyou wonder what kind of men drank and maybe even died in some ba","useful":0,"cool":1},"wOnjpR5RrJ9xmSuVBOefEg":{"text":"100th review!! Wheew!  I have been here at least 100 times, make sure to go to the piano p","useful":0,"cool":0},"Ba04T4FOPoc7wfSZF18wFw":{"text":"Cool place. Great vibe, with the feeling that they do only candlelight. Only in for drinks","useful":0,"cool":0},"EY3HB5oif8ABilGJj1A7tw":{"text":"A must if you are in the quarter! One of the coolest spots on the city, in the country! It","useful":0,"cool":0},"oVIUvb2KpjcWoAKS32ls8w":{"text":"Such an awesome place! Would love to come back here during the day so I could see it prope","useful":0,"cool":0},"ArDpqaPIpmr8eYH7DLj0vQ":{"text":"I'm sure you've heard the constant droning on any other Yelper's review: \"Oldest bar in Am","useful":1,"cool":2},"5SyHqnvjR61SIklXWwfnug":{"text":"Worst experience in New Orleans... I'm a bartender and the idiots working there are costin","useful":0,"cool":0},"9xBte4XrKEQMHIg2Ww3sSA":{"text":"Stopped in for a hurricane on a gorgeous night last week. I'm a history buff and have want","useful":0,"cool":0},"Gp92O0PCa9n76l0oZhlrvg":{"text":"Meh atmosphere during the day. Overpriced beer. Not good service. Enjoy the history, but n","useful":0,"cool":0},"DCt2Kqk4qvVi4c9rbSSnPg":{"text":"Complete desecration of a historical landmark. Juke box blaring, photo booth in the corner","useful":0,"cool":0},"SvirG0PnMLsUO5zXOno7Mw":{"text":"Excellent bar to visit while you are in New Orleans. Nice beer/drink selection, friendly s","useful":0,"cool":0},"VimOx5cFXJVfFQwi870GRw":{"text":"This place is very neat! You get away from the constant (though fun) noise and insanity fu","useful":0,"cool":0},"1shjUzEU_FTZirrOqMi_Bw":{"text":"A must stop among the NOLA bars, if not for the historical context but just in case you se","useful":2,"cool":2},"b6coEfHmxbjnPoNWp5Y9zw":{"text":"Interesting, dark place, with good drinks and great company.  Glad I checked this one off ","useful":0,"cool":0},"EZ44jemHBrs8vqEjshIz-A":{"text":"Love this bar when in NOLA, the ambience is amazing the people and them drinks always do t","useful":0,"cool":0},"yZksz1C6yin5Gl9b5THdxg":{"text":"I went to a PIRATE BAR!\nThe history/vibe of this place is magic. Can't say I'll warm up to","useful":1,"cool":0},"tazwH74vd8oLgLtA-rbD6g":{"text":"Amazing place! Entire bar lit by candles and a really wonderful atmosphere. Cheap drinks, ","useful":0,"cool":0},"VEfQlyGhuZVBjIBiu3qJUg":{"text":"This review is a bit limited, as we literally walked in, looked around, and walked out. Th","useful":5,"cool":0},"o9avz7SnWvGSdulii0ySiA":{"text":"This is a must go place. The piano bar was super cool and it was almost pitch black in the","useful":0,"cool":0},"uedgyaL_gKSPwZzD-gyPUQ":{"text":"Love the look of this place, cute little bar from a bygone era.  \n\nWe hadn't ordered any o","useful":2,"cool":1},"h5qn9k57GwYMaldo2lKM2A":{"text":"One of the oldest bars in America! You can see the history in the brick. A must stop if vi","useful":0,"cool":0},"sclXKQt7mkq359YVcsOtHg":{"text":"This bar haunts me in my dreams. No visit to NOLA is complete without stopping here. This ","useful":0,"cool":0},"az7fCsOWzAk6Qs3pZA9t3Q":{"text":"We stopped by here during one of our tours (\"Ghost Tour\") and this place is awesome. It's ","useful":0,"cool":0},"10re28TewLkscRrk2TihIQ":{"text":"Great hangout spot. Cold beer and frozen drinks. Out side patio was a fun place to chill.","useful":0,"cool":0},"dgc-sMcTxKKDsXOe1pNmKg":{"text":"Really cool, historical, intimate bar.  It's lit by candlelight!  There's live music, and ","useful":0,"cool":1},"rO6QsPOaXyGvnUdEOinMuQ":{"text":"A lot of fun. Great service - the \"mule\" we got tasted awful and they brought something el","useful":0,"cool":0},"r5zdMYjoNE0Jaz2S5IB9zg":{"text":"You gotta check this place out.  It is so cool!  There are so many great places in the Fre","useful":2,"cool":0},"fcKyrlOUAGaTLKFqSvY_0A":{"text":"Smokey dive that claims to be the oldest bar in America.  Great old school vibe.  STRONG H","useful":0,"cool":0},"80e_6EWPvg5R2G3vTtGaiw":{"text":"This is classic New Orleans. It is dimly lit and has a piano that doubles as a bar in the ","useful":0,"cool":0},"fl5ikYqi4n73MOvhOauc-Q":{"text":"As everyone else has mentioned, Lafitte's is the oldest bar in America.  I can admit that ","useful":2,"cool":2},"NY5t-d11bZ0QHbey9Y6akQ":{"text":"5 stars for the vibes but TBH I was not a huge fan of the Voodoo Daquiri everyone speaks o","useful":1,"cool":1},"n9jeqDwaFFXGRPzPPR9AlQ":{"text":"Nice spot on Bourbon! It isn't smacked in the middle of all the tourist traffic, but this ","useful":2,"cool":4},"4G2YSEGsHyfojpFnI97TTg":{"text":"Excellent atmosphere. Great, engaging bartender. Busy, but received service immediately. T","useful":0,"cool":0},"8q9A-dQPu3DlegEXVSfxaw":{"text":"Aside from it being one of the oldest establishments in New Orleans, I was not impressed. ","useful":0,"cool":0},"_R8DHWH3sDMv0hcLA9Hljg":{"text":"Awesome place to lift a pint and meet friends. This rustic candle lit establishment is a s","useful":0,"cool":0},"dyQwFkfJSI6b90Mve5aXsw":{"text":"Having a drink at Lafitte's forces you to feel the several hundred years of history.  The ","useful":4,"cool":4},"-4QO2ZtilzdAc1wWWv5mMg":{"text":"This is a great bar that is on Bourbon Street, but also not quite on Bourbon Street. It ha","useful":2,"cool":2},"WBMtLj40c8nBvh3fCsEF4A":{"text":"No drink on bourbon street is better than the purple drink.  Don't miss the oldest continu","useful":0,"cool":0},"XXvEfsGdBi1OICx2P1RJpQ":{"text":"Still a cool vibe BUT literally the best and only eggnog daiquiri I have ever tried! Went ","useful":1,"cool":0},"6e0FHBFJmC4PAJVt8rEDiQ":{"text":"We were told to come check this place out, and hearing that it was one of the oldest bars ","useful":0,"cool":1},"r5Du90oPriTY0f0usyR6DA":{"text":"My boss and I were in New Orleans for a conference and stopped at Lafitte's as part of our","useful":0,"cool":0},"ew7Vv7ztBH4JP-hhXfFvhA":{"text":"Question: If person A is waiting to be served before persons B,C,D, and E but is ignored b","useful":1,"cool":0},"EcecxIOsDo5xdKM120HkZg":{"text":"The wait staff was extremely rude after throwing away our car keys by mistake... don't exp","useful":0,"cool":0},"FLVzFHZQbffCBSu9uwxHVg":{"text":"Worst customer service!! \nWanted to buy a shirt and the waitress put us off saying they wo","useful":0,"cool":0},"X6Mm0fX8fcd70WlcpefWXg":{"text":"Love this old bar. Feel like I got a piece of history. It has an indoor area and outdoor. ","useful":0,"cool":0},"NKnaU-pjumlzvsOkiZuotg":{"text":"I get that this bar is so old however to me not worth visiting. The bar is a big tourist t","useful":1,"cool":1},"5P9Q1ang_VSKQCHRbiJ02A":{"text":"What a cool place.  The oldest bar in New Orleans.  I highly recommend the Voodoo drinks. ","useful":0,"cool":0},"6UAQRYHcrljcZ8_yJTBKbw":{"text":"this is a fun spot...but the server ( who I had to go find after 20 minutes for my change ","useful":0,"cool":0},"a1SsKvh5I2VsSiVrJ-Xgpg":{"text":"Love this place! What a legend. Definitely haunted, we caught a couple videos of Orbs here","useful":0,"cool":0},"ZURSRDYvwxuuv0JqF2hHmw":{"text":"One of the oldest and one of my favorite bars in the Quarter.  It's generally populated mo","useful":1,"cool":0},"F2ov5QzHWOE6MUyMjI6JkA":{"text":"I can't believe that this place is on Bourbon Street.  I also can't believe that I'd never","useful":1,"cool":1},"WnxFBQ69mV_I34TnjKk-cg":{"text":"To get here, you have to travel a bit further out from the more lit areas of the French Qu","useful":3,"cool":2},"LhPCCXQjvrtlGe8XX5Qefg":{"text":"The concept in this bar is very cool. We stopped in on our last night for a cocktail, and ","useful":2,"cool":0},"j2AP1DKp-bUdHpQsC9X-jg":{"text":"This is a cool spot to soak in the history and get away from the madness that is Bourbon S","useful":2,"cool":4},"u_CUSqSUR0E6tUWejIhPNA":{"text":"Lafitte's is a great dive to get a couple pints while in New Orleans.  We were her in Dece","useful":0,"cool":0},"JPGbu2EqVj3a5NMNOuvhsA":{"text":"Best neighborhood bar, great old music selection, best frozen egg nog daqauris\nDuring holi","useful":0,"cool":1},"WVcgMm18qj3PhtwrbxRKsg":{"text":"My how times have changed. When I was just about 18, we dropped into Lafitte's. My dad lov","useful":12,"cool":8},"QNrl-2D-trZYdK1SHpJq7w":{"text":"I love this little bar. If I'm going to Bourbon, at least this place is far enough away fr","useful":2,"cool":3},"TlY9uuV_VJelyyw9xOradg":{"text":"I normally love visiting this bar when I come to New Orleans, but last night left my 7 fri","useful":2,"cool":0},"KHM2htXIW8zwb_qDH4rwYQ":{"text":"Mmmm, no thanks.  We must be too geriatric.  Who told us to stop here....oh, a random coup","useful":1,"cool":0},"M14-mt9YKG3I4DsNp0yfBA":{"text":"We loved this historic site during the day, though we didn't venture down to the bar at ni","useful":1,"cool":0},"Fq2LgRnlRZ13jumzq13tRg":{"text":"Lafitte's is cool to have a drink, just for the history. The building hasn't changed much ","useful":1,"cool":1},"QfwQGX5x-gyGSP4GZQ3Yog":{"text":"Absolutely love this place. Not only is this the oldest bar around, it is probably my favo","useful":5,"cool":3},"92vRY9bRivPeKoH_LzIJiw":{"text":"Purple driiink, purple driink. Yes, we had to get the frozen purple drink for an out of to","useful":3,"cool":1},"oyoTU6YT1imXwmaVmBbjmg":{"text":"This is the oldest bar in America, which is immediately cool. But my Voodoo Daquiri tasted","useful":0,"cool":0},"7k935v_XfnA3Pst6t53bEQ":{"text":"This is actually a pretty cool bar to visit when you are in Nola. It claims to be the olde","useful":1,"cool":0},"OZEMx1l5xEfhA123NVKIvg":{"text":"This is a hidden gem we found as we strolled and discovered parts of the French Quarter we","useful":0,"cool":0},"4Io730yp7hCv7Yl8u1q0oQ":{"text":"My friend went to college in Louisiana.  She knows what's up in terms of where to go in Ne","useful":4,"cool":5},"CcIV-ay8j7mBTlFKy9Da8Q":{"text":"Dayam it took forever to get a drink.  Thankfully the crowd was cool, and there were some ","useful":9,"cool":3},"32Y5bYss1j61c-orcZzZXA":{"text":"Lafittes was one of the stops in our Ghost Tour! It was a cool experience grabbing a beer ","useful":0,"cool":0},"KScrYVdgYi8_K0PG7LX2vA":{"text":"Very charming and a historic location. Had a great time sitting in the 300 year old buildi","useful":0,"cool":0},"DSH6T4HJ5Ceyzu03MRDeKg":{"text":"A historic old building, candles and a piano player singing \"The night they drove old Dixi","useful":0,"cool":0},"RKBeSH-wrdZ4HEYVBoZljA":{"text":"\"It's more fun when you party like it's 1771\"\n\n locals claim  it to be the oldest continua","useful":3,"cool":3},"Gizj-xsc0ds9tuAIM7IIHw":{"text":"This is my favorite bar. Period.  On weeknights, you can sit, chat and enjoy the decor and","useful":3,"cool":2},"82Yq52fAYTJ-Bx4RlP0zZg":{"text":"Oh to have a drink in the oldest bar in America (built between 1722-1732). I'm not kidding","useful":0,"cool":1},"_ZMWEE5Bycg39K2uQOovlg":{"text":"Fun bar to have a drink at & maybe a nice cigar. We did both. How many people can say they","useful":0,"cool":0},"jbhQeSU1lWxbNC_Pw1VlgA":{"text":"Yes the piano bar is the best, great drinks and atmosphere we always come back when come t","useful":0,"cool":0},"T2JXEumCh3C9G9UdE5--1Q":{"text":"It's pretty cool that this is one of (if not the) oldest bar in the US. Who doesn't like a","useful":1,"cool":1},"d32ImQFhl6FNTsEhuuP56A":{"text":"When you want to sit back and get away from the bootypop music on Bourbon for a relaxing d","useful":2,"cool":1},"HogoKr1iJ_vyiZoslj3QGA":{"text":"Very cool atmosphere and the hurricanes are exactly what they need to do  Perfectly balanc","useful":0,"cool":0},"8bwwS56V4JuRz9BV-UG2nw":{"text":"08/09/2011 - 09:30 pm\n\nOff the beaten path away from the hustle & bustle of Bourbon st res","useful":4,"cool":3},"gW7F6Ru8WKa91fqoRcyhoA":{"text":"Two sips into my purple drank I thought this tastes like cough syrup, halfway into the cup","useful":1,"cool":0},"6hSNrTv0VV6RcuQgA79kGQ":{"text":"One of my favorite places to go. Love the gas light and fireplace. Nice to have a drink an","useful":0,"cool":0},"OKddou9NmKDFoEKu9Hzd4A":{"text":"The first time I tried to go here a few years ago it was so crowded I just turned around. ","useful":0,"cool":0},"uMgRHUrEd3XeI_BzT6zW2g":{"text":"Pretty good. Being from the northeast, I laughed that they call themselves \"the oldest bar","useful":0,"cool":0},"Cg3XkCNN9GMxLuFlUKk7qQ":{"text":"Too Busy \n\nThis is the kinda place where you go to have a drink just to say you've been th","useful":4,"cool":0},"lZs0YU0YAuKpNYxsb3BZCA":{"text":"If you are looking for a legit taste of New Orleans you must go here. A super fun piano ba","useful":0,"cool":0},"f_cgGd5VyUXdTS_CbPxIsA":{"text":"Advertised as the oldest bar in NOLA. This weekend we saw no candles and music was run by ","useful":0,"cool":0},"O591ewBTlrvGxMT0Bt5Fzw":{"text":"I was amped to try this place! As a history teacher, I was looking forward to this place! ","useful":1,"cool":2},"i7OGg6i1YmM1fHmW4OnMOA":{"text":"Cool building and history but a pretty average bar with high prices. Don't expect them to ","useful":0,"cool":0},"fUkAJ1wXHrE7d7ZuXAsnAw":{"text":"Delicious hurricanes!\n\nOur tour guide recommended this bar to us as having one of the best","useful":0,"cool":2},"7UoD5MbhA-_WRKd4qvqXFA":{"text":"Best neighborhood bar, great old music selection, best frozen egg nog daqauris\nDuring holi","useful":0,"cool":0},"kRSuSQtYHtwGAP0I8MJ6BA":{"text":"Everyone is going to tell you to do certain things in New Orleans. You should ignore most ","useful":4,"cool":2},"IuoBAFcnAwkjBvFsxNOJ-g":{"text":"Great bar! Awesome time. Plenty of drinks. They have a dark atmosphere which I love. One o","useful":1,"cool":0},"dWJVzj1i-WN-YJ5-a5BsGQ":{"text":"Really nice bar in a historic building. Definitely not dive bar prices. It's a real fun ch","useful":0,"cool":0},"JqZn2icgLhZwcBnoxU3mJg":{"text":"Probably the coolest bar I've ever been to. This place has literally been around forever, ","useful":0,"cool":0},"Nl_weVZvDTHmMZm0bm736A":{"text":"Amazing. Felt like we were back in time. The history of this place makes it so special. We","useful":0,"cool":0},"_NASTZUcfRzDUFBQdzKayw":{"text":"Getting to the blacksmith shop was quite a journey since it was located relatively far awa","useful":1,"cool":0},"THFjvwqAddOeQgUnsV7Ftw":{"text":"So cool.  I can feel the history.  Really neat place.  I had a hurricane and it was gooooo","useful":0,"cool":0},"scbXrvP83k0gAwpMS1IgqA":{"text":"After several drinks at the Alibi, I ask the bartender where I need to go and what I need ","useful":4,"cool":3},"qp9wmCWrvwrkHEzG8BKOGw":{"text":"Apparently this is on of oldest bars in the country so of course we had to check it out. W","useful":1,"cool":2},"Ov6xbPNX4pTVaL4fm0UUtw":{"text":"It was late. it was dark. it was kinda empty-ish. it was allll the way down bourbon street","useful":6,"cool":4},"onRTblbqPQlA_bWcyUc_4w":{"text":"Really good hurricanes! Much better than at Pat O'Brien's! It was a bit loud inside for my","useful":2,"cool":3},"NF0VwGAnLF48znHfnTHjiw":{"text":"Always nice to grab a drink in a historic location. Nice hurricane. Wood and stone, dark a","useful":0,"cool":0},"Sa_L6QJq9MqIkf4DJbFlTg":{"text":"Classic New Orleans bar that is a must go to. Atmosphere is dark and that adds to the appe","useful":0,"cool":0},"qKd0FeT_X5qbTBCNIxKzaw":{"text":"Very cool atmosphere and the hurricanes are exactly what they need to do  Perfectly balanc","useful":0,"cool":0},"9eDhMZ-yXPaAYx2ucbnRXw":{"text":"This is always a welcome stop in New Orleans and especially after a tour when your midway ","useful":6,"cool":6},"IBwEay1Lp53zbo50C2AWhA":{"text":"Really fun. Drunk meal at Clover Grill lol then to Lafitte's for a cocktail. Place was pac","useful":0,"cool":0},"mbFRy9oaIofHoyiZ2jyQKA":{"text":"Great little bar! It's the oldest bar in the US and we got to enjoy it and have the purple","useful":1,"cool":0},"eWyuJdvKpSvo5q_lhWu4wA":{"text":"Four stars mostly b/c it's exactly what I expected... Was doing a spooky NOLA tour and had","useful":0,"cool":2},"qk_eYWhk3AVqp5ug6MvFlw":{"text":"Touristy but a must see.  It's the oldest bar according to our horse and buggy driver.  Th","useful":0,"cool":0},"J4h2OknOAUfaSHVRzb-muw":{"text":"I was torn with this review. On the one hand, this ancient place, which claims it is the o","useful":6,"cool":1},"Qz6xMlo5w-g61wgx1QPQ9A":{"text":"It is one of the oldest buildings that was a blacksmith in the NOLA and it was refurbished","useful":2,"cool":4},"2eZhhySjQ7zb3qPiiYPG2g":{"text":"What can I say about ol' Lafitte's? It's haunting in it's romanticism, yet heavy with the ","useful":4,"cool":2},"iBBDeA-F8T4pOs2bfPapvQ":{"text":"Cool bar built in the 1720s then converted to a tavern in 1770s. Bartenders super sweet. G","useful":0,"cool":1},"TdKJwMK-L0FcmZTwuCAqbg":{"text":"When I come to NOLA I typically avoid Bourbon St, but this place is my one exception. The ","useful":1,"cool":0},"mi233FYGyyHEVkp493NRBQ":{"text":"Enjoyed our stay here! Very friendly staff! Tiffany at the bar was very warm and accommoda","useful":0,"cool":0},"DQGRnaUp3CqGIzUg-z5l8Q":{"text":"This place was recommended by many. It is in a great location, and you can feel the histor","useful":0,"cool":0},"gd9NfFV37CHIgsxm_SGY8Q":{"text":"Three stars for the history of this place. It's pretty cool to be able to have a drink in ","useful":6,"cool":5},"Eu33jjsVGbW3ZunxrHRL4w":{"text":"If you were already on Bourbon Street and wanting to experience a little bit of history wh","useful":5,"cool":2},"CA3NYiR2ZyKbarpSuCyfQQ":{"text":"I heard rave reviews about the oldest bar in US. It had a very good ambience. Cant dispute","useful":0,"cool":0},"eGcTbLuZDJ3AlSExZ0AP6A":{"text":"Really enjoyed Lafitte's.  Even though it's toward the end of Bourbon's main drag I'd tend","useful":0,"cool":0},"b0TwcoHCm73Ut2f0ewvdAQ":{"text":"It's OK, not great, not bad, will I go back, probably not.  The rum was not a fan favorite","useful":0,"cool":0},"oqH99c6tqvqXRLNlLaNQzQ":{"text":"Had a freaking BLAST here!  Dark, candlelight piano bar with really good hurricanes and ve","useful":1,"cool":1},"1xDRJgRdQ0wTsTHzp7DS4Q":{"text":"Perfect little hideaway towards the end of Bourbon St. Dimly lit and small but worth the w","useful":0,"cool":0},"lZmV10kSo5GKjOwBREeeNQ":{"text":"10 years ago this was a great quiet little piano bar that was my favorite place to visit w","useful":2,"cool":0},"N909rmODgVyFKHKRuPowOw":{"text":"One of my favorite bars in NOLA.. especially the history that goes along with the building","useful":0,"cool":0},"AzQQ0iBRmvDlZCeLiJ7XzA":{"text":"I have been coming here for years and tonight, I wanted a quick drink. The bartender worki","useful":0,"cool":0},"ML1WMf0v-hfvaSR6hv0mZQ":{"text":"Fun atmosphere and really interesting building inside and out. Was absolutely packed but q","useful":0,"cool":0},"32Q0zLKOTZYJDJdXehe9Ug":{"text":"hand made hurricane is all i have to say. no pre mixed stuffed like the other famous spot.","useful":0,"cool":0},"JWoXEPoTB9lJ3IOOhScpWw":{"text":"I loved this place! It definitely represented itself well as the oldest bar in the USA! I ","useful":0,"cool":0},"4QwmGEgi2y-KenMJ5QI82g":{"text":"I cannot speak for the cleanliness of this restroom.  Not even sure one exists. \nWe absolu","useful":0,"cool":0},"vwjIl-35lXGNYvGFcz-ABA":{"text":"Just a few phrases to summarize this place:\n\nOldest bar in the US (apparently)\nA bit of a ","useful":1,"cool":1},"qqVhL5nASzi93HthvD3vTA":{"text":"We did a late night ghost tour of the French quarter and then found ourselves at Lafittes ","useful":0,"cool":0},"bjtoAnDhohojbXwIDHDp7Q":{"text":"This place is an overpriced dump, but good grief, I'd give anything to be there right now.","useful":0,"cool":4},"Gm6cUrFbE0lZflTv9ZRKfQ":{"text":"I love how old this place is and how rich in history the settings are. It is a one of a ki","useful":0,"cool":0},"n8J1vqm7PZN-KEPbYxlbbQ":{"text":"If you're looking for history and drinks, then this is the place.  They story behind this ","useful":0,"cool":0},"m7Z1LIp_7AuPbOUTz1eJgg":{"text":"I really like this place in the evening.  \nAt night the bartenders are attentive and frien","useful":2,"cool":0},"d6TwPB7_UaHlapX47noDNQ":{"text":"The highlight of my whole New Orleans trip. Sitting in a dark dark bar, on a stool given t","useful":2,"cool":3},"tjpkoEopPOko-RCb9mJOAg":{"text":"Bar tender with glasses is very disrespectful. He basically took 20$ tip and never came ba","useful":0,"cool":0},"GSCNWLJQNJ0uezpScW_4Ew":{"text":"Love the atmosphere with the piano and bar. The voodoo and hurricane drinks were fantastic","useful":0,"cool":0},"nwBsirRXD0A7Maf3rDQRoA":{"text":"A bit overrated l, but pretty cool to see such an old bar.  All of the draft beers were br","useful":0,"cool":0},"56hitD9zSE59DGXylERjCQ":{"text":"We loved this place! On bourbon street but away from a lot of the chaos and the drinks and","useful":0,"cool":0},"gkgcKfbSgsQVZ7dQOhKuiQ":{"text":"My favorite bar in the French quarters if not the country! Great staff, good drinks & the ","useful":0,"cool":0},"uuAUmOWioT4H94JG7mwgmA":{"text":"This is the oldest bar in America.  It was actually here before America became a country a","useful":0,"cool":1},"8S6sElGml8hg3ztd5ne-PA":{"text":"Told them I'm from nyc and want to try their special drinks. Got a hurricane here for 8 bu","useful":0,"cool":0},"tGgaJ6n1vSg7L01EUB8pNg":{"text":"The history alone at this place is phenomenal. Also THE BEST HURRICANE IN NOLA. A lot of p","useful":2,"cool":1},"xwP_CfmjDbb7LFDh0tFXlA":{"text":"The only bar in the quarter without interior lighting. They have gas bulbs for lighting. I","useful":0,"cool":0},"L0oFHXqxa5eMvhdu6DZCbQ":{"text":"Dudes and wenches, this place is so cool. If you are looking to get away from the \"tourist","useful":1,"cool":2},"qdo7NSe2E5jL383wpyCM8Q":{"text":"It's the oldest bar in the country. Casual atmosphere with open French doors to street on ","useful":0,"cool":0},"I__FJBN12pNWXQoptSuurA":{"text":"My favorite bar on bourbon street. Really unique. Really old. Really authentic. Tip the pi","useful":1,"cool":1},"t7DdD8Y6uOzrd4CVoUaH_Q":{"text":"Awesome bar, awesome vibe and friendly people.  This is an incredibly historic site, so yo","useful":4,"cool":2},"J9UrUG1NSdQlg7gMgpI72w":{"text":"Small drinks. Dark and gloomy inside. Nice fireplace, although it said no standing by it. ","useful":0,"cool":0},"CwRryt-6aYcuGoQzK0Tdvg":{"text":"This was a great place to come in during the mardi gras season! The music by the dj was gr","useful":0,"cool":0},"V58hAiojF4ocIA1Qhxzv2Q":{"text":"Stays busy but it's a must to visit while in town! We went in the afternoon on a Sunday an","useful":1,"cool":1},"IKKG5WhyGYWUvY7kFILozw":{"text":"I'm going to tell you my story of LaFitte's, and you're probably not going to believe me. ","useful":3,"cool":3},"7tCH0rRGi_NWU3cvOL7xyg":{"text":"I'm not a huge bar person, but we felt the need to come to a historic bar. \n\nIt's dimly li","useful":1,"cool":0},"ass4Y2jKtHm88QCZLFau9g":{"text":"The building itself is really nice though it's uber dark inside (dark enough that someone ","useful":0,"cool":0},"AQSEavnQm1S5gpIx0hISXw":{"text":"We absolutely LOVED this place! Small, old quaint although a bit crowded, the drinks were ","useful":0,"cool":0},"G3th_hQeb4gp8TVx-TNsiw":{"text":"Great place!! Very quick service and easy to get along with. It's pretty much at the end o","useful":0,"cool":0},"fadoLshGUodfE0im4LFAKA":{"text":"If you like history and you love Pirates; this is the place for you!! \n\nThe history geek i","useful":1,"cool":0},"u9Ipewp0S9w7RRxbD5YLIQ":{"text":"We enjoy the live paino music in the events and the drinks are refreshing especially on a ","useful":1,"cool":0},"ZzFACMR7X6jzeYCDHzwlSQ":{"text":"We came we saw... it's dark as fuck but you can't not love the old world feel. Bartenders ","useful":0,"cool":0},"8A4YA2rdbqMUgKkUjkoQDA":{"text":"I was lucky enough to make it here at night and during the day and both times it was a ton","useful":0,"cool":0},"zgiSd_dATuMyTxuQjewq0w":{"text":"If you're looking for the ultimate dive bar, you're in luck! This is one of the country's ","useful":1,"cool":0},"yHeXaYxno8AnQMuHPBe0BQ":{"text":"Great atmosphere with decent bar service.  Not as touristy as you might expect, given the ","useful":3,"cool":1},"Fd808oH4MaitDwUGTaWupg":{"text":"Came in around 10pm on a weeknight and it was pretty packed.. my friends and I snagged the","useful":2,"cool":1},"TLpros5R3B1cG1D1h7Jvlw":{"text":"Old world bar lit with candles. We got a very nostalgic feeling walking into the bar and g","useful":0,"cool":0},"MfMOOaW67rUVIyuTG-dqaw":{"text":"This place was so cool! We got introduced to it during a haunted pub crawl and got to go a","useful":0,"cool":0},"3-R3lymTi-UK8pqnMlgcMg":{"text":"A must if you are in New Orleans! \n\nFact: Lafitte's is the oldest bar continuous bar in th","useful":6,"cool":2},"P5kKMmxLgQD6SMNwBpDBVg":{"text":"I REALLY liked this little place. Very cool ambiance. Regardless of what your drink of cho","useful":0,"cool":0},"WJl_pgzC9owQnnTGKY9NmQ":{"text":"I'm giving 4 because the owner allows people to play music on the juke box when they have ","useful":0,"cool":0},"Kjd_qmcNcEpMBM_4yH0n5w":{"text":"This is one of a few places I visit every time I'm in New Orleans. The building itself is ","useful":0,"cool":1},"h5jlD-JHDNhLO-ExqzzF6w":{"text":"The blonde bartender was extremely rude and made my girlfriend cry. Very negative vibes, r","useful":0,"cool":0},"Na1nfcAXlNcmjwlVpzZDFg":{"text":"A stop on our late night haunted places tour; the main bar was packed but seemed a lot of ","useful":0,"cool":0},"GzhonX4BmFUN1040h5yIUw":{"text":"Frankly disappointed...we returned specifically to hear a well playIing blonde piano playe","useful":0,"cool":0},"gMkwjtKru94mEaiCkOp50g":{"text":"We walked down Bourbon from Canal to find this gem of a recommendation.  It wasn't until 2","useful":0,"cool":1},"pPheW4Jb-zZoyCSPaw2_zg":{"text":"Ambiance replicates a blacksmith shop which is super cool. It's very dark so they have cut","useful":0,"cool":0},"Qv2yCmf1zEckNOnutrkEXw":{"text":"This place has been on my list to visit for quite some time ,and thankfully I was with som","useful":5,"cool":3},"aLn9P-_-J_CkeET0GGrJcQ":{"text":"Definitely one of those \"to do list\" places! I love the history of Jean & Pierre Lafitte a","useful":1,"cool":1},"U7V37sy6KLyzVEq4sZ02bQ":{"text":"Came here as a tourist thing. \"oldest operating bar\". I got the voodoo daiquiri which was ","useful":0,"cool":0},"3QRUkrLMKFBK4BOint2r-g":{"text":"We stopped a couple times at this bar during our stay in New Orleans. Bartenders were alwa","useful":1,"cool":1},"MwB7Q8R92ImRUSEJ40wybg":{"text":"Yes, we all now probably know the history of this place.  That alone is reason enough to v","useful":0,"cool":0},"a5d8V4IfEYeHOiKTyr3o7Q":{"text":"We visited this bar during the Haunted History tour we went on.. The bar has plenty of his","useful":0,"cool":0},"gWvqbPEPlLrjEF6zY6gBBA":{"text":"Oldest bar in the United States- how can you go wrong?  Drinks flowing, ambiance and worth","useful":0,"cool":0},"zWFx7ntrM3_QTcCqhXMdig":{"text":"Well who wouldn't want to share a drink in such an awesome place. You could almost feel th","useful":0,"cool":0},"5FKYstomzaeoviAvyF-i0A":{"text":"Highly recommend coming here. It was one of my favorite stops in New Orleans. I felt like ","useful":1,"cool":1},"e63qzEY6YcM_GbegxdCkzQ":{"text":"Enjoyed our stop here. Drinks outside & a tour group stopped by. Listened to the history o","useful":0,"cool":0},"rGDmHYTMpMLm4r4p6gdPMw":{"text":"This place does not serve free tap water. Not sure if that's legal but even if it is it's ","useful":2,"cool":1},"HIv3eye-O2LliVV3X06LdQ":{"text":"This is supposed to be the oldest structure used as a bar in America, so we had to see wha","useful":3,"cool":1},"uUVku3KTNVjZkK2cLvt9XQ":{"text":"I have updated the review because the last time we decided to go back in Lafitte's the pia","useful":0,"cool":0},"GpilkPUcwviyIO0VeQUZ0Q":{"text":"Honestly, I expected better. I get to a historic bar and I'm greeted by a blonde bimbo in ","useful":0,"cool":0},"vV8Ay_tuFY1N7C0YU-AhbA":{"text":"I am sure this is better during the day...but trying to find your way in here at night is ","useful":1,"cool":1},"HTxTTrcrRfeZ4hzQFBEDbw":{"text":"Some of the best times I've ever had in the quarter have happened at Lafitte's. It's a lit","useful":0,"cool":0},"UGLa7wiujQ-GmkGL42nqgg":{"text":"Super fun, one amazing spot. A must check out. Love it here, live music and piano bar was ","useful":0,"cool":0},"hV8D1EnlogbzYq0Vhct8Yg":{"text":"Crowded, divey piano bar. But great service and good cocktails. And of course, it's in one","useful":0,"cool":0},"1N-NJAI-sBbpFyChKbrqHg":{"text":"This is such an interesting bar. We enjoyed our time sitting and enjoyed the history. Love","useful":0,"cool":0},"aStV2EOefTdPsUZXtCKzLw":{"text":"Perfect spot towards to end (or beginning) of Bourbon street. Nice patio in the back and s","useful":0,"cool":0},"2eNtpmXkOadhCXgsEghF9A":{"text":"I'll keep this review simple, as the other 1300+ reviewers have said it all. Do yourself a","useful":8,"cool":10},"mdhFzV2lc4_kV3u86PwPlg":{"text":"We stopped in when I heard it was the oldest bar in NO. It was a really cool little bar. W","useful":0,"cool":0},"eicz5feETNRy3bxmwrzPYQ":{"text":"This bar is the coolest on Bourbon street. There is so much history in the place which mak","useful":0,"cool":0},"ZHPywaIF2Ub0bVhjG_PpgA":{"text":"My favorite bar in the French Quarter and I hit them all when I was there. I love the lege","useful":0,"cool":0},"eW-O-1pQFLjxQprxCbsjRA":{"text":"Best Hurricane by far. I'll elaborate further, but that needs to be said right off the bat","useful":4,"cool":2},"OMmKrcCDEQ7GC0me9mEH6Q":{"text":"The purple drink. That is really all you need to know. Of course, there is history and I d","useful":1,"cool":0},"gypjsN-XnKlaeIcicNxu-A":{"text":"I always begin my stay in the Big Easy with a visit to Lafitte's.\n\nThe two years I lived i","useful":0,"cool":1},"ijdG_-wSgAd6LxQnQKi9wQ":{"text":"Lafitte's Blacksmith Shop is a must see-must experience when in NOLA.  I love to visit thi","useful":3,"cool":3},"95xLenah5fg_Vt60JCW2Gg":{"text":"Nothing fancy but you just gotta come drink in the oldest operating bar in the United Stat","useful":0,"cool":0},"T8BH5Fji-T5IcFtV6luUGw":{"text":"I'm still so sad about Lafitte's. During a recent trip to New Orleans we decided to give i","useful":12,"cool":2},"3JvdqOsdFTxaI8wzRzqm_g":{"text":"Cool history but had fruit flys in my drink. Bartender was nice and gave me a replacement ","useful":0,"cool":0},"CU-e78QCdFPL8H-yachG1w":{"text":"Walking in to this place reminds you of stumbling in to a Game of Thrones bar scene... cob","useful":1,"cool":1},"F2hXsFBBb6TYvD0cteFubQ":{"text":"We visited one time in the evening for a great time singing along with the piano man then ","useful":2,"cool":0},"dJNqoRExGMefNf4QgOxR5g":{"text":"Super cool bar to check out in the French Quarter. They make awesome slushees  and the pla","useful":1,"cool":1},"AbmoRGbzK-spD-84oGk-gA":{"text":"Decent place to stop in for a drink and check out the building.  Lafitte's has a much bett","useful":0,"cool":0},"AfxhoRKH5RdqMX3pqyaEHw":{"text":"Oldest bar, blah blah blah. Yes, that drew us in to check out their drinks. Midday it was ","useful":0,"cool":0},"2-s0CNji2bqsYwWn_Fttsw":{"text":"Great place to visit and check it off your list of places to see while visiting.  I wouldn","useful":0,"cool":0},"sIt-78O96Fh4FoSW-mcr6A":{"text":"This place was pretty cool. We just stopped in on a quiet Tuesday evening for a quickie ju","useful":1,"cool":1},"vOgSlOwgpCYoUQMfbRm2gA":{"text":"My wife and I visited Lafitte's in December 2019. Such a cool place! This bar is less dodg","useful":0,"cool":0},"13KdhqHS3-CDn6lX9phF_g":{"text":"A local friend brought me here, claiming it was their favorite bar, in the history of ever","useful":1,"cool":1},"qxWHmH48flVr5zocwnkeVA":{"text":"Dank, dark and confusing.  One of my favorite finds in New Orleans.\n\nDon't miss the piano ","useful":1,"cool":0},"6J45GJKsDM-uQ1h9Vf9qgg":{"text":"Awesome spot with lots of history...friendly staff and good drinks...piano bar was a lot o","useful":0,"cool":0},"5ODbDS0Zj4GNWW2p_ZaLTQ":{"text":"Do it. Come to the oldest bar in America. Drink the gross purple drink (that will probably","useful":0,"cool":0},"-bJ9xzN1FtscMe-_NKpUjg":{"text":"I don't think much of Bourbon Street, but this, the last and oldest bar on Bourbon Street ","useful":0,"cool":0},"yB5COz7EQMsmlOHZK3FpsQ":{"text":"$6 a beer and no dancing. It's more of a sit down and chill kind of bar. It's so dark insi","useful":0,"cool":0},"DX5Qj6zDgK5V7KlWq4lcFg":{"text":"Frozen purple drank get in my BELLY!","useful":0,"cool":0},"pjMAbJocHZv_5qL7Q2hdmg":{"text":"We stopped by Lafitte's late one evening during our epic long weekend in New Orleans. The ","useful":2,"cool":2},"YWdGngSJtT9sfknn6KB8gQ":{"text":"I wish I would have gone to Lafitte's sooner. This bar was my absolute favorite plus it ha","useful":0,"cool":0},"zlhO1r52pNFz4HB0fbG90g":{"text":"Cool place!  Pretty much the only lighting in the bar comes from candles (although the nig","useful":0,"cool":0},"wiUzwJ-W8ebyiHoqL4f0ZA":{"text":"This place is great. The drinks are strong and the atmosphere is laidback. It's lit by can","useful":0,"cool":0},"50zHU4RYL2mtlVYPlHx1KQ":{"text":"The building itself has a great story. The old fireplace inside is worth the trip in itsel","useful":0,"cool":0},"zfOdooMbkNgd1qhCz4oKBA":{"text":"Is it the oldest bar in America?  Is it even really Lafitte's?   There is a bar down the s","useful":2,"cool":1},"zc4BwkP4DGXyvlXw4N2CWw":{"text":"Best place in the quarter to hang with friends. The voodoo is the best damn drink to get t","useful":0,"cool":0},"9sHoyu2E4z_XlxsA-mIGDA":{"text":"This is a very old historic building way down on Bourbon Street. Very cool vibe inside wit","useful":0,"cool":0},"qs5AvIQjrQGcULhXdYNBqQ":{"text":"The purple drink! That's all you need to know about this place. Be carful, the drink will ","useful":0,"cool":0},"9feuK0rS6kOSXKxAVAsjNg":{"text":"We learned about the history of the bar on our Wed 10 am walking tour - a nice historical ","useful":0,"cool":0},"OjzQ_CSWE5cbgMMXJBPQ-w":{"text":"Cool bar! The craftsmanship of the colonial times is evident throughout the bar. The staff","useful":0,"cool":0},"9Ed_2NqP5DYi8H43WBegAw":{"text":"Stopped in for a quick drink and I'm glad we were able to hit this one - cool atmosphere, ","useful":0,"cool":0},"M2c1vu0TQcmxSyZtQ3R1dQ":{"text":"This bar is more cool to take a picture of then anything. I do enjoy the dark atmosphere w","useful":4,"cool":1},"dkWOseXkWzBp6NQ_DRh4_A":{"text":"Stopped in here on Mardi Gras day for a fun crowd. My friends and I got that grape Kool Ai","useful":4,"cool":1},"5Hhbd-F29ycaowYc_Ltykw":{"text":"My favorite dive bar in the French Quarter.\n\nI don't believe I've ever made it out of Lafi","useful":7,"cool":5},"Nus1gC0CnVVkGp9JB2bGaQ":{"text":"Great bar on Bourbon Street that is a little off the beaten path, what it lacks in chaos i","useful":4,"cool":3},"cOtKjex-CCaeDjHBYFeFVg":{"text":"The atmosphere of this place was great & the bartenders were great at their jobs. Very per","useful":0,"cool":0},"_wzF3l2G-xLGZSVvMSGZeg":{"text":"If you come to New Orleans without paying a visit to Lafitte's Blacksmith Shop, you just w","useful":2,"cool":3},"Am-Cz-BZxd9Za_C3_g-CYg":{"text":"I had an Abita Strawberry, and my husband had some purple frozen concoction that apparentl","useful":2,"cool":0},"lYYwsunujoqoDXlBi_PF9A":{"text":"Dimly lit piano bar. Enjoyed the hurricane and voodoo drinks while requesting our favorite","useful":1,"cool":0},"g3ygKrMExgQ3t0IAEXEW6g":{"text":"Do it, go there! It is a cool place to hang (make sure at night though) for a few nips of ","useful":0,"cool":0},"2-0IYfrcG_04pRnq8nB7_Q":{"text":"Fun fact! Lafitte's Blacksmith shop is believed to be the oldest structure used as a bar i","useful":1,"cool":1},"WhZbBCignHXCPf8AgUdCQA":{"text":"We landed in town today for our first ever New Orleans experience. After walking along the","useful":0,"cool":0},"PBJK843iseQpZ1KVfLCz2g":{"text":"What a charming bar. This place is one of the oldest structures in New Orleans. It has low","useful":1,"cool":0},"mQAAM94zscZmKlzJE2C8MQ":{"text":"Great place!!! Advertised as the Oldest Bar in the USA. The drinks are good with an even g","useful":0,"cool":0},"fUvbMbdPSkqwHofRhVlshw":{"text":"This place was suggested to us by our tour guide on our Royal Carriage tour.  The guide to","useful":1,"cool":1},"JH0RHu8izD3tpkluydltjA":{"text":"Very cool historical place. Just think about all the history and moments that have happene","useful":5,"cool":7},"MhIHxqjE7Cdg1Rp13h0JSA":{"text":"If your in town, you have to stop here! I stayed in NOLA for 5 nights and I found myself a","useful":1,"cool":0},"wdOni19xBA_iCGbQQ7rU7w":{"text":"a really fun, really old bar. The purple daquiris have everclear in them, so having one be","useful":0,"cool":0},"ztWeXDwN1gM3yinoY0tjNQ":{"text":"Pretty cool to know that you're visiting the oldest bar in America. Over 300 years old. It","useful":2,"cool":1},"_uvWA5ysfXgYpqzrGJhJyw":{"text":"Top three of my favorite bars here. At first I was a little leery of walking all the way d","useful":2,"cool":0},"cWiX4wMfF__yfLV4frm0Ig":{"text":"MUST DO!!!\n\nDark, red candles, jukebox... plus a fireplace!\n\n... so it's on the list as a ","useful":5,"cool":4},"1lNqc_1mto9hrygRG7KxBg":{"text":"Lafitte's has a long history in New Orleans - like 300 years. OK, it looks it too, but we ","useful":0,"cool":0},"zIbw_YxFltdylXLSsYHAlw":{"text":"Fast table service. Old tavern atmosphere is cool.  Loud bar. Wish they had snacks. Ordere","useful":0,"cool":0},"00uILfjYZIiG0F9JiDSFyw":{"text":"A no!! Way to crowded. Waited couldn't  order drinks. No seating. Had to leave. Bar tender","useful":0,"cool":0},"86g_6De2siJynUnUfABh8w":{"text":"Besides this being the oldest operating bar in America - the staff and owner are always a ","useful":0,"cool":0},"Jdg0Tvhl3UeiCOh32eWOvg":{"text":"If you are fortunate enough to be in New Orleans, you have to visit the oldest bar in the ","useful":7,"cool":8},"GTtCtuJWi5GFnAKzEvWwpg":{"text":"For a long time I didn't understand the attraction of Lafitte's.  It is away from most eve","useful":0,"cool":0},"g5LQAp6zjJx46sMRqF7mJA":{"text":"What you need to know when in the land of the most amazing bars in the US: Lafitte's Black","useful":23,"cool":29},"2JyDhCHl1cHiXTY9SNZEVQ":{"text":"Voodoo Daquiri.. lol. Tastes like a frozen grape skittle! So good! and so strong! I think ","useful":4,"cool":3},"RNItb6pT3G51mnz7S7Dgwg":{"text":"Lafitte's Blacksmith's Shop is one of those places that is on every tourist agenda when th","useful":4,"cool":4},"f8dSDSsMqdJ5OHwBhvNf5w":{"text":"Such an awesome spot! Grab a drink here as it's the older bar! Kind of small but super coo","useful":0,"cool":0},"qXAx66BR1bWZj0ArIXW_CA":{"text":"Ok folks, here it is. What might possibly be the best bar in the country. Supposedly the o","useful":19,"cool":20},"gPEn4vE7A9bxz0B-Go5vEg":{"text":"Avast ye, scallywags.  Ye not be needing a Jacob's ladder to board this clipper in order t","useful":59,"cool":53},"3fHrcjM9dOVr0ceZrwctoQ":{"text":"Would any trip to New Orleans be complete without stopping by its oldest bar? The answer i","useful":0,"cool":0},"gA5N0B6KhjIHZUnITvzp-w":{"text":"Depends on what you want from this place.  Some people just want to get drunk in New Orlea","useful":2,"cool":0},"kn1h4DrHGhcWe0mZV60bMw":{"text":"The Voodoo Daiquiri  (frozen grape daiquiri that apparently everyone calls the purple drin","useful":6,"cool":7},"S2l_fz1kXcer_kl4T6jPCQ":{"text":"The purple drink is pretty strong and the bartenders are nice, I would come back here!","useful":0,"cool":0},"tP63ktHyyCED1v3JVyXsvA":{"text":"Such a unique place! Great drinks and service. No food but the atmosphere more than makes ","useful":0,"cool":0},"mZYlivLRT4uq8mK_-oHxHQ":{"text":"It's small. It's dark. It's old. \nThere's a lot of history here, I'm told. \nAs long as my ","useful":4,"cool":4},"ES5g3gaMw-3EsWl8mnP3SQ":{"text":"One of the best  hurricanes in town, made from scratch and much better than pob. Popular s","useful":0,"cool":0},"NfUAZPKfqb3KPbidbAmsvA":{"text":"Located at the far end of the party strip, this old school...like...really old, old, old s","useful":4,"cool":6},"WcHXiTyRxGQ8E3nMbjCz0A":{"text":"Lafitte's Blacksmith\n\nAdvertised as the oldest bar in the United States and where pirates ","useful":3,"cool":3},"T85FEuRY67NbiWFvNczEZA":{"text":"This was one of the first bars in New Orleans that I set foot into November 2005.  Figures","useful":2,"cool":1},"7nLEL0Upf99LV5brmHm2aw":{"text":"A great old historic bar. Was there to meet a friend. Saw a total ass-hat try to bring a l","useful":8,"cool":4},"Kfuv7_MmRTt7jNCm4DPc_g":{"text":"Oldest bar in the states, has the look of it for sure on the outside but the inside is ver","useful":0,"cool":0},"h17pkTmjyHDj8-cxeBwvgA":{"text":"PLEASE DO NOT GO TO THIS BAR!!!!\n\nWent there today with my boyfriend because it looks like","useful":0,"cool":1},"a6jbco4Gs8ibXiW-Wk5DOg":{"text":"I think you come here for the history and low prices, not the service. The bartender appea","useful":0,"cool":0},"5FiXE30ym9T_0dEM3UzMKg":{"text":"One of my favorite bars in New Orleans--if not my absolute favorite.\n\nHighlights:\n- It has","useful":2,"cool":1},"ygerQhWAj63EE3gFONi2Zw":{"text":"A favorite spot in the open-minded quarter. Everyone is friendly and welcoming anytime of ","useful":1,"cool":1},"9rwHtN8nNVsHuL4mRoR1YA":{"text":"Fun and historic atmosphere, talented pianists, and great bartenders. Towards the end of B","useful":0,"cool":0},"knyHvC83VLK2jM28569-dA":{"text":"The oldest bar in America super cool spot to get a drink and sharing some lore it's a pira","useful":1,"cool":0},"6GWCpBYxAM9n6B-lb9rwCA":{"text":"If you're from NYC and are visiting New Orleans, GO to this bar. This was hands-down the f","useful":1,"cool":1},"xjeRpaKTN42JIFGQ3O6CRw":{"text":"I love this place. It's usually a stop to or from somewhere else but I love it each time. ","useful":0,"cool":0},"ZPP_C2Ck6IFbtrmofgSDcg":{"text":"This is supposedly the oldest bar in New Orleans. It is super cool inside- there's an old ","useful":1,"cool":1},"XxxzVGxPehTTg3t2Is2Gwg":{"text":"I love the history of Lafitte's, and the fact that they chose not to install lights in mos","useful":3,"cool":2},"NNH5nPjNYreTKbsXvYEHsA":{"text":"A wonderful little bar with history. Great hurricanes and friendly staff. Easy walk from a","useful":0,"cool":0},"3ai1yCeWc1hFTEMAGWGa_A":{"text":"If Harry Potter were to go somewhere to get laid, this would be the place he would go to p","useful":0,"cool":0},"psZJAp7NPNFm6ynXdoiYhw":{"text":"I have stopped by here on two different trips to New Orleans. It is always a cool place to","useful":1,"cool":1},"JnRnD_Aaq9PrVP7dBMQWUQ":{"text":"11/24/17\n\nClaim to fame: one of the oldest buildings in New Orleans (or oldest?), and poss","useful":51,"cool":42},"KBT_3VLxLzf5Y2roWPhgyw":{"text":"I really like this place.  I am told that it is the oldest bar in NOLA.   There are no lig","useful":2,"cool":1},"bYREus2vDfevN4Nt4p09Ow":{"text":"Old. Small. Overpriced frozen drinks. meh.","useful":0,"cool":0},"awoSKp3_KzIblhmIdjlXxA":{"text":"Neat little bar way past all the glitz (if you can call it that) of Bourbon St.  We stoppe","useful":1,"cool":1},"KaHr8k5IEy-3FCjiHdQEsA":{"text":"Got to visit this spot because of its history. Very old structure. Fun atmosphere. Happy h","useful":1,"cool":0},"uZHkeJQO9lwMKDtpO0T0Ig":{"text":"Stopped in and expected a cool experience at this bar that is famous for being only candle","useful":0,"cool":0},"hThGAvcujHVTYUdLpYToOg":{"text":"The oldest bar in america.  Need I say more...?","useful":1,"cool":0},"kFItsOxedF2JyLqCvaI3qw":{"text":"Stopped in because a friend recommended it and said it was the oldest bar in America. It's","useful":0,"cool":0},"DX7m7_d5zwSFIX-YAGpTOw":{"text":"Lucky Lee was fantastic on the piano.  Very entertaining, the music made the $9 Voodoo dai","useful":0,"cool":0},"0tiIlkC28OSuCHVkIeiWcg":{"text":"Went here for the first time last night - supposedly the oldest bar in America where pirat","useful":0,"cool":0},"JI3_DI3SUdAY_hb1LkMfUQ":{"text":"Very cool, old bar located in the Quarter. I was a bit skeptical to try this place out bas","useful":2,"cool":2},"1s2GRRNBzs1kFax2v4gDZQ":{"text":"This place is super cool. Most of the bar is lite by candles and Christmas lights. It's su","useful":0,"cool":1},"VBDgMoAEDLApRNtvdxVOmg":{"text":"I'm sad to say I was a bit disappointed by this place...but it's my fault. I'm pretty nerd","useful":4,"cool":6},"FvfPxgcZSvKPdf5dCaOEvA":{"text":"Ok this just has to be one of the stops if you are coming to nola. This is the oldest pub ","useful":0,"cool":0},"kJSoxO59FSkh4eJ5cfFa7g":{"text":"Must see bc.... old?\nOk cool, but pricey as \nHell. Plus Dimetapp*\n\n*Voodoo Daiquiri tastes","useful":1,"cool":1},"Q1y2XuNPvYPZ-3SZXefwpA":{"text":"We liked it!\n\nThis place has a lot of history.  Check it out on one of my attached images.","useful":2,"cool":1},"T7C2ZefVsNZ4bmkDwbB7zg":{"text":"Consistent with most of Bourbon Street, Lafitte's isn't your destination for food (actuall","useful":3,"cool":1},"KVG2kT4lBcKidM_5a08Dhg":{"text":"Billed as the oldest bar in the country since 1772. This was a \"since we're here we might ","useful":8,"cool":12},"lOlhUEuUkXrmAkHlM5A2rw":{"text":"Stopped off in here to have a drink at the oldest bar in America. Got a purple drank that ","useful":1,"cool":2},"ILlHJtA32GHFTBLZehK5Yg":{"text":"My wife and two of our friends stopped into Lafittes for my birthday and a long weekend ge","useful":1,"cool":0},"itZLCFY4tFPkLOdAKUNuYQ":{"text":"Seems like Lafitte's gets many reviews from out of towners...so here is a New Orleanian po","useful":9,"cool":7},"fDWVoxwfRSl2wk4Gnzk8uw":{"text":"love how they always have the doors open and you can chill and listen to the shit show on ","useful":8,"cool":7},"SS-xAncv6jLpquw0uAJjsg":{"text":"What a neat place. Having a drink in the oldest building to be a bar is pretty neat. Didn'","useful":0,"cool":0},"osg1LtZyWSKIGbd3juy32Q":{"text":"The oldest bar in the country!! And also, their Voodoo icee's are the bomb! A bit sugary, ","useful":1,"cool":0},"pPHo0BiB703WhUOUSJlPtA":{"text":"Lafitte's Blacksmith Shop Bar is a classic stop in New Orleans, a must see if you are in t","useful":1,"cool":0},"UELDQ2M0uFrVx-JwLhxPkA":{"text":"This was one of those places I was told I had to visit while in NOLA.  Glad I did.  It's a","useful":2,"cool":1},"0UGWPULr4oKoMM6wb4Z-Yg":{"text":"Little on a crazier side, roudy place. I am not a fan of loud places, but we decided to ch","useful":0,"cool":0},"ufPOz5dVuJdBU9vKlN6A8g":{"text":"You have to stop here for the voodoo daiquiri! Period. It's on the original cocktails of N","useful":1,"cool":1},"OoxkDNGYnWrpQxW8Nkx64A":{"text":"Bar is absolutely cool and when you realize how long it's been around, it's absolutely ama","useful":4,"cool":4},"oJmR1qizrSBv5njepskaJg":{"text":"The oldest operating bar in America that used to be a blacksmith shop. Lit by candlelight.","useful":1,"cool":1},"GSYpA_edgA80jKadRw8FvA":{"text":"**DON'T ORDER A FANCY COCKTAIL AND YOU'LL BE FINE**\n\nABOUT THEM\n============\nBuilt between","useful":24,"cool":21},"1CmQl4TXIz42iC0nUy23qw":{"text":"The oldest structure in the US housing a bar.   Built it 1732,  this haunted tavern has no","useful":4,"cool":3},"YEM7zfT0Yn3l3B1sOUY12g":{"text":"The atmosphere is great. It's a quaint cozy little bar, however I was overcharged big time","useful":0,"cool":0},"08_dyfS6LESMy8EILFwkYQ":{"text":"Such a cool place for a drink. We went a couple of times on our recent trip and were not d","useful":0,"cool":0},"Ig2XkoNG4fayBXfj9SXo2Q":{"text":"Absolutely loved lafites. Got the signature hurricane as our first drink and we prob would","useful":0,"cool":0},"Mc0nyFK1MGdCWNWPhLNSJw":{"text":"Lafitte's Blacksmith bar - oldest operating bar in US\n\nLafitte's Blacksmith Bar - 941 Bour","useful":0,"cool":0},"7bGDaHqffMk98mNdTmzMKQ":{"text":"Terrible service.  Very slow.  After the entertainment ended they acted like we were invis","useful":2,"cool":1},"yj5bApj_XIwryqTurWrvdw":{"text":"Great vibe. Cheap strong drinks . Outdoor drinking area. Has some alcoholic slushee drinks","useful":0,"cool":0},"3YRoYEpV2C20a7kaVqnnGg":{"text":"Update Jan 2018.  Mike is gone but the new piano player is very good. He played \"Mr Bright","useful":1,"cool":2},"QECQrfLImxu_bjp-bnw8yw":{"text":"i love this bar so much! Thomas is the BEST!!!!!!! had a weirdo male yelling at me and sta","useful":0,"cool":0},"eV7KVROvOD9Oi4kQJDEcxQ":{"text":"Today I got the chance to go on a haunted history tour and I got the chance to visit this ","useful":0,"cool":1},"BcPDj21mAaiS8TBTDjxt-g":{"text":"Lafitte's is awesome.  Just beyond the rowdiness on Bourbon Street lies the oldest operati","useful":4,"cool":4},"MVFydaRACjPtpY9RB5Q0TQ":{"text":"One of my all time favorite bars! Fun atmosphere in a very unique setting. I'm sure the se","useful":1,"cool":0},"njYbJQjldXIBTaTs1QLK4A":{"text":"We really enjoyed this bar. Love how old the structure is. It's more of a dive bar feel , ","useful":0,"cool":0},"Co6I3QAPcvuWt-Z_aooy3w":{"text":"Best place in the quarter to hang with friends. The voodoo is the best damn drink to get t","useful":0,"cool":0},"gVxDtFERL_XErBXzfJE_nA":{"text":"This is my favorite place to go in New Orleans. I'm not down for the other bars on Bourbon","useful":1,"cool":0},"MIdzu83i9A7stF5ZJl5MZg":{"text":"Cool little dive--I was told it was the oldest bar in New Orleans. It was a great little s","useful":0,"cool":1},"tYPa52MNla5eCF4RFJ7Dog":{"text":"Alright, ive come here ALOT over the years. They make a good Hurricane and great holiday d","useful":7,"cool":7},"t9BIrHeHh24P_0wR1EEQDQ":{"text":"Great place! Love music after 9pm! Get yourself a \"purple drank\" and take a lot of picture","useful":0,"cool":0},"Ov_DnbQ5qxSIfSdg-3mUHA":{"text":"The crew had a great time at Lafitte's!  The back patio was nice and the staff was really ","useful":0,"cool":1},"C_8aeXkAjzfAqnazF6hCVQ":{"text":"Oldest bar in USA and America maybe.. do I need to say more? Go go go... have some drinks ","useful":0,"cool":1},"ppy0swjAzslIg9cJaSs5uw":{"text":"It's poorly lit, dank, old school, and has a rich history. My wife & I went, because a goo","useful":2,"cool":2},"wRGWAZ3nP4EsBO9yUuWGrA":{"text":"Amazing bar, great service! the vibe is old and that plays a part in it being one of the o","useful":0,"cool":0},"iETplTUVzTf9g0guQUixew":{"text":"If I lived in New Orleans I would be in trouble because my liver would be pickled from Laf","useful":1,"cool":2},"ofbuOCCjcpFc7_eYME_vOQ":{"text":"Love this bar with friends but they're really the only reason why it's fun. The $8 hurrica","useful":3,"cool":1},"vrSV9RVeoK5RyT6vvDqPGA":{"text":"Oldest bar in the world, don't @ me!! Love the vibe & this is the only place to get your p","useful":0,"cool":0},"G4dRPK8eGE3ti57hZ-tE9Q":{"text":"They say it's been open two centuries, and judging fro the level of grime alone, I'd belie","useful":0,"cool":1},"Rb2yTDxOFvsZfTDTwaD_Ow":{"text":"The oldest bar in the country! The voodoo daiquiri is so bomb and will put you down if you","useful":0,"cool":0},"_Hn2-i6guNQvXvHn170dPQ":{"text":"Glad we went just to say we had been there. Got the \"famous\" purple drink from a bartender","useful":1,"cool":0},"N8_4KSnWO60awzwM_Ljp1Q":{"text":"My favorite bar in NOLA. Maybe the world. Drink purple drinks and forget everything! Wake ","useful":0,"cool":0},"D9XhArIuR_Un294Woq4jKQ":{"text":"Super crowded on a Friday afternoon (end of March.) Took about 20 minutes to order at the ","useful":0,"cool":1},"8Iiwf19gp9h8GZvSi5UeqQ":{"text":"Lafitte's is the oldest and most haunted bar in the United States. It's the bar that you w","useful":5,"cool":0},"8obDsL-01jJnNAXn_C3kDA":{"text":"For all you history lovers, this place is reported to be the oldest structure to be used a","useful":3,"cool":4},"jXEWazxmjc1K5YyaNh_41Q":{"text":"3.75/5 let's get drunk! \n\nsugar slushie for adults. that's what's going into your system, ","useful":2,"cool":2},"sLnRX-s9vjKzbO7SrCeIyg":{"text":"Visited during my vacation. I liked the fireplace...wonder how often it's used in such a h","useful":0,"cool":0},"43fsynHnQpjVKeG_hncI6g":{"text":"Coolest and oldest bar in NOLA. A bit crowded most days since the ghost tours started freq","useful":0,"cool":0},"4WujgTI31pRGVZAvEjBUAw":{"text":"Loved the Ambience when we visited earlier this year. Difficult getting a table and drinks","useful":0,"cool":0},"6iaJQNfF8TcP4o0BGe4DUQ":{"text":"I felt this place was overrated. I get that its a historical bar but it seems like they ar","useful":0,"cool":0},"ZNuS1_9nQncvZcf0LumHtw":{"text":"Yelling who dat..love this place.have great drinks and great music..service is always good","useful":2,"cool":1},"nJUgkyr0bnvLjwaPJggzxA":{"text":"Its just kool to know i had one in the oldest bar in the US. Try the VooDoo Dac its just g","useful":0,"cool":0},"ENR9vxG6kfftbJy1pXeYXg":{"text":"Listen, I came here because it's the oldest bar in America still operating as a bar.  That","useful":1,"cool":2},"83p6qHQdO17gKq-oyJG09A":{"text":"This is the only bar I visited on Bourbon Street, mainly because it's too far down for the","useful":0,"cool":0},"CdB1m7QCVD3pH04m3JrQ4A":{"text":"Incredibly old and dusty bartender, the only\nknown survivor of the Great New Orleans fire.","useful":0,"cool":0},"KKuFf8S1B5iOtCEfIobJkg":{"text":"Cool spooky vibe in this small bar. We all got the Purple Drank, and it tastes like a grap","useful":1,"cool":1},"PUVfU-Fh1mnZDrsM3gDujA":{"text":"Lafitte's is one of those places you have to go when you're in the Quarter. It's the oldes","useful":4,"cool":2},"Fbyft0CtUpWjJds4d6yzaA":{"text":"Cool vibes. Live music and purple drink. Great hangout soot after raging on the main porti","useful":2,"cool":1},"asBHfjznhRWIlZbrWA53tA":{"text":"This place is a staple that you have to go to but the bartender was not friendly and the t","useful":0,"cool":0},"jpRUdvW4hQ7er4-BmRt4aA":{"text":"I went here before covid. Dark bar. Lots of seating. Drinks were ok. Bathrooms were dark a","useful":0,"cool":0},"jn4SvDBNzKxHmjWVt2HP5A":{"text":"This is a DO NOT MISS while in New Orleans,  best known as the oldest running bar in the U","useful":3,"cool":1},"3cX0cLev0og39HtUPk0fMQ":{"text":"I would give it 10 stars if I could for having the very best drinks in the quarter. It's b","useful":2,"cool":2},"ADv27SdkperLtT7jhDQbYQ":{"text":"A piece of history AND you can drink inside? Sign me up! If you're specifically looking fo","useful":1,"cool":2},"_569pGIvA5-zntXT3tO98w":{"text":"Go here for your hurricanes- by far the best ones out there- and you get a souvenir cup to","useful":3,"cool":3},"b-elYhnDz-bgm7mTeWLoxQ":{"text":"First off lets get the false story floating around to rest. This is not the oldest bar in ","useful":2,"cool":1},"n_eBzOaWSale6--no0EV9Q":{"text":"I always find myself drinking here at some point in the quarter. During the hot summer day","useful":1,"cool":1},"vVIrsM6IYO1NL6M7EgwPZw":{"text":"Keeping this review very short...Lafitte's is f*****g amazing; you must visit.  Top 20 bar","useful":1,"cool":0},"Cs3GIe8M4yUcu1k_O6ixMA":{"text":"Best hurricanes in NOLA!!! So good! \n\nThis was well worth the walk near the end of the act","useful":1,"cool":1},"gaovEVP4oysQCbtGvsh4eg":{"text":"Oldest bar in New Orleans? One of the oldest surviving structures too?! Yes!!! Lafitte's w","useful":31,"cool":23},"_U1aLmITLSv812K6ScLBdw":{"text":"Nice old place that is charming but people can ruin anything. I went in to get out of the ","useful":1,"cool":1},"B2EIjteaL_2XuC9nP7O7tg":{"text":"Walk towards the end of Bourbon St away from the always hopping bars and you'll stumble up","useful":22,"cool":14},"lB_xdFZ_dSQMoO0smCJ85w":{"text":"Lafitte's is exactly what you would expect.  Touristy   loud  lots of drunk people .  We w","useful":0,"cool":0},"qvpHtcfL1RcY-bgcIj4bQA":{"text":"This is a must when visiting. Make sure to bring cash to recommend songs on the piano. Dur","useful":1,"cool":1},"8eSiuXc-k-SswQSF_9dbZw":{"text":"It quite literally doesn't get better than this. \n\nThe oldest bar in America, folks. No el","useful":10,"cool":13},"SrSitccMhh_TSg8RIdQIVg":{"text":"No AC... so was hot... no one cleaning tables off during a pandemic?... Huricane drink was","useful":0,"cool":0},"95qP-IHIpSqL3rzrijMiNQ":{"text":"I don't have a lot to add to the other reviews except that I don't think it is stinky, I d","useful":1,"cool":1},"q9YUInBIWUwTWxpUJh0fYQ":{"text":"Yeah, it's on Bourbon Street, but this is unlike any other bar with that address. It is fa","useful":2,"cool":2},"_pNGNXpoCeckF_6286hNaQ":{"text":"A classic historic New Orleans location This bar is the one of the longest running bars in","useful":1,"cool":1},"7lbJFGBYtY_Y7NdsdcnLKw":{"text":"At first I wasn't sure I was going to like this place because it was super crowded and def","useful":0,"cool":0},"OJQlTp_v5XxpAyy_-myVVA":{"text":"You are on bourbon street in Nola, head east and you will eventually stumble on Lafitte's ","useful":3,"cool":2},"OjxoJ6kn3tnl5DvnjeP1sQ":{"text":"POST-COVID REVIEW\n\nAs a born and bred traveling with fellow NY'ers, we know pretentiousnes","useful":3,"cool":2},"_o5JiCdMKVeNgbCFOGV2AA":{"text":"My favorite nighttime haunt. The voodoo punch is amazing. Frozen treat. The staff could be","useful":1,"cool":1},"7An2V5AiBEpRYzQ8IWzJXg":{"text":"Wanted to comment on the smell went by this week and they were working on broken pipe (bro","useful":2,"cool":0},"owvA7fEdJwfKtJ0z2jdstQ":{"text":"Historic structure and one of the oldest bar serving beer and frozen drinks since 1700s.Th","useful":3,"cool":2},"A-kfXC_Dh3UkGjvXoJvheg":{"text":"Bourbon Street is insane. Literally, you'll walk down this French Quarter pathway and see ","useful":11,"cool":12},"wp32a7-NpobQL6EeXuDtkA":{"text":"Lafitte's Blacksmith Shop is the primordial dive bar. It's the granddaddy. It's the dive b","useful":10,"cool":13},"alM6oTcjfJUvuyqgZ3tAKA":{"text":"Go at night! Candlelight, grand piano, purple drink! Ghosts roam this neat little haunt! S","useful":1,"cool":1},"oUWpcqKkriayT5YasBA3lw":{"text":"Going to Lafitte's Blacksmith Shop Bar in the French Quarter of New Orleans is sort of a f","useful":0,"cool":0},"WEmHZM_Mdor1qzVtseaUwQ":{"text":"Enjoy the history and Get the purple drink. We aren't Bourbon people but this drinks start","useful":0,"cool":0},"zXpJJ_5tV8_aX1VfMx422w":{"text":"It's not the ideal bar but since its the oldest bar in America you kind of have to come se","useful":2,"cool":1},"Oj0MOYHs8dUo71eo6HxJ0A":{"text":"Great location, great drinks, great crowd, and the staff is always nice. I agree with Andy","useful":1,"cool":1},"gdxmWduTjI2B3Jd3xxexSA":{"text":"Good ole Lafitte's\n\nThe bartenders can tell you the store of the bar which is pretty great","useful":2,"cool":1},"91ju8HQ5Z9KyMbpUyuSoyw":{"text":"Really cool dive bar in the French Quarter!  The oldest structure in the US being used as ","useful":21,"cool":18},"iCs_3NKmBetxxdc9dz8hww":{"text":"A great local spot. Good drinks - definitely recommend the voodoo daiquiri and the hurrica","useful":0,"cool":0},"_b256ec4x-y3nhj_0uy9pw":{"text":"I feel terrible writing a mediocre review for this bar, because I loved the historic feel ","useful":1,"cool":0},"7gja_9Oc_yTU0X72d5u_pQ":{"text":"This place was small, packed, dirty, noisy, full of drunks and somehow it was awesome.  I ","useful":0,"cool":0},"AzVwlcQpu0dJsK-iGv33aw":{"text":"This place exists in many dimensions.  Songs that make you cry are written and played here","useful":0,"cool":2},"C1rOkrLhPxAdLPrgGqN5gQ":{"text":"Fun and rowdy bar- come for the purple daiquiris and stay for the crazy people watching!","useful":0,"cool":0},"FK_UwzmS7STH2yAV1BCfbA":{"text":"A very cool dive that is not to be missed in the French Quarter!  Another that is on my li","useful":0,"cool":0},"Ulyam9Mn8Bw3OWSrF6dOpw":{"text":"Quick trip to the quarter. First time at Lafitte's and I had to try the Voodoo Daiquiri. S","useful":0,"cool":0},"HPnqbTUHy9DPJmRIoivD3A":{"text":"The oldest operating bar in America. Definitely looks old, with the fireplace and wood bea","useful":3,"cool":0},"4gcsth7ygM8GAPTiQX_x9Q":{"text":"Everyone should come to Lafitte's at least once during their stay in New Orleans.  The bui","useful":3,"cool":1},"I73qzQ_rwWRZwFJVKxTp4Q":{"text":"A tad on the late side but here it is....\nI actually have been here before and decided to ","useful":5,"cool":1},"K0mJnxtMAK4XRlS2ELi5SA":{"text":"This was a great bar, especially had to stop since it's the oldest bar in the USA. \n\nThe v","useful":1,"cool":1},"uHiTUgYTX1BXGbIRXKjhdA":{"text":"I. Love. This. Place.\n\nOf all the places we visited in NOLA, this is the place we kept com","useful":0,"cool":2},"Fikf6i8b_Mtj2LtSWKrjew":{"text":"It's historic, it's a classic. If you're trying to decide if you want to go or not, GO! Th","useful":8,"cool":7},"Ar8fwINHdtQdAsmYX3kLZw":{"text":"This place is suuper cool!!!! And the purple drink was delicious as well!! This place was ","useful":0,"cool":0},"lWjUa3P1966mv2WGhlgmLQ":{"text":"This little bar is at the far end of Bourbon St.  Since it's a little past the touristy ar","useful":2,"cool":1},"DTHbrtlVVknYu2s7kq-ylQ":{"text":"Great outdoor sitting area! We were able to meet and chat with travelers while sitting and","useful":1,"cool":1},"jO0PA6T-voU4cyZ3LfjO8w":{"text":"The oldest bar in the country! Definitely some place to stop in and grab a drink and just ","useful":0,"cool":0},"Nbz9wNNb-9iA9rGczRMZPg":{"text":"A fun spot that we stopped off at during our ghost / vampire tour in order to take a bathr","useful":28,"cool":27},"PHW4CU2FO_g4LczFuRkHTg":{"text":"Lafitte's, you never let me down.  The hubs and I had another great visit to this landmark","useful":7,"cool":6},"W8jHpULIFnkuNDgTLrLfFg":{"text":"I really wish we stopped by during the day to check out the stone fireplace. At night, it ","useful":0,"cool":0},"EHWRYfaDkbFJYuFtjB3Q3g":{"text":"Old world ambiance, great drinks, good live piano music, low dim lighting provided mostly ","useful":0,"cool":0},"N7XpV7WlxIUNvy4ooAh8uA":{"text":"I know what it means to miss New Orleans. \n\nAnd even though Louis* and I miss it both nigh","useful":14,"cool":11},"g4ZZ7385prVmSFFmBd5D-w":{"text":"Classic late night bourbon st joint,   Awesome structure, great beer bar, nice music.   A ","useful":0,"cool":0},"MKBrhyKwPj08uhG_z4G6hg":{"text":"Voodoo drink was watery and I didn't feel anything. I can always say I tried it though!","useful":0,"cool":0},"LGSnFs9H2SYCkIFhxZm2ZQ":{"text":"This was a cool experience and glad we came here. I was told this is or one of the oldest ","useful":9,"cool":9},"qMwHRfVyP_C3-nasLksS7w":{"text":"Dive bar and a tourist trap.\nBut I expected that. What I didn't e or the was the $9 Daiqui","useful":1,"cool":0},"6MUx877KAkK2rSi0BlpBTA":{"text":"Amazing! So glad it has reopened after COVID. We made it 2x on this trip. And the piano ma","useful":1,"cool":1},"qRuLSc3dAIJHtbkDD_RH6g":{"text":"If you must venture to Bourbon Street, I mean if you are dragged there kicking and screami","useful":2,"cool":0},"bsKjrAHGO6MRbmh4RKWAkg":{"text":"This is a popular place on the far end of Bourbon St. it always seems to have a lively atm","useful":1,"cool":0},"CPAHbiBmgZsAFVpi1bIgAA":{"text":"This was a cool spot.  Super crowded and no one following the mask sign inside.  It is abo","useful":1,"cool":1},"VQOlRfow8mvB-p5OJdkYtg":{"text":"A cute old-timey bar that looks like my \"historic\" house before we renovated it. There was","useful":1,"cool":1},"yex1DVqgvmeVWy_-BPTTsw":{"text":"Love this place, have to at least try Purple drank once... but everything  else is better!","useful":0,"cool":0},"0kLQwVS77aYdjH5bdVzqoA":{"text":"A little gem at the end of Bourbon street, this became our favorite place to go and have a","useful":0,"cool":0},"9Y2Uoii9sraTUsLWa2qo8g":{"text":"This is a great old dive bar on Bourbon that has lots of great history.  I've had many goo","useful":2,"cool":3},"Gt6G_8VFJWQZea6yjXkEJQ":{"text":"Yeah it's a bit of a tourist trap, but if that bothers me so much, then why am I here at l","useful":4,"cool":2},"KRvx21yetSAvQIj1OcpCog":{"text":"Always a must do when in NOLA... super fun atmosphere, historic, great staff and Ryan at t","useful":2,"cool":1},"PEEjUm_90uAacBBDx5HXlw":{"text":"I found that Lafitte's Blacksmith Shop Bar has a very nice atmosphere and was overall a pl","useful":0,"cool":0},"D9r2sOonEOS5dssmhGdnIA":{"text":"I first  came here during  mardi gras and it was a good  break from the craziness that  is","useful":1,"cool":1},"9Jkyc5Mbh-FNe6ziYCoUSw":{"text":"This is a touristy \"must do\" while visiting NOLA. Why? 1) It's historic! Claimed to be the","useful":7,"cool":7},"8RwGRnuxyX1aUWUrlzo5qQ":{"text":"One of if not my favorite overall Bourbon St bars. Expect a more professional and conversa","useful":7,"cool":0},"nkCHlVsXQZzJB5c6lJcX1Q":{"text":"Love this place.  The atmosphere after dark is so good, especially with the piano player i","useful":0,"cool":0},"kCKKC2Z5VnBMpwgmNh8Hzg":{"text":"Americas oldest bar, what's not to like about visiting! Simply put its a small bar with an","useful":0,"cool":1},"hb5SEErPEIHDuf5nsgzLjw":{"text":"This is a must do stop in NOLA whether you live here or are visiting. Lafitte's is a popul","useful":2,"cool":4},"VK7ajtsVHr8h63uxtKKyTg":{"text":"And here you have the disputed oldest bar in the country. When you get into this place, yo","useful":17,"cool":14},"oR_UyB84ISleelrlVvYN5Q":{"text":"this bar is located towards the end of bourbon street. so it is kind of far from where the","useful":0,"cool":0},"Q2xOImxOyZrUUp19Aq1MXg":{"text":"This bar is located in the oldest building in the state of Louisiana. It was originally th","useful":0,"cool":0},"OXoy81nbgrGxLNb4OfTcnA":{"text":"Very cool place. We were told this is one of the oldest working bars in America. It shows.","useful":0,"cool":1},"jTpZO22jENrc4hryssX3sQ":{"text":"One can't come to New Orleans and NOT have a drink at Lafitte's !!!  I'm a history nerd , ","useful":3,"cool":4},"jC05mFzuwPFXyWhS1Lvpcw":{"text":"Very cool bar right on Bourbon street.  What it lacks in neon it has in character.  It is ","useful":0,"cool":0},"TaXrT7QuzbuqcZdT5AfuYA":{"text":"One of the coolest bars I'ved ever visited! The atmosphere here, which instantly transport","useful":4,"cool":4},"T-qd-DbjLNeFX4fUcpUX8A":{"text":"Pleased with service, drinks and atmosphere! Oldest bar in US is worth a visit! Only place","useful":1,"cool":1},"9ryQPbA4yglDUHUoYUZTkw":{"text":"While being an obvious tourist trap, this place is hard to pass up.  The building alone is","useful":0,"cool":0},"OX4X9HdC3y3DkDc3DnMO0g":{"text":"One of our favorite hangouts on bourbon street!! Such a cool vibe and old world atmosphere","useful":2,"cool":1},"WozweEfm12gJHFhfAfc-iA":{"text":"Ahead of my NOLA trip, Lafitte's was on my must-stop list. Now that I've made it here, I'm","useful":5,"cool":4},"YcgD0-ulpD4XK9i2wymgNA":{"text":"I love this bar.  Cheap drinks and good bartenders.  I ordered makers on the rocks and a l","useful":0,"cool":0},"BLxyBrCiIyweGREswFC2Ug":{"text":"I live in the French Quarter.  The Bartender tonight served people behind me in a line and","useful":0,"cool":0},"WC6fDqYx_9_6amZDAPpXqg":{"text":"It was fun having a drink at the oldest (built in the 1700s) operating bar in the US, and ","useful":11,"cool":9},"q1AhWfZWirK-n6YCRgqMtQ":{"text":"This place is awesome! I got laid three times on the piano in the back in less than an hou","useful":0,"cool":0},"INDEcsszennQDGN_v4CyLg":{"text":"Fun piece of NOLA history! Can't go without trying the Famous \"Purple Drink\"! Great vibe, ","useful":0,"cool":0},"r2uhW9WJhsV7KTvq3CoLQw":{"text":"I had Lafitte's Bar on my list of must do things for New Orleans.  I was a little worried ","useful":0,"cool":1},"xjcdqBRQG96t5Cncz0KOfA":{"text":"WOW, the oldest bar in the US! SO COOL!!!\n\nAs we walked out of Erin Rose (a must stop!), w","useful":1,"cool":1},"vMXgUbcMk_EOr0zB5vperw":{"text":"I was on a break from my 5 in 1 haunted ghost tour and it was perfect that this place was ","useful":2,"cool":1},"wRxsMkpvonz7o_ibnDNw3Q":{"text":"Romantic date spot for you and your middle aged coworkers. :-D\n\nJoking aside, this place w","useful":4,"cool":3},"4z_sw4MowQU9maZ4Nc4RIQ":{"text":"Loved this bar! Great vibes, great live piano music and singing and given its history, thi","useful":3,"cool":2},"Z6a8eRDPiDFKiGhQmj2U0Q":{"text":"Wanted to try a drink from the oldest bar in America and The building definitely looks as ","useful":3,"cool":5},"JZ192pg-2uz9BEv2gTOFaw":{"text":"Really adored Lafitte's. It completely takes you back in time - apart from the modern bass","useful":0,"cool":2},"__1hzsiETplAr19tcSmA9g":{"text":"Stopped by this place during a Ghost Tour. Lots or crazy history here, including killings ","useful":0,"cool":0},"P-5P5pegLg0-_eDMU-OggQ":{"text":"Great people watching!!\n  Friendly bar tenders! \nGreat drinks! \n   Perfect for an afternoo","useful":0,"cool":0},"6C6TaVo3yJHHuROowDFygA":{"text":"We went on 11/06/2015 during our Superheroes & Villains Pub Crawl. It was fun listening to","useful":0,"cool":0},"8BZ7pe-KlzdQxxKrWf194g":{"text":"This place has a ton of history! Built in 1772 and reported to be the \"oldest bar in the U","useful":4,"cool":5},"h1oAAofEYV0sgkMz9s0r8g":{"text":"The voodoo daiquiri was the start to quite the eventful night. A must have on any visitors","useful":0,"cool":0},"4LJZ_-sT9hDl6f0IhGEdqA":{"text":"It's the old haunt.... it's the bar you go to when you were growing up because you underst","useful":0,"cool":0},"OLBw3f3F6GNjU2ZDxImLkA":{"text":"Ok, if you go here knowing that it is a dive bar, then its not so bad. Their hurricanes ar","useful":0,"cool":0},"vZJIx2U7DHUmVkL2FO0jJg":{"text":"Nice place to stop by when sight seeing. Had to try the voodoo daiquiri and wow was it sug","useful":0,"cool":0},"Lk4-jqLmv7xcrpwkH96MBg":{"text":"New Orleans is known for amazing hurricanes and many flock to Pat O'Brien's for this drink","useful":5,"cool":2},"Xc9S3K892NRLgDDzljUkPg":{"text":"Absolutely fantastic. Great feel. Great music. Great drinks. You can't beat this place. Gr","useful":1,"cool":0},"BJW5KJrPXf6EFvFXsPbKkA":{"text":"Visited Lafitte's after hearing that it is the oldest structure to be used as a bar in the","useful":0,"cool":0},"VR-CjLCPDoKaotTuSUMebg":{"text":"I love the idea of Lafitte's, I don't love Lafitte's. \n\nWhile many a gentleman say this is","useful":14,"cool":10},"PUf1SvysPIQ1dRk53CBp9A":{"text":"Amazing time. We came here almost every night during our Nola trip and I will always stop ","useful":1,"cool":2},"9A3z4xD3cRosr2GMGUmxeQ":{"text":"Hi Nikita, thanks for visiting Lafitte's Blacksmith Shop, the upstairs is\nthe office, all ","useful":0,"cool":0},"4X9N4-gkik07KH9vy_Qn7w":{"text":"After my reading, I wandered down the street and found Lafitte's Blacksmith Shop about a b","useful":4,"cool":2},"JEgIf5YfaPIg4MyAmRmskQ":{"text":"If there's one bar you visit in New Orleans make sure it's this place. After all it's the ","useful":0,"cool":0},"mchENZpWbjEri0N2GqmNiQ":{"text":"This seems like a fun spot to spend the night, they had a crowd coming in for everyone.  T","useful":1,"cool":1},"97eIl8L4Lgl5MLiPfEODcA":{"text":"Egg Nog Daiquri was super yummy but had no kick at all. The boy got the purple monster and","useful":1,"cool":0},"qkAhq3beehAW6BsYF21b7w":{"text":"We came here after hearing about how it's one of the oldest bars in the country. It's dark","useful":2,"cool":1},"MLf73guVjFbefIycbTvJlQ":{"text":"Lafitte's is a crazy little piano bar in the French Quarter that I happened upon while tra","useful":4,"cool":5},"TpoCJqR-safgShF2NpxRRQ":{"text":"Easily one of my favorite bars on the strip. Oldest standing structure that is a bar...yad","useful":0,"cool":0},"CpipYUYfsG11hfc9cxsEVw":{"text":"I'm sorry but this place was highly overrated.  Now, I fully understand and appreciate hit","useful":3,"cool":1},"qQTChHYwMh-BxZRzsQNc_w":{"text":"The location is historic,  but definitely not a place with a lot of nostalgia for its past","useful":0,"cool":0},"FsazfUtrCyzeLirltPTUmw":{"text":"My boyfriend and I were in New Orleans in early February and were walking down Bourbon St ","useful":0,"cool":0},"uLuvzv25szqG3j_xJ7vDxQ":{"text":"Cool dive bar. Really small but a good selection of local beers. You can just order your b","useful":0,"cool":0},"vHPSKbFfaqo6GgsaZGPd6g":{"text":"Another excellent dive bar.  \n\nFar enough down Bourbon street that its not super-touristy ","useful":1,"cool":1},"idVnUK81tMetJAaaDOm_cg":{"text":"As o e of the oldest bars around, this little piece of paradise is in the French quarter. ","useful":1,"cool":1},"m3Mr4vUJLldUeht4W0pBNA":{"text":"Purple drink   oldest bar in the country, and that's exactly what you're getting.  Sat out","useful":0,"cool":0},"PRWZeo21QTkFt2fSWH2x9A":{"text":"Was traveling for work and had to check out the oldest bar in America. Pretty fun, but don","useful":0,"cool":0},"a_cxl9hzf2dquySNwD-obA":{"text":"The voodoo daiquiri from Lafitte's was my favorite drink during the trip to NOLA. It came ","useful":0,"cool":0},"98IcWuR2hADRot2zU5P2KA":{"text":"His is a must see stop in New Orleans.  The countries oldest bar - and it looks it (which ","useful":0,"cool":0},"pbYritRV7dMwigSy7tAEmQ":{"text":"Can't add much to the 400+ reviews already here, it's one of the oldest continuously runni","useful":2,"cool":2},"0TX-mXsijI2m7E2SpGIUfA":{"text":"Great place to hang out on far end of Bourbon Street away from much of the noise and neon.","useful":1,"cool":0},"Gaugk_FEElcCC8yWMzXglA":{"text":"Oldest bar in the US and still the best dive bar in town. Great atmosphere and good music.","useful":3,"cool":2},"VJ3_mcyOO5_4aXc_zu7e6g":{"text":"Love this place. Went with my boyfriend on the ghost and vampire tour and ended up at this","useful":0,"cool":0},"SdxfyUx2hU6jlHkxec9EIQ":{"text":"Was told I needed to stop here if I was visiting Nola so I made a point to come and I'm gl","useful":5,"cool":3},"yjgJLCEqR2ILVQCLFsGaQQ":{"text":"Pre-COVID review\n\nLafitte's Blacksmith Shop Bar is one of the oldest buildings in New Orle","useful":18,"cool":14},"humoH8xmlfp2HyR8nX7yjw":{"text":"The oldest bar in the country is still one of the best in NOLA!  They're taking the pandem","useful":14,"cool":13},"9ZQl88sRkoc9ADZg4mDHhg":{"text":"This place is a total $H!t$h0w...but...that's what Bourbon Street is all about, right!? We","useful":21,"cool":20},"vvvSE_MNAdD9DSqn4vFGEw":{"text":"Touted as the oldest building/bar in the USA with 1722 origins. Ride out the next hurrican","useful":11,"cool":8},"AfwgCiQWF9h8Mv3Df2Nmqg":{"text":"Super old and seriously cool corner bar. Seating out front. Seating around back. Seating o","useful":0,"cool":1},"vAO_1oXpph2gsY5ytRIhYA":{"text":"Lafitte's has a unique vibe. Nestled in an awesome historic  building Lafitte offers class","useful":1,"cool":1},"8DZ8pFtpKpVqqLu0vmndBg":{"text":"If you're reading this, you're almost definitely not local (and obviously neither am I), s","useful":3,"cool":2},"Cd9TlDC47-qKpBqsEFjwrg":{"text":"Love this bar. Tons of history here. Oldest documented structure to be used as a bar. It's","useful":2,"cool":0},"jyZrG6IYpLQkQwhc8xQqjQ":{"text":"Lafitte's Blacksmith Shop Bar is one of the oldest bars in America. It has been active sin","useful":3,"cool":3},"t0F205NQxSudI6V2YEhYoA":{"text":"Supposedly, this location used to be where the pirate Lafitte had his shop and supposedly.","useful":11,"cool":11},"FFeHdmxcMifMFvIXElftLQ":{"text":"The most disappointing place I went. I was so looking forward to a nice experience. It's s","useful":3,"cool":2},"UlJGPMU1BU_G3AVsarOkjg":{"text":"Oldest bar on Bourbon, eh? Oldest bar in the US even! You're trekking down Bourbon to a po","useful":10,"cool":3},"o08hzOHkdZ8PB9Rl0GaiBQ":{"text":"I love dive bars, I love frozen drinks, so naturally I love Lafitte's! While asking friend","useful":18,"cool":15},"qKEfv2zzxgHpeex2ojrehw":{"text":"I first visited Lafitte's during a walking ghost tour two years ago. I've visited the bar ","useful":2,"cool":1},"9bqT609MJ6HSvBUGI8sZnA":{"text":"A must-see for tourists.  Despite its fame, it wasn't too packed on a Friday night around ","useful":0,"cool":1},"SXM9SxjSDntTRgVP85ufeg":{"text":"Don't get the purple drink.\n\nI mean, you can. I just wouldn't ever again. It's a guarantee","useful":1,"cool":2},"CMcTAKgTtVGu1yFNl41Bcg":{"text":"What a unique spot!  So glad my Yelp app alerted me about this must stop!\nFor starters thi","useful":5,"cool":2},"PEeRqjtcPznk5_JB_C9lDQ":{"text":"This is a place we stopped by a few times as we were on our way back to our hotel before e","useful":1,"cool":1},"wvin7I889Qy0WjzcCkHwjg":{"text":"We went here because people kept telling us it was the oldest bar in the U.S.A. and like t","useful":2,"cool":4},"aZrn5VcfH52jzZuypwt3zw":{"text":"The voodoo daiquiri is so good. But that thing gets you f***ed up before you even know it.","useful":3,"cool":3},"0Tkbq4r7O8EkGXrsuc5hgQ":{"text":"hands down one of my favorite bars on Bourbon Street. The history of the building is aweso","useful":1,"cool":0},"pAN4sitaPyS05RvKUJCupw":{"text":"A New Orleans classic, you have to at least stop in for a drink. Just a little bit down fr","useful":1,"cool":1},"VTW4gFT_U4uWSRLwTta3RA":{"text":"What a clusterfuck this place was when I visited it during Mardi Gras, but I get the sense","useful":6,"cool":3},"T6LbWjb28L1u7coW12fYSQ":{"text":"Just stop by to see the fireplace where someone's eyes popped out after his face was held ","useful":2,"cool":1},"evGKeQ0H3BiwfihbzzZquQ":{"text":"If you want to go to the oldest bar in the US then you have to stop by this place! Apparen","useful":0,"cool":0},"vCQd9LDD2upbTV69fAhjzg":{"text":"I will preface his with the fact that I did not have a drink while we were here - we were ","useful":1,"cool":0},"NMg91C6S0eX04J08bpp1ow":{"text":"Rude bartender, long wait, terrible beer options. Not worth it. Lots of better places to g","useful":0,"cool":0},"XAmV-GICx9QnIPpe-lr6JQ":{"text":"Oh god it's so hard reviewing places here :(! I hate that I'm not day drinking here right ","useful":0,"cool":2},"E2nSAJlD0XLYtVPRf2d3mw":{"text":"Loved it! The piano guy played everything from guns n roses, nine inch nails, to journey. ","useful":1,"cool":0},"wCGV2MO43uyybu0YP1QKIA":{"text":"I am in love with this place. The ONLY flaw is that it is a LONG walk down Bourbon when dr","useful":3,"cool":1},"wLRQ1c2TyvnXXKIJ69AAww":{"text":"Stopped here as it was near where our ghost tour ended. Pirates used to own this back in t","useful":1,"cool":0},"XHsfopb2U7nv7G5rjiR8uA":{"text":"Dark, old, spooky (in the best possible way) -- this place is so crammed with history that","useful":1,"cool":2},"4w9m9qOqSTj1Nr-eCUK4sQ":{"text":"Ever since I saw this on an episode of of Drinking Made Easy (anyone remember Three Sheets","useful":4,"cool":0},"3QqF9sgIWZWwL7Ab6gmr-Q":{"text":"Was there on a Sunday evening. Tried couple of drinks on the bar. Most important is the am","useful":0,"cool":0},"wVp00tlsYC_QUOIN6M8Qcw":{"text":"This is the coolest bar on the planet. \n\nOne of 3 buildings that didn't burn down in the t","useful":2,"cool":1},"tVeTMitBnoBywLYIGRplrA":{"text":"We were taken here as part of a ghost tour we did. The tour guide informed us it was one o","useful":1,"cool":0},"8741uoXVMnUaWq122Vl8yA":{"text":"One of, if not the, oldest bars in America. Make sure to get the \"purple drink\" and if you","useful":7,"cool":4},"4jsVpx4TwZvi9OTlI8_XSw":{"text":"I absolutely love Lafitte's Blacksmith Shop.  You have to stop in here while in New Orlean","useful":3,"cool":2},"o06cBpIwRQ3beupG_wuAzg":{"text":"Oldest bar in the Country!\n\nWe came here during Mardi Gras season in February 2020. This y","useful":66,"cool":66},"pqpJ45p-yxxXhQ-iXv4XbA":{"text":"This is the oldest running bar in the states. It has some cool history/legends if you are ","useful":1,"cool":0},"5cBRo_L6NcnOpdkaY3j-cw":{"text":"Lafitte's is your last stop. Fr fr.  Located at the end of Bourbon past all the other bars","useful":3,"cool":3},"yjnlD7aQN6MQB8XO2wOX9g":{"text":"Word 'round these parts is that Lafitte's Blacksmith Shop is the oldest bar in the entire ","useful":15,"cool":9}}