{"N3WJdC-sN1g3Fypue5LazQ":{"text":"Great time here with a pre wedding manicure and pedicure. Very friendly staff. Loved the m","useful":0,"cool":0},"mInd7JYaguIsT12Ln8vT-A":{"text":"I tried this nail salon for the first time last week.  I found everyone there to be very f","useful":0,"cool":0},"tyFqDt20Fbot6UWQa6CgSg":{"text":"First of all Fellas!  Don't feel like you can't come here! They are very nice and you'll f","useful":1,"cool":3},"w4Fq_Z9g55oWs52hXBb_FA":{"text":"Went for a manicure, looking for an ombre with gel polish, which I was told up front they ","useful":0,"cool":0},"DvNWwzrrOuWmj6Tuu4SXnw":{"text":"Had a great experience here in this lovely and clean salon today. Someone recommended it t","useful":1,"cool":1},"LlqghDcFf31IKpSPAxurog":{"text":"Nice place, bad service. Felt like the lady doing my manicure would rather be anywhere but","useful":0,"cool":0},"iFez_p2UjNbSUWgSAtF1Dw":{"text":"Blanc Beauty Bar is an oasis, a chance to relax in a beautiful, easy going but professiona","useful":0,"cool":0},"2AbzLwARXeUqXOGPbnCQtw":{"text":"This  is the best nail salon experience I have ever had. Their hospitality is fantastic, t","useful":0,"cool":0},"1wQc8dEsfDueWR9TCRAyCw":{"text":"Came to this beautiful beauty bar on Magazine for a pedicure and had a great experience! T","useful":0,"cool":0},"S7WyPIV0OxA3l3lnnEgzkA":{"text":"Fabulous salon with excellent, well-trained staff. It's always a fun \"treat yo-self\" exper","useful":0,"cool":0},"_68SLOOgXn2g9Hvfo7uzSQ":{"text":"Amazing nail salon. Great vibe. Amazing staff. The best in the city! Super clean. They off","useful":0,"cool":0},"G0vKpvCfKOXKQbSvEy_XMQ":{"text":"Took my daughter and I last minute even though they were about to close...which was greatl","useful":0,"cool":0},"e9EppbwDHsBRIF7GXwOUUA":{"text":"Clean, sleek, and sophisticated. Thuy took her time on my mani/pedi and I would have to sa","useful":1,"cool":0},"570B0UN95n_-GO8_P4XS5g":{"text":"STUNNING. This place is definitely a hidden gem in New Orleans. It's so modern & chic. I w","useful":0,"cool":0},"G1hwOpuO_7yVnk9AouyTQw":{"text":"Chris Rock once said, \" Women only need three things to exist: food, water and compliments","useful":6,"cool":2},"IxWS9pENU6WM5XmxkRZLyw":{"text":"Thuy and Khoa have the best, freshest polish and maintain such a beautiful, clean atmosphe","useful":1,"cool":0},"qZ4zzVlnLQEoat7lq-ZlBg":{"text":"I love Blanc Beauty Bar!\n\nJenna Perritt is the most amazing colorist! Her work will not di","useful":1,"cool":2},"C3whDP-toZQsqPo8sB6PKw":{"text":"I hate to have to do this because my first experience was so wonderful, Jana made me feel ","useful":4,"cool":1},"zBKVUxqvxVkco4slRBU7vg":{"text":"The place is recently refurbished, with a beautiful decoration and comfortable chairs (not","useful":0,"cool":0},"jqhaC5p5Tec-6VNEkq4fzQ":{"text":"They did a good job, but the service was absolutely horrible.\n\nWhen we first got there, we","useful":5,"cool":1},"9Ki50wHcNU9LLiMVH9-H8A":{"text":"I got my nails done back in August for my bday! Prices are very affordable and the service","useful":0,"cool":0},"GZZjTz2uqVEhqDGRb8vUUA":{"text":"Very nice and clean salon, we had a group of 9 and everyone that worked on our group was v","useful":0,"cool":0},"7rYZlaTuubNwppc-Uc4qGg":{"text":"This is the place of been dreaming of all of my life...AMAZING manicures and pedicures! No","useful":0,"cool":0},"ZpH-_zSSuB11kTVp9Fgwhg":{"text":"Hated it. I never write reviews, but the service was so awful I would like to save someone","useful":0,"cool":0},"tkMYG5VicWgGlwGn9aEidw":{"text":"Great dip gel and pedicure. Lots of colors to pick from for pedicures. So many my roommate","useful":0,"cool":0},"wsOgEpTOizgSvybP4xypQg":{"text":"I got a full set here with Crystal. She did really nice work and was very personable, as w","useful":0,"cool":0},"ND3F1WLCtDbAY606xv_FLQ":{"text":"Very nice atmosphere. The staff was all very courteous and Lynn did a great job with my pe","useful":0,"cool":0},"O-hBcXWyRRFMP9WBre1few":{"text":"My favorite place to get my nails done! The staff are amazing! My gel manicure has lasted ","useful":0,"cool":0},"mWRwllGkY4bwloM7WkoC5w":{"text":"One of the worst experiences I've had. Upon entering this facility, it took more than 10 m","useful":0,"cool":0},"6gkqxwCpDe7LMj-1j1db2w":{"text":"Pros: \n- Amazing owner who has hand picked a ridiculously awesome staff! When I first star","useful":0,"cool":1},"VpA5lo5vHU4JgAJbILVivQ":{"text":"I am visiting for the holidays and needed to get a mani and pedi done so it was my 1st tim","useful":0,"cool":0},"N9FIZkU4Yqmd-JSDIL2DQA":{"text":"One of the worst experiences I've had. Upon entering this facility, it took more than 10 m","useful":1,"cool":0},"1QMtRJkS0NLI8FPCBicqjw":{"text":"Best nail experience in NOLA in 4 years of living here. Blanc has a beautiful atmosphere w","useful":0,"cool":0},"TS0g6A7_bEDKaSqS5FUfNg":{"text":"Such a cute place! Love my gel color nails and the service is so welcoming and relaxing!","useful":0,"cool":0},"0MX3q7SosAegJd0Gdv7iRA":{"text":"Great service but call ahead always to make sure they have availability! Always does a tho","useful":0,"cool":0},"1RSq7SoyMQmJVfcndP7j5g":{"text":"The space is absolutely stunning and the staff is attentive, meticulous and extremely frie","useful":0,"cool":0},"9uCfH55USlqXYhax0QW0iA":{"text":"I have been looking for a good nail salon since I moved to New Orleans. I really liked thi","useful":0,"cool":0},"_Bmp5pmk7SwJz_R1p1ougg":{"text":"Kiara Reeves has been my hair stylist since May 2014. Since that time, she's moved to this","useful":0,"cool":0},"A8ULSfy9RH7GffxxGPn_dQ":{"text":"The facilities were beautiful and I was happy with the selection of nail polishes availabl","useful":1,"cool":1},"IrukZi9JN6NOC0ygrRWRyQ":{"text":"I just moved to the area and someone recommended it.  There are many nail salons to choose","useful":0,"cool":0},"gOVIU9Zikh04GnH8f8sn7g":{"text":"Every person there makes you feel welcome and as though you are their most important clien","useful":0,"cool":0},"1QglSs2s3US0MEJ9yPrTRw":{"text":"I had such a great experience at blanc last week. I called last minute and they were able ","useful":0,"cool":0},"5nxlpI62iMxPA_GwrP57yA":{"text":"Update: \n\nI was able to speak with the owner, Thuy. She was very apologetic for my previou","useful":0,"cool":0},"Ae_SAGAMUJNwm4RRyzgj-g":{"text":"Hated it. I never write reviews, but the service was so awful I would like to save someone","useful":0,"cool":0},"WMgMcs_uFXz5OB8P47t_Dg":{"text":"The next day, my day off so no work or water polo, my first nail started peeling.  It has ","useful":1,"cool":0},"ejhd6DGoARbz5AhiHlfADw":{"text":"This is the place I've been looking for!!! The atmosphere is very spa like. Clean colors, ","useful":6,"cool":5},"EUPTMqsO46XYf983P0AK3g":{"text":"I had Jonathon Baxter style my hair and all I can say is wow! Five stars really don't do t","useful":0,"cool":0},"xIvCyqCjjWX8b1lE_2lDsA":{"text":"Tried this place today for the first time and am very pleased! It's beautiful inside and t","useful":0,"cool":0},"S6wTahkJXv10Ti55j8Tghg":{"text":"The most chic, freshest atmosphere that is both a nail and hair salon in the city of New O","useful":0,"cool":0},"XVBANukJPE9IX3K05qlZQQ":{"text":"This is a beautiful place to get your nails done. I trust everyone in here because they ar","useful":1,"cool":1},"fYpZZGsKQ0YwTSzbAcHXuA":{"text":"*i only got my eyebrows done here so please don't take this as a review for the whole salo","useful":4,"cool":1},"KMNSzmkU6LEfZIJ8r4-j-w":{"text":"I have been here for the past three years. I had a regular nail tech but when he left, so ","useful":2,"cool":1},"fOjOgQDpm_4kC3W6fINT6w":{"text":"I'm always happy with my gel mani/pedis and Meghan Doyle is an amazing hair stylist. Her c","useful":0,"cool":0},"Ge_QAyPEzI72VLEN4VFUuw":{"text":"I went in yesterday after discovering this new place on Yelp. \n\nFirst, let's just talk abo","useful":1,"cool":1},"MEDcmrrytJBc99IqX2ZfSA":{"text":"Awesome experience. Every single person I encountered was so friendly and Kathy (or Cathy?","useful":0,"cool":0},"QvhCxpoo5PMU6c9NyZEPBg":{"text":"Love. Love. Love. Second time getting a gel manicure and it is divine once again. I apprec","useful":1,"cool":0},"PpNXppqbwWsQ2tX5twjUBA":{"text":"If you want dip nails go elsewhere!\n\nI called a few days in advance for a dip polish chang","useful":0,"cool":0},"hLSIkac_p8kDHPf8AV7rBw":{"text":"Had a gentleman do both my Pedicure and Manicure. Quality work, friendly employees, Over a","useful":0,"cool":0},"0NCPWKhWnOF6sfTtvjYvRg":{"text":"Second time here! I followed my nail tech., Quyen, from another place, she's amazing- prec","useful":0,"cool":0},"h3dpr9lBvx1bzUqqxaByyQ":{"text":"Seriously, this place is amazing. I went for the first time yesterday and got a much neede","useful":0,"cool":0},"ek-Y4OuhEUfHWoY8jNu2-A":{"text":"Walking into this modern beauty bar everything seems so relaxing and quiet. Not your typic","useful":6,"cool":7},"nPW9hck2M7BG7oWy6TvtZQ":{"text":"Awesome new space.  The staff does a fabulous job with manicures and pedicures (mine still","useful":0,"cool":0},"uSDPGlueYBbHQRxOxOYc7A":{"text":"This was my first time here after a friend recommended it and I was pleasantly surprised! ","useful":0,"cool":0},"KTZAYNnWbeKDlVjHlY1JOw":{"text":"Excellent nail bar. They offered mimosas so I immediately loved them. They did excellent w","useful":0,"cool":0},"CO4wid-dcTxK8l4pO9F18Q":{"text":"Great Pedicure. The girl was awesome can't wait to go back. The vibe and set up was super ","useful":0,"cool":0},"DOD3Zm-2NcfaCZkZub9YSg":{"text":"What a great place in Uptown to get a mani/pedi.  The salon is fresh, clean and modern.  T","useful":0,"cool":0},"DK4fCTPZTMig-ahIr25GLA":{"text":"You can make an appointment and don't have to wait for an hour while your feet \"soak\". Bes","useful":0,"cool":0},"d8qLCm9yW-xRCHD5Sq0N4Q":{"text":"Another master piece! Eyebrows and dip nail that got me ready for the weekend. I never do ","useful":0,"cool":0},"OR_EGrLUFacKpa3JPdrNMw":{"text":"Jana gave me the most amazing mani and pedi. But I returned and had a horrible experience.","useful":0,"cool":0},"GyQnCcQQl_zXnruV6P3Z5Q":{"text":"This was literally the most underwhelming experience I have EVER had at a nail salon. Don'","useful":5,"cool":0},"qVl1Mkz6UX0JD_GKFUB5Vw":{"text":"I have found my go to nail salon! Emily and Thuy did an amazing job giving me exactly what","useful":0,"cool":0},"rM7xe68gRW-0ng6bVBaBtw":{"text":"So yesterday I started looking for an eyebrow threading place in the area since my normal ","useful":4,"cool":1},"3M6l3Y9RxummXiqvzhpjBA":{"text":"I had a nice experience here getting a gel manicure. The decor is very soothing and zen. T","useful":2,"cool":1},"f6Zwvv2eHn62WRHlapQQWA":{"text":"I absolutely love this place. Everyone was friendly and made sure I was relax and well tak","useful":3,"cool":0}}