{"-0-wG5Wfkn-7gqtzY1YXjQ":{"text":"We called this place to see if they deliver. They said it would be an hour for delivery or","useful":0,"cool":0},"fTaEqYjpHazTLoTu0--U2Q":{"text":"I called and ordered 2 large pizzas and the person taking my order told me that he was rea","useful":0,"cool":0},"LkBSb4MGY9vjxU_G8k5sjg":{"text":"Perfect little Italian restaurant that has great food at an affordable price and seems lik","useful":0,"cool":0},"5y16G1kHYxyGadzijoercQ":{"text":"What a great little find. We were staying near the center of the French Quarter, so this p","useful":0,"cool":0},"EWDrr_hCxueM833f7iInTA":{"text":"We were on an hour wait, and the owner wouldn't even let a person in our party use the res","useful":0,"cool":0},"pNqtRKDKuB0k8TjuQDmD6A":{"text":"Great atmosphere. Sandwiches has lots of meat and extras linguini with claims in butter le","useful":0,"cool":0},"Xp6MopRaJtORlvID66u6xw":{"text":"Got a referral from a nice lady in a shop up Royal Street \" it's a favorite locals place \"","useful":0,"cool":0},"boe5txPpYtS_3k1MSOEdbA":{"text":"Great meatballs! \nI was craving spaghetti and meatballs and my trustee yelp told me to com","useful":0,"cool":0},"TIg1r3irz5TqznzaVY1r9w":{"text":"It was such a great experience having dinner in this resturant! A cozy environment, Delici","useful":0,"cool":0},"CCDO_BcPeorvKzX9RoFm1A":{"text":"The best meal I have had so far in New Orleans!  I had the Mardi Gras Pasta- yummy!  There","useful":1,"cool":0},"pfblfgAWaIyYQnP7LnbIMg":{"text":"A quieter place though still in the main tourist region of New Orleans. We came here becau","useful":1,"cool":1},"ufZS4XecaBcGIRzDYGQJ8Q":{"text":"This restaurant was not listed anywhere on Yelp when I searched for \"Italian food.\" \n\nWe f","useful":0,"cool":0},"3f66Mxj6WoabVhZpFwYFXg":{"text":"This place is darling. And it has pretty tasty Italian grub. Totally check it out if you'r","useful":0,"cool":0},"QX0PkJI-1V1smDALs1dQyQ":{"text":"Solid 4-stars. I felt like exploring my lovely city last night.  Solid 4 stars. I don't li","useful":3,"cool":3},"uDgN2Ev0ppm-m9hqxFOZyQ":{"text":"This is one of my favorite restaurants in New Orleans. As a resident of the French Quarter","useful":2,"cool":0},"WhoPeT6m11KkAL5Ni40t4Q":{"text":"Reasonably priced. Laid back. Nice local joint in the quarter. Safe.  Pizza is good (Slice","useful":0,"cool":0},"mY_QNoV3ScleJ5GFKQkPdg":{"text":"My go to when I'm in the quarter and want to get away from swarms of tourists. The food is","useful":0,"cool":0},"fn_RgEDbsurupB4ZwQRqPQ":{"text":"The food is tasty (I had the spinach lasagne and tiramisu) but I have to add my voice to t","useful":0,"cool":0},"rX1wsopj5fvb9Wd1M0aSYw":{"text":"Great Italian food. My sauce was so authentic and the pasta was served piping hot.   The g","useful":0,"cool":0},"fZ0m7ldXN8irWD1F3tLfCg":{"text":"Stopped here for dinner with a friend the place was packed. The decor is fun with all rand","useful":0,"cool":0},"QGQJwDSxSScfXzxuBKupvw":{"text":"Loved this place. Cutest decor ever, great food, good value (the little cheesey bread they","useful":0,"cool":0},"m_WS8EuwzzqrjMoI0M2SOA":{"text":"Ate dinner here last night with my daughter and husband. Really enjoyed the ambiance and t","useful":0,"cool":0},"aLPnHyGohj4h1tiiuN9AhA":{"text":"I live in the Quarter and this is one of my favorite neighborhood restaurants.  The food q","useful":0,"cool":0},"t7hbJVaiHY_--3vpEuL4Cw":{"text":"Excelent charming restaurant. The food (lasagna and meatballs) were absolutely delicious. ","useful":0,"cool":0},"GXOeJQI68tLrJRWVKFoQBQ":{"text":"Awesome. Very simple but delicious food. And cheap. For New Orleans it wasn't too touristy","useful":0,"cool":0},"fkS3tdO4Sd08cOm1YNmXSA":{"text":"The veal that my mom and I shared was AWFUL. My sister's \"stuffed shells\" were absolutely ","useful":1,"cool":0},"13BSDImJChsdbjpjmwitNg":{"text":"My husband and I love this cozy neighborhood restaurant!  This is a wonderful place with g","useful":0,"cool":0},"lQa4n7viyi_iU28DseVRVg":{"text":"If you are really hungry, then go to Mona Lisa. The entrees are big, and they come with a ","useful":1,"cool":0},"97rHnpfbBWfQ2pSiBI09tw":{"text":"Recommended by a local as we were hungry and wandering on a Sat night.  Perfect spot for a","useful":0,"cool":0},"zIfpQc5UN59TiuH_xRdIgg":{"text":"For some reason I just didn't like the place. I chose the wrong meal, so that's my fault. ","useful":0,"cool":0},"TfVmj55Rwr7-Z6yVzNQhUg":{"text":"Very unique Italian spot in the French Quarter. The manager runs a tight ship here. He han","useful":0,"cool":0},"EYUS9mpPQyZJwbncgYtRuQ":{"text":"This was a great place for thin-crust pizza.  I tried the vegetarian, the garden and the M","useful":0,"cool":0},"H8708AHMGLd7-sN6U2-rGg":{"text":"Went for pizza but ended up with veal Parma, side salad with killer house feta vinaigrette","useful":0,"cool":0},"cWACR40gfBOU__QZJcM3JA":{"text":"This was a really good lunch spot! It wasn't crowded and the food was actually very good! ","useful":0,"cool":0},"M9KXTIr-2Xy24ZnRPjsgIg":{"text":"I still love the salad, especially the Mediterranean salad, but lately the pizza just isn'","useful":3,"cool":1},"4G9VwMmjiSwxYZF2j4oFMA":{"text":"In a word: unimpressed\nThe food really had no flavor. From the Cesar salad (that tasted li","useful":0,"cool":0},"z035t_eviOv-VPrwAk70JA":{"text":"As soon as I walked in I was delighted to see the artwork on the walls. The restaurant is ","useful":0,"cool":0},"na-3BaMl6EpH4zrqZ4IEYA":{"text":"The hotel recommended pizza from this place, and the Yelp reviews were pretty good, so I d","useful":0,"cool":0},"-LhN07qhtzghYxRfG0bLkw":{"text":"If you enjoy red baron frozen pizza then this is the place for you.  We had the mona lisa ","useful":2,"cool":1},"X28P5Q3cQMsJH0Y5vX94mg":{"text":"Love this place and always pay a visit when I'm in town. However, I must dissuade people f","useful":0,"cool":0},"_JIprcDVbKG3vylvDk5BUw":{"text":"Our first visit was fantastic, and after a second.. I'm naming it one of my favorites. The","useful":0,"cool":0},"FDHZeDV5MRiAf6WvuRHYfA":{"text":"This was my favorite dining experience in New Orleans. The place was small intimate and th","useful":0,"cool":0},"2-6vMckgxGeBZWPZuaMV2Q":{"text":"When we are in a new town my husband (a Chicago pizza lover) has to try the local version ","useful":0,"cool":0},"9hRYYjFWiyOPvVzgOAKdKQ":{"text":"Loved that every picture on the walls was a different Mona Lisa! Great authentic Italian g","useful":0,"cool":0},"Qp77TCs40qYqb44ebmWW2Q":{"text":"Cute place with all kinds of art related to Monalisa hanging on the wall. I got the seafoo","useful":0,"cool":0},"5stIxb8T6W2DQ-wF7aaKpg":{"text":"I, too, had high hopes for Mona Lisa. The restaurant itself is nice. There was four of us ","useful":0,"cool":0},"8wfJt1z9C0IlZ6B4a0jz3w":{"text":"When visiting the big easy, our group always goes to this place and we love it.  Its a div","useful":0,"cool":0},"WKdqglA4I1n_bGo-tn8jGQ":{"text":"Great Italian vibe w/pix of Mona Lisa everywhere, small and cozy but has a couple great wi","useful":0,"cool":0},"8BYOSNilFSRTViKjyDrg8Q":{"text":"I had dinner at Mona Lisa on New Years Day.  This was my 4th trip to this French Quarter g","useful":1,"cool":1},"hxUzQRW4t-uOQgEqpIa52A":{"text":"Great place. Try the artichoke dip and NY style cheesecake.the staff was very warm and fri","useful":0,"cool":0},"CRE-PNPMuol-DX_ebObiJw":{"text":"On the east end of Royal St. away from most of the bars and hustle and bustle of the Frenc","useful":0,"cool":0},"vP9edl0FZEFhZ7O8dm0OPQ":{"text":"I love this place we come here every time we are I'm Nola the owner is a little hateful bu","useful":0,"cool":0},"-Iz72ifsP6RVtIAgBuL6Yw":{"text":"Cute little place but, I'm hoping ours was an isolated incident, the food was pretty awful","useful":0,"cool":0},"2izuVN8KjqwINtSISmLh9A":{"text":"Hidden gem in New Orleans!! We've been visiting the city for 15 years and just discovered ","useful":0,"cool":0},"_IPCf1QFGPHGnmULtb0fpA":{"text":"Yes!  Finally an understated, romantic, no hour wait, authentic, great value, great servic","useful":1,"cool":0},"POwDgcj94IWdmpR6RhntSw":{"text":"We wanted to like this place.... But after 45 minutes of waiting we find out none of the i","useful":1,"cool":0},"eREPISQOmIbyQVSDIWLrbg":{"text":"This place is really great and very welcoming...but only if you can find it. Firstly, the ","useful":1,"cool":0},"MSg0Xwy6MGTTnDmTROfsRg":{"text":"Love this place! Great food with good portions! And the environment was perfect! It was th","useful":0,"cool":0},"P4pBlFxMWqlOmSLjZpBJpA":{"text":"After five days of eating Cajun/Creole style food, we felt we needed a break and looked fo","useful":3,"cool":2},"H1V-JYhj4seg9TbJYBerNw":{"text":"We loved our dinner at Mona Lisa! The artwork is entertaining, the food is good, and the s","useful":0,"cool":0},"-bFWaql8xn40nyD3KkuMbw":{"text":"\"Do you smile to tempt a lover, Mona Lisa?\"\nNo, she's smiling because this restaurant is s","useful":0,"cool":0},"gQiqQaM9Iip5tyf4BKh95g":{"text":"Solid, simple Italian food.  My g/f and I split an appetizer and an entrée, perfect for tw","useful":0,"cool":0},"nGhOdFCtd7qBPB1f-2CDBw":{"text":"One word 'yum'. Half and half large oysters and shrimp with fries, cold beer. Friendly pla","useful":0,"cool":0},"X0xlD_RdYmvWl2L8hLlLgw":{"text":"The food was great. The ambiance was amazing. Small little restaurant off the beaten bath.","useful":0,"cool":0},"Ji77p3p8SMddIyf1dd1fQg":{"text":"Our favorite dinner while at New Orleans.  Intimate, no wait (we got there about 6:15 p.m.","useful":0,"cool":0},"dnJP0_Ucx_J1sQdFSot3lA":{"text":"Twee avonden na mekaar langsgeweest. De eerste keer top! Niet het beste eten ooit, maar ze","useful":0,"cool":0},"CYsIeG-EKPx9rcthb2QvPw":{"text":"Not wheelchair friendly!! Just had one of the most bizarre experiences at this place. Walk","useful":1,"cool":0},"-vu9NIZiqQZjV3cPP1tBWQ":{"text":"Great little hidden gem away from the craziness. On a Saturday night we didn't have to wai","useful":0,"cool":0},"eZfarApTicpShcRnEpC-Wg":{"text":"Great food ! The lasagna is to die for! Great location too away from all of the loud noise","useful":0,"cool":0},"N5Wl4dUx9NR5t8udTOm0zA":{"text":"Fabulous food, large portions and very affordable! We stumbled across this place our first","useful":2,"cool":0},"KQAa-4F6JElX0l3MRYTU0A":{"text":"Very cute and great service. Plus a lot of food for a great price. They give you little sa","useful":0,"cool":0},"XnGTir9R_l5EKsWo_CEzNA":{"text":"Came here for my birthday. Very solid food, and the customer service and prices make it a ","useful":0,"cool":0},"89Kg16Hvb44-MLlx1WsgtA":{"text":"We found this place on a rainy night in New Orleans, just a block away from our hotel. Des","useful":0,"cool":0},"3qloS9RxvZjIfGwhG6nVVw":{"text":"I love this restaurant. We eat there often and enjoy it every time. I have read a few revi","useful":0,"cool":0},"RZ-CSkXQSGn61BcK4p6UFA":{"text":"Up front I have to mention that my friends are former partner/owners of this fine restaura","useful":0,"cool":0},"WGnUZEdCSw6yxsDUuEagGw":{"text":"The owner/host was great and so was the service. I had the Panteen chicken and husband the","useful":0,"cool":0},"QeQMGPHDpapdvD1AppYDGg":{"text":"Thanks to Yelp, thought they were open. Showed up with two hungry kids to find they are on","useful":1,"cool":1},"TWIgbo1GpXIcirlEGWPt_w":{"text":"After days of hustle & bustle in The French Quarter we found Mona Lisa's on a locals recom","useful":0,"cool":0},"XlbzhSZB5MR0CCu_IduNEw":{"text":"Mona Lisa is funky East Village sort of place. Walls are plastered with every conceivable ","useful":0,"cool":0},"DjRSAq1mtYNgVgvdud_p3A":{"text":"I love visiting New Orleans post Mardi Gras.... And I really live discovering little local","useful":1,"cool":0},"iTq7QwZmiRmFGKH6yJD8Ww":{"text":"Our best meal in New Orleans! As vegetarians it can be challenging, to say the least, but ","useful":0,"cool":0},"L3YpsuqV6u8_Omnv7E6z-A":{"text":"I came here because of the other reviews. The other reviews makes this out to be a great I","useful":1,"cool":0},"uJI8I1khRoveRmkK6u5SEA":{"text":"Fantastic dinner.  I ordered the first item on the menu (Feb. 2014), the Mardi Gras Pasta ","useful":0,"cool":0},"mrJB1u6QUAQDiKAAyIUSQA":{"text":"Great little Italian spot. Nice and quiet place with lovely food. Great portion size and v","useful":0,"cool":0},"kIjHgsfZVAv0WaQ8bS5PLQ":{"text":"This cozy little hole in the wall is always on my short list when I'm eating out in the Qu","useful":0,"cool":0},"g1x1_pCRdMsvOquKjRC7Iw":{"text":"Great Local Restaurant! Off the tourist path with delicious Italian food. Definitely a wel","useful":0,"cool":0},"qrhqlbuE5l78UH5SMovbQw":{"text":"This place is a piece of haven. Great atmosphere, great staff and great food. We order the","useful":0,"cool":0},"tpSXVYnypOWEqoaxTvFiNg":{"text":"Nice romantic little place with great Italian food at a reasonable price. Had the lasagna ","useful":0,"cool":0},"yJkOC-WscCQbIv_fOwkT1g":{"text":"The crispy chicken fettuccine Alfredo was good! The atmosphere was cool, the service was p","useful":0,"cool":0},"3Wt8QfIanHE_N0OrvCMhhQ":{"text":"The chicken parm is amazing. The lasagna was also tasty. Had garlic bread as an app- yum. ","useful":0,"cool":0},"vh0fmhphdP17OswEQ8BIHA":{"text":"Our family had a delicious meal and enjoyed the many different representations of the famo","useful":0,"cool":0},"LfiQZeXjTtu6VjBS4dxpNA":{"text":"This place was just great. When we first arrived I was upset at the line out of the door b","useful":1,"cool":0},"UPe-qLNS4aBjS82EwBoYwA":{"text":"oh my...\nI wanted this to be SO good, and it ended up SO bad...\n\nSo this past week, when d","useful":1,"cool":0},"zOTJd9DW_kLtuhfCgV86Jg":{"text":"This small restaurant is my husband and I favorite restaurant in the French Quarter. The a","useful":1,"cool":0},"X8XXL_m8HU3AjAF_2-rJMg":{"text":"Quaint Italian restaurant serving excellent Italian entrees with a New Orleans twist. My h","useful":0,"cool":1},"ufiVPsG4okiG2K6uCWx1uQ":{"text":"My friend really wanted to eat here, so we did. We were seated promptly. The food was fine","useful":0,"cool":0},"2pB8oilufV64e9UuHf9YBw":{"text":"Fantastic food, huge portions, reasonable price. One of the best meals we had during our N","useful":0,"cool":0},"O-HT2vR0rEcpTMXWznXw1A":{"text":"One of the worst pizzas I've ever had. What they brought out of the oven didn't even look ","useful":0,"cool":0},"KRM9pE_kT9UAB5PTsHIDyQ":{"text":"I grew up eating a lot of Italian food and am often disappointed when I go out to restaura","useful":0,"cool":0},"t2P_9GN5ptuheZ1DaO6Lsg":{"text":"The worst Italian food ever.  Pizza is not Italian quality.  This is a place you only go t","useful":0,"cool":0},"jV4MLoubrUHSZ8qOSTnxpQ":{"text":"We came here on the recommendation of our Uber driver and we are glad we did! Cute little ","useful":1,"cool":0},"DhmpUbSRmuAQiAQ8bdkssQ":{"text":"Very good pizza but I really enjoyed the Caesar Salad. Three guys and one salad was enough","useful":1,"cool":0},"K0m1RpgtlJO0upHUTa-trQ":{"text":"Love Mona Lisa!  I'm a homesick NOLA native who moved away - yet still a tough crowd when ","useful":0,"cool":0},"nZeuAWghuFVPGYPvVRTRKw":{"text":"It's off the beaten path so it was less of a tourist trap. After reading the reviews we we","useful":0,"cool":0},"QucCsML7wydOsTtBemKvgQ":{"text":"What a great local Italian restaurant in the French Quarter, great salads great pizza and ","useful":0,"cool":0},"rbwgT9vNACDfi1yGO535Jg":{"text":"If Mona Lisa wasn't in the dreaded quarter area, the owner would probably know my full nam","useful":7,"cool":2},"_zAuXfGPdeN5-btlL9QYgg":{"text":"On my first night in New Orleans I had the wonderful opportunity to find this charming hol","useful":0,"cool":1},"5hZBxrWZkEPBrHnSAy9DTw":{"text":"This is one of my most favorite places of all. Staff is tremendous, polite and go beyond t","useful":0,"cool":0},"amA-rLZTjFKvg3H1IMrJ4Q":{"text":"My boyfriend and I were in New Orleans for the weekend of Valentine's Day and decided one ","useful":0,"cool":0},"VSvfdLAePMYmh5lw6RwnKQ":{"text":"I'm really glad that I had my yelp app to find this place. It had a very quaint feel to it","useful":0,"cool":0},"f2gxNc9t6Oho-xEC73ETKQ":{"text":"Great little eatery that we take our family to each time we visit New Orleans. The wait is","useful":0,"cool":0},"s6iZuC1tKZXow-Dgslyc5Q":{"text":"Food was good. Service was good. Prices were fair. Pizza was good. Cesar salad was not ver","useful":0,"cool":0},"NXftPnZO7Lak1zpTii1aNw":{"text":"Great food for the $. The red sauce they use is very good - has a little kick which I like","useful":0,"cool":0},"s89MavztJvjFtpbBfPH_8Q":{"text":"Good food and great staff.  The meatball sub is a must-have.","useful":1,"cool":0},"K7A7yj7yqJO-4nCkVIbN5A":{"text":"Pizza is ok, pasta not so much. Service is really good and on point. Nice small place","useful":0,"cool":0},"TghgTEtrWUrx-1p3Kk-GIQ":{"text":"Five stars because absolutely everything was perfect except... the host when I first walke","useful":0,"cool":0},"cHAqj2flVa8W2lycAhnLaA":{"text":"The pizza is excellent and a nice environment. Pricing is a good value for the quality whi","useful":0,"cool":0},"SWCrTvrUOSWTK2Jzs0zNaw":{"text":"I love this little restaurant.  My husband and I come here all the time.  The waitstaff is","useful":0,"cool":0},"gk-eNKPrVb76ncvVNzLnnA":{"text":"This is a cute spot on Royal, away from the buzz of Bourbon Street. Family and I were look","useful":0,"cool":0},"116IL0SPhtdXWvEnBlyk6A":{"text":"Always pleased with the delivery food even if it gets here a little cold. Fantastic chicke","useful":0,"cool":0},"Qq5F_cknfxJpzNPOPLR5BQ":{"text":"Amazing food in a precious tiny location.  Their sign is a picture of Mona Lisa outside wi","useful":1,"cool":0},"t7RHmbc9Br5iyl2SopcdFg":{"text":"O.K. in the French Quarter for several days now. Had enough crawfish and oysters and stuff","useful":0,"cool":0},"xI4sum-sCbhe_jy3_DzqWQ":{"text":"\"Tasty, unique and lovely\" from another review sums up Mona Lisa's nicely. I'd add charmin","useful":0,"cool":0},"pk8SR-7XcXPQvPNkFielzw":{"text":"So amazing. You should know that the portions are very big. The food is soooo good. Very s","useful":0,"cool":0},"q1sPV8OeIgtqWeXvj3BuCA":{"text":"Great spot especially for a date.  You get to draw your own version of Mona Lisa on the ta","useful":1,"cool":0},"U9Xg1uPwQE_xvNruqoKtUg":{"text":"If you're in the mood for some Good Italian Food.  \nCome here. \nSmall and cozy and no caju","useful":0,"cool":0},"RS3hh3nmyvXFAEhuD61yrQ":{"text":"Ordered the penne with italian sausage...it was good and spicy!  Our waitress was attentiv","useful":0,"cool":0},"CUHGM8m3dCVPg60STttwlA":{"text":"Mona Lisa's was the cure for my seafood/Creole/Cajun rut!   Don't misunderstand I love Cre","useful":2,"cool":0},"KsxH3BYnTRc3vAl33hScXA":{"text":"We started Lundi Gras here.  Apparently, they are not usually open on Monday, but made an ","useful":1,"cool":0},"XmB-ktNc7qTk1JwntFlBbg":{"text":"We found this place according to tourist book and it was worth to try. It was a gem. Itali","useful":0,"cool":0},"Js-Ip6nkDZldLIu66dPZJg":{"text":"We stopped by here to satisfy our Italian food craving. Ambience was perfect for a nice ev","useful":0,"cool":0},"aLsf4B3tS1YGCo2ec1YAHg":{"text":"Unfortunately, I attended this restaurant with a party of 9. The owner was rude and ales u","useful":0,"cool":0},"ZmaCKMfVJiCI7JJhgh0BaQ":{"text":"Absolutely loved this place. Stayed in New Orleans for the night and wanted to eat where t","useful":0,"cool":0},"E0HbwpeQKlEXJyl7u2Vsug":{"text":"Excelente lugar muy acogedor , excelente comida todo lo que pedimos fue delicioso y los pr","useful":0,"cool":0},"1ZpUqQrFJ21LvqepjwYzkQ":{"text":"Mona Lisa was a great find. It's very refreshing to find a reasonably priced restaurant in","useful":0,"cool":0},"UgHBMZ_TPVieG8j7Kao5wg":{"text":"Pizza and the Mona Lisa: Very New Orleans, right? If you're spending only one day in NOLA,","useful":2,"cool":0},"RgCNMtNu88QsUEDQr5fa-w":{"text":"This is the kind of place that makes a great first date or a ten year anniversary or anyth","useful":0,"cool":0},"AwTFeWvTFkHeFRx5C3ZtDg":{"text":"Mona Lisa has been our default, affordable Italian restaurant. The calzones are delicious ","useful":0,"cool":0},"nCiDJT1FUFRHJqNXwRf62w":{"text":"A little off the beaten path, but it was worth the walk. Service was slow, but we didn't m","useful":0,"cool":0},"5gYHRcV25nf5ISJngVWt1A":{"text":"I have never ever written any kind of review online for anything but this place deserves o","useful":0,"cool":0},"lQzFVK9bmTgaF7RniL6WZA":{"text":"In a land of amazing plates and mind blowing taste buds this little gal's restaurant stand","useful":0,"cool":0},"_cDOdlATa4RlQd41K2Pkdg":{"text":"I have been going here since I first stepped fot in this city.\n\nAnother one of those odd f","useful":3,"cool":1},"0QRjqtcKF9Mw03IDovqnVQ":{"text":"A bartender at Rare Form recommended Mona Lisa's and we were very impressed. Food was deli","useful":0,"cool":0},"37ZCzv1MH15fF8Tdk0mF1w":{"text":"Excellent.  So good.  Cute little place. No frills. Tasty food. Good service. No complaint","useful":0,"cool":0},"rW0Ex8Fnc94hewhvjfPGew":{"text":"Cute little Italian restaurant. Fast service, pretty good food. Chicken Alfredo was above ","useful":0,"cool":0},"VKEDrhpp-vZtaoM5I03Sag":{"text":"Outstanding food, comfortable and cozy atmosphere, in a peaceful section of the FQ. On my ","useful":2,"cool":0},"kdS12v9dLTg245Y6EKkyOQ":{"text":"This place was a terrific find. They do not accept reservations, so we had a short wait ou","useful":0,"cool":0},"yFjtreBv52L5lifFbJAslg":{"text":"Do not get the spinach lasagna! It tasted sour and was canned spinach. The shrimp scampi w","useful":0,"cool":0},"75UxHoOsLFxVog1KaG9vWQ":{"text":"Awesome Italian food in the quarter.  Great prices and great service.  Don't bring a big g","useful":0,"cool":0},"5RWg69nVrSHyEWUK_NlGmg":{"text":"Great food and atmosphere. Try the Mardi Gras pasta...really good dining experience. In a ","useful":0,"cool":0},"a541fK2s_NdbTeaLzmRO3g":{"text":"We had the most wonderful experience at this restaurant.  The food is perfection and the s","useful":0,"cool":0},"m2y-_-Vh6fLV5Kf0ZJrgGA":{"text":"The 2nd time I'd ever been here was last summer, and it was just as awesome as the first t","useful":0,"cool":0},"5bhJMs8TaQPTdgWHYSjUdA":{"text":"I love this restaurant. It is from another time and cozy with very affordable food, with p","useful":0,"cool":0},"TdSQYAe5YV8t4lkZgMC0jw":{"text":"Love this place. We have been eating at Mona Lisa for YEARS, I think since it very first o","useful":0,"cool":0},"LbSmcg7kkFSr8xnln0omkw":{"text":"A great place to go in the French Quarter.  Good food and wine at a reasonable price.  I g","useful":1,"cool":0},"WM2HAkA66M98G7LrtdWuCA":{"text":"This was by far one of my favorites on our trip.  Food was excellent.  I had the lasagna p","useful":0,"cool":0},"UW6lzqO_2CHW7bRiwQuJmA":{"text":"Went here as a party of one on a Saturday evening. The place is warm with white Christmas ","useful":1,"cool":1},"-WFWZ_kUMmDUzN3Q7hsFcA":{"text":"so cozy. delicious food. well priced. average service. took almost 2 hours to get our food","useful":0,"cool":0},"ijNtIbP3Np6wauMz5ZAhIQ":{"text":"We heard about this place from local folks and were delighted with the great food and fun ","useful":0,"cool":0},"nmSUbbG76FbPRTCPG7NTdA":{"text":"Such great food and enviroment! We had the spinach dip and garlic bread pizza to start, pe","useful":0,"cool":0},"Nrq2YyCmVC8mjWs2_1PxPw":{"text":"Nice romantic little place. Food no more than okay (had pizza and caesar's salad). Service","useful":0,"cool":0},"CPn4TeV5IhdjUl7bUVejcA":{"text":"It is a cute little place, that my parents recommended. It was not busy when we went in, t","useful":1,"cool":0},"2yqOi0c8fcoQg3IyCO0T0A":{"text":"I've only dined here one other time butt the lasagna was fantastic. Trying the baked ziti ","useful":1,"cool":0},"Vzg74bredXxq76AkcokliQ":{"text":"This place was amazing! It was a great atmosphere - and the staff was wonderful. The lasag","useful":0,"cool":0},"yRnnyd2SD1V3MtjilZ4ROw":{"text":"Mona Lisa is a good little neighborhood restaurant ... Small and friendly.. I love the cla","useful":0,"cool":0},"dqRt3_xOP-t2KbVjske3KQ":{"text":"Our server was friendly, and recommended some spots for us to check out during our stay.\n\n","useful":1,"cool":0},"9IpB-WtudBDgQvrE1S2iTA":{"text":"Mona Lisa is always a great place for Italian dishes.  This atmosphere is casual.  Locatio","useful":0,"cool":0},"8s6r3AbCFiwEEwxm3gP9pA":{"text":"Great little place. Stumbled upon it randomly for lunch. Had a great meal. It was affordab","useful":0,"cool":0},"qPkDGxxqvhNv3wRTUesHAw":{"text":"Restaurant where you get to use crayons to draw on the tables. That's awesome. The waitres","useful":0,"cool":0},"MayOfsiGMCsv3K8PfzYpNg":{"text":"Went to this place because of all the positive reviews. We ordered three different pizzas.","useful":0,"cool":0},"OI4L2amPacFLmstE5EdNZw":{"text":"This place makes me super happy. Cute, quirky, and affordable option in the Quarter. While","useful":0,"cool":0},"Ouu1RZ1OPYlLe8Dk1RAAnQ":{"text":"Really excellent Italian ristorante. Outstanding bolognese and everyone with us exclaimed ","useful":0,"cool":0},"e1OAKY6HIcvyhGgiy_jOMA":{"text":"After a minimal wait (about 20 minutes, downside is you go inside to be placed on the list","useful":2,"cool":0},"poX5jQuy6CwDgJ_XvX7f6w":{"text":"I have long held this place as one of my favorite go-to places for Italian food in the Fre","useful":1,"cool":0},"K77VtOJQ1D3yRfqTLWo5YA":{"text":"Based on Yelp for Italian in New Orleans I was recommended Mona Lisa, I have to admit, whi","useful":2,"cool":0},"dz5KIjN21KeM-rWDDZga3w":{"text":"Small location. Staff was great. Bathroom location a little weird. Had to wait bout half h","useful":0,"cool":0},"6lnIyugw3fq6EFIdCEId2g":{"text":"If you're in the french quarter and looking for a place to have some good pizza and decent","useful":0,"cool":0},"mXLf9sZmsG7LUd01hxEKMQ":{"text":"Excellent food, friendly people, interesting, quaint atmosphere; I know it's NOLA but lose","useful":0,"cool":0},"rVF236vpaC2iZvC_rZMy7g":{"text":"We waited about 30 minutes to be seated, and it has no place to waited: you either go some","useful":1,"cool":1},"_proOILVWLHqwnZksClSlA":{"text":"Great place off the beaten path.  The red sauce with shrimp over pasta was excellent.  Ple","useful":0,"cool":0},"aLuEmR_0FS8Mm3zV_ybXQA":{"text":"I really wanted to like Mona Lisa.  The atmosphere's right up my alley.  The pasta could b","useful":1,"cool":0},"gsbibrgK9hHsTpsuqdAS3g":{"text":"It was 9ish on a Friday night and we came with no reservation, a party of 5. \nThe maitre'd","useful":1,"cool":2},"Xs1sPTuhAIznpR1cQ3xZ1Q":{"text":"Good place. Tapenade was excellent and came with homemade toasted garlic bread...yum!! Las","useful":0,"cool":0},"NDcYDgz1IIkb9NhJzN2zeg":{"text":"Mona Lisa!  I kept walking by this tiny place (curious).  Finally went in to try it on our","useful":0,"cool":0},"B6TDt7pc9jLg4lyKhadIeQ":{"text":"I hadn't been to Mona Lisa in over 10 years.  And the food is just as good as I remember. ","useful":1,"cool":0},"1ARvKG8EgydRu7YGmV6Jqw":{"text":"We order 2 med. pizzas. One just cheese and another with pepperoni and ham. Yummy, we orde","useful":0,"cool":0},"f36-DQ6uQDT_BBZDhU9LAQ":{"text":"We saw this place got great reviews so even though we were tired and aching from a day of ","useful":1,"cool":1},"R-K5dZi2kJGZLFkESBhPRw":{"text":"I was wandering around the French Quarter when I stumbled upon the Mona Lisa Restaurant.  ","useful":0,"cool":0},"VvGsx34IlaWA7mzvmJZ68g":{"text":"I have nothing bad to say about this place except it deserves a bigger spot in a better pa","useful":0,"cool":0},"OlT5f5mBwfQyLfBjq-aPSA":{"text":"Great Pizza & Reasonable Prices\n\nThis is a gem in the French Quarter. If you go to NOLA of","useful":0,"cool":0},"0Deu40Jihsds2R1OvI_ZCA":{"text":"What can I say....I love this dive!  I eat here every single trip to New Orleans.  The sta","useful":2,"cool":0},"JapEYuyCaL2Vd-0Tdxa9ag":{"text":"You may have to wait a while, but the food is very good.  The atmosphere is unique and qui","useful":0,"cool":0},"So2YccElVQ9UKwUWdJaqzA":{"text":"We walked by this quaint place one morning and decided to try it for dinner, since we alre","useful":0,"cool":0},"GYdrOrvYpakWnhrn7XmesQ":{"text":"Great little restaurant hidden away from the crowds. The staff are always friendly,and the","useful":0,"cool":0},"wKdb16EyxGopXA3ZO1iWxQ":{"text":"It was a mixed bag. The choices were not too surprising and it was not probably a place fo","useful":0,"cool":0},"k_mLt524eo-F9Y7v5yXoAg":{"text":"Rude wait staff and due to that fact my husband and I decided we will not be eating there.","useful":1,"cool":0},"zgBv8-w2LwkbIkm70vcWdQ":{"text":"Great Food!! But if you go with family look for another place, my waiting time was for 52 ","useful":0,"cool":0},"4Ch0TM8ptUcS0vIiUf8l-g":{"text":"Very nice atmosphere, especially at night. I would recommend sticking to the pizza. Last t","useful":1,"cool":0},"C8zIkliV1WwkmiiSkl1Rtw":{"text":"Atmosphere is ok, prices are good, my husband and I split the chicken Parm, it was delicio","useful":0,"cool":0},"eVc-eWctihy9thmJHFpyfA":{"text":"Mona Lisa's is a cute Italian place on the far end of the quarter towards esplanade. The a","useful":0,"cool":0},"tIYdrpQHBi1rB8hCEyOz7w":{"text":"My family and I was on vacation here and we looked this cute restaurant up on yelp. It was","useful":0,"cool":0},"707w1Rxg2xO4m3eBnpZhYA":{"text":"It's my first time at Mona Lisa Restaurant did not disappoint. I opted for delivery and it","useful":3,"cool":1},"Lc2f1pAcQ5fed9qm23p_Yg":{"text":"Took the long walk to try this based on Yelp ratings. My wife commented that the Caesar dr","useful":0,"cool":0},"EGdjhr_f2wkfliW5Piw42Q":{"text":"I was excited to try Mona Lisa as my partner loves this restaurant and has wanted me to tr","useful":0,"cool":0},"OVqEb4x-FeuEsKr7IJ48xA":{"text":"The chicken parm is like buttah!  Consistently amazing every single time.  People are frie","useful":1,"cool":1},"aFGSaDwEAfSo-qG1CeKExg":{"text":"Growing up outside of Chicago, having access to some of the best pizza in the world may ha","useful":0,"cool":0},"dBjcr4VS2_hgPmEItQTvXA":{"text":"I love this place, it is beyond unique. The culture of this is extravagant. Series of phot","useful":0,"cool":1},"up0Z1QayrtZt5u6j6Z5ZjQ":{"text":"Ok, I love this place. I'm an Italian girl from New York, and their chicken parm had me do","useful":1,"cool":1},"ctJx0x8G3aDQRMo50SWWDg":{"text":"The food was delicious but the overall service was horrible. Lost our order (table of 9). ","useful":0,"cool":0},"RIsFKEL1iBdTxNRpQ4Y_-g":{"text":"Fantastic place with a lot of character off the beaten path. Great food and wonderful serv","useful":0,"cool":0},"pJgRzcuAukFOOOETkrbmOA":{"text":"We hadn't been to ML in a few years, but remembered it fondly. We brought some guests from","useful":0,"cool":0},"xfGXJjxeWBKTPYlVkSC2Sg":{"text":"My last night of my 5 days in New Orleans. Sad to say I didn't find any food in this city ","useful":1,"cool":1},"UF_DcW73s6_0SrakLPm2Yw":{"text":"We stumbled on this place when Irene's was closed. I was pleasantly surprised. The food wa","useful":1,"cool":1},"djj4A7mPTZ6MqYW0YEDWVg":{"text":"Visited here for the first time with my husband and I while here in the French Quarter. We","useful":0,"cool":0},"F6eoxevtVZNENHj0H8UICw":{"text":"Worst experience I've ever had in a dining establishment. Service was so horrible it had t","useful":1,"cool":0},"GmqDZ_YQgzQAJbZ-_i54sg":{"text":"Used to come here all the time until had a really bad experience with the manager/owner. C","useful":0,"cool":0},"jFx_urM5BnOzYbX5JMKWlw":{"text":"Went there for the first time.We ordered 3 dishes: Shrimp Alfredo, Spinach Lasagna and Vea","useful":0,"cool":0},"O5776XX9BSWaFAfEa_JVoQ":{"text":"Cozy Italian bistro feel that reminded me of favorite East Coast meals. Try the spinach la","useful":0,"cool":0},"_cFvJhHuE2OVq3nOT8UfPA":{"text":"I'm actually extremely disappointed in this restaurant. I found it on Yelp and it had grea","useful":0,"cool":0},"AC2BwSHB_drNQjVNS02N_w":{"text":"A friend just reminded me of this place yesterday and I couldn't help but smile thinking a","useful":0,"cool":1},"oDGc1w5T8LTi0gddihGoDA":{"text":"Don't even waste your time. The food was horrible. The side salad was good but it's kind o","useful":0,"cool":0},"r_eezFuGDVlKpaU6ECNwKg":{"text":"I'm leaving this belated review specifically for the Lasagna! I love Lasagna, and having t","useful":0,"cool":0},"xpX2STmKSyYUT58og0cuYg":{"text":"Yummy pasta in this small, loud, vibrant place.  Decor was great, as was the service & com","useful":0,"cool":0},"dr22jMeEJzrixVz5K-ZbOw":{"text":"We stumbled upon this great Italian restaurant in the French Quarter and  just had some of","useful":0,"cool":0},"WIKu-Vy5SnfYkJhafAPONQ":{"text":"A very nice, layed back place to eat. The atmosphere is exactly what my girl and I needed ","useful":2,"cool":0},"6K6iEsPwMc_LLlg1kYy0Ug":{"text":"Ate there last night. Pasta bolognese was quite good; linguine with white clam sauce was a","useful":0,"cool":0},"8Lge7E2heZ_7Vk0CGbHnpQ":{"text":"We found this place largely by accident during a late-afternoon jaunt around the quarter i","useful":0,"cool":0},"Y2D5OHHKNvbiXegd2raxVw":{"text":"Awful. 15$ for pasta with Bolognese sauce. Noodles were sitting in half inch of water. Sau","useful":0,"cool":0},"de3qtmm3tTuyIQs0nq3rkg":{"text":"5 stars for amazing food!!! Chicken parm is to die for.\n4 stars for service.  She kept for","useful":0,"cool":0},"uKSXvDgLmtcrO2H_RcSN0w":{"text":"We found this place by a local's reccomendation. It was heaven. We split the spinach salad","useful":1,"cool":0},"X48LRxWBedPNq_7JUuOEUQ":{"text":"First time here . The place is very cozy and makes you feel like home . The staff is very ","useful":0,"cool":0},"veEc4NKrMJOnxF4pXAmzsw":{"text":"Lets start this review off with saying, I'm Sicilian.\n\nAlso, I am not a fan of how the din","useful":2,"cool":0},"Om2NjJmug9fHtUyEirVTeQ":{"text":"Amazing stop in New Orleans if you crave that authentic Italian flavor that will dance on ","useful":0,"cool":0},"35WeOp3uvzPHWFxkxYF8hg":{"text":"Well, I finally got my \"re-do\" at Mona Lisa, and this time I didn't waste it all on a sala","useful":2,"cool":0},"ZEAtl-16gFoBoYDnsWVGcg":{"text":"Super small hole-in-the-wall Italian restaurant that has inexpensive options ($3 basket of","useful":2,"cool":0},"rfn1MHBBleoR2OiDuCLq6Q":{"text":"Great Pasta ! Best Pizza around !  Friendly , Laid back atmosphere . Ask for Lori and tell","useful":0,"cool":0},"xvPxC-tY579jgKwQgEW_uw":{"text":"Excellent. We spotted this on Yelp in preparation for pasta loading for the Crescent City ","useful":0,"cool":0},"t2RtGu3Nwf3p-rzJYF9upw":{"text":"Cute restaurant with excellent Italian food.  My two vegetarian daughters really like the ","useful":0,"cool":0},"RfbpL6vJok5GwZqm_AKeww":{"text":"A fantastic quaint Italian restaurant in the french quarter...what more could you ask for.","useful":1,"cool":0},"Wjml--zZmxaBcakR5vXrDg":{"text":"Mona Lisa's is favorite of locals, everything is good, esp. their pizza.","useful":1,"cool":1},"XuOLGNugv7FaibrN_2PrUw":{"text":"I stopped in to Mona Lisa Restaurant on a walk over to Frenchmen Street one night. \nI love","useful":0,"cool":0},"3tmwPzupFbi56HxD2dpPHg":{"text":"The food here is soooo excellent . The portions are nice and big . It takes a little time ","useful":0,"cool":0},"CXe74Dm8BlUq_E7FeijtxA":{"text":"Excellent veggie lasagna.  Salad and small slice of pizza included.  Five bucks for a glas","useful":0,"cool":0},"xb4hyODJVQMRfvgaumbF4A":{"text":"Quaint place to have a great Italian meal in Nola!  House salad was excellent with house I","useful":0,"cool":0},"gIw03nwMctiUc8ttt-nilg":{"text":"Wow. I've never met such nasty people In my life. Was waiting outside for about 10 minutes","useful":0,"cool":0},"L8nC8nhLpQUeEesuYm9-0Q":{"text":"Quaint place to have a great Italian meal in Nola!  House salad was excellent with house I","useful":0,"cool":0},"XwRRF-DG7ztpOJMKpNngAw":{"text":"We were in New Orleans for week and were craving some pizza, we kept stumbling by this pla","useful":1,"cool":0},"JjFun3UGnX4g523QqoSqLg":{"text":"Completely avg food, service is sub par even for Nola. Not worth going out of your way for","useful":0,"cool":0},"zfWjyDFxNPvBsoiBQtvdig":{"text":"Our server was nice. I had to get the only good thing I can say about this restaurant out ","useful":0,"cool":0},"dK2vFzx--77-_vSPnBjOlw":{"text":"We just returned from New Orleans. We visited for the 1st time 4 years ago and just return","useful":1,"cool":1},"sUh-VzcJ15RAg7Vvw1YTrQ":{"text":"Amazing food, great ambiance and friendly staff! Returned here after having an amazing mea","useful":1,"cool":0},"ztmnkh6lIWfYPR4DgH8BEQ":{"text":"This is one of my favorite little places in the French Quarter. I used to pass this place ","useful":0,"cool":0},"MPAspyTxW7lENgsOo0Ux9w":{"text":"Very cool restaurant off the beaten path of the normal tourist in the French quarter. Grea","useful":0,"cool":0},"wJBHtgfJymfws2qVn7bVnA":{"text":"Dear Mona Lisa, \nI have lived in the Quarter for 10 years and have ALWAYS considered you a","useful":1,"cool":0},"LPqwXqKr5rNSoCzoRoqyig":{"text":"Every time I think of New Orleans, it's not the Cajun or Creole foods I recall- it's this ","useful":0,"cool":0},"WTqV7j7e36-V-bpoThnveg":{"text":"This place was perfect. We got a recommendation from an Uber driver for Italian in the Fre","useful":0,"cool":0},"KijdqrMjCxzT0LYRKUCyJQ":{"text":"I insisted that my friend and I try this restaurant after (fairly) positive reviews here. ","useful":0,"cool":0},"K_whAQrmSJRgg5lBVwHFEQ":{"text":"Tasty, good Italian food, served in a casual, funky atmosphere.  It's a solid value in an ","useful":0,"cool":0},"WTSDaS8-_SUKOjqaTXAgXA":{"text":"Great place to go to when you are craving pizza in the French Quarter. I've been eating he","useful":0,"cool":0},"Fq2OY6XdnUe8DbeufHy9Ew":{"text":"Wandered into the Mona Lisa Restaurant on a rainy night during Mardi Gras. So pleasantly s","useful":0,"cool":0},"-x5K9vPFsYcE9wL1JvE5Rw":{"text":"We order pizza from this place at least once a week.  LOVE the crust.  And the actual pizz","useful":1,"cool":1},"K13IHOYCehBty5Gvaw0Smg":{"text":"Had a great evening with my wife, my son his wife, n our grandchildren at Mona Lisa tonigh","useful":0,"cool":0},"VLrzjRlIB3Yv0JwqgjD7sA":{"text":"Another hole in the wall location that ended up being absolutely amazing.  First let me sa","useful":0,"cool":0},"PGBjatm0jQWUWXQeySsCcQ":{"text":"I was in town visiting last month and after eating some traditional New Orleans dishes we ","useful":0,"cool":0},"cUNcyKbDugk5ACRQWRqshA":{"text":"This was a great surprise.  We needed a quick bite to eat on this side of the quarter and ","useful":0,"cool":0},"XlB1lmVcl0fEcdc_4LBR-w":{"text":"we'd never been to new orleans before and we were staying in the french quarter.  Found a ","useful":0,"cool":1},"CA-lTByFFocbZWMXoWDpaw":{"text":"Probably the best place to eat in NOLA.  \n\nWhen you first walk in, you will probably think","useful":0,"cool":1},"oskrGhXxLN2JXI7R3Qes4g":{"text":"This is one of my all time favorite restaurants in New Orleans.  I have been coming here s","useful":0,"cool":0},"DsmSEll7u4TD3kHh1bUi1A":{"text":"Luckily stumbled across this place while walking to another establishment during Neelam P.","useful":0,"cool":0},"a10Kp5Iq5cgMJ0G7pXjwSA":{"text":"Terrible service. Waited 1 HR 17 minutes for a table. Fine, they're busy. Waited 1 HR 3 mi","useful":3,"cool":1},"GM8ShQcyjhWIelyZrD6fKg":{"text":"Staff was friendly and attentive. The atmosphere was quiet and I was seated at the window ","useful":1,"cool":0},"S09NcBD1veggeve36rc5fQ":{"text":"Excellent pasta dishes at reasonable price\nFriendly service\nNice wine selection at good pr","useful":0,"cool":0},"AoN5TmukrFF2cz7mXuWC1g":{"text":"Visited New Orleans on a trip recently and came here ! The food is average not bad not the","useful":1,"cool":1},"TbRDFELouJg_SE0Ugayimg":{"text":"We have eaten here on several occasions. It's always packed but the staff is always friend","useful":0,"cool":0},"xyXxlPxDreYzlyRVv2GZZg":{"text":"My husband & I have been coming to Mona Lisa for years, and love their pizza. Standing in ","useful":1,"cool":0},"4qsUP6vqm71IsWGs-s7EMw":{"text":"great place for when you need a quiet, relaxed dinner or want a ~*romantic*~ date night.  ","useful":0,"cool":0},"LcU14zDEUyaYc8GcuVfw7Q":{"text":"I was in New Orleans, trying to do the impossible - diet. I had to avoid carbs as much as ","useful":0,"cool":0},"LbkwRg5TEe5lcR1my1cwGA":{"text":"My wife and I arrived to arrange for a group of us to eat dinner, and waited to get tables","useful":1,"cool":1},"fiyumsKx4fqaxnVYXFE8nw":{"text":"This was a quaint sincere eatery with simply delicious dishes that were perfect portions t","useful":0,"cool":0},"oiYpoCSTjwnrdb78GhgSiw":{"text":"The food here was OK, but the customer service was absolutely terrible. We showed up a hou","useful":0,"cool":0},"YTnKiMuhgRvdVqhprZ9BZg":{"text":"This has been one of my local favorites for around 13 years. Away grom the more boisterous","useful":1,"cool":1},"xTFJUyrPIdOPq74ONnI-Xw":{"text":"I had high hopes for this place considering the previous reviews and my friends' recommend","useful":1,"cool":1},"FGbXIFDwXh9EoAYcDJp7tQ":{"text":"Our first time here was on a quiet weeknight. We were seated immediately and ordered pizza","useful":4,"cool":2},"a15wwvHNDVx-kjtwkOVh3A":{"text":"We truly enjoyed our experience here. \n\nThe sweet iced tea was the most delicious southern","useful":0,"cool":0},"CexnN2w4rm2bhw_dFaM5PA":{"text":"I'm so happy I stumbled upon Mona Lisa- cute, cozy and comfortable with delicious food and","useful":0,"cool":0},"TU2D2mNwnVO6kDwXjaWjug":{"text":"I was hungry for non-Cajun food. Wandered over to the historically Italian side of the qua","useful":0,"cool":0},"og7j7wRuQyVYxoxypG2LHA":{"text":"Hidden Gem. We were wanting some good Italian without braking the bank and this place nail","useful":0,"cool":0},"LfBYHKsrKwG5xlsFEhKmNg":{"text":"Great little spot on Royal Street! The manager at our hotel recommended it and said it was","useful":0,"cool":0},"53iSahIY0uffjXuldMLSXw":{"text":"My favorite place in the Quarter- delicious, romantic, and not expensive. Great atmosphere","useful":1,"cool":3},"W0yOvk84mKiloH-DxGW4PQ":{"text":"In a land of amazing plates and mind blowing taste buds this little gal's restaurant stand","useful":0,"cool":0},"coSukrtoKivKXc1EA9dlVA":{"text":"Excellent pizza! I mean the crust was great! We took it to go! But inside was very small a","useful":0,"cool":0},"OZT-nVXiwbg13-EtysoODg":{"text":"I wish I could get a \"redo\" on my lunch here ... but not for the reason you may think.\n \nI","useful":1,"cool":0},"g4SvEC3PPbBQm-ZWDctjkA":{"text":"Small location. Just getting it out of the way, because really most places in the quarter ","useful":1,"cool":0},"FYgZC5ZbTtpyKsjf2hM-vg":{"text":"Great salads, great pizza, great service, great ambiance.  Location is within walking dist","useful":1,"cool":0},"EgWyzzq6Aig1uaOTyQ8nmg":{"text":"Great Italian WITH delivery.\nHowever, you shouldn't miss the chance to dine in the charmin","useful":0,"cool":0},"hZ_pam1tQoVmbvnoN3vvYw":{"text":"You like Italian? The chicken or eggplant Parmesan are very good and Mediterranean pizza m","useful":0,"cool":0},"zYnEIiA6mnBHRDF9r0mBZw":{"text":"We ate here this evening, 2/15/2019.  Arrived before a big crowd this Friday evening.  Fun","useful":0,"cool":0},"BHmAnfcD2PfOdHSfInfdbg":{"text":"Fantastic food! Definitely be back next time we are New Orleans.  Better Italian food then","useful":0,"cool":0},"feEt5D7CQi_-Sp12K0Z9ig":{"text":"The food is good, however the service leaves a lot to be desired.  We were the first table","useful":1,"cool":0},"nAFhgx0Q3UachPetw6ms3g":{"text":"Great atmosphere, delicious food. A nice place to get away from the overly touristy areas ","useful":0,"cool":0},"mbg7uJZMt2NhwUm2V3_mCA":{"text":"I just read some luke warm to scathing reviews of Mona Lisa's and it left me scratching my","useful":0,"cool":0},"jn6lkgZR5UoHGyJER4mZFw":{"text":"Though I have a lot of nostalgia attached to Mona Lisa, as my last review states, I can't ","useful":12,"cool":3},"SjdKB0lxttsPFD0r_jiBDg":{"text":"The BEST food I've had in New Orleans!!! Everyone should come! Well worth the wait! It's a","useful":0,"cool":0},"Zunh4xmw0IKgS38zfTD03w":{"text":"First off, the only reason I am giving them a 3 is because the food is so amazing.\n\nWe hav","useful":6,"cool":1},"kgDTth4zqrV-QTz37Ad63g":{"text":"This place is a must visit if you are in the mood for Italian food in New Orleans! The res","useful":0,"cool":0},"-l-huOxLVrPYbTxjqtoD5A":{"text":"Everything about our meal was perfect, especially the Alfredo sauce ... but the cannollis ","useful":0,"cool":0},"8GSjx6vVrrZbBYYq0nZbQg":{"text":"Terrible service. Didnt even stay to eat. Came in alone was ready to order the waitress sa","useful":0,"cool":0},"rtVdAEU9GXCjyKAunlhheA":{"text":"What an amazing experience!\n\nThe place was beautifully and uniquely decorated, giving us a","useful":2,"cool":0},"RZv1LyEfe8YuNCljDknQcg":{"text":"We had walked by this place several times and the timing just wasn't right. This time, we ","useful":0,"cool":0},"hxmvb-J7w9D5WFXImQbXPw":{"text":"Food was great. A little slow but I loved that, it gave me time to enjoy my wine, and catc","useful":0,"cool":0},"-JtibRNm0lSNaGiKtkGFkQ":{"text":"Five stars all the way.  I wish I was writing this review right after I left, since I coul","useful":1,"cool":0},"z6_at-TgeGiW0FRJZouIww":{"text":"This was one of the best Italian places I've ever had. You may not think about eating Ital","useful":0,"cool":0},"a80x4-PeyvauBhodJkZcow":{"text":"Came here on New Year's Eve. With a 45 minute wait time, you'd think the food would be fan","useful":2,"cool":0},"5YLb62KKjB7Iu9LlCcILlQ":{"text":"Stop in here every time I visit Nola. It never disappoints. Great taste and value.","useful":1,"cool":0},"SdUECOdxUWTwsBope-nYVQ":{"text":"Amazing food! We found it randomly and went for our 17 year old's birthday dinner. We all ","useful":0,"cool":0},"60EhRN421GUVcqepJsp0AQ":{"text":"If you are in the French Quarter you have to go to Mona Lisa. Not a huge restaurant but we","useful":0,"cool":0},"zm0I-F1Prqx3LeRxkhsAcQ":{"text":"Really great food, service is okay. So don't be in a rush when you come here! Our food too","useful":0,"cool":1},"aSGP3gtpAgmdwY2yiGbuig":{"text":"Delicious food and well worth a  wait on a Friday night.  Nice relaxed atmosphere and reas","useful":0,"cool":0},"feJaLw19H96iJhIHoPSfdw":{"text":"Nice cozy atmosphere. Good location. Nice staff \n\nCons. Food was not great and smaller por","useful":0,"cool":0},"d93izHTIH5s7uWUxPtEZLg":{"text":"This is the first time to Mona Lisa in probably 10 years. I was pleasantly surprised they ","useful":0,"cool":0},"Eou1ZoxDE8u9J8Ma3fXgdw":{"text":"Great little hole in the wall type place with multiple various creations of the famed Mona","useful":5,"cool":5},"XExSY1LmoqEtvFmSOM4TJQ":{"text":"We love this place- it's our first visit here but it was live at first bite. \n\nI had the l","useful":1,"cool":0},"HztmWxIv1yuZH9o2-s3qvA":{"text":"I work in the quarter and hadnt had a chance to eat all day so I looked around and saw rea","useful":0,"cool":0},"EfcXferRcU0dc2FB9DGhFA":{"text":"My husband and I LOVED this place! The waiter and host were very friendly and the food was","useful":0,"cool":0},"5Os7rMWu0N6K969hZ2xpoQ":{"text":"Decent pizza, but can't say I recommend it. Really nice atmosphere, good service the night","useful":0,"cool":0},"RlG2Nrt5Wt-xhN9l3Nyo2w":{"text":"Service is fast and friendly. Order the spinach and artichoke dip and it was great. The pa","useful":0,"cool":0},"aeQGnYEzrtK4VLsJxkgZ1g":{"text":"Wonderful spot in New Orleans, food is delicious. The Mona Lisa decor is a sight to see, t","useful":0,"cool":0},"KFNLwlVLHBZ7-f-vkv_PXw":{"text":"Horrible experience. Was treated as a second class citizen. Embarrassed in front of my out","useful":0,"cool":0},"2uavekigV0H_T2gTZTiE4A":{"text":"Ughhh... where do I start? I've come here twice already and each time it gets better and b","useful":0,"cool":0},"OclMi2Oc05z1Xavdamecsg":{"text":"Lovely little old school Italian place in the French Quarter.  Yes, yes, I know.  How coul","useful":2,"cool":2},"IqKr8d4WNPZfWIOxhSk9Cg":{"text":"This was a really nice surprise after having gotten lost on Bourbon Street. It's off the b","useful":0,"cool":0},"zFF2xu0Xb3UGisGCiooDeA":{"text":"Awesome pizza. Drew the Mona Lisa on a table cloth and the hangover was gone.","useful":0,"cool":0},"sLIkuUh3gDyZk9pUkYjJRA":{"text":"Great neighborhood Italian restaurant with great food with great prices.  My husband and I","useful":0,"cool":0},"maaFsZDzaaf8DEFp0HNShw":{"text":"My husband and I stopped here for a light dinner of salad and pizza. We had a very nice di","useful":0,"cool":0},"7tkCDElURSUsVC7GGn_OKw":{"text":"My parents live just around the block, ,my kids pretty much grew up there going in and out","useful":0,"cool":0},"F9uGwUeS5IgykHnviNwnTw":{"text":"Came here for some dinner before heading out for Mardi Gras. I loved the atmosphere and al","useful":0,"cool":0},"UyTOoBvC125KGbfwUjBuig":{"text":"Mona Lisa is a moderately priced Italian restaurant at the quieter end of the Quarter. Mon","useful":3,"cool":1},"yAelhGI03RLbtBrDc24epQ":{"text":"This is a great spot for a romantic date. We tried the Mardi Gras pasta and a pizza and I ","useful":0,"cool":0},"bO-qKQFOMfQWs5TiT9Mulw":{"text":"About a 20 minute wait to get a table, but worth it.  Cheesy bread is tasty.  Pepperoni pi","useful":0,"cool":0},"zUM6VV2uSHOtr45ZydPJJQ":{"text":"This was hands down my favorite Italian eatery ever! Great food, the place is adorable, it","useful":0,"cool":0},"oJwyLGSKCmXP-M3IY1QA9A":{"text":"The food was very good I went with my dad and my dads wife.  My dad had the pasta alla non","useful":1,"cool":0},"KNtMq1rjX3qWSqi3kMoETw":{"text":"Do not go here!!  Horrible service!!!! Bad attitude!!! The man in the video,  who called h","useful":1,"cool":0},"TaBz2VXhb4gtt1SnmFSP2Q":{"text":"This place was suggested to us by a local & boy was she true! We were told it was the best","useful":1,"cool":0},"IIJb6K5ui4PtDVUZm-X-SA":{"text":"Stopped by here on way back from Frenchman's street (which even early was hoppin) split an","useful":0,"cool":0},"lnaRyG9182ajtD8DDM0JPQ":{"text":"We happened upon this spot when a Spirits of the Undead tour ran a bit too long; what a lo","useful":0,"cool":0},"jUkZl81FZHuFwf2tt712FA":{"text":"This place is excellent. A New Orleans native friend recommended it to us, and it was wort","useful":1,"cool":0},"sbycW-xKOeJ-K_gifeDVvw":{"text":"I live around the corner in the Quarter so find ample opportunity to walk here. There are ","useful":0,"cool":0},"7EuO--d7rxsIMU_WJSR6BQ":{"text":"First off, that \"testy, grey-haired ass at the door\" is one of the the reasons why we love","useful":2,"cool":0},"tsF32XaR8zOlqQwiNJ2WOg":{"text":"Recommended by a local the pizza from Mona Lisa was pretty great, not sparse on the toppin","useful":0,"cool":0},"_89pHZZOIbfrHZ3UxGWzWg":{"text":"I know who would I think to eat Italian while in New Orleans! This place is well hidden on","useful":0,"cool":0},"CYi043DcANHRlAkpCq4JNA":{"text":"I went to Mona Lisa with 12 guys, we did have a reservation and the place was perfect.  No","useful":0,"cool":0},"17ytKcEOtXye_-SfgQxMsQ":{"text":"Sep 30, 2019. Raven gave great service... knew the menu and gave good recommendations. Gre","useful":0,"cool":0},"YppJgf3fNPk0_ttCVUNyUg":{"text":"If you are in New Orleans, Mona Lisa is a MUST!  Best salad and pizza in the world. And th","useful":0,"cool":0},"McsNMl9RFILgWchVwv8A0Q":{"text":"Feeling like we ought to live on something besides po'boys and gumbo for a week, somebody ","useful":2,"cool":0},"he4DFqsKsIH3QH-PZf1TDw":{"text":"This place is below dive.  Teeny, tiny dining rooms, and as dark as midnight.  But the amb","useful":0,"cool":0},"tSTv2kp5euLtQzKjntXJEw":{"text":"This restaurant is one of my favorites for several reasons, one being the food is awesome ","useful":1,"cool":0},"QT81TgGf2j7DbTEw0_ZWhg":{"text":"After a long week of eating seafood and fried food, Mona Lisa for lunch at the end of our ","useful":2,"cool":2},"6KTkSSltbtn0z8I-FWGLOA":{"text":"Fantastic spot for an intimate meal. I came here on a date. We had the tapenade app and I ","useful":0,"cool":0},"PrfEde5lQGuEA-rde2J8zg":{"text":"Love this place! The owner is extremely friendly. The food is delicious, the place is ador","useful":0,"cool":0},"PYHDsMEi3scW82hYjf4aqQ":{"text":"Such a cute little place! The food is very good; some of the best Italian food we've ever ","useful":0,"cool":0},"N8jSLmglPTTgdmRXkag25w":{"text":"Good Service - average salad and pizza.  Good garlic bread which is the pizza crust.  Wort","useful":0,"cool":0},"HU1th-Ebrtyr8w0qYQFzWw":{"text":"I've literally been coming to this restaurant since 1996, and while I've travelled all ove","useful":0,"cool":0},"B0MyxQQHU9rZSGshJbeTaw":{"text":"this is a great place, when things are working right, but it can be a hit or miss.  I alwa","useful":0,"cool":0},"WxU1f9P3tFPlirPTMvngig":{"text":"Stumbled across this place while exploring the French quarter. The meatballs are huge and ","useful":0,"cool":0},"C9YqG5dHurdfjNvSTI6dow":{"text":"Amazing everything! Food, service, drinks!  With the tons of places to eat in the French q","useful":0,"cool":0},"MBoU6Egw0D9vv0uTSvQxBQ":{"text":"I have lived in New Orleans for 5 years and have missed out on this little gem until recen","useful":0,"cool":0},"tp-bC3nuQ1aa5Hejk4IGYQ":{"text":"Chicken parm is good and probably the best.  The pizza is good and the small is enough to ","useful":0,"cool":0},"iFFhqixQ6JOPGl_Pxi1RjA":{"text":"Excellent pizza and sassy service! Loved it and the atmosphere. The host was hilarious and","useful":0,"cool":0},"H1aAuhGYrQEGsEsb2Ih-6w":{"text":"Awesome service. Great food! Good/fun ambiance. Only reason they didn't get the fifth star","useful":0,"cool":0},"oaxyvZgswHhuxVwVALprzA":{"text":"Usually I don't go out to eat at Italian restaurants. Don't get me wrong, I love Italian c","useful":2,"cool":1},"tj4D5A4v0J8Chkk-z7Vb_g":{"text":"We dine here frequently when in NOLA, and have always had a pleasant experience, until las","useful":0,"cool":0},"rzjJpVUaqzJOQkKyuErM2g":{"text":"We had high hopes for this restaurant because of the good reviews. I wanted to love it but","useful":0,"cool":0},"Z12_VTLq1aHCWZIVFy8WRw":{"text":"1.5 hour wait for food that was mediocre at best. Do yourself a favor and just order in Do","useful":0,"cool":0},"IophTWUDkuYY5AyiqwjCiw":{"text":"Food was tasty and interior was cozy and fun! This was a nice little respite in the crazin","useful":0,"cool":0},"KmquedEm2v7hHJNeXx7VAA":{"text":"We walked up to a very long line of people waiting to get in... good sign in my book! It t","useful":0,"cool":0},"iUJc0Ppx5EsUXXKAjhfFSA":{"text":"Love this place!  We go to NOLA once a month and this is always a stop for us.  This time ","useful":0,"cool":0},"9qc-F4Cg8qADzQX5Mls34g":{"text":"This is a quaint little spot in the French Quarter, with lots of character and great Itali","useful":0,"cool":0},"H0cCFBELqxKFtQ4iFywd3g":{"text":"It wasn't long ago that we discovered Mona Lisa restaurant but when we did, we knew we had","useful":1,"cool":1},"SnioMVcos9HzxrIYcuLb6w":{"text":"We ordered delivery over the phone for our group upon recommendation of some locals, and w","useful":2,"cool":0},"cApQounuSzh4ZEaQrchj2Q":{"text":"This place has saved my life on more than one occasion in the Quarter. If you can get past","useful":0,"cool":0},"tZORrZQREAy2XVPATbb0uQ":{"text":"Rare find in New Orleans. Outshines all of the other restaurants we visited on our long we","useful":0,"cool":0},"i7LkbOOTPILgzGX9oDwPLw":{"text":"My sister and I are in town for a Christmas getaway. After reading reviews we decided to t","useful":0,"cool":0},"KrmY6aXJVb-FgrBjOwQMOg":{"text":"I was visiting New Orleans with my family when this little restaurant caught our eye while","useful":1,"cool":0},"z3R-hfWGjBjiHcoSBL_piw":{"text":"service was good, waitress super friendly and food came out quickly! food was delicious. g","useful":0,"cool":0},"SbghQIOB-9Ll7HnW77Gw-g":{"text":"Great little local joint on the Esplanade end of the quarter, away from a lot of the touri","useful":1,"cool":1},"gn07tByf6yq3vw7T968EIg":{"text":"Mona Lisa is a great place, if you want good Italian food in the quarter, but you want to ","useful":3,"cool":3},"b8f2Lbo0j4dF8jcNf8kOdA":{"text":"A great nice place to go have a glass of wine with your spouse or family and enjoy down gr","useful":1,"cool":1},"Hu-VoE04gBlW0v9G2OKtiQ":{"text":"This is a super cute, little Italian restaurant. It's all decorated with various photos an","useful":2,"cool":1},"kKpuyi79Rc4J2tGBBNrc3Q":{"text":"Great hidden gem. We didn't know anything about this place & decided to walk in. We are gl","useful":0,"cool":0},"qEm5js6TYokGMCCTupTIfw":{"text":"I am very happy that we found this little gem in the French quarter. It's a small little I","useful":0,"cool":0},"zmUzbERC13LAxegogPLLvQ":{"text":"A friend recommended the place. Honestly this is not the nice little Italian place it s lo","useful":2,"cool":1},"IPN11tHCWjSAcxPwoadt0A":{"text":"Great food, good vibes, wonderful stuff\nWe ordered lasagna and panned chicken pasta, both ","useful":0,"cool":0},"oyg0Ubg0utpwpYDYcvvrFA":{"text":"The food is absolutely delicious and most Importantly fresh. Entrees come with a sizable a","useful":1,"cool":0},"Yc2w7z1Pftq6t-5zNaKylA":{"text":"this is a cute little place a ways down Royal st, a little more than a block from Esplanad","useful":0,"cool":0},"Ls78GHFKsuHfYLEgcYGYCA":{"text":"Amazing! The pizza is great, and a wonderful pasta primavera. Wonderful ambiance and excel","useful":0,"cool":0},"wK-uvqLnTbo2wetmFK-OpQ":{"text":"Wow! What a huge disappointment. The owner is the rudest man I've ever met as a restaurant","useful":5,"cool":0},"2weosncXe3aUMTt9TVqOWw":{"text":"Idk how I've only JUST discovered this place but it's so sooooooooooo GOOD!!!! This is the","useful":0,"cool":1},"nJewZBpxBJVzN9RzI3f4Zw":{"text":"A delicious and reasonably priced Italian meal with lots of vegetarian options on the menu","useful":2,"cool":1},"Fqylk9UcDoNRwjUebQXHJA":{"text":"AMAZING!!! The best Italian food I've had in so long. Big portions and reasonable prices. ","useful":0,"cool":0},"GkUWNBSSKg6Liq4ciZ-dRw":{"text":"First time at likely won't be my last. The restaurant is head to toe Mona Lisa, it's fun a","useful":0,"cool":0},"hfgfbdWR6JBnyYV9_INAOw":{"text":"Love everything we have ever eaten here. Spinach artichoke dip is so creamy & delicious. T","useful":0,"cool":0},"uBAa38lDW1mPoRffQnMH5A":{"text":"A nice change in dining from the creole options in town.  A quaint European sized restaura","useful":0,"cool":0},"D7lOrcGJZm_QB_BX__UxPQ":{"text":"In the mood for some good Italian? Or just food in general? Look no further than Mona Lisa","useful":0,"cool":0},"3u8R0zdpe_Ji7YlhBfc8Ng":{"text":"Yes, yes and yes. Fun, eclectic atmosphere with quick service. Had the lasagna and it was ","useful":1,"cool":0},"wRJbV_k8CxjV9L7NRj9Z3A":{"text":"Great food horrible management. They follow a publicized no reservation policy but they sa","useful":0,"cool":0},"Ic01_ncKsfQidyiTkGbBQg":{"text":"Great local Italian spot off the radar of most tourists even though it's in the quarter. I","useful":1,"cool":1},"X6fb0AVC-OTeUGppPUl3nQ":{"text":"Run, don't walk to Mona Lisa when wanting some Italian food. It doesn't look like much on ","useful":1,"cool":0},"hW_SOQ_yolOU64suSKiRxw":{"text":"Paneed Chicken and Ziti were delish\nGot a lot pizza to go for late night snack\nDon't forge","useful":0,"cool":0},"5fMGsUt6E7YVUK6cR-5abg":{"text":"Food is good especially the lasagna, but the service is bad and the manager started a figh","useful":1,"cool":0},"2GyOdUNkoPkxK1rpL6w_DQ":{"text":"Tourist seeking good food! Best lasagna I've had in a long time. The atmosphere of the res","useful":0,"cool":0},"Mo9UuRAo5vBuFVyaqdv2yw":{"text":"I am from a Italian family and this authentic Italian cooking reminded me of my moms mouth","useful":0,"cool":1},"uxFHC3Lx4HS3bfiA2y7NrA":{"text":"Very cold day went in for a quiet dinner with my autistic daughter. Waitstaff slammed her ","useful":0,"cool":0},"q5mOkQYWLEkUAoggpGA1HQ":{"text":"This place is a must!!!! The bruschetta was to die for, the pasta was amazing and lasagna ","useful":0,"cool":0},"HxFhuarRHodnQXpVA3fj9Q":{"text":"This is a nice little mid-range Italian joint in the Quarter that leans towards a bit of a","useful":3,"cool":2},"xcAVOhrAUXdPv8NII6EWcg":{"text":"Always loved that place in french quarter... quaint and secluded!!! Thumbs up. Food is fre","useful":0,"cool":0},"2LNFd3ViY1qGm2Rbg7WTRw":{"text":"A nice little Italian restaurant on Royal Street. Our party of 4 was very happy with the s","useful":0,"cool":0},"-l0GXkFTHcqfLOPvAy6Z2g":{"text":"OMG this place was recommended to us by Fry Daddy. Best food we had in New Orleans hands d","useful":0,"cool":0},"Hr5qORPbjImodwAEhRE5Mw":{"text":"I've always loved the food here. This is my go to spot in the quarter for sure, and occasi","useful":3,"cool":0},"pBfW64TqbJRgplFeC_4RJg":{"text":"Enjoyed a fabulous dinner at Mona Lisa on Royal last night. Great Italian dishes in an int","useful":1,"cool":1},"oPG7kz4sNjgu7b4N-SBc5A":{"text":"I ordered from this place late one night, feeling a little too lazy to eat in.\n\nI had the ","useful":2,"cool":0},"3QePyeTn2MTn7BFutPWxjg":{"text":"Small, quirky and quaint restaurant. They were really busy when we got there so it took a ","useful":0,"cool":0},"U4UEgTLGGa3tqj8i0A2NVw":{"text":"Excellent quality and superfast delivery. Always reliable.  Recommend all items on the men","useful":1,"cool":2},"GwquIJCqF1Ob0gdnHrUd7Q":{"text":"Very friendly service, but two plates of pasta, nothing exciting took 45 minutes to come o","useful":1,"cool":0},"sCD89U3DpqPP3jWeDcThbg":{"text":"The good: the food was great and the beers were cold. Our waitress was nice. \n\nThe bad: it","useful":1,"cool":1},"xl6ciTbzSUedzCoEtN97ZA":{"text":"I absolutely love this place. The Alfredo pasta is superb. All of the appetizers I've trie","useful":1,"cool":1},"9zjOCUcwJZRw0VuxQRdsLw":{"text":"Great place to take a date, ambience is on point and won't break your bank.. also the food","useful":0,"cool":0},"AeBisVw-V6ofAVe_dB-cdw":{"text":"Mona Lisa is the best of the best. Thin, but not too thin, pizza. Yummy garlic cheesy brea","useful":1,"cool":1},"rK1PgV7aDbFal4s6aV1TfQ":{"text":"The best pizza in New Orleans hands down!!! My boyfriend and I come here ALL the time our ","useful":0,"cool":0},"ywTqPCejcVbJXzCUsKy70A":{"text":"We wanted to go somewhere non touristy (is that a word?) for our trip to New Orleans. I'm ","useful":1,"cool":0},"zy8nAu9Tn5spZntIcxkjxA":{"text":"service was good, waitress super friendly and food came out quickly! food was delicious. g","useful":0,"cool":0},"WmH--RlF4DNZUKNUZy09SA":{"text":"Crazy amazing authentic Italian food. Pizza was very good. One match nicely very casual at","useful":0,"cool":0},"PKN-LFpZ1lRif0oQA2jjlg":{"text":"Delicious food.  Lasagna,  eggplant with marinara were both so good.  Probably our favorit","useful":1,"cool":0},"LJXRGW3s25sF7tdchUTfPQ":{"text":"This used to be one of my favorite restaurants. I got attitude when I went in, the food wa","useful":0,"cool":0},"SMJJ3-sQIyCQmWF4M2f9tw":{"text":"Excellent food and amazing service! Would definitely recommend! They were able to make me ","useful":0,"cool":0},"a4x7h37jxBUfnhcFKvh9Tg":{"text":"We ordered to-go on a Saturday night with no issues. Every time we come to New Orleans we ","useful":0,"cool":0},"w2l9Ozt4VO9UCGLXUhSOoA":{"text":"Cute Italian place in the quarter. Found this by walking past and really wanted to try the","useful":1,"cool":0},"QNuW3yWYVc1u2RSCxK-yhA":{"text":"I can't speak to the restaurant experience, but I can assure you that the delivery option ","useful":10,"cool":6},"RTgs3LyWwbu5HaTGjGNq1Q":{"text":"Delicious food; homemade both traditional and a creole twist. We had shrimp scampi and the","useful":0,"cool":0},"JpFFSo5Yc0LHGS3VT3mrPQ":{"text":"The Mardi Gras pasta here was very good. The portion size definitely could have been bigge","useful":0,"cool":0},"zbwsLDheA8D8Y2xCoH7Rmw":{"text":"My favorite restaurant in New Orleans - love their pizza, pasta and everything else. Love ","useful":0,"cool":0},"OCrIuDfXuyPwM1563zRFkw":{"text":"Waitress was nice food was good. The bruschetta sauce was the best I've ever had. Alfredo ","useful":0,"cool":0},"4CrPCggC4gGhbCfjd-_rSg":{"text":"We met friends at Mona Lisa while visiting NOLA from California. The owner is absolutely h","useful":1,"cool":2},"rqcFee8NgYH3jRrMGHGJcg":{"text":"Mona Lisa is an amazing meal in the French Quarter service is friendly and i haven't had a","useful":1,"cool":0},"DADPCyGz-zmzclpB4zES_A":{"text":"My favorite restaurant in the Quarter! Mona Lisa holds a ton of nostalgia for me.\n\nI've be","useful":11,"cool":10},"qyc_LSBFtCi-h02KCM2CjQ":{"text":"Mona Lisa is the classic neighborhood restaurant. It is not going to win a Michelin star b","useful":1,"cool":0},"PL1RRiJ9XPKbAlMR8UzQ3g":{"text":"Oh man I must say this little spot is 10/10. I was staying at a hotel right down the stree","useful":0,"cool":0},"G6MJMRo6LicRsIs4uimMeA":{"text":"If you're like me and you listen to Billy Joel's \"Scenes from an Italian Restaurant\" and w","useful":5,"cool":1},"1Hp-8XTicYiQQd_jmo_-mA":{"text":"Pros: their hand soap smells nice.\n\nInlaws liked their chicken Alfredo, save for the pool ","useful":7,"cool":0},"tr44zjTFMhVqVUGMFN591g":{"text":"I can't speak to the restaurant experience, but I can assure you that the delivery option ","useful":0,"cool":0},"6rpVVKufVbeGa1WyR_grng":{"text":"You might get lured in by the charming ambiance, but you'll stay for the tasty food.\n\nStaf","useful":1,"cool":1},"x8nlTOoRUT8cP61S8tZGxw":{"text":"This was a charming place, located a charming walk from our hotel. Yes, we ate Italian whi","useful":1,"cool":1},"LwtjgwiWatlamt3xwrA3vA":{"text":"I have to have my spinach lasagna fix every time my husband and I visit New Orleans. This ","useful":0,"cool":0},"oGYGGRT5s9nR8YM0FAodfw":{"text":"I am baffled as to how this place averages four stars. It is entirely possible that our ex","useful":0,"cool":0},"RxBXPlNu7jy_vochGEbHTA":{"text":"Nice little restaurant to escape the craziness that is New Orleans.\n\nOur wait was 40 minut","useful":1,"cool":1},"OK4CWZlUzeduGcbsbulTkA":{"text":"Nice lil (almost obscure) spot on Royal St. Cool ambiance inside with Mona Lisas everywher","useful":0,"cool":0},"TsZMYqXMBGOuQs4V8H2y8w":{"text":"SEPIA-TONED OLD WORLD atmosphere, candle lit, even checkered table cloths;\nFIRST DATE WORT","useful":2,"cool":1},"jtWEo4mAmlDA1vXFm7n6Kw":{"text":"Mona Lisa is a quirky little venue with walls covered in pictures of the Mona Lisa, some o","useful":1,"cool":1},"UBq0doMUWBkBrvfCY66hfg":{"text":"The people were extremely nice and went out of their way to go to the store and grab milk ","useful":0,"cool":0},"tfxRQ4CLPceG0gGtoNA6kQ":{"text":"Food was what you would expect in Nola for Italian food.  Not barf gross but just about li","useful":2,"cool":0},"8z3TV5Wa-EVblxUW7QyvMw":{"text":"Yes, 5 stars. My reason? This place is a must every time I travel to New Orleans. The food","useful":0,"cool":0},"az43ZUqYiqxrouNGi8QbVg":{"text":"Excellent pizza. Great little place in the French Quarter. Busy Carry out business. Laid b","useful":0,"cool":0},"G-YZdAT8wHOlDXhsJAsMmQ":{"text":"1 OF 7 RESTAURANTS I HAD TO REVISIT BEFORE MOVING OUT OF THE QUARTER. Yep, after almost 20","useful":10,"cool":3},"jfKbRQM30qZjz1eYW7hqbg":{"text":"Mona Lisa has great food. We were a party of 7 so it was a tight fit but the food was wort","useful":0,"cool":0},"zxmQeiWfI62ZKj02iVzrGg":{"text":"Great food! Really enjoyed everything here from the pasta to the pizza. Food quickly came ","useful":0,"cool":0},"Yi2lNX-XwVOadSQIAXdsdw":{"text":"Wow. Everything about this place was fantastic. The food, the service, the ambiance.  High","useful":0,"cool":0},"xctcsPLE-rJdxU9WuoK3vQ":{"text":"Awesome place! You must come here - pizza is fantastic and service is so accommodating!!!","useful":0,"cool":0},"zNh3WXuSGcMMAKUzJVUwZA":{"text":"Food  can be good, but owner/ host is just plain rude and bitchy.    If he's in a mood, he","useful":0,"cool":0},"k55btQqFybnsDTWYYEZczw":{"text":"Came here 5 years ago and it was fantastic. It was so good that we went 3 days in a row. I","useful":1,"cool":0},"wejaTAnmIc2D3d2VAZQ3Hw":{"text":"Listen, this is some of the best pizza I've ever eaten in my life! I don't come to New Orl","useful":0,"cool":0},"jF4AK89Xk-B9K_N1OA7UwQ":{"text":"One of my staple restaurants! I love the prices and the food. Such a beautiful place too!\n","useful":0,"cool":0},"wgWpU2VcYowaz7WXRxMNUQ":{"text":"Thank you for simply such a yummy Italian dinner, amazing service and very well priced bot","useful":1,"cool":0},"oIsEwYvH-dyOvxFW_9RyNw":{"text":"Mona Lisa is a lovely neighborhood place for good Italian and Pizza. It is the perfect pla","useful":0,"cool":0},"cyI4WpzRiVINCksB5dr23Q":{"text":"As an Italian-American, I've had waaaay better pasta. That said, my experience at Mona Lis","useful":3,"cool":2},"_0T098VPJQSh4kK0gIb3Cg":{"text":"Not sure why everyone raves about it, even my local friends. Eaten in three times and orde","useful":0,"cool":0},"9FSA_Bum3FCn9lTjKDtg4Q":{"text":"Just a quick note say THANK YOU for being here to provide the best Italian food in the Qua","useful":4,"cool":5},"nGs5xvEiwemIDl-qFwZMOA":{"text":"I'm a full blown Italian and let me say, traveling anywhere I'm skeptical about Italian fo","useful":0,"cool":1},"pcniCk5xXMiIwr-v0rkOBA":{"text":"Amazing staff! We loved the cute decor and hand drawn menus! Everything we ate was delicio","useful":0,"cool":0},"F5dAYvPBAVAcc_en94WGnQ":{"text":"My girlfriend and I decided to check this restaurant on a whim on night while visiting New","useful":1,"cool":0},"DHOIhURcNJPtGmnpR3T2CA":{"text":"A favorite of mine.  Food is always good, but service can be iffy.","useful":0,"cool":0},"tOMferwmErPGkQnMASN0Zw":{"text":"I came here wanting to try a Creole spin on Italian and opted for a shrimp dish with a cre","useful":24,"cool":17},"EPCJ1yhtFuYpvn2lIHSYPQ":{"text":"Love the decor, love the paper you can draw on the table, LOVE the pizza! I ordered a Vege","useful":0,"cool":0},"fV0F0uTTE8NOqrgJZ2rQ5g":{"text":"This place is a hidden gem. Arrived during dinner, and had a short. Manager asked us to wa","useful":0,"cool":0},"pI-WcjGlBFBAnSNt6bSKLA":{"text":"Loved the pastas and lasagna. Order early some of the most popular sell out. Loved our des","useful":0,"cool":0},"ja8_oV7daMJxcfyoKj3HGw":{"text":"Excellent staff and delicious food!! It's a cozy setting and you feel right at home! Defin","useful":0,"cool":1},"UpAVMmdE5FJzzZexdmzg4g":{"text":"Mona Lisa is on that quiet, less traveled part of Royal Street between the Bourbon Street ","useful":2,"cool":2},"WNZRTtXkRAmdZzOFx-3psA":{"text":"Decent! Got the lasagna, the pasta primavera with chicken, and garlic bread. The lasagna w","useful":2,"cool":0},"udYuh4HyvvlgSBEvPNQeFw":{"text":"Ok, it's been three weeks since my original review, and I'm here to report that the only t","useful":9,"cool":8},"AV2rvHNYlYBnQ_5zvXuZMw":{"text":"Host and server were great. They checked on our table multiple times and we couldn't have ","useful":1,"cool":1},"qm9GJFQ2zwejjg7Sb-yxTw":{"text":"Great little local spot for dinner. Far enough from the bourbon street mess but close enou","useful":3,"cool":1},"7kWG4GkDJoghP3OsS8Jnag":{"text":"Aw naw, hell naw, now you've gone and done it. \n\nI was having a good meal with a close fri","useful":7,"cool":4}}