{"Ark2Y4tEtRJtoxAggAzwdQ":{"text":"Very touristy but beggars can't be choosers when this happened to be one of the few afford","useful":0,"cool":0},"fLzSlTUAACVmQwKAl4Mp6w":{"text":"What an incredible atmosphere to sit and have a bite or a drink or both. Went here last ni","useful":0,"cool":0},"0t2dnEHraEjyA_veAww_8g":{"text":"First time visiting and the food was simply amazing! The server and other workers were awe","useful":0,"cool":0},"N7k7xVXeJRz4Z8vt1CBC0Q":{"text":"Yeah, it is a tourist mecca, but the courtyard restaurant is a great place to eat in the F","useful":0,"cool":0},"uSCilF3kvPN_GxnSsKZYfg":{"text":"It is pretty much what you expect. The Hurricane is strong and not that tasty. The piano b","useful":0,"cool":0},"4G4h5SdYRb_lXSCtRmlqLg":{"text":"The Hurricanes are GREAT!  Can't remember the name of the appetizer- it was a cheesy, shri","useful":0,"cool":0},"SJpvw_Qcl0Aj-1lRKDPf1A":{"text":"It was okay.  I had a sandwich that was okay.  My wife had some gumbo that was also ok.  B","useful":0,"cool":0},"rO4hwlmcpmqed67qnnx4EQ":{"text":"This isn't my first time at Pat O'Briens but it is my last!  The service was awful from th","useful":0,"cool":0},"KO9EThRoajmDABa7-hTgYA":{"text":"Came here to try the famous Hurricane and we were not disappointed! They did not skimp on ","useful":0,"cool":0},"RTPXafYTZ2RVbJB8SXP3Sw":{"text":"Beware of the awesome hurricane. They creep up on you. Cool chill spot. Def go inside to t","useful":1,"cool":1},"Zogryf7KhhZ7vamWm6_MbA":{"text":"Great drinks - def come and have the Hurricane here (and their other sweet, mixed summery ","useful":0,"cool":0},"cZULnvIkvG1dZbcMAzFOQw":{"text":"Wow this place is awesome. The atmosphere is great, but the servers are even better. The g","useful":0,"cool":0},"2RjIIvaZxcCugwVx3c3gNQ":{"text":"Ordered hurricanes, gumbo, alligator, shrimp étouffée, shrimp creole. All of it was very g","useful":0,"cool":0},"ByD_i0wvlCSR13xg6gN3fA":{"text":"This place is absolutely worth visiting when in NOLA. Go for a couple of hurricanes and th","useful":0,"cool":0},"iNiNlOf99DAZalQN_SNFnw":{"text":"Anna was our server and she was personable and fun! We had a great time drinking hurricane","useful":1,"cool":0},"vF2IGJvxbSam2kItC75wTQ":{"text":"Being from Orlando, I was a bit weary of dining at Pat O'Briens because I've always associ","useful":0,"cool":0},"1kgQUErBOzWYFJF2DfSKEw":{"text":"After visiting here many years ago we were excited to visit again while in town. It was sh","useful":1,"cool":0},"fYLy8TwgnUVcbfCWP_jC1A":{"text":"This is a must if you visit New Orleans. I give them high points for location, service, fo","useful":0,"cool":0},"wC1BbAKSLjyo8eE1E9e6vw":{"text":"Ok soo the food is just eh, and the drinks are a little pricey but its the home of the Hur","useful":0,"cool":0},"nDZNchhW5LEIRJxQj8ARMw":{"text":"This is a much quieter bar on Bourbon Street aka a breath of fresh air. You can escape the","useful":0,"cool":0},"xRGhSgUdtNl3PXcYnrJw0Q":{"text":"Great place with lovely ambiance. The drinks are strong so beware.  Went here two days in ","useful":0,"cool":0},"X2wbWNFNSuEoPD4pUmlT8w":{"text":"This place is huge and not a bad place to hang out on the weekends. They have a beautiful ","useful":0,"cool":0},"Nq5IzKpJ9rChwa5nsAqYmQ":{"text":"We stopped in for Hurricanes and apps but they were so crowded we could not get either. A ","useful":1,"cool":0},"GtL1mXOA8eBDZNGdDvFZ1w":{"text":"Great atmosphere!!! A Must see when visiting NOLA. A good spot for tourists and also for l","useful":0,"cool":0},"BKpVcsvGTtVx79r5B_mFQA":{"text":"Definitely touristy. Mid scale chain-restaurant feel with a nice atmosphere.\n\nThe Shrimp a","useful":2,"cool":1},"rWPXxjHJkXfbhBCnOO1o9Q":{"text":"We sat out on the patio and even though it was blistering hot outside, it was actually pre","useful":0,"cool":0},"6Q7_MTeqLh_FiGLmyy035A":{"text":"Had a great time this past Friday night. Server was upbeat, fast and attentive, food arriv","useful":0,"cool":0},"1FtRUah0g1KGVToNyBAu9A":{"text":"Best Blackened Chicken EVER!!!\nFreshest Fried Catfish, SSSOOOO Delicious!!  \nStronger than","useful":0,"cool":0},"SsyjmKjtEG3HlGuvPI50aQ":{"text":"We enjoy eating here when we visit Nola. We always get the jambalaya & red beans and rice.","useful":0,"cool":0},"EYAGUTH54T0bFOhlEc8MTg":{"text":"The food and hurricanes  were delicious had a wonderful time with my friends. Will definit","useful":1,"cool":1},"6CN7T7n0Io3sqSX6cSCECg":{"text":"We made a quick stop here after touring the French Quarter. It is worth stopping in to see","useful":0,"cool":0},"3PCQIFm67kFeXyLObiA7HA":{"text":"The place is nice, epic garden with good music and party. They have very good cocktails, t","useful":0,"cool":0},"Z6p0jWHspQPS-22Eb1QsSw":{"text":"We go to nola a lot and always stop in here for food and drink. Of course you gotta have a","useful":0,"cool":0},"_SnoMJ1bPH6kEbnK1weeLw":{"text":"We used the restroom and when we came back in, they said that we \"brought our drinks from ","useful":1,"cool":0},"v_TbIDzLUGpK9njnGJ1BRA":{"text":"John was very friendly and a wonderful server. The hurricanes are very strong.  It was an ","useful":0,"cool":0},"xYbvnKBZGTwmT3jKhaFlyw":{"text":"Had a great time at this place! First and foremost, the Hurricanes are a must try. Think y","useful":0,"cool":0},"LiG8gxyv95WT7IkOtFK4xQ":{"text":"This is a cool location (we ate outside) with good service and good food. We had the gator","useful":0,"cool":0},"yOPZRsNN7S4XsTp3bCmfUw":{"text":"This a a large fun place to go where you have a few areas to choose from to have whatever ","useful":0,"cool":0},"uixzHQ6UObEPg9kyngc2sw":{"text":"We didn't eat here, but it was a good little spot to sit in their courtyard and enjoy some","useful":0,"cool":0},"JMfKfGnpKlPP8j3DeBF3_g":{"text":"Food was great, we had alligator bites and fried oysters. Gumbo was good too. Service is g","useful":0,"cool":0},"dxyTDM_63B0fGSl3x3ldRw":{"text":"I planned my 30th birthday party in the Briar's Suite at Pat O'Briens, after shopping balc","useful":2,"cool":0},"WDBSFWjimY3D0a_1k9mUsg":{"text":"The must go near Bourbon Street if you want a classy spot to hang out.  Staff is extremely","useful":1,"cool":1},"tVOm9UDGFE-HBcBK9dXtFw":{"text":"This is a must go eat and see restaurant. Very good food, service and great atmosphere. It","useful":0,"cool":0},"-g6chKPm7j2hAaAuK_0SVQ":{"text":"We had a server on a Saturday night that was potentially the rudest individual in the hosp","useful":1,"cool":0},"-z4R_HR_PYJD1pCTyzfXrA":{"text":"Best food ever. Can't wait till we can visit again.","useful":0,"cool":0},"UiXPVRFpqIZmMXVnKBPP9w":{"text":"We ate here on Christmas Day evening after a 40 minute wait and the food was great but the","useful":0,"cool":0},"ues-xHR48gYwxbD3qwbwJA":{"text":"The hurricane is born and they go down so good here also the shrimp and grits are amazing.","useful":0,"cool":0},"V2PMYbc0ZxUVb_ZYvrhtfw":{"text":"Well, its a fun place and there are definitive tourist trappings involved here.  \n\nGood Se","useful":0,"cool":0},"3cVO2AgWSkvFVQkBHnBPgg":{"text":"Just note, the hurricane and most of their other signature cocktails are served in a speci","useful":0,"cool":0},"TfMymRE5Fue2uGT9DC9hMw":{"text":"We had a pretty good experience at Pat O'Briens.  The dueling pianos were outstanding; we ","useful":0,"cool":0},"4C5e54BJwHb_pNP5JWabOg":{"text":"Delicious gumbo and jambalaya can be found here! Not only is Pat O'Brien's a great bar but","useful":0,"cool":0},"49VzBkxQ_-Iik7TQsQyh-g":{"text":"Their Hurricane's are a MUST HAVE.  The courtyard is very cozy and a very fun atmosphere. ","useful":0,"cool":0},"gIZmf1gawEn1x_pQUcjw9w":{"text":"The food was absolutely amazing and very decently prized. The outside seating area is very","useful":0,"cool":0},"m9R6Nj9IGb4pNt56jwE5WA":{"text":"I was with a group of friends to shave dinner and drinks. We all had a great time. Our wai","useful":0,"cool":0},"6N_Wwp_oXX8VXc-9E3Q7Xw":{"text":"Hurricane drink was the least sweetest of all the ones I tasted.  My husband loved the cra","useful":0,"cool":0},"PwjJEcH46oggC7f1TAW3rA":{"text":"Pat Obrians was great! They've got three different bars, one of which was playing live mus","useful":0,"cool":0},"84IhU-lekKlY9iYaKV7Asw":{"text":"The bar and restaurant are good stops to make if your on Bourbon. The food and drinks were","useful":0,"cool":0},"2jHmUXv3kqmNtsPT4sMvvA":{"text":"What a disappointment \nI was here multiple times and always had an excellent experience. T","useful":0,"cool":0},"5GtNwvbGNNaw9qKTvfShXA":{"text":"We came here during our search for the best Bloody Mary in N.O. (if you've ever been to Ch","useful":0,"cool":0},"xJTNm5h_Z3YS_M_zJFdZ7Q":{"text":"Pat O'Brien's we heard was a go to in NoLA. We had some daiquiris because the wait was a l","useful":0,"cool":0},"Q-ky5NuA15UdJCFhIxOAEA":{"text":"Come here and order a hurricane! They've got a beautiful courtyard for you to enjoy the we","useful":0,"cool":0},"3odwyMuqSgdmsb3oveW9kA":{"text":"Just here for drinks and the Skylab & Hurricanes are great! Don't' forget to turn in your ","useful":0,"cool":0},"pTVnnjk_-vI1Bw-kduJwXg":{"text":"The bald bartender at the restaurant was very rude. He wouldn't even acknowledge us. When ","useful":0,"cool":0},"FYbFkNAfBVXqqVaBJJOEMA":{"text":"My husband and I stopped here for lunch one day while we were in NOLA and it was a great s","useful":0,"cool":0},"jl5GGhf36XobNBuoScp8-Q":{"text":"Absolutely a MUST GO TO BAR! Of course we got the Hurricanes... Strong and not overly swee","useful":0,"cool":0},"FwRc9bv6x-mSbTYGFYp4jA":{"text":"The NOLA experience rolled into one place!  OMG!  Especially if your time is limited, come","useful":0,"cool":0},"hIweCuL8BWYXWGCsQKCZVQ":{"text":"Ordered a Hurricane. He pulled it out from underneath the bar and handed it to us. It was ","useful":2,"cool":0},"ksJmHpffcF0m4vCytzNugA":{"text":"I have never been so disgusted by the service from a restaurant. The waiter was inattentiv","useful":0,"cool":0},"xyP2cgbDH80Nx6qlrHhh6A":{"text":"We had catfish appetizer, Cesar Salad, Gumbo, muffalatta. Everything wonderful!!!. Huge sa","useful":0,"cool":0},"IFz5whfwaa58n1VQJShTNw":{"text":"We went here after a show at the Preservation Hall. We of course had the Hurricanes. Prett","useful":0,"cool":0},"4EsChjYI9UmR8qLhRAYsUw":{"text":"Pat O'briens did not disappoint on Christmas day! They opened at 4pm...we opted to sit ins","useful":0,"cool":0},"gFpENTyMUBSq65fTVsvUEw":{"text":"This place was awesome. Loved the atmosphere and how quickly we were able to be seated, ev","useful":0,"cool":0},"5Gh95KV5YN8JEnAUVoxQbg":{"text":"It is pretty much what you expect. The Hurricane is strong and not that tasty. The piano b","useful":1,"cool":0},"_lxjXfC6kOxqD690CyiCYg":{"text":"We had to try it because we were visiting NOLA for the first time. I had the Cajun trio an","useful":0,"cool":0},"dFvoxdLIrvhm0IdVVxuYpA":{"text":"This was such a beautiful space, it was a shame to have had such a bizarre experience. \n\nF","useful":0,"cool":0},"ygROIQvJh7kuxgjVQdIYhA":{"text":"Went to this place two nights in a row when I was in Nola. It was that good! I had the New","useful":0,"cool":0},"P77EKYJ1fpmtwt71EzVbxA":{"text":"Kool place, good cover bands and of course the drinks!  Nice staff!","useful":1,"cool":1},"O0suU2X4FeKuc9jXU3U9XA":{"text":"Not my favorite restaurant I visited during my trip to NOLA. I ordered the trio which came","useful":0,"cool":0},"6GRLHWNKfPxaKZTxWdjofQ":{"text":"Love dueling piano bars playing my songs! Damn I feel old yet ageless at the same time! \n\n","useful":3,"cool":0},"sD70D7NbUJarovsmwepaJQ":{"text":"The courtyard seems nice but the Hurricane isn't by cup of tea. It's too sweet and too obv","useful":1,"cool":0},"iL-qusJUWS25OD1h2ydJTA":{"text":"Pat O' Briens for lunch was an ultimate goal because we needed to know what the hype about","useful":0,"cool":1},"4bXXI5pzBI7WWP5faiBFyA":{"text":"OMG the food was amazing. The service was exceptional, John is seriously too legit to quit","useful":0,"cool":0},"lZFonFmeITfJ3KIeG4j8hg":{"text":"Very good food!! I had the O'Brien Burger smothered in Blu Cheese...awesome\nService was go","useful":1,"cool":0},"3HBUCT7GgBhb_HPk_M2vJA":{"text":"Food was delicious! We had a party of 6 on a Friday night. The wait was about 30 minutes. ","useful":0,"cool":0},"gBMT7Qiw-w7OfUtRm6Z52g":{"text":"Out of all the options in the French quarter, avoid this place if at all possible. Total s","useful":2,"cool":0},"B79JnBDKtNjs29YzFNV4qQ":{"text":"Really enjoyed coming here during Mardi Gras season. The Hurricanes were the best I had on","useful":0,"cool":0},"E7QsLczABktOZUhkcc5zAg":{"text":"What a great place to visit for lunch, dinner or just drinks. Always lively and at night t","useful":1,"cool":1},"rhmecgI_LS6dSa7q4loSZw":{"text":"A fun environment and a New Orleans tradition. Get the hurricane and then try something el","useful":0,"cool":0},"834gZVn4rjdPDIdOlynRjQ":{"text":"The bald male piano player/singer was the worst person I've ever heard at this location in","useful":1,"cool":0},"huIXkO6_82wdgrSrSoh8PA":{"text":"Nice big burger! Had a real Sazarac drink! Service was a bit slow. Sat by the bar so it wa","useful":2,"cool":1},"KR0r7c5gtWubBu-dZXFWqA":{"text":"Beautiful atmosphere and friendly service, but food was Sysco fare. Fried duck and fried o","useful":1,"cool":0},"Ou8LEsTUXnGUlAcCjHY0rg":{"text":"Fun unique concept of dueling pianos and reasonably strong drinks (altho pretty pricy)! Ju","useful":1,"cool":0},"ML9ThQLAHq1jp9GO-qH3VQ":{"text":"Started off on patio with the great fire fountain. Dinner was great; so much food we could","useful":0,"cool":0},"wBTPqrK7lNQecTIBUBiY0Q":{"text":"Fun time! Something for everyone! Outdoor seating, plus two full huge bars-one with duelin","useful":0,"cool":0},"zJq_xFjAqI7uK_rGtBuPBA":{"text":"For a nice casual atmosphere I would recommend Pat O'Brien's. I had the Crawfish Étouffée ","useful":1,"cool":0},"REOQ-l36S08yUyMu7dHsLg":{"text":"Their hurricanes are slurricanes. One drink and I was done. Their service is amazing, our ","useful":1,"cool":2},"Cx894_JnI2UjrY4yYWVHrQ":{"text":"The menu promised grilled and marinated shrimp and house made dressing with my Caesar sala","useful":1,"cool":0},"tHwytHnouTkzOG5fqredMA":{"text":"Had lunch there and the fried shrimp was great!  Service was good considering the crowds.","useful":0,"cool":0},"PKFT_NfNOlVKrLMp43BSrQ":{"text":"Our server Jaruard is a crook! We ordered the magnum size hurricane and was told that ther","useful":1,"cool":0},"cxf2d6mgv0hzAjxzeYnVRw":{"text":"I always enjoy stopping by Pat O'Brien's when I visit New Orleans. The hurricanes are good","useful":0,"cool":0},"xySkRHgbTm-nwN_ZmPpo9Q":{"text":"Stopped in after spending some time walking down Bourbon. My first time in NOLA so we had ","useful":2,"cool":0},"Mnbfc2lHyMmjg3ifm1qJZw":{"text":"We ordered the Hurricane which was pretty good.\nI ordered the Rice and Beans which normall","useful":0,"cool":0},"y2GplSFqHHkXuY6wwP3XHA":{"text":"Pat O'Briens is hands down the most fun touristy spot in NOLA. The bouncers were friendly ","useful":0,"cool":0},"-aLVx3fF3V3iM4YlFvt9IQ":{"text":"Ok place to get a hurricane drink. Boy are they strong. Didn't try any food. But from the ","useful":0,"cool":0},"z8FCJjje2lWLfCL8Z2CSvg":{"text":"It was pretty packed so we ended up eating outside. This was to be expected on a Saturday ","useful":0,"cool":0},"gB0ICPjGDL4FYjhikhjSgw":{"text":"Apparently, this is a very touristy spot to visit on Bourbon St. while in New Orleans.  Th","useful":1,"cool":0},"_ArfOSO_nIYdURDduzeFcw":{"text":"This place is absolutely terrible! The two guys standing outside on 4/23/17 stole $20 from","useful":2,"cool":0},"sTqz1DC91cSFFwh5A324mw":{"text":"Please don't go here for the food since there are literally thousands of better places all","useful":1,"cool":0},"e8i5V_06c_l9JwK8jYT0Ig":{"text":"Food was ok . I liked it got better in kinder LA the girl who say us had attitude maybe be","useful":0,"cool":0},"ltaazhDEYpZNlra4AIYdrA":{"text":"Food was fantastic!!  Drinks were stiff!!!  Everything I expected and more!!!  Best shrimp","useful":0,"cool":0},"ZDNqYqYnmEAhgh3Reje6JA":{"text":"After a 30 Hour drive from Florida to escape hurricane Irma. Where would you go?  Of cours","useful":0,"cool":0},"YSwByuYZ5JlfUORW9Dm4XQ":{"text":"The food was good here however they don't  split checks which made things confusing. (Part","useful":0,"cool":0},"YTh6XWj4IoQoSGgtZhYEOw":{"text":"Great atmosphere! Love the courtyard and fountain when it's not hot and humid outside. It'","useful":0,"cool":0},"U4YRt7GqkUiF7WAiVMt7NQ":{"text":"We stopped in tonight after a day full of typical tourist activities meaning we didn't get","useful":0,"cool":0},"JCKurBQQRdm4V9iitQ63lw":{"text":"Hurricanes are welcome here anytime, what a place to let all your worries out, relax, and ","useful":0,"cool":0},"hGIVChLF4t3hezdoz2sVOA":{"text":"Outrageously fun. Hurricanes are their specialty and they are potent. Blackened Salmon was","useful":0,"cool":0},"_Qp7sIMWXlMGyfOLyDZu1g":{"text":"Came here for my BIRTHDAY - it was so good! \nGot a free drink for ma burfday! \nJohn our wa","useful":1,"cool":0},"ly2LSrDHY0WqYBNmPUq0sg":{"text":"This is a staple of NOLA!! You must stop by here at least once and grab their famous hurri","useful":0,"cool":0},"GdD38irBP-3_22XZb_XqXg":{"text":"Food was excellent, service was okay. Husband ordered a hurricane and was charged for the ","useful":0,"cool":0},"cyWbBU0XP71na7fai9mdsg":{"text":"Overall: Come for the hurricanes, stay for the hurricanes. If you're hungry, go for it, bu","useful":1,"cool":0},"wToCpzk3WZIvibHfjOdD1A":{"text":"Happy birthday to me with a free Hurricane! \nI ordered a trio and it was pretty good. \nMy ","useful":1,"cool":1},"8B_V0uogReWOKNTGVUuV-Q":{"text":"I don't have much I can add for Pat O'Brien's other than the hurricane's are legendary! We","useful":0,"cool":0},"HCwvmZmmuwlJjsdwixOqBg":{"text":"The staff was friendly, the atmosphere was relaxed and open, and everything was delicious.","useful":0,"cool":0},"fodoLEjqQ6fNnbZmLYZVLw":{"text":"I'd give yourself a two hurricane limit. 3 will have you sleeping in a bathtub. They serve","useful":0,"cool":1},"wfdG6XcqF7LYU2kPj4wvbw":{"text":"I love this place and only wish I discovered it sooner! When you first walk in, it's the r","useful":2,"cool":2},"lx9zaT5U6GiyWx-OjwM94A":{"text":"For some reason the locals aren't too fond of this place. Probably because it's crawling w","useful":2,"cool":0},"HXFskLMs_HiBdnU1O0Chng":{"text":"Pat O'Brien's is an oasis on Bourbon Street. My partner and I were looking for a place to ","useful":0,"cool":0},"-YML0-__KzSp1klE-wLqZw":{"text":"The food was excellent and the service was fantastic.  Would recommend this resturant. The","useful":0,"cool":0},"0eA8Qiw0MdT5i4Qm8SP0dg":{"text":"I was in NOLA Valentine's Day weekend. I was advised to check this place out so it being m","useful":0,"cool":0},"3sHF0REfmQgP-JxktmucLA":{"text":"Best jambalya ever!!!! Gumbo is mostly chicken but very flavorful! Beans and rice were del","useful":0,"cool":0},"qpo7RKfYY4UMeIZjoVNAVA":{"text":"Sit in the courtyard. Prepare for sugary drinks.","useful":0,"cool":0},"8gpsYPky_Df9dM1HHsFBlQ":{"text":"Pat Obrien\n\nWent in for late night drinks.  We decided to sit in the courtyard wish..I wan","useful":0,"cool":0},"NtU29ET35g6D7sZjCucZbA":{"text":"You may consider going just because it is such a landmark and the building is really cool,","useful":1,"cool":0},"AqQaPPHSHhSddAXTnOQaPQ":{"text":"Pat o briens was amazing, and the bartender Ashton was the most professional, generous, ha","useful":0,"cool":0},"INvZaTW_PYzIbZ5hDs1DMw":{"text":"What I can I say, loved the dueling pianos! Ordering a Hurricane is a must. Loved the spir","useful":0,"cool":0},"PuX-Wg_AV4kDucxipem5NQ":{"text":"You HAVE to go here when visiting NOLA. My father in law and mother in law went here when ","useful":1,"cool":0},"v0pLAJyJtGg5raCrHg_r8g":{"text":"Our bartender Ashton was hilarious and v cute A+ love this place. Great drinks and even be","useful":0,"cool":0},"UbAqmF7hd81C491SAG7hgQ":{"text":"Stopped in for a hurricane on a Tuesday night. The bar was jumping & the piano players wer","useful":0,"cool":0},"r1of8q_Awnfd2zUUzDOqXw":{"text":"My husband and I are enjoying a Hurricane at the famous O'Brien's! We are sitting in the w","useful":1,"cool":0},"IJvO7G5pVGvmRzsCZOvmwA":{"text":"We were looking forward to Pat O'briens our whole trip. My wife wanted the hurricane and I","useful":1,"cool":0},"6cFAesMmiIfkZJ07QgG8Vw":{"text":"Wife and I were in town for some business and also celebrating our wedding anniversary. St","useful":0,"cool":0},"99kqgyvVwO3YKdqkd5lxHw":{"text":"I love this place because its been there soooo long. However, it is a tourist trap now and","useful":1,"cool":1},"vXKzn9-yIGFPSB4JzbxTKw":{"text":"A vegetarian's dinner review: why the title? You'll know if you're a vegetarian, what a ha","useful":0,"cool":1},"rwvPMMZoXjQN8xmpd0iGIg":{"text":"Another wonderful night at Pat O's in the courtyard with friends and family enjoying their","useful":1,"cool":0},"NE8oLJie3tftHEp6Crci1Q":{"text":"Excellent food, excellent value!  Don't miss the hurricane... or the opportunity to take h","useful":0,"cool":0},"QN2o6FlGu2VMWNAuscE1sQ":{"text":"The salmon was wonderful and our waiter, James, was amazing. I'd come back for the fantast","useful":0,"cool":0},"MC5a87MIF6-wevmQTfVQSA":{"text":"In my opinion, Pat O'Briens lived up to all of the hype. I will say the courtyard for drin","useful":0,"cool":0},"nJ3azYzPMIpB01VmEHlm5g":{"text":"Had a great time, drinks and food were both great and we were able to bring the kids. Not ","useful":0,"cool":0},"ht90rFNBI7JAyxGg3npfsw":{"text":"Pat O'Briens is world famous.  My buddy had been telling me leading up to our trip to dine","useful":1,"cool":0},"AuujD1k6K6lxR_eQAGoDUg":{"text":"The best service at the bar. Look for Steph and Donald. We loved the food and drinks. So e","useful":0,"cool":0},"IVJptS4Ae1duGh-M8kwdLA":{"text":"You can't go on Bourbon St in NOLA without going to Pat O'Brien's and ordering the famous ","useful":1,"cool":0},"T4G-3SBzErsJW8HhDm2_VA":{"text":"Just visited NOLA for the first time and this was the first restaurant we ate at. Had the ","useful":0,"cool":0},"OzM-p_1hua38LG3G-VNTHA":{"text":"If you go to New Orleans this is def a spot to check out.  They are known for Hurricanes, ","useful":1,"cool":1},"VcIBkrSg1iZq5H6vphidIA":{"text":"My group went here on July 4th to kick off our vacation.  The service that we received was","useful":0,"cool":0},"oC6MskXsyy3fjNdVIV6TDw":{"text":"Although I'm more of a local, Pat O's is usually a stop I'll make while in the quarter. Th","useful":0,"cool":0},"mLI4FlOPy3BwDBAJRle2dg":{"text":"Had to stop at the landmark. My parents have hurricane glasses from Pat O'Brien's so I had","useful":0,"cool":0},"hnjJfcdwaXz7FMe4wBr5pQ":{"text":"Beautiful patio, incredible fountain. The drinks are spectacular. Classic spot to visit wh","useful":0,"cool":0},"AwRHq1drdbVf3ZE7XP7ECg":{"text":"We decided to have our informal wedding reception party here since it was a great package ","useful":3,"cool":0},"uddTPPxDw6nI4sibtd9nhQ":{"text":"Visit this courtyard!  Need a break from the hustle of Bourbon Street? Pat O'Brian's court","useful":0,"cool":0},"SiAkFp-uvEh_79szSlGsXQ":{"text":"John W was our waiter, so much fun and inviting.   The food is is great!   The jambalaya i","useful":0,"cool":0},"Kc7zYhe7WYbkEHBVDX2M_A":{"text":"This may well be a New Orleans favorite but the drinks they serve are LAME. I've had more ","useful":1,"cool":0},"DzRtTEALkPuSyAQPBRmUqA":{"text":"Our bartender Anthony was absolutely amazing! Had a fantastic smile and was there to make ","useful":2,"cool":1},"Fc6AsZMqhKEyFTxzq0DeUg":{"text":"I'd heard a lot about how delicious Pat O's was supposed to be, but our experience was jus","useful":1,"cool":0},"4cmVceTiv9Eyp__kedUSJA":{"text":"Wonderful place which ended up being one our favorite hangouts while in NOLA. Our first st","useful":0,"cool":0},"g4Crb25A7ZOnmiyznCq9qQ":{"text":"Such good seafood, salads, drinks basically ALL! Wait wasn't too long and the Hurricane dr","useful":0,"cool":1},"yzzCK7I59l2WmA74Ap5tlQ":{"text":"Went in for lunch @ 2:40 PM on 12/16/16. Been there every year for the last 15 nostalgia b","useful":1,"cool":0},"lirTlrRIcCaCBACEvW8Dtw":{"text":"We popped in here for a late morning hurricane, or I did and convinced my wife to do the s","useful":0,"cool":0},"9GGFrjgIY41zIxsElq2iKA":{"text":"Worst Hurricane I have ever tasted. There were many empty tables but a 30 minute wait to b","useful":0,"cool":0},"VZthG3lJxz1BX7qPiVphfA":{"text":"OMG!! So yummy. I would totally recommend the alligator bites. They are so deliciously scr","useful":1,"cool":0},"cE4igSJkZQWLHUvX4HSRfg":{"text":"So this is the 3rd time we've visited Pat O'Brien's on Bourbon Street. They are known for ","useful":0,"cool":0},"9wKOMJljHEp_YejNCqZsjA":{"text":"I got the shrimp creole and it was to die for! Authentic Louisiana food, our server was so","useful":0,"cool":0},"ZQeFbaN4Ud-QS67DBuq6pw":{"text":"We stopped here yesterday to get out of the heat and grab a bite. It was pretty packed, so","useful":0,"cool":1},"2wCtwCho3pv_i2s810Q6aA":{"text":"Friendly wait staff, very busy during mardi gras. Home of the original hurricane. Had etou","useful":0,"cool":0},"4wHmMBuFmC8bvu1OZQwDuQ":{"text":"Nothing good can be found in the French Quarter, especially when it's a chain..Wrong! I ac","useful":3,"cool":4},"yKy-o6CIr92BTC59Iq7Mvg":{"text":"Stopped by this place after a cemetery tour to rest our feet, grab an appetizer and order ","useful":1,"cool":0},"1gu8VXZODaZOYFqfwb5_Lg":{"text":"Great atmosphere and outdoor dining. Crawfish etouffee was absolutely amazing and service ","useful":1,"cool":0},"mfjPD1UJBKw7GX6Vh9CanQ":{"text":"Do not come here if you have allergies. We were seated quickly. We were served quickly. Ou","useful":1,"cool":0},"IZXbdLBaQ9f20oc-AzB8xA":{"text":"The locals party here! The tourists party here! They have the BEST hurricanes in town! The","useful":0,"cool":0},"t5knEWIsidPA3b6tVxFPyg":{"text":"Awful! When you've been drinking hand grenades all night and you're totally drunk, you wan","useful":3,"cool":1},"c1u1PJqUgVZEg5-IjtuwNw":{"text":"We were in New Orleans for a bachelorette weekend and all of us girls wanted to visit a pi","useful":1,"cool":0},"CGs6b8KxzF8fPwe5UAi_3A":{"text":"Although I'm more of a local, Pat O's is usual a stop I'll make while in the quarter. The ","useful":2,"cool":1},"7WFIAZQ5QtVk5iI3M4Lntg":{"text":"The seating was very cool and exciting. We were seated by a really pretty fountain with fl","useful":0,"cool":0},"hoEAYDeye4FeiYLmyPVZLg":{"text":"Just got to town and stumbled on Pat O'Briens which was a recommendation to us. Busy busy ","useful":0,"cool":0},"5bk-UljbbcTRPm30GDqqgQ":{"text":"Omg DELISH!! First of all my server Sabrina luv luv her & Ashton the bartender awesome!! T","useful":0,"cool":0},"WSsF_vdGwTtXZBhF22SFEQ":{"text":"Pat O'Brien's is known for it drinks but it also has a nice courtyard restaurant. It leads","useful":4,"cool":1},"Hlx4RU1st9mPKroVX8E2mA":{"text":"This is definitely a tourist trap, but it has been around for ages and we actually got a t","useful":1,"cool":2},"4O0pUJqOGe-olLCLlc6RHg":{"text":"They make the best mint Julep ever! Staff was pleasant, food was good as well as the ambia","useful":0,"cool":0},"U8FwoFpFDvqsCCqZuioKbw":{"text":"Aside from the fact that a COCKROACH FELL ON MY SHOULDER while I was outside at the bar, t","useful":0,"cool":0},"mFtHDrAlvPkGdUTLNL-juQ":{"text":"We were looking forward to dinner here.  We were a bit cold outside so asked the hostess i","useful":0,"cool":0},"BwYN8CLp-OibogbH4vzeBA":{"text":"Crawfish Etouffee  Delish. We came on a rainy afternoon so it wasn't very busy, server was","useful":0,"cool":0},"g5WvNHoVIaBS3zKIqpu9aw":{"text":"Super touristy spot. And I mean total tourist trap. But with that said I do like stopping ","useful":2,"cool":3},"0_noMbbyBcWdeVpuIsJBlw":{"text":"Great service, excellent food, and amazing atmosphere. Hostess and server were above and b","useful":0,"cool":0},"XEFvhH5SG0PVI584NJmHIw":{"text":"I got the spinach artichoke dip pasta which was to die for! It was a game changer and they","useful":0,"cool":0},"nIVulRm749KgUTvZE1MRhA":{"text":"A must stop when in NOLA on bourbon street! First, get the hurricane to drink. Real strong","useful":2,"cool":2},"UBc9dfsQeKNwREtoBN7nlg":{"text":"We had the BEST bartender while we were there and the atmosphere was a refreshing change f","useful":0,"cool":0},"K6sqQQJm-pkHmTeWBVQKRg":{"text":"As most of us who visit here, I was here for the Hurricanes. At Mardi Gras. So this was a ","useful":1,"cool":0},"COnKEFU2ycReB-VXih-Ftw":{"text":"The outdoor seating is super cool and the hurricane was delicious. \n\nJambalaya and gumbo h","useful":0,"cool":0},"gTmIJ9dAxDbghLeybaDe2g":{"text":"Didn't eat, came only for the famous hurricanes! The courtyard was nice with a big fountai","useful":0,"cool":0},"5au1ExhtI6bHQi-0AvMwSA":{"text":"Absolutely loved the ambiance. Such a great layout, indoor and out. It really works. It's ","useful":0,"cool":0},"WB4p2tx6vxceb24-3UtdAA":{"text":"I don't know if it's a smart idea to have more than one Hurricane- these drinks are potent","useful":0,"cool":0},"qzJd1p_Xm6BcSxlVjNOM5w":{"text":"As you come in to this almost private spot, you find that there's a party inside. It felt ","useful":1,"cool":1},"dqcGCY9dw03xZSoi2VVuAQ":{"text":"The girls at the front of the patio restaurant side were rude and uninviting. We stood in ","useful":0,"cool":0},"tGmvCs9t0rix5je0jONjJw":{"text":"Ask for the New Orleans sampler it's not on the menu but it is you get a cup of the Jambal","useful":0,"cool":0},"AZlorCS7ZC1OfkKx-h_cjQ":{"text":"Good drinks and a beautiful courtyard fountain area. Didn't try any of the food but the am","useful":0,"cool":0},"EzVEWDhPgTIG7K7AU11q6A":{"text":"Well we normally avoid Bourbon Street like the plague, this place is worth the trip. The c","useful":0,"cool":0},"LMBFbp4k0liRpxjLInS1iA":{"text":"The food here is delicious. We enjoyed the crawfish gumbo, shrimp and grits were out of co","useful":0,"cool":0},"9pgkjctG4eDhV9JDAqtK0Q":{"text":"We went to this place on a Saturday afternoon, the court yard had the ambiance of a frat p","useful":0,"cool":0},"Oei2k3teUg7-Kmfj77vXjA":{"text":"I have been on several occasions, some for dinner, some for dinner and drinks, some just d","useful":14,"cool":13},"WLWQIpdBCV6VM9vVKgR1jA":{"text":"This bar did not meet the hype. Drinks were overpriced and low quality, the crowd made it ","useful":0,"cool":0},"N80x6xMhK-fKQrcsFQG1Hw":{"text":"Wonderful drinks! If you go, order a Hurricane and it will knock you on your ass. For $9, ","useful":0,"cool":0},"R89J9Nxgu2HfM0fn7LGo-w":{"text":"This is a NOLA tradition! Show up, order a hurricane and enjoy one of the best patios in t","useful":0,"cool":0},"BJ2SioM48PE-39nm8v0tGA":{"text":"My boyfriend and I stumbled across Pat O'Brien's courtyard & we were not disappointed at a","useful":0,"cool":0},"ICG1UnU4Ply2o3ml5iOZVQ":{"text":"Strong hurricane drinks. Piano musicians that play customer requests. A unique experience","useful":0,"cool":0},"KjoExsWe38ezYHc3qaMEmw":{"text":"Went on a Tuesday night, we sat at the bar. Had a few Hurricanes. Service was quick and th","useful":0,"cool":0},"2BHzAuFU3Dl_Cs7Ds-MsNw":{"text":"I was on Bourbon Street the Saturday before Saint Patrick's Day. I felt as if I had walked","useful":3,"cool":2},"QDpDX4_r7GfJC_csdiYCwg":{"text":"Pat O'Brien's is a staple in NOLA! Their hurricanes are a must try and their food is prett","useful":4,"cool":4},"2T8Gj36N3H1TJqh7L4wlaA":{"text":"Cool atmosphere, but very disappointed in the meal today. Ordered salad and requested no o","useful":0,"cool":0},"0pES-aqfaknaX8WltEWu0g":{"text":"15 of us ate together here last night. The food was pretty good and the only real ding wou","useful":0,"cool":0},"sZI-JcDs3OkWr8_Xc3zlIg":{"text":"Boy oh boy, do I love Pat O'Brien! After doing my TONS of research on NOLA this place was ","useful":3,"cool":0},"d52tuwpg2IKz9a798a_lew":{"text":"LAME!. Nothing New Orleans about this place. Terrible food. I saw rats the size of small d","useful":1,"cool":0},"XjPWZkk7PUCCf-VSgNmWag":{"text":"When in New Orleans, you visit Pat O'Briens. (Right?)\n\nThe courtyard is always a great pla","useful":3,"cool":1},"WuodC302ZrLipGnxIW_Olg":{"text":"So if you come to New Orleans this is one of the landmark eateries you have to come to and","useful":0,"cool":0},"dr2udB7txytltPMxAfy4XQ":{"text":"Visited the last time in NOLA, Pat O'Brien's is an institution!  Have to have a 'Hurricane","useful":0,"cool":0},"Vxya_cVAXofswC7YNByaUg":{"text":"Such a great place for a casual lunch. Can accommodate big groups. I got the Cajun Shepard","useful":0,"cool":0},"o7l86C3Xim8YuoQqOwJrMQ":{"text":"Awesome bar in New Orleans.  You must come here for the original Hurricane.  They are just","useful":0,"cool":0},"S20fRkEDaOFJJPX00XCvCg":{"text":"Hurricanes are AH-mazing! Really the only reason we went but we also had fries and alligat","useful":0,"cool":0},"glZIBtaVJ3hDWiLQq-uWZw":{"text":"Average at best. Courtyard is nice to have a drink if not to busy. The hurricane they say ","useful":0,"cool":0},"BPlrUmA5Kxneis4WfpgE1w":{"text":"We ate here twice during our trip. The first time the food and service was very good. The ","useful":0,"cool":0},"YiWg3kVjgna1qQ1WD-4aHQ":{"text":"Good touristy place.  Hurricane was way too strong and no seating.\n\nAlthough we were here ","useful":0,"cool":0},"qtGfH7FZwFl_Yo7dLWLTTg":{"text":"The perfect tourist stop. Good food, good drinks....AMAZING atmosphere. Was a bit of a chi","useful":0,"cool":0},"ybrf8_hzZTaqLKtFBiHJXg":{"text":"It's one of \"those\" places you have to go if you visit NOLA. I can see why the locals avoi","useful":1,"cool":1},"OScHFIxtIXDjvtI3RKiD2A":{"text":"The catfish is amazing!!! Don't forget to drink the Hurricane.  And the service is very at","useful":0,"cool":0},"bj0xwSVVSxoHhmm0HcW68A":{"text":"Touristy. No beer on tap. Hurricanes are definitely their specialty drink-wise. Food is so","useful":1,"cool":0},"F3tUrGPYS9uPFwoWT95qCQ":{"text":"Great location. \n\nI have to admit - I was a bit intoxicated when we stopped here to get th","useful":0,"cool":0},"B7XP4iuIpo0X0nQxTdGhNg":{"text":"Cute courtyard bar where we ordered classic Nola hurricanes! This is a nicer bar on Bourbo","useful":1,"cool":1},"lOKo4UTKPaS0FxIgpP-G7w":{"text":"Pros: none\n\nCons: food was microwave heated catfish strips. Wasn't told after we sat down ","useful":1,"cool":0},"g6weO_TVXg6aCRdBtIk7mA":{"text":"We went there on 3/16/15 for dinner. First, the waitstaff acted like they could not care i","useful":1,"cool":0},"b8fv3tlmEhMVnHzL9x407g":{"text":"First time in NOLA and had to do the tourist stuff. Pat O'Brien's came up and we headed ov","useful":0,"cool":0},"kU9YvNgTcm5UsFNvSvemJg":{"text":"We stopped in in the afternoon and sat at the bar. Greg was the bartender and he was great","useful":0,"cool":0},"8ga1jpmH7z8CgtiDxvPirw":{"text":"Excellent service! I had the special of the day which was fried oysters with spinach and a","useful":0,"cool":0},"gPM3NbvkF6XvA5BPSFViRw":{"text":"It's a must if you are In New Orleans! Traditional hurricane and jambalaya are two things ","useful":0,"cool":0},"lBta1vjPx3tu9EEPvHjOTw":{"text":"What's not to love about Pat O'Briens.  I think everyone that comes to NOLA has to go here","useful":0,"cool":0},"o23uvd0G3yLqGImAiZLqHg":{"text":"Shepherd's Pie was delicious...outdoor patio lovely...great service...\"trio\" with jambalay","useful":1,"cool":0},"kupLQAmIcyqnRkklH1JETw":{"text":"Hurricanes. Bar food. Good service. Just about all you need to know. \n\nService was quick a","useful":2,"cool":1},"2gOcMJ5Wtlvy0VNnMtF5mQ":{"text":"Great food at reasonable prices.  Wonderful staff was incredible accommodating for our par","useful":0,"cool":0},"sYBahZXQZeTcPY0aiklOJA":{"text":"The food here is absolutely amazing! Best gumbo I have had by far. I also had the Bloody M","useful":0,"cool":1},"M-vZq-rWfQFvHcI8uXh-EQ":{"text":"Ate lunch here with my boyfriend. We got seated and waited about 15 minutes for a server t","useful":1,"cool":0},"8I6FfGwvqgGlk1iYOrs7qg":{"text":"F this place.....I wanted some food but these guys want to tell me their is wait for table","useful":0,"cool":0},"zhGWRGpjUVEjy_6F3_WruQ":{"text":"Stopped by for the famous Hurricane drink. Man, it was strong! We were tipsy off one drink","useful":0,"cool":0},"S0ZgcNVY945uji-x4IodPw":{"text":"The shepherd pie is incredible.  Don't forget to cash in your hurricane glasses for a $4 r","useful":0,"cool":0},"dtkEIAjqptAo8cMHamus8g":{"text":"This is one of my favorite restaurants to eat at in New Orleans. The food is cheaper compa","useful":0,"cool":0},"B05-tYoNHHn_VHPoRSfMRg":{"text":"The staff was good but our waiter let us fall through the cracks. First time ever going to","useful":0,"cool":0},"PoMc6oPJ_dzmGTb7O0wUfQ":{"text":"No wonder they are famous for a drink called the hurricane, the staff is determined to blo","useful":0,"cool":0},"P5S9-B1g4pl9BPVhRwwWVw":{"text":"I loved this place! This was my first visit and I was impressed. Great service, great drin","useful":0,"cool":0},"kITpcpuPm6NXUlrLV8uOKg":{"text":"We came here after walking around for the French quarter festival. We were hungry and read","useful":0,"cool":0},"nUolhvmd3UWtVb8zuFNdUA":{"text":"I was very surprised with my great experience. I was concerned about eating dinner at one ","useful":0,"cool":0},"UcGCJsp4P9yFAco4bw5JkQ":{"text":"We all ordered the hurricanes to start which was fantastic. We decided to eat here as well","useful":0,"cool":0},"oTycsYem45TyYWZiFxAvKQ":{"text":"The Best Place to eat/ drink by Bourbon Street. It's just magical. This was the 1st place ","useful":0,"cool":0},"izYasV6YhdGF_1T4fSIk6A":{"text":"Food was ok. The service was not very good. I think the first person we spoke with was a m","useful":0,"cool":0},"CdKcPOkal7mp8R6u1bln3Q":{"text":"So much fun! They have two pianists taking song requests on napkins. Really good energy, f","useful":0,"cool":0},"9-GFlPnUt-9pxaUZe1uGOw":{"text":"A fun place to go for the best hurricane in NOLA the dueling pianos are a blast . You can ","useful":0,"cool":0},"HpF3ma60TkLxt34s887RZg":{"text":"Service was excellent and the food was an equal match. Very fun atmosphere and lovely food","useful":0,"cool":0},"p9x4xicyjHxKjrnMbbGr7w":{"text":"Only had hurricanes, which were good and strong, and fried alligator, which was decent.","useful":0,"cool":0},"Ky-kMAoRJLhPx3dx-sNMNw":{"text":"Went to this place to get a few drinks. They charge you $4 extra per drink and you have to","useful":0,"cool":0},"UTLWBJnF30MPqaWjpQzQrA":{"text":"Thank You Donnie and Jazz for keeping us company as soon as y'all opened the doors. Had a ","useful":0,"cool":0},"0DGTumhKB78ixWIlBR5M4A":{"text":"Very good service and great food! The alligator bites are so delicious! I also had the cra","useful":0,"cool":0},"N1s87dohIcVFtBbkjz27JQ":{"text":"Donnie is the best bartender! He made our time here 100 times better! So much fun! Great v","useful":0,"cool":0},"XCk0l5zFOh3Dp4MnIppKaA":{"text":"I didn't want to go here as I had been years ago and thought it would be too touristy but ","useful":1,"cool":0},"eyOZzLNEPNuvGtlnpF1mYg":{"text":"I'd actually give it 3 1/2 but since you can't do it, 4 is ok.  What makes it good is it's","useful":0,"cool":0},"NCzCaVRJUxenMMcTH49OEw":{"text":"THE CRAWFISH ETOUFFEE!!! It was so good!!! And I appreciate your waitress bringing out wat","useful":0,"cool":0},"TaVXXTKmqrh3RJVuyvoSNg":{"text":"Regardless of what people say, I love Pat O'Brien's. Yes, it is extremely touristy but tha","useful":5,"cool":1},"fwlwXibLtee-Z69gTrdDGQ":{"text":"I wanted to try a restaurant on bourbon street for the experience so we tried. I was impre","useful":0,"cool":0},"Lu3ejmiOK_i0BA7q2c-pdA":{"text":"Service was a little slow because the place was swamped. But staff was friendly. Food was ","useful":0,"cool":0},"K2qeaN-nSBbK_39HJmCp-Q":{"text":"Beautiful place. Fantastic dinner. I honestly thought it was just going to be bar food but","useful":0,"cool":0},"p1umhLWicJiNRAr76xvOBw":{"text":"I gave two stars because the courtyard and bar are beautiful. everything else, not so much","useful":1,"cool":0},"nu3yRLsU6IR5bC_aH10ukw":{"text":"Very pleasant experience. The food was really good. My party had a variety of food and no ","useful":1,"cool":1},"cZQth2nNIrQbZXMKA-04VA":{"text":"Stopped here and got a hurricane. It was exactly what everyone said it would be. The barte","useful":0,"cool":0},"H2g8TUlLE_Vh2s4xkEw8jw":{"text":"This place does not look like much from the outside but it was surprisingly nice. I was a ","useful":0,"cool":0},"GpI6JnY_JvKK5UJqDRA8xQ":{"text":"I love Pat O'Brien's and Hurricanes, but am disappointed this time. It tastes so processed","useful":0,"cool":0},"lO1HcriDNFCLLbCe6Foj1g":{"text":"Although it is extremely touristy and really sub-par to the rest of NOLA establishments, c","useful":6,"cool":2},"Bmb9WxFRKJkvaUjo9fEu-A":{"text":"Great place to grab a drink and socialize. Must try the Hurricanes. Employees always ready","useful":0,"cool":0},"KOwJDoBakozMPxYGYW8yuQ":{"text":"This is a must for your New Orleans experience.  Recommend a drink and maybe dinner in the","useful":0,"cool":0},"SEvofg7dS449vvAEyHu6jg":{"text":"Probably my favorite bar I went to in NOLA. HUGE bar with quite a few different venues for","useful":0,"cool":0},"O-458EzdPiaYvHEM-eZgHw":{"text":"This place was a great time! The drinks were all strong and delicious...Eric and Joel in t","useful":0,"cool":0},"888BpLVx2YdoMcoLJUHCpg":{"text":"Don't remember too much about this place because we were bar hoping before we got here. Th","useful":2,"cool":3},"AJSRe0iCetplo1DYe0bNbg":{"text":"Decent food but I think their drinks are what make them- this is a good touristy place to ","useful":0,"cool":0},"OkVSslYfv42oFKI_6aSqLg":{"text":"The nice courtyard was a welcome relief to the chaos of Bourbon Street! They had the heate","useful":0,"cool":1},"DMon1RMKLcykrryLUop3yA":{"text":"Add this to your New Orleans bucket list, even if you just stop in for a famous Hurricane.","useful":0,"cool":0},"NFaewz4RLu7XnRTM6GhiLg":{"text":"I expected better. Drinks are good, nice atmosphere but the service and staff on the food ","useful":0,"cool":0},"8VemxBZLErtdfWGEymF1ig":{"text":"The waiters and waitresses were very attentive and nice.  Even with it being mardi gras we","useful":0,"cool":0},"iBfET7OAbrmDKFjAyd9VZQ":{"text":"Ordered the shepherds pie and a green salad. It had a little spice to it. The flavor was g","useful":0,"cool":0},"s9aBi3bEZ_7hG8PISNNHZQ":{"text":"Are you in New Orleans, are you hungry, do you want the best Hurricane in town? If you ans","useful":0,"cool":0},"HLbG_SpXe4Oq5zXt5djrCA":{"text":"Great time , Dual piano bar after dark . Awesome staff , built in 1750's historic French Q","useful":0,"cool":0},"dry0rMDjLcKJWfwDeKAsvA":{"text":"The Hurricane tasted like a refreshing cool aide and the souvenir glass is a great touch! ","useful":0,"cool":0},"lycaOSBpC3copWO89rMJVw":{"text":"Beautiful patio for dining and a separate patio with a beautiful water fountain with a fir","useful":0,"cool":0},"FRl2uCVCPdtJYgI3uTHOPg":{"text":"The food was pretty good. The service definitely could have been a little better but it wa","useful":0,"cool":0},"XKd6KJapyRhljIuYnhD0Rw":{"text":"I don't know what happened. It used to be so much better, maybe an off night.  It took for","useful":1,"cool":0},"K_9Qwy0KW6YNJGqDdSYuMw":{"text":"A place to get your hurricane on when visiting N'awlins. The hurricane is one serious drin","useful":0,"cool":0},"fFwHfmy9SUbZyg9CYLCEKg":{"text":"Samuel is the modern Elton John #killinemsoftly\nJoe has a mustache that will give you orga","useful":0,"cool":0},"n5mjVqQ9ydHGPlcvF0dXVA":{"text":"My friend Lynn, who grew up in Nola said we would regret it if we did get the shrimp creol","useful":0,"cool":0},"j3SyJiwmhoT54YFrJhGvsQ":{"text":"Had a nice time here, great atmosphere, but a bit expensive. We will be back and recommend","useful":0,"cool":0},"XQkg1B9x5vgRs_-60iNcWQ":{"text":"We came here on a Thursday and it was pretty busy! The hurricanes here are a must try. The","useful":1,"cool":0},"HAl1bPG69FP0s160jvgVjQ":{"text":"We went fo the piano bar and a hurricane.  The hurricanes are my favorite drink.  You defi","useful":0,"cool":0},"juisEcdtZBgQnlC53RzlKg":{"text":"I went here because of the hype around the hurricanes. Honestly, I was so disappointed. As","useful":0,"cool":0},"Z5ccqplqtZy7-CMQsFXc-Q":{"text":"Pat O'briens is an institution to good \"dranks\". This is the home of the Hurricane for a r","useful":0,"cool":1},"55o5w3lbnYzSHreOf7EAlA":{"text":"BEST Hurricanes you will have in your life.  All the waiters are super sweet and friendly.","useful":0,"cool":0},"jCD5M7iSMUd6eroe1g1biQ":{"text":"The crawfish etouffee was actually really good. Top notch.The shrimp Creole was.. Hard to ","useful":0,"cool":0},"5tJ8GF11hiUGtX321Tm9xw":{"text":"Awesome atmosphere. Both indoor and outdoor seating. My boyfriend and I each ordered a Hur","useful":0,"cool":1},"RecMXMSzygsHkiqiToTw3A":{"text":"Came in on a Friday afternoon for a late lunch, server was nice but he had a lot of tables","useful":0,"cool":0},"7oMgRhG2LDG6k1VDjTT6Vw":{"text":"Pat O'Briens may be a tourist trap on Bourbon Street, but it is a must for visitors. We've","useful":2,"cool":0},"C108RyHhN8gBI_DLWKrjSA":{"text":"So I feel a bit apprehensive regarding this review. Pat O'Brien's is a staple of New Orlea","useful":0,"cool":0},"CGsKAUQ08Trkyq9wj6CFeg":{"text":"Do not understand how it is rated so high. DEC 26, 9:00pm, ran out of specials.  I had ipa","useful":0,"cool":0},"xjOMthpQxeGStOhIQ_VPRQ":{"text":"Good food. Fun environment. THE HOME OF THE HURRICANE. Just about everything here taste go","useful":1,"cool":0},"1-UUAZgOfH-aljCwHao4KQ":{"text":"Good ambiance. Pretty fountains. Medeocar service and food. The food was served cold.","useful":0,"cool":0},"oHLqQmQf2IQDJmis27mOeQ":{"text":"We were directed here because the bouncer on St. Peter's street told us that we had to wal","useful":0,"cool":0},"Dv-K4QrML97wZ95UnRnCFg":{"text":"Food took way too long but the service was great. Good genuine people! I would go back! I ","useful":0,"cool":0},"pkYn7_xOn8y4h069QxiiHg":{"text":"Proper example of old school hospitality New Orleans style.  Sat outside is the courtyard,","useful":1,"cool":1},"IEUfJYsfkBPo-z7FYeUMcQ":{"text":"I went here for my 21st birthday to grab some drinks and my waitress was awesome! I ordere","useful":2,"cool":0},"aHfHBx42tFDVKUwddtFhVA":{"text":"Place is over half empty and they seated us by the kitchen  doors...\nDecided to leave as i","useful":1,"cool":0},"2EFBhz-AEb149Cf9mwd5Gw":{"text":"This restaurant is located right on burbon street, which is a great location. I went with ","useful":4,"cool":1},"DUY6dkZW3MLDBkYWoz0hdA":{"text":"Being on Bourbon St I didn't expect much and we went for a dinner and to check out the fam","useful":1,"cool":1},"TZBwDP9YLf3e4RGZ7JIjNQ":{"text":"Super friendly staff! Great atmosphere! Best burger on Bourbon Street!!!! Get Derrick as y","useful":0,"cool":0},"1SC4wnw1Ynzzxf9hbbyeyg":{"text":"The perfect tourist trap! This is the place the Hurricane was invented and certainly worth","useful":0,"cool":0},"AprchpGl7AYHXA_TMR2hIw":{"text":"Another mandatory stop in New Orleans, Pat O'Brien's. Creator of the Hurricane. The backst","useful":6,"cool":7},"vlsotImIv2_oRTq0gHTcHw":{"text":"Possibly the worst mojito I've ever had.   Brown mint leaves, limes weren't squeezed, and ","useful":1,"cool":0},"jRHXsu5yiRZX8rWkHBd_Yg":{"text":"This review is based solely on the bar facing Bourbon Street. I stopped in a few times to ","useful":0,"cool":1},"CddZuiZx1ZJS_HfsiSR2lg":{"text":"Had a great experience was with my brothers visiting and I had my toddler with me . Was wo","useful":0,"cool":0},"lNe1pWn_FrmQpvxrwzFD_Q":{"text":"Came in with my daughter excited for the experience\n\nWaited 90 minutes for our food while ","useful":0,"cool":0},"DjIFLMUeubcmBrU36-1D_g":{"text":"Stopped in here quick during our walk down Bourbon Street to try one of the infamous Hurri","useful":0,"cool":1},"UHDwnxQ8nNLISw-lZsDcXw":{"text":"All I'll give this place is the Hurricanes since beyond that, this place may rip you off! ","useful":0,"cool":0},"ZCQq5ak8TRDW_sb6kp-Xfw":{"text":"Yeah... really not a fan of this iconic New Orleans biz. The Hurricanes are good, but note","useful":15,"cool":6},"PsGt13siA1G4eW3awvq5Vg":{"text":"We of course had to stop here! We intended to just stop for drinks but realized we had mis","useful":1,"cool":1},"AoqlrZifwvpBVDppXn4erw":{"text":"The outdoor patio courtyard is amazing and a perfect spot to sip on some drinks. The hurri","useful":3,"cool":2},"mSzcdDRS9u-7upwqks8w2g":{"text":"The bartender intimidated me into leaving a tip.  He said, \"miss, you didn't sign your bil","useful":2,"cool":0},"CeCinqs4iBf54du6M-9Qvw":{"text":"Meh. I know this is the original Pat O's and that should make it a big deal, but I really ","useful":0,"cool":0},"wDO2BD3ff7Uexn7Zbqo7WQ":{"text":"Major meh - the birthplace of the Hurricane serves drinks that barely deserve the name, on","useful":1,"cool":0},"_cfM13-nNYFfewyOG0sVHA":{"text":"Ohh my what has happened here is a tragedy.  For many years I couldn't truly be in New Orl","useful":2,"cool":1},"iUjilSsMoAd6vgHiivMMJA":{"text":"Spent about an hour in the piano bar before heading to House of Blues with my cousin.  She","useful":2,"cool":0},"WWVVpgWqwPlsXpIGVi4KQg":{"text":"The food was great and the prices were reasonable. The place was noisy, so avoid if you wa","useful":0,"cool":0},"pJJvXqwUvViJr5MKCyvY7Q":{"text":"Customer service was impeccable and so was the food and drinks. This is a great experience","useful":0,"cool":0},"4Je84gMyrWCAtaKih2TmNg":{"text":"Hurricane drink is a highlight, but the burgers are fabulous! The shrimp and grits entree ","useful":0,"cool":0},"WfLeIiQ37Pfz9iJaHhFKDw":{"text":"I really did not have a great experience here. After hearing so much about it, I had high ","useful":0,"cool":0},"KqRBtwqflqCNkpRJ0Naxbg":{"text":"On my stay in New Orleans, me and my parents loved spending time and having some drink at ","useful":0,"cool":0},"-HPJYv3ujqBw1myMIqjyHA":{"text":"Must see when checking out Bourbon Street!! The Hurricanes are fabulous and if you are vis","useful":2,"cool":2},"n-OESbbt7UrofEVxhzlmhw":{"text":"Definitely touristy but the hurricanes are strong and good and you can't beat the courtyar","useful":0,"cool":0},"W-3Xb_M0dlXKcbaklPrR6Q":{"text":"Definitely something to go and see while in New Orleans. No longer get the glass to take h","useful":0,"cool":0},"IdqyzRABdLcTkdtG7fk8jA":{"text":"I have experienced the worst service in this restaurant today. My server Lester was not fr","useful":0,"cool":0},"jt5zkd1sia21xKC8Go00cg":{"text":"Mint julep and crawfish ettoufee...got carded and all so they made me feel young I suppose","useful":0,"cool":0},"7maJvsB-MaSQo7cy_xSwZA":{"text":"We had Alligator Bites, crawfish étouffée and blacked chicken with beans and rice. I also ","useful":0,"cool":0},"G4BrmTQkk1d8jPYO5s8CrA":{"text":"The drinks were over rated but good. The alligator bites and sauce were very yummy! Fun pl","useful":0,"cool":0},"UCpngdlwYI7ktHcyTvrdBA":{"text":"Loved this place! My boyfriend and I came and sat at the bar on two days of our three day ","useful":0,"cool":0},"BLePpss6qvGIRVYCYFQr1g":{"text":"The food was fantastic the waitress was very friendly, Good Vibes, lovely Courtyard oh, an","useful":0,"cool":0},"fetZTSVLNSh-MnnIaJZwlA":{"text":"We went during the day so it wasn't as crowded as I'm sure it could get at night. The drin","useful":0,"cool":0},"wgbgp_kvbrDUk9RuRqp7Gw":{"text":"The heaviest chairs I've ever used! The chair were comfy too.\nClaim the 3$ charge unless y","useful":0,"cool":0},"uvOQ-kNkywlUaQ-WCNfi0g":{"text":"Amazing garden.   The bartenders here are so funny, and the servers are always friendly.  ","useful":2,"cool":1},"wr31hGXwtR-VflnsFWbISQ":{"text":"Went here for the famous hurricane drink and it did not disappoint. It was fruity and stro","useful":1,"cool":1},"09BhqNjpZfj-K27523Auaw":{"text":"The best deal for a killer huge, (did I mention killer, lol)hurricane, THE BEST SHRIMPS AN","useful":6,"cool":3},"L8PrF1BOSMUC7qkvqw4tiA":{"text":"Never been to a bar quite like this! Pat O'Briens has a beautiful courtyard and 3 bar area","useful":2,"cool":1},"d6DXPC_TmsFe6FzbZOZDgA":{"text":"The food was great. Service was terrible. Rude waitress who was snooty and nonexistent unt","useful":1,"cool":0},"N5tCsmcgP0filsW4LTRorQ":{"text":"Went to the bar and it started out wrong with the bartender acting like he didn't want to ","useful":0,"cool":0},"lZsxwcGbfH9GgVLax66meg":{"text":"We waited a while for a table and the hostess was pretty rude, but once we got seated we h","useful":0,"cool":0},"A369jBxiwHkTg2gvPotHRA":{"text":"The food at pat O'Brian was amazing. Had seafood crab cakes. Perfectly prepared and season","useful":0,"cool":0},"gXyJ3wKRjEDCaErooZ4i7w":{"text":"UPADTE BELOW:\n\nGreat drinks, good food but service sucks. We waited for something as simpl","useful":0,"cool":0},"qvJD7PeZQuppQac8nGxgbQ":{"text":"My first trip to NO, and I visited with some friends.  It's a little confusing as you ente","useful":0,"cool":3},"G0NDlHTGdH_r9ofGfey-eA":{"text":"We went there to have Hurricanes and sit and chat.  We were looking forward to the atmosph","useful":1,"cool":0},"e2CB3ULDiwcodAvKErbkvw":{"text":"We hit the ground running as soon as we got to New Orleans. We were starving after our roa","useful":3,"cool":2},"RDn4Xsn_gOJXKBz4qP-3Fw":{"text":"Came here during a rainy night for a casual dinner. I got the muffuletta sandwich which wa","useful":0,"cool":0},"jOC4DzZlL05AJaLDeOVxkA":{"text":"Historic, great location, and great drinks!\n\nI'd highly recommend stopping by upon arrival","useful":3,"cool":2},"D6PmBtQLxrxtM5GOBkK49A":{"text":"I had a great time at this place.  The dueling pianos played requests.  I submitted a requ","useful":0,"cool":0},"wTfzOCy--Rfgj3Hlr70IvA":{"text":"First of all, outstanding bartender Greg, made the best recommendations. Catfish strips, a","useful":0,"cool":0},"0o74U56QxjQ0lvgKbIVPYA":{"text":"I got bad service and I didn't tip. Specifically, when the bartender got around to taking ","useful":0,"cool":0},"YT4d6Q8u9amLAgeUVg45LA":{"text":"Continuing our day drinking in New Orleans, we stopped in the famous Pat O'Brien's for a h","useful":0,"cool":0},"hETaDoHW_4UYPogVrDQFwg":{"text":"Only didn't give 5 stars because they didn't have jambalaya or egg rolls that we ordered. ","useful":0,"cool":0},"EcXGsPazwZ2A6RC2BNXSDw":{"text":"Quintessential Nola drink, cold, refreshing, and pleasant to drink in their courtyard!","useful":0,"cool":0},"IEQW_dAPbd4x1giCaSHGFA":{"text":"I got the Sazerac. Not the best one ive had but so worth the price they charge! The courty","useful":0,"cool":0},"50lYxPF3-nfe_THFYvP5Ug":{"text":"Oh my gosh the Sheppard's pie was amazing. I ate the whole thing. The Bloody Mary was deli","useful":0,"cool":0},"5knYxMJ-uIBF6CVM8aCDTA":{"text":"We came in mid day on a Sunday and there was plenty of room in the courtyard! Angela, our ","useful":0,"cool":0},"cfuxz4_BO3vc3W4onBKX-w":{"text":"For an iconic restaurant.. in a prime location.. they have great service, snd consistently","useful":0,"cool":0},"kJrNGkDK1wnOlOxrxqEmxg":{"text":"After decades (literally) of hearing my Aunt rave about this place I was excited to go whi","useful":0,"cool":0},"H4wyiCYEbdILkCKOZ57HFw":{"text":"The dueling pianos were cool. I don't like that they automatically charge you for a souven","useful":3,"cool":0},"dBVOETMsfmtT1QDyaydpaA":{"text":"We went here for an office party during the Keller Williams national convention. The priva","useful":0,"cool":0},"vVyLWzvftV19CTzAEYkgcw":{"text":"Came with a large group of 11. They sat us right away outside in the patio. This place is ","useful":0,"cool":0},"pJ29JPHlkQOGCb0-NP-Ujg":{"text":"Visiting Pat O'Brien's evoked college road trip memories of Mardi Gras. And that was the l","useful":0,"cool":0},"TM2pWCSCCl1f8T2ahoKJLg":{"text":"We so wanted to like this place. Really. We had three days in NOLA & made sure we got over","useful":0,"cool":0},"xF_3MCW_J_f6rJCfLtwH-w":{"text":"We went here after my sister and brother in law came in because we were told we needed a H","useful":0,"cool":0},"kurvSi1AI_Ml19FWW4ko_A":{"text":"Cant split checks. Chris' attitude is shitty af\n\nFinishing these drinks and getting food e","useful":0,"cool":0},"SOVHMvNb8ffKHavSFj9qPQ":{"text":"Y'all! This place is bomb! It's conveniently in the French Quarter on the strip and has mo","useful":1,"cool":0},"iMowRSgirRE3ZbH90yIlJw":{"text":"Service is pretty awful here. It's very bare bones. We were served hurricanes without even","useful":0,"cool":0},"0z--Sf7a2-vaCHVbJfBwBw":{"text":"They're famous for their Hurricanes but my favorite drink by far is the Rainstorm.  A perf","useful":1,"cool":0},"JFdyjZ7AGQ4kuhO9DtqmcQ":{"text":"I had the Seafood Etouffée, and Bread Pudding with Whiskey Sauce and the obligatory Hurric","useful":0,"cool":0},"_Gfn7JCeIazxFAmTi-Sn1g":{"text":"I was with a bachelorette party and the bartender yelled at us that he hoped we got rooofi","useful":0,"cool":0},"KtmOh7QDueLnAyEa0x6A6A":{"text":"This time, we brought our kiddo and tried the food. The restaurant is family friendly up u","useful":1,"cool":0},"DP4o1JX7Gxp3BpR2YXojLg":{"text":"If you don't come here to get a Hurricane, did you come to New Orleans? We got to this pla","useful":0,"cool":0},"o_M0qXIjaTF3rT9Bh33t9g":{"text":"Pat O'Brien's is one of many, and iconic, places to get a drink in New Orleans, especially","useful":0,"cool":0},"Ov9tM-ZXHUMsB4wuZIyrjw":{"text":"Exactly what you think it is.. touristy, fun and right in the heart of bourbon. While many","useful":0,"cool":0},"-faM9R-in86IOhtcWbE0RQ":{"text":"Omg!  Blackened red fish was sooo tasty.  Gumbo was hearty and delicious.  Shepard's pie w","useful":0,"cool":0},"xuzisd5rc14FVj-jGNDbcA":{"text":"We went to this place for drinks after hearing a lot about it.\nFirstly it's a HUGE place! ","useful":1,"cool":1},"MbdugVrOmAtsY9oYfpE8oQ":{"text":"Hurricanes are as good as everyone says they are! The environment was also so comfortable ","useful":0,"cool":0},"Xjx3PJdr0eJpup7lqsWYmw":{"text":"Overall, my experience here was good, not great. There was nothing that completely wow'd m","useful":2,"cool":0},"Wm5qQfRrFd9Rmyp-o3Kb8w":{"text":"We were exploring the French Quarter and came back here 3 times. The outside patio is awes","useful":1,"cool":2},"7opf8Lro4tUaEliWFBL7VA":{"text":"Good food, out quick and the hurricanes were excellent. You forget while if the quiet cour","useful":0,"cool":0},"OSj7qbjMXvsCmvDJHkYsdw":{"text":"Can I give ZERO stars?!\nThis place is below average - food and beverages.  Don't waste you","useful":0,"cool":0},"5EcTxQVQqRFyhjEmN9-YWw":{"text":"Went there for dueling pianos. Tommy Cruz was the best waiter I think I ever had. He had a","useful":0,"cool":0},"noULMuv-rbr-7u4PZSE9Eg":{"text":"Great food. 30 min wait was reasonable. Loved the Crawfish ettoufee. Jambalaya was good bu","useful":1,"cool":0},"OWfuj-HXQZIVRZt4DheVsQ":{"text":"First of all tourist only. This is a great place to get some mediocre Cajun food and an ok","useful":1,"cool":0},"eRsJLhV24a3F7AiDakf75w":{"text":"So I'm in New Orleans on business from California and my friend raves about this place aft","useful":0,"cool":0},"DVCg8OxQ_Ifgw2iim-GOig":{"text":"We went here for dinner and of course their amazing hurricanes. John was our waiter and di","useful":0,"cool":0},"apcRKxp5mNH6PI_Is4L9Pg":{"text":"After a decade of yearly touring Pat O'Brien's in NOLA, San Antonio, and Orlando; we consi","useful":1,"cool":0},"HxV62AE-HVVsAJd1MYw85w":{"text":"Raymond (Ray Ray) was a delight! He was the best server ever. He anticipated our needs and","useful":0,"cool":0},"LnPLIz7u7p2Ltd9xw6KPYw":{"text":"Known for their hurricanes, but their bartenders are pretty awesome!\nEvery time we come he","useful":2,"cool":0},"najFFjEAjWz6XsJcbPqleg":{"text":"Busy, loud, and great. I was shocked at how quickly our large party was seated, given how ","useful":0,"cool":0},"dDB2ysHEZJO--uX46TAYQg":{"text":"After arriving in this amazing city for the first time, a friend said \"make Pat O'Brien's ","useful":2,"cool":1},"JydAntKjJaSR71APHH9qWg":{"text":"We had lunch at Pat O'Brien's on St. Patrick's Day, 2019, and I was pleasantly surprised. ","useful":2,"cool":2},"YCir6PNWavLIGU3IQ_DIpw":{"text":"Well....had lunch here today. I had the shepherds pie. It arrived quickly, mainly because ","useful":0,"cool":0},"Ox-T5BHDUKaCVCh7pUxq6w":{"text":"I love the ambiance that this place gives. I stopped by this place because of the countles","useful":0,"cool":0},"Zpp1cjAM-jSAP20olVB_IQ":{"text":"Great Restraunt with good food and good service. A must do if you're in the French Quarter","useful":0,"cool":0},"lGkMRq95MmAKEBnNySjszg":{"text":"I've been to New Orleans a dozen times, yet this was my first time at Pat O's. Kyle was my","useful":0,"cool":0},"D_U41YoBGyX0-q_YwjwrxA":{"text":"We enjoyed our meal there. The best part was our server Angie. She is super friendly, know","useful":0,"cool":0},"cyHUVSkFJTwTiB4GuIXEog":{"text":"We stumbled upon this place walking around in the afternoon.  This is not your typical Iri","useful":13,"cool":10},"wKzfW6TNjVunbTvAhw7BVA":{"text":"I live in New Orleans and I can say the food is typical. Most food on the menu is cooked h","useful":0,"cool":0},"s-FiEllczNSJwDjMbLIGhg":{"text":"This is a must do experience in New Orleans every time you go. It's not a tourist trap and","useful":0,"cool":0},"g9gvuTvQ4M4Pm3SEu8TMTw":{"text":"Wow!!! Just wow!! Stopped here for a snack while going down Bourbon street. We were someho","useful":1,"cool":0},"BXrJfK-N3od9MroWKXzIZQ":{"text":"Absolutely the best crawfish ettufee I've had in New Orleans. Now, I'm from St. Louis. I'v","useful":0,"cool":0},"OoNPjj5xn6E5ylsPBXutjQ":{"text":"Stopped in and had a hurricanes and an \"iced tea\" . The hurricane was pretty sweet but sto","useful":0,"cool":0},"lMHcFMufJH2aEMzp9DzeZA":{"text":"We went during Thanksgiving week and it was a blast. We started in the courtyard where we ","useful":1,"cool":1},"rg31FTlweFmwj8qrmSJTfg":{"text":"Lord have mercy, that New Orleans trio. I could decide what to get so our waiter, Chris, s","useful":0,"cool":0},"KTKCND5pYRsFavWFv6bZnw":{"text":"Bang for your buck: 8/10\nQuality: 10/10\nService: 8/10\nAmbiance/Location: 8/10\nOverall: 9/1","useful":1,"cool":1},"6gNfnxQg8JLGVNFgyQo5nA":{"text":"This place was great. The atmosphere was nice and the folks were friendly. The drink was S","useful":0,"cool":0},"OwLxzQsczmj25ZjQ7sup3g":{"text":"This was our first experience in New Orleans and Tevin made it awesome! He is a hilarious ","useful":1,"cool":1},"XjLVPLWtHM5Dhws6kqddag":{"text":"Had so much fun on the Patio at Pat O'Brian's. Just as much fun now as it was in the early","useful":0,"cool":0},"PIw2-v8GuqIrhAzTaHreEg":{"text":"Came to Pat O'Briens for the drinks and we tried the hurricanes since they're the most fam","useful":0,"cool":0},"KC8fPLq1v5-VUfr_vK93jQ":{"text":"Server was horrible. food was OK.l though. I'd recommend going to a different restaurant o","useful":0,"cool":0},"XcE2fOJPwDE7s4L8eBDhBQ":{"text":"Had to come here for the famous hurricane! \n\nThe rumors are true. The drink is quite stron","useful":7,"cool":5},"RrbhN2gM-t3UoK0QNC1gmA":{"text":"We walked into the Courtyard and where we sat down was only selling bags of chips so we mo","useful":0,"cool":0},"LIGxRMccWGHM4mn17hFDEA":{"text":"Laissez les bons temps rouler!!! Let the good times roll!\n\nI mean, c'mon...it's freakin' P","useful":1,"cool":0},"Hkwuvvxeo-zZbLS1ghl4bA":{"text":"The place used to be good when it first opened. Now the waitstaff look like crack heads an","useful":0,"cool":0},"Xck7q4XE1LuBePBvlgwmgg":{"text":"Came here while on a girls trip in NOLA. This place was highly talked about for the infamo","useful":1,"cool":1},"aNYFCMikES8zTY5Y4kjURA":{"text":"This courtyard was an absolute gem in New Orleans! Although I wasn't a big fan of the \"Hur","useful":1,"cool":0},"kIjCCDU8nDByLjG4shVx9w":{"text":"Really enjoyed the food here. I got the Red Jambalaya while hubby got alligator bites. Sta","useful":1,"cool":1},"oPocrVtXh6r-1M8Y30J3SQ":{"text":"The Original Hurricane! Cannot go wrong with their staple! \nSipped on that baby fast due t","useful":0,"cool":0},"PvUcObjeJcxLDXzmT1IORg":{"text":"Courtyard at Pat O's is very nice in the evening with the fountains and fires going.  Food","useful":1,"cool":1},"HRHEzOyd0yDTORVBiG3O5g":{"text":"I love this place! They keep the heaters on for you and are very attentive. Everyone's got","useful":0,"cool":0},"x1KSrOnox1yJd4qouBD7mQ":{"text":"Amazing place! So many different places to hang out (piano lounge, separate bar, courtyard","useful":1,"cool":0},"2bGwqNuxL65q9HXuIMbRBg":{"text":"Red Jambalaya was great and the Hurricanes were even better! Service was great, best Jamba","useful":0,"cool":0},"d654W7eMf0DWF1jhsI6a0Q":{"text":"Give this place 3 stars food was good. Drinks were good but the bartender was awful and ha","useful":0,"cool":0},"KRfZ6Yli-3o9Tpqrh2suEw":{"text":"Been here before sat outside for a drink to chill came 2 nights in a row and had the same ","useful":3,"cool":3},"Qo5hGKuL8SkMVQsbYr0Bbg":{"text":"The O'Brien burger is legit. The red beans and rice are worth the trip from North Texas, b","useful":0,"cool":0},"ojpK3pDSrfq-TzJHz0L1JQ":{"text":"We've only been here for a small amount of time and our waitress is awesome. She's given u","useful":0,"cool":0},"lWRwHhqZAAz2XbpU5XH44Q":{"text":"Home of the hurricane. Very good drink - must have if visiting. Be careful as it quickly s","useful":0,"cool":0},"VSt-tSc2Vh27iduEDgXYzw":{"text":"Nice atmosphere, however if you order a specialty drink they charge you for the glass with","useful":0,"cool":0},"2HJUKuDxuyt6-L7iZ8CcUw":{"text":"Perfect lunch spot for a good bite and great drink on Bourbon street. Claiming to be the b","useful":0,"cool":0},"d1HkuvlRsHtdZi0S4yjfdg":{"text":"We ate here our first night in NOLA. Had an amazing hurricanes here!! Even had my first al","useful":0,"cool":1},"PCxH4fI5z8hLSNubbZhMGw":{"text":"Well needless to say this was mine and my husband's 1st time to NOLA! yeah I know way over","useful":2,"cool":2},"THN6SA4KoPRjAZ8GBizrgQ":{"text":"Food (shrimp and grits & grilled mango shrimp app) were very good, highly recommended howe","useful":0,"cool":0},"yFiMD9vI4cGzjWbImTRWDw":{"text":"Had a quick lunch the out first day in NOLA and the food was pretty good. The waitress was","useful":0,"cool":0},"tSraK9kdhh7nzGY4_QGD6Q":{"text":"Love Pat O's, and been going there all my life, but I've got a real problem with the way t","useful":0,"cool":0},"sPnpqiqJe1hTvHgHItTY3w":{"text":"So we were told to sit at a table in the front bar area you had to order food.  This was f","useful":1,"cool":0},"9lC78hnM6UE3i2ceOMSYmg":{"text":"Great place, great food and great service. A nice vibe outside dining. Enjoying my first n","useful":0,"cool":0},"bytdbEm-tCvv8vM-MSAZ4g":{"text":"We were told that if we are in the  French Quarter, Pat O'Brien's is a must.  We went for ","useful":0,"cool":0},"VMF8zGUx4UPKMOktFLDI2g":{"text":"So as I was in New Orleans I had Pat O'Brien's on my must stop at list. Well it did NOT di","useful":2,"cool":1},"vE1CEfHCjwcbAdgQGxuwcA":{"text":"Pat O'Brien's Ratings: 3.9/5\n\nFood: 3.5/5 - If you are visiting NOLA, you have to go to Pa","useful":3,"cool":2},"ASGw1wVpG8rV9UaT1KIbDg":{"text":"Coming from Houston, TX. My first trip to New Orleans with my parents who are frequent vis","useful":1,"cool":1},"8YZkzX0GBtQn7tmyGJDahg":{"text":"Derek wasn't kidding when he said best bread pudding in the world.   It's is so good. Yumm","useful":0,"cool":0},"x6hF9T0cWxXGxow3PnP2sg":{"text":"Come here in the afternoon, it's essentially an oasis to escape the beating sun. Plenty of","useful":0,"cool":0},"jbc7EIe5C0kYbsE2B-vQdQ":{"text":"Pop in here early in the am for a quick bite. Everyone was very friendly and dressed nicel","useful":0,"cool":0},"Hk8wefqBfuiwo9AK4fkXVQ":{"text":"Pat O'Brien's. One of the famous bars in NOLA, and of course I had to try it out. A nice d","useful":1,"cool":1},"c4bkHSoTYxV8wxswx1dypw":{"text":"We started with drinks...Hurricane and a Category 5 Margarita. Both excellent! We had gumb","useful":0,"cool":0},"Fm-_sP-G4ZOabrjP5_02_Q":{"text":"Unfortunately, not impressed with this place at all. Every other place we have been to so ","useful":1,"cool":0},"XHxhMwuYBC29G8ZjPR3qzQ":{"text":"Pretty bad experience. Came here Labor Day weekend and this was about the only place open ","useful":1,"cool":0},"wKH52JH854PumGmcyfLKQg":{"text":"The atmosphere in the outdoor seating area is great. You have the fountain with really nea","useful":1,"cool":0},"bVNu-FcgMLkgDY-XQ0du6w":{"text":"For as touristy as this place is, we actually really enjoyed our time here!  It's right on","useful":5,"cool":3},"R6j-2jr9wqhwoDpE97JdBQ":{"text":"The Hurricane was good, the Long Island was pretty meh. It was super diluted with ice so I","useful":1,"cool":0},"nX6Oso11Bt6Ik86D5sLpEA":{"text":"Great place to eat and enjoy the atmosphere. Angela was an exceptional server. The best we","useful":0,"cool":0},"YzlwIjn2BHEGQiu4QuzYiQ":{"text":"Love Pat's O! Had the catfish strips for the first time with cocktail sauce and hot sauce.","useful":0,"cool":0},"iomYDfGR_df1tBoLGz_9KA":{"text":"Pat O'Brien's means two things - party time and a Hurricane.\n\nThe outdoor bar was packed w","useful":7,"cool":8},"-qd9gQb5nN6PkR2vD75wYw":{"text":"Friday night looking for a nice fun atmosphere outside with some food.  Decided to try thi","useful":1,"cool":1},"bqoYQ2OfmADPPSyuSi7guw":{"text":"I would've loved to have dined at Pat O'Brien's on New Year's Eve if only the three waitre","useful":0,"cool":0},"fQguEv8VvDjwhWsVbnRQug":{"text":"Glad I visited this business that is known for their \"Hurricane\" drink. The appetizers are","useful":0,"cool":0},"pYuC35iutzjgypnfZG-JoA":{"text":"The location is towards the end of Bourbon. Perfect if you want to get a good meal and sta","useful":3,"cool":3},"Tix5SV-QKw1DEwA2ielVOQ":{"text":"I drunk the Hurricane Kool Aid and bam I forgot my name. Pat O'Brians is that place you wa","useful":4,"cool":4},"hh4biJz5FyoPfzX4f4_Psw":{"text":"The huge courtyard in the middle is the main attraction IMO. You can't order or eat food i","useful":1,"cool":0},"-leLivXxsbyUD91cN_MdXA":{"text":"I have had alligator bites many times, but these were THE most meaty AND tender.  The dipp","useful":1,"cool":0},"-T5kQllxibrVVbh97MerHA":{"text":"This is my second visit to New Orleans and even though my friends tell my local friends te","useful":2,"cool":0},"W2rSk6M-m6za73pqIBe7_w":{"text":"Went here last night with my family and it was amazing! The waiter, David P was fantastic!","useful":0,"cool":1},"ZjEZIpHtpj2dThrn2uAmOw":{"text":"Pat O'Briens is multiple experiences. We had both a 5 star and this 2 star experience in d","useful":3,"cool":1}}