{"qvCNnSkDqjg3oCexS1-juQ":{"text":"I have been a loyal customer at Magasin Cafe for years, it's what made me fall in love wit","useful":0,"cool":0},"-ZhhEHqOT9TP1EJpX4hBbg":{"text":"We were craving Vietnamese food after 2 days of southern food. We had a group of 17 peeps ","useful":0,"cool":0},"RDtkkNfxKBnXYcxJ9nGEDw":{"text":"Great food at a great value!\nMy favorite items on the menu are the Pho, Pork Bun, Bahn Mi,","useful":1,"cool":1},"iCgenKzeaL6RI4xWHq_pKA":{"text":"Had lunch here twice while visiting New Orleans. Food was amazing both times. Had the file","useful":0,"cool":0},"5mQdE4mGCNhdhqvICXJxMg":{"text":"Stopped in for a Bahn Mi poboy after WATS and it was great. The prices are a little more t","useful":4,"cool":1},"A18ygG_ZdRcMvMj6cxNEhg":{"text":"Great location for anyone who works in the business district and wants some Vietnamese for","useful":0,"cool":1},"jk5CfmtDvchRxA5qujTg1A":{"text":"Great service and great! the food came out quickly and the staff was constantly checking o","useful":0,"cool":0},"28j1NycFbRph7oQd3fCoeg":{"text":"I LOVED this place. The pho is solid! The spring rolls solid! The bun vermicelli solid! Th","useful":0,"cool":0},"DqLO2LfvnS-IsI3mduZ9Ug":{"text":"I rarely take the time to write a yelp review! This place deserves it! I am vegetarian and","useful":0,"cool":0},"v6TU03mQzALrMOyp-xw8Sg":{"text":"I love a trendy place with delicious food. Pho was flavorful, didn't need to add any condi","useful":0,"cool":0},"k4cKNEAqZk0gMxP910UHWg":{"text":"Love this place!  We dined here on Saturday around 7:00pm. There were only 4 guest plus th","useful":0,"cool":0},"tmVt3crJUreiucGyFX5KaA":{"text":"Went last week! Very good just like the one uptown. Looks like they are getting a full bar","useful":1,"cool":0},"SUR3m1gQvsknR9Ve48yqoA":{"text":"I have been here a few times, due to its close proximity to where I live. The pho and spri","useful":0,"cool":0},"F5VmK5KckKzhRbsksSaxwA":{"text":"Just added Magasin to my rotation. I had their grilled pork with rice which came with a fr","useful":1,"cool":0},"F5q3ynz76wGJcWzwnbMlTA":{"text":"Fun find in the CBD - fresh and tasty. Enjoyed eggplant dish! Staff friendly. They had a b","useful":0,"cool":0},"Z1ubWhI7xUlnX_WManheKA":{"text":"Meh is right.  I've been here a few times because I work nearby and I've never been blown ","useful":1,"cool":0},"Ik4HaoBQEl1mNZcd34j7pQ":{"text":"I love their lemongrass chicken spring roll but expected more rice noodles for my beef pho","useful":0,"cool":1},"weNVjRSj5ZY9F5yzkt5BLA":{"text":"Best Pho in the city and it's not close. Love their curry and vermicelli. Everything here ","useful":0,"cool":0},"GDBX4UV1Q2Bwxfh-YSpuGw":{"text":"The Pork banh mi was mediocre at best. The French bread was harder than I'm used to eating","useful":5,"cool":1},"GX9QCCrG3Ve71C9oy8AAMA":{"text":"Excellent Vietnamese cuisine! They can get busy at times, but definitely worth the wait.","useful":0,"cool":0},"4VSZsidHujAyh4x_uRgF8Q":{"text":"Ordered veggie avocado spring rolls and chicken curry via Uber Eats. The listing for veggi","useful":0,"cool":0},"zbwIs_NVQ_nxnPiqO-0H6w":{"text":"I found a bug in my food and water I pointed it out to the waiters and they told me someti","useful":1,"cool":0},"3hkU7dfmFkNFTKEfbYOa0g":{"text":"Absolutely love love love this place. \n\nFirst. It's Clean. You can see the kitchen, how ev","useful":0,"cool":0},"9_-vvj2lCOOgoBZgZeo6wA":{"text":"We had the potstickers, avocado fried rice, and chicken curry. The portions are a nice siz","useful":1,"cool":0},"jPeOtoXal8UZ2HnVXKUNGw":{"text":"Super friendly staff and great service!  I love the spring rolls.  The pho is good and the","useful":1,"cool":1},"VyuPJgScUA-g0xb8b7-ljA":{"text":"Who said you have to eat gumbo and oysters in New Orleans??? What a great little find. Aut","useful":0,"cool":0},"4ldUP7uBcrZoRdaXA2DS7g":{"text":"Went here for a late lunch. The crab rangoon is great and the only problem is figuring out","useful":0,"cool":0},"ZEFKwGwZ0wWeFMHcVKHslg":{"text":"Pho is inexplicably flavorless. Vermicelli and rice plates are better. Banh mi are excelle","useful":0,"cool":0},"ilvNQ9z9VO9Hiwm_k3ztJQ":{"text":"Our 1st dining experience here, it was the season opener LSU vs BYU game. Upon entering, w","useful":0,"cool":0},"JLEiaTIeS2zLfoXcL745-w":{"text":"Super fresh and clean Vietnamese food. Service was great and interior was modern and clean","useful":1,"cool":1},"QgFN2KQK9biYi7hZ1jeduQ":{"text":"I had the Pho with Brisket.  As good a bowl of Pho as I have had, not greasy, not salty...","useful":0,"cool":0},"5iOiwNE5pdb3nSP07CzcSw":{"text":"Went to Magasin in the CBD tonight and while the food never disappoints, the service is ho","useful":1,"cool":0},"8_2FPq2KmhP7DQ7WDtN5Tg":{"text":"I tried the location on Magazine in about 2013 and wasn't impressed. Decided to take anoth","useful":0,"cool":0},"O9_rQvkgTuVv4u1ZGdj8Vg":{"text":"I came here for dinner by myself on a Thursday and it wasn't too crowded. It's more on the","useful":0,"cool":0},"OG5LDxioo84GdxFXnnzzmA":{"text":"We eat Vietnamese ALL the time in NYC so it was a pleasant surprise to run into this resta","useful":1,"cool":0},"G5mlQ9TPys2rGpyBz8tLAg":{"text":"Would have loved to try it! We walked in at 8:15, they close at 9. We were waiting on frie","useful":1,"cool":0},"ZmJMIhvX4PaHWQ3zklLdDw":{"text":"Nothing special here. Don't order the crab soup. There is very little crab...and zero whit","useful":0,"cool":0},"SH1Wa7qFTfpH51naOJsHAg":{"text":"Wow, this was so good.  I really didn't know what to order, so I looked up some pictures o","useful":1,"cool":0},"8c5IbdnFcxYKzqQ-ZvAodw":{"text":"Love this place! There is always a line to get in during the week at lunch time. I always ","useful":0,"cool":0},"nMu3LqA5ZFpkeUBr3m0O6w":{"text":"Most of the food I've had here is pretty good, sometimes dishes are a bit bland, but overa","useful":0,"cool":0},"h_Lfu5RHQ70KZm-ewNnB4A":{"text":"I ate here over this past weekend. First impression: very trendy and decor is on point. Lo","useful":1,"cool":1},"mob_tD_TY5BumBlbJuz1aA":{"text":"Delicious! \n\nMom's Country Fried Beef - is the best.","useful":0,"cool":0},"n1VdEAZZ0iHyMphKgqeBvw":{"text":"This food was so good and a reasonable price. We got the eggplant with steamed rice and th","useful":1,"cool":0},"WKEPUKKunKVKLn4X83510w":{"text":"I was excited to finally try this new location because of it being closer to my house than","useful":4,"cool":1},"Li4NBpv6ogjrnFNngvJAsQ":{"text":"Speedy and amazing service, delicious food. I had the egg roll bun and Vietnamese iced cof","useful":1,"cool":0},"O9m0w5URP01ueC3ZxnKumw":{"text":"Sooooooo goood! I haven't had pho since moving to NOLA and this place hit the spot! The fo","useful":1,"cool":0},"SZlB0YNmUsfQQvPXB2L88Q":{"text":"Healthy food, clean flavors and a casual hip atmosphere - solid service.","useful":1,"cool":0},"04iY80YExNlbDjwlupotDw":{"text":"Food was great. For the fried food they did over cook it a bit. The stir fried pork noodle","useful":0,"cool":0},"0vWshUkifHgcMTe6xVwRJQ":{"text":"Had a great lunch at Magasin Kitchen !!!!\nKids loved the Banh mi ,\nAnd the beef fried rice","useful":0,"cool":0},"Q8nXpPHmYyatrctruyMWbA":{"text":"The food is amazing and the spring rolls are a must...great service and calm atmosphere","useful":1,"cool":0},"ZDhy1MNoV0kbv_iRHjtP3w":{"text":"Great Vietnamese restaurant in New Orleans. The kids were a bit tired of Cajun food (been ","useful":0,"cool":1},"5k3vqFwAu0ADjtGHzzOrFw":{"text":"The food is as good or slightly better than what is offered at their flagship location upt","useful":1,"cool":0},"bboE265EWDKO0vNDbNv9zQ":{"text":"First time I came to this place, 5-stars\nBut then every other time I have been here, they ","useful":0,"cool":0},"okmEPMAQdJM0GNt1U8NCFA":{"text":"I hate the South of Market development.  On many level  But I found that this place, which","useful":0,"cool":0},"1gIqf5KD45Ln4W10rCpaIQ":{"text":"The food definitely had more flavor than the magazine street location but the service was ","useful":0,"cool":0},"H2VXckyYZq-uXwvzMvb8og":{"text":"This place is pretty much the shizzle. 2nd time here and its even better. The spring roles","useful":1,"cool":1},"qubuH-ihaUACBHo1cAPXGg":{"text":"This one is not as good as the other magasin that closed on magazine. Portions are smaller","useful":0,"cool":0},"IwnQ_IO3N5vB26U0U_VDJg":{"text":"Delicious food in right-sized portions. I had an avocado green bean bowl with fried Rice &","useful":0,"cool":0},"vnx6joumHcwVqREWUb7eyA":{"text":"Service: 5 stars\nAmbience: 5 stars (very laid back)\n\nLemon grass beef vermicelli: 5 stars.","useful":0,"cool":1},"uzayBkY0v09_8z5r2_BmYg":{"text":"I eat Vietnamese cuisine frequently and loved Magasin Kitchen while trotting through New O","useful":0,"cool":0},"2mqZ22ogOBNg19y3MSvdcA":{"text":"This place has some really great options on the menu, although they have not managed to op","useful":0,"cool":0},"EyHrRSP7dLzVRFPy-H7zJg":{"text":"Excellent! fresh, very tasty, decent portion food. Banh Mi and Pho were fantastic, 100% mu","useful":0,"cool":0},"UOO9G9VSNKBfNY1cTlLVyA":{"text":"I come back to New Orleans often, and end up here three or four times to escape all the fr","useful":0,"cool":0},"28Zy_6aRjh89O48oXxp3Rg":{"text":"Best pho I've ever had.  After living and exploring in NYC, SoCal, D.C., Detroit, and Clev","useful":0,"cool":0},"EAGoi4rolZWjP3VkghsIGA":{"text":"After moving downtown, this is one of my favorite restaurants to visit for lunch. I've com","useful":1,"cool":0},"xuwQB_uPL5iw-kERtFMVxQ":{"text":"Love this place! I had been once before last time I was in town for a conference, and reme","useful":0,"cool":0},"WsI3mTgHd8R2Kh2ZFyEfvA":{"text":"This is a casual yet well designed Vietnamese restaurant. It is great to stop in for a qui","useful":0,"cool":0},"AFJXimDIFyWYIVKYsT0Byw":{"text":"I was super happy about finding this place on my last day in Nola. A bowl of pho tai for l","useful":2,"cool":3},"CjVTKZI6DbhLs20qA_c1BA":{"text":"Came here one rainy evening because wanted pho but didn't want to drive and this place was","useful":0,"cool":0},"r0s6sSQaKIVtlIlmbdE5CA":{"text":"Love! Love! Love! The location of where the restaurant sit looks like it's in a high end a","useful":9,"cool":8},"lHwm3cNfXo0qfltE4KNlHA":{"text":"Vietnamese restaurants are common in New Orleans, but not so much in the downtown area. Th","useful":1,"cool":0},"0c1PCHd_3LcCIJu4_zgvrA":{"text":"Easily top 5 Vietnamese in NOLA and no one outside of downtown knows who they are. Great m","useful":0,"cool":0},"4k96T9o_2ruOykGItFAn0w":{"text":"Came here for a quick lunch while in town for work. I wanted something fresh and not too h","useful":0,"cool":0},"Y7dik10UL-HkAXJTA6WDcw":{"text":"The dumplings were really good. Best I've had in a while.\nI ordered the Filet Mignon Fried","useful":1,"cool":0},"TQmRoklGsAZnNr47sicefw":{"text":"Food was okay but the service was terrible. Went at 3pm and the servers were all eating. W","useful":0,"cool":0},"sDy3Q7DnZhnAKom4wzS6Yw":{"text":"This is probably one of my least favorite Vietnamese American restaurant down in NOLA. I g","useful":2,"cool":0},"5piJ1kbjdP2RGtzfxCyXaQ":{"text":"My very favorite Vietnamese restaurant in southern Louisiana. I drive 30+ minutes just to ","useful":0,"cool":0},"EuzRSw6I-oQAthVrvmH1Gw":{"text":"I like it here. I came at 11 for lunch on a Thursday and by 11:30 the place was packed wow","useful":1,"cool":1},"mF1Je1upcAkO_6PUZEhodA":{"text":"Stumbled upon this spot while in town for New Orleans Film Festival. Really great food. I ","useful":0,"cool":0},"gxqc29KJMsiC0h7aVfU_Rw":{"text":"When going to a restaurant next door, we happened upon this place and they weren't open ye","useful":1,"cool":2},"ivFUeKedOU0ugVXUANV3ow":{"text":"This place is excellent! Good is great! The atmosphere is trendy and refreshing. Great ser","useful":0,"cool":0},"UFn_cDcs6BQXHVS1tS5jkw":{"text":"Overly priced Vietnamese  food \n- Overall food isn't that great \n- I tried one of the bowl","useful":0,"cool":0},"SAoIj4JEAKvhaMehHsRseg":{"text":"Very surprised how good the Pho was. Got the combo Pho and meatballs were some of the best","useful":0,"cool":0},"uQjGLWg1ZMP6H601Axn-4A":{"text":"The food was just okay.. nothing amazing.. the spring rolls had a choice of just one prote","useful":0,"cool":0},"Xhno3fAEzGr6VYvc6uWAzw":{"text":"Ordered the rare steak pho for take out.  It was really disappointing. I'm used to Pho bro","useful":0,"cool":0},"DwG9D77MVKRFSCPDb-jPgQ":{"text":"Hidden gem in the CBD! The Pho is very good! The broth is rich and flavorful. I get my chi","useful":0,"cool":0},"obNHKbqKBhLyIftnRII1Vg":{"text":"Magasin has a lot of classic Vietnamese options and some more with a more interesting twis","useful":0,"cool":0},"pqAhPLpk42v40gFFsHijAA":{"text":"I got this through Uber-eats and it was true to the good reviews this place has ! I'd trie","useful":1,"cool":1},"VzfCYYbVvatqb8W5D3J1JA":{"text":"The Pho bowls are all about the broth, very feeling. Have eaten there on different occasio","useful":0,"cool":0},"WYdJeOZYI7b7j0L2kuUCJg":{"text":"Ordered from uber eats on a busy night. Cheap but seriously amazing bahn mi.\n\nTry the pork","useful":4,"cool":1},"AtUGMwNQZS0B873ndQ3mNw":{"text":"The vermicelli dishes here are solid. I had the pork and chicken vermicelli dishes and the","useful":0,"cool":0},"mnoun4p8AUBBI1ltYPcCag":{"text":"I tend to save 5 stars for a real OMG out of this world experience, so bear this in mind w","useful":1,"cool":1},"Odc-IS54PfwOvQdFPYZURQ":{"text":"I'm good on this place. Even the shrimp rolls were lack luster. I spent $23 on shrimp roll","useful":1,"cool":0},"4pNLcjk4wiGViDqQmwULbw":{"text":"Overall experience 2-3 stars. The food is quite mediocre. Ordered pho tai and grilled shri","useful":1,"cool":1},"u2oEFs0e9Dgi_j8CvUUmAw":{"text":"A cute and cozy place. We were craving some vegetarian Pho, so my husband picked this plac","useful":0,"cool":0},"6gpxdWiEPEnUz7xkf1Z20A":{"text":"Finally tried this place recently near where we live. Overall my experience was pretty goo","useful":0,"cool":1},"_bYjN-yNgnQ8GXsKb2nQxQ":{"text":"A-OK is the perfect way to describe Magasin Kitchen.  Is it the best?  No.  Is it the wors","useful":1,"cool":0},"x_e4xcT8NRiW72XI0oPQZQ":{"text":"The Pho here was really good. So we're the spring rolls. No issues sitting our group of 7.","useful":5,"cool":2},"_Dv24HiGuYHXdJARkZ4fCA":{"text":"This is a pretty decent Vietnamese place, but service was kind of slow. \n\nMy friend got th","useful":0,"cool":0},"S9u94Q81XKDEpLMHU4jaew":{"text":"This is a downtown version of their restaurant in Mag.  The shrimp balls and gyosa are ama","useful":0,"cool":0},"dsSVHz5golPiqLB6GZIvFQ":{"text":"One of my favorite Vietnamese places in the city. Not only can you get the staples but the","useful":0,"cool":0},"z5bq1P5onRIn67_IUuRWjA":{"text":"Do not recommend to-go orders of spring rolls or banh mi. The rolls were not cut up like p","useful":0,"cool":0},"d0f5Vz_RJenSuBW_kGRr7w":{"text":"I haven't dined in this location, but I have gotten take out a few times. The take out is ","useful":3,"cool":1},"r5oO9NKhJG7LwDCWKtOQeQ":{"text":"I am so HAPPY!! I have been on the hunt for good Pho Broth and EGGROLLS! Everything we ord","useful":3,"cool":1},"-h3KlYvYFnGU2SZcE6bsBQ":{"text":"Pretty good. Fresh. Spring rolls were a little bland. The warm tofu was good in the fresh ","useful":0,"cool":0},"xRpb4lCMX80BSndv-evSKQ":{"text":"Some of the best pho in the city!! I've had both the beef and chicken broths and they're b","useful":0,"cool":0},"7p1KmGxB2D7oELs6er3GqQ":{"text":"Decided to give this place a go on ubereats, and it was pretty good. Nothing outstanding, ","useful":0,"cool":0},"szi_ZQ8TMig2dcghnwRdiw":{"text":"I was expecting more from this place. Steak fried rice came with egg on top and was pepper","useful":0,"cool":0},"IkdmNF8p5oDEzxCzOKeX9w":{"text":"To me,​ this is your average Vietnamese restaurant. I have been multiple times now because","useful":1,"cool":1},"H9SAsZ0ayKrI5GOVm_QZSw":{"text":"I met a friend for lunch here recently and, having really like the uptown location, was ex","useful":2,"cool":1},"0gl9p2r4eLh2GjhV3rIgbw":{"text":"Crab rangoons were to die for. I had the beef pho and my husband had a pork bowl. All was ","useful":1,"cool":0},"SnGBhY5DXFu7GgZLMWg8ag":{"text":"Workers were nice and listened to our custom order requests. Menu, however, is limited to ","useful":0,"cool":0},"8KeEtDCSyTUKY0YB7xPXiA":{"text":"Phenomenal everything :) - food, service and atmosphere. Everything we had was made to abs","useful":0,"cool":1},"Z8dn6idUAeY1W_1FUg9dQA":{"text":"Never had Vietnamese food until I moved to New Orleans, but now I consider myself a connoi","useful":0,"cool":0},"mJWEpXe5TQ5q8suYkp2bpQ":{"text":"My to-go ordered that I got delivered was half assed, I called to let them know and how Ca","useful":0,"cool":0},"mXMzuah0LQRXyWcJ5xI3pA":{"text":"Food is incredible and our group felt very safe and respected from Magasin following the s","useful":0,"cool":0},"UzdCxYmQTbpnTcDmb7T1WA":{"text":"Ok tried this place for the first time today. It's a nice place in a good location. When i","useful":0,"cool":0},"kuoeP1GQk6eoWnbv7Dnu4w":{"text":"If you randomly crave pho and crab rangoons like I do every once in a while, Magasin Kitch","useful":1,"cool":1},"Kx7AiFcjFI5s-_4gAUWC-A":{"text":"Great little restaurant in the CBD that we frequent when we're stuck in the office and hav","useful":20,"cool":14},"rRXShZGEGQM6jIx3gdfsDw":{"text":"This probably one of my favorite place in the CBD to eat. I can have this every day and I ","useful":0,"cool":0},"k1psO61DK_avY-WWKAhv4A":{"text":"Reading all the reviews and hours of operation made us travelers wanted to try out this re","useful":0,"cool":0},"OBFfklcIGqHqGyhJF9Rmxw":{"text":"Menu looked great. Service was awful. The waiter was randomly running around and seemed ab","useful":1,"cool":0},"9VtKsVjbtyZJCh4QJp-9Ew":{"text":"I L.O.V.E that We finally have a pho place in South market district. I do not know about y","useful":5,"cool":3},"mWq-dEGKhN2pQVMmWyWWKA":{"text":"Hadn't been to this location since pre-pandemic. I wanted something healthy & fast, which ","useful":0,"cool":0},"n-oOZ2OWwC4cTmuSpbGN2g":{"text":"So friggin good. Absolutely fantastic tofu rice plate. Fast service and helpful waiter. Th","useful":0,"cool":0},"GQq6Dnt3DedJj1YSV33kiw":{"text":"Ordered the shrimp. It was awful. Smelled bad and was mushy. Had a large egg that was grws","useful":0,"cool":0},"m3XIXc35ueI-MJe4UbgojQ":{"text":"One of the best Vietnamese restaurants out there. Their vermicelli bowl is a must-try!","useful":0,"cool":0},"S2Yi7ZjYx2DBFHWI_JJTZw":{"text":"While New Orleans has plenty of excellent restaurants, we found the one type of cuisine th","useful":4,"cool":3},"K9M5EjkSFM0pWNnHO8vB5Q":{"text":"Great food. Quick service. Always very kind. \nI recommend the sticky buns, the gyoza, and ","useful":0,"cool":0},"UfuJO-m61g9DV86sd4vg-g":{"text":"Your food is delicious! But please stop using styrofoam for to go food. It's cheap and cha","useful":1,"cool":0},"_17nOlc_Cc48RmTlxOAaGg":{"text":"So this is a spin off from Magasin uptown. The menu is a little different but the pho and ","useful":1,"cool":1},"AwkOqs8v48Men57pYj2ZZQ":{"text":"BEWARE: MANY PRICES HERE ARE 10-25% HIGHER\nthan the original Uptown location. This is a ma","useful":9,"cool":4},"5_BBuMJg3pGjEKIMEzSNVA":{"text":"Just as good as the location on magazine in the garden district.  The prices here are slig","useful":2,"cool":2},"qpMiCVIxHMs9qwcBbEA-xA":{"text":"Broth was clear. \"Checked\". \nBroth also tasted better on the good flavor range. It's reaso","useful":1,"cool":0},"KfQR3XORqkzBYDoanltGGQ":{"text":"This spot is pretty good ! It definitely hits the spot when you looking for some quality p","useful":2,"cool":2},"TNXClS1Q9JK7ZIO838rPaw":{"text":"The crab rangoon were delicious but stay away from the shrimp fried rice because it is NOT","useful":0,"cool":0},"dcA7WTzEP685DWShWDt3cw":{"text":"I enjoy ordering the Salty Tofu Banh mi Sandwich from Magasin Kitchen. However, I do not f","useful":0,"cool":0},"Ct_-o29qS14q2u3vFoKC2g":{"text":"This place used to be good. It's just gross now. We got take out last night and both pho's","useful":0,"cool":0},"uyIINFjS2poXnLlbYnNEbA":{"text":"A neighborhood gem!  I've been eating here for 10+ years since they opened.  Everything I'","useful":1,"cool":1},"NN9IwZJ2wYtX152RZXkMMA":{"text":"I was traveling on business and looking for a quick bite- I have been past Magasin several","useful":0,"cool":0},"jYT-dxYw6MfvXs99C9d69Q":{"text":"This restaurant has good options. Especially if you're willing to try something different ","useful":0,"cool":0}}