{"uDXGpgkbRRAZziZLOanKRQ":{"text":"It saddens me to change my review for this place from 4 to 2 stars.  I've been going here ","useful":2,"cool":0},"iJGZ4zFi5gH_A6hs0SVf9w":{"text":"Really not impressed. They hurt my legs with the scrub. The paint job is noting impressive","useful":1,"cool":0},"BX8ctoGrnFFubyg9EkJp4w":{"text":"I asked for a manicure and a full set. It was Friday about 5pm, they looked furious I had ","useful":2,"cool":0},"MwCLC8INbDPcAyV1zy-NWw":{"text":"Friendly folks, thorough pampering... finding Fancy Nails made my day!  A clean, no frills","useful":1,"cool":0},"BFRgThr7r0vSIb8vuq_KeA":{"text":"I've had a pedicure at Fancy Nails and left thinking \"you get what you pay for.\" I recentl","useful":0,"cool":0},"QpjdG7uoMIH6977qc7LWrg":{"text":"No frills but no wait. Not a huge selection of gel brands/colors, but if you like Gelish -","useful":0,"cool":0},"YBFr5SZrlkoTWo6fpMz5AA":{"text":"I usually go to another nail salon but yesterday I was unable to get there before they clo","useful":0,"cool":0},"P-NRqGGRdk-RlrxcUuhbnA":{"text":"Great service and customer service! Today I had went to get a pedicure and a gel full set ","useful":0,"cool":0},"VGC0nxe0Ou8RxA_sglrbBQ":{"text":"Very disappointed in my dip nails from here. My nails are unevenly coated and they definit","useful":0,"cool":0},"M2-ohK63gxFCJHo246w8xg":{"text":"I had a wonderful experience at Fancy's and would definitely recommend this place for mani","useful":0,"cool":0},"GNLY-3F5a7ugk2s-pajq8Q":{"text":"Waste of time and money. I'm a nurse and after a long shift I wanted to soak my feet in ho","useful":1,"cool":0},"0iYGU_-sE8cWziQHpaV6WA":{"text":"Had my toes done on Good Friday and they were still looking good...until I ran over my foo","useful":4,"cool":1},"rk9nXfHfYKjHxzBT6ghi8w":{"text":"This salon very good,they have too many color and do anything,if anyone want to find some ","useful":0,"cool":0},"Qok-D5Q6svDB5lz8-7VgVw":{"text":"I come here every three weeks to get my eyebrows waxed and they always do a good job. Pric","useful":1,"cool":0},"paU3a_CmWgnnT__VVURwMg":{"text":"I really think A-OK sums up my experience here.  They weren't busy on a Thursday so I coul","useful":3,"cool":2},"OL1KdrWOC4QH0wY96quMJw":{"text":"Do NOT waste your time! These people are inexperienced and totally unprofessional! I went ","useful":2,"cool":0}}