{"tFECh5mC1JDSnxTnjO5kug":{"text":"Standard issue gay bar but it gets an extra star for showtunes Sunday afternoons in the pi","useful":1,"cool":2},"LAGkce3UOSgBCKWTgf1uRg":{"text":"This is the third most popular spot in teh gay triumverate on the lavender line of St. Ann","useful":2,"cool":1},"G82p3ctoz0WGSPPWcfKJCA":{"text":"Visiting from the San Francisco Bay Area. What a great bar! Bartenders are extremely frien","useful":1,"cool":0},"FqOdjH_F-IbSDk52PXCSsw":{"text":"Right down the street from our rental for the week...great atmosphere and good drinks! Jus","useful":0,"cool":0},"dyXizwe3poD2uKdIuUi6zQ":{"text":"Smoking is allowed in this bar, just fyi.\n\nOrder the Separator. It's an Irish coffee milks","useful":1,"cool":1},"AoH7K7W_dASGcu7IwlGlqA":{"text":"Spectacular sun filled balcony thurs through Sunday and a great upstairs bartender!","useful":2,"cool":1},"O5cYjeqmiimenEzDfXhB0Q":{"text":"out of all the bars I went to while in New Orleans, this one was my favorite.  Everyone, f","useful":0,"cool":1},"JSu-y2eNjiSZYoixHIuX0w":{"text":"when Josh worked here it was always my first stop in the mornings.  \n\nthe soft serve ice c","useful":3,"cool":1},"-hPaF6rgDCaREzLwbX_l2Q":{"text":"Thank you guys for the good drinks and the best entertainment i have in a long time!!!","useful":0,"cool":0},"ZnEZrN1RY-K5xP0TTHIBQQ":{"text":"Stopped in here for a drink on our way down the street.  Friendly staff!  Just had a house","useful":1,"cool":0},"vYNzOFuIXSyHT-BUpuatqA":{"text":"What the Hell happened to Good Friends?\n\nWe had a wonderful time here in 2013 (see the rev","useful":1,"cool":2},"z7U_0egvb3d9IG9SNFzsKQ":{"text":"This bar sits just one block off of Bourbon Street and serves it's community as an amazing","useful":5,"cool":2},"WCUyqe4X38y9u1LGihjepA":{"text":"Sometimes you want to go\nWhere everybody knows your name, \nand they're always glad you cam","useful":3,"cool":3},"qRxj9bKUk3yAarGsHYqwPw":{"text":"My favorite gay bar in the Quarter.  Pretty friendly and umm you have to try a Separator, ","useful":2,"cool":2},"q30XBUNDNzHTeFLYr7vVDw":{"text":"Overheard at this bar:  \"Honey, you wear your halo like a cock ring!\"","useful":0,"cool":1},"CsPLGCy0TDyTSodjxBvtbQ":{"text":"If Cheer's was a gay bar it would be Good Friends. This is a very casual, friendly and fun","useful":3,"cool":2},"NsflyPLPgaIINb2N-j6xpg":{"text":"Perhaps it could be said of all of New Orleans, but I really have a great feeling when I'm","useful":0,"cool":0},"dSWcUFx_LjVRoPI--bihQQ":{"text":"Always have a good time here.  Jace is the bomb.  Always good service and always says hell","useful":0,"cool":0},"a924tTXWTWU0KpZnq8nt7g":{"text":"My friend and I were looking for a good place to start and end our night from the festivit","useful":0,"cool":0},"8rje-o-MxA-N658jDTKQWw":{"text":"Came here 2 nights on this month's trip to New Orleans and we really, really like this pla","useful":1,"cool":0},"BqEz_oKgIpMCpch6lC2m6g":{"text":"The friendliest bartenders in town.  Go in and say hi to Justin, Blake, Richie, Spencer an","useful":1,"cool":3},"6mjStuSz7fS1bdStNq5MZQ":{"text":"This was a multi stop on our trip to NOLA. The bartender we had-Richard was great! He pour","useful":0,"cool":0},"Q18klYN_JUlU8GoIHk8R-w":{"text":"For our last night in NOLA, we didn't want all the hassles on Bourbon street. So we looked","useful":0,"cool":0},"ssDWX4X6ZIODOX-O9GLApA":{"text":"Love this bar and enjoy the bartenders and love the bar upstairs.\nYou can order a drink an","useful":4,"cool":1},"9jxtsW-DND5IlssBr-5W5Q":{"text":"So much fun! Ended here for a gay couples bachelor party! Love that there's a dance floor,","useful":0,"cool":0},"_ZvsQ5AHkt8ZL22dXit8Jw":{"text":"The bathroom key alone makes this place worth going to.\n\nThere's a lot of space in here - ","useful":1,"cool":0},"La8TIgJnX6l4VDKPHEGlPA":{"text":"By far the best and friendliest bar we visited in Nola! The separator is amazing, and all ","useful":0,"cool":1},"A_Zgl8TUmgljhaO3CFfPZA":{"text":"I stayed right across the street from Good Friends in summer of 2010 and this bar was abso","useful":2,"cool":1},"2SgfyWlKPZR7EspuesoD_Q":{"text":"In all the years that we've gone down to N'awlins for Southern Decadence, we'd never spent","useful":2,"cool":1},"l6ys8ALvrbg06fBQwdtsqQ":{"text":"My favorite bar in New Orleans.\nStaff are always friendly and attentive.\nDrinks are cheap ","useful":0,"cool":0},"kuBN2dyDwkoscf-53mXD7g":{"text":"Some people can't hold their alcohol, and I am some people. Thanks for not making me feel ","useful":7,"cool":5},"-0vgOk8UTsglS55eiLLFSw":{"text":"Great drinks, service, balcony, and music. We had a great time. Yes, technically it is a g","useful":1,"cool":1},"kfzZ8I22wu-3wuQIJJDa2Q":{"text":"My girlfriend, Jeannie and I, found this spot after walking around the french quarter all ","useful":1,"cool":1},"QwsfmOiPgg_8Eku62zCb3w":{"text":"Classy. Nice bartenders. Affordable cocktails. Certainly the mellowest bar we visited in t","useful":0,"cool":0},"4QmCJ3x17T5DSDQ-aZQzFg":{"text":"Another place I don't want to write about because I don't want it to lose its vibe.\n\nWe we","useful":0,"cool":0},"2Lm5hZcX9HeVS1G1wYOLBA":{"text":"We were told to go here and get the Separator. This drink has vanilla ice cream, coffee li","useful":0,"cool":0},"OvNkRCPEwarlYx-uXJf6yA":{"text":"Loud! But friendly bar staff and a low-key space.","useful":0,"cool":0},"YMcjZffziS2AU7mP1P3P1w":{"text":"I thought it was because it was Halloween night, but I went the night after also out of co","useful":1,"cool":2},"wZgWAvtcbJ-iSZPKnhYJKg":{"text":"Friendly service, great prices and a chill spot to hang out at away from the craziness!","useful":0,"cool":0},"7upwtytGi_otJS-70kmmLA":{"text":"Had a great time at Good Friends. Being my first time in Nola, everyone suggested I check ","useful":1,"cool":1},"XjMQzZ_cccuf-ugyuB_cRA":{"text":"I LOVE Good Friends!!! Easily one of my favorite bars in NOLA - easily!\n\nOur very first ni","useful":8,"cool":8},"JmLYfQNczqZephIx6Hv8zw":{"text":"This GLBT friendly neighborhood bar is a long-standing New Orleans favorite that's perfect","useful":3,"cool":2},"-7a5KOxRxKimM4k2eHW5TA":{"text":"This has been another staple of mine since college in the 90's. I tend to gravitate here f","useful":0,"cool":0},"fF7TWy3WnmpNQKprX06ucw":{"text":"Michael the bartender is awesome. Wants to know who are and where you are from. Great musi","useful":3,"cool":1},"kdV4LFXdxatEHNQq3Muysg":{"text":"The bartender Michael was a sweetheart and great host. You've got to try the Swedish Fish!","useful":1,"cool":1},"BZv73PdhWXOnwMHPATXu4A":{"text":"Walked by mid-day...weather finally warmed up so we needed to cool down just as we walked ","useful":2,"cool":3},"oNkU03S0B3mF6aJV4mZgZg":{"text":"I really enjoy this bar...there is usually a great atmosphere with friendly patrons and th","useful":0,"cool":0},"VkUcYUoXvlMRTED6dPT3ZA":{"text":"Great place for a cheap and spicy Bloody Mary on a Sunday! Walked over here during the Iro","useful":1,"cool":1},"BMug2rI5oVU371zFgnPoTw":{"text":"Prob my favorite bar in NOLA. It's just off bourbon so it's not so loud or crazy. I love t","useful":0,"cool":0},"r_UMsGDL4fe3vdFkMSDLHg":{"text":"This is a super-large bar occupying a nice corner location that offers fairly quick and ef","useful":0,"cool":0},"ceQVL9Z4SnvAKIrkvBCO_A":{"text":"Came in on an \"off\" night while visiting from out of town.  My partner and I wanted to go ","useful":0,"cool":1},"8gT56zBC3trRHRq16m4qVw":{"text":"Awesome gathering spot, the bartender Tim is one of the best, plus he has amazing arms","useful":1,"cool":1},"QqQDFB051zBswO4TUg_XBQ":{"text":"Best night we had in NOLA. \n\nMy friend and I came here for my bachelorette and we learned ","useful":3,"cool":0},"gT01E34EbQfJuyOa1FBtkQ":{"text":"I've never gone out to good friends and had a bad time the staff is enjoyable funny and ve","useful":0,"cool":0},"ZbqbnfOVYLea0QFpSHsDpg":{"text":"Queens are hysterical.  Got there often cause the wife loves their separator and I love to","useful":0,"cool":0},"EKerbdqRBW-eU7-o3ql1_w":{"text":"In my three years of living in New Orleans, this is probably the bar I spent the most time","useful":0,"cool":0},"icQS4nKQmT09vSKUm-t7nQ":{"text":"In a town of great bars, this one is by far my favorite. Great staff are always friendly, ","useful":0,"cool":0},"WE3x1vuvx1836LAdZ1CJ4Q":{"text":"This was our go-to-spot when we were in NOLA in February.  We sat at the open-air bar list","useful":0,"cool":0},"KCwPMM0DV9UZTpeQj3GuRw":{"text":"Ok I've been coming to this bar for 25 yes and the bar guys are always so sweet and have t","useful":0,"cool":0},"d6_HjEQ7pkN3SVlSKMXXBg":{"text":"Oh my lord. Kimberly Clark! I am so inspired by her positive energy that I am sitting at t","useful":2,"cool":2},"TkvJ5zDm73n4BOblB9zqEg":{"text":"I came across this bar yesterday while in New Orleans celebrating my birthday.  Dakota was","useful":0,"cool":0},"q0uIBxQntiQ7aYc2gwy8AA":{"text":"This was billed as a sports bar. It was the night of game 7 of the NBA finals,and having j","useful":0,"cool":0},"VAtEed08Y2oUVs6GREfr7w":{"text":"We were in New Orleans in December 2013 staying a few blocks from Good Friends and upstair","useful":0,"cool":0},"wFBWWjoS1ZftAISGcasl7w":{"text":"Nice atmosphere, quick service, and good pours. Only complaint is the prices, ordered a mi","useful":0,"cool":0},"dS8nXCoirk-vhsbQVB6dkw":{"text":"Yes, technically a gay bar. But the most\nchill in the quarter for gays, lesbians, straight","useful":6,"cool":2},"B_sF2AI8cSebTA8av4JNXQ":{"text":"With two floors, this is a spacious bar with something for everyone. There is pool on the ","useful":0,"cool":0},"doNEI7k9TaLzmsSjGanrog":{"text":"I started writing this review earlier this month while I was in NOLA for Yelp's Spring Bre","useful":1,"cool":1},"BYxOr63RuAvaYNG1E8X7ug":{"text":"My girlfriend and I stopped in here initially because it was close to where we were stayin","useful":2,"cool":2},"bjgDfc5665-Bd6ioVa4weg":{"text":"Can't say more positive words about this wonderful place! A must see in NOLA! The bartende","useful":1,"cool":1},"PdE3ekUCuz70u24Lfl31pQ":{"text":"i could sit around at good friends drinking and shooting the shit alllll daaayyy looong. l","useful":0,"cool":0},"obuHhHt51vIqG2J7G8-2Uw":{"text":"Great local bar.   Great drinks and really awesome bartenders.    It's worth a visit.   Be","useful":0,"cool":0},"0RIR8gc4wfYTwQ51vfmDoQ":{"text":"This is like the \"Cheers\" of gay bars. Friendly laid back atmosphere and a friendly barten","useful":2,"cool":1},"E0bC1G7aELJIvEvgw4m7Cg":{"text":"Die Good Friends Bar ist eine von mehreren Gaybars im French Quarter - mit Abstand die ruh","useful":1,"cool":1},"-7EvoVT7q54TPtuJz4D0Dg":{"text":"I have to come to Bayou Black every few years and am so pleased when I find Good Friends f","useful":0,"cool":0},"bRH-ZQ7VzyVo82rP-Vuf6A":{"text":"Good Friends is such a great bar!\n\nLOVE:  \nGreat French Quarter corner location\nWrap aroun","useful":4,"cool":2},"XoehtwbxWH9f8xuYyf2sWQ":{"text":"Came here on a Friday night, I was visiting from LA so I did expect more. I wasn't fan of ","useful":2,"cool":2},"--BF2Sdy2cTOc_xd2V5L7g":{"text":"Overall its a fun environment. I absolutely love the downstairs bar and totally love that ","useful":0,"cool":0},"cNc7GQ-rIKutTN6tTbumPg":{"text":"We didn't actually go to the bar by choice.  We were on the street being harassed by someo","useful":0,"cool":0},"ouCnuOLcEzJbAzPwh7lO2w":{"text":"imagine \"cheers\" as a gay bar and you have a pretty good idea of the vibe at good friends.","useful":2,"cool":1},"ngTwA9Sayxz6VSqFfUtfJA":{"text":"We always end up here during Barkus! Stiff drinks, fun people, and great music! I love the","useful":0,"cool":0},"q1mmiOajw5G2a7gU0D-QUA":{"text":"Um. YES. My friend suggested we come here to try out the \"Separator.\" Which is a frozen dr","useful":0,"cool":0},"vHQVzodrKJD1XN_1ntybBw":{"text":"Love coming by this bar when it's a beautiful day outside. We typically will stop in and s","useful":1,"cool":0},"awsvvoMQNQ5PCyKsVx_yrg":{"text":"Pretty chill bar. Mostly guys and not hardly any women. Drinks are great and strong. Cool ","useful":1,"cool":0},"9zIAqPmctRHvRmSxHZSoTw":{"text":"I honestly cannot believe they charged me $2 for a water. It was my first there and I have","useful":2,"cool":0},"8AZdAoSx-rLdsAJfenf9yQ":{"text":"Cute friendly bar! The key the the restroom is a giant bedazzled toilet seat. I enjoyed th","useful":0,"cool":0},"XXqgo_4iISmiSPl4SWro-g":{"text":"Foremost I would like to give this bar an overall rating of 4 stars. It's a very friendly ","useful":0,"cool":0},"l3LuBW4DDnAnjA32mtydpA":{"text":"Was in town for a few days from South Florida and a friend said we MUST come here and to b","useful":2,"cool":1},"R7WUUZVZaMmB-oZNAVwytQ":{"text":"Sexist AF! Drinks were ok, vibe was chill. The men's restroom was propped open with a tras","useful":1,"cool":0},"iZYAkeW4PfiOaqyxOPY9YA":{"text":"Fun, interesting bar. \n\nOrdered a hurricane; nice and strong. Everyone was super friendly ","useful":0,"cool":0},"S4xHNjoWaoNPoYzDtcEqRg":{"text":"My hubby and I stumbled on this place while in NOLA. What a fun place! We were there durin","useful":0,"cool":1},"0t3-QdvjduyVKj5cHDEEWw":{"text":"TERRIBLE service. To be often judged by others because of your lifestyle choice would lead","useful":5,"cool":1},"JsUonWRNQ2hoPKUpPNG-Cg":{"text":"We were visiting from out of town and worried we wouldn't be able to find something to do ","useful":1,"cool":1},"Fb6i40hcVkMwOTMWA1Iumw":{"text":"I LOVED This place. We ended up going twice during our 4 days in NOLA. Would definitely co","useful":0,"cool":0},"rOFcCZz4HgFAMnSG7LC4uA":{"text":"Love, love, love the separator. When I visit from Cali, I always stay at The Inn at St. An","useful":3,"cool":2},"aaTpRp_vgyuWdf4uFXjhBw":{"text":"I would definitely come back for a visit at this bar. Very friendly bartender and patrons.","useful":0,"cool":0},"Q2FSvdAYWrT-lroXWyyMKA":{"text":"Cute spot for drinks and fun. Pool table inside. They have good music. The bartenders were","useful":0,"cool":1},"wsw5Dwp30ET4yPLzZYOfcA":{"text":"Accidently walked in here during Mardi gras and had so much fun! The drinks are strong and","useful":0,"cool":1},"c-eafFzrSucHw3Q6IZhwxQ":{"text":"Lot of fun here, there are some things you can't unsee and that's why we were there. The b","useful":1,"cool":1},"tnotvatY8QrUJ88qK-Qitw":{"text":"What can I say about good friends? It's a truly amazing place to be at. First, the bartend","useful":0,"cool":0},"kGHRX68VYjdf4PpY48wWTw":{"text":"The only reason this place gets two stars is they were playing awesome 80s music, and the ","useful":4,"cool":3},"DflIS-uMnB6gLZLZX00ACA":{"text":"We stopped by here briefly because we read good things on here by our fellow Yelpers. \n\nWe","useful":1,"cool":1},"jlVGXsT0SO14wUZECz7XYQ":{"text":"having lived in larger cities with more active gay communities, i'm used to getting the co","useful":6,"cool":4},"qDQ5PYQL73I0KatCrX-M2w":{"text":"This place is fantastic! Great service and the drinks are amazing! Sean was the bartender ","useful":2,"cool":2},"F6NP2gXv_gqKVyZhNfavJw":{"text":"Was in town for a couple days. Found Good Friends just walking around. Was very chill for ","useful":0,"cool":0},"9KZfc2MNGxEdtKCPRroPQg":{"text":"This is definitely one of my favorite gay hangouts in New Orleans. It's cozy, yet comforta","useful":1,"cool":1},"aGCCOMm5ytdwHqLpDCRbcQ":{"text":"Meh- What Gay Scene? This place is no frills, no service, no smiles, just meh.","useful":3,"cool":2},"j35NQPhtP4kuNF2V341cuQ":{"text":"I love this bar! I've been coming here for years every time I come to Nola! Always a good ","useful":0,"cool":0},"K9nT0pQ5wvgwml3IfdvdZQ":{"text":"I thoroughly enjoy coming to Good Friends for a night out. The drinks are super reasonable","useful":8,"cool":10},"S_JWOlNc8nLM0AUTz-uf9w":{"text":"We came here for some afternoon margaritas on a beautiful sunny day in the French quarter.","useful":0,"cool":0},"0DgcF9juEDyN9phiv8-U0A":{"text":"Love me some good friends bar have always had a funfun time here.","useful":0,"cool":0},"TjCuM179y9eY5KYHz6qo9w":{"text":"OMG I really enjoy this bar now.\nI can remember when I was much younger we never came here","useful":19,"cool":18},"u58naiU188dAsEnSsBBNvQ":{"text":"Friendly staff. This is a bar and cannot let your child use the restroom because they will","useful":1,"cool":0},"Go2kUwgse-cnlfYVNSJrVQ":{"text":"Fabulous service! Great bar! Tucked just off of Bourbon St. on a side street so a little l","useful":0,"cool":0},"HkyrAp7wcefnJgMWiLM_Lw":{"text":"I visited this bar last Monday and was beyond disturbed and disappointed. I ordered a Bloo","useful":2,"cool":0},"qYI2MQrqcKnB3f95eYt3TA":{"text":"My favorite f*g bar probably in the world. Not a single bartender that I don't love(especi","useful":0,"cool":1},"CrZ8QmLg8os9gel5FEgJKg":{"text":"What a great little neighborhood bar, friendly patrons great staff especially Shaun.","useful":0,"cool":0},"dWT9Jmb4rpT1SFu4K7KDxw":{"text":"I am embracing the fact that I am either too old or too reserved for the \"clubs\" anymore. ","useful":9,"cool":5},"OP3Yh5vhPpqvkOPQSDvFgA":{"text":"Downright rude and catty staff and patrons. It was our last night visiting the city and we","useful":1,"cool":0},"NavTmMUX7sLltbQXZTlqGQ":{"text":"I love this bar , they have good music , itscomfy\nTo sit at the bar and drink . I usually ","useful":2,"cool":2},"YIw9Qz5lAdYC2WF-_74BRA":{"text":"After the episode we had I attempted to try to talk to the GM about the \"issue\" at hand. H","useful":1,"cool":0},"kET7NAxUfWRCywo8sEQEkw":{"text":"Won't take cash, no thanks.  I'm not ringing up a card for a $4 cocktail when I specifical","useful":1,"cool":0},"NfqgBp9br3IsQP3nh-4gtg":{"text":"Came here to meet a friend, who suggested it. Afternoon bartender was very nasty and unwel","useful":0,"cool":0},"ivFq2HXorPhN14lyN6NKGg":{"text":"Such a fun place! Didn't meet a stranger. Sat at the bar and chatted up people so easily. ","useful":1,"cool":1},"D2mNBlePLAWiasGS1x4uAg":{"text":"I was so excited to go here yet the regulars heckled me and my friends calling us \" practi","useful":2,"cool":0},"9AYVsOz_u12meyFOftJnZg":{"text":"Usually this is a laid back bar which I always frequent when I visit the French Quarter. M","useful":1,"cool":0},"jYTb3hD6GE5khn-d9OFhEw":{"text":"Get thee a Separator! It's got the consistency of a Wendy's Frosty and a lovely level of a","useful":2,"cool":1},"JIr83TzU96MWQiAlXgLNMA":{"text":"I'm sure this was once a thriving gay bar.\nNow you can come here and see throngs of overwe","useful":4,"cool":0},"Qtm_H12mSVwkQEbBNvPg8g":{"text":"So many fond memories here hanging out with the girlfriends and gay friends! It me still t","useful":6,"cool":4},"hNgCfHSAVdZKBFx6qseH2A":{"text":"Can I give this place less than 1 star? Probably the worst experience I've ever had in any","useful":0,"cool":0},"u67nrKYlmMDScFUlfkP66Q":{"text":"It's a 24hr bar in the gayborhood of Nola...I love swinging through here and meeting inter","useful":1,"cool":1},"t5IU1pB6SJvZ4EiEOK6RVQ":{"text":"Bartender Timothy speaks a lot about living in cities with mostly white communities. He sp","useful":5,"cool":0},"CgtIbKG6wW_q_DtmNu1mAw":{"text":"I seriously would not have known about this place if not for my friends telling me about i","useful":1,"cool":0},"uU0dSN9LEKl7U_Ltp3Z_1w":{"text":"Ahhh Good Friends! This has become my favorite bar in NOLA. It's off the beaten path of Bo","useful":3,"cool":2}}