{"KlCTe_9yehN_CptRrcDY3A":{"text":"Came here after hearing rave reviews and I must admit that they have the best crust in tow","useful":1,"cool":1},"h8vbLWEYoJoDpeD82NYgug":{"text":"Best pizza around!! Highly recommend the #7, mushroom with a lemon cream sauce. So delicio","useful":2,"cool":1},"XR4mKGIG7z1fdhsy3_jNNA":{"text":"Lives up to the hype. The crust is chewy like a bagel and totally delicious. Had the squar","useful":6,"cool":5},"Z842JgzFPgmt3hvt4Otgng":{"text":"Is better than Joe's in NYC. Pepperoni with garlic and basil is super good. Also the Hero ","useful":0,"cool":1},"Khe0Gd4jqq7UJeq5d3sYww":{"text":"Absolutely terrible service. The pizza took 90 mins. And then it was cold. Mediocre pizza ","useful":1,"cool":2},"AQgstekpjqvV82xVqTMsFg":{"text":"A #10 square with vodka sauce, pepperoni and basil for me please! Took this humdinger home","useful":0,"cool":0},"jCPtp7YEzYLI_Y_g1uhlgA":{"text":"I'm updating my previous 5 star review in hopes that Yelp will add a 10 star review. Until","useful":0,"cool":0},"voWP1yyZyBBqVhfnYLXYDw":{"text":"Best pizza in the universe, dare I... combine with their on site brewery. It's a must.","useful":0,"cool":0},"n5LaocPk38iiCdZ8CsLmJw":{"text":"Having lived in NY and NJ for several years each this is the the real deal!  The space whi","useful":0,"cool":1},"g3mPVVBIYOYI2O_Z28az5w":{"text":"The only NY style pizza in the City. Pizza D is great, but the crust at Nola gives them th","useful":1,"cool":2},"KvnfQPft2DJ9onyQO_DnXw":{"text":"It's a pizza place and brewery so I don't think it can go beyond 3 stars just for the reco","useful":1,"cool":1},"1M9ERWJ76ui72rAXxEiA7w":{"text":"I had been craving NYC style pizza so when a friend gave me a lead on this place, saying b","useful":5,"cool":2},"4Ni25sZ463jeERxLiW8Zhw":{"text":"This pizza is everything it advertises and more. Maybe the top five pizzas I've ever had. ","useful":0,"cool":0},"5w8wQCpvemckP74WQCLn7Q":{"text":"I will preface this review by saying that I lived in NYC for over 12 years and know what N","useful":0,"cool":0},"8rXzP-OBM_cU_ja0y6wMpw":{"text":"NOLA can be a pizza hit or miss town to me but NOLA Pizza Co is the best addition to the l","useful":2,"cool":2},"me4SF_r22N_a4zApxS0oCQ":{"text":"I was extremely eager to try this place based on all the excellent reviews; being from the","useful":0,"cool":0},"GLgvt2NyUtQ9anyU0n3IHA":{"text":"The best pizza I've found in New Orleans (so far). The crust and sauce take my palate back","useful":3,"cool":0},"bFZPu8RFHDrFKyRc-uyj9A":{"text":"Yuuummm! This pizza is so great and super fresh. The #5 is stellar, and these brunch pizza","useful":2,"cool":1},"1Itpu3jV3_BfRC4j2mqABg":{"text":"If it takes you an hour and 20 minutes to make a pizza, the people who ordered are probabl","useful":0,"cool":0},"SfTPfq88bjft3Qm5PO1Exg":{"text":"This is hands down the best pizza in New Orleans. True NYC style crust, perfect thickness ","useful":0,"cool":0},"UyoLozBDD4INn9JtjLAjXg":{"text":"This pizza is legit. A tad pricey, but 100% worth it. Pick up a sixer while you're there a","useful":1,"cool":0},"Zl46tlYXs9bv9rF3yVgRfA":{"text":"By far one of the best pizza spots in NOLA now. It's the newest edition of NOLA Brewery's ","useful":6,"cool":5},"Um8Otvn_fOmp2nXnMP4fww":{"text":"This place is AMAZING. The best pizza I've had in New Orleans, after living in NYC for 8 y","useful":1,"cool":0},"BGngZSZDgg9YmETYmiIj5w":{"text":"I've lived in Brooklyn for the past decade, and greater NYC my whole life. NPC is the real","useful":0,"cool":0},"fplsUsVbKY9Zuet4-DWp0g":{"text":"Best pepperoni pizza in New Orleans!  Seriously!  This place actually serves real NY style","useful":1,"cool":2},"zO9dXEjCraTHst0VWgrlbg":{"text":"This is seriously the best pizza in New Orleans. The pizza is good, especially the crust. ","useful":2,"cool":0},"l-0UMMBhQGBHVLDZtA0Pdg":{"text":"Delicious new york style pizza.  Good dough, with air pockets showing after baking.  Flavo","useful":1,"cool":0},"XrSAipQeGXogzyY_1JmuNg":{"text":"8 years, 8 long years... Ever since I moved to NOLA I've been searching for a decent pizza","useful":7,"cool":1},"fCJ41mKfTS1OhZTGi3D65A":{"text":"I loved this place. We found the pizza to spectacular. We definitely liked the square pizz","useful":0,"cool":0},"B9f6NOO4crWxNgSRfkurzA":{"text":"Best pizza in New Orleans   This is real New York pizza\nCan't wait to go back. I wanted to","useful":0,"cool":0},"DWX8QRSNapgYYFcQIVvYRA":{"text":"Came in on Sunday afternoon, the pizza was so good. The service was horrible though, walke","useful":0,"cool":0},"tCRU7Brwyk4aFplCGL59VQ":{"text":"I generally do not like pizza but NOLA pizza Co is good! Reminds me a lot of Pizza Delicio","useful":3,"cool":2},"5mvlH7JgrZtr48mA1lGZnQ":{"text":"Ouch.   School cafeteria type of pizza. . Very disappointing in the pizza especially regar","useful":1,"cool":1},"ivLeDG2gPIEzEvWYJW9Qew":{"text":"This spot is my absolute jam! Since I first ate here about a month ago we have made it int","useful":1,"cool":1},"OzPMWnEx7-MQXqDpQDDnlA":{"text":"I never leave reviews on Yelp. But this place is amazing. The absolute best crust in the c","useful":0,"cool":0},"yIH-9xTp_jSTg9HoThYfRA":{"text":"Disclaimer: this review is written by a New Yorker, born and raised\n\nI was attracted to th","useful":6,"cool":3},"K5kb8CPscvMdwkDTT7hGqg":{"text":"Excellent Pizza served in a brewery.  Straight up or with all the fixings.  What more can ","useful":0,"cool":0},"ONwLUl9bXeyUhREL3qjGnw":{"text":"Oh. My. God. May be the best pizza Ive ever had. We\nGot the basil and vodka sauce and it's","useful":0,"cool":0},"eA2MmWHBxQVOc1at6g_rqQ":{"text":"Best pizza in town! I love the NY style slices and sauce. Perfectly executed. Walked in fo","useful":2,"cool":0},"-1nMMLAUjH-zncwD8I3E2g":{"text":"Located inside the NOLA Brewing Co. Vibe is awesome! Staff is wonderful. Large outdoor spa","useful":0,"cool":0},"PplqVGk6Ga2Gz6fiHuWmIw":{"text":"Hands down, the absolute best Pizza you can find in New Orleans.  Straight up New York sty","useful":3,"cool":0},"432yBRQSgOhZJmIJOdYo2g":{"text":"I'm incredibly impressed with this place. After a long quest to find decent pizza in the c","useful":0,"cool":0},"4PByabaxxFlkdpN5AxI5KA":{"text":"My friend and I went here for lunch and the service was amazing!! The gentlemen was so hel","useful":0,"cool":0},"eYbQoQMfrloWFqqx_LWTAA":{"text":"Tried this with a Yelp elite event and it was awesome. Taylor was great. The food was deli","useful":0,"cool":0},"hcIUxrSJPyyA-VH-_nXgTg":{"text":"Pizza and beer, a match made in well you know. \nIf you like thin, New York style crust thi","useful":2,"cool":2},"hzZcbHk9XlAWpSShtWHV9w":{"text":"Wonderful spot on a nice evening or for a quick lunch. Cheese pizza slices and a salad for","useful":1,"cool":1},"DbwD150yl7n6b7-JAqtGlg":{"text":"Love this place! It's super convenient for a quick lunch stop during work, affordable, and","useful":0,"cool":0},"P7dnO36KR5ROq5sYY1-k3g":{"text":"Great pizza! One of the best I have ever had in Nola. I tried a slice of the square pepper","useful":1,"cool":0},"MTShq_qmmUzgi5y-y02UoQ":{"text":"Atmosphere- place takes covid seriously! Asked for vaccination proof, all staff wore masks","useful":0,"cool":0},"HVq6l10lNC_alfMOJStmIw":{"text":"Delicious!! Delicious!! Delicious!! It's always a risk trying a new pizza place in New Orl","useful":2,"cool":1},"S1L-9-bnXgllQZYtg09e1g":{"text":"Enjoyed some delicious HUGE sized pizzas with football yesterday at NOLA brewing. Highly r","useful":4,"cool":0},"1gkfSQuv8DS7JWp5ZLRSRA":{"text":"I was so thrilled to discover NOLA Pizza co. I love NOLA Brewery so I was on board to try ","useful":1,"cool":0},"wDhPz9ZLv2U71XmVLIWpKQ":{"text":"Cannot believe that this only opened last year because this is one of the best pizzas I've","useful":2,"cool":0},"mIsqrth6G6w_UV7baxdSaw":{"text":"Who doesn't love new york style pizza? Found this place by accident but glad we did. The p","useful":9,"cool":8},"23Kj3IaSKg1o2BODw2SMbw":{"text":"I'm glad I got to swing by the NOLA Pizza CO. for lunch last week! It was a little out of ","useful":3,"cool":3},"q59XvrOz-dWwch-Pr6LB4A":{"text":"Tried out NOLA Pizza Co to check out their plate lunch and WOW--it was such a good deal. Y","useful":10,"cool":8},"vWkPlpH2SrAaFMeEAYi_Iw":{"text":"I came here as soon as they opened to indulge in some tasty pizza. Today i came in for the","useful":2,"cool":2}}