{"qo1LBO8NBbdlJ1qdPNW9zA":{"text":"Best location you can imagine for an RV park in New Orleans. Friendly staff, safe, clean. ","useful":1,"cool":0},"JM8z1ST07yUKA_n4WX9j9Q":{"text":"Just left after a 4 day stay at FQRV. This our second stay here. Perfect location, very sa","useful":1,"cool":0},"r3_kdbHwEt4CJvS36ckf6g":{"text":"Great location close to Bourbon street, 5-10 minute walk. Very clean resort, friendly serv","useful":0,"cool":0},"XEy2GZuYUJmp6rO-DsznIQ":{"text":"Wonderful place to stay! Lots if beautiful Class A coaches stay here so you are in great c","useful":2,"cool":0},"oZgD99xdpFL_o6iG4DJg8A":{"text":"Walking distance or a short cab ride to everything in the French Quarter... We really enjo","useful":1,"cool":0},"zClYBgn_jUiXxGTLAqj8XA":{"text":"This was in the perfect location, it's gated with a security guard felt very safe. The poo","useful":0,"cool":0},"w_gD-znu1xvXdRDHRkSFsQ":{"text":"Friendly professional staff. Great location. Workout room has cardio machines and a couple","useful":3,"cool":0},"8UwnXAhRxP3OqBWFALKwGA":{"text":"I have to admit when we pulled up to this location, I started to freak out. To say the nei","useful":2,"cool":0},"VFsU4myrwdcFwndbBT54pA":{"text":"This resort is very clean, has classy amenities and very friendly people.  We arrived with","useful":3,"cool":0},"rpThTjjiF0x8UZLyM1t3kg":{"text":"This RV resort is a great place if your interested in walking two blocks to the French Qua","useful":1,"cool":0},"0pQ5ILDViR1BinabJ5radA":{"text":"This is a beautiful, newer park in the middle of a not so good neighborhood.  Plenty of Ub","useful":2,"cool":1},"S6pWN3evJqrXaV-PbcHlgQ":{"text":"The good:\n- The proximity to The Quarter is fantastic. The folks who complained about the ","useful":4,"cool":3},"_ueHtRBV5MejSvdCu_Feng":{"text":"This place is top notch. \n\nThe RV spaces look like they could have time traveled from 1850","useful":1,"cool":0},"QnVhFGnECG_Yauj7nEaMjA":{"text":"Paver sites nice and level clean, secure\nClose to the French Quarter \nNice pool and small ","useful":0,"cool":0},"_IibyIXncjJb1pi6-ohl1Q":{"text":"The best camping within blocks of Bourbon Street.  52 full hookups for RVs including choic","useful":4,"cool":1},"Rladuql4dM8ZgA5Z-wW2yg":{"text":"Ok, it's a little creepy when you see the wall with the barbs on it.  Come on in and check","useful":8,"cool":0},"eMWZBVnxlIGQ6GXb1yBx-w":{"text":"Stones throw from the French Quarter, though I wouldn't walk back here at night. Taxi was ","useful":3,"cool":0},"Q_06LDYZP9MFIrSIjNfZKw":{"text":"This fortress located at the end of the French Quarter is definitely the most expensive in","useful":7,"cool":0},"mMaxbVBudCDN15C0fdotHw":{"text":"Note: this review is for an OFF-SEASON stay between May 13 - 17. \n\nAmazing location, fanta","useful":4,"cool":0},"gXef1Szcm5_xS3ucw5pfEg":{"text":"Mit einem RV (Wohnmobil) eine Großstadt anzusteuern und einen geeigneten Übernachtungsplat","useful":5,"cool":4},"QOpeWteavsTd0K_hzfawrQ":{"text":"Again, you get what you pay for. This place is astronomically priced at $108, but given th","useful":3,"cool":0},"U44CtS3BiqHH7JtDfLFFSg":{"text":"Four stars due to the price, $108 per night.  The sites are back in, wide, and fully paved","useful":0,"cool":0},"rzL1n-Z_u6Ay3IQcvKcr9Q":{"text":"This was the most clean and well done RV Park. Super cute, amazing service and security.  ","useful":1,"cool":0},"eEa2n4H-MA30eQ58L6yFPg":{"text":"Stayed here 2 years ago. Called to check rates and site availability. Very short and the m","useful":0,"cool":0},"T6UxtUYDcmBm7gwaKZEqSg":{"text":"Didn't stay here..but when I called to inquire about availability, the ride girl stated hi","useful":2,"cool":0},"I-J73oCeLFYNhqnXD7tDZw":{"text":"Made a reservation a week ago. Today, found out a Category 3 hurricane is heading right at","useful":1,"cool":0},"JgG2EhQBbPMVLNjP-wvsNw":{"text":"Great RV Park right in the middle of New Orleans French Quarter. Can walk to the French Qu","useful":3,"cool":0},"cai7RsM7R_u28L9pDtmS8A":{"text":"We were in town for the Rock n Roll Half Marathon in January and since we bought an RV thi","useful":2,"cool":0},"_zxylm6KSqXijim-RQ9udw":{"text":"We were there the week of April 3-15, 2012 (late writing a review) and found the place abs","useful":2,"cool":2},"z5MgbPml0BBarsaIw2oQ3A":{"text":"This RV Resort surprised me! A group of friends and I stayed for a long weekend during Mar","useful":0,"cool":0},"HlAhxxXolS9xsf6yq6LoEg":{"text":"Very nice, safe, clean. All the lady's at the desk were very helpful and nice. There are s","useful":0,"cool":0},"6H6lp9dAQrrJU2NNDUt12w":{"text":"Frank and I went to NOLA for a work convention. For the first time in 25 years, we decided","useful":6,"cool":1},"q6Fr_WXH2KPUSbRa7SfUYA":{"text":"$110-135 per night ($10 late check out hourly charged after 11am). You will be placed righ","useful":8,"cool":1},"oVd5aSit_Lhs7VTO6JHZPA":{"text":"My husband and I spent the Christmas holiday here three weeks ago.  This time we spent the","useful":3,"cool":2},"Ta07DNIhW0vqkf52DFErMQ":{"text":"It's expensive, but a good location. The assistant manager, Andrea, had a lot of attitude.","useful":2,"cool":0},"K7k8_POmqwuCse4UmYKDXQ":{"text":"My family and I had an wonderful stay here. Here are a few things to know if you're consid","useful":2,"cool":0},"4i3SC1-fBKMgfo4bQTlsWQ":{"text":"Buyer Beware. FQRV Resort is NOT located in the French Quarter. It's in Tremé, a low rent ","useful":4,"cool":0},"nVvvtJZHJigS1nzM_CwUHQ":{"text":"Unimpressed  :(\n\nStay date 2-19-14\n\nNice private bathrooms, easy on/off adjacent freeway a","useful":6,"cool":1},"4HFuqXZ3XnRIoO28QrjNPA":{"text":"Great place within easy walking distance of Bourbon Street and all of the French Quarter w","useful":0,"cool":0},"sWz2fMgZpUwfjloFc3nEZA":{"text":"5* RV Park which is a 15 minute walk to the French Quarter (not suitable to walk at night ","useful":1,"cool":0},"6-D5wcu_XHVbdmF6wyN5cg":{"text":"Perfect in all ways: easy access off the freeway, really nice well kept grounds, friendly ","useful":0,"cool":0},"P4-zsIyIJkLCXNf1SV6OlQ":{"text":"We stayed here on our BBQ road trip from San Diego to Memphis and back home.  This was by ","useful":2,"cool":0},"NUZgjGKsZZDnx8VrZigzRA":{"text":"Came here on Dec 26th.  This place has big spaces, its clean and the staff was very friend","useful":0,"cool":0},"yB1zIPFwVtdYlXLKsSrCoA":{"text":"We had a wonderful visit here last year. Everything seemed clean and well-kept. The comple","useful":0,"cool":0},"oMUuwReDvdaaGHw3xpvGWQ":{"text":"My husband and I love this place.  We feel as this is our home in NOLA.   The staff is won","useful":0,"cool":0},"t2jp62YTWBQGHP9yI5IfUQ":{"text":"I admit I was a bit skeptical at first but after parking our class A in a nice wide paved ","useful":1,"cool":2},"6ybyVM0dGPHPKtg8eqo3ag":{"text":"This was our first experience \"urban camping\" and it was great! We walked to the French Qu","useful":0,"cool":0},"o7qO74cPCt5aEAsGv74z1g":{"text":"This is my first review to write but the young girl at the front desk was so rude I felt l","useful":5,"cool":1},"sapBNcpB7ql5s17ZRG384w":{"text":"Drove in from Texas- set up the trailer walked to the French quarter turned around hooked ","useful":4,"cool":0},"VqfIBGcxGmWhuqCX9jElYg":{"text":"Like: Location \n\nDislike: Prepaid with credit card a month ahead for Jazz & Heritage Festi","useful":6,"cool":0},"BHj_wTsK0C5EQxFNXsHFGA":{"text":"A very nice place to stay and visit New Orleans. You are in walking distance to the French","useful":2,"cool":0},"8SHHBpy6wBygHs66KKfPKw":{"text":"We called in the day before we arrived to make sure we were able to get a site. It was our","useful":3,"cool":0},"aCTer43v-oOj2TktlT_npw":{"text":"Good location, but way over priced, got 3 days at Pelican RV, for  less than 1 day here!","useful":1,"cool":0},"bWtJt6sO_mpIdRewp3IphQ":{"text":"Stayed here 2 years ago very happy with the park. Went online to make reservations for Feb","useful":1,"cool":0},"Mln397GCVy30JQj9VSIurg":{"text":"We thoroughly enjoyed our stay here. The sites were nice and clean. Our dogs loved the lus","useful":1,"cool":0},"KK-4W9ExXzRWyv_8vehd4w":{"text":"Great RV park... if you are deaf. Between the interstate noise, constant sirens from the n","useful":2,"cool":0},"KN9-z0pWXMv6Yl308vvt5g":{"text":"Location location location! You cannot beat the location. Steps to the iconic French Quart","useful":2,"cool":0},"g2RvW8WMmkWwtvm0WxmL3w":{"text":"We had a specific site and while driving down we decided to try and upgrade. The staff was","useful":0,"cool":0},"cnPrWSv_hPUFTC4O6fxGqg":{"text":"French Quarter RV Resort, New Orleans, LA is located on the edge of the French Quarter. It","useful":0,"cool":0},"5gGknnTSt8TzafMLftzcAQ":{"text":"The assistant manager on Wednesday morning Aug 28 was very rude . Disrespectful and her pu","useful":1,"cool":0},"oPUDgqbSsjRhialO6zrEEg":{"text":"Location, Location, Location....  It has that, but now they are letting RV's park outside ","useful":4,"cool":1},"cUc0y8zFznA4Wy19uTtcJQ":{"text":"OK guys this is a pretty nice park there are some issues. I walked around the park with my","useful":1,"cool":0},"UI4WRivgeuTsc04GDxG-DQ":{"text":"Way way overpriced ($128.94) NOISY  spot right next to the highway.  Lots of homeless walk","useful":0,"cool":0},"Fdix00W0BZG6Igvw2uioOg":{"text":"Was in an excellent location, felt very safe, extremely clean, no crazy wildness at night ","useful":1,"cool":0},"RxFTDPH9YW4gu8WbDJMXJg":{"text":"I had to cancel due to Covid 19. I was charged $50 cancellation fee. \nThis is terrible bus","useful":0,"cool":0},"rvAsiFo_b8KtbMHwCHIPhw":{"text":"I booked this spot based on location alone without reading reviews. As I got closer, I sta","useful":0,"cool":1},"6ibWjX0V1BeJgGwqg4eQGg":{"text":"We were supposed to go to this part in late March. Due to the coronavirus, we had to resch","useful":0,"cool":0},"i7JEOvAVlOR_GraOYw0gGQ":{"text":"Fantastic location just a few blocks from Bourbon Street!  Worth the price!  We had an Ube","useful":1,"cool":1},"A-uUt-CiubAcbl6NACmmbQ":{"text":"Very clean, very nice, very safe and level hookups beautifully spaced out. Walking distanc","useful":1,"cool":0},"G9rhvyjlKYe5As-unoMhzg":{"text":"Great location, but not worth the ridiculous price.  The park is an oval of back-in sites ","useful":4,"cool":0},"Lq7ckvGKhWNxwYcWPDCipg":{"text":"Worst customer service we've ever encountered in a campground! Rain was coming down in buc","useful":2,"cool":0},"M4uOwqi9hnxaG99QaUNMWA":{"text":"Staff is very rude. Andrea had sass the entire time. She seemed very put out about helping","useful":1,"cool":0},"4EVlpI_gcKARixhVOr85dw":{"text":"If you want to stay within walking distance of the French Quarter, this is your only optio","useful":11,"cool":4},"VmAyVWqqZjqKuuect9B31A":{"text":"Very noisy, especially when trying to go to bed due to the highway.  The tiny pool was not","useful":0,"cool":0},"CJQXTd6ZTBxhWh80GBJD-A":{"text":"This is a very secure Very clean RV park, pet friendly and walking distance to the French ","useful":0,"cool":0},"PSvEGeM3X0R9XIEID0KvzQ":{"text":"The staff was very accommodating \nPark was keep very clean\nQuiet\nGreat location \nWould rec","useful":1,"cool":0},"tevvg8YBjU0CFyxEjJV-zA":{"text":"We had planned on visiting New Orleans in April traveling in our motorhome from CA. Severa","useful":1,"cool":0},"9-vexWmEwDZ5SGvIwqOCog":{"text":"We stayed at the French Quarter RV park for our anniversary this year.  We loved our time ","useful":9,"cool":2}}