{"iFvVIBmf5NsV28TC4R2rXg":{"text":"Stopped in for lunch with my fiancé after hearing that this place finished highly in the f","useful":3,"cool":2},"4HHlcIo6IvWoRXL2ollDHA":{"text":"Great pizza at a really great price. On Mondays through Wednesday you can get a large any ","useful":1,"cool":0},"CWuITD75obw5Z9f3epTdPg":{"text":"I order from Pepperoni Ray's once a week cause thats the only time we eat out....but anywa","useful":0,"cool":0},"3s9M5rfsTGWIqSfN3gHkyQ":{"text":"Great affordable quality local pizza. I enjoyed it as a student living down the street in ","useful":0,"cool":0},"3DRDj0t2x0hRJnHhyVjIBQ":{"text":"Friendly service, reasonable prices, and great food! Stopped by for lunch and was very ple","useful":0,"cool":0},"4twZcNq5PrHUOz5Ab8zXmg":{"text":"The pizza is Old School as I remembered over 35 years ago. As it was said \"It's in the cru","useful":0,"cool":0},"mvOnsJXR4O4B7hSCVX-qww":{"text":"Just called to order from here since the website says it closes at 9 and I know for a fact","useful":0,"cool":0},"Qm9nmcZFlTVoEljMBCrhxw":{"text":"The pizza was pretty good but this review is ALL about the wings. I don't want to write to","useful":0,"cool":0},"oqJJzlHTC0erZsEmYzFM_Q":{"text":"Been meaning to try this place out since i've seen and heard pretty good things about this","useful":8,"cool":3},"BPAriP9lNJyx323bMoEZkA":{"text":"We order delivery toms.  Great food.  The gentilly, the buffalo chicken pizza.  Wings, sal","useful":1,"cool":1},"2lQS_py592YyWyBvadnpZw":{"text":"GREAT GREAT GREAT Raymond's Pizza and wings are the best in town.  If you have not tried t","useful":1,"cool":2},"f-dejaswssw0lUJp5n_yyg":{"text":"owner has a very nasty attitude, he should not deal with the public....he neesds to stay b","useful":1,"cool":0},"BSFeBYCOe6i1Txpaew1kGg":{"text":"i called in and placed an order wings and pizza .i asked for wings well done.. i was told ","useful":0,"cool":0},"rArHyyY4e5-IYlKwau1U2w":{"text":"It seems I'm the underdog here, this pizza was not memorable, I ordered a medium specialit","useful":0,"cool":0},"y44tgt7xMBhwnViwu1IUIA":{"text":"Great locally owned pizza place.  Superior to chains.  The crawfish bread and wings are a ","useful":1,"cool":1},"VXEsJIgF04vxRqK_6Q66tw":{"text":"I wish I could give this place 10 stars I had pizza lemon pepper wings crawfish bread and ","useful":0,"cool":0},"XFAPjI4i96CsiKntVN7NiA":{"text":"The Big Easy pizza was absolutely delicious!  My wife and I had just gotten into town for ","useful":0,"cool":0},"k5irzEwW-iXGIFm-W4xXgQ":{"text":"Good pizza at a good price. I think it would a great place for take out. As for eating in ","useful":0,"cool":0},"RHQxKVP4Dcuw8EERFT7z1A":{"text":"Best local pizza spot in Gentility!\nIt's a tad bit expensive and their online menu can use","useful":0,"cool":0},"GVmae51dEU1EM8zRECCEow":{"text":"I'm a fan of local business and pizza, so I was excited for Pepperoni Rays. That excitemen","useful":3,"cool":2},"ZL-ujlP_wTEMT06Im_FrTg":{"text":"This is a unique pizza joint. THE FOOD IS AMAZING! Slow service and one person making the ","useful":0,"cool":0},"CYcDqrrdlkzXa88Z_Rqsrw":{"text":"Yummy cheese bread!! But my salad was kinda piddly. Only had about a handful of romaine le","useful":0,"cool":0},"NS7svmmTi_WARvJiOzfWug":{"text":"This pizza is sooooooooo good please try it you want be sorry I promise you and also try t","useful":0,"cool":0},"w4FjyEbpHiGCO8tQycc-yw":{"text":"Never had take out only delivery and they definitely come within the expected arrival time","useful":0,"cool":0},"_1q-4oCbVXcdqbkGmrXMlQ":{"text":"I would loved to have tried this place.. I called and was told (very rude female answered ","useful":1,"cool":0},"UZA36pDqA0f27J-jxFV71g":{"text":"The food here is legit. I will be honest the whole configuration of the restaurant is funk","useful":0,"cool":0},"S2rEHnAroQznIHHmJ3v8Ng":{"text":"The food was okay but the guys working there kept staring at my girl friend so things got ","useful":0,"cool":0},"eWP5km7NDDrUlozdHmliow":{"text":"Ordered two pizzas for pickup over the phone. Was told it would be ready in 25 minutes.\n\n2","useful":1,"cool":1},"Q14dmJc6GA_hPBOWcZ2QQA":{"text":"I ordered a pizza from here Friday, April 28th. Everyone there was sweet however, when I g","useful":0,"cool":0},"Q1uaJ1rciWn6gS9Rcvjh7w":{"text":"This place is a diamond in the rough. Great pizza, wings are properly prepared and salad i","useful":0,"cool":0},"DfrrV_diCQehwiX7aO5Tdg":{"text":"Excellent Food!!!! And the service is perfect as well.  We had the lemon pepper wings whic","useful":1,"cool":1},"KCoM0mJKkGL-HzEDcRo6JQ":{"text":"I was really looking forward to trying this place out. Didn't have and pizza though. I ord","useful":2,"cool":0},"OVZWYNVPVgrTulFRL0dXCQ":{"text":"The first time I went here , I had the loaded fries. Mozzarella cheese, black olives, jala","useful":5,"cool":3},"6dSEoUbNn58JXf2kAXgUSw":{"text":"Very good local pizza spot in Gentilly. Extremely convenient to order ahead and pick up on","useful":0,"cool":0},"QBdm2CN3UcyHmNGdM8-CUg":{"text":"We ordered wings and pasta for an event. Everything was delicious! The food depleted so qu","useful":1,"cool":1},"v7Tx7aeK5c1ce68GrF_EWQ":{"text":"LOVE the sweet heat wings!! the pizza is delicious too. always hot & fresh, really nice se","useful":0,"cool":0},"SnzBJEd9Vf7wlbzPyL_HVA":{"text":"Wooooo Hoooo!!! So this time I tried an actual pizza-like dish... That being the ULTIMATE ","useful":11,"cool":11},"bWALhOBPCaNiA3prJ7TZAQ":{"text":"Absolutely love the wings!!!! The ultimate cheesy bread is good as well. I haven't had a c","useful":0,"cool":0},"niLiKQrrD__0R3sDDb06GQ":{"text":"The place is upstairs and kind of hard to find, you have to order food in room and sit in ","useful":1,"cool":0},"CHYAevAnEnWUR3XTqbHHyQ":{"text":"Got salad, wings, and a can drink. Wings were delicious and baked. The salad was also very","useful":2,"cool":2},"MHaM02E37r_fD9TBiqDf9A":{"text":"Some of the best pizza in NOLA. \n\nThe place is hidden if you don't know where to find it, ","useful":8,"cool":7},"KmBlqjXMHIWs2lSlC_XC4w":{"text":"Pretty good neighborhood Pizza joint. I tried the loaded fries and the hot sausage pizza. ","useful":0,"cool":0},"4TNDocEph3pkKgQSRuOLzg":{"text":"I love the people here, there so nice. The food is really good and unique for a pizza plac","useful":0,"cool":0},"SNo-iU0zM_2oGy1zklknFQ":{"text":"Food was great! We got a meat lover's and some crawfish bread.  Both excellent!  More of a","useful":1,"cool":1},"s8NH_pDEep89L_8Fe-B6Ww":{"text":"Pizza is so so, but is better than Domiho's or Pizza Slut by far. Ordering over the phone ","useful":0,"cool":0},"lnPjFd7VIFGeh2NlH9iiCw":{"text":"I have little options in terms of delivery to Paris Oaks and I DID NOT want Dominos pizza.","useful":1,"cool":1},"V1Yx3szXe5jKDOR-6fQRXg":{"text":"Best pizza I've had in a while.  Looking forward to a return visit soon.","useful":0,"cool":0},"HtvauVpZRkJnEdo7uidmPw":{"text":"Great to have a local pizzeria in the neighborhood. Pizza is one of my faves!!! \n\nI visite","useful":7,"cool":5},"f2YGulqxC_0CoZqm2LjcdQ":{"text":"I'm addicted to the crawfish bread,  and wings. ...... I'm always greeted and the staff is","useful":0,"cool":0},"nlVx0M0FERjLSb6tk-_KbQ":{"text":"Amazing pizza. You won't be disappointed. Love the cinnastix. I can't wait to try the othe","useful":0,"cool":0},"a3Q1D2Jll4TvNvbDoeMKow":{"text":"This place is a delight to visit. I love the wings and the pizza especially. I enjoy the v","useful":0,"cool":0},"OovpHvJEJ5-c0lbPl_Ez1A":{"text":"Yes, this place is a bit out of the way for me and tricky to find (well, out of the way is","useful":6,"cool":2},"jrofEbejT3ZEVXY4TVCXUw":{"text":"Pepperoni Rays has reopened as a popup inside cafe Gentilly after they've closed for the d","useful":1,"cool":2},"XpI3S4oF7Eu6Erw8nLZ5UA":{"text":"I'm a fan of Pepperoni Ray's and can't wait to go back for more! I actually haven't tasted","useful":5,"cool":4},"Qb0bLdvxdfxH4u9gGj7TQw":{"text":"I've eaten here so many times and it's the same all of the time. The customer service is o","useful":2,"cool":2},"6N1rWYTszXNGIFhxJkObPQ":{"text":"Awful, awful customer service. We ordered a pizza with a 45 minute turn around time and ga","useful":0,"cool":0},"z2_lm8FOZk6qK71j_Ty6tA":{"text":"The best pizza, hot wings and cheesy bread in the city....Hands Down! Friendly service, sp","useful":1,"cool":1},"7ikpoyYzfoQwg-BYcjbxgQ":{"text":"Just moved to NOLA from NY and I gotta say the pizza is awesome!!! I tried many places dow","useful":3,"cool":2},"KPrBo5N30zdrFNXBir8OGw":{"text":"Great take out pizza. Can't recommend eating there or go there when it dark. It's just me.","useful":0,"cool":0},"maVIIeI9N_HyA_tuWnSABw":{"text":"This place has the best pizza in the city and they deliver to areas with very few options.","useful":0,"cool":1},"-y9lT02ZVOI8PHTEEkNDKw":{"text":"*Attempted* to order delivery from here while working my usual evening shift. When a co-wo","useful":1,"cool":2}}