{"orcswjh9R7zUj4P_zIBKAA":{"text":"I'm a current resident in this hotel and this is my experience, all less than 24 hrs. I sh","useful":5,"cool":0},"II8aLpfg_hghaiZmsn5ceA":{"text":"I snagged this hotel on our last trip to New Orleans not really knowing very much about it","useful":1,"cool":1},"wBtqKKTsfHj93b4htMpbwg":{"text":"Delightful and reasonably priced hotel in the warehouse district.  It was easy to walk to ","useful":1,"cool":1},"qJayyweKRmxJQ8YJDbK5rw":{"text":"Had an issue with an upcoming booking that needed to be changed.  After writing a review I","useful":0,"cool":0},"fMFfx7Vwqk7WC6HjCLt_sA":{"text":"This is by far our favorite hotel in Nola. \nIt's a beautiful romantic boutique hotel with ","useful":0,"cool":0},"2QKI1N9tbgrFmJwn6yL0Gw":{"text":"The bad reviews must be from the old Ambassador hotel that was at this site some time ago.","useful":0,"cool":0},"euQZOitjYpQj68qmewb5hA":{"text":"I was hesitant after reading some of the reviews. However, we had an amazing stay. The hot","useful":0,"cool":0},"wFQQjz-9r4q00BFHET1V-Q":{"text":"Such a lovely hip hotel with great location. It has so much charm. Fun downstairs with a g","useful":0,"cool":0},"nLQDZwd-mqng80WjQ9Ep0Q":{"text":"Awful, Awful, Awful is how I would describe this hotel! My boyfriend and I were staying he","useful":2,"cool":1},"H4wnNrf2Z589MD9X0qRGcA":{"text":"We came to this place thinking we'd have a quick drink at the bar (very nice bartender so ","useful":2,"cool":1},"2-i4-S3DDEifMatzgKJdJQ":{"text":"Stayed here weekend of October 10-12, 2014. We got the hotel from the Hotwire.com deal. My","useful":1,"cool":0},"Q9j1nPNIp-k4lSSFZsm8Mg":{"text":"Great hotel for the price. \n\nOur room was very spacious and clean, loved the exposed brick","useful":1,"cool":1},"rGaSBVpHN17tTttJ13MAZQ":{"text":"Just checked n for a few day stay for jazzfest and we are quite happy with the hotel. Yes,","useful":0,"cool":0},"iUndwNsxjBvEfdd8GbT1gg":{"text":"Very nice ! Would Definitely stay again, especially with the great group on deal we had. C","useful":0,"cool":0},"Nl32yd-GXU17PxV-oqLtcw":{"text":"Mary the night desk clerk was amazing.  She helped us check in that night to was very late","useful":0,"cool":0},"nIgcqSkwiY7z57kV4MGg6g":{"text":"Very trendy hotel in a great location as it's close to everything, but yet outside the Fre","useful":0,"cool":0},"52mxQRlwfZVz3loJOMqm0w":{"text":"I was kinda surprised at how much I liked this hotel. After exhaustive research (per usual","useful":0,"cool":0},"_AyrwT-w1ZqhfP4D1tR42Q":{"text":"We recently booked a trip on expedia.com and before confirming the package I checked out t","useful":0,"cool":1},"1j6FvEhqVaybE8mgf_zgOA":{"text":"Modern, trendy, smart hotel in the heart of Nola. Great atmosphere and superb sevice from ","useful":0,"cool":0},"mpGtllduA7Ib-9xBRdYW8g":{"text":"I wanted to stay at a non-chain hotel, being in New Orleans... just for one night, wanted ","useful":2,"cool":0},"Q3Solk70BsZCkurzcCTGZw":{"text":"Whew! When we arrived, we were greeted and checked in by courteous and friendly staff. The","useful":0,"cool":0},"RMKHwPu62lLAiFRZdOIjxA":{"text":"Color me conflicted.  On the one hand, I thought the overall atmosphere at the Ambassador ","useful":2,"cool":2},"1EqYvF5e87SOWdBzvSv9dQ":{"text":"This is a great hip space in an old warehouse and a great location.  Had to check in early","useful":0,"cool":0},"IEjC34RKg3KenfbaWEqd3A":{"text":"Beautiful hotel with great vibes and style. \nThe room decor is exquisite and had so much g","useful":0,"cool":1},"5FhzYM5SSyvxkgCnsjyJhA":{"text":"I booked through expedia for about six people, at least two nights each, for this hotel.  ","useful":4,"cool":0},"wUuNy-6OYIqBIe95_k3k0Q":{"text":"My bed had black hair in it.... Super gross sheets . My bathroom also had black hair all o","useful":0,"cool":0},"UcsVel-UHZ6Bz4KJpbetvw":{"text":"This might be my favorite hotel I've ever stayed at. \n\nVery hipster and new school modern,","useful":2,"cool":0},"N6NToHm_Cgcp5Pr2fm9-Uw":{"text":"Awesome hotel right in the middle of everything NOLA has to offer. Front desk lady was sup","useful":0,"cool":0},"f8chSY1RYc3grc8OrQ8vXQ":{"text":"Stay here if you want a cool, down to earth, modern but authentic NOLA experience! The bri","useful":0,"cool":0},"g40oJ4BXOLkhKnazPHmsnw":{"text":"People probably give this place bad reviews because they aren't ready for old-fashioned de","useful":1,"cool":0},"csdU4nJHoT006XsFmpDB3g":{"text":"Two stars for location and I suppose friendly staff/free breakfast in the morning. \n\nKind ","useful":4,"cool":0},"Y1C1vSsQabrP1GVfVOAksA":{"text":"Arrived here at 3.30pm and we were greeted by very friendly front of house staff. The room","useful":0,"cool":0},"_KZiAC2Eb8SuMuexa_YNJQ":{"text":"I DO NOT recommend this hotel as it currently is. If it were possible to rate a zero, this","useful":1,"cool":0},"Cpb9jum46FDaRJcap1rkkQ":{"text":"In giving this hotel 5 stars , only because I can't give it 10 !!! \nI have stayed all over","useful":1,"cool":0},"NKb8kUDPiTsesU34z03d6w":{"text":"My husband and I made a last minute decision to stay in New Orleans on our way back from F","useful":0,"cool":0},"-bRjj5lG0vduGVSw1QJLYw":{"text":"Here for the saints v. Bengals game. Staff at the front desk and bellman were very helpful","useful":0,"cool":0},"GjJ4k5Z07w4_OgEIZKVMVQ":{"text":"Stayed here for 2 nights with my wife and 2 kids. Drove in from Dallas, TX (548 miles) to ","useful":3,"cool":0},"kUfo6TqnR_euADF3u3vwBw":{"text":"Hip and modern looking on the inside. Stayed two nights during Jazz Fess. Way too expensiv","useful":0,"cool":0},"MFXD03KV9eQmD2bP3-xhPA":{"text":"I love this hotel. From the rad bar downstairs to the nice front desk people, I enjoyed my","useful":0,"cool":0},"cg0k_J-dKp4Rlmqh0qdLvg":{"text":"Super cute boutique hotel! Was there with a friend for the Essence Festival and the room w","useful":0,"cool":0},"nryifcaTKmYpG4WqVFgFJQ":{"text":"I had hopes despite the poor reviews, thinking this hotel had character. Instead I found a","useful":5,"cool":0},"T1czEvz5XKi4jdPsX0VTdw":{"text":"WILL NEVER STEP FOOT IN THERE AGAIN!\nThe rooms are drab, outdated, NOT CLEAN, loud. My bat","useful":2,"cool":0},"9yyJMA1jV17t7ydIrmbYhg":{"text":"Okay, Im so on the fence about Ambassador its not even funny. \nFirst and foremost, we coul","useful":1,"cool":1},"sz0mbjGRn_-rZAbNcn0OmQ":{"text":"What a fun little hotel in the Warehouse district. They're renovating, but inside the room","useful":0,"cool":0},"rN4GTYHJ4Ik8ofpawgE59g":{"text":"We stayed here on our cross country road trip and we loved everything about this place ! I","useful":0,"cool":0},"O-OJZuugaWTqUenZoxdbvw":{"text":"Awesome hotel, so glad I found it and booked it for my first NOLA experience! Unlike some ","useful":3,"cool":0},"qyQKWB2T5muskPG5AEN4yg":{"text":"BEWARE: BEDBUGS! Hello, fellow Yelpers. I stayed in this illustrious bug hotel over a week","useful":1,"cool":0},"km2ajzRElZsnY2ir05Mu9Q":{"text":"Everything is just off - restaurant only half full but we inexplicably were seated next to","useful":0,"cool":0},"pqCvUvJchO_0V8h_S4U8Kw":{"text":"Came to New Orleans for business and this is my second time staying here. The historic vib","useful":1,"cool":0},"coi592r_oDnKyiE2tIwC2A":{"text":"Wonderful workweek experience. Not only is the location perfect and the value second to no","useful":0,"cool":0},"SlSCob2L4DdNOisQMp7VpQ":{"text":"Really loved the look of this hotel...beds were comfy, restaurant/bar area was fun and bus","useful":0,"cool":0},"y59uJj07iMaIpHaf8UKXww":{"text":"Located on a street that took nearly 2 days to pronounce properly (chupi-too-las), is a de","useful":5,"cool":5},"F-yU5IKHKJk6RCPPuSw3Ug":{"text":"Great location.  Awesome bar. Wonderful restaurant.  Housekeeping leaves much to be desire","useful":0,"cool":0},"wsr7YmwktIiyyMJhslNryQ":{"text":"Forgot to write a review for this place.  I stayed here last year for my birthday.  Rooms ","useful":1,"cool":1},"mh0nk1uv1iYJ2Onf2MGk_g":{"text":"The building definitely had some character. We were looking for an experience unique to Ne","useful":0,"cool":0},"2wQ4unzNa2teiGjhClIZ9Q":{"text":"I just returned from a 3 night stay at the Ambassador with two friends.  We had some troub","useful":0,"cool":0},"jviw5UYau_n8IrnX_PncXg":{"text":"My fiancé and I booked this hotel through the hotel tonight app. I don't normally do revie","useful":1,"cool":1},"E8LPwWfGr6o7QO2eZDe_cg":{"text":"Location is one of the best things going for The Old No 77, easily within walking distance","useful":3,"cool":3},"c-GAUxe-31eLSTTRqc-p3w":{"text":"This hotel was a bit of a disappointment.  At check-in they asked for a $9.50 per day fee ","useful":0,"cool":0},"0HJ_MNo-kuLIBrvO7UibrA":{"text":"This is a dump.  Rude staff.  No windows to the outside in most rooms.  Mold mold mold.  D","useful":0,"cool":0},"RGsiHBAItz8b39X7kWepEA":{"text":"Got a room here for one night after working in LA Place. Great location, close to many bar","useful":0,"cool":0},"wkeqPd5tqJCBBFgOCCi0zg":{"text":"We stayed here and absolutely LOVED this place. Great location and easy to walk to everyth","useful":0,"cool":0},"gplfWp6xvGkc9Dd2gJyKVg":{"text":"A lot of things have to happen to make a hotel provide service this poorly. The front desk","useful":2,"cool":0},"9kJNZuynFCt_HlHam-wFhQ":{"text":"1) Here's the kicker: a colleague of mine got stuck in the elevator for 15 minutes.  He ra","useful":1,"cool":0},"2Saow44LIn7_YGRu-Hp2-A":{"text":"They are currently undergoing reconstruction and the entire hotel is just very unattractiv","useful":0,"cool":0},"Wvezc1YfyNGY620MhmWzDw":{"text":"Thank you so much to the staff for making our wedding weekend amazing. We received an UNRE","useful":1,"cool":0},"zvgnRnLFO8TnopBRoiQIzQ":{"text":"The best new hotel in this city! The room we stayed in was spacious and the bed was like s","useful":0,"cool":0},"UPhPHeCVxWfXHmN39o-mBQ":{"text":"The photos are deceiving in that few rooms have windows and if it does have a window it's ","useful":0,"cool":0},"bDE2M30KU1T7YatCUXIfRQ":{"text":"I literally created a yelp because I was so pleased with the customer service I received f","useful":0,"cool":0},"cAZla6fEuD7Xdnh_SiPtTw":{"text":"Great location but hotel is old, under construction right now and was very dusty. Very pri","useful":3,"cool":0},"zLJXFkj8QRO2tObTt__etg":{"text":"Dump!  Worthless dump!  Staff is worthless rude and dumb.  Rooms have no windows. Its a ra","useful":0,"cool":0},"WMotYjtX3CDsKIGDrRT2DA":{"text":"The location was great, the Hotel staff are very friendly and helpful. My first night I wa","useful":0,"cool":0},"BtYQnCO5627hkdmIfSigRQ":{"text":"I was here with 6 other girls and the hotel is nice but Josh at the front desk was super c","useful":0,"cool":0},"zrFRMV1d1FLI9umcEu35Qw":{"text":"An ok hotel.  Somewhat interesting decor but pretty dark and not at all \"charming.\"\nFar an","useful":3,"cool":0},"TsLO4pHBOkhEtTcnIKkxaw":{"text":"Let me start out by saying I don't believe in ghosts. Having said that, I cannot explain w","useful":0,"cool":0},"9hGOeQmyToxROCh_adMMnw":{"text":"It's like staying in a haunted hotel where the ghosts never sleep.  The wooden floors are ","useful":0,"cool":0},"SXxddFJ6UtDjDjpGlxYZQw":{"text":"Our second time staying here and we had an even better experience than the first time. We ","useful":0,"cool":0},"VEbXM5vPWM5L_73lX0eOpg":{"text":"Love this place!! The decor is adorable.  The staff was very nice. The location was great.","useful":0,"cool":0},"M5ZEwC5-VnnOoQJX8L7xnw":{"text":"The rooms we're good and Valet parking was a God send since I was traveling with a U-haul.","useful":0,"cool":0},"COmSNb_rUPLZJ47wSywl0A":{"text":"After reading the negative reviews I was a bit wary. We arrived and the hotel is being ren","useful":3,"cool":1},"Cg396D82Vqmo6KsLVg3R-w":{"text":"This hotel is under construction but the rooms were nice, the staff was pleasant and helpf","useful":0,"cool":0},"3vyVT9fzbaJufpZ1VwQdQA":{"text":"We booked this hotel last minute and got a really good deal. There was some sort of conven","useful":3,"cool":0},"KBqGnwJWm6EAgpr5jbbr-A":{"text":"There were NO window's in our room and the carpet from the elevator to the room was FILTHY","useful":2,"cool":0},"xp9YytDKuXE7eyE5Sehgqw":{"text":"Unfortunately the rooms aren't anything to write home about. Hardwood floors and furniture","useful":0,"cool":0},"s5TgKEUicPH4r3zXYLlxFA":{"text":"Stayed here last week because it was a pet friendly hotel.  The price was great and locate","useful":1,"cool":0},"NEVVPpeooUN0gUyr8i0q2w":{"text":"The hotel staff initially gave me a key to someone else's room upon check-in, in which I e","useful":0,"cool":0},"iFvGp54NuolCm-NA_m-3Ng":{"text":"When I first walked in, I was so impressed and couldn't wait to stay here. Everything abou","useful":1,"cool":0},"AEsn75vCJ4Yzn6eaw4c0pw":{"text":"I am shocked to see such a low rating... this place was fairly inexepensive, clean and had","useful":0,"cool":0},"pmvvgZfRj8Ep9mN38otJcA":{"text":"I recently stayed at the Old No 77 Hotel three nights over JazzFest. The hotel is charming","useful":1,"cool":0},"-mbEAUwLpSpOrZ4WzEcc6Q":{"text":"Delightful.  Went for the restaurant, which was superb.  I am on a limited diet and eating","useful":0,"cool":0},"lt35_Jyx_HbPhoQVhm7n-A":{"text":"After booking and checking reviews on here I was hesitant amd hoping we'd have a better ex","useful":3,"cool":2},"vic4qyqw18YYlLK4xwaVHQ":{"text":"They charged my credit card for stuff from the minibar that I never took. I have called th","useful":0,"cool":0},"kZRj3hw01znHSlfj5d8eKA":{"text":"As the website mentioned, the hotel is under renovations, we get that. However, 7 in the m","useful":3,"cool":0},"nD1Dg9jnOpvmj7JuvRjWGQ":{"text":"I absolutely love this hotel as well as the food served within it (Compere Lapin), which I","useful":4,"cool":1},"pOmiAYw-eWYI1MwocvU2NQ":{"text":"One the surface, the building is nice enough, and so are the rooms. And as far as service ","useful":0,"cool":0},"BmJzZ2T2IlzKWL92zdw88w":{"text":"Hotel has some age on it and staff isn't very customer friendly, but the location wasn't t","useful":0,"cool":0},"ZjvGnyK2bZVPZ9nT4cEXaQ":{"text":"Somebody else said it best: dark and creepy.  I didn't feel the room was clean, which has ","useful":3,"cool":1},"M70Vv2CJaeBzexBdwbqIjQ":{"text":"If I could give 0 stars that's what I would give it. This place is nasty. It should be cal","useful":7,"cool":0},"jWTR-2U6149XaGnZGApZtA":{"text":"The hotel is cute. You get what you pay for, so there's not a lot of \"extras,\" but it's cl","useful":0,"cool":0},"OrSASSx542a2bEiw_9QFKA":{"text":"Sleeping wise the beds are uncomfortable and the rooms don't really get cold. The floors s","useful":0,"cool":0},"HMskcq7Rx-qSbGoNGm9XCQ":{"text":"We loved our stay! The service was wonderful. The room was fantastic and the beds were oh ","useful":0,"cool":0},"3YR2mOfMc-gKsWa4fWMo3w":{"text":"I can see how this has the potential to be a great hotel, however due to construction curr","useful":4,"cool":0},"Z1sY8EYyJ46q5Nsje-hYWQ":{"text":"We stayed here on a random Summer Tuesday and received what seemed like a great rate.  The","useful":0,"cool":0},"OosBG-u74lDw76GG5iNd_A":{"text":"I called in advanced to early checkin just to make sure I could at least valet and store m","useful":0,"cool":0},"_P6QCD21_hewRxdqceFVWw":{"text":"The interior decor is very nice. The exposed brick adds a really nice touch. I read online","useful":2,"cool":0},"D2Ec6ZMNf-ZE00aRBRnOvA":{"text":"I really loved the hip style of the hotel. Decor is great in lobby and bedroom, but the ha","useful":0,"cool":0},"7Uxu6CulqhrTo6JGYkgLdw":{"text":"I recently stayed here for four nights and had a great experience. I was a little apprehen","useful":2,"cool":0},"eCpaUzkoLDM2BUkMbSr9aw":{"text":"Not Worth It. Too many other really good hotels in New Orleans to ever stay here again. Pr","useful":0,"cool":0},"pIZu29MpLmeRzgIXGoo5iw":{"text":"I really like this hotel, the rooms are clean and the restaurant is really good. The staff","useful":0,"cool":0},"JQ1-fyTTHxM2wmnyjnUizA":{"text":"So, we pull into New Orleans for the night and have chosen Old No 77 to stay in as they ac","useful":2,"cool":0},"QKYL3MYtbqpo_AZ0CARyLw":{"text":"It's not a 5 - star hotel, but it's not a roach motel either. We ended up staying here for","useful":0,"cool":0},"cnhcoPUwIljxGl-_iOEINg":{"text":"This hotel was everything I thought it would be and more.  Friendly staff at check-in whic","useful":1,"cool":0},"r2CXYViFF97EHzinxGpffw":{"text":"This was probably the worst hotel I've ever stayed in! I picked the hotel because the pict","useful":0,"cool":0},"Q41f4IGYNE-iwDOrUQjrgQ":{"text":"Not a bad stay, but adjust your expectations accordingly. The rooms are spacey, have a cla","useful":1,"cool":0},"XxRK8wZtQHfQbSENcAb-CQ":{"text":"I an not overly impressed here.  The ten dollar per day room fee is annoying.  A ceiling t","useful":1,"cool":0},"cvE7pAbEPY1VLj31d-2Cmg":{"text":"I've never stayed in a room with no windows. I have to admit, it's a little freaky for any","useful":4,"cool":6},"AkrijmEb0OlO2QGiQYm_Ag":{"text":"Loved this hotel! The lobby smells amazing. The rooms were cute and decorated nicely. The ","useful":0,"cool":0},"FIC22PxAGaypRXkYdDUPcg":{"text":"The best new hotel in this city! The room we stayed in was spacious and the bed was like s","useful":0,"cool":0},"aKQSZh0iwbH7Oc9BhjJZ8Q":{"text":"Very cool hotel with a great location in walking distance of many great restaurants and en","useful":0,"cool":0},"XmMWQKuwqmwJ1Z324V3qRg":{"text":"This hotel was such a great deal and absolutely unique and charming. If you're looking for","useful":1,"cool":0},"tF2igfo_iZJa3ccd3DjZWQ":{"text":"My fiance and I are planning to have our wedding in New Orleans and needed a place to stay","useful":3,"cool":0},"bYIaSlCo8as9pHTAXSCbVg":{"text":"Stayed here in July 2014 because we got a Groupon. The only positive thing I have to say i","useful":0,"cool":0},"GmD7byzECYD7lWFMXYE9hg":{"text":"I always stay at this hotel. It's really my go to. I live in Baton Rouge so I make it to N","useful":0,"cool":0},"38ypfFzRybv6-qS5yxlmKQ":{"text":"Ambassador is a cute hotel with a great location.  It's close enough to walk into the hear","useful":1,"cool":0},"njG8AbflORMX6XHXaiu1BQ":{"text":"My wife and I stayed here 7/27 - 7/29/2015. I was looking forward to our stay here, but wa","useful":1,"cool":0},"YVXofZ4HO_LDRt2w1x4KoQ":{"text":"I stayed at the Ambassador hotel while I was in New Orleans for a convention.  I'll admit,","useful":0,"cool":0},"iAWVYLp2eHp_2EICrVFkHg":{"text":"Ok, after years and years at The W or the Workout room @ the Westin, we have a new fav for","useful":1,"cool":1},"JKZX2g1OadasmfO79c_XSg":{"text":"Hmmm not there yet - someone else booked for me - would rather be at the Omni in the Frenc","useful":0,"cool":0},"6Ci4bL502vIUGn6U6IAT_w":{"text":"I did not enjoy my stay the Ambassador.  And I'm not that hard to please.  I stayed a tota","useful":0,"cool":0},"wYBodzjSWHUAWVYCK5czUQ":{"text":"My daughter and I had a wonderful experience at the Old 77 Feb. 20-23. The room was spacio","useful":5,"cool":0},"RPfQjARHJgaMU7-k_bTppw":{"text":"Great walking distance to bourbon street! I have never stayed in an older hotel before but","useful":0,"cool":0},"OPwqokTceGCwSH_lzBzVkg":{"text":"I would like to give a shout out to Mary and Martha Archer as they helped to safe guard my","useful":0,"cool":0},"aNrhtE7HsWm4eV13iDjhiA":{"text":"This was a great choice. The rooms are amazing. My husband had narrowed it down between th","useful":0,"cool":0},"zlLufkhnhyOgpkX2DJG4LA":{"text":"Great location for a little less.  Close to the French quarter and river.   Quick to find ","useful":1,"cool":0},"HXh9uTegSvDaC0Z8XfJbFw":{"text":"Stay Away. My first impression was when i pulled up to the valet. No help getting luggage ","useful":3,"cool":0},"H5hNHJSzmO_kR4BLhB51nw":{"text":"The rooms aren't great but they are priced good. they are under new management, the beds a","useful":0,"cool":0},"Xi9cn549PV9Ki3epQi_RJQ":{"text":"We hosted a large group at the Ambassador hotel for a conference. The rooms were modest bu","useful":0,"cool":0},"hpAOz8_mXOKSJUxFbRY5Ew":{"text":"I wont lie, after reading several reviews about remodeling and construction I was a little","useful":2,"cool":0},"kcL7eScSSim8Wz8THuHg2w":{"text":"An incredible stay!! Walking distance to literally everything.. No need for any public tra","useful":0,"cool":1},"CS75gi96WFHxDNQqfDXO9Q":{"text":"This place is disgusting!! I've lived in New Orleans for years and was just passing throug","useful":0,"cool":0},"S0Z3wgDnB1jX_S7n7wsoyQ":{"text":"Yeah. You get what you pay for. Place is a bit rough around the edges.  Our bathroom had s","useful":1,"cool":0},"YfRdid-DOYJwt3k29tg8ug":{"text":"Lovely rooms and amazing staff. Everything was clean and beautiful, and there is art every","useful":0,"cool":0},"JrBBl4rw3jATIE5_yurq0w":{"text":"Ok so I may have overreacted a tad bit when I first stepped in my room, though it is still","useful":0,"cool":0},"p4YrBQHGswuPIEj-bRXiyA":{"text":"Okay, considering the fact that when you are in NOLA, you spend all the time in the hotel ","useful":1,"cool":1},"X3zpr68E62xH2QBRrOQCrg":{"text":"This hotel went above and beyond our expectations. From the start they made sure our stay ","useful":0,"cool":0},"TaP-kqwJVq2aXdwe_AxVcg":{"text":"The Ambassador hotel is a small, convenient hotel located near the Quarter, making it a ra","useful":4,"cool":0},"yyki9TFbtFf0TX8yP6un1A":{"text":"I was skeptical about booking a room after reading the reviews but I am glad I ended up st","useful":0,"cool":0},"EE9fNOhZ04MkCcxyGxXEiA":{"text":"Awesomeness!  Great new hotel.  Beautiful spaces, with unique character.  Excellent servic","useful":0,"cool":0},"HKrnnZbinbCBM7XHq-GjAQ":{"text":"Great hotel and great staff! The bar is amazing! The rooms are well appointed and very New","useful":0,"cool":0},"2efhBtaWOa-KOkn-uwUaqw":{"text":"Wow the 77 is a beautiful hip hotel. Great vibe, cool lobby, awesome restaurant. \n\nThe loc","useful":0,"cool":0},"VjoPtaIDRYR3X3o_OWPjMg":{"text":"I'm just going to tell you the facts about our experience here without comment, except to ","useful":2,"cool":0},"2MVimaocRyInaoQJJmbL4Q":{"text":"We stayed here recently & the staff was super nice. We got a free upgrade on our room as w","useful":0,"cool":0},"mLVj3sTqzBj7CwRq_sUiSg":{"text":"I will say first I didn't stay at this hotel but I was going too. Had to cancel my reserva","useful":0,"cool":0},"alLKWM5B_N4RHtogz_RtMg":{"text":"Worst hotel stay. Room was filthy, hotel was too. Nothing like the photos on webpage. Loud","useful":1,"cool":0},"dhlDuNDaKNia01XRwezCTQ":{"text":"The best thing about this hotel is Ray! He is the first person you see when arriving, he r","useful":0,"cool":0},"sNBUK-uDwAeoCHchHqqqSA":{"text":"I'll give them 4 stars because I was happy for the most part and would stay here again, bu","useful":0,"cool":0},"t9k5uOWMC6kQTDkZkwaUfQ":{"text":"I recently stayed there and woke up with bite marks and soo itchy..I can hear the next roo","useful":4,"cool":0},"PqHnSQ3hb7d0HNU0_Wiaew":{"text":"Absolutely loved this place. Great location. The concierge, Ryan, was incredibly helpful. ","useful":0,"cool":0},"5xqZsVdkkw9FWH9OvfaZgg":{"text":"I read several older bad reviews of this place, but my experience was very reasonable. It ","useful":0,"cool":0},"poHJ2b6UnnvrjH6jupg8ZQ":{"text":"Clean, Friendly and convenient. Beautiful rooms with hardwood floors and exposed bricks. I","useful":0,"cool":0},"lfGKpz6WyZ21-XRsQeVspQ":{"text":"We needed to find a place for our last two nights here in New Orleans since our timeshare ","useful":0,"cool":0},"Nhqj8f669nV6_8B9ZEcJgQ":{"text":"I've never wanted to leave a hotel before it was time to check out and I can't wait to get","useful":1,"cool":0},"JHMMPvR62y4QceQO3qE0IA":{"text":"This place is great! Awesome atmosphere and vibe. Everyone is very hospitable! The rooms a","useful":0,"cool":0},"0kK49lPrNkwTE4FPqD8Zww":{"text":"Great staff, cool building, excellent location, but the noise in the room was rough. Didn'","useful":0,"cool":0},"9Ikx3xe0yB68HVxjK2tjhA":{"text":"Fantastic!\nMy girlfriend and I found this place while eating dinner at Compere Lapin, the ","useful":0,"cool":0},"MYxbRd4hvV3aXU8iPHcwXw":{"text":"Stayed the weekend here. The bed was quite comfortable. However would really like to have ","useful":0,"cool":0},"u73pVA_fqyRk9wMttsXglg":{"text":"1. I booked this through expedia for the weekend for $80/night. 2. I come to New Orleans O","useful":0,"cool":0},"fP4fstoKg5wU2CHl9Rlm9w":{"text":"I purchased this deal through Groupon and I read some reviews and frankly was a bit worrie","useful":0,"cool":0},"KUBpPXTNfEI-MnE44gm3bQ":{"text":"Nice boutique hotel away from the noise of Bourbon Street. Loved the loft feel of these ro","useful":0,"cool":0},"WG0QSUz_ID56w5hhPbtjiA":{"text":"This hotel was absolutely adorable. My better half and I stayed there for an entire week a","useful":0,"cool":0},"iOqgZL1_mXW6vDC9JirQng":{"text":"This place is amazing the bartender is full of life. Craft cocktails my screwdriver is the","useful":0,"cool":0},"MmczDjc5Ll1zXjVu1A1rRw":{"text":"A solid hotel that was fine for our boys weekend in NOLA. Could be closer to Bourbon Stree","useful":0,"cool":0},"43JNf98lC5Ile-pojyKQ1w":{"text":"I snagged a room here on Priceline.  Went to check in and liked the look of the lobby.  Th","useful":3,"cool":0},"LxIpbMEzTtgXYTlBgq8rnQ":{"text":"Looking for a last minute trip for a few days which allowed for larger dogs and stumbled u","useful":0,"cool":0},"uzUIDw_uysG-Byrqaj3tuA":{"text":"We stayed here for two nights and spent $400 a night per room. We had seen their website a","useful":1,"cool":0},"8vAPbbmcCZpxEPFELk62Gg":{"text":"We traveled to Nola and stayed at this hotel during the Thanksgiving week. I have to admit","useful":0,"cool":0},"JeSobPD5FAOvp5KLC54T-w":{"text":"I feel the need to share the love with the Old No. 77.  It is a hipster hotel.  If you are","useful":1,"cool":0},"_owHYGvKm7NaUfw8i8lviQ":{"text":"Our first trip to NOLA and we were very happy that we booked our stay at the Old No 77. Ou","useful":0,"cool":0},"9S3kjbifGDhhnPRdBTPhqA":{"text":"Awesome bar, better cappuccinos! The hotel half was great too, they restored the entire bu","useful":0,"cool":0},"C3auVrp33hvC958Fc13Bwg":{"text":"I loved this hotel. The staff is spectacular and the decor is A+. It was a little weird st","useful":0,"cool":0},"34Cj3PDdSpB1oUQBmUT-Ug":{"text":"The quality of the hotel pretty much matched the fairly cheap but reasonable cost of stay.","useful":0,"cool":0},"F4eCOeI0IkjwbguQrKtD6A":{"text":"I had a good experience here. The front desk was friendly and helpful, as well as the conc","useful":0,"cool":0},"uspzWwf3cxPiVSd8ALSdEQ":{"text":"Hotel was great at first, then turned horrible real fast.   Gave us a room where we can he","useful":1,"cool":0},"LR4iy8YyvpGdzsweDml6_A":{"text":"I see this place has changed its name- and from the newer pictures it appears that they ha","useful":13,"cool":7},"kBNsyGQUa9CLkojQ8_bqXQ":{"text":"This beautifully renovated hotel would have gotten 5 stars if it were only based on ambian","useful":0,"cool":0},"Q3kOzByVZ4_f3xGEEr6Geg":{"text":"Decent hotel, but you could do better.  I travel frequently for business, so I perhaps hav","useful":1,"cool":1},"WQQ6whFN7BgIji0WEJm1Ew":{"text":"Just a short walk to the French Quarter makes this the ultimate spot for a short or long s","useful":1,"cool":1},"_R1YRgDuJoqKNnB2VhA_6w":{"text":"Just returned from a four night stay at this hotel.  Really amazing staff, especially Chel","useful":0,"cool":0},"85JBPNlvgWFQ72GuoLlLxQ":{"text":"Creepy. Dirty. A dump. Do not stay here. I booked this hotel for 1 night in January after ","useful":2,"cool":0},"A_E2vCt4XG1gyMix_JvaYg":{"text":"Booked through Hotels Tonight for a few bucks less than the actual daily rate and will be ","useful":0,"cool":0},"HchZZt791mmcNp6YSAPyQA":{"text":"Charming hotel in a great part of new Orleans.   However, I did not get my room until afte","useful":3,"cool":0},"_UivvFw5Y_MF1Y8Ouq0OQw":{"text":"I was in town for Tales of the Cocktail July 8-12th. The Hotel Monteleone where my confere","useful":3,"cool":1},"zZDSTrJ0TmmhPgfX6pGE2A":{"text":"the customer service was terrible, we were in town for a wedding and they reserved us the ","useful":3,"cool":0},"uE96M5NYEh7BCunnTNyVMQ":{"text":"This was one of the worst hotel experiences. Paid $250 a night. First night we received a ","useful":4,"cool":0},"DL4ci2fh_lDuwtoMFBf2pg":{"text":"Have stayed here many times and have never been disappointed.  Great staff   Great rooms  ","useful":0,"cool":0},"MnJNQ82cT8zdEH72_Jc1Tw":{"text":"I had a good experience here with a friend of mine.  It's in a good location and within wa","useful":0,"cool":0},"a9oxF98J-swcDS9l96ojdQ":{"text":"I truly enjoyed my stay here.  The location was in walking distance to many attractions.  ","useful":0,"cool":0},"jZtSfYCGHAQvZBGHGhyMvQ":{"text":"I stayed here for 2 nights in April during the French Quarters Music Fest. This hotel has ","useful":0,"cool":0},"8snd7d70JqwlQ4ZmrPN1UQ":{"text":"This hotel has awesome details, decor, and delicious food, drinks, coffee, and breakfast r","useful":1,"cool":1},"7g5QKvULBmE9bUviE8RhDw":{"text":"PLEASE do yourself a favor and skip this awful place.\n\nWhen I arrived, exhausted after a l","useful":0,"cool":1},"uUZGBFlkWO2BwAKIEYRLUw":{"text":"If 6 stars was a rating option this hotel would receive them! Friendly, clean, and cozy, w","useful":0,"cool":0},"Om0oY6Bi6RKxD1YBlak7_Q":{"text":"Look I get it, a lot of people want to stay in the Hilton with Super 8 pricing, it's just ","useful":0,"cool":0},"hLmy0JF3ia8q52Z1h4G6hA":{"text":"Interesting property. I booked here for a Sunday night only as Saturday was already sold o","useful":0,"cool":1},"ZJebh7ZYPBSdydwXzd8_pQ":{"text":"Really fun lofty boutique hotel. Local art decorated the wall. Great bar and coffee downst","useful":0,"cool":0},"SsQRrAHLVBIx4M7sBtYKtw":{"text":"The Ambassador is a pretty hotel made up of three old warehouses.  (\"Old\" will be a common","useful":1,"cool":1},"-WlZyEqP7gFbMx6YoLK1_g":{"text":"I would not recommend this place.  Service was mixed: the girls were apathetic and not hel","useful":1,"cool":0},"8JCaFvuxSMLAyx4DMe2law":{"text":"Amazing and charming hotel.  As a New Orleans native, I know the hotels in the city very w","useful":0,"cool":0},"Mgh6Uqzb9ub0I5r1VUwdIw":{"text":"The hotel was BEAUTIFUL with the hard wood flooring and exposed brick. Very churning and g","useful":0,"cool":1},"KQ1mOHy2rISvgwl2YwIZ-g":{"text":"Were it not for the staff at this hotel, I would have demanded a complete comp to my stay.","useful":0,"cool":0},"22hiKrXhFj-rQxAXTCNZGg":{"text":"We liked the look of the hotel on arrival, very cool, small lobby.  However, our room was ","useful":0,"cool":0},"rnMyPpJeV4cOtwhNf7BIog":{"text":"Can't believe this place only has a 3 star review! My girlfriends and I loved it! Super cu","useful":1,"cool":0},"h3W9DdEtnVFxB9zvpfGANA":{"text":"a dump.  this is the worst hotel i've EVER stayed at.  since it was one of the few rooms l","useful":0,"cool":0},"AUHKxyr1YkNd63mJvbby3w":{"text":"(Stayed 4/18-4/22. Room# 407)\n\nBased on all the recent reviews, we were so skeptical about","useful":5,"cool":0},"Bqcn36CByuXXA_YyaKVZAA":{"text":"For aesthetics purposes the hotel is absolutely adorable. It's got the open brick facade i","useful":0,"cool":1},"PiErbwLWpDxqXe1iSaQW4Q":{"text":"I normally don't write reviews, but since the staff went over and beyond to accommodate us","useful":2,"cool":0},"uJcAHBSOFUVaxtrp4o9btQ":{"text":"Location is great, as it is in the warehouse district, if you want to be away from the bus","useful":0,"cool":0},"Za7yyKY8-7wGi4nSL0vUsQ":{"text":"Check-in was pleasant. The outer appearance of the hotel was very nice. Location of the ho","useful":2,"cool":0},"okXJdkDGertwkI0RisLetQ":{"text":"It's being renovated but the rooms completed are amazing! The staff was really friendly an","useful":0,"cool":0},"NFbUSeAciMLjpMnE83jQ9Q":{"text":"Well, interesting hotel.  Converted warehouse.  My main trepidation was that exactly what ","useful":3,"cool":0},"kHLdkOhHdoNY91cImGNN_w":{"text":"Yes, we did stay in the Lafayette wing, and really don't know if there is different manage","useful":1,"cool":1},"BsVywXmUgYNgS-W4FauhlQ":{"text":"Beautiful Hotel. Simply Gorgeous! \nBooked the Premium Double Room. High ceilings, exposed ","useful":0,"cool":0},"76liPqwdA7dODr4SdGM4JA":{"text":"Nice looking hotel. The janitorial staff clearly takes pride in their care of the rooms. T","useful":0,"cool":0},"G2fgVfaqmNqBp-qBnPn7Ew":{"text":"Surprisingly comfy and updated...don't be surprised about how it looks on the outside. .bu","useful":0,"cool":0},"AfX5pIOqEJ1lc0UiDfQxVg":{"text":"Overall first room was horrible the tile in bathroom was broken almost fell out the shower","useful":0,"cool":0},"d-QphiuVM9y6H6ckKqt0qg":{"text":"Such a beautiful hotel with some sweet art installments throughout. Walking into the lobby","useful":2,"cool":1},"eVSgUEf-6_2EQI9FoROplw":{"text":"Let me start by saying the 2 stars were given only because the beds were comfortable and t","useful":2,"cool":0},"rHnEcPoBDbLRH8oQKxtBEg":{"text":"I was terrified after reading all the bad reviews on here but after staying at the Ambassa","useful":3,"cool":1},"fwDxs6-rh3KBWqGiXoMr1Q":{"text":"The best thing about this hotel is it's location.  Every other aspect needs improvement.  ","useful":1,"cool":0},"i-uoS_PueEqZEK5JBs8Qhg":{"text":"I'm surprised this hotel has such low reviews. Sure, it's not the Hilton.. but it's not Mo","useful":0,"cool":0},"RrNzxZiX___nLaqvd_gpDA":{"text":"I was very nervous because of the reviews, but am so glad we stayed here.  Yes, there was ","useful":0,"cool":0},"CGkiJ4KPUAL5WQzt3tyAPg":{"text":"A friend and I were very excited to stay at this hotel for St. Patricks day. It was a grea","useful":3,"cool":1},"mfsndRzna2Lth3MzsuhSSg":{"text":"If boutique means we are making the best of an old building, well they may have achieved t","useful":1,"cool":0},"ktPQBFCyFP4gekpGmzJgjQ":{"text":"The lobby is adorable. That's the best thing I can say about this dump. The light fixture ","useful":0,"cool":0},"hsM_kmkndjcD1RyZ6LVSUw":{"text":"The parking - $40 per day for valet, with no other options. This is fine, but is steep and","useful":0,"cool":0},"WdW-SR4MMKlCyEtcuP-pMg":{"text":"Staff were nice, but the room was noisy... something mechanical on the roof hummed all nig","useful":2,"cool":0},"dabiipH7CDwtWV54ZhMZPw":{"text":"Location is good--near several truly great restaurants and a block or two away from French","useful":0,"cool":0},"uoIvyKJS8gmh7kHz5vnRFA":{"text":"Loved our stay in the artsy, hip, cute hotel. Everything about it was amazing from the hos","useful":0,"cool":0},"iz41i4toiLKoV_azVIsndQ":{"text":"About the only good thing about this hotel is the location and the valet! Prob best and mo","useful":0,"cool":0},"kQ2TwEits1ABuYp8hd6GKA":{"text":"I found this hotel through a deal on a 3rd party website and prepaid for our stay prior to","useful":3,"cool":0},"sEJp81cpNdicpmNUwMcnSg":{"text":"The hotel was fine. and the Customer Service was good, the front desk staff was very nice.","useful":0,"cool":0},"nyY3olD382z9DI3i4MxbtQ":{"text":"Misleading, misleading, misleading! Stayed 5/7/15-5/10/15. We booked through Expedia and w","useful":7,"cool":1},"MQizoqQsjRI37rjGv6qm6Q":{"text":"Fun & a bit (too) funky\n\nSummary: The challenges of operating a hotel in New Orleans are m","useful":0,"cool":1},"hc5e7fbQAqXuoEgHkwNYjA":{"text":"It is painful but necessary to write a bad review of The No. 77.\nPainful because for three","useful":5,"cool":0},"MdrUEBMXZI7shLwOqxrqRw":{"text":"the bellhops were great, the hotel was decent, but dirty. the front desk staff was horrid.","useful":1,"cool":0},"7nb3Z3AU21BY0vCVe02_hQ":{"text":"I came to New Orleans in early August for a 9-1-1 industry convention (APCO) sort of at th","useful":0,"cool":0},"iiI36vM-4mMkgY_DfAa9sA":{"text":"Fits perfectly in NOLA.  Great lobby, comfortable to sit and chill or work at the long cha","useful":0,"cool":0},"pB-5VUYjWkAiNN_tYSuu8A":{"text":"Great hotel close to everything with amazing staff. Ray at the valet station was more than","useful":1,"cool":1},"iR4W36xE2Xu2Q22ZoVLx8w":{"text":"Has a good experience at this hotel on a Tuesday and Wednesday night. Bed was super comfor","useful":1,"cool":1},"P0lsu5Q8h1NJ4U95XyhjfA":{"text":"Mildew smell. Black hairs on my towels (I am blonde). Room was not clean when I checked in","useful":3,"cool":0},"cnySW-nq_YysL4-AIxDXjQ":{"text":"I am so amazed with this hotel. From the moment we arrived everything has been amazing. Th","useful":0,"cool":1},"_Moao34MBmGrEqKiEjVQsQ":{"text":"3 stars because it's fine for what it is, and you're not really in your room much anyways.","useful":2,"cool":1},"As_umNgWLost325p1icV0g":{"text":"My husband and I came here for a mini-honeymoon trip following our wedding. We found a dec","useful":0,"cool":0},"39Z4gkJL-Kdtm2GExVnmTw":{"text":"What this hotel lacks in basic hospitality practices, it makes up for in overall decor and","useful":1,"cool":1},"M81iCo5obo0GX58yWco0Hg":{"text":"DO NOT VALET YOUR CAR! this is my only complaint about the hotel. It literally took over a","useful":2,"cool":2},"lPSBhJPzex21mTNBG3UECQ":{"text":"This place is fabulous! My friends and I were trying to find a replacement hotel, as the o","useful":0,"cool":1},"PCSJ_BFMX3yNtbZ74wwb5A":{"text":"Don't stay here if you expect to get any sleep. The walls are so thin you're able to hear ","useful":0,"cool":0},"RWBj1PzspKYUEqE72iVc3w":{"text":"Fantastic vibe and customer service. They welcomed my pet as a vip member, even gave her a","useful":0,"cool":0},"GjIkGA0WgfxekiVSmEu-Sw":{"text":"Great place. Loved the room and public space. Easy pace. Staff all very friendly and helpf","useful":1,"cool":0},"Esmtt_Uen1WtTdG7oPZCBw":{"text":"My son jokes that I picked this hotel because I'm a hipster, he's probably right because I","useful":1,"cool":0},"feJGmsO-d5iZSG7xJ7oK8Q":{"text":"Nice enough staff and great location but there might as not be walls. You can hear everyth","useful":0,"cool":0},"ARME1MixKpdUJ0z6wZ9gIQ":{"text":"We spent our first night at the Hampton by Hilton and it was not a good experience. Needle","useful":0,"cool":0},"Wv2I9gtWaifetoCmaREadQ":{"text":"We loved the hotel, the staff incredible; thanks Patrick and Joshua for being so nice with","useful":0,"cool":0},"S6DLufnxX0UvNN-B_LhxqQ":{"text":"The restaurant is excellent,  but the hotel doesn't come close.  Our hotel room was suppos","useful":0,"cool":0},"BYA5VZ9ONciLbRpjaOGWag":{"text":"We knew the place was a bit eclectic but it wasn't at all what we expected. The first desk","useful":0,"cool":0},"k4Fn1kQ2HeP7FfEcEYhklA":{"text":"We stayed here Monday -Thursday. We were in a rush checking out and left a few things behi","useful":2,"cool":0},"YuATW4khan37_t6VyM0ccw":{"text":"A friend recently stayed there and entrusted the front desk with a gift for me. I wasn't a","useful":2,"cool":0},"f-rHrh66K7YXAmfCIlkJcw":{"text":"Pretty awful hotel. My bf booked this hotel on booking.com based on it having the lowest p","useful":2,"cool":0},"GcmK3ATAfAHATrMhi0qsAw":{"text":"The hotel is adorable, the bed is comfy, and the room is big. However, it's extraordinaril","useful":1,"cool":0},"s767qsGOnpyTOrI8ZS-RNg":{"text":"The most beautiful and unique hotel I've ever experienced. Super friendly, within walking ","useful":0,"cool":0},"mQFRRh8s33PaDUnrC2NH5Q":{"text":"Very disappointed!!! We were so looking forward to staying in this beautifully decorated a","useful":0,"cool":0},"S4rszY7U3u5GvgLkJ1AdLw":{"text":"First off, I am never moved to write reviews. I typically let a lot of stuff slide, but th","useful":0,"cool":0},"wZa-19aW61Fs0oY9CmQDJQ":{"text":"Finding the words to describe how amazing this place truly is hard. From the first day we ","useful":2,"cool":0},"fFGfcDdhhgWqlk7IAEEHtw":{"text":"Oh my goodness!  I made a reservation at this place, then when I received an email telling","useful":0,"cool":0},"ewSGivzXcPUMoyl8wrlVqQ":{"text":"I couldn't be happier! This is a gorgeous hotel at a great price and in walking distance t","useful":0,"cool":0},"zS1hvaLoYE-IbHoXDfVsnQ":{"text":"Review breakfast only - As a local, I was so excited to see avocado toast on the menu. It'","useful":1,"cool":1},"bO35qgjl8hgRiN05drHoBQ":{"text":"It's our 10 year wedding anniversary. We have stayed in 4-5 star New Orleans hotels on mul","useful":4,"cool":0},"9UkolnfxoJMCqp6-OUbN0Q":{"text":"PROS\n - Room was very cute and had a good clean rustic feel\n - Restaurant serves excellent","useful":2,"cool":0},"Ive1ahLpz-gVrN-5j9JT9g":{"text":"Absolutely gorgeous old hotel. One of the funkiest and coolest hotels I've ever stayed in.","useful":0,"cool":0},"8GtpdR5PM4ni7gts29aL-g":{"text":"Great hotel. The decor is rustic but updated. The staff was very friendly and accommodatin","useful":0,"cool":0},"450KA4DcqJACrUrVAoapvA":{"text":"Joey the bartender is an absolute master craftsman!  Tell him what you like and he will kn","useful":0,"cool":0},"4Z0LSvc2xeO7WgMqWTb-qg":{"text":"I stayed here for 2 nights on a business trip. I felt that the ambience and location was n","useful":3,"cool":0},"9l_yP3vdDt4w78dwyBi5JA":{"text":"In sum: COMPLETELY AND UTTERLY RUNDOWN.\n\nHow much of a disappointment is our stay turning ","useful":7,"cool":0},"GGxF60rvqCL4cppWrHDKww":{"text":"My feelings explained in a letter to management: \n\nI was recently a guest at the Ambassado","useful":1,"cool":0},"WvB5lty22MEyh3PpwGBbWQ":{"text":"Older hotel with lots of charm, creaky floors and thin walls.   Clean and spacious room. W","useful":0,"cool":0},"uVIZtgPkDXkgsF_BEkfdgw":{"text":"I am not sure why this hotel has received so many negative reviews. I stayed here for two ","useful":3,"cool":0},"X3VpAw6AuPnCW-s3fz-5pA":{"text":"Bed is very comfortable and the water pressure is good. 2 very important things. Noisy... ","useful":0,"cool":0},"1jinscEGahbRTSYvy7bPSA":{"text":"We never stayed here before but got a great last minute deal through hotels.com. Turns out","useful":0,"cool":0},"MRTolXi9jdffrHHy3iGEbg":{"text":"Just spent 3 nights here 5/15-18. Loved the location, loved the service. Mostly loved the ","useful":0,"cool":0},"6PVDTHmJ3GKpRT01RAPxMQ":{"text":"I've stayed in this hotel on two separate occasions. I guess they qualify as a boutique ho","useful":8,"cool":7},"27EtoTrJw0UfnfLp4tWHFQ":{"text":"I have mixed feelings about the old 77. I stayed here for four nights during a large confe","useful":4,"cool":1},"4_2KX0W66qMKyFeShj2i6g":{"text":"A bad joke this hotel. Long check in time. No cleaning first day. Deluxe room without wind","useful":0,"cool":0},"WvKJXGTMztHrBXsGBTThWg":{"text":"This place is super cute, down to the graphic design on the laundry bag. Kind of reminds m","useful":4,"cool":2},"-nZzfCmR_WN2K7d5jF8uUg":{"text":"I never, ever, ever write reviews, but this hotel is definitely one of the worst I've ever","useful":3,"cool":0},"h3PYJ7WHkYrsu72Edsi32A":{"text":"Had a great experience this past weekend at the new renovated hotel. Our check in wasn't u","useful":1,"cool":0},"owX9hLgYbtkp_8WrhJPy6w":{"text":"The location and ambiance draw you in, the service leaves you running for the door, in wha","useful":1,"cool":0},"bQCswvPBS5VqLy3MjBUDog":{"text":"Totally get why people rate it three stars. It's super cool vibe and I love it for that. T","useful":3,"cool":0},"XEr6oLTU2hBU9kWa_NWXsQ":{"text":"By their own self-description they are the \"best boutique hotel in New Orleans,\" and their","useful":0,"cool":0},"qlflBX6GyyjFBY_eRezLWg":{"text":"A sincere thank you to the new bar manager at the Old No 77 Hotel who showed us TRUE South","useful":1,"cool":0},"lo_rMkwbMBlr3o3LJxNH1w":{"text":"Spent three nights here, the price is right close to what we wanted to see and still close","useful":0,"cool":0},"IFI948KF9Ct-V7tYutWi8A":{"text":"The wood floors are nice, but having people above you with wood floors not so much.  It is","useful":0,"cool":0},"wDyHg2y42YK3fRU39oqOrw":{"text":"Great hipster hotel with wonderful decor and ambiance. Parking is outrageously expensive e","useful":0,"cool":0},"_Ej81Fwxa3FRAFDoZ6dz9A":{"text":"Enjoyed my stay, very hip & Modern Hotel, loved the art works in the rooms, very helpful s","useful":1,"cool":0},"ZEwfheLzNHXAn8n8zU9-xg":{"text":"I read all the pervious reviews about this place and it was hit and miss, so I figured why","useful":4,"cool":0},"3rIFDvb3Qi3P16Lp88zxKg":{"text":"My boyfriend and I stayed here for 3 nights and LOVED it! It is in a great location! We wa","useful":0,"cool":0},"X-Q35rqrRXlUukDrkq7C0A":{"text":"The Ambassador is about 2 miles from the convention center, so it's an easy walk. However,","useful":0,"cool":0},"-tvlbyUehg-hKxTj7C44kA":{"text":"Could be great if they could get their act together.\n\nFamily stayed here for a week in two","useful":0,"cool":1},"jT9sP4OYcvEBlxVGFoPl-A":{"text":"This hotel was so terrible it was comical. The lobby is beautiful and the building has ton","useful":0,"cool":0},"5Tp3Mt1MtfrqwROiXDVdqQ":{"text":"Just stayed at the Ambassador Hotel for four nights during Mardi Gras before boarding a cr","useful":0,"cool":0},"i6oF8Z4Yv8uJSYIJcJYfTQ":{"text":"During our three night road trip, we had stayed in a Motel 8 and a bluegrass band's tour b","useful":2,"cool":2},"iskXB_4fe1QFupXQZ532yg":{"text":"Solid three stars. Nothing more. Nothing less. The hotel lobby is beautiful and the restau","useful":15,"cool":4},"TS_U2RZgO6QuwqNoDbUZjA":{"text":"The Ambassador rates the worst criticism possible: it has bad customer service.  The attit","useful":1,"cool":0},"kIUnKhj4S28hR_bgPtUvOQ":{"text":"I've never been so angry.\n\nSo, we were part of a wedding party. Were supposed to have thre","useful":1,"cool":0},"2C2azynT7-t-dYz0Vjpw0A":{"text":"I recently stayed here for four nights with a buddy of mine while we attended a convention","useful":3,"cool":0},"Qx7xszfZnvIUA_FQlwa4cA":{"text":"First off, the hotel is absolutely beautiful and in an amazing location which breaks my he","useful":1,"cool":0},"fLwLWUKpE0nL5FQCDRAySA":{"text":"The customer service is beyond what I have ever experienced.\n\nThey value their clients.  I","useful":0,"cool":0},"VaHujmWp3OmQaOgHgmvgyQ":{"text":"this hotel is SO nice. we happened to come by a really great deal through a 3rd party webs","useful":0,"cool":0},"YWz2IBDrfwkrs9WIHbOmmw":{"text":"Ok let me start by saying I don't give five star reviews for anything but I can about my e","useful":0,"cool":0},"BpqCUOzUjE6AhwVtiYvBzw":{"text":"This place was super disappointing. The downstairs is beautiful, and the food and coffee i","useful":2,"cool":1},"LuXqXc07WWh2av9nVomQ0Q":{"text":"I stayed here a couple different nights. Huge shower with green tea shampoo and shower gel","useful":0,"cool":0},"crEO03ldl3WnavMFMJ66Fg":{"text":"Loved this hotel! I've visited New Orleans many times, first time to stay multiple nights,","useful":0,"cool":0},"0vOppYZ-Uf5HfEAvjd5AmQ":{"text":"After we booked, I was worried because we saw so many negative reviews. However, our stay ","useful":1,"cool":1},"9MIxXqpKtsnIvXtn9J8QeQ":{"text":"Loved this place which is a conveniently located approximately with a 10 minute walk to th","useful":0,"cool":0},"9k9b9EXvvM4BO5IjVbfRjw":{"text":"I had a comfortable and easy stay with the Old No. 77 for the WEFTEC conference. However, ","useful":0,"cool":0},"iN-fEmtHcCnV5ZG9gZ2m-A":{"text":"Scammers - go elsewhere in this beautiful city. My husband and I got kicked of our reserva","useful":0,"cool":0},"TAg0wXPFUx-FYFumTiL6Mg":{"text":"Room was decent enough but the renovations and incessant fire alarm going off didn't make ","useful":1,"cool":0},"E-tF6cg3jsc9AGQPP4xYag":{"text":"No  coffee in the room? First hotel in the history of hotels  that doesnt have coffee in t","useful":0,"cool":0},"EcKNP-zkl5oj1LbqN9HF7A":{"text":"Do not stay here!!! This is the worst hotel i have ever stayed. I choose this hotel becaus","useful":1,"cool":0},"WrLe6WmOmLCSg2Ess8veLw":{"text":"I will never, ever stay at the Ambassador again. Between their rude staff, lies on the int","useful":1,"cool":1},"0EhLrqt8ekVZA-InlJOtqQ":{"text":"This place does not meet the standards for service. From the doorman, front desk and coffe","useful":0,"cool":0},"PI9W4OOsfHQrEhZTKQWaDw":{"text":"Thinking this could be the hip hotel for you? Pro tip - stay at The Ace instead. They've g","useful":4,"cool":0},"Np9asI-fFTxrF1tRz2RlOg":{"text":"Once, I stayed in a murder motel in East Nowhere, Texas. I rang the bell, waited a couple ","useful":1,"cool":1},"eBp_LXO9pExEpB0Of0tWZg":{"text":"LOVED THIS PLACE! We will be coming back! Like walking into a restoration hardware store (","useful":1,"cool":0},"Jg8JbiGNYnDsMrKbMtoDRQ":{"text":"Interesting boutique hotel in a convenient location. Lots of character and detail in the r","useful":2,"cool":0},"rCd60HFYL9qlqSOIqsVJoQ":{"text":"This hotel is a great place to stay. Loved the feel of the place with exposed brick and hi","useful":0,"cool":0},"D-wbsS0M5NRhAJ7JlvbACw":{"text":"Amazing Hotel! clean/beautiful/ pleasant staff\n\nA walk away from Bourbon street. \n\nAmazing","useful":2,"cool":2},"7KQW6EEz-noR4RtkTg0I5w":{"text":"I really loved this place.  I was worried after reading some of the really nasty reviews b","useful":0,"cool":0},"Dpx0W1Wpwu54yH2C0xGU9w":{"text":"The lobby & bar downstairs are gorgeous. The service was courteous & friendly. The fees th","useful":0,"cool":1},"z3JhZaii97qBGC5Opz7ULA":{"text":"Booked with this hotel as part of a southwest vacation. First do not ever use them or this","useful":0,"cool":0},"iShvIR2qlANc_08XILU9ug":{"text":"Soooo.... I wish I could give a 1 1/2 a star. So arriving in New Orleans for the Essence f","useful":0,"cool":0},"IjskHOaHL3MUoeSsZya_Rg":{"text":"The remodel and new operators are 1st class.\nI had a problem with my room, instead of argu","useful":0,"cool":0},"lJ5KN8w8XJo9Nv3hzGu8Wg":{"text":"1 star for location and original Retro/Modern brick rooms. \nThat is IT for the positive si","useful":3,"cool":0},"1XyZANm8OLK6zwv2MqfWaw":{"text":"Hotel was nice,good location,old building with old smell to it,the bad part was the old sl","useful":0,"cool":0},"s55OZTLFElt65GJNWknyFw":{"text":"Staff here were so polite and helpful. The lobby is beautiful but I'd say the rooms are a ","useful":0,"cool":1},"uaCRN2L6_0uew1zi0acVfA":{"text":"I love to stay at boutique hotels when I travel, because the good ones provide customized ","useful":0,"cool":0},"NvmvgG5MUHhwn4VRTidt7A":{"text":"This hotel can not possibly pass fire codes. Our room has one window barely one foot by on","useful":0,"cool":0},"wrGp4boDgLZhotYLb7bvMw":{"text":"Ok, so the website made it look fun and it had character. The parking attendants were the ","useful":3,"cool":0},"_RfAWlVaorlZKC9VOwacIQ":{"text":"Yeah, I had a 5 star experience at this place until they started screwing with my money. I","useful":3,"cool":1},"4tE7-s6jUcMq7Hd4NNSXFQ":{"text":"Beautiful, stunning architecture, great food and amazingly helpful staff!\nMy girl-friend a","useful":1,"cool":0},"V8h1YhtmMiAwdGRpy-4QSQ":{"text":"This place has ambiance but isn't worth the downside. It is loud, both from the bar next d","useful":0,"cool":0},"-zs4NZ0IhJsNeiJtZiCRnQ":{"text":"This hotel is horrible. The lobby is dark and the bar isn't open at 6:15 pm. The room is d","useful":0,"cool":0},"D89jkU1L4BmO70zrnpsXFA":{"text":"I was reading some of the reviews prior to writing mine and have to say that I have enjoye","useful":1,"cool":1},"UDi5m9IJg-Sz5lbRbSkJeQ":{"text":"I love this hotel.  From the IG worthy decor to the great coffee and food on premises to t","useful":0,"cool":0},"8-LT9RArAXWylBGCHpsOfQ":{"text":"Worst experience ever!  If you want a small room where you can hear everything from all ro","useful":2,"cool":0},"1akNq4S4VG10-OIZq5darA":{"text":"Meh.. it was okay. No refrigerator in room unless you pay for it. Of course parking is $30","useful":0,"cool":0},"7j1nRi4vw_8Db83MMryrnw":{"text":"The hotel was amazingly dog friendly and accommodating to my dog's needs.  I felt like a v","useful":0,"cool":0},"j-I5dtdu745VLnD-pr-WLQ":{"text":"I can't even begin to describe how amazing our stay was. From check in to check out the st","useful":0,"cool":0},"6D-wFBiC4UCN2KJ_i3URFw":{"text":"I don't usually write reviews, but I felt I had to for this place. I've stayed in several ","useful":0,"cool":0},"Do9ECq7mKrFFqd94J4_Uzw":{"text":"The restaurant is great; but this review isn't for the restaurant.\n\nOur room was marginall","useful":2,"cool":0},"Bql7zvKStyAXWXvLgpJaAw":{"text":"This is an historic hotel in the warehouse district in an outstanding location. However th","useful":0,"cool":0},"MoWodMZQSFCIPsPR0y3VvA":{"text":"My wife and I stayed here during a slow week after the New Year. Check was fast and easy. ","useful":1,"cool":0},"00emQ-jB3JmM8Pz3NjNz1w":{"text":"I enjoyed the stay. Rooms are modern yet the place is historical. Our room has an old time","useful":1,"cool":1},"dCaRPTUJpgLcU31mJ2_35w":{"text":"Where to start. My sister booked this room and did not look on yelp first. This hotel look","useful":1,"cool":0},"1K2R_GkGsxwkpmUGTG5dLg":{"text":"We originally got a room that was not very clean. Sticky floors (so sticky we had to wipe ","useful":0,"cool":0},"KpKr0HPEYSwmG8mi7ms5Cg":{"text":"Worst experience I've had with a hotel so far. Brittney at the front desk could not be les","useful":0,"cool":0},"09xhqrvAKcpZE69Z2rDL7w":{"text":"I'm going with 3 stars based on my own experience and the collective experience of my coll","useful":4,"cool":3},"5IjAdugoThFs_zexw17jiQ":{"text":"Awesome hotel and great location! Stayed here for a trade show at the convention center, t","useful":1,"cool":1},"AFwk19wBbt9uf45YqFFJyA":{"text":"We were very disappointed with the hotel.  I wish I had read all the reviews before bookin","useful":0,"cool":0},"pU3wostAG5BQWabQYKOu-w":{"text":"So my actual stay here was ok. \nThe issue was the next morning. When I paid for parking th","useful":4,"cool":0},"ytAjDwUegJ_eQeR-yO03oA":{"text":"UPDATE: TIME HAS TEMPERED ME AND I'M STILL NOT IMPRESSED BUT I NO LONGER AM UPSET. \n\nOmg! ","useful":15,"cool":12},"CaaB3dFIZq6jyRoJKrViuQ":{"text":"I enjoyed everything about this hotel except for some significant noise issues. As other r","useful":0,"cool":0},"BemgSPHYbbZI8LlLh-d9cw":{"text":"Great hotel!!!! Front desk was so friendly and quick with our check in! I highly recommend","useful":0,"cool":0},"uNAyf6QW-qCgpLa4iRdD5A":{"text":"Hotel with nice accommodations and clean! Street rooms can be noisy. Coffee bar and restau","useful":1,"cool":0},"r2iLpd9LAk5imDohe2jrSA":{"text":"My husband and I stayed here for our 10th wedding anniversary recently. We read some of th","useful":4,"cool":2},"db4y9OxZIS8J0fixw2eRZw":{"text":"Did you watch American Horror Story: Hotel? That. This. I was already apprehensive about s","useful":34,"cool":11},"2DKCXtR15wpSw415GiKEqA":{"text":"Was in town for a conference and stayed here for an overnight. My flight got in super earl","useful":0,"cool":1},"FozxVMb82W2tG9NZi4QvEQ":{"text":"This hotel is a joke! If you're looking for a place to get a good rest, this isn't the pla","useful":0,"cool":0},"fQEgjgf16LQ5Et2n5ni8xw":{"text":"I really enjoyed my stay at this historic hotel during '06 Jazz Fest. It was a perfect loc","useful":0,"cool":1},"3iAEPCG5FuUMP0DHafmi2A":{"text":"We stayed at this hotel for 4 nights last week. We were checked in pretty quickly and like","useful":1,"cool":0},"IBahSZdF5bQMrEkhvMRnOA":{"text":"This place is weird. My impression is that everyone working here is too young to know what","useful":0,"cool":0},"YucWY0RATdp1XNl5dBOa8g":{"text":"We may have had a paranormal experience here.\n\nBut before I explain that in detail, let's ","useful":2,"cool":4},"D3BHOASRhWvuGYV3ajyNqw":{"text":"I needed a place to stay for a work convention that was going on, but I wanted a place tha","useful":3,"cool":2},"sIUkMCUoUFjaLDYmixpSVg":{"text":"Amazing place I think I had the best sleep I have ever had in my life. I will be back agai","useful":0,"cool":0},"_DABu2lJ4-iTZzjv-_SA0A":{"text":"Never stayed here before so I didn't know what to expect, not a huge NOLA fan because ever","useful":1,"cool":0},"iNRRmDJegt9T0ZgdCD6w7A":{"text":"Was in town for a pharmacy convention and decided on this hotel. The hotel staff was very ","useful":3,"cool":0},"wxYE4qnrA4Zpf4IoWNCBOA":{"text":"Oh. Wow. When we checked in I was horrified. I think a great word for this hotel is false ","useful":0,"cool":0},"H7zC3uwqXEu4ZDinuG_rXQ":{"text":"Aesthetics were lovely and bar makes a quality cocktail, however you do not want to spend ","useful":0,"cool":0},"_caU_S15RcLFR9cwmx84GA":{"text":"My husband and I haven't been away on a vacation in years and I surprised him with a trip ","useful":0,"cool":0},"RsSDVsVmyFDSrCgbNLLt5w":{"text":"Hmm... The Old No 77 was just ok to me. I love the aesthetic of the lobby and the art gall","useful":4,"cool":1},"AyOZCALjVLjCUFsRQT2JUw":{"text":"A cute hotel with a lot of problems.\n\nThis place looks cute on the outside.  It's convenie","useful":4,"cool":0},"klmWevwKgU7upOHvROc1Lg":{"text":"My friend and I stayed here during the Essence Festival weekend. Although my experience wa","useful":0,"cool":0},"DQn9tuZOPpFynHlK7hUrNw":{"text":"It's been 3 weeks since my visit and I can't stop thinking about this place.  I miss it an","useful":2,"cool":1},"vEXqjyM3Z-743cxfGHt0Ow":{"text":"Ug - this is one of my favorite places to stay, but it might have run its course. \n\nThe no","useful":1,"cool":0},"qRYepRug7tgtSi0UzzDbGg":{"text":"I must admit, I have not had the pleasure of staying at this hotel. However, I visit it ea","useful":2,"cool":0},"gDw0AIFzu7qHFNBHHlw0yQ":{"text":"This hotel is so amazing in almost every way - amazing staff, great atmosphere, beautiful ","useful":0,"cool":0},"nUj41JOc23yx4xJL48Yi5w":{"text":"Do NOT stay at this hotel. Hidden fees are ridiculous. Items stolen from the room. Zero he","useful":0,"cool":0},"ihGNbGFS9JH1fE7lnRcckg":{"text":"Short story: I will not be recommending anyone to stay here. There are great hotels in thi","useful":7,"cool":1},"PPjotdrxr7lPzIwQX2hgzg":{"text":"Ridiculously PERFECT hotel! Restoration Hardware-themed decor, easy 10 minute walk to the ","useful":1,"cool":1},"bUIEdWLMRZPD332uVW1YkA":{"text":"I genuinely enjoyed our stay at this hotel. Our experience was pleasant from the beginning","useful":4,"cool":1},"14hHqwWrnz2TKk6vEG9i4A":{"text":"In New orleans on business, and this is a wonderful place to stay!! Very quick and friendl","useful":0,"cool":0},"pvBZGAf0UEnzme3OkS-4fg":{"text":"Room looked nice. Needed coffee but did not see any in room. Went to front desk and asked ","useful":0,"cool":0},"Oyb101VbvGY86CZrmCdaRw":{"text":"Do not consider this hotel unless you like staying in a dark, cramped room. Bathroom is sm","useful":3,"cool":0},"jiYq6MCGmbXhVpu7JbNlCQ":{"text":"Booked the room with no windows. We didn't mind a bit sleeping in! The vintage/ speakeasy/","useful":2,"cool":1},"lua_nKF0KE4jLtrplyyeAw":{"text":"If I could give this place a zero it would be too high! When checking in it looks like a n","useful":1,"cool":0},"fKcN3hn942wZ0Q9pa4bIqw":{"text":"We are still in the midst of a horrible stay at this hotel. We arrived early for check in ","useful":0,"cool":0},"6X7T5L-NYvcHa_7NLm5ftg":{"text":"The most disgusting stay I ever experienced! Yes the decor was unique and different. I was","useful":4,"cool":0},"9HyRPX50fDGnTDceyWIt2Q":{"text":"This place was not worth my $100 the room was dirty we found hair and a toe nail on the si","useful":1,"cool":0},"OPZPye34Po2Sb2fkNhVxwA":{"text":"The place is absolutely amazing! They are pet friendly and so nice the entire staff was wo","useful":0,"cool":0},"2FulT_2y5vJAcVGgCtssiA":{"text":"This is the worst hotel I have ever stayed in. It's dirty, it's loud, it smells bad and it","useful":5,"cool":1},"962PrkWoT6L2SUyNknq8tQ":{"text":"Don't stay here. When people say the building and floors are old and loud, it's serious. Y","useful":1,"cool":0},"aEjDu7U1UC--RmMZaUk73g":{"text":"This hotel makes my soul itch!  Being downtown, you will have to pay for several amenities","useful":14,"cool":10},"lPzrC2KuDVwJjA_sfj2MZA":{"text":"I had the opportunity to stay at the Ambassador Hotel in New Orleans and had a lovely time","useful":1,"cool":0},"gLz0wMzcTmc4y0SCXRWDFQ":{"text":"DO NOT STAY HERE!! \n\nThis hotel is a joke. We left after the first night & HAPPILY paid mo","useful":1,"cool":0},"Nm5RhUbZS3zoaTG4m201ow":{"text":"I stayed here recently during my destination wedding in Nola. Since it was our wedding we ","useful":0,"cool":0},"ZmdncdRtn6QRMRArhwvx9g":{"text":"To call it a boutique hotel is a joke.there is nothing in that place cant even get a cup o","useful":0,"cool":0},"n2XtX3pmr5HS2woNL6PdKQ":{"text":"Bar far my favorite New Orleans hotel. Staff is exceptional, rooms are beautiful, and the ","useful":0,"cool":0},"bP3R_h14BvhCLFR7Nrr1AQ":{"text":"I stayed here awhile ago for a pharmacy convention. I stayed in 2 different rooms for abou","useful":1,"cool":0},"-tx4KQU8WvC3uiAk_V28rA":{"text":"This was my 3rd stay at this hotel and each time my star rating has gone down dramatically","useful":0,"cool":0},"v3gqye5_6QD3vUa9BOU-Ig":{"text":"I am currently staying here for 4 nights and I regret my decision. This is unfortunate bec","useful":0,"cool":0},"py5cANyJUNSQzIZpSBxpvg":{"text":"Writing this as we relax at the Old 77 - I am surprised there are so many negative reviews","useful":3,"cool":0},"PuGV2fLl8Z4jdBptVDhgOA":{"text":"Nope! I don't recommend this place. Filthy, dark, and it smells really bad. Don't do it...","useful":0,"cool":0},"YUV3Hi-p8Ck5W1cxnXisxQ":{"text":"My husband and I stayed for a weekend in July...loved it! The front desk was not very frie","useful":0,"cool":0},"toX2vCq6DS83nUF3rT89VQ":{"text":"The Old No. 77 Hotel and Chandlery is a great place to stay!  The staff is outstanding and","useful":0,"cool":0},"A6wCzeWC5iuo7FR1y69Gug":{"text":"I had a great experience here! This place was newly renovated and name changed. Don't know","useful":2,"cool":1},"2lro2YgsoOE7inYUkV0yYw":{"text":"horrible.  First the good news....  decent location, nice staff at the front dest.  That's","useful":2,"cool":0},"0q6XuCyMavBz2Hkr-XYPuw":{"text":"So not impressed with this hotel and I had such high expectations because the aesthetics a","useful":0,"cool":0},"eNPNjDQ2RR5jtlJ-Ep-LyA":{"text":"Best tip: don't stay here.\n\nrooms are filthy, floors are sticky, bathrooms dingy, fabrics ","useful":2,"cool":0},"jhcYhTsw0NHRzq03tTw7Ew":{"text":"The only star is for the doormen. They are so polite that if it wasn't for them, this plac","useful":6,"cool":2},"vy97Wad1CZJ1iVzCd8fMeg":{"text":"Very \"hipster/instagram/trendy\". Decor is beautiful and check in was quick. Be prepared to","useful":1,"cool":1},"kpRLnDVcxcSD9YTYvsTHEg":{"text":"OK here we go with one of my hotel reviews....I've stayed here several times before I was ","useful":9,"cool":3},"bwxSVsn5cy1SOYzdMvoqAQ":{"text":"2.5 stars. Really waffled between doing 2 or 3 (and as I write this waiting in a line with","useful":4,"cool":0},"wxXDGKZgS7DpHHxtkzQuqA":{"text":"Found a Priceline deal on this hotel and since I was only staying one night I thought it w","useful":3,"cool":0},"grGkPvBbvsMIRlkDhKHAhA":{"text":"I am having trouble deciding between three and four stars, so I will round up. If you are ","useful":1,"cool":0},"EY_yHLsHt7hIKvG4ZdXAug":{"text":"Cool hotel booked through Groupon (a first but also a good experience). It's just close an","useful":1,"cool":0},"GmnLrrLJFBkLIi4PkiILRg":{"text":"I stayed here for about 3 days this past summer. It definitely wasn't my first choice. Onc","useful":4,"cool":1},"P2FsHYaenAnGZMwVtq9r-g":{"text":"There's so much about this hotel that's great. In fact, it ticks all of the boxes for me.\n","useful":24,"cool":22},"zPLW6Q0849sFjahr_XhWRw":{"text":"Decided to try this hotel due to 1: getting a good deal 2: pictures featured online seemed","useful":2,"cool":0},"ClNj3oQoAc8e9_RarHyIow":{"text":"I think my friends had some mixed experiences here but just based on my own time spent at ","useful":5,"cool":4},"Rlim1KR49jPq7YOzXPTaVg":{"text":"I will be fair. The rooms and hotel looks great. Classic New Orleans vibe and a great plac","useful":0,"cool":0}}