{"VwZtabnkuSjWvFixsA151Q":{"text":"I could smell the food from the parking lot so I was anxious to eat only to be greeted by ","useful":8,"cool":1},"ijHW7OO1we-c8cMg4OTptQ":{"text":"Dooky Chase's Restaurant is one of the true classic New Orleans restaurants that stands up","useful":0,"cool":0},"kQbWuSvDv9Vz-_yM-lhs8A":{"text":"My party of three were all surprised by the lovely dining area.  Our servers were all very","useful":0,"cool":0},"iEvN-sJuB3YBTcIod-DaIA":{"text":"Seems like people who are leaving the bad reviews are people who opted for the buffet. Don","useful":1,"cool":0},"TQaoKtWwv1rECGWWgHyDFg":{"text":"This place is overated. The food was just ok. And the waitress with the short untamed red/","useful":0,"cool":0},"8MrXAhYGh15nQdBjw4fmew":{"text":"My husband and I were excited to try this place like everyone else from hearing awesome co","useful":2,"cool":1},"VRy3JFZsXwb8sm8s5R8J4w":{"text":"Very slow, rude waitress and mediocre food. The food itself wasn't awful, it just took too","useful":0,"cool":0},"j3npxWJakRxu-gtV9lfepg":{"text":"Overall great food-best Mac and cheese EVER! Good solid fried chicken. Was not a big fan o","useful":0,"cool":0},"nBk1LPty3pEMQi_PLVumiA":{"text":"I'm trying to not destroy this place bc I love my ppl and I really believe in supporting b","useful":1,"cool":0},"7eLn-LUNWiL92sELsdvs2A":{"text":"If you have ever watched Doctor Who, Dooky Chase is like walking into the Tardis. The neig","useful":4,"cool":0},"9mxyC6vbawlfHynzuj_VYQ":{"text":"It pains me to do this but I don't know what went wrong this time because the food was not","useful":6,"cool":1},"eZWfOT43WcmOipIpbTCUiA":{"text":"What a disappointing experience at the restaurant on Orleans Ave.  We were told that we \"m","useful":1,"cool":0},"2MBBdGvlKsAoTM0MHMcBhw":{"text":"Wow. \n\nI'll say it again louder for those in the back.\n\nWOW!!!\n\nWhy this place has some lo","useful":2,"cool":1},"swYyIx1yIM81eBirhl9LpQ":{"text":"An iconic chef and culture bearer, Leah Chase, is at the helm here. The dining room exudes","useful":3,"cool":1},"uxgO3Vqzo8ole5O01vqz_Q":{"text":"worst dining experience ever. not exaggerating. Severely short staffed, sat for 30 min bef","useful":2,"cool":0},"vCAYZNb03jG6pZNdFQoAgA":{"text":"The chicken is okay. It's juicy and the flavor is all there but the menu is simple. Coming","useful":0,"cool":0},"Qd7O2FZkFYT5Zq6Cck3YXg":{"text":"Great lunch buffet and fantastic chicken!!!! Also the best red beans I have every had!!!  ","useful":0,"cool":0},"TnEhPJ4uUAAHiZI8vKjnSA":{"text":"We went for the lunch buffet. Slow service, over-cooked food. Fried chicken was just OK. H","useful":2,"cool":0},"QkcGUxrGSJO83mcdJn9OVg":{"text":"If you ever wanted to taste the soul of New Orleans then search no more   Dooky Chase is t","useful":2,"cool":0},"MV3UfyOCpMmrI8HiZRYPxg":{"text":"We made reservations for a party of about 20 for a Friday night and were seated in the bac","useful":0,"cool":0},"zRgfUT4v1hCjfFrkAraSNQ":{"text":"Dooky Chase is a restaurant that I would not have otherwise visited if I had not visited i","useful":1,"cool":1},"m8IijPD9yO2AgnyjxRn3Dw":{"text":"We went here around 2:00 & waited about 40 mins to be seated. All around the food was okay","useful":0,"cool":0},"-Bmw83PQaby1QcePWLxUpA":{"text":"This year, NOLA has redeemed itself with me, cuisine-ly (new word, get hip to it!).\n\nDooky","useful":3,"cool":0},"pWHQrjIJGcrFCZqXSNjgHw":{"text":"Ok the friend chicken was excellent some of the best I've had. The gumbo was good as well.","useful":0,"cool":0},"rMm1NWFCpFQRJeGsC19VTg":{"text":"Came here because I saw a Bon Appetite video on fave book.   \n\nWe arrived 15min before the","useful":0,"cool":0},"_yUzHFrvZgUSfS0cWl7dBQ":{"text":"The crab soup was the only thing that was good. Waited over 45 minutes for my food (fried ","useful":0,"cool":0},"4aswFvsdHHB_HicdAbh8pA":{"text":"After waiting for at least ten minutes to be acknowledged, we were directed to a table.  T","useful":0,"cool":0},"8gXYGYybRFfpweUgqgjfpQ":{"text":"The best thing that I ate here. Was the fried catfish and the gumbo. The buffet was quite ","useful":0,"cool":0},"K8p7oa-MvZirAFmzXvrP5w":{"text":"A local relative of my wife joined us to check out this famous restaurant in Tremé. I was ","useful":4,"cool":2},"prS-fp-E_kTCyj79qawscg":{"text":"The food and staff was awesome!  Nice ambiance fitting to the New Orleans style! Dress is ","useful":0,"cool":0},"vaBVfgNrxI8RlAzRiWapIw":{"text":"My sister and I ate here in 2008 when we attended the Essence Music Festival.  The service","useful":0,"cool":0},"oBZpO9mZL5ybkhBiYDOAWg":{"text":"Waited @2 hours for mediocore food. Had to wait ab addirinal 20 minutes for the staff to r","useful":0,"cool":0},"dp3d5Uuxg1th-jj8ObOq1Q":{"text":"Pros: The food is phenomenal. Period. I am still dreaming about the fried chicken I ate he","useful":3,"cool":0},"3tvBXS-bbQ_h2ssGCy7nag":{"text":"We came here not knowing what to expect as it was recommended by someone. Definitely get t","useful":0,"cool":0},"_MdbOZTDVgqYhmYJFY2vBw":{"text":"Flew into NOLA for the weekend & was very happy to find Dooky's open for dinner.  Dropped ","useful":1,"cool":1},"huaEsovFQSgSmNyswUzHXQ":{"text":"We had reservations on a Friday night with a group of friends.  Service was slow, even tho","useful":2,"cool":0},"5sOPkomuFr6Y6SFn1gM0zg":{"text":"This place has been on my list for a long time and it didn't let me down. From the Rum Pun","useful":1,"cool":0},"vdjJlczoisGvnAqMQZBxHw":{"text":"Worst service I've ever experienced. Rarely saw waiters in the room. Told it would be a 10","useful":3,"cool":0},"uLplKcGFH4XnYV7hj3uiMg":{"text":"My NaNa insisted I visit Dooky Chase when she found out I was visiting New Orleans. A shor","useful":4,"cool":3},"_11nK3dFz1YtLVSzeQzRHQ":{"text":"Had a great pre-Thanksgiving dinner there!\n\nNote: This was a private party where we had th","useful":3,"cool":0},"rU9JN4iBo0M2trisV6zmQg":{"text":"Service was horrible. Food wasn't special. The buffet offered very limited selections. Dis","useful":1,"cool":0},"-fSrzRXgVwALsW5sEdKPtA":{"text":"The lunch buffet was absolutely unappetizing. We ordered from the menu because of this and","useful":0,"cool":0},"d4N1qaiyWCqFBUc_JnbBAw":{"text":"If you're looking for the best food in New Orleans,\nthis is it right here. James Beard Awa","useful":2,"cool":2},"ubdpVWwcn9Wf3YYm8bKs1Q":{"text":"One word EXCELLENT!!! Nothing else to sat from start to end great experience.. MUST visit!","useful":0,"cool":0},"4Kva5k27dh5aA70qN18I5w":{"text":"I must say that she does serve some good New Orleans home cooking. Something you can get a","useful":3,"cool":2},"-LX_eOaacUkc7fKRUVe5JQ":{"text":"Had a wonderful time here. The atmosphere brought me back to a different era and walls of ","useful":1,"cool":1},"u35KurcbAhiPthr0qM0aCQ":{"text":"Enjoyed the visit for the most part. Buffet was average at best, surprised they had macaro","useful":0,"cool":0},"YiIxo9etl1Ks0KZwqAF40w":{"text":"This was the best meal all week here in Nola. Got a chance to talk with a Living Legend in","useful":0,"cool":0},"UimQlht5v_i9I6qJ353aaw":{"text":"If I could give no stars I would certainly have considered doing so. The hostess was great","useful":0,"cool":0},"EE8falrEfwy8ndAuiqV3XQ":{"text":"Line too long at WIllie Mae's so we stopped in at the tail end of lunch buffet at Dooky Ch","useful":2,"cool":1},"P_VrEYCc5Mqn6MNZve4MHQ":{"text":"Well, as one Yelper said, I will not forget the Fried Chicken...\nIt was so, so good. I sti","useful":1,"cool":2},"2UmEu_Kjl8gay7_XbX58-A":{"text":"This is a staple in NOLA. Went here while on our honeymoon in Jan and thought it was going","useful":3,"cool":1},"RlSajZjt-AC9Q7Oy3JLx-g":{"text":"Loved the atmosphere and the people. The food was a fancy, indoor picnic with all of the l","useful":0,"cool":0},"fCOyBZHfjiRLtYQUWhRyPw":{"text":"This was one the top of my to-visit list for NOLA and I am sooooo so happy that i got to c","useful":1,"cool":0},"nWFMTNiqI1OxiZ3yWrpUqA":{"text":"As first time visitors to New Orleans, we enjoyed the home cooking and the family feel of ","useful":0,"cool":0},"3Q5J8tcjKnBPSjc63O737w":{"text":"First time trying this place. Had a good attentive service. Tried the buffet really though","useful":0,"cool":0},"2FXHVqiy1u_-9_pnbbtmMA":{"text":"Went there with a large group so we were in a private room.  I arrived late with another p","useful":1,"cool":0},"PNtuWaT_YrWP7xD_xTwO3g":{"text":"Best Fried Chicken I have ever had. \nAnd amazing waitstaff.  The wait when we came at 11:2","useful":2,"cool":2},"StD-HuLf5Wl5u9Piy8xzXw":{"text":"Absolutely love Friday night dinners at Dooky Chases. Wonderful service, the fried chicken","useful":0,"cool":0},"bgSiu8Y_EhWJiRfRa5uc4Q":{"text":"There's no surprise this restaurant is an institution.\n\nThe staff and hostess were super f","useful":0,"cool":0},"-hrFN1IU9TrpdGVs1ZBYkQ":{"text":"We had the lunch buffet which included fried chicken,  fried catfish, stuffed peppers, gre","useful":0,"cool":0},"8bzsUWXNHff_7unJthZnmQ":{"text":"If you like fried chicken, be sure to stop by Dooky Chase's. It was perfect! \n\nI had the b","useful":1,"cool":0},"EnY1BSaaKsz1p_WBZsQbuQ":{"text":"I am only giving 5 stars because I really enjoyed the food. Dooky Chase probably has THE B","useful":0,"cool":0},"izF58hQgcg4jl9duW8b5NQ":{"text":"Worst restaurant ever, 2+ hour latter and no food at the buffet. Was told 10-20 minute wai","useful":1,"cool":0},"n7VrYwl-awd0eLa2sxxlxA":{"text":"I must say! Martynique Hampton and Shirley Marshal was on POINT!  This was my first here, ","useful":1,"cool":0},"Uo2MmH3D4dYvX7SS_tHfpw":{"text":"As a restaurant, Dooky Chase rates about 3.5 stars.  As an institution it gets 4.  This is","useful":5,"cool":2},"6iDKBCWlrvOV6fiL_9eP1A":{"text":"I really wanted to like this restaurant. Especially after enjoying their airport location,","useful":5,"cool":0},"_2G0yu9iSqkH-F9ZGyq6kg":{"text":"Legendary, bucketlist style.  Worth the trip all the way to the Big Easy by itself.  Ruine","useful":0,"cool":1},"eI6iwCrKKTskijUIUi6jrQ":{"text":"Had a late lunch here on 3/22/2017.  We make sure to go at least once on our bi-annual vis","useful":0,"cool":0},"i-fram3EfuYXHCeB8Id1PQ":{"text":"Don't miss it!\n\nThis place is easy to miss because it's in a residential neighborhood.\n\nTh","useful":1,"cool":0},"HJkcPUYhd7GDffU7ci-FTw":{"text":"Must go to because, it's a landmark. Definitely make reservations and try to go as close t","useful":1,"cool":0},"yFNwybvD0p0xtFSFd-uGDQ":{"text":"Best fried chicken in town. Way better than their neighboring rival, Willie Mae's. If you ","useful":8,"cool":0},"JsUptG0T-p5aCtwgQNSLzA":{"text":"Have heard so much about the food and the history of this restaurant and Ms. Leah Chase an","useful":0,"cool":0},"wf5RnB6XPhxli5QPrD1TZA":{"text":"I went to Dooky Chase for lunch last Friday.  I admit that I had pretty high expectations,","useful":2,"cool":1},"KkenA62WEmTCvH3j_lO9lA":{"text":"Probably the best fried chicken I ever had. When you visit New Orleans you have to eat her","useful":0,"cool":0},"WRYz8rZMgaSM8idLE21aag":{"text":"As tourist we really debated which places to dine while we ate our way through New Orleans","useful":0,"cool":0},"gZhyOjrVcDT17LqwtXL74Q":{"text":"My traveling companions and I walked into Dooky Chase's off the street dressed the part. I","useful":7,"cool":3},"rA8CBZnyX446Br4PRCrJnQ":{"text":"Let's see....\n\nBeef and vegetable soup and fresh garlic toast...\nthen salad with pickled o","useful":3,"cool":0},"Zm79ilZC3FiSPG0W3A5-kw":{"text":"We came around opening time for an early lunch (11a) and were promptly seated and ordered ","useful":6,"cool":3},"ReS7vxJyPWE-g1-DS2D-fA":{"text":"The restaurant itself is nice, and the bar on the side is a great waiting place since the ","useful":2,"cool":0},"QbWdiPW4HxVM5KJZnEzXHQ":{"text":"I don't know why this place does not have 5 stars. We were debating between this place and","useful":2,"cool":0},"pKr0HA2b-Rc5eIMz58ujIQ":{"text":"Best fried chicken I've ever had.  The white meat was equally as juicy as the dark meat an","useful":1,"cool":0},"5iPK7-IsYgwFYhxyDBlwpQ":{"text":"Was going to go to Willie Mae's for some fried chicken but line too long. Went here instea","useful":1,"cool":0},"ne7WuUDJrc7NMbLzn9HGyQ":{"text":"The reason the wait is so long is because it's worth it. If you don't want to wait on an a","useful":1,"cool":0},"iu50EobElWaGwSMi5TdKuw":{"text":"The restaurant on Orleans Avenue should change the name from \"Dooky\" to \"Dookie\" Chase. Th","useful":1,"cool":0},"i0nRZ8zjQOxmpSoW0qn95g":{"text":"This place came highly recommended by family living in the area.  My wife and I came down ","useful":8,"cool":1},"-8hYclLJuCSaQRu4yQ78Aw":{"text":"The food is EVERYTHING .  Now....  you will wait FOREVER to get in. But when you do baby y","useful":0,"cool":0},"KnerGXbHO0aVVCMrhRYfZg":{"text":"So we are on our honey moon of 30years and came here for lunch. I had the buffet the fried","useful":0,"cool":0},"Yn4IHi-jfBv0-y5kWwspXQ":{"text":"I went for the chicken because of the reviews on this site and I was not disappointed. It ","useful":4,"cool":0},"P26_CP8OkpCl0DY06Cajow":{"text":"Visiting from Memphis, TN and looking for a place to experience some great Louisiana Food.","useful":1,"cool":0},"B8xylDdfMo7UGELcGlmZ6Q":{"text":"We were greeted it's a smile and seated promptly. Our waitress came over and explained the","useful":0,"cool":0},"BFocGjwZKxXyClAvP_9kDA":{"text":"Needless to say I was highly disappointed in the service we received from the staff at Doo","useful":1,"cool":0},"bdR9SC-mnlOLNHRH0OCjKw":{"text":"I had such high hopes for this place but was really ........ Whew, wow, a mess! The sittin","useful":0,"cool":0},"ctpdnwJe7Dqp8jlLxti9_g":{"text":"The gumbo and shrimp creole are my fondest food memories of New Orleans. The ambiance and ","useful":0,"cool":0},"VfwAvqPFpLzaHqYGAC01cQ":{"text":"I was disheartened to find out that their famous gumbo is made with crab; unfortunately th","useful":2,"cool":0},"v0hDTRmoQWssnODTzbEVkw":{"text":"I struggled between a 3 and 4. We had to wait an hour to be seated which was exactly what ","useful":0,"cool":0},"KcXf4WGPifBvsK05pBYrGQ":{"text":"The food and service was amazing!  We ordered the Stewed Chicken, Shrimp Creole and Shrimp","useful":0,"cool":0},"vy17sQKBYQy9u8XNiwSmZA":{"text":"My family and I come often to New Orleans but this was the first time we went to Dooky Cha","useful":0,"cool":0},"_Y-RZ06FTxNJ14zImNpuuQ":{"text":"Glad to have gone, but feel like this restaurant's best days are behind them. Had the frie","useful":1,"cool":0},"PXKjoxCUA5d47NhqObZPDA":{"text":"I want to start off this review with a story. This was my last meal in the Big Easy. My la","useful":5,"cool":3},"LL1aa-GZwwcF33lJZ3-O0A":{"text":"Disappointed! We stood in line to only be told that they are not taking any more people. T","useful":0,"cool":0},"AWvVyVeODKlhsTGEtreMJw":{"text":"We arrived about 5 minutes before it opened and I was so glad we did. There was a small li","useful":2,"cool":0},"ucW-CHym9gMO-pzRRB5R2Q":{"text":"The food here was amazing! I am in NO for a business conference and stopped here for lunch","useful":0,"cool":0},"9dij9tfmIeUS3dLvcwmChA":{"text":"I was told this was a must go to; the service was very slow and orders were wrong. I can't","useful":0,"cool":0},"rzcQQJVsC-kZXsceCjVJMA":{"text":"Mom mad home cooking. Delicious food. Had a chance to meet and talk with Ms. Chase- it was","useful":0,"cool":0},"YnOhDuwMPJ5Wi3ivX4U07w":{"text":"Standard southern fare and it is GOOD! It was only open from 11-3 for lunch and we tried t","useful":0,"cool":0},"ATyvWtYfBUhn_y80_ApiQg":{"text":"Loved the history behind Dooky chase and Miss Leah so\nDecided to visit here during our cur","useful":0,"cool":0},"ipgNj0ejU50W1aXAWZyNUQ":{"text":"The biggest and frankly only disappointment in a  week-long trip to NO. Chicken and sides ","useful":3,"cool":1},"o2jTEkhxTzV2GeB4SJrB5A":{"text":"Food was average at best.  The service was good. I probably won't come back.","useful":0,"cool":0},"GDbEUfpAsQ4LoQaQJ7bfIA":{"text":"Food and service were welcoming and plentiful. This place is best to visit on a Tuesday or","useful":1,"cool":0},"y5DoY1lZo07OtyrYOXsXkQ":{"text":"Not very happy with the quality of the food. Two of our group had the buffet, two ordered ","useful":0,"cool":0},"j9gAPQEtoi8qYkQviqgR1A":{"text":"The Fiancee and I ate here for lunch one day. When we walked in dooky greated us and told ","useful":3,"cool":3},"S0_eYqgHa3naSWW0xD_8Mw":{"text":"This place is a staple in New Orleans like Ben's Chili Bowl is in D.C. and the food is abs","useful":9,"cool":8},"H1IrDOLNBwKvJTMSft8Gvw":{"text":"Yelp says they close at 3pm but we got there at 245p and we're told they. Close at 230 sin","useful":0,"cool":0},"C7BbLjYcNZRlmf1ils-4aA":{"text":"In town for a conference and our uber driver recommended this place as a local favorite no","useful":0,"cool":0},"XD7cZuK-jrD1wtbyyU2dLA":{"text":"Came here on a recommendation from a friend earlier in the week. Was in town for mardi gra","useful":0,"cool":0},"5MDgh9OPWBdfnv2Myn1Yfg":{"text":"Landmark restaurant!  I've seen Mrs. Chase on Top Chef.  I'm so glad I had the experience ","useful":1,"cool":0},"KyBCe6cxcv8C-cleorrXFg":{"text":"This was so middle of the road for me.  First- they are not open on the weekends.  When we","useful":0,"cool":0},"YFsUja92_IC9xnSfJ-ZSiA":{"text":"My friend wanted to go here because it's a historic landmark in NOLA and I'm all for black","useful":1,"cool":0},"QD3vBuWBNJLMWps6xZ2GMA":{"text":"I am a Marine wife that has heard of the landmark restaurant for many years.  Today was my","useful":1,"cool":0},"fRh6TQO19yb4OYkp0wUTUw":{"text":"FOOD? \nThe food here is pretty amazing... Sometimes. The portions (if you're ordering off ","useful":5,"cool":1},"UNd8SWQGNcWX56xN6QUhTw":{"text":"We got super lucky on our trip to New Orleans last week, because we happened to be there w","useful":1,"cool":2},"pnIfz6PO3CgWpCyKv9Mjrw":{"text":"I didn't grow up with southern comfort food so based on my own review, I would have given ","useful":0,"cool":0},"bEAij4EcJo6KJvjoIkt9wg":{"text":"Started the evening with seafood gumbo. It was amazing! Which led me to high expectations ","useful":0,"cool":0},"Lq8by3kClgd9VsF9TV54Bg":{"text":"If you want some authentic historical NOLA away from the French Quarter madness, this is y","useful":4,"cool":0},"rjlI_VSk04ap3VWJ3JOCfg":{"text":"This restaurant is a landmark in New Orleans. The dining room is pretty. However, the food","useful":2,"cool":0},"AuJhp36YwC9EjgXiX2KVSw":{"text":"You must try the buffet, to get a taste of everything without spending too much. They are ","useful":0,"cool":0},"-sFg8ZdJa6tLbDDC6nzH_w":{"text":"Will not forget the fried chicken.....it was RAW!!\nWaited for it as it was out at the buff","useful":3,"cool":0},"w4jN9tMp3mTkMWdiMSgOTA":{"text":"came for the lunch buffet. service is poor - no one wanted to be our waiter. food is very ","useful":0,"cool":0},"B2d0DrUQRWzASvshMdqA2A":{"text":"Have you ever had real fried Chicken?  Stop in to Dooky Chase and have a true culinary exp","useful":1,"cool":1},"7qD5Vva8_5R3g3gZH3MU0Q":{"text":"The staff was the friendliest!  Very personable and a pleasure to have as part of my dinin","useful":0,"cool":0},"Jfl1R8OJ9HjzdmHmUusJgg":{"text":"After an exceptional experience at Dooky Chase today, I'm having a hard time understanding","useful":0,"cool":0},"6bNI9CQ3rMIgHgsE_gKqrg":{"text":"I went with a group of friends for the famous Gumbo Z'herbs on Holy Thursday. If you like ","useful":0,"cool":0},"0BDq7B1PlpYn0vaNogS8iA":{"text":"Went to Dooky Chase today expecting to get just a taste of their famous fried chicken sinc","useful":4,"cool":3},"qjy19Ku6FzyUwp53en-vkw":{"text":"Had the lunch buffet for $19.95 on a rainy Friday.  A tad overpriced I thought.  Fried chi","useful":0,"cool":0},"MMsXhe3Eg8saZf9TOs1c6Q":{"text":"This restaurant is amazing!! Such an honor to eat at this historical place with such a leg","useful":1,"cool":1},"wawQb7k5iYIVyM9x861lHg":{"text":"The BEST FRIED CHICKEN!!! hands down like seriously. We did the buffet which was around $2","useful":6,"cool":1},"6FuUFuFt3YyWV7Bg0pEO6A":{"text":"Dooky Chase's Restaurant is serving up all it says, good food, good ambiance, beautiful ar","useful":1,"cool":0},"ta53e7nINpZnG1RSLMcjmA":{"text":"Very nice people in the convenient location of NOLA Treme neighborhood. Don't let the exte","useful":0,"cool":0},"OsPHGyD37D3Ivq67wd8Fjg":{"text":"Xavier University brought me here for dinner as a freshman transfer student.  This is by f","useful":0,"cool":0},"l0JnBBzB7Fq7gpiqzd7vXQ":{"text":"Dooky Chase has been on my \"Food Bucket List\" for years.  Finally got to go on a recent wo","useful":0,"cool":0},"qrKG2qOHulE6KCNi-M--bg":{"text":"Got there early for lunch, and was greeted at the door by a lovely lady.\nWe both had the F","useful":0,"cool":0},"0fIZcJrOq8FK1HKJlOb47A":{"text":"By far the best restaurant in New Orleans. The food is amazingly delicious. The fried chic","useful":0,"cool":0},"RNiTXPBWTI33Ca3Ro84Ljw":{"text":"After trying to go to willie maes scotch house, which was closed. And said it would be ope","useful":0,"cool":0},"oPL0YVa4B0Ikr43K-y3_KA":{"text":"First lunch in NOLA on a business trip. Omar was our waiter and he was fabulous. He recomm","useful":0,"cool":0},"8RsMdeR67yZfN1t2-gVjdg":{"text":"I had to give three stars and the stars are because the staff was very nice , the scenery ","useful":0,"cool":0},"CgtcM3kiWPtITEGq_XvYtA":{"text":"Went here for Friday night dinner with significant other and his parents. I love the art w","useful":2,"cool":1},"y4cma719hS4fgknmBKFjIw":{"text":"We had such a lovely time here.  We went on Friday night for dinner.  The restaurant had b","useful":1,"cool":1},"_hJ5vnM5pVtUdOepjtgpOg":{"text":"This review is for To-Go of the gumbo. Look after eating at Willie Mae's, we really could ","useful":0,"cool":0},"3MiugqxDSsq3dGpeS2G8QA":{"text":"A NO soul food haven! You must eat here to get great honest NO spirit. Go for lunch and yo","useful":0,"cool":0},"aecyQmDjrm2a030TsjJXoQ":{"text":"Thoroughly enjoyed this place. Definitely a place to come if you want legit soul food and ","useful":0,"cool":1},"xkS7XpoaW_CoH7dpFniVNw":{"text":"Love the atmosphere and its rich history, but I was disappointed with the food. We had the","useful":0,"cool":0},"8OjEpM1wHnkG3Wbk_rpb7Q":{"text":"Very good food, very slow and bad service.  Our server was extra slow. I had finished my l","useful":6,"cool":2},"AkuBMtgoM4PkbaE4TzcipQ":{"text":"I went to Dooky Chase during the Essence Festival 2018 and the food was NASTY.  I have nev","useful":1,"cool":0},"OnHKBCx2-jgvTZhIXDEl4Q":{"text":"If one is familiar with cookery one knows of Leah Chase , the Queen of Creole cuisine. Doo","useful":0,"cool":0},"gxmVYm4-_cGumPnVdfbVfg":{"text":"Visited New Orleans for a week, loved this place so much I came here twice. We had the sam","useful":1,"cool":0},"zh7D9eShvhvPoHOW-FIpVA":{"text":"Busy Place\n\nThis restaurant has been around for a while and deservedly so.  The staff was ","useful":0,"cool":0},"9KrycHkCs7RtaF7qlyoI3Q":{"text":"Omg!! Just wow! Everything is delicious! I can't even think of the words to describe how g","useful":0,"cool":0},"0WEeKXy4zYI9ZHLH05xL4Q":{"text":"I think there is a lot of history here......I don't want to discount that.  But, here is m","useful":7,"cool":0},"fPzB3ArcK6T2g8qpBK-EjA":{"text":"Excellent food. Excellent atmosphere. But mainly excellent food. The buffet is outstanding","useful":0,"cool":0},"7OZ5IIKJ2n0ePaHxs6uQgw":{"text":"I went to this fabulous restaurant at New Orleans airport I was on my way back home to Cal","useful":0,"cool":0},"hghYW1kMk0nm1YxzMTZoKg":{"text":"This historical significance and ambiance gets a star.  Touched down NOLA and was looking ","useful":0,"cool":0},"zBIMNY6ds0ujfaqd9yWJvA":{"text":"Fried chicken is EVERYTHING!! Cool art work, good drinks, really can't go wrong with anyth","useful":0,"cool":0},"htKkvH6A0TnRu_rr25SFaQ":{"text":"This 3 and half star place is pretty good -- well, I rounded up. I wouldn't say it is a st","useful":5,"cool":4},"DTRkGK4Eo9XHu_vVJLZHmg":{"text":"The food here was great!! We showed up at 1050 (it opens at 11) and the line was already g","useful":0,"cool":0},"GzWTJ223XKG5JaZTwIVP7Q":{"text":"ThIs is a lovely family run establishment and the inspiration behind The Princess and The ","useful":0,"cool":0},"ZPNvaRxfvX3QVGhmAKS-kQ":{"text":"Sorry, but after all the hype, the food lacked favor. They only bought out the fried chick","useful":0,"cool":0},"4UTZTF11R2BSfNTBfKbfDg":{"text":"all you can eat authentic nawlins food??? what more can you ask for? the fried chicken was","useful":2,"cool":1},"Q2tVp9sDvkfzxqZJyUyhww":{"text":"Food was good but the service was horrible.  Our waiter made us wait excessively for refil","useful":0,"cool":0},"vZbjZS3RxJYanmkZMhFlCA":{"text":"Do not miss this place while you are in New Orleans...wow!  Home cookin' at it's finest an","useful":2,"cool":0},"Vmycr-cY5AOATK85bpoUYw":{"text":"I have been having my eye on coming to this place for a long time, due to  the operating h","useful":0,"cool":0},"Gk6htXHv_R7SYVUT9ZGALA":{"text":"Moist and tender fried chicken with a subtle spicy kick awaits you at Dooky Chase. The buf","useful":0,"cool":0},"04XMnTEDLmT5LeMNTzKgAg":{"text":"I've heard about this place and was excited to check it out. When I arrived, it took 15 mi","useful":2,"cool":0},"_ZwXC0unqkH35-r2duRAsQ":{"text":"Great lunch buffet! Fried chicken was excellent... Gumbo so so! Yams and macaroni cheese w","useful":2,"cool":1},"IUAkb5Uy7saMyT44jKp0KA":{"text":"Wanted to check out the famous Dooky Chase and was not disappointed. Enjoyed all of the bu","useful":0,"cool":0},"UwuNtpNXb114c3MW3iQKtg":{"text":"I haven't eaten at Dooky Chase since my college days. 3The food is still good and plentifu","useful":1,"cool":0},"NfaFlBBCqedfkGv0dbBNlw":{"text":"Ms. Chase is a god damn national treasure! We mainly came here to meet her after seeing in","useful":2,"cool":2},"45VULeFBxc-aF_ObSu5_vA":{"text":"One of my favorite places to eat in the United States. Ms. Leah is amazing. I. Bought both","useful":0,"cool":0},"xZD5bQkTnV9m4_72EefAyQ":{"text":"Our Uber driver recommended this place.  The food was good but the atmosphere and staff we","useful":1,"cool":1},"qlpF7OautN7juTyHTj41Nw":{"text":"Always a pleasure to go to this restaurant.  Have been fortunate to meet Mrs. Leah Chase a","useful":0,"cool":0},"WMkMxzbEUXnU8krHxMsUsA":{"text":"Was very excited to try this restaurant...we walked in with empty stomachs and were treate","useful":2,"cool":0},"CZMFZP1bLGYYcH78in0HEg":{"text":"As this is the real Princess Tiana's restaurant, I came in with elevated expectations. Doo","useful":2,"cool":0},"EBB9kHlNFNXqkNCRHj0GNw":{"text":"HORRIBLE SERVICE!!!!!!!!!!!!!! Food was cold. Waited one hour and a half for food that cam","useful":1,"cool":0},"2fzKx8dSwnVQci-9V4HtLQ":{"text":"Buffet is $19.95 and is very small. Restaurant has nice white linen tablecloths and napkin","useful":1,"cool":0},"d3EYWIGx4xOYJ_5gU7faIw":{"text":"I came because it's a historical staple in New Orleans. I assumed the food would be great,","useful":2,"cool":0},"i1b8kosbhZSyc9cZ9xp5Mg":{"text":"LOVE IT!!! Had Thanksgiving dinner and it was great. The gumbo w. the andouie sausage was ","useful":4,"cool":1},"26SJKZnU1PcQGcCWCfAMSw":{"text":"We arrived in the early afternoon on the 8th of December and we were told to wait for abou","useful":0,"cool":0},"HKGKoZq0VLk3WlEBNwrtPw":{"text":"Wondering if we all visited the same Dooky Chase Restaurant here.  We went and were not th","useful":4,"cool":0},"NOSD9GD-Zqqt53iVftraeQ":{"text":"It was so BAD. We had to wait almost an hour for a table. The hostess had to clear and cle","useful":1,"cool":0},"5FscznmoaxU46MwlrWLvnA":{"text":"Came here for lunch on a Friday. Wish I would have made reservations because the wait was ","useful":0,"cool":0},"Pes-kYJVkTA0r9pBtw9sMQ":{"text":"Dooky Chase Restaurant is the holy temple of Creole soul food, historically significant an","useful":1,"cool":0},"BSUqv6R9VmLfbweDXWMrmg":{"text":"Had the lunch buffet today with family birthday celebration for my cousin who choose the r","useful":5,"cool":0},"GBHoFwMdjhePkUeB2RvUag":{"text":"I ate there today and the food was excellent.  We had a large party, 12 people, and they w","useful":6,"cool":2},"wlcL7kuPI0XH6Q4jlx7XjA":{"text":"The staff is very friendly and seem to appear from thin air with another glass of water, y","useful":2,"cool":1},"f_TEb3VzNCDAJT3dFynjiw":{"text":"We felt fortunate to visit Mrs. Chase's restaurant, both for the history and the food.  We","useful":0,"cool":0},"S5vE04SWRuJIxrtlv2sKZg":{"text":"Does not live up to the mythology or hype it has gotten. We had a 7:30 reservation for two","useful":5,"cool":1},"5AdwYx1XLEhxuu6VHyD15g":{"text":"From the dramatic chandeliers to the plush red velvet drapery to the antique seating to th","useful":1,"cool":1},"f8LhDrYHj3EPlL0mWK-Q5w":{"text":"Cautious in the beginning but comatose when I left. With a name like Dooky Chase you cant ","useful":1,"cool":0},"sb3n_Yym-Bvja1VtzZ7-7Q":{"text":"Went for lunch buffet gumbo came out cold. Service super slow. Ordered a la carte seafood ","useful":7,"cool":1},"gMhRNhnno0VfRRZRISpF3Q":{"text":"I'm a native and only go to dookys when outta town guests insist; otherwise I think it doe","useful":2,"cool":0},"MX0_YtLAOTexnh0XbAJaTw":{"text":"I went to the restaurant in the airport for breakfast at 8:30 a.m.  The restaurant was cle","useful":3,"cool":0},"Z5pkUc61mt-smSuMRe2gnw":{"text":"Avoid this restaurant \nWe arrived 7:15pm and had to wait to put our name on the waiting li","useful":2,"cool":0},"uqDEXdHYbbd7EXbsKYvp_A":{"text":"I  bought into the hype. Where should I began with this disaster-of-a place. Outside of bu","useful":2,"cool":0},"SbwS1ZCojkberyyZ3Wo2hQ":{"text":"BEST LUNCH EVER. We went yesterday and luckily there was no line. Chase was our waitress a","useful":0,"cool":0},"-qG5VKhMuOVcOii1CxaxWg":{"text":"An absolute disaster.  Like the Hindenburg.  Or the Titanic.  Wish I could rate it lower. ","useful":3,"cool":0},"Y9bjZW5dU_6HIdcTH6kuOg":{"text":"I struggled between a 3 and 4. We had to wait an hour to be seated which was exactly what ","useful":0,"cool":0},"r1R2lofw9viffKqe6oO-1w":{"text":"I need to inform the public about food and service. I saw Dookie Chase on the show Top Che","useful":1,"cool":0},"FmpdGlzhn5A_ImKBpaf3VA":{"text":"Loved the food. We ate the buffet. It was kept clean, fresh and replenished often. I'm not","useful":0,"cool":0},"oSgp-mAlMRTScHvt-8HXqg":{"text":"Awww I hate to do this because I love Leah chase. However the food was underwhelming and l","useful":0,"cool":0},"LG4FnRAAUfwhb56TDJ0h3g":{"text":"Nothing beats a meals that warms your heart. \n\nThe food is classic southern comfort food, ","useful":0,"cool":0},"Rw7FedRgWx-0aZEstKlibw":{"text":"Gosh, how I wanted to love this place. We waited 40 minutes for water, 45 minutes just to ","useful":3,"cool":0},"EErCEj7N5z6R2AWSMXh2fg":{"text":"I forgot that I am not the President of the United The States. The service was terrible, I","useful":1,"cool":0},"mVm0Kp1MK_TZbnqqja2sKQ":{"text":"I went for the buffet and the fried chicken was excellent. The best thing there. The green","useful":0,"cool":0},"ICEOd57SExkJnRf2umyiAQ":{"text":"This was hands down the best fried chicken I've ever had!  Service was impeccable as well.","useful":0,"cool":0},"aKfoYEGnQgk5oV3a7wNeDw":{"text":"Fried chicken! Greens! Real Southern cooking. My goodness the lunch buffet is worth every ","useful":2,"cool":1},"StpiBqpTry7goRbK7euwBA":{"text":"I feel completely unqualified to review this little gem. Our party of five came for Wednes","useful":3,"cool":1},"M9rj2Y7orCRjSORmwIJwhg":{"text":"I could not have been more disappointed with this dining or lack there of experience. Had ","useful":3,"cool":0},"yeLBHqK2FKz7yvpn8g99zQ":{"text":"Great food! Service was slow at first but picked up. \n\nPerfect crispy fried chicken, tende","useful":5,"cool":5},"Bc9FiO_RiDT1f18QvbCtFA":{"text":"Went with a group of 30 and only given one waitperson.    3 hours later we are done and ho","useful":0,"cool":0},"VpOkm3gWVjoV0RURskHBGA":{"text":"This place was number 2 on my best of N.O.  I will not lie, Dooky and I got off to a rough","useful":5,"cool":3},"Xt6Rgr11K3yxOuJYOyITfw":{"text":"I was in New Orleans four months before Hurricane Katrina.  I had saw Leah Chase on some P","useful":3,"cool":3},"d3jUesClNIEYgYBvo4x1Nw":{"text":"Sad to say we were underwhelmed with the quality of the food and service here. My husband ","useful":0,"cool":0},"xGoK63r6mOjh2Yc4flYsYQ":{"text":"Excellent fried chicken, red beans and rice and the peach cobbler is delicious! For lunch ","useful":0,"cool":0},"e0XohdVaF2E2kNNx3-ZlEQ":{"text":"We came as a group from Road Scholar.  Based on the reviews about the service, maybe this ","useful":0,"cool":0},"f-mEDZ7m48WneX1C2eAHew":{"text":"I wanted to go to the Treme location but didn't get a chance. I was selighted to find one ","useful":0,"cool":0},"7vPLDBoctzXN0iKY4omylw":{"text":"Great food, great service. The fried chicken was very good and the sides were superb. I wi","useful":1,"cool":0},"SUmHTq9TzmilPWXtDGmNdw":{"text":"Wow ... Just came back from my SIL's pre-wedding dinner.  Fried chicken, greens, Mac n che","useful":5,"cool":2},"tBMt0s5E-JWg9FTNjstsPg":{"text":"Dooky Chase Restaurant. What can you say about a staple of NOLA's history. Established in ","useful":1,"cool":0},"I6vzoN2DnemiKidKoN3fmQ":{"text":"I absolutely love Leah Chases food, her books and her restaurant. I couldn't wait to get t","useful":0,"cool":0},"VuOBGHqKzYbNPzQ0UTE1Mw":{"text":"I cannot visit New Orleans without coming here. Of course I expected a short wait as I alr","useful":0,"cool":0},"x5KtlruJPimb0TkeGAoFKw":{"text":"We wanted to go to Willie Mae's but it was closed, so we went here instead.  We all had th","useful":4,"cool":1},"7ZM7LOgH1kx6hgKa3svkNg":{"text":"hands down, the best restaurant in new orleans.  leah chase makes the best gumbo and fried","useful":1,"cool":0},"uLLSAJ4q70cZtqnfU34S-Q":{"text":"Heard this was a go to location in New Orleans so I made it my mission to try it.   I was ","useful":0,"cool":0},"tvNfXlDwfWcIS_6CCvsgAg":{"text":"This place was reccommended by someone my husband know. We arrived 30mins before they open","useful":0,"cool":0},"g2Jsjzuicgo2iJtpbeNPpA":{"text":"The lunch buffet was splendid. It gives a wonderful opportunity to taste a number of the s","useful":0,"cool":1},"jmxLvh6c0yAChg5XKRzS4A":{"text":"If you just to show everyone that you have been here, then it's a good place to be. If you","useful":0,"cool":0},"OtU0GgBN-Duu7pox3bw8cQ":{"text":"The worst place in New Orleans to get fried chicken. You can go to your  nearest homeless ","useful":1,"cool":0},"l59-P7fuTidmgwhbnoVPyw":{"text":"Great place for some New Orleans soul food. The Buffett was a no brainier at $18. They cha","useful":3,"cool":1},"KT86yBWNAOyUwS0M_4isAA":{"text":"Terrific gumbo with at least seven kinds of meat. Excellent greens with large chunks of sm","useful":0,"cool":0},"7NL5rB9o1z4TMZvbZcVSSQ":{"text":"After hearing so many stories about Dooky Chases I was so disappointed when I finally got ","useful":4,"cool":0},"vMs9VV4tfbRlENuoTkJmKA":{"text":"Dooky Chase is that restaurant that you tend to forget about until you drive by and you sa","useful":4,"cool":3},"hHlUdk_JtCzCF9UeY29-wg":{"text":"I hate this place!!!!!!! Arrrrgh\nI'm writing this review as I have sat here in a hallway f","useful":9,"cool":5},"UpGsbGaDyTqt9urJbMYx1A":{"text":"Dooky Chase's Restaurant is a famous one and I'll tell you why. The food and service here ","useful":0,"cool":0},"mOcIrlicaSunN1Gf78G4ww":{"text":"Had exactly the same experience as Jennifer did in her review. My wife has talked about Wi","useful":6,"cool":1},"b2kCDxgmQleHD2AseUJVJw":{"text":"This place is a legend....exceeded all my expectations.  If you are visiting NOLA, no trip","useful":4,"cool":0},"4XVluLpZQJQXm6KDs8YRfA":{"text":"The gumbo was extremely delicious! But the rest of the menu I would pass on. The Mac and c","useful":1,"cool":0},"zNptfd9EJvbfP5rQlLT6nw":{"text":"We went on a Friday for lunch at 11:00. Good move because the place filled up fast. They o","useful":0,"cool":0},"0C3PmCsQzfYolwXX2aRpuA":{"text":"Great food with historic meaning. The FRIED chicken and Dooky punch (alcoholic) was amazin","useful":0,"cool":0},"bXW5sQg25rtAdvK7Ohqcrw":{"text":"i have been going here since before Katrina, I was even there during the rebuild process o","useful":0,"cool":0},"RKWkM3yl5Z5g_Dvnvoy1NA":{"text":"Anyone who likes Fried Chicken will love this. Moist, crunchy with a mild essence of heat ","useful":0,"cool":0},"okc3Pdw7OGkwzbahZXa2rg":{"text":"Had the lunch buffet, and I was pleased with everything I ate: Fried chicken, red beans & ","useful":1,"cool":0},"Xcv2EOBwiRrF9fD-7b0erQ":{"text":"Part of eating at this unique and famous restaurant is waiting for the food or having to w","useful":0,"cool":0},"8qGVCcP9Mv3cvo4eMbCr3Q":{"text":"In planning our trip to New Orleans in June, we absolutely knew we had to go to Dooky Chas","useful":1,"cool":0},"1e3-tjFdf95uV-VrEoBJ-A":{"text":"5 stars for this being a classy, down to earth, clean and organized place with amazing his","useful":0,"cool":0},"R5xbQKSfMHKqaCH4KLB02A":{"text":"Please leave the southern comfort food to Georgians. I went there with a party of three-wh","useful":0,"cool":0},"Pl6Pp7jFIyIf2vEyMGyB5w":{"text":"WORST service experience I have ever had. Our waitress (Keshawn) was rude, inattentive, an","useful":0,"cool":0},"J56_zl0C3CbhjksYjKhCkg":{"text":"We were visiting  New Orleans for the 1st half of our 2 city vacation. A local friend sugg","useful":3,"cool":1},"Amka6N723wrsGwYBv6XYnA":{"text":"We had a great experience.  The restaurant is steeped in history with Mrs. Chase still wor","useful":0,"cool":0},"Ox5aiFiibL0RFXpX45WvTg":{"text":"Having not eaten at Dooky Chase since the early '90s, I've been meaning to go of late. Was","useful":4,"cool":0},"mix6xLVKMaem9g1aH2Z1pw":{"text":"We anticipated this restaurant after seeing it on Destination America.  We were not disapp","useful":0,"cool":0},"bDoWqm54NecBuWf_PX4pzw":{"text":"Terrible terrible overcooked food. The employees were rude and it took an hour and 20 mins","useful":0,"cool":0},"5zlAGpHbGJqZz7P6dDSDFg":{"text":"Ok we had to try some of NOLA history by going here. We went on a Sunday so it was buffet ","useful":1,"cool":2},"Z1tedM_aKj_6IxlNTDFxgQ":{"text":"Do not go to this restaurant. Food was way less than average and service was worse. We wai","useful":1,"cool":0},"S-8ALuDSwlwPFCxqAzlCKg":{"text":"My family & I went to Dooky Chase to celebrate my grandmother's 80th birthday.  My grandmo","useful":0,"cool":1},"hhAQQqygiwHjRh7_RxPrew":{"text":"My  husband and I felt that we can't leave New Orleans without trying out fried chicken.  ","useful":0,"cool":0},"4Uc4y4NzBgoI-cruen4heg":{"text":"i am seriously concerned about the taste buds of the people of the people who gave this pl","useful":0,"cool":0},"uxfGFoovqQS1W6aisYgdMQ":{"text":"To, me the food was just OK.  I did a taste test between Dooky Chase and Willie Mae's beca","useful":2,"cool":0},"er58ERMxdVuY_3Rt5OycFQ":{"text":"It Was expensive for the buffet with limited choices of food but the fried chicken was del","useful":0,"cool":0},"xf9JSF3k6Md79L4a2oFSsQ":{"text":"MMMMMM!\n\nI went here for my friend's private wedding brunch, and it was so good (but then,","useful":4,"cool":0},"3qwf-IqJju5ZT4jvnso6TA":{"text":"Good fried chicken with nice color and crispness. We did the $19.95 buffet. Juicy but not ","useful":1,"cool":0},"F4U3OeEfZNqbQHa8gRrsng":{"text":"Lunch buffet at $19.95!!!!  What a deal!!!  The food was delicious.  Delicious friend chic","useful":0,"cool":0},"69lR38OYLuQMHdq_MyfAZA":{"text":"This by far has been my worst dining experience ever.  After waiting over 1 and half hours","useful":5,"cool":1},"fKL--wzAib9G8MPlBNzvKA":{"text":"Located in an \"iffy\" neighborhood dookie chase is classic nola home cooking.  Be sure to g","useful":3,"cool":0},"tEW_HavShd1ujG1ZZnc-rw":{"text":"We went for lunch today, and we were sorely disappointed in what should be a New Orleans i","useful":2,"cool":0},"HElgHpj69omHqM78HQVrFA":{"text":"A New Orleans institution. Miss Leah has always been the best reason to visit. She would c","useful":2,"cool":0},"toomjbo--jKlpY9_glS-Kw":{"text":"Been sitting for 65 minutes with no drinks, bread or salad. The bathroom doesn't have a mi","useful":3,"cool":1},"HSIiiELyajk352SOyFyaug":{"text":"A place where Obama seems to happily dine at, my friend and I came to check this place out","useful":6,"cool":0},"dCoMrZiJY_-YRE4j7IR4RQ":{"text":"Listen, this place is worth the wait and meets the hype! We had the fried chicken with a v","useful":0,"cool":0},"-scLag4TGnuv6Qb4rP0MwQ":{"text":"Dooky Chase's has been on my bucket list for a while and finally got to try it.  Next time","useful":0,"cool":0},"_mUsZ0LHUFOJo7-mm_xFmw":{"text":"Disappointed about the wait. We were told 20 mins, which ended up being an hour. We notifi","useful":1,"cool":0},"jJVf3KS-sCipZpq9Rsiw9g":{"text":"Went over the weekend for a momentous birthday celebration.  What a disappointment. \nFirst","useful":1,"cool":0},"i__SfXCzzUL8w6LKp9iHfQ":{"text":"Almost 6 years later I decided after one of the most horrific restaurant experiences I've ","useful":8,"cool":5},"Z-YCYQTwDzpIbejQ1Dt7Rw":{"text":"I've been to New Orleans twice now, once in 2009 and once this last month. I found Dooky C","useful":4,"cool":0},"yySm1dIHpowmyvx8FHNBAg":{"text":"Very good!  I came for lunch with my family. We all got the buffet and we all loved it.  S","useful":3,"cool":0},"zfEyUhgeybyU10jKbSGRfQ":{"text":"Great creole down-home food in an upscale environment with interesting local art. They cla","useful":3,"cool":0},"ydfF1WwnkXrSWzi_ICd7RA":{"text":"The food was delicious, the service was GREAT but the BEST honor was meeting the owner her","useful":0,"cool":0},"G0UaDhCLEC6I2C7tcEYqhA":{"text":"Don't believe the hype. While the food was ok, poor service, overcrowded dining area, and ","useful":1,"cool":0},"gbqwtNU3uQ-0sk7YEL2_aQ":{"text":"What a charming and beautiful restaurant. It definitely feels upscale, yet guests wearing ","useful":1,"cool":0},"VIS0py_AYqI3Vd3PNFLlhw":{"text":"Def worth trying the buffet for some \"home\" food !!! But I wouldn't venture outside the bu","useful":2,"cool":2},"zYGgkoWuXEJDPq_QJUxiRA":{"text":"We opted for the buffet and man it did not disappoint. Every single person in our party ha","useful":1,"cool":0},"GrVO3PaPhbaLbo4X17NG-A":{"text":"I didn't get to try the place... but I meant the co owner, Trevor Chase! And he was so kin","useful":0,"cool":3},"bKEvUETKt1b66DVG9BUwKg":{"text":"Mehhhh sums it up! Definitely not the best fried chicken anywhere. I got fried chicken, ma","useful":4,"cool":1},"FhnZlsB8-GRRwOqFwPvu9w":{"text":"This was a huge disappointment. We planned on this meal for months! It was an hour to get ","useful":0,"cool":0},"__QwxjzAd2i1dB5K2KAKzA":{"text":"I want to first say its important to recognize that this was a historically important plac","useful":3,"cool":2},"RT8C69VZFKePHZB9-YXnHQ":{"text":"Our charity organization had run of the entire restaurant this Monday night and had a wond","useful":0,"cool":0},"Lr9BnzU7tS2SSvTstBhCXg":{"text":"Again very surprisingly delicious I was expecting it to just be hype but now I have to tel","useful":0,"cool":0},"J8mz6hPrZfX0sPS5JA3pGw":{"text":"Fabulous lunch buffet.  The fried chicken is just perfect.  The greens still linger in my ","useful":0,"cool":0},"q_KNJQHeuwCEDr5VXsfS8g":{"text":"Waited 15 minutes for them to tell me I couldn't be seated. I biked here 45 minutes. It's ","useful":0,"cool":0},"TS0HWqnEYwywpn4PedQZZA":{"text":"Great food! This was our last stop in NOLA before heading out to MSY. We got lucky and the","useful":0,"cool":0},"OCH2Azl8tYWoolXYsOBmGA":{"text":"We visited Dooky Chase, during our visit to New Orleans, because we saw it mentioned on ei","useful":1,"cool":0},"JANhZwbKJyBs07zSjN-sXQ":{"text":"Greeted promptly, had the lunch buffet on Friday. I suggest you get there early.  Best fri","useful":0,"cool":0},"qLVy2kJWN1bnhCcBtL0AUw":{"text":"THE ABSOLUTE WORSE RESTAURANT THAT I HAVE EVER BEEN TO!!!!!!!!!\n\nWe were told that the wai","useful":11,"cool":0},"7Q94C1bWI_AckjCVOiOyZw":{"text":"Go for the food and the experience. If you are lucky you might see Leah Chase,  the grande","useful":1,"cool":1},"gVtyXs6uyI7YF1vETy4Ppg":{"text":"I can't speak for the other reviews that were less than 4 stars. But my experience was epi","useful":3,"cool":0},"UkBjettF_UIKGpiH1AeWgg":{"text":"Food here was disappointing. Had the lunch buffet and nothing stood out. Fried chicken was","useful":0,"cool":0},"V04zdOleaEi3qNok6qXTxA":{"text":"You must come here if you are in the area.  Classy lunch buffet, and desert for $20.  Can'","useful":0,"cool":0},"oWEaBZQZs6qRyzEp2N2mrw":{"text":"Chicken was great, gumbo was great, catfish was good. We even got to meet the chef (Dooky ","useful":0,"cool":0},"HR87Pkt_Dyh7MYrwN0j33Q":{"text":"We were there the last week of July, just made it about 1pm before the line started to get","useful":1,"cool":0},"qRUGra-oDR9wH2tVFM_6Fw":{"text":"I have to agree with most of the bad reviews.  Was so excited  to eat here after seeing th","useful":3,"cool":0},"HChlfXqslHsQPAuKFLk3zA":{"text":"I was so excited when my friend said she wanted her birthday lunch to be at Dooky Chase!  ","useful":2,"cool":0},"y7fHFoNjDVPmCJazDCESXA":{"text":"This is truly what heavens kitchen must be like. ...mmmmm mmmm!!!","useful":0,"cool":0},"JigePawVYiam7U5kEcF2LQ":{"text":"missing Nola so i thought i would give a review of my favorite place to eat in the city. l","useful":0,"cool":0},"Vn-RLlapLnWD7xeoERj5uA":{"text":"My first time at DC.\nMy mistake was having the buffet & not ordering from the menu.\nThe Bu","useful":4,"cool":0},"IY4N3cxFbsSSvHvD-0p0DQ":{"text":"If you're ever in New Orleans you should eat here and get the buffet it's $20. You will ne","useful":0,"cool":0},"1OVqS1BipIHcwuU6ZspA_A":{"text":"I too walked to Dooky Chase.  In heels, and a summer print dress.  I too was specifically ","useful":0,"cool":0},"IrZIAn-xcen7sUSNF3uecg":{"text":"I was visiting New Orleans this past week and I came across some of the Best by far foods ","useful":0,"cool":0},"_fbEWetqZiJAhSM3GceY3w":{"text":"We went there last night, and it was amazing! The wait wasn't too long, and the servers we","useful":0,"cool":0},"t0NqJcUJVh5kK54rVCeEUw":{"text":"Gumbo! That is all. We expected more for the price. The waiter was sweating hard like he w","useful":0,"cool":0},"ynaU7YJ-w2N_NtoIYUVBaA":{"text":"Just seeing Leah Chase is enough for five stars but add the fabulous food and price for th","useful":0,"cool":0},"NoD8QvKfYa-VTSwuzc3EAA":{"text":"Omg.  I ate to much.  I should have taken the dessert home.  \nDelicious.  I'm about to pas","useful":0,"cool":0},"DQtjz-e5a9T2uCuGW9TgtA":{"text":"We did the buffet, as it had the red beans & rice, their famous fried chicken & other good","useful":0,"cool":0},"S4X6jDbDl1mFHv8wQV622g":{"text":"So Delicious !!! We had the buffet :black-eyed peas w okra and ham, beef tips ,mustard gre","useful":0,"cool":0},"3277S4RWFQji9PHACVz9FA":{"text":"This wasn't as good as i expected, especially since it cost over $80 for 3. Very limited b","useful":1,"cool":0},"M3ScKaiK8VWdP3STiFrHQw":{"text":"Wear ur Sunday best, no casual attire. Get the buffet it's the best deal. Most dishes are ","useful":1,"cool":0},"pfjq_AEBWAQlrNILlgf9sA":{"text":"Fried chicken had a heavenly light and flavorful crunch. The batter coated the light crisp","useful":1,"cool":0},"jDQrpw5A0FoSs2j4Fty2bw":{"text":"Had the honor of meeting the legendary Mrs. Chase which was the highlight of this experien","useful":0,"cool":0},"I7gjxoaDEZSOpV7fPolj3w":{"text":"I enjoyed my dinner date here, the food was good and desert was on point. The finishing to","useful":0,"cool":0},"7XvmZYYWp-clW_eBCYdcPg":{"text":"I have lived in this city for a while and cannot believe it has taken me this long to get ","useful":0,"cool":1},"-oo6SHqc33A46R5ic44HBA":{"text":"Really good food! The beignets were better here (next door actually) than at Cafe de Monde","useful":0,"cool":0},"0Frlf5CFj5Va0zs4hNEOfQ":{"text":"Who was the hater who didn't give this place 5 stars. Like this place is not only historic","useful":0,"cool":0},"XNWenkL0rj_E18j3bBqGKA":{"text":"Very good Buffett.  It has a New Orleans feel.  This would not be a bad choice if you are ","useful":0,"cool":0},"lUieY9cp2kekSCZKIPPJmw":{"text":"We arrived at 1:30 for Lunch and there were 4 parties ahead of us waiting in the holding a","useful":5,"cool":1},"ZaotKO2D21iIgJUqJzeq0Q":{"text":"When in New Orleans, the lunch buffet at Dookie Chase is a must!  The food and atmosphere ","useful":0,"cool":0},"U4T0cJt8_fcB22s7pB1qoQ":{"text":"Had their buffet lunch.  Very good food.  Our waiter/waitress never showed up, so another ","useful":0,"cool":0},"Iic0qCEnyrWdTx1PQWVsTw":{"text":"the service is great but the food wasnt what I expected. although the restaurant looks rea","useful":1,"cool":0},"3N4q1ZM-hbdfhZ4_9GLiTQ":{"text":"Like everyone said, the neighborhood looks a little sketchy and we had a little problem fi","useful":0,"cool":0},"_U5z283q9vXM3KULzpldJQ":{"text":"Unfortunately I did not have a good experience . The service wasn't good and the food did ","useful":0,"cool":0},"Aic3Q2Hz3GBalVNE5V-4Ww":{"text":"I was pretty disappointed in our meal.  The prices are not justified by the food or the se","useful":2,"cool":0},"Qkg9G39mRT2WSnVEF-WZnQ":{"text":"Literally the worst dining experience I've ever had. I'm not misusing the term. I can't th","useful":2,"cool":0},"Xj9fJPQuf-miFtz0l8fdmA":{"text":"The buffet is generally the way to go here and that will usually let you sample items such","useful":8,"cool":2},"7Rqvj_Wb_37iNuMUwCkygQ":{"text":"My girlfriend and I visited Dooky Chase's restaurant on a Thursday afternoon (around 1 PM)","useful":2,"cool":0},"ZvV4Rciye8UXHk2O8Y2scQ":{"text":"This place was reccommended by someone my husband know. We arrived 30mins before they open","useful":0,"cool":0},"1mhSRsdBvVgxw0CTilxVtQ":{"text":"Love the decor, service, and food.  We had the buffet option - flavorful fried chicken, ma","useful":0,"cool":0},"GblK9IwerHVYZ8f139UXjA":{"text":"A nice place for an enjoyable, slowed down family meal.  The food takes a while, but it is","useful":0,"cool":0},"-1nMB2WUfF-Q8seS8ft1SA":{"text":"\"As good as it gets!\" in terms of fried chicken! Seriously, soOoo good!\n\nI ordered the Red","useful":7,"cool":3},"JkXs2PKqt49ZqYsd8pDhZw":{"text":"Seriously. I missed yet another chance to eat here. They have extremely  LIMITED Hours: Tu","useful":9,"cool":0},"LOjFDCMAe4ikOuiXNzqFmQ":{"text":"Ok, where to begin. To start, as an African American woman who is an advocate and frequent","useful":0,"cool":0},"mzT1soqA4hqIyKkOH222nw":{"text":"I'm giving her four stars for being a successful woman of color. The food is overrated on ","useful":0,"cool":0},"x_7CVagEVyNhixDnqGg2oQ":{"text":"Very good food and a bucket list stop to say you have been there! We arrived at nearly 1:0","useful":1,"cool":0},"bIcm4_fvno1-RPoyfKm2_Q":{"text":"Everything is delicious! Our server, Kayla, is excellent. Personable, knowledgeable and ve","useful":0,"cool":0},"5TiXBhqfSNskqNx9noDupg":{"text":"The staff here are so friendly and sweet! They're very attentive as well. Don't let outsid","useful":0,"cool":0},"Q7qOCFmrmsOPaKuHDM1KNQ":{"text":"I very much enjoyed my meal here. Place isn't fancy nor is the food but it was good. Buffe","useful":0,"cool":0},"TKNNLIMleVHTfE6k635YvA":{"text":"The sweet potato pie is out of this world. Melts in your mouth and it's a nice balance bet","useful":0,"cool":0},"QhJWhKaIKkhViQIlB1qCxQ":{"text":"So Im finally in N.O. when this place is open so I try the lunch buffet. I am stuffed from","useful":2,"cool":1},"1EClh3Mb1t0IuQx5TnFJXg":{"text":"Pretty darn good chicken! And I heard Obama ate here as well.\n\nVery classic old New Orlean","useful":2,"cool":0},"sjK8eNZafUSO2jy01ed3yw":{"text":"We were at the airport location. After reading the back of the menu about all the rewards ","useful":2,"cool":1},"LVyG8sjhoR9jhLedZ4JMJQ":{"text":"I'm really not sure what all the hype is about here and both Uber Drivers suggested other ","useful":1,"cool":0},"zLGDms-tng1viUnSRVkeig":{"text":"This place  the chicken so flavorful and the hot sausage I've never had anything so good. ","useful":0,"cool":0},"keCyEgmMRb56idH1rPaGkg":{"text":"Loved it!!! Six of us drove from Houston and we were not disappointed. We saw a feature on","useful":1,"cool":1},"MHCMgCeuPG5tTbjU_MMQFQ":{"text":"An absolute must for amazing Gumbo! \nI would recommend calling ahead for reservations if y","useful":0,"cool":0},"iqJC4YJpOHypdocU0cO_gA":{"text":"I was really looking forward to dining here because I've heard so many good things about i","useful":0,"cool":0},"9zKVFTPUzX2vRO2t6n5dUw":{"text":"We were so excited to go to Dooky Chase on our last trip to New Orleans (May 2018). We tho","useful":1,"cool":0},"B8Gp0P2O2a_XvN1_iidGOg":{"text":"This was such a great experience within the Treme'-Area of New Orleans. I had the pork cho","useful":0,"cool":0},"T8UGfErpKFlVMaoKC6rSvA":{"text":"Gumbo was the best I've ever had! Buffet was a big disappointment. The attendance to the f","useful":4,"cool":1},"ObjglyFQOIQl9ykbaQiNrA":{"text":"Decent food.. fried chicken was excellent! Everything else could have been better. Solid e","useful":1,"cool":1},"k-r5ejHbukmeLsq2FJkq7Q":{"text":"This is just such a special place. It's not just a restaurant or art gallery but really sh","useful":0,"cool":0},"f9XQcOYAqkgjjeveEwHT7A":{"text":"The buffet is a great way to try a few things from the menu. The red beans and rice were o","useful":0,"cool":0},"ObspDs2ZVWexMqD1TtU_AQ":{"text":"Must go to because, it's a landmark. Definitely make reservations and try to go as close t","useful":0,"cool":0},"NOmKkWPO1T5vKvlmsGKnIA":{"text":"Service was horrible! We got there at 8 on Friday and it was packed, we got water and then","useful":1,"cool":0},"8jBTc6VM0e0fO4LxgqoXcQ":{"text":"All the hype about this place. I was really disappointed. We had the buffet waited forever","useful":3,"cool":1},"ktCN_3RGFG4VxLyez1rtxQ":{"text":"It's the Friday after Mardi Gras. Got here at 6:30. It is now 8:15 and we have yet to be s","useful":1,"cool":0},"2kh5IsyUshzVHwArT_OgtA":{"text":"I love a place with alot of history and this restaurant certainly has it. It opened in 194","useful":19,"cool":4},"r-2xwzVx-BmbDlA5hNSd2A":{"text":"I'm from out of state catching up with friends. Really wanted to come here. So much so, th","useful":3,"cool":1},"bZnIh0fw5DZbSmXyUqlyBg":{"text":"Was in town back in September...missing my sunshine, and that itch to eat some Southern Cr","useful":0,"cool":1},"FKAysMb0t5uOEvb3M6yhiQ":{"text":"Four months now planning my friend's 40th birthday we were so excited about coming to this","useful":1,"cool":0},"JRW8-pB3u1yXzXbxEweXMw":{"text":"Food was amazing, especially loved the red beans and rice and praline pudding. However ser","useful":0,"cool":0},"wHDj4X2QJGPKcNTpTR56lA":{"text":"The best spot we have visited so far in NOLA.  We had reservations, but missed it by two h","useful":5,"cool":3},"qzGhSP0fy1qCd6XpC-joRA":{"text":"You have probably seen Mrs. Chase on television before so she has local celebrity status w","useful":7,"cool":0},"QdC8xJ6pOTamI4ECDem3Ww":{"text":"I had the gumbo as an appetizer which was the best gumbo I've ever eaten. I will never eat","useful":1,"cool":0},"aJhreosOFZ1hk5jpPsrbKg":{"text":"I was with a group of women who decided to eat at this restaurant based on word of mouth f","useful":1,"cool":0},"L18nG3WTnOAegbgId0fv9Q":{"text":"Worst restaurant experience of my life. Our waitress Keshawn is a terrible waitress. She h","useful":6,"cool":1},"zfkTvFSbxkSVaFeYLCyBMg":{"text":"Let me paint a picture for you. You have reservation for 4 people at 8pm. You show up at 7","useful":2,"cool":0},"Rq4k3b5v1Nvqvy7drMakBQ":{"text":"We were visiting New Orleans for a family reunion and had one of our family dinners in the","useful":0,"cool":0},"ZN1MAYB0t72VMnRE9MpTWg":{"text":"I love this restaurant! Ms. Chase is a lovely woman and I cried when I met her! She's a be","useful":0,"cool":0},"yfpgFMGnoshhphrcCEDOWg":{"text":"It's Dooky Chase so you gotta go. It's an institution. Otherwise the food is okay so don't","useful":5,"cool":2},"655nzScDvePosdxMI4qmRQ":{"text":"Some of the best chicken, greens and Mac and cheese. Love each visit we make here. Had a p","useful":3,"cool":1},"xA_3ezQMK8iCvhSvHZ7MTw":{"text":"So much family history and so many reviews, had such high hopes for this place but that al","useful":4,"cool":0},"CFy3ckuup5ADUtpDTme_Fw":{"text":"Cute place, good service and excellent fried chicken. My other sides were good, not great ","useful":1,"cool":0},"iCSy0iuRGhW3WgcYR47TDA":{"text":"I was there first time to visit NOLA. I made plans to have lunch here before I go. It's wa","useful":0,"cool":0},"z1vBUfHxPVsQRo0JXU5V1g":{"text":"Where to start... This was essentially my first time in New Orleans and I heard I needed t","useful":0,"cool":0},"5OORhsvOXDd1DwUxoKpfhg":{"text":"My daughter and son in law were in Alabama this morning, November 1, 2018, heading towards","useful":3,"cool":0},"Q3QNVs2foxEt5KWVCP-H6A":{"text":"I'd been waiting many years to try the food at this restaurant. My friends and I had the l","useful":0,"cool":0},"IJ0-3wWuungIXiQ1AK-8Rg":{"text":"The exterior of the building looks a little rough but the food is awesome! The greeter and","useful":0,"cool":0},"sUUxIiOhMdlxCBP9CSkXDw":{"text":"We had a great time. The food was delicious! They have a lot of New Orleans style decorati","useful":0,"cool":0},"_-fmiucpshPgMqMYBxTaJg":{"text":"Meal was delicious! Stuffed Shrimp  is the bomb and Mac and Cheese has soul! Gumbo is mult","useful":1,"cool":0},"elk6WZ5KRs41z1a4FNj88g":{"text":"This place defines comfort food. Perfect fried chicken, mac and cheese, salads and numerou","useful":2,"cool":0},"BDfI5A84MpVwbC9co34LSQ":{"text":"Perfect! Mrs Chase and her staff treat you wonderfully! Best food in the entire world! The","useful":1,"cool":0},"2SEIhTNdGPuHXtICtEP90Q":{"text":"Food was very basic. Can't believe this is considered New Orleans food. The service was aw","useful":1,"cool":1},"achjnsEel-3zUGYFheobqQ":{"text":"It was pretty good! Of course we waited about an half hour to be seated. The fried chicken","useful":1,"cool":0},"mIladkzICT1_q44chG5Bhw":{"text":"Going here i had shaky thoughts about this place. I was anxious. I have been trying to get","useful":7,"cool":3},"2_ub_GNW1wlXplMqgqj-aw":{"text":"I had high expectations for this place. The historical significance was something I was mo","useful":0,"cool":0},"AZ_a8TZ5Th_O8fOTZ10VBA":{"text":"Great service! Very attentive food is good! Buffet style and you can order from the menu. ","useful":0,"cool":0},"gzTuHeRf6iMVG4ecmOBEZA":{"text":"We heard great things, but we were highly disappointed. There was hardly anyone there but ","useful":0,"cool":0},"u5KEJ_wEoQXBJaxU5kGvKQ":{"text":"We had great bar service.  I recommend the Dooky Rum Punch. We are of the lunch buffet. Th","useful":0,"cool":0},"vJOh26O_sdA9XG-5jWZgww":{"text":"Okay. This is crazy. I came by here and another well known establishment a stones throw aw","useful":4,"cool":3},"zc7tDxuemRVUvQbhf5B_mg":{"text":"Came here Tuesday morning around 10:45am. The place opens at 11am. Wanted to check Dooky C","useful":5,"cool":1},"akglx6RcksY9b5Wjh8eifA":{"text":"Very disappointing experience. Went there with my family of 4. Server took drink orders wh","useful":0,"cool":0},"dDNn3VvdCxeRGdqdUudYQQ":{"text":"Friendly basic family restaurant but I loved the fried chicken, smothered pork chop, cabba","useful":1,"cool":1},"bMo17GBMUevMmX74Irt6VQ":{"text":"Great fried chicken, veal stew and sweet potato soufflé .  Awesome atmosphere and ambiance","useful":0,"cool":0},"oBbbLFzlhE-SU_GxdVk64A":{"text":"The gumbo here was phenomenal; it was easily the best gumbo that I've ever had. The soup w","useful":3,"cool":2},"dzxyFGqtkELR8KWN16D_Bw":{"text":"Flew into Nola from NY and I have to say The food was good! Service was great and we enjoy","useful":0,"cool":0},"6mEkQoyoi1tMPbsb8byUbg":{"text":"Be prepared before going for lunch. Hours are 11-3 and if you're after 11am they wait coul","useful":0,"cool":1},"8oHFY4raU1eLGG17GrF3Yw":{"text":"What a disappointment. We finally find this place so far off the beaten path. To be greete","useful":7,"cool":1},"Uks1OBhSq5MYg4CDNmz50w":{"text":"Life-changing. Seriously, THE best food I've ever eaten, hands down. I've fairly picky abo","useful":0,"cool":0},"i7bO7isyit6PCbW9AhAXHg":{"text":"We came late in the Afternoon so the Buffet was a bit sparse, but what I had was very good","useful":2,"cool":0},"4_XN45xm___2csct9085yg":{"text":"So this was my family's 2nd time celebrating Mother's Day in New Orleans and trying this r","useful":1,"cool":0},"ebblNv4c_tj6ceNZm5aR1A":{"text":"An iconic spot for sure! The staff works so hard and are all very, very warm and genuinely","useful":1,"cool":1},"zwV8_Rx1Dm2ck4iCuK3d3Q":{"text":"Stopped in for lunch.  My bff had the buffet which included fried chicken, bbq pork briske","useful":0,"cool":0},"aF8P-GnJAisQo_tfQShNAA":{"text":"This was not a good experience for myself and my better Have we arrived at 7 o'clock with ","useful":2,"cool":1},"5OroJUPs36ic1pt7l0aFMA":{"text":"You have to go to dooky chase because it is dooky chase.  Historical landmark.  do some re","useful":0,"cool":1},"oRNkUGPZOC-rmqqm01nRqA":{"text":"Loved the atmosphere in Dooky Chase's! I came here this year with a few girlfriends as the","useful":0,"cool":0},"dXaQZ9ziaRFCCFQZqzf2kQ":{"text":"Love this place. The service was great and the food was excellent. Give a true sense of au","useful":0,"cool":0},"iJBghVNcFGXFze1twuxB7Q":{"text":"I've eaten here a couple of times and have yet to be impressed. It's okay food. I do love ","useful":3,"cool":0},"pbIEgyK4XhAWk6p3Q6w1Ww":{"text":"Pros: \n\n- quick service if you show up when they open.\n\n- had the fried chicken. Well seas","useful":0,"cool":1},"7wum0-BwQ865tvEXt6F6Pg":{"text":"The best and most historic restaurants in New Orleans.   The food was fantastic and the se","useful":1,"cool":1},"Wv1yhPu-O6UR8Mz43KHc9w":{"text":"I was interested in trying the food (gumbo) that was spotlighted on Diners Drive In and Di","useful":0,"cool":0},"fNAKubNPmXvW4d8ZwN0BEg":{"text":"I'd heard so many good things about this restaurant and was really looking forward to home","useful":0,"cool":0},"oF5YB9Qg65JHUIh93zD3mA":{"text":"This place was the best! Great food, atmosphere, and service. No half stepping here. Our w","useful":0,"cool":0},"vnON_ehoB3G8juVdcHT05w":{"text":"DO NOT WASTE YOUR MONEY. The food quality is subpar for the price and the wait is even wor","useful":5,"cool":0},"I6TwJfOjfWtHpTumcjGuVA":{"text":"the only reason i'm giving this three stars is because the bus boy named Terry was the mos","useful":3,"cool":0},"pwlcLmOLTNE_P--SCK5tQw":{"text":"I was amazed at how many \"famous\" restaurants have  red beans with no smoke taste, andouil","useful":0,"cool":0},"D5NWxcQY8FnaaSWlQnCw_A":{"text":"Quintessential New Orleans restaurant that's been around since 1941, and now run by the ch","useful":10,"cool":7},"hNn6YxSob9RZ8eVmOZZByQ":{"text":"Had lunch while in New Orleans. Husband had buffet, I had stuffed  shrimp. Both were good,","useful":0,"cool":0},"Cs8FHruMM-4aGZRgRjHVYA":{"text":"Customer service was great the food, Meh I've had better. I will say the highlight was the","useful":0,"cool":0},"DXoljhcBWj5KucS5sBGijw":{"text":"This is a can't miss in New Orleans. Quite literally the best fried chicken I've ever had.","useful":1,"cool":0},"ak4AyaTbsWduZTa7v9brCw":{"text":"Classic creole cooking in the heart of the Treme. Amazing house cocktails like the Mint Ju","useful":0,"cool":0},"vLhfzgEFrYP52PuJPWvnFQ":{"text":"We were visiting from Los Angels, Ca. This place is amazing... Black owned family business","useful":0,"cool":0},"O0cpAuPUlhRExXBhhx8Ahg":{"text":"BEST fried chicken hands down!!  Definitely must try the gumbo too!!  Almost as good as gr","useful":3,"cool":0},"P2S0SLXfT7N2cZhEcb4oBg":{"text":"I'm giving it 3 stars because i expected more. I came for lunch on a Friday, and my party ","useful":2,"cool":2},"p9g1H0VG0hRuL6aM7zeFOw":{"text":"Having lived in the NOLA for years, I never ate here (how did that happen?). The staff her","useful":3,"cool":3},"Sl74b34gw_03cSvf5qOxeQ":{"text":"We went for the lunch buffet when we were in New Orleans and it was excellent.  This is an","useful":0,"cool":0},"yKt7Z41l7lfXjTAqF_oBYA":{"text":"Every local we talked to during our stay in NOLA told us to go to Dooky Chase so on our la","useful":3,"cool":0},"l_a9ZihJan6bst5fiGV2Bg":{"text":"Had lunch today and it took 45 minutes to get my mediocre food. I was brought different si","useful":4,"cool":1},"utKJYPJsBw8tuhRYxMcjxA":{"text":"One could call this place a diamond in the rough. Located in mid-city, the surrounding nei","useful":11,"cool":5},"7YNrjf5EK9b6bUSzNXFmbA":{"text":"I would give this place 3-4 stars. My friends & I wanted to eat at Willie Mae's but it was","useful":2,"cool":0},"2Q6Pmvnn6qDxakQojjex1A":{"text":"Delicious fried chicken. The lunch buffet is pretty extensive but I don't really like seaf","useful":0,"cool":1},"P1n8YFMEprHUC_McsN1gpQ":{"text":"My sister and I visited from Washington, DC. We arrived 15 minutes before they opened (in ","useful":0,"cool":0},"E0hK_OqPZTUGcrDGPjF7nQ":{"text":"Visiting from out of town and we have been hearing about this place since we touched down.","useful":3,"cool":1},"_8AND3DcGES4Dr7Sf_-0hQ":{"text":"It's a great place to food that is the heat of New Orleans. I had their fried chicken , an","useful":0,"cool":1},"jnlt0dyPe7Fj0Jo-eiN1OQ":{"text":"Dooky Chase definitely lives up to its hype. Since it's a very popular place, there was an","useful":0,"cool":0},"KLfPA27feBLdi0BVr1AiBg":{"text":"My first time to New Orleans.  It was recommended to me by a friend.   Not disappointed at","useful":0,"cool":0},"YxvYbjn1yB9g_x6H_4NNIg":{"text":"Want a touch of class, history, and some great food?  You must visit Dooky Chase's Histori","useful":3,"cool":1},"pHK5E2dwkfHicVOoyEfaNA":{"text":"This place is fabulous. The food and service is top notch. My whole experience has been ou","useful":0,"cool":0},"X61a6i46inWbQmuNovWixA":{"text":"Number one restaurant I wanted to try. I came here from out of town and as soon as we ente","useful":1,"cool":0},"3wz1PU-MesU8-U7fDTJKAQ":{"text":"The food here is great. I will definitely be back next time I'm in town. Every thing in th","useful":0,"cool":0},"yI_DlUTIJRy8wGtxVAhv5w":{"text":"Food mediocre. Service also very bad!! we waited 1 and 45 minutes to get our table.. when ","useful":0,"cool":0},"A5mROkDSYLljXhHzWmQ9fA":{"text":"My family and i ate the buffet. We also got the stuffed shrimp. We really enjoyed everyyjo","useful":0,"cool":0},"UNuKNynr3pwwh3iUumF3sg":{"text":"The place is very clean and elegant. Me and my wife had the buffet 19.99 per person. They ","useful":2,"cool":0},"ACFohCcTW5r-ArrbQwCWOw":{"text":"One hour wait, but it was worth it.  Had the lunch buffet offering all the best southern f","useful":1,"cool":0},"Dhdb7EfLMRy0F7Chyt6btQ":{"text":"I was so excited to try Dooky Chase's because of the connection to my favorite Disney movi","useful":0,"cool":0},"XDIwCjoxTtA2cqYiEFQ6-Q":{"text":"Best buffet was on Friday since it included Seafood. Customer service was excellent and th","useful":0,"cool":0},"wcD-sYVYS9EhIEpZnwOdjg":{"text":"Food was okay. I had shrimp creole and it was just alright. The portion size was kinda sma","useful":0,"cool":0},"EDRiJ3QCmo7v8Ev9Wpf_MA":{"text":"Dining at Dooky Chase was an exciting and heart warming experience knowing the history beh","useful":1,"cool":1},"UATLApNA1NtClOs3rjSYIA":{"text":"Visited Dooky Chase's as a part of three days spent in New Orleans. We arrived by Uber for","useful":1,"cool":0},"KLnO8RZlnl_OQjKSaSB2Pg":{"text":"Beautiful. Simply beautiful. Lovely paintings, tablescapes, and ambiance. They offer menu ","useful":1,"cool":1},"TfiO2z8oZ0I23SZpjVohFA":{"text":"My family came for Thanksgiving. We made reservations for 11:00 on Black Friday. We were s","useful":0,"cool":1},"XZRc6XD9Bwz08uS-CGdGdw":{"text":"From the initial greeting to the final thank you and mint grab, this was more than eating ","useful":0,"cool":0},"Uidb94WfCB3AXoqshcqPrg":{"text":"I really wanted to like this place. I visited with a group of 7, all of us choosing the bu","useful":0,"cool":0},"uZs8h2yywc73ZZaoyMR5Cw":{"text":"Seen this restaurant on the travel channel and figured we should stop and see what the fus","useful":0,"cool":0},"NkzMn2jUi0ewtrNL1eo46w":{"text":"Great and wonderful food at an old school restaurant!  I loved the art, the wait staff wer","useful":0,"cool":0},"Q0svlY1_1GksihKaxsBvgg":{"text":"Absolutely delicious and amazing Shrimp Creole! The hospitality and service is amazing, th","useful":0,"cool":0},"n9VLFVR00aIKvPaR1Njm5g":{"text":"I had two places bookmarked to try in the Treme and obviously one of them was Dooky Chase'","useful":9,"cool":4},"a9wpcKm2wSXONzi5PFXmPA":{"text":"This is a historical restaurant.  I went there for buffet lunch.  It was good.  The fried ","useful":1,"cool":0},"XJlhtYqrP-dr6LQhj6_Duw":{"text":"First came here in 1986.  Some of the best gumbo you will ever have.  Awesome fried chicke","useful":0,"cool":1},"YO5P7qlPEueQ62TYsiiMlw":{"text":"Very good food.  For some reason Creole food is expensive.  We weren't rich and Creole  cu","useful":0,"cool":0},"SYsEMHzto97tNgXDUeJPcA":{"text":"Nice dining room with a relaxed atmosphere.\nVery good gumbo with many flavors interminglin","useful":0,"cool":0},"AEZcifEtSM0_TMDGfR3E7w":{"text":"Could not wait to come! Planned to end my trip off with the lunch buffet. Very disappointe","useful":2,"cool":0},"vbfvLf98FwEy2MP6Y2KMyw":{"text":"Buffet. - Every few months I drive to New Orleans for a couple days just to eat at nice re","useful":3,"cool":0},"qjrv-0mXafN_g0f_UmV44g":{"text":"I came because it's a historical staple in New Orleans. I assumed the food would be great,","useful":2,"cool":1},"SP-WFoCXb_uUTy0Kg1G03Q":{"text":"Simply stated, AWESOME!!!!!! Great good and great people. Go and treat yourself, the gumbo","useful":0,"cool":0},"y0qhGc19uLyEVL_rvwuuWA":{"text":"While most people wouldn't venture to this part of New Orleans they should. Get out of the","useful":1,"cool":0},"x45QnYeMzXX43yMHKdEWrw":{"text":"I've been coming to this restaurant for years!  Food is still 5 stars can't go wrong with ","useful":0,"cool":0},"wLA9qYq6d0OAkuorW-lndA":{"text":"Was able to get in for an early dinner on Friday night. My boyfriend felt under-dressed be","useful":0,"cool":0},"GA7LEwFtKn9oBW1WMm9vvw":{"text":"Great food and great service.  Ask the waiter what's good--they won't steer you wrong.  Th","useful":2,"cool":1},"Ny_1K_MYAHzIPgSMbxRayg":{"text":"I just love everything about NOLA so I may be  just a bit biased when reviewing their rest","useful":1,"cool":1},"NPG67cY6L7IbngprbJEuWA":{"text":"I love this classic restaurant. It's everything you imagine before coming to New Orleans. ","useful":2,"cool":1},"sQDJC1zFSdYeKEvhTojI6w":{"text":"I was soooo excited to eat here. I even made reservations to ensure we would have a table.","useful":4,"cool":1},"sSlF6PyB0V15O5ouKIHfVg":{"text":"Amazing...best fried chicken I've ever had!  Greens were amazing, as was the peach cobbler","useful":0,"cool":0},"-vLxg23B_l7eWMk78ZYcXQ":{"text":"The buffet includes their famous fried chicken.  Let's get right to the chicken - it may b","useful":1,"cool":0},"pFv_vhcohaI3-7Bn7mwJ4A":{"text":"I would love to tell you how wonderful the food was, but I never received my order!   The ","useful":21,"cool":3},"OSPGtgpc0LUUc6Vv-oEg9Q":{"text":"Everything was great and the buffet allowed me to try everything I wanted. I like the way ","useful":0,"cool":1},"e30C2Pf7C8VZNkkElqGXJg":{"text":"Wow, where to begin. Both the food and service were beyond underwhelming. After much resea","useful":5,"cool":0},"GQoeNR1LY8syw8bHyVUN-w":{"text":"It lived up to all the hype... If you go plan to wait unless you get there when they open.","useful":0,"cool":0},"Vfjd1hrQATdjONuXOe0lpA":{"text":"I had the pleasure to visit the Food City New Orleans the past week.i couldn't believe how","useful":2,"cool":1},"VNPVwdXCHgzRISBeYQ_TOg":{"text":"Let me start off by saying, The peach cobbler is life-changing. On first taste It made me ","useful":15,"cool":6},"2YxWmpyHcRMfV0Q_6asWLA":{"text":"I made a point to visit Dooky Chase on my visit and I'm sorry I did. The food was terrible","useful":0,"cool":0},"e4GpbseRoP1wn6LxZ05r7A":{"text":"There's a to go window if you go past the bar on your left to the green room. Willie Maes ","useful":4,"cool":2},"GHgNEf_4xrO3CDRoJQnZeQ":{"text":"We visited here on a Friday around 130ish. My husband had heard about the legendary Leah C","useful":0,"cool":0},"_DorNnwJZ7Rheiqf3zyprg":{"text":"I was so impressed at the wonderful service. Our food was great\nCatfish, chicken.  Peach c","useful":0,"cool":0},"sASZ9A0AYUQzyFEfS3nBOA":{"text":"Love their Gumbo!!\nGreat reau and thickness, taste and texture.\nGood crab, sausage and hug","useful":0,"cool":0},"AMdlt6ibbUmSOdfEA8AurA":{"text":"Waited about 30 minutes for a table at 12:30 on Wednesday.  The staff were extra warm and ","useful":0,"cool":0},"qgVDdTyp21qhqHOhDxN0gw":{"text":"I think I am suffering from a bout of home sickness, but I am really craving some Creole f","useful":2,"cool":1},"tMy66g9qGcnbv3B3VHQhrw":{"text":"Every time I'm back in New Orleans I have to come here and bring my friends. It's always d","useful":0,"cool":0},"eeS5tY3wSw2xoVtC1fwCcQ":{"text":"Went for lunch buffet on 2/20/2019. The buffet was very small for the 19.95 I paid for. Th","useful":0,"cool":0},"4j0zmAxL7ewXStLl5TGO7Q":{"text":"I came to New Orleans expecting some good food. I heard about Dooky Chase's Restaurant and","useful":0,"cool":0},"f9Gee600ZpxCKzt5CZ8lsg":{"text":"My experience Friday night (8/24/18 @ about 8:00pm) at Dooky Chase was not a good one At A","useful":1,"cool":1},"UBsOrbPBUQa06kR0hkYl6Q":{"text":"I'm not sure how it happened that I haven't been to this spot since it reopened, post-K. B","useful":17,"cool":13},"_YWX6_OgHDCPy2gdh8XjSA":{"text":"I'm glad we ignored the rather low-star ratings on Yelp because we enjoyed our experience.","useful":2,"cool":0},"8veGTGA7rpQ36W5Wr_meSg":{"text":"Awesome food, we had the buffet and we're really impressed, beans and rice, chicken stew a","useful":0,"cool":1},"JhI9qy6bONt8oQnOdwXA1w":{"text":"This was my favorite all you can eat restaurants in New Orleans! The food was great the se","useful":1,"cool":0},"M5GCX6DDrXb_pdnVTsH87A":{"text":"Service was awful food lacked seasoning. Won't be back!","useful":3,"cool":1},"XuqTWuhK-p9CGkCHAsDRZQ":{"text":"This is the worst food ever.  I would not waste my time eating here -- first of all the  b","useful":0,"cool":0},"0dk5-y9cHk1D5YSjejJWHw":{"text":"This restaurant is built on its history. Many former presidents have eaten here. You'll se","useful":1,"cool":0},"U5RHYoGGF1k36-I_P4W7Uw":{"text":"The catfish is lit. And the shrimp creole too. Waitress was cool about sharing food from t","useful":1,"cool":0},"3lFijIa_Hz-mCYQ3I9YYpA":{"text":"It seems pointless, and a little silly to review an absolutely legendary New Orleans resta","useful":1,"cool":0},"CIPUnOfHy0JunYRSGqjwQg":{"text":"Found out about this place from Michael Murphy's book All Dat.  We were told it personifie","useful":0,"cool":1},"2LZeQp1Fe3JKo72p75FL7Q":{"text":"We went in on a Friday for dinner - I would definitely recommend making a reservation prio","useful":1,"cool":1},"H4A3lWOK9cUK9ZhS4tUdcg":{"text":"Dooky Chase was slightly disappointing. The food is not all that. In fact I think this pla","useful":1,"cool":0},"vnzb2qcevSUO6PQVEw32vQ":{"text":"We were on a cross country road trip and stopped at New Orleans for good food and music. W","useful":0,"cool":0},"YxgadSnTJK39V9nNlXhqzw":{"text":"I was on a business trip, but had to stop by, based on rave reviews here and from a friend","useful":0,"cool":0},"Li8E2KXmhgdKb8NflnQ_ZA":{"text":"A New Orleans staple.  However, my recent experience left me wondering if maybe they're co","useful":2,"cool":0},"97P-s1v5m3WqedwYLAxCUw":{"text":"Food was EVERYTHING we imagined!  Portions were great.  Food was seasoned to perfection an","useful":0,"cool":0},"BpfUsYlpG1D_1mPQQgZ0AA":{"text":"So this trip was planned before chef owner Leah Chase passed a few months ago.  I've been ","useful":2,"cool":1},"1efXVsw4iaR4mK8UgktyLw":{"text":"I read about this place so knew I wanted to check it out. It didn't disappoint. We had a s","useful":0,"cool":0},"hoCR0BMCBm0iFnpWdaxkNg":{"text":"I honestly came here because of the hype. My first attempt to eat here a few months prior ","useful":0,"cool":0},"cIy5p_bOF8C3Tkh9HhtS5Q":{"text":"Went to New Orleans for the first time a week ago. I knew I had to come to Dooky Chase's. ","useful":0,"cool":0},"nObZ-pN6Sv6Xq9rPkdgxoA":{"text":"The service was amazing. The brunch buffet was fantastic. The food is not as spicy as you ","useful":0,"cool":0},"1iO6fG2gTb6ViGzLEs53UQ":{"text":"Food was not good at the airport location... Macaroni.. Chicken was dry. This apparently w","useful":0,"cool":0},"iYQThI2Kztht53D7QaxwbA":{"text":"Only a fool would pass by the chance to eat at this deservedly famous and tasty restaurant","useful":0,"cool":0},"-TyngHfSmbBkp6rBEZp3RA":{"text":"I'm not sure why this has as high of a rating as it does.  It is built on lies! The food i","useful":0,"cool":0},"2wwBD3aLPdVuoQ1EoXmzOQ":{"text":"A lot of patience is necessary when coming to this establishment. \n\nThey have a buffet for","useful":2,"cool":1},"_EaJNFjAFPn75P5R_K6QcA":{"text":"Went here on a Friday 10/27/2017, just as they were opening with a party of 7. The hostess","useful":1,"cool":0},"kaK4hmm5T0Yf3V-x2BkUrg":{"text":"Great food and service in a classy restaurant.  We had seafood gumbo which was perhaps one","useful":0,"cool":0},"9Vnm3wzikmQ_dp6Pq-PrIA":{"text":"I made reservations for this location and when I arrived to the location, there was a secu","useful":3,"cool":0},"v4Amb7DzO1Kbaz07Yjr4Wg":{"text":"I honestly had the best smothered chicken I've ever had in my life. I felt like the food t","useful":0,"cool":0},"mw5pplRBcpzaY-P1j9IR_g":{"text":"The history, the food, the service all five stars! I was so excited to be able to visit Ne","useful":3,"cool":2},"olKuNXiJSB0L6Fv-PfY3Lw":{"text":"Food was good but the MAC as too watery for and tasted slightly processed but everything e","useful":0,"cool":0},"7iZlHuBRPvxdWkIfwv20Sg":{"text":"Extremely disappointing. One othe worth experience in New Orleans.  \nBy reservation only. ","useful":7,"cool":0},"-Gdi8b13IeP9fKekaTJzbA":{"text":"I like the building and Buffett. Check it out if you get a chance. The fried chicken is go","useful":6,"cool":1},"QcttNg2aFA6Ji6_Zp-o-Vw":{"text":"In my top three restaurants ever! Every single thing was delicious and perfectly seasoned.","useful":0,"cool":0},"YjfKWn9zhk50fhu_dXxVCA":{"text":"More like 3.5 stars, but closer to 4 than 3. I kept reading about Dooky Chase's when I loo","useful":0,"cool":0},"3Lb9IhfMMmYK5_A-f32lfQ":{"text":"About a 45 minute wait for us in the early evening. The service once we were seated wasn't","useful":3,"cool":2},"9IJLRevYjclx-2g6q4-nsg":{"text":"My significant other and I really enjoyed the food and artwork  this establishment has to ","useful":0,"cool":0},"9PoGSPCzgUx2fjK9xMU84g":{"text":"Dooky Chase is right across the street from Willie Mae's restaurant - two of the most hist","useful":3,"cool":0},"GqmgbAj8eUl_VmfAQF_uQA":{"text":"Dooky Chases's is a family-owned New Orleans institution dating back to 1941 and has been ","useful":0,"cool":1},"1jFn3lfVbe1cJBzp0qRMlg":{"text":"I was too excited to eat here. We were able to make reservations a few hours ahead of time","useful":0,"cool":0},"Nmf-tfbAET-aIPxZWRZmLg":{"text":"Let's start with the positives: service was amicable and the atmosphere and decor were com","useful":5,"cool":1},"5186ousQlHtrYe9llU4dOg":{"text":"We came here on the recommendation of a family friend!!!! It's his auntie cooking and he's","useful":3,"cool":1},"iw3uKBRNJnSjvghAufPh_g":{"text":"Finally! One of the necessary stops while in New Orleans. We got the lunch buffet featurin","useful":1,"cool":0},"ElwnvP1S-yVA0C968cT48A":{"text":"On a recent trip to NOLA, the only thing my traveling companion insisted upon was that we ","useful":6,"cool":1},"C8Z-eSZSdXKGyqSWb3rgnw":{"text":"Outside not the best, but the inside is worth everything! I even got to sit where Presiden","useful":2,"cool":1},"R3Q57LeQeSumL4t2axaOdw":{"text":"Everything was good. Service and food (chicken, gumbo, yams. Mac and cheese, lavender lemo","useful":0,"cool":0},"cwOHbcJqmZ6eEG_R0gr5qg":{"text":"I'd first heard about Dooky Chase on Top Chef, but as I researched places to try while in ","useful":16,"cool":8},"-4vp43Tt-9z5IaHorL7MKA":{"text":"We stopped at Dooky Chases in the airport this morning before our flight from New Orleans ","useful":0,"cool":0},"-mE3yEsxfFeK3Z_jCZPxQw":{"text":"I had been to New Orleans quite a few times and been wanting to try this place, well today","useful":0,"cool":0},"1rXMQMOhubZWaNab1vv5XA":{"text":"This is a New Orleans icon. The food is fantastic, the atmosphere is great, and the price ","useful":1,"cool":0},"MaYCK-wcTf92RgkDFlnzww":{"text":"It is a real pleasure when an iconic restaurant lives up to its advance billing.  Everythi","useful":0,"cool":0},"vkGbHoLq7ylvZUtKCt1DVw":{"text":"For years, I had dreamed of visiting New Orleans and eating at Dooky Chase's. The Treme re","useful":29,"cool":16},"zwfhCiX6Rpai6fzW65C7RA":{"text":"Their fried chicken is, hands down, the best we've had ever! Both my hubby and I are prett","useful":1,"cool":1},"MaIcHlR_2krXKQz5Kyr4HQ":{"text":"Dooky Chase's is such a staple restaurant in New Orleans. I was excited to finallyyyyy try","useful":3,"cool":0},"Ys22lqOzFEANbS9A5IcasQ":{"text":"Amazing New Orleans food! A must eat destination.\n\nMy favorite time to go is for the lunch","useful":4,"cool":1},"mKVgPSYEYQvkJfZCJPNS7w":{"text":"Best fried chicken, yummy Mac and cheese, kitchen sink gumbo had everything you'd ever wan","useful":0,"cool":1},"7vNWFfkhU8z2QMEOXujOLQ":{"text":"This is the place in New Orleans......It's a splash of elegance's, mixed with a family ori","useful":1,"cool":0},"tuvsjZqzsAXg1R6JBfQ76A":{"text":"My husband had been talking about his place for months before our trip. We weren't able to","useful":0,"cool":0},"fCeEa1Lu0sXBqH6FCuAjgA":{"text":"So it went down like this. I, like apparently every other tourist who wants to have \"real\"","useful":18,"cool":7},"t-s5XTcHZo-sffwJLNsdwQ":{"text":"This was my first time here, and certainly not my last. I'm so thankful to have shared thi","useful":2,"cool":1},"12eU_DgPiEa-jpk4qgG8ng":{"text":"Fried yard bird.  The lobster of the farm.  Done better here than almost any other NOLA jo","useful":0,"cool":1},"xPM2IhB7bHjV8ENk0OfNCA":{"text":"Not the best experience as a visitor.\n\nWe made reservations, when we arrived quickly seate","useful":2,"cool":0},"Aooe_pR6Ry4qEj94XRyPHA":{"text":"Horrible service. If the food wasn't good this would be closed. Had to flag down a waitres","useful":0,"cool":0},"7je5t9QSUzHc898_9t58sQ":{"text":"Came here at the end of August for some southern dining. Food was good but the hostess was","useful":0,"cool":0},"V3OU8PaQOxivD3aD1cZkLw":{"text":"I fully understand the very poor reviews due to service. It flat out sucks. Big time.  Pro","useful":7,"cool":1},"il4ZMSqtQ6r_DoOm7bxU5A":{"text":"I thought this place was going to be an authentic down home dive with grandma cooking at a","useful":13,"cool":3},"4Z55EFoyhqbb-Tj9BJLe7A":{"text":"Been to NOLA several times and never made it here because of the hours, so this time I mad","useful":2,"cool":1},"pDGBgWkcgsPgfkLIGHIY-Q":{"text":"The food is really good, but the historic location, the atmosphere and the staff are what ","useful":1,"cool":0},"-fjd_LzL-8KxLBS_l4j4Fw":{"text":"I'm only giving them 3 stars because of the nasty service given by our waitress Keyshon. T","useful":1,"cool":0},"IVIEx09jVAG7i42UgP_laA":{"text":"The service was GREAT from entry to exit. The food came out at a decent time and it was ab","useful":0,"cool":0},"syACrY2b9Ug5eMLJONVBLw":{"text":"This spot was recommended by friends who are locals. I can tel you that I was not disappoi","useful":0,"cool":1},"zEywuo0FEQ8_14-zqrWvQg":{"text":"Walked all the way to Dooky Chase about 15minutes from the quarter and they are only takin","useful":2,"cool":0},"4r3R2QyKsVVewgdKnTwo_g":{"text":"Sat for over three hours (waiting + at the table after being seated without eating anythin","useful":0,"cool":0},"RtuYkpoBMPDauONl8MKfxw":{"text":"This place is obviously really important in terms of the scope of influence and history of","useful":2,"cool":0},"TleEaKWF86wVg-zk6Pv4YQ":{"text":"Seems like most lists of the best places to eat in NOLA includes Dooky Chase, so we added ","useful":6,"cool":1},"VmFZh5lb93qarZ2fyD214w":{"text":"(I don't even do reviews but after throwing 60% of my food away I JUST HAD TO!! )\nI was so","useful":7,"cool":0},"sl7XbS3-E9qM19hdqYrBHQ":{"text":"I love this restaurant! It's like eating in a Black art gallery and museum with friends. T","useful":1,"cool":1},"yD778zaNSADyEYce4eol5w":{"text":"Coasting along on its reputation. Sketchy service, decent but undistinguished food (the fr","useful":2,"cool":1},"M10DWdxXRZwdmJxK7vBGvQ":{"text":"I LOVED the decor and museum like vibe the restaurant gives. A friend suggested I dine her","useful":0,"cool":0},"vWfaA_U1orOGx9-HeQZNpA":{"text":"I couldn't dare give them one star just because of the history and reverence I have for bl","useful":9,"cool":2},"yCj2ajJbAxahpWhGl7oRLQ":{"text":"My husband and I had the buffet. The veggies tasted fresh and veggie soup of the day was g","useful":1,"cool":0},"GvrQIGmuD0wLWmNpyvpWTQ":{"text":"I soooo wanted to like this landmark. My high hopes were dashed by both the limpid salad, ","useful":2,"cool":0},"EWbeJXi2A67M1MShFlTqew":{"text":"Dat gumbo! I need it. I want it.","useful":0,"cool":0},"Gm_ApObATzw86MZ5qTrB9w":{"text":"Ate here on our first night in the city.  After doing some research online and with local ","useful":2,"cool":0},"K1xaZgrjJV_J-mnipUf4yg":{"text":"First visit to New Orleans and I had to come here! \n\nThe history! The food! The reputation","useful":2,"cool":0},"F1cSHSdbS-UQizFqAqhceA":{"text":"A place with so much history, I love it! I did the lunchtime buffet with my colleagues. Th","useful":2,"cool":0},"WqbARhW--mPJcgIBvGRm9Q":{"text":"Food is really good, especially the fried chicken! Counter that with stale salad, old toma","useful":2,"cool":0},"HQC1saLsdDZb1Ih6bt7YTA":{"text":"I was so looking forward to eating here based on all the reviews and recommendations and w","useful":5,"cool":1},"WQBCf3D3msRWHsZAvUxE6Q":{"text":"So delicious. I got the stuffed shrimp and it was well cooked and flavorful. The dipping s","useful":0,"cool":0},"hnz-DgEZW6v4G1qyWfjsgw":{"text":"The Fried Chicken here is amazing.  I LOVE New Orleans!  The food is soo delicious and the","useful":1,"cool":0},"S62ur_LCrpgNqkxLgi0lKA":{"text":"Sadly, this was my biggest disappointment from our stay in New Orleans. All of the things ","useful":11,"cool":1},"KetTMfYllN2mne6dRadgmg":{"text":"I wish I could give it 0 stars. I love the history of Ms. Lea and I had to make this a sto","useful":1,"cool":1},"zZ0MScBFgMtm318Imk0_-A":{"text":"Dooky Chase's storied reputation made it a must-stop on my trip to New Orleans, and I'm gl","useful":12,"cool":7},"j_1yvQHq04TkVbCBelDLMw":{"text":"The food was fantastic the best fried chicken I ever had service at 11:45 am was horrible ","useful":0,"cool":0},"ZAWfaafFt8Oseh3VyyIg6A":{"text":"This place is famous for their fried chicken and as expected it was very delicious super c","useful":1,"cool":0},"nICQi0PqG2fX1dWCwg8WLw":{"text":"My wife got what she called, \"the best goddamn fried chicken n macaroni I've ever had\". I ","useful":0,"cool":0},"pC_bDgDRK4Z17k29R18eiQ":{"text":"The food was excellent and the service was adequate. However, our family (29 members) had ","useful":0,"cool":0},"l4DlIMHCelYlDv3Alh7XXQ":{"text":"Went to legendary Lisa chase restaurant in New Orleans , hard to get a reservation. We wal","useful":2,"cool":0},"v_cbplMVNT13b93-TdCKiQ":{"text":"This was an experience I have been looking forward too for many years. I am truly sad I wa","useful":1,"cool":0},"gdGYCHEM29VbxqkO-Me0cg":{"text":"I have heard so much about this place and I finally got here. We ordered the Buffet and I ","useful":0,"cool":0},"V1f6iUS6OPfNuDAMYVQcUQ":{"text":"Ok, this is the only restaurant on Yelp you must go to with a 3.5 rating. \n\nI see why they","useful":5,"cool":2},"DdLmINslFB6RSDzFYixkcg":{"text":"PLEASE MAKE A RESERVATION. I absolutely love this restaurant from the red carpet to all th","useful":5,"cool":0},"5xBUzhjolv5cH2qkJv8PFA":{"text":"A little history with this place is that Dooky Chase was one of the first restaurants to o","useful":19,"cool":16},"r4PQFQ_msQpxk4_XrIBO0Q":{"text":"Only down fall was that we had to wait for fried chicken during the lunch buffet!\n\nProbabl","useful":9,"cool":4},"6BNom5Tuvq3o21Tm_eHEcA":{"text":"We came die Mother's Day and experienced an unpleasant, unprofessional, rude hostess. If y","useful":0,"cool":0},"5S3Dgl5oyVKdmaqGqpbKAQ":{"text":"I made reservations and I recommend that you do too. The restaurant has very limited hours","useful":0,"cool":0},"46T2sZtHyoreIkENG8cc7w":{"text":"Made reservations 4 days in advance for my wife's birthday even called the morning of to c","useful":0,"cool":0},"rBcv47HJKNbSJaQ8OdLASQ":{"text":"I JUST MET LEAH CHASE!!!!!  This is the \"Queen of Creole\" and real life inspiration for Pr","useful":15,"cool":15},"19V3uiP-bNCsedx4jf-Hgg":{"text":"We had a bday lunch here for a friend and it was delicious!!!!! The food was amazing. I ch","useful":1,"cool":0},"F_ALhkk6DkAjQck_dgy1-Q":{"text":"I've lived here all of my life and I can't believe I had only recently tried it for my fir","useful":6,"cool":4},"xMeuzDDhNhCcHfug2t3PVw":{"text":"Amazing food, pleasant waiters! Parking was bit of a hassle and I'm not really a fan of st","useful":0,"cool":0},"ITzj0ju4RpTSccdxBB-gEQ":{"text":"Everything about this restaurant is amazing. From the 5 star service from the friendliest ","useful":0,"cool":0},"ktnWAb32_WVHPMcIlEtVqw":{"text":"Wow this place is a staple in NOLA! We came here based on recommendation and don't regret ","useful":0,"cool":0},"3m8K2kUAmuDkdtTGA6tSJw":{"text":"Imagine if you had 19 grand mothers and all got together and invited you to Sunday diner. ","useful":2,"cool":1},"G4xu6lXXCoSUYc9vYdso1g":{"text":"Amazing place! Definitely a place to go to whenever in New Orleans, amazing service and fo","useful":0,"cool":0},"2XoxaFap-iGPLSflemd6ew":{"text":"It was just ok. Food was mediocre. It was a buffet style serving or we could order from me","useful":2,"cool":1},"4_1b_r1q34Tz8yLEEu6Tdg":{"text":"My friends and I got complimented during several different Lyft rides for putting Dooky Ch","useful":4,"cool":4},"yZ1CqdQxs_cdn6wvoWplww":{"text":"We finally made our way over to Dooky's after talking about it for years.  The food was cl","useful":0,"cool":0},"C7AvhnrpxychR5tEfXl3KA":{"text":"This place is an institution and a Historic African American Family owned business.  I hav","useful":0,"cool":0},"9XSlOrhxbzknQTgCqN581Q":{"text":"came hear for an early lunch.  The staff was so friendly and welcoming , and the place had","useful":0,"cool":0},"37oAyU3rLq2f8GziO08rWA":{"text":"Have you ever wanted genuine New Orleansy food, nothing too fancy, you have guests you wan","useful":2,"cool":3},"2DuxvmhU5yitKxt6X0H48Q":{"text":"Honestly it's just not good. I really don't get the hype. There isn't much seasoning on th","useful":1,"cool":1},"7kOp4fxS2bvdbTjYKzUm_g":{"text":"Did I just come on a bad night? Everything was disgusting. Every. Single. Dish. Fried chic","useful":4,"cool":0},"Jr5Z-3YklqUn_NWPNqm0fQ":{"text":"I really don't know where to begin with my review on this spot. My husband and I have spok","useful":2,"cool":0},"EPjtMULntgLfECeO7VRgwg":{"text":"I didn't know much about Dooky Chase other than that I had to go. When I got here I wasn't","useful":1,"cool":0},"NrPwohaxQ6IldNt9062Cuw":{"text":"I had the pleasure of eating here when I visited Mew Orleans. The food was nothing short o","useful":0,"cool":0},"-LjMxo_Ru-PJ4ru2YkBSww":{"text":"Ate here for the first time and I was highly impressed! Tried gumbo for the first time her","useful":0,"cool":0},"9yeOZIzhiSfQNiPJx70D4g":{"text":"Well I was very disappointed with my visit.\nThe food was bland and absolutely no flavor at","useful":5,"cool":0},"Ucw2pdBIdLmsyyLFzil4VQ":{"text":"Best fried chicken and peach cobbler I have ever eaten. I would have taken a picture of it","useful":0,"cool":0},"muCHH3gnJ2ug8TJwp0YtWQ":{"text":"One of the finest restaurants in our country.  Built on love of people and  good food. Fai","useful":0,"cool":0},"D_0caHTmTVaN-J6SEiAlFQ":{"text":"I finally made my long-delayed pilgrimage and had lunch at Dooky Chase's.\nThe photos in th","useful":2,"cool":0},"huyhLpSmZzE_v7VWl9TuYA":{"text":"Amazing food and amazing atmosphere, family run, and makes you feel, special and at home. ","useful":0,"cool":0},"qjAzW9OyelR248mGG6QrIw":{"text":"This is a NOLA classic and a must stop. We've been eating here since students at Xavier an","useful":0,"cool":0},"Z84vCanpNTFRNYeJLwu_Kg":{"text":"I went to see Leah and experience the history of being in an establishment that has been a","useful":3,"cool":0},"WCMfnbulAv2h_MoBYF4fDQ":{"text":"We went to Dooky Chase's restaurant on our last day in NOLA. I had heard a lot about the e","useful":7,"cool":0},"ryHJfU67WjWfwogoz9YuWg":{"text":"I have never in my life experience  a phenomenal restaurant, black on black operated a fam","useful":2,"cool":1},"vlNrEMG3D1dNBzXp9isOLQ":{"text":"I had a delicious meal here. Some of the best gumbo! I found the waitstaff efficient, the ","useful":0,"cool":1},"8_QcuDj726dJ4N09bWOM9w":{"text":"Fantastic dining to be found when you ask the locals where to eat! We went here for one of","useful":0,"cool":0},"0m74FGJweP-ktcxSJZqOJw":{"text":"Love the history and everything this place stands for. Read about the amazing woman who fo","useful":3,"cool":3},"Fyr0_pui24Vliky8USZcjQ":{"text":"Absolutely the worst service that I have ever had.    Only a few patrons were eating and n","useful":6,"cool":0},"ROOSmHh3VYR5WAdlZKQpzQ":{"text":"An iconic spot for sure! The staff works so hard and are all very, very warm and genuinely","useful":1,"cool":0},"sp85vfHfgk6plg04NG6PJw":{"text":"I cannot express to you enough how delicious this meal was. Wonderful service here, beauti","useful":2,"cool":1},"RpxummW0tR-GL9C-U8fh0A":{"text":"We live right around the corner and they have an awesome to go menu for the time being (du","useful":11,"cool":3},"f3imykAqcHWVxeOBDudT5w":{"text":"We do not recommend this restaurant. We went for lunch and my son got the buffet which was","useful":0,"cool":0},"5iv70B98eCgk642MRwXjcA":{"text":"Review is from December 2019 , from my trip to New Orleans.  This place was so good, my bo","useful":0,"cool":0},"r7s68HTVZdjKw1OTC69g9Q":{"text":"The first thing we noticed upon arrival was how refreshing and friendly the environment wa","useful":1,"cool":1},"71g-GZ0iCJe5R81Xj-VmUQ":{"text":"Food was great, the fried oysters were soooo good. The macaroni, not so much, I liked the ","useful":0,"cool":0},"mVUtdwR4lxLMTeO8WXESBQ":{"text":"Another must-try restaurant in NOLA not only for the food but to experience part of it's h","useful":0,"cool":2},"CIIgKRK31UuEx7Jp8gbjKA":{"text":"We got here around 12:40 pm, got our names on the list and was told the wait was around 35","useful":1,"cool":2},"l5h-SANKovFYUE3vyoXZnw":{"text":"I mean would you expect anything less than 5 stars from the \"Queen of Creole\"?!? I'm sad t","useful":2,"cool":1},"oseIKy17LcccYxC3wwmIgQ":{"text":"Dooky Chase is hands-down heaven in a plate. We went there for early morning and were one ","useful":7,"cool":4},"IXsaXv4fvndQgZzTZuRXKw":{"text":"This is my first time in New Orleans and this was my first stop. I came in super pumped. M","useful":10,"cool":2},"_oQ24-j_YLHqzkdf_-m4Gg":{"text":"Class elegance all wrap in one restaurant it was such a honor to dine here the food was so","useful":1,"cool":0},"-DSzeqDlYPNMKof-Nzl9PQ":{"text":"I'll have the fried chicken, the friend chicken, and why don't you just bring me some frie","useful":4,"cool":2},"t5PckGnGLXuPejltQFW04Q":{"text":"We always loved the food at Dooky's, especially the Friday buffet--but today was disappoin","useful":0,"cool":0},"wK8ku2F_lyRv_QxrItqnwA":{"text":"A must go. It was a highlight of my trip to New Orleans. We came in for lunch buffet - def","useful":0,"cool":1},"cSr2sw_1MzfyEAFVZ6KCgA":{"text":"While we were excited to visit this historic restaurant, the food was underwhelming. More ","useful":0,"cool":0},"QKLr-Bia8Fv7bA8DJSKmew":{"text":"The best of New Orleans for taste, history, and atmosphere. Going back to1941. The food is","useful":2,"cool":3},"ufsgIiI4DKCW18vvNvFE-g":{"text":"The food was great and my waitress was really awesome. We also met the owner he was really","useful":0,"cool":0},"gUAS41RjlfRiu_Ud2UE6Qg":{"text":"Beautiful place, beautiful people, beautiful art....and delicious food. If I went back to ","useful":0,"cool":0},"4x2bB5BKitsbqYx10KoVVA":{"text":"If you're in NOLA, you just have to stop here. It's a historic institution that has its de","useful":9,"cool":7},"R5VE4HfCrDxxo0i9nEWyqw":{"text":"Gumbo Gumbo Gumbo - Gumbo!!!\n\nOkra Gumbo on Friday's only\nCreole gumbo every day of the we","useful":4,"cool":2},"gvlbZD6UO4wI0p-Uj6jXCg":{"text":"We heard so many good things about this restaurant so definitely wanted to try it while vi","useful":0,"cool":0},"1mXGauRaHIRiDalMid9b8g":{"text":"I swear there are people putting their \"foots\" all up in that food.  My Lord and my God...","useful":11,"cool":4},"h5FZ9ljGMZpsC7XmeiHybQ":{"text":"We visited the historic restaurant and the food did not disappoint. I had shrimp creole an","useful":0,"cool":0},"KCPkuA2uIpcvdpszgrzUMQ":{"text":"I would love to give the place 5 stars, but did not have the greatest experience with the ","useful":0,"cool":0},"Ui70BAoxl5yjKdF0ZcmDxA":{"text":"I do not usually eat fried food but I have to say this place would make me change my mind ","useful":0,"cool":0},"o4ZYhl4k3Z7heWQKa81qQA":{"text":"The best creole food around. My girlfriend and I are from Texas and I grew up around Houst","useful":1,"cool":1},"x-ISKnQOGhnmC1n_RjwGgg":{"text":"This place was the best restaurant I ate at during my visit to New Orleans.  Classy establ","useful":0,"cool":0},"vHkdw8DM5Bc0CsSX9Hyinw":{"text":"I have been all over this city eating delectable fried chicken & I have found some good sp","useful":4,"cool":1},"b0BjGhtGVPKTm8V3F4dGvw":{"text":"Service is definitely a 1 star!  We didn't get food for an hour.  I'll be lite on the star","useful":0,"cool":0},"ypk3RsZ7HBZcyZTCQP_8rA":{"text":"Finally made it to Dooky Chase after living here for 2 years.\n\nDinner was great and servic","useful":2,"cool":0},"e-Ncr0FtxJrQJTuzStrtVg":{"text":"Terrific!!  The chicken creole with a bit of jambalaya was so delicious!!  The icing on th","useful":0,"cool":0},"M3OdtfPi0SSUfaC3QeukTg":{"text":"Had to do take out. Ordered fried chicken, gumbo and red bean/rice. Hands down best gumbo,","useful":0,"cool":0},"rnonX-nrRvsc0pN4tijG8w":{"text":"Loved it!  We went for lunch and it was fantastic - maybe the best Creole dining experienc","useful":0,"cool":0},"Xrb0ky7wTeiIKmGzTnJj_g":{"text":"Dinner was absolutely delicious Service was excellent\nThe owners came around to check on o","useful":0,"cool":0},"DpoU6HWhgdR8-2AXUNFm3Q":{"text":"There for breakfast today party of about 25. Outside looked unappealing, however very surp","useful":0,"cool":0},"Ov82e76LMj6HxtkEAkt7Nw":{"text":"Sad. I was looking forward to this food, this experience. Here's the run down. \n\nBar: very","useful":12,"cool":0},"IKezws380R0ssxRo9VecWg":{"text":"This New Orleans institution did not disappoint. \n\nExcellent service. Even better food.\n\nI","useful":1,"cool":2},"3brplfMak4bC3ypCUbaL_w":{"text":"We always come here when we hit town\nFried chicken was the best all of us have ever had \nC","useful":0,"cool":2},"MsoqRJ36aIGiG2RoO-dotQ":{"text":"I don't even know where to start!  Dookey's was honestly one of the highlights of my trip ","useful":4,"cool":0},"dkZrvi85TsRTN3yAtrrx_g":{"text":"WOW! Not only is Dooky Chase's Restaurant absolutely delicious, but they have amazing staf","useful":0,"cool":0},"7LY1lDvxNBYaUvp7JTGhCw":{"text":"If you are looking for a place to have a great dining experience this is the place for you","useful":3,"cool":2},"eVyLQ-0Py3Sa5AoEqYII_g":{"text":"Some of the best food ever. Beet Salad was light and fresh. Red Beans and Rice with Fried ","useful":0,"cool":0},"_7OsK9gN1677E6Eln6NQkg":{"text":"By far the best food in New Orleans! Also I must mention the wonderful and friendly servic","useful":0,"cool":0},"fLl6Dv4TLbJVrpfb0NP-QQ":{"text":"I should have steered clear because of the reviews but I liked the story of the restaurant","useful":9,"cool":0},"3yNdD5V3CAlHTjCAOd5Sow":{"text":"Historically, authentic New Orleans cuisine. I have been visiting Dooky Chase's restaurant","useful":1,"cool":1},"sSl1XNChIhD50PuUhBQrLw":{"text":"I watched Ugly Delicious on Netflix and they featured this restaurant as true Louisiana co","useful":1,"cool":1},"n5oM74IerhjG21gYjbrq0Q":{"text":"The staff were all very friendly and kind. We had never been there before but the waitress","useful":0,"cool":1},"m4f5EPpsbwPmFMXYE-L6Bg":{"text":"Not sure why people hype this place up but it not that good!!! I ordered chicken and one o","useful":0,"cool":0},"gliAlDne6qjxAHGDPU1tiQ":{"text":"I've been to New Orleans many times throughout the years and this is my first experience a","useful":0,"cool":1},"r3Pphw3vPPjbxWAws9ajQQ":{"text":"First time coming here:\n\nPros: gumbo was AMAZING! The BEST I've had yet in New Orleans\n\nCo","useful":3,"cool":1},"rg9jLxAHaFEQ-jjWgI9bqA":{"text":"As a California girl, I never ate the skin on ANY chicken, be it fried or not (I know, you","useful":4,"cool":0},"cNRaUDhCDAMASUk-EDYCJw":{"text":"Wow this place is a staple in NOLA! We came here based on recommendation and don't regret ","useful":0,"cool":0},"6FLIaWH-BrMN3UOXZKh8-Q":{"text":"I wrote a review for Willie Mae's and then I came here. I was excited for an even match be","useful":9,"cool":2},"6Grnx67ildnR1v-9IoqLLA":{"text":"I almost feel bad leaving 2 stars for a historic place but alas all I can give is 2 stars.","useful":6,"cool":2},"PHg_irrURSfJDjXb1eyxHA":{"text":"My cousins were eager to try this place based on word of mouth from others.  Please note, ","useful":7,"cool":1},"JwN9B2OQIPS4od_jiTsXHw":{"text":"I will just say this, the food has definitely changed over the years smdh. Tried the seafo","useful":1,"cool":0},"FQSW9tpMYA1SVTPBdBctjg":{"text":"My group of 7 people came in for dinner Friday night. The place is casual fine dining if t","useful":1,"cool":1},"vpZY2kYUpqic-y0h46L67A":{"text":"I came here for the lunch buffet and enjoyed myself. Everyone in my party ate so much we w","useful":1,"cool":1},"HJrYN7wQud9j5BB7ZiZozQ":{"text":"With such high ratings and fame, I was expecting so much more. I figured I would opt for t","useful":2,"cool":0},"VGZ-nCC-xRjBQs_2bHYy7Q":{"text":"Surprised by the low reviews. I met a friend here for lunch and I loved it. The place has ","useful":3,"cool":1},"r_sPuVgByVRotn284Loypw":{"text":"The experience started off on a bad foot. Called over 20 times with no answer to find out ","useful":0,"cool":0},"c3xGY9XCHIx3yd4XAmGvbQ":{"text":"Honestly I fell for the hype. \nDamn social media!\n\nThe food is decent in terms of what you","useful":0,"cool":0},"9-zNDuI-W4SfnJ8T59YSjw":{"text":"Made a reservation here to celebrate my child bride's 60th. Totally worth it. Drinks were ","useful":1,"cool":0},"EOSeC6-iV75d_grJ6xdOjg":{"text":"We arrived promptly at opening time and were quickly seated. FYI, they do take reservation","useful":3,"cool":2},"Sju5xSXGEb06cTbsJ7V5FA":{"text":"Great atmosphere, staff, food, drinks, and artwork. It doesn't look like much from the out","useful":0,"cool":0},"1Ecpfm3-4QLdsqhkz8p44w":{"text":"This spot was recommended by our taxi driver who gave us great advice and knowledge of pla","useful":2,"cool":2},"Tzbn7ZG8ktF2RHYSjFNDMA":{"text":"We were really excited to try a New Orleans staple! I made reservations as I read this res","useful":1,"cool":0},"59rdwksYSCAUEGlf5LKEmA":{"text":"My friends and I have been looking forward to going here for weeks before we actually went","useful":3,"cool":0},"AZUCRwNGmRU1goCSkIhEPw":{"text":"This a was late last minute audible for lunch late the vacation. That means we had a hour ","useful":3,"cool":2},"ZDU2mM3H7GFPt9sM0f-DUA":{"text":"Very, very lovely atmosphere/ ambiance and food. We dined here last night as a family of 8","useful":2,"cool":0},"0rijiq9bu9VKaVyjRdxFuw":{"text":"This was our best dining experience in New Orleans! The staff was friendly and attentive, ","useful":0,"cool":0},"U8x02kHpaXUTH8vfzh6CHg":{"text":"DC is located in a sketchy neighborhood.  The restaurant is very nice and has limited off-","useful":8,"cool":0},"FkKHS3TVcvsOzm5DE8FZwA":{"text":"I had heard about the fried chicken at this place from various food and travel shows. It w","useful":1,"cool":0},"RZL3ybQ-SP7IFbDGAC15qQ":{"text":"We went late on a Friday wabout an hour before lunch ended and we were happy to finally ar","useful":1,"cool":1},"Sg_cKF7d1SS61N-lgt_HGQ":{"text":"Wow! We came here Dec 11 (2021) with no reservation. We got to the restaurant approx 8:29 ","useful":1,"cool":2},"7rcSkGIEpEIWnWfmgwKAQg":{"text":"The food was excellent and the service was adequate. However, our family (29 members) had ","useful":0,"cool":0},"4z_uZ9GWBnpzuo2_9akhgA":{"text":"Regarding the 3.5 star average rating, stupid people are stupid.  The place doesn't look l","useful":4,"cool":1},"zczr3BzfMMos9wlpBeyQeg":{"text":"This is one of the best places in New Orleans for authentic Creole cuisine. Their Creole g","useful":0,"cool":0},"XHAetQL4AZiaCfo7wzKOPQ":{"text":"I hate to be the person to give a bad review to such an iconic place but I just couldn't g","useful":22,"cool":3},"nEC3j2uCd_y8MGuhSehYXg":{"text":"KenScale: 7.5/10\n\nLeah Chase is a legend in the New Orleans dining scene, with the way she","useful":10,"cool":4},"unyJBUjrOaa6_d62b26LUw":{"text":"Reading the reviews, I can understand the gripe people have with this restaurant. This was","useful":0,"cool":0},"llI2CJJQkNmNnkQ7iAfllw":{"text":"Southern hospitality and culture at its finest! The best fried chicken I've had so far! Th","useful":2,"cool":1},"ulQmskG1k_6tZAHKv6M8Ww":{"text":"Let's start with the French 75 game . This has been the BEST I ever had. Tip: Ordered mine","useful":2,"cool":2},"3rjdPM4UHXl-UIFKmU5j4w":{"text":"Hands down the BEST friend chicken and red beans and rice I have ever had!! It is a beauti","useful":2,"cool":3},"sHtIFXUx1c5wFJ6wD6LNyA":{"text":"Highlights: Get a reservation. Whether you call in or stop by a day before your intended d","useful":3,"cool":2},"H7QNmk2520W2Z1m4cuojWw":{"text":"After multiple visits to this New Orleans institution, I can say that yes, I'm a fan. I al","useful":5,"cool":3},"BjC8cqfyzvp9eCqIKbOfVg":{"text":"I was excited to try this restaurant tonight for my birthday as it's a New Orleans staple.","useful":1,"cool":0},"aoD63wFR79g6d_w5G-Pzbg":{"text":"First, let me say that being from New Orleans you really understand and know the story of ","useful":1,"cool":0},"Cj-CVeY-iqEnnn12G-leZw":{"text":"Best fried chicken ever! I can't say this enough. Best. Fried. Chicken. Ever. The red bean","useful":0,"cool":0},"9dMZUSRwXx_VBuTmnKeKKA":{"text":"Awesome! We were greeted by being told they didn't have my reservation... but no worries, ","useful":1,"cool":1},"HdRejopoNre_b5jn7BgzCA":{"text":"If you do nothing else in New Orleans - go here for the gumbo.\n\nWe were here for a private","useful":7,"cool":3},"oBLYxhr-1M517mZza3Iqhg":{"text":"I took a cab ride from Downtown New Orleans away from the hustle and bustle in search of a","useful":3,"cool":3},"4RmxnZNaRCknvT5opWC9kg":{"text":"I heard about this historic place that you HAVE to eat at if you visit New Orleans, so we ","useful":0,"cool":0},"yOv-Fokx4gMmRiKOfj7B4Q":{"text":"Came to NOLA for the first time and this place was highly recommended by a friend. It didn","useful":1,"cool":0},"zGLhLmV-0O8CeOKG21VC0Q":{"text":"Excellent food, slow service. Sat in bar for 15-20 minutes and bartender never made eye co","useful":0,"cool":0},"FK591htKgNXOSlrCt9kWTA":{"text":"Came here because, of course, Willie Mae's was closed for renovations the entire time I am","useful":2,"cool":0},"caCq0djTvU0c48op-rtRxQ":{"text":"Worth the wait! Everything that one would expect of New Orleans southern fare. Enjoyed our","useful":0,"cool":0},"FdR5qqvI4599e3h7a9RT-g":{"text":"Updating to say: my family recently came to visit me from GA. I brought them here because ","useful":2,"cool":2},"fNNjCcmFvDD5beVTp1Cx0Q":{"text":"Did you know you can get Dooky Chase's award winning fried chicken gluten-free???? Neither","useful":12,"cool":6},"zmayWF_RSfIrYOpTI9ernA":{"text":"Fantastic food. For $20 you get a soup of the day. Today was cauliflower and crab. Then yo","useful":3,"cool":0},"bnp5DAgHL6ll5S0euck-Ag":{"text":"I came here for the lunch buffet on a Friday afternoon. The wait to be seated was about 10","useful":1,"cool":0},"_TFqIR7GcLV6bMH_jiPsRg":{"text":"This review is for the airport location. Apparently fried chicken is their specialty but I","useful":1,"cool":0},"QmxDexBJuM-mkhiuKI6Vqw":{"text":"Dooky Chase has, in my opinion,  the best fried chicken in the country bar none. I must re","useful":18,"cool":9},"YsUrZ2wu2tqG36m2nHy_8Q":{"text":"We actually had take out because only one person had their vaccination card in our group a","useful":1,"cool":0}}