{"cBObk2tUy3p0qEaJZJnGsw":{"text":"My two friends and I picked Buffa's for dinner on a Sunday evening instead of Port of Call","useful":0,"cool":0},"LGEdM2ogdf11WLNcsvk8xQ":{"text":"The music was a nice touch, and the food was decent. The only complaint I have is that the","useful":0,"cool":0},"Tt1PjpKkoGf7GJWzK552Ug":{"text":"Our last night in New Orleans.\n\nWe had done the French Quarter, hoofed all over the Garden","useful":2,"cool":0},"dk-SLhvmutha4447ibr-dQ":{"text":"Had really low expectations when the boyfriend decided to bring his visiting sister+boyfri","useful":6,"cool":2},"GPbKPt5iusoa6HhAM30Fxw":{"text":"There was only one waitress, overworked and rude. She was rude many times and sat other pe","useful":0,"cool":0},"vAhyK5BoJUdvnYriNx8RVg":{"text":"We went for Sunday jazz brunch and it was amazing. I had two eggs with shrimp. The biscuit","useful":0,"cool":0},"atlerqv-6KmVUnB_VR_YDA":{"text":"Nice bar with live music that serves affable bar food. There was one standout dish: the fr","useful":1,"cool":0},"0FehBLxAqK7K0-L2P6kbXg":{"text":"Stopped in a couple times during my visit to NOLA.  We were staying just down the street a","useful":0,"cool":0},"1iHlvOs1cnfmZjlKBzE4Xw":{"text":"Just what we needed! The burger & a cup of red beans & rice were phenomenal...though the f","useful":1,"cool":0},"-6wiLoDwVq3XAXalWw-MPg":{"text":"This is a great place with a soul. It was on my list for a late night drink after hanging ","useful":0,"cool":0},"wkEs5JEED-TlPChRtN108w":{"text":"For the sake of this review I only want to focus on the fact that I was able to order an e","useful":0,"cool":0},"lUX81Pg7Jrpi1dRb3BplOg":{"text":"Oh man I really took a liking to this place. \nGREAT Bloody Mary's. Amazing buffalo wings.\n","useful":2,"cool":1},"Fze3Y06lrLvBDRkZLCK2aQ":{"text":"I had only heard great things about Buffa's and I came in there very late on April 12th to","useful":0,"cool":0},"IQrjIKL2biE7G-Z2wmnIYA":{"text":"Food was okay, little over priced. Bartender wasn't the greatest. I'd go back again but I ","useful":0,"cool":0},"d2-tsfvJBQt1RGO71m8UBg":{"text":"Second time here in two years. Every time we visit NOLA we try to have at least one meal h","useful":1,"cool":0},"O0UW_tVCdes7u-nYn4frUw":{"text":"We were in town for a week and became nightly regulars here. Buffa's is the perfect place ","useful":1,"cool":0},"pPsgPWT3rny2h3lOHy4aOw":{"text":"We were hungry after checking in at the hotel next door. A gentleman here recommend Buffa ","useful":0,"cool":0},"v_EXvCjurqQdzEQ8YQTsnw":{"text":"Places smells like a mold infestation. Bartenders have really bad customer service skillsz","useful":0,"cool":0},"0g8ZamteqRUHQn2kNdHnPw":{"text":"Yummy food 24 hours.  This is my go to spot after the bars.  Great local crowd.  $ btl & f","useful":0,"cool":0},"71t1Vl9WAGaUGjoqIqBd3w":{"text":"What a great find!  I was looking for a place for Sunday Jazz brunch and came across Buffa","useful":0,"cool":0},"22ftFs9lZEB73y5xsJe7Ng":{"text":"I would have given this place five stars until my last visit to this place on Monday night","useful":0,"cool":0},"6M1NClAUNSfrs9EUQx4xCg":{"text":"The music and food were good but the bartender was absolutely rude!!! I stood at the bar f","useful":0,"cool":0},"FGFxBfCtKncgOcLSG2vQdw":{"text":"Don't go to this place with fancy expectations; this is a neighborhood dive with reliable ","useful":0,"cool":0},"6OKrc6zJYGBhCxP1-SHfkg":{"text":"Love this place! Had the patty melt...yum. Best French fries. Delicious. Live music. Overa","useful":0,"cool":0},"Jh7cOoFKXqifGQUt8lkxsA":{"text":"Walked in this place randomly at midnight looking for food, and glad I did! Food was yummy","useful":1,"cool":0},"F-LVkHY8HL-TcUt6WIswzw":{"text":"the back room - decent atmosphere - happy local band - off Frenchman but just as much fun ","useful":0,"cool":0},"wYoahEoWhxN7d3WysrcBzQ":{"text":"I had lunch here while on my first ever NOLA visit. This is definitely a great spot to tak","useful":0,"cool":0},"ZIbbKJMFfyCvSDq4cAlRWQ":{"text":"Pretty cool place. Bar in front, tables in back. The bartender was friendly, although a li","useful":3,"cool":0},"zNFZqvITMvmxSUqQ81TcLQ":{"text":"Buffa's is a gem.  We like it so well we went for brunch twice this week: on Sunday 12/30 ","useful":0,"cool":0},"NegD2G-1_lFkV-58KJ5erw":{"text":"The staff was friendly. Kitchen was VERY slow. \nWe ordered boudin balls, a reuben, and the","useful":3,"cool":0},"B9ZsTHH3Ot8zLRGwk0cepw":{"text":"The bartender at Buffa's makes me want to say \"F that dude!\" He is rude and obnoxious. I r","useful":1,"cool":0},"mInI8RhJ1KEMGP8k7q2jgw":{"text":"Went here two nights in a row and was not disappointed. Music was great and staff was fun.","useful":0,"cool":0},"C9OTuPqSk3H-jsY57u-Gpg":{"text":"Buffa's is one of your classic 24/7 food spots in the quarter. It's a gem and doesnt feel ","useful":4,"cool":1},"IkACFpG3BwMuFU5v9mEnlw":{"text":"Fantastic chicken cordon bleu sandwich. Small room is smoky tho but back room is non smoki","useful":1,"cool":0},"dtgeftcgNtvqywwnSLGe_A":{"text":"Great dive bar with good food. Boudin balls were great and the red beans and rice were ter","useful":0,"cool":0},"rv-U9ngBND9Q-WSUAe1qcw":{"text":"The grilled redfish Po-boy sandwich is excellent. I would have given this restaurant five ","useful":0,"cool":2},"9sN8UDwxkZP2kciQt8DIHg":{"text":"After reading some of the reviews I fear that I severely under explored their menu, as I m","useful":0,"cool":0},"OXwSlBQQkXDKEDjjbyVKeg":{"text":"The food here was on par for a bar & grill. Nothing to write home about but it definitely ","useful":2,"cool":0},"Rl5zJEEkmeri_mg9-v4x5Q":{"text":"Buffa's is a neighborhood bar in front and a restaurant and live music venue in the rear. ","useful":1,"cool":0},"X6UzS5NGU-UESVpfghlaMA":{"text":"I LOVE a good friendly dive bar and I always seek them out everywhere I travel.  Buffa's i","useful":1,"cool":0},"98zBWreZaGUP3VjqbJ0dGg":{"text":"I was walking from my B&B towards the French Quarter and I happened upon this place. It is","useful":0,"cool":1},"nkNdH9Mue2yNTNMiR1LeLg":{"text":"Food was OK. Place was a dive bar, but bartender was nice. The locals were interesting tha","useful":0,"cool":0},"5TUbNg9Rf0jq41haETxQOA":{"text":"Come for the red beans and rice, a humorous banter with Huggy the lovely bartender who mak","useful":0,"cool":0},"qUha1MU4fSD1byd48YhiCA":{"text":"Had some friends in town this weekend, thought we'd try Buffa's again. \nFood is great, lov","useful":0,"cool":0},"1l15aO7M1OsiT1dgEO0p6g":{"text":"My wife and I went to Buffa's Back Room a couple of times during our recent visit to New O","useful":0,"cool":0},"Fp_b6j-2LbswqaMkKu6Vjg":{"text":"Great friendly staff. Service was super fast. The band playing was very talented. We had a","useful":1,"cool":0},"oO4JPxNjGJbXF1Da0oUGQQ":{"text":"The bloody Mary's are a tasty and spicy way to start the day. The seafood omelette is huge","useful":0,"cool":0},"xwGWE8Ach7_Vjgrnzep2BA":{"text":"Amazing food amazing service!!!! Came to visit my brother from Chicago and went to Buffa's","useful":0,"cool":0},"fL4ZG6C_etadn4v6SBAjyw":{"text":"Burgers are great, red beans and rice is great, drinks are well priced and there is always","useful":2,"cool":1},"J9VFCXjwBqihxd_ukRruyg":{"text":"Great place to relax and enjoy some music. Real feel of New Orleans! People are so nice he","useful":2,"cool":0},"bn3B7D3Chj4cwcC-ZA2RNQ":{"text":"the back was too packed to listen to some jazz so we sat out in front. we were just there ","useful":0,"cool":0},"mN-p7_55oaZ-muWOiV5W-g":{"text":"I appreciate that I can drink in the back and because that's technically the dining room..","useful":5,"cool":3},"gHEAbIAWM0mg6pcEhvhLiQ":{"text":"Late night food options, a host of energetic, social bar mates and live music is what you ","useful":2,"cool":1},"0wH0-E0Aew8-MqPdT8AeBA":{"text":"I was headed to Port Of Call for a burger and the line was WAY too long. So, we headed acr","useful":0,"cool":0},"TYpHnmSjRiNcELFWIhdwXw":{"text":"Dive bar. Open 24hrs. Cheap cold beer. Dog friendly. Usually has good food, but service ca","useful":1,"cool":0},"7Cmugqw4jIQxVYvEQqpS_w":{"text":"Buffa's is my absolute favorite place to visit when I'm in town, especially for Sunday bru","useful":0,"cool":0},"d0Q-CEYzIHprmzBciffGjg":{"text":"Great great breakfast spot Miss Holly is always entertaining. 24/7 you never know who you ","useful":0,"cool":0},"UnQ0gzVh5caYzUBj-2wPRA":{"text":"When I asked the bartender what was good on the menu, she laughed at me. \"Everything,\" she","useful":1,"cool":3},"kmC-mSvuA3Dgle4wOZGahg":{"text":"The food was really good :) the place is a dive though. I was kinda skeeved out sitting th","useful":0,"cool":0},"A0OxjEqCXFMY2x2hEjd1Qg":{"text":"Cool spot with a relaxed vintage vibe. I immediately liked the look of it with its checker","useful":1,"cool":0},"Lv4UK0c_NY7CixBW0dHzZg":{"text":"We showed up, very excited, for the Jazz brunch on a Sunday. Being first timers, we didn't","useful":0,"cool":0},"D8AaN-98CYyrmO2C7ZIgEQ":{"text":"What can you say ... It's sad when a great place is just not that great anymore. Sad so sa","useful":0,"cool":0},"sZ8khYRNz1ux74QR-qFGkQ":{"text":"I have never once been disappointed here. The service is quick and attentive, the food is ","useful":0,"cool":0},"htCgrI2-nZvFIMcuKENgQA":{"text":"I love Buffas. I'd give it 5 stars if it want for the lower than average cleanliness. The ","useful":0,"cool":0},"IfpLkUKhmQf3RfHI5ZqJ5Q":{"text":"Christy was amazing!!! We came here for my bachelor party. Ask for Christy.get the creole ","useful":1,"cool":0},"Mnst94fUtJ9daQznU8VN1A":{"text":"We went to Buffa's because we heard the food was good (it was). We stayed because of the s","useful":0,"cool":0},"hoZEZF0AIRI-9MgAgM1Skw":{"text":"the best - If you are in  NoLa on a Sunday their Jazz Brunch, which is mainly locals, and ","useful":0,"cool":0},"029YDvxgqWoMCL_xIwr9aA":{"text":"Fun place with great, friendly staff and good music during their shows. Old movies usually","useful":0,"cool":0},"U6tlF8FPdG1Wci5h3w5_Rg":{"text":"It was a block away from home, and everything else in town was a 2 hr wait for dinner.   W","useful":0,"cool":0},"KwYCeZZbjpORFBZhNGNd-Q":{"text":"Low key reasonably priced food off the beaten track. Great music and friendly waitstaff. I","useful":0,"cool":0},"idpKmAvVBXpYFQKeDtkhlA":{"text":"I love this place, so much. Im here at least once a week. I would also love to give it 5 s","useful":0,"cool":0},"8d_Va19pyKcU20KS6yszaw":{"text":"Buffas is our kind of dive bar.  We seem to seek out places where locals come to gather. A","useful":0,"cool":0},"KBCZS0ZrJStD7RUhiDucYA":{"text":"The only good thing about a very VERY odd night. I worked a night shift, and ended up on a","useful":5,"cool":3},"F3QnnTXo0cezliWxkKzHVQ":{"text":"This was my very first stop in New Orleans on my vacation. I just wanted some fried bar fo","useful":1,"cool":0},"uad3QD0XMn_PcIpF7-MQFQ":{"text":"Buffa's burger tops overrated Port of Call IMO, and it's much better than Yo Mama's. And y","useful":2,"cool":0},"JTDbAs3uL3i3mU93gr_IXg":{"text":"Stopped by for a late lunch with friends during visit. Food was not bad, however another g","useful":1,"cool":0},"2qna_oKW7iLrW0wkD0wy5A":{"text":"Buffa's was walkable to our place in New Orleans, so my friend and I stopped by for drinks","useful":0,"cool":0},"V524-E1G080uE2ilwIyoiw":{"text":"I love Buffa's because it doesn't pretend to be anything but what it is; a great bar on th","useful":5,"cool":1},"jk_QUB-KBrGpEjh7GPEwHg":{"text":"Fantastic atmosphere and food. The burger was really good. And the service from Kelley and","useful":0,"cool":0},"J_LdWDyN78Hw1aEZo8pVVA":{"text":"As fate would have it, I live very proximate to Buffa's. So other than Verti Mart, they ar","useful":4,"cool":0},"ve4RbapFPoMOeUOfhrgRHw":{"text":"Awesome restaurant with singularly the best bartender I've ever seen. Boone did a great jo","useful":0,"cool":0},"T4QYNZP43tUX2vj4Njuz6Q":{"text":"Good food, good service, good music, good drinks, good times! I've had a couple Cajun dish","useful":0,"cool":0},"5a4du-sr5ro3iOa_GUjaUQ":{"text":"An extra star for the talented musicians, but could do without the political commentary on","useful":0,"cool":0},"XOP52ugKkfztDq-N5_Rnrg":{"text":"Okay, so you get points for offering fried gator balls and a crawfish cream sauce for unde","useful":1,"cool":1},"OhAKpv13QobnWAYXo-inAw":{"text":"A highlight of my trip for sure. Great little local, divey spot on the edge of the Quarter","useful":1,"cool":0},"RBUawoY4XibAD_g7dq0X9w":{"text":"Came for breakfast. Didn't get my food until lunchtime. Food is great. Service leaves a lo","useful":0,"cool":0},"gGBO_0N_qbnGVB5iyTg5Zg":{"text":"When we walked in the door we were greeted with this,amazing band playing on the stage. Th","useful":0,"cool":0},"EwXS6O8HC0mn7xN6G4dM3w":{"text":"So, the bass player at the Sunday brunch band called out out as tourists right away. We mu","useful":1,"cool":1},"wLTwS3MI4oWnycnDlcOcXQ":{"text":"Fantastic atmosphere and food. The burger was really good. And the service from Kelley and","useful":0,"cool":0},"VkLj4v7uVp1Ka6PXV7cY7A":{"text":"5 stars? really? \nyah, gotta say Buffas is mah spot.  Buffas is staffed by people who love","useful":2,"cool":1},"NkE_fbe8KSt2cqTt1AmJHQ":{"text":"24 hour totally decent reasonable food, drink, divey, with a little attitude. \n\nThis is a ","useful":0,"cool":1},"U5R4NTsvS7AyLxk1N_HS7g":{"text":"Went in for a burger, ended up with a surprise jazz brunch on a Saturday. Good concept, de","useful":0,"cool":0},"ufqW0qsgsWSOOo8KH_3KSw":{"text":"Where everybody knows your name...\n\nWalk in and you'll find the friendliest drunks and mos","useful":2,"cool":0},"ViT1GnTGgRSX1NsyApQVMw":{"text":"I went here Thursday night with Anne, who according to Yelp, is my only friend in the worl","useful":4,"cool":2},"mstB9MQj0oaDILkBEg0yXQ":{"text":"Monty Banks, the man, the myth, the legend, was playing in the back bar. It was awesome! H","useful":1,"cool":0},"nx-oEPkilWqExynpCQCDng":{"text":"We arrived quite late in the evening (~10:30pm) after a long day of watching parades on St","useful":0,"cool":0},"mxk4XRqWz3vFbBvLwdR66g":{"text":"A friend and I decided to check out a comedy show here and when we walked in we immediatel","useful":8,"cool":4},"UmD2JtYNXBB6UpjU1R8coQ":{"text":"Great bar with a great history, beers are cheap and so is the liquor, place just could use","useful":0,"cool":0},"YNwq7T9-bK4rkmKXzbQAyQ":{"text":"Only stopped in for a few beers after doing much the same at Harry's Corner.  This place h","useful":0,"cool":0},"rXrwOa4mBQpwr0p3DImQGA":{"text":"This smoky dive bar is located in the New Orleans Marigny right on Esplanade Ave and his a","useful":0,"cool":0},"yGfmoPPrEZD8syvx_T-7gg":{"text":"Our group stopped in at the back dining room after a morning bike ride tour of the city. W","useful":0,"cool":0},"LBytenuGs7-hVYMkOEP1fw":{"text":"We ate here twice during our visit. It was delicious both times. I would recommend it and ","useful":0,"cool":0},"BibuTxg6RfPoN6grik2hYg":{"text":"The blackened redfish was delicious. Not spicy. But seasoned excellently. A fantastic trio","useful":0,"cool":0},"o_DGoODQmFSHykQvYLfU3g":{"text":"After a few more visits to Buffa's, I'm upgrading my rating to 4 stars. While this is by n","useful":1,"cool":0},"pXA2CsAlE5FLG6_NopTTAQ":{"text":"Hi. I'm from Los Angeles and was waiting years just to try a port of call burger. I waited","useful":0,"cool":0},"9eorSsIwr8nFsfk0DTYnWg":{"text":"Have gone to Buffa's for years for the juke box. But can't take the smoking in the bar. No","useful":0,"cool":0},"K2cOMREdxYWS-188vrUQFw":{"text":"Can I just say that the service and food was terrible and unfortunately this was not the f","useful":0,"cool":0},"scyEN7djIS-bF22lHhB8Lw":{"text":"AMAZING BLOODY'S, AMAZING BARTENDER named Huggie Bear and AMAZING conversations!!! We had ","useful":0,"cool":0},"hikGlOeZD5CpECIrGAmYTA":{"text":"Stopped in on a Tuesday for movie and game night and some food. We had chicken wings, frie","useful":0,"cool":0},"N8JJqEpw4zBumqBsIYgPkg":{"text":"Came here with the lady after spending a day in the quarter. I could not complain about th","useful":0,"cool":0},"6Kz1qcDS-GR5oDW37umSRA":{"text":"Dreamed of eating authentic and delicious crayfish etouffee until last night. OMG. It was ","useful":1,"cool":0},"Q2YvXoXVIKR_R4Mi36bgog":{"text":"This place has cockroaches walking ALL over the bar and on liquor bottles!!! Worst service","useful":2,"cool":0},"isWJTRDHCVs1wLUZ1dT-4Q":{"text":"YAYYYYY even smaller servings for the same price! WAHOOO! Now I get to get fast food, of t","useful":1,"cool":0},"NqovrMI1KGolgEaMuS9UDA":{"text":"Fantastic burgers with no ridiculous lines, and your dog is welcome.  We're proud to call ","useful":1,"cool":0},"YBDpMDA5DbfbvNAHExtrFg":{"text":"Best late night food in New Orleans, great drinks, sort of odd company. Holly is probably ","useful":0,"cool":0},"Ht3EQP9aXHlZhV-EG7JZOg":{"text":"This review if for Jazz Brunch only. First off; this was my fourth day in New Orleans, so ","useful":2,"cool":0},"xB0zO9Yi1LeivNzrgBjaZg":{"text":"I didn't have the pleasure of listening to the music in the back room. Sat at bar in front","useful":1,"cool":0},"GSNEMBOfDksGyOzFgjWqyg":{"text":"We ate the Buffa burger and it was delicious.  Very much as good as Portocall without the ","useful":0,"cool":0},"DkZ6gLzTeRTGIB6-YmiN4Q":{"text":"Love this place, When im at work at Melrose Mansion I always call an order something from ","useful":2,"cool":1},"9z4w4Q54_waJAUJzWMIjYw":{"text":"Buffa's is deserving of some love; friendly, homey bar with tasty food and the most local ","useful":4,"cool":0},"K7zaNY72B_DC5ylDu-vQwA":{"text":"The breakfast was great - poached eggs and runny and crispy bacon. Bloody Mary wasn't quit","useful":1,"cool":0},"EhA1zoTDhPboOGYoMHKlfA":{"text":"We loved this place!  The food was all good, and we ordered a lot.  We ended up eating the","useful":0,"cool":0},"yYp7nqEsS45Smdy8aau6rA":{"text":"Stopped here during a road trip. I had my puppy with me and could not find a pet friendly ","useful":0,"cool":0},"1R34oDc0HR9C29QdDaM8vg":{"text":"went here fod late nite food. service was good but the blts we all was just ok.  the live ","useful":0,"cool":0},"ZqEqc1huBud8n1-G9iK0zg":{"text":"This is my go to bar food joint. Why wait in line for port of call when you've got  Buffa'","useful":0,"cool":0},"VC1ZDYjtq8qDo-ihB6EiCw":{"text":"This place was a gem!  Great service, delicious low priced food and excellent live music! ","useful":0,"cool":0},"Pdv8ufuhWPEnzukzI3x-Xg":{"text":"This place is great! We've eaten here twice since our stay. Small menu, but it does not ma","useful":0,"cool":0},"qXATFRmc-vj4IRlY7GHxyw":{"text":"Buffas is the quintessential NOLA dive bar/restaurant. A very diverse crowd comprised most","useful":0,"cool":0},"joAue6lylFf9temjr7PG6w":{"text":"If you want to avoid the tourists and get a neighborhood vibe with good food and live musi","useful":1,"cool":0},"dVbeFDyKM5p2WzwVVSv_jQ":{"text":"Buffa's was a good place to stop for dinner on the way to evening stuff in the French Quar","useful":0,"cool":0},"MI4mRgayjaaSJA6qqYUHVw":{"text":"Buffas back door. Excellent local music. Tonight Susie Malone formerly of the Pfizer siste","useful":0,"cool":0},"PRTQS3txHw_wZO_G1YI_jQ":{"text":"I love this place! A local bar/restaurant that draws an eclectic crowd. Open 24 hrs and th","useful":0,"cool":0},"aE5X-SnCScuszueZ-8Qw4g":{"text":"Food was great. We were seated right away. Loved the music. Jonathan and Kelly were great ","useful":0,"cool":0},"RYNokPinLu4rJViex6eOiw":{"text":"Huggy is the best bartender ever. Good guy, slings great drinks. Seriously chill local vib","useful":1,"cool":0},"TuagZ2i5gv-pMD_78df86A":{"text":"My husband and I went to Buffa's our very first afternoon in New Orleans. We were staying ","useful":0,"cool":0},"u4q3h0DQGBEgFi8HyXK_OQ":{"text":"I enjoyed the food and the music was amazing. I had the two eggs meal which was superb! Th","useful":0,"cool":0},"UDZkz2vA-Zshfh7tN6i1sg":{"text":"I'm not going to get anyone fired or reprimanded. I'm glad you take your horrible service ","useful":0,"cool":0},"PtvrzQ8Sw6QsranlCM4JJg":{"text":"Decent bar but what happened with this bartender? Who doesn't know how to type prep cheese","useful":0,"cool":0},"x-ZN2VTmsmpO6blWtqBXcw":{"text":"Excellent place to go if you're in the neighborhood and looking for a low key place to lis","useful":0,"cool":0},"cBboenBacvVsNi4sZuDi6g":{"text":"This place was close to where we were staying and that's why we kept going back. Food wasn","useful":0,"cool":0},"vzAFlxD9gg2k8WCL-c-5DA":{"text":"Yeah, this place was cool.  Saturday dinner around 8.  I was going to check out Port of Ca","useful":1,"cool":1},"soFzcQb6c2mQo9LarBVs8Q":{"text":"Great place for burger, beer and live music.  Burgers spiced up, and grilled bar-style.  U","useful":0,"cool":0},"jWQr7hlE_uEAPXbnDszDvA":{"text":"Fantastic dive bar at the edge of the Quarter. I haven't made a point to come here regular","useful":2,"cool":1},"q7pMsb61utPVXgmAZKMtbA":{"text":"This gets 5 out of 5 for the following reasons:\n-Authentic cajun food at a reasonable pric","useful":2,"cool":0},"epqC_cqkCgeinfw65arqEg":{"text":"I can't say enough about how wonderful Buffa's is. It is legendary. The entire staff is su","useful":1,"cool":0},"2ylqIaJ4fs6qNsGjkmRz2Q":{"text":"Service sucked beyond belief.  Incredibly rude bartender.","useful":0,"cool":0},"91lRHNgoeczg7hHK_Daggg":{"text":"Excellent breakfast and killer hot sauce.  Friendly staff, convenient location, and easy-g","useful":0,"cool":0},"KUdHFspC2EhvZzCK28g37g":{"text":"The friendly people of NOLA love their alcohol, so it's no surprise that their best eats a","useful":3,"cool":1},"VpzFrw6SJ_LhT4ERujUY6g":{"text":"I am strictly going to review this place based on the 1 time my friends and I went in last","useful":3,"cool":1},"w2-wc3ixaBZLQzAf6tm7LQ":{"text":"Do yourself a favor. Order the Boudin balls. They were AMAZING!!! Sausage was out of this ","useful":0,"cool":0},"d0PJVUlxYPttmTXWy3VljA":{"text":"A down-to-earth, no frills bar that I've been told is frequented by service industry profe","useful":0,"cool":0},"b0q5sB43akSr3pcJukoReg":{"text":"Along with Napoleon House, Buffa's is one of my favorite bars in town .. Yes, it's a dive-","useful":0,"cool":0},"8equnpXPdTGlZrGCkeetXg":{"text":"Very ccol and relaxed atmosphere.   Interesting locals abound.  Gotta order the food and e","useful":2,"cool":0},"LKVBm6xvY1P5OhMpRWBusw":{"text":"Dive bar in the front, jazz club in the back. Could not of asked for anything more except ","useful":0,"cool":0},"8f8NxZ1Ve6-q-DKasE6PXw":{"text":"Excellent food. We had the boudin balls and the crawfish etouffe. Live music was fun and e","useful":0,"cool":0},"p9OHflhKIgDBam5ArIAZDw":{"text":"Holy crap...you can get food here 24-hours a day!  Buffa's is definitely better than a lot","useful":2,"cool":1},"2tmWs6CTJr62DmB66hf4wg":{"text":"This place always makes me think of the show \"Quantum Leap\". I've been sorely tempted to g","useful":3,"cool":0},"iz29IrhYR0oj8cYwnKVKwQ":{"text":"Food knocked my socks off. The staff is amazing. Went on a open mich night, ton of talent.","useful":0,"cool":0},"cigwOAW_0iDqTLzZi3W4eA":{"text":"A 24/7 pub with not your average pub food. The food was delicious and the service was grea","useful":1,"cool":1},"dX1_EHM-sN58wGdBlvzumg":{"text":"Wanted lunch but it was so filthy I honestly was afraid.  The bartender was nice but I als","useful":2,"cool":1},"S2HO-vttw-YeAMfgYhGOtQ":{"text":"I will be honest, I did not expect this place to be particularly good and I'm not quite su","useful":1,"cool":0},"A-lF3NgLMBQ6RgHD_fP1LA":{"text":"Awesome Place!  Huggie the bartender makes awesome drinks and the red beans and rice was o","useful":0,"cool":0},"q61MB_e5FqFjD-s-3TDT3g":{"text":"We came here for dinner one night as Port of Call had a crazy line out the door. I wasn't ","useful":0,"cool":0},"jSE3g9jeoGKGh0y7EIMtAQ":{"text":"This place is awesome. It is everything I want in a bar. It seems much more of a local han","useful":1,"cool":1},"5_hmWXbBXFQc69pc-xpjew":{"text":"Ridiculously rude!! You are open 24 hours, your phone is off the hook.. So\nOf course I wal","useful":0,"cool":0},"uawIcRi2bEi-mAEkeII6bA":{"text":"Great food, great music, awesome bloody Mary's! Had the Ruben omelette, amazing! Just disa","useful":1,"cool":1},"0x39gs8xTpVgoCb0r21Y_Q":{"text":"At least three people told me the exact same thing... \"Buffa's has the best burgers in the","useful":6,"cool":2},"00mEXdk8Kpnyt-hXpKL-yA":{"text":"Buffa's is a diamond in the rough. In an area filled with gimmicky tourist traps, Buffa's ","useful":1,"cool":0},"HedfddoN7djMKO-PL_hULA":{"text":"I never write a bad review about anywhere but they truly deserve it and hopefully someone ","useful":0,"cool":0},"L_FdDg1BhdXmLAKq2ozppg":{"text":"Buffa's is my go-to spot for late late drinks and comfort food after a long day. The barte","useful":0,"cool":0},"FX4otOwjPu478X67IaUzDw":{"text":"Don't Do it. Place is clueless. Took over an hour to get the wrong food. If Yelp allowed n","useful":0,"cool":0},"BUqpJ4uGEUL6n032jiZS9A":{"text":"Intimate, neighborhood-y, amazing late night bar. Open 24/7! Perfect for a late night meal","useful":0,"cool":0},"mqsT0vKmWRTCuJ63sq92xA":{"text":"This is a cool locals bar that has got some interesting music and entertainment, as well, ","useful":0,"cool":0},"C3vIj3EEFDwdv848Y3zg9A":{"text":"This place is just a few blocks from where we were staying. It didn't look like much to us","useful":0,"cool":0},"1g_pRZIIDNN1wx3dRtYvOQ":{"text":"I have always enjoyed this place but what a disaster trying to eat yesterday. We go for di","useful":0,"cool":0},"t4TY6dUgca-H4PMKClCx5Q":{"text":"Food Hounds... what is better than great food, great service and smooth jazz playing live ","useful":3,"cool":2},"tokGiUO1FddWxc5H6bg6VA":{"text":"This was the first place we ate after arriving late to new orleans. It was fantastic! Grea","useful":0,"cool":0},"e_q16oNXDmdSo6zMTarW_g":{"text":"After Bourbon St we were looking for a more low key spot.  This place was perfect!  The fo","useful":0,"cool":0},"-s3FKrzf5B1oKvpnMjzqjw":{"text":"I feel bad leaving a one star but this place has terrible service and comparably terrible ","useful":0,"cool":0},"N5-NJsuozTXqBZ5s2cOsPw":{"text":"We arrived to New Orleans very late (past midnight) and on our way to our accommodations w","useful":0,"cool":0},"f1nI5bRCl3mlQ7TUK9OETg":{"text":"Eclectic crowd and must-visit for live musical accompaniment of Buster Keaton silent films","useful":0,"cool":0},"8VY-2PERmsdRUUAwz0dtLw":{"text":"This is a really cool little neighborhood dive on Esplanade. Good variety of beers and ful","useful":2,"cool":1},"5aU-Y-2000FjDpQRnTglGA":{"text":"I love Buffa's! It is our go-to place when we are staying on Esplanade whether for a night","useful":0,"cool":0},"M4nVB76pCJEFeDrMSL7UJQ":{"text":"It's a nice local establishments with a nice live band. We had the Gotham Night Burger and","useful":0,"cool":0},"rB-DZbm8ruKvKgF2XTOYsQ":{"text":"Recommend by a local (pedicab driver). Food was excellent.  Ordered the fried corn nuggets","useful":0,"cool":0},"ObsnI60kF3BCbO7XvZhNog":{"text":"New bartender Jonathan is the best-good hire! Super attentive and genuinely a nice guy.","useful":0,"cool":0},"Pi69Glip1AoLcMESd0k8Aw":{"text":"We stayed in the Marigny neighborhood during our 1-week vacation in New Orleans so that we","useful":0,"cool":0},"7N9CUHTDk9a-1Vp8Cu6BXQ":{"text":"We rented a house in the Marigny for our St. Patricks Day visit, and this place was recomm","useful":1,"cool":0},"qvvdBgF_N3HI-NyRp34xKQ":{"text":"No frills or fancies. Buffas offers genuine service, good music, and BOMB chicken wings. T","useful":2,"cool":0},"M3m97jOhUQK13eqGaHVIZw":{"text":"Great brunch and affordable bloodys on Sunday. I really enjoyed the band and you gotta lov","useful":0,"cool":0},"U-Tcr1Okor___-GIlFUkIQ":{"text":"A little dingy, but a great little corner spot that was super convenient to our cottage in","useful":1,"cool":1},"-_dHhceo4NFjm1jf5spiMg":{"text":"So, you've wanderered out of the French Quarter and hit Esplanade Ave. It's really late an","useful":1,"cool":0},"s6dG4dcYQ1LJhc7X4tbTTA":{"text":"Sunday brunch was very nice - good food, friendly service, live jazz. Corned beef hash was","useful":0,"cool":0},"8EW3QPiTvHZ2LSsb4r448Q":{"text":"Great burger, cheap beer. Smoky but deal with it, that's what you get with a dive bar. Fri","useful":0,"cool":0},"rhp3kVFaW7RnEbHxj1Yp0g":{"text":"Great locals dive with a variety of weekly NOLA-oriented entertainment (TV, film, sports, ","useful":1,"cool":0},"tolclfZ2P9JaHhYN8fwxaw":{"text":"This place has a fun, relaxed atmosphere and the food was excellent. Maybe it was just an ","useful":1,"cool":1},"0ZtxSvOY2jgb4V839lvp4Q":{"text":"The staff is attentive and the music is fantastic! We got to see a Buster Keaton silent fi","useful":0,"cool":0},"EnXiuT1Xphiw_lkXs4SAQA":{"text":"I come here every time I'm in the Marigny and when I have friends in town. This place is t","useful":0,"cool":0},"vDFlDwoGKLoAMURPx0_mIQ":{"text":"Love the vibe at buffas. Been over 20 times. This was the first brunch that i have gone to","useful":1,"cool":1},"IvzfQAaFa0u9lK61BAxfFQ":{"text":"Nice neighborhood atmosphere, good food and the local talent are great!  Right across from","useful":1,"cool":0},"hXs01Xc27srUCw8lpmP2rw":{"text":"DO NOT GO ON WEDNESDAY! the cook is absolutely horrible and doesn't care about his custome","useful":0,"cool":0},"7ypFExtvYyLQ2ABsQek43g":{"text":"I have been to Buffa's every Friday for Happy Hour with my coworkers since I moved to New ","useful":0,"cool":0},"LVpb45u4LuMC9qGEym9ugQ":{"text":"Divey jazz bar with great music. Went to hear Tom McDermott on a Thursday night. Get there","useful":0,"cool":0},"yma0SbRr4ioirXHx04GGww":{"text":"First time to New Orleans in a very long time. The first thing I was looking for was some ","useful":0,"cool":0},"dsptg1DwB_ulsaEUWV9XDw":{"text":"Low-key night, but when I \"Checked-in\" on Yelp! I got a free beer! Abita Strawberry, great","useful":1,"cool":1},"6L4Poa9CYS-XtYGdlkDCmg":{"text":"Fun spot that we found completely by accident (and Yelp.) We checked out Davis Rogan and h","useful":0,"cool":0},"3pUgbYJAQ7BbDe-ASy-_jw":{"text":"What a find! We walked into the bar section and were greeted by a couple of Chihuahuas and","useful":0,"cool":1},"3hVr3ym95TF9c56ESfPoOg":{"text":"On the positive side we got to Buffa's just as they opened for Sunday brunch and got seate","useful":0,"cool":0},"_wxNdunFoGNd602lipv_Sw":{"text":"Too inconsistent. First time I went, had a great burger and fries. Second time, fries seem","useful":0,"cool":0},"LAnBJfD209kPn9I4Ub6rOw":{"text":"The food is fair. Burgers are best option . The steak is tough as leather.  Fries are good","useful":0,"cool":0},"NP0i41hFFMQbyO3rsgzDgg":{"text":"Loved the atmosphere here, went on a Saturday night and the band was so much fun.  Wish th","useful":1,"cool":0},"gZVzaM2D_PZGogvFsoPwOQ":{"text":"I rolled into this place EARLY on a Sunday morning needing a good breakfast.  I was seated","useful":0,"cool":0},"V1Cyax6_kGNnnim9PkJRsA":{"text":"Buffa's is a cool spot with a kitchen that over the last few years has fallen hard.The sav","useful":0,"cool":0},"p6T1eKYfkqbOoDzB-17y-Q":{"text":"Went there. Stood at the bar waiting to be served. For about seven minutes, while literall","useful":0,"cool":0},"1JkvD17Thi4Jrycjbf56gg":{"text":"Smoking in front.  Non in back. Bar and food in both.  I loved the atmosphere and I love t","useful":0,"cool":0},"BeaNNYlAq9MWYm9G1baHRQ":{"text":"The waitress/bartender was very nice and attentive. The burger that I had was average but ","useful":0,"cool":0},"XdcsNgrbIokEcQP3VHVTrA":{"text":"My favorite place\nJazz brunch was the tits and so\nWas the food and drinks","useful":2,"cool":1},"jD0se3v2Q2AE28kBv7UJ3Q":{"text":"Great music and excellent food. A little spicy but good, vibrant flavors. True creole food","useful":0,"cool":0},"5jUv2Wrnr8NpHfPzP9wqhA":{"text":"New to town and just discovered this local favorite.  Scotty is the best bartender ever an","useful":0,"cool":0},"x-x1bubsfLxkctAMFtBTFQ":{"text":"After reading all the reviews, I have been looking forward to going to Buffa's for a while","useful":0,"cool":0},"fySkCFyDHgb_UY4pK9WdsA":{"text":"5 stars, but the prices  went up 3 years ago as more tourists started coming. But the loca","useful":1,"cool":0},"HJt_YNGDOFmKr1aiAOs-_g":{"text":"Husband and I stopped by on a Monday about 7:30pm. There was only one waiter/bartender for","useful":0,"cool":0},"ldYrbk4wfcSLjiMj5zQFQg":{"text":"I stopped by for a burger last week on my way out to the bars for my first night out since","useful":2,"cool":0},"YEEG-S9lI05eHr_uGPPHLQ":{"text":"Went there lastnight for there drag show and had the best time. The guy at the bar was ver","useful":6,"cool":5},"tnxncUF_zLAuKijxk_VGAg":{"text":"Last Saturday ,we were staying further up Esplanade, walking back from our only foray into","useful":1,"cool":1},"9O0sJnfUZbux1rnpSf5aIQ":{"text":"Goddamn do they make a good burger. Great service from the bartender. Some fantastic music","useful":0,"cool":0},"Jl9rMhL12so9Yz8eU61uPg":{"text":"Classic local New Orleans dive bar in the front and a family friendly restaurant in the ba","useful":3,"cool":1},"m0cgwIdNfv0sGlrYlKiK-w":{"text":"Buffa burger is on point. One of the best I've had in Nola.  Thick tasty and one a great k","useful":0,"cool":0},"xaSYa02DGP2ZYRFEkJonMQ":{"text":"The food was really good! I got the Logan's Run for the Border burger and it was cooked th","useful":0,"cool":0},"tgQYnFneluG6y-Vuyi7MOA":{"text":"I will be visiting the Big Easy in a couple of days and I am super stoked that I will be h","useful":1,"cool":1},"m_qKEoOMlwpDWRRt7auREw":{"text":"Red beans and rice, corn nuggets, alligator etouffee and fried green beans.  Everything wa","useful":0,"cool":0},"3bPHj_CewWYeuZIsVwusbg":{"text":"This place is real cool. It is small but packs a punch with live music, food, and staff. T","useful":0,"cool":0},"bJtH-CkUklhYocMnjXkY4A":{"text":"Love Buffas! Their brunch is phenomenal. Always got a band playing some great tunes. Also ","useful":0,"cool":0},"gQspic2jpgsuWyR5pCD78g":{"text":"One of my favorite places of all time. The neighborhood is beautiful as are the locals tha","useful":1,"cool":1},"6g8KLk0V0PS5ZRxYK0U5OA":{"text":"Yum!  The hubs and I wandered over here since we were staying across the street.  Seriousl","useful":1,"cool":1},"IJ0Cg0a3QTY-C0PehhTyXw":{"text":"I operate a B&B, living here part of the year and always recommend this place to my guests","useful":1,"cool":0},"gl2HZQWIJKSQ0zL58OhSVA":{"text":"I would literally lap anything they served me tonight off of the toilet seat. YES! It is t","useful":0,"cool":0},"NZ_0yv6YBu7k7kUQff70NA":{"text":"Did not enjoy this place, was immediately turned off by the dining room being closed and h","useful":0,"cool":0},"kYWfIniVETBMexy1N7eanw":{"text":"If you can handle it, get the Ghost Pepper Burger - it was awesome.  Love the live music.","useful":0,"cool":0},"-zeX_NbMYKZTnBR9YXmiWQ":{"text":"The service here is very lackluster, but something tells me people don't come here for the","useful":0,"cool":0},"ab39-EwwMgZYsUQw3l08qQ":{"text":"Just wanted to drop a quick comment and say that we returned to Buffa's on our most recent","useful":0,"cool":0},"kn4vESJeX8PZVx6dVpBZ9Q":{"text":"Loved the Crawfish Etouffee, it was spicy and delicious. Definitely our favourite dish tha","useful":0,"cool":0},"FWgm9fLbAD906RXUdii-Eg":{"text":"Oh man. Too fricken good. Authentic, delicious Cajun food with great live music! Service w","useful":1,"cool":0},"A6DtJp8yaksWUXJ3Exx_gw":{"text":"This review stands only for the food offered during a late night visit on the Sunday befor","useful":0,"cool":0},"02eW2sNKo1-LYvhhlaORrg":{"text":"This place is awesome.  My fiance and I are visiting from New Hampshire and our house host","useful":0,"cool":0},"-XJxcuuDXHMsa-BXEY7x_w":{"text":"Came here after a long night of drinking and dancing with a very fun-loving Bachelorette p","useful":0,"cool":0},"vryFu73ZslIiVLwoYPQHsg":{"text":"Love this place.  Hahaha, great food, music, and people.  This band is so good tonight as ","useful":0,"cool":0},"Dn2tPOmO-H_aAADkvH91LQ":{"text":"It hurts my heart to give Buffa's this two-star review. I've been going there for several ","useful":0,"cool":0},"eRvcryHLn8OadBeN7xFRcw":{"text":"Best Sunday brunch ever!!  Excellent music, food and service. Get there early for a table.","useful":0,"cool":0},"tR2xpkIoFQQ_9vacGOqOCA":{"text":"Just got back home still slightly hungry but hell I'm 6'5 280 low percentage of body fat. ","useful":0,"cool":0},"jcTXcF3yZGh6cBOA9zOueA":{"text":"Love this place.  They have the best Ruben that I have had in the city.  Their burgers are","useful":1,"cool":1},"MkUDbglsHZDOG8IS4EKgkQ":{"text":"By far my favorite place in New Orleans!  Thank you Christie! Michael! and Sticks! So much","useful":0,"cool":0},"6ZoRIvAXge3DQ9zpskD4dw":{"text":"Christy is amazing!! This spot kept coming up when we were looking for places to eat... sh","useful":0,"cool":0},"Hw6uJElXIbeXtJO10BIcVQ":{"text":"The food keeps me going back. The Service however is ALWAYS awful. Being organized on a bu","useful":0,"cool":0},"2dfeHhzA2-VAtB92L9JJXA":{"text":"Johnsonville bratwurst jambalaya.... order it. Dive bar. Fantastic bartender named Thomas.","useful":0,"cool":0},"AxqfkgajN7e5YMMir68wag":{"text":"We happened across this place and thought it looked interesting, so went in for a drink. T","useful":1,"cool":0},"LSYGnOit4OCnfCO_z6Lmmg":{"text":"I used to love this place. Today I was there for lunch, and I couldn't be anymore disappoi","useful":0,"cool":0},"4NRwK4Jzqi3zMuvBlYoBSQ":{"text":"This place is a great hole-in-the-wall that I like to frequent after work for a snack and ","useful":0,"cool":0},"FJrUwMvXl632V5n8SAC6lA":{"text":"Came here at 10pm for dinner, drinks and entertainment. \n\nPros:\n* Good ambiance and music\n","useful":0,"cool":0},"a7BuBtsDKOSe15zkJwTQ1g":{"text":"We were recommended this place by a couple locals so we had to stop by. My partner ordered","useful":0,"cool":0},"2KXPQv-7jND9SdpG9nDLSw":{"text":"I have passed Buffa's for 25 years, and it was on my bucket list.  Server was cool.  Roach","useful":4,"cool":0},"HmYIpfQSiY6bWS1DNR-s7g":{"text":"I went to the establishment at about 9:30 and stayed until 1:15am. This place had two of t","useful":0,"cool":0},"hnLc7bl_M6WqrVRc4fobcw":{"text":"Buffa's is a gem and not touristy.\n\nThe entry is a bar but if you walk through hallway tow","useful":2,"cool":2},"nYuHYxXitFPwApMCtVK_PQ":{"text":"I fortuitously stumbled upon this place a couple blocks from where I'm staying my first ni","useful":0,"cool":0},"ubm8m9Kz_9VcGb_dE-NUTQ":{"text":"My first time in New Orleans and we walked into Buffas on a Sunday night to see Antoine an","useful":0,"cool":0},"h5mvFUFAKNzIFtzjROK5-A":{"text":"This is a great dive joint for 24/7 dining and drinking along with a fun Jazz Brunch.  The","useful":5,"cool":4},"7s_FKoVI3_8mSFLRDYcJoA":{"text":"This place is the friendliest and best place to run into, I must admit I've never really h","useful":0,"cool":0},"YcK8yhxEcpIDbs_YtiTG8w":{"text":"Buffa's is the perfect casual neighborhood joint for good food, good booze, and good music","useful":1,"cool":0},"8Lf14Flo0FvQ9RXgCoctQQ":{"text":"Walked in past 10 pm on the Friday after thanksgiving. We were looking to do a take out, b","useful":0,"cool":0},"pfSwf9lZ7oi3OSj1ufx_Wg":{"text":"Great neighborhood brunch place. Come here if you want to dine with locals and listen to m","useful":1,"cool":0},"of0_LoM1ccdkZT0WRqE7zw":{"text":"Buffa's has a pretty interesting and big space. We stopped by for dinner and were impresse","useful":0,"cool":0},"7R-ZAuyKIsykE_q7N7ZRdg":{"text":"This place will fool you. It looks a bit seedy and dangerous, as you first enter, but just","useful":2,"cool":0},"lN3hIMwYe1ojusLQIHNhCg":{"text":"The Buffa  burger and fries is a favorite when I head over. Favorite bar food is chili che","useful":0,"cool":0},"9FRpxBeS0xwJzmlZoBBjMA":{"text":"Best Hot Sauce assortment, wonderful gifts to bring the taste of Nawleanz to friends and f","useful":2,"cool":0},"4BNT1_bnY46ZSLfmDvBGZA":{"text":"Buffa's is the perfect little neighborhood dive!  Great people watching and laid back atmo","useful":2,"cool":3},"fB-v0XNya5ybn57aB_CJGw":{"text":"Darren and Scottie were amazing! We came here on a recommendation from the bnb we are stay","useful":0,"cool":0},"t4Zw3dxLOLWW7l8f4Eabxw":{"text":"Made two trips to NOLA last year, and both have included a visit to Buffa's. Friendly staf","useful":1,"cool":0},"WcL3FUMuaVBDhNGeLszR8w":{"text":"This bar's former owners called it the border of the Quarter.  Actually, it's on the Marig","useful":0,"cool":0},"-4hyptBoM4OKkRMBt_Ecqg":{"text":"The blackened red fish never disappoints. Friendly service and nice music most nights.","useful":0,"cool":0},"vOiymsqYNEFt8fBvS6OAEA":{"text":"Buffa's is a bar and eatery along the French Quarter/Marigny border on the Marigny side of","useful":2,"cool":1},"gxWnRb9P5VwcV01r9_U4jQ":{"text":"Best grits and breakfast on my entire road trip across the South, California to Florida!","useful":0,"cool":0},"3kMECYONNM1bhFpm91zSJQ":{"text":"Sat at the bar. Too LOUD.\nBut the food was excellent! Breakfast Burger was amazing.\nI have","useful":0,"cool":0},"JUU6e7TjkgxYbi1DhFP1Hg":{"text":"Mia was the best bartender! Came in late at night, made us feel right at home like we were","useful":0,"cool":0},"h71Z7XJF5uw19DQbhSQCPA":{"text":"The best boudin balls in NOLA!!  \n\nI was raised in Baton Rouge (currently live in Chicago)","useful":1,"cool":0},"ufyclAWtD73P-7gZRRTtAQ":{"text":"It's a dive but a cool dive. First stop when we got to town, weary from driving. Food is r","useful":0,"cool":0},"zfaCrv-rCC_5NVhWGnrnhA":{"text":"Really like their mango hot sauce!","useful":0,"cool":0},"U2eJQJ-kDzEHgN0pjjWxhQ":{"text":"Its been a while since I have eaten here and I forgot to do a review. I stopped in for lun","useful":2,"cool":2},"BmuQnrEkh9a0rxGdl2MZQA":{"text":"I've been to New Orleans a dozen times over the last 10 years for work. I am so tired of t","useful":1,"cool":0},"jbkhKHolY1SpOWH0jTzo8A":{"text":"Boone was a great bartender. Fun and had lots of tips for tourists looking for something o","useful":0,"cool":0},"ErpcGLcOjQFbZZWXUVpb2w":{"text":"We came in on a Mon night when my buddy was performing (A2AD).  I loved the unlimited \"red","useful":0,"cool":0},"bchkpKXZlmfT_UKN00sBZg":{"text":"I live right down the street from Buffas and my husband makes me to eat here at least once","useful":1,"cool":0},"QkXsjv9f9h8gai4mZbrnRw":{"text":"A lady at the tourist information center recommended this place for brunch and we were not","useful":0,"cool":0},"Jkg6rb88u0EB2SXDUR7AbA":{"text":"Buffa's is by far the best bar to come to! If it's to pregame , party or after party this ","useful":0,"cool":0},"wcO5PvSuvPN2_-9Whld9Bg":{"text":"The bleu cheese pasta is one of the best dishes I've ever had! So good. Live music and a v","useful":1,"cool":0},"mR-o5HJ-cfrL06COdxU5ww":{"text":"I love the sunday brunch at Buffas :) the band is awesome, everyone is having a great time","useful":7,"cool":5},"M92EB6Z93puMNPSD34OyDg":{"text":"This place is certainly a dive. We had dinner here one night in NOLA... it was pretty pack","useful":0,"cool":0},"yCb-sw08BuntXPQunIOKFQ":{"text":"Stopped in to have a burger on election night. It was pretty damn good! Down and dirty atm","useful":1,"cool":0},"zXy33EBLLWittW9keSGo0A":{"text":"This place may look like a dive but they serve a decent homestyle burger and fries.  The r","useful":0,"cool":0},"TvpBUKk1lzeEVU8zOnhBBw":{"text":"So lucky we stumbled across this spot walking from our Airbnb. We thought we were just goi","useful":0,"cool":0},"n8YcvEobJnVqdTRSZbh61Q":{"text":"I'm here for the Drag Show on Tuesday nights. We also stop for Bloody Marys on a regular b","useful":0,"cool":0},"NMwcESoSdWW8udIAtLZPiA":{"text":"Food wasn't that great & service wasn't that great either. Kind of smelly in there so that","useful":0,"cool":0},"G1x44y7v9aVp_ruc42Y13g":{"text":"1) our waitress, was a beautiful woman. I would go back just have her as my waitress again","useful":1,"cool":0},"rRtyYpXoQhsuUavWRKEpSw":{"text":"Yes yes yes! Staff is so kind. Food was fabulous. I had gumbo and my husband had shrimp cr","useful":0,"cool":0},"49NvXeYRTmNpogM3-h_TNg":{"text":"Enjoyed an awesome  burger last night! Friendly service and enjoyable entertainment.  Defi","useful":0,"cool":0},"T2Ed79sFaAyYyW5s5ebPsA":{"text":"Love this neighborhood spot for its jazz brunch. The female-led band knows their stuff. Ea","useful":0,"cool":1},"FS0iTMMC1hXeWbodQCLODQ":{"text":"Went famished and split a burger and left wishing I had had the whole thing...  amazing!","useful":0,"cool":0},"O1aEOcCkmhM-LZvb-I-fVw":{"text":"Buffa's is a good place for take-out if you're in Marigny.  The food is good and service i","useful":0,"cool":0},"w-ddMXLQwmxPzqzB0eYwEg":{"text":"I LOVE Buffa's -- it's my favorite spot to go for a burger + beer. But the real reason I l","useful":0,"cool":0},"3p9N_0ounLZkhNrlFylAaw":{"text":"Cute place with live music and decent food for the price. On the other hand we waited over","useful":0,"cool":0},"zVhDrG0TWjvGF2wCuYUqoQ":{"text":"Our food was good here, good jazz brunch and ambiance.   People there were both locals and","useful":0,"cool":0},"SVBqZ5n8UYMNQen_KCHjJQ":{"text":"My husband and I had a blast!! The food was great. The atmosphere is just chill, unpretent","useful":0,"cool":0},"8U-YSLXgdvdBQ2OPoOYfaA":{"text":"We came here when visiting New Orleans on the recommendation of a tour guide. It was almos","useful":0,"cool":0},"jYX-fZDTa8wCkobg99oVhw":{"text":"This is a great neighborhood bar. The food, drinks and service are excellent, especially K","useful":0,"cool":0},"p04f_w6PSWNhBjbcbMYCjQ":{"text":"All the slaps. Great service from the bartender, Arden! Fantastic chicken wings. Highly re","useful":0,"cool":0},"53SYwYxzpHgCq0qL3VMqzw":{"text":"Loved the music, local artists with drop in by others as well. The location was great as w","useful":0,"cool":0},"jmNSE-5PF0y6oZJCHTwk4Q":{"text":"Started bumpy with all the bar tables either dirty or occupied so we sat at the bar. Barte","useful":1,"cool":0},"OYsQA1iyhqJGtD_7wY_LPw":{"text":"Nice place with good ambiance and service. \n\nLive music every afternoon and night\n\nTraditi","useful":0,"cool":1},"9RRYeY3lPa-H3lomhpopcQ":{"text":"As always this place is wonderful.  I come every year when I visit.  The greatest bar food","useful":0,"cool":0},"Sm9sVrGKLnqpmygXYXvizA":{"text":"I don't know where to even start. We came here twice in one evening. The first time was su","useful":2,"cool":0},"yFYBo7GaQqNK8nEm6TyFFA":{"text":"Great local bar on the border of the quarter.  Met lots of local folks (most of whom were ","useful":0,"cool":0},"9nN5D7bu4p8n22a2B9LPyA":{"text":"Super friendly bartender she was great! Very personal and light hearted...food was great w","useful":0,"cool":0},"fAhQxcagdys9mUOsIgjatw":{"text":"Hans is a great guy. Genuine, good spirit. He's great at his job and a good person as well","useful":0,"cool":0},"yrOaZcF6ZDdgJ4yh8oi8lQ":{"text":"Great little dive bar with the hottest burger I've had in a long time.  Bartender/server w","useful":0,"cool":0},"UpRqUcz3WrwcqtAHxbqrgw":{"text":"Loved this place! Had some great conversations with some locals and other tourists here (t","useful":1,"cool":0},"XAXFv_v6lloGo5FqzaTE-A":{"text":"Been to Buffa's all hours of the day for years, but never tried their Shrimp and Grits ent","useful":3,"cool":0},"syABxkFXKxwJW3xbRwjweQ":{"text":"From the looks outside, you may not venture in but it was recommended by the hotel. Once i","useful":0,"cool":0},"Xq2b0HG7UFfVEA9_I1vrmw":{"text":"I never leave reviews good or bad very often....waiting an hour and a half for chili and a","useful":0,"cool":0},"v8Lhx-11wtmhlbJ2t3diiQ":{"text":"The food is awesome, and the bartenders are super cool and nice!! Can't go wrong with Buff","useful":0,"cool":0},"CsZ_1DbfrpkVST4yiQwYOQ":{"text":"If I had to condense the entire New Orleans experience into one place, Buffa's would get a","useful":1,"cool":2},"a70g5iq_YO6prUPRAmTl1w":{"text":"This was the first spot I ate at in New Orleans, and the food here was really great. I got","useful":0,"cool":0},"xqcRWflYltjE-jlw01tOyQ":{"text":"Awesome burgers. I had the buckaroo burger. Had onion rings on it, bacon, cheese, and some","useful":0,"cool":0},"P9V6FQRWaBgLt5E9fgibLg":{"text":"Phenomenal bar and grill located just outside the quarter.  Great burgers, although a bit ","useful":0,"cool":0},"oFLNLqz7NNYp36hVg1rLtg":{"text":"I always visit this place when I go to New Orleans.  Best burgers in the quarter, in my op","useful":0,"cool":0},"u-bgvHqMXi002Pps95di2A":{"text":"Buffa was a block from our Airbnb so we stopped by a few times during our stay. I liked th","useful":0,"cool":0},"x_-1OJv74WRVqaVPEoBGBg":{"text":"Very good. We stopped in last night and had the red fish Alfredo and the red fish plate an","useful":0,"cool":0},"CexLhh2zlZ6GvU_LenpC8w":{"text":"This is kind of a dream spot for me/certain people-- it's a fun dive bar with amazing New ","useful":0,"cool":0},"fc2ayeHPaEuZEiaQK62ZGw":{"text":"So this was our first stop up my husband's sleeve on a recent anniversary trip to New Orle","useful":0,"cool":0},"-MPeGeEHaV_wNdDLiGRqzg":{"text":"Great evening of music, cocktails, red beans and rice and delicious onion rings.  And need","useful":0,"cool":0},"uDq9DjRivCtZ0b-TbTEQbg":{"text":"Phenomenal burger !!\n\nJust got back from NOLA and glad to say we found a gem.  After 3 day","useful":0,"cool":0},"37B6rzvEV7XAFD-OvhBGJw":{"text":"Been to Buffa a couple of times since my last review. Aside from the occasional great musi","useful":4,"cool":2},"Jsvngex_Ml9EFAJpjAPSBQ":{"text":"A dive bar in the best sense of the word. My friend and I stumbled in at midnight on a bus","useful":0,"cool":1},"TysVtL5GZ4PYfBq8IY0JwQ":{"text":"As a local I have always enjoyed the relaxed, fun atmosphere at Buffa's.  The new owners, ","useful":1,"cool":0},"HXf3FIakBTW3FLUPD7KLTQ":{"text":"We stumbled into this spot the night after Halloween and enjoyed our visit. The food smell","useful":0,"cool":0},"kFAZFdEacQfO6IzUR6Hk4g":{"text":"Located in Esplanade, the border of the French Quarter and the Marigny,  get five stars fo","useful":0,"cool":0},"_L9C3cZB86n0Rg-aAnXM1Q":{"text":"The bar is better than the dining area.  The food and menu is different in each place.   T","useful":0,"cool":0},"Wrevy232bamZiq-kfyK7TQ":{"text":"An excellent and inexpensive brunch on the edge of the French Quarter! I went here with my","useful":2,"cool":1},"F7evTwKtYxM_Ls7mvKr8FQ":{"text":"We found this place our last night in New Orleans. The food was amazing! We sat in the bar","useful":2,"cool":0},"cg4TNoI9t3dYoPDGO9mowA":{"text":"Hungry, tired, and in search of food after a flight from the west coast-- Buffa's on the M","useful":3,"cool":2},"few4i3P4s8v6HrixWOf7tg":{"text":"Not Sure if some resturants during Mardi Gras just decide \"Ehhh What the F*ck i'll serve t","useful":1,"cool":0},"mBzPYiyeaKlTd8v1Id0CIA":{"text":"I LOVE this place. Great cocktails, WINGS, amazing corn balls, and Christy is THE BEST BAR","useful":0,"cool":0},"ygWB0C27kO-I-4mPBnCpHw":{"text":"As a picky eater, Eric (the chef) was patient in understanding what I wanted as well as ac","useful":0,"cool":0},"n65fXnrmIbZqEYgFb8eE4g":{"text":"Stopped in for their famous red beans and rice and it was ok. Still the beans were a littl","useful":2,"cool":2},"vsXkcIDGzMcY2P6SHqCHWw":{"text":"Rustic Pub setting. Greet food and drinks. Open mic night was a treat! Burgers are excelle","useful":0,"cool":0},"ObSuGCNO6HD2aYxDTn8Sqw":{"text":"I go here every time I'm in New Orleans. I like to play the Open Mic on Wednesday's. The f","useful":0,"cool":0},"xStWozyUEAzH40O6j8qAUQ":{"text":"Holy hell!I found a neighborhood gem!!! BUFFA'S!!! Fantastic freaking burgers, the slaw wa","useful":0,"cool":0},"aDIV-FA3Np67BtMIXr0ZyQ":{"text":"great food great music great atmosphere!  breakfast anytime.","useful":0,"cool":0},"LwdbcyBNNWcP2QQnGOxKAw":{"text":"This was the closest restaurant to our hotel and the burger place down the street had an h","useful":2,"cool":1},"DfQsrQ7-M-Y5S4SnCmM-hw":{"text":"New owners. Same atrmosphere.  Has that old new orleans feel. The hamburger was just ok.  ","useful":2,"cool":0},"nfj_e55gU1I4wzlZF2y5sw":{"text":"My husband said it best - \"I can't stop eating this.\" Red beans and rice - to die for. Bes","useful":0,"cool":0},"Yy2ipGOsv37K-vAbW83xVA":{"text":"Found this place while looking for a place to eat as the restaurant we tried was closed. T","useful":0,"cool":0},"8Cayca4-nCgeIct6Jwq4Xw":{"text":"I have been to Buffas many time before, but I have never been treated so badly until now. ","useful":3,"cool":0},"V-vb11uBZTEjNFrQkPNz8g":{"text":"The red headed bartender will make it abundantly clear that she does not like you based on","useful":0,"cool":0},"Xk6kWBbqYQ4I1spha8_TbQ":{"text":"It was 2am in the beautiful streets of New Orleans and we needed food.. not just any food.","useful":0,"cool":0},"sjhkks0NqXdSaemypWiPAQ":{"text":"If you want the real New Orleans experience go to Buffa's - but not if you're looking for ","useful":0,"cool":0},"jB3tXafdX5W2XyQ21N6xhQ":{"text":"This place was phenomenal. The music was amazing, the food was delicious, and the staff we","useful":0,"cool":0},"hSZqtga9XmDHlkVkoPCAFQ":{"text":"I ordered some food from them recently and they just half-assed the order. I'm disappointe","useful":0,"cool":0},"NA2t4DJkZABHrTMdmiHEfg":{"text":"This is a great way to start your Sunday!!!  My husband and I along with my cousin and his","useful":2,"cool":0},"bpiQH8wkdTdpwY2l7L49ng":{"text":"It seems to me a very local joint. I can comment that the Shrimp Creole is pretty tasty. T","useful":1,"cool":0},"YQQgVXWdwEO1CCW-eRsERA":{"text":"Buffa's is first and foremost a BAR!  A 24 hr bar with some of the finest characters you'l","useful":3,"cool":0},"MntIE3eCTA0scoFxH13b8w":{"text":"This is my boyfriend's go-to spot for late night dining. It is probably the close proximit","useful":0,"cool":0},"Fa3nE7BM1DNcEG8g51Ie4g":{"text":"We had an amazing week in New Orleans. My husband and I got married spontaneously while vi","useful":1,"cool":0},"q3gvq0XqDd49J2u6dcgEoQ":{"text":"HELL YEAH BUFFAS. Grabbed an Uber, told him we wanted some French Quarter action, and some","useful":2,"cool":0},"seQ8DhPGoQ7mymFe1_SV7A":{"text":"Look for this place late night. Any bar with a 24 hour kitchen is worth a try. While I was","useful":1,"cool":0},"uuv2Y0i2050G4Pp4JivxRA":{"text":"This restaurant was recommended by our tour guide. He said they had great food and to go s","useful":0,"cool":0},"fMB3Y1xGXn4lDfz110dLug":{"text":"Everyone was super friendly and down-to-earth. Waitress gave great recommendations and eve","useful":0,"cool":0},"WPzcNuKzN5XDUREDyr7xSA":{"text":"Great food was unexpected in this neighborhood joint but that's exactly what we found at B","useful":2,"cool":0},"t4OD0jv8MlLY5RguuVQPKw":{"text":"This place was great! We like off the beaten path and the French Quarter is no exception. ","useful":3,"cool":2},"cg4ZYg2Lk6B2w5ifAZCLEA":{"text":"Really good food, especially the burgers and red beans. About as un-touristy as it gets fo","useful":0,"cool":0},"ov3pcUKIRD9qBR45KibT7w":{"text":"Kitchen was very slow. Started eating my greasy burger and watched roaches crawl the wall.","useful":1,"cool":0},"2QSwSsr8TJC3dWk9kvikjw":{"text":"My wife talked about how great Buffa's was the last time she went to NOLA.  She insisted o","useful":0,"cool":0},"JxqgBxliEr_C8OOp45MkMQ":{"text":"Had a great time at the Sunday brunch, eating good food and listening to seasoned jazz art","useful":0,"cool":0},"c2wB77zbCeBuBzF9L-WcqQ":{"text":"This is a great venue to catch a late night meal while lessening to a live band after spen","useful":0,"cool":0},"Z95zJX_iDSDrzFOLfDyeMA":{"text":"The customer service is out of this world AND they're dog friendly! The bartenders gave ou","useful":0,"cool":0},"oTX4ro2NfwfX34r2tLUx5Q":{"text":"The food here was absolutely incredible. I would high recommend the carrot croquettes or g","useful":0,"cool":0},"DCDTISuV_dnERhVUt4wE0g":{"text":"Cheap food in a dive bar with live music! Prices are pretty good and I've heard the drag s","useful":0,"cool":0},"CtXRSRvV7G43waOUqG4FgQ":{"text":"I've been here twice for food. Once it was terrible and once it was amazing. So I guess fo","useful":2,"cool":1},"lRfJbUMF8hyO-XxpZ6Qmvg":{"text":"Went to Buffa's for Father's Day brunch with my dear ole dad and the rest of my family. He","useful":1,"cool":0},"uVrKxB4m-iV-puWcUAHE1A":{"text":"My wife and I wanted to go t Port of Call but it was packed with a long wait, as usual, so","useful":2,"cool":1},"5BaSZ7pMjJ-dMb8sQBfO_g":{"text":"Breakfast was great. shrimp creole was amazing. Could definitely be shared with two though","useful":1,"cool":0},"wA9LqDyMKQ08T2hpfHkZbA":{"text":"Best burger I've ever had. Holly (bartender) and Ennis (chef) are amazing. No more port of","useful":0,"cool":0},"5P1bQRFEsZ8KS0AZnces-A":{"text":"Open mic Wednesday nights with a great burger to boot!  I got to hear about ten acts over ","useful":0,"cool":0},"SNSRLxoZ9VfUhbyj5D_mdA":{"text":"Buffa's is one of the more unique restaurants in the FQ (ok, on the fringe of it). It is a","useful":1,"cool":0},"d3epXg10FWDZLL6d0cpw0Q":{"text":"Alligator ettouffee, where have you been my whole life?!   We stopped in because it was cl","useful":0,"cool":0},"XlNhybVfDARlrtVDJuW-1w":{"text":"This was probably the best gumbo I have ever had. Alligator and chicken gumbo.You could ta","useful":1,"cool":1},"l16-RtpJx_kp_uh7g90aMA":{"text":"Prices are on the edge of being too high for a place like this. Just on the edge. Ok, over","useful":0,"cool":1},"SofuCyXn7sc4jnbVnThqFQ":{"text":"Friendly bartender. The place has a great vibe and location. The boudin bites were good bu","useful":0,"cool":1},"B3dHnThi8ws20Q4rKw-xWw":{"text":"Was here on August 27, 2018. What a f****ing b****h!!! The service was absolutely terrible","useful":2,"cool":0},"O7634vVV8EnBBj3EIWZbWQ":{"text":"A friend of mine who's a regular visitor to NOLA told me to come by on my next trip, and t","useful":2,"cool":1},"IKMrx0t8QxDOFZ4TFU23iA":{"text":"During our five days in New Orleans, my girlfriend and I heard lots of great music (Rebirt","useful":3,"cool":2},"lSL33Kh1q4L3cGRNy-HzQA":{"text":"This a dive bar that's not quite the Quarter and not quite the Marigny on Esplanade with a","useful":12,"cool":8},"_Bc3H7__ybRs_TqpG65P_w":{"text":"Really good burgers.  Enjoyed the Gotham Knight burger and the spicy Dark Side burger. Gre","useful":1,"cool":0},"aMZDIcX7FmzhOu8oOMVRvw":{"text":"Always a delight. Kayla and Holly are God's own angels. Such a travesty, however, that the","useful":0,"cool":0},"XayCItd_G2sGIoy2BNX3-Q":{"text":"I will never return to this place again.  I have always tried to support this place, but t","useful":1,"cool":0},"O5GQwV5hhVil-riEG3OJsA":{"text":"If you're looking for a correct order, I wouldn't come here. Two of my friends came from L","useful":1,"cool":1},"bdpqht4yZo7neA82izstrg":{"text":"Go for the music!!! The Jazz was amazing.  I got the jambalaya and was extremely disappoin","useful":0,"cool":0},"JHXY1r4yJBebO4Y6Jz54Vg":{"text":"ahhhh buffa's.\nlate night food.","useful":0,"cool":1},"J_fHN14lCFXbICiN43l0Yg":{"text":"This was such a great find everyone loved their food! Great prices!! The Ruben was so good","useful":0,"cool":0},"P7y3Sv1DyRJilayz9RqpAQ":{"text":"Horrible rude service. Food is subpar. Would Not recommend!  Jazz brunch not worth the hyp","useful":2,"cool":0},"43yXv--8E6AM1ywi9jyrXw":{"text":"We have been here a few times and the burgers here are as good as their competition across","useful":1,"cool":1},"zu4cFQxxXGs31Dmy4yL_-g":{"text":"What a BIG disappointment! Extremely expensive for mediocre bar food. Bartender was friend","useful":1,"cool":0},"JK366H_So8bKD1TkeX4dow":{"text":"An absolute terrible experience. I've never been treated so rudely when I plan to spend my","useful":2,"cool":0},"-1pt6lpg32Y202CJeiWJug":{"text":"After wandering the Quarter all day, we made our way to Buffa's. We had hamburgers and fri","useful":0,"cool":0},"9-VAtR19mhB2G4P288476Q":{"text":"Stopped by to grab a burger for dinner! Wasn't disappointed! Cool little atmosphere and ba","useful":0,"cool":0},"34ZCMurmKCesLBO4f817IA":{"text":"Alligator bites in crawfish bisque, BLT sammiches, Ice Cold Beers and Cajun Redfish with B","useful":0,"cool":0},"wf0UEUTfvOe7Cit4Tb6Uiw":{"text":"Came here for brunch on the way out of town. Friends said to stop in for a mimosa and stay","useful":0,"cool":0},"a0qNsPBLC5YfvvlZEebcQw":{"text":"We were turned away two days in a row at Port O Call, so we Yelped 'Burgers,' found Buffa'","useful":1,"cool":0},"4CLQbZN2aL2xJ8Ye_fk3PQ":{"text":"Buffa's is a great place! Marc was very friendly and entertaining! He made the experiemce!","useful":0,"cool":0},"DR-wFSpMzekLsxThfwuoJw":{"text":"This is a great little New Orleans gem.  Great food, great music and an all around perfect","useful":0,"cool":0},"R-5JlFPhVFwp5naKIpngpA":{"text":"Disappointed. Stopped in for jazz brunch. The jazz was lovely and very enjoyable. The food","useful":1,"cool":0},"FTdpv4ddEz5KXCtyhpiDuQ":{"text":"CASH ONLY!!!   Park on the street.\n\nBuffa's Restaurant and Lounge are moving up to the top","useful":4,"cool":0},"_JXPmJvoBTSNQR9JjuR1Iw":{"text":"For a night out I wouldn't say it's one I'd recommend but the bar tender was great! He fix","useful":0,"cool":0},"jkh0yGanfND9YM_ikvLfNQ":{"text":"Nice little neighborhood joint with a real chill atmosphere.  They could do a little bette","useful":1,"cool":1},"64l3MZihrAkdhREuvZVi8A":{"text":"For more than a decade my wife and I have been loyal customers at Buffa's. We have taken c","useful":1,"cool":0},"YNdj2YzqWwV2xtNmbvMgtg":{"text":"Bang for your buck: 9/10\nQuality: 7/10\nService: 10/10\nAmbiance/Location: 10/10\nOverall: 9/","useful":2,"cool":1},"9zp2DfULiIlPwQBmAISf6Q":{"text":"I'm hesitant to write this review, as I love this neighborhood haunt and don't want it ove","useful":3,"cool":1},"hplowuvhUShB2Sw79vagTw":{"text":"Dive bar with good food. Burgers were cooked well with a nice flame grilled taste. Good sp","useful":1,"cool":0},"NQGV-JYVgoU3AdIIwj-G1w":{"text":"Worst service ever. Too old of a venue to not have this down. Go back to basics guys. Extr","useful":0,"cool":0},"t8Iyzap3zfS2zcwnDMlgfg":{"text":"Very cute little bar. Great vibes, good music and amazing food. Best Caesar salad I've eve","useful":0,"cool":0},"3g8SQpjeI_SGJbTYphHhig":{"text":"Service SUCKED. I was ignored by the wait staff and the bartender, who was busy flirting w","useful":2,"cool":0},"TcM1J_-oYAdEdLUxZDFzyw":{"text":"I don't think I've ever left a 1 star before in my six years on yelp, but I think Buffa's ","useful":4,"cool":0},"WqKY04AScuYz2Jaw4boC9Q":{"text":"I'm giving this place 5 stars just because we had such a good time there. We were walking ","useful":1,"cool":1},"SMG5w5qXFryYfxWjl8KT8Q":{"text":"I came to NOLA with my huge family (20+ people) the town had very few restaurants that cou","useful":0,"cool":0},"qwFUJdSib7tsj1CEIWsMyA":{"text":"Buffa's is a chill place that offers delicious late night eats. The bartender/staff are su","useful":1,"cool":1},"zubwQFVco8HopXC-RzCL6w":{"text":"Went in the night of NYE. Placed two orders. One was just a order of fries with a drink an","useful":2,"cool":0},"FGdTVPKV0gFy-6JEfGmRpA":{"text":"I went with a friend after Bayou Bayogaloo to get a burger because it has been a while.  I","useful":1,"cool":0},"NF74HUU8uCQWcJfquZOISA":{"text":"I was in town for my cousin's bat mitzvah, having just completed a major project for work ","useful":3,"cool":1},"9vGJmTLLz3-8v-MRl0bgrw":{"text":"In New Orleans for a friends bday and had so much fun at Buffa's. Great drinks and food an","useful":0,"cool":0},"AMjaCuT8q--pIfSFu7J6bQ":{"text":"Love this bar! It was our bar-away-from-home all week. Kayla made awesome bloody marys and","useful":0,"cool":0},"4W7qOFdN1CIgaWmWGrJuqg":{"text":"Homophobic bartender. Can't work in the quarter and not expect us gays not to show up","useful":0,"cool":0},"rk8ADUQqxBhCLguNzOjorg":{"text":"I had to convince the boyfriend to have brunch at this place because he kept saying \"this ","useful":1,"cool":0},"ZDUfEeF9IQW-bTJwREk0UA":{"text":"What a lovely neighborhood spot. I've lived around the corner for five years. I love this ","useful":0,"cool":0},"0I08UUiukvPro7SVlDMGzg":{"text":"Excellent food.  A bit greasy but everything has been good on our three visits there.","useful":1,"cool":0},"nomGkiFYxNkWqbWace8Iog":{"text":"Don't order take out from here. I ordered a burger and alfredo and my fiance went in to pa","useful":0,"cool":0},"9K-u2d_bjS50PWW1kraaQA":{"text":"Neighborhood hole in the wall type place that had great food!  The alligator balls and cra","useful":0,"cool":0},"zFvRY4sKMlywh-nTpDDieQ":{"text":"We wandered into Buffa's on New Year's Eve and we were so happy that we did. This place is","useful":0,"cool":0},"xsyd5agtalLe334Cc5RS9g":{"text":"The Best patty melt I've ever had!  The venue is intimate, interesting and very neighborho","useful":0,"cool":0},"PFQVZrFrvMvYeNy6uOLpqQ":{"text":"Fantastic experience! The fried green beans are the bomb. It is a must get if you are ther","useful":2,"cool":1},"7kMKDubcqbxYneblfUCzZA":{"text":"Great local place. Solid food, great music.","useful":0,"cool":0},"YxPBWhb40RBHcz5tEuFJlg":{"text":"One of the cleanest neighborhood dive bars in the city.  Yes, the menu is extensive and th","useful":0,"cool":1},"Ufl-Jowk3WQJg9znUBGLDA":{"text":"My favorite burger in town! Slightly overpriced but well worth it. Beer selection is not g","useful":0,"cool":1},"5z57xkxD7Nrm48aqpsnYfw":{"text":"KILL BILL: roadside diner ambiance;\nOKAY: not spectacular: frozen onion rings, boring club","useful":4,"cool":1},"R8fplkEt_qaKS3wRxxTlpQ":{"text":"Everything came out slathered in mayo, despite no mention of it on the menu.  It's gross, ","useful":1,"cool":0},"0X8fOTNoQwFWVmOLO28nKA":{"text":"** Apologies in advance for such a long review **\n\nThis is a pretty decent place in betwee","useful":13,"cool":10},"zaBly09QBSnpAIQ89S2BbQ":{"text":"Buffa's is a neighborhood gem! If you're a tourist looking to escape the hustle and bustle","useful":0,"cool":0},"LewrAjC8frniVckUFwqy4g":{"text":"I still like Buffa's, but it's not what it used to be, sadly.  Bartenders are not as frien","useful":22,"cool":11},"u3gMHFVXflyQdrZMMT0jmA":{"text":"Come to jazz brunch with at least 2 hours- it's packed, but the music and atmosphere is wo","useful":3,"cool":1},"waU6jHEr-udWWTGkY3fQKQ":{"text":"Definitely a place to check out! Off the beaten path, but oh so good. Get yourself an orde","useful":1,"cool":0},"C944dBMAzGsttNKxLnE6YA":{"text":"There was a miscommunication with an order in which the owner promptly took care of it kin","useful":1,"cool":1},"OvX3PfP3y2fs_bjijgWxvg":{"text":"Ok Buffa's, you redeemed yourself and earned an extra star with a solid Sunday Jazz Brunch","useful":17,"cool":10},"-D_f_ygEsf06hdKVSZ_AEQ":{"text":"I am so glad that they open! The Dark Side burger with Chuck Sauce, spicy and sweet, is fa","useful":0,"cool":1}}