{"KlTSkrdR_6--d0VLDgK-QQ":{"text":"Seemed like what happens when the top chef leaves and the restaurant stays open.  Service ","useful":0,"cool":0},"iP-pPxKGEjGME1D9y2WBhA":{"text":"Came in with a party of 6, service was slow and our waiter had a bad attitude because we w","useful":0,"cool":0},"3nSM8Wx7GSPCyW5SFoTkmw":{"text":"Simply the best food and eating experience in New Orleans. We stumbled upon this hidden ge","useful":1,"cool":0},"EPqTRixTzk8Ic00Im-er1Q":{"text":"Great food, average service and wines hit and miss.\n\nClassy little restaurant that is perf","useful":0,"cool":0},"GI9IqdIfwOLfTMzr8wEftw":{"text":"This is about the fairest review i can do for Le Foret. I reserved a table for New Year's ","useful":5,"cool":2},"rdl68nmVMUOJRiziyYpNSw":{"text":"Food was excellent, nice decor and ambiance until the bar got busy which was loud.  Filet ","useful":0,"cool":0},"huLuZtYcWI_hsvqXWbigQg":{"text":"I have been longing to try this restaurant for years. After the long wait I was very disap","useful":0,"cool":0},"sFA5Hq6L0JPskIIMEppq9A":{"text":"Le Foret is a nice, quiet, romantic, but equally doable for business dinners, type of plac","useful":4,"cool":4},"kb9j3rot4XTBocmeQgwSoA":{"text":"As much as I was looking forward to having dinner at Le Foret I'd have to say I was very u","useful":16,"cool":9},"zkEAXAiRnosaaYlxpedH0A":{"text":"I don't eat here a lot but I think it's a very solid choice in the heart of New Orleans ce","useful":0,"cool":0},"sx-pXndssNUsPwfQJ3izig":{"text":"Excellent meal, generous portions, nice atmosphere but the price is extremely high.","useful":0,"cool":0},"g0UyTF4vSkiDLWNeDnSyVA":{"text":"We had a great meal here and enjoyed the tasting menu with wine pairing. It is pricey, but","useful":2,"cool":0},"jjohRCDPCjBQG9yOF9fUYg":{"text":"We were referred to this restaurant by our concierge. The appetizer was pretty good but ou","useful":0,"cool":0},"bjEv1QkfQeZzxe9eOFS_Jg":{"text":"I went here with my girlfriend and her parents to celebrate a special occasion and it was ","useful":2,"cool":1},"YLEtgd0ZELXBCRqfRJo9ZA":{"text":"YOUNG PEOPLE BEWARE! you will be treated as a second class-diner at this establishment! My","useful":1,"cool":1},"ApU-OJmY1wwphH105kiGWw":{"text":"Service A+\nFoie Gras & Oysters Rockefeller were top notch appetizers, then followed that w","useful":0,"cool":0},"ssWJBgxm3LjU3qKUd2TGug":{"text":"one of the best dinners my husband & i have had in new orleans! so elegant & such a fantas","useful":0,"cool":0},"kig_GTXzemqCqF96WEJhdQ":{"text":"My husband and I really had excellent dinner. Everything was delicious . My husband had th","useful":0,"cool":0},"WsBoho-Yj2HTOmBJloETTw":{"text":"I had been here last year on a date had an amazing experience thought the food was great s","useful":0,"cool":0},"-aXh755Cqcwc55lU1LeCCQ":{"text":"The manager on duty butchered our wine bottle selection... Only got that it was a merlot c","useful":0,"cool":0},"4E1OH92LudMA_9-uMX9b1w":{"text":"Elegant spot, dining room a bit loud. Service slow; empty plates linger as stomachs growl.","useful":0,"cool":0},"1OEYEsEewxoReAvTrxL9RQ":{"text":"Very good. Best duck I have ever had. They fell down on desert, the creme brûlée was like ","useful":0,"cool":0},"Sv50BuNgUHuvzIasTb6tug":{"text":"Classiest French Restaurant in New Orleans. They took great care of me and my party.","useful":1,"cool":0},"JZGVtFfztdt3DGQ2lVC9rQ":{"text":"In town on for a business convention. Tried several restaurants before finding this gem. G","useful":0,"cool":0},"TpQX5SGhwrUsZJQqL6mN3w":{"text":"Five stars mostly for that seared foie gras.  Wow.  Everything was amazing, but that foie ","useful":4,"cool":2},"hvH0WAn5xDtxFFyrz82mRg":{"text":"Gorgeous restaurant. The wine selection is almost too plentiful. The staff were perfectly ","useful":1,"cool":0},"aYbiGQlG3dBqPcF1oDSGfg":{"text":"I was very excited about finally coming to eat here. It was such a let down. From the food","useful":2,"cool":0},"xgJwMKJX9anywWNViFcYng":{"text":"Phenomenal food in a low-key, classy space.\n\n - Glazed pork belly was outstanding.  Melted","useful":2,"cool":0},"SKPNsFiOlpFcGSNFMThE4g":{"text":"Ok, before making our reservations here I read the reviews and was a little nervous ,but d","useful":1,"cool":2},"wdAixY5icqgjpSNlEEhVIg":{"text":"One of the best places I have eaten. GREAT customer service, generous bar, ALL the food ou","useful":2,"cool":1},"R40dyv6Pixp6ZxmE5LUgRA":{"text":"Fabulous!  First night in New Orleans and it was an excellent choice. Beef tenderloin melt","useful":0,"cool":0},"Syoe4-GDtG5vvvZka1O4Lw":{"text":"Please don't kill me just because I gave it a Four-star, but its too harsh to give it a 3-","useful":3,"cool":0},"oZgsqUZ93p1n3sbZvxhoiQ":{"text":"Went here for a friend's birthday, party of 4.  She loves french food, me not so much. We ","useful":1,"cool":1},"nH5pRoIX0vhxTuVPx2UxqQ":{"text":"WOW!! What a great place. We had a reservation for 15 to begin with, I called twice to cha","useful":1,"cool":1},"in_OiyMTY9pKqj0Q03Pd0w":{"text":"This is my new absolute favorite restaurant in New Orleans.\nWe had the chefs special menu ","useful":1,"cool":0},"d6OVK_yPj2calo6X-iXRcA":{"text":"In February of 2011, my wife and I were in a crazy mardi gra parade and then went looking ","useful":1,"cool":0},"kzLkyNQxhHkPIvhRuL3ccA":{"text":"We were staying at the Omni and our hotel suggested to us Le Foret for a last minute diner","useful":0,"cool":0},"TJ1-Qxs73IVX0TdDjeqnag":{"text":"I liked the photos on Yelp so choose Le Foret for our last night in New Orleans and it was","useful":0,"cool":0},"7NUpV5AuXMI3eNhhtRUxAg":{"text":"My pedestrian expectations of what this restaurant would be were pretty soundly annihilate","useful":1,"cool":0},"ZmyMxgS8q_9C0WE0gRD51A":{"text":"Beautiful restaurant with quiet romantic setting. Everything was very good--cocktails, app","useful":0,"cool":0},"AcI7K_w87G6u7VlC4-shug":{"text":"Pros:\nAwesome food,\nTerrific service,\nGreat atmosphere,\nTo describe this restaurant in one","useful":2,"cool":0},"AFnJ7GtrxdPSfTWh0RTwxw":{"text":"Beautiful venue. I would love their chandeliers in my home! Nice fresh cocktail menu--I re","useful":8,"cool":2},"auSslAljATBewxPhs1CtbQ":{"text":"crab cake was the best I ever had in my life. It was that good. The alligator appetizer wa","useful":0,"cool":0},"Ecc99E9dpeAPzAV8FXnK6Q":{"text":"Underwhelmed. \nNice atmosphere, great service, but the food was unimpressive. \nVery techni","useful":0,"cool":0},"R0XKNCEs03ZApnDR2ECphQ":{"text":"Fantastic food & service! The asparagus was literally the best I've ever eaten. The beet s","useful":1,"cool":0},"mgdjSf-IAUe0tkL7Ci643w":{"text":"We must have set our expectations a little high after so many fine dining experiences in N","useful":2,"cool":0},"IV3EVaG4VUizV-nkSWEygA":{"text":"Had a great dinner with a friend her. You must order the duck. The leg was very very dry b","useful":0,"cool":0},"o8QIOf34tTyuYu7UgdNxiQ":{"text":"I can only review the bar as we stopped in for cocktails on our way to an event. Chris the","useful":1,"cool":1},"SBBIbyFwMB5Mib4MzpBjYg":{"text":"Worst dining experience ever! My last night in New Orleans..dinner with a large group...it","useful":1,"cool":0},"dpGrYd9AEg6Yth8JWPKKoQ":{"text":"This place has a really nice decor and that is about the only nice thing I am going to say","useful":1,"cool":0},"_OVHFr15wYtG-drLSfCgRQ":{"text":"Le Foret makes you feel special.  The staff are very friendly and the ambiance was perfect","useful":0,"cool":0},"aJ-cUizF01Lg7Yk_8aTJjg":{"text":"Fantastic experience! Best meal I had in New Orleans! Will go back everytime I am in town.","useful":0,"cool":0},"VY9jR4ByX2QeBM136DaWTQ":{"text":"Great food but try to get a table upstairs. \n\nWe stopped in here for a client dinner based","useful":1,"cool":0},"Zll5nPNmzQrRoBVN4KzroQ":{"text":"One of the most elegant restaurants that I have been in NOLA! It is within walking distanc","useful":3,"cool":1},"mIgLrCBMzOIKJznHLYa5XA":{"text":"Le Foret has now been open for six months, and it was worth the wait . . .\n\nThe main floor","useful":4,"cool":2},"tbkIK0l5pdMdF26Cx1L-Qg":{"text":"We stopped in without a reservation and was seated right away.  The staff was great and we","useful":0,"cool":0},"t5aTivUv6eRUa6NTzV1jDg":{"text":"Beautiful venue. Had the pre-set dinner menu with a wonderful apple shaved, walnut salad a","useful":0,"cool":0},"hjLvya23lk01clsRyCdeag":{"text":"The San Antonio Spurs contain elements that are the embodiment of Le Foret - ruthlessly ef","useful":1,"cool":0},"V_M4nuI0ymGAdvxikswBqw":{"text":"I visited this restaurant last Friday evening to try their tasting menu with wine pairing.","useful":0,"cool":0},"936KSkd0A40rNsHQcy14xg":{"text":"Fantastic food (Foie Gras, Lamb all cooked to perfection). Great friendly service, wonderf","useful":2,"cool":0},"eYLClR4XTD0ujW0RPiSzjQ":{"text":"This place was amazing and accommodating.  One of the best dining experiences I've ever ha","useful":0,"cool":0},"V6SAYHOs7Z4Q2beHltjHeQ":{"text":"I just had one of the finest filet mignon steaks Ive ever had in all my 60 years here. The","useful":0,"cool":0},"_fSy1f22ywMISH4y9yKllQ":{"text":"Well the place looks amazing !  \n\nWe went wanting one thing... the Foie Gras PB & J Seared","useful":0,"cool":1},"3V6Y-hUI_dmTE7ouXEFvIg":{"text":"High-class place, in the best sense of the word.  Top-notch service, delicious classic Fre","useful":0,"cool":0},"0yVrVVRVK6zUgea_iSuK7Q":{"text":"We ate here on New Year's eve. Not only was the food exceptional, but the service was thou","useful":0,"cool":0},"SPVVN2Y8gQmQVzWhTMOSug":{"text":"I will fully post a raving and obsessive review later when I have a bit od distance and th","useful":2,"cool":1},"e-qZI5INBxlX228w04_Ilw":{"text":"If you are looking for a romantic dinner this place is great. It's small, quiet, and dim. ","useful":0,"cool":0},"FLD6Fu75UZm-FjpSJyT_gQ":{"text":"We ate here as a part of a large work group (50+) which might be the reason for it being a","useful":0,"cool":0},"CB4JABTbDmR23YQwA_GCXw":{"text":"(Again, you'll have to forgive my rigorously high standards when it comes to these kinds o","useful":1,"cool":1},"tlqFuZiRzpjIk-4uBRR53Q":{"text":"Very good! The waitress continually used my first name throughout the evening as I had mad","useful":0,"cool":0},"6ZUoGezSJCE0zhW75a_RAg":{"text":"On our last night in NOLA, my wife and I were feeling dejected after three uninspired meal","useful":4,"cool":3},"V5Tb5YioqfFOJztH2zaYEw":{"text":"I would rate this higher than the 4 stars showing on yelp. Food excellent. Service fast, e","useful":1,"cool":0},"Hj6z5MrjDbSU2VI8OSc-cg":{"text":"We canceled our August reservations for dinner here and I do not regret it! It's a beautif","useful":0,"cool":0},"JX7iqjSgPcq-uEAKZpdm4Q":{"text":"I wanted foi gras because California has already banned restaurant from serving foie gras.","useful":2,"cool":0},"bNHElN-VcbiY2QBV8cYbKA":{"text":"I hope to increase this rating to five stars upon our next visit to Le Foret.\nTHE.  FOOD. ","useful":2,"cool":0},"c2uxVPmhorIngWD-nPRxaw":{"text":"Amazing French cuisine and great service. Definitely returning for their halibut and duck.","useful":0,"cool":1},"Ph3v8mIzaH2gLhh3Jb66cQ":{"text":"My First Yelp Review!!! =)\n\nI've been waiting to try out this restaurant because it receiv","useful":2,"cool":0},"tXgixaku3OxxlCmkw0pvtw":{"text":"Disappointing experience. We had dinner at Le Foret on a recent Saturday evening .\nThe ser","useful":2,"cool":0},"Yl9o4kUF3Ca5iEWzxQbBUQ":{"text":"We had a lovely dinner at this restaurant, However, when the bill arrived we were CHARGED ","useful":2,"cool":0},"fTx0bwC4pnysaUx-uqOABw":{"text":"I can't remember ever having been to a restaurant where I felt so unwelcome. From walking ","useful":1,"cool":0},"3ycshUFkEgU4AGxi8Ih4qg":{"text":"Let me start by saying Most of the food was excellent, the service was abhorrent.  That's ","useful":1,"cool":0},"nwgz-anfDpWGm1Vtv6Ucrw":{"text":"There were four in our party and we had reservations. We were sat immediately, at a table ","useful":0,"cool":0},"xiKCr0i-qxO2t7d8uRRkAQ":{"text":"I downloaded the yelp app just to write this review. The food was OK. However, as you know","useful":0,"cool":0},"yh5NgaLol-wyul-IB4DoAA":{"text":"This place is only for the fancypants and special occasions. Its quite pricey however the ","useful":2,"cool":0},"TbAlapqQJQTOpPwPzzvMcA":{"text":"I held my friend's birthday dinner here with probably a party of 6 and the experience was ","useful":0,"cool":0},"UuckX-XGwvW7PtroUlUd4A":{"text":"We came to this restaurant after walking by last night on our way back to our hotel.  It w","useful":0,"cool":0},"8LPipJnKiZhlpTr2jNYS8A":{"text":"How have I not written a review for this place yet? Been here twice,  both for office part","useful":2,"cool":0}}