{"i6kn2RpoyFv-LWneuTAWEg":{"text":"The riverfront park is a great place to relax and view the Mississippi River. Good for peo","useful":3,"cool":1},"qi8ReKTKOAzueFnHlFS2AQ":{"text":"It was here in this park that I first laid eyes on the Mississippi River. It was a sunny J","useful":5,"cool":4},"-BeQvH5g5zaRGeyhiOcPhg":{"text":"Even on the rainy day this was a nice place to walk and watch the steamboat Natchez leavin","useful":5,"cool":4},"YwIHW6vm738KCd3SJJabAA":{"text":"Woldenberg Park is not a park in the traditional sense of the word.  It is basically a wat","useful":0,"cool":0},"8hg246fqtvPE7SDhgtjaGw":{"text":"Just got told by an inarticulate park security worker that I had to move something for \"in","useful":0,"cool":0},"_NPGSecjQJYm1gmY_iQ7_A":{"text":"Love coming to this place with beignets from Du Monde! Great place to stare at the Mighty ","useful":0,"cool":1},"yANfGH7RK6yWPIQmppyO-w":{"text":"A pleasant respite after walking in the muggy Quarter streets. We picked up some po boys t","useful":0,"cool":0},"QrEPHN4nfRoyFsqMdKW-XQ":{"text":"Woldenberg park is a wonderful way to stroll along the river.  Hard to believe this idylli","useful":2,"cool":1},"zDa0ATFszXG-eNJZXM8lAg":{"text":"A great place to take in a concert or festival, people watch, or simply transit down the r","useful":0,"cool":0},"Z6qeoiOqHHr0NPU9BjOpeg":{"text":"A nice place to visit for a good Riverfront view. A brief walk to the Aquarium. The Seafoo","useful":0,"cool":0},"KAtgWIjMTGQpg0pQ3ot_Ng":{"text":"I come here often because I work in the French Quarter. I'll take a stroll along the water","useful":2,"cool":2},"nICYHN9VdiZCy_JcBGrNvQ":{"text":"Great place to walk right next to the Mississippi River and take in the historical beauty ","useful":0,"cool":0},"JUSlIeNLe0KchCVmSIN_Lw":{"text":"This park is very pretty and a welcomed addition of green space in this area. It is a grea","useful":0,"cool":0},"3_OYsMPwvc1itGBflwSW_A":{"text":"Good for waterfront walks with space to stroll without being crowded.  Nice breezes from t","useful":9,"cool":8},"_8qYBlDhPIMUw47Crty5LQ":{"text":"Woldenberg is good for a quiet, peaceful walk, but also a great venue for festivals - most","useful":3,"cool":2},"feKuDX-m4LE64MZvt7aFHw":{"text":"Beautiful sites and images while walking through this park. Next door is the aquarium and ","useful":1,"cool":1},"9v58Qady4A08b2DPdPS2Fw":{"text":"This is a covienient place for a jog or bike ride along the river , & there are many other","useful":0,"cool":0},"tsg4XbsQsiQcDlTDnb_PEA":{"text":"A great spot for a picnic and a very tight squeeze for festivals.  The French Quarter Fest","useful":3,"cool":2},"7P8miStrRicMop6hJhgZFQ":{"text":"Woldenberg Park is a great hang out place. It is not that far of a walk from the French Qu","useful":4,"cool":3},"7hfKv3AfNpeaFPYVezRwNA":{"text":"Beautiful riverfront park, here's my breakdown:\n-Nice stroll through this park with views ","useful":17,"cool":18},"WEGu5OTCeEDje3e5AXBQjw":{"text":"Woldenberg Park is a great place to stroll and watch the river.\n\nThis park is a great part","useful":2,"cool":1},"P6VhSkUPJSbqDIS_fsL1EQ":{"text":"So, the name \"Woldenberg Park\" is kind of misleading. It's not really a park at all. Well,","useful":4,"cool":2},"obgDlOnWuNWUprYl5pbe6Q":{"text":"I nice place to spend a couple hours walking around.  Nice views and food close by.  It's ","useful":0,"cool":1},"Vw3_fMDnep_YJQZE8uuDmw":{"text":"Awesome river front location. French Quarter Fest is always a blast here and I've caught s","useful":0,"cool":0},"uOBMl6_4-rGgUBfrg-HOOQ":{"text":"This is right across from Jackson Square, and on the same side of the street of Cafe Due M","useful":1,"cool":0},"MZjnJdbFVKPmyj9fHiX-eA":{"text":"Great little park and walkway along the Mississippi River to people watch and see the barg","useful":1,"cool":1},"GHvppLLlUfoxmePs_RMuqQ":{"text":"Nice place for a walk or run. My favorite thing to do is let this kids run around. They lo","useful":1,"cool":0},"286fxAu1xJGOU_EjWYJ74g":{"text":"I like walking along the riverfront. Relaxing stroll. The aquarium is here. Holocaust memo","useful":3,"cool":0},"GG8EywBLAjX8Gj9_trZ_4A":{"text":"Woldenburg Park is a nice walk from the Riverwalk & Aquarium of the Americas along the riv","useful":0,"cool":0},"8TrHCqsLZvhQ2ECQGkUF0w":{"text":"Great park that abuts the Mississippi River.  There are plenty of benches and green spaces","useful":1,"cool":0},"jdT_4slEUohLudd8NtBHOA":{"text":"I have always enjoyed crossing the Mississippi River on the ferry from the West Bank Algie","useful":1,"cool":1},"vj-qjAxJRbDZGPgzSeIDpg":{"text":"Great place to go and think or walk your dog this park is a lot cleaner the other around t","useful":2,"cool":2},"4LWzAmtTvEq--UDKMWhcxw":{"text":"Nice area but trash everywhere. Very unfortunate! We still had a very enjoyable experience","useful":0,"cool":0},"nw2KmvCF7MLlrfvZsyjFSA":{"text":"Such a lovely patch of green at the riverwalk area that hugs the Mississippi River. I love","useful":3,"cool":2},"V4b4TvUJmlNBrJaPACLo2A":{"text":"little park by Mississippi river with public bathrooms that I took advantage of. This is v","useful":2,"cool":0},"h5Y2WUS94jmhMWTku3AVqw":{"text":"Nice little park along the river. Good scenic route if you're headed to or from Frenchman ","useful":0,"cool":0},"7qaCGlB9a0e8Qtn69gBWjw":{"text":"Woldenberg Park is a fabulous place to stroll along the Mississippi River!  A quick walk f","useful":18,"cool":15},"PrxJNRz5fapoWSp5Igohnw":{"text":"The Woldenberg Park was a very peaceful place to visit we were able to walk the park and s","useful":0,"cool":0},"OIaKBichEFkSKB8H35d4UQ":{"text":"Cute park along the Mississippi River with great scenic views! Great for a nice leisurely ","useful":2,"cool":1},"5woVx5H7IdkvO9b9lyAAPw":{"text":"This is another of New Orleans nice parks. It is located right off of the Mississippi Rive","useful":2,"cool":1},"BSwdEQlQNGUnkFCX5-ENhQ":{"text":"Named after philanthropist and park investor Malcolm Woldenberg (1896-1982), the park is a","useful":8,"cool":7},"LlY17FI7uvQdMjJ9nEM3_g":{"text":"Nice riverfront park along the river with some statues and lots of places to relax. If you","useful":0,"cool":0},"1ieek-3u7_tSj-iYnHWNMA":{"text":"My friend was visiting from California, so she wanted to go and look at the Mississippi Ri","useful":5,"cool":4},"q0uye200PuNScz91CBxCBQ":{"text":"Lovely walkway and park on the banks of the MIGHTY MISSISSIPPI  hang out and watch paddlew","useful":1,"cool":1},"WfX7NLZxWq89h2GTaAHFPg":{"text":"This place was absolutely stunning in breathtaking I really enjoy just walking the length ","useful":4,"cool":4},"Xao-rFOFA-Erk4HVbvPaXg":{"text":"This park provides a nice little stroll along the water. It has a decent sized patch of gr","useful":1,"cool":0},"qcPEjH3L0wt6Z6TiZGKWrg":{"text":"Scenic, peaceful, beautiful. I visited while the sun was rising... beautiful experience. L","useful":0,"cool":0},"P-axcYyRF_Ve7oAigkg4-Q":{"text":"This is actually the place where they dropped off the first slaves. It's a few monuments t","useful":2,"cool":1},"x0iLxfyRcU26e_NA-jzAFw":{"text":"I decided to take a walk on the banks of Mississippi at the end of a long symposium. The s","useful":5,"cool":4},"zPG6CLdiN9vLswWvXP1SaA":{"text":"This was a cute little walk next to downtown! Not exactly a park per say, but it's a diffe","useful":0,"cool":0},"6CLVgWDKUuwl-caUENRROA":{"text":"Want a casual space to walk along side the Mighty Mississippi, watching barges and huge sh","useful":2,"cool":1},"JXKXcqyiD0PKedDjHGeIig":{"text":"For some reason it's not as much on the radar as some of the biggest city attractions and ","useful":1,"cool":0},"Qw0pc74c3UMENGQG_-954g":{"text":"A picturesque promenade right next to the Mighty Mississippi.  Lots of benches, good peopl","useful":0,"cool":0},"8HkYyeYhY37_XxPqhUU7Hg":{"text":"Woldenberg Park sits in an amazing location it sits along the Mississippi River on one sid","useful":1,"cool":1},"7VH2HukelBikmyF3Goe03A":{"text":"Woldenberg Park is a lovely park which affords a wonderful view of the Riverfront (of the ","useful":1,"cool":2}}