{"_WarvcVxOjdsMCxsRDw-aw":{"text":"Amazing Food - really Fantastic food!!! Great ambiance, great music and drinks.  Hands dow","useful":0,"cool":0},"r5jI9cRCzqQaQAVePaP_yQ":{"text":"Amazing atmosphere! We Had the fried chicken, dirty rice and their veggies, a the house fa","useful":1,"cool":2},"sLihYiShcanQVIu0mGb0AA":{"text":"The raw oysters are good and cheap, at $8 for a half dozen. It tastes best with the horser","useful":0,"cool":0},"1JV2ipYeXNnyTWL6OHcGLQ":{"text":"Loved it, tasted fresh and deliciously seasoned! Great place to east if you're at the conv","useful":0,"cool":0},"A5-icDi5PzXH80G8qx9BKw":{"text":"Great Food! Great Service! Great Cozy Atmosphere that was full and lively but not too loud","useful":0,"cool":0},"1P5SOdZQ7YQkEmbcqwosVA":{"text":"My Friend and I really enjoyed our Meals at Galliano s.She Had the Filet Mignon and I had ","useful":0,"cool":0},"h5G4xjvAtrs6_LQRrXSuUA":{"text":"Great for late night munchies!  Food was really good.  My wife had some fried steak, she l","useful":0,"cool":0},"iFo0046RYLM0hab0cK-5XQ":{"text":"In NOLA for three days and ate here twice because of the amazing food, excellent service a","useful":1,"cool":0},"d-EDtTkDbcv3zwg4hcLnPw":{"text":"Galliano's is outstanding!!!! Thank you for making our anniversary weekend wonderful!  Spe","useful":0,"cool":0},"Yri0DO4dKM2czh3u0x48Lw":{"text":"I stopped in here last Saturday night after a long day of site seeing. I wanted to watch t","useful":0,"cool":0},"uMBuwp-aVJNu0isuQCOUOg":{"text":"Charlie Brown is one of the best bartenders ever! And then there is the food! Shrimp and G","useful":0,"cool":0},"TuPJQ3Fabrp6KitYhXB4Ow":{"text":"I have found my new favorite cajun/creole restaurant here in Nawlins. Where do I even begi","useful":0,"cool":0},"1httf1ae5R6AXR3rovj-Ow":{"text":"In town for a convention and found this place nearby. Corn and she-crab soup was pretty go","useful":0,"cool":0},"mXnSiWfY_7g-Lf3xNAwKkQ":{"text":"What a gem!  This place has just delicious food. Alex took care of us so well that we will","useful":0,"cool":0},"IpJq48EnwPNCdf6Oi3gu-Q":{"text":"Felt like some local authentic appetizers and a drink, so I ordered the fried gator and ch","useful":0,"cool":0},"xluBhBzt7MUwhaQlLN4dNg":{"text":"Awesome restaurant! I hosted a party here for my cousin after reserving a table for 15. By","useful":2,"cool":0},"rPbk31X0RT8cLz7_awvjvg":{"text":"Delicious crawfish pasta with a rich cheesy cream sauce and some nice toasted baguettes.  ","useful":3,"cool":3},"4euKsGUI96QqebI4mypkhg":{"text":"Holy Moley the tournado filet mignon cuts are banging and the okra with bacon was so good!","useful":0,"cool":0},"AJMwmefX31PN0XP67Pw4Jw":{"text":"Great food, great service, great drinks!!!   We made a reservation, and i would highly rec","useful":0,"cool":0},"1s8zBT5n0FnamDKcFQiARA":{"text":"Absolutely incredible food. Everything we ate was delicious. Duck wings! Pork Chop! Oyster","useful":0,"cool":0},"UJYhRpRTqNl8exJtWL-PKA":{"text":"Before flying back home tomorrow, we had to dine at Galliano's again.  This is by far my f","useful":0,"cool":0},"kOr4CzPTSygwBDFGxNn07Q":{"text":"This place was so good I had to try it again 2 days later for lunch this time. First night","useful":1,"cool":0},"7sJyL-OE3LYMlmokC66t5g":{"text":"First time in New Orleans and first time being exposed to the cuisine. Tried the Catfish C","useful":0,"cool":0},"6ytCSKAjzvR3N9-x4f_VOQ":{"text":"Enjoyed the ambiance of the place. Good drinks. Food was definitely good. We started with ","useful":0,"cool":0},"7IwSFXltDyhF8ys4rKaF3w":{"text":"Tried it for the first time tonight. Had the gumbo and the Creole. Wasn't impressed with e","useful":0,"cool":0},"2lHpf1oj5WS6_2oGmPLvSQ":{"text":"We visited tonight right after the place opened. The oysters were delicious raw and charbr","useful":1,"cool":0},"wqxuzgYjjcXdPD4kFMNC_g":{"text":"Best Bloody Mary ever!!!!!!!!    The she-crab chowder is world class too! Lots of southern","useful":0,"cool":0},"CUCEyn6ohnhdoTCl9RcKFg":{"text":"Char-grilled oysters are amazing. We checked out ACME and Drago and these were my favorite","useful":0,"cool":0},"6f2LUuwk2lLzE_1xptvt9Q":{"text":"Absolutely fantastic! Duck wings were tender juicy and full of flavor. Oysters are on par ","useful":0,"cool":0},"iz2pLMXaGft05jx-QNYwSw":{"text":"we are from out of town and although I'm from the east coast and we have amazing seafood, ","useful":0,"cool":0},"f8r10H0KSI_ol72jSk8WeQ":{"text":"Awesome, casual and friendly restaurant. Stopped in because I was starving and the wonderf","useful":0,"cool":0},"aWZIPOKuQDXrMiLNm7vucw":{"text":"Recommended by the hotel concierge for good, local Nawlins cuisine for lunch. He suggested","useful":1,"cool":0},"oCZx1drPZgaX6EvisUD0Dw":{"text":"Even the restaurant is busy .. glad our order came fast...Food is good ..love the gambo ok","useful":0,"cool":0},"HN3-oHb7GmUYDgqZoDKq_Q":{"text":"The food here was some of the best we had during our trip to NOLA, everything we had was d","useful":1,"cool":0},"_WDeSFY6Sjmjq8IkMsTBFQ":{"text":"I wish I could have been helpful in reviewing their oysters because it seems like that's w","useful":0,"cool":0},"5d6AUykGBUdhivwRa0MdGg":{"text":"Blue Crab Gratin is food porn. Putting that Pork Chop in my mouth is the best memory of my","useful":0,"cool":0},"CxV5mBmyxrCuhZSoXeVmQA":{"text":"Fabulous Charbroiled oysters!  The BBQ shrimp po-boy and the fried oyster po-boy was cooke","useful":0,"cool":0},"STeuAFaiiRWx3TnU1SVD0Q":{"text":"Great gumbo, oysters and filet tonight. Staff was wonderful and Elle at the bar is the bes","useful":0,"cool":0},"hzAIkmAYJQGkhZOqvxr8hQ":{"text":"Everything in this place is cooked to perfection! Even the hush puppies that they give as ","useful":0,"cool":0},"KjCyPkguzmr3EM0fIUv61g":{"text":"Had the pleasure of dining here recently and I have to say, it was a rather amazing visit!","useful":0,"cool":0},"WeKjfpo7U09QEB5rhb7Ofg":{"text":"We ate here on a Saturday night during a busy convention week. Service was quite good. Cha","useful":0,"cool":0},"uDPux-GyQCWfmN_7KRH9vA":{"text":"We visited NewOrleans stayed around the corner from this spot! We were wowed!! The food wa","useful":0,"cool":0},"ZtZ4hMKU5sy_P1Olq4q8Qg":{"text":"We stumbled upon this place our first night in NOLA. We had a great experience! The popcor","useful":1,"cool":0},"tZK0mHeZ9LX5pI39rsjHTw":{"text":"Only one star for the treatment we received when we walked in the door and were scolded by","useful":1,"cool":0},"IS0lcqbFOD2ZV2igpd1Rjw":{"text":"This is a great restaurant near the convention center. The food is excellent here. The fri","useful":0,"cool":0},"uckn6wdF0tCwra_B3d7aoA":{"text":"Made my birthday dinner great!! Food was excellent and received a great birthday surprise ","useful":0,"cool":0},"fbXMx3qyqCGFLoojj4YhNw":{"text":"Good food along with Great service equals a perfect ending to an Amazing trip.   If your l","useful":1,"cool":1},"N9q0sZkfKwOE_dhlwN4lCw":{"text":"Fantastic drinks and fried chicken, would drive from L.A (Los Angeles) to get some of thei","useful":0,"cool":0},"DXrseODlS89VPUltDUX_jQ":{"text":"Such an awesome restaurant! We went on a whim and couldn't have been more pleased! We had ","useful":0,"cool":0},"sV_HA0wnH9BS2wTLdcAxlQ":{"text":"Perfect place for us to have an amazing dinner at the bar. We had our 5 and 8 year old wit","useful":0,"cool":0},"I-brZj29isX49cXfJIy7XA":{"text":"This place was amazing. I essentially chose it because it was the only place that I could ","useful":0,"cool":0},"-GkmA6AsCm-36u5ZyqcZwA":{"text":"This is a review from an out-of-towner, so take the appropriate number of grains of salt w","useful":3,"cool":1},"gkptj5fDDU-jqJ4YHWWp2w":{"text":"Why go anywhere else?  EVERY DISH IS DELICIOUS!!!  Friendly, helpful staff.  Craft cocktai","useful":0,"cool":0},"xgzV05hUzk_cYAktCMhjHw":{"text":"I'm not sure why this restaurant gets good reviews. I've been coming to NOLA for years and","useful":0,"cool":0},"_aOLFx3U5sfryK52qNHuhQ":{"text":"We had an amazing lunch here last week. The gator appetizer was one of the highlights but ","useful":0,"cool":0},"nEQfVPqOXHnoRASjUYI4aA":{"text":"My wife and I were on our way to Texas. We decided to stop in New Orleans as neither of us","useful":0,"cool":0},"5bCb0j0Gfy98EJK6nTtexQ":{"text":"This place is exceptional. Not overly fancy, just casual great food and drinks. I always m","useful":0,"cool":0},"x5w8CPBpJC47rN39aX0szA":{"text":"Overall NOT great.  Went for lunch and dessert was the best part.  Good, actually.  Servic","useful":0,"cool":0},"Eav9e7hypojvo128mGTS4w":{"text":"Went here the night our ship came into port. Very convenient 5 minute walk to restaurant. ","useful":1,"cool":0},"CCAVpfj1YmstxdrcdW4JNA":{"text":"A cozy spot...great place for intimate dinner. We got seated by window great for people wa","useful":0,"cool":0},"oMfHTzKz2FSxA68FuqplTw":{"text":"Best charbroiled oysters I have ever eaten. My family, group of 17 went 2 days before Chri","useful":0,"cool":0},"B9hV_yWoGO7ln48XI5kzVg":{"text":"The hush puppies had a different spin on more like creole Cajun taste but they were great ","useful":0,"cool":0},"WWUIlO8H7UiicLUVknui6g":{"text":"Chargrilled oysters were good. Shrimp and grits were good. Grits were cooked well and flav","useful":0,"cool":0},"yxmRNNHckNJDg-9NlMOo4Q":{"text":"Food was amazing!!!  Family had Fried chicken, pot roast, fried catfish and alligator po' ","useful":0,"cool":0},"Fmlrtl8b7L7f_abA5lDcKg":{"text":"This an amazing place! The flavors were magical!  I thought the char-grilled oysters appet","useful":0,"cool":0},"Epi3mfchwIX_3XY6cjlvoA":{"text":"This is the best restaurant in the area. The staff was on point...we were acknowledged qui","useful":0,"cool":0},"rh1nAdBbBLyrSYMNbSDSqw":{"text":"Right across from the convention center. Dropped in for lunch on a break. Interesting flav","useful":1,"cool":1},"j2wsj29BL6Fy38BmRqtWTg":{"text":"This was one of the best meals I had in new orleans (which is a compliment because this ci","useful":2,"cool":1},"PdcCLyuZAxtykH_on9RgAA":{"text":"Delicious food great service!  The raw oysters are good and cheap, at $8 for a half dozen.","useful":1,"cool":0},"X3g_pkfsCQzfd3iVqk7YMg":{"text":"Delicious food!! I had the shrimp creole as an appetizer (we finished it before I could ta","useful":0,"cool":1},"Z0dCw6SAD7xTFrOote_TOA":{"text":"Clearly an overwhelmed staff last night. Salads came out wrong. Two dinners came out cold.","useful":0,"cool":0},"BH_K-b1R2G4BBLFbPVzy-g":{"text":"The Seafood Platter is one of the single best dishes I have EVER had. It was delicious. Th","useful":0,"cool":0},"SxKNhe0tEPZR-0quaoEENA":{"text":"I purchased the Cajun chicken bean & rice dinner.  I really liked the beans and rice but t","useful":0,"cool":0},"RFUhmC3pIY9350sgEBVg9Q":{"text":"Was in New Orleans and the food was so good that I ate there twice.  First time we didn't ","useful":0,"cool":0},"MceetyVQ7CBWLYYm3HB04g":{"text":"The food was wonderful, sat at the bar and the bartenders were great. Talked with the owne","useful":0,"cool":0},"AjN9JbqzcvBssetDw7-85Q":{"text":"So disappointing! I went here based on all the great reviews...maybe the chef was off yest","useful":0,"cool":0},"x0pkQhHLyuhxLxeF-dykkA":{"text":"#BradyEats NOLA! Just some awesome stuff here. While Michelle went with more seafood based","useful":0,"cool":0},"Nhk-jpTq6rw8c5s-YIxVSQ":{"text":"Great food, and amazing atmosphere. The food is well priced and the service was top notch.","useful":0,"cool":0},"tBp0GmZ46IhWonrh5QB7zg":{"text":"I loved the food, service and atmosphere! It was Southern comfort food with a modern twist","useful":0,"cool":0},"9bJeESzIM-2Qpi130D1atw":{"text":"Great food. Fabulous service. I had the crawfish pasta over bread (sounds wired, but it wo","useful":0,"cool":0},"xYycGBfEg6pPhpDCOBT9Tw":{"text":"Good food, great drinks, and awesome service!  I ordered the Old World Tournedos and the f","useful":1,"cool":0},"iQe4meL5gN4Im1bL76Bx9Q":{"text":"Our waiter was excellent!! The drinks are good. The food is excellent and the three of us ","useful":0,"cool":0},"g7hH48UQCheevbt8RHApFg":{"text":"We both had the chicken fried filet mignon.  Very good.  Interesting flavors and combinati","useful":0,"cool":0},"LVW6Uz5ENnbeuXeAiFFxxw":{"text":"The oysters!!!!! So delicious! Great sangria and the crawfish pasta was on POINT! Great fo","useful":1,"cool":0},"YZUGcaY6rH-QcLi_iIeaCw":{"text":"Oysters we're a little different here. Oysters we're burnt ...not a fave.  Waiter was a li","useful":0,"cool":0},"gaHD3rt9-ZDAhiLHFVoUJw":{"text":"Thank you John, Colleen and Jaxson! The food and service were amazing. Good Happy Hour. I ","useful":0,"cool":0},"nYnKvX9ousf0MG75MRKgTA":{"text":"Stopped in for a drink and oysters, what a wonderful find, thanks to bartenders at Marriot","useful":0,"cool":0},"hVD0N5HNb2oMMDqOaYe92w":{"text":"Great place, ended up here by accident. Had the pork chop and it was the best I ever had. ","useful":1,"cool":0},"czvRqEu7rhGNpq0r7iL8fQ":{"text":"So far this was my favorite restaurant in NOLA. Got there after 5pm (group of 4) and were ","useful":0,"cool":0},"srN9zC_9m43joLa4hZf9ng":{"text":"The food is awesome and Bret was extremely friendly . Bret is such a wonderful person as h","useful":2,"cool":0},"KdM_UBYFyWwfwBnwHRNs1g":{"text":"Sat at the bar for dinner and cocktails with friends.  The smoked, brined, andouille stuff","useful":1,"cool":0},"qcATruZDNCWHQWNO-lb22Q":{"text":"Best meals (yes plural) we had during our time in NOLA. Hands down the best gumbo in the c","useful":0,"cool":1},"V4HLKPvNXl7-p_VwIUrnOg":{"text":"Great restaurant! Came here with a group of friends visiting from out of town and we we're","useful":0,"cool":0},"yXYZAiqdUV0mrvesPwi-Jw":{"text":"Full disclosure: I have been visiting NOLA for over 30 years and love to cook and eat grea","useful":0,"cool":0},"7-3SMkeV8tPfyCxVOjolxA":{"text":"Unbelievable food and unbelievable service. Everything we expected from New Orleans and th","useful":0,"cool":0},"GuvXmmH18FDRmDajiBsg1Q":{"text":"Went there today & it was absolutely the worst service & only ok food! The waiter was extr","useful":0,"cool":0},"Pucxk9MB0ukNullijvY8qg":{"text":"Bar service was excellent. Drinks are worth coming in alone for. I ordered the fried oyste","useful":0,"cool":0},"_YUtdvIOVFRP-vV9a7h2Xg":{"text":"Disappointed.  I was so looking forward to our dinner at Galliano.\n\nArrived on time for ou","useful":1,"cool":1},"W-ZGrA9dO7c7-8Eyc0CkHw":{"text":"Excellent food. We got there in time for happy hour- house wine and draft beer were great,","useful":1,"cool":0},"sfU2Jv_iT2OQgjpgTFmoQQ":{"text":"I liked this place. Our waitress was very sweet and made great recommendations. They had $","useful":0,"cool":0},"ujEykVlh0nf_HFc1cayxJg":{"text":"First time in town!! We walked over starving from our hotel and this place was one of the ","useful":0,"cool":0},"HqgPqjXwizRkPJsEFrNqUw":{"text":"Ordered Gator as an appetizer, never had it before and was hesitant but glad I gave it a t","useful":0,"cool":0},"lAzL7ostOvF3Rq9OAmec_g":{"text":"Went for lunch and had a great time. Started with a half dozen oysters and had to order mo","useful":1,"cool":1},"DdcfIbAYwEoRT6vtT_JI4A":{"text":"I don't give out 5 stars freely, but our dinner at Galliano's deserves all 5. Our server A","useful":0,"cool":0},"dEghFj4NQ1Hl5j6sBnhuHA":{"text":"The food was excellent! I got the chargrilled oysters and the spinach salad with grilled s","useful":0,"cool":0},"K2VAKxfywowRcrH1bm33LQ":{"text":"SO. GOOD. I was in New Orleans for a week for work, and this was the best place that we at","useful":0,"cool":0},"-YKUGCPZVv5y6GClH2SvFg":{"text":"This was one of the best restaurants my family and I ate at while in NOLA.  Everything we ","useful":0,"cool":0},"HV_Dns0Wh3d6Nl4qcdErwA":{"text":"So I am a huge Yelper... and I take my reviews very seriously. I came here with my travel ","useful":0,"cool":0},"bi_puNrL6feT4v1BGbQn8w":{"text":"Omg. So good.  The raw oysters were so great we ordered another dozen. Specially drinks fa","useful":0,"cool":0},"qLrlZ0P4nlX8dnMMJhp84g":{"text":"Great place for some authentic, new orleans, cajun fare. I had the smothered chicken which","useful":0,"cool":0},"NXelD1B-E_1U1djnlrPPNA":{"text":"OMG! Sooo good! Got here when it opened at 5:30. The hostess was super nice and engaging. ","useful":1,"cool":2},"tcoLTTpz0eKpzdPpQEoFfw":{"text":"I was disappointed after having high hopes for this place. Our meal was very haphazardly d","useful":0,"cool":0},"K_UUXhw4dvsewiF4SElZXg":{"text":"We had an early dinner here and glad to catch the happy hour. The happy hour drink call Ro","useful":0,"cool":0},"jLUXvAsKi2wNomAgtefFdQ":{"text":"I came here to celebrate my friends birthday.  We shared the bacon wrapped shrimp with gri","useful":1,"cool":0},"Hj3a6DnVXZUVaWUOU6Wngw":{"text":"The food and oysters were great. I would have given 5 stars to this restaurant. \nUnfortuna","useful":5,"cool":0},"dR35rUHfhASOV93up4H_UQ":{"text":"Delicious! Slightly more upscale southern classics. The friend chicken was good but I thin","useful":1,"cool":0},"XkWnr9ArqVshIw_Th9L7CA":{"text":"I was really looking forward to this place based off of the excellent reviews but I was re","useful":0,"cool":0},"y1P6DEwCtf_-dqhB3PTPeA":{"text":"Great service and drinks. Food overall is a 3. The main entrees lacked the hype, but all t","useful":0,"cool":0},"vo1rjyf9PmhTXIk2pnUAsA":{"text":"Seldom do you find a restaurant that is literally just steps away from your hotel. And the","useful":2,"cool":1},"E8_cvCoXWoYnR5jK5zxvwA":{"text":"I dined here while visiting New Orleans for a convention held at the nearby convention cen","useful":1,"cool":0},"AxkwUCBac3jkJmhzX3fl9w":{"text":"My wife, 8 year old son, and I stopped in for dinner last night was Galliano did NOT disap","useful":1,"cool":0},"DC0iImeWWpPfubUnzK7OpA":{"text":"We really enjoyed our meal, and the restaurant.\n\nFirst impression - really nice open dinin","useful":1,"cool":2},"1HHzbp8_GQ9s-0FglxlpyA":{"text":"This is a great restaurant with a warm atmosphere. The staff is attentive and very knowled","useful":0,"cool":0},"mmXo4CeLQGMrFEq4VRT5nw":{"text":"A most hardy thank you to the staff! With my severe Seafood allergy we knew eating out wou","useful":0,"cool":0},"3NnXEMDqWwI34E5-XIwr0Q":{"text":"Great place to eat, smooth setting and awesome customer service. Chicken was fried pretty ","useful":0,"cool":0},"kAv53l8I27C_OlSdcLInXw":{"text":"Prime rib for two was the most enjoyable piece of meat I have ever had !!\nTakes about a ho","useful":3,"cool":0},"MGkJRV_5VYeW43rzK0gACw":{"text":"The service is impeccable and friendly.  It gives you a family  feeling . The food was ver","useful":1,"cool":0},"0Hn3psiiWTDORMi3-o9SHg":{"text":"Was our favorite restaurant during a 4 day vacation to New Orleans. The food was delicious","useful":0,"cool":0},"Q0o84cV06gSphqgZBd59NQ":{"text":"The raw oysters were good, but the rest of the meal was blah. The service was awful and sl","useful":0,"cool":0},"Sktf6XvDRpnMmoJ-cML3cQ":{"text":"This restaurant was located across the street from our hotel and we stumbled upon it witho","useful":1,"cool":0},"yR3bNoXgXeRhiS-YuciVHA":{"text":"This place is phenomenal!! We had a party of 15 that consisted of friends and family. Most","useful":2,"cool":0},"IG7tnsB6LRe6Es3VpunF2Q":{"text":"Wonderful lunch spot. Amazing seafood--charbroiled oysters were fantastic. Catfish was per","useful":0,"cool":0},"cKGuubQPMkR-ZDBzb-9IFg":{"text":"Slow service, OK food, and overpriced.  Place looked great.  The host was very helpful in ","useful":0,"cool":0},"ZAFNtWImPqvKH3v8GoULXQ":{"text":"Service was quick and polite. The food was a different story. The gumbo was so incredibly ","useful":0,"cool":0},"sQOFNwtHgrRjigoJl2PPkg":{"text":"Disappointed. Pork chop was good but the service and seafood platter were a bummer. Our se","useful":0,"cool":0},"aCmQKxCm4scZ_wYIEKMdIw":{"text":"We had a group of 15 and the food and the service was awesome, DOUG was the lead server an","useful":0,"cool":0},"QMg4GxAuItsRxXAwOPE2hQ":{"text":"We were excited about this restaurant but it was disappointing. We came because of the goo","useful":0,"cool":0},"GNqEQSvbGjtJA2HtmAYjdw":{"text":"Amazing food! Fancy New Orleans fare.  It wasn't too far away from the convention center (","useful":0,"cool":0},"Trl-mxVfFPUC3MOvEuTTVw":{"text":"Hands down, one of the best meals we've ever had. We are from Chicago and are spoiled with","useful":0,"cool":0},"LNXrmU3UW77zBBfbcbumRw":{"text":"THIS. PLACE. We found this place on yelp and boy were y'all right?! First, it has a lovely","useful":2,"cool":0},"jJvzTmXX4eydXxM1zW_yzQ":{"text":"This was my first time in New Orleans and my first time eating true creole food and it was","useful":0,"cool":0},"Iw-A15vndiGH43_j2bXPDQ":{"text":"The service here is excellent. Our waitress was quick, efficient and friendly. The oysters","useful":0,"cool":0},"g71AVf9owbFF0RrB71fPqg":{"text":"Extremely friendly owner and staff. They hung out and talked to with us as we ate and they","useful":0,"cool":0},"N3lkx6huv4W-10Vj3550CQ":{"text":"Thank you Yelp for not letting us down! My fiancé and I decided to get out of the chaos of","useful":2,"cool":1},"zZDvAfxHjn6FIHys-ReCSA":{"text":"We were biking around the area and stumbled upon this area. We came a little after noon so","useful":0,"cool":0},"lhxzaJ480B6mS1BCnjMQ7g":{"text":"Great local New Orleans restaurant. We had some awesome charbroiled oysters and hush puppi","useful":1,"cool":0},"MCTgkzbutz3-9IQEM7qqmw":{"text":"My family and I wanted to try Galliano after seeing them featured on the travel channel. I","useful":0,"cool":0},"kc-opENv15E3MnTPYmXoyQ":{"text":"What a fantastic dinner!!!  6 of us went and we all loved our meals (and tried each other'","useful":0,"cool":0},"Ej5Kqipoys8jLqsSheyG0A":{"text":"After our plans for the day got thrown off a bit we checked Yelp for a dinner spot on our ","useful":0,"cool":0},"5R6ZSDKtaPteLyLFMxa41A":{"text":"PORK CHOP! I just need to cut to the chase here. No lofty platitudes about this and that. ","useful":3,"cool":1},"3kjAlAlcfv5MgAQuouBv-w":{"text":"Waited 1 hour and no food , unprofessional,not satisfied!not recommending it.i would put z","useful":0,"cool":0},"jpaUPQW0fUYZ1I9wsyQjeA":{"text":"Came here for lunch and was not disappointed! Oysters, fried chicken, and banana fosters b","useful":0,"cool":0},"ldhXVOT--Vfko5FG08f-Xg":{"text":"Tuesday night was not too busy. Stopped in with a party of three and decided to sit at the","useful":3,"cool":0},"MGGebflSghVL-s1353WB4g":{"text":"Loved this place! The food is excellent everywhere in New Orleans, of course. When we coul","useful":0,"cool":0},"H4xrXqTbx3U4Zzb-m6yGLw":{"text":"There was a black bug in the chips that came with my New Orleans BBQ Shrimp Poboy. I didn'","useful":0,"cool":0},"sD-fMKiSANxHt47h6_iCsg":{"text":"I had the seafood platter the with had the pork chop.  Excellent meal.  Well prepared, wel","useful":0,"cool":0},"k6vAHqYgkpdFCvsD2uK4IQ":{"text":"THE best raw oysters I had throughout the trip in New Orleans, fresh enough but different ","useful":0,"cool":0},"wzS2rby9kJ5KR2VGWJMSXg":{"text":"Just. Wry very good service was good food was out of this world but save room for house ma","useful":0,"cool":0},"dacbWqAXzNuG-FcXsN7LYw":{"text":"I grabbed a quick counter service lunch here and left wanting more. I ordered two dishes t","useful":1,"cool":1},"Z8uFVy3k8XKPD5HrbxqR9w":{"text":"Service was great at the bar. The salads were great but the hush puppies were so so. The b","useful":0,"cool":0},"w_1u9QBRxfWuX9xsWy0hqw":{"text":"GO HERE!!! If you are in New Orleans please take my advice and you will not be disappointe","useful":0,"cool":0},"i4GFp36mCo3fdHVmMeVMEQ":{"text":"Friendly staff, great food and welcoming regulars. Can't say enough for the wonderful dinn","useful":0,"cool":0},"O0uWHFvxG7I5oZInzkOIUw":{"text":"Food was fantastic! Especially oysters and gumbo!\nService was excellent! Ask for Whitney.\n","useful":2,"cool":0},"pVDENFbyjtq6CGk3eUZPOg":{"text":"Read these good reviews and then get to this restaurant... it's excellent! My husband, dau","useful":0,"cool":0},"LkfZYUBz6CgV3iaVdEHumA":{"text":"The staff was so nice.  They gave us wine on our anniversary and were great  with the cust","useful":0,"cool":0},"9kdj-Q6yi0Ze0AiRCjbn4Q":{"text":"This place has really good food, it can get a little pricey but the good thing is Groupon ","useful":2,"cool":0},"Lvdi1iZ64402pUE9eFPxMA":{"text":"Huge letdown for me!  I had the BBQ Shrimp Po Boy based on my bartenders recommendation an","useful":0,"cool":0},"kudyhSfMJkDmwm58uxFb4w":{"text":"Wonderful food and atmosphere.  Highly recommend to people of all ages!  Keep up the great","useful":0,"cool":0},"4Vp-lQGu3OC4IiovZw0KXQ":{"text":"On a girls trip with my babies and this is our first stop of the evening. There wasn't muc","useful":1,"cool":0},"2gSf4GTgqBk9wDnDvbe4Qg":{"text":"I came with a group of 6 for lunch during a break in a conference. We were seated immediat","useful":0,"cool":0},"_p7rYJaARqtDgCrDn0fgpQ":{"text":"Location was very close to our hotel (Embassy Suites) and the yelp reviews weren't bad so ","useful":0,"cool":0},"ULnR5dNsTS6CEm6wigmE-w":{"text":"Wonderful food and wonderful staff! They went above and beyond to help me celebrate my bir","useful":0,"cool":0},"-bRchFzJgqaUKJvnV3hD4w":{"text":"Had the grilled oysters app and fried chicken entree. The grilled oysters were really good","useful":0,"cool":0},"DNHzumCiywGmj-Qz1JuceQ":{"text":"Wonderful food and good service. I went for Tuesday lunch, so it was a bit empty. The food","useful":0,"cool":0},"N6WNITsjb-7FPuArfEeIhw":{"text":"Very convenient to convention center. Went on a Thursday at lunch hour and though the rest","useful":0,"cool":0},"ROV8NSF0bsPI8ZTCf780eQ":{"text":"So let me start off by saying, wanted to try something new and seen great reviews on this ","useful":1,"cool":0},"6AZMFoSEvWx2msC8gN2QFA":{"text":"Walked to this place tonight Sept. 27th 2017 after our tradeshow. Walked in without a rese","useful":0,"cool":0},"pjzF9WPvPO1BOb9PbePx3g":{"text":"In town for work and staying nearby, I wandered in and sat at the end of the bar. I ordere","useful":0,"cool":0},"P0OdBt1itInex7ArLIp3Hw":{"text":"All this girl wanted during her visit to NOLA was some good chicken gumbo. Restaurant afte","useful":2,"cool":0},"e6oANiA4c1aZAKHET32uFg":{"text":"The food and service was very good. Galliano's was a last minute decision that proved to b","useful":0,"cool":0},"I7TUJQgu4NR2ujW2d-07oA":{"text":"Everything I ordered was DELICIOUS. We had the crab dip appetizer and gumbo. Best gumbo I'","useful":1,"cool":0},"FTruZBHiR4hwZVA-_eHqtg":{"text":"What an experience last night at Galliano. We were walking around and trying to find somew","useful":0,"cool":0},"X1wyXAvKHakJjQeg6zibBQ":{"text":"Make sure you come on the weekend only, we came for our second visit on a Monday night - T","useful":0,"cool":0},"96InLccmh-NYm6xVV7N4Aw":{"text":"The chargrilled oysters were absolutely some of the best I've ever eaten and I've eaten th","useful":0,"cool":0},"L-caioBIb-W1MSTiXCMXbg":{"text":"We ordered pork chop (this was a special and recommended by the server) and some other chi","useful":0,"cool":0},"ZYWdqCozgivII5IOKSDwog":{"text":"My wife and I tried this place while visiting New Orleans after reading the rave reviews p","useful":0,"cool":0},"wztVpvgsB1IY1uVtj4dUjA":{"text":"The is the BEST place I have ever been in while being in new Orleans on business. \nFood an","useful":2,"cool":0},"XGmVWCsjhn-lnWVEzC5E1w":{"text":"Really enjoyed our meal there. We had a family of four and for the price compared to the t","useful":1,"cool":0},"k2zOQ91sAzxvNPLoT_o9Rw":{"text":"Absolutely delicious! I have been here a few times, and each experience has been equally d","useful":0,"cool":0},"nllFSFY3jZhIzy7T4uijEw":{"text":"Great food. Pretty large portions. The pork chop stuffed w sausage is phenom. Fried gator ","useful":1,"cool":0},"ljF0k8FjQzk1Hxq1Y7rgdw":{"text":"3.5 stars. The food is comforting and savory. Crab & corn chowder is particularly flavorfu","useful":2,"cool":1},"xilHPyg8L-Z8XjI7qRVYDw":{"text":"Calling all foodies... this place is nothing short of AMAZING!!! From the rustic decor, to","useful":2,"cool":0},"auhsxhGkOsM2HF_40_vNrg":{"text":"I enjoyed my Mother's Day lunch at galliano's! From the moment I walked in the door, I fel","useful":0,"cool":0},"xeRs8rknznnXqvFQ6Vtp8g":{"text":"I may have ruptured my stomach eating the pork chop la place, and it was totally worth it.","useful":0,"cool":0},"EAGBkfKxLW1zyOpPwOO7yA":{"text":"Sadly not my favorite place in NOLA. Fried chicken was over-fried. Bread pudding was too t","useful":0,"cool":0},"gNoRw4_TMsGDzvfmu4Ypog":{"text":"Amazing food and amazing service. Our server, Fernando was super helpful and friendly. We ","useful":0,"cool":0},"UCA6SJAad3p5XO9SssblUQ":{"text":"Our waiter was fast and friendly.   He highly recommended the fried chicken and it was the","useful":0,"cool":0},"Ap5Hh5bZG7ekPR-O5HVoAg":{"text":"I had the seafood gumbo and the seafood platter. My compadre had the gator and the catfish","useful":0,"cool":0},"-K4-sT1Gbg9Y7DBidRtMrQ":{"text":"Fast service at the bar, but the blackened fish was tasteless and overpriced for the small","useful":0,"cool":0},"YsPRkTbsXdbBwYY__cJXgg":{"text":"Wow! I'm not sure how we got so lucky finding a restaurant with a knowledgeable and loyal ","useful":0,"cool":0},"2Sef_li00hD9u-walO4SDQ":{"text":"I would give it more stars if I could! The staff is so amazing!!! The food is so good!!! T","useful":0,"cool":0},"uGp57Khaj41yRKpNGL6J3g":{"text":"This restaurant was excellent. I would give it 10 stars if I could. Our hotel gave us this","useful":1,"cool":1},"AgOUofr7gpd0bJ2S69urdA":{"text":"I would come back to New Orleans just to eat here. Wings and pork chop are out of this wor","useful":0,"cool":0},"3vOlpWizam5rsW23YvMizw":{"text":"Great service! I ordered the Crawfish Pasta and it was amazing. We also ordered a bottle o","useful":0,"cool":0},"P86bDUeBBZiyQ_e4C7Gzqw":{"text":"We started the evening with beverages.  They were really good and pretty stiff: The Rougar","useful":0,"cool":0},"ng1_qJJzKpbyQt1-Wlnz0g":{"text":"Large portions and tasty food. We were a  group of 4 New Orleanians and we enjoyed the foo","useful":0,"cool":0},"4xpYH5KatxDI6Rng4MCbPQ":{"text":"I'm a hotel manager in the CBD & I wonder how I've never seen this place. It is amazing wi","useful":0,"cool":0},"ifm_3Gof0Hw9fJZayAy6dg":{"text":"Everything was delicious!!! We ordered the beef roast, filet mignon country fried steak an","useful":0,"cool":0},"uS11kTZf86Yv7w-HnrrhIQ":{"text":"Stopped in because I yelped it and it was close to our hotel and we were so glad we did! T","useful":1,"cool":0},"g9ys2faESTl9hZfPt374LA":{"text":"Super friendly staff with a great menu! We had the oysters and caviar ,hush puppies and Co","useful":1,"cool":0},"NRlf8PnlOJ5D_2aPi0rY9A":{"text":"Wonderful service. Owner was great. Food was wonderful. Oysters were plump. Shrimp dishes ","useful":0,"cool":0},"D_9oxMUoNDPtgMMYyNoYIQ":{"text":"Went for lunch on a Sunday, no wait plenty of tables. Got a great Bloody Mary and a too sw","useful":0,"cool":0},"gKCOey9e71QXezYM6S4mGw":{"text":"Highly recommend this restaurant. Great food and atmosphere. Party of 4 adults and 5 kids ","useful":0,"cool":0},"uD6viec_VNccx_uheWyjyA":{"text":"Amazing!  The best restaurant I ate at in New Orleans. The food is perfectly seasoned! The","useful":0,"cool":0},"7iBFWIHcLZuJ3tCO0epv3A":{"text":"We were visiting New Orleans and wanted to eat, and when our party of 8 walked up, the hos","useful":0,"cool":0},"78p5-R78Ru4Itc8HMjfUjQ":{"text":"Came here on our last night of vacation. The menu is impressive and the food even more so.","useful":0,"cool":0},"tcEw_Z6W4YVTTkSu_Nbygw":{"text":"Two words.....hated it! Ordered the seafood platter which was awful and very salty.  The g","useful":0,"cool":0},"Xt92nkx5zFdM4sBdiFGr6Q":{"text":"Service is excellent.  Best alligator po boy sandwich I ever had.  Gumbo was little salty ","useful":0,"cool":0},"AW5mhRpA3_IrCIZoaF-H3A":{"text":"Everything we had was delicious and hope this restaurant is here for a long time. Service ","useful":0,"cool":0},"lNYWskIpLbthVrTHYrkjMw":{"text":"Found this little gem before heading to the airport....food was great, service was even be","useful":0,"cool":0},"eMCzml8clIgknvtHR-2bxw":{"text":"Chargrilled oysters were Devine! Blackened Prime Rib was awesome!!! The best we've ever ha","useful":0,"cool":0},"okDLhFa-lSQhQURw8UV_GA":{"text":"The pictures on Yelp don't lie! The food was just as good as the pics! I had the big a** p","useful":1,"cool":0},"oJJBoOt3Dz9mN-1q6LqfuQ":{"text":"Nice little place.\n\nWent on a Sunday night around 8. Place was pretty busy. Had 1 spot at ","useful":0,"cool":0},"if4pyMmR7vkpcGNymAvAfw":{"text":"Stopped in to try some apps and cocktails, very pleased with everything! Can wait to come ","useful":0,"cool":0},"46peC3oE_MvirbPY5bAQ0g":{"text":"Ordered catfish oreole. Small portion. Fish was good. Not so delicious as the 4.5 stars su","useful":0,"cool":0},"DX_FnMHBXiOCMCTcGSFk-Q":{"text":"The food here is exquisite and the service down to earth! This is definitely a must eat! I","useful":1,"cool":0},"AlHJ_xijmRLMlRu37DPg1A":{"text":"Double bone in pork chop.....don't mess around..... it has a andouille sausage link inside","useful":3,"cool":1},"EhbbX0AJ9VXtqJ8JX3SBaA":{"text":"Chargrilled Oysters the best! Fresh daily. I also recommend the Seasonal Salad topped with","useful":1,"cool":0},"NTU9Odt8KBJSdjVVkdhdPQ":{"text":"Alec L.  We stopped by on a Thursday night at 7:30 without reservations and the manager ga","useful":0,"cool":0},"kY01_eZ6VC0e4N8C_ysVbQ":{"text":"This place is amazing! Gritty with a down home feeling, I presume a lot of locals come her","useful":0,"cool":0},"nAxDlNi-Z9c39FePV6ZlJg":{"text":"I don't know what happened. The vast majority of reviews for this place are good to great ","useful":0,"cool":0},"-woO9AQTv58a9kydScP5Zw":{"text":"Restaurant Rebirth has a talented sister named Galliano; serving up BIG flavors of comfort","useful":0,"cool":0},"UUpJvWFXX3STSQ4DDIvFSw":{"text":"Casual atmosphere. Friendly and attentive staff. All the food was made in house and was de","useful":0,"cool":0},"hKJypn5fTyA-sMIFgeh1gQ":{"text":"In town celebrating the birthdays of my Amarillo friends. Had dinner here after the Keene ","useful":0,"cool":0},"GsgEU2XoQjFoQPajkdWaOA":{"text":"Fried oysters were amazing!!! Come for happy hour they are on the list... fried chicken ha","useful":0,"cool":0},"DUY8jHNZG29CD0LJOGw6pA":{"text":"We ate here while we were in New Orleans attending a conference. It was excellent! My husb","useful":0,"cool":0},"vRq006F0aJLrOCDr47WagQ":{"text":"My husband and I ordered the duck wings, corn and crab soup, and the Louisiana shrimp. Eve","useful":0,"cool":0},"q-0O6VWKC78dW08rj7z4gw":{"text":"Felt at home as soon as we walked in.  Our waiter Dante and the other service staff was am","useful":0,"cool":0},"Zh_YYW2e8ECH8sPv145gOg":{"text":"A great new favorite place to eat and enjoy authentic Cajun cuisine with flair.  Each dish","useful":0,"cool":0},"FaQf0UzN5TrjzbquDfk0KQ":{"text":"I can't say enough good things about this place. From the hush puppies ahead of our food, ","useful":2,"cool":0},"JwhXOuF0a0si5GH97rOnDQ":{"text":"Torn on leaving 2 or 3 stars. One-two stars for the service, ridiculous upsell on wine, an","useful":0,"cool":0},"fG5-nlrLHm55PSGdHpxBgQ":{"text":"In my top 3 of New Orleans. Such a good menu and bar too. Traditional New Orleans cuisine ","useful":1,"cool":0},"-PZXx5I11g_6wdeuEVz_WA":{"text":"Disappointed.  Simple and sad, but true.  When it comes to my genuine feelings and expecta","useful":0,"cool":0},"fVu7R1oE6u3-prwQJhPOoQ":{"text":"Was deciding between this place and Mulate's for lunch and boy and I happy about the choic","useful":1,"cool":0},"R2-nNDRhoztCVftm_Oie8Q":{"text":"Came here on a whim for lunch. Could not have picked a better spot! The food was delicious","useful":0,"cool":0},"8cOBTPUBeZiyrvVgi4jDlg":{"text":"Food was great, ambiance was great. Server was okay - she didn't seem like she wanted to a","useful":0,"cool":0},"9fkd1jlMlWmZlmNgV54C4A":{"text":"Ridiculously good fried chicken. The beans/rice side it comes with is also crazy good. Onl","useful":0,"cool":0},"NimfiB90f98_wlKyziIY7g":{"text":"Their sister Restaurant told us they have vegetarian options. THEY DO NOT.  And this happe","useful":1,"cool":0},"p5GXYveRznxePLH8wJkUHw":{"text":"Stopped in here for an early dinner, it was about 1830 on a Sunday.  The ambiance was grea","useful":0,"cool":0},"BAYvFeCp9M_PKpNFbMvC2Q":{"text":"Wandered in here cuz the parade was blocking traffic. This is a gem. Had the chargrilled o","useful":1,"cool":1},"jbgPlUfNfEVAT7sB3WuVwg":{"text":"So good!  The char-grilled oysters, seasonal garden salad were great!  Service is great.  ","useful":0,"cool":0},"ZvZA6QGvJa1x8SUPYwBoSA":{"text":"This was my favorite dinning experience in New Orleans!  I have one word for you who are i","useful":0,"cool":1},"Xny8mmRDH8NIbNiB5cJntg":{"text":"In a city with so many amazing restaurants, Galliano just isn't one I will need to return ","useful":0,"cool":0},"GQf6u1xZGUKFIuzQ9c7gsQ":{"text":"Overall was very good. The food is excellent. For the price, I expected a little more. No ","useful":0,"cool":0},"UUZvJcLyug-kPwq1VGI81w":{"text":"Bourbon Street and the Bayou with a Brooklyn sensibility\n\nIf this place isn't a local land","useful":1,"cool":0},"20GgVpl0qs5ziu6typb8WQ":{"text":"Awesome food! Best catfish I have ever eaten and everything else was delicious. The crawfi","useful":0,"cool":0},"8k1iEnQhZ_hwgQrfM_8bgw":{"text":"Went here last Friday with a party of six. I am not a fan of the usual CBD, WHAREHOUSE DIS","useful":0,"cool":0},"aZzliC1iNtNIwpQQSD0hFA":{"text":"Outstanding!\n\nOysters were huge and tasty.\n\nFried chicken was super tender.\n\nCorn and crab","useful":0,"cool":0},"8R4pfF9I7SgjlrWnZbpsug":{"text":"Stumbled on this place in uptown New Orleans. We ended up having to make reservations for ","useful":0,"cool":0},"1ZwsWgWIMaLoVPW5_hFyyw":{"text":"The hush puppies were good, the service was good, the food was good. I would not necessari","useful":0,"cool":0},"M0C-iR2rMeL38DDmGKQZ_w":{"text":"Came in craving some oysters. Was not disappointed love how they support the local breweri","useful":0,"cool":0},"4CPk9QYtZnvKUSJq8j04fw":{"text":"Just walked in and sat at the bar. Elle was behind the counter and was terrific!  She poin","useful":0,"cool":0},"W-v4-y3a1kurDKUG8PeJSw":{"text":"Had the swordfish over Cajun slaw and it was amazing!  Not thrilled with the hush puppies ","useful":0,"cool":0},"954PF0V-Tezmkvn5TS8Mgw":{"text":"The food here is outrageous.  Starting with the apps- beautiful huge tender oysters and mo","useful":0,"cool":0},"FrWoFEYbdbuTM_R9m0Qb8Q":{"text":"F'KN WOWOWOWOW. Oysters were amazing, catfish poboy is huge and was so yum, crispy yet sem","useful":0,"cool":0},"O-PrAhi4iW_D3F80fngInQ":{"text":"I love everything about this restaurant! \nLet's see- for appetizers, we had 1/2 raw oyster","useful":3,"cool":0},"0W5W57cvVc4F4PtTw3-TiA":{"text":"This place is phenomenal! Just steps away from the Convention Center.  The service is impe","useful":1,"cool":0},"63r15ymiFRavDoLOh1ssxA":{"text":"I had such high hopes.  I read the good reviews and when I went the staff was nice.  The p","useful":0,"cool":0},"nM7jacNoqAybmYCWboUo9Q":{"text":"I had dinner with my family here. Amy was our server and she was delightful. The menu had ","useful":0,"cool":0},"WNzF6kU4RQHsoyuUy7RboQ":{"text":"Great food, great service and very accommodating as we came in with an infant. Waiter - I ","useful":0,"cool":0},"MNj1KDutQuUdFqHyv_dS4w":{"text":"My favorite dinner in New Orleans. Had grilled oysters, fried shrimp catfish and cobbler a","useful":2,"cool":1},"vOh9hjKuizNx5Qz1Cz61Kw":{"text":"Not impressed. Service was very friendly but the food was way too salty or sugary. I would","useful":0,"cool":0},"FTZ_tGJwdgtmjBeS7p3l5g":{"text":"Great ambiance and great food! My husband had the gumbo which was just amazing, we had the","useful":0,"cool":0},"iuJOTsdTnyccrwNINJ-vqg":{"text":"Great food and service. My husband and I were in town just for a day, found this place on ","useful":0,"cool":0},"YEzImHyNA9MmFrlodgiy0A":{"text":"Blown away! Went here based on Yelp, couldn't be happier. Had my heart set on that massive","useful":1,"cool":0},"GIOaNuj7sFcN50y_tVb_MQ":{"text":"This place is one of the best restaurants I've been to in New Orleans. Their Oysters, Prim","useful":0,"cool":0},"yzkMmhTrKCPCog--kd8B0Q":{"text":"Great food, drinks and service. A little expensive, because but a great option if you're s","useful":0,"cool":0},"xX6MYXEhATyUXobN9Ldn-A":{"text":"Great causal dining place. We were finished shopping at the Outlet close by and just wante","useful":0,"cool":0},"di2__2T6BlQDE6gCzw2Vlw":{"text":"Our waiter was outstanding. He knew about everything there was on the menu and even about ","useful":0,"cool":0},"28hBOngnnq0QkJwhLFC8BQ":{"text":"I had the country fried filet mignon, it was amazing!! One of the best chicken fried steak","useful":0,"cool":0},"-mHeGEM4GQRF5Mw3uWw9Kg":{"text":"I was going to go to a restaurant just a few doors down from this restaurant but that one ","useful":1,"cool":0},"RD_QlXzuWmFyYaEstuo_Ng":{"text":"This is probably my current favorite restaurant in the city at the moment. The atmosphere ","useful":0,"cool":0},"2IFmfd8bwjE1QePkjbJk9g":{"text":"Out on a business trip for one day and Found this place via yelp, and walked right in and ","useful":2,"cool":2},"iJucwuQk-O5390jxBkrqGw":{"text":"Food was delicious. I tried the fried shrimp and crawfish pasta and really enjoyed the fla","useful":0,"cool":0},"wWf7ecHKbJSTyjuNaGqroQ":{"text":"Another amazing spot in New Orleans that I am glad I got to try. The food was amazing and ","useful":4,"cool":2},"VTLUOBDa_EYrO7Oi6nBTuw":{"text":"Understated elegant dining at great price. Best gumbo ever! Cat fish delicate n lightly fr","useful":0,"cool":0},"fFToTlnN25kLmqVxm681OQ":{"text":"Stopped in on a whim after hopping off the Hop-on Hop-off bus.  We were greeted by the mos","useful":1,"cool":0},"jEvD_BIEWsfJMTLKtsWuEA":{"text":"Great dinner! Small quaint restaurant with some excellent options! The tournedos were awes","useful":0,"cool":0},"HNXEPzSUxRlb5hPCTs2j8g":{"text":"My taste buds are in heaven.  Had the fire grilled oysters and chicken fried filet.  Also ","useful":0,"cool":0},"9jSX57MJCAH6sQfMUNxawA":{"text":"Went here on Saturday night, cute atmosphere and overall a nice place to eat. The service ","useful":0,"cool":0},"ldWhaNfu00eew2s8j5xuxw":{"text":"The short rib pot roast was over the top good! Perfect late night bite with a great Second","useful":0,"cool":0},"sxfV1u2cU0foYSIvILWGjQ":{"text":"Absolutely fantastic experience! The bartender, the staff incredibly friendly and knowledg","useful":0,"cool":0},"STkVLo4x10D00c8Qn2hBlQ":{"text":"The wait staff was spectacular (Katrina).  But that was only a small part...  The Pork Cho","useful":0,"cool":0},"DiyS0qCNHMgBIEmkBUkyjA":{"text":"After looking at the ratings we decided to go here. We went on a Thursday evening and did ","useful":0,"cool":0},"pUvaUPHt2ppb9e2V2KoXNw":{"text":"This restaurant has the BEST BERRY COBBLER I have ever tried!!! Please order this if you p","useful":0,"cool":0},"734kqulRtZo2EX6esAx7RQ":{"text":"No frills restaurant with good food, great staff\n\nI dined here with two friends and we had","useful":0,"cool":0},"cgd1UYzIB8Kjs5XMpjDjhQ":{"text":"Totally delicious food and cocktails. I ordered the shrimp po boy and it was awesome.","useful":0,"cool":0},"-dcXX4yDn_o5XGS39UQ71Q":{"text":"Absolutely amazing!! Actually still in the restaurant writing this review!  Ray was amazin","useful":0,"cool":1},"52exg_ifA9ZRqUkTGf40dA":{"text":"First Jeff our waiter is amazing.  I have been here for four days and this is the best loc","useful":0,"cool":0},"BI3YMspvokWDKV3USZ31jg":{"text":"Had the crawfish Monica pasta and it was great BUT what to order is the Bloody Mary. It's ","useful":0,"cool":0},"y0pCET3Ycqdo1nsYCUovAg":{"text":"Loved everything we tried - both the Pork Chop and the Country Fried Steak were amazing!  ","useful":0,"cool":0},"a_GV-NcKKrPsqPA3IwHERg":{"text":"The food was awesome!!  The corn she crab chowder is a must have. The catfish poboy was a ","useful":0,"cool":0},"ztUrusRl1__W9HHjpDWpyg":{"text":"Nice happy hour specials, great oysters, pork chop was good but too big and nothing specia","useful":0,"cool":0},"Yip1eQHIJV0awKx4AVCMHw":{"text":"Fantastic service! The bartenders were so attentive! By far the best prime rib I've ever h","useful":0,"cool":0},"9cwKZQcULeo4KBd-YxncTw":{"text":"This restaurant is a charm. It's down south of Harrahs Casino, away from the tourist attra","useful":4,"cool":3},"TyxkA7WxsVO6TF8WAy-ORA":{"text":"Of the thousands of meals eaten in hundreds of New Orleans restaurants, this was simply on","useful":0,"cool":0},"Yhx7JJu18EYUHjfIHkzoKg":{"text":"Service was ok and place wasn't crowded - went on Monday night.  Ordered the short ribs/po","useful":0,"cool":0},"6LrEE0jCmYpW2Bc1OvSPWQ":{"text":"My husband and I had lunch there today and it was so delicious. We ordered the Boudin for ","useful":0,"cool":0},"gUVKUWCc-x5x4gU0ys-V1g":{"text":"Was our last night in NOLA and we definitely saved the best for last. The food was life ch","useful":0,"cool":0},"nBP_mNZ7Vu4br2kz9N0MYw":{"text":"This was the best meal ever ever. I had the country fried filet mignon and it was so tende","useful":3,"cool":0},"-y6Ttt9IVT1r8RO8HnJsVA":{"text":"My wife and I were down for the weekend.  The surface was great and the pork chop was the ","useful":0,"cool":0},"bPtnkPEqBd0Roe5Fm_oh8w":{"text":"Horrible! \nService was terrible and food was ok at best. \nNo slaw for the poboy\nWe didn't ","useful":0,"cool":0},"9sOCyusU5NCb6E10hJWk9A":{"text":"Duuuuude.... \nThis restaurant has employees that are either the most incompetent dumb or 2","useful":0,"cool":0},"x_-U-QssU2SZkr0SIqiiuw":{"text":"The only reason I am giving two stars is because they had COKE zither than that this place","useful":0,"cool":0},"wGwhqwaEAFI3H1ft4gt7MA":{"text":"Wonderful food and service! We had a little scheduling snafu last night and wound up missi","useful":0,"cool":0},"fDPNGXV5bBHVc8lpss49nQ":{"text":"Great food and great service. Went by myself when I was in town for a conference. Charlie ","useful":0,"cool":0},"ThHMiJGGtdLlJPZrkdpV5w":{"text":"Wow!! just waked upon this gem while visiting dowtown New Orleans. Unfortunately we didnt ","useful":1,"cool":0},"hWYyQLBs38GFmic4LkPIzg":{"text":"We had another amazing dinner at Galliano last night. The food is always consistent and de","useful":0,"cool":0},"78chQIoLLHMq2tLOBD6NMg":{"text":"Sooo good me and my hubby were in town and stumbled on this hidden restaurant as we were w","useful":0,"cool":0},"hZ-CyedVFLYvVgvvpbdCfA":{"text":"The shrimp and grits were probably the best I've ever had. Everyone In our group of eight ","useful":1,"cool":0},"-90WH0g_W7BJNC7oj80Urg":{"text":"The food was good. The classic fried shrimp Po Boy was probably the best thing we had here","useful":0,"cool":0},"erkpy49uX4NBKYKK461pgg":{"text":"Great place! Casual dining with very good food, and terrific service. They made our family","useful":0,"cool":0},"nZ3g6M3JLeu8YsL-ptuzmQ":{"text":"We came for lunch & the service was pretty darn great. Our gator bite app was tasty with j","useful":1,"cool":1},"Skxp7DC3RYsvEDOzc5z99g":{"text":"Awesome place!  Nice and clean with friendly service.  Our waiter was very friendly and do","useful":0,"cool":0},"a_62WMHVidIERFBcXovxPA":{"text":"The food was incredible and the service fantastic. All done at a very nice price point. I ","useful":0,"cool":0},"xp5etBT_rLqwhjjrXkV-Gw":{"text":"So good and fun.  The atmosphere is lively and casual.  The food is comfort southern food.","useful":0,"cool":0},"zTl2g9fJio8Dp0LPTgbvcw":{"text":"The food and drinks were good however the service was subpar. I went with a large group of","useful":2,"cool":1},"tSLUaFLyTJhU1pLNXzWA6A":{"text":"I got a crab and cheese soup that they had instead of chowder this evening. \nO..m...g... t","useful":0,"cool":0},"AfA8EJRhG3JO1J_dkZWN1g":{"text":"WOW the food here is amazing and the service is amazing as well.  The manager and owner ar","useful":1,"cool":0},"g0qiQFDwXjfMI4-5-m5JBw":{"text":"I love chargrilled oysters.  Not sure if they were the best I've ever had, but I can't rem","useful":0,"cool":0},"Ot-p2lJOPx71I6aBL5Uw6g":{"text":"Atmosphere, service, food, cocktails...all top tier. Quality front to back and will defina","useful":1,"cool":0},"ExakPMS8rd4rP_HbItU9bQ":{"text":"Stumbled on Galliano while attending a conference in the area and what a great find! I ord","useful":0,"cool":1},"GJ8onfx8qOOsAnAqKDcxzA":{"text":"Had the shrimp and grits, also the duck wings. Simply awesome. Food was flavorful and well","useful":0,"cool":0},"x9vCVgfMIDJ8fDdCunPgow":{"text":"This place is not that great. We ordered a fish that had no flavor and cold (very rare for","useful":0,"cool":0},"bdZdyZtogcjOMQATVDo0iQ":{"text":"Our family had a wonderful dining experience at Galliano's. Delicious food, pleasant atmos","useful":0,"cool":0},"ihOKB0MH-Zsb7fEvYeYYxg":{"text":"Went today and were the first ones there picked our table . Ordered She-crab Corn Soup - O","useful":0,"cool":0},"aOS7eJyZOUKsTNvAXfe65Q":{"text":"My fiancé and I went here after the Saints game and it was busy! I suggest making a reserv","useful":1,"cool":1},"zzIjrJMrkcX-HZcStG5M7A":{"text":"Finally a place in town made me \"wow\"! We've learned our lesson that the dish portion here","useful":2,"cool":0},"qZEws4GRy60ufFgj9d82dg":{"text":"Tasty healthy food is served here. From farm to table. It was within an easy walk from my ","useful":0,"cool":0},"2MLDVwVFML1KitIK16PmrA":{"text":"Great friendly service!  Awesome local cuisine menu. Definitely try their house special co","useful":1,"cool":0},"BbAWaHGd6YgXrUNYrqvXMA":{"text":"I'm visiting from Atlanta and came here twice for lunch. \nHad raw oysters and had grilled ","useful":1,"cool":1},"ELTA-w5x-ZAUnWUHmpnw1A":{"text":"Great food. Good service. Fun atmosphere. Owner is really cool. Must eat at this place. Be","useful":0,"cool":0},"_jynxCLM4isUql61jpn3Lg":{"text":"Our dinner was delicious and the dessert bread podding... fabulous! The best I have ever e","useful":0,"cool":0},"KSCUQIy-EXZEYNoBABd27g":{"text":"Delicious Pork Chop!!! A must in New Orleans ;)\nService was good , even though they were v","useful":1,"cool":0},"FXqOaf4Y5oBFV_Cb2Tmagg":{"text":"The mirliton crab and brie appetizer was lackluster. The description sounded delicious but","useful":0,"cool":0},"XkYy9nL5pFhMchdjq1A0mQ":{"text":"Absolutely the BEST onion rings I have ever had!! Also highly recommend the corn chowder. ","useful":0,"cool":0},"wsw3ZnhL3pGiBRSp6rBlLg":{"text":"This is by far my favorite place in New Orleans. Food is 5 star. Service is amazing. Super","useful":0,"cool":0},"qdNLy3Wi5O6xbbITodS5xw":{"text":"Service was superb! Everyone (i.e. host and waiter) had excellent customer service skills.","useful":2,"cool":0},"GmfbPC34zAFDR0yimw0dqg":{"text":"We were driving home and decided to stop for dinner. We had our 5 month old with us and th","useful":1,"cool":0},"zCVs2-cVIMbFHAsUuv2Otg":{"text":"Bad experience!!. We made a dinner reservation and when we showed up they told us it was g","useful":0,"cool":0},"oZIczjeAgcWvAsYKUhsbvQ":{"text":"We wandered in yesterday afternoon for a late lunch, no reservations, and received a wonde","useful":1,"cool":0},"FNnjBfy97WdfdfZh3Bg1IQ":{"text":"I think I died and went to heaven! This place exceeded our expectations for taste and serv","useful":0,"cool":0},"6R9Uevif589JtXs-uoT7Hg":{"text":"Cute lunch spot by the convention center. Excellent food and it's nice to be able to eat h","useful":0,"cool":0},"pkzPhFp3Mlrwg8066un4iQ":{"text":"Excellent food with professional and friendly staff.  We didn't have reservations and sat ","useful":0,"cool":0},"Bvb-sCjxF_1WT722bglgCA":{"text":"In a word - YUM! Shrimp and grits were amazing!! Staff were friendly, service was prompt a","useful":0,"cool":0},"ADPruND7_5wMp6DijMc1rQ":{"text":"The staff are overworked and can not get orders out in a timely manner. Do not go here if ","useful":0,"cool":0},"VYche3pLv0B2g1rsyT19dw":{"text":"Was in New Orleans for a trade show at the Convention Center and was in charge of all the ","useful":1,"cool":1},"YMAapnMC0V2zKdkDMNFOCw":{"text":"This was one of the best meals we had in NOLA! Great host! Great food! Great drinks! Make ","useful":0,"cool":0},"1XZeYQ5LEoZe6DQpzSxHrg":{"text":"Excellent chicken, shrimp and catfish.  The red beans and rice should have been a throw aw","useful":0,"cool":0},"eeJIjvTR2dxKRVedO_4GOA":{"text":"Awesome staff. I got the seafood platter... wonderful blend of flavors. Not your Grandma's","useful":0,"cool":0},"48ugYypDG9mK_drGncxrag":{"text":"We were in town for a conference and decided to go here during lunch. Walking distance fro","useful":0,"cool":0},"oG_9bfJep7_Atvhu0TjT7g":{"text":"Not that much for vegetarians but the blackened catch of the day served over roasted veggi","useful":0,"cool":0},"_vgT0_BhH1nixHFquc0NHA":{"text":"Best pork chop I have ever eaten.  Don't usually like beans.   The brown beans were fantas","useful":1,"cool":0},"etvTvPeRaKggRs9oqJ7sQw":{"text":"Had one of the best meals since we've been in New Orleans.  The grilled oysters were exqui","useful":0,"cool":0},"NN5QZYOYLZjRCeAnHVEntQ":{"text":"Thoroughly enjoyed this spot for a dinner with friends. Great food and a really good local","useful":0,"cool":0},"jERep4S_t4RZVR0lHnEzqg":{"text":"Stopped in for lunch & was pleasantly surprised. Had a bbq shrimp po boy. The bread was pr","useful":0,"cool":0},"IhH8fzXL3icqvxCnHViGnw":{"text":"Not only is the food fantastic here but the service is great as well! I had fried chicken ","useful":0,"cool":0},"vOItBrB90VwS7mTWVQIdtQ":{"text":"We ate here right before close tonight because the kids were hungry after cheer competitio","useful":0,"cool":0},"7XPjVNqAn-b8Mc8wk_uknA":{"text":"Our first time in NOLA, we stayed down the block this place was great!! I ordered the craw","useful":1,"cool":0},"AmYhlO9w4AI0xNGX0qmlQQ":{"text":"The owner and the server Rory were incredible!!! The owner took care of us as soon as we s","useful":0,"cool":0},"8SPlRvylUtjMcvQQ5Oeikw":{"text":"Low key, yet incredible staff.  Had a problem with a steak not being correct temperature. ","useful":0,"cool":0},"ZPNg-zU6Uon5X66Xun1_YQ":{"text":"Terrible. Terrible. Bar staff lacking customer service but I guess they hate dealing with ","useful":0,"cool":0},"K_up2Necf_BEHt7O0_wQEQ":{"text":"The food was good, but the personnel creates very unpleasant and \"pushy\" environment. Anyt","useful":0,"cool":0},"kdPG4Yl77nq2qevgBOp3lw":{"text":"Two words: go here!!!! Awesome awesome food. Our concierge told us they had the best gumbo","useful":0,"cool":0},"5tcO1syNaSkQIFKh1c5Jlg":{"text":"Food was great!  We asked our server, Larry to recommend his favorites. Couldn't have aske","useful":0,"cool":0},"0BXHB139Vq6_2I19CF1Z5A":{"text":"Had an excellent dinner here on Friday night before our cruise. It is located in the heart","useful":0,"cool":0},"tFwD-21FqyKtMCinc9yK8Q":{"text":"Great food and service. Good selection of beverages. Glad I stopped in for the catfish.","useful":0,"cool":0},"51I4E7TOR5ms9kNfyuIUrg":{"text":"An easy walk from the convention center and downtown hotels, this neighborhood restaurant ","useful":2,"cool":2},"AebPsS7ZS_NwTIuSJENCeA":{"text":"I was served cold blacken fish, and when I asked to heat up, the fish is overcooked. They ","useful":0,"cool":0},"K90C7CRsoil-Pe3Fdp9-VQ":{"text":"This is the first restaurant I tried while visiting New Orleans and I am so glad I did! It","useful":0,"cool":0},"S7YRmJFsRYA1V4nbakbBdA":{"text":"Galliano is simply amazing. I'm sure all of their menu items are good; but too night's in ","useful":0,"cool":0},"Jk27qqqmC5jCPhW0vpr7BA":{"text":"A true find by the convention center and away from the grossness of bourbon street. Don't ","useful":0,"cool":0},"7OorzlFd_DvlDozXamTVzA":{"text":"Very good food here. A bit pricey but it's a touristy area near convention center. Decor w","useful":2,"cool":0},"PGLMQaPmsQi9uRdzlmTNsg":{"text":"This place was very good. I went here after Emeril's new orleans refused to seat us for wh","useful":0,"cool":0},"r_5jY-wyyyrx0QjWktujPQ":{"text":"Good service and pretty dang good tasty food. Some folks in our party did not care for the","useful":0,"cool":0},"9qe9dPiNfVQhw6KdJHDN2g":{"text":"Food and service was great. Charbroiled oysters, country fried steak, and fried duck wings","useful":0,"cool":0},"I9dubC1XTHws4-3Jq3b7SQ":{"text":"After an 8-day trip to New Orleans, Mardi Gras 2019, I ate around 15 different meals.  Onl","useful":0,"cool":0},"99g3viLOj9ngPkuFjF2HXA":{"text":"Amazing food. Great portions and the seafood pasta was to die for. My wife loved the clams","useful":0,"cool":0},"hJiBSGcN8aJ3UREI9EtByQ":{"text":"The shrimp salad wasn't very good. Everything else looked very good though!! I think I jus","useful":0,"cool":0},"hZmb5Yf56WHn80wekPODDw":{"text":"So. Many. Feels. \nShould be a 4.5 as I would like to loudly use my Yelp platform to say \"C","useful":1,"cool":0},"3NMafyjAQHmyUYLY-nG1xQ":{"text":"THE BEST local creole restaurant! You have got\nTo try it! \nGreat service,\nIncredible food!","useful":0,"cool":0},"0kJrIQWzYr0dRyX3hiKUCA":{"text":"Where to go late night when everything seems to be shutting down? Galliano! Great vibe wit","useful":0,"cool":0},"HCP9H2-4QHvY8eiBEwdPEQ":{"text":"Loved this place. Great vibe, great food, really friendly staff. Good local beers on tap. ","useful":0,"cool":0},"K2EVWcsIBZJ_5NHSVUPMyQ":{"text":"The worse ever. Expensive lunch, slooow service, and just god awful food. Got the gumbo sa","useful":1,"cool":0},"PIWbQvzNPpTxrFbt9-iq9A":{"text":"As seems to be the case with new orleans, the outside of the restaurant does not preface t","useful":0,"cool":0},"BGgAk1gO4v7LtNkbVkRE0A":{"text":"Our hotel was just down the street so we wanted to check out this joint for dinner one day","useful":2,"cool":0},"qjKgDns0pnPvfVooCIahQQ":{"text":"The fried chicken had great flavor and perfectly moist. Yes to the food, so-so for the ser","useful":1,"cool":1},"YQ_tcp7Nq3nJzGLx6XIVjA":{"text":"This place was so great! Rory was our server, and he was super helpful with everything! Al","useful":1,"cool":1},"sGWx_-KsRcXuq34Bt5QeyA":{"text":"Best food in NOLA. Duck wings were like poison because they were to die for. Chargrilled O","useful":0,"cool":0},"xC9Z0oyE48vuQ3Xr-7U_pQ":{"text":"Really nice place with a casual vibe and really great food! The servers were very attentiv","useful":0,"cool":0},"EhmBwq4A0a66XTijXuq7qg":{"text":"Sat at the bar, food was great, service was amazing. The oysters were fresh, large and del","useful":0,"cool":0},"Ue9LPZvh3hi3ksv5PqEQVg":{"text":"I don't even know where to begin!! We have been in New Orleans for 3 hours, and let me say","useful":0,"cool":0},"Jc_vyOflBkZ7xAekjevZzw":{"text":"Food = Yummy!\nDrinks = Great! \nAtmosphere = Cool, very rustic! \nService = a little slow, b","useful":0,"cool":0},"vLc5RrZoJs6nw3SRYTtAzA":{"text":"Galliano Restaurant is the best restaurant I have ever been to in the New Orleans area. Fr","useful":0,"cool":0},"1Jp4dRpjgJuNSB8_0FMB8w":{"text":"Nice modern take on cajun/creole food. I had the pork stuffed with andouille sausage, whic","useful":1,"cool":0},"LcbgrASQoT4km3a7SVyo6w":{"text":"I was extremely disappointed with the service of one older gentlemen that was the host. I ","useful":0,"cool":0},"BT7vaqDvhkEeaYcQui5otA":{"text":"Great service from friendly people. Ate alone on a business trip, as were several other pe","useful":0,"cool":0},"xEkj9cl_s6HUTkmnZINOuw":{"text":"I ordered the fried shrimp dinner. They didn't remove the tails before they battered and f","useful":0,"cool":0},"3_AWlQDlvh8M2QqZ8amqOg":{"text":"I sat on the bar counter for appetizers. Most of the counter was free. I left my bag on th","useful":0,"cool":0},"HMQFQAHiKyo4XWhLC-wydg":{"text":"Galliano was a short walk from the convention center. It's on a quiet street parallel to R","useful":2,"cool":0},"mNZhs1Hp6i4kCSUUfXpleg":{"text":"This was NOT good food. The service was great, the atmosphere was okay the host was not we","useful":0,"cool":0},"bP7Sh9FmnRND8HdU8HJY-g":{"text":"My group considers this a 4.5 star place, so I rounded up. \n\nI took a group of six here af","useful":2,"cool":0},"_rchaIIBaCoZ0elN0oPKag":{"text":"I took my family to Galliano's on our last night of our trip in NOLA. Its a short walk fro","useful":0,"cool":0},"4wooqZvmWr30y5I0aCqXyw":{"text":"Great atmosphere and the food is always great. The service is top of the line. Great anyti","useful":0,"cool":0},"tgHJG0aCttrEVn7YF7iSiQ":{"text":"Eh, they kinda suck. 1 hour and a half later, no dinner. Not happy at, pissed actually. On","useful":0,"cool":0},"YLSj5h-76h66YtSZ5GLo5w":{"text":"Walked over to Galliano from my hotel during a quick overnight stay last week. First timer","useful":0,"cool":0},"iofW4tefWIHmHgGZkNgEMA":{"text":"Omg this was so good I absolutely had to leave a review! Omg! I got the crawfish pasta, an","useful":1,"cool":1},"4Qi4PiwPVvBV0bcCZlqsrA":{"text":"Stumbled upon this restaurant while I was attending a conference at the convention center.","useful":0,"cool":0},"JQP38dX125wjAVFKUZfFcA":{"text":"The sea food gumbo was really good. Then I had the fried oyster po'boy. This was a delicio","useful":0,"cool":0},"0RJhGrcWLjOxEWTf-7AOjQ":{"text":"Had 1/2 dz. Oysters and the seafood coubion....soooooo good!! Could have used more rice in","useful":0,"cool":0},"61Blq3lEI7s1PbgTkip0ig":{"text":"It was alright... server was very nice made suggestion had the alligator bites first time ","useful":0,"cool":0},"UrKgRZCYIhKQt5qrRSgmJg":{"text":"Great hospitality & even better food! I would definitely recommend this place while visiti","useful":0,"cool":0},"GBKGHj65VcOm74DCP2meAg":{"text":"We were visiting NOLA post Christmas and celebrated our anniversary dinner with some frien","useful":0,"cool":0},"YMUv_iWQBjaZ4UwhocZkcQ":{"text":"Came here for a nicer dinner during our last night in New Orleans. Our waiter (Mike) did a","useful":0,"cool":0},"AMbCG16EQcId7cS-Rnovow":{"text":"Took my husband here for his birthday. The food was incredible. I had the seafood platter ","useful":0,"cool":0},"IPDNrHRmaFQFhcH3bBiejA":{"text":"Is there even a such thing as bad food in New Orleans? I stumbled up on Galliani's two blo","useful":1,"cool":1},"gHZUt_MmEGRreGgPL3crxw":{"text":"Came for my birthday, super fast and nice service. Waiter was super nice and knowledgeable","useful":0,"cool":0},"TtwcOEUM57iPxG-kbgDAAg":{"text":"The food was solid - pretty ordinary fried shrimp, but truly delicious sides. The white ch","useful":0,"cool":0},"7Yiqg4fSOm9s1kU6WdUyMQ":{"text":"Just.  Go.  Service - outstanding and personable.  Food - spot on, as in \" little party in","useful":0,"cool":0},"mzcmZQnQ_xIM-BW941Lq8Q":{"text":"The chargrilled oysters here are to die for. The garlic butter sauce, overlaid by the crun","useful":1,"cool":0},"Es6o16a6_Cn3WR1K-nkCzA":{"text":"Had to stop one last time! Dinner and deserts were exceptional. I really enjoy the first c","useful":0,"cool":0},"TrfkuD5ZE6x8Is602EIjvA":{"text":"Excellent chargrilled oysters! The rest of the food is good, too. (Maybe not life-changing","useful":0,"cool":0},"c8BsuRICPykbclTB7dL6ZQ":{"text":"Had a great experience, never coulda guessed they just opened this week.\n\nService and staf","useful":1,"cool":0},"EhvepQSK5LoEzVdvYPm2tA":{"text":"This is by far my favorite place in New Orleans. Food is 5 star. Service is amazing. Super","useful":0,"cool":0},"P3Q8f2q2MyZyczVTr_Vkzw":{"text":"We happened by here as it was close to our hotel. We wanted to look at a menu. The hostess","useful":0,"cool":0},"HyCMfcLPlAidTcfO542FMw":{"text":"Unfriendly to customers with children for lunch. The host tried to deter us from putting o","useful":0,"cool":0},"zsYw6xMDfXHpK-vxi8nlxw":{"text":"One of the best restaurants in NOLA I have been to in awhile.  \n\nMy husband and I travel o","useful":4,"cool":2},"66Ofhjg6zk_C5pIhVheHWA":{"text":"A really nice Cajun/southern restaurant within walking distance of Poydras St. hotels. Don","useful":0,"cool":0},"40MvMNooUyWR87FDm_um5A":{"text":"I used the Yelp reviews and location to pick out this venue for a customer lunch. They onl","useful":2,"cool":1},"YRkxQ-UWCAj8msrFokxSPA":{"text":"Wow... just left from the most volatile situation of any restaurant I've ever been to and ","useful":0,"cool":0},"xAt3A0H7dOpwaS9Jt-tjIA":{"text":"The prime rib for two was amazing. Priced well, too.  Our server, Rafael, was a treat.  Al","useful":0,"cool":0},"JnRy2InDSKUjggZGRB7xhw":{"text":"Came here for my birthday dinner while in NOLA and all 4 of us LOVED our meals. Two of my ","useful":0,"cool":0},"Kh-qbtMhwp0aNryUaYsfxg":{"text":"I was told by someone who loves his oysters to check this place out. It was already on the","useful":0,"cool":0},"RuqaSV8h1Ogd9i3NcOs4Wg":{"text":"The raw oysters are much better than the chargrilled oysters.","useful":0,"cool":0},"O_bJkj88MWdebrNlIS8TrQ":{"text":"The appetizer alligator dish was delicious. For my main entrée I had the BBQ shrimp poboy ","useful":0,"cool":0},"fKbrvGNzOHzg_zzFaojpCg":{"text":"Best food ever!!! I totally recommend the duck wings and The Crawfish pasta! I came here t","useful":0,"cool":0},"WrGO-rAzcApejBZ0Qqh3fA":{"text":"Sat at the bar and the bartender was great. He made great recommendations. I had the duck ","useful":0,"cool":0},"OnQ-Aa9B8zGiZFWZU2kIfA":{"text":"What a find! A short walk from our hotel on Poydras, sits one of the best finds in New Orl","useful":2,"cool":2},"dIeErQK7NsvkDiXxB0MbkQ":{"text":"Great place! We stopped In for dinner and we were not disappointed! Great oysters, drinks ","useful":0,"cool":0},"IzwpAEgGVhmM5umF-oIMGQ":{"text":"Excellent food, excellent service. My students and I visited New Orleans two years ago and","useful":1,"cool":0},"xESMXf-sOlo67wST3riUaA":{"text":"It was a very nice place just not quite the elegant and relaxing environment I wanted. Gre","useful":0,"cool":0},"2GLKXTShOqpVHyKr7QBaWA":{"text":"Anxious for some raw oysters, I looked at the website for Galliano and there appeared the ","useful":0,"cool":0},"K1ObWJcHRZKnTvSx49cLHQ":{"text":"Go to NOLA, they said. Have clams, they said. So I did. And the baked clams were divine. I","useful":0,"cool":0},"Pd2t5kysy8-QU9gIxTeJyQ":{"text":"We ordered a few appetizers here to share to start our our trip in NOLA. Their gumbo was h","useful":0,"cool":0},"BzMbAjOzqnLcQ7Zc_eXerQ":{"text":"We stumbled upon this place on the walk back from a festival. The tables were full but we ","useful":0,"cool":0},"s8o7RDfLMpox36HGdWPNbA":{"text":"Disappointed. I was expecting a lot from the good reviews. Everything was very mediocre. T","useful":0,"cool":0},"BnSRDK3HOTNKivhFi41jqA":{"text":"We were is New Orleans for a business conference. One of the other attendees raves about t","useful":3,"cool":1},"LjnKT_yEJk-0WhA_4nGAug":{"text":"This was my first restaurant I went to in New Orleans while visiting. Came here with a fri","useful":0,"cool":0},"8TmhNtknbtCivv-k0FjWfQ":{"text":"Awesome atmosphere and great drinks, and the most amazing Porkchop I've ever had. It was a","useful":1,"cool":0},"UgVXdF_QWt4cZ_TMCCz_8g":{"text":"One of the finest meals in the Warehouse District and actually more reasonable than the ra","useful":1,"cool":1},"Hxnd_dnJbikY9ydVegtWzg":{"text":"Fantastic experience! Service was wonderful and the food was amazing! Started with the oni","useful":0,"cool":0},"2B1yO0V9Xm4dMo7w9JxSNg":{"text":"Went here on Valentine's day for my best friend's birthday and had a great time. We had a ","useful":0,"cool":0},"Mif4xfr-VYhZC5zJtacktA":{"text":"Evening with \"Elle\" at Galliano Resturant! She's a must see if your in the area. The whole","useful":1,"cool":1},"Zu52qgGi2w4LhaOF4XgmPQ":{"text":"This place was awesome! I got the pork chop which was HUGE and had tons of flavor along wi","useful":0,"cool":0},"txFyG5TYutdmiLvrc1MJ0Q":{"text":"We came in during happy hour and were informed that they only serve drinks and apps during","useful":3,"cool":2},"wtX_1R6mpwSZWGU2b89dXw":{"text":"You have to eat here-awesome food and service. Was looking for some diner close to hotel a","useful":0,"cool":0},"55tXaja8agXGIBZ1VQ0Ftw":{"text":"Had a great lunch today. Grilled oysters, fried catfish and gulf fried shrimp. Would recom","useful":0,"cool":0},"S2j-sA0X-61jr1klJW8f_Q":{"text":"Amazing food, amazing staff (thank you Katie!) and amazing service!!!\nI had the crawfish p","useful":0,"cool":0},"waRiwyMK5ZZTbB65Vk3RKA":{"text":"Amazing food and great hospitality!  Everyone there ok great care of us and went the extra","useful":0,"cool":0},"0_heBlkVZW-ha5JzfxF7gA":{"text":"I came here for the grilled oysters, but everything I had was really wonderful. I'm a litt","useful":0,"cool":1},"Rpx3zVNPRVp6tltZq0p0Fg":{"text":"Very disappointing dinner last night. The service was extremely slow. We ordered 2 appetiz","useful":0,"cool":0},"J2VIxpsMSZn3VrpBYyBB_Q":{"text":"You need to try it!  Had the shrimp po boy delicious. My absolute favorite thing was the p","useful":0,"cool":0},"g9yhnYtZ8YALdppO47ED1Q":{"text":"Service is painfully slow and waitress forgetful but nice. Food mediocre at best. Don't un","useful":2,"cool":1},"AvU5iIQrN5PC6lDJr9Ogjw":{"text":"This was NOT good food. The service was great, the atmosphere was okay the host was not we","useful":0,"cool":0},"cYZfHXmiKmotYz4GDUYtrA":{"text":"I recently had dinner at Galliano while in New Orleans on business. The dining area is sim","useful":1,"cool":0},"tj9hguRGCsEOrWD7Z6tp3w":{"text":"Food was cold, meat quality was poor. Wait staff was OK, nice enough but failed to notice ","useful":0,"cool":0},"3vXW7eY2_F9eRyJ8xYWNDA":{"text":"This is my first time at New Orleans and I had a great experience here. Cajun food is some","useful":0,"cool":0},"eQ0geo8ey32T0hfS2C9J_g":{"text":"Great food and service. Food and beverage are fairly priced.","useful":0,"cool":0},"OGV9RHsd-5qKX8IdNM7d5A":{"text":"Love this restaurant. Amazing service. Between my fiancé and I we had the gumbo, soup spec","useful":0,"cool":0},"pvlLbL1z6dDALrN_8UydQg":{"text":"If I were you I would sit at the bar. The people there are very warm and friendly. If you ","useful":2,"cool":0},"4Kr18Vg1J5cBhaU2FwisJw":{"text":"Just popped in for a nightcap & dessert. Dessert was tasty & a generous pour of wine. my h","useful":0,"cool":0},"WDWiIEI7B01amF-TQPuzkw":{"text":"Such excellent service! Katie, our server was great! The food was delicious, came out quic","useful":0,"cool":0},"DDT2ByZUWp_e49Hw2HYPgA":{"text":"The chargrilled oysters are excellent!  They had a mushroom soup special that was deliciou","useful":1,"cool":0},"iL-dd-3QNNrXaxm2gNXiSA":{"text":"You need to try it!  Had the shrimp po boy delicious. My absolute favorite thing was the p","useful":0,"cool":0},"8ROkYGfxGKGsjVyQt1dIsQ":{"text":"I came with pretty high expectations, but was a bit disappointed. I got a recommendation o","useful":0,"cool":0},"pni__vFODU21JEAGl2C7XA":{"text":"Ordered the seafood platter. Nice atmosphere friendly employees very helpful on the menu 5","useful":0,"cool":0},"uG9pA-XZN_1sR0-FAXEsMA":{"text":"Had the Crawfish pasta, was beyond delicious!! My daughter had a fried shrimp Po'boy and p","useful":0,"cool":1},"K94zHX21ldnWHUvGSR0GVQ":{"text":"We loved this restaurant. The wait staff and owner were so personable. Good drink options ","useful":0,"cool":0},"WQXa6cxNI4eRqQf-hp2vOg":{"text":"The food is ok (had to enlist a 3rd party service to try the food). I called for a to-go o","useful":0,"cool":0},"zEpNCZB2BlOpDIj9v4xadA":{"text":"Amazing authentic creole Louisiana Crusine!!!! These guys got it going on...from food to s","useful":0,"cool":0},"200KAeFFzxHmMT9kKTNX0g":{"text":"Incredible food, service and atmosphere. Casual dress...try the blackened fish of the day ","useful":0,"cool":0},"-7eTQtTPDEQxK-FsBDD2cg":{"text":"One star for service.  I have eaten there a few times and the food is good. Went in the ot","useful":0,"cool":0},"qrE4QhMSL_Jzfq7oh5Himg":{"text":"Everyone enjoyed their meals. Seafood platter was a great fried option. Don't over look th","useful":0,"cool":1},"cwD8wl2F5JWmPhN-D9cSpA":{"text":"This was a pretty solid meal, although I felt like everything lacked salt. I had the corn ","useful":0,"cool":0},"VQmMUAduOB_1m3nVcEydCg":{"text":"We loved this restaurant! Fresh off the plane & attending a graduation we were happy to re","useful":0,"cool":0},"sY9kQTW774NnPp8OWcYKzA":{"text":"The service was great, the drinks were great, the food we ate was pretty good. We'll back ","useful":0,"cool":0},"6qksFpYQBUG5s21Yc1CCEQ":{"text":"Tourist trap but a good one. Ordered raw oysters and crawfish Monica and they were amazing","useful":0,"cool":0},"TFCHYfUbstAbVq1y-X_ttQ":{"text":"Oh no~ never good when the yelp family let me down.  Came here with a party of 3 on a Frid","useful":3,"cool":4},"TPAWbp-USoyKXUJsUPoKyw":{"text":"I just love the raw oysters here. They taste so fresh and just melts in your mouth. Tried ","useful":1,"cool":0},"cJfqcBoh356mbJY90WfcOA":{"text":"Decent food. Honestly I feel like is way over priced for what it is though. \nHowever, our ","useful":0,"cool":0},"pRUVXSCql7lY9ZIrkbziNQ":{"text":"We've been in New Orleans eating out all week. Without a doubt Galliano has the BEST food ","useful":0,"cool":1},"dv4s9TliOhc8zZ4eq4SIrQ":{"text":"Loved the food, place and service! The dessert was our least favorite but the rest of the ","useful":0,"cool":0},"sK8rMv2pq54D8js_e1Am1g":{"text":"OMGosh!! This place was da bomb! Everthing we ordered was excellent.. the catfish, hush pu","useful":0,"cool":0},"cIzwZtOURGJ1S6_Zk0Q5_Q":{"text":"It's our first time in NOLA and I am speechless. The food here was delicious and the custo","useful":0,"cool":0},"G4kis6hpIAzxj-gWkRaryg":{"text":"Every restaurant has a signature dish.  One dish where you say I want to come back here fo","useful":0,"cool":0},"bd5TrPhGfkPgtz0EMta9-A":{"text":"First, let me say the service was very good, but the food was ... blah. Cora, our waitress","useful":3,"cool":1},"Z_VwjIDKu2tANcqXVchzZw":{"text":"You can't argue with high quality oysters with a glass of wine.\nThey have the best oysters","useful":1,"cool":0},"V8Rpy2Y0Se4Uvf948s-ujg":{"text":"Yum yum YUM. I came to Galliano for the first time last week with two friends. We ordered ","useful":0,"cool":1},"tDccII7WpUGz-lMFOvvYWQ":{"text":"Great local spot, excellent service, the dishes and truly superb and radiate New Orleans c","useful":0,"cool":0},"2BjUSDbLgvjqWf0WCnXEWQ":{"text":"Amazing food! Great drink! Wonderful staff! They actually seated customers after closing. ","useful":0,"cool":0},"B02hoIoag3L6qTw1QIQjNw":{"text":"Crab soup was great and charbroiled oysters were okay. Beer was good and staff was great","useful":0,"cool":0},"Y-pn8nTqaGgDSfVkMSy3EQ":{"text":"I treated myself to a week in New Orleans as a birthday gift. While my visit was filled wi","useful":0,"cool":0},"uvvUBzoUOmHDTEoHCMjTrQ":{"text":"Went for a late dinner. Made reservations and we were sat right away! Our waiter was Larry","useful":0,"cool":0},"NgTUTlrBXS0LfJ08Qt9E4w":{"text":"We were in NOLA for a weekend trip, and wanted to try some more traditional Cajun/Southern","useful":0,"cool":0},"lSbOkApBfVhAXsZ2r36_oA":{"text":"The crawfish pasta was by far the best meal that I had while in New Orleans for a week! I ","useful":1,"cool":0},"MDMcGlwY2pdoQxpcMrQG0A":{"text":"Little gem of a place. We had a cranky and hungry four year old with us, and as harassed p","useful":0,"cool":0},"9bzqL7XdGVsTclRIsghtJQ":{"text":"My parents and I went here for dinner one evening without having made a reservation. Of co","useful":0,"cool":0},"nta92loj1blRGWh544tILw":{"text":"Great dinner tonight. Our waiter was very friendly and helpful ( Larry) The Food was delic","useful":0,"cool":0},"wIg1nPxQ6JwUvHL1V1_cxw":{"text":"Holy crap great food. The service was also phenomenal. We got the charbroiled oysters to s","useful":3,"cool":0},"gtXrMT8vvPCKXtu8xlRJ3w":{"text":"Beautiful food with excellent service!! I'm not as \"oyster person\" but their char-grilled ","useful":0,"cool":0},"v6nWm3F1IyyEhTUW1P_gag":{"text":"In town on vacation and decided to stop by Gilliano's for a nice dinner. We went in early ","useful":0,"cool":0},"DCFds4RBgKWW0Z5ijQ4FBQ":{"text":"Oh my gosh!!! Wonderful food, lovely staff and great beverages as well! I had the special ","useful":0,"cool":0},"p3IvcBiVyPuBEXefe-hgSQ":{"text":"Came here because of the stars and reviews. Left with a bad experience. The oysters I orde","useful":0,"cool":0},"q84kvyKTmZp4-z1Li2fBcQ":{"text":"Don't bother.\nFood was poor quality. Too much breadcrumbs on our baked Brie appetizer whic","useful":0,"cool":0},"aKbnhPVPsIHxn_ZughAplw":{"text":"This place is incredible! Reservations are recommended. The oysters are incredible with a ","useful":0,"cool":1},"TuvhJyPDeh5QCZrQWYEWnQ":{"text":"Had the best experience at Galliano. Korey the bartender gave top notch hospitality. I cam","useful":0,"cool":0},"XiTGWxoy4uDhvIAYWa3jJg":{"text":"Came here on Sunday night. I think I messed up the reservation because they didn't have us","useful":0,"cool":0},"uPTSF7DR9DjFs0d2Oz0bkg":{"text":"Entirely more touristy than I expected. Nothing was bad just in general slightly over seas","useful":0,"cool":0},"4-y7HzfqI6xRa62_OfFA8w":{"text":"This place is incredible! Cannot recommend it enough! The fried oysters are the best anyon","useful":0,"cool":0},"xGJwMdCh516a8IFQNQ5Jiw":{"text":"Could there be better Creole/Southern food in New Orleans?  I doubt it!  I've eaten at the","useful":0,"cool":0},"W2MsGI1Bb1EH1_jIw9BP2g":{"text":"Overall experience was disappointing, beginning with checking in with the hostess, we were","useful":0,"cool":0},"Gu97eenrY9VsW62MNgK1vg":{"text":"My new favorite restaurant.  I'm a local and this place has the best non-tourist food.  Tr","useful":1,"cool":0},"fRDKGhe3vimiaDD_pl4-hg":{"text":"Too good to describe completely in a short paragraph. Great drinks, great staff, amazing f","useful":0,"cool":0},"lKeBUPPUZybc9pszcXWWkA":{"text":"Pleasant lunch in a classy casual setting. Easy to walk to from the convention center. I h","useful":0,"cool":0},"eRv51e1mL_n6OrJcaKAtzw":{"text":"Very nice restaurant near the Convention Center.\nWe ordered Blackened Oysters, Duck Wings,","useful":0,"cool":0},"-yuydR2stNyrjWuJ3OF3gQ":{"text":"Just realized I did not post this correctly the first attempt thus, the review is a few mo","useful":0,"cool":0},"hgbJ3vPPdbg_Hzfo1l6aYQ":{"text":"Food wasn't bad right up until a couple of mice decided to join us for dinner. They were r","useful":0,"cool":0},"9KTpiD_JS38DpIwSDuLZtg":{"text":"Fried shrimp was great, fried chicken was great, alligator appetizer was great, service wa","useful":0,"cool":0},"r5YBgKcx4O7lWzv7bdglVw":{"text":"Food wasn't bad right up until a couple of mice decided to join us for dinner. They were r","useful":0,"cool":0},"7bRqO5malkAKPslQbx1z9g":{"text":"Food was superb!!  Troy's charbroiled oysters were the best I have ever eaten!!!  The bart","useful":0,"cool":0},"ALl_jHDeTr0Q5WL2JNfA0g":{"text":"Galliano has been a periodic go to restaurant for me near my condo.  I did not have any ne","useful":0,"cool":0},"TAKUj3MpeuRY1cqRhRA1qw":{"text":"One of our go-to spots when in town for business. Everything we've tried on the menu is am","useful":0,"cool":0},"0pKD_znwIviL9jCNIr3WyQ":{"text":"This place is the bomb! We had the chargrilled oysters,  duck wings,  seafood gumbo for ap","useful":3,"cool":0},"JBxY9xr7rNf6ljp9PgITow":{"text":"Outstanding Local NOLA eatery.   Oysters on the half shell and the char grilled oysters an","useful":0,"cool":0},"STxit0NWX1_7ff3vuo4YdQ":{"text":"Couldn't get a reservation in this very popular place,  but decided to chance it after fin","useful":0,"cool":0},"Kw_DzlsCnWmK1VG23RfLwA":{"text":"I was not prepared for this place to be as good as it was. Honestly shocked, after eating ","useful":0,"cool":0},"om0oBjfI6PLR_j_K4opbhg":{"text":"Dishes were a little bit too salty. Oysters were great. One of the oysters had small stone","useful":0,"cool":0},"HjSPP6ynM0DGv2bWWXfm1A":{"text":"Great casual atmosphere. Lots of excellent menu selections. We all liked our food which in","useful":0,"cool":0},"27a1565pa3fghbfUgyKaqw":{"text":"We went here, without reservations, on the first day of a large conference taking place ju","useful":0,"cool":0},"PDsHgB97KBlRuf-kUWtpOg":{"text":"Very good food. The duck wings were phenomenal. The sauce was sweet and spicy. Tried not t","useful":0,"cool":0},"xHewphPv0VsknF5AgoZNuA":{"text":"First time in NOLA and it was recommended that I tried charbroiled oysters. I have had raw","useful":0,"cool":0},"zQHdgp8PJnAK_bazYh4ayg":{"text":"Omg!  Place was recommended and I'm so grateful!  Came for my son's 21st Birthday and they","useful":0,"cool":0},"Ce2Y2QXBTjBkMS6KPeWA5Q":{"text":"Great spot with great atmosphere. Get the Oysters either raw or Chargrilled, both were out","useful":0,"cool":0},"6E-JgvQbmuvveC-zZFH2TA":{"text":"Nice staff, we had to sit at the bar because the restaurant was so full on a Saturday nigh","useful":1,"cool":0},"HK0PZbwSht580wslfzN9mg":{"text":"Very authentic cuisine and atmosphere.  Excellent service from genuinely happy people.  Th","useful":0,"cool":0},"vg8Q7cvx3MzUGlcA7KazKA":{"text":"Three stars because my wife found plastic in her vegetable pasta. I'm not a cheap man, how","useful":0,"cool":0},"s9u5dwsWqF9LTbswmUvNTg":{"text":"Millita and Rob were awesome and provided great service. They recommend the best appetizer","useful":0,"cool":0},"zH7V22242AkniO39dxI2zQ":{"text":"I got into NOLA after all of my colleagues and had no desire to eat at the hotel. Walked o","useful":1,"cool":0},"r1fn49YUAQUpfkGRdST2gw":{"text":"Nice restaurant but service started out a little rocky. Server didn't initially greet us a","useful":0,"cool":0},"rwYm-lpFdKFce0GzqQWqVw":{"text":"Some of the best food I ever had. Servers were excellent. Ambiance was great. Highly recom","useful":22,"cool":21},"6Pfj2StE002C5P-4TfZ8kw":{"text":"The service was horrible. Our server was rude and sarcastic. I had to get up and walk to t","useful":0,"cool":0},"bHjQwNFa4MT3RNtoeXkpSQ":{"text":"Had reservations here tonight, and not only were they accommodating with moving it back a ","useful":1,"cool":0},"9ZeD-LF9rSGZdbUWnXVvKA":{"text":"Really delicious NOLA seafood here. Wait staff was incredibly nice. Apricot crumble for de","useful":0,"cool":0},"_iakWQ0G2eOVyIOCjxJX6A":{"text":"My family and I were in town visiting from NYC this week, and saw this restaurant near our","useful":0,"cool":0},"z9TFJeIiOSfa43FFA7slFw":{"text":"Yet another hit and what I consider a true gem in the city nestled near the convention cen","useful":0,"cool":0},"4ykl1LGfz8MN_qcYUpvATw":{"text":"Me and the beautiful wifey attended this cosy restaurant. Upon arrival we were promptly se","useful":20,"cool":16},"sfKFvxULCEeKK2ucxmi2og":{"text":"Wow wow wow! I had the best pork chop of my life here...the pork La Place was a perfect di","useful":2,"cool":2},"Sx4EBgjAp0BkzCG-BmJTAw":{"text":"This place was so delicious! The staff is friendly and courteous! Best catfish I've had in","useful":0,"cool":0},"YoGZE6RQSVwCTh1qqKNUTQ":{"text":"Out of this world chargrilled oysters!\nI died and went to heaven, only to come back the ne","useful":0,"cool":0},"na92uhuwo6lqsFRyhDCkUw":{"text":"I actually heard of this place from a friend. It gets really crowded quick so it's actuall","useful":0,"cool":0},"-l0-r9WBc_6w9OksxXHACg":{"text":"Best Bloody Mary we've ever had ANYWHERE! Food was fabulous. Staff was awesome.","useful":0,"cool":0},"W9723BsKgWjxGXjVplLIQw":{"text":"Fantastic atmosphere. Fantastic food. The catfish creole and jambalaya are incredible.","useful":0,"cool":0},"YflXcIxunseszpfei2WaNQ":{"text":"Sat and bar and watched the cubs game....we were the first at the bar, 9pm As maybe 6 tabl","useful":0,"cool":0},"WmEkiGDrvc5vzsoeM8rnYQ":{"text":"You know, when I see allll those stars stacked up, I'm really excited about joining in on ","useful":3,"cool":0},"tHRsxLYlTAesYsKr8c0g5A":{"text":"Loved this recommended place! Had the Pork Chop La Place and loved every bite! Could only ","useful":0,"cool":0},"YOjb-84bfP5Xl0E0nVG7uQ":{"text":"Quick seating with amazing food and friendly faces!\n\nMust try the duck wings with mango sa","useful":0,"cool":0},"XqUA4AB23rJpqYK32dB2Jg":{"text":"Food was awesome! Service was okay. I'd definitely come back. Pork chop was HUGE and could","useful":1,"cool":0},"BXOimJzX2CeNW0TUBETqPA":{"text":"We stumbled across this gem, and it exceeded our expectations. The staff was friendly and ","useful":0,"cool":0},"3gRQxQeerKmiN_2toRhVTg":{"text":"This restaurant is definitely not worth returning for the locals. The \"seafood platter\" is","useful":0,"cool":0},"R3VxIVXAZtwc1xwGv0h9vw":{"text":"We are here while in town for a conference. My friend had the pot roast with potatoes and ","useful":1,"cool":0},"H0SN3cs38ANQdQ7_yQYSnA":{"text":"The food was good but the service was very slow. I ordered oysters and received them befor","useful":2,"cool":1},"ATwmIRWTIUQnWhSUdZHjpw":{"text":"Give them a call to do a reservation, although bar is also available. When we got there, t","useful":0,"cool":0},"yRPIHZxlM4WTbDiCgDYXyA":{"text":"Got the redfish special tonight. Vegetables were delicious. The fish was so tough I had to","useful":0,"cool":0},"wVPEbnTdyzbqlPNi7OFs4Q":{"text":"The food was absolutely out of this world. The only strange thing that happened is we were","useful":0,"cool":0},"tuWhldTygQIMQWTzMxAGiw":{"text":"Galliano Restaurant, where have you been all my life? After all my years of travel to New ","useful":1,"cool":0},"i7oG7YLbByJj32TIWLQa1g":{"text":"A big part of me wanted to rate Galliano 2-stars, but the one thing that wouldn't allow me","useful":0,"cool":0},"NtuKaqe22ZaTD5jxrp8SmQ":{"text":"I came here with a group for dinner. It was a little casual, but nice. There is a large ro","useful":0,"cool":0},"xke1QX9BQMb-UqLMTu26iA":{"text":"Wife and I came here to enjoy a meal close to our hotel and definitely enjoyed it. The atm","useful":9,"cool":9},"IDw7PvnxWgWpONu6HMeEjA":{"text":"What a great find! We almost went across the street because of how empty this place was wh","useful":0,"cool":0},"yRYM56ngM2Gzuv-itxUXWA":{"text":"Great food, service and ambiance.  Highlyrecommend for anyone visiting the city.  I will b","useful":0,"cool":0},"AnWD7uIEsH9XnhcDfZheKw":{"text":"Had to leave. Friday night the weekend before Maddi gras, and tables open but no staff to ","useful":0,"cool":0},"S8cjyF6z3L0dBmrpv4SuqA":{"text":"Must get the smoked old fashion. Food is good but ambiance is better. A little expensive f","useful":0,"cool":0},"Ho2tFyKmcJsq8Gshoed6Hg":{"text":"We went here for dinner because of its proximity to our hotel.  Unfortunately we were seat","useful":0,"cool":0},"ZU1SR46jYD6A4Zo8Nlk6Pw":{"text":"The food was delicious and the staff was friendly. This is everything you'd want in a New ","useful":0,"cool":0},"DKU0obQPlN1ihT5w0A-R8g":{"text":"Highly recommend for a nice and quiet dinner without the Bourboun street ambient. The serv","useful":0,"cool":0},"pZZkSl2Me5FXpL1T-mP3rw":{"text":"One of the best flavors I have had in New Orleans! \nThere is a Pork Chop that is amazingly","useful":1,"cool":0},"MhXy7qUXuy5qC9rhYM8nVQ":{"text":"This is a definite must try. We were in a large group of 11 people so we all shared to be ","useful":0,"cool":0},"95N44njbCRsynigVtNn_Hw":{"text":"Server, Katie was excellent!  Food was excellent!  Hot & tasty.  The entire vibe of the re","useful":1,"cool":1},"fQtqMpX2yFh0ZX2z93uWwg":{"text":"Had a great Sunday brunch here. We were there right when they opened at 1130. Wasn't busy ","useful":0,"cool":0},"gwtwdewbzo2IhbAK4Koxqg":{"text":"The best gumbo I've ever had in my life, the guy next to me gave me one of his grilled oys","useful":1,"cool":0},"YRyh5uIThh6RVYxGmLuZfw":{"text":"This is my new fave restaurant in NOLA- which I never thought I'd say. I've eaten everywhe","useful":1,"cool":1},"v9-Cuke6P57MAaBr0T_jNQ":{"text":"Fantastic laid back place with outstanding food and service.  Came highly recommended from","useful":0,"cool":1},"cpo4HD9PPaq9QjfrGRhBzQ":{"text":"Been eyeing this place all week and for my last night in NO, I had to try it.  Met with a ","useful":1,"cool":0},"BeGVpw_NwfFhnI4FXv-zbA":{"text":"First time in New Orleans and this where we ended up at. Such an amazing service, I don't ","useful":1,"cool":0},"IZGSe_ousVWkL9hyQY-4Ag":{"text":"Galliano is a nice little neighborhood creole restaurant. The service is friendly and the ","useful":53,"cool":57},"QlnyW8J66C-6Tko9SeyFoA":{"text":"Really happy with the decision to stop in here for a lunch with my wife , duck wing appeti","useful":0,"cool":0},"iGdR7jHU8EjwlgGBNzOj7g":{"text":"A group of coworkers went here for dinner after our conference, mainly because someone in ","useful":1,"cool":0},"cNquIpm6FreLGKh8m0uzZw":{"text":"Who says you cant find a great New Orleans restaurant a block from the convention center? ","useful":1,"cool":0},"SyjlAdfx_xMFgZ_qBRIv-w":{"text":"Best restaurant in New Orleans from a frequent visitor.  While only open a couple of month","useful":0,"cool":0},"YMriMBWOFRRLOLWgn8ZqeQ":{"text":"Great service, great drinks, phenomenal food! I am a pretty harsh food snob and this resta","useful":0,"cool":0},"96BjO7lcnhA6ISjXTHRw2w":{"text":"Made reservations for a Thursday night. Did not need a reservation. Place was not busy. Se","useful":0,"cool":0},"370Er2rnPQoyLIWvr8DR7w":{"text":"In New Orleans for a conference and came across this restaurant online and saw good review","useful":1,"cool":0},"DTT17a5LIcyW76igNPN7gg":{"text":"A good restaurant with nice atmosphere and good food.  Made reservations via yelp for 3 of","useful":0,"cool":0},"53OSbYdUFZBZn_iHekO5-A":{"text":"It was dead empty on a Friday at 6pm, which was ok, maybe we were early. The server was co","useful":6,"cool":1},"O-qI6rcWFn7ene6YwCjUiw":{"text":"This place was all around great! To find a place that's open is hard but to find a yummy p","useful":2,"cool":3},"zU7-eq-hkq8_DfKVGEWd-w":{"text":"Service was friendly, food was fabulous and fast, and atmosphere was nice -- especially fo","useful":3,"cool":1},"Pl_lBLmWsCQavOQ41QGn8Q":{"text":"Had dinner at Galliano's last night. Our meal was fantastic. We didn't have a reservation ","useful":0,"cool":0},"_CEk_KFB1AmW54WonAMJEQ":{"text":"I should have taken a picture of our food.  I had the Portabello Mushroom Tower which was ","useful":0,"cool":0},"8MJQDA2ySEoahKU4UeM1SQ":{"text":"Hands down the best meal we had in New orleans. The restaurant is located near the convent","useful":0,"cool":0},"uckqvnk5bMy-L4IzoFyvaw":{"text":"This was the very first place we came to in New Orleans.  We sat at the bar and got some t","useful":2,"cool":3},"WAio2aX_JpDoe23XAYaP5Q":{"text":"Wow. What an amazing pork chop with just the right blend of sweet, spicy, and savory. Port","useful":0,"cool":0},"hCzpRwsczbel3gdoZ8to7Q":{"text":"Horrible!!!! We've had better charbroiled and Rockefeller oysters in Houston.  Not even cl","useful":0,"cool":0},"8w_fnjYIGhe5y78M_xRHpQ":{"text":"The services and the food was terrible.   First impressions are lasting so I will never pa","useful":1,"cool":0},"cYNwMeip25iEAO9dKnXCOw":{"text":"Galliano's is a true gem located near the convention area of downtown New Orleans!  Totall","useful":12,"cool":13},"GHP9igSpBK85ajc7C25CFg":{"text":"We are two doctors went there. As our color is brown, they though we do not have enough mo","useful":0,"cool":0},"MJjMQAa6xLLs3m5RYWpb6A":{"text":"Excellent food and ambiance. Very New Orleans, but with unique twists to some of the dishe","useful":0,"cool":0},"9WHwUDIC8WdAXg1XbWnS7Q":{"text":"Outstanding food and service.  Special shout out to our server Neil who was so friendly an","useful":0,"cool":0},"td9lEtPhjnqRHCUrgCU3IA":{"text":"We came here for Valentine's Day, and mi amor was greeted at the door with a  #Winning\n\nYo","useful":4,"cool":2},"fnni9-W_v_jHFjcnY_wehg":{"text":"Excellent food, service and atmosphere! Tessa was as sweet as could be, very attentive, kn","useful":0,"cool":0},"uDBoT1FxvfpAVrk1pdokMQ":{"text":"We visited Galliano on Bacchus Sunday for lunch.  Our server was Larry and he was Great!  ","useful":0,"cool":0},"h00_vigCGwA1WWgBI79PHw":{"text":"The gumbo had to be the best I've had in a long time. Fast friendly service. Evening start","useful":0,"cool":0},"DS_IYyrtgrpoj-puRgtu7Q":{"text":"We had and hour and a half for our lunch. It was too long. But for a place like New Orlean","useful":5,"cool":0},"XHhev6p4_NTSExHOLCqaPQ":{"text":"The Jean Lafitte Gratin is a great way to get thinks started.  Perhaps Sone chicken gumbo ","useful":2,"cool":0},"d-1MHzHJAWtKHDkCDwOR4g":{"text":"I can say they had the best oysters so far in New Orleans that IVE TRIED... Chargrilled an","useful":1,"cool":0},"rmCRWsOGpWHjBYUEE6c63g":{"text":"I've always thought it was a \"weird-flex\" for a waiter to try to take an order without wri","useful":1,"cool":1},"6Et5IzyxorI5Hzgm2BbHcw":{"text":"We finally got a chance to try this restaurant after wanting to for quite a while. \nWe wer","useful":0,"cool":0},"fSo5LRGL-uhW-63dcxYEQA":{"text":"We chose to dine here on a recent visit to New Orleans and we were not disappointed.  The ","useful":0,"cool":0},"JeawpozSllbH9dydhRJG9g":{"text":"Great pork chop.  Great hush puppies.  Great mashed potatoes.  Great crawfish pasta.  Grea","useful":0,"cool":0},"pVMvkuQmelKfWa8LLWpXgQ":{"text":"Ok I really liked  my entree but there are  a few things to note. They usually bring compl","useful":4,"cool":1},"l58K4wYm_83m9iktYeIoTA":{"text":"Locals perspective. Nice location. Nice ambiance. I went for the food and paid for the loc","useful":0,"cool":0},"2tzcAw4sC3skUrUvox4NWQ":{"text":"Amazing from start to finish! Staff was friendly and helpful, food was soooooo good. We go","useful":0,"cool":0},"W6hQ22pMAbMy6mnuQtfsXA":{"text":"Great Oysters Rockefeller \nFantastic staff and overall never had a bad meal there\nAlso rea","useful":2,"cool":0},"voRXqiZ20GBjTrecWczxkg":{"text":"I finally made it here I purchased a Groupon over a year ago and of course it had expired ","useful":1,"cool":0},"KZ11ebXFiLmApQVdNQ4_Wg":{"text":"I love Restaurant Rebirth so I wanted to try their sister restaurant. It is larger and has","useful":0,"cool":0},"axs3z2TOhHwMFJm9Kb7GYg":{"text":"We were looking for a good seafood spot and I'm glad our concierge sent us here. I can't r","useful":0,"cool":0},"8KgxHFga8ktxnNeRMF5XyQ":{"text":"Ovepriced, but good.\n\nFood ordered: I had the gumbo, red beans and rice, and oysters. My f","useful":0,"cool":0},"OJsSRvVks8-Y30RRqqSuIg":{"text":"Amazing!!! Love the flavor and the ambiance!!!  We definitely hit the jackpot when we were","useful":1,"cool":1},"fkIFe0vYIhCSCLRaSUaqJA":{"text":"I'm visiting this week, and this had been one place recommended to me by people at home.  ","useful":0,"cool":0},"raXCjfWMYFmkrd8XQHir5w":{"text":"WOW.  What a great place.  The service was fantastic.  The ambience is marvelous.  The GIN","useful":0,"cool":0},"JO356S2m6ijsLfbMVTKqAQ":{"text":"I was excited to try this place. We Visited for lunch while working at the convention cent","useful":1,"cool":0},"UU1yGZ0V2kky5lxKGnEfIw":{"text":"This was the first place I ate at when I was down in New Orleans and my boyfriend is still","useful":1,"cool":1},"jMlTlrZ0SRXYyImCiy7wFg":{"text":"Came here to explore main area of New Orleans and this was my first stop for southern food","useful":12,"cool":12},"5y-4GyqT__e3XJI7aSnLRw":{"text":"If you don't want to break your bank but want AMAZING FOOD come here. And wanted to thank ","useful":0,"cool":0},"wX42uB7qidtrNe4n__TY-A":{"text":"Gumbo and a seasonal salad with beets, fennel, greens, crusted goat cheese and a lovely pe","useful":2,"cool":0},"0JRFIATrD1-S5zg01mGMLg":{"text":"The hardest decision at Galliano's is committing to one entree. The menu has numerous stan","useful":0,"cool":0},"jQ_QT2HZUI73trZSnVdn-w":{"text":"So good! Sat at the bar for drinks and dinner with my wife after a long day at the convent","useful":0,"cool":0},"QBDQ80LXcW-SgsRT_4nBdw":{"text":"We came to Galliano to celebrate my birthday and recent engagement. Our server's name was ","useful":0,"cool":0},"KYT3NLmG0XxMdMkcqAk0oQ":{"text":"Great gumbo. Great food. Had three Sunday pot roast and county fried filet mignon. Everyth","useful":0,"cool":0},"uo9hbgMui302vv7tyeK5bw":{"text":"Sit at the bar. Watch them shuck the oysters.\nTip them well when you see how much work it ","useful":1,"cool":0},"vqEl9gcmipmrIKYStT4bCA":{"text":"Thank You Galliano's for opening for To Go orders. We appreciate your risk. The meal, As a","useful":0,"cool":0},"VwmZxEJ-8YXVoXYSMPYAtw":{"text":"NO\n\nThat can stand for New Orleans, or it can stand for \"no, do not waste your time and mo","useful":10,"cool":2},"1J0ImqT9K6JlBxXuJduaUw":{"text":"So the chefs gumbo... Wow great local flavors, thinner than some but nursing with flavor. ","useful":0,"cool":1},"d4EQffFuYFbs0FUJbrh7xg":{"text":"Wait staff was delightful, gumbo was amazing. House special drinks were fantastic. Overall","useful":0,"cool":0},"mVFN6YAgaXTa8ddSwZdU_Q":{"text":"Was awesome place. James at the bar was awesome. Then the power went out for blocks around","useful":0,"cool":0},"qlrqA6VdBie5_5Ujo8A2gg":{"text":"I have never been so disappointed at returning to a place I'd previously enjoyed so much. ","useful":3,"cool":1},"RuUyq-LCLEZnjUl9iUwE9A":{"text":"We were very pleased with our dinner, even the kids meal tasted fabulous. The pork chop wa","useful":0,"cool":0},"1e8zj07nFdTOFrrD4xjX0Q":{"text":"Fist stop for a first time L.A. visitor. Decent experience with very friendly bartenders a","useful":0,"cool":0},"bc0-Juyve458cESSbmcV3g":{"text":"Excellent all around. Good choices on menu while not being overly priced. We came here twi","useful":0,"cool":0},"D83hR0AmHDekdQMDeFmw-w":{"text":"We had a party of seven and most of the food was excellent. However, the same can not be s","useful":0,"cool":0},"o_NgA7PIhvGw7lR4vwOBEw":{"text":"My friend and I had a very nice dinner the other night. We decided to make a meal out of a","useful":0,"cool":1},"SD0CaZFkVv9eui0iYCGA-A":{"text":"This place has amazing food and service! We shared chargrilled oysters. I had the Cajun To","useful":2,"cool":1},"x5h6sP79TL3bxiDJAphZ4g":{"text":"We had a lovely experience at Galliano! My friends and I were visiting New Orleans for the","useful":0,"cool":0},"_Fvq8HIsP0iEZLyp9cUhiA":{"text":"Wow! What a fantastic Cajun staple to have so close close to the business district/convent","useful":1,"cool":1},"MA-cxXvex_VhA1R3XnoVYQ":{"text":"I had Troydelle as my oyster shucker... AMAZING!! I had Claire as my bartender... AMAZING!","useful":0,"cool":0},"0ZyIIfIy_WN4-E6EbgEoaA":{"text":"So I come to New Orleans a lot, and I've eaten at a lot of places here. This is genuinely ","useful":1,"cool":0},"bfVEDmY4LSRWvoHWEltzkA":{"text":"For the last night in New Orleans, and I had to get my char grilled oysters on. \n\nWe order","useful":2,"cool":2},"YpZhRA50j2o6K2_Pbm0ynA":{"text":"I cannot day enough good about this restaurant. We were a party of four on Mardi Gras week","useful":0,"cool":0},"VC-RSZnlt0UGGGW4-6JvQQ":{"text":"This is a gem in the warehouse district and the convention center ecosystem. Best creole a","useful":0,"cool":0},"23RzMukO5Bx4bgaYmyZ8Aw":{"text":"I ended up here after looking at the list of open restaurants treat the Hilton provided...","useful":0,"cool":0},"FAYdNoPaNjgjxuFj6Nw0Rw":{"text":"Went here last week with a group of coworkers. We tried each appetizer and everything was ","useful":0,"cool":0},"tpIbVCVB4foAH7_q1ojg1Q":{"text":"Initially, we chose this from the reviews and proximity to our hotel. When we arrived they","useful":0,"cool":0},"AE1tuZcu4nSBT5jHUH3k9w":{"text":"We find this spot as our night ended for a night cap. The staff are all wearing mask and t","useful":0,"cool":0},"lTcG9OVPBVGga2Ih0Z9Hig":{"text":"Came here while on vacation with my husband and was not disappointed. Our food was absolut","useful":0,"cool":0},"woobMhrpA6Q_1gjdk2H4fg":{"text":"Food and drinks were excellent! Reservations were needed, but luckily there were only 2 of","useful":0,"cool":0},"AKZj39jY_oy0_YBKvK7jDg":{"text":"This place is next level amazing! For one, I had never had raw oysters before and i wasn't","useful":2,"cool":2},"CrGZdnNM9XOpCvVGLy37xQ":{"text":"I have one word for Galliano's, and that word is WOW! This place is so good! Galliano's is","useful":2,"cool":2},"VBCna2je47Fgkmf4M0ZjOw":{"text":"Loved this recommended place! Had the Pork Chop La Place and loved every bite! Could only ","useful":0,"cool":1},"U_2ZcDWKzyhL_B53kQ291g":{"text":"Excellent birthday meal. We picked this restaurant because of its strong reviews and the p","useful":1,"cool":1},"ZL0WalBdZSaQOhsqBxlEgA":{"text":"I had great food here twice in one week. The bar staff is why I came back. Very friendly a","useful":0,"cool":0},"u5s503jl5Unry9hu9cftrg":{"text":"We are frequent visitors to New Orleans and my husband selected Galliano's for our first r","useful":0,"cool":0},"T6RvjJH9VlBpLp2brMlpwg":{"text":"Wow, after a crazy time trying to get to New Orleans, we finally made it and this was the ","useful":0,"cool":0},"qCByaTh0Kw4BcnlIeX56Hw":{"text":"I use Yelp to find the best places to eat, and Yelp brought me to Galliano's. \n\nI visited ","useful":10,"cool":7},"L0kTj2WgNYTx9JPQ3j92zg":{"text":"Server was really nice and food was bomb. Atmosphere was great also. Good vibes, good food","useful":0,"cool":0},"4_dvxct6EFA_3gkfb2swrA":{"text":"A bit pricey, but totally worth it! My friend and I accidentally found this place and thou","useful":0,"cool":0},"JYZyb0KFaHQNkClc4iV8Ew":{"text":"Fresh and delicious  and happy staff serving you!\n\nThe oysters were sublime!\n\nVery good co","useful":0,"cool":0},"zDAz58Ac6TB3xVbZ-YJRAw":{"text":"Came for the convenient location and was pleasantly surprised.\n\nI was pleased that you can","useful":2,"cool":0},"qD44JJb_5RAN8Gm7zOGsUg":{"text":"Nicest bartenders I've ever had.  My girlfriend and I randomly stopped in and decided to s","useful":0,"cool":1},"Zz1KrdxYUnM4Rp3ApMaffw":{"text":"My husband and I enjoyed the warm, casual environment. We were surprised at how many peopl","useful":0,"cool":0},"3p-1i2AI1o-UB8hxSJqIlg":{"text":"Had a quick lunch here for Cajun and Creole cuisine. Had the bar-and-restaurant casual vib","useful":0,"cool":0},"41CR9aObd1u_DsDICU2jCA":{"text":"OMGEEEEE. This place is awesome! The lighting here is on point, such a great vibe. Our ser","useful":0,"cool":0},"OuvNuNwt5KB25pMy1ph_Nw":{"text":"Came in here very hungry for lunch and it hit the damn spot. Got the crawfish pasta and it","useful":1,"cool":0},"GqOgeN7DbJ581j-HNbgh7Q":{"text":"We did allot of research before we chose this restaurant and sadly it was a disappointment","useful":0,"cool":0},"8fSOMqR68kIielQ_fPIvJg":{"text":"This is a very well staffed place with a very open atmosphere.  Katrina was our server and","useful":0,"cool":0},"SfoLBS6RX1FRTlytM2CCxw":{"text":"Ooooohhhh mmmmyyyyy Gggooooooodddddd.\n\nWe had the seafood platter, sunday pot roast, and s","useful":2,"cool":1},"SDlLSsFfAeL_IsPzqOQhuw":{"text":"My food was amazing but the mice I seen several times. After I notify the waiter about the","useful":1,"cool":0},"Ca2sE9cwMHA9NsxCgJXzPQ":{"text":"This is my second time here. First time, my party was turned away because we didn't have a","useful":2,"cool":0},"Oov-2JluJORI2YUOOcsrBg":{"text":"Laden with 100's of foodie choices in NOLA I chose this establishment based up the reviews","useful":0,"cool":0},"5BzAU5p6AU9xZogHCGoNiQ":{"text":"Thoroughly mediocre. We had a 6:45pm reservation and were not seated until 7:30pm despite ","useful":2,"cool":0},"TyJdjn5Z0-B0owEKmRJWrA":{"text":"The price is a little high with the food was amazing I love the atmosphere the conversatio","useful":1,"cool":1},"59UHwObL_EnBNG16re9h4A":{"text":"Almost everyone at our table was happy with there food but I can speak for only me, I orde","useful":0,"cool":0},"6_2xoahmZTgwXNcCiiXcWg":{"text":"Great food! Really love the service and the cleanliness of the restaurant to help me feel ","useful":0,"cool":0},"ojyK5r3uQp282pLQkGRI-A":{"text":"This restaurant was absolutely terrible. Between the five of us in our party our food came","useful":0,"cool":0},"cPQ-tljPZawNHMtv_YAwAg":{"text":"One of the best steaks I have ever had!  Got the filet mignon and had the Rougaroux for th","useful":0,"cool":0},"hHVK3hXf79x9bIUxzbcA1w":{"text":"What a great place and experience. Our waitress, Amy(?), was so great. Very helpful with t","useful":0,"cool":1},"XGcHPZHeqthyJ4py0jwozg":{"text":"I was a little unimpressed by this restaurant. I ordered a shrimp salad and the onion ring","useful":1,"cool":0},"aEKL4-bAntWuTAKp1znxoQ":{"text":"THAT pork chop! Man! Our first stop as soon as we landed. The charbroiled oysters, the duc","useful":0,"cool":0},"NES6pEWcKfNMe0WYlERtwQ":{"text":"We went here on a Sunday afternoon. We were greeted politely and with enthusiasm. Cody our","useful":0,"cool":0},"jYHwCS6RfXmucXPYqcJsbw":{"text":"I'm in a relationship with Galliano's Duck Wings--and its not complicated. They're pure ma","useful":0,"cool":0},"e5KEtmyacphG7JMyN0Gr-w":{"text":"Cozy atmosphere...friendly & knowledgeable waiter. This place does not disappoint. The foo","useful":1,"cool":1},"03w6MFC7ATj0cl4ddpA7uw":{"text":"Excellent food and service. Will certainly be back again. The waiter was gracious and the ","useful":0,"cool":0},"mZtac3G-YPZe7uhRgYPfCA":{"text":"Very nice place to eat. Very casual. The drum was excellent and you cannot go without gett","useful":0,"cool":0},"RzBKjr8W4ztxvirhfPmMpA":{"text":"This was one of the best meals of my LIFE and I've eaten a lot of great meals.... I used t","useful":1,"cool":0},"fsr-Irn7urP-GmYyGBpopw":{"text":"Very disappointing. First, they only have tables for parties of 4 or more. Everyone else h","useful":0,"cool":0},"IraiwRgwTPzDUHcbd1HLyA":{"text":"I love the seafood coubion dish here. The seafood tasted so fresh and the broth was very f","useful":0,"cool":0},"WWrOvyKgMn30yp99EiJceg":{"text":"Had to finally review after 3 visits as I just wasn't sure on the first two.  Drinks were ","useful":0,"cool":0},"w5J-TlTkOAud8lo6O8gmlQ":{"text":"went here for a party of six and the place was ok little dark but ok.. drinks were nothing","useful":0,"cool":0},"OWZY2fYTFrgr9uOJTlDMDQ":{"text":"Stopped by for lunch while attending a cheer competition. The wait staff was great a very ","useful":0,"cool":0},"mr-tlaYzSNRCVg2zCHSUSg":{"text":"Food was good. Our server Victoria(Tory) was great. She went above and beyond. I would go ","useful":0,"cool":0},"HxWIbfQQmhNeEA2kZ02bfQ":{"text":"Fantastic food and atmosphere. Our table ordered the portobello, filet, and pork chop -- a","useful":1,"cool":0},"4OCv7bnoIZGWNHHfMnXUSA":{"text":"We were craving po-boy sandwiches after a week on a Carnival cruise (cruise food just gets","useful":2,"cool":0},"zaKU3XJWAzM0RayoniHwHQ":{"text":"Boo - what a disappointment! After waiting over 45 minutes to receive our lunch, our group","useful":4,"cool":1},"u0IzL4_zzdw32a5C3SQnBg":{"text":"Galliano was really good!! When I found out this was the new, casual sister restaurant of ","useful":2,"cool":2},"RBpg4GI9fS_I8ABpmn3Hgw":{"text":"This one just fell flat. Food was ok, service was slow. Definitely under par for a restaur","useful":1,"cool":0},"t2yTUZZoL-iFsAj56AV9GQ":{"text":"Went there for a dinner. It was very crowded and popular in the evening. Noise level was h","useful":0,"cool":0},"ay2KzUj7MTgA0VKTSv6X7Q":{"text":"Pretty decent restaurant close to the convention center. I got the southern fried chicken,","useful":0,"cool":1},"49oUEGc3lEIKAcz1B0Dfsw":{"text":"After 5 days of basically eating myself through New Orleans and attending a conference wit","useful":3,"cool":2},"Ec0D-QtDoU-DPjt2rZC1Jg":{"text":"We didn't have a reservation but were able to be seated right away at the bar on a Friday.","useful":6,"cool":7}}