{"WZNd7TkN4pA_gOlvmw-y0A":{"text":"Birkenstocks & Keens was how Google landed me here. The 2 sales associates greeted us imme","useful":0,"cool":0},"5LZDlxxqXd3pzURi77z5-A":{"text":"I went into this store with heel pain. They sold me arch supports which felt great. I went","useful":0,"cool":0},"MgGjBBj-DmJhBxWl-FkcUw":{"text":"I'm not one to buy shoes too often, but Blake - the main salesman at the Good Feet Store -","useful":2,"cool":0},"R4Gg7HY2ExhGsGZTw6BmcQ":{"text":"My first experience was amazing because of Blake. However, when I took my wife back to thi","useful":0,"cool":0},"aoqT3jgGTbW9TQ5m8_dHjQ":{"text":"My shoe literally disintegrated in the French Quarter. I found Good Feet online and walked","useful":0,"cool":0},"GJgdQLDaW6re-YzlOpC-8g":{"text":"I LOVE this store!  Every time I visit I discover something new that I have to buy. They'r","useful":0,"cool":0},"3qn3X0KooiWXQ-_sczHLcA":{"text":"Super helpful staff! Great customer service, and now my feet feel amazing!!! Every questio","useful":0,"cool":0},"qsY4oHgPv2qN593C5xIJAw":{"text":"Destinee Esnault was absolutely amazing and helped me pick out a shoe that went well with ","useful":0,"cool":0},"fJIR3XjH-S7EddyzbLsxPA":{"text":"Great selection. The sales clerk Desiree was friendly, professional and knowledgeable. Gre","useful":0,"cool":0},"b5aBOMynFaVBOkTKvb2FfQ":{"text":"This store is the best. I was traveling to New Orleans for the French Quarter festival and","useful":0,"cool":0},"PpBrcgKgHlqc6bZi3qU-Rg":{"text":"Great place!  Very nice selection of comfortable shoes at very reasonable prices for the Q","useful":0,"cool":0},"0GZ1SOZANXIU8MTt-xB3Aw":{"text":"Went in to inquire about inserts and Blake took great care of us. While he was helping my ","useful":0,"cool":0},"BZQZz3kK7z3_n6pl3gIdKQ":{"text":"I absolutely love this quaint little store. While it's right in the French Quarter, it som","useful":1,"cool":0},"hWFlrtbIDjOELAa_Ek0tjg":{"text":"Blake recently helped my husband discover an amazing pair of Keen hiking boots and also 3 ","useful":0,"cool":0},"Nq7uVQGY8Oat3R31q8pMxA":{"text":"We were visiting NOLA last month.  My wife stopped in to look for a pair of comfortable sa","useful":1,"cool":0},"Ms_as0rP5yN3VJBMHwUBSg":{"text":"I was desperate to find some chic looking flats. Abraham helped me out and was so nice! If","useful":0,"cool":0},"GbYhbB4SExkrLyVGq2gTqw":{"text":"Hailey was so knowledgeable about shoes and orthopedic support as well friendly and helpfu","useful":0,"cool":0},"BA4yFov8WCXSsB2f_OMEnw":{"text":"Huge kudos to Destinee for helping me out today! After getting a parking ticket earlier, I","useful":4,"cool":2},"z8ftKxwhU3FldX-pI4sqEA":{"text":"I'm a restaurant manager and spend 10-15 hours a day on my feet.  About three months ago m","useful":0,"cool":0},"ayef1Uk63cFk03ECGU2xNg":{"text":"Destiny was such a pleasure to work with and fit the best shoes! I will definitely order a","useful":0,"cool":0},"vGHzVBb8YBCLpFRXTfpRxA":{"text":"It's sad that they spend so much money on commercials to get people in the store and then ","useful":0,"cool":0},"9cdY4GJqU9XUKnH805r3Hw":{"text":"Came here on a mission to grab shoe inserts for my flat feet after experiencing pain in my","useful":1,"cool":0},"1UehMCPGJNO09L8-MsdyXw":{"text":"Super knowledgeable and helpful staff. All the stock is on the floor so you can see what i","useful":2,"cool":1},"rLXT_D1pt-rNglWI5mRXYg":{"text":"Great place! Denise was very helpful and knowledgeable. Super friendly and my feet are hap","useful":0,"cool":0},"Bw7h4-PiRRsxI4pg_9wnjg":{"text":"I had been meaning to visit this store in my hometown. I have been experiencing foot pain ","useful":1,"cool":0},"Itx2rB08Bmfjqkgk8OtD2Q":{"text":"Purchased a pair of Dankso work shoes and was not told at time of purchase returns are for","useful":0,"cool":0},"s1KyxH4vXCbBjUakWFX0Xg":{"text":"Amazing selection! Awesome one on one customer service! If you're looking for cute and sup","useful":0,"cool":0},"JiPTAnOOvRFTfJMqlI5u1A":{"text":"What an awesome store!   As a long-time runner, I've acquired a handful of foot issues. Ma","useful":1,"cool":1}}