{"2JzY2NuIS-JI9lhp_JkFXQ":{"text":"The people that work at this subway are really nice. Brenda is especially awesome. Thank y","useful":0,"cool":0},"zADL8kjFp7Gq6dq0TJHj4w":{"text":"2 stars! come on... its a subway... people know what to expect and the independent owner o","useful":2,"cool":1},"sB2aa7Tcd7bv6x2K1rNznQ":{"text":"Horrible people and establishment.  Why would you be here in New Orleans operating a busin","useful":1,"cool":3},"1KAqxBS4vvOLU7n06ERNOA":{"text":"This is closest place to home! Block away ! \nWe get foot longs and split in half ! Service","useful":0,"cool":0},"hCkTP-8l3JLq2QZ22dTZ4w":{"text":"Cheap people making sandwiches. I got a turkey breast and they barely put any meat on it o","useful":3,"cool":1},"PAgHuNW2D_Qln2Uh1mbBVg":{"text":"Ordered a sandwich on the subway app, went picked up and got to work only to see they made","useful":2,"cool":0},"2r5VYR56qYI87JPnWgJvFw":{"text":"The worst subway I've ever been to, hands down. Sunny is the creepiest guy in the world. A","useful":3,"cool":1},"dXOzLc2sM8dS2bnyidOY9A":{"text":"I walked in earlier this morning ready to order 3 sandwiches. I was the only one in there ","useful":0,"cool":0},"gKvz2ZOc5SC9dDbN16dt8A":{"text":"This has got to be the absolute worst Subway in New Orleans. The staff are extremely rude,","useful":2,"cool":1},"o8F8lXtvKiNUTUnZdoQMKg":{"text":"Buyer beware.  Will never use the app again.  Unfortunately, I did not read reviews before","useful":1,"cool":0},"ll5bFNFpO_smVF5HcORKVA":{"text":"Hrm. How to put this...?\n\nFor a Subway, this is an AWESOME location. Clean, fast, happy. T","useful":3,"cool":0},"Qh7J8dAD7dblVfi4FMQfFw":{"text":"Disappointing.  I was there for the Zulu Parade, so I did appreciate the business being op","useful":2,"cool":0},"PBUaLGyXnW-ku5l6pKqQmQ":{"text":"I'm from out of town staying in hotel across the street. Forgot COVID mask and missed trol","useful":0,"cool":0},"ouyFFVa8XHguXfbkcXh_Sg":{"text":"Rude service, too much attitude, and even if you eat there multiple times if you are passi","useful":1,"cool":0},"e9kQoyRmv8tvJy_JdJuWkA":{"text":"Very nice and friendly people. Great service and always a smile. They also remember your o","useful":0,"cool":0}}