{"KkDlMxWmAM1AXK3hVmhdjQ":{"text":"It's official. I am a Trashy Diva addict. It all started with one cute top--a friend dragg","useful":1,"cool":1},"6pGqonKU1FHAF1_tpRI71Q":{"text":"Another Nawlins Gem!\n\nThank goodness for Trashy Diva Accessories.  Finally a place where w","useful":2,"cool":1},"L0gNaitCe6b5YZcOL6ySyQ":{"text":"Great fancy lingerie. Most of it seemed bit on the pricey side just so you know.  They had","useful":1,"cool":0},"4PgrAL27j9AhOdHNQhkdpA":{"text":"I wanted to LOVE trashy diva. I really, really did. I admired their clothes from afar via ","useful":5,"cool":0},"aAUl9-5g5szHhPQ7J2nkyw":{"text":"I just looooooove to dance in ReMix shoes. I'm a lindy hopper, and it just doesn't get any","useful":1,"cool":1},"koshzxcGqFtjsX_cGjhUMw":{"text":"So a disclaimer, I have a thing for 50s-60s fashion. I'm the kind of girl who watches Mad ","useful":1,"cool":1},"xlw9PjZbjGuU63IEcGoydA":{"text":"I was wandering the FQ last weekend and happened into this shoe store since I was trying t","useful":3,"cool":1},"NWoLzsgjVxZz4rAIMSfZ2w":{"text":"Just about everything here is gorgeous. As such, if it fits you will be gorgeous in it.  I","useful":3,"cool":1},"nsKiEHpBMlUCBdK_itM31Q":{"text":"this place, the clothes, the lingerie, the people, the service, the website, all wonderful","useful":2,"cool":1},"0gLe-VdPza3jUQPQWhsZaA":{"text":"I had written a review of this store on 2/22/10 and just today, 11/23/10, Candice G. of Tr","useful":20,"cool":4},"UsNvj56TxoLuf-wU71JXJg":{"text":"I love the trashy diva, clothes and kink outfits","useful":1,"cool":1},"mChwpqs0_twaXVh3zEhGlw":{"text":"AWESOME kitschy, modern. The perfect store to find something cute and nice accessories. No","useful":1,"cool":2},"iU8nNBF95ZPGoVvA59BOPA":{"text":"I love this store! As a local, this is a regular stop in my week because: \n\n- The shoes ar","useful":4,"cool":2},"mhIPcJEpR37Fx0Qjt3wllA":{"text":"I walked into this boutique (when it was only a single boutique) three years ago during a ","useful":1,"cool":2},"N4yukltuLSqnNosmVtYLQw":{"text":"Love this shoe store!  \n\nIf you are a funky dresser with a lot of sass like me, then this ","useful":3,"cool":1},"p2fU4iiJhG_obK40zxo0jQ":{"text":"To my delight, I recently discovered that my favorite New Orleans store has expanded to th","useful":1,"cool":0},"uxuVd29CavF5gYxpVCs27A":{"text":"Unique vintage and perfect.  I will never go to NOLA again without a stop into Trashy Diva","useful":0,"cool":0},"DH6dkE1VXxBIeACt8cw3Kw":{"text":"Whenever I'm in New Orleans, I make it a point to visit Trashy Diva.  Usually a few times ","useful":0,"cool":0},"nPdhA-WpM2Bz3pCrWaVrzA":{"text":"I LOVE Trashy Diva. I bought my wedding dress from their online store and I was beyond ple","useful":0,"cool":0},"O2Dgj89JinXCAZKKCBtSqg":{"text":"Love Trashy Diva!  I must have shied away because the name totally turns me off but now th","useful":3,"cool":3},"covBbCzK7aL2G0n5ZnkExQ":{"text":"Trashy Diva has to locations on Chartres, right next to each other.  One carries lingerie ","useful":1,"cool":1},"Z-OyQ2sfI1CXxTAOvXbedg":{"text":"I love this shoe store. They have a great selection of sexy retro-style shoes. I've been h","useful":0,"cool":0},"O_tUebU5Gvfg-KpidlmP-w":{"text":"Wonderful!\nThe selection of bras, undies, negligees, etc just can't be beat.\nIt doesn't ma","useful":1,"cool":0},"dt3pZnBYdidixPDyWGcYrA":{"text":"My first trip to New Orleans was for work-related reasons concerning the Essence Music Fes","useful":2,"cool":2},"qLBI2UCYGezY3_2mK2Y34g":{"text":"Oh my lord, what wonderful clothes in this shop!! The clothes are cut from vintage pattern","useful":1,"cool":0},"2FgnfEvjhe-n8rsMH3QMhA":{"text":"I normally hate shopping.  Not so with vintage-style dresses.  If Trashy Diva were a perso","useful":2,"cool":3},"dU_sJIcx73r1wITf0mh9vg":{"text":"The 5 stars are for the clothes alone, the staff aren't anywhere near as nice as the cloth","useful":0,"cool":0},"QtWAfx3EUSBpJFeYucMwQA":{"text":"finally made it into trashy diva, perfectly named I might add. The staff\nare so uppity it ","useful":18,"cool":2},"qgSvveB1hp2t09g4B5ZTRw":{"text":"I'm in love with this place. Vintage style dresses in amazing, limited patterns so you're ","useful":1,"cool":2},"YClIJM6k2Xv2e_VJ2IqzhA":{"text":"ALL THE CUTE THINGS!!\n\nFor real. And some of them are even decently priced! I got the cute","useful":1,"cool":1},"cjSp3f2C187gmb5jT8KeIQ":{"text":"First, let me say that I am absolutely in love with the style of T.D.'s clothes- they are ","useful":8,"cool":1},"qSOZNf2XIz5dmLA3zWXGPw":{"text":"The thing that drew me to Trashy Diva were the great dresses in the window.  HAD to get an","useful":3,"cool":4},"jrXFWTdVfpbXjV0ZUDCT5Q":{"text":"i've been wanting a corset for a while so i went to trashy diva this weekend to check out ","useful":0,"cool":0},"HtFWoai9yKuqMkVemOwy9A":{"text":"If you like well made funky shoes, this is the place for you!\n\nI saw perhaps 10 different ","useful":1,"cool":1},"yOcQCxIV_3Mck5nGPRPxkg":{"text":"Can I just tell you how much I LOVE this store? I call it the triple threat: three storefr","useful":4,"cool":2},"5pWyvP8lTXEW81ObKe-5ZA":{"text":"When traveling you're always looking for the perfect place to shop so that you end up with","useful":1,"cool":1},"uXeb-1UWD53glqZwk_dGJg":{"text":"I bought a Betsey Johnson bra here that feels amazing on and makes my breasts look, well..","useful":2,"cool":0},"W658EcUcX4NNktC1tGNgGg":{"text":"Read to end, their policy has changed...I have a real love hate relationship with this lin","useful":6,"cool":2},"L4PWyjQkmpeKCSCgm_rnTw":{"text":"Trashy Diva is a very cute store. The vintage concept is very cute. There is a small clien","useful":1,"cool":0},"UVk9u9S4sHqSl_da4gmhUA":{"text":"Fantastic clothes fit for girls with curves. Super flattering cuts with a vintage feel, as","useful":1,"cool":1},"xYKjOGL33QWwdN_kpBHfng":{"text":"My first time in here during French Quarter Festival, I almost screamed. These shoes fit m","useful":1,"cool":0},"uPK6SGzEgfq4-1LeTKPC0w":{"text":"I'd been lusting after a Trashy Diva dress for a few years but didn't want to go through t","useful":0,"cool":0},"4LTgQLivQnSmICqmbPRmZg":{"text":"Eight girlfriends and I for a friend's bachelorette weekend walked into Trashy Diva lookin","useful":10,"cool":1},"i8VPLa1gfpgGkhYySTt0Hg":{"text":"Yes! Yes! Yes! Great finds in ALL their stores! BUT... I agree with many here about the se","useful":1,"cool":0},"cy4SRBC5T4FYrCEsVQ-JdA":{"text":"After reading all the reviews on Yelp, I had to check this place out. I went here in early","useful":0,"cool":0},"aa14z3t5-6ruj5ch5axm_w":{"text":"Popped in with some friends on the 4th of July. Rachel was working and (as always) was a t","useful":1,"cool":2},"SWEU1TGIbaC3VAzMpt_ooA":{"text":"The dress shop is quite nice and the lingerie is lovely but...\n\n(1) They do not do lingeri","useful":0,"cool":0},"2IXDvVeehzI4DPYsyiXBCw":{"text":"This place is great!! This was the first time I've visited this store, and Candice Gwinn i","useful":0,"cool":0},"QcceZN409ldhoGgxUdXMRA":{"text":"Have tits?  Sick of having to go several sizes up just to fit the ladies?  Look no further","useful":3,"cool":2},"w4FrhgOOh3yJ7AWhta-L-g":{"text":"With this name, I *had* to go into the store. They have a wonderful and unique selection o","useful":0,"cool":0},"XeUa4SOBTtbS8S5d7ZGYHg":{"text":"The lingerie shop is nice, but the boutique is stuffed with overpriced, badly-fitting clot","useful":8,"cool":1},"RvtEBtatMz1NpJHmXyo2ag":{"text":"Haven't been back here in a while, but I do remember that (1) I adored almost everything i","useful":0,"cool":0},"nOV7s_15TaEgmdn1JRXpCw":{"text":"Very impressed with the clothing.  There is a vintage feel, but with no sweat stains becau","useful":0,"cool":0},"4ip4FuKPB55EqE78XIG8zQ":{"text":"How do I say this delicately? \nI have big boobs. It's not an easy feat to find bra's that ","useful":4,"cool":2},"R_EGYrIZesNfdszPR2XUuw":{"text":"I'd say a large part of my credit card debt is due to this place.. but I have no regrets! ","useful":0,"cool":1},"H2CbLRtP3bJmRZMcZUP9KQ":{"text":"This is one of my favorite dress designers. My three most absolute favorite dresses are by","useful":0,"cool":0},"0vBdXD8TqrgxQe5ZewtOrQ":{"text":"While I haven't been to this store since last November, I'm reminded to write a review bec","useful":21,"cool":19},"NtLs4izwqeA8GPZFbdlQZQ":{"text":"Here's my story:\n\nMy boyfriend decided to surprise me by shopping the lingerie store while","useful":3,"cool":1},"rZh2fAgwSZYkswCGye6ZDA":{"text":"Okay, so walking up and down Chartres Street, my friends and I walked into 3 different sto","useful":0,"cool":1},"XMw3WCIOHS_FVCE0QkHlsQ":{"text":"I was recently in New Orleans for Jazz Fest and came across Trashy Diva after reading revi","useful":4,"cool":5},"vYqdkJ3x7nrMQf0gwXW2JQ":{"text":"If you're into vintage but don't like that moth ball smell like me - head on out to this h","useful":1,"cool":1},"aWqFPlJt1-BD1Y4FUjjAiA":{"text":"The best place to fulfill my Joan Halloway and Bettie Page clothing needs!  Trashy Diva is","useful":3,"cool":2},"j5sxDsninXV30fwFJIaa6w":{"text":"I unabashedly admit to being a clothes horse (shall we say pony instead? \"Pony\" seems perh","useful":2,"cool":1},"gNKW1RfkGmb8wdNEaDnutQ":{"text":"I love trashy diva, especially the lingerie shop. Lots of the best lingerie brands you can","useful":0,"cool":0},"koFsgmNWteXmKYJYo_LJmQ":{"text":"EVERYTHING I'VE EVER WANTED. Yes, all caps is necessary. All my life I've wanted to wear c","useful":7,"cool":3},"3c2VAWkS1CO07t3IPeulLQ":{"text":"We passed this place while on our French Quarter Free Tours on Foot walking tour, and deci","useful":2,"cool":2}}