{"4BLtIXdAEPoamSgWCOfwtw":{"text":"Great food, seasoned well and food is always consistent! One of the best chinese food spot","useful":0,"cool":0},"726VZxy4EShV0uRsVXYWrQ":{"text":"Yummmmmm! I've been searching all over for a good Chinese take out place and this is it! T","useful":2,"cool":1},"o1Y6KoA6FeGpUZtqiNYGig":{"text":"I'm a personal cheerleader for Hunan Wok. The crab rangoon; Amazing, The Singapore noodles","useful":0,"cool":0},"KeMHNV0FqTjuVQ4A0OPXhg":{"text":"I ordered the shrimp with garlic sauce and shrimp fried rice, off the lunch menu, and it w","useful":0,"cool":0},"gqPJ6LVoROoDBqTiL8mduA":{"text":"Alright, my tastes and experience with Chinese food comes from my life in Chicago. Persona","useful":2,"cool":1},"IW3RnYdXGUTIS4TPyhGigA":{"text":"Don't let the facade fool you -- this place is incredibly good.  The general tso's bean cu","useful":1,"cool":0},"SuBHFQJakwWbkjmuqhqjog":{"text":"I have ordered General Tsao's Tofu from many restaurants in Nola. I have never been more p","useful":0,"cool":0},"r66IaH3OCjDiMf3ZTw1KeQ":{"text":"REALLY good stuff. I've sampled all of my staples from this place and it's all good. The r","useful":7,"cool":6},"k9Wt6i1ml8rMe-8uYUgJGA":{"text":"As a vegetarian it's hard to find good food in a place you're not familiar with, but I stu","useful":1,"cool":0},"TVh1WXzJK1EplB2zpzZ1Gw":{"text":"So fast, good vegetarian options and fried foods that aren't *too* greasy. We'll definitel","useful":0,"cool":0},"KveT7_ZTmeQqGPhrtYsvGA":{"text":"I needed quick Chinese food and they we're great. My order was ready in less than 15 minut","useful":1,"cool":0},"CZUTDPgf46HhMfQXMxxnJg":{"text":"This was my first time visiting but it was theee best tofu I have ever had!!! I had the ge","useful":0,"cool":0},"_rcWhe-I1TX2SB74-nvZDw":{"text":"Best Chinese take-out I've ever had. I order from Hunan Wok more than I'd like to admit.","useful":1,"cool":0},"k_wD2KJ7mTscpEg3xvbw2A":{"text":"Imagine this, you ask for Togo silverware when you place your order for delivery, they say","useful":1,"cool":0},"3KrQA_KOWsotHvuDDLcGCg":{"text":"The food is AWESOME. The prices are very reasonable. The portion size of each meal is enou","useful":3,"cool":1},"Z2G8H1aFuRwc0erwQ1EsNw":{"text":"Pretty good, cheap and large portions. Better than any Chinese places I've been here so fa","useful":1,"cool":1},"C-_hMPJphDBxCw8Tybs-pQ":{"text":"Really? You have a $30 minimum for delivery!?!? BULL CRAP! YOUR MENU SAYS $15!! You just l","useful":0,"cool":0},"n4dmS4X3aefCZhD2I0yr3Q":{"text":"I am a visitor from San Antonio Texas, I've heard and saw good reviews! Let's just say I h","useful":0,"cool":0},"Lr9I8XySG4a3HcA88qYIsg":{"text":"The chicken was chewy, the veggies weren't fresh, and they spice their hot & sour soup wit","useful":0,"cool":0},"-6Z7Res-EIh6aJTeOxRfBg":{"text":"Pretty average cheap Chinese takeout. Got the kungpao chicken which had more veges than ch","useful":0,"cool":0},"Lyz5q6wWcUhxLaqrBkosMw":{"text":"I like to think that I am on a constant quest to see how much Chinese food the human body ","useful":7,"cool":3},"SZGypqsmV6wtipfAhyxNnA":{"text":"The menu is usual American- chinese menu and the food was at its best.  Quick service and ","useful":0,"cool":0},"WIFMS11KmLBbVbbf207wEg":{"text":"The other day my fiend and I went there to eat and sat in the restaurant and ate. Later a ","useful":0,"cool":0},"D-iRDbs4sumQ5XBrscyrRg":{"text":"As per usual most Chinese restaurants are cheap and use cheap beef.. this is definitely a ","useful":0,"cool":0},"iAoQAcZO9BMKXxdaRGGzdQ":{"text":"Man, this is some solid Chinese food in the 7th ward. Nothing ultra special about the plac","useful":0,"cool":0},"y2isTrYVryZuX4x7QtyNkw":{"text":"We arrived in town on vacation Sunday night. Tired and decided to order take out. This pla","useful":0,"cool":0},"YXK07tiFdfihCBSHRb-9Ag":{"text":"Thoroughly enjoyed everything and we had a few things. We aren't from this area so just to","useful":0,"cool":0},"vMgYsOjrMy5qT99RYnttqw":{"text":"Look let's be real here, this place is what you're looking for. I'm not going to nitpick t","useful":2,"cool":0},"G66E6_BmW55gfAVzHcfn8Q":{"text":"4 stars or 5 stars, let's start there... it all depends on the goodbye. The food in terms ","useful":0,"cool":0},"wWmRDs_2fHexcvcWWk6lxw":{"text":"Our 1st time eating here and as soon as we walked in to pick up our takeout we knew we'd b","useful":1,"cool":1},"D14nksatp271lckn2LGDjg":{"text":"Best take out Chinese in New Orleans.   I had the shrimp sweet and sour and it was perfect","useful":1,"cool":1},"pAa_sV3kb40d2zpb40o52w":{"text":"Although Yelp shows them to deliver, that is not the case. Delivery was not offered. Also,","useful":0,"cool":0},"dL20YStd2hLMuFFMTgm5qg":{"text":"Ummmm this is the spot in New Orleans for your quick take out Americanized Chinese food. H","useful":0,"cool":0},"CEbURzJMsyBnzY9YcnMgcg":{"text":"Since moving to New Orleans, I've been searching for a solid Chinese take-out spot. I am h","useful":4,"cool":2},"O1QxOFeLZ_FHOJz09LO-Kg":{"text":"Good food. Gotta order through a window nowadays due to COVID. The shrimp fried rice is wo","useful":1,"cool":0},"L6Z2S1Ra37JGdMBmf6YjAw":{"text":"Food is good and price is right. Quantity is generous. My only complaint is that some of t","useful":1,"cool":0},"tLNzAbGOmL0h7Nw3QUO7Ig":{"text":"Just a word of warning, they have vegetarian \"chicken\" \"beef\" and \"shrimp\" listed on their","useful":0,"cool":0},"Z2eXpvMLyyRada6phniaXA":{"text":"Never again.\nOrdered MooShu Pork with extra \"pancakes' for pick up.\nWhen I am told the cos","useful":0,"cool":0},"oJiunfoRdG0DpbQ_015KyQ":{"text":"I love this place! I always get the sweet & sour shrimp or chicken. Or either the shrimp w","useful":0,"cool":0},"-kOPCcjCvSNNYrFjI3x7Ug":{"text":"We've been looking for a replacement takeout Chinese food since our favorite hole in the w","useful":1,"cool":0},"w_HGAJGn7dYYIWl2NLwLFg":{"text":"This is my favorite Chinese Place I always get the classic Boneless chicken which is delic","useful":0,"cool":0},"juMiMVYNwF3MUkeUoqQ3qQ":{"text":"I got the chicken lo mein and curry chicken from this restaurant. They were both delicious","useful":1,"cool":1},"9UAa41CDuHB3IOc7WUVz3w":{"text":"This is a great place for your Americanized version of Chinese food. I've been countless t","useful":0,"cool":0},"jnnN1pZgtrcy1SpnNJlTxA":{"text":"OMG they have the best chinese in the city so far!!! Their sweet tea is to die for and so ","useful":0,"cool":0},"yAopMfWkqirrvUEWg3MrAQ":{"text":"Egg roll was far below my expectations. Tasted like it had been fried days earlier and hea","useful":0,"cool":0},"yBIx3GnDMp7D5Zg7mnmb5A":{"text":"I was craving Asian food literally of any kind and I was scrolling through Yelp and stumbl","useful":1,"cool":2},"KhRAveFiIgA6puROhAgN7w":{"text":"How in the world does this place get 4.5 stars? For years I've passed by this restaurant a","useful":3,"cool":3},"Xgn1nwEQxJPhtvHqeF_71g":{"text":"My boyfriend and I are HUGE lovers of Chinese takeout. We eat Chinese once a week at minim","useful":1,"cool":1},"7kdatkyY61oleinN6EFnNw":{"text":"BROOOOO\nThis is the spot. Look no further. We had delivery, so I have no knowledge on the ","useful":2,"cool":2},"2mJmO39rw2KvHBiqlLPVYA":{"text":"Always friendly and fresh... So glad to have them on St. Bernard Ave. on my way home from ","useful":0,"cool":0},"0yuNgLNCHG817T32vT_nzQ":{"text":"Such nice folks and make brown rice for me...really yummy","useful":0,"cool":0}}