{"2ohUj_MV7nlhL2PyJdGziA":{"text":"Amazing coffee! \nThe ginger latte is delightful, but now that pumpkin spice is available I","useful":0,"cool":0},"7nqrJgeKVc5tbVGNLvbB_Q":{"text":"I love St Roch Market! The Coast Roast is high end coffee. I decided to try the summer spe","useful":0,"cool":0},"ES96jpoII18vPEnqmWnReA":{"text":"This is, hands down, the best iced coffee I have ever had. My boyfriend and I live in NY, ","useful":1,"cool":1},"SNcFFwh4GtRAdisxAIOrfA":{"text":"My new favorite coffee spot. The frozen coffee is the best I have ever had. Actually taste","useful":0,"cool":0},"2DMloaC8h4LQNOVMF0D8vg":{"text":"I was debating 4 or 5 stars, but lemme tell you about the 5th.  It's a unique chai that wa","useful":2,"cool":0},"Z92AmEsyHrj3POhJVNLokA":{"text":"Got a vanilla cold brew and it was amazing! Seriously one of the best iced coffee I have e","useful":0,"cool":0},"nOFooEYJsQkg05P1skM_Qw":{"text":"The shiz. Period. Spitfire if you're in the quarter but Coast Roast if you're over here. T","useful":0,"cool":1},"YhlIm8EQGvuRE58RVDbXYA":{"text":"If you ever end up at the market and your wanting to get coffee or tea coast roast is the ","useful":2,"cool":1},"UBZ-M2XDF8WT0apJEhhTfA":{"text":"I wish I cant take coffee place and bring it back to chicago! Being your cliché Starbucks ","useful":0,"cool":0},"xP40-pGFTKytrimYz8t0oQ":{"text":"This place is the real deal of coffee!\n\nI ordered the vanilla sweet cream cold brew (size ","useful":0,"cool":0},"-1kMAjjNbpNgl9NH5sWlwg":{"text":"Probably the best pumpkin spiced iced coffee I've had. Everyone in the market looks at you","useful":0,"cool":0},"8eEQmKW6ipsVL-wBu9okhg":{"text":"Holy sh!t snacks....the vanilla cream cold brew is the most delicious coffee drink I've ev","useful":2,"cool":1},"_tD8koWMOzQPTPLSadJg1g":{"text":"Got to st roch market so early, only 3 venders there. One luckily being coffee roast! Grea","useful":0,"cool":0},"Nt3vUbjdXqdHt2ooDf7aoQ":{"text":"I've been here five times and not once did I complain!  I always get the same thing, Espre","useful":0,"cool":0},"oEfLpv5j6c534hfBMgzLWg":{"text":"Joi's review of the iced coffee here was part of my motivation in getting myself over to S","useful":13,"cool":6},"PYDx94QX4P-4G_Tc9OcMbQ":{"text":"Coast is a cute coffee counter within the market. They had a special when I visited that t","useful":1,"cool":2},"CH_jSTUUm8AL4uBKz91vBA":{"text":"Favorite coffee shop around! So glad to have a coffee shop in Gulfport that knows what's u","useful":1,"cool":1},"DOusU11Y6GD4uF2deF_RcQ":{"text":"Fantastic coffee and friendly service in my favorite city?\n\n Sign me up.\n\nCoast Roast has ","useful":0,"cool":0},"iO9Pqj-yfZceaIZOCmZuNg":{"text":"Pretty good coffee. I got the iced mocha and it was a little more bitter than most mochas ","useful":0,"cool":0},"vk5KRRzYmEbsCW39ZybBhw":{"text":"The coffee is excellent!  The morning guy Bob is quiet but very customer friendly!  The wo","useful":0,"cool":0},"ct3C37jnA8PNhp1GZpbICA":{"text":"Good price and good coffee. I had the ginger latte. I chugged it like it was water it was ","useful":0,"cool":0},"tw8IQSG6rkcIyx5RllvUeA":{"text":"Iced. Coffee. Obsession. \n\nCoast Roast at the St. Roch Market has the best iced coffee I h","useful":16,"cool":11},"VfSwS37KGiL3RNFNeDkvDA":{"text":"We had a cafe au lait here - a little pep-me-up before going out. I found it to be good an","useful":0,"cool":0},"HoHjGJLFIgb9YwvR9RMrGw":{"text":"Former long time third-wave barista here. Stopped in NOLA during a road trip. Caught some ","useful":1,"cool":1},"T-zGsApHaoYMXmDImsHQEg":{"text":"Just stopped in for a much needed coffee. It's located inside St. Roch Market. Coffee was ","useful":0,"cool":0},"6ps_ffB6fasukd-tkTIPMg":{"text":"My friend and I stopped for lattes here after eating lunch from another vendor in the food","useful":4,"cool":0},"klodHOHDznrNsADcPnotvw":{"text":"Came here on a Tuesday morning in early October, and the barista was terrible. She did not","useful":0,"cool":0},"1Wq2UVmmnIDnCw6GmINxqA":{"text":"Very good, quick service and a friendly staff. The cold brew was smooth and not bitter. Th","useful":0,"cool":0},"YJKOLMCQh7yKNPtT1k0WiA":{"text":"The espresso I ordered for-here was given to me in a 12 oz to-go cup and the espresso itse","useful":0,"cool":0},"TAW19-PJmdWhUIHFyRwxAA":{"text":"This is one of the best coffee in NOLA. I've ordered vanilla soy latte and the taste was b","useful":0,"cool":0},"lNEICzhmQMcZZjL6kTWxcg":{"text":"Coast Roast Coffee is situated within the St. Roch Market and hot-damn their coffee is del","useful":11,"cool":9},"NAvzPd4W-YjJC8JFAxcveA":{"text":"It's a cute little coffee shop set up inside St. Roch Market. I like that they offer diffe","useful":0,"cool":1},"2TGTjbEweI-P8QsHGxprTw":{"text":"I love this place!\n\nThey have a little bit of we yet hunt and this coffee spot is a perfec","useful":4,"cool":5},"pB-CchZyx2OqEWWhkXs6Dg":{"text":"BEST MACHIATO IN TOWN\nIt's smooth, velvety, a bit frothy stoked with dark chocolate richne","useful":5,"cool":2},"VZofldVZXlj5nr-cQgjWgA":{"text":"This location is inside St Roch Market food hall. The coffee is really good... it's not my","useful":1,"cool":1},"6khgZAVEDwBaSUTZJq7xvQ":{"text":"I expected what looks like small, boutique coffee house to brew coffee better than Starbuc","useful":0,"cool":0},"8Gv6O1azUN-gvvQxW1z3-Q":{"text":"Used to love this spot, but this morning, the female barista sneezed into her gloved hands","useful":0,"cool":0},"k8IYQWmmvLoROZEBL2Srvg":{"text":"The coffee is excellent!  The morning guy is quiet but very customer friendly!  The woman ","useful":1,"cool":0},"F8OdazHFkpCDWH0TMFoP1w":{"text":"I notice left to right at st Roch, every other person had coast roast ready in hand and th","useful":2,"cool":2},"-_zgBg-B91ldIWTofCzGwg":{"text":"Their coffee is really quite good but I'd like to see one or two more syrup flavors. I got","useful":15,"cool":11},"cFZeucdBJFEh21fLnMUW1Q":{"text":"\"meh\" is a good descriptor when speaking about the DECAF purchased  to get change for the ","useful":1,"cool":0},"N0t3inluyPqVYaDl2foe9Q":{"text":"The breadwinner (or maybe brew-winner, idk if I'm feeling it) for best cold brew coffee I ","useful":26,"cool":25}}