{"SIMrSEHYPNC-uTd11Itf-Q":{"text":"Just what we were looking for.  A neighborhood bar with better than average bar food.  The","useful":1,"cool":0},"9Ri31GbQem-4fMEhYXzBXg":{"text":"Good chill spot to grab a drink and a bite after nearby restaurants have closed. Kind of a","useful":0,"cool":1},"o1tHSzkxWHlyKc5bwKlOKg":{"text":"The Whitman Roast Beef is a solid sandwich bc it includes fried oysters tenderloin tips, a","useful":1,"cool":0},"xIZyHBXofiX5xdeC3nUnDw":{"text":"The Whitman sandwich was delicious. The fried oysters come on the side but I put them insi","useful":0,"cool":0},"zOZysdTwR7W3bv-buaCXrQ":{"text":"Been to NOLA a bunch of times, but just stumbled upon this little Whitman-loving spot this","useful":1,"cool":0},"GFHqM8hX1M__OIRx4r-E5g":{"text":"Wonderful quaint bar with cool clients and an incredibly charming staff. Chefon made me fe","useful":0,"cool":0},"DEoSJ-q6zEVZOxjyjIyaEQ":{"text":"We stopped by for dinner, the food was great and the service excellent. The Whitman roast ","useful":0,"cool":0},"P9gFY-7hhY02qa1P7PLZHQ":{"text":"Cleanest bathroom in the quarter, felt like a laboratory. Best bloody Mary's ever. You got","useful":1,"cool":0},"jQ_0tdY7upV7OgTHa1KSDw":{"text":"We traveled from sunny Dunedin Florida to find the perfect dive bar. After arriving in New","useful":1,"cool":2},"vPo4hEpxLxfkPau7hUvdEw":{"text":"Nice local beer selection. Rotating NoLa Brewery tap. \"Craft\" cocktails average on the ine","useful":2,"cool":2},"GV3tiTy5uUVsVdkn1uD1mA":{"text":"Great little spot off the beaten path. Very laid back atmosphere. Since it was our first n","useful":2,"cool":1},"Dno5LPXF5PS9_9BTKbJCaw":{"text":"Cozy place on charter street.\nMy burger was phenomenal!,  I went with a group of 6 and eve","useful":1,"cool":0},"DcHPFI5wut0WdoGGCrgpwg":{"text":"Kuddos to Chef Liz...her spicy creole mustard on the fried oyster roast beef sandwich was ","useful":0,"cool":0},"wLTBvk-pJn5xEwZ_hAzK8w":{"text":"Impressive food and drinks from what outwardly appears to be just another french quarter b","useful":1,"cool":0},"qCfax4uuqMj5RxKze1twxQ":{"text":"This is a quaint little bar just down from Bourbon Street. Just far enough from the ruckus","useful":0,"cool":0},"H4I7HCRPMDZxVNB7J45dnw":{"text":"I would recommend the Backspace burger, without a doubt one of the best burgers ever! An i","useful":1,"cool":1},"lA-kuaPwEIJFOXCJoHbJSw":{"text":"Loved this place.  The bartender was extra helpful and polite.  The atmosphere was laid ba","useful":0,"cool":0},"Jvr9l1gCwmjJxUOs8_gOTA":{"text":"I love this place. One of the simplest and most well thought out and refined bar food menu","useful":1,"cool":0},"oDvXq_ysOvjkoiJiCgqz_Q":{"text":"This is such an awesome find. Their burgers are kick ass, their drinks are on point and th","useful":0,"cool":0},"eznZkC0df7PaFUQJsZE47w":{"text":"I would say 2.5 stars but I'm being nice. I love this place & want it to succeed. It id ve","useful":2,"cool":1},"iBYHTJikipl8nNqMw0Hpwg":{"text":"I've been working week long Conferences in New Orleans for five years, and I'm no stranger","useful":10,"cool":6},"lL-v_YvIhK9ePeu2QM9S3w":{"text":"The food and drinks were top notch. I ordered the backspace burger, my husband ordered the","useful":0,"cool":0},"os3c7aqjEg4q3YG1MUtHdQ":{"text":"My boyfriend and I went to this bar after leaving a show at House of Blues. It was a short","useful":0,"cool":0},"AuvbpN3BC1JUD3oGKXg77w":{"text":"Great little bar and restaurant. The bartender was beyond great, he was Superb. An artist.","useful":0,"cool":0},"ghHgFlndCYrNj_CZ_FYJZg":{"text":"Chill bar, perfect for a quiet Monday night. Sidecar was great and chips with salt and pep","useful":1,"cool":0},"w9OI7V3jS-5OHb_IwbxBvw":{"text":"Backspace Bar is a solid bar with some good food options.  It is a nice quiet vibe which i","useful":0,"cool":0},"ut1fE6SNGLLzFNmgb7qJFQ":{"text":"Soooo we stumbled across this spot due to a recommendation by a local at a strip club. It'","useful":0,"cool":0},"H19Cl9uJHf2jFsCcKkRkBg":{"text":"This bar is my favorite one we went to in NOLA.  The food was good, the atmosphere is phen","useful":0,"cool":0},"d-L5a-sUmqesKzcQlLgXGw":{"text":"Backspace really is an oasis in the Quarter and all its mediocre (at best) food and drink ","useful":0,"cool":0},"_XJQP7LHQ4AztqPrI8sfGQ":{"text":"Super chill local joint with excellent bar/casual food, a cool cocktail menu, and great ba","useful":0,"cool":0},"jie3z12QctXcNR_w3AAB5Q":{"text":"Nice little bar with good food. The bartenders are friendly and the atmosphere is great.","useful":0,"cool":0},"Rg4eBL6LF7k6-qXfjBSUFQ":{"text":"Tasty food, a bit local a bit gastro. Great drinks and wonderful service from a lovely lad","useful":0,"cool":0},"0HdT7otMmf_mcQLynfs24A":{"text":"Beyond impressed our first trip to new Orleans and i must say i am a hardcore critic of fo","useful":0,"cool":0},"682AstxWEMoQ-0acafrqFQ":{"text":"Tasty food and super friendly service! Stop here if u r looking for a cozy spot to chill!","useful":0,"cool":0},"ywhshqNcATtEk5bTXVpuiQ":{"text":"Oh yum.  I like the ambiance in here.  I had a couple Abitas and the roast beef, which was","useful":1,"cool":2},"ewKnG9LAj3bKIgsRqPyohA":{"text":"Backspace came to our rescue when we landed late into New Orleans after our flight from Ch","useful":0,"cool":0},"1nu1fymD7VDY0QBx-LAOaw":{"text":"Great Vesper Martini, okay gumbo, kinda cool atmosphere. I probably won't go back but it w","useful":0,"cool":0},"rNFuM60pN8a4p8RE0MSadg":{"text":"Loved it! Great little bar where the locals hang out. Very friendly bartender named Sarah,","useful":0,"cool":0},"sZOUdNk7hIKk_TkKXSaufg":{"text":"Vinnie is the best!!! By far the best bar in New Orleans!! Fast service and great burgers.","useful":0,"cool":1},"Pz0L3-Oo9tliMjw-YmehgQ":{"text":"What a great little bar! Our bartender Sarah was very attentive. My beer was never empty! ","useful":1,"cool":0},"fTZ8t4AtdnslOCQ54msi7w":{"text":"Someone who reads my reviews may be sensing a theme: dive bars. And yeah, I like paying a ","useful":0,"cool":0},"1_rA7pvOrRSSMUxtD6CjDQ":{"text":"Nice for the laid back approach. Burger was delicious. The service was not so great. The m","useful":0,"cool":0},"9wEhM3DJCJ1YID7tF7Fj5Q":{"text":"Casual mellow bar with good drinks and an even music (Indie rock persuasion).  On the reco","useful":0,"cool":0},"6z_f9T4hJVxDpDQH_wL4Kw":{"text":"Very cool neighborhood bar. Just stopped in for drinks, the bartender was very friendly an","useful":0,"cool":0},"t08bEXSwbyWuEeWscl6-2w":{"text":"K was telling me about the grilled cheese here being good, but I'm a bigger fan of the BLT","useful":4,"cool":4},"sACSXtnRiZJkT6oXizmFHg":{"text":"This place is really great - they have amazing prices, great drinks and the best burger ev","useful":0,"cool":0},"vYZyDsS4c5vdG02Xuo8kAQ":{"text":"I heard a lot of good things from fellow yelpers so I thought when visiting the French Qua","useful":1,"cool":1},"L0unAmqkfQkENwO-YjeUaw":{"text":"Came here for some late night eats. My boyfriend ordered the adult grilled cheese. We all ","useful":1,"cool":0},"UBSMSphSUuhiQKmYjcihXA":{"text":"Place has a great vibe, with a competent bartender it'd probably be great.  Female bartend","useful":0,"cool":0},"65BgB-4bQ4wiolKf8HvPbA":{"text":"Was welcomed by a friendly bartender that made excellent suggestions. Thoroughly enjoyed m","useful":0,"cool":0},"dkzsIWn94mD5SVwcRaoqfQ":{"text":"I'm having a chill evening with the most warm and welcoming bartender, Lydia. I was sent o","useful":0,"cool":0},"SAy-rRiCxt5LrlnRTinJQg":{"text":"This is a real cool little bar, in the land of a million bars.  This one is worth a stop i","useful":0,"cool":0},"g6I5-AK0QMvz0cxoLObfpQ":{"text":"I came here over Thanksgiving weekend.    If you wanna get off the beaten path swing by an","useful":0,"cool":1},"YgDj5w_9lmJv2zTCY5pq5Q":{"text":"Cozy. Open. Has character. Cool red leather couches. Dark wooden beams. Everything afforda","useful":0,"cool":0},"4fe_xHSCnaSxZHJDvCf5qg":{"text":"This was a decent burger cooked correctly to medium rare but only including chips as a sid","useful":1,"cool":0},"XO9_DiRBWMQTN_-SxSo77g":{"text":"The lady bartender working Saturday night was efficient, friendly and wonderful! The fanta","useful":0,"cool":0},"zBu-HdIE0h4NsFEviiYdIQ":{"text":"I keep returning here because Lydia and Laura are THE best bartenders.  Always a friendly ","useful":1,"cool":0},"iTSaoXCCBZIvEPWgzBcIzw":{"text":"I got to new Orleans late, had no idea where to go.  Backspace was the first bar I stopped","useful":0,"cool":0},"xjtClDifx9spGL55DJgX8A":{"text":"Seriously slow service.  So bad that I  walked out.  I walked in and sat at a bar 50% full","useful":1,"cool":0},"EwrGq5hgUmzEphv2Bv30bQ":{"text":"I love this place so much. Me and my girlfriend grab something to eat there at least 3 tim","useful":1,"cool":0},"hg_Ze1adw64yvccKAnNlZA":{"text":"Very cool place! Friendly bar service and good prices. Tried a Moscow Mule for the first t","useful":0,"cool":0},"6Q29sjObbvY0pr_k6y32YA":{"text":"THE BUGER IS FOR REAL! vibe is great, straight New Orleans. It's real people. I'm eating m","useful":0,"cool":0},"m_YX-OjfxeaCFAm4Ik1AXQ":{"text":"Came in today for a quick bite and a drink\nThe red headed bar manager was so rude\nShe was ","useful":0,"cool":0},"1uUsLn3MAmIj4arVuyX_1w":{"text":"Here for lunch and got a BBQ sandwich and fresh cut fries, was awesome. Great service and ","useful":0,"cool":0},"88YxhtUNsYowH2cFTeu2pQ":{"text":"Small, off the beaten path. Great place for some traditional cocktails and a good way to a","useful":0,"cool":0},"dWQQnaNCBMV6F_k1KnFpCw":{"text":"I've only been here twice I had a Bly and cosmos they were awesome.. Will be back","useful":1,"cool":0},"OUjmyDGNXmKDUSJyyzKemA":{"text":"Nice little dive bar with a fireplace (it was cold when we were there). Good service, chea","useful":1,"cool":1},"tPCJAZwmj5tiOJI5_zouXw":{"text":"Good late nite spot for cheap Abitas ($3) and great comfort/drunk food. The Whitman (\"Our ","useful":1,"cool":1},"7QYUfJA7BPkjCAw_hI2LxQ":{"text":"I came for lunch and had the Cuban. Lots of bread with little meat. Average at best. The \"","useful":0,"cool":0},"Ar8a04vdZyojmyJFilCztw":{"text":"Saturday evening we swung in here round 1am for some late night bites. Great staff and exc","useful":0,"cool":0},"0uDnJVbhgSk3eYZ1NAN8SQ":{"text":"Found this restaurant in the New Orleans dining guide. I'm a writer, so the concept sounde","useful":0,"cool":0},"3NW2HTTbSRi_ww3-gsoKqw":{"text":"Really great writer/Hemingway theme. Good bar food and is open late. Even sometimes has a ","useful":0,"cool":0},"0GamwKZPSjHFkBth0oF4JA":{"text":"My boyfriend and I visited this bar twice while on vacation in New Orleans. We never tried","useful":0,"cool":0},"aXscaT_llFdF9_wmwVThIQ":{"text":"Anyone from NOLA will tell you, no two gumbos are alike. The hard part about finding good ","useful":3,"cool":0},"kRpTmFEunacbe92b3-0zsA":{"text":"Hubs and I went to eat and grab a drink last night at about 8 maybe. Wasn't too busy, norm","useful":1,"cool":1},"McXOy3zXrj-vK9i2K0DGGg":{"text":"If the female bartender with the dark black hair working this past Sunday at lunchtime doe","useful":6,"cool":0},"cmm9l1vKaWylh8p69SS-Bg":{"text":"I called to ask a question about their menu.. before I could get to even saying to menu it","useful":0,"cool":0},"EV0WtMPFqnDhT1a0eZPShg":{"text":"Had BLT, bread too thick, bacon tasty. Beer prices better than average at $3 at lunch.","useful":0,"cool":0},"u0xv1NVIQieGnijsml7xAw":{"text":"Cool literary-inspired bar with hip bartenders and staff who welcomed us weary travelers. ","useful":1,"cool":0},"K0Uj-SBEpKMXwSGR-s-vXg":{"text":"Another good Quarter spot with good food, good drinks, and great conversation.  I usually ","useful":0,"cool":0},"8sv2E19V1ivElTQopQh8Fg":{"text":"We searched yelp and found this jewel. Was kinda over the creole thing and needed a good b","useful":2,"cool":0},"9lPqS2G7g_StIxPhmNuM9w":{"text":"Cool place. Gumbo was good. Very casual and laid back feel. Wife and I both had ham, Bree ","useful":0,"cool":0},"UznGugZFjTzYC3ZGktk8BQ":{"text":"Eating dinner and two mice run across the floor. I tell the waitress and she says, \"Welcom","useful":0,"cool":0},"ybb7M_TQHqdqUvlCih4DKw":{"text":"The Whitman with fried Oysters was good and the service was prompt.  I will definitely ret","useful":0,"cool":0},"Fk7IwgAbNloD4DFMS9VFsg":{"text":"Probably the friendliest bar I've ever been to. \n\nI discovered Backspace Bar when I was wo","useful":1,"cool":1},"92dUSqWLtdx-MagGGbAhQA":{"text":"Busy Essence Festival weekend. Everywhere was packed. I happened to Yelp Burgers nearby an","useful":0,"cool":0},"hXvx673J4i-NmjlGhGE57g":{"text":"Nice divey little spot.  Bartender was very friendly.  Didn't eat here, but sat by the win","useful":0,"cool":0},"Y_9EivtBN8H6BynhONRhAg":{"text":"So upon walking in the atmosphere is very clean and reserved. It looks nice an their organ","useful":4,"cool":0},"JEGbRI98jxlxt39ZlYheQQ":{"text":"The thanksgiving sandwich is awesome. Too bad it's only for a limited time.\n\nThis place is","useful":0,"cool":0},"c3CtQ5fQ1FDJ5BoyLkOE4A":{"text":"My girlfriend had the French 75, which was undrinkable with a capital U.  Thought it would","useful":0,"cool":0},"BHgc9QTjh_km47gCgoOdFQ":{"text":"After returning to Backspace after a disappointing burger I was delighted to find the juic","useful":0,"cool":0},"6fUytvxE3UBqm1WMaRPQaw":{"text":"BEST RED BEANS N' RICE !!  Also safe for vegans. Has a hickory smoked taste to it. Gotta l","useful":0,"cool":0},"4Vp-lUAFFPO6LMaRTgnWDQ":{"text":"This is a great little place for drinks and a quick dinner. The Midnight in Paris drink wa","useful":0,"cool":0},"h48qq_gd-sIdp7W4I9RKew":{"text":"For a corner bar atmosphere in the quarter, this ranks number 1.  No pounding techno music","useful":1,"cool":1},"EWTD1vC64Jnh-3n6f85MTw":{"text":"Wandered in solo at 10pm on Thursday. Took a seat at the bar. Service was prompt, ordered ","useful":1,"cool":0},"ZQrdr47Vx4MhNm_OaWxG8Q":{"text":"Great bar. Red headed bartender was good and almost funny. Get the lasagna, delicious.  De","useful":1,"cool":0},"DTf0jFgAJJnkOkOo4DtaqA":{"text":"Great local bar off the beaten path of Bourbon St! St. Party's Day with $5 Jameson all mon","useful":0,"cool":0},"bhulHJM-E1YcdnvH3ux15w":{"text":"Food was typical  are Foose but actually really good. Ask for the grownup grilled cheese &","useful":0,"cool":0},"uuvB9i7yeN4-zuBjsEC16g":{"text":"I was excited that they had vegetarian options. Unfortunately, the Grilled Veggie sandwich","useful":0,"cool":0},"BOJHsTliSYWYNA4uaG7dIg":{"text":"This place is great! I had the roast beef and it was amazing! My husband had the meatloaf ","useful":1,"cool":0},"nT8pU4IJGT1sstQGYaRBAQ":{"text":"O Lordy. This place is the most awesome bar and food in the FQ. Chelsea is best bartender.","useful":1,"cool":1},"NTOKG2Me2ZUL82oOlw-BAQ":{"text":"My brother and I stopped in here after a cold day of walking tours and overpriced food. It","useful":1,"cool":1},"Vgpb5wKWk_FmToUrziNeQQ":{"text":"Great place for late night eats.  We had a burger with House-made chips, and it was spot o","useful":0,"cool":0},"y9MhhxdBAnyG4E_ZisLd7A":{"text":"This place is awesome.  Friendly staff and customers.  Good prices.  Sometimes have to wai","useful":0,"cool":0},"ULodAAUwkb1zrcBqUrSWwQ":{"text":"Delicious!! The burger and the meatloaf sandwich hit the spot, great atmosphere and even b","useful":0,"cool":0},"bnWUwbvHgEwm9yIzQ5V9MA":{"text":"Good drunk food - good drinks. I'm happy I found this place at 3:30!  The BLT was awesome.","useful":0,"cool":0},"hqDktA9_nrCkkv-xjD4FMg":{"text":"2legit2quit. My burger was amazing and complemented my beer. Friendly staff, quaint and of","useful":1,"cool":0},"RuWupXi48sUwuQ7phxP5NA":{"text":"Saturday evening we swung in here round 1am for some late night bites. Great staff and exc","useful":0,"cool":0},"5fIg6NrjyGcqm8tOtKyOeQ":{"text":"Great atmosphere, almost completely safe from French Quarter riffraff. The food can not be","useful":0,"cool":0},"l-hjUDSdHvs5pxEtvp5-XQ":{"text":"Lydia is AMAZING! She accommodated our huge amount of people and was FABULOUS ! Kind, frie","useful":0,"cool":0},"4snxghQWd0MLIqwiiEdY6g":{"text":"Fresh squeezed juice makes all the difference when you're ordering a vodka OJ. They've got","useful":0,"cool":0},"TcWx5sivPX14mvhDY0P32Q":{"text":"Truly one of the highlights of my too-short trip to New Orleans.\n\nIn need of a quick lunch","useful":0,"cool":0},"h8GzDDAYZGqbWsK5aULTug":{"text":"Delicious meatloaf sandwich add cheddar cheese. Wouldn't have ordinarily picked a sandwich","useful":0,"cool":0},"1eevwGWjtR3qYMkbPNh5jA":{"text":"Awesome space, awesome burger! Fast service as well! A must if you're wanting a chill plac","useful":2,"cool":2},"fUFKazeGm09EWDXG6w8nvw":{"text":"Great service from the bartender.  However, the burger was overcooked and the fries so cri","useful":1,"cool":0},"iZiVdTKMTCNFapK1ZGLp6w":{"text":"If you're looking to go have fun and good food at any time of the day or after hours then ","useful":1,"cool":1},"j4Ra-w6LsGCLLrPvP4Li3Q":{"text":"I was already in love with the cocktails at this quaint bar. And I was floored and amazed ","useful":1,"cool":0},"A2qw4Cvqyf5nPrRPBF4nDA":{"text":"Nice little place to stop in and have a drink...although there are thousands in New Orlean","useful":0,"cool":0},"i5GWWXJyo2S6Dk0wMrzQzg":{"text":"We just got off a long flight and checked into the hotel for the conference. This place wa","useful":0,"cool":0},"scGqDyYbLpsUyy63fI84VA":{"text":"This is usually our last stop after work on Wednesdays. We mostly come in because we love ","useful":0,"cool":0},"IWCXNpvUi7cwxlgNziR5Lg":{"text":"A cute space with more than ample seating. Plenty of delicious signature cocktails and the","useful":0,"cool":0},"Ns0pi1hesiSOoqOR-V85-g":{"text":"Food (roast beef sandwich) was outstanding, but service wasn't the greatest. The meal was ","useful":0,"cool":0},"ucG6pK_4okhMD6Zk5ioGww":{"text":"My friends and I were able to snipe three seats at the bar after the Sugar Bowl,  so we fe","useful":0,"cool":0},"oQP0CYIBbTsekERJu5MTaQ":{"text":"We ended up stopping in here every day during our trip. We found it by accident- we were a","useful":0,"cool":0},"Ih5I6lwcrmhq4MwsCmBrHg":{"text":"Redhead bartender is amazing. Personable, intelligent, and easy on the eyes. Will return.","useful":1,"cool":1},"Co0eeNHz4419_Y8LWYMbTg":{"text":"Stopped here after a local tour and had a late dinner. BLT was amazing! Housemate spicy ma","useful":0,"cool":0},"HPRSZVrcGRsODG5JRRxddg":{"text":"Burgers were phenomenal, despite being under cooked. I suggest asking for a higher heat th","useful":0,"cool":0},"WJDO0HMVSgl1Cd3-90p4rg":{"text":"This was my first experience at Backspace. I was really excited about going. I wondered ho","useful":0,"cool":0},"ccryMoAIiVUB7RrjYTsIQA":{"text":"My husband and I stopped in here for a quick drink and ended up having a nice meal. They s","useful":0,"cool":0},"ADHaC0fKXTE5JZ8s4_huUw":{"text":"I'm feeling this place. It's divey (ish) with good bar food. Given all of the options near","useful":1,"cool":1},"FXvL0rA3EvQxb-XKifJ4yw":{"text":"Seriously!!!!!!!!\n\n\nSimple and straightforward\n\nBackspace Burger is honestly one of the be","useful":1,"cool":2},"W1yWrScE4xENTbQeRUGF2g":{"text":"Service is bad. What is the point of having tables if no one is going to service them. We ","useful":2,"cool":1},"Blv0V6BtzqJn_jRPaVG12g":{"text":"Slipped in here for lunch while at a conference near by and was pleasantly surprised.  Gre","useful":2,"cool":0},"Ak-F0GxlEAcoWNGh5RoUlA":{"text":"Great laid back place away from the touristy bourbon street crowd\nLaura was so attentive a","useful":2,"cool":0},"l0P41m_Inra13DNvgRZyKQ":{"text":"I'd love to have this bar back home. I don't understand the literary tributes but I dig it","useful":0,"cool":0},"UkM1PSoNWRG5uandi36Kkg":{"text":"What a shame.\n\nI was quite eager to check this place out after considering it for a couple","useful":1,"cool":0},"xRCbLiseuMnQTpSL3F6DUg":{"text":"Stopped in at the end of the night. The place was recommended to us by some locals. I have","useful":1,"cool":0},"_waErTl9ZgsWQrSgm-52Pw":{"text":"Excellent spot for a relaxing cocktail. The atmosphere won me over with its great music se","useful":0,"cool":0},"3GVdmXYnTiqbva30mNpVxw":{"text":"The red headed bar tender was so rude to the customers. The food was also terrible---I got","useful":1,"cool":0},"EumFvAGntiVfIyhyhSRY7Q":{"text":"Stopped in for a burger about 9 pm ona Sarurday and there was no wait.  In fact we were th","useful":0,"cool":0},"Q_CMZky9c8R-fIn75Na9Lw":{"text":"This was our favorite watering hole during a recent stay in The French Quarter.  Vinnie an","useful":0,"cool":1},"KCcukIk1S9wA3DiaW8ZtXA":{"text":"This place is super tiny but it's unique. The cocktails are STRONG. I wasn't crazy about t","useful":0,"cool":0},"WUHUIXNiukVevG92F1YVBw":{"text":"This is my favorite after work bar, but what is up with the corporate outfits all of a sud","useful":0,"cool":0},"3bZULlFju1UDQbnRfkxwlw":{"text":"The Whitman Roast Beef sandwich was fantastic. When in NOLA, yes I want fried oysters on m","useful":0,"cool":0},"kBFzcYCgMwtbmy1K794V4Q":{"text":"The food was delicious! Bartender was a great personality... I want to say his name was Vi","useful":0,"cool":0},"K20lY9UhLN0ebP-NFLpQyw":{"text":"This place is great! We came here on a whim while at a conference- during Mardi Gras, no l","useful":0,"cool":0},"MZXkBXMSpAm5ZXGkTcQTsQ":{"text":"Nice bar. Food good but a bit on the pricey side. But hey the rents can't be cheap here. \n","useful":1,"cool":0},"Y0IBrYmcTO4ohhUGHlnKFg":{"text":"Amazing cheeseburger and homemade kettle chips. Great for late night eats. Also, the drink","useful":0,"cool":0},"iy72GrzFN6uuTLqB91z69A":{"text":"I was born & raised in the south but I've been out of the south for 3 years and as soon as","useful":1,"cool":1},"L_yqbBU_UnnHCcBEjJ0SEg":{"text":"Let me just say that Corey is amazing!!!  I appreciate him so much. He instantly happily g","useful":0,"cool":0},"5kd1N0FEV3mfchwceH2QWw":{"text":"I love this place. It is one of my go-to spots for late night food or a good place to sit ","useful":0,"cool":1},"BBJ6z7ImNXusRGpFUZif1A":{"text":"Quite little place in the busy French quarter with an awesome burger. Friendly, attentive ","useful":0,"cool":0},"21zB6peEpy2CBh9njMUwuA":{"text":"Meatloaf sandwich is amazing!! I loved this place. They have a variety of sandwiches and s","useful":0,"cool":0},"hfyMhsy4ztbm0Y24A_7Zcg":{"text":"Good fried pickles. Great chill atmosphere and super comfy chairs. Women's restroom is a l","useful":0,"cool":0},"YnwOEZmNO6lgiEHEj9pGZQ":{"text":"Really like this place. The Brie sandwich was delicious and my husband liked the Cuban. Se","useful":0,"cool":0},"oEpiuTdSsIBpiPRCgN97lA":{"text":"Best bar in the French Quarter, hands down. It wasn't crowded, although that could have be","useful":0,"cool":1},"jyXkWI_qBHOf0OwkfMDGYA":{"text":"The space is small but quaint and comfortable. Most spaces in New Orleans are smallish. I ","useful":0,"cool":0},"2Krsak48bt9D9fdoZkkGCw":{"text":"Rude staff, poor service, food is hit and miss, when they bother to serve it.. This place ","useful":0,"cool":0},"K4TbI9jdv28WIg73VGUFMQ":{"text":"This is a great bar to just go in and relax. A little on the divey side but not gross or d","useful":0,"cool":0},"ACmrXlQrHn018zPgU1d-mw":{"text":"Food was okay. I would of gave 4-5 stars for food, but the bartender was rude & very imper","useful":1,"cool":0},"e5hs4qNZTHm6wcYRbErQ2g":{"text":"Ok place. Burgers were really good and it's very low key. Nice break from tourist places. ","useful":2,"cool":0},"ZijXCr6bswWdbRbdvNPZHg":{"text":"Good spot for a low key drink in the quarter. \n\nStopped in with a coworker and his buddy w","useful":0,"cool":0},"udYEUqOITStwtSmo11blZw":{"text":"Worth stopping by for a couple drinks or some quick food. Decent selection for the area, p","useful":0,"cool":0},"IFpwNmEwoibhHPKgepDMTA":{"text":"mediocre place to kill two hours during off-meal hours as you wait for food.... highlights","useful":0,"cool":0},"W5zbSq44-FIZPRnoWGUakw":{"text":"Meatloaf sandwich was awesome!! Quant little bar, good atmosphere. Menu selection was smal","useful":0,"cool":0},"4lzO20w80iH6xZIV_SI0pA":{"text":"Absolutely the best meatball sandwich I have ever had! Liz makes the best meatloaf there i","useful":0,"cool":0},"0ZxY49hGfjRC-r4BA6WV1g":{"text":"Nice little bar with some great food. Great spot for lunch or drinks. The staff was very n","useful":0,"cool":0},"GE8fCw6USVRsF-8REBmMPg":{"text":"Lydia the bartender is super fun. French toast and Brie sandwich is bangin. Staff in gener","useful":0,"cool":0},"6OYExUG-1f1kjKBXOjqXsQ":{"text":"Offers a great variety of food! They made the New Orleans experience fun and entertaining.","useful":1,"cool":1},"hflWLhLYP_KeCyB7ZcSDDw":{"text":"Great, CLEAN restaurant in the midst of a lot of grubby places. I had a gin rickey and a r","useful":0,"cool":0},"NC7APV8nZ9KFT4P1Fhfo-A":{"text":"We found this quaint bar when waiting for brunch Saturday morning.  It instantly became or","useful":0,"cool":0},"LlZqX_l0npYybaYWq_OarQ":{"text":"I agree that Vinny makes THE BEST Bloody Mary! My 5 girl friends were there over the weeke","useful":0,"cool":0},"sZyu5rJjJSqqVRtm0clKtw":{"text":"My girlfriend enjoyed their drinks but the food was nothing special. The gumbo was really ","useful":1,"cool":0},"xtxpt7s84z7CApOshXzEvA":{"text":"Good food and decent service. Menu seemed pretty basic but worked out well for us. Not bus","useful":0,"cool":0},"Ds7M4qDTfcYBvXmBcNCcZw":{"text":"Rad little bar on the edge of the quarter.  Went there for a late weekend lunch - very sat","useful":0,"cool":0},"05xVQnhN9uNTiR7MTcq0ng":{"text":"I have been here twice in a month and the food & drinks have been awesome. This is the typ","useful":2,"cool":0},"MsQT9v2OK36MRLSgAQfcBA":{"text":"Food was delicious. Had the fried pickles and grown up grilled cheese and both were awesom","useful":1,"cool":0},"wH_qKNGo8z60fBS8Dve16w":{"text":"Great burgers, relaxed atmosphere,  good time!\n\nBurgers were delicious  (mine had brie and","useful":0,"cool":0},"UzXicGWNGobmTUWjAefCLQ":{"text":"Great place to hang out aftet hours. Burgers are excellent.  Relaxed atmosphere. Music per","useful":0,"cool":0},"caTq3MHUNspTYf0wMrdSpA":{"text":"Fun place, awesome grilled cheese sandwich and if you love absinthe, ie black licorice , t","useful":0,"cool":0},"-STTSd3ZFfhydcPCFP7CTw":{"text":"Hidden gem! We just happened to duck in here walking around during lunch time. We did not ","useful":0,"cool":0},"5_uTLB-HAxXV_SgSfgXm0g":{"text":"Recommended by a local foodie friend for its vibe, relaxed seating and general ambience, n","useful":0,"cool":0},"SJ5euMgnyHNmrDPw-qhYcA":{"text":"This was my home away from home in New Orleans. Whether it was Lydia or Laura behind the b","useful":0,"cool":0},"3M_T49gsbE3_zGJR3G1MOg":{"text":"If you are looking for some last beers and some grub at the end of the night this is a goo","useful":0,"cool":0},"ehuGJWvTGlZl248gL964Vw":{"text":"This bar was a go to stop while visiting New Orleans. We spent 8 days in town and stopped ","useful":1,"cool":1},"31LOhG00gDQwBgkpy-5lQA":{"text":"On a chilly Sunday October morning I made the mistake of thinking that we may be the only ","useful":3,"cool":5},"lFsnSRU0JXEGzUHGezXl3w":{"text":"Way overpriced. I got less than half a rocks glass full for my \"sazerac\" specialty drink f","useful":1,"cool":0},"Qq1PNubsI5h9qLDf8hFQ6w":{"text":"maybe i dont know how it works here in New Orleans, or the states for that matter, so plea","useful":0,"cool":0},"emTWJlzvjcFivJK6MczhqA":{"text":"what's not to love?\n\nsmall and quaint.  sat right down.\n\nfood was super quick and super de","useful":1,"cool":2},"V7061nfKk3cmUho9pY8KHQ":{"text":"Great quiet spot to get away from the tourist crowds, bar tender really knows how to make ","useful":0,"cool":0},"vb5tt7uU4fr2b9IZOdbFHw":{"text":"A great place for po' boys and drinks. We were in and out pretty fast, but I'm glad to hav","useful":1,"cool":0},"EBTmpwDs-zVkfcqgIlaOvw":{"text":"Four stars only because there were smokers here. Apparently if most of your business is do","useful":0,"cool":0},"jVrJ7i-CNOOTgL2hFvqn0w":{"text":"I was in new orleans the week leading up to easter sunday way back in 2013, 4 years later ","useful":0,"cool":0},"tWBL1LCf2T43m65lbi6Jyg":{"text":"This was our first trip to New Orleans so we visited several bars and restuarants. Needles","useful":0,"cool":0},"9SXzNSe1SgkDv1ijAI079g":{"text":"Good heavens! Check this out! From  California and just got in minutes ago. We came for a ","useful":0,"cool":0},"-IDGic70XxAn1XCOmmxgfA":{"text":"I was not sure I was at the right place when I first entered, but the bartender was so inv","useful":1,"cool":0},"Y32hRfKugSsXFM7UO0ygKQ":{"text":"Nathan is the best and sexiest bartender in the quarter! Fact.\nHis attention to detail and","useful":2,"cool":0},"ub8o1nBr5-SbHBmlHiS5Nw":{"text":"The \"make your own burger\" was just what we needed for our hangover.  I would have preferr","useful":1,"cool":0},"cd-kCtHHb7KmB0wfB4uk1w":{"text":"Sunday night, 9 pm, last night of Jazz Fest.  Walked in, grabbed a tall table and chair in","useful":0,"cool":0},"wniWaMSMGeCJh1L2On_q7Q":{"text":"Late night snacks-\n\nHidden gem across the street from the New Orleans Marriott.  The pulle","useful":0,"cool":0},"QAuKvPEuHXQ3L5zcmqwGkg":{"text":"What a great place to hangout. Tried the tomato soup and grown up gilled cheese. Delish! T","useful":0,"cool":0},"tVaYIccluLj8GXeAbGfKvQ":{"text":"We were there on Sunday night. The bartender with a beard was being very rude when one of ","useful":0,"cool":0},"vTj1FbQJ7aNsEkZPcAReZQ":{"text":"Wow, what a find!  I had a burger craving and am so glad I was close to this place\nOr I mi","useful":2,"cool":1},"DR8Cf1Lvdt0u85jfwGXz7w":{"text":"This is the neighborhood bar everyone wishes they had within walking distance of their pla","useful":1,"cool":1},"kndSkeMAqKAc4nIuwAEbzw":{"text":"Stopped in on a Sunday for lunch, not busy\nNot close to a busy street\nBar tender was cool\n","useful":0,"cool":0},"mpoI7Wptef1L8_L_65Ga3A":{"text":"This bar is really interesting. It has a literary vibe to it. An author is here autographi","useful":0,"cool":0},"ZQVajJj-Qv-bE9jpoB_X4A":{"text":"Vinny in his sleek bowler is one hell of a bartender! Come for the burgers and stay for th","useful":0,"cool":2},"fOgwnmgM_Rkuil1_BUTnmA":{"text":"Food was great bartender served us and took a 6 person order without a pad or notes then w","useful":0,"cool":0},"AejKSN_HD2rCKAow1cnoRA":{"text":"Cozy, friendly, and super fun. Great eats - our group had the burger, the BLT, and the gri","useful":0,"cool":0},"D8It6HfQaF-s3ugb_7UU_w":{"text":"First visit to The Backspace for food and drinks.   We will definitely be back.   Three of","useful":0,"cool":0},"JY6cBaAccH-uLMsRWvDp9Q":{"text":"Awesome just... Awesome. We started at the dump of a bar next door and after an awful expe","useful":0,"cool":0},"uW01BOHCE5y_-J4-fN-QlA":{"text":"Absolutely one of the best bar/restaurants in the quarter. The ambiance is incredible, the","useful":2,"cool":0},"L7ynlrOc6lcWu40BKWFzhA":{"text":"Stopped in here for a late lunch. It was national cheeseburger day apparently. $12 burger ","useful":0,"cool":0},"udo7qmUqfKuaX3hLPZznyw":{"text":"Near the western fringe of the French Quarter, Backspace was located right around the corn","useful":0,"cool":0},"jaaM5yxhATgk4d2JJfsu-g":{"text":"Horrible experience. I went in with my family on Sunday night around 7pm. There were maybe","useful":1,"cool":0},"HJeczFQSfl4PO53QIBbAlQ":{"text":"I traveled alone. Real chill bar. Pork slider was good... SPICEY and delicious! House chip","useful":0,"cool":0},"VUMCSf3uZgq4bSUJZKJpMQ":{"text":"The best burger I have had on my trip from California   We really needed this place. It's ","useful":0,"cool":0},"JNtLYxivuH29rRBMel0CrQ":{"text":"Consistency is key. I came here a few weeks ago and enjoyed possibly the best burger I've ","useful":1,"cool":0},"IRqcWY29c6mQaR2OtJZsbQ":{"text":"The bar is a cute gem on this back street. It is similar to the bars in Williamsburg for t","useful":1,"cool":1},"d93ZzAwAzUNE4sVfo8Km6w":{"text":"Three stars for just one of the best burgers we've ever had!!! Service kinda sucked. The m","useful":0,"cool":0},"J-NI0muFKt9lV8pRB_MetA":{"text":"My boyfriend and I visited New Orleans for 8 days and we loved this place so much we went ","useful":0,"cool":0},"HhJlFluXEFPEEvpJUlUavw":{"text":"I've heard that their was more rodents around since Katrina, but this was the first time I","useful":0,"cool":0},"7sbFcZlA_GcYm8NjZrsGgQ":{"text":"Great place! Just got into NOLA and was wondering around bourbon street looking for some e","useful":1,"cool":0},"t6knKKTBqZx2atitZhulDA":{"text":"We were staying across the street, I read the reviews here on Yelp so we stopped in. The b","useful":0,"cool":0},"wOgJEvqYLsJtLzTrceYcyQ":{"text":"Stopped here for a few drinks - bloody Mary's were top notch (zing zang is the best!) and ","useful":0,"cool":0},"0oK9CLc4ue3BLg4RXmbq2A":{"text":"Back Space Bar.   \n\nFood gets 5 stars as it always does. I have been in service industry 2","useful":1,"cool":0},"0HdNm_VELzuqt1FjWN-y-w":{"text":"Great place to grab a beer... Cool bartenders... Off the beaten path of Burbon. Food is re","useful":0,"cool":0},"XfgbyJIc06QZ1RbKlNz8Mw":{"text":"Sweet spot!  Cool decor!  Hemingway inspired! Roast Beef sandwich and the Poutine were ama","useful":0,"cool":0},"66DxWT00nkxhgVuW3jM21Q":{"text":"Working in the French Quarter has a lot of perks, especially when you are looking for food","useful":5,"cool":3},"kp6ZfaMVGUOgLv_Nsz8GXg":{"text":"Stopped by for a drink. The beer was good but the bartender not so much. The one with the ","useful":2,"cool":0},"dTY64wI8rN6K1IMDPuSMAQ":{"text":"I cannot express my love of Backspace enough. Being a writer, I instantly fell in love wit","useful":0,"cool":1},"SeLsehDaWe0vUAjPgu3gxQ":{"text":"Stopped in last weekend for a quick drink and decided to stay for lunch. The bartender was","useful":0,"cool":0},"_exGHWfqe5R1kJrLaMOfLw":{"text":"Small little bar with a good drink menu and some pretty solid food choices. I was in town ","useful":0,"cool":0},"9M4-l9BAlRalJMM_xnsM6A":{"text":"Better bloody Mary's than pat o'brians! Better atmosphere than any place on bourbon st. An","useful":2,"cool":2},"S8jAgvzaGIykNmLKMeTILA":{"text":"I love this little bar. I think definitely more of a service industry bar more than anythi","useful":0,"cool":0},"GYXPDJa0Q0X7BrwkAFxKvA":{"text":"Best Americano I've ever had. Think that's a coffee drink? Think again. Come for the dark ","useful":0,"cool":0},"DQIlKb6UAfTNIxPZqJJfLQ":{"text":"This place is at the bottom of the list for me, out of all the places we visited during ou","useful":0,"cool":0},"CngYHt9OWXbgTCYLzqgzAA":{"text":"Stopped here during a fun bar crawl in the quarter, mainly because it's name was catchy an","useful":0,"cool":1},"XzGAiUxE7Zya7qblv5vBOQ":{"text":"My girlfriend and I picked up a Whitmans and a Chicken Capris . These sandwiches are absol","useful":1,"cool":0},"H1S9V8wmNxyreFSUB5bR0Q":{"text":"Great atmosphere!!  The drink special was incredible.  My hubby and I drank Blue Moon's fo","useful":0,"cool":0},"ZyT3bvOl9pQLNaw2DwJUMA":{"text":"A cool spot to stop in for a drink (or four). Expect a mix of French Quarter tourists and ","useful":1,"cool":1},"GGWnNEcTXfUiv_LaKw5UPA":{"text":"Happened into the place midday when we wanted just a nice comfortable bar to stop for a re","useful":2,"cool":1},"GFydMVWztIKEv3ZbdnpqJw":{"text":"We needed a midnight sandwich. Got the Cuban pork sandwich with chips. One of the best por","useful":0,"cool":0},"XgmBVkcStrTA0-4bEInB8A":{"text":"Came in for a quick bite after the marathon. Ordered a couple of burgers  with Fries. Food","useful":0,"cool":0},"oSZGpS0K49uF8ISkpmUsQw":{"text":"So happy to have found this casual spot. Absolutely love the literary theme and the kitsch","useful":1,"cool":0},"3uRnGq6jN_mXedu1CdCq-Q":{"text":"I love this little bar!  It's tucked away so it's not usually crowded (although it does ha","useful":0,"cool":0},"_8BDzmw98vMRKDWeeccZ6g":{"text":"Ordered the grilled cheese literally unedible. It first came with no grilled onions (suppo","useful":0,"cool":0},"-48tQdbpo_JpcYJbWeOY4g":{"text":"Love love love this spot! A great local feel, good food (try the burger) and cheap beers! ","useful":0,"cool":0},"9y-DMQnDKCTjAdtCSFWmSA":{"text":"WOULD have loved to enjoy by all the good ratings. Walked in close to noon, empty. The tal","useful":0,"cool":0},"8soBQ6rO9vuo_2C31dwOMA":{"text":"Great burger!  Slow service but who's in a hurry.  Would definitely recommend if you want ","useful":0,"cool":0},"R2MJGA4Doh39XWcLUi9j-w":{"text":"We stopped by this place to get a quick bite and get out of the rain. We split a Hemingway","useful":0,"cool":0},"hteH6mdxuCN9Tann0nhwNA":{"text":"On a recent visit to NOLA, stopped in here for lunch and a few drinks because it was right","useful":0,"cool":0},"4Tc2ADgvgRUud7h37gDD0w":{"text":"The bartenders were amazing.  The locals were all super friendly!   The backspace burger w","useful":1,"cool":0},"3AC6SZyjc_V3PZzaD_yv4Q":{"text":"Best Burger We've ever had!! Actually came twice just for the burger!! It was also the onl","useful":0,"cool":0},"Rzgy3r7Ot5QNJJdnOTl_ew":{"text":"Always a good place when you want some food and drink late at night. I always get the BLT ","useful":0,"cool":0},"bwRefcUo2SwP77qp0wnToQ":{"text":"On your way to Bourbon Street from the Sheraton Hotel is a little place called The Backspa","useful":0,"cool":0},"zzyP1M93M3o55BIA_jwtwQ":{"text":"Very disappointed.  Was provided a mint julep with minimal mint.  The bartender checked to","useful":0,"cool":0},"Wg3rLah00S-3keN1m-NYBQ":{"text":"We had heard good things and were excited to try, when my friend saw a dead mouse out of t","useful":0,"cool":0},"ZzDvuWGJQfU1TO_ZeDaZ4g":{"text":"Awesome place Vinnie was the best ..to bad we didn't find this place till our last night a","useful":0,"cool":1},"SnLvivAJOXvYFo7380O-og":{"text":"Just easily the best bar in the upper Quarter!\nKiller cocktails (hopefully for you, Ashley","useful":0,"cool":0},"gBqZ7MjBXy3yQY2lXW_Iiw":{"text":"I dined here for lunch. I can't recommend the food, but the atmosphere is swell. As a writ","useful":0,"cool":0},"Ik3UybLsAOwfKGTTxyTrlg":{"text":"Vinny is the best bartender ever! Love him. Really great food too! Great place to visit wh","useful":0,"cool":1},"K91TekjdDzT4Zx85jF1B0g":{"text":"One of our favorite places in the quarter. Good drinks. Pretty good food. Bartender vince ","useful":0,"cool":0},"USKYZBgEJV5csqKlBGDtKw":{"text":"Well you can call and ask for the specials.. won't go well 'specials what are you taking a","useful":0,"cool":0},"KJZIrSxv6BUPVQ8muIh51Q":{"text":"In addition to the great bar and service, the food is awesome here. I had a roast beef san","useful":4,"cool":5},"I8oSIvVMZJEW57jailDyEw":{"text":"Best Cuban I've ever had. Turkey sandwich was ridiculous.  24-7 there is no competition.","useful":0,"cool":0},"3YDrbxSKm5OkQltW4r3YPA":{"text":"Personally, I find this to be the best place to get a burger in the Quarter, yes. It even ","useful":1,"cool":0},"8I7RC0ag72re8wDcYUiv7w":{"text":"The bathrooms are way way nicer but the bartenders are more dangerous than the Jimani next","useful":0,"cool":0},"sxOr6RefBZdUVM-Sd9-ONw":{"text":"My favorite bar to hang out at after work in the quarter. Nate and Sarah and their barback","useful":0,"cool":0},"sNZ04NFWarmNTLfK2D-i-Q":{"text":"Good drinks. Cheap, solid food. I expected little based on the touristy location but was p","useful":0,"cool":0},"1MXBci1hIe08D3Tl6FcJWA":{"text":"Summary - Try coming here in the day time to experience the cool bibliographic theme and a","useful":3,"cool":0},"azWheQaQyv9FN6Xu6LRDfQ":{"text":"This place is one of the best hidden gems in New Orleans! I really wish I found it sooner ","useful":0,"cool":0},"rw_RrmcXUVpxWFkc5vybQg":{"text":"Get the Kobe beef burger with Brie, applewood bacon, grilled onions. Perfect for a hangove","useful":1,"cool":0},"fNJ5__arIP3VuqyhGSKXjg":{"text":"My boyfriend and I grabbed drinks here and the bartender made some awesome drinks for us. ","useful":1,"cool":0},"3IkloLvOfht3PVmvqBxALg":{"text":"First bar we stopped into in the French Quarter and we found it really hard to leave!! Gre","useful":0,"cool":0},"Lz3ib_Ad4IDQBNXJcgKDgA":{"text":"the backspace provided quite a great night out being new to town the young barkeep swede w","useful":0,"cool":0},"NGnTZoMsVO9TSp2qDd7_Kg":{"text":"I am not sure where to start. We've been here a few days and a little tired of southern fo","useful":1,"cool":1},"bzw9FPBnmWjLmEiMd-BcbQ":{"text":"The bartender definitely can use some remedial training on customer service. I ordered a b","useful":3,"cool":0},"c0P21D0oJoZRqrR1nCuJRA":{"text":"Nice hole in the wall bar. Great food! Chicken pesto sandwich was delicious! BLT and Cuban","useful":0,"cool":0},"YPsrhmn12Pk8m2R9ynY4SQ":{"text":"Awful experience. When asked about a recommendation, give one- I wouldn't say \"look at the","useful":1,"cool":0},"PIFCWUHEg7VPIvMQF87K0Q":{"text":"My husband and I went here to grab a quick dinner on Saturday night. It was surprisingly e","useful":4,"cool":2},"WaE2111mmvpuRZiIjixeNA":{"text":"Terrible. Waited for 30 minutes after ordering to be told the chef never showed up. Worst ","useful":0,"cool":0},"KnJklSisIhLBUhPe33UYRg":{"text":"Great grilled cheese sandwich!! Nice bar with cocktails and cheaper menu. Would recommend ","useful":0,"cool":0},"m6sYNQQObmaYJIjhQHkvqg":{"text":"Came here today for a quick lunch and was glad it was completely empty except for a couple","useful":0,"cool":0},"JWf5Wfs-UsntS0Ce0ms80g":{"text":"Backspace is my favorite burger in the city, until Friday night when instead of the usual ","useful":2,"cool":1},"7YtBmSOJJRapmbgxp2-UQw":{"text":"Terrible experience! Waited for 30 minutes for a BLT asked if there was food in my future ","useful":0,"cool":0},"ADmukOtceaz0EnVrywGunQ":{"text":"Went in and asked the bartender what food he recommended and he rolled his eyes walked awa","useful":1,"cool":0},"Buf5S_PaV-7vX3C5WJJseA":{"text":"Giving a 3 because we went for food but the menu was small and nothing really looked good.","useful":0,"cool":0},"sAYWPEYDolqHwcbESnPHEQ":{"text":"Love love love the burgers here.\nThis is my 2nd trip to NOLA and this is an absolute must ","useful":1,"cool":1},"Jl8PUg2v5zh80CZ9n3qCMg":{"text":"The French Toast grilled ham and cheese was amazing. Bartender was really friendly and the","useful":1,"cool":1},"e2YsL1DvsWqR_m3h0uRxIQ":{"text":"This spot was about two blocks from where we stayed. I really fell I love with the creativ","useful":1,"cool":1},"FmYiVHLblS4Zx2km09c85A":{"text":"Wow! This place was awesome! The meatloaf sandwich was probably the best sandwich I've eve","useful":0,"cool":0},"VqHSDb4f6jOhBw_swTAVQA":{"text":"Why haven't I reviewed this place yet? This is one of my go to spots in the French quarter","useful":1,"cool":1},"66GdYrs7kjc-OW-NyMzL9Q":{"text":"Just got into NOLA after 10 hour drive. The food was perfect comfort food. I had a adult g","useful":1,"cool":0},"n7K6TynQjXZabmnE-F4a_A":{"text":"I was here on the Monday before New Year's Eve with a few friends for cocktails. The barte","useful":0,"cool":0},"qV_T7YjCkTJrE50jYgSOZw":{"text":"Very cute and cozy bar not too far away from all of the action! They offer a great selecti","useful":2,"cool":0},"t6PNbFcUFOjq7t2k39RPyA":{"text":"Located just two blocks parallel to Bourbon Street, just off of Canal, Backspace may as we","useful":1,"cool":0},"p-BaiiakSHS9ZI4STwIAnA":{"text":"There's a large event in town and this bar is empty. Why? They charge for water, even tap.","useful":3,"cool":0},"2sSt4SvhrRXwrR4erMqfXw":{"text":"Just attempted to eat here and was informed that our Canadian IDs were insufficient to be ","useful":1,"cool":0},"PU-WLBa-ssJmB0y1BVWn9g":{"text":"Nice and chill place with a cool ambience. The House bloody mary was great and just exactl","useful":0,"cool":0},"YfQSwu_gNmWdL8pVB18Vsw":{"text":"So ya'll have heard of cooks at bars but this bar has a chef! The world's greatest chef! H","useful":0,"cool":0},"5khX_QHKOzJT37dgg-7uOw":{"text":"We stopped in last night after exploring bourbon street and were beyond impressed! The bee","useful":1,"cool":0},"yQh-McVUu-ZJZyZdRmay9w":{"text":"I just recently moved to the French Quarter and now live just two blocks from this gem.  D","useful":0,"cool":1},"_ccPokc5lM_8qS3-8ifwjA":{"text":"Came in for a late night meal. The homemade chips we're fantastic. Really wanted to try th","useful":0,"cool":0},"-IoRXLy9qL8zDdcCq1PtrA":{"text":"Perfect rainy afternoon stop close by the Quarter House, where we were staying. Bartender ","useful":1,"cool":1},"zgPuMI8BnSpNHEKbGhUM-w":{"text":"Bartender was rude and unprofessional.  As a frequent patron, this is the first time that ","useful":0,"cool":0},"0o_sX-t5UwgIsEG8ApZdaw":{"text":"I would never, ever go back to Backspace Bar & Kitchen ever again. The server was very imp","useful":3,"cool":1},"pAPcB8pmXT_Z7Ov50duwWA":{"text":"I've visited this bar on many occasions while in New Orleans on business. The backspace is","useful":0,"cool":0},"07637Zm8XuW5-bO8mvDRvg":{"text":"Cool bar. Great atmosphere and comfortable leather chairs. Had a drink here only but the m","useful":0,"cool":0},"ssKOhvtcjbpffBhD4ZibPQ":{"text":"When a guy outside tells you the bartender is an assho#% in here and then you find out, he","useful":1,"cool":1},"WYNuRGoqqTGygjgAiNHJ3A":{"text":"I've been in the service industry for over a decade and was appalled by the service. The b","useful":0,"cool":0},"XpoxYotl682AhrcLa9ig6A":{"text":"Vinny makes the best Bloody Mary in town!  Went there twice for drinks before dinner.  It ","useful":0,"cool":0},"AD9vlLvIN2JQMmY8Q_delg":{"text":"We passed several restaurants with huge lines and found the delightful Backspace where the","useful":1,"cool":0},"FKSN8UajtInjJ2L43f0tIw":{"text":"Just me in the late afternoon; only a handful of other folks.  Bartender did a good job ch","useful":0,"cool":0},"4aZwyYBwDLz5XCLHdra9hg":{"text":"We stumbled in here for a late snack 2 nights in a row. The food was really good and the d","useful":1,"cool":0},"4i3ZzCUjdAUElFpPjtPPCA":{"text":"First time here.  As a vegetarian the menu is slight, I was excited to see the gnocchi...b","useful":0,"cool":0},"yQxmu9uendfpNLLulIlz0Q":{"text":"Hidden gem! Fantastic no BS service and food! Completely unexpected! Loved chef Toya- she ","useful":1,"cool":2},"OGGQWQXBw_9S270NwRcEtw":{"text":"Great Bar, with awesome drinks and attentive staff. A can't miss in NOLA. They have a grea","useful":1,"cool":0},"Cq20Gw2KVBaUidxzylhMFg":{"text":"My MFA program jokingly called itself \"a drinking program with a writing problem.\" And whi","useful":2,"cool":3},"wjlUa7PcocfwKFbKX_o4FQ":{"text":"We just stopped in for a beer but this was a friendly and welcoming spot! The bartender wa","useful":0,"cool":0},"pLVORn5KYyycO7n3JXPGIQ":{"text":"Get the Hemingway Daiquiri and the Hemingway Cuban and enjoy life about 200times more than","useful":0,"cool":0},"d_g82KwezG-2bNboBPKsug":{"text":"What's not to love about this little Chartres street bar?! The new menu has some really gr","useful":3,"cool":2},"AMbLGpnDhdhZmPaYbJKJFw":{"text":"Well I came in drunk on a school night around 2 or 3 am in desperate need of some fuel and","useful":3,"cool":1},"1sdhEspTwK6-YwidfROjFA":{"text":"I had the Backspace Burger w/ chips. It was delivered promptly and cooked as ordered, very","useful":0,"cool":0},"abK2a-yPzptx_yb1L48MDw":{"text":"if you like mice running around when you are eating, this is the place for you. I nearly p","useful":1,"cool":1},"TlbFo8nEktcf5vdvGD_5ww":{"text":"Been coming here for a long, long time! We being locals, have brought many out of town gue","useful":0,"cool":0},"xyR4viLyXwWoCgvzpyZLiw":{"text":"Awesome spot to get the classic, tasty New Orleans classic cocktails: sazerac and Vieux ca","useful":0,"cool":0},"8dEu4irNcOfL_8sql5gx6Q":{"text":"Best burger ever! Fried to perfection big and juicy! Doesn't look like much from outside b","useful":0,"cool":0},"xWanLsjDcan8LBlySQC6FQ":{"text":"Really cute little bar! Had the burger and it was a really nice \"gourmet style\" alternativ","useful":0,"cool":0},"YU6H13p27V6Jh1wWuv86dw":{"text":"The Backspace burger was so yummy!  The bun is toasted and it's served with Brie cheese, h","useful":0,"cool":0},"9uOjOBxpLwOuu0FwYCn7OA":{"text":"I just loved this cozy little bar tucked away in the French Quarter.\n\nDavid and I stopped ","useful":2,"cool":1},"3J9tRZJRPr5efFd8DvQQQw":{"text":"The chef Don is so rude for making me crave his burger that I had to talk to him personall","useful":0,"cool":0},"ARoSxA9B_fqJQhxuSbMDfQ":{"text":"My friends and I chose to go here because it was one of the few places open at 2 am on an ","useful":1,"cool":1},"rGU1OX_g_W2Xs_CjXZHuwQ":{"text":"Hands down best burger we have ever had!!! You don't even need to add any sauce it's so fl","useful":2,"cool":1},"qAdC4MSHBmBqDrtmBcgp7A":{"text":"The best bar food ever!  Make a stop here if you want great food, great drinks and a nice ","useful":0,"cool":0},"SM1jpjMmGiOGgX_SfGBcOA":{"text":"I had the Backspace burger. AAAAAMMMMAAAZZZIIINNGGG. Literally was probably one of the bes","useful":0,"cool":0},"hu90Fosnt0gk8l67-DHodw":{"text":"This place is really neat. I loved the decor.  I stopped in here with a group of girls and","useful":3,"cool":2},"edTzZK_3qllragJF6Afc6Q":{"text":"Great burger dripping in flavor. The wait staff seeks to please and is amazingly friendly.","useful":1,"cool":0},"3IkZZRCHIDHyXAJ37Qh60w":{"text":"Bartender, Cory, was a cool dude. Had the build your own burger. It was legit! Asked for i","useful":0,"cool":0},"uU76CnguxKlCitsB-9uN4w":{"text":"Mediocre food and mice literally running all around the place. I can't imagine why the hea","useful":0,"cool":1},"j2mO1VeLpXO88JyEicmSSQ":{"text":"Best food and drinks in NOLA. JM is the best bartender. We live this place! Great food and","useful":0,"cool":0},"v0xakGLMReD2QnFqbjLs6Q":{"text":"I came by backspace to have drinks with friends for my bday. The bar was empty. The server","useful":0,"cool":1},"jmXbrfIQYyXj46WPNFOVwA":{"text":"Stopped in here for dinner last week based on recommendations. Hands down the best burger ","useful":1,"cool":0},"JMCj46-c7igR808yQAYmJQ":{"text":"Randomly chose this for dinner one night while visiting and it was a great choice. The pla","useful":0,"cool":0},"6EwBWJH2uh8XIAF95jrRZg":{"text":"Hands down best roast beef sandwich I have ever had. Burger is amazing too and the staff a","useful":0,"cool":0},"lVgr7ZRQ6vAOpTGROMLRuA":{"text":"I used to love this place and was excited to bring several of my friends there. Unfortunat","useful":1,"cool":1},"4BJag9UvvpN9cb17tCpYAA":{"text":"What a find!  Wanted somewhere chill with good food, Backspace did not disappoint!  The ba","useful":0,"cool":0},"36ehEHG-K6Cv1MsuVvsblw":{"text":"Fun stop! Good beer choices and ambiance. Walked in off the street. Took me a minute to ge","useful":1,"cool":0},"PDbqU7dzjuI1e85MsPFSjQ":{"text":"My friend raves about Backspace Bar all the time, so I've been wanting to check it out for","useful":4,"cool":1},"bENCfvIdXLN9eq18wuR5BA":{"text":"I love this bar. It's my favorite. The food is delicious. Liz is amazing in the kitchen an","useful":0,"cool":0},"U0dMbxepfVEPOWfWNpDe5w":{"text":"Talk about a neighborhood anchor, thank gawd for places like backspace bar & kitchen. The ","useful":1,"cool":3},"NOdptzLjOOvxU-ZGixZ9sg":{"text":"It's a bar that serves food.  Food,service and drinks were OK. If you are looking for more","useful":0,"cool":0},"8ztcZT0Ywl_yY800sVLKvw":{"text":"The sandwichs are all great. The blt with everything is my favorite.  The staff is pretty ","useful":0,"cool":0},"lR0ecQuFwt8MZgUaGAtzEw":{"text":"Bar tender was very welcoming and kind. He explained drinks and gave great recommendations","useful":0,"cool":0},"CWPxlefL7rtOSQYCa8itFQ":{"text":"Food was so good we went back twice! I highly recommend their burger as well as their pout","useful":1,"cool":0},"ZuKlGUyoB1Xb5SrJC55HOg":{"text":"We used to love this place! The food and the Moscow mules are second to none in the city. ","useful":3,"cool":1},"OvsuJyAeRsXqbTXDN7LXpQ":{"text":"Nice space, quiet music, outdoor sitting.    The daily special Paper Plane for 5 bucks is ","useful":0,"cool":0},"2Gx3TR2-UgJ-5_fGQeu1tQ":{"text":"Came here because we saw that it was one of the only food places open at 2 am. We were gre","useful":3,"cool":1},"k3moAuDwRwRvzW_zMdGx5w":{"text":"excellent bloody marys, comfortable atmosphere! had the backspace burger which was amazing","useful":0,"cool":0},"2kGTapMsokNXtVJnzcCb0g":{"text":"Let me tell you; all of the Staff and bartenders are so nice and friendly here. They will ","useful":0,"cool":0},"ONbtBS1FnjNYQvctfJS7Kw":{"text":"When I say it's the absolute best burger ever, I mean it is THE BEST BURGER I've ever eate","useful":0,"cool":0},"Oiz7ukrrVQ_R-7kmApn5IQ":{"text":"Thanks to Brandon!  I have some friends in New Orleans who happen to text me there were he","useful":0,"cool":0},"LedNPsqO0e8AnYPKYA5xHA":{"text":"We used to love this place.  The bartenders used to be great.  Tonight the bartender was v","useful":0,"cool":0},"FU09WBwtDg3y7VOBaFkWMg":{"text":"Ordered drinks and some takeout. Pretty good food for a bar. Great place for late night fo","useful":0,"cool":0},"zbB_FZ8Ay_DRplZC4Tpy6Q":{"text":"Great food, drinks, and service! Decent selection of local brews. House made chips and Fre","useful":2,"cool":1},"nxSbS-bxU7z4EGuZl-Bo2A":{"text":"Love this place. Bartenders are always friendly and welcoming and they care about the qual","useful":0,"cool":0},"ZM6IfinpoxfDqRjJXcCmPg":{"text":"Heather C makes the worst cocktail I have ever had in my life. It tasted like she put actu","useful":0,"cool":0},"a5Kup69bCTw13457Bj1gjg":{"text":"Great signature cocktails, good funky musical groove, relaxed atmosphere. Recommend Pours ","useful":0,"cool":0},"F9TqHoGyIFlQ1eKOHFlYgQ":{"text":"Cute place, liked the choice of drinks! Wish more vegetarian food options","useful":0,"cool":0},"6nZj1P3oSAMDkDlJ2frOpg":{"text":"OMG.  The backspace burger is amazing. Well balanced with bacon and Brie.  Flavors were cr","useful":0,"cool":0},"aiYf4JQ9LsnPUl9jXNBerg":{"text":"This place is a cute restaurant off of Bourbon Street. I had the adult grilled cheese and ","useful":0,"cool":1},"9DBJyemfEzuEmVUR9ivtVw":{"text":"Great spot. I needed a place to eat lunch while in town and also work. They have awesome f","useful":1,"cool":0},"v3Be9Dr69GpjXXBwPDw15w":{"text":"I used to love this place and was excited to bring several of my friends there. Unfortunat","useful":1,"cool":0},"Ya5U2_bOajqVv8iHrxHoVg":{"text":"Amazing, first time there and I came just before the rush. Burger was incredibly tasty, an","useful":0,"cool":0},"dxe0IrJMpkC0fFdpHtfXdA":{"text":"if you like mice running around when you are eating, this is the place for you. I nearly p","useful":0,"cool":0},"0_VC2EKIFaGLpDrvCXmU5w":{"text":"Average food and drink. Kind of divey. Friendly service. Nothing special but satisfying en","useful":0,"cool":0},"-W_4-tFSJfXkb7ToArmmXg":{"text":"These burgers are the kind of meat I want in my mouth! The \"Death in the afternoon\" is wor","useful":0,"cool":0},"OFmababgEVZQn_l410FuOA":{"text":"Worst service ever! Menu that was found online wasn't accurate! Drinks from what we saw on","useful":2,"cool":1},"xoiC2aHOyt7db6CG9zPDGQ":{"text":"We happened upon Backspace because they were playing the World Series, then stuck around f","useful":0,"cool":0},"O6VP80nDjvGVd6-3g52_0Q":{"text":"This place was such a blast that we ended up stopping in twice in one day! We actually saw","useful":0,"cool":1},"66x2RvBp390WlbyEo9CEsw":{"text":"My boyfriend and I were looking for a place to hangout and have some drinks. Stumbled upon","useful":0,"cool":0},"e2qYFCubJ0lgrWyYRsUFfA":{"text":"Had a late night burger and fries. Burger was pretty good, better than expected! I don't e","useful":0,"cool":0},"IhSpcFmfJ0Iw0yeO5Og54w":{"text":"We were really looking forward to eating here this evening as we read about the restaurant","useful":0,"cool":0},"fdJgnzvQ6-99-1sMlOAF4g":{"text":"Idk where the disconnect was but called place because we had our dogs with us. And guy was","useful":1,"cool":0},"nrB34tB6EcletC8elrvGMg":{"text":"Excellent music selection paired with a superb cocktail menu and service. Definitely \"our ","useful":0,"cool":0},"dwcP2nxL8xCBjubIaeuuBg":{"text":"I've been obsessing over coming here since before my trip to NOLA and I was not disappoint","useful":0,"cool":0},"vTtzonhehAtd8cLfzx66zA":{"text":"Cheap drinks, good service. We had a hankering for a hamburger so we decided to leave but ","useful":0,"cool":0},"pnfxwSfpT5wX__lQpKApDA":{"text":"Came here to have dinner.  Yes, I know it's a bar.  Sat down at the bar.  Looked at the me","useful":1,"cool":0},"CkRaZ-OvQaRI0iA9zo5zUA":{"text":"Stopped her for drinks because another bartender recommended it. I was drinking moscow mul","useful":0,"cool":0},"njF7CVK5uP-43YORyjdT7g":{"text":"Love this place!! Travis was such a fun character! Great personality for the place.. This ","useful":0,"cool":0},"QJ1LSpXxu3XIglbKpJjVSQ":{"text":"Swede is always professional and very attentive.  All of the bartenders there give attenti","useful":0,"cool":0},"1ggrC0CXpu3y1BIXEm-PKg":{"text":"When other places were not offering food at night, this place was recommended and I'm sooo","useful":0,"cool":0},"X4GJmpBr5xo-XIISE3nVhg":{"text":"Excellent food and service. Travis is an amazing bartender.I don't know the cooks name but","useful":0,"cool":0},"zmcqUBJZ74nM8e1AUMxNsg":{"text":"It is Saturday night and somehow as a local you find yourself wander the Quarter searching","useful":3,"cool":2},"omy75yLRQlUplKx5sVQeJw":{"text":"Positive: Bartender Laura was super nice. Burger was great (but bun tasted sweet -- which ","useful":2,"cool":0},"fFOwfU0VVJV8EWSPlt7zUQ":{"text":"This place was fantastic, from the moment we walked in! Everyone was so friendly and fun i","useful":0,"cool":0},"f3QJB8s4OYW26pUYZqv4Ww":{"text":"Great atmosphere and absolutely delicious restaurant quality food. However drinks are over","useful":0,"cool":0},"sCXghFCloZn94Vhd2PrDMQ":{"text":"Walked 1/2-mile for lunch only to find that the 11:30am opening time was actually 12:00pm.","useful":0,"cool":0},"Bv0zoB73yC79G9_rvAFCuQ":{"text":"The grilled cheese was perfect and the homemade chips to die for. My boyfriend and I split","useful":1,"cool":1},"Mi5oNX34nLgEcYTmu6CPUg":{"text":"This is a nice little bar with a hip vibe. The cleanest bar in the Quarter. No stale beer ","useful":0,"cool":0},"fdbxSYyE27d_8MYKFpKQMw":{"text":"Excellent meat loaf melt. Wow. Best sandwich ever. Great company and cool bar. Sarah was a","useful":0,"cool":0},"qEuVphb4t_ahsxdVtdYtyQ":{"text":"This place was exactly what my wife and I look for. Great relaxed atmosphere with deliciou","useful":0,"cool":0},"3EIZwBsF0kbdQN01dohRtQ":{"text":"A late night dinner with drinks with eight of my buddies in a Yelp recommendation. Friends","useful":0,"cool":0},"-TraUw3lBQWvxWOYYgNHwg":{"text":"Our last night in NOLA, and not wanting to hit the huge party scene I yelped this place an","useful":0,"cool":0},"rz8UHWq_1zvet8NUO51MoA":{"text":"Really cute set up in the quarter. It was refreshing to find something that wasn't so dive","useful":0,"cool":0},"4qojjRP3d3pZwX8D7wB_bQ":{"text":"So glad Bourbon St was too busy otherwise we would have missed this place.  Best grilled c","useful":0,"cool":0},"yyDoj4KPebsa0nO3Y-s-lw":{"text":"Got in town late and this is conveniently located to the QuarterHouse.  Mostly folks havin","useful":0,"cool":0},"aTNI3RR61jMVu0YQHb1Ybg":{"text":"Stopped in here while on a solo trip to New Orleans. Being from Canada people say we are f","useful":0,"cool":0},"rl4qpzxW-2H41vTVfEQ7Yw":{"text":"The Koala Infestation is bomb! Waites was super friendly and Joe makes a mean breakfast bu","useful":0,"cool":0},"nMmhi9Gg_b8RnkenAuHzRg":{"text":"Great bar to stumble in. Plenty of tv screens, great music playing in the background and s","useful":0,"cool":1},"jkxh-fE6PJIlRmVlBKuVyA":{"text":"Yes..YES..YESSS!!!!  A Late night refuge from New Orleans insanity! My wife and I found ou","useful":1,"cool":0},"LasOLY3IUln2b1k2kKg8XQ":{"text":"This place is disgusting!!  I had read about it online and had high hopes for it but it wa","useful":0,"cool":1},"zNi77MdKkvbfUUmTio6UzQ":{"text":"Normally, when someone raves about a burger I'm just kinda meh about the whole thing. Neve","useful":0,"cool":0},"AF2snFo8fWhDCe6KOCI6zw":{"text":"We came to this gastropub per Yelp reviews.  It was easy enough to find and the atmosphere","useful":0,"cool":0},"wUTwMzXLSuAlatT-C3ofuQ":{"text":"Burger at 2am was excellent!  Heavy metal soundtrack they had playing was good and not too","useful":0,"cool":0},"LZfF2HGn_8gfKq-Dkpy8sg":{"text":"THE BEST BURGER IN NOLA! As well as great drink deals outside of the craziness of Bourbon ","useful":2,"cool":2},"6VjP06A-hTh1JX9PCe-fQw":{"text":"Had dinner and a couple drinks here. Brandon the bartender was awesome!!! Our drinks were ","useful":0,"cool":0},"FePCkG4Y3Kmhug4GrhxLpg":{"text":"We are from Toronto area and stumbled across this place. My husband had the hamburger and ","useful":0,"cool":0},"A2VaxJ5N86IlueWsVVWrLQ":{"text":"Tried this little place today. We were very disappointed. We both ordered the burger and l","useful":0,"cool":0},"JKkWfgV9So2H-1bmpYdZuQ":{"text":"Awesome food! Loaded fries are a must. Also had the burger, fish and chips, popcorn chicke","useful":0,"cool":0},"hN5h51mVxjGJY8REPZMxEQ":{"text":"Great place to grab a late night snack or the BEST ROAST BEEF SANDWICH you will have in yo","useful":4,"cool":0},"S_nuGU4sVMIyFvH6koiBKQ":{"text":"Atmosphere was great! And the fries were amazing! Really eclectic feel with local options.","useful":0,"cool":0},"zRL3jz5xlfDsAyUsP-UKTA":{"text":"Cozy bar on Chartres street that serves up some really good food.  The bartender was warm ","useful":1,"cool":2},"i5wOXiCEXsOdMynAViJKSQ":{"text":"Took a night off from Cajun-Creole food and went to a dive bar near our hotel.  A great ho","useful":0,"cool":0},"eeGuJobQ92Atok0eBuc8zw":{"text":"THE BEST BURGER IN NOLA! As well as great drink deals outside of the craziness of Bourbon ","useful":4,"cool":3},"v5_f8HJ2g-MshHtJH4KP0Q":{"text":"My friends and I are book nerds so finding a literary bar was a nice surprise and a place ","useful":1,"cool":1},"OE9SlykpNHz7AAKy80f6eg":{"text":"Great pub atmosphere! Eclectic decor, good music fun people. The food was great. We had th","useful":2,"cool":0},"KeB267IJUNOBaiOxGNsMcg":{"text":"I'm so glad this bar decided to cleanse the personality from its staff. I'm from Californi","useful":0,"cool":0},"MBQrqF_pPAWNguqzwpW4Rg":{"text":"This place was great. We got in late on a Thursday night and were looking for a laid back ","useful":0,"cool":0},"tS8TFE-aKoUF-QIpr729dA":{"text":"Of all the places I ate at in NOLA, this was my favorite. It's funny; I usually find that ","useful":0,"cool":1},"2qsjA9Q-u2lCzBSX8RGa3A":{"text":"Amazing service from an amazing bartender working her butt off to make sure we had the bes","useful":0,"cool":0},"-aZuWIS4-2wuhYRmxDUqoA":{"text":"I really enjoyed the service of this sexy bearded guy. Now I'm from Wisconsin, and I don't","useful":1,"cool":0},"HgYgKA5BxalCWzi9zrRoqA":{"text":"I really want to give this place a higher rating but service was a little suspect here. Th","useful":0,"cool":0},"Dky937kFUfdrVFCaKZDmuA":{"text":"If I could give this place a 3.5, I would but for me it come closer to a 3 stars than a 4 ","useful":0,"cool":0},"tEnVY_oKustOs9dJd2Usmw":{"text":"I loved this bar up until recently. It always had great food and great service. Drinks wer","useful":0,"cool":0},"zCHHYzmjDJ5JAXEkrSDi-A":{"text":"We visited here one night while on vacation. It was a great low-key atmosphere, the drinks","useful":0,"cool":0},"BvStqvk8Vmw8j3RGRc7BVw":{"text":"When in the French Quarter, I'm often caught between \"find something that's not super tour","useful":3,"cool":3},"jphfkBNkTN8RU4q26qPUqA":{"text":"This burger is amazing. The fries are on another level and this Manhattan...well I've neve","useful":0,"cool":0},"o00WMVz5NQihVERuK0obSw":{"text":"Amazing drinks and the bartender was so nice! Great ambiance off of the main strip in New ","useful":0,"cool":0},"2rwHSDvsrLwiXJk1rC7Cew":{"text":"We came in here later in the night after a parade. We had a hard time finding somewhere wi","useful":2,"cool":3},"J02UWgrWBRGKDv9UoUpm3A":{"text":"Young Travis is the shit! Out of all the bars you'll find in the quarter, he's super frien","useful":0,"cool":0},"1IeMcUTvw_FLK_2ff3Na8Q":{"text":"Walking NOLA and stopped in for a drink.  Seemed to have good history, waitstaff was great","useful":0,"cool":0},"q2FBNJM8gxh8Ll6_9jOY0g":{"text":"This place was such a blast that we ended up stopping in twice in one day! We actually saw","useful":0,"cool":1},"FGt9zxhZswL5RMYsjulnHg":{"text":"Son I'm from  the 9, & me & my girl just wanted to get a drink, after a long bullshit day.","useful":0,"cool":0},"cAaBhTsrPFlSU-Vf8net7w":{"text":"Backspace Bar is a tiny little dive bar in the French Quarter that we stumbled upon after ","useful":1,"cool":1},"FlrevIUJ1P9477IrfyChUQ":{"text":"This was my first experience at Backspace. I was really excited about going. I wondered ho","useful":1,"cool":0},"1C8vfy4P8yTIdo-b_QcDvg":{"text":"The food was good. I had a ham and brie sandwich fried on freaking french toast! It did so","useful":1,"cool":0},"4oMabKCEakVjh8DxJ0O8Iw":{"text":"What a great friendly bar, love the literary vibe! Completely unexpected, in the first blo","useful":0,"cool":0},"6CzFp5mKwIJo_Y8BsWoJsg":{"text":"I rarely leave bad reviews. Sometimes people are just having a rough day. As a French Quar","useful":0,"cool":0},"5vf5F40U7xfiCU-IK3pOKA":{"text":"I've been to a lot of bars but this bar is not for brown folks or anyone of color. From th","useful":0,"cool":0},"pruC3WtZ3Vl3hpamJkEbrQ":{"text":"Not too great of service, the bartender seemed irritated with his job.  Had a burger and i","useful":1,"cool":0},"DA8gAhcXdlpLn2DkZ0gtcg":{"text":"If you're looking for a quick bite to eat far from all the craziness but still close enoug","useful":5,"cool":0},"MWDgsfthL4ipYpeSpnV3iA":{"text":"Great place to relax...  Nothing moves fast...\n\nIf you expect to be there for 1-2 hours to","useful":0,"cool":0}}