{"momhotdtOUP2NMDVUIQq6Q":{"text":"Very good lunch!  When recommended as I stayed in hotel, my first thought was, \"not a hote","useful":0,"cool":0},"pv_Y7JPpkLsC8jsUUTjZig":{"text":"Was in News Orleans at a conference in the hotel this is located in and thought we would g","useful":0,"cool":0},"x5deinX9SmkOBKAqBOQEYQ":{"text":"Very nice New Orleans-style dinner with my friends. Located on the ground floor of our hot","useful":0,"cool":0},"VPoFCWMBv0dsO1TEZUuuRg":{"text":"Borgne pronounced Born was excellent! The service was on point and the food was mouth wate","useful":1,"cool":0},"DYgLZZfWBQwuSzVTktZtHQ":{"text":"Amazing food! Fish in the bag, seafood stuffed trout; both amazing. 3 time coming and have","useful":0,"cool":0},"TIXmEsiUIHsDfq0G7gMgOA":{"text":"Amazing food in a very cool setting. Our server was very informative and easy to talk to. ","useful":0,"cool":0},"A8m-EVHpLLeH9_PpOhOh4w":{"text":"Crab bisque is amazing!  Fish in a bag was great!  Strawberry crumble was heaven!  Service","useful":0,"cool":0},"NXx0XDHv3H8ecrjWSWyUog":{"text":"I'm a John Besh fan but this is probably my least favorite of his endeavors. They have exc","useful":1,"cool":1},"QDZ4GU-NGzZPw20i2gZExA":{"text":"The duck poppers are great, and the fish is very fresh, but you need to remember 3 words: ","useful":1,"cool":1},"WRgh83HCEnN-OrylCUsDHg":{"text":"Be sure to check out the lunch special online before you head to Borgne. They have a diffe","useful":1,"cool":0},"TYTXbTfnR5CdkvuZuak8hg":{"text":"Great location, and great atmosphere! Very contemporary feeling, and great authentic LA Se","useful":0,"cool":0},"9323rYZ6qbCUhz0UMGgocw":{"text":"The food was excellent. We tried many dishes and passed them around to maximize enjoyment.","useful":0,"cool":0},"zMOh_RGHAZIRiSMDhW8LFA":{"text":"Great food and a great atmosphere. A great seafood restaurant. Yet another win for John Be","useful":0,"cool":0},"dfCPNgKuycYhx_uuHgMquA":{"text":"My favorite PoBoy ever. A highlight of any trip to New Orleans, especially for a football ","useful":0,"cool":0},"qDG02RJ5fxd_t-DPOd08nA":{"text":"Yummy, stunning, subtle food.  Excellent, unpretentious and professional service.  I could","useful":0,"cool":0},"3H9ojevhRiyXGBvMNFb3OQ":{"text":"Everything was great from the broiled oysters, to the catfish po-boy, black drum fish, cra","useful":0,"cool":0},"7FaoPC21CVcKG1CxpG5vcw":{"text":"Meh.  Hits: grilled octopus gnocchi, shrimp toast.  Miss: roasted fish smothered in pecans","useful":0,"cool":0},"uKZRO8GDjMs8C0AVIjRaTg":{"text":"Was in town looking for a lunch place, decided to come here, and was not disappointed!  Th","useful":0,"cool":0},"4qUlYVfxZ99wvkSCPLSISQ":{"text":"Things are either really good or really bad if you can't wait to write a Yelp review after","useful":1,"cool":0},"V4oTD0Tc-OivKMZnW0oBGQ":{"text":"Great experience. \n\nHad several of the appetizers - duck poppers is the best. All excellen","useful":1,"cool":0},"YjE3GiwrGjIm6SbSkrnK-g":{"text":"Reservations were made through Open Table for Saturday night, March 15. We were seated and","useful":0,"cool":0},"OGUeEq8vNpgLhmdhX0dpuw":{"text":"Red Beans and Rice best in NOLA. Was there for lunch special today and sure enough, they b","useful":0,"cool":0},"b36S6Q3LZs9LM77NIQ2vIg":{"text":"Excellent food and service in a laid back setting. Cool bar. We had several apps to note: ","useful":0,"cool":0},"qDyBkzhgqirR-2oLkGSb9Q":{"text":"We booked a dinner for a very LARGE group.  I believe we had around 20 folks on a single r","useful":1,"cool":1},"mVelCF5N3kMTB4A8WTAXgw":{"text":"We ended up at Borgne on a spontaneous date night. We learned the kid would have a playdat","useful":9,"cool":6},"tBAR6oIaLi78lxdg_FIXHQ":{"text":"I travel nearly a 100 nights a year and am a complete foodie.  I truly enjoy coming to NOL","useful":0,"cool":0},"EWk_yFSQ52iUmNzwyoS-dg":{"text":"I've been here twice, once solo and ate at the bar (big screen TVs, perfect for watching s","useful":0,"cool":0},"rzeEk24fOUxKkItrBdQ4pg":{"text":"OMG!! Duck jalapeño popers wrapped in bacon. I've been eating here all week. I'm  here wor","useful":0,"cool":0},"d-uhQAfbvJ0EQby3svVNgg":{"text":"Surprisingly great!! I ordered the fish in a bag and wow, so good! Lots of flavor and cook","useful":1,"cool":1},"GfqXhYe4iLD7VkUR_uVSrw":{"text":"Chef Brian Landry was so incredibly charming and nice to our table of 8 visiting from Texa","useful":0,"cool":0},"fOVLaqJ41EbJKsJ0Vi5txA":{"text":"Great place for happy hour!!\nTry the Rum Punch!\nThe small plates on the hh menu were incre","useful":0,"cool":0},"knyw0sFQhJLlUNQfphk28A":{"text":"Their canery island ice pick was one of the best drinks I got in NOLA. I love honey rum an","useful":1,"cool":0},"x27oYAj20RyIF8QPDcbCZg":{"text":"Came here while visiting New Orleans and just like every other place I went to (I guess I ","useful":0,"cool":0},"PteYtynjEiyRf2oTC5_amw":{"text":"This restaurant is primarly the bar for the giant Hyatt. If there is a concert or special ","useful":0,"cool":0},"QEl-HnJCMj7HtjRhTrJ_Tw":{"text":"Been here quite a few times and always had a great experience. My favorite is their hanger","useful":0,"cool":0},"OoWkVB4EI-7JLf4mFT3XXA":{"text":"Food was superbly prepared. Good portions and well-presented. Asked for a larger table (4-","useful":0,"cool":0},"rcJ88SS1E2XvcNWld1BjTQ":{"text":"Service was great and I loved the layout, had a neat bar.  Everyone enjoyed their food, on","useful":0,"cool":0},"IwoyQC3pmeZK9RHcZ1kshw":{"text":"I am a big fan of John Besh and during a recent visit to NOLA looked forward to visiting B","useful":4,"cool":1},"g8OQ3N4kp6mVs5GsKWmyDQ":{"text":"My girlfriends and I were beat from Jazz Fest and didn't want to leave the hotel so we opt","useful":1,"cool":1},"fdOgJdb5mSGRiNAQdnnN-A":{"text":"Stopped in for lunch while in town for business.  Had the Local Greens Salad with some fri","useful":0,"cool":0},"R95ppOX7Kcxc-RnfLyZQ4Q":{"text":"Great special menu for happy hour!  Totally enjoyed the jalapeno fried turkey necks.  Had ","useful":0,"cool":0},"uWa7Dp2bskMCePlLrJnJEg":{"text":"I only recommend dishes that are extremely good. I just finished the duck poppers on a sca","useful":1,"cool":0},"6Z-2lGHiShOX-YrahQxnnA":{"text":"This will have to be a short one until I get home when I have more time todo it justice. C","useful":1,"cool":0},"YdoCfGrhQ-KEWgw4VVesPg":{"text":"The fish was fresh, the food was considerably better than I expected from this restaurant ","useful":1,"cool":0},"MXOjoqQM3VHavKiyP5aD2Q":{"text":"i haven't had a bad food experience here yet, despite the seeming constant crowd. Lunch sp","useful":2,"cool":1},"IlQf6N3syx2AHTPKzSd54g":{"text":"We have not had a lot of success with John Besh Restaurants, but we were attending a conve","useful":0,"cool":0},"nKgai9wZna0vQLdNJwk-Lg":{"text":"I am currently eating my left over risotto and it's so good (again) I thought I should lea","useful":0,"cool":0},"huYVu0eHGSB9iEYJ1PwukA":{"text":"INCREDIBLE SERVICE!!!!! Arrived in tutus for my bachelorette party. The manager served us ","useful":0,"cool":0},"bpy0cwGa7TNgqp4LGJda6g":{"text":"While seated in the lobby, of the Hyatt Regency, I decided to pull up lunch places, via Ye","useful":0,"cool":0},"4tsYgmxJHpMmmzctIB69fQ":{"text":"This is my second dining experience at Borgne and it was excellent. I had an entree - Drum","useful":0,"cool":0},"blszkTpW6TBcRndskXIW8g":{"text":"Got the seafood Paella-- extremely disappointed but I gave them 3 stars because the waitor","useful":0,"cool":0},"yeHG1swrW_YIsKUQsH29CQ":{"text":"I've had both the crispy pork shank and the fish in bag ( on separate occasions). Both are","useful":2,"cool":0},"uwGRscjO0hqS12mGb6hoqg":{"text":"As long time New Orleans residents, we are familiar with the highs and lows of the Besh re","useful":3,"cool":0},"-mTrlFQEtWMXmKxAflegsQ":{"text":"The food was decent. I had the oyster spaghetti and it was pretty tasty. My wife had the s","useful":0,"cool":0},"Vx8qNpSsMdoaYA2IIvR-ig":{"text":"Really great. Great drinks. Great duck poppers great pork shanks. Great dessert. No compla","useful":1,"cool":1},"hO2CzOY3qLg2Kgjb_36yMw":{"text":"Great atmosphere. Relaxed dining and a good place for kids too. Menus are clipboards, diff","useful":0,"cool":0},"Cp_2HcEOsOKAhGT9Q3gW8g":{"text":"In two words, \"Orgasmically delicious.\"  If you are in NOLA, you have got to do your taste","useful":0,"cool":0},"siyww7KqLFgERnblJrSaoQ":{"text":"I attended a party here and we had a special menu, so it was great food but it may be a sp","useful":1,"cool":1},"TJqt8dVa8z3xhZ3GBst-ww":{"text":"Just left New Orleans about 2 days ago and I am still thinking about my meal from Borgne. ","useful":2,"cool":1},"ZFXzw4bS30lE3GtaWV3AXA":{"text":"great food and service. twice baked chicken amazingly tasty and my hub and I shared, plent","useful":0,"cool":0},"8jE3RZZMHz1htWf5iOK-pQ":{"text":"Best meal so far in NOLA. Maybe the best swordfish steak ever. This is apparently one of f","useful":1,"cool":0},"mYP9gzhFLLTxko2tTV9rLQ":{"text":"Wanted to love it. But I didn't.  Garlic shrimp poboy was good and spicy but I didn't even","useful":0,"cool":0},"LN9p_qBofWAXLz-ewk0jGQ":{"text":"GREAT FOOD!  The place is inside the Hyatt Regency and it is actually OK looking.  I mean ","useful":0,"cool":0},"M-IDtYIN21mJFUgi63ZA4g":{"text":"Came here while we were on vacation in New Orleans for my birthday, we heard such great th","useful":0,"cool":0},"riopSCo_57oBXfcDp6Ej7w":{"text":"You can't throw a stone in NOLA without hitting a John Besh restaurant. Borne is a reason ","useful":0,"cool":0},"s1r56Liitp1CyylWP8ZIKg":{"text":"This restaurant just opened and is a must try. \n\nThe atmosphere is great and decor is cool","useful":1,"cool":0},"EcMv0Y-2bSw1Dw1ok_2VFQ":{"text":"John Besh should NOT put his name to this restaurant. \nUnfortunately, it is the first  pla","useful":1,"cool":0},"qqOJz7J5rpNrWPhrrhhHBw":{"text":"Nice environment. The fried oyster BLT on their lunch menu is absolutely amazing. The othe","useful":0,"cool":0},"3cKi2ZfDGH1ABStM3cMbmg":{"text":"This was my last \"snack\" before heading back to Denver and it was filling, tasty and satis","useful":0,"cool":0},"Qb6cRaUNhThpbdjBeRmJlA":{"text":"Yum! I wasnt too enthused to try a restaurant in a vacation spot inside a hotel but i was ","useful":0,"cool":0},"Rmarn4RwAut83oxdBKf0hA":{"text":"Wow!  Our experience here was so great!  First of all, they were so nice and accommodating","useful":0,"cool":0},"YopajpQCExaSYgeeFJfNQQ":{"text":"I was staying at the Hyatt Regency for a course, and I wanted to have a good meal. Since i","useful":0,"cool":0},"FbEjACc0USUXrwP_ZyzEhw":{"text":"Absolutely amazing! I usually stay away from hotel restaurants but this was recommended by","useful":0,"cool":0},"zrJPIGXQM00lgrRL7n-m8Q":{"text":"We went with a large table for a Christmas dinner and every last one of us loved it! we ar","useful":0,"cool":0},"Hi5KWy_rJez7fUv2SBK1Ww":{"text":"We ate here two out of three nights during a convention last year. Back to meet friends fo","useful":0,"cool":0},"W2bareyQ87LSFmBVhn_tnA":{"text":"The seafood here is amazing!!! It is fresh and the shrimp was to die for!!!  The salad was","useful":0,"cool":0},"hc6uji9pADptgQ-4grqkiw":{"text":"The food was excellent . We had the duck poppers, shrimp and corn bisque. I had the stuffe","useful":1,"cool":0},"lOSME4q_fRpgpP_Kc3yD3w":{"text":"I'm not completely sure how to rate this place. I tasted the food but not completely. Some","useful":0,"cool":0},"Y-QK5bncpvFXSqYGA4oHYQ":{"text":"Nice decor, $11 bloody Mary's; on our way to the Saints vs Bronco game with Eve. This was ","useful":0,"cool":0},"-y1OnPQOxnhdjYEFXPEZBQ":{"text":"I read a lot of good press for John Besh's newest restaurant but was fairly disappointed. ","useful":0,"cool":0},"p_UPcyccT3lssXuTHF7LYA":{"text":"We had oyster stee, a shrimp po' boy, and thursday's special, pork ropa vieja. All was fan","useful":0,"cool":0},"3r8J3qHoXFzIA1wMpt6BEg":{"text":"Overall food was good but giving three stars due to value. \n\nMy fiancé and I came here for","useful":0,"cool":0},"RujpVumwSf4lyfb6sqmWIw":{"text":"The fish in the bag and stuffed flounder were fantastic.  The oysters were okay.  The gril","useful":0,"cool":0},"ecbQVWfEVwoNlVtpUrNebQ":{"text":"We had dinner for our group before a convention we were attending. The service was great, ","useful":2,"cool":2},"aTnYwKYtJ_vMJB7dhW0nOA":{"text":"Food was excellent. Definitely would recommend if your are staying at the Hyatt Regency Ho","useful":0,"cool":0},"B0zFT9MEdsVOUQnVUVDqCA":{"text":"John Besh put his name on this restaurant but it's hard to believe he put much time into m","useful":6,"cool":2},"XmHu0r23p79O1tx-gAX0tQ":{"text":"Impressive for a hotel restaurant. Had the fried oyster and pork belly sandwich The pork b","useful":0,"cool":0},"7a-0SBf4taDJ3X36A0JNJg":{"text":"Awesome time there. The server Katie was knowledgeable and attentive, the timing of our co","useful":0,"cool":1},"gyvcpmdkh6b1xmiN40c_Ig":{"text":"So many things right with Borgne that I don't know where to start! \n\nExecutive Chef Brian ","useful":0,"cool":0},"JUvAhm9k0oKs1T8BRr6VgA":{"text":"The food is expensive but tasted great (best calamari I've ever had). Would probably pass ","useful":0,"cool":0},"h-ytIJC-dm0w8pgOJKG9Pg":{"text":"Four stars for lunch. About ten bucks for something really good (check their website to se","useful":2,"cool":3},"sTXnJMgUibECbQHZlaXBEA":{"text":"Chef John Besh is a curious individual; I always hesitate to recommend him (he's like a Wo","useful":3,"cool":0},"d44638t39qUiE9u7J-478A":{"text":"If you want a taste of contemporary New Orleans cuisine, this is it. From the food to the ","useful":3,"cool":2},"mi5gYU3AD9p0FFnxUt9dTg":{"text":"Do yourself a favor and skip Borgne and go to Luke, Acme Oyster House, Mr. B's, Cochon or ","useful":4,"cool":0},"-kc0dMD5mdZhL4VfYpExRA":{"text":"Being an oyster and general seafood fan, Borgne appeals to both of these as well as keepin","useful":1,"cool":1},"WeOMAs9_JZ_DxHigqH67GA":{"text":"Great bartender, good oysters, not your average \"hotel bar/restaurant\" so bravo New Orlean","useful":0,"cool":0},"tEmdxuAK3cdRntXe4QxuAw":{"text":"Another amazing experience at Bourne with our water John shenamen he was great.  The food ","useful":1,"cool":0},"7aDsQxkQJYrNENIyvWBh0Q":{"text":"This restaurant is BY FAR one of my favorites! I would have given it 5 stars if only...wel","useful":2,"cool":1},"kHqwEiGf5xee7CqQntqW9g":{"text":"Food Amazing -service was stellar!!! I definitely will be back!!! The Fried Shrimp PoBoy a","useful":0,"cool":0},"fxdHVXHLI3hTdDBhgAqAvA":{"text":"Terrific service in the bar for lunch, and we all enjoyed an attractive, good tasting lunc","useful":0,"cool":0},"JpTWJYXVeIEYEd6rWzElOA":{"text":"Have a great happy hour and cool atmosphere! I've come many times during happy hour and tr","useful":0,"cool":0},"mt0Zi0bZ3GBmt299CAEHAA":{"text":"While staying at the Hyatt came here for two late night visits: one for Oysters and the ot","useful":0,"cool":0},"nGwjvjAcGtPHwSuigH8nJQ":{"text":"Excelente. Tudo muito bom.  Fica dentro do Hyatt mas tem acesso livre. Vale à pena.","useful":0,"cool":0},"DrtGPxUKYq0Lzu-p5FjWLw":{"text":"Great menu and service.  The fried eggplant with this whipped mahon cheese dip was awesome","useful":1,"cool":0},"x1ghxO2YeoV9bXPle2JIeA":{"text":"We loved our server Cody and really enjoyed our food. We were disappointed the place wasn'","useful":1,"cool":1},"IP5ESqOyd7DMXSvkYLTeSQ":{"text":"I absolutely loved this place. The food was delicious, the atmosphere was perfect and the ","useful":0,"cool":0},"afPK8H4RyNWKnGD3AHXVaA":{"text":"Average hotel restaurant. Bland atmosphere and ok food. Sides were uninspired and the fish","useful":0,"cool":0},"0nsfhtEf10ZpIsYhHv0KKw":{"text":"Amazing food and dessert. The Black Drum is incredible. A\nLittle noisy but that's about to","useful":0,"cool":0},"O9YWs7wut05HKKEp5Hm9dg":{"text":"So many great things to say about this restaurant ! Love the atmosphere, for starters. App","useful":0,"cool":1},"Fe273UHFvtZTvSqeRYG4xw":{"text":"This place is good.  Delicious fresh oysters, intensely flavorful grilled octopus, and qui","useful":0,"cool":0},"XIin2RxskZ2swgOpsTGlKg":{"text":"Quite possibly the best seafood in New Orleans. Menu choices change, which is always a sig","useful":1,"cool":0},"DcuipicLYlHV8SfN0idvdA":{"text":"I'm visiting New Orleans for the weekend for a medical conference. Decided to try this pla","useful":0,"cool":0},"vtf5OdYjxnfi9XVtNbqV6w":{"text":"The service was fantastic here, very nice and friendly. The ambiance was also quite nice. ","useful":0,"cool":0},"pT-_MpP-qpcsHHZZZYwG7w":{"text":"The experience was less than satisfying. We reserved the spot for our anniversary dinner, ","useful":0,"cool":0},"fUAji37MY_epgrb7W2T7qw":{"text":"Disappointed after hearing great things about it. The fish ordered was over salted and the","useful":0,"cool":0},"QdAt-rN4wu6XcQ2eLAfYIg":{"text":"I feel like i'm letting a secret out of the bag and I almost regret it. The happy hour her","useful":2,"cool":1},"wRol_-9W9FxlSy_JiXGqsQ":{"text":"This was our first place to have lunch when we made it to New Orleans. Great food great se","useful":0,"cool":0},"NCvbywRSj8k7FiIf3y0ujg":{"text":"Wow.     Great ambiance.  DRinks.  Wait staff.   Calamari, crabs, salad, fish in a bag wer","useful":0,"cool":0},"rUy6gykxgkdypIFMinx48g":{"text":"I've been a big fan of Chef John Besh for years, but this was my first opportunity to have","useful":8,"cool":5},"aNjrbURfvSomx6woWQVj_g":{"text":"Tapas were good. Octopus with the humus was very good. Liked the pork empanadas  service w","useful":1,"cool":0},"NHVw9VE46QR0NtJFZheaaQ":{"text":"I stumbled across Borgne at the hotel I was speaking at this week. My lunch was hands down","useful":0,"cool":0},"jLoYP8-_jd4vckIHdN0HWg":{"text":"Came with a party of 10 - promptly seated, and the wait staff was great - well-informed, a","useful":0,"cool":0},"ZGS2VbXbG2rEo0V9EBQ9Zg":{"text":"We booked a party of 21, preordered some appetizers before arriving, then sat and had some","useful":2,"cool":1},"KDVDEk2W2UgmWFuelI3t7g":{"text":"Had Christmas dinner there with family. The serves would bring out your food without clear","useful":0,"cool":0},"U_Vn2LEs-g9R4LFZvVH9jA":{"text":"Terrific happy hour daily from 3-6 with $7 carafes of sangria among other reduced drink pr","useful":0,"cool":0},"UReLcYdrZIv7JfFSJAr8Uw":{"text":"I was staying at the Hyatt Regency and I ate on valentines day on this restaurant and I wa","useful":0,"cool":0},"FaxA9wfcXp4QInEo0I0hKw":{"text":"Went here to watch Saints/Eagles and celebrate my birthday.  It belongs in the discussion ","useful":0,"cool":0},"A4IHkoE0AZ-Mg08-lI6Aog":{"text":"The best meal we had in NOLA.  In the CBD so it has more room.   Food was excellent, servi","useful":0,"cool":0},"eArFIIDTRg3FJgHwY7aZAQ":{"text":"I had the half dozen row oysters as an appetizer was very good and the place is so nice an","useful":0,"cool":0},"R6pULLAcJtklWxO7WtHYYg":{"text":"Excellent HH!!! It's from 3-6 and I got there around 5. Easy enough to park out front or n","useful":0,"cool":0},"4yT4t_I4E4jLqnb_e2w_cA":{"text":"Came here to kill some time between visits with my mother in the hospital. Im really glad ","useful":5,"cool":3},"1JfyQh4QE6LlKZ0eoWSW_Q":{"text":"Highlights:\n\nDuck Poppers: HOLY CRAP! Culinarily one of the most impressive dishes I've ev","useful":0,"cool":0},"xRWWv_sl-SjIOGxaoGOElw":{"text":"We had heard mixed reviews but decided to eat here mainly because of the location-attendin","useful":0,"cool":0},"5n5GH6U7Zt0j9S-OqvHSVA":{"text":"Ridiculously good food and waiter!\n\nWe read that the apps & desserts stole the show here s","useful":2,"cool":0},"1DaQzLn_JPMkFB3NtEfodQ":{"text":"All I can say is don't come at between lunch and dinner. I would describe the service as h","useful":1,"cool":1},"BjVE7aHCaBbqLgMgB4qPzQ":{"text":"I went to Borgne on Friday, Feb. 23 with my boyfriend for dinner. We didn't have reservati","useful":1,"cool":1},"w0wTN8FtlI9BEwlebihR_A":{"text":"Only giving 2 stars because I have give at least one star and a second for our server. I h","useful":0,"cool":0},"KlOJ0G5DIWbg1MB8yn2R5Q":{"text":"Love everything about this place. Our waiter Patrick was fantastic and the food was extrem","useful":0,"cool":0},"j_wtP4yupMgP8FKhZE24_Q":{"text":"Had calamari and shrimp toast for appetizers. Absolutely delicious!! Then had pork chop wi","useful":1,"cool":0},"2Wh4JCogy-SzpiTrQMl3Dg":{"text":"Overall a good experience at this restaurant. Our server had a great sense of humor, was a","useful":1,"cool":0},"odz6eBUFqqMhBQnLErsz0g":{"text":"The menu is diverse and celebrates authentic New Orleans fare. We sampled several menu ite","useful":0,"cool":1},"c5N1FQloPM4mr_oTnOz_fA":{"text":"Our waitress was very attentive and helpful. I had the stuffed flounder which was good but","useful":0,"cool":0},"0Pj_2djk64A5rHvs18UkHw":{"text":"The duck poppers were very good but not spicy.  I had the house oysters and they were larg","useful":0,"cool":0},"rnmQyXyLJv2aKK4YAgABUQ":{"text":"If you come here for lunch, definitely try to BBQ shrimp po boy.  There is nothing light o","useful":0,"cool":0},"dDMd4MaagjmUIXxtDBF4Uw":{"text":"Delicious! The service was impeccable from giving recommendations on the menu to telling u","useful":0,"cool":0},"us034RrWQydN_0vSDEWTdA":{"text":"Went with 12 people for brunch. Tried their special, rabbit gumbo. It was okay. Had a coup","useful":0,"cool":0},"cVh_7k9hPnsCdkVNM3xCOg":{"text":"This restaurant is in the lobby of the Hyatt Regency, and was recommended to me by the con","useful":0,"cool":0},"HxMxEXvI9fL8BeiaEtgI9w":{"text":"Lifesaving hangover meal done right!  Post night one of Jazzfest...hurting for sure. Frien","useful":0,"cool":0},"xHiozqpGneDkO46XzGH1ZA":{"text":"Not impressed \nServer was horrible \nMeal was sub par\nOnly thing worth the 2 stars was the ","useful":0,"cool":0},"Pn84ulHYkoWAKfBjSPibtQ":{"text":"I really wanted this to be an awesome experience. I love John Besh. Really do. We had the ","useful":1,"cool":0},"lGcyv3ylfCAZFWTLnt5DNg":{"text":"Nasty .. Not appetizing at all. Not seasoned.\nEgghh. Won't return.\nThe menu is wack.\nI'm a","useful":0,"cool":0},"miHYTkDRffKczC1Zqdj7hg":{"text":"First time visit and I will return.  Start with a nice selection of local brews on tap.  T","useful":0,"cool":0},"YRTEjK5Y2v5NUMPQ0cV7xw":{"text":"Ambiance sympa pour la veille de Noël, design au goût du jour, très bon service un peu tro","useful":0,"cool":0},"2HaHmlM-X5iNvFalWJoacg":{"text":"Borgne was a big disappointment, especially considering how good dinner was a couple of ni","useful":1,"cool":0},"o3MfZb26LOZJ1DwpfrEOyg":{"text":"Tonight my wife and I (and two out of town guests) gave Borgne its fifth and final chance.","useful":1,"cool":0},"NNDTxFGg22DnU6mU9qmurg":{"text":"We came here on Christmas Day around 7pm for dinner and was sent away because the restaura","useful":2,"cool":0},"2ykK3qxii_IJApzLtne1Mg":{"text":"This was a great choice, was impressed with the food had the Duck Poppers and the grilled ","useful":0,"cool":0},"563wfs2LcBcB7Njuxo_qaw":{"text":"We ate here for a casual lunch on a Saturday. No one else was really there except for a fe","useful":0,"cool":0},"FgvldIDsV0bY6V9k07rzkg":{"text":"My friends and I ate here tonight and everything was amazing! Our waitress, Marny (?) was ","useful":1,"cool":2},"jBSWUofwDO8bfkN0Q5M70Q":{"text":"I came here because my girlfriend's parents were staying in the Hyatt. I have always heard","useful":0,"cool":0},"KcwGEbhvUOu7v7BGkTn26w":{"text":"Hoped it would be better, tried the Duck Poppers, Pork Empanadas, Crab Croquettes and Stuf","useful":2,"cool":0},"sk_1SiAjROjZhdi2nABN9A":{"text":"Our first night in New Orleans we wanted to stay close to the hotel so we decided to eat i","useful":1,"cool":0},"B2-466rLf9l9VlwMLsuTdA":{"text":"Very good food and service. We had a rather large party and everything was excellent. The ","useful":0,"cool":0},"j0BntaZw_DTQx1Cn_-AoFw":{"text":"Fantastic happy hour experience here. I ordered two beers on draft ($4 each)\n1. Gnarley Ba","useful":0,"cool":0},"RW1hI3N6r_mlfSqDrDd7zw":{"text":"Great place to eat! Was a nice environment waitress treat me like a queen.  Will go back t","useful":0,"cool":0},"-p3lkRiO57yluH3lB34oVw":{"text":"Sadly I never had a chance to taste their food\nI was staying at the hotel where the Borgne","useful":1,"cool":0},"nwDpT8y09X55H6nR3Hefbg":{"text":"Yumyumyum!\n\nCame here with my husband, aunt, uncle, and cousin.  We were super early for o","useful":0,"cool":0},"PDZ2YtT5W3K362Ct9bGO4A":{"text":"Nice quality place to come and cool my jets after working. Staff is splendid and the Parki","useful":1,"cool":0},"xW_gBV3oul2M-B6THn3yPw":{"text":"This is part I of two reviews. For the second review you will need to look up August. It w","useful":2,"cool":0},"IpswOZbhXYdQa_njWMobSw":{"text":"It's not much to look at from the street, but the ambience inside improves. \n\nThe food is ","useful":1,"cool":0},"qTysfEPCXuqWxdPxfpCagQ":{"text":"Short review:\n\nGulf oysters-A Excellent!\n\nRomaine salads-B (don't serve the brown or wilte","useful":1,"cool":0},"JPgyOrDs7ZcyG5ukhSvP5A":{"text":"Came for lunch around 1:00pm on a Monday, and was a couple large business groups wrapping ","useful":0,"cool":0},"v-27GUFHSj25TEJiswl20Q":{"text":"Overpriced apps.  The bacon wrapped duck was ok, the shrimp toast was very, very greasy, a","useful":2,"cool":0},"yx_EP3UhI7-eFOngidfHmw":{"text":"I love coming here - it's a great place to bring people visiting from out of town. The amb","useful":1,"cool":0},"k-TJpWloICnXcld_u7hxyg":{"text":"Great place for \"foodies\" and craft beer lovers. Outstanding shrimp toast. Had to order tw","useful":0,"cool":0},"KiErM82c9ZYkKlprkHzQBQ":{"text":"Dined here twice this week. A little loud and frenzied at times but the food! Do not pass ","useful":0,"cool":0},"QyJKR9eYgV7CgcV85xnfZA":{"text":"New in yelp. First review. Ordered salad and whole seafood stuffed flounder with one glass","useful":0,"cool":0},"KDBe3El0SqI56eZFtN6olg":{"text":"- The grilled octopus was pretty good.  The hummus and capers that it was sitting on were ","useful":0,"cool":0},"X1hNyLMJUFajgp07haNv2A":{"text":"Great menu, the lunch specials are a great deal. \nService is quick and friendly. \nThe 'Fis","useful":0,"cool":0},"niUjGuLkPw3xZLmjfKD1dA":{"text":"We went to this place twice.  We ordered tapas one day and was exceptional.  The next day ","useful":0,"cool":0},"Woopz-d_N9ed3hx9ML-1Jw":{"text":"Awesome.  I had the seafood platter, perfectly cooked and delicious.  My co- workers had t","useful":0,"cool":0},"ZVv7jVA5q9ElIa_7r2yfuA":{"text":"Great place for lunch and dinner. We were staying at the Hyatt where we are lucky enough t","useful":3,"cool":3},"6g4ko567Pb0_Wk5hZCjD-g":{"text":"Food is good. Happy hour is a great deal. The service is HORRENDOUS! The bartenders avoid ","useful":0,"cool":0},"tVm2MEbKjT8je4TBWcV6Gw":{"text":"John Besh. This was the main reason we visited this restaurant. Also it was raining out, w","useful":0,"cool":0},"iOA_4BAREISfhW7VumDzTA":{"text":"The food was just amazing and the staff extremly friendly and the customer service excelle","useful":0,"cool":0},"Z7QjmkT2q7__xugC8gAgPQ":{"text":"HAd our class dinner there on Thursday nigh! The drinks were great, the food was awesome! ","useful":1,"cool":1},"2KoLGPrpipxuLFTNEPfINw":{"text":"Wow, our best food in NOLA so far! And happened upon 3-6pm happy hour, $5 apps and 1/2 pri","useful":0,"cool":0},"lwiFc8miyuhKXHZ77IWSWw":{"text":"When we walked in we were greeted by some very delicious smelling food. The hostess and se","useful":0,"cool":0},"XWqBloHSfKo9C1D9JJRp-Q":{"text":"Awesome Awesome Awesome!!!   Great food and friendly service.  Took clients here for lunch","useful":0,"cool":0},"4c34pmCxHW-qWDK30qUf-A":{"text":"Everything about this restaurant is spectacular.  The casual and cozy atmosphere coupled w","useful":0,"cool":0},"LyL6N3QJKzUQPvOLOLo9rQ":{"text":"The food was generally good, though not exceptional... We had the shrimp toast which was t","useful":0,"cool":0},"SDAEkqo3b8OTIDMj7Y-oGQ":{"text":"Not the worst I have ever had, but definitely not the best. John Besh could have done so m","useful":2,"cool":1},"lz5bEMRM4nlr8HTfssrkIQ":{"text":"Enjoyed the Bass covered with a pecan and crawfish sauce. Really good food but overpriced ","useful":0,"cool":0},"O_fSHDt8J6JLrdSdTrLNfQ":{"text":"During our short time in New Orleans, I knew I HAD to visit a John Besh restaurant. Lackin","useful":2,"cool":0},"4s6EJ2SXP5-SWPFVpJ2Elg":{"text":"Delicious food, well prepared.  Good service. Noisy tvs so we sat as far from the bar as p","useful":0,"cool":0},"w5rnsvKZkknPsymhUQJicw":{"text":"Closer to a 3.5 for me,  I had high expectations (considering its a Besh restaurant) that ","useful":0,"cool":0},"CyeNrDQkLHwAbauhBTm6YA":{"text":"Excellent service! My server did a thorough rundown of local beers on the menu and was spo","useful":1,"cool":1},"mpmO9TomFHxVLXrW205MBw":{"text":"There's a limited dinner menu, but full of solid choices. Try the cauliflower soup as an a","useful":0,"cool":0},"tGAVr8QOtwLUs9lj-VTCHg":{"text":"Shrimp toast, turkey necks, octopus, and soft shelled crab to top it off. I'm leaving here","useful":1,"cool":0},"ROO1mBpwpLwFogrtk1F_3Q":{"text":"The yellow tomato gazpacho soup was good. Great flavor but a bit too salty. When I was don","useful":0,"cool":0},"4zhfjqvwKFnGilKmn5m3bQ":{"text":"The ambiance is cool but casual. I made a reservation through open table and we were seate","useful":0,"cool":0},"FjlkUuba1xmlQLMLQAYmTQ":{"text":"Fantastic meal. Particularly fond of the duck wrapped in bacon appetizer, the pork empanad","useful":0,"cool":0},"5f7guxMcTd3TdNs-L6qdtQ":{"text":"John Besh hits another one out of the park with BORGNE! Oyster appetizers and poyboy were ","useful":1,"cool":0},"FbJQYZ_DEHe-Bz3AnF3cpA":{"text":"I usually avoid hotel restaurants but got into town late and didn't feel like braving a wa","useful":0,"cool":0},"kbb7wENhMlRlV60u8Dxeww":{"text":"I have been here in the past and was not impressed.  I went here for lunch on Saints Sunda","useful":7,"cool":2},"6abXq2131ar9y2o9t2GOKw":{"text":"Really amazing food at Borgne.  Take the suggestions on fishes from the really nice waiter","useful":0,"cool":0},"RTTP7vM_3UJLMXMf6qG61w":{"text":"You must try the Prince Albert!  LOL - Actual dessert's name is Prince Albert, anyway, it ","useful":1,"cool":1},"0uAjrIwQRAYfCZ536aED-A":{"text":"We were staying at the hyatt so for us it was super convenient! The duck poppers as appeti","useful":0,"cool":0},"Gqgc1fewfj7YUZoYjaG1bQ":{"text":"While I was visiting New Orleans, local friends took me to dinner at their favorite restau","useful":1,"cool":0},"GZaXj6ywzdzTHSrJ-7aoSQ":{"text":"Dropped by this lobby-level restaurant from John Besh during a conference upstairs for the","useful":0,"cool":0},"Kpye4O-Z-9arvSSi-IeCMQ":{"text":"Stopped in for one of the famed John Besh Happy Hours at Borgne the offering is not as goo","useful":2,"cool":1},"roGL3yjMcr6N6CQ0F-yPuA":{"text":"First of all, let me say that I am grateful for the fact that they are open for Thanksgivi","useful":0,"cool":0},"eNcES_DwubS8tnH3jTMbxA":{"text":"This is how it's done!!\n\nThis place is a home run. First dinner was so good that I cancele","useful":0,"cool":0},"VyFD8ykNzxPInLw2uw4zLw":{"text":"Excellent restaurant by John Besh! Chef Brian Landry is an extremely good chef! \nThe waits","useful":0,"cool":0},"yBmtWVe4FGoIIqQQIwEiXQ":{"text":"Why does this place feel so much like a cafeteria? We decided it was the industrial lighti","useful":1,"cool":0},"3-fBCFldySIJ85UjS50o8A":{"text":"I had a reservation for 13 for my friend's bachelorette dinner on a Saturday evening in Ja","useful":1,"cool":1},"ch_3NtdDU1maAAG0dhlKHA":{"text":"Great food.  Got the Oyster Spaghetti and it was awesome.  Only draw back was it was a lit","useful":2,"cool":0},"HUcGL3SZccw25xiQOq1EkA":{"text":"Ratings were pretty good, despite the previous notes about Chef John Besh and being above-","useful":0,"cool":0},"2lnPkh4YHMp8HZpPUTE6NQ":{"text":"Excellent fusion of Creole, Southern and contemporary American. We had a difficult time tr","useful":1,"cool":0},"TDvtX1rcLJhPGrn6C3aBag":{"text":"Very disappointed in this Besh/Landry combo. First off you have to enter the Hotel to ente","useful":0,"cool":0},"YbmovioDrqvV_uFyAC5ZnQ":{"text":"Went 3 times while staying at the Hyatt-Regency on bizness. While it's okay for an in-hote","useful":2,"cool":2},"12dTu5C7TtCZR51jMaq8GA":{"text":"I was at a conference at the hotel this restaurant is located in. I didn't expect much at ","useful":1,"cool":0},"Lchl34sTeneq7uZRjdxNuA":{"text":"Delicious and the atmosphere is fantastic - large open spacious restaurant with amazing fo","useful":0,"cool":0},"N09p_vo7e6hNJU3LjXGJUw":{"text":"Fish in a bag was really great, the bbq poboy was not what I was thinking as I thought it ","useful":0,"cool":0},"nwqbL95QqGLaR1oeib3EDQ":{"text":"Wonderful experience at Borgne for Valentine's Day. Despite the Valentine's Day mayhem, th","useful":0,"cool":0},"zDRzW734XnyD0I-O8VKO8w":{"text":"I have no doubt that I will soon be writing an updated review with an additional star, but","useful":0,"cool":1},"i9tGAaHyNuwjYOFsb2gAZA":{"text":"We came into Bornge today for their happy hour and thoroughly enjoyed our experience here.","useful":0,"cool":0},"NOz-GmGmdlSngsXrPQr1Dw":{"text":"We were amazingly able to get a table without waiting right after a Saints game.  Not sure","useful":0,"cool":0},"HfoSSabLw86gGGb8chWwzQ":{"text":"Borgne (pronounced \"born\") is an odd little place in the Hyatt downtown. It's caught in be","useful":0,"cool":0},"lUTpLBBxK1-VBvmwQV_Tag":{"text":"Went there for a welcome-to-the-company lunch. I was disappointed with the few number of l","useful":0,"cool":0},"-hHnuAlA0GBUN-2Vn-4wfQ":{"text":"This restaurant is inside the Hyatt Regency and was the closest \"nice\" place to eat before","useful":3,"cool":2},"naOVsPgYERX4Eu-_db8gRw":{"text":"Best Cajun food I've had! We started with the duck poppers and the spicy garlic broiled oy","useful":0,"cool":0},"wb8g2UN4-O482v5AmGjNpQ":{"text":"I want to give this place a 4 star, but I do feel some items on the menu fell short. Like ","useful":0,"cool":0},"HY0aNLbjef0AbtSFFMYUwA":{"text":"Visited this restaurant on a Saturday evening.  I made reservations which was helpful. I h","useful":0,"cool":0},"sQRbqxenMRmFCcL83a7JTg":{"text":"We ate here for dinner. The atmosphere is fun and open and very New Orleans (in a good way","useful":0,"cool":0},"Q06onRLmDRtAmI3kZNftfQ":{"text":"Excellent all around, great service, great bar and creative menu.  Fantastic oysters!","useful":0,"cool":0},"yS4KvJY-4n4YmW9UxJkeeA":{"text":"I've eaten here numerous times recently. The oyster spaghetti is absolutely delicious, and","useful":0,"cool":0},"bbq2FaVBhnJqi2-x56XSlQ":{"text":"This place was recommend by a coworker for their gumbo.  It was amazing!  I also got the p","useful":0,"cool":0},"nou7voS8ZO-iKRQsea4ATg":{"text":"Truly fabulous meal! There was a NYE special that was 4 courses and to die for! Great serv","useful":0,"cool":0},"9kcl7ryRbD3v2yTw-4U4cw":{"text":"Stopped in for drinks and appys before a concert and what a treat! The duck poppers, empan","useful":0,"cool":0},"y9MOU4WoUb21_kJyCtSy4g":{"text":"Like many other Besh experiences I've had, this was a mixed bag. First, they have done som","useful":1,"cool":0},"UGsYg8QL38Z9a20Lq3eARw":{"text":"My family and I went to Borgne when I came into town for the Sugar Bowl and my goodness wa","useful":0,"cool":0},"pCbbCgEQ5yu2YylFBUDbMQ":{"text":"Phil is great! We had such a great happy hour. The black drum with lump crab meat was deli","useful":0,"cool":0},"yv1ODuSdBjv-TQngrv2AJQ":{"text":"After searching for restaurants in New Orleans with authentic cajun seafood, a friend sugg","useful":0,"cool":0},"fburIQnMlFD9deydo_GbAw":{"text":"Honestly pretty disappointed at this place and this is not an opinion after just one visit","useful":1,"cool":0},"D6AkgU8z9UZQrj_OKdNu1Q":{"text":"My husband and I decided to try out this new Besh restaurant, as he had fond childhood mem","useful":1,"cool":0},"FJqo1IX5gm033T6eYzR0pA":{"text":"I hadn't even remembered writing a negative review for Borgne, though I do remember how di","useful":0,"cool":0},"UJe7R0nawVlvLT4DXkcuEw":{"text":"I have visited Borgne every time my out-of-state friends come into town. Last week we went","useful":1,"cool":0},"NfESX1sRPfVg4ivVul14yA":{"text":"We came for an early dinner with our daughter, and it was perfect. We find it hard to find","useful":1,"cool":0},"pL_OClEwVh2xQml0v3cPug":{"text":"Went here for lunch. Gumbo was tasty, turkey necks are to die for (first i was afraid to t","useful":0,"cool":0},"uHX2WSMH40xbJiDoSWl4Gg":{"text":"I really really enjoyed the food at this place, however i couldn't really move past the de","useful":0,"cool":0},"poKKD4YB_C6iBlt-9BtFXw":{"text":"We celebrated out friends birthday here. We had a large group and the Black Drum was very ","useful":0,"cool":0},"hsxogmOwLfXDwJMzgyYx4Q":{"text":"The happy hour here is ridiculous - both food and beer! We ordered the entire menu, easy t","useful":1,"cool":1},"5OTGwiF0DYSeH_RP_u9S4A":{"text":"My family and I have embarked on Chef John Besh restaurant tour that started last year wit","useful":2,"cool":2},"mFKG8kkCRd3Tnb2sT9j9AA":{"text":"The food was to die for. Fish in a bag was unbelievable. First time that we had Shrimp Toa","useful":0,"cool":0},"oHzzILYQNuo70diJTuxHcQ":{"text":"Went to Borgne with an out of town guest. First ordered Empanadas, they were outstanding. ","useful":0,"cool":0},"cAJZcAz-Dbba6vvo_moAiA":{"text":"Went for happy hour.  Service was ok but not great even though place was fairly empty.  Th","useful":0,"cool":0},"fqhgzAI_aNuMX2Gx5_Gs7w":{"text":"The ladies at the reception area were friendly, welcoming and tipped the scales for us. We","useful":1,"cool":1},"2XBw2jnkcDALIlCWKmpTIQ":{"text":"I went there with my family of a total 4 person. We ordered 3 four course thing and we wer","useful":1,"cool":0},"1L4htqBCq3ng2d8vmmLAjA":{"text":"I'm not gonna lie, I'm not a huge fan of Borgne. For dinner at least.\n\nI've ordered the ca","useful":0,"cool":0},"nHMgxTelCYFklmZCommP8A":{"text":"I came here just for drinks, so I can't give a review of the food. Got a moscow mule that ","useful":0,"cool":0},"axZPh5ny2s8OhRB1WWoL1w":{"text":"The fish schnitzel! Omg to die for. Best fish dish I have ever had! Duck poppers! Yes!!! E","useful":0,"cool":0},"kZhbDuNe5C0URN0tIFd46A":{"text":"I recently went to Borgne with 12 friends for a Bachelorette dinner. There were no issues ","useful":1,"cool":1},"oVWFB1agl9F_Inyy_HxOng":{"text":"I'm not quire certainly I should expect someone be attentive, I stopped by to order some f","useful":0,"cool":0},"TN-pEqz8CWPQOPl3GaXwwg":{"text":"Pricing is definitely on the high side as well as being more expensive than the upscale bu","useful":0,"cool":0},"q1R3SnvkOTi83DjJ_KUddg":{"text":"Based on other reviews, and since we were staying nearby on Poydras, we made a reservation","useful":1,"cool":0},"pUs7gq8g7s_7m79VOhqdwQ":{"text":"First, the good.  The food was awesome.  We followed the recommendations of many and had t","useful":0,"cool":0},"9xG0pLc_Vfp5yuGlYLSEbQ":{"text":"The location and atmosphere was pleasing but the food was bland. I was in the mood for an ","useful":0,"cool":0},"JizxvXo7OVxX6l5PJZorjA":{"text":"Good food... Wine was ok! Waitstaff was very responsive when a chard of glass was found in","useful":0,"cool":0},"wSgKLbeSordywz6R8_5juQ":{"text":"The first thing I can say, is that the restaurant is not what I expected at all. It's extr","useful":1,"cool":0},"qFKUHYLIxNe4ljmwiYUzRQ":{"text":"3 of us went for the Wednesday lunch special. On their menu the item is listed as \n\n\"Ragou","useful":0,"cool":0},"UPsJD7EukcICKzyNAJj0SA":{"text":"This is the first restaurant I tried while visiting New Orleans for the very first time an","useful":0,"cool":0},"40Cc6bb_znVNYZF6XSiTWA":{"text":"The Oyster pasta was wonderful but a little rich in the end. The blacken swordfish was rea","useful":1,"cool":0},"Vw-Bm4LU-ZXeBsObzz-VBg":{"text":"I was expecting a lot more of this place, and ended up being sort of disappointed.\n\nDecor:","useful":0,"cool":0},"WbZB6glt-fgkIeGoKD0HQw":{"text":"Great place to hit up for Happy Hour.  All their beer is half price, and they have cheap a","useful":0,"cool":1},"0dNYSH6frkE3Vpd1dZKnfg":{"text":"I highly recommend starting with the Duck Poppers and Broiled Oysters. As far as drinks ar","useful":1,"cool":0},"AgYi87abqFCrFN9XNn8hTw":{"text":"Really good lunch specials. Located at the Hyatt by the Superdome. Reasonable prices and c","useful":0,"cool":0},"pGct9zcMraQWnjtz7BLf7Q":{"text":"Don't let the location fool you - this is not your typical hotel restaurant. The food was ","useful":0,"cool":0},"WBGTw9m4-IMSf1uMeXsvnw":{"text":"Wonderful experience. The service was amazing. Our waiter was so personable and answered a","useful":0,"cool":0},"jL75mDzh5ee8t-6D28tu9A":{"text":"Couldn't get a reservation at Domenica so we ended up here.  I'm actually glad this happen","useful":0,"cool":0},"YyxubNZvyZU1DuUuZ7c1qQ":{"text":"Wonderful food and service! Our server, McKenzie, tended to our every need with grace and ","useful":0,"cool":0},"Hspu4925lPXpH6qA46GDiQ":{"text":"I came here for brunch for the first time, and ordered the poached egg special, which was ","useful":0,"cool":0},"U1O_O_Du8Ox8oicjISkZyA":{"text":"The Black Drum was unreal. The freshest oysters I have ever had. Grilled Octopus and Duck ","useful":0,"cool":0},"SXC5rm2bgcYqiEUsQxDiGQ":{"text":"Awkward menu but foods not bad. soft shell crab dish good , Red beans awful","useful":0,"cool":0},"icwzIa2jOcuv2yMNAqpC-w":{"text":"3.75/5 for HH\n\nthis is a solid happy hour option, though i wish it'd be available past 6pm","useful":6,"cool":0},"5c9IorzfXWqll5KsMz-qbg":{"text":"Besh has yet to disappoint me in NOLA. The garlic chicken dish was one of the best chicken","useful":2,"cool":1},"hQkqAbuEGl_nIkCwCKZ2YQ":{"text":"Borgne is a great downtown spot for food, conveniently located on Loyola at the Hyatt next","useful":2,"cool":1},"6HDObwltH_UeFVENyZdHag":{"text":"Came here for lunch on a Friday afternoon.. and I'd have to say, this is not my favorite B","useful":0,"cool":0},"0n3du9aINTtFY0kSbipghw":{"text":"Only been around for a year or two but it may be my favorite John Besh spot. Great place t","useful":0,"cool":0},"KCKT_a1x12mjYny6USRW8g":{"text":"Oh, John Besh, you have done it again. You are most definitely one of the reasons I love N","useful":6,"cool":2},"kjRw6INyFIrAYlU3DUXb5w":{"text":"I took a date to Borgne and sat at the bar prior to dinner.  Unfortunately the bartender (","useful":0,"cool":0},"u4E5bX9YO-5mdD-gvfw1Tg":{"text":"Great restaurant! Usually don't like to eat at restaurants in hotels, but the food was so ","useful":0,"cool":0},"IUywT9NSDcYvDlPBpxKQZg":{"text":"Beshtaurants! Definition is simple August, Domenia, American Sector, Luke, Besh Steakhouse","useful":3,"cool":3},"AIwtrUipw6SGvyOIeO-3VA":{"text":"Excellent food! I have had lunch here at least four times.  It is an terrific choice for l","useful":0,"cool":0},"I0G57v6DgX94hRxclqBX7A":{"text":"Pretty good selection of top shelf whiskey.  Incredible shrimp and crab stuffing!!! Walkin","useful":0,"cool":0},"KwyCZfH1b4TvBBucJq86MQ":{"text":"The problem with this restaurant is the atmosphere. The food is good. I enjoyed the fish i","useful":0,"cool":0},"D8okI1KgyYyndqzO5OHZCw":{"text":"My favorite in New Orleans.. A must before or after a Saints game. Plenty of servers & bar","useful":0,"cool":0},"7Zlaiqe_zlG7bOTPtLQfjQ":{"text":"So...this is really a mixed bag review-wise. \n\nFirst - the good: convenient location, nice","useful":1,"cool":0},"7siotX3d-V7uO63nFbUIaw":{"text":"Amazing restaurant! I had duck poppers and hanger steak, they were both GREAT! I savored e","useful":0,"cool":0},"lCN1SF-hTu8ctJve5jnEMw":{"text":"My wife and I ate at Borgne before a concert at Champions Square.  The restaurant was full","useful":0,"cool":0},"UFLSdXf-MqBy4mP1Cz9AxA":{"text":"This was an unexpected surprise. We were looking for a new John Besh restaurant, and found","useful":0,"cool":0},"QxN-1UtU-iQAaZ_DDP83LQ":{"text":"I absolutely loved this place. The food was delicious, the atmosphere was perfect and the ","useful":0,"cool":0},"9A5znpFLjTVIPK12pkcZBg":{"text":"Attended an Essence party here with a dinner buffet. Food was good and so were the French ","useful":0,"cool":2},"u1VgkLJKGUwjhw2CtmZZTA":{"text":"visited restaurant 3/16/2012\n\nCanary Island Honey Rum -- wonderful!!\n\nWonderful food, casu","useful":1,"cool":1},"rkDUeGTmv_72Y0MC9vG0ng":{"text":"As we ate and drank our way through New Orleans on a recent trip we came across Borgne loc","useful":3,"cool":1},"4CawHrTEXq16ljlNVwZl5g":{"text":"Have lived in New Orleans for a while now and am no stranger to Besh restaurants. Have mad","useful":0,"cool":0},"Ptq4bgynZgnqgyx2FQbVWw":{"text":"Wow! That about sums it up. I was at the Hyatt alone for a conference and chose  to eat at","useful":0,"cool":0},"l4Nk4N3vbAP210NTexKbZg":{"text":"This casual restaurant is located in the lobby of a conference hotel, but it is much bette","useful":0,"cool":0},"4ABnmxl69A-6QoyHXgiAmQ":{"text":"If you are looking for a quiet place for dinner, this restaurant is NOT for you. The acous","useful":0,"cool":0},"81QlRLf8wKSZKZVjbaIH8w":{"text":"Absolutely amazing food. The servers were attentive and helpful in making the selection. I","useful":0,"cool":0},"ZVRHQBGWIgic5PMyT79s6A":{"text":"Definitely will be back and sit at the bar.  Oysters were tasty.  Skip the calamari.  Enjo","useful":0,"cool":0},"AVTwCHZUfz75lnbnweShAg":{"text":"An excellent restaurant, whether you are staying at the Hotel or not.\nMy advise would be t","useful":0,"cool":1},"h0NdvMK2LYbKXCg_klNHPw":{"text":"Just started and my mouth is in heaven. Decided to try  this establishment based on Yelp r","useful":1,"cool":0},"JZyZ856-igiQkK_nez1VYw":{"text":"Happy hour tapas are the best! Drinks are 1/2 off and it's usually dead in there. Sit at t","useful":0,"cool":0},"05ZPdjkXvAlia6tcgjVETA":{"text":"Just revisited the other evening (my first time since the renovations) and I was SUPER imp","useful":1,"cool":0},"fpVYMMoltvDo4wHSFkomgA":{"text":"Had the charbroiled oysters, crab ravigote, fish in a bag and a beautiful French 75. Barte","useful":1,"cool":0},"8roTGzF-9x2Aw8iqS6BYFg":{"text":"The octopus is delicious. I love the stuffed flounder. The twice cooked chicken is surpris","useful":1,"cool":0},"D4F_kBRE1ZIdZKEWR_3mxA":{"text":"After many fab meals, we went to Borgne for two reasons:  good reviews and it was located ","useful":0,"cool":0},"icFgFcZKexzQq2AMaNbqww":{"text":"Caveat. I've only been once but would not make effort to return. Love Luke. Was disappoint","useful":1,"cool":0},"_gYu6I_SsbpIbrHYovYG_Q":{"text":"Service was excellent. Food was good. I ordered the pork chop and my boyfriend ordered the","useful":0,"cool":0},"2LtZ9zC98WZB8SamofVjzg":{"text":"So yummy! Amazing Grenache rose, oysters, and fish in a bag with crab butter! I am so luck","useful":1,"cool":0},"gcJxgV9ljIWKOm9KQuBGJA":{"text":"Good raw oysters, some good seafood dishes, and \"ok\" ambiance but too starkly industrial m","useful":4,"cool":1},"wKBAcihudeBxMS4kd6DAJg":{"text":"Usually a great experience with solid, expertly prepared food. It's near my office so I of","useful":0,"cool":0},"fBTe_eBWHTnxNzJpLuzH-Q":{"text":"Excellent all around, great service, great bar and creative menu.  Fantastic oysters!","useful":0,"cool":0},"ZBYn27Z5opnMmz3k_cFoSQ":{"text":"My favorite Besh restaurant. The space is hipster cool, with tables well spaced for conver","useful":0,"cool":0},"AgO5YVXcusfzNNmtaOC0hQ":{"text":"Fantastic!  Service and ambiance were exceptional, but were mere shadows in comparison to ","useful":0,"cool":0},"OgZBq2eMJBBygj3PUkPQfw":{"text":"Best ever! Especially Deidre! She rocks and makes it the best dinner in NOLA!! Rose all da","useful":0,"cool":0},"Kbd1xJcKn97-AmWWxFRixQ":{"text":"My review is solely on the cocktail drinks and appetizers. We didn't order entrees. Stoppe","useful":2,"cool":1},"jHHFOm0RDGiGciawXV8keA":{"text":"Borgne was our second Besh experience, right after our first -- a delicious hour of mussel","useful":2,"cool":2},"2y_G399KV9l0E2zs70Wj6w":{"text":"Better each time. We have been back 4 times since our last review. We have received wonder","useful":1,"cool":0},"WeGya06yKXqZPVHA5ftyrQ":{"text":"Suzie Q's fun facts:\n\n\"Lake\" Borgne, the restaurant's namesake, is an arm of the Gulf of M","useful":4,"cool":2},"JG3w0nNBuLnaVJ9-QIUKyA":{"text":"I had the absolute pleasure of dining at Borgne tonight.  What a great experience!!  The a","useful":0,"cool":0},"5gLhG_KhYmL8ewYMfvENZw":{"text":"Portions were extremely small but the flavors were great. I split an appetizer and had my ","useful":1,"cool":0},"7C9sNYG2vPKmoHYTzfSyag":{"text":"Had an absolutely delicious meal here.  We were told that there were couple John Besh rest","useful":0,"cool":0},"fLm6xTJFd0SB6A-4j2sncg":{"text":"This is in the Hyatt Regency hotel. Max is a fabulous bar tender. Tell him I said hey! Thi","useful":1,"cool":0},"FkXOvXs4n_SeHjZLGxidHQ":{"text":"Happy Hour at Borgne was spectacular. Even more so on Tuesdays when they extend it to 7 pm","useful":1,"cool":0},"Wkw4SldZXPQjIpcqN9xP4A":{"text":"Was here for a conference at the regency and was too lazy to go out for dinner.  Since I w","useful":0,"cool":0},"5P4oRhl3IwyIcaD3MY39rA":{"text":"I love this place, I don't think there has been a visit back to NOLA that I haven't come h","useful":0,"cool":0},"knpF7nq5qRcufQD5EduUKg":{"text":"The grilled oysters and fried oyster salad were fantastic. The grilled mahi was great too.","useful":0,"cool":0},"MumTzdE7Z6pyUb94Rw4mgQ":{"text":"Best food in New Orleans. Great interior setting and the menu is awesome. We stopped for l","useful":0,"cool":0},"nYne78a1BiU1YCRPdR4utA":{"text":"This was a fantastic experience from start to finish! We mentioned to our server that we w","useful":0,"cool":0},"_L2ucQyn_A8oK5EhfOcbtw":{"text":"A Chef John Besh restaurant, it's amazing food! They cater to everyone's wallet! They serv","useful":0,"cool":0},"hq2qCuPKjsB8ViNTKeWB3w":{"text":"One of my favorite spots for lunch. Great lunch specials and the best place to grab some r","useful":1,"cool":0},"u89rEbq-2x78FT66VBBg_g":{"text":"Shrimp toast!!! Every bite was a moment.  The bread and butter; so good.  Heading back bef","useful":1,"cool":0},"9OZAfSvHTqiVB42TaDexdQ":{"text":"The oysters were great!!!! Not to mention they were only 9.00 for happy hour!!! Oh and the","useful":0,"cool":0},"srgL9F_A2U3GZ7iyd-i8jg":{"text":"The food was good, but I left hungry.  I mean I get that you want to make your margins, bu","useful":0,"cool":0},"8OMLyixXkLkPSdBGD_q7yw":{"text":"Fantastic tapas. The catfish sliders are perfectly cooked and sized. The shrimp toast is a","useful":0,"cool":0},"_Eof5TT7mkDkfQpsxSBDDQ":{"text":"This restaurant was truly 5 stars. From the atmosphere to the food, it was excellent. \n\nWe","useful":0,"cool":0},"h-k1EK1TJ9lKnWWtYEBxCQ":{"text":"I was extremely disappointed.  I ordered a heirloom tomato, arugula, and basil salad with ","useful":0,"cool":0},"5acMHWU7a3QRR8Lh9ifuTw":{"text":"The food here was wonderful. It was fresh and interesting. I had $30.00\nBlack Drum A La Pl","useful":2,"cool":0},"tPBUkPKPyLvBurHwGdbelQ":{"text":"I dined here with a group of coworkers in town for a trial.  Very hip and fun place.  Cust","useful":0,"cool":0},"V5HFxGnHGKrYHHDp6o23dg":{"text":"I was in New Orleans for business and I went to Borne for happy hour to grab a quick bite ","useful":0,"cool":0},"2dYGfauhNIslgZIu9H-_dA":{"text":"Relaxing ambiance. Pretty decent decor except for those plastic leaves on a planter boxes.","useful":0,"cool":0},"Q2x3CDLHk9EBnFIbRIYC8w":{"text":"My girlfriend and I met three other couples for dinner this past Sunday.  We each got a co","useful":1,"cool":2},"Vy-2cxOaZrKW2KLkRddG-Q":{"text":"We came here based on rave reviews from friends. We sat in the bar area and took a table t","useful":0,"cool":0},"tl7bD4dyvb7P7EaIu91zcA":{"text":"Swanky and not far from the Quarter, Borgne has a cool bar and a good happy hour that runs","useful":4,"cool":3},"R-KMaywDXJ_KGf9qTDYhSA":{"text":"A co-worked and I were in NOLA for work and we decided to try this restaurant on Thursday ","useful":0,"cool":0},"FNhK03YDNIESNhNT5Lv6Xg":{"text":"Since my previous review, they've changed the happy hour menu, which knocks it off our lis","useful":1,"cool":1},"wsctEIGYHLFS5sYSPI4ffA":{"text":"Excellent food. Very attentive service. Good atmosphere, on the \"fancy\" side, however, com","useful":0,"cool":0},"dCDmHvYYErHQer3PC05KfA":{"text":"I waited out a rainy day on a business trip in New Orleans at this place (read: It was a d","useful":0,"cool":0},"SmVBfqJxr8yQIOuJyd0cYg":{"text":"Had the Mac and cheese and the sirloin. Presentation wasn't amazing but it was a fantastic","useful":0,"cool":0},"bPYpkL3sNRhTwREn4solQQ":{"text":"Wow! Bacon wrapped duck was so perfect and then fish in a bag! Could not ask for a better ","useful":0,"cool":0},"TZl34y8gZgTpGBjfRdRQWw":{"text":"Service was good and food as well, but I feel like this is a good spot if you happen to be","useful":0,"cool":0},"oT0qhXED0P8pqZnqbuj_fg":{"text":"I'm pretty easy going and look for the good in things.   Had to look really hard at Borgne","useful":2,"cool":0},"_06fM34d-5t7QAcfYVESpw":{"text":"3 stars because of the service. \n\nThis restaurant was in our hotel lobby and I had heard g","useful":0,"cool":0},"w4OgGRnBdA14BnGP6bSCzg":{"text":"Duck Poppers (10$) were a party in my mouth! I believe five poppers come to an order. I at","useful":1,"cool":1},"B0A6k73ydEG9Xi5Fm5gMrw":{"text":"Best small plates all week! Love it here! So laid back too!","useful":0,"cool":0},"MegJE1ugYba4QQSHRRWRKQ":{"text":"YUM. This was my first taste of both John Besh's food, and New Orleans cuisine. I must say","useful":0,"cool":0},"edCaWOfoDi8E2CxHEmoF4g":{"text":"It's gone down hill. Half the time they don't serve happy hour anymore and the other half ","useful":0,"cool":0},"l1cuGKK3O6wUNh4K1LA5DQ":{"text":"Excellent everything. They provided a drink menu but I'm a bourbon drinker and that wasn't","useful":0,"cool":0},"Ucdiqy7MeAaqXGniFCqBQg":{"text":"Stopped by for a quick lunch in-between conference sessions and I was not disappointed wit","useful":2,"cool":1},"UXzSCjdrbY2kLHIFtCqrCA":{"text":"Food: Not Bad, Not Awesome. I was in a pinch to find a good place for dinner. The food is ","useful":0,"cool":0},"_t53eFkxZaGOXYvypVR23w":{"text":"We have been here a handful of times, and almost every time it was only for happy hour (de","useful":0,"cool":0},"a8geJFEyg2yxMAywIiPaIg":{"text":"The oysters were excellent. Service was great. They had a great happy hour deal on apps an","useful":1,"cool":1},"vuE7c1pyLIxdQ-J1mbAjjQ":{"text":"Another mediocre stop for me. This place didn't blow my socks off. I had the duck poppers,","useful":2,"cool":1},"MLUO-5Idc4ibq2DSlQ_m1g":{"text":"I ordered a roast beef po boy to go. It said it came with brown gravy. There is no gravy. ","useful":0,"cool":0},"Pj0HgY5lrfQ-YIAoy5khnQ":{"text":"The food at Borgne was delicious & worth it. I ordered the fried chicken since I was cravi","useful":4,"cool":1},"Q1-FfXCRjpqCFKXUR2fQXw":{"text":"So, so good! I can't imagine a 2 star review. Started with raw oysters and duck poppers. W","useful":3,"cool":0},"bbcLOA2ZwOl_GMx86zQE0w":{"text":"I am usually skeptical of hotel restaurants, but was super impressed by Borgne!  Everyone ","useful":1,"cool":0},"9P8GQRyoSLsqIL-n5r-wkQ":{"text":"since i was staying at the hyatt, this was an obvious choice. the stuffed flounder was oka","useful":2,"cool":0},"eGbEO-eT8-Zz-j5-4NKYfQ":{"text":"The octopus was just right, not chewy or weird, very tender.  Served with black eyes pees ","useful":0,"cool":0},"VReLGpFQoR_8gW4EY_-BVw":{"text":"This is frankly one of the worst seafood restaurants I've ever been to. After landing at N","useful":0,"cool":1},"di2f0h3zIJ3il9SRgsh2-g":{"text":"Milady and I were staying at the host hotel. Torrential rains forced us to try Borgne...so","useful":0,"cool":0},"Eg2XMkA1emPa1BbjUifuIg":{"text":"I had soooo wanted to give this place 5 stars, mostly for the great food. Unfortunately th","useful":0,"cool":0},"kPoFFLhT-ma1Q-cIOUhSCg":{"text":"I have mixed feelings about this place. My parents, girlfriend, and I went here for lunch ","useful":1,"cool":1},"i0Hrto_DtC3BztKCi2N4ZA":{"text":"We came here for happy hour and ordered a bunch of appetizers and drinks. The decor was ve","useful":1,"cool":2},"JRutfrZFPcyCC0t-t4_CuQ":{"text":"Prior to going there, I fully expected to enjoy Borgne more than I did.  I had heard such ","useful":0,"cool":0},"-jI8sOB9YHZkVM8qfZeV5w":{"text":"I've been to borgne a bunch of times and it is always such a great time! They have an awes","useful":0,"cool":0},"xihJy0LPuqvvbfCnY4bB1A":{"text":"I saw that Borgne was opened by a local celebrity chef who a coworker was excited about. S","useful":0,"cool":0},"cAfurgBuA2mksIEbLbmXTQ":{"text":"I was very disappointed on my first visit to Borgne, for a business meal with a visiting g","useful":1,"cool":0},"VYHdOgYE4Nq3Aok5yFHR5Q":{"text":"The food at this restaurant was fresh and delicious! Oysters, creole shrimp, cajun crab, j","useful":0,"cool":0},"yvMr6wM_zdc5A32pR09LQw":{"text":"This place was incredible. The chocolate pudding is to die for. Service was on point.","useful":0,"cool":2},"0ZPi3zQRYyReqp5qa1mbkQ":{"text":"Great restaurant in the Hyatt on the first floor. Ate here twice and everything was very t","useful":2,"cool":1},"xAOuBh6tfLS5TbZJ8F3sZQ":{"text":"OMG! #1: Hit the happy hour. Great drink options (maybe get a carafe...or 2 of the sangria","useful":0,"cool":0},"mwxLQf5LWE1_IVi8-tZHCg":{"text":"Yes - it's attached to a hotel. No, it is not owned nor run by said hotel. Very cool vibe,","useful":0,"cool":0},"zjDWyo1BGXSM4LHI5oEGfg":{"text":"The ambience was nice. The staff was impressive.  The food was terrible for the price. I h","useful":0,"cool":0},"lwLjQHprcEjlnQK-tNNI7Q":{"text":"Flying into New Orleans after a particular challenging week, I was tired and ready for a d","useful":0,"cool":0},"eEOwp2DVhmjh1nGuXIRqGQ":{"text":"This is located in the Hyatt regency New Orleans hotel. Super convenient and reasonably pr","useful":1,"cool":0},"PAuvEtByfDFUi2PAmRQpWw":{"text":"Nice environment for a quick bite... but if you have other choices go somewhere else. BBQ ","useful":0,"cool":0},"AJ3cYts5FGtv4dea0fsinw":{"text":"I have been a food writer and restaurant reviewer for three decades. I have never blogged ","useful":2,"cool":1},"7mn0fqU_4l3CWZxrXmgMsg":{"text":"The worst meal I have ever had in New Orleans! The service was awful! They got our order i","useful":1,"cool":0},"o-FpF9RQiubjd-BybliQAw":{"text":"We just had a wonderful birthday dinner here for my two best friends, and I couldn't be ha","useful":2,"cool":2},"Ccm8HFrkNg41psnNxM8cXg":{"text":"This place was great! Besh obviously never fails to impress. I recommend the oyster spaghe","useful":0,"cool":0},"py6qG1KRgYATmNwCJnFheQ":{"text":"A cool Besh restaurant located on the bottom floor of the Hyatt New Orleans. A seafood foc","useful":2,"cool":0},"3tY631LDA6xh0mygGub27Q":{"text":"Recommendation came from my boss who owns a restaurant in Nashville so I knew it would be ","useful":0,"cool":0},"sW91ZeL3-5vwluaUiAYHvQ":{"text":"This is our favorite Happy Hour in New Orleans.   Wide selection of small plates with a fe","useful":0,"cool":0},"3Onj0SA1j4EjWnqn0u0tgA":{"text":"So far this is my favorite happy hour in the city. Three catfish sliders for $5! Don't pas","useful":3,"cool":1},"V-T6ZLDsXs3UgsxgII1xUg":{"text":"Loved the restaurant when I walked in. It is very noisy so if you're looking for a quiet p","useful":0,"cool":0},"Nsb_GMjz8WhZIlHCZRIlWQ":{"text":"Location:  Inside Hyatt Regency Hotel.  Parking:  About a block from a paid parking lot ($","useful":1,"cool":0},"a0GFVXGqVSL3JbmFNnt_lA":{"text":"The ambiance and decor is fabulous.  Knowing this was a Besh restaurant, we were excited t","useful":0,"cool":0},"B0oFZHZ-25RLUfuPM7Gjaw":{"text":"Food was awful for all four at our table and service was even worse. None of us will ever ","useful":0,"cool":0},"mmOzaN9FX1DbuFuwtdJaPg":{"text":"I'm giving this 3 stars because I couldn't give it a 3.5.  Wait staff was great, but the f","useful":0,"cool":0},"i8LyLJrljWCfou6i4eSC3Q":{"text":"As a vegan that will eat vegetarian when I have to there are almost no options. But I hear","useful":0,"cool":0},"6V3W_lCWwI2wTUpRfRu3sQ":{"text":"Dinner at Borgne was fantastic!  We made a reservation at Borgne for Christmas Eve, based ","useful":1,"cool":0},"wPZNlNDx4-NUrXBlM_x3HA":{"text":"Don't know if it was an off day, but I'm coming with three stars, as the food was 2, but t","useful":2,"cool":1},"RQ9h84-_xWwGAxUct_2tsQ":{"text":"I went to Borgne this week with some coworkers for lunch this week. It was very fun and ve","useful":2,"cool":2},"RjuZjY-9aFOTFVvyCwkzMA":{"text":"I was feeling sluggish so I decided to stay in my hotel for dinner. Borgne was one of the ","useful":4,"cool":4},"cEFfWAI7deLSFFUlD7WzaA":{"text":"Get the oysters.  They were fresh and tasty, and served with hot sauce and horseradish.\n\nI","useful":2,"cool":2},"ZaJ7sxPQae4lg9Nm9D44iQ":{"text":"One of the best happy hours in the city: 3-6 I believe.\n\nHighly recommend the turkey necks","useful":1,"cool":0},"51kpnAzCLe8oWHj4EsSJWw":{"text":"Chef Brody LeBlanc does a wonderful job with providing a well thought out selection of men","useful":0,"cool":0},"aKXQ45Q6BKLUbEh6rYkHvQ":{"text":"EXCELLENT!! Chef Besh & Chef Landry , you may have outdone yourselves this time. The new B","useful":2,"cool":0},"7ozvUblGSmFNmSwZtqO3fg":{"text":"The oysters used for the baked dish were too large. Those should have been used for raw on","useful":0,"cool":0},"2bLnswWIVnFtQpdZV7clmg":{"text":"Normally, don't like eating in hotel restaurants, but since this is a Besh restaurant, dec","useful":0,"cool":0},"SdoGp9kRg-zbpC4GoL9R6g":{"text":"New restaurant inside the newly reopened Hyatt next to the Superdome.  Everything we had w","useful":1,"cool":0},"y5AIX18QsYfhPBkYPgRkng":{"text":"My friend found us this place based on the highest rated seafood joints in NOLA. It didn't","useful":2,"cool":0},"hC_MMnRMN4FgXljoB5B3Ag":{"text":"Came for dinner the other day it was okay. We had the cauliflower crisps which were delici","useful":0,"cool":0},"q8oCq_pQgcF1Dtt4x9q4rw":{"text":"We were staying in the hotel for a conference and I reviewed the  mostly positive Yelp rev","useful":0,"cool":0},"DUQr_9jTeBAAI2Fklr32KQ":{"text":"Can't believe I haven't written a review on Borgne yet!\n\nThis is the brain child of John B","useful":9,"cool":7},"-cG-h3TUAno07epqkeysCQ":{"text":"This is the best place to go if you live the hotel Hyatt Regency ! Right at the first floo","useful":0,"cool":0},"aUqn6yUdFE_Ve6gdqCkGCw":{"text":"Great happy hour here.  Ate here before my flight out.  Oyster special was great - very cr","useful":0,"cool":0},"DK-idv3_yN5F6nfiqMOwSw":{"text":"Been here twice, and it was great both visits! The second visit, we were in a rush to get ","useful":2,"cool":0},"2x3TXse119nL9mzHRrBhbg":{"text":"Overall it was a good experience.  My girlfriend and I had a gift certificate to any Besh ","useful":0,"cool":0},"At2AbyYe7gTmz58Pp5llwg":{"text":"Went at Saints pregame half time. Place was practically empty. We sat and the waitress ask","useful":0,"cool":0},"hf5RUy2CtSlalhvguSAJwQ":{"text":"This review is just for Happy Hour. I went to HH with my girlfriends on week night. It was","useful":0,"cool":1},"iELlGEzXuck5PuBW1Sj69w":{"text":"Rarely does one get an opportunity to have 3 tried and true favorites only to be amazed 3 ","useful":0,"cool":0},"yND_fiBj1t0a8okxaN_9bg":{"text":"Amazing happy hour and delicious food! The location, tucked into the outskirts of the CBD,","useful":1,"cool":0},"lTynmpe7YNVvfldMOMX5Eg":{"text":"A group of us came here for a quick meeting over apps and drinks. The location and atmosph","useful":0,"cool":0},"RQnnpf5JqJNJ3Gk2O_CfwA":{"text":"I went to lunch here and was thoroughly impressed. Chef Brian Landry has accomplished a de","useful":8,"cool":4},"LwPkDFAfcr15fe_sun9fqA":{"text":"Horrible management! We frequent the restaurant almost daily. Big client came in town and ","useful":0,"cool":0},"4Y0TTjGWUahW0MAv2D7ZDQ":{"text":"After thinking this place was a local hangout, we realized it was located inside the Hyatt","useful":4,"cool":2},"cHe4LECkYcNoWMB_ka7fEw":{"text":"Excellent service and food. We had fish the first night, perfectly prepared followed by a ","useful":0,"cool":0},"VXC4ud7NUL0qArb7GZohxA":{"text":"Nice noisy restaurant with wood tables specializing in seafood with a Spanish flair. Large","useful":0,"cool":0},"vpBLp63KLkZCVPzmfyDC2g":{"text":"We had been somewhat disappointed with the food quality we'd found in NOLA, but this place","useful":2,"cool":2},"CHXHRsJ9_YReE88sd22tBg":{"text":"Fabulous Happy Hour, best were the side of greens & turkey necks.  Oysters standard good, ","useful":3,"cool":1},"phvfmPNF_B0SxkxvW675nw":{"text":"One of the best happy hours in New Orleans. In recent years, I've been staying at the Hyat","useful":1,"cool":0},"oICHEg9rZJqUK0ECDQw-fQ":{"text":"Went for dinner recently and service was terrific. Food was very good. Ordered oysters and","useful":1,"cool":0},"pKImBGFCjaHtcXg6RapELg":{"text":"We eat in better restaurants in NY, Chicago, San Francisco, etc. and found food and servic","useful":0,"cool":0},"7Eh-huxPjdJfO0sf4XFcWw":{"text":"Food was very good.  Service was very slow, and we were asked to wrap up our dinner and le","useful":0,"cool":0},"ekwHRp6bnuIkS6MRfh9acg":{"text":"Worse oysters in New Orleans. Stayed at hotel and bought a dozen. Half cooked and not favo","useful":0,"cool":0},"BcpDBziqGEO9yDWhuu4ZVA":{"text":"Food: Started with the house specialty oysters and then had the catfish sliders. Everythin","useful":0,"cool":0},"M-GtuhxNDoMOxXLr3mhUow":{"text":"OMG!! This is one of the best meals I have ever eaten worldwide. I am staying at the Hyatt","useful":6,"cool":3},"F2KFwYQUXTeJxpiYLH6N2A":{"text":"These fried oysters and stuffed crab are amazing and they are on the HH menu - bonus. Atmo","useful":0,"cool":1},"WlDuovasJKc-ILvPQ_ELwQ":{"text":"Good oysters at a good price.  Terrible waitress by the time my wife received her drink I ","useful":0,"cool":0},"HPuqe5bt94eCE8CwEdhpJA":{"text":"After my disappointing first visit to Borgne I had many people tell me they went and thoug","useful":1,"cool":1},"LJTQtXJ-LO4AmqC1fQsjXw":{"text":"My boyfriend and I went here last week for dinner with friends. We ordered a few things an","useful":3,"cool":0},"pPlZIrZ5uz4XZXJNiehKbg":{"text":"I ate here last night with the Mr.. We met a few of our friends up at the bar who had been","useful":3,"cool":0},"ajsfYlLedd2WS7Pxy0tTMQ":{"text":"My family and I were looking for a casual spot with great food and Borgne was the perfect ","useful":2,"cool":0},"7UPAb8lOarsIEOmBsSNX5Q":{"text":"I took my wife to this establishment for Christmas Eve 2019. We had traveled to NOLA from ","useful":0,"cool":0},"j5SlCIv9eJH3yYmrHdKLRw":{"text":"We came to Borgne after reading reviews on their fresh oysters. They were decently priced ","useful":0,"cool":0},"RNNb4IQWwbtIO4JpPryv_g":{"text":"Borgne is across the street from my office so I am usually here for lunch. The last time w","useful":2,"cool":1},"xjfLoAlbkay4oTWNpx0OOw":{"text":"While staying at the hotel we decided to dine in. It was out of this world delicious! The ","useful":0,"cool":0},"dXNk3LJLR7JgN_x46JFVnA":{"text":"What you get here at Borgne are gourmet takes on some rustic New Orleans \"fishing camp\" cl","useful":2,"cool":2},"2oxY9sZTDsM4hrcxtIwLTg":{"text":"For a hotel restaurant, Borgne is a very solid choice.    The bar is very comfortable whil","useful":0,"cool":0},"eg2L0s7oY9s-CoTvRjQgoQ":{"text":"Excellent happy hour! My conference was in the same hotel as the restaurant, so it was an ","useful":0,"cool":0},"8zuZZdhd_o7SFfdXKD-Rnw":{"text":"We decided to try what people liked the most, so instead of entrees, we did appetizers and","useful":0,"cool":0},"1rcMtlxdHwpy4d49pQEC6Q":{"text":"I was in New Orleans for a trip and tried the restaurant. It was a little pricey and didn'","useful":0,"cool":0},"b_earTvnYlVd8NcDEIkLBw":{"text":"Beat a path to the restaurant Borgne near the Superdome. Go now! It is a Chef Brian Landry","useful":0,"cool":0},"Yaca458NDkJjK1inxYxtYA":{"text":"John Besh...*Swoon* This place is EXCELLENT. We went in before a Kermit Ruffins show acros","useful":1,"cool":0},"I4uHUxoK9Y8xzLktj2Oucg":{"text":"This John Besh outpost in the Hyatt Regency, is billed as specializing in seafood where he","useful":0,"cool":0},"wJ1SImWeCOEvKdZszlt5kw":{"text":"We love this place! Happy Hour, dinner, whatever, there is always a reason to go to Borgne","useful":1,"cool":1},"2hJ3qQmWUwV4miypPZf7Fw":{"text":"I Gotta say that this is a spot that I have heard a lot about so I was excited to finally ","useful":1,"cool":1},"s4mvvLs_b87zPMOMe8nkZw":{"text":"Great small plates and good selection on the drink menu, great location in the cbd/ downto","useful":1,"cool":1},"Wb6H-VdnW0IQySWzID_zyQ":{"text":"Tried this place out before a show at Champion Square. It's conveniently located near the ","useful":0,"cool":1},"BOC-aRdbj0lLvJImafl60A":{"text":"Loved everything about my visit. Duck and andouille gumbo was phenomenal. Comes with a fre","useful":0,"cool":0},"HY_COrcG12LTENTb2glnmw":{"text":"At the risk of sounding dramatic, this, aside from the burger at Oxalis, could be one of t","useful":1,"cool":0},"jyqBiwwBudOwS92pQrEUlA":{"text":"Very casual place, with a wide range of foods, beverages and prices. They have a happy-hou","useful":2,"cool":2},"-7juEsYMbHPZxsf9CBjznw":{"text":"First, (and only), time here. My co-workers and I went here to attend a company dinner for","useful":31,"cool":27},"_S92-Ib33UcuLiXp9ugr0A":{"text":"This is your run of the mill type hotel restaurant. The food is good but over priced. I un","useful":1,"cool":0},"6iQyD9Xy3FNxtL4Z1BP3FA":{"text":"Went here for to celebrate Christmas Eve dinner, and  considering the prices, and the spec","useful":1,"cool":1},"cABXfFLrdOI4fYNm5jzfTA":{"text":"It was last and this place is adjacent to the hotel I stayed at. The food came out pretty ","useful":0,"cool":0},"7qDeaBgc6Z3HG5auZTevpg":{"text":"I had an extremely delicious dinner here!  Mckenzie was our server and she was friendly an","useful":0,"cool":0},"0EbEkL6aN8tC5KmRIC2B7g":{"text":"Finally! I made it to Borgne! I went on Valentines Day night this year toward the end of E","useful":3,"cool":1},"ouMs7K8cp22QnDiF-Hzirg":{"text":"Well, this is our 2nd time here and the 1st time was great. The second time was not accept","useful":0,"cool":0},"cIeAQjWgRF1AljT59ZMinw":{"text":"Absolutely loved it here. \nCame in last hour before they close during Mardi gras. Not busy","useful":1,"cool":1},"VuuuqJf5Qy-mlNKRgJ-g4g":{"text":"My tour guide recommended this restaurant. My friend and I went for lunch but we're not to","useful":0,"cool":0},"zAKICfu9e5WAVRfvkFj14A":{"text":"3-6 happy hour everyday with 1/2 price wine and $2 beer-and they have a lot of beer to cho","useful":0,"cool":0},"Yb3oqhA_YicneImUrf1fFg":{"text":"I suggest this place to my employees for an Easter celebration and we were not disappointe","useful":0,"cool":0},"g9_m_kKCN8khapW4NHziiA":{"text":"We went here for lunch after our daughter's graduation at the super dome. We were promptly","useful":0,"cool":0},"tdWR-hMDpqLx-GSich0gZQ":{"text":"Business brought me to NO. Weather kept me a day longer and somewhat a prisoner. Heck, the","useful":3,"cool":0},"1BWMKjyS_oBeCu299ahpWA":{"text":"Was a bit slow on the service but not bad enough to effect the tip.  There was a Caterpill","useful":0,"cool":0},"lol4T3NKdc4pZcNPAPpSyw":{"text":"I want EVERY DAY to be Wednesday between 11am and 4pm!!!\n\nJinyoung and I were g-chatting a","useful":3,"cool":2},"wf8qdTRzdMLkkYvvs8lMbw":{"text":"Our server Mckenzie was AMAZING! She gave us the perfect amount of attention... not too mu","useful":0,"cool":0},"s2hPMJAglXeHEe6fHFhuVw":{"text":"This was a great restaurant with perfect service and excellent food. We had the duck poppe","useful":0,"cool":0},"Ope9bNU3jTw0GtZ_r11FNQ":{"text":"I don't know where to begin.... We started with the oysters on the half shell, the best oy","useful":1,"cool":0},"eRYHwWCl11NmP6PAwKjqfw":{"text":"We went to Borgne because my two favorite Besh restaurants were booked (Luke and August). ","useful":0,"cool":0},"Les5S1iYr_QWJzZ9OiXN7Q":{"text":"It pains me to write this. This dinner pained me and it wasn't cheap which puts the final ","useful":4,"cool":2},"1FAIx2C-bLx5VdSSaptzgw":{"text":"I still haven't made it back to Borgne for dinner, but I did stop by for pre-game  cocktai","useful":3,"cool":2},"1fiB4XvQDywzd2tSS4REnw":{"text":"I suppose one of the best things a restaurant can do for you is change your mood. I walked","useful":0,"cool":0},"A44dQvnmLvgecrx1Rdazzg":{"text":"We went to Borgne last night and had a great meal. The turkey necks were amazing and I def","useful":0,"cool":0},"A7qVaMvOv7CcVGeo86zfxw":{"text":"One of the best meals I have ever had. Starter empanadas, twice cooked chicken, bagged fis","useful":0,"cool":0},"ABmYvuty1F9N4FbvHL2yHw":{"text":"It's Halloween very few people at Happy Hour. We had a group of 5 people. Spent $160. Happ","useful":0,"cool":0},"7veXddtVDxDJuzKoKcLpVA":{"text":"Cool decor, not pretentious or airy. Service was incredible and fast. We had amazing tapas","useful":0,"cool":0},"3odiyAFtCWiEKnSxUPCmMg":{"text":"In my opinion, this is was perfect spot for a lunch meeting today. \nAtmosphere was on poin","useful":1,"cool":1},"K8RImeOQWGE15Trza9yKjg":{"text":"We found this place from Yelp and it happened to happy hour, so we decided to give it a tr","useful":0,"cool":0},"gAqrv8mFB3_p-oTW9wUa9w":{"text":"Let me start by saying I have a lot affair with John Besh restaurants.  This isn't my favo","useful":1,"cool":1},"3AZ10U0Pn6D-yTfsiJ2UGw":{"text":"If you're looking for AMAZING service and great food ask for Chris. She is warm, welcoming","useful":1,"cool":0},"eicKBhx6bWkkY49yuKDeDw":{"text":"Borgne is in the Hyatt Regency, but don't let that fool you. Their specialty is fish and o","useful":2,"cool":1},"ivInDkk_kORnSSumceyGRA":{"text":"So Borgne is really hit or miss depending on what you order. Tonight we had the tempura so","useful":1,"cool":1},"0VFIyiOp3fiV7pkzIgb2hA":{"text":"It's connected to the Hyatt Hotel. But, has the warmth, charm and friendliness of a local ","useful":2,"cool":2},"QSSIYH5V0vTbCdvdTPCngA":{"text":"The food was fantastic but our server was sub par! While we enjoyed all the food, he was n","useful":0,"cool":2},"9-ldeVwZCU-zR6pMFCLbEQ":{"text":"Was in NOLA for a meeting and stayed at the Hyatt Regency where this restaurant is located","useful":3,"cool":0},"DlOy1uTP75v0PNbPriVwDw":{"text":"The restaurant is located inside the Hyatt regency across the super dome which is an excel","useful":2,"cool":2},"spzLtmJ-Qw4I4peXjPb_3w":{"text":"The waiter recommended the stuffed flounder and it was deplorable. Very dry, except for th","useful":1,"cool":0},"560e5e8VZAu7GOsb9VSMZg":{"text":"This review is for a month ago when we were there on Christmas Day. We did not have any re","useful":1,"cool":1},"z5X8Yyc1OJxiJ_wnzV09gQ":{"text":"Amazing! Food was delicious! It was beautifully presented & tasty. In addition my server J","useful":0,"cool":0},"WXZNFlcCtW0ywDO7BnyKEQ":{"text":"After checking yelp reviews, I decided to come here for the oyster and pasta dish. It was ","useful":3,"cool":1},"pvS7Orufx4SOqalqlXLU2A":{"text":"We arrived in New Orleans mid-afternoon on Thanksgiving Day,  and soon headed over to Borg","useful":1,"cool":0},"wz5hrubNCnD8CoU-bjtchw":{"text":"Wow!\nStopped in here for a quick drink and appetizer before flying home. They had Jefferao","useful":0,"cool":0},"ZdLFI6oTF0j7WjFEGo6wHw":{"text":"This happy hour gives me life.  Great ridiculously great food.  I mean seriously people.  ","useful":2,"cool":1},"7vjp_bEy4_KKt51WnCq2bQ":{"text":"This is the Hyatt...NOT a neighborhood restaurant!  The seafood tower is good.  Our favori","useful":1,"cool":0},"6FkwKAnwn9c6esfpaazsDQ":{"text":"I went to Borgne for the first time a few weeks ago and was very pleased!  I can't believe","useful":1,"cool":0},"r3YkbsvOBAJ0TUxJ4qpZeg":{"text":"This is probably your best bet for a drink/meal so close to the Smoothie King Center (form","useful":1,"cool":0},"jaBvcmFjUxqpsg0kLohelw":{"text":"I was attending a conference that was hosted in the Hyatt Regency New Orleans hotel. Was l","useful":1,"cool":0},"EOHFTSfU9ZQAijQYHQz6YA":{"text":"Wonderful experience at Borgne. We had a wonderful waitress, Sybil. The food was excellent","useful":2,"cool":0},"ilxkckauJr8lAkHiUQfBWw":{"text":"Went to this restaurant with a co-worker. The food was good, but portions were on the smal","useful":0,"cool":0},"rR3R_KmdP7B8TQliSXPFcw":{"text":"Surprisingly the food was great here. I'm hesitant about eating at hotels I stay at. I usu","useful":2,"cool":1},"zeeSTTMs4L9AmMA2lnWK7g":{"text":"The food was good, not great. I was impressed with the presentation and atmosphere, but th","useful":1,"cool":0},"v_My2RgzQJmL8ZvCMm9aIw":{"text":"We were there for a private party and the food and service was great.  You must try the fr","useful":0,"cool":0},"E4GGMtMDNuFYpmXN8ly4xA":{"text":"First time at Borgne.  Went for lunch.  Server was very nice, professional and attentive. ","useful":0,"cool":0},"gQ-YwzNdPMBMuUvdIXKKVA":{"text":"I've been to lunch here so many times I can't believe I haven't reviewed! For lunch I love","useful":6,"cool":4},"FbW_26c5uu_HwFwpVaF5iQ":{"text":"There were a few things that were wrong with our experience. We waited a long time to get ","useful":0,"cool":0},"BsvTJjuy105-LVC1FK3Y4A":{"text":"I've been to Borgne a few times and really enjoyed myself every time! The food is good, th","useful":8,"cool":1},"TIRO8tr32Xv_8lvZX5vgPg":{"text":"The best raw oysters in town by far. The oyster spaghetti and fish in a bag are also amazi","useful":0,"cool":0},"L4hFuM9LzmqHrivBPOqYcA":{"text":"This is a restaurant inside of a Hyatt hotel this is owned by famous chef John Besh, who I","useful":5,"cool":0},"3d98zexVQZdrudR8zyU2bw":{"text":"This restaurant is not run by the Hyatt. Our server was rude and came across a little arro","useful":0,"cool":0},"Nr9ve6lcZAFYc3AhWU76-w":{"text":"I had eaten here a few years back and the food was pretty decent.  However recently I rece","useful":0,"cool":0},"yo-M4ArKaZ30lkogiCEfGQ":{"text":"Been to ail but a few of the Besh chain of restaurants, and have always been satisfied.  B","useful":2,"cool":0},"MzWU629Xrj_PfEvnXk2x-Q":{"text":"I really think that Borgne is one of the most underrated restaurants in the city. The serv","useful":2,"cool":1},"LTemugmQKfwwJAYGYdcPCQ":{"text":"Situated inside the Hyatt Regency Hotel, Borgne had a very nice feel. Our group shared a c","useful":7,"cool":7},"tcNW6i2nePXhLr_vj33sDQ":{"text":"I avoid hotel restaurants as a rule, but broke that rule tonight after hearing a recommend","useful":0,"cool":0},"E9qIEk4z-Vriyyxmxh82Rw":{"text":"I really enjoyed the experience. The food was great, very fresh and flavorful. First, I'll","useful":1,"cool":1},"a2MvK6R8H_mDj8n2Yh69pA":{"text":"Omg the food was so good it was disrespectful! As someone who frequents NY restaurants I'm","useful":1,"cool":1},"zzOEV29qjXBxcdHF6TcmPw":{"text":"Let's hear it for the manager and wait staff!! I will leave it to others to tell you about","useful":0,"cool":1},"ZqDT3LrLc_jA_XrUE5KRZA":{"text":"We had the fish in bag. It was ok not great. Derert was good but served in a drink glass w","useful":0,"cool":0},"6zkGn64tdcWlnkpBOAdqnw":{"text":"So I eat a lot of salads at restaurants because, frankly, my refrigerator is where produce","useful":1,"cool":1},"7DZpz7AmV4zPvWKaiQY3cg":{"text":"Went for happy hour/dinner before a show at Saenger as we were staying in the Hyatt Regenc","useful":0,"cool":0},"FoiWF58rq63ncMGj1EIBRw":{"text":"LOVE! located in the Hyatt Regency, this spot has a laid back feel with an upscale yet dow","useful":2,"cool":2},"rDHRZaCnU8RBF5kzZ-JMSg":{"text":"One of my favorite happy hour spots downtown! Perfect for stopping by after work if you ha","useful":6,"cool":6},"nsGbxXuhV-UyE9AUM5fLdg":{"text":"I can't believe I have not reviewed this place. Don't be fooled by this place because it's","useful":4,"cool":3},"67TdHdhX2Pw_gVTyPDgvXQ":{"text":"Great. I stopped in to kill some time while in the area. Had the stuffed crab appetizer at","useful":3,"cool":2},"t3GY8atTzK36v1huNZDDBw":{"text":"Not our favorite of the Besh empire of restaurants. It's a wide open restaurant with tiny ","useful":3,"cool":1},"9ZOpHnGB4-qcaYWzbANa4w":{"text":"First thing I'll say: S. L. O. W. Second thing: DELICIOUS. I'll be honest, slow service is","useful":2,"cool":0},"pB6iBM-CtWvVy9NqJnYEdQ":{"text":"Tried this place on thanksgiving & it def didn't disappoint. We walked in & the restaurant","useful":1,"cool":1},"etwkXG5x288N1spgsZ73hQ":{"text":"I was staying at the Hyatt Regency for a conference and Borgne was conveniently located on","useful":3,"cool":2},"r-osc98rwzxzH5kRgVWJmQ":{"text":"The food at Borgne is fantastic! The angel hair pasta with crab meat was flavorful but sub","useful":0,"cool":0},"p86zD8OEgFPjtBNBFqBagA":{"text":"Came here with some work colleagues. I had the duck poppers and catfish sliders. One of th","useful":2,"cool":1},"Tqhpbi5sRCsS1ToaSdpmWQ":{"text":"Stopped here for a quick lunch with my dad before the start of the Securities America conf","useful":4,"cool":1},"XNOpWFtZ9Xzs2uQpIK7aRA":{"text":"We are the breakfast buffet here because we stayed at the Hyatt. The buffet was excellent.","useful":0,"cool":0},"97nEyytS-kYqcSGeIfihZg":{"text":"Borne is a really slick good looking restaurant with interesting menu items.  Being in a h","useful":0,"cool":0},"Ta0lInflpjLx0itM545Q2g":{"text":"Great food! Strong drinks! A little on the pricy side, but worth it. It was in the hotel I","useful":0,"cool":0},"Y1VoITgH7uZZdEPTeoqiTg":{"text":"Great food, cool atmosphere and it was very conveinient as it was inside our hotel the Hya","useful":0,"cool":0},"Nk33UGqRkTrIYQhQdN28aQ":{"text":"This was probably the only place we visited during Mardi Gras that was just meh. The food ","useful":1,"cool":1},"jOyMuWuW8f5epkpSbwHB_g":{"text":"Great service.  Courtney was amazing the food was great.  We ate the turkey necks, the cre","useful":1,"cool":0},"_RvBH0tOiOVaYsH1Hl7YlQ":{"text":"Go for their $10 lunch special or their $5 tapas happy hour!\n\nI first stumbled upon Borgne","useful":4,"cool":3},"BUDQ1eE9ADEXK8Ixlgy-Eg":{"text":"HAPPY HOUR 3-6PM DAILY, $5 apps and 1/2 price wells & beer; \n$10 LUNCH SPECIALS: a great d","useful":5,"cool":1},"nOpU_55entgrV4NxEWUa7A":{"text":"I love food and I love alcoholic drinks (don't judge!). This restaurant was delicious and ","useful":1,"cool":0}}