{"Miyn0FZDwjzVxEes2tt4Mw":{"text":"Happy hour is the best time to go 10am-4pm, drinks are big and good! I got the frozen daiq","useful":0,"cool":1},"09QL6dRZBB9EeWw3SGxNTQ":{"text":"Screaming I love Mango Mango because of TeeTee. She's amazing and had a great drink recomm","useful":0,"cool":0},"wKFXssdxln0alhoA5X_J7Q":{"text":"I read previous reviews, and that's sad. I had a pretty good experience. I hold customer s","useful":0,"cool":0},"y4drg6t-97ByiqyhGFx4gA":{"text":"Absolutely no alcohol in these $14 daiquiris. I got a mango and my husband got a Hurricane","useful":0,"cool":0},"t5AkgNI0Tlu23gOXPMDrQA":{"text":"If I would have gone with the reviews first I would have never gone inside, but walked by ","useful":5,"cool":4},"h58YH4i4LUq2XUjDIIIYLA":{"text":"Definitely very old bar, you can tell by all the dust on the helmets hanging on top of the","useful":0,"cool":0},"3AVG7PgMbC3QFd6MMKyhdQ":{"text":"The worst place ever! There are girls outside literally grabbing your hand and pouring a s","useful":3,"cool":0},"169Ldo_wa_DSclNdHCWFgg":{"text":"I don't even know what to say. I have NEVER EVER been treated like that. The girl literall","useful":2,"cool":0},"D6TWWDHIiQki7dn5OE3zSw":{"text":"This place is focused on ripping you off.  You walk in and someone immediately shoved a sh","useful":4,"cool":1},"ltS3XCQoMovoK0Zxao3Ipg":{"text":"Worst service in new Orleans....Worst bar for service get rid of the front house girl. Ver","useful":1,"cool":0},"PL0c4FE9IhWmZMXNl9AU7A":{"text":"Rip off!!! Shot girl called us in set down two shots for both of my friends, two for herse","useful":3,"cool":0},"p5GnsS3JglLLJ1ulEn3kbw":{"text":"STAY AWAY! Absolutely rude service! No alcohol in the $8 shots. Complete waste of money! I","useful":3,"cool":1},"BJelHjlRfrLk-s66gpAyog":{"text":"They are a total SCAM!! Bunch of rachet black girls force you to take cheap shots and dema","useful":2,"cool":0},"WOtfp-lNkNH1rOX2heNiZA":{"text":"This is a scam. Do not listen to these little scam artist. They will offer you free shots ","useful":1,"cool":0},"6d7u5gbOI8XUzh_QVptN_A":{"text":"Stopped by to grab an infamous Hurricane.   Transaction took less then 3 min, as I waited ","useful":2,"cool":0},"hED7TXo0gTzwa61xlkOc2A":{"text":"Love this plc Kirsten my server was cool she made happy to have stopped here because this ","useful":0,"cool":0},"40zI-J4bYhRZMogRNKwDEg":{"text":"The a-hole guy trying to sell me and my girlfriend shots grabbed my breast when I said no.","useful":1,"cool":0},"muwqdMhUmXK6DJbn2qFROg":{"text":"RIP OFF !!  Street Robbery, ASSAULT & SCAM\n\nLike many reviews on this trashy place, we wer","useful":2,"cool":0},"c3NfDVSHEX7WuFNxLl46_Q":{"text":"WARNING! SCAM AND VIOLENCE ALERT!! You will get ripped off here. Do not go here. They will","useful":0,"cool":0},"fAVaFQ8QX_wB9rHrNzh0WA":{"text":"Not so friendly bar tender.   Don't get a ramos fizz ,it had no flavor for $12.00:(","useful":2,"cool":0},"rLt8xN7x6LyMhsPOaPzX3g":{"text":"Terrible service. Sat at our table while watching other tables getting served. Slowest bar","useful":1,"cool":0},"UDD-JllxMnO7rCm2aDfKog":{"text":"Total ripoff! Paid $11 for a strawberry slush which was supposed to be a strawberry daiqui","useful":1,"cool":0},"cXuqJxU5dzSU847pPgPFYg":{"text":"HIDE YA KIDS HIDE YA WIVES HIDE YA WALLETS!!!!! AVOID this place if you possibly can. Wome","useful":1,"cool":1},"oTMXH7-vdkoPfx_cHPc_lQ":{"text":"this place SUCKS. felt like i was robbed by some obnoxious rude promoter type girls outsid","useful":0,"cool":0},"dkEyD73tG0cYROM5AeXCiw":{"text":"I came here to try the Mango Daiquiri, the bartender was quick and super sweet. It took me","useful":0,"cool":0},"xj1ZJ0AEGx6e-eKnkVuwgA":{"text":"One of the waitresses (if that's what they're called) pulled my friend off the street and ","useful":2,"cool":0},"oyHhBzxNulbn6AY6uWuz5g":{"text":"What a horrible horrible terrible place to be. employees outside asked if we wanted a shot","useful":4,"cool":0},"p2pmVTVjnmQjZw_JsScHIw":{"text":"My friend got pulled in by the wrist and as soon as I turned around to find her I was grab","useful":0,"cool":0},"XNb8AUDEmxkIanUveEqLQw":{"text":"Avoid the test tube shot girls. As many other visitors had mentioned, we got pulled off th","useful":3,"cool":0},"CRiFWbgug4CKFv_KCfdV1A":{"text":"Worst place ever!!!! I've never had such a disgusting experience in my life! All they do i","useful":0,"cool":0},"9PBVY2lXfWovKt1J7aS6ZQ":{"text":"I ended up going there at Midnight on Monday May 24th. It's on Bourbon Street, Bourbon Str","useful":2,"cool":2},"i_uqOHamHjmpjhBvDSR2lw":{"text":"This place really brought down my first New Orleans experience. My friend and I were walki","useful":0,"cool":0},"bMf7sVi9GHaBP1EYyoFgMQ":{"text":"I ordered a Blue Crack it was ok. The guy was nice BUT,\nThere were four or five ladies ser","useful":3,"cool":0},"O6O7Ebu0bGz1Ie_74ceOUA":{"text":"If I could give zero stars I could. Went in with some CEO's of companies that I represent ","useful":1,"cool":0},"Q1XUeT0RBbshQPJqBAaV3g":{"text":"If I could give this place 0 stars I would. SUCH A SCAM!!!! A girl pulled my friend into t","useful":3,"cool":0},"djAvjJntSzEHun3yqM6wFw":{"text":"Blue crack with sour green apple the best drink with an extra shot of Patron. This is the ","useful":0,"cool":0},"Gh-pJ5b267lFXKfCs93RWQ":{"text":"We were just walking down the street heading to dinner and the waitress practically assaul","useful":0,"cool":0},"grCnP5a8AS7MZOznarYkmQ":{"text":"Really shady place. Grabs the bride and offers her and everyone a shot with no mention of ","useful":5,"cool":0},"igyh_Zbcj0zAVgwE0VG4CQ":{"text":"The girls who work here are complete ANIMALS. Total predator trash! As are the owners I wo","useful":8,"cool":2},"jtNPLRoFyqnN2nXiGz78XQ":{"text":"ASSULT, ROBBERY, AND TAKEN HOSTAGE!!! If I could give this a negative stars I would. This ","useful":0,"cool":0},"pOxrR9RLt2AfHR3yq8Cddg":{"text":"If I could give zero stars I would. Sales girl pulled me into restaurant and grabs my arm ","useful":2,"cool":0},"iXNqewfZ7incUl075LgkgA":{"text":"I had a very good time hanging at Mango Daiquiris. Joan was greag making my drinks . I am ","useful":0,"cool":0},"ebx6Pt75AfpzHLDUjHa5bg":{"text":"Absolutely the worst bar on Bourbon St. Pulled me and my friend in the bar and poured shot","useful":3,"cool":0},"tlBTerop2N3ZckYwQwEQDQ":{"text":"Zero stars. Absolutely AVOID this place at all costs. Spread the word and make sure anyone","useful":3,"cool":0},"Kr2_t0MerkDHLVDPjVBQYg":{"text":"This was our first bar stop in Bourbon Street at noonish time.  Looks like they had just o","useful":5,"cool":3},"0-DkiZGMq-hfiJ6yqocr9g":{"text":"The most horrible experience of my life!  Really!!  This place was all shit. Pure and simp","useful":1,"cool":0},"hqr0VcZ16aRi9KTq5fIjmw":{"text":"WATCH OUT FOR THE SHOT SCAM!!!  DON'T PAY THEM WHEN THEY PULL IT ON YOU!! \n\nSo the exact s","useful":0,"cool":0},"PbJ2jLCsEfaOvti38hyBGg":{"text":"Do not fall for this TRAP! AVOID!! AVOID! AVOID! The ratchet ass yitches literally pull yo","useful":7,"cool":0},"SWXXxb0MGKWNb9p2l5-NKw":{"text":"New Orleans is a bit of a raunchy place and I love it. This place is a must-go to visit in","useful":2,"cool":1}}