{"oTavJf5Q5xVDi_z2tcUtIQ":{"text":"Well NOWI KNOW WHY ITS NEVER CROWDED: you can't get served so you walk out. The hostess wa","useful":0,"cool":0},"6brR5DCcooOHvSFLsK4x6g":{"text":"Wowsie! We found this one on Open Table. The ambiance and decor is very fresh, clean, and ","useful":1,"cool":1},"4PRp0_pu5VRfIb8Dp0aFbg":{"text":"In a city that's (deservedly) known for its culinary treats, Curio stands apart from the c","useful":0,"cool":0},"U7ZiJXWD2g_2SBti8l8L1g":{"text":"I had the Duck & Black Eyed Pea gumbo which is the only thing I ordered. The gumbo was rea","useful":0,"cool":0},"x9_PSmGNLEknWMIzSExhyw":{"text":"Wonderful spot for dinner!  We stopped and had the cavatappi with duck and andouille.  It ","useful":0,"cool":0},"USfNzyb45LhuULDQB9wldw":{"text":"I know it was Christmas Day and so did the restaurant. If you choose to be open for a Holi","useful":0,"cool":0},"YoEi255PDl9QczKYojEsfw":{"text":"We stopped in this place for a quick happy hour to get out of the rain. Our bartender was ","useful":1,"cool":1},"kW_9-k4YUwY-8XWi5uFZlQ":{"text":"Came here for a late breakfast and ordered their caramelized French toast and bacon.  It w","useful":0,"cool":0},"dyOuHdrGRMTx88pY_MOClg":{"text":"New place with great ambiance, but short on service and crazy charges on my bill.  We had ","useful":0,"cool":0},"6jz-VPKg8tyoxA7XF7WwzQ":{"text":"Great happy hour -- wonderful cocktails and small plates and not terribly crowded, conside","useful":0,"cool":0},"YAG0-WmvyHZKuWZk4fxLTw":{"text":"Excellent, great service and the hurricane was boss.  We recommend the grit tots, gulf fis","useful":1,"cool":1},"lRSdfGLuPMdm0UAh6vIi7w":{"text":"Curio is fabulous from cocktails to desserts! Service is always friendly and efficient. I'","useful":0,"cool":0},"4Osc-N3fBbIx5U29tHXf4A":{"text":"WORST SERVICE EVER!!!!! We waited for our food for over an hour (which we never received).","useful":0,"cool":0},"c9XnABZTEUvTWciH1IbOsg":{"text":"We stopped in just for a drink and ended up staying for dinner. The vibe is fun, vibrant a","useful":0,"cool":0},"C8W9SfvPvJpo5uzE-aP3ww":{"text":"In some way affiliated with the nearby Kingfish, I found the menu and service profile quit","useful":0,"cool":0},"yHxFHRIm0iq2AU3nXkBC2Q":{"text":"Great dinner! Very different from the classic 'Brennan' restaurants around NOLA. \nWe order","useful":0,"cool":0},"0R3kHsq1NoPdgMs7wR7bWw":{"text":"Food and service here were absolutely fabulous! We came three times and did not regret. Ev","useful":0,"cool":0},"5WRjGhm42Jutb08IPD6DcA":{"text":"Love love this place. We sat on the balcony as we enjoyed the French Quarter and all it of","useful":0,"cool":0},"RUnzAKxBpeAWwVNUDuPYeg":{"text":"I'd probably skip this place next visit, here's why.  Reserved well in advance and arrived","useful":1,"cool":0},"5KM1r1Ez9Orn4minljSx_g":{"text":"Beautiful new spot in the French Quarter with a cozy, intimate environment. Food was delic","useful":0,"cool":0},"Srhy5nSqd-xDg22SxEQDZA":{"text":"Excellent!! The best service! Really good food! Only complain...they really need to get th","useful":1,"cool":1},"7oKAGErilBlp5DztuOR1Gw":{"text":"This is a cute little place that opened up about seven weeks ago in the French quarter. It","useful":1,"cool":0},"J5eNyZLZg-1eBIpTc04AgQ":{"text":"Would be zero stars if I had the option. Utterly disappointing. These reviews must be writ","useful":0,"cool":0},"_X2JrsS4tpQTw1LqAqTnAQ":{"text":"Finally found a bartender in NOLA that makes a fantastic Mint Julep. Lisa makes quite poss","useful":1,"cool":1},"676He88ZxQIg3h-cPI1KPQ":{"text":"We stumbled upon Curio while walking in the French Quarter, we wanted a quick morning drin","useful":0,"cool":0},"T7FTtGnw5GjrGu7Qo-kPKA":{"text":"The duck was absolutely sublime! Very well seasoned, and very slightly more on the salty s","useful":2,"cool":1},"KlyYntA2vBFT3uyx_0yxOg":{"text":"We were looking for a place to have a quick light brunch prior to the ride to the airport ","useful":2,"cool":0},"blvWXt97ci0kEZUsJF7T1g":{"text":"SUPER!  Absolute must try!  The drink menu is awesome and the food is fantastic!  Duck gum","useful":0,"cool":0},"52HhRZPNZelTR7yjn6AQ7Q":{"text":"Ashley P. was the best.\n\nThe breakfast potatoes here are the best.\n\nThe bottomless mimosas","useful":1,"cool":0},"57H57NkhfWjEUL907Say_Q":{"text":"First the service: Julian was awesome. Chris and the rest of the management staff went out","useful":0,"cool":0},"utxatQF4iQ0NwWOC7citlw":{"text":"The drinks are yummy and the food here is delicious !! Definitely worth the try \nTry the b","useful":1,"cool":0},"uRJDN3RXR1l_D4At46jKMA":{"text":"Had lunch after trip to Bevolo, the folks that make the beautiful gas lanterns ... but tha","useful":0,"cool":0},"UaZMLXmPJBVAxlMq6ahcaQ":{"text":"My friends and I went here for appetizers and the staff was extremely friendly. The food w","useful":0,"cool":0},"-6dT4hNt1i5VOBIGTr7nBw":{"text":"Excellent restaurant in the FQ. Just hasn't caught on yet with the Yelp reviews so it does","useful":0,"cool":0},"KMvgmBmH8_7JsP1J2x3R1g":{"text":"This was probably one of the best seasoned and flavorful meals during our entire stay on N","useful":1,"cool":1},"t8BPSJ70Zfpe11LePcXDOA":{"text":"BEST HURRICANE IN NEW ORLEANS WITHOUT A DOUBT! They are made fresh every time, not that cr","useful":0,"cool":0},"mIRy3kToWUsrS7aLlgLMcg":{"text":"Love this place, environment is really nice. Very clean and pristine.  \nI had lunch with a","useful":1,"cool":0},"NipcsbiB1pck5xdhcp3msQ":{"text":"The Cuban sandwich is bomb. The pork ribs tasty! And Sarah made the BEST lemon drops ever!","useful":0,"cool":0},"Udz4SYPEJp-SDUaTFHuc4w":{"text":"Surprised as we stumbled into this place. I'll be back every Nola trip for now on.  Crab c","useful":0,"cool":0},"vJCDLWd6utx6sg6IGHmlGQ":{"text":"The ribs on the brunch menu... EVERYTHING!  Sooo delicious, the BEST ribs I have ever eate","useful":0,"cool":0},"Z3ZrGO2TdxxPKSzfNeb5nQ":{"text":"Pork rib appetizer was the best I've ever had, dying to recreate the glaze that was on it.","useful":0,"cool":0},"Qg41f31HkhpAot3oIY5hUg":{"text":"The location was great the service was good. We walked right in and got a table during tje","useful":0,"cool":0},"ArCcrzAGfQ1-oEOexyQ7CQ":{"text":"Amazing and friendly staff! And the food was fantastic!\n\nI recommend the grilled shrimp sa","useful":0,"cool":0},"iixWOdH4j9INyR8Gtd3eRw":{"text":"Great service Landon the manager heard us talking about wanting gumbo and came and gave me","useful":1,"cool":0},"nVjZLG80Igk4hrA_SrfWHg":{"text":"We sat at the bar and enjoyed yummy cocktails.  The bartender knew her drinks. The meat an","useful":0,"cool":0},"e_s1v-0Sb6geirlz0aRPOw":{"text":"This was our favorite dinner after 4 days in New Orleans, including all the \"must dine\" re","useful":0,"cool":0},"aCO02BL7QFMEl_YPBezexA":{"text":"So far two for two!\n\nHad dinner here my second night in the city and it was a home run. Sh","useful":0,"cool":0},"ZMRnKkp4Opd7UDkfBnwNHQ":{"text":"I took a large group (16 people) there last night (Oct. 12th 2017).  We were asked for eve","useful":0,"cool":0},"EO7OXg509uExs8kQyHLZfA":{"text":"Stopped in here for Sunday brunch. The service was a little slow but our server Ashley was","useful":0,"cool":0},"iQOyP2fE6V4u-pNCJdh9nQ":{"text":"Delicious food and great atmosphere. Big shoutout to Destiney for wonderful service and al","useful":0,"cool":0},"RgHpYf0RAi6thQf80XZUug":{"text":"Wow.  This place is beautiful.. the bar is outstanding... it's huge.. and the service is a","useful":1,"cool":0},"CW9YrWX373DEoN0FvXBimw":{"text":"This place was absolutely amazing, one of the best burgers I've had 10/10 would return. Th","useful":0,"cool":0},"oB9o52vlzlRKJdxLeXmoUw":{"text":"A fantastic new find in the French Quarter. The menu offers something for all tastes, incl","useful":1,"cool":0},"uOxRwKcKLCd6GJHt6BMlbA":{"text":"Food was amazing but the service was slow. We had to call the waiter over after being seat","useful":0,"cool":0},"9uI_pKeodN-JLKTKbYMGpA":{"text":"The food was good. The server was attentive but not intrusive. They were out of three diff","useful":0,"cool":0},"BlngDfQr4wUUbz3M0BFK-g":{"text":"We happened upon Curio on our first day in NOLA. I can't say enough about how much I love ","useful":0,"cool":0},"EGEj-xVGnOTGfEJaWPwyhA":{"text":"Randomly stopped by and what a treat. The grit tots were an absolute treat for this Northe","useful":0,"cool":0},"fbVbCoV9Mls70XplThxFzg":{"text":"Great new place in French Quarter!  We ventured in a few months after they opened and enjo","useful":1,"cool":0},"M_GP1MlDYQ-9WIVF9V3kbA":{"text":"We didn't have a lot of time, the last thing a restaurant wants to hear, trust me, and the","useful":0,"cool":0},"1B4_mR1nFUXBchP7UzvX7w":{"text":"Staying in NOLA for our friends birthday and this was our first brunch spot. Morgan their ","useful":0,"cool":0},"uAO73uVI5lNdO9RBNd_YDQ":{"text":"The best meal, and service,I have ever had in New Orleans.  I would highly recommend Curio","useful":0,"cool":0},"BAQAV2YJA9Oy3v1MH73Fvg":{"text":"New favorite place of new orleans the candied ribs were an absolute hit. My favorite thing","useful":0,"cool":0},"UoHn3kBe8TxlnQnhm4hS9Q":{"text":"This place is a must visit! Sit on balcony and enjoy people watching while you sip on hurr","useful":0,"cool":0},"0F1tjHcvgQQgikY-L1rGzA":{"text":"Wow! Wow! Wow and more Wow!! This is a newer restaurant in the French Quarter and my wife ","useful":0,"cool":0},"bHa9sfz_LFBSolfR5yF8LQ":{"text":"I came here for HH. The mussels were just ok. The rose for $4 was really good. This seems ","useful":0,"cool":0},"I6f2sYi0VD9fLi__Q1g7CA":{"text":"Came in to Curio after walking around the quarter one afternoon.  We had the grit tots and","useful":0,"cool":0},"oESiZ2ZvHmzoEBqrc7cClA":{"text":"We stumbled across this place randomly and it was such a great surprise! The grit tots are","useful":0,"cool":0},"KftPdigUL3diiEkn2iPSKQ":{"text":"Inspired by thrillist's hot list of new places, I decided to give it a whirl. The best par","useful":0,"cool":0},"J7kjJcqiFtza6xFKextQrw":{"text":"Bad experience.\n\nFood was incorrectly entered to the kitchen or prepared incorrectly, rega","useful":0,"cool":0},"Y8rugb73qMsYsB2LbAKrxg":{"text":"Amazing food! We went for dinner. Everything we ordered was so yummy! Definitely would rec","useful":0,"cool":0},"IiyflE9VF-Du7i-FXjRr4Q":{"text":"Great place. Opened 2weeks ago! Food was very interesting...in a good way. The balcony was","useful":1,"cool":0},"tPt3G80Ak2MNTbcbGL3DRw":{"text":"Visiting new Orleans for a birthday and stumbled upon curio for brunch with my girlfriends","useful":0,"cool":0},"SvA7M9mwS_Ur9a323Y9r6w":{"text":"++ Shakshuka - Excellent! The eggs were cooked perfectly.\n++ Baked french toast - Excellen","useful":0,"cool":0},"oJUkF-dI239FTAm2ZKrv8A":{"text":"Very tasty.. Destiny and her recommendations were the best! I don't live here, but I'll be","useful":0,"cool":0},"igksUr93yQ4KCT8V_MwJ8A":{"text":"We wandered in during lunchtime and had a great experience. The service was wonderful, we ","useful":0,"cool":0},"UvhAHuRXSznCmLpQ5dDMiA":{"text":"I came here for lunch today with 2 friends.  We got to the table upstairs we were the only","useful":2,"cool":0},"ZKUte-BRxy_t_w3rgMwUxg":{"text":"Great new space that retains the classic NOLA vibe.  Our bartender made a fantastic Ramos ","useful":0,"cool":0},"aYYhcxqG5PUqBzxmp2V8lQ":{"text":"Had a great time upstairs with John taking great care of us. For a newer place they really","useful":0,"cool":0},"vK1PgujQrIikDBLoSdDpEg":{"text":"Went out for Saturday brunch on our last day in NOLA. Stopped by some of the more establis","useful":0,"cool":0},"d4wxYbI0HzhjfuDN_tgzfA":{"text":"This is probably the best restaurant I've experienced in the French Quarter.  I had the re","useful":0,"cool":0},"myYv6oqBuQMTOMZ-bR9t8w":{"text":"Our dining experience was so much more than was expected. Our server Julian was so wonderf","useful":0,"cool":0},"7KFPAu8pNpZszd00exjMqg":{"text":"Two words: RUM CAKE\n\nWe came in without reservations on New Years day and was able to get ","useful":3,"cool":1},"RjAUDR9wn-kjqsrFV6kTGw":{"text":"Awesome everything! From the hosts and hostesses that greeted us smiles and hospitality to","useful":0,"cool":0},"ZNSQ1CYG9vnYx8wJqXRtww":{"text":"John Barry was a charming and welcoming guy as well as a great server. He continually show","useful":1,"cool":1},"GlzsYDOP-V9deef2pYVEvA":{"text":"From the bar to the food....this place is my new fave.  MUST tries:\n\nThose fried grit dump","useful":1,"cool":1},"wdN4sLBr6tzJckfprMqQBA":{"text":"Great location, service, decor, and most importantly food! Awesome experience Saturday nig","useful":0,"cool":0},"pdPaV8XSZYK4Q0EfHXeXjA":{"text":"I got the steak and eggs, kind of bland. I also asked for a side of plain grits and butter","useful":0,"cool":0},"XfEISPaCVo2nwS-lN_gKtg":{"text":"Great mixture of food and service. Would recommend for non fish/seafood people.  Will be b","useful":0,"cool":0},"DxU11fF3r4FASlht8bWm1w":{"text":"7:30 reservation received out meal at 9:00. Food was really good but there is no excuse fo","useful":0,"cool":0},"6WJsXz0aiT8nUIMn0h2e6Q":{"text":"A MUST-TRY WHEN YOU'RE IN NEW ORLEANS!! We ate here tonight due to the positive reviews an","useful":0,"cool":0},"Q79YgZmgN_zaZZNRI7V_gg":{"text":"This is by far a place you want to go in New Orleans. They have great balcony dining and t","useful":0,"cool":0},"SybmZ-xHQEMFaxUQvBZr1A":{"text":"We went for drinks and appetizers and had a lovely time at the bar. The cocktails were gre","useful":0,"cool":0},"aRKXw79Oq68R37NivOxxtw":{"text":"Wonderful evening. Great vibe. Delightful service. Sat outside on 2nd floor balcony. Space","useful":0,"cool":0},"MjhPPwuARPkOm8aUXYeEmQ":{"text":"The food was fantastic! We came for brunch and all of our plates looked nice as well! Magg","useful":0,"cool":0},"g_XMIWULTXYwUSnAabU0fw":{"text":"Caught in a rainstorm we dashed in the door and sat at a table just down from the bar. Thi","useful":0,"cool":0},"YKVyOvUPWtGqz4Zdzw0LAQ":{"text":"Based on the reviews of this place I was pretty pumped to visit but left feeling a little ","useful":0,"cool":0},"uEcYgWA8dXyuvQIcvwUEwQ":{"text":"Happened in for drinks before dinner at another establishment. The couple next to us was h","useful":0,"cool":0},"HBWmZbofhf1Xpa9dBjC47A":{"text":"The service was excellent. The decor was perfect. The price was very very high..... the fo","useful":0,"cool":0},"edV0Gc8ypUXCwWJxkJGQMw":{"text":"Super fish cakes.  Staff super.  We were repeat visitors during our short stay in New Orle","useful":0,"cool":0},"d2RvRYWPIEUZGeeoIB2JnA":{"text":"Incredible food and service! Highly recommend this place. The wait staff made a wonderful ","useful":0,"cool":0},"pKtkIC65fhGgnW5az05KQA":{"text":"Amazing meal!!!  We all loved our food and was one of the best meals that we have had. Sho","useful":0,"cool":0},"K04NjLAlbvAeI3EGiOnbTw":{"text":"I came for dinner, was wonderful. I'm a manager for a Commander's Restaurant's and I was b","useful":0,"cool":0},"DAbGm2zabQrY4qa2wZsfow":{"text":"We had a great lunch today !!! I highly recommend the Shrimp Reuben which was absolutely d","useful":0,"cool":0},"1BetwEEdGdAwjXul4EkAKA":{"text":"Another fantastic seafood location. 10/10 would recommend the scallop & tuna carpaccio, I ","useful":0,"cool":0},"ex1GCjLcxUP0Ce7ZrIOGhQ":{"text":"The balcony was great for people watching! Accommodating for large birthday parties. The b","useful":0,"cool":0},"bPx6m2SqvGrt9bIM9gdc8g":{"text":"Stopped here twice on our short trip to try and get their carpaccio again. It was amazing!","useful":1,"cool":0},"gvyHmrvv_tQWKrlt7cP3UQ":{"text":"Wonderful place. Cool interior decor and great outdoor seating on the wrap around balcony ","useful":0,"cool":0},"As2CJBq731krLPi5Ck4iuw":{"text":"About a block off of Bourbon Street with a great environment. Nicely decorated with cozy s","useful":0,"cool":0},"OI8DtygZD9dwSjqdGMKh5g":{"text":"Prior to attending a play, we chose 5 appetizers as our meal and were thoroughly impressed","useful":0,"cool":0},"INy-gWg4SS5p6FFsBMkH4g":{"text":"One of the best Restaurant close to Bourbon. Great Food, especially the Mussels and Short ","useful":0,"cool":0},"6iW_SaGOz69D8VEYF39TLA":{"text":"What a pleasant surprise! Beautifully subtle decor. Great brunch options for healthy and s","useful":0,"cool":0},"AV2bxeX4NOhFsOGit0x5gA":{"text":"From the reviews I was sure this was going to be an amazing meal but got disappointed. The","useful":0,"cool":0},"SVB_aDvRWqsytP_rkVALyA":{"text":"Newer restaurant in French Quarter. Great location on corner with outdoor seating. Food is","useful":0,"cool":0},"b7RyfLlKXhBYyo5k8geJUg":{"text":"We found a favorite drink here, the New York Sour, a mixture of Woodford Reserve, red wine","useful":2,"cool":0},"FvvIpw0wDHi2DvmU70uPaQ":{"text":"Unfortunately still needs to work out some kinks. Our waiter brought food we didn't even o","useful":1,"cool":1},"ibOrB0FtrmRJTLgqMf6Lug":{"text":"This restaurant has a modern look with a new American take on its menu. The service was ef","useful":0,"cool":0},"Q5YamN879MRzSO84PpynYw":{"text":"Highly recommend!!!\n\nIt was getting late, about 8:45 pm., and the two of us weren't super ","useful":0,"cool":0},"rblGp0y5YTdxaodhWgtV6g":{"text":"Fantastic cocktails and and curious blend of flavors. Really cute ambiance and amiable ser","useful":0,"cool":0},"pL7MzMoeBOTfsqvb85ZEvQ":{"text":"The reason for the 2 review is for two reasons: 1) although Ashley was friendly, service w","useful":0,"cool":0},"uz0AtEJJtzgtCqh1D0pBRA":{"text":"An excellent high quality no touristy option in a French bistro style. Excellent well made","useful":0,"cool":0},"xz2NGcNAOz0IncnPsnarTg":{"text":"The food was so good! Me and my friend ordered two crab claws, highly recommend! So delici","useful":0,"cool":0},"8F8zMP8fm0lEzNoZlnnXXA":{"text":"Tried Curio for the first time to celebrate my parent's anniversary! Elegant interior and ","useful":2,"cool":0},"I_KrKXUW0xivRldSjMejUg":{"text":"We chose Curio for my birthday and it turned out to be a wonderful experience. The locatio","useful":0,"cool":1},"N8iH-80Pt0rnDgIF_3YS0g":{"text":"The food was ok at best. Much better options in the city then the food here. The service w","useful":0,"cool":0},"IKdiHO8dlcgoXy-DlYXnKA":{"text":"This is what food should always taste like. We started with the black eyed pea hummus and ","useful":0,"cool":0},"DviY8mO5x7XYgGSOfq5omA":{"text":"We live bed Curio. My friend is a big cocktail \"snob\" and was told this is a great place. ","useful":0,"cool":0},"03SUN4FTmxS9IqC2zzHTtw":{"text":"My new favorite restaurant in New Orleans, food and service was FANTASTIC, I had the salmo","useful":1,"cool":0},"EtYmBpzW25NG3mSFUJKjFQ":{"text":"Great service. Excellent food. Thanks to Austin and Bronze for providing the Best service ","useful":0,"cool":1},"ykgQro3Wp_9WgsJpLgxxCA":{"text":"Hmmmm... not sure about 4.5 stars for us Arrived today and referred by our hotel, Monteleo","useful":0,"cool":0},"zBJ4GOOk-KngNmZm7CkMFg":{"text":"Great restaurants like Curio not only have tasty food and great cocktails, they also offer","useful":8,"cool":7},"VKPBDsbiR-vX3uFaJAsjrQ":{"text":"Great brunch menu with some traditional choices with local flavor and bottomless mimosas. ","useful":0,"cool":0},"0JDnzRj1RHvrMXjvLQOwPQ":{"text":"If I could only pick one restaurant to dine at for a week in the french quarter, it would ","useful":0,"cool":0},"ikbX_UFSImME4IB7bmJEYw":{"text":"Had reservations for a Tuesday night, but they weren't necessary as the place was pretty q","useful":0,"cool":0},"eb6UUOeWLAW_x3D4JpByIA":{"text":"It all started with great service from Christie and continued from there. The tater tots g","useful":1,"cool":0},"tHw2EEAT8bFSuVNIY3urXA":{"text":"New restaurant, friendly staff, great when you're out with friends, variety of cocktails, ","useful":0,"cool":0},"dtXFT4_te4xeZSk3fd5Q7A":{"text":"Arrived in NOLA on Fat Tuesday. After wheeling my luggage 4 blocks, not as bad as you migh","useful":0,"cool":0},"eBUhPydTwgZiwFkmaK7FEw":{"text":"Excellent place to have a glass of wine with friends. Try the blue crab claws, they are am","useful":0,"cool":0},"RBQZ12w8wI356SqeWn4gvg":{"text":"Came here after a long day of walking around the French Quarter and really enjoyed my meal","useful":1,"cool":1},"vP8msnHF352CyYpz0qBNLQ":{"text":"Went for Saturday evening out in the Quarter. Made reservation for 2. We were seated at th","useful":0,"cool":0},"gVkyPzsViWpW0bGBqxO0pQ":{"text":"We stopped  in on a whim. Everything we ordered was amazing especially the watermelon toma","useful":0,"cool":0},"rFVykYAZinqw6p3OOPgdmg":{"text":"Absolutely love this place. My friends and I went to New Orleans from Orlando FL on a bach","useful":0,"cool":0},"GDq6_T4q3QDx_xZr4Bi9Qw":{"text":"Went there on a recommendation from a friend. Seated at 7:35. Didn't see our server until ","useful":0,"cool":0},"e0t2P08BUOVPZmN66raBFQ":{"text":"We went for breakfast and it was fabulous. The waiter Marion could not have provided bette","useful":0,"cool":0},"kH8lLbOxK0B1uOQACu1_xg":{"text":"Brunch was delicious! Destiney, our server, was super accommodating and sweet. Our table o","useful":0,"cool":0},"H0AdWz8IHoQ6rM9onG4MNg":{"text":"We went for Christmas dinner. The place has a lovely tile floor and a nice bar but there a","useful":0,"cool":0},"Q2OMvGpX1ZlzYpl0KMBYkg":{"text":"This place was recommended to me by a local bartender. Looks more like a bar than restaura","useful":1,"cool":0},"ztpVQBLDW4ekz_xbU4MuGg":{"text":"Love this place! I had the ribs starter and fried Tabasco red fish. Superb! And the servic","useful":1,"cool":1},"ogy3nMWHc5L-8greFdZ0Ww":{"text":"Stopped in for dinner, and what an amazing surprise. After four days of very good meals in","useful":1,"cool":1},"rQy-m5sMc7-ViVqFZuxw-A":{"text":"Came here with a co-worker while we were in town for a conference and was looking for a pl","useful":0,"cool":0},"v3z-xkSEbApH5NSy5dYHYg":{"text":"Had my first lunch in New Orleans here. It was early so the place was pretty quiet.  The a","useful":0,"cool":0},"6ykUs9BKrf_ipBawub5OLg":{"text":"Rolled up to the bar. Was served by Austin. He was amazing in all recs drinks and NOLA. Be","useful":0,"cool":0},"rje_E2bSD_8aCyxjUEK0pw":{"text":"Really really good food. Slightly small portions which is why I didn't give it 5 stars but","useful":0,"cool":0},"HFxJJtu8ZMwQfUnonjtOnQ":{"text":"Service was a bit spotty.  We were seated on the balcony which was great but then they for","useful":1,"cool":1},"mPMLrvwMS5jvm2CpANSZxg":{"text":"This place is amazing. It was a nice, affordable place, that is a bit less heavy than a lo","useful":0,"cool":0},"8_KUc8BN3Nd6412abn0NPg":{"text":"Came here for breakfast as it was close to our hotel. Good service, good food, and good se","useful":0,"cool":0},"iG2fWkOzBrPdd27jhnoolw":{"text":"Great experience, great environment, awesome food, s'mores brownie was a little piece of h","useful":0,"cool":0},"Q_QiubHwrkum_xSBttSerg":{"text":"Just stopped in for a drink, but a nice welcome  reprieve from the death smell emeinating ","useful":0,"cool":0},"GB5pDtY-l0wFhJGBQ3WrMg":{"text":"An absolutely amazing meal and service.  I'm gluten free and it has been difficult to find","useful":2,"cool":0},"mS0fac_HEjFA5B_MGbyQ4g":{"text":"THE BEST COCKTAILS EVER! Hands down!! I came here for drinks and to get away from Bourbon ","useful":0,"cool":0},"Q68ZKTvTuyEog-eILcI0Sg":{"text":"I have had reservations for 2 weeks on open table.  I also called prior to ask for a table","useful":1,"cool":0},"e3Xis6FHhZ-e0mQlnIignw":{"text":"First dinner in New Orleans and it did not disappoint! Great cocktails and a very good cur","useful":0,"cool":0},"a1B9E0jtatL1OLjhtj6USw":{"text":"Fabulous! I got the redfish and my husband got the chicken and they were both unbelievably","useful":0,"cool":0},"S3qlC5ufDC4wPZW_xGq7PA":{"text":"The food and the drinks are exceptional but I cannot give it a five.\nI was really excited ","useful":0,"cool":0},"lqAJJ9WB2sqo04tMH0GO7w":{"text":"Such a great experience ! Exceptional service and lovely balcony seating. The jambalaya wa","useful":1,"cool":1},"RkAJmiNw4cLZIH4d7EktTw":{"text":"This place gave us a break from southern & Cajun food after days of similar food. We were ","useful":0,"cool":0},"kHYswUu0kbqoHqhfkba8eQ":{"text":"This place was awesome. Lovely environment for adults. The wine and drinks are very nice. ","useful":1,"cool":0},"Ge3-bz7UpItI98c1oi1fpQ":{"text":"Great place for dinner! The food was great , service was top notch. This is a must see pla","useful":0,"cool":0},"B9Xv91XPyjSEhkDWy30J6A":{"text":"I come to New Orleans frequently on business and we tried this place for the the first tim","useful":0,"cool":0},"MuhoKveQjAXuP8iTYhczew":{"text":"Open only two weeks and we loved it! From Canada and never has chilled blue crab claws whi","useful":1,"cool":1},"_rl9EY4rNRNUx3yanc2ocg":{"text":"New Orleans modern cultural cuisine at its best. The short bras ribs over cheesy grits whe","useful":0,"cool":0},"synAfX2zKEqgLwLivPiibg":{"text":"Popped in for Happy Hour... Enjoyed a delicious Hurricane, very classy, served in a large ","useful":0,"cool":0},"jNk9wg7M6VMgEpNizCCIAQ":{"text":"I went to this place with my friends. We didn't know what to expect. The place is bright. ","useful":1,"cool":1},"cbtMOKcNQgPuOXK8YXDlkw":{"text":"So we were staying across the street at Hotel Monteleon and needed a place to eat. Used go","useful":0,"cool":0},"T39xJrimsNHuYCdNXsp3YA":{"text":"OMG... this place is heaven!! A must do while in NOLA! The decor of fresh and posh while s","useful":0,"cool":0},"9V63QUra_x3GBBFy7gdgMA":{"text":"I really wanted to like this place since they had some many great reviews. But, I didn't h","useful":0,"cool":0},"fcF7e9Pc27HV6RmEKv4LEA":{"text":"I visited this place twice on my trip. The first time was for brunch and everyone was happ","useful":0,"cool":0},"Elwu2-w8wL3hvmEMTO590w":{"text":"AMAZING SERVICE, FOOD & ATMOSPHERE. \n\nOur server Matthew was super amazing and fun. The ma","useful":0,"cool":0},"BaCb45MxWw0Ctca6hFT-jQ":{"text":"Sort of stumbled our way into Curio for brunch on Sunday while walking around searching fo","useful":0,"cool":0},"Sp54GGFs6zelvLoZGLAjyw":{"text":"Great new restaurant a block off of Bourbon. We stumbled upon the place after deciding tha","useful":0,"cool":0},"_ICAyJYEyTk21JNDf3pquw":{"text":"I love a good cocktail. An old fashioned is my go to drink. But, while in NOLA, I knew the","useful":1,"cool":1},"zqIJcik88Mc517qOiM7xJw":{"text":"This place is just amazing, no matter what time of day.\n\nThis trip we did brunch with the ","useful":1,"cool":1},"V1Fe7qqvv_x3bHF5cI-WQw":{"text":"Southern hospitality at its finest. Food was delicious. And the bottomless mimosas were no","useful":0,"cool":0},"EQspgaXC1Bu3QxcqTTyBmA":{"text":"Was told when we sat down the they had opened three weeks ago. The service was nice, and t","useful":0,"cool":1},"vgAJdur1_yHWBu0HyLtw0g":{"text":"Brunch is amazing!! First time here love it. Fried grits are to die for. And the short rib","useful":0,"cool":0},"Ik3bZZLtgZMBlOhEnDUE3A":{"text":"Delightful new restaurant steps from our hotel. Gallery dining was refreshing and breezy. ","useful":0,"cool":0},"-_JoVEuuAp5ESg3kb_H-tw":{"text":"I sat at the bar for a cocktail and some snacks. The food was really good. The mussels wer","useful":1,"cool":0},"fWz6QASsNmAsxsDFGEpEVA":{"text":"Food was mediocre -nothing special. Fish dishes were fair. Grit cubed appetizers were good","useful":0,"cool":0},"9RiUIvL3_1d_j9P0JpvRsg":{"text":"I have a problem. \n\nWe went to NOLA two weekends ago and I had a Bloody Mary at Curio and ","useful":0,"cool":0},"qXg6D1ZBvcKSeU0_VsUPDQ":{"text":"Stoped here for lunch on a whim.  Thoroughly enjoyed ourselves.  The cocktails were lovely","useful":0,"cool":0},"9K6yL21Q-hMSTlKEI0K1tg":{"text":"We stopped by at Curio for lunch after walking through Bourbon street and French quarter. ","useful":0,"cool":0},"iZTZREGNA-MLMH_IyR0EsQ":{"text":"Charming restaurant in a great French Quarter location. Went for brunch and highly recomme","useful":2,"cool":0},"0s340tdIOhOIkUI4yaUiIg":{"text":"We came here for brunch with a group of 9 girls, we called 10 minutes ahead and the hostes","useful":0,"cool":0},"pg9-GuFztEB3oqqqZRp2qg":{"text":"Curio is gorgeous on the inside and the outside, as far as restaurants go; that is really ","useful":1,"cool":0},"CZqQnGhR32VHZVHX-1XGGg":{"text":"This place is amazingly delicious. The mussels and fennel were perfect - especially the co","useful":1,"cool":0},"2EYj1XnMlNoCCjOUp7vC6A":{"text":"I actually expected more from this place.  I read all the reviews and going into it I was ","useful":0,"cool":0},"HhiftGxCJUX8XYSgluABtA":{"text":"Subtle but amazing flavors that pair perfectly with the mostly seafood menu. \n\nGumbo was a","useful":0,"cool":0},"8QQ4k0eVQlp5yJdZjDnwXg":{"text":"Nice place that just opened two weeks ago, restaurants nice, food quality is good, however","useful":0,"cool":0},"kWURQdtqKTBp0PgTiO9ZNw":{"text":"Visited Curio for lunch on my way out of town. I was looking for something lighter, but st","useful":0,"cool":0},"D7dS5rj7-wIgTraQ-iVVWw":{"text":"Strange! They charged us for water without asking us first. Just water! They brought a bou","useful":0,"cool":0},"eE_ns2b0jZ3vw7GlUJ81gg":{"text":"I have never had Gumbo before so I have nothing to compare it to.  But after eating there ","useful":0,"cool":0},"29T2l9o_ttsIVMT9h8XU7Q":{"text":"I can only rate for drinks, service, and the friggin' candied fried pork ribs.  These are ","useful":0,"cool":0},"l-QN3LXDQIIT9k8WTwqQwg":{"text":"Great bottomless mimosas, great food, great outside porch, and our server Mercedes was the","useful":0,"cool":0},"CRMhgMPA6tMPENcvS6EvnA":{"text":"Incredible foods. There were four of us and we ordered the short ribs, ribeye, salmon and ","useful":0,"cool":0},"vOGME3XYSj8Oof8pyz0BuQ":{"text":"The burger and the grit tots are AMAZING!! Dashawn was such a sweetheart! Highly recommend","useful":0,"cool":0},"FendJnNE7QSw4_yio-RCYQ":{"text":"The soap in the bathroom was out and never filled during the whole dinner from 730 until 1","useful":0,"cool":0},"76kxxTt3Vz4-oiV4CfWySQ":{"text":"Nice foods and beautiful restaurant. But service so slow and we come first (2nd floor) and","useful":0,"cool":0},"770geTCOaTltEUVyIM5dMw":{"text":"Service is good.just came for dessert. Don't get the bread pudding!!! Cobbler Way better !","useful":0,"cool":0},"zwn2y6Zb5copdiRVWUyJ9w":{"text":"Fabulous staff, great food and drinks, good prices! Perfect for a game watching experience","useful":0,"cool":0},"nwOrgF8M1acMfJUysLHiSw":{"text":"In New Orleans for a few days and found this gem tucked away a few blocks off Canal St. It","useful":0,"cool":0},"EqedrGkv49bHq2td_QMc9w":{"text":"I was in New Orleans for a conference and went to this restaurant to eat on my own one of ","useful":0,"cool":0},"p0XDdGXOCYTZ_Np-Gc7Utg":{"text":"I wanted to like Curio, I really did. However, I just wasn't impressed. A few weeks ago du","useful":0,"cool":0},"-e149ojk2eVkbrBiXL0tLg":{"text":"This is a great new gem in the French Quarter. Came here on a date last night, and oh my g","useful":0,"cool":0},"tnR9i7uzda0lDNRfEzNflQ":{"text":"After a long Friday night, Curio's was a great way to start off our Saturday morning. Our ","useful":0,"cool":0},"I6dRE4TFqHiBiEeq75c5Hw":{"text":"Space: there is a large bar with several tables on the ground floor and I'm assume seating","useful":1,"cool":1},"pddh8FpU43psaP-KT79ppg":{"text":"Went here during our trip to NOLA - 5 stars may partially be attributed to how lovely the ","useful":0,"cool":0},"xAp0peghEOniBuCxZ7nXdw":{"text":"Walking around and thought we would \nmaybe just pop in.  They were very accommodating. Gav","useful":0,"cool":0},"4iKJ9nRZ91nWUoAisIJlMw":{"text":"Wait staff was very friendly and accommodating. Duck and black eye pea gumbo was super sup","useful":0,"cool":0},"Op7pySI9UyWjOYo1FIk0Zw":{"text":"We just popped in here on a super hot muggy day after a very sweaty long walk and I'm glad","useful":1,"cool":0},"GW7N7ZSpMFvR4cBX1Xgxig":{"text":"Save your money and go somewhere else, literally anywhere else!\n\nStarting with a wrong dri","useful":1,"cool":0},"UUEhKbN9D7taVsykMRZcig":{"text":"Our concierge recommended that we try Curio, which is usually a recipe for bland \"tourist\"","useful":1,"cool":1},"Y-EdO_VRElXI349arqwtOQ":{"text":"Came here recently for a bottomless brunch with friends. \n\nI had the bottomless Bloody Mar","useful":1,"cool":0},"J2JkGdFrksat2a8XDZiRCw":{"text":"This bar is awesome.  Austin took care of us and is very knowledgable with cocktails and w","useful":0,"cool":0},"Xaw3GfQDMpe9eT8pMUo3Tg":{"text":"Ate here twice in past two days. Dessert one day was cream brûlée and donut drops. The nex","useful":0,"cool":0},"rf1U32ewRqL_ib8zCjLeAQ":{"text":"Food was amazing, our server Gerard was so attentive and always gave us all his attention.","useful":0,"cool":0},"Q1rkDdtAWhXVyEpjyrcMQA":{"text":"Food is top notch. Service is perfect. They genuinely care  about your experience. Came he","useful":0,"cool":0},"CIg9DG0ugaZR9BQLb7klhA":{"text":"I would advise the chefs there to double check the plates before sending it to the custome","useful":0,"cool":0},"ZI14D8tsNDtAzpBHylKafQ":{"text":"Sorry but walked to this place. Kind of cold bar. The gumbo came out Luke warm. Sent it ba","useful":0,"cool":0},"DsvcX82GNEYKqGm_9nWUUg":{"text":"Grit Tots are a MUST! Their Hurricane was one of the better ones I've had as well.\nBest bu","useful":0,"cool":0},"pRb-jVUQuJOA5Xn_rkt-Iw":{"text":"First visit to Curio! Great ambience!! I got the pasta dish with fried shrimp instead of o","useful":0,"cool":0},"m4Kq9D2yfgfnFmZox4RNKQ":{"text":"Stopped in for some gin and tonics to go!  They were beast!!!\n\nDecor was nice, bartender m","useful":3,"cool":2},"pst84-ZLYcqPtxqyGeeRlg":{"text":"We stopped in to have a cocktail and watch a World Cup game. The bar has a bright, clean, ","useful":0,"cool":0},"9ZpPxNuCjIgILPrg53aMZw":{"text":"Nicely decorated, attractive, and very clean. We enjoyed sitting on the balcony watching t","useful":0,"cool":0},"tZ0BvX2y7CWKPsFe9kEqvw":{"text":"Jessica was our server and she was amazing!!! She made our experience so enjoyable that we","useful":0,"cool":0},"SiBUtHjc48zMtg8XwK9fEQ":{"text":"this place is not worth your money. please go anywhere else. I had the blue crab claws as ","useful":0,"cool":0},"GZdTv8KMXt0pxhikeiZXHg":{"text":"An excellent modern take on traditional southern style food. Everything we had was delicio","useful":0,"cool":0},"doNzZu9RUIwjvIhWqIhEBg":{"text":"Great food, beautiful view from the balcony and the cleanest bathroom in the French Quarte","useful":0,"cool":0},"XVmRCtMN4AZnvck1QS2RMQ":{"text":"Great food and great drinks....but let's be honest when it comes to ratings the bathrooms ","useful":1,"cool":0},"xPCZWXbUwqN4Qa6edNFmOA":{"text":"Decided to try this place for our wedding anniversary as I noticed the beautiful outside s","useful":2,"cool":0},"uJvRcsGIlf5Xn2GEEaMm8A":{"text":"I sat at the bar and ordered the redfish and a beer. The redfish was pretty tasty. The int","useful":1,"cool":0},"ik1juYkvyGIY-Lb-NN7IhQ":{"text":"Went to NOLA for halloween weekend. Food was good, serving was kinda small though and took","useful":0,"cool":0},"OV1sMb0XPs8PhU3nXiTpow":{"text":"Very nice time during a rainy afternoon at Curio today.  The Duck and Split Pea Gumbo/Caes","useful":0,"cool":0},"YWjZWzDR8WmV3vpzcS-7VQ":{"text":"The Vegetable Curry is DELICIOUS! When I saw the restaurant was empty, I was skeptical, bu","useful":1,"cool":1},"WAuajppzKKcc-NVNv5CD_w":{"text":"This place is dope, bottomless mimosas, champagne, bloody Mary's, but still waiting for th","useful":0,"cool":0},"tUBApbRD3modHXZ24k33GQ":{"text":"Excellent appetizers! Ribs are very tender and not too salty. I like the olive and honey s","useful":0,"cool":0},"kUImQ5vOiC_ZvTruK46fRg":{"text":"Stopped in on our last day in the French Quarter for Sunday Brunch.  The menu looked appea","useful":1,"cool":0},"VUkJfsjCI-u2pLGu7GfGfQ":{"text":"Had a morning stop here. \n\nOrdered the duck and black eyed pea gumbo. It was watery, had t","useful":1,"cool":0},"4UkBTSH-rO-Mw9Y4Es5pLQ":{"text":"I'm giving 2 stars because I feel I got a bit duped at the bar. We discussed with the bar ","useful":0,"cool":0},"w4uCINaQi21LNeexI_5dOA":{"text":"Too bad we were not able to enjoy our drinks or meal here. It seamed like a nice menu. The","useful":1,"cool":0},"Q8kOzrdMhHEy6Ury4HgEqw":{"text":"Super cute gem in the heart of New Orleans (super close to the French quarter and Bourbon ","useful":0,"cool":0},"zEmnDs-RaKUd-nwXoCmA7g":{"text":"This place had such amazing food! Everyone at my table was blown away by how delicious the","useful":0,"cool":0},"p8iRjAE69WkfGxVE3E8amQ":{"text":"Drank a Hurricane and Razz Royals! Kris (bartender) is amazing! Great energy and master mi","useful":0,"cool":0},"CIsv5dFZkbImx-3iGz8pRw":{"text":"I seem to be on the hunt for the best po-boy I can stumble upon and so far this is the win","useful":0,"cool":0},"2atdmHmG79SOCJ5jHGQXwA":{"text":"Christy is amazing nice chill bar!!!! Didn't have any food we did get a lot of drinks!!!! ","useful":0,"cool":0},"2OWz7tjQcypiITnMrrm20A":{"text":"My friends and I recently visited New Orleans for Mardi Gras, and we made a reservation at","useful":4,"cool":1},"h2DqY2uBJECn5ZD-0vStLg":{"text":"My best friend and I came here our first night in New Orleans.  I had the vegetarian curry","useful":1,"cool":0},"aHRkmVoOrMEolQ7LxZlvcw":{"text":"Omg what a horrible adventure.  Sheraton sent us here for a memorable meal.   Horrid my wi","useful":0,"cool":0},"TZ4CFOc6w66uruf82NFMMQ":{"text":"It saddens me to write this, but I need to express my disappointment after a second visit ","useful":3,"cool":0},"FuSO9VUBNeRX2jH2PRjNAQ":{"text":"We stumbled across this restaurant while walking back to our hotel. We just wanted a quick","useful":0,"cool":0},"BOGE6hN3W4HdJQz5lq58eQ":{"text":"Was there on New Years Eve.  Food was okay.  My hubby enjoyed his salmon but the short rib","useful":0,"cool":0},"-zQ5hwCZx7WL3nUOuC_P6w":{"text":"One of the most beautiful pieces of salmon I've ever had.  Cooked to perfection, made dair","useful":0,"cool":0},"ENU86DsCE6e2Y5eZCDKNXw":{"text":"Grit tots and strawberry king cake will blow your mind! Delicious food, friendly staff, an","useful":0,"cool":0},"3FvZDGza3UxK1vIdIZu0_g":{"text":"Great food. Great service. Ashley will take care of you esp if you have gluten issues as d","useful":0,"cool":0},"FRMRYcpXvwSkgMsxLtDb6Q":{"text":"Not bad southern fare! \n\nCame here during Mardi Gras weekend despite it being very busy at","useful":0,"cool":0},"v-p8ZZ2W7NaZsOJrPz2WSg":{"text":"Bottomless mimosas were strong and plentiful! The breakfast food was delicious and our ser","useful":0,"cool":0},"JFo5wEsOt6CPxXvNfwf3Og":{"text":"Very disappointed with service- meals came out at different times.  appetizers are way ove","useful":0,"cool":0},"FXYk9l01T2zqo-OIHHMJqg":{"text":"Thank you wonderful staff at Curio this evening for making our dining experience a most pl","useful":1,"cool":0},"IolldIPejMC6-d1ABf4tXQ":{"text":"Stopped in for small plates and drinks. Great choice for both! Great candied fried pork ri","useful":0,"cool":0},"oeWHlTtPw_eDe8JHITRjIw":{"text":"We had a reservation for brunch today and they were all so friendly. Our server Ashley wen","useful":0,"cool":0},"Agel0PPIlsGzX_DhWxaozA":{"text":"Great atmosphere. We ordered the candid ribs and hurricanes. Ribs were EXCELLENT!! Wish I ","useful":0,"cool":0},"mWdU0Ph56YxOSLOmcEBKJA":{"text":"Walked in without a reservation but was told we could take a seat at the bar. For a Saturd","useful":0,"cool":0},"yt0rRIZv7bvwWb_dK1WF5g":{"text":"This was a disappointment. Food was just OK. When you go to the website everything it tout","useful":0,"cool":0},"Kp5xKQT1KmLhHWCcyDqQmg":{"text":"This place was just fine, but not spectacular. I had the shrimp, um, I can't remember what","useful":0,"cool":0},"91LvOwazBf3rurANcr078A":{"text":"There was not one table in this place where we weren't in a windstorm of cold air. Bring a","useful":0,"cool":0},"rvqmHSYJj4K_Y7ubyBVsoQ":{"text":"We popped in to cool off and to have a snack, luckily we were in time for happy hour so we","useful":2,"cool":1},"5hHvAqKlmq8UfGuSTCoCsg":{"text":"We found this spot last minute because we were looking for a happy hour. We were seated in","useful":0,"cool":0},"32sFYFWp9NvZ4aNcaOvTEQ":{"text":"Great service. Nice ambiance. Great location & Good food! The shrimp and grits were delici","useful":0,"cool":0},"SeKzn_6B-EWImHMCH4LXfw":{"text":"Set a reservation for our party to celebrate a birthday. We were sat immediately and promp","useful":0,"cool":0},"QyG_7G9EepMtFD6Ym2ybEA":{"text":"Oh my goodness this place is perfection. Stumbled upon it after deciding not to wait one a","useful":1,"cool":0},"6EGEGTk_QK9MWoKmNx6fWw":{"text":"We had late lunch here. The grit nuggets were yummy. I'm a Bloody Mary freak but I just fo","useful":0,"cool":0},"5SQlEYCWhJdo16f9zsobKA":{"text":"Perfect spot for a finely handcrafted drink. Our bartender (forgot his name, partly becaus","useful":0,"cool":0},"jl_qKUFFMv5qlD9Mb6o6VA":{"text":"We were wandering around the French Quarter during Jazz Fest and needed a quick drink so w","useful":0,"cool":0},"Sj31VB_0xoqFKMLlEYZHOw":{"text":"Stopped here for breakfast with my son. Sat upstairs which is lovely. All of the food is w","useful":0,"cool":0},"X7XQ5yxwClpF0Is-NNJF6Q":{"text":"Stumbled upon Curio just before Happy Hour ended, great prices, drinks, appys and Samantha","useful":0,"cool":0},"Jdh-8nFdfmRVqTYLWbky4w":{"text":"This place is super cute and falls right into a comfortable price category. The location r","useful":0,"cool":0},"Z5PBJdSbhYXdw_O6Q1JH9w":{"text":"We stopped here at 3:15pm on a Monday hoping for a late lunch. Unfortunately their website","useful":0,"cool":0},"s7B-SyY9NGhZd3ua0SAt0Q":{"text":"Great music, the food was great got a Cesar salad(off menu) they had a special menu for Ma","useful":0,"cool":0},"l1rIcAyAT0T243ohSdAHyQ":{"text":"Keshia was a great waitress;. The food was phenomenal..we sat on the balcony..on a cool ni","useful":0,"cool":0},"Ok-8-ti7cAJmlR_76qLF-g":{"text":"Stopped in for happy hour on our first day in the French Quarter. We sat on the balcony, w","useful":0,"cool":0},"19R606vBwKGaz5If0XBTCw":{"text":"I'm visiting from Atlanta for my girlfriends bachelorette party and a group of 10 of us ca","useful":0,"cool":0},"NsawblO74Fiai25cYtdIkg":{"text":"Popped into Curio after a morning of walking and were delighted with the prompt attention ","useful":0,"cool":0},"QF480yPwbVoAvIIit2ej2w":{"text":"Forty-five minutes to get the worst po' boy I've ever had. Tiny portions and overpriced.","useful":0,"cool":0},"Iqn-5eTWuJFCiFOfkONBFg":{"text":"WORST SERVICE of all time --- table for 12 for 40th birthday reservations for two months a","useful":1,"cool":0},"R1RJ6rxWekvULGGI_IieNQ":{"text":"So I really wanted to like this place.  Service was professional and friendly. The food, w","useful":0,"cool":0},"yQyUpkVYPBevZ4pAfRfy5Q":{"text":"Food was okay, probably closer to 3.5 stars. Ordered the royal street breakfast which came","useful":0,"cool":0},"ZVDCvSllHyV_NVKBUcxd5Q":{"text":"Great service.  Candied pork ribs and blue crab claws were phenomenal!  Aesthetic of the r","useful":0,"cool":0},"fdQ6tV4RyWyV0PrBLH1k1g":{"text":"Stellar!\n\nFantastic ambiance, scrumptious food and very friendly staff. You will feel welc","useful":2,"cool":1},"19T4s6GUaxPoaSKbM_LUlg":{"text":"SUCH. GREAT. FOOD. Plus our service by Ashley P. and DeShawn was so great! We did the brun","useful":0,"cool":0},"vcds4WwdvmrMEkV81JgfMQ":{"text":"The soup of the day was awesome, ribs were tasty, and the cheese board was ok. I did like ","useful":1,"cool":0},"t07gM2YoPNle6g8RsAMLwQ":{"text":"Their bottomless rose and small plate happy hour is fantastic!  A great place to pass an a","useful":0,"cool":0},"hiQAsSV1M0jBC1LxxUMzsA":{"text":"Not great. Still on our vacation. Thus far the worst place I been to. Took  greater than 1","useful":0,"cool":0},"BkBH6PisIrwSj9jK8Abs-w":{"text":"Vibe seemed nice with concise menu. \n\nFloor dangerously slippery.  Ceiling AC vents drippi","useful":0,"cool":0},"VOCCkFMdSqEYYFOhBckJIw":{"text":"Waaaay too much salt. We all got different types of fish. After an hour wait we finally go","useful":0,"cool":0},"fCUmHSICz6RAFizDoYa3KQ":{"text":"I originally started at The Governor restaurant but didn't see anything on the menu to my ","useful":0,"cool":0},"cs-KdGHM86wFjNxNh3QtbQ":{"text":"Great breakfast.  Service was really good!  Really nice place to sit and have a meal after","useful":0,"cool":0},"rtIS5-3UddQAXW3zW5w2mA":{"text":"I honestly have no idea how this place got so many good ratings. I ate there during Mardi ","useful":0,"cool":0},"DyiRM5PUju_Ouh1w15-Dgg":{"text":"After trying to get brunch at ruby slipper the day before and finding a ginormous line, I ","useful":4,"cool":3},"oZstpihI06u0siZBAtYpYQ":{"text":"John was great! It was so hot when we were there for pride. He refilled our waters, got ou","useful":0,"cool":0},"Yni660vvBgKSM73urDmZvQ":{"text":"Matt - the service manager at Curio created a wonderful experience for a team dinner at Cu","useful":0,"cool":0},"oaxmXF9uODrHBRYjoGXt8Q":{"text":"Pleasant choice for a happy hour beer and cocktail after a very busy day.\n\nDoors wide open","useful":0,"cool":1},"fp156fS8lHETT6v7lW1SGQ":{"text":"Such a sweet and great corner spot for very fresh cocktails and small plates. Friendly sta","useful":0,"cool":0},"9u1Q8w4iMXCyKLFyclr4jw":{"text":"I think Curio is a bit overrated especially with the competition around.  I had their frie","useful":0,"cool":0},"WYXUKkVFGc-ZTks3f1k9Pg":{"text":"captain kirt is the bomb! she is beautiful and so attentive. my sister and i loved her!  g","useful":0,"cool":0},"FIhwuLdSCDdjX80PsnjQJg":{"text":"After days of authentic, heavy, salty southern food, I was craving something different. Th","useful":0,"cool":0},"K_KoCOsy6LG1gBCds_eWYA":{"text":"Soggy fries.  1/2\" thick ribeye, shrimp balls with no detectable shrimp.  Salmon served on","useful":0,"cool":0},"dMgiPEQjUJZFh1uBMqqmpQ":{"text":"this place is amazing. our waiter Sam was very nice and helpful durning our experience her","useful":0,"cool":0},"jmTgp39QZfNUnyfOz58RKw":{"text":"Food was bland.   Restaurant does not serve cocktail sauce despite seafood on menu.  No ho","useful":0,"cool":0},"AY7tN7OShhUPshKgOCZ0AA":{"text":"The bartender (lady) was INCREDIBLY RUDE - we are here on vacation and the first thing she","useful":0,"cool":0},"_Vk2NZXGdUf-wqzrEGQ0gA":{"text":"I stopped in Curio while wandering New Orleans in search of a quick lunch. I had a Diet Co","useful":0,"cool":0},"kUcVHf7b_TzpOLtmV1vC_Q":{"text":"Great tasting food. I thoroughly enjoyed my meal. The waitress that served me, Paris, was ","useful":0,"cool":0},"Fmdf8G3QvfJe31OEy1SZ5Q":{"text":"Will is by far the best bartender in all of New Orleans - not only does he make the best d","useful":0,"cool":0},"CEHnutCV7o_Q1OtsfndvDw":{"text":"Such a disappointment! Service was terrible, took 1/2 hour just to get water. Forgot our a","useful":0,"cool":0},"nWwknOj2oPWF930gKKS0-Q":{"text":"This place is incredible. Amazing food, amazing drinks, and most importantly - amazing sta","useful":0,"cool":0},"R0HjEvKcrFgjX84X9yWBuA":{"text":"Awesome service!! Manny at the bar ,made all the difference and really made us live to Lou","useful":0,"cool":0},"hPis2FDDJ8GDy367rT0-Sg":{"text":"Nice.  I had a couple good draft beers and ate the Jambalaya. Nice atmosphere. Rain. Windo","useful":0,"cool":0},"sJas0qAVENwPNxLdV1--Aw":{"text":"Nice trendy place with rather affordable pricing. Good food and friendly service. A bit sl","useful":0,"cool":0},"YgQ5AmrXqiCNhs9_Xm5wQg":{"text":"Happened across this little gem today, stopped because they had a bistro board and a drink","useful":0,"cool":0},"iuz3R_C5upeGflKpTCjJ4w":{"text":"Recently, after being cooped up in the house waiting on Tropical Storm Barry, we decided t","useful":1,"cool":0},"tELl6wEI2SYKUDhLmHuoYQ":{"text":"We had a wonderful time at the Curio. Food was good, and our waitress, Amber was simply aw","useful":0,"cool":0},"6As4FiPfb4din10RuTopTA":{"text":"The thing about this place is that the food and drinks were good but the staff was unorgan","useful":1,"cool":0},"NWGrb9wFn9aDxSnfo8OkUQ":{"text":"Curio has such a nice, friendly atmosphere. My fiancé and I went during lunch, and we were","useful":0,"cool":0},"ZkoTozpQyohdIXbEk8kVnw":{"text":"This place was awesome- staff was great but so was the food and the pricing! Loved the out","useful":0,"cool":0},"IWYRkqtkzYu_sw4Ur0_NlA":{"text":"I went to this place for breakfast, and it gave me bad mood for the entire day. I sat at t","useful":1,"cool":0},"km2qII6T1svjeJ1bUZb3Dg":{"text":"I've never written a review while dining... but this place warrants one. We sat for an hou","useful":0,"cool":0},"i3s_paUUtgU0iw0xDOx0RA":{"text":"The food was great I had the shrimp and grits and the endless Bloody Mary's and Mimosas we","useful":0,"cool":0},"WTgguBRAufgZlx5MBwd0Sw":{"text":"Passed this place a million times and never went in. Worked late near by last Thursday so ","useful":0,"cool":0},"0FwAQvStu9oPcco0WT2SUw":{"text":"Nice spot. Walked right in, plenty of seating upstairs and downstairs. Right in the French","useful":0,"cool":0},"RKDCf_69aIGZQK-a-Hmrxw":{"text":"We visited for a late lunch on 01/01/2020. We loved the bottomless mimosas. The food was o","useful":0,"cool":0},"BmzC_fK9jl8sEbWUS9b2lw":{"text":"Pasta had a watery \"sauce\" that it was bathed in. Was as if it took a bath and this was th","useful":0,"cool":0},"Tqlo32HeF1gCtOJtdlkiVA":{"text":"Great ambiance, great hamburger and salads!\nOur waitress (short black hair, with tattoo on","useful":0,"cool":0},"jfFxerlJXRBBx2DWY6ul-g":{"text":"Everything was great! I had the French toast & the grit tots. They have $12 unlimited mimo","useful":0,"cool":0},"l3hy_qRFNXXkgAegWHJrxA":{"text":"Solid lunch menu \nDuck gumbo was a nice variation from all the other awesome classic eaten","useful":1,"cool":0},"SCGPCw3i71Dha8OxxDjTWA":{"text":"The bartender from our hotel suggested we come here for breakfast and their bottomless mim","useful":0,"cool":0},"1DwStgYbNIpXg8qug3rAfA":{"text":"Stopped here on my last night in NOLA for a dinner by myself. I wanted something other tha","useful":1,"cool":0},"-fn4BjPRF_zJPlLE2dtwSg":{"text":"This restaurant advertisement popped up on my Facebook feed.  So I walked a mile from my h","useful":1,"cool":0},"VA_09AI6MBOewuIqPtZ_Qw":{"text":"I don't get it. 4 stars?! I'm hoping an off night, but seriously I wouldn't recommend this","useful":0,"cool":0},"pfZuZ0z5D9ei5N7j9-qeBA":{"text":"You never know what to expect in the midst of the French quarter and I must say, I was ple","useful":0,"cool":0},"MRm2Jqw4t1IssCALtRteeQ":{"text":"Happy Hour Oysters are delish.  Manny, the bartender was great. Service was quick and cord","useful":0,"cool":0},"vNNCcaxespXFFsQz3dcPRQ":{"text":"The grit tots and shakshuka are amazing. Beautiful decor and great service! A definite sto","useful":0,"cool":0},"3pY6Rag2WeZWcrYXJtq3Bg":{"text":"Went to Brunch at Curio on Sunday April 14, 2019 had the Cheesy Grit Tots, they were GREAT","useful":0,"cool":0},"G-M66NL1Je3qdI3SvQf2Nw":{"text":"Great off street Bourbon location!   Especially at happy hour rates!  Ding a star.  My gir","useful":0,"cool":0},"sI8iNgfW3XQj25mcerFrtg":{"text":"Food was great!  The pork appetizer ribs was divine.  Accomodations including the bar were","useful":1,"cool":0},"mAE-kTLMrEp5hM59DIHXHw":{"text":"We found this little gem while walking around on a Sunday morning looking for something ot","useful":0,"cool":0},"Wxo7IGBqvcC2d6iWcBHe4w":{"text":"I had high expectations for Curio, but both food and service were disappointing. Even thou","useful":0,"cool":0},"CtDg3NlUQaLYzCIfLGX-GA":{"text":"We had a fantastic lunch at Curio. They accommodated our group of 7 in the upstairs dining","useful":8,"cool":6},"Jlqt0mC1HTosk82Pu54kDw":{"text":"This was the last place we ate at on our New Orleans trip and it was hands down the best. ","useful":0,"cool":0},"L0wSV5YlMb6mG3SbzB3-Tw":{"text":"My favorite restaurant in the French Quarter so far. Inventive dishes that nevertheless re","useful":0,"cool":0},"8q54DYa5Q4ht0ZXbNHjJaw":{"text":"This is an amazing place! We stumbled upon this place as it started to rain while we were ","useful":1,"cool":1},"zcRRk6mI12PxnbUJwWfNVA":{"text":"This gem is across the corner of Hotel Monteleone. We arrived during Happy Hour and enjoye","useful":0,"cool":0},"GYiiT2kiDV6owyo8T0yIow":{"text":"It is hard to NOT find a tourist trap in the French Quarter.  This is a GREAT place! Curio","useful":0,"cool":0},"OvCWKXGc-vcjRnKneurXuA":{"text":"I recently ended up here kind of by accident and I'm so glad! I was really excited to revi","useful":1,"cool":0},"AhWRwGnmkYPut1QEpJuNrA":{"text":"Service started out really great!! Declined after 5 minutes. Slow!!! Kitchen service was p","useful":0,"cool":0},"qZrpkkoH169XytcQSW4ZAQ":{"text":"I had my first \"experience\" with Curio on Friday night... And I have to say, it was not a ","useful":2,"cool":0},"CsAUSB-vQDvAt9v84rhb0Q":{"text":"Fantastic dinner! We ordered the shrimp beignets, duck gumbo, chicken entree, the blackene","useful":0,"cool":0},"A2ERZX-xL-WDq7kDBvA5qw":{"text":"A little disappointed that the candied ribs weren't available. Decided to order the lunch ","useful":0,"cool":0},"Ptia70qcPkJOyUWpcV2YHQ":{"text":"The steames muscles are the best I have ever had. Good service, not as crazy as most other","useful":0,"cool":0},"17-A1oHzIViQDtudrDcJ4Q":{"text":"Wow! Only open for six weeks and they have it together! Beautiful food and service. Both D","useful":0,"cool":0},"nZonxjl-XQRnhQyd9EdbMg":{"text":"We spent quite a few days waking through the New Orleans French Quarter and surrounding ar","useful":0,"cool":0},"kHLgoooIzyqrsZgbX3tRPw":{"text":"Curio is perfect if you want to feel like you're in a movie based in modern New Orleans! T","useful":1,"cool":1},"WaNE62Yf3Wpi7pCblvTHAA":{"text":"I'm usually pretty forgiving when I'm in a restaurant and the food or service is not quite","useful":0,"cool":0},"BY_swwaFhoyQ6XBq88kh2A":{"text":"Amazing food, great service, you have to try the red fish! Chef Hailey knows what's up!","useful":0,"cool":0},"WZCYidQIy2_Y-VpxHs_hyg":{"text":"I was attracted by the Yelp rating and thrilled that it was across the street from my hote","useful":0,"cool":0},"FOjBV0SPerbfY-0NQDzZAA":{"text":"Very nice place. Clean & that's saying a lot given how close it is to Bourbon St.  found a","useful":0,"cool":0},"w6nSfFfToxUEWiIjIKBYag":{"text":"This place is good if you are looking for a light meal. The portions are on the smaller si","useful":0,"cool":0},"s0HW6d0DzTyaw1Dv6pxQ6w":{"text":"Upon first arrival I enjoyed seeing people in casual clothing. We sat upstairs and had thr","useful":0,"cool":0},"CWWhHvhR-sA4GHKJoTNv6A":{"text":"After some terrible food in the South i was glad to have stumbled onto this place. Lovely ","useful":1,"cool":0},"G1nQUlCXI-REgxfPMjbm3A":{"text":"Let me tell ALL of the reasons why I will NEVER return to this place:\n1. We waited over an","useful":1,"cool":0},"xWo67j-016zJdOE6do9v3A":{"text":"Stopped in for drinks, the bartender was friendly and helpful. Cocktails were tasty and it","useful":0,"cool":0},"6F5Le-V7t5wMRg6YJH1y7Q":{"text":"Our waiter recommended the coconut chili mussels and thank god for that. They were the BES","useful":0,"cool":0},"rI1NmW4jAFwE5UOFILuWYg":{"text":"Ordered the special, it was black drum. I got a perch!!!! People weren't friendly. Shouldn","useful":0,"cool":0},"3NolxRyZNYv22Ts1nyBBYA":{"text":"Set a reservation for our party to celebrate a birthday. We were sat immediately and promp","useful":1,"cool":0},"j25snGiB_9W-9we0bwCkAA":{"text":"Kris is the man! He gave us excellent suggestions to the best menu specialty items. If you","useful":0,"cool":0},"GoJBvZUP_wolgiuqf7zUbw":{"text":"Bradley was awesome and friendly. The two women in the front also very nice and helpful. T","useful":1,"cool":1},"rqSOBEMABXpAcAvoEgOeoA":{"text":"Curio is a newer addition to the New Orleans scene and it is a good one.  On the corner of","useful":0,"cool":0},"WwrBF1IQ46Mv3jmCEZPUEg":{"text":"Stopping for a quick app and beverages. Was surprised by the conversation with Kris. Gave ","useful":0,"cool":0},"1l-Hp1ZbiLTRpRkMno1B6g":{"text":"Bartender Kris goes above and beyond for his customers. We came directly from a hot sauce ","useful":0,"cool":0},"USXgi3q_c2UWgwAVQB6VdA":{"text":"Good food! In town looking for a place to sit & eat on my own. Lots of the coffees shops d","useful":0,"cool":0},"EX5JcZGtzfg8Rx73tMp8qg":{"text":"Stopped in for first cocktail of the day...one of the best Bloody Mary's we ever had. Visi","useful":0,"cool":0},"n3YEH2bY3h8q_2Vh0GRNew":{"text":"Slow lunch. Took 35 minutes for a grilled chicken salad and 20 minutes for gumbo. Restaura","useful":0,"cool":0},"e70WMM2J8v615XJx4a1Z_w":{"text":"Causal yet classy, great local food that's presented well, tastes great and isn't greasy. ","useful":0,"cool":0},"5ut5tUd7LvZCL66Bn2wWyQ":{"text":"The beignets were ah-maxing!!! This was a pleasant surprise after visiting some more popul","useful":0,"cool":0},"jZZyocziFrH6frfQMvqOkQ":{"text":"The food was awesome great vibes and our waitress Destiny was great we will be back again ","useful":0,"cool":0},"aOA_-sFBb-1QsDdwtrTolg":{"text":"Short ribs, shrimp and grits and red sangria were delicious!","useful":1,"cool":0},"88nSc-smdQVIb3ME8s2noQ":{"text":"This place had the best margarita I drank all weekend. At first I was skeptical, watching ","useful":0,"cool":0},"eevsz7w91XP7xXuJkSFcoQ":{"text":"Been here many times never disappoints. The turkey cuban on the lunch menu is the best aro","useful":0,"cool":0},"l-DATglRpAGARxNHuSSXdA":{"text":"Jessica is the best server i've ever had! she gave me a bandaid when no one else would and","useful":0,"cool":0},"Lr4akmJaFiNCsj9FSdbRow":{"text":"Wow! Beautiful little place. Excellent service. Amazing food! \n\nGreeted at the door by a h","useful":1,"cool":0},"p5ycR4dUF7ylH-pGjuOVfQ":{"text":"The food was good and the service was friendly. The atmosphere was nice casual. We sat on ","useful":0,"cool":0},"0BPBjKfm-70PLIdDJy5rog":{"text":"We were first seated at the bar, and it was five minutes before the bartender even asked u","useful":0,"cool":0},"QugFMT2NdkwrSqg91rQWNg":{"text":"Bottomless mimosas for $12 and the food was great. My salmon was cooked perfectly.\n\nBusy -","useful":0,"cool":0},"hUIMQHpciTU-trR5LNsJsA":{"text":"What an absolutely beautiful restaurant!!! The food is DELICIOUS!!  We ordered the gulf fi","useful":0,"cool":0},"EqYOgTJ_sFQTBVyB9RWUxw":{"text":"This review is a shout-out to the phenomenal job Kris did with our bachelorette party of 1","useful":0,"cool":0},"jHTNyb21voV70oFSHJxBHw":{"text":"The first time we came here was around 2:30pm, and we were looking to kill time before che","useful":0,"cool":0},"CAMRDqskwUDG84Wpc5c_Lw":{"text":"Stopped in after the jazz fest to watch the warriors game. John the bartender put it on an","useful":1,"cool":1},"oIklZBC_i7rYMAig7rqxFA":{"text":"Great restaurant with delicious food and drinks... Our waiter Sam was awesome! He was stil","useful":0,"cool":0},"lIa4JllVPm2__SM4JLoq1Q":{"text":"This was our third visit to Curio. Each visit has gotten progressively worse so it will be","useful":0,"cool":0},"3PLAvY9Mlki00J092yGjzQ":{"text":"This restaurant is amazing. We were in town for work and found Curio on Yelp because they ","useful":1,"cool":1},"ophEGOu_KSCLduC9US8HQQ":{"text":"We did not eat at Curio, only had a few drinks before our dinner at Brennan's down the str","useful":1,"cool":1},"i9RsS2nwlBZPEl7MZyTSvA":{"text":"Curio is a must for an intimate and relaxing restaurant. We stopped by looking for directi","useful":0,"cool":0},"raoMLvmfLfyCoUCy8HxWCA":{"text":"Ate here with my bestie last night. Was so excited to try this new hot spot. I will start ","useful":6,"cool":6},"jc2sLwHc_MacsiU0EgQfMw":{"text":"A great place! Awesome, large balcony with plenty of inside options. All our food (gumbo a","useful":0,"cool":0},"k_c8kRrlMOKas9HMIwFNFQ":{"text":"Came here on Friday night. Not crowded - we were seated immediately. Perhaps that was a si","useful":0,"cool":0},"QOEjxfjTbRA26_IRl03OXg":{"text":"I hate to give bad reviews. We made reservations as it is Christmas and few restaurants we","useful":1,"cool":0},"E9VsTN1PSky2sNzTHjREhw":{"text":"Went in December while on a business trip. It was down the block from my hotel and had no ","useful":0,"cool":0},"9cRla7ugyn21TNDODk1nkw":{"text":"We came with a group of six people. The food isn't bad but the portions were small and it ","useful":0,"cool":0},"rnsTNhq1Xjbv-LSmT2YzuA":{"text":"Oh my goodness this place is perfection. Stumbled upon it after deciding not to wait one a","useful":0,"cool":0},"Ap-fmk0UwAfQ6bhfYNq_ig":{"text":"We ordered main course seafood gumbo, but we ended up getting appetizer seafood gumbo... w","useful":0,"cool":0},"JF-c6miW0YjomwUW-0nDSQ":{"text":"First time at the new restaurant this weekend, Curio on Royal St.... OMG what a place to b","useful":0,"cool":0},"p4hAaBMI6JJ4qXPDzTXlhQ":{"text":"I haven't even had the food yet and already I'm in love with this restaurant. We wanted a ","useful":0,"cool":0},"9YN4RkZS3IKVhCwHf43BYQ":{"text":"Food was great. Ambience is meh. It's pretty loud with the drunk bourbon st folks. They sa","useful":0,"cool":0},"3HBXEw_hGP2Ycu4Ql_fNQA":{"text":"The food is to die for and the staff (Oscar especially) is very knowledgeable about the me","useful":0,"cool":0},"BDx3vcrOkOesbEF6umi4fQ":{"text":"We chose this restaurant because all the top rated restaurants were booked for Saturday ni","useful":1,"cool":0},"n1pR4BKRm45jOEdt2IGIpQ":{"text":"Kris is the epitomy of a great host and bartender.  As strangers to Lousiana, you are neve","useful":0,"cool":0},"YvfRBMyE9AK3QJ3uX3HS8g":{"text":"Amazing and I'm picky. Had bottomless mimosas, biscuits and gravy and the grit tots.  Sooo","useful":0,"cool":0},"dIpV8gjHusBVBgus7dAx7w":{"text":"Very mixed feelings about this place. Some things were great, others were awful. (This is ","useful":0,"cool":0},"MrutjKuuRIvw2Kq0wL4BJA":{"text":"This is my first time at Curio. I came just for the happy heure!\n\nHappy Heure is daily fro","useful":1,"cool":1},"1T3fA5ie53ygvbkuSk_7mQ":{"text":"Experienced the worst Christmas lunch today with my family. We in total waited for 2hr wit","useful":2,"cool":0},"pCLLDiaZdG22AvZ6tm5q3w":{"text":"Visiting the Quarter with out of town family - stopped in for drinks and watched the end o","useful":1,"cool":1},"6mez_5aw5KthHRbCGRW2rA":{"text":"Started at the bar with bottomless bloody Mary's. Bartender was rude and grossed us out gr","useful":0,"cool":0},"51glehNwgFGsIj0Oe4p6mw":{"text":"Stopped in at happy hour for some drinks and appetizers. I've had a lot of gumbo here in N","useful":0,"cool":0},"FAhYwbaLoCp7i4BR4dgkqg":{"text":"Worse service ever, reserved for 12 was given 8 person seat, wait 45 minutes for water on ","useful":0,"cool":0},"bHcFpfz4asMdy6yaDGAM3g":{"text":"We had the waffle & chicken and crispy chicken BLT. Both delicious and staff were great!","useful":0,"cool":0},"gAq51J9C5gZeqI7QabDo3A":{"text":"Very good food and enjoyed the experience. Service was good, food was great. I recommend t","useful":0,"cool":0},"JZzrRlu-hlnwapvGZbo3UQ":{"text":"I was hesitant to eat here after reading mixed reviews... it was our final dinner in NOLA ","useful":0,"cool":0},"i6qMlX1nXZ3LsBj9tWGGWA":{"text":"The service was outstanding. Jessica was our server and she was great. We sat outside on t","useful":1,"cool":0},"JyBOc-mvASsWECBn01OAzg":{"text":"Awesome Happy Hour with a funky, Gatspy like ambiance. Attentive bar tenders and food serv","useful":0,"cool":0},"R_YneV8L1LtHmxlmDnx1-Q":{"text":"This spot is so fun! Great bartenders that make the visit that much more fun and enjoyable","useful":0,"cool":0},"Ktqj2sVfA87CLEYC9pXdOw":{"text":"Delicious and large portions!! Don't hesitate but make sure and set a reservation while CO","useful":0,"cool":0},"_hggCvcZ0Lr90l3B5FFQGQ":{"text":"Came for a late brunch with a party of 7. Ate upstairs area and food was absolutely delici","useful":1,"cool":1},"e93znvOwhkYIQyP5GhfruQ":{"text":"Enjoyed a wonderful Mother's Day brunch!  So glad we had made a reservation in advance. Bo","useful":1,"cool":0},"gBrK0FsrzT8_fvZUzovpZw":{"text":"Great Sunday morning on the balcony without any wait. Delicious food, live music from the ","useful":0,"cool":0},"FFig5KVzEAIiU8uoxYSqdQ":{"text":"We were in the area and decided to stop by to get drinks. My friend ordered a Bloody Mary ","useful":0,"cool":0},"XbGcL7zMh9q28SLdFcu2Mg":{"text":"Unfortunately this place seems to have started just mailing it in.  When it first opened, ","useful":0,"cool":0},"2GqiQub-5yJM2koFmbzggQ":{"text":"Had brunch here! The waitress was so sweet. The spinach & artichoke dip was great. I recom","useful":0,"cool":0},"wm_XUGKM3ctC3109sRK-2w":{"text":"Duddde. Where do I start? Last weekend we made a resi for our bachelorette dinner. (Sure, ","useful":0,"cool":0},"r1oijUUUW-B1PnyGywzwXQ":{"text":"We happened upon Curio randomly and decided to go in for breakfast. It was an excellent de","useful":0,"cool":0},"dwxz84f4PcfRUtJXGTmzxw":{"text":"Stumbled upon this spot while walking. Was really looking for a place to drink and be indo","useful":1,"cool":3},"YG78M1qT8RsLtp6nFAjzoQ":{"text":"Great food, great service! We also enjoyed the unique art they had on display! While a lov","useful":0,"cool":0},"5KhmNgG2UBT84km1YLy_Kg":{"text":"Wandered in here in desperation as lines were long everywhere else. The experience was won","useful":0,"cool":0},"fdhdsJ1sA_V6ikh47YNPaQ":{"text":"Just a block away from the craziness of Bourbon St. with better prices and service. We wer","useful":0,"cool":1},"s76q4EUDuzIz-_9Scmwdlg":{"text":"This place was so rude. Our group accidentally split a drink and the bartender across the ","useful":0,"cool":0},"jKxKVty6dw3uEhaeWY8Q5w":{"text":"This was one of the worst dining experiences of my life. Poor service. Disgusting food. Ob","useful":0,"cool":0},"NHgsILA_6gh8Y5QUwLfqDQ":{"text":"If I could put less stars I would. This place obviously doesn't want customers. Out barten","useful":0,"cool":0},"MBUgUKl1pfUKqUhUgW0BaQ":{"text":"Well we are staying a block away and this is the only restaurant near us open \nThey serve ","useful":0,"cool":0},"cCC9t8EMyvmpXf-mdjPOHQ":{"text":"This place was great! I stumbled upon it while on my own and sat at the bar for breakfast.","useful":0,"cool":0},"JXKvNDgZliXBmxm0tc3J1Q":{"text":"$12 bottomless rose during happy hour. Nice place to relax if you need to sit down asap .","useful":0,"cool":1},"ujqOfm1qRnNCuJIjCEmdXg":{"text":"THE SOILED STICKY MENUS ARE A BAD START\nCurio is a beautiful build out with prettified pla","useful":12,"cool":6},"pZCx9QNSU5mhcdavuZVjkg":{"text":"I'm almost afraid to write this review because I'd like to keep this amazing place a secre","useful":1,"cool":0},"OF6xvXG5B5BwdjUtUJ2NlA":{"text":"Great atmosphere, food and service.  Wonderful breakfast menu.  Recommend dropping in or e","useful":0,"cool":0},"CSbJaIyk09DP6QwK-ZBzWw":{"text":"So this was my first restaurant in New Orleans and it was not a good experience.  While wa","useful":0,"cool":0},"-NKrSHaHpOobl74_wXSqAQ":{"text":"I was down there for the Mardi Gras weekend and it was a great experience great people gre","useful":0,"cool":0},"pLRsGcNrWawjKMS_A5NTTQ":{"text":"Looks like a sweet little cafe but it turns out it's much bigger than it looks and the foo","useful":0,"cool":0},"kNJRV4gKt36IqHJOxVWSHw":{"text":"Stopped in here for a drink and snack after a less than appealing anniversary dinner at a ","useful":2,"cool":1},"NY_rXwWwqkN1v9pGsWBcUw":{"text":"We stopped for breakfast on our way to church. It was a wonderful meal  and one of the bes","useful":1,"cool":0},"5v0hkETH6sukwnMH3QbNcg":{"text":"Um...not sure what the hype is about. Service was terrible, food mediocre. I read all of t","useful":1,"cool":0},"Pf7tET3ZIPc4OS9zGLR1gA":{"text":"They make the best Cuban sandwich I've ever tasted.  My wife and I want to bring the recip","useful":0,"cool":0},"Qk1w3Hi3MxmT_kcbMtyB6w":{"text":"So Curio was Fantastic! I cane here with my brunch group.  we are normally a loud funny gr","useful":7,"cool":7},"eONYftPtUrT-CNE0HRgJAg":{"text":"Food came out extremely cold and waiter disappeared for an hour. Party of 14, got half of ","useful":0,"cool":0},"Gm1RwBsEOb1D-Z1WGHCA4Q":{"text":"He came in with a group of 8 people and the waiter was absolutely incredible. The deviled ","useful":0,"cool":0},"Kzu_UlEB4WVSicXWqcUyzA":{"text":"We came to watch the game but got so much more. The bartender, Ryan, is amazing!!! Serious","useful":0,"cool":0},"yB3A3BueXpEws-FCiu306A":{"text":"We stopped by this place to get a drink at a nice and cool place. We decided to give the H","useful":1,"cool":1},"xkYDv1hpa11GzyDG8ye6Kg":{"text":"Walk a block off Rue Bourbon for a hidden gem! Great service, creative cocktails and a dec","useful":0,"cool":0},"59CyCru7-b8r6oWUWu9irQ":{"text":"The music at this place is absolutely atrocious. It was depressing and put me in a horribl","useful":0,"cool":0},"GA3mSz6wIs5NOi5K7tSsEg":{"text":"The downstairs is small and slightly cramped. Gets pretty loud and you really can't carry ","useful":1,"cool":0},"HOpA4cvsKxswzOQR1iPhkQ":{"text":"This restaurant does not get the attention that it deserves. Amazing service, food, and dr","useful":0,"cool":0},"-L9SUIrLehrWvxKdI8DG5g":{"text":"Nice waiters and a good taste of music. They let me in with a skateboard, I was thinking t","useful":0,"cool":0},"hx36E_HF4DINKu6OMSqOHQ":{"text":"Fried grits & cheese balls were tasteless; duck dish had like 1lbs of tasteless pasta, dry","useful":3,"cool":2},"LgXlh8UxnPSPjcs8bt4X3w":{"text":"Seafood platter 4/5\nShrimp po boy 4/5 \nFresh seafood and not greasy. But the fried fish ha","useful":0,"cool":0},"sq-MX205KcsTLZts-eymqw":{"text":"Last fall, I went here by myself for lunch while my husband was attending a work meeting -","useful":2,"cool":2},"_R8cnIQwO9tJSOo3THk_3Q":{"text":"Love this place. The food is great and it's for an awesome price considering the quality. ","useful":0,"cool":0},"71YfPDx82k9ZF4UTD4hCWw":{"text":"We popped into Curio for a drink on our way to dinner elsewhere. \n\nIt was early, so the pl","useful":0,"cool":0},"G8rzqnZZVlL06IV_cNN9Xw":{"text":"Small restaurant and bar not too far off the beaten path from Bourbon Street. Great enviro","useful":0,"cool":0},"y-T_iiytrkTrGfBXMphQ5Q":{"text":"For the portions you get, it was overpriced... appetizer Caesar salad came in a small \"cer","useful":0,"cool":0},"meYurRiQPuZhHUJ7RtyzEw":{"text":"Awesome drinks, food was to die for and the service was outstanding! Great jambalaya and b","useful":0,"cool":0},"TmcDm9apdTWUFUnKwStlIw":{"text":"Our server was great.. but the breakfast food was under salted, cold, and some of it defin","useful":1,"cool":0},"P7HWLzt4ducDceNabiuvfQ":{"text":"My brother and I were here in NOLA on our last day. He never had a po boy so we were looki","useful":0,"cool":0},"yNBNVKgHjiGWnrmJ7xtOaw":{"text":"DO NOT EAT HERE!!!  When  the hostess is both brain-dead and grotesquely rude, you know ma","useful":0,"cool":0},"huXmzE7Zm6BRCCSL6eD0eA":{"text":"Decided to stop for a burger. The lady at the door was friendly and inviting. Our waitress","useful":0,"cool":0},"CqTvWvkFlIpuXGXA-XRfEw":{"text":"I had a really great experience here!  It was \"hot and new\" on Yelp's list, so I was intri","useful":0,"cool":3},"WXkauep76a6hK1YM_TME2A":{"text":"I was in town and my friends wanted to go to brunch. I had unlimited mimosas and shrimp/gr","useful":0,"cool":0},"lY56dNnBCAlE6ZzKCXxwUw":{"text":"First off I get it it's Christmas. The bartender has one of the worst attitudes I have EVE","useful":0,"cool":0},"zB1_ap3o3BWZJnXTizTwgw":{"text":"Truly a delight!!! The food was good, the setting was great, and the service was outstandi","useful":1,"cool":0},"TnnhfEpYOR0yO_Gwr0sNjg":{"text":"Came here for New Years Eve as Eater rated as one of the newest restaurants to try. Got a ","useful":0,"cool":0},"Jg0KQk5EAIsJWsIIrnNmww":{"text":"Fantastic food and drinks. Solid bottomless mimosas ! Definitely check this place out. I r","useful":0,"cool":0},"DAUW0-xOdR4eTtCcRsqL4w":{"text":"Updating my review from 2 months ago.\nWe had friends visit here in NOLA.\nMy husband took t","useful":0,"cool":0},"HmsfI0tBzDb3Rl77usyp-Q":{"text":"Food was decent. But the wait to get it was unbelievable. We had a 12:30pm reservation ord","useful":0,"cool":0},"FdpQ6VXYrW4qbVwkYjCliw":{"text":"Great place to eat, especially on the balcony, for a true New Orleans experience.  Staff w","useful":0,"cool":0},"UeJgSD2gZb82XsonrvPUAQ":{"text":"SO thrilled Curio is back open after it's COVID induced hiatus! Such an amazing, welcoming","useful":0,"cool":0},"KhBQCmXz17W5c0-i1aUJFQ":{"text":"Went here for thanksgiving dinner. Was really hard to get a table as a lot of places were ","useful":1,"cool":0},"hlW028VXOF9ZIjEg3ySC8g":{"text":"We enjoyed everything we had and want to come back for the s'mores dessert!! Drinks were g","useful":0,"cool":0},"9iVYzMHZot7BCbeDL-_vvw":{"text":"Everything was super great! The broth in the gumbo was phenomenal, the spring onions on to","useful":0,"cool":0},"yfBY_w8xK07vUskTz_NQNg":{"text":"You know you've found a gem when you plan to eat there twice on a 5 day vacation.  Shrimp ","useful":0,"cool":0},"YgXriJkl8T9cf6POTGqvPg":{"text":"Visiting NOLA and happen to find this place for dinner tonight and left with such delight.","useful":0,"cool":0},"d1kNuj8h5nxsJjrYJQJScg":{"text":"I first went to Curio just after they opened and had nothing but great food with great fri","useful":0,"cool":0},"31_fZbKNPWDq1LQZOkEjKw":{"text":"Clean and air conditioned is a plus! Lol! NOLA is super humid. Good service and food. Enjo","useful":0,"cool":0},"HJ5xP9FGFxCM30ZB8u9b2Q":{"text":"Awesome mussels to die for, delicious and meaty. The broth was like a soup. Candied pork r","useful":0,"cool":0},"uUm-X3ZoxrT1HCwybODbTg":{"text":"Chef off for Christmas?\nWe reserved a spot for brunch/lunch on Christmas Day. The bottomle","useful":0,"cool":0},"ZZm3-G-MTCRezqOC_EeFOQ":{"text":"Came across this place one night while enjoying a weekend in New Orleans. The people, food","useful":0,"cool":0},"W3WM0w-o2pDSp5EH4yN18w":{"text":"We were here Christmas 2019....thought we would give this place another try...\n\nI really w","useful":0,"cool":0},"nxHsx2XqRINQjSEWkLgZAQ":{"text":"We were excited about sitting on their balcony and gave it a shot with no reservation. The","useful":0,"cool":0},"6GkkDm4dop27Ue5tb9rndQ":{"text":"Very disappointing. We waited over an hour after ordering  for our food and when we asked ","useful":0,"cool":0},"dDLKEWVofZoVS1HFLTL6Xg":{"text":"Rude waiters. Never got our food after waiting over an hour. Watched several people who ca","useful":1,"cool":0},"ke4H1RpbCkZnwteaVEVqhw":{"text":"Great ambience and food. Crab claws were fantastic and they have the best hurricane in the","useful":0,"cool":0},"SQ9VQ64gLPCvXZIsM4knrQ":{"text":"Creative menu and excellent music lay the foundation for a great experience. Staff is frie","useful":0,"cool":0},"QC7RY8xhHS-fR6OK2P1JnQ":{"text":"I would do a million stars but sadly that is not an option. This is my friends and I  firs","useful":0,"cool":0},"AjLadH0Km6X2dYmjlLagfg":{"text":"If you are looking to get away from the nastiness of Bourbon Street and enjoy quiet, clean","useful":0,"cool":0},"vvPtqUQg7Q8_r2gtCwvZvw":{"text":"Their Candied Fried Pork Ribs were the best savory item I had at the Boudin, Bourbin, and ","useful":22,"cool":18},"NK1aDMFaKl6kjTocujwHQA":{"text":"We just had a lovely dinner. The food was wonderful and the service was courteous and top ","useful":0,"cool":0},"2tjSWzcE54KEn6XGhJdWUg":{"text":"Worst experience I've ever had in New Orleans.  Cheese and meat board had 3 deli salami, s","useful":2,"cool":0},"yaD96Vzg3cK8oE-2rlu_xg":{"text":"Delicious food. Everyone had the \"Taste of New Orleans\" and all of them were awesome. Serv","useful":0,"cool":0},"YZV88Xxpm63FYF9qgFd3oA":{"text":"Looking for great place for brunch with a great view? Curio is a great place! Off one of t","useful":0,"cool":0},"6BctB_EZnHXv-tqdNwVchg":{"text":"Mothers day brunch. Group of 4. Started with the grit tots...we all loved these. Little nu","useful":0,"cool":0},"4DF7b48-J9cMPNeD_9Ym7w":{"text":"I have to say I rarely get 5 stars. That was probably the best Cuban I ever had. If you st","useful":1,"cool":0},"Rf0IMAdjJtPFx4826rpEQw":{"text":"We had a great time here with their bottomless mimosas And the food and server were great.","useful":0,"cool":0},"lgYUFJ0uveLsg9nWOnSnnw":{"text":"We stopped in during a night when there were 30,000 convention attendees and how-many-Sain","useful":1,"cool":2},"ARtQr4ojF0S6DHx0QlkOWQ":{"text":"Y'all...Unless I eat Southern food from NOLA, I'm not interested. I mean seriously, CURIO ","useful":1,"cool":0},"zYVRykV1nAaESKC-4Adq-A":{"text":"Saw this place on Yelp and it had such good reviews. We waited about an hour to get seated","useful":0,"cool":0},"_N7Ik10JookkLuyUYMjZ8A":{"text":"We went here last night for the first time to  celebrate my birthday.  We arrived 15 min b","useful":1,"cool":1},"Ku_D9DfLTx65jSePQYLUHA":{"text":"Ate their twice during recent stay. Food was excellent. Service was pretty poor. First nig","useful":0,"cool":0},"ZXrJ-e034BJaNAvVKQiTqA":{"text":"Yumzzz on all levels from the drinks to the fish to the poy boys!! Highly recommend this p","useful":0,"cool":0},"HfDDQWGdDqoFnVb9pP55ow":{"text":"We only came here for drinks after dinner and left with a belly full of bomb food! We orde","useful":2,"cool":0},"hAdGP8fvR0wrAyBqFB_0TQ":{"text":"Pretty darn great.\n\nCurio is an ultra-popular restaurant in the French Quarter.  It's cute","useful":2,"cool":2},"vpsJUjhCEgrqwDfkwtbGpQ":{"text":"With a plethora of restaurant choices in New Orleans you might miss this one. I implore yo","useful":0,"cool":0},"c81_rmxH74iDjrAtQ3nrgA":{"text":"We went during Mardi Gras, so maybe they are better at other times of year, but everything","useful":0,"cool":0},"VIJawLNEjbnzbww8zeQn6g":{"text":"Hannah is the best waitresss ever!! Request her (:  \nFood is amazing!!!!!!! Got the crispy","useful":0,"cool":0},"E7Kg5f5s38Pr9K-ssU-UoQ":{"text":"Came for an impromptu date night last night with my husband and it was great. Super cute i","useful":2,"cool":1},"KLl62MxE1KLInAZoXV1bww":{"text":"I love this place it's so spacious. The bar is awesome. The managers made sure to come and","useful":0,"cool":0},"ceSPblEB5vrqPH9ikbgqHA":{"text":"Found Curio on Yelp and it was above & beyond what I expected. We were here in the wintert","useful":1,"cool":0},"o_e23tEv198UiOinygqhqw":{"text":"Yes, came here for a brunch and have superb combination. Gumbo and duck breast salad were ","useful":1,"cool":0},"H8Yd7_XQoDAzEEmCfQnFYA":{"text":"Best hurricane in NOLA! Also had an amazing crab cake. I've eaten here several times and h","useful":1,"cool":0},"kMxXnLlJiC-FWPtV5e8Epg":{"text":"Great Service! Had the Blue Crab Cakes and the Eggs Pontchartrain, it was all exceptional.","useful":0,"cool":0},"D0TzXmoEgtdCD6ohOlnNjQ":{"text":"First off, this restaurant is AMAZING!!! The food we had was so delicious and flavorful, i","useful":0,"cool":0},"_SINtnzS9KbZYVPjIup3PQ":{"text":"My boyfriend stumbled upon Curio this weekend while looking for a brunch spot in the Frenc","useful":0,"cool":0},"5EzBbywX9icLPerOTOYjIQ":{"text":"If you like cold grits, long waits, and dry beignets then I'd highly recommend this place.","useful":0,"cool":0},"wchTTq7xXB4Duf8-KKZUUQ":{"text":"I am a local...Prior to COVID, my friends and I were regulars for brunch and sometimes on ","useful":0,"cool":0},"agscmmN5La5H9Uu620otpA":{"text":"We traveled from Texas to Louisiana for my birthday vacation and I chose Curio above other","useful":0,"cool":0},"rkmggy9q813DONm0QZ9c6Q":{"text":"Great bar, great service, relaxed atmosphere.  Curio is easy to find, close to all the pla","useful":0,"cool":0},"5LX0CYhXlW0ToVGI7afvzA":{"text":"Brunch on a balcony with bottomless mimosas is exactly how I like to spend my Saturday's..","useful":0,"cool":1},"G-mQxSConMdjm6vi_bkrQw":{"text":"As someone who has had the privilege of traveling all over the world, I can say with full ","useful":0,"cool":0},"xpfboGW2vfnYAw4fopG9DA":{"text":"Wonderful food down in the Big Easy. Food, drinks and service Top Notch! Come see Evan at ","useful":0,"cool":0},"k6w6FNJI5GHHGb8Yo3ILGA":{"text":"My wife picked a spot and we couldn't have done any better! Got here early before the crow","useful":0,"cool":0},"6Q8NtfX3hpz5VTs_Fv6-0A":{"text":"My Bf and I decided to stroll through the Quarter this past Sunday because it was a beauti","useful":3,"cool":1},"-dRy8Jgx64b4r4nNXEbvfQ":{"text":"I went to New Orleans on a girls trip for 4 days, we were walking on the street and all of","useful":0,"cool":0},"yDCU1HLX9Zwh4ui14D0guw":{"text":"This place is amazing! The food is great, the service is excellent and the BEST cocktails ","useful":0,"cool":0},"2LZd6cW31inmgwY_feBE2A":{"text":"Stopped in on our way to the French Quarter Festival. Just wanted a quick lunch and we wer","useful":3,"cool":4},"ODr-tMnJFeuw976B3Jpp9w":{"text":"Went here for the Thanksgiving giving, meal was outstanding,  crawfish dressing delicious.","useful":0,"cool":0},"IAa6NrKZZpO2iD4qCWZFFA":{"text":"I'm so impressed by this place, the quarter got a good one. The manager and staff here is ","useful":2,"cool":1},"wC3pIYFu4niiRxQcn7GMaQ":{"text":"It sucks. Waiter was absolutely terrible and checked on us once an hour. Our food came aft","useful":0,"cool":0},"ShFzoLDMtCBVPZ2GJhXdGg":{"text":"SERVICE! SERVICE! SERVICE! My friend and I came here for lunch. We had a reservation for t","useful":2,"cool":0},"2t7eO9CE521wb36fl8vS6g":{"text":"Amazing brunch at Curio with 5 friends this past weekend! Kept our reservation for the bal","useful":2,"cool":2},"9Kl8I2Hm1X-N10GuaVsQvg":{"text":"Adam and I had a lovely bday dinner here. Seems like every place in Nola was slammed at di","useful":1,"cool":0},"Yjh_2qyJaa0mBqiF5DfQ-g":{"text":"A beautiful Monday on the balcony for lunch  Matt, the general manager and Devin our serve","useful":0,"cool":1},"myLJN6ySV8_U9v_qx7VGmg":{"text":"Solid bourbon selection. Only had apps, out of Crab Claws. Maybe next time. Great spot for","useful":0,"cool":0},"wWII4_VJfpFA2SOOxsmCXg":{"text":"Looks like a daiquiri bat when you walk up. Service was not great but worst part is we ord","useful":0,"cool":0},"3ZVV0yGlo02XE8zjvCuMiA":{"text":"A new restaurant in the heart of the French Quarter. We came on a Sunday afternoon for the","useful":0,"cool":1},"1yh6Gjy7-PC0KC8d0zqulQ":{"text":"Really disappointed with the spectacularly horrific service and overall experience.\n\nupon ","useful":2,"cool":1},"zw2jZZaREH7TSZrvMTKqjQ":{"text":"This is a very friendly place and located in the heart of the French Quarter. Our waiter, ","useful":0,"cool":0},"mqSn-6tpzwt1At6lbDN2KQ":{"text":"Great off street Bourbon location!   Especially at happy hour rates!  Ding a star.  My gir","useful":0,"cool":0},"eK0F14u-mp_UOWS6XcC8jg":{"text":"Curio was recommended by another local and did not disappoint.  As a foodie, I'm always sk","useful":0,"cool":0},"BwpSKy_42ODMU6BLB849cw":{"text":"Really good food & service! Their bottomless also lasts almost all day. They also have bru","useful":0,"cool":0},"Sq-ghrce7qSyV4DIpVE02w":{"text":"I have nothing but good things to say about this restaurant.  All I can say is AWESOME, AW","useful":0,"cool":0},"UfwsYwdtWEH1E0qLv_hBRg":{"text":"This food is mmm good. The food is superb! The cleanliness of the entire establishment is ","useful":0,"cool":0},"npB5cmfQ5J8nsj-5mSuRLw":{"text":"Our first waitress Pam was horrible, she had a stank face the whole time, after asking for","useful":0,"cool":0},"qOz52ZIIr65lwPEgZaTQWg":{"text":"Curio is the perfect little cafe located off the French Quarter, and we were very pleased ","useful":0,"cool":0},"x1xVvgUGLiL7z9lWhouCbQ":{"text":"Decided to roam to determine where to dine my last night in New Orleans. After walking wit","useful":2,"cool":1},"Q4CPxqukk2sAojpjx3lNMQ":{"text":"We live in Fairhope, AL and we are spoiled with great seafood etc.... This was an amazing ","useful":0,"cool":1},"px8zFOGa6USSmhRP4sluUg":{"text":"I went for Mother's Day brunch and generally holidays like that you don't review Bc someti","useful":1,"cool":0},"UIGIY9TpLx5dz19Gi62hig":{"text":"The food is so delicious! Pam is amazing! What a fun place with the best food! Recommend t","useful":0,"cool":0},"mccZl8rl0pHyvvX8ziYfzw":{"text":"***Bottomless mimosa review only***\n\nAfter calling about 4 restaurants or so, my husband a","useful":10,"cool":9},"pkqYC0JMB0FYOKekOd8G8g":{"text":"We were in NOLA last weekend after the hurricane. Many places were still closed.  This pla","useful":0,"cool":0},"Ud4L2-6_g0WzlZTEe5x9sg":{"text":"Jasmine is the BEST server in town!! This local spot is already great to begin with, but t","useful":0,"cool":0},"Tbfg8y9VJSnVewPh1fDB2w":{"text":"Just stopped in for a sweet treat. We shared amazing bread pudding. Hayden and Sarah are a","useful":1,"cool":0},"HgqY2KbQobqr13BYs2pdxA":{"text":"Very good food, drinks were a little on the sweet side and even though I ordered light on ","useful":0,"cool":0},"ruczDx0tIhmeuM21ULn8Rg":{"text":"Food was pretty good, but the service diminished it. The waitress did not check on any glu","useful":0,"cool":0},"PXQICvvik81IjoefZJKNAQ":{"text":"Food in LA has not been disappointing since I had another delicious meal before heading ho","useful":3,"cool":1},"u6WiUhP1eeeTmOxbf89Dpg":{"text":"Reviews here tell NO lies. Stopped here for lunch and enjoyed the brilliant patio with vie","useful":2,"cool":1},"gFInS53Tzd-GNKiIAb_uwg":{"text":"After searching for a place to eat, I noticed a restaurant with a balcony and that was a h","useful":1,"cool":1},"Jj1GqBg9DKGJxvLKwam0jw":{"text":"Just off Royal Street, Curio is a fun space and a nice respite from the hustle/bustle of t","useful":2,"cool":0},"Q2WEfFIxwDW9_PqTi02yKA":{"text":"I'm giving a one star because of the \"waiter/bartender\" on Christmas afternoon who was the","useful":0,"cool":0},"pILpTLAQU6Uh09TTsXBWiw":{"text":"So we were on our way to the ballet and needed somewhere to stop for dinner. We don't norm","useful":2,"cool":1},"dmPqXnt8LsY4mUNBOX_dqQ":{"text":"Great bloody Mary, fresh, spicy, and bottomless.  Get you one! (Four)\n\nBreakfast portions ","useful":1,"cool":0},"wEr6VczkgqrIaaKzAq2IYw":{"text":"#fatjared say...there was good and there was bad. Nothing amazing, nothing terrible. Just ","useful":2,"cool":1},"xa650aChn-Q44sFHPGsQaw":{"text":"Our first brunch stop upon arrival to NOLA.  MakeRoyal Street Breakfast reservations and o","useful":0,"cool":1},"ICTJntJ6LSMw23vi_IKZGg":{"text":"Stopped by for a solo brunch.  Had the Eggs Ponchartrain and a Bottomless Mimosa.  \n\nThe e","useful":1,"cool":1},"mxdpz01Ta48tSBO5q42Z9A":{"text":"This restaurant advertisement popped up on my Facebook feed.  So I  walked a mile from my ","useful":0,"cool":0},"ySOS8DgzxFAOYrBNalxI9g":{"text":"This is by far the worst restaurant experience I have had in my entire life!!\n\nA group of ","useful":3,"cool":0},"2__mdBVs3ybkXKiNDvf3QQ":{"text":"This place was a beautiful sight inside and out. My husband and I just wanted to eat a lig","useful":2,"cool":1},"ak-a62063lk-n9sbFwm4-Q":{"text":"We \"happened\" by this place after talking to a man on Royal & he had just had a drink here","useful":0,"cool":1},"1BUZiHzbbamdkJJXN72ydg":{"text":"Amazing new spot in the FQ. We were seated on the balcony with a view of the Hotel Montele","useful":5,"cool":3},"HZ17PrHHloVlbHY-McajsQ":{"text":"Curio had absolutely wonderful service and surprisingly delicious food and drinks. My boyf","useful":3,"cool":2},"qD_lTqYN8A5nG8i6u_FMdA":{"text":"Did a little yelpin' earlier to decide what I'd indulge in next. I stumbled upon this litt","useful":4,"cool":3},"o_TxYYHUIe4seiv61R2Yiw":{"text":"We came here for brunch on New Year's Day and got to sit out on the balcony. It was nice g","useful":1,"cool":0},"Mi0xr3GoSITQdhaaUWUJIA":{"text":"Service was good, employees was nice , i was getting  escorted to my table upstairs on the","useful":0,"cool":0},"sBcDF4kBvjzpFKtYxpBxVw":{"text":"Came here for lunch on the first day we were in NOLA.  It did not disappoint.  We had the ","useful":0,"cool":2},"Db3gbx3o3BvGZqMO5HDh9A":{"text":"My husband and I came here yesterday for some poboys, and we decided to stop in here since","useful":0,"cool":0},"3dGrz3iPF2dZIkIaud7_BQ":{"text":"Amazing find, very friendly staff, great drinks and the food came out constant and hot.","useful":0,"cool":0},"KspUy5-2ZqTCdqzzBZRA3w":{"text":"Had the Duck gumbo, pretty good. Thought it would have a little more or deeper flavor. Was","useful":0,"cool":0},"KV0PLcocEQqeLXt3BIo3Vg":{"text":"We ate at curio twice on our four day stay in the French quarter. This restaurant is just ","useful":0,"cool":1},"EUh7YrT3JGCYzDQGTaVa1Q":{"text":"My new favorite French Quarter restaurant. New Orleans food but not the standard fare. Sit","useful":0,"cool":0},"jy4igSrwXnZngu8jfQ7wOA":{"text":"Cute little corner spot. At first they were on a 20 minute wait. I stepped outside and mad","useful":1,"cool":0},"0qkJ3G18COALFeR3jQjX1A":{"text":"I am not sure why Curio doesn't have 5 stars all around.  \n\nAmbiance: perfect for a family","useful":0,"cool":0},"fi4-E5IHp2qa41GBHWa1JQ":{"text":"A cozy intimate space boasting a long bar and massive windows to let in fresh air... paire","useful":2,"cool":2},"O9FII94pTbqMoMlniM2Lcw":{"text":"Amazing food that was worth every penny! We started with the fried green tomatoes and cock","useful":1,"cool":1},"h-hbFWs2C5dVnJtFkrdlDA":{"text":"It was okay.\n\nWe made a reservation for a Monday which was totally unnecessary but it is w","useful":1,"cool":0},"WzIYChpVSfpk4QYC8nD4Xw":{"text":"The Eggs Pontchartrain was AMAZING! The staff is friendly and prompt. Beautiful decor upst","useful":0,"cool":0},"_1m8-0OaTf8_R0d0Zw0BWw":{"text":"Just gonna jump ahead on our trip to NOLA and get this review out the way. Curio is crushi","useful":12,"cool":11},"_HAkKdRQM3YQBDI0rv8YFw":{"text":"Planned on a late lunch/early dinner at Broussard's, but missed the 3pm cut off, so decide","useful":16,"cool":8},"avVJSvjUYs2cy8-h89vyug":{"text":"Went here for bottomless brunch with 5 other people the day before halloween and were sat ","useful":0,"cool":0},"G9eTo2umluZj7kBPO0qLcQ":{"text":"Hey yall! I'm back with another #BrunchinInNOLA review! This time I had the pleasure of go","useful":0,"cool":0},"vj6jRCUWtMqlhycLM9msXQ":{"text":"Oh man where do I begin. A group of friends and I decided to brunch at Curio this past Sun","useful":1,"cool":1}}