{"3EvtONUuPhJ4hcEHOk52Xg":{"text":"First of all, cover charge for bars in New Orleans are for suckers and tourists! The cat h","useful":3,"cool":1},"3UOLLpYZMcLRDn4P51PHjg":{"text":"Great vibes, band, and drinks!  \n\nNo Cover Charge!\n\nKeep in mind they take cash only.  Bat","useful":1,"cool":1},"IeZrGcRFu3Wf5XpVO6P8wQ":{"text":"So much fun here! Awesome vibe. everyone's happy and upbeat. The band was sick (unfortunat","useful":0,"cool":0},"3d3Wbsa_7qKz7vcSAK71sA":{"text":"Perfect setting, awesome atmosphere! My husband and I frequent New Orleans quite often but","useful":0,"cool":0},"P8aCYXCF2jJ4e0blDuP5ng":{"text":"love this place...one jazzfest, it was the monday afterwards, my friend and i were fried, ","useful":2,"cool":4},"dn7sIhdl3DquPoVeTvq9NQ":{"text":"I loved this place. Great atmosphere, reasonable prices and awesome music. It gets pretty ","useful":0,"cool":0},"6BfE-KEta6ZSa9sRK5uRKw":{"text":"We heard this was a great place to enjoy some jazz on Frenchmen St., and with a name like ","useful":2,"cool":4},"vBBugmrG8EJF9uVhIKOtVQ":{"text":"Best place in New Orleans we found and we did some searching.\n\nMusic and atmos were the re","useful":2,"cool":0},"dVHgU6JogsdyLd65inRmRA":{"text":"Visiting New Orleans and want to check out the music club scene where the locals go? You n","useful":0,"cool":0},"UUbqCuqWPGXVOqKWjKLqcg":{"text":"It lived up to most of the hype that I read about. Great live music and a super \"dive\" atm","useful":0,"cool":0},"UuFv_iKZA9IrwHVWxq2-HA":{"text":"The minute I arrived in New Orleans I had the Spotted Cat on the brain.  All the cool loca","useful":0,"cool":0},"BhRl4TJOvYIq9DUlruw-hA":{"text":"What The Spotted Cat may lack in girth it more than makes up for in personality: I happene","useful":5,"cool":3},"wRdea9C1q1VC9thQ_fcXag":{"text":"Decent bar, better in many ways but lagging behind in others than the establishment that e","useful":0,"cool":0},"qjwVpPpmT1BGTQKiWLDzhQ":{"text":"only thing missing was food.  so we left went to the street to but some awesome tastin str","useful":0,"cool":0},"N0vcKBurT0RMae6Aju2E9w":{"text":"So glad we only wasted one night on Bourbon street on our first trip to New Orleans (well ","useful":2,"cool":0},"iDp4rCHB4Y7H-pk1-UlGuA":{"text":"Went here for the first time last night and loved the atmosphere.  I'm not normally into p","useful":0,"cool":0},"sf6X61p0nGwXoE7kYpESrQ":{"text":"Stopped by for the live music - great atmosphere. $5 cover wasn't bad for a few hours of m","useful":0,"cool":0},"6suEKM9etBiYldJGsWqplQ":{"text":"You can always count on this local hotspot for great jazz.  We visit NOLA a few times a ye","useful":0,"cool":0},"XNmHjZMpujaPxqaY9c-GsQ":{"text":"I popped in here several times last week.  A really solid line up of different bands, play","useful":0,"cool":0},"FGC33rgHMYMeuDLbX06GvQ":{"text":"Good music & decent bar...but I wasn't a fan of the pushiness of the bouncer regarding the","useful":0,"cool":0},"RHDQMWsm0qnnN4FPEDyufg":{"text":"Came here on a Saturday around midnight with high expectations -- and was not disappointed","useful":0,"cool":0},"yNwgv9f4lKWbldtYD1Va5w":{"text":"This is the one place we go every time we're on Frenchman street. I like dive bars and thi","useful":0,"cool":0},"9XDMxPHoNQvebX4ccUMeQg":{"text":"The music was great and the drinks were cheap but there were so many people stuffed in the","useful":0,"cool":0},"DaNAZh40bjsECeul4kUmpg":{"text":"The Cat was so much fun. Great bands, great beers, great folks!  Who could ask for more?  ","useful":0,"cool":0},"j65jkdbY-vGNf1OIKOY3uA":{"text":"Very nice venue! Drinks were reasonable and friendly staff help.  We enjoyed every moment.","useful":0,"cool":0},"JNoJQDJuNtPsoihmX2XOLQ":{"text":"I love it! Jazz is great. We didn't see anything boring here, and we dropped by many times","useful":0,"cool":0},"hCRyGRxPwO2PuvTGMUdLEw":{"text":"Based on the suggestion from our COC bike tour leader Jeff, we spent a great night here li","useful":1,"cool":0},"TlMJ9Ip_f9QxUbtpr6lu_g":{"text":"Very cool little jazz bar!\nOff the beaten path onFrenchman street.\nWORTH the walk!\nCash on","useful":3,"cool":1},"cGYOVXii5-dWH8uWOsfrQQ":{"text":"So far, this is my favorite stop on my New Orleans trip.\n\nWas recommended to pop in here b","useful":11,"cool":0},"_BgPPaM1TH-CzyHs2oPaPA":{"text":"This place was definitely from another era. Lots of jazz and local flavored music. Only do","useful":0,"cool":0},"5tU7B7YDgDK4Y-JEmYYBTw":{"text":"Great music!!! It gets super busy so go early or plan to stand. Buy one drink per set and ","useful":0,"cool":0},"CUqrI-Ld-viwyjgmo26sdQ":{"text":"This review is for 3.5 stars.\n\nOverall a typically divey club with live music.  Not sure i","useful":0,"cool":0},"sxOYLs_v00eYwbKnyP0BaQ":{"text":"This is a great divey live music bar. The band was good, the dancing was fun to watch, the","useful":0,"cool":0},"SC5MMl8xSiDjf7_wNOIGgA":{"text":"Pretty cool place that has had pretty traditional jazz the few odd times we have been. Not","useful":1,"cool":0},"txBl_eIDyuUayhRlaHRHMg":{"text":"A delightful stop off in an evening of adventure. Be sure to stop in and listen to the liv","useful":0,"cool":0},"ygBpaY982FhilT8rXvvgig":{"text":"For those of you looking for a real jazz experience look no further than the Spotted Cat. ","useful":3,"cool":1},"AshJ6TBoqxqnJlDwqCr0KA":{"text":"My Lady and I got a chance to get into Spotted Cat when we were in New Orleans. It really ","useful":0,"cool":0},"dwmS8b9nl5MPu65E6xFADA":{"text":"Amazing place. Definitely on my top 3 best places in the city. I like the environment and ","useful":0,"cool":0},"Np-Um-acbTloZGc95VbHag":{"text":"Joi B. highly recommended The Spotted Cat to us, so of course we had to go! After a delici","useful":3,"cool":4},"JTEA5zcvzC4zl-fJV9Q5jg":{"text":"If you want a genuine New Orleans experience, get off of Bourban Street and head down to F","useful":2,"cool":1},"-JKMYKf4mtmlj9FMEQ_M8g":{"text":"By the time I got here I had had several drinks but I loved the music here! It was just wh","useful":1,"cool":1},"kYkEIZ8NmM-QLmS9lgmjVQ":{"text":"My favorite Marigny bar - tasty drinks, great live music, comfortable small room on French","useful":0,"cool":0},"2GCOooO5BS58PhlHs0e4LA":{"text":"Live music. Great location. Good prices.  I went twice during my visit because I really li","useful":0,"cool":0},"njr-TC1427Ulb4S9NWi4zw":{"text":"Music was great , bartender was rude. Ordered 2 drinks. He screamed at me that he didn't h","useful":0,"cool":0},"A2eG9efMAouv4t45tvmPJw":{"text":"This bar's service is the worst I've ever seen. The music is good but the bartender was th","useful":3,"cool":0},"gX8801Bho0j9CN9AvUf3sw":{"text":"La mejor fiesta de Nola está acá.\nAlejate del French Quartet que son todas trampas para tu","useful":3,"cool":3},"YM-b--yXnec24X4_CAg5jA":{"text":"This was a fun venue.  Small, crowded, but lively and authentic jazz.  A great place to ge","useful":0,"cool":0},"eyLPlxsiGmE3Fx_jz5I4Ow":{"text":"Best live music venue EVER.  Must visit for an organic NoLa experience.  Bring your ca$h, ","useful":0,"cool":0},"P_tYpgRA2-SOpUsJLCwv2Q":{"text":"Best New Year's Eve ever!!! Cheap drinks, great live bands, great party atmosphere. Not to","useful":0,"cool":0},"eQe-QWQ4boqfJFmebpr1Pg":{"text":"Amazing music spot, and better than average talent compared other NOLA spots,  but the ven","useful":0,"cool":0},"-GP9p4g8KQWdcyP6iYnEeQ":{"text":"Great dive bar with great music and an interesting clientele. Stiff drinks, bartenders wit","useful":0,"cool":0},"swDl2Hom4D9VfQb1F1fG1Q":{"text":"Great venue.. Nice crowd.. Good band.. Didn't dig overly nasal, limited singer but everyth","useful":0,"cool":0},"XC7Sv_jl5r-mpcaIArXzzQ":{"text":"No pretensions of glamour, The Spotted Cat is just about good jazz music. It can get very ","useful":6,"cool":7},"7yIOo_Nm1d0q6k0TxAsspQ":{"text":"Stopped in with some friends to watch a band play. There was a $5 cash cover & one drink m","useful":3,"cool":0},"dWfsOWLh7N1lzB6h13PWCA":{"text":"My favorite place on Frenchman.  25thHourGal and I saw Cottonmouth Kings in the late show ","useful":0,"cool":0},"1YWy8oseIBapmrk9hdM3eQ":{"text":"Went twice while I was in New Orleans. They get some awesome acts here. The drinks are aff","useful":1,"cool":0},"UWARdCEPI7HcmY2rvERpSA":{"text":"I really WANTED to like it here...trust me, I really did.  I even came twice in 3 days: on","useful":1,"cool":0},"Q6pzuKUqcUQU25JnbkOZNQ":{"text":"My wife and I were walking up Frenchmen st during a trip to New Orleans, heard fantastic m","useful":1,"cool":0},"Qxehi7fHA-Vw8hs6wZndQw":{"text":"人太多啦，位置不是很大，座位也不是很多，但是人气很旺，然并软，who care？我只是想要一个舒服的地方，默默的欣赏音乐，仅此而已！人太多啦，位置不是很大，座位也不是很多，但是人气","useful":0,"cool":0},"vF2uBaQnkizy4UShGGr8mA":{"text":"I was only here for an hour, but my friends and I had a pretty good time.  I'm not a huge ","useful":0,"cool":0},"XCRMcKSmuVy9MeqAaT0jFg":{"text":"This gem of a club on Frenchmen St is a home run for good music and friendly staff. Cash o","useful":0,"cool":0},"R5MbxxRjXFX8kJQeR_OSRA":{"text":"Had this wonderful night with Jumbo Shrimp Jazz Band. They're passionate and chill. The ru","useful":0,"cool":0},"-DK-TEPmQfXm0BP-ieaCQA":{"text":"Live music in New Orleans is great and The Spotted Cat Music Club brings it!  Be warned th","useful":1,"cool":0},"rPtQh_XCU6fSqkMh0ZesCA":{"text":"Great spot. Always delivers a great drinking and music experience. Whether you're a local ","useful":3,"cool":2},"If_1p10ndpx0Jm1GtRM1Og":{"text":"Five stars for the music. Deduct two for the smoking allowed policy.","useful":2,"cool":1},"4FofExX-YcLvCAAgl11eIw":{"text":"Twice per trip to NOLA, without fail. Arrive early and watch a couple bands. There's lots ","useful":0,"cool":0},"wfEIrRvrR9ZtJCaGPFbTbg":{"text":"Drinks, music, people, and bathrooms were all great!  Recommended by a local on the first ","useful":0,"cool":0},"VngJcXpyTzpqX0u-7xgZCQ":{"text":"Great place! Visiting from Australia and this place was on the must visits! So glad we did","useful":0,"cool":0},"E3YbtzGZefR58zfjJyqE3w":{"text":"Don't get me wrong, I like the Spotted Cat overall. But at some point it made it into all ","useful":1,"cool":0},"pyXhe8d_gJgnL7Re-Upanw":{"text":"Best music room in NoLa!\n\nI had a great time here.  The drinks were very affordable.  The ","useful":1,"cool":2},"eAmxbgnOH-V3GwZzncz1gw":{"text":"This is a cozy spot to watch talented musicians on Frenchmen-- it's pretty much a watering","useful":0,"cool":1},"52_uwpwzY4iI0jkJ_097Hw":{"text":"Another bar with music on Frenchmen.  They are cash only so I sat around waiting for someo","useful":6,"cool":3},"8v7C51c1a2SAeSR7lHDRew":{"text":"The atmosphere is always great, as well as the live music. The bartenders are friendly and","useful":1,"cool":1},"cKuH5VujIyMAxubIrgDeFA":{"text":"Loved this place, the live music was awesome, very talented bands. Drinks are good. Place ","useful":0,"cool":0},"-XT-mUUDFAojK3uohF__SQ":{"text":"When I arrived at the Spotted Cat for the first time many years ago it was love at first s","useful":1,"cool":0},"tx-E_x32vPs6r7kzPP9eIA":{"text":"My husband and I got out for a date night and stopped into the spotted cat after dinner.  ","useful":0,"cool":0},"FYO9NhSoI7Ma6YAfKUdq6A":{"text":"Amazing place!!! Caught 3 great shows on my last visit. Just a few doors down from Adolfo'","useful":0,"cool":0},"699YHuxnoFtpuc-We2o_pw":{"text":"What a cool jazz club and what a cool experience visiting it! I was attending a conference","useful":1,"cool":0},"8toYM7MA7y0U6uNl8CiATQ":{"text":"The Spotted Cat was the highlight of my visit to Frenchmen Street.  I wanted to check out ","useful":1,"cool":1},"VPNIKsFxZeVClDUxN2N8eg":{"text":"It seems like people have had a lot of good experiences here. Mine didn't match up.\n\nIt se","useful":2,"cool":0},"dXEyAs3ZyFVptvmntE2sag":{"text":"Any time of night this bar has authentic New Orleans Jazz. Fill your ears! It is worth the","useful":0,"cool":0},"R_Xivnez1SQQwSKB_czw2w":{"text":"My favorite bar in the world!! Whoever books the talent sure knows what they are doing. Ev","useful":0,"cool":0},"yHFPfvyHuccigcHdjO6koA":{"text":"This my favorite music bar on Frenchman street.  Always a great band and fun crowd.","useful":0,"cool":0},"IP5SQImS6CqoslcQezfHjA":{"text":"Music was ok, a bit loud. Crappy drinks and $3 bottles of water... Are you kidding me? IMO","useful":0,"cool":0},"nMFvtm2hgMbtd4pZlvjQqg":{"text":"I guess everybody knows about this place, so one more 5-star review won't really have any ","useful":0,"cool":0},"WT1S1ed1niROmHK2OyuiPA":{"text":"One of our bartenders at another place recommended this place...he recommended Frenchman S","useful":0,"cool":0},"NEpDPeZC9yzlKKEzhGSkeA":{"text":"I was not impressed with this place, few places to sit and a member of the band had his bu","useful":4,"cool":2},"JjsmjPMv1mzv1wXWUxoRWQ":{"text":"Low key, all ages venue, meaning from the 20s and 30s on up to the 50s and 70s. Limited se","useful":0,"cool":0},"uLxo517bCWqYPeFJxqaVIQ":{"text":"Here in \"the Big Easy\" with my wife for a conference.  Wandered into the spotted cat and r","useful":0,"cool":0},"rfqQaOdNdVnI2FwEIjvGag":{"text":"There is a piano in the bathroom, and the piano has been drinking, not me, not me, not me.","useful":7,"cool":11},"y0ZQm6SpXwAJtKHY19_lsQ":{"text":"Good music, chill atmosphere, and Newcastle Brown Ale in the fridge - can't get much bette","useful":0,"cool":0},"soKO2OPed_dQPc7yjGlYjQ":{"text":"Fabulous music and great jazzy vibes on Frenchmen! It was packed when we went in but the $","useful":1,"cool":1},"V4raHqLMtNT8hZCc3RVPtg":{"text":"Amazing Live Jazz - bonus some nights there's spectacular locals dancing too!\nNo cover and","useful":0,"cool":0},"Amz8KIOQA2y_7JEd5zg5Pw":{"text":"For music and nights out in NOLA, we felt most inspired in the Spotted Cat. The neighborho","useful":0,"cool":0},"Jw9ymk8wBP6iLis7nrYK0Q":{"text":"Fantastic venue. Small and intense. Great musicians. \nWe were there on Feb 21 and really, ","useful":0,"cool":0},"APn3NjygRN5ErBeJZdtlGA":{"text":"Great place for great music. Very chill atmosphere and the bartender is super friendly.","useful":0,"cool":0},"Lcod1r56p_GL8YjXZxkr1g":{"text":"What a great spot! Never a cover, which is absolutely amazing. This of course means the qu","useful":0,"cool":0},"D3eQtuxCmejTvuI22pHWxg":{"text":"This is another one of the great spots on Frenchmen for seeing spot-on musicians play a va","useful":0,"cool":0},"l0PZgN1rghW8cxlgJQ9xuw":{"text":"Great dive for some live music and true New Orleans feel. They have a good beer selection.","useful":0,"cool":0},"lalAsG68QLa5WGt6Slboow":{"text":"Came here on a Friday evening. Place was PACKED! Got our beers and stood in a little corne","useful":2,"cool":1},"oKBFTkXEo_9i22jNDuXwxg":{"text":"Not only is the music scene absolutely stellar, but the bar staff could not be any more si","useful":0,"cool":0},"M8ejV6GNVlZhRNkaAFvo1g":{"text":"I would not recommend this place to anyone. Our bartender was very cruel. We paid for our ","useful":1,"cool":0},"QwdbQIkBQn9R9MhZYMrMRg":{"text":"Really neat place great music.  Was kinda bummed that they didn't take credit cards. We wo","useful":0,"cool":0},"hpFanMbGHW069geaBdROPA":{"text":"One of the most enjoyable place for Jazz,lindy hop lovers.There is no cover charge.Wonderf","useful":0,"cool":1},"bDWmEe8OYY2Pu_hocRL_MQ":{"text":"Off the traditional beaten path, this little club is as good as it gets in NOLA. It only g","useful":1,"cool":0},"6GtN5t6dmFvI12L4mZGuyg":{"text":"Fantastic. Had this place recommended to me both by yelp and by locals and it did not disa","useful":0,"cool":1},"zyILaBWsrWWZGgvFcG0awQ":{"text":"The Spotted Cat represents what many visualize a night out in New Orleans is:  great music","useful":0,"cool":0},"k1xlnseSFvBshLoTN20U-Q":{"text":"Excellent music for a $5 cover. Drinks were steeply priced and stiff but worth it for the ","useful":0,"cool":0},"06whxEMDImJ5lAEPZqBd7w":{"text":"This was my introduction to New Orleans jazz, and it certainly didn't disappoint (on a Tue","useful":2,"cool":0},"BXZd_rnIuxcLX8YgnmTAAg":{"text":"Crowded as shit but AMAZING!\n\nIf you like jazz you must stop here. $5 cover. Well well wor","useful":1,"cool":0},"CyeVua56QwBFBiVxnLScrA":{"text":"Pretty decent bar, the staff met were very friendly.  There is a one drink minimum to list","useful":0,"cool":0},"Y7O8182tRra-IWsAclfsvg":{"text":"This place had great live music, nice and loud. Loud enough that I couldn't even hear the ","useful":0,"cool":0},"6L03poIu8YQOMLSNE85IgA":{"text":"We only had a chance to stop into a few music venues and, of course, held our ear up to a ","useful":0,"cool":0},"qJBEKH4LThnMTi8fLvtHzg":{"text":"We enjoyed several fantastic bands at the Spotted Cat when we visited New Orleans.  It was","useful":0,"cool":0},"OwhXRZvMfEK8MfySvwxhQg":{"text":"Seeing Kristina Morales last night was the highlight of my trip to New Orleans. Her voice ","useful":0,"cool":0},"PwYbexzwcgUUdHxNVHa0_w":{"text":"We stopped in here and the music was good! I don't remember who the band was, but they wer","useful":0,"cool":0},"h0IRh5o1ckjsEwRnEgh91g":{"text":"Love this spot. Local hangout with great music. Plan for cash only.","useful":0,"cool":0},"MDPI0--tBDO5oJl25HZnyA":{"text":"I was visiting NOLA from NYC and wanted an authentic jazz experience. This place hit the s","useful":0,"cool":0},"lBCNDZTTtzH8opnIGQ9izQ":{"text":"Great performers do not require a swanky club! The Spotted Cat is a no frills bar that bri","useful":1,"cool":0},"ctLXEcn787ElNXdOepczxg":{"text":"Amazing live jazz!  Went on a Sunday night and it was packed like a sardine tin.  Very tin","useful":0,"cool":0},"pRHCPBtKJ9GINlVCOlEFyQ":{"text":"The music was decent (country blues) and the cold beer was a thirst quencher.  But nothing","useful":0,"cool":0},"wnVIz4OK8pW4zOg9BjCPFQ":{"text":"Walked down to The Spotted Cat on a Friday night and really, really loved it. The live mus","useful":1,"cool":0},"oX-jKyswnK14hUrsdL0RhQ":{"text":"Truly a gem. Walked 2 miles just to go see a band we had already seen the night before. Gr","useful":0,"cool":0},"Vl8q8tUp5ngqRCL2LOnT5Q":{"text":"Awesome music. No cover with 1 drink minimum. \n\nThe club is fairly small - you'll be cozy ","useful":0,"cool":0},"8kwWw5zhI23JdahWvUs1LA":{"text":"Consistently great music all the times we went there! Intimate, charming and kinda stuffed","useful":0,"cool":0},"5y0UycmkYGjL3uxTzk9M8g":{"text":"Gotta find these cats!!!!!!!! Man they blew my mind!!!!!!! One of the best musical experie","useful":0,"cool":0},"5XkgtV8Xt7e-jZDZh1q5sA":{"text":"Cover charge or no cover charge, this is the best place for live music and New Orleans jaz","useful":0,"cool":0},"55hD6GzfXnW894G0vk5JpA":{"text":"Really nice place to sit and listen to live music. I enjoyed the band and the no cover. Ye","useful":1,"cool":1},"Z0NC9Y24MJEmU-USuJ_Gog":{"text":"Excellent place to hear music! It is extremely small with very little seating. You must pu","useful":0,"cool":0},"jKvSdBgrsiUXFOQxSVZ4WA":{"text":"My favorite on Frenchman street, music quality is always top notch. Seems to get a mixed c","useful":0,"cool":0},"GidgK6-BzDrSlU6Z63bpag":{"text":"I guess this is a legendary spot but when I went it was so incredibly crowded it was very ","useful":1,"cool":0},"vhGGYRVjZg2yFjnPSRm2ew":{"text":"I love the Spotted Cat. It is my favorite place on Frenchmen Street, and my go-to venue if","useful":2,"cool":0},"MW3ioqKzydcgp6RV6adMOw":{"text":"Oh yes! One of our favorite spots to go to see live music on Frenchmen.\n\nIf you want to bo","useful":1,"cool":1},"JhFg9yc95zVSCU2YEn09rQ":{"text":"I loved this place. Visited on a Friday evening. It got pretty crowded by 9pm. However, th","useful":0,"cool":0},"dxH-f7WXAv0hq9k2lTAcHg":{"text":"This is always my \"go to\" music spot in NOLA as if you get the right show it will be the m","useful":2,"cool":3},"-tUN7aYdwC-2X2n-6lc9uw":{"text":"Great bar. Music was awesome. Bartenders were very attentive and friendly. Love this place","useful":0,"cool":0},"rTBmOserLm9PO1eRMxgOjQ":{"text":"Great joint, good music, cool bartender, but the no cover means a steady stream on people ","useful":0,"cool":0},"S922B9W_Fnb9Nt8wJTu9Og":{"text":"This place is so small inside, you can barely move! But Frenchman street is so hip and coo","useful":0,"cool":1},"ehWoLllLNrG9AhlagRDrGA":{"text":"Nice little place and some good music and friendly staff. Need more tables and chairs.","useful":0,"cool":0},"ULDUsiBToLI76wFmBXJ-hA":{"text":"I was in New Orleans for the first time, the week after Mardi Gras 2007, and I was actuall","useful":0,"cool":0},"NGhKpav4JNm_9jJVe_9pJQ":{"text":"Had a lot of fun here.  Was packed but good music and great service.  Despite it being pac","useful":0,"cool":0},"fS7m03OitdjvWfaBO8pqDA":{"text":"Off the beaten track but on the streetcar line so you feel safe at night. Music is a littl","useful":0,"cool":0},"lJc8hHJqOjSxtglzWJQI0g":{"text":"Great music and drinks but super crowded and cash only.\n\nMy friends and I got the whiskey ","useful":0,"cool":0},"qCKpCAJhZs5t8cLV13yJCg":{"text":"Fun local spot to listen to great music and take in the NOLA jazz scene. Great variety of ","useful":0,"cool":0},"fe0ubuxhYoB8p9XOE35wLw":{"text":"The Spotted Cat is my kind of place.\n\nHaving never been to Frenchman Street (I know, I kno","useful":5,"cool":3},"xLX7qszI-08P74we6Blhvg":{"text":"Got there at about 3-4:00 and got two seats at the bar, no problem. As we were leaving abo","useful":0,"cool":0},"MIQfjo4XcqE8fPZHg_ZhtA":{"text":"This was exactly the kind of place I was hoping to find.  The live music was awesome and s","useful":2,"cool":1},"1wYtJaVMSz1VBRnN49bQDA":{"text":"I love this place!! Frenchmen St. is an awesome spot for music and Spotted Cat is top notc","useful":0,"cool":0},"bCXSuUiPhZXRjiVnFxQ5xA":{"text":"Nice bar- no cover just a one drink minimum per set.  The music was great!  Really enjoyed","useful":0,"cool":0},"YUOKordF8oV89veoJLoZzA":{"text":"Good music and had some folks dancing too. So, had some good entertainment. Drinks were ok","useful":0,"cool":0},"2lpXoNFezYUGrTEXqeySRA":{"text":"Crowded, noisy, some say smoky, but I never noticed. The Cat is all of that and more. It a","useful":0,"cool":0},"k-w7R9u20gsyQk85PIhKkg":{"text":"Great crowd. Super friendly bartenders, didn't get her name, but one of them cured my hicc","useful":0,"cool":0},"vwX7DtYQDHkxbdoVGq6F2Q":{"text":"There is a poem by Jayne Cortez that states,\n\nDroning a drowsy syncopated tune, \nRocking b","useful":1,"cool":1},"FPjvXgeXNE2k-nR8yhEK7Q":{"text":"As good as it gets, cosy, homey ambience, no pressure to buy a drink. Mellow crowd and a g","useful":0,"cool":0},"zkf0_pD2u9bZP-3Cq7xLgw":{"text":"I really love this place , the music and ambiance. As typical- one bathroom for women that","useful":0,"cool":0},"9a7rwXIeXvACBznFB6w3Bw":{"text":"What an amazing experience! This was one of my favorite things I did during my weekend tri","useful":0,"cool":0},"tbsSKcp5mFGvQjTsgM7dBQ":{"text":"Most jazz places in New Orleans that have a recognizable name and presence charge a cover.","useful":0,"cool":0},"Q58aekGAJFQqtCYd77ukgg":{"text":"This is a tough place to rate, the music is wonderful, the accommodations are very poor.  ","useful":0,"cool":0},"DW3gJdTD9M9tGqVvDw3NDw":{"text":"What a fun place. Great music and dancing and yes, there is a purple piano in the girls ba","useful":1,"cool":0},"CUs4l9hBohGlpRFcM1WvWQ":{"text":"No food or draft beer at this cash only jazz club, but don't let that stop you from having","useful":4,"cool":0},"hM5xcOYwt5KTVx8Nk2wB3w":{"text":"One of my favorite tourist experiences in NOLA. Amazing jazz music and even a little dance","useful":0,"cool":0},"RZHodw9UBedSeTMcMgmE9A":{"text":"While this place is pretty small, the music is pretty awesome. The place is small and fill","useful":0,"cool":0},"zyPMFgREyow5NdcqwOY-dw":{"text":"Absolutely fantastic! We visited twice during our trip, and loved performances by the New ","useful":0,"cool":0},"v8Tv7rJqWaVAcpiNkcq5tg":{"text":"My favorite place on Frenchman Street! The band was amazing, drinks were cheap and heavily","useful":0,"cool":0},"HINBGd1TC5sQiGqmqRQLcg":{"text":"We were directed here (and to Frenchmen Street in general) by a friendly bartender on Bour","useful":4,"cool":2},"Mt7QtTtkttUkT59kuuEe5w":{"text":"NYE 2018 so this seems like a cool spot and we've heard good things from friends. Their NY","useful":0,"cool":0},"S-Qoz9REpw4ryqavRhXGgw":{"text":"CASH ONLY. PIANO IN THE BATHROOM.\n\nokay, enough caps.\nwhile the cash bar kinda threw me of","useful":2,"cool":1},"izi3T2tomSthK2j-Sj9lfA":{"text":"Amazing music!!  Best in the strip.  Bartenders are god awful; slow, miserable... drink yo","useful":0,"cool":0},"QinmidkDa0UJrRUi38-hsQ":{"text":"This is one of my favorite places to check out live music on Frenchmen street.  Although i","useful":6,"cool":3},"Lt0oX0rwt4VKIXzXG6yDfA":{"text":"If you're coming to New Orleans and want to go out somewhere other than Bourbon St., hit u","useful":0,"cool":0},"Hxb5fQ2kkU6_X_BB2oALUQ":{"text":"I always try to come by the Spotted Cat when I visit NOLA. I love the music and the atmosp","useful":0,"cool":0},"BX4ztbtiLp4EzDkgv_-t6w":{"text":"The 1 drink minimum per set is recommended, but not strictly enforced, as I see some peopl","useful":0,"cool":0},"Xt-SAmNjqhxQQy2xucRhGQ":{"text":"Among the mecca of jazz clubs, restaurants, and bars on Frenchman's Street, this is one of","useful":0,"cool":0},"U_Nb1PkMtUvxY5HjVlWpYg":{"text":"Still a fantastic little dive to catch some old school washboard jazz and some stiff drink","useful":3,"cool":1},"Y8-euyRxu7kIAoNpzc0Xyg":{"text":"This is a fun place. The music is awesome!  You can't help but have a good time. And ladie","useful":0,"cool":2},"aMQ4MEFwpfofE6OguRUalQ":{"text":"No cover. That brought us in immediately so our ears could test out the waters of the diff","useful":1,"cool":1},"wCp0CSwEzd8t8R8dtZXCoA":{"text":"Fun, intimate atmosphere.  You will hear great, great Jazz here!","useful":0,"cool":0},"zoMoF91f64DStezTYpC2jw":{"text":"Visited on Christmas Eve with my mom at 4pm to see Sarah McCoy's Oopsie Daisies. We were w","useful":0,"cool":0},"Z7JySy0WVsQ3sjifsb4U6w":{"text":"We love this style of jazz, piano, horns, wind instruments. Mildly touristy, but many loca","useful":0,"cool":0},"6z2l7te-O2hArB1vFAlfLw":{"text":"$5 cover and completely worth it! Amazing music, nice bartender, relaxed atmosphere of Fre","useful":0,"cool":0},"6UESTVBesiKv1CaDO-bsJQ":{"text":"Joi B who is the NOLA Yelp Ambassador puts it best:  The zeitgeist of jazz clubs.\n\nOn week","useful":2,"cool":2},"am_SXgQNzlZcHCir61349g":{"text":"Great music, 2-3 bands per day. Reasonable priced drinks. Can get crowded, so go early!","useful":0,"cool":0},"x6Aq_PoJrhyN9-8UD-viBQ":{"text":"One of the better bars on Frenchmans, live music and ambience is ideal for a nice night ou","useful":0,"cool":0},"pahe05EMdr_0FW86BFhj9A":{"text":"Love this place!  Great jazz music.  If you want a more authentic jazz/artsy feel in New O","useful":1,"cool":1},"lmdYDfUiohOSlWtG93LIqw":{"text":"Went here on a Monday night at 11pm and it was packed. Live jazz music. Only took 5 mins t","useful":0,"cool":0},"kbxNy6G-uIK1DOOKoLCt9A":{"text":"Like walking right into the 20s... Great music, reasonable drink prices. Just wish it was ","useful":0,"cool":0},"8NSO00dQBJM8kStkipsWBQ":{"text":"A great little jazzy club that's definitely touristy (how could anything in NOLA NOT be) b","useful":0,"cool":3},"bs8HoLssFaBih_k1CvaS3w":{"text":"Stopped in during the day as all the locals mentioned this was a must see for jazz.  Overa","useful":0,"cool":0},"M4eLAEZXUT4sr12J3RI3pQ":{"text":"Great hole in the wall music club - if you like music with a different take this is your p","useful":0,"cool":0},"gCa--uqcFkHe7sioVa_Kkw":{"text":"One bartender for a very busy bar on a busy night.  Should call this place the Smelly Cat.","useful":0,"cool":0},"VxO_KCCPRXkweWzXWI5hRA":{"text":"Great spot for awesome music. There wasn't any cover at the door, only a 1-drink-per-set m","useful":1,"cool":0},"9oe9155aJ_QbMeAJ976Xkg":{"text":"WOW!!!!!!!! Waaaaaay to good you don't want to tell anybody about it and keep it all to yo","useful":1,"cool":5},"ZS3lsCV1wSOBomFns7KmKg":{"text":"Holy crap who let the cat out of the bag?! (Pun intended). Apparently this is supposed to ","useful":0,"cool":0},"--ncZ8RrD_yIxzFxyyttXA":{"text":"We stopped by the Spotted Cat every night of our stay in New Orleans.  Several nights we e","useful":1,"cool":0},"lALD6LU0011DAhUQr55LmQ":{"text":"one of the better bars with bands playing that i've been to in new orleans. very simple la","useful":1,"cool":0},"Q-0rFbdbcQc5YZZ7_gcQKA":{"text":"I spent a total of about 10 minutes in here and am regretting it still. Those 10 minutes s","useful":3,"cool":0},"ert4kg1Kv1WN1xBAoJVyTA":{"text":"sunday night features pat casey and the new sound, and i highly recommend going at least o","useful":0,"cool":0},"dZ9dtdyFFa74RqIC2yJ14g":{"text":"During our recent August trip we spent four of six nights at The Spotted Cat.  Main reason","useful":4,"cool":2},"RvK3-2VUyobacS5HGPTgzA":{"text":"Jazz, blues, great vibe and a piano in the bathroom. WHO could ask for more. This is one o","useful":1,"cool":0},"D3p-7a7hkQ5WVWHc2tXAAg":{"text":"Great place on Frenchman street with fantastic music. If you are looking to have fun but e","useful":0,"cool":0},"IbbrpsLKl4VZCWAwN3VQnA":{"text":"Our Lyft driver told us to go here on our way into town.  She was so right.  A hot sax pla","useful":0,"cool":0},"J_MixYpjAeH8uAW-9kuGpw":{"text":"There is no cover here, just a one drink minimum per person. The drinks are served in smal","useful":0,"cool":1},"oMS-1wrH6myKBbBYN0gJpw":{"text":"We took an Uber from the French Quarter to Magazine street after dinner to hear local musi","useful":0,"cool":0},"XTQ9mKtZ___8z61QyiT5Jw":{"text":"I must while in NOLA. Was told to swing by Frenchman street while I was staying in the Fre","useful":0,"cool":0},"0TcBfBYjsqqJeydbGTc46Q":{"text":"My favorite music club on Frenchmen St., hands down. The music is intimate, it's jiving, i","useful":0,"cool":0},"8h_KLhLqlKpcYXj8pFgPjA":{"text":"Love the music, people are friendly and you can't beat the fact that it is next to the art","useful":0,"cool":0},"C-oALwvJvFLredjfr9BejA":{"text":"Awesome little gem. \nFull of flavor. \nJAZZY Flavor that is.\n\nIt was so much fun to meander","useful":5,"cool":4},"V6d9Gw0zb51FSFNFYsj79w":{"text":"With a recommendation from a random cabbie & a waitress, we headed to The Spotted Cat for ","useful":1,"cool":0},"jzh_9D9-oCBgJnFj4mnS4Q":{"text":"Great music venue. We only dropped in because we were in the neighborhood and heard this a","useful":0,"cool":0},"WIVvbTcNOz67lZAWHM7k7w":{"text":"Went to this place twice in a row for two consecutive nights and loved it. The music is ou","useful":1,"cool":0},"qhT-BIr4w1_-BLlrW1NAMA":{"text":"A smaller, more intimate (but by no means quiet!) hole-in-the-wall type of place on French","useful":0,"cool":0},"hJ4hMtF4XnK_1c7HSidOkA":{"text":"Cool place when you want jazz on Frenchman st. Note that is kind of small and usually pack","useful":0,"cool":0},"WDNDOmX0us7tu7TE2VlosA":{"text":"The Spotted Cat is where it's at. I know that I'm rhyming up front, but take me seriously.","useful":6,"cool":5},"zOXObyGEDFEitPLY7KzeUw":{"text":"Over crowed and music was not very impressive. Bar tenders were not very friendly or ready","useful":0,"cool":0},"FXFAXojI9bFx0ZMIkfg9Iw":{"text":"Toller Laden. Superfreundliche Bedienung. Dazu Meschiya Lake & The Little Big Horns. Perfe","useful":1,"cool":0},"LRewHleTvYYcMiN7fpSmCA":{"text":"We followed Yelp and went into this jazz bar. it was Thursday night and crowded with peopl","useful":0,"cool":0},"i86cccJn0JA9kP_kOWeWLw":{"text":"Okay place, stupid to have to pay for water. It's also cash only and requires a cover to g","useful":0,"cool":0},"w5arLIycKC7-9o5IequPRg":{"text":"Came here just for the band. Decent selection. Standing room with a few tables and seating","useful":0,"cool":0},"a6EYo8COKyzeTHobsh2OfA":{"text":"The place had more character than a Disney movie,\nThe drinks were cheap and the vibes were","useful":6,"cool":0},"1ld6HiiMQwvA7GiKLJ7AcQ":{"text":"What a fun little joint!  We had been to New Orleans in the past, but we had never explore","useful":0,"cool":0},"FbgszxTwJvuN2aKfE_MErQ":{"text":"Great music, excellent drinks and the dancers are awesome to watch. Really enjoyed this pl","useful":0,"cool":0},"ZmGTlMsxpyfKkznX24yjDQ":{"text":"Almost too packed to enjoy... Lots of standing room, not a lot of seats BUT lots of happy,","useful":0,"cool":0},"yyZy36Q3XkvByd53n_xrLg":{"text":"This bar is open earlier than most on Frenchmen. It offers reasonably priced drinks, frien","useful":0,"cool":0},"pltIsm1M9LnVXAciGVmQYA":{"text":"Wow amazing Sarah McCoy singer and pianist. Awesome accompaniment with the bass player. Th","useful":0,"cool":0},"2eIdByWgjbloAlB3gPG13w":{"text":"Outstanding experience tonight.  Every couple of songs new musicians join the group.  Spec","useful":0,"cool":0},"ibGOgUpp8WW18YhZkeOepw":{"text":"Nice spot wish is was a bit roomier but it works. The band is tucked away in the storefron","useful":0,"cool":0},"x2aEDx5zSdLPPT4ZdKlhcg":{"text":"My favorite jazz bar in NOLA. Every single time I go, I am never disappointed with the mus","useful":0,"cool":0},"gZhWgMkIpJR9NOO3ytd-Bw":{"text":"Another great cannot miss place in NOLA. Great music, and located really close to the FQ. ","useful":1,"cool":0},"wK3Z2_zSP_e3LO6I-ZLowg":{"text":"What a fun little place. They offered free swing dancing lessons on the night we were ther","useful":0,"cool":1},"0aSbRYJRSsGRoTZnG0VkUQ":{"text":"In about 12 hours, I will be on an airplane heading back home.\n\nSo for the next few hours,","useful":2,"cool":2},"Cp21JdpEQE1ct4SS5QDQhg":{"text":"It's not about the venue... It's about the talent. They have great talent playing when I w","useful":0,"cool":0},"Gv09q5AXNAOxMBqGXkODEg":{"text":"Best live jazz venue in NOLA! CASH ONLY, but they have an ATM machine inside. Great vibes!","useful":0,"cool":0},"rHx04gIX9X7MNs0avvooTQ":{"text":"Has always been one of our favorite go-to spots for great traditional jazz.  Nice vibe, fr","useful":0,"cool":0},"1BPkcmhuL4t0QFgQhLlccw":{"text":"Whenever I'm down in NOLA, I look forward to my walk from Canal Street the vibrant and jaz","useful":0,"cool":0},"3KnCK-qb4V5aRo4Rg4WakA":{"text":"Really nice place for good music and drinks. They play really good music at this place on ","useful":0,"cool":0},"naWX1qzOXY4QPAy0I874tQ":{"text":"Along Frenchmen Street are many jazz venues with great and talented jazz musicians and sin","useful":0,"cool":0},"jflXLNG02G_Xh5kJAc-ayw":{"text":"Great jazz music playing when we popped in. Perfect bar to grab a drink and get out of the","useful":0,"cool":0},"6OmwdrWICnuT0IO0SvBD7g":{"text":"Cool spot! Very small bar, not much seating. The band playing was very talented and fun! A","useful":1,"cool":0},"IhHvkMhAsfdTk2w4BESUjA":{"text":"This legendary club has beckoned to me since I first set foot in New Orleans, but it alway","useful":0,"cool":0},"6RKUDrky3uu1nGqpyHjIqg":{"text":"Awesome casual place to walk in and here some amazing jazz. Stella on tap, done.","useful":0,"cool":0},"rql-hcicPYvB7cxRyNZttg":{"text":"The spotted cat was a great place to watch jazz. I really enjoyed the energy of the place.","useful":0,"cool":0},"6Rvg5wP50VBiHJ3cnCLMCw":{"text":"No frills, divey bar with great jazz music. No one was talking because the band was that g","useful":0,"cool":0},"sB31ZuPV4MfSPMr3WqVfHA":{"text":"I spent a week there one night, and loved the great live music.  It's a dive bar, but I lo","useful":0,"cool":0},"IeszYdpoxlEl7yTqRiAqXg":{"text":"Awesome music! The drinks are great; the catnip is awesome. The place is packed any night ","useful":0,"cool":0},"cJJhzCqr2r7BTHrF-hCgwQ":{"text":"This place is fantastic! Don't miss this place if you're a fan of traditional New Orleans ","useful":1,"cool":0},"Zrrfta8zD03LIGdkGzliHA":{"text":"Great little dive bar, with a variety of musical acts nearly daily. Drinks are reasonably ","useful":1,"cool":0},"B0MYUnMC9lJrwdrOjk6XsA":{"text":"Amazing jazz band, totally packed to the gills on a Thursday night, tells you that this is","useful":1,"cool":1},"X7WoN0KKTNqKungre_A9KA":{"text":"Loved this place! One of the best places to chill out in New Orleans!! Definitely recommen","useful":0,"cool":0},"VHYuUDgS4RuOOUOka3AtLA":{"text":"No cover means long lines and standing room only for this live music club, but in this cas","useful":0,"cool":0},"C-596ne3m2HtVmhCcBPjJg":{"text":"Whiskey and some Jazz. If you want either of these, I'd come here, but make it early (We g","useful":0,"cool":0},"SKdWb-XfIKF1TNIMSYm5JQ":{"text":"Why can't I find a place like this in San Francisco? Great music, dancing, reasonable drin","useful":1,"cool":1},"N5NBRjG60wdJeIp0HcMomg":{"text":"One of the best bars I've been to! It was a fun place for local music and a nice atmospher","useful":0,"cool":0},"uzIH5_-2mJ0r_YQc2EOrAg":{"text":"It's a little steamy in the summer, a little smoky late at night, and practically perfect ","useful":2,"cool":0},"PGS8g0Y0VwmruD5PUrnBFg":{"text":"Nice small space club with a cash only bar. 21+  Went on a Wednesday night and it was pret","useful":0,"cool":0},"N39PAbomIbktknE4Y8BCLw":{"text":"Had a lovely time at the Spotted Cat Music Club.  After reading the rave reviews we had to","useful":0,"cool":0},"unvHChWIu2wVuiu9d9nR4A":{"text":"Best spot to catch all the best music on Frenchmen St. Cheap drinks, awesome bartenders Br","useful":0,"cool":0},"cz6orEhfrcB0sI9SI7uENg":{"text":"just do yourself a favor and go to this place.\n\nIf you're like me and Bourbon street isnt ","useful":1,"cool":1},"8oL5AlogGBOYr7Kan2LhLw":{"text":"Really cool bar in New-Orleans. Located on Frenchmen street, this bar provides live music ","useful":1,"cool":0},"5rN-bWraPP2G5GjzFGATzA":{"text":"The raspy voice akin to Louis Armstrong drew us in and kept us coming every night of our v","useful":1,"cool":0},"CJxWVmL80tgmpcf7qZkjwQ":{"text":"I love this place. period\nAlways a great time and tremendous musicians performing.  I thin","useful":3,"cool":1},"jrO1Uz4TVApf0dos56Vrww":{"text":"After searching for some good live music in NOLA we came to this place. Amazing live bands","useful":1,"cool":0},"Hr5fOg6sAO4nSy_JXc97OA":{"text":"Went here on a Monday night and saw the regular Monday band: Dominic Grillo & The Frenchme","useful":1,"cool":2},"OhRgCuA5oBd1Y8_fHIvB4g":{"text":"Amazing! Great music, reasonably priced drinks and a great atmosphere. Also if you go on a","useful":0,"cool":0},"ZO5vYfMHa0RBZV3kZA8nmQ":{"text":"Good alternative spot as opposed to the ratchetness of bourbon street. This was the first ","useful":1,"cool":0},"4xhn1VMQvu-bOogHb_ypqw":{"text":"We stopped by on a crowded evening and it quickly became apparent why there was little roo","useful":0,"cool":0},"1ZH7YXVu8RDNxjyI-j0rtQ":{"text":"Very unique place! Unique band! Old guitar, washboard with cans and a harmonica. Enjoyed!","useful":0,"cool":0},"TAXTFThMiphXZtF4ibhBPQ":{"text":"Good bar, good music, fun scene, and a staple of Frenchmans. It is crowded, and I would sa","useful":1,"cool":0},"9s7jTjwMxVFoKgy3fWnpmQ":{"text":"A visit to Frenchman Street just wouldn't have been complete without a stop at the Spotted","useful":1,"cool":1},"iw5jEHvx3o0kefWZlPCZUQ":{"text":"3/5 gets a little tight! (cash only)\n\nthis is a cool spot, always one i forget about but w","useful":5,"cool":1},"ZQlcXW47pCneEFpUxR_fgg":{"text":"Bouncer tonite was a total arrogant ass. Not worth it. Music was terrible. Headed across t","useful":0,"cool":0},"I7-Y5CxuXbNDCeBwVnhRoQ":{"text":"Although there is a lot of music to see in NOLA, Frenchmen St. is a must and The Spotted C","useful":1,"cool":0},"D_YTmVPRbZKzr8_q_rup1w":{"text":"I and some friends were walking down Frenchman St, exploring the music scene. We could hea","useful":0,"cool":0},"J02uciz9P2QeC2bQJyNdSg":{"text":"Great music here and consistently a fun place to go any night of the week that they're ope","useful":1,"cool":0},"yRjS3qwUUqYFcV3V-oNdxQ":{"text":"Fun music venue and chill bar in a popular, hip and non-touristy part of town. Good music,","useful":0,"cool":0},"2mq7dw529ooEdqZGf_fyZg":{"text":"Awesome venue for live jazz and cold beer. There are a few seats at the bar and around the","useful":0,"cool":0},"aiptmziqjTxEYBRBTXrx6Q":{"text":"This was the coolest bar / club we went to during our trip to New Orleans. This is definit","useful":1,"cool":0},"mbSXHBDF4oFfArkYnAlIKw":{"text":"really cool spot.  get away from Bourbon.  $5 beer bottles.  Good selection.  Good live mu","useful":0,"cool":0},"QUi8Ff7HJoV_N9Hdfc-v0w":{"text":"Still another review for bars on Frenchman...most of which I was sure I had reviewed. I th","useful":7,"cool":7},"Y9tDrDQilaA-eomIbpvGqw":{"text":"I really enjoyed my time on Frenchmen street in NOLA, and this was one of the places that ","useful":0,"cool":0},"-iu4cDQTwOvikbJF0UZP_g":{"text":"Great atmosphere, amazing music, the art walk/market is right next door .  Great place to ","useful":0,"cool":0},"U5MBlG6FeM-6zl4G3FfmUw":{"text":"Fun Jazz club on Frenchman with a color staff and clientele and great music.  A friend of ","useful":1,"cool":1},"_I1_d5AcbSwl2Holo9PM1w":{"text":"If you want a taste of real New Orleans night life, come here. It's not about getting drun","useful":0,"cool":0},"wEYEbg0ZgxDKXw52ZCVhdQ":{"text":"$5 cover charge. Awesome music. Too crowded, can't move.\n\nWe stayed there for about 15 min","useful":0,"cool":0},"4Vi10Lkd4QdIQKV9E5Um8A":{"text":"We asked around for suggestions on where to hang out for the night, we were directed to Fr","useful":1,"cool":1},"NY2XTUkvm2eFPjeabHTUuA":{"text":"Came here on our first stop of the night. This place is the real deal. It is what it is an","useful":1,"cool":2},"UExVSx6ksthZDsOm2TEQXw":{"text":"Had a really good time here last night. Yes the seats are very limited. So unless you get ","useful":0,"cool":1},"0nDin2VLTBbLdDc2IHLKYw":{"text":"Great live music, and ambiance that represents the best of New Orleans. Well-trained bands","useful":0,"cool":2},"Oists1mA1QYeyE9MyI4JPQ":{"text":"Sweet little jazz club on f-man street.\n\nCash only.\n\nThis is where the locals hang.","useful":2,"cool":2},"2-xQ4ZNLN_nR0j4zSCs3lA":{"text":"Dug this jazz club/blues bar in a great neighborhood.","useful":0,"cool":0},"flytuvLx0DbAZmpmaa1wBg":{"text":"You want music you go to Frenchman Street. It's CASH ONLY, so make sure you grab your mone","useful":0,"cool":0},"ditBtm24n5IQObAlAprI5A":{"text":"If you want to experience New Orleans music and fun. Please get yourself to the Spotted Ca","useful":0,"cool":1},"u3j3r5X5oZqEVYlBikt4SA":{"text":"Go here! The live music is always super original. The bar is cash only and it is very tigh","useful":0,"cool":0},"C1I_dsHKxpWkTqn0ZaQF6w":{"text":"Great place! Cash only! Lovely music. The area is a bit sketchy but the bar is good. Piano","useful":0,"cool":1},"2Y0v95SSjT0cHxIKGslweg":{"text":"Pushy bar tender, cash only, one drink minimum. I guess they don't like the idea of a desi","useful":0,"cool":0},"qUtqje4tKMkPWbD9PG0B2g":{"text":"All the reviews say it all...In my opinion the best Jazz Club in NOLA...Non-pretentious on","useful":1,"cool":0},"KXTsuicpeFCsviWMCJkLfw":{"text":"It doesn't get much better than the Spotted Cat if you are looking for a live music venue ","useful":2,"cool":1},"Hl4XpzEz85Gp_TFngg_4Wg":{"text":"The Spotted Cat was the first jazz bar we moseyed into Saturday night on Frenchmen St.... ","useful":0,"cool":0},"sGWmrBW7adwjsof1XiKSGg":{"text":"Best venue I´ve been for live music in NOLA! I strongly recommend Frenchman St. instead of","useful":0,"cool":0},"bRzbDfVSXp5WcRNuUbDxdQ":{"text":"Can't really speak to the service as we didn't order anything, but the vibe was great. Sup","useful":0,"cool":0},"dr1C-BD3-CK0RT0BvSE6Sg":{"text":"Super packed!! Good music! Had to visit because Don and Brooke go to the Spotted Cat for N","useful":0,"cool":0},"-AR6Ni5fM48nGsxdCUSoBg":{"text":"I loved every second I was in this place. Music so good you want to eat it or rub it all o","useful":1,"cool":0},"9PFbvG0mUAhTYk14R6gf3Q":{"text":"Great ambience and lots of fun! Theres no cover, but a minimum one drink to stay. Came on ","useful":0,"cool":0},"Tdi328FHcbaVTHLiQjmeoA":{"text":"I came as a tourist. So take this review as you will, but .......\n\nTotally Authentic. \n\nI ","useful":6,"cool":5},"WSzP9pHdxmu-WGyTRa_Fiw":{"text":"A very cool music club. They had some good artists performing and there was no cover on a ","useful":0,"cool":0},"GzmFqGLOPGtEP3YhOg8N7Q":{"text":"An iconic representation of what the city has to offer. In my experiences, this spot has h","useful":0,"cool":0},"3kS9OwtH1TFETWs1TCm17A":{"text":"This was the first stop on our Frenchmen Street adventure.  Amazing music, a good vibe, an","useful":4,"cool":3},"_nUujruVTcd-tYLTaV9_Xw":{"text":"When you're in your twenties you find Bourbon Street, beads, and frozen drinks with silly ","useful":0,"cool":0},"A6Ty5meBQW06AIQ3Hzt0Mw":{"text":"Excellent jazz lounge/bar on Frenchmen street. It's a small crowded with limited sitting r","useful":0,"cool":0},"latVhgcGCZAONOzyjO9wYw":{"text":"Pretty solid music venue. Cash only, live music, not very big. Good place to escape the Bo","useful":0,"cool":0},"TVuF4kqBDU_UiUAmfvAnMg":{"text":"Neat place to stop by. Music was fun very hard to get drinks drinks were so so. Enjoyed th","useful":0,"cool":0},"xQyk3ULefShEUO01YY9c2g":{"text":"Amazing jazz music with no cover. This was my favorite place we went in new Orleans by far","useful":0,"cool":0},"6RA9Mju9Op4mwDaH8tLF6g":{"text":"This was the coolest jazz bar we went to in NOLA! The musical act was amazing, the drinks ","useful":0,"cool":0},"GJP0PxU1KK2090pvwBPqZA":{"text":"Disclaimer: I resisted from giving 5 stars only because it is cash only. I know a lot of p","useful":0,"cool":1},"A2G-kzUMEs-LWSJisjY8Nw":{"text":"This is a very cool place. The staff is friendly and the music is excellent. Also, I purch","useful":0,"cool":0},"1aB84WB-fbcpyvxGYhkX7w":{"text":"It's all about the music at the Spotted Cat. Drinks are alright, and the place is tight bu","useful":0,"cool":1},"KFrTtz-HYozZDkuxC_OrCQ":{"text":"Awesome music, only five dollar cover. Ambience is very nice, people dancing having a good","useful":0,"cool":0},"KHLsuqBKbxDCg-fGQ_1NKQ":{"text":"Some people call this a \"dive\" bar, but I wouldn't say that. I've been to dive bars. Place","useful":6,"cool":1},"_t-cMi5Laj87ofx8C6ydfg":{"text":"Amazing bar and live music venue.  We came late night while there was a quartet, the place","useful":0,"cool":0},"xIYh2kKFUo9gUiww3cjS4g":{"text":"Way too touristy and crowded on the Tuesday evening I was there in August. The walls are c","useful":0,"cool":0},"v1WP_SjqYsY0ARqMVlZ2jw":{"text":"$5 per person at the door on a Saturday night, super packed around the time they play live","useful":2,"cool":1},"zo_I4NbRnZaw29jwZesHQw":{"text":"Walking into the Spotted Cat is like walking right into the set of a movie/musical set in ","useful":3,"cool":2},"RsIK5M0JNeLg3lFrrYljtA":{"text":"\"The Cat,\" as the locals call it, is definitely the place to go for jazz on Frenchmen St. ","useful":0,"cool":0},"A6ruO_vMC9BNsdxsBcspbA":{"text":"One of the greatest music venues in the world. Wonderful musicians, fantastic bar staff. I","useful":1,"cool":0},"eYr18tpcq_lCAjcUMIImiw":{"text":"We came here while on vacation from many recommendations from different sources. The music","useful":0,"cool":0},"SDySeDQFyxEIStSXQk5BZQ":{"text":"Great little music club. The last time we were in town, it looked like it was being held t","useful":2,"cool":1},"VYrv9cbb4KXU72P4Z9pYyw":{"text":"This was so fun we hit it up twice. Went on a very crowded Friday night and back for a mor","useful":0,"cool":0},"_X0sD4Krh03LrvGWhT44AA":{"text":"best spot in town for great swing and hip jazz music... fun place to be!","useful":0,"cool":0},"92A7T5WVHx0Ku6jyr2RPYQ":{"text":"Saw Sarah McCoy and the Oopsie Daisies, I mean this from the bottom of my soul, it was a l","useful":3,"cool":3},"13b5HuibkTXp6b1wAz9-qg":{"text":"Great for great dancers or just good listeners. One of my top 3 sites in Frenchmens Street","useful":0,"cool":0},"6iGLYBqDv2_k2z13u40cZA":{"text":"I became a better man the minute I walked into this place     The music that was being mad","useful":5,"cool":4},"S_CxnNSzl2-r6StAXe6s5A":{"text":"One of NOLA's true treasures....and possibly the best live jazz club in the world. \n\nIt's ","useful":2,"cool":0},"Z08YeJI44nptiqvkspKscQ":{"text":"Just a great jazz club.  It's going to be crowded, but there's a reason for that.\n\nGet awa","useful":0,"cool":2},"x5xdSZJA7fZvwxi5KQLCrQ":{"text":"While I preferred the Apple Barrel nearby, I had great times at The Spotted Cat. It was a ","useful":0,"cool":0},"zZbbB99lqqjmVqBPQKQbrA":{"text":"OMG this is the best music joint in town, sure is small, its crowded, the drinks are ok an","useful":0,"cool":0},"yUcxcRcXvnfrJ3_uDZZw1A":{"text":"Situated on the right side of Frenchmen street, we were recommended to check this place ou","useful":2,"cool":1},"60RxYA5CqOcYC6hboIuH8A":{"text":"We went to the Spotted Car after a huge dinner. After really only experiencing Bourbon Str","useful":3,"cool":0},"9kX02kNKCKk91tDcbsQPBA":{"text":"We went to this club with four people and it was standing room only, dont expect to sit do","useful":0,"cool":0},"gZ-SEa98u9VRDm_vB6I5Tg":{"text":"Come for the music and stay.... Frenchmen's street is amazing and this place was really fu","useful":0,"cool":0},"Yhcui3euyZiN_Qw1vr0p5w":{"text":"From May 28, 2015 (Thurs) and May 30, 2015 (Sat). This place was recommended by several lo","useful":0,"cool":0},"H5aEMClugym_AYOcHoth2w":{"text":"My absolute favorite place on Frenchman. The music is incredible and the bartenders are am","useful":1,"cool":1},"mRKxSy1uHaHH-amTDtCE9w":{"text":"This place was always packed. The music was good and the drinks were pretty cheap. Althoug","useful":0,"cool":0},"A6DLEqYhW9ZJo_eDVSuqtw":{"text":"Gonna be better if the can accept credit card instead of cash only, small place but music ","useful":0,"cool":0},"9LD-xEnPb8Ocusq2L1pU6w":{"text":"I'm so glad my friend who used to live in New Orleans told us about Frenchman St! Our uber","useful":0,"cool":0},"nJLCn5WwcP3CT8Y3dHruTQ":{"text":"Good times, though it was super packed and we could only hear the band. Still...what a coo","useful":0,"cool":0},"-o5wNxsOXrULeSyd5KvA_Q":{"text":"Stumbled into this club twice and both they had great bands there! And no cover! At some p","useful":0,"cool":0},"m-st7CbWopcLbgkehCSLBw":{"text":"Grrat music!  No cover but they do ask that you buy at least one drink. Naturally there's ","useful":0,"cool":0},"_gDVjwRSCn1x6sl59WTllA":{"text":"If you've ever wondered what it feels like to be a canned sardine, this is your place.\n\nWe","useful":3,"cool":2},"DciFRYZkkO5XTOVTXNSVQQ":{"text":"Really cool bar with live music! It's cash only but the local bands really make the experi","useful":0,"cool":0},"aKmgKUAtaPvOTCXNqm2ypQ":{"text":"So when I was a younger man I used to love to find nice random places where I could listen","useful":1,"cool":0},"zbQVq8Zl6lCuC77Ft8eR7A":{"text":"Love the music and the drinks are reasonable, but go in the evening. Came at 6pm w the sun","useful":0,"cool":0},"U7naMXSBkr53SsBscQvjwA":{"text":"The spotted cat has good live music. No cover and a one drink minimum which doesn't seem t","useful":0,"cool":0},"vQHFWpeZ0xO27ePSGLJ7Yg":{"text":"I had heard the Spotted Cat was the place to be so that's where we went on a Friday night.","useful":0,"cool":0},"4O609W1vHGXtQ4sYAQ6JYQ":{"text":"Frenchman St. and I have a thing going on. There was not an establishment that I visited o","useful":0,"cool":0},"peXgh32Dzat6kKVuZ77LyA":{"text":"By far the best night experience I had in NOLA. Located on frenchman street, the \"local's ","useful":1,"cool":1},"Aux_EqZK7Qu5zWLjsYp9oA":{"text":"Awesome time with great music played by Mississippi Gypsy. I danced w a sweet Army boy nam","useful":0,"cool":0},"CpMmWF7vDK8BEAGCUsS6SA":{"text":"The Spotted Cat is the first bar in NOLA to ever card me! AWWW YEAHHHH!\n\nWith that said, t","useful":1,"cool":0},"dl_x8G2V7CH_ig7OOAytew":{"text":"A little ways away from the other more mainstream bars, but definitely worth it. Live musi","useful":0,"cool":0},"STfhaImyxTOZmNSwJfExgw":{"text":"I went there 2 nights in a row: the atmosphere and music were fantastic. No cover, drinks ","useful":2,"cool":0},"pSfoiVmy8ZM7dOtt62TT9w":{"text":"We only had time for one jazz club, and this was it. No regrets! Great band, cold beer, un","useful":0,"cool":0},"Ijktm0mdv5DcKUKg5m03uw":{"text":"Came in towards the end of a set for a band led by a fantastic sax player. On a Sunday eve","useful":0,"cool":0},"-MiW_NUksD5v26Z0CBBrdg":{"text":"Great music, decent drinks, fun crowd.  We thought the music was even better than other pl","useful":1,"cool":0},"-w_sjc2Igkp__GjSFkhUZg":{"text":"Lively, fun atmosphere, and great music. It is crowded but what else can you expect? Some ","useful":0,"cool":0},"rG379WHO-XrDFivglcxw2w":{"text":"Awesome spot to grab a drink and listen to great music! No seating options besides a littl","useful":0,"cool":0},"AvVh6hWNTrdlNLzfvihxXQ":{"text":"For the music it's an amazing spot. It's basically a dive bar but inside somebody's house ","useful":0,"cool":0},"HEkyhcYeViYdexKQcfr4jQ":{"text":"We were trying to get as much live music as Jazz Fest was ending and this place sounded gr","useful":0,"cool":0},"F1DDuTKwqDY2TQIaDgBVog":{"text":"At one time, pre-Katrina, The Spotted Cat was one of the most authentic, laid back jazz cl","useful":0,"cool":0},"dqYfZSE5XLE_aIVCKamnhQ":{"text":"My favorite find....the best music....just plain COOL CAT!\nI was so inspired and happy to ","useful":0,"cool":0},"WPGeHXtkaX-ZxP1MzroGVw":{"text":"This is one of the best music spots I've found in New Orleans.  It's almost at the very en","useful":0,"cool":0},"vIYZd1tmoBNvrxJKSoDhXQ":{"text":"We hit The Spotted Cat on night one of our visit to NO and had the most terrific evening. ","useful":0,"cool":0},"ZyXQqCo6nyR9eTfZX0LSMQ":{"text":"Awesome intimate atmosphere (sat 5 feet from the band!), $7 drinks, no cover! One of the b","useful":1,"cool":0},"LYVSj1taVqhnRbCmJ0pALQ":{"text":"Great music in a really fun venue.  Definitely, come here off the music.  Bar section is v","useful":1,"cool":0},"o7wNz8CuWpmM9oocNMstUA":{"text":"My favorite spot I went to on Frenchman Street. Great Jazz music. You can tell they really","useful":1,"cool":2},"Lulgy5nQNITVH3s8Qbll4g":{"text":"I got to revisit one of my favorite clubs in NO when I was in town last weekend. The Spott","useful":7,"cool":7},"8vFDW-xnBBw_STgjJnM0-Q":{"text":"Cute place. A few people recommended it as a free place to see great music, so we checked ","useful":1,"cool":1},"G1D39tj3kDjtyw8zsryJ8Q":{"text":"Really great little spot. Small place with a cash only bar and really good music. When we ","useful":0,"cool":0},"7gVOBl5OjfKDZjEsjvGGuw":{"text":"Very fun night with my 18 year old son listening to three bands. Had nice appetizers, dinn","useful":0,"cool":0},"82J-LRbmNgnWnN8eAadb6Q":{"text":"Great music! Worth the $5 cover charge. Can get too crowded, limited seating that could be","useful":0,"cool":0},"D6gPSA_zRmErK7rYQLPM2g":{"text":"This place is awesome! We saw three different music acts here in two days....Washboard blu","useful":2,"cool":0},"r0U8z93Hs0jngF24G8DnRw":{"text":"Insanely crowded all the time - so I tend to go to d.b.a across the street. The lines out ","useful":0,"cool":0},"gV0P_2QiwFffRvxxztAvlw":{"text":"Great place to stop at on the way to Jackson Square.. The music here was phenomenal. Very ","useful":0,"cool":0},"BPtV_XLOyFiyCvXPt5HrpA":{"text":"For the music, it's great. The venue itself is small, overcrowded, and has insanely over-p","useful":0,"cool":0},"OoRC2mYGxEXaw9EGIa6jVA":{"text":"I have gone here many times, but never on Fat Tuesday before, it was packed yesterday and ","useful":1,"cool":0},"0nhU-WTxQtVWI9DJs3oOxw":{"text":"Perfect way to end a Saturday night. Amazing artwork on the wall, and even better live jaz","useful":0,"cool":0},"G2xtP6p4MjaeY4t1ua_I2A":{"text":"I'm running out of effusive adjectives to describe the places that we went to on this trip","useful":0,"cool":0},"fL-C1pr50DLdcdLDwNLfCg":{"text":"Just had some local draft beer so I can't speak about the bartenders, but the music was am","useful":0,"cool":0},"9zBYiFvej6_0qp5XerI_ow":{"text":"Came here a few times this week. Great blues/jazz/swing. Loved seeing the musicians perfor","useful":0,"cool":0},"MPzrtJuDEfArrLmcuh4j_w":{"text":"Cool, lively, and funky bar. Great mix of music-- the show we saw was a bluesy-folksy mix-","useful":3,"cool":0},"I-JoVGA_qirayoYeJLk0FQ":{"text":"Great! Way to earn 5th star is more seating. Had an awesome time enjoying the music twice ","useful":0,"cool":0},"lLxa_295mLKZG2eR42HytA":{"text":"After reading everyone's reviews I was shocked when a $5 cover was charged. We happily pai","useful":2,"cool":0},"kCl6LHpBz-fQlRF8PdiupQ":{"text":"Cool dive for live music on Frenchmen Street. It's a cash only bar and has a one drink min","useful":0,"cool":0},"YFGOrOMr3uaHMeADtmzEvA":{"text":"Skip the nonsense on Bourbon St. and head for Frenchman St. This gem is authentic New Orle","useful":0,"cool":0},"XzxQV8gOxkho5ic_lHnWmA":{"text":"As it stands today, late year 2012, this is my favorite place for music in New Orleans.  B","useful":3,"cool":2},"cS7R0KsGX2sgujbpsE-p2A":{"text":"By far my favorite spot while visiting New Orleans. Bourbon Street is sooooo overrated. Th","useful":2,"cool":0},"QisbU-g62R2ywiJoICdvRA":{"text":"Really great music can be heard here on a consistent basis. I only wish it was bigger and ","useful":0,"cool":0},"He09ZGeeQfooTzazq0hrAA":{"text":"How can you visit New Orleans without checking out the music scene?  There's a bunch of pl","useful":1,"cool":0},"QV2yf_CIt2NAA5bxmN6fHA":{"text":"No cover, one drink per set, always good music on, friendly staff. \n\nWhat's not to like?\n\n","useful":0,"cool":0},"tnIXkVW0Uh1hq2XdxUCFHQ":{"text":"No cover with phenomenal live music that runs endlessly in a venue that is brimming with c","useful":0,"cool":0},"-_5D5adRWuW7BM_kWlQDRQ":{"text":"We had a fun night at the Spotted Cat.  The bartenders were friendly and service oriented ","useful":0,"cool":0},"xfBu8Im-VsVF1Bn3SEJNlA":{"text":"Always a fun joint to listen to some great musicians.  Bring cash as not cards excepted.","useful":0,"cool":0},"z6tkyL-q5rY8mpLvGSr9Bw":{"text":"One of my favorite little music venues in the country, the Spotted Cat has totally reasona","useful":0,"cool":0},"7Ovczk-_SeG09oSMjF9yLg":{"text":"Stopped in here during a too-short visit to Frenchman Street...very cool spot with amazing","useful":1,"cool":0},"doczTFt9_WlZv53U_fHDFA":{"text":"We spent the better part of the afternoon and evening at this little dive bar. Very casual","useful":0,"cool":0},"qPt1u3PPjSCWOtuxBoXNIQ":{"text":"Five dollar cover, one drink minimum, and it's so crowded, but somehow we got to the front","useful":9,"cool":7},"HgSkOhS4yn97rwPLhBRh2Q":{"text":"When I visited Frenchman Street this was one of the place I liked the most.  The music was","useful":0,"cool":0},"FKw8KOOoY_DwrYfUbO9AGA":{"text":"Had a great time at the Spotted Cat and definitely had the most old-school jazz club feel ","useful":0,"cool":0},"uIqvRJqhfMLHwgnMGDnFNQ":{"text":"Saw a great band here. Beers were a fair price although its bottles only. Bar is cash only","useful":0,"cool":0},"VLBI60h0IBHRW6W8vRt5TQ":{"text":"After quickly burning out on Bourbon St we ventured to Frenchman to find some live music. ","useful":0,"cool":0},"161NNf1t1-fkZm4wPADy_w":{"text":"Great place for live music mostly jazzy, good price drinks. Gets very busy, too Busy !! du","useful":0,"cool":0},"97tyV2gP3MvV4kLfW7lyGA":{"text":"Want the experience of New Orleans without Bourbon? Frenchman street is what you're lookin","useful":2,"cool":0},"MF4lyeUB53btMumpDfgiCA":{"text":"awesome place... love the piano in the restroom. Must order abita beer.","useful":0,"cool":1},"lhpadwoWVoQH6hCEFe-38w":{"text":"Great place to see live music! I didn't stay long, so unfortunately, I can't give an exten","useful":0,"cool":1},"Ui7zFtIv8bipYJZ8WlsarQ":{"text":"Laid-back atmosphere to enjoy jazz music. Very low-key\n\nCONS: \n-Cash only bar\n-No paper to","useful":1,"cool":0},"ASpzy0pDjMdKAaUe6gZlaA":{"text":"Great place to hear some live jazz.  Had someone playing a washboard.  We got some of the ","useful":0,"cool":0},"9GStidGfpLCSpcJybm2iKA":{"text":"Dear Spotted Cat: I love you.  \n\nYou have amazing music nightly.  You have no cover.  You ","useful":4,"cool":3},"Nn6sy0okJrG44hHvgksRmA":{"text":"This review is for Sarah McCoy and the Oopsie Daisies. Absolutely insane pipes on that wom","useful":0,"cool":0},"1SGBrGWHO5c0coP32bB-zw":{"text":"Perfect.\n\nThe highlight of my trip to New Orleans. \n\nSweaty, happy, beer drinking.\n\nA crow","useful":1,"cool":0},"rA-cGz7--jxBXLITSSyOnA":{"text":"Love this place. It's small but there is good room to see the music. We came on a tues. ev","useful":0,"cool":0},"tfNriALkZJZ8xBhtHw0RWw":{"text":"New Orleans for some is about drinking, partying and beads. If that's what you're looking ","useful":4,"cool":0},"Uh8Cxj7PfRSgU35VRNlS3g":{"text":"Great music, great fun. I highly recommend it for someone who does not have much time to s","useful":0,"cool":0},"50Fefz3KptOx5cyfEDgG4A":{"text":"If you are into Jazz and want to get away from the craziness of Bourbon Street, go to Fren","useful":0,"cool":0},"tuFTOB6zDeMe3AZh5Z9uoQ":{"text":"Awesome place. Music was great and the staff is top notch. They take great care of their c","useful":0,"cool":0},"QNquYR6OlHmG_9h5-x22kw":{"text":"My girlfriend and I just stopped in because we had read the reviews online. The servers an","useful":0,"cool":0},"f9i57MQYVhEw4Oz7Ug2OTA":{"text":"I'm writing a review for this place since it just came up on my feed. I guess I wrote a TI","useful":1,"cool":0},"jjLCmjF9qTBQlMDnHj3aoA":{"text":"BEST bar in New Orleans!\n\nSuper casual atmosphere, cheap drinks, and AMAZING bands. What m","useful":2,"cool":2},"M2QGIL4HBeZ431n9u83KtA":{"text":"This place is awesome. Great vibe, great music. No cover! \n\nOnly con I had was that smokin","useful":1,"cool":0},"PeOwEucfT0SC3YxD6wuRXw":{"text":"music was fantastic and I like on their website that you can live stream before you get th","useful":1,"cool":0},"jptcPqJkccN1SSe8iLJNWQ":{"text":"best jazz club i have ever experienced!  and probably the most legitimate also, especially","useful":3,"cool":2},"SRJ0PfmJlgeIGgGDq_8dHg":{"text":"Stopped in to listen to some music, unfortunately we didn't get to. I went up to the bar t","useful":1,"cool":0},"Ji4za6eAwKbLXgIHkAVkRw":{"text":"If partying with frat boys and drunk folks isn't your thing, do yourself a favor and take ","useful":1,"cool":0},"2SeQauWwcZaP4_oa5N0rRA":{"text":"Only giving it 1 star because I can't give 0. First off the bartender was very rude and pu","useful":0,"cool":0},"ThlsH3qF9EryEy4WdMUy1w":{"text":"I sat at the bar with friends, drank a nice cold beer, finished the other half of my massi","useful":3,"cool":2},"gEWid6l2K3_AiQ7NMcVMnA":{"text":"Hands down the best bar we walked into while in NOLA. Good selection of drinks covering lo","useful":0,"cool":0},"zoasEC4u817g-86xqjjadQ":{"text":"I have never had a bad time at The Spotted Cat , the music always makes me dance..","useful":3,"cool":1},"klpf-yiCt1qC8V2841r44g":{"text":"One of my favorite spots on Frenchmen Street featuring some of the best roaring 20's era j","useful":1,"cool":0},"pxO3PwW8dqKGW1mxi_9hrg":{"text":"The bartenders are great, the drinks are good, and the music is amazing.  People from all ","useful":1,"cool":1},"5xSpFFPb7msC8xTlZRhTzA":{"text":"Kicked off our girls' trip in NOLA here.  Couldn't have gone to a better spot!","useful":1,"cool":1},"60xsg1tsjttIf14k2g7kBQ":{"text":"Nice balance between divey and classy and good music.  Cover and drinks are nicely priced.","useful":0,"cool":0},"lf2nss4AyryWTyVdy1LgwA":{"text":"Great place to listen to music. Small little place and they sure pack them in, and the vib","useful":0,"cool":0},"crs8gL9xO5iWxcZ8t6XI3A":{"text":"legit jazz club, great crowd, excellent break from Bourbon for a night.\n\ngreat drink price","useful":2,"cool":1},"ynpZEEb1tWVxGXANx7gniQ":{"text":"BEST. JAZZ. BAR. \n\nHands down, twas the best jazz bar I went to in New Orleans. Located on","useful":14,"cool":10},"2l32LBKFB0--1SBoRC-tYg":{"text":"I think my experience was tainted by the fact that Im a non-smoker.  Im able to tolerate s","useful":1,"cool":0},"t8NYzierd5mMBX8_zcWHOg":{"text":"Enjoyed jazz and fairly priced drinks in this intimate bar on Frenchmen Street. Cash only ","useful":0,"cool":0},"Cdseaq2xfLtDTJ9N9LM0kw":{"text":"I had been here once before, crowded both times on the weekend. Live music venue with no c","useful":0,"cool":0},"xoEeh5sblmGgaAxNRYnxKw":{"text":"Bar tender was nasty - incredibly rude and condescending.  The place had an ok vibe but no","useful":0,"cool":0},"d6JUob8DTUw__-GfFc5PjQ":{"text":"Love this place.  Small.  Packed shoulder to shoulder.  Great music. A for sure place to s","useful":0,"cool":0},"r-TlXo3AFGE7EaGGmOJh1A":{"text":"This is a pretty fun jazz bar. As others have mentioned, there are a lot of people, it get","useful":0,"cool":0},"WzIiBgZTbtHysty8GE2i4Q":{"text":"I'm totally a fan of the place, but I think that its popularity as an off-beat jazz lounge","useful":1,"cool":2},"OsuMUauuGnnjFfez1Xe2-g":{"text":"Thursday night in NOLA and the places you know to go to on Frenchmen St are P-A-C-K-E-D, P","useful":7,"cool":6},"Hfyyk_aWIkBS8W3S1xwWcw":{"text":"Lovely. I was alone in town on travel and ended up here while spring breakers continued to","useful":0,"cool":1},"gy5DdJO9OMPpyLNHl7cZCQ":{"text":"A really fun and cool place to go for live music! Not a ton of seating, so get there early","useful":0,"cool":0},"piVGzvoeJCZVV8sBydMIQw":{"text":"Cool place to listen to some authentic NOLA musicians. Staff was friendly. No cover fee wh","useful":0,"cool":0},"Cbxy8mDScG1NTSHsr7x8xg":{"text":"Great music, great vibes.  Too tiny and way too packed.  I liked Three Muses more only bec","useful":0,"cool":0},"Kn50jVTOC5VAXFuPYgB82Q":{"text":"This a great place to hear \"down & dirty\" blues/jazz. I went there to see The Washboard Ch","useful":0,"cool":0},"qIAHzFnSL9TIRvmWt4P56w":{"text":"Frenchmen street is the location for authentic NOLA jazz and this place does not disappoin","useful":0,"cool":0},"4AStJyj4Dgm6-pBEIg443A":{"text":"This place is usually ok and a decent place to hangout to see some good local music.  Some","useful":1,"cool":1},"tmiPEy8d5iDJsExaACk6Hg":{"text":"I want to live here. \n\nBest damn Bloody Marys I've ever had in my entire life, cooler than","useful":5,"cool":0},"-PrwzpVBl9zGe_eRsSKZTA":{"text":"free cover, but the drinks are small and pricey.. you pretty much pay back the cover when ","useful":0,"cool":0},"4EerC9cCjRkn90FAs_KKCg":{"text":"Joyous people, quick barkeep, crowded but fun space, excellent music. So much talent and s","useful":0,"cool":0},"YwnytSA0avQKxd0n17H4Hg":{"text":"It's been around forever and is very very very famous and the music was great except for t","useful":0,"cool":0},"G7qRBil8Mdb_4L9LMFiEJg":{"text":"Had a decent beer and sat down to some head boppin' jazz that made you wanna dance all nig","useful":0,"cool":0},"6LDbpc-n5AydUFM5wAUbZA":{"text":"Cute little bar on Frenchmen street. Their Jazz live bands were amazing. Went there two ni","useful":0,"cool":1},"_qE2uCBL9TB7OBl9mXDR3g":{"text":"The music and live band is classical and popular, but very hot when you are there in a cro","useful":0,"cool":0},"rGCHDrCU_cFXYstKc-2qHA":{"text":"Serendipity!\n\nAfter a November day full of conference presentations, The Spotted Cat provi","useful":0,"cool":1},"V1OjwBFMNeqBZY-M0oiArA":{"text":"There's great music on Bourbon St, but to get to it you have to dodge aging frat boys and ","useful":2,"cool":0},"dzd1R-ofD2K6gZ55Xplygg":{"text":"This is THE place to go when times come to party in NOLA. It's small amd crowds easily, bi","useful":2,"cool":0},"aEgekSbUdCRPquC2-L9R_A":{"text":"Cash only!   Can't be afraid to be a bit rude and push your way to the bar to get service.","useful":0,"cool":0},"jD9ZzPdkxSUpJ6jVVM2OkQ":{"text":"This bar is so much fun I wish it could be cloned and franchised so every town in America ","useful":1,"cool":0},"aMtdrcwNVExZPOyNaKHjhA":{"text":"Right in the heart of the action,  with the best music I've heard in town so far. They hav","useful":0,"cool":0},"jyaUwVAlTmOhqJZ1PSG7ug":{"text":"We went to few places during our trip to NOLA but I can say The Spotted Cat was the best. ","useful":0,"cool":0},"30i5kazT8uZZVnZrN1gAhg":{"text":"Amazing music club.  Not much seating. Be prepared to stand or dance. \n\nExcellent music an","useful":0,"cool":0},"Y2F-YIn9jRVCLvq8ZtS8iQ":{"text":"Great place.  Our local friends took us to this late night spot for some music.  The crowd","useful":2,"cool":1},"E-4zIapydLf43p2AqKPLbw":{"text":"This is an awesome little dive where you can catch awesome local bands and grab a drink wi","useful":3,"cool":1},"MqyjHyJmjayFlbyq3lFu_A":{"text":"What a great place to see live jazz in New Orleans.  It's perfect if Bourbon Street madnes","useful":0,"cool":0},"s0Y3v0TcJTtZBMUVkQ63YA":{"text":"I love the Spotted Cat -- it is THE BEST PLACE TO HEAR JAZZ! Stayed in NOLA one week and v","useful":1,"cool":0},"inMa-fGvzcsBacd9VLQHtg":{"text":"We were looking for a casual, fun atmosphere to listen to jazz while in New Orleans. The S","useful":2,"cool":0},"EkqtMM7Z6Omff86ydYUmiQ":{"text":"Great place to stumble into towards the end of the night. They had a really good band play","useful":0,"cool":0},"96U61a-nh_7cLEG2VwTGKQ":{"text":"Music was great, drinks were affordable and they gave us to- go cups... Thumbs up. Only do","useful":0,"cool":1},"QlbVJTuogkK8TWz_ULJuxw":{"text":"Music last night was awesome! Beers were well priced and the people friendly.  I had such ","useful":0,"cool":0},"_tvynAtdEKsLUl2suv-Gzg":{"text":"This was our favorite club on Frenchmen Street. Channeling the jazz of the 1920s and 30s, ","useful":1,"cool":2},"UdHSHvKVoSW9UHrX0HIrLw":{"text":"This was our second time visiting NOLA and even though we tried other bars, this one just ","useful":0,"cool":0},"SHdjSjj_4UNDHB4rPlJXBQ":{"text":"If you want to see love jazz, this is the place to go! No cover but a one drink minimum.  ","useful":0,"cool":0},"GoRlWvyeyPhrNe-FTWa13Q":{"text":"This cool little club is best visited during the early hours on a weekday or possibly earl","useful":2,"cool":0},"NGefM_XuvyGJ_OObw3qgXw":{"text":"This is what #paris sounds like in the movies. Small. Cash only. But the bar tenders will ","useful":0,"cool":0},"eWpJe70k-n9tw5SjM8pxvg":{"text":"Ya Baby, This is a cool bar, Small venue to listen to some great music. Drinks are cheap a","useful":0,"cool":0},"nf_N0BYlcLYqzP78GjG2Xg":{"text":"On our trip, we did the whole Bourbon Street experience.  If you're in to obnoxious drunk ","useful":0,"cool":0},"tL9qDxfQJ573R4-qBG4y6Q":{"text":"I'm not a huge jazz fan but this place was cool. They charge a one-drink-per-set \"cover\", ","useful":1,"cool":1},"5622rRTV0po1ep_FJcA4_w":{"text":"There are many reasons why I would pack all my belongings, leave Jersey, and move to New O","useful":3,"cool":2},"vt0xAK2VQzm32a3v6nC_-w":{"text":"I love the Spotted Cat, I have been here a number of times when I have been in New Orleans","useful":0,"cool":0},"MXJqHM1TE3Yoi1ZRblLdcA":{"text":"A laid-back music venue on Frenchmen St, right next to the craft market.  Lucky enough to ","useful":0,"cool":0},"0ND91t-IoWfYqOh4rUN-3A":{"text":"There is a secret to the Spotted Cat. The first Set is usually golden, 5 star jazz. Howeve","useful":3,"cool":1},"cfp3eOa_Bm4qY47pu-wAGg":{"text":"This spot was cool. The whole area was. Get beer unless you want to be instantly wasted. B","useful":1,"cool":0},"O7sjXmTTkRSAX_d9G4hOPA":{"text":"The bar was nice, the music was good.\nThis is a cash only bar.\nThe best part was the guy a","useful":0,"cool":0},"rwe3Pv_-5uqfva_cvMpHqg":{"text":"Great bar in New Orleans.  The night I went was an off night and it was still pretty busy.","useful":0,"cool":0},"lUj9JnXqibursskzleNKNQ":{"text":"Meh, it's a small bar with a cover and they only take cash. When we were there, there was ","useful":0,"cool":0},"EV2KsZ5lvDldY2m1KTTHpQ":{"text":"only the cool cats jive here. \nim not even sure what that means. but i jived i got the tsh","useful":1,"cool":1},"dSGrsWNXHCZVTCMSDRck7A":{"text":"Loved our experience here... the music was great - we stood up close and rocked out with t","useful":1,"cool":0},"CIi5PEAeTX3_7Ey8MKyR0A":{"text":"Killer venue for live music in New Orleans! Saw a couple bands here last night - the secon","useful":0,"cool":0},"T3zJ281v8WCJxcFsnJEoUA":{"text":"I mean, c'mon.   What's better than this place in NOLA?   Incredible music.  Such a good t","useful":0,"cool":0},"15MGThjhwegsPAE6vBPJsg":{"text":"Music is 9/10 . Some nights might not be up to your tastes but more often than not it's ex","useful":0,"cool":0},"nhNO7IeuDnWGQBMS6sdcZg":{"text":"Not bad...\n\nThis is a nice, casual, grungy music club. Even though I'm not a fan of jazz (","useful":0,"cool":0},"nGCSZJE8-uYZaq7Uyf_V3g":{"text":"Music was great. Crowd was great. Bartender was absolutely awful. She was texting at the e","useful":0,"cool":0},"KGCm5xjWHdxx5yPapnUqJw":{"text":"If I come back here this is the first place you'll find me at. Probably at the back near t","useful":1,"cool":0},"3qHy3xDZINJxASwtIiPg7Q":{"text":"Prtty cool place.  Chill and good music.  No fee to enter, min 1 drink, not to hard to fil","useful":0,"cool":0},"W4ZE0aut6QK81aXh2owt8w":{"text":"Great music. Very talented bands.  Small dance floor, but good lindy hop dancers. No food.","useful":0,"cool":0},"_TMcLAy8qc7RzQ725Y0Lyg":{"text":"No\nCover\nLive music\nWas great. Smoking\nAnd cash only is not. Gets quite crowded.","useful":0,"cool":1},"Ypcv_qxwtrng3Vo0cyvA-Q":{"text":"RIP\n\nIt will be re-opening with a new name and a new owner (the owner of the building is t","useful":0,"cool":0},"7Yq8vNPwwCv0w3XjQB-foQ":{"text":"They have a piano in the ladies. I wasn't sure if I was in the toilet at first, ha ha. The","useful":3,"cool":2},"jJsMpTYfJeWXXE2jVoduoQ":{"text":"Dinner on a recent Saturday night exceeded all expectations. We shared a pate appetizer an","useful":0,"cool":0},"k345mp3YUgIKv7k3NuXHeA":{"text":"Always a great show, absurdly cheap- no cover charge, just do right and tip the amazing ba","useful":0,"cool":0},"Xk9IpThDiMbMVPcI6V5hqw":{"text":"I'd take this over any dance club ANY DAY! Great vibe, lovely people, refreshing drinks, a","useful":0,"cool":0},"8QUBSH8F1VYj_WTVI42KXg":{"text":"I have lived in New Orleans most of my life and this is one of the most authentic small cl","useful":0,"cool":0},"v-v7LzVzZ2LzvSTGNqu3Ng":{"text":"When searching for the right music on Frenchman St. some places were too loud, some were t","useful":0,"cool":0},"u-JMs5XFCtHXQfnFXEdfTQ":{"text":"Good music and fun atmosphere\nUnventilated cigarette smoke \nFilthy restrooms with no soap ","useful":1,"cool":1},"aIo8L156klCzGdmnw6ajJQ":{"text":"This place is so fun! Great jazz music but a small set up. It was difficult to get in due ","useful":0,"cool":0},"RI0RQJR1ylayjn09QCaXTw":{"text":"The best live music I have ever experienced at a bar. No cover charge and some of the most","useful":1,"cool":0},"VX4MC02SKborO0EjmcV1Hw":{"text":"If you find yourself on Frenchman street, you will be pulled to the Spotted Cat.  We heard","useful":2,"cool":2},"axUtnGuX9drJfdqYNIOvzw":{"text":"The Spotted Cat is the jewel of Frenchmen Street as far as music is concerned. Local legen","useful":5,"cool":3},"ikcoGnsMf7YtTxxtNPlDbg":{"text":"Enjoyed two swinging bands here during our NYE tour of Frenchmen St. Great place, fun vibe","useful":0,"cool":0},"bqMPhdNLLG6bVVkPqtqb6g":{"text":"One of the best jazz music club in New Orleans. \nI love the Frenchman street. What a enter","useful":1,"cool":0},"H9TwVYo05bRHYXvHxj97dg":{"text":"Super cool, local music venue. Drinks are pretty pricey but the service was super friendly","useful":0,"cool":0},"mtY59PVwtJFD7pmT8O_ZiQ":{"text":"My girlfriend and I came here on Thanksgiving night, looking for some great jazz in a fun ","useful":4,"cool":1},"1ZAqQoafL-QLk1ay3abkAg":{"text":"Second stop on our Frenchmen St. Jazz walk. Loved the music groups, Jumbo Shrimp and their","useful":0,"cool":0},"_50Yd1t6j3hBqyLSK_GR_A":{"text":"This legendary club is truly legendary. It boasts some of New Orlean's best talent and the","useful":2,"cool":0},"9cDe7k250BMuDIr-ko5qww":{"text":"Fun place! Small space but great acoustics and their catfish and alligator dinner was amaz","useful":0,"cool":0},"sm0xTCPPwztpkp-FItwK5A":{"text":"Un gran club para escuchar jazz en vivo en Nueva Orleans.\nUbicado en Frenchman street, una","useful":1,"cool":0},"_7O3GoxLlMdwgXFnYhXEhg":{"text":"It gets crowded here for a reason - because there is no cover and the live bands are excel","useful":1,"cool":0},"slTmpII8a21Y7wVgElLnnw":{"text":"SWING DANCING LESSONS ON WEDNESDAYS AT 5!! How cool is that? If I didn't work on Wednesday","useful":1,"cool":0},"zELBWvj-oFRtDw98TRRQkg":{"text":"Solid choice.  Install yourself in a seat at the bar and hunker down for a couple hours.  ","useful":1,"cool":0},"CPUcc5W-F2mZHK9CHM8ohw":{"text":"If you're in New Orleans, don't miss The Spotted Cat. Recommended by locals and tourists a","useful":0,"cool":0},"gTlOERnylqDCyUh6Lyik4w":{"text":"The Jazz Vipers play here on a regular basis (every Friday and Monday). Need I say more?\n\n","useful":1,"cool":1},"qEFa6WVU3ybHrL3DeumCvA":{"text":"Great jazz and beer!!! Tried the Abita Purple Haze and Abita Strawberry Harvest which was ","useful":0,"cool":0},"3sIcFYJDlLzbBNIe-zHN2Q":{"text":"After some late dinner at Coop's, we rolled onto Frenchman St. to catch some live music.\n\n","useful":1,"cool":1},"wAbQiGm2dneczlfqNskaXg":{"text":"Definitely the top place to be on Frenchmen street! Great live music if you're looking for","useful":0,"cool":0},"Sg2QGTgP0c3Q9H4LE5AuCA":{"text":"Great little place on Frenchmen Street, removed from the crowds and chaos of Bourbon Stree","useful":1,"cool":0},"uBQ7DYLCvI2pyT5E5xubag":{"text":"OFF THE HOOK. Saw two great bands, one of them more bluesy (she sounded like Amy Winehouse","useful":0,"cool":0},"J-QnkUsrDpS2-_4NKpjLjg":{"text":"LOVED this place. Came back twice! I can't believe there is no cover. If this place was in","useful":1,"cool":0},"W6QMUSMOUzEPGu3tyHvPRA":{"text":"This is a wonderful bar to hear some GREAT jazz and/or blues music on Frenchmen Street!  T","useful":0,"cool":1},"OO-FpX4qD7nHPnz9vH6eFw":{"text":"I love this place! My husband and I went to New Orleans for anniversary and we stumbled ac","useful":1,"cool":0},"fSIxnFEIOAmBM3i86QcJpg":{"text":"Wow.  For the size to kick ass ratio, this has to be one of the worlds best bars.  The pla","useful":2,"cool":1},"ZIENS9JAAov5VTgpyv-JZQ":{"text":"I don't know what neighborhood this is in but it's the equivalent of hipster Brooklyn to m","useful":1,"cool":1},"RwYjVyGOzfx8Sxf9fFNZzw":{"text":"Very cool bar with great music.  And look for Jenna/Gina the bartender - she's the best!  ","useful":0,"cool":0},"k8Xo7OR_h7i_BagfAIFuqA":{"text":"I would have loved the place, the band seemed awesome, the crowd chill but indoor smoking ","useful":2,"cool":0},"QoiuwzPT9gMZKxx7wAgsIw":{"text":"In a city full of awesome bars, this one stood out for me the most. This is what i envisio","useful":0,"cool":0},"tk_fSO7cBaCoT6NX9JNVrQ":{"text":"The SpottedCat alone is reason to visit NOLA. Great Jazz on Frenchman Street, while the co","useful":0,"cool":0},"X7d2gl7IM3yfPLym58cHUg":{"text":"Great place to spend an evening enjoying fantastic music in New Orleans. It is right next ","useful":0,"cool":0},"xN6E1xu8TUkMO5cBwCFMIw":{"text":"Music was good but the place is just too packed. They keep charging cover and people don't","useful":0,"cool":0},"-uXiAuxkoHxlN4x0EXiRAg":{"text":"came on a wednesday and the orleans 6 had the crowd going. this place gets super packed. s","useful":1,"cool":0},"2diTfv8TrBkSu8gSgspurQ":{"text":"This absolutely my favorite place to see live music in New Orleans.  The place is pretty s","useful":2,"cool":3},"x1pLijW1ar4hi31mUnyPrg":{"text":"This was recommended to us by a few locals and we were glad that we checked it out.  The m","useful":0,"cool":0},"AbNUtOj03D4YzRfs1XeW-Q":{"text":"This place has some really great live music. We stopped by here twice during our visit to ","useful":0,"cool":1},"x7qi7xIDOsKx3zxcFQLF2w":{"text":"One of my favorite spots in New Orleans, for sure. Located in the young, cool Frenchmen st","useful":4,"cool":2},"L1UBUnx5IoANo3GQQqvCew":{"text":"Dropped by 3 days in a row and the place is amazing! All the bands were really good, the d","useful":0,"cool":1},"0XxWr9ynbK8PfCiK15oQqw":{"text":"What a great little jazz spot. If you want an authentic, non touristy experience definitel","useful":0,"cool":0},"8I0yAuqwE434q5JmVTzSbA":{"text":"Love this place. \n\nAuthentic home cookin N'Orlans style and I dont mean the food!\n\nGreat j","useful":0,"cool":0},"Km6pfnWZsp2ij8LDMCOmnQ":{"text":"I was wandering through the Marigny and heard some phenomenal klezmer music floating out o","useful":0,"cool":0},"miZIKLmrhxa6vJtQ3a8FPA":{"text":"The Spotted Cat is where I hope my last evening on earth may be. This place steals my soul","useful":1,"cool":1},"nMs-5cXUo8gK_bmiYpi4ZQ":{"text":"Went again a few weeks ago with a bunch of my friends from DC.They loved the ambiance and ","useful":0,"cool":0},"47Swq0WaZAv0YpT7WcfMTg":{"text":"Prices aren't that great...but no cover!  Excellent bartenders.  Awesome bands (mostly jaz","useful":1,"cool":0},"67VB4IAb-3HoNaGnGA8UCQ":{"text":"Had a blast at this little club. The drinks were reasonably priced, and the music was fant","useful":0,"cool":0},"-GALNEG4ifuO4xxGi27SPA":{"text":"The Spotted Cat embodies the romantic beat era mash-up of frenetic jazz that fills the air","useful":0,"cool":0},"a-WLrgzmnYdPel2iE4uffQ":{"text":"Had a fantastic time! The music was pleasant. The ambience was great. The bartender and ot","useful":0,"cool":1},"BgTDSTu-X_YTqP2DWrpsLw":{"text":"Great live music and the drinks were reasonably priced.  The atmosphere is nice.  I would ","useful":0,"cool":0},"EBiAy8Ewn_aksmyf-BsQcg":{"text":"What can I say? The Spotted Cat NEVER fails me. EVER. I love this place so much that if I ","useful":0,"cool":0},"Evy9bhPopbRd92lIHhiQIQ":{"text":"The bar was packed and the band was excellent. Also they have a bunch of cat decorations a","useful":0,"cool":0},"_UAhJqxeGK72wRviMvT7Lw":{"text":"Excellent live music with raw decoration. They only serve drinks, cash only!! Local vibe w","useful":0,"cool":0},"ARH1XIZ9T-tOi86N9nSTMw":{"text":"Slightly dive-y, but a lot of fun.  Non nonsense bar, drinks are served in bottles or plas","useful":2,"cool":1},"sbs7zQLpzzPn_oAa-zLhcw":{"text":"Best music venue in Nola.  Had the pleasure of experiencing several out of this world jazz","useful":1,"cool":0},"KlWowkDtBsGepXrnwKH1nA":{"text":"A little bit of heaven.\nI think we got lucky.  We wandered in here on a Monday night, sat ","useful":1,"cool":0},"ss6KWOwXJHZ1pOq0ldXv-w":{"text":"Came here when my intent was to go to dba. I loved it! The entertainment were the Pfister ","useful":0,"cool":0},"QPbYXgVbk1fvaYIt6KBz4w":{"text":"Fun time! We got there in time to get seats. We stayed for a few hours (and a lot of $$$ i","useful":0,"cool":0},"XjFxGK4_GV8hOFnst_dQFw":{"text":"No, sadly, no. You're charging a cover and there is no music? Off the list.","useful":5,"cool":3},"lqyvb18McgHTHMhKb36odA":{"text":"This place is pretty good. I definitely dig the energy here. Specially the brass band that","useful":4,"cool":3},"kreDkqAkIzbybo6oreO_-g":{"text":"Sparse, cash only, locals pub with extra--ordinary music.  Lovely relaxed ambiance, the ki","useful":0,"cool":0},"QITTKBARpMfgrjzOE5np8w":{"text":"This place is my favorite place to see live jazz in New Orleans! There are very few chairs","useful":0,"cool":0},"ecB4W-0nwSmFYsGs-L_ofw":{"text":"This place definitely lived up to the hype. I came here during my first trip to New Orlean","useful":1,"cool":1},"-XgEIxrJdQ2C_8jsdfT06w":{"text":"It's not a club. It's a time machine. It's not great. It's magical. It's not music. It's l","useful":0,"cool":0},"NACi_KqA6ZTeOxBeq8J7LA":{"text":"well, Contrary to what yelp stated, there WAS a cover, only 5 bucks, but my unpleasant sur","useful":0,"cool":0},"5lGrmzHtSaZCUeRVxuXeGA":{"text":"A dark, cramped, divey joint with cheap beer and amazing NOLA jazz and blues. The kind of ","useful":0,"cool":0},"JyZEWOsrQpv1AwmyDI3Gew":{"text":"I really love the spotted cat and it's a pretty special place for me.  I'm a hurried and s","useful":0,"cool":0},"hoGY3sYo6uMFEqH8_y3psw":{"text":"Frenchman is the place to be if you want jazz.  It was a good experience.  Band was good. ","useful":0,"cool":0},"xuYlE4EvL7P9trflptU3-A":{"text":"Nothing better than fantastic live music on Sunday afternoon!  We had the pleasure of list","useful":0,"cool":0},"kept9TliRC-ftUHMYKnamQ":{"text":"Small venue with local music. I wasn't too impressed with the band for a Friday night but ","useful":0,"cool":0},"eTyDNqY6JdJtILDaxz5dIA":{"text":"One of my favourite music spots in New Orleans. No matter what night I passed by top-notch","useful":0,"cool":0},"eA-dskOOs8iQ94ca8n1pvA":{"text":"It was pouring rain. The streets were flooded. It was dark. And there was Zydeco. \n\nHostin","useful":1,"cool":1},"GDDsqCzro0kAFYzDn9ZU2g":{"text":"Not to be missed on a trip to NOLA!  The music never seems to stop and the dancers are suc","useful":0,"cool":0},"iaC7ymzYLO6zrSCJIZiSLg":{"text":"One of my favorite spots on Frenchmen! \n\nIntimate venue.\nSolid schedule of performers.\nNo ","useful":1,"cool":0},"gFZCLKTlwa8sPEsZD5o9AQ":{"text":"Friendly bartenders, great live music, cold beer, and decent mixed drinks. They do it righ","useful":0,"cool":0},"Ejfsxtk8FVf7475gZfsDpw":{"text":"This is exactly what one has in mind when picturing a jazz bar. Moody, dark, and eclectic ","useful":0,"cool":0},"C0k68OYcfMp4La-2TlDRJQ":{"text":"It's mostly standing room. seating is scarce but I was able to find and hold a spot one ni","useful":0,"cool":0},"pA3CCHjd4vQ7ECG4i2nSow":{"text":"My friend and I meandered over to Frenchmen Street on Sunday night on Mardi Gras weekend a","useful":0,"cool":0},"561zqw1-B-RZAlJ48kiPkg":{"text":"Bar is not worth your time. First off, who charges cover anymore. Second the owner was cal","useful":0,"cool":0},"TXTxUTvnLO5h9-2T3FQmWw":{"text":"Great jazz music down on Frenchmen Street. It was pretty packed for a Monday night and I c","useful":0,"cool":1},"fqOMSw2QF3mmnCDqzFalGA":{"text":"This place was one of my favourites last time I was in New Orleans. The place just oozes a","useful":0,"cool":0},"9FJOnPwNpWC6BSnZ3wi6yg":{"text":"An absolute must stop while strolling the one and only Frenchman Street. The drinks are so","useful":31,"cool":20},"2M-W4spdE-Aw96HE7YpUPA":{"text":"Omg the best jazz spot in Frenchmen street! I truly love this place. Everyone was extremel","useful":2,"cool":0},"3MrNmWM7NTE4934ZOF4X9Q":{"text":"The Spotted Cat es un lugar genial, un bar/club de jazz y blues que es un espacio mítico y","useful":2,"cool":1},"eLLNn5ckZj9bLd4_g_Uzuw":{"text":"We went there twice and the live music was excellent both times.  Did some swing dancing b","useful":0,"cool":0},"2ZgoDv7618A_v6gVKTctGA":{"text":"Fun place.  Good jazz.  Cold beer.  What more could one want in New Orleans.","useful":1,"cool":0},"a8389knr0cS6-YtCJjPsAw":{"text":"Very cute. Our first venue on Frenchmen street & it's great. Just know-this is a CASH ONLY","useful":0,"cool":0},"PObvaLsL9R42j6-1TOqK6w":{"text":"A must stop when in New Orleans! Be prepared to pay cash and there is a one drink minimum.","useful":0,"cool":0},"-zAg01ooTMDDFRAcnOWYUg":{"text":"Since Jando knows how to play even on a late Sunday night when geriatric folk like me are ","useful":1,"cool":1},"F3gT5aUd7vVKKzLSt-MWjg":{"text":"This is a very warm and fun environment.  Most people were standing and a couple was even ","useful":0,"cool":0},"sNhClk-WK7G7PF5WVplggQ":{"text":"In New Orleans for Jazz Fest 2010!!! I was excited about hitting up a nice blues, jazz or ","useful":1,"cool":0},"H-t9Al4YpIi4Nn6Ewxc_3A":{"text":"Fantastic bands, great location and friendly staff. There was a small cover when we visite","useful":2,"cool":0},"nUtDGppO_851tAC2FRyB2w":{"text":"While the other clubs on the block are slowly turning Frenchman Street into 'Bourbon St li","useful":0,"cool":1},"LaBS1_FauhoWHDWNyEwLbw":{"text":"Excellent place if you are looking for some great live music while in NOLA. We went there ","useful":3,"cool":1},"X3x-7LtT3WmkiLzEGtMSpQ":{"text":"This place is perfect, almost.  It is way too small.  Much of the activity takes place in ","useful":0,"cool":0},"r76zUEUiOgeQ0VJW4H7hIw":{"text":"We came here twice while in town, over the weekend. It's a very small venue and very bare ","useful":0,"cool":0},"h9Kk7pLofW7o9KmtjenC5Q":{"text":"So much fun! Great live music and relax vibe. Great live music every day of the week.","useful":0,"cool":0},"eXlcSY0P3XhiNoHkN1qMfg":{"text":"Great place for live music plenty of bottle beer to select from , no drafts and CASH only.","useful":1,"cool":0},"YZ0oZkfTTkc5BhONM3zARw":{"text":"I loved the vibe of this place. Chill environment, cheap drinks, good music... you can't a","useful":3,"cool":1},"lgerOzj8XqVfkpPfKPJGFg":{"text":"The place is awesome\nThe music couldnt be better\nThe only problem is that the place is ext","useful":0,"cool":0},"MIa1FTDDbafXtPtq0VAzJQ":{"text":"Great music. Not too expensive bar. Great vibe overall, especially the musicians was good ","useful":0,"cool":0},"LH7buJS_tCLtRileOQhLaQ":{"text":"Cool club but a little on the small side and can get uncomfortably crowded pretty quickly.","useful":3,"cool":2},"dq_NqXBfy6eud3yp5hA4xQ":{"text":"This review is somewhat fictional, for those that read it true;\nIt is derived from \"Casey ","useful":3,"cool":8},"EaBvQQ3Qo_HT4wYBfNAC-w":{"text":"The Spotted Cat used to be one of my favorite places in the world, and I stopped by every ","useful":6,"cool":2},"Q1X-BUseqTx-OO9ODGqu7A":{"text":"I went here with my college roommate.  The band was fantastic - the guy who played had a w","useful":2,"cool":3},"iq5bj7lWgdZLd6sN4KYsjA":{"text":"The spotted Cat was the ONLY place in New Orleans that I went for the music! They have an ","useful":1,"cool":0},"Hr6aEwW-UWB5ThmUsLwJ7Q":{"text":"Very cute place to creep into and listen to live jazz. Went here with a friend, took shelt","useful":1,"cool":1},"Qw2zRL0hq0tsQvqrXGIYJA":{"text":"No matter the time or day (OR day of the week for that matter) - this was one of our favor","useful":1,"cool":3},"IXt4Y2MVqASG7--PX31mZg":{"text":"Saw the Shotgun Jazz Band on a Wednesday night.  Excellent music, standing room only!  Be ","useful":0,"cool":0},"8utp5tdhASEpy1slKOX4ow":{"text":"This is the hot spot on Frenchman Street, but it's not the only place on Frenchman St.","useful":0,"cool":0},"5pquQB3k8KPWuccJcaXlOQ":{"text":"Love the live music. On point. \nLooooveee the bartenders Q and John -- the reason why we s","useful":0,"cool":0},"MlxwYc8gmGuB-Eefk-wbxg":{"text":"When the band has a tuba and a washboard, you know it's gonna be good.","useful":1,"cool":0},"6gZzDGE_DRlyJ4uGlu54MA":{"text":"I've been to Nola a couple times now with my friends to this specific club and have never ","useful":0,"cool":0},"zgJPcZAKn3QlDzG5KVM2ow":{"text":"Jazz the way it should be- cool, funky, unpretentious, intimate, played in a dive bar. It ","useful":2,"cool":4},"gcIaEZ0uTm6Za1lZdxR4Kw":{"text":"Had the pleasure of stopping here while exploring NOLA for the first time, it was scorchin","useful":0,"cool":0},"cTKUlA3VEA2qLkFB_kDbDA":{"text":"Cool place with great music. It's small and can get really crowded, but if you show up at ","useful":0,"cool":0},"E1BbPqPoiMy2zv7N6bvzBQ":{"text":"you should not miss this place.... or any other place down frenchman street.  I've been to","useful":0,"cool":0},"gY4fOjt9wbnfKsZmaXiLIA":{"text":"fun little place to get away from the quarter hype and enjoy some cool jazz","useful":2,"cool":1},"_iD3kKRXEIbCIWH1vNQAuw":{"text":"There is a piano in the bathroom! What else do you really need to know? \n\nGreat drinks, gr","useful":7,"cool":7},"yYp_7IOYI0Xgheqkf6fWJA":{"text":"Be a part of the \"local\" scene and swing by the Spotted Cat.  Focuses on the \"brass and bl","useful":0,"cool":0},"LMWmcRF5vQ77QHJR0CNBSg":{"text":"I dropped by here with a few friends while checking out the different jazz clubs in the ar","useful":2,"cool":1},"yDedis1iZP68zq-mVe1Pzg":{"text":"Fun atmosphere- the kind of place to grab a beer and stand around, listening to great musi","useful":0,"cool":0},"y173lVD2byI0-MdJdtwJgA":{"text":"I love this club. Please visit here for good music and a different scene. New Orleans is F","useful":4,"cool":1},"8KTodNnKz_KDJnDCppOPlw":{"text":"Oh The Spotted Cat.....how I wish we had a place like this in Denver.  Absolutely phenomen","useful":0,"cool":0},"97wl33XyWh3negIbbedOdg":{"text":"Fun bar with great jazz live music. They had a 5 $ cover and is cash only. Its not too big","useful":0,"cool":0},"QHiUCBbY_pR_1nNfwB2ZZQ":{"text":"Best jazz spot in town. I had to check one out while I was in  Nola and I completely score","useful":0,"cool":0},"diTpKTtdEU8KY4w2BxjoEA":{"text":"Love Frenchman Street and love the music scene! Especially at the Spotted Cat. \nEvery musi","useful":0,"cool":1},"ZL82nNeuVRrXJKrmY2My2Q":{"text":"Nice, but just so crowded. Great bartenders and the music was ok. We found a club next doo","useful":0,"cool":0},"Hvkhhw5RWLSfdtNHJz-tVA":{"text":"Local jazz establishment that was an awesome stop for a drink and traditional jazz.  There","useful":2,"cool":0},"3iFF8MjAADl8G6_8ZW3drA":{"text":"One of the best bars on Frenchmen st to catch live music. No cover, just a one drink minim","useful":0,"cool":0},"PLC2hiFKHk6cI5-qnho-IQ":{"text":"We got there at 5 and got drinks and spot to sit and enjoyed the band that started, really","useful":1,"cool":0},"44R5SHfEjvmDfMasyeE1fA":{"text":"Music was great! Bar service not so much. Beth was one of the rudest bartenders I've met!","useful":0,"cool":0},"BqCZTl1qrhFtdR4R_16Jrw":{"text":"The music is great, the drinks are so-so, but hands down the people you meet here make the","useful":2,"cool":0},"vIYkH2fztVHyKU_xya-MVg":{"text":"Exploring Frenchman Street, we stopped into The Spotted Cat Music Club to listen to some l","useful":9,"cool":6},"bpCVk-yDGf77j9Yiq4U9xQ":{"text":"This, my friends, is what New Orleans is all about! Damn good music! We got there early. 5","useful":0,"cool":0},"oKF7eOP57lTERaX5LWqf1Q":{"text":"Frenchmen St is my favorite spot in New Orleans and I think Spotted Cat is the best place ","useful":0,"cool":0},"0quq5wLpga-CKrXXK9cYXw":{"text":"NOLA I love u thee. This place is a real Gem in Nola. Small , crowded and AMANZING really ","useful":2,"cool":1},"CMWiD8StU7EhFPUe1mrPug":{"text":"If you're going to see some live music in New Orleans, it should be on Frenchman Street.\n\n","useful":3,"cool":4},"pxAw5V_YC_JU1CLH97YBrw":{"text":"Random Thursday. $30 for one drink and one song for me and my girl. $14 for a crappy  well","useful":0,"cool":0},"adAiS4mKRu5CZRAf6EN4rA":{"text":"Very fun experience. This place is on a cool street with lots of live music clubs nearby, ","useful":0,"cool":0},"og1jgP4tpFgKEI3mJITnpA":{"text":"A MUST stop on Frenchmen Street. Small, funky, crowded, loud and great fun. A one drink mi","useful":0,"cool":1},"_zjewVq_xsejNlhD8PGVtg":{"text":"YOOOOOOOO. THIS PLACE IS WELL REVIEWED FOR GOOD REASON. PLACE WAS JUUUUUMPIN! Drinks were ","useful":0,"cool":0},"n6WFG1H1U80megAq3heCSg":{"text":"We were lucky to see a great band play but as for the venue, it's the typical bar vibe whe","useful":0,"cool":0},"wbVJWCcgB1BWxZLAuI3ArA":{"text":"For a dive bar that accepts only cash, they have the cleanest bathroom I have ever seen (t","useful":6,"cool":4},"aOCrwgZ88OUnKjceJoXTcg":{"text":"This place is great.  Embarrassed to say that I've been to New Orleans several times, and ","useful":2,"cool":0},"aisJhPIH661N7BH901zXog":{"text":"Kickass music and inexpensive drinks -- count us in! We loved this place so much that I wo","useful":0,"cool":0},"ycDYdGvMBMSABHF_9TbIsQ":{"text":"Soak it in. Everything. You could show up by yourself or with a crowd. Whatever you choose","useful":0,"cool":0},"vDj2EUvNMfm1AN3lChofIQ":{"text":"Great hole in the wall to see great live music.  This is a very no frills sort of place.  ","useful":0,"cool":1},"sdVerhzwVWt3XpT_ZlHnVA":{"text":"Such an amazing music venue! I recommend going during the day when it's less crowded. We l","useful":0,"cool":0},"iLgurJKXRaZv5XdYmdjPNg":{"text":"GREAT music all night! The drinks are good and the atmosphere fun. It's a small place but ","useful":0,"cool":0},"q1N-Nlv6DfIHbKiWyKjGFg":{"text":"My daughter recommended this place. I am so glad I had a chance to go. The live music was ","useful":0,"cool":0},"ec6_wxQRsZLvTKEpKFZhIQ":{"text":"Cons: Smoking allowed and cash only bar.\nPros: Everything else.  Great music.  Good acoust","useful":0,"cool":0},"5mKCTRXqG9i3ffujoDVbwA":{"text":"While feeling adventurous on my best friend and mines 2nd annual trip to New Orleans, we f","useful":1,"cool":1},"3ARIsoPKFeJRLEwjyPKsbg":{"text":"Came through on a Wednesday. No cover, but they do ask you to buy a drink during each set ","useful":0,"cool":0},"4CYMgZv0Hs18CAqEx3QpQA":{"text":"**Cash only**\n\nAmazing jazz band playing, the lady sounded like she was from the 30s or 40","useful":5,"cool":2},"F4vEOybkhuowIHDG-EG1GA":{"text":"The Spotted Cat is perfect for some live music in New Orleans as long as you're not claust","useful":0,"cool":0},"ZkD9E68TBHl3CoG2XWzgRw":{"text":"Fun spot on Frenchman St. to listen to live music, drink a cold beer, and hang out with fr","useful":2,"cool":1},"hb22niHm5ID_BdyxJhKFBg":{"text":"After walking down Royal street in 80° weather all the way down to Frenchman we followed t","useful":0,"cool":0},"J2t8tBHEoiMltrpj8b_P9w":{"text":"Awesome place for live music! No entry fee but one compulsory drink per set. \nWe went on a","useful":0,"cool":1},"JaPTpyvM1Z4v0ShvdMmKGw":{"text":"Awesome music. Cash only. I don't think we had to pay a cover, but we went on a Tuesday ni","useful":0,"cool":0},"oy2UJmUt7hrZuZiO_Wzyhg":{"text":"Overdue review that I never clicked \"Post\" for. \n\nWe visited The Spotted Cat Music Club on","useful":0,"cool":0},"1_14OX2z94ftJslNCggLCw":{"text":"Lovely vibe and music; great experience. Drinks are a reasonable price; $5 beers and $10 c","useful":0,"cool":0},"yEsoK81flF0ctAXhyNs3yw":{"text":"\"Go to Frenchman\" everyone told us. That's where are the bars are! Turns out its not much ","useful":8,"cool":6},"6JiXCTivIf2x8S5Jtj9hbw":{"text":"i went twice and twice i enjoyed the music very much. however it was a small venue and so ","useful":0,"cool":0},"C0rITitrmmyGY0kiEJ3WOA":{"text":"Ok. My second visit. Yes, great music. Really, really great music. Yes, cheap beer. Super ","useful":1,"cool":1},"DsuIxYAiYg_PmwDQsQM5Bw":{"text":"I stop by every time I'm in NOLA. So... Twice. Service is, adequate. Music and vibe is on ","useful":0,"cool":0},"WEB1RMjHKTVqWymZHKt7oQ":{"text":"Great beer list, lots of locals to try.  The music is the real draw here.  This divey spot","useful":1,"cool":0},"4OgiI-O0zGzBG6T_77o8QQ":{"text":"Great local music venue. \n\nAll the bars along this street are majority live/jazz music. Dr","useful":6,"cool":5},"U6U2uNhGtT8DVqe0j9kOng":{"text":"This bar gets really great musicians and you're always treated well even if you're a touri","useful":0,"cool":0},"wMmANKKWSB4_QFhCg83vNQ":{"text":"Frenchmen Street is so much more my vibe than Bourbon Street. And The Spotted Cat has it a","useful":18,"cool":15},"qg1B8SqyjtnELNKSZLyYZQ":{"text":"Did some hanging here while we were in town for a Halloween wedding last year. Great music","useful":0,"cool":0},"O4UA9H3_wRnzdv5lCW256w":{"text":"this place has a lot of atmosphere and is very popular.  Live music is their claim to fame","useful":0,"cool":0},"Y3PuGnhzzYWCL6GpLhC5Pg":{"text":"This was quick visit during or time in New Orleans.\n\nThe music was incredible and the band","useful":2,"cool":1},"Puigj5popxHqyItP3D5GyQ":{"text":"Cash only bar. It's definitely a dive bar as well and there isn't a lot of seats. We came ","useful":1,"cool":0},"tq54Rpp1sJt_IPj1yFRhfQ":{"text":"4 stars for the band but everything else had me wanting to leave a 3. I found this on Yelp","useful":0,"cool":0},"Os9PWkxpdNf05uELWQKf0Q":{"text":"The spotted cat was a fun venue. Cover was worth the music, and the drink prices were reas","useful":0,"cool":0},"47KF5Fr7rR1oCiKFdQ6uUQ":{"text":"BEST music we found in NOLA. Great local musicians and lots of flavor.  Didn't eat - just ","useful":0,"cool":0},"Ba86AqooJSiyGW_ri34rJw":{"text":"After party non-stop debauchery on Bourbon street for a Bachelor party, this is the place ","useful":5,"cool":3},"bCM-a4TUGulO_Vv4Qcz-0g":{"text":"Was just there last week for a bachelorette party. We had such a fun time here. The music ","useful":0,"cool":0},"zBirP8VBA_HA2lQMDysg9g":{"text":"I really like this spot, the first time, and even more now, years later.","useful":0,"cool":0},"Suyp1l466CRd_YJCoZssxA":{"text":"Amazing bar! Definitely my favorite place in the quarter, the music and atmosphere was ama","useful":0,"cool":0},"CJTPL1lBN2VnVVOQ37J4gQ":{"text":"Love the name, love the venue.  I popped in here to listen to music one night since I've w","useful":8,"cool":6},"SFUTuVtew6u0FWRXC__cYg":{"text":"Loved this place!! Great live band and people were very friendly. My wife and I were looki","useful":0,"cool":0},"jC--NBm8yRkIp9K199vKKg":{"text":"If you visit NOLA and only visit Bourbon street you are missing out, Locals go to nearby F","useful":0,"cool":0},"j8-9zy6lc8aPU7vQ1u1nNQ":{"text":"I mean..... if in town and want something different than bourbon street please head over t","useful":0,"cool":1},"yhuxFYB5tAL_odkwBqC8lw":{"text":"Love jazz/blues music and was so looking forward to going here as we've heard so much abou","useful":0,"cool":0},"_mNn9qivSYWAtuRVfqQx0Q":{"text":"Great music, great and love-their-music musicians with a one drink minimum.  You sit there","useful":1,"cool":0},"AsNoBxpbQC4ReJ1XNYqZEQ":{"text":"YES! This place was awesome and fun. Excellent option for a small venue to enjoy good musi","useful":0,"cool":0},"zktw5rpmytp4WBayhqKGCw":{"text":"Great music the night we went. It was jam packed on a Thursday night and drinks are reason","useful":0,"cool":0},"n2-iVMsKlHUXDEQ7uJqHNA":{"text":"It was a rainy Monday night and we thought that we would have no problem getting in to all","useful":3,"cool":1},"14KUIW58QAQeQriNGPljgA":{"text":"nice, warm, quaint feeling. great music! drinks are ok. just get beer and you should be go","useful":0,"cool":0},"TBmvYtfTO9034-A8JnCUtw":{"text":"Bourbon Street is for loser frat boys and rednecks who've never left home. If you want a y","useful":1,"cool":0},"6nRLApjGiRmVcdbGeBXE_Q":{"text":"The zeitgeist of jazz clubs. \n\nHere's the deal:  Such a packed house (we're talking capaci","useful":9,"cool":8},"8ElnRhG5RXOKH9MKC7a0dQ":{"text":"Probably my least favorite bar we stopped in. Completely overcrowded, and cash only. The m","useful":2,"cool":1},"wFdrwV8OpAcXAGtdOf_-Bw":{"text":"The band was awesome and the atmosphere was exactly as you would expect for a New Orleans ","useful":0,"cool":0},"y782gUogyEi4FFlmLKasSw":{"text":"Was there on 6/26/19 with a group of 7 ladies for bachelorette party.  Had the best time e","useful":0,"cool":0},"w38d7uOOJYR_4XAJ8cspdg":{"text":"World class R&B, the inimitable  Giant Gerald French holding court, drumming, quipping, an","useful":0,"cool":0},"lnrggmH8IuyB441LmptcKg":{"text":"The trio called Chaz provided fun good music. The floor was jumpin. Chaz himself was a was","useful":3,"cool":3},"MBhqirKY39IdyUyIlSzoCA":{"text":"came here after looking up \"best places to go to for jazz in NOLA\" and this place popped u","useful":0,"cool":0},"5qya2rmuFTqvcSyDGbD-6g":{"text":"Great music!! Even better bar staff. They were super friendly and accommodating. I was abl","useful":1,"cool":1},"1cZo5-MmRriju82kKutS-A":{"text":"The Spotted Cat is a historical jazz club where amazing acts have played  before, unfortun","useful":1,"cool":2},"qRM-moHB628GbmsQ7YMaVg":{"text":"A fun lil club with live jazz and a funky atmosphere! This is a good spot on Frenchman Str","useful":0,"cool":0},"eZTlezBj2A_Ji9Iaxn491A":{"text":"This is a great Frenchman Street bats to go to anytime after 2:00 pm.  Bar is cash only an","useful":0,"cool":0},"nh0mNwFshHDd-4OX_WA1Ow":{"text":"Mein absolutes Highlight ist dieser Jazzclub. Weg von den grölenden Touristen auf der Bour","useful":0,"cool":1},"egLC5XL975Y75ZtRT8ER8A":{"text":"Cheap beer and great music, what's there not to like.  Be sure to come early because there","useful":2,"cool":0},"OV0lh_VDHjcPs1A6tE04mQ":{"text":"Couldn't possibly love this place more. Amazing 20s-30s vibe, amazing music, absolutely au","useful":0,"cool":0},"2v6CaqOA7zuN8lSEAdKi0A":{"text":"Sooooo much better than Bourbon street!!  (if your with your girlfriend) then Bourbon is p","useful":1,"cool":1},"G1agVkZJMxUims1wEjH0-A":{"text":"Always a good time at the Spotted Cat. The music is great and that's what really matters w","useful":2,"cool":1},"5KazIpyFQcsA3UM2keCqIQ":{"text":"Sad to say this was not my favorite spot in the French Quarter. Heard nothing but positive","useful":0,"cool":0},"FDOkEXtWIdrv1YUxwRrhjg":{"text":"Everything you expect out of a hole in the wall, live music venue in New Orleans. Crowded!","useful":2,"cool":1},"wDSSc372JrEypPHTeKu4oQ":{"text":"This place is incredible.  Along Frenchman Street, it offers better variety than Bourbon S","useful":1,"cool":2},"qdRCVM3uYFOqMbXQS1qNzw":{"text":"Great live bands with solid beer selection. Small bar that gets pretty crowded but well wo","useful":0,"cool":1},"G65N5WTPgt-Yv5w8sPqPGQ":{"text":"Really cool bar, great bands too!","useful":0,"cool":0},"pAE4LRAbS9dN7_bVhVyL2Q":{"text":"Wow what an awful experience! The band is RUDE and the place smells like a butt. I would N","useful":1,"cool":0},"6IQmRwOaz0-kmR8wYgKgGQ":{"text":"Second time in one year visiting the club on a busy weekend nite.$5 cover. Other bars in t","useful":0,"cool":0},"PPXmRzRs3fL2Jd_xnLtBZw":{"text":"We had an amazing time at the Spotted Cat today. We rolled in there on a Sunday at 2:00 an","useful":0,"cool":0},"bD3wbZMHW1JC2YOZviv8Ig":{"text":"They should rename this place Fire Hazard, because it's too crowded to see the band or get","useful":0,"cool":0},"JsXyoe7ew7tLHisppGmRvg":{"text":"We've been here before. It has great local Jazz entertainment for the cost of a small dona","useful":0,"cool":0},"lT-MPwCdDJB3PSJOB5dDBA":{"text":"Didn't get to spend a whole lotta time here but the bit I saw was pretty cool. A little di","useful":1,"cool":3},"NknKFLXHZ0i6rWtV-idsIQ":{"text":"The best music bar in NOLA.  Too bad they have so little room.","useful":0,"cool":0},"WniE0_9NWhAa5auLnspX5g":{"text":"Very crowded but fun spot to see live jazz. I really enjoyed it during the day! Not as cro","useful":2,"cool":1},"-mIMlI8VKj0fKfPLRx8FIw":{"text":"Great place.  Highly recommend - the music is perfect.  Get there early - both times we we","useful":0,"cool":0},"tJFdMRfJ8_zSEPecsGGL6g":{"text":"Everyone told me to come here during my first NOLA visit, and it did not disappoint! Great","useful":5,"cool":1},"hMqNOuFP5uwYrG-4oztBEg":{"text":"Very touristy place for the under 25 crowd.  No zydeco dancing even though this is how it ","useful":0,"cool":0},"debRfFydcOTFjnxRsZznXg":{"text":"Great jazz, cheap drinks and lively environment. \n\nMany other bars down Frenchman St, but ","useful":3,"cool":2},"IVklM6aI-jMiD9diqilXAw":{"text":"Awesome live performances. Only complaint is that it's a small location. If you get claust","useful":0,"cool":0},"NUSlDreb6GTjNS5-xJlWeA":{"text":"This place was all that I had heard it to be. It was packed, the music was pumping, and I ","useful":0,"cool":0},"VwG1HAAgtTkQQZ_7T22epg":{"text":"$5 cover. I thought wow this must be a big place because so many people going in . Not the","useful":0,"cool":0},"IHW9iBiDg1qlEw278nTovQ":{"text":"This spot had the best music of all the bars I went to during my NOLA trip. The bar is not","useful":1,"cool":1},"wnPwBL_3xzVEBXtplSwuBg":{"text":"Crowded, small, and expect to stand.  It's worth it if you get the right show.\n\nWe saw Kri","useful":4,"cool":4},"8tpfOOYxfUEdr4iNvR8Gcg":{"text":"Amazing!!! NOLA at its best. Went on Saturday night and was enjoying myself soo much and I","useful":0,"cool":0},"Q49gNTVicQQbb-qOcVGDmg":{"text":"So here's the deal, if I walk into a jazz bar and after having 30 seconds of music falling","useful":1,"cool":0},"hsk3wqCKUnKMJeWHR8jGeg":{"text":"My god, this place is cute. Some of the other bars feel more like modern jazz bars but if ","useful":1,"cool":0},"1AxVGtBIig01Y6eYDffreA":{"text":"This place was a definite highlight of our vacation! The bar is nothing fancy( I'm use to ","useful":0,"cool":0},"Ti1FcOX0_T0I3NEFzJ_Jag":{"text":"Such a great spot to listen to live Jazz. Every time I am in town I make sure to hit this ","useful":1,"cool":1},"033rixHoumxnTi9pYg1x2g":{"text":"Fun divey bar with a low cover and great band. Drinks are simple but cold and made fast. N","useful":0,"cool":0},"s0l60Zvo_9GyU7yQC6A9CA":{"text":"Great spot to hear live music and get a drink or two. If you go, go willing to stand, or -","useful":0,"cool":1},"skWM6TcaVlDTDicaARIGKg":{"text":"Fabulous vibe! Swing dancers - great band - lead singer dancing on the bar - Something for","useful":0,"cool":0},"Gmd-1GlQivw-MBdMhkjP9A":{"text":"This was a great bar, but what made it exceptional was the bartender Seth! He was very fun","useful":0,"cool":0},"GjX_rfHU3S20cXshoM6Y-A":{"text":"Ok so to start with a positive, really GOOD jazz music and friendly customer service. This","useful":0,"cool":0},"atkWpvBRij6qje9wATWXnQ":{"text":"Amidst all the music heavy clubs throughout Frenchmen, certainly among the very best is th","useful":13,"cool":10},"ld4MPx8r1ZDeZ5H940JN7g":{"text":"We had a great time at the spotted cat. We watched the band, Jumbo Shrimp, and they were s","useful":0,"cool":0},"8qqYCLgpLq462pY7zNTZ7A":{"text":"The Spotted Cat is a fun jazz bar with cold drinks and great energy. The bands really know","useful":1,"cool":2},"66OF6EjKZtNOLLfcwj086Q":{"text":"Fantastic jazz albeit a little small. The last night we went i would consider it a jazz sh","useful":0,"cool":0},"spcpuWGZRqKkhh9CIpxW8w":{"text":"Killer music. No cover. Incredible. You can walk down there from the French Quarter but at","useful":1,"cool":0},"Y7NGy_TvYNJE-6J1HiBPag":{"text":"Bartender asked if I really wanted that 'Pennsylvania piss beer'. Didn't realize it's a ba","useful":0,"cool":0},"vMH95ZtuhauB4uRCnQ3ymQ":{"text":"Friendly staff and enjoyable experience, the music on tonight was Mischiya Lake and the Bi","useful":0,"cool":1},"9oj_gPEnH8PP6U-b0avNGA":{"text":"OVERHYPED!! We read many reviews about how Frenchmen street area is better than Bourbon bu","useful":1,"cool":1},"L1E2siN0JCn-hc8aVQc7VQ":{"text":"I almost hate to review this place, because I love it so much.  Ever find a little gem, th","useful":3,"cool":3},"M58-y0I2OJObnHfb8yTEkQ":{"text":"Very cool little spot, gets really packed but it's a lot more mellow than Bourbon St. the ","useful":2,"cool":1},"ZvEePw6NtUxllkUymkBxeQ":{"text":"This place is absolutely insane. We wondered in last night and luckily got a coveted seat ","useful":1,"cool":1},"5wwrujJ76p7fm3SFlkClFg":{"text":"Fantastic place to listen to Jazz. Would definitely repeat. No food but drink selection wa","useful":0,"cool":0},"GwYhTwnaPTbUcUymv0Z1oQ":{"text":"One time before the name change, I enjoyed a wonderful night of jazz - acoustic, packed in","useful":0,"cool":0},"kv2cEo-Ie_Ms_lar6cnBZg":{"text":"Awesome music. Saw two bands perform (daytime and evening), both were excellent. Mixed dri","useful":0,"cool":0},"1BBhNUYJ0um8ZVI35FcVoQ":{"text":"Unfortunately I visited Frenchman St during the day so there was not much going on anywher","useful":3,"cool":1},"GUqgRh2x4CJcMx8FlIeO3A":{"text":"Such a fun, festive spot. We were recommended this place by a local and couldn't be happie","useful":2,"cool":1},"V320XMuiGUhlteF7OXGzdQ":{"text":"Very crowded nowhere to sit couldn't get service support life depended on it music was fab","useful":0,"cool":0},"5ghRgfmUF4meIEtxjwYl-Q":{"text":"Great spot!! Really good jazz band, awesome beer selection and a nice spot to get out of t","useful":0,"cool":0},"_yc9QARkZjH654fvD_1m6g":{"text":"Awesome place and the best music.  Eat next door if possible great little Italian place.","useful":0,"cool":0},"pqWs9ul55k1LgxH_iEVHRA":{"text":"We saw the group \"Jumbo Shrimp\" on 02/06/2020 and it was a great set.\n\nVERY CROWDED and pa","useful":0,"cool":0},"2h8Zb57GEc8Ow6PXjvWLpg":{"text":"Stopped in when we heard this absolute fabulous blues singer.  OMG!  She was fabulous.","useful":0,"cool":0},"LUHOVAwTwOwBin7DjzdbtA":{"text":"It's a good spot for jazz and we were surprised at 4:30 PM already attracted locals and to","useful":0,"cool":0},"B7D2qIuI1zCxDjyYrKOZDA":{"text":"Panorama Jazz Band's lead singer, forcefully asked me for tips. She was rude about it and ","useful":0,"cool":3},"mVbuFp4-lQC62nCOA80nag":{"text":"This is a bar you go to if you want to feel segregated. Horrible. Why is this business in ","useful":1,"cool":0},"OpcgrIZa8t-5nnMDUvIlMg":{"text":"In New Orleans but want to stay away from the drunken frat boys and girls gone wild?  Look","useful":6,"cool":2},"JTuSP6pPGn4aaPR7GwxmRw":{"text":"First yelp review. It was so bad I needed to do this. The singer cussed a group out and us","useful":0,"cool":0},"L5IRcpbX_UIOp13aMSNmOQ":{"text":"This is a quaint venue for jazz packed with lots of patrons walking in/out randomly.  They","useful":3,"cool":0},"muay47rIQ2uMgvqEp6eLGw":{"text":"The Spotted Cat was everything we could have asked for in achieving a New Orleans Jazz Clu","useful":1,"cool":0},"X8zsrYFHrng5lMc4fPykIw":{"text":"Lots of fun, great music, place is a real dump. Free, but alcohol pricey. Venue small, w/o","useful":1,"cool":0},"CaR0vN5yXKbhVySZMeb-JQ":{"text":"I heard from reviews that among a few other clubs, The spotted Cat was one of the best in ","useful":8,"cool":7},"pWzuTa_70XW0KSqPP33EWg":{"text":"Wonderful little spot to get a drink and listen to good music. It's a very small space so ","useful":0,"cool":0},"QUXnnGFWRYZ60jHJU3vPjw":{"text":"I would go here all the time alone or with friends and I have never been let down by this ","useful":0,"cool":0},"o4Ewv4nvqzjlQ6Z1GZ4b9g":{"text":"**HAPPY JAZZ AND A PIANO IN THE BATHROOM**\n\nOne of my favorite jazz spots on Frenchmen Str","useful":11,"cool":10},"726XOSaVmXBGwC33ZFSdNQ":{"text":"The Good: a class act of music, talented musicians, not too crowded, friendly bartender, r","useful":0,"cool":0},"pMf4LXQcwGrrR4uE3TGnIg":{"text":"I went Thursday at 630. There was a cover. Drinks were really expensive. And music was dec","useful":1,"cool":0},"Cy1KzxEyLjzMcePvp-AWuA":{"text":"Listen, cash only places in this day and age are lame. Despite my disdain of a cash only b","useful":13,"cool":7},"sZjHlTJWWzBtVzwvQU0kyg":{"text":"So, this place is not fancy, it's a plastic cup-kinda place that's cash only. And, you nee","useful":1,"cool":0},"FVxTEh4S2zPdsmR4t-M0sw":{"text":"I do not know what the live music sounds like on any night except Wednesdays, but if the m","useful":0,"cool":0},"kZdVjOYFcbrDzCzPxhFsmw":{"text":"We booked tickets in advance for this show but they refunded our tickets due to change in ","useful":0,"cool":1},"IRJUEkzP9sLMeNpLRqfO2A":{"text":"Loved this Spot.  Up close and personal (like most in NOLA) and the James Martin Band was ","useful":0,"cool":0},"cUMV_Sp4OkxdubeT7L_mCA":{"text":"Super cool spot with great jazz. Reasonable prices and a great atmosphere. They do take ca","useful":0,"cool":0},"jRdfmHQJdBMf8fs8QeDPQQ":{"text":"Not crowded at all on a Sunday afternoon. Was really glad we ditched the Quarter and heade","useful":0,"cool":0},"ZpDGxWujK8-tYcTda5rEPg":{"text":"Pretty freaking fabulous. No cover, the band will holler at you \"one drink minimum\" (not e","useful":2,"cool":1},"QH5fr48SwwKbYcylsXg9JQ":{"text":"One of the best things (and probably the only thing) to do on Frenchmen St. We stumbled in","useful":4,"cool":4},"BQIr8npGxRLJWFKUjP2FXA":{"text":"Everywhere you go, there is beautiful music performed by talented musicians throughout Fre","useful":1,"cool":3},"lbm0BPSnUPII-ILK6X-SEA":{"text":"It only took me twenty-seven years to get back to New Orleans and in that time a whole new","useful":11,"cool":12},"rE1bd2Flaw6gP395Gd6kyA":{"text":"Came here the night before the mandatory shutdown of all bars and clubs. Even standing (em","useful":2,"cool":1},"xqX35XjHX3qUBSgyiUDZ6A":{"text":"Local jazz club that is known for....idk...jazz?\n\nThis place is tiny. There is no place to","useful":2,"cool":1},"MpWZEU9wNCJFLKgmwFBzpg":{"text":"Came in on a Sunday night. They were in between sets but it was a long in between. So we d","useful":1,"cool":0},"z86o1xl5qumq8IU9KFD24w":{"text":"So happy to be back at the Spotted Cat which reopened tonight!!! We were patiently awaitin","useful":0,"cool":0},"fOQq6EI2TAaOVZ7LSKyxdw":{"text":"Quintessential New Orleans jazz club. Located on Frenchmen Street, which these days has be","useful":5,"cool":4},"lzdw1ZgrgGi6s00cyzA1eQ":{"text":"Catch a show at the Spotted Cat and you will not be disappointed. The talent is great and ","useful":2,"cool":2},"hHc9xKDZbkYGmUg6i_WueA":{"text":"This place came highly recommended by every person we spoke with that had been to New Orle","useful":1,"cool":0},"gIHsnQfqdXnERYnjbDv5UA":{"text":"Hoppin' on Frenchmen Street? Make The Spotted Cat one of your stops. It's a must stop in p","useful":19,"cool":19},"xh6NB1zT2BPxNhDsWlcD2A":{"text":"don't go!!!  I was very disappointed.  The Friday night band was terrible. They were also ","useful":0,"cool":0},"D35UlLXTR_m9bnyyhtOOCA":{"text":"Amazing music and such a fun vibe! this was definitely the best bar on Frenchmen. I would ","useful":1,"cool":0},"miHlZW34QmLU5MG20oxc4g":{"text":"Probably one of my top favorite clubs we visited on the trip to NOLA.  It's located right ","useful":3,"cool":2},"fl-APMFsBAra7CxjTm67rA":{"text":"My visit to the Spotted Cat was much too short.\n\nOn a warm January afternoon, my friend an","useful":5,"cool":5},"qph0qlBYUeNKBcgivfhiqw":{"text":"Had a great time listening to a local group play Brazilian tunes. And there was an accordi","useful":0,"cool":0},"7Y2bKR_o7ZakLVGmwfpn4g":{"text":"This is such a fun little spot to catch live music. I was here a few weeks ago and the dri","useful":0,"cool":0},"Po0Cu8PmYlTS5P8MUw_q8Q":{"text":"My friends and I came here on a Saturday night, while walking around Frenchman St. in sear","useful":2,"cool":2},"fvupJXq44BB5YcYSeE54AQ":{"text":"This place gets crowded as hell. But it features excellent live music, and is next to a ni","useful":1,"cool":1},"D_OU4ODh3zV0jZeVCf1neQ":{"text":"This is one of the best of many amazing Frenchman St. music venues. Be warned that late we","useful":6,"cool":3},"bX-w3nGrOprANELA6xPZnA":{"text":"How can you go to New Orleans and not come here? When I pictured coming to New Orleans THI","useful":1,"cool":1},"1odGOmHb41ffgjClH-8GdA":{"text":"This place was a lot of fun.. As you can see from my video this place was a vibe!\nThe ener","useful":12,"cool":12},"byYjyqX4UXyBKBfkP8vAJQ":{"text":"Awesome karaoke!!! Nice place to hang with friends! The guy on the stage was funny! He inc","useful":1,"cool":0},"4o_Xs2CPA0wr_quh4kvCCQ":{"text":"With all the amazing live music joints on Frenchmen St, this one is certainty divey in com","useful":1,"cool":0},"cke8vP3en9VQ8VZhq5FjIg":{"text":"So much fun!!!  Yes it's crowded at night but great jazz, nice bartenders, and a dang good","useful":0,"cool":0},"IpPOTdoVEZBLOZHIRrBo6A":{"text":"Maybe my expectation was off, but we walked in to standing room only (as expected) but thi","useful":2,"cool":0},"nfhAus84pJo4sXWtSQlwzg":{"text":"I really enjoyed The Spotted Cat! We'd done Preservation Hall for live music and dipped in","useful":8,"cool":5},"GrDipzWa8VCGM-St_cE-IA":{"text":"Place is full of crap! Paid cover and told us pay more for reserved seating or you can fin","useful":0,"cool":0},"rRclXhEfLrABZTPzBRMLqg":{"text":"Before traveling, I become extremely fixated on finding out about all the hot spots and no","useful":10,"cool":6},"bkiMZnYzy4uX63kHmC1TKQ":{"text":"Go for the music. If you drink beer you'll be fine. Want a proper cocktail?  Go somewhere ","useful":3,"cool":3},"fGGf3_Oivbnp8M18UigWbA":{"text":"Super CROWDED!\nMy second time here and still super crowded.\nNO COVER but they ask for one ","useful":2,"cool":1},"ZXAyUQx4mkgQxmAEa0-VrA":{"text":"On my visit to NOLA I was told Frenchman St is the place to go around 6:30 for good jazz m","useful":3,"cool":5},"k2W_FuHHCrFu4Ps-CZLGRQ":{"text":"A hip and happening joint in the heart of Frenchmen Street! This is such an amazing jazz v","useful":1,"cool":3},"_H9RE6sAvfKHKUnvCjMpHw":{"text":"You will have to be a smoker ~ you won't even need to buy your own cigarettes","useful":0,"cool":0},"Nx5aBi4SXcDrLKiUYiQTbw":{"text":"I'm not much of a jazz & blues fan. I actually sound like a horrible person saying it beca","useful":6,"cool":5},"jAyiCyi3_FzyNkpAr5sH8w":{"text":"This place came highly recommended from a local to see live jazz. \n\nWalked in on a wednesd","useful":0,"cool":0},"MuWX4pNnckAzrUpymH-X6A":{"text":"I visited this place on my trip to New Orleans there a Boudin balls and their hush puppies","useful":0,"cool":0},"0iBh6UxzrcrU4otEp8bikw":{"text":"Good music but crowed. The drinks were ok. We didn't stay long because there were no room ","useful":1,"cool":0},"nZ3Adz6SQGOx5I-fg0lJ8g":{"text":"Every single trip I take to New Orleans requires a visit to The Spotted Cat. Why? Because ","useful":6,"cool":5},"Ynvw5_tgzifAtOGXM4HqhQ":{"text":"This place is so much fun! Great jazz bar. fun place to check out live music entertainment","useful":1,"cool":1},"6snXpuWjq0E-YkWanJTObA":{"text":"One of my favorite places to see local, live music in New Orleans and it's always FREE.  O","useful":3,"cool":3},"Greb9rQeoCJ-Hz26xH4szQ":{"text":"The Spotted Cat is a great place for live jazz music, well-priced drinks, and a fun crowd.","useful":6,"cool":2},"5ptFCRbr_VFeoqV0n6Ez1w":{"text":"Went there with a group of friends and the bar tender was awesome but the band did not app","useful":0,"cool":0},"Dxbkrj-oswxPNikKl8FSpg":{"text":"We were here for a few hours listening to live music- jazz. There was no cover charge when","useful":3,"cool":3},"1-JJzqG2H0kuxsXIRzV25A":{"text":"Spotted Cat is a classic Frenchman Street bar with great live music. The bartenders are al","useful":0,"cool":0},"6bgLPs6LxPBicjFkoir3Hw":{"text":"I had never been to NOLA before and one of our hosts was like you have to experience the S","useful":9,"cool":7},"Qcn0WUdHNjL4URSUCRU6ew":{"text":"PROS:\n- great band selection\n- good ambience\n- cheap drinks\n- no cover fee\n\nCONS:\n- mixed ","useful":0,"cool":1},"fY6_3Rn0AM5XGhhwfE19sg":{"text":"Best walk in music venue on Frenchman St. Prompt bartenders and decent prices for drinks. ","useful":1,"cool":0},"qH3pbgCvzi1CU53Oru3stA":{"text":"Great spot to check out some really good live music along Frenchmen Street in the Marigny.","useful":3,"cool":4},"unmpHyhe1HUYF5fey-eDTQ":{"text":"WOW! Now this is where the locals go to hear some good jazz. Cool little joint. Good music","useful":1,"cool":2},"_h3RdRJTeLVeseqm7K4niw":{"text":"If you're looking for an authentic NOLA experience this would be the place to go.  What I ","useful":0,"cool":0},"pw2bLiHYjo5Y8nWGn8nR2w":{"text":"What a truly fun NOLA experience! My husband and I had a great time here a few weekends ag","useful":2,"cool":2},"mOcDY25ndNEx261gUAluSQ":{"text":"I thought this was the best thing in New Orleans. Easy going with great music.  I was ther","useful":1,"cool":1},"8pF1P4BSW93d5g6PANQ7Zw":{"text":"There are so many bars to choose from in the French Quarters but I came here for live ragt","useful":0,"cool":0},"mdscrzn1ECKqPNHC-UOYcQ":{"text":"Just stopped at Spotted Cat on Wednesday after our uber driver recommended going there. Th","useful":0,"cool":0},"w-H4PNG5FT3EwgxTPkY95A":{"text":"Came here because my friends were enjoying the music. I really liked the guy (Antoine Diel","useful":2,"cool":1},"hnKkoewLq94_gbAXb6mGNg":{"text":"The Spotted Cat\n\nDive music bar and I mean dive. Not alot of seating, just available aroun","useful":2,"cool":0},"zx-wa9vw3USHyUe-55VY_g":{"text":"This place has great reviews, is listed as one of the top jazz clubs in New Orleans and in","useful":5,"cool":1},"1ENleA9sdVkB7TqD36rUWg":{"text":"Great venue to catch a live jazz band.\n\nWhen we arrived the place was half full, with the ","useful":8,"cool":6},"pz6ikaBabldNePK_OlEbSA":{"text":"Great live jazz of the sort that doesn't seem to exist anymore on Bourbon Street this plac","useful":2,"cool":0},"B-L1Lf3opJ_0CAWqfIKrkg":{"text":"Great live music, and the art bazaar next door is great. Only gave 4/5 stars as the bar it","useful":2,"cool":0},"hc1OvIThYZFACg8G0dNcBQ":{"text":"Fun jazz bar to check out, outside of the normal Bourbon Street scene. Would recommend che","useful":2,"cool":1},"nydth3uu_Zuw5V01wQASMA":{"text":"In love with the live entertainment! If you are a big fan of sweet alcoholic beverages, pl","useful":0,"cool":0},"-m7pwC7JhDYNrmLnHx3cDg":{"text":"Probably one of the coolest hang outs in New Orleans.  My time in NOLA increased exponenti","useful":1,"cool":2},"Got5-JISblHvAA87CP_4SQ":{"text":"Even in the predusk, this is a dark cave of a place, cat. A cool jazzy breeze takes your b","useful":2,"cool":1},"rMaPWj-EOqGZyiENA7RL6g":{"text":"Let me sum up the NOLA experience for you:\n\n1. You'll walk a lot.\n2. You'll eat a lot.\n3. ","useful":20,"cool":25},"cj1C-D9_vckmYV3vk8-Gvg":{"text":"A pretty happening joint. Seemed more filled with tourists than locals tho, lots of weird ","useful":1,"cool":1},"3c_X1v1a2CAYi0Sdqspl5g":{"text":"Excellent place to see some of the best music (I'm sure the locals will abide). However, i","useful":0,"cool":0},"-zIlmjNvsBxOpcwjmSmYNQ":{"text":"There are two places I always visit when in New Orleans.  One is the Avenue Pub, this is t","useful":3,"cool":1},"YkuhLeCcolYPDNwKqa2qdA":{"text":"Great show at the Snug Harbor, top musicians that show had. \n\nUnfortunately, I felt like t","useful":3,"cool":1},"yccNC3BqF2mjXVjGbwAPuw":{"text":"On our first night of adventures in New Orleans, we were eager to try many cool places, bu","useful":7,"cool":0},"Zigktvbozk3lkFTYTsC9cQ":{"text":"They have a friggin' piano in the bathroom... need I say more?","useful":17,"cool":17},"-ltkgdM3rO4nJlMcRW7o2Q":{"text":"~~~~~~Frenchmen Street~~~~~~\n~~~The Local's Hang Out~~~\n~~~Finest Jazz Musicians~~~\n\nThis ","useful":24,"cool":18},"qS7CQiLxJHpYtDS86Y3-Pw":{"text":"Hey all you HEP Cats, this place roars! I love to come out here and see what's happening, ","useful":2,"cool":1},"GOKevsQkH0FkN2vBErtiKA":{"text":"We enjoyed listening to great music at The Spotted Cat on Memorial Day weekend. However th","useful":5,"cool":0},"wAVGFGQJ7yKrVy1XywBB0w":{"text":"Good love music. Small bar. CASH Only. \nCharged $3 for seltzer water. Seems quite a bit wh","useful":3,"cool":2},"h_Ira2DICnWgm1K97DEZ2g":{"text":"Crowded as heck on a Saturday night around midnight (no surprises of course). $5 cover cha","useful":1,"cool":1},"hbMJ9hYP71l1n1oFoZUJuQ":{"text":"I seldom give a place a 5-star review.  For me, an establishment has to verge on perfect t","useful":14,"cool":12},"GJQqIt3MF7IcE6RxlYr2zQ":{"text":"Came on a suggestion from a cousin who was born and raised in NOLA. Online they say showin","useful":2,"cool":0},"TCLeReqX-cQlTpYMSjSnWg":{"text":"My favorite evening activity in all of New Orleans. I've never been a huge fan of a lot of","useful":2,"cool":1},"_HufS5O3kL1QXpE3Fri5Og":{"text":"Ding, ding, ding.... We have a winner!!!!  A very big round of Yelp thankfulness to Joi B,","useful":6,"cool":5},"FFwZ0QOUPIUBkcYKIf_HuQ":{"text":"One of our friends told us about this place, so we had to visit! Of the few places that we","useful":0,"cool":0},"AF1KAiJBCEAVpj01UkBagA":{"text":"Great music but the place is kind of cramped. Hard to linger long because there wasn't rea","useful":1,"cool":0},"-dy9MYF7UEZi5pkE_lqUNQ":{"text":"I learned years ago to bypass Bourbon Street and head to Frenchman Street instead. The Spo","useful":2,"cool":0},"Nv944jV5rM2M6v-FURYzeg":{"text":"Amazing live music and good vibes all around! \n\nWhen I went on a Friday night, it was expe","useful":6,"cool":5},"SnMe1ODHvDy40xk0j4mHvQ":{"text":"Nice little jazz club with lively patrons. The blonde bartender was listless and unhelpful","useful":0,"cool":0},"_jixZmh9v0pxMZhxFu6drA":{"text":"New Orleans - The city of food and music!\n\nOn my first day in the Big Easy a local gave me","useful":3,"cool":3},"Fr0ZzDjJn7-8E9_xbcI40A":{"text":"Great place to see live jazz on Frenchman street! We went specifically to see The Jumbo Sh","useful":4,"cool":3},"LD72VAh_lzlDs3iMewXulw":{"text":"Always worth stopping in for the music!\nI go here almost every time we get to New Orleans.","useful":5,"cool":6},"3jcPzsg36LwhR1lArYz_wg":{"text":"After schlepping to Frenchman's St during our trip to NOLA, this was the ONLY place open o","useful":2,"cool":1},"1fxoyjo09L3dcKoY1HC-zA":{"text":"This place is about the size of my living room but boasts a perky personality.  I can't im","useful":4,"cool":4},"X6m1-P2ZZg6svbaPffzdZg":{"text":"Such a fun place for live music! We came in during the changing of the bands, so we where ","useful":1,"cool":1},"pMCLaNGvHWoIWhHb0DBpcA":{"text":"Live music. Good drinks. And outstanding service! The bartender Connor was quick, efficien","useful":0,"cool":0},"J-krV7AwaSra5nlb7J7DzQ":{"text":"I'm so glad they were able to open again now that live music is allowed indoors. I took my","useful":1,"cool":0},"tZI5xjtgOKSB4ZyZIbtVTA":{"text":"So glad that they were able to reopen after covid. Reservation recommended if you want to ","useful":3,"cool":0},"DY2snpDlfUFgNxtzioKR9g":{"text":"Was there late September. Hate that we waited til the last night to hit this area. The Spo","useful":1,"cool":0},"DNcefJMGHozLY7m7IE8nsg":{"text":"Perhaps the smallest, grittiest, and most authentic New Orleans music hall in Frenchmen's ","useful":3,"cool":2},"iZ8ukK-DwSjmqWIK_7UtnA":{"text":"Unlike Bourbon St., there are no outside drinks and you have to buy at least one drink for","useful":2,"cool":0},"O2NWmN6ZGDaHnXS1O41Ppw":{"text":"Great music! Absolutely loved the vibe. Lemme just say it does get really crowded when a b","useful":1,"cool":1},"VVNGqIlFhxxUP5Dl2V2yKQ":{"text":"If you're looking for a Jazz Club that plays live music that gets pack no matter what day ","useful":1,"cool":1}}