{"rl-4BSZfkWN8zYtyk5DXtw":{"text":"If there were ever a chance to rate a company 0 stars, it would be for Riverlake (Universi","useful":3,"cool":0},"onpCoq11d_pTztl6LRGkig":{"text":"We scheduled to see an apartment today at 11am w/Sheryl.  She did not show up for about te","useful":15,"cool":1},"ooNPUOPx1wqoxAOZ97xTzA":{"text":"After reading the five-star review below, I just feel it is my civic duty to write a longe","useful":18,"cool":0},"qdcIpjATEYqpfIYNsKPDcA":{"text":"Truest definition of the word slumlord. If you see a Riverlake Properties sign on the fron","useful":4,"cool":0},"pZErSO0SIH0VCLcFpHwTmA":{"text":"Please heed these words. DO NOT RENT FROM RIVERLAKE. They are the true textbook definition","useful":17,"cool":0},"AD1MO8gjDYLpHT3hAB6s-w":{"text":"I do not rent from Riverlake but I almost did.  Luckily we talked to some current tenants ","useful":25,"cool":2},"L4JvY8GxHqec7mGUiqADUg":{"text":"DO NOT RENT FROM THEM!!!!! Just care about the rent checks you'll have no Air in 100 degre","useful":5,"cool":0},"wPp9vzEGZn81o1BUX4srLA":{"text":"You cannot get through to anyone but secretaries if you have a problem. I was without elec","useful":2,"cool":0},"PFsxiXa8NHh4Uhs9p-Z3bA":{"text":"Absolute slumlords. Riverlake \"loses\" maintenance orders, doesn't return phone calls, and ","useful":16,"cool":0},"aRN-cZIIokC-NW-syUZulQ":{"text":"Be Aware; Read the lease VERY Carefully! \nWe had a bad experience when moving in and out o","useful":4,"cool":0},"1i-ZTKTuFNRunZd6CccrFQ":{"text":"Don't expect to get your deposit back. These people will make up problems and take it out ","useful":3,"cool":0},"Lpf_0clV2HLf2LUw1xsUnQ":{"text":"I'm going to add fuel to this fire in the hope that I may discourage someone from going do","useful":5,"cool":1},"aTHdD1oASlLr5QYONhNyGQ":{"text":"This is by far the WORST business I have ever dealt with in my life.  Everyone who works i","useful":1,"cool":0},"LD6d0xZTWIgZT5YJRKeJ2Q":{"text":"Don't rent here.","useful":16,"cool":0},"WPeU_4jp-vcDrBWrP3ABnQ":{"text":"This place is a complete waste of time. I drove an hour to look at an apartment for them t","useful":2,"cool":0},"rDXGPhhwTu5KSaKecPHC7Q":{"text":"Hey Riverlake gets a A+++ from me.\nI had no issues living in the Property,my neighbors was","useful":1,"cool":0},"xkvRqXh6HcyOv635IgzoAA":{"text":"Rented at 1034 Saint Philip in the quarter and they were ok. Faceless rental corporation m","useful":9,"cool":0},"FSpiMaiOwG3Rv8TtGPi7rA":{"text":"Unless you love cockroach infestations, don't move into a Riverlake home. We had to replac","useful":3,"cool":0},"BFfwCm_aRIH2FavrI9-4Kw":{"text":"Save yourself the time, energy, money, and trouble and just rent from someone else. From t","useful":3,"cool":0},"DbztPh6aSjmQ0DL28cgBrA":{"text":"I have never dealt with such incompetent people in my life. The fact that they are still r","useful":2,"cool":0},"0Hj9b2JegbJ-lfbFud-X_w":{"text":"DO NOT RENT FROM RIVERLAKE PROPERTIES. THEY ILLEGALLY THREATENED US. \n\nWe have been rentin","useful":1,"cool":0},"fMhtTJmOzN6vSMTqJuKdeA":{"text":"Quite possibly the WORST rental company of all time.  I made the mistake of signing a leas","useful":4,"cool":0},"iTindrjRNLe3PatrnppGoA":{"text":"Do NOT rent. Unlivable conditions, no air conditioning, bug infestation, mold everywhere, ","useful":3,"cool":0},"uw3Ct0S9pwm6-pjmQECZgA":{"text":"Not the best, not the worst. They basically own half the houses for rent in New Orleans. M","useful":3,"cool":0},"8ZPg-YPeM0QZIQ4sFVTNhQ":{"text":"Very impressed that they returned 15% of the deposit after 9 months. They wrote all of the","useful":8,"cool":0},"vbnWPOuEnRUm-HM7jAQrtA":{"text":"If only I had read these reviews before renting from Riverlake- everything said is true.\n\n","useful":8,"cool":2},"qqrRY2VrykjYH0mR3n5sAA":{"text":"For anyone, especially college kids looking to rent from Riverlake Properties in New Orlea","useful":1,"cool":0},"WgQGQ2jL4TzN7xL2OZQT8g":{"text":"These people are absolute buffoons. I am moving to New Orleans in a couple of months and t","useful":2,"cool":0},"oWJXhM9qWtbQoTEmeY_phQ":{"text":"Riverlake Properties is a sorry excuse for a business. They are greedy, scheming assholes ","useful":2,"cool":0},"R14AYCbFSzo0pncNdHjRPA":{"text":"Do NOT rent from these people!!!!!! Like other reviews, they are a fraudulent, faceless pr","useful":4,"cool":0},"tyc1YT5Qra_AIIGKQLCVCQ":{"text":"Scam artists that prey on people too poor to hire a lawyer and fight them. I don't underst","useful":21,"cool":1},"dRN8ha_chFYUvzOnvMcUww":{"text":"Scheming, dishonest, manipulative, and downright rude.  I have never dealt with a company ","useful":46,"cool":2},"AMQHZR5Y_pTjfnrRCX9Bbw":{"text":"My boyfriend and I lived in a Riverlake apartment for 3 years.  There were so many issues.","useful":4,"cool":0},"4VGYAXV2eSgh_EOPd65Avw":{"text":"I have always had a great experience with Riverlake. They get a lot of flak because they d","useful":7,"cool":4},"J6rolnYXxpqYPNcEbuaU8g":{"text":"They lost my rent check and then threatened to charge me a late fee for their misgivings. ","useful":3,"cool":0},"kfMLAMYYGFNg604FwhLDtQ":{"text":"2 years in the apartment, s\nA older apartment that need updating. I teplaced the kitchen c","useful":1,"cool":0},"gWOwdWyncRrpbeOK4a-H4g":{"text":"If I could give zero stars, I would. If you want the absolute worst treatment in New Orlea","useful":2,"cool":0}}