{"z0osLHDvXvzfm57D4DmD2Q":{"text":"Service was crappy, and food was mediocre.  I wish I would have picked some other place fo","useful":0,"cool":0},"tXHWJWnTdrraHGUqaPWj3g":{"text":"Enjoyed my fish out at a sidewalk table.  A bit pricey but food was good.  Go to Side stre","useful":0,"cool":0},"lrZiB0XfNZjk8zfYDx_TPA":{"text":"I was happy his was my first experience with Nola food and not my last, started on a low p","useful":2,"cool":1},"_ZdwS4iEzJIVpy7-DjkEpA":{"text":"Had breakfast with the family after a quick stopover. Great food and service (thanks Jonat","useful":0,"cool":0},"6_3e54OjnFnTxSgKrUZ21g":{"text":"The one thing I really wanted for breakfast while in New Orleans was Grillades. I have mad","useful":2,"cool":0},"euVECYOpDtICbbTl0NQfcA":{"text":"My girlfriends and I ate at the Creole House for dinner. Our decision to dine here was lar","useful":0,"cool":0},"HVcbmtcCgXSOyE6TpeNCNg":{"text":"We stayed at the Sheraton and they recommend this place. It was really great. I had the sa","useful":0,"cool":0},"hrtcWlIQ506NPjadrwVBjQ":{"text":"Amazing food. Was quick service too. Had the po boy shrimp sandwich. The atmosphere was gr","useful":0,"cool":0},"eYWObYS899YVWk4BephXYw":{"text":"The chargrilled oysters are amazing! The only reason I'm giving it 3 stars is being the se","useful":0,"cool":0},"ih77YjpQvFnV3IoEOr4xzQ":{"text":"Chargrilled oysters were everything. I also had the Cajun red fish. They don't have many h","useful":0,"cool":0},"P1sjvTti04VC-7teBtS4Gg":{"text":"Reasonably priced spot with good beer and food selection. I tried the PO Boy with sauté on","useful":0,"cool":0},"WgWBquBWLmlOYCKtBEOOFw":{"text":"Awesome! Hurricanes will blow you away! Quick service! Etoufee is terrific...Authentic New","useful":0,"cool":0},"c81v-YG43TDy1QfNeW6aIw":{"text":"Do Not Come to this Place! The shrimp was disgusting you can even taste the dirt inside it","useful":1,"cool":0},"BkKAhn3bGYKrO6aSTSjIRw":{"text":"We went here for lunch today and it was AMAZING. I'm not kidding when I say it's the best ","useful":1,"cool":0},"GEA41ZdplXqHHEMzVX1skw":{"text":"Went here for dinner, got the crab claws, gumbo and jambalaya pasta. Was really disappoint","useful":0,"cool":0},"U8CW4qVZp6HXBJGOHLjAEA":{"text":"Stopped in for some drinks and an app. Got the calamari, it was good. Batter was a bit hea","useful":1,"cool":0},"52phbw4zW9_EEaU_q9c3bQ":{"text":"Very disappointed.... food was only ok.... waitress was not to be found.\nThere's way too m","useful":3,"cool":1},"J1mXmqXzkY8RvUy2saw3aw":{"text":"We stopped into this restaurant due to its convenience to our tour bus pickup across the s","useful":0,"cool":0},"yQ_sREERDKrfFFlAaPGkyw":{"text":"Awesome po-boy selection. Ifyou want to sample, they have a great Louisiana sampler as wel","useful":0,"cool":0},"FGHFz6lIz9xEWsvY3APa9w":{"text":"This ended up being our favorite restaurant during the trip. We had dinner her twice since","useful":0,"cool":0},"74MTz6Ql9JzGc7pjWMu9Zw":{"text":"Yelp led us astray this time. Not even close to 4 stars. We went for dinner - alligator bi","useful":0,"cool":0},"fVUphe8PFx1x6HGTVykdWw":{"text":"Absolutely delicious restaurant! Loved our server as well, he was extremely chill. Stupend","useful":0,"cool":0},"WGjUCZ4AmWwJVvYm6vK50A":{"text":"We had already spend a long while walking around through the parade and wanted to kill tim","useful":1,"cool":0},"zODpKmu_hvROuTJXqtKmCw":{"text":"The reviews did not disappoint. The chargrilled oysters were the BEST!!!! Shrimp po boy fr","useful":0,"cool":0},"Zp5gfToim04o4AOIEgmnDg":{"text":"What can I say, the food here was beyond delicious.  My husband and I were looking for a p","useful":1,"cool":0},"_hCAIjXlEL6flgyJ7cKjvA":{"text":"We ordered the Cajun burger, crawfish Alfredo, shrimp po boy and kids chicken tenders. The","useful":0,"cool":0},"7JThNEB5o6mZjjDQq01DtA":{"text":"Friendly service and amazing food.  Ate here several times over the week.  Highly recommen","useful":0,"cool":0},"Q5ZtoimplmeWkBuIHBgZjQ":{"text":"Awful food! Don't go to this place. Jambalaya was cold, looked like a fast food!!!! We ord","useful":0,"cool":0},"qrdu3PVCOgC7oHXgRCX6ng":{"text":"The oysters were really good and so was the red fish. My dining partner thought the gator ","useful":0,"cool":0},"z1IHCEhVz-W_VIHhD53vEg":{"text":"Loved the charbroiled oysters. Jason, waiter was excellent and knowledgeable. Great locati","useful":0,"cool":0},"e08Xg3i306SFU_IIysuyZw":{"text":"The service was great & my food came in no time! \nI tried the taste of bayou & thought it ","useful":0,"cool":0},"WUCzfgDCTWkTlMCPDp-gmQ":{"text":"OK I have to admit that I had been eye balling this place from my hotel and really wanted ","useful":0,"cool":0},"DskW-YTxNZtPnG_8Xwp1SA":{"text":"Dinner was pretty good. Fish was cooked perfectly. Charbroiled oysters could have been coo","useful":0,"cool":0},"RicBfrPC1iZYV4Y66M_tEw":{"text":"Great new find on the French Quarter side of Canal street. The Oysters were icy cold as we","useful":0,"cool":0},"gNicsKu8ZRFdsvORSpcIiw":{"text":"Came here because of the high rating on yelp but i have to disagree with everyone's rave r","useful":1,"cool":1},"8t7KOiyS3pQwal1jh5BXQA":{"text":"Looks like a dinner, eats like a four star restaurant. Our server, Casey was really sweet.","useful":0,"cool":0},"CkIj-60rmCxPCKjIYxsddA":{"text":"Just ok. You would think with a name like this, you would be about to get some authentic c","useful":0,"cool":0},"iSVfzn9XhXz2SoAXOuNz3A":{"text":"Good food, loud atmosphere, great service by Ben. They were out of Bread Pudding, which wa","useful":1,"cool":0},"UKRpjrhpol989p5DKkO0wg":{"text":"I went with about 11 of my girlfriends. The server did a great job handling all of our ord","useful":0,"cool":0},"MdLo3CUe3HCpW_Da05fLKA":{"text":"The food here is out of this world. I had the stuffed fish; very large and appetizing. The","useful":0,"cool":1},"oRI6k4SdY4KWbyPCtxBywg":{"text":"Had the Creole House Shrimp Po Boy, Fried Alligator, and the Caramel Waffle Apple Sunday. ","useful":0,"cool":0},"KEDuBnoWtVRgzOlh5pt9Eg":{"text":"I had the shrimp and grits ($20) and it was delicious! Good portion size and no wait. Dece","useful":0,"cool":0},"AXGxka-JNZGJTVqaJfZeuw":{"text":"This place has a nice atmosphere. The bartenders were nice and the bar was well stocked. T","useful":0,"cool":0},"hH0ZrlPF0J3ZogaO0YPz0w":{"text":"Wow.  What a great new restaurant!   We had the crawfish cakes & 3 different orders of cha","useful":2,"cool":0},"aZAugr7tgbpQ2kKEZ1P3Uw":{"text":"Loved the service at Creole House, and the food was tasty too! Great portion sizes for you","useful":0,"cool":0},"YTevHJJacHhx3Dzc_z9PRw":{"text":"Excellent place! We had Crab Cakes and Crab legs for our appetizer. Then we had Taste of t","useful":0,"cool":0},"SHd0hqMdZ7r24BFcD01FjQ":{"text":"We came across this place as my family and I were visiting New Orleans and we were taking ","useful":0,"cool":0},"cA58rLdOoNhCd0LMHxfVYQ":{"text":"Brittany & Jasmine are AWESOME! The food was terrific. The drinks were thirst quenching an","useful":0,"cool":0},"BJOGaqm4pkaQoL4bN6zmvA":{"text":"We came here because of the pics and the reviews, but the food was ok. She had the muffule","useful":0,"cool":0},"MTJkPrzz9K2o7q2JQTGJlQ":{"text":"After gambling at Harrah's for several hours, my fiancé and I decided to swing over to Cre","useful":2,"cool":0},"zb1DEorxHh74cQP6KS8KHQ":{"text":"New Orleans is a fantastic food town. You'll find it hard to find bad food at any of the r","useful":1,"cool":1},"z6U6-h9UILAXkn7aju8rFg":{"text":"This was recommended by the valet guy and was the ONLY bad meal we had.  We waited for 15 ","useful":0,"cool":0},"C-yx1QXEZxWtyfbtt2NFiA":{"text":"Oh. My. God.   The Canal St. Redfish.   Words cannot describe the flavor of this magnifice","useful":3,"cool":0},"aUPF5hPWkjjYWVk6rQkKrQ":{"text":"After trying to find a place to eat for 30 min since every thing was closed. Mind you we w","useful":0,"cool":0},"FcF_G_UEOLXj2eE24jq8qg":{"text":"The BEST dessert in the whole world- Pecan Cobbler! Ice cream on the side- get a double sc","useful":0,"cool":0},"YQL-BfDjiyzkQED0xv4vKw":{"text":"Last night me and 24 others were visiting from Houston Texas and we had Jabari as a waiter","useful":0,"cool":0},"2ZdKxGxXGgcpWRbJWpFtmw":{"text":"Fabulous food and fantastic service!  We had the Nola Bites, Mufaletta, Crawfish Etouffee,","useful":0,"cool":0},"2-wiAH47kzUjPoTjwwjUbg":{"text":"I was traveling with a party of six who wanted to taste the flavors of New Orleans.  We ju","useful":0,"cool":0},"XBMTwGCuzcOfSKDnfX7OMw":{"text":"Service by Heather and hostess at time . \nI will write about the food which was great in a","useful":0,"cool":0},"o3soyGpaKX76f1q3t29Fhw":{"text":"We came here for a team dinner during our company convention, and the service was outstand","useful":0,"cool":0},"uvwvjQuMXeL1y4Ok8WXebQ":{"text":"This place is great. Service brought us extra cherries for baby without asking. The fried ","useful":0,"cool":0},"iaGlDgeVRZz1k7_iYYgj5Q":{"text":"Absolutely out best dining experience in New Orleans.  The food was terrific,  the service","useful":0,"cool":0},"1h6056ozet-n_Y1YgjJmiw":{"text":"This restaurant happened to be empty and across the street from my hotel, so it satisfied ","useful":0,"cool":0},"xGa4uUP87GW0nFOEiVh6Qg":{"text":"Food is tasty but service really bad. They had some poor guy in charge of preparing the ch","useful":0,"cool":0},"8uLLNl2VeRcr62K_i626lw":{"text":"We had a nice time here. Great place for a group.\n\nThe restaurant handled a large group of","useful":0,"cool":0},"Ob4_odmkOHOWadw_zhg9eQ":{"text":"Excellent everything!   We were there in December.  One day during our trip we ate breakfa","useful":0,"cool":0},"CtRtsTDhFHZKeOqWuVi6oQ":{"text":"I'm in NOLA for a conference. I had dinner here tonight, sat at the bar and got to know th","useful":0,"cool":0},"YO2ZRQ1X944rmVvVaz8aDw":{"text":"From the moment I hit the door the service was on point a very friendly atmosphere. My ser","useful":0,"cool":0},"5h7AygYX8Ex1fzqVBFmYPw":{"text":"I really enjoyed the grilled oyster which has a nice smokey flavor.  Stopped in for a quic","useful":0,"cool":0},"OmbU3GHV7oSF6LZCXFN6LQ":{"text":"Our waiter Jonathan Cupid made our experience of New Orleans perfect. Regardless of the ra","useful":0,"cool":0},"DBxmFilFnw5MFkPXE36oPQ":{"text":"For my first meal in New Orleans this was absolutely awesome! My tastebuds died and went t","useful":0,"cool":0},"q0tr02jgiCpQ7QJCM0bt-A":{"text":"After checking out the long line at Ruby Slipper we were happy to find Creole.  Great regu","useful":2,"cool":1},"0K5QVNwdnAPpUN6H20mnGA":{"text":"This place is great! The po boys here are delish, the drinks even better!!!! The service i","useful":0,"cool":0},"X682kC1H8N83h-BvZ2YMxg":{"text":"This place is 6 star review for me, we went on all girls trip for Mardi Gras and it was am","useful":0,"cool":0},"-oJWZZ_8gWWu3pj--XkMbA":{"text":"Loved the crab cakes (suggest to put sauce on the side), the Étouffée was wonderful, and m","useful":0,"cool":0},"khPHluZ9gYJVqcUvqCokwQ":{"text":"Keep walking, there are better restaurants than this in every direction. Service was good ","useful":1,"cool":0},"jQlhwsri0CzIpAVtPqlCBA":{"text":"One of my favorite places I ate at in New Orleans. Had lunch and breakfast here. Bloody Ma","useful":0,"cool":0},"uHF1S-mtbfSRuWDfAF0D_A":{"text":"This place was great. The chicken gumbo was delish! Crab fingers were divine!! The crab ca","useful":0,"cool":0},"J0rheEklgHxGxwhdLMpb6Q":{"text":"Overrated! There are so many great or just average places to eat in the city don't waste y","useful":0,"cool":0},"D6UjPuJ17eSUAm7MJj4JRw":{"text":"Wait for one hour for food at lunch time around 12 pm. There is not much people in restaur","useful":2,"cool":0},"BmkjvVVTVN9fMbzzlkWLfw":{"text":"On an extended weekend trip, we made 3 stops here, we sat at the bar and had great service","useful":0,"cool":0},"exS1NUoQpeqeqQo8IzpuOw":{"text":"I've lived here in New Orleans since Katrina. It's a city of culinary delights on par with","useful":0,"cool":1},"9g9wRHJjFQo7uq8zn-AkEA":{"text":"Angel  provided excellent service. She made my first visit special. The food and bear were","useful":0,"cool":0},"l_Buxa0-YFHvNnRvFOxAww":{"text":"Fantastic... I just arrived in NO for the first time and made a stop at the Creole House f","useful":0,"cool":0},"qogbqOlqrnx7Y5vVZjljfQ":{"text":"Came for brunch. I ordered the gulf coast omelette, which is ok. Country potatoes were bel","useful":0,"cool":0},"dHHejTk3XxKVb4vIbJxXYQ":{"text":"From Houston, came here with family about 16 of us. Service was alright but my dinner was ","useful":0,"cool":2},"Yyq8El89k2zuOv4K8KJ91A":{"text":"Food here was amazing! Tried the Crawfish Etouffe,  red beans and rice,  gumbo, jumbalaya,","useful":0,"cool":0},"ExfPoH7iAWl0IYtVP8hiaw":{"text":"We were so looking forward to having breakfast here after seeing the commercial on TV and ","useful":0,"cool":0},"mgx5Qsemh0CyQmm0z3agYA":{"text":"We had gotten the spicy Nola bites, Crawfish cakes and the crab cakes and shrimp Alfredo..","useful":1,"cool":0},"c2JBlUIY2MvHCg3eQp8V0A":{"text":"Charming little place.  The food and service were good, so I recommend trying it.  Doesn't","useful":1,"cool":0},"uUkA-H6hxW1lFeiM3c_aPA":{"text":"This place needs a major adjustment the service is terrible. We called for reservations th","useful":2,"cool":0},"Jdk1g4KE7r3768_Y-ffk8A":{"text":"In town for Essence Festival and all I can say is how do service workers do it with all th","useful":0,"cool":0},"_Asfxl2g-tlAJpgteI5WWQ":{"text":"This was the best restaurant we expeienced in New Orleans! The food was delicious and supe","useful":0,"cool":0},"DDsRfNaB6qtaxCjgoOtpmA":{"text":"Stopped in here after we couldn't get poboys from killer's. We got the \"taste of Louisiana","useful":0,"cool":0},"6pUOPdBx50utJwTDiMgFEg":{"text":"First meal after checking into our hotel.  This restaurant was just around the corner from","useful":8,"cool":1},"go8Mp6pgQ8v0ey9fhTA3mw":{"text":"Everything here was really bland, not deserving of the lofty 4+ stars it currently has. Go","useful":0,"cool":0},"ZlAiWDRq-l82kQBVU4qBzQ":{"text":"Food was fresh and delicious. Prices were reasonable and in line with comparable restauran","useful":0,"cool":0},"5qfaEsS8SisOLEhDXdj-SA":{"text":"The oysters here are superb.   The bacon garlic, Texas bbq and buffalo are all on point.  ","useful":1,"cool":0},"HFui2SK2TdpPMO1TKm3HjQ":{"text":"We had dinner there since we stayed at the Marriott next door and it was raining. Their cr","useful":1,"cool":0},"zQ_NLIYiDBxBBZYvHVdVuA":{"text":"Overall a decent spot so def deserves 4 stars. My husband got the oyster Poboy. The bread ","useful":0,"cool":0},"67xNKAwuARi_0TzBPM0vYA":{"text":"I had a po' boy and wife had gumbo. Both were very very good. Service was very good and no","useful":0,"cool":0},"HkeT9smtOAuLKY4v04g9XA":{"text":"Being next door to my hotel and right in the middle of everything, having everything on th","useful":0,"cool":0},"YkrT5iSPsEqSM3gmUg3ing":{"text":"Ask for Danny, the funniest server ever! Try the crab claws the sauce is to die for!!!!!","useful":0,"cool":0},"IeV24A0kxaIY-YTXtVK_AA":{"text":"Really enjoyed my lunch at Creole House, their service just was sub-par when I dined. 4-st","useful":1,"cool":0},"DQG0mOpPDSsPH-0aIwIPBw":{"text":"Waiting forever to get our food! The redfish I ordered tastes like died one month ago and ","useful":2,"cool":0},"jCA-564N0t-V1zSgj9qItw":{"text":"Had reservations and was seated quickly. Took 10 minutes for anyone to notice we were ther","useful":0,"cool":0},"eMYwG6sFT_bcpsgX9_dHhg":{"text":"Ate brunch here this morning. They were short staffed, but managing. Bartender was friendl","useful":0,"cool":0},"sloeiA3H8bwSBPhHpN-9WQ":{"text":"Good wait staff. Food was good and reasonably priced. Nice ambiance too. I had the Bayou s","useful":0,"cool":0},"1QhJVCBOeiSxOelONQpCng":{"text":"Raw oysters were monsters and the jambalaya was the best I've ever had!  Highly recommende","useful":0,"cool":0},"EFq3gxhfcPe5IaBuiCNRXQ":{"text":"We ordered a basic breakfast and we did not enjoy it. Add to that the service was painfull","useful":0,"cool":0},"Urm9vCMV8K6rThrFzsT20g":{"text":"I don't like giving bad reviews but i have to mention that our experience here wasn't grea","useful":0,"cool":0},"kW9q-jmbf-WEGlWlEZ5PGw":{"text":"We are in New Orleans celebrating my daughters birthday and this was our first stop for di","useful":0,"cool":0},"oWn7Yldu_XCLnLw1Y9HtDw":{"text":"Good food had the  shrimp platter. Frys were cold but everything else was good. Lots of sh","useful":0,"cool":0},"x-SJNW8LaZhMhm8bYAmibw":{"text":"Searching for a place suitable for children and close to the Quarter, we walked into the C","useful":0,"cool":0},"ARNgNjpW0_PVd-xMxYnbwg":{"text":"Very good food with even better service. Johnathon our waiter was the sweetest and provide","useful":0,"cool":0},"F8T18U0lK_5SQn1RQZYa1A":{"text":"We stopped in for dinner last night. I would say creole house is definitely generous on po","useful":0,"cool":0},"ttd71Hk7Cm2hWgRnKns55Q":{"text":"Our waiter, TJ was great. The roast beef po boy was fantastic, the crawfish etouffee was v","useful":0,"cool":0},"FqmV_uqCneeqTf1cOLQ5hg":{"text":"This was a definite 'party in your mouth' experience! I looked this place up on Yelp, read","useful":0,"cool":0},"XNkiiPlV6tW3rrA9H1Jd1A":{"text":"Service was mediocre... Food wasn't good... Was totally disappointed. I only enjoyed my co","useful":0,"cool":0},"8_Hg0KjB43lqpxI2bEfaIQ":{"text":"This is our last night in town and we wanted to go to a nice dinner. After reviewing what'","useful":2,"cool":0},"Poh1kV0VmSd6TNC3E5A0DA":{"text":"The food was a great introduction to the city.  Not overly seasoned and could have been a ","useful":0,"cool":0},"B48pjgOMgZcSrO9Advmnpg":{"text":"Upon arriving we noticed they had a pet skunk which we should have taken as an omen for ho","useful":0,"cool":0},"e8pfxsPU_B-VY52ANQC7Pw":{"text":"Wonderful flavors and very attentive wait staff! Food was delivered quickly. Will definite","useful":0,"cool":0},"WK63JAOFYO36Sg-Lwv4VLw":{"text":"Had 3 appetizers with my wife, & a Sazerac.   Great service, very helpful & outgoing waite","useful":0,"cool":0},"WrPrxj2DkJucVM8cO2bzfw":{"text":"We had such a great brunch here! Food was excellent and our server was the nicest guy we'v","useful":0,"cool":0},"hBFuUmza0-0Pyg48T-jxUg":{"text":"Ordered takeout from here since they weren't pet friendly... I got the \"taste of the bayou","useful":0,"cool":0},"spzT2DdTYlsiVAOvxYQirQ":{"text":"Yummy yummy oysters.  Got a PoBoy fried fish, yummy , they give you three pieces of huge f","useful":0,"cool":0},"IDlHc2dBbswZ802RhlIG1Q":{"text":"Pleased with the food and service. The good thing is they are such a large restaurant that","useful":0,"cool":0},"0UfWgViA-9wZ97B8s_mrTA":{"text":"Terrible experience... Probably just a bad waiter, but the experience was horrible! Here f","useful":0,"cool":0},"Bqf6XkrbBZCZ5ud04K2HWw":{"text":"Had dinner here for the first time in about 2 years. Great food and great service. Food is","useful":0,"cool":0},"0jmS0536z9-gNWkba2EBXw":{"text":"Visited during Mardi Gras 2018 and the jambalaya was AMAZING!!! I definitely recommend thi","useful":1,"cool":0},"JGFA2y5WMKuORaQAW_AIzw":{"text":"Just stopped by to cool down from heat. I had a beer, some fresh oysters. Good service, go","useful":1,"cool":0},"gxzGh8n92DxO-ktkPUUlkg":{"text":"Really cool vibes. The building itself is beautiful. The food is authentic and good and I ","useful":1,"cool":0},"jFB1s32Kz5sNbdhmzMmajw":{"text":"I really wasn't impressed... We missed the breakfast by minutes. So we ordered po boy shri","useful":0,"cool":0},"qYgdLvYXD6MLd-mITQUq6Q":{"text":"Right on Canal street it's crazy busy.  Food is good, try the alligator bits as an appetiz","useful":0,"cool":0},"-NStOkJrXpggC9_0rVaiGA":{"text":"Long time New Orleans visitor, first time to Creole House. After our experience, I'm sad t","useful":1,"cool":1},"so4Gsy3LEUI2waMRKyoMlA":{"text":"The Cannel Street Redfish was amazing!  We are only in New Orleans for the week but we wil","useful":0,"cool":0},"VBF9SdEEzRBYnNXO_3N_WA":{"text":"Awesome service and food was great. The strawberry shortcake dessert was to kill for. I ha","useful":0,"cool":0},"RDcYaUXIA54S0DKXADjTZw":{"text":"I was really excited to try this place , I saw it walking down canal street and planned to","useful":2,"cool":1},"iYuoIDtFBDCvYwNtaYQExg":{"text":"Creole House, you are on my list of MUST RETURN when in NOLA.\n\nAppetizers:\nCrawfish Cakes:","useful":0,"cool":0},"zW63ZuoDwGT9RxeKgg18cg":{"text":"We started off with an appetizer of crawfish bites which were tasty. For dinner we ordered","useful":1,"cool":0},"j0nMbrxfGGfcJAOFeJzD1g":{"text":"Had high hopes for this place going into it but from the appetizer we were disappointed. F","useful":0,"cool":0},"MYvIlpMJfdPg9_nOwbGz3g":{"text":"Adorable vintage looking place. Our server was charismatic and friendly. We ordered the St","useful":0,"cool":0},"vFA6GzfTQ4Ms1N2QrnnNjQ":{"text":"I had lunch here yesterday and today. Both times, I was pleased with my meals as well as t","useful":0,"cool":0},"hv8TmragKzS2VWbC0vBSBg":{"text":"Needed to wait, which is fine but outside in 90 degree heat with no water for 20 minutes. ","useful":0,"cool":0},"vuEV2eW7gr-_JsZN0Iawzw":{"text":"I had the shrimp and grits and it was amazing. The service was excellent and the prices we","useful":1,"cool":0},"VZJCjieOvZmZsy3vgovmkg":{"text":"Went for dinner on a Wednesday and it was fairly busy, considering it was the middle of th","useful":0,"cool":0},"dVvoSIxHbKxr9iyVll0IuQ":{"text":"Found this place by doing a yelp search. Had pretty good reviews. Were in town for a confe","useful":0,"cool":0},"edua01_dcVpBn77Ka5zP5w":{"text":"Ate here for dinner last night. Place was packed so sat at the bar- the bartender was frie","useful":0,"cool":0},"vjz4D_biGu52PwgS1KfWmg":{"text":"One my favorite breakfast/brunch spots in NOLA. Seafood Benedict this time, awesome pancak","useful":0,"cool":0},"sEiEVHrw2hRTE0pJAmV61w":{"text":"Cute little restaurant. Staff is more than friendly and so polite and nice. Service was ul","useful":2,"cool":1},"JHOjB7Qh4xt_TvRnGMUakg":{"text":"The Bacon garlic Ousters were amazing, careful they come out HOT!  If you want oysters tha","useful":1,"cool":0},"FPELzgZW_TZpBr0QXa2zng":{"text":"This place sucked.. double charged me, and gave super small proportion sizes, and didn't h","useful":0,"cool":0},"A98Qnc25kQWTxfuOry-pZg":{"text":"This place sucks.  Service was horrible.  Took 20 minutes for our table to even see a wait","useful":0,"cool":0},"532dKdWC5YRmCRKog7H03A":{"text":"I ordered a Caesar salad with shrimps and the shrimps tasted terrible, just like some chea","useful":0,"cool":0},"m5GCkiyYV0QlxSHK6qNyYg":{"text":"Great staff , great food....what more can you ask for! The crab claws appetizer is a MUSTT","useful":0,"cool":0},"NkZxqFxNgh3O6GdLU1mvMg":{"text":"The old dude bartender was spot on with his recommendations of gator tail and raw oysters ","useful":0,"cool":0},"9IpzfIPMQyZ1koSa8j15Tg":{"text":"Coming from the North aka Chicago, 312/815; this is PHENOMENAL, the service--everyone is f","useful":0,"cool":0},"75UKiguBQCyG2uRujCXwAw":{"text":"Great food, service, and atmosphere. I enjoyed the crab claws and a local IPA. Open late a","useful":0,"cool":0},"5cEhYJfipJLRqkcbjl8RGA":{"text":"The Creole House was our first stop in NOLA. I has the shrimp fettuccini with a crab cake,","useful":0,"cool":0},"s5ZSWoEaBAlc1YiXL1KODg":{"text":"The food was great but it is overpriced. The server wasn't that friendly and did nothing w","useful":0,"cool":0},"epPsehzSQEkD5WiRxQQjMw":{"text":"Excellent service and food.  The oysters are to die for, and the crawfish poboy hits the s","useful":2,"cool":1},"FLSJScgtBSN_NpMzRMD18w":{"text":"Wonderful dining experience!  The NOLA bites were  great!  The fish and oyster platter wer","useful":0,"cool":0},"St8rDn0jFgVPmwkWQMiCBw":{"text":"Omg ! We were starving after walking the quarter for hours and stumbled upon this place . ","useful":0,"cool":0},"gXBtXw8V9rMxftasVgm2Gg":{"text":"Great live jazz music. My girlfriend and I decided to spoil ourselves and we got the big l","useful":0,"cool":0},"mIpz--nC3gSVv6vRskiRPw":{"text":"Food here was amazinggggggg!!! The shrimp yay yay was so good I could've eaten it more tha","useful":0,"cool":0},"nWQH8zk6r7TaCUenlML69g":{"text":"The food was good. I had the canal street redfish and the seasoning was awesome. For appet","useful":0,"cool":0},"b9auVajlXk-oS2GjpzEocw":{"text":"First time visitor. Thoroughly impressed with food and service. I got the fish platter whi","useful":0,"cool":0},"fi65PEcQACoe561rTdjaXA":{"text":"Hate to give bad review but this place was sooooo over priced...I got two silver dollar cr","useful":0,"cool":0},"V7qB0udtcqoGw9JvwJ7S7A":{"text":"best oysters I've ever had, but hey, I'm from Ohio. Boudin was awesome. The best dinner I ","useful":0,"cool":0},"-jL2MAAhAUCypSY8YH-SuA":{"text":"Nothing special. Eggs were not prepared as requested, biscuit was dry. Service was fine. $","useful":0,"cool":0},"vS3TEinGzQR6DiL1Lg-zQA":{"text":"Came here twice, once for breakfast then later that day for dinner.\n\nMy breakfast was deli","useful":0,"cool":0},"Mvh3TNtbY0vA4aulwwUWTw":{"text":"One of the absolute best experiences I've had in Nawlin's. The wait staff are absolutely a","useful":0,"cool":0},"i-BY0b-CDQ3L8uBbT47cDg":{"text":"Poor management & poor service. I would never eat here again. I think the best think was t","useful":2,"cool":0},"iGGwhkEdTJHymy5xIjWfZA":{"text":"The food was absolutely incredible, and the service was very good as well.  The oysters Be","useful":0,"cool":0},"6HEwmryjZctcZiFPuCzRBQ":{"text":"Food was fantastic!  Sat outside along canal street and enjoyed the scenery. The culture i","useful":0,"cool":0},"fSYPPWEsXhaYRzlue8y7eg":{"text":"Shrimp Ya Ya, alligator po boy, blackened chicken Cajun alfredo, jumbalya - this place is ","useful":0,"cool":0},"hoJc0Ys3JDvEIj5eYImEiA":{"text":"Maybe it was because we were there at 4:00, but the food was mediocre, at best. I had the ","useful":0,"cool":0},"r77WiGn0CoNOuLjq3INrvg":{"text":"We came in on a Thursday at around 11 AM. Business was slow and we were 1 of 6 or so table","useful":2,"cool":0},"6lTTIbqRfk6pjlZAIVcEOA":{"text":"My husband and I went while visiting New Orleans. We had the crab cakes for an appetizer a","useful":0,"cool":0},"R4M-GznjKJrMIIqLeDGxrQ":{"text":"This was the best breakfast ever in NOLO, waiter/singer was exceptional, thank you Johnath","useful":0,"cool":0},"4y8ax2HyIeGvYGHGMbvTFg":{"text":"My Mom and I stopped in for a quick bite to eat while wandering around the city. We got th","useful":0,"cool":0},"GdR82P3JOmIk6yTSfAxhbA":{"text":"We came to this place because the pictures and the menu looked amazing. We did not get let","useful":0,"cool":0},"--Gdv6LOoo7UtL6_A5iiiQ":{"text":"This place was fantastic. We were wandering around the French Quarter and stopped in for a","useful":3,"cool":0},"hQ6wrrIs3vNB2qrbKp1Ypg":{"text":"The service is good.  My jambalaya was cold, salty, and disappointing.  It was the least i","useful":0,"cool":0},"QskhqpuiwvQr60ZAi591VA":{"text":"Had lunch here Tuesday and it was excellent. We started out with oysters in the half shell","useful":0,"cool":0},"LQTHUNJFejPEGzSGV7wHQA":{"text":"The reviews did not disappoint. The chargrilled oysters were the BEST!!!! Shrimp po boy fr","useful":1,"cool":0},"xvSzUDaO-XeAZXrXJSIEtw":{"text":"I had the taste of the bayou. I liked the red beans and rice, but didn't care for the jamb","useful":0,"cool":0},"t43t-k_4d6uXMCdLMF2n2Q":{"text":"The food was incredible. I Love soul food so I have high expectations of grits. The grits ","useful":0,"cool":0},"4nPYyMCd_vuk2YkZXC7PBQ":{"text":"I tried this place because it was the closest restaurant to my hotel. Ordered a Bloody Mar","useful":0,"cool":0},"3nMSG1wMx1FyU-JyiIN5vw":{"text":"Our first stop for dinner on our Honeymoon. Drinks were incredible, many different options","useful":0,"cool":0},"1znRVquPiUafV4H9g0Uanw":{"text":"Not good. Cold food, dishes not seasoned well. Mediocre, would not be back. Annoyed with Y","useful":0,"cool":0},"p-Q-qrjqK1J7Xi6pd0KcJQ":{"text":"While walking around NOLA I kept walking by this place and decided to try it for breakfast","useful":0,"cool":0},"CcvDQZyvTV1Lcm1hmd8WuA":{"text":"Service was amazing. Forgive me, I don't remember his name but I'll never forget how kind,","useful":0,"cool":0},"AABuYcFLYA3kWO2WvapJ3w":{"text":"We enjoyed this for our date night. I had the jambalaya pasta (excellent) and my husband h","useful":0,"cool":0},"gM9-5djMVZyHjEqfhWHWvg":{"text":"I visited this creole seafood house for lunch. It is a casual atmosphere. The food was ave","useful":0,"cool":0},"jNg5lfhWL7vGYfyan9hC-Q":{"text":"went in for breakfast..AMAZING..the Louisiana Benedict with oysters was so good and the cr","useful":0,"cool":0},"FBifK9q4q1kZfLp-8p5OpA":{"text":"Great food, great location. The sampler was genius all of my New Orleans favorites at once","useful":0,"cool":0},"jNJiwNgs6DkH5cUYsHn67w":{"text":"The BEST shrimp and grits I have ever had. Really good service and the price was right on ","useful":0,"cool":0},"X3F_7nM99TIyKfBMeKlX5g":{"text":"Had dinner there last nite. Not cooked to order. Jambalaya was nasty. Cajon chicken dry an","useful":0,"cool":0},"_pkEPAJiyokBX1zlvubK0g":{"text":"This place had the best fried shrimp po-boy in the quarter. Perfectly seasoned batter, fri","useful":0,"cool":0},"6nPhVg64U2wG3zsMAjqeew":{"text":"We had the fried alligator and oysters as our appetizer they were delicious!!! Recommend t","useful":0,"cool":0},"Z24Y5ogyyaZNzD9WcKdqXg":{"text":"Bayou bowl for breakfast was amazing. \nThe place is crowded during the weekends, so better","useful":0,"cool":0},"LghVyrhQgPa6FV6kSMXwrQ":{"text":"Came here based on reviews, and we were extremely disappointed. Service was slow and I thi","useful":0,"cool":0},"kjjWMH7-kVFGTBAKz-jKAw":{"text":"Very slow service. Waiting forever for what was supposed to be a quick lunch.  Just a simp","useful":1,"cool":0},"8-cv3Tj6boJsZQENXxUZ8Q":{"text":"Hard to believe that we were able to enjoy such good food on Canal Street just across from","useful":0,"cool":0},"XK0nREl9jeVTi_AmnC_YCQ":{"text":"So good we came here twice!!! The food was beyond delicious!!! We ordered alligator bites ","useful":0,"cool":0},"Ed6_Kr9uEQERIscbc0iDRA":{"text":"We came here while walking around Canal Street and tried it based on the positive reviews.","useful":0,"cool":0},"k5BdUDIUXDhQVbU0yxPilQ":{"text":"Unreal food and great service. Busiest weekend of the year and haven't had to wait for a t","useful":0,"cool":0},"NXlIU43525182wuxV_KWOA":{"text":"Food was fabulous and the service was even better...be sure to ask for Paula's table!  Shr","useful":0,"cool":0},"jDf1mpN2oBZfEiZ8vVpbbw":{"text":"I saw the reviews on Yelp and so I recommended that me and my friends try it out. Very clo","useful":1,"cool":0},"zV0R_UkZOuGbP9AQmoYKNg":{"text":"The service was excellent. But the food was far from 4 stars. We all had meals with pasta ","useful":0,"cool":0},"q5SCkUfdL_np_bbaeoM3jg":{"text":"Creole House is a compromise between everyone in my family's desire to try Creole food whi","useful":9,"cool":9},"yZgaN6w9j8Z_aJp0bzDV-w":{"text":"Wooowwwwe I love the food here! I got a chance today to dine in and I came during lunch ti","useful":0,"cool":1},"oUIqtnWLlSe_M-JqCoYT3g":{"text":"Yes! Everything was scrumptious ! We enjoyed it all and will be revisiting on our next tri","useful":0,"cool":0},"8lK7wVJ0SnjWZQz5Nk09Qg":{"text":"We went on a Sunday night and were seated right away. It was not too busy, just right. I h","useful":1,"cool":0},"e56nKjojgK15-n_jdB58JQ":{"text":"Best shrimp and grits ever!!!! Bacon and Chargrilled oyster were very good. Service was su","useful":0,"cool":0},"99GQmFPfqTvhDLxNzbmQqA":{"text":"Five stars based just on the bloody mary's!!! The infused vodka was so delish, with fun ga","useful":1,"cool":1},"53u9N58sUudHJRl3ZyGGRA":{"text":"Tasty find on Canal street.  Our waiter was very attentive and checked on us constantly.\n\n","useful":2,"cool":0},"Cmm6UiZ93ARhrYs0v9A9zw":{"text":"We came here for breakfast for the first time today after many trips to NOLA and various b","useful":0,"cool":0},"FuXat7i0XUH2Bt3-Sw94Jg":{"text":"Had breakfast here and ordered the Eggs Benedict with avocado and tomato and no sauce. The","useful":0,"cool":0},"dmPcYNXV2RZ_o9iifJbVdA":{"text":"Omg! I totally love this place. Service was outstanding and the food was beyond delicious.","useful":0,"cool":0},"LpZeZr0LcUfzVXnD3RICJQ":{"text":"Came to Nola for a day trip and decided to come here for lunch. I got the taste of the bay","useful":1,"cool":0},"GlspzRLgAnBSCLM610xLPw":{"text":"I really wanted to like this place. It was only a block from the hotel we were in, always ","useful":0,"cool":0},"_AKE_6Hjtm-6BQmT9ln5fA":{"text":"We were in NOLA for only one night, and decided to stop in the Creole House for dinner.  W","useful":1,"cool":1},"Yk5vPDYHQqYjZExCj-Kbuw":{"text":"The most amazing crab claw sauce. You could put this sauce on anything! It's to die for. A","useful":0,"cool":0},"mx-TS2PRPRv1PFbDwACwxw":{"text":"Terrible food.  Ordered the alligator po boy and it was tough and chewy.  The large roll i","useful":0,"cool":0},"B02BoW-7Nl53Q_IYOBSxxA":{"text":"Great atmosphere and yummy yummy food!  Located right next to the Marriott on Canal and lo","useful":0,"cool":0},"iXOxYH7OsGJldv5JdVcpQw":{"text":"Arrived at the Marriott late and this place is next door. Waited more than 5 mins before s","useful":0,"cool":0},"J3G8ihL5tBXjjM78rhKR6g":{"text":"I got the bayou bowl here and it was really good. Great food for if you're hungover. Howev","useful":0,"cool":0},"cpKqB3xB8Hb8nHU3no3TZg":{"text":"Enjoyed my first taste of New Orleans. I had chicken and Andouille sausage gumbo and split","useful":0,"cool":0},"restx2GjJM1w1k4OGlR0zA":{"text":"Came here on recommendation from hotel. We are traveling with 2 kids and wanted something ","useful":0,"cool":0},"H-AZ5RXXFGL0rUz3OU3Mvg":{"text":"Service was great and the staff was friendly and accommodating. You have got to try the Ya","useful":0,"cool":1},"b6O444CnWheohBcqkNsG6g":{"text":"Fantastic food! The crayfish cakes were near perfection. I tried shrimp and grits for the ","useful":0,"cool":0},"t28vBCFuNZOWdYwe_m6CfQ":{"text":"The service here was amazing. I wasn't sure what I wanted to eat, plus my friend had aller","useful":0,"cool":0},"QxvEcpowLemmkwyfoTCLZg":{"text":"Okay now if your looking for some amazing food and good ppl. Go to the Creole house. I did","useful":0,"cool":0},"lLmDx9bJL5cOZ1LCycWRKg":{"text":"Just, no. In a town with so much amazingly delicious food, why would you eat here? Our foo","useful":0,"cool":0},"nWhXyTAgabrLUNTV0nqTqA":{"text":"Thank you so much Creole House. We can't say enough about how wonderful our visit was. But","useful":0,"cool":0},"-aK5Zsfxj6Udw7kOtsaivQ":{"text":"Yummy. Our server was very friendly and able to provide recommendations. \n\nMy friend and I","useful":0,"cool":0},"brxYfgNbjF-_79t1pg4ybg":{"text":"Service was great, drink was really good. Only ordered Oysters & was too scared to try em ","useful":0,"cool":0},"gAhUuFVIO4b94MHSay6KYQ":{"text":"I've been in New Orleans for two days now and this place has been the only place I have be","useful":0,"cool":0},"cjt75XyCfSQgu6lHQcL-oQ":{"text":"We went here for brunch, my husband had the crawfish po boy, it was good and what you woul","useful":0,"cool":0},"WhC0z4ly85sLgmyMtfcb8Q":{"text":"Visited during Mardi Gras. Decent po boy, friendly service and great location to catch the","useful":0,"cool":0},"vIuEGv63HXJvQu7pDkiDNw":{"text":"Two thumbs up!! I ordered the Jambalaya Rice and it was amazing. Shrimp and grits were som","useful":0,"cool":0},"yTrdbv2zff8pQlLCbbvnkA":{"text":"Fettuccini was so so, not hot and the shrimp was very salty but the waiter was amazing!  A","useful":0,"cool":0},"-WRUz2rtAvClyhSL84jrNQ":{"text":"Amazing food . Everything I ordered was amazing. My waiter John was outstanding . The serv","useful":0,"cool":0},"TosPWZOBU1_9J-xTOk-D9A":{"text":"Solid restaurant with good variety of food options. Nice atmosphere with classic New Orlea","useful":0,"cool":0},"HOBHyAvTOuqQx6gU2IPDcg":{"text":"With the exception of calamari ( fryer oil needed to be cleaned out) everything was great.","useful":0,"cool":0},"z3GQlhwuGBkumbykFqe8Dg":{"text":"OK, I'm not gonna lie - I read the Yelp reviews and I waffled on whether or not to go to t","useful":0,"cool":0},"0NgGILlEf-4k_0bkonVHMQ":{"text":"This was awesome!! Grilled Oysters and shrimp PoBoy was on point. Pete the bartender was a","useful":0,"cool":0},"tMgF3ay1QUiCKkkM0pJBZA":{"text":"First time here and had a wonderful waitress named Paula. Everyone was super friendly and ","useful":0,"cool":0},"tlGIQWxYhidVQNWH3PQ0xg":{"text":"This place has an upbeat and classy atmosphere. The waiters/waitresses are very attentive ","useful":0,"cool":0},"2jPShjjVuOq06cMZ_A-00A":{"text":"I had the blackened fish & it was salty. My veggies were cold & unseasoned. Waiter was nic","useful":0,"cool":0},"IQ0Dga0pqwM_G2Dd_S-PVg":{"text":"everything was delicious. The crab claws, oysters, shrimp and grits. Even the drinks were ","useful":0,"cool":0},"WJ8CnYSCIAUFujjp-tl7Kw":{"text":"This restaurant offers a wide variety of local fare, but the outcomes are unremarkable. Th","useful":0,"cool":0},"Vf2LaT9eKP_cP5cJ7hGd5Q":{"text":"We opted to go here for dinner, primarily because of the good yelp reviews.  I was disappo","useful":0,"cool":0},"PIgggGwNbTGnHFLGlOHmyA":{"text":"Appetizer: alligator. Delicious. Drinks, blow jobs and strawberry margarita and bombay for","useful":0,"cool":0},"T1vDwsQ9-ar9Y1dZAZgn2Q":{"text":"Staying at the Marriott and this place is right next door. Clean and casual atmosphere, gr","useful":0,"cool":0},"MDs7l1_fgTW9m0qkv2DpQA":{"text":"The food and service are excellent.  Worth the stop.  Go hungry!  The wait staff is a litt","useful":0,"cool":0},"gsOJAVP-IDqW3VGU-r9Z3g":{"text":"Second time here and just as good, if not better. The food is so freaking good. We were re","useful":2,"cool":1},"5IFhfAo_kRNxkIUClxXf8A":{"text":"Would not recommend this place. Had lunch yesterday - everything was salty and didn't tast","useful":0,"cool":0},"FqVLBoK3d1AAV2SLTK0Oeg":{"text":"Greeted with a smile at the door, a smile at the bar, and a smile when I left. Very friend","useful":0,"cool":0},"NuQasgAMXeuESFjY71VIkg":{"text":"I was with a group of 9 people. We got there & the hostess told us there was no wait. We t","useful":0,"cool":0},"ZGJPiDLC9Je2E4p6PgZimA":{"text":"Over all good. The staff is friendly and polite. We came on a day it was raining around 10","useful":0,"cool":0},"EHfk0jBSYgBmrSSrs_qNZw":{"text":"This is my favourite new Orleans spot for an awesome Cajun  Creole dinner . What a wonderf","useful":1,"cool":0},"HmKCyhiGk6C5V73z_AuBBA":{"text":"The food is delicious and the service even better. The servers are personable and make you","useful":0,"cool":0},"C6Y-Sdiy2SwMd-TeXyc8Ag":{"text":"Had the shrimp po boy. Bread was stale, shrimp were not cleaned and sauce was too spicy to","useful":0,"cool":0},"3VR5VVegc5dUbiJaneCCYg":{"text":"We landed here this morning on accident since the Ruby Slipper's line was too long for my ","useful":0,"cool":0},"KuDCllItmGOF6DhaYnEyZA":{"text":"I ate appetizers for dinner so I can't comment on any of the dishes! I got the bacon charg","useful":0,"cool":0},"ie0lior8LaTyPE7HDWvLwg":{"text":"This place is amazing!! Best food I've had (so far) in NOLA. Went for breakfast one mornin","useful":0,"cool":0},"KMS1tsyXOduCLfr1sm_v4Q":{"text":"The creole house has the best wait staff. Our server was very attentive and made excellent","useful":0,"cool":0},"ljoD7A3nLT68f7qODjcikg":{"text":"I'm soooo happy I found this spot on Yelp!  My boyfriend can't eat shellfish and is severl","useful":0,"cool":0},"-YTDtG_vfNCq86ND7Ls8SA":{"text":"We ordered the fish platter w/hush puppies, fried chicken wings, blacken fish w/veggies & ","useful":0,"cool":0},"Gitpi0w9o1BJUPEZGGHcaQ":{"text":"one dish you must have... the bread pudding.  mic drop ... period.  the sauce.. wow!!!","useful":0,"cool":0},"4JTHikM_NV5TAmalNsTyTQ":{"text":"Don't let the outside confuse you... Inside is so nice, get food and wonderful staff.","useful":0,"cool":0},"UDLi1GfaEbONoxiMvLvJGQ":{"text":"Had the catfish Po'boy and it was fantastic. The wife had the blackened red fish and it wa","useful":0,"cool":0},"JXGM3KwoouWXGETSZr9sZg":{"text":"While we were walking down Canal Street we were looking for somewhere cool to come eat wit","useful":0,"cool":0},"QOL6Jr0wAJZijf9GcLAsZg":{"text":"We were trying to figure out where to eat and found this little gem. At first, we were wor","useful":2,"cool":0},"5petQa6a6F37nBJXVhF6Zg":{"text":"I am from out town came here with work, my first night I ate here, had the oysters with ga","useful":0,"cool":0},"ImdSfRKugIG5wbJC1J0Jnw":{"text":"Food was great! And abundant! Service was a tad slow, but we went about 30 minutes before ","useful":0,"cool":0},"mtOuALXjclGJ8w6IlsEbUg":{"text":"Ate a late lunch!! We were promptly seated and the food was delicious!  Service was also g","useful":0,"cool":0},"0BAsRvgK4SrUmfrb7Okc6A":{"text":"We had the boudin which came with a delicious creole mustard sauce... Which a true souther","useful":0,"cool":0},"-27_ZX4V29TXIeImt6qxvg":{"text":"We had fantastic service here and enjoyed the food quite a bit too, even if it was a bit o","useful":0,"cool":0},"a2C2U8ZjzWBk9C_jGW7nfg":{"text":"The crab cakes and shrimp ya ya are amazing! The food was fast and the service was great. ","useful":0,"cool":0},"J1VeFA33TOOVVCOlFndRaw":{"text":"I really enjoyed my meal at the bar. Very friendly bartender made good conversation. Nice ","useful":0,"cool":0},"ruRMROH5qJQXUXMG0Yop8A":{"text":"Love this place.  For us the best restaurant in New Orleans.  Waitresses was excellent.  F","useful":0,"cool":0},"L-nWmDvXRBrNXhvoQYPAHA":{"text":"The food is delicious . But they serve you like a kindergardener lunch Not enough for your","useful":0,"cool":0},"F0bDqttzyPKTT_weg2j_uw":{"text":"Very convenient if you're staying at the Sheraton or Marriott hotels on Canal street, othe","useful":6,"cool":4},"5EaEUhO_yAsInCU3DH--uw":{"text":"The restaurant was right outside our hotel and a great start to our New Orleans trip. We s","useful":0,"cool":0},"zcRbFmqJUOy-lC9Uo3ZPIA":{"text":"I hate to do it, but I gotta give this place three stars.\n\nEverything started off smoothly","useful":12,"cool":6},"j8X7KvLFfnTWfaM2A1RyfA":{"text":"Our food was very good.  I had the traditional shrimp po. boy. Our service was ok but not ","useful":0,"cool":0},"-lzP5XwFacLH-akTVOSD4A":{"text":"Just ok.  Offers local dishes like boudin and crawfish ettoufe  (spell check?) but at a su","useful":0,"cool":0},"HjhpvG38tOg4fcn3Jr_jLA":{"text":"This was probably our best meal in New Orleans. I had the crawfish ettoufee and my wife ha","useful":2,"cool":0},"gmFx0yS5XtsQUemRR5-m0w":{"text":"This is our first time in New Orleans. We had dinner at Creole House Restaurant. The food ","useful":0,"cool":0},"OmDQoip7Qo4mahFS1nvbOQ":{"text":"I really want to give this place more stars! Staff was great, but the food.... Went here f","useful":0,"cool":0},"bdx0AGMtRnfa9HLnRmQHew":{"text":"Man that food was incredible stuff to say unbelievable jambalaya and gumbo we really reall","useful":0,"cool":0},"IAwEnSCoMAKWGO3zzjujPw":{"text":"Well it would have been a 5 star review but the service here sucks.  We waited at our tabl","useful":0,"cool":0},"aQYawldy8w93fvgPr3VScg":{"text":"Wow this place is Creole? Crab cakes ... Soggy and very bland ... Shrimp and fettuccini bl","useful":0,"cool":0},"d357UO36lB6UlsMRhg2XcQ":{"text":"This place has great ambience and great food BUT it took a damn hour for the food to get h","useful":0,"cool":0},"HxQ2rRh8RhP-nuwyyDKu0A":{"text":"Was looking for a place that served jambalaya and found this place on Yelp.  \n\nWe had the ","useful":0,"cool":0},"BqJuQeiObSv5w7BpmEN2Cw":{"text":"This place made my last night in New Orleans a memory I won't forget. From the time I land","useful":0,"cool":0},"6mxWoXEsHgyS2ZkpKauSSw":{"text":"Delicious food and courteous staff. Food could come out faster, but that's a minor issue.","useful":1,"cool":1},"8kPViATpfZHGdziFa3qwYg":{"text":"This place gives you a very chill, dinner like vibe but it was everything I needed. The st","useful":0,"cool":0},"S4lmvc0wqwNUUD6Z15Bv0Q":{"text":"Everything was delicious and service was great! Loved raw oysters, bacon garlic oysters, c","useful":0,"cool":0},"6t3PcXjIIuV4yaz_t90gxQ":{"text":"Excellent!!  We stopped in for lunch....the oysters are A. M. A. Z. I. N. G.!  Had the cha","useful":0,"cool":0},"BEJzd-QEOGSMjwfpI0XUXQ":{"text":"I went there night with my mom for dinner. They are very good and not to expensive. Servic","useful":0,"cool":0},"rKuhXpBwiMy37jXAuQeC5g":{"text":"We came for brunch. It was adequately priced and there were a wide variety of offerings. F","useful":0,"cool":0},"RYO5C05lBGe2elvfIT8NWA":{"text":"Stopped in because this place is right across the street from my hotel.  Nice and clean in","useful":0,"cool":0},"KbQS6nMoKJ0lwT3Stor33g":{"text":"Awesome restaurant,food and waiting staff but absolutely useless and pathetic host. Me and","useful":0,"cool":0},"KpvQyDpAGNSc2oqmIlhDGQ":{"text":"Well being that my friend and I were spontaneous about going to New Orleans; let me tell y","useful":0,"cool":0},"QGrx6DUttVAOpApH6P1SdQ":{"text":"Best  oysters I have ever had. Super awesome customer service. Love Aaron best service I h","useful":1,"cool":1},"8E9kMVh8bRC06iAi2HLFQA":{"text":"Walked by this spot and the interior grabbed my attention. Old school but definitely well ","useful":1,"cool":0},"6wUsoDHhxmF_xOS5TZ2eDQ":{"text":"Conveniently located just blocks away from the French Quarters and JW Marriott hotel!  Thi","useful":0,"cool":0},"ThjdWGl7jF4ovxXUjv8x9g":{"text":"Nice restaurant with a lot of available seating, which is needed for the area. The food is","useful":0,"cool":0},"XqMHwnjI51Y0aHfHXT5o0g":{"text":"It was what you'd expect. Somewhat of a tourist trap, priced to be so, but decent good, an","useful":0,"cool":0},"RUuSdZPm2o863D7w32lHgg":{"text":"This pink place was on the corner and easy to get to from where we was at the other end of","useful":0,"cool":0},"55H7O9IGuxXVwKicN12gnA":{"text":"Stopped in for a happy hour bite. 1/2 priced apps ann $1 broiled oysters. What a deal. Bar","useful":0,"cool":0},"L32M-j6quSY9EQsCPTzVSA":{"text":"This place was just OK for me in comparison to some of the other amazing meals we had in N","useful":0,"cool":0},"4aX_PIgoCMVxbE8jAMHn5A":{"text":"This restaurant was good. Our waitress was really nice! The food was tasty! Sat immediatel","useful":0,"cool":0},"cXHf5lIn3n1b4jF0LUytYQ":{"text":"Jason was our server, great and friendly guy! The food was beyond our expectations and the","useful":0,"cool":0},"cg0TNROOXPdyp_iw-tnAOQ":{"text":"This place was really nice and the food was delicious. I had the chicken jambalaya but I w","useful":0,"cool":0},"5q5nYVbp4hjnlwYx9miBdQ":{"text":"This was my last stop leaving New Orleans.  The food and the atmosphere were both good.  T","useful":0,"cool":0},"PSxWOLUWQYEGGMvjCAYuwA":{"text":"Don't be hesitant because it's in a touristy spot. You could probably find a cheaper meal ","useful":0,"cool":0},"4_u0sQrMlXX-i5zpOX-0hQ":{"text":"Tasty find on Canal street.  Our waiter was very attentive and checked on us constantly.\n\n","useful":1,"cool":0},"HeQRgenYzlpBbmb8blMdIg":{"text":"First time for alligator bites~yummy! Oysters amazing, simply delicious, coming back befor","useful":0,"cool":0},"H9RdAv4rI9ltXPuNnXjEOA":{"text":"Dinner: The Nola bites appetizer had the right amount of crunch and heat. The hurricane co","useful":0,"cool":0},"_9VMDNCre2k8uYQkPKayKQ":{"text":"This place had the shortest line on a Saturday night without a reservation so my boyfriend","useful":2,"cool":2},"x8iaYrg5ZMypZaoqEVbtoQ":{"text":"Biggest raw oysters I've gotten served in awhile. So yummy. \n\nWe were on the way back to t","useful":0,"cool":0},"-uA9hn7VbCSbKwY52ut5ig":{"text":"First time visiting New Orleans, so of course I had to try the \"Taste of the Bayou.\" It wa","useful":0,"cool":0},"zkZQi6H_mYmWFCAwzpVrtw":{"text":"On our week long long trip to New Orleans we had some amazing dishes at Creole place. Shri","useful":1,"cool":0},"1ctcBHG21Vyl67e0ZVP7VA":{"text":"Upon arrival, we noticed that there was nobody at the hostess station outside, so we walke","useful":0,"cool":0},"XlvgU1Mk7fnPE84CPLXBTQ":{"text":"A tourist trap by large hotels, but with good food and friendly service.","useful":0,"cool":0},"AbS21385Pycw-QSqsOg1rg":{"text":"Their food was just okay. Nothing spectacular, I'm sure you can find something better. Had","useful":0,"cool":0},"Yo0_pNZmjkqRgz9emhJGwg":{"text":"This place was good, and little on expensive side. Chicken jambalaya was good but for $17 ","useful":0,"cool":0},"DwxZmPeDGBb6sOMu4UnYjw":{"text":"The food was pretty basic, over priced and wasn't 4 star quality.. I won't ever come back.","useful":0,"cool":0},"78g31cgAYYy9uzwU9UxiwA":{"text":"Neat & clean facility, everyone was very professional & attentive. Was here on a Sunday mo","useful":0,"cool":0},"MuzpbloJLJHxTwB5oeQYIQ":{"text":"Yummy!!! Stopped by because they had outside seating that is pet friendly. .who knew the f","useful":3,"cool":0},"sxs9IeRsGocG6eGSX3cAXA":{"text":"Authentic creole food with excellent service! I ordered the Canal St redfish, and it was p","useful":0,"cool":0},"UYQSGhqynxcZe7LyEI7hMw":{"text":"We got here around 7pm & got seated real quick. Restaurant is very nice and clean. We orde","useful":1,"cool":0},"pI06gZ60fnaSbC2HWOJFmQ":{"text":"Came here with a group of 4 girlfriends on a birthday trip today, the food was amazing, we","useful":0,"cool":0},"peDUujV_spHFbq3lsbid9A":{"text":"Dinner with my babygirl and friends in NOLA this evening.  1st visit ~ the menu is awesome","useful":0,"cool":0},"oRNEttsOStvapSZsUUezuw":{"text":"-Came for both lunch and brunch because we enjoyed it that much. For lunch we had the Tast","useful":0,"cool":0},"84e-HZZlycwMeACqsf20IQ":{"text":"Visited while I was in New Orleans from Houston to celebrate my birthday. The food was ama","useful":0,"cool":0},"HysqMaxdnTfy-bkcHGJUtg":{"text":"The only reason they are getting 2 stars is b cause the people that work here are lovely. ","useful":0,"cool":0},"ood9lAT9NzKUKHvneGt9kQ":{"text":"Fantastic brunch spot!\nPrices are reasonable, food is top notch, service is friendly and p","useful":1,"cool":0},"Bc7SCdX52Gqo9MInzg4VgA":{"text":"The food was great - not as hot as l like it, but very tasty.  Happy that they had a sampl","useful":0,"cool":0},"4XhCqFmbRo6CafwuJfyJ5w":{"text":"Excellent service by Damian and Kyle \"the beast\". Tried the char grilled oysters which wer","useful":0,"cool":0},"Ca37lgVKBznIiIlX9r1GFw":{"text":"Great service - Monet is full of spirit and personality. Bacon and garlic oysters are a mu","useful":0,"cool":0},"Q1B1W3TW7FPAMr9A3oL78w":{"text":"I as told it was a good place BUT we found that it wasn't so great. We were seated quickly","useful":0,"cool":0},"1y01Od9cVZX-xfqDLk1SIQ":{"text":"Creole House has a pretty lengthy selection of po' boys and seafood options, great New Orl","useful":0,"cool":0},"e4jVoLON1VOQhj4HfGbUOw":{"text":"Located on Canal, this is a very Louisiana place to experience. We stopped on a whim and g","useful":2,"cool":1},"9iBR4_ACxo_Eaw8TFh1Vyw":{"text":"This place was incredible! Our waitress was so nice and quick with getting our drinks,  an","useful":1,"cool":2},"qhBYnXGNuBON1xCh8pDfBQ":{"text":"This is probably the worst Creole cuisine concept we have visited. First off our server wa","useful":1,"cool":0},"iHzYPe1vXPRgG33hSKyFwA":{"text":"We happened to roll into this establishment on opening day without even realizing it.  The","useful":0,"cool":0},"CQE_cKSezvjONfupSFQveA":{"text":"I came here for take out just the other day and I wish I had enough time to sit down and e","useful":1,"cool":1},"fLgvMnUu8ygMhglti-aAkw":{"text":"Dinner 3/2/2016:  Not impressed, you can get food just as good or better at the airport. S","useful":0,"cool":0},"xT8wJz3VJiTSswNHbWinOQ":{"text":"AMAZING! Great introduction to local cuisine. Had my very first crawfish PoBoy and loved i","useful":0,"cool":0},"Q1W4mogZeha3L18hN8hwVQ":{"text":"Had the crawfish cake 'bayou ' Benedict.  Eggs were cooked perfectly.  Crawfish cake was y","useful":0,"cool":0},"hgMGioDZLxPE3SG_J1UF1w":{"text":"Popped in for lunch on my first day in New Orleans and by far the best crabcakes I've ever","useful":0,"cool":0},"i-6PypwiNvh2NT6skpdoFw":{"text":"This was my second visit here & I decided to try the Taste of the Bayou. It included gumbo","useful":0,"cool":0},"t9R6i_GbQoLD56fPhfvsTg":{"text":"Good food, good waitstaff.  I was with two others. There food came out and then there was ","useful":0,"cool":0},"CDH1Jx5y36jSECu5mRZ6sg":{"text":"It's sad to come to NOLA and have bad gumbo...no depth. And overpriced at $14 each for a b","useful":0,"cool":0},"rj8uucEBJ3nq0dRCjrinow":{"text":"Food was very good as well as the service.\nSpecial note we had our dog with us and it was ","useful":0,"cool":0},"QthjEYRsLtqcCyUW-Jn8bQ":{"text":"After waiting the reasonable 30 minutes to seat our party of 8, our waiter arrived at our ","useful":0,"cool":0},"ChIWdVHr8qZjzfqPAz676g":{"text":"The shrimp and grits, red beans and rice, chicken and waffles worth every dime!  I can't w","useful":0,"cool":0},"AfV3FFwXJPLKlWKs2kC56g":{"text":"This place was great!! Wonderful for our large party of 7 delicious oysters and shrimp and","useful":0,"cool":0},"idQ_TlT_16eRzphsCe9-qA":{"text":"Came here with a group of about 15 people. Found the place on yelp and based on the pictur","useful":0,"cool":0},"p3WKG5lQA50Dapt6fAO0hA":{"text":"We had to wait 30 minutes to get(the hostess said 40) & as it turned out, well worth it. A","useful":1,"cool":0},"9GcEGozmotWyasN_daYqbA":{"text":"**MUST EAT HERE!! ** The food here was great and was seasoned to perfection! I had the Shr","useful":0,"cool":0},"UvHLCt8L4K6Md8mONsUQ7A":{"text":"Delicious delicious!  Mom and I stopped here for dinner before heading into Bourbon St.  F","useful":1,"cool":1},"g-JUnNnRsITNrx1bMm_M5g":{"text":"We ate lunch here.  We had 4 po-boys and the bread was burnt all of them.  We tried the al","useful":0,"cool":0},"mE8t95E-UnZcWaGq1GIZbw":{"text":"Dinner was awesome. Had the Chicken Jambalaya. For dessert, had the Bread Pudding. Very go","useful":0,"cool":0},"zApO0zdV63s_FmK8A2q4cw":{"text":"Stopped by on a whim and glad that I ended up eating here!  Had the gulf coast omelette (c","useful":1,"cool":1},"TaA4wdTOc9g8LPeb0H6hdg":{"text":"My wife and I decided to eat here because it was right next to our hotel and just arriving","useful":0,"cool":0},"faZ7aPWiGZRrLZKvq8NwQg":{"text":"We had a great experience at the creole house tonight and highly recommend it if you are i","useful":1,"cool":0},"uzBNyU9f3_B7VZoD0zX1tQ":{"text":"After wandering through pages upon pages of Yelp! reviews and comments, my wife and I deci","useful":2,"cool":0},"3ond7-C3RvPEOQQYgsviTg":{"text":"Good food but unnecessary wait to be seated.  Thirty to forty minutes to Be placed at a ta","useful":0,"cool":0},"b6p4ui2BYRdMQ7jmWxrjBA":{"text":"Was at convention center, walked over. First, nice 12 min walk, on way to French quarter. ","useful":1,"cool":1},"uWTwNRzyT_GE6szfjAup4w":{"text":"Spending our last day in NOLA staying with our local family, we found ourselves in this pa","useful":1,"cool":0},"Np995Jn0m5RVxcp0kFb6yQ":{"text":"Mo and Kevin behind the bar started us off with an awesome little lagniappe of a loaded ch","useful":0,"cool":0},"5nu_3w8KVrzaXJVcjpcbLw":{"text":"Went here for breakfast, must say, while it is really pretty, the food is glorified diner ","useful":0,"cool":0},"bxNO8Rr-P4ChWj-6xGvZOA":{"text":"Truly the worst Chargrilled Oysters I ate at any restaurant in NOLA, and I ordered them at","useful":3,"cool":0},"9KkuXeDIbFSRRd1wjsFSsA":{"text":"Best meal of my life. Beet salad was earthy with surprising bits of tangy, vinegared somet","useful":0,"cool":0},"7kuf_Y5Qhfu7cLQBDEUz_A":{"text":"GREAT food and friendly service!!! Cute inside and clean. Great prices and great location ","useful":0,"cool":0},"hiAFy0fD2JDBn66P-7EIuQ":{"text":"3 stars only because the oyster chef (the one with dreads) was awesome. Food came out wron","useful":0,"cool":0},"PKJquUbEQ5LuvBDTJCOn0A":{"text":"It is delicious! I got the Shrimp Ya-Yas and crab cakes. The crab cakes were good, but the","useful":0,"cool":0},"BxziLkL6cidbmbM6eBVd3Q":{"text":"Was told by a friend to come here.  Walked right in on a Sunday night, great service.  We ","useful":0,"cool":0},"6NaYuxi-G0bPhDcRtKAoxg":{"text":"Food was AHH-MAZING and service was great too. We ordered the chargrilled oysters as an ap","useful":1,"cool":0},"xkSCu9XxeTs3N_3OMyM4iQ":{"text":"Best chargrilled oysters I've ever had. Louisiana Benedict was incredible. Moe and Kevin k","useful":0,"cool":0},"nP6P6gyjHTN-iVIh6NP1Xw":{"text":"Good menu selection and good service, but the portion size was less than expected. Not the","useful":0,"cool":0},"tz2btC1RBVILZ7MqtfrfAQ":{"text":"I'm only them giving them 3 stars because their ribeye was very very good. I got the jamba","useful":0,"cool":0},"95GI7WFhRme7WLlOZChT8w":{"text":"Save your money. Food barely warm, small portion, expected to have more than 5 crawfish in","useful":0,"cool":0},"Jk_Kz5YmzUgcA6d5FPSt0A":{"text":"Dinner Very good , breakfast not so much ! Right by our hotel which is very good . Dinner ","useful":0,"cool":0},"yVGPMkh_VIBcQ7COR-4nmA":{"text":"Great food and service! Perfect lunch by the Windows.  Kids shared a pasta dish, had an oy","useful":0,"cool":0},"MfyJs_R8YbXdzikcgu7ubA":{"text":"Roast beef po boy was good but not amazing. The part that got me was the ac unit was dripp","useful":0,"cool":0},"uLn9biQljorGH6iNytqXAg":{"text":"We didn't know where to eat while visiting. Kelly the server helped us and made some great","useful":1,"cool":0},"8f28WiaqNLWNQGqEAWLuPw":{"text":"Fast service, good food and great location on Canal street. We enjoyed a late lunch with a","useful":0,"cool":0},"DSB6lS_H6dlXymAWRujOCg":{"text":"as a world food traveler and business traveler, I have been to New Orleans many times... t","useful":1,"cool":0},"YhGw0Y0aqhhUiLU5G_BHeg":{"text":"Taste of the Bayou! You pick 3 of the 4 options: Chicken & Andouille Gumbo, Crawfish Etouf","useful":0,"cool":0},"bpUMCIDoeC-K0Astbg4wjw":{"text":"We stumbled upon the Creole House for breakfast, but now will tell people about. The servi","useful":0,"cool":0},"qHy92g14RBQXxk5J47r-nw":{"text":"I really wanted to like this place. I ordered the shrimp and grits for breakfast, which wa","useful":0,"cool":0},"9QPiXqBVU0JKVyIOmweumQ":{"text":"The food was excellent. I also want to give a big shout out to our waiter Terrance C. Than","useful":0,"cool":0},"Aza5RZj9-5GH0ETwG11PDg":{"text":"The staff were quick and friendly! The food was excellent! I had the best calimary since I","useful":0,"cool":0},"-y8uc_dCC3JNh0hBxIyWaA":{"text":"Derrick was so professional and what and awesome grill man! My Chargrilled Oysters were so","useful":0,"cool":0},"9PTPARn0w7vIteXgVwx1gQ":{"text":"Had the Jambalaya pasta, a Hurricane drink and the bread pudding. Drink was a little weak ","useful":1,"cool":1},"pQNX22tUuYQqQPKMdpZwng":{"text":"Checked out the Creole House Restaurant & Oyster Bar today. The difference between 5 and 4","useful":0,"cool":0},"A5jQmEBRmQVlO2HM_mPOow":{"text":"I will begin this review by saying I believe 2 stars is generous. We came with a group of ","useful":0,"cool":0},"c2E6WDhXD-rAqS8bu7HmAA":{"text":"The red beans and rice with andouille sausage was pretty good!  My daughter liked her chic","useful":0,"cool":0},"lYHErm8P0vkXbJxzyYgyxQ":{"text":"Avoid - it's a tourist trap.  We had the shrimp po'boy and gumbo and jambalaya...they were","useful":0,"cool":0},"EzaR_fKFrQeTyJglw-daHw":{"text":"Good taste, fast service, but the crawfish étouffée (while good) is HIGHLY overpriced for ","useful":1,"cool":0},"rMP4J4O4EXTK3sbu740uxw":{"text":"This place is just wonderful.  The food and staff and just full of hospitality.  Our first","useful":0,"cool":0},"ksWBi3XAKr1eoGkg-5gncg":{"text":"I debated on whether to give this place 2 or 3 stars...we were in town over the weekend an","useful":0,"cool":0},"1J1lrFFzndSgR4K9vhYtxw":{"text":"Sat at the bar and had Bayou Benedict.  Great food, excellent service, and a good price.","useful":1,"cool":1},"l2ou9ua1TGVHtxQXsHG9pA":{"text":"This is my favorite place to eat to get authentic Creole food. The staff is continuously m","useful":0,"cool":0},"BTSa3wCaEnJhZ6MWTPxHdQ":{"text":"Breakfast was awesome. Nice size to start your morning and having room to taste throughout","useful":0,"cool":0},"QUrvQjsFQH1wGBD-GihVjg":{"text":"Great food and their service is friendly jst like true southern hospitality. I would recom","useful":0,"cool":0},"shpoFJFE6JQcG0CFaGArnA":{"text":"Service was friendly, and gets an additional star, but the place is a tourist trap. Cajun ","useful":0,"cool":0},"TL57IPxJGykpwfk3uURgFg":{"text":"Our server was friendly, and the location is nice, but our food wasn't so great. The jamba","useful":0,"cool":0},"ZjYvIQ57JWedtrCidX-dlg":{"text":"Our food was great. Appetizer of spicy NOLA Bites were very good. I had chicken alfredo th","useful":1,"cool":0},"5TNnoL5d4Fp8alhvE8BTLg":{"text":"I ordered the shrimp which came with fries and hush puppies. I also tried their cheese gri","useful":0,"cool":0},"u1akUk5Ww2ELsMbQgKuzlg":{"text":"Great experience. Wonderful food, quick and friendly service, and clean atmosphere. Our se","useful":2,"cool":0},"IlFsze2tFR8-a0ZRfsHi9g":{"text":"Went with friends none of our food was properly seasoned. Avoid the Alfredo unless you lik","useful":0,"cool":0},"7OndvCxMPIZVjWeUFLELDQ":{"text":"My husband and I ate here on our last night in New Orleans.  We had the sampler.  It was a","useful":0,"cool":0},"fhvTFO1xof5KD8lTrW0uBA":{"text":"We ordered the Taste of the Bayou and the Boudin. The boudin was really good and I would d","useful":0,"cool":1},"R9CdAopnnZTRya4bQ58IuA":{"text":"Second order of BURNED charbroiled oysters. That are so burned you can only peel up half a","useful":0,"cool":0},"KMnSK7Bw05Al-usPLSmdRA":{"text":"Food is ok. The service sucks. That's all. Don't waste time on it. It will influence your ","useful":0,"cool":0},"HXFip9mv9P6ye6ftDh0Haw":{"text":"We stopped at the Creole House for dinner on a Friday night. We were seated immediately an","useful":0,"cool":0},"3bgO5gcJvdLKJXiaifMLJQ":{"text":"Ehhh, this was okay. \nTook over 15 minutes to get waters. \nWaiter tried to bring us the wr","useful":0,"cool":0},"iI0QuNGosYHV6OoUyy039A":{"text":"Excellent service, excellent food and reasonably priced! We took our 2 & 3 year old and th","useful":0,"cool":0},"SmQFpbmCLspNnCpmxIPOQg":{"text":"Worst meal ever.. service was horrible. Food came out looking like it was reheated . The e","useful":0,"cool":0},"pKUccnicA93M4cP_26vgbA":{"text":"Absolutely delicious! The spicy NOLA bites were an amazing start to a delicious meal. We s","useful":0,"cool":0},"5OgvRtgEmdhrVljMy1BfwA":{"text":"Incredible food, incredible service, incredible drinks. The server was incredibly kind and","useful":0,"cool":0},"lI1-TQcdCsb71UN11TttiA":{"text":"I am so tired of eating average food that I might as well go back to H-Town where the food","useful":1,"cool":0},"pgqCb6ORa-d4S6t0kfyO1A":{"text":"Amazing food and service. First time I tried grilled oysters, actually first time I tried ","useful":0,"cool":0},"tXcGvo6v3UWWa7wBbD6whg":{"text":"We ate at the Creole House twice in 3 days. It was just down the street from La Pension (B","useful":0,"cool":0},"AeFZkRosmW3iwzxuSW86bA":{"text":"Never had real Cajun food. ...as I drop the Mike!!!!\n\nService on point great atmosphere. N","useful":2,"cool":0},"qXhO2HVa9Ki-7WB_fUYqpg":{"text":"Live music in the courtyard is a must. Great ambiance. Many different seafood dishes to ch","useful":0,"cool":0},"D5nHfT1Q5bUr1bZk8qh2IA":{"text":"Me and my husband did say trip to New Orleans and decided to eat here food was AWSONE serv","useful":0,"cool":0},"ZoceFZID2KV2hd_lO6nEqw":{"text":"Great wait staff! Great food! Had a wonderful time! Enjoyed dinner yesterday the good was ","useful":0,"cool":0},"kl23fCoJ97SE9tfm_yASlw":{"text":"Absolutely awesome food and staff. Passionate and friendly. Perfectly fresh and large loca","useful":0,"cool":0},"Kp7---G9bkNL4SMYpxDNvQ":{"text":"Been wanting to try this place since day one when I got here and found some extra time on ","useful":1,"cool":1},"0bJxy2OqftELxWM2XlZN9w":{"text":"Yelp reviews led me to this restaurant on Canal Street. Hands down the best crab cakes I h","useful":1,"cool":0},"TqzsAPBuClA6CNVj7xnQeA":{"text":"Bad service, undercooked red beans and rice, so so gumbo.","useful":0,"cool":0},"gE3A5ij-B14pAUEJOsotgA":{"text":"The food was so good here...I came here twice while in New Orleans. Lol...Also because it ","useful":2,"cool":1},"9iKg_angnDsoYaFjrim9Qg":{"text":"Had a couple of local brewed bees $7 each. Not bad. Gumbo was horrible with NO meat no chi","useful":0,"cool":0},"yWwuG1qSZctgjyZuqm7nEg":{"text":"Great food and friendly bartender.  will love to come back again.","useful":0,"cool":0},"s19UgW_hhvsHqYMY0OOiAw":{"text":"My husband and I visited NOLA for the first time last week and stumbled across this restau","useful":0,"cool":0},"pqv1O5WT4XT9hLqanNOPzg":{"text":"I ate at the bar. Great service. The garlic bacon grilled oysters and blackened redfish we","useful":1,"cool":0},"1mpmuu6RKqAfNyaEssLuOw":{"text":"Sat at the bar for a quick appetizer and a bloody mary. Good service","useful":0,"cool":0},"e6Y-McO8lyT8EH9W9ZBd6g":{"text":"Finally, an amazing po-boy sandwich.  Chef was very accommodating and the crew at Creole H","useful":0,"cool":0},"HFRdKlByCC2LUBg0d-K5TA":{"text":"Great new find on the French Quarter side of Canal street. The Oysters were icy cold as we","useful":0,"cool":0},"k96UlYPr-NcE8MuNeNRDow":{"text":"A very generous 3 stars. Outside service is awful because our waiter seems stoned and move","useful":0,"cool":0},"LmssBXMuqai2FOUu3GCvxQ":{"text":"If I could have this restaurant transported to Maryland or DC I would do it in a heartbeat","useful":0,"cool":0},"5mEhA1iZT_QEuRmhW5L5IQ":{"text":"Great place to try a taste of NOLA since they have the Taste of the Bayou option where you","useful":3,"cool":1},"taISJmrleEnAZFvV90o7WQ":{"text":"really not good. total tourist trap. ordered grits and they were ICE COLD. told our waiter","useful":0,"cool":0},"_UmBH4xIr1zsu2rdruSmlQ":{"text":"Not impressed. My salad had nothing on it, no cucumbers, no tomatoes, nothing. Just lettuc","useful":0,"cool":0},"tlDrWpPOtzR_Z1PFxNmNNg":{"text":"My wife and I visited New Orleans for the first time and this was the first place we went ","useful":0,"cool":0},"vTiV6yCB9Vse6KNMIKz3Pg":{"text":"Yum!!  We were pleasantly surprised to find this spot close to our hotel.  Our server was ","useful":0,"cool":0},"ih079Sdhy_oNVm1edXyjsg":{"text":"Awesome breakfast. Convenient location near the Marriott.","useful":0,"cool":0},"U7XNQWowfFJAxuqWx7riNg":{"text":"I can't comment on the food because their lazy staff never said hello or took our drink or","useful":0,"cool":0},"CayOHA0o-pw31koCG3-DHA":{"text":"Stopped here for breakfast and truly enjoyed it. The menu is unique which is refreshing. T","useful":0,"cool":0},"GUN7sAWocABMxToGjUPMtQ":{"text":"Great food and excellent service.  Had Canal St. Redfish and it was wonderful.  Must have ","useful":0,"cool":0},"JDKp60MAfaYEPtfEr5G9UQ":{"text":"The service is great!  Our server Steven really knows his way around. He steered us in the","useful":0,"cool":0},"3I8jpVONPHU41YL7QjIZqg":{"text":"I had the three entrée sampler, red beans and rice, jambalaya and and gumbo it was D licio","useful":0,"cool":0},"eyP6tsg19VxzhqYjXBl5Yw":{"text":"Overrated in my experience-- esp for the prices. The blackened redfish was extremely dry, ","useful":0,"cool":0},"G9l4NksxKhIMSukTvd7xLQ":{"text":"Good place to eat if you happen to be in the city. Really nice atmosphere & the servers ar","useful":0,"cool":0},"2j_VVUGpRnqDJS99Jnv6AA":{"text":"Awesome Food, service!!!!\nJust looking for some restaurants and found this place on Yelp. ","useful":0,"cool":0},"UJ9G-aFpd34fk5vdMZIBKg":{"text":"Portion sizes vary greatly.  The po boys are a fantastic deal but the jambalaya and gumbo ","useful":0,"cool":0},"4QVF7gck-K4XfgwOLQchvA":{"text":"Dropped in approx 30 mins before the beginning of the expanded lunch menu (they have a sel","useful":0,"cool":0},"TPNRKPW30_TgHXNUU8xWbQ":{"text":"Ate here on a Sunday brunch, the last day we were in New Orleans during a short October we","useful":1,"cool":0},"G3kd9Uc247NvfVSN4GGAwg":{"text":"Food was not worth the calorie splurge. It was overly greasy covered in bland creme sauce.","useful":0,"cool":0},"1hZlfwFqoHw5SVhs7XLQhg":{"text":"Chicken & Waffles are awesome here. Servers are all very helpful. Service was excellent. T","useful":0,"cool":0},"lHnHxzx3dWI0r2dUWnFEYQ":{"text":"Had a bunch of a patients . The wings are ok. The alligator was a good choice. The calamar","useful":0,"cool":0},"-4Ntf2ajGZXvGMJQzg4Ezw":{"text":"This is the first place my sister and I stopped to eat when we arrived in New Orleans. Our","useful":0,"cool":0},"6DKEmJP8k9ZBK20GnmVLoQ":{"text":"Came here for brunch and i was truest satisfied. The reviews was a great deal of help for ","useful":0,"cool":0},"5cffegbEihgxZynHckPkOw":{"text":"Food is decent but over priced. That is to be expected due to location. However, went twic","useful":0,"cool":0},"W-71Sp9cXTrMw5MJGhJxqQ":{"text":"I am shocked by the 4 stars this restaurant has. The service I cannot complain about. The ","useful":0,"cool":0},"Csyqrb5pdOjkYkZ2CRIvPQ":{"text":"Tried to find somewhere open early and they were.  However we were the only ones there and","useful":0,"cool":0},"QnjLfn8BXLp4ldiavf4GDg":{"text":"This is a classic \"main drag\" tourist restaurants. We were starved and in a rush, and the ","useful":1,"cool":0},"iPgLkWmCz7xHlTi8x5wWyg":{"text":"Great food. Everything was excellent especially the char grilled oysters with bacon. \nOnly","useful":0,"cool":0},"PDulhhAbOfXnjePKXX5uGA":{"text":"The service is lacking.  Our waitress kept forgetting about us but it wasn't that busy.  T","useful":0,"cool":0},"VNDuYAZNp94Ojz-gDFdC2g":{"text":"Awesome choice of gumbos and jambalaya. The service was great. The only reason I gave it t","useful":0,"cool":0},"z_c02D7Nuaxv_WkslU5BIg":{"text":"First, the wait was 45 minutes for a seat at the bar. Sat down ordered a glass of bubbles,","useful":0,"cool":0},"WYNp4nJLBNCEOrXdJAhb4g":{"text":"We went to have breakfast at this place during the mardi gras festival. We had egg breakfa","useful":1,"cool":1},"Y9-6kbRk4y-SYzqY9oulBQ":{"text":"This place was amazing! Came in for lunch and was seated immediately. Our waitress Ché was","useful":0,"cool":0},"n3Dggh-I31SqZd9_OkDVXw":{"text":"#worldsbestfrenchonionsoup seriously so good! I'm normal not a huge fan of French Onion So","useful":0,"cool":0},"sH-tbBOFSLj7FevL6U5Cmg":{"text":"Great food and nice atmosphere. I had some French onion soup and a chicken club sandwich. ","useful":0,"cool":0},"B9LucZYMpX6gXD8iYJhTQg":{"text":"Monster-sized food poisoning from ... a salad. When I was eating it I thought something se","useful":1,"cool":0},"ldsQisLak7nHmv5Fp19gPQ":{"text":"Good but expensive for what you get. Gave the waiter - no tomato on the po  boy yet he bro","useful":0,"cool":0},"Kxj1IKOBVTf0EffWkp7aLQ":{"text":"Great food !nice little place right off Canal Street . just a short walk to Bourbon Street","useful":0,"cool":0},"R05bchZarfdVt_Nhrih55g":{"text":"Was going to go to other place for breakfast but the wait was 30-45 min. Walked down to th","useful":0,"cool":0},"-a3heCyQTK5SWSPYR52ITg":{"text":"We stopped by after a parade - it was freezing and we were starving! We knew we had to try","useful":0,"cool":0},"0OudiWqdRaaKVjppUFmt_g":{"text":"My first eatery on my visit. The wait staff was pleasant and informative. The crab cake an","useful":0,"cool":0},"ihmxyqVjrL9BrM7X8iXxrA":{"text":"Had the Tasso & Eggs for brunch.....I literally wanted to lick the serving skillet clean. ","useful":0,"cool":0},"xJgSmZm7YTYWHjw3Fs_iKw":{"text":"I am visiting for a conference and stopped here for an early lunch. The staff were very fr","useful":1,"cool":0},"j5fpzBcR3Ndm6jXnhWNdGw":{"text":"This was our first meal of our trip to NoLa. We just walked into the first place we saw. F","useful":0,"cool":0},"PNrj7v8Sk48kiFFSEbH0vg":{"text":"Visited here during the half marathon weekend - a little while to wait for a party of 8. W","useful":0,"cool":0},"zoA3yoTmFMRBnr2tDJ_gyg":{"text":"Looking for a decently priced meal on Canal street that has the standard New Orleans fare ","useful":0,"cool":0},"78nRvVcjj5rmDb9JNRmT6g":{"text":"Went for lunch on a Friday. Oysters were sensational. Shrimp ya ya was perfect for an appe","useful":0,"cool":0},"UJwgBpstfinA2eKmaDlj8w":{"text":"When you eat at this restaurant every meal comes with a side of people watching. I enjoyed","useful":0,"cool":0},"nDndXUw_uBXDPnau3mtEaA":{"text":"Great service and food. In a city of 2200 places to eat; it was so good, we actually ate h","useful":1,"cool":0},"EE660YZ9kN5Uu-vXgHohBA":{"text":"The first place I ate when I came to New Orleans. The oysters were fresh, the red fish del","useful":0,"cool":0},"OiK79IfRVeavtJHk_Qcmig":{"text":"The food was decent although it came out just above lukewarm it was good. The service was ","useful":0,"cool":0},"X9KDUzwXDig1PAkTCgk8HQ":{"text":"Visited for breakfast and it was probably the best omelet I've had in my life. The ambianc","useful":0,"cool":0},"BuEMIg8oxMdOx36jCpwyRA":{"text":"Very good seafood place right on Canal Street.  The waiter recommended a blackfish which w","useful":0,"cool":0},"kXuGkFQCvhUuaqLsVBU6dw":{"text":"I ordered the classic Benedict with grits.  It came with salad??  Anyway my food was Luke ","useful":0,"cool":0},"6EzNdfAtcp7lRr1M_vcMFw":{"text":"Given it's location on Canal St. I thought that it was just going to be very touristy and ","useful":0,"cool":0},"ZKfYK3CteVGtzrPwYhS0xQ":{"text":"First, the bread pudding is f#@king amazing, get that. Other than that, the food is, well,","useful":0,"cool":0},"9xMXcX9Xzxix2xWsMn4qGg":{"text":"We were very hungry and had no idea where to eat. We walked past this restaurant it didn't","useful":0,"cool":0},"IteM4We5EUvVhyKwcsWvBA":{"text":"Don't order the poor boy.  Worst sandwich I've ever had. The bread was very dry and the st","useful":0,"cool":0},"86zWPSvkBN43mfguoNribg":{"text":"Service was great....food was average at best. Calamari was a little tough, poboys were hu","useful":0,"cool":0},"YWr08NWUW6nlzFPhTCtnmg":{"text":"Second time to Creole House and still a great experience. Calamari was yummy but OMG the w","useful":0,"cool":0},"cKwwqwDjg9WfXY0PpCmDSw":{"text":"After yelping nearby  restaurants to try during our first visit to the Big Easy , this was","useful":1,"cool":0},"JzzhgUFXvYlfMWXOoHHEXw":{"text":"Wow! The best oysters ever, so fresh! My 9 year old daughter tore them up too. We enjoyed ","useful":0,"cool":0},"Xo3S6ac1XcJiFqYW2ZGoXw":{"text":"The hostess at my hotel recommended the Creole House Restaurant. I must say that I was dis","useful":0,"cool":0},"44hmv81c4eRoXhE6AWz_1Q":{"text":"We stopped in for a quick breakfast on our last day in town. Phenomenal meal at a more tha","useful":0,"cool":0},"pQ3F4iAiclbVeqxsKzbJIQ":{"text":"Food and service was excellent. Had the sautéed crab claws, on the half shell and chargril","useful":2,"cool":0},"uiP4qRXY5JiCd0NgfaWilA":{"text":"An excellent dinner and experience. We had the crab claws and crab cakes for an appetizer ","useful":0,"cool":0},"05G3wWRfiJ7rVDfpSJHRgA":{"text":"Good chill environment but my sandwich came out cold as hell and the salad my girl ordered","useful":0,"cool":0},"5Y-Aru3oU5Yp-K4-KHe9aQ":{"text":"Had the cajun pasta. It was by far the WORST pasta dish I have ever eaten. Do not recommen","useful":0,"cool":0},"_qrQCFE3xRCeoeKjogxpDA":{"text":"This is where TSA agents come to\nWork when they get fired. Service was horrible!! I wouldn","useful":0,"cool":0},"SkdaYDJ1at08oSXG-Pk_4Q":{"text":"Great place for lunch. Everything we had here was good. Yes, I would recommend it. This li","useful":0,"cool":0},"QZWbbeHu_oZVaYApgF_STA":{"text":"We came here right before a busy Mardi Gras parade, and were seated within 20 minutes. I w","useful":0,"cool":0},"cybNN69AUZLqDyHwdYL01A":{"text":"Amazing! Visited this weekend from Houston, Texas and it was some of the best food I had t","useful":1,"cool":0},"Ja_Y0W284fDq57qUHO-NXw":{"text":"The breakfast was undercooked. We didn't have a \"server\" outside so at first a couple diff","useful":0,"cool":0},"ilBFyxXi-Nij1Kuh_kmANg":{"text":"We met Wes the Manager by accident walking the streets of NOLA. We struck up a conversatio","useful":0,"cool":0},"ioyFuCFkpaKyF5Iym_QUOA":{"text":"Great location on Canal Street. The waitress couldn't have been nicer but alas the food wa","useful":0,"cool":0},"HI3xWt0coLK_htp8RbXGjg":{"text":"The service was great and my shrimp and grits was amazing!!! The only complaint I had was ","useful":0,"cool":0},"ChD61HdwkF5nCo36d7pwVA":{"text":"GREAT DRINK MENU!!! But... The food was not up to par. Every dish was missing something th","useful":0,"cool":0},"V29SSu6EEjsRFQ7A0-Mhjw":{"text":"What an Outstanding Breakfast!   One of the best I have ever had.  I ate the Bayou Benedic","useful":0,"cool":0},"kb0VerV_W5F487Akgahqjw":{"text":"This restaurant has been our place of choice since we usually stay at the Marriott next do","useful":0,"cool":0},"_YecL05Lh0AjZnRJIFoCGw":{"text":"I ate here 2 different times over the course of a week due to proximity to my hotel.  I wa","useful":0,"cool":0},"03J1yqKZawjvQO6FVXiwsg":{"text":"Had the taste of bayou (4), it was amazing! We also had a few appetizers and everything wa","useful":0,"cool":0},"DTT0uZmiMSjWuvL60coPqg":{"text":"We ordered crawfish etouffé, shrimp jumbalaya, a Bloody Mary and a cup of gumbo. As a refe","useful":0,"cool":0},"K3Y882-gkhhNI0BwaBut9w":{"text":"Delicious classic and bayou Benedict's. Great service from Dana!! Highly recommend this pl","useful":0,"cool":0},"hbswj1gLMAYIbnuT0wDI-g":{"text":"Good food, friendly staff.  Huge portions. Very convenient when staying at the Marriott.  ","useful":1,"cool":0},"8K8IoM02LwVJoNFw2o3Dpg":{"text":"Everything was delicious. Our server, Lawrence,  was friendly and knowledgeable. We had a ","useful":0,"cool":0},"u9uMv0-Ys_UYt0zKZsF_Lg":{"text":"We found this gem using Yelp and once again they didn't let us down. Definitely a do over ","useful":0,"cool":0},"cm0epBsDxaKXbzLUxwobmA":{"text":"So this place was recommend to me by a friend who I will no longer be accepting food recom","useful":0,"cool":1},"FEoK-oZHqUSwkUJYPsqikQ":{"text":"I was really disappointed with place all around.  We put our name on the list and hung out","useful":0,"cool":0},"dWSkxRf-yHt-ej0rXbpk8g":{"text":"The food was delicious and our waitress was wonderful. However the platters were VERY smal","useful":0,"cool":0},"vhMVnQcqWfIhEoEQV1CXMQ":{"text":"Stopped by for a quick supper of oysters. If you overlook the tourist flair, you can enjoy","useful":2,"cool":2},"t0IhoKkOsFuZtB0hFLK6gQ":{"text":"My first time here and it was good. Ate oysters on the half shell which was great. My frie","useful":0,"cool":0},"9yg_L2bTvnjX2knQPIzHLQ":{"text":"I was extremely disappointed in this experience.  I got the Crawfish Etouffee.   When they","useful":0,"cool":0},"GvKRIODE6VIeHleN_9wOAg":{"text":"Gross from the service to being able to smell pee from our table. I do not recommend attem","useful":0,"cool":0},"2D2hi43gHLCHRAtlDCa2kQ":{"text":"Got the red fish which was too greasy which robbed what I think May gave been a nice flavo","useful":0,"cool":0},"qy0_qUNdt8OIaCutXTSq4A":{"text":"I have friend shrimp po-boy.   The fries that accompanied the po-boy were average.  But th","useful":0,"cool":0},"cRmHFrHj5_SlSiNZU4jMXw":{"text":"We got here late, 30 minutes before closing on a Friday night, and the server did not seem","useful":0,"cool":0},"QFBF6Gnl1UOYjLsa2sRcPA":{"text":"Close but yet so far. Greeted immediately and got to sit outside. Solid first impressions.","useful":0,"cool":0},"bf4UQtI5zXbmTNLcblTfbA":{"text":"Red beans were ok. Nothing special. The blacked red fish is really good though. Not large ","useful":0,"cool":0},"GW73m05oaeAGWAPAR1I53g":{"text":"I had the creole stuffed fish....\"scrumptilious\"\nor I'll just say it was goood......u know","useful":1,"cool":0},"NtPc4I_3imlmhVpKYDwyRA":{"text":"Had a quick lunch here. Service was fast and pleasant. I had the roast beef PoBoy. It was ","useful":0,"cool":0},"37Ux3ZzF52fXJO504CNsNA":{"text":"Was looking for a late breakfast and this place did the trick! I had the Canal St Benedict","useful":0,"cool":0},"lC9Ol__Q1ZJHL3q79InTWw":{"text":"One visit was enough. We ordered a Muffaletta. It was so greasy we couldn't believe it. \nT","useful":0,"cool":0},"MViWEWgBQdYxZyrj7QBQyg":{"text":"Entrees were ok, we got a muffelutta and a crawfish poboy. Both were what was expected for","useful":0,"cool":0},"jqRQBs9Wn2zwE-HMXYZZnA":{"text":"We ate here twice this weekend - it's that good.  It is clean and has a pleasant atmospher","useful":0,"cool":0},"lpK9gfmtxcU2iZvAEL96uQ":{"text":"Quick service and tasty food make this an excellent stop in New Orleans. Vegan friendly as","useful":0,"cool":0},"9SvfY-zsDkYdKOuSDB6Okw":{"text":"Stopped in for lunch. Feared it would be a tourist trap. Wrong. Had a wonderful meal (shri","useful":0,"cool":0},"x2GotVozDripjNJU-tboFA":{"text":"Food was impeccable!!! Our server Laurie was the sweetest, most welcoming person to wait o","useful":0,"cool":0},"s_1xVtbSEJSjOxG22PuxIQ":{"text":"I am a local and have dined at many Creole Cusine Concept restaurants. And this was by far","useful":0,"cool":0},"lb5fhDXNq3bg0nwH3D_xTA":{"text":"The food was ok, but took 45 minutes to get shrimp and grits. Two small\nScoops of grits, a","useful":0,"cool":0},"JpoDX1EfR5Ow6XjXu4p6yw":{"text":"Super food, great service, and live Blues music while you eat...can't get much better than","useful":0,"cool":0},"Sgb1vl3L8G9IUQQ3V36OSA":{"text":"We loved the Crabcakes we also loved the gumbo soup we loved the side of jambalaya they ev","useful":0,"cool":0},"8e_WFRAfo10cdYuYET_k9Q":{"text":"Such a trash meal. I'm upset I wasted my time and money. Got a side of fruit, 90% of it lo","useful":0,"cool":0},"qmL7wiHUVNX9_ycZPkpBEQ":{"text":"The crab cakes are absolutely the best to be found anywhere. Good service with a nice New ","useful":0,"cool":0},"YkMXAHwuW4uMgkSNpMJeNA":{"text":"Takes way too long and wasn't that great. Lots of staff but they dont give much attention.","useful":1,"cool":0},"e-Y4r92kJqoIWjnSiBPEzw":{"text":"Really wanted to give no stars but waitress was nice. After waiting over an hour for a tab","useful":0,"cool":0},"jjOfgk65X155D-iyvpxxGg":{"text":"This restaurant was just \"Ok\" for me. As a southern girl, when I come to New Orleans I hav","useful":2,"cool":1},"bSLQkYKZ2nhlod3m09h8pQ":{"text":"The food and drinks at Creole House Restaurant are very good and I would highly recommend.","useful":0,"cool":0},"UFNsK00N5vYDrrpqcMXWRw":{"text":"Horrible customer service BEFORE you even get in the door. I love the food though and our ","useful":0,"cool":0},"unndd3xqpXdo32ZM6bpMXA":{"text":"Came two nights in a row because we had such a great time with Kareem. Sit at the left sid","useful":0,"cool":0},"r9DagMc9iIfoYuNxk1bCAQ":{"text":"Other tables got their food before us when we got there before them. Ordered the omelette ","useful":0,"cool":0},"fER3zHG2MTvisUGXwEbpJg":{"text":"Friendly staff.  Food nice seasoned and with spice.  Food came quickly .  Gumbo was not ho","useful":1,"cool":0},"PWF9ihoJ1a1jaZtqifCbPQ":{"text":"Super disappointed with the house po boy. Very plain. First day here in NO, and very disap","useful":0,"cool":0},"rUmUuTBHK1M4mC3L9GJnog":{"text":"We stopped here for dinner after our flight, so you can imagine we were starving. They had","useful":1,"cool":0},"Z8XLiNjD2yHbKP9pPH1ePA":{"text":"Great atmosphere. Quickly seated. Very pleasant waitstaff. Had the jambalaya pasta as our ","useful":0,"cool":1},"8s8LfHhQC4ahXVbvlCW8Yw":{"text":"Opted for here over the 75 minute wait down the street at The Ruby Slipper and wasn't disa","useful":0,"cool":0},"1TXGSOmkwhyeqT9qNhKoKw":{"text":"Caesar salad w/ grilled chicken was perfect, crab & corn bisque was delicious and the garl","useful":0,"cool":0},"GeGVUSbi7UQsGJxZ-1tNsA":{"text":"This is the third time we have been to New Orleans, and the Creole Restaurant, so far, has","useful":0,"cool":0},"ayMDI42DWLJbOvGPL8sPvA":{"text":"First let me say the Bacon Garlic Oysters were THE BEST Oysters we have ever had. We follo","useful":0,"cool":0},"7XIPXkGueoqWIUdymi-G1A":{"text":"Food was great! Service was ok but overall experience was great. If I'm ever back in New O","useful":0,"cool":0},"pOgWxnQ5qxLLrcFzwewieA":{"text":"I live nearby so we visit this place pretty frequently. It's a great place to grab chargri","useful":0,"cool":0},"q6wx84pZGDjimhAA9BrxTw":{"text":"Cute lil spot. We went to try the alligator.  It was breaded too much  and fried hard. I w","useful":0,"cool":0},"MbkQsuOMjG8649d2kipHNg":{"text":"Fun place, friendly staff & a great place to be when there's a parade on Canal St. good fo","useful":0,"cool":0},"jPglMxKOzh4lvky9Z0_NIA":{"text":"Excellent food and service . Portions are perfect and prices are good. Jeremiah was our wa","useful":0,"cool":0},"NhMi0aCdRrMpGhQnLqRanw":{"text":"The bacon and garlic oysters were AMAZING! Leon was by far the best server we have had in ","useful":0,"cool":0},"tK2xyRokmJ26qSxwSGSiDg":{"text":"Walked in to a beautifully decorated restaurant...much nicer than most along this area. Jo","useful":0,"cool":0},"KaH60VUhvyUwi0JFRKP78g":{"text":"The restaurant was within walking distance from my hotel so I decided to try it. I ordered","useful":0,"cool":0},"o61uYjQXGxlTE6DyFATJ0g":{"text":"Creole House is placed in a fantastic location.  We walked by it for several days and deci","useful":0,"cool":0},"3epcLDUiFizhgHzwM7tNtg":{"text":"Me and my wife go to NOLA every year. We wanted to try a new place, so glad we checked Yel","useful":0,"cool":0},"sFZen2qem2185Wupa6wCqA":{"text":"Casual. Good service. Patio seating (perfect for ppl watching). Open late. These are the p","useful":3,"cool":2},"YTwr3npV6Zf10fkGw6479Q":{"text":"Great food and service! Our server Brittany was more than happy to help us with directions","useful":0,"cool":0},"MolCspVkWojugvXyYK0ITQ":{"text":"We were a little skeptical because of the location in the tourist zone but the red beans a","useful":0,"cool":0},"ZNuIGZKgPPY3cAH47wvVmQ":{"text":"My second time here and this is 5 star all the way! Don't miss the charbroiled oysters! Be","useful":0,"cool":0},"c9_Ni6XT9piwBHIOw-1LjQ":{"text":"The staff was friendly but they are too busy socializing than serving their customers. Som","useful":0,"cool":0},"Dz_T3dYnwfNMjrANlQ11PA":{"text":"I wanted this place to be good but I unfortunately, did not have a good experience. We ord","useful":2,"cool":0},"cXaTfHLLWVVtg4JLlkwLkA":{"text":"Oh my word!!! THE BEST food I've ever had. My husband and I wanted to try out several rest","useful":0,"cool":0},"xidUad5-WEsqjQ8EOWRM6A":{"text":"Great Charbroiled Oysters at the Bar.\n\nKevin was the grill master when we first came from ","useful":0,"cool":0},"gxD_B2k4FovavADSbo-OAQ":{"text":"Service was great, but by the time out food came out it was luke warm at best. And we were","useful":0,"cool":0},"D1ar4inLwTZzMdr3hzAy5Q":{"text":"This place was just ok. The service was spotty but friendly. Chargrilled oysters were inte","useful":0,"cool":0},"9TG4sU6nB3QoHIicg_WLCw":{"text":"The Cajun jambalaya is absolutely delicious. I had it with shrimp instead of chicken, and ","useful":0,"cool":0},"J1j5_JQatN8F2MvOEwtWAg":{"text":"The etouffe was very watery and bland. And the pasta was over cooked so the noodles were v","useful":0,"cool":0},"5_vumOlZtxNqWvs9PODGLQ":{"text":"We are here for Keller Williams convention and had dinner there Saturday night and it was ","useful":0,"cool":0},"-EnEeZzgvvEGLCVCiUGD-g":{"text":"I got the chicken and waffles. The syrup has hot sauce in it. or tobasco sauce, either way","useful":0,"cool":0},"fo0yBNCpyR9gF25bWC3xDw":{"text":"A very good place to eat. I am not from New Orleans and was only there for a few days, and","useful":0,"cool":0},"e-kKNWOVE_2AUY4HXYakzg":{"text":"Wow - was this yet another bad meal in New Orleans. Everything was cold, unbearably salty.","useful":0,"cool":0},"Vq3NgZyCiRzH09Q3TbPt9w":{"text":"This is our first time eating at the Creole House in New Orleans and i have to say, I was ","useful":0,"cool":0},"_rpMmoFCKGP7u1sCcL27Yw":{"text":"Well I'll be!!! Absolutely amazing. Taste of the bayou, 3x!! Crawfish etouffee, red beans ","useful":0,"cool":0},"5CTYwjJbK5qx6BArjj3h1g":{"text":"I called to make a reservation because Yelp says this place accepts them. When I called, t","useful":1,"cool":0},"v_jBl-MlW0XeEk0SEkVAgw":{"text":"I was on a work trip and we really couldnt find a decent place to eat that didnt require r","useful":0,"cool":0},"rv0uj5lUJ3L__NizGdZQ8w":{"text":"This place is right in the middle of everything. All the staff were friendly and helpful w","useful":0,"cool":0},"CPKtc_Tsmq4myV-nGqZDtQ":{"text":"Had breakfast here our last day in town.\n\nWe ordered chicken and waffles, which got rave r","useful":0,"cool":0},"ynp7_JhthRKlJe72MkaOAQ":{"text":"This place has really good food and a majority of the staff is great our first night here ","useful":0,"cool":0},"ls3ZpsZ3eleQDCZdAOAoVQ":{"text":"Food was luke warm. Took 10 minutes to get water. Terrible experience. Was expecting a lot","useful":0,"cool":0},"BrhfbmgSqEw9jWnom4pCow":{"text":"OMG I damn near licked the plate. Best shrimp and grits ever. I think my shrimp and grits ","useful":0,"cool":0},"y17OdzMgZauAF_ito0QgXQ":{"text":"All I can say is Loved it!!!  Food was great! Service was friendly and great! Atmosphere w","useful":1,"cool":0},"4RX19pXOj2cNC_4uq8fyEA":{"text":"We were looking for a good creole dinning experience, we stayed at the Westin and our conc","useful":0,"cool":0},"GWhA1y6BJSGEk9satVbuEw":{"text":"Stopped for a late lunch & to rest our weary feet.  We got the chicken club Sandwich & sau","useful":0,"cool":0},"AITLV9V_SeOLiVvT4R9Ubw":{"text":"Awsome place with excellent food....some of the best char grilled oysters ever....and the ","useful":0,"cool":0},"8OLu08nbHO95lH4u0hg-Jw":{"text":"We went here for bunch and the wait wasn't too long compared to other places. I had the ba","useful":0,"cool":0},"dh2WJq-oSoqA1tOz-mQbdw":{"text":"Here trying out Creole cuisine. However no  impressed. Food is a bit tasteless. I had the ","useful":0,"cool":0},"coMzhQI8PwOAaU7SSxWGgw":{"text":"Sat at the bar and watch ouster shucking and chargrilled oysters being cooked. I ate fresh","useful":0,"cool":0},"t-g39xokOPfQqDNOiR-wvA":{"text":"Stopped in for dinner my first night in New Orleans since it was next door to the Marriott","useful":0,"cool":0},"ijLEtOHyTsayYT5Vte3XbQ":{"text":"Very rude!!! Waitress cane to the table very stand-offish! Very confrontational! Ordered c","useful":0,"cool":0},"nGOzlDcFC2lfwkIb9EL2iA":{"text":"This is a restaurant right on the corner of Canal and Decateur Street which Is the eastern","useful":0,"cool":0},"zEI7CeS9N5P9yZkeDd_7Dg":{"text":"Great food at a good price. This restaurant is located in a busy area of Canal Street and ","useful":1,"cool":0},"odn1-3j2ZsbI3FoqqdavSQ":{"text":"Went for lunch on a Friday afternoon. Great atmosphere - busy, lots of people, good wait s","useful":0,"cool":0},"WLQrN6b9uJVa0IhB5wsVew":{"text":"Food (dinner) was enjoyable and portions were adequate. Maybe a touch generic but still so","useful":0,"cool":0},"OMMVcZkLH_iE-MDdHE1BGA":{"text":"Nothing big to write home about but decent place for food if all other restaurants are pac","useful":1,"cool":0},"iKSufkWhvjOi9ioxslesVw":{"text":"First place we ate on our trip. It's got good food! The staff is fun, they have a good bee","useful":0,"cool":0},"myj3BwbiZ7VDn_GXaqiDJA":{"text":"Second time eating here both times I loved the food and the service.  I have to mention ho","useful":0,"cool":0},"H2yZW7336Khv8-_beQZq8w":{"text":"Very average. We ordered the chargrilled oysters, jambalaya pasta and cup of gumbo. Nothin","useful":0,"cool":0},"1RZ1UpV31SRwMCYth3A6GA":{"text":"This was my significant other and mine's last meal while in New Orleans and it did not dis","useful":1,"cool":1},"q-N3wsRwtdjTu4T2NHklyw":{"text":"We stopped here for breakfast.  There was 8 in our group.  It wasn't too busy but it was a","useful":1,"cool":0},"GxQvWaKDn8jv2yad-MYXSA":{"text":"I had the grilled stuffed fish. The fish was very delicious with authentic stuffing. It wa","useful":0,"cool":0},"8MBUXA3V5b4UN1hUZdS4MQ":{"text":"Service was slow to non existent. Food when it finally came out tasted burnt and i sent it","useful":0,"cool":0},"hLsCKWL_RC4b7YwoJObVyA":{"text":"Took them 20 minutes to even serve us drinks and the food was absolutely terrible - over s","useful":0,"cool":0},"GaAMbCgwdjHJ_2kiP3kXmg":{"text":"We have had oysters all over New Orleans, and we have been here twice. Never a wait, food ","useful":0,"cool":0},"2VN4D9OUAXs6WUflkylFVA":{"text":"Food was great. Fast service. But had no sweet tea!!!!! Lemonade was good though but still","useful":0,"cool":0},"M7LfLRV5PnD7FHH3W17Hmg":{"text":"We highly recommend this restaurant--we stayed at the Marriott and walked next door to the","useful":0,"cool":0},"DXZTefGrpSxPG0QivZs18Q":{"text":"Definitely share the pecan pie cobbler with someone! It's amazing! Yes I started my review","useful":0,"cool":0},"5fTXIv42vljv3LRVy66pCw":{"text":"Ok so our waiter was nice and the food came really fast. I got the cajun Alfredo and if yo","useful":0,"cool":0},"tkCxzVEQeblswkDhSs-4BQ":{"text":"The gumbo was great had the Oyster po boy after and it was terrific.  Came in for a late l","useful":0,"cool":0},"rVtWt4H37Z9VGxxMMeTY3Q":{"text":"Great food, just had the worse luck with a new waitress that spent most her time apologizi","useful":0,"cool":0},"C_12qnNL5VdW3vY3ZIVs0Q":{"text":"The Sautés Crab Claws are crazy good! Thank you bartender Jeremiah for the recommendation!","useful":0,"cool":0},"tgyeyo224HzG6Bn-EoqiaQ":{"text":"Best oysters in New Orleans! I came here in a rush, realized they were recently opened. Al","useful":0,"cool":0},"53mj1xA3_6ySiK3oJDKqJg":{"text":"Creole House Restaurant was absolutely amazing Jeremiah P, the bar attender was extremely ","useful":0,"cool":0},"2WpALLc2bHBC-JAMIZoFaA":{"text":"Food was good, service not good.  Had lunch there, the southern fried fish platter.  The f","useful":0,"cool":0},"oo-62sW8VizYBSc4S3OaJw":{"text":"The servers were really nice.\nThe bread on my po boy was really tough, I ended up just eat","useful":0,"cool":0},"_vxEvzmGn8TR4n2J9WK7xA":{"text":"Have been two nights in a row!  The oysters are amazing!!  First night had the crab cakes ","useful":1,"cool":0},"SWItCdcVsjTFZ_x1D8TzGg":{"text":"Too salty, too spicy!! This is an upscale restaurant on canal, so I expected more upscale ","useful":0,"cool":0},"l20Z1hkcoL-MmArDzfNuew":{"text":"I had just gotten into town and spent some time just wandering to check out the town. Need","useful":0,"cool":0},"vrq7Yyu3B-yLwX8pbKjUdw":{"text":"The Yelp listing for this business stated they were open until 2 AM on Saturday night. We ","useful":0,"cool":0},"mW_g_OTNd2bAaxN81SrNUw":{"text":"5/5 Bacon Garlic oysters. Not as rich as Ed's but less salty and very savory.\n\nLove the gu","useful":0,"cool":0},"i8bjYt09B0LoLM-KqT66Sg":{"text":"Great for groups! Staff was very accommodating and food was on point! Don't skip on the de","useful":0,"cool":0},"7WsxBGHGjH3gofWI_eBo8w":{"text":"We had the grilled oysters with garlic, butter, and bacon. And the shrimp ya-ya, and the p","useful":0,"cool":0},"EsQGnh_9amp4fnxgEFEVOQ":{"text":"Excellent service at the bar by a fun young woman named Deja Vu. She made fantastic Hurric","useful":0,"cool":0},"0ez13KrI5ueryWaj4_ZE1A":{"text":"First time there. The food is pretty good. I wish the fish had a little more seasoning in ","useful":0,"cool":0},"g9lpIBsv8R-_qKeB7r3hLA":{"text":"Our first night in NOLA and had dinner at Creole! Wonderful! Everyone was so nice, friendl","useful":0,"cool":0},"NkHtOigepBLoyFYxKy08eA":{"text":"This place is the perfect go-to if you wanna variety of Cajun/creole food! This is the pla","useful":0,"cool":0},"_gpbSfHFH-L-KjZMwKjvZA":{"text":"I went here with my mom on a Sunday evening. The service from the guy opening the door and","useful":0,"cool":0},"1GLpK0oaujrtE_dQUvmcJQ":{"text":"Very centrally located and easy to get in and out.  Has more seating than most local place","useful":0,"cool":0},"44Vbh2YoDtVIO5U9adVeag":{"text":"Not impressed at all.  It was a Tuesday night around 8 or 9 pm.  We were sat quickly, and ","useful":0,"cool":1},"RSiuZqIOfhvIylCxkp3hxA":{"text":"Came in hungry. Left hungry...we went there for breakfast. Ordered and after an hour our f","useful":0,"cool":0},"KUHLvYBTZE2RPRq9Yfs2cQ":{"text":"Very fresh calamari with a nice Parmesan topping. Yummy mashed potatoes. Sautéed vegetable","useful":0,"cool":0},"0s85Z91lThUl_6WJRf578w":{"text":"I wish I had gotten the name of the bartender on 1/23/18 at around 9pm (older man with lon","useful":1,"cool":0},"vQOehJ36F2VsxsiVgXMrng":{"text":"Customer service.... it's a lost trait! We requested plastic \"to go\" utensils and she imme","useful":0,"cool":0},"jIgPJU8rNaH6Gq85sZ0Unw":{"text":"Wanted to like it based on reviews but it was awful! Had the shrimp and grits and was very","useful":0,"cool":0},"olbdhYuvqQSp-GmG1chIJA":{"text":"Surprisingly exceptional! Had the sautéed crab claws and they were absolute perfection. \n\n","useful":1,"cool":1},"JoJN0ukES6ALwBptHJbIcg":{"text":"This is one of the best meals I've had since I've been in new Orleans. I had the fried all","useful":0,"cool":0},"lQTDU9IjrxYLurUHIV0fSw":{"text":"Totally worth the 40 minute wait( it was Christmas day) . Service was great, coffee was ho","useful":0,"cool":0},"Wep_zde9ZMp6pcmuDVguRA":{"text":"Great char grilled oysters and a fun bar tender. Place had a great vibe. We will be back t","useful":0,"cool":0},"TwB_mVpCUzxnjQPhA3aanA":{"text":"Nice culinary experience, but what's exceptional is the staff. Five stars there for courte","useful":1,"cool":0},"QDqwoGd6GMlmV346nGFXeA":{"text":"Arrived in New Orleans yesterday and walked up and down Canal Street before finding this g","useful":0,"cool":0},"KlITFcSWe4gIIwmkJ1XSJg":{"text":"Everything was great. Seasoning was delicious. I don't even like shrimp and I couldn't sto","useful":0,"cool":0},"IUJhlEXD_ZwUx6rzElHNgA":{"text":"So I went here to grab some alligator but wanted a little more. They prepared a combinatio","useful":0,"cool":0},"9lgkI-qoKEw5wkfiGyu5Eg":{"text":"We came here solely for the oysters- hadn't had any yet, and my husband was on a mission t","useful":4,"cool":0},"tWbSEUgVGMUM0f601kJf7g":{"text":"very friendly atmosphere. servers are well versed in the menu. \n\nI had the poi boy with sh","useful":0,"cool":0},"tA27ZmFmUjqDPbASLte1rQ":{"text":"Uh soooo good. Had Roland as a waiter and he was fabulous. Very personable and very kind. ","useful":0,"cool":0},"try-79hjsCnT_5L-hW-n3Q":{"text":"This place was right next to my hotel and I was intrigued to try it! The staff immediately","useful":0,"cool":0},"WoGm8uRFFmOMZmcc-aDZIw":{"text":"We were looking for a place to eat that would also accommodate our dog with outdoor seatin","useful":1,"cool":0},"EH27EaRu6NiN_UNfcrbYng":{"text":"This place was meh.  Seating was quick but the service definitely was not.  Our server nev","useful":0,"cool":0},"-rTXZjIJtM6ZPl1N2ddvfw":{"text":"Phenomenal food and service. Staff is very friendly and prompt when needed. We ordered the","useful":0,"cool":0},"URCWpGKpyvQXQYC-dnZ0DQ":{"text":"This place will be a go back for me since their RED FISH was FANTASTIC! I gave it 4 stars ","useful":0,"cool":0},"lQIcquaZctTEdWCuEfh_Rg":{"text":"Love it. Down home casual, attentive service, and great food. Parmesan butter garlic Grill","useful":0,"cool":0},"zGI1RFBb2JIiym-W3EPPRg":{"text":"The chargrilled oysters are delicious!!! Our entrees were the creole stuffed fish (AMAZING","useful":0,"cool":0},"smRIVjSFId4eVQXpPmZDLw":{"text":"Food was decent at best. But the pricing.... definitely tourist pricing. With so many wond","useful":0,"cool":0},"OoIZAdtjaEfFzM99KnwINA":{"text":"I visited this place when I was in Nola The service is really bad waiters are walking back","useful":0,"cool":0},"RBaQgBiEMzyZludzx3ADww":{"text":"Food: 2/5\nValue: 2/5\nService: 4/5\nAmbiance: 3/5\nParking: N/A \n\nCame here for a late dinner","useful":1,"cool":1},"cogD6yrKb6PS8f3jHCq6MA":{"text":"I really enjoyed Creole House. I have to say it was one of the better restaurants we tried","useful":13,"cool":11},"t2hb2kfYA3eC-ePnzm8xgg":{"text":"What an AMAZING experience!\n\nI was visiting New Orleans from Atlanta this weekend for a ba","useful":0,"cool":0},"yYBBkgKMr0RASkyeDk6EMQ":{"text":"Very nice experience. Great venue to view Mardi Gras parades ( we were staying next door a","useful":0,"cool":0},"D5A2ZGSy7-9HOG6t2c02ZQ":{"text":"This was the first place we ate at when we got in to town. So happy they did not disappoin","useful":0,"cool":0},"-NL1PLo2SHPj1500TnhSOg":{"text":"Late night supper for one on Canal Street.  Lots of single diners at the bar, a dozen plum","useful":0,"cool":0},"Z-XkSw-LQTi9ZefM5TVZiA":{"text":"Omelettes are to die for! So fresh so delicious . A real New Orleans feel to the whole exp","useful":0,"cool":0},"-keajMij5dsNW5O11nL3Ew":{"text":"Service was a little slow but the food was worth the wait! Everyone in our group was very ","useful":0,"cool":0},"UjQcdtEhPIh-OFsmmLMMSg":{"text":"I ordered the Shrimp Po'Boy which was alright (I had one the day before somewhere else, to","useful":0,"cool":0},"zsIVxXKUE5o3G9PSrapl-Q":{"text":"This was a phenomenal find on Yelp! It was our first time to NOLA. Server Richard made som","useful":0,"cool":0},"IvcBF-Do1AEs4HGP0ghixg":{"text":"New joint in town and I'm thoroughly impressed! Great oyster selection, though I favored t","useful":0,"cool":0},"Yha9UYl_886_lQGRlAbrvw":{"text":"Stopped by for dinner on our last night in town. Everything we had was great. I started wi","useful":0,"cool":0},"NiYhl16y0HBZTrmqo8b91g":{"text":"The food was not that great! I had a over priced salad with Cajun shrimp, my lettuce was h","useful":0,"cool":0},"UBsokfwyuXFzRIljaS0wsw":{"text":"We were looking for a restaurant for breakfast. My husband suggested this restaurant. I as","useful":0,"cool":0},"udVYScOXxo7LTj85ilvWJw":{"text":"After going to the casino and walking up and down Canal street we decided to give this pla","useful":0,"cool":0},"KOPHmP-V8EcKoLmjywdIgg":{"text":"This is my second trip to NOLA and my first time to Creole House. The food was fantastic a","useful":0,"cool":0},"7RWuN4V1k9F9AEyABQp8SQ":{"text":"If you are greeted by friendly host staff continue in and enjoy.  If not ask for a manager","useful":0,"cool":0},"9vYlZsjrfw_uawOmVRNnKg":{"text":"Fried gator app is easily the most tender alligator I've ever had, so good!! My friend's s","useful":0,"cool":0},"fnKQa6PmbX27SIVMwVVUWw":{"text":"I decided to sit at the bar, which was nicely stocked by the way. I started with the BBQ o","useful":0,"cool":0},"wAIGijEyr7JgD2kbSA2hYQ":{"text":"The food was fabulous!  Char-Grilled Oysters, Shrimp ya ya and Shrimp PoBoy!!  Great custo","useful":0,"cool":0},"TT2lnBynwm9IWTdKgiGI8w":{"text":"\"Beast\" the bartender was amazing to say the least.  The oysters, he grabbed the shelfish ","useful":0,"cool":0},"gwtk0Z8nubNBaMTPToET2g":{"text":"From the moment we arrived until the moment we left, the staff were glad to see us. This r","useful":1,"cool":0},"7XUy3ofrIYnddniWTcBEWg":{"text":"Fantastic food. I had the Taste of Bayou for entree. It had almost everything you would wa","useful":1,"cool":0},"hvmyJ2MQYl-PrdjRuosrhg":{"text":"Fantastic brunch! Would highly recommend the Bayou Bowl! Crawfish cakes were delicious. On","useful":0,"cool":0},"p0Pvr01rbr1Q-pxNBOYsQA":{"text":"Got the Taste of the Bayou and the rice was completely hard and inedible. Had to reorder a","useful":0,"cool":0},"O75orZi4B8WpGhMGQc0KRw":{"text":"Disappointing. \n\nNone of the food was very good, it was all just edible, except the Spicy ","useful":0,"cool":0},"TkyPOQA-WKQp683LgeZdbg":{"text":"Not bad.  Not bad.  Wanted quick and easy, and close to the hotel, before leaving NoLa.  I","useful":3,"cool":2},"MIhVgHY-sT-hrMCZqS4q3g":{"text":"I am SO glad we came to this spot. My husband and I were looking for a cool spot to eat at","useful":0,"cool":0},"5Dg00gxa6G3inq9ta-5CJA":{"text":"Actual Rating: 2.5\n\nMy friends and I came to Creole House after seeing the good reviews on","useful":1,"cool":0},"e5cEY71Fa0wr3ODPnwClQA":{"text":"Good food, wait staff and athmosphere. Drinks were also good. I would recommend the crabca","useful":0,"cool":0},"cfo4jEHqD1fvghFtr4vIlQ":{"text":"Went into the place got seated and waited for 20min and no one attended us. The restrooms ","useful":0,"cool":0},"VUQYsrhxDqjWQu_oGWMylQ":{"text":"Above average food, but not the best in town. Great tourist spot, but when you grow up wit","useful":0,"cool":0},"iVhZ-uY1DVCoOYAXPvPcRw":{"text":"The service was great, however the taste of food was mediocre; I'm comparing the taste of ","useful":0,"cool":0},"4OEJKYYuoGIALvbtAsbjNA":{"text":"This place was not only beautiful on the inside but the food was amazing. Try the oysters ","useful":0,"cool":0},"U082LkwTzDqlixegkvS49w":{"text":"Pretty good meal. My food came out a little cold, but it wasn't the end of the world. Shou","useful":0,"cool":0},"W311HDsKMWV6CL8ccC_KCg":{"text":"Ordered chargrilled oyster and crawfish etoufee. The oyster tastes great but is kinda smal","useful":0,"cool":0},"qdu5J5WSj1IsjN4prFyW4A":{"text":"Savanna was great with her service. The food was perfect and the drinks were flowing. It's","useful":0,"cool":0},"B8Y345NiIwYZP1Xke0SO-g":{"text":"Shrimp YaYa was Awesome!\nSo was the stuffed fish.\nHurricane was the best in NO. All freshl","useful":0,"cool":0},"CQugQzy8pZ7Znme9sKhIkg":{"text":"I visited this place last week and I was so offended first off there was this manager who ","useful":0,"cool":0},"pu15pII2d4WuffFA7tL2tg":{"text":"Food was good but the hostess was crazy rude .  Once we got past her the experience was mu","useful":0,"cool":0},"EeWMGbt6zyRXKHAAbyxHhg":{"text":"We had a great lunch!  Husband had a crawfish poboy and I had a caesar salad and both we p","useful":0,"cool":0},"2i8O0gfXUpIkxHv8dIAI9w":{"text":"First night in New Orleans.  Checked into Marriott hotel and wanted something close by.  C","useful":0,"cool":0},"_cQQnsxR09H1Kw2QcQUssw":{"text":"Tatiana did an excellent job.  She was friendly and\ncourteous.\nThe food was great.  The at","useful":1,"cool":0},"Oy7eJhfUZYqNRVvXCzrRpw":{"text":"Had a blast. In NOLA for a wedding. Gregory our waiter made the best recommendations! The ","useful":0,"cool":0},"MsD1b_1m1Ijigq2Tlo-EwQ":{"text":"While visiting home the family stop and eat dinners. The food was good, but our waiter Joh","useful":0,"cool":0},"hZnhiqSJRRVZKVPaqr_71Q":{"text":"Food was good. Too bad they're racist towards black women who expect great service like ev","useful":0,"cool":0},"zc3GJLyc0GJDtcDpe5x9Yw":{"text":"Fish and grits.  That's all I have to say way it and be transported to heaven. Fried cat f","useful":0,"cool":0},"TnpCyDR7uCmQfn3Uts2X_Q":{"text":"Don't need to write much. This place was delish. Ate the shrimp and grits and tried the ya","useful":0,"cool":0},"qrEpKb7FBqmnETdEwgG6LQ":{"text":"No fue lo que esperaba en cuanto a calidad precio. El lugar es lindo , el servicio bueno y","useful":0,"cool":0},"FJoR5AK7cAzVaoxJdKJXJg":{"text":"The service was good. I had the fried alligator (for the first time) there a few nights ag","useful":0,"cool":0},"s46dkRdxXmgWN2jY5iAsPA":{"text":"Great food.  Oysters were fresh, bayou sampler was great!  Will definitely come back again","useful":0,"cool":0},"W-sHqgBaFfoOqrO6tEOexA":{"text":"Food here was great. Service was excellent as well. Felt like prices were a little high fo","useful":0,"cool":0},"chCpmVsElOBOY0Kmds6xUQ":{"text":"A really cool location! Creole House was a decent dining experience. It was nothing crazy ","useful":0,"cool":0},"6EysUu57FFFRXobHoEYFyA":{"text":"We arrived in NOLA after a long drive from ChiTown and needed some creole deliciousness.  ","useful":0,"cool":0},"knmIB30ripCOUZX8oN96vQ":{"text":"Visited New Year's Eve, place was packed but the service and food were excellent!! We trie","useful":0,"cool":0},"tFekeQoEncxedCOme8IEQA":{"text":"I was by myself for lunch and so the hostess asked if I'd like the bar seating, I was good","useful":0,"cool":0},"LOaw6eH7secyChaCnMNwBA":{"text":"We had the gumbo and shrimp po-boy. The gumbo was good the po-boy portion was disappointin","useful":0,"cool":0},"8J-sbazdE_UpSKptFSRMUw":{"text":"Was in NOLA for 4 nights and ended up having two meals at The Creole House.  \n\nI had the o","useful":0,"cool":0},"gDsoeMBfwDwpUc9z4JtJeQ":{"text":"This Place has amazing great food right across from the hotel staying for a business confe","useful":2,"cool":0},"N5gU-GsQ4rxqxRdMcP0xmA":{"text":"Got right in on a busy Saturday night. Food was excellent, best jambalaya I've had in a wh","useful":0,"cool":0},"BDm2REQJFOJar0tOLyhBgQ":{"text":"The staff was rude! We can start with the obnoxious hostess who was so busy having a conve","useful":0,"cool":0},"67BEvlFsJYBHNSqltlnxVw":{"text":"This place was so disappointing. We had better food at a bar called Pat o Brien's! We were","useful":2,"cool":1},"g9zZAIqKZXrRqwUaugQLJA":{"text":"Love the decor and the atmosphere. The servers are very nice and polite. We ordered all th","useful":0,"cool":0},"acUizo9GeSkitdi5Pt1sIw":{"text":"The young  health White  female waiters, was outstanding (sorry I do  recall her name). Th","useful":0,"cool":0},"FiDiUMRE4uFJXeIHVOBLpQ":{"text":"Enjoyed the Cajun Alfredo w/blackened chicken.  Laurietta was a dream server!  I informed ","useful":0,"cool":0},"bb_FPQs0yB8PCKHMoZ8d8g":{"text":"Really bad service. I waited 15-20 min until I got my service --after I asked a few times ","useful":0,"cool":0},"HMKCCWW23NyJoy-t_a9uXA":{"text":"Second night in a row to eat at Creole House. Was not disappointed in the food or service.","useful":0,"cool":0},"i1gny3HYh6lh5hpqZfuRQA":{"text":"The Food was Good But the Waiter Tatiana' With The Blonde Bob She Rude As hell from the Ti","useful":0,"cool":0},"e9BYMFcvRqujDpKpffjIzg":{"text":"Stopped in for lunch during the week while attending a conference across the street. Very ","useful":0,"cool":0},"ahBHerAjeZlYu4TcvEsZzQ":{"text":"We have never had a bad experience here.  Another spot with good food,  reasonable prices.","useful":0,"cool":0},"mGXfqDCaA54Ilqx2Ik54-A":{"text":"Jonathan Cupit was my waiter and he literally changed my day. I was starving and my friend","useful":0,"cool":0},"vzu0sds1bbfjNtw4k1HT_A":{"text":"Everything was delicious here! Even the alligator  meat. Our waiter recommended it to us s","useful":0,"cool":0},"w-CfMvK9eFBhGBAN_4ZMrg":{"text":"Nah miss to Irwin that place is not a place I would recommend because of the way y'all han","useful":0,"cool":0},"bix0C0r5esKACbV17ZURnA":{"text":"Food - Visited Creole house last weekend when i was in NOLA.Food was DELICIOUS.Pomegranate","useful":0,"cool":0},"wZVgqF3ax4n5t3dmSfvrvA":{"text":"I hate giving one star votes to any business, but my recent visit to the Creole House was ","useful":9,"cool":3},"7Yz3XFdXXf17-zLMNASz6A":{"text":"Service was slow, took forever to get our food and when it did come totally forgot to put ","useful":0,"cool":0},"nZb7ZFgNcqFn00JRRFMV6w":{"text":"This is absolutely the best restaurant in town, I have had the pressure to visit New Orlea","useful":0,"cool":0},"ssiIkUvtFZRZgNx20xKjhA":{"text":"This place has great service! Our waitress Pat was Amazing! I can't rave about her enough!","useful":0,"cool":0},"Xc6BAbnwu4XqwNWtquhaRA":{"text":"Quick seating/service, great crawfish/shrimp platters, variety of oysters. Definitely beat","useful":0,"cool":0},"mSZd-X2IdvLtavFQzPezIg":{"text":"It's not horrible, but it also doesn't meet the expectations set by the 4.9 stars on yelp.","useful":0,"cool":0},"Lg6n_S-pf4oC5dAwKCS3hw":{"text":"Came in on August 8, 2019 around 7:30pm, we had made reservations the day prior for a grou","useful":0,"cool":0},"jO8q_KjzZVzPlMujClbhRw":{"text":"While walking down Canal Street as we usually do when visiting in NOLA and very hungry, we","useful":0,"cool":0},"CDWDqGUUgQGlewZZ4D0qDA":{"text":"We did not try a lot of food but everything was great I had the crab claw appetizer season","useful":0,"cool":0},"iTVcu4wza6zk4-Tc9mgZZQ":{"text":"This is my first time visiting Creole House.  My family was greeted by a very friendly hos","useful":0,"cool":0},"slCvk45it8YEAishke9HdQ":{"text":"We ate here for lunch on our first day of vacation in New Orleans. We had the Jambalaya an","useful":0,"cool":0},"fAMzZbAtLMCTJtXXFR8T-w":{"text":"Yummy!  The owners need to train their staff to be more attentive. The food was good when ","useful":0,"cool":0},"OpkDYqF4a_4tdJ2DWWw9fA":{"text":"The Crab claws and Red Fish were delightful, however the fish basket (catfish fingers) wer","useful":0,"cool":0},"T3eDhtsmbDvL3wgR-7nfJQ":{"text":"First restaurant I saw right outside the hotel.  Hostess was real nice and the service was","useful":0,"cool":0},"ObF1HhMEJtlm7A7agoI-6g":{"text":"One of the best places we ate at in New Orleans.  We ate her three different times and we ","useful":0,"cool":0},"tFDaDgMogzHCra3q-DL9FQ":{"text":"Very very casual place. The servers are too casual as well . We were seated quickly but it","useful":0,"cool":0},"SjdfRbIU3x5smeWIS7kO6Q":{"text":"This place is on Canal Street, in the middle of everything you would think this food would","useful":0,"cool":0},"AI-oCy_bsup3B6RTkRPfJQ":{"text":"We got seated right away and our server was very attentive. I ordered the fried shrimp wit","useful":0,"cool":0},"3ws2PNhcfM3clCU7ywhP6Q":{"text":"Inside and outside dining available, the food was great and the didn't take forever even t","useful":0,"cool":0},"-lQXAMhWt5_OH3cQSckDRg":{"text":"Went here for breakfast and had one of the benedicts- food was amazing. What made the expe","useful":0,"cool":0},"a4_w8gckCtB4vpJNpINVhw":{"text":"We visited NOLA not realizing that it was the same weekend as the Essence Festival. It was","useful":1,"cool":1},"Yya3IJ-sVKG3zJCAHtGDrQ":{"text":"Again this app keeps deleting my text as I write. \n\nIn summary:\n\nSandwich bread was dried ","useful":0,"cool":0},"2sk4MwGraqXXlEN2U_oX3A":{"text":"Service was great! They were on top of everything. The calamari & French onion soup were p","useful":0,"cool":0},"_KsEAF5Tul4ujcS3BotjcA":{"text":"Leon our waiter was top shelf.. best waiter in New Orleans.. the food was awesome but the ","useful":0,"cool":0},"mfqeAvu_KslttCKoHGXeKg":{"text":"A friend and I was walking down Canal looking for food. We were greeted by the hostess who","useful":0,"cool":0},"DHX0MNhb5E0PCSN-OOreaQ":{"text":"Fantastic food, drinks and service! Had the Prohibition Punch, Shrimp Ya-Ya and the Taste ","useful":0,"cool":0},"yNPx4ISTQd7AjDcsAKhy0Q":{"text":"Great place to eat! Love love love the shrimp ya ya. I must get! We also got the bayou sam","useful":0,"cool":0},"rm0AlXmFgFN10by6nfaxdw":{"text":"Great creole burger, wife's dish looked good (jambalaya pasta), nice ambiance, soft music ","useful":0,"cool":0},"6IfXUf8erUMRq9VL3FGQDQ":{"text":"Loved the food and atmosphere. Our wait staff was great.  In walking distance from the Hot","useful":0,"cool":0},"DqGGpTSU_A5tXoVhUaCDDw":{"text":"My fiancé and I loved our dinner! On the recommendation of our  server Deborah, we tried t","useful":0,"cool":0},"ke11rwTKUZkhXT66LQ4Ocw":{"text":"Great restaurant. The shrimp and grits were divine. I had a lemonberry drink with absolut ","useful":0,"cool":0},"iyMDoZBE1gybBheyvaaVWg":{"text":"ordered the gumbo and fish po boy. everything was delicious! our waitress was extremely sw","useful":0,"cool":0},"lQ2hxcfnHI2bhG68wvnAeQ":{"text":"The food here was mediocre the service here was horrible took forever she didn't listen to","useful":0,"cool":0},"99_BSAJ0mA2LV1ueBpBzJA":{"text":"Can't really say it was good it was ok at best. The food was cold and soggy. It all tasted","useful":0,"cool":0},"IviVixNbvqiL-C0FUNpKOg":{"text":"My company visited New Orleans for a tradeshow happening at the convention center and I wa","useful":2,"cool":1},"hsWZeyDKd9CJp3GwZaW0ow":{"text":"The food was amazing and Jeramiah, the bartender was Great!  Everything on the menu looked","useful":0,"cool":0},"RU7ovYtGy-80AlmlPd7Sog":{"text":"No wait line was a great change, restaurant feels spacious due to high ceilings, we got th","useful":2,"cool":2},"l3ERP0L-nsS2FT2fUSGGog":{"text":"This place is really good drinks was great food awesome and service phenomenal. Our serve ","useful":0,"cool":0},"Erix8q9V2824UPvfpKgIBg":{"text":"The food was good here. The service was ok, but not great. We just came in for sandwiches/","useful":0,"cool":0},"RzladAwTLpusC1av3y35IA":{"text":"I stopped here because it is close by the hotel, but the food and service (thx Corey) has ","useful":0,"cool":0},"IdvXRJyAtGIxNJy9ohVJEA":{"text":"Went for a light dinner. I had the grilled oysters, and they were good. My dining partner ","useful":3,"cool":1},"_Hg7l6gKs5d4Ih_tl_fL0w":{"text":"Excellent food, fine drinks, no wait.  I definitely recommend checking it out.  Po-Boy shr","useful":0,"cool":0},"_LpTYjfX-3n6cbXyz10Fcg":{"text":"The staff was rude! We can start with the obnoxious hostess who was so busy having a conve","useful":0,"cool":0},"7TBwRozqOeK3XSx2BA6M6g":{"text":"Just arrived in town and decided to get lunch here. I had the shrimp po-boy and my wife ha","useful":0,"cool":0},"0mC3Z-xxnlvwihdQB5EwUQ":{"text":"It was a lovely Sunday afternoon in the Big Easy. We went to a brunch spot and the waitres","useful":0,"cool":0},"ZB_nosmofuXX5JULcOaJ1Q":{"text":"Food was good. I think i must have picked the wrong night to go or maybe it was just to la","useful":0,"cool":0},"5fy6a97v1jnBx0y_KGObcg":{"text":"The food was amazing! I had the alligator Po Boy with Cajun fries. I tried the oyster for ","useful":3,"cool":1},"iG32m0vnjTuW17aeQRUtaQ":{"text":"This was the first place that we ate at upon arriving to NOLA. It was right around the cor","useful":2,"cool":2},"BZSe4n85Te9kDpw_QhNl8A":{"text":"Let me start with the best - the waitress and manager , very helpful picking out drinks an","useful":0,"cool":0},"hdlBI8tIzm6Bjhn88eUffA":{"text":"The bacon cheese oysters are heavenly! \nRob-  just give Kelsey the Creole house car alread","useful":0,"cool":0},"OCqIAgDGZkUErFat9SmB_Q":{"text":"I had grilled oysters and they were very well seasoned. I recommend getting these , the at","useful":0,"cool":0},"dA2UbBZBNE1jxTOxNRDe6A":{"text":"We got the calamari and shrimp fettuccini Alfredo pasta. The calamari was okay, over bread","useful":0,"cool":0},"FxlSQfkryrH-GmJzlgfoDw":{"text":"Stopped by here for breakfast. Brittany was our server and was a great server. She also an","useful":0,"cool":0},"HUdULLiNPFpSV3R6l-1ntw":{"text":"Everything was mediocre.  Service was good but the waitress's shirt became progressively d","useful":0,"cool":0},"BnqXhTrDjSsu0V1KGCvXIg":{"text":"My first time visiting and dining at Creole House. We were warmly and promptly greeted wal","useful":0,"cool":0},"c3_xoVSvponZ0USnGJHaXg":{"text":"This was the Cajun Crabcake and Shrimp Alfredo. It was delicious! My homegirl had shrimp a","useful":0,"cool":0},"GI7OppG6B6_Q-SgH8tgiSA":{"text":"Great food, excellent customer service and friendly.  Our  hostess was very knowledgeable ","useful":0,"cool":0},"4lYf9zrWmi4s8H4od7k3bw":{"text":"So when we arrived there was a wait and we were told it would be about 40min. The time wen","useful":0,"cool":0},"j5RDkgOvZ_oQUuVgtA-kiw":{"text":"Not impressed with the food or service. Our server was good, but not great. The food wasn'","useful":0,"cool":0},"ZD5QgLvcumHea9CDtkm4vg":{"text":"The wife and I love great food and this place without a doubt has plenty of that.  But the","useful":0,"cool":0},"T3m92vxIo2mCyDZGYgYhDA":{"text":"Came here in March of 2019 around 8:30 pm with a party of three. \n\nPros:\n- Lively atmosphe","useful":0,"cool":0},"y5Y2a_L5Vtpn9QCOLo5X7Q":{"text":"The food was amazing.  I had the oysters on the half shell and they were huge and tasty. I","useful":0,"cool":0},"_4wNm-xp8gXNsHakj8vifw":{"text":"My sister recommended that I try Creole House for shrimp and grits. So glad I did.  I'm vi","useful":0,"cool":0},"i3wed7cXMkgPMYYI1QA01g":{"text":"We stopped for dinner our first night in NOLA. Food was good. Breakfast next morning was a","useful":0,"cool":0},"uDhZ7Rpyw2fbsz6yr-iPAw":{"text":"Went on a 13 day vacation to many places, including a cruise, and my favorite dish by far ","useful":0,"cool":0},"frWaq4pwrKiK705At3HF3w":{"text":"We had a terrible experience with everything at the Creole House Restaurant! My friends an","useful":0,"cool":0},"Ku4G4rHggDyzfC9DblZSyA":{"text":"Nothing to write home about here, the food was average at best. The service was pretty goo","useful":1,"cool":0},"63CaD22tsFkuP9LaeRrPTA":{"text":"This restaurant is so conveniently placed by the Sheraton hotel that I almost didn't bothe","useful":1,"cool":1},"20xWpH-wEmu7EykfTr2umw":{"text":"· Stale po-boy bread\n· Hot sauce bottle had no lid\n· Bare utencils set directly on table\n·","useful":0,"cool":0},"OKIm5tuCqc4XcGNFYjQBIA":{"text":"Average place. The staff was great by the ambiance was mediocre at best. We had the fried ","useful":0,"cool":0},"byCpUh3p3_ZP5WiMDgjOcA":{"text":"Outstanding food and service. Seating right away on a busy night in the city. Crawfish cak","useful":0,"cool":0},"Ye42LbeIko8G63gxg7SUoQ":{"text":"Outstanding service from Jasmine.  Friendly and attentive.  Great atmosphere and very clea","useful":0,"cool":0},"WhKc2rR3lwZMJGoMcsdcEQ":{"text":"Amazing time! It was so delicious and the atmosphere was even better. The host and hostess","useful":0,"cool":0},"HN91puKs-hBdIcodFGJhtg":{"text":"This place is very good! We were walking around and found it, very convenient to Bourbon S","useful":0,"cool":0},"-0OOuckEPdPOGq8PZiqaOA":{"text":"Lets talk about the chargrilled oysters first...damnnn those were some finger licking oyst","useful":1,"cool":0},"LOgDVQ5AiIi4mGIpObyDjw":{"text":"If you like bland food, this is the place for you.\nThis establishment is an embarrassment ","useful":2,"cool":0},"2p-gpe3JrIjqLYNyxs3cVA":{"text":"Yep. I got over the slightly costlier menu when the portions came back huge and delicious ","useful":0,"cool":0},"ElKXJ-pOyGo0S4D_he3NNQ":{"text":"We ordered the shrimp Po'Boy and Shrimp and Grits, both were fantastic! This was one of th","useful":3,"cool":2},"J5P3jsVLJSBsgeec7XL0rA":{"text":"Absolutely DO NOT come to this restaurant. We came here following jazz fest and while the ","useful":3,"cool":0},"HMl-MRln1CfVrhe24RWOXw":{"text":"We were very disappointed with the jambalaya pasta. The chicken was cold and lacked flavor","useful":0,"cool":0},"7LeYrwAm40BkNALuvK6Z8A":{"text":"In New Olreans for business. Great food ! Great Service. Good value for your money. I woul","useful":0,"cool":1},"PkaF1rGBb-MB9IT6qLptfA":{"text":"Came here for dinner and was pretty underwhelmed. Don't get me wrong, the food was decent ","useful":0,"cool":0},"QsD6LLRWPasYgMfGIr-m2Q":{"text":"I'll never be able to give a restaurant down south a 5 star rating if they don't have swee","useful":0,"cool":0},"cZzIHGUlM37nHSKVsjI70Q":{"text":"Best shrimp & grits We've ever had!!  Close to CBD hotels, trolley line, and Bourbon Stree","useful":0,"cool":0},"cOgVyWPa8ih1Vt1KINYzEg":{"text":"Man oh man I tried them oysters Nawlins style and cant stop thinking about how delicious t","useful":1,"cool":1},"xomIfZzEdWgmb6wjq-E1lg":{"text":"What a wonderful little hole in the wall.  We came looking for good southern food and we f","useful":0,"cool":0},"eKSbVq_LWhUSt-XdjcaPHw":{"text":"Moné was an awesome serve ! She was very attentive and continuously checking on us . Moné ","useful":0,"cool":0},"RCN-9eYFWwsQDzCI51rhhA":{"text":"I'm a local and the food was ok. Not much flavor and some of the food came out cold. Servi","useful":0,"cool":0},"SDXxFSfbMwKAY7XQeuZ-Gw":{"text":"DASIA made our day---sha!!! Not even kidding, we were looking for a quick bite and went to","useful":2,"cool":0},"dztbD8RTVe6vGiTHby_9mw":{"text":"Ordered through DoorDash. Not only did it take over an hour to get my food (I got a po boy","useful":0,"cool":0},"gAn0I_s27fwctjqb2zJMEg":{"text":"Wonderful crawfish dishes.  Delightful waitress.  Noise level is high, not moderate as des","useful":0,"cool":0},"vb8VKgQPXmOM9v_H3oHEiQ":{"text":"Decent beer selection. The raw oysters were quite good. The crawfish cakes were a disappoi","useful":0,"cool":0},"8GxxJu0kcKyaXyIw6C3KQA":{"text":"Highly don't recommend to eat here. Poor staff management , food came out cold, food overp","useful":0,"cool":0},"WGttJKga7vcgRyrHoM_CFQ":{"text":"We stopped in for late small dinner after our flight got delayed. Got the sampler (taste o","useful":0,"cool":0},"Naa6fdd7B2KjB39RkDJmrw":{"text":"The waite staff and the managers were great they never left us unattended. The food was wo","useful":0,"cool":0},"-s-tP562pM2Vk7A_3-Q66w":{"text":"I enjoyed my lunch very much today. The service was awesome and our waitress was very swee","useful":0,"cool":0},"-lReTgjgG3lBKq6N8PrwRg":{"text":"Location is perfect.  Walking distance to most hotels. Price range is decent and not bad f","useful":0,"cool":0},"vHsEVUOcwKdm-lLJ7R-9Pw":{"text":"The sauted crab leg, chargrilled oysters, and shrimp etouffee (sp?) are my favorites. Ask ","useful":1,"cool":1},"reWhKLbDfJe8DxeCcd_RtQ":{"text":"We had a great experience here. The chargrilled oysters that Pete Cook is awesome! I do no","useful":0,"cool":0},"NjMdbdZEFAyLwDucsi-gJw":{"text":"The host and servers were great! Nice and polite. But the food was salty. I order pasta wi","useful":0,"cool":0},"yDlfKyUn7OZ8d6_pPBLKew":{"text":"This place is AMAZING! From the food to the service. Our server, James, was very pleasant,","useful":0,"cool":0},"Cmq1oZvdEim2Kx6IkYo3Dw":{"text":"My chair had dry bubblegum on it . There was bread all over the Seats . The creepy guy who","useful":1,"cool":0},"o0nv-nEYs7kSd6YVzsknqg":{"text":"Been coming to NOLA all my life to watch football and enjoy the city. Found this gem in th","useful":0,"cool":0},"t8rlDCCCFWeXe1ITTj0SmQ":{"text":"Came on Fat Tuesday . Busy but not too busy wait only about 20 minutes . Service is what y","useful":0,"cool":0},"59Zj7BDUYLMuENTxcMGhYQ":{"text":"Outstanding meal and service.  We happened to try this place out because it was next to wh","useful":0,"cool":0},"8NThN2pOYhd4tSZ1cTC_Jw":{"text":"Nice restaurant, killer chargrilled oysters. Gouda grits are wonderful. Quick service.","useful":0,"cool":0},"wHx73o0l-ROv-krVbxS-VQ":{"text":"Front of the house has no idea what they are doing. Half the tables are open while a long ","useful":0,"cool":0},"k9WCp-jzou2R6161rUiwvA":{"text":"This place service is horrible. Food is gross. And waitress sucked. My food was disgusting","useful":0,"cool":0},"sjiQC41HKTmvskjQB7J7JA":{"text":"Just ordered a chicken and waffle and was not too impressed. The chicken breast was a bit ","useful":2,"cool":2},"Mfewv33jt3QZ0nZHtzBX6w":{"text":"I went to this restaurant because of the high rate. I ordered the oyster platter and feel ","useful":0,"cool":0},"dSlCmaQy5LxZScjYMNh-zQ":{"text":"This restaurant was highly recommended by our tour guide.  The food was very good but the ","useful":1,"cool":0},"j3sXRm_xxufSEeUsdWVrjw":{"text":"Great service as well as the food. The creole shrimp po-boy was so delicious! I would defi","useful":0,"cool":0},"aG2NpeywUXpwMRxhvkj4dg":{"text":"While on a business trip, i came here and LOVED IT. Shirley made amazing recommendations a","useful":0,"cool":0},"-di2Fn3pDUplmPzYyzEIKg":{"text":"Second time to New Orleans and looking for some good food.  Saw a lot of good reviews for ","useful":0,"cool":0},"QRZSQfu-vWBiAOUZpZX4gw":{"text":"Even though it was 30 minutes until they close  they still seated us and we had a good exp","useful":0,"cool":0},"kenjPWMKeRMkD_Wy2Wv42w":{"text":"A convenient restaurant to go if you're out and about and need to grab a quick bite to eat","useful":0,"cool":0},"qbR4iHHdXey7MxGEFzNATQ":{"text":"The food was sub par. Definitely a white-washed (taste wise) version of creole food. The s","useful":0,"cool":0},"_oGUd63t_ReI5JBgLaDt7Q":{"text":"Here for coffee and dessert at lunch hour on a rainy Monday afternoon. They were  to serve","useful":0,"cool":0},"SZrPIIo67AB1eQ2GANkzpA":{"text":"Stopped into Creole House for breakfast a few minutes before noon as the Palace Cafe stopp","useful":3,"cool":2},"xI_kzz-SSaBo8_-QgDJ_Sw":{"text":"This place had lots of food choices and it was great. The decor was old and needed to be c","useful":0,"cool":0},"jZ98L_uoWiIlf33WlmodzA":{"text":"Had an excellent dinner here at the creole house. In all the places we have eaten in New O","useful":0,"cool":0},"plRSYnKohrD1wnVnP6K2Cw":{"text":"Bacon garlic chargrilled oysters were fantastic.  They're not in season so I was skeptical","useful":0,"cool":1},"fmg5qQ4Jj-jd-ewlwkoy-A":{"text":"Busy but we were seated fairly quickly.  Excellent food and service by Richard who not onl","useful":0,"cool":0},"dyDEOMLAya6pmZB31HXrIw":{"text":"In the mood for oysters.   Ordered drinks   Oysters. Side dish.  \nSide dish comes.   Drink","useful":0,"cool":0},"Wq7WMYoi23G2_Wf-sCY2_A":{"text":"LOVE this place. Although I'm not local, I frequent New Orleans so I have been around the ","useful":0,"cool":0},"YlBHTPfNrUgy-rhS5ost2A":{"text":"Very convenient location. The service was wonderful, our waitress was very kind and attent","useful":0,"cool":0},"De_oaHbHsI4V5bQSRviWjA":{"text":"New Orleans has no shortage of restaurants, so it can be difficult to discern which to pat","useful":0,"cool":0},"181SQG3iN8RRfNSIVUZCrQ":{"text":"Hmmm. We started off with some new orleans cocktails. Good. Then came our appetizers of sp","useful":0,"cool":0},"-6BF-YdpwU8UGGxdSnownA":{"text":"Very impressed!!  Came with a date around lunchtime and got a seat quickly, decided to sit","useful":0,"cool":0},"AxwNOYz0EozOMIkj4EgrRQ":{"text":"Great experience. Wonderful food, quick and friendly service, and clean atmosphere. Our se","useful":0,"cool":0},"QEgqp8PHCcYQtl0INs8OUQ":{"text":"This was pretty close to Marriott where I was staying so was a obvious choice for breakfas","useful":0,"cool":0},"UzLSGJfzE20gq48ChB113Q":{"text":"I'm writing this review while next to a toilet throwing up the food I just ate from here. ","useful":1,"cool":0},"DmsjblVANpQcAGytYE1m1w":{"text":"Without a doubt the worst food and service in New Orleans. The crawfish Etouffee had liter","useful":0,"cool":0},"VJJMZYVnC1njJsoED7RZaA":{"text":"My friends and I went for a late dinner/snack. They were about to close (?) and we were th","useful":1,"cool":0},"cC6mbALUVIDlvictOLEUHw":{"text":"I came to New Orleans specifically for the food and I googled the most sought after restau","useful":0,"cool":0},"9mNBhy3pe54KVwWHwRStJw":{"text":"Greeted and seated fast. Decide to crowd for a Sunday evening. Ordered a couple of Bloody ","useful":0,"cool":0},"DltarJqFRa1p3knZW4CwXg":{"text":"The food was amazing and great service too\n\nAppetizers:\nSautéed Crab Claws \nFresh Louisian","useful":0,"cool":0},"XJnh4X8ttlb7ohDP8O8pQA":{"text":"Fantastic food and service. I ordered the shrimp and grits and it was amazing. The bread p","useful":0,"cool":0},"3Lyer1aVokCTVvlhQlaMVg":{"text":"Wow are they fast.  Alligator bites were hot and crispy, gumbo and po boys delicious. Casu","useful":0,"cool":0},"ATaB66qwAcjcn1Kpa4H1ZQ":{"text":"We have the best time on several occasions while we were in NOLA!   The charbroiled oyster","useful":0,"cool":0},"anrQaFoDjHnfosEQD062dw":{"text":"My first time in New Orleans and I got to try some amazing food but this place did not imp","useful":0,"cool":0},"-CNIwdmryehABhTv_05X9Q":{"text":"This place was very good. The service was on point.  The food was great... I would recomme","useful":0,"cool":0},"EuY3pihR-_TvExZ0ykUf7w":{"text":"Do you know how to say tourist trap???!!  Overpriced food at small portions.\n\nNeed i say m","useful":1,"cool":0},"NI301HCtOZmCzZnTtm3IBw":{"text":"The food and drinks are very expensive and only average. I had chicken and waffles as did ","useful":0,"cool":0},"SohxZEqobsWlQw6MEMlhrg":{"text":"A great local place located in Canal street. It has the vibe of a diner  They have counter","useful":0,"cool":0},"cY8Qu8M_sDTFQpnjsZO2Jg":{"text":"The best thing about this restaurant was the server! Her name was Loreeta, I think. She wa","useful":0,"cool":0},"kl3a9L8mU7JJa5LG1QudIg":{"text":"I really enjoyed creole house!  The food was good and the service was excellent!  I made t","useful":0,"cool":1},"H9iMjmZ1m_zXa8_zy7_sFg":{"text":"My first time in New Orleans.... and having shrimp and grits. SO YUMMY!!!!!  I walked in a","useful":0,"cool":0},"y_8PPDPxSVzSwMZX8OLkLw":{"text":"I'm sure this place is a tourist trap, since it's located right on Canal St, BUT their foo","useful":1,"cool":1},"nMRdGoDz8ADXNSYEOfdczA":{"text":"I saw this place on Yelp and decided to check it out. The food.... IS DELISH!!! omg\nMy cou","useful":1,"cool":0},"bR1PQUOC6QmiUQUWNGTTIg":{"text":"Not good food, just average service. Needs a GOOD CLEANING. I Won't be returning. I had sh","useful":0,"cool":0},"jBEBM52YmG1DZPVphgbxuw":{"text":"My boyfriend and I visited here on a Thursday afternoon. We were seated quickly and reciev","useful":0,"cool":0},"Zmh8rI1EYBN1LutLsHgagw":{"text":"Nice restaurant. It was clean. It has an open floorplan but the tables are kind of smashed","useful":2,"cool":1},"Xa6rlAyLDcyw_k9D7ejGQg":{"text":"Don't do it.... the sauce for the crab clause is good but the quality and price tag don't ","useful":0,"cool":0},"aMw-2KhEDGENXmztJva41w":{"text":"Great restaurant that I wasn't looking for. Hopped off the streetcar early then decided I ","useful":0,"cool":0},"-9B-3FRCPSI2jYGW6rU0Ug":{"text":"The food was amazing and very reasonably priced. I had the fish po boy, my son had the all","useful":0,"cool":0},"R45f48kF8nAeBt9UT0oH2g":{"text":"Service was sub par but the crab fingers were amazing. Though the portion was smaller than","useful":0,"cool":0},"tFKjSytlbC8s3QvLYKmByw":{"text":"Had a bad dining experience tonight.  We were a group of 6 adults and 4 kids.  Came in aro","useful":0,"cool":0},"d2lW894TRoJ3u2tRSuRDpQ":{"text":"Pro:  Good location, wait staff was good.\n\nCons: Underwhelming food.  I had the blackened ","useful":1,"cool":0},"bIqMCgJceddO_hCQrEHtRQ":{"text":"Both times I have been here the food and service was amazing.  The stuffed fish and veggie","useful":0,"cool":0},"4r1XPnnUufdEKjjWFrmRHg":{"text":"What an absolute gem!!!!!! We were in NOLA for three days, and like everyone else fell in ","useful":0,"cool":0},"pDAZyNI3HVvhf-Z7g2Qomg":{"text":"Went here this afternoon for lunch. Got the creole sampler and the pecan cobbler. Everythi","useful":3,"cool":1},"58-inOdX1tiQppIZghOkvQ":{"text":"Came here tonight on a rainy Sunday night around 7pm. Our wait time was about 15 mins, alt","useful":2,"cool":1},"nZteFk0mIV3gKvWLGSN7yg":{"text":"Excellent service, though we had a 45 min wait. Food was quick and great. We ordered Creol","useful":1,"cool":0},"rnD92pNlWSjRDYk4fG0fNg":{"text":"The restaurant is open for breakfast, lunch and dinner.  The waitress was very hospitable ","useful":0,"cool":0},"sHPQr_Zsf1cMS_GwgTJSEg":{"text":"Of all the Cajun food my husband and I have ever eaten this place is the best. The sampler","useful":0,"cool":0},"5jwhZZBfzxZ41zrodEz8bQ":{"text":"Fried gator - very good\n\nBacon garlic oysters - I do not eat oysters but tried it for the ","useful":0,"cool":0},"vXG8WqgyPe4b00UArYmfKw":{"text":"The food is terrible. We ordered chargrilled oyster which we ordered in very single seafoo","useful":1,"cool":0},"PgjfRu88KSh6IiUSxMQYyw":{"text":"Shrimp and grits and creole stuffed fish filet were both incredible. Recommend 100%.  One ","useful":0,"cool":0},"PmXHEUV1G20ue2_6oa-YcQ":{"text":"We were on our way to our hotel when we saw the hostess and servers said hi and were very ","useful":1,"cool":1},"Hndwz1lby5jMeB42Ce-B_Q":{"text":"The appetizers and drinks are good! The rest...ehh! The cajun pasta is like jarred alfredo","useful":0,"cool":0},"ztcQK_vUTmSzOVNUqtI4Lg":{"text":"This place is right next door to where we stayed and was awesome!! Had a great selection o","useful":0,"cool":0},"i-HBHPx2bkNDLtDDw5dkuQ":{"text":"By far one of my favorite restaurants in Nola. The crab claw dish is unmatched and will be","useful":0,"cool":0},"_aDV_Xeta3rNAbLgwQTeYQ":{"text":"Here as I type this... lol servers super sweet and attentive. Shrimp is not cleaned. I ord","useful":2,"cool":1},"7B9EXp9ajxU9szyJqAKhaw":{"text":"Chargrilled oysters and redfish entreee was exceptional!  Will love to come back!  Good va","useful":0,"cool":0},"gTZEL5AHVvuU-W1H6ySf2g":{"text":"Haven't been to NOLA for a awhile and this was just what I was looking for! I had the crab","useful":2,"cool":1},"-po5dJdtT6gmSDcJr0h9LQ":{"text":"A really good spot and my favorite in New Orleans. This spot has everything I wanted and e","useful":0,"cool":0},"3tsUfD2Qc7beB_KVHKCAtQ":{"text":"Only thing good about this place was the staff, they were incredibly friendly. \n\nThat bein","useful":0,"cool":0},"AGuE1MDlAq0gmRFvRC7eEw":{"text":"Checked this place out on here and it had great reviews so I decided to try it out. Ordere","useful":0,"cool":0},"pKUJa1pZpD8Ml8bynG-9sA":{"text":"What a find!!! Great food, the best service, and right next door to the Marriott hotel.  T","useful":0,"cool":0},"JrHdTOkG3X9D7Dml6H0Hpg":{"text":"Omg we ate here as often as we could. I am obsessed with their shrimp and grits. It is exc","useful":3,"cool":1},"mlU5eN231OCu8ewOfAZ43g":{"text":"Stopped here for lunch and was seated immediately. The place was pretty empty when we got ","useful":0,"cool":0},"vZJTLQ3atAOeVywIBepWsQ":{"text":"The staff was friendly but they are too busy socializing than serving their customers. Som","useful":0,"cool":0},"Q8gjQu1sI0Z_S3OkLY5-8g":{"text":"Had the shrimp and grits.. LOVED THIS DISH!!  I was a little nervous getting this dish at ","useful":0,"cool":0},"W0y5aS4G6pWCE4X6jjB90Q":{"text":"I forget who told us about this place but they told us they had the best bread pudding in ","useful":2,"cool":0},"ty4mehB7D5f8ggemkPJt-g":{"text":"I was in town three nights and I ate here all three because the food was so good. The shri","useful":0,"cool":0},"svu-xeptcpNWBxi7ClgB7w":{"text":"They're food is always delicious!! We eat here every time we're in town. Charbroiled oyste","useful":0,"cool":0},"UTqjDb-9digMJnDg2mthuw":{"text":"We placed an order to go and returned to our hotel a few blocks away to eat. I ordered the","useful":0,"cool":0},"yrDtxSPHqOeOJZGMlPMRxQ":{"text":"I stopped in here with some friends for breakfast since we were staying in the area. We ha","useful":0,"cool":0},"gU8SPSBogJYKBSivCoOGOw":{"text":"The steamed vegetables were good but my crab cakes had small pieces of shells in them. Ser","useful":0,"cool":0},"-AhN-glDJgMyFYdv3lfY4Q":{"text":"This is a great place to go in New Orleans that embodies the taste of the culture without ","useful":0,"cool":0},"BS_gffahzJfX1Wicn2MVKg":{"text":"Our first time in New Orleans and this spot was great. Crab cakes fir appetizer were delic","useful":1,"cool":0},"jaV2wayBT5cS08lHsP4MNA":{"text":"Ok. Here you are in New Orleans looking for a good Canjun Creole meal. This restaurant is ","useful":2,"cool":1},"T9I2JbGGi9wNXt1IMmRHUA":{"text":"Really enjoyed this place. Casual and friendly. The oysters were the best I have ever had!","useful":0,"cool":0},"J766vIawyjFKLPDW5b4dFw":{"text":"Great food and speedy service. My wife loved the oysters. The drinks too, were pretty good","useful":1,"cool":0},"WD63LaMFKyrU5pqfYzFjFw":{"text":"Same food that can be found anywhere but at much higher prices. Slow service. The bathroom","useful":0,"cool":0},"EMrvgRnhlhkUZ-fcsdF6Tw":{"text":"Very attentive service from a singing waiter.  He had great menu suggestions and friendly ","useful":0,"cool":0},"YS0hUgaiMwpSzJ1Ln4Eibg":{"text":"We were walking around Burbon street and walked in on a whim. Our waitress was incredible.","useful":0,"cool":0},"bGXgoUIKoqQxjM885PmvAQ":{"text":"Conveniently located across Sheraton, it's not too crowded. We came for both dinner and br","useful":0,"cool":0},"We1FFmX2FmYo3PChqjgQfQ":{"text":"We ate here 2 nights in a row. The first night we got the Sampler Plate (Jambalaya, Gumbo,","useful":0,"cool":0},"s1yBPX40OcmLWyc3k3palg":{"text":"Oh my!!!! This place is absolutely amazing.... you have got to try the Bayou Bowl. The atm","useful":0,"cool":0},"VmkTxzRfCnRAQCUlHQfRnQ":{"text":"The service was very fast and attentive. The was both very tasty and visually appealing. I","useful":0,"cool":0},"wUg-vfZee_8Q0skZSkKluQ":{"text":"On a conference at the hotel nearby, us girls who have various diets decided to try out th","useful":0,"cool":0},"3YxusswNH3yB4yRTeXDNFw":{"text":"We were on our last of 5 fantastic nights in New Orleans and were dying to try some local ","useful":1,"cool":0},"znhMKfWAxcsFfJ_3f408tQ":{"text":"This place was excellent! The service was great, even eating at the  bar. The crusted  rEd","useful":1,"cool":1},"HqKIPquXb_dmEYlWTXAhaA":{"text":"This place is horrible..DO NOT GO HERE... not accommodating at all.  Our tables were uneve","useful":1,"cool":0},"RQM2H75vMnT1oHo9AgrNMw":{"text":"Roland our wonderful and informative server was super. The food was absolutely great. Had ","useful":0,"cool":0},"uFMy32B8g7e7kR0gnodMHg":{"text":"My cousin and I landed in New Orleans just after lunch, and darn if we weren't starving!  ","useful":0,"cool":0},"-1R0NMytMme61v14AMFlUg":{"text":"First time here enjoyed an evening in the French Quarter. The waiter was nice and the food","useful":1,"cool":1},"oaNvHQGkDmghDXuuju_fpA":{"text":"I saw this place got stellar marks so I decided to give it a shot. I got the Sautéed Crab ","useful":0,"cool":0},"ITTqgO7TIc9G4rVrffOwcg":{"text":"The fried calamari appetizer was a tiny portion size, but the rest of our meal and service","useful":0,"cool":0},"kT8HvMC_z7bpkxHE99V0eg":{"text":"One of the best meals I have ever had. I was brave enough to try the fried alligator and i","useful":0,"cool":0},"AXQBrOF_VqE8Td6-qKAS3Q":{"text":"We stopped in one night after a long day of exploring the city. We were seated immediately","useful":1,"cool":1},"b2jIuhfDAV0ge1cnA-RuEQ":{"text":"Fun atmosphere, good food, large potions. Nice breakfast/brunch menu. Service a little per","useful":1,"cool":0},"rODPXng9Ccxz9F_4XDFUuQ":{"text":"Lunch was amazing! I had the shrimp po boy and husband has the smothered red fish! Definit","useful":0,"cool":0},"OpxOpoDVj3X1tC7ywZ6jIg":{"text":"We have tried the grilled oysters in 3 places now, one being Drago's. Come to the Creole H","useful":1,"cool":1},"TRD9Xr76xWunOQmgmcq4QA":{"text":"This was our very first stop when arriving to New Orleans. The Creole style cooking is wha","useful":0,"cool":0},"sOGIatmol1ujKNs29yaGfQ":{"text":"Recently opened. Fun staff. \nWe stopped by at random and sat at the bar. Crab cakes app wa","useful":0,"cool":0},"IDiprjWL8yP1hMYT1kPlGg":{"text":"Awesome grub, great atmosphere. Looking for solid local food, all the good stuff you'd exp","useful":0,"cool":0},"qeiqCNtA3FRhZzsksjq76w":{"text":"I haven't gone to many restaurants on this visit but the food and staff here are the best.","useful":1,"cool":0},"P4SsX4a-2LTw068oACQsrg":{"text":"I was looking for a seafood spot within walking distance of my hotel, and found Creole Hou","useful":0,"cool":0},"AIZUvsvYtCZ7kUzDtZvupw":{"text":"Awesome food, awesome food service at the bar.  Had shrimp and grits and pecan cobbler!  B","useful":0,"cool":0},"7I8GDPTh88m0yOHZHfZVYA":{"text":"Worst food and service I've ever had!Horrible start to my vacation and so disappointed tha","useful":0,"cool":0},"ddMGXQq7ikMdp3WCCV63eQ":{"text":"Fast service and fantastic food. I had crawfish etouffee and it was true New Orleans Creol","useful":0,"cool":0},"ZCfV7vrRz-bjKJiKk5IaIg":{"text":"We had a pretty straight forward experience. We dined in we got our food quickly and were ","useful":1,"cool":0},"kYBrIAdZmAXeexHrwieCtQ":{"text":"I was in New Orleans on a business trip recently where lunch was not provided.  I checked ","useful":1,"cool":1},"tyAFlxTGBeyghJ5a7qOOuA":{"text":"Found this place walking on Canal st. It was a busy Saturday night, LSU was playing 'Bama ","useful":0,"cool":0},"ILxE2jU4K_VY0yseWMbGrg":{"text":"Great spot close by to our hotel and the main strip. The wait staff was friendly and the f","useful":0,"cool":0},"zo-l3hNvIqi8SP--D64cWw":{"text":"It's unbelievably confusing to me how many good reviews there are for this place. Stopped ","useful":0,"cool":0},"_urDY9_3GoyCKlBAQkWQDw":{"text":"I had such high hopes for this place and to be honest the food smelled amazing but the qua","useful":0,"cool":0},"in8dNUl34kLoNurcyWzAtw":{"text":"3/9/19..Terrible service from server to management.  Took 20 minutes to get water and drin","useful":0,"cool":0},"8vOULeIKDH6LAQjTlgQ07Q":{"text":"Location; Super close to Bourbon street, within walking distance from our hotel.  Large re","useful":0,"cool":0},"OQZioWxA3MR_pYfCMgJRWg":{"text":"We ordered shrimp tats, fried alligator, oysters on half shell, Taste of Bayou (4) and fis","useful":0,"cool":0},"vRt9KSzxZmm0rlmvdms60A":{"text":"I got there Crawfish E'touffee'  it was  good but the gator bites was mostly batter they w","useful":0,"cool":0},"au888ZW9SeGyKI1w55hnAQ":{"text":"What a great way to start our visit in New Orleans! We had lunch here with friends and eve","useful":1,"cool":1},"qPDwqCbmb7VaT5-lQcVevw":{"text":"Food was delicious! Started off with the French onion soup and the char- grilled oysters. ","useful":1,"cool":0},"HTjzDywX90lI8NM_TwsW3g":{"text":"Wow I've spent 3 days cruising up and down the square and The Creole House has THE best Ch","useful":1,"cool":0},"F3yEOjJAsRWkQv-Xc4a3lg":{"text":"I can't figure out the ratings on this place.  Compared to other places in NOLA - I would ","useful":0,"cool":0},"xa9hAOnTdW7LQQFgU0orKw":{"text":"We came in here for drinks during the Canal St parades. The men behind the bar and grill w","useful":3,"cool":2},"AMzpcGwJBwgr_Z4srCk-rA":{"text":"The wait staff was awesome as was the chef. We really enjoyed our meal as well as the atmo","useful":0,"cool":0},"auD-4m9T1iD4CejIUEqB1A":{"text":"This restaurant is THE WORST!! After investigating a putrid smell coming from our food, we","useful":0,"cool":0},"5gyzJ_ifdccc7E1mxJ2tZg":{"text":"Ask for Jonathan. He's an incredible server and might even sing for you! Oysters are great","useful":0,"cool":0},"mEX1t6YrB3oQPhMlIeYJgw":{"text":"The crab claws were delicious.\nChicken Alfredo was good\nThe dressing from the stuff fish h","useful":0,"cool":0},"kui92KA6iPJX0FgO2gjGXg":{"text":"The food is alright. The looks is better than the taste. I wasn't that impressed with my d","useful":0,"cool":0},"98iOGvBmK48fVSSADi2mng":{"text":"Our first night in New Orleans was so much fun. Creole House was directly across from our ","useful":0,"cool":0},"wZyWYR7XtDZBZjrT2a5O1g":{"text":"The place to go for breakfast\n\nOysters and eggs, on a Benedict dish with creamy side of gr","useful":0,"cool":0},"vdfyvebInLY77pUzh38-Gg":{"text":"The Creole House is amazing. We went there twice and had a great experience both times. Th","useful":0,"cool":0},"S-v2688QVdhgp9zWdymyoA":{"text":"I split the boyou bowl and the avo toast! Both so good! The sauce in the bowl was amazing!","useful":1,"cool":2},"rPiiHqwiGR0jaZoryXqUgg":{"text":"I was visiting New Orleans for the first time and was eager to eat some authentic creole/c","useful":0,"cool":0},"5EoMKMQyIqhOUl3sAkr9nw":{"text":"My girlfriend had an amazing time here! Wonderful oysters, pasta, and crawfish! But the be","useful":0,"cool":0},"vuMTzRPOcOz-C97NykhBZQ":{"text":"I've been to this place twice while visiting New Orleans and it's not too bad. I've only c","useful":0,"cool":0},"Uxo_-Ap9JYpOPXNoranAJA":{"text":"So we arrived in NOLA after a quick 2ish hour flight from DIA and checked into the hotel. ","useful":0,"cool":0},"Zh-j_lxSFK0Nv3vJ2b4U9Q":{"text":"Great location and great New Orleans cuisine right on Canal! Sit at the bar and let Kyle w","useful":0,"cool":0},"znfDjXLQZarPM1qZ-JTBig":{"text":"On our first full day in NOLA we decided to go to the Creole House, which was 2 mins walki","useful":0,"cool":0},"rObtjBCRq2wwQTi6NHVAew":{"text":"What a great place to stumble upon while walking down Canal Street!!!! This place as my hu","useful":0,"cool":0},"kgV5bR2ljUFuGNtUx55Ung":{"text":"We stayed at the Hilton and upon arriving yelped a spot to eat. This place appeared to be ","useful":0,"cool":0},"YKPNo6HI4yKWqwO-B3CSsA":{"text":"Hannah is the best she's the best server in the store hands down and the manager devon was","useful":0,"cool":0},"q2yK7XbaZ013rvtwzv20UQ":{"text":"We were a group of ten exploring downtown, and Miss D flagged us down saying she had a tab","useful":0,"cool":0},"-KUrPxGV5YEA0KklHPmrcw":{"text":"My colleagues and I are in town for a professional conference and decided to try this plac","useful":0,"cool":0},"qkjiouQIDL7IQv5JIj53zA":{"text":"Its been awhile since going hear but everything in New Orleans is good.  This place was no","useful":1,"cool":1},"w39c6EqZHOWcqwjguFw-6g":{"text":"Creole house gets 4 stars from me \nTo begin we arrived and was greeted by the host Tanisha","useful":0,"cool":0},"hFh5bapvTzcXLp6P8WdnqA":{"text":"Sorry that I started eating, but the food looked too good!!! The gulf omelet was amazing!!","useful":0,"cool":0},"9SAUySUF8Uh7Syqd9MfZJg":{"text":"On the corner of Canal and Decatur, you will find the Creole House. They have indoor and o","useful":0,"cool":0},"_-K_4Pk15JOb1WcRTDLDTA":{"text":"The food was okay (oysters good; small portions for cost with entres; my crabcake was nond","useful":0,"cool":0},"gSw57iwfgbnsGpODcMFHhw":{"text":"Came here for dinner and got seated right away.  We ordered 2 hurricanes which were very g","useful":0,"cool":0},"38kEowJAYfHzOT7oyHF9rA":{"text":"Great food and super friendly server. However service extremely slow. Took an hour from ti","useful":0,"cool":0},"THm1vTO8310WzL-QN5FoWw":{"text":"Came her twice during my most recent NOLA stay. First night I had a crawfish Po boy and it","useful":0,"cool":0},"kh7g7Oeck5F16MPYrC_YcA":{"text":"It was our first time visiting NOLA and we definitely felt the southern hospitality everyo","useful":1,"cool":1},"0OGEJftDabGjkuv7vF_LsA":{"text":"Excellent all the way around. Tried the sampler, fish, gumbo and another ... wow, just exc","useful":0,"cool":0},"_bHSTk9H3UqOuriDXeTKrw":{"text":"My boyfriend and I were looking for a place to eat and we stumbled across this place at 3:","useful":0,"cool":0},"LIPg9oUsJ24Yg3IC-56CnQ":{"text":"Great breakfast/lunch spot located on Canal street. Known for their chicken and waffles an","useful":1,"cool":3},"qG1Qthj1O6LD6RxisoDRqQ":{"text":"Ok dinner...oysters had lots of broken shell in them and was disappointed. Average food an","useful":0,"cool":0},"rFUHyqIewSV3aJsGMxmksg":{"text":"We just finished our meal, waited for about 10 minutes for the waitress to clear the table","useful":0,"cool":0},"jctShzmDv_ONS1lfw3qOrg":{"text":"Great food and even better service....We sat at the bar and had a great cook n server... w","useful":0,"cool":0},"o4Q3LJR5F0_QaqO20A81Mw":{"text":"Delicious food! Very kind service.  I recommend the margarita from the cocktail menu to dr","useful":2,"cool":2},"kZ_T6cf_86e3h4rbbrMhZg":{"text":"Management and servers were so nice and friendly. They took care of us and answered all of","useful":0,"cool":0},"8R4_dbinWojeNZ6cHCn-7g":{"text":"During my recent family  trip, we had the extreme pleasure of dining at the renowned \"Creo","useful":0,"cool":0},"Pu1ayAh4YJaCBagO7PpBkw":{"text":"The worst service I have ever had at a restaurant. My husband and I waited for 20 mins aft","useful":0,"cool":0},"8pThS8rfg7EfwIA8avHg8Q":{"text":"When walking down Canal Street, this place always has 20 or more people waiting to be seat","useful":2,"cool":0},"Yh-eF-95GVFcz0yHQRb8AQ":{"text":"This roast beef po-boy was massive, the meat was tender and well seasoned, the French brea","useful":1,"cool":1},"-ovCIpF6AoVluyJkLOrf5Q":{"text":"Had to wait approx 10 mins and ask for a waiter before ours came by.   Food was good, not ","useful":0,"cool":0},"92BamOQL2w_C6ExmV6Crbw":{"text":"No wait on a Thursday evening. The hostess was gracious and gave recommendations for a few","useful":0,"cool":0},"odS1Iru8htn6W5yB2qVrCA":{"text":"I was recently in New Orleans on business and I ended up eating here every day. Partly bec","useful":0,"cool":0},"zvqk4fdByx3z3yznGHp7Sg":{"text":"If you get nothing else here get the pecan cobbler. Oh my God. We forgot to take a picture","useful":0,"cool":0},"iD4QtlWpF_Jhrl9UsmlzwQ":{"text":"Most people come to NOLA to drink their way through the city... we ATE our way through the","useful":0,"cool":0},"8ofKHKDPGvjf7qd1gJZq4g":{"text":"First time in NOLA.  Went for dinner and had a good time.  Comfortable atmosphere, friendl","useful":0,"cool":0},"U9fNhbAaNiDzDS4X0jnN1w":{"text":"This restaurant was located right next door to our hotel and we weren't disappointed. Adri","useful":0,"cool":0},"gMytc9kjXivL6bFZ94C_ZA":{"text":"While the Manager, DeVonne, offered to make it up to us on our NEXT visit, our negative ex","useful":0,"cool":0},"_Q8Vql68kdRUaKe1L7HaqQ":{"text":"This restaurant has amazing food.... I was on vacation and stayed at a hotel walking dista","useful":1,"cool":0},"kVE_CZJuHg2b3fnwEWTadA":{"text":"This was my first meal of the trip. Wish I would have waited. It ruined a few meals that w","useful":0,"cool":0},"oyEJXCdr6MfcZ3plOqO7YA":{"text":"Great service, Shirley was on top of it.  Food and atmosphere were on target.  Will defini","useful":0,"cool":0},"LOSxQtNaZoFN_pd2j_Gt7A":{"text":"My experience was below expectations based on all the 5* reviews. I didn't mind the wait 1","useful":1,"cool":0},"1nnyFYMgTMO50xyBr3RQMw":{"text":"This restaurant is located in the busy Canal st. The staff are very friendly, and our Stev","useful":1,"cool":1},"WeytyBN9gBMo1NkLNcmitQ":{"text":"Food is just OK, but service was a bit inattentive. Shrimp and grits were dry, as if they ","useful":0,"cool":0},"ixMfkPQQuNtxA0NOpqMHSA":{"text":"We went here got lunch, across from our hotel. It was delicious! I had a spinach and apple","useful":0,"cool":0},"YaTxH_uayqubwHa6ChVopg":{"text":"I dined there a few days ago for the first time and enjoyed everything. Our server Asia wa","useful":0,"cool":0},"8lDQNNX9P_bjbPBs_e6ABg":{"text":"The Creole House is amazing. We went there twice and had a great experience both times. Th","useful":0,"cool":0},"M0_m_3_tku7zSw0N1I4jPg":{"text":"Food was amazing!! 4 stars because of the service. Honestly, if this was based on service ","useful":0,"cool":0},"lsFtpf8b3Fespuu-J-zyvg":{"text":"We picked it because it was right next door to our hotel on Canal street and the streets w","useful":0,"cool":0},"txFfEpiiJ5kr4oKKjlqPgQ":{"text":"From the moment I walked up to the door this place did not disappoint.  The hostess was we","useful":0,"cool":0},"y8tiy0jOMcmTAI8QtvtvTw":{"text":"This was a last minute decision after leaving Sazerac House.  Our food was good, serving s","useful":0,"cool":1},"NOgzSnE4RzWxfedPbBjKuw":{"text":"We were greeted right away by a friendly young man at the host stand. We came in around 2 ","useful":0,"cool":0},"4f9c1ACro5t8nlrZWB0vgg":{"text":"A friend of my mother recommended this place to us. So for lunch we went there, the wait w","useful":0,"cool":0},"Zth9ay4Ax--ziX-wX0-Hew":{"text":"This was one of the few disappointments during our 4 night trip to New Orleans.  So close ","useful":2,"cool":2},"UYzMp2I2fDh_JfQQMXlegw":{"text":"Great last meal before leaving The Big Easy. Oysters, French Onion Soup and the Hurricanes","useful":0,"cool":1},"KZiknI4jsrqZkFMyKL_0nA":{"text":"Super friendly service once we got inside after a short wait! Food was excellent. Place wa","useful":0,"cool":0},"FGEq154xqHuKSrHxeVoPKw":{"text":"French onion soup is delicious as is their bread pudding!! Wish I had tried more food.","useful":0,"cool":0},"mvHDI_uXYGIWwf3DIEUdlg":{"text":"We came in here 30 minutes before they closed so they were no longer seating at tables but","useful":0,"cool":0},"38LyUzt6fAP__1XIAWAlhQ":{"text":"Terrible food bland sauce and overpriced. There are plenty of other places to get great fo","useful":0,"cool":0},"mtD7Ijb02WVfdJb8SXCz7g":{"text":"Excellent food but not very good service. Very slow and not attentive. Reasonable price. D","useful":0,"cool":0},"PKd44ma4p845IIWAqZdiig":{"text":"The service was great but the food was below average diner at best. Totally wish we did no","useful":0,"cool":0},"P4188J0l_tggNRbAJb5tDg":{"text":"This place is wonderful! The service is excellent; they took our order quickly and offered","useful":2,"cool":2},"-s37epjiS0awxGFQtxnb7w":{"text":"Awful. Very expensive for a very, very small amount of food. My husband got the Blackened ","useful":0,"cool":0},"K21azKs4nvDX7OV9UHRDWA":{"text":"This was the first stop on our trip to New Orleans and it started the trip off right! Ther","useful":0,"cool":0},"hOaNlLRpQCTmdllU0hMgKA":{"text":"The staff was okay. The food was fair to bad. \nAppetizers- Sautéed Crab Claws with toast. ","useful":1,"cool":0},"0gd18jOAdcOtERDbEfX8mA":{"text":"Good food, I will most definitely be back ... I had ordered the Alligator  Po Boy with Fri","useful":0,"cool":0},"cbqQcWGDOrF2um1Qbpf-sQ":{"text":"Fried Alligator, creole stuffed fish, and canal street Ted fish was recommended by yelp an","useful":0,"cool":0},"7qr9ToHA4D7UCwwbtlFDUw":{"text":"We are not fans of oysters (shock I know) but we enjoyed this place. The food was great (g","useful":0,"cool":0},"EqT5k-S5tNRbX0M2SfMgrA":{"text":"First off, our server Kaylee was fantastic. She was on top of everything, and the runners,","useful":0,"cool":0},"a8aplmlOIP_gF1AEbjClVg":{"text":"This restaurant embodies the true heart and soul of New Orleans. The jazz, food, drinks, a","useful":0,"cool":0},"bRuCSQm7S_PwAHV-IMffIg":{"text":"Let me begin by saying I usually NEVER write reviews on businesses or restaurants but I ha","useful":0,"cool":0},"uxV-EsunGcTlIE0HiOHBQg":{"text":"Super picky so I'm always nervous trying new places but I was definitely impressed and wou","useful":0,"cool":0},"66-hd54aZZorNy6-G72KQw":{"text":"(Another late, late post). Ate here twice while awaiting/riding out the tropical storm. Wa","useful":0,"cool":1},"GedYQVm-1vQnbfLEC7Wnbg":{"text":"Came here for lunch on a Sunday in December. It was not busy and we sat outside. First of ","useful":0,"cool":0},"qJ9wcwhMnE-7bRQ97FXW8w":{"text":"First time in New Orleans and first place we ate at! Great service and delicious food. Gre","useful":0,"cool":0},"3591NdejqVMc9QEXDzKDCw":{"text":"Not impressed at all. The po-boy was all bread and dry. Very little fried shrimp and hardl","useful":1,"cool":0},"qio1da9xZOSjmWxfaljHpA":{"text":"We arrived in New Orleans on Saturday night and had just gotten to our hotel and wanted to","useful":1,"cool":1},"ALvkDW0m5vRoBO2e4CTgzQ":{"text":"Came here for breakfast a few days ago and it was sooooo good. First off the service was g","useful":0,"cool":0},"ZQyXnGhMkKXEUstAzRXcdw":{"text":"My niece and I were in New Orleans for the Essence Festival and we were starving for Creol","useful":0,"cool":0},"DvSbYASDz5-EJaRL7Ut9Lg":{"text":"Perfect location!  My son and I stopped to get food to go but the customer service was gre","useful":0,"cool":0},"xLgJGwXJimYLo_uU_quYhg":{"text":"I'm leaving this place with a broken heart. The crab cake, cajun shrimp alfredo was amazin","useful":1,"cool":0},"YVAeOG7GeSX27iuw7Wfmzg":{"text":"2 star bc there was no wait on Essence Festival weekend.  Cup of chicken & sausage gumbo c","useful":0,"cool":0},"q623kGiu2RHwvm20fc3C_g":{"text":"First time dining here and it's beyond fantastic! My Fiancé and I got the Sauced Crab Claw","useful":1,"cool":0},"SoQl7UyI5Tzd7unIOATZMw":{"text":"Overall great experience!  Server was very friendly, and the recommendation of the grilled","useful":0,"cool":0},"M_5Yjbn3qfFbv51facTS9Q":{"text":"Appetizers:\nThe chargrilled oysters were moist and tasty. They were topped with garlic, bu","useful":0,"cool":0},"cmcho3eqb8vaFuSdArCrTA":{"text":"So the waitress was sweet and the service was speedy but the oysters were terrible. They w","useful":0,"cool":0},"VSAF7mkRPgXsXwGXdJ8pvA":{"text":"I wish I had a bigger stomach to eat more food here.  Ordered dozen raw oysters they were ","useful":0,"cool":1},"ya-prPk2X3YNhSZQMrE_LA":{"text":"The food and service here was good. The red beans and rice were great. The jambalaya  was ","useful":1,"cool":0},"ex6_xbzCkcSl_xRBeMneZw":{"text":"Right off Canal st. Quick friendly service. Had 1 Dz fresh oysters on half shell. Very fre","useful":0,"cool":1},"9c4RMAtvF0SL2qjYd4Wdzw":{"text":"Great location and atmosphere. Asia was an awesome waitress. I ordered charbroiled oysters","useful":0,"cool":0},"ptpKYi9cJ3HKw30gU2Z3ug":{"text":"Absolutely no love in my breakfast and marginal service at best. Over easy eggs broken and","useful":0,"cool":0},"l6wHDWKUYDH-JSBVTcknFg":{"text":"The Grilled Oysters with garlic, bacon and cheese are to die for. The blackened red fish w","useful":2,"cool":1},"9VZXghz1hbiJtqx2BGBY1A":{"text":"Shrimp and grits great. Red Cajun fish soooo good! I would definitely dine here again.","useful":0,"cool":0},"4dJOf0JsBYdzV6qM9-2HHQ":{"text":"Classic Newlins flavor at this great establishment.  I had the \"Taste of the Bayou\" which ","useful":2,"cool":1},"QtpEuKpiXez1quMeqDBcpQ":{"text":"Stopped in for a quick lunch. Decided to try the shrimp po boy. Half of the sandwich bread","useful":1,"cool":0},"--DI7YQ4lippZx4CA4reCg":{"text":"I was extremely disappointed. Not only did I have to wait two hours to place a to go order","useful":0,"cool":0},"Hl2UpQAL2evpIIe9KIEQRg":{"text":"We walked in and we're seaters right away. The place is pretty and clean. Busy but steady.","useful":0,"cool":0},"HeDmtb_5lGmKdMjD4RbepQ":{"text":"Oysters were great, service was great, entrees (especially the redfish) were epic. Pecan c","useful":2,"cool":1},"Y0L0tu_OkClQBWQffF_g2g":{"text":"You can't visit The Big Easy without sampling some authentic jambalaya.  The options are p","useful":1,"cool":0},"Ubmg9Qqu_HbsCnW2GjLwcQ":{"text":"This place was awesome! Had breakfast here, I had the bayou bowl with waffle and it was pe","useful":0,"cool":0},"eSgcACYA48z-ZUUMGUeCIg":{"text":"Amazing food and service, we ate here two nights in a row. My guy had the Creole stuffed f","useful":0,"cool":0},"mWGFQ4_vcF9_MnQqpJFGKw":{"text":"I ate here 2 days in a row. Yesterday I ordered the gulf shrimp platter. Sorry little shri","useful":0,"cool":0},"fy859i9_ql6pM9qIkyj48Q":{"text":"The food here was FANTASTIC. My mom & I ordered the taste of the bayou. You can choose to ","useful":1,"cool":0},"rtOxc8WLSDlR6KXHPoUp_g":{"text":"Four words: RED. BEANS. AND. RICE!! (Lord have mercy!) So delicious! Great seasoning with ","useful":0,"cool":0},"8GGrUVySvSgxGQxbY8qe3g":{"text":"My family and I (group of 3) went into the place and it wasn't too busy inside. However af","useful":0,"cool":0},"HSr30IT_8lLvtxhRXBFfWQ":{"text":"In town for convention and stopped in. I had the shrimp and Gouda grits. OMG! The BEST gri","useful":0,"cool":0},"1D8PmoQCa02zG3_9q-3ZRg":{"text":"Very disappointed in the food and service. We ordered the trio and 1 dish out of the 3 was","useful":0,"cool":0},"NCAvezxJHGsksoKS80FSCw":{"text":"1 Star is too high. I live in the city, and the cost of the food is set for tourists who d","useful":0,"cool":0},"6C0dpcnBOVVHWsCPb2vH0g":{"text":"This place was phenomenal. The wait was worth it and  the service was superb. The staff wa","useful":0,"cool":0},"18MazAB_jOOLSNpnRDOhew":{"text":"I had chicken and waffles, my partner had bayou bowl. Both fantastic. Coffee was good too.","useful":0,"cool":0},"gXm-nKIFcAVNiDor139E5Q":{"text":"If I didn't have to give a star for a review I wouldn't. My husband food was cold he tried","useful":0,"cool":0},"HMAQs-JvhxX3N5hqWAUVcg":{"text":"Omg we ate here as often as we could. I am obsessed with their shrimp and grits. It is exc","useful":4,"cool":1},"dv4kD-NleTmkmqAtX2EXXA":{"text":"This was the last stop on our trip to New Orleans and man I wish it was the first. We came","useful":1,"cool":0},"_TPXdr2Nu-z-VOBvkElIvg":{"text":"Fantastic!!! My husband got the Creole House omelet, which had sautéed spinach and garlic,","useful":0,"cool":0},"gLCHXuaFFyQef34s10UvrA":{"text":"Delicious!! We had the alligator bites, garlic/butter oysters and the Taste sampler dish. ","useful":0,"cool":0},"Hide47Kekx10lF8j2wN-tw":{"text":"The restaurant was very inviting and family friendly. The hostess stood outside and welcom","useful":0,"cool":0},"av_0F2XGTWRjuS-113a8Fw":{"text":"Food was AMAZING! The atmosphere & service was great too! Couldn't say enough nice things ","useful":0,"cool":0},"XWn73AiTOnpbLwJoRjQMyg":{"text":"Was given the wrong to-go order. Unfortunately I did not realize until I got back to work.","useful":0,"cool":0},"w6QODfTg2Dd-zdkSvUmp-Q":{"text":"We only did breakfast at Creole House . We only wanted   breakfast from Creole House. Ever","useful":0,"cool":0},"VBGUoRTofeX4EBQsp1vV_Q":{"text":"Excellent service from Cajun John. He is on top of things and has the most pleasant person","useful":0,"cool":1},"y6KGJ2fysB3UDpplcygLhg":{"text":"I went to this restaurant on Friday night with my whole family. There were a total of 8 of","useful":0,"cool":0},"N4G7TKWrDwGfeUTSXlCvCg":{"text":"Food was really good. Service was good, but slow. Kind of expected with COVID precautions.","useful":0,"cool":0},"zA7s_dhdnFOighF-WPWhLw":{"text":"First meal during a visit to New Orleans. I inhaled my bowl of jambalaya and the shrimp ya","useful":0,"cool":0},"NucUt6eONAdxFk-svaFuLA":{"text":"My fiancé and I visited Creole House this past weekend for the first time. The host and ho","useful":0,"cool":0},"Btkh08UCMU7GlPjkNI5iLw":{"text":"we got quoted a 1 hour wait for our party of 5 on a busy sunday night, which is understand","useful":0,"cool":0},"Am3EFWa-rJja8GWOJCGSXg":{"text":"The Creole House Po-Boy is a paragon of New Orleans cuisine. The combination of a slightly","useful":1,"cool":0},"4amjInKn1Wm-s8QLOhKyoQ":{"text":"I didn't enjoy the food. It was simple and bland. My friends and I shared the calamari and","useful":0,"cool":0},"Cwi5HFCT3OePn2UkdUDQkA":{"text":"My first trying shrimp and grits and this place made it look presentable and soooooooo tas","useful":0,"cool":0},"l_ujNowS_dZN-tl1KwLx1A":{"text":"My wife and I ate here a couple of times while we were in New Orleans. The Shrimp Platter ","useful":0,"cool":0},"gU4cp63I5PkDkYTg85y1Nw":{"text":"I liked that they offered a sampler Taste of the Bayou on the menu and I tried the chicken","useful":0,"cool":0},"ChOkRBIxg10UUivU6Z2UaA":{"text":"I order the canal street  avocado toast with poached eggs.  It was so good!! I'm so greedy","useful":0,"cool":0},"P174_Fsfv-spVzmZheKKCw":{"text":"The lady at the front doesn't know the restaurant. Can get a reservation online and when y","useful":0,"cool":0},"ZaJGUvls0-d0b3cFHBEwgA":{"text":"This place was very underwhelming after all the amazing food we had been exposed to. The s","useful":0,"cool":0},"zX0sUw1BU_dLg8MpUl4dYw":{"text":"The staff at Creole House is hands down the best staff on Canal street! The food was delic","useful":0,"cool":0},"OogbCm12ux6WobG9gbqSbQ":{"text":"From the moment I stepped up to the hostess stand, my experience was great!\n\nDerek is know","useful":0,"cool":0},"Wbck7zwd7SKELXNKEKa7wQ":{"text":"My sister and I stumbled on this place. We sat at the bar and ordered oysters right away. ","useful":0,"cool":0},"ZolcnCcy4T1--JXRFzwx5Q":{"text":"A bit disappointed as I was looking forward to a special Valentine's Dinner.  A combinatio","useful":0,"cool":0},"BxAwCgWyOX9Tm5_yUhdpaQ":{"text":"This restaurant is located on Canal Street. We were looking for a place to eat and stumble","useful":0,"cool":0},"JYuURJRJbjU7ZVZvssHNVg":{"text":"Service was a little cold, and I hadn't packed a sweater ;D but I think by the end of our ","useful":2,"cool":2},"OiYpTbHGRqOVDBWEGTY79A":{"text":"Food was so good we came here twice!!! A short Walk to the Hilton Riverside. \nThe taste of","useful":0,"cool":0},"cwcJwZLBRAD5JrK9HbAC6w":{"text":"I went here with my FEMA strike team; we had excellent service. The food was delicious, an","useful":1,"cool":0},"HlI5buYpMegIw2srbEuTfw":{"text":"The bread that came with the oysters was delicious! The oysters however had either shells,","useful":0,"cool":0},"swtuS3TRZTzwz6Ru_3oK_A":{"text":"Really bad experience. Our waiter was rude, several things were wrong in our order, and th","useful":0,"cool":0},"mG1mjDZvLQJ9tmxOUzd2og":{"text":"My low rating is for the service, the attitude of the staff, and the cleanliness. We ate t","useful":2,"cool":0},"pbBvvb0036APajMmpl5yXg":{"text":"Food was good but service not so much! She was Not around most the time and was sitting be","useful":0,"cool":0},"-qTN72YRW2xpQxRoC7FjVg":{"text":"So I don't know WHAT is going on today. We had a party of 13 - all visiting from Texas. We","useful":6,"cool":5},"MVrOV-srL2fwG5tVl1FEhg":{"text":"Great breakfast omelets one of the best we had our entire trip.  Bottomless mimosas as wel","useful":0,"cool":0},"e-JLQAT64NZrVjY_O247dA":{"text":"This review is long overdue. I had the most amazing experience at The Creole House due in ","useful":1,"cool":1},"y3A3dLweHQVgor9tnRn9OA":{"text":"Really great service. Friendly staff but the oysters were meh. Good beer list. Not busy at","useful":0,"cool":0},"TkiPR6j5x6iOL8EsMNPGxA":{"text":"Tried dining at this restaurant at 7 pm yesterday and there was a line outside of people w","useful":0,"cool":0},"117wBEMIVWHfS_urn8RvUw":{"text":"Kelsey so deserves that car\"\" she WAS AWESOME! Thanks for telling us about the bread puddi","useful":0,"cool":0},"yCspTUdX3TFXroaXriJh_w":{"text":"The restaurant is at a prime location with thousands of reviews, we wanted to give it a sh","useful":0,"cool":0},"hwvYzfWX-l_90mLD5ZQjpg":{"text":"Great restaurant right on Canal Street. I walked over from my hotel and was seated quickly","useful":0,"cool":0},"hDSoBdwMWh6lpwfB5aZlpw":{"text":"Good was cold (ice cold). They made us ou for the food even though we didn't eat it. They ","useful":0,"cool":0},"FH4-M9AJCONIutaolmXymA":{"text":"We waited for at least one hour before we got our food, once we did it was horrible, biscu","useful":0,"cool":0},"uT__xMQslCcPJCiV69CK9w":{"text":"My waiter Johnthon was the greatest waiter in NOLA. He is personable and generally cares! ","useful":0,"cool":0},"rjep-GRpyWbqccu5RTa5Kw":{"text":"This is a great place to eat breakfast, lunch or dinner.  Good service great friendly staf","useful":0,"cool":0},"euJHzbvlszkxzTEfNhKVhg":{"text":"We went here because it was one of the only places open during Mardi Gras, due to the mand","useful":0,"cool":0},"s82me2qj7MaSl3PE_25y_w":{"text":"This place was my last stop before leaving new Orleans. The oysters were very yummy and th","useful":1,"cool":0},"h_vCfQ8Tw-JOpu0BzEag9g":{"text":"Dana W was my waitress & was very attentive and friendly. We had the incredible oysters. T","useful":0,"cool":0},"r1ZmKSwlUsD3bfLIzjVGBQ":{"text":"I'm here for a business trip for work and so many of our Uber drivers were telling me and ","useful":0,"cool":0},"9aLanQuJSbR3VDsddT63DQ":{"text":"Conveniently located, fast and friendly service, but I would not come here again. The food","useful":0,"cool":0},"H769L50TPyJiOhSvdHNang":{"text":"We had the crab claw appetizer with the amazing lemon and garlic sauce, and the crab and s","useful":1,"cool":0},"FgAJ8S_NlfxglOeZPE2aEw":{"text":"I came back to NOLA to enjoy some good food, ans creole's did not disappoint me. This is n","useful":0,"cool":0},"c46j5EiH47QTpReAQ4Rp-g":{"text":"OMG!! The best charbroiled oysters!! Deuce our bartender/oyster shucker was awesome..we go","useful":0,"cool":0},"pePmxb8GAIprz4MsbGeE_Q":{"text":"I came here one morning for a late breakfast. I decided to try shrimp & grits for the firs","useful":1,"cool":1},"xhb7xtNsNWkqEIQpGvMQbQ":{"text":"Stopped here for breakfast one morning while in New Orleans. I had the waffles with chocol","useful":0,"cool":0},"KWwBa6-f-9I8PqHoLu8_9g":{"text":"My first Po-boy!\n\nI've been hearing all about these massive sub looking sandwiches, this l","useful":1,"cool":0},"0yyDSzRt_YYyDy8IUIeRpA":{"text":"Awesome X infinity! Everyone was so friendly. Food had flava past grandmas!  White Chocola","useful":0,"cool":0},"AaeMxKWgD6mFHJnHZ4PuEA":{"text":"Food was bland, service was inattentive. She forgot things.  Tourist trap.  Don't go!","useful":1,"cool":0},"4Zbqi4HMscl5gx0bL3tPwg":{"text":"So this looks like just another restaurant but much better than that. Had the taste of New","useful":0,"cool":0},"vQ2k5czNBqokfaHAje9uhQ":{"text":"Stayed at the Marriott and this was a few doors down. We were tired and hungry and found t","useful":0,"cool":0},"cvfD4y39cQRe5CnGYdMZ5g":{"text":"Looks like an institution. Feels like an Applebees. Tastes like a Cajun inspired Applebees","useful":1,"cool":3},"DnlLzmxeG9jgT6mr66rI6Q":{"text":"This was my first stop for food after arriving in New Orleans. The server gave us a breakf","useful":0,"cool":1},"I_CKHLb8bDGqABjO18JwWw":{"text":"This place was awesome the bartender was great and very sociable. The food was great. I ac","useful":0,"cool":0},"E8Cr6L6Dzskcu7T_H0OhbQ":{"text":"This was our first stop in NOLO, we expected long wait times however, we were seated withi","useful":0,"cool":0},"5YV2yPPAmcWdd87MGGTqKw":{"text":"Our server was snippy the drinks were weak weak weak,the food was greasy and mediocre at b","useful":0,"cool":0},"9hkGHkNnBTWDMYj9wy-oOQ":{"text":"They were AMAZING!!! A must go. We had the shrimp and crab cake on pasta, crab claws, and ","useful":0,"cool":0},"cmbk71KW0lEC6yy8rg5Nhw":{"text":"I waited till the end of my five day trip to write this so I could compare service and foo","useful":0,"cool":0},"yU_lqw1UC2J0tKzh5cKXjA":{"text":"Not a good choice. Touristy. Overpriced. Slow. Decent  beer specials for $4. But you can d","useful":0,"cool":0},"bALScPSj1EqsS4DBrdZrTA":{"text":"Perfect for us...Saturday morning breakfast!  Spencer our server was fun.  The Bayou bowl ","useful":0,"cool":0},"Ppm69D0aujInvZkMaDzOYg":{"text":"This is my first time in New Orleans and we waited outside for almost an hour and the food","useful":0,"cool":0},"_bucW7F_tjxFEIYeyc1nLA":{"text":"Had the Gulf Shrimp & Grits! [server]Christina Recommend this morning dish. And I LOVED IT","useful":1,"cool":0},"Fe9--l1yVhyDWChjUVjWTA":{"text":"Great food. And even though the place was super busy It was great service as well. Troy th","useful":0,"cool":1},"GStkGU7yZx34BN3Z0d0g-A":{"text":"Y'all go and give Kathleen a raise. Girl deserves it. The restaurant was super busy and sh","useful":0,"cool":0},"osbSAiAScZQIegOYOdPJDA":{"text":"Popped into this place because it was freezing outside with a strong wind blowing down Can","useful":0,"cool":0},"2v055gFfER5gQ4apUvLziw":{"text":"Post aquarium insectarium meal. We wanted New Orleans cuisine. This place is on a corner o","useful":8,"cool":5},"8rTqUy0ydJrgQCofMUXUkw":{"text":"The shrimp and grits were great! Great ambience and service! My wife had the muffalata and","useful":0,"cool":1},"xhkjBilvblwD2Fb6BR2_bg":{"text":"664875 creole chicken and waffles yum along with mimosas. Can't go wrong for hangover food","useful":0,"cool":0},"PkqtGPI3yot09E49fR0c-Q":{"text":"Decent food. Nothing special & nothing bad. Horrid service.\nI'm sure they need to turn the","useful":1,"cool":0},"NzdCDzShGcEjCRSg_4s0yw":{"text":"We looked this restaurant up before coming on a vacation and looked good on the reviews an","useful":0,"cool":0},"6fHbYFdysBX5sHnH2W_29Q":{"text":"On my wonderful trip to New Orleans there was one major thing that i wanted to do and that","useful":3,"cool":1},"T15ETs_lsSYbb2nnd_7Y_Q":{"text":"Well!!! I wold like to honestly say! The waiters at the bar and the host were the best par","useful":0,"cool":0},"TR2w-c2-xexosZw1HPbx9w":{"text":"Food was sub-par for a New Orleans eatery, bathroom downstairs smells like the sewer. Coul","useful":0,"cool":0},"XZnfm_mA7Iy36Mk55LfRNQ":{"text":"Decent enough shrimp po boy, but a bit light, especially for the high price.  Beer is also","useful":0,"cool":0},"NKaj7tF8RNxrgyb4Ddr4lA":{"text":"We stopped by this restaurant due to the good reviews on Yelp. We ordered the oyster platt","useful":1,"cool":0},"xK-D4LXUzFm-b6D5Ufx3KQ":{"text":"When in New Orleans red beans and rice is a city stable, and here the red beans were good,","useful":0,"cool":0},"MEr3jtgiHh_SoFjpynF88w":{"text":"Loved it!  The French fries were the way I like them.  Creole food was good, too and they ","useful":0,"cool":0},"TmGdlMbsK-64r3Ve25TAQQ":{"text":"Horrible service and horrible food and our waiter was high as hell... not worth the price","useful":0,"cool":0},"JFXBFZmcRSjLcC2hyOXaWw":{"text":"Staff was amazing along with the food. Ate dinner- garlic bacon oysters & fish po boy were","useful":0,"cool":0},"a-RwisWkoY5UGAyDk7oHrw":{"text":"This is a cool place. Went for breakfast (wish it was dinner). Breakfast was ok but nothin","useful":0,"cool":0},"IJ54r4U0YiBe_86Z4kihZg":{"text":"We went with a big group and reserved a big table.  We were seated promptly. I ordered the","useful":2,"cool":2},"0HnFzTdv9Cjp_7lBR_ASDA":{"text":"Not a bad place directly next to the Marriott on Canal.  Place was very clean and staff wa","useful":1,"cool":0},"O-FktV3Rlyu5IBFr4kyu-g":{"text":"Went here for lunch. Since I've been in NOLA I have made it my mission to try gumbo at eac","useful":0,"cool":0},"VHqR4e2ebfYIsjbFoOTXVg":{"text":"Crawfish étouffée was awesome. Great lunch time spot in New Orleans on Canal & Decatur.","useful":0,"cool":1},"ijvAQDFtNzHvYuuVPxE7yA":{"text":"5/5 Bacon Garlic oysters. Not as rich as Ed's but less salty and very savory.\n\nLove the gu","useful":1,"cool":0},"cU30PoGP5NObedhEGKzCzQ":{"text":"The food here was so good. But then again. All of the food we have encountered in New Orle","useful":2,"cool":2},"vXV-qSeZWBTbdQNkZBtN1w":{"text":"eh.\n\nI love the cheese grits here a lot. \n\nHowever.....Got the grilled oysters - didn't fe","useful":1,"cool":0},"1FxDrx4vu1TYKRyHVxQTtg":{"text":"Just like the first time, we enjoyed an amazing dining experience. Dana did an excellent j","useful":0,"cool":0},"nRgJixPMzNk7G5PlplhG-g":{"text":"This place had a small brown roach on the floor . I notice it after I ate my meal . The se","useful":2,"cool":1},"x9iMVnbwv6zy79DTv7GIvQ":{"text":"Although the food may be adequate to wait to get your food is horrendous. Make sure you ha","useful":0,"cool":0},"rLCMGtij8wcOjbEVFy4kJQ":{"text":"Food was decent, and our waiter was good.  However the wait staff who seats you and stands","useful":0,"cool":0},"iL1YGVoJPM94j7uIXImYTA":{"text":"Great food and great service! Our server helped us pick out all the NOLA favorites since w","useful":0,"cool":0},"BDTq1RqeZXchKmGLvLfzLA":{"text":"This place was a pleasant surprise. It was our first night in NOLA  and we were tired. We ","useful":0,"cool":0},"rzMawVNhDhjHBwIMpXwIjw":{"text":"Stopped in here on a whim and left totally stuffed and satisfied. Would totally recommend ","useful":0,"cool":0},"eMvnwRxrOI1r5vA17Wy-IA":{"text":"Made a visit to New Orleans for the Christmas holiday. We walked by this restaurant previo","useful":0,"cool":0},"BVRc1a_V5ISuwUnFyuL1mg":{"text":"Terrible customer service from the door greeter, arrived at 18:30 to try and eat dinner si","useful":0,"cool":0},"MshpOX97SZe1_0cDjtmaIQ":{"text":"A fixture on Canal.  Stopped by for a beer and oysters. Service was very good. Oysters not","useful":0,"cool":0},"tbql4-dmXIt6vFyShHDewg":{"text":"Across from the Sheraton New Orleans so it's convenient for those staying there or at a ne","useful":0,"cool":0},"M7KlpjvH7fiFIBqC39bgVw":{"text":"We loved this place!!  Our waitress was awesome and we really enjoyed chatting with her.  ","useful":1,"cool":1},"zR6MRGRWHPp8zZ7eKuO1Mw":{"text":"Great food and Atmosphere. Our waiter JC was fantastic! Will be coming back for the Oyster","useful":0,"cool":0},"lfDBnPTv8ANUYwxPWsmA3g":{"text":"This was by far the best food I had in New Orleans. There was a lengthy wait for a table h","useful":0,"cool":1},"x60idEPrGWGxShWqxq1htA":{"text":"The good was tasty.  And served on a timely manner .  We had cajun shrimp fettuccine alfre","useful":0,"cool":0},"zCHKxWgOwTkCWl2EvesnyQ":{"text":"Amazing! I had a Creole Bowl, which was Crawfish Cakes and Eggs! Really worth the meal and","useful":0,"cool":0},"G9Labpg7HyGV2eXpOKkLig":{"text":"We had a great experience here! Everything was delicious. Lacey was our server and she was","useful":0,"cool":0},"UHZmluH--I_YKglEO_QVmQ":{"text":"AMAZING Food, AMAZING Service, I Cant say enough to describe our Dinning Experience..!! Th","useful":0,"cool":0},"SU9UvqZ38BA2HJfSOTBxJA":{"text":"Love having brunch here! The atmosphere is laid back with local flair from the art on the ","useful":4,"cool":0},"4Zs-3MHpsb6nEDFqVr9T4w":{"text":"Troy took amazing care of us!  So friendly and helpful, with a great sense of humour! The ","useful":0,"cool":0},"qBoJs3yutCwROjlDLNEDmw":{"text":"Good: Accommodating staff\nBad: Expensive, slow service, very small portions\nOverall: Would","useful":0,"cool":0},"ENUCr5yOX-3RxVjdKQ9tng":{"text":"Omg!!! I wish we had something this great in Denver... service was 100%, food was excellen","useful":1,"cool":0},"reHQc7apRPHBbAn-yFb4qw":{"text":"I happened upon the Creole House my first night in town because it was near my hotel. I go","useful":0,"cool":0},"u2Yi59oe3LTmoZUbDdt9jw":{"text":"Slow in service , servers hqve atttitude , we waited for more than an hour wait , they let","useful":0,"cool":0},"we0vYGCadH1vs-1X4PEegw":{"text":"Food was delicious and our server was great!  With all the wonderful places to eat in New ","useful":0,"cool":0},"HYFqIT4W4bHoX7HoBcn27Q":{"text":"It was ok. Shrimp poboy was ok. Weird thing was that the bartender was kind of an odd dude","useful":0,"cool":0},"VsLEf0pbngk4kZC1wPEOJA":{"text":"Food was good\nBut coffee was in a styrofoam cup.   If you want real butter you have to pay","useful":0,"cool":1},"g8Kd4E1T8_kugZOzEwpC8Q":{"text":"This place has a short but an appropriate well-done menu: you will have great food options","useful":0,"cool":0},"oH_d4R43Fko0kutmhGmMwQ":{"text":"The food was great, I had the fish platter and my wife had the chicken jambalaya. Juan (JC","useful":1,"cool":1},"m7ljFOSX9pY7calYyQ-s9w":{"text":"Had a great lunch at Creole House on a visit to New Orleans in late-February.  Started wit","useful":0,"cool":0},"Qh2iNDG-cF5S01tRY5neqw":{"text":"Our family stopped in here for dinner this evening, and it was delicious! Miss Dee was a w","useful":0,"cool":0},"9RGS9BUHkEQEuNan4Srb7g":{"text":"The Creole House Restaurant was great food.  They have a great selection of fresh salads t","useful":0,"cool":0},"NO-rr_kYNi4cvj-eoOe92g":{"text":"Breakfast here was a solidly delicious and reasonably priced meal with good portions.  Ver","useful":1,"cool":1},"U_mQgC0RZrBd6CbX5HzZYQ":{"text":"Wife and I are were visiting from out of town and this spot was right across the street fr","useful":0,"cool":0},"HRrr0XQFsKXMqpSV0z9M3g":{"text":"Wonderul restaurant right in the center of town. I had the Cajun Alfredo with blackened ch","useful":0,"cool":0},"b8_zHBEtON18Vamwoaaa-g":{"text":"It was amazing and Ms Dee and Adonis was our server super friendly efficient and courteous","useful":0,"cool":1},"Km0CC55GHpshSG5Vei3dkA":{"text":"We went in for a late dinner.  I had some of the best alligator bites ever.  My friend had","useful":1,"cool":0},"Vq2eYJ_2v8uSzqEqfMInug":{"text":"The food was good, but the service was questionable. Though our waiter was quite nice, we ","useful":2,"cool":0},"OP1gRAHPCF_ExWq35Kuv8g":{"text":"Our waitress was amazing. She was so kind and friendly. We were sat right away, even thoug","useful":0,"cool":0},"GkwHDL4QSk-8HVQ8__NSHA":{"text":"The food, drinks, and service was good! Our waiter, Jeremiah, was very knowledgeable and e","useful":2,"cool":0},"YCfqkLFT3j5D2QHlgd00pA":{"text":"Great food , great customer service and the price is right \nBe sure and get the appetizer ","useful":0,"cool":0},"v37tnfu9iIN5ozwBhUaatQ":{"text":"I kinda liked this place, but honestly the quality of the food left something to be desire","useful":0,"cool":0},"5L-t4jozdPTSNjKZYT2LKA":{"text":"Excellent oysters great entrees food was excellent lots of flavor! Excellent staff and enj","useful":1,"cool":0},"d0CYP3s6nOjIdMBkm6E3VQ":{"text":"The eating is excellent in NOLA and this spot centrally located on Canal Street between th","useful":0,"cool":0},"6j4MPfgsfHGzn9g6c3_sWw":{"text":"First time visiting Creole House and I am sure to return!\n\nThe Shrimp YaYa is to delicious","useful":1,"cool":0},"FTUDJAWz-neasIDeip_FPA":{"text":"We were trying to decide where to dine and walked past this place.  We had the Texas BBQ o","useful":0,"cool":0},"x-v2tqcdYPR7ScS11VjYlg":{"text":"This place is all hype! Food is nasty as hell. I don't understand how the wait and line is","useful":0,"cool":0},"SP1KaGxUkT54Yxok08v2Sg":{"text":"Good staff food was great just wish a little better portions for the money but this close ","useful":0,"cool":0},"epBKgMdTkaWJYmlFLpoQUQ":{"text":"The food was delicious and the service was very slow but all in all it was great the drink","useful":0,"cool":0},"N40NbTEtCo3UtuMAoINiUg":{"text":"This place is a must! Perfect for breakfast, lunch, and dinner. I wanted a lighter meal, s","useful":0,"cool":0},"6wiMIkNdQ6HK5TJXLNpoJQ":{"text":"I stumbled across this place on my way to another spot for breakfast. I had a taste for fi","useful":0,"cool":0},"4Y8QZFXC1a1r3Q-8M2Wgtg":{"text":"Solid place. Good food and service.  I believe the bottomless mimosas were week.  They bro","useful":0,"cool":0},"Rf5_VmImQZDfNYdbxUNXzg":{"text":"My brother and I ate the bacon and garlic oysters today   They were spectacular!! We also ","useful":0,"cool":0},"MwzFsoKC-l476HwQOE1rCg":{"text":"Had the fish stuffed with crawfish which was great. Fish was very well prepared with no fi","useful":0,"cool":0},"CIRQQhCmlDb9bAp0mchGGg":{"text":"Our server was perfect, the food was perfect, and the ticket time was perfect. Although th","useful":0,"cool":0},"WpfxlBF1qXRFxnyTKQxXpw":{"text":"I'm from Houston, Texas and was on my way to Harrah's Casino and thought I would stop by h","useful":0,"cool":0},"grlRS27K9ZYOCV_jrkOX9w":{"text":"While visiting New Orleans, my partner and I decided to give Creole House a try. Our waite","useful":0,"cool":0},"of6irqiWrad2jWfghC3PoQ":{"text":"My wife and I stopped into Creole House during a quick trip to New Orleans as it is very c","useful":1,"cool":0},"4fYx4W2-PHeqPxzaM15e5Q":{"text":"The food was good. No wait which was nice. The portions were decent. Nothing bad. Nothing ","useful":0,"cool":0},"_eKysPx7mRkEuGwZ5qNtiQ":{"text":"I took two bites of my crab cake and each bite was FILLED with shells. The pieces were qui","useful":0,"cool":0},"S2jClfml0Segw1xMCMVfUA":{"text":"We went here for breakfast because they are one of the few restaurants that ope at 7am.  I","useful":0,"cool":0},"URZeSxz3RWbEpb23BpieIg":{"text":"Went last night, Devon made great suggestions of places for us to visit. The entire staff ","useful":0,"cool":0},"uMd3duvi3rh_V7aiy3F5zQ":{"text":"What great food!  I'd like to try all of the menu. Good from appetizer and salad through d","useful":0,"cool":0},"DVpscd_mgfmFkco-u25kHA":{"text":"This place was very exciting. The waitress was in training but it felt like she had been a","useful":1,"cool":1},"tBTjHa2MF4bd3xvm-3LmQA":{"text":"The food was absolutely delicious. The fried alligator was fresh and tender, grits were ch","useful":0,"cool":0},"kyGpIl6Uy6IHP8rtSa8kPw":{"text":"Excellent service. Ms.D (friendly greetings) started us off with a great first impression ","useful":1,"cool":1},"hFqj1Ql2B5OZsHjmPj5vYQ":{"text":"I loved the creole house. We were served by the very nice Akeia. The food was excellent. I","useful":0,"cool":0},"o5zCHdyfoZTYsZLb6FDgXA":{"text":"This place was just okay, I tried the cheddar grits and they were extremely dry with half ","useful":0,"cool":0},"uL1T5fgAMpwrK7Fj38ufPw":{"text":"Food was good. The restaurant was very close to our hotel and we got there at a great time","useful":0,"cool":0},"HAYsNdvAg3xe9_sd03KVDQ":{"text":"Over rated!! This is a spot for tourist not people in the know who are familiar with authe","useful":0,"cool":0},"hstHuLcxBLCXr6_hTUK_mQ":{"text":"holy cow this place was delicious. i had the bayou bowl and it was incredible. definitely ","useful":0,"cool":0},"TfbpEiJqJV-y0dND4NKO6g":{"text":"If u enjoy eating shrimp sans the sauce... after asking for extra when you order  this is ","useful":0,"cool":0},"HNNAF-FqAjSrGw8G9wmOfg":{"text":"Super hospitable service. Jeremiah was amazing behind the bar. Making suggestions complime","useful":0,"cool":0},"Y-WmF0948QMpVT6y9vdeeA":{"text":"First stop in New Orleans first po boy and it was ok. Had a better po boy at Drago's but w","useful":0,"cool":0},"hM12wsqfUd4poI39Udoyfg":{"text":"Great experience overall. The server was very personable and the service went above and be","useful":0,"cool":0},"LWN5EkAP_XRUulW-IYx21g":{"text":"I wanted to love this place, omg! I read the reviews, it read \"Hot & New\" and so I choose ","useful":1,"cool":1},"DklondU8DBwq9B2QCxeswg":{"text":"Was in town last weekend for a girls trip and this was my first visit to NOLA. A few of my","useful":1,"cool":1},"4rCzZRntdrRG4nf7P9mgyA":{"text":"If I was back in NOLA...\n\nWe had a delicious lunch here at Creole House. It was pointed ou","useful":50,"cool":45},"fadSmhMSih0fHzy8A9oVJA":{"text":"Went for breakfast and ordered the Bayou Bowl.  Outstanding taste.  Highly recommend it.  ","useful":0,"cool":0},"wa_D3TJJa69lo-peLC8T1A":{"text":"Creole House has indoor and outdoor seating.  Atmosphere is great and the staff is wonderf","useful":0,"cool":0},"DAHDQmHP1T5WYuMeCDXOTQ":{"text":"Best mojitos !!!\nGreat menu\nGreat service!\nHighly recommend!\nCanal street has some fine ho","useful":0,"cool":0},"UPOUkVRoN-5BH5r_tmFsuA":{"text":"In a city filled with culinary gems, Creole House just doesn't compare. I've been to NOLA ","useful":10,"cool":1},"Vd-VDvahe4-P2DWA4wqwbg":{"text":"I ordered the grilled chicken salad and cup of gumbo. The salad was good, but not 15.00 go","useful":0,"cool":0},"LwGvcYMkfammb1cIsK8XOQ":{"text":"No no no. According to the reviews, I knew this was going to be hit or miss but we tried a","useful":0,"cool":0},"6s92TARG_acjzjDfpj-X3w":{"text":"Excellent breakfast choices.  The morning after dish was great. Excellent grits   Omelets ","useful":0,"cool":0},"xxCM_HDk19Kg0iyMTCMieg":{"text":"This was my first time in New Orleans and I needed a break from fried foods so we got a Sa","useful":0,"cool":0},"E32VAO53R985WMq1XPfp7w":{"text":"We did a ton of walking on our first day in New Orleans, so we really weren't in the mood ","useful":10,"cool":10},"PlMEg9J7O61XF6yl8qSPuA":{"text":"Place was half empty when we got here for dinner at 5:30. We asked for a table for 7. They","useful":0,"cool":0},"BUZ-Y-WqjXK_QtdTko50Sg":{"text":"Food was ok. Nothing spectacular. Jambalaya was kinda bland. Crawfish cakes were good, but","useful":0,"cool":0},"5FsM2ayQLxtcfbz2H896ug":{"text":"Update to my last reviews\nDowngraded to 3 stars due to:\n\n$15 for 6 small grilled oysters -","useful":2,"cool":0},"DkfJGWrSgGJnfb64AOqVTg":{"text":"Server - Leon\n\nService - Excellent\n\nPrice - $$\n\nTuesday , January 7th, 2020 7:30pm\n\nOn the","useful":0,"cool":0},"1Sm-MdImvdHNBgH8dG2c_g":{"text":"We decided to check out Canal Street, after eating 5 meals in the French Quarter, and 1 me","useful":53,"cool":56},"6-9Z7UVK1ITAl1MjukwJbg":{"text":"Good location on canal. It was right across the street from our hotel. We tried this place","useful":0,"cool":0},"sbcR7eeWI8fQ6TUkeq0pLw":{"text":"The food was excellent but our waiter was horrible!  Not attentive, took a while to get as","useful":0,"cool":0},"LdxzkOEhMJSfERBr32PtrQ":{"text":"As a true southerner, we love our Shrimp & Grits. Creole House; has the entire game locked","useful":0,"cool":0},"rQhnNtK2m2Mv0aqQrOzq1g":{"text":"I'm not sure how they have this many stars. My gumbo was trash. And it wasn't even hot whe","useful":0,"cool":0},"mh-sOjlUuHCosX9DIHB0dw":{"text":"This spot has some amazing food! My sissy's and I tried a variety of dishes and all of the","useful":0,"cool":0},"fUmlFSknKVAsfB3z2NyPqA":{"text":"The pick 3 satisfied my creole craving. The shrimp and grits was good, but heavy on the bu","useful":0,"cool":0},"CWpCffM3KhdLR1texMcp2A":{"text":"I had the worst experience at this restaurant. First they seated us on the top floor and w","useful":0,"cool":0},"RDf1LwxqUQAHihyU7U9UFA":{"text":"My honey loves oysters.  These were large and sweet.  When he noticed that there were 11 o","useful":0,"cool":0},"FMbZpJo6l7uqnFykYy-LjA":{"text":"In visiting New Orleans this place was spectacular the service the food the environment wa","useful":0,"cool":0},"OVILFltwg9xTQygOoIhxWg":{"text":"In New Orleans for a business trip and literally ate here at least once a day!! Loved thei","useful":0,"cool":0},"JxCBho5V581bQo7KY9d7hw":{"text":"Have been sitting here for 15 minutes and no one has approached us, have even got water to","useful":0,"cool":0},"E4m4F5f03MZrT-LiTqMlRg":{"text":"First of all, I understand this is a tourist place but the service was absolutely awful. T","useful":4,"cool":2},"ov-XERG5Pn20BGiLD8X8Ow":{"text":"We came to New Orleans for a weekend. We had 8 people in the group and Creole House Restau","useful":0,"cool":0},"9ujbqMXR1uopHz_h7uw45w":{"text":"Average, food wasn't seasoned as well as expected.   Had shrimp poor boy and stuffed fish.","useful":0,"cool":0},"x5UBMqpdcUbyzgTqA32tlA":{"text":"I'm not one to leave a bad review but this was DISGUSTING. The benefit of the doubt, food ","useful":0,"cool":0},"5T888X1E7rWCvXaME1x9tg":{"text":"Stopped here on a whim at like 11pm because we couldn't decide what we wanted and their me","useful":0,"cool":0},"GYuKE16uqyKeTN1tnotV8g":{"text":"The food here was mediocre the service here was horrible took forever she did listen to an","useful":0,"cool":0},"k-KX0KXZZPFnsIQujBij_A":{"text":"Service should be faster, it took us like 40 minutes to get fresh oysters. Food was good w","useful":0,"cool":0},"yJxJ-Qmdfg5Exe8XK0VW6g":{"text":"We went here for lunch around 2pm. We didn't have to wait long about 5-10min. This place w","useful":0,"cool":1},"7OKk1dEcLYhYnGKx8uXwOg":{"text":"This was my first restaurant in New Orleans and they definitely set the bar HIGH. I had a ","useful":2,"cool":0},"3nG2aNhn9IP1NFTyYroH8A":{"text":"My wife and I both found long strands of hair in our food. Gross. They didnt seem concerne","useful":0,"cool":0},"yXlggZBBRIZQrnX_VMdqUA":{"text":"The shrimp and grits were pretty good. We ordered boudin as an appetizer and it was a bit ","useful":0,"cool":0},"tvNPL_qUtK4S2UfHNuEeAA":{"text":"Kevin at the bar was the best. From the minute we sat down the service was top notch and g","useful":0,"cool":0},"3dm_TszfR9m9EABDIAff5g":{"text":"Tourist food for Tourist people. We ordered shrimp Alfredo with the crab cake. The crab ca","useful":1,"cool":0},"4TZV41pJz3q4kYuogNhd1A":{"text":"I had the prime rib ppeparedd wonderfully. We all Jago had the oysters that my husband sai","useful":0,"cool":0},"nRWtHRRdDaDr5otr_WYNbg":{"text":"The young  health White  female waiters, was outstanding (sorry I do  recall her name). Th","useful":0,"cool":0},"x9rr7vzsleJYHMZmbXyJ8w":{"text":"This was my favorite meal during our weekend in New Orleans. I ordered the omelet with fri","useful":0,"cool":0},"F4l9Ck6baoYwvZx24p-uXg":{"text":"I wish I could remember the waitress name from our first night, however she was simply ama","useful":0,"cool":0},"AWmpONcrGT4MsNUhPjrSAw":{"text":"This restaurant lived up to its reviews.  Our table had grilled oysters and the crab claws","useful":0,"cool":0},"U72WD6onxdOXodkErD-SyA":{"text":"Once again the good Yelp reviews led us to a great spot.  Located right on Canal St on the","useful":0,"cool":0},"UNRaL6yJoHPwYPCWhNR2Lg":{"text":"I was only in New Orleans for a few days, so I wanted to try as much of the local delicaci","useful":1,"cool":0},"WpGkTnRD5dInx7boY_BP-A":{"text":"Such a great place for dinner! The Alfredo pasta with crab cake and shrimp has been my fav","useful":0,"cool":0},"F41kklAh0Zh-GxKZTD9TFg":{"text":"We were out looking for something to eat and saw this place and decided to try it out. I g","useful":1,"cool":1},"3E9kbYYCK3L8Qg1SlpjysA":{"text":"This place was very disappointing. I was expecting it to be good because of the yelp revie","useful":0,"cool":0},"GIotf2jJHLkvfrUlxUq5BA":{"text":"Horrible service. We were ignored and overlooked by our waitress the entire time. She'd co","useful":0,"cool":0},"ncpgpEmUSVpoDZpaKwUNLg":{"text":"There are so many places to choose from here so we asked the concierge at our hotel (The S","useful":0,"cool":0},"Ns6HkulThhH2gXVgcZPVXw":{"text":"The bacon and garlic oysters were out of this world! I had my fill of chargrilled oysters ","useful":5,"cool":4},"1ckTOXHMom6Dzi6Xdrhh0Q":{"text":"Been in NOLA for 5 days and this by far was my favorite meal!!  Came here for dinner with ","useful":0,"cool":0},"Abvyve9_tpLmQoDlVdbnGQ":{"text":"Absolutely amazing service from Corey, very nice and funny waiter. The food was absolutely","useful":0,"cool":0},"RQoIN0hXr8ZVuIWXkJlaqQ":{"text":"My review is only based on the dessert and if that is what's indication of the food ... I'","useful":0,"cool":0},"_P_dbu8pIJGVrkBT5gUh9A":{"text":"We stumbled across this place while checking out places near our hotel. We were seated qui","useful":1,"cool":0},"dnqHAyUv59lVGB0UxYhTzQ":{"text":"Excellent Service AND Great Food\n\nWe were a party of six, seated as soon as we entered the","useful":0,"cool":0},"TXRi2hoIz4x2scZxytnVYA":{"text":"This restaurant was great! The server was very nice and gave the whole place a homey feeli","useful":0,"cool":0},"YLrHqoaigygHluyJKSUvRg":{"text":"Service was lousy, food came to my table cold. My husbands fried alligator came somewhat h","useful":0,"cool":0},"njOMYz0ubTrGflSGRx86gw":{"text":"Very disappointed in this restaurant. I would suggest that you just walk right past this o","useful":0,"cool":0},"xQVqBHXOhq3UT5MUMsDUTA":{"text":"Long wait but the hosts and our server was friendly and professional. We got the red beans","useful":0,"cool":1},"qInKnAIsomzmI4U-H-01-Q":{"text":"Ok nothing special , was hoping to get more meat in my gumbo but basically got a bowl of r","useful":0,"cool":0},"rSxXYe_7EPNf9HU0CN0LYQ":{"text":"This review is only for breakfast since this was my first time here. It was suggested to u","useful":0,"cool":0},"Kg80kwdBs5bWzWAANT08XA":{"text":"Corey is the best waiter there is. He's attentive, gets your order right, kind and soft sp","useful":0,"cool":0},"dnzzqsNW0sqXK49m2wDVeA":{"text":"This was good! We were starving and honestly just looking for anything to eat. Stopped by ","useful":0,"cool":0},"5u-WXu_XtJ6i3t38wbvusQ":{"text":"Stopped for a late breakfast. Great bacon bloody Mary and eggs Benedict Louisiana style. F","useful":0,"cool":0},"cq7UkAY3DWsdSnqR7AHQqg":{"text":"First time here enjoyed an evening in the French Quarter. The waiter was nice and the food","useful":1,"cool":1},"ksihS9Pbt8iv4g2t-jxIWA":{"text":"Service was great. The wait staff was very attentive. The food was good but not outstandin","useful":0,"cool":0},"m2WgiI1yBJiu_Cl4rZYiiw":{"text":"Worst meal I've had in New Orleans. Honestly I don't know how this place is so highly rate","useful":0,"cool":0},"GM_S-lTklKji5aeg4fh9LQ":{"text":"First let me say that the food was good and the service was excellent but I was very disap","useful":0,"cool":0},"xo6UxoN8eNNGi2H-vFTUDA":{"text":"Reading the reviews you can tell that a lot of tourists stop and eat at this restaurant. I","useful":5,"cool":3},"4c8UkmXSbKI4nuJ5n8XXww":{"text":"We love the Shrimp Ya-Ya for an appetizer. We also liked the Sautéed Crab Claws appetizer.","useful":0,"cool":0},"ucwm71Olj8iImvSEcQFvTA":{"text":"Food: Amazing! We went here for multiple meals during our stay because it was close to the","useful":0,"cool":0},"u2xgige2LTZV7L2FRiI0LA":{"text":"The food was so outrageously delicious for the most part . I ordered a poboy and it was dr","useful":4,"cool":2},"WU1rj6ekvu1L7N2bjmwKTQ":{"text":"This first time we came here it wasn't a good experience. We came in they told us it was a","useful":0,"cool":0},"g5FzLggV_HzBWOX9XFSvmQ":{"text":"Wonderful breakfast spot!! Came back twice during our trip. Service was great and very wel","useful":0,"cool":0},"4AL9YUOaoe7U5VLy8hClaw":{"text":"The fried fish platter is to die for. All the food is amazing. Right next door to the Marr","useful":0,"cool":0},"dN7ZYwOZOoYYVeF7WXoOrA":{"text":"Omg!!!!!! This is the best food everrrrr!!!!! I love it sooo freaking much!  I'm from Dall","useful":1,"cool":0},"eh5JqQkc0pcTzE9088OEyA":{"text":"We passed through New Orleans on our way home from the beach and decided to stopped by aft","useful":0,"cool":0},"TFzMjIBEXMQHTh6ki1JdrQ":{"text":"We enjoyed the hush puppies, gator bites, and crab claws. Our server was great, and had an","useful":0,"cool":0},"VB71BzPykI0cjAWnM6ofdg":{"text":"We came in late and I am hoping that is what the issue was. I got the shrimp and grits....","useful":0,"cool":0},"2GO-JurryFm8YFISP1BTbQ":{"text":"I came here with my wife. We had the crab bakes which were the amazing. My wife had the ja","useful":1,"cool":0},"Ld10-x9eQobqA1IPGOmc0g":{"text":"We ordered the shrimp ya ya appetizer and it was amazing. Grilled shrimp in a creole pesto","useful":0,"cool":0},"vy85YUOOkzyhJnHu_j9dOw":{"text":"Came here for breakfast and am not happy with the service. I've been talking to every staf","useful":0,"cool":0},"GhqMzQjHgla56f5-K4z2zw":{"text":"STRICTLY SPEAKING ON THE FOOD If I could give 0 stars I would. Went here on Mother's Day a","useful":1,"cool":0},"E6Tvexb5tCzsx5rE8Ns-zg":{"text":"I was within walking distance of this place and another place that I had seen on Yelp.  As","useful":0,"cool":0},"2Aoi1C5nB4rQ6kOv3JpgVw":{"text":"Literally every single thing we ordered was perfection. As follows: Gulf Shore Margatini, ","useful":0,"cool":0},"dxPu2ugOE_2MCTpBCb5TEA":{"text":"This is the quintessential New Orleans stop for your gumbo and jambalaya fix. Creole House","useful":0,"cool":1},"x0xKZTg7zrqqCg09ib9P4A":{"text":"Very good. Very polite & welcoming staff. The food is delicious. My favorite was the crawf","useful":0,"cool":0},"A81Bq01HBrGJcTsvxZHE0g":{"text":"So good.  Seated by the lovely Ms D and Great server last night Troy. The food is authenti","useful":1,"cool":1},"4y4KuiX568NkMHYqVo8TMw":{"text":"Meh....overpriced and gave us the runs. It's was good but....they wouldn't let our 5th fri","useful":0,"cool":0},"uogtOjdjmdaeQfGE8r7uGw":{"text":"I NEED to praise this restaurant. I ordered \"the taste of the Bayou\" which is their gumbo,","useful":0,"cool":0},"q5wbr6cIir9dzrivyxcLsw":{"text":"I had the stuffed fish and thoroughly enjoyed my dinner. The grits were a little dry unfor","useful":0,"cool":0},"2zf0OpmTqCuq8D7ML6Dd2Q":{"text":"so this visit to creole house was a disappointment compared to pre covid. Not sure if that","useful":0,"cool":0},"fh78fDsSAOge0Z2Uioa5kQ":{"text":"Food and service was excellent. Just empty with COVID. Gotta try their oysters on the gril","useful":0,"cool":0},"9CDZhbmyMTl9I33XGo3OIA":{"text":"What a great meal! Our service was superb and they were very fast with the food. We had th","useful":1,"cool":1},"bTrMAkFEzFEhaNTsDS-C_Q":{"text":"So I don't know why the spot is so famous for their food. \nI came here Saturday night I wa","useful":0,"cool":0},"wy3bZSBWKX5USVAwdP3W0A":{"text":"Great service and great food. Ms. Dee was our Hostess. Ms. Tish was our waitress and took ","useful":0,"cool":0},"MFRZqoU4gCG01ZxZPFmxQw":{"text":"Best food. No wait and everyone was so nice and helpful. Get the shrimp and grits. Great b","useful":0,"cool":0},"gd4FEmpaHfh1ebR1fakgmg":{"text":"Service was extremely slow, like turtle slow. The food for the party came out at different","useful":0,"cool":0},"4fKL6DyioauC7iFSzHIK-Q":{"text":"Ok so this is my first time in New Orleans and I definitely wanted to try some of the stap","useful":1,"cool":0},"XMVfCABYBfomxHdO9kTJ_w":{"text":"First time in New Orleans so of course I needed to taste/experience all of the delicious f","useful":8,"cool":5},"uYsAnhll_pbolZnHR_XW2Q":{"text":"I would give zero if possible! Worst service ever! And the food... wouldn't feed it to my ","useful":0,"cool":0},"3PCJXpNUG_CgN_sboNF_YQ":{"text":"One of my French Quarter staples. Always amazing service and terrific people watching. \n\nM","useful":2,"cool":2},"6AYUBWMwzG-L-kSkj3y5jA":{"text":"I arrived at the restaurant at about 130pm on a Wednesday and was able to be seated immedi","useful":2,"cool":1},"McGmotZGwhrnLJh54dRp3Q":{"text":"Amazing!! Everything was great. Zero complaints! Dewan, our server, was helpful and friend","useful":0,"cool":0},"9kdpx9PQsxHU28NkGdbjvA":{"text":"This place is the embodiment of a French Quarter tourist trap. The service was subpar and ","useful":1,"cool":0},"mIrOJ4Ec5CAAbAuDIj5rMQ":{"text":"We stopped in they were on a wait so we sat at the bar, which was no problem. The bartende","useful":0,"cool":0},"EX_H3cKtKf4pw2bUwz1JmA":{"text":"We just enjoyed a great meal here. Our server, Hannah was great. We both had Cajun Alfredo","useful":0,"cool":0},"7vjgSRyrZ0FyRltOzr1S2g":{"text":"I had the Creole stuffed fish. It was so delicious! Great customer service with such frien","useful":0,"cool":0},"E6fHRE3Ajl28yY23ZxOStw":{"text":"I spent the weekend in New Orleans and struggled to find great places to eat. Surprising..","useful":2,"cool":3},"j46tjlE7diWrJgUZ3ttZHw":{"text":"Got here on the recommendation of the front desk at the Shearton across the street and man","useful":15,"cool":9},"JyNKvobxlgbNeGro7jNzzw":{"text":"Delicious food, with beautiful presentation.  wonderful fast and friendly service.  Jesse ","useful":0,"cool":0},"kEjltTgSPZOqk8hf769oKQ":{"text":"Salad and crab cakes were outstanding. Fried shrimp and french fries we're below standards","useful":0,"cool":0},"EX477vuLx948Lcdeu9_jaQ":{"text":"Flew in town for the Saints game and stopped by this restaurant. I got the red beans and r","useful":0,"cool":0},"lkGDnnEeAOPY3B1QmhdauQ":{"text":"BREAKFAST REVIEW:\n\nCreole House has inside and outdoor seating available as of right now. ","useful":10,"cool":9},"Un6px0fF1qTf2BoFCgaMOg":{"text":"Very delicious place! Their chargrilled oysters are amazing! It is very pricey for half a ","useful":0,"cool":0},"qFAUtHGtid9mordAUiDkxQ":{"text":"Stopped by creole house to grab some drinks, domino was there shortly to help us out, supe","useful":0,"cool":0},"iHW-ucGHw1unNr4oJaATBQ":{"text":"This place was good.  The hostess with the mostest. Aka Miss Dee was friendly and does an ","useful":0,"cool":0},"4NwmugkB69phGz_rvsYXTA":{"text":"The food was incredible. We got off our very long flight and this restaurant was the most ","useful":0,"cool":0},"JKQbNBN4dkrSpi7RWPildQ":{"text":"Not worth the money.  Overpriced for the quality of food, atmosphere, and service. \n\nClose","useful":0,"cool":0},"Ltv2ZDMMlrJahWOtmpy-rQ":{"text":"Found this walking from our hotel after being told two hour wait at another restaurant. We","useful":1,"cool":1},"Q718Za_wN1NRr5BzDYTaTg":{"text":"In town for a couple of week and when to the restaurant on my second day and had a nice ex","useful":0,"cool":0},"ZtekC4mYZoWVeyNcXkheSQ":{"text":"Ate breakfast and dinner here. Both were rapid, friendly service with excellent food.  Rec","useful":1,"cool":1},"ckYvjNad_QbvfyoGhHGJ5Q":{"text":"Creole House has always been one of our \"go to\" places when we come to NOLA but I am not s","useful":0,"cool":0},"_7vpFdq65wiZhaO_IV8Lrw":{"text":"Stopped in for oysters, but also got shrimp and fresh crabmeat omelette. Although they do ","useful":1,"cool":0},"o4N94qthy9OY2hdVJB97Eg":{"text":"Had the shrimp and grits and it was amazing!  Ms. D got us in right away for a group of 10","useful":2,"cool":1},"e7tG-0H4GF_YcnacVk277A":{"text":"My food was cold, grilled Oyster cold not and not done. I had a Voodoo Doll drink  somethi","useful":0,"cool":0},"n6mCEAf76vYlNOxdYXBBfQ":{"text":"Oysters were so good. Jambalaya pasta needs more salt and spice. Maybe even garlic. I woul","useful":0,"cool":0},"gZ4AQG0se1SOo-mCQoDLvA":{"text":"Great place!! Atmosphere is lively. Nice bar. Great service! Had the Mardi Rita, grilled o","useful":1,"cool":1},"1upliBtkzVNYOQntUJdNew":{"text":"Best oysters you will need reservations be patient they are short staffed but the drinks s","useful":0,"cool":0},"sEkm2uQ4gCE-UMlYdpydDA":{"text":"Christmas Eve was busy but the wait was about 15 minutes. Very courteous waitress although","useful":0,"cool":0},"NFTyN0rBElZM7KomWg834w":{"text":"Great service and hurricanes. We arrived early before the crowds. Shrimp and grits was del","useful":0,"cool":0},"N3C1w9zqTNIsZugfdiCJiw":{"text":"Oysters, and shrimp, and shrimp, and fish, and oysters, and  YUM YUM we loved everything a","useful":0,"cool":0},"RxC2Y0_HOBQ57GLgS-Qk_g":{"text":"This place is great! We had the bacon and cheese charbroiled oysters and the cajun jambala","useful":0,"cool":0},"EfCS9OY5r7RCtRTUo5sTpA":{"text":"What the heck. Starting off the meal strong by sitting outside in 90°F heat for 45 minutes","useful":1,"cool":1},"IjCckAB8iRp7QzgIPB5Siw":{"text":"The food was amazing. We had quick, friendly service, and didn't feel rushed to finish and","useful":0,"cool":0},"Ur6bqVn4zBb2bBK1vnqCfA":{"text":"So the food most certainly was goooooood and lives up to its reputation of course! But the","useful":0,"cool":0},"qHN-u2n0m8y0OrqiMM8Q-A":{"text":"I walked past this place a dozen times and never thought to try it out, but I'm glad I did","useful":3,"cool":1},"VdqY9TkHSkS9Qo2FGgzvmQ":{"text":"Was trying to decide on a place for an oyster po' boy when we walked by. It was mostly emp","useful":1,"cool":1},"Fa_6iqoi1pOlytPHriv7qg":{"text":"This place has by far been one of the highlights of my trip. Server was great, Bartender e","useful":1,"cool":0},"FZQVodNsIWcqD3P4rWV8Rw":{"text":"If I could give no stars I would. Worst po-boy and mufaletta I have EVER had. Stopped here","useful":0,"cool":0},"PFDznbSGY2uCd5FQ_UPnjQ":{"text":"Very good restaurant. It is on Canal, basically in the French Quarter section which may gi","useful":0,"cool":0},"Zyp3LvXUAUf9Mcudsy9-ug":{"text":"Rather than waiting for a table for just one person, I sat at the bar. The young lady at t","useful":0,"cool":0},"NrFpl7-aMi1AHXbDPX87KQ":{"text":"We came here for my birthday dinner Halloween weekend.\nService was great! We had a wonderf","useful":0,"cool":0},"7MrFj0JDrVJiUNEnEVNMXg":{"text":"We ordered creole pasta and chicken. The pasta tasted exactly like jarred sauce that be pu","useful":0,"cool":0},"5z4rfDpgaPlRhcpsxle2Dg":{"text":"Not worth the wait. Too hyped up and food wasn't the best we had on this trip. Understanda","useful":0,"cool":0},"qEDp5IiizV30tAQS0PtpLA":{"text":"Came here as a recommendation from a friend that lives in the area! Solid overall experien","useful":1,"cool":1},"KKxt73WBAINg077ARNmnIA":{"text":"Delicious breakfast, mimosas and a friendly staff. The avocado toast and Gouda grits were ","useful":0,"cool":0},"lCkdE8yFQTofWmQ8Li1Y1A":{"text":"Um, yeah -- pretty solid. The prices were a bit high but I expected this for a place so cl","useful":0,"cool":0},"x9LiU24e-4HUyfrMOxMY0w":{"text":"It's not that this restaurant was terrible. In fact the food was enjoyable. However, it's ","useful":3,"cool":1},"j13yg3fUihR0wv7sQ28WBA":{"text":"Came here wanting to grab a quick bite for the morning and because it was close to the hot","useful":1,"cool":0},"wd-UcHR7v69JzANrqg_CbQ":{"text":"Soooooo we decided to go out to eat. I really would give our waiter FIVE stars bc he was c","useful":0,"cool":0},"8hV1f78s40s5HoSjQHePnw":{"text":"TOTAL disappointment! I mean total. This was out first day in New Orleans and even if we c","useful":0,"cool":0},"0DCNP0gdGhunqJGS3dAB3A":{"text":"Great lunch. Hoping to try breakfast. Bottomless mimosas!Blackened Chicken Jambalaya.","useful":0,"cool":0},"nnU_9X1uByF8G9UPCp_QNQ":{"text":"This was our first real restaurant in New Orleans and we got the Taste of New Orleans plat","useful":0,"cool":0},"wOnZr5ZwLMPpH6cJqxOgMg":{"text":"While visiting my sister in New Orleans, she brought us to the Creole House for dinner. Th","useful":0,"cool":0},"Z8Bk2t66XpTW96-SE1ZQQw":{"text":"This was the perfect place for dinner! We walked straight in at 5:30pm with no wait and pl","useful":0,"cool":0},"oMXmvQc1burU_S0ZBCPS0g":{"text":"Server was very nice. Food was served promptly. A little high priced for what we got but i","useful":0,"cool":0},"t4LxnWWVNGJwMalf1kqX6Q":{"text":"I ordered the shrimp poboy. It came out cold. Which is unfortunate because it had potentia","useful":1,"cool":0},"1Y086zwCrOFmjy2N5unR7Q":{"text":"Amazing place. We had three different meals here. The staff was very helpful in choosing g","useful":0,"cool":0},"IzNkIQ8Djhei1F3OVW4lIw":{"text":"I was told that the wait for two people would be 30mins.  It ended up being close to an ho","useful":0,"cool":0},"NviXsHS2GVKBVEDblxqugA":{"text":"This place was absolutely AMAZING! There was a wait and now I know why. We started with th","useful":0,"cool":0},"0dXsSZBCRjzjDsh41sb83A":{"text":"Poor customer service and worst management. Ordered red beans and rice and shrimp and grit","useful":1,"cool":0},"dCralO4FOxn2I1dCpt3PHg":{"text":"The Creole House doesn't accept reservations unless you're a party of 13 or more, but the ","useful":0,"cool":0},"xQpcGxB7Y16qXG6Brgr3oA":{"text":"This restaurant was right next door to my hotel and I had been flying all day. I was starv","useful":0,"cool":0},"PF12WGTRqdzHpw5eMjVLUA":{"text":"We were seated very quickly compared to other restaurants in the area with an hour wait. L","useful":0,"cool":0},"7cmCKZSueluVIu8TIZhCuw":{"text":"I was looking for somewhere that had a selection of fish but also vegetarian options. We s","useful":1,"cool":0},"iTcdBZ89X3sOs1Ycx9MjBg":{"text":"We were greeted by the very friendly hostess and told we had a 10 minute wait. It definite","useful":0,"cool":0},"b5zlo1j6fEYPwLz3tKn53A":{"text":"Had to be the worst experience I have had ever , \nLet's start \nRestaurant empty but yet an","useful":0,"cool":0},"alaQ5u-Gnsx5GTf2Qgz-eQ":{"text":"We come here every time we come to New Orleans.  I'm sitting here right now and hating it.","useful":0,"cool":0},"_t4LM5foSpbJx9atsGu8MA":{"text":"Overall, a pleasant experience with great service, good cocktails, and decent food. Worthy","useful":1,"cool":0},"Bsu8Ye8iFL66aKQG6G3nxA":{"text":"Excellent service and the most delicious (and reasonably priced) grilled oysters we've had","useful":0,"cool":0},"ajjY9xHK4gc3jYTn_y0vQg":{"text":"We had a large party so it took a very long time to be seated, which was understandable at","useful":0,"cool":0},"MZK4hdS1WrVyuSXOT06qqQ":{"text":"Was going to another place and passed by this one so stopped in cuz the head was hurting..","useful":0,"cool":0},"F7A-2rzwUoB4HFg-cdgGRg":{"text":"This place is good and was convenient as I was staying across the street. I had the crab c","useful":1,"cool":0},"ONXoFm7EjS4DCgQfwcH-oA":{"text":"Great service and great food! \nGrilled oysters were delicious and the bread pudding was th","useful":0,"cool":0},"jUBHuaG8QWF-1J98iBoSbQ":{"text":"My friend and I randomly picked this restaurant to have lunch during our trip to New Orlea","useful":0,"cool":2},"K9vLyiqdtfBGNTlOeI8Ytw":{"text":"Good casual sit down food that's open late. I came here on a Friday evening after a long r","useful":2,"cool":1},"SW3SD5nynZjzojFJfBzfDQ":{"text":"This was kind of a disappointing dinner. First they said they didn't have our reservation ","useful":0,"cool":0},"JRjDvt-l4RoS_kZVdv9iZg":{"text":"I was here for my last night in New Orleans. The young man who was on the Oyster Station (","useful":0,"cool":0},"Kh1fV_rgpNT2w4AtNScuUw":{"text":"As a vegetarian I was really excited to see a couple of breakfast options that didn't incl","useful":2,"cool":0},"x5zirRE7032lsLpBL-8eVg":{"text":"Let me start with the very rude hostess. Please note they set the tone of the restaurant. ","useful":0,"cool":0},"rdjKPRlUOX2J3NFhyCLbpQ":{"text":"Food rival's Commander's Palace ( for the freshness alone- I would say it pulls ahead) - c","useful":0,"cool":0},"uExjHBy_MIFBqB0EcBE_8g":{"text":"Great service! Amazing food !! Alligator po boy and chargrilled oysters were my favorite. ","useful":0,"cool":1},"Xn1YVL1utmrzZkev5pKopA":{"text":"Definitely a favorite for us her NOLA. The only place we ate at twice. Highly recommend th","useful":0,"cool":0},"J7nKSFR5-Rt9VLPZXh5sSw":{"text":"My husband and I came around 11am on a Tuesday and were immediately seated. The hostess wa","useful":1,"cool":1},"OkaN5wYl11L-8A_nIOJOdg":{"text":"Great place!!! The bartender was so awesome and made some STRONG cocktails! Service was gr","useful":0,"cool":0},"d7srYKcWPcFOmF2uDcefvg":{"text":"So glad I listened to Yelp and tried this place! Per Yelp, other then the Shrimp and Grits","useful":0,"cool":1},"1997FKPZYbztI2aFz117Eg":{"text":"If you don't go for the food or the drinks then go for John. John is the singing waiter. W","useful":0,"cool":0},"Xb1EqwKLL2KPSqUPbbBw9w":{"text":"Had dinner here on Sunday- 1 hr 15 minutes wait!!  This is our second time to visit this p","useful":0,"cool":0},"qF0BDuNl6Z4pI7YierMAGg":{"text":"So I went to New Orleans for a quick 3 day trip.  I ate at this restaurant 3 nights in a r","useful":1,"cool":0},"GhtuzjKU1jYOnocltngwww":{"text":"I'm giving Creole House 5 stars because Monè was AWESOME! While she was very busy with mul","useful":0,"cool":0},"XVAhGNZLOWV4V8D2mwqhPw":{"text":"French Quarter was mostly shut down, was really hungry so stopped here about 11am, May 19,","useful":0,"cool":0},"iQwNKewttzBc6WVL0FL-4A":{"text":"CREOLE HOUSE IS CHOOSING TO SCREW YOU.\nThe not so subtle signs:\n\n$23 AND THEY DON'T DEVEIN","useful":14,"cool":3},"c-ikLmWBmJlYUAVKNwNMsQ":{"text":"Hubby and I ordered the blackened chicken jambalaya and red beans and rice. I ended up eat","useful":0,"cool":0},"ODopM1DgTJiYtQKHUvnQbg":{"text":"Smack dab in the middle of Canal's conference hotel block, Creole House sees no shortage o","useful":4,"cool":6},"BMzIlHn7ALwK6-j8WKAt6Q":{"text":"I am so disappointed. My husband and I had been traveling most of the day and was too tire","useful":0,"cool":0},"L6u7J7IVsUmC-ncD53FGCw":{"text":"My shrimp & grits were cold. I just don't understand That especially since we were the fir","useful":0,"cool":0},"DqP_HKSWnRJKdVFcPcrODg":{"text":"Tried the alligator poboy as this was the first stop on our New Orleans trip. Horrible. SO","useful":2,"cool":0},"2JuSadKggJTazDENXYayFQ":{"text":"I guess they all can't be winners..\nWe came over here on our way back to the hotel where w","useful":1,"cool":0},"IQNv62nd8j08SVOwR9q3_A":{"text":"Overall disappointed, upon going inside the place just didn't smell or look clean. Tables ","useful":0,"cool":0},"D_HI1oSqToPvmPZ5egCaPw":{"text":"Timing might be 'everything', as I chose to eat about 3:30 on a rainy Friday afternoon and","useful":1,"cool":0},"X1Wj8y0dYGZyBVAQItM_XA":{"text":"We went to Creole House on the recommendation of our hotel concierge, as it was nearby. I'","useful":5,"cool":5},"qavZAJPXw8B7d-LSOFEJwg":{"text":"I could write OMG 100 times and it wouldn't be enough for this establishment of all things","useful":0,"cool":0},"LOCwV1Lr_MJSiwjHwjNIYw":{"text":"This was the first stop I made once I made it to New Orleans! Everything was YUM! We had g","useful":1,"cool":0},"3v8qpH7Sn9Awei86vf3uJg":{"text":"Hey... this is a great place with delicious food..... I did order oysters at the bar... th","useful":0,"cool":0},"u1NMBtNhuvA15Vq5e0leIA":{"text":"Again, the Creole House exemplified how fantastic and passionate the waiters of New Orlean","useful":5,"cool":2},"NmWH-d5hqDW0Ptl3pJcI2A":{"text":"Well I cannot say enough about my visit tonight! The stuffed fish!!! The crab corn bisque!","useful":0,"cool":0},"StHUW_jMHcN9qrWuRQq5Fw":{"text":"The Oysters!!!! I ordered char grilled oysters and oyster Rockefeller. They were absolutel","useful":0,"cool":0},"tVG8BZeQzNh9DoFm0CGm-A":{"text":"I had the creole stuffed fish and it was absolutely amazing, my favorite thing I've eaten ","useful":0,"cool":0},"g8TSBpIqgO9TrKUAZ10YbA":{"text":"Made a reservation a day ahead, table was ready and walked right in.\nFood was good! Staff ","useful":0,"cool":0},"eUWHtWT078lWBpoKqN0MXQ":{"text":"I'm so disappointed. I had chicken & waffles and my friend had shrimp & grits. The food ta","useful":1,"cool":1},"SdHbaQtwVgD8H92Zn9bBuA":{"text":"Our first time out here visiting in New Orleans we went to a few restaurants but this was ","useful":0,"cool":0},"T7XcI65fXS5AnG59CCJ3Xg":{"text":"Great, great, great food!! We were going to do brunch but the wait was too long. We decide","useful":2,"cool":2},"eMnLP8J7z-MxKL98xE7j0w":{"text":"No reason to sugar coat this, this place sucks. Four of us came here, four of us had cold ","useful":2,"cool":0},"EsR9xSxAPK3e8BVWMke1lA":{"text":"Wow.  Very unassuming place.  Has a bit of a diner feel.  Sat at the bar and got exception","useful":0,"cool":0},"ZW7vJXoih5aHmqmFep2pLg":{"text":"While food was good, the service was terrible!! \nTook forever to be seated outside, which ","useful":0,"cool":0},"U0hP-yrX81k5xgl_AgpuLA":{"text":"I am in love with this place. Not only is the food is awesome but our server Anthony is sp","useful":2,"cool":1},"_vJPCjFZPxJEUe-ewmMU0g":{"text":"I would like to say I have never been so disappointed in a place like this one.  We were a","useful":0,"cool":0},"iU3PNpJ1YaOeuLZsw4I-pw":{"text":"We come to Nola at least ten times a year and we wanted to try something different. Creole","useful":0,"cool":0},"vu1e-qYKjSeX5KZbJMtscw":{"text":"Excellent food and service!!! Great atmosphere and the perfect spot for our big group. Mrs","useful":0,"cool":0},"hf-9X4pIMl0Ij9nUfwjLAw":{"text":"Food was excellent and service was great. Our waiter wrote down the names of a few places ","useful":0,"cool":0},"B0m6f9naUSfBNQ5jICQl5w":{"text":"Food is amazing and our bartenders Jeremiah and Ryan are just super cool. Crab claws are a","useful":0,"cool":0},"1PNv5JaKNSpnQmO2ImjlXw":{"text":"As a flight attendant, I've had the pleasure of visiting this fine city and many of its re","useful":1,"cool":0},"rIzubm8k1c_31xYeuD-WLA":{"text":"Supposed to wait 10-15 minutes to get a seat. Sat by the door waiting 30 minutes. Asked th","useful":0,"cool":0},"IRMDoLwHPcmZ6v43Y1uEAg":{"text":"The server was so wonderful to my large group and had the best recommendations. I checked ","useful":0,"cool":0},"P4mXnGAZPAF_awO6wLbhKw":{"text":"We decided to visit the restaurant due to the 4.5 star rating. Honestly, it was more like ","useful":0,"cool":0},"wr5uJ339HButgUH9STLVkQ":{"text":"It seams to be a great restaurant, but they hapñen to be on the main street and that helps","useful":0,"cool":0},"uPMVEUdeIYqMAsA8gzeR8Q":{"text":"This was my first visit here and I expected much do to the reviews. However, from the very","useful":0,"cool":0},"plg1W2DS4_DTRKMwOdPRzQ":{"text":"Omgosh the food was awesome and customer service was excellent. This place was recommended","useful":0,"cool":0},"LQSICoQBcXljj0PwiUSq5A":{"text":"Wow talk about excellent service ! I have received better service in New Orleans than anyw","useful":0,"cool":0},"CLAsiDftE6vilAQc6pihKw":{"text":"Enjoyed my experience at Creole house. Large restaurant. \n\nWe waited outside 10-15 minutes","useful":5,"cool":2},"95kiPMHgUJ3kiFbeN42rLA":{"text":"The place is highly recommended, the food is very good and the oysters excellent.  The ser","useful":0,"cool":0},"rqViLYdLHAkoAlKya_DxlQ":{"text":"We got into town late and everything was closing. Creole house was the only place open and","useful":4,"cool":0},"pNezExVR5OiOUl5lJx32ig":{"text":"Amazing food, nice environment, and our waitress (Kris) was personable and professional! S","useful":0,"cool":0},"6HywwtvpsAIGss6zkeVj4Q":{"text":"Great experience here (after we got by the hostess). Strange first interaction to say \"res","useful":0,"cool":0},"D8zZ8pZw0NdrfaeOy9xXFw":{"text":"Went here during Mardis Gras, really busy but the service was attentive and friendly and d","useful":4,"cool":1},"qBLFh7aUd3f4hAuRvnkyiA":{"text":"Beware! This spot is an overpriceddddddt tourist trap FOR SUREE. The oysters were just oka","useful":0,"cool":0},"S6ZpEhB1VqSFdFDL_nLdwQ":{"text":"This was an excellent restaurant! My group of 7 was accommodated quickly. The service was ","useful":0,"cool":0},"_sdUAl3Q0kqDyyhdbhkgfg":{"text":"This place was very good. We did takeout as our two year old won't sit still. They were on","useful":0,"cool":0},"oFyqM_uDu0RftUA5KrmSxA":{"text":"What a wonderful dinner!  Wow!  Olivia our server was amazing.  Crab corn chowder was yumm","useful":0,"cool":1},"vT97jrcwxbeyaWNXt7Iqww":{"text":"Late night and I needed a Muffeletta.  With Central Grocery closing at 5pm I knew I needed","useful":1,"cool":2},"hwIZ-lv2yBXQ1KIAsOCAsw":{"text":"I've walked past this place for years and had walked past earlier and noticed a woman eati","useful":0,"cool":0},"YaKSApf_-gL9xgHqu94lXQ":{"text":"Wait on a Saturday around 4:30 was only 30 mins. Oysters were amazing- given to us by a co","useful":0,"cool":0},"RA97yF1EYut4su-FuFkQxw":{"text":"The food just wasn't that good or worth the price. I don't think any of the seven people a","useful":0,"cool":0},"-pSr_4Acgd1wB178Gw3f6Q":{"text":"First time in New Orleans and it was our first restaurant of the trip.  Service was very s","useful":0,"cool":0},"ZI3QeBNsN-9NfbX7IMfRQQ":{"text":"Meh. \n\nStaff and servers are all really nice, but the food was mediocre bordering on bad. ","useful":1,"cool":0},"SjRebqeasJRvwzuTNPwG3A":{"text":"Went for lunch on a Sunday. Tried the shrimp with grits, fried chicken & strawberry shortc","useful":0,"cool":0},"xLXYg8LuRDIRwarVHXw7QQ":{"text":"We loved the shrimp and grits and the gumbo and would come back again. On a Wednesday nigh","useful":0,"cool":0},"a5EsB2VYZyvONIRITf21kw":{"text":"We arrived late to NOLA and were starving after a long flight. The Creole House was within","useful":0,"cool":0},"UPk5WJ6oGeZzBo4zOoawOw":{"text":"Very disappointed.  My wife asked for her omelet to be made soft, which means lightly cook","useful":1,"cool":0},"6NK6lYPEQpvcOw8OL3uMEw":{"text":"We had a great time at Creole House and Oyster Bar. Miss D, our hostess (thanks for the ph","useful":0,"cool":0},"zdyzr9y-8BNygLiDXFPhPQ":{"text":"Quick, friendly, efficient service right in the heart of everything... That usually means ","useful":1,"cool":0},"xOVWL2NU1crihAsOD-TuWg":{"text":"This gem is located right off of canal st and right in the French Quarter. I will not lie,","useful":0,"cool":0},"qiShgxBLwWxkyhxwgmkUzQ":{"text":"Yelp failed me on this one. It had awesome reviews and was only a block from our hotel - s","useful":2,"cool":0},"O00lunwgCPctlCm9IR649Q":{"text":"25 minute wait time turned into 10 minute wait, very stoked about that, especially on New ","useful":2,"cool":1},"vH2w6p-pMMvSTuic1tOwKQ":{"text":"Derek working the Oyster station behind the bar was so much fun! He was down to earth and ","useful":0,"cool":0},"qL9xD3QshleKkm4LzxpXQg":{"text":"Don't go. Worst experience ever. I ordered a ketel one Cosmo \"light cranberry.\" My drink. ","useful":0,"cool":0},"64p0CBkB8zwIHbtjqA4QMA":{"text":"Still think about the time I went to NOLA a year ago best place I've eaten. I went to the ","useful":0,"cool":0},"2SsS0kXOh4rjE31DV2RQsQ":{"text":"Amazing! Food was amazing, service was amazing, drinks were amazing! I'd recommend. We cam","useful":0,"cool":0},"BE2C3aCta1DXHNdJ8EWSiA":{"text":"We came to the restaurant 4 times, the food was excellent Rick was our waiter and was awes","useful":0,"cool":0},"cQI7V8nlHizWibliCDYmLg":{"text":"Last October, my friend and I had our flight canceled and ended up staying another day in ","useful":6,"cool":4},"zMybjMy6cph-3JEJx_N7Tw":{"text":"In NOLA for vacay.  The shrimp and grits here are sooo good.  The right consistency and te","useful":0,"cool":0},"NYznYmoOtLNERGSkdWhWaQ":{"text":"Muy rico todo y muy buena atención, valió la pena la espera, te quedas con ganas de seguir","useful":0,"cool":0},"0VjLSx_mRhk9lEp4FehBbA":{"text":"Touristy-Diner... Not impressive, would skip this place with all the other options in the ","useful":1,"cool":0},"8FiwOgLyhYNNy7J1CsaPpQ":{"text":"Mrs D is the reason why we are coming back! She was awesome please give her a raise. She l","useful":0,"cool":0},"oSWilAzFYaUevl6cYSYBvA":{"text":"We totally enjoyed the blackened redfish and chargrilled oysters.  Our waitress was amazin","useful":0,"cool":0},"1ghJH04ak4kbdXgqp7ZnAA":{"text":"Listen.... This place is my second home. The food is the best food I've ever tasted. My fr","useful":0,"cool":0},"IExXSx9F_QZ8nCQKCL9qXA":{"text":"Staying at the Marriott, this restaurant is convenient as it is right next door. We were t","useful":1,"cool":1},"y2E8UbGnlgtXUd2mlejfZQ":{"text":"Amazing experience , stayed in front at the Sheraton Hotel so it was quick to cross the st","useful":0,"cool":0},"AhMixFtZVAHTW7Xq4z0u4g":{"text":"Loved it! I come to New Orleans for the food and this restaurant did not disappoint! I sta","useful":5,"cool":5},"_gdTCwLHskTiU0C55xeqxg":{"text":"I had a shrimp pasta dish that was just okay. Let me tell you about their bread pudding. I","useful":0,"cool":0},"pebkliqPOD03NaIMISPamQ":{"text":"Our food was mediocre but the service was terrible on a Saturday night around 8pm. \n\nThe r","useful":0,"cool":0},"0Xe3zFWXwkO_qJjD9whcfA":{"text":"While visiting New Orleans we went out or breakfast but the one place on Yelp we wanted to","useful":0,"cool":1},"CQpeQgiIIPyPWTwJ2KqjNg":{"text":"I went here for breakfast and I was not disappointed! I had the Creole House Omelet and it","useful":1,"cool":1},"inM1TlPq7PgkDl8jWRHkZg":{"text":"Had lunch here and it was awesome! The crab cake and shrimp alfredo was perfect and the st","useful":0,"cool":0},"DqQ-rLEHjjZyjDLhzx3S7Q":{"text":"The shrimp po boy was....ok.  I appreciate that they serve it with a kind of spicy mayo ak","useful":0,"cool":0},"VKPg6gp9OvR3uowUBFOx3w":{"text":"What an awesome restaurant!! The food is great, the atmosphere is casual but nice, the pri","useful":0,"cool":0},"539ytjtdmqgtUlJBGTbpsw":{"text":"Great service, our waiter Shanthi was very friendly and helpful. Food was delicious. Huge ","useful":0,"cool":0},"9bPNLN-sNNR_qiPU6QhoPA":{"text":"Really bad service. Didn't get my drink the whole time I was there and my entrée came out ","useful":0,"cool":0},"Ci7262ZesmCCdcpPjCadxQ":{"text":"Dont be fooled. Food was not good at all and expensive. Everything was cold and dry, espec","useful":0,"cool":0},"1jfLAAc4doVty1uWLFS6dA":{"text":"Maddy Maddy Maddy!  We also love the food and the beautiful lady, Dion, that sat us kept c","useful":0,"cool":0},"cJrpVX-v2bezuFMVEyZ00Q":{"text":"came here our first night on vacation. did not disappoint. place was very busy but waitres","useful":0,"cool":0},"JqJMtdUNIIi1ErVCbhcUvQ":{"text":"This place is a must stop. Food was excellent service very good. Staff made our time very ","useful":0,"cool":0},"6CJSLcZM0NSHgCNxXFtCvA":{"text":"This was the most epic dinner we had till now in New Orleans!! I had the bacon garlic oyst","useful":0,"cool":0},"T8VgRSTEiYqCE2kwOpTkWA":{"text":"Please skip this place. The drinks and food were less than mediocre.  The waitstaff was ni","useful":1,"cool":0},"6cs2zpT414M8UlhgN_UupA":{"text":"Seriously the best service in New Orleans. The food is really good as well. Everyone inclu","useful":1,"cool":0},"_qBLYSmyRH73QV9IuFuyWg":{"text":"Great food, great service! Kareem was our waiter. Great guy with a great personality. He d","useful":0,"cool":0},"IBvKZaMb_jPZYa3f_armjQ":{"text":"Sandwich was dry.  Had to flag down a waiter to get some extra sauce.  Manager made eye co","useful":0,"cool":0},"XCTwZIQr2cMblfIgC1ie2g":{"text":"Great food, pretty much everything I tried. Price point is about on par to slightly cheape","useful":0,"cool":0},"zzaBlQSZt_OiX7QDIytRtw":{"text":"The Creole House Po-Boy was excellent and the Shrimp and Grits was great. Don't pass this ","useful":0,"cool":0},"Nh3PUwtEHBLvxQb0_Qyv0w":{"text":"A thousand times YES!!  Hands down the best meal I've had in years.  The fettuccine Alfred","useful":2,"cool":1},"2D0Zh9t1QOe9QLgqGc9P4w":{"text":"I had the bayou bowl! So good! If you love rich hearty creamy breakfasts, you'll love this","useful":0,"cool":0},"0wlBuVQC5mPaG1o4KAueRA":{"text":"We went here to pick up breakfast after our hotel concierge suggested it. SO GLAD we liste","useful":0,"cool":0},"n9J3cr9kir1aP5PGgv9ZNA":{"text":"Yes. The atmosphere, the food, the staff. Choose the shrimp and grits. The grits are pheno","useful":0,"cool":0},"5DHPU2hzd3V6VO_SgOKOCw":{"text":"Absolutely, one of the better restaurants in and around the French quarter!!! :) First of ","useful":0,"cool":0},"GJdSU1xf1q1ONv-ZW9qukQ":{"text":"The food was excellent. It is conviently located across from the Sheraton and next to the ","useful":0,"cool":0},"fSH06eyMZteClniGlWKX4w":{"text":"The range of reviews for Creole House is intriguing, and it makes me want to break the fou","useful":0,"cool":0},"9iCEGl9njcY6_TyDaKir8w":{"text":"Kevin, my waiter at the bar is great! Food was great and my creole burger was cooked perfe","useful":0,"cool":0},"fF4VTLO3RGBEB97VsrMHRg":{"text":"I walked by this place about 4 times. Too tired to continue walking we walked in and it di","useful":0,"cool":0},"qidHbdeJyczkERMvwI9xYw":{"text":"Best place to celebrate Mardi Gras! We had the shrimp po-boy, Texas bbq oysters and bacon ","useful":0,"cool":0},"B-ls0qqqoXLrR7vXmX5kvw":{"text":"I stopped in quickly at lunch for shrimp n' grits and they were pure fire. Mimosas are ver","useful":1,"cool":0},"0c-fFBPuOY2zRheAEC_x0g":{"text":"One of the few places open, I am so glad they were. Amazing breakfast, very friendly and a","useful":0,"cool":0},"U4Kd9Rzp-nB1tCxYLcg_Ww":{"text":"We stopped by looking for some local tasty food and we were tremendously disappointed. The","useful":0,"cool":0},"bWKIRgdSADhJ7jg15ogWhg":{"text":"Ate here today with my family. I started with a half dozen raw oysters...the waiter brough","useful":0,"cool":0},"jdtgqQCu8cYWYN2fdNDmpw":{"text":"This is one of the oldest restaurants and also right across the street from our hotel,  we","useful":3,"cool":1},"zFxUqMX2WPSZI9wrfQ93uQ":{"text":"Do not go here!! The shrimp in my Creole House Po'boy tasted like it just came out of the ","useful":0,"cool":0},"uwtI2KEIHwt32IZ-ynSVkw":{"text":"I really wanted to like this place but it fell very short from my expectations, especially","useful":4,"cool":2},"v3vb-3EmLwGhMcBnMWwV8g":{"text":"THE FOOD IS AMAZING. We started out with the shrimp yaya that sauce is to die for and the ","useful":1,"cool":2},"niJAtnkwQUdB01a4qkxB3g":{"text":"OMGGG, this was my favorite spot the entire weekend. Me and my friend both ordered the Bay","useful":1,"cool":1},"RFoKwp044uW7k-_jrOA38g":{"text":"Good New Orleans food, friendly employees, and quick service. We stopped here for a late l","useful":0,"cool":0},"QZeo3C84f6wYV87NY9C7MQ":{"text":"Great meal listen to waiter taste of New Orleans great...shrimp Poyboy is also great...bre","useful":0,"cool":0},"9nGzyReu6e80-aTnViU7uA":{"text":"Nice place to visit in nola. Sadden to find out none of the dishes I had even tasted like ","useful":1,"cool":0}}