{"pGrYppdzgMXMkzgJYtBFrg":{"text":"The Pineapple Cilantro Margarita is an amazing, unique libation that is both refreshing an","useful":0,"cool":0},"azkpsJKW-ZZ9gq5nYKL5bA":{"text":"Only stopped in here to try the margaritas, but I would give this place 5 stars just for t","useful":0,"cool":1},"jCzX7DwH5GTNz5bV5fmcGA":{"text":"Got the stuffed avocado  appetizer and the combo plate.  The chips were fresh, and the cor","useful":2,"cool":1},"NCKRNykzMF5V98TKRTeO2g":{"text":"Well, I'm friends with the owner. My parent's helped him find this location and boy, I am ","useful":1,"cool":0},"5iMHu_WS9jks6Ce6n5ILgQ":{"text":"I have not had dinner or lunch here, but breakfast on two occasions, one being last Sunday","useful":0,"cool":0},"FyKlPl5UxrOVGJ8XC4YFvA":{"text":"Great food. Came with a big party and they handled us well. Came with a vegan friend and h","useful":0,"cool":0},"1BX-ZiDArMbrL9kAYJsv7g":{"text":"Good spot for Mexican when you've had enough Cajun or Creole to hold you for awhile. Food ","useful":0,"cool":0},"4LwfwpAZw09wymd1Du7UeQ":{"text":"Came here with my mom for lunch and we split the pineapple cilantro marg, stuffed avocado,","useful":0,"cool":0},"Pj-9wezRt0kAV3VuwsoNAQ":{"text":"Great gluten free menu.  Lots of choices. Great people and food.","useful":0,"cool":0},"6Pjc0UnwWU_gR3Z1wT3ZsQ":{"text":"FANTASTIC margaritas!  I am picky with margaritas, so this is quite a feat.  Everything is","useful":2,"cool":1},"Iz0h2aJ-tXOqa-LmTvNjkA":{"text":"Huge disappointment! Stopped in for a top shelf margaretta with grand marinea. Paid 15.00 ","useful":2,"cool":1},"dSu1m861n3a5Ck_9X7g4Ag":{"text":"The food here was great.  It was a little different than most mexican restaurants that I e","useful":1,"cool":1},"jpcVHDBbaDLK2RZ4PhZGVg":{"text":"Gotta join in with the yelping majority and proclaim this place darn good. \n\nAfter having ","useful":3,"cool":2},"sjiT_xk89NTqoy3ehFto9Q":{"text":"Stuffed poblano pepper topped with pulled pork among the best meals I've enjoyed in the Fr","useful":0,"cool":0},"kqHRW1nLf5OPSBOo0EtvPQ":{"text":"This place saved our gluten free butts in New Orleans.  We went a few times during vacatio","useful":5,"cool":3},"5uA4mX6ysy3aZME8ldk8bw":{"text":"I ordered a fish burrito. The service was excellent, but I was not as pleased with my food","useful":0,"cool":0},"PBxbAdMfRei6YauR8sjZXQ":{"text":"The food was good but there was a charge for everything. There's a charge for more chips, ","useful":0,"cool":0},"5Fdfd9qgawA7qG5uvcIMTA":{"text":"More like 4.5 stars!! Visiting from Florida, and looking for some authentic Mexican food i","useful":0,"cool":0},"XzmloES7Rbbv4qwtvfkx5g":{"text":"Awesome place! if you you are not planning to try baked avocados, know that you are missin","useful":0,"cool":0},"AbUiRE3NaKly8sqgCd81yQ":{"text":"Very small and crowded, be prepared to wait. BUT, once you're seated, the food is great! T","useful":0,"cool":0},"loM8meX1dCwkcvgR-1MldQ":{"text":"Probably the best Mexican food in the city.  I found it to be as close to authentic Mexica","useful":0,"cool":0},"OmD5rov0Vn2RGiyxJkW2sw":{"text":"Holy crap this place is amazing!\n\nBest guacamole I've ever had - they make it at your tabl","useful":0,"cool":0},"Fxmk7bd-IsUk_veDPjAwMQ":{"text":"Gluten free! Great flavors and most everything is gluten free. Rice could stand to be a li","useful":0,"cool":0},"eAO0XeZ5GWsizWjTghV3-A":{"text":"I love Mexican food. And this place was stumbled upon while doing some afternoon shopping.","useful":0,"cool":0},"BmgmyfteLr--Vm9N6vkNew":{"text":"I was really looking forward to this place since I have been on a quest for authentic Mexi","useful":1,"cool":0},"wB-Btjio60bd_RcZH2VDZA":{"text":"Don't get me wrong, the margaritas are amazing, but me and my two friends all just got sic","useful":1,"cool":0},"jorSwHql2_GRatRZGnsejw":{"text":"My husband saw queso fondito on the menu as we were walking by so we went right inside. It","useful":0,"cool":0},"rYdsWfEw_AE58fyGcdopFw":{"text":"Not the best Mexican food I have ever had but it really hit the spot. The service was fast","useful":0,"cool":0},"QqmecmPsHrpbtVlL01UngQ":{"text":"Coming from California I've had my share of Mexican food and this might have been the best","useful":0,"cool":0},"T4wWDRbndNLqOvjYwPwApw":{"text":"It's been ages since I've been here and it's changed.  It's still just another Mexican pla","useful":4,"cool":1},"-B6h0MNAQZYEUPvBNRquDA":{"text":"Good quality, well-mde with fresh ingredients.  Does not use the typical sugary sauces man","useful":0,"cool":0},"wYDH8LLa9YIAXebz-tC78w":{"text":"Convenient location, close to the street car and many shops and bars. The food was good, f","useful":0,"cool":0},"Fwv5OJCCO0XDeKeejm3yww":{"text":"Sorry but the Lakeview location REALLY out shined this one for me.  I have been to both lo","useful":6,"cool":0},"dPTa_v5AdK7Kb4MAhp6s_Q":{"text":"Great food! Everything was prepared from scratch! Fabulous margaritas and guacamole! Great","useful":0,"cool":0},"LB9b7tv14g5NSR5fvtQUuA":{"text":"Meh. That's all I can really think of when trying to describe my food. The chicken burrito","useful":1,"cool":0},"87DGP4Z4evqo883A1oyNTQ":{"text":"El Gato Negro\n\nSince others are complaining because this is not CA, I feel compelled to gi","useful":6,"cool":0},"t9Dzhg2zR-Cmnsg_JWcUGQ":{"text":"This restaurant is so delicious!!! My first experience with this restaurant was at the Fre","useful":0,"cool":0},"xn78tJux1CAGkZ4rzZuN8A":{"text":"We came across this restaurant tonight when we were looking for a restaurant with vegan op","useful":0,"cool":0},"wHc29tIXyqg5lc0F4AkD9Q":{"text":"This place was amazing! The food was served very fast and the pork tacos were great.  They","useful":0,"cool":0},"lcFkiw7qjngc-Pt5r7pwxg":{"text":"Lobster tacos!  Table service guac!  Good margaritas that could be stronger.  Nice small c","useful":2,"cool":1},"s-qP5ZsquNb4OawOWW31Ow":{"text":"YUM YUM YUM. Stopped in here about a half an hour before El Gato Negro closed.. I was a bi","useful":0,"cool":0},"RiteIzvcxrU8zmfxYrd2Kg":{"text":"While in New Orleans, I was in search for some home-style Mexican food and came across \"El","useful":1,"cool":0},"9oSEFtzqeSah6EDrfjnrgw":{"text":"This is for sure one of my favorite stops in the quarter. as a vegan, they have great opti","useful":1,"cool":0},"_wgqZu_agY_cRDtKKYqDmA":{"text":"Pretty pricey but shrimp taco was good but for almost $6 a taco I wish I got more then oni","useful":0,"cool":0},"Z3GPZBlGEEnl7bpOyJd1Gw":{"text":"Margaritas!! My husband and I always stop in on out French Quarter outings. Love the fajit","useful":0,"cool":0},"xtOMwHP_YeCLGaZ_csbEZg":{"text":"I HATE cilantro! I think it taste like bugs. My grandma hates cilantro too. I love Mexican","useful":4,"cool":1},"x0GqNJqFwlhMFsoNzdyxCQ":{"text":"The pulled pork burrito is delicious and huge.  Your first serving of chips and salsa is f","useful":0,"cool":0},"8Olz4ch92MvXgI8OUzfjSQ":{"text":"Food was \"ok\", didn't expect too much for Mexican cuisine in Nola given I'm from Californi","useful":0,"cool":0},"ZUrWkJCRn3m_zyuaoBz6NQ":{"text":"My wife and I split the Stuffed Avocado appetizer (comes w/ shrimp, onion, tomato, mushroo","useful":1,"cool":0},"4D5P5tT2xAaXZ6KvW94Fig":{"text":"This is the place for seasonal fresh margaritas, mojitos and Mexican beers!!  I used the Y","useful":0,"cool":1},"VAOkLDg00Qp9DzLcZtPkmQ":{"text":"During my visit to New Orleans, I ate here twice. The food is absolutely great. The servic","useful":0,"cool":0},"sfiLZ8V2mOD-uR1szH2dRw":{"text":"Seriously not that great!!\nI ordered the steak burrito, & my wife got the combo plate, we ","useful":1,"cool":0},"mXRPa9XEUZXs-ZbpE3iVCg":{"text":"This place is awesome. The manager Jorge always makes sure that we are well taken care of.","useful":0,"cool":0},"ocJNS9h0zUsc6DwWhOzQow":{"text":"The food and atmosphere was terrific. I can see it could get a bit too close for comfort i","useful":0,"cool":0},"tR0-NSH5wEKu7oO5ghS2ng":{"text":"We stopped in for a Margarita-to-go to kickstart our day in the French Quarter. No matter ","useful":0,"cool":0},"V5iNKIUbYxn1hNNqDZ-JtA":{"text":"Tonight was the worst experience I have ever had at a restuarant in New Orleans actually a","useful":1,"cool":0},"0o0QN1LJbJhyhzGhVHvvgg":{"text":"Stumbled upon this place while visiting from Texas. This is not Tex-Mex like I'm used to b","useful":0,"cool":0},"AmtoanjUCYLb-wOgwrpqAA":{"text":"My boyfriend walked in about 3:50 pm with no other tables in the restaurant which was perf","useful":0,"cool":0},"z9IG7UF0loVeJ9F3vJv6GA":{"text":"YUM!!!  This place was the perfect meal.  Located right across from the market, with most ","useful":1,"cool":0},"2VSXqQQNYJ3AjPBQj1Rbfw":{"text":"Whenever I'm craving a great Mexican meal while in the Quater El Gato Negro is where I hea","useful":0,"cool":0},"YQiRqsRBucEtDvMVhao2Gw":{"text":"DELICIOUS DELICIOUS Cilantro/pineapple margarita!!!  Just what I have been looking for and","useful":0,"cool":0},"BloG0S7ayOaRvQfvXtyqfw":{"text":"Yeah, I know, a Mexican place in the French Quarter??? We were apprehensive but decided to","useful":0,"cool":0},"BNoZtjiU3a8-LUyoefAshQ":{"text":"Walked into the restaurant after a nice walk around Jackson square and needed my Mex    Cr","useful":0,"cool":0},"s1WI7_RExXCuRpAZPB7Ebg":{"text":"Overpriced and shady billing practice for subpar food.\n\nThis Mexican restaurant charges fo","useful":1,"cool":0},"gyhh6-wMBds4LEZgSlo7jA":{"text":"The margaritas were tasty....but that's where the fun ends!  My sister recommended this pl","useful":2,"cool":0},"P39CujlXnzd3F2avYYVLkQ":{"text":"Food is meh. I like the sauces and the preparation, but flavor is clearly lacking. It's mo","useful":0,"cool":0},"N7a8ZOg78eJG4T0rmOBFLQ":{"text":"I've lived in Texas, New Mexico and California and experienced all kinds of Mexican food, ","useful":1,"cool":0},"_sY3sxqkC5zxuGRcZKOWLA":{"text":"This is the best authentic Mexican food in the city, outside of the taco truck that is","useful":0,"cool":0},"e66qG_Nt8gOIeiy6haEebA":{"text":"My wife could not survive seven whole days without Mexican food so we wandered into this p","useful":0,"cool":0},"6tPl5V7kngsBy6rRAVmKhw":{"text":"Some of the worst Enchiladas I have ever had. Having been to multiple cities in Mexico and","useful":0,"cool":0},"wGTbXrTzNdEK3uGfzRK36Q":{"text":"This place is awsome. Huge meals. We ordered the guacamole and a fajitas to share. Had to ","useful":1,"cool":0},"M9FeXOvmWDVaesVrzkbfuQ":{"text":"The best mexican food restaurant in the city!  I have said it before, but I eat out a lot ","useful":3,"cool":1},"1Mb1GqpZ62l4vuE829sotg":{"text":"The tamales and tacos were very good. Chips were nice and crunchy and the salsa has a nice","useful":0,"cool":0},"CCUZ2_G7kUUF9CpJCqrVzw":{"text":"This place has amazing margaritas for a very decent price.  And if you check in on your ph","useful":0,"cool":0},"wQ4GlViCMpM3WskrH2CTGA":{"text":"We love this place! It has been such a favorite for us since the early 00s. Delicious fres","useful":0,"cool":0},"oGH10h9KJK_Vl6m1hG-syg":{"text":"we stopped in for dinner the other night.  i had never been here, so i wanted to give it a","useful":1,"cool":0},"sZs3QwTg-VIckJq29R90uQ":{"text":"The food was delicious! We split a plate of fajitas. So good! Joseph was a greater waiter!","useful":0,"cool":0},"kF3Zxur1Z8h0MDf7ndA4Tw":{"text":"My sister is gluten free, and this place, is by far, the best dining we have here in New O","useful":0,"cool":0},"EQo6LthGGox_ythjD73OEQ":{"text":"When I was living in the quarter, El Gato Negro was a staple for me. I never met a dish th","useful":0,"cool":0},"IjiJceC55crOjjA2t9ZMzg":{"text":"We have gotten margaritas here before but finally came in for a sit down meal. The poblano","useful":1,"cool":0},"lySPH8VPlsilG545T4EdzQ":{"text":"I am from California & came to New Orleans for vacation w/ my mother, sister & grandparent","useful":0,"cool":0},"OlenUZI3_EBc4GoPH9uPRQ":{"text":"I had the chicken fajitas and they were great! The chicken was cooked just right with a ni","useful":0,"cool":0},"cN9wT3xqpstS3KVBQVURBg":{"text":"Too expensive for size of portions.  I ordered a shrimp taco, which cost $5.85 per taco.  ","useful":0,"cool":0},"-xFBRh5tumpSooV4sfuQDQ":{"text":"Such good food and the spicy cucumber margarita is so tasty. Have eaten here more than onc","useful":0,"cool":0},"e0Ediyq4zas_ajowuuNZDg":{"text":"My wife and i started out with the stuffed avocado. We were looking for tastes we don't ge","useful":0,"cool":0},"36Vw8qEKdHvs3UMOHntH-w":{"text":"Just no. I think the rave reviews about this place that gives it a generous 4 stars is sol","useful":0,"cool":0},"pso31A053F_o1hair1SJew":{"text":"The food was excellent.  The stuffed pepper was essentially \"open-faced\" and had a lot of ","useful":2,"cool":0},"AM9S9DJyXT1BsRfYKLTxwQ":{"text":"Love Mexican food and this place surely doesn't disappoint.  It's right across from the Fr","useful":0,"cool":0},"NkhdagqAVfXHiPGIcxYatA":{"text":"We had Sammy as our waiter. He was awesome! He knew all the specials and explained in deta","useful":0,"cool":0},"fMHABG-iVphvIh8WWiQW5A":{"text":"Great food, very good fresh made drinks! Pricey, but delicious. Service is really good too","useful":0,"cool":0},"djdu2G-IWR6x2ywAIb4nJw":{"text":"Mexican restaurants near our home NEVER charge for salsa and chips.  Not even for refills.","useful":0,"cool":0},"S0DsnhugPCNDt8sVM1XDnw":{"text":"This was one of the top five meals I have eaten this year, in terms of flavor and value. I","useful":0,"cool":0},"5fN5KYLvJ34M1MqajakQUg":{"text":"Great authentic food with fabulous unique margaritas.  Pineapple cilantro is yummy. Chicke","useful":0,"cool":0},"ULyxfkeoCoY929o2BEQTgg":{"text":"This was a place that has been on our list of going to since my girlfriend happened to com","useful":1,"cool":0},"4p44LArC_HLNF87zLCPGWw":{"text":"Live in the quarter and love this place. Staff is always friendly and food is always consi","useful":0,"cool":0},"YhpM2ptOdd8L9zeBT7F0Pw":{"text":"Fresh made chips, good queso fundido and fresh guacamole. Margaritas were also tasty. Pork","useful":0,"cool":0},"eic04Xzt97_6JGucaWFhLQ":{"text":"Pineapple Cilantro Margaritas and freshly prepared guacamole--tableside.\n\nThat's all you n","useful":1,"cool":0},"DIVXXk8DSCZVeuEfKDuDww":{"text":"Ate here on a recent evening and enjoyed every bit of it. Classic Margarita was tasty and ","useful":0,"cool":0},"r8qenMe4VpftrqivGPPyVw":{"text":"This place deserves 10 stars!  Phenomenal Mexican food!  More authentic than typical Tex-M","useful":3,"cool":0},"y80qF158uqDu1zzr7bDu_Q":{"text":"Unfortunately I heard the hype from friends and believed it. I was hoping for a good meal ","useful":0,"cool":0},"6iJ-wicSa6kmeCeqtCtpiw":{"text":"Very good mexican food near the French Market. We had a couple of strong margaritas and en","useful":0,"cool":0},"qTaGMSeEt5XpWFQRLGqbOw":{"text":"Yum yum gimme some\nBison burrito is outstanding\n3 cheese enchilada is just as tasty\nMargar","useful":0,"cool":0},"VW2KxtOSg_tW8PI3cnOe-w":{"text":"After eating gumbo, a po-boy and red beans and rice for 3 days, finding El Gato Negro was ","useful":0,"cool":0},"r5zsynLAzqVz_TU_nWavbA":{"text":"Not a 4 star place or anywhere near it.  If you know mexican food, this is just average.  ","useful":0,"cool":0},"qwxGg0-RLvXD3IKEIPOeZQ":{"text":"By far the best margaritas I had while in NOLA.  I love this city, where it's legal (if no","useful":0,"cool":0},"k12oH1wYsGzuCIzsnNDnCg":{"text":"I know I know... Why eat Mexican while visiting New Orleans? We find Mexican on every sing","useful":0,"cool":0},"mJZ13tOPl659HBXv_HbzKA":{"text":"Wonderful service, delicious food and the best margaritas ever!!  I would highly recommend","useful":0,"cool":1},"3wq5zFg2dcYQAwzCyF3nWg":{"text":"Everyone raves about this place being the best Mexican food in town. I really don't see it","useful":1,"cool":0},"MJGpcZ2Rll1oN1zV2zrPUQ":{"text":"Good service. Excellent tequila selection including Republic anejo, repos ado, and plata. ","useful":0,"cool":0},"qXhwwgQ6PCdGpPUC1B31TA":{"text":"This place was fantastic, I am so glad that I saw it on yelp and decided to try it with my","useful":0,"cool":0},"og2QPMza60TS4gzNelIhxw":{"text":"If you've never had a margarita made from fresh ingredients, or have a guacamole made fres","useful":0,"cool":0},"vomFZVCWC5bY9AOzykGmsA":{"text":"Go for the pineapple cilantro margaritas, they are crazy good. We tried the watermelon, ca","useful":0,"cool":0},"DER1NXWEMXv3dFQtqY7w1Q":{"text":"I love this spot. The food is great the menu is cute and there is family history in the re","useful":0,"cool":0},"t3zpiMrPyRKidyawsJMDSw":{"text":"Went to this joint for lunch on the recommendation of a local we know.  Being from Las Veg","useful":0,"cool":0},"w_pm1dyQon-OvZxmxFGe1A":{"text":"I went here last Saturday for margaritas and was not disappointed! The pineapple cilantro ","useful":2,"cool":1},"9HB5ksFee9gIKqlBTSxO7Q":{"text":"Rice ands beans here tasted like something I had in Mexico years ago.  I had the shrimp ta","useful":0,"cool":0},"Z6LyreXCeutfLvt4XRQm6w":{"text":"Welcome to Lakeview soon, but I don't think your prices will be welcomed, even though your","useful":1,"cool":1},"1BkucqBCnjvEgrnID6TwFw":{"text":"Great food and service. Definitely try the Pineapple cilantro margarita. It was amazing! T","useful":0,"cool":0},"FO1XFfTN435fkIWBku9nyA":{"text":"Fantastic food! If you go here make sure to order the stuffed avocado - it's a treat.","useful":0,"cool":0},"8bkeH6v7qUlwV6m-9K9QLg":{"text":"Just had lunch here today. It was perfect. The manager and staff were warm and friendly on","useful":0,"cool":0},"oZWeSRovRP4s_CwT5729SQ":{"text":"Ok they're not perfect...but it's friendly service-consistently. Which it NOLA that's 5 st","useful":0,"cool":0},"4omlql1mZhmMKQMSYrkEXg":{"text":"This place, in my opinion, has the BEST Mexican food in New Orleans and all the surroundin","useful":2,"cool":1},"5bRQAa_ucWKYBye5qcZCXQ":{"text":"This place is excellent.  Great guacamole made table side.  Large portions ofr fresh ingre","useful":0,"cool":0},"L2Ep9WW2aqDsi_wDdJULTg":{"text":"I came here since it was gluten free. The chips and salsa were great fresh and not too spi","useful":0,"cool":0},"4suBEG5acRLHCF5nSm_z4g":{"text":"Great authentic Mexican experience.\n\nWe arrived at El Gato Negro on Wednesday night around","useful":0,"cool":0},"GDFgra9l5iVnxyixkZgtgg":{"text":"This is our favorite spot to eat in the entire world.  Food is delicious (try the lobster ","useful":0,"cool":0},"FCgLF0HEgAKN9LKvvw3Gjg":{"text":"Mmmmmmmmmm!! El Gato Negro never fails me! The only thing I wish they had was their own pa","useful":1,"cool":1},"AEEmZO2wHsmGhFXFIidkGg":{"text":"After hearing such good things about this restaurant, I was determined to try it for mysel","useful":2,"cool":0},"9YotQJa9poQh1UorJYijTA":{"text":"This is definitively one of the more authentic Mexican places and is located right by the ","useful":1,"cool":0},"2x1Q1ZYhPEehWDT3JTZZUg":{"text":"I think I had been hyped up a bit for this place, and while it was pretty solid, it was by","useful":2,"cool":0},"A_orzLN2Z5G_352QRqXyCQ":{"text":"Mediocre food. Tables too close together. Gave me a claustrophobic feeling. I gave 3 stars","useful":1,"cool":0},"h48SDMnLzkk6PciZGwmIsg":{"text":"The food was good but they charge for everything...chips & salsa! Just a little disappoint","useful":0,"cool":0},"9lfQZLFOJqrYUn9zhuZElg":{"text":"The stuffed avocado with corn tortillas is killer good. Corn tortillas rock and it's all g","useful":1,"cool":0},"GYQfueZqe5DXf0B2Ds0wQg":{"text":"I had the steak fajitas. Food was very good. My bro had the burrito and he thought it was ","useful":1,"cool":0},"rbhYkPGyv__cD4b7wo5acg":{"text":"Tremendous gluten free menu - a rarity, it seems, here in NOLA. And great food? Yes. Wonde","useful":0,"cool":0},"nherk-1DzpyFYY9UgauIJQ":{"text":"This place was AWESOME! I will definitely be back for more! \n\nWe were seated within second","useful":1,"cool":0},"eosWmdfC3X5CPrssJKJGUA":{"text":"Gluten free menu that will knock your socks right out the door! We ate at the other locati","useful":0,"cool":0},"4GeWuKFVqx0llaq-7saYiA":{"text":"Foods always great, the atmosphere is funky and relaxed. Tonight however they dropped the ","useful":1,"cool":1},"NbplgbfnuqJ1xQgUlXdGDA":{"text":"We came in looking for a quick bite for lunch. At first I was upset with the menu because ","useful":0,"cool":0},"f6ZJnt_pwyv6KkZ2TGDUOw":{"text":"A little pricey for a mexican place. Everything was very flavorful though. Wouldn't normal","useful":0,"cool":0},"RpCK6pjaL7YQevDl0TGaow":{"text":"The crab quesadilla shared and a shrimp taco was a perfect lunch. While i had to refrain f","useful":1,"cool":1},"XbMGlnzO2jqrpdvJN9Iw7g":{"text":"Delicious Mexican food and great drinks!  The food always comes out quick and flavorful, t","useful":0,"cool":0},"2Q1qPsxjNh9xxUhN4zqwGQ":{"text":"It's a good hole in the wall place. Though I do worry about how corporate they are or if t","useful":0,"cool":1},"J5BbIQo4-DPEqlBfBkXx1w":{"text":"Drum fish tacos were awesome! Good selection of food to pick, staff was welcoming and frie","useful":0,"cool":0},"8YhX-7M1yUh_wna_JQOTug":{"text":"I don't know how many times I passed by this place or heard people talk about it and recom","useful":2,"cool":1},"ku9KaYVtNFiKC-nVPxEOWw":{"text":"Really good good. We had vegetarian pablano and house margaritas. Evan is awesome server. ","useful":0,"cool":0},"RhslZ-S3Oguwp3RCpIYnJw":{"text":"We came a bit late- the tables were full.  Lucky us, we like being outside, even if it's c","useful":0,"cool":0},"4WEGa9HFcQH-KEeWY9hgIg":{"text":"Food was good but I honestly think plate was overpriced. Quesadilla was 15 dollars it was ","useful":0,"cool":0},"q10TkyL4xlOZ_4JQirEEbg":{"text":"carrot and lime margaritas! i was skeptical, but damn, it was tasty. i haven't had a mixed","useful":0,"cool":0},"2sX8jsI0GhCxPydSUMkfBw":{"text":"delicious mexican food. Bison burrito and squash and zucchini fajitas are awsome.","useful":0,"cool":0},"8k2Jydc0NSHxQWumIxbEaw":{"text":"The food wasn't that memorable BUT I'd definitely go back for their Devils Blood Margarita","useful":0,"cool":0},"4aV085mflXIpvbI9bVxbEQ":{"text":"I got the skirt steak burrito . Love their hot sauce covering my burrito like love covers ","useful":0,"cool":0},"sShcQHR6fyiTyUY7WxSzRg":{"text":"I really loved my meal here. I got beans as a side and two chicken tacos on a soft wheat s","useful":0,"cool":0},"X3Gwux5Bf3NAz9VlWHdFKw":{"text":"El Gato is one of my absolute favorite restaurants in nola. Fun place to get  terrific dri","useful":3,"cool":2},"OrkewCDDa7bKn04e2iTfDw":{"text":"Visited El Gato on one of my first trips to New Orleans and loved the changeup of grabbing","useful":0,"cool":0},"WadnZwYFb5G80OzjtPUKEw":{"text":"This is as good as it gets in New Orleans as far as Mexican food goes, and even if you don","useful":1,"cool":0},"fx9EexIXWW1D6GX8ydSemQ":{"text":"Amazing food! Carne Asada was perfectly grilled, and the grilled vegetables had incredible","useful":0,"cool":0},"G4V685NI7m8QB7UN9l2Xxw":{"text":"Not sure what the hype is about.  It was ok.  We have places like this in knoxville tn tha","useful":1,"cool":0},"EK2FZQUnqDHJaptBKeDgDA":{"text":"I was pleasantly surprised with El Gato Negro. To be honest, I've been a little worried ab","useful":0,"cool":0},"L_r1Vw5Q4OpUL1Q-h07epw":{"text":"No, folks, the food is not really good. The food is HORRIBLE. We started going there when ","useful":0,"cool":0},"eOWxzsDj9L-wM-rYiSsizA":{"text":"The service at El Gato Negro was outstanding. Our waiter was very attentive and accommodat","useful":0,"cool":0},"KYToVk32SiO47HzLsh2UJg":{"text":"Food was great. Service was some of the worst I have had since I have moved to New Orleans","useful":0,"cool":0},"Kdo0sRCK5s1xXGTiECL-PA":{"text":"Fresh table side ceviche served by a sweet young man... Yes please! Well done Gato Negro!","useful":0,"cool":0},"da3421UuKl2ZTITgZzho9w":{"text":"Great staff and really great food.  The margaritas are really unique but they seemed reall","useful":1,"cool":0},"g_XgboJbj0OsTDV2w2fbYA":{"text":"Cute, little venue across from the French Market. Although it is a very small place, the o","useful":0,"cool":0},"MaydwtSvnifQMPp-PzPOuw":{"text":"LISTEN PEOPLE: Between the four of us, We ate here THREE DAYS IN A ROW for FOUR MEALS whil","useful":1,"cool":0},"dhyZ1HRmxFbMxtCI4ITWHw":{"text":"This place was recommended by another French Quarter bar when we were looking for Mojito's","useful":0,"cool":0},"QKTpXlC3FYNcxzV7H_Z89g":{"text":"The Summary:\nI've tried to eat at this place 3 times now. I'm just not a fan. Don't get me","useful":4,"cool":0},"jbRHMlASE5_oWU-_DtqDpw":{"text":"This place is tiny and usually bustling with people...I can't say that I would wait very l","useful":0,"cool":0},"bOWOdNn85VrkDd1tjUsBNw":{"text":"Heavenly! Mexican really can't be screwed up in my opinion; but after eating at El Gato Ne","useful":1,"cool":0},"2Su8LuPcnt1aOuUo-vBcRg":{"text":"i went for a leisurely sunday lunch recently with a few friends and thought the food on th","useful":0,"cool":1},"016Nrmv_GGaGtx43szBcog":{"text":"Welcome respite from much of the good offerings in the area. Yes, it's expensive for a Mex","useful":0,"cool":0},"uq8WTdeY6oH4Kb1UJEaF9Q":{"text":"The house margaritas are the best I have ever had. They served it with chopped satsuma ora","useful":0,"cool":0},"DQ3HVFXdVzE314pzEJCc2w":{"text":"FOOD: Separate gluten free menu (that even has quesadillas and burritos).  The mixes for t","useful":1,"cool":0},"h0sG7c-8o76bIxVNlBNZIQ":{"text":"El Gato is a great place. The El Gato dip is ridiculously good and can actually be a meal ","useful":0,"cool":0},"WNnGLKzaUGYEuHTomGpWCw":{"text":"Ok, so, I went (again), so my review jumps up a bit. Still overpriced, but, the carrot mar","useful":2,"cool":1},"XaP5vnhEnCF_DUgpYnukmA":{"text":"Not like it used to be. Had lunch here yesterday and still can't get the nasty taste out o","useful":0,"cool":0},"rd6NoKFon6pV-a4LAROTqg":{"text":"My meal here was adequate, but I'm surprised this place currently has a user rating of 4 s","useful":4,"cool":1},"ttbs9_J4amMQIJOgCXnJyw":{"text":"For the longest time I would not eat at El Gato Negro on my own accord. Many of my friends","useful":1,"cool":1},"NQBglEiz_6SVDuOQETEN2Q":{"text":"We had a very good meal here.  The service was great and the food was excellent.  I was no","useful":0,"cool":0},"xPZbk_9kKUvwRDbMTHvqjg":{"text":"Coming from the land of Tex-Mex it really didn't occur to me to grab some margaritas while","useful":1,"cool":0},"NsVfkpHXaY9D8rOxGkWyYA":{"text":"My meal was undercook which is an understandable problem.  The waitress asked if I would l","useful":2,"cool":0},"NFvSHCGMSnSvLwzkPTJCaA":{"text":"Food and service is very good. I especially like the tacos, burritos, and table side guaca","useful":0,"cool":0},"TmKQ5RRB1ON4-7OmVxnLJg":{"text":"Had some drinks, salsa and guacamole here after shopping at the French Market. I ordered a","useful":0,"cool":0},"wC8sTqeET0UD0pdOST3rQw":{"text":"Looking for a place to wet our whistles, my family and I stopped in looking to have an aut","useful":0,"cool":0},"axONVFBw2_jug3ziNxrPww":{"text":"The food was alright, but the service was even worse. It's not my favorite to give bad rev","useful":1,"cool":0},"0RmWZAuX1v2PrrQ8DRcCKg":{"text":"With all of the good reviews I've heard about this place, I was excited for the chance to ","useful":1,"cool":0},"_nHX9_s_CfvP2eRRjLaXwA":{"text":"Service was impeccable. We felt very welcomed and accommodated. I cannot have gluten, and ","useful":0,"cool":0},"6SH-LWZmLlPx42G0nS6ADw":{"text":"Only came in here for the margaritas and they were overpriced. When asked for salt, you no","useful":0,"cool":0},"0wIQ24rJCI4FsSXqbSfOOA":{"text":"ok minus the A.\n\nWent here with a friend who LOVES this place.  We were seated right away ","useful":0,"cool":0},"hBs1hiQZDdMHzIqWN2CIzw":{"text":"Yum yum yummm....such a great mexican place in the middle of new orleans! Highly recommend","useful":2,"cool":0},"sYmy_4fMelhS-nWxFfpxEQ":{"text":"Recommendations: burritos (filet mignon/pulled pork)\nQuick & friendly service - waitress i","useful":0,"cool":0},"pdIVf1WSONsyCBvRqjrA_g":{"text":"New Orleans is not exactly a city which caters to the lovers of Mexican cuisine, but El Ga","useful":0,"cool":0},"mw6jerApc_7KU28uXehjqQ":{"text":"Service was A1-Excellent!!! Friendly, Very Clean!!!!\nI can't say enough about the appetize","useful":1,"cool":0},"rfqKRqrrcGYuNgoKr2Dm1g":{"text":"I sort of hate to do this, but I have to go with the minority on this one - while it's goo","useful":5,"cool":1},"Za5ckCuDPtblHhG4z87wmA":{"text":"The food here is underwhelming.  Nothing necessarily wrong with it. Just not seasoned and ","useful":1,"cool":0},"c7tpxxTaYwIlBh5yxIcZFw":{"text":"God, I lurve this place.  I have never had a bad meal here.  From the fantastic tequila se","useful":6,"cool":5},"9hODS-JB0L4smwUkgSrVzQ":{"text":"Best Mexican food I have had and have eaten a lot of it in California\nMargarita was refres","useful":0,"cool":0},"wCCgTQEyAq5bDKkhAsBmTg":{"text":"At the time of my visit and of writing this review, this location has close to 400 reviews","useful":1,"cool":0},"gJiagAk9ZBaEI087Sf75FA":{"text":"Excellent meal!! The chips and salsa starter is wonderful. I ordered the salmon Merida, wh","useful":0,"cool":0},"bdfUzX6Y2PJ1axEn4FayNQ":{"text":"El Gato Negro is the only reason not to be eating Cajun or creole when in New Orleans. I h","useful":2,"cool":0},"eeMqcjOaucN_PGsq3WA5qg":{"text":"Way flavorful. Lots of choices. A New Orleans twist on Mexican. Some lighter healthier far","useful":1,"cool":1},"dm0HTzKKqpl_8TuxdrytMg":{"text":"I got the cheese enchiladas and I must say that they were delicious.  The tortillas are di","useful":1,"cool":0},"7YBBl0ItNw_7lodhW9t6pA":{"text":"I did not eat any food here but I did sample pretty much every flavor of margaritas they h","useful":1,"cool":0},"FW1gqgiApy2JrNIC69ZEug":{"text":"Everything was Sooo Delicious...the Carnitas and Chicken tacos out of this world good.The ","useful":0,"cool":0},"LjhAFQA6CvOCl9zRbNJmjA":{"text":"I was looking for Mexican food during my stay in New Orleans and I'm so happy I found this","useful":0,"cool":0},"GD6tdVRnfHZ9LTqazGYIIQ":{"text":"The margaritas were as good as ever, but I found the food below par and the prices conside","useful":1,"cool":0},"mb2zhMUYRh4ulTE5vpF_kg":{"text":"I have to give them something for at least having gluten free, vegan options BUT I was exp","useful":2,"cool":1},"8joUYrOC7uEBMnirpr6emw":{"text":"Good meal overall. My husband had a burrito that he liked a lot. I had a fish taco and a f","useful":0,"cool":0},"HsrGOooMk0aWAjZnel-kYw":{"text":"Absolutely love this place! Their food is amazing, their drinks (alcoholic and non alcohol","useful":0,"cool":0},"sRL-DFWnwoQ-Gxsh5T9WKQ":{"text":"My most favorite Spanish restaurant in the New Orleans area and the most amazing margarita","useful":0,"cool":0},"rEhw2KaAMbr6OFToeiWJag":{"text":"Went for Cinco de Mayo. Wait was kinda ridiculous but that's what I expected. The tables a","useful":1,"cool":0},"s_dV5rrM8rIEmWQeGwA-tw":{"text":"This is a great place.\nI had the burrito, with the ground bison, with the recommendation o","useful":1,"cool":1},"Yos5evP-P4Bt-aMOHNQf8g":{"text":"First impression: we were packed in like sardines, so my neighbor was practically in my la","useful":1,"cool":0},"rDL0uOvx2dfSAmx1Zn0UnA":{"text":"This was by far the best Mexican food I've ever had. Their drink menu is more than substan","useful":2,"cool":1},"xqhZ1tfYcwdVJVqanYqyHg":{"text":"Service- they told us the wait would be 25 minutes for a party of ten which would be reaso","useful":0,"cool":1},"8HU0NlVc1gvFtu6K3J3wWQ":{"text":"Food is Really Really Good. The guacamole is delicious. Didn't try any drinks but we had t","useful":0,"cool":0},"uVrWiJ1wLKIbdMfDFcoELQ":{"text":"I love love LOOOVED this place! It was the best food that my friends an I had the entire t","useful":0,"cool":0},"qPwIztPpwihhZYRS4CIvvQ":{"text":"This place is seriously so basic. FYI - The furthest thing from authentic Mexican food, fo","useful":0,"cool":0},"QvrRBi5ULt7oxN0kQOqHpg":{"text":"My friend recommended this place and rightfully so. The food was good and the staff very h","useful":0,"cool":0},"E9phZaa4E7T0bfYlpGntkw":{"text":"Sammy served up the absolute best margarita ever!!!  A must on your visit to New Orleans!!","useful":0,"cool":0},"pj7FgGyrJYiUnbNtz66ARA":{"text":"3.5/5\n\ni haven't had a full survey of the menu yet, though i plan to. \n\ni will, however, c","useful":2,"cool":0},"pHjbtttyEjp0oVjCpFogFw":{"text":"This was the dinner stop on my birthday tour of the FQ, and I must express my deepest than","useful":1,"cool":0},"YNHMq2FwhWMOskWf5-CSDA":{"text":"Let's start by tempering the \"Best Mexican in NOLA\" thing with a little reality - A) There","useful":2,"cool":1},"d5CVOzXNDEtxZZi9X1t_6g":{"text":"Love this place.  Get the El Gato Negro dip.  The mixed grill is awesome, as is the pork c","useful":0,"cool":0},"Wke-YpY9nJYMf3rVUpcH-A":{"text":"The burrito was good but I prefer to eat them with my hands and not with a knife and fork.","useful":0,"cool":0},"Jq7g8Jq5loUbsNeHQL9GTw":{"text":"food was ok pulled pork was a little dry but the rice was good","useful":0,"cool":0},"zASQtVB957oeaQ4qbnEKGw":{"text":"Good chips & salsa nice taste to chips (diff colored)\nGood top shelf margarita w #yelp che","useful":2,"cool":1},"qr_WK4kDe_CQCt9xRUdEBw":{"text":"You know how whenever you order fajitas at a mexican restaurant you almost always get the ","useful":0,"cool":0},"Ptg8Kv5z5Bf2L1GZ4PoRuQ":{"text":"Being from Texas, I am always adamant that nothing beats Tex-Mex. Today, I was proven wron","useful":2,"cool":0},"-8ibsh1r6LWXbiAnKQ-Gxg":{"text":"This review is in all fairness based on the Mexican food offered in New Orleans. As a born","useful":0,"cool":0},"fVQwAJaQt0d7n5X6vGcstQ":{"text":"Great food. Awesome Margarita's. Off the beaten \"tourist\" path.","useful":0,"cool":0},"YS8yhRmmopbLrXb2NvPqnQ":{"text":"They only provide one chip and one salsa it's additional after that also you cannot split ","useful":0,"cool":0},"6MSOdziWzRaRbDmXbwl1Kg":{"text":"Always a stop when we come to New Orleans. Perfect location to get a cold drink while shop","useful":0,"cool":0},"CIeOM-pqdfkHVrZuMdAhhA":{"text":"I used to love love LOVE this place!  Not sure what's happened but it's terrible now. Serv","useful":1,"cool":0},"TaaTybgfDGqcqq2r6kRLOQ":{"text":"Quaint atmosphere on back patio courtyard. Salsa is delicious! Had fried cheese appetizer ","useful":1,"cool":0},"O4R_Itn7zVD-t1cPx7TBsg":{"text":"The service was really slow (took almost 2 hours for lunch) and then they got my order wro","useful":0,"cool":0},"-Oy3qAfru0Vs5QDK-bfmKw":{"text":"Phenomenal! The Stuffed Avocado is one of the best tasting dishes I have ever had the plea","useful":0,"cool":0},"9ZMB0rCtGhDcV_hSq2-JAg":{"text":"Nothing fancy here, but the table-made quac was tasty, as were the margaritas.\n\nGood spot ","useful":2,"cool":0},"-sh8auPdOSMcnW5AY0KH5g":{"text":"Service is always good at all locations. I have eaten the Stuffed Avocado which is amazing","useful":2,"cool":0},"pjftmnrilCHf5HrtuZhZzg":{"text":"The margaritas here are incredible! They were out of the satsuma margarita but the Orange-","useful":0,"cool":0},"0r3vY5m0vlMwhA0zs4hBXg":{"text":"Best margaritas we've ever had indeed. The Blueberry set my soul aflutter, and the Strawbe","useful":0,"cool":0},"PNP0JHP7tqLp9EOPM_v1Qw":{"text":"This place served me RAW CHICKEN in my taco...Enough said.  ANd had the audacity not to co","useful":2,"cool":0},"5Qr1lH6gUZ92SKXsQuL4ZA":{"text":"Love the pineapple cilantro margarita!     The food is fresh and yummy every time.     I u","useful":0,"cool":0},"3NI6K_LfQ66Xm3YH9oCw-A":{"text":"Not good, food was good the waiter was a jerk. He kept pushing us to buy some booze even t","useful":0,"cool":0},"57EmfrEzlgsrbNA111Di8g":{"text":"I was very anti-Mexican food in NOLA (as I have recently moved here from Texas) but this p","useful":0,"cool":1},"d9iavP58Xmbeal1oS0Z8qg":{"text":"Love this Restaurant! We come here everytime we are in NOLA. We started off with the table","useful":0,"cool":0},"W0SEHdpFfyj9YrdQZHDRig":{"text":"The raspberry mojito was one of the best mojitos I've ever had.  We only stopped in for dr","useful":0,"cool":0},"czUHWJQ_WLoHTBES_n66fA":{"text":"You have to try the Pineapple-cilantro margaritas.  I did not even eat here, but got one o","useful":0,"cool":0},"321XdfAaGQb-fWtGr-VOBA":{"text":"The first time I visited this restaurant was when I was being escorted by a chef from New ","useful":0,"cool":0},"fTClXMdatwwFqvGqBP9-Qg":{"text":"The service was decent but could have been much better.  The food was, like the two-star r","useful":0,"cool":0},"5guGeWEtclc0JWl_WKLcHA":{"text":"I was a little nervous about coming to New Orleans and finding gluten free options. El Gat","useful":0,"cool":0},"BImFObmT5lBPVcl9oFqEZA":{"text":"This place is great to hang out in while in NOLA.  It has a fun staff with great fresh gua","useful":1,"cool":0},"X44BOBmr5728Dj2pfEaWuQ":{"text":"One of our favorite parts of visiting New Orleans! The service was spectacular and the foo","useful":1,"cool":0},"ebn5GQ6r0FepYgG1rJlV-A":{"text":"The ceviche is amazingggg. Probably my favorite ceviche so far. The guacamole is great too","useful":0,"cool":0},"gJm-Ni-JWzcHTi1dtWjtYw":{"text":"I ordered the house salad with chicken. All the vegetables were fresh, but the chicken was","useful":0,"cool":0},"Psg5KfQBsQCZOfBi9KmarQ":{"text":"We happened to be walking by this restaurant in the French Quarter and decided to try it. ","useful":0,"cool":0},"fENuFNI1YDKL-zLwLBhepQ":{"text":"I had this restaurant earmarked as a great choice, but I had no idea how delicious it woul","useful":0,"cool":0},"ETWc2AbU01VwadL-7w51Kg":{"text":"The food was good but not great.  We enjoyed the chips and salsa as well as the cocktails.","useful":0,"cool":0},"EDsqYSqikP5rJ07P4iRZUQ":{"text":"Not a vegan's dream. I had the table side guac for my meal with a pom mojito. I was quite ","useful":0,"cool":0},"YW7VvvbIqaWS7u05Y6r_cA":{"text":"We went here after a long day at Pat O's and were sooo thankful we did! We had the guacamo","useful":0,"cool":0},"3MoxN5bwaM9PcMUR2xswYg":{"text":"The food was very mediocre but the margarita was excellent.  I wouldn't advise eating ther","useful":1,"cool":0},"nHJZLhBtU9uFiLdOBp4Waw":{"text":"The $12 \"top shelf\" margarita tasted like it had absolutely no alcohol in it. I could only","useful":1,"cool":0},"tAX10MjatxPCraafyg7MkQ":{"text":"As a Texan giving a review of out of state Mexican food - I feel you can trust me ;)\n\nThis","useful":1,"cool":0},"p1spsPQVjXEPNLKxAVF8Gg":{"text":"Came here with my girlfriend as it was a last-minute restaurant pick. Definitely don't reg","useful":0,"cool":0},"cIxY_IT94qATjOFSYzrb3Q":{"text":"complete joke among locals. well-known for treating their employees extremely poorly, upch","useful":1,"cool":0},"g0B06VvO9NMUKJawnkT93A":{"text":"We went to the Marigny in search of food with no set plan. We happened upon El Gato Negro ","useful":0,"cool":0},"ThjxT7RV7lu4JFN3ntZM9g":{"text":"Likely some of the best authentic real deal Mexican food I've ever had. All the salsa, guc","useful":0,"cool":0},"Z37Yqqcd35PcXn6-oTsobQ":{"text":"I never thought I'd stop to have Mexican food in New Orleans but I was pleasantly surprise","useful":1,"cool":2},"de9iuinj_ur0u8bCHPDL6g":{"text":"Tonight was not best night. Too many service slips. Also some bait n switch on margaritas.","useful":1,"cool":0},"RZH6tQXNij7iL1aVsv-Vyg":{"text":"I had no idea this place existed, but then again I never ventured too deeply into Mexican ","useful":2,"cool":2},"zuhjJvx0H51YlmH0b4WNkA":{"text":"Best Mexican restaurant in NO. Both locations are stellar. I love the lobster tacos but I ","useful":1,"cool":1},"xMRXA2llButUt4ZXrF6jzw":{"text":"This place was so great, I felt moved to write a review tonight while the meal is still fr","useful":1,"cool":3},"-rRCpWew99aA9iAKj3t2fQ":{"text":"Very fine mexican food.  This is not your run-of-the-mill burrito, taco, enchilada and tor","useful":0,"cool":0},"66KGf9K3hNH5jI61dk8Rkg":{"text":"Their tacos are delicious and the selection of margueritas and tequilas is just perfect is","useful":0,"cool":0},"WYsagz7sGJhSZCfoKvs70Q":{"text":"The service was amazing, and their food is incredible. Try their pomegranate mojito! It is","useful":1,"cool":0},"jXeTzW1CRw3H9hQQ7xHtUg":{"text":"We had the Queso Fundido with crawfish and OH MY, it was amazing! Service was fantastic, b","useful":1,"cool":0},"4nk9oJ7E6xvcyZdfyuhn1Q":{"text":"OMG! I dont drink Margarita's....ever. However, my friend loves them here and convinced me","useful":0,"cool":0},"OEEndIoPdQCuIpN44Cw9YQ":{"text":"As good as it gets in my opinion. I had 2 pork tacos and they were amazing. I catch myself","useful":0,"cool":0},"gjEnEWocSGW2zQKli90adw":{"text":"Best Mexican Food in New Orleans great service, diverse menu options all served fresh. Can","useful":0,"cool":0},"_bF1SnktcOV3VnPRpqiMGw":{"text":"Hmmm, I don't know about this place!!! We walked in and just stood there confused for abou","useful":3,"cool":1},"FdY3Vhtp6Ma_K9xy4KVpIg":{"text":"Came here for dinner one night during our stay in New Orleans and we were not disappointed","useful":0,"cool":0},"JsyK5Es93cypgy8G2pt7zg":{"text":"We go to New Orleans annually and we don't go there for Mexican food.  However, a friend w","useful":0,"cool":0},"PseWTSmKMfZZPNqoePUa0g":{"text":"Very very good food (chicken enchiladas, tasty salsa provided with good tortilla chips) an","useful":0,"cool":0},"jtNpusbg3Ld0p8ootxxCgg":{"text":"I cannot, for the life of me, get it through my head how this place is well rated.\n\nLets s","useful":9,"cool":4},"Neva7VK6Dy__z4maYw63og":{"text":"We had a lovely dinner, but James's shining personality and  excellent attentive customer ","useful":0,"cool":0},"uma2hNMfL5_PTyAJTtkujw":{"text":"We selected your restaurant from a newspaper column written by Robert St. John, a chef and","useful":0,"cool":0},"Q7bbcmahsv7lMO0VzzhCbQ":{"text":"I have to agree with Megan R. on this one, \"Who vacations in New Orleans only to dine on M","useful":1,"cool":2},"TIkjDglL7sVTAcYV8QWPvw":{"text":"OMG why have I waited so long to go here? Ceviche was amazing and the mole was the best I'","useful":1,"cool":0},"wSFj7qUnCYYFsJ_szROunQ":{"text":"El Gato wins again. New York Steak fajitas were top notch. It comes with enough food for t","useful":1,"cool":0},"lB4SnI7bHQD7zc95Bw3XXQ":{"text":"Would have got one if the food wasn't actually good. Our server was by far the worst I hav","useful":0,"cool":0},"7YErox3pkjX9gzqThAXfmQ":{"text":"This place is amazing! The tequila selection is to die for. The skirt steak tacos are bett","useful":1,"cool":0},"FaJNuB9Bz9kI23wkjj0Fqg":{"text":"Great mexican food right in the quarter! Try the civeche made right at your table. Margari","useful":0,"cool":0},"7Ivfzs-AfR1HZuZv4cdtIA":{"text":"My standards for Mex food are food are varied. I like it vendor/street food like or high e","useful":0,"cool":0},"QvPBIkm0As27rupLzqjARg":{"text":"I had a really great Gato Negro experience. We got a bunch of tacos to try. Hands down my ","useful":1,"cool":0},"HT1EtL2fGY16csB2N2XjXg":{"text":"Not a fan. The food quality and service is subpar. Good Mexican is hard to find in New Orl","useful":1,"cool":0},"4bMwbwgn6qNEAuXJ7qScCg":{"text":"Authentic, very tasty Mexican, with a huge selection of beers and tequilas (even tequila f","useful":1,"cool":0},"25v9MfYK6mWp47HFh-9Ohg":{"text":"I love this place! And with fresh, authentic Mexican food and great margaritas why not? \n\n","useful":0,"cool":0},"NtZIclM5JNCWzNO8_D4Y9Q":{"text":"Best Mexican in New Orleans I've had so far and among the best maragaritas I've had anywhe","useful":1,"cool":0},"4nXLvAKTwoBVWABq7qpIwQ":{"text":"The food was really good but the customer service was so rude. So we ordered table side gu","useful":3,"cool":3},"u0c3HPkti4J7iL8KyMFUrA":{"text":"Wicked awesome Mexican food and margaritas here. We were in town for a few nights and deci","useful":0,"cool":0},"th69uGjeVLGej4DEo5cDcw":{"text":"Really couldn't be better . Fresh, homemade chips and salsa and the steak burrito was perf","useful":1,"cool":1},"9gXQr2NWpCvIaOwXEpJdVQ":{"text":"So good!  Try the pineapple cilantro margarita. They use real juice, no sweet & sour mix (","useful":0,"cool":0},"W6S3hRSP7Jp3mXpnF8b8CQ":{"text":"Great back patio dining. Get the Guac! They make it right at the table. Great burritos and","useful":0,"cool":0},"sqswykKra6MJdRdAKhBfKw":{"text":"Authentic Mexican food in a cozy, homey setting. The salsa and chips served before food we","useful":0,"cool":1},"oq9EfT_oqiccJMJHV9nuaw":{"text":"walked into this restaurant at 3pm and it was HALF empty. We were a group of seven and ask","useful":1,"cool":0},"DtKmDIA2GpYSLvsHRvxcsw":{"text":"Wow.  This place really was phenomenal.  Who would have thunk that the best Mexican food I","useful":1,"cool":0},"DSoikKqAgHZ7bWed8NUmzw":{"text":"Came to town for Memorial Day weekend, alone with 8 other friends. New Orleans is one of o","useful":0,"cool":0},"pqhhlX05GHtqdk3KaZSzMw":{"text":"The Margaritas and food were excellent.. I love lots of cheese and it was amazing.. This i","useful":0,"cool":0},"hihzqenk3IckgMvB6EWZoQ":{"text":"- Our first night in New Orleans, we had dinner here. Cute and authentic looking atmospher","useful":0,"cool":0},"d32FGrI0djr1QBwOS3bCrg":{"text":"Fancy cocktails and good fresh mexican? sweet! El Gato Negro has some of the best margarit","useful":1,"cool":0},"10MS6nWwv6JlUQuE7VXWJw":{"text":"The last time I ate at El Gato Negro, I was disappointed by the house margarita and fish b","useful":3,"cool":0},"QKsLqJ1cgWJQnrOCN9FyhA":{"text":"A friend from Mexico once told me this is the most authentic Mexican restaurant in New Orl","useful":0,"cool":0},"dKfxkySOBouQStGQOoK6Mw":{"text":"By far the best fajitas I have had.  The pulled pork was perfectly seasoned, and delicious","useful":0,"cool":0},"UKpiSlwCVaIh-z55diW_nw":{"text":"Although we were not a fan of the chips or salsa, the rest of the food was delicious and t","useful":0,"cool":0},"X1FGDSMCSkbkFn6JkJJvvA":{"text":"Don't need to write out a long drawn out review like some people who love to hear themselv","useful":1,"cool":0},"aKa2AVSlf5T4Pp91e5Zq9g":{"text":"Worst experience ever! I might be spoiled being from Texas but this place is a joke. It is","useful":1,"cool":0},"aH73DbJJSb_REOTNw7yuBA":{"text":"Wow . We were walking around trying to decide where to eat . We walked for miles and miles","useful":0,"cool":0},"iVX4utbG_MY6NPidJ5E5-Q":{"text":"Packaged almost-rotten guacamole is NOT OK. And that's what you get if you order guac as a","useful":1,"cool":0},"9JqHO4i-UAZUhQ2I-LPnxw":{"text":"Wow! If your tired of the typical NOLA dishes try this fabulous \"joint\" by the French Mark","useful":0,"cool":0},"9DNd1kpYzE0mQnQmcMIBzw":{"text":"4 stars because we had to sit in the court yard on a humid night because these people had ","useful":0,"cool":0},"X_glcer4bJ_bU-u8gemnPg":{"text":"Where to begin? I feel obligated to say once upon a time I managed the best Mexican restau","useful":0,"cool":0},"3uNCEaTLo9T8s3H-5KrFNA":{"text":"My fajitas were delicious except for the inedible corn tortillas,  which were not fried bu","useful":0,"cool":0},"9RphglHNB9fFrNS6tmBC9g":{"text":"The Stuffed Pablano Pepper was by far one of the best that we have ever had. It was very f","useful":0,"cool":0},"y4gtVQQo_zsbrO4zjwPbow":{"text":"Great experience coming in from the heat on our one day staycation for the 4th of July. Ou","useful":0,"cool":0},"q8RXS_e2eN5g40SkvVwmDQ":{"text":"Good service. The food was decent but nothing I had wowed me. The ceviche was decent but s","useful":1,"cool":0},"7plU07EJnqKBFG0EMtyu8Q":{"text":"WOW!  This place has really gone down from last year.  Overbearing bartender/Manager made ","useful":0,"cool":0},"P1wiPuNoMix3wVm61YVgCA":{"text":"Pineapple cilantro Margarita, table side guacamole, and chops and salsa...it was delicious","useful":0,"cool":0},"TBnJ3VKIPk4YchksyOietg":{"text":"One of my favorite stops in the French Quarter. The service is friendly, the food is alway","useful":0,"cool":0},"GTaWX7WplO38184VcF7b9Q":{"text":"In a group of three wanted to run my own tab and wasn't able. Plenty of open tables so I d","useful":1,"cool":0},"oxpIfYWXjn6vOPUge4O59A":{"text":"5 stars for the margaritas and 4 stars for the food so i give this place 4.5 stars. \n\nthe ","useful":1,"cool":0},"zEW9AbaR6qHc8DR88Pbrmg":{"text":"Whether in the mood for Mexican food or just good food this place will not disappoint.  It","useful":0,"cool":0},"hCpH-fCvkDt55XPgVEmW_g":{"text":"Love the fresh-squeezed margaritas, esp. the pineapple cilantro.","useful":0,"cool":1},"xGMq3lZnvM6UcUZn6DXt9Q":{"text":"Really excellent margaritas, made with fresh juices. The classic lime is actually lime jui","useful":2,"cool":1},"ZcJe622RPUMi6FTcoCehPw":{"text":"As of now I can only give testament to the flan and tres leches cake, but by golly are bot","useful":1,"cool":1},"xZd8g7qJCHabGqBaemQYDw":{"text":"Way flavorful. Lots of choices. A New Orleans twist on Mexican. Some lighter healthier far","useful":0,"cool":0},"4wAUuUozgZlHvNL_Juu5oQ":{"text":"yay!  finally someone answers the taco call\ncan you say enchilada?  cause I can, and their","useful":0,"cool":0},"2_SoeZho59K_StrYjTuRYQ":{"text":"Consistently awesome sauce. The 1/4, Lakeview and CBD. Pineapple cilantro margarita. Stuff","useful":3,"cool":3},"NMe1yW3GVtHsPbTm8ik9qQ":{"text":"Excellent service! Food was good, not the best Mexican but in New Orleans it's tough comin","useful":0,"cool":0},"qpS4Yw5TyC-nGHm4ieYAiw":{"text":"Looking for a good gluten free dinner? They have a separate menu, but almost everything is","useful":0,"cool":0},"F6LFq0tLbQbzh12RYRUdmA":{"text":"Great fresh Mexican food. Expansive menus. Good for vegetarians and meat lovers.  Terrific","useful":0,"cool":0},"ZG1M6hjnKT__otftiiazWQ":{"text":"The food was delicious and the service was great!!!  We especially loved the stuffed avoca","useful":0,"cool":0},"cU31pIUgJ7TiXzC4ISIfpA":{"text":"Food great but the margaritas are even better.  Great place to grab lunch if you are in or","useful":0,"cool":0},"si1jHQiJKz3gTs68LHGVrg":{"text":"It is 2016. Why does El Gato Negro ban splitting bills with more than 2 cards? There were ","useful":0,"cool":0},"SUT-GRAKIMFExFQ7DfLP7Q":{"text":"I drove from Baton Rouge and was excited about going to one of my favorite places to eat n","useful":0,"cool":0},"LnkJSPbyAKxZZG-_YmVV6A":{"text":"Its ok...  didnt like that fact that I have to an additional $2.75 for another round of ch","useful":0,"cool":0},"_mpc5T0G76pHfCUF9pAjfw":{"text":"We ate there Saturday for the first time. Everything was great - food, drinks, service, et","useful":0,"cool":0},"N3BXi45kLAuH6OK7UVh2ZQ":{"text":"We found this place by accident. It was a Friday night and we didn't want to fight the cro","useful":0,"cool":0},"WXqWZA3ZnS71AmpsRTkttQ":{"text":"Excellent customer service with a diverse vegetarian menu. Our group of four arrived at 8:","useful":0,"cool":0},"a-VAK18mXVonBUmfOyNmhQ":{"text":"This was the best Mexican food both I and the other 5 members of my party have ever had. T","useful":2,"cool":0},"6XJ-_zMAzlSItlR3N3J3GA":{"text":"The chorizo quesadilla was amazing. We also had the chicken enchilada; one of the best we'","useful":0,"cool":0},"sW2q5pBvNF8AP3MhJKiXNA":{"text":"I know it sounds ludicrous to visit New Orleans from Texas and hit up a Mexican spot but a","useful":1,"cool":0},"0Iwq4yHe_U_OG1HGokKrsg":{"text":"This place was amazing!!! We stopped by while shopping in the French quarter and I totally","useful":0,"cool":0},"dH8i5Pt7z88jgDUbRv5CWA":{"text":"This was my first meal on a trip to new orleans that involved many meals and it was fantas","useful":0,"cool":1},"RDWIIR0qN2Cb4_2w-Ilh4g":{"text":"Great table side guac and mojitos\nWhen you are roaming the French Market and all the treas","useful":0,"cool":0},"Y25ONl2r9IbN8E-6wAdnWA":{"text":"Love this place. Was here 8 years ago and came back for an encore. This is a great Mexican","useful":0,"cool":0},"Iunb-tBB2VyNPko4hqSg2w":{"text":"From start to finish, they provided superb service. As always the food was delicious.","useful":1,"cool":0},"Q0e1OqbiHxLf_MF6AfE1mA":{"text":"Just moved to the neighborhood from Texas. El Gato is the real deal cannot believe I found","useful":0,"cool":0},"GfIMfvLtn1sbDXktyHVIJw":{"text":"Sammy was the best! We had a challenge finding Mexican food here, but Sammy got us the bes","useful":0,"cool":0},"4e2SSZYz58BVxtK1K811tQ":{"text":"Terrible food and drinks. Please do not waste your money.\nOur drinks were served in big pl","useful":0,"cool":0},"dSqlqIjUYBlDbjY9lY8tPQ":{"text":"My husband and I rode our bikes to the Quarter for dinner on Saturday night.  After a coup","useful":0,"cool":0},"LhPPH6-6H6VxrM18Nn3ZfQ":{"text":"Ate authentic Louisiana fare for lunch so thought it was ok to have Mexican for dinner. Ha","useful":0,"cool":1},"Tkr351ONYyj5W8GgsGLixw":{"text":"Great little place on the edge of the Quarter by the French Market.  Delicious margaritas ","useful":0,"cool":1},"1DMjh9abw2y-Vqcner98Lw":{"text":"Everything about this place was great.  The service was on point and the waiter/bartender/","useful":0,"cool":0},"usoM3xv7yxcVWx9eajrI2Q":{"text":"Only good stuff to say.had guacamole and ceviche table side, delicious.\nThey have the best","useful":0,"cool":0},"oV9CSHwEO2L_w5XnCh2Mvw":{"text":"Great food, service and margaritas.\nThe cerviche very good, freshly made at the table.\nI c","useful":0,"cool":0},"uSYJ6jHRVYGqCH-8En_qQg":{"text":"Excellent service. Fresh ingredients. The best margaritas in the city.","useful":0,"cool":0},"8xwBGSev2evi0J0B1d50jg":{"text":"Joseph made us an amazing pineapple cilantro  margarita!!  It was amazing!!!  The owner ha","useful":0,"cool":0},"CC_TYguHPZhq0m1TmKj0Ng":{"text":"I know, Mexican food while in New Orleans?? Especially since Im from San Diego too! haha B","useful":2,"cool":0},"b9XZwEFtLW_y0-f6LnsWig":{"text":"Food is good.  Horrible service.  Host/Manager should be fired...we came in as a party of ","useful":0,"cool":0},"SYN-4lFtEyUdKhru94k-Hw":{"text":"Probably the worst Mexican food I've ever had. Waiter only came back to give us our check.","useful":0,"cool":0},"0QXCSFrU4l2WnzbRie7VwQ":{"text":"We loved this place! Service started out a little shakey but picked up after a bit. There ","useful":3,"cool":1},"Q-UNqoaHWEaPH5egSzghcQ":{"text":"I was told this has one of the best mexican food in New Orleans. (I am from Austin - so we","useful":3,"cool":2},"PGIqGPiYDjeSv7OShlQm9w":{"text":"Yum, great Mexican fare on the French market! Alex was a great server, recommend the pork ","useful":0,"cool":0},"prP0bm4r3YasVn0OHZ0IKg":{"text":"Great service and fresh food! I enjoyed a nice dinner while in the french quarters with my","useful":0,"cool":0},"C9vLKvCpEfUlSYNhqp8kOw":{"text":"If you want authentic Mexican food, not TexMex, near the French Quarter give El Gato Negro","useful":0,"cool":0},"QreA8WohJXR5kaobRaMiHA":{"text":"Had a blast here with friends on a whim! Owner was friendly and funny. Drinks were great, ","useful":0,"cool":0},"TRN7JltdUzuR_4NMU7Fosw":{"text":"Table side guacamole and dessert flan are the stars of the show, as well as a nice drink s","useful":0,"cool":0},"1GUgKg2i7WZqh8ivHliGjw":{"text":"I love this place they have a lot of delicious dishes and the margaritas are the best .","useful":0,"cool":0},"ugyFzbI_nfVpwB0bnOi8kg":{"text":"Waited ten minutes no waiter no food no service then left only left one star because there","useful":0,"cool":0},"-YlS2eYwPn-uE24S2W6GlQ":{"text":"The chips and salsa was a yummy thing to much on during our wait for real food. The tacos ","useful":1,"cool":0},"Ue5QvDi6HEDQg8zinrn4Mw":{"text":"LOVE IT!  Table side guacamole is the best.  Great sangria, mojito's and margaritas.  Food","useful":0,"cool":0},"ZtHqsrwIrpUNcN5sdEh5yg":{"text":"Descent Mexican food, amazing location right across from the FQMarket, cute & friendly sta","useful":0,"cool":0},"1GzjO3WDx1ivp75gJ8pnrg":{"text":"House margarita was super refreshing and yummy. Ordered the stuffed avocado as a meal and ","useful":0,"cool":0},"3O3V8DNI9GO9D-x9qTZTPQ":{"text":"You may not be looking for Mexican food in New Orleans but if you are this place is a wond","useful":1,"cool":0},"n7lZVrL5VOzwgh79aX-zRQ":{"text":"Passed by this little jem as we were actually on our way to a different restaurant for din","useful":0,"cool":0},"I5H-qSLCk4kM9Q5RbZl_MA":{"text":"The Black Cat is a cool little place for some good Mexican style food.  (  I refuse to get","useful":6,"cool":4},"EUoucOVt4cZo1Ziio9BJGw":{"text":"Decent food. Bottle pop (not a fan of), Charge for chips and salsa. Will not split tabs an","useful":0,"cool":0},"dcGeN_wZ0UNHHnq4zAQXMQ":{"text":"The food is good but the salsa and table side guac is enough for me. Add to that one of th","useful":1,"cool":0},"M-4rvy7xrw7of_QJaBaUiA":{"text":"James was the bomb dot com. His recommendations were on point and he changed my life. I am","useful":0,"cool":0},"1Vixys9K_bXXlLpK6W3V5A":{"text":"Fresh, simple and a solid choice for Mexican food in the New Orleans French Quarter. New O","useful":0,"cool":0},"QJxFKGAHzSaWdDHDSqgtlA":{"text":"The food was good, but the greediness of the business really turned us off. We were a part","useful":0,"cool":0},"QNLi8r74V5zjt8g81ZTaGA":{"text":"The queso hit the spot and added bonus it's served with tortillas. Shrimp quesadilla and c","useful":0,"cool":0},"DNyvIErTr9RTnoA06bz2Pg":{"text":"Decent Margs and the ceviche was good but WAY too much acid. They don't give it anytime to","useful":1,"cool":0},"wbSWRvLFiCqclTiRHgrcsQ":{"text":"Nicest host in town. Waiter was competent. Food was good but the guacamole was overrated f","useful":0,"cool":0},"JKAYcGUx_rh_od8z8DgLFQ":{"text":"Very good food and friendly service. Got the chorizo quesadilla and it was the best! Very ","useful":1,"cool":0},"N7YOX7cWfpeq2QSN6pUeYg":{"text":"Great food, better drinks!  If you are tired of seafood and want something different, try ","useful":0,"cool":0},"Z2yLp9oYs_-i0iKsj0l2lg":{"text":"Great service! The food was fresh and delicious! I'm glad I found this place! Prices were ","useful":2,"cool":1},"4KhuCuEpZKgWzvHUyTfynQ":{"text":"After my most recent visit to NOLA, I discovered El Gato Negro. I read many favorable revi","useful":0,"cool":1},"NPxi95V7EFqWqqKsqRIcsQ":{"text":"3 words: Pineapple cilantro margaritas (top shelf $13)   and to think I dont even like mar","useful":3,"cool":1},"tWa1bBLDP2hTRZQNriG4yw":{"text":"It is in pretty weird space... it is located at the end of french market. They are typical","useful":2,"cool":1},"DaMrYhjnmIgCBwL4GkcCkA":{"text":"They are not really open on Monday. Or, they are open on Monday whenever they feel like it","useful":0,"cool":0},"KbmXYqoyZdU3aa84ecj-bw":{"text":"A group of friends and I visited this restaurant last weekend as we were craving Mexican f","useful":0,"cool":0},"3-LaEq0poa6D_xR80zAyjA":{"text":"Hit this place every time I'm in town.\nGood food, especially if you like Mexican food. As ","useful":0,"cool":0},"KYqc8nb6s9y2GutOCx-NKg":{"text":"If I can give this place 10x stars I would. Best Mexican food I have had in a very long ti","useful":0,"cool":0},"8AVmc-ODAZmHUvk2FYeViw":{"text":"Salsa is crappy food is Bland they Shake rugs next to your table while you're eating. The ","useful":1,"cool":1},"ztDTWoNWBpUSshd-MECw3g":{"text":"Great vegan food options! Margaritas were good and the owner came out to talk to us!","useful":0,"cool":0},"mM3Iztow4KM4tGONS3zVig":{"text":"Wow! Great food , great service, great cocktails. I brought my family the one in Lakeview ","useful":2,"cool":0},"RZ1gi_Xa93bbx1y1tWIxMQ":{"text":"Great guacamole, salsa, fajitas, quesdillas, margaritas and great coronas!! Def. Recommend","useful":0,"cool":0},"9A_e8TP2P55OoAWEdw1y5A":{"text":"This is an excellent & unique restaurant, featuring unique Mexican Michoacan dishes. We ha","useful":0,"cool":0},"YamWDCOWvPCl5kgpQ4ljPA":{"text":"Amazing.... \n Crawfish queso\n Lobster burritto\n Corn tortillas rolled in store..... need I","useful":0,"cool":0},"oJ8zlrkSXVzFwHqxilVuOA":{"text":"Food is always good and servers are always pleasant. Prices are decent and margaritas are ","useful":0,"cool":0},"qRz4gbqsn-gWaLfIHLKefw":{"text":"This restaurant is like sitting in Mexico. The food is so authentic it's awesome. The wait","useful":0,"cool":0},"xvL6YwRm6D1q3qcV9y3rxw":{"text":"The place is great. Small mom and pop style, totally delicious! Great service and atmosphe","useful":1,"cool":1},"oBgUZy5AZk-8sOlRs_3-bQ":{"text":"The food was very underwhelming, I couldn't even finish my plate. The only thing saving it","useful":1,"cool":0},"UJd2BeOpq2KVvsKGrERuZw":{"text":"Great for vegetarian types. If you are out toward the French Market, stop in! Service was ","useful":2,"cool":0},"ftrjbWgveZZAuxlg6xsP0w":{"text":"I have found neither the food nor the drinks to be anything special here.   I was first dr","useful":0,"cool":0},"Q1cfr5X4zt5W2GcPE0As-A":{"text":"Great food and excellent cocktails with fresh muddled fruit.  Today we just stopped in for","useful":1,"cool":1},"rkOzKz1jLj_F2YRaU5nz2g":{"text":"Nice spot! So definitely five stars for customer service, our server Hope was awesome! She","useful":0,"cool":0},"kg13Q2h7koHUujbl0fYjlQ":{"text":"I've never had something here I didn't like. I'm a vegetarian and I order the stuffed pobl","useful":0,"cool":1},"qOMPuR6RTu1NWGRxWlVZ3Q":{"text":"This spot was great for one of the few Mexican joints in the quarter. The steak fajitas on","useful":1,"cool":0},"8qrz9hpdyFCOyX5_4RfOqw":{"text":"Good food and lots of it.  Table side guacamole was fantastic.  Pork and chorizo fajitas w","useful":0,"cool":1},"On20RFTn3OQLW6Euj1Ps5A":{"text":"Five star margaritas!  The best I have ever had.  The food is definitely four strong stars","useful":0,"cool":1},"UfZ63sc9GjB9XAAB0DZ06g":{"text":"Went here for dinner one night. Josh was our server. He was a bus boy at a breakfast spot ","useful":1,"cool":0},"O98bz3VQeqbRB9pDGV2KAg":{"text":"While NOLA is not known for mexican food, this is a great find! Very good classic tex-mex ","useful":0,"cool":0},"S4EH3Vdlmwv6PanLHXUlvw":{"text":"My grandmother had not had Mexican food in over 30 years and that time she had got food po","useful":0,"cool":0},"sYrODP_B2UJEKQjz--H9cg":{"text":"Nice place for a vegetarian Mexican find across the French Market. We had a nice fajitas w","useful":0,"cool":0},"Wl5bo_rjwt_jG4VNxXauaA":{"text":"We walked quite a few blocks to reach this destination, The Black Cat which turned out to ","useful":1,"cool":0},"cJZdgUryPvzi04jeCdPNBQ":{"text":"Our favorite Mexican restaurant in NOLA! The first time we came was on our honeymoon. The ","useful":0,"cool":0},"4Sqx5YdCyBOLwq01KFQ__Q":{"text":"Let's just say delicioso!  Omg there is a spicy tequila they make with a Serrano pepper an","useful":1,"cool":0},"AMrVU41ewpKSA6eTDeHvyQ":{"text":"I visited El Gato twice while on business in Nawlins. Once when I got there and once befor","useful":0,"cool":0},"MxtF2OrjcVrYvvUdlT8hAQ":{"text":"Wandered into this place in part because of the name-my daughter's cat, Cleo is black, in ","useful":1,"cool":1},"aPePXaHKbLATHNpmi6kr2w":{"text":"Nice place and good food here come the buts though. But pricey, but everything is extra an","useful":1,"cool":0},"TdfcSYIT6c1teDz1fCtl2w":{"text":"I would love to drink 600 carrot and lime margaritas, but that would probably kill me. But","useful":0,"cool":0},"ooiergeXw3qMcFBFpwlHGw":{"text":"I just got finished eating my leftovers from lunch at El Gato Negro yesterday and felt com","useful":4,"cool":4},"cHxVvuQai43VwomeMsmUBQ":{"text":"Service was terrible. Our server was so rude. She rolled her eyes all night at our table. ","useful":0,"cool":0},"-ujS077x_M24ZsfmKwc2aQ":{"text":"Best Salsa and they will pack in a liquor bottle so you can take it home (for a nominal fe","useful":0,"cool":0},"JTa0z4eYfSKneYy7TMKGsQ":{"text":"I am uncertain as to the name of this dish, but my best friend and I split it so we didn't","useful":0,"cool":0},"W9GGLNUYjatSvVP_42aPzg":{"text":"Way too overpriced for Mexican in my opinion. Had I known I'd be spending $30 for lunch I ","useful":7,"cool":2},"W9JMDP-hFMqdKeCM7533zA":{"text":"Tom was AWESOME. This place has the best customer service. This is my first stop after che","useful":0,"cool":0},"DuBhtpdMfR1Z7o5eIYaZBA":{"text":"Okay, so this place is AMAZING! I had breakfast here with a friend on a Saturday morning, ","useful":0,"cool":0},"g7bnvQWW9fOWu9HriRsttg":{"text":"This place is amazing! I wish they were across the street from my house. Everything was de","useful":0,"cool":0},"uBb1GrcBLp1DpVSbezxsgw":{"text":"Fantastic!  We ate dinner here the other night.  She had pork quesadillas that were fantas","useful":0,"cool":0},"pyFgkx-jaDLF1Dx-ERC9nw":{"text":"My family and I just stumbled on this establishment. We are in New Orleans for Mardi Gras ","useful":0,"cool":0},"3vgqCz_9PJEHJdhgkJu6CA":{"text":"Fabulous. Too many Tequila brands to mention, including their house homemade.  We had this","useful":1,"cool":0},"Ov86LsvR5dIKN5Yeb4Sf8w":{"text":"This place is definitely as good as it gets! I was recommended to come here by a friend, h","useful":2,"cool":0},"KOos68YVmyz3bXjq6dNB8g":{"text":"Can't say enough nice things about this place. Service was AMAZING, they made us feel like","useful":0,"cool":0},"n3QcAdEsK-WLQPUUTgXjCA":{"text":"Good food and drinks, but busy for an early afternoon meal. Service was slow due to the cr","useful":0,"cool":1},"6OKCJ4acNDQhyZ9M8FL7oQ":{"text":"Wow. This place tastes like the street vendors in the small towns in Mexico. I've never ha","useful":1,"cool":1},"yqx2iCaaZCkO_34hI2_gyA":{"text":"We love Mex but this place was just awful.  The place was roughly half full.  We went in a","useful":2,"cool":0},"lxU52M8wg31-fAx8TpF7Rg":{"text":"Fun Latino waiters and a Yelp top shelf margarita check in offer!!! woo hoo!! lol\n\nWe orde","useful":3,"cool":1},"ZM31hhnMERPFpPq4GsohtQ":{"text":"LOS SCALAWAGS !!!\n\nONE TACO: $10.75\n\na 6\" flour tortilla with just fajita beef ($5.75), al","useful":11,"cool":5},"89sHVEXxaQOqmTaKOZ1NwA":{"text":"We walked a couple of blocks to find this place. The waitress and her team welcomed us in ","useful":1,"cool":0},"leSRjsG1TNuJPnTZ2FAlpQ":{"text":"By far the best Mexican cuisine I have ever had. Everything from the drinks to the food ca","useful":2,"cool":0},"r-1EwNgd8HvpdzvlLsdY4g":{"text":"Great food freshly made with many local ingredients. We had several of the tacos, margarit","useful":0,"cool":0},"uK-dADbrjWY_qDWhkJgwHg":{"text":"One of my favorites to fall back on when all else fails, and one of my favorites to go to ","useful":0,"cool":0},"1pV55qOY_myCtPs9ProFyg":{"text":"Awesome Mexican food!!!  Carne Asada was absolutely perfect.  Homemade corn tortillas and ","useful":0,"cool":0},"ohiOfeIeWrB_lbTUX6BwFg":{"text":"Amazing service and the food was super delicious. The Burrito de Mole was everything i exp","useful":0,"cool":0},"0TOyF4Vkfooyo3ulQ6Yfmw":{"text":"Fantastic food! I could eat there every day and not get tired of it! Always start off with","useful":2,"cool":2},"2bZ5wIRkEcVVMIhR56VTGA":{"text":"I tried the french quarter location a day after a mixed and frustrating visit to the Lakev","useful":1,"cool":1},"CpzEGJsEFQiTE2X7d6YTcw":{"text":"What a delicious place! This restaurant was recommended by a local, and she was right--the","useful":1,"cool":0},"pUeb--1zhpWudX_sPYhNMg":{"text":"Beat place in New Orleans for Mexican food and tequila!!  Prices are great and it's nestle","useful":1,"cool":0},"MkCF08LSTEbfdq3Jgs9Fkw":{"text":"This is by far my absolute favorite Mexican restaurant in the greater New Orleans area han","useful":0,"cool":0},"UDrfssW_7UyXEg-seh42iw":{"text":"When I lived in the French Quarter for awhile we did not go out for margaritas. We discove","useful":1,"cool":0},"yj0MVKG2kJpTvvyR821H9w":{"text":"Tequila... it inspires me to do really really stupid things... like drinking more than one","useful":15,"cool":10},"7bKOjrAD8ADAd7T65vYxqw":{"text":"HOLY SANGRIA, BATMAN! This is some good stuff and even if I hadn't liked my meal, I would ","useful":3,"cool":2},"rRbQ8kz1rb8h1Vh2renyEg":{"text":"I am very disappointed with what happened tonight. I had 8 friends come in form out of tow","useful":0,"cool":0},"UQK4FrAkJcHFgq-0ppRehQ":{"text":"Five stars across the  board. \nFood =5 stars\nService = 5 stars\nAtmosphere=  5 stars\nDefini","useful":0,"cool":0},"_O3bLyKVaHf16tSoD_xJfw":{"text":"It's all about the lobster burrito folks. It's amazing. Great margs and chips and salsa, t","useful":1,"cool":0},"4z257X9Eh5vE86JEdCr6KA":{"text":"I love El Gato Negro in the Quarter. We eat there often and I always leave feeling pleased","useful":0,"cool":0},"Tcgt9c9C76S1MvZNGH9LEQ":{"text":"Went back tonight due to excellent first experience and Gambit's good blessing as one of t","useful":0,"cool":0},"KHqYxz3OJRLD22e3zYwSbw":{"text":"Best queso fundido, creative margaritas, nice wide menu selection.  Super GF menu.  One if","useful":1,"cool":1},"TmQ0WDAue-hiruQpO-4LCQ":{"text":"Good Mexican food in New Orleans is difficult to find. Before reading any further in this ","useful":2,"cool":1},"qBufxz0xx_pERfDMJhlJuw":{"text":"My 1st visit to the place and went on a friend's referral.  I wouldn't suggest it. The ser","useful":0,"cool":0},"q8WqDI4lPBDKvdW49_Z3GA":{"text":"El Gato Negro is such a cute place. I'm used to Sonoran Mexican. I would describe El Gato ","useful":1,"cool":1},"d9XCmNBUD7FGBWF9g0dAig":{"text":"El Gato Negro is hands down the BEST Mexican Food in the world. I've been to Mexico severa","useful":0,"cool":0},"lUUvWeZboW3FBrsg5-BDVQ":{"text":"Incredible margaritas (strawberry vanilla and Cadillac Satsuma) to go with Ceviche and Car","useful":0,"cool":0},"P3YckBh00PSZOq9Dy5UpNA":{"text":"Yumo! Gave us a free delicious dessert beverage of milk, cane rum, and vanilla (not why th","useful":0,"cool":0},"D6tHt5IR9o1MMfi62hkMqg":{"text":"I rarely give poor reviews, but I seriously hated my meal at El Gato Negro. I'm giving two","useful":0,"cool":0},"tKeL5L6nqUY2TA3lD3GCKg":{"text":"We are both fans of Mexican food and decided to try this place on the last night we were i","useful":0,"cool":0},"tHVd8jYQUtIB5o56fcFdBg":{"text":"Best Mexican spot in New Orleans. Also one of my favorite overall restaurants in New Orlea","useful":1,"cool":1},"XWvCc6R31wK-QAdRFu3Irg":{"text":"Party of one for dinner promptly seated and my server Jorge immediately took my drink orde","useful":2,"cool":1},"1QtuTF7ZUc0YxiltNPKwfQ":{"text":"We walked by this place when we went to the market and stopped in. They had delicious auth","useful":1,"cool":0},"OJC8blcXX8cbFh1yyUpoKw":{"text":"This place is a tourist trap. Overpriced, tasted like dog food. Never again. Good service ","useful":0,"cool":0},"HdQJNZX714ubJlp7UBv3gg":{"text":"Delicious guacamole! We stopped in for just a margarita and a snack and it was fantastic! ","useful":0,"cool":0},"Y3l46P8qR_ApPz0jG5KzsQ":{"text":"Great little stop grabbed some margaritas and bailed but the food and atmosphere looked gr","useful":0,"cool":0},"pfMnW-K95x9aWEReNjSugQ":{"text":"Ate here with two friends after a friend of mine moved in down the street.  Although not a","useful":1,"cool":0},"As5CV4Ocl9e86GZU3XGeow":{"text":"Not a fan of this place! I was looking for a Mexican restaurant around French quarter and ","useful":4,"cool":1},"34TboiL2j6yQg5U6yStOUw":{"text":"ok to those who gave a bad review,,,,, you're spoiled\ncome to the midwest and see what the","useful":1,"cool":1},"t3OcsSUcF_nOUHbii6OS0w":{"text":"Best Mexican food I have ever had. The pineapple cilantro margarita was excellent. Try any","useful":0,"cool":0},"b8pG5oocrFe1OX84BWXXSw":{"text":"I'm not sure who had been rating this place so high but they might be employees!\nThis was ","useful":3,"cool":2},"Sygj-awxIFi7buIhH7qMZg":{"text":"Party of one for dinner promptly seated and my server Jorge immediately took my drink orde","useful":2,"cool":1},"U5wv3_bl2_tuhLrrr6i8tg":{"text":"NOLA-TINO: ambiance, crowded noisy and festive;\nMEXICANS: even love it here! Cilantro Pine","useful":7,"cool":1},"yFhyHxQceLH4a6n1Si8RWQ":{"text":"This place was amazing. I think I said \"this is so good\" in between bites about a hundred ","useful":0,"cool":0},"sy4ZZC-6c4OJIlwpQpz0lw":{"text":"Walking up and seeing the crowd, I knew this place was for us! Being from Texas, I feel li","useful":0,"cool":0},"KXTN9KPwlBaRqlqrjy-uXg":{"text":"Cute spot with many healthy and vegetarian options across from the French Market.\nWe sat o","useful":4,"cool":2},"1HcgYm1vMoohCvmHeBJF8g":{"text":"Must try Seared Oaxacan eggplant with chicken & shrimp with a delicious creamy tequila gar","useful":0,"cool":0},"J8aIyqAGVGoz9esnFYH10g":{"text":"Well above-average Mexican food. The menu has a good selection. The service was slow at ab","useful":4,"cool":1},"KIRu1NLtLVCFtt4zXkFG-A":{"text":"Always a 5 experience!!! Try the ceviche, stuffed avocado, tamales, or the special of the ","useful":1,"cool":1},"KoFH72_aRQGm_xTXZebizA":{"text":"So I dont like mojitos.  Had one years ago that tasted like what I think a pine tree might","useful":0,"cool":0},"zhSE4ZstsIWe6HvVHy5ZZQ":{"text":"i went to el gato negro and the tacos were very delicious!\nSara Beth Wulff, 7 years old\nth","useful":0,"cool":0},"-J08YdWW0ZbHM1F-qUP5Ng":{"text":"This place is no bueno! Seriously the food here is just not good and the margaritas are ev","useful":8,"cool":4},"C7mFnkeaGnjcthqa8YsuAA":{"text":"Extremely disappointed in this place! We spent a full week in New Orleans and had absolute","useful":1,"cool":0},"hUCm8Gd32BG6OV_iGXS3pA":{"text":"Every time I get to New Orleans I have to make sure I visit this place. EVERY thing here i","useful":0,"cool":0},"OMLVhPH1fyV55RtMr6TqCQ":{"text":"This is such a good Mexican place. Everything from scratch. Great friendly service and our","useful":1,"cool":0},"FqKONY8UmYjZpkOdsk9k0A":{"text":"Amazing service AGAIN from Isabel. Always my first stop after checking into hotel. Mojitos","useful":0,"cool":0},"ygpqr4dzuEJ03sCtJCdG0A":{"text":"Overpriced and very basic Mexican food. Doesn't really have much flavor and limited select","useful":2,"cool":1},"GT6S_bSne38YPiqgFXIPgw":{"text":"Usual place to eat when out of town guests want to shop the market. Was very disappointed ","useful":1,"cool":0},"jSOEEwDAzMCM8jmpZKrpkg":{"text":"Apparently having 9 available tables makes them \"too busy\" to seat 3 people according to h","useful":0,"cool":0},"UAlZW87qcU977y5vSwBsSw":{"text":"I have been here three times.  Great food and great service everytime!  Each time I go the","useful":0,"cool":0},"yo16Hi5xZ3Uuco5StaYESw":{"text":"We were a party of six, we were seated promptly. We came on a Sunday night. A previous rev","useful":1,"cool":1},"P4o1xizBXTZkzD7ebGFTtA":{"text":"I frequent the Lakeview location often. The staff is great! The food is even better. We al","useful":1,"cool":0},"Ym_TGkswECyWh7cRmWX2Ng":{"text":"Party of one for dinner promptly seated and my server Jorge immediately took my drink orde","useful":1,"cool":0},"q14qUOMMfFRY7fLbchZSow":{"text":"Warm welcome from the owner but very poor quality food. Tacos come with just meat (in huge","useful":0,"cool":0},"FAWOp3p4ig3tClP4-z7e2g":{"text":"I love tacos.\n\nThis place serves tacos and has a 4 star rating after close to 400 reviews.","useful":3,"cool":1},"pSLvaU7YbYTy_KFYe6hH6Q":{"text":"You have the gamet of food selection whin in NOLA but give this place a try. 3 locations a","useful":0,"cool":0},"tKoNxxwQJK_F4sDs16eYlg":{"text":"As we love Mexican Food we have tried this on our last two visits to New Orleans.  Once fo","useful":1,"cool":0},"mnvtpZ0hFj_AmqoXAo4lrQ":{"text":"We had the Pineapple Shrimp Habanero as an appetizer & the Chicken Enchiladas. They both w","useful":0,"cool":0},"4T__hxBN6KC-AIEipzrh0w":{"text":"After hoofing it through the salty, malty atmosphere that is the French Quarter, we decide","useful":2,"cool":3},"1mRorF8oI1oQKnNMKPU2ig":{"text":"Great food! But I was freezing cooled though my meal, I wish they would have turned the he","useful":0,"cool":0},"iXC3fGGegWkBPowuEiJxnw":{"text":"This restaurant was highly recommended by a wait staff from Baton Rouge. So, I went there ","useful":4,"cool":0},"7e81v66Gkq6FSgpmPhX3mQ":{"text":"My husband and I ate here last time we were in NOLA visiting family. \nWe're both vegetaria","useful":1,"cool":0},"Go7XzTXAikbvrfPtiLC0tg":{"text":"Sarah W's review is stupid. She didn't even eat there and gave them 1 star. The food is gr","useful":0,"cool":0},"FB4TarG4DOq__04rVSjkKA":{"text":"Very fiesta atmosphere. \n\nPros: \n-Tortilla chips with salsa \n-Ordered the fajita, not that","useful":0,"cool":0},"EXmbbJbw2vGiZ67MpaemOQ":{"text":"Found El Gato Negro on Yelp, since I have never been to New Orleans. We walked from our ho","useful":0,"cool":0},"ikG2wALq01KjLLZSqi2KcA":{"text":"Amazing food and drinks. Great service. I eat here every time I visit NO. The strawberry m","useful":0,"cool":0},"dOGkTPZUukX0SGCRfBhfVw":{"text":"This place was recommended for its skirt steak, and we were not disappointed with the reco","useful":0,"cool":0},"ucr-k93eBezZNqQLtKDwSw":{"text":"Enjoyed the Mixed Grill with a glass of Pinot Grigio. The food was cooked to perfection an","useful":0,"cool":0},"uB8IzxZlzt9chZcybf7PIQ":{"text":"I was in the mood for Mexican food and booze (a common problem for me) and since I was in ","useful":3,"cool":1},"417BMITmG6rYtFtM6DJtHQ":{"text":"I am sure to make a visit here when I am in New Orleans.    Some of the best Mexican food ","useful":0,"cool":0},"Yrkh9POpGRi2aeFhQhr1hw":{"text":"Great place to pick up a margarita to-go while wandering around the French Quarter. I know","useful":1,"cool":3},"qojLKCEx99QiF5uM5IcKUQ":{"text":"I've actually only been here once, and didn't try any of their food, but sweet juicy lords","useful":5,"cool":3},"Q9-CISlNDj6hfqja1At6VQ":{"text":"Stopped in here for lunch while on vacation. The food was good and the portions were a nic","useful":0,"cool":0},"My_3BE3HJxUfNtGdWWzMiw":{"text":"I have a love affair with the Stuffed Poblano Pepper.  I've never had anything like it.  S","useful":0,"cool":1},"XHCFG9JWVXpmP1ibvkwvcg":{"text":"Try the pork anything.  Everything was tasty and well prepared.  Orange lime margarita was","useful":0,"cool":0},"34PW94x8TKkwAvH-5HOhOA":{"text":"Came in on a Sunday night , no wait for us. Waitress was polite but stated she wanted to a","useful":1,"cool":0},"yp3c6u0K0Gobmrg8kWFwOw":{"text":"I go back and forth on this rating. I could probably give 4 stars but my burrito wasn't go","useful":0,"cool":0},"0qo-q8Gfqg8C88_mr_VWKQ":{"text":"So good. Chorizo quesadillas are excellent as well as the handmade corn tortillas and carn","useful":0,"cool":0},"RL_BSb35a9cXuH4Mh1acGw":{"text":"Good place to have some mexican seafood. Came for 2020 New Years and found this place that","useful":0,"cool":0},"sVqRIw2T7wW4OBrvb4MSkg":{"text":"Good chips and salsa - first serving is free, which could be a problem for tables of 2+. D","useful":0,"cool":0},"5cJQoK0osGgnZ59KXh2tQQ":{"text":"First time here, was a little hesitant since I am a vegetarian.  We tried the Stuffed Pobl","useful":1,"cool":1},"VkODBMZTBQOXrsuPvy7WdQ":{"text":"We were too full to eat here but had to take the tip from other reviews that have raved ab","useful":0,"cool":1},"3z1YQi4CM1B0Sqb5jvbqbQ":{"text":"El Gato Negro puts out some seriously great Mexican fare, with a decidedly New Orleans fla","useful":4,"cool":4},"SdLnDoUcW4BuAPxK_6bj9w":{"text":"Came for lunch.. Ordered tableside guac and it was super amazing!! They serve chips with s","useful":0,"cool":0},"iKlt0s9fHAqsx2-oaI1mog":{"text":"Love this place!!!!! Table side guacamole was delicious!!! Yummy margaritas and very filli","useful":0,"cool":0},"G12zb-toGMDvosguEjdCag":{"text":"Solid! Good drinks .. very fresh. We had the watermelon margaritas- not too pricey for top","useful":0,"cool":1},"96QduMoYEkaPOmiMLq7WpA":{"text":"Cat got your tongue? \n\nBecause I live in Los Angeles and we don't have many Mexican restau","useful":71,"cool":73},"ZV57NiWYA1G59c-gzS-jZQ":{"text":"Not even open. Took an Uber and wasted 15 to go there and doors were locked. Please update","useful":0,"cool":0},"9kFiIoNAMSaztoukLCCnJw":{"text":"Stopped after the distillery tour since the shuttle lets out right in front! Great decisio","useful":0,"cool":0},"qjhHwybDwGQ52KxWpNGSkQ":{"text":"Off the beaten path but well worth the walk. Great complimentary salsa and chips. Healthy ","useful":1,"cool":0},"-AL1HnNbJjhbAy0iuI2mJw":{"text":"Delicious!  I was jonsing for some affordable Mexican food after eating so much expensive ","useful":0,"cool":0},"keWq-Hboh13PBXFFwEoYtQ":{"text":"I'm trying to give 3 stars but just can't. Food is mediocre at best and too expensive for ","useful":0,"cool":0},"JamNf6JTNtvHP9xQNYyT3Q":{"text":"Been to a lot of Mexican restaurants in NOLA, and this is probably one of the best, top 5.","useful":0,"cool":0},"Jym3bXr5mSEb8teEThYkuA":{"text":"AMAZING AND INCREDIBLY FLAVORFUL FOOD! This was not on my \"approved\" list for gluten free ","useful":2,"cool":1},"ctYpwGFc3eBaJVdQvxjauA":{"text":"Best mojitos I've ever had anywhere! Everyone is so nice and friendly! Food is also delici","useful":0,"cool":0},"rf7mIsT4u-E1xDKulbMYSA":{"text":"The food is delicious and the service was pretty good. Unexpected charges are never fun- s","useful":4,"cool":2},"OQqMnp4mozdRvwFhGFqixQ":{"text":"I read the reviews on the stuffed avocado, and after having it, I'm adding my accolades, n","useful":1,"cool":1},"kk8i57w255QSMPrYHxlFXQ":{"text":"My wife and I came here for the first time and we ordered some Tacos and appetizers and we","useful":7,"cool":3},"1pnG71m4SzpQbvJzGxy1xw":{"text":"This place only gets 3 stars for a few reasons...\n\nWe went in on a Saturday night around 8","useful":2,"cool":1},"xgn_AKdqab9uT1MaALs0tw":{"text":"All I can say is QUE RICO!!!\nLocal recommendation that did not disappoint. The food is fre","useful":0,"cool":0},"Lr-gLW-gValqfQK8OFq7LQ":{"text":"The absolute best margaritas and authentic Mexican food we've ever had! Their salsa and wh","useful":0,"cool":0},"CcQppJ8UKGxuNZfQyfRsAA":{"text":"Fantastic table service taqueria food next to the French Market.  Everything was fresh and","useful":0,"cool":0},"gdwRJVAX7ycoW3kdMTZDLg":{"text":"Love the poblano stuffed pepper, fish tacos, ceviche....it's all good.  The mezcal margari","useful":0,"cool":0},"5d4NCehwDHW-y9sWe-8T1g":{"text":"We had breakfast here one morning. I like that they offer some vegetarian selections, whic","useful":1,"cool":1},"Q2wQIBwXP22G8X78c3QkvA":{"text":"Had a conference at the convention center and this place was solid. I came two of three da","useful":3,"cool":3},"ipaY9jglesaSszyu9dPL2g":{"text":"Party of one for dinner promptly seated and my server Jorge immediately took my drink orde","useful":2,"cool":1},"1lTmbC2SS7abqLKcJCLUfg":{"text":"This place is off the wall great.  If you are in New Orleans and want great Mexican this p","useful":1,"cool":0},"mO8Hg173yJVKa5REzJDoyA":{"text":"Came here on Mardi Gras day and only waited a short bit before being seated. the wait was ","useful":0,"cool":1},"UUr1xNdNCt4dLHCjLRm_PA":{"text":"Coming back here again after moving to nyc.   \n\nStill the best food and drinks my husband ","useful":0,"cool":1},"Xb462AMVddFeJfSdqDUXjQ":{"text":"El Gato Negro puts out some seriously great Mexican fare, with a decidedly New Orleans fla","useful":2,"cool":2},"HJ2jXx_eC4P0_1VWDxV1zw":{"text":"This place was pretty good! I got the stuffed avocado with corn tortillas. The tortillas w","useful":1,"cool":0}}