{"b-HmiOfzln-KZwlSsMPprw":{"text":"Loved this place. Nothing better then going to eat and leaving completely satisfied. Great","useful":0,"cool":0},"CfQqhj7VJCbg-qGxi9xKhg":{"text":"Omg the best Po Boy I've had during my stay here! Unfortunately I didn't have the opportun","useful":0,"cool":0},"Qe8kzTLho0Xq3qP8t0nSeQ":{"text":"I was lowkey disappointed with the catfish and shrimp platter we received. The garlic frie","useful":0,"cool":0},"GbzvwWUMpHpeRGh7Q8NGcA":{"text":"This was our first restaurant that we stopped at while visiting New Orleans. It seemed lik","useful":0,"cool":0},"4NZHEGPX4NRNxWpYfUeeOw":{"text":"Just stopped in for a beer. We didn't try any food so that's the only reason why I gave it","useful":0,"cool":0},"NS3a-SY2DIgiZwN171mc3Q":{"text":"Stopped in on the walk home from House of Blues. Great table available on the balcony to e","useful":1,"cool":0},"mAuFetJcTtwIScMxhahsMQ":{"text":"I LOVE this place! I've been on 4 NOLA trips and I eaten here 3 of those times! I'm pretty","useful":0,"cool":0},"0Zk-F576pUqzSGfBDAhmYw":{"text":"Of course this is a tourist trap right in the French Quarter. \nThey have really nice AC an","useful":0,"cool":0},"IZWmGWsLI5_QbQ2n6qoPJw":{"text":"This location is not worth the money.  Does not honor the same pricing as the other local ","useful":0,"cool":0},"1-i5gjKR13xJIia4umqZ0Q":{"text":"My personal experience would rate a '0' star. However, we will look past that and average ","useful":0,"cool":0},"ld4bmuLhnx8rA14u8HNT4Q":{"text":"We mostly picked this place because it had balcony seating with a view of the ferry and wa","useful":0,"cool":0},"TII5vvGWyWInCDl0j4jdXQ":{"text":"My party and I came ten minutes before closing and the employee were not happy to see us. ","useful":0,"cool":0},"bjD9VIyhpBs1nkUtB-64lw":{"text":"Very tasty food but what is the point of ordering an appetizer only to have it be brought ","useful":0,"cool":0},"aZmc-mw1ELNf7wurWY5dvA":{"text":"It was poring rain so our group of twelve friends took shelter in the Decatur Street resta","useful":1,"cool":0},"4xTbqxxs3N0T4-gq3PFcsg":{"text":"Sometime simple is the best. After a long day this is a nice spot to grab a simple no nons","useful":0,"cool":0},"61qvUjW6yYW2tVIVqrSCxQ":{"text":"I hate to be negative here, but I wanted to love this place and couldn't do it. We came he","useful":1,"cool":1},"jAXZYaVAZQvuLcArWsu2uw":{"text":"The food was incredible and the service outstanding!  I would recommend this place to anyo","useful":1,"cool":0},"3JpLu_wfmE4ib0coGHtqHw":{"text":"I Had some alligator poppers and an all American Burger. The alligator was really, good, i","useful":0,"cool":0},"QRNnUxjoB8-SequYQ4IVog":{"text":"Food was good. We walked right in, no wait. I wouldn't go here again. Not in this city. No","useful":0,"cool":0},"TjK-Ky8ZdwurxucTnPwFNg":{"text":"We had a party of five which included two kids.  Our food was prepared quickly and best of","useful":1,"cool":0},"_eTzghZX_PGcQC1VRZ6mYQ":{"text":"I came in here with four other women for dinner. \nI ordered a burger, medium rare. It was ","useful":2,"cool":2},"sxX0dp6qQLfLrPrhFz8BsA":{"text":"I had a vicious craving for some oysters, and didn't want to break the bank - this place f","useful":0,"cool":0},"WW-lBNuZgyEbSTK62u0Wwg":{"text":"First time here ... service  was fast and the food was ok... Tour guide recommend this pla","useful":0,"cool":0},"v9alf4pxyyH5OOmHpljVXw":{"text":"Everything was great! Hamburgers are awesome!! Catfish was great. The fries are excellent.","useful":0,"cool":0},"88TVcHeX8fnArtpcWbrQAA":{"text":"Al was behind the bar and was so personable, wonderful, and funny, he made my visit there.","useful":0,"cool":0},"M768JQ_N0V3dEY5QBIGceA":{"text":"I was recommended to come here because the food was delicious and it was. I ordered a catf","useful":0,"cool":0},"p4Td2T0Mmd8awLmOgoI00w":{"text":"Great service from out waitress,,,,good beer prices,,,boudin balls were awesome !! The one","useful":0,"cool":0},"sMaoXp9ehoJnRpRnC2ettg":{"text":"Chicken fingers basket because they ran out of grilled chicken! I could have passed. Chick","useful":0,"cool":0},"xdRYJFddtSF7nglNU5hZcg":{"text":"The food was so good! I ordered a little of everything. So for starters we had the boudin ","useful":1,"cool":0},"Ort8ieUhcvwnKQnd2Qx4mw":{"text":"We always eat here when we visit New Orleans.  The Triple Sampler is delicious.  So is the","useful":0,"cool":0},"9Z32XuKxHmdNhlY3XWIUmQ":{"text":"Stopped in here for a beer and apps, and this place didn't disappoint. Cold beer, friendly","useful":0,"cool":0},"OfRDO6zCf86sHJtp9_rrPg":{"text":"Great spot for a touristy meal with a view! We are here and The Royal by far this restaura","useful":0,"cool":0},"d5GgRSeQT6Q1JcKegnM4wQ":{"text":"My husband and I went on a day trip to NOLA for our anniversary and stopped here for lunch","useful":0,"cool":0},"jc24kiVZ3HkiHcvtne5KlA":{"text":"The fact that this place is called New Orleans seafood is a joke. The thin fried catfish i","useful":0,"cool":0},"U8JIgJjhzyzVdSoFGvJ4IA":{"text":"Top Story: Check out my review.\n\nGreat new location for NOHSC. The balcony is a wonderful ","useful":3,"cool":1},"oxzvFnuqM7igcs7OBp-F-w":{"text":"Yummy 44Rum drink! Stopped in while waiting for our dinner riverboat cruise to begin! Frie","useful":0,"cool":0},"qU_AzbhDQjYHFdkU2n505A":{"text":"Went on two sep occassions to get the Natchez' exceptional Captain Villier some dinner for","useful":0,"cool":0},"K59jZqKE8f6jtF0kG5BbGg":{"text":"When my wife wants a hamburger, in the French Quarter, this is where we go. Definitely som","useful":0,"cool":0},"Z50T3RL6les2DGPq2ZzK2g":{"text":"Came here as my first stop in New Orleans with some friends. Just off the plane and checke","useful":0,"cool":0},"JPk94A4pagnTYMC7EA0lzg":{"text":"Ate at the French Quarter location off Decatur.  Service was good.  Food was nothing to co","useful":0,"cool":0},"F-n1PKw1RPocK_Id7guBww":{"text":"The oysters were fresh and among the best I've ever had. The thin fried catfish was delici","useful":0,"cool":0},"5PwGIxxWrqwOo_QzxfGXAw":{"text":"Great food! We had the crawfish queso, gumbo, and boudin balls. All were really good, gumb","useful":0,"cool":0},"GhbgSBhmXGOn26HAFB-6hA":{"text":"My first food visit here was disappointing. I gave this place a 2nd chance on their food a","useful":1,"cool":1},"Bd5ef9-MLYVBy8KxqGEiqA":{"text":"Shrimpzilla  poboy  with extra gravy and garlic fries are a MUST!  OM NOM NOM!!   Great se","useful":0,"cool":0},"kK4xYcZTxndOJPl9gR5L0A":{"text":"Wonderful food, strong drinks and great service. Had a large party and Renard took excelle","useful":0,"cool":0},"rBW42_QjrCPu4_62Qa0k0A":{"text":"Service was on par.  The 44 is a potent drink if you're looking for a Hurricane alternativ","useful":0,"cool":0},"IdIs_Cy1EmA3icp8uN-_NQ":{"text":"Showed up with a group of 10 for a late Sunday lunch 1:30. We were promptly seated and the","useful":0,"cool":0},"Mt5PTwsrJD1hXtdicQ5v6w":{"text":"After the tour guide recommended this place for the catfish platter, so we went to check i","useful":0,"cool":0},"G-T3k4c4qSQdhsn4i22FzQ":{"text":"Stopped in for lunch.\nGot the 44 drink.  Tasty, little pricey but it has lots of liquor in","useful":0,"cool":0},"C64F029O3nNAytKrqMoJUw":{"text":"This place gets two stars based solely on the garlic fries.  They were quite delicious.  T","useful":0,"cool":0},"1i7V3tEME7mrnBuubkIlBA":{"text":"Not a completely fair review as we only ordered apps, but the crawfish queso, gator popper","useful":0,"cool":0},"GFfiXrLTt7ItBa9g0b4UZQ":{"text":"The food and service was Great. Server brought a sample of the soup which was delicious. G","useful":0,"cool":0},"zQINJEboO6dh5_4M_OAnjw":{"text":"Great little joint off Decatur St in the French Quarter.  I wanted a shrimp Po Boy and end","useful":0,"cool":0},"QpRLJIL6kfSPh-moJBquNw":{"text":"Food was so good.  The thin catfish was very very good.  Loved the shrimp and oysters.  My","useful":0,"cool":0},"Sl4K55roR3mERUjg4xEfaQ":{"text":"Fried catfish was excellent; very good coleslaw too! Fast, friendly lunchtime service. I'l","useful":0,"cool":0},"B-VAwf2ZFmHsLHavXmtTsg":{"text":"I came to NOLA sometime mid-March as a last minute 'detour' to my trip, and I had so many ","useful":0,"cool":0},"qcN0rnnRlKk3uAWGc9eJtA":{"text":"Everything is delicious from the turtle soup to the catfish and oyster and allagator YUMMY","useful":0,"cool":0},"343pF3qHO6a-m4jN33XqnQ":{"text":"Had the roast beef po-boy and my sons had the All American cheeseburger. The roast beef ne","useful":0,"cool":0},"1eZTFB3D583m6BLZUOpPMw":{"text":"Really friendly staff and the food was worth the 15 minute wait. Ordered the house signatu","useful":0,"cool":0},"N48cxcgXL1QmN8TnErgkMw":{"text":"Slooowwwwww service. Really slow. Server forgot silverware until well after food was serve","useful":0,"cool":0},"uFX7AhBCQtybgvrGMrGhpQ":{"text":"It started well until the guy at the bar (short with short dark hair) took our order while","useful":0,"cool":0},"FjEC19kk_pLL-tV6HS69aQ":{"text":"Great choice of food on the menu. My hubby & I both ordered burgers. The patties are huge.","useful":1,"cool":0},"nQ27Dxa39nK38Mq1KnBVjA":{"text":"This place was right next to the hotel we were staying in. Since we had gotten to the hote","useful":0,"cool":0},"D8idVzd5P_t1u59ugpL5tQ":{"text":"Absolutely must get an oyster poboy and fries from here anytime I'm in the city. Best arou","useful":1,"cool":1},"K4bBiY2a29wptiV3yhkqjg":{"text":"Great catfish! Thin & Crispy! Burgers are delicious as well! Food is reasonably priced and","useful":0,"cool":0},"yogvXGGfye8sZAw0XxKELw":{"text":"I got food poisoning from something. I think the gator poppers or something in the gumbo m","useful":0,"cool":0},"7vvpDrNAgybK61gV5QSBBg":{"text":"This place is great for a quick bite to eat and the staff were super friendly.  The locati","useful":0,"cool":0},"yRMx-yRuyklOCbFPt8CKaA":{"text":"My chicken burger was excellent. My friends Jambalaya  not so much. But the service was ve","useful":0,"cool":0},"Mz8lgZixbaIgETDKVwWmfQ":{"text":"This place is good..... Server is nice and very accommodating..... I love their bayou frie","useful":0,"cool":0},"ls5nGs50q2vZBd5TRpDrvw":{"text":"This was great.  It was our first stop in town while we were waiting for our hotel room to","useful":0,"cool":0},"3yRT27LooXELZy8S-Yieww":{"text":"Stopped in on our last day in NOLA for lunch. Hubby and I both had the catfish poboy. The ","useful":0,"cool":0},"-u97W3yiJZG0iIohku-6jg":{"text":"Super food, reasonable prices.  You want jerry as your waiter.  He gave us (party of 6 w k","useful":0,"cool":0},"pZMNz7poueyMLGR9dhdfNA":{"text":"My cousin said that her and her husband had been trying to eat here for years, but it is a","useful":0,"cool":1},"8euK__1zN29Ku7dboOVYPA":{"text":"The restaurant is family friendly. We stopped by by accident and very hungry. The food is ","useful":0,"cool":0},"pG7-42stjcnXUUKLP395Bw":{"text":"A big group of us came here for dinner last night. Our waiter Al was so friendly and helpf","useful":0,"cool":0},"3i9WqNT9SuNKrW_WvKiJCg":{"text":"The shrimpzilla had delicious fresh bread but only 12 medium size shrimp, I recommend John","useful":0,"cool":0},"jNYejOwTt2reDj3b8IWYLg":{"text":"Great little place to stop for a bite. Although I'm not a \"big bread\" sandwich fan, the sh","useful":0,"cool":0},"FFKMm_FGRi8ua2mYMe7xvQ":{"text":"Great food. Fast service.  Will definitely come again.  The service was fast and efficient","useful":1,"cool":0},"Z8jYJTSwSTqMoClhi47f4g":{"text":"Just finished eating there, food was very good.While walking out heard someone said \"I'm g","useful":0,"cool":0},"iy-dwLSPB_YEq-3v3bE3EA":{"text":"Service here was fast and friendly. I ordered the Oysters Blue-Diana and they were great. ","useful":0,"cool":0},"7w56Dc-IKGRXZeEErlff_A":{"text":"We stopped in for a quick lunch while walking around the quarter on our last NOLA trip. I ","useful":0,"cool":1},"CwGO9b1lIrjWo7Z8GLS73w":{"text":"The BBQ Shrimp One Handed Po Boy was delicious-- the 2 beers for $4 didn't hurt either! Se","useful":1,"cool":0},"Pjf3zuOwUWZW2GXMEgU-dg":{"text":"OMG... The mint Julip  and the Brees # 9 cocktails were great! My husband and I ate the bo","useful":0,"cool":0},"nWFKsKmOvl4txMNpS6Jr2A":{"text":"My husband had the catfish po' boy and I had the roadhouse burger, both with the garlic fr","useful":0,"cool":0},"pObC8ajNSCJqBC5RYy84bw":{"text":"Food was good. I had the Shrimpzilla Poboy, if you like gravy ask for extra on the side. H","useful":0,"cool":0},"Zgv5UFqRe2_52NtO9MC7ow":{"text":"The food here is fabulous.  Not much of a healthy selection, so come when you want to chea","useful":0,"cool":0},"4z4HjfqsCAYkK48a86XrtQ":{"text":"The food was great. I had a Rajun Cajun burger. My husband had the Hickory Bacon cheesebur","useful":0,"cool":0},"qObJ7wiuo0gkLepd7puEDw":{"text":"I hate writing negative reviews. If this one seems harsh it's because I've raised this iss","useful":1,"cool":0},"HrY1uO6dY_6bQeOlcnpisQ":{"text":"Food was ok, not great.  Burgers were a little over cooked.  The alligator bites were good","useful":1,"cool":0},"3lQEsgZmvIQhmlLqu8IUeQ":{"text":"Currently sitting here now and waited on my food for almost 40 mins and a restaurant that ","useful":0,"cool":0},"DIQWGPARafSeVIgnoP_SfA":{"text":"These 4 stars are based soley on me seeing my friends as I walked by and sampling their po","useful":1,"cool":1},"XjceVFDaFJWFfC6YyuGYuw":{"text":"Went here last night because I read the place was really haunted. Had dinner on the balcon","useful":0,"cool":1},"8GNbEGEDDJM27Ih1CFJ64A":{"text":"Bar tender was really nice.  We were in the hurry and he made sure that we were served ASA","useful":0,"cool":0},"rSDYanAbzY7dkzXkeMVOHQ":{"text":"I love the thin catfish here! The service this last trip was awful! One lady seem to be ta","useful":0,"cool":0},"qldlZqxRmvyzhDGRGk7CHQ":{"text":"Food and service was awesome highly recommend. We had the Shimpzilla and alligator poppers","useful":0,"cool":0},"xiIMH37Vb9KlagRhkJBeEg":{"text":"Chicken tenders were great and the fries were pretty good, but a little sweet to me. Prett","useful":0,"cool":1},"0Z6nqDxevAcmUl0O6nlWxQ":{"text":"Excellent food!  The thin fried catfish was divine, the garlic fries perfectly seasoned, a","useful":0,"cool":0},"lX-Z4bML0N3uwp4udtLIxg":{"text":"First time in NOLA and this was our first stop for lunch. Laid back great drinks and amazi","useful":0,"cool":0},"OL6e1f_OyH7erICO5g-lrQ":{"text":"Variety of burgers.  Speedy service.  Casual dining for lunch or dinner.  The crawfish che","useful":1,"cool":0},"4LaQm5xdSyMj991ZwTZ-Lw":{"text":"AMAZING thin-fried catfish & garlic fries- Lavonda was sweet & attentive as was another se","useful":0,"cool":0},"nMtBzbBWa04A-5Cpx3tRdg":{"text":"Very casual dining! Catfish Lafitte was amazing!  Server was very nice!  Would return in a","useful":0,"cool":0},"jaRTEEp7qi3AoPbBQozCjg":{"text":"New Orleans Hamburger & Seafood Co. has some of the best food the states has to offer. We ","useful":0,"cool":0},"oIkrEQ0UDea7W6ZqHrHoeQ":{"text":"I was pleasantly surprised by this place.  We tried to stay away from chains during the NO","useful":0,"cool":0},"bQgmhvnmZGrcL-XDV7WZaQ":{"text":"All of the things that I have eaten from this restaurant have been excellent.  However, th","useful":0,"cool":0},"h3ZYlaExObmwsuwXjacpnA":{"text":"We came in a group of 11 an hour before closing and we asked the waitress if it was okay, ","useful":1,"cool":0},"WUOu6AtkfA--vBXK80BH-Q":{"text":"Hunger brought us in to this venue late in the afternoon. The reviews were pretty decent a","useful":1,"cool":0},"tPwnL_EX-jz0vH5tjrnjvw":{"text":"Boudin balls just ok ($10 for 6 of them)\n\nGood service, great location for tours, etc.\n\nFa","useful":1,"cool":0},"94qoS-OwEM2uZ4wobrbdPQ":{"text":"Oh. My. Glob!! I went here on my lunch break from work and the bourbon burger was fantasti","useful":0,"cool":0},"8u1Xp3LV2an50IHjIx-WGg":{"text":"Its an ok place for food wouldnt say it goes above an beyond. The staff seems a bit carele","useful":0,"cool":0},"_0G0nNwQfdgiQ-GOZXY13Q":{"text":"I recommend the shrimp or oyster platter - yum! I got the thin fried catfish the last time","useful":0,"cool":0},"dDbz8oW28yqPrnE9XdDL7g":{"text":"Bayou pasta is insanely delicious! My son had the hickory bacon burger and he's said it wa","useful":0,"cool":0},"L3DZt8LXp8sOb0pHYwQuaw":{"text":"Drinks are good.\nFood - Meh. I've experienced better.\n\nSHRIMPZILLA POBOY\nFried Shrimp, Roa","useful":2,"cool":0},"gosoO3pOKPt7gYCGFhmreA":{"text":"A local vendor recommended this place but I have NO idea why. People were nice, but down h","useful":0,"cool":0},"sdKqUp5mXe9WoxJ4mFVIgg":{"text":"Wow, great experience. The staff was super friendly. The food was excellent. Try the tripl","useful":2,"cool":0},"9Q7lnODQD_LAPdDp5w76nA":{"text":"Excellent burgers. After eating seafood for three straight days we decided we needed a cha","useful":0,"cool":0},"VR-2VTtlIciIFn6C4Ip9wQ":{"text":"Party of two. Ordered a messy roast beef poboy with lettuce and pickles. Garlic fries came","useful":0,"cool":0},"yAsa3ZVmZbjUTnjlP8Id-Q":{"text":"Service was really nice, real cool & funny older gentleman but damn he couldn't hear worth","useful":1,"cool":0},"6wpVTtJYfr8nhjXCsnKCig":{"text":"Dinner with me and my daughter at 7:00pm on a Friday; not crowded\n\nPros: Friendly waiter, ","useful":1,"cool":0},"lp10WrtTkQYUfZF8JM1zkg":{"text":"Garlic herb fries just like Charles said balcony view and seating awesome great food and d","useful":0,"cool":0},"ME3w2jYjGnckJaSsMfmXqg":{"text":"I ate here on my second trip to New Orleans this month. I am always obsessed with wanting ","useful":2,"cool":0},"vWDDA6p4CNvhMEfZ6ME1dQ":{"text":"My boyfriend and I decided to go to this restaurant this past Saturday, 03/12/16. Once we ","useful":0,"cool":0},"ZTAHsfD5zu0IXCGiLxuP5g":{"text":"The best burgers I've had in a long time! We had the jalapeno and pepper jack cheese, the ","useful":0,"cool":0},"gDKQxvfF6pUvgxKyhcAMbQ":{"text":"This location definitely operates differently than those outside of the city. One of the k","useful":0,"cool":0},"7S-9yb5CoZr8T5T4v_FlKQ":{"text":"We ate here 3 times during our week long stay in New Orleans. What brought us in were the ","useful":0,"cool":0},"mmBUEdak6QNJJWi5PBvDCw":{"text":"Service was slow. The wait staff had attitudes. Our food was ok.  They messed up all the o","useful":0,"cool":0},"rS9HX0XFyoPBPDJbbYuixQ":{"text":"This review is mostly about the life changing fries that came with my BBQ shrimp po'boy.  ","useful":0,"cool":0},"VyeUg-rqYS84_xKzg9pQQA":{"text":"Took a girls afternoon trip up from Biloxi and decided to have lunch on the balcony it was","useful":0,"cool":0},"pvEDUuQhzWLj73D56vHgQQ":{"text":"Food was awesome! Just because it's in NOLA, not all restaurants make quality food that re","useful":0,"cool":0},"syD_gQSMIJzvI_CPoKowuQ":{"text":"Very good seafood fettuccine alfredo, friendly bar staff! Frozen drink called 44 was very ","useful":1,"cool":0},"SQOxxUsTKY2j6gtS5xEumw":{"text":"We had a shrimp poboy and a shrimp basket. Lots of food, more than we could eat. They were","useful":2,"cool":0},"XKp0b87EfEVb5eIAs8utjQ":{"text":"The bartender was great! The gumbo will forever hold a spot in the heart of my tongue! If ","useful":0,"cool":0},"m9xEH-hKKicp7G9W4SHHRw":{"text":"My family stopped in for dinner after visiting the Quarter, and we had a wonderful experie","useful":0,"cool":0},"iZbyY_A6Blt6OVnb7glM2g":{"text":"Must try the crawfish queso and the loaded cheese fries! The view on the balcony is nice a","useful":0,"cool":0},"dYrYQhjo8pN5pWxVKtHjyw":{"text":"Slow service and had to track waiter down for another drink. Good 45 min. between ordering","useful":1,"cool":0},"buvBROUh05ox5pI4i9_Adw":{"text":"Yes!!  If you want authentic New Orleans cuisine that is casual and fun, come to this plac","useful":0,"cool":0},"095K8xU9U2D73vdGlPkVjA":{"text":"The waitstaff was a little thin on the product knowledge part, but the oysters were fresh ","useful":0,"cool":0},"3MjsCNjMShDuUTkIFSzJVA":{"text":"Always delicious food!!! The waitstaff upstairs was a little slow on Tuesday, 7/19 but ver","useful":0,"cool":0},"v1uWAs4WlhEIQiTtc469zw":{"text":"I was celebrating a bachelorette party in NOLA and the bride was dying to go here. She sai","useful":0,"cool":0},"FJ0nvopDagUn52h9GjQqGQ":{"text":"Best BBQ Po-Boy ever had in my LIFE!! And the Ragin Cajun burger pretty good.... Ask for J","useful":1,"cool":0},"YjVE6BKloU60t9MMM9dGaQ":{"text":"Food was amazing, try the bayou pasta, it won't disappoint! Staff is very friendly also!","useful":0,"cool":0},"GT1VkVRnNhBR1m4csC9DYw":{"text":"We were sat down fast , the service was good , helpful , friendly and the food was great .","useful":0,"cool":0},"yRHnfsKftPfW0zBoG07mTw":{"text":"Never been to New Orleans this restaurant was reccomended to us.    Our waitress was Trina","useful":0,"cool":0},"Njvl9vEepWXo4h9xN2tmUA":{"text":"Food was absolutely amazing! Gator bites and boudin balls were to die for! The ragin cajun","useful":0,"cool":0},"BWDR0fdyYc_1p3qI92B6eg":{"text":"Brent was so cool. I was starting to feel like a sellout for eating a burger in NOLA but w","useful":1,"cool":1},"CMfygGAzDWiwQTgVpKAv3A":{"text":"Only didn't get five stars because the waitress was rude. The food was delicious!!!! We or","useful":0,"cool":0},"nWXs68qmcGmNnMDVIAuy-Q":{"text":"I had the \"thin\" fried catfish po'boy. The sandwich had good flavor (with remoulade & hot ","useful":0,"cool":0},"yXI4t5lhRkxC8-v2VFwn7Q":{"text":"Fried shrimp lack size and flavor. Not what I expected eating in New Orleans. It was price","useful":0,"cool":0},"jhjlXvi1iPdtVuQ2eUbnlA":{"text":"One of the best burgers ever. If you like some KICK, get the Ragin Cajun. The garlic fries","useful":0,"cool":0},"xl-dFZw-ZrZK6HU7Ldi4lg":{"text":"Food is ok, service is ok. I wouldn't come back personally only maybe for drinks. Place fe","useful":0,"cool":0},"t7qTrJbPubhYD_D4IByzvw":{"text":"Stopped in on a Sunday afternoon -- our first restaurant visit since arriving in New Orlea","useful":0,"cool":0},"tBCylwTtL2ewL9C6Z4HM_g":{"text":"First visit to NOLA, wanted some fried catfish as it was few and far between on the menus ","useful":0,"cool":0},"UY9TYA5ATaRCHznHGWIhsA":{"text":"It's a decent place to grab lunch or dinner.  Quick highlights.\n\nAppetizers are pretty goo","useful":0,"cool":0},"tpx2hfTCl4wF6dR4SDUF0g":{"text":"We stopped by here to eat lunch before our flight back home. It took awhile for anyone to ","useful":0,"cool":0},"Nwl8-hZ-HLQ9FzleUCzDbw":{"text":"Absolutely astonishing service, food was even better. Prices were amazing as well! Totally","useful":0,"cool":0},"3bijs8835iFyvkrLAoZUUw":{"text":"If you go to this place, go hungry because when it come to portions, the people are seriou","useful":0,"cool":0},"VTqTnU4_E9X4_aWI51N3oQ":{"text":"Came here for takeout when I went to New Orleans for Satchmo Summerfest.  The Great Parade","useful":1,"cool":1},"HI-0wuEcJjx14dgcU69lag":{"text":"We were pleasantly surprised about this restaurant. When we first walked in it looked like","useful":2,"cool":3},"1wB2E04J-oko8pPW6_naww":{"text":"Incredible gumbo and jambalaya but the bananas foster bread pudding is the best dessert I ","useful":0,"cool":0},"oWeuHJ802cANZa4baGC5qQ":{"text":"Dirty oysters and very slow waitstaff. Seems they really don't care. Will not return.","useful":0,"cool":0},"2gVA-df6R5_uP9ewwDw6Sw":{"text":"Woo hoooo new Orleans hamburger and seafood on Decatur. Balcony has a view of the river.  ","useful":1,"cool":0},"rAWUgzOHm0xowAB4lkG-1Q":{"text":"We went in around 8pm on a Saturday night and we were seated upstairs immediately. The wai","useful":0,"cool":0},"Zd8VlgSidPn7WfeeEkmHBA":{"text":"Overall really good experience, only reason it's not a 5 star is because the people I was ","useful":0,"cool":0},"cIpuM8WFKtGSjZrGi5xD3w":{"text":"Not my favorite spot we visited. We were hungry and there wasn't a long wait. It's right o","useful":0,"cool":0},"qyD_NMO7OiCjC30B7LE57Q":{"text":"Very good food. The garlic fries are different and they are good. Waiters are nice. The me","useful":0,"cool":0},"DoR3jw1j4-C5vsnJarkEgg":{"text":"Great location. Chicken burger was tough but toppings were good. Garlic fries were great. ","useful":0,"cool":0},"F1LHIgQ2npQvMMEEY-5YFg":{"text":"Burgers were great,  fries were best ever, try the 44 drink, also great and refreshing. No","useful":0,"cool":0},"AAslBh06jxt3d5qkuOr9tw":{"text":"We ate here twice, once because we didn't really have time to find something traditional t","useful":3,"cool":3},"90HfQeHOTwuTDNBsBUQZ_g":{"text":"There is another yelp page for the same restaurant at the same address with more reviews b","useful":0,"cool":0},"ngECk5pVI1V-53R5lXIfZw":{"text":"I had the shrimp poboy with garlic fries, jambalaya, and the alligator poppers, all of whi","useful":0,"cool":0},"9jWYlb5d4_lPaoyn7XTuLg":{"text":"Stopped in while on vacation for a shrimp po boy and a cup of gumbo!\n\nGood atmosphere that","useful":1,"cool":0},"sC8pxjgOlo5kbrW5wL35FA":{"text":"We stopped by here during the French Quarter Fest for a martini and blood mary.  They were","useful":0,"cool":0},"ZUjHUeZvaLLXUSw_R6LxoQ":{"text":"Went here for lunch. I ordered the seafood platter. Catfish was essentially all bread. Oys","useful":0,"cool":0},"y6ZSpFiACm02g-nupOoLOg":{"text":"Never had a less than delicious meal! My hubs found this gem during our first NOLA adventu","useful":0,"cool":0},"OciqWR3UW9-9j8eLbNjl0A":{"text":"Excelente lugar para comer la mejor hamburguesa de Nola !!! \nQueda en el antiguo cetro de ","useful":0,"cool":0},"cd5JH23Dhjo3ZzHvtrZtNA":{"text":"Was skeptical to try this place when I read the reviews on yelp but my sister was insisten","useful":0,"cool":0},"agE4jdPJA2PoAob75Tja7w":{"text":"Saw a few TV ads on this place so we decided to eat here. Ordered the Bayou Pasta, it was ","useful":0,"cool":0},"3pHn7zR7jP4zARpcH5muoQ":{"text":"I ate here last weekend. The place wasn't packed but there were several full tables. We we","useful":0,"cool":0},"8jktm50lu-o9J2hohFMpGw":{"text":"You know how sometimes you get so hungry that you can't make a decision and you're trying ","useful":0,"cool":0},"aje1zxMitUs27iQG78Y_pQ":{"text":"Thin cut fried cat fish is AWESOME! Fries with spiced butter drizzle....to die for. Two be","useful":0,"cool":0},"EzlRsD7y-fCZEg_r0Eztnw":{"text":"We come at least twice a year to New Orleans. And every time we end up eating here. I don'","useful":0,"cool":0},"b4JW9IULYIv8-7pwI4G-Ww":{"text":"I had an excellent experience here today. I sat at the bar for lunch. The BBQ burger does ","useful":0,"cool":0},"aR3Cqe8er8WOim7vRp5FkQ":{"text":"Last day in New Orleans and we were hungry for something other than seafood. Stumbled acro","useful":0,"cool":0},"_9XbDiSsqQTQTuD8Qcl-yw":{"text":"I came with 3 friends and one got cold gumbo while another got the wrong salad. Our waitre","useful":0,"cool":0},"mFSfRXhki_5hewvUtVJgMA":{"text":"Ate here with a group of coworkers.  The fare was good and service was fast.  We all had a","useful":0,"cool":0},"0hiKjSbwfiz5u4ZDDb7B0w":{"text":"Juicy, delicious burger,amazing fries; hit-or-miss service. \nI had the mushroom Swiss burg","useful":0,"cool":0},"Kjvnvr7on_Gay78q9kMO1w":{"text":"We just happened to walk by and the place looked like a fun casual bar with fun food. Don'","useful":0,"cool":0},"h84JqpauH2ICMzTgc0fInw":{"text":"I ordered the Big Ch-Easy added bacon and it was really good! And those fries with the liq","useful":0,"cool":0},"CyI_Q4bOhHL-mkfIMsj4Aw":{"text":"Stopped in by accident for dinner had dinner on the balcony beautiful evening incredible m","useful":0,"cool":0},"CjZDcYXf4ccgQ8a3gjYHNw":{"text":"We selected this place b/c we knew we'd be starving after our swamp tour and it's location","useful":0,"cool":0},"OFUG6GDkECuat6srs1s95A":{"text":"Stopped for lunch today.  Christmas Eve. Sat at the bar. Our bartender rocked. I wish we w","useful":0,"cool":0},"iOMXblQvnIpwvLFhMIVrWA":{"text":"Excellent garlic fries. Burgers are large. Shrimp salad simple and perfect - they were abl","useful":0,"cool":0},"Y17R-ns4D6Q6OLcEGyoCRg":{"text":"Ordered a sprite, never got it. Food probably had an entire bottle of garlic on it. But th","useful":0,"cool":0},"OZ2TuU2hGVTfx7HSa6poOQ":{"text":"Can only base my review off the 2 Purple Haze Abita's we ordered. They were refreshing and","useful":0,"cool":0},"52tM5ViCnSDziTro7SHghQ":{"text":"Such a perfect lunch spot!! The service was amazing and the food+drinks was just as good! ","useful":0,"cool":0},"nQbZHNClbONwWQMFx9NALg":{"text":"The staff were all very nice and allowed us to sit outside on the 2nd floor patio.  It too","useful":1,"cool":1},"uTk8kRSAIGBGQIkJonueNg":{"text":"I knew I had been here before.\n\nThis used to be Riverfront.\nhttp://www.yelp.com/biz/riverf","useful":1,"cool":1},"vJQzy_6d5i9axE9dE-Cbtg":{"text":"Went there twice while in New Orleans.  Loved everything we order but my favorite was the ","useful":0,"cool":0},"LWzyo5Ch1kqEIW8q4q3Bng":{"text":"Apps were good especially liked the loaded fries and the crawfish queso.  Gumbo was very b","useful":0,"cool":0},"yXuJNhDnmrqFtZCHweic0g":{"text":"The 2 beers for $4 lured us in but our friendly bartender Jerome was so welcoming that we ","useful":0,"cool":0},"18yDOLXRWoAOd_xjC8YcJw":{"text":"A good spot for cheap eats. What made it great was the wait staff. They were all extremely","useful":0,"cool":0},"Wbydqfv_ub6JJRDs-7_5sw":{"text":"On a business trip and my co workers decided that this was the spot we were going to eat a","useful":0,"cool":0},"XRnn0KFcHZWuWU7jhnrAiw":{"text":"This was my second \"Cajun\" style restaurant to try in New Orleans. My group and I were ext","useful":2,"cool":1},"chmcS8qugBYGozQgE9jOWw":{"text":"We ate here after the river tour. They get four stars because the salad veggies weren't fr","useful":0,"cool":0},"M48G_CXezJkAso9x8GHZFg":{"text":"Really enjoyed this restaurant when in New Orleans.  Great staff, beers on special 2 for $","useful":0,"cool":0},"FoUAkHBgnwUCEJxlnttiPQ":{"text":"Usually I'm very stingy with stars but the food here was awesome surpassed only by the ser","useful":2,"cool":0},"awSY6hcUIzEHouwejMBOXQ":{"text":"Good Burger. Bread toasted to perfection with great butter seasoned fries. Our waitress wa","useful":0,"cool":0},"OUsBK9FuHJnGXzcrZ2Ek8A":{"text":"We popped in for a cold drink to beat the heat.  The bartender was super friendly and gave","useful":0,"cool":0},"Z56ys2v7K_LD4-nbkIT93g":{"text":"The Bayou Pasta was one of my favorite meals all weekend - yum! And the weather worked in ","useful":0,"cool":0},"VkD_x4IAXq3NprcXMU26Yw":{"text":"I only gave 2 stars because our waitress was so nice and wonderful. I would give her 4 sta","useful":0,"cool":0},"fm6uOcq8gMq6IpiRS1Ngcg":{"text":"Im giving a higher score because the others in my party had really good meals. My chicken ","useful":1,"cool":0},"FOt91IVxJBXGMX8Lrkd09Q":{"text":"Delicious cheeseburger! Downside is all of their drinks are pre-made so you can't ask for ","useful":0,"cool":0},"Rj7SxiqOW4JsiQ3OdPElFA":{"text":"The food was absolutely great! We had the All American Burger and the Rajun Cajun Burger. ","useful":1,"cool":0},"FRUd9hTpT6MbT9duzLiTNA":{"text":"Great place to grab lunch... excellent fish....thick fillets , cooked just right...I went ","useful":0,"cool":0},"lkS09bDXsvHsB-AKVbregw":{"text":"Ordered the thin fried catfish po-boy.  That food was awesome.  Several TVs on with sports","useful":0,"cool":0},"onegY3nPSgu_RUwnZhchrg":{"text":"Had the Thin Craw Fish poboy today. It comes with garlic herbed fries (which they are famo","useful":0,"cool":0},"ES1tIVUQanr0ypxLgrHmPA":{"text":"This was a great place! Whole family loved it! Everything that we ordered was terrific and","useful":0,"cool":0},"fxhIFOwiRKq2aBRD41yVNA":{"text":"This is the second time i have been here. The first in 2017 and then today. I have been he","useful":0,"cool":0},"SqryoE653BLQDLetoHMS9g":{"text":"The fried catfish here is incredible!!! I love catfish, but sometimes is too filling. I ha","useful":0,"cool":0},"mbjPG6wBDjsTprFxWr3Q2A":{"text":"The food was amazing! I got the fried thin catfish platter and for apps we shared boudin b","useful":0,"cool":0},"nRWOt_6P26iBESvJHEB8JA":{"text":"This was a nice place for lunch. The fried shrimp Po-Boy could have used some more seasoni","useful":0,"cool":0},"-brMkPHjJDTgtc3m9O0yOw":{"text":"I would give them 10 stars but it didn't let me. My daughter doesn't usually eat her food ","useful":0,"cool":0},"lfsmlA_HgtQ1yQmWhPEZ_Q":{"text":"The food was alright. My husband wanted spicy thin catfish but once we got to the hotel it","useful":0,"cool":0},"SiQXiMWfkyQBuxhPaAb0bw":{"text":"The food here is great. I had the thin fried catfish platter and it was awesome. The fish ","useful":0,"cool":0},"m_XpRpYjkwVzZNAqli14Tw":{"text":"Wow!!  This had to be the most amazing Po Boy to date that I've tried upon coming to New O","useful":7,"cool":7},"fVqkU7b7ANOMe9QSb1okgQ":{"text":"One of the best burgers I have ever tasted! Bit of a long wait on the food but it was wort","useful":0,"cool":0},"oIQEwFM2PQayQKdZ8-uugA":{"text":"The kids were excited to get to New Orleans for a city park adventure with their school. W","useful":0,"cool":0},"6zf50uTdgYnRu7IXauUE8A":{"text":"Service was great, thanks to Chrystal!  I had the Grand Parade burger with blue cheese, ba","useful":0,"cool":0},"ThxPZu0dm8yysO02x67QNg":{"text":"Delivered exactly what we wanted at 9pm: a yummy burger cooked the way we asked, served wi","useful":0,"cool":0},"MbFq5gRONUS_IailHNtp-Q":{"text":"Great spot for some traditional Nawlin's grub. Prices are geared towards the traveler, I c","useful":0,"cool":0},"X0cdUaH6K3lDBW9FCySiIg":{"text":"Awesome bartender with Todd giving tons of great recommendations!!! Southern hospitality d","useful":0,"cool":0},"74t-iPZSh-ucpnswu-UI3A":{"text":"The food was delicious !!! We both really liked the garlic fries a lot. The service was a ","useful":0,"cool":0},"1kc3JBqC34rGB2oakb-Mew":{"text":"OMG!!!\nFood was fresh and delicious! Got immediate seating and got our food less then 10 m","useful":0,"cool":0},"kI0mSccN6zah1Qn9ohwMUQ":{"text":"Came down for the weekend, and the place was closed! So sad because the food was so good! ","useful":0,"cool":0},"0CABeHOlQjX_F4-31UeOqQ":{"text":"First timer here. The food was good. Had catfish and fries. Can't go wrong with that. It w","useful":1,"cool":0},"jmTnbTc6VVSKCheQ6xmwqg":{"text":"Zero stars. The host sat me my fiancé and our son upstairs we sat for over 15 minutes and ","useful":0,"cool":0},"fZNWeLCJaJqxWTnaEExIlA":{"text":"We were wandering around New Orleans trying to find a spot that would satisfy the adults' ","useful":0,"cool":0},"-Q7N951osgSeifrXu1q9sQ":{"text":"As a loyal customer of the franchise for nearly 25 years, I must say I was pretty disappoi","useful":1,"cool":0},"ksdtb3UIN3_op4wOpC9Tew":{"text":"Got the Gumbo, eh, I've had better. Also had the trio sampler. Not impressed. The catfish ","useful":1,"cool":0},"cSg9jT7WMnEWWmi-i7bY0A":{"text":"It was ok. Nothing too special. I ordered the jambalaya and my husband got a burger with f","useful":0,"cool":0},"RyRsUizWMHpa9nE93jSoFQ":{"text":"Service was great as is location.  Great atmosphere, but was a bit disappointed in the mea","useful":0,"cool":0},"VsKgwQpRYY7VQyL0Dy1pzw":{"text":"Our second time here and the food was delicious once again. Service was quick and our wait","useful":0,"cool":0},"31UQcCcQQTglpy3rY1ufjg":{"text":"This place is NOT closed. It was temporarily closed for renovations. The service is top no","useful":0,"cool":0},"At7vdrsaDUpotDc42AHNhw":{"text":"Pretty neat restaurant in the heart of the historic French quarters. Perfect place to enjo","useful":2,"cool":0},"7zh-HzNZ4v1T5kb68GXIDg":{"text":"Always a nice place for lunch. The customer services for the most part is good. The barten","useful":1,"cool":0},"31lgOXa3_ZGkxFXWqsIwsg":{"text":"The thin fried catfish was one of the best things I had on my NOLA visit. Highly recommend","useful":0,"cool":0},"wbKWiobBZOep1fNfHtsF_A":{"text":"The view is nice from the balcony u can see the boats coming in and out!  Had the catfish;","useful":0,"cool":0},"VH8z9ctn_rPgKXZWWeRGCw":{"text":"Charbroiled oysters far better (and less expensive) than at the chaotic \"Felix\" where we a","useful":0,"cool":0},"0rbYlE50MxKBnvL63-ACVw":{"text":"This was our favorite meal in New Orleans! The seafood platter was to die for, everything ","useful":0,"cool":0},"T2RFRh2rn435gpF8mZwCTg":{"text":"Excellent service and the food was amazing at a great cost. I got the fried shrimp PoBoy w","useful":0,"cool":0},"4x3I24O7tYuNGTyOLCtcbA":{"text":"Dinner Time! The SHRIMPZILLA POBOY is AWESOME. The garlic/herb fries make it BETTER and ha","useful":0,"cool":0},"6ru_GjiItCiZ1vunaCiYYg":{"text":"I was hungry and this was close to the hotel. Known for the home of the thin catfish. It w","useful":0,"cool":0},"aa_BiT8vQW6_RL9XQyvKTA":{"text":"We just went for desert, but based on that we would go back. I had the brownie sundae and ","useful":0,"cool":0},"DuVyyI45PNGHHEQneivKSg":{"text":"Although it's a chain I was much happier with this location than I was with the location i","useful":0,"cool":0},"6CLL84FRVRAgsJxXwx_DAg":{"text":"Here during EMS Expo; large group of 9 was seated promptly. Our server was friendly and qu","useful":0,"cool":0},"y7Gpmfa-lj6mblRdANTjsw":{"text":"I love this place - in Metairie. In the French Quarter it leaves much to be desired. I did","useful":0,"cool":0},"kfsbXnLzSj2Uj6QHnzPjDg":{"text":"Absolutely loved it great service. It's not a big location and there can be a wait time bu","useful":0,"cool":0},"3JhgaTVcxTMNJQU9mjP5hQ":{"text":"This place has really good food, good customer service, and a decent variety to please a c","useful":0,"cool":0},"XkiaGnQ6kjMlGP94C8GXbQ":{"text":"Live just a few blocks away .  and thought this would be our favorite go to bar/ restauran","useful":0,"cool":0},"-mnLmTGGAG3hN10XtHHVtA":{"text":"Although the food itself was delicious, it was cold by the time it finally made its way to","useful":0,"cool":0},"WTy8CXedRfvif6sYYNLSdQ":{"text":"I'm not gonna lie. I saw a sista at the bar and knew this was gonna be a safe bet. It exce","useful":0,"cool":0},"9WpuvsRUkvQ-v2V28pPm0g":{"text":"During our tour of NOLA, we heard that this was a good place to eat and it is true!!  We L","useful":7,"cool":4},"wEngScoS6l64bTlddNNiMQ":{"text":"We got burgers and mine was delicious. But my moms was severely undercooked and had to get","useful":0,"cool":0},"0oca1fK44PYd8hUbvgXyew":{"text":"THE BEST!!! After 4 days back visiting my hometown I FINALLY found recognizable food and h","useful":0,"cool":0},"exsbwqNYdgvyothHcK2HqA":{"text":"Discovered this spot while in New Orleans for Essence Festival and the food was sooo good ","useful":0,"cool":0},"TmRwaAtqx8g4FH8bsAbd6w":{"text":"My husband and I went here for a late lunch. I ordered the shrimp Alfredo. AMAZING!! He or","useful":0,"cool":0},"fiuKV6_vF51hN2XRnwMgSg":{"text":"The catfish was incredible! The garlic fries were out of this world! Our server was Ivan, ","useful":0,"cool":0},"-S5W4ZMKyCSPhJ8hUSCq9g":{"text":"Great service and the food was amazing also. The portions were big and I couldn't have had","useful":0,"cool":0},"35ZvM4SMIHlkGQZhM1O6Cg":{"text":"We love this place!  The food is excellent and the staff is responsive and courteous. The ","useful":0,"cool":0},"S2_Ng6TPpC5oxutoHio2wQ":{"text":"Hands down the best red beans and rice I've ever had. Actually the best food I've eaten in","useful":0,"cool":0},"5olBzOOuUOeH_nx8lvG-9g":{"text":"Al the bartender is AMAZING! So funny and friendly. His drinks are amazing! \nMy friends an","useful":0,"cool":0},"ekC7JTQoBIiFZ4ACtjfMXw":{"text":"Garlic fries... to die for!!! Delicious!!!\nChessy hamburger and chicken tenders... amazing","useful":0,"cool":0},"zY7Gr7AEqFBfIiHpmlpKxQ":{"text":"The place is great and the food to die for love it highly recommended great selection of b","useful":0,"cool":0},"qwYhDUT0VB04iAsJOMhVRQ":{"text":"linda had the catfish and jambalaya dish and I had the Rajun Cajun burger.\nBest food we've","useful":0,"cool":0},"QRegfOCaFPp_0xDb4v2gTA":{"text":"Great food and helpful waitress. We had a hamburger, shrimp po boy, and fries. Let me tell","useful":0,"cool":0},"fF-OGiTAyquiRzb9VmMGrg":{"text":"For being so close to Jackson Square (read: touristy area), this place was really tasty an","useful":1,"cool":0},"4uIxahwbTEDvBbnMd3JfdQ":{"text":"The food and service here were delicious! Our group had wings, the biggest mozzarella stic","useful":0,"cool":0},"ZvQvQxdQgv0tXCSIbI8MCA":{"text":"Fries had a garlic seasoning on them and tasted great. Service was good and the POBOY was ","useful":0,"cool":1},"EFd3jG_32TTsfC1RgunmZA":{"text":"Great Charbroiled Oysters\nI came for the Essence Festival and this was one of the restaura","useful":0,"cool":0},"2D2E2Hiu6U8_T08G4qXKZw":{"text":"We had the Shrimp Caesar salad & Fried Shrimp Po Boy. Good portions & fast service during ","useful":0,"cool":0},"mH0cL9n5JvGd_OqJ7B0HIQ":{"text":"Great place! Stevie was a great waitress and bartender! Her eyeliner was spectacular and s","useful":0,"cool":0},"3U67cwRIlC2gNDBqZlM23Q":{"text":"Charbroiled Oysters are the BOMB!! Also love the Trio Sampler!! Jerome the waiter was awes","useful":0,"cool":0},"BvtB2YT5dKnzzFStSczBXg":{"text":"All the flavors were there - a delicious shrimpzilla 'po boy. I'd only say that my food wa","useful":1,"cool":1},"5LKnVqFnuMFD-F-apzK31g":{"text":"The Hostesses are all super rude African-American girls and shout and have no pride in the","useful":0,"cool":0},"CTWMRlgoI8UGnpLRhOfD5A":{"text":"The food was cold... over priced for the amount of food you receive. My friend received on","useful":1,"cool":0},"wfWB1JqxVSPm6v5tZbmyJw":{"text":"Waited in line for approx 15-20 minutes on a busy Sunday afternoon. After we were sat, ser","useful":2,"cool":2},"uG6685eWUkqybUxWxiTJrg":{"text":"AMAZING!!! BEST oyster we had our entire stay. Jerome has amazing customer service. Do you","useful":0,"cool":0},"7jo_elXOzpSRAtWcNQ21-Q":{"text":"Beautiful balconies, great location and that's it. Very disappointed with the food and ser","useful":15,"cool":5},"b62xXNwpzc1pTA8w2_Pv4Q":{"text":"Get the crawfish queso for an app. The burger I got was the Big Chessy  and it was so good","useful":0,"cool":0},"O8LDUgqlsxYWz8PIFSoP7w":{"text":"Went during COVID and we were really impressed by the service and food.  The plates are hu","useful":0,"cool":0},"g-83j94ktzKd23R2-9i1ew":{"text":"A solid three stars. Hickory Barbecue burger was really good. Fries were pretty good (not ","useful":0,"cool":0},"l6UeHg46cLEyKYhaYizQnQ":{"text":"Went here with my fiends after walking around the square because of the menu options. It w","useful":1,"cool":0},"DGSFlTNRCNV_6Oa9w4Riwg":{"text":"In my entire life, which Includes lots of dining out and many trips to other New Orleans h","useful":2,"cool":0},"UmqgcPpfdMiDnE10W7njKA":{"text":"Don't bother. We were there nearly 2 hours waiting for everyone to get their food. The wai","useful":1,"cool":0},"ePW_hDw2fbv-SRDssM_oQg":{"text":"The service at this place is TERRIBLE.  I ordered a drink and the glass had lipstick all a","useful":1,"cool":0},"qypIndIcWhpADGvjkR-Xlg":{"text":"I love this place!  The bartenders rock!  It's a great place to hangout. 2 beers for 4 dol","useful":0,"cool":0},"BsjrXCCechKXLFbGjk0N3A":{"text":"We had an hour to grab something to eat before my sweetheart was arriving on the choo choo","useful":65,"cool":65},"MdL6PARQxGrL5YirhbXMkg":{"text":"This is my first time in NOLA and spent some time researching restaurants within the Frenc","useful":1,"cool":0},"SW9O_LAZycDO69hwsiFkzg":{"text":"GARLIC HERB FRIES! are amazing, rajun cajun burger too;\nSMALL SPACE: for the crowds that w","useful":2,"cool":0},"VzGwKBGZpUSkFSvk78f_9g":{"text":"This place all around was terrible. Quite literally the worst service of any place I have ","useful":1,"cool":0},"3g6cDWx_MVfYKqnEOKTl0Q":{"text":"Stopped in at NOLA Hamburger and Seafood for a quick bite while in town. We were recommend","useful":0,"cool":0},"_h5_QfCm6PB1uSKJnqfDsw":{"text":"We had crawfish queso and chips as an app and it was delicious! The kids got burgers and w","useful":0,"cool":0},"Jme2UxH58DUXn2ZEDfilfw":{"text":"Order a drink 44 but never received. The waitress was busy talking rather than taking care","useful":1,"cool":0},"OSmXBWkk-_mXTS3KKDVgQA":{"text":"Not worth the trip at all. Ordered. She left. Someone else asked if we wanted to order. Fo","useful":1,"cool":0},"gxDNnqIRPD8OS501oeC5zA":{"text":"If I knew this restaurant would be run by a gang of cliquey high school girls with an atti","useful":2,"cool":0},"otrfMvQrff853nznDLaVnQ":{"text":"This is your standard tourist trap. The food is terrible. Only reason we are there was bec","useful":3,"cool":0},"QTg3_7TmbcUqNUtpZRdZzQ":{"text":"So FYI the place wasn't closed.  But I regret going. The service whew it was bad.  Couldn'","useful":1,"cool":0},"9MyAkstjAZAN1y4MtqoFaw":{"text":"Waited at the \"please wait to be seated sign\" for a while. No. One. Was. There. It wasn't ","useful":1,"cool":0},"FVwHtaTLiTIRQeLjif-HOA":{"text":"I was walking to meet a friend and was making good time. I decided to pop in and get a bee","useful":1,"cool":0},"3sMo8gtrJwBVjn0kVYiYgg":{"text":"I enjoyed my food and the service. I got the oyster and shrimp  Po' Boy. I really enjoyed ","useful":1,"cool":0},"Z0WOicPzvWGNfo25EW6axQ":{"text":"We ordered the sampler appetizer, when our dinner came out with no sign of the appetizer, ","useful":1,"cool":0},"oXeEPkBzmm8SVJD8bQnCkQ":{"text":"Really BAD experience! Dine in Friday night 6/30 with family, waited for 45 mins and food ","useful":1,"cool":0},"LeBPcGf8ZhM7yBKqYuLeBA":{"text":"WOW! The best burgers ever, as well as the fries. $5 for two beers and amazing services! H","useful":0,"cool":0},"fYepEd_wUDQ6M_EksrSZAA":{"text":"My friends and I found New Orleans Hamburger & Seafood on Yelp while walking around the ar","useful":11,"cool":7},"gRdqaHW0g94C_J52gz-Hfg":{"text":"ended up here during mardi gras... which was my fault, but figured id give it a try. Was h","useful":2,"cool":0},"jBjizriDUfKUbFamcS_Adw":{"text":"Disgusted. I paid $50 to be served out of a dirty glass. It looked like it had dried vomit","useful":1,"cool":0},"KqTnJzKpgQcLoqay5MV30w":{"text":"Delicious food and great service!! The boudin balls are fabulous!!","useful":0,"cool":0},"bDLpPrloF_v-D-90qMYqXw":{"text":"worth it. man the poboy here is the bomb, i don't know what they got going on but it's ama","useful":1,"cool":1},"iypwHE8przmQO3CEnt9lvQ":{"text":"Out of all the places I got to experience while in NOLA this was probably my least favorit","useful":1,"cool":0},"J6rnX52ct1J_vB3kybGQAg":{"text":"This service was great! Food came out super fast and the lady was very nice! The food was ","useful":0,"cool":0},"jKYi1_9p-v--zqtCEbcQIw":{"text":"They can make a good fried filet, I'll give them that much. The service was fairly good an","useful":0,"cool":0},"971deqN4bq28unMIrEo-hA":{"text":"Unfortunately underwhelmed... I got three different plates from this place and I can't say","useful":2,"cool":0},"eTBQXXJV5mgSjbwpT7fQfA":{"text":"DON'T EAT HERE!!!!!!\n\nI have been to New Orleans twice once in 2011 and yesterday 8/21/14 ","useful":4,"cool":0},"2WCdKxzgAeKUpwbdRq5wpA":{"text":"Staff was friendly. Boudin balls were frozen inside when brought to the table. I ordered m","useful":1,"cool":0},"QuKLoJ-tWxsnBrPcHsxKIQ":{"text":"I'm a forever fan of this chain restaurant but this location is my favorite!!!! Located in","useful":0,"cool":1},"GI9LcshQTcwSF4bcPmmbNg":{"text":"This place was crowded due to French Quarter Fest taking place.  The shrimp platter was me","useful":0,"cool":0},"q7s9tKqX0_5ZBPDB2XBjOw":{"text":"Food was decent. The service was so bad that it felt very off. There was a line outside wh","useful":1,"cool":0},"IKDCBnwmmN3gYc9txOy8tw":{"text":"We eat there today for lunch. The hostess handed the menus to my friend and said upstairs ","useful":1,"cool":0},"bbHXbGN_S1ztTpmRK6ZGZw":{"text":"Delicious garlic and herb fries! My sister and I were extremely satisfied by our experienc","useful":0,"cool":0},"ktDTwN4JEEjbzI5RisvQUg":{"text":"Check your drinks!!! Me and 3 of my friends went here last night for a quick bite. 2 of my","useful":1,"cool":0},"r9w-4gFa2Hp8_h3GhwzISw":{"text":"The Cheddar appetizer fries and Shrimp PoBoy are delicious! I highly recommend the place.","useful":0,"cool":0},"ouOhRj0-GY-fQS51lU4twA":{"text":"I'm Japanese, a small woman. I ordered catfish platter, expecting big plate but small bits","useful":1,"cool":0},"aanamdK7ci5NZfSHiPzgng":{"text":"The kitchen was experiencing hardship ships because it was Mardi Gras (I'm a native) and I","useful":0,"cool":0},"scEjm7gDl6zfpACrOz_Lng":{"text":"I love finding new restaurants in New Orleans! This place was amazing and very quick. We h","useful":1,"cool":1},"0FpYI_v550_m-essikK31A":{"text":"Some of my favorite food from this trip!The crawfish queso was AMAZING! I had the thin cat","useful":0,"cool":0},"bU2b_-_PQxPT1_idWbuVEw":{"text":"First off, let me say this spot is beautiful. New Orleans Hamburger & Seafood Co. is in a ","useful":9,"cool":6},"rQ91K83GhVWQm6RVrOnMPQ":{"text":"We dined here before going on a ghost tour. Started off with the crawfish queso and keepin","useful":1,"cool":0},"f5lvWHVWcUYSeu5Cb9sewg":{"text":"A little slow to serve and seat. Its about 4 o'clock on a Sunday during Mardi Gras. Had to","useful":1,"cool":0},"cqnDQr2u18LgOAcdwgdRUA":{"text":"If your hungry and looking for a place to eat in New Orleans this is the worst place you c","useful":1,"cool":0},"ErP4EIZxOCS2oqYE9gaDAA":{"text":"Very slow service.  Terrible food:  The cheese didn't come melted on the burger and our se","useful":1,"cool":0},"Dft368IU_uq9MwblMoRbyA":{"text":"The service was HORRIBLE! I waited 15 minutes to be seated after being looked over several","useful":1,"cool":0},"rsbKwnMLoUlibk7CQojsZQ":{"text":"The food was good but the service left a lot to be desired. We never got refills and the w","useful":0,"cool":0},"WGLWWstJAZyXEVsuryKHyw":{"text":"Wow, I wasn't sure if we were being punk'd or not.  The teenage waiter was so rude when he","useful":1,"cool":0},"VL-lhp0qwkLh0XSn-yVsKQ":{"text":"Incredible just about sums it up. We wanted a quick lunch bite and I was craving fried sea","useful":0,"cool":0},"Bqh4l-U3X8aY8DAjfFdELg":{"text":"Terrible service. I asked for silverware the waiter never brought any. I had to ask one of","useful":1,"cool":0},"Ug7Oun3kdvYZA3fdjIwa0g":{"text":"Was just remembering the horrible experience I had here 2 years ago. Staff is trash, food ","useful":0,"cool":0},"inyYMlbkYB_hR_4zctlqiA":{"text":"Came here for a late lunch on a Friday, place was packed. The food was fantastic (shrimp p","useful":0,"cool":0},"y6DqioP8DYmTCJmReEM8dA":{"text":"went here with really no idea of what it would be like...mostly empty and cold because the","useful":1,"cool":0},"vatbQjBMqR1IjUgqQhq9Fw":{"text":"TERRIBLE.  burger was frozen patty and catfish was all breeding. So little fish. \n\nThat an","useful":2,"cool":0},"cyQa3ddKcgnF0sYpvOHjmA":{"text":"Terrible is the only thing that I can say about this place.  Do not go here, period.  Food","useful":1,"cool":0},"LrsrPWE651Py0N8Q0z-2Rg":{"text":"My husband ordered the bbq shrimp poboy, and it was disgusting and looked like dog food. I","useful":0,"cool":0},"03G8jim-4AUA96sR7fnl4Q":{"text":"We were very disappointed in the meal here.  My husband had the bbq shrimp poboy which, wh","useful":1,"cool":0},"oBOBhoVHq0I3vsDlSMKdYA":{"text":"This place is a basic hamburger place with some plate meals.  An excellent option for peop","useful":1,"cool":1},"goLwySqEhQABXhZXV1joRw":{"text":"Went around 830 pm on a saturday, place was half full. Got seated on the balcony and was f","useful":1,"cool":0},"qspz5Y6q9DpzBISnq0AhHA":{"text":"I visited this establishment super bowl weekend. I had the triple sampler which included a","useful":1,"cool":0},"qDmBs-Q74iZFnhF0RbVSvA":{"text":"The 1 star is for the employee at the front who completely ditched us at the bar and did n","useful":2,"cool":0},"T4vXN6xADFux3JhnMCXcJw":{"text":"You guys, the food here is so bad and bland I cannot believe any of the reviews here that ","useful":3,"cool":0},"F9qUU6DamOX_wpaS6BntFw":{"text":"Do not waste your time unless time is all you have because you will need tons! The service","useful":1,"cool":0},"cDd_DwEXvUMdqHf32gwI3w":{"text":"This was my worst experience in town. Uninformed and rude staff who never turned up to ask","useful":2,"cool":0},"Fey5SIDYBmTuPCSGo9lnyA":{"text":"Worse service ever. Started with the hostess being very rude. Would rather make place sett","useful":1,"cool":0},"i6R5KMxQ94t9to1JXjnZBA":{"text":"First time visit, if you can even consider a visit. We walked in (party of 4). There's a s","useful":1,"cool":0},"6CKGDA-Gs8EiAc0wfrXjPA":{"text":"The food was WONDERFUL! The service was terrible.. We were hungry and tired.. We didn't wa","useful":0,"cool":0},"EtMhaYwiKbGeDXmgdj8Wqg":{"text":"Not a fan, bad service and the food was not awesome. Honestly the only good thing about th","useful":2,"cool":0},"M5Q9I8g_H4cW8W6N2wIyeQ":{"text":"If I could give this place 0 stars I would. Waited 20 minutes just to walk out of restaura","useful":1,"cool":0},"pvTjDdZPlsDKNbrLjI2o0g":{"text":"This was a recommendation from local...... wasn't as good as they made it out to be... I o","useful":1,"cool":0},"cp1HvRgBijyXOZAh1DKzog":{"text":"Hungry and wanting a burger (me) and a po' boy (my wife) we selected the New Orleans Hambu","useful":1,"cool":0},"q1OxDoLMOZFf7mtwwh5LjQ":{"text":"First time dinner this past Monday 7pm, not crowded.\n\nWalked by this place many times, tou","useful":1,"cool":0},"Wd-yvC6HUPmT7euVncyJsg":{"text":"THIS PLACE IS NOT CLOSED!!!!!  Very open and a great place to eat. Wife had shrimp po boy,","useful":2,"cool":0},"CPmb0MKd61DN3KM5_58MOw":{"text":"I guess I shouldn't have high expectations, given that it's a fast food chain. But still. ","useful":2,"cool":1},"mQFzPpdx-6fhQVX8LKbxow":{"text":"Monday evening 7/3/17 we arrived in NOLA and after dinner went here (my go to spot for the","useful":1,"cool":0},"rtjYvB9FYisp6lDdahS4tA":{"text":"We were hungry and tired of walking so we decided to give this place a chance. We were qui","useful":2,"cool":2},"nZMRhhKf-rBtX0vCLIBo4w":{"text":"Highly impressed. We stopped in impromptu. Luckily it was happy hour which was great as we","useful":0,"cool":1},"_fsJg3qmxTz3TPmZUm7LUg":{"text":"Did we come on a bad day? Our experience was nothing like these raving reviews. This resta","useful":3,"cool":1},"XNfjVMynR6CzQtpQY054ew":{"text":"While in New Orleans from 2/18/15-2/20/15, we sat down to eat at 4 places. This was our fi","useful":1,"cool":0}}