{"fzIpoi44UgVaONzU0OxecQ":{"text":"Very highly recommended!! My family was in town for the day and stopped in for lunch with ","useful":0,"cool":0},"1WcfacTL9PlGadHGfCQE1Q":{"text":"Have been in Nola for a couple of weeks and found this hidden gem by luck. It's a joint ru","useful":0,"cool":0},"es_tNWD9D9PWgzKKxb4zgQ":{"text":"Needed a home cooked meal! I wanted to try a new place with a some great friends and I'm s","useful":0,"cool":0},"BxlMEMnibrtlSc4zvggxUA":{"text":"We were so happy we found this place! Sorella5 is a family run restaurant created by siste","useful":0,"cool":0},"dzfeBQSMS8mAQW1oGHv4Jw":{"text":"Great food. Awesome host. Glad we found this place! Catfish are delicious.  We came twice.","useful":0,"cool":0},"a150nbb34JaPemQA8mZs0Q":{"text":"This spot is amazing!!! Great food, drinks and atmosphere!!!! Staff are friendly and outgo","useful":0,"cool":0},"0K-L6ig8AxhpJ2OhV-yKUQ":{"text":"What a friendly reception, what pride, I was so impressed with the New Orleans hospitality","useful":0,"cool":0},"zU0SbWbWbun1wLWsLJ-ypQ":{"text":"Sorella5 is a modern, beautiful, family owned restaurant in the warehouse district with ve","useful":0,"cool":0},"k0aA3NAl_Z356KtcQnFv0A":{"text":"This place was an essential to my trip a few weeks ago.  My friends and I arrived at our V","useful":0,"cool":0},"CGvvhBx5FwBoRW8oRbP7Yw":{"text":"Love this place. Food is great. I'm from Chicago and I went in three times because everyth","useful":0,"cool":0},"_wYkssjpPdHtcfIaLi3nKA":{"text":"This brand new restaurant is ran by 5 sisters who use their family recipes to create amazi","useful":0,"cool":0},"UKgzC35k-A90YyUtQ75JjA":{"text":"9 weeks ago, during our return road trip back to Atlanta, we stopped in New Orleans for an","useful":3,"cool":4},"1OWaRGECJlUuSA_ku-BQnA":{"text":"Great find, glad to write an early review. The restaurant had been opened only five days w","useful":5,"cool":2},"s3MDeOtlAOnpG1dqaWYG4g":{"text":"The poboy and loaded fries were some of the best I have ever had in NOLA.  The roast beef ","useful":0,"cool":0},"jel-ar8r2794vNM4sAv7-A":{"text":"Great service. Awesome food. Would come back again. We both had the trio and it was very f","useful":0,"cool":0},"i39qm_zijMGKU1htsi9JLg":{"text":"Just walking the block on Barone and noticed this lovely restaurant so we came in...best c","useful":0,"cool":0},"Q4P8ZC6dB-jvudGrFt1LSQ":{"text":"This is a one of a kind spot in the heart of the cbd. Very friendly and family oriented. F","useful":1,"cool":1},"UQzv9LKonkyg82eRhDA5_w":{"text":"Absolutely amazing food. Frankie fries were awesome. The po boys were just as good if not ","useful":0,"cool":0},"p15gv9yrJTRZPYDM56edYA":{"text":"WOW!!!! Where can I start? The welcoming as soon as we stepped in the door was amazing by ","useful":0,"cool":0},"RryGzdNonO-huOdkqLWBvw":{"text":"Stopped in for happy hour drinks at 4 and stayed till they closed. The fresh berry cocktai","useful":0,"cool":1},"SxUMopkZrzjG3gz9ysSOYg":{"text":"We were staying in a hotel just around the corner & were looking for someplace close. Grea","useful":0,"cool":0},"OK55GYyiW4T0ha8KWA-T9g":{"text":"Delicious!  We had the meatballs appetizer; so tender and flavorful. The po'boys were extr","useful":0,"cool":0},"WsNoVqkTKut-XsYmzjf3-g":{"text":"We were going to the Pelicans game and looking for a good place to grab dinner. A friend r","useful":0,"cool":0},"Obn9w7i5bRsr1Mku6mYFGA":{"text":"Great food, great drinks, great service, great people. The apps, poboys, and fries are inc","useful":0,"cool":0},"ch1dRRyFCg7k-CjPEyvGRg":{"text":"What an amazing find!  All of the best restaurants we found in town were outside of the to","useful":0,"cool":1},"f6uUc9s1bMfj_4Fca0m7lA":{"text":"It pains me to give it 4 and not 5 but I had too. Service A+. Love the look and feel of th","useful":0,"cool":0},"Ql4B11TFy-0s6Sm4uMkuVA":{"text":"What a wonderful lite dining experience!  One of the five owner sisters (featured on the w","useful":0,"cool":0},"4BdM6Rkrl_1RgsLMFIoqWQ":{"text":"From the moment we walked in the door, this was a five star experience.  Five sisters own ","useful":0,"cool":0},"UG4JWic5Num4KsVMGYGVFg":{"text":"Very nice place off the beaten path. These sisters have a lovely restaurant with a mix of ","useful":1,"cool":0},"f8ZOS0B-y53g08bOm6TTSQ":{"text":"Fantastic service overall, and we were excited to be greeted personally by one of the sist","useful":0,"cool":0},"Z9WGraKggK2ybFaSZ2miXg":{"text":"Great service and great food! One of the 5 sisters came to our table and introduced hersel","useful":0,"cool":0},"2ReCnF3oipBW76LGK5W-ow":{"text":"Love this place! Such an awesome vibe - the 5 sisters who own it are so sweet (well, we me","useful":0,"cool":0},"pMj2R_jk58j8fzUeSi1cbQ":{"text":"Great new cool spot. Food was amazing. Had the wedge salad and it had capers and dill- del","useful":0,"cool":0},"J-vBHDnuKFTl6itWPGpw4Q":{"text":"Five stars for the five sisters! I was glad to get a reservation for my large party after ","useful":0,"cool":0},"6UUZO4kOM9am41SQGx0EQg":{"text":"Had a great time tonight at Sorella for happy hour and beyond with Lana as bartender and h","useful":0,"cool":0},"0OBWQLoyl3mAqlN_pVO-eg":{"text":"Wish I could give this place 20 stars! Get the gumbo and the gator poboy!!! The bread that","useful":0,"cool":0},"ASuNFGBRDARYSveAHOL1jw":{"text":"I was visiting New Orleans for a conference and so my mission was to try out as many Po'Bo","useful":0,"cool":0},"zDoRy2YrzSijxOracYwQpA":{"text":"Had the trio. Jambalaya, Red beans and rice and gumbo. All were great. Loved the red beans","useful":0,"cool":0},"aKwQ4G_hCSbMWOqkIJs4iQ":{"text":"Wonderful family run restaurant serving local fare in downtown. This place has great food ","useful":0,"cool":0},"E8MnmJmoOnF25kCzqsbTrQ":{"text":"The food and atmosphere are AMAZING! My recommendations are the Berry Mojito, the Frankie ","useful":0,"cool":0},"-UPbQFE-zD2UONSBVKmvrA":{"text":"Hidden gem!!! Love the poboys. The service/ staff here are so welcoming. We will always co","useful":1,"cool":0},"B0brIMlESim4r5MVQaOtBA":{"text":"This place was so beautiful inside and so much care had been taken in all of the details. ","useful":6,"cool":7},"2b5xrT3IuThLSkHqmpOlsQ":{"text":"Yes!!! Outstanding dining experience... incredibly friendly! Greta food... must go!! Appet","useful":0,"cool":0},"SIB5G3yU_EHuuSpyQ686Sw":{"text":"Such a cute spot in the warehouse district! I stumbled upon this place looking for a drink","useful":3,"cool":3},"mI55xqKqkacgDbersbWBfQ":{"text":"We were so please to see another place to join our neighbourhood.    We found it to be all","useful":0,"cool":0},"05yjpoR70s-8_T1Ek042-Q":{"text":"Excellent atmosphere and service is outstanding! Food is beyond expectations. We came into","useful":0,"cool":0},"mzf-_31KAF1v-fHk15SnLw":{"text":"Hands down a great experience.  Place was busy but there were a couple tables open so we c","useful":0,"cool":0},"s534gfbWP2bIYWTWqcKf3A":{"text":"Nice for lunch. Clean space and nicely appointed. Service was good. Bar looks large and in","useful":1,"cool":0},"j9P-P6S_yLU0eybrLfaeAw":{"text":"I was looking for a good place for seafood and as I was walking there I stumbled across th","useful":0,"cool":0}}