{"iovacnMv3fxftolE2r0oLw":{"text":"Okay let start by saying that \"for New Orleans\", there's no other place like it. It's Colo","useful":2,"cool":0},"KBA_b_vwlbJZ5N-ekzpMwQ":{"text":"date night with the wife... and this place delivered. \n\nthe bartender even cranked out a c","useful":1,"cool":0},"K6d0FuUSM9i5yzTeXdq4bw":{"text":"I haven't been back here as I live out of state, but wanted to add to my prior review that","useful":1,"cool":1},"Ng5VK3ZnC9P9gz-dxuusSw":{"text":"We just returned from Mais Arepas; it was our third trip.  The first two times we tried, t","useful":0,"cool":0},"MSvQp0T2XqOw0JGMFPynbw":{"text":"Out of all the places to eat in New Orleans, Maïs Arepas is our very favorite!  \n\nThe most","useful":0,"cool":0},"Snyzuq9t39S-mIxTW0u4CA":{"text":"This place is fantastic! Started off dinner with the street corn which was out of this wor","useful":0,"cool":0},"nO-hFiZik9Ys8ICFNMEOUQ":{"text":"This is one of my favorite places to eat in New Orleans. Very unique and different foods. ","useful":0,"cool":0},"hgQtXI6mB0Co-6fN40lVIg":{"text":"We ate here before going to the 311 concert because it was a pretty quick walk from our ho","useful":1,"cool":1},"nSKCWN3tRW51AEYF88dpyg":{"text":"The food is bursting with flavor! My favorite was the corn on the cob, the sauce and chees","useful":0,"cool":0},"N69Moi-BNtzhHllLiH0DBQ":{"text":"Colombian food! Been looking for this for a while! This place is amazing. Food is very fla","useful":0,"cool":0},"jgU42m_ggAMEwhVL0zQ5TA":{"text":"The food is good,  but not for couples tried on three occasions and even at opening time s","useful":0,"cool":0},"Tcp4wq-vrLosH1FrSq4QZQ":{"text":"Delicious arepas and a great ambiance. Dishes would benefit coming with a side but otherwi","useful":1,"cool":0},"3qIAfXEMPN_HfmVkJrdGUQ":{"text":"One of my new favorites in New Orleans!!! The corn is amazing and the arepas are as well! ","useful":0,"cool":0},"_l-MTzoQtE1UwMkbvStDaw":{"text":"Wow! I've had my share of Arepas, and this place just put them all to shame. Absolutely in","useful":1,"cool":2},"2NqQXXIZyv1UtoCuh06LkA":{"text":"Ok I went back! It was good and the service was not absurdly bizarre. I like also that the","useful":0,"cool":1},"56A714GYyPUEPf2vGZVpbg":{"text":"The corn on the cob is delectable! The arepas are delicious, too. I had 2 glasses of sangr","useful":0,"cool":0},"LigxEkGKIvMNWT6hrUoBjQ":{"text":"Holy crap this place is bomb.com everything I ate here was amazing!  The drink menu is sma","useful":0,"cool":0},"i3t01AFEVaC5BA4XO1_jYw":{"text":"1st time having authentic Colombian cuisine.\nnotable presentation - accented the lunch mee","useful":1,"cool":0},"ogFCjas_F6bHYOmpu2YYsw":{"text":"I just got back from a month in Bogota. I was not looking forward to more Colombian food, ","useful":1,"cool":0},"5hStcRzfKluV-tMUkPYTVQ":{"text":"Loved this place! Staff was very welcoming and friendly. Restaurant was very clean, dishes","useful":0,"cool":0},"tmCQsn5lSiTO9eBLD2rhlA":{"text":"I can't tell you how much I love this place. My husband has one simple rule, we only go to","useful":2,"cool":2},"CJnpnoawwck_tE2FUeENFA":{"text":"We were visiting New Orleans for the first time and Yelp and a few suggestions from the st","useful":0,"cool":0},"mXVQ51HXe6LOxkMq6gu6sQ":{"text":"I had lunch there yesterday. Just 2 of us and the place was very empty at 1 pm. Our waiter","useful":1,"cool":1},"1wa2oat8BhVF9WyFm6_Mrg":{"text":"Acabo de regresar de Bogota despues de un mes alli. La comida colombiana nos parecio relat","useful":1,"cool":0},"1d8f4H1wUOgukqqZ3wJTEA":{"text":"Would get five stars if it was a little cheaper. That said, it's delicious! I got the mech","useful":0,"cool":1},"qjUQ12EmWO2QZIi2T-CUnw":{"text":"I had it while visiting New Orleans, and will be sure to visit there again for their sandw","useful":0,"cool":0},"fwu2DZi7drr5QvyRQewyhg":{"text":"I thoroughly enjoyed my meal here. Fresh fruit cocktails and the arepas are delicious!","useful":0,"cool":0},"vm7fJzqs6EPwvEY4iBPmsA":{"text":"Really good food!  Ceviche is the best I've had.","useful":1,"cool":0},"tZlgU4tBl7brrbSqpE0XJg":{"text":"Servers are excellent and very attentive.  The cleanliness of the restaurant as a whole is","useful":2,"cool":0},"fiw0L4Smf5uo-WVdEbNjNw":{"text":"The Colombian style arepas sandwiches here are definitely a unique experience in the New O","useful":5,"cool":2},"-uEFKZg163ivb0HMVaFDuA":{"text":"I don't usually post reviews, but this place deserves it. The cerda arepa was incredible. ","useful":2,"cool":1},"fERAZO4qTc4L_wIRSiwjtw":{"text":"Se amable o vete. Colombian restaurant 1 block from St Charles. Easy ride on the street ca","useful":0,"cool":0},"kmprNTSlHl68CK1EzBcG7g":{"text":"This is the best restaurant in New Orleans.  Amazing food, amazing drinks, amazing service","useful":1,"cool":0},"_fdiYy1azrG1pctkQXp9zQ":{"text":"Maybe the best food I've ever eaten. We were in around 7 on a Thursday and were seated imm","useful":0,"cool":0},"2936l9VFkEMDQuo8V4EQMg":{"text":"This is the best place for South American food in the Big Easy.  The corn is knock your Ma","useful":0,"cool":0},"EbzqHCRrYcj5_GjkWcupPg":{"text":"Love this place. Allows me to indulge in my obsession with Colombian cuisine. Highly sugge","useful":0,"cool":0},"-jjHyypr8dn01rmnJJrZig":{"text":"The most awesome dining experience. I have been trying to get to this place for over a yea","useful":0,"cool":0},"5QqEw3wPxr25vmryW5oBOg":{"text":"Crazy good food and bartender Kevan makes a fantastic watermelon Rita. Not to mention we s","useful":1,"cool":0},"o9SN6awX1Q1JGHy75WMT-w":{"text":"This is off the beaten path, but well worth the detour. The juice is fresh, the arepas are","useful":0,"cool":0},"r9MGP4wcm5098AprE_Nbig":{"text":"Due to delays with the St Charles trolley we arrived at the restaurant at 2:15, running th","useful":0,"cool":0},"0-FNf0wYf7JGkgYFI7fXcw":{"text":"This is my favorite restaurant.  The flavors are so rich, there's really something for any","useful":0,"cool":0},"1dhd_tgIMT98-e2D6u97pQ":{"text":"Absolutely amazing food! The service was great. Our server was very attentive and helpful ","useful":0,"cool":0},"BdTTPfu121EcPHQUVNWF4w":{"text":"Great food good price \nBring friends so you can share different foods\nGood service \nCockta","useful":0,"cool":0},"ZTk3B4TEpQjUCicKpIuQnQ":{"text":"It's so good, I almost don't want to let out the secret. Short list of my favorite things:","useful":2,"cool":1},"Nla9FxacKl9wkKRxzZhM7w":{"text":"Excellent food and service! My sister and I randomly picked this place to eat and so happy","useful":0,"cool":0},"o9WEvEh5j5IzX6xzlFMzqg":{"text":"The food is great!!  Even though reservations are encouraged they are not required. You ma","useful":0,"cool":0},"SpNwNxG3YIiF0w9AHbJJlQ":{"text":"We found this place from our Lyft driver. So ask for suggestions from them they will give ","useful":2,"cool":0},"fZ0rkGzAF_OrAEHdQMcvQw":{"text":"The best Colombian food I've ever had!! Will definitely go back if I'm ever in Nola again.","useful":0,"cool":0},"rsQi4x8vy5ZGFr9X1NyEzw":{"text":"This restaurant is fantastic and should be on your short list of places to try. We started","useful":0,"cool":0},"VaYQaHCuIheh_zX55LSW2A":{"text":"My very favorite restaurant in the city. The service is phenomenal and the FOOD. Omg get t","useful":0,"cool":0},"m2HdYMSVoS3_4--URjNDaw":{"text":"Started with the Arepas sampler and if those weren't amazing enough the Cerda Arepa and Aj","useful":1,"cool":0},"G5v87nuoz2Z8MxWVDokYfA":{"text":"The drinks were good, the food was good too but probably won't go back because the wait wa","useful":0,"cool":0},"W_B3vq8_KkAwHabDjp08vw":{"text":"Great place that is worth the wait and make sure to have a mojito while you wait! Make sur","useful":0,"cool":0},"zXSkb1Mcz093kAH5VI2H9Q":{"text":"Wow. I have only had arepas once before in NYC and I was blown away then. I was also a lit","useful":1,"cool":1},"wNFp1K4ynEIYIUfpNC7Tgg":{"text":"I haven't had food that was so flavorful in a long time! Each thing I ordered had a differ","useful":0,"cool":0},"8w8Qg3UpbjBb-Lgy3gSaKQ":{"text":"Really lovely waitress, great ambiance, great food. Get the corn!!! Also plantains are del","useful":0,"cool":0},"O6sKUG7pt6ZS1CvyBSP0jA":{"text":"Hum hum hummm... this place has amazingly tasty food! \nWe started with the Ceviche de Cama","useful":0,"cool":0},"B3o0BEUFqSAUxZZAADJhRw":{"text":"Excellent!!! Everything was great, from our waitress to the food. It is a bit small in the","useful":1,"cool":0},"v5dIvTEIS0Pla-K3UXtA9g":{"text":"The best arepas ever!! Yum yum yum yummmm! \nTheir drinks are also very refreshing and deli","useful":1,"cool":0},"-jdhyCPCPtCqCKRKIWA6tA":{"text":"I've never had arepas and these were a great introduction. Also, the grilled corn was the ","useful":0,"cool":0},"MKJl54KHsqwZwrs-zPUhig":{"text":"Great ambience. Wonderful selection of tapas that were all delicious. We had mais, ceviche","useful":0,"cool":0},"Jrjdg5U0M_H9mxb-rl5rdw":{"text":"I have been waiting to try this place for a while since i first drove by a few months ago ","useful":6,"cool":0},"RPD1DBfs07nRII2-M4TYCg":{"text":"I had been wanting to try this Colombian restaurant for a while because its walking distan","useful":0,"cool":0},"VPYX43NGZWYmbWJ4Jboz5A":{"text":"This place is amazing! This small spot near downtown is authentic and delicious. Brought t","useful":2,"cool":1},"eq-vWj_r9G81NB4CXzWPTA":{"text":"This place is awesome! I had never heard of Mais Arepas before a friend recommended we eat","useful":0,"cool":0},"Z7zH1e8ys4LnLG8ysZEkNg":{"text":"We were visiting from NYC. Didn't know where to go for food without shells (shrimp, crawfi","useful":0,"cool":0},"NfmpciEObIlIMNJCzArVlw":{"text":"You've just got to try this place. I can't believe I waited so long to try it. We got the ","useful":0,"cool":0},"BVvTUilq175X3lc-he8AzA":{"text":"As a Colombian, this is the best Colombian food I've tasted in the US. Is a must go for ev","useful":0,"cool":0},"xNN26E-tMJi465x_yBSRGA":{"text":"Absolutley DELICIOUS! We wanted a change of the usual cajun southern fare... The place is ","useful":1,"cool":0},"LY8T1vUmfrLKXusQJLlrjw":{"text":"The corn is awesome sauce! I'm from California and I always wait for the elotes man to buy","useful":0,"cool":0},"5CkgrRgI6yNiGbjrxTAAAw":{"text":"BLUF:  Updated review:  Still amazing.  I'll go back anytime and would give it 6 stars if ","useful":1,"cool":2},"SHcIXMGQWKyVRh45bIcbRQ":{"text":"Went early on a Friday eve, sat at the bar...service was spot on.  Drinks were great, all ","useful":0,"cool":0},"ESlIKmk8GuzJx7nlWWe7lQ":{"text":"What a hidden gem. The food is amazing and beautifully presented. Drinks were great. Servi","useful":0,"cool":0},"jvAwuWUcYcI0eQXRLkAu5g":{"text":"This place has been bookmarked to go visit for quite a while and I finally got a chance to","useful":1,"cool":0},"z2UX_t0Jgguv6C0ED8Fc2w":{"text":"Although the food served here is not authentic Colombian; it is very good. The fruit juice","useful":2,"cool":0},"YZ2i5mRd5FWJ0FWLxXHxPA":{"text":"My friend has been wanting to try this place for awhile now. I never been to a Cuban resta","useful":0,"cool":0},"YeLRpBklQS8f2gzJeJahaQ":{"text":"You may wonder about Arepa but until you try it you don't know and you will be hooked. \n\nC","useful":0,"cool":0},"AjxijxclvocbhQY62BpQDA":{"text":"Great food but horrible service. The waitress name gaby, was not friendly or helpful.","useful":0,"cool":0},"UJassH7nJTMx0MmkYy5Jiw":{"text":"I feel like this is one of the best hidden gems in the city. Everything on the menu is del","useful":0,"cool":0},"66J0nblMjwNTYq2YcWAH2g":{"text":"The food was pretty good. We shared the sampler and each had an entree. They give a good b","useful":0,"cool":0},"S41SnjwULgnnVvBdNsALxA":{"text":"I am stunned anyone has ever given this place less than 5 stars. The service is sincere an","useful":0,"cool":0},"WkZtm1_qC0RE2s-VGzKUug":{"text":"The food is pretty good, drinks & wine list are decent, atmosphere is okay, and the servic","useful":0,"cool":0},"DRUcOFAvKmAw1BPdYd7S5A":{"text":"This visit to Mias would be my second...and I was very excited based on my first experienc","useful":1,"cool":0},"se9Ep3F8nGC6hSpDKNviLQ":{"text":"They definitely had some startup troubles including long wait times, not taking credit car","useful":3,"cool":0},"rAr19stjFpj5oYkC2G9iFw":{"text":"I'm not sure what took me so long to make it here. The staff were all very nice. The food ","useful":0,"cool":0},"MmW4EX9JXm8IZzzQtmEHmw":{"text":"Maybe for Columbians they are very flavorful but for an Asian who lived in Panama growing ","useful":0,"cool":0},"QPLC-4iTUaGGDXPaW72bdA":{"text":"Great food you must try. Good location \nLoved this place & go every time we are in the are","useful":0,"cool":0},"hw1e4gOAtxs8rAoBuXR72Q":{"text":"Great atmosphere and food! We really liked that the food was different from typical restau","useful":0,"cool":0},"rxXhLhWo5raIjusWrSKAqg":{"text":"Fantastic, authentic Colombian fare.....\nnice decor, staff is very attentive, excellent fo","useful":2,"cool":0},"1p4tfRzFz58hs0SP-j8hPg":{"text":"Came here wanting to try something new and out of my comfort zone and is now honestly one ","useful":1,"cool":1},"5emEeq6I1xkwnMQ-SiGm7A":{"text":"Twice I have attempted to eat your arepas. The first time you had your hours posted incorr","useful":3,"cool":0},"ckGQQ8OeW3P8UcBmEPoDwA":{"text":"I absolutely loved this place!\n\nDecor and music were great- took you out of Nola and into ","useful":1,"cool":0},"xpFa3GLbyR5WJEyb4fBM_g":{"text":"I had this restaurant on my radar for quite some time and finally got a chance to visit la","useful":0,"cool":0},"nrEUcXAd1oQgQMZfSjSynQ":{"text":"Fantastic little place that brings a fresh taste to New Orleans! Though with a caveat... T","useful":0,"cool":0},"wwI3UJNcegNm7AAREjeafQ":{"text":"This is a hidden gem within New Orleans. The service was outstanding and the food and drin","useful":1,"cool":0},"Qnq-5Z5GkQC58ktqxVWJUw":{"text":"What makes Mais Arepas stand out is the layering of flavors in each bite.\n\nVery very good.","useful":0,"cool":0},"jv3gVrQhcFS-MxmSIbiKPQ":{"text":"Came here in my wife and the place hidden from the city but the food and drink are the bes","useful":0,"cool":0},"jq85cGyZJhX2lNCv6nL1Rg":{"text":"Authentic Colombian food. This food reminds me of what I used to eat when I was little. Th","useful":0,"cool":0},"3HyXs0QQuNIBHGn6rci9ng":{"text":"Found this place on yelp and the pictures sold me. It's a cute little place and everything","useful":0,"cool":0},"q1hKU5KOTZ9pJhT6XV_pNw":{"text":"I love arepas. After having them in Colombia I dream about them! This place hit the spot s","useful":1,"cool":0},"OjIvKrAEHObYnuIwOe1RTQ":{"text":"Visited on a Tuesday night and there was plenty of seating. The space itself is very moder","useful":0,"cool":0},"EEpjihHrK62ibCiBqQF5-A":{"text":"So so so amazing. I pretty much want to eat everything on the menu. I come here whenever s","useful":1,"cool":1},"NErCW5x1alDfwwgghyd0kQ":{"text":"Absolute favorite restaurant in New Orleans! I have a serious addiction to their mais, yuc","useful":0,"cool":0},"pnorumcnI0_v5koJjKlQiw":{"text":"This is my favorite restaurant because I LOVE arepas and these are the best I've ever had ","useful":0,"cool":0},"wrguQq929WDZPpUNcqe2qA":{"text":"Went here the other night with friends at is was amazing! They do not take reservations wh","useful":1,"cool":0},"nGy6_7mP5zC3sekBTTA-Fg":{"text":"The food here is delicious! It never disappoints. It can get a little packed, so make rese","useful":0,"cool":0},"guOv3-EPqa29K9puLtVr-w":{"text":"Hands down my new favorite lunch/dinner spot in New Orleans!  Everything I've had has been","useful":1,"cool":0},"4rv8ZNKetWmUaPWqAPgcsQ":{"text":"Waitstaff was great, food was even better. We came without a reservation on a Friday and t","useful":0,"cool":0},"aT9vBfMX4xuhTL5KEb-GMA":{"text":"The food  is good, but the service and the time they take to bring the foot is too much we","useful":0,"cool":0},"scSpj9A9zth63P75uE03DA":{"text":"I absolutely love this place. My husband's family is from Colombia and they all enjoy eati","useful":0,"cool":0},"vHEF9vm9RxTRQzKunzMmSg":{"text":"I've been here twice for an early dinner in the past 2 months.  I made a reservation the s","useful":0,"cool":0},"OxKC_oWjIYti-or81GilBw":{"text":"Only been once, but service was great even though we closed out the place. Excellent marga","useful":0,"cool":0},"MgZ1OOat74QyJguHWiZzTQ":{"text":"I was new to colombian food and sceptical about it from a friends description of arepas. I","useful":3,"cool":0},"epHLWJItTnRF6x2x3n2IoA":{"text":"Hands down my favorite restaurant in New Orleans. Try the chorizo and marinera. Don't forg","useful":0,"cool":0},"6_V1WS2GOGr9umKgNek-Og":{"text":"I am FLOORED!! This place is fantastic! The staff is so friendly and the food is out of th","useful":0,"cool":0},"6Kj8tE7lnu8kSWr0bHrs8g":{"text":"Excellent!  Every time I visit NOLA I go here!  The Chef is from Cali (city in Colombia no","useful":0,"cool":0},"LBhfKFlkLyR1WcRWS90w2A":{"text":"As an ex-pat Colombian, I was worried that Americans wouldn't like this stuff and it would","useful":2,"cool":0},"2s7TO34MY-39ht3RUqexJQ":{"text":"Wow, what a gem. I came in for lunch today and had the Reina Arepa, Maïs De La Rudea and a","useful":0,"cool":0},"yezS3Uc4F3X7M9zUsIFG4w":{"text":"This place was a hidden treasure for sure. The food exceeded expectations and i just about","useful":1,"cool":1},"3nHTpH5seNexTiFLzIZlRg":{"text":"So tasty! Really enjoyed the shrimp arepas and the delish plaintain appetizer our table sh","useful":0,"cool":0},"IkD3ZDgFCbHzAY-cmeN15Q":{"text":"Absolutely Amazing! My favorite Latin restaurant in NOLA! The Maïz De La Rueda is a must t","useful":0,"cool":0},"YGIUyDEtY_y1Y-QJateMcw":{"text":"Delicious Colombian food, love the Arepas, empanadas y aborrajados. Sangria was very tasty","useful":1,"cool":1},"cBCt4CZPp5S9Zx7NB-DU4w":{"text":"This restaurant is such a hidden gem! We had the Arepas Sampler and we couldn't be happier","useful":0,"cool":0},"mEyPNm7u6vwz-DrkwAzQUA":{"text":"Delectable food, superb fresh fruit drinks and stupendous service! Love this place. Truly ","useful":1,"cool":1},"fF3TkPC9L19mYrdcW36wyQ":{"text":"Ladies and Gentlemen,\n\n  Over the last year my wife and I have been here and let me correc","useful":0,"cool":0},"IAsr7j2o_SLryrq8myz7nw":{"text":"Came here for dinner.  Wanted to try something new, not the usual restaurants that we alwa","useful":2,"cool":2},"-nuiPRvR6ZwVsyE18py4DQ":{"text":"Very good food & drinks\narepas are delicious with crafty but not crazy varieties. great to","useful":0,"cool":0},"04LctSbmlQnHhWd9gT-htg":{"text":"Food amazing! Staff was nice and took their time to answer all my questions!!! I had the a","useful":0,"cool":0},"HVt9mhojg2xhYudexcc32Q":{"text":"The owner of Mais used to be part owner of Baru which everyone knows for it's fabulous tap","useful":3,"cool":1},"8E6h-be-sR1GesAM1L8fYQ":{"text":"Horrendous customer service. Employees flood the Yelp page with positive reviews and then ","useful":2,"cool":0},"wa4ajXTIWWiFWkGFWxYMWw":{"text":"Great please I took my family there they were very friendly and helpful to order our food.","useful":0,"cool":0},"uUdn0_VgIP6uwIDNwHbxyQ":{"text":"I came here with a friend who recommended it. The drinks were solid and the meal was fine,","useful":0,"cool":0},"1-UopoJ2GA8B18yBCImE1A":{"text":"Cozy and lively atmosphere w great salsa dancing worthy music playing. Food is delicious, ","useful":0,"cool":1},"QNBKEWiJn-aGbkL9N_5jbQ":{"text":"Being from a Colombian family I must say I was curious to try Maïs and how it compaired to","useful":0,"cool":0},"EYj4_w_VcAOekqVQF5cUVw":{"text":"One of my favorite restaurants in New Orleans. Service is slow, so just expect it when you","useful":1,"cool":0},"BbY5UG6Q_MyEuyy9Jn_Mfw":{"text":"This is the type of place that deserves my time for a 5 star review.  Not only can I not f","useful":0,"cool":0},"BYAJqBbJsnc71cNDlf3HOQ":{"text":"Fresh, delicious, and different. I've had the Marinera (shrimp) both times and I can't swi","useful":0,"cool":0},"kCfiEC86T9eBj8_9rlN_8g":{"text":"I love this place. Been here twice in less than a week. Everything so far has been burstin","useful":0,"cool":0},"B2ujcI4TEk0inm5Bwm7XJw":{"text":"Real authentic Colombian food and drinks. For drinks they serve Colombiana, Refajo, Aguard","useful":1,"cool":0},"oLujIGWx3Z4gYsdcAwdr5A":{"text":"We loved this place.  It did not come highly recommended.  Also, some friends and trusted ","useful":1,"cool":0},"zxrkUfDPGz-0h_wSqvfJcA":{"text":"Traveling through, and wanted a fun and informal dinner. Incredible and different food. It","useful":0,"cool":0},"Wk_Qxd6cpJSZ5kl0zibG0g":{"text":"Very trendy restaurant with astoundingly flavorful food. Service was slow, but it was wort","useful":0,"cool":0},"2LohQx8LkI3Gc4oalQfPuQ":{"text":"We had a fantastic meal at Mais last week! Being from Colombia, my boyfriend was skeptical","useful":5,"cool":3},"4iX9bZLILwiTdSl4ObYwIw":{"text":"Wow!!! A most for any body that love Hispanic cuisine... The sangria is to die for and the","useful":0,"cool":0},"5mwxkDVVX7gTYZ6zdQWySA":{"text":"This place is absolutely fantastic! Just left and enjoyed everything about it. Cocktails: ","useful":0,"cool":0},"SIG9ZFe_IefaqNxPsmN8Qg":{"text":"Delicious and affordable, modern but cozy. Me and my husband go there at least twice a mon","useful":0,"cool":0},"67YLxxKONQd3HbaOJq9h6Q":{"text":"Another visit with my wife and friends and another amazing experience.  \n\nThe place has su","useful":3,"cool":2},"PCZwHhOtvnBlzezY0zYI-A":{"text":"Wowwwwwww kalzoskdks wow. I once had someone tell me corn is a weird thing to eat in publi","useful":2,"cool":1},"t8jvfeSSclfQ58wSKg6-pw":{"text":"These arepas' are so freaking good. It's not the cheapest place but it is worth the extra ","useful":0,"cool":0},"AbBHRbHlsL0wSMi4vl88-Q":{"text":"Everything we ate was delicious. My boyfriend and I had an impromptu date night and decide","useful":2,"cool":0},"lhVccNYloCMpOIwkx4pJRQ":{"text":"Amazing. I would have left happy if it was just decent, since I haven't had much Colombian","useful":0,"cool":0},"JpGCwihMQcdAw6hmm-qVAQ":{"text":"I love their ceviche.  There is so much lime juice in it which elevates the other elements","useful":0,"cool":0},"xIsG-3LgsmizNVkHAfXEeA":{"text":"Only been a handful of times because I don't think the price is quite worth what you get. ","useful":1,"cool":0},"W2KIulE4JKD4tO_BkgVtHw":{"text":"Just tried this restaurant for he first time and loved it. Great service and food is delic","useful":0,"cool":0},"xRi9pEIQHDkw3uEgdPVVdg":{"text":"After being contacted from my review they only reserve 75% of the tables to always have ta","useful":0,"cool":0},"Dr-yUTaRTeKWxucQ-jjm6g":{"text":"We had the maiz appetizer and it was awesome! Marinera was very good with the chimichurri ","useful":0,"cool":0},"HINAc8K_1_4YX2E0mtJWnw":{"text":"My wife and I went in this time.  The place truly puts you in the Latin mood. The music, t","useful":1,"cool":1},"8R8muS_SsfAoD42xbXJCcw":{"text":"Wow, Amazing! The corn on the cob was out of this world! The empanadas were fantastic, and","useful":0,"cool":0},"5uBC0LTqEzmK_FfB6QjzXA":{"text":"Mais Arepas is a great example of a hidden gem in the city. I love NOLA and her delicious ","useful":6,"cool":5},"VNHTA3WA7jt11B-C1cWTmQ":{"text":"The service is a little slow but I think that has to do with how long it takes to make the","useful":0,"cool":0},"TfchFQwKkxGUoVGlPpzG6A":{"text":"Amazing food!! Everything is so flavorful! :) also its gluten free holy crap. If I lived h","useful":0,"cool":0},"UrJmnVDs2zyvgWcDjggc2g":{"text":"My favorite restaraunt in NOLA! On a 5 day trip, out of all the amazing food I had, I chos","useful":0,"cool":0},"8SdFwpyND7aa_y9xT5VDLA":{"text":"This place is a true neighborhood gem. i cant believe its been open 2 months and i been mi","useful":2,"cool":2},"hGet0FJFXDyagBuVt8Mg_A":{"text":"This was a fun experience because Columbian cuisine is totally new to me and it was quite ","useful":0,"cool":0},"YDNIep5s7AZkVX96h12Qqw":{"text":"My favorite meal in New Orleans by a longshot. Would not have expected an arepa restaurant","useful":0,"cool":0},"foeEBjUCmgT8juRq9ifqGA":{"text":"I loved the Brazilian drinks here. The food was okay. The food was extremely heavy.  At fi","useful":2,"cool":0},"i_eBaQ005HvUQw016GvwSQ":{"text":"This is the best Colombian food I've had in years!  Everything we ordered was out of this ","useful":0,"cool":0},"UOiv9u_JjbT9CJswNonNag":{"text":"I liked everything I got. That aside One thing that bugged me...my 9 month old is teething","useful":0,"cool":0},"1P-p2R7Ai7rvjFjjm0-R6g":{"text":"The only drawback is, it's a small place.  Everything else is outstanding.  I would come h","useful":0,"cool":0},"IRw_X91duDFP4yQfNGBGnw":{"text":"Que ricura!!! Mmmmmmm!!! I really enjoyed everything I had. Starting with maracuya juice w","useful":0,"cool":0},"epJRqOkz6c0hGu7Nn6vYjw":{"text":"We got there without a reservation but the friendly staff made sure we were looked after. ","useful":0,"cool":0},"XOAPufP6P0lyc6oWtNmHBA":{"text":"Okay okay. \n\nSo I ate here and it was fantastic! \n\nThe arepas were a solid 3/5. My mother ","useful":1,"cool":0},"VsdTJKdmknNzWcf-wzaoFg":{"text":"This is thee best Latin food restaurant in New Orleans. The ingredients in their food and ","useful":0,"cool":0},"e4bQM2scXfLRnMMBzPbAiQ":{"text":"The food was very flavorful. The staff was very friendly as well. I had the empanadas as a","useful":5,"cool":1},"TK-fxVo3MWGMxodrEbgFtw":{"text":"Delicious food, however, never try the takeout. They made me wait 1 hour and 20 minutes fo","useful":0,"cool":0},"m4TSvW9ZR_JtGkIwwCAhng":{"text":"Such amazing drinks and food. All of their appetizers are amazing. Fresh fruit in all the ","useful":0,"cool":0},"gMu1I4gbG1H9_ILOmVanzw":{"text":"The food here is amazing. I love arepas and I was so glad to find an Arepas restaurant whe","useful":0,"cool":0},"03jnXqgkhkZG7xJ5Gg9ipg":{"text":"A hidden gem found in the warehouse district of NOLA. My husband and I were feeling a litt","useful":1,"cool":1},"VSato0-cjqP2V0ubHU5o2g":{"text":"This place is amazing! The food is unique and delicious (I must agree its a little pricey ","useful":0,"cool":0},"IzxM4cuggyBKuTUtnSNpMw":{"text":"Super tasty arepas and cozy atmosphere. Would love to go back and try them all but for now","useful":0,"cool":0},"mPXpk6QITr2grqJUPvhW_A":{"text":"This is one of the best gems in the city. The food is a delightful mix of flavors and the ","useful":0,"cool":0},"FOhRo5pWAdKdINi6ZkICFQ":{"text":"In town for French quarter festival and this was our first stop for lunch around 1:30 pm o","useful":0,"cool":0},"Bp0MKAa37sICzJZElBaB-w":{"text":"Finally something truly Colombian in NOLA. Go hungry and order the Bandeja Paisa and prepa","useful":3,"cool":0},"h0Fa0lEAYb2ofYKyzpxXaQ":{"text":"Cannot wait to go back here. It's nice to find a place that is so different and where else","useful":2,"cool":1},"7PkUoSWSAWp3BqJ0jzJY9w":{"text":"The service, food and drinks here are delicious.  I must say that the soup was, in particu","useful":0,"cool":1},"Z35DBoGDjZAWlI63uWxF5A":{"text":"Visiting NOLA and decided to try arepas here. I love arepas and this place had great revie","useful":0,"cool":0},"WPSaES0xASp1rzQv9PXYOA":{"text":"My new favorite lunch spot featuring real authentic Columbian arepas. OMG is this place go","useful":5,"cool":2},"wN2IW2WiX8ze7-ROcwGbeA":{"text":"Love this place. Great ambience. The corn appetizer is amazing. The Arepas are delicious a","useful":0,"cool":0},"3jUYEwS2FLnTeCPnW77nRA":{"text":"Superb and delicious (spelled out). To start off, the empanadas were to die for with the a","useful":0,"cool":0},"TNreNe__ItZpuCIqAGWoyQ":{"text":"We drove by last night and decided to stop in.  Everything was SO freaking good, it's not ","useful":0,"cool":1},"KNsbMITYz0OOJ9ZhpMPH8Q":{"text":"If you could have a new favorite place to come  in and enjoy a meal this would be mine.\nI ","useful":0,"cool":0},"_-ms08FFZnoJFk9b4PH0wA":{"text":"We ate at the bar, and the bartender was really friendly, very engaging, but not imposing.","useful":0,"cool":0},"O6e3c08mue5cmihjqELzAw":{"text":"I have been waiting for a Colombian restaurant to open in Nola and here it is ! \nFirst off","useful":1,"cool":0},"pjmGcOM6XGVzL6FSouTo0A":{"text":"This is truly a gem.  This place might be a bit out of the way, but it is totally worth it","useful":1,"cool":0},"2uL3rhcUvkenLSIHvXalPw":{"text":"The food here is very good, if not a bit expensive.  But they wouldn't seat is and we were","useful":1,"cool":0},"czKgQ1UupXb3oCb7qfcyeg":{"text":"If you want to have arepa touched by the hands of God this is the place to come. Taste jus","useful":1,"cool":2},"IDUK35f1WvGOg9qeq3EX8w":{"text":"Really excellent food and friendly service.  The drinks were good, the mojito was great. T","useful":0,"cool":0},"tZ2aA8AeLmNx0HodYcidag":{"text":"This place is delicious and must to go and eat. Next time we are in town we will make it a","useful":0,"cool":0},"qH9RwoSeuZ0YGiTc3aLTig":{"text":"Great spot for people with dietary restrictions. Vegetarians can try the delicious corn ap","useful":0,"cool":0},"eRpGgYVsBSjgYK041MYsUg":{"text":"Absolutely love this cute little hidden gem!! Stopped by here a few weeks ago on a whim fo","useful":2,"cool":0},"abQf0qMrlO7kH7oaTF59Xg":{"text":"SIMPLY the best!! only the best food served at this amazing infrastructure. \nI find it unc","useful":1,"cool":0},"fwYI0dqVSTWSdB5HiGRrPQ":{"text":"The best columbian restaurant we have eaten at- and the best arepas! Loved this place and ","useful":0,"cool":0},"GCKtQUBOyWn90u6gBmFo9Q":{"text":"Delicious food and atmosphere my friends and family enjoy everything we order \nWe just mad","useful":0,"cool":0},"OS00sxDYPh0hbIYObnIcfw":{"text":"Based on all these fantastic reviews, I'm going to assume my experience was the exception.","useful":2,"cool":0},"dg9HDIb3Tbds7hkBz5yAoQ":{"text":"food was AWESOME. i was very nearly in ecstasy. had skirt steak with avocado, red beans, p","useful":2,"cool":0},"vCbAXjGmVs5NTtQiBw63qg":{"text":"Amazing food, staff and drinks. You'll regret not visiting this place while in NOLA!\n\nIt's","useful":0,"cool":0},"TgldbtPuqb0mLBT8-4KSJw":{"text":"The chef at Mais RUINED my planes for an incredible arepas. Last time I was in town I had ","useful":0,"cool":0},"HEV1-UIfsLzbg1XXZFipWQ":{"text":"TE food here is great! Empanadas, ajiaco, carnicera arepa, cranberry beans and a margarita","useful":0,"cool":0},"0OK2CYOF_ylTrORVSZZOFQ":{"text":"I've had arepas in my day, but nothing compares to these. Had the pork belly arepa, amazin","useful":0,"cool":0},"Gmrf_Swqopc0P3ygu9obOA":{"text":"Ahhh!! I was so excited to find this place near my air bnb. There was a little bit of a wa","useful":1,"cool":0},"Czc4WZBh3hrTkvQYu9p95w":{"text":"I have gotten to go and dined in. Staff is always super friendly and food is amazing (lite","useful":1,"cool":1},"eX3UikgSb17XFXRRnHcBuw":{"text":"I absolutely love this restaurant.  This is personally the best restaurant I have tried in","useful":0,"cool":1},"lYhAB5kKDMAoaVRn8IP55A":{"text":"Four stars because there were no substitutions allowed (I wanted yuca fries instead of pla","useful":0,"cool":0},"Pl2rbbVu9_QXkaLKBsS4Lw":{"text":"Very cool place with unique food to our region! everyone in our party of 7 enjoyed their m","useful":0,"cool":0},"hYYx2hOTdPB1kwyiz4iunQ":{"text":"We walked here after Wednesday at the Square in May.  FABULOUS!   We had ceviche for an ap","useful":0,"cool":0},"voXrah3tLWDO1KOROwAhOg":{"text":"Well well well. I was feeling nostalgic today as i ran across footage on my computer of my","useful":6,"cool":7},"AYY3T1f7w2S2Dym-n-WqRw":{"text":"OMGEEE! The food here is Columbian, but even if you don't like ethnic food, you MUST try t","useful":1,"cool":1},"etDeKtXlbexSOfMDfDx3hA":{"text":"What a great and unique find. Went here tonight with friends and had several appetizers an","useful":0,"cool":0},"B5l3bf5IZFIzXFfjaBQBtg":{"text":"Delicious food (I had chicharepa for dinner), very friend staffs, nice music and environme","useful":0,"cool":0},"KESw6p5nr4UGLpQvktVfwQ":{"text":"I had the red sangria and it was delicious and refreshing. The Main de la Rueda was spicy ","useful":0,"cool":0},"glPOOrkul0aftcbd3r-u-w":{"text":"This is one of my favorite restaurants in NOLA. You haven't lived until you've had their c","useful":0,"cool":0},"rEskRfqZWk3zBYB54xjrLg":{"text":"Columbian creole omg. Mind completely blown.  Their Arepas are so good.  I wanna come back","useful":0,"cool":0},"O1u6fdVlOMqWwL2pdSXtRQ":{"text":"Delicious and wide variety of arepas. The presentation of the plates is beautiful and the ","useful":0,"cool":0},"8hrXo023g91JSPYoyE68BA":{"text":"It's hard to find a place that's: POW, Shazam-ski, Shamboooooyah!!!  \n\nThis is that place.","useful":0,"cool":2},"B6_DDj5OGeKGzvmx9OtAjg":{"text":"I really felt that this place was an all around win! Mrs. Gabriella was great. She was pat","useful":0,"cool":0},"6t9f7NEI0wZDsYjU3aUXhQ":{"text":"OH MY GOODNESS! This place is AWESOME. The food is very tasty.  I had a mojito, which as p","useful":1,"cool":0},"4i_3EHeyj3SJMnL-gk-V6Q":{"text":"Delicious Arepas!  Delicious cocktails too.  I don't recall many options for vegetarians. ","useful":1,"cool":0},"eRrzWdbcKXinsCWaBHJOgA":{"text":"AH-MAY-ZING food!  Great service!  My first time having Colombian food. I had. A pineapple","useful":1,"cool":0},"RymS-5NvOvtNbY8cyT7c6g":{"text":"Great food. Corn is awesome! Drinks take awhile, but are delicious. The big hit is with th","useful":0,"cool":0},"IFW3KcSNsb0DCfsrPUu41Q":{"text":"Wonderful service and food. All the drinks are specially made. A huge plus to the neighbor","useful":0,"cool":0},"B9cHLKBusg-qpp3FxfN95A":{"text":"Being a Native Colombian, I went to this restaurant with moderate expectation and craving ","useful":0,"cool":0},"XHf0Nyw14ZLMHpuxsMwOjg":{"text":"Great food, slow service.\n\nStreet parking is available, but don't park too far on the main","useful":2,"cool":2},"Evt9AdB6qVxpYU5NIxfNUQ":{"text":"Extremely good food.\n\nGet the corn on the cob thing, the sauce is incredible. Choose an ar","useful":0,"cool":0},"C8fRhderzKBJ96C6mV-vRg":{"text":"Came here for a late afternoon lunch- a casual vibe with five star flavor. Well balanced d","useful":0,"cool":0},"dlwr9dmwZXALk_DjijFcjQ":{"text":"Exceeded all expectations.  Service was friendly and warm.  Food was spectacular.  Ambianc","useful":1,"cool":1},"1dTU84BIKgMdBgN6nKqmjA":{"text":"One of the best little restaurants in NOLA. FOOD AND SERVICE was excellent. Highly recomme","useful":0,"cool":0},"kh1vwsFmrKNt2SxQa_DDiA":{"text":"I've been watching this location for a while and was able to try it today.  Loved the fres","useful":1,"cool":0},"dqvVy5bQC0f0osx7s4fRsg":{"text":"First time here and OMG.... everything was delicious. I was quite impressed.  Was there wa","useful":0,"cool":0},"FK4ipVXVgc2sr_AVlmHHlA":{"text":"I arrived with expectations based on various menus for the place that I searched up online","useful":1,"cool":0},"WWtKc752TQ1utXMy_XHppg":{"text":"Horrible staff. Got here at 6:20 for our 6:30 reservation and they turned us away because ","useful":0,"cool":0},"Fjd5UjATSjVx2ocmULmu_Q":{"text":"Let me start that this is the third time I've tried to place a takeout order and have been","useful":1,"cool":0},"hy5-MSPy24xCOt-J9MUymQ":{"text":"The shrimp arepa and red sangria made for a decadently delicious dinner. The flavor profil","useful":0,"cool":0},"rfZ8EfsYXFZyY8HRVH9xBQ":{"text":"Have you ever been to a place that was so amazing that you just didn't want to tell too ma","useful":6,"cool":4},"b7ADdXfE-7C7HnP9_F8hEQ":{"text":"The food was good, with an atmosphere to match. However, it's a bit on the high side of pr","useful":1,"cool":0},"I-wKq-y0PBR3MH5-63gbLA":{"text":"Came here for dinner with the BF on a whim when our fav taco Tuesday spot was too crowded.","useful":0,"cool":0},"aBZZBJiqTbaXgqH__7Tflg":{"text":"Food is amazing. Fresh, earthy flavors will fill you up quickly. \nDespite what others say,","useful":0,"cool":1},"hZMd6NYa886LqiuJ-Z1pIA":{"text":"Very good lunch. The arepas are spiced nicely. Good South American comfort food. We were g","useful":0,"cool":1},"3Kfqz20GVETYbIfazKHH0Q":{"text":"I could kick myself for always forgetting to specify that I *do not* want Top Shelf tequil","useful":2,"cool":0},"c_hEJLDApYzef9wiIarvwQ":{"text":"Really loved this place, food was just delicious as were the cocktails and the atmosphere.","useful":1,"cool":0},"9UvfYpbCtvM1wmGdioz7Fw":{"text":"Who knew...that I am a lover of the arepa. Certainly not me until I came here last night a","useful":5,"cool":4},"3pSl_UoDLWTjX2w-LvkvyA":{"text":"Columbian food was a new experience and our waitress was great about explaining options an","useful":1,"cool":0},"IgtiQT6a9RrdwY1qPABhlg":{"text":"Friendly service and great food! Try the variety of fresh juices to really set your meal a","useful":0,"cool":0},"h3V3HmRviKoVRYVrLWk4UA":{"text":"Okay the previous reviews really let me down here.... \n\nMy fiancé and I thought we'd give ","useful":1,"cool":0},"WxHZUlgctVwWSGd4tsa9Fg":{"text":"There is one menu item not listed and it's especially for fellow vegans: pataconcitos. It ","useful":0,"cool":0},"IjXIBI3JP_aLEniF2G6P9g":{"text":"Really great food unique.  Small intimate setting service was great everyone was so sweet ","useful":0,"cool":1},"NC2eWq8979DxdqP1RqjX8Q":{"text":"I could eat here every night for the rest of my life. We started with the empanadas and we","useful":1,"cool":1},"JnIUkhLyw24BVAJwIG9Ing":{"text":"small place, but pretty busy.  the hubby and i went on a saturday night without reservatio","useful":0,"cool":0},"pFTwi0-BbqCxvU8lGNS-Tw":{"text":"This is such a nice little place for drinks and delicious food. The food is fresh, flavorf","useful":0,"cool":0},"nKJ0QAWy46Dl4FkZTBJJYQ":{"text":"Although this restaurant trys to pass itsell as a Colombian restaurant, it is far from it.","useful":3,"cool":1},"lHcuS1zyDPkWtK-E0ualjQ":{"text":"Mas bueno small place off the beaten path in New Orleans.  This would be five stars short ","useful":0,"cool":2},"p3ReraEsMdo27ho8rhYJVA":{"text":"Caramelized onions, chicken, and cheese sounds simple, but with the pink aoili...wow. Ever","useful":1,"cool":0},"pegXuFUnMD3xo1GWk7dAPw":{"text":"Que delicia! The customer service was great! And the arepas were super flavorful. And they","useful":0,"cool":0},"qluz-f4mAaJJdrfbftDveg":{"text":"I just love this restaurant. It has a fresh yet warm decor and the food is so yummy. Today","useful":2,"cool":2},"nX0nnNvHWs4tJpSxfe82Tg":{"text":"I've been wanting to try this place for long, and I wasn't disappointed! The corn on the c","useful":0,"cool":1},"8tvTitpiAyJgTv3U1bwZNw":{"text":"Since John has been raving about this place since last summer, I finally stopped by and tr","useful":2,"cool":3},"wf8nR8U-6uJknbMyBaaDrg":{"text":"simply aMAÏSing. fantastic delicious food- so many options and all are great, comfortable ","useful":0,"cool":0},"FNw0c0vcvp2YxEkX1KRq9w":{"text":"Oh wow. This was my first experience with Columbian food. I followed the recommendations o","useful":1,"cool":0},"Crw8BzYJYavfkfczvnBDHA":{"text":"Ok people, make sure you get the Ajiaco soup. This may be a Columbian restaurant but in my","useful":3,"cool":4},"RrkQnW3oxsGNB5Cey7WX8Q":{"text":"I've been told about this place by friends. And it was better than my expectations. A litt","useful":0,"cool":0},"dMirGAGaMIMOePG5j7QQRQ":{"text":"Drinks and food on point! Everything was great especially service. Mais de la rueda (corn)","useful":0,"cool":0},"hQvMkFd2EtU-GRujUlrx4g":{"text":"Mais Arepas is a small little place packing an excellent flavor punch. Went for lunch with","useful":1,"cool":0},"29valjZCf3sjGzKU1Knljg":{"text":"Maïs Arepas is my new favorite place to eat at! My teddy bear took me there for my birthda","useful":2,"cool":0},"dkIggIuuwA2P-E844PkwQQ":{"text":"I have been dying to try this place because I pass by every morning. This food is off the ","useful":1,"cool":1},"y6-6I7tXJPmTXBzst4o8Ow":{"text":"This was my first stop on my mini vacation to New Orleans this past summer. I loved the at","useful":0,"cool":0},"B0cj7PXrktaRKzwbic3TOw":{"text":"Really great food. We were a table of 6 including two small kids. The staff was very accom","useful":0,"cool":0},"ysiG06g6kQ8u-JDO1GpJTQ":{"text":"It's great to see that NOLA is opening up to more Latin American food beyond tacos. \n\nThe ","useful":3,"cool":0},"ZwDk0B0AnqljZ5Za84COxw":{"text":"Fantastic cocktails. The regular margarita and watermelon margaritas were fresh and delici","useful":1,"cool":0},"T7WMIGwLBx2G9xxEyWmWVQ":{"text":"Horrible service! The host staff is rude and unpleasant! STAY AWAY FROM THIS PLACE! For a ","useful":0,"cool":0},"AfgpEM__uq-J1nwcYAflFg":{"text":"Great authentic Colombian arepas! Ate the mechada and cerda an both were great.","useful":3,"cool":2},"BqkWjTJ6fe9e4BSozwpEPA":{"text":"Food was phenomenal. I recommend the ceviche to start, then the cerda sandwich was amazing","useful":0,"cool":0},"wTHUTKOkdsj_jTOj1f1EnQ":{"text":"I ate dinner here with my mother last night. I have been a few times, but this was her fir","useful":0,"cool":0},"alyfZkOi9M45Pq4AGTLaPg":{"text":"Totally worth the wait. Everything that came to our table was prepared so well... I mean e","useful":0,"cool":0},"HIydaXcVw4mrD3k1ILmYDQ":{"text":"I actually signed up on Yelp to write a review for this restaurant.  Hands-down the best m","useful":3,"cool":1},"LHJ3XLYrcwKQ_XTpfKm97Q":{"text":"Amazing flavor great prices and really different menu choices!  Never had Columbian food b","useful":0,"cool":0},"DctUBMjdZFOn6lki6Fje3A":{"text":"You can't go wrong with the appetizers, we have one of each. The Arepas are made to order ","useful":0,"cool":0},"5C-DiNcW2ZiGZQBB6tPM_g":{"text":"Yum yum in my tum!! Got the arepa sampler and it was great, just wish they were a bit bigg","useful":0,"cool":0},"FlOWEUEqYFx4rZSWBK0nGw":{"text":"Another option for the gluten free and dairy free of us. Excellent choice and they will re","useful":0,"cool":0},"wC91oTt5pV9CVroz-WhUXA":{"text":"Best Colombian food. Yucca Frita as an appetizer is a must! The mechada arepa is amazing. ","useful":0,"cool":0},"Tm7W9d3yQX45YT2uFtZpOw":{"text":"I use Yelp almost daily and attended a recent Yelp event and it occurred to me that I have","useful":0,"cool":0},"A53DEZD84X79kMZuORQBbw":{"text":"There's been a lot of buzz about this place so I thought we would check it out.  The first","useful":7,"cool":3},"yM7J75uzPCsu2XvKVT1zkw":{"text":"Great great food. Ordered corn appetizer and pineapple caipirinha to start. The sauce and ","useful":0,"cool":0},"iLYxu_fAzHRrC-kZkKk6Cg":{"text":"I visit the restaurant yesterday the people were friendly and the food was fabulous I will","useful":0,"cool":0},"6iVqW9cfSSAyAnpQH8cT_A":{"text":"I didn't expect to find Arepas in New Orleans, but obviously I did. This place was great. ","useful":2,"cool":0},"nrygUJLwa0jYtrJjgl9HnA":{"text":"I love this place.  The arepas are fantastic!  I always have to get the mais de la rueda. ","useful":0,"cool":0},"90H-gC5doENhbkvw3v-cYw":{"text":"I #dream about the ceviche and Maïs de la rueda. Ah-mazing! You will be tempted to lick th","useful":0,"cool":1},"heKvKxY7ZJ-HfyilNd0KLg":{"text":"Loved this place so much that I promptly returned the next day to show it to my husband. F","useful":0,"cool":0},"PD3XCZhD3SyFC3zo_mwi3g":{"text":"The food was soooo good! Service and staff were so friendly and attentive. The blueberry m","useful":2,"cool":0},"4VwIZaMn-e7Vp41iqDnNyA":{"text":"Excellent introduction to Columbian food. Crowded so we had to wait but the service and fo","useful":0,"cool":0},"BQQYPn4MQI4ALz0nIIiyqA":{"text":"What do you get when you mix a couple of stoners and an ethnic menu?\nExceptional (yet real","useful":8,"cool":4},"aAITfCYAyzVJZG6t_PtEZQ":{"text":"This is an awesome place to come to eat food is good service is great to Bart is bad ass","useful":0,"cool":0},"xGnlwhRHZCPomMTtW-LTQw":{"text":"Get the plantain and melted mozzarella appetizer. You will die.","useful":0,"cool":0},"D14P75A7ckV7KEY3UUBOXg":{"text":"Went there for the first time yesterday.  Loved the food and the drinks.  We were told it ","useful":0,"cool":0},"sbC2qU7p-2bDkUvNTn3-UQ":{"text":"You may wonder about Arepa but until you try it you don't know and you will be hooked. \n\nC","useful":1,"cool":0},"ZmESgONuHSqQIBxg_zCr6g":{"text":"Mais Arepas is such a unique little place and I really like it!  I had never had Colombian","useful":7,"cool":6},"tcvvq3AGGfKUCn3USg7ZSw":{"text":"The food was unique and delicious. truly. But, do NOT go here starving. The apps take abou","useful":0,"cool":0},"9UL0bwuhpGC42jSHZChhkQ":{"text":"Really good arepas, patacón chips, and mojitos! Surprised to find awesome Colombian food i","useful":0,"cool":0},"gxzY2APUy9kGvONb-Vg9yg":{"text":"This place was ok to me. I ordered a chicken sandwich and I showed her the picture and cam","useful":1,"cool":0},"HqGUnD37VOQvhbKiQrvdHg":{"text":"This place is wonderful.  A friend and I went for lunch and it's now on our favorite list.","useful":2,"cool":0},"udZzdzWnQ9BQXYu9K2zxdg":{"text":"Different food, and worth trying.  Great service, delicious food, nice atmosphere, good se","useful":0,"cool":0},"wjBXLfkBmVrMa0hkHugnZg":{"text":"Legitimately one of the best all around meals I've had in a VERY long time.  We tried a bu","useful":2,"cool":0},"bQhLhm_YFzdnhUDUN7TWBw":{"text":"Colombian restaurant in New Orleans that tops many Colombian places in locations where Col","useful":0,"cool":0},"kq7zu3fPCnPqALUTLyJY2g":{"text":"A good friend of mine brought me here on my visit in from Texas. To start this off lets ju","useful":3,"cool":1},"rW-sI2-NKQIb8gcWVWlj7w":{"text":"My favorite restaurant by far. The selections are so creative and delicious. We live an ho","useful":0,"cool":0},"Nquv9dRz4fXSDKg4HZ83iA":{"text":"Pretty cute place but the scent in there kind of threw me off a bit. You'd get used to the","useful":0,"cool":0},"vkdOcqPUmk2pOWSsM4I1vg":{"text":"Wow, what an unexpected surprise.   My wife is from Colombia and we always try to find a C","useful":0,"cool":0},"mWJXBCXAtIGeEIl34aLNJw":{"text":"Great food, large portions, friendly service, lovely decor. A unique experience. Colombian","useful":0,"cool":0},"cmVohJdGdq_gUi0igvhR-g":{"text":"Let me start with the obvious: no one comes to NOLA because of the delicious arepas... but","useful":2,"cool":0},"EoOeHibLta3kgz_CyrSr2A":{"text":"Listen, there are good restaurants and then there are special institutions that excel in c","useful":0,"cool":0},"Jp-RDTt_sVbEagRL42eujg":{"text":"Amazing! If you have never had Colombian food or enjoy Colombian food, this place is amazi","useful":1,"cool":1},"ngJTzJABkX4U5Kz25T55yg":{"text":"This was my first visit to Mais Arepas.  Parking is a bit of a pain and if you see a parki","useful":0,"cool":1},"XwGTjYbujnDtLWSBQY6JTQ":{"text":"We came here on a whim on a Friday night, and I'm so glad we did. We did end up waiting ab","useful":0,"cool":2},"FuKdoqvvyax5yS_hSzVQkQ":{"text":"This was amazing! Drinks were rockin. Service was excellent. Grilled corn was the best.","useful":0,"cool":0},"L0kXZCFP_2uYCBBYHKeFjA":{"text":"Great food.  Place was on the small side.  Not really near anything, but that might be a g","useful":0,"cool":0},"NdQsBWD59xiW-mvtNWN78Q":{"text":"This place is amazing! Absolutely delicious and great service all around.\n\nI have been her","useful":11,"cool":10},"8mLwa0gOuuO9OQBI4jIR_w":{"text":"If you've never had an arepa, shame on you. If you've never been here, shame on you again.","useful":0,"cool":0},"nlMDswE_iEVeoCd7um__YA":{"text":"Food was great! We were there on a Friday night at 6 and the staff was very friendly and h","useful":2,"cool":0},"8_3mUDbyGMRd0g0kqRmlVw":{"text":"Pretty friggin good.  I've lived in Colombia and this places arepas are exactly the same. ","useful":0,"cool":0},"aOUmDiOxSildVE1MwEgo0g":{"text":"Excellent food! By far my favorite place in New Orleans. So happy to get away from the typ","useful":0,"cool":0},"vOqcE2OFiGUUErAOIxS6qA":{"text":"I have no words to describe how much I love this Place. Like you HAVE to go! From the frie","useful":0,"cool":0},"nlvVkQx4uTcoCrf8ZWjVLA":{"text":"Got the arepa sampler platter and it was so good.  The sweet plantains and friend yucca we","useful":0,"cool":0},"cds8IXT_2yVZx66pwuLamg":{"text":"Delicious! The arepas are on point. I had the fried porkbelly \"chicarepa\" and it did not d","useful":2,"cool":1},"52F5psvFcX1CKL6eRkC14Q":{"text":"Great ethnic food (Colombian) w contemporary approach, the place is as cool as it can get ","useful":4,"cool":1},"19INXz1M2mlrEolkdClqfA":{"text":"O M G. I can't even begin to describe how good the food was, but I'll try. We started with","useful":2,"cool":0},"vx5al0zwl2cLBiHnZYgfxQ":{"text":"Does it say much that we came for lunch three days in a row? The Après were amazing. My fi","useful":1,"cool":2},"aht09PPfKkdqJ5Suhr8H2w":{"text":"Well Darn! This is a beautiful location. The restaurant feels like you are walking into a ","useful":1,"cool":0},"9lvjbJ0boutNQatSZTje4w":{"text":"This restaurant is like a hidden gem. I can't believe how amazing the food is here and the","useful":1,"cool":1},"k8Ia7VjWmALvQD9RuTpcRw":{"text":"Went for my birthday last year. The yucca was unbelievable! The lulu cocktail was deliciou","useful":0,"cool":0},"8668JX0Q5CcoLrg9npbVXg":{"text":"I was able to eat here for the first time tonight and had a wonderful experience. The food","useful":0,"cool":0},"-1X-rgsrihhw2ss27shRDg":{"text":"THIS PLACE IS THE BOMB DOT COM ON THAT GLUTEN FREE TIP! who doesn't love arepas?!! everyth","useful":0,"cool":0},"2bkbqK-WIEP0LI_ZL-MdWw":{"text":"Came on a Sunday evening without a reservation and thankfully was able to be seated within","useful":0,"cool":0},"G9iDss6Q59MdjY5WvIOQNw":{"text":"I am trying to find words to describe the delight in each bite I had that day and I'm at a","useful":2,"cool":2},"XuOxSUNdXkB894BaMW7Log":{"text":"It was a great dinning experience.  The food was wonderful and authentic.  The service was","useful":0,"cool":0},"As2AJzQy77llzIjLmCZwQw":{"text":"My wife and I ventured into central city to try out some Colombian food.  Low and behold M","useful":2,"cool":1},"xUKk61gTENjUys3rqQf6AQ":{"text":"Great atmosphere!! We had the ceviche, it is a little spicy, but it was amazing! We also h","useful":1,"cool":0},"OxVTeX1I40ygqutwcBvo4w":{"text":"Cannot rave enough about the food here! Ordered the patacones (a trio of steak, shrimp and","useful":3,"cool":2},"LDZLzDSLaUGL0-_1sQmyvg":{"text":"Excellent service....excellent food! I wish I would have stumbled upon this spot a lot soo","useful":0,"cool":0},"F5LZW1EV_7mjtDGZmrwO5A":{"text":"This place is amazing. I've been here twice and the second time was even better than the f","useful":1,"cool":1},"EfFaeklXeHtWg679ycZA1g":{"text":"Amazing arepas in a hidden gem in central city. This is our go to when my Colombian wife n","useful":0,"cool":0},"eYU3BhJtLVKJ4db4QMOfzg":{"text":"I'm a Colombian far away from home, until yesterday. Mais has the taste and flavor of the ","useful":12,"cool":0},"AQM5HKCCKtZ-x-oNvZQ20A":{"text":"It's happened to me 2 times now, showed up half an hour before closing and hostess says \"s","useful":0,"cool":0},"tA5mgaBWwAuNfy-sxP4kVA":{"text":"Hands down the best Arepas i've ever had! We started off with fried yuca and chorizo app, ","useful":1,"cool":1},"fdewszbPytY3K3gIWqLMVQ":{"text":"Their food is amazing and the staff has a great attitude. \nIf you come during a wait, it's","useful":0,"cool":0},"Jfr7awEboANN-MqEvtypQg":{"text":"Fantastic food! Great ambiance! I loved their yuca fries with that amazing avocado dip. Ev","useful":0,"cool":0},"v0pA21KHrqKA9nC8CqWjxA":{"text":"This was the third time trying to dine here but the first time actually doing so. The firs","useful":1,"cool":0},"RVMnjEfSKdNHisAvNeseNw":{"text":"Mais Arepas never disappoints! Everything is always fresh. The staff is friendly and alway","useful":1,"cool":1},"kk21xoAkwIcpDfTHmNtrwQ":{"text":"Excellent food!\nFound this on Yelp. Gave it a try and LOVED IT!\nCeviche appetizer was exce","useful":1,"cool":0},"rGeXpTvCVMx3xEFQORe4dg":{"text":"What a hidden gem. Great atmosphere with exceptional service.  Pineapple cilantro margarit","useful":0,"cool":0},"ktcmC_urLO4fkEIodk5-ag":{"text":"New Orleans has so much food to offer and Mais Arepas is a really good option.  Found this","useful":0,"cool":0},"s4kJNrdfyedupfmI1lilNA":{"text":"Great lunch place. The keystone to this place was the arepas. Delicious corn cakes stuffed","useful":1,"cool":1},"pxanntcwN-qz7-kEWB03lg":{"text":"I was traveling to New Orleans for a conference and everyone I met I asked for food sugges","useful":2,"cool":1},"NtaYtmEydZXa-J-iyB8nbw":{"text":"My first Colombian food experience and it was really good. Not big on plantains but the ch","useful":0,"cool":0},"ZAc23x5RZMs_dV06Bv4qdw":{"text":"Earns every bit of these 5 stars!! A small restaurant that is close to everything, but tuc","useful":0,"cool":0},"RDfuQBNw5EdeXd_so31Hsg":{"text":"I know what it means to miss New Orleans....\n\nYou probably think I'm talking about the mus","useful":2,"cool":2},"kYNNDrQCXi8GUArT-IOgwA":{"text":"First I'll start with the food. I had the chori-arepa, the Maiz de la rueda, the empanadas","useful":0,"cool":0},"Pq6DnjMPiwptAFOvoZXbhA":{"text":"Maïs Arepas has become one of our must-go-to restaurants when we visit New Orleans. The co","useful":0,"cool":0},"g5H7sKxTSAUgxicGEucvEQ":{"text":"Fantastic combination of Arepas with a hint of Cajun.  Although it might be difficult to f","useful":0,"cool":0},"0761fvm3RGDD40zLWoP4iQ":{"text":"Ridiculously delicious. I can't speak for the ambiance or service because my coworker orde","useful":0,"cool":0},"58sZ55ZBRQAs469YPBvviA":{"text":"Great Food BUT the Bartender is horrible. I ordered a mojito and he made it full of ice. I","useful":0,"cool":0},"ptGX1-IXu0vNdil3EAlWmw":{"text":"Nice change from the typical Creole and Cajun cuisine in New Orleans. Off the beaten path,","useful":0,"cool":0},"YGLInXw-vI8lxKxf-X1RfQ":{"text":"Deliciousness. If you love authentic cuisine & want to try something new or already love t","useful":1,"cool":1},"CB9JECI5JgkYKcYZjnhwRg":{"text":"This place was so good it was life changing.\n\nWe went for lunch and each got drinks, class","useful":0,"cool":0},"_pw_NXJDnD1WQXFnY5meKQ":{"text":"Delicious arepa and yuca. Such good flavor. Nice interior. Quick service. I'd go back ever","useful":0,"cool":0},"fD4XUbhgEsA25absI86Rvw":{"text":"I have not eaten much Colombian food, but this place was DELICIOUS!!!!\n\nThis is the Compan","useful":0,"cool":0},"ICtKqa0OkrAcw4lhzYOJ3A":{"text":"The most amazing meal in NOLA, this place is amazing and the food it's outstanding!!! I'm ","useful":0,"cool":0},"KLrBaM9Z5XNlZ74ChXnk1g":{"text":"I was so excited to try this place! We didn't think about it being a holiday. The host let","useful":0,"cool":0},"sUtnM0p_oLQqFs6l2fiY-g":{"text":"The food is amazing!  My friend from Columbia took us and he swears its the best South Ame","useful":1,"cool":0},"XPbaJDoJTwPK727ho5ZdvA":{"text":"An amazing gem, even in a city known for amazing food. Perfect for dates, drinks, or just ","useful":1,"cool":0},"Y9ZDjuC5WxJ0qznCD5Y3og":{"text":"Really great food. Not really large portions but enough so that I didnt leave hungy. Not c","useful":0,"cool":0},"xP6rmZJ3STOsLyspTfWauA":{"text":"Came in on a Thursday for lunch and was able to be seated right away. Great food. Had the ","useful":0,"cool":0},"olXrixt-goDT410KLENOEw":{"text":"This is a second or third review. The place is that good. \nThis time we visited on Nationa","useful":2,"cool":0},"kgVQQsVmpqMzCXxiLZGiuA":{"text":"The food is so amazing here, it almost made me cry. The best meal I've probably ever had i","useful":0,"cool":0},"_M7aT5axzYWAm7GNZnia6g":{"text":"My top restaurant broke my heart as a colombian.  This is the first time I was able to bri","useful":2,"cool":0},"--420vBcyF1gDN5_e8PdeA":{"text":"Beautiful restaurant, delicious food. We came with a large party, nine adults one child. W","useful":1,"cool":1},"_zuViZm0O2_P2URBv8GdmQ":{"text":"Let's get the cons out of the way first. Parking is not ideal with no designated parking l","useful":0,"cool":0},"Bjr0Vq4d160p-hIQsqKdcA":{"text":"The food was amazing but the service was sub par me and a few friends they were not going ","useful":2,"cool":0},"_eOPXYeKH6iRKdxYjkwxiw":{"text":"This place was amazing!!! The Arepas were delicious, this was a nice change up from the no","useful":0,"cool":0},"XBLYKrWYP_VYA1Jo1eltTQ":{"text":"Went last  night to try this fairly new restaurant and very much enjoyed the experience.  ","useful":0,"cool":0},"YI6JyisaeO8LJ7S9QKWYkw":{"text":"I've been here over 5 times and haven't written a review. Oh that's right, every time I co","useful":3,"cool":0},"FNHn8eoBA1Y_o11ROFQvqg":{"text":"So good. One arepa really puts a tight lid on hunger. Waiting patiently to get off fast to","useful":0,"cool":0},"avUuTkGg6FvvXxyr47PwHg":{"text":"Soooooo good. I ordered the Carnicera with Chimicurri and it was wonderful. Beautiful pres","useful":0,"cool":0},"pogxIY4SmeRMAlJ0t-dmSw":{"text":"Came without a reservation on a busy night but easily found a spot at the bar. Everything ","useful":0,"cool":0},"ALrXZ-TOPnOq9nXj4vletg":{"text":"So let update this again. Walk in knowing what management said when I was contacted about ","useful":1,"cool":0},"l5pNwZ9g43v6qXxD3FosTA":{"text":"This place has so much potential. The hostess was very nice and personable. After standing","useful":0,"cool":0},"l16-voF6ZYEZnR9miLyV8Q":{"text":"Absolutely awesome, Maïs Arepas is 5 star worthy for sure! A unique restaurant that is wor","useful":0,"cool":0},"eAHuDOblMEPQO-jwhBV-Vw":{"text":"My wife and I came here for lunch and shared the Ceviche. She then had the Carnicera and I","useful":0,"cool":0},"rHqtTSBQqVwyezLD4jxzXw":{"text":"Was in New Orleans for the weekend and decided to stop by this restaurant. It was probably","useful":0,"cool":0},"CPgQhXXlxaykv4M6JmxNyw":{"text":"RUIN MY VALENTINES DAY DINNER! Such a shame because I heard so many good things about this","useful":1,"cool":0},"dQhb01WYUvbz2U702Vv4yQ":{"text":"Food was AMAZING. Line was long. Make a reservation for sure! Service was wonderful. \n\nNo ","useful":0,"cool":0},"qxGdg1kABuHDkv0H27mVww":{"text":"Called ahead to see how crowded it was on a Friday night and the hostess was pretty honest","useful":0,"cool":0},"i1OCo5l42EV-glM8wB8U5A":{"text":"Such a good find!!\n\nAs someone who has never eaten South American cuisine before, I was de","useful":0,"cool":0},"U0jB7c6FgBCYnxOn21luHg":{"text":"Maïs Arepas was so amazing! Possibly the perfect lunch spot.\n\nI had actually never had an ","useful":11,"cool":5},"1Pk7UGrZxYsEoVQ6iWH11g":{"text":"Amazing Colombian food in New Orleans! I would definitely recommend the Maïs de la Rueda. ","useful":0,"cool":0},"ivUGaP4KMBChwB9r-MCsfg":{"text":"Food was  good- everything was fresh and flavorful. Their sauces are divine. However the m","useful":1,"cool":0},"GaDhMgecS5nJeDXOg56Ghg":{"text":"OMG!!! EVERYTHING IS RIDICULOUSLY GOOD!!! Ceviche, chicken, steak, chicharron, chorizo! Mo","useful":0,"cool":1},"1ZMVoRqwsUp2db3UJ75jRg":{"text":"My experience from top to bottom at Maïs Arepas was exceptional! We came in on a Sat night","useful":3,"cool":2},"hp9uh9_GC42r0msLUVClRg":{"text":"My favorite restaurant in New Orleans!! I had the fried pork belly arepa and it was the mo","useful":2,"cool":1},"vUmEuQw0iQ48a_AN41ZrfQ":{"text":"Just when my stomach was yelling at me, \"No more Gumbo! No more fried shit!\" Maïs Arepas s","useful":9,"cool":7},"yFCdUiLPKqU7P1roWdn6Uw":{"text":"This restaurant is phenomenal and may be one of the best restaurants in New Orleans. We ha","useful":0,"cool":0},"LJNn0Y7WVMm0K9jE7BSiEQ":{"text":"I can't say enough good things. Easily top five meals I've ever had. The place is lovely a","useful":0,"cool":0},"eDFovu9vo3kfhu0qGqV10g":{"text":"Really enjoyed my dinner at Maïs Arepas! The ambiance was everything. The lighted were dim","useful":0,"cool":0},"gJ3nwhWeoKoNDVEWcm_dZg":{"text":"One of my favorite restaurants in the city so it was a no brainer that I chose to go there","useful":2,"cool":2},"Q-ZezlZBadwTLICK_ecr3w":{"text":"Had an absolutely exceptional experience at Maïs Arepas! Our server was super friendly and","useful":0,"cool":1},"kzgHFHe2dUMotiUuxjgyYw":{"text":"I went here for the first time tonight and had to write a review right away!\n\nThis place i","useful":0,"cool":0},"VQCkWWr0n6zd9ZdH_5YPGQ":{"text":"NO SUBSTITUTIONS: gotta love a chef that respects authenticity!\n\nBI POLAR PRICING: I concu","useful":6,"cool":4},"sblq9xU2QBIeGVIP8iEBNA":{"text":"I lived in South America awhile back, and have been so so excited to try this place since ","useful":3,"cool":0},"-y0D8Sh7swVdL4-YjohGRg":{"text":"Very reasonably priced and good stuff.  Check their maiz appetizer - corn on the cob and a","useful":0,"cool":0},"Gtt_BGnOgGML9W2NysYyEw":{"text":"Folks, what a hidden gem ... when in NOLA, look up this place, get a reservation, and ENJO","useful":0,"cool":0},"aRzY-du-itWG4T9M-pI6xg":{"text":"In a league of its own. NOLA really doesn't have anything else like this place. The arepas","useful":0,"cool":0},"lMRyGxCWRv2_EJytwfe2RQ":{"text":"Our first visit and it won't be our last. The lady that served us was great. Very nice and","useful":0,"cool":0},"27ogWySI3pkbw23Kw7NBxQ":{"text":"This is me and my fiancé's favorite restaurant we come at least once a month for our date ","useful":0,"cool":1},"pP5bRWgYTXcNHVemHjq2Mw":{"text":"Dare I say that this is my favorite restaurant in New Orleans? Absolutely I do. I wish I c","useful":0,"cool":0},"enQh-Abxf8BRr7azaawPww":{"text":"Delicious food but had some kitchen and service issues. We went at lunch and waited an hou","useful":0,"cool":0},"bfGSA4tf3sqXR89GUVhceA":{"text":"Blown away with the amazing selection of gluten free food and how friendly and knowledgeab","useful":0,"cool":1},"IDJqHXCLvpIXhcdYuO8K0w":{"text":"Great service, great ambiance, great food.  The maiz de la rueda appetizer was delicious. ","useful":4,"cool":1},"Mcr0pWV4FLHX5nfHMTO2Qw":{"text":"Very good food, the service could use a little more training in explaining the menu to fir","useful":0,"cool":1},"lj8pBQK0M5QsyBqNN2n5mA":{"text":"Visited on Feb 18th with friends. It was our first time trying Colombian cuisine.\n\nStarted","useful":0,"cool":0},"uvHGALKnUWMH2K30KsM7Xw":{"text":"This restaurant was the unexpected crown jewel of our trip to New Orleans. I picked this s","useful":0,"cool":0},"nvc441iFxc2-SSkXPUa3FQ":{"text":"Definitely one of my go-to restaurants in NOLA. The carnicera arepa is an absolute must! W","useful":0,"cool":0},"88vPSUCjoX3Sea8nxGuQEQ":{"text":"I wouldn't call it Colombian cuisine they have a small menu, every Latin country can cook ","useful":0,"cool":0},"afUFIzk366cYuN3tot44Vg":{"text":"Although the food at this location is outstanding, the service was incredibly rude. I had ","useful":7,"cool":0},"SyQTQ0y4BdOW032IU7ZCew":{"text":"Amazing restaurant easily the best place to eat in New Orleans. The presentation was very ","useful":0,"cool":0},"ZGee9E7YXZjQW7ltSvFM2A":{"text":"I went to nola for cajun food and ended up staying next to this place. Hands down the BEST","useful":0,"cool":0},"1WgMQwhuTXXDD3vmbrC9yQ":{"text":"The skirt steak and pork belly aperas were just OK. The place looked nice and service was ","useful":0,"cool":0},"CDUHdcXPWH6-K1L1AAFKkQ":{"text":"Every dish we had was great except the civiche. The texture of the shrimp was gummy like i","useful":4,"cool":2},"Ft1bg232rVdk4mcFjbbwwQ":{"text":"I definitely need to say that the food is amazing in this place !!!  Must try passion frui","useful":0,"cool":0},"MXiWwGl21UnMVLCEqaKhxg":{"text":"Margaritas and Empanadas Caleñas to start. The empanadas were crispy, bursting with flavor","useful":0,"cool":0},"G4hN2L8RyuqnLiTP_vDu3A":{"text":"Amazingly delicious! Very small cafe in Central City that's tucked away.  The hand sized a","useful":1,"cool":0},"hpoD_7G_5ez9WEYDEJEAmg":{"text":"Love this place they have good food but I realized I'm\nJust not into the arepas thing! Dri","useful":0,"cool":0},"wC1n-2SC52t5q3Rl4ufjTw":{"text":"Always have a great experience here. All the Arepas are great. Drinks are great too. The Y","useful":0,"cool":0},"C1U06WfiHLRe3wz-EQmvCQ":{"text":"The food was incredible! I enjoyed every bite of everything we ordered. We began with the ","useful":0,"cool":0},"AVkTIhXPXgawDh5dF0zcyg":{"text":"(Trying new restaurants) My nephew found this place and by the end of our meal, I was in a","useful":0,"cool":1},"zKmJh-oixAIVkAcFIrxcxg":{"text":"Good people, good food! I also like their cocktails. If you have never been here, then you","useful":0,"cool":1},"ZaOe1AMJcUvFhEvHa4tJTA":{"text":"I am a cajun guy who loves a good chain restaurant such as an El Paso. I don't really stra","useful":0,"cool":0},"NObJvV9e1AsHr-rOos5gNA":{"text":"I ate here a few weeks ago and am just now reviewing. To be honest, I kinda forgot how eve","useful":0,"cool":0},"MkWXKWngQn5hC7ISFWHvuA":{"text":"Love is all I can say. Service fab, food is out of this world!!!! Call for a res if you ca","useful":0,"cool":0},"KfSGe7UtHRAQC8LqCOtGHQ":{"text":"I could eat here EVERYDAY! Food, Service, Ambience, and did I mention the food...all frick","useful":1,"cool":0},"0870mRStmLAyOOX0zPJmfA":{"text":"This by far must be one of the most flavorful meals I've eaten in New Orleans. Colombians ","useful":0,"cool":1},"4pHeCRXgbdovsECSX_OePg":{"text":"Everything we had here was truly exceptional and the service was outstanding. The arepas a","useful":1,"cool":2},"ZQx9bxaavoNyieBjqt3DDA":{"text":"It was number two on yelp. Honestly food is amazing, drinks not so  much. For what we spen","useful":0,"cool":0},"rP7vYe21svAXMMlP2dvkww":{"text":"I went to this restaurant uptown for the first time. I was looking for something new and d","useful":0,"cool":0},"pXdIXTdThFJRrgicIxLioQ":{"text":"I think this is a perfect date night spot. My husband and I came in here without a reserva","useful":1,"cool":1},"koMU_rwyEiQxq3MoR32AXA":{"text":"Came here for a birthday dinner reservation. We picked this place out because the birthday","useful":0,"cool":0},"8tYxZjSSruuyxMI9lluyEA":{"text":"First I'll start with the food. I had the chori-arepa, the Maiz de la rueda, the empanadas","useful":0,"cool":0},"PjBFiZqno8s-9ujG_AMgVw":{"text":"I was craving Latin food and this restaurant came on the top of my list. Waiting time was ","useful":2,"cool":2},"d34yjY2tkJK0KjQ6Wuyx-w":{"text":"Delicious arepas and wonderful service!! However, desserts (we had the passion fruit chees","useful":0,"cool":0},"7-u9jdvfL5Gp2B8dk38Unw":{"text":"The corn omg the corn...I've had this all over the states (and Nola) and this is where it'","useful":1,"cool":1},"0NT_UQbrbUkyt-F4KSHTvg":{"text":"Possibly the best meal I've ever had in New Orleans. I'm not sure if my experience was uni","useful":1,"cool":1},"Ftl3sZohJp4vFLSf8EPiPQ":{"text":"I love this place so much!!! \n\nAll the arepas I've had here are incredible. Seriously, you","useful":0,"cool":1},"niZFzhJaCk_CZvfyGlaB7A":{"text":"We came on a Sunday afternoon (table of 4) without reservation, and luckily we were able t","useful":0,"cool":0},"qCQvhKQNXv3OlYbytIghtA":{"text":"It's been almost two years since my initial review, and I definitely want to add a star! A","useful":24,"cool":13},"JqQ1Xn32l9hFMxG8we1L5g":{"text":"Good food, great service. Portions are small and $12 for an arepa is insane. My Colombian ","useful":5,"cool":2},"qOJW5kmAIHqvtbMv8mOmTQ":{"text":"I've never had Colombian food and didn't know what to expect going in. While I'm not disap","useful":0,"cool":0},"OUajc3UNCK_5XK-qlKNDCw":{"text":"It's okay. The restaurant is very cute and trendy. However the food is very skimpy and exp","useful":0,"cool":0},"VI_gQYnPnlyEHsM7OQJMVQ":{"text":"I went to New Orleans for a week and was expecting to be impressed by the local cuisine. I","useful":1,"cool":1},"EQG4s0ZJvvDODjLJlirpuw":{"text":"We got a large order of takeout from Maïs Arepas for an event, and they met all our expect","useful":0,"cool":0},"IXFL0YOO1hVUeDq5llYw8w":{"text":"Everything was delicious and service was excellent! Can't wait to come back to eat here ag","useful":0,"cool":0},"dl9A95JV2dxcDgYVSP8lOQ":{"text":"First time we went there to eat the food was good. Went back for second time, not so good.","useful":1,"cool":0},"pn7f3uAerLN_9qtajuAqzQ":{"text":"Delish! Get the pineapple cilantro margarita, very different combinations of flavors but i","useful":0,"cool":0},"3WFzXOljlGQy_1y6qa_1Gw":{"text":"Great food!! Flavor combinations that I am not familiar with but absolutely delicious. Try","useful":0,"cool":1},"WCG_rpVtoepxUxNrxNgQgg":{"text":"Excellent food, almost everything is gluten free. The drinks were also very good with fres","useful":0,"cool":0},"ckhVcmPv-h0wTob5Zis19Q":{"text":"So delicious. Love the arepas and cocktails. The plantains are so good. And gluten-free fr","useful":0,"cool":0},"_9K-wjvvRPK7m7YVmLv8DQ":{"text":"The food at this restaurant was authentic and amazing. I'm glad we found this Colombian sp","useful":0,"cool":0},"j8_kOpWZBVip8XSnSUcF_Q":{"text":"First time patron of this Columbian restaurant and it was so good! \nIt's a small restauran","useful":1,"cool":1},"-XTEm7F_50jO2RrA2GLlQA":{"text":"This place was great!  I had both an appetizer and an arepa thinking that the arepas would","useful":1,"cool":0},"XlANyelAgRpq6ExUeubgrw":{"text":"Yum ! I love it here. I've tried almost all the arepas and have liked them all ! I've gott","useful":1,"cool":0},"wH9fvU_phNZbgzwkA99k0g":{"text":"AMAZING. This is an experience for your taste buds. Contrasting flavors leaving you wantin","useful":0,"cool":0},"fd4sP9vj68zIm0876Xo4TQ":{"text":"We sat at the far left end of the bar. This allowed for quick service, a peek into the bus","useful":0,"cool":1},"SW8rnSlANlB4a4EJt20MJg":{"text":"Best restaurant in New Orleans! Best food, best drinks, best service and best atmosphere! ","useful":0,"cool":0},"NFcTmyrx6IzL1zJ_9UhKqw":{"text":"We had a nice experience here. The wait staff was attentive and friendly. We ordered a spe","useful":0,"cool":0},"_NmYs87bSejwcK6ceN7p_g":{"text":"I would highly recommend this restaurant to anyone!!! The food and service is amazing!!! I","useful":0,"cool":0},"4fgvn5HOTYkbP5FlOVfq8g":{"text":"I went yesterday with a couple of coworkers and the food was very good. I must say that I ","useful":0,"cool":1},"9uRx5gC1Ixpy-iQaO9Oh-A":{"text":"My first visit I was looking over the menu and trying to figure out what I could order tha","useful":4,"cool":2},"nne-KfjgnDzYa_2a1dLZGg":{"text":"Hidden gem in the inner city. Great Latin American style food. I had a Carnicera. Beef ove","useful":0,"cool":0},"E1zkxy2o5Ihbc6swt5iXhw":{"text":"They don't have a way to make reservations on line. Not on Open Table or Resy. So I picked","useful":0,"cool":0},"1NULanLaocx-atQE2-bJpA":{"text":"Just had one of the best meals I have had in a long time! This place is great, the service","useful":0,"cool":0},"nCmuCoWzReknA6HsQb1ksg":{"text":"We always enjoy our visits to Mais Arapas! Such delicious food. We like to start our meal ","useful":0,"cool":0},"YPxyudxTe7-2bUdLswZFOA":{"text":"The atmosphere is really nice. It's a small place, so don't plan to go with a big group. W","useful":0,"cool":0},"b8QVnMIs6g4P8xsADjqnhQ":{"text":"It's a Colombian restaurant with Venezuelan arepas....I love it. Great food great music gr","useful":0,"cool":0},"bKNd2lFGoAxiiORRWp6ztQ":{"text":"Just had lunch here. I was very excited about trying this place, as I love arepas. The foo","useful":3,"cool":0},"3iEPe1G_Ww5qXxUF4_DhTQ":{"text":"The food here is amazing. It is a real treat to have authentic Colombian food in New Orlea","useful":0,"cool":0},"tk-lyXz2R95er-REJItR3g":{"text":"On a Tuesday night we had a reservation for 9 for a friend's birthday. The place was empty","useful":3,"cool":1},"sUOKIAVYfDJFlGqnkf7ouw":{"text":"Eventually, an alright friend and I enjoyed dinner at the bar. The hostess did not want to","useful":0,"cool":0},"eelMI-7kFqZBb3RN4AIC1g":{"text":"Incredible cuisine. Lives up to very high expectation. I am currently in a food coma from ","useful":2,"cool":0},"DBO8PmzYT0HKizIz7Bg0ag":{"text":"This place is AMAZING! The food is flavorful, fresh and oh so delicious. My son wants to g","useful":3,"cool":1},"R3dAMFwFnvKCtB3K1T3Glw":{"text":"Corn was great. Somewhat spicy, full of flavor. Definitely the highlight of the meal\n\nThe ","useful":2,"cool":1},"NU9GWrgsZBgZoLLPCo4IrA":{"text":"I have never dealt with more rude employees at a restaurant in my entire life.  And the ma","useful":1,"cool":0},"G1lNL-lFHJzTW7-CqXX8mQ":{"text":"We sat at the bar. The staff was very friendly and helpful. The food was exquisite. Defini","useful":0,"cool":0},"DeNfb3Xt_ORFk4DmfX-hqQ":{"text":"La mejor comida colombiana en nueva orleans muy recomendado bebidas exquisitas y buen serv","useful":0,"cool":0},"HQ2NRcAt88StHRyq9yfvOQ":{"text":"My god this place is so good  We had  the shrimp arepa and it's was delectable.. the elote","useful":0,"cool":0},"cIGTOx-M6VLkEPY8Qe69ng":{"text":"We're Colombians visiting this amazing city and decided to try this place. I can say with ","useful":0,"cool":1},"nvtMpHlCCQjPptmUPZixDg":{"text":"Holy cow, as with most other reviews, I was not expecting my favorite meal in Nola to be C","useful":1,"cool":1},"_R_tEYPpKEbghjvL7AJC8A":{"text":"Take out food review\nVisited early Dec 2018, got the \n1. Maiz De La Rueda - insanely good\n","useful":1,"cool":1},"LvOxIjaj905xnmQLAmZBkA":{"text":"Excellent service and excellent food. It was our first time here and were very impressed w","useful":0,"cool":1},"FtBJMUhRmIw_916C6IqSNw":{"text":"Sangria is fresh and some of the best in the city.  Did is always fresh and delicious.   E","useful":0,"cool":0},"8KVhC2wxdcRVSaGSxi1qTg":{"text":"I'd never had Columbian but love Latin foods. The food was good and the service was excell","useful":0,"cool":0},"p9duELmtr8ieFj4DixaJdQ":{"text":"This is my favorite restaurant in the city period! The drinks are great and the arepas are","useful":0,"cool":0},"S1THOfjyGhGflHq5LSP4Bw":{"text":"Come in for an excellent semi-casual dining experience with a mouth pleasing mix of Colomb","useful":2,"cool":2},"0mjUZdJxQxJcmA4pbKjsvA":{"text":"I've been in NOLA for over a week and this was the best restaurant I've eaten at. Food was","useful":0,"cool":0},"yPAZ7fLPzlwPw4su5XXr_A":{"text":"Absolutely Amazing!  This is one of the best restaurants I have eaten at!!  The arepas are","useful":1,"cool":1},"wQVV4wRp5TEMeup_t2ssLQ":{"text":"We went here last night for dinner and our overall experience was good. I do think for wha","useful":1,"cool":1},"QwpEDhKHHSZ0g_mKBZOqUQ":{"text":"This is one of my favorite restaurants to go to in the city!!! From their drinks, food, en","useful":1,"cool":0},"Shmjcl7jLi1iuv3cDTuVog":{"text":"This is a small restaurant which has a fairly large waiting area with seating. You should ","useful":0,"cool":0},"-S7eIiBbkBk1eCxoVy6oLg":{"text":"Go for the elotes and stay for the pineapple margarita!\n\nDelicious and not a bad price eit","useful":0,"cool":1},"N-eoQrRZJk0lsD-l82RX1g":{"text":"Excellent all around. There was a slight language barrier with our server, but she was so ","useful":0,"cool":0},"g13ExrP9Vgb3M5CpNIahXw":{"text":"Little weeknight date night with my hubs at this cute little place! I'd been once before a","useful":1,"cool":1},"7lAjE6WAWEiJJiOdx3ABSQ":{"text":"This restaurant is one the best restaurants that we have in the city for Colombia food. It","useful":0,"cool":0},"nLdzxrYMvmnqarIE4jb-pg":{"text":"Forever one of my favorite restaurants in New Orleans. I literally dream about their arepa","useful":1,"cool":1},"ZWOl-laXkjBzLJfKzMr-JQ":{"text":"Bad service, Don't recommend for first timers! Poor service when you walk in. Mostly local","useful":0,"cool":0},"QMr5Vk9LvFUOLQXYZaEicg":{"text":"This place was delicious! Super friendly staff, authentic menu, phenomenal execution. \n\n5 ","useful":0,"cool":0},"XKZ7S6UKohT_RKaZyRdE-w":{"text":"Maïs Arepas is amazing. It's comfy, clean and attractive. Maïs Arepas has a terrific Plant","useful":1,"cool":0},"n2QLLQW6YDjcYrC-bRc0QA":{"text":"Wonderful food and atmosphere!  Went here with my family during a trip to New Orleans, I p","useful":0,"cool":0},"wO2w6eb2AYKd7TZJLFe-zA":{"text":"Met several friends for dinner Friday night.  Make reservations because this place is very","useful":0,"cool":0},"eaEqgF4C3HQ9F0S52gFHDg":{"text":"It's hard to describe WHY this place is so great because we tried so many of their dishes,","useful":0,"cool":1},"SaGCRXYI1bsA8wrGOzyEeg":{"text":"The BEST corn ever!! Get the corn to start and the arepas sampler as your meal. The sample","useful":0,"cool":0},"b55MDOSHVUjrLA-DbXrmJQ":{"text":"Even though we were one of the first groups to arrive at the 6pm opening, we were made to ","useful":2,"cool":0},"z1t5uKXoX_K_yT93a1e-bg":{"text":"Hey this is such a great spot. The only reason I didn't give a 5 is that I was not jazzed ","useful":0,"cool":0},"y2n4FokzFQxe0fesYNXvcw":{"text":"The chicharepa was delicious! Fried pork belly with greens, lime, aji, and avocado puree. ","useful":0,"cool":0},"Z16nLWLmCBBMZs6M8R_d9A":{"text":"The corn appetizer is amazing. Everything we ordered was extremely flavorful and delicious","useful":0,"cool":0},"vpXAeH3QqTKfJesGLFe2mQ":{"text":"AMAZING! Get the corn! The food and drinks were both really good. It's such an amazing ble","useful":2,"cool":0},"TwpjMA-BuBC-kPMI0ET_kQ":{"text":"Arepas are one of my favorite things, and this place did not disappoint!   \n\nWe started wi","useful":10,"cool":10},"iMiuNapj3nIUYyYfpS1RWg":{"text":"I eat at this place almost every 2 weeks. The food is awesome and service is excellent. Th","useful":0,"cool":0},"e1aXdLiuODkv-lPD9F2b2A":{"text":"Loved this place! Went late so not crazy busy. Great place for celiacs who need gluten fre","useful":0,"cool":0},"OJEmDLia5F2l8J6njID5aA":{"text":"Everything here was excellent. I had a mojito and a reina (chicken) arepa and sampled the ","useful":0,"cool":0},"74-7Kp7VYmQ_V7hQPS6k1w":{"text":"The BEST elotè (grilled corn) I have ever had. Along with great tasting arepas and the spe","useful":0,"cool":0},"eIz2moZ0XXM5JLATIQM1sw":{"text":"You should be eating here on a regular basis. If you haven't been here, you only need to a","useful":5,"cool":2},"gj2lltHGPvMTRKjxEcLtmQ":{"text":"Food is sooo good!! Didn't think we'd come to NOLA and find such authentic Columbian food!","useful":0,"cool":1},"2X-xjMRJHMYUv6UZFK0P1A":{"text":"Amazing experience at Mais Arepas.  First time trying arepas after hearing so much about i","useful":1,"cool":2},"YQdo89NNY2tctu18zKEMTw":{"text":"One of my favorites.  Thought I knew about Latin American food; discovered I knew nothing ","useful":0,"cool":1},"xSn1kJ2IObsJxN37yZ96Uw":{"text":"The street corn was so flavorful!  The Cerda arepas was delicious and so filling. I could ","useful":0,"cool":0},"0XTLsk3BxV2j0fY6W77QHQ":{"text":"This place was excellente y muy muy authentica!!!! Cannot wait to go back. So much flavor ","useful":0,"cool":0},"I4xL7syiep9CQ6fbUGHGEg":{"text":"Do NOT go on weekend nights!  Waited as per hostess instructions for a seat at the bar onl","useful":0,"cool":0},"RyK59kbD0wQ98F2JLU0gMw":{"text":"Of the 5 or 6 times I've been to Mais Arepas not a single one wasn't a great experience.  ","useful":1,"cool":1},"pDvrv8omNBx2t7P-9zPu9g":{"text":"Sooooooo good. Do not leave this place without trying the pineapple cilantro margarita and","useful":0,"cool":0},"m8h9Ld29j9RVmJANktY1sQ":{"text":"i LOVE this place!\nevery time i come, everything is great. i recommend getting the corn ap","useful":0,"cool":0},"0rcXbqmVdt4I9mC7jJoiaw":{"text":"Mais arepas is a small local place owned by two amazing guys that love what they are doing","useful":0,"cool":0},"pLZC5yf4Xk-P2-T7EmuMYg":{"text":"The service was awful. We arrived at 8:30 on a Friday night and it took 2 hours before our","useful":1,"cool":0},"EClif_u9pwSOmos8kE5S1Q":{"text":"Went to Mais Arepas three years ago for my 21st birthday. Traffic lights were out that eve","useful":7,"cool":1},"m_dIiq6TFoWhVnkHP7fUDw":{"text":"Wow, where to start.\n\nWe were struggling to find a good quality place and stumbled across ","useful":1,"cool":1},"uW-f0DvX5CtQqiYjIaxO-Q":{"text":"This place was amazing!  We were not sure what to expect when we got there.  We read on a ","useful":0,"cool":0},"bOQ-MMa_RXJVgeqko3yW2A":{"text":"I usually like this place. The food is good and the people are great. Unfortunately, after","useful":0,"cool":0},"_dO_JlFOf9AMUnwM3Q45oQ":{"text":"When traveling with Colombians you do as the Colombians do and that is seek out Colombian ","useful":0,"cool":0},"YkDuqSMneiLKmO-k7w5U9g":{"text":"We went again on a Friday night for dinner and I was impressed with the consistently good ","useful":1,"cool":0},"FKLZsXHBfrkeR9qba8lE3w":{"text":"They have the best Sangria in the city! The restaurant is small but the food, drinks and s","useful":0,"cool":0},"hxDacAof0Bi5rygVUK78CA":{"text":"Stumbled upon this on Instagram and happy to say the photos and descriptions didn't disapp","useful":0,"cool":0},"V-iw3Q5olWFi0xAOKhlWOQ":{"text":"Awesome vibe I am\nColombian myself and the food it's 100 percent authentic. It was hard fi","useful":1,"cool":1},"a7awB58VohjJOnU9xibeyQ":{"text":"We loved Maïs Arepas! There were 8 of us and they were wonderful and accommodating about t","useful":0,"cool":0},"qu5UehwqWF0AxNMRcQ7KzQ":{"text":"Do not comer here if you dont have a reservation. When I called they said they usually kee","useful":0,"cool":0},"Xqt2aYwCysmZgBf_ktovlw":{"text":"The arepas are so good that I came for dinner twice during my 2 week stay in NOLA. Persona","useful":0,"cool":0},"gqap0i7HCKxliDngCpew5Q":{"text":"Only was able to get take out so can't comment on the dining experience but the food was g","useful":0,"cool":0},"ObyA9nkH8MYecsD64EOGDw":{"text":"My girlfriend and I went here for her birthday. The entire experience was great. Great foo","useful":0,"cool":0},"QeYrUEHB0NnFHMlix8XVyw":{"text":"Y'all. This place was PHENOMENAL. I had the red sangria to start, and there was a hint of ","useful":0,"cool":0},"dAhNkwDnVdSz40RKeMq0bw":{"text":"The food was amazing!! And our server Lou (sp) was very friendly and efficient. Just a nic","useful":0,"cool":0},"u-kJ5cdksOnP_WndN3YkyQ":{"text":"Love coming here! Especially when I'm missing home and need a pick me up. \n\nMaïs Arepas ha","useful":1,"cool":1},"Fh4b7T4P3PjE1gkBWEbmMw":{"text":"After a VERY rough day walking around the French quarters, I came back to my\nHotel and rea","useful":0,"cool":0},"tgVa24Ww4ni7dTkgPYUoXg":{"text":"Beautifully done colorful spot in the lovely LGD. A large variety of scrumptious arepas, s","useful":0,"cool":0},"1bqCkfjSgUkpmpq1GMShPQ":{"text":"This place is phenomenal. I come from a Colombian background and I love the way the Chef g","useful":0,"cool":0},"Fr97TIhBQdonx4qPEbWg4Q":{"text":"Very excited to try arepas for the first time. Staff was helpful. Restaurant is nicely dec","useful":0,"cool":0},"67O4syXOkRVZD0LIXN-7Vg":{"text":"Everything was so delicious from appetizer to entree! The fried green tomatoes were crispy","useful":0,"cool":0},"xzoEDW6hLQGNAx8a4AqCZw":{"text":"If you want authentic colombian food this is the place to go. The food is amazing, the sea","useful":0,"cool":0},"6CtCIDf_SCjK5AZhAZOBrg":{"text":"Let me start off by saying Mais Arepas is adorable. I'm happy to see growth in this area o","useful":9,"cool":3},"1M81rExep1FHpwSGONB0eA":{"text":"Mais arepas is a great Latin American restaurant in New Orleans! I've loved the arepas I'v","useful":2,"cool":0},"tcujUDvooAOmDPg7OrJxJw":{"text":"We tried to visit mais arepas for a long time but every time we visited New Orleans there ","useful":0,"cool":0},"REr4JknWSzF3F00cuO3djw":{"text":"I found this place last August accidentally.  My mom and I were walking down St. Charles l","useful":1,"cool":1},"xqB8Xq3lLZ0UhEULEKePaw":{"text":"Great find! The Arepas were amazing, especially the pork. The empanadas were terrific as w","useful":0,"cool":1},"ZyzGrJXaa3iAHXzZ7PxrUg":{"text":"One of the best dinners you can have in NOLA. Honestly I don't know where else you'd even ","useful":11,"cool":5},"WpieL5QpckJhLyQuvqQBSQ":{"text":"Busy - Wait time 30 mins at 7 pm on Sunday. Better make a reservation\nAmbience - Great cro","useful":0,"cool":0},"M2E8Hlo_EcCOYI8TA0CAeA":{"text":"I'm obsessed with this place except... The staff just oozes stress and annoyance. Food is ","useful":0,"cool":0},"a0Sj9_JOqLvZLeoVPZaLrw":{"text":"Amazing food, amazing drinks, and amazing service!  What more can you ask for?!?  Drinks a","useful":0,"cool":0},"IvwG6qBClx7dlyO5I41VqQ":{"text":"Drinks are great, slow to make but its because they are made from real fruit. Margarita ci","useful":0,"cool":0},"Vbq0XHln24wUue8iNaVE6g":{"text":"It was a blue moon, the stars were aligned just right, and it was probably the luckiest da","useful":2,"cool":2},"aiM9V6uzOAzZ89lJNFI13g":{"text":"One of my favorite Latin restaurants in the city of New Orleans. Great drinks and good foo","useful":0,"cool":0},"f5bae_TSRXOe9Mu5T-rYCg":{"text":"Best meal I have had in New Orleans by far!!!! Wish I had the chance to go back there seco","useful":0,"cool":0},"B8b0_QHwCaMi-m8Kw7Fr3w":{"text":"A patron of Mais Arepas here. If you are fond of Latin American cuisine in general, I beli","useful":2,"cool":2},"FnV0QKR_k6Uaw-v2izJBlw":{"text":"Excellent fresh food!!! I loved the atmosphere, very nice service and prices! Best restaur","useful":0,"cool":0},"4K_o6LreAGkrxrxZY3SHdg":{"text":"Go in at 8:30 PM to make a to go order for\nMaiz De La Rueda which is grilled corn. They te","useful":2,"cool":1},"Enq76oYzEVR7C8wWPye36Q":{"text":"Whoa! What I thought was going to be a quick, informal meal turned into one of the best di","useful":1,"cool":1},"CbiiRaD-WVBdaaOR1m9YKw":{"text":"We went on a Saturday and it wasn't too busy, we got seated right away, but the service wa","useful":1,"cool":0},"gV1z2h6F3LoIHOFezyC2JQ":{"text":"The corn elotes were a must. Phenomenal cocktails- get the passion fruit caipirinha , arep","useful":0,"cool":0},"3QG0wFHyHaQdy2cK8V0QoQ":{"text":"This is one of my absolute favorite places to eat in the city. They offer authentic arepas","useful":0,"cool":1},"3UCVQlFuycUD4D5n_cyniA":{"text":"Fantastic! A hidden gem in New Orleans. We tried everything and wished we had another pair","useful":0,"cool":0},"wG98n0kbBfiyhbO7PfP_mQ":{"text":"Seriously good, attentive staff, great atmosphere, food was authentic and delicous, I had ","useful":1,"cool":1},"Zx4oBY6JgAHJRpikSoG7yA":{"text":"Been wanting to try Maïs Arepas for over a year now, and it was well worth the wait! I wou","useful":7,"cool":5},"pEGikSsaKxUSqbtJR3lNjg":{"text":"Ok news alert people. If you have not tried this Columbian restaurant you need to ASAP. Th","useful":0,"cool":1},"iiYsEeqWgqj7TmS438TykQ":{"text":"I was so excited to come here. I'm Colombian and love to try Colombian food if it's availa","useful":1,"cool":0},"8aU2Ii4OOFYMIrVqxfJ8lg":{"text":"Wow!  I really enjoyed this place! Maybe it was because of the company I had with me or th","useful":4,"cool":4},"gmvsyCqNQZvGFcrJXaHOVQ":{"text":"This place was awesome! We got fried plantains as an appetizer and they were great. The sa","useful":1,"cool":0},"_daEoO9OPcubslFiuArJNw":{"text":"Good food however zero flexibility when it comes to reservations. We had a party of 10, an","useful":1,"cool":0},"-eVIPfGVDBTRrDHYdVYoww":{"text":"Went here on a first date type of thing. They were moderately full but we were still seate","useful":1,"cool":2},"Q-eVp0dpkmIhJGytovbycA":{"text":"If Mais Arepas utilized a food delivery service, I WOULD BE SCREWED. Do you know how often","useful":17,"cool":16},"GZG_UM8Tw3BSRjXWo2ufQg":{"text":"Maïs serves absolutely fantastic food. Their service is also really great too. We only tri","useful":1,"cool":1},"Q-UG7hanLp080r1QYkM8uQ":{"text":"After eating a bunch of seafood and chicken in NOLA we needed to cleanse our taste buds a ","useful":2,"cool":1},"dXP0HcC-ZxWRirXUcKPwGA":{"text":"I don't know what has taken me so long to write a review about this place because I've bee","useful":8,"cool":6},"U24SHCouJEC4JdCz1NMOmA":{"text":"The food was superb and the drinks were excellent. Fantastic staff and the owner came to t","useful":0,"cool":0},"BWh8jnawYv4MmpT7whcDKg":{"text":"I rated this restaurant the way I did primarily because of the service.\nThe food was delic","useful":0,"cool":0},"FJi12uTO1Q-X8eivYeMP0Q":{"text":"I recommend making a reservation in advance. I was not able to walk in and be seated. So I","useful":1,"cool":0},"v2tIJVASTQhrlGGWdDzyRg":{"text":"The food and service here were incredible! We showed up without a reservation and were tol","useful":0,"cool":1},"Zib-WXWPXWXsgimcNkkcMQ":{"text":"When I think of New Orleans food, I definitely dont think of Columbian, however I am so gl","useful":1,"cool":1},"QXkf5ytr7W6fMN-si1tTXw":{"text":"This is my fav Nola meal - I go here weekly for takeout, however took some friends for din","useful":0,"cool":0},"Gfc5kltHn0jK76N3p0rLpg":{"text":"Wow. I can't say enough about this place. It will definitely be on my short list when I co","useful":0,"cool":1},"s_6xpgpCcFaUKI3gYeHUyg":{"text":"Wow-incredible, incredible food. I spent 6 days in New Orleans checking out \"top-rated\" re","useful":2,"cool":2},"qb5RS1VE-pX5BjanIKbkhA":{"text":"I always have an amazing culinary experience here. Always make reservations because the re","useful":0,"cool":0},"jQJBvMgAFZqi9q1funirlA":{"text":"First time visit!  Came because everyone said it's a must.  We were not disappointed, the ","useful":0,"cool":0},"HTqVfltUIvKqpL1rXqjS7g":{"text":"This is an awesome place for everyone to come and enjoy.  You will not be disappointed wit","useful":0,"cool":0},"bxKqrFIQIFt60rSLxoHsWA":{"text":"I had a great experience at Mais Arepas from the friendly staff, happy to give incredible ","useful":2,"cool":2},"ItEc2nupVNl8QhOairYMNQ":{"text":"This place is wonderful the food is great the drinks are very good all the drinks here are","useful":20,"cool":13},"XSDiwsvg_68X6cGD32XUuA":{"text":"Mais Arepas is an excellent Colombian restaurant! I went on a Saturday night and I would h","useful":1,"cool":1},"mZy8Iq13PHL_sgdeENz9ew":{"text":"Tried Mais Arepas and was pleasantly surprised by how good the food was. Some in our circl","useful":2,"cool":0},"D3SD64P-iC1Nb0pW0aUC1A":{"text":"Great things come together with good food and great service! We tried to go here earlier w","useful":3,"cool":0},"s-RyOsmIScQatmnoSenNjA":{"text":"I don't think they need the business but this might be the best place in nola for fresh, a","useful":0,"cool":0},"suDb2I1UKr05YqiOWkSliA":{"text":"Don't go for the service. Go for the food!\n\nThe highlight of our visit was the ceviche, ar","useful":0,"cool":1},"2nLCkCy1VJsBOjRSPPM8Kw":{"text":"We always enjoy our visits to Mais Arapas! Such delicious food. We like to start our meal ","useful":2,"cool":1},"eXLf9-1f9uApptOJYeByew":{"text":"SO GOOD!!!!! Usually with arepas people focus on the fillings but here the arepas themselv","useful":1,"cool":0},"UF_rrF7ix9N9dD-521k1Uw":{"text":"Food was absolutely AMAZING. We started with cerviche which was fresh and tasty, and not l","useful":0,"cool":0},"3ZSjmSO3ZTesD1ItQ9kTIw":{"text":"SO SO SO GOOD!!!! It's about a mile away from downtown but worth it whether you're walking","useful":1,"cool":1},"lgfW-bSdN7HOjxu25AfC5Q":{"text":"I've only been here twice but I will definitely keep coming back! This is a gem of a resta","useful":1,"cool":2},"KnwBSOGgHMi9ZDwiu2P6sg":{"text":"Incredible take on the traditional yucca frita. I love em, coming back for more. The Chori","useful":0,"cool":0},"qNAtEtr2YbdzC1YbGbik3Q":{"text":"This is one of my favorite restaurants in all of New Orleans. Such a unique blend as Colum","useful":1,"cool":4},"sFrLtXrvn5rjYFIyWTNZmg":{"text":"I'm usually pretty skeptical when I hear about a place that everyone  hyped about but Maïs","useful":0,"cool":0},"rkUy8QqgYP6IDNeS0szPZg":{"text":"Here from nyc for work and first order of business was exploring food!  This place was rec","useful":1,"cool":0},"o-wNlsEG0K1deNTOypK7Rg":{"text":"Outstanding Colombian cuisine. Small place with lots of class and gusto.  Service was good","useful":1,"cool":1},"CVVFb7LXOZfOPLRdbdug7g":{"text":"The food, atmosphere, and service here is excellent! We tried a lot of menu items, and non","useful":5,"cool":7},"8uZ5SlsPKwK1okHvjqnqzQ":{"text":"5 stars is not enough, I'm not kidding. We got off the plane and went straight there with ","useful":0,"cool":0},"W9To9Nn20YxVw73hmhBNIA":{"text":"I initially was very impressed with Maïs Arepas. The host was very kind and apologetic whe","useful":0,"cool":0},"pM8neAI8BJ0WIEMfRwgxag":{"text":"I literally came here just for the corn on the cob and it exceeded my expectations. I foun","useful":1,"cool":1},"9y_ofAfmCVtFG3GtMkg5sQ":{"text":"When I visit my sister this is a mandatory stop. Absolutely have to eat the corn! My arepa","useful":0,"cool":0},"8-Tw0RXIGdvr6FX5T6Ah7Q":{"text":"Omg everything I had here was amazing !!! Some stuff I ate so quick I forgot to take a pic","useful":0,"cool":0},"fALzMV2asZ0LtowtnOlOQA":{"text":"This place is so good. I dream about the street corn at night. I could just have three ord","useful":1,"cool":0},"48hP4tgfS1p85-RWf4UWdw":{"text":"Loved this place. Small but nice atmosphere, good food and great fresh cocktails. Watermel","useful":0,"cool":0},"0qA5y-KBmWOSvOzImu4bww":{"text":"came right at closing and they were super nice and accommodating about it. arepa was good ","useful":0,"cool":0},"rYADV4lhoBYjpsT69YNbcw":{"text":"I LOVE EVERYTHING ABOUT MAÏS AREPAS & THEIR COLOMBIAN EATS. The food, the service, the coc","useful":0,"cool":2},"nYllsyD0FnOva_Ke1pVdIQ":{"text":"Amazing!!! Amazing!!! Amazing!!! Every dish I tried is to die for.  Their street corn was ","useful":0,"cool":0},"mnx9b_w2uxVYmO4KqIcGjw":{"text":"Why 4 stars? Because these were the fanciest arepas ever!\n\n   ---   ---   ---\n\nPrior to my","useful":6,"cool":3},"aUI5HZYfdFsicL1y9lPACQ":{"text":"Run don't want to this place! What a gorgeous establishment. The service was top notch, th","useful":1,"cool":0},"i7fbjL0cL58Yd3zECfqApQ":{"text":"Listen, this is hands down my favorite restaurant. Consistent as heck, the food is spectac","useful":0,"cool":0},"CVsJCfSYdLTVNxcNw8Ae-A":{"text":"My all time favorite restaurant in New Orleans. Hands down. The sangria is beyond this wor","useful":0,"cool":0},"T9Kvz9uVUpG8rQtOXSZRwQ":{"text":"Don't let it being in a weird location fool you, this place is greatness. Went for a girls","useful":2,"cool":0},"6VuXMkHZBntEOssowyOTJA":{"text":"This place is incredible. Best Arepas I've ever had. It's not cheap but the portions are g","useful":0,"cool":0},"LPWueswa-HzwgjKk7Ru1YQ":{"text":"Went to Mais arepas last night with a party of five. Dropped people off at the entrance an","useful":0,"cool":0},"jQte1MCb5pIUhx8zAnmP2A":{"text":"My absolute favorite Colombian restaurant. New Orleans is known for it's creole cuisine bu","useful":16,"cool":10},"xk8j0GPTbaT_LnUz-F6k2A":{"text":"Was my first time going here I went to the Colombian Mia restaurant and that place is pret","useful":0,"cool":0},"HeofE1UQlQy0Bm7IdLGTsw":{"text":"A-MAIZ-ING.  I could have eaten them all and licked the plate. The sauce... mouthwatering.","useful":0,"cool":1},"vJdwTZ97jRcK0vw3UtuEKQ":{"text":"This was great.  Became a huge fan of Colombian food on two trips there a few years ago.  ","useful":1,"cool":1},"bm4CgAOI5SgpXWvza2O-tQ":{"text":"I grew up eating Colombian food in New York and this little gem stands alone. David (chef ","useful":1,"cool":0},"0tSH3Yp_tJaFVzuhwPYyRQ":{"text":"First time having Arepas. They were so good. I'll be eating Arepas more often. The staff w","useful":0,"cool":0},"AOd7Q9ikRVXmsOYSDJoG6A":{"text":"FIVE STARS COOKING, MENU AND SERVICE. First-time visit. We are two retired \"T-bird graduat","useful":0,"cool":0},"EBSrkfGI6t-QFPOqCfahvA":{"text":"First time here visiting from California and this place is hands down 5 star worthy , from","useful":0,"cool":0},"JliROpkBDa4lurD0j-zYkQ":{"text":"Best arepas I've ever had! They were also the first arepas I ate - but I've had many since","useful":0,"cool":0},"T0vzZ_cHaW7KThhoZxozjA":{"text":"I love this place. Very good arepas. I always get the one with shredded beef with ripe pla","useful":0,"cool":0},"knKgsYPYpwn7rw0trbQq1g":{"text":"Crazy affordable and the food was out of this world! If you enjoy street art, a piece by B","useful":2,"cool":1},"xsjX4e6dzCmi0m4KuEhyZg":{"text":"The food at Mai's Arepas was absolutely outstanding! This was my first experience with Col","useful":0,"cool":0},"X0Vu20LBIe9XdD_1rcuSHA":{"text":"I've been here twice in six days and can't stop thinking about it. I'm pretty much in love","useful":12,"cool":8},"WxOeO6PUSLKEwEekcCntew":{"text":"Abandon all other restaurants. Come, people who love food. Come and be mystified. Bandejas","useful":0,"cool":0},"rDXx13WpX__NggaN6982Aw":{"text":"went here with a friend, because I had heard the food was amazing. I ordered the ceviche (","useful":1,"cool":0},"PSKYydvjA_MA44VQwMVgqg":{"text":"The food here rocks it and so do the cocktails. It's a great place with awesome tasting fo","useful":0,"cool":0},"BjoFj1_hb366Bmu6oR7myw":{"text":"A Latin American friend recommended this restaurant to me and said it was authentic Colomb","useful":11,"cool":10},"sN4hjbcDdtyYpcrfhof06A":{"text":"I usually write long, artful reviews about how immaculately conceived the food is (especia","useful":0,"cool":1},"PVZUirg9S2Ldh6xfeuYLVA":{"text":"From the food to the ambience to the service, this place was so good!!! Went here with a f","useful":1,"cool":1},"gRtZ2cYeLXheOoYpXIVBog":{"text":"Ive been wanting to try Mais Areas for quite some time since finding out that everything o","useful":1,"cool":0},"lMQScWzQdPkD56k9frvPJA":{"text":"Everything was amazing!  From the food to the knowledge of the waitstaff!  I was blown awa","useful":5,"cool":6},"9-hNjFs5fuWmoFYwBvWtVA":{"text":"So the food was great! But the service and hospitality wasn't as inviting since we walked ","useful":0,"cool":0},"Qu82hOUvuiryS_XBrclIhQ":{"text":"My friend recommended this place and we were happy for trying this place out. Food, drink ","useful":1,"cool":1},"8yuKvtmABX00QDZ0BEekRw":{"text":"We visited this little gem of a restaurant off of St Charles and were delightfully surpris","useful":1,"cool":0},"zY7Z9jLoTqvgxu56hq7GEA":{"text":"I treated myself to lunch today at Mais Arepas. I tell you - this place never fails. I saw","useful":0,"cool":1},"TM3HqwyWlHymoCC9D_j54A":{"text":"I love arepas, so why not?\n\nOur server/bartender was very friendly and knowledgeable about","useful":0,"cool":0},"mKrHDwz_xCO_FcaghB6jew":{"text":"The food was okay. I ordered two appetizers and three arepas. I asked if the arepa with th","useful":0,"cool":0},"Us6zIhkIIVaPCzOudZiqmA":{"text":"So very glad to have discovered this wonderful Columbia restaurant in the heart of New Orl","useful":1,"cool":1},"jNaz07j2xSdhneY_z4VLsQ":{"text":"This may be the most underrated restaurant in the city. Best Columbian food I've ever eate","useful":0,"cool":0},"KtSSuYC7XHme3X0HKDuVZg":{"text":"If I could give ten stars, I would. Hands down, my favorite restaurant in NOLA. I have bee","useful":1,"cool":0},"-_cYKbqhuvNUtrOF0XWEmg":{"text":"Mais Arepas is my favorite new restaurant. It is so good, that after trying it once, I cam","useful":14,"cool":10},"Ffo_9QwVsOkX8shlgV4zpQ":{"text":"Everything is AMAZING!\nDrinks are soooo nice! Fresh juices in classic cocktails elevate th","useful":2,"cool":3},"ILuHd2hrmGDe64hzlHTDiw":{"text":"Where to start...this place is awesome.  We've been here twice (once carryout in the midst","useful":0,"cool":0},"2Iy6Vj8XRTo7jbiepNrZeg":{"text":"I've been here many times and have always enjoyed it. Most of the menu is  truly authentic","useful":1,"cool":1}}