{"MUqPC27MU893BvT2lGDGaw":{"text":"Having dined here before for dinner, we recommended to our guests that we have lunch toget","useful":1,"cool":1},"89sEiP5En9VyNcGDOVqGKw":{"text":"Super cute place! There was a nice special the night I was there - $5 glass of wine. We al","useful":0,"cool":0},"I08xwiIEtVq_-GUdKxuMtg":{"text":"Going to Delachaise is an assured lovely time. The atmosphere is miles above the norm in N","useful":0,"cool":0},"FQyv1DZqfs1adFGdBXNpBg":{"text":"Their pommes frites are basically all that a french fry can aspire to be. Fried in goose f","useful":0,"cool":0},"xbXjzsWyHXANNCHUyz5POg":{"text":"This is the wine bar which you wish was just around the corner from where you lived. The D","useful":0,"cool":0},"YX86nJksdZTKac_mfuoYRQ":{"text":"Having moved back to the NOLA area a few months ago following a seven year hiatus, I found","useful":0,"cool":0},"iivAv9DbR1bKq16Gd_lh3A":{"text":"Go to Delachaise, order the pommes frites and steak bruchetta. Be happy. You cant go wrong","useful":0,"cool":0},"rhS1hTmgbbiS0UhAYmEJVw":{"text":"Practically empty (total 10 people sitting at the tables and bar when we arrived) with two","useful":3,"cool":0},"A5pI4ZPqKsqa1j-VXUsKWQ":{"text":"After you wake up an decide to recover from your previous night you need to head to here. ","useful":0,"cool":0},"7YXyZp00JU_PjSyLCDpITg":{"text":"Delachaise, it's whatever you want it to be. It's a lively group happy hour on Friday. It'","useful":1,"cool":1},"2H4ZA2JEnvYIpkZ44Riupw":{"text":"I don't care what else you order, but you must order the fries.  This place is my go to ba","useful":0,"cool":0},"2OXI8LOQK3A0weqiuzWV8w":{"text":"I can't believe what just happened. Ordered dessert which is supposed to take 15 minutes .","useful":5,"cool":0},"u7KYFeDw87YOVqzWXn-EDg":{"text":"We always go here when staying uptown. Love the atmosphere and wine list. Shrimp dish is f","useful":0,"cool":0},"CMWBL6xvKrXwmlioCIkAtQ":{"text":"My go to bar when visiting New Orleans. Great patio. Love the variety of gin for my G&T fi","useful":0,"cool":0},"qY5Ju1Tz4HYDxKjmWSQuYw":{"text":"Good food. Slow service. Not the friendliest bartenders - in fact they were downright rude","useful":4,"cool":0},"4RUbZm6umym15uSgI8j9yA":{"text":"This restaurant absolutely has great selection of by the glass wine list and the food was ","useful":0,"cool":0},"hHkXiEALHGOZx3csA85dag":{"text":"Great wine bar and St. Charles Avenue hipster cocktail scene. No nonsense good bartender. ","useful":0,"cool":0},"uIRPvXBysaCOO75X2mOMAg":{"text":"This was a great way to start the night! We came in on a late Friday night from flights pr","useful":0,"cool":0},"XVKhNdOSeTdmeOawNd1XTA":{"text":"After the noise and commotion on Bourbon st. We were looking for something more refined. T","useful":1,"cool":1},"T90HYn6uooSgxBD0KxefsQ":{"text":"Leave your passport at home and hop onto a barstool at Delachaise for the satisfying pseud","useful":2,"cool":2},"IbFaKHnLS63GxjEsdlTEQA":{"text":"Introduced to me by a local, this place is possibly one of the cutest spots in New Orleans","useful":0,"cool":0},"LAmZujNZ0W_D_PADZ6R68g":{"text":"It was nice to get out of the touristy stickiness of the French Quarter for a night and I ","useful":0,"cool":0},"Idy9f7zcXu-L-ZgU6r9wow":{"text":"I haven't been back yet, but Chef Chris DeBarr no longer works at the Delachaise according","useful":0,"cool":1},"e8z0w8b0v9SvSzeSxVuQGA":{"text":"Great patio area, great wine specials ($5!), tasty (if pricey) food, so I keep coming back","useful":3,"cool":1},"NiZ-EEE9iH4HZ9VS3LrrdA":{"text":"Adorable little spot for a drink with a friend or two. Given the size, I wouldn't recommen","useful":0,"cool":0},"x1koDeUHTI9fmcD9jS-0_A":{"text":"After a day of touristy exploring uptown, my friend and I stopped here on a whim. Super re","useful":0,"cool":0},"v008qXHANz9BnnYkKNh6gw":{"text":"Not much that I can add...\n\nGreat atmosphere for drinking wine, and lounging back with fri","useful":0,"cool":0},"YGEIBnAbqB_biPgKVboKiw":{"text":"My favorite wine bar in New Orleans! The inside has great vibes and the outdoor seating ar","useful":1,"cool":0},"X2D2hcjqCH21J4dSiCqgDQ":{"text":"Love love love love love this place. I've been meaning to try it for a seriously long time","useful":8,"cool":5},"G1Ot2SpwOuXzMBqAW1C2pg":{"text":"A welcome refuge from the madness of Mardi Gras...\n\nAfter making my first visit to New Orl","useful":0,"cool":0},"Ax8RIku5MDe8oHxt9E8EyQ":{"text":"Delachaise is one of the more interesting venues to visit Uptown.  It has been doing the s","useful":3,"cool":3},"RsChiNBUwQPOuYShnvdZag":{"text":"Was a really good place. Great drinks, but tiny as hell.","useful":0,"cool":0},"lMCGcBnrijMbUC4u9D5lhg":{"text":"Nice little spot great location great liquor selection and a pretty decent menu. Outdoor a","useful":0,"cool":0},"z2YI4PuMeri1KGqXkcbHDg":{"text":"While on a weekend jaunt in NOLA I was staying around the corner from this place and poppe","useful":0,"cool":0},"W6DDvB8rHUve_jcTfXO6oQ":{"text":"This place is getting two stars because the food was decent once we were served. I took my","useful":0,"cool":0},"rtZVGt_Nv5sZhi1OPcrh3g":{"text":"Sweet, sweet, sweet mother of God. Not only is the food good, the drink priced right, and ","useful":2,"cool":1},"gf4XrmEc1RpcKm8juxkAFg":{"text":"Great atmosphere and amazing food. I had to give Delachaise only 3 stars because of the co","useful":0,"cool":0},"MCvxxLlKuyVMcJE9yL50eA":{"text":"One of the most \" uppity\" establishments I have ever been to in New Orleans.  If you are l","useful":0,"cool":0},"BDPWfIDoUmFr5a1C7INoMA":{"text":"There's nothing like checking in on Foursquare and getting the \"Lookin' for Love\" badge wh","useful":0,"cool":0},"_Cm53Dg1erYlRsMYKTxAiw":{"text":"I visited the Delachaise a few times during Chris DeBarr's tenure and was most impressed. ","useful":2,"cool":0},"w-OaXxZ7vlIvwi-tP1yjfQ":{"text":"Definitely one of my top five places to get a glass and eat later in the evening after wor","useful":0,"cool":0},"RM6HF7doQaJflbdeWxd7eg":{"text":"Pretentious, but good.  I give the food a B+.  The beer/wine/spirits selection an A.  Serv","useful":0,"cool":0},"evgl5i4e1bJepQ2vc41-3w":{"text":"Stopped at Delachaise while on a cross country road trip with my younger cousin.  The food","useful":0,"cool":0},"v11Ogl1MWZZtBHIF0ZkLCw":{"text":"A friend of mine wanted to catch up and recommended we go here. It was my first time and I","useful":0,"cool":0},"Eb5vF9yx6nGpx-bIJUJX2A":{"text":"Delachaise is exactly what I want out of a wine bar - plus more.\n\nThe wine selection is go","useful":0,"cool":0},"nhnG8pP6sI4hXDw-f6r8Uw":{"text":"I used to adore Delachaise back when I lived nearer to Uptown.  it definitely had the pote","useful":0,"cool":0},"kwYURushARO1O4bXeQ_qhA":{"text":"This is such a cool spot with tons of options. The chef is very creative with menu items. ","useful":2,"cool":2},"cjzFNn_G5v2CLSy90jZN6Q":{"text":"My favorite mussels in the whole city. Getting the fries is always a good idea. Good amoun","useful":1,"cool":0},"jmhuovTH72YJcnCvnJ2jOQ":{"text":"Four stars for location, ambiance, and their bar/patio space. \n\nThree starts for cheeses. ","useful":1,"cool":0},"eLKwqWvcxmOKZe1QsaFjrA":{"text":"I really like this little place. It's got a good wine list and is open relatively late so ","useful":0,"cool":1},"4JFRCaEYRpEn0UZApKBFzg":{"text":"Beautiful selection of wine and beer. Friendly service. Great way to while away the happy ","useful":0,"cool":1},"pJgALKd8dc3VyoNewtiMyg":{"text":"The staff behind the bar is more than rude. Appalling at best.\nHowever the eggplant dish i","useful":2,"cool":0},"Ykvpfi5_CYMyEbyzZ4C1Ag":{"text":"Nice enough place but at the end of the day it was simply a bar ( and there are plenty of ","useful":1,"cool":0},"JjMdNygnuYDi5VeXqlbq9A":{"text":"Quality wines, wonderful cheeses, excellent decor - no reason to complain here - definitel","useful":0,"cool":0},"sBAsxtLeofQ0u6YciA3qOA":{"text":"This place is a must for late night dinning. Serving a full menu until midnight most days.","useful":1,"cool":0},"Klo9lf6gHZ6JaXQBCnRykA":{"text":"The food and drink was good but nothing compared to the after effects of food poisoning.  ","useful":0,"cool":0},"DjlhIDrSsfQ453uVxrJzwA":{"text":"This is one of my favorite little places to go for drinks and a lite bite.  The wine and b","useful":0,"cool":0},"o5hhsK6dqWoBJapUWlxyDg":{"text":"On a Friday night you can expected a packed house, a fight to the death for seating.  Exte","useful":1,"cool":0},"2gi0GaTSq36WSgg1cP9URw":{"text":"Rico love to drink glass of sarah wine so Dechase is good.  Rico no like to be in dechaise","useful":1,"cool":0},"UTfZirdhmRFW9bvIRPWyfg":{"text":"Delachaise deserves  a 4 or 5 star rating for the atmosphere, beverage selection, and a se","useful":1,"cool":0},"aGbakIYQ4WN9DxdjlMny0w":{"text":"Came here for a nice glass of wine and a bite after work. Because really, one can only hav","useful":1,"cool":0},"SRyZ78f-TZxRa01YpJUK-Q":{"text":"Fair.  Two blocks from the hotel, so that was a plus.  Kinda dirty, you have to order at t","useful":1,"cool":1},"-YdyMD-Q0tCiZmj5boWRAg":{"text":"Delachaise is a sure thing if you are looking for a talkative crowd.  The intimate quarter","useful":4,"cool":2},"b500TnFv9JNSi0qkYqLdaw":{"text":"Somehow until recently I have never actually eaten here- which makes me realize I have bee","useful":1,"cool":0},"cU0WfDmEDbEougz2xCx7pw":{"text":"One of the best shrimp po-boys I've ever had!  The staff was super chill and friendly. Plu","useful":0,"cool":0},"Z-N7MLKP-BMrBpsQ-8f3qA":{"text":"The matzo ball soup sold me on this place as i had gotten soaked to the bone out in the ra","useful":0,"cool":0},"ZOjTE3lBESDuZ1E4GtYwvA":{"text":"Delachaise is a great place to hang out with friends for drinks. I love to sit on St. Char","useful":2,"cool":1},"HA4UZM3N5uxW54fAjeTd5Q":{"text":"This reminds of the bars and cafes where I used to go when I was living in Europe. I love ","useful":0,"cool":0},"xMLB-NV_x7zw6adNFhjZqg":{"text":"I love this place! Food does not disappoint and selection for drinks is great too. The pla","useful":0,"cool":0},"YcviFpD7cOfisgck3evuGg":{"text":"It makes me sad to give this restaurant one star, but I have no choice. I typically love t","useful":0,"cool":0},"ZowSFM9l7QIlnk5kJnITTg":{"text":"Great drinks! Great food! And most of all\nGreat service! Even the manager? Owner? Pitching","useful":0,"cool":0},"skxkO54vezbyHp4goKtpYA":{"text":"I always enjoy myself at Delachaise. It's great for happy hour, post-dinner, first dates, ","useful":2,"cool":1},"BsHKIkGac1NdVmbnDFMk7g":{"text":"The first time I went here, I was less than impressed.  It was packed, I couldn't find a s","useful":1,"cool":2},"__wF-VxoY1jp7qrOBuuQIA":{"text":"One of our favorite restaurants in New Orleans.  The steak bruschetta is wonderful!  We al","useful":0,"cool":0},"3huEz_U2OX-2QXQNOszUDA":{"text":"This place is normally right up my alley. Unique, wine bar, with original food and a roman","useful":1,"cool":0},"RlwYINmYmzaEXTXdaqisQg":{"text":"Highly recommended! One of the coolest, greatest places to hang out at, drink, eat and be ","useful":0,"cool":0},"wQPU9aMu3wjqSZcIE-sBdg":{"text":"Intimate, relaxed, romantic spot spot for a drink and nosh with friends. It also seems lik","useful":0,"cool":0},"N_Ahbzl-M0bQdS2kRWvmKQ":{"text":"This review is not for the food; we came by for a drink. It was a little too cold to sit o","useful":0,"cool":0},"rRaBkgDam74juVpC4RQJHw":{"text":"I LOVE the vibe of this place and always take out of town guests here.  It's so cute and c","useful":0,"cool":0},"JiQhAZicfy8RnRo222ZFhA":{"text":"Probably the best \"first date spot\" in NOLA for young people. Location is perfect and the ","useful":0,"cool":0},"QtZ_iButa61uZ5wnQC1krg":{"text":"What a great Thursday! My boyfriend and I went here for the Dining Out for Life HIV preven","useful":0,"cool":0},"Q0w9CrVBxZC20l-1lwkaaw":{"text":"Good beer and wine selection but the bartenders are a bit highbrow for me.  The place is v","useful":0,"cool":0},"5AEK3EWkUnm6_3JHCaLaOA":{"text":"Delachaise, oh I fucking love you. \nI love your little quaint decor.\nI love your selection","useful":6,"cool":3},"TXE2589su25pcaAZS_oXsQ":{"text":"Still incredible. I don't EVER eat french fries, for example I can be in a car full of hot","useful":0,"cool":0},"J0MMryS7Jd6-OiZPIVNJ3Q":{"text":"I love this place despite the slowest, most impersonal bartenders in town--perhaps they're","useful":1,"cool":1},"ffkA32s7I723QTyzX0LoFw":{"text":"Thank you Yelp for this find! Delachiase is responsible for the single most delicious edib","useful":2,"cool":2},"ygT-mDe0425HKYsm4ltO8g":{"text":"Only one thing I have to say about this place : Pomme Frittes!\nFried in duck fat and serve","useful":1,"cool":1},"W3UvXgZK8iT3rB6ujwvn9Q":{"text":"Very cozy and unique atmosphere. Love the ambiance at night. Had the ham & Brie sandwich w","useful":0,"cool":0},"ojZ4Pn7H6HQPtAFERXLa1w":{"text":"Loved the special, yummy chicken bbq on plantains! Nice atmosphere.  Disappointed in the s","useful":0,"cool":0},"LPbHdgidmlDgqjU7B1unSQ":{"text":"Pricey, but well worth it. We went there at night time, sat out on the patio... and enjoye","useful":0,"cool":0},"HWjDy6ELizbI835QbVWUEA":{"text":"Love this place! Went here for my 21st birthday and they gave me my first drink free! Also","useful":0,"cool":0},"cNr3yJB7KrJgxtoUgv1lcw":{"text":"The Delachaise is truly decadent in atmosphere, food, and drinks. It's a wine bar, which y","useful":0,"cool":0},"yU1LIiiNsM0w3bB9tWFTHA":{"text":"This place is a little expensive, so it attracts a mostly white, upper-class crowd. Howeve","useful":0,"cool":0},"bVeTyzBHYPJhapTqOKurMA":{"text":"Mussels. Amazing\nFrites. Outstanding. \nOlives. Delicious. \nWine. Spectacular. \n\nBasically ","useful":0,"cool":0},"vVGKtO_05TGY4zZ8NJdwuQ":{"text":"Solidly meh. The frozen rose was overpriced and we were overcharged for some of our food. ","useful":0,"cool":0},"G2vAy-VD8ow9e7UmQ1tWSg":{"text":"I've frequented the Delachaise for three years, and while the food and wine selection rema","useful":1,"cool":0},"2Q6IDsLImbsgIi8ThNhc0g":{"text":"Delicious fries, though a bit salty. Loved the dipping sauce. I had the best ham and Brie ","useful":0,"cool":0},"3ojl8bvIRNJIHm11u-S4cQ":{"text":"For those wanting a very cool atmosphere to enjoy quality wines, beers and liquors, then t","useful":1,"cool":1},"ZeR4L0Kss0Qze_oHwJmW5g":{"text":"Boy oh boy!  After the wedding I hooked up with some old friends and the after party had u","useful":2,"cool":1},"13MRb0P_U1Z__RVJ7ErwtQ":{"text":"This place is a staple. I love the Pomme Frites in goose fat, and there's a pretty solid w","useful":0,"cool":0},"hpYgFgCUleUu74jqZZb6Ew":{"text":"Outdoor seating is nice. Bartenders very knowledgeable. Drink menu is color coded by subty","useful":0,"cool":0},"Ecf_gTIKOfXFG_RqJNtT4g":{"text":"Really cool spot with a big city feel smack in the middle of the Garden District.  Outdoor","useful":0,"cool":0},"EybVAbpKbafj8jvjK1OEUw":{"text":"Here for a Divorce Party and enjoying a good night eating and drinking.   Great atmosphere","useful":0,"cool":0},"fhReYio9iqKns7DY71QNCg":{"text":"We had a bad service from this place and tonight we decided to give a chance since we live","useful":1,"cool":0},"QuyVkZLsfeSjYXJU8x4xeg":{"text":"Not usually here on a Monday night (yes I am). Sam is a so great. She's good to talk to, s","useful":0,"cool":0},"z3OdP9KHGOrt9JCi_YhFLQ":{"text":"Wonderful place for a meet up!!! The mixologist are superb!!! \n\nThe patio rocks! The bar i","useful":0,"cool":0},"zPnmFJ1ynWQ6o2xqHS98hg":{"text":"DO NOT GO THERE. Service was crap. Not only did we (4 people) wait 1h 30 without getting o","useful":2,"cool":0},"n9D5c1I2IcZgjEowSOV9RA":{"text":"This place gets 4.5 stars.\n\nIt's the perfect place to have a second date.  Very romantic a","useful":0,"cool":0},"8ZH2hvlJ-rzUC_rpLcQlpQ":{"text":"While I have eaten here, it's been years (although I do remember it being good food), so t","useful":0,"cool":0},"KmzZFFHceR0_pHR4RTrCKg":{"text":"We come here every time we visit NOLA after stumbling upon it one evening!!! Great wine an","useful":0,"cool":0},"V576kKOXrOtpMYsdUevX4Q":{"text":"I would definitely recommend this place.\n\nFOOD: Amazing. The flank steak bruschetta was so","useful":0,"cool":0},"W7S0e9sUrn3uT1kUDmlPnQ":{"text":"Thanks for steering me in the right direction, my friends. I'm staying down the street fro","useful":0,"cool":0},"ozTmbS1DHPrsUkjl5kdvXw":{"text":"I'm sorry but I have to do this. I must channel my inner Buffy to review Delachaise. You w","useful":7,"cool":4},"eucutVmfHd7p_sttC-oflA":{"text":"Great place for a late night dinner.  The frog legs were awesome along with the goat chees","useful":0,"cool":0},"rrSwVvKA27OA7d5C5OrXDg":{"text":"Why didn't I give Delachaise 5 stars the first time around?  I honestly have no idea.  It ","useful":3,"cool":1},"pmX6HqfucYRPZQdvfVAa4Q":{"text":"A great little bar with a wonderful selection of wines and beer.  The goose fat fries with","useful":0,"cool":0},"aipfQIDG4LYDuMpJo2tB9Q":{"text":"I wasn't as bowled over as some of the reviewers. Yes, they have a good selection of wine ","useful":0,"cool":1},"4O7ZIt9wnyevj2oe3iIjxQ":{"text":"I liek the curly haired dude. I liek the grilled cheese. In conclusion, I would go back to","useful":0,"cool":0},"D6M_Eegipw2s8dvGUEJ3KQ":{"text":"If this place were in my neighborhood, I would come here several times a week.  Cool vibe,","useful":0,"cool":0},"87KaGvXMvYHRpbmPtL0Xlg":{"text":"I've been to Delachaise on a few different occasions. I've been with J to enjoy a quiet ou","useful":0,"cool":0},"QMA5FGfGqOoNtYiZadCr6Q":{"text":"LOVE LOVE the Delachaise for the best patio, wine and food nearby in a fun casual atmosphe","useful":0,"cool":0},"dbwKJgswXSTGwWKxnJfUiw":{"text":"I don't like the crowd at this place. It's best described as lowbrow yuppie. There also se","useful":1,"cool":0},"6IfSKB4Jo-C7KC-VbPBd0w":{"text":"A cute little wine bar uptown, they do have a full service bar as well in case you are not","useful":0,"cool":0},"AXVqmLXziSAyAzj1QKqY0g":{"text":"Kinda reminds me of NYC. \nLong narrow space with a warm yellow glow. \nI instantly feel com","useful":5,"cool":1},"lgXt75vVBpponsavt2yTdg":{"text":"Came strictly for the Duck fat fries & they were as crispy & flavorful as I hoped. U order","useful":0,"cool":0},"8bQjYLHt8MHbeZXpqeWAJg":{"text":"Great selection of wine & booze.\nDelicious food.\nFantastic bar-tending eye candy. (I'm loo","useful":3,"cool":0},"iW75hw7i-3PmvwiYqkMdEw":{"text":"Great atmosphere, small but interesting wine list and cocktails, yummy french fries.","useful":0,"cool":0},"XjOl9_ScpyUn3y1EKjv4uw":{"text":"Awesome bartender, food, music, and a nice wine selection. I really enjoyed this bar and w","useful":0,"cool":0},"fKIi8hFAdHBcHvUY2ybLFQ":{"text":"It is a bar, but has nice seating areas indoors and in the patio, and serves full-size ent","useful":1,"cool":0},"Tbcc3EFdJpEG89mC5Qjphw":{"text":"Disappointed in this place after I had heard such good things from many people.\n\nWent here","useful":2,"cool":0},"0Z_10Q_RM0JW4_yuAswqKQ":{"text":"I love the atmosphere indoors and out.  It's a great location and has unique architecture.","useful":0,"cool":0},"rGOExwJz_4GiLjpvlhstCA":{"text":"We just happened on this cool spot as it was around the corner from our hotel. Though it i","useful":0,"cool":0},"l3Ypx6IqAsdJhmrikasJNQ":{"text":"Wow a true gem! Luckily our first night in Nola we were staying at the Hubbard Mansion (ch","useful":0,"cool":0},"hH3KVo2F51mCaRWIozLC2g":{"text":"I love this place.  Consistently great service, selection of spirits, and food.  Try the g","useful":0,"cool":0},"z0JOJSi3-hnbsgCFb95oyQ":{"text":"Great bartenders and cheese plAte but everything else is just so so. My daughter loves the","useful":0,"cool":0},"bQzAlnanWrRStxXAO1OcTQ":{"text":"Great place for evening drinks, rarely overly busy, and the food is ballin'. An excellent ","useful":0,"cool":0},"aSP5nKymNBkvt0VwjgKltA":{"text":"I felt like I was in Paris, so that was great fun. The music was smooth jazz, and the seat","useful":1,"cool":1},"ufTYLzErEmkcPva-xBruFA":{"text":"Fantastic grilled cheese! As someone from Wisconsin, this was impressive and delicious. Wa","useful":0,"cool":0},"w9KpK-NO72K1GIp3f0cxdw":{"text":"Food and wine was great, but the service was terrible. It was a Monday night and there wer","useful":2,"cool":0},"RT97gYfRHF4O-VecQ8iJNw":{"text":"We spotted this place from the streetcar as we were passing by and later went back. I had ","useful":0,"cool":0},"o4XGV_Eu0IaWt1xiamLDyg":{"text":"Delachaise is adoooorable! It looks like it just popped out of pinterest, seriously! Cute ","useful":0,"cool":0},"DAIh6mZnKPFgzY8mp_kNCg":{"text":"Quiet wine bar type bar uptown.\n\nThey will have food specials, it's been a while but I bel","useful":1,"cool":0},"A0mvTanDeKsIMABSIu5ByA":{"text":"My lovely girlfriend wanted to go here for her birthday. I like wine, but I'm definitely a","useful":2,"cool":0},"twU3--kPtgGjV5umVC6eYA":{"text":"Order your food/drinks at the bar, then find your own table. Quaint outdoor patio with a s","useful":0,"cool":0},"mlsDjhD5Ly6k_7j5KEpaBg":{"text":"Delachaise is a really nice little spot.  Great wine, lovely service, and actually pretty ","useful":0,"cool":0},"XdT-5UCHg8cGUcHrdOghoQ":{"text":"Although I wasn't a fan of the crowded spaces and super loud music/atmosphere, the food wa","useful":1,"cool":0},"gV18BMwXsHTvPhCjH5pNLw":{"text":"Despite being a proud, non-wine enthusiast who frequents with a avid group of winos, Delac","useful":1,"cool":1},"avd_DGKyK8wjuAc6E5KRlg":{"text":"Nice place to meet after work (or after a day of toddler chasing in my case). I had the gr","useful":0,"cool":0},"MJw2DcfxRgidDkYywYDRRA":{"text":"We sat ourselves and waited for about 20 minutes for a waiter. No one ever came to our tab","useful":1,"cool":0},"w9hX5-vxUYAfTvYRHtuRxQ":{"text":"If you've read my other reviews, you know that I'm not one to full out hate someplace, or ","useful":0,"cool":0},"K-5Cdw4ii_zfpUoL01B1zg":{"text":"So I can't wait to go back here when they are actually open for a meal.  Was recommended t","useful":0,"cool":0},"oHBtH-iaFBfs4d5CbPi-lw":{"text":"Best fries in the city. Great atmosphere. Reasonable wine. Everything else is pretty delic","useful":1,"cool":0},"6eLmKnWuKoMVu8uCvpfnUA":{"text":"Wine Bar.  Great atmosphere.  I actually went here 2 nights in a row.  The plates are well","useful":0,"cool":0},"DfNwX-rxhGSRf6oIkLspJg":{"text":"Amazing food.  If you want a hip, chill place for great food and drink this is the spot!  ","useful":0,"cool":0},"PqoX9xcyePfCFI5sgKwUuQ":{"text":"Salmon johnny Cakes were outstanding. I'll be returning. Great atmosphere. They have a div","useful":0,"cool":0},"Xy1SN9yLVO5HABoPOpAzZg":{"text":"Like Matthew M, I also just moved back to NOLA after a seven year hiatus, and I loved the ","useful":0,"cool":0},"RGvuqUDz3V5tmTPRB9QB7A":{"text":"We came here on a Saturday night for dinner, it's awesome because it is one of few places ","useful":0,"cool":0},"RyH9Gtoxy1YDHvnF2sEb9A":{"text":"Pretty disappointed in Delachaise. I have been about 3 times, and each time I have somethi","useful":1,"cool":0},"E7XL6a03sWLQPgZ5rncifQ":{"text":"Great atmosphere, yummy fries...I would have given then 5 stars if the service wasn't awfu","useful":0,"cool":0},"1aS1zygacS143Ns6QECMHg":{"text":"This place was fantastic on many levels.  Four of us from out of town went here and we all","useful":0,"cool":0},"N5WljSKqRog24OKfudvrZA":{"text":"I was kind of over being in New Orleans on the last night of our trip, so we decided to ta","useful":0,"cool":0},"hclkeET2E3UQsyCXL_CJnQ":{"text":"This wine bar has a very nice atmosphere and a large selection of drinks but that's pretty","useful":3,"cool":0},"HjMl9mDAkrb7WLbDIl3VCA":{"text":"The ambiance is very laid back and Bohemian without trying excessively hard. The wine list","useful":0,"cool":0},"jJ1pK0TceX-ldRs9l-BGcg":{"text":"I LOVE DELACHAISE!  Been here numerous times and this is my first Yelp Review for it.\n\nWha","useful":2,"cool":1},"0TpWCjNkQv_-JQk_GRf_6w":{"text":"Best place for mojitos and Johnnycakes great atmosphere great bartenders and a great way t","useful":0,"cool":0},"xZZHw2twIWPILFwn6htVmA":{"text":"Here is a little bar, located right on St. Charles Ave., that is small and bursting with f","useful":0,"cool":1},"zeRFd7jEb4YV-n248P52mA":{"text":"A very large wine selection, great and friendly staff.  Outdoor seating is great in good w","useful":0,"cool":0},"e45-lJXTq9WyBSJnLHDDhQ":{"text":"One of my favorite bars in New Orleans, with some of the best food in the city.  Never min","useful":1,"cool":0},"JQCDy8f8Mnia-XunYR1pXQ":{"text":"so i find myself on a late-night prowl for harry connick jr.\n\nstumbled into delachaise for","useful":2,"cool":2},"-SNaheKgP8uVtGasLyHD6A":{"text":"Oh, Delachaise, how do I love thee? Let me count the ways -\n\n1) Frog legs: I wish kissing ","useful":3,"cool":1},"WNJ_dzEmLPwd21x1_EZ80A":{"text":"We spent 6 weeks in the Garden District and The Delachaise quickly became a favorite spot ","useful":0,"cool":0},"mc4U6ipLkl82QSaz3986xA":{"text":"Not a huge menu - mostly designed for drinking and chatting. I got the grilled cheese, mad","useful":0,"cool":0},"pZKv8_64iXPWGSqYAkAkrw":{"text":"Put it this way, the fries and the molten lava cake is so delicious that I spent months se","useful":0,"cool":1},"j0JYj3pUd6ATEUVhsBYA7w":{"text":"I went here for a few glasses of wine and didn't get to try the food. I was somewhat disap","useful":0,"cool":0},"xCF96W3f3NedUZExu2QAfg":{"text":"Went for lunch on Saturday, and it was strange. We were the only people there the entire t","useful":0,"cool":0},"-R2IldVqLc_JXBloqEks5Q":{"text":"I went on a quiet night just for drinks.  The mood was really nice except for a drunk saxi","useful":0,"cool":0},"HEhvPQozeXD8UOfx-TyZnA":{"text":"Lisa was our bartender and was excellent. Knowledgeable and we had some of the pomme frite","useful":0,"cool":0},"SwJUfjAWnWw4yqecYpZ0NA":{"text":"Best wine menu in New Orleans. Not extremely extensive, but smartly put together. \n\nWant t","useful":1,"cool":0},"vmMXxd3FqLwT8NqN9lXT0g":{"text":"Don't remember coming here but left my phone (and metrocard, compact, etc.) at the bar and","useful":1,"cool":0},"8u8c2l6yOvME1cxTfrga5A":{"text":"I am kind of upset with myself now that I realized I've never written a review of this pla","useful":2,"cool":2},"CRYld2MgXha8ZsU03EwqOg":{"text":"So I like to drink nice wines and eat fancy pub food.  There is always a really decent gla","useful":1,"cool":1},"QYCplwC4B3ytvx6ZlVhAsA":{"text":"I've been a frequent diner/drinker at Delachaise since 2008 and have always enjoyed my exp","useful":1,"cool":0},"4-zGNL4VpmGd2miT8_oZZQ":{"text":"As a lone diner when on work, I try to find somewhere that isn't your typical spot.  This ","useful":0,"cool":0},"FYb6uBs-btUDyEPwF27hTA":{"text":"Fun on the weekend~! Food is good! Slow service though!","useful":1,"cool":0},"EXIS3hoDGmU8OnY406QcIQ":{"text":"We went to delachaise at about 8 on a Saturday night. We weren't looking to spend a ton of","useful":0,"cool":0},"lyC5CoXN85p3ixD6vAdIuw":{"text":"I live in New Orleans and every time I go to The Delachaise I am so put off by the snotty ","useful":0,"cool":0},"ToBQO7xPBSIIFKu4pe9RIA":{"text":"Food was alright.  Steak was decent but i think it was mostly the garlic butter on top.  H","useful":0,"cool":0},"QruRisoM36m8t-stfdHb4Q":{"text":"Very solid place for a small bite and a good glass of wine.  We happened to come upon this","useful":0,"cool":0},"drWqKTHeLMCiMCJcE6ai8A":{"text":"I went to Delachaise last night to have a drink with an acquaintance of mine. One drink tu","useful":3,"cool":4},"Aq-Ug-la9zzKoTtmsF2v4Q":{"text":"Cute uptown spot with a good beer menu.  I believe this unique, charming, and narrow venue","useful":0,"cool":1},"wI124mjFgrGzx7fERUyeTw":{"text":"Good location. Good space. Great outdoor seating on this first Fall like night. Great wine","useful":0,"cool":0},"m9q8NpABWusEG7D8LlcdsQ":{"text":"I am obsessed with Delechaise. Sad that I just moved to Houston, and it's tough finding th","useful":0,"cool":0},"eXfHi9CzztYE8sQyb5hPrA":{"text":"If you are looking for customer service look else where. The bar tender and bar backs are ","useful":0,"cool":0},"FnOi1vHRYW5tOpKNkIdr5A":{"text":"I've never reviewed Delachaise? Really? Totally thought I did. Well then, let's fix that..","useful":12,"cool":3},"_6bPHxwogh3E6swSKxSwOw":{"text":"Now I see why this place is so popular. Because their drinks are the bizommmmmbbbb. Random","useful":1,"cool":0},"00EVK6EwPXRgmSIWPmAF3g":{"text":"New Orleans is like no other place in the country and is incapable of producing cookie-cut","useful":6,"cool":7},"F2fKuKCV_UISgA20iW0LXQ":{"text":"I've gone here a few times over the past couple of months, and actually primarily for the ","useful":0,"cool":0},"qBzEhWegTCuw2IVDk1XNdw":{"text":"This place is a lot of fun. The first thing that strikes you as different is that there is","useful":1,"cool":1},"wUwUGcpdc95Ca4fi4lSTDA":{"text":"The food was great and the wine was wonderful too...but it was a crazy mess as far as staf","useful":0,"cool":0},"4bgVMVPtiUzu418QQwhjdA":{"text":"Such a chill environment. I absolutely love it. And their mussels are oh so delicious!!!! ","useful":0,"cool":0},"_pXvf4M38Zp9YCuYPbgb3g":{"text":"Absolutely WORST service I have ever had a restaurant. After waiting for about an hour for","useful":2,"cool":1},"4-PBrMO4J2RpqlWX9n3EFg":{"text":"Took my annual trip to New Orleans and as always made it a point to go here .\nNothing's ch","useful":0,"cool":0},"zAlFlzJqX86v1H6KlDAUeg":{"text":"The Delachaise is good for: winos, liquor snobs, cheese lovers, first dates, tenth dates, ","useful":5,"cool":5},"m-ukKZStDmxPurgJvhTOww":{"text":"Great atmosphere both inside the bar and on the patio. There is a great 50's vibe inside. ","useful":0,"cool":0},"B9lhGlIqAmsYg3Q2lWPSIw":{"text":"This is probably my favorite place in the whole city. Great music, great wine and great fo","useful":0,"cool":0},"PIZ5SP1yrMCZjGokldoexQ":{"text":"The fries are yummy.\n\nThe mussels and frites were good. The soup the mussels are in is sal","useful":0,"cool":0},"GwbTqKshR1jqQmL_fPgcsQ":{"text":"Cool place, nice music, great out side seating.... There's a few eccentric characters here","useful":0,"cool":0},"MJK6FGQoqO_SHTcwbCYEcw":{"text":"This is one of my favorite places to go in New Orleans. Great drink selection, good wines,","useful":1,"cool":0},"dlpJcCqRweNBeKNkx3VqHQ":{"text":"The Delachaise is one of my favorite bars in the entire world. \n\nIt's not the most impress","useful":0,"cool":1},"imAtIeKIMxQCPQnA_jmYpg":{"text":"I'm from out of town, and this place was within walking distance from the hotel. My family","useful":0,"cool":0},"vm4qcsDR1Rq1-pyq5YV9yA":{"text":"One of the best collective selections of beer, wine and liquor I've come across in Louisia","useful":0,"cool":0},"1eyRyDpFNyR5YERb7pHo9g":{"text":"It isn't a dive. And it ain't a speakeasy. This bar is a more romantic variety, which is a","useful":3,"cool":2},"aMKhiQjkHRxzZDmQZiw7pQ":{"text":"Crazy amazing food that is not fried or seasoned with gut rot Cajun seasoning. Yes I am a ","useful":0,"cool":0},"WjRcaFwZHSiwP6vV4c_kuw":{"text":"I gave this place 4 stars only because the bartenders are a bit absent considering there a","useful":1,"cool":1},"gGiv7223Mv-LdUYuF49WPQ":{"text":"This is a perfect little date place. Good food and great ambiance. Too bad for the bartend","useful":0,"cool":0},"8NWVqeQVX2Y9jmp09tRMbg":{"text":"Alright, but overpriced food, loud, and crowded.","useful":0,"cool":0},"nldALhYbWUsD4PFae8YBKQ":{"text":"This little bar was down the street from our hotel so we went here for dinner. They had a ","useful":2,"cool":0},"0rlj0wMXNbnCUEtX_uvEVQ":{"text":"Loved the quality food and the ambience.  Looking forward to bringing friends and family h","useful":1,"cool":0},"plMTbmEZ12IA5bE7LutU4w":{"text":"I think I went to Delachaise at least 5 days every week in summer 2011. It is a tiny wine ","useful":1,"cool":0},"aftsNnKERrnf_h7H5DrPIw":{"text":"Good food, horrible service.  Folks who work here don't want to work here.  Sign on the do","useful":0,"cool":0},"xZy681YKRdrQvGFzsweMeQ":{"text":"This is the place that started the hip wine/cocktail bar with amazing food boite trend tha","useful":0,"cool":0},"64RUR21RF2x98Koc-DCbMg":{"text":"I had no idea I'd not reviewed the Delachaise. It is one of my favorite places to hang out","useful":9,"cool":6},"O8ctVDJZWIhQvHTd53WrCg":{"text":"Didn't have a good go at it.\n\n2.5 stars\n\nEverything started off fine...  I thought it was ","useful":1,"cool":0},"KeSi_WBPgQyD1VzJZeNmOA":{"text":"This is a gem in the heart of Uptown! I snuck in here on a rainy afternoon after a day of ","useful":1,"cool":1},"gwx0IbAshVHcWjARRHX_Pw":{"text":"Fantastic,  low key,  neighborhood spot,  with great staff.  We happened upon this spot du","useful":0,"cool":0},"NAQwbOtrbL1k3e0n0bbnLA":{"text":"My wife really enjoys this spot, and I think it's good, too. But not really great. \n\nFirst","useful":0,"cool":0},"xIWTwA1GSfrKpK8pyd0_wA":{"text":"This is one my favorites in town for a glass of wine as their list is quite extensive and ","useful":0,"cool":0},"HxNpvbhKSBpeJhRaHC5PpA":{"text":"We had a lovely evening there on our last NOLA visit 4 years ago, but this was a real disa","useful":1,"cool":0},"PWcx4KnIoLQWC59zx-lNnA":{"text":"Yummy drinks and yummy food. It's a bit pricey but definitely fun and worth it for a girls","useful":0,"cool":0},"lq4a2IUR4hsGduVPR5QlMw":{"text":"Wow. Romantic yet casual unique and buzzing with energy. Loved it! Shared 3 cheeses, the f","useful":1,"cool":1},"wA_VhX0OEaQNS9URh39SaQ":{"text":"Never would have stopped in this place on my own. Nice to have a Gen X/ millennial daughte","useful":0,"cool":0},"oA7N-qRsReJZK6UoI_Gjzw":{"text":"Great food, amazing drinks, nice bartenders, but the music and crowd absolutely blooooooow","useful":1,"cool":0},"TU20T1TDw8HZm-kTl8IZKg":{"text":"Indeed, my wallet weeps when I hit up the Delachaise but it is always totally worth it.\n\nA","useful":2,"cool":1},"YpFgpedizunEonOo_5v7Xw":{"text":"I've been going there for a few years now and I really like the place. But, the male barte","useful":0,"cool":0},"4QS0IJ_14-eZjBOQdDvnRA":{"text":"A recommendation and glad it was recommended. The drinks were on point Bloody Mary's, Pape","useful":0,"cool":0},"Xg3CpKK27DrcQEe7PCerLw":{"text":"Seriously, one of the best places in New Orleans. Even though nowadays you can barely find","useful":1,"cool":1},"cAHimDunD25C8YoWblK0dg":{"text":"This place is great, loved it - the service? Not so much. The rudeness level totally kille","useful":5,"cool":2},"ClHvFw7KEhqsHtDy9fW6uQ":{"text":"I used to be a regular at The Delachaise in 2003-2004. I do not go there nearly as often, ","useful":4,"cool":2},"AHk8Pd3YNylZbz9Hc_ntmg":{"text":"I can't even begin to tell you how happy I was after my first visit here, you see, I just ","useful":0,"cool":0},"t62f3W9fFuWIX4yXxrtt8Q":{"text":"The Delachaise is a really nice laid-back spot in New Orleans to enjoy some wine and a bit","useful":0,"cool":1},"6EsctLiY5otpMQqSlSCAKw":{"text":"Love this place. Even one bad first date couldn't put me off. The cheese plate and that fl","useful":0,"cool":0},"PJoLRtTr948cMRqmXbC3cw":{"text":"I have driven past this restaurant a million times, but only recently had the pleasure of ","useful":0,"cool":0},"FtmMCKwIIN4wN9cvefehbg":{"text":"Delachaise is as unique as it can get. Amazing ambiance, amazing food, and superb service.","useful":11,"cool":8},"io1ro1wXSqynPHifMU_NYg":{"text":"After reading the others reviews, I completely understand.  If you want to check it out, d","useful":3,"cool":1},"ZkHvN_NAnKxIdzDS_sY8mw":{"text":"this is a fun little place with a great menu.   we came in to have cocktails and visit wit","useful":0,"cool":0},"S0b3ihJgzW-zI5hCN6AqEA":{"text":"Great burger and easily the best fries in the city at the moment. Great late night spot an","useful":0,"cool":0},"ezMSkXZcdZR4OlAGhNgooQ":{"text":"Delachaise\n3405 St. Charles Ave. (Uptown on St. Charles Streetcar Line)\nwww.delachaise.com","useful":0,"cool":0},"897C6TW238VaMwVEo6Wy-w":{"text":"Cool atmosphere, feels very European, right down to the stern service, ha ha. The food was","useful":2,"cool":1},"2vq1DG6XF_kLGpGRV_JJYA":{"text":"This is mainly a wine place but the Goat can drink his vodka here and they make very good ","useful":3,"cool":1},"LF0W7BXecym9wqxfs_SbMA":{"text":"Mussels in broth happens to be something that I feel I MUST get if it's on a menu at a wel","useful":2,"cool":1},"hoBtcmUJt_469NbQsvqozw":{"text":"As a new transplant to New Orleans, my brother in law brought us here and I must say, it i","useful":1,"cool":1},"bWQXSYOMsA4zykqQGo1fmQ":{"text":"Bar was perfect. Wine and alcohol selections are extensive, though I enjoyed the 5$ glass ","useful":0,"cool":0},"3MmBR7J5C90hv4uf-wjOxA":{"text":"I was here once. About half a year ago. So I'm going to be pretty vague. What I DO remembe","useful":0,"cool":0},"T1_lw3nEllud2Aso5E6Kyw":{"text":"Great decor, good drink selection, decent bartenders, fantastic location, and typically a ","useful":1,"cool":0},"E-huVuItMlStJDi2NtCPJA":{"text":"You want to like this place, and then you walk in. We had several people in our party and ","useful":0,"cool":0},"azcM-B7TS4uPPZzVTij1VA":{"text":"Great Fries. Horrible bartender.  I have been 3 times in the last 3 years, and each time s","useful":1,"cool":0},"ogAJjXOiB3S0AZIH8dLPMw":{"text":"Really love this place.  Very Cozy.  Have been several times, usually meeting friends.  Gr","useful":0,"cool":0},"vn3OpN83Uv6sTejjg-9Z_Q":{"text":"It's definitely a fend for yourself. You have to prefer at the bar. Which is fine. But the","useful":0,"cool":0},"a92t4V5ZO8rV3yLjCZ9Ihg":{"text":"I love coming to this small but inviting wine bar and restaurant. The wine and food are gr","useful":0,"cool":0},"FOZo5zk9ldh5EyjJrU6r1A":{"text":"WISH I could give it a 3.5!! So torn between that 3 and 4. Overall: Come here for an entre","useful":0,"cool":0},"4FbAptmwFhZYWnTgfMk-sw":{"text":"Perfect lighting in this fancy dive. Also, Morrissey in music rotation!\n\nWhat else? My sal","useful":1,"cool":1},"-hhj7AuoecX27EPcQXWqTg":{"text":"Really good food, large selection of beers, wines and cheese plates, fun atmosphere, great","useful":0,"cool":0},"Uo8xotM5tzNXc3ITJTd9HQ":{"text":"been here once only. ok for its purposes. Nice selction of wines. Loving the outdoor seati","useful":0,"cool":0},"AUpQoj1fuVT9PBdxfkhEzg":{"text":"Ahhh yes, Delachaise has become one of my favorites places to hang out for a glass of wine","useful":1,"cool":0},"yZaGE4DxciCbM5wjHw1Viw":{"text":"I still love this place time & time again! Every visit is unique but you are bound to have","useful":3,"cool":2},"EdVHo0TQzId9eaxImx3f4w":{"text":"One of my favorite places - never disappoints!  Tried the new lunch menu - the meatball sa","useful":0,"cool":0},"9e2Rp86v1rnjG7giS5OE_w":{"text":"This was the perfect place for a first date on a weeknight.  It's small and intimate and w","useful":0,"cool":0},"v410R6IhPHwbIVogSJiCHw":{"text":"We only had one drink here, but I've heard the food is great.  I loved the building itself","useful":0,"cool":0},"tdhMQgEUX7iOOj96Htk-Wg":{"text":"i am writing this review pretty much on ambiance only as i met someone there for some wine","useful":0,"cool":0},"Yl58M3iiHrpH7Lw3yJYpvw":{"text":"Came here on New Years Eve.  I've never been here but I have passed if many times like oth","useful":0,"cool":0},"0Uc2xkpH7Ax74IOPpDy2cw":{"text":"This would actually be 3.5 stars, but since that's not an option, 3 it is.\n\nLet me preface","useful":1,"cool":0},"yXS6mo2JPiBY3ugQIHcmzA":{"text":"Just got a completely rude response from someone at this place. What kind of person calls ","useful":2,"cool":0},"eEYKQpyJh9ePtFDMOrSFMg":{"text":"We ordered a wine and the guy told us they didn't find it and changed it for another. The ","useful":1,"cool":0},"isE0TDW0jjtcpogpe-35Aw":{"text":"We had dinner here on a Wednesday night. I have always loved this little building. It is a","useful":0,"cool":0},"F_mIQwBOwLOOmIzSwgT-EQ":{"text":"Came here Friday with a big group.  We ate first.  We got the fries with the aioli.  Fresh","useful":5,"cool":1},"QmUjZHkHkL63AmE5Mab-FA":{"text":"I don't write a lot of bad reviews, but I think this place warrants it.  \n\nThis restaurant","useful":5,"cool":0},"D_StKHNmKyY0UVYbC03tBQ":{"text":"The atmosphere is perfect here.  The food is great and the endless list of alcoholic choic","useful":0,"cool":0},"PttyOrTp-5MazaY3ImCwXA":{"text":"The food was great but the service was bad! The bald bartender was pretentious and refused","useful":0,"cool":0},"la2nBbH-DRvEMTvXyHntyQ":{"text":"I had a creme brulee here that may have been my favorite ever.  The whiskey selection is p","useful":0,"cool":0},"_gJf37CG_3M-Pl4jm1mxBg":{"text":"We stopped in for cocktails before going to dinner somewhere else.  I wish we had another ","useful":0,"cool":0},"LRscLe4CfVnJ4AnCIKybsw":{"text":"I've always been a fan of Delachaise. It's a cozy little nook. Best variety cheese plate i","useful":0,"cool":0},"VNpyKCzVZ4ciRvIrfNaKHw":{"text":"\"You mean the place that looks like the streetcar?\"\n\nI really like the Delachaise, but it ","useful":5,"cool":3},"VrhOO0BAZZrYmroaDYcnPA":{"text":"Summary on several visits:\n--really a friendly place with low key patrons. Ok for non-loca","useful":0,"cool":0},"0nS6oz8jt9FBjYHBVBKs-A":{"text":"Wandered in and had the most perfect lunch. Great fries and the Boz sandwich, homemade oli","useful":0,"cool":0},"UvMig8Fjqlm0NqRWSwJi6w":{"text":"Cute little place right on St. Charles Ave.  Great spot to meet friends for a glass of win","useful":0,"cool":0},"M8gS3ZHbOFo0oeCYtwDmSQ":{"text":"If I'm not home, I am probably here. This bar is intimate, romantic, divey, small and big ","useful":1,"cool":0},"LNt-nK9ITVrTrfoSbt99Aw":{"text":"I must say I'm a fan of any place that can whip up a proper cocktail.\n My favorite cocktai","useful":2,"cool":1},"wfseSh0Ca70q5vmVaTlafg":{"text":"Really good food with an excellent wine and solid beer selection make for a break from the","useful":1,"cool":0},"nCYfYZoOWnqgp-cifJdpdw":{"text":"So food was decent once we got it, but everything else was horrible and my friend and I we","useful":1,"cool":1},"Mywen4vxYlLfSbM0Bcs5Nw":{"text":"Delachaise is a bar to check out if you want a nice atmosphere and good food and drink.  I","useful":1,"cool":0},"4gLb30WLIkctX0DdYTYjaQ":{"text":"Delachaise is stumbling distance from my house. Operative word here being \"stumbling.\" I v","useful":5,"cool":6},"SA49eDVDb9oUdVuNRXZzKg":{"text":"Been here three times. My favorite thing about this place is the daily wine specials. $5 f","useful":1,"cool":0},"2QJ3QFlR4RFVVQSudjA2PA":{"text":"Great late night date night spot. Beautiful interior setting and nice little patio area. W","useful":1,"cool":0},"AKgm0mFMShXrZGT3znaSSw":{"text":"This is a great place to take a girl on a date. We come here regularly. Although I read a ","useful":2,"cool":2},"PhDChJwAANe5FTRhlCPyVw":{"text":"The Delachaise is a small, cozy spot perfect for an intimate gathering. Wine and whiskey s","useful":0,"cool":0},"6rq-mDJs84UbiLPH8YSPBw":{"text":"What can I say. was taken to this place while visiting.\nHorrible food, terrible service, e","useful":1,"cool":0},"MKasDcu7tu0sl61kE5EzPQ":{"text":"One of my favorite spots in NOLA. It's kind I quiet and small, and the food and service wa","useful":0,"cool":0},"0bVLFfrFZf3QrK222ufjDg":{"text":"The Delachaise is lovely. It is the perfect place for a romantic date or to catch up with ","useful":3,"cool":2},"xGMKAGlRfz_BqovOR6ql-w":{"text":"Thank you Sam and Chris!!! You make wine tasting in NOLA an attraction Not to be missed!!!","useful":0,"cool":0},"MkjfOwF3EddCRPTk49XSzw":{"text":"One of my favorite places to grab wine and a bite to eat! Always have a great selection an","useful":0,"cool":0},"cxHOU7gw29EUs4kKJfb1fQ":{"text":"Great food! We had the steak with Pomme frites and muscles with Pomme frites. The steak wa","useful":1,"cool":0},"RtSPt_iT7fKrq9XhW86SPQ":{"text":"This is one of the cool places in town to grab a drink with a European vibe.  Constantly v","useful":3,"cool":1},"vcUXgruXYlaAcHPtOv6OXQ":{"text":"The Shrimp Clemenceau, meatball poboy, pommes frites tossed and fried in goose fat, a vari","useful":0,"cool":0},"Gu6tq-y6OTM53j_2ZDRdmA":{"text":"One the most relaxing bars in New Orleans. The beer and wine menu is expansive and include","useful":1,"cool":0},"FZq0TiozvDHTpxUqa1EJsg":{"text":"What a dirty place! Do not waste or lose your time here.  This place is full of losers!  T","useful":0,"cool":0},"jaPlzxPL71Al4T_lZZrrIw":{"text":"So my girlfriend took me here and I have to say, it instantly has become my favorite place","useful":1,"cool":1},"naEiXo1fg8hHej2wIRd5ww":{"text":"I love this place. It reminds me of the cafe outside of my after-college-backpacking-acros","useful":0,"cool":0},"PCTFwkJazFk9jf-pKuj3gg":{"text":"Nice for sitting outside and watching the streetcars. Wine is reasonable. Food:  so-so. In","useful":0,"cool":0},"LQF6MIsOf9-ToavEaCHb0g":{"text":"Strangely enough, there is a large wine selection of many horrible varieties.  The bar is ","useful":1,"cool":0},"64pxE-Ndd48T3pHw5MowjQ":{"text":"My favorite spot for date night with my husband!  You can't beat their fries and $5 glasse","useful":0,"cool":0},"y4DU8zdJtGezBYwEQPUKtQ":{"text":"Poor service, middling wine collection, and many rude service members. I'm too upset to bo","useful":0,"cool":0},"pBiqmf6DEpV-f38Y8vKyoQ":{"text":"My favorite wine bar in the city. The Delachaise has hundreds of wines, bottled beers, and","useful":1,"cool":1},"qy2WsFOMLva_RqJTt6uzig":{"text":"Owner is a total db. He wears this cool orange hat during Mardi Gras that makes him look l","useful":0,"cool":0},"XQieWQWTVbMAJaK8D2BvZw":{"text":"I just had one of the top 5 sandwiches in my lifetime here! When you visit, order The Boz-","useful":2,"cool":1},"aVzmwHKwoF88O-TdeVM6Qg":{"text":"I highly recommend their mussels and fries. It's definitely worth a try! The broth tastes ","useful":2,"cool":1},"Ye_G4G4Ba0LEsFssO8gwYA":{"text":"This very well may be the best little wine/cocktail bar in New Orleans! The service is ver","useful":8,"cool":8},"eZyMnUaK4kexoN_lt_KNIQ":{"text":"Bartender was dismissive, disinterested, and looked like she hated her job.  Would barely ","useful":1,"cool":0},"2Fwzv4HRXdwj0MJZPn42rg":{"text":"I don't normally post open ended spacey reviews, but I can't recommend this place enough a","useful":1,"cool":0},"7PTxm5DpeBUHk1NIeJMmww":{"text":"One of the cool places that mostly local people know about. Food, drinks are excellent, st","useful":0,"cool":0},"J2m8J9l1gxROndzZTSf8TQ":{"text":"So as a first timer in NOLA there are lots of places you should most definitely try. Being","useful":4,"cool":3},"t9GXepMLVAO9_3z5mZfarQ":{"text":"I've been here a bunch of times and have always loved it. However this time the service wa","useful":0,"cool":0},"9Zyy2FT7IsjCRpNIfylxbA":{"text":"Visitors not welcome.  This place clearly caters to a local crowd so if you are in this ca","useful":0,"cool":0},"DlFjgcJIoMOSX-EKmb0Y9Q":{"text":"I feel like I should like this place more than I do.  Yeah, it's a wine bar, yeah, they se","useful":0,"cool":0},"HWHbNwwTr5OEkHupoYyH-g":{"text":"Great atmosphere, great selection of beer, wine and bourbon. They also have a killer lamb ","useful":0,"cool":0},"qfvNpyex7RV2CRB0X02zeQ":{"text":"While this is a  very cool place with a great vibe it wasn't all that for me. I did try th","useful":3,"cool":3},"iQo5MIE3PKvXsjpTqhftCQ":{"text":"Great wine specials, cozy interior, and delicious eggplant \"cannolis\" (thin grilled eggpla","useful":0,"cool":0},"rG8L7si1l9fQPRYSvUhrhA":{"text":"Came to Delachaise for an early dinner and was pleased with their food and service. The at","useful":1,"cool":0},"gZlAb1kj-r5sboPEpVv_Vw":{"text":"What if I told you I knew the secret regaining happiness after being delayed and having yo","useful":1,"cool":0},"xCUGOa9HO0E59HiMSnA-aQ":{"text":"Great music. Friendly bartenders. Quick service. Good mussels and frites. And a darling ou","useful":0,"cool":1},"yDirzUDkNkkBDqw-vVgFDA":{"text":"I came for the $5 glasses of wine all day everyday and I come back for the duck fat fries,","useful":1,"cool":1},"WSNeohU-7u5OI67tgXXgww":{"text":"This place is just down the road from where I am living at the moment and while I have bee","useful":2,"cool":0},"AEfU-eFlt_K2PagekxSysA":{"text":"I can't quite put my finger on it, but I just don't love it here. People rave about this p","useful":2,"cool":0},"d1wAwuJhSXG6pPw9Z1n7kg":{"text":"I knew something was up when I saw the bartender muddling fruit when I asked for an Old Fa","useful":1,"cool":0},"qWVdbsRDLQCBV8YYzRZi2w":{"text":"OoOoOh. The Delachaise. After coming here and having a not so great experience (asked for ","useful":2,"cool":0},"ysps_c-vx_rkM-iQVh90Iw":{"text":"I liked this place. I started inside but with the mixture of music and the crowd of folks ","useful":0,"cool":0},"KA0KjPIRGsYLq5KmL2dAeg":{"text":"We went to the Delachaise for a late lunch today.  3 customers there. Got our drinks and t","useful":0,"cool":0},"830n_n---4Jo0ZIiMjAFWA":{"text":"Really fantastic uptown gem.  Recommended as a place to bring a small group or just that s","useful":0,"cool":0},"9FMJYF30IjPi31nPfKDYnQ":{"text":"The lady friend has turned me into a wine drinker against my earlier wishes.  I quite enjo","useful":5,"cool":5},"0f5mI25JnoNGgn6ZWf9_ag":{"text":"Great Happy Hour wines! I recommend the goose fat fries with 2 aiolis! Great atmosphere. G","useful":0,"cool":0},"OjapkhxWfl_aUsDcDRVJEQ":{"text":"This place is my staple and has been for years. It's on a beautiful, mystical spot on St C","useful":11,"cool":9},"Sw48n7FEh5BaACvaOEoEqQ":{"text":"I've been going to Delachaise for years and it remains a staple in my book. Always have th","useful":3,"cool":3},"XP1Rz3iUEjH-oexbFaallg":{"text":"When I lived uptown in the early 90s, I can't recall what was in this Paris metro, art nou","useful":2,"cool":0},"W2VdRm-KMMwT3koh5i2ZLw":{"text":"I liked this place. I started inside but with the mixture of music and the crowd of folks ","useful":0,"cool":0},"NXtWHMxFsqn_Qkz7yFfyOQ":{"text":"It's a very chill neighborhoof bar. Decoration is cool. Food portion is very small (be awa","useful":1,"cool":0},"PhNldVpeERermhQOaLNxbw":{"text":"It's 7:30 and you're uptown New Orleans. You want **good food, ***good libations, and a ro","useful":3,"cool":2},"KNY8X0-hW_YiUv9Xukssbg":{"text":"Delachaise has become my new favorite restaurant now. I first came here during Mardi Gras ","useful":1,"cool":0},"AUA1RbCo4XlDxUSeN-Mc7A":{"text":"A little on the pricy side, especially considering there is no table service, but not a ba","useful":1,"cool":0},"vnNnEtvou4Uxec5r-HdM0A":{"text":"I used to be someone who regularly ate/drank here. I've had, as well as heard from other p","useful":0,"cool":0},"zpHo0GNYU1R2FRuy3DlN1Q":{"text":"I'm definitely a fan of Delachaise, and will be returning again. I started with the cheese","useful":3,"cool":3},"qB3L9iLIwDX8blbctJthLg":{"text":"an unpretentious wine bar with yummy small plates.","useful":0,"cool":0},"a5qXmWZ_KTO54zBRI79OMg":{"text":"OoOoOh. The Delachaise. After coming here and having a not so great experience (asked for ","useful":4,"cool":2},"1k3D7IFOg7-C2XD_VOJQQA":{"text":"Great wine bar uptown! They have a solid wine selection (with $5 house wine), beer options","useful":3,"cool":1},"ZuTIpI3lgRAncF-i28FAnQ":{"text":"Fun wine bar. Fun to share a bottle and some fries with friends! Even in the heat I still ","useful":2,"cool":1},"4OKkt6Q4fTCMlLAKANm7Kw":{"text":"I'm here solely writing a review on the atmosphere and one drink that I had, so just know ","useful":0,"cool":1},"3mv6cnAP0kfXA9HEvNmwdg":{"text":"I love this place. I've been going for years as my \"fancy night out\" spot because they hav","useful":1,"cool":0},"VtSgB9THKJnkSihSEWb9Yg":{"text":"My friend and I stopped here to get a glass of wine before we headed out dancing \n\nWe seat","useful":1,"cool":1},"8uCxaSSaOONGgn96oy-izg":{"text":"absolutely THE WORST dining experience I've ever had in New Orleans...to clarify: stopped ","useful":3,"cool":1},"5MzBuwudBHX1MLJfEJy-eA":{"text":"Best place for drinks. Friendly staff and extens bar. Check it out. No disappointment","useful":0,"cool":0},"lz5ebEBd2UR8yO13zsiaig":{"text":"The Fried Frog were lightly fried and tender in every bite. The Sauce on the legs give it'","useful":0,"cool":0},"5SKA5rz24U45XAd3mao3xw":{"text":"Wow! Don't be swayed by the unassuming look of the building from the outside. Inside The D","useful":1,"cool":0},"Hq8aA6Hr8fC2xfQZKuaqog":{"text":"So let's start by saying the bar staff were so nice and helpful and knowledgeable. They he","useful":0,"cool":0},"6Ujyfw7C9goig06h7j_EMQ":{"text":"Definitely a neighborhood gem! I've dined here a couple times. Each time I am impressed wi","useful":0,"cool":0},"ibKTPo9B1wAORIVIyFQPdg":{"text":"My favorite bar \nBartenders are great!! The fries are the best thing ever!! You can mentio","useful":2,"cool":1},"psM3IlBXsgww3DMXLe2iJg":{"text":"Watch the street car wiz by while sipping a glass of wine, or beer if thats your thing.  T","useful":5,"cool":2},"A9Y-6ml-hR-BMah6MWNcqg":{"text":"Ok everyone that lives here already knows that Delachaise is the absolute best, but let me","useful":0,"cool":0},"xqAMPwUar6TRiyq1BAWyNg":{"text":"An extensive bar with a huge selection of liquors and wines as well as a great kitchen!\n\nT","useful":11,"cool":6},"9HJdFsc4vtzuyBXRz2OsYQ":{"text":"As a Cali girl I will tell you STRAIGHT-UP it's NOT truly a \"wine bar\". Wine list was weak","useful":6,"cool":7},"Q5yRbgxoMbY2dT52qY4erg":{"text":"I've been here 4 times and I cant complaint...actually I'm always impressed with the amazi","useful":1,"cool":1},"Hft5GIyn6c43afJmoW7hew":{"text":"Rudest douchebags behind the bar at the st Charles street especially the little short guy ","useful":0,"cool":0},"FTlmqEcjp8wHPwgrGpC4hA":{"text":"I visited this bar on a one night occasion while\nPassing in the neighborhood. Unfortunatel","useful":0,"cool":1},"D0SSVfeIp8s11Gbx6uz9Zg":{"text":"Absolute delight not sure what's better the service or the drinks. I traveled here from Da","useful":0,"cool":0},"DXXScHIyHNsVOXjs7NvohA":{"text":"WHY would you cook up a crispy fried frog leg and then daub it with soggy sauce? Visited a","useful":2,"cool":1},"BnobyIgrbSqiVDz1gBvdDA":{"text":"Sure, it's a wine bar...maybe. That's very limiting. Let's just say there's an emphasis on","useful":3,"cool":4},"0Nis1VqCm9phXWw5omVzuA":{"text":"The food was terrible and very overpriced. We ordered multiple items- the steak frites was","useful":1,"cool":0},"soCTIOnUN8fTMUDGrJlI-Q":{"text":"While strolling the streets following dinner, we came upon this adorable, hip spot. The st","useful":1,"cool":1},"1NMVjALR0lMKbkap2uhCaw":{"text":"From the outside it looks like an old streetcar that has been unceremoniously dropped on S","useful":1,"cool":0},"h51aP9QABV5cneLBWaiucA":{"text":"This was a fun little wine bar. Admittedly the wine and beer were overpriced for what you ","useful":10,"cool":10},"hBH15m4BVqOzoZK1UjooOA":{"text":"What's the big deal about these goose fries?  Really they are not all that. Mussels were t","useful":1,"cool":0},"XLJdvELr2V8lGV8rIH773g":{"text":"My favorite wine bar because of its extensive selection, outdoor seating and romantic sett","useful":1,"cool":0},"iI0dvexpExQxL2n-GJFlNQ":{"text":"Great service and environment! Love the people that work there as well! Got the chocolate ","useful":0,"cool":0},"jEdihv18-gt6BpCqpP-2IA":{"text":"Avoid the old bald French bartender. Never met a bartender that was so rude... I'm a regul","useful":3,"cool":0},"tiIRjkRIR6NFN-S7Tx6AAg":{"text":"A wonderful place to relax and unwind with a nice glass of wine. The staff were super help","useful":1,"cool":0},"pUQ3zXYEUaA4VcZdZiZzYw":{"text":"My sister brought me here over Christmas break - she loves this place and comes here a few","useful":1,"cool":3},"Ne_cVXwwO14tda6SZ__Wog":{"text":"Delachaise is my one of my favorite spots. It has a chill, relaxed ambiance. My friends an","useful":1,"cool":0},"J6R_kNSjL9IHU_acZ14wVw":{"text":"Soo good!! I love the vibe in here, the drinks are great and the food is also super good. ","useful":0,"cool":0},"20G32c8vK82Rwgaodlxa0w":{"text":"So cool! The service was awesome (you MUST get Sam as your server!). If you get anything, ","useful":1,"cool":0},"nJzeIXkWgrg3QcPiETP76w":{"text":"I have been to the Delachaise a handful of times. They have great drinks and endless drink","useful":1,"cool":0},"36JysRX-U7tbDOWm2npxdw":{"text":"Fries and mussels still great but the flank steak bruschetta is a complete joke compared t","useful":1,"cool":0},"W6KDZebjL-rZiZbpSN5svw":{"text":"A relaxed, cool, and warm venue. The Christmas lights are so precious. The fries and garli","useful":0,"cool":0},"VptrT8zFoLQtSD8zmUoNEw":{"text":"Walked in got zero greeting and completely ignored by the person working. There was two ot","useful":0,"cool":0},"dux8dJLthguUZC3fNsBi-g":{"text":"The Universe brought me to the doors of this cozy wine bar on a rainy winter's night. You ","useful":9,"cool":9},"SG9KmT9-ug3tLC_cK8Wn1w":{"text":"Delachaise has good food (although don't expect a full meal if you're a big eater) and a g","useful":4,"cool":2},"mkQQWJfSWAfk2yd7pUAfLQ":{"text":"This is a nice place for a happy hour. They have some $5 glasses of wine. The fries, as ev","useful":2,"cool":1},"P8MLv2TmFU3Q2b9VESSmNg":{"text":"Last minute invite from a friend to grab a late dinner and a cocktail. Seating  was 1st co","useful":0,"cool":1},"QscuHIGEOtmKn8lP_aJwkw":{"text":"I've been here probably 8-10 times over the last couple of years. Love the wine and liquor","useful":0,"cool":0},"KTF_ExGkIz3HMJt2AV9pGw":{"text":"The restaurant artist complained about performing for gays. This made for an overall intim","useful":1,"cool":0},"SSiI56YxHOGDHpkdc_oXiw":{"text":"I take anyone who comes to visit to Delachaise! It's a nice spot to hang even on weeknight","useful":0,"cool":0},"KKipWeCqqQoqSrlFM9IVcQ":{"text":"A lovely little spot with good wine, a nice outdoor patio, and friendly staff. \n\nWe enjoye","useful":3,"cool":3},"TdW2yS_X5cUIJS1mw4lIcA":{"text":"A letdown.  Stopped here for a cheese plate and charcuterie, with wine and beer.  We chose","useful":1,"cool":0},"9djUsCAwfkFW_n0RXRWWYg":{"text":"This is an easy 5 star review. I've passed this place running and driving a million times ","useful":1,"cool":0},"rFgygfqeY9Vo4wkRrCRH8Q":{"text":"I took a couple out-of-towners here on a Wednesday night around 12. It was not crowded, se","useful":1,"cool":1},"TZWDuc8yBbvlUTTGoMEyCA":{"text":"It is a really cute little place to get late night food and drinks. Really good mojitos. T","useful":1,"cool":0},"oAxuLsrmVtBLsz3wwwGl8Q":{"text":"Love this place! Great selection of wine and food is real tasty too. Order the Duck Fat fr","useful":0,"cool":0},"IdEFKMObYh1d8PiG-qc_5w":{"text":"So cool! The service was awesome (you MUST get Sam as your server!). If you get anything, ","useful":1,"cool":0},"bQPZq_839ngpLlxHjPlulg":{"text":"I love bars and restaurants with a view of the street. I can't explain why, other than I l","useful":5,"cool":3},"fIr_z67RdRwQ2wbhwIHJUA":{"text":"The bar staff is awfully arrogant. It's one of my favorite girls' night spots in Nola but ","useful":1,"cool":0},"xdVJ-AmUSfUtbQQgU_9T2A":{"text":"Classic cocktails, wonderful scotch list, great daily specials, goose fat fries... What's ","useful":3,"cool":2},"qG4rpgmGcCwTR_BXeW3wow":{"text":"Excellent wine selection, and beer.  Love this place for later night food when you weren't","useful":0,"cool":0},"4NVp2VpmL-MsptYxMc8SJw":{"text":"Love Delachaise! I've been coming here since my college days, which was years and years ag","useful":1,"cool":1},"mLw9WPJupywwna_DFENSFA":{"text":"Great place to hang out and catch up with friends. Very cozy tight fitting inside, but out","useful":3,"cool":3},"KOXNoJ684o7ieiANyxyIwA":{"text":"LOVE!!! Excellent wine bar! Hubby & I L.O.V.E The Delachaise! \n\nHubby & I slept thru Sunda","useful":10,"cool":12},"wRfM_0hkTnVsCCxo0dM9Fw":{"text":"This may come as a shock to anyone who knows me, but... I'm somewhat of a wino. That's rig","useful":17,"cool":8},"FmthDYEJsogKMgH2Nm9dOA":{"text":"Stopped in for a little snack.  Had a bowl of moules.  Best I've had since I last lived in","useful":3,"cool":2},"okiOFUHcBFsNfADV6i_eWw":{"text":"The atmosphere & food are great.  ... But the seating arrangements leave much to be desire","useful":0,"cool":0},"feED2P_rO66PW48Gc5dqKg":{"text":"This place has great food but the service could have been better. The hostess rolled her e","useful":0,"cool":0},"qv_OHrELx_yIf_y9U-zTZQ":{"text":"This has become one of my favorite places in the city.\n\nSince my review over 2 years ago, ","useful":9,"cool":4},"Jq_Ifhhgw8JbgcuoSP8d3w":{"text":"How does this place stay open? The only French  thing about it was the crappy service. The","useful":1,"cool":0},"un9A2vzYOvdfg98ebbVLVA":{"text":"Horrible experience... .\n\nThis time I'm playing tourist in New Orleans where I am a little","useful":1,"cool":0},"Hht2oYtdGuUOcvtKY-hxcw":{"text":"Being able to walk here from my besties house is so clutch! Sipped some Trulys on the walk","useful":6,"cool":5},"MnU9aXmr8Wegqgpu8WS4iA":{"text":"Everything was excellent... loved the ambience. The shrimp po boy was out of this world as","useful":0,"cool":1},"AgQIvCXgdnTOywEkERRH4g":{"text":"I'm positive this is my new fave date night spot! My boyfriend wanted to go on a date and ","useful":1,"cool":1},"uXM8cgmB5850uRj2LYpSTQ":{"text":"Great Uptown spot on St.Charles where it's all about the drink and food.  Intimate and coz","useful":1,"cool":0},"n1Y6ySNfV1Tp8nICA5q6Aw":{"text":"Found this CUTE little neighborhood wine bar while on a recent trip to The Big Easy. Fabul","useful":4,"cool":1},"I5n88UmaVguc6YApfvd26A":{"text":"absolutely love delachaise. fantastic service and friendly staff-thank you for being open ","useful":0,"cool":0},"Yx2I_rJi4Gl1Mpi4SuOI8Q":{"text":"Unreal selection of liquors, completely unreal quality small plates -- it's not often that","useful":1,"cool":1},"xeB_U0b9a45X7C8Jt8UdjA":{"text":"Love love love this charming wine bar! It has a chill ambiance and is great for casual dat","useful":3,"cool":2},"OuFShZALDuaceR_9KvPucA":{"text":"If there was a way to post a review with zero stars I would have done so. The food was med","useful":0,"cool":0},"NXJ3ep64WdTtm0PwTuVBJg":{"text":"Every time I visit Nola I go to the Delachaise wine bar, in the lower Garden District... I","useful":1,"cool":0}}