{"3JLymqIC6akBTYOqvzO8vw":{"text":"Stop, DO NOT GO HERE!!!!! \n\nOh where do I begin.\n\nFirst, we had to wait for a hostess as s","useful":4,"cool":0},"DlACSMZpcuvdH6wQPYv90w":{"text":"Awful tourist trap. My Caesar was drenched in dressing and lackluster. My crab cakes had l","useful":0,"cool":0},"pZPH4D8YDmVkCNFhl5sHWw":{"text":"Plenty of time to write this review as I sit and wait for our meal here! We came because I","useful":5,"cool":1},"9WJEG8QMaGWH_SE1VP6M2w":{"text":"After a night on Bourbon St, we were looking for a place to recover. We chose this place b","useful":0,"cool":0},"jlkFXVQnscPOkC2n_EaXbA":{"text":"Food was mediocre, as was the service. \n\nWe had fried pickles,  fried crab claws & charbro","useful":3,"cool":1},"9KpfLDkFpmAs8UV_H5fdJQ":{"text":"The Crazy Lobster is ok. I got the crab cake and a shrimp po boy. Living in Maryland I hav","useful":1,"cool":0},"mmZ_Klu1nZGK-KYmUfRYIg":{"text":"Stopped here for lunch on Saturday the 18th. It wasn't our original choice  - it's been aw","useful":0,"cool":0},"U1yCofye6mlKMN0Ros_M1g":{"text":"Ok where to start, my husband and I decided to have a margarita each. The waitress told us","useful":2,"cool":1},"LXqopmMLWaD9wgmpOLdbwA":{"text":"If you go here I agree sit outside!!  A group of us went there for lunch and sitting on th","useful":2,"cool":1},"YhcMCiRqtdJAtC4O3-eGrg":{"text":"Excellent charboiled oysters. 2nd time coming and they never disappoints! Fun live music r","useful":0,"cool":0},"dTL0nh9B2j-lRr-9HR-TCA":{"text":"My husband and I went there tonight for dinner and we're glad we did. We had the crab cake","useful":0,"cool":0},"BEXKY9u7K6HXmyva441fbg":{"text":"My sister and I sat at the counter and had to move to the outside because of some putrid s","useful":5,"cool":0},"NDIhV2hVyoMBuOTBeB4Ghw":{"text":"I will preface this review by stating that it was indeed some time ago that I actually att","useful":5,"cool":0},"LZU_6MsHZtJPH0BBI85Mew":{"text":"The streamed shrimp plate was so amazingly good I came back the day after and ordered the ","useful":1,"cool":0},"IfGTA6ujDb9a3WScEo2D-g":{"text":"The worst dining experience ever. Do not go there. Everyone was grumpy and clearly made it","useful":0,"cool":0},"2Eu-urRztAoR6oz3P-nR-w":{"text":"Nice little spot on the river. I had the snow crabs, char grilled oyster and cup of gumbo ","useful":1,"cool":1},"9McKxkevt1OntnUAqt-h5w":{"text":"The drinks were very weak.  The Catagory 3 drinks could be number 2 or 1.  Please ask them","useful":0,"cool":0},"iAHBTwI25X7Lrvf2d_tbHw":{"text":"1st meal in New Orleans.  Don't understand negative review. It was just 2 for lunch but it","useful":0,"cool":0},"Qh0jq75wmxneg1qg1yMvmg":{"text":"Came to Poppy's Crazy Lobster because of a deal that we found on Groupon. It was very clos","useful":0,"cool":0},"tEQikZjVHe20yLAIjR4YwQ":{"text":"This is the type of place that you visit each and every time you come to NOLA...or at leas","useful":0,"cool":0},"3oeCx6f3IaoHFOdhfSMSBw":{"text":"Good tourist place. Limited vegetarian options.\n\nThe staff is friendly and attentive. It's","useful":1,"cool":0},"1qeStxT4vK0vQWulBTmsEg":{"text":"The only few good things I can say is the waiter was fun and really nice and the drink was","useful":1,"cool":0},"IsDEAZV_M7lEoa1u_NbNmg":{"text":"Place was good. Baked Oysters were really good but their crawfish was the best I ate in NO","useful":0,"cool":0},"Zs1Y8FCLKdwm5PcvNFLzow":{"text":"One of my highlights of being in New Orleans was visiting this restaurant with a friend of","useful":2,"cool":4},"9k9KwrrDu1E0ZWPjgwEDKQ":{"text":"Had dinner (the fried shrimp and catfish). The shrimp and catfish were cooked perfectly. T","useful":0,"cool":0},"UZ2ED6d5lXO9fmDcKL-w_Q":{"text":"I've had better sea food, but this is just a fun place to check out.  \n\nI have to give thi","useful":1,"cool":0},"4clBurMBD8D28godxY2DAA":{"text":"Waited 35 minutes. No water, no drinks delivered, no one took our food order. We finally a","useful":1,"cool":0},"g1wo567BaSvX9-nSxj7Tig":{"text":"Showed up around 5:00 pm. We were promptly seated due to a lack of patrons. After sitting ","useful":0,"cool":0},"L-JfwJI1iaAotdZzfKkFtw":{"text":"Had the gumbo & seafood tower which were truly enjoyed this trip. Then the great & attenti","useful":0,"cool":1},"2sQCPn3AFkMw5kh1fKhvhw":{"text":"I'm from San Diego and purchased a groupon well before my trip to New Orleans. My wife and","useful":0,"cool":0},"O7nDRkaOGHSn0KqBkzsdSA":{"text":"Should have listened to the reviews. The service is VERY slow. And the food is WAY overpri","useful":0,"cool":0},"le6j6G5jl8TqRBgzHo1BzA":{"text":"Tourist Trap! Poor service; staff had poor attitudes. I simpy walked out. There are too ma","useful":2,"cool":0},"QUkf0bP7TOw_2FRv_C2dqA":{"text":"Was okay.  I ate the Crawfish étouffée.  Was expecting spicy but wasn't.  I was disappoint","useful":0,"cool":0},"gm6r6J83PBh0skfHsKcpTg":{"text":"We arrived there and it had just poured rain. They was doing construction and the place wa","useful":1,"cool":1},"j2sR8DFxEuYBpefhkiabeA":{"text":"Was here for a private party. Since it was cold we took over the inside part of the restau","useful":0,"cool":0},"vMDiZPhD3DNc3MRuO9lk5Q":{"text":"Nothing nice to say about this place.  Huge tourist trap to catch the people staying at th","useful":0,"cool":0},"mkyJ19jqHBLnRFHELdCU7g":{"text":"Loved it. Would recommend to everyone. \n\nHusband and I visits around 6pm Saturday night. W","useful":0,"cool":0},"WWubMwn1e6Q73q2f7pZx5A":{"text":"I sat in the crazy lobster for 30 minutes on a Sunday evening. It was not busy at all and ","useful":0,"cool":0},"QJrMPKbTh_LJLEhKlil_jw":{"text":"We came on Saturday night at a busier time oh the evening so definitely not gonna expect t","useful":0,"cool":0},"Nk9nJvKtsBsUP5Ay5dK8Yw":{"text":"Terriable we came in 2011 this place has gone way down. We sit down outside and watch the ","useful":0,"cool":0},"laS6uqWpf_o0j9g8uaHMcw":{"text":"Kellie was a great hostess. Smiled, inviting and also accommodating with a cranky child. S","useful":0,"cool":0},"ItkTpGsn6QdCM64tEJuZtw":{"text":"It was near our hotel so we decide to try it. My boyfriend and I ordered the bounty of the","useful":1,"cool":0},"9l62HjrlZFDsdUt7feW9rA":{"text":"All of the food that we ordered was very tasty. We had Alligator Sausage, raw oysters, cra","useful":1,"cool":0},"31ek_V6fZOgVwOU4s3W-Ww":{"text":"I went here while at my Family Reunion this past weekend.  We waited too late to eat and e","useful":0,"cool":0},"vl4TkQhd9YWgT5i2-Y_Vhw":{"text":"On a week night several co-workers and I went here for dinner. We had several dozen grille","useful":0,"cool":0},"WkrjIBmyj2AsXF7cTNhuyA":{"text":"This rating would had been higher if the kitchen/servers were a bit quicker. The char-gril","useful":0,"cool":0},"Tg4Ufrpoirw1FJDDL2cOjQ":{"text":"I had the crawfish. The only thing that was good was the rice... Yeah...nice location but ","useful":0,"cool":0},"sgsUT0STgJ36Dx3dp9e5Hg":{"text":"My wife and I went here because it was off the river and we love riverfront restaurants th","useful":0,"cool":0},"2jd31rAWfpocVOFa5i0l4A":{"text":"We ate here a few years ago and loved it. After the bad reviews, I wasn't sure if it went ","useful":1,"cool":0},"P3dtKH8N201ZVWq8yLwgUA":{"text":"We had terrible service here. Not only did it take over a half hour to get our drinks, but","useful":0,"cool":0},"wnVfsraxv1XUKS96fBFJtw":{"text":"A Groupon brought us here initially, the delicious Bourbon Street Combo brought us back.  ","useful":0,"cool":0},"wpjsWrCD6sX3S-5V-1vwPQ":{"text":"Waitress was very friendly to us and took care of us.  Even after we threw down the groupo","useful":0,"cool":0},"28tQKL-q17zkkNtyqIzwmA":{"text":"I have eaten here several times in the past. Well. Things have changed. My family was look","useful":3,"cool":1},"TAmA-G3KSMub-yRFW2jDUw":{"text":"On our first night we went to have dinner at. Mr Ed's as we are relying on the review. To ","useful":0,"cool":0},"V7xMj6pjqIJmk_DszyYU4Q":{"text":"We went here to eat after spending the afternoon at the Audubon aquarium.  It was a short ","useful":2,"cool":0},"WIVzfn0_5DNA0o2njwKzxQ":{"text":"This is my second visit here.I had their shrimp and grits both times because they are very","useful":2,"cool":1},"WSk8ZbX_65ONyfRzIUXJ_g":{"text":"Great location on the river with outdoor seating.  The food is ok.  \n\nI had the crawfish e","useful":0,"cool":0},"mLv887qpZzShJ0dyxmy0Mw":{"text":"Restaurant was really good. Gave you enough food to get full but was good enough to make y","useful":0,"cool":0},"9o2Pq9EwOVlS2LDA8Uqr3g":{"text":"Very pleasant surprise! Touristy, as many others have noted, but fun! Drinks were good, ou","useful":0,"cool":0},"XzjuQZRgiGmm_T9HXunBXw":{"text":"If you want gulf oysters on the half shell, this is DEFINITELY the place to go. Delicious!","useful":0,"cool":0},"jYTkQWK281LFWG8ixmRprw":{"text":"Not great, not the worst. We ordered the calamari and alligator to start. The calamari was","useful":0,"cool":0},"b8Oh7sM7JuY2gUnP4Y3DYg":{"text":"One of the better meals I've had this week in New Orleans.  It's right on the riverfront, ","useful":0,"cool":0},"rhckUEd2mMP6YFYsEAjvog":{"text":"Go and have the mahi sandwich, it was delicious but don't expect great service or service ","useful":1,"cool":0},"m0AfX6hH6Bic5s8IPHakfg":{"text":"Save yourself the trouble. Our food was decent at best, but our server made the experience","useful":1,"cool":1},"_dsVEWDsduipKfCtUID8jQ":{"text":"Came here on a crowded Saturday. The line was long but the wait was much shorter than expe","useful":2,"cool":0},"IZ9E3a3lSzfRhN_gMLCxgw":{"text":"Tourist trap.  Got stuck going with my in laws.  \n\nFood.  Overpriced and lacking flavor.  ","useful":1,"cool":0},"Zc7WqhW-NL4HB3T0DbSHFQ":{"text":"Everyone says dragos or acme has the best chargrilled oysters, which trust me, they are am","useful":0,"cool":0},"4P5dfaL5DBpFRsmIci0jWA":{"text":"The Rolling River drink and char-grilled oysters were delish! Great live music too. The se","useful":1,"cool":0},"FOnB0JYspINGIiwm4f50Jg":{"text":"I've come here every time I visit New Orleans! It's quick, relatively inexpensive, and inc","useful":0,"cool":0},"k5OtHzeeYjN9L97fjpOxWQ":{"text":"All the workers seemed not happy to be there . I get that you are at work and you aren't t","useful":0,"cool":0},"rnGgL2MG8LHDH8nCjHQUsA":{"text":"If you're hesitant about this place, check out trip advisor and see over 1000 reviews. \n\nP","useful":1,"cool":1},"XVAjHJUTsQxCTXDwnzMoLw":{"text":"Great place.  Your typical Nawlins seafood place.  Had the Shrimp and Crawfish etouffe.  I","useful":0,"cool":0},"DFKzkuGuBZMKNsuXi7BDOg":{"text":"We went for a lunch with my bf and it was the most delicious food I had the coconut shrimp","useful":0,"cool":0},"npS3FxrlcgMmScn-fZpVKg":{"text":"Overall disappointing.  Had the crawfish etoufee, and it was bland.  \n\nAt a place like thi","useful":0,"cool":0},"4TLMKIDMMqqSawrTwAiUfw":{"text":"Cruised in for a quick lunch, ended up gorging on a dozen oysters, a plate of jambalaya, a","useful":0,"cool":0},"iP680YtkBqLZNCEmSd--9g":{"text":"Yup - This is a tourist oriented place int a tourist oriented location. Prices are high so","useful":0,"cool":0},"kMXgg5i6wmTzhXpDKP3NrQ":{"text":"We arrived at 5:30 and the restaurant was empty. We were seated immediately. Our waitress ","useful":0,"cool":0},"KHMF_k5r9Nsv_KiFbs4rxA":{"text":"Food was ok, service was ok. price was expensive for what you got. but it was close to the","useful":0,"cool":0},"Q58ef69YF51z6naKfhW8CQ":{"text":"I went to this restaurant with high expectations based off of reviews. I was highly disapp","useful":0,"cool":0},"RpDaNdVAOmuqu9YBLtXArw":{"text":"If you're just plain starving, then come here. Certainly not good, but not God awful eithe","useful":0,"cool":0},"RLzkFhUvnFzKhQV1SNfckg":{"text":"There is an option to sit indoors or outdoors and we choose indoors. (It was 90+ degrees!!","useful":0,"cool":0},"B6kCQ-qtnjbVYCKuWy76Xg":{"text":"This place is great! i had the jambalaya and calamari. I have never tested it in this mann","useful":0,"cool":0},"TcOqcpYRlHg4UD3Ln_vAZA":{"text":"Quite easily the best red beans and rice, and catfish!! Eat here...you won't be disappoint","useful":0,"cool":0},"8hSBGVg586CbXG7XksvmMg":{"text":"The food was delicious.  Ordered the crab and lobster bowl.  EXCELLENT.  Our waiter Chuck,","useful":0,"cool":0},"YZzFZc94SXtqlB3l517I-A":{"text":"Our waitress did a really good job providing service among chaos. Around us people were ge","useful":0,"cool":0},"0tBmNgxT0U77s01wM0NxUQ":{"text":"We went to this restaurant on the recommendation of a friend.  We decided to go on the 1st","useful":4,"cool":0},"aLlTXa2uZi7Ii8FmqZdtgw":{"text":"Piss poor management &service. Ordered fish plate and got chicken tenders after waiting fo","useful":0,"cool":0},"_ht-gSGmSVHsNAwW5l4tiw":{"text":"Don't let the casual appearance fool you. There is just something about a live band playin","useful":1,"cool":1},"KxdTcbdyetPf8OMAzJJUmQ":{"text":"This place and nice with a great waterfront view. Order the calamari appetizer! Wasn't a b","useful":0,"cool":0},"g1xG5rB5DD4GzAv4rAlnnw":{"text":"I took my family here for a birthday dinner, Food was very good ,the prices were a little ","useful":0,"cool":0},"knK3AkP7Sg0xlHnY9clBtg":{"text":"Even with the bad reviews, I figured it would be worth it to try the Banana Foster Cheesec","useful":1,"cool":0},"BoQJIjHJIYj9BmEnWCF2Fw":{"text":"Are you a tourist? Are you too lazy to walk a block to check out any other restaurant? Do ","useful":0,"cool":0},"iKpzt-u3EaEPM5XkcrLbLw":{"text":"The acting on the \"reality show\" Mystery Diners was incredibly horrible. Shame on you for ","useful":0,"cool":0},"za19cP0O5QAD-mW0k8ZpTQ":{"text":"We ordered two of the seafood buckets but they were out of crab legs and did not offer a r","useful":0,"cool":0},"sN6HHcdkHX_Jl1kCelWrMw":{"text":"Used a groupon and we ordered the Seafood Bucket.  Not too bad.  The mussels and clams wer","useful":0,"cool":0},"ykBhNKGxJV1eBsiXIM4Itg":{"text":"This was recommended to us when we arrived in New Orleans. It was very slow service and pr","useful":1,"cool":0},"jKeigUYBjhnbergG2T-MrA":{"text":"Definitely have to thank Groupon for allowing me to try a place like this for half off. Th","useful":1,"cool":0},"5mBHibMWFkW52ODMBINbng":{"text":"Super adore this place! Must have been our waitress, Brittany, who was amazingly sweet and","useful":0,"cool":0},"jxDYrdEMpzQvA2rbFmMoIA":{"text":"My experience here was amazing. The staff is super friendly, attentive and energetic. The ","useful":0,"cool":0},"B8hOz4buWOfT_tn88IdJNQ":{"text":"The service is great, the food is good but it's a little pricy and their steamed seafood s","useful":0,"cool":0},"s-YBEiuW9j3m4OkT6s7AVw":{"text":"Good spot. Very touristy but fun and great location being able to eat outside by the river","useful":0,"cool":0},"Dc3NpIxdIEMo7aGWG8RsBQ":{"text":"This touristy spot had good food and a nice location. The only issues was the hostess that","useful":0,"cool":0},"lvMeDHRBqVeYF3frb43N0Q":{"text":"I liked the hushpuppie the best. drinks are very watered down and not fancy. nice view. we","useful":0,"cool":0},"njv4JK4RImAegJ-H4CAPzw":{"text":"Sick all night after I ate the Mahi. Could have been something else (no, i wasn't drinking","useful":0,"cool":0},"1OrCN2GQ7V1bxJB7PcSvBg":{"text":"Drinks were GREAT thanks to Rochelle and thank you to the staff shucking and broiling oyst","useful":0,"cool":0},"3ccZwsnyWLwyKs1PsxLMFg":{"text":"Great service and food I really enjoyed the mahi-mahi sandwich. And their fries are excell","useful":0,"cool":0},"GLJE6iB1fs-3SamdrMFKmQ":{"text":"The food is great. We went twice and the wait staff was rude and acted put out to have to ","useful":0,"cool":0},"3Erk_OE3UOR3dombIfHsSQ":{"text":"Great seafood off the harbor with live Jazz and blues. really had a good time here.","useful":0,"cool":0},"UjzEyF4t4iV2KoWraNb7kQ":{"text":"I love this place! I have never gotten a bad meal here and come here every time in visit N","useful":1,"cool":0},"M1fmW6kAPKL8w_8IL8R5Pw":{"text":"Lunched twice at this place, loved it. See my pictures in the picture list.\n\n1st round: 1/","useful":2,"cool":0},"L5eBdw6YtB17B2i5n1YNaw":{"text":"If I could give crazy lobster a half a star I would not even give it that there is no way ","useful":0,"cool":0},"_riViAwWr1pYn0JeyeQXCQ":{"text":"Hostess was not hospitable and seemed as if she did not want to seat us. We were told we h","useful":2,"cool":0},"ye9tKKJjdDeq61R4p0e4MQ":{"text":"MMmMMM seafood and steak in the open air on the water!\n\nCons:\nTap water cost $1\nThe table ","useful":0,"cool":0},"WDWRyEtUJrqcq4cP3rKjfw":{"text":"Both times here friendly staff and cleanest place we have come across with actually clean ","useful":0,"cool":0},"if2qj7Vb_26iMGHVmb5t6w":{"text":"Purchased a Groupon last minute and went to this place on a late Thursday night so it wasn","useful":2,"cool":2},"U8NV90ECfga522X44DUQVQ":{"text":"food just okay. agree with other reviews, was over priced; although service was good.  go ","useful":0,"cool":0},"LrsUtjZiNvweFpfCtRyoMg":{"text":"Shrimp and grits were good but I wish the grits were a little more runny.  3 stars due to ","useful":0,"cool":0},"PkThYs-gVRHlDJIz7S_zxA":{"text":"The people were very nice and helpful but the food wasn't good and the place didn't seem v","useful":0,"cool":0},"4-XixxZr4PFxA9HxrjtuwQ":{"text":"Strong drinks. Average food and service considering the fact they are right on the water f","useful":0,"cool":0},"mqRAJAxIr3_lLVkKahvAnw":{"text":"Stopped here after shopping at the mall to get a drink and appetizer. We had the calamari ","useful":1,"cool":0},"ph9a-_1WO3wIz2A_32e7fw":{"text":"We ordered a $41 lobster roll to share and the bread was dry and stale, lobster over cooke","useful":4,"cool":1},"QPGcK5Z9oy3lfSKHOBvmng":{"text":"Used a Groupon here. The oysters and calamari were good. The crabcake, jambalaya, and coco","useful":0,"cool":0},"GgRcvMAmXsumQiK1ON132g":{"text":"The food was good, but I sort of expected more flavor from a seafood restaurant in New Orl","useful":0,"cool":0},"J2j3_eLT-NppgDShR2p8JQ":{"text":"We love this place!  This is the second time we've dine at The Crazy Lobster, and it was a","useful":0,"cool":1},"unpY5s-mwBa722e6nEpTJw":{"text":"Great view, great music (we went on Sunday night and there was a live band).  The food was","useful":0,"cool":0},"nhT8Qw2MjA3Bbn3E47B5bQ":{"text":"My wife and I went here for lunch. We ate outside to enjoy the great view of the river. Th","useful":0,"cool":0},"aAKWNy-k6n8aEIvso2kcCg":{"text":"I've eaten at the AJ's in Destin, FL so I was hoping it would be similar in service and gr","useful":2,"cool":0},"TPN5NwfUxRa6l50UysoAaQ":{"text":"This restaurant was alright, nothing like I was expecting. When being seated the hostess d","useful":0,"cool":0},"klPEKzBzW94pc4JTiwkVLw":{"text":"We visited this restaurant on 5/24....\nFood was decent but service was awful. We had a par","useful":1,"cool":0},"lUrxoRcpLV3jJjGM7SjqoQ":{"text":"Definately a bit of a tourist trap kinda place. Name seemed so authentic. Food is high pri","useful":0,"cool":0},"fF9b1Rvh9zOP-HyC2zDNzA":{"text":"Waitress was good, very sweet. But, warm white wine in plastic cups with overly breaded cr","useful":0,"cool":0},"8quI24qiWGDXpLAvS6xc7Q":{"text":"When I arrived at the restaurant the mood was good. Everyone was into the food. I like tha","useful":0,"cool":0},"wkyP98EolZWL7cFMS1Z_DQ":{"text":"My sister and I went to the Crazy Lobster our last night in New Orleans. I ordered the cra","useful":2,"cool":1},"GDQoPeAzbv8Yn3FRZfFHTA":{"text":"The charbroiled oysters here are the best I've had in NOLA so far! I give them a 5. I've g","useful":0,"cool":0},"iLWHlxxltrvwv4QaaxDBWg":{"text":"Both my boyfriend and I felt extremely ill after eating the steamed seafood bucket.   Sadl","useful":1,"cool":0},"mopAJbl90Ioo1us49FIYtg":{"text":"Our first trip to No in 2012, our steamed  seafood bucket was, succelent  & Perfect, which","useful":0,"cool":0},"Mm5qxmgvE6EjnlMbmeRAcA":{"text":"The food that we had was not good at all. My fiance had the combination of crawfish etoufe","useful":0,"cool":0},"Wg_Vecr4PxcPxEn5W4jwhg":{"text":"Bacon Mary was delicious. Loved the spicy green beans. The actual bacon was lomonamd taste","useful":1,"cool":1},"jxyaF0GWL0FciVHs-AYqxg":{"text":"Got the Cajun seafood pot for the wife and I.  We both highly recommend it!  We were worri","useful":1,"cool":0},"u3gnDHiq95Ro8LO869RxdA":{"text":"Appetizer jumbalaya is plenty big but expect very slim pickings on your protein in the dis","useful":0,"cool":0},"jImbAeFeDqo1YDctt-juKA":{"text":"Wish I had read all the reviews before we ate here today.  Very disappointed in the qualit","useful":0,"cool":0},"LCBFPxxaHZ2T8LdESNrZXA":{"text":"My wife and I went to this restaurant on the recommendation of a bartender. Wow what a maj","useful":0,"cool":0},"0AU1v7zskOYRNkA1pGWatw":{"text":"My wife and I went here for lunch and we both ordered boiled crawfish.  The crawfish had d","useful":0,"cool":0},"9hwalS2cqfEoD64CHBYZbQ":{"text":"I don't see reason for bad review. It's decent place with good food. Nice view of waterfro","useful":0,"cool":0},"L4SegQyl5KDkwVk_0ePzyw":{"text":"Really pleasantly surprised by our experience. Bought a $30 Groupon for $60 worth of food ","useful":2,"cool":1},"uDBoRkzD7FTt2ccmuR2e9g":{"text":"Great food and great service! A groupon brought us in and we would love to come back if we","useful":0,"cool":0},"AnhPTIuMTM4QNTnfliO3PA":{"text":"Service sucks! Seafood sucks!! (and is over priced) 3 people got sick from the food! Never","useful":0,"cool":0},"y-pa-EMfTR7w5EErGk8MbA":{"text":"Nice scenery was nice, but Little birds flying around your table. The gator nest appetizer","useful":0,"cool":0},"sQnBEXIaQj3c3D1zcsZkMQ":{"text":"I sent this e-mail to The Crazy Lobster last week regarding our experience...\n\nYesterday m","useful":8,"cool":1},"45Mxz7Xc_J2i5vwZYeg4vA":{"text":"Best thing about this place is the address. Slow and very poor service, mediocre bordering","useful":0,"cool":0},"_UERs4UsXKEmoRMxWuCypg":{"text":"Wondered upon Crazy Lobster looking to see the river at night.\n\nWe were greeted and seated","useful":0,"cool":0},"L6q4NhLWlmPBE67KFwd9qw":{"text":"Decent touristy food. Took 45 minutes to sort out our 4 way split bill & get our change.","useful":0,"cool":0},"Rb8Qk9Q9_Zt9hD3npLyFjw":{"text":"The oysters were great.  Not hard to \"cook\". \nService was ...okay.  It wasn't busy, but a ","useful":0,"cool":0},"U0IGXuH8ghAiOMhJEeHPgg":{"text":"Been here two different times. Live music and great food and drinks. Our servers have been","useful":0,"cool":0},"PYPIWm-4UqbvOegIATeGPg":{"text":"I had the crab cake Po'Boy here and it was nasty. I had only half of one before getting tu","useful":0,"cool":0},"seK7NCHRRioOSzXG7y54qw":{"text":"Terrible place! Don't come to this place! Such a rip off for tourists! The food was terrib","useful":0,"cool":0},"kSJ4aP4YOgrdcMVH9TzlpQ":{"text":"The Crazy Lobster was a true epic NOLA experience. My husband and I sat on the patio facin","useful":0,"cool":0},"uAHYDSCUbZF07rQNRswyCw":{"text":"First time in New Orleans, not knowing where to go I checked Yelp.. Service was great, our","useful":0,"cool":0},"-YbODWHVmJcMixELHUr27w":{"text":"About average nice view of the Mississippi near the mall!\nFood was standard \nDessert chees","useful":0,"cool":0},"Gpc6vcCHaYp3rDH0NSb2_w":{"text":"They say it's really hard to find a \"bad\" restaurant in New Orleans, well this is as bad a","useful":0,"cool":0},"oUpkKT8gZ7ZLS5OLAklGZg":{"text":"Service was terrible. Food was average. Don't waste your time or money here. One star for ","useful":0,"cool":0},"gcplJSqirpO8keXdX_bB0g":{"text":"Two stars because the view is great and it's an easy stop for a quick bite to eat. Our ser","useful":3,"cool":1},"LZ5UHvAsn1IzwhPQVNawmQ":{"text":"Although the prices on the menu were pricey, there is a great deal on groupon right now ($","useful":0,"cool":0},"KD6uK4nFNUyyFPjZldxS_g":{"text":"Scenic View with Average Food\n\nTwo of us went here to eat on a groupon. We have been here ","useful":1,"cool":0},"1N5ChbAL-PFoIj0JjHVcZg":{"text":"My first Yelp review because I feel it is necessary to state that the manager was extremel","useful":3,"cool":0},"gDB-v7codBD1_hoef3HIpg":{"text":"Worst, over fried dried bread lobster po boy Ive ever ordered.  Because I tried to eat it ","useful":1,"cool":0},"6Ki1w5_KFen8phy7AAHQQQ":{"text":"We got great service.  We got the lobster boil with shrimp,  clams, mussels,  snow crab an","useful":1,"cool":0},"0w8sZ3ZJzVz0wxsQwv0PHA":{"text":"we ordered 2lbs of Crawdads they were so yummy we ended up fighting over the last one. our","useful":0,"cool":0},"UHp96AieCcQgKG3ebsmsdw":{"text":"Came here for our third dinner in New Orleans.  We had a groupon as well.  Place is very c","useful":0,"cool":0},"_IVOiARUa4ADqnEY-TtoGg":{"text":"First of all, I really wanted to like this restaurant. The location is great as it sits ri","useful":1,"cool":0},"COSmFeW3Q3d8b-ma44qyDw":{"text":"LOVE LOVE LOVE this place. I am a huge seafood girl. This is my second time here. Staff is","useful":0,"cool":0},"aU2FzQGnzXg0lQGuUdejJw":{"text":"I love this place.  My hubby and I choose bar seating every time we go. The bartender reme","useful":0,"cool":0},"5PO2u7yE0-DddNXFi2zqyg":{"text":"Very good service from Quanita (sp). Oysters were good, calamari was good, rest was a tour","useful":1,"cool":0},"-m34sNXcs2jo8QVeJmFhCg":{"text":"Food was good but the restaurant is a pit. All the condiment containers were filthy and st","useful":2,"cool":1},"7rU_hPZsFWkVBzb6CjwMDg":{"text":"We found  a Groupon for this place so we decided to take advantage. I think it was $30 for","useful":1,"cool":1},"Tw20HrY-GOppPdoR_OA00g":{"text":"We went as a family and were very impressed.  We were greeted by a very kind staff (and ve","useful":0,"cool":0},"oaUQeKYKqzG84leFfzRR_g":{"text":"Great place to rest your feet and have yourself a cocktail and wath the river pass you by.","useful":0,"cool":0},"cAajD_sc_-yYW_R6TkWTiA":{"text":"The service was excellent! The entire staff was more than accommodating. I loved my crab l","useful":1,"cool":0},"dUjZAesSjgUK2Pm4a7Umpw":{"text":"Started out by waiting 10 minutes at the front for the manager to seat us who was walking ","useful":0,"cool":0},"UHjbXWwdpQPWEtXIAVpo5g":{"text":"Good was great and service was good. I stormed while we were there for lunch so we were gl","useful":0,"cool":0},"hyWZAO30OIEJmkzzFg2BxQ":{"text":"Not a great atmosphere but the Oyster Poboy was fabulous!!!","useful":0,"cool":0},"ImO0-04IS178l61B59sX0w":{"text":"As a tourist I have been to many differant food chains. It took 15 minutes for a waiter to","useful":2,"cool":1},"pTTaau-tI4xMK0fGJSf5jw":{"text":"I will never visit this place again. The service was very sub-par. The waitress was unfrie","useful":1,"cool":0},"3OtryJl4thY08AZ3CDpvSw":{"text":"We heard about the crazy lobster from people on tbe street. We made our way over and Found","useful":0,"cool":0},"E0zWxqN9vFTt_IDdeqD4aQ":{"text":"Ok so me, and my family vist this restaurant, around 9:30pm. We all order our food all of ","useful":8,"cool":0},"Y2HpdrhtAi9KQc52rqBIQQ":{"text":"This restaurant has a neighborhood feel to it. It's very much casual/ take it as you see i","useful":0,"cool":1},"bw4JuNdj6zLOlnyDF98rkw":{"text":"Love the gator por boy and the superb shrimp and grits. The music was beautiful as well as","useful":0,"cool":0},"_8lTkX7R1ZvJaSUor23xqg":{"text":"Great atmosphere and nice staff but the food was about the same as Joe's Crab Shack. As wo","useful":0,"cool":0},"KEpWTVcQNYFh7xtD38CjAA":{"text":"It wasn't terrible but the prices are way too high for what you get. Crab legs were tiny. ","useful":0,"cool":0},"hTIQzZy-oPj4oo47VzQ18g":{"text":"Ok so I'm totallllly kicking myself for missing out on this Groupon, but since my friend p","useful":8,"cool":6},"ND8gEs20hRjDv34CsRb-rw":{"text":"First review in an effort to help you avoid wasted time and money. Reviews were mixed but ","useful":0,"cool":0},"WKVWIa43tbSpVPisOtugrg":{"text":"Mediocre food. Mediocre service. Bought the $25 for $50 groupon so I won't complain. FYI- ","useful":0,"cool":0},"Vwu0Cd9Uu6AD4oJxEOGdvQ":{"text":"The bar service was slow, out of stock on IPA drafts and some bottled beer.  Ordered the w","useful":0,"cool":0},"y6LdssqUCS3koJzOaFiFPg":{"text":"Good place for a quick dinner, food was good, I had the shrimp and grits, it was a nice po","useful":0,"cool":0},"JdmoiTkY7R6DuzhqInNu8Q":{"text":"Good location and staff was nice.  Not enough staff- had lots of people waiting with numer","useful":0,"cool":0},"7g3wnU2JiEu2s5qyk8jpBQ":{"text":"Went there Sunday 1/15 at 7 PM; looked cheerful and some nice blues from a band attracted ","useful":0,"cool":0},"zVO24GDVYyS1K8wh7zZfPQ":{"text":"Ci sono stato con degli ospiti perché in quel giorno era l'unico ristorante ad avere posto","useful":0,"cool":0},"jzCRKV-hAE86DmbvxuQddA":{"text":"Really good food. Co workers enjoyed it. Catfish was yummy, wasn't too fishy. Shrimp creol","useful":0,"cool":0},"wh0QdmCAOc8uNCZcaRfJdA":{"text":"Not too bad, but as the rating says \"Meh. I've experienced better.\"\n\nFirst off, if you're ","useful":4,"cool":2},"kbzIS6EkKcMAFlmAdqX2hw":{"text":"Amazing crabs cakes and great drinks !! Highly recommend this place !  Outside tables have","useful":0,"cool":0},"Pou44BXX0uhWIQ9EGyskRg":{"text":"Fun and loud. Casual.. Food was good not great. Service was slow but good. Do not be foole","useful":0,"cool":0},"f8iAs4747A3eV45CvtPF4w":{"text":"Blue moon on tap - very good!\n\nSteamed seafood choice  --  good.\n\nSmall portions - not so ","useful":0,"cool":0},"xuM-yWRl9E8FuvrOFh1ltg":{"text":"I ate at The Crazy Lobster on my business trip to the Big Easy. To be honest, it was just ","useful":0,"cool":0},"c8kcLLMuPnTWTe1UadfQtg":{"text":"I am ashamed of what I paid per pound for Crawfish, but we were stuck in this tourist trap","useful":3,"cool":0},"BcCft9L6LN-CdnlKBZTgiA":{"text":"Portions are large and service is outstanding with a view of the Mississippi River and liv","useful":0,"cool":1},"JutswOrdQkgc_25Yp-KV3g":{"text":"The food was good and the staff was pleasant. I wouldn't say there was anything that blew ","useful":0,"cool":0},"SpLcIvhYTJpkAiHqpX-rbw":{"text":"Came here in July 2013 and had the absolute worst service that we were hesitant to come ba","useful":2,"cool":0},"bQQuYlmYmxeNdZgzyvfgKA":{"text":"I ordered the shrimp and catish....man oh man it was good.  We ordered the red beans and r","useful":0,"cool":0},"NX04No0mQITNZNa8I82IcA":{"text":"If I could give this place a -5 stars I would. First of all this has to be the worst servi","useful":2,"cool":1},"VdAzILJSa3g0A38I9q6uYA":{"text":"This place was awesome! We had the Seafood Tower! The whole shebang was well worth the pri","useful":0,"cool":0},"9SUYQzc2fvl_P-sTiqLlOg":{"text":"This place is more of a tourist trap than anything. The menu is overpriced and the taste o","useful":1,"cool":0},"SejvDkZ1MvwqSI1wh5PDtg":{"text":"WOW WOW WOW!!!   We couldn't find the restaurant we were looking for and settled for Crazy","useful":0,"cool":0},"z5Wv1eWiKjV8KUx4J7Ll8w":{"text":"Food is WAY overpriced.  Like a lot, like $17 for shrimp tacos.  $40 for a lobster. Also t","useful":0,"cool":0},"1qsKWCIQTRv0GnCas9R1Fw":{"text":"Our 2nd time to this Awesome Seafood/ Bar restaurant. We had just gotten back from a cruis","useful":0,"cool":0},"XedGmP0Yk6cs_7ur1S5Wtw":{"text":"Tourists...New Orleans has lots of them. Most of these tourist stay in the French Quarter ","useful":5,"cool":3},"EAPdWYr1eeBazCiNcuHsbg":{"text":"One of the best places to eat in NOLA. The outdoor seating is a great touch as you get to ","useful":0,"cool":0},"Icumq_EiTT2s7ZA6TFoUAw":{"text":"SUPER AWFUL!!!!\nWent here again, because it was close to where we were. This place is a re","useful":3,"cool":0},"xl5TDRJLucsJUqIP5Q11Vg":{"text":"Where should i start? The waitress asked me not to ask about the difference between the hu","useful":1,"cool":0},"Y0uqqcYSk3xJXWV6CmzAAA":{"text":"This place is over fucking priced tourist shit food and the service is garbage. New Orlean","useful":0,"cool":0},"lZnDsHCgopDZ2dCFCBmX1A":{"text":"This was the first time I tried Crawfish right from the shell. It is definitely a tourist ","useful":1,"cool":0},"WpnirJAOBOYEPeyuhX-QTg":{"text":"The food was good and our waitress was very attentive but I was the DD for our group this ","useful":1,"cool":0},"vzpZIXghucrX5Y4P6vyVkA":{"text":"That was my second time getting groupon for this place. The first time the food was not ba","useful":1,"cool":0},"HVODLeK5o0d5rnRq8m7Xwg":{"text":"Tony was our server and he was really cool.  This place is Great.  I ordered the crab cake","useful":0,"cool":0},"3AEIz3BHOT9du2jl9-6rQA":{"text":"I liked this place, there was plenty of food, all kinds of cajun fare. We had étoufée of a","useful":1,"cool":1},"h_69K3O3W-yNU43vrt5WYA":{"text":"The location is good and the menu looked promising...lots of local dishes to choose from. ","useful":0,"cool":0},"qWstVpVflglA6Tw4BwXhkQ":{"text":"Very good food.  I had the Taste of New Orleans $15- red beans and rice, Jambalaya, gumbo.","useful":0,"cool":0},"TIhWFYHIGVxILqcwGqg3KA":{"text":"We set our reservations for 9pm. When we showed up, 6 other groups were waiting for their ","useful":0,"cool":0},"HgbrSbDwDxveTgKGxJJpng":{"text":"Will L. was very nice, attentive & helpful as many other restaurants were closed at 9pm & ","useful":0,"cool":0},"Bxpd3ihW6ZTIDsaMtTZR_w":{"text":"Me and a coworker decided this was the place for our last dinner in NOLA. If you don't get","useful":0,"cool":0},"bOccYYdRjCszYRnelvzWbw":{"text":"We always eat here when in New Orleans. However, this experience was different. I ordered ","useful":0,"cool":0},"111J6zpUxU-P7h_NDrxptQ":{"text":"I honestly do not know where to start... This is by far the WORST place I have ever been t","useful":3,"cool":1},"Hw3p6KiG5YS5UTDqEw3aNQ":{"text":"After losing my money at Harrah's, we ended up here to eat. The menu says they're affiliat","useful":3,"cool":1},"_-_H6aLTtyJykYIQc4AaSQ":{"text":"This place exceeded expectations. Nothing fabulous but perfectly decent food which is real","useful":0,"cool":0},"RhQAl8voKdkzNdW4WeueUg":{"text":"I wish I could give zero stars but it doesn't seem to be an option.  We decided to grab lu","useful":4,"cool":1},"_2hEpCN-UCUVemu8ACo91g":{"text":"For my first time in New Orleans The Crazy Lobster was everything I needed it to be! The f","useful":0,"cool":0},"DN7QjM9d_gRH-CqWhI8EQg":{"text":"Crazy Lobster on the river was a solid spot on a warm evening for a large group looking fo","useful":2,"cool":0},"FPm2J7jxbIeOmsv6tIvAag":{"text":"Best food I had in New Orleans!  Came for lunch and had gumbo which was good.  I had the m","useful":0,"cool":0},"g3K5FJzuSX8EPv3efiB7QA":{"text":"They ran out of lobster, bathrooms messy, nice waiter, but manager sucks!\n\nHorrible manage","useful":0,"cool":0},"os0gz_-iPUKzxXzS339g-Q":{"text":"In all essence, its tourist food.  Didn't have the \"home-made\" feel to it.  Still good tho","useful":0,"cool":0},"wyocXQ09KuKZtoeOzeOcuw":{"text":"I bought a groupon for this company because that's my new trend for trying new places even","useful":0,"cool":0},"PucCGBNYl-gerRIIP2JN8w":{"text":"A nice sunny lunch place. The food was fine even though the place was not fancy.","useful":0,"cool":0},"WTsbNPANj5YkoUm7wa0Ojw":{"text":"Food was decent. We did the taste of New Orleans and a crab and shrimp boiling pot and was","useful":0,"cool":0},"FfIQ_18vUTmo1pmpAkg15Q":{"text":"The place was really busy so I can understand slow service but sitting me with a band dire","useful":0,"cool":0},"AbMRp_KX0cmm5AGhPp12Rw":{"text":"Good food, great service.  we happened to be the last table in the restaurant on a Sunday ","useful":0,"cool":0},"KoNBbuFtDrzrolo-FjtLvg":{"text":"Good red beans and rice, jambalaya and crab. Good service and better views. A little touri","useful":0,"cool":0},"y5JoHrMIAkEXrfhX8-CoYg":{"text":"We were getting tired of trekking all the way to the French Quarter from the warehouse dis","useful":0,"cool":0},"C-UH9LunoN7dfhkgh9Bzhg":{"text":"The Crazy Lobster was a great last dinner in town! We had a nice view of the river, seated","useful":0,"cool":0},"rhAHLwNkHo8M6a5nd4MwIQ":{"text":"Everyone said that the service was slow and the place was a tourist trap and this was defi","useful":0,"cool":0},"j2B95jRjcdm2AJc-ahRUaw":{"text":"The food was very good, waitress was amazing as well HOWEVER- DON'T try to use a Groupon c","useful":2,"cool":0},"Ln2vwr3pK2izcnWBBrMzhA":{"text":"Good food - fair prices - cannot beat the location - Enjoy..","useful":0,"cool":0},"acnHOVEcQlrqe_xCv2isIA":{"text":"The good: Location and open air dining with great people watching ability.\n\nThe bad: Food ","useful":1,"cool":0},"nhrhkvx6VBHOqAIPCHuwdA":{"text":"This place is pretty good.  The jambalaya was decent, and it had TONS of shrimp in it!\n\nSe","useful":0,"cool":0},"L4zWMAaYOGERYS2YTegZEA":{"text":"Location is best part of experience. Service was friendly and prompt. However, the food is","useful":0,"cool":0},"trjFwbD5xRYlcozzpwmtrQ":{"text":"I travel to NOLA every 2-3 months.  Each time it is mandatory that I go to Poppy's Crazy L","useful":0,"cool":1},"cOluEEDxoZtRAV8TexqTSg":{"text":"No server in sight. Sat for 15 minutes and left. Very disappointing place. Please hire mor","useful":1,"cool":0},"-DH7t7hdaZNrA28-_pNKYw":{"text":"First off! You haven't lived until you eat crawdads in New Orleans on the Mississippi Rive","useful":0,"cool":0},"z_IHw1XCRhSU3XDDqcbmVQ":{"text":"A good recommendation the food was really good. Did not have to wait long. My waiter was P","useful":0,"cool":0},"TVeSqyaY0BrppwmnVdhEfg":{"text":"I went here for dinner on a Sunday night to use a Groupon worth $50. There was no wait and","useful":2,"cool":1},"oQvLQSTcfVoWfficEYV3-w":{"text":"Great drinks if you want to try out the sweet favorites NOLA is known for. Yummy food. Gre","useful":0,"cool":0},"o7avXMTfUsFqNqfl9Vubeg":{"text":"The sweet tea was really really good but the food was ok. The wait staff kinda takes forev","useful":1,"cool":0},"3hWzMq3kTEx-wIZCaPgvpg":{"text":"Most definitely a tourist restaurant, but I was so tired of walking I would have eaten any","useful":1,"cool":1},"YFgXniggmDEKara6N21huQ":{"text":"The food is ok, but the service is lousy. We had to ask 3 times to get a refill on drinks ","useful":0,"cool":0},"gTvJU3_KuXkW7QmNnWYp4w":{"text":"We had the fried pickles, calamari and fish tacos.  Great atmosphere right on the river.  ","useful":0,"cool":0},"WFUnlAtRq9h3Sg6b286Uug":{"text":"Dirty oysters, expensive bloody Mary's and slightly rude waitresses. I am a huge fan of ra","useful":0,"cool":0},"FkwfP9-QeLJX0a4GdShKTA":{"text":"Located on the river walk in the south end of the French quarter. Cool location to watch t","useful":0,"cool":0},"yUGgiYZab8BioXEQfcrkRQ":{"text":"Don't go here.   It's a trap! (In my best Admiral Ackbar voice.)  A tourist trap that is.\n","useful":2,"cool":0},"RBIVqIwkNeAtM0cUb8ewUA":{"text":"Yes they have lobster. And you would be crazy to ever come here.\n\nNot sure why anyone woul","useful":0,"cool":0},"nylVLlAYXNAIDKD_dTw4rw":{"text":"We had a group of four, two guys and two ladies. We ordered the delux seafood bucket and w","useful":0,"cool":0},"jJ74xoRz_RTjmv9djOstew":{"text":"Okay so this was the first place my fiance and I walked to from our hotel and we wanted to","useful":0,"cool":0},"brTZe6AGmo7xQsoybiqCnw":{"text":"I think this place can be a hit or miss.  First time I went it was delicious. I got a seaf","useful":0,"cool":0},"OQl1zYaYTX6hHqMvk86QRg":{"text":"We had a great dinner here Sunday night.  Our waiter was very friendly and attentive.  My ","useful":0,"cool":0},"N_EEj8j1ilypBNHv5aVFUg":{"text":"I thought this place would have gotten more than 2.5 stars.... thought the food was excell","useful":0,"cool":0},"Mdy5VYhbx41RHHdPidQnuA":{"text":"Truth be told, the Crazy Lobster offers tasty yet pseudo-traditional Louisiana dining. Spe","useful":3,"cool":1},"DHkxtMpFLDJXxoSUuepoTw":{"text":"Another awesome place to eat in the NOLA, we seated quickly and the staff was friendly.. T","useful":1,"cool":0},"wQiIIr6Vnu-64czO2SgB9A":{"text":"Live music, great food and genuinely friendly service. I got to try crawfish and grilled c","useful":2,"cool":0},"Pqj8n6wfQw9MzyKd2D52WQ":{"text":"Our waiter Aaron was very good explaining the different options.  Had the seafood platter,","useful":0,"cool":0},"6e_9nYWeh_YKwWYGE2xPnA":{"text":"The food was good. I had chicken sausage gumbo and fried pickles.  The only complaint is h","useful":0,"cool":0},"5ZxaXq6vRuf6XgXJEnL65A":{"text":"We ordered the Louisiana Oyster plate & Pasta Orleans. Ive been eating oysters my whole li","useful":0,"cool":0},"N6I4LHF6TyWZiR59Ybdepw":{"text":"Decent place for lunch.  Both dishes were good, but the jambalaya was a little dry, though","useful":0,"cool":0},"Mgj_0U6RAmcS76SUPfURWQ":{"text":"Awesome setting and good food! We stumbled upon this place because it was close to our hot","useful":0,"cool":0},"O3kYzBJGi1ix_He6rNV1zg":{"text":"Awesome authentic Nola food. Good portions for your money with live music and a nice view ","useful":0,"cool":1},"DfVR181trPDKHo4RI8xzag":{"text":"Nice location, but this place is a total tourist trap. Sodas are 3$ and no refills. Tap wa","useful":1,"cool":0},"KC9_LTrVOBkQWMoem40_Dw":{"text":"Prices were too high and the food wasn't the best I have had. Server was nice but really s","useful":1,"cool":0},"VTLsVgqW9Q23zz7dHENWqA":{"text":"Pretty good. They forgot part of my order but overall pretty good grub.","useful":0,"cool":0},"OscIeXM-yxk0kiPOsWspZA":{"text":"Yes , it is touristy and old  but I've visited  every time I go to New Orleans for 10 year","useful":0,"cool":0},"69QEImr-GR_cXoADTIpz7g":{"text":"Had Seafood platter, lots of crab claws... Very Filling... We ate as a appetizer for 4 peo","useful":0,"cool":0},"cAVH-cqEno8QFEvdUMDLxg":{"text":"Upon entering the establishment we were met by a very unenthusiastic hostess. When taking ","useful":0,"cool":0},"MHUTeA24DeD2HoWP5Nyf9g":{"text":"We selected this place knowing it was beautifully located and we were just hoping for drin","useful":1,"cool":0},"gM-BDHwSg7gUxNkGXp6efw":{"text":"This place reminds me of a Joes Crab Shack. Anyway, I had a groupon and decided to give it","useful":1,"cool":0},"WLlxEvaZ0pcfwdTDujGkrw":{"text":"So my last day in NOLA I needed to try red beans and rice.  We stopped here, and it was bl","useful":1,"cool":0},"qO7gCdAwNQvjbJNSLwC6FA":{"text":"Our problems started right at the check-in counter.  We asked for a table for 10 and immed","useful":0,"cool":0},"S7d__C0TU7xNDUY-S0N6Qg":{"text":"We liked the cozy, friendly interior and attentive and helpful wait staff. Seafood Platter","useful":0,"cool":0},"kEepoJGe4KCfDzBrpjwImA":{"text":"The atmosphere at the Crazy Lobster was very nice. The music on the porch was not so loud ","useful":0,"cool":0},"36wWKO3QX2Vn_IL4grF1BQ":{"text":"Location was great and had live music. Came for the Cajun food, was just okay. Alligator b","useful":0,"cool":0},"u4OnLoSY067YEqMll980Xg":{"text":"Dreadful food.  Stay away.  Does have a nice location and view of the boats going by.  Sta","useful":0,"cool":0},"GS7YhVdRKFQWKnApJkrKsA":{"text":"We were suggested to go here, so glad we did. Nice view, indoor and outdoor seating, along","useful":1,"cool":1},"8toHQUL3EkGdi1Orjr7DhA":{"text":"This place was fantastic! Right next to the river with great food, atmosphere and service.","useful":2,"cool":0},"MMffmgkFQHlPdRYa4Ghqfg":{"text":"Bought a Groupon, made reservations. When we arrived they didn't have a reservation list. ","useful":0,"cool":0},"w5pT3-oBUG_QzInarG9nlA":{"text":"Service was great, set up and view was nice . But the food was okay and over priced. The g","useful":0,"cool":0},"tVMr6ej8AE5FvfeX0IsLkg":{"text":"Stopped in this afternoon after fighting the crowd of obese mouth-breathers in the adjacen","useful":0,"cool":1},"20Cfag1_IReuNApmZ7MwsQ":{"text":"Horrible service. The hostess was rude, and then once seated our waiter came right away to","useful":3,"cool":0},"ct4Fm2z2sc1nTdfT3xPGBQ":{"text":"We arrived at 7:30 and didn't set a reservation after the employee stated it wasn't necess","useful":2,"cool":0},"WzRqxy2ZvgrY-fphBOphVA":{"text":"Nice place.  The food was good and the service was quick.  The location was excellent.  I ","useful":0,"cool":0},"PZhlAPTJqon8oGNgbVlofg":{"text":"Nice location, good food. Pricing was fair, a pound of crawfish with potatoes and corn was","useful":0,"cool":0},"mzyTnzOuyi7jnHkfT6YBqQ":{"text":"This was an excellent place! We got a crab bucket with corn, sausage and shrimp. It was th","useful":0,"cool":0},"G2l-4Lc4KPgAGNYYn6oo_A":{"text":"This place was convenient just because of its location. Went here 2 or 3 times while visit","useful":0,"cool":0},"YPlCRYNUsDHA_8gqF0rTMQ":{"text":"This place looked promising but was quickly let down. After waiting 10min for a table in a","useful":0,"cool":0},"-DgR77Hjw6vyyMSKP4gDVQ":{"text":"So it looks like this will be my last NO review... unless I think of any more! ha\n\nI had h","useful":3,"cool":0},"NjNrVzRtm8EmcXPfRxes0A":{"text":"Such great reviews but I received poor service when waiting for my to go order. Got tired ","useful":0,"cool":0},"RYWNtJlop-j8FZ7ThPfaGA":{"text":"This place is on the river and is a real delight.  Yes..it's super crowded...Yes... servic","useful":0,"cool":0},"A-dDxrjpmyhXY6rB0pbpXQ":{"text":"Nice location, waiter was good. The wait for the food was very long, and they were not ver","useful":3,"cool":0},"3V9JywxmSXZ306oYsyb_jA":{"text":"Service was slow but the waitress was new and very nice. \n\nJambalaya was not very good. I ","useful":0,"cool":0},"DUfJtiLIrZMB7q5FLVgFnA":{"text":"I had char grilled oysters for an appetizer, and they were great. I also had the steak and","useful":0,"cool":0},"rXf1xgIIT8pvWWLRRl21Sg":{"text":"We had crawfish kickers and alligator bites as appetizer and it was delicious! Also had co","useful":0,"cool":0},"HAVUdUt6_ACMCVaKNuu0uQ":{"text":"This is the second restaurant I've been to during my stay in New Otleans. From the outside","useful":5,"cool":0},"A170cakJRfj1V9VHatTOmA":{"text":"London was wonderful! Service was fast and great!! Crawfish were boiled to perfection, and","useful":0,"cool":0},"pg_98CQukCq0Yii1TfO_2w":{"text":"Absolutely crazy DELICIOUS, Creole Seafood Gumbo, Jambayla, Crawfish Étouffée & Red Beans ","useful":1,"cool":0},"QADN4ccx4kHHhP9kZY8O3Q":{"text":"Food was great, service was awesome, loved eating by the river a must go to when you visit","useful":0,"cool":0},"rbvd-dBBPAe-SxQLjYxO6g":{"text":"We happened upon this place accidentally with a 3 year old needing to use the bathroom-the","useful":0,"cool":0},"RtL-y9BUCR2OjslmD0cIKQ":{"text":"Went to Poppy's (that's the name of the lobster on the sign) and it was a great experience","useful":2,"cool":2},"445eGaDxBtt_Pf00rR2gkA":{"text":"Sometimes you have to head to a tourist trap to see if the out of towners know what they'r","useful":10,"cool":2},"caa3r5O_6FYdj-BvWw7Org":{"text":"After being seated, we waited for 12 minutes then went and asked the hostess if we had a w","useful":1,"cool":0},"Z_fwV3HM5HvV-uPVk1SF3Q":{"text":"The prices here were SO high.  Granted it is a lobster place, but every single lobster ite","useful":3,"cool":0},"u_VLOp0Xjg0h6Rs1IqYCCg":{"text":"Live band and good eats! I had the shrimp and grits. They were amazing and very well seaso","useful":0,"cool":0},"QlkaVGssRKaoRRQ_EMc0EA":{"text":"Had a great experience here on our weekend trip to NOLA :) the crab leg and shrimp boil pl","useful":0,"cool":0},"n5mJh1VQ2cfL125Z6if6SA":{"text":"My husband and I went because there was a misleading sign for $4 bloody mary's but after w","useful":0,"cool":0},"lngZMsqUAw4iRfS6ejRjOw":{"text":"Had a Groupon. Ordered stuffed lobster. Lobster over cooked, tough and rubbery. Stuffing v","useful":1,"cool":0},"EB8lT3aCMbJol7xxmf1gQg":{"text":"My husband and I found a Groupon and decided to go for dinner. We were not impressed!  The","useful":3,"cool":0},"uhG4Fbhv4AeszkJcTUOdXQ":{"text":"Yeah I was OK with it.  Good fried stuff and decent beer selection.  Server was attentive.","useful":0,"cool":0},"Qhu3pLE6OeZuKUx9znxHoA":{"text":"We ate raw oysters and charbroiled oysters as well as the seafood tower, it was all fresh,","useful":0,"cool":0},"X1KwpVkt-jzkgBx1ZIk4dg":{"text":"Our waiter was awesome! Although the prices were a little high for what I was hoping to sp","useful":1,"cool":1},"uoNF6ZBP8YRIpopr49Deog":{"text":"As a last minute, found-a-Groupon decision, my friend and I came here for dinner. It was l","useful":15,"cool":12},"x5XsWk5YV2PYon4EuNNtFQ":{"text":"They did not have most of their menu available. How can you make a restaurant name with lo","useful":0,"cool":0},"c9FCBi_xWbCMUN2I_SZQEQ":{"text":"So we chose to eat here because I really wanted crab legs. I googled it and found this pla","useful":1,"cool":0},"kawDTAgt_8qxUjbx-w83bA":{"text":"So I stopped by this place in the afternoon a couple of times. I had the crawfish and thou","useful":0,"cool":0},"1UjPWfTpkakDqmMBonu5Tw":{"text":"Stumbled upon this place getting out of the aquarium. It started raining so we jumped in t","useful":0,"cool":0},"hqFzkCXgLwTNvD-2qDCA0w":{"text":"Love the atmosphere out on the riverfront and the food was very good. We had a great waitr","useful":0,"cool":0},"RFNOP6CUjiJLhlwSI9zynQ":{"text":"This place is a lot of fun. Yes it is \"touristy\" but hell we are tourists. Seafood good an","useful":0,"cool":0},"lW3MRWxVeJif53dmXJtNPg":{"text":"Gross and overpriced. At our table we ordered shrimp & grits, a burger & a fish sandwich a","useful":0,"cool":0},"7DYgUASIIFkxe55Q0NWeUg":{"text":"I went here with friends and they had huge portions of food, the drinks were alright but p","useful":0,"cool":0},"Qa2N6COUmaJrvZ4G50gIng":{"text":"Not bad,  not great.  The service was good but the food, less to be desired. Some of the d","useful":1,"cool":0},"am-hz3fYabMHNyQofHmm0w":{"text":"Great venue and our server Gabby was AWESOME! She was there whenever we needed, fast and f","useful":0,"cool":0},"Ac3agCSic6oMz9eDIRBDIA":{"text":"I'm not sure I've had a worse experience in any restaurant than I had at the Crazy Lobster","useful":1,"cool":0},"16-Bzx8Ilz3ayxdVmB9lOg":{"text":"A really great value with current Groupon, which gives you $60 worth of food and drinks fo","useful":6,"cool":3},"yZw94JaqL-pf1QV_XCa4tQ":{"text":"Great food delicious drinks ! Enjoyed everything we had . Always come here for the catfish","useful":0,"cool":0},"YKJ67CXH5Sl0C2ndU3CC6A":{"text":"ABSOLUTE WASTE OF TIME! Sat for 25+ minutes and never got waited on! PISS ON THEM!","useful":0,"cool":0},"S8wVRMk6FUgvNwi15RAGFg":{"text":"Grabbed a quick bite here yesterday and to see the Army-Navy game!  Bowl of the Seafood Gu","useful":0,"cool":0},"R0CskCekkrmZt9bjo1UdlQ":{"text":"This would be a four star rating.  The boiled crab was so good, and the server took foreve","useful":0,"cool":0},"jD-Ge1AhHuyKWldaW3k1iA":{"text":"We went here with a Groupon. Ordered the Seafood tower. Food was really good. Tower was en","useful":1,"cool":0},"J-U8mRnZMVcpRR69IjQf_A":{"text":"There is something enchanting about sitting on the banks of the great Mississippi River wa","useful":0,"cool":0},"VDsKKoX2MMqruR5FQB9aQg":{"text":"We ordered the Bounty of the Sea bowl. It was soooo good! It's pricey but absolutely worth","useful":0,"cool":0},"j2XEdfjU8Oc2osr1nI4dgA":{"text":"This place is by the river, and looks like a cheap place. But, don't get tricked. The food","useful":0,"cool":0},"jsNKjIMR5-MVEezOmhIheA":{"text":"I was in New Orleans for the ADA working, and this amazing restaurant was literally a ten ","useful":0,"cool":0},"5YFpEkhLczu6097EqvlmsA":{"text":"Location, Location, Location. This place is just fine, but they do well since they are loc","useful":4,"cool":0},"dj1e5eTkfteJsS7BFVAknQ":{"text":"Food is pretty good, kids portions are pretty big as well. However beware eating here on a","useful":0,"cool":0},"pLYxAqIbIE1UEDQS2Rqa5Q":{"text":"Ate there in July of 2010, & have been meaning to post this since then. It's worth posting","useful":0,"cool":0},"MwnVHx2zoke7IbbZIIYx-Q":{"text":"The portion of food given to kids is ridiculous for the price of $9. The chicken tenders w","useful":0,"cool":0},"oB28Rw0czANlRT1PUq8vDA":{"text":"Fast food N'awlins. 3 stars for atmosphere: great service, fun band playing, outdoor seati","useful":0,"cool":0},"h2cw1mMIxLSy_p-3NSdhlg":{"text":"The Crazy Lobster offers a decent lunch. I may have been dissatisfied if it were my last m","useful":1,"cool":0},"vdgAhZLMthXZAoTkhKNQgw":{"text":"If you like seafood craziness, this is the place to go! Just right off the ass end of the ","useful":0,"cool":0},"2hlkOCwvMzFT-A-PCOYygg":{"text":"Not that great or maybe we just had a bad waiter. \nShe  kept forgetting about us and we sa","useful":2,"cool":0},"NtRnl5h9E4w2sWFR5mGl9A":{"text":"Friday night we enjoyed live music, friendly staff, and tasty food! Seafood was delicious.","useful":0,"cool":0},"TF4oXBhnOFCCKstthio5LQ":{"text":"Overpriced for the food and quality of the food. No refills on sodas or tea. The bar drink","useful":1,"cool":0},"wym8R8Ga6JVFHtCrwxmAmA":{"text":"Terrible service. The hostess will tell you to cut your wait and sit at the bar with \"the ","useful":0,"cool":0},"BwdgFkRSMLYYHCgPdpevUg":{"text":"Based on the food, The Crazy Lobster would have scored three stars. The corn cakes are ver","useful":0,"cool":0},"96TDkIa5LkCI2tw9uEZmHw":{"text":"We bought a Groupon for Crazy Lobster and made reservations only to walk down and find out","useful":0,"cool":0},"secPYQ8XjT6zlEGY690imw":{"text":"Truly some of the most exotic American food I've ever had! For any tourists like me, I cou","useful":0,"cool":0},"7WHprdz1UalggZxDxGVxFg":{"text":"Good music decent food and service.  Come for the atmosphere.","useful":0,"cool":0},"KF6Th08oWjiXw6jsH02XSg":{"text":"I was in a party of 5 and we got seated pretty quickly. We must've went at the right time ","useful":2,"cool":0},"xqJ6tiQhZBUogx4FVOqusA":{"text":"This place was somewhere we stopped at because we were close after leaving from the aquari","useful":0,"cool":0},"tmKMCfwO5awg1wf0vOJFmg":{"text":"The food is excellent, served hot and fast. The staff are friendly and attentive.\nWe had t","useful":0,"cool":0},"goQDmBcs10ZES2Mw41zvxw":{"text":"Terrible service, couldn't even give us silverware. Never refilled waters, they charge 20%","useful":2,"cool":0},"f_qZTLMQvIljGAiWIAmt3Q":{"text":"The food was good, drinks were a bit over priced. Live music and eating on the water was n","useful":0,"cool":0},"9UUg1W_6dprG7BxwNs3AIA":{"text":"I use a Groupon. It was worth the money. I will return. The shrimp po boy was not on Frenc","useful":0,"cool":0},"oNmzwTAQVj_5bXGCWGrSPQ":{"text":"Simple review\n\nDecent food. Horrible service. Took 27 minutes to get our appetizer. Total ","useful":2,"cool":1},"--_HLm2tHCAkBXCSPFmV3w":{"text":"We came in here for a late lunch and to see what's at the Riverwalk.  We read the reviews ","useful":1,"cool":0},"drczyGkPA0nVySUqA3cpvQ":{"text":"This restaurant was decent. We had a Groupon, so we gave it a shot. We weren't disappointe","useful":1,"cool":0},"51DIx_rfXvMgn1SExlVqbg":{"text":"We had lunch at this place. Red beans & rice with sausage and a shrimp po' boy with fries.","useful":0,"cool":0},"vylVpbpbTxdqMMYorVrOZg":{"text":"My husband and I ordered the combination of dozen char-grilled oysters.  They were pretty ","useful":0,"cool":0},"fdha9p3t9M6PK5iElu60Lg":{"text":"great touristy spot by the river. good music, food. get the bucket.","useful":0,"cool":0},"ymcbKAcKnO_wWOExFZYEVA":{"text":"Second visit to New Orleans, second visit to this place.  Conveniently located near the Ri","useful":0,"cool":0},"uve6ocah0yEaJhASNsJEMg":{"text":"My husband and I were here yesterday afternoon for lunch!! Our server was Emily. She was g","useful":0,"cool":0},"r4q5QH_-sxNt33__OJVLHg":{"text":"If you think this may be  nice place to eat because it is by the water...don't fall for it","useful":5,"cool":0},"NG7IPrW3xQZYJ8CIY7aIlw":{"text":"The weather was perfect to sit outside on the deck overlooking the river. The\nservice staf","useful":1,"cool":1},"TaYUZKmoblyOqaecl5hKOQ":{"text":"Slow at start, gave free drinks to make up for the wait. Great drinks, food, and dessert! ","useful":0,"cool":0},"CS-A3L0Mb2J-lKG2f4gF_w":{"text":"This place was ok! I had a lobster and the flavors were good! My husband had the Jambalya ","useful":0,"cool":0},"DB8azRRFhhe3dHcJRiORaw":{"text":"Oh Emm geee.... Where do I start? We ordered the stuffed lobster that came with lobster ét","useful":6,"cool":0},"Lanz7jDXPDly0RCChx2E1A":{"text":"I was hesitate at first but its good value for groupon.  Food is a little too salty.  Serv","useful":0,"cool":0},"cQNlLsd9OOyyd_edOm7dfA":{"text":"Views of the Mississippi, live music, and outdoor seating are all good reasons to at least","useful":0,"cool":0},"SW1vl0GJvrQqjaUXCwYzEw":{"text":"What more can you ask for? This place sits right on the Mississippi River and provides bea","useful":2,"cool":1},"YHI1oy7bh1Th9V5tpai87w":{"text":"Nice restaurant with a nice view across the Mississippi river. We came here with a Groupon","useful":0,"cool":0},"uO5ilVfw_VwnzPrajOqXMA":{"text":"The char-grilled oysters are the BEST I've ever had!  I can't imagine why this place has n","useful":0,"cool":0},"n__rhANLvGFqxLDpg5ojDQ":{"text":"Came in towards the end of the night. Staff was super friendly especially Gabriel, she was","useful":0,"cool":0},"kKKidWahrgm8jQxniE2AOw":{"text":"We used a Groupon deal here- 25$ for 50$ worth of food. We knew it was going to be tourist","useful":2,"cool":0},"WxKVpz7pLQKQVBj25OfCNQ":{"text":"Don't waste your time!!!!! Can't tell you about the food,because we could NOT get any serv","useful":0,"cool":0},"9i3I6gtQrnENuOjifrEY4Q":{"text":"Buyer beware!!!\n\nNow I know why they have a groupon for this. Worse dining experience is n","useful":0,"cool":0},"ENlrcailA_1X0ZF48lrRlw":{"text":"Crazy indeed. They claim to be famous for their steamed seafood basket and they should be!","useful":4,"cool":3},"cPqmV1HhwThgQ7uGneZheQ":{"text":"Eh, this place was decent. Overpriced food and drinks, decent service, and cramped seating","useful":1,"cool":0},"ZBqSXvaAo9HwR0TNILhU_Q":{"text":"It's ok...\n\nI had the shrimp and Grits and coconut shrimp as an appetizer.It was ok. \n\nOth","useful":0,"cool":0},"AphqIf8hmS0eg_MVSsD2iw":{"text":"This place was closed and we didn't know until we showed up. We came in from KY on vacatio","useful":1,"cool":1},"cBhBRL3M1mcOEFm57UWc-w":{"text":"Wow, what a great place!\n\nAt first we weren't sure.  It was a bit busy and they were going","useful":0,"cool":0},"2k3wverQAtvSLCdGYkie9A":{"text":"the only reason I gave it one star, is because I had to, in order to write this review. My","useful":3,"cool":0},"lN-zVzKpNKi0URH1_gNMzg":{"text":"Paula was our server, she was very nice and prompt. The snow crabs were great. The potatoe","useful":0,"cool":0},"y3DOUHc2EnlPZPopw7Kb0A":{"text":"Huge disappointment, overpriced watered down drinks. Flavorless fried food. The steamed sh","useful":0,"cool":0},"4wl11rF_ES9ELIvZ_M3bvA":{"text":"Skip this place. We made the mistake of wasting 1 of our dinners here. We were at an event","useful":0,"cool":0},"b2TuQv6BTGpiIuGSeaSYKQ":{"text":"I guess I ordered the wrong thing, but it was a suggestion from the bartender.  This is a ","useful":0,"cool":0},"MWAZ_wo1IMM-sPDz2WipZg":{"text":"Great food & loud fun restaurant with a wonderful view of the river. Can I just say I will","useful":0,"cool":0},"AYT0LPkFNOy0-PJRf_CKJQ":{"text":"Food was excellent service was great very well priced for the amount of food you get excel","useful":0,"cool":0},"6eCoFyKIXN1DeQsAbGn7Ww":{"text":"Please do not go to this restaurant. Went there on Tuesday night for dinner because we wan","useful":0,"cool":0},"g2Wi8tGTG84Kjlu1h8LmYQ":{"text":"Not bad, but no exceptional. The place wasn't busy on a Thursday night, so we were seated ","useful":2,"cool":0},"kvaVWklr8knRvBBpv63PKQ":{"text":"Not a fan. Service was poor. The food was mediocre. I was actually worried upon leaving th","useful":3,"cool":0},"iP25yHS5-otG_D9S1nyOzw":{"text":"I was extremely happy with this place. It's on the RiverWalk a couple blocks from the Hilt","useful":2,"cool":1},"hmKw1brW9wGFckVYwkS1yg":{"text":"We tried this place out after getting a Groupon and it was pretty good. The Crazy Lobster ","useful":0,"cool":0},"PY8Ti0eRinaM7t1mk1-yAA":{"text":"I visited the Crazy Lobster for a late lunch on a Saturday afternoon. As a local, you norm","useful":7,"cool":1},"NB8pKKcf5YAwB3-m3oCqpw":{"text":"50 yards from the Aquarium on the Riverwalk.  Staff is laaaaiid baaaack......\nbut we did g","useful":1,"cool":0},"UMe2UhORbVn674GXqV5FrA":{"text":"My girlfriend & I stopped by after walking around downtown during our recent trip to NOLA.","useful":1,"cool":0},"n1aYQVn3SI-9huRNnFxfOA":{"text":"Everyone was very friendly.  Oysters were amazing and The Who do the voodoo juice?   We do","useful":0,"cool":0},"CcFa6cETwNYbSYOV6YbE5w":{"text":"Not going to go into grave details. I will say that my service was great. The food was oka","useful":1,"cool":0},"E3askYZau2VQ_N1G7Kt1Dg":{"text":"Red beans were good. Band was a little loud. Drinks are weak and the hurricane juice taste","useful":0,"cool":0},"TMz80IGg3ZFzIAIr2O1b4w":{"text":"Once again not worst not the best. We went at 4:00 and the service was terrible until they","useful":0,"cool":0},"I_d6Bfumtuo3IpU_ZlA3Ig":{"text":"I would give this place -10 stars if i could.  We got seated & it took 15 mins to even get","useful":3,"cool":1},"0l4-bf57zVUI2yph61Sp5A":{"text":"Tourist trap alert.\n\nAlthough the food is mediocre, I have to admit, they snagged a real n","useful":2,"cool":2},"PSHp0jjl9oWA1j_V_jOtSQ":{"text":"Great crawfish and music!! Sold in 3lb increments. Not too spicy. Also had the red beans a","useful":0,"cool":0},"bjsmI_90C2a5357GnhVhwg":{"text":"We went anyway after reading mixed reviews. Made a reservation on open table, but they did","useful":0,"cool":0},"sLZGgucJ8_ohtd5g7q4YBA":{"text":"Bardzo dobre po-boy'e. Miła atmosfera. Muzyka na żywo. Widok wprost na Missisipi. Polecam.","useful":0,"cool":0},"tw8EzVEdBJ-koHSwjgNE6Q":{"text":"Decent food. Horrendous service. One check in to take the order. The other to drop off the","useful":0,"cool":1},"ZdK2htaRcgBc5-9sKlUFOg":{"text":"The service is horrible. Took forever to even get a beverage yet it was 5 seconds to get a","useful":0,"cool":0},"Dhe0W-G_WKkpn2kQX7DXbw":{"text":"Meh. I spent a lot of money for lunch for myself and my child and it definitely wasn't wor","useful":1,"cool":0},"rPc8yGfzplU4rqdRaVBW2g":{"text":"Very nice place to take a chick right on the water, beautiful view of the river, got shrim","useful":0,"cool":0},"uLweZ46Lf_nQg_2GUOCPyQ":{"text":"Great food, great location! Waitress very good. View is exemplary@\nJust have to say all th","useful":0,"cool":0},"Keo-FzHrfQldr9nDKQZUFA":{"text":"Great food -  I was really pleased that I didn't have to go to Acme, Felix's, or Drago's f","useful":4,"cool":1},"ADhxFqeAYUbLVVx8Gx-YZQ":{"text":"We had gotten a groupon for this restaurant for our trip to New Orleans.  We decided to go","useful":1,"cool":0},"VVqpXDf_6fjcCgkF1uvO3g":{"text":"Stopped in looking for oysters.  They were the worst oysters I have had and I couldn't fin","useful":0,"cool":0},"98R5cUtxYGah980n8bH_fg":{"text":"From the moment I walked in I had the sense this team regretted having a Groupon running. ","useful":0,"cool":0},"sASogOe26bAFWzO2yRPyqw":{"text":"The best grits!\n\nThe Crazy Lobster was able to save my vacation. It was open as the cold a","useful":1,"cool":0},"BmzXb3_ABh2YNaoonhdvQA":{"text":"My son took myself, his sister and his four children to this place for my \n55th birthday. ","useful":3,"cool":0},"FjQlleeN4m06sqsUThxrKA":{"text":"Great place at Riverwalk. Open air eating.  Bloody Mary and Hurricane are just right.  Sta","useful":0,"cool":0},"NBPMImIQrNbXBerfUzQKbA":{"text":"Okay. Not what I would have expected considering New Orleans reputation. Seated quick but ","useful":0,"cool":0},"FM1hbWfTe1jytfPL79oYGQ":{"text":"i would have given it a quarter star if it was possible.....\n\nfirst of all, my wife and i ","useful":0,"cool":0},"li11kNZNlOEV7fVOZHQBoQ":{"text":"Staff was very attentive. Had the gator nest as an appetizer and it was great. Crabs and s","useful":0,"cool":0},"-n_CYnEf90r5Cb5lvF8ASw":{"text":"How is this place even open???? It's astonishing to me that it's apparently been in busine","useful":1,"cool":0},"a02KQ3tkhc-LqNpjTfAzRQ":{"text":"our waitress was very friendly but the food was mediocre. perhaps crawfish is not in seaso","useful":0,"cool":0},"cBONsR2evUFKpKQcFrn60w":{"text":"Boiling Crab will kick it's ass any day, any time at a cheaper rate but hey, it's New Orle","useful":0,"cool":0},"vNQ5zQz1gKocKSnnYUHm-Q":{"text":"We ordered the Bounty of the Sea Cajun boil, which comes with a 2lb lobster, crab legs, mu","useful":0,"cool":0},"CqdCkdhuzl0ENCJw1ZSeNQ":{"text":"Go here only if you don't want to walk farther to find better food.  \n\nGo here only if you","useful":0,"cool":0},"SzVpfX2uWnQciRPr7og8wg":{"text":"My wife and I enjoyed lunch here today and both of us came away satisfied but it wasn't so","useful":1,"cool":0},"6LbyKqxA4EWM4MeDeUU4fg":{"text":"Cash and card accepted. The Crazy Lobster is located near the Rivermark Outlets and the ri","useful":3,"cool":1},"M-i3SabP52Z-hioFuXEBWA":{"text":"Food was really good especially the gators nest. Service was ok. I think they need more wa","useful":0,"cool":0},"Xi3PUr6mV_q-v7srzv5AXg":{"text":"Great atmosphere just for hanging out with a great view of the river and boats going by! S","useful":0,"cool":0},"LOZGik4-wmjrGMmWUNRf7w":{"text":"The food was not good. Bought through Groupon based on rave reviews and was very disappoin","useful":0,"cool":0},"blRIDd05Rs2b4AbTI3WhUA":{"text":"This was the worst place I have ever been, we waited 30 minutes just for a DRINK!!! If I c","useful":0,"cool":0},"kugrnKHSlU3RpWs9RRnTtA":{"text":"I give it a 3.5 .The food is good, if you're looking for some classic Cajun. The atmospher","useful":2,"cool":0},"ZMmUGSutFG7_kBygXzuq2g":{"text":"The food was not good. Bought through Groupon based on rave reviews and was very disappoin","useful":0,"cool":0},"gDtOEIh9whrbotVqJHdeUg":{"text":"I just want to start by saying that our server, Will, was wonderful. He was helpful and at","useful":4,"cool":0},"XYyIULnCCIyBkZw6zJNcKg":{"text":"Kind of a Tourist Trap, but worth it with its great view of the Mississippi and live music","useful":1,"cool":0},"JQ4ylVob8kuGcYJ7ZCvMtA":{"text":"Horrible service. Ignored after being seated for 25 minutes. Spoke to a waiter who said \"n","useful":2,"cool":0},"22XFTeWyi7MvSWbzItRxvQ":{"text":"We thought the prices were reasonable, the food was great. We loved the calamari and the j","useful":0,"cool":0},"PI1AtRS7k8QS7L7Ec5nKfQ":{"text":"We had a Groupon to try this place and quickly learned that you can get a lot of food for ","useful":2,"cool":1},"fnkFYKC1MSeKlGfcp_zHdA":{"text":"The food was great! The service even better. A great place to have a relaxing drink, liste","useful":0,"cool":0},"tYIsVjcdtsMCeYJn9BPpAQ":{"text":"This review only pertains to Yelp map. Please double check your directions if using Yelp m","useful":1,"cool":0},"bPHEJnUCKa5O1QTkafJ7dA":{"text":"Absolute worst dining experience I've had in a long time.  Party of 3 and we got seated ri","useful":5,"cool":2},"pNJI2FmZ85r8BQpGtr-Pzg":{"text":"We tried this place on our first night in New Orleans because we had a Groupon. Everything","useful":1,"cool":1},"5qPQubajq0gegzY7RLCBYA":{"text":"Great food.  Shrimp and crab were great quality. Awesome service from waitress Rochelle.","useful":0,"cool":0},"M_HyTj9Pb6At6ZuNbq5S7g":{"text":"This place was just horrible..... I wish that I never stepped  into this place. We went wi","useful":16,"cool":8},"M5QTRDlCtkNbHDu4qP8yOQ":{"text":"Our party of five arrived just before they were ready to open for lunch, but the staff was","useful":0,"cool":0},"pMa2iVmvh-5CdL-b60N2Dw":{"text":"We found a groupon for this a couple of days before. It was $50 worth of food/drinks for $","useful":4,"cool":1},"BXX51A-afIAdEAoWtynrrw":{"text":"I went here for a networking event and the atmosphere is pretty cool being right on the wa","useful":2,"cool":1},"nQ_kfFC1Yk0LBTHykazbrA":{"text":"I really enjoyed this place.  The food was good, the view was nice, and the employees were","useful":0,"cool":0},"Ky4J_Dy7uLTfP9hmiDg-Mw":{"text":"What's so crazy about this place are the prices of the dishes.   I came here on the last n","useful":3,"cool":0},"iBdw80iYGGn1Rzyc_L0zsg":{"text":"We got there apparently late for a fri night. the servers acted like they had better thing","useful":0,"cool":0},"OTnPmpppP2j7HNIvDPuWNg":{"text":"Our server Will was amazing! So sweet and checked up on us a lot. It was like a dose of go","useful":0,"cool":0},"kzoziRPvSz33IwMx2IhkNQ":{"text":"This is probably the worst place I have been in New Orleans. We waited forever for food bo","useful":0,"cool":0},"hVViZ8VIF8tlzCYciFoWRA":{"text":"Horrible service. Initially, we sat outside but we were never acknowledged. When we came i","useful":0,"cool":0},"AIRvcK05oNFugSF6YK-5Ng":{"text":"When in Tourist-ville do as the tourists do. \n\nLeah really really wanted to try Crawfish a","useful":2,"cool":1},"94BZiNPq8cFutLez1OOGNA":{"text":"This restaurant could actually give you a 3 or a 4 Star experience...depending on what you","useful":3,"cool":1},"cfGoCs3B9XDawp2obrGuAg":{"text":"We came on a Monday Feb 22, around 11:40 am beating the lunch crowd.  We had a super serve","useful":1,"cool":1},"2Skc_heJPasNdFE8mhl-Ng":{"text":"Fast service and great food. The grilled oysters were larger and more delicious than previ","useful":1,"cool":0},"Tw2H9yDb_khy_v8bk_oiIQ":{"text":"Really great!!! Went here the first night! And the last night!! Good food quality and port","useful":1,"cool":0},"ChNka9QvVDexeaC6gj5C7A":{"text":"Dear me. What a bad example of Cajun food! I got into NOLA for a big sweet potato meeting,","useful":5,"cool":1},"AL4JX4p6ithebRTJpgWr8g":{"text":"A group of 31 met for a Pre-Cruise Meet and Greet at this location, which was planned in a","useful":0,"cool":0},"EPmrRK-q4fgPdAIeJ2c4nQ":{"text":"AVOID AT ALL COSTS. Service was extremely poor, giving us a bad first impression of New Or","useful":0,"cool":0},"XcFzrZ5dSywNkzLNt8DcbQ":{"text":"Pros : Great view, decent service, decent drinks\n\nCons : Offensively overpriced, food was ","useful":2,"cool":0},"-3Wf72j6qBRM5JcLcQTixw":{"text":"Evacuated Hurricane Irma, we arrived in New Orleans and was looking for dinner on the firs","useful":1,"cool":0},"WirTp-9--ZRspyxgJlYU7Q":{"text":"Average food with a great location and good customer service.\n\nThe New Orleans food would ","useful":1,"cool":1},"y4CIqdHSo5roO-jDxKRRPQ":{"text":"Good food with reasonable prices. We started with beer on tap - Amber, which i think was p","useful":0,"cool":0},"IaE1TqeXDIfIjqch_dXufA":{"text":"I'm surprised by some of the negative reviews of this place because we had a great experie","useful":1,"cool":0},"WiL-8BoOft_Db4SR_7KtVw":{"text":"We went to The Crazy Lobster in November 2008. The 3 of us ate like elephants, and grazed ","useful":1,"cool":0},"66zqKFdL-uhMiWFjqUHokA":{"text":"I found this wonderful restaurant, right on the banks of the Mississippi, through Groupon ","useful":4,"cool":0}}