{"BYWRwOtiLsmABTG2yIHUMg":{"text":"These guys are awesome! Best burger restaurant in New Orleans. Service was on point, they ","useful":0,"cool":0},"k25OM0uHA3Lv2UoLI6eOXg":{"text":"The bayou burger is literally the best burger I've ever had. Great staff also -definitely ","useful":0,"cool":0},"O8C9KkkHfeN24WqYFAua_Q":{"text":"The burgers are fresh and delicious. Great sports bar on bourbon st.  I would definitely r","useful":0,"cool":0},"odVgvvhgWeEuhy9yVndFyA":{"text":"We were staying on Bourbon Street and passed by this place several times. The balcony look","useful":0,"cool":0},"c-eDYBANAeufl-cPT6Sevw":{"text":"Pretty good food, service could've been better but I'm not one to complain especially if t","useful":1,"cool":0},"vXWnj_w0amklh6Ab0LkTrw":{"text":"Wasn't that busy they might have had 4 servers on. Our server took forever to get us CANNE","useful":0,"cool":0},"qeHh5jFD28u2IxKMcdd7HA":{"text":"Stopped here about a year ago when my husband & I were looking for some real food on Bourb","useful":0,"cool":0},"fqN1OVi-tRljSUUiQjwSpw":{"text":"A group of five went late in the evening and experienced poor service. The restaurant was ","useful":0,"cool":0},"N8rT0EZz7izhqi5wlwbhCw":{"text":"Best dining experience I've had in nola so far. Mind you, it was like 3:00 on a Tuesday. W","useful":0,"cool":0},"zC7u2Ov75tByAp37bC5AVQ":{"text":"Arrived late in town and this was the perfect spot for a reasonably priced, quick meal. My","useful":0,"cool":0},"pPlom9-53PFsJio1gT9FRw":{"text":"Gator burger top of the line...sleeper spot dont miss.","useful":0,"cool":0},"2yDOQDdmIix7CTbZcpWlqg":{"text":"Disgusting food. We didn't like any of the items we ordered. We ordered the fried pickles ","useful":0,"cool":1},"tgt0zevXxgvetVhjyDerjg":{"text":"Best mac n cheese I've had in a long time! It's called \"The Wedge\". The top was nice and c","useful":1,"cool":0},"twFYa3O0Nxt-96oPXYok4A":{"text":"Not very hungry for this meal which was too bad as everyone seemed to enjoy their burgers.","useful":0,"cool":1},"D1dDV8mf1BefgY8SvVVwOg":{"text":"First time in Nawlins and babbyyyyy my friends and I enjoyed ourselves! If you come, enjoy","useful":0,"cool":0},"2eov0yULq2bTknTBUOMa1g":{"text":"The food was good, but not great.....but the service was absolutely awful. They really wer","useful":0,"cool":0},"bKnLJ3PdotIab6EXNrsDXw":{"text":"Food was good, Shannon our waitress was friendly and knowledgeable. We went with her recom","useful":0,"cool":1},"7DiE4ow8p2tYCpzqRu-jJA":{"text":"The service was friendly and quick and the balcony was nice. The food was just ok, I'm not","useful":0,"cool":0},"ZqP8BEgAB7EVZZFs-ZEOHg":{"text":"Great service.  Wings were good and tasty.  Bartender made great mixed drinks.  Lots of la","useful":0,"cool":0},"gIXug8p0XA33xu6N0pGkQA":{"text":"If you are on bourbon street you have to come here.  You can watch whatever game you want.","useful":0,"cool":1},"9pJuR9XDD8ztss7ejMdL_Q":{"text":"Went in by myself to grab a burger real fast and a few beers. The place was full of people","useful":0,"cool":0},"ahfB8-HQVACLOqOb3HGNkw":{"text":"Stopped in and had the alligator burger.... Not bad. The \"BBQ\" shrimp wasn't as good as I ","useful":0,"cool":0},"plSjyy50AL7nlR5qECiKWg":{"text":"Treated like an ashhole. Here with a group of friend who are into sports and they had to w","useful":0,"cool":0},"ZpQ5b6l2aftq_kDlrcwbNw":{"text":"Greasy food after a night of drinking. Burgers are cajun spiced, and expect a minimum of 2","useful":0,"cool":0},"1AIjPFQu2NYiycJ1SpnEfg":{"text":"Good sports bars are hard to come by in the French Quarter. Decent food and lots of TVs wi","useful":0,"cool":0},"UEv1u6XZoLe1UOt2qIX_Wg":{"text":"Dabrielle was a GREAT waitress!  Very helpful and kind!  The food was great! The bayou bur","useful":0,"cool":0},"83yBGB1_5vmXSabLN-0xNw":{"text":"Great food, great place to catch the game and great prices for quantity and quality. Also ","useful":0,"cool":0},"vbEbDwwdUBSY2HJHz5PKHw":{"text":"Burgers were fantastic and the sweet potato fries were perfectly made (crunchy outside & s","useful":2,"cool":0},"59Z2li8A54f6exLM4a4xPQ":{"text":"Good vibe, TV's everywhere. They took care of us quick. Food was ok but the server amazing","useful":0,"cool":0},"e-w_2Z5Dg_2HmK6D66Qjog":{"text":"Surprisingly good food -- creative menu with options for just about everyone.  If you need","useful":0,"cool":0},"GYg0hJlNA44GS8hSXgSvrA":{"text":"Stopped in with friends for a quick bite. I ordered the Gator Burger - this was the BEST b","useful":0,"cool":0},"ZS5Xt6t1Ew7pa2OXNDiwhg":{"text":"Amazing food and service.  Shay was our server and she is a delight.  What a contagious en","useful":0,"cool":1},"Q-rf0G0ByOsUmmBND5CjRg":{"text":"Stopped in at lunch time not expecting much from a burger joint but they had the most amaz","useful":0,"cool":0},"_1QaaAnPQvYijZZjNCyaSg":{"text":"I shouldn't even give one star , waited to be seated , seen a table open (it was packed) w","useful":0,"cool":0},"KNF1wBlSnN7OFpcbYUOfvg":{"text":"Great spot for a burger. Must have a IG appetite because the burgers are really big. We go","useful":0,"cool":0},"CQ1vqql2hggwfKU6ZLs8qA":{"text":"I went here on New year's and it was p\nPACKED, the waitress was really nice, because of ye","useful":0,"cool":0},"wgtiCFkoR6XVZQZgjAKR8Q":{"text":"Great burgers (especially the gator burger) and very good seasoned fries! the jambalaya wa","useful":0,"cool":0},"aVo0uza0oKrpB0yzFqL2Pw":{"text":"Stopped in here while visiting NOLA and I must say it was good. I had the burger, fries, a","useful":0,"cool":0},"D7Cy-NVeu_vBSH5m2WMDDA":{"text":"Nice atmosphere, friendly and attentive servers. All around good food. Id revisit  :D.    ","useful":0,"cool":0},"vvAdSzEg-8MBFrXlJ-NamA":{"text":"We arrived late to the area on a Friday night and decided to grab some dinner here. I wasn","useful":3,"cool":2},"1yskQsgqKu8TGKoq5WH_Yg":{"text":"My sister and I both had our credit card information stolen while we were on vacation in N","useful":0,"cool":0},"lCP5LqhA-nr8REM2JFLf_g":{"text":"If you are going to hang out on Bourbon street.. hang out at Bayou Burger! This place has ","useful":0,"cool":0},"gtT6wy-65oHebp--nOJ6rg":{"text":"AMAZING first place we tried after days of horrible food in Florida!!! Gator burger was am","useful":0,"cool":1},"PafizwPup3RJ5qoJstp-tQ":{"text":"Service was mediocre. Not at all impressive. Drinks were weak. Food was ok. Not exactly th","useful":0,"cool":0},"MKIfYFzpfCcx6EYOII_GPQ":{"text":"If you really want to watch sports they do have TVs...but who watches sports without the I","useful":0,"cool":0},"QjyPK_ryVREDEoJSN6VlaQ":{"text":"We ate the vegetarian burger here three years ago and we are specifically going out of our","useful":1,"cool":0},"k8YrJfd5IN9pK0EcU2lYBg":{"text":"You know a place is bad when after a day of drinking and just *needing* to eat something, ","useful":1,"cool":1},"Fu-5QxsRz7vQqZDI_XAO3g":{"text":"They say this place closes at 1am. At 11:30 pm, we went to eat. Guy at the door says no ou","useful":1,"cool":1},"ocJ4urxXTmfWGGfPUk2aAA":{"text":"AMAZING! Opt for balcony seating if you can--overlooks the bourbon street craziness! We wa","useful":0,"cool":1},"fTkkLl-8vH4_S3eRPPM6lQ":{"text":"Stopped for a drink and crawfish bienets.  It is a sports bar but I sat by the window and ","useful":0,"cool":0},"QcFkGjpqO7SZB_7ZXiG0og":{"text":"Touristy spot on Bourbon Street but most are.  Had a pretty good burger but the hype didn'","useful":0,"cool":0},"-Y7jgboMxhrf0TAoLZImOQ":{"text":"absolutely delicious! burger was super juicy. my husband had the zydeco hot dog. it was hu","useful":0,"cool":0},"MSAn1h06fBCimtF1CQLj9g":{"text":"Burgers are decent, not fantastic but you can customize them which is cool. Their french f","useful":0,"cool":0},"T7VFmTh4VGN1ScKBzkrsbw":{"text":"Wings are great, and we've always had great service! Must stop for a quick bite on bourbon","useful":0,"cool":0},"oP8a5cVW2TPCB9Ia3qn4Tw":{"text":"Ok. I hate this. I went here because we were able to get out of the rain here and get seat","useful":6,"cool":3},"2anjU4COpyhG7UD-sTLBYw":{"text":"Other than the friendliest staff- yes Joy, I'm talking about you! The Any Given Sundae was","useful":0,"cool":0},"qx4rhqgtqQQTB7SvQPh25w":{"text":"A friend and I came here for dinner and split the Debris Fries, cheesy cheddar fries with ","useful":0,"cool":0},"RmZ1CzMEslVBw2j8aeT3Zw":{"text":"Easily the best burger I've ever had in life., not even exaggerating about it!!!  Asked th","useful":0,"cool":0},"5oWjt9ZRZL-nVsqXoz4Xhw":{"text":"Have no complaints I was seated quickly. The waitress was very friendly, very patient and ","useful":0,"cool":0},"w2wOJak-lWh1Y0FzU8-nFQ":{"text":"Initially liked the place and thought I liked the burger until I took a good look at it in","useful":0,"cool":0},"REeeAFT81uI-J1IJ_k6SKg":{"text":"This place has great food but minimal in its decor, it has a long bar some tables, a few f","useful":0,"cool":0},"4DdgFgFniIkr4BjfR9HSIQ":{"text":"First place we ate on our NOLA trip, the gator bites were good and the soup of the day (it","useful":0,"cool":0},"-CweYPSpdH_gA5hHT9F4eg":{"text":"My boyfriend wanted a good burger so we decided to check this place out! I promise you wil","useful":0,"cool":0},"gIliPUnptgabeYlfYBMChA":{"text":"I was pleasantly surprised with Bayou Burger. We had a large bachelorette group (8) and ne","useful":0,"cool":0},"Ml-ZB729SPtTGEH1GB8wCg":{"text":"Awesome place to watch games with amazing food. The burgers here are delicious and don't s","useful":0,"cool":0},"2_Y7EGtVxMQaDRzMQ1_TsA":{"text":"I didnt expect much of a sports bar --on Bourbon Street no less --but I was pleasantly sur","useful":0,"cool":0},"dXtFob0yMOXOwjtJ0m4eQw":{"text":"My friend and I were in the mood for burgers and decided to try this place out since we ar","useful":0,"cool":2},"4CyrxZ0RQ_34TV00QVirXw":{"text":"All of my friends were talking about the selection of burgers, draft beers and cocktails. ","useful":0,"cool":0},"3dzjs5D-t0zhEFEHBSr0DQ":{"text":"Stumbled upon this place looking for a hamburger, this was pretty good overall. The Sazara","useful":0,"cool":0},"KejPkxP5NhIpqgpQBqua1A":{"text":"It's ALL good!! Nachos, wings, BBQ, hamburgers, and must have Debris Fries! Staff is aweso","useful":0,"cool":0},"jSDzl-CwzhBABnvVWfETSg":{"text":"This place sucks! The service is horrible. The hostess had an attitude. The server got our","useful":0,"cool":0},"oGIGOGqjA4gNKprci0DAnQ":{"text":"Was looking for a casual dining spot on bourbon street that had local fare and traditional","useful":0,"cool":0},"NW7r2sULxGfWJDRjMeimzw":{"text":"These people are the worst. We came to have some beers and watch foot ball and they were h","useful":0,"cool":0},"OYLKjMB8Z11B3suLCacVqw":{"text":"I was looking to catch the 49er football game (not playing the Saints) on a Sunday afterno","useful":0,"cool":0},"HNCzrT9r-Kv4WmVdq2aT7Q":{"text":"I was in NOLA with some girlfriends for a fun time. I had a little too much fun on our sec","useful":0,"cool":0},"VmabeR5G0CqPMxw1AsTYIQ":{"text":"Love this place!! Foods great!! burgers and wings are so big and taste are amazing!! If yo","useful":0,"cool":0},"5aW0uhxZZTHHxBFXI1sgrg":{"text":"Visited NOLA for the day and was craving a burger. The atmosphere at Bayou Burger was awes","useful":0,"cool":0},"zoGqu81LLr9TrIwU4CieiA":{"text":"Ate twice here during our stay in NOLA. The gator traps are a great appetizer. Chef even c","useful":0,"cool":0},"4OorCZ39-j0WCWYVZzGWRQ":{"text":"Great service ! Great food! Fun place to watch a game , just let the host know which game ","useful":0,"cool":0},"rE9_DO7f_xgfoYWt9crapg":{"text":"I felt like we walked off Bourbon street and into burger heaven.  The gator burger was inc","useful":1,"cool":0},"DBdqNuSJINNQf_m1A1uY4g":{"text":"Had lunch with my husband. Delicious burgers and great service from Jheron.(Thanks boo!) S","useful":1,"cool":2},"zNaIq_bExzc5xx4yX20OJw":{"text":"Great burgers. Build your own made me feel like home.  The kids had gator burgers. And lov","useful":0,"cool":0},"7qh9PZhVP7LnUWb0PMxeSw":{"text":"Bayou Burger what a disappointment you turned out to be! Tsk Tsk.\nNot only does your servi","useful":1,"cool":1},"IzVeUA5uKMFMtAmBDTWf6g":{"text":"Good food, and what you would expect from a franchise type restaurant. Portions are huge a","useful":0,"cool":0},"bPSNeJ2VVPwcp0Twli-few":{"text":"It was Selection Sunday, conference play was wrapping up, and we needed a place to eat and","useful":1,"cool":0},"lPl2zeJup_FAiphKJP-eNA":{"text":"Food was tasty!! Server was super friendly, but the wait for food was ridiculously long (c","useful":0,"cool":0},"6m3TjFeP5DDGik2zMQqLPg":{"text":"The service was....not great. There were five of us, and it took over an hour to get our f","useful":0,"cool":0},"qyVlyIWjclE2u13VF8W-mg":{"text":"Worst burger place in the city avoid at all cost burgers all small. Guy told me the burger","useful":0,"cool":0},"Ro1K-Na_CaQH-l4RUN424g":{"text":"I came here by recommendation from a friend. I was sadly very disappointed. The burger was","useful":0,"cool":0},"2LPPBdrzdSy6slep1YyBQw":{"text":"My favorite place in the world to have an Alligator burger!!! The slaw, pickled onions, an","useful":0,"cool":0},"P2nkIjCoonbM0bAwW-eZqw":{"text":"Great food. I ordered the Debris burger.  Our server Lawrence was a rockstar...make sure y","useful":0,"cool":0},"wteNr4pmQYs-2EScKS7Szg":{"text":"Need to grab something before a ghost tour.  Looked like we could get in and out quick whi","useful":0,"cool":0},"gcwngsqjdXYEjI9zPe0vcg":{"text":"Best debris burger in town. Fries were also amazing! Service was eh, but what do you expec","useful":0,"cool":0},"L1Des1XsPKAiQ-ft6PCVHA":{"text":"Good food, good service, don't miss the debris fries, they are the BEST!!! \nStaff is fairl","useful":0,"cool":0},"kjyfrVih4xdVOHdbl__yXg":{"text":"Greasy burgers- nothing to write home about. My boyfriend had a spicy sausage burger and i","useful":0,"cool":0},"EkgtdWvHwAjK294Lv7Pabw":{"text":"I grew up eating red beans so whenever I see it on the menu, I always order it. I'm usuall","useful":0,"cool":0},"WvvTZGgrlxzrWPF8YK_lIA":{"text":"Unfortunately I cannot split the rating between food and the service. \n\nI was down here fo","useful":0,"cool":0},"su0C6cKwspSYh1U0ahNt_Q":{"text":"Kris was an amazing server! The best we've ever had. She was so friendly and helpful in re","useful":1,"cool":1},"s3sMtAomA69BwzG9mq5PTQ":{"text":"Seafood is good, beef burgers are OK, venision burger is a phenominal disaster (even the c","useful":2,"cool":0},"nxWBWyptnO11xaorRdNLnQ":{"text":"The service here was great! This place is what you're looking for! It's not swanky and it'","useful":0,"cool":0},"i4DU91tEjPSvTVc2j2T-ew":{"text":"My burger was soo big and juicy. It was great. They just need a bigger restaurant for all ","useful":0,"cool":0},"BgJcjEmKMznRpATT-aF2mw":{"text":"They carry a gluten free burger and that's all but the buffalo wings and these circular co","useful":0,"cool":0},"q1YxC1f6NAbBkwvIcVvCag":{"text":"Went there Saturday evening Aug 14, 2016\nWitnessed manger and patron auguring over food an","useful":0,"cool":0},"WCUyVtDldAolFx1i2MqDiA":{"text":"Absolutely incredible! My wife and I stopped in while we were in town for a few hours and ","useful":4,"cool":0},"AfRSaknkoZXFWHq0AKwkog":{"text":"We were here for an American Outlaw watch party to watch a USMNT World Cup qualifier. Bein","useful":0,"cool":0},"5ClijosaqNT-Dby9DL8KFw":{"text":"If you are hungry for a burger.... This is the place! I had Bayou on a pretzel bun and it ","useful":1,"cool":1},"M5IdtWtGmdEv2GXCU-VUuQ":{"text":"Two stars because we had to wait almost 7 minutes for waitress to come by & acknowledge us","useful":0,"cool":0},"A8efT3puQorVxAPPTnG0Kg":{"text":"The manager was standing at the entrance and told us \"I ain't cleaning no tables\" when we ","useful":0,"cool":0},"GhmyM7rqnQzsIVkCOXxuAw":{"text":"Enjoyed lunch with some girlfriends on Fat Tuesday at this restaurant. The wait was maybe ","useful":0,"cool":0},"Ohrt5_nMaVAuErtV6_8nmg":{"text":"The best burger I have ever eaten, and I've eaten a lot of different burgers! I did the bu","useful":0,"cool":0},"5tYcBuDL7q-N_sNqGGIebQ":{"text":"SO...\n\nI was hungry, wanted a drink and wanted to watch my Aggies play.  Had the rest of o","useful":2,"cool":1},"ShOCZc54u-d0SElOiKfBcQ":{"text":"I had the Bayou trifecta. I like this option because I could try all of the dishes I was l","useful":0,"cool":0},"SPJLgRSQILRQ6tzYCcuxYg":{"text":"What a great little gem right in the heart of the huddle and bustle of Bourbon Street.\n\nTh","useful":0,"cool":0},"WDxZHdlEuWbLx9zTZe37ig":{"text":"This is a great sports bar for a number of reasons. Allow me to explain:\n\n1. Location - Th","useful":0,"cool":0},"jlMb1gwUoUqYPvU0lwo8FQ":{"text":"Sat at a table in a half empty restaurant, waited 15 min. and left not sure how good the f","useful":0,"cool":0},"LRBMYaxI4FTQ0QaKkKmFfQ":{"text":"I took my business colleague here for a burger and a brew and was very satisfied with the ","useful":0,"cool":0},"QMp8MSPcwUfxetAX_mGbVQ":{"text":"We arrived late on a Friday  night . My wife and I were staying at Four points by Sheraton","useful":2,"cool":0},"ozQjbhIzVZ4j6sbkWOKodg":{"text":"Enjoyed watching MNF here on our vacation.  Food and drinks were great but the wait staff ","useful":0,"cool":0},"jtMd-nN3U5B0VfibUqIQvg":{"text":"Very tasty alligator burger with homemade chips. Definitely will be back.  Service was awe","useful":1,"cool":0},"qiliHkyfWQuWanysO63Z_g":{"text":"Oh, I wanted to LOVE this place! \n\nThe meal took forever, which was okay, but then a table","useful":1,"cool":0},"l22IorT8qZ5yLdSjl4u5Hg":{"text":"Our last night in Nawlins and we came here. Now you'd think with Burger in the name that w","useful":0,"cool":0},"LcuezN9yDvcjPVVE7oc07g":{"text":"We were seated pretty quickly, even though this place was really crowded since it's on Bou","useful":0,"cool":0},"wMPASNBAKAQGWo5ThVJ3QA":{"text":"I hope you meet OUR BOY DARREL!! The homie hooked it up great suggestions about the menu! ","useful":0,"cool":0},"PTtWvoPb46iAJoA0BlEgCg":{"text":"The food is great, the atmosphere of the surrounding street is one of a kind, but sometime","useful":0,"cool":0},"lF5vHtzNbnfOTcjfbUb8_Q":{"text":"The wedge which is Mac and cheese is yummy!! Added bacon even better!!! The gator burger n","useful":0,"cool":0},"YQszPMxNh9-puZB8DJ8xdg":{"text":"Great find on Bourbon St that is not a filthy rat-hole. Good place to watch NFL games and ","useful":0,"cool":0},"2RgIErTI1Qy5NJnLUqgV8g":{"text":"This was supposed to be our first stop in NOLA. It was 2 pm and we were starving. The girl","useful":0,"cool":0},"Xt_yLkcGddga8A6pGVda4g":{"text":"Great place to grab a burger and relax.  I didn't count but they have around 10 tv's  with","useful":0,"cool":0},"Wmke8Mqt0hjDPvPHnIG7ag":{"text":"Selece is an amazing bartender!!! If you're on bourbon street, stop by to see her! Her Ore","useful":1,"cool":1},"i6n6mh7W9r79-AfsdkNb6Q":{"text":"Where service lacks, the food more than makes up for it. The BBQ shrimp and Thai Breaker s","useful":0,"cool":0},"kLDGRPhBG-5z38wVnaOXxA":{"text":"Manager is terrible. Place filled w Husky customers and he will only put the game on two t","useful":0,"cool":0},"VRj6J3rcM3n9IetXplkzIg":{"text":"Awesome food. Awesome service. Have gone there every time I've been to New Orleans. I love","useful":0,"cool":0},"tV7VqrCtK1H-96zrv5nvcw":{"text":"Mediocre food. Sub-par service - there was only one bartender working during the NCAA Men'","useful":0,"cool":0},"MlVzoatZK0lsxsRP72WklQ":{"text":"Worst service I've had in NOLA. We waited over an hour for our food when other tables were","useful":0,"cool":0},"9cC5tkWZ9nDtnSLFLq7PwA":{"text":"This has great burgers!! There were 3 of us who were all very satisfied with our food. One","useful":0,"cool":0},"ZphxOWPAEsZCwG_Hu7gHIQ":{"text":"Frankie was the bomb as our server not once but twice. Wonderful atmosphere and terrific f","useful":0,"cool":0},"jsXYQWQx_POR3x3xd390cQ":{"text":"Went on a Monday night to watch basketball and eat. \nOur waitress was so sweet and caring.","useful":0,"cool":0},"gCEuN_fmWN88GmSQNWXPCg":{"text":"Food was great Crystalle was fun!!  this lady was freaking awesome! She's super fun! She'a","useful":0,"cool":0},"9qxB-19gbiFZ4is5O-KKlg":{"text":"My wife and I decided to try this restaurant & so glad we did, it is fantastic & the staff","useful":0,"cool":0},"3obKXQXMWJ8kkrKYAPwJmQ":{"text":"My family and I are spending the weekend in New Orleans for the second time. It is our fir","useful":1,"cool":1},"0nBsiVomiD45i9_7cjsMow":{"text":"The food was good, the service was very friendly and the air conditioning was wonderful in","useful":0,"cool":0},"_--lRmeAbHBuJVIUbhhyDw":{"text":"My boyfriend and I stopped here on Sunday after the Easter parade. We put our name on the ","useful":0,"cool":0},"U9LUJEvrizWO8sCtrj8A_w":{"text":"A friend works there and occasionally brings burgers home. They're not bad. Have no idea o","useful":0,"cool":0},"kQQgchWim3hGPZ1MXa2bFA":{"text":"McKayla's not impressed!(can we bring this back please!)  \n\nOn my first trip to the French","useful":0,"cool":0},"-lR83rg88lPY0CqAF61mPw":{"text":"Burgers were very well spiced & creative. My husband had the \"croquer\" with gruyere, ham, ","useful":0,"cool":0},"znBvNVXbkI03ozaCdy2aSg":{"text":"Stopped for a quick bite before drinking. The red beans and rice was delicious. Not sure a","useful":0,"cool":0},"3D6l2YbWDjOZZSDyP1NFTg":{"text":"They have lots of TVs and will put any sport you want. The food was actually really good. ","useful":0,"cool":0},"In4eErdOCUUDpX0Bz9l1Vg":{"text":"Great service on a Saturday night at 7. No wait, and the waitress actually was conscious o","useful":0,"cool":0},"jukDpAH5RGzOp5U9WQRfXw":{"text":"Good burgers.  Very noisy sports bar.\n\nYou must have the Crawfish Beignets as an appetizer","useful":0,"cool":0},"QG88djtOU26JZzb7J6pADQ":{"text":"Four stars because the menu options are prevalent, and the food is goooooood; there's some","useful":0,"cool":0},"2ttTkc8CryaluTcl0ugQPQ":{"text":"Best burgers in NOLA! \nAfter all the seafood I've eaten it's nice to see a place that offe","useful":0,"cool":0},"qBhRUkaQSEVVMf3jNRbC4A":{"text":"They did not honor the coupon because it said it was Mardi gras season :( \nThey should hav","useful":0,"cool":0},"hhDVIG28h7rb0_qhI6UDmQ":{"text":"I really enjoyed this restaurant. We came here on a beautiful night and sat on the upper d","useful":0,"cool":0},"7MxIUo_vxE8f2aM001KcZw":{"text":"Food was a 3.0 service was 0 \nPretty bad service. We sat on the balcony and no body attend","useful":0,"cool":0},"UnPJ3YPGCU_Enkd0sKq0xA":{"text":"Absolutely delicious food! \n\nSuper tots: I didn't love these but my boyfriend did and demo","useful":0,"cool":0},"mZZoTfQoXhAGUojiExixeA":{"text":"Stopped in here twice this last week while on vacation.  Everything is pretty pricey,  but","useful":0,"cool":0},"OKCDE_6RQ_KPZM3FgFkbcg":{"text":"The manager was extremely rude. After we were rudely told that there was a strict no chann","useful":0,"cool":0},"kA9_QVIM2wNTSDeRyeeRKw":{"text":"Dabrielle....thats all I can say!!! Our server was so good I remembered her name and thank","useful":0,"cool":0},"vZNB3vWLBHyeJRKDYSRyVg":{"text":"Our waitress, at first, was very generous and kind. Sweet personality. Then they changed s","useful":0,"cool":0},"0Ep47GrGZL8ob3MeZJOLLg":{"text":"Stopped there on a whim... Very good food. I had the chicken sandwich and it was a huge po","useful":0,"cool":0},"IwPXXFugBwEHvmZ-JCGTaw":{"text":"The service was a little slow but the food more than made up for it. The burgers were deli","useful":0,"cool":0},"JF1SwicxkOUFa-LxbZaWRw":{"text":"Went to Bayou Burger for lunch and our waiter couldn't accommodate all 6 of us at one tabl","useful":0,"cool":0},"GbvSz7j9yg8SLq_ORt9cnw":{"text":"It's a loud raucous of a bar in the middle of bourbon with open windows for you to hear th","useful":0,"cool":0},"oZZ6pkeiaMD5QQF5RKEnnQ":{"text":"So delicious!!! We sat up in the balcony area, service was great, drinks were good and the","useful":0,"cool":0},"k7nhebv9lukfvtXh2yMhMQ":{"text":"We ate here because I was craving a burger and it was an excellent choice! I got the Bayou","useful":0,"cool":0},"p9rDaQymBJTIBk298yDXUw":{"text":"The manage was rude and harassed the worker about allowing us to feel the heating lamp. Ve","useful":0,"cool":0},"wqp-O8ptCxLbE_1KeRpvEA":{"text":"This place is right on bourbon st so very convenient. We had the bbq nachos. They were the","useful":0,"cool":0},"J3f6XZO2iGgLkSo11iqJ5A":{"text":"Walked in at 9:15 at night. It was not busy and there were plenty of tables. Seemed we inc","useful":0,"cool":0},"Cv4ta8bgmNIHhNxpwWw8hg":{"text":"Chris was amazing! She not only gave superior service but she gave us some awesome local t","useful":0,"cool":0},"pqu01LIxthLJElAvhBu5Vg":{"text":"Our server Cristalle was awesome! Great recommendations, Gator burger is the cats ass.","useful":0,"cool":0},"UIWiV2THDSDPNOlrWhVk1g":{"text":"As a Texan... I'd assume I know burgers... and this place seems to know too.\nHonestly, all","useful":0,"cool":0},"6FbXWS-Jhwzyrq5LLb3vAg":{"text":"Good burgers. Good service.great place to watch a game and watch bourbon street.\nWhat seal","useful":0,"cool":0},"Cm4H6p4kyR7gfA-Z1iTAuw":{"text":"My husband and I normally stop here when we are on Bourbon St and it's usually delicious b","useful":0,"cool":0},"I-j_dzjGOlks0RzcPmlQwg":{"text":"This restaurant is great! The food is amazing and they have very large portions (definitel","useful":0,"cool":0},"qdtHwUMQ12ZkOYxwRn9Teg":{"text":"Loved the red beans and rice. Decent prices. The service was good as well. Definitely a go","useful":0,"cool":0},"vO40SeAK3w2H3cr3dAEILw":{"text":"the seat was good with a nice view of Bourbon Street the fried pickles were also good but ","useful":0,"cool":0},"XEWU1YZrhNnPgc5qdvSo3A":{"text":"Wanda, Troy and Nikki were excellent.  I've never experienced customer service like this b","useful":0,"cool":0},"B8w9CKgUHi-jPfCPcyiz_w":{"text":"Cowboy burger is the bomb!  Friendly people, however i do not like that they only have mil","useful":0,"cool":0},"dU2e90DAkiGU14z-f_qNOw":{"text":"This place should be called sodium palace. Everything was WAY over seasoned and salted. My","useful":0,"cool":0},"DHD2pBwbMIwbpG9IcoO4HA":{"text":"Engine 29 burger and sweet potato fries were fantastic. My beautiful wife tried a hamburge","useful":0,"cool":0},"UuOd_1e8uz_wF5b58FD4vw":{"text":"We dined here twice. The first visit we shared the Ultimate Cure...excellent burger and fi","useful":0,"cool":0},"InyDScMiQbLog49yYErhTg":{"text":"When in a mood to watch a sports game, come to this spot! \n\nI am a die-hard Giants fan so ","useful":1,"cool":1},"YjTPPitd_nb24eTPLhzbCw":{"text":"We had the buffalo style wings, nachos with pulled pork. For dessert we had the beignet fr","useful":0,"cool":0},"eqCc4vIm7p2Vv6Zllu9Gvw":{"text":"The food was great and our server Jasmyn was very friendly and helpful. Great people watch","useful":0,"cool":0},"eOa2xl26Pa4oSgGMu49RMA":{"text":"My wife and I came here on my first trip to New Orleans and absolutely loved it so we deci","useful":0,"cool":0},"6XpZsYLJvR1uzBPzTUnuzQ":{"text":"Went there the other night, 3 burgers a fry with the drippings on it 1 Whiskey drink, one ","useful":0,"cool":0},"xvi9jLVy2DSzkX8pToQkLA":{"text":"Burgers are a greasy, disgusting pile of garbage, some of the worst I've ever had. Servers","useful":0,"cool":0},"Iy0vgwzQZGIBCYSVqPuoBQ":{"text":"My husband had the washtub fries and I had the run chicken run. Service was slow and waitr","useful":0,"cool":0},"FnAvM7O_ZEUUVC6JyrZdlA":{"text":"I ate here twice during my stay. One lunch and one dinner. All I can saw is WOW! I really ","useful":0,"cool":0},"4JAqBXdrhFLRDrJpzXoMRg":{"text":"Eat upstairs on the balcony.  Great view of Bourbon street.  Food was pretty good and our ","useful":0,"cool":0},"_LZyqgNSCZeGXkYM6OG5KQ":{"text":"Well, there are mo menu pics. I strongly suggest you inquire how things are cooked and pre","useful":0,"cool":0},"lItCiDDpQOPqsnmryMC86w":{"text":"Deserts good; BBQ shrimp too much work - Peel & eat...  only get a tiny piece - it falls a","useful":0,"cool":0},"aKm1yLFLRYGkvqAi6bFSEw":{"text":"Stumbled upon this place on way out of bourbon street. Skipped the burger and fries and tr","useful":0,"cool":0},"DANEZo7CEJCJeJneVsW8nQ":{"text":"So the food here is decent. I like the friend pickles a lot and the wings are good. A litt","useful":0,"cool":0},"ZpywCHb3X3mkpUC8AzigfA":{"text":"The Couchon Nachos are FANTASTIC.\nThe pork is so tender.\nMy waiter Kelton was attentive an","useful":0,"cool":0},"EFGu8FOPz_0sy-sHi1btuQ":{"text":"I wanted to give these guys a better review but there were a bit too many things that didn","useful":3,"cool":3},"9WcajIG8E6p8K-byrPFIYQ":{"text":"Came here for lunch.  It smelled like puke in the restaurant, most likely since it's on Bo","useful":3,"cool":0},"h2S4c93o8Jz-KPFstqsVoA":{"text":"Great food in convenient location. Also, groovy atmosphere (though can be loud inside some","useful":0,"cool":0},"HuSkcN4_Rs1Q81LkesuPzg":{"text":"My son and I were thirsty and hungry after sightseeing in the Quarter and just happened to","useful":1,"cool":2},"iej3Lj-lSfB44l08msIfuA":{"text":"Great burger, great service.  The guy upstairs helping us a couple of weeks ago.   Great f","useful":0,"cool":0},"Y6oEUuDc-by313LFfP36YQ":{"text":"Meh. We waited for over an hour trying to get a seat and kept being told it would only be ","useful":2,"cool":0},"JNTxyBjDg_dELL3gMcbVBA":{"text":"Ulysses took great care of us for our first stop on Bourbon street.\nAmazing burger, jumbol","useful":0,"cool":0},"rq5jsWWpmzQEd9TOC4mQWw":{"text":"Last night we ran into Bayou Burgers just to try someplace new and we had no idea what to ","useful":1,"cool":0},"jqX72Ju1CMkF4p4TSjfgEA":{"text":"Tough call on this one. Bourbon street does not have a lot of traditional sports bars. Wit","useful":0,"cool":0},"K3CFJ_49d7fjU_V77eMjXg":{"text":"Food was good. Service was very slow. Complained to manager who literally argued that wait","useful":2,"cool":0},"AOANcc47dJW-vb_yuU_IcQ":{"text":"Our group had dinner here on Sunday night. The food was decent but the service needs some ","useful":0,"cool":0},"n7Lpj20ZrgzS532kN_YK2A":{"text":"After a night of drinking stopped for a big burger to hit the spot. We got the Bayou Burge","useful":1,"cool":0},"hbL4JLbGTrCGSIbYhok7ig":{"text":"I had the veggie burger with a side of kettle chips and it was very tasty. We had checked ","useful":0,"cool":0},"0gjsBPF7lPTrDZKgtW66dA":{"text":"Oh my! Beer, Burgers, Boys, Boobs! Not much more you could ask for in this place except fo","useful":0,"cool":0},"bycuRNUfIKSFniTRE3skjQ":{"text":"For a place that's in the heart of the madness of NOLA I must say that the food was pretty","useful":0,"cool":0},"pn87ysYoKSaG5oXFCt7phA":{"text":"What a great experience! We stopped into Bayou Burger & Sports Company on Bourbon, after w","useful":0,"cool":0},"Mjm7Rd9J5y9Xi0uNIggpbA":{"text":"Hell no. Definitely not eating here. Walked in, planned to eat here, got seated, saw how c","useful":2,"cool":0},"X51qM5owYk_n56LGv7JOrQ":{"text":"Good food, good service, chicken wings were good. Came here to watch the packers game. Goo","useful":0,"cool":0},"fK7BjcXPxnCTE185laa3sQ":{"text":"Okay tasting food, but they refused to substitute out the green tomatoes for red onions in","useful":0,"cool":0},"GbQPJE0VikervIn2EEgiLQ":{"text":"I had the gator burger and gater traps for the appetizer it was soo good! My husband and I","useful":0,"cool":0},"jbJQndw6od2KSs8wiWABzA":{"text":"It was our last night of vacation and we were craving but steak, but it was late and could","useful":0,"cool":0},"Dp-SW0IkdEXdku7c23ff8w":{"text":"Imagine my surprise to find a greasy burger joint with GLUTEN-FREE buns!!! Honestly, the b","useful":0,"cool":0},"iMwDSP_nFoHMXDbpOWcTJw":{"text":"Bayou Burger had some great selections & the bartender helped us to decide on the cowboy b","useful":0,"cool":0},"Hc7CuK5tQIrH9Kb47RNN8Q":{"text":"We were looking for a place to watch the Sharks hockey game and found that Bayou Burger wa","useful":1,"cool":1},"M-z02_nwHho0Gqu5ZXK1jA":{"text":"This place is like a buffalo wild wings but the main draw is the burgers. I went to this p","useful":1,"cool":0},"Ohrmor1XMYSVVbiyIhyxyA":{"text":"Stopped in while in town. I'm usually not a burger fan when it comes to most restaurants b","useful":0,"cool":0},"aGEOHcWNKXR_uG1lgDLjKQ":{"text":"We stopped in for a couple of beers to go. We hung out for a while and watched a few minut","useful":0,"cool":0},"h9tvfRNqUi0dtG0zfuHc9A":{"text":"Great menu, great ambiance, great food, great staff, great service.  I will definitely rep","useful":0,"cool":0},"s2RxN7k5eJKqMaNPd4Jf-Q":{"text":"I had the Ultimate Cure. I made it through half of it but only because it was so much food","useful":0,"cool":0},"YCtE_yXDs6N2MfR2yZ5i9Q":{"text":"Great burgers and drinks. We went on a weekday at lunch and it wasnt too crowded, had grea","useful":0,"cool":0},"5wnOgkBmO62cOPhHeIepNA":{"text":"Very delicious burgers. It's a must visit. Table setup is. But strange but there's plenty ","useful":1,"cool":1},"VA2gPOMtFQ960Nx7cbuEiQ":{"text":"My girlfriend and I visited New Orleans from Canada. The Bayou Burger was recommended by t","useful":0,"cool":0},"90LX_b8Ddo8q4YGgFjyaKQ":{"text":"We Yanks take our burgers and our pizzas seriously. So, when I tell you Bayou burger is th","useful":0,"cool":0},"dk89ardzKoasjRH-WpuF2A":{"text":"New, clean restaurant. Expensive burgers and sides, would not cook burgers as med rare. Ca","useful":1,"cool":0},"45HSn0QQlbdv3l9FhIiBjA":{"text":"Shey was a great waitress! Gator Burger was delicious, and atmosphere was one of a kind! \n","useful":0,"cool":0},"yTcSvk4Vk9cDpdA9jzbCWA":{"text":"The food was good service on the balcony was slow almost 30 minutes to get a drink after f","useful":0,"cool":0},"niML_GSmbnLKBYq8Y8v3cA":{"text":"Food was amazing. It's a nice little sports bar on Bourbon St. Wish we could've sat out on","useful":0,"cool":1},"CLxFlxmnwdz56HaWh0KYfA":{"text":"Winding down our visit to NOLA, we wanted to at least once experience one of the French Qu","useful":0,"cool":0},"gOkJ320Fsmm9152eX2wMRg":{"text":"Horrendous! Service was slow and the place feels dirty, but it's on Bourbon so I should ha","useful":0,"cool":0},"G0VJTDgycWwuHU86B9Gppw":{"text":"Worst dining experience I've ever had. I went in with low expectations...burger bar on Bou","useful":0,"cool":0},"6iDZFisngQ9UMaOkFppYYg":{"text":"Seemed really cool. The burgers were good. The wings were not what I expected- they were t","useful":0,"cool":0},"KRnW8vQAWwsRo7JogjTAJw":{"text":"The food on Bourbon Street is generally not that great.  When I visit New Orleans I usuall","useful":1,"cool":2},"c4qJLsZNppj3oWGHJ_2GxA":{"text":"Atmosphere:\nLocated right on Bourbon St. with an open patio... If you're not there to watc","useful":0,"cool":0},"YlRpigYnmbZ_g5FXMagM_w":{"text":"What a great place for lunch on Bourbon Street! We stopped in on Mardi Gras day with 5 of ","useful":1,"cool":1},"WKAvxLToGV_HTZvDtvctnQ":{"text":"Portion sizes are huge!  My husband and I ordered appetizers and it could have fed 5 peopl","useful":0,"cool":0},"-kHvo5NHUbr8YntRAQ2zjw":{"text":"One of the best things I ate in NOLA just because I'm not big on seafood. Burgers were gre","useful":0,"cool":0},"Xv2yTNWd0cRXrBJgRSz-RA":{"text":"If you are in NOLA and need a place to watch sports, this is your jam.  On a Sunday during","useful":1,"cool":0},"zjNaIM8DgHAhh7EkAHIe6w":{"text":"The food was good enough.  I had the BBQ Shrimp.  The server was kind enough to warn me th","useful":0,"cool":0},"zQN2C136bKGvyU_-5WJOqQ":{"text":"Service was very slow for a restaurant that was less than half full.  We had hoped to be i","useful":0,"cool":0},"bDo11E5d_qwAumOMzP8ypQ":{"text":"Their food is INCREDIBLE, when they haven't run out of what you're trying to order. They c","useful":0,"cool":0},"YmIhK8EZsTJbCL2AWhXOfw":{"text":"Went here with my colleagues for our biweekly team lunch! My burger was amazing and the wa","useful":0,"cool":0},"ns3pDQhA7smi5VRlONxHbg":{"text":"Good food good atmosphere great service right on Bourbon Street how much better can it be","useful":0,"cool":0},"XsGT-nbH-zFMBVL61mAM_Q":{"text":"Stop here because they were playing the Hawks game and my husband was standing by the wind","useful":0,"cool":0},"B5hc1TVwWKPKYWwlb8GRDQ":{"text":"Tourist trap !!!! These burgers aren't as big as they seem on the website. Do yourself a f","useful":0,"cool":0},"Btp1ddLC4X1ht0PSAQCIvg":{"text":"Burgers were solid for our guests.  I had a bacon cheese hot dog and it was a good alterna","useful":0,"cool":0},"aFhlYbVcsOdw3M6-a6nWHQ":{"text":"We were looking for a restaurant serving a Cajun Style dinner for Thanksgiving, sitting fo","useful":0,"cool":0},"bHjRjequ-fSMfPU_kYq4bQ":{"text":"WOW!!! Great place if you want to leave stuffed!!!! We had an excellent waitress - Dabriel","useful":0,"cool":0},"x-jLEMY5366rmF446lO4vg":{"text":"Really good food decent prices. Thomas was a great waiter but felt a little rushed. \nThe b","useful":0,"cool":0},"GKOisEpS_XLWr5ex2iyFTQ":{"text":"LOVED this restaurant, However, I was on Bourbon St. one night standing outside of the res","useful":0,"cool":0},"-xO7-8NW1yZ0v758qa5R8Q":{"text":"Ordered the crawfish beignets, should be called corn hush puppies. Dry and definitely not ","useful":0,"cool":0},"XfSZLLgaEK_S0zgHgc2TOA":{"text":"Good burgers, ordered the Cowboy and the hunter. The wings aren't that spicy but have good","useful":0,"cool":0},"fQFOH1nql-mfiGgDH6qaGQ":{"text":"Lots of tv's very open, clean spot on bourbon st. I know most are on bourbon for the 3 for","useful":0,"cool":0},"xn1uZzWgEgx5NaSb-NkO5g":{"text":"We spent several hours watching NBA playoffs here today and we loved hanging out at Bayou ","useful":1,"cool":0},"lF83bozhEnYGSlWslsJVAA":{"text":"Very good service and good food. Definitely would recommend to come here. Shay was our ser","useful":1,"cool":2},"7aATQwI2N_dKymk1ojomlg":{"text":"Great food. When we first came in, it took them forever to seat us. We sat down for 5 minu","useful":0,"cool":0},"H-3yoiFh2QdZdRGokh5MyQ":{"text":"My husband and I both enjoyed the food. Started off with the corn dog bites which were tas","useful":0,"cool":0},"QQJ1mENfJe-30Kb7kKSNRQ":{"text":"This place came as a recommendation from our hotel. With that we received a card for a fre","useful":0,"cool":0},"t0Fj3lby5udSXA4Vdy2ysQ":{"text":"The woman at the bar ignored me for a good 5 minutes while there were no other customers a","useful":0,"cool":0},"Gd22U2YubHA4zxWpuOdFkg":{"text":"Wings were slimy but sauce was great. Fry skillet is something special. Attentive bartende","useful":0,"cool":0},"kU0xoEBl9hpr786CbhknmQ":{"text":"Really amazing food and ambiance, host are great! Only thing don't get the nachos, they we","useful":0,"cool":0},"CfvwOZ631qxSockBMd0zWg":{"text":"Best Burgers in town!!! This place is great to watch any game or a nice meal on the balcon","useful":0,"cool":0},"fsNJmnUjnYwjTIkRBZetdw":{"text":"Great burger and cold beer. The Engine 49 and Blond Ale went great together.  Excellent se","useful":0,"cool":1},"AOT1mLerpiNCZVNdxHG0qw":{"text":"An overall interesting place, but wasn't wholly impressed with the food. The beef was comp","useful":1,"cool":0},"an3C83ipC2yr7l8tqg2tMQ":{"text":"I wish I could tell you about the food, but I have been waiting for my hamburger for an ho","useful":0,"cool":0},"QntLb5bYqrsCipMIYfgf-Q":{"text":"My family ate here and for the most part there was disappointment. The chips were excellen","useful":0,"cool":0},"At0wi5VPodltJtV-FFn03Q":{"text":"Amazing burgers and creole food! 365 degree view of the tv's, great local draft beer selec","useful":0,"cool":0},"udgPr-BuDqM-Fm7ogI9Khw":{"text":"Delicious food on bourbon. Nice sports bar with tons of tv. They have the best hurricanes ","useful":0,"cool":0},"J1M6XwI_0cXRTW1swp_R5Q":{"text":"Come here for the balcony seating for a good view of Bourbon street from above.  We came o","useful":0,"cool":0},"3vgDAqcxUJ0hl0cqYGR_mQ":{"text":"Love love love this place. Still in the mix of things but nice place to sit and eat. Burge","useful":0,"cool":0},"2Bg5nbzcJbIzy12csC7eog":{"text":"Horrible staff. They were very rude to a local group more than once. The last straw was 3 ","useful":0,"cool":0},"BVPrlunh3SFWGhNP-6dnbA":{"text":"SO LOUD. So so so loud. My friend kept getting his chair bumped into. Our server was very ","useful":0,"cool":0},"BDlC_T7xqPdgy_LMB6IW6Q":{"text":"Great place to start with on Bourbon. Great view of the street and strong drinks. I recomm","useful":0,"cool":0},"i4iGC-ZEmhdY8GTWt1sCSQ":{"text":"Ummm, disappointed that it's 11:30 pm and I came to get my grub on, only to discover that ","useful":0,"cool":0},"cy2e1g1tCZwWzp-zZ3dIzg":{"text":"Let me start by saying being from Chicago I have high standards for my burgers... That bei","useful":0,"cool":0},"-yoeHmy3Qch2MorVpOxLdQ":{"text":"Not a very good burger place. Gator burger was the best of the 3 from our party. The hail ","useful":0,"cool":0},"rw_5EuRhvVAUmXu-2Ra7xA":{"text":"The burgers here are phenomenal! And HUGE!! Both my husband and I ordered a cheeseburger w","useful":0,"cool":0},"SlAfQQLJvmpetG5ujmJOHw":{"text":"Solid burger joint on Bourbon street! Creative burger combinations and packed with flavor ","useful":0,"cool":0},"vw_slAM9UFWyPQ6qvfLiTQ":{"text":"Came into this place on a Friday night. Was seated immediately. There were multiple TVs wi","useful":0,"cool":0},"3AUf7MYg8CGMhlKzpHAGMA":{"text":"Good burger..i had the cowboy with sweet potato fries..the only downfall was the wings my ","useful":0,"cool":0},"DM7ryR2iuCMJcmS9kHxQyw":{"text":"Service was ok. Sat at bar! Busy and loud place. The onion rings and debris fries were gre","useful":0,"cool":0},"kzsPdcHcdtVdLvwdJ1ExsA":{"text":"I can't rate the food, since we left before it arrived. Frank was our waiter and took so l","useful":0,"cool":0},"rV8CAKcY2HBggkPm23XTFQ":{"text":"Get the the Philly burger! It's amazing! Red beans and rice is ok. Server was great! Drink","useful":0,"cool":0},"miN142c-5Rfr3w1OobNHLA":{"text":"Stopped here on a Saturday for some cheese fries and a drink.  Sat on the balcony and watc","useful":1,"cool":0},"6kNucHPcT7R0BFf36Qy1VA":{"text":"For food right on Bourbon Street, it is  really good.  We do not drink and have noticed mo","useful":0,"cool":0},"gYJyPTUZjzm84Az1cC_KIQ":{"text":"Great place to grab a burger on Bourbon St.  Food was great, large portions, especially th","useful":0,"cool":0},"VtwTpOE6MroiFk4U44g5VQ":{"text":"Great sports bar can be really loud depending in the team playing. Service they will get y","useful":0,"cool":0},"Hb0Q7p1RMIUZtr7dy2HJnA":{"text":"watched Brazil vs Colombia here today. good beer, good prices, and huge selection. I had t","useful":0,"cool":0},"ntI98tZ5oOfqO5y5QcLAkg":{"text":"All I can say is they have the \"CURE\" best burger I have ever had! Had to make a special t","useful":0,"cool":0},"Q5dDLt2TXAD-vRwo48rsIA":{"text":"This was our first meal when we arrived in New Orleans for a bachelorette party and the fo","useful":1,"cool":0},"f3nCGK4wp1HPiwz18p0g9g":{"text":"Service was spot-on and the food was very good. I built my own burger and it was tasty and","useful":0,"cool":0},"K3a4SEcdH8k1D0g7X4Vh_w":{"text":"Great burger, shitty drinks, lots of game day Tvs, decent service. For being a bourbon str","useful":1,"cool":0},"ieNm02SQE08drW_74l4wjw":{"text":"The Burger was great! And my gawd the crawfish ball funnel cake things were the bomb! The ","useful":0,"cool":0},"0O-PaPDFLWlkWJTyALvtLA":{"text":"Service was not great and the food was unimpressive compared to other NOLA restaurants. Ma","useful":0,"cool":0},"1uzu8zvddvUKRM3YkFfkpw":{"text":"In NOLA last week of December. We needed some food after a fun night of drinking. We went ","useful":1,"cool":0},"6CRJrjS03dm8aSu7Xvi6Rg":{"text":"Wife and I had the fried pickles (awesome), the trio of gumbo, jambalaya, and beans and ri","useful":0,"cool":0},"HCmBdPygfu-rnkH-5PkKEQ":{"text":"Flavors good, but extremely slow service when Restaurant was only 1/3 full on Thursday nig","useful":0,"cool":0},"keUkDKbFA2B-ocU5JA0w2g":{"text":"My girlfriend and I visited New Orleans from Canada. The Bayou Burger was recommended by t","useful":0,"cool":0},"lHBG_WlJOXSYBZFeO6-iMw":{"text":"The buffalo wings were about 5/10. They had very few speciality drinks, which was a little","useful":0,"cool":0},"3F6QjOrVKRWGn318_w_XhQ":{"text":"Had a late lunch here. Burgers here are good, but the seasoned french fries that come with","useful":0,"cool":1},"kle3DgWg-yqfcnlZBjUQCA":{"text":"Okay, so totally new place. I feel sort of bad giving it four stars because it has killer ","useful":1,"cool":0},"TkBfHjrsZOeCLn07gl9T3w":{"text":"We had the Gator Traps and they were delicious! Beer selection was great when we could get","useful":0,"cool":0},"lNQLPFfGw84mQRVI4fjJBQ":{"text":"Our server, Shay, was OUT OF THIS WORLD AWESOME! The burgers that they serve at this place","useful":0,"cool":1},"a3MxJv9TM3fuCoAmuOu5cQ":{"text":"Excellent gator burger! First time ever having gator and it was fantastic, and also the co","useful":0,"cool":0},"FBnq8O_uBBexlujUhqO4fw":{"text":"One of our last meals in this great jazz city. We thought we'd try another local joint in ","useful":2,"cool":0},"iDawp1uvR3t-kABXFMi8GA":{"text":"The service is phenomenal (thanks Kelton) and the Gleason burger is outstanding. Highly re","useful":0,"cool":0},"WESNenH6zXdWakGt6UOsbQ":{"text":"Our waitress dabrielle was amazing. Constantly checking in on us and offering us amazing s","useful":0,"cool":0},"ed5gBlK0O1XK8WpC6gJrCQ":{"text":"This review is more about an employee and service than the food. Frank B. was working the ","useful":0,"cool":1},"vWNXW9yWHPEMlnqYsJ5DSw":{"text":"Was waiting to get sat for 10 minutes while they only had three or four tables inside. We ","useful":0,"cool":0},"BjrTV6ThzMnNx0YaLP6nDQ":{"text":"I regret not writing this review closer to the actual time of visit, which means some of t","useful":5,"cool":1},"IzVwChR0O35aEu5ZNtjCEw":{"text":"It's been a little over a year since my last trip to NOLA and what I discovered is that th","useful":1,"cool":2},"Sxeicf55Tu2_wKjYsmEW1g":{"text":"heard the commercial 1,000x on WWL \"we got the best buns on bourbon baby\" - deke. well aft","useful":0,"cool":0},"t6E0ZWDDGxrE-xMgsKLSvQ":{"text":"Great food and fun atmosphere. We had great service. Bologna sandwich was phenomenal. Food","useful":0,"cool":0},"RpibblAZpBjkAbIcNklMtw":{"text":"3 stars for football and TVs\n\nWe needed place for football so with that said, good for Sun","useful":0,"cool":0},"NfVoa1Y3sZ9ltWRal-3Z3w":{"text":"Ate there on a Thursday night.  Server was excellent and they had all the NCAA games going","useful":0,"cool":0},"SYdevoAauJzahRAsiEhhNg":{"text":"I really wanted to like this place. I love burgers, write a blog about 'em in fact, and my","useful":0,"cool":1},"wTElzZImpMQjLi9yynU8vQ":{"text":"This place needs 0 stars . Me and my friends are here for essence festival , we came in an","useful":0,"cool":0},"tqd7tZrd-_-lA8rkYEy_iw":{"text":"I only went for the gator bites. My date found a tiny piece of chewiness in his third mors","useful":0,"cool":0},"BNKECVfNUYZKA1YESg7Bxw":{"text":"Loved this place. Great atmosphere and the staff is super friendly. Food was good too. Try","useful":0,"cool":0},"HJza6SQ3ELJT479MlAjybQ":{"text":"Initially went here to order a stiff drink to go but the music was good so I hung out for ","useful":1,"cool":0},"DMZp_r5Ep2ezAWdWmpNGVg":{"text":"Nice Sports bar in the French Quarter! Lots of televisions!  Our waiter was extremely atte","useful":0,"cool":0},"h0qTjeluJ6bAi0Ij9SudfA":{"text":"The crawfish beignets were just as they sound, fought but delicious. Hard to finish the wh","useful":0,"cool":0},"Ebbv7AcE327pvLqNLsgvAA":{"text":"The food here is very nice, but the customer service is absolutely horrendous. You're left","useful":0,"cool":0},"AMgKvvtDb049NNN3oYgn8A":{"text":"Food was really excellent and portions were HUGE!!  Other reviews mentioned that the price","useful":0,"cool":0},"whNK-HEIzxl6peKBHp8iBg":{"text":"Greasy burgers.  My burger with chili had a super soggy bun.  Slow service at a not super ","useful":0,"cool":0},"DblXLG3nwW9RukedJZyFiw":{"text":"First night in NOLA... its Christmas... this is the first place we came across that was op","useful":0,"cool":0},"G_wQh6sVcSDTREzQFB3T3w":{"text":"Service was good but the food made my stomach hurt for the rest of the night. Would not re","useful":0,"cool":0},"0Rdy4C7nVRlkw90CEiLnHw":{"text":"The burgers are definitely the best here. But this time I got the Redfish blackened and re","useful":0,"cool":0},"JkjB20ci6lXjVjdzutPw_A":{"text":"The food & service was great. I had crawfish beignet and alligator bratwurst with red bean","useful":1,"cool":0},"5Q0aUDcN6ju8pILw9_vXsg":{"text":"Stopped in here for a bite and to each the NBA finals . TV's everywhere Nita bad seat in t","useful":0,"cool":0},"cceLssJet-RxN-AiIYH4OA":{"text":"Hilariously, my friends and I are here and it's the LAST DAY this place will be burger bay","useful":1,"cool":0},"Foq29mckfRqP6ZCbsUFq4Q":{"text":"Stopped in here to enquire about a table for the super bowl and were told that for our par","useful":0,"cool":0},"S5WtzWnc_q1KCsitoLOZmA":{"text":"What was once my favorite place to get a burger anywhere but especially in the quarter has","useful":0,"cool":0},"C1R1oyE498_1JeUgqpmJhQ":{"text":"It's not often I get down to Bourbon Street, and even more rare that I go there and eat a ","useful":0,"cool":0},"0k8kJ427woeLmHJAV2ZaTg":{"text":"Burgers were delicious. And excessive, but hey, that's what we are here for, right?! If yo","useful":0,"cool":0},"TKtekHeaSaNFjdx5h81l0Q":{"text":"One of the best variety of burgers in NOLA. The food was great the only thing I did not li","useful":0,"cool":0},"DpH-jaces4hR3bPNIOcxzg":{"text":"Came here to catch a football game with a couple friends before a big night out on the tow","useful":1,"cool":0},"RzWx1dtXm5189dwDZ6zSAQ":{"text":"I wasn't sure when we stopped for lunch because it looked suspiciously like a chain and I ","useful":1,"cool":1},"JhnBsK_50MWjOC7Hr2KRgg":{"text":"Went here to watch Nat men's soccer game and the bartender was nice enough to put it on on","useful":0,"cool":0},"tPV2WEYXsecUEdCXYiZAdw":{"text":"Traditional sports bar with bar seating and table seating.  They offer a balcony overlooki","useful":0,"cool":0},"QYynXIBeDJzlMcjJhaV1fA":{"text":"The wedge has to be the best macaroni and cheese I have ever eaten in my life. Kraft is a ","useful":0,"cool":0},"zabg3jzVrVHD2gCYzhszCQ":{"text":"This was one of the best burger I had! Loved it and still feel it in my stomach! We had a ","useful":0,"cool":0},"4SoiaGFWMqi0IsYxELoWOg":{"text":"The bartenders and servers were extremely nice and funny.  The food was awesome comfort fo","useful":0,"cool":0},"9gY2baF9SV6_0Igxdc8juA":{"text":"Great burger! Could easily be shared. I had the hangover cure! Would definitely return to ","useful":0,"cool":0},"J1Sfn83695YOc6kiIngSYg":{"text":"I went here for my birthday! I had made reservations before hand so I can't say anything a","useful":0,"cool":0},"5kmf675SCehE4RD_6kNyng":{"text":"Had \"The Ultimate Cure\". Its was very good! Goes well with a local brew. Many to choose fr","useful":0,"cool":0},"lF4oGmk8ITyJiIulUCr9Lg":{"text":"I got the \"world famous\" alligator burger. It wasn't good. I like alligator bites but they","useful":0,"cool":0},"p3mB4mPT8QfEXgDB4tI_og":{"text":"One of the best burgers in town. 2 to 3 people can share one burger. They are huge and tas","useful":0,"cool":0},"t3c22ix57i3XcTCo1x8QFQ":{"text":"Been to New Orleans three times and each time we make sure to stop by here. The food is am","useful":0,"cool":0},"4q4YuhqE57UB8T8Z2DjigA":{"text":"It's not a bad joint if you like grease, leading to massive and explosive diarrhea.  Upsid","useful":0,"cool":0},"XXovj8dBk1kjqfFn3-laLQ":{"text":"The Ultimate Cure Burger...\"cured\" me!\n\nAfter a few nights of indulging in the local fare.","useful":0,"cool":0},"_rp2W1o4V_MFQk6-O7tJDA":{"text":"Don't waste your money!  Mediocre over priced food!  Ordered the cochon nachos and a chick","useful":2,"cool":2},"1RKoeWdQiN2TCXw3wMboVg":{"text":"Gross.  The burgers were overcooked, had way too much meat and were way overpriced.  I mea","useful":1,"cool":0},"3N4l71DI2kdWh0FMYX0u1g":{"text":"Ate burgers here twice.  Both times the burgers were awesome as was the service.  Prices a","useful":0,"cool":0},"SaWW2pBbstAuwyYJKt-8nw":{"text":"My friend and I have visited the city many times over the years and always seemed to find ","useful":1,"cool":0},"EB1x5pQw4ggVRiT1rTZYEg":{"text":"Awesome burgers and inventive menu. Burgers literally melt in your mouth. Thought the chic","useful":0,"cool":0},"Eviv0tzUAZE0D7rCK2oong":{"text":"Omg I loved this place!! The food and service was absolutely AMAZING!! If I ever visit New","useful":0,"cool":0},"c1PUsidrxb19O7TG-il1ZQ":{"text":"Horrible service and mediocre food. Waitress actually argued that our beer was a cider whe","useful":0,"cool":0},"8jW5-ryWi8vo1QG6YRluCA":{"text":"Exactly what to expect from a burger sports bar. I found respite here in the middle of a s","useful":0,"cool":0},"ILJ78KeJGAc9pGtb2tnWZg":{"text":"Delicious and so much food!  None of us could finish our meal - Don did a great job!  If y","useful":0,"cool":0},"C-LfrRkucppnEP2w2w6Xjw":{"text":"the server miss quoted the price on a go order.. i paid twice what thay said with tip... h","useful":0,"cool":0},"YXRnNXGprfACzYd0EME0pQ":{"text":"Worst service I've ever experienced in my life. Super rude staff. Avoid this place at all ","useful":0,"cool":0},"GAyQ5lJyLWTTfUWu0Rqkow":{"text":"So I had been walking up and down Bourbon street having a great time when I realize the Ci","useful":2,"cool":1},"LjHXIYT_PziLAUXBfdA45Q":{"text":"The best burger I've had in a very long time. I'll be back each time I visit New Orleans. ","useful":0,"cool":0},"7uHa7UxLgxuiApsW_kFzyg":{"text":"Decided to stop in for dinner as some friends recommended it. A friend ordered the cowboy ","useful":0,"cool":0},"BvkPbOUfBQXwoLErQxVvWw":{"text":"Came here with my fiancé and some friends. I built my own burger and had a beefy party wit","useful":0,"cool":0},"5-Qv_IT-MJJ2LasjQztRPQ":{"text":"Nothing special about the food at this spot. Just a basic burger joint with a sports atmos","useful":1,"cool":0},"FH9gQHClTWqZNymZEMYdWg":{"text":"We got the nachos which were absolutely incredible! Our burgers were also amazing and HUGE","useful":0,"cool":0},"uJcYbxosKaj1tH7fzVmZsw":{"text":"Service was very very slow! I waited an hour after ordering to receive my food, a simple b","useful":0,"cool":0},"Env11b1lrK4uMlHvdKiuDg":{"text":"Had a great time with Frankie the bartender.  The Cowboy Burger was very good!  The Bayou ","useful":0,"cool":0},"jk9XcB_aXAWu9NXgFvpzfg":{"text":"Winding up our vacation we decided to pop in here for dinner. The hostess and our waitress","useful":0,"cool":0},"-yvckepA0j2EvX2cjovmqQ":{"text":"great burgers and atmosphere. Antionette is the best bartender in NOLA. First Place!!!!!!!","useful":1,"cool":0},"Jy68mjH6yGf7CxFlhFr4UQ":{"text":"Bayou Burger was absolutely fantastic, the staff is awesome, down to earth, and real. We w","useful":0,"cool":0},"TNHWmk1iI3XC3buYqiRhLg":{"text":"Great spot on Bourbon Street. Our waiter, Ulysses, was really good and gave us some great ","useful":0,"cool":0},"yzSerMg5SfHjoHcr4dXr4A":{"text":"Here now....so far an hour wait for wings that were the worst wings I've ever had.....stil","useful":0,"cool":0},"91KyTWuMKod7aLb5qszQOQ":{"text":"I have never in my life sent food back until eating here. I ordered the shrimp burger and ","useful":0,"cool":0},"AmFIbKwBufHIDhJBcwr7hg":{"text":"I'm not sure how much New Orleans is known for their burgers but I'd Def be back for this ","useful":0,"cool":0},"wkua5OL75wYGrCWE5jhsvw":{"text":"We camped out here for HOURS the night of the Super Bowl and had a blast watching the game","useful":2,"cool":2},"jYSTzIoiEgBudltO0I-ihQ":{"text":"Since my cohort in crime chose to eat raw oysters at Felix's I was on my own to find a qui","useful":0,"cool":0},"zvTcG6H4XMsDyyJaVrUQIw":{"text":"Travis and the very rude almost black girl AKA bartender ruined my friends wedding party. ","useful":0,"cool":0},"6TILLBTVJhmOIBnYrCUyrQ":{"text":"I went here two days ago, and the experience was perfect. Our waitress, Cassandra, made it","useful":1,"cool":0},"4DbtoLWhyejgR4aoQO73AQ":{"text":"The atmosphere and food are great here.  I ordered a burger with fried bologna and my wife","useful":0,"cool":0},"HI7cF4zoZxFX8OATuS_lUg":{"text":"This place was great! Service, ambiance, and food, amazing! The portion sizes were huge le","useful":2,"cool":0},"cGgVUUFX0eh5yA6daAUvcQ":{"text":"ABSOLUTE WORST BURGER I'VE HAD IN YEARS***\n(See my pic). Bayou Burger will only cook your ","useful":9,"cool":3},"06UMpjmUS_7eeVU6H1ENtA":{"text":"this place has one of the best hot dogs anywhere.  it's loud (especially at night) but the","useful":1,"cool":0},"nGtxTO9JcDYWLMNaOCJnbg":{"text":"Beef burgers, venison burger, fish burger...\nThey have it all, plus local faves.\n\nReasonab","useful":4,"cool":4},"NOEvRRVCTVaEuo28zfBE9A":{"text":"Wow!!!! We got the Run chicken Run sandwich and the alligator burger. Food was awesome but","useful":0,"cool":0},"GE1jqaEdOpC8CoslZslkAA":{"text":"We ate here a couple years ago on a previous trip and came back this time because we knew ","useful":1,"cool":1},"GMqq1HN37VWi2MWKi47vaA":{"text":"The atmosphere of this place was great. It was a full house for a playoff game and it was ","useful":0,"cool":0},"iX0v71pGWRKNtMb12IR7mQ":{"text":"5 starts for our server alone.  Dabrielle, you are a gem. You took our party of 9 in strid","useful":0,"cool":1},"7O0QqfwYF5IJwRlLwmP9AQ":{"text":"We came in hungry for lunch and were super excited to sit on the balcony, as it's somethin","useful":1,"cool":2},"OOQ2G3lm2eFyaswo6Gt5wA":{"text":"Me and my new Bride just spent a few days in New Orleans ... We stumbled upon this place a","useful":0,"cool":0},"xuCdSpcyPGAegaWpBDAGPg":{"text":"So this place as is has been there about 6 months. Right on Bourbon St. Most places i woul","useful":0,"cool":1},"o1IYZ87sIxck_reJRhkZZw":{"text":"I was in need of a good burger in the Quarter after my favorite burger place's owners went","useful":0,"cool":0},"VnEUwB1-AeDXZOOsW5Hlcw":{"text":"This place gets their 4 stars off of the Debris skillet fries alone....Jay-sus, Mary & Jos","useful":6,"cool":2},"a-i8mKVx2u0OqKqNzvZqiw":{"text":"Service was amazing. The rating is strictly on the food. \n\nThe nachos were really good, we","useful":0,"cool":1},"W_y_i6v8CHBEFBJHoZBs5g":{"text":"We took 15 here for lunch today. The food and service were good for the most part. One of ","useful":0,"cool":0},"ASJfueyISdnAdDyls6IQIQ":{"text":"Great location if you like noise. Lots going on around us so the scenery was enjoyable. We","useful":0,"cool":0},"BvhvGxa9elh-VOFR5tCkWQ":{"text":"I am rating this on my overall experience at Bayou Burger.  First, we headed to the French","useful":0,"cool":0},"NT74vAlTWqer7aHcAiU1uw":{"text":"Very big portions and interesting choices. Balcony seating on bourbon which is hard to fin","useful":0,"cool":0},"pDFROpJSVbfS59zfVJYY4g":{"text":"I set out to get a burger earlier that day and I wanted to watch the a football game, You ","useful":0,"cool":0},"rnb9vX-dMHw9sjvr8OHTJw":{"text":"Excellent! Shannon J. was warm and welcoming.  She had us in stitches with her attitude an","useful":0,"cool":1},"kJhPELTOS27_qRe936Krww":{"text":"If I could give this place half a star, I would. The service is SO SLOW and TERRIBLE. We o","useful":2,"cool":0},"Sd_PoZvysqpZ09wvw8o4fQ":{"text":"Was in town on a quick break from work and we stumbled upon this place, thanks to yelp, lo","useful":1,"cool":1},"kja7kVc-N0aIPe9A9CB3mg":{"text":"I have to hand it to them, this is probably the cleanest place on Bourbon Street.  They ha","useful":0,"cool":0},"ZEhuWHCn3Gi2Q1WTYfXxDQ":{"text":"I'm not sure why there are so many negative reviews because we loved it. Perhaps it's beca","useful":0,"cool":0},"e4UWWxli0IqVURvnRy2T0A":{"text":"Not full on Friday night.  Quite a few people looked happy eating hamburgers.  A guy at th","useful":1,"cool":0},"pH8GKkAcSO-WIkChn_Nnwg":{"text":"Rude. Rude. Rude. I was happy to visit this place until the staff was unbearably rude and ","useful":1,"cool":0},"OH2WlKD_kbktD4J8R4pIbA":{"text":"good bar food, just be prepared that if you are not willing to drink cocktails every 15 mi","useful":0,"cool":0},"DoK441i4S4WqjFsDIS347g":{"text":"It is a great place to go and watch the game. We were there for the 2018 Sugar Bowl and ar","useful":0,"cool":0},"LvVR_Vx46-jQjVdnksLcuw":{"text":"Thanks to the woes of flight delays, we made it in to NOLA much later than expected and ap","useful":2,"cool":0},"JN4iuieTQ0HmcJZ5p8Ovzg":{"text":"Real sad. I understand we all have rules.  But, I bring my family in to eat. I don't have ","useful":0,"cool":0},"eyO4lDuqiPS5mbbQPzWlbQ":{"text":"I loved the outstanding burger options including one that has a grilled cheese and bacon s","useful":0,"cool":0},"LacQWKjFF_lv6b_07Nbkag":{"text":"Best burgers! Gator burger is off the chain and Jukebox Joint IPA, piney and crisp. Clean,","useful":0,"cool":0},"Rkr7x5P2y8uSxN5VLXFVyw":{"text":"Service was on point, very friendly and attentive. Ordered the hunter burger which was ver","useful":0,"cool":0},"eombreTs4P8tn-97UdTSBQ":{"text":"Saralynn and I had just got our nails done, realized we hadn't eaten lunch yet (it was 3:3","useful":2,"cool":1},"FVnubfZmZstJFCTA8QGgzg":{"text":"Wanted a bite kind of later in the night.  Looked on Yelp for open places and They came up","useful":2,"cool":0},"TEAcN1o5HxfPPurz2GgjAg":{"text":"I wanted a place to get a beer and a light dinner.  It had to have local food and ambiance","useful":0,"cool":0},"h9M4V8p7Bj26UPWP_9qEOg":{"text":"I love this place. Before I lived here, I would come on most of my two-day periodic visits","useful":15,"cool":12},"HOmaPJOnnHPMEomqsUxqKw":{"text":"HUGE BURGERS! The biggest burgers in the city!!\n\nI come here every month and am always imp","useful":7,"cool":6},"poBbU3_WJ4Jyy9p43GX7zg":{"text":"Bayou Burger has a nice little spot on Bourbon. On our way out of town, we found some clos","useful":2,"cool":1},"kj9qmspUgx3E0ztIOhHTKQ":{"text":"My friend and I came in because of the yelp reviews but once we got there we received the ","useful":0,"cool":0},"fCxZh5LCqSgdq279UnD4JA":{"text":"The Debris Burger and Fries.  You'll kind of, sort of hate yourself, but it's amazing.","useful":0,"cool":0},"f4VZ21EKiLWql9D45RanCg":{"text":"This restaurant is amazing. The burgers and chips are phenomenal, if you can't find one yo","useful":0,"cool":0},"I2EB_gG1GB2FbG8Nc-yY4g":{"text":"Met a group here for dinner and drinks to celebrate a graduation and a night out.  My SO a","useful":4,"cool":1},"p6KwOTZ2Q1Bx-sFOEKSSNw":{"text":"Food was good but service was very slow. And it wasn't even that busy!! Probably won't go ","useful":0,"cool":0},"qx9vxVrbw0deMpp-zYNv_A":{"text":"Had a great lunch here today! Shannon was an awesome server and brought tons of fun energy","useful":0,"cool":1},"6rblzxIY9IrjsQY6fJv1yA":{"text":"If you want grease filled food, this is the place to go. I wasn't that hungry so I ordered","useful":0,"cool":0},"J5DTA0FlBpHxZ1AAvFpOPw":{"text":"Did not expect to have to eat so late but when our flight got to NOLA late and we were hun","useful":1,"cool":1},"NWU1N8BYaHkxIapGWdKBOQ":{"text":"Stopped in because we were on a time crunch and there were lines at every other restaurant","useful":1,"cool":1},"z1qmltBuLtTuyU0kJVDiGA":{"text":"A rule that came upon us too late in the trip... don't eat at any place on Bourbon Street,","useful":1,"cool":0},"ovpxecvFODFEiGrravSgQQ":{"text":"Stumbled into this place for our first NOLA meal after checking into our hotel and it was ","useful":2,"cool":1},"0a-rUOvjad_cf3HhGv0bog":{"text":"My husband and I just got done w/the walking tour and had to find a good place on the FQ t","useful":0,"cool":0},"j5-liTvs_K5QH7LOoVnrqQ":{"text":"Albeit a bit pricey, the food here is unreal. The alligator dishes were fun to explore and","useful":0,"cool":1},"xQvUWVRPA8z9A2stmOe-pA":{"text":"Ate here since its by my hotel on burbon street. not bad at all... i had the trifecta, it ","useful":1,"cool":1},"6lpBosUbIb1ymBLjXqNgqw":{"text":"Came in just wanting lil something....I asked my server to narrow down the 3 choices I was","useful":0,"cool":0},"hXO5yWhwhlQH-HLSTRJr5w":{"text":"Service was good, beers were large, Monday Night Football on the big screen (and the Niner","useful":1,"cool":1},"tNXaKNNmmKXwQN1HnZUX8w":{"text":"If you are looking for a place to watch sports and drink beer and maybe need some food too","useful":0,"cool":0},"NP9X3Ryk6kNvvSW3RMURjQ":{"text":"Bourbon Street may be one of the most unique streets in the United States. Well known as a","useful":1,"cool":1},"Ys_f2D8zG3ngrYNe1kZR9A":{"text":"Kenisha was the best! You should make her a manager. She has a GREAT personality and made ","useful":1,"cool":0},"dHB6t9uTKH1AQrCvIR5geQ":{"text":"Hands down the worst host I have ever experienced. I tried to give her my ID so we could e","useful":0,"cool":0},"XwNZnV717CUc9XFvGiBbug":{"text":"Without a doubt...the best burgers we have had!! \n\nI'm from England and gourmet burger kit","useful":0,"cool":0},"G4k6pniK7OeInWdnaG0fGg":{"text":"Gator traps were legit. Ultimate cure.. sooooo much food.. it was decent.. don was pretty ","useful":0,"cool":0},"W-_NAFzUq1MQK3F8I4NV4Q":{"text":"This place was great. Most of the negative reviews I've read have been about noise level, ","useful":0,"cool":0}}