{"-mDZvJQcDa6YHYrHv6tujQ":{"text":"I was hesitant at first about taking the cooking class, but thank goodness I did. Came her","useful":0,"cool":0},"6UZRB_X71YaGRKx04jhyUQ":{"text":"Team building in NOLA - yes! Work crew all ended up here for our team building activity an","useful":0,"cool":0},"bKpFJPKC8ZBq1TBvh-Cqvw":{"text":"I have never been to a class, but I give them 5 stars because they have the best pralines!","useful":0,"cool":0},"WfB3vk7rAvsHb4cDB6nq7Q":{"text":"This was easily one of the highlights of my trip. Not only was the food amazing but Miss S","useful":0,"cool":0},"GLSY3oyC1-1oybff3lPnFA":{"text":"This school is so fantastic! Loved that I was able to sit down enjoy beer wine and ice tea","useful":1,"cool":0},"tTzCBuVhXwNxgco0L94esw":{"text":"Michael did an amazing job of teaching history, culture and cuisine.  Best day of our trip","useful":0,"cool":0},"Tj6n6mDzm_dKQoklzaGlAA":{"text":"because i'm the nicest daughter in the world, i took hulamom to louisiana (her favorite st","useful":1,"cool":1},"Sa1txbi5gZHu2pnX8eGbyw":{"text":"Spent our birthday. Lovely lady. She's got so many tips and I can't wait to taste it all. ","useful":0,"cool":0},"-dc4dU3EVZBgBYjJe3R7Fw":{"text":"Pat was our teacher.  She was awesome.  Have been to Nola many times, but this was our fir","useful":0,"cool":0},"wVJ7wXQMGUEIx3cepY3CyA":{"text":"Just an awesome experience!  Pat, our fearless class leader, was knowledgable and articula","useful":0,"cool":0},"Fg-JTifbL0EmzPglNes6xQ":{"text":"This was one of the most memorable highlights of our recent NOLA vacation. My son and I, c","useful":1,"cool":1},"fo_G5FJnKOorKr3WFQ9rlw":{"text":"Even though the food was good, Chef Kevin is what made this an A+++ experience. He was sup","useful":1,"cool":1},"FfAzhORm8yZhwzQrnQtQhQ":{"text":"A fabulous experience! Chef Mark is a great teacher...we took the Hands On course and he w","useful":0,"cool":0},"UO60Bj0EFhJcKLUCT8AH5g":{"text":"I wanted to try the pralines here as I saw their advertisement outside the store. I wasn't","useful":0,"cool":0},"CIJi5d3dlP2-cZnpSjmjJg":{"text":"Great experience! We had a cooking demo with Michael, who is a lot of fun. He made gumbo, ","useful":0,"cool":0},"stsyFAEFTPp1Q41EJU_moA":{"text":"The New Orleans School of Cooking is centrally located in the French Quarter, and my wife ","useful":0,"cool":0},"ms6jtlb6Rcky7rZl7-l0xA":{"text":"This place is amazing! Did the hands on class with Chef Ricardo and his assistant Packy? A","useful":0,"cool":0},"n09QL0EYEu5BOcsZeoA1Pg":{"text":"Loved this in depth introduction to New Orleans food with a good dose of history leavened ","useful":0,"cool":0},"VYnaYKDutamnxxLXq-8lMA":{"text":"I'm still smiling. Great food, no the best food, the woman who taught our demo was so fill","useful":0,"cool":0},"Di5ITJQ4Zl3yGxiAVi8oIA":{"text":"Chef Julia! Your cooking class was great, informative, and a delicious experience. Gumbo, ","useful":0,"cool":0},"JlnvQAd8OJuH6LTbx6JONw":{"text":"You can watch pralines being made.  Very friendly staff.  Got a seasoning mix there called","useful":0,"cool":0},"lqmdxTcqO80eup25BkOSNQ":{"text":"Clean and fun. :-) The store where they sell their products are in front and the kitchens ","useful":0,"cool":0},"pjivulCXVCVpbEVJ0mukPg":{"text":"Chef Kevin Belton is a star. Plan your visit based on his availability! The sales staff is","useful":1,"cool":1},"mdBeuwWi0HoU9Br6_UcYeQ":{"text":"We do a cooking demonstration here every time we are in town.  This is always educational ","useful":0,"cool":0},"Et9Jq31TqLsdgb3kgHSBpQ":{"text":"Took the demonstration class today with Ed as our instructor and had a wonderful time! Fro","useful":2,"cool":0},"4GFWwcNshIbcWRTFm-DBWg":{"text":"The Biff and I both love to cook, so kudos to the Biff for finding a place in New Orleans ","useful":2,"cool":1},"AfivqMa7VHh38-H4cbMRfA":{"text":"This is very cool. Like many people, I went to New Orleans mainly for the food. This place","useful":3,"cool":0},"Axqq-f1uhBJ4PZYb-aEZvw":{"text":"My tour group took the class with Kevin Belton. We learned how to make Gumbo, Jumbalaya, B","useful":0,"cool":0},"8fpAGKh1GVZD4ZUkPUfebw":{"text":"Amazing class! Loved all the history and knowledge added. Great food with a ton of hints t","useful":0,"cool":0},"9mv3OGd0XimL5asgowjzLQ":{"text":"Just a cool place to check out!\n\nSchool was not in session but earlier in the morning my f","useful":1,"cool":1},"ZZ4vRTIR02lUGqhS6BRwdA":{"text":"My husband and I loved our hands on cooking class with Sarah.  We had such a wonderful tim","useful":0,"cool":0},"vTUuXUA9S91WK9fZ1C2uEg":{"text":"We took my parents here for their Christmas present. We made reservations early and paid i","useful":0,"cool":0},"QR-F71a1p7Dhneb1yeEYSg":{"text":"Received the  \"Gumbo, Jambalaya, Bread Pudding and Pralines Demonstration\" as a wedding gi","useful":0,"cool":0},"kqeAs6A6uZNzAhsVkEjWbA":{"text":"This store was awesome for finding all things New Orleans under one roof. There were seaso","useful":2,"cool":5},"FTFJENuXi900MdaknizLCA":{"text":"Had a cooking demo. Chef was entertaining. Unfortunately the class was too crowded. My sea","useful":0,"cool":0},"fjqnNRLzY0jK6jth5btnjA":{"text":"My family & I took a cooking class here over the Christmas holidays, and I highly recommen","useful":0,"cool":0},"SBCTYWn2QQTaqIISk-jF4A":{"text":"Fabulous place for a cooking demo or hands-on experience! Yes, it's touristy, but if you h","useful":1,"cool":1},"rP3LK2rQt_wFI54KgqHCLA":{"text":"Talk about Awesomeness!! Went here on Sunday morning for the cooking demo with Harriet. Sh","useful":0,"cool":0},"FRkVTvewhURPXWwmS8NJuA":{"text":"Great cooking demonstration class.  I was afraid it was going to be basic but they really ","useful":1,"cool":1},"NbVYixHXzHIxHN5log73Vg":{"text":"Best adventure we've had in New Orleans!! This cooking class came highly recommend by seve","useful":0,"cool":0},"pMnr6_sq-4V7PTehI9LGFA":{"text":"How can you not give this a 5\nServes you a meal \"great\"\nEntertainment while you learn to c","useful":0,"cool":0},"QAX3uNEWVjkD_z1Fpc7tjg":{"text":"Stayed in NOLA for five days and this was by far the best experience.  \n\nThe price is a bi","useful":0,"cool":0},"NdtDncg0AelgcZ9o4Gu3AA":{"text":"What a great find!!!!  Had Anne as our teacher in our private class of 20 and she was such","useful":0,"cool":0},"QQnUt8ePxD6jY_TJvbFz-g":{"text":"Went with a group of 6 and had a good time. We paid $24 a person - got our reservations mo","useful":2,"cool":0},"QLshwABiyt83tt1WuevttQ":{"text":"We booked our cooking class through expedia. It was a great experience. I go to Le Cordon ","useful":0,"cool":1},"ZPASqrzIaGwTbH7SoKTXww":{"text":"History class in a cooking demonstration. Very entertaining and loved all the food she mad","useful":0,"cool":0},"B5sEo1cN5iWoA8KN1f5jDw":{"text":"Highlight of trip. Cooking and more. NOLA history. Eating. Drinking. Shopping. Fun humor. ","useful":0,"cool":0},"xGPNmDQ-grkgS1EGhCC2WA":{"text":"This was definitely a highlight of our trip to New Orleans. I cannot recommend this experi","useful":0,"cool":0},"zMSPg0cMGWuoLql9ZQNucw":{"text":"Thank you Harriet!\n\nMy husband and I had the best meal of our honeymoon at your gumbo cook","useful":0,"cool":0},"KVImmtK6F5XJJ2Tm_pdGNQ":{"text":"This was one of our best experiences coming to NO. We had a limited 2 day stay and this pl","useful":1,"cool":1},"tm2L8oKDpMzTADrPbTzvyw":{"text":"This is the best money you will spend in New Orleans if you like to cook.  You sit there, ","useful":2,"cool":0},"5aHRUdpd4MCqDCOUwH287A":{"text":"I loved this place!! If you are a cooking nut and love your gadgets, this place is awesome","useful":0,"cool":0},"lN44OjECAZVGWOQNwYPjew":{"text":"I've had pralines from all of the major NOLA candymakers and these are the best. They are ","useful":1,"cool":0},"ERQ2rEhxqAApzpyPGm81IQ":{"text":"Best money spent in New Orleans, hands down. Big Kevin is New Orleans. You can't beat some","useful":1,"cool":0},"7ZtMSVDBXx5--DGVZ8wXvg":{"text":"Great food and great experience. Brandon showed us how to cook amazing dishes while incorp","useful":1,"cool":1},"yRt9pMddV-sTWHj97vo5nA":{"text":"I took a cooking class with Harriet and Anne . They were knowledgable, entertaining and ex","useful":0,"cool":0},"lA9PqraJwiAImmf92jeBzA":{"text":"Chef Kevin Belton was fantastic!  The perfect blend for a room of visitors young and old, ","useful":0,"cool":0},"Zza9is5EG051AIee6H4ndw":{"text":"Had a great time WATCHING Sandra prepare traditional NO food.  She was funny, native to NO","useful":0,"cool":0},"o_llZZoJqzoYFMW1urGAwQ":{"text":"This was a fun learning experience! It was like being on a cooking show except you get to ","useful":0,"cool":0},"35WpzUmq3z4GrZ10VL5zwA":{"text":"We came for a cooking demo at the recommendation of my sister in law who had done one earl","useful":0,"cool":0},"jmikkKQcglP7tO4Jy0OH5g":{"text":"Kewl place. We didn't take any of the classes but they really do have some cool things to ","useful":0,"cool":0},"XCqYHVpGN7x3uUhFamnMJw":{"text":"Our chef, Michael, was freaking awesome!  He was extremely entertaining, knowledgeable, an","useful":1,"cool":0},"Iczbbwv-7jxxIBsZYGSYJA":{"text":"We had a great class with Chef Harriet! She was hilarious and had such a knowledge of the ","useful":0,"cool":0},"pZLD8zcVMsvb61VSeiADQA":{"text":"This has to be one of my favorite spots in NOLA. You not only get entertained by a great s","useful":1,"cool":0},"ela-O-j110HHHBwKzUGVeA":{"text":"I took the afternoon demo class and came out with good recipes for gumbo, jambalaya, and p","useful":0,"cool":0},"vXV82nDKR8W5jqMS7fo9mQ":{"text":"Great way to spend a couple of hours in NOLA. Learned about jambalaya, gumbo, bread puddin","useful":1,"cool":0},"3jLiBp83DdlzPZjfASMpaA":{"text":"Once you arrive you check in and then they call your name and you go to the kitchen/dining","useful":1,"cool":0},"xVfRgkGMT4q_I2EnqLxMdw":{"text":"Learned how to make gumbo, jambalaya and pralines. It was more of a demonstration cooking ","useful":0,"cool":0},"gdBdDPXzDegB3ILs5tPMMg":{"text":"Took a demo class and loved the experience. It is definitely good value for money. Julie, ","useful":0,"cool":0},"3-gx3tIPea6FY4qZI2TjaQ":{"text":"We had a group of 9 people and this was by far everyone's favorite stop on our Nola trip. ","useful":0,"cool":0},"K8bK8D4RD0CQAhfbqwIwsA":{"text":"Our chef Michael was outstanding! Very funny and truly loves what he does! We had the best","useful":0,"cool":1},"fpMfaZF55SES9HnPfcUFwQ":{"text":"Looking for something different & cultural to do in New Orleans. We weren't sure what to e","useful":0,"cool":0},"HNsI_dzOpPgXDXNuc6i53w":{"text":"Had a great time eating amazing food while learning some history! Ed was a fun, informativ","useful":0,"cool":0},"CE6OPcMbFusdY84GUmKNYg":{"text":"A must do for anyone visiting New Orleans! The chef was very knowledgeable and entertainin","useful":0,"cool":0},"WDcy6fM5F_nindScPI0kUQ":{"text":"My husband and I took hands-on class on Sunday, @ 3 pm. Learned simplicity of making roux,","useful":0,"cool":0},"Eszrr-oo0r0a3m2Gh3RRJA":{"text":"Chef Kevin is great. Taught us how to cook Gumbo, Jambalaya and Pralines. After he cooks i","useful":0,"cool":0},"NXVdceSsmTxe_SWM5Fgm-w":{"text":"People said this would be the best thing we'd do in our trip to NOLA, and boy were they ri","useful":1,"cool":0},"ncHuF1KuQgPu0Do6xCsx0A":{"text":"We thoroughly enjoyed our cooking class with Pat.  We expected a typical cooking class but","useful":0,"cool":0},"e2sOkCu8clmrWH9PQoY4dw":{"text":"I came here once in '05 and once again several weeks ago. I was almost going to book a cla","useful":0,"cool":0},"MuLMDbAdBeJdkGFGRHnm8g":{"text":"Sooooo happy we came. 5 plus stars all the way.\n\nFor $32, you get a 4 course meal, a live ","useful":0,"cool":0},"wvlNINxFTy5SAPrqSJYY2A":{"text":"This place smells ridiculously ahhhmazing!  warm buttery, sweet goodness!  And they offer ","useful":4,"cool":5},"_mEJXks-6Pn5VemWfQKylg":{"text":"This review is for the husbands and other non-cooking people in the family...\nWe were in N","useful":1,"cool":0},"J9L0dGa5pVhPrrPInyr5wA":{"text":"We had such a fun time at New Orleans School of Cooking.  Made a delicious gumbo and jamba","useful":0,"cool":0},"xFATnPAdIZ00uVMc3gDW-Q":{"text":"This review is more aimed at their gift shop because I didn't actually go into the restaur","useful":5,"cool":4},"YVX0eKO2F70u5r5QZX2d8w":{"text":"Wow, what a great experience. The good was really good and even better that we could watch","useful":0,"cool":0},"VtXX2FI0gMHqbdkQ2JhiGA":{"text":"One of the biggest reasons we decided on New Orleans as a travel destination was the food ","useful":5,"cool":5},"92ryjoGMTZtTMVvOV8MRiw":{"text":"I was really bummed that we found this place on the last day. I would of loved to of have ","useful":0,"cool":0},"zohXD6OGhMLAkU7fflsGjA":{"text":"Brandon was our chef.  He did a great job at giving instruction but also the history of th","useful":0,"cool":0},"JXk46aRnn_Czbqje5UpuUg":{"text":"My husband and I took the 3 hour hands on class from Chef Matt on 1/17/18.  We had an abso","useful":0,"cool":0},"W9SN2HH_cFtBPb1LsjmTKg":{"text":"Took an instructional class with Harriet last week and it was most definitely a highlight ","useful":0,"cool":0},"Trx5LD5g_VID6tmPJ-2jmQ":{"text":"This is a fantastic way to spend the morning. My wife and I learned a lot about the differ","useful":2,"cool":0},"41X-qWL-G9plJo2mA4KOQw":{"text":"I agree that this is the best money you can spend in New Orleans and NOLA is inexpensive n","useful":2,"cool":2},"FTt0ZlL5r-3_w8K5awOEpw":{"text":"I highly recommend that anyone coming to New Orleans sign up for one of these cooking clas","useful":2,"cool":3},"BYbXn636dAi6dHl-omJEZg":{"text":"Wow! What a fantastic experience! We did the hands on class with Chef Mark and he was awes","useful":0,"cool":0},"h8erEiL7Z39FBBl-6RrHLw":{"text":"We went for the demo class and it was awesome!  Miss Sandra was an excellent host for the ","useful":0,"cool":0},"Sl7BwkBML4HpKQCdk4ewGA":{"text":"Fun experience - I have to admit that the cooking part of the class was just okay, BUT our","useful":3,"cool":2},"9v-lye7L9s3Y_24gRIQbUQ":{"text":"We had such a great time at the New Orleans School of Cooking. We went for a cooking demon","useful":0,"cool":0},"y3FRlfaBbhOp3F6Y9yo0vw":{"text":"Although this was a nice break from the crowded French Quarter Music Festival, it was not ","useful":1,"cool":1},"d72Vh6uKbXlzhYhj3TXCMQ":{"text":"Gumbo Marie!! She made the day. The Cooking demo was great but really it was Gumbo Marie's","useful":0,"cool":0},"NMtuY09IV2IQIKu1h-jICg":{"text":"BEST THING IVE DONE THUS FAR!!! \n\n**do not do the demo. DO THE HANDSON**\n\nThis was such an","useful":0,"cool":0},"DqYmMpLyqv17MdC1IYl5Dg":{"text":"This cooking class was such a fun way to spend an afternoon! The instructor was very perso","useful":0,"cool":0},"am4v1Y_R5eRhHCsESVJXZg":{"text":"WE had an amazing time. Our guy was a great teacher, (you could tell he was actually a his","useful":1,"cool":0},"hKKeuZr9t3KWpVVHI1yG-w":{"text":"My favorite thing so far! Great shop and amazing cooking demo. This really is lunch and a ","useful":0,"cool":0},"-qAYPoL8hIjZhj8hB6klgQ":{"text":"We picked this one for the gumbo and red beans and rice.\nChef Kevin was awesome and funny.","useful":0,"cool":0},"cngJZL6f4ozIf6uLOpsd9A":{"text":"On 6/29/13 we attended the cooking demo for my sister's bachelorette weekend with Chef Ben","useful":0,"cool":0},"5Gyj0h7_D8JGRqRB1nZf-A":{"text":"We had a fantastic time gathered some great tips food was delicious the drinks were plenti","useful":0,"cool":0},"OAQ_1adItLg3yu0BW8PVVA":{"text":"This was the best part of our six day visit to NOLA. Our instructor was Pat, and she was f","useful":2,"cool":0},"XsnuO7FiEzfY2Mdgz0Rm8A":{"text":"Hands-on class with Chef Mark was the highlight of the trip, and an experience of a lifeti","useful":0,"cool":0},"TydZNjhHmJjIBT4Z8Y_Wfw":{"text":"Okay, so we came in simply because we saw several people walking around with their cute ba","useful":0,"cool":0},"kgLOBdldS9V4YfdctChjYQ":{"text":"Went here with the wife a few weeks ago. We had a great time and the food was wonderful ! ","useful":0,"cool":0},"M2MA0AZZex5cEtqh_mXPaQ":{"text":"Other than the history lesson that lasted a little too long this place is really cool! The","useful":0,"cool":0},"sJXLAAeh2vbYU1H0Q9l0Uw":{"text":"A definite must when in New Orleans. Chef Brandon was our host and instructor. Chef Brando","useful":0,"cool":0},"fMdZi-x7579WzmZYn0gj6Q":{"text":"Pat is amazing! She gave us a great blend of New Orleans history, cooking, and humor. The ","useful":0,"cool":0},"wPVp44N2JnOk5qM1W6-ueg":{"text":"Pat- our chef- was a definite \"showman\". She definitely made the whole experience. We lear","useful":0,"cool":0},"uaLAInyyRL2PFBw4t81IUQ":{"text":"Definitely the place to go, if you're a tourist and a foodie (or even a wanna-be foodie). ","useful":2,"cool":1},"mP7YWy5JryLhRhC3WBBXtg":{"text":"Love the demo cooking classes! This is the second time we've been to a class with friends.","useful":0,"cool":0},"WRQJpevjtftLVGrLLEJHQQ":{"text":"First, I am not much of a cook.  I went to a 3-hour hands on class with two of my siblings","useful":0,"cool":0},"pxBpUljAiMjJPrF4gBHFqg":{"text":"My wife and I attended a morning hands on class. It was terrific. They had an open bar of ","useful":1,"cool":0},"0hba1zpxHgHQ2o26xeRPiQ":{"text":"We purchased the cooking demonstration of Gumbo, Jambalaya, Pralines and Bread Pudding. Ou","useful":0,"cool":0},"boYvTJ-LFpYakwFo8xlcAA":{"text":"What a blast! My 15 yo son and I did the cooking demo with Chef Kevin.  We had a great tim","useful":0,"cool":0},"f-h2EoW_EkHi0Ilcso-sEA":{"text":"Chef Brandon was lively, knowledgeable, humorous AND he makes delicious food!!! Would high","useful":0,"cool":0},"i_U8pf7rPZnxk8S3TFsAAQ":{"text":"Positive: We really liked Pat, we loved the history and knowledge of NOLA that she shared ","useful":1,"cool":1},"t3DpELWofB8eWTWi5hGuqg":{"text":"Definitely a fun activity to do in New Orleans. You can choose a demonstration class or ha","useful":0,"cool":1},"cJPlB3bA26MIBZwmW9wj4g":{"text":"A New Orleans MUST. Especially as a couple it was nice to interact with others while visit","useful":1,"cool":3},"UCeI7kdklT3hlG9dKjdpSw":{"text":"I loved our cooking class. Not only did we get to eat and learn local recipes, we learned ","useful":1,"cool":0},"fY_PGU7RJq3YClbVO6iR2Q":{"text":"Kind of fun. For me, the three hours was worth it just to get a good NOLA roux demo.\n\nPowe","useful":1,"cool":0},"BlVWbDlY5HXBdjxyl5Aw5w":{"text":"We took a class this morning with Tom and Brandon that was absolutely fantastic. All the r","useful":0,"cool":0},"osmGS1C85Z3JpS9aRJADjQ":{"text":"My wife and I decided to give this place a try a few weeks ago.  It was an AMAZING experie","useful":3,"cool":0},"ogfu2uj1o_NyL4_G3nd-HA":{"text":"This was the highlight of our trip to New Orleans! We made Gumbo, Jambalaya, Bread Pudding","useful":0,"cool":0},"bFVlwU5T5wIBOFhYODoGFA":{"text":"I signed up for this not knowing what I was getting myself into.  I had no expectations an","useful":0,"cool":0},"DoPItJiU7VHcBdVKrsEMGg":{"text":"Consider this: chances are pretty good you're going to spend $20+ on lunch somewhere in th","useful":3,"cool":2},"ilRb74td6YJYMytHCfKS-Q":{"text":"Uneingeschränkte Empfehlung! Während unseres Aufenthalts in New Orleans sind wir immer wie","useful":0,"cool":0},"WaUL3ZSSsaMqtYI7ovwUXQ":{"text":"My boyfriend & I thoroughly enjoyed ourselves! We booked the 10:30 demonstration class for","useful":0,"cool":0},"Gah2Ctt_95iwal9gPxrfqg":{"text":"This was the best tourist-y experience I've ever had. We had a group of 3 couples and did ","useful":0,"cool":0},"A7qtHtlOM-eCA_HldJBb9A":{"text":"I thoroughly enjoyed myself here! My teacher was Anne. She demonstrated a Gumbo, jambalaya","useful":0,"cool":0},"uY1eTZp6f9jBuDCM0TSskQ":{"text":"We came here for my friends birthday... it was amazing!! The food was delicious... the peo","useful":0,"cool":0},"2xe8UqZfGDPMKM3iPxihGA":{"text":"SO AWESOME!!\n\nMy boyfriend and I are cooking junkies, he being a cook in the marines and m","useful":1,"cool":0},"1dorgirf_k3r_fNIv95hLg":{"text":"Great NO cooking demonstration. Kevin (the instructor) had a great personality. The food w","useful":0,"cool":0},"Zh7101p5g_nL2zKYY0tk0w":{"text":"What a great experience it was cooking an authentic New Orleans meal and a beautiful kitch","useful":0,"cool":0},"qQG8sRcpT53liXNe6rELJQ":{"text":"For $24, you get a three-course meal, unlimited beer and tea on top of the cooking instruc","useful":2,"cool":1},"TY2WWp6NnwAFnYBPU8P3NQ":{"text":"I took a group of wives to the New Orleans School of Cooking recently and we had a BLAST. ","useful":0,"cool":0},"-CucBf8VCX-zGdZTA-EMvw":{"text":"Every single recommended itinerary on TripAdvisor had this listed as a must do.  So, I was","useful":0,"cool":0},"KVXvE86IYt7k4iSZJvSP5Q":{"text":"Really had a blast my husband and I had a great time. The food was beautiful and chef bran","useful":0,"cool":0},"Bn7_R0x8E96R3tZIzCkkKw":{"text":"Waking up at 10am in New Orleans can be rough to say the least.  But my trip to the NOLA s","useful":0,"cool":0},"CdiJADM3S7IjnqM6ULi0Pg":{"text":"This was one of the highlights of our trip! It was well organized, the ingredients were fr","useful":0,"cool":0},"mZcG6iMsQXJbLW-L6vDaRQ":{"text":"Before you pay for a class, make sure you know the difference between a \"Demonstration Cla","useful":1,"cool":0},"7jy6iWHbTdWj_UB9w2AewQ":{"text":"If you're visiting New Orleans, taking a cooking class at the New Orleans School of Cookin","useful":0,"cool":0},"kQutHhM34rrANRbiFWL5EA":{"text":"I learned so much! Harriet was entertaining and informative. The food was delicious. Thank","useful":0,"cool":0},"Q-6u7-Ka3PlNSJ5nIZe2zw":{"text":"Go here. It's different than anything else you'll do while in NOLA and very educational. A","useful":2,"cool":1},"sRVAbPHY5kTQbbu0CgX1NA":{"text":"just visited nola, had to stop and get pralines, but was very disappointed this time. the ","useful":0,"cool":0},"a9-vYLxOwkFtjV2Mrr57SA":{"text":"This is a must do in New Orleans if you love food!  Think of it as a hybrid comedy show * ","useful":0,"cool":0},"-uaW_bN3vTWHTYNpO1EQ1g":{"text":"YES!!! Visiting New Orleans is all about the food. Once you leave the city, you're stuck w","useful":2,"cool":0},"aoej_0E6qDhuUQxOWiFWuQ":{"text":"Awesome experience! This was my third time to New Orleans. I wanted to do something differ","useful":1,"cool":0},"7k_t1qLv0x9j1U_8Njkh1g":{"text":"We stopped to get pralines. They are the perfect size with lots of nuts and a great price.","useful":0,"cool":0},"2B9Ay67A_I3xFUPpl_Axqg":{"text":"We had this very entertaining, spunky chef-Harriet (aka: \"Babee\"). We never experienced a ","useful":0,"cool":0},"2b01iKgn_JFgvhxuErevSg":{"text":"Michael was the instructor, he was simply wonderful. I absolutely loved the class from sta","useful":1,"cool":1},"rxYlY5RlIHC5ZaGIboOykA":{"text":"I can't believe we didn't do this earlier!!! This is now a regular stop for us when we vis","useful":0,"cool":0},"-9Pg_xF7t-8DDMfIOcTt-Q":{"text":"Chef Brandon was awesome! Great demos and fun stories. Hubby and I had a blast. I can't wa","useful":0,"cool":0},"nujjj-wewxydh4GOFkCYNg":{"text":"I have done a cooking class once while visiting Lima, Peru. I loved it and was a trip high","useful":0,"cool":0},"X49hvlEJ_KkY-gIbxQdTMw":{"text":"If you have time and the chance, DEFINITELY take the cooking class  here!  I'm a foodie an","useful":1,"cool":0},"CQEFyv0-haw78Lw6cSmtJw":{"text":"The School offers two kinds of classes -- large groups watching a chef and hands-on class.","useful":0,"cool":0},"_HnWy2WoWyVVCGgcOFC-Wg":{"text":"This is one of the funnest things we did on our trip to NO. Chef Kevin is outstanding! He ","useful":0,"cool":1},"7bhtGluDTSjYhYPadqIWFA":{"text":"I like food, I like the history of food, and I like people who know both.  The class I too","useful":0,"cool":1},"ArVH45eThf8dGM1dvRZRLg":{"text":"My family goes to New Orleans a couple of times a year. One of those annual trips is sched","useful":0,"cool":0},"epvXGfy940VCcSLjeG93kA":{"text":"Well worth it. Entertaining, tasty and there was beer. Inspired me to try to make gumbo an","useful":0,"cool":0},"494jSxqcbibE2Cd8CPkXtw":{"text":"After a day of shopping in the French Quarter, I realized that I wasn't going to find a hu","useful":2,"cool":2},"5pOGaw3iccs4HB2ibILaRA":{"text":"I had the BEST time! Pat was our teacher, and she was like Paula Deen, but sassier and awe","useful":0,"cool":0},"-4uJDjBcGbdm_Ql79CmT5A":{"text":"Had a great time. Great food, entertainment by chief boudy along w learning a few things. ","useful":0,"cool":0},"z5eZolXlRJ7i_BZYKze42w":{"text":"You don't have to cook to love this place.  Great staff, wonderful gifts on sale,  and  ha","useful":0,"cool":0},"B_w0aGu-PPqK_hAO8FfnwQ":{"text":"We attended a demonstration class, it was wonderful but I thought I was buying the hands o","useful":0,"cool":0},"t0NuOevrrCRcfFdsy7XCUg":{"text":"This was a great experience and highly recommended to anyone visiting New Orleans who enjo","useful":0,"cool":0},"RW7b8uMoyfHDdhGWfZATtQ":{"text":"Definitely sign up early for a class here.  Plan on eating a meal here--not just bites.  V","useful":0,"cool":0},"7Wc6NsJ7mcsZ_CKGZpj8iw":{"text":"I took Kevin's cooking class and it was my favorite experience from all the time I spent i","useful":0,"cool":0},"qKmgCdHN-jnkxGstnAeBxw":{"text":"This review is a little delayed! The bf and I went to the hands on cooking class back in J","useful":0,"cool":0},"WzmpDCrqaUmRQkYFr-lQsA":{"text":"The instructor is not nice and the raw ingredients were almost rotten.","useful":1,"cool":0},"2RLtAfKrH3EiJ6gdB1w_xA":{"text":"Awesome!!! What an experience! Chef Ricardo was great! It was a party in our hands on clas","useful":0,"cool":0},"DSbqt3UFWsxag11UI43T7Q":{"text":"This is a must-do if you are visiting NOLA.  Like so many people, I think food is a great ","useful":1,"cool":0},"9fQufh20P3Bdw07E_MsKyg":{"text":"One of the best experiences while vacationing in New Orleans. Its no wonder it rates so hi","useful":1,"cool":0},"XvVYpJCfLA6vbePoKgLljQ":{"text":"We did the Hands on New Orleans Cooking Class. The class would have been more fun if our c","useful":0,"cool":0},"_ySeL43kaJTqb5KveBSfBw":{"text":"One of the highlights of the trip! We took the group demo which was not a traditional cook","useful":0,"cool":0},"LvdU1P5bRH2bx1vKE8a6NA":{"text":"I had my surprise birthday party here.  I had to cook for all 35 of my guest.  It was a tr","useful":0,"cool":0},"Pw63jyRomfB0DsWxyVN6gw":{"text":"My wife and I attended their cooking class tday and it was a blast. Our instructor, Chef R","useful":0,"cool":0},"vx1Ry3pTqzwtGdIraesPCA":{"text":"So, we splurged and got the private master class with a chef, four cooks and a chef walkin","useful":0,"cool":0},"PAkELzBh1U1p9SvSZb_3Yw":{"text":"Just finished the Gumbo, Jambalaya and Praline class by Kevin. The class was fun and infor","useful":1,"cool":1},"A4rr3dZtKRv_o7XHFhP12g":{"text":"You can do this by signing up even just a few minutes before class time, to take a one-tim","useful":4,"cool":2},"ifM5eNnEdkK1lgHMBf0ZIQ":{"text":"I really loved this place.  I wanted to take 1 of the afternoon cooking classes, but could","useful":0,"cool":0},"it3u8wgj593I-A6Mla6LLw":{"text":"So much fun!  Went and admittedly wasn't sure if I should go or cancel my reservation.  Bo","useful":0,"cool":0},"UpLJOKpFQqx-nSNALOHjEA":{"text":"If your in New Orleans and have the Time or opportunity to do the cooking class DO IT. And","useful":0,"cool":0},"H9b7geN-Nfx-r4rJjfL8Ig":{"text":"Decided to do this based on the extremely positive reviews on TripAdvisor. We were greeted","useful":0,"cool":0},"KU7WCZipwCaJrTSc1rhoWA":{"text":"Made last minute reservations after passing by the place and our Uber driver mentioned it ","useful":1,"cool":0},"Z7KuE41J1nrHqbOkQWQgTw":{"text":"This place deserves 5 stars!!  I really enjoyed my afternoon here!!\n\nGreat food, fast pace","useful":1,"cool":0},"p4bi9CmbRB32GEgS7IWfSQ":{"text":"We took the public class and strongly recommend you sign up early as they let us in the cl","useful":0,"cool":0},"8kVLzM7DKI51xFiObhB7uw":{"text":"We attended the cooking demonstration with Harriet, and it was officially the best thing w","useful":0,"cool":0},"x73rGSXOds0lkomQOat_PA":{"text":"Last year when we visited the Big Easy we fell in love with the food and brought back all ","useful":0,"cool":0},"v5YhbYS46zrFPORSfV5xlw":{"text":"I took this class with my mother on our recent trip to NO.  We loved it!  Our teacher Sond","useful":1,"cool":0},"t9Ireg8uYTLhpeFRn1rQtA":{"text":"Chef Micheal gave a wonderful historical tour of New Orleans all the while preparing Crab ","useful":0,"cool":0},"OrGPk5lwk5RTsBYGuAmzUQ":{"text":"Great fun and great food!  Chef Eric was a terrific teacher. We created a wonderful meal w","useful":0,"cool":0},"Bhr6Vpht0rFQqw1WAAPh_Q":{"text":"I loved loved loved this place. Going in I no idea what to expect. What an experience, I w","useful":0,"cool":0},"dZypO_Ni4qGqCMq2V9gAmQ":{"text":"What an awesome F'n experience!\n\nI love to cook and love to eat. My wife doesn't enjoy eit","useful":0,"cool":1},"qRBlmbOw04D8HhucfJtDNg":{"text":"I did a 10 am class, which featured jambalaya , gumbo , pralines and bananas foster. If yo","useful":1,"cool":0},"H7rQfDv_Ls3h7ky2Pj2JIA":{"text":"My friend and I did this the morning after our first JazzFest and I was a little worried i","useful":1,"cool":1},"AmWNEyGrTka7p_n4UNxpog":{"text":"This was so much fun!!! The food was amazing, and the history was very entertaining. I wou","useful":0,"cool":0},"QX5JVj80aDlaA6ZqZBzBYw":{"text":"Chef Pat was adorable!! A wonderful mix of history lesson and cooking school!! Even my hus","useful":0,"cool":0},"4BrDrO3dUyKpLtwF7a5wXQ":{"text":"Had the best time, and even learned a thing or two.  Food was great and I think I'll be ab","useful":0,"cool":0},"BZ2Ces_sr1Iyli0Pl5lZJg":{"text":"This class was awesome!  Chef Kevin was great. He knew his craft and made us laugh. If you","useful":0,"cool":0},"TbF771gEe_uU85XVfcP4RA":{"text":"What a super cool and fun experience this was! My sister from another mister Ms. Libby V. ","useful":13,"cool":9},"QwzIa_me0Uq74uXYoPg-AQ":{"text":"Y'all, This place right here...one of the greatest experiences in NOLA cuisine I've had.  ","useful":0,"cool":0},"ROiALWCZhfP9P734Agon5g":{"text":"We had Ed as our instructor and had a blast. We had our fill and the gumbo and jambalaya t","useful":1,"cool":0},"ysjRgZ42fOWP1MD1rZe0PA":{"text":"For $30, I was entertained, fed good food and beer until I was about to burst, and given a","useful":1,"cool":1},"ThuuAfxo6ojMl81mGXrgqg":{"text":"I'm going back a few years (ok, maybe more than a few), but we were talking about this exp","useful":0,"cool":0},"6uiJ0CTSyMrP3-d7UitioQ":{"text":"Pralines. That's it. $.89 for one is a steal and less than $10 for a dozen. My husband ate","useful":0,"cool":0},"dywTO1ggxJqFvfT6yL8XSA":{"text":"My friend and I had reservations for the Saturday cooking demonstration that featured gumb","useful":0,"cool":0},"NaIcsdks3fO0F4BNQuNnDg":{"text":"This whole experience was amazing.  We booked online ahead of time and showed up 1/2 hour ","useful":0,"cool":0},"7jlf90RuGaoi4jhMoXdxUA":{"text":"Had an excellent time and the food was delicious!  Our chef today was Harriet and she was ","useful":1,"cool":1},"6J6kePyl6CMpPkAVRogo2g":{"text":"we did this on a whim after seeing an advertisement in a flyer we got from the taxi compan","useful":0,"cool":0},"hrSQTdcnXpuHe5bibc-EQA":{"text":"Must Do!!!\nWhile in NAWLINS for a long weekend, my husband and I were yelping of course an","useful":2,"cool":0},"g-tvnkqBPnLBv6xR5rBQig":{"text":"Wow. Where to begin? The instructor was knowledgable. She took time to teach us about the ","useful":0,"cool":0},"JJ4QqYs5MR-5-VBM24ZFlQ":{"text":"tome la clase de cocina de Gumbo, red beans and rice, pralines y pecan pie. La clase en si","useful":0,"cool":0},"r4NkD2Eh9fpQJ4a0UgRPcQ":{"text":"More of a demo but if you show interest Ann will call you to come up and help. It was fun.","useful":3,"cool":0},"iZdqQQ0R9P_N2-_6ybC4Yg":{"text":"We signed up for the 2+ hour demo where you are seated at round tables with about 8 people","useful":1,"cool":1},"b1rzeppcsynDsG8VIjPVqA":{"text":"This was a pretty good demonstration class.the class was affordable. It was a full class b","useful":0,"cool":0},"va725talIuOKWhgBrFypNQ":{"text":"A must-do when visiting. \n\nWe were a group of nine and we really enjoyed our cooking class","useful":0,"cool":0},"JIoIttits8JOpvquNVkgEg":{"text":"I went here with my 4 girlfriends during my Bachelorette weekend. It was really great to g","useful":0,"cool":0},"oPL8GKZOcFgQ9TXHAt3oYg":{"text":"I had a very poor experience trying to make a reservation for 5. There seemed to a lack of","useful":0,"cool":0},"IXVIS6F4ZjeTIh53-7Gzew":{"text":"Not really a class but a live cooking demonstration.\n\nLovely enthusiastic southern instruc","useful":1,"cool":0},"x31JYH0BvXnFhe9Oza3V1w":{"text":"This is a must-do when in New Orleans! As a foodie, a home chef, and a lover for all thing","useful":2,"cool":2},"IxFfsuIbzXVsF5qYQkPnIg":{"text":"We decided to check out a demo class for Gumbo, Jambalaya, Bread Pudding, and Pralines. Do","useful":0,"cool":0},"17ZW54RBG42aMTWr8DFNlQ":{"text":"Out of our 3 days here this was the favorite. We attended the cooking demo for gumbo, jamb","useful":0,"cool":0},"PYhoi3dKd6cBfVBQxFxSzQ":{"text":"Loved our instructor Pat, and the food was amazing, especially the pralines and corn and c","useful":0,"cool":0},"b8ylI9p1xw2O01kzfiRFRA":{"text":"Chef Kevin was a great experience.  From the food he prepared, which was delicious, to his","useful":0,"cool":0},"V-sLIJWpl-p246JwOwusAg":{"text":"Entertainment while you learn a little about Cajun Cooking, AND you get to eat the demonst","useful":1,"cool":0},"6NF3kFWrzKJPRt-5G9lGJQ":{"text":"Loved this class! \n\nWhat a great deal it was to pay $25 bucks and get all you can eat lunc","useful":3,"cool":1},"6Iw-zmI_MGkX-LSINdkzig":{"text":"This is one of the best values in New Orleans...!!!\n\nFor $32.50 each we had 2 1/2 hours of","useful":4,"cool":2},"An79EdS5vXHAXQS2FwRiCw":{"text":"Big Kevin was awesome. Great personality, great jokes, and great chef!\n\nYou really learn a","useful":0,"cool":0},"sxExn6DUshGi71UYWkztrQ":{"text":"This was such a fun place.   I should have rated this months ago, it's at the top of my li","useful":0,"cool":0},"XVEbjiOYxKsjWxGteTeobg":{"text":"We did the private cooking class and it was well worth it. Not only did we learn a lot of ","useful":0,"cool":0},"9fqMpO4GH7cnV1ZdMeapUQ":{"text":"I forgot to mention when the class is over stop into their little gift shop and grab a \"Jo","useful":0,"cool":1},"NrVBGWgor9Xj-XzMnb9Kag":{"text":"A must do in the French Quarter. We walked into the general store and chatted with the own","useful":1,"cool":0},"gWX0RBHgaG3TfU3ILz-jew":{"text":"Late September 2015\n10 a.m. class\nTeacher:  Pat\nFood: Gumbo, Jambalaya, Bread Pudding, Pra","useful":1,"cool":0},"dQdyuRhwq0YS4Y90bNTe7w":{"text":"The cooking class was so much fun! def worth the $ if you're lookin to experience new orle","useful":1,"cool":1},"3qpoQu_QJsE0itir6mkWnw":{"text":"It is a great place to come and learn a history of New Orleans while watching live cooking","useful":1,"cool":0},"v6j7slVIj39sf50ihlViTw":{"text":"After seeing the Yelp reviews before coming to Nola for my first time, my fiancé and I dec","useful":0,"cool":0},"c4cHKrkPJuMd1LoW2nouWA":{"text":"Amazing demonstration class with instructor, Pat. She taught us how to make Gumbo, Jambala","useful":0,"cool":0},"tV8ydK8_3evEH9iDvI67Eg":{"text":"Wonderful experience.   We learned so much from Chef Toya Boudy.  She kept us entertained ","useful":1,"cool":0},"z1CiBLo7jHpEXswMvkQLyA":{"text":"Had a great experience with Chef Sarah Wood. The recipes were easy to follow and Sarah was","useful":0,"cool":0},"wRHB09-xVmvBX9FiQr8MBA":{"text":"A must try!!! Ms. Anne was a great instructor.","useful":0,"cool":0},"hP2DRRWnOqDGuhhi3CRfhA":{"text":"My wife and I recently attended classes at the School of Cooking in the French Quarter. I ","useful":1,"cool":0},"wZf1ZL5gIRTSOePvUynAKg":{"text":"Pretty yum and fun for the class!  We learned how to make etouffe', pralines, and gumbo.  ","useful":3,"cool":1},"wkJA-592y_O0L1mEse72Dw":{"text":"Great place to check out. This was our first stop when we got to New Orleans. The chef was","useful":1,"cool":2},"0W68uwn3CZ0sNwx7lxTG8A":{"text":"We had a blast. Our instructor was Kevin and he kept us entertained and hungry. His instru","useful":0,"cool":0},"cDacYwiCA_kZCsqg_rGxZg":{"text":"I was looking to keep myself busy while my husband was at a conference. A cooking class so","useful":1,"cool":1},"W252nGW7dbIP8vzG7OZoVQ":{"text":"I took my son here for a  cooking with Mrs. Santa Claus class and I must say we had a good","useful":4,"cool":2},"j3cuiw3vgAMBB1yx9se_2A":{"text":"This is a MUST when you're in New Orleans.  My two sons (26 & 21) and I took a morning cla","useful":1,"cool":0},"OY99Nhy2gOe8FyyB6xZAiQ":{"text":"Yes the chef is arrogant and he openly admits it. His glasses are horrible btw. The cookin","useful":0,"cool":0},"DxXgivhcycfE9j-ebWSn1g":{"text":"We took the lunch time cooking class on Oct. 30, 2014.  We come here every trip to New Orl","useful":0,"cool":0},"jyR-s_D_sMN8s6vj1NseUQ":{"text":"This has so far been my favorite part of my trip. My teacher was the lady with the silver ","useful":0,"cool":0},"RJn8ZYs7Cik0aP-3yuYncg":{"text":"The class was more of an education of the roots of Cajun or at least that is what I gained","useful":4,"cool":0},"j1CS0vBP0eptD9R90HXLdA":{"text":"A DEFINITE MUST WHEN IN NEW ORLEANS!\n\nAt first I was kinda complaining that the class was ","useful":3,"cool":1},"Q51ebo4lNzI14MX8pO6jwg":{"text":"We took this class without really having any idea about what it was going to be like and w","useful":0,"cool":0},"yiIPFnqkTGcevBzgwc4fVA":{"text":"Was in town for business and looking for something fun to do. The hands on class was perfe","useful":0,"cool":0},"HyD2w6ZLpTcuNSNLHevWAQ":{"text":"Our group had a great time at the Cooking School. The classes are well organized. Our inst","useful":0,"cool":0},"WN3256R8RWGMSa1pg6CI7w":{"text":"My best friend won a teaching award and flew us to NOLA with the money. This class (and wh","useful":0,"cool":0},"mxIJm_l0f74WGEcjbdPtVQ":{"text":"My absolutely favorite part of our trip. Chef Kevin was so funny and really taught me a fe","useful":0,"cool":0},"ppnIwgjbfw1MEEiVx_H6FQ":{"text":"The name \"New Orleans School of Cooking\" is a bit of a misnomer.  It's not really an inter","useful":1,"cool":0},"LGRYjsBhMkbEy0EHkuDXfQ":{"text":"Wow! Food is fantastic! Pat was out chef, great speaker and excellent cook. Very witty and","useful":0,"cool":0},"qw9TvEnX2xhkRNt6dMI7Rw":{"text":"This is a must-do if you are a foodie in New Orleans looking to learn more about the histo","useful":2,"cool":0},"UCW8AtwESs905jXpQg1icg":{"text":"The New Orleans food is unique as it has a mixture of French, Spanish and African Food. So","useful":0,"cool":0},"hCGWwzLM6dewN9G9hLppxA":{"text":"Had a great time at the school. We had Harriett as a instructor. She was very funny and ma","useful":0,"cool":0},"DbualOHFTeSIEh-q7Xpoyg":{"text":"Suzie and I walked by this country shop and school of cooking as it was right by our hotel","useful":0,"cool":0},"vZD3dlzJR1T83bEwkDuFYg":{"text":"After long hours of walking around New Orleans, the demonstration class at the New Orleans","useful":0,"cool":0},"GuG4Hx1xjZxHgn6TKRJAsQ":{"text":"An absolute must while on your visit to New Orleans. My husband and I stopped here thinkin","useful":0,"cool":0},"hjolGGrJGJsnTCROF1n1Xg":{"text":"I visit New Orleans quite often and this is my new favorite thing to do, when in NOLA.  Ch","useful":0,"cool":0},"BMZMwxBdbEnBZi5wrZdUtQ":{"text":"We attended the demonstration class, best choice we made during our trip.  After eating ca","useful":0,"cool":0},"oZBd32cvTVrx3bpsIqt94w":{"text":"If you are a tourist in NOLA or planning a trip, do yourself a favor. Make this place part","useful":1,"cool":2},"0ZqneTX4EgnZZwa9bGoutw":{"text":"Chef Kevin made the class fun, enjoyable and plan to return next time for another class. H","useful":1,"cool":0},"zMpZV8mwXux-KmSBrWtgKg":{"text":"Although I was looking forward to actually cooking, Pat, our instructor did a fabulous job","useful":1,"cool":1},"PuWc8u1oOChDZqHCHp_HVQ":{"text":"This was an amazing experience if you need to do a team building dinner with your co-worke","useful":0,"cool":0},"mkZsUbmME88CSz83G2iOjg":{"text":"This class was a great experience.  The chef demonstrated how to cook the native New Orlea","useful":0,"cool":0},"0IWyx1GWNPQw1UYbeFFTQg":{"text":"Had a day to myself while visiting New Orleans and decided to spend a few hours in a cooki","useful":0,"cool":0},"v6eUfBFx6VsqhsNl6VAMbg":{"text":"Oh sweet southern Jesus! This is an absolute must-do while you're in New Orleans. I don't ","useful":2,"cool":2},"MNIdPQSK1ixDKxW9ueeKQQ":{"text":"Omg! Can anyone say pralines?!? I never had tasted praline sweets so good before! At less ","useful":2,"cool":2},"Hbn1eHCqrZjv5MgwJmn5WA":{"text":"Chef Kevin made this meal an adventure of flavors! Our extended family had a rehearsal din","useful":0,"cool":0},"KnM7QMuwClRWDi21Qo9akw":{"text":"Wow New Orleans best kept secret!! For $25 bucks a cooking class, lunch included and pictu","useful":0,"cool":1},"MOSCRypyZN1e06-0fMSw6Q":{"text":"If your looking for something to add to your vacation other than tours, I highly recommend","useful":2,"cool":0},"nyhOhsIfD25CB-AUQvZKeA":{"text":"We went to a 2 p.m. \"demonstration\" at the New Orleans School of Cooking after spending an","useful":0,"cool":0},"HHUEgmnaM4V13m_J4vY0QQ":{"text":"I had a wonderful experience at this class this morning because Harriet made it very speci","useful":0,"cool":0},"sJF5eDLxdWHNnsEvsDlUPA":{"text":"My daughter and I came to learn how to cook gumbo and jambalaya properly. We were pleasant","useful":1,"cool":1},"JUfE5AoF1jSTivfvpt5jdw":{"text":"Harriet \"Mother\" was just outstanding.  An absolute spitfire.  I can't say enough about th","useful":4,"cool":0},"N1TwByG-4TzO-fPl0AcKJg":{"text":"in New Orleans  at the cooking  school.  worth the cost and time. entertaining  and great ","useful":0,"cool":0},"j-ny82TASD7DlMW2zLnc7A":{"text":"This is a cool deal. Learn to cook four New Orleans specialties with Chef Kevin:\n\n* Gumbo\n","useful":0,"cool":0},"zn4P8diHAk_EEegDwQLfSg":{"text":"Booked a private class. We totally scored with our wonderful instructor. She didn't only c","useful":0,"cool":0},"cgbGNyZ62sDUSzOkIsly9g":{"text":"Do this!!! You won't regret it. We did the gumbo, jambalaya and praline class. Big Ken was","useful":0,"cool":1},"UWF1kQmb-SeDyUYKbJCTjw":{"text":"Yes. Just yes. 2 hours of entertainment and a meal, and they'll answer any questions you h","useful":0,"cool":0},"qOdwivE-8GY-_v8mBgPpIQ":{"text":"We came here to watch the cooking demonstration.  Our chef was informative and fun, and ma","useful":0,"cool":0},"5rh-eXDl6t_Z2vkIXhE1fA":{"text":"Love this place. The class with big Kevin was insightful and fun.  The gift shop has a lot","useful":1,"cool":1},"xLwACyMyW-JzLWIFT9kY8A":{"text":"Hands Down!  We absolutely LOVE this place.  If you want to taste and learn how to make au","useful":0,"cool":0},"7Mnfrx1jVEuEH09sR8ICfg":{"text":"We were on vacation in New Orleans for a week.  We took our first class on Monday and deci","useful":0,"cool":0},"isvXOf7OEGm_hS-NGgb8EA":{"text":"Great experience!! We had so much fun and ate soooo much in samples! You definitely get yo","useful":0,"cool":1},"ge-uyOmcut8WRlQ4_ponUA":{"text":"Best part of the trip was our hands on cooking class. Experiencing the smells and flavors ","useful":0,"cool":0},"ebCwpOqElOXCpjPk86NLlA":{"text":"It's hailing pralines!\n\nBest ones in New Orleans- don't be sucked into the tourist garb on","useful":0,"cool":0},"2hLRCEKu3uYAY9vqJSqFjw":{"text":"Oh wow.  I so busy eating and ohhing and ahhing that I forgot to check in!\n\nI love this pl","useful":0,"cool":0},"uCQg8VYZa04LuPjKdhVDow":{"text":"The cooking class at the New Orleans School of Cooking was something of a last minute choi","useful":1,"cool":1},"CW0Qx_tL4szneXhStg6MeQ":{"text":"Really enjoyed the presentation by chef Brandon. He prepared gumbo, jambalaya, bread puddi","useful":0,"cool":0},"F1rVfOxjKZ9YuXESJXLO6g":{"text":"Went to the 2pm class on a Saturday. We had Shrimp and Artichoke Soup, Crawfish Etouffe an","useful":1,"cool":0},"hJK9pnK7ebCnaK1oQoHukQ":{"text":"Had a great time at the cooking class, learned a great deal not just about cooking great t","useful":1,"cool":0},"pifltFnhuKeNXlRWWZkVWQ":{"text":"Absolutely wonderful experience with Chef Kevin. He was funny and fun. He took us through ","useful":0,"cool":0},"-v3a0LoGtTDZ9uQmGg-1nQ":{"text":"We had a great time learning to cook New Orleans style cuisine during our three hour hands","useful":0,"cool":0},"Eg9Dmb282ejdrjL5nsRYdQ":{"text":"Had such a great experience and learned a lot too! Useful cooking tips, you get what you g","useful":0,"cool":0},"N7XcqYR0JULSaU0Ry9fgjw":{"text":"Je vous le recommande chaudement! Il s'agit en fait plus d'un mélange entre un one man sho","useful":0,"cool":0},"dr-BgWIDAzkUxNP1l9r4nw":{"text":"I took a cooking class with Chef Kevin while in New Orleans for vacation, and I have to sa","useful":0,"cool":0},"Ko_ZkqLyS4FkB4VWZ1MTmg":{"text":"We were in town last weekend and decided to visit the school for a cooking demo. Let me te","useful":0,"cool":0},"14fkaFbahMTTdHZvVte7Sw":{"text":"We had the best time here! The food was so delicious and I can't wait to try my hand at ma","useful":2,"cool":1},"qTmIXKmqepnEggQqmPGt8A":{"text":"Amazing experience with culture, history, delicious food, and a cooking class all in one! ","useful":0,"cool":0},"SVch5v5gYLDAry-RpD049A":{"text":"I just attended the New Orleans School of Cooking and can't wait to tell you what a fabulo","useful":0,"cool":0},"5_o_64Z9ckREujbihHpicw":{"text":"This place is more of a live demonstration than a school. There is an angled mirror on the","useful":0,"cool":0},"b_tnqql_r_2Zzu65PoNlOA":{"text":"We finally took a class and scored Chef Kevin for gumbo, jambalaya, and pralines.  It was ","useful":0,"cool":0},"GsUr_SXrO4MrdePpbqjE4A":{"text":"So awesome!  The host was funny, very informative & knowledgeable.  The food was fantastic","useful":0,"cool":0},"zTr9YFpF7nP05aMpKJYb3Q":{"text":"Went on a class trip and was here for our last dinner in New Orleans!\nAmazing work! Kept e","useful":0,"cool":0},"9p2hkeG8oEwHc_BQicYHww":{"text":"Looks like the cooking class is where it's at, but we didnt go (oh well...). The sundries ","useful":0,"cool":0},"xhtEbYHoxsO4S_AZlfhwTA":{"text":"This place was one of the absolute high points of our recent trip to New Orleans....  Ann,","useful":0,"cool":0},"_3L8dLHUqoAyrkGveMrSfA":{"text":"The highlight of my week in New Orleans. Pat was the instructor. Her love and experience o","useful":0,"cool":0},"1WLWawyTKlpI4_ujNPxz-Q":{"text":"The pralines from here are the very best in the French Quarter. We came home three days ag","useful":1,"cool":0},"MByggmMPpCsrq9VtUKZSGw":{"text":"Great experience if your visiting New Orleans and you want some background on Louisiana co","useful":0,"cool":0},"UE_NCBmmZyuv9l90MAoAwQ":{"text":"We're in NOLA at least once a year either for business or just to eat. As part of a Birthd","useful":10,"cool":8},"kslq5T1jwwwxtP7mElzzjw":{"text":"What a great experience! We purchased a Groupon and redeemed it for a cooking class where ","useful":1,"cool":1},"tObmtomETPXX7ZSjRSdTWg":{"text":"We scheduled the hands on cooking class for four couples.  Matthew was our instructor.  He","useful":0,"cool":0},"jcMrE2zNWNZNnXF3oFKbxQ":{"text":"What fun! I'm a New Orleans native, had a good time. Our chef Ann put on a great show, coo","useful":1,"cool":1},"2UN-QA0I-ZzXODPBPMBvlg":{"text":"Such a great experience.  Chef Brandon was very knowledgeable about the history, culture a","useful":0,"cool":0},"TkcyzIdwoYcqD9C3oBWi_Q":{"text":"Our instructor, Pat made this one of the best cooking classes I've taken in NOLA.  Her pas","useful":4,"cool":2},"O39OO6d6tsIcTCa4qHs4lA":{"text":"We had Harriet she was a great demo instructor. Would do this again next time we are in NO","useful":0,"cool":0},"Jz0tfom0YlwmLtBXMs_qfg":{"text":"This is a great way to try the taste of New Orleans, learn to make the taste and get enter","useful":0,"cool":0},"AGGc64FIUnBZkK7lN64uUg":{"text":"This review is based solely on the store, and not the actual school.\n\nThis is just a great","useful":4,"cool":1},"01rYzig4MRMHfwpnoyuQeg":{"text":"I've always believed getting to know the cooking is essential to getting to know a culture","useful":0,"cool":0},"sn4g_MQSJcUIlhO-YeESXw":{"text":"Took a Cooking class w/ the hubby on a Sunday. Menu was gumbo, jambalaya, pralines and bre","useful":1,"cool":0},"fryWd9A1JqT0juaZmrjyHA":{"text":"We thought that we were going to a cooking class. It was a history lesson of New Orleans, ","useful":0,"cool":0},"DLYgB91BxccM6Aa5vfXAqg":{"text":"This was by far our favorite thing we did while in New Orleans! We took the hands on class","useful":0,"cool":0},"04AOvyjcuoIgnMDcfBJ8RQ":{"text":"I cannot believe it has been almost two years since I went to New Orleans...and for some r","useful":8,"cool":6},"Pt0NVy5mMYX7S7D05oHpuQ":{"text":"Demo classes were fun.  We ended up going to two classes.\nThe first was corn and crab bisq","useful":0,"cool":0},"Ny3z5SUOV-L-7eVvBUJZzA":{"text":"I took their cooking demonstration. I liked the cooking tips, the energetic chef, and the ","useful":2,"cool":0},"2Ldi2wjIR8jamkzfQJQdgg":{"text":"I've attended the cooking classes here about a dozen times and I have always thoroughly en","useful":0,"cool":0},"fsBeeFXNANjyxZCHOo2NoQ":{"text":"Very friendly, helpful, playful people working here. Shared some experiences with and they","useful":0,"cool":0},"XK3u4iLlI9Nar-kXizaQiw":{"text":"This is so much fun! I'm really glad we chose the personalized hands-on class versus the l","useful":0,"cool":0},"UTSpIREnS2j5W9YLCT_JLw":{"text":"The experience was not as \"hands-on\" as I expected, but in every other respect it surpasse","useful":0,"cool":0},"l4rVi3C1cJlA1CYqFTcRDg":{"text":"Anne was entertaining and warm. She had tons of personality and knowledge to give. The foo","useful":0,"cool":0},"yoOMzvPiBrO1xiFj7XFFCg":{"text":"We had a fantastic time laughing, learning, eating and drinking.  Chef Michael blends the ","useful":0,"cool":0},"4H1vHUd4Bq1IYF51csnLnQ":{"text":"Took a cooking class here on a Saturday form 10am-1pm for $27. Great way to start the day.","useful":0,"cool":0},"1Q446v34iWrj8TzTkir1MA":{"text":"For $30, I don't think I could've asked for a better cooking class.  We had a class with \"","useful":1,"cool":0},"Zs3QKaDsQehoWE7YACUgCg":{"text":"My husband and I took the hands on cooking class today with Chief Eric and it was amazing.","useful":0,"cool":0},"9oiCMat0lC_tA7y5GRbUMA":{"text":"we took an awesome private class w/ michael on saturday night and made some yummy stuff.  ","useful":1,"cool":1},"j6up504aNWITl8TzWoxWRA":{"text":"Out of all the places that sells pralines in the French Quarter, the New Orleans School of","useful":2,"cool":2},"3sXI2xCcxviSKWSk5mBXYw":{"text":"Planning to write a 'real' review later, but just wanted to post my rating tonight before ","useful":0,"cool":0},"aXayXtPpG-zL_wA9J0oYBg":{"text":"WARNING: If you come once you will come for EVERY trip! No matter why I'm here I try to fi","useful":0,"cool":0},"W0mSfdjhGMGArO-YXEqFAw":{"text":"I initially scheduled one class , but after that class and \nthe great cooking teacher; I h","useful":0,"cool":0},"2IkrnZaK0rW4XAmLcJeBlA":{"text":"Hands down this is the best place to get some good food. The menu for the day was bananas ","useful":0,"cool":0},"H09EIn75EiodxhFk1m-Lrw":{"text":"I enjoyed my time in the class it was very informal I learned a lot about New Orleans ,caj","useful":0,"cool":0},"bJpefr6CcL6Cklr5dkfTDA":{"text":"We just went to this. It was fantastic! Pat was our chef she was very knowledgeable and ve","useful":0,"cool":0},"vc052gtXtjaxzFEqFrG7Mg":{"text":"So much fun! Ann was amazing.  We got a great history lesson. That I found fascinating.  L","useful":0,"cool":0},"tgVDIV8QlvygV2lwMKnoWw":{"text":"The cooking demo and history of creole cooking is a great activity for everyone visiting t","useful":1,"cool":0},"IxzXF_bqfRDm1weCM6LTEg":{"text":"This was a super fun experience for my bff and I on one of our vacation days in New Orlean","useful":1,"cool":0},"g9vO41T8dKMJZuSE5ScNoQ":{"text":"We decided to do a hands-on cooking class during our girls trip to NOLA. This was so much ","useful":0,"cool":0},"nmAC6PJwV9cE62RZr2IcCA":{"text":"Chef Michael was our guide to the history of New Orleans  and the reason the cuisine is a ","useful":14,"cool":12},"y1CxwRx0GVZf3s7jY98cKQ":{"text":"Highlight of our trip! We made a reservation for 4 for the demo class. Chef Brandon was am","useful":0,"cool":0},"oIRiVIjBHABArcw-QIHmeA":{"text":"So fun!  Went to the demonstration class and learned how to make the best gumbo in the cit","useful":0,"cool":0},"jaVkN_028RMTok558bl5dA":{"text":"This is my second time visiting New Orleans, and my second time at the New Orleans School ","useful":0,"cool":0},"m1aIk-M3Wl8LEp6iLDTqsg":{"text":"My husband and I took the hands on cooking class on our honeymoon. Overall, the class was ","useful":0,"cool":0},"--vESL_LCL9-afNX9ShUUw":{"text":"THIS IS AN ABSOLUTE MUST!!!  Whether you cook or not...this is such a fun way to learn abo","useful":0,"cool":0},"bj2qHJeW6GJar9vwKDGOEw":{"text":"As many others have stated already, you won't be cooking. Chef Kevin is a character and wi","useful":0,"cool":0},"W0JAjQhTdNpb39YKxuGdDA":{"text":"Great time again\nI came here two years ago and decided to take my daughter here for the de","useful":0,"cool":0},"XE_62NXVc4GpedRNTEQhIQ":{"text":"Awesome place to go to get both the history of NOLA while learning how to cook an authenti","useful":1,"cool":0},"9Cr0AjM5CiQikwRrct4Nfw":{"text":"My friend and I went here during the week as we thought it would be a fun way to spend a f","useful":1,"cool":0},"4LjkfPZCXEdqrWzTugzOSw":{"text":"Stopped by the little store while exploring the French Quarter and purchased a box of \"fre","useful":0,"cool":0},"Nxv5QFtNcBon5kvEsVz1MQ":{"text":"I've never taken a cooking class before.  This was100% my husband's idea and I was skeptic","useful":0,"cool":0},"9QuyrMA4LEiA2d95p4zDew":{"text":"We did not take classes here but only shopped in store.  We watched the pralines being mad","useful":0,"cool":0},"JcnsIqXKgwXYIA0urOXt0g":{"text":"What a GREAT TIME. We took the Sunday afternoon class and although you don't get to cook, ","useful":1,"cool":0},"5aFpQsEhqAxrcuJJ-HZLAQ":{"text":"My husband made reservations here and I had a pretty good time.  It was something differen","useful":1,"cool":1},"TmGgIA8DExKJUakW0y1m9g":{"text":"Whenever I go to a place that has an authentic culinary scene, I try to find a cooking cla","useful":0,"cool":0},"FCepbglWRkrsbu9qlbTOeg":{"text":"I came here for a open demonstration class on a Saturday afternoon 2pm-4pm with a group of","useful":3,"cool":3},"o9DdOwXf2hNxtOnf2qGwCg":{"text":"We found the school to be a really good value. 2 1/2 hours of class which included lunch f","useful":0,"cool":0},"sdl-Et_OVY4pq1C17tztRA":{"text":"This was so much fun!! Our Chef was really great and we all created fantastic meals! We ma","useful":0,"cool":0},"h1w8wbgvKO5JuavCkPsPUg":{"text":"I took the demonstration class and really do not understand all the great reviews of this ","useful":2,"cool":0},"6Vj8zlVydf8zioX-njk0-Q":{"text":"Super tasty fun class that combines local stories and instructional advice for all cooking","useful":0,"cool":0},"RanEFmkDisf426J4NsRahQ":{"text":"Sweet swaddling creole-spiced Jesus! (keeping with a trend here)\n\nHANDS DOWN one of the be","useful":2,"cool":0},"cvcrZnabC5TMHCKu0EbMMA":{"text":"One of the highlights of our trip! We decided to do the hands on cooking class. Chef Eric ","useful":0,"cool":0},"labSL4b2q4ZpufmhTVXzjg":{"text":"This was the best dinner we had on this trip! In fact, the only bad part was that dinner w","useful":6,"cool":5},"UgmJrVxS6kAPygVEqAnyUg":{"text":"WOW!!!! Worth every penny. I celebrated my birthday here and I think it was one of the bes","useful":2,"cool":2},"Hc1oxTQIUo3YLQWzU_NO5g":{"text":"The New Orleans School of Cooking is fun for tourists and visitors alike. \n\nI'd like to th","useful":7,"cool":3},"RTrD6MmWkOvjl6HHFIkizw":{"text":"We did the cooking experience at the New Orleans school of cooking.  When we arrived it wa","useful":0,"cool":0},"caBF8b51xKpWqbWPFqw5pA":{"text":"There I was enjoying a glass of wine in our room and reading through an in-room publicatio","useful":3,"cool":2},"ivCvdGyJC9FZe7M1OgG0_w":{"text":"This was not our first time nor will it be our last.  This trip we enjoyed chef Matt's his","useful":0,"cool":0},"s8dTiA89s0Rkuc3jKP4VwA":{"text":"This is fab. I went to cooperate with my wife. Too much else to do around here, why watch ","useful":2,"cool":3},"WCMFQzU_7TXhSMYR2pAYtg":{"text":"Awesome Experience!!!!   Excellent Food!!!\n\nHad the Hands On gumbo cooking class with Chef","useful":4,"cool":3},"RaDx5E_39j9x7uI6zvflDQ":{"text":"This is such a fun activity! I attended the group cooking class. The chef teaches you how ","useful":0,"cool":0},"G7Jg32aBhd811Ri8Uk6Ndg":{"text":"I've taken the class at New Orleans School of cooking several times with Kevin and it's be","useful":2,"cool":1},"vX_jmD0Qbi0KKthUBpf7fA":{"text":"What a wonderful experience.  Chef Brandon was such a wonderful instructor. Class was info","useful":0,"cool":0},"lOT5Zwnr0W3I3fZZG3IxzQ":{"text":"We had Brennan this morning for the gumbo, jumbalia, bananas foster and pralines class. He","useful":0,"cool":0},"gn-6oZrOHdHkNnp-U-PWzw":{"text":"My husband & I decided to sign up for a class on Monday night while we were in NOLA on vac","useful":0,"cool":0},"ZbcMmTcu3J0kP8nJKt7-nQ":{"text":"Went to the demo class and not only ate delicious food (which they made plenty more of for","useful":0,"cool":0},"tPlP3tEzUpxFzFUlPz-u5g":{"text":"We had a great time with chef Ricardo, he was informative and gave us a few small tips in ","useful":0,"cool":0},"HAPc5S7Ui8u3oJozd1PuMA":{"text":"My friend and I brought our little ones to the Cooking with Mrs Clause event for the holid","useful":0,"cool":0},"D3JOsJy_lZqgcDR6h4nj5g":{"text":"This was so much fun.  I got the idea of attending after reading an organized tour group i","useful":1,"cool":2},"77IhavF_x_M7zAqej02BsQ":{"text":"New Orleans School Of Cooking has opened a retail location at Jackson Square \n\nCome in & s","useful":6,"cool":5},"8wsKF_Gdnv7DVlCFvow5Eg":{"text":"I've been to this class twice and I've enjoyed the teaching, the laughs, and the food each","useful":0,"cool":0},"zwsovbi7NW5K7MygEieqsQ":{"text":"Being in Louisiana my whole life my love and I have cooked these dishes so many times and ","useful":0,"cool":0},"11TPyiG1krG6sNpqR8kTEw":{"text":"Different types of classes/food offered; we did the no \"hands on\" one. This was the best j","useful":0,"cool":0},"PPqcP74XQPKov9Zg2VLVvQ":{"text":"I love the pralines  I look forward to having them fresh in two weeks. I must say it's bes","useful":8,"cool":8},"-8fMj36W-NX0aNfE6nxbxA":{"text":"Had a wonderful time in Ms. Harriet's class, teaching us to make local dishes and about hi","useful":0,"cool":0},"3IG2BYvS3kjDs88wdUA6gg":{"text":"My husband and 2 kids went to the open demonstration. Our chef was entertaining and inform","useful":0,"cool":0},"bAN5W7hG7IpAFE5hP83vKw":{"text":"This is a must do thing when visitng New Orleans! You get to sit in a air conditioned room","useful":1,"cool":0},"kwwTAoF3aqWN8oAjywEUFQ":{"text":"Your thinking, why would you stop here?  They have the best chocolate pralines.  I am not ","useful":8,"cool":8},"0hroJEecod9QNHngqeToew":{"text":"Great time, cooking demo had a lot of great information and the food was really good.","useful":0,"cool":0},"9xbW1Ee2auZb5ZhKDvYrNA":{"text":"I had good time at the cooking school, tasted a lot of sauces that the cooking school sell","useful":0,"cool":1},"oie3ojhD0CFTOM1mQv8Izg":{"text":"Awesome experience, will definitely return in the future! Chef was wonderful, food was fan","useful":4,"cool":4},"Pd5fFx1OC-ilsfVv9tbqAg":{"text":"5 stars for real.  It's what they do and they are pros.  Organized from the booking throug","useful":1,"cool":0},"rJ5smE9uYwndLUX3XC5bxA":{"text":"I am at a cooking class   Chef Anne leanhard has taught us how to make gumbo, jambalaya, p","useful":0,"cool":0},"wtrsCi9dX2VItHuyKwWxQg":{"text":"Chef Brandon is very passionate about the correct way to cook New Orleans Style dishes. He","useful":0,"cool":0},"WWvsimgPsWgu3bckzy7pLw":{"text":"Seriously one of the highlights of my trip. I love to cook and this is a great way to lear","useful":0,"cool":0},"UtUSkxrsOSg30uLecl3SpA":{"text":"Signed up for the cooking class on our last day in New Orleans. So happy that we did. Had ","useful":1,"cool":1},"cwGnCQ8CRxkqXsg9KOVUPg":{"text":"An awesome 2 hour experience. The gumbo & bread pudding was worth the price of admission. ","useful":0,"cool":0},"giLQwnJt9FJOc7opJhVQEw":{"text":"This review is for the little gift shop and store that is part of this cooking school, as ","useful":1,"cool":1},"CyINuQw8AFVWG5jtbqdDkQ":{"text":"We did a hands on class as a family and had a great time. We learned a lot about the cuisi","useful":0,"cool":0},"tPijc7ksn1rhmX_6KZLm-Q":{"text":"My husband and I just happened to be walking past the store and wandered inside to see a c","useful":0,"cool":0},"qJTU8I093MMJ_KPaUTLu-g":{"text":"Took a demo class w Chef Kevin and have to say, it was one of the funnest things I did in ","useful":5,"cool":3},"Vuixly-4rlQPZU1soL-qcA":{"text":"Came here for the cooking class demo and the place was packed so sign up early.  The forma","useful":1,"cool":1},"WUXc396OIbejjz2ufxPJ_A":{"text":"My wife and I attended a 2 pm Saturday demonstration by Gumbo Marie.  She showed the group","useful":0,"cool":0},"oBBzK0on5rpaGQpLbHn9TQ":{"text":"I took part in the hands-on cooking class with a friend on a weekend. The experience is ta","useful":0,"cool":0},"U5XnvHmUyzkU_gf1LJwn1g":{"text":"We had so much funny watching the demo and eating the results!  Next time we will do the c","useful":0,"cool":0},"OovOBO280aWYswBx_I1c_A":{"text":"One of the funnest things to do in NOLA. Have made the pralines several times and they are","useful":0,"cool":0},"ZknY6bG1M6b-ps6ia9WSZg":{"text":"We had two teens in our party who thought this was a fun afternoon. (Go ahead and read int","useful":0,"cool":0},"VFKA0M6OGQ7oZI0_NmvYXA":{"text":"There were 5 of us attending over Labor Day. It was wonderful. Very good information and r","useful":0,"cool":0},"u2F-uyezhdaVSQF1QT_qiw":{"text":"Very fun. They started with a very interesting history of food and New Orleans. Then we go","useful":0,"cool":0},"UIGWpWU9KjPD5SpJOF3RMA":{"text":"My husband and I had a great lesson with Chef Brandon today.   We learned how to make Crab","useful":0,"cool":1},"ch4FcItS2FXWQfvWk2dWBg":{"text":"My first time to Nola and I'm so glad I came here. The chef was very informative, entertai","useful":2,"cool":0},"zaBu_CbTLv6Sf0hQamaUSQ":{"text":"I had taken a demonstration class in 2005 on a visit to New Orleans and remembered it as s","useful":0,"cool":0},"QhtSRAUncvMCNsfZPhpBCg":{"text":"Lately when going to new places we've taking cooking classes to immerse ourselves in the l","useful":0,"cool":0},"i0MUpXrYZWveuchJ9EC-MQ":{"text":"I participated in a hands on cooking class where we learned to make crepes for Bananas Fos","useful":0,"cool":0},"TtIrSRm_j4pIZCXzralTgg":{"text":"This was so much fun.  My wife and I learned to make jambalaya, gumbo, and bananas foster.","useful":0,"cool":0},"4omy_xWQ935Ff2vLZxjsyw":{"text":"We purchased the Go City pass and was very interested in the cooking class demo. We typica","useful":0,"cool":0},"7_lLfE5AIkmp3jsI_lYhPA":{"text":"We did the demo with Cindy. She is an amazing storyteller and gave lots of great tips for ","useful":0,"cool":0},"C04RTJxBOeGPaA5c8zM91A":{"text":"My mom and I signed up for the demonstration cooking class with Cindy as our chef. It was ","useful":0,"cool":0},"8c3aLAl1oRqhkx2WyugQlQ":{"text":"My daughter and I did the hands on class here and it was fantastic.  It was super organize","useful":0,"cool":0},"J9bBNPHDlSGkLcFKTTj0cQ":{"text":"The best thing to do in New Orleans!!!!! Chef Michael made the difference!!!!! \nWhat a exc","useful":1,"cool":0},"l4s3zIXaq-rIfnuSIEhrdg":{"text":"100% a must do while in NOLA. It might seem touristy, but i am so happy i did this with my","useful":3,"cool":3},"WwxJM9SQdRMausB-AWQpjQ":{"text":"I had a FANTASTIC experience at NOSOC! Our instructor Chef Matt was awesome and truly gave","useful":3,"cool":2},"lusKEsVPvUESIbKlPrccMg":{"text":"Emely ( our chef) was great.  She walked us through each course making sure that it all tu","useful":0,"cool":0},"9YPoju9pLE6mVelry_u4Bg":{"text":"Our son attends Tulane and I am obsessed with New Orlean's cuisine. I had the opportunity ","useful":2,"cool":0},"52lt4uucQfoPWBC2Xao09Q":{"text":"Add this to your list of things to do when visiting NOLA. It was only $32 and it's worth t","useful":2,"cool":2},"kqXtNm2wABQlK9_aufHoAg":{"text":"I came here for a cooking demo and had an amazing time. You are seated at large round tabl","useful":0,"cool":1},"_50B9emrFx-MAlPRH3dzfw":{"text":"This was a great class. Very informative, the instructor was enthusiastic, and the food wa","useful":0,"cool":0},"OkIUqGjtU8rXD6o0DELFCQ":{"text":"The best way to sum up this place of business is an entertaining-educating-sit-down-style-","useful":0,"cool":0},"rutfYopBb4gHKocCRkICFQ":{"text":"Well this was a part of my birthday gift. I love cooking so I do wish hubby picked the han","useful":2,"cool":3},"nCvDuZgKWztTvAswD5dPkw":{"text":"Had an unforgettable experience taking the demo class to learn how to make some absolutely","useful":0,"cool":0},"2RRAh_N91lDldO1hMrHBHQ":{"text":"My Goodness this experience was amazing!!! My boyfriend and I recently moved to New Orlean","useful":0,"cool":0},"cuF9YYdBl02uH4sXB0IhQA":{"text":"I had such a great experience here. I like to cook at home and was iffy on taking this cla","useful":1,"cool":0},"eGXEfDLJZsX9Eh2dQ0gL4Q":{"text":"What a fun experience!!!  \nOur group arrived a bit late due to traffic, but so did everyon","useful":0,"cool":0},"IhIbjVa4KSw8Z-nvN-N1hA":{"text":"Myself and a group of 3 others took the demo class with Vivian and it by far the best deci","useful":0,"cool":0},"nte4r2XOEByXHtiJWvJSFw":{"text":"Don't let them trick you. Beer isn't served until an hour into the class after Pat gives y","useful":2,"cool":0},"5JNT8Z2Rp8sJ9OdQby5VGg":{"text":"My sister always pick things for us to do even in our great city of New Orleans. We decide","useful":0,"cool":0},"GMd5No3zRu0ewXRli0AIDg":{"text":"I took my girlfriend here as a birthday present (plus, she needs to learn how to cook more","useful":1,"cool":0},"n4-fov5skG9Ybky-wLOSSA":{"text":"If you are looking for one of those hands on cooking class this is not it. Think of it as ","useful":4,"cool":6},"KqwW9FNB8aagWu_8e2Rz8g":{"text":"My group of 25 had an excellent experience here with our chef, Ed! He spent time educating","useful":1,"cool":0},"R3BVDzWvJQFVLVnD9z79gg":{"text":"We did the hands on class and had so much fun. Rene' led the class and gave us a history o","useful":0,"cool":0},"otekmAqGJoWIgEiJGHmePw":{"text":"We came just to the store to get some authentic seasonings and to just check the place out","useful":0,"cool":0},"JxGtNOitliU3lXsGJycy0Q":{"text":"New Orleans School of Cooking was really fun!\nK and I signed up for a demo class. The demo","useful":14,"cool":13},"F2NtbvOU5FC1p9UTKFMl0w":{"text":"The review is not for a cooking class but for the pralines that they sell. I stumbled acro","useful":1,"cool":0},"63AdbHIRE1kIsXwEhrZccw":{"text":"My second visit to the cooking school and it was just as good as three years ago.  We had ","useful":0,"cool":0},"swLGZGnDGUVQwm7LFyeBgA":{"text":"We had a great time learning to cook with the chefs here! I was afraid it would be a bit o","useful":0,"cool":0},"NUtO-sz-fwjV2VmaGYgViA":{"text":"We try to make New Orleans School of Cooking hands on classes a part of every trip to The ","useful":0,"cool":0},"A-d8Oue1PctxyPBUwXVLrg":{"text":"Our class here was a blast! We did the cooking demonstration - so we were sat at tables an","useful":1,"cool":0},"Pyjpc3Tc6Hd8Uhxy2HqF5w":{"text":"Great experience! We were entertained while learning to cook and eat! They have morning an","useful":0,"cool":0},"C9pCPPSfc9DAWrpgX5yzWQ":{"text":"Totally my all time favorite experience in New Orleans! \n\nI visited the New Orleans School","useful":0,"cool":0},"apATrISu4yrZADMS5gG-2w":{"text":"Great cooking experience!  Absolutely the most memorable thing to do in the French quarter","useful":0,"cool":0},"63WwVwLTw03mPzBb-engiQ":{"text":"Happy birthday to me. I received the hands-on version as a gift. Save yourself time and mo","useful":1,"cool":1},"kU-jYVzLCLiWK8SsZzqniA":{"text":"This was my favorite thing that I did in New Orleans and I think anyone who has a penchant","useful":4,"cool":4},"Qtlk6itpGiAi-jhIoxOa3Q":{"text":"I stopped by on Monday (July 23) to inquire about the times, cost and what to expect from ","useful":66,"cool":60},"S0_SL3zAKfVpLMiSeEoreQ":{"text":"I walked in the store and watched the praline being made, he smell and taste was from heav","useful":2,"cool":1},"u-VqTT79RVRebukgC5gpeA":{"text":"This was so much fun! And delicious!\n\nNine of us came to spend a morning learning how to m","useful":1,"cool":0},"ahaBRsRkVvgzsAgZTVCrfQ":{"text":"Cooking class was great! We did mini crawfish pies, seafood gumbo, crepes and bananas fost","useful":0,"cool":0},"Uy-J34U2WzVkrbmGgF1xWg":{"text":"Phenomenal. Great food (get seconds), great deal. Entertaining place do drink some Dixie a","useful":0,"cool":0},"Snm3Cc247GjKfWcwMd_3bg":{"text":"The entire staff, from the folks in the shop to the chefs in the kitchen, make you feel at","useful":1,"cool":1},"79zOkjJMR8iTWTEi7TUFaA":{"text":"A fantastic experience!  Chef Renee taught us how to make gumbo, jambalaya, strawberry & w","useful":0,"cool":0},"KOL9v-iUlnSUmyabbVj2cg":{"text":"Along with the WWII Museum and French Quarter, this is another MUST DO when in New Orleans","useful":0,"cool":0},"XIIfGolU6G-67S5XRNcI2g":{"text":"Really nothing short of five stars. Cant speak for the rest of the Chefs, but try to get i","useful":10,"cool":9},"ORKBzE6RqS1XcfU85O9q8w":{"text":"WORTH EVERY PENNY...\nIf you don't waste your money on an $81 Natchez dinner cruise (god ho","useful":9,"cool":8},"W0LSt7vXuOjiFmozMPyP4Q":{"text":"This was my first time attending a cooking demonstration. I cannot wait to go back. We rec","useful":0,"cool":0},"Ing1AEAm2_NmRx4nnZW2AA":{"text":"We had a great time celebrating our visit to New Orleans and trying some authentic dishes!","useful":0,"cool":1},"sdlTrCzY5wq_G6hzowmJ9w":{"text":"One of my favorite experiences while visiting NOLA. Located in the French Quarter, known f","useful":1,"cool":0},"8_GzGAK20kfgWwO-68Sv3w":{"text":"We participated in a demo class. We learned Gumbo, Jambalaya, White Chocolate Cranberry Br","useful":0,"cool":0},"zGNRrmUpuHWXYH93-3RsHQ":{"text":"This will probably end up being the highlight of my trip to NOLA. My gf was running the ha","useful":5,"cool":3},"OK_EVmwaQDQ1ovmpp7zXwg":{"text":"Chef Ricardo lead our session. First a history of NO and Cajun and Creole cooking. Next we","useful":0,"cool":0},"735W3P4i5nO1LhLMsMrCGQ":{"text":"SWEET BABY JESUS. Yes, that's how I just started this review. This place is legit one of m","useful":4,"cool":1},"X05CuTuHzX0nxQy2UtfLHw":{"text":"This ended up being one of our favorite things we did in New Orleans. The chef was friendl","useful":0,"cool":2},"HZqRItIbzBbqJfLBDKQyPQ":{"text":"So I was initially interested in taking a cooking class here but after reading that you ha","useful":3,"cool":3},"s81hIL8NJ9QtWkko-dFg8w":{"text":"We had a great 3rd cooking class!\n\nEach instructor is different. If you've done it once, d","useful":2,"cool":1},"qHQBUZ0WkfCpcHSMAXnWuQ":{"text":"Our instructor Anne taught us how to cook the dishes, but she also gave us a lot of the hi","useful":1,"cool":1},"KK8EC_9iD5aksW5H2R275w":{"text":"Awesome cooking class. Great instructor with many cool stories about the history of creole","useful":0,"cool":0},"tsIozHXY6WTM0iMJXwEB4Q":{"text":"I was initially torn between signing up for the cooking demonstration vs doing the actual ","useful":0,"cool":0},"JN3qXQdESvMic1veh1AIwA":{"text":"My stepson and I took a class and we enjoyed  every minute there. Big Kevin Belton is a hu","useful":0,"cool":0},"mChovrmf8xEn92KeEa04hg":{"text":"Harriet was an incredible instructor!!!  We did the demonstration class on how to make Jam","useful":0,"cool":0},"Iq2a2V0CGliNNCTW8PVjlw":{"text":"Anyone that's been to New Orleans knows that there are so many things to do it is nearly i","useful":7,"cool":1},"r-J2J79ieXDMBkKSYzoEiQ":{"text":"The rest of my party really wanted to do the demonstration class, so I went along with it.","useful":0,"cool":0},"KeV8XAn3FrXBHYXzVqDBaA":{"text":"This place is awesome !! Instructor Tom was so pleasant and helpful.\n\nI came here with my ","useful":1,"cool":1},"lX-sU4viUJvaUm_AYauJiw":{"text":"This is a must-do if you're visiting New Orleans. So many of the reviewers did the private","useful":1,"cool":0},"2NFTMx0dX3XO_p9MMqWbpQ":{"text":"Chef Michael was very friendly and made the experience feel like you were at a friend's ho","useful":6,"cool":3},"GyF-ZxamocTMj79hnA7Mcg":{"text":"I came in for a cooking class to learn how to make a few traditional dishes. The chef teac","useful":1,"cool":0},"590tYNLHl42xIC67h6dtEw":{"text":"We were really excited to do this after walking by and seeing it. It turned out to basical","useful":0,"cool":0},"NWA3N3uq4WKd8x9-LCgRbw":{"text":"Emily was amazing! She was patient, intelligent, knowledgeable, and hilarious. We had so m","useful":0,"cool":0},"in_D05nW8KaDtkG4-WXaLA":{"text":"What a wonderful night! We were spending the holiday week in town and found the cooking sc","useful":1,"cool":0},"GvxsEx4sxJHQTfpNS1-KHw":{"text":"This was my second visit (last time was a few years ago) and I had so much fun. I adamantl","useful":5,"cool":3},"SMMUPY6-6M28V3QXr-6hVw":{"text":"Great food, Great time, Great Chef. If you ask if I had a great time Doc the answer is Yes","useful":0,"cool":0},"IBfm6Lr6z8BMB8xjOuUhiQ":{"text":"This was so fun!\nMy friends booked this for me as a surprise while we were out here and it","useful":2,"cool":2},"iwKAsDt8PiTFjc_cDTXkPw":{"text":"Awesome experience.  Rene was fabulous.  Highly recommended.  Great food and fun.  I would","useful":0,"cool":0},"K7ShXY5G8eCYxEuTMnBhHg":{"text":"My wife and I scheduled the hands on class for our tenth anniversary. We had a ball. Even ","useful":1,"cool":0},"Lp2o0MUMERaweifwDHGrvQ":{"text":"The best 25 bucks you will spend in NOLA.\n\nA bit touristy, but well worth your time.   Adv","useful":7,"cool":2},"ahXMf4pMdFpgxSsFX4mjjg":{"text":"What a delightful way to spend 3 hours. For $27 you attend a 2 hour cooking demonstration,","useful":1,"cool":2},"PZ7_qjEhhT0Cz5CflVk6ow":{"text":"Chef Anne was awesome! She taught us how to cook a southern meal, shared Louisiana history","useful":0,"cool":0},"Xd8rwtVnYgZ2d2uEg76zqQ":{"text":"My group of people thoroughly enjoyed this N.O. experience. We had a blast. I have to say ","useful":1,"cool":0},"uTl88BGOH9hQ0xrRopwyBw":{"text":"Harriet was our \"leader\" and made the experience a treat.  Even though I consider myself a","useful":1,"cool":1},"v3Xpja_8P1d4az6MkJ3mPg":{"text":"This was such a fun daytime activity in New Orleans!\n\nThe School has several class options","useful":3,"cool":0},"1qyr_3gIO8upE8hRDUAJpw":{"text":"We stopped in after lunch right before we hit the road because Tesha had to have some more","useful":9,"cool":13},"KVqCt13N0jhCHdxnZK1sSg":{"text":"My girlfriend & I attended a class on NYE with Chef Kevin. It was a memorable experience b","useful":1,"cool":0},"iOmoQEILiDZtXMjb_wZVRg":{"text":"A friend and I recently attended a Hands-On cooking class with Chef Eric and his assistant","useful":0,"cool":0},"Nt9y9kOUjoQC5kqzXp8w4w":{"text":"This has to be on top 10 things to do when in NOLA! It was delicious, funny, and filling. ","useful":1,"cool":1},"JdpOLfZXNRQyspIeaK8dBg":{"text":"When I was in New Orleans I fell in love with the delicious food, and I wanted to learn ho","useful":3,"cool":1},"THxiYfA4eRBQH_d9_Lg2Ng":{"text":"This place is fun we took a large group and had Ann as our cook/history teacher. Very enjo","useful":0,"cool":1},"bmDHw0IDn1wXLhtbheW5og":{"text":"Oh boy, I really hate to write this review. I first visited the New Orleans School of Cook","useful":7,"cool":0},"znHHVuDGnjQ5e9Bk4gLFVQ":{"text":"Wow! What an experience!  Top notch date idea for anyone looking to do something a little ","useful":0,"cool":0},"5oiviBpBy-prlFufuACX4g":{"text":"This was a highlight of our recent jaunt to New Orleans! With rainy weather in the forecas","useful":1,"cool":0},"xbFabrqFzuFsCzfmZC6jJg":{"text":"Very good classes and recipes. Have returned multiple times for various classes and aleays","useful":0,"cool":0},"6byb23bDcYHqN2E4uZwFMQ":{"text":"Wow! This experience was awesome! Brandon is a fantastic teacher! I learned a lot and the ","useful":8,"cool":5}}