{"NKkwHcgpSFTLueUqSY9NKg":{"text":"First time in NOLA, and all I have to say is this place from the outside does NOT do its f","useful":2,"cool":1},"h8IcA3gqz7974cpfPuawcg":{"text":"Pretty good. Much more expensive than other restaurants in the area, no drink specials or ","useful":0,"cool":0},"sSKfAjsybplpzx3J88WJPA":{"text":"Good food, generous portions. The Crawfish Poutine \"appetizer\" is delicious and enough for","useful":0,"cool":0},"47UQSILameqLVFO4qST52w":{"text":"Best shrimp and grits i've ever had. will definitely recommend and will return. staff was ","useful":0,"cool":0},"l8Ce0bvoJLoc4bPOYdBQ6w":{"text":"This is a hidden gem. We wanted to stop someplace and have cocktails on a rooftop patio. W","useful":0,"cool":0},"vbhUCuDvYxrtnF-eZ9cjpg":{"text":"Really great local flavor grub. Good local beer and a fantastic staff. Juan knows how to s","useful":0,"cool":1},"SHzWwywYjB7xg_Jc_jlzEQ":{"text":"Wow this place was amazing! First time in New Orleans and was looking for a good seafood m","useful":0,"cool":0},"AgttpFlcuTNwZvdaZKSwDw":{"text":"Excellent sea food! Our server (Huey) was great. We had a taste of everything (large party","useful":0,"cool":0},"SIENMK-7Gr_uyQDi2oiZPQ":{"text":"The food came out pretty fast and the service was amazing. We asked out waitress for foods","useful":0,"cool":1},"XcQ3MSA1nAC8kaiSBMMjNQ":{"text":"Server Sarah was good. The food is overpriced, but better than you might expect on Bourbon","useful":0,"cool":0},"Vz1jApMt_13IwPFid6YBNw":{"text":"Great food-crab cake pasta to die for. Jambalaya gumbo great as well, good attentive servi","useful":0,"cool":0},"z8tq6zMz2o8UI_sAbL5kow":{"text":"OMG best food of our trip in New Orleans! \nI had the Blackened Shrimp Alfredo that our ser","useful":0,"cool":0},"iqRdDBnm99zD8i48kyn7qQ":{"text":"So first of all, check in when you get there. You'll get freebies for your first check in.","useful":0,"cool":0},"MiTRCKAXI5dDe4ZbkGQoHw":{"text":"Stopped in for a sandwich, got a lot more! Friendly staff helped me figure out my touristy","useful":0,"cool":0},"hp61f2mWGoemiRu4b7sgEA":{"text":"Great food and great service. Even with the COVID crap going on. Lovell recommended an inc","useful":0,"cool":0},"ySZyXa6Rk-i97CEV6lrMPA":{"text":"Very nice place with wonderful people. We had our dog with us so they took us to the court","useful":0,"cool":0},"wcl7mOYfWScyoCqCrXqYIg":{"text":"The seafood a service were great ! My favorite part of the meal were the oysters ! My only","useful":0,"cool":0},"j_SUe1ZO1qf3cu2tGJrSaA":{"text":"I stopped by this restaurant and wanted something to eat. I ordered the gator bites, half ","useful":2,"cool":0},"MdOOVwUjVPVwLWQGbPNBQg":{"text":"If you're looking for authentic New Orleans food then this is the place to go. The food wa","useful":0,"cool":0},"6OvlJ2MKrJ7sGKouLwyrFg":{"text":"Food service excellent. Being able to eat on Bourbon Street a plus. I was impressed by the","useful":0,"cool":0},"KKCxGh1hO5S4OsiXa-soJA":{"text":"Best food in the entire city!\nRoof top is very nice, inside is nice, great place. Food was","useful":0,"cool":0},"fGhJsFhOniKCwCqX519tBw":{"text":"In a sea of restaurants located on Bourbon street ,Thos place was recommended by a local r","useful":0,"cool":0},"ZGsVixPqbX7YF0jGDueQ-Q":{"text":"Mambo's got the spot after walking and partying through crowded Bourbon street. I enjoyed ","useful":0,"cool":0},"fqsBOmtevJVnCr37qsQ2Cg":{"text":"The food was great and Juan at the 2nd floor bar was super cool. We were originally waitin","useful":0,"cool":0},"IrCxUWnqfLE5Fv6NoaVDPg":{"text":"First and foremost. The garlic bread is phenomenal! We were able to get a table the night ","useful":1,"cool":1},"XnIyVNATAyX7bcfFw5s4eQ":{"text":"We stopped in for a late lunch/early dinner. Got a table quickly and ordered right away. H","useful":0,"cool":0},"HNA7STT0OgCFUz49buQQsQ":{"text":"Don't let the location fool you - the second floor of this place is very nice - a quiet br","useful":0,"cool":0},"IAgZY-vPoGFkbcYpkAwYqA":{"text":"Good service, decent food on bourbon street. I had the red fish and po boy both of which y","useful":0,"cool":0},"DQh98bbwoJppRjJEy9bu3Q":{"text":"Great place! We came here earlier this week for lunch an has a Great time so we decided to","useful":0,"cool":0},"FsEZq3ctZilpxKCHt62Gbw":{"text":"Horrible horrible experience and I didn't even started eaten as yet. I ordered a sprite an","useful":0,"cool":0},"hpZVCRmYCsKLkJHNmPxBzQ":{"text":"Best food we have had in NOLA during our week long trip here. I made it my personal missio","useful":0,"cool":0},"NCFo4Iii-TST8umaqhi1sg":{"text":"Got into town on a Friday and left on a Monday. I spent Friday, Saturday, and Sunday at th","useful":0,"cool":0},"EhIxnDhe_syBvxqx8KjGYw":{"text":"Was here for my sisters' birthday and we decided this was the spot because of all the fabu","useful":2,"cool":2},"xo1XjZnppPZrlsK0ALKUSw":{"text":"It's so cold in here, and they will not accomodate. Food was marginal for New Orleans styl","useful":0,"cool":0},"IJZSl8wY1egv_i3aVMXd4w":{"text":"Amazing food, drinks, and service! A must when in New Orleans! I had the Gumbo, blackened ","useful":0,"cool":0},"SRFEbDUdN2vz5KNyc-d-aQ":{"text":"Awesome roof top seating. Everyone was very friendly and knowledgeable about the menu. Foo","useful":0,"cool":0},"1TV5oIvxzi-TKcosZ_WXbA":{"text":"Me and my group were walking by and didnt want to go anywhere crowded. Best choice we made","useful":0,"cool":0},"pAEVgd_zr5oJC5yduCQeIQ":{"text":"Great food and great drinks! Ask for Glenn!!! He's going to recommend the best and breakdo","useful":0,"cool":0},"xZeO9N3aoH3O-v9ewZs9ag":{"text":"First time in New Orleans and this was the first place that popped up as we were leaving o","useful":0,"cool":0},"bi9uVsA6s1vV8mkRq72g1A":{"text":"A personable guy at the door practically lured my friends in with the promise of alligator","useful":0,"cool":0},"jxH20b37QSApnk7brYIpXQ":{"text":"Excellent food! Do not leave without trying the bread pudding, it is absolute money!!! Adr","useful":0,"cool":0},"SKSG92rORzwDLYVYw3vChw":{"text":"Came here on a cold night and it was too cold in here for my liking-but I do see that abso","useful":0,"cool":0},"5iltHEMsq05rSl7TFR7tEg":{"text":"Highly enjoyed our meal.  The shrimp and grits was great and very flavorful.  The shrimp w","useful":0,"cool":0},"3j8tqJ3yDvDRyjy8V331aQ":{"text":"I ordered the bbq shrimp appetize and ceaser salad, perfect for one person...whitney was A","useful":0,"cool":0},"UaLeXixoaRI6iUXYzfraKg":{"text":"For this being a restaurant on Bourbon, I was pleasantly surprised! The food was so good, ","useful":0,"cool":0},"5uQ0q0w22rS2sy2UoKWvjg":{"text":"The food is delicious! Dining on the upstairs balcony was great! I definitely recommend th","useful":0,"cool":0},"JIjEv2LDX2onvRxSjHyvyA":{"text":"Felicia deserves the 5 stars. She is kind, friendly, and gave great recommendations. The f","useful":0,"cool":0},"1oNAfVyzSo0F7LqIabTbIw":{"text":"This spot is right on bourbon street and a block from our hotel which was a win. I stumble","useful":1,"cool":2},"o2kAy3HC7jLJXEc9ngZ6Yg":{"text":"It's definitely a hole in the wall & for being on Bourbon Street the pours are stingy.  HO","useful":0,"cool":0},"IHqhPcF1EUnOwAhbI-JQEg":{"text":"Mambos was an awesome experience.  We were on the 3rd level dining.  Our waitress was Patr","useful":0,"cool":0},"dbzssDgcrpTutnnrSGv8ig":{"text":"Food was pretty good. The oysters had way to many shell pieces when you ate them grilled. ","useful":0,"cool":0},"57dInchW32VTQaVcB7lspQ":{"text":"Food was fabulous! We had blackened alligator, mambos oysters, and the vegetarian pasta (a","useful":1,"cool":0},"27o_19SsR5V-BiLKWsuEuA":{"text":"I don't recommend delivery. The portions of my $24 Cajun Jambalaya Pasta isn't very fulfil","useful":0,"cool":0},"WGEQ4oUOy6PBuxQZjRVevQ":{"text":"Great experience at Mambo! The food was great. We had the seafood platter and the ribeye s","useful":0,"cool":0},"hXGol_GsZi020o1IjNUOyA":{"text":"Food was ok. Pretty expensive for what you get. Rice and beans for $19.99 is a lot to me b","useful":0,"cool":0},"Ub1caHaNPJkkp71cZQLW_w":{"text":"Literally one of the best roof top experiences I've had and this is coming from nyc and ho","useful":0,"cool":0},"yAsPAsNpE_kkKAMQzSON8Q":{"text":"Decided to stop here since we are visiting from Long Beach, CA. Service was amazing thanks","useful":0,"cool":0},"gn5Y1Uy4B1WjB_8ST4agvQ":{"text":"Patricia is the BEST!! I'm from Maryland and she was very helpful with places to see. Love","useful":0,"cool":0},"GZPb0pTRc8ps90l53rTEHQ":{"text":"Excellent customer service! Our server Ashley was so sweet and made us feel right at home!","useful":0,"cool":0},"sztRyfa7x4WKiQz3ckowUg":{"text":"This was my favorite place to eat in New Orleans. I loved the decor. We had alligator for ","useful":1,"cool":0},"t_nhQNFlweFs3Hcxvx9CMA":{"text":"The staff is top notch!  The atmosphere is wonderful. The food is good. The management is ","useful":0,"cool":0},"lwq7QpZlCKycEM4WTVtZkA":{"text":"\"Alligator po-boy was slammi\".\n\"Shrimp Alfredo \"best i ever had\".\n\"Whitney great server\".\n","useful":0,"cool":0},"UOH2loXiYlzuNPW-MJo2Ew":{"text":"This food was excellent!! As a tourist, I was looking for New Orleans style seafood and th","useful":0,"cool":0},"y9y16E1l1WRiPpLec0q3dw":{"text":"The Oysters here are quite nice.  We liked the way it was prepared. NoLa special.  We are ","useful":0,"cool":0},"1f7TB0RYrHkcFQ5oNoJr3A":{"text":"Great service and staff! Came here on a Friday night with no wait after walk down Bourbon ","useful":0,"cool":0},"gYX6kZH38ryM4BueILu4HQ":{"text":"Had the carnival pasta. Simply delicious and was delivered hot and fast. I would eat here","useful":0,"cool":0},"fLp79M8jt8YO1VlC1m-x2A":{"text":"Excellent-food, prices, customer service, ambience and music is the best!!! Clean, extreme","useful":0,"cool":0},"29bWmTRl42Qi0UPt4tkTJg":{"text":"Definitely hit this place up it is amazing. They have a rooftop where you can eat and look","useful":0,"cool":0},"NwiMExBV1R-SQXLRf8oBMQ":{"text":"Makay was amazing.  She makes the best drinks and her personality is like no other.  Yall ","useful":0,"cool":0},"qAUXPSOZiAJFkKD--feWgg":{"text":"Hidden jewel on Bourbon Street. Great food, great Service, and clean establishment. Redfis","useful":0,"cool":0},"_F3MWdKd6s26-kRrNQEAaA":{"text":"These Mambos World Famous charbroiled oysters have ruined my life, I have never had such t","useful":0,"cool":0},"_Vu7NLXh4n1foqT70YwF6Q":{"text":"We were looking for some late night good food in our trip to NOLA. We were looking for goo","useful":0,"cool":0},"n1xQ2QK-47vBJX3hajhxHg":{"text":"This was exactly what I was looking for in New Orleans. Casual and delicious! We loved all","useful":0,"cool":0},"QsUOqMV9M9kVSP3PlhX43Q":{"text":"First off, our sever Brian is amazinggg. 10/10 recommend him. He helped us pick our food, ","useful":0,"cool":0},"BhRXdAEENluU_14t6lgmrQ":{"text":"We got in line at 430pm on a Saturday afternoon. The hostess seated us as quickly as possi","useful":0,"cool":0},"0583TPRnIvZ33wnHrvYnLA":{"text":"Was cool.  Food was alright... not bad.  Laura was awesome at the bar upstairs.  Not bad f","useful":0,"cool":0},"q9j5eNzhAtQ_OPaXmM1yOA":{"text":"We stopped in for dinner just days after they opened.  Service was great, food was amazing","useful":1,"cool":1},"TMs5NIC97BaZzv89yJa_yQ":{"text":"Great food.  Our server Briana was great. \nThe fried fish platter was a large portion. The","useful":0,"cool":0},"HgwJ4AUkFend6fsaNqXN4Q":{"text":"Great food! Great service! Bree was a wonderful waitress. And the bread pudding was to die","useful":0,"cool":0},"JkNTWRO9U5mS3CZJbsBSFA":{"text":"We had a wonderful time last night, food was great, atmosphere really nice and the service","useful":0,"cool":0},"yNBi7Sh0eCe15JthNQnODg":{"text":"Food was absolutely amazing. The oysters are so delicious and cooked in a Cajun southern s","useful":0,"cool":0},"R-O5vU1LirhyMgYD2_R6gg":{"text":"If I could give them 100 stars, I would. Good food and the staff here are SO friendly. We ","useful":0,"cool":0},"96RvivQ6ueUXmK681gfDAA":{"text":"BBQ shrimp was a bit too oily. Blackened fish po boy was amazing. Well cooked and flavorfu","useful":1,"cool":1},"sHAF-gD_i5sU6GRgnAq4yA":{"text":"Idk why my original review isn't a five hahah that's clearly what I meant to leave lol","useful":0,"cool":0},"TsbH0oIR67TXr3ImMAnO5w":{"text":"Came here because we heard there was a rooftop bar. We had to take an elevator upstairs to","useful":0,"cool":0},"dblynhXmi6f9npHosnnwVw":{"text":"I love pasta !! And Alfredo is my favorite. If you're like me. Chicken Alfredo is where it","useful":0,"cool":0},"4OabKFn--CvOjYk7UthwEA":{"text":"This was the first resturant we went to. The service was really good, and the food taste f","useful":1,"cool":0},"oCmmCDcwHPGd98MpqQu4Fg":{"text":"The wait in line wasn't too bad, but didn't like the fact that the young man at the door w","useful":0,"cool":0},"NzXSfJgK9tPhiLA4-XAj7g":{"text":"Great food-crab cake pasta to die for. Jambalaya gumbo great as well, good attentive servi","useful":0,"cool":0},"mddCwN8FPEgI_9zFlYXoMg":{"text":"We loved the atmosphere and the food was great! Service was slow, but no big complaints he","useful":1,"cool":0},"NN-Tkuub1GTN7mGZeenhJA":{"text":"FANTASTIC food and service! Christina was a wonderful waitress and, because we are so inde","useful":0,"cool":0},"WCDY6W5OhwfybqoH0gzYfQ":{"text":"Great taste and good service.  Huey, our server was very friendly and accommodating. My hu","useful":0,"cool":0},"grju4xpUL4asoEumaum-Vw":{"text":"SCAM!!!! Worst experience I've ever had. Being a local you know what fresh shucked oysters","useful":0,"cool":0},"1WnC29PtKiH7LYNoFcL_Sw":{"text":"Giving this establishment a 2 for two failed attempts of bringing fresh crackers to the ta","useful":0,"cool":0},"yXz6pQ1ckLS3wyp0a2rKAQ":{"text":"Great rooftop view, service, Creole/Cajun dishes and very clean and neat establishment! Wi","useful":0,"cool":0},"omzPLq1COVMdu1RBccRy-Q":{"text":"This was my 1st visit. The service was quick, friendly personal. Unfortunately the food wa","useful":4,"cool":0},"KBN9cqnUprk5AGQajzg98A":{"text":"Food was decent and kind service but my waitress may have been drunk and a bit all over th","useful":0,"cool":0},"kJStuJ2k8REAC3dmDTOb1w":{"text":"For our first night in New Orleans this was a great first stop. Ky was an amazing server. ","useful":0,"cool":0},"ZtnDGMz6WIOvcTp2HuqNbw":{"text":"We have had dinner here two nights in a row. Great Food Even Better Service!!!  Give it a ","useful":0,"cool":0},"LgiWw6gDpfP-OiBe0ESZvA":{"text":"Found this place on yelp . This is my 2nd day here and the best place I've eaten at so far","useful":0,"cool":0},"CfjLEWn6yo1stmhJJw_t6A":{"text":"Best meal after spending a few days in NOLA. Ordered the blackened fish po-boy,. Bread was","useful":0,"cool":0},"f2uto0LLxHGHBfL6rbiNJw":{"text":"Food was great. Staff was awesome. Me and my friends enjoyed our meals. The greens were th","useful":0,"cool":0},"Gq_cjaFvZxlyAUO5_4JNSQ":{"text":"First stop in NOLA & Ponce made it amazing! he was the sweetest, best waiter ever! gave gr","useful":0,"cool":0},"sjO89x-7kPpZeCwSHBL4RA":{"text":"Once we arrived we were given a choice to sit inside, or go to the rooftop. Upon my arriva","useful":0,"cool":0},"zelNu6g-k9jWhq4APCh08g":{"text":"We went during happy hour, $1 oysters and half off draft beers! We had IPA's and ate a too","useful":0,"cool":0},"95ghx5sQledcN5Df6Y1Uzw":{"text":"Stopped in for a quick appetizer. First time to Louisiana. Fresh oysters were good here. O","useful":0,"cool":0},"THB0LMHbPFmA8626NPEGrg":{"text":"The mambo oysters and crab cakes were delicious. The Taste of New Orleans was really, real","useful":1,"cool":0},"GQ9abTqBCKgMOGvqAeBNYg":{"text":"I had already eaten at 13 places in two days at this point, but \"one last stroll down Bour","useful":0,"cool":0},"LGVJ90VMRLY2fws4xVku7Q":{"text":"Good spot on Bourbon Street for a drink! We enjoyed the rooftop area! Staff was very frien","useful":0,"cool":0},"ezXeDr9_foAN0N44Jujb8g":{"text":"My friends and I visited this location during Essence Fest. I had Jambalaya--and it was so","useful":0,"cool":0},"TERaclP5VgaSFrHnZuUS5g":{"text":"We had the alligator bites as an app and seafood platter for dinner...very delicious, not ","useful":0,"cool":0},"PSQee3EkfImWpddnB_S4Uw":{"text":"I ordered Tradition of New Orleans which was a trio of red beans and rice, crawfish etoufe","useful":1,"cool":1},"GaDxQFfkrJmjcfuJ5m4lGQ":{"text":"This place is very good & it most definitely would have gotten 5 stars but I had just one ","useful":0,"cool":0},"xrd35kIBYIN1EKLKmHeZsg":{"text":"Great food the gator nachos and oysters were phenomenal! Also Ponce was an amazing and kin","useful":0,"cool":0},"tYnhaUh-3DPnfN6YVjzDWg":{"text":"Christina was so nice!!! She saved me when I needed it the most and she's so nice!!! The f","useful":0,"cool":0},"JzWla1TIT38WHRYlpKru0g":{"text":"Server - Whitney\n\nService - Excellent\n\nPrice - $$\n\nSunday, January 5th, 2020 2pm\n\nTook a s","useful":0,"cool":0},"4OV54JUxD882GG7xQTt_yw":{"text":"The best service we've had in town. Daren was excessively fun. The other server next to us","useful":2,"cool":0},"OjvJVC7MqE2d6ks6klAMyA":{"text":"Steven is Your Go-to guy! Go visit mambos in NOLA. Great food and even better Service.","useful":0,"cool":0},"CcHl0FhxSHFoHtiRH6M4tw":{"text":"This was my favorite PO-Boy in all of New Orleans! I ordered the blackened aligator PO-Boy","useful":0,"cool":0},"6AUZr-IqiwpdXD7WKnvswA":{"text":"Walked in and was seated right away..ordered the drink special for the day, seafood platte","useful":0,"cool":0},"vIjcqKhM3s8I--uct97Hvg":{"text":"Fantastic time. Greta view from the rooftop bar. Every staff member made eye contact, than","useful":0,"cool":1},"K4mpDYtjWrX33Ma7gRyrug":{"text":"Good spot to enjoy drinks upstairs! Can't rate the downstairs, looks classy but didn't spe","useful":0,"cool":0},"OHLergKEJZc9Y-aRoZ5-lg":{"text":"We stopped at Mambo's for a later dinner despite the line didn't have to wait long to get ","useful":1,"cool":0},"PWQp5x4L9jRndIzxteORcQ":{"text":"We're in New Orleans for the week & had a hard time finding a place to eat late on a Monda","useful":0,"cool":0},"Ngn2baW5JbMrDY5LvZBQdQ":{"text":"Beyond happy with our experience at this restaurant. My boyfriend ordered the rib eye and ","useful":0,"cool":0},"LmMXb_walVFXPCzysrPX7Q":{"text":"Food and service was excellent.  Our server was Christina and she was able to change my pa","useful":0,"cool":0},"qJqx1ymYdFrhX-sAWJ2tWg":{"text":"Doorman Wellington was legit, great guy. Kind, courteous, and great recommendations for a ","useful":0,"cool":0},"AzuHITPqVT4oFtRPLLetIA":{"text":"Jessica, Tommy, and Jaun are amazing. Tommy drew us in as we working by and we had a great","useful":0,"cool":0},"P7X7y3IdHtLoZbNV_HOxaQ":{"text":"Was across the street... a man brought us over.... oysters on half shell- delish. Oysters ","useful":0,"cool":0},"YBZbFXgpT6_C4ggOwp9Wew":{"text":"I loved the oysters and the red fish was good as well. The drink I ordered was cool, somet","useful":0,"cool":0},"I4VM59u0qcqp6_SC02wRvw":{"text":"Isiah helped seat us and he was so nice, even suggested the gator nachos which were wonder","useful":0,"cool":0},"0oTC9ze75dgjrolDhHrPgg":{"text":"Food was fantastic! I got the chicken Alfredo and my boyfriend got tonight's special which","useful":0,"cool":0},"kU_qXyYMNvAsi4jsFKos4g":{"text":"Not only was the food spectacular, but our service from HUEY was every bit of amazing. He ","useful":1,"cool":0},"YXDCG935NeYEnXFekwUzrA":{"text":"I'm still in awe from the delicious oyster rockerfellers!\nWe waited in line on a Saturday ","useful":3,"cool":0},"IjobwUROoJolGQYMpXYTaQ":{"text":"Amazing food!!! And amazing service! Highly recommend the gator nachos best I've ever had ","useful":0,"cool":0},"WMMbPDT8fCETqSlcexnbug":{"text":"Great food and great service. Ponce was our server and he made great suggestions and was a","useful":0,"cool":0},"j3a4LuKUBcMtJiOp5LNXug":{"text":"I really liked the rooftop on this place. It's food was good as well. I had a fried chicke","useful":2,"cool":0},"BfsW1dcQLC5ALlXy3W7sHA":{"text":"Our first meal in New Orleans and it was a warm welcome to the city.  We had Whitney and W","useful":0,"cool":0},"cGkNk6Vo41fYufsrmyRdFQ":{"text":"This is a great place if you're looking for a great meal, good service, relaxed but not du","useful":0,"cool":0},"0Cts44vktCMud3KMdHHs7w":{"text":"This is my favorite restaurant on Bourbon! I enjoyed the food and the staff. If you're in ","useful":0,"cool":0},"yH4qn5Vm_SI-qM_-oS9F7w":{"text":"Over priced, food is over salted, the portion is only the thing under. I tried from appeti","useful":0,"cool":0},"jyM-S541sm2rkSWW-u0Z0g":{"text":"My wife and I decided to try this place out for lunch. We started off with drinks, and we ","useful":0,"cool":0},"BGt1sscJcfM6b6KuKUOuLw":{"text":"Food was great!! We had the jambalaya Cajun pasta and alligator po boy! Langston was an am","useful":0,"cool":0},"OZ9qEcYn7c9CbjMWSoqbgg":{"text":"Shortly after arriving in New Orleans for the very first time, we came here for dinner and","useful":4,"cool":2},"IE4_iIhtDRh-5LWwKKOVwQ":{"text":"The good and bad:\nI was so looking forward to visiting New Orleans and ordering one of my ","useful":0,"cool":1},"zLrzOa121Bz7Pk9Q7u9vAg":{"text":"Checked them out during happy hour. We were seated on the rooftop patio which has a cute v","useful":0,"cool":0},"WawiPjCM5jA4MyP2x9WRCA":{"text":"My wife and I come here pretty regularly and we always enjoy it :) Our server's name was j","useful":0,"cool":0},"wx7w-uTA-Dvw03UDsJzIbA":{"text":"This is so close to our hotel The Royal Sonesta and we didn't get in until late when a lot","useful":0,"cool":0},"X0uTJfHFOgK40fYfNuKXvw":{"text":"Mambo's was recommended to us by a waitress at another restaurant, she was not lying! This","useful":0,"cool":0},"SKtnrtg-JuQfhxTutLF8mg":{"text":"Mambo's  has great seafood, great oysters, great customer service, and a great bibe. I hig","useful":0,"cool":0},"f3HeW0C8VF28UPqhrvrJ-A":{"text":"Food was decent but nothing to brag about. I liked the balcony on the second floor. You ca","useful":0,"cool":0},"h-NYr1W7mZsLquI6RbbEKA":{"text":"This was the best meal we had all weekend. Hoshi was very helpful in our meal choices. The","useful":0,"cool":0},"5GIiA6qhAQn0ZfXwlzAUVg":{"text":"Mambo's is located conveniently on Bourbon Street. It's got delicious drinks, lots of appe","useful":0,"cool":1},"9-HtA1wuvQxhafvIy5vmiA":{"text":"Huey is awesome!!! Honestly the best food I have had in NOLA thus far. Here for a conferen","useful":0,"cool":0},"leChoE00erZkDALcnbgOyA":{"text":"Amazing! We had the crab cake entree and a good ole hamburger. From the drinks to the incr","useful":0,"cool":0},"u1d66xy9juHr4u4jitspsQ":{"text":"Service was great but was displeased with the meal. The long lines and long wait are not w","useful":0,"cool":0},"Fl8wJ2L71rTiZNTenm4vMw":{"text":"Amazing drinks & food. Joshua was waiter and he was equally fantastic. Beautiful rooftop.","useful":0,"cool":0},"jSuk4zYMaILywARJCs9MwQ":{"text":"The waitress Felicia was great, we came in with a large party and she did her best to prov","useful":1,"cool":0},"byqdbP0c1D_h3I7uQJMsIg":{"text":"Stopped in for a quick bite and had their nachos and a couple of drinks. The doorman Welli","useful":0,"cool":0},"Je0WoxAmUUmm5bAo9btJtA":{"text":"Stumbled into this place and found some amazing food & service was awesome!  \n\nWe ordered ","useful":0,"cool":0},"Ev_f2N1FQRxONA_DPVajfQ":{"text":"Let me first off say, I really do enjoy the food here.  It's a legitimate Restaurant ON Bo","useful":5,"cool":1},"86PfFew-L878QZYQe7ea1Q":{"text":"Had dinner on a Saturday night and had to wait about 20 min, the blackened ribeye was a li","useful":1,"cool":0},"2MO_wMsjUKwTYw0j9ZLGSQ":{"text":"Delicia was our wonderful server. She was very sweet and informative. Due to Covid there w","useful":0,"cool":0},"6-8xD4997zbu2RcWa5ee_A":{"text":"I have truly never had such a poor experience in my life! The manager Julie should not pos","useful":0,"cool":0},"z4B0iGCDSLoniGy4PDcMDw":{"text":"I was very impressed by the service our waitress (Whitney was a gem). Every thing that she","useful":0,"cool":0},"LoDzYuSOi98gc1zcajadLQ":{"text":"I got the catfish salad (blackened). I was a little bit apprehensive paying $18 for a sala","useful":0,"cool":0},"6SDwx-UzMRuykkE6KU5pDw":{"text":"Place was amazing. If you go, make sure you try the gator nachos.  Unbelievable in the tas","useful":0,"cool":0},"nWkqgvPozj95q8GROLvfoQ":{"text":"The manager is just nasty, servers are nice and they are literally scared of her. Drinks w","useful":1,"cool":0},"3yzbIMFcZV2KENI_0MFwvw":{"text":"Normally I would not eat on Bourbon St, but this place was new, so we decided to try it.  ","useful":0,"cool":0},"qE3L9uBKatSlEm4q_6-9WQ":{"text":"Delicious food with fast service!  Our waiter was very knowledgeable and answered all of o","useful":2,"cool":0},"hNEE1IgkEwCwnNwKRUh42g":{"text":"Best alligator po boy I had all week.  Wellington, the hostess, lured me in from the stree","useful":0,"cool":0},"EkFgtAX2nyS4kP_7QXgxiw":{"text":"Cajun Gumbo was good, avoid the steak, not their specialty. The bread pudding was surprisi","useful":0,"cool":0},"Nsdj1kpfQPqd-na1ovumRA":{"text":"Brianna was the best! Loved her hospitality and everyone's else that helped out. The vibe ","useful":0,"cool":0},"ENeiY6db9mYGiPTTmaTpqA":{"text":"The food was fantastic.  Our bartender Dejon was very knowledgeable, friendly, and made so","useful":0,"cool":0},"yZEz7LAVoieSO5OAOKykvg":{"text":"Absolutely mind blown and it's what you would think blew my mind. This spot is on Bourbon ","useful":4,"cool":1},"ThZKErDlFVMNyBkZhpjKhQ":{"text":"This place hands down the best place ever! We ordered a variety. From gator nachos to past","useful":0,"cool":0},"cmOQGSZnlCTI4GzYV084mQ":{"text":"Great service and great food!!!\n\nOur host, Robriyion was very friendly.  She seated us qui","useful":0,"cool":0},"6PdJ_sTmHJXW_LzIpag7_w":{"text":"Excellent food and service.  Loved the oysters, crab cakes and hush puppies.  Ashley was a","useful":0,"cool":0},"hSMhBL3owb9Ft9jpwDwPNg":{"text":"Excellent restaurant!  The service blew me out of the water...the staff were so polite, ev","useful":1,"cool":0},"kZ5GM99Is1YilDubLmhw1A":{"text":"Came here for happy hour on 1/26/21. All the workers here are super friendly, our waitress","useful":0,"cool":1},"SW7Li_Wcq_Haou_V05LehA":{"text":"This was one of our favorite restaurants. The entire staff was amazing. Deuanta greeting a","useful":0,"cool":0},"ecyCnMKllkqXxLZbaAa0SQ":{"text":"Couldn't decide where to eat our last night in New Orleans. Chose here and were very happy","useful":0,"cool":0},"jfznSx8kEH2e_mOVFZCT1Q":{"text":"I picked this place based on yelp reviews and the fresh looking pics.  Service was good an","useful":0,"cool":1},"DfpfHOYwChDVtiK6K3u9ZQ":{"text":"Service was painfully slow. The cold outside wait didn't help either . Food presentation w","useful":0,"cool":0},"om8WVVS3RDvSKwEQjb561Q":{"text":"Went here twice during my stay. Felicia (bartender) was AMAZING and so was the food BOTH t","useful":0,"cool":0},"3Zr_Eu9WEzO6mPTTjzrpzA":{"text":"After being a little disappointed with my usual Felix's I decided to try this place and th","useful":1,"cool":0},"WK2cKs1e0MfoZdaG3wXtKA":{"text":"First time in New Orleans stopped in mambos for dinner and a drink and our bartender Devon","useful":0,"cool":0},"DnG3ws_2NiiHfrHauzHEog":{"text":"Amazing restaurant with even better service. Ponce took great care of us! Would recommend ","useful":0,"cool":0},"zBxt3VUD5Y5SoCXSjjVP-w":{"text":"Going with what the Yelp consensus said, we made reservations for the rooftop area on a Sa","useful":1,"cool":1},"xBxVhN4DEFMB_87MYWZRhQ":{"text":"Service and food was good!! I ordered gumbo as an appetizer and this \"small\" bowl was not ","useful":0,"cool":0},"j_sBEwKYnEX5Sqi0L2oj2A":{"text":"The restaurant is new. The food was delicious. I had the blackened shrimp Alfredo. Our hos","useful":0,"cool":0},"qIwxANNWhHk1XVt4k6MXLA":{"text":"Tasty shrimp poor boys. Great location and open late. Just a little pricey for a sandwich ","useful":0,"cool":0},"ElC-VVDAl21N4llv-w-iXA":{"text":"Our first time ever in New Orleans and we went straight to Mambos! I'm so glad we did! Jos","useful":1,"cool":0},"QHK9IsvBDgF_fpVjjuqF4Q":{"text":"So I'm in Nola for work and thought I needed to get some food that reflected the city.  I ","useful":0,"cool":0},"wxjXLDbCzroBAdoZG3HY1Q":{"text":"This place was fabulous! We came in as a last minute decision. It did not disappoint. We s","useful":0,"cool":0},"LU-5Xc6dueE2pe3fupVBiQ":{"text":"Very good oysters and gumbo !! I loved the service it was very fast she professional will ","useful":0,"cool":0},"B2pJb5pkETknVL2MxXo4Qw":{"text":"Came here for apps and 'zerts after a few drinks on Bourbon street. The hospitality here w","useful":0,"cool":0},"AQORELkiUO_Sch0ZVfT-_w":{"text":"UH-MAZING!!!!!!! We had our company Christmas party here and the staff was incredible and ","useful":0,"cool":0},"qdVkVf9PakoSxIL_LLupiw":{"text":"We had lunch in the upstairs dining room. The food was wonderful and the service was great","useful":0,"cool":0},"CNnskFYrBqWzw7SLJUNwiQ":{"text":"Dined in and had such a great experience! Our server was so friendly and enthusiastic. She","useful":0,"cool":0},"thUQzbG7ExOZNulzbve2mg":{"text":"This place has the best Chicken gumbo on Bourbon Street! Was a great experience! I also re","useful":0,"cool":0},"52ZhrdfyqL3dzkRt_ls55Q":{"text":"Good food, great service.  My husband and I order the shrimp and grits, hush puppies, and ","useful":1,"cool":1},"PBt7uU6nPC8w6e1nfkq7Xg":{"text":"This spot was ok my crab cake was a little dry and to much bread crumbs but the oysters Ro","useful":0,"cool":0},"Q9Lv_DGdwvUhLfCIoraheg":{"text":"We waited for over 30 minutes and it was worth it.  We had 6 Mambo famous oysters (chargri","useful":0,"cool":1},"qyC06QRIJPMn7t0na29DsA":{"text":"Came here my first night in New Orleans and it hit the spot after a long plane ride. The w","useful":3,"cool":3},"vKM0lEufo05b-d0QpnRNew":{"text":"The pasta was really good very flavorful but lacked enough shrimp and crawfish for it to b","useful":0,"cool":0},"wQPa9opKQ0r7-4tteHmD_g":{"text":"We ate with Brianna and had a wonderful time. She was friendly and kind. Very helpful, off","useful":0,"cool":0},"pRWu4JES139RCRpCqYGu6w":{"text":"My photos don't help much but this place really hit it for me.   Room at the bar on a Frid","useful":0,"cool":2},"VD2DWngCurkD46sjGXwT2Q":{"text":"Dinner was good but they had way to much going on. Music on. Tv sound on and inside noise ","useful":0,"cool":0},"eu2olKF5bHRujiINtkYxJQ":{"text":"It was an hour wait and it was painfully long with such a short line. If you didn't make a","useful":0,"cool":0},"cp5XwGcXUfmUaZO90fj_qA":{"text":"Experience was all over the place, started off great with the waiter we got, she was very ","useful":0,"cool":0},"kUBIm7MgurM8S8pCvoxF_g":{"text":"I honestly didn't expect much from this restaurant-but the shrimp and grits was the best I","useful":0,"cool":0},"HOhUgaE_DZwBwIpWODZO0A":{"text":"Got a big group? A lot of picky eaters? Mix of adults and kids? Some people in your crowd ","useful":0,"cool":0},"7cnrT5-OoVoPPyOII9VjhA":{"text":"The $1 oysters brought us in, and the gator nachos made us stay. Top that off with the gre","useful":0,"cool":0},"xUTkMIM6GF1Q2OoAidBj2w":{"text":"Food was amazing, I had crawfish etouffe & my boyfriend had the fish platter. Everyone was","useful":0,"cool":0},"3rO3Hnlb8NwnrHb3-qFdWA":{"text":"Sat on the bar, Juan was amazing giving us perfect recommendations.\nFood was amazing we ha","useful":0,"cool":0},"gs96aiDnI7qvRtcm_dvUDQ":{"text":"Try the Mambo's Oysters--you won't be disappointed.  As a matter of fact, try the Blackene","useful":0,"cool":0},"fJktYFnXxNSpgTCQfdNqvQ":{"text":"A must when in the French Quarters! This place was amazing! This place is going to become ","useful":0,"cool":0},"gIu3SUm3wTDQ8IDQiwu9iA":{"text":"This restaurant has delicious food.  We went for happy hour and had $1 oysters and $2.50 b","useful":0,"cool":0},"lwOKaB0Ec79qbUXz_cDNog":{"text":"Hmm.. this place is a bit over-hyped. Customer service was good, scenery is pretty good (t","useful":1,"cool":0},"AX3_WVKvEWgk2Ou5OkecGA":{"text":"I ordered the Taste of New Orleans for a late night dinner delivery. The bread was a littl","useful":0,"cool":0},"idVE7pDB8c2LibOyTnYEBA":{"text":"We went here for dinner based on Yelp reviews. I ordered way too much food so the bill was","useful":0,"cool":0},"LE6Kiy8ah4ciKI3k3GeDLA":{"text":"COVID protocols were excellent. Everyone wore masks, gloves and tables were socially dista","useful":0,"cool":0},"5BVPej1KCq5ZuafvsMAmlg":{"text":"Awesome. Awesome. Awesome. Had the grilled alligator poboy. So yummy. A perfect ratio of m","useful":1,"cool":2},"VBvZ3NelHQVWyIc6kmSy_w":{"text":"I dont have any complaints. Our server was great and the burger I had was wonderful which ","useful":0,"cool":0},"LCnPzIVrcYwKdgdzen-ULw":{"text":"I was surprised that the food would be that good on Bourbon St. Service was fast and frien","useful":0,"cool":0},"Sdc8jTQnHqN5EyeALINFzA":{"text":"Great food, our service was great too. Only thing is that they forgot our appetizer but we","useful":0,"cool":0},"Ygn5vio-CzNGHpfKJimb4w":{"text":"Excellent food , even forgot to take pic of food! It was so good lol. Couldn't wait to eat","useful":0,"cool":0},"02gFyUvasdDH2fIoVlaR8A":{"text":"I went in later in the evening and was helped by Jordan. She was absolutely fantastic. She","useful":0,"cool":0},"ERnWNdKMCAUqWPrcZiwABw":{"text":"Last night in New Orleans and wanted some Gumbo. Decided to brave the crowds and go to thi","useful":0,"cool":0},"_dt8QrGAlVI0niFyXWnJ-Q":{"text":"My husband and I really enjoyed this place. We were walking bourbon and saw this place wit","useful":0,"cool":0},"vgo4yqZOTlE-L38giqSjLQ":{"text":"Our server Ponce made the experience here. He was so knowledgeable about the menus and the","useful":0,"cool":0},"rL5gLdWIevJfUpqkVtmTPA":{"text":"Stuffed salmon order overcooked. Was not stuffed. Little disappointed. Called manager, she","useful":0,"cool":0},"VIV7UMwy4VkfHabMIigiyg":{"text":"Glenn, the waiter was absolutely amazing!!!  The food was outstanding. This is a must to g","useful":0,"cool":0},"Leu6U2v0h5sSMkFfS2n48A":{"text":"Service was fantastic, the food was great! We all tried something different and it was all","useful":0,"cool":0},"FPFXRnXCSxWeWzIcsxsy1g":{"text":"Our food was great but the service was awful. Noticed that the people who were black were ","useful":0,"cool":0},"iT50VBS9wOS7zhOf3o3XWA":{"text":"We ordered 5 entrees, spent $150 and feel like we wasted our money.  Got a lot of food....","useful":0,"cool":0},"RfRGgCh8SGKcm-mY-57K1Q":{"text":"Literally amazing. As a non sea food eater I got the chicken fettuccini Alfredo and it's s","useful":0,"cool":0},"Mg8Lae2YoidKFnVd6sQw9w":{"text":"Don't waste your time! Waited for an hour an 15 minutes just for their drinks to be poor, ","useful":1,"cool":0},"JhkDQ7DBX47q1-XJA1yBOg":{"text":"Great ambience and our server Maddie was awesome, especially given we were a large party. ","useful":0,"cool":1},"9_7YCrwdJFE-gMk9BI_Zug":{"text":"A fun and casual place where you can have a great meal! We went with friends to celebrate ","useful":0,"cool":1},"41ChTqkiMwOabweV91QzQA":{"text":"Came here with my fiancée (who isn't a big fan of seafood other than shrimp) and we absolu","useful":1,"cool":0},"AcD7K9aTvUtxosLdl4kWig":{"text":"This place was great! Good deal on oysters and draft beer. Po boys were excellent, includi","useful":0,"cool":1},"aAbInKEvJJG6ZET_tn84fg":{"text":"The fried seafood and char grilled oysters were good but the service and browny Sunday wer","useful":0,"cool":0},"7LUdWWHtjBp3_IiCBbYyMQ":{"text":"Super nice restaurant with great staff. We are here last night before having all kinds of ","useful":1,"cool":0},"6ltnOXjnpTIGYz22YgFAlw":{"text":"If you are ever in Bourbon Street stop by Mambo's.  Bread pudding is so delicious could no","useful":1,"cool":0},"h2RpsxvcvF5-WG12KumEEA":{"text":"I came here at night with a group. We were on the top floor. Im not sure if our server was","useful":1,"cool":0},"clzZCKMFqd4cWZXBNsjinA":{"text":"Great time coming to New Orleans and super happy we found this spot! Walter, our waiter, w","useful":0,"cool":0},"P-FckGjG8wWOuZn3B-tb0w":{"text":"Fried Gatorbites were so good\nAnd so was the seafood pasta\nVery nice balcony view on the 3","useful":0,"cool":0},"-aJMrCrMAdMlhVV6ccmL0w":{"text":"Horrible issues here.first.. excellent servers.. very apologetic.cant blame them\n #2. Free","useful":1,"cool":0},"_6zwcdfs_Zn20OHhcaHwZg":{"text":"The food here is AMAZING! There were 3 of us and no one had any complaints with their food","useful":1,"cool":0},"Nf0wRMboH1bHb8wrHjquxg":{"text":"We had such a great experience at this restaurant! I have tons of food sensitivities and w","useful":1,"cool":3},"AFXK15adtP5vZPixyuQXhA":{"text":"We stopped by based on the reviews.  The gumbo was cold.  The Jambalaya pasta was tasty ev","useful":0,"cool":0},"KEbh17nrGAnnj0zvglzlbw":{"text":"Fabulous restaurant!  Mambo's was our very first New Orleans meal and it did NOT disappoin","useful":0,"cool":0},"D8yAVILaJf8lXgwmw-_Njw":{"text":"really great food and drinks!! \nBlackened redfish on zesty potatoes and a sauce that to di","useful":0,"cool":0},"BhKB7nP4fwrsyx961IVchQ":{"text":"This warmed my soul.  We stopped here cause everywhere else had long lines.  Glad we did!","useful":0,"cool":0},"x8NkldjzNblbb8VGIehqPw":{"text":"Great food and service! Bartender was super sweet and very knowledgeable about New Orleans","useful":0,"cool":0},"TEXcKOf9xNFRFBcQxvBkCg":{"text":"Our server Ponce was absolutely amazing. One of the kindest, most interesting people we me","useful":0,"cool":0},"W4vCKG8LBOLS1mgDinYlfQ":{"text":"Isaiah Gave us great suggestions thank you so much.  The appetizer gator nachos were to di","useful":0,"cool":0},"JZ74CFReU8p3mq4jeV-SQw":{"text":"Always great food the BBQ shrimp and grits is to die for..Oysters always fresh and yummy","useful":0,"cool":0},"VSwl7VFkL3wsko6A97hnfA":{"text":"Pretty awesome food. This was my 1st time in New Orleans. The blackened gator was sooooooo","useful":0,"cool":1},"BEPrrvvQ5Dlv67jbF_-ImA":{"text":"Blackened alligator po boy was excellent.  Service was great.  People watching was also ex","useful":0,"cool":0},"w89R0jjFNxLhu65zSRazEA":{"text":"Great food! We enjoyed the upstairs patio. It's very clean compared to other eateries on b","useful":1,"cool":0},"LkSOY8odZR65QTFi1v0sHw":{"text":"We stopped in while walking bourbon street and were very pleasantly surprised. Nice casual","useful":0,"cool":0},"N2KZsyM-UIcJRZHe6DJBMw":{"text":"Had an afternoon meal with Delicia as our server. She made wonderful suggestions and was p","useful":0,"cool":0},"D-bEsVFOXW9960tfZ6kpHA":{"text":"Chris C. was the friendliest and most helpful server I have ever encountered in my 24 year","useful":1,"cool":1},"p1ByKmB3I1SI8TxTV1npWw":{"text":"Great food wonderful service rooftop seating I tried the bite size alligator that was  fri","useful":0,"cool":0},"qknp8gqyhMiFcZ0m5DlvhA":{"text":"The food was the best I've ever tasted! From our greeter Charles, to our server Ponce, the","useful":1,"cool":0},"_qFv1spLMjPn75rDhdnjRg":{"text":"Great experience. Staff is extraordinary. Devanta got our attention on the street and he d","useful":0,"cool":0},"F5WXjhNvVk5xyIi6Z-2niQ":{"text":"Our food was really good. Our waiter was the most attentive waiter I've had. She continual","useful":0,"cool":0},"cu0JLhxSciMrHNPer1FdzQ":{"text":"Were in town for the day walking around the French Quarters and stopped in. Definitely a t","useful":0,"cool":0},"4TufuKg5ROTUvnq31KGb5w":{"text":"Excellent food and service. The crab cakes are very delicious. Definitely recommend them f","useful":0,"cool":0},"w9kYZYln0GQNQYxpjujRUw":{"text":"This was my first time visiting NOLA with my boyfriend and the first restaurant we went to","useful":0,"cool":0},"x8s872lUFtVg2KnjaNe5nQ":{"text":"On our way home we decided to stay a few days in NOLA and expected some amazing food well ","useful":1,"cool":0},"CxtxG3NyNpMs_zUoEnuFvg":{"text":"Lifesaver -- & managed to salvage our St. Pat's NOLA trip.\n\nWe were wandering Bourbon Stre","useful":1,"cool":1},"3ll8t-5WQbVe3c4Q_M9LZQ":{"text":"I never review restaurants but when one is absolutely so terrible across the board - I fel","useful":1,"cool":0},"C9yKSRvDMxA9omPG3YU51Q":{"text":"Mambo's Famous Oysters were my absolute favorite! The red beans and rice with chicken was ","useful":0,"cool":0},"n0FrsQoTbsJegcqm8ucjxg":{"text":"Definitely deserves 5 stars since I believe most people are drunk in the French quarter bu","useful":0,"cool":0},"dDOtqBhAWm97ULylbzDOdQ":{"text":"Had the Mardi Gras Catfish and the Mambo Oysters.  Our server Ponce was on point with his ","useful":0,"cool":0},"xMoAlH_V-BzAWMY28XO3XQ":{"text":"Despite being in the middle of the tourist centre that is Bourbon Street, the food here is","useful":1,"cool":0},"A0mRSAybBMHFGNyeseoZPw":{"text":"Place is awesome...great spot on Bourbon...the blackened redfish lafourche is one of the b","useful":0,"cool":0},"vvn-N8BkIC5Hosok9odApQ":{"text":"If you're looking for the perfect meal, served by the city's best, in the heart of the Fre","useful":0,"cool":1},"E_3UGkqWuMwQUrKuHRjeFg":{"text":"I really enjoyed my dinner at Mambo's, Keicia, our server, was very welcoming and knowledg","useful":0,"cool":0},"9-7Z4T2Y2229BUSBc78-fQ":{"text":"This really is a great spot to grab food, especially for being on Bourbon. We were concern","useful":0,"cool":0},"TPFNJmI5nqpzddfBSgAd3g":{"text":"Our first stop here in New Orleans and it did not disappoint. We had the blackened fish po","useful":0,"cool":0},"qxQ-NXGB7_BKCcRuujQEUg":{"text":"Visited here for lunch.  Let me start with the good part.  I was seated fast, the server G","useful":1,"cool":0},"HpQZOfhYqpo6nrTDPpdypg":{"text":"Food was so very fresh and flavorful. Service was about 80% but nothing to specifically co","useful":0,"cool":0},"m0WjK3RkIREciyxe1-iJ-g":{"text":"Amazing food and great service. I ate there twice in three days. I will go back. Everythin","useful":0,"cool":0},"Td7x4bQE694zw0y348u3Ww":{"text":"Great place to eat! Best fried oysters I have ever eaten! Been here 4 days and have eaten ","useful":0,"cool":0},"e1_uqVwfDvvhYsAdHuza9A":{"text":"Service- great.\nPortions- big.\nFood - average or even below average.\nI had fish platter an","useful":3,"cool":0},"y7BFgOArH0l3_8zKn2RvJw":{"text":"Great location, friendly staff and has an amazing overlook of the Bourbon Street. The open","useful":0,"cool":0},"6OAAA6xASbGWu-1KsrMivw":{"text":"Amazing experience with the food and waitress Christina!!!! It would be in your benefit to","useful":0,"cool":0},"pKez27zRIhTYLbmqF2ti_g":{"text":"Stacy the server was such a sweetheart she was on top of our table. Kept coming around ask","useful":0,"cool":0},"SyRfMmP9PyAmeYy8kGxqQw":{"text":"Great food, but the service can be a little better as we had to ask for most things twice ","useful":0,"cool":0},"Nc1EKZTy4QQoiEKYexcxbA":{"text":"Good food, great service. We ordered taste of New Orleans, and crab cake. My favorite is s","useful":0,"cool":0},"kFxdYtwUezilUmSAOvHjNw":{"text":"Oysters weren't too inspiring, had a stronger seafood smell so not too fresh. Taste of New","useful":0,"cool":0},"3G18WeyqhI6E2hjEEx5-_w":{"text":"Baybeeee!!! We visited Nola for 3 days and ate here 2 out of the 3. The chargrilled oyeste","useful":0,"cool":0},"VhFq3FLOH0GWX2t4RomyOA":{"text":"Just had lunch at this restaurant and was very disappointed. Started with very watered dow","useful":0,"cool":0},"LCoMoPjCnPmqDUyX_rlIMw":{"text":"I normally don't review too much but after our experience here I am. Ky was our server and","useful":0,"cool":0},"HEJxlATWqlXx0YP17bJ8zA":{"text":"Langston was our server and gave the best service! My coffee and water was always filled a","useful":0,"cool":0},"Q7VoBA8raRQ6nI6ucFPn-Q":{"text":"So good. Mambo's blackened redfish was amazing, I definitely recommend it, it was the best","useful":1,"cool":0},"FCmZmnL-I4rPph9T60lG8Q":{"text":"Christine was amazing stopped in for late night drinks and a snack on the roof top bar. Ch","useful":0,"cool":0},"l6wc8mLysEHRUC462TW7UA":{"text":"Ordered through door dash.  Took a very long time because driver had trouble getting to & ","useful":0,"cool":0},"_0lbiO7SDMjdLgSHfYTMIA":{"text":"Christian,  the greeter at the door was very friendly and gave great suggestions! Our serv","useful":0,"cool":0},"atgu2SwOWVrl4tlMSzGvBA":{"text":"Came when it wasn't so busy... earlier in the morning. From the the get go everything and ","useful":0,"cool":0},"2bCXGty855lYIO9rvhQkuw":{"text":"Lured in by the good reviews of this place.  Unfortunately, didn't live up to the the revi","useful":0,"cool":0},"XVZbwwvt9cYckF9azTbbvw":{"text":"Waitress was nice but gumbo was cold and manager wouldn't take it off and they slip top sh","useful":0,"cool":0},"AwBIZskRTuNJy55t96QfTQ":{"text":"Ponce was a fabulous waiter! The young man at the host stand was so kind too! I had the ca","useful":0,"cool":0},"5je7yipjy6fhubuAsvjOew":{"text":"Worth the wait! My husband ordered the chicken Alfredo and we both agreed it was the best ","useful":0,"cool":0},"u0lxtHY0qpmw8Omu0__TCw":{"text":"Service was great food was delicious! Would recommend this place. We had the alligator kic","useful":0,"cool":0},"OVOyW33So77sP0H32Rudsw":{"text":"Honestly only ordered apps but gator bites were way overdone Spinach dip seamed like it wa","useful":0,"cool":0},"0Q6_dY3LeliSOzSsxlb6gQ":{"text":"The spot was so good , started out with the alligator bites , it was half fried and half b","useful":0,"cool":0},"-iMsVY-aDR33gvZb8jOsqA":{"text":"We got the shrimp and chicken alfredo. Was probably the best meal we had so far.  Food was","useful":1,"cool":0},"GYINADHS7uE6lz3qZ6cY0w":{"text":"We had the Mambo's World Famous Oysters, fried shrimp and Buffalo chicken po-boys, and the","useful":0,"cool":0},"swOUeE8Wxx5isRzGx6H82w":{"text":"This place is fabulous!!!!! Great food but even greater service. I have an onion allergy (","useful":0,"cool":0},"_UdQ84SQvJEnAU8yZvrU0A":{"text":"The staff was extremely welcoming. COVID 19 protocols were followed.  The food was very go","useful":0,"cool":0},"G4ryEjCJoG2Btb-dSv7dOg":{"text":"Highly disappointed with the Management at this establishment. The manager Julie was COMPL","useful":1,"cool":0},"DpwC70i7RGOgppvTaZvaKg":{"text":"Really good food. The crawfish-gatir nacho were delicious. Catfish was amazing. Service wa","useful":0,"cool":0},"MsxoiGlAziAHWrhUVGUW2Q":{"text":"Food was very good! It was great to have authentic New Orleans food. Our server, Ashleigh,","useful":2,"cool":0},"LYUep4B_Nn47Ry0a03RXyA":{"text":"Ate here last week and I got \"The taste of New Orleans\". It came with red beans and rice, ","useful":0,"cool":0},"7jbUup4ZJNv73EgFwA6hIA":{"text":"Food was excellent. Our waitress, Rasheeda did an outstanding job. We really enjoyed the a","useful":0,"cool":0},"k4jIQXkIx_X5_4vskYfRVg":{"text":"Keicia was probably the best server I've ever had. The food was amazing but man did our se","useful":0,"cool":0},"8GO5Wixu1u6DaZFRsGWvIg":{"text":"This was by far the best food we had while on our stay here in New Orleans! Not only was t","useful":0,"cool":0},"_PxXFYrwTlYk-cTO6MvlQw":{"text":"Great food, great service. We got to try fried alligator and it was an experience. Really ","useful":0,"cool":0},"fxpjGck1ATqcVbDltrhCTg":{"text":"Great food, great drinks, great views, great service! Lovell and Amethyst are highly tenta","useful":0,"cool":0},"VMs09seS1O7z9zYhE4GwFw":{"text":"Had alligator bites. My first time trying alligator meat. Couldn't tell at all! Tasted lik","useful":0,"cool":0},"34SN0KUSNykVc3SeCYHkMA":{"text":"Another tourist trap, ordered a po boy and it was pathetic experience. I swear these peopl","useful":0,"cool":0},"Cq8M9XWVZaOFfmEiVYXDfw":{"text":"This was a great restaurant with great New Orleans vibe! Ashleigh was a great server as we","useful":0,"cool":0},"sU4G7ic4h0wa1GKYc0bQvg":{"text":"Taste is not good. crawfish etoufee ， you can count maybe only five crawfish tails, and sm","useful":0,"cool":0},"fK2G0IRCB2gM4yQyHmnomw":{"text":"Waitress was very friendly and fun! Our dessert came out before our food. The food took a ","useful":0,"cool":0},"jM5blHHt3e2OWgSKtdcHvQ":{"text":"For being on Bourbon this place had great customer service and they food was better than e","useful":0,"cool":0},"JgRP_SLYEpWbY949y8mQTA":{"text":"I did an online order. I'm in a hotel for a convention and too tired to go out. I got a ca","useful":0,"cool":0},"nTER16PB47F-ISyThDI-ag":{"text":"We are residents of the city, but first time there at Mambos. It was fantastic!! The food ","useful":0,"cool":0},"35cvUvQf6Y6IkITVeO809g":{"text":"So disappointed that I made a pick up order that was a 3 minute walk away and pick up time","useful":1,"cool":0},"gymxMd_P0I2RTdXiPhpnPA":{"text":"We tried the chicken and Andouille gumbo and the Louisiana crab cakes for a late night sna","useful":0,"cool":0},"k0sg2KLv-ipOyti2f3m4Hg":{"text":"I normally don't leave reviews but I just had to in this one.  Best fish I've had ever! An","useful":0,"cool":1},"nw2cbeZlaXzPOzBrcimWLA":{"text":"I had the mambo oysters. They tasted kind of fishy. I frequently found bits of shells. The","useful":0,"cool":0},"-CQD3vrZBzcflHuzwnJ-cg":{"text":"Best grits I've ever had! Brydrika, our waitress was amazing! Must try if your on Bourbon ","useful":0,"cool":0},"Y1c3zIbH6dONLWj-QwtQ7A":{"text":"My friend and I  dined here back in December of 2019 while visiting New Orleans and we wer","useful":0,"cool":0},"fTbbCqGrsGd_BhD77AVnGQ":{"text":"Food was good. Overpriced, but it's the French quarter. Ordered the red beans and rice wit","useful":0,"cool":0},"OePQkDiSVlq8YXuAC72tkA":{"text":"This place is outstanding. I've been here several times and the blackened shrimp po'boy ne","useful":0,"cool":0},"iiJAtAEUidjWr4WZyv_aqg":{"text":"This spot was my 1st stop when we arrived in Nawlins .... We were Greeted by Isiah NOLA st","useful":0,"cool":0},"PA7e8G1CimwClUFjW85HfA":{"text":"Hands down one of our most favorites spots here in New Orleans. This was our first time vi","useful":2,"cool":2},"X-1yYyx39Ca5gwGBmI_Vyw":{"text":"Our first meal in New Orleans was delicious! We started off our meal with the alligator na","useful":2,"cool":2},"epCh6_I9y84fBre3fA9uoQ":{"text":"Celebrated my 21st birthday here! Had the best waiter and the most amazing view. Would def","useful":1,"cool":1},"3jgcUGHRjadRB3Yx9RLivQ":{"text":"Very delicious food. We each tried one version of their blackened redfish. Service was goo","useful":0,"cool":0},"ZnA8klRWIh8DfSMt9DZrTQ":{"text":"I dont know if it was because of Covid of because we went a day before Burbon st. Got shut","useful":0,"cool":0},"Y65XOD-nNkcmzyPIWBZeyg":{"text":"Wow this place is incredible. The food, the atmosphere, and the SERVICE. We had a wonderfu","useful":0,"cool":0},"fRyylVp53MwrEQjqF6TxJw":{"text":"The hostess was beyond rude and my husband and I found out Stacy had been let go. We didn'","useful":0,"cool":0},"CSlPiswiVrNbTha_FT2FCw":{"text":"I wanted to like my first southern comfort food dinner but I was disappointed.  The food h","useful":0,"cool":0},"QHc_cT1mbK20vmZuZPL6og":{"text":"This has got to be one of my favorite restaurants of all time. The food here is superb and","useful":0,"cool":0},"W90-enUyGHolcwivySZX8A":{"text":"BEST JAMBALAYA PASTA IN THE FRENCH QUARTER!! Honestly though the entire staff is kind and ","useful":0,"cool":0},"M2tJa0J4Sowd-olPc4S-pw":{"text":"Meal was awesome oysters were fresh and hot. I had a mambo burger, it was the juiciest bur","useful":0,"cool":1},"dW5-R8IpmQq2btGSxIXUUg":{"text":"This place is really bad ass. My great grandfather Teddy Johnsons picture is on the wall h","useful":0,"cool":0},"2PQkjxE6FscUovXOszpWAA":{"text":"Alligator nachos were great ok. But. The. Red. Fish. Was. Out. Of. This. World!!!! I will ","useful":0,"cool":0},"8patUzDR4D4l8XyoX4dvjg":{"text":"Going to go out on a limb and say this was my favorite restaurant during my time in Nola. ","useful":0,"cool":0},"TRb4ZYvLn93PZv8MsoPW0A":{"text":"We stayed in New Orleans before embarking on a cruise. We wanted to see Bourbon Street and","useful":0,"cool":0},"uD_2oTypxzmcf6vQkC-jow":{"text":"We waited in the streets for about an hour. Which is par for the course eating at a locati","useful":1,"cool":1},"Dj2q0e5L4gnPE-VNc1oXEA":{"text":"Super long line but worth it. We shared crab cakes, Caesar salad, the Louisiana platter, a","useful":0,"cool":0},"6mENnpDKxHqGMnksFQhHBw":{"text":"Never been to New Orleans before, my boyfriend and I were wanting to taste some of its wel","useful":0,"cool":0},"R1eg6L4txx3bESknL8O_OA":{"text":"Great service! We came pretty early so were seated right away. This place got busy quickly","useful":1,"cool":0},"MroZvibP_u_oDwNj7G06pA":{"text":"Great food and great service! TK was super nice and attentive! Walter was also very nice! ","useful":0,"cool":0},"i8WJcTAgqFT5BC0pIugJuQ":{"text":"This is my first time to New Orleans, and I could not have picked a better place to have m","useful":0,"cool":1},"t73aDh34D5IZbx9cxEj1CA":{"text":"I got the Louisiana crab cakes, mustard greens, and crawfish etoufee and everything was de","useful":0,"cool":0},"hm8Etr2BahvnR0FDJPLk6g":{"text":"This spot was awesome.  Shane was super knowledgeable and recommended the gator/catfish Po","useful":1,"cool":0},"XLxoQ9gd_dudJPeHRkWk5Q":{"text":"This was my first time visiting this place on Bourbon. The atmosphere was nice and they se","useful":0,"cool":0},"-FcaMI6mO4RHmLT_o3eKYw":{"text":"Our group of 7 were headed somewhere else originally... so much walking prior deterred us ","useful":0,"cool":0},"nZJRxuBO7A2NPiuZt0nzzg":{"text":"This is the best food spot to me on Bourbon st. The pastas are all outstanding. Also eatin","useful":0,"cool":0},"DjK6zpMwaGsPHBsJVofWsA":{"text":"This spot was very cozy with an old feel to it. The wait wasn't that long and the food cam","useful":2,"cool":0},"Fjc_FKRfgpX89iYlW0greQ":{"text":"The service was good and it was quick to get seated. The drinks were strong and the chargr","useful":0,"cool":0},"Rk-pqoXKYNxOxazi9yTGLw":{"text":"We were only in town for a few days and ended up coming here 2 times. The first time, we s","useful":0,"cool":0},"zeBIo9wEBGZ8sRpANwfU5g":{"text":"The food was delicious. We had the lump crab cakes for an appetizer, I had the  Mambo's bl","useful":0,"cool":0},"uEgcO7Y52ahzN0rfmDZ3Kw":{"text":"Beat place for food and service! Juan and the rest of the team there made us feel at home ","useful":0,"cool":0},"txDvJq-QOdRCC5Fq6mfgVg":{"text":"Excellent place!!! I can't say enough good things about the food, service and atmosphere. ","useful":0,"cool":0},"UfYXAosvfk7Boy77TWvmTQ":{"text":"Ashleigh was an amazing server! The restaurant was beautiful and clean, and the food was s","useful":0,"cool":0},"exsN4XYZjGyyBkc02c1JhQ":{"text":"There is always a line outside. But it is well organized. Worth the waiting. BBQ shrimp is","useful":0,"cool":0},"IsYfVCwF0DCxIkhJ6syF_w":{"text":"Great food and service. The food was absolutely delicious. The pecan pie was by far the be","useful":0,"cool":0},"NkD1h_e_pt7iZf7aKtFgIg":{"text":"Let's start with the customer service. Maria was THE BEST. The food? DELICIOUS! Highly rec","useful":0,"cool":0},"Te-s9QHE06IKm1zWmwf1EQ":{"text":"We were curious why there was always a line in front of this one, and then we found out: b","useful":1,"cool":1},"Hev48fkt9dqMcqM5JYAXIQ":{"text":"Great & Clean place .\nThe food was also great.\nAnd the service was impeccable.\nI would ret","useful":1,"cool":0},"Nq-jFRyXTnjzz4c13sj5pg":{"text":"This place is amazing! not only the food is fantastic but so are the servers especially Jo","useful":0,"cool":0},"HQm346QgQtV8v38U6YWUxw":{"text":"Staff were friendly. Breanna was great, she gave us some suggestions and it didn't let us ","useful":0,"cool":0},"lao54Fr0olf6b20jD7tPKA":{"text":"The only drawback was seating was a bit crowded. But I was impressed by the time it took t","useful":0,"cool":1},"MSs7zT1Ec9DMHBBeBO-Yig":{"text":"Very good food. Must try the Blackened Shrimp Po-Boy and New Orleans style Barbecue Shrimp","useful":0,"cool":0},"7a4RFg3uhwwm6Tc_kPze7w":{"text":"This spot was SPOT ON! We got the carnival pasta, fish platter, spinach dip and they were ","useful":0,"cool":0},"AJq8NPvMwzp3gczhqktnaw":{"text":"Definitely a tourist trap! Located right off of the crazy Bourbon street, we were looking ","useful":0,"cool":0},"YUZg08N6s16KA05RTknqsQ":{"text":"It was okay. We waited forever to get our seat and then again forever to get our drinks an","useful":0,"cool":0},"kRV1GKISoT3xcW20ONLIUw":{"text":"We sat down at a table and were immediately served it was very simple we got the gumbo wit","useful":0,"cool":0},"A4SaitDCs-w6bBOl2XkJ9Q":{"text":"Definitely worth the wait. Don't let the line discourage you....be patient. Service was ex","useful":0,"cool":0},"zsNEW6NuaTaAo5xQQQX-pQ":{"text":"Okay, so I know this is on Bourbon and there's a lot happening outside. But this place is ","useful":0,"cool":0},"0L15oXiDoQ2U9Hm0SbFt0w":{"text":"This place is smack in the middle of Bourbon so if you're looking for a quiet place to eat","useful":0,"cool":0},"lT9wH31CYlJnTEuSp3sk_g":{"text":"Visiting from out of town and our first time at mambos. The food was sooooo freaking good!","useful":0,"cool":0},"A5CjHS0zgnGXp0vIaVmbPw":{"text":"What are you waiting for?  Go to Mambos! Awesome Oysters Rockefeller,  Bbq shrimp and craw","useful":0,"cool":0},"19vb4E1g0JrDtl0qEfM_YA":{"text":"Stopped here for food on my first visit to New Orleans ever. My waiter, Leo, did an excell","useful":0,"cool":0},"ykUUTi7EIyy0TpnlrUdm0Q":{"text":"Not to my expectations...food took long, oysters were flooding in the sauce they put, batt","useful":0,"cool":0},"LNwJxwl4_WCCaAYQsDV1QA":{"text":"Great spot to enjoy massive oysters and cold beer on Borboun St, Service was fantastic (th","useful":0,"cool":0},"hYyz1CwXrKyBplfs8b3YLw":{"text":"Favorite place to eat in New Orleans. Gator nachos and bbq shrimp and grits are great.","useful":0,"cool":0},"V8JLedzpD8soRX1nQSmJIQ":{"text":"This is a great spot for authentic NOLA food. Ashely gave great recommendations for happy ","useful":0,"cool":0},"Vb6ZpNLui5IK5jfTaTHnmg":{"text":"Everything we ordered was amazing. Definitely have to try the bread pudding. Yasmin was an","useful":0,"cool":0},"g_0E8B8ll1ID_NVz-6vCVQ":{"text":"Disclaimer: We ordered through a third party delivery service so I can't speak to the qual","useful":0,"cool":0},"JBcIOf6hrPnpyu97bYne7Q":{"text":"Some of the best food I've had! I got the duck wontons and gator nachos. The gator was so ","useful":0,"cool":0},"z6XydR-k4hvA3cQP7vFGew":{"text":"We were just walking by on the way somewhere else and decided to stop here instead. I am s","useful":0,"cool":0},"IW5VyxBoreQo4jtx14D7gA":{"text":"Was recommended to come here by the doorman of my hotel, who I will not be tipping when I ","useful":2,"cool":0},"aIBdm4oZ6n-VbvYJAcds6A":{"text":"The bar upstairs is super quaint and old school.  Downstairs is more loud but still fun.  ","useful":0,"cool":0},"5EWwDAeDa12J76MdnUCO2A":{"text":"Food was superb service was amazing the wait time was super super long. We stood outside f","useful":1,"cool":1},"Pchmx8cXv3lHbl-L6kVfGw":{"text":"Ummmmmm.... great food and great service are rare but I guess that how they do it in The N","useful":0,"cool":0},"6fMgYlxeHCRT4UeRNad3eQ":{"text":"In the middle of bourbon street, has a rooftop area as well as street level restaurant and","useful":0,"cool":0},"oSFhfAYKm9tP25k9FLDJmQ":{"text":"Asleigh was super nice and helpful. The wait seemed unorganized at times and was pretty lo","useful":0,"cool":0},"HR2MSe32jQszcRUjem7nGg":{"text":"Great service at the bar but the food was way to salty; however since we ordered take out ","useful":1,"cool":1},"USTDAabDcr_SJ8eCcYC1sw":{"text":"The food and service were both amazing.  We had their specialty drinks, which were super y","useful":0,"cool":0},"GAJF912WSSr5dr_5vpEPiQ":{"text":"OMG they are lucky I gave them one star! First hubby had a dirty fork, then his salad came","useful":0,"cool":0},"_YBmWzoT4sW3_aKRbXjWiA":{"text":"Request the rooftop then demand Maddie be your server. Of the literally thousands of resta","useful":0,"cool":0},"2wZJGviM7ofB2JnLN-I-5A":{"text":"This place was so good I ate here two nights in a row despite a wait line to get a table. ","useful":0,"cool":0},"mnbQGgO4h3KJL7SOjWl6qQ":{"text":"Our waitress was absolutely lovely and so much fun! She had great recommendations, and the","useful":0,"cool":0},"BlzEVX8hGBgU2z-2vI39ZA":{"text":"We happened upon this place while walking down Bourbon St, and were surprised to see a pla","useful":4,"cool":2},"3RpyNMX3rSseytkd7S1lbA":{"text":"COVID review. Got delivery from here. The crab cakes with cream sauce were ok but not the ","useful":0,"cool":0},"XIj2c41--_PesLUSnD-VHw":{"text":"One of the few places I've been able to order a vegetarian dish (vegetarian pasta)! The me","useful":0,"cool":0},"OAGsbO9nNE8dx2Vp2K1VDw":{"text":"This was a must-go in New Orleans. There's a rooftop with a wonderful view of Bourbon St. ","useful":0,"cool":1},"ETDkogn3YliEuKYOSYzlUw":{"text":"The food was great. We had chargrilled oysters, BBQ shrimp, blackened fish, crab cake and ","useful":0,"cool":0},"6jr4CIiYpyWVfG1kjl5goA":{"text":"Food is amazing. Pecan pie is a definite must. Service was spectacular. Quincey was one of","useful":0,"cool":0},"cver-pwDYJBluAsh0cRyDw":{"text":"We had a wonderful meal on the rooftop last night. My husband had the Mambo's Blackened Re","useful":0,"cool":0},"XYyMNASYbudx5rytdELfxQ":{"text":"Mambo's was phenomenal! I just want to say that before I start off my review. I stopped in","useful":2,"cool":0},"GaDxYXBBSmNQ0Jw_O0mwTQ":{"text":"Food was great! Special shout-out to Isiah and Kevin for the awesome service, thank you gu","useful":0,"cool":0},"f9jrEqXgjh5Cidpu3vvuEg":{"text":"I had the blackened red fish and it was out of this world good. The greens were krazy good","useful":1,"cool":0},"eYYhJOLy_EsfLhDXXkYBJA":{"text":"Food was okay. Service was good. Problem...time it took to be seated WITH a reservation. W","useful":0,"cool":0},"g2W4UHXRqV_3xllhIn6iNQ":{"text":"The location is on bourbon street and very close to Jackson Square. The food is amazing an","useful":0,"cool":0},"HcmdN4yLplfZpJhHrK_Ong":{"text":"We were wandering around late near Bourbon St and my bf wanted to go to Court of Two Siste","useful":10,"cool":9},"QYBmabA_glriOlZOH0hCbA":{"text":"Overall my experience here at Mambos was amazing. Our waitress was amazing as she checked ","useful":0,"cool":0},"6tizoyyAFOcNK_eEGxLu6Q":{"text":"The food was delicious. I used Grubhub to deliver the meal to my hotel room. It was red be","useful":0,"cool":0},"Jeg0S_zqVbvTfX1ZKb0WcQ":{"text":"My family and i were here visiting for vacation. The food here was excellent! I ordered BB","useful":0,"cool":0},"VbFJOs4TSGPdCe0eo2RY0A":{"text":"Excellent service! Leo served us and was extremely prompt. The food was delicious! Must tr","useful":1,"cool":0},"54ATisJsrcxF0nTcC0N89w":{"text":"Good food for the area. We had the crawfish etouffee, gumbo, and red beans and rice. Food ","useful":0,"cool":0},"8fGFOIcv6QjujvbPAs0B6A":{"text":"Mambo's is located on bourbon right in the middle of the action. I really didn't know what","useful":2,"cool":1},"5L2S8YnjGN4WrMk7E2okAA":{"text":"This place is GOOOOD.\nWe started off with the gator nachos - which tasted absolutely amazi","useful":0,"cool":0},"LslaFQ1RN89BVKyVChwPqQ":{"text":"I was very disappointed with my experience at Mambo's. I am honestly baffled by the great ","useful":1,"cool":0},"8oOJpLCL7uhSLG_XIMesYQ":{"text":"The service was amazing, atmosphere was beautiful, and most important of all the food was ","useful":0,"cool":0},"PUyH9zRnVZ9x2s5qB242bw":{"text":"Brydika was our server, she was so friendly, and had the best recommendations. The redfish","useful":0,"cool":0},"cKClVT2on19TVL6P0gA6uA":{"text":"Looks can be deceiving!\nService was great.\nThe food on the other hand just simply did not ","useful":1,"cool":0},"axD9I1JHuKWZdrTeaetDfw":{"text":"Wanted some good Cajun/creole food and Mann's was highly rated. Had the Taste of New Orlea","useful":0,"cool":0},"0Yz-IVwyoyq69I-AILQjCQ":{"text":"Good vibes. And the food was great.  The host Isiah had the best customer service in New O","useful":0,"cool":0},"_O-tpnzdA6-FeZmCNerbrg":{"text":"This place is awesome! Everyone was super friendly right from when we walked in the door. ","useful":0,"cool":0},"i-jZVpAUTtqV59Bmo4hWHw":{"text":"Good food. Good location. Great beer and even better service. They allowed us to watch our","useful":0,"cool":0},"kOnsHJ1KZFAzFLFmPiVUng":{"text":"Great food great drinks great energy!!!! Me and a couple friends really enjoyed going here","useful":0,"cool":0},"iRePELEaea7W9VIQHsiNeA":{"text":"Despite being in the heart of Bourbon street, Mambo's is delicious and not a 'tourist trap","useful":4,"cool":1},"-5PUdmyM-DvPnHrnzREzCw":{"text":"I can not say enough about the Gumbo and Pecan Pie!  Holy delicious!!  Would not recommend","useful":0,"cool":0},"NkP-w-JzVKSQkdwocRqNGQ":{"text":"The short manager woman was power tripping I'd been waiting for a place to sit and she leg","useful":1,"cool":0},"ojcgjysrDnl7wCISaLZ9kw":{"text":"OMG soooooooo good. Service and food was on point! Trying oysters and they were delicious!","useful":0,"cool":0},"0Veag2LTSihrNqq6o1ntkw":{"text":"Service mediocre. Waiter never asked our party for another round of drinks, nor didn't ref","useful":0,"cool":0},"OjpRyIaABhy9PReSoPzurQ":{"text":"A great spot for lunch! Everything we got was delicious! My alligator poboy was excellent!","useful":0,"cool":0},"YPErg3Q5kzyyBuiSJsN5Ng":{"text":"We came for the first open day from COVID. Sat on the third floor at the bar with a lovely","useful":0,"cool":0},"VnjDS2vYkMyEIk1vQq9Cnw":{"text":"Amazing service and food! Came out hot and fast. Rooftop bar is wonderful and they have he","useful":0,"cool":0},"e7EYexEwprWVeoq4CcIMTA":{"text":"Killer food- Steven V was as friendly of service as could be! Will definitely be back befo","useful":0,"cool":0},"PQKSRTdFoN_-UmVZkqge9Q":{"text":"Waitress was friendly. Atmosphere was a good vibe. The food came in a decent time manner a","useful":0,"cool":0},"AIPvvfi9LYvj6ub29Nogeg":{"text":"We were in New Orleans for the weekend and had 3 meals here. The food was that amazing! Th","useful":0,"cool":0},"9KATSV5t568S0xzNsZwqoA":{"text":"The service was amazing! Our waiter was extremely attentive and very knowledgeable when it","useful":0,"cool":0},"limYreSlkzCu5xZ7bXikSw":{"text":"Waiters and staff were very nice and helpful. The food was good, though it felt like chain","useful":0,"cool":0},"7veq2neuv5GpN_-k_cNvYQ":{"text":"I downloaded yelp specifically for this review. The food is absolutely amazing and Walter ","useful":0,"cool":0},"SEVkMkpntuIltBodKFYURQ":{"text":"We enjoyed this place.  The line was so long so I suggest that you make a reservation.  We","useful":0,"cool":0},"G58YdlPgwAkSZIeOGTD06g":{"text":"Very slow and unprofessional \nManager was rude, please avoid this place \nHalf of guys got ","useful":0,"cool":0},"XlysNMLK4bybamkV5JlgHw":{"text":"Breanna, our server, was amazing! She made excellent suggestions and was really attentive ","useful":0,"cool":0},"we0gMTR5RwPW4Ip0xiOZCQ":{"text":"Stopped in because we were hungry and wanted to try native foods. Glad we stopped in the f","useful":1,"cool":0},"cmnaXDqfRuKqK1pTp0uLBw":{"text":"This place was ok. For what I paid just ok. I had the spinach dip which was definitely not","useful":0,"cool":0},"okt811HnEKn_rkh2UyDUSA":{"text":"Well WORTH the wait in line! Dajuan at the door recommended the Gator Nachos and they did ","useful":0,"cool":0},"PsJtEftZuapIBo9z32ayXg":{"text":"best oyster we've had yet as someone living here for a year now! Breanno best server ever!","useful":0,"cool":0},"r55gSeqeqYyP50RKCcFbiA":{"text":"Customer service deserves 0 stars. We made a reservation for 12pm. Just to be sure, we sto","useful":0,"cool":0},"qfjeuBx-L3pRhPQfzpiZaA":{"text":"Well, don't try and drive to this place.  I didn't know the area at all and tried to drive","useful":0,"cool":1},"qpZOEEnUImb2Intfuf-onQ":{"text":"Harley is the best bartender, great drinks! Attentive and fast pace environment. We will b","useful":0,"cool":0},"eCsB-z5V9crYTvgjZWepWg":{"text":"Ate there twice on my four day stay in NO. Great service and amazing food. Then crab cakes","useful":0,"cool":0},"ndESSV3Qy1XPTPhLr095Ag":{"text":"This was our first visit to the Big Easy and used recommendations from Yelp and a few othe","useful":0,"cool":0},"hiXtXREgLtskUAt8Dr7DUA":{"text":"My wife and I stopped in during our vacation, very friendly staff and awesome gumbo and dr","useful":0,"cool":0},"WbpARtmr0F9zXOTdKUpvRg":{"text":"I loved loved loved this place. Everything was amazing we had the pleasure of trying the r","useful":0,"cool":0},"m2pH2FlqZkD49WD5jEP9fg":{"text":"We went on oct.28, 2020. There was a hurricane and was one of the few restaurants open. I ","useful":0,"cool":0},"NYR_Qhse17TbP7zFN7ACRw":{"text":"The location was convenient and the service was good. The staff was friendly and efficient","useful":0,"cool":0},"rfXK1vxvNmKpi-6T0ABHWA":{"text":"I had the New Orleans sampler that includes gumbo, red beans and rice, and crawfish etoufe","useful":0,"cool":0},"XdApdqUmc4B_J5Z0ICtw5w":{"text":"This place is a prime location because it's located on the bustling and busy Bourbon St. Y","useful":4,"cool":2},"UjtjxA7S5bzZ-qEFJwMKhg":{"text":"Covid edition:\n\nAfter doing some research on places we wanted to eat while in NOLA, we cam","useful":0,"cool":0},"LZLpi8QGAfPm8GvBupx8iA":{"text":"amethyst is an amazing bartender/ server. she has helped us with any question we have had ","useful":0,"cool":0},"TqMXoP6PS0CZXHCUFWx3Kg":{"text":"Food is an 8/10. Service is 8/10. The wait is 0/10. Waited for 50 minutes while they blast","useful":1,"cool":0},"ipBM1QdX-u3hR9myXpht9w":{"text":"Wanted to make sure we are on Bourbon while visiting. Great spot and play is safe with res","useful":0,"cool":0},"MzqIBdSJwMetO5d452N1bA":{"text":"My girlfriend & I walked the entire length of bourbon street trying to find a restaurant t","useful":0,"cool":0},"Z9AoiuVsgCL9NNJiC1-MKA":{"text":"Good but not great. Has a lot of competition.  Nothing really stands out, food was very go","useful":0,"cool":0},"rQmk2poN23WXjyQ-TmRDhA":{"text":"Get the blackened gator bites, crawfish poutine, and the bbq shrimp and grits. Best shrimp","useful":2,"cool":1},"yehkAfpxV7AmbKhy3GtUnw":{"text":"We had a reservation here and got right in. The waiter was nice but honestly the food was ","useful":0,"cool":0},"Bzpa6NMjoBZUsrNFq_dwwA":{"text":"Fantastic food and service  if you left hungry it was your own fault nachos are fantastic ","useful":0,"cool":0},"MCnSctwoc21rvjl0zMX2xQ":{"text":"The service was out of this world. It was our first stop in New Orleans and we were cravin","useful":0,"cool":0},"IfwCEo-FYIlLdnOL9v8dKA":{"text":"Great good, good location, super friendly staff. We enjoyed the music- early 2000s was roc","useful":0,"cool":2},"ggB-6MRc3ybvWvuMVjkClw":{"text":"I happened to stumble upon this place just walking around and was pleasantly surprised. Th","useful":0,"cool":1},"FCuY6hD6h9jCmCH2HkNizA":{"text":"The service was amazing!! The hostess and the host were so welcoming and our server was aw","useful":0,"cool":0},"mzqTIPSKPu5aECx3rs0oDA":{"text":"One of the newer restaurants & bar right on Bourbon St!\nFirst, the place was immaculate! T","useful":1,"cool":0},"CXM10uDe29bnum-bzn1JoQ":{"text":"My husband I stopped here our first night in New Orleans. We both ordered grilled shrimp p","useful":0,"cool":0},"JpSD5H5x6meGvWMK11iSSg":{"text":"Our first time in New Orleans we had to get authentic creole food. So naturally we came to","useful":1,"cool":3},"-KR6ep5jrdsjjDqVbAehMw":{"text":"Fast service, good food - though super pricy for what you get.  This seems to be the same ","useful":0,"cool":0},"-pHEqA0SISimLlkrRCPJhw":{"text":"We came for the chargrilled oysters and they were pretty average. Gumbo was good. Not a ba","useful":0,"cool":0},"ZUp7sQNuLmE5CmyJqXkCvA":{"text":"First Day in Nola for my 2nd trip I ate at Mambo's because they don't disappoint. Our firs","useful":0,"cool":0},"AIKFbGkESwmiaIKd7_5Zpw":{"text":"The portions are huge and very tasty. I will be back for some more crab cakes. Prices were","useful":0,"cool":0},"Z52AxLgkw3d42L6V0lQbxA":{"text":"My family and I tried mambos last night because of the good reviews- my appetizer was half","useful":0,"cool":0},"tg4K-Z_WicmeinLCc2HOcg":{"text":"This place seemed to always have a long wait so we decided to try it out. We actually didn","useful":0,"cool":0},"kasuYBEYFR6wtbY15YGDbg":{"text":"Food 10/10\nOysters- The best oysters in town! Oh my goodness these were the best I've ever","useful":2,"cool":1},"u_brJIdvZzevJ_AdIVjMSg":{"text":"Wife and I were looking for something to eat, after 9:00 p.m. or so. Because of the pandem","useful":2,"cool":0},"2Cx3dhMTzwncmNbIRaYRKQ":{"text":"Great service and decent food. Not sure that it was worth the hour wait in line in the hea","useful":0,"cool":0},"zcvHiXLxS_Go57Ud0paDQg":{"text":"Make reservations! After we were seated we waited 20 minutes for someone to take our drink","useful":0,"cool":0},"vC-IM4yg5a4t4WCHTP98gg":{"text":"Food was good ! Definitely recommend the crab cakes fried chicken was well cooked. Didn't ","useful":0,"cool":0},"qv8nG8SEXPF50EMLvRBpXA":{"text":"Had a great time!! Fantastic food and great drinks. Imani was incredible and should be pro","useful":0,"cool":0},"Pfk1F_RL7TBl__YmL033Kg":{"text":"I think I died and went to crawfish heaven.  The special  was a crawfish cornbread cake oo","useful":0,"cool":0},"lZ0NDhGHRQv52QrSLyalcg":{"text":"Everything our party ordered was delicious: taste of New Orleans, jambalaya pasta, red bea","useful":0,"cool":0},"elQ-ShjZoEi5bYW5eP86Jg":{"text":"The service, food and drinks were delicious. We tried so many different foods and none fai","useful":0,"cool":0},"5Z7jm0r1P0_dEs9dezTDHQ":{"text":"Our server Lana was a doll and the high point of the night. We'd made reservations for the","useful":0,"cool":0},"ynogHvsRoVaQibaak12Fdw":{"text":"Great Service from Brianna! Best Oysters I've had in NOLA . Take it from me Order a Dozen ","useful":0,"cool":0},"rDVQLXtURpDslWqVTQIPag":{"text":"We are in New Orleans for the weekend, looking for a quick bite to eat , wanted some shrim","useful":0,"cool":0},"Weqzi7Z4tB3Sbi3HqHNOJQ":{"text":"Whoah!! Can I add more stars?  I just had one of tastiest meals of my life here. I ate way","useful":0,"cool":0},"SYzQcVS0AtXz5cwRnQgkkw":{"text":"Great food and atmosphere had the taste New Orleans and it was amazing, good flavors loved","useful":0,"cool":0},"_79tzYLZHHn-hf7A9xeKNg":{"text":"It's a nice restaurant, but on the pricey side. The second floor is more favorable if you'","useful":0,"cool":0},"kSPhswcj0j8HEyvN6TF9Qg":{"text":"Awesome service, Awesome food. Try the taste of New Orleans-cup of Red beans & Rice, Jamba","useful":0,"cool":0},"ypXQ2btYcvSb0otq9TH1yQ":{"text":"Great food and view. Didn't even feel like we were on Bourbon Street!Overall good experien","useful":0,"cool":0},"W3l7qKE8v6jJGIckwWPl5g":{"text":"Hush puppies were bad had to be sent back overall the food was just ok. Our sever was good","useful":0,"cool":0},"A6RvHPFNsmgQo-FtR__eNg":{"text":"We had a short list of dinner options for the day we arrived in New Orleans. It was around","useful":0,"cool":0},"RHHnNnv-0zdNAP9Gc6ejuQ":{"text":"Definitely a touristy restaurant. Wish I could say it was amazing but it was just OK. Ther","useful":0,"cool":0},"_wpWBUwFNsGSKKcubZ_AXA":{"text":"One of my favorite places of New Orleans! I come here for lunch, dinner or even if the lin","useful":1,"cool":0},"DLjNuFtva6BlSh0g9-jBhw":{"text":"I had been planning to come here since I booked my trip. The host was nice and helped us s","useful":0,"cool":0},"u-JifAqKtje3TsDj6k6g1g":{"text":"Tasty meal. Other than the minor blunder of forgetting the appetizer, the meal was an eigh","useful":0,"cool":0},"UQVEVrJlgBj7B-5CduoMrA":{"text":"Pros:\n\n*Really tasty food - they allowed us to split the alligator bites app into 1/2 blac","useful":0,"cool":0},"YXM0TNQTgzAMh8hzE0qd5w":{"text":"I walked into this place off the strip, they people were nice to me. The food was amazing ","useful":0,"cool":0},"tKflPvtElJ2pU-ov1KHq4Q":{"text":"This past weekend, I visited NO with my best friend and this was the first restaurant we w","useful":0,"cool":0},"0VjyuEk1wsKyKPTL08uOIQ":{"text":"We had a late dinner at Mambos due to our flight being delayed and arriving after most res","useful":0,"cool":0},"Q26zXutTSIl2gOCVE9C4xw":{"text":"Mambos was great to eat at tonight. Man out front and our waiter was awesome. Friendly and","useful":1,"cool":0},"7prab6wT3mDpENHOUfqanw":{"text":"All of the dishes were delicious. Honestly, once I saw the food I forgot to even take a pi","useful":0,"cool":0},"fH0T-8q4MzkVrequzpXqzg":{"text":"Mambos gets a 5 star for food and service. The Mambo Oysters were amazing and the pasta wa","useful":0,"cool":0},"yfKRiN33xh1GTQG2dMX3VA":{"text":"While Acme and Felix will have lines, we had no trouble getting a table on a Saturday nigh","useful":0,"cool":0},"wZhCzoBx3RaVRObOt0ePgg":{"text":"The first restaurant I had in Nola and no one compared, the charred oysters were a amazing","useful":0,"cool":0},"QhQ4XclYBV2uAmcGibie4Q":{"text":"We stopped in during COVID-19 (December) while visiting NO on our cross country road trip.","useful":5,"cool":2},"xmfGcsM0sBxxoFPRJeg8Lg":{"text":"This food was so delicious. It's always busy so we did stand in line for up to 45 minutes,","useful":0,"cool":0},"iZReXT5PfoZC1lao7XFYWw":{"text":"We decided to come here based on the reviews but were sorely disappointed in the food. The","useful":0,"cool":0},"iXUvw5WZ5xLLmWxmsRC54Q":{"text":"We had the crab cakes and jambalaya past...both were delicious...we also had the brownie w","useful":0,"cool":0},"54iw_4ybXhmeZ7Xf_4g8Xw":{"text":"Very poor customer service for the price!! The manager could care less!! I'll never eat th","useful":1,"cool":0},"W9TdnbN0eEf-CGoNz805vg":{"text":"As a 1st time visitor to NOLA Mambo's service (friendly and welcoming) and food was fantas","useful":0,"cool":0},"d0Jt5rSGhJgKHYV7kNYNVg":{"text":"It was ok, I didn't think the gumbo was that good at all. I thought the house salad was pl","useful":21,"cool":12},"TcqMEOY4OqYOZWRg2F7uoQ":{"text":"The food was good, waitress Ashliegh was very nice and welcoming. Ashliegh recommended mea","useful":0,"cool":0},"uthbAzmT9ssvQqGdqQteig":{"text":"Wow! What can I say?  Food is amazing (allbeit expensive) .  Ate dinner with my wife and s","useful":0,"cool":0},"3cdkQUHOffyad1pObukoZA":{"text":"We had the buffalo chicken poBoy and the blackened red fish , both were delicious ! We top","useful":0,"cool":0},"D9OcLH75Ey1CXSbln3VdMA":{"text":"the food was incredible and the drinks were sensational! Glenn was our server and he made ","useful":0,"cool":0},"8iDlWz1zC6J-GfelclV5JQ":{"text":"Based on the reviews from Yelp we decided to try this place and walk past many other resta","useful":0,"cool":0},"mhbKKWgzZXQZ-8xnbIts3w":{"text":"Mambo's was great! I had the special which was blackened catfish covered in a creamy sauce","useful":0,"cool":0},"CySJAdn5-vKuPTi6HwyaJQ":{"text":"Don't let the look or location deceive you, this is top notch food! We had the mambo oyste","useful":0,"cool":0},"-lYrEswGZIAxvcY1NaISrw":{"text":"Ordered delivery. Burger we ordered medium arrived practically raw. Poutine was cheese fri","useful":0,"cool":0},"U0iAjT94mV-1NgbheL_vRA":{"text":"This place gets 4 stars cause the oysters were hooked up but they were very grainy.  veget","useful":0,"cool":0},"-P7rsxJSpMCHWxpE3yVpyw":{"text":"I visited Mambos 12/3/20 on a road trip from Nashville out west, just wanted to say my ser","useful":0,"cool":0},"wPNxmYlm3GyTA0o0naMhBg":{"text":"The guy at the front was super nice and talkative which kept us entertained while we were ","useful":0,"cool":0},"r7F-JY593HUdjhcCUJiVVQ":{"text":"HOLY HECK! This was so good. Ignore the fact that there's a line coming out the door, we b","useful":0,"cool":0},"Q7MCFR5pZ0z6pZiTj0eflA":{"text":"Good food, great service, okay cocktail. \n\nOur server was fantastic. Very responsive and h","useful":0,"cool":0},"vz82Dui6ELaJVn4E8YD4sQ":{"text":"Delicious food, especially the oysters! Service was excellent, you'll be in good hands.","useful":0,"cool":0},"FK80Tq7ObUSJ5wLsCZAF8A":{"text":"Had the oysters and gumbo, very tasty!! Servers Sarah and Sam were great, will be back!!","useful":0,"cool":0},"JDZNNg7OAIA3EnPkEAkwOw":{"text":"The food was great and enough for 2 people with a little left over. The waitress was very ","useful":1,"cool":1},"NNXifiliN35eAKHMPvAg8g":{"text":"We stopped in for a bite to eat and were pleasantly surprised by how delicious the food wa","useful":0,"cool":0},"I42-_97BUv2ZHLuqRDAHnQ":{"text":"Amazing food, incredible staff!  Fast, friendly and delicious. Ask for glen, get the red b","useful":0,"cool":0},"IR6V62Qg1nRAeXZKn3v6HA":{"text":"Terrible. Told us it would be at most a 15 minute wait to be seated. It was about 45 minut","useful":0,"cool":0},"hK2auWQmhY9Gbwxcso89yQ":{"text":"Over all not that great of a place. The service was good, but all of the food was extremel","useful":0,"cool":0},"ZI5oUot9wydFtHjIiJ_l7Q":{"text":"Absolutely LOVED this place! The shrimp po boy and red beans and rice were to die for!! Al","useful":0,"cool":0},"2jjCUsQNCcGge-2zqvWZ8g":{"text":"During COVID, we were seated immediately, social distancing is practiced. The Mambo oyster","useful":1,"cool":1},"LW2zXIhS6RSiKSWy1x-JIg":{"text":"We had Mambo Oysters & Rockefeller Oysters.  It was my first time trying oysters & im now ","useful":0,"cool":0},"8_0ZVGw1mBa99kz26jtCFw":{"text":"The bread pudding is out of this world! The caramel sauce really takes the dish over the t","useful":3,"cool":2},"Pw0P-FrrY4DjBn-iGFBWxg":{"text":"Fresh, hot plates! And the catfish..... oooooweeeee! I love when the cooks serve the food ","useful":0,"cool":0},"9NtmYk8ZpGbSuKqRcUaQsQ":{"text":"Not worth the wait. Oysters are really just broiled toppings, tap beer was flat. 80 $ for ","useful":0,"cool":0},"TDKy4FbRWlGlqQ6C1IqUCg":{"text":"This was mine and my mother's first time eating NOLA food since it was our first time EVER","useful":0,"cool":0},"0UnamjPyHTJnLl3sEG6e0w":{"text":"Mambos was an amazing experience! It was my first time and the food was amazing !! I had t","useful":0,"cool":0},"YbOhMUtupjGIB2xYzGWvXQ":{"text":"Awesome food and nice view on the roof top \nAka gator dumplings were very good \nGumbo was ","useful":0,"cool":0},"HAsXhcm6q1NZfYzCtYzkOQ":{"text":"The staff graciously accommodated a group of 17 (including 9 teenagers) at a moment's noti","useful":0,"cool":0},"Kn7FGTmkL-Idbc-9d6B4xQ":{"text":"Great food. Our server Chris was awesome! I highly recommend. I had the crab cake pasta, v","useful":0,"cool":0},"CKwJ-AYYQKYM7fisj3WmbA":{"text":"The alligator and crawfish nachos were the best nachos I've ever had. The duck wontons wer","useful":0,"cool":0},"RmFP11n0yBq86kbLDmPI7w":{"text":"Ordered the fried shrimp po boy sandwich & it was delicious! Also ordered the pecan bourbo","useful":0,"cool":1},"wUK_QLEDejcmJwVEsSe6UQ":{"text":"Was walking Bourbon St looking for a place to enjoy a Po Boy when came across Mambo's. Saw","useful":2,"cool":2},"O03Uxpyhm9js9EWJVL2s_Q":{"text":"Oh my goodness!!! This place is fabulous!!!! The service on the third floor was top notch.","useful":0,"cool":0},"27lepDZBQNN52QKFZXpaDA":{"text":"We really enjoyed your food\n\nThe service was very good\n\nLooking forward to our next time f","useful":0,"cool":0},"iUZB35_ErdJBRveuyN4gWA":{"text":"Monday, April 12, 2021 I visited the EXTRAORDINARY MAMBO'S Restaurant. My server was my no","useful":4,"cool":2},"SKTrhQjWU6V349_8GJsMkw":{"text":"The jambalaya pasta is awesome.  The sauce is a tomato base marinara with ground alligator","useful":0,"cool":0},"Th9005xPFYz4ZO2IAXFF6w":{"text":"Great atmosphere. Best food on Bourbon St. Rooftop bar. Excellent service. Love this place","useful":1,"cool":1},"y8xf0L453kblYEiV8M_csQ":{"text":"Love that chicken at Popeyes.......and their sides way much better than this place.  Spend","useful":0,"cool":0},"B0prmkYEJimkqCpCtE5zRg":{"text":"First meal in NOLA was a great experience! Food was really good. I ordered the Bucktown Pl","useful":0,"cool":0},"0nLqf7YkbvWaAZjINQXHXA":{"text":"I had the crab cakes and BBQ Shrimp and Grits. Both items were underwhelming. The crab cak","useful":0,"cool":0},"gkhzMnzWCXVH_3zK28OH8Q":{"text":"Everything was great! The food was outstanding *chef's kiss*, the drinks were amazing! The","useful":0,"cool":0},"Xxesf_m6jgwJjkFgrkWLSA":{"text":"The food met every expectation for food from New Orleans.  Ashleigh was our server and she","useful":0,"cool":0},"8sQPKxlu6eqMlRr_HWT-rg":{"text":"This place had an amazing vibe. The rooftop bar has great views down Bourbon Street. The f","useful":0,"cool":0},"ra3ocd8-s7fMD605frVWrQ":{"text":"So I'm from Miamj and was here for a quick trip. I had a great waitress I don't remember h","useful":0,"cool":0},"eMx-IC8Lggx2HXTkNP44iQ":{"text":"We split the creole sampler,  it was delicious! $20 to try their red beans and rice, crawf","useful":1,"cool":1},"xRFdiK-P-dq9Wbaxw8hTIg":{"text":"This is the best Cajun food in the whole quarter. Period. Went twice got the shrimp po boy","useful":0,"cool":0},"6vN3lVzb4GiMme6K2GbZmA":{"text":"The food was amazing. And our server Leah was the best girl! I was talking to her about br","useful":1,"cool":0},"gufpHmEMTp_SVDcoxXBXGg":{"text":"Food:  Crawfish poutin and Gumbo starters are a must!  Blackened shrimp po boy and fried o","useful":0,"cool":0},"odOXgHyIfS3RYq6X-TuvNQ":{"text":"One of those restaurants that several people recommended we go. It did not disappoint at a","useful":5,"cool":5},"oc9viDiZXdXqRNBRRwp1Dg":{"text":"Don't let the location fool you. This place was great! I got mambo oysters and bbq shrimp ","useful":0,"cool":0},"JlKv45Wsbf-TWnKZEOGPkw":{"text":"This was the home of the best food I ate in New Orleans!\n\nWe started with the signature dr","useful":5,"cool":2},"w0TxlSmlkhwSzXUsFtrLjw":{"text":"Recently dined here after a short trip to New Orleans. The waitress was very friendly and ","useful":0,"cool":0},"nAgK4pjDCeL1LK2X0BWp0w":{"text":"Open during COVID. The best part of the visit was the great customer service.  The staff h","useful":0,"cool":0},"LfDfUfyFJa1cep3RbwAdnw":{"text":"This was on my list for NOLA and we ended up walking by as we were checking out bourbon st","useful":0,"cool":0},"8D-RE6kCzOMev4JAhxyxzg":{"text":"Excellent \nThere are thousands of places to eat and we ate there 2x. \nWe had the chicken A","useful":0,"cool":0},"ygvyXTK8UN6JwWs4zfzy1A":{"text":"Great stop. The house Sangria was fantastic and both the fried and blackened Alligator wer","useful":0,"cool":0},"3LvIbOhkbYlBiKYBKAI9WQ":{"text":"Wednesday afternoon on a rooftop in New Orleans..not too many other places I'd rather be. ","useful":0,"cool":0},"Ei-fCGflTFBD6Fh_hWtOaQ":{"text":"Loved the food, Rasheeda was a great waitress! Kept it real and guided us in great food ch","useful":0,"cool":0},"XYlrHf2HoA9VRJ4jD7wG8A":{"text":"I was drawn in by the rooftop dining, but unfortunately there was a private party.  I was ","useful":0,"cool":0},"KsXOLGrpfq6hq10LSCgIEw":{"text":"Best. Spot. On. Bourbon. Rooftop view is breathtaking. The menu is real \"Nawlins\" fare. If","useful":1,"cool":1},"DRrIVnBBRigHPjMU5Xj6nQ":{"text":"This was my first time here and it was great. The food was amazing and the service was out","useful":0,"cool":0},"q35bBfKogo_K6yzDZJ0oJw":{"text":"We selected Mambo's because we wanted to try some classic Cajun/Creole food- with a vegeta","useful":0,"cool":0},"bmoAWdOdw7sK_xkd9gYXUQ":{"text":"Made reservations on Saturday night after waiting in line at Acme oyster bar and Redfish o","useful":0,"cool":0},"xupq4o8exqa8oRo8byWKHw":{"text":"Great food... Great waitress... She was super friendly and very prompt service... crab pas","useful":0,"cool":0},"D9gPB6UetWvHnV2BsRqjGw":{"text":"Went for lunch today. We sat upstairs inside and were helped by a very gracious hard worki","useful":2,"cool":0},"Z2yF3TcEKLiuSn1bnxYePg":{"text":"Me and my baby bro came to celebrate a milestone and accomplishment for him, we are locals","useful":1,"cool":0},"fuZ8JRrrAJzw_j6-a8UNWQ":{"text":"Went there last night. This is clearly a tourist restaurant and not meant for locals or in","useful":0,"cool":0},"AxazVn_GZYyZUBetdG9grA":{"text":"Smoothest cheesecake ever!  Redfish entrees were delish!  We were impressed with the clean","useful":0,"cool":1},"e4jqHQM76MgRhbOFpa8a0w":{"text":"This was the best experience thus far in New Orleans. I asked if we could have a rooftop t","useful":0,"cool":0},"PuhCzA4E7J9azxBKkDL2Pg":{"text":"The staff was very friendly. We were greeted with a smile and service was prompt. The atmo","useful":0,"cool":0},"eo4QJBXBUSEVkFll_G5-eQ":{"text":"Delicious food, great service. I had the fried shrimp po'boy while my sister had the Cajun","useful":0,"cool":0},"Scyn_3KrjwlOnZYlv8V4Ew":{"text":"Chicken and sausage gumbo is not chicken and sausage gumbo.  It's chicken and sausage with","useful":0,"cool":0},"RHmYYVP5h06SHQiXZmX0sA":{"text":"Brooke was amazing. We went in to have lunch before Hurricane Zeta. The food was DELICIOUS","useful":0,"cool":0},"UEUeDnw2MzeyFtROXchEPQ":{"text":"The food is meh. Restaurant is aesthetically pleasing, but other than that not super impre","useful":0,"cool":0},"sV7DXZccpRCOfQlwDAs1wA":{"text":"I was skeptical about visiting Mambo's or any restaurant within the French Quarter.  I'm h","useful":0,"cool":1},"nfsCySqm3salmt3H-c9zHA":{"text":"So on our day long exploration of bourbon street this spot came highly reviewed by multipl","useful":1,"cool":1},"8mT2RBeqK7PtEMNNkIYoKw":{"text":"This is a place where I don't understand the 5 star rating.  Maybe is a tourist thing?  We","useful":2,"cool":0},"kROZHj-a3VKESM2YjrrbJg":{"text":"I made a order from this location I was disappointed The food was cold this was a big mist","useful":0,"cool":0},"R65PdXmEWJ28YkxxqlgKzA":{"text":"I had an amazing time at Mambo's. Amethyst was my bartender/server. She was very familiar ","useful":0,"cool":0},"1L1ev0kppC5r0owdC2YXmQ":{"text":"Ordered this via uber eats. My first time ordering from this place. I was staying in a dow","useful":1,"cool":0},"AF4kgMVC4PH4dZg78YTAyw":{"text":"Came into town for one night for part 2 of our honeymoon and decided to come here based on","useful":0,"cool":0},"8K9Nd0-f9joDjqj4YPJDqw":{"text":"Awesome Crab cakes appetizer and the Mardi Gras Catfish special was superb! Great place to","useful":0,"cool":0},"r2rsD9lnXX_inOjhCqsE-w":{"text":"Excellent food. The red fish was phenomenal. Ate in the back outdoor court. Worth the extr","useful":0,"cool":0},"Mgcqt-KmOy0p9a6-RLMw_Q":{"text":"Delicious oysters we tried 3 different kind and they were all tasty. The service was nice ","useful":0,"cool":0},"X6s86-XyxTC1Kw2FXR0_-g":{"text":"I came here on Veterans Day and was blown away by the wonderful staff and delicious food I","useful":1,"cool":1},"ksuG-M1RmtoWMoOepXDT1g":{"text":"Best chargrilled oysters in New Orleans! It comes to your table sizzling. I drove in throu","useful":0,"cool":0},"Qoy8DzmgvPG-YOzFt62cIA":{"text":"Place was amazing, staff - especially Walter -  is reason enough to come back. Redfish was","useful":0,"cool":0},"rtriUzHLumBDfn-4IKurJg":{"text":"came for the rooftop dining. it was nice. and they have heaters which was very great durin","useful":0,"cool":0},"CMgMPjoKRXcjJCCQLXC4UQ":{"text":"Enjoyed this gem on our recent trip to New Orleans. On our first visit (yes we were here t","useful":1,"cool":0},"zNM6XGBmYxkWou1xzkvETw":{"text":"So good. Sat at the bar. Red beans and rice with crispy chicken was great. Shrimp po boy w","useful":0,"cool":0},"_he-VDTvekCJHli9MGchDQ":{"text":"We came here based on the reviews we saw...   Our waiter was ok. The oysters were great...","useful":3,"cool":0},"-BmeMwuVkFET4XkW-re8fg":{"text":"I was a little disappointed in the quality of food for the price I paid.  I ordered the ne","useful":1,"cool":0},"1WblX-BuzOWBwBGgI2A-vg":{"text":"Delicious food great menu and atmosphere. The s alligator, fried oysters, gumbo were soo g","useful":0,"cool":0},"XZ_mQlFnosfnbjqzgSAcgg":{"text":"My wife and I went to Mambo's as a first stop when we arrived in New Orleans. We made rese","useful":0,"cool":0},"Ihf32Zco8CUAIWgV-F9JUQ":{"text":"Mambos is amazing. We came here twice during our 4 day stay in NOLA as we were staying clo","useful":0,"cool":0},"Ckm_ATDEZWgYeJDPIbpLDQ":{"text":"Honestly, this wasn't my best experience. The service was slow and the food was just \"meh\"","useful":2,"cool":0},"ybRyNpOTo7jgddQOYhKgyw":{"text":"I've never needed a nap so bad. Look at this!!! Very fun atmosphere and great service! The","useful":1,"cool":1},"-OaAajL0xhmien-4anHw5A":{"text":"Amazing food and a service. Christina was incredibly amazing!!! We look forward to coming ","useful":0,"cool":0},"nFzhUlZ97qcPlwqPdeonZg":{"text":"Great Marti Gras special, crawfish ettufe on cornnbread fried fish on top...delicious.   L","useful":0,"cool":0},"GWADSgfwRziVR7L5UIDIqA":{"text":"This restaurant is excellent! We wanted to try it because of the high ratings on Yelp, and","useful":0,"cool":0},"_FJ6nV6jLLUi7wmTkeyvdg":{"text":"Best fried oysters and seasoned shrimp! Would definitely go here again. Tip: check in on t","useful":0,"cool":0},"Dpy4Tq0cywl2SJeYL5sdVg":{"text":"Whenever I am in town for shoot, Mambo's is the first place I stop. The food is the best. ","useful":0,"cool":0},"Whth1HdBA-N0EClcPRLrkg":{"text":"Absolutely worth the wait! Clean with friendly attentive staff! Everything was absolutely ","useful":0,"cool":0},"gPOeX8vTpNmPwsiOn6FFYA":{"text":"The food was good, the wait was over 2 hours. But it was worth it. They had a new item on ","useful":0,"cool":0},"5Bew5QDcRSfgUWTPl-oipQ":{"text":"My boyfriend and I  swung by for the second time this week...open for business even with a","useful":2,"cool":0},"VHOIrnccHvzea1XGNs89-A":{"text":"The service was great. Thanks Ashley! The blackened redfish was really good. Will be back!","useful":0,"cool":0},"_dkPrzSshFDr0ad8KSpanA":{"text":"My fiancé and I had a great time here ! We had the waitress, Whitney and she was excellent","useful":0,"cool":0},"3c3QxYlf_uARZDvX8D8XtA":{"text":"We give this restaurant a 4/5 as I think it is more hype than it really is. Food was good,","useful":0,"cool":0},"VGlsYaiF8o7rnoQOWKXQZg":{"text":"While the food here is decent, honestly is not worth standing in a long for more than 5 mi","useful":0,"cool":0},"z2LUc62Aje8qpLstxYrJDQ":{"text":"I have visited NOLA many times just for the food. Mambo's was an unexpected find!\n\nWe orig","useful":2,"cool":0},"q2r5jn2-b7XcjFp_6PGCPw":{"text":"Fabulous New Orleans food. Ordered the \"taste of New Orleans \" delivered. Absolutely delic","useful":0,"cool":0},"LsgaRSgDJPPWiC0TT1KcHQ":{"text":"So glad we found this place! We were out and about and realized it was getting late and we","useful":0,"cool":1},"bNLyyAFhNRomD2ErLCm6Sg":{"text":"WOW!! \nBlackened redfish Lafourche is to die for!!!! Just SO amazing! \nOur server (Johnell","useful":0,"cool":0},"MaJwtMJLpgt3unT99cGWag":{"text":"Was worried it would be a tourist trap but the food was excellent. The host on the door wa","useful":0,"cool":1},"zspO-KF2qyQKRWxpYeZ_Xg":{"text":"Tried the crab cake and the Taste of New Orleans, it is definitely one of the best places ","useful":0,"cool":0},"cHo-9nKtjzBCW4O6MCRTUg":{"text":"Ordered the TasTe of New Orleans for delivery.  Came wrapped well and still hot.  Was exac","useful":0,"cool":0},"4ockOziVo6Q3W-TFrhw4EQ":{"text":"Ratings\nFood 1/10\nStaff/Service 7/10\n\nThis place was terrible.  Save your money and go som","useful":0,"cool":0},"9vxLGT4f7lOisn7RzAjbZg":{"text":"The food was delicious and the atmosphere was calm and inviting. We sat by the door so we ","useful":0,"cool":0},"XVLckENOByQeTc9iZaw8Dw":{"text":"Oh Gawwddddd, Fabulous food! Ordered a fried fish PO Boy and Shrimp appetizer. The deliver","useful":3,"cool":0},"Fub5RU8YRQlIEl5y1hUoxg":{"text":"Terrible food but we had a nice waitress. The only reason this place is still in business ","useful":0,"cool":0},"GWGQc3uGPTFlOzJmejv1sQ":{"text":"Can you beat Happy Hour Oysters at $1 each served either raw, Rockefeller or Mambo's Famou","useful":0,"cool":0},"ZU_DNjpN7DKcdXvxiczJuQ":{"text":"Decent. Sat at the bar. Service little slow at times. You can see them grill the clams on ","useful":0,"cool":0},"angtUwqLoOXaXb2BLx7uLw":{"text":"my boyfriend and i choose this place on a whim, restaurants in NOLA close early so it's so","useful":0,"cool":0},"RNP2NEH84PmbaS4PqFupAA":{"text":"Mambo's is Trip Advisor's #1 restaurant in New Orleans. Regrettably, our experience there ","useful":0,"cool":0},"FAzCm3UToR8rSW4921qE5w":{"text":"I came in at the perfect time because there was a line forming when I left. I sat at the b","useful":1,"cool":1},"PYMubqUcGNJtYL1lTeXYIQ":{"text":"Mambo' food was out of this world! Our server Devon also gets 5 stars as well. Great atmos","useful":0,"cool":0},"4Rn-rqY6yaqlJBUdKsunfA":{"text":"Great food and service. We were there mid afternoon and the place was busy but the wait wa","useful":0,"cool":0},"lNuqZqpOsFvMd4k8e3HMog":{"text":"This place is fantastic. Everything here that I tried was delicious. My mom and I shared t","useful":0,"cool":0},"6fldPW70Kfy6kWyu42FRMQ":{"text":"We had the gator bites and seafood platter..delicious!! Very flavorful and not greasy at a","useful":1,"cool":2},"Xf3Q44HjgGuI3Of3fPqijg":{"text":"Just visited tonight, during Covid. The food was delicious. We ordered the crab cakes, all","useful":0,"cool":0},"4nGQNtRHcTrlmxKfLzV_9w":{"text":"Mambos was a great dinner spot on the touristy Bourbon street. Get the crab cakes for appe","useful":0,"cool":0},"HCiHPWloIWQjmO5_B2a9Qg":{"text":"This food was amazing. I literally cleaned my plate. It met all the expectations I had for","useful":0,"cool":0},"kEqQG6S53sStvcZiBuUCqg":{"text":"This food was absolutely AMAZING!! I'd drive down here just for it. Do yourself a favor an","useful":0,"cool":0},"97y1xElUlkI8wTH3K2naKA":{"text":"The hostess was very nice and patient. The restaurant really could be more efficient thoug","useful":0,"cool":0},"i9MwPjttDYKe8q921aLnzA":{"text":"So damn good! The oyster Rockafella were Devine ! I also got the crispy chicken and red be","useful":0,"cool":0},"fDYSxvUgu7CvYtrQXNN8dg":{"text":"Had an blackened alligator po boy. It was pretty good. Had a nice side salad. \n\nService wa","useful":1,"cool":0},"sKURq7b4ih5gEUCDFvwPtA":{"text":"did not disappoint at all, i ordered the shrimp platter and i was surprised how big it was","useful":0,"cool":0},"TrUw-A_qxrvPIciuthZKbA":{"text":"Loved it. Impeccable customer service and pleasant atmosphere! Probably best place so far ","useful":0,"cool":0},"tarVP8sESa8xZVozOVKDLQ":{"text":"2nd time visiting. Best grilled oysters I've ever had. They had great happy hour deals on ","useful":0,"cool":0},"T6NNLyF22gnbYxEpVKinaQ":{"text":"This is a cute place. The food is good but not my favorite. We got the blackened redfish a","useful":0,"cool":0},"avuOP9Iw-XU9nIZnfC3Eqg":{"text":"Don't miss this gem!! Right on Bourbon street (with rooftop dinning) but we sat street lev","useful":0,"cool":0},"19b6AnkTOiunZLB2s1Ks8Q":{"text":"If I were to have written this review on Friday night 8/21 I would have given 5 stars the ","useful":0,"cool":0},"Xw0haW1mjts6COP6zJCqUQ":{"text":"Went to Mambo's because they were open late and located on Bourbon Street. It was a welcom","useful":0,"cool":0},"J7lATAz94PSj_TBOcmsS0A":{"text":"This spot had amazing food and drinks. We had the hurricane and it was strong (in the best","useful":0,"cool":0},"n5h-8Q3u_iL6NFe6uwgBXA":{"text":"Very disappointing....bad cocktails, Luke warm food and expensive for what it is...walked ","useful":0,"cool":0},"1YFCtQrkzveUT-ZvrbGP4A":{"text":"Mambo's Famous Oysters were incredible, the alligator nachos are like amazing chicken nach","useful":0,"cool":0},"3nEA8svr3vTLoG--5M_t8A":{"text":"Good food, tasty drinks. We always appreciate good customer service. Thank you Breanna for","useful":0,"cool":0},"ptYhgn671OaBQeYHqINU4w":{"text":"GET THE CRAB CAKE PASTA.\n\n\n\nThank you Darriel for the recommendation and great service! Ev","useful":3,"cool":2},"PzWQZVsHuJPoUWkpjQeXYA":{"text":"Mambo's was pretty good, but not sure it was worth the hour long wait in line outside. Be ","useful":1,"cool":0},"UMWfEfXl9OlXFv6guuWOXw":{"text":"This spot is a must stop! Open late, great staff, and GREAT FOOD! Our waiter, Walter, jazz","useful":0,"cool":0},"1Jggyh63vHjqCVpoy7LLWQ":{"text":"We were staying down the street and decided to try out this place! It really was delicious","useful":0,"cool":0},"eoFcoOU-7oDHDgKO2j_4vQ":{"text":"Food was great. The waitress (Melanie) was super helpful and recommended great drinks. Tha","useful":0,"cool":0},"IiG-h4PrbYY61H2Bh8KqSg":{"text":"Drinks were great! Had the Royal Flush (amazing). Food was also good! The collard greens w","useful":0,"cool":0},"kxX6JNx9KxcXwItvz5gQ1g":{"text":"All I can say is WOW. While searching for a place to eat on our last night in New Orleans ","useful":20,"cool":18},"GEeJQpfxhguSCZyCi4rWvw":{"text":"Been to New Orleans several times but have never eaten here, what a mistake! We were seate","useful":0,"cool":0},"fDfD7SNcqZV7TitP1ecwHg":{"text":"Ashleigh was very good and attentive! Her suggestion were spot on.  \nThe food was really g","useful":3,"cool":1},"RdlgyCTSnqw0vu7vjpDkbg":{"text":"Went to the late night spot in New Orleans for drinks, a view and food. There's two levels","useful":1,"cool":1},"IAKG6th-_i9iN9o2oaTtTQ":{"text":"Spent the best afternoon here in the courtyard. We had many cocktails (all delicious), the","useful":0,"cool":0},"su_huSJd4TA1Mk-GDtw0bg":{"text":"We were told this was a place to go and we were not dIsappointed. Our server, Christina, w","useful":0,"cool":0},"aoxZNkhsHoj7wLjMP-KLRw":{"text":"If you're reading this review please be aware there are so many better places to eat in Ne","useful":0,"cool":0},"ziqsNCZvxout4NP_lK_1XQ":{"text":"We ate here yesterday night and it was awesome! There was a short wait but they brought fr","useful":0,"cool":0},"8w2q99Z0Zzd4inymc1stzg":{"text":"It was so delicious and their staff was hella friendly. Such Southern charm very kind.... ","useful":0,"cool":0},"8h1uf8F-Oss_3eGbBEOcPg":{"text":"We loved this place for great Cajun food on Bourbon street. Our server Waldasia was super ","useful":0,"cool":0},"wJiIcv-sToIPKDMKY8K_aA":{"text":"Went for the positive reviews but left disappointed with the portion sizes, prices and ove","useful":0,"cool":0},"g1vUTQX7JWIXyn-IDKKRiw":{"text":"My sister and o was doing a taste of the French Quarter's, when we stumbled upon Mombo's. ","useful":0,"cool":0},"ItV1nFWUTm2NQUmXpQMnzA":{"text":"The food was exceptional. Their redfish dishes are very well done. The Mambo's grilled oys","useful":0,"cool":0},"hPUStJve2VVIqP1oD_Ykyw":{"text":"We had an 8:30 reservation but arrived about 30 minutes early. However, we were seated wit","useful":0,"cool":0},"FjzWlBz8d-98cEp-yLc1HA":{"text":"Service was friendly and accommodating. Our waitress Maddie was excellent, she had great s","useful":0,"cool":0},"-9E_3VmXcFa5WSu_niyCVg":{"text":"Was great!!! Owner made sure we got to our seats....very welcoming even though masks were ","useful":0,"cool":0},"f4g_rFnYn6BDQsLZ-uby7A":{"text":"Ordered a shrimp po boy, got chicken. Simple misunderstanding and asked to switch it out. ","useful":3,"cool":0},"O4rPUfbyWkdYcDQGVvI4RA":{"text":"Pros: the line went quick! Great spot to people watch & enjoy the performers while you wai","useful":0,"cool":0},"MKxr6H9OB7Ux2kVraLsqcQ":{"text":"Had their Mambo Oysters special and was good. Thankfully sad outside on the patio enjoying","useful":0,"cool":0},"724YCQxmy66f2dQku2ZK5A":{"text":"Fantastic food, an excellent place to try traditional New Orleans food. I recommend the Ta","useful":0,"cool":1},"JRT3WM92DgcyU69Y0uSRdg":{"text":"WE had a great time at Mambo's! Felicia B. was our server and she was GREAT! Very helpful ","useful":0,"cool":0},"NLG0awftGvgelCk8LNRAaA":{"text":"David was a great server and took good care of our large party. Great roof top bar. Great ","useful":0,"cool":0},"uXOUcMlPVhk5gKFHAEEb9A":{"text":"Ashley was our server and she gave us the most amazing recommendations. She did a passion ","useful":0,"cool":0},"fYHCMu0FDNTMEn26jqhCUQ":{"text":"Definitely a must try!! We had the duck wontons for our app and they were so good! Very te","useful":0,"cool":2},"R-9Hs04cEk3b3AhgECTCBg":{"text":"This place is incredibly a good restaurant. Service was great that's a plus . Fresh seafoo","useful":0,"cool":0},"vIv-My37pJ0cylJYjZenBw":{"text":"The best pasta!! Service was fantastic as you can imagine how busy it was our server was v","useful":0,"cool":0},"QfgflLeKMfDVCspXbo9Rgg":{"text":"Service was Good, certainly not a place to stand in line. Food here is just food. I had a ","useful":0,"cool":0},"hBxKx76pytsvXZoZJl5SkA":{"text":"Always love it when our server recommends something tasty. Ponce did not disappoint with t","useful":1,"cool":0},"jSeQAE3E1Zr0RIUJApeQpg":{"text":"Everything we order was so good! Hubby doesn't like bread pudding but really enjoy this on","useful":0,"cool":0},"V-6BbW7pQ6keErjn1vvB0g":{"text":"The food was mediocre and wasn't worth waiting 40 minutes in line for. I sat on the balcon","useful":0,"cool":0},"OwgXgK9n06v8pTcnjl_5NQ":{"text":"The flavor of these dishes were great. The etoufee had a lot of substance to it however th","useful":1,"cool":0},"3oFPuorNIvHVYzycBhmfdQ":{"text":"The gumbo here is delicious. I've never eaten gumbo but now I'm addicted!!! The service he","useful":0,"cool":0},"bJHNjNR_-IsiobRLyPdb2Q":{"text":"Service was slow, but we forgave it after getting our food!! I think they'll speed up as t","useful":0,"cool":0},"bPE_OjIRIKOn6p2gVfuBww":{"text":"This is the last restaurant in New Orleans it's definitely one you would want visit. Make ","useful":1,"cool":0},"IpCSYMdlaMXRTqxXrhJRxA":{"text":"Rooftop seating offered a view, drinks and food we'd love to repeat. Service was friendly ","useful":0,"cool":0},"b7CFBeO1R9Yf2RsWEEqaSw":{"text":"I received such amazing service from my server, Stacy! She was super knowledgeable and abl","useful":0,"cool":0},"97nW3_5TEGqzdhUrG6b2fQ":{"text":"Excellent service and delicious food. This was our first stop for food in NOLA. Food order","useful":4,"cool":0},"ahU2bHQzWLfDNaDfvYvg7g":{"text":"This place was okay, the line was super long the hosts was every nice.  The food was okay,","useful":0,"cool":0},"6HhOWqrOZPp1m2KR8AiVwQ":{"text":"I hate to even think what I just paid for a horrible fish po-boy.   The bun could break te","useful":0,"cool":0},"SKj81hP0vn9D9w-8Z_wdfQ":{"text":"Amazing food and service. We basically yelped to find a restaurant close to our hotel with","useful":2,"cool":1},"wK6Sdx8nvuwSkzFIde_yzw":{"text":"You have to try the Alligator nachos! OMG, definitely if not the best nachos I ever had, t","useful":0,"cool":0},"pltw9uB2oFsGdYEsc1U0Ew":{"text":"We dined in tonight, our server Stacy was super helpful! She had great recommendations and","useful":0,"cool":0},"dGUCJTEBr7ofHLToW5anqg":{"text":"We ate at Mambo's for the first time on November 24, 2020; the food and service were good.","useful":0,"cool":0},"dYcs-AogdKqBb7gswImezA":{"text":"Terrible.\nTruly one of the worst customer service experiences I've ever had. The manager, ","useful":1,"cool":0},"-z2J5htQ3mJbHxyk9ft5yw":{"text":"I got the red fish dinner and my greens were super cold. I wasn't impressed with any of th","useful":0,"cool":0},"zrcj01tWPVLRi4LQQsWGyg":{"text":"Solid cajun food. Very good alligator and shrimp appetizers. Redfish catch of the day was ","useful":0,"cool":0},"nIQ6slOvxocFwgeTOmT4Eg":{"text":"We make a nearly annual trip to NOLA, and absolutely love trying to new places to eat. We ","useful":0,"cool":0},"UC5ikOn8Z53mXNOOAdEJYw":{"text":"Service is HORRENDOUS. Can't speak on the food as I'm still waiting. But the service alone","useful":0,"cool":0},"v1ClHDvyuhv0tSFtRMROeA":{"text":"All-around fantastic experience!! Thoroughly enjoyed some gator bites, chargrilled oysters","useful":0,"cool":0},"hYgXd_s4fi5Ueh0qSXEnYA":{"text":"This is a great place for light crabcakes and some wonderful oysters on the half shell esp","useful":0,"cool":0},"98fBwyvS0o7lXoIWp8iTig":{"text":"Food was average at best.  Ordered the Taste of New Orleans which was barely room temperat","useful":0,"cool":0},"GGKehOFU3ePPeHZcZ103Hw":{"text":"Beautiful clean restaurant on bourbon st and was air conditioned perfectly ! We came in af","useful":0,"cool":0},"6z0RSU7EQVS3yVV5Z2gW5w":{"text":"This was just ok for me. The service was very good, but the food was average. I ordered th","useful":0,"cool":0},"ZBUGjgQuBuIpbploYNfkWw":{"text":"Went into this place after drinking all night so I wasn't going to check in but my group w","useful":0,"cool":0},"RKBgGJZaQbX576h1L-A4Kg":{"text":"While the service was fantastic, the food was subpar. \n\nWe got fish, oysters and po boy an","useful":0,"cool":0},"vSrafWcWS4MyRkpl4WDOJQ":{"text":"the oysters were delicious and the service was great. they have a great happy hr mon throu","useful":0,"cool":0},"delqTQd9c1JSgT7GsURiSQ":{"text":"I've lived on the Mississippi gulf coast my whole life and this is easily best seafood I'v","useful":0,"cool":0},"0iE4t46rH9pG6rY34ghUwg":{"text":"Great food and good service. Friendly staff. We had a trainee waiter but she was always ac","useful":0,"cool":0},"lOnR3vN6wqw-q1mJ-viDGQ":{"text":"Taylor is AMAZING! We came to NOLA for our brother's 38th birthday trip and was originally","useful":0,"cool":0},"YkT8G0cmi2Ouj-jgDmwWQQ":{"text":"The food here is outstanding! Stacy was our server and she was fantastic. If you are in NO","useful":0,"cool":0},"R3ryn1gJ0VJK_ZHtDW3E6w":{"text":"Stopped in here for weekday lunch and it was amazing.  There was a group of 6 of us and we","useful":0,"cool":0},"voaCKnwRTYUJ7yTgGZza7g":{"text":"Amazing taste of New Orleans with a very large variety of options to try. The alligator po","useful":0,"cool":0},"tiU_6E-WL7TfoqafhBYtdg":{"text":"I'm really surprised that this place has such good reviews. While the service was great, t","useful":0,"cool":0},"Im4vMiOlQR8hdpzkDehnlQ":{"text":"This place is f-ing tits!  Didn't like rooftop dining because it was dark out and couldn't","useful":0,"cool":0},"LzM6kLXQ5AvRSMy9f7os_A":{"text":"Jasmine was our sever and was exceptional at her job.And a big shout out to the cooks who ","useful":0,"cool":0},"99vbbjJFFayYXETlrB-VNQ":{"text":"We did a GrubHub order for Mambo's delivery last week... it was not a good experience.\n\nWh","useful":0,"cool":0},"YQqAxC--pU9rj0QJPCMxbw":{"text":"Great place with outstanding service.  Opted for the 3rd floor where it was a bit quieter.","useful":0,"cool":0},"x75tXwGgYa0eqF1pZbLn8A":{"text":"Where do I start.  Leo our waiter was great. Fast and attentive. Next- Gator nachos.  Thes","useful":0,"cool":2},"fb7gpvOTg4IQYvpvif9nlw":{"text":"This place is great! Our waitress, Nicolette, was awesome, gave recommendations and was ve","useful":0,"cool":0},"jTnkFSdmOXV2GfcH1r8-2w":{"text":"Lovely rooftop getaway from the chaos of Bourbon street right below. View of downtown hote","useful":0,"cool":0},"gaZJBmof1IoCJ-Qs0y2aaA":{"text":"The poutine crawfish fries were very underwhelming, only received (3) pieces of crawfish a","useful":0,"cool":0},"7hcCuvFqZeV3IauT-OtoRQ":{"text":"Loved this place. Our server Tamesha gave us such good service. We were seated on the roof","useful":0,"cool":0},"ExLthGoUzCXkQfGdmn3GoQ":{"text":"I traveled with 46 ppl from Miami, Fl called the Foodoholics. We wanted to tour the food o","useful":0,"cool":0},"YkBcTEsULhEPSzxI-Zo9GQ":{"text":"I was pretty surprised this place is maintaining 4.5 stars.  Staff seemed generally attent","useful":0,"cool":0},"mk5y7M0hL8ieSwCphe-qAg":{"text":"We went here for my moms birthday and was so full from lunch that all we had room for was ","useful":0,"cool":0},"oiUY-ore5RhPr8I45TfiWw":{"text":"Pretty good food and great service. Our server Stacy was efficient and fun. Bill was prett","useful":0,"cool":0},"B4r5nVJWyD3izjEyeDppsg":{"text":"Loved the food. Gator nachos were awesome!! The bartender was our waiter and he was on poi","useful":0,"cool":0},"TznudnEItZLYib6hK4zn-A":{"text":"Mambos was one of the few restaurants open late in the French Quarter\nThey had a staff mem","useful":6,"cool":8},"u1yVjbOgyfl3n4yB-oAMLA":{"text":"We had our first night in NOLA and wandered into this place. A guy named Gregory was the w","useful":0,"cool":0},"SZxWwzkc7aDj8nOrpMv8SQ":{"text":"I would definitely recommend. The food and the service was awesome. If I vacation here aga","useful":0,"cool":0},"ZUbRpm3-emS0X7AvOhd17g":{"text":"Food was okay, not great for vegetarians! Weren't especially consciousness about COVID and","useful":0,"cool":0},"1ByCLcntmH1NlNcqTLNKFg":{"text":"Not sure why this place has such good reviews. The waiter was inattentive and drinks and f","useful":1,"cool":1},"5oW-YVTOOmiB-vVkZu7sjA":{"text":"Great place, po-boy was delicious and Glenda our waitress was very good.\nMade for a great ","useful":0,"cool":0},"s1sni5HKxR16-PgoWpZQYw":{"text":"The food was delicious especially the mustard greens. And our waitress Ashely was so pleas","useful":0,"cool":0},"dcZYVZYCLXxXzd5fCDiadA":{"text":"The Voodod Pasta was amazing! Crawfish Etouffee was perfectly splendid. Our server Leo was","useful":1,"cool":0},"uVB3EyLZ1nb6v8F1_SiV6g":{"text":"This place was so amazing. The staff was so outgoing my friendly. I think I was treated by","useful":0,"cool":0},"DMY4o530PcpsqPecNErZag":{"text":"Spent the weekend in NOLA and i loved this place! Our waiter Maddie was great and gave us ","useful":0,"cool":0},"7tDDWYlrUakHWY2Mbk7KsQ":{"text":"Meal was awesome. Got here just before the crowd. Plan to share your meal and definitely o","useful":0,"cool":0},"cg9fus6yT4IN8KVPYbP4vw":{"text":"My husband and I share the Taste of New Orleans, the Blackened Alligator Tail Bites and a ","useful":0,"cool":0},"WWKscDAS18G4wXZjFnjIYg":{"text":"When coming to New Orleans I seen a lot of people suggesting Acme. Being that I was alone ","useful":0,"cool":1},"lPY4BBTIMPSlbkiyeLUIDg":{"text":"One word - AMAZING!!! Long line to get in but I was dining alone so I was able to skip the","useful":2,"cool":0},"arzIUwo8QPoyJ84JDBE_PA":{"text":"The oysters are amazing especially the Mambo sauce. I always go here when I touch down. My","useful":0,"cool":0},"oAPEpuHxg9zGSKydu3pp7w":{"text":"I stopped in at Mambo's for late late lunch early dinner. The location is right on bourbon","useful":0,"cool":0},"yImrPekA1PHP3Q_HKGw0wQ":{"text":"Such a great experience!!! We went during Covid and the wait was like 15 mins but well wor","useful":0,"cool":0},"WD8amNOxf5Dnf6LwBfWw3w":{"text":"I spent New Year's Eve here and the total for some drinks and our food ended up around 300","useful":3,"cool":0},"KaNkKUCQ2Mvw_5eJ2sJukA":{"text":"Do not eat here. Staff and managers super rude. They should all be fired. Showed up with a","useful":0,"cool":0},"mNoLvIjOyVLYjFYNR32P5g":{"text":"Good food! Devon was amazing and made our experience delightful! Highly recommend the craw","useful":0,"cool":0},"JBR89POIBQ_GmdtfA86ITg":{"text":"I wanted to come here on my birthday to enjoy the rooftop but was unable to but still mana","useful":1,"cool":0},"okIGzO5QBYe3E8grlke2tA":{"text":"I had the chicken alfredo pasta with Cajun seasoning. The food came out lukewarm and my ch","useful":0,"cool":0},"I0hT1mFSQPaI7xYn3gvXAQ":{"text":"Stopped for lunch. Had a taste for a po boy. The blackened shrimp and redfish po boy hit t","useful":0,"cool":0},"ttcx-22bn07pvLXvbvxWug":{"text":"Dang! Awesomeness again on Bourbon Street.  Go to Mambos. Ask for \"Jasmin in Action \" as y","useful":0,"cool":0},"8I3sRrBjWCO-uIk1SVoY6g":{"text":"Best Crab Cakes in New Orleans!    Great view of the city from the rooftop seating.   Exce","useful":0,"cool":0},"PxHQOmcGi28ZuC6NAO_g4w":{"text":"Great chargrilled oysters and the cocktails were tasty too. Try to get there for happy hou","useful":0,"cool":0},"GqXv9Znb7Wl2I2lKqqOmKg":{"text":"We had the most amazing experience here at Mambo's! I didn't get the name of our waitress,","useful":1,"cool":0},"-etjxmlvW1S4voUGANig2g":{"text":"We decided to try Mambo's because of their famous oysters and we were not disappointed. We","useful":0,"cool":0},"ZNqj-9E-ew3wLl0xWr7PoA":{"text":"First New Orleans meal and literally it was all an explosion of flavor!! And I'm Latina so","useful":0,"cool":0},"u5yGC48CIiDL-GnqabBBFA":{"text":"My husband and I sat for 5-7 minutes with no service before we walked out. Servers were wa","useful":0,"cool":0},"jTCNVNpP2gVk_HcxYnO2OA":{"text":"OMG, take me back! This place was definitely the bee's knees, and a highlight of my trip. ","useful":0,"cool":0},"2EeCfcMU8LcjkST0s7olwA":{"text":"Fun spot and some of the best staff I've ever, from the hosts to our server, and even the ","useful":1,"cool":0},"J0KqEvD5MoneBBWhTPiOIQ":{"text":"In town from Atlanta and stumbled across this place and I loved my experience at Mambo's. ","useful":0,"cool":1},"IRq_wkklc15jw0AMcyH_cw":{"text":"Absolutely delicious. We split several menu items and none of them disappointed. Our waitr","useful":0,"cool":0},"zmzT7DHStMJi-aknWn_HZw":{"text":"My experience at Mambo's was drastically different than all of these glowing reviews. I ch","useful":0,"cool":0},"6PYiOjjnPr6cjHqGVCbhpg":{"text":"Roof top dining was awesome! TK was our waitress and was awesome!!!!! She is personable, o","useful":0,"cool":0},"0camV0157dwXTVw9odTwmg":{"text":"Heading home from Florida wouldn't be worth mentioning without a trip to NOLA. My sister a","useful":0,"cool":0},"JFkFmHGQnak_xfYjxB90mA":{"text":"Came here on a Wednesday night for a quick dinner with some friends. Wait was about 45 min","useful":0,"cool":0},"Pror6V-G5f4C7TC4rOYcFQ":{"text":"Wow this place blew my mind. Haven't tried real southern until I came down to Nola. Me and","useful":0,"cool":1},"9Hn029o1haPOC3dkG4H40w":{"text":"So so good! You have to end with the pecan pie. Best I've ever had. We had the duck wonton","useful":0,"cool":0},"2CgVd3sTXJDu6yw27vBwIw":{"text":"The gator nachos are nothing special and the mambo oysters were over cooked,over seasoned ","useful":0,"cool":0},"Jb20WEJB9nN1t_HBWH03Bg":{"text":"I've had the luxury to dine in at Mambo's, grab drinks on their beautiful rooftop bar that","useful":23,"cool":18},"GleEqy7PaJZ7fHtSvygP3Q":{"text":"On vacation I passed by this spot many times and always busy.  I thought to myself there m","useful":0,"cool":0},"NrrJHUBwGxV64sdC1-owVQ":{"text":"Great spot that is open a little later for dining then most of the other places around. Un","useful":2,"cool":0},"8Xpo3KBvxlrNvjHlh1sMaA":{"text":"Very disappointed. Oysters sucked ass. Drinks we good but I won't be going back. Can't bel","useful":0,"cool":0},"lJVqztL6y0FrgwD8RtBwhg":{"text":"Our first meal in NOLA and it did not disappoint.  The gator nachos were phenomenal. Our o","useful":0,"cool":0},"fCTE_UOgt2XYGRdRRjeWKg":{"text":"Loved Mambos! Located right in bourbon street so we knew we had to get there early to beat","useful":1,"cool":0},"F-HiZRfRVPQR3Cw89KyZJA":{"text":"Mambos, j'adore vous! I can always count on great food, excellent cocktails and fantastic ","useful":0,"cool":0},"5KFK8eLRmWXSvTikxuYypA":{"text":"If you happen to be on one of the busiest streets of New Orleans, Bourbon St, and would li","useful":0,"cool":0},"4dGfn8eflVGhO6dy2uIVjg":{"text":"First time in New Orleans and we decided to end our trip on a high note. Went there for di","useful":1,"cool":1},"UDR3jpzzSKT8WlSivYBXEw":{"text":"We came here last night! What can I say, Delicious!! We loved it! Oysters, po boys and cra","useful":0,"cool":0},"XPfcy4ugd265pFOXPM2TLg":{"text":"I loved this spot.  I had the chargrilled oysters, which had some Parmesan type of sauce o","useful":0,"cool":0},"oVoDQAb6G6Fp0FQy9ZsiSg":{"text":"If you're looking for a late-night grub in NOLA, Mambo's is the one.\n\nThis legendary cajun","useful":14,"cool":8},"pS5PSV6fz1yXNeeZUUgkFw":{"text":"The appetizers were delicious! Definitely recommend the oysters and crab cakes! However th","useful":0,"cool":0},"dNZ-OK7ENes5i3WxpozVuA":{"text":"I have now eaten at Mambo's three times. Each time has been for lunch. The first dish I tr","useful":1,"cool":0},"zPpBX0un-TpGiswzfqlhdg":{"text":"Food is okay but if you make it to the rooftop, the view and the breeze is five stars.\n\nOu","useful":2,"cool":2},"VXjs-xpLDk3_xBa_0qcoiA":{"text":"Oysters were amazing. First stop on our week long stay in Nola and i was very impressed wi","useful":0,"cool":1},"YhmpYYNFCyiSzrJnzg1hvQ":{"text":"Food was great!! Service was superb!! Ashley our server was exceptional!!! Will NOT disapp","useful":0,"cool":0},"ArlFl3ppi0C_7TNNwyn1gQ":{"text":"Called ahead and was recommended to arrive before 5 pm! Arrived at 5 to NO wait! Requested","useful":0,"cool":0},"Afgm_ptzJJnqtZ6ado2zoQ":{"text":"Omg this place was AMAZING!! I ordered the Mambo burger w/ BBQ sauce it was soooo deliciou","useful":3,"cool":1},"QVEyLG7SQ3atY3cHBMeLLg":{"text":"The food was bland and the service was awful my friends drink stayed empty for 30 minuted ","useful":0,"cool":0},"M9STo0bFpxA_Kj75PxgXHg":{"text":"Unfortunately, the wait was insane for some mediocre food that I wouldn't come back again ","useful":1,"cool":0},"wvud2_eIWqCs1OVLWBmcqA":{"text":"A friend of mine and I decided to go down and try this restaurant, because they promote th","useful":1,"cool":1},"CvjQYmCt3DegNHoONZEK6Q":{"text":"Everything was so flavorful. We went to a lot of restaurants on this vacation this was my\n","useful":1,"cool":1},"LwKERRRZ_N5-I1ptHdAZPQ":{"text":"The food was amazing & even through the busy crowd our server was too.  We had Johnelle & ","useful":0,"cool":0},"z5WWpSUlc6g3EknDxq-C0w":{"text":"We ate here on the balcony the first night of our vacation! We took pics with St Louis Cat","useful":0,"cool":0},"8cFCmLY7V7cW2i9-I5NTbQ":{"text":"This was a crowded spot due to it's location, along the famous bourbon st.  Check-in for a","useful":2,"cool":1},"2s8XZScINf0u1_9CInYi7A":{"text":"My favorite restaurant on Bourbon Street!!! Their Taste of New Orleans plate and Oysters w","useful":1,"cool":1},"S-6gRatyaPEjdr46RwS4ZA":{"text":"Stopped in for our final meal before heading out to the airport. Mambos did not disappoint","useful":2,"cool":1},"Ta_wqi_BGy4HYxDFjvaGwg":{"text":"Worth the small wait...we got in short line just in time before everyone started coming ou","useful":0,"cool":0},"rZA07axZm_FW95tdwxmzow":{"text":"The food was good the drinks were great! We had a great time! We booked a table for 15 bec","useful":0,"cool":0},"JSDZvSLryHe3qtZrG4RDrw":{"text":"The server (Leo) was attentive, offered great recommendations (alligator nachos and voodoo","useful":0,"cool":1},"fSoTNFg29PEyg7SCj1rDkw":{"text":"I love mambos! comforting soul food. their lump crab cakes are amazing.","useful":1,"cool":1},"VHL96bbJ40Tx9Wywv6OKbA":{"text":"Good place to stop for basic food, but honestly not what I expected from the reviews. I go","useful":0,"cool":0},"jFZ0LK-r72aC_r4uJwW11w":{"text":"Came here on a busy Friday evening with a group of 6. There was a line but it went very qu","useful":0,"cool":0},"suQzGcYKUCfErgb-NJKc1Q":{"text":"Despite reading some Google reviews on that being inconsistent or a total miss, our group ","useful":0,"cool":0},"ARg7OwScJLusvdbzKY8K_Q":{"text":"This was a great place to eat. You could taste the food was fresh and really well prepared","useful":0,"cool":0},"I56iYvWizeno_-MwY7gO2g":{"text":"This place is great! They take covid precautions seriously (in a good way). Our waiter Leo","useful":0,"cool":0},"Zr2JYYa8fjRv3LB5a1f_Qg":{"text":"We loved all the food that we got except they forgot our grilled chicken for one of the me","useful":0,"cool":0},"r_NdhkusvxCTyyiRBZpMFg":{"text":"Tamisha was an excellent waitress and was very knowledgeable about the menu. Overall the f","useful":0,"cool":0},"7fIsykkHnreLdXHXO-X7OQ":{"text":"Stacy was awesome! Super friendly and great service. Great food at a reasonable price. Fam","useful":0,"cool":0},"HivLyRGi_B_aFjgr39GRwg":{"text":"Absolutely delicious food. \nVery creole southern food. Very friendly staff and good drinks","useful":1,"cool":1},"ApwMycpJeT52m-yy9vLrLA":{"text":"Long story short \"service was terrible, food was not worth the price\" \n\nDecided to try thi","useful":1,"cool":0},"ZM6BwRFLDfEaEscnIauWXw":{"text":"Char-grilled oysters were very unique, yet very good!  Gumbo was very good, not great. Ser","useful":0,"cool":0},"5pCZ-dSKUJOvV-skctvY8w":{"text":"They use the same sauce on the nachos, on the oyster, on the pasta, on the fish and it get","useful":0,"cool":0},"fVfVE4T2KFzyEIdSFw-uiw":{"text":"Went here with my family and had such a great time! We made a reservation (highly recommen","useful":0,"cool":0},"qe4ijeb-gzxaHr9Ct8nWyA":{"text":"I did not expect to find such a great place to eat right on Bourbon Street! This was not m","useful":2,"cool":1},"_HMC2oOoFsikvIIyRtJInw":{"text":"We ate on the rooftop dining area which was awesome since the weather was perfect. Food wa","useful":0,"cool":0},"b5GJuVmTND4IQljEMMeuAg":{"text":"Service was great and very fast. It was very clean. It kind of felt like a chain, but that","useful":0,"cool":0},"R1IUHHLn7OP-alrbvagKUg":{"text":"So good!!!blackened redfish... Sub red bears and rice for the greens... gator nachos A+","useful":1,"cool":0},"iA7SNI3HYpmHjyWGYcNvsA":{"text":"The review is just for the crab cake appetizers and the side of crawfish etouffee. I for s","useful":0,"cool":0},"ujdnelHuLqTzx4McuVRLdQ":{"text":"ONE OF THE FASTEST AND BEST COSTUMER SERVICE! I love the food here. It was so delicious. I","useful":1,"cool":1},"gsPxx3RHj5ZtFXOA926B9Q":{"text":"Lines are crazy if you don't have a reservation around dinner time. We chose not to wait s","useful":0,"cool":0},"EXVWAE2wVdFuJQ3JLWsEeg":{"text":"Mambo over to this place for some DELICIOUS NOLA soul food. We had a group of 12 and they ","useful":1,"cool":0},"G0yNbc1b3UZtXCljbEmZzw":{"text":"I was skeptical given its location right on Bourbon St and the guy in the street with a fo","useful":0,"cool":0},"p4iF3FAmafgl9d1sOoDEnw":{"text":"First stop in NOLA since I read good things about it on TripAdvisor and Yelp. Got an ice c","useful":0,"cool":0},"snjtvIGW9az78bBoQLxYjQ":{"text":"Stopped in at midnight for some food. The poutine fries and duck wantons were incredibly d","useful":0,"cool":0},"nfgpzLWv0PeVL8r4J6oVQw":{"text":"I chose this place for a late night sit down option during my NOLA trip and I'm glad I did","useful":1,"cool":0},"Gi2jQKDwX1luOkhp4WVbLQ":{"text":"I stopped into Mambo's late night after walking up and Bourbon Street for a few hours. I w","useful":1,"cool":1},"aC2eSpLuiLAtm8m9IK_Ylw":{"text":"I do my best to avoid Bourbon Street restaurants, with very few exceptions.  Mambos has jo","useful":17,"cool":15},"IJX0uitJ_kQjXwTy193kEQ":{"text":"Had to give one star to write a review the second star was for the staff! Hostess was swee","useful":0,"cool":0},"GJFZSMqW21BWEL0THMY5qA":{"text":"Love this place! People are great, and the alligator po'boy, oysters Rockefeller and seafo","useful":1,"cool":0},"nrBqDopDBxf99_1RgE2nQA":{"text":"I got the alligator poboy. It was good, but I do wish there was a little bit more sauce on","useful":0,"cool":0},"sJ1nOX4bA10aaevgf15vwA":{"text":"Nice casual restaurant.  Had oysters, shrimp and gritts (they were the bbq Cajun style) an","useful":0,"cool":0},"dV6otvGaXNgGOilZ84Uxhw":{"text":"First time in New Orleans and I visited Mambo's for an evening meal. The food is amazing, ","useful":0,"cool":0},"qrF9ArtlB66PMrLvtP0jig":{"text":"First time in and I'm hooked. So busy we had to sit at the bar and so glad we did!! Drinks","useful":0,"cool":0},"551fwDf_fWxVRpMFWvLn0g":{"text":"Fabulous and varied creole Cajun fare. Every dish was great. Including the bourbon pecan p","useful":0,"cool":0},"39tp9TqPl1zUfZL_Xxs5qA":{"text":"Crawfish Etouffee\nFood was delicious, spicy with a southern twist. \nDessert: Was delicious","useful":1,"cool":0},"9cBW7iK2a6xFJQY41fHt5g":{"text":"Yes Yes & Yes!\n\nMy mother & I ordered a platter together and the food was SO fresh. The dr","useful":0,"cool":0},"mZNgQdKbFs5R6YeTchyLvA":{"text":"Mambo's is definitely a solid choice for food that represents New Orleans. Everyone seemed","useful":0,"cool":0},"9-mCPSlhqGnBGggIhgJvbg":{"text":"Finally we hit the right spot! My cousin and I are here out of town and so far we hadn't h","useful":0,"cool":1},"jWe0GpmYauPFCBitGI8b6g":{"text":"Whitney and Ian are the best!!! Great food and better service in the heart of the French Q","useful":0,"cool":0},"-LfGpAggH1TuSWaHGBh4Zg":{"text":"I came here for an early dinner to avoid the crowds(good sign) . They do have a rooftop de","useful":1,"cool":0},"xKSXPi1LvXUqcFCQDKvRUQ":{"text":"Came here during Covid, and everything was safe, clean, and delicious!! We got the crab ca","useful":1,"cool":0},"Q4ieboTVo8amRYN-qJxb9g":{"text":"First time to New Orleans, and I'm understanding the Cajun/creole food hype... We ordered ","useful":1,"cool":0},"zIs7tXJVai755VSBEyKJ0A":{"text":"I cannot express how nice and helpful everyone is here !!!!!! Services was amazing ! Like ","useful":0,"cool":0},"POjCj6LXBfitPZWkPoS3jQ":{"text":"Any time we are in New Orleans Mambo's is on the to-do list! Tonight did not disappoint! D","useful":0,"cool":0},"HO8ce6fqpVbC__xZBZ4JrQ":{"text":"We had a wonderful dining experience last night!   Everyone who was working was exceptiona","useful":0,"cool":0},"MWTcCnRfNHITLcro6qzt_Q":{"text":"Came here a couple of months ago in April and forget to leave a review. Mambos was right i","useful":0,"cool":0},"eFGSj8ZZKSq7fvgbAdbarg":{"text":"Appetizers and dinner were spectacular. Crab cakes and desert were my favorites. We had gr","useful":0,"cool":0},"Ov621p6WJiKfPsDnwYlGjw":{"text":"mambo's is the best place to eat on bourbon st. this restaurant had great staff & service.","useful":1,"cool":1},"DUBU5rlK1htrSbXW0NdQTA":{"text":"Amazing crab cake heaven was the best I ever tasted also our waitress was so nice Thank yo","useful":0,"cool":0},"QJJV-7nuknOmuR_xgTX3Cw":{"text":"Mambo's is amazing! Make sure to make a reservation on Yelp beforehand, especially if you'","useful":0,"cool":0},"mVFEDPsuLHtbYIzi4c1Fwg":{"text":"Stale food, slow service\n\nWe only ordered crab cakes and oysters along with two drinks. Th","useful":0,"cool":0},"Q90M8AHlNxUVL0ii7MAj1w":{"text":"Was able to have very tasty po boy alligator and fish. Service at the bar was fabulous and","useful":0,"cool":0},"T6CHriE6kV6ovE9etxS4QQ":{"text":"We had just got into New Orleans and stopped at this restaurant. The oysters were great an","useful":1,"cool":1},"TvWe9xLtEGvUTZFIrX7baA":{"text":"Didn't realize how touristy this place here until we arrived but we came to try their oyst","useful":3,"cool":1},"U9Fm9LM8vAmH8d0jQ6XRuw":{"text":"Wonderful service from Troy H! Thanks for having me!! Super sweet, knowledgeable and hands","useful":0,"cool":0},"rSA2Ivo7BSqByfv1_pKMjQ":{"text":"Decided to pop in for a meal in the quarter with my friends and had a great time. Food was","useful":0,"cool":0},"4aa9he63P5mqx16XUF7o_A":{"text":"We came for brunch on Christmas.  We ordered oysters and they were fresh and yummy.  We al","useful":0,"cool":0},"ZjcZ7EdrbGFWn_YP5Cg4nQ":{"text":"A beautiful restaurant on Bourbon Street! As someone who frequents New Orleans often I do ","useful":0,"cool":0},"GtWM0XNiZpNAxOPkAJdy1w":{"text":"The food was great! The service was better Alvin was the best server I've had in a minute.","useful":0,"cool":0},"lzoOwIGZdbp_LvZDLPdRkg":{"text":"Had a great dinner!  With so many places closed I wandered over to Mambo's.  The wait was ","useful":3,"cool":0},"t3u4-QKNjxHdQPebqZqihw":{"text":"Very nice view of Bourbon Street along with great atmosphere. I had the chicken Alfredo an","useful":0,"cool":0},"Ng34S0iBiotfIl0gsFg8Jw":{"text":"So disappointing. We waited about an hour before getting a table. They clearly are having ","useful":0,"cool":0},"HpYkHKGfeZXQAyPGK2WchQ":{"text":"First time in NOLA and this was our first stop after a day of traveling. Ashleigh was the ","useful":0,"cool":0},"rYXHakqnrwB2bQrJfONGzQ":{"text":"Mediocre, at best. The drinks are seriously watered down, the seafood platter was just oka","useful":0,"cool":0},"Vtakg5qh5JCHmqCxY1EHMg":{"text":"It came in top of a mountain of delicious mashed potatoes. It came out Piping HOT! Delicio","useful":0,"cool":0},"zqdQP6rTqhH5hMUXE3uzYg":{"text":"We cleaned our plates! This was first experience with food in New Orleans and I was not di","useful":0,"cool":0},"YDiQqKgTMbXToTBHMiIt7g":{"text":"Right on Bourbon St.  Good food, great atmosphere.  Recommend the bread pudding for desser","useful":1,"cool":0},"LSCSOMfOWD_kPa37_YtKaQ":{"text":"Great location and open late.\n\nI arrived in New Orleans on a late flight and was craving o","useful":2,"cool":0},"g8aEHSdUtTNl_bJp1v3FRw":{"text":"I was looking for the best shrimp in grits, I stumbled upon Mambos on Bourbon street, at 6","useful":0,"cool":0},"YSFaOMX_OW1WeMyyKjUDDw":{"text":"Great view, we sat on the roof top. Good was great and so were the drinks!! The gator nach","useful":0,"cool":0},"yjSI0_f6nVe3nrBxNELt_A":{"text":"Ah Man, was met with very friendly staff. Kind  and service with a smile, I appreciate it,","useful":0,"cool":0},"uC_PbIQY1Ngug6Lt_dRoFw":{"text":"Lunch and the drinks were delicious. The chargrilled oysters are to die for!!! Whew! Ashle","useful":0,"cool":0},"uEVvXfrzI_fmz5wOFqEQXg":{"text":"Coming in 30 minutes before closing is not only a terrible move on my part as a consumer, ","useful":0,"cool":0},"JTE1PsyQQB48gScVo0nT2g":{"text":"The food was delicious! The service was great and although we waited for an hour to outsid","useful":0,"cool":0},"dTl8qLbdqTL5_Zdd4dw48Q":{"text":"Tourist trap, very commercialized, and felt like a southern themed Red Lobster. Prices are","useful":0,"cool":0},"oCs4R-YA2TZWzQDevyX0BQ":{"text":"Food was amazing and the staff was very friendly. The poutine was so good. The jambalaya w","useful":0,"cool":0},"lRmVJl2MHZTyISg5cx2hZw":{"text":"The service here was super friendly, attentive, and accommodating. The crawfish poutine, d","useful":0,"cool":0},"o9V3-vkr0fgrJswIM2TMQA":{"text":"Bruh! \nMy first time in Nola...\nFood was awesome! Had the Zydeco Duck... Brilliant! Perfec","useful":0,"cool":0},"YPzThBwB2BoDY9Q4shuBZw":{"text":"All staff at Mambos is very attentive; our server Steven gives you that southern hospitali","useful":0,"cool":1},"U3G6a4_d59WKkCnbp5-kZQ":{"text":"We loved this restaurant. We had to wait a little while to get our table but once we were ","useful":0,"cool":0},"ZOo0UeAjS6QE-Xg1XQxIBQ":{"text":"10 out of 10! I will be back many times over. The food is amazing and the staff is great. ","useful":1,"cool":1},"Y_NUSUTtNLg3U1nwWIpaqQ":{"text":"Mambo's didn't disappoint! We had a reservation for 14 (bypassing the long line) and sat o","useful":1,"cool":0},"wHLxGIZWQhyAwdnZgE596A":{"text":"My first trip to New Orleans and I hear a guy out side trying to reel me me with comments ","useful":0,"cool":0},"yBEsrdH-Puwsv6jQg8E5BQ":{"text":"Located in Bourbon St, we were automatically greeted when we walked in. Awesome service an","useful":1,"cool":0},"Red4QniZbzP16WN4y2184w":{"text":"I really liked the raw oysters, although the charbroiled ones were just a bit on the salti","useful":0,"cool":0},"HGQXoYuOsssH71WGVbovZQ":{"text":"Mambo's has it down! Our server was so nice, the AC was blasting and the food was HOT and ","useful":0,"cool":0},"Ml4YqgIlLZXgYIP2M6QbPA":{"text":"What a gem on Bourbon St. The aesthetic when you walk in is amazing. The cleanliness is ap","useful":0,"cool":1},"6n_5ZHnhmyzm79Bss5faNw":{"text":"Very good oysters! Rooftop dining was great. We waited 45 minutes to be seated but the wai","useful":0,"cool":0},"Z5dbyZ3LeJouJJEP6ZIsKA":{"text":"Ambiance, flair, and great authentic NOLA cuisine, surprisingly right on Bourbon Street. M","useful":1,"cool":1},"xSQrS3OUHEqFroQiBpQ61A":{"text":"All the seafood here is great but ended up getting some of the Alfredo sauce and WOW, high","useful":0,"cool":0},"4Li1X8BCEv9c8AoaXmefnA":{"text":"The BEST Chargrilled Oysters in the French Quarter...I tried MANY around here during my vi","useful":3,"cool":0},"oR3gU0__aWmTD9KzdovIYQ":{"text":"Wow! This place was Great! They are attentive to the COVID guidelines requiring masks and ","useful":1,"cool":1},"z9chYGmdBwmkNaGuqA7wvw":{"text":"Second time here from Michigan!  Always great service and great tasting food.  Oysters see","useful":0,"cool":0},"hz7w9MpEF6IMLNSquGkUZw":{"text":"Great Food and entertainment all in a single sitting. After seeing this on my yelp list, o","useful":1,"cool":1},"NkQXVEsx_OQzsndUZYcySQ":{"text":"The food was delicious and our waiter Darrick was top notch! I can't sing his praises more","useful":0,"cool":0},"humIBT3H8UbpP0wiRmCoOw":{"text":"We had a great dinner on the patio making day-of reservations.  Jasmin was an amazing serv","useful":0,"cool":1},"XTuNYQAV_AOq7Thjxnmo5w":{"text":"From the time we entered the line until we left the restaurant, service was amazing. The h","useful":0,"cool":0},"zTXBAjMjtBMpTNt5IBHqhQ":{"text":"Mambo's. A delightful restaurant on Bourbon St. with a rooftop bar. Besides the full bar, ","useful":0,"cool":0},"22lfXc_iJTFrPcdrEmdItQ":{"text":"I'm so glad we came here at the end of the night where there was zero wait because if I wa","useful":3,"cool":0},"jGJ6gMyzc43UNo8aC5KKUg":{"text":"Our first night in New Orleans we went to Mambos and had the most awesome server named Sta","useful":0,"cool":0},"QmUx4lqQqAp5-CyySCB5Zg":{"text":"Terrible service, the wait staff was extremely rude and confrontational with guests, do no","useful":0,"cool":0},"P-rFrlnZZ-0BP4iRYV3VWg":{"text":"If you're on Bourbon St and looking for a great plate of redfish definitely check this pla","useful":0,"cool":1},"ynhdlDL_LdRzd68yoWoQLA":{"text":"Pretty good meal and you get a free dessert for checking in on yelp. \n\nMambo's Oysters - e","useful":2,"cool":1},"cVXowIkCoVZ7eBHKbSX9Kg":{"text":"The food was amazing. I originally found it online and my friends weren't impressed but af","useful":0,"cool":0},"FZ6OdSaRMshWWdnfplqecw":{"text":"This was our first stop on Bourbon St because the reviews were so great. The hostess was k","useful":0,"cool":0},"QA6kUoe13bDFCWVPwDl8Dw":{"text":"Celebrating Dallas Cowboys vs New Orleans Saints win!! This place has been on my list to t","useful":0,"cool":0},"awhyt-NMrSBseTkPzbwLzg":{"text":"Excellent. Order the gator nachos (pictured) and the BBQ shrimp. Both appetizers are great","useful":0,"cool":0},"hH-h4wY3wCMc1yLy5hmm7Q":{"text":"So we found this place by accident just walking around looking for a place to chow down. T","useful":6,"cool":6},"S7_gC-37KQE3-m97wYcVUQ":{"text":"Spent nearly a week in NOLA and my hotel was right off Bourbon. This place, Mambos was pro","useful":1,"cool":1},"8w6T50tLBAbOkSGUooepPA":{"text":"Mambos is a gem from start to finish. A coworker and I visited 7-15-19 @ 7pm Super nice gu","useful":0,"cool":0},"CqZ6JIHEXxTQ32xZxINHMw":{"text":"The line looked long but moved pretty fast. We were seated even faster by asking to sit ou","useful":0,"cool":0},"3ndBNklCa5d_hSK3lPiHiA":{"text":"The oysters were very good. The service was super slow, yet there were servers standing ar","useful":0,"cool":0},"ih_Yv2PZkQagWIYmMsCOUg":{"text":"Next time you visit New Orleans, come to this place.  It's usually crowded, so try and get","useful":0,"cool":0},"L1L-w9D0uRGugfgcTa3SLw":{"text":"Context first! \n\nMy boyfriend brought me here for birthday dinner! He made reservations we","useful":1,"cool":1},"glpMsQlzoG9ZXqwePfLdsA":{"text":"Trends to the tourist side of New Orleans but hey...it's on Bourbon Street so that fits th","useful":0,"cool":0},"-u9TLF0na2x1SjvgHxPd0g":{"text":"Really good Etouffee and Gumbo! Could use more spice, but it was great. Drinks were good t","useful":0,"cool":0},"dVpD9e93S9ZtZY2QtDoIeg":{"text":"Very kind staff who accommodated our friend who was vegan and made sure they could persona","useful":0,"cool":0},"sEyxnecrzcHSbkElfnWIWQ":{"text":"Wow what can I say... This was a great choice. From the fast and friendly service to the a","useful":1,"cool":1},"Ff3dYuJkGw5Ht9vYiKvciQ":{"text":"We tend to avoid the Bourbon Street food joints but based on the reviews, we had to try th","useful":0,"cool":0},"OETg_YA_TOtkSHzWYChPng":{"text":"Great experience! Was in NOLA on vacation and stopped at this restaurant. We were immediat","useful":0,"cool":1},"xi8IhlwKezTfP5hzBwTcNA":{"text":"Mambo's is a great pick in the bourbon street area! That being said, you'll pay for the co","useful":0,"cool":0},"GdrqgEfBawLpcC0LkNrMeQ":{"text":"Excellent cleanliness,CUSTOMER SERVICE, AND PROMPT FOOD DELIVERY to our table! Our waitres","useful":0,"cool":0},"CpzSeZDVrXTbTS3pfa0e-w":{"text":"I was so excited to try Mambo's, it had been on my list to try for a while, but due to COV","useful":1,"cool":0},"MkPq1eEHnCszu5OeqFXe6g":{"text":"Amazing food here especially the oyster!! The mambo's oysters is a must order.  We had the","useful":0,"cool":0},"lvzk2Ra3GPYtmycghVQvow":{"text":"I WAS BLOCKED IN AND HELD AGAINST MY WILL! \nDO NOT GO HERE WHATEVER YOU DO.\nWATCH THE VIDE","useful":2,"cool":1},"MQ6VV9TjMmUeNF7pdDkW9A":{"text":"In the middle of it all Mambo's stand out with great food and a smiling Victoria that was ","useful":0,"cool":0},"OlHHf-CLGUEvAjm3riM-wA":{"text":"Everything was great. The nachos were sooo good!  The staff were very attentive and friend","useful":0,"cool":0},"_nW2tpc2os3IKTmrbNl6cg":{"text":"Food was good service ok.  Ordered the Raw oysters and red beans and rice.  Yelp check in ","useful":1,"cool":1},"nhh_nX5awAsILxenMLERhQ":{"text":"This restaurant was top notch! The service staff was fast, friendly, and very helpful. We ","useful":2,"cool":1},"9WIFfMmEqUThSTHSRFUWPw":{"text":"We were on Bourbon Street and happened by here on a whim. We saw it had great reviews so w","useful":0,"cool":0},"mcBYXC3esRP_sQcC7i6f9Q":{"text":"So we got here early didn't know the rooftop bar had a certain time it opened but we got t","useful":0,"cool":0},"eHZ02ixp2bpN-ygqKo5tIQ":{"text":"We was try this place cause review and picture is look good but...\n\nBad service and grill ","useful":0,"cool":0},"MaZqZRXSsj0ddDO2G_eXfg":{"text":"We stopped in after walking because we smelled the fresh seafood. When we walked in we not","useful":2,"cool":1},"zmPqPxNfPm-vhui_qXs_Uw":{"text":"Ashleigh was our server and she was so amazing!!!! Great food and great service. Would def","useful":0,"cool":0},"2zGJt-R9uYJMO4ws5enffQ":{"text":"If you're craving a nice sit down restaurant in New Orleans come to Mambo's. All the class","useful":3,"cool":1},"EBIYteL4EQI1gwp5-A9gZg":{"text":"Brianna is the BEST and the red fish is to die for!! Brianna explained all of the specials","useful":0,"cool":0},"rrHmCoq9NqfaHT3AJ8-FFA":{"text":"Stopped in for a late night snack. We sat in the courtyard. The crawfish poutin was delici","useful":0,"cool":0},"EhffUBmU6kWSPRD9DMdlhg":{"text":"definitely make reservations on a friday or saturday night!! we walked up and it was such ","useful":0,"cool":0},"f8cVpztWAl1nX_UMQNChoA":{"text":"Wonderful. Very great at social distancing. Food is amazing the gator nachos and chicken g","useful":0,"cool":0},"ub1sgDjtsICP1kx6UE1MUw":{"text":"Food was bland and the waitress named \"TK\" was terrible. It wasn't busy but was completely","useful":0,"cool":0},"76bVrfshy6X_lijDno4AWA":{"text":"We got off the plane checked into our hotel and were walking around... we stumbled across ","useful":0,"cool":0},"0Tz0dD_ZrBlk220GXL0TrQ":{"text":"Mmmmmmm I really don't understand why this is so highly rated. I mean I guess it's an oasi","useful":0,"cool":0},"PwEhPBIdAVX2Vt_PAMHAvg":{"text":"Great food and excellent service. Be sure to make a reservation to avoid the long lines. I","useful":0,"cool":0},"crX9pDoLCKoWj_7XLJ4efQ":{"text":"DO NOT EAT HERE! The food was just okay, and very OVERPRICED. The service was DEPLORABLE. ","useful":0,"cool":0},"jMu2XO6F0wcaLqRYtz1SbQ":{"text":"The planet Hollywood of soul food minus the soul and flavor you are used to in New Orleans","useful":1,"cool":0},"Zsv5BY4c8IYA1UlWG8MUsg":{"text":"Great service, very friendly atmosphere and wonderful waitress, but the food was a bit to ","useful":0,"cool":0},"O3pGdkRFKmFvhhE1WoZOGQ":{"text":"Delicious dinner! Great atmosphere. Wait was a little long but definitely worth it. My hus","useful":0,"cool":0},"ZIWttsKD7ts2xrdxtsfTcg":{"text":"If you are up in the air on what to get, then do the taste of New Orleans.  You will not b","useful":0,"cool":0},"lwZ40FSyv6i3qwKjVeInTA":{"text":"Walking around bourbon street on the first day of our honeymoon and finding mambos and the","useful":0,"cool":0},"RJxN2RbwI0v6oykjPfM80Q":{"text":"Not a bad place to get food! It is right on Bourbon Street. They do make you sign in for c","useful":1,"cool":0},"8m5iSZw17KA02H37BYGzAg":{"text":"Great little watering hole with good food. We just happened upon this place by chance in t","useful":0,"cool":0},"aJcb5KDrw53SHbopDmGNkw":{"text":"Leo was our server. He was kind and attentive. I loved my experience there. Would definite","useful":1,"cool":1},"z2_gr_BJEBKKpKm_BRJlCA":{"text":"Was really excited to come here from recommendations. However the front hostess had the wo","useful":0,"cool":0},"okc9nVk1FMaifY3Atb9s4Q":{"text":"Great place to experience New Orleans cuisine. From seafood to desert. They have it all. G","useful":0,"cool":0},"zZT2ZEPOHtdEqCeRRGTtuA":{"text":"Food was yummy, nice atomsphere and décor.  Alligator bites were a bit oily.  Crab cakes w","useful":0,"cool":0},"eDHjTOVIvtQItwRHBNyA6w":{"text":"Awesome joint. Solid food. So glad they had the oyster specials. Smoked a cigar up top on ","useful":0,"cool":0},"ebf3Ew2H7OWmUDk9zKTiVw":{"text":"What a wonderful experience! We had the Mambos world famous oysters and they were exceptio","useful":1,"cool":0},"5tgEEwU54mm2ih3soG1mhA":{"text":"There's a line but it's a perfect opportunity to people watch. Get adventurous here, try t","useful":0,"cool":0},"aqE9TDuQPQdMRYQXBw3bMg":{"text":"Long Wait but Definitely Worth It....  The waiter was awesome.. Kudos to Greg for the upbe","useful":0,"cool":0},"pmXtGFzdcDjb0PdB94tPzg":{"text":"They got us in quickly. The waitress was busy but got to use pretty timely. The food... ok","useful":1,"cool":0},"FlClyf_BMIDvnGuchge61w":{"text":"Such an upscale spot right off Bourbon. We sat by the window and got to people watch while","useful":0,"cool":0},"BQq5MrtPQVElMuZZopXJLA":{"text":"Oysters: poorly shucked, full of shell bits, featuring world's tiniest\nPasta: so-so\nWaiter","useful":0,"cool":0},"credPLY142y-NdA4mVFR-w":{"text":"Stopped in to try their chargrilled oysters, as it was pretty late on a Monday night and o","useful":0,"cool":0},"9lWbSRsxZq0zbI8H_xj83A":{"text":"The food was better than I expected!!! The service was fast and it was very clean and our ","useful":0,"cool":1},"di3o8oyvh1nM6fcfLy_k0w":{"text":"The food and service definitely didn't disappoint. Demetrius helped above and beyond with ","useful":1,"cool":1},"3sTAdu1zpKunhiGobH0k3A":{"text":"Yummy but heavy food (although I guess that's what we signed up for!) Service was very goo","useful":0,"cool":0},"LAjtULGiBfqEXkymZxjT1g":{"text":"If I could give this place 10 stars I would . We were a party of 15 and the way the wait s","useful":1,"cool":0},"kNjzkob2jXy8pRXug9nwxw":{"text":"Food was delicious service was awesome! Crab cakes are to die for!!! I also had the seafoo","useful":0,"cool":0},"n6mSrm_TwQ0BCcoPFkoxHQ":{"text":"Food was bomb, our first dinner stop in NOLA and it was a fantastic way to start our trip.","useful":0,"cool":0},"X_RrYLRZwXP_iPrsBTn_mw":{"text":"I was so excited to try out Mambo's after reading great reviews from Yelp and browsing the","useful":0,"cool":0},"DZyZLDmxRjAdegGL12mR8A":{"text":"This spot is great for a late night bite to eat after getting in from a late flight.  The ","useful":0,"cool":0},"4gzvM_kT52qebxShdgQphQ":{"text":"Mambo's is right in the French Quarter so you'll have to walk through all the FQ offers to","useful":1,"cool":1},"H-ZrF_mKSXIMxDMRYdGs3A":{"text":"This spot is perfect right on the strip off of bourbon st (great for people watching). We ","useful":0,"cool":0},"rr1POdArI1c9CEcMMiM-xQ":{"text":"Our first stop in New Orleans was phenomenal. Every single bite of food made us say \"oh my","useful":1,"cool":0},"B-KYHuU57yMGz8qHfhbFTg":{"text":"I'm sorry the food was good but the service was HORRIBLE !!! It took us over 20 min to get","useful":1,"cool":0},"IClmNJq5-ugmCCRZMlCDFQ":{"text":"We had an amazing dinner last night at the bar. Chris was our bartender and was amazing! W","useful":0,"cool":0},"HnXCV43R0xWIM5MIcKh8cA":{"text":"The quality of food not good. Fish was dried out in the oysters which were supposed to be ","useful":0,"cool":0},"ayoH2Un5B9hMNxPZJvm8FA":{"text":"Awesome service. Covid friendly. Breanna is awesome and so hospitable. Definitely will com","useful":0,"cool":0},"rr0yClMpeZg6qLW8bjBssA":{"text":"I enjoyed my meal here at Mambo's. It's definitely a family friendly restaurant. The servi","useful":1,"cool":0},"6XwrRuFdjm4GmSwTWl5hLw":{"text":"There were a few restaurants that were open near Bourbon Street on a Wednesday evening and","useful":0,"cool":0},"H5FbwsLNtebB0CTY0Jc1zg":{"text":"We had friends to visit last month and suggested we try this place. We arrived before the ","useful":0,"cool":0},"2QJKxv0_9wtuZbJUOtaALw":{"text":"Everything we order was delicious. The butter garlic sauce on the oysters is to die for. O","useful":0,"cool":0},"4a80qsMdu0DP9VQ-iO7zmg":{"text":"Delicious! Line went by relatively quickly,  worth the wait.  All dishes we had were flavo","useful":0,"cool":0},"8cUPcjzpP7OiuAmOk-plyQ":{"text":"Be prepared to wait but know your wait will be well worth it! Great Staff, friendly and po","useful":5,"cool":3},"pgbYMXMdqb5q8l8P6XXYDA":{"text":"The food and service was amazing even during the rona. The Dick Bacon Wontons are fire. Ga","useful":0,"cool":0},"CmNFtGpGAfI09qpnZdww7A":{"text":"Wow! What a phenomenal dinner! Our waitress Rasheeda gave us impeccable service. Even thou","useful":0,"cool":0},"Kb4pPkuiVmpsrxl-M2nZEw":{"text":"We went on a Friday night it was busy. It was 1st come 1st served we had a party of 8. Ser","useful":0,"cool":0},"hu3SrDWb9CRsWL_qi3V56A":{"text":"Having a great meal and drinks at the rooftop patio at Mambo's. Great food and drinks and ","useful":0,"cool":0},"ROlA6Egs7uxFE-f8SZ-iLg":{"text":"AMAZING quality!!! My fiancé and I sat on the third floor at the bar and Roy the bartender","useful":0,"cool":0},"TUnpYFM9Ds2i_1k2dw8LCQ":{"text":"Overall the food was good! Well seasoned and warm. The burger was a little less than stell","useful":1,"cool":0},"aPgue9sfYqizwyaMzMBzVg":{"text":"We had lunch yesterday and it was so good we had to come back!\nYesterday's lunch started w","useful":1,"cool":0},"VGos3LHC8MkhECggLPbQbQ":{"text":"This was our first time at the restaurant (we're visiting NOLA for the first time) and dec","useful":0,"cool":0},"Gy9iaiuVeDLTXTticN-PIQ":{"text":"I was walking on bourbon street and I was freezing. MAMBOS had the best heaters! The barte","useful":0,"cool":0},"vVECmQpfoVFOxrBm770SwA":{"text":"This spot is one of the best. I ordered to go and everything was on point. The jambalaya, ","useful":2,"cool":1},"0TjhUVxFZBaeVtGRRWWPxQ":{"text":"Once again mambos was great. The food was on point and i did not know they had mustard gre","useful":0,"cool":0},"suavjPGMOnSqVEM57nJjog":{"text":"Great found. The wait was a bit long if you want to  sit on rooftop. If you sit inside, th","useful":0,"cool":0},"zvshwm807ILFZfsPyLd8Ag":{"text":"This is my first time visiting NOLA. I picked Mambos from the Yelp ratings and I was not d","useful":2,"cool":3},"ddCyF0syoaiRPOwH4BM17w":{"text":"Mambo's is truly a Nola staple. They have all of the classic Nola dishes and are convenien","useful":1,"cool":1},"JwDWpsA9YDl85o0cjVExRQ":{"text":"First restaurant experience in New Orleans. The food was delicious and the service was gre","useful":0,"cool":0},"kuwOhLc0-3K62gNNxPCBdQ":{"text":"One of the highlights of my trip to NOLA. We'd been eating all day but Mambo's was on our ","useful":0,"cool":0},"n5nJL4aowvkcP2FkwfcRuA":{"text":"This spot is worth braving Bourbon Street. It has the cutest rooftop bar and the service i","useful":8,"cool":4},"2wmjROvXToqKHOUZNh0eYA":{"text":"If, like me, you believe you have to pay the devil his due and have dinner on Bourbon St a","useful":0,"cool":0},"VW-dMlWHwOaV_kM2mlE8pQ":{"text":"We were looking for a place to eat lunch but a lot of places were closed. We saw that mamb","useful":0,"cool":0},"6eDTVki97EGeHOJwsl-GyA":{"text":"We stopped in for a late lunch on our last day in town. Our server was friendly, the servi","useful":0,"cool":0},"Qjf9Qz3K-EwXxwxGqpymfg":{"text":"Very good food -- perfect for soaking up the alcohol you undoubtedly drank too much of on ","useful":0,"cool":0},"EZ1BHR0WeaIq0y9Rwt2Wfg":{"text":"Okay food but an incredible view! Also the ONLY rooftop bar/restaurant on Bourbon St! It's","useful":1,"cool":0},"jmy6D9CYkZVejVyQLtXJGA":{"text":"Catfish platter and Cajun fries were bomb!! The staff was friendly and food came out quick","useful":0,"cool":0},"QYqfLC9QXS_3ONF9r8UqnQ":{"text":"Came here for lunch on Friday, \nOrdered shrimp poboy, catfish poboy (1/2 blackened & 1/2 f","useful":1,"cool":1},"KEnfvjfUfcINTNOZt-rNXQ":{"text":"Everything about this dining experience was excellent, starting with our wonderful server,","useful":0,"cool":0},"L8lbHppfECK53wZFluzSzA":{"text":"So far THE BEST place we've had chargrilled oysters in New Orleans! We tried the mambo oys","useful":1,"cool":0},"MJLuwXZITZJZiHBN5lKLoA":{"text":"Holy crud, did they screw up our order. They didn't send half of the items we ordered and ","useful":0,"cool":0},"Sox02yTfu4n7uwVcMMyGgw":{"text":"Located right on Bourbon Street! Beautiful view from the rooftop. If you have an opportuni","useful":1,"cool":1},"z_M2mUDbk3a5T57c5q-1eQ":{"text":"Ordered on Yelp at 9 pm.  Headed over at 930 to find they hadn't received my order.  Talke","useful":0,"cool":0},"MuFM6lvB9kTxV-Vwc0JMJA":{"text":"Well worth the brief wait to dine on rooftop. Mambo redfish was fantastic. Great service f","useful":0,"cool":0},"GSvP9wBHNQnSAdgMpSMg2A":{"text":"Easily the best meal I had on my trip. We shared the blackened chicken alfredo and it was ","useful":0,"cool":0},"EqnhilPanqn7S6giXMdMuw":{"text":"One word: REDFISH. Coming from Los Angeles, we don't have this on our menu. Ordered this g","useful":0,"cool":0},"IVNYlDz_w88n8fE1Nm2__g":{"text":"The service here on Mardi Gras weekend was still amazing. Taylor and Tamisha were excellen","useful":0,"cool":0},"tAICkJXySlF8oRAISklN6w":{"text":"Poor service really diminished from my whole experience from this place. The only pleasant","useful":1,"cool":0},"Ym0JPa2ZpBgOkhoKlJxkPw":{"text":"First time I went there was a line and I waited quite a bit. The line kept getting bigger,","useful":1,"cool":0},"V541eXmDkGH3IRsAcXV84g":{"text":"Overall we had a pleasant experience here. The wait staff was friendly and checked in ofte","useful":0,"cool":0},"21i29aglsVyCVw7eIsEwzg":{"text":"Went to mambo's for their NYE party. Paid $300 for what was supposed to be a top shelf ope","useful":0,"cool":0},"FM6VniMwVqD5R1qitfaxYQ":{"text":"Would have been 5 stars for service, food, and ambiance/general cleanliness. ONLY issue wa","useful":0,"cool":0},"gQyZbQJDI7k21OwCDwwwRA":{"text":"Our server Steven was BOMB! Food was good! We came in early before dinner times to avoid t","useful":0,"cool":0},"YADztUdSNBJmRYj6KVTkPA":{"text":"Visited this establishment twice during my visit to NOLA. The food was okay I really was s","useful":0,"cool":0},"VCEw1HPRGEUGcYJQ6Ms6Kw":{"text":"amazing food! we had the alligator bites, gumbo and fish platter and every single item was","useful":0,"cool":0},"YfOipwdt5mQl9BFcMALwgg":{"text":"First time in New Orleans & their good was delicious. The first day my bf & I went Quincy ","useful":0,"cool":0},"IE66b8pzHXVfd3UhBjzhxw":{"text":"Talk about quintessential New Orleans cuisine. Look no further than Mambo's . Came here wi","useful":3,"cool":1},"c9ZYLzIO1z7AEVpxwr9-Mw":{"text":"This was so worth it had the fried fish platter was enough to get full and take some home.","useful":0,"cool":0},"P0nYALuVspSx3_7slTxGNw":{"text":"The food was amazing. It's definitely overpriced being in the French quarter. The seasonin","useful":0,"cool":0},"HwJWc1nZ7BWr7IhvgpUYrA":{"text":"Decided to take a day trip to NOLA considering my boyfriend and I had never been before. T","useful":0,"cool":0},"EyQ2pURpKiWH8HMqre9Ejw":{"text":"Catfish Po'Boy was great, as was my drink. Waitstaff were also attentive and their service","useful":0,"cool":0},"5-VSQkddOaURJKvHx9c8qA":{"text":"Great food and the view from the rooftop was amazing. I can't wait to go back and try some","useful":0,"cool":0},"sU6Oij8W-hAtKF_kblL8eA":{"text":"Great lunch, friendly staff. My wife and daughter got shrimp Po Boys, I got a fried assort","useful":0,"cool":0},"ZrJLNWF9DslqGerdbiB0Ig":{"text":"It was one of the worst restaurant experiences of my life.  Got in line to wait, and not l","useful":0,"cool":0},"2-kLrm7wjs10eC2tWRvQyA":{"text":"One of those classic must try's when you're visiting Bourbon Street! Definitely did not di","useful":1,"cool":0},"dunic_cCaM4ufkjf0KvmrQ":{"text":"Very late on posting a review. We did have to wait in a line outside, the wait wasn't too ","useful":0,"cool":0},"5xfgyzOqJyh4MVz4zXG2oA":{"text":"It may be good. We don't know. With COVID we wanted a window table. One couple already had","useful":0,"cool":0},"4fvrZEOUYZSj2kckfSJ6cA":{"text":"This review is for the famous oysters. They were delicious! They're big, cheesy, and yummy","useful":0,"cool":1},"w_dX5vvDcDKF-GXRrX5Y6g":{"text":"Placed my order online, waited an hour went back to the restaurant after the app showed my","useful":0,"cool":0},"B7HA-ppirmr5OCwBS7gSig":{"text":"The wait to get in was long, so we opted fot first available and was seated at the bar.  W","useful":0,"cool":0},"hcZbOJPcxoSWBw0c9uTnMQ":{"text":"One of the worst experiences I've had as a local. I think this place relies on tourists. W","useful":0,"cool":0},"5M4qrg_b2mnL6tgcXNHSng":{"text":"Loved the food. So delicious. We got the charbroiled oysters, blackened redfish, and gumbo","useful":0,"cool":0},"NOIOGgsEa6UQyug8Ed6wDw":{"text":"Went here on vacation with my cousin. We had raw oysters, mambo oysters, shrimp and grits ","useful":0,"cool":0},"pkNX6p19GDY2936IQnfnlw":{"text":"The food taste of New Orleans soup is very salty. The nacho appetizer is pretty good the f","useful":0,"cool":0},"KysQnigJXaILcfIrjKDeBQ":{"text":"This was our first spot we ate at in New Orleans. Honestly the service was slow but the pe","useful":0,"cool":0},"olDi-1mpxie_TVM3mWkyxw":{"text":"Great spot on Bourbon! Stopped in here for dinner on a Tuesday night. The line outside loo","useful":0,"cool":0},"OX-D_f7X_2vFQjPJ8XpSpw":{"text":"Not sure how this place has 4.5 stars! Food came out kind of cold and the Mambo famous oys","useful":0,"cool":0},"tHDM6sycKht9VFeyww_GpQ":{"text":"Came during lunch. Had the crab cake. It's was the best crab cake I've ever had. The sauce","useful":0,"cool":0},"SI-W_2MoVRHYsPVSB7Fz4Q":{"text":"I'm not sure if we came here on an off day but I was, overall, pretty disappointed with ou","useful":7,"cool":1},"JEuk9H84xGFLSTJ2q4ZdbQ":{"text":"Amazing customer service and delicious food! We also appreciated them following COVID prot","useful":0,"cool":0},"lkKDipHcClrKxXpkbdrcfQ":{"text":"Best place in New Orleans by far!\nEverything was delicious, could not have been better.\nTh","useful":3,"cool":0},"DWYcJYqesFrHMZDIDj7MGA":{"text":"We (my husband and I) came here today for dinner and got the special Zydeco Duck, World Fa","useful":1,"cool":0},"vXlMKjtEHkZ5wacB-TTK-g":{"text":"The food was out of this world!! Service was excellent and Whitney's service made the expe","useful":0,"cool":0},"E9TgdmPbLa60sOmTh1xh_g":{"text":"Nothing but awesomeness for this place.  From the service to the delicious food, there is ","useful":0,"cool":0},"GDCW93DKo_WqCQOLzKbN9w":{"text":"We came to Mambo's today and it was amazing!! the food was great. I ate the shrimp Alfredo","useful":0,"cool":0},"XXBRsEF6pSjHFMAwyG7thQ":{"text":"My friends and I traveled to New Orleans this past Saturday to complete a food challenge. ","useful":2,"cool":1},"rPyCrRJ6p77CKdwJudPAtw":{"text":"The food had good taste but the oysters were extremely small! They were not even close to ","useful":0,"cool":0},"WyeEck-FiJ8umNTT1KiiQA":{"text":"Crab cakes were ok but really too much breading was used. I would not recommend trying the","useful":0,"cool":0},"E6S7jtl_9Ygj_fVOSrvdgg":{"text":"Got the gumbo and jambalaya of course! Pretty good food at a decent price. Definitely woul","useful":0,"cool":0},"fv5Q6ijLypo39Wwrs00Kow":{"text":"This spot is good if your in a catch and need a drink/something to eat in downtown but hon","useful":0,"cool":0},"3QSQcyeX3tcgLMf9gLjAgg":{"text":"Only gave Mambos a star because I couldn't post a review with out it! Spinach dip we order","useful":0,"cool":0},"yt_f6ff6ty42V1LWOCNNiw":{"text":"Really good place right on Bourbon St. \nReally good service, Maddie was great!  \nAtmospher","useful":0,"cool":0},"ecsEFidq--0u8qYeWS3_5g":{"text":"The waiter Lovell was absolutely great! We sat on the rooftop. The weather was perfect. Th","useful":0,"cool":0},"WidKpXWF74ZI6R_FfQmHXQ":{"text":"Great friendly service! Food was amazing ! I have never got my food faster in a restaurant","useful":0,"cool":0},"uvzw6FjqBsLlJ_9EmblNKg":{"text":"One of the worst restaurant experiences we have ever encountered! We ate here based on Yel","useful":0,"cool":0},"Wmkpo6A6TBthH9Jv80SnzA":{"text":"Victoria was an amazing server! Had a great experience. Food exceeded my expectations. Wil","useful":0,"cool":0},"6xIhAC6GqmTK_UGRjzgtUg":{"text":"We were lucky and sat at the nicest table in the place at the rooftop. Beautiful setting, ","useful":0,"cool":0},"ivqrrUMq540xPX0Yma3W7g":{"text":"Service is incredible! \nSpiked lemonade is awesome!\nHad the crab cakes and alligator nacho","useful":0,"cool":0},"c5BeOZzTARcVuPb5zXjoQg":{"text":"If you go here, request Walter. He was not our server but was awesome from what we observe","useful":1,"cool":1},"LaP1PL2SRJK3v9RmOycXfQ":{"text":"Crab cake dinner was awesome. The creamy sauce that came with the crab cake was a good com","useful":0,"cool":0},"uch8_AE4G_KXWz0GKPxI9w":{"text":"Wonderful Crawfish Etouffee! Very good pecan pie too. We made a reservation to avoid stand","useful":0,"cool":0},"fninTwf5GeoI7zaaGsL4Rg":{"text":"The service is immaculate! Our waitress Maria was very nice and attentive. She also sugges","useful":1,"cool":1},"jDvAc3gNn_Rwk_0cKg2omQ":{"text":"Amazing experience. Julio & Joshua were the BEST; so sweet and hard workers. Before we cou","useful":0,"cool":0},"xr4i_eYvByAF1DvqzWWwXA":{"text":"Went here for last minute dinner on bachelorette trip and was pleased with our service. De","useful":1,"cool":1},"AvS4nacG5Bvg9DanDD0hlA":{"text":"Great food, server Ashley W was so friendly and helpful! Definitely a good restaurant to t","useful":0,"cool":0},"Y5I5uYPuridKVXULxd8QqQ":{"text":"One of the first restaurants I visited when I landed in New Orleans Thursday night. Mambo'","useful":0,"cool":0},"7enU6RW8DMmH6FFROX0ljA":{"text":"Wanted to provide a 4 star rating , but was extremely disappointed in the size of the oyst","useful":1,"cool":1},"5TRi67EGK7nBmsN1SenWPA":{"text":"The oysters were banging with flavor they have a good thing going on here. The fried seafo","useful":0,"cool":0},"AxxBeg0l3_58oeqYNhsnlQ":{"text":"#AMAZING #PHENOMENALFOODANDDRINKS Mambo's was a HUGE homerun. I came to NOLA to celebrate ","useful":0,"cool":0},"HaQ0_m_biG7nXyEcYcIg0g":{"text":"Mambo's famous oysters with sauce that overpowered the taste of chargrilled oysters... not","useful":1,"cool":0},"bHcaMFJyQ00RIIRkCaZi4w":{"text":"While strolling down Bourbon Street on Halloween Eve, we were stopped by a guy named Isiah","useful":0,"cool":0},"QxRgTrckOJxWocDgHVOxYQ":{"text":"When I say the food was the bomb I mean that. When we arrived to the restaurant a was a wa","useful":1,"cool":0},"oMQzAzY7vpFTMdM1ckElsA":{"text":"Waiter was super friendly. We got the oyster po boy, shrimp and grits, and taste of New Or","useful":0,"cool":0},"GeDroDEyddBlkv4wins7EA":{"text":"Loved it. We will definitely be going back. The oysters were great whether charbroiled or ","useful":0,"cool":0},"R4wBTTcHbCWa2u34v_jnyg":{"text":"Mambos was an amazing restaurant to choose for my birthday dinner while in NOLA! Although ","useful":1,"cool":1},"cYSUhdZBk6veqtqSyPnjBA":{"text":"Amazing food - best meal we ate in New Orleans. Blackened Alligator Nachos with Blackened ","useful":0,"cool":0},"yfVr1hdimRx3cOR7J1TyHg":{"text":"Great food and our waitress was perfect! You must try their oysters and happy hour....you ","useful":0,"cool":0},"yPCgH5yatTZq3AfAT6FmSA":{"text":"Better than you would expect on bourbon street ..... a line outside and pretty good servic","useful":1,"cool":1},"sIVVpfn4Tzr6Fil25XQX1Q":{"text":"Service was great-we had reservations so we got right in. We sat on the rooftop which was ","useful":0,"cool":0},"7ptYre88cDHV3RpVxuDFeg":{"text":"This was absolutely the best meal we've ever had!! Krystal was so nice and the chef came o","useful":0,"cool":0},"OFdATfyOJT_Gf8V6xCnDzg":{"text":"Best oysters I've ever had. The Mambo Oyster are to die for, every time I come to NOLA I w","useful":0,"cool":0},"qGGUimFJ_1y3YRHA4sfIXA":{"text":"This place was pretty amazing, we ended up going again before we left New Orleans. We had ","useful":1,"cool":0},"xlGMYNJL3XVZR_lHDAX_7w":{"text":"We're in town from New York. This place absolutely  hit the mark, this is my second time i","useful":0,"cool":0},"TATh-gqr8qnRDor5kXgfpQ":{"text":"Ordered this to the hotel because it was late and we didn't want to go out in the rain.\n\nW","useful":0,"cool":0},"I6SHXtbnZ38Zw-mmDY3Ceg":{"text":"Okay if you want to two best servers in all of New Orleans...go to Mambo!  Ask for Julios ","useful":0,"cool":0},"CLQKzv28sR1Tg_i1WJUhYA":{"text":"I'm still thinking about the red beans and rice with fried chicken. I visited with my 18 y","useful":0,"cool":0},"S5gga33Qifglcq9tFk8e8w":{"text":"Food was rushed and my oysters were burned. Being from New Orleans this was the worst batc","useful":0,"cool":0},"e10LlI8-Hu4rCrlIv8XDSA":{"text":"Thank god for this pandemic otherwise it's almost impossible to get a table here without a","useful":0,"cool":0},"s4diXZCRO7RuQP7vuOh1BA":{"text":"First time here in New Orleans with the family. This is by far the best oysters I have tri","useful":0,"cool":0},"9O6oii7DDro8cP9IpabeTA":{"text":"Don't appreciate being lied to by staff that they would accommodate our party if we came b","useful":0,"cool":0},"mDKEXqqW183YYKZ8WqR9Lw":{"text":"I ate the best crab cake, and had the best Cajun Kool-aid drink ever!!! Service is excepti","useful":0,"cool":0},"CYzSAokC3ErPyThel1mxjQ":{"text":"We waited in line about 30 minutes and it was WELL WORTH the wait! We split the May specia","useful":0,"cool":0},"ol_O3bf39dSzwSoi5AfY3A":{"text":"We were sooo excited to try this place! We had made a reservation, and had a table, but th","useful":1,"cool":0},"9_-rn0GxU6qoYwr-FCd4kg":{"text":"I am not a huge fan of oysters but this changed the game. These were char grilled to perfe","useful":0,"cool":0},"sjidHGdicVM83Ts6hk1tkw":{"text":"The food is pretty good, but the prices gave it 3 stars! They charge for water and it's $6","useful":0,"cool":0},"LMHatyeZWtyrY23Q-5bKZg":{"text":"We were served by Ashley, she did a good job! We ordered the bbq shrimp appetizer and the ","useful":0,"cool":1},"rxSxdlAUIhybmEXmw3jttQ":{"text":"Good food with rude people is like bad food. You have good service only when Julie is not ","useful":1,"cool":0},"5mQiNQbVjiJBddJGSPnwPg":{"text":"Delicious!! The food on Bourbon St has become garbage over the years. But, Mambo's was a r","useful":1,"cool":0},"qFwa0xZMqlLqDgvU0zLVTg":{"text":"Good! Hearty! Plus, get to experience Bourbon Street while eating!!!!\nOnly recommendation ","useful":0,"cool":0},"RdDAjwtjLDAHCPCx4hiPoA":{"text":"We sat in the back courtyard and had what seemed to be a pretty nice server.  We later lea","useful":0,"cool":0},"Sx44koYjZ6ShSHi_k3czGw":{"text":"If you are planning to come for dinner, make sure you have a reservation or you will never","useful":3,"cool":1},"lprqDIkFCAXWnmVGE19pkw":{"text":"Hello we came from chicago and we love this place ashley our server was nice and polite th","useful":0,"cool":0},"YzH0EnkhWT1kcJcLFhkbRQ":{"text":"I wanna rate the food, but I was sat, and waited for 20 minutes with zero service or ackno","useful":1,"cool":0},"sYDypcI8jcClupZN8hAmqQ":{"text":"My husband and I stopped by yesterday for lunch. The waitresses are friendly and the food ","useful":2,"cool":1},"W6yShRE5oWeFp7TfIFmWRQ":{"text":"We touched down late night and was starving. Super glad Mambo's is open late. Decided to h","useful":0,"cool":0},"Bza67QcRUMKYFrLJLDSUvw":{"text":"We went here on a whim after reading the reviews on Yelp and we were really looking forwar","useful":1,"cool":0},"n0rr_5R1ebxbs2E28m3osQ":{"text":"First time in NOLA and the food I've eaten thus far has been phenomenal. I ordered Red Bea","useful":0,"cool":0},"wyQnVYwp9LTRFUwTWiePgA":{"text":"Taste disgusting. Bad oyster being placed on old oysters shells. This is insulting. $65 di","useful":0,"cool":0},"oZhNPbYc6tcF0S8I9W-0pQ":{"text":"Walter was the best! He not only danced his way to us, was super friendly. The food was gr","useful":0,"cool":0},"u7zcEupGvib8uvkZhx_0rQ":{"text":"Came in for a late night dinner. So, happy this place was open the mod was a very friendly","useful":0,"cool":0},"beX-I2MR6xdDUaEaqPbJ7A":{"text":"We went there three times during our stay, that's how much we loved it. Loved their oyster","useful":3,"cool":0},"cDALofbtaNAHbQwcHy39qg":{"text":"Their bbq shrimp on their appetizers is a must!! I was told you cannot go to New Orleans a","useful":0,"cool":0},"JOAU7DnVxQnx14PS2iL0TA":{"text":"Average gumbo. Same for jambalaya and red beans & rice. Great hurricane though! Was ranked","useful":0,"cool":0},"lJ1bi_w4fwgXRSFkqGU2aA":{"text":"Popular place so be prepared to wait for a table. It's one of the few places that had a li","useful":1,"cool":0},"s2q4shgp3hrCgz-US6JN8Q":{"text":"The food was amazing and our server, Delicia, was so sweet and personable! We brought our ","useful":0,"cool":0},"4bZesuOEjto-X1T4lfmS-g":{"text":"After being disappointed with a restaurant in town my husband and I decided to try out one","useful":0,"cool":0},"FLlrn4fa6sgVxWb6XO6keA":{"text":"The rooftop was amazing!! The oysters were great. I felt like the poboy could have had mor","useful":1,"cool":0},"UrJHOr6InGgBDljhvSLwLA":{"text":"This was a classic New Orleans spot to eat dinner. I really liked my sazarec which wasn't ","useful":1,"cool":1},"LzwTqOJrxDoLFcy5mHlU3Q":{"text":"Late Saturday afternoon and was able to get a seat on the rooftop bar.Waiter  was good and","useful":1,"cool":1},"aRZ-3JfZefiBWE0w8dptdQ":{"text":"The staff was so friendly and the food was delicious!! I ordered a take out at the bar bec","useful":0,"cool":0},"yIhJso0APD_95ZO7aNRZuw":{"text":"Great place for classic New Orleans food! Had a small wait but the food came out super qui","useful":0,"cool":0},"GudKA8vVcJYh8HQOMPLFFg":{"text":"Amazing amazing food. I've only lived here in New Orleans for just 1 year, and I'm not sur","useful":7,"cool":7},"o8LGQ5uhHT9Nzml_L3pxtw":{"text":"My friend and I came here for dinner. Settled in the heart of the French Quarter this top-","useful":1,"cool":0},"6B7y21_Ye2SwgpVEjGfWDA":{"text":"Not great. I wish it didn't have as many stars because that's why we went. The oysters wer","useful":0,"cool":0},"NWjdhUcK20uocEx1zlDPGA":{"text":"Food was superb! So glad we got reservations (which I highly recommend)! Line was down the","useful":0,"cool":0},"tRCt6FuwGmt7_pECOM_nZw":{"text":"Food was good, quick, and reasonably priced for the quarter. Shante was great. We'll be ba","useful":0,"cool":0},"L2swBzPEG668uP1VmIzofA":{"text":"This place was amazing!! I ordered the \"taste of New Orleans\" and also tried gator tail fo","useful":0,"cool":0},"KYfADKEe3NyGtZN0crBRXw":{"text":"Stopped here for a quick bite to tide us over until dinner! They had really quick service ","useful":1,"cool":0},"ykljoEkhVbyedk4VA_yrwg":{"text":"Not my favorite. I got a $29 seafood combo platter with fried fish, oysters, shrimp. It ar","useful":0,"cool":0},"Yq3Rkw6pznxhlCTnLlK7vg":{"text":"Mambos was a spot we came here on our first night here. There was a bit of a line out the ","useful":7,"cool":4},"JChyvmp1pSynVFhCPH5L_Q":{"text":"Honestly, what is there left to say? Amazing food, great ambience on the rooftop with a gr","useful":0,"cool":0},"xCSJpHZ2rMJVc8rtUWFThQ":{"text":"Friendly service but the food is just ok. The starts, number of reviews, and partial all t","useful":0,"cool":0},"Ub-UtPiQ_-TaAVCB3i93pQ":{"text":"I was here Christmas night. The line looked a bit long but I only waited within 10 minutes","useful":0,"cool":0},"kOqiCHcVLG78OcK_SUIdCA":{"text":"Fantastic food and great outdoor seating. I ordered the Jambalaya Pasta and it was packed ","useful":0,"cool":0},"LmATyIhVp9EO-tUMzo_tug":{"text":"Decided to not wait for the long lines at Acme Ana Oceana's and eat at Mambo's instead - i","useful":1,"cool":0},"OekMCQ2dB3gk6CNa3mnvrQ":{"text":"Presentation was a lot better than taste. I was totally turned off finding pork in my must","useful":0,"cool":0},"-9Pryr0v4dGBlTWtKNLvaQ":{"text":"Very frustrating. We came and put our names in and asked to sit up on the roof top. They t","useful":0,"cool":0},"FFALmW-Bg01hmD5lP4y7Ig":{"text":"Probably the first time we had dinner where everything was amazing.  There is simply nothi","useful":0,"cool":0},"ndJ62dpHhNE9HbLkCWNOCQ":{"text":"Don't let the location on Bourbon fool you, the food here is very good.\n\nGreat sazerac her","useful":3,"cool":0},"DB9cekRk1dnQi_8D1U1XsQ":{"text":"Waited outside for 35 minutes to be seated on a slow Monday night to 'allow the kitchen to","useful":0,"cool":0},"Qxonczypa3kkjlVDmiPUtw":{"text":"We came here on our first night in NOLA. There was a line but it wasn't that long of a wai","useful":3,"cool":1},"pXDuNdO2fOHWSTdci_kJ8A":{"text":"The food was really good. I got it delivered, so no trip down Bourbon, and no service feed","useful":1,"cool":1},"XfkbMZQjEiZekgbpmcgq3w":{"text":"We are in NOLA for the weekend for the first time and wanted really good local cuisine wit","useful":0,"cool":1},"HEjw7QkkU534Z3Gi34IaTw":{"text":"I want to say the waitress was amazing and apologized for the wait we had to endure in a f","useful":0,"cool":0},"BVqRiXZqTqVucb32d8pmTg":{"text":"Only rooftop on bourbon!! They've only been open for like a month but food and service are","useful":1,"cool":1},"nDMixol3n8AAY7XMoBmgxA":{"text":"Absolutely amazing service. Wonderful staff, very attentive. My jumbalaya pasta had so muc","useful":0,"cool":0},"Jbljbdabx_lbe1MmJWxVaw":{"text":"Saturday I went to the restaurant located on Bourbon street and I had the worse experience","useful":0,"cool":0},"kwXtWXZIvCbbrFET4VtzwQ":{"text":"Bypass the gator nachos. You will however find the blackened red fish amazing! The creole ","useful":0,"cool":0},"KpyFmUDwwtMBrHoYk2kxSQ":{"text":"On my first visit to New Orleans, I wanted to make sure the first meal that I ate was at a","useful":0,"cool":0},"0ZzePHFQOAgXQZ_RccpKzg":{"text":"Chose this place over Oceana Grill and somewhat regret it. Food was very mediocre (okay) a","useful":0,"cool":0},"sgcl6k7W2SAqLYhZOy_CkA":{"text":"Pretty unimpressed with this restaurant due to the food and drink quality. The oysters tha","useful":0,"cool":0},"c9BsyfFd8TyNq7hetB_VbA":{"text":"Food was great and service was amazing by Josh. Made sure we had all our food and checked ","useful":0,"cool":0},"WPqDSxu4xUQe1c7JeYrVvw":{"text":"The food was AMAZING!!! Our sever was really nice too. \nThe stuffed redfish was OVERSTUFFE","useful":0,"cool":0},"FkxJwNFC7gFQ7RxTZl3cog":{"text":"Faith was the best server you could get! Sweet and attentive. The alligator po boy was del","useful":0,"cool":0},"yBFuLQDBOO3AoWMi9APGlg":{"text":"Amazingggggggg seafood , their seafood mixed blackened by platter was more than enough for","useful":0,"cool":1},"LS6p1x4gZqMgeSAKVdw-5w":{"text":"We went here for dinner this place is on bourbon street and we stood in line for an hour. ","useful":0,"cool":0},"pNzRnCwjykPnoOTKfNDNIQ":{"text":"Omg, y'all.... This place is amazing. Great location on Bourbon Street, with a rooftop bar","useful":0,"cool":0},"ducAZW7Aet4B22H-P-NfjQ":{"text":"Best Alfredo sauce I've ever had! No wait, delicious restaurant on Bourbon Street, the sta","useful":0,"cool":0},"K3_j2JbYI4u_KaGfJzFtSQ":{"text":"Stacie our waitress was the best fast service very nice person nice atmosphere great food ","useful":0,"cool":0},"Ju5Yil-pxo36qjUrHsQTeQ":{"text":"Authentic New Orleans food but I did not enjoy the Oysters as much as I wanted. They came ","useful":0,"cool":0},"EeLa0Mx4HgjNrlIsNEgLug":{"text":"I was hoping the food here would be decent based on the reviews, and while it was ok, you ","useful":1,"cool":0},"k2rjxu5AWFJbKNIbqpdxUw":{"text":"This spot was great for our first night in NOLA. It was a little loud but very casual and ","useful":0,"cool":0},"M95U2HmMy91jcPlMv8-MpA":{"text":"During our recent trip to New Orleans, a local diner recommended Mambo's. Reviews looked g","useful":0,"cool":0},"Si8NM5tQLCtYsYMraYiA_w":{"text":"Food was amazing, service was great. Good location on Bourbon Street. We requested rooftop","useful":1,"cool":0},"uL0t8sjy-DvA55amSpU05A":{"text":"This place is lit. Great economical priced drinks and awesome food. Draft beers are just $","useful":6,"cool":6},"DVkK7pESi7wcilWDkINnqw":{"text":"Service and Staff was good. However the Manager of the Restaurant doesn't seem to understa","useful":0,"cool":0},"Evb9uzOS14YvpKV_6Sejlw":{"text":"One word: Phenomenal!! Myself and 3 others were able to get a rooftop table on NYE and whe","useful":0,"cool":0},"0b5QmZT_3nLzVsepz_xJcA":{"text":"We got stuck in the back room for about 8 minutes and when the manager realized we hadn't ","useful":1,"cool":0},"oEloYoFRDUptx5x_P609pg":{"text":"Brianna is amazing !! Super friendly excellent service !! The food is literally to die for","useful":0,"cool":0},"dvifNjdQWLz5SiclnfGa5g":{"text":"The food and the service was incredible! Especially during pandemic Delicia was our server","useful":0,"cool":0},"sl2RT2s9KMObfun6WZucYw":{"text":"Ordered through grubhub and it was one of the best delivery experiences I've had. I'm from","useful":0,"cool":1},"72bxcSM3Bq0Y375sB9Vy7g":{"text":"This place was amazing! Family meal was only 36.99 had a huge portion of rice for the whol","useful":0,"cool":0},"PoIWNfDhoGjqeGoMf22L-A":{"text":"4.5 stars is overrated. I was probably at 3.5. Friendly staff but frankly I get better oys","useful":0,"cool":0},"RVfPXfhz22tp3ihTl8KCFg":{"text":"We ordered takeout and it was ready early even though they were very busy so that was grea","useful":0,"cool":0},"N61FRK52jEOKeMYZNCcSRg":{"text":"I had an amazing experience at Mambo's. My server Stacy was Awesome! So knowledgeable and ","useful":0,"cool":0},"cNlEFovG9pA-dPTLOUrNTw":{"text":"Walter drew me in the front door playing his harmonica! Undecided about my drink, William ","useful":0,"cool":0},"vz7swScgU-MpQBmnMSn1yQ":{"text":"Short summary: LONG line but delicious food with superb service. Went here during a weeken","useful":0,"cool":0},"X2BrsN8qsY5AWcPqg185hA":{"text":"This place was great. The ambiance was nice and intimate. The staff was friendly and profe","useful":0,"cool":0},"5xq2WQM7k53BGAWBSPjerQ":{"text":"Place was great. Good good, fun to watch everyone on Bourbon Street. Great staff. Christin","useful":0,"cool":0},"nuMX_jyfZvc02tToP0wF1w":{"text":"Adriana was great she took so good care of us that if I was old and she worked in the old ","useful":0,"cool":0},"byKNkd9MXeiI8bcvHnSBKQ":{"text":"I was sat in a super timely manner and greeted by our waitress shortly after. My group had","useful":1,"cool":0},"ipkVQWx1saZPRvBGfjdTTA":{"text":"Very underwhelming. Much better options nearby. \n\nI should've known by the very unorganize","useful":3,"cool":3}}