{"UmWoK_TLQke-S74R8gKAoQ":{"text":"So I got there and I saw a monte cristo sandwich on the menu and sat down and found out it","useful":2,"cool":1},"xfZpCUDpPNZPPTRWqPDhzQ":{"text":"Average breakfast. Coffee and omelet were okay. Good location if you're in the quarter and","useful":0,"cool":0},"Iji9R75VJJauEw47rXB3gg":{"text":"Best crepes ever..!! Had the Nutella crepe and a chicken crepe that were just delicious. A","useful":0,"cool":0},"_u0hBUgv9lqrv6-9un4qog":{"text":"Food was great, I was floored when I saw the bill 2 days later, 18.00 dollars for a (1) co","useful":0,"cool":0},"eno97-kGlxa7y10VshRMKA":{"text":"Generous portions, fabulous flavors, and relaxed atmosphere. This is a must stop for break","useful":1,"cool":0},"t9Vz17jUXUXrq9mvlNh6Gw":{"text":"Wonderful experience, chef and bartender came out to greet and serve. Love this place!","useful":4,"cool":1},"07yzbrDACqtvRQTygGebPg":{"text":"Their breakfast was one of the best breakfasts I've ever had. We ordered the quiche and th","useful":0,"cool":0},"8lP_Wfg4_mUT2VuNGnSl-Q":{"text":"Went here for Mother's day brunch. We sat down and immediately ordered mimosas. Shortly af","useful":1,"cool":1},"tB0EK9WcQP3TQTJJDAKHgw":{"text":"We came here for breakfast and ordered the chicken and waffles and the sausage egg and che","useful":1,"cool":0},"r1vgTvkmxiQ3AutZ5fSdCQ":{"text":"Service was great! Love the atmosphere. I got the eggs Benedict and the eggs weren't as ru","useful":0,"cool":0},"WfuGuiFxCw_8KHDMWXtjvA":{"text":"The service here was amazing, staff was very friendly. However, the food left a lot to be ","useful":0,"cool":0},"Xb-Mx08yyCTn7MRBoVosYw":{"text":"The food was good. I had the delicious Monte Christi. At the advice of our server I asked ","useful":2,"cool":2},"VjKkuRCuAOGK5LCVSAiH_A":{"text":"BEST RESTAURANT EVER!! Amazing service, let us in even when they were crowded with a table","useful":1,"cool":0},"lB16bA7ShgXmMH_prGVtmg":{"text":"The food is outstanding!  The service a little slow, but I would wait an hour for food lik","useful":1,"cool":0},"99K5jXb864IPu9UHwgMfOQ":{"text":"Stopped in here for lunch around 2ish. Had the simple dish of bbq shrimp poorboy. I've liv","useful":1,"cool":0},"EKvYigUy-FaUAh7WgMcnVw":{"text":"Excellent dinner and service! Quiet and relaxing  among the bussel of the French Quarter. ","useful":3,"cool":1},"a1357XHaZK11vFgVPRc86g":{"text":"Amazing food! Get the special, Shrimp and Eggplant Pierre...best of the New Orleans food s","useful":1,"cool":1},"hSW4fGLT2S-TGYZNqx3ZTQ":{"text":"This place is extraordinary. Jessica was bartending and made the most fantastic drinks tha","useful":2,"cool":0},"JT4pRIEexoqfgoADGeyxzw":{"text":"This amaze balls Russian bartender is the best ever!!! Oh and the French onion soup is to ","useful":2,"cool":2},"tBTWCP183AJe_QIeSE5oLA":{"text":"I'm only hesitant to yelp about it because I want to keep it all for myself and the lucky ","useful":2,"cool":0},"kmxCLqas7TMTLB6hRRvtlA":{"text":"Not sure what happened. Food and coffee were pretty bad and server was rude. I got the shr","useful":1,"cool":1},"F4Qe-TaGb0qe_GKSRdfUCg":{"text":"Just had drinks. No food. Open on a spring day is great for a cocktail and watching the pe","useful":2,"cool":1},"LyziEybhyJlXYZJiRTp9kg":{"text":"We had lunch here a little after the lunch rush so the restaurant was mostly empty.  The s","useful":1,"cool":1},"HnRDbEyhhmuoo2thJeRTRQ":{"text":"I found this little side-street restaurant by accident when I visited NOLA in December of ","useful":2,"cool":2},"p0UBjBJS-hnX_COg-GkeAg":{"text":"Cucumber Bloody Mary and Hurricane... Delicious!  Fast, friendly, comfortable atmosphere. ","useful":1,"cool":1},"sSbqw6lrLG3fy0jn23RiLg":{"text":"Stumbled upon this lovely spot on our last day in NOLA, we decided to stop here because we","useful":2,"cool":1},"dT_RIV6mO8Zfd3S75_38BQ":{"text":"Our party had a sausage po boy, french dip and duck crepe. ALL were delicious. Service was","useful":3,"cool":1},"9e-uJEDQOaRCWJ1vGjUoTg":{"text":"We really only came here for drinks. My husband said the coffee is \"fine.\" Our waitress Am","useful":1,"cool":0},"6miQQZT-tJcZl5l76quYow":{"text":"Just came here for desserts and to chill after a long day of walking. I had the bread pudd","useful":2,"cool":2},"sXifTUU5sa1QkDq-WZujKw":{"text":"Service was horrible. Food was not good either. I don't recommend this place. I had high h","useful":0,"cool":0},"89GsXQU5yDTMl-mtOfW-9g":{"text":"Had a wonderful supper here this evening. Ordered the shrimp and fried green tomato and ca","useful":3,"cool":2},"zJfsXbTEjWRhK25Fe6lXZA":{"text":"My partner and I went to Cafe Soulé twice and both times we were both very disappointed in","useful":1,"cool":0},"6N17DZNekfCO_4ObuXDisA":{"text":"we've had a number of fair to good meals in NOLA this week but tonight was a standout. cra","useful":2,"cool":1},"iFZrY927zqi6IFDmgQHMFw":{"text":"Not very happy with this place. I came here in a group of 6? And didn't have a reservation","useful":4,"cool":1},"RjxhuNbNJxUJqgzyttS8sw":{"text":"Great service and awesome food- I highly recommend the dinner service and special cocktail","useful":3,"cool":1},"CmAaWMLyYXnOlXmEhmF02A":{"text":"Great little place for breakfast or dinner. Had dinner one night, great chicken sandwich a","useful":2,"cool":1},"u6GZATTnih8EeukLe6ljPg":{"text":"I ordered the steak crepe, and it was cooked perfectly! My wife and mother in law received","useful":2,"cool":2},"c3xxx9szbrYkjvPaBNUmAA":{"text":"This review is for dinner, not brunch. The wait staff was outstanding but the food was bla","useful":0,"cool":0},"IjqStGg1CxmN5ccezRGAsA":{"text":"Awesome crepes. Had one with zucchini, one with shrimp & spinach, and of course one with s","useful":1,"cool":0},"o0IQLIurG1XgSKZps5yQEw":{"text":"Amazingly delicious breakfast!  I had the pecan waffles, which were light, fluffy, with cr","useful":2,"cool":0},"inINfRFGcUsN6dIH8Sw6Ww":{"text":"We found this place without the help of the internet and had one of the best dinners I've ","useful":2,"cool":1},"ODu-TSNraDpXkLV7ztPpLg":{"text":"Very disappointed. I was expecting much better food and service based on the reviews. Our ","useful":1,"cool":1},"A0yJaYZQmh0PmvGEHQE-Xw":{"text":"Very nice New Orleans-style breakfast, crawfish omelet smothered in Louisiana hot sauce - ","useful":2,"cool":1},"ovWH4zvhD2uybcpy5wH-cQ":{"text":"I loved this little cafe for a late breakfast crepe. The staff were so friendly and kind. ","useful":2,"cool":2},"7XLbgPUwYt4StIaU1mjBEQ":{"text":"Cute place with nice big ceilings and a warm feeling. The food was good, definitely recomm","useful":2,"cool":0},"moO0lJlZmF4dTuU1ozjPOA":{"text":"Two of my colleagues and I went here for a late afternoon snack/lunch during a day out exp","useful":0,"cool":0},"fik8R97LXXLgxLyIwtoLSg":{"text":"Cute little cafe that we stumbled upon in the French quarter. Ambiance was nice and servic","useful":2,"cool":1},"s9m20eYVQ6-Z4FGXzVsXfA":{"text":"Awful place. Showed up and said there would be no wait and we stand there for 5 minutes fo","useful":1,"cool":1},"5x3noUN3KbEda_S6iQi8GQ":{"text":"Three stars are not for the food...the rating reflects on the service. If you are staying ","useful":0,"cool":0},"wm66AADO3J2XgLoM_HehdQ":{"text":"Went to dinner here last night. Waited 20 minutes for a table even though several were ope","useful":1,"cool":0},"4uTjj8hCXFkeMB14Qf7piQ":{"text":"Our waiter Asa was amazingly awesome. Our dinners (french dip and shrimp poor boy) were gr","useful":1,"cool":1},"OxzehyRVLqI8RaJpVL_yvw":{"text":"Amazing food and service. The waiter and staff were great. Crapes and breakfast sandwich w","useful":0,"cool":0},"hSuA9oYPe8DAcsINjv3a4w":{"text":"Shame the food is subpar because it's a cute place. The problem is with subpar food the se","useful":0,"cool":0},"7fD8xmj5iqz2QpKK5AyPzg":{"text":"You can either stand on line like an idiot at Cafe Du Monde, or you can come to Cafe Soulé","useful":2,"cool":1},"qBul5wOmgdYQ-GO-N_KOiw":{"text":"Stopped in after touring the St. Louis Cemetary #1. Amazing!!!! Fast service, excellent fo","useful":1,"cool":1},"kHCoyNelj8WFNe92wpfWbg":{"text":"Excellent!  Crepes, drinks and beignets. What could be better!  Waitress was fabulous, new","useful":3,"cool":1},"uWCaolLWzLMVWIdqkcQ_Aw":{"text":"Pretty good food. I was surprised by how many GF options they had. The shrimp was also rea","useful":1,"cool":0},"-L7E9znJUqBDPRKuggphYA":{"text":"This was the bomb. Don't know why this place was near empty on a Saturday night.  The Shri","useful":1,"cool":0},"EuDpnA_CWzUP58f7HrVMZQ":{"text":"My husband and I stopped for a quick bite to eat before leaving for the airport. Nice, sof","useful":0,"cool":0},"Z64aql2b1MbY2GvNpRNSVA":{"text":"Been in Louisiana 4 nights now. All great dinners. But this was the best meal I've had. Go","useful":2,"cool":0},"m8rBtCJWkLkQQMeL2bSnWg":{"text":"Just stopped because I was looking for something other than the usual Cajun/creole and gla","useful":2,"cool":2},"AiswwVg73L5lrS-DuoK6ng":{"text":"My wife and I tried Cafe Soulé as our 'nice' meal while in New Orleans on a 3 day trip.  I","useful":1,"cool":0},"32upa9cU0bJck0O7nGrjsw":{"text":"Went here for lunch on a Monday afternoon.  We were one of two tables in the whole restaur","useful":3,"cool":0},"ncdOXKXJZBKTbWpMbNHNCg":{"text":"This place was recommended by a local we met. We were looking for a place for beignets and","useful":2,"cool":2},"LgWFkAh9pvEkaM20MvVRyg":{"text":"Loved this place!  My group came here for brunch and then came back that evening for a bir","useful":1,"cool":1},"0lzl0eUE5lUb87OcteSRwg":{"text":"Feeling peckish for an afternoon delight, we popped into Cafe Soule for crepes and beignet","useful":3,"cool":1},"ixtg0GUp3qHAhEjH-UQXUg":{"text":"It may have just been the day I went, but somehow I highly doubt that. Terrible and RUDE s","useful":2,"cool":1},"2ZEpdbQYXtjXTksrdszs7Q":{"text":"Stumbled across this place my first night in New Orleans after walking through the French ","useful":2,"cool":1},"O8EBnG7DL-5e4H_NdxeaWw":{"text":"Happy hour drinks are so so.  But they did an amazing job of taking care of my wife who ha","useful":3,"cool":2},"zafaTWOOmSF4YapIOgDnVA":{"text":"Great Cucumber Bloody Mary and relaxed atmosphere. Worth the stop for an afternoon drink a","useful":1,"cool":0},"o1JMYNe4SCLRrSFc5zCDSA":{"text":"Overall the food was delicious - a little heavy handed on the salt but still very good! We","useful":2,"cool":2},"HN3yxirB-eZMK1JjIKRRmA":{"text":"This little French cafe in the French Quarter was gorgeous. And very French.  I was totall","useful":3,"cool":2},"Ov_fRfWajH0AT_J_E8i7bQ":{"text":"worst crepe I have ever been served...veggies were deep fried, not sauteed, as proven by t","useful":1,"cool":1},"EBKpIVkQUsN40quZOiOS6w":{"text":"I read all the good reviews and I decided to try Cafe Soule during my visit in New Orleans","useful":1,"cool":0},"Uw3G_tV_snu2sEFKes1Wcw":{"text":"One server for the whole restaurant? Very slow service, obviously. We had breakfast here a","useful":1,"cool":1},"vhlq_LlFrTesmUEh9JF9FQ":{"text":"Had dinner here,  shrimp with eggplant awesome,  BBQ shrimp with grits awesome.   Need to ","useful":2,"cool":2},"xklyW67ijCDppCj9J6Qz4A":{"text":"We were there after the conference. Had a big lunch. We had a fried green tomato and shrim","useful":2,"cool":0},"aDomiYoyfBn3jeXHla0mfA":{"text":"Excellent place to escape the hustle of the French Quarter. Refined without being stuffy. ","useful":1,"cool":1},"V0bZZnFJfv_9VU1xS6yqng":{"text":"One of a kind, the entire atmosphere, staff, and manager was awesome! The French toast and","useful":1,"cool":0},"KbLH28RVgNNW9d8KBXeV-A":{"text":"This place has the worst service!!!  I never have written a bad review, but feel this one ","useful":4,"cool":1},"bOpKeHxbLVC2hM3UkUVsZQ":{"text":"Crab cakes were so good. Also, the bartender made me a mint julep drink that was out of th","useful":1,"cool":1},"GBCLa2viCut90Xr31wkMVA":{"text":"We had breakfast here on Saturday. We ordered beignets for the table and they were perfect","useful":2,"cool":1},"a-WodA7LaI27kS8zeRlZgA":{"text":"Tried to eat here last Saturday evening.  Service OK but Bar and Kitchen very slow. After ","useful":2,"cool":0},"zceIy_uPo-F_J-IS3iDStg":{"text":"We stumbled upon this place after a carriage tour. We had bought pizza for our youngest (a","useful":2,"cool":2},"NGgHml5uFlXhzXY48EeeHw":{"text":"On a night that was not very busy I was perplexed by waiting over 40 min for 2 desserts. T","useful":2,"cool":1},"D3y4zYo6WLfj5Fas6B9lqQ":{"text":"I am writing a review 3 months after the fact because I had the worst restaurant experienc","useful":5,"cool":2},"xFvpuwZ-A1CbGLIuagtV4g":{"text":"We ended up here to avoid crowds at some of the other nearby restaurants, and it didn't ta","useful":0,"cool":0},"tP1ZwoSfIeex_IiH_Jv1HA":{"text":"This place sucks ass. Really.  Im not satisfied at all. Food came out cold.  Rice wasn't c","useful":0,"cool":0},"kgC4eQ13QPJxURKwPP2GAw":{"text":"Alright this is a late review. After trying several eateries in the area, and a'll serving","useful":1,"cool":0},"leeMrbf9OjWYM3UZhcSoPA":{"text":"This place was so delightful. We had Harvey as our waiter, and he was incredibly personabl","useful":2,"cool":2},"cb4ecqspfLNXsRwQVUY6KA":{"text":"Nice quiet little place in the French Quarter. The bar is very low key and the drinks are ","useful":3,"cool":2},"Kiik_hNB-fEdAoFFG_FcRA":{"text":"Harvey B was awesome! Sat in the friendly \"drinking\" section, next to the window with a vi","useful":2,"cool":2},"AKd00GU-q0pWh8tP82AInQ":{"text":"We were in New Orleans on our way to Florida.  We ordered the beignets, Eggs Soule, French","useful":1,"cool":0},"YOaCfvARaNRzLBfBLCHvPw":{"text":"Super good service. Food was good not Anything special. I had the crab Louis salad. Lots o","useful":0,"cool":0},"k8McYpReN6KWJCi1rmVSWQ":{"text":"New Orleans has been my second home for several years, but occasionally I find something \"","useful":0,"cool":0},"wfhOKk5zMfIApd0mo0u_-w":{"text":"I ordered three crawfish etouffee here, which was very good. It was better than the crawfi","useful":0,"cool":0},"1Z9QpgHqCaiR8d23aT6InA":{"text":"I came to this place on a recommendation of someone and granted I'm from here so I know wh","useful":2,"cool":1},"o12LCb6GOQhp0wWqhn-7Ew":{"text":"Best restaurant in New Orleans. Wendy was incredible. Food is to die for. Had a great time","useful":1,"cool":0},"7SwnD5TVOUpG8r7iSfY6Ng":{"text":"Very good oyster poboy. I had the crab cake Blt special and it was ok. Great fries, delici","useful":2,"cool":2},"i7AEJ53JYen4Qj3BHQ5-0g":{"text":"We stumbled upon this place last night.  We would have walked right by, but the waiter, Ha","useful":1,"cool":1},"i916Euxgzs4aZt_OFbKHLw":{"text":"Add this place to your brunch list.  I had poached eggs on top of perfectly cooked slightl","useful":2,"cool":1},"alLWuXcFz-OAhXseT4N8OQ":{"text":"What an amazing place to have breakfast. The menu was great and the service was better. Ou","useful":2,"cool":2},"ULveTLLKqkhvnQouBiinnA":{"text":"Another winner- server was a a bit questionable but the food was great.  The eggplant with","useful":2,"cool":1},"A9EtLmhde5lfcfzFr61DVg":{"text":"Suzanne was very attentive ! Good place to stop and have small bite to recharge the batter","useful":1,"cool":1},"9RYhPbjTs1Pf5kr4diPeBA":{"text":"It gets two stars for bringing out the coffee quickly and the food not being awful. We wen","useful":2,"cool":0},"01f5ZjFd6szq8yWGctQu5Q":{"text":"Super friendly older staff lady. Amazing breakfast at noon on a Saturday. Drinks were perf","useful":1,"cool":1},"fsvxUELpwkOHsMNdmihJyA":{"text":"My first time in NOLA and I stumbled upon this little gem. I had the strawberry salade and","useful":3,"cool":1},"OAOD54V5knEc6iP3Srzybg":{"text":"I made a reservation for 8 for Saturday brunch at cafe Soule and was very excited to each ","useful":0,"cool":0},"uaVnJkjcbcqZSY-Pf05C5g":{"text":"The food was amazing and Suzanne our server was awesome! Funny and knowledgeable. The atmo","useful":2,"cool":0},"xYuga9RdRBeIHOHIwTS7Jg":{"text":"The outside of this place looked so charming we had to go in for brunch. The inside didn't","useful":0,"cool":0},"M0cL9J51N7PjQqPHje7NgA":{"text":"Great venue. Great atmosphere. Limited breakfast menu on weekdays which was a bummer as we","useful":2,"cool":1},"GQ5yRF1zgCkfyBXb5MS9Lw":{"text":"My fiancé and I stumbled into this mess after a tour if the St. Louis Cemetery. The food s","useful":2,"cool":0},"GaYMpUEWEupPeJ0yZFfD3w":{"text":"Great atmosphere with open view to street.  Food was very good but what was long.  I think","useful":1,"cool":0},"5GJX9SJubSkKXp5WiVc_Rg":{"text":"I rarely write one star reviews but this wasn't a pleasant dining experience. We saw this ","useful":1,"cool":1},"aI4CGYnaqTQ1IWfZjDbEvA":{"text":"Authentic French with a NOLA touch.  Great atmosphere.  Try the monte cristo yum","useful":4,"cool":1},"B5MiNFfg8S3jjM91PsqWRg":{"text":"I'm not sure if they are understaffed but it took the waiter over 20 mins to wipe down the","useful":2,"cool":0},"XUKy4aSDHm_FVY88_THCiw":{"text":"This place was AWESOME!! The chef was the man, he was so friendly and so was the staff. At","useful":5,"cool":2},"06i-OIr_IN04YpUv6u02og":{"text":"Our best meal in Nola! Asa our server was great and very attentive. The food was delicious","useful":1,"cool":1},"GQKHQBT9UKy-jG3fErDLwg":{"text":"Terrible experience. Crab cakes under cooked, bacon cold, eggs overlooked. Shells in the c","useful":0,"cool":0},"5z6R8_Q8h0dL6-fs1JVZEw":{"text":"Best bloody marys, ever. Had eggs soule...amazing...","useful":2,"cool":2},"GAEr-8aDz6_aJUPV_8jD3w":{"text":"If I could rate this place 0 stars, I would. My boyfriend and I were walking around the Fr","useful":2,"cool":0},"SlqTuLi_tbf3gn7TOFOHag":{"text":"One of the best kept secrets in New Orleans!! Loved this cute cafe. Came here for a dinner","useful":3,"cool":2},"dUPgsoyb0DJvmlxta2zYZg":{"text":"Quick brunch in the quarter . Very prompt service for a weekend. Manger came over to check","useful":0,"cool":0},"YDjsWHCzDLycrhufUBDgig":{"text":"Nice place to eat wonderful Cajun food! We had fried oysters, jambalaya and catfish and ev","useful":1,"cool":0},"9e4Lf3PWAGlNHuJjo26IUQ":{"text":"Great prices on wine and beer, great creole classics done right. I had the malbec, fried g","useful":2,"cool":0},"P9GYDq21rc6PwH1Ku-gpBw":{"text":"Breakfast all day, and an amazing selection of crepes! I couldn't be happier. The manager ","useful":6,"cool":3},"hClo0p2M-mHCTJ6CxHzWIA":{"text":"I don't like to give bad reviews. I eat out 7 days a week so I do know food and good food.","useful":1,"cool":0},"Q5WYiSg_WRCIqanp6H4cmw":{"text":"My wife and I happened by this little gem while walking around the French Quarter looking ","useful":0,"cool":0},"cp1SKrKep6aK1RYQsMkftw":{"text":"Horrible service .. food was avg at best.  I ordered the quiche ... it was so tough I coul","useful":0,"cool":0},"V0Hd8UX6uxYzzQqlvZOuLg":{"text":"Amazing French Toast! Tasted just like my mom used to make. Perfect bacon.  Great service.","useful":3,"cool":2},"3qnbFTqVAIoy6KENfYek2Q":{"text":"By far my best meal while in NOLA. I got the Monte Cristo and a chocolat crape. Great serv","useful":1,"cool":0},"LxbLoHQ6B52pcRjx4UYXhQ":{"text":"Probably the best brunch we had in NOLA. Definitely the number two beignets (second to caf","useful":2,"cool":1},"1tMOhjColTHd7cBFfBJqTA":{"text":"Went in last night for dessert, ended up staying for hours.  We had a blast, good crepes, ","useful":0,"cool":0},"1R90q0JhyEuSULQL0aBZWA":{"text":"I was in town for a work conference  with 7500+ attendees so realistically, I was just loo","useful":3,"cool":2},"EIdsroNUAeGuOU1f9A_Jtg":{"text":"Opened about two weeks ago on our block where K-Joe's used to be. I hear this place is aff","useful":15,"cool":8},"E4QXjrKiXd4JFsccipzpQg":{"text":"Soooooooo good and soooooooo worth it. Make sure you get the crawfish pie. Awesomeness at ","useful":2,"cool":0},"6Jgy63kCut8U3YLsbrhmmQ":{"text":"Delicious! I got the Monte Cristo and it was so tasty and rich I could only finish half. T","useful":2,"cool":2},"fxR-aT6dqykOk1ZGNWbk-A":{"text":"Quaint little place with some outstanding food. After eating at many of the same places we","useful":1,"cool":1},"-YVsJas6Gtxn3zQWIFI8LQ":{"text":"Very disappointed in this restaurant . Saw it had a 4 on Yelp so we went. It took a while ","useful":0,"cool":0},"JHjH9FtsFL_BVsjdrCVitQ":{"text":"The flavores were explosive. Need I say more??? Okay, I must also say, Asa our waiter was ","useful":1,"cool":1},"0_z-X3J5o-KmrwxFiIC_SA":{"text":"I forgot to write my review \n\nOK when we got here I was like this place is a whole in the ","useful":0,"cool":0},"oGdL41Uh4XcGeZG700cmDA":{"text":"This has got to be the best restaurant in the French Quarters. It was truly amazing ! So f","useful":1,"cool":1},"d7Ylopl8z7RkgkZ1LvAVBw":{"text":"Is it possible to give 10 stars? If it were, this place certainly would be a worthy recipi","useful":4,"cool":2},"i2HBFh42aoss5VT64NKfoA":{"text":"Live in the city and came upon this place while walking around downtown. Food was amazing ","useful":1,"cool":1},"VcRpzm8Z3G-lbE-NDENEiQ":{"text":"We had a wonderful supper here on a busy Saturday night before Labor Day. \n\nFirst of all, ","useful":0,"cool":0},"STvZ0Pf392jWWsWjzjfqwQ":{"text":"The duck crepe was amazing as was the banana foster. Melissa was a great server! Sat quick","useful":1,"cool":0},"wWcMvCbUaDDblAYeLCUWsg":{"text":"Sat alone at the bar while waiting for friends to get out of a meeting. Had the Eggs Soule","useful":1,"cool":1},"iJBghe2EplZHeGspzx2Z7Q":{"text":"Where to begin? This place is the quintessential French Quarter spot. Beautiful historic i","useful":1,"cool":1},"1rOKgb16IehqKpplrGFW_g":{"text":"We were happy to learn that the kitchen was still serving brunch at 12:30 PM. We decided t","useful":2,"cool":2},"jO_EzwpwHrQ81OW92SZJAA":{"text":"This is a charming cafe located in the French Quarter near Bourbon Street. My husband and ","useful":2,"cool":0},"p0hd5DHaqHdj6-m3OVjQKA":{"text":"This is a cute little cafe in the quarter that serves up breakfast and lunch types foods w","useful":6,"cool":2},"vkFDDhsiUbaDIlgEirijMw":{"text":"Great atmosphere and food! I got the strawberry salad and grilled chicken sandwich (which ","useful":1,"cool":1},"AbLHeBjq-PpqhuEbusHl9g":{"text":"My seafood here was fresh and delicious.\n\nI ordered the Soule trio appetizer of a crab cak","useful":4,"cool":3},"81pyc9mD9FNlYcmZxPTilg":{"text":"Very happy we fell onto this place. Family of 5 ate here and everyone left happy. Kids had","useful":1,"cool":0},"btCiAJWGVEQM9YnjuRo4Bg":{"text":"Was in town for a mini family reunion and we popped in here for an early dinner.  I ordere","useful":2,"cool":1},"TbpffbsgpEYie1u-Cw1btg":{"text":"We came here after our cemetery tour, our tour guy pointed out this place & told us that t","useful":1,"cool":1},"lKH5Wc29BeXUb3TbvRsIBA":{"text":"In New Orleans for the weekend and we've been having a hard time picking restaurants. We w","useful":2,"cool":1},"lf3UX-FOrm2BpgW1OZtmrQ":{"text":"Brunch is one of my favorite meals.  You get a bit of everything.  We were trying to think","useful":3,"cool":2},"Dfh_ldJq8hxfmW_IKwOmag":{"text":"Meh. Service was bad- server was confused by the menu and everything we said. Crepe was dr","useful":0,"cool":0},"3h4-2uiEgpxUB3kTONj37g":{"text":"This is a super cute, quaint french-style cafe. We came here just for a drink & dessert. W","useful":3,"cool":1},"79Yant_PrvxBFmtEnWb_8A":{"text":"Come here for the BEST beignets and coffee in New Orleans. These beignets just changed my ","useful":2,"cool":2},"mol8s2dZuDIhiGgzrNmjdw":{"text":"A quiet, not-overly-touristy place for a meal. We went to brunch during Mardi Gras and whi","useful":0,"cool":0},"DukaB4GppSPNZEaYOiVWgQ":{"text":"We stopped in for a quick bite before dinner. The apps all looked good so we tried two.Fri","useful":0,"cool":1},"p8lhu6hV0CuCcbWnOBVXlA":{"text":"The beignets definitely tasted different than Cafe Du Monde's, like they were made with be","useful":1,"cool":0},"BPZ3I_j-QwaMLq42FlMruQ":{"text":"My wife and I were really excited to try this place and were happy we did. I had the Eggs ","useful":1,"cool":0},"TtGvT98xgUeEakDeTeXm_w":{"text":"Fantastic experience. Everyone was friendly and more than accommodating. Great food and at","useful":1,"cool":1},"a6-_iGJiOzPCf6vaEiq9Ig":{"text":"This place was our favorite meal in New Orleans! It's not crowded and just off royal stree","useful":2,"cool":2},"Qw2f0MzQsFtx0uHH3eYGlg":{"text":"Directly across from Antoine's, the ambiance of Cafe Soule itself was quintessential Frenc","useful":2,"cool":2},"kbyA6Q56zkV_XXaqDsE0wQ":{"text":"Best monte Cristo in the world!!!!!  Crawfish etouffee was awesome also.  Ambiance great- ","useful":2,"cool":2},"1Eid0xVkqixqKrlCz_jm-Q":{"text":"We visited this restaurant based on Yelp reviews. I will never go again. We had a reservat","useful":1,"cool":1},"PHWc_J56MpvOWwN-ZNjKMg":{"text":"Disappointing and a shame....the place was charming with so much potential.  The wait staf","useful":0,"cool":0},"P1P8pVs8sIn7RYIyinh6BQ":{"text":"Good service and great food.. Wasn't busy when we went so that made our experience that mu","useful":3,"cool":1},"p5g0Jjjb4ZC1ofSt_82ZUQ":{"text":"Stopped by for a quick breakfast and tried the Eggs  Soulé: crab cake, fried green tomato ","useful":0,"cool":0},"57tEug42xnRVs5FPxgxGXQ":{"text":"Mediocre food for brunch.  Nice setting and staff.  $70 for four people (no drinks other t","useful":0,"cool":0},"xMJ_9mP0lsKeEe02WjmSQw":{"text":"OMG!! So I'm a French toast lover, actually let's just say I'm BIG on a good breakfast. We","useful":2,"cool":2},"6MRZYOW95hygvmpKdHypAg":{"text":"We went here for breakfast on a Saturday morning. Just two people. We waited about 20 minu","useful":0,"cool":0},"tEopBd0k1ginhD8LJzqLBQ":{"text":"I cannot say kind enough things about this place.\n\nMy fiance and I had just finished a Cem","useful":5,"cool":2},"kMZNvGd6rIE2TqT24THwNA":{"text":"This restaurant is filled with history and delicious food- an excellent combination! Our s","useful":0,"cool":0},"Rn-W_mW4ortVqlJdMXkyng":{"text":"Friendly folks and delicious food:  The best beignets we found,  crawfish omelette, and ch","useful":0,"cool":0},"SplM7zRsbBkSbWxui_mXgg":{"text":"I wanted top like this place more. Service was friendly but kind of slow. Gumbo was very s","useful":0,"cool":0},"6oqLZ5jd7lhfu_wTlAsNew":{"text":"My wife and I went to Cafe Soule tonight in the French Quarter. We both walked away unimpr","useful":0,"cool":0},"cOy7diyFnzs1SkPzqrsRTQ":{"text":"We started with salad maison with the raspberry vinaigrette. It was nice combination with ","useful":1,"cool":0},"R4N2SAK7qb2mZ1X0J1agXQ":{"text":"The french toast sticks are absolutely delicious, and the crepes that we got were so good.","useful":8,"cool":4},"nIaznvV4ig7covU3OMez9Q":{"text":"Service was terrible. The waiter did not come to greet my table in a timely manner, the fo","useful":1,"cool":0},"1Ow_iDS2qQDMOG8-MTf_Yg":{"text":"Service was slow... Like really slow... Staff arguing in front of customers. Red head on c","useful":0,"cool":0},"XVCvhEsZ373wIpfAmR1pLw":{"text":"The family and I stumbled onto Cafe Soul and couldn't have asked for more.  Celine and Jen","useful":2,"cool":0},"3B_W6Zz9ryFH4Q-_1sSLig":{"text":"My husband and I went there on a recommendation from a friend. It did not disappoint!!! Mi","useful":3,"cool":2},"lPMJlMIA0KYbGf27DhJNGA":{"text":"Cafe soule was Awesome!!! We showed up with No reservations 10 pm on New Years Eve and wer","useful":2,"cool":1},"2hJhvsNs0T80NAV2etm7fA":{"text":"I'm a big fan of Cajun food so I was very excited to try this place. We made a reservation","useful":1,"cool":1},"bHsAZE-sYqvwacw2KW3Awg":{"text":"So we were trying to go to Acme Oyster House to have a great NOLA dinner in time to make i","useful":2,"cool":2},"x9PT-DoPZe3RD--611F4ag":{"text":"we were invited in with a warm welcome and a guarantee of good quality Cajun food. We didn","useful":2,"cool":1},"07v5baEmRX4UsSVudK6qsw":{"text":"We stumbled upon this place as we wandered the French Quarter. The atmosphere was lovely y","useful":1,"cool":1},"AbiEbixPfw_h0bftBoHTVA":{"text":"We were lured in by the Yelp reviews and the smell as we passed by. The menu seem reasonab","useful":3,"cool":0},"r1MqsjTb1iXOoYUcT_nlrQ":{"text":"The menu had moderate selections, but the eggplant dish that I ordered (the only one on th","useful":2,"cool":1},"hZnZm-E8jKiANu_Y8QZx_g":{"text":"Always a stop for me when in NOLA. Delicious & consistent & reasonable prices. Suzanne has","useful":1,"cool":1},"Y0Q0n5PgUL9uKcS0l55ZBw":{"text":"The service was terrible and the food was worse. It took an hour to get our food and when ","useful":1,"cool":1},"zeIusHH7oNuanVn5Mrlg2Q":{"text":"Small Yelp reservation problem fixed by the service of Henry B. \n\nMade a reservation with ","useful":3,"cool":2},"PxrjlxcYwjp_Qz2Pko8ACg":{"text":"Headed here for a late solo lunch on a Saturday. The place was packed but it seems as thou","useful":2,"cool":2},"TT1gLUNzSpoyglY3thbOLA":{"text":"We had a fabulous French Creole dinner at Soule. We started with the strawberry salad that","useful":1,"cool":1},"e7M_q21JS_LfHUQu_v3fYQ":{"text":"Just stopped for a last minute dessert break and decided to get some crêpes. Staff was fri","useful":0,"cool":0},"G3_8XETExVlZD3DSId_bqg":{"text":"Service was unsatisfactory! We had reservations for a large group in the Paris Room. Wine ","useful":0,"cool":0},"VV0hyBH88BsJQwFcEV635A":{"text":"Great little place. A touch of France in the heart of New Orleans' French Quarter. We had ","useful":0,"cool":0},"5ZKNgp5nwV9RsXMx1b_d8w":{"text":"Better beignets than cafe du monde. Adorable French cafe.  Best croissant egg breakfast sa","useful":2,"cool":2},"nshB06kvc4JvZsCugAbjHQ":{"text":"My husband and I stopped in on a recommendation and we were glad we did. My husband had a ","useful":1,"cool":0},"q4dGkUUmzbYNWHHumqi-NQ":{"text":"The food here is prepared with heart.  The chef took a personal interest in our lunch dish","useful":6,"cool":3},"is1cg78KA4L5IKg5x-nCsQ":{"text":"Excellent lunch, outstanding happy hour sangria, great service. That's all it takes, but t","useful":2,"cool":0},"svDD6gFgfZdw_FdcbFwSAA":{"text":"A fun restaurant with a very engaging, friendly and funny bartender (green hair)--awesome!","useful":4,"cool":2},"T3lq5g6ld5QN-JoH9d72pQ":{"text":"I have eaten here numerous times and have never been disappointed. Today was for breakfast","useful":3,"cool":2},"vUosklkZ485gqVWMfimqFw":{"text":"Beautiful, quaint little restaurant with very unique brunch options and an awesome, welcom","useful":0,"cool":0},"QTFEqHQolFQDuLOTzZmFEw":{"text":"My friend and I came here for dessert. We had gone to a restaurant earlier and wanted to w","useful":1,"cool":0},"2OVwoma11wcTxAA1GQjTGA":{"text":"Wow. What a cool experience\nMid afternoon lunch on our anniversary \nLunch, a bottle of win","useful":2,"cool":2},"ZBXxodcZ_o2q-EcKOqMArw":{"text":"Cafe Soule is a little gem in the Quarter. We first discovered it on a previous trip when ","useful":1,"cool":1},"EvqZbcZQgscLScMN96XiRw":{"text":"Yikes just went to Cafe Soule with very high expectations.  Although I live in the FQ, I h","useful":2,"cool":0},"NHeMZO5-qZD1OmcAfqGpWw":{"text":"The food was so yummy!! I wanted to come back but our trip didn't allow for it time wise, ","useful":2,"cool":2},"Lqr2HjSZEZYs1Iy_9JcNwQ":{"text":"We visited this place upon the recommendation of good friends of ours who lived here at on","useful":3,"cool":2},"9uHJhjJrWlWAie9i38MLzQ":{"text":"This is a much better way to get beignets and cafe au lait than to wait in the long line a","useful":2,"cool":1},"2odGTLfPaGWLevRhY0GUeg":{"text":"I just landed in New Orleans and this is the first place that we decided to eat at. The se","useful":1,"cool":1},"C62Jx7cx9oaz4pfVflakEA":{"text":"The food here is out of this world and the service is amazing. We were served by a waitres","useful":3,"cool":3},"vHOFfeRiNBcTaC1Sx5du6g":{"text":"Horrible service.  Had to ask for salt.  Took 15 min to get any response from waiters.  Th","useful":1,"cool":1},"fgyq612EOI3ilHthn9QWSw":{"text":"Loved the place. Eggs benedict was great and the crawfish omelet was amazing. The bartende","useful":3,"cool":1},"QLDjMnI-jKcafbOcf1hccw":{"text":"Our food was great and priced really well. Super cute place! Open-aired and quaint. Awesom","useful":1,"cool":1},"TD8Tm7oyyz2aY9SBAa323A":{"text":"Best meal! ! Fabulous service. We shared the crabcakes...truly yummy.  The jambalaya was o","useful":1,"cool":0},"O1X-dR4hkMEWo_RjZYf81w":{"text":"NO STARS If I had my way. ( notice that picture of a crepe they show is actually on a tiny","useful":4,"cool":1},"pkE-v6DZ2GAGWbm3zraJpg":{"text":"Had dinner here on a Friday night. Only a few people. Ordered the shrimp poboy. Amazing! N","useful":1,"cool":1},"cgbEIvghOeAMoSDM5lNxQQ":{"text":"I'm a NOLA girl- through and through and can confirm that this charming little spot is wor","useful":1,"cool":1},"FMYybcBLdSNtxGSJOBsLcA":{"text":"Great food and great service. Lee the bartender not only made great craft cocktail s but h","useful":3,"cool":0},"_p4ys5YEp3jT8PuUHIHLQQ":{"text":"Really awesome menu - and sampling all their creole items I can honestly say it was all aw","useful":2,"cool":0},"QYbPzO_aGxo5KCLsZMHXbA":{"text":"Chicken and Waffles was on point. Just enough to make me satisfied and a full belly. The w","useful":2,"cool":0},"FNAG6eUnUI_Uzy1Pjzwzgw":{"text":"Great food,great service and it does get busy so make sure you get there early . Plus , th","useful":1,"cool":0},"tQiHaHSfj0ybrQ8yYLlS7w":{"text":"Love it! Came here on a Sunday afternoon based on other Yelp recs. it's DIDNT disappoint. ","useful":2,"cool":1},"b3JiGlGcq0KqY3hh0gqN-w":{"text":"I really wanted to like this place more. Stopped in this morning at 11:15 looking forward ","useful":2,"cool":0},"dQ22aY7R_TLhltogeAY3ZQ":{"text":"We stopped in for lunch and sat at the bar with Jessica taking care of us.  Everything was","useful":2,"cool":2},"Bhc9pFDRlxtmuq3b4lcxYA":{"text":"This place was the first place i went to to eat when i landed. Place was very clean, old s","useful":2,"cool":2},"uO6Zoj0CYw41xoxQhcvY6w":{"text":"For the week I was in New Orleans, this the biggest let down. The waiter was slow with giv","useful":1,"cool":0},"Q3iPTIxnvs7u_LGSfmdc5g":{"text":"Fiance had a really good french dip with delicious freshly baked bread.  I had a chicken s","useful":2,"cool":2},"7QCpC_Uzun3BNv2ioIXf5A":{"text":"My husband and I hardly spoke a word while we were eating, it was that good. I had Eggs Sa","useful":2,"cool":1},"iRg1jkl9ZPJxT47mhbLrlw":{"text":"Manger was very attentive and cool. Amazing attention to detail. Enjoyed the duck and stra","useful":1,"cool":0},"nwop9THO5HPR_oKRW5e5Og":{"text":"Waiter Ian is incredibly kind and complimentary. He made our dinner experience wonderful. ","useful":2,"cool":2},"3xu30tbUpaB3POWqWaZ0Kg":{"text":"We shared the 3 seafood appetizer, which was pretty good. I had the shrimp with eggplant, ","useful":0,"cool":0},"yaCDhjFHbtAxG3BSoEpQSg":{"text":"Better beignets and chicory coffee than Cafe du Monde. I kid you not. Service is a bit slo","useful":2,"cool":2},"TCnHXAu704n5wTN4T4eNsA":{"text":"Best chicken & waffles ever. Great staff as well. All food was delicious went a couple tim","useful":0,"cool":0},"Z494CKfpcslCr1NzyN5L8g":{"text":"Went here specifically for the breakfast crepes and was disappointed to learn that they on","useful":1,"cool":0},"cjqDyV8jG7aheVbRtG2dkA":{"text":"Very fine, very pretty place. The room is delightful with high ceilings, floor to ceiling ","useful":1,"cool":0},"9YH_lAHeD-I3pSI6HDG37A":{"text":"So amazing.   As my friend say F*ing amazing.   Shrimp and eggplant.    Crab sliders.  I'm","useful":1,"cool":0},"D4gl-pUwxZRPTdhpSAwYaQ":{"text":"You cannot ask for better food. The place is very classy and the people who work are there","useful":2,"cool":2},"bGpQmkJ5_b7WXn46MzzX7w":{"text":"We visited this morning for breakfast and the food was very good. The crepes were deliciou","useful":2,"cool":1},"bb3HT-MqhOpDt3v7cIqS-g":{"text":"I HIGHLY recommend Cafe Soule. The service is excellent, the food is great, no matter what","useful":1,"cool":0},"TEk60SbMF1rvTA37pfkZzA":{"text":"We came in as a party of 12 at 3pm, just in time for the happy hour specials. They enthusi","useful":3,"cool":1},"8POox4ppNkOtJ5zZ_83ICg":{"text":"Went to Cafe Soule for breakfast on a Tuesday morning and we were seated right away - the ","useful":0,"cool":0},"yxbUwQEtBfLqAMgttVYyDQ":{"text":"We held our daughters 21st birthday dinner at Cafe Soule upstairs in the Paris Room tonigh","useful":0,"cool":0},"_qK4VIf86nw3V-xY6aNmHg":{"text":"Great food and great service! Not a large dining room so if you come on a Friday night, as","useful":1,"cool":0},"JVgErkms8ocB2wcQ0iOUjg":{"text":"My friends are starting to talk. They keep telling me that there are OTHER places to have ","useful":1,"cool":2},"bx55fRT8BshEIlxkGIb4FA":{"text":"Ambiance, presentation, taste & service!!! ALL 5 STAR!  I loved the strawberry crepe, very","useful":1,"cool":1},"Xv6p0PMyOnM-Pk7kM1n6Rg":{"text":"Totally not what we were expecting! Felt a little timid going in because only 2 other tabl","useful":1,"cool":1},"vJUWcJTAG_IyxJlyMsZNxg":{"text":"Noticed this place as I was walking around yesterday and decided to try it out.   Fantasti","useful":1,"cool":1},"pLjqglr9AJrYPavYuLiPBA":{"text":"RAW CHICKEN... good thing I cut my chicken before I took a bite out of it because it was a","useful":0,"cool":0},"HlkLOul4pePxy4enfWG0Pw":{"text":"This place has the best authentic French and Creole cuisine in town. We're definitely comi","useful":3,"cool":1},"kN7Qll0Csh8kyvDr_pXxeA":{"text":"Cozy cafe in a quant. Atmosphere\nThe crepe was delicious\nHad a nuttelllla with strawberry ","useful":3,"cool":1},"ku9q06KGLZg5v6UU-zb42Q":{"text":"Nice location and atmosphere, but I came here for breakfast and I would have definitely ha","useful":0,"cool":0},"zGr276CQ_T5Grver--SkkQ":{"text":"Me my brother and my cousin were looking for brunch and decided to give Maison a try, we w","useful":1,"cool":0},"lQ5-MCrYtWhCOz_ptMgSSQ":{"text":"Holy cow AMAZING! The service was so good. The cocktails were tasty and the food well what","useful":1,"cool":2},"DI0WKN2yw3sunbfmKVxPtQ":{"text":"Melva was my waitress. I was debating between a few entrées. She helped me choose one.   I","useful":1,"cool":2},"fIn9P2EnoU6fCPqh9SXnZg":{"text":"We had lunch here today and while in the middle of our lunch, a mouse decided to join us i","useful":1,"cool":1},"pi7jntUwuj4wEMge1HT4Hg":{"text":"This is one of the best brunch places I've been to. You have to try the Eggs Soule' - Eggs","useful":2,"cool":2},"-WVaDnHaOxWj-G_u3rLqpg":{"text":"On a search for dessert which was different from your normal FQ fare of bread pudding, cre","useful":7,"cool":4},"QL4nWcJnrjgdWfTKAYEvwA":{"text":"I had to give this restaurant only 3 stars because of the service. The food is GREAT. Butt","useful":2,"cool":0},"1YHx1_1xrhTtrdkJCE25rA":{"text":"Just sent back my French dip sandwich. Meat was bad grade lunch meat roast beef. Texture c","useful":2,"cool":0},"6CL2A3FikSJbfShY8I_5QA":{"text":"Had dinner at the bar here after a stopping in earlier during a walking tour.  The Cajun s","useful":3,"cool":1},"RWaHcTBttB5cQmJtHiSImw":{"text":"my food was great. i had an omelette that was done just right and priced fairly. \n\nthe mos","useful":1,"cool":1},"lcjCE-EhQtJkELr9DqY_og":{"text":"I was impressed that before sitting down, the server cautioned us that they were short sta","useful":1,"cool":1},"Dm6v93-nsx19nDN5arCnMg":{"text":"Café Soulé was a surprising find for a gluten-free couple. We were pleased to discover a s","useful":4,"cool":2},"HwSjMvrkDOZM_9FUOfaMvA":{"text":"We ate here because it was only 300 feet from our hotel and there wasn't  a line. They sea","useful":1,"cool":0},"mFJMQgwSHTWw-DRqNbKzJA":{"text":"We had the Eggs Florentine & the Eggs Soulé for Sunday brunch. The poached egg perfect wit","useful":3,"cool":1},"5esYuWdKzpl1HIz0rETSig":{"text":"Came here with reservation for a party of 9 for Lunch. They were still turning over from b","useful":2,"cool":1},"zbJlL39Si4vDfI7FvcNDBg":{"text":"We stopped in mid-afternoon for some cocktails and snacks, and were not disappointed! What","useful":2,"cool":2},"bO_z-st1ZaJYlzzdj0FuRg":{"text":"Amazing food.  Crawfish omelet was fantastic. Suzanne and the staff were great and welcomi","useful":1,"cool":1},"qTMyf4IkkIQAE95fOvFZ1A":{"text":"This very attractive cafe looked like a lovely place for breakfast. Looks are deceiving! o","useful":1,"cool":0},"YaNkLEMT-mDTgH0659UwFg":{"text":"Excellent. Super good service. Had the veggie crepe it was tasty with fresh veggies cooked","useful":1,"cool":0},"Nm4kALB3EzvQ_VOVZhZE_w":{"text":"Service was pretty bad. We ordered a bottle of wine and the waiter didn't let us try it be","useful":1,"cool":1},"7fUdzgD35X0FeOpKKFJS_A":{"text":"More like 3.5. Great location, outdoor tables, server during a weekday not the most attent","useful":1,"cool":0},"fFao3IKSrkC65RQo1S8LsA":{"text":"It is a very low key place with amazing food. Try the eggs soule (Benedict eggs with crab ","useful":1,"cool":1},"64tMo-rJLF3BcphpD0Gv0w":{"text":"I know it's a long review, but here are the highlights:\nRIDICULOUSLY SLOW and UNFRIENDLY S","useful":3,"cool":2},"Fac6ud9a9K7SwtR7T_QHNw":{"text":"Pretty disappointed with this place. Ate here 2 days ago. It was a Friday morning and the ","useful":1,"cool":0},"mmaid10cqUjJTEhUQif8rA":{"text":"Delicious food and great service. We got here shortly after they opened for breakfast, and","useful":2,"cool":0},"HBPO0npfTOHcxBsf1kYWVg":{"text":"Hands down, Wendy gave our group the best dining experience in NoLa. The food was excellen","useful":2,"cool":2},"XGc_NcPKUqhrMVgCUR-t5A":{"text":"Adorable historic building, friendly servers, fresh flowers on the table and it's quaint, ","useful":3,"cool":0},"j597o8JRFMtda1F4JoLMdQ":{"text":"Other reviews have referred to this place as a gem, and I absolutely agree!\n\nLess than a b","useful":6,"cool":2},"JN0iJ9SF0fc9nwymtVNg6A":{"text":"Nice french cuisine with a Nawlins twist that wasn't overpriced! Must try the oyesters app","useful":2,"cool":1},"9AkfgjAOW3J65B2uaxCVBQ":{"text":"The place has a nice atmosphere. I got the blackened shrimp crepe with mozzarella. Not as ","useful":1,"cool":0},"k6Pp82wquMctb8YC7vVahw":{"text":"5 stars because our server, Wendy was the best!! Great service, we love her and NOLA!!!","useful":1,"cool":0},"WEZj3GnnQjsNurtJgDpL-g":{"text":"Given this was my first trip to NOLA, not to mention it was a quick weekend trip my brunch","useful":3,"cool":1},"3q7p3mehX-hSlPN8z8fuDA":{"text":"This was the absolute worst tasting and most flavorless food that I have ever had while vi","useful":0,"cool":0},"YNBvLlD53f8lWLQAA4MX1Q":{"text":"Great Pecan waffle but the service was horrifying  and the bartender was clueless.  Our ot","useful":0,"cool":0},"C4K4WDSjVhnPU_hF-URlLA":{"text":"Came here mid afternoon for a late lunch. \nIt was fairly quite so we got to choose a table","useful":3,"cool":1},"7n3Ma9uIJz6Jtv4_RcZskg":{"text":"Omg...the Eggplant Peirre, Stuffed shrimp with Crab and Lobster and Artichoke are TO DIE F","useful":2,"cool":2},"f_gXtBhf4yhyK9brnk2v6w":{"text":"Nice little breakfast, friendly and fun staff. Big dining room setting, also with a seated","useful":0,"cool":0},"ozwEMD8-iQ3XLQ45nTqjFg":{"text":"With a 1+ hour wait for Stanley, we decided to walk over here instead. Glad we did!\nFood w","useful":2,"cool":2},"_0u6wbpThXunnevQ9hKjZQ":{"text":"Food was excellent. Bartender makes a stiff Bloody Mary. Service was quick and efficient, ","useful":1,"cool":1},"com8XDPFhl-u0VH5vqJp1A":{"text":"Great crepes.  Great food and wine at decent prices.\n\nBut know what time you're going.  We","useful":4,"cool":1},"jILWXtElrWGyPWX5caNwqg":{"text":"Came here with some friends while we were on a weekend trip in New Orleans. The food was S","useful":2,"cool":3},"lIQkCormuR9e4ijVT14vjQ":{"text":"Made reservations through Yelp.  Got seated within 5 minutes of arrival.  During the wait ","useful":0,"cool":0},"HaQu6Y449gLqStyiXmlykA":{"text":"YES! Busting out the five stars for the *wonderful* Café Soulé!\n\nRecently, my fiancé and I","useful":8,"cool":3},"8coldNhH55iEn8DOYb3IQg":{"text":"Had initial reservation at 12:30pm. They called me to tell me that lunch doesn't actually ","useful":1,"cool":1},"TUDbyurAtcw2Zudjpecopw":{"text":"This place is a little jewel in the heart of the French Quarter.   We dropped in for desse","useful":3,"cool":1},"495efoglO1sSgKP5VjkRpg":{"text":"Breakfast at 1:30 in the afternoon!  Excellent French Toast and Eggs Benedict. Nice staff.","useful":1,"cool":1},"JorFXE9IuKWrAZj2cfKVqw":{"text":"Stumbled on this by accident but have been back twice. Excellent breakfast, great afternoo","useful":1,"cool":0},"gNA_SrMxM6hZItxCjrVrMw":{"text":"I've visited New Orleans twice in the last two years and made a stop here each time. The c","useful":1,"cool":0},"Fv-ciBRTuzTM3CqHUh0_ZQ":{"text":"I went here with my friends and the manager (not sure if he is the manager but he was old ","useful":0,"cool":0},"geuwtqNFuiK0lMsv5LQ3nw":{"text":"Delicious food! Best chicken strips I've ever had ! The service was great and thoughtful t","useful":0,"cool":0},"6JNpTGsFNXPrunay6yqVXA":{"text":"We came in when it was busy and close to closing time but Sean was very sweet to us. Made ","useful":1,"cool":1},"RPB0FyjSNaIi1fE7HbzDKQ":{"text":"My husband and I absolutely love this place. It's a nice spot to grab lunch on our day tri","useful":1,"cool":0},"WQQ95Pw3YFYJKA3v_XE7Iw":{"text":"I made reservations on Friday, October 23 for my large bridal party and they were able to ","useful":2,"cool":1},"6i6IygiK12OCcs3UqKDjxw":{"text":"Recently held my daughter's wedding reception at Cafe Soule, Paris Room.  Could not have a","useful":1,"cool":0},"fh7METuhfL7TVPuIBiJiDA":{"text":"MUST GO! AMAZING! \n\nGoing to Café Soulé is by far one of the best decisions you will make ","useful":1,"cool":0},"NSpVzmHNs-_uaV0JSdyHUQ":{"text":"Excellent food with fun and friendly staff to match! Make sure you try the crab cakes!Can'","useful":2,"cool":0},"mAjugsQtbYlzGZcU1FDbsw":{"text":"Really good portions and super friendly staff. Lots of history in the building. We will go","useful":2,"cool":1},"pLROx2fIw2jYkFffwbh2vA":{"text":"Me and my friend were roaming around in NOLA on a Monday morning looking for a place for b","useful":2,"cool":2},"Cjrg6upN3sIHLCvu-eFm2g":{"text":"Wait service was very problematic here tonight. At the very beginning of dinner, I asked w","useful":1,"cool":0},"9Ovsc8jQNq5em-B-lVNnbQ":{"text":"This review is based on a private party event. \n\nLet's start with the decor. Going down th","useful":0,"cool":0},"6Zi2fPztr8Nj8VdBtiJMwg":{"text":"1/2 wait then told switching to lunch and will take another 1 hour and 40 min before any f","useful":0,"cool":0},"RjEZMbQesqeupopxaZ57Ew":{"text":"There were little vegan options but the strawberry salad with no cheese was fresh and deli","useful":3,"cool":3},"0LC_43L2UoIBMQQoEDF4jA":{"text":"they were nice to accommodate us right before closing and helped with gluten free options","useful":2,"cool":0},"3p6EI_4Eyn5lsfStOtCYcw":{"text":"Stopped in for breakfast on a Monday morning.  We were the first to arrive so there was no","useful":1,"cool":1},"hW-_33ZmPc3JixL9VzwmdA":{"text":"This was by far the worst restaurant we have been to in new orleans!!!\nFirst off, the wait","useful":0,"cool":0},"hsJ9SnjaFyb-R1OQrGpv-g":{"text":"We were walking past this place & just HAD to come in. such a beautiful little spot! It fe","useful":2,"cool":1},"DMXbS3drgtKSKbUcW8HcTw":{"text":"Its a small cozy place. I had crapes for breakfast and it was tasty. Also, the chicory cof","useful":0,"cool":0},"dJq04GuhztVCa5tEAhAE-g":{"text":"The crawfish omelette was bomb! \n\nMy home girl had the BBQ shrimp and grits and said it wa","useful":2,"cool":3},"M8yz6IHjjyKbsTri0OIwvQ":{"text":"What is it about New Orleans that gets me in my feelings! This is a quaint little spot clo","useful":3,"cool":1},"LzN5yOrj0_P76Tson8uASw":{"text":"The waiter, despite having few other guests could not be bothered to check on our table. T","useful":0,"cool":0},"YdtrEGhjOYpoHVs8BB31JQ":{"text":"Incredible authentic taste and quality. The Cajun shrimp pasta with its rich creamy Parmes","useful":1,"cool":1},"1Usm9SLk7HSTG3W3aUaNXw":{"text":"Wowza! Really good food at reasonable prices. The atmosphere is quaint and traditional Fre","useful":3,"cool":3},"XdzJNCJ-BWqhlxwPJhj8fw":{"text":"My mom, sister and I came to New Orleans for a few day vacation. This morning we wanted to","useful":0,"cool":0},"RECmnuVyWvbVdJexyhpsgA":{"text":"I had my rehearsal dinner at the Paris Room (the event space above Cafe Soulé) last night ","useful":4,"cool":4},"5fiNuYKb_phGD2ibwkZhCA":{"text":"Tasty food and great prix-fixe deal! Only $18 for app, entree, and beignets! I loved both ","useful":1,"cool":0},"dQFDUd7SV9x7O11Oa5x1XQ":{"text":"Skip this place. Should have followed my gut and passed on this place after reading recent","useful":1,"cool":1},"7k4im0Mr4_HINQQnxBq7IQ":{"text":"The service and food was excellent. The Banana Foster French Toast was AMAZING!!!! The atm","useful":2,"cool":2},"2Eu2uTGvJlbEYwkJT921PA":{"text":"Loved this place! Food was amazing. Had the Monte Cristo, a yummy fried Ham and Swiss sand","useful":2,"cool":2},"Lm2FeJK7-bCq35F06qeajg":{"text":"Nice little cafe just off of Bourbon Street! My wife and I loved eating here! Food was fan","useful":2,"cool":0},"ZcY2d9V_GHSTyXDwUSqK4g":{"text":"I was visiting NoLa on a Wednesday night and found this place just on exploration. It was ","useful":2,"cool":2},"Nnqw7PmAfhKL-8-IibJUlA":{"text":"Nice atmosphere. Small but good food. Waitress Wendy was cordial and very good. Crepes are","useful":0,"cool":0},"jNgjC1AY7ShgKiTzj8zOYA":{"text":"Very disappointed in this restaurant . Saw it had a 4 on Yelp so we went. It took a while ","useful":0,"cool":0},"Ra3kFFEQqZUYWwm4shKySw":{"text":"Cafe Soule was recommended to me by a friend in Oregon. I was not disappointed.  The food ","useful":3,"cool":0},"DE0FSl3xmBF2IplZWLR25w":{"text":"There's a lot to be said for a good PO boy in the quarter. While this place was dead when ","useful":0,"cool":0},"Lac58xbKy5HKKcqkmyPZGw":{"text":"While waiting for another restaurant to open, we stumbled upon Maison Soule and decided to","useful":4,"cool":2},"VbBazdW0xpOkNAjYTtk1mw":{"text":"Loved this place!! It was our first stop when we got to New Orleans. The bartender was fri","useful":4,"cool":2},"_ffe5f8R6lbDjBf_DepAzA":{"text":"Excellent place we stumbled upon, dined at many places in the French Quarter, this was our","useful":1,"cool":0},"m02fpMODsBpzjJs7wCKBuA":{"text":"There was no line unlike every place else around, which should have told us something, but","useful":0,"cool":0},"ZINrfhc69gDxZoJnbloqsg":{"text":"Terrible service. terrible food. manager lied to us telling us we couldn't do separate che","useful":0,"cool":0},"HfmeGtfrxTs2F1VmlU71xQ":{"text":"Hands down, BBQ shrimp and grits was the best I tried on the menu.  We stopped by for a la","useful":3,"cool":2},"G84Rzu-qsTEaPA-3ca9vEQ":{"text":"Great food, the duck confit crepes are a must. Beautiful restaurant with a wonderful ambia","useful":2,"cool":2},"gHq460zcNNJy0xOHLPAkrA":{"text":"Œufs Soulé with fried green tomatoes. Best brunch dish I've ever put in my mouth. Homemade","useful":1,"cool":1},"Pc6rp9Oz5Za7RdrRCQxi8A":{"text":"So we were off on a walk with the dog... headed down St Louis street and figured we'd find","useful":3,"cool":3},"xMDtuCmL8znkeTQ3_N_oVw":{"text":"Love this restaurant! The Monte Cristo was delicious! Michelle was a great server with gre","useful":0,"cool":0},"T0v3LwFIXLfYtBa5i_Q9JQ":{"text":"Bit disappointed with this place. We walked in at 3pm on a Friday, and decided it looked l","useful":2,"cool":0},"y1nJ-lRNZ8YzjLnchutKDg":{"text":"I almost feel like I don't need to write this review considering that upwards of 400 revie","useful":1,"cool":0},"kPjVvnpPnhsu8e3dCd1whw":{"text":"This restaurant was delicious, the food was amazing, however our server was not with it. H","useful":1,"cool":0},"xGrVMo7PGevhmhYEvYe4ww":{"text":"If there were negative stars, this place deserves it. Sat down for breakfast and was immed","useful":4,"cool":1},"W7b-a81Y3EMA9bE--o8BTA":{"text":"They have happy hour from 3 to 8 PM everyday!\n\nThis was our first meal upon our arrival in","useful":5,"cool":3},"EJFCOePm3CxjzLLxt9PJYw":{"text":"I came in on a Monday for a late lunch. There were only two other customers there. The pla","useful":0,"cool":0},"22SopXjp2RfAUZKnBD1aig":{"text":"Great cheap place to eat with a wide selection of food and alcohol. Small enough that it d","useful":2,"cool":2},"1FzsjSWz43EkMpoMgFkDQA":{"text":"Had lunch. Service was awesome and the food amazing. They also pour a pretty stiff drink!!","useful":2,"cool":2},"ytU8fK9UF5UZLq73JKVPbg":{"text":"First thing, our server Catherine was wonderful. She was very sweet, attentive and welcomi","useful":2,"cool":1},"FPVSOmvQjU5BHt2QsF1vPQ":{"text":"Best restaurants in  New Orleans. Inexpensive compared to others in the French Quarter wit","useful":2,"cool":2},"d3YRcvXSAdLBMP5T3B3ang":{"text":"Great place- great service- service was probably the fastest here out of all the places we","useful":1,"cool":1},"ctk1cBACT7V1dcsGbvWpMw":{"text":"Café Soulé is awesome!  The salads and one crepe are the only vegan things on the menu rig","useful":4,"cool":2},"nEoRnYzJIp1P1A5sFtnNSg":{"text":"We easily made a reservation online for this place the day that we wanted to go. It's a sm","useful":3,"cool":2},"iDwzwVQUfR_8T_TY3y8Z9g":{"text":"Best meal we had in NOLA. Got the crawfish etoufee (amazing) and shrimp and eggplant Pierr","useful":1,"cool":2},"COyEdF8hvOLkFm3ufhjD4w":{"text":"Stumbled upon this place while looking for dinner on a Friday night.  No reservations but ","useful":3,"cool":1},"EL5xYCcQk6V7mecvXy529g":{"text":"Can't review the food since we waited 40mins to be seated and then ignored (except for two","useful":0,"cool":0},"gYT8F-QWt8Sgd0s9pSS86w":{"text":"We came with a bachelorette party and they gave us free champagne. It was amazing and all ","useful":2,"cool":1},"cw_B20wgwE35VMNdZqOCGA":{"text":"Spent St. Patrick's day weekend in NOLA and the one time I chose where to eat for our grou","useful":0,"cool":0},"uKLdAP1E2cClz4_HLAfo7Q":{"text":"Cafe Soule is a bright spot down a narrow path on St. Louis Ave in the French Quarter. The","useful":2,"cool":3},"w844Guoe_WwMc2bASfcRzw":{"text":"I truly favored this spot the most out of all place we had a meal. New Orleans is full of ","useful":4,"cool":3},"wVn3trLWibAlKuXjsPPpmg":{"text":"Service is ok. Great breakfast place. Beignets are better here than Cafe Du Monde.","useful":1,"cool":1},"B4f0SYq3I-zr-7IDScXK5Q":{"text":"Is it possible to give this place more than 5 stars? Because...It. Was. Amazing. The food ","useful":2,"cool":2},"5XGckRMRMNAJ3ceUUuZ6HA":{"text":"Very mediocre. Nothing about this  meal was particularly memorable. Two of us shared a cra","useful":0,"cool":0},"mtwSokO7aVvfCDFk9d2KIQ":{"text":"We found this quiet place off the buzzing excitement of Bourbon Street for an early dinner","useful":1,"cool":1},"ahcmqrptfpN4u6jBSXARfA":{"text":"Maison Soule is a quaint little restaurant that everyone visiting New Orleans should stop ","useful":2,"cool":2},"7qcjrtdHNbm2QFeK1vt4xA":{"text":"Cafe Soulè is phenomenal. Chef Tree and her staff create culinary masterpieces in a wonder","useful":4,"cool":2},"ByXo7HTpTsKpxnwGxgLSYg":{"text":"Delicious! Our party had the strawberry crepes, banana fosters waffle, ham omelette and cr","useful":1,"cool":1},"oiBUuDV-kHb-jPCCHsXw5Q":{"text":"We LOVED this place!  Funky, old, charming.  They seemed a little understaffed (it was a S","useful":1,"cool":1},"otkccGVHOT88-BlGdDUR_w":{"text":"The only bad meal I had while here in NOLA.. On my last night, made it very disappointing.","useful":1,"cool":1},"iGjuItdUXgQPwINqk-j0GQ":{"text":"Visited this restaurant with a large group for the Sunday drag brunch. The space is pretty","useful":1,"cool":0},"zyBFIIGhJl70WEkbR4IlVQ":{"text":"We were having a great time in New Orleans, and then we came here...\n\nIt was Valentine's D","useful":1,"cool":1},"hQPz88EjMzAlkVoEWIZ82g":{"text":"The best food I've had in NOLA yet, and that's saying a lot! The fried green tomatoes and ","useful":1,"cool":1},"I9I2Y8dk7vcoYApOG-J36Q":{"text":"Lisa did a very nice job.   The monte Cristo was very good with the raspberry jam.    My h","useful":2,"cool":5},"ckCGfMMP_EqjGEMD8MwHhg":{"text":"The other reviews are from a while ago and I can only assume there has been a change in ma","useful":4,"cool":1},"72LISoSYFUW-XagYNT3pTw":{"text":"We spent the weekend in New Orleans for my sweethearts birthday... we stumbled in this pla","useful":1,"cool":1},"XQDfoMi6Byp9AzSvfcDP8g":{"text":"Our waitress was super sweet and cared about giving us a good experience while we were at ","useful":3,"cool":2},"xKGtB4wu2KjeDjvFuDVvyQ":{"text":"This restaurant was hands down one of the best places I've been too in the French Quarter!","useful":2,"cool":2},"iMojx7jyvc477-K6HF0KeA":{"text":"This was our first meal in NOLA. They had happy hour on Saturday! We all chose different c","useful":2,"cool":1},"F6GIhujOHg5QoydxxJ2oUw":{"text":"Service 3/5 \nFood 4/5\nAtmosphere 3.5/5\n\nThe good: Probably the best breakfast I had in New","useful":1,"cool":1},"bEi9SbVahdhurGJ7eeVftg":{"text":"This restaurant was amazing !! Our server Kesha was beyond sweet, kind and informative. Be","useful":1,"cool":1},"-uCPpGMdAoH9SgVdgO82uA":{"text":"It was okay....  Everything we ordered was cooked/prepared nicely, but somewhat uninspired","useful":0,"cool":0},"mQ_xRIVS2sMwsHn6liko4A":{"text":"Amazing flavorful food, nice local staff... Great service. Old charismatic building with g","useful":2,"cool":1},"gCJOHJqGkDxHAwZx-oXX-w":{"text":"On a christmas day, we are looking for a place to have our brunch. We also wanted the plac","useful":2,"cool":1},"VVAv-jVss24f1AcxVFrcrQ":{"text":"Bartender brought me a different drink than I asked for and I mentioned it gently as he se","useful":4,"cool":0},"mJgQAJLkM1ZXRReZPDcdeA":{"text":"We were on bourbon st and had a hard time finding somewhere for dinner to accommodate 9 pe","useful":2,"cool":1},"5ZU7RqPN1KUog9ySI6Z_fg":{"text":"Bad food, bad service. \n\nAs we walked into the restaurant, the hostess had us wait so she ","useful":2,"cool":0},"xYnDfTPLqdFfWQYEiaBKFg":{"text":"Large group of 7 so had lots to taste- the etoufee was sent back by one of us- it tasted l","useful":1,"cool":0},"59JsZvd2CbO-BRTDofq4Ew":{"text":"Came in for breakfast while visiting New Orleans. This is a really cozy and cute cafe with","useful":2,"cool":0},"XUktSfH7-Mokc0seiLze7w":{"text":"Be aware of credit card information theft at this place. \n\nI got multiple unauthorized cha","useful":3,"cool":1},"V6aza3pf8ZEfNyKvJhoq9g":{"text":"My husband and I loved this place! Great ambiance! Our waitress was, Lauren was terrific. ","useful":1,"cool":1},"8M_zb8kHwecKhmhBfYRXFg":{"text":"I decided to head down to Cafe Soule to get a decent take out meal and saw they offered de","useful":0,"cool":0},"BQf7xCRoBOZkDr96EGVI-A":{"text":"First time at Cafe' Soule'. The crepe was very good with fresh fruit. The cappuccino was v","useful":7,"cool":2},"KmZBM5bcd8Dxr_69xB0dhQ":{"text":"Oh my goodness . Where to start ?  We live just a few blocks away .  So we took a walk ove","useful":1,"cool":1},"GSuQthc0tn-ToupXHmJPwA":{"text":"Un-freaking-believable crab cakes. NOT true Maryland style, amazingly delicious. Can't put","useful":2,"cool":3},"Ih-YmK171bnuS_kZiOwoqg":{"text":"We booked a wedding in the upstairs Paris room. When we arrived the room was not set up or","useful":1,"cool":1},"V-4PZPLL2Am885hrB3t7bA":{"text":"Very quaint little restaurant in the heart if the French Quarter we went to for breakfast.","useful":1,"cool":0},"UTRnQUTSF4272I8EDtPHvw":{"text":"Tabitha is new to cafe soule but obviously not new to waitressing! She was PERFECT in ever","useful":0,"cool":0},"0UbZd-wcF1W2TprX4J3q-A":{"text":"My niece had her wedding reception at Cafe Soule 10/10/15... And I cannot say enough as to","useful":1,"cool":1},"D54UBfzJVB929N90y_Di8A":{"text":"This is my first time in New Orleans and this was the first spot I ate ate when I arrived.","useful":2,"cool":2},"7ypAIl1U-TXKdyDwt4XWyQ":{"text":"This was our first of many, that turned out to be a horrific dining experiences in New Orl","useful":1,"cool":1},"OkHef7-X2IMVlfXh1p9bhw":{"text":"$10 bottomless mimosas on Sunday! Had the game on and food was delicious. I had the French","useful":1,"cool":0},"lsVLGTAKE-W1JujZyu-d1Q":{"text":"This is my second time to Maison Soule.\nThe French onion soup was very good. Also the redf","useful":1,"cool":0},"ejMrDokFp0OCWG8eBH3_ag":{"text":"After a long night of drinking, and drinking and....drinking....we needed food. Our first ","useful":4,"cool":1},"cC3nkYuEOb7ZWAL0Cf2_CQ":{"text":"I usually have a food game plan for each New Orleans visit, or at least a vague outline. T","useful":4,"cool":3},"qzqO1rsUOturz8l61mGGjQ":{"text":"Blaine made the first meal in NOLA great!  Food itself was top quality, the duck confit cr","useful":0,"cool":0},"qWDiissq8m-Ap_dSfybD7Q":{"text":"Stopped in early on a Sunday evening without a reservation. From the first, Harvey treated","useful":3,"cool":4},"I3BVraUczjsC7F7ll7x-FA":{"text":"We stumbled across this restaurant by accident and we were glad we did. The building the r","useful":2,"cool":1},"4fyv_AKHzaNukNyIcvj2cw":{"text":"The food was alright. Nothing to go home & rave about. I had the breakfast biscuit with po","useful":1,"cool":0},"aIG8UjoVWskIMVft4AiHLQ":{"text":"Stopped in around 8 pm one evening for a snack. Staff was very friendly. Decor is nice and","useful":1,"cool":0},"DZI70hNGwWH1WB38xyJhMA":{"text":"Our group of 6 girls have been here for 4 days and this is the BEST meal we have had so fa","useful":3,"cool":3},"e1XY38pv0ZF5VJFi5ZcG1A":{"text":"The menu seemed promising. Cute atmosphere. However... took nearly 20mins before anyone ev","useful":0,"cool":0},"zmmfMZxBeFD-RW6sBD-s-Q":{"text":"Went here later than ourusual looking for brunch but there wasn't many \"breakfast\" items l","useful":3,"cool":1},"XoQLmfrgsxzvg4obSSxnCw":{"text":"Hopefully will be my only regret on my trip to NOLA. The food was bland, arrived cold, and","useful":1,"cool":0},"daKPSYn3U0hfcE1LEykuBA":{"text":"I hate and love to say it but this place has better Beignets than Cafe Du Monde. I experie","useful":2,"cool":1},"gfYgowlakwcvKT12eUi_5w":{"text":"Amazing food Jambalaya was 10/10.\nCocktails not as great but I cute friendly atmosphere.","useful":1,"cool":1},"OWvm7rf5ZnmNh3w21mmnVg":{"text":"Very good food. So far the best I had this weekend. Snapper over red beans and rice with s","useful":1,"cool":0},"1z82aIcVAv72LgLOQcKKCg":{"text":"I love the staff and service here! Recently, I had the Pierre and Soule cocktail and both ","useful":0,"cool":0},"LUj-NY--3pG6vv0RP7qmJg":{"text":"The fried chicken was awesome it had pesto inside the batter. French onion soup was amazin","useful":1,"cool":1},"6r1-r8t0wnb_kdBg5sDjrg":{"text":"We stumbled upon this restaurant as we walked through the French Quarter - who knew there ","useful":1,"cool":0},"ibIlxxP2JALhx9CIx4dQeA":{"text":"I can't thank the wonderful staff from Saturday 1/11/14 enough!  I had a 1920's themed bir","useful":3,"cool":0},"U5pSY4pdsDkqxw8waa94UQ":{"text":"Been staying a block away and often walked passed this little place. Finally, after huntin","useful":2,"cool":1},"EFgJtz55C1XnDjb7OFNjew":{"text":"Made the mistake of not reading the reviews and went by the overall rating. Half the menu ","useful":1,"cool":0},"GTHUeMxdUsQadNMJoJe7GA":{"text":"Despite the poor service from our waitress (Suzanne D) and my extremely DRY Eggs Soule, th","useful":0,"cool":0},"d5RUyztjqfW_dBbUklvO3w":{"text":"Enjoyed a delicious crawfish ettouffe.  The service was kind of slow, but no problems, and","useful":4,"cool":0},"lL3ishNDNRb6KLLouDJzFg":{"text":"Great friendly service. Locals happy to share with you the history of their town and their","useful":1,"cool":0},"Hk221B1QkgjLAJxu8sd9ow":{"text":"This place is the absolute worst. Food was terrible and cold. Server was rude. For sure wo","useful":2,"cool":0},"jvYOrQuCMACLqWIthyxb9g":{"text":"Well... I bet if we went for breakfast we'd be giving more stars, but it's important to kn","useful":0,"cool":0},"2DMFQLYpD-EVqPYOiVLGSg":{"text":"Score: 2.0\n\nPrice: $$\n\nWebsite:\n\nThis was an adorable little creperie that we found during","useful":1,"cool":0},"-WMHZS9cIKXTb7XIV9S7sg":{"text":"We had a reservation for 12 women. \n\nWhen we arrived at 11am, the staff was not ready for ","useful":0,"cool":0},"BmNlyycOxvAobJiadfsCMg":{"text":"What a disaster! The hostess was cracked out beyond belief. None of the servers were on th","useful":1,"cool":1},"HwCPLVYjdFypyImjqWBdAQ":{"text":"took a chance on this place recently as a late brunch spot for myself and some coworkers. ","useful":1,"cool":1},"ZgahOTLdy3rxgO7aNYob_A":{"text":"Semi fancy restaurant in an old but very cool building. Nice art and decorations. Only cam","useful":1,"cool":1},"9iQUn5C_tp-Nw3qMmlHYSQ":{"text":"Loved this restaurant so much! The building is beautiful and full of life and history. The","useful":1,"cool":1},"ZKjkwdOL0pgzrV7Cpo00oQ":{"text":"From the outside, it looks cute. The windowed doors were open, some outside seating, crown","useful":0,"cool":0},"781YaQPnjm0M998b2rx_Tw":{"text":"Went for dinner and tried their Crepe's they were too dry. But their 3 scoop Jambalaya  wa","useful":0,"cool":0},"7COe3CiRGeaK3W1c-eAkPQ":{"text":"This is just off Bourbon Street. What an amazing find! I'm with a group of 9 women who ord","useful":3,"cool":2},"BCbA6eFpLDsLCv1YytYqgA":{"text":"Omg brunch was amazing!!! Everyone in our group loved what we got!  Our waitress was a hoo","useful":1,"cool":0},"lF-YvDdAa6T_fH58GgztKQ":{"text":"This place is a gem. The service was just slow enough to really get a good look at the pla","useful":2,"cool":2},"es8KtBzJ_zCSjsWrP_ZbGA":{"text":"Lucked out with outdoor seating. Service was a little slow but our waitress was pleasant a","useful":0,"cool":0},"eAUhp-sSWhTND8T95d2CkA":{"text":"Dropped in before getting back in the road and glad I did. All I can say is the banana fos","useful":0,"cool":0},"G1TeRP2buw-QbNBzOPEIoQ":{"text":"As much as it pains me to give this a poor score, I have to do it.  We first visited Cafe ","useful":2,"cool":1},"dj4x2_VXFVY7wSmOzKt5MA":{"text":"We stumbled in here on a Monday after a very busy first weekend in NOLA.  We were tired, h","useful":3,"cool":1},"Mm4xh22BWWKSRI3HYCKlEQ":{"text":"Great music and flavorful jambalaya!\n\nI've had Jambalaya at other places but like this dis","useful":1,"cool":0},"x6BGMAzasX6nPA6NMeCeQg":{"text":"Ordered mint strawberry lemonade and the strawberry salad. I was really looking forward to","useful":3,"cool":1},"2Ym97DeCMLXjCF1IWm-aeA":{"text":"This place was legit. Good calm atmosphere right off of bourbon street. Amazing food for a","useful":1,"cool":0},"qlrdI9FTAuFEGeqy375jQA":{"text":"Five stars for service but the food sadly did not match the level of service. I can't, in ","useful":0,"cool":0},"QToWaqtd3ei90iaVuXs2OQ":{"text":"I honestly think the management needs to do something about their employees. As my wife an","useful":0,"cool":0},"n7S8TBaNvBCCzs0BteVaiQ":{"text":"This was a fantastic spot for brunch. We arrived and were shocked to find it practically e","useful":5,"cool":2},"ajqI96oEtGSuyCFramdasg":{"text":"Came for breakfast on a Saturday morning. I didn't see a way to make a reservation or chec","useful":5,"cool":5},"R3LFh6S7LSrIRJK5IVY7fA":{"text":"It took a while (maybe ~30-40 minutes), but the food was delicious! I ordered the Monte Cr","useful":1,"cool":0},"aGCmdfXH_xBXAwi54EY2kQ":{"text":"Can not find better food for this price in the Quarter. Tons of history too in the buildin","useful":2,"cool":0},"k3F1Ic3ypQAdjWsj2oM95A":{"text":"Came here for breakfast. The good: cute, quaint place. Friendly waitress. The mimosas. Chi","useful":1,"cool":0},"1UsuJ_qTqRikol4i_SjS2w":{"text":"Had a wonderful time brunching on a Saturday morning in the quarter. The interior, especia","useful":3,"cool":1},"-ve_UN9bYBcIxbA-37Ykhg":{"text":"Stopped for a cocktail this evening and was treated with incredible rudeness. When I asked","useful":0,"cool":0},"9IjVBa9_3UmQhih4XanNrA":{"text":"Our FAVORITE place in the French Quarter!!!  We went in on a whim just walking by and saw ","useful":1,"cool":1},"agOC1me_AdvHVoGdHqF-OA":{"text":"Was in the mood for French onion soup, funny but true!\nUnfortunately the pics on yelp look","useful":0,"cool":0},"rf4nFfepnRWa5bWzCZK71w":{"text":"I walked in on a Monday afternoon. I have only been in New Orleans for about 3 hours. I fl","useful":1,"cool":0},"iIHG3BD8LNbChMs-EofeAA":{"text":"Go for brunch. Super friendly staff, never let our mimosas get low, and the food was so yu","useful":8,"cool":8},"_9jVxnT6GiVtZl6HjRHKwA":{"text":"Terrible service. terrible food. manager lied to us telling us we couldn't do separate che","useful":2,"cool":0},"md1yWiNmoH2-zq37zWt10A":{"text":"The first restaurant I dined in after arriving to NOLA! We were first greeted by the cook ","useful":1,"cool":1},"BKc1jMcoYoy7DWSBWHLxJw":{"text":"Only reason i gave it 2 stars is because the servers are extremely nice and on top of ever","useful":1,"cool":0},"ALyL98X09H9gbJiMxLlnaA":{"text":"Food was good - but service was terrible!  I had the snapper with vegetables and spinach a","useful":3,"cool":0},"ozn6n4lh4SR3ObQIjSC_NQ":{"text":"Such a cute, quaint restaurant right off busy Bourbon Street.  Very friendly staff that wa","useful":1,"cool":1},"InqR-eRFPXTIP3j0hVRJfQ":{"text":"Delicious shrimp and grits. Huge portion, tender shrimp, creamy grits, and the sauce is to","useful":1,"cool":0},"9JKk998qsHYWuMLwsX8VyA":{"text":"OMG CHEESE GRITS HEAVEN!!!!! I've been dreaming about the cheese grits I had here everyday","useful":3,"cool":2},"rCio9QECn0cFXN_qUcgxbg":{"text":"Loved this place so much we came back twice in the same night! David the manager was super","useful":3,"cool":3},"zuH1rOlv-KAki4TfWldasg":{"text":"Great little gem, decent prices and delicious food. Great drink specials to go. The server","useful":1,"cool":1},"zCpd9q5EaTpJQrWgT_A5Cg":{"text":"Just a lovely experience to be had. Chef was out of a particular ingredient so came out to","useful":1,"cool":1},"W51ua-tW6lD6ugJkqJEljg":{"text":"Unfortunately this was my worst restaurant experience in NOLA. We arrived with a group of ","useful":1,"cool":0},"P_dURGslrrvnuJ08IJM7ig":{"text":"Simple but amazing food. We had dinner at about 7 on a Friday evening. We were seated prom","useful":2,"cool":2},"qakBXPQCEKvCTjmFAHfIOw":{"text":"This was the best sit down meal we had in New Orleans. The place is just off the main drag","useful":3,"cool":3},"Vf1VlJRVufJPCPSorVDFUA":{"text":"LOVED THIS PLACE. The staff was so friendly and the food and wine was delicious. We had st","useful":3,"cool":2},"KwbpGlPULbXe1sGK1bvorQ":{"text":"Omg cannot recommend enough. Would eat the shrimp & eggplant Pierre every day for the rest","useful":1,"cool":0},"5Hf_G8X8Sc3vV9fCSd5JvA":{"text":"Probably the best roast beef po boy that I've had in the FQ. The service was excellent and","useful":0,"cool":0},"D12rdNE4t-Jv-u48H4g8hw":{"text":"My wife and I had lunch here, service was awesome.\nWe had the Cuban, and PoBoy with Gumbo,","useful":0,"cool":0},"VPtAZfu6bFkXvzDhJMCtKw":{"text":"We were visiting from Las Vegas and walked by this restaurant. We ordered the monte cristo","useful":3,"cool":2},"kuonMvLL0Oyz6KUflWMpgQ":{"text":"This could be filed under \"Almost a great dinner\". \n\nAs me and friends were looking for a ","useful":7,"cool":5},"uQ9nKwiIQwMaxlNWdg4N1A":{"text":"Great spot in the French Quarter that has that authentic (aka non-touristy) vibe. The beig","useful":3,"cool":2},"mL1KC4oLnWVTv-uIKaRt7g":{"text":"Yes. Yes. Yes.\nGot the Eggs Soule which is eggs Benedict on Crab Cakes and you must-add th","useful":2,"cool":1},"u7CeRNoAJkyfqr9N4NfnDA":{"text":"Ok so I was walking came in this with the intention of being wowed. The chef stoped us and","useful":1,"cool":0},"JSAgBOocJcyZ8SN1RabH2w":{"text":"I absolutely love this french quarter gem! The food, the atmosphere, the staff the WORKING","useful":1,"cool":0},"UNII5rexTYLg9ti3cH2Dmw":{"text":"Just stopped by for a Sunday afternoon snack. My Frenchman and I really wanted some oyster","useful":2,"cool":1},"qfN_WzxSGmVAhk7IYsCKcQ":{"text":"Came here on our first night in NOLA and wasn't disappointed! It was a little passed dinne","useful":2,"cool":0},"0FzaEyCS2X2JyHFnx28oag":{"text":"On a hot afternoon the seltzer drinks were perfect. I had the Paloma and my husband had th","useful":0,"cool":0},"0W2wktNqjUEAVSz9LgFePA":{"text":"Unfortunately I can only give Maison Soule two stars. I ordered the Fried Chicken with Mac","useful":0,"cool":0},"-G03qleUbc01XLa2mKZATw":{"text":"Liked this restaurant first because it was quiet enough to hear dinner conversation.  Our ","useful":1,"cool":1},"fDuEk3rVZcywq9pUh7j1Cg":{"text":"Stopped in for a crepe... Amazing. We stopped in here for dinner on NYE a couple nights ag","useful":2,"cool":2},"X2h3I-inLB4lgs7uPTKW0w":{"text":"If you read my other reviews, I hope you can see that I try to be understanding and I don'","useful":1,"cool":0},"lG-GiAa4fS1EIg56rh8W1Q":{"text":"Flew here from LA just for a Monte Cristo, to find they're closed on Tuesdays. There is li","useful":2,"cool":2},"MRNSqlXm58AXVz8ISjiWyw":{"text":"Stopped by for a quick Lunch after reviewing Yelp... Was quite disappointed but perhaps I ","useful":0,"cool":0},"YsAsMJe-n5Y56dKih4SmWA":{"text":"We spent about 82 hours trying to decide where to eat dinner and eventually stopped at thi","useful":3,"cool":2},"Wo9Is-dNDW5yjV9oISOudw":{"text":"Went in for breakfast and after being seated they told us they were out of coffee. Fried g","useful":2,"cool":0},"WO22EDJTIAazzcyifrGkfg":{"text":"Breakfast and a Bloody Mary to kill for... refreshing off of Bourbon Street.... excellent ","useful":2,"cool":0},"s2LVfX9Qft62nLWQ7rkSkQ":{"text":"First and foremost let me give and honor to God who is the head of my life...  now that th","useful":3,"cool":3},"d5J_CocYYxp6fNN_XlTwmw":{"text":"My friends and I stumbled upon Cafe Soule in an effort to temporarily escape Bourbon Stree","useful":0,"cool":0},"v6Lgsv5KZaQ73C7IP4VTFA":{"text":"This is one of my favorite spots located in the French Quarter the breakfast was extremely","useful":0,"cool":0},"q_WtITADZ6tK-B3cObXXTA":{"text":"Me and my boyfriend were yelping a crepe place to go to in New Orleans and we decided to e","useful":2,"cool":2},"ONGT5dv5NGohrBgyi_oSlQ":{"text":"Dropped in to wait on a friend.  Ended up with a sample of several apps and some beignets.","useful":1,"cool":0},"pYgadyzn2ZKXqDGuu903QA":{"text":"Place is amazing. Definitely recommend coming here. I'm just drooling over this food. It t","useful":1,"cool":1},"ofHpnakaw8xtLXfXPrS2Eg":{"text":"Had an amazing time here for Sunday brunch! The food and $10 bottomless mimosas were high ","useful":2,"cool":0},"fC0KUdgGFwJa_RGv70jilg":{"text":"What an amazing find just one block off Bourbon St.  the sandwiches were amazing and huge.","useful":0,"cool":0},"Il2ppT72qQ4cK-3-nN17gg":{"text":"Lovely brunch with just terrific service... had the pecan waffles, omelette and eggs with ","useful":2,"cool":0},"KGj0bsxztrMHCKjiBnbzLA":{"text":"The food was good .....Charles ...  My waiter was great  ... he was a hard working man ...","useful":1,"cool":0},"9CKnE0aqbgjW00eDagPwXA":{"text":"Awful. I came here on a trip with my best friends to celebrate a birthday. We were so disa","useful":1,"cool":1},"dE0BGS2QGEm7U-eS4VRUPw":{"text":"I absolutely love this place. My friend was married here up stairs in the Paris Room balco","useful":4,"cool":2},"BQOBg2jdWxQv6GgvZ0Canw":{"text":"Something bad is happening here. The website is down, they don't answer the phone, and now","useful":2,"cool":0},"kat93l08hcLZzFMIIwdaoA":{"text":"AMAZING service and fabulous food! And $5 mimosas- can't get any better! Went for a bachel","useful":3,"cool":2},"FdDuXg7kMTDtZR22s2sg2A":{"text":"They must been having an off day. If it wasn't for the good music we would of left. We ord","useful":2,"cool":1},"HHehc7Cg9rd3XXd6WvVnKA":{"text":"I am so sorry to do this, but this place was just BAD. The food was sub-standard (and I go","useful":2,"cool":1},"OfhGSSwEm9cFiW1EZvCYfA":{"text":"I am so sorry to do this, but this place was just BAD. The food was sub-standard (and I go","useful":2,"cool":0},"e6WHxkeF-OqKXdmqQTtCDw":{"text":"When hunting for brunch spots in the French Quarter, most places have long wait lines. Tra","useful":3,"cool":1},"hl1Ng_749scejv3PBn1skg":{"text":"Disappointing.  I met Lloyd, the General Manager on the Waterfront on Sunday.  He handed m","useful":2,"cool":0},"9T-Ex6t1sjKn9s6eNk1ukg":{"text":"Excellent food. Excellent drinks. LOVED the Sopranos photo across from the women's restroo","useful":0,"cool":0},"1GZQUELYlIbrSjEDpURQyQ":{"text":"This place is horrible ..waited an hour for our food (eggs benny) so we didn't get to expe","useful":1,"cool":1},"HiVNQSCts52KMy7tQhrAKA":{"text":"Thought this place would be great for brunch very friendly people the reason they got the ","useful":1,"cool":0},"9D_efjtGM2QzGHzjS5w-Yg":{"text":"Really enjoyed this place! Small, comfortable atmosphere. I got the fried oysters and Fren","useful":1,"cool":1},"-nuwRRVLL01_LQ8o3JC5HA":{"text":"This feels like a restaurant that caters to tourists who are not expected to be repeat cus","useful":3,"cool":0},"OTUSaUIvL9ZEpc2oBO6eGA":{"text":"We were a party of 6 that happened to stumble upon Cafe  Soule.  To our absolute surprise ","useful":0,"cool":0},"oWBoexmLuJC5ELr3PmXndw":{"text":"I went to Cafe Soule with my family last Sunday, August 6 for brunch, the day after all th","useful":1,"cool":0},"3nftnxR7NcXPIjq5QaWqBg":{"text":"Forget cafe du-Monde and get your beignets here.  Absolutely the best out of all the place","useful":2,"cool":1},"mbiNpT3uwCB0dtVhUcYVoA":{"text":"One of my favorite restaurants in New Orleans. I can't help but try something new every ti","useful":1,"cool":0},"6yMNs3JV0r_E8PABxITnBg":{"text":"For The Girly's birthday weekend, we stopped by because she'd seen it before and was curio","useful":8,"cool":2},"WTBZ8_PFCeAhjcx6H-_hKQ":{"text":"I was expecting funky and haunted with French food and gluten free options. Our server did","useful":2,"cool":0},"o4kyiHE0a73CTa-yZ6zVsQ":{"text":"I may be a little harsh giving this place three stars but I wish my entree would have been","useful":1,"cool":0},"oZClB8KNLJGuqK063YQ8Mw":{"text":"Sat at the bar and bar tender was quite attentive and very pleasant. Too bad I can't say t","useful":2,"cool":1},"S-oB-slti6sNaES9sU9HYQ":{"text":"I can't believe I forgot to review this place from my trip! Maison Soule is as authentic a","useful":4,"cool":6},"R949R0hK0IMT96cxO5qXmQ":{"text":"Two words: Crawfish Etoufee. Service was fantastic. I giggled like a schoolgirl every time","useful":3,"cool":3},"o-KK5Qj-brvn-wVt7KwvsA":{"text":"After reading reviews I thought the food would be amazing. It wasn't. My food was cold and","useful":2,"cool":0},"7ksQWkZ6wt2nXOua1ZywZA":{"text":"We didn't eat here, we stopped in for drinks then stayed for more drinks because a jazz ba","useful":3,"cool":0},"sXzi7GQOHYXt3_U6XWCV5A":{"text":"First and foremost let me give and honor to God who is the head of my life...  now that th","useful":1,"cool":0},"V83IwN6iKbluGEXMlvCovQ":{"text":"Had brunch there on a Saturday because there was no wait as opposed to some of the other h","useful":3,"cool":1},"RtvfSA4cLLGZ1cXxgYb5Pg":{"text":"Rather weird place, I haven't found any French accents there. Waitress looked like she had","useful":0,"cool":0},"9fDIry9RWOW19QoLJDSCiQ":{"text":"Terrible! We had our wedding reception here and was totally ripped off. It was just awful ","useful":2,"cool":0},"9XmcYcY4MwnVwAgqmP8DnQ":{"text":"This is the second time here and the food and atmosphere were perfect! Suzanne was our wai","useful":2,"cool":2},"0RwSneMWK0F85Okm0kv-pg":{"text":"They did not have any breakfast waffles at 11:15 am on a Monday but they gave us the break","useful":2,"cool":1},"wV1PVVUmd9Y_SQKGEdkmkQ":{"text":"Quaint little restaurant.  Service was excellent - food was good, but patience is needed. ","useful":0,"cool":0},"HL0-LlU7AkoZTcwGPl-EpA":{"text":"After seeing a couple of museums, we stumbled upon this hidden gem for lunch! I am so glad","useful":4,"cool":2},"XyfMoSptSP8zIfTGCe6tug":{"text":"I went here with my dad for brunch. This spot has great ambiance, food, and service.\n\nOur ","useful":2,"cool":1},"BjSg07GXkN2-p8mWeVOycQ":{"text":"The food was good and the vibe was a little weird. We came on a weekday night and the rest","useful":2,"cool":3},"sfrIMYz2Dn_C_7xsqe6uEg":{"text":"Excellent little find right off of Bourbon!  If you are looking for delicious apps and gre","useful":2,"cool":1},"zJuAXPFsIrR3eay4YMq15Q":{"text":"Arriving for breakfast, right when they opened, we were welcomed by the most cheery staff ","useful":3,"cool":1},"ZwDVfrhPsuZhBfGaxDVwOA":{"text":"Really liked the food. The bar area is small and cozy, and the bartender made some awesome","useful":0,"cool":0},"kH4plFooaQ4jEG8sM1E3wA":{"text":"The new owner just took over three days ago and she is so friendly and wonderful!! She gav","useful":2,"cool":0},"MiA04SsBQ0u5bbbs1_G71Q":{"text":"The food here is delicious. Worthy of a stop off a side street as you're cruising down Bou","useful":0,"cool":0},"JZ9RECpsHq-HiynjgnbYUQ":{"text":"The service was great. The food was delicious. The cocktails were amazing and they put a l","useful":3,"cool":2},"p4cOW0xOEfmVj6q7UHTLrA":{"text":"One of the worst experiences ever, food was terrible! The waiter which was a gentleman ext","useful":0,"cool":0},"lduyF290EqQ5o77M60ogqg":{"text":"Fabulous \"hard seltzer\" cocktail menu! I'm a little picky w/ cocktails.  And the wait staf","useful":0,"cool":0},"L9tkohGFk7dpWO-psp5eRA":{"text":"Quality food, super service. I couldn't complain about anything at this establishment. I w","useful":3,"cool":1},"Y1I3iegi3xngvLegy4pHXA":{"text":"Quick and friendly service. Had the crab-cakes which were delicious. Reasonable pricing.","useful":2,"cool":1},"SlF6RRAi_pzOLzTwuHF86A":{"text":"I love love love the location of Maison Soule! I also found the atmosphere charming and th","useful":1,"cool":1},"hMbbhq8ghV5fFXbvt3SqLw":{"text":"Very good food and service.\n\nEVERYTHING is hand made.\n\nNothing frozen here or from a prepa","useful":4,"cool":1},"xnSKRTxiTvt5VqCo5h3GvA":{"text":"Y'all, we need to talk about the jambalaya. Absolutely favorite dish we had during our wee","useful":2,"cool":2},"JFdM79LUL66w3_Xj9vPK0Q":{"text":"Upon entering, we immediately got weird vibes. Our server was also rather strange (later f","useful":3,"cool":0},"Cs0IdciI0_FLBteTTAeseA":{"text":"Had the shrimp crepe (with cheddar), and it comes with French fries. Plenty of shrimp in t","useful":3,"cool":1},"jGsgVgSi8WXByetmdhrrBw":{"text":"We found this place based on other yelp reviews. The place and ambiance is lovely. A small","useful":3,"cool":2},"ffkFlfM640Bm9lM4yPpvhg":{"text":"Stopped in on Friday night for dinner at around 7:30 pm.  The atmosphere of the restaurant","useful":2,"cool":1},"9trDGliN7oaUjyzjCh1RGQ":{"text":"Loved this place! Suzanne was amazing, very attentive and fun. The bartender helped to set","useful":1,"cool":1},"K5bIIyIUCZoWOmcAjqKkgg":{"text":"My husband and I really enjoyed our meal here. We were surprised to find an empty restaura","useful":4,"cool":5},"wGpOVy4kKHstO3aO8N7LeQ":{"text":"I dined here for Sunday morning brunch with 6 friends. We made a reservation for 12 pm the","useful":5,"cool":4},"2LVTiEZbaluktwAnHsAfAA":{"text":"I understand the food in this place to be good, but I only ordered beignets (delicious) an","useful":7,"cool":2}}