{"ea_TciW_jESAiWdqIti1dw":{"text":"On March 3rd, I attended a birthday brunch and was blown away!  The shrimp and grits, bisc","useful":2,"cool":1},"CKnj4IgyQQFy9oiQACS76g":{"text":"A vendor brought me here for a nice dinner while at a conference and I must say, i was imp","useful":2,"cool":0},"CP5FlR732oFTlAOkLAg0Fw":{"text":"Uh - this place is awesome! Came here for a doctor-talk paid for by the peeps who own our ","useful":3,"cool":0},"aN47rmUT9DYJfU1eGJgoiA":{"text":"The utmost wonderful experience!  From the sales staff, event manager, hostess, Brandy and","useful":1,"cool":0},"92bL0de-X1I6ZiirYPqn4Q":{"text":"Beautiful event space, organized & friendly event managers and staff, and the food - wow! ","useful":1,"cool":0},"ragAWIshad4_XcUFkTcrLg":{"text":"I went for a rehearsal dinner to this amazing spot in New Orleans, and it was my most memo","useful":1,"cool":0},"8_x1hnC0QIknckYBaMZ-Pg":{"text":"Fabulous! I had the opportunity to attend as part of a group and I was thrilled with the f","useful":1,"cool":0},"E7Fujo0uoP7traHblUtfVg":{"text":"The food is outstanding here, I would highly recommend for any private event.","useful":1,"cool":0},"DWwLJ2GUPee2l1oA1-3IhQ":{"text":"I visited the Calcasieu Room last night to attend a wine dinner with german food/Rudi Weis","useful":4,"cool":1},"2Fld9YGJWvXzVApI-shOWA":{"text":"We had our son's rehearsal dinner last night and it was amazing!!!  The staff was delightf","useful":0,"cool":0},"zcM4FPXN8wfCebnOtZdpHw":{"text":"We had our intimate destination wedding at Calcasieu and I cannot say enough good things a","useful":1,"cool":0},"BvYaupBI9M7wCsc55T26OA":{"text":"We recently hosted a Corporate Lunch / Roundtable in the Higgins Room. Gina and the team w","useful":1,"cool":0},"wF-fCVlOOQqEiJlhXsVQXg":{"text":"There were a bunch of us in town for a conference so this was the best spot we could find ","useful":0,"cool":0},"EynXrp_7agNk4Bk9E4Ln2g":{"text":"Amazing food (we did the cajun tasting menu), great attentive service. They even accommoda","useful":4,"cool":0},"ShHukhPqDj7tVBf0wgTxhQ":{"text":"I'm surprised that I'm the first local to review this place.\n\nI was fortunate to dine here","useful":4,"cool":1},"iiMDvXD4r9MikWcIuh1FHw":{"text":"Outstanding service, venue and presentation. Friendly staff.\n\nThe rolls they made fresh we","useful":1,"cool":0},"X7cFOZTQDJAAoFLdZIldGw":{"text":"This venue is outstanding! I've hosted two events here and the food was phenomenal. Highly","useful":0,"cool":0},"TfYBxC3Q8DAiAF92QH5ZtQ":{"text":"I visited Calcasieu Ball Room (upstairs from Cochon restaurant) for a private party recent","useful":3,"cool":1},"u6LybT9U7YIWC2dOI_Cm9A":{"text":"BY FAR the best wedding reception I've ever attended! The food was ridiculously good - blu","useful":3,"cool":0},"2JvUpHIH1FpL5o65sgh2QA":{"text":"I absolutely love the food of Cochon and Cochon butcher, but with a heavy heart I still ha","useful":1,"cool":0},"lJkhgotLsqvS8lGZCM2emA":{"text":"I was very excited my alma mater decided to host our class reunion at Donald Link's restau","useful":2,"cool":1},"PdvpnIFYh6EgFx87Q8ylgA":{"text":"Absolutely amazing! A+++ for private dining events. Planned a last minute event for my com","useful":2,"cool":0},"D9R00ItJuAc7jfLNX8sCQQ":{"text":"Nice but very noisy. Steak was perfect - couldn't fault it. But dessert was overcooked, dr","useful":2,"cool":1},"I3kbXPeQXDVxukoAQsh6Fg":{"text":"I was excited when I found out a rehearsal dinner I was going to was at Cochon because I k","useful":7,"cool":4},"EonLSUtD_riPoghHEFFsGA":{"text":"Hosted a corporate function for 16 guests in the Wine Room at Calcasieu last night. I have","useful":4,"cool":0},"Zosox75O59dOCVtJ6A1M9Q":{"text":"We had our wedding at Calcasieu last weekend and it was absolutely perfect! We worked with","useful":1,"cool":0},"LrPMpSQz355uD6fekA-7Sw":{"text":"I threw a surprise birthday party for my mom at Calcasieu in their smallest event room. Th","useful":0,"cool":0},"WkA_7dHng5eA5QmPZ_XbYw":{"text":"I can't believe that I forgot to do my review from dinner with Tales of the Cocktail!  Thi","useful":0,"cool":0},"O8fqaSwbtlKBwLAJZLyqYA":{"text":"Came here for a recruitment dinner for jobs . The food was good but my biggest complaint i","useful":0,"cool":0},"5jMY8soFSpZ-4gf0tjOrbg":{"text":"I'm a little confused because I believe this is Private Dining by Chef Donald Link.  Upsta","useful":6,"cool":0},"6ICYiIjBSsfQkuh8ghOJYQ":{"text":"After a painstaking search over several weeks, we settled on Calcasieu as the venue for ou","useful":2,"cool":0},"HabtHULAkmC4BnXrudPX_w":{"text":"Definitely a five star experience.\n\nWe went for a brunch wedding (cool idea, right?). Very","useful":2,"cool":1},"GzJeUIYthFnZPKmM3PRnng":{"text":"We just had a rehearsal dinner for 75. Planning was a breeze with the very experienced and","useful":2,"cool":0},"XjQYR32M1WCRxb__JsIgdg":{"text":"I participated in a Seafood Tasting Panel, at the Calcasieu Ball Room, along with a couple","useful":2,"cool":0},"wmOP_dPjJYKM9qTwqTaKZw":{"text":"Food: 5 stars\nServers: 5 stars\nOrganization brings the score down. Donald Link knows what ","useful":1,"cool":0},"PBrlrNL7QkbejWt9WNYhUw":{"text":"I just got married there on Saturday night and I would give it a thousand stars, if I coul","useful":2,"cool":0},"qi0NuR-htUoIFqLRIzNAOg":{"text":"Truly outstanding. We were here for a business dinner the other week and the entire meal s","useful":1,"cool":0},"5-2LKMY8yNGGp1w8beXJpA":{"text":"I cannot give high enough praise for Calcasieu. Staff were professional and friendly. The ","useful":1,"cool":0},"o9-7yIn9ZyLNLDJsw4nlNA":{"text":"Was lucky enough to go to Calcasieu for the Rehearsal Dinner for my nephew's wedding and I","useful":2,"cool":0},"zRNxYkphu-1ED10HC-c8UQ":{"text":"we reserved this ball room for a big work related group dinner. The space is beautiful and","useful":2,"cool":0},"BRyhjjD6MNpzgOsjntnB4Q":{"text":"This is long. Sorry. If you want to read about the food jump down to near the bottom...\n\nM","useful":5,"cool":2},"TqyJJAuI961xrkkvvNNkZw":{"text":"Disclaimer: I have not eaten here personally; but, I did organize a private dining event f","useful":1,"cool":0},"1q2FlGaT1L74rBtE93tcQw":{"text":"We had our destination wedding reception at Calcasieu. It's very hard to plan your dream d","useful":1,"cool":1},"Agr00BFm8DRQi2KHOrhe3Q":{"text":"It's a shame I can only rate them 5 stars, because the service, food, and overall experien","useful":0,"cool":0},"9uNhouq7QZlbNiGYLneFtQ":{"text":"I am from Los Angeles and a special client of mine was having a pre-wedding event here.  I","useful":1,"cool":0}}