{"aiD1nS5SOekWZfC6VkvsEg":{"text":"Vine and Dine is such a great place to go for a unique experience.  Owners Vanessa and Ste","useful":1,"cool":0},"kxOTFxhbwNjRvCb_B7l_7A":{"text":"I'm a current resident of Algiers Point, and a former resident of the French Quarter, so I","useful":1,"cool":2},"jRRQkR0lkrqz6eNOfK6oGA":{"text":"A great little wine and cheese shop/bistro in Algiers Point (just steps off the Algiers fe","useful":2,"cool":3},"rTvRXF6sWRhqTvEiuaLbZQ":{"text":"Great spot on the West Bank! Salami pepperoni, extra cheese, the mushroom pizza and the cr","useful":1,"cool":0},"3DpwNMbeikcceu5eSjmJbQ":{"text":"Whether you live in Algiers Point and don't feel like driving, or are visiting the French ","useful":0,"cool":0},"uKuADNWyKoIv7u37m9se-A":{"text":"I've stopped in twice now, and I absolutely LOVE this place. Even on a Friday night I was ","useful":0,"cool":0},"BipYnLpletJDAS3wKw8NQg":{"text":"We came for happy hour and enjoyed cheese and wine before heading back to the ferry. The b","useful":1,"cool":0},"kpF4pMtvITCzDBtP3X_nhQ":{"text":"I went there in Dec/2010 for my first time.  The selection of wine was good for a small st","useful":2,"cool":1},"8Gydr_llZaso0vBrvLG1og":{"text":"One of the best restaurants in Algiers Point, we eat here about once a week. The wine deal","useful":0,"cool":0},"iKhRKMU6ewl9IO9vGg81kA":{"text":"Best service and the food was amazing! Had the brie with crab au gratin and the portobello","useful":0,"cool":0},"CghFmhprYE39AllGMATYrQ":{"text":"Living in the Algiers area, and the Westbank in general, I have always thought that in ord","useful":2,"cool":1},"VPj05kx5h-1n6GotVlWFQg":{"text":"Excellent wine selection.  You can tell a lot of attention goes into preparing each dish. ","useful":1,"cool":0},"0JciKMaaScpO7A16cQoovA":{"text":"Vine and Dine, Algiers Point, New Orleans, is one of my favorite places to relax, unwind, ","useful":1,"cool":0},"vrbcl9vi9L7FZl4LaZ9aPg":{"text":"Just moved to the neighborhood in Algiers Point and this was my first visit to Vine and Di","useful":4,"cool":2},"GVW-2zJaKZ0WJKgcxQI4HQ":{"text":"To make it short: Everyone who likes to sit comfortable, eat well aged cheese and drink go","useful":0,"cool":0},"pGjCamPLg7GSagQJJYkwJQ":{"text":"The was one of the worst experiences I've ever had a restaurant. First of all, the place w","useful":1,"cool":0},"NIEZOa91uf28vNbC56Q-mw":{"text":"In classic New Orleans fashion it looks suspicious from outside and the door is on  the le","useful":0,"cool":1},"svJ6O1zPLgioV1OG_LM-yg":{"text":"Actually 4.5 but that's not an option.  I highly recommend this place. Not a lot of choice","useful":1,"cool":0},"rx5TcYKtf0Z0nUlA1EK8jQ":{"text":"As it sometimes happens, a single smart business decision completely turned this place aro","useful":1,"cool":0},"wObFxsy-hCtwAwT64PZaKQ":{"text":"It's simple, quaint yet fulfilling. Great drinking company, that local feel that makes you","useful":0,"cool":0},"SuA4mWl0ULITMr47oLgnAA":{"text":"My neighborhood pizza and more store!  It's a wonder I ever leave Algiers Point to seek ou","useful":0,"cool":0},"7Vh67VB0k_LHH7yRL5JAsA":{"text":"I had the pleasure of visiting V&D on a sorority sister reunion/landmark b'day weekend wit","useful":1,"cool":1},"arXqAF14ZCRUIBNtFELUJg":{"text":"My wife and I had dinner at Vine & Dine on a recent visit to New Orleans. We stumbled on t","useful":0,"cool":0},"YCZVHFAUrTGbQ2LuBK9_Sg":{"text":"What a treasure. And in Algiers Point of all places? We stopped in here after riding our b","useful":0,"cool":0},"Uq9j-51vVfPtBikF6J2koQ":{"text":"We went on a Saturday night and it was quite empty. If you like privacy and want to avoid ","useful":0,"cool":0},"tJdtw4Hzz679YOHQFBJfnQ":{"text":"This is a great little wine bar. The Happy Hour deal \"buy one glass get one free\" was amaz","useful":1,"cool":1},"biywD3SPGO4WZ9OwtTGU3Q":{"text":"Stopped by for dinner and wanted to give Vine and Dine a try. The restaurant is convenient","useful":0,"cool":0},"npmeYtSr4YJ-fmq5SN7JBQ":{"text":"no kids, no takeout. bad business. could be amazing, but I will never find out. and I live","useful":2,"cool":1},"7lQJUZnml6lJEuDHJl7_wA":{"text":"I had my birthday dinner there and the bartender Shannon was sooo wonderful. This place is","useful":0,"cool":0},"kGaynsWoMQw3b3ALr8ztCw":{"text":"Food was tasty, but the service was so mind numbingly slow it ruined the whole evening.  S","useful":3,"cool":2},"JX1ldgTvWuAdMXOPximPiw":{"text":"It's places like the Vine and Dine that make Algiers Point such a great place. I'm lucky e","useful":3,"cool":1},"qXdAokh5aeP7_OHe6GqKIw":{"text":"I am a fan of the Vine and Dine. Nice for a girls night out.","useful":0,"cool":0},"BmNybNxpaO7YnifDA1QLUA":{"text":"They have a good wine selection and the staff is very helpful with choosing a bottle that ","useful":0,"cool":0},"VQApcJXZfEUNBJMyNhLlWw":{"text":"In classic New Orleans fashion it looks suspicious from outside and the door it on the lef","useful":2,"cool":1},"CUNrdFi4AIeeCN2qG2pmUQ":{"text":"Spent the evening as the DD for the Girly and her old work chum. \nStarted out sitting outs","useful":5,"cool":3},"Gzq01j8enDYvVDGdj6kE3A":{"text":"I love this place!!! I work in sales so finding places for me to relax and unwind is a mus","useful":0,"cool":0},"kOobD5dBhX5_2Dpd9GRnKg":{"text":"Vine & Dine is a great little neighborhood find! Excellent wine selection, with cheese, sa","useful":5,"cool":3}}