{"Clb8XB5K2p15ZGtTao2tyw":{"text":"With some of the best pastries in the area, this is one of those must see coffee shops. Wa","useful":2,"cool":1},"NcmTXSwQpcUk1Dufe0fx3w":{"text":"I've been to this place three times this year, and it keeps getting better and better.  Th","useful":12,"cool":13},"5tl6B3QQA7uoJiuaDAHgLA":{"text":"Delicious pastries (I quite enjoyed the giant chocolate chunk cookie). Relaxed, nice atmos","useful":0,"cool":1},"26UvTUiIN25cliXrVohACQ":{"text":"Who Dat has a close-knit neighborhood feel. I can only imagine the people that come here t","useful":2,"cool":1},"nZuVboW0po_gx-Ah2WF1-g":{"text":"Best King Cake in the city! I also had their baked granola for breakfast the other day whi","useful":1,"cool":1},"Xdx9bAxcpCz3AFeUXRuf9w":{"text":"This place is amazing! We are from Texas and my cousin brought us here. We were greeted wi","useful":0,"cool":0},"5bu4YK5oUB7_TxdOkBitQw":{"text":"We stumbled upon this neighborhood cafe while visiting Nee Orleans. It is not fancy but th","useful":1,"cool":1},"2EyjYZYlapNrJK0BTkF_Ng":{"text":"Very cute, fun and unique atmosphere. I loved the bar with a wide selections of coffees an","useful":0,"cool":0},"amtH-t-w9LqsYk1LtUh43A":{"text":"Awesome breakfast!   Everything done superbly and large portions.  Wish we weren't too ful","useful":1,"cool":1},"HrjzpGAc-NAaiqoG4569ww":{"text":"You MUST eat here! HolyWOW... I had the quiche dish breakfast called DA St.Phillip quiche ","useful":0,"cool":0},"UH_DTWhMcJ4gbvUUgAvI0w":{"text":"The place is so cool in terms of interiors.. Servers are super cool too !! The food is ama","useful":0,"cool":0},"IEPGqrrVrDrVbYpdapLlUA":{"text":"Absolutely delicious!  Everyone ordered something different and each dish was tasty.  I wo","useful":0,"cool":0},"rQHzuGrH6G1uquDjSKvTgA":{"text":"Not your mothers cornbread was delicious. Coffee was good. Service was great. Atmosphere w","useful":0,"cool":0},"3zRaEqRnFgBhJg58PNqb6Q":{"text":"Perfect cafe that was right in the neighborhood for our stay in New Orleans. I had an amaz","useful":2,"cool":1},"BuM5gbY6a1NcmTViD1LxKA":{"text":"Found this place on a rainy Sunday morning. Such a cute little cafe, brightly colored and ","useful":0,"cool":0},"jG9HjlolMT_AvsEFwzVXSw":{"text":"Yep, the other reviewers are right on it. It's cute and cozy with good coffee and very fri","useful":0,"cool":0},"P38lJMgIw7-fj0VNON0B0g":{"text":"Who Dat is a Nice coffee shop. I could see why people like to come here. Wi-Fi / Internet ","useful":0,"cool":0},"D6AC24nJzj_Cz3gOS-Sv1A":{"text":"Last haul before the airport. Great neighborhood breakfast place in Marigny! They also ser","useful":1,"cool":0},"wq10R5BV1ltyAvVK5XQWPQ":{"text":"Amazing fresh foods. Over the top in flavored. Service great!!  I love the crisp fresh sal","useful":1,"cool":1},"fSYTmL6wu3yiAJ7sC2dnZg":{"text":"OH EM GEE. The corn cakes are amazing!!!","useful":0,"cool":0},"-CUe4h1ruuEmJmJvn7rd3w":{"text":"Eat here if you're looking for breakfast. Good food, great service and vibe. My kinda plac","useful":0,"cool":1},"ST2GfDoZ57v0mk0AR_Blcw":{"text":"Great neighborhood coffee shop! Super friendly staff, great coffee. The breakfast sandwich","useful":0,"cool":1},"JB5vj1WNai4b6Q-Zivg4Dg":{"text":"A friend on facebook suggested we try Who Dat and so glad that I did.  Loved the atmospher","useful":0,"cool":1},"1rrMMLplcpnyLcZLfAqvYQ":{"text":"We had a great breakfast on Valentines day, the best tasting hollandaise sauce I have ever","useful":0,"cool":0},"3GMoUzOPN8YQE9ts7H6nig":{"text":"Came here for the first time about a year ago, and loved everything about this coffee shop","useful":0,"cool":0},"tSsqv_GYFOk6GzJRVcaByQ":{"text":"Sometimes when I need to study, I will go out of my way and drive from Ponchatoula to go h","useful":0,"cool":0},"UQzrNCfTjop3aL6XjPsf9g":{"text":"I'm so glad I discovered Who Dat Café! It's become my favorite Marigny coffeehouse! Nearly","useful":0,"cool":0},"vlKfpYU3VeQKzoXDK7DeuA":{"text":"Coffee/chai 2 stars, service and atmosphere 4 stars = 3 star balance. Who Dat is such a cu","useful":0,"cool":0},"bXPDc4pwuYjcLR-hrmX2LA":{"text":"Overpriced, mediocre coffee. Baked goods are very good. I'd go here more often, but I coul","useful":2,"cool":2},"UNiM2A39rLUNP6bjPxxhaA":{"text":"Delicious Reuben sandwich and impressive side salad for lunch today.  Service was fast and","useful":0,"cool":0},"oeoDJxcohiytP2cI7GebIQ":{"text":"Great little neighborhood spot. Food is good if a little pricey and the coffee is spot on.","useful":0,"cool":0},"ILn7cbFL7ycXZ3fmuoCJmQ":{"text":"Lovely place. Enjoy the relaxed but very nice atmosphere. Outdoor tables available to enjo","useful":1,"cool":1},"YKjqeguu_MZe2_-SeZsvMg":{"text":"My wife and I were stranded in NOLA for a day and this coffee shop was right down the stre","useful":1,"cool":0},"EVD5Tcv3ZBtGSIYwWxUjJQ":{"text":"I have spent a lot of time studying and hanging out in this cafe. I do like the coffee, ch","useful":2,"cool":0},"RIGjY4lKc2ooLRtyS0iESQ":{"text":"Everything here, from the friendly staff to the stellar food and drink offerings is all to","useful":2,"cool":0},"Aaugod7PqpTSR3F8AgP6Ag":{"text":"Best bloody of all.  I love this place.  Jams are absolutely great.  It's consistent and w","useful":0,"cool":0},"pH9oUywmCSxGwTaVkfCgoA":{"text":"The Who Dat is my favorite neighborhood coffee shop. They make their own spiced chai fresh","useful":1,"cool":1},"IQVwMUWA6MDtz0KpW0OywA":{"text":"I love sitting outside, inside in the front, in the back on the couches. I like doing work","useful":2,"cool":0},"EWhxMwXBE4DqLIgmwJ7bjA":{"text":"We loved this place. It was busy when we arrived but they had a comfortable waiting area a","useful":1,"cool":1},"N1Q39-dJk37zEJcx2bruPw":{"text":"Strawberry cookie, what kind of unicorn magic is this??","useful":0,"cool":0},"44Sko1Esag728TIG6oMdLA":{"text":"After cycling past for years & seeing outdoor tables filled with cheerful patrons, we deci","useful":1,"cool":1},"KVn0yvzyTl9w8rXJA7ejYA":{"text":"Great service from Collin! Excellent food, portions and price. Quiet atmosphere and dog fr","useful":0,"cool":0},"mtKG-4CLd21Y8pBzMyZWRA":{"text":"The coffee is good but they don't know how to make a latte with almond milk. One day they ","useful":1,"cool":0},"YM-0p82fPUNP0X-0oNjyYw":{"text":"Wound up eating breakfast here, only because Birdie's was closed... but it turned out to b","useful":2,"cool":1},"Wq9aEaladJRoSxU-nz9jIQ":{"text":"This is ABSOLUTELY my favorite breakfast and coffee shop in New Orleans! You cannot go wro","useful":1,"cool":0},"RghTzesOZoFhHZrHq9_cTQ":{"text":"decent coffee, better breakfast egg sandwich. cute neighborhood spot","useful":0,"cool":0},"HxSLU-uPh9YsxBFqsYvw7g":{"text":"I popped in here while talking a walk around the neighborhood with my friend and her dog. ","useful":0,"cool":0},"_IsZxc6yxn7XK8a3LDPT6A":{"text":"Exceptional service. Excellent brunch available every day. Truly a neighborhood hangout.","useful":1,"cool":1},"0oaNls8BryNXZa9k82BuUg":{"text":"Who Dat Coffee Cafe was an enjoyable place to study for a few hours (free wifi), especiall","useful":3,"cool":2},"W4Wn2h8sxBcTJA0pMbE_fg":{"text":"What a great experience!  Humza was our waiter and he was fantastic. Craig (the owner) -- ","useful":2,"cool":2},"aspmQiNGjyYwYFG4Qgq1zw":{"text":"This was another local spot that we found on my last trip to New Orleans.  The service was","useful":1,"cool":1},"Nx4Trb5HrUeVZ6e5hVjWOA":{"text":"What a great little place just off frenchmen street! Breakfast and coffee- so worth the wa","useful":0,"cool":0},"JZ52KAx3YmKOAZQ7_TN-gw":{"text":"Oh yeah! That's the place to go for breakfast! We walked about a mile to get there (you ca","useful":3,"cool":0},"5xBmqaHpZMQb2hXX2vOMjg":{"text":"THE CORNCAKES ROCKED MY WORLD! Oh my gosh, I promise I will come and eat breakfast here at","useful":2,"cool":2},"QWTD89WBqD7yXIbdgsGZiA":{"text":"After visiting here several more times it obviously bringing me back for more so time to a","useful":0,"cool":0},"dKvQDCQxZbESyVO_N6wyog":{"text":"Decent amount of places to sit compared to some of the other local spots.  I ordered the S","useful":0,"cool":0},"m06jjaMo3DSw1AswgF9j7g":{"text":"Wow! Great breakfast and Yes those weren't my mamas cornbread! They were better!!! Loved t","useful":0,"cool":1},"fBD4Rb6eUFhjrlMPX3gyrg":{"text":"We went for brunch on a Sunday, and the food was absolutely delicious!  Great, very friend","useful":0,"cool":0},"MWgnu8lb9QFGzlZFqZkZmQ":{"text":"Gotta say, the food here is yummy! I had the 'Mandeville Omelette'... Very rich and delici","useful":3,"cool":2},"VCJEuMLev6jsevG46mnLPA":{"text":"thank you craig for cafe nero.  We finally stopped in and got FOOD.  I'm just watching thi","useful":4,"cool":1},"es6-q6D_wOq6Ird-stNyng":{"text":"I love this place. I used to live around the corner but had to move and I came back for a ","useful":0,"cool":0},"ElOyxtWYJhzyGS6K2K0buA":{"text":"As I write this review, I have been here 3 times in 2 days. If all goes well, I'll be here","useful":5,"cool":4},"d19-9Q8nkl2ehznXR0XdFw":{"text":"Well damn, Who Dat, you have come a long way.\n\nThis place is like literally a block from m","useful":8,"cool":8},"YP3R7MIlBfVYLvMXJ9L64w":{"text":"Food and coffee are great here, and the ambiance is homey and great for both socializing a","useful":1,"cool":1},"CIRY_hmX-FwlCceMxHx2uQ":{"text":"now called hallowed ground, still a fabulous hangout for the locals in the neighborhood.  ","useful":0,"cool":0},"HIHnU27izz16JT8KQr7Hig":{"text":"NOLA - all things gentrified in a slightly shabby chic way. We stayed in Marigny and wante","useful":0,"cool":0},"zvS3FjRetT9lBQxEdX6ZRA":{"text":"Amazing food and great service.  Collin the gm is so kind and well mannered. The food is w","useful":0,"cool":0},"etPxNFTkJFsHAPsgQxxGTQ":{"text":"Wasn't so pleased with my last visit on 10/3/14. I purchased banana bread. As I was eating","useful":1,"cool":0},"jDQ-kXkoB489IFBizsqHXA":{"text":"Amazing egg and sausage biscuit. Perfectly complimented with a chocolate banana pound cake","useful":0,"cool":0},"9fGFcjaZ036FeVwONnA4TQ":{"text":"Huge fan of this place, but be warned it's cash only. At least they are nice enough to put","useful":3,"cool":1},"Zqw9ilI8RTN0Kcmo_hB61A":{"text":"Who Dat Coffee is my go-to spot in the Marigny. Their establishment is quirky yet welcomin","useful":1,"cool":0},"InsmcP4dc5mHUJadEXNP0Q":{"text":"I loved the almond latte. Rich not too sweet, just what the cafeine doctor ordered after l","useful":0,"cool":0},"h6vQUg_l-uYS1Cu6zjXD3A":{"text":"sooo good!!!   I stumbled upon this  place when riding on my Confederacy of Cruisers Bike ","useful":0,"cool":0},"Xk6iDlOdcz-H8tr6kuj1Vg":{"text":"Great place for lunch. The Nero salad is a big local creole tomato stuffed with yummy, spi","useful":1,"cool":1},"N87Xwjh0B9RsMugGg7utkg":{"text":"I love love love this place!  The coffee is good, the teas are great, they have pastries t","useful":0,"cool":0},"GQi4RLgGD0TfQivCdHlW1g":{"text":"One of the best dining experiences I've had in New Orleans. Very friendly service in a uni","useful":0,"cool":1},"WCYJ2V37T-z9ovzG5mAu8A":{"text":"Order: Cappuccino\nPrice: Free (normally $3)\nPros: Friendly staff, HUGE sizes\nCons: Not the","useful":0,"cool":0},"jYjWCzK4ZlXqNWagAxG93w":{"text":"I love this coffee. Who Dat has the best coffee around. HANDS DOWN. I've never been dissat","useful":2,"cool":0},"Q32sqX0wNZn7appyWUcpGA":{"text":"This isn't my first time here but I needed to leave this review. It may be a little crampe","useful":0,"cool":0},"ZagS-S6OX-ZbgzLm7vWPJg":{"text":"this place never ever disappoints  . . . . . always excellent food & rock star service","useful":0,"cool":0},"jBT0pLy0FZt5d9Y0SamlQA":{"text":"I ate hear after running the crescent city classic. Eating after a race makes everything y","useful":1,"cool":1},"2cuo12WjPa1aRBi45gUfjg":{"text":"I was in New Orleans visiting last week and we ate breakfast here because it was down the ","useful":1,"cool":0},"W0v_uEA8L2MVm6wjcQDehA":{"text":"this place is a real gem in Marigny. Our hosts recommended it it is absolutely  wonderful.","useful":0,"cool":1},"-Z-ZGgdv3LrjI3ULzHKjfw":{"text":"I tried to understand the phase of southern life. But 30 minutes passed. We still don't ge","useful":1,"cool":1},"vJCPBBeGOwOMvIsNLpkDng":{"text":"So I happened upon this place during a day of whirlwind apartment hunting, desperately in ","useful":8,"cool":6},"nFD9JoEGtmMAWT7A6COWyA":{"text":"I'm a huge sucker for brunch, but I've never given a brunch place 5 stars before. This is ","useful":5,"cool":3},"pzG8LTj_cm4FWw8sKAwQvw":{"text":"good coffee with outside seating, wifi, and super-nice folks. haven't done much snacking y","useful":2,"cool":1},"XFwWRuyfYFgtekYPw9rhuA":{"text":"Cool New Orleans coffee shop.  They have fresh baked pastries and homemade jellies and a f","useful":0,"cool":0},"x_nz5hPK7m9-ZJmFQyF53Q":{"text":"Highly recommend!   Awesome food and friendly service.  I had the cornbread cakes with che","useful":1,"cool":1},"53Y6JZJuhiEaPnitlCaxiw":{"text":"Great sweets and drinks. But I saw a mouse twice while I was seated in the cafe. I notifie","useful":2,"cool":0},"sm4QAwAfTj9rykGQh8sQcg":{"text":"This place brings with it a very special and magical charm about it, that lifts your spiri","useful":0,"cool":0},"JKoCSG4vX5-VnN2mUHxNTA":{"text":"I love love love this place! \n\nI recently was working a contract job in the french quarter","useful":5,"cool":3},"S_7UxCul78A5nhOjbiLbWg":{"text":"I've never had a bad experience here!  In the earlier days of the Who Dat, I was there alm","useful":3,"cool":1},"NUOB28-DSF2DGqUv7TSJvg":{"text":"After visiting here several more times it obviously bringing me back for more so time to a","useful":1,"cool":0},"kk8X24iFHyVtBgUU0Ro1kw":{"text":"3.5 stars\n\nIt's hard for me to instantly become \"a fan\" of a business after just one visit","useful":6,"cool":3},"dDeFXwyTSMyb2_oLDSTVGg":{"text":"Ok...I'm at a lost for words. \n\nWhich we know is to be next to impossible. Normally I know","useful":5,"cool":2},"BzzezNDvkzYuCp24Ys-i9Q":{"text":"Absolutely fantastic experience there this morning. I had the best crab cake Benedict I've","useful":1,"cool":1},"UQcjDklazPRAEJzx9Co2-Q":{"text":"The best coffee, staff, and neighborhood hangout, hands down!\n\nI can't say enough about th","useful":5,"cool":2},"_Ab-5LdB0069I-NmjNZm8Q":{"text":"DELICIOUS espresso, very friendly staff, beautiful pastry counter. I was tempted by the co","useful":1,"cool":1},"mlAGcICCDKVwNvE5n6iFNA":{"text":"We ate there for the first time this afternoon. I ordered the eggs and hash, and she order","useful":1,"cool":0},"fAsnh1gjwbqxjxg6G1se5A":{"text":"This review is two parts, one for my first visit (to the coffee bar side), and the other f","useful":2,"cool":1},"q4jdLH9wulyVod_4YrcJUQ":{"text":"Randomly found this place searching for a coffee shop to do my homework. I was informed I ","useful":0,"cool":0},"Nm9114DnPISSvTGQYHDUwg":{"text":"Excellent service!  Eggs crab bend is excellent had house side salad loved the dressing.if","useful":0,"cool":0},"JgFv__ws0HQoMgRnZjDMrQ":{"text":"Service 5. Fast and friendly.\nFare 5. Excellent coffee and nosh. I drooled over the cupcak","useful":3,"cool":1},"2fGj4YhDTE7wQcEen4jRYw":{"text":"Well first, the coffee here is so good and carefully made. The food is delicious and their","useful":0,"cool":0},"sskms9ZL4dt4BXg-nTIF_g":{"text":"If you're in NOLA, give this place a visit. The restaurant is trendy and well-decorated wi","useful":3,"cool":0},"z1H_PhAhVz80lhL9Z9VVbw":{"text":"My kind of joint... good product (I only had coffee so can't speak to their other offering","useful":3,"cool":1},"GQGyoGFIB5gZm1swOVAjwA":{"text":"I came for breakfast on a Tuesday; it was one of the best meals I had during my 3 days in ","useful":0,"cool":1},"Sn0JcTz58aboPMN8a8q6DQ":{"text":"This cute place ended up being the first and last stop during my stay in the Marigny. I wa","useful":8,"cool":4},"g9fo7UEGp03-pdpD1dPpTw":{"text":"This is one of my absoulute favorite spots in the entire city of New Orleans! The coffee i","useful":0,"cool":0},"htOa2Oqe6f7zZpx2n9MTXg":{"text":"We decided to give Who Dat Coffee a try for our recent Valentine visit to Nola for an afte","useful":0,"cool":0},"2nO34MCAWb6pqWoS3lnePg":{"text":"Fantastic place!  Service was great, Bloody Mary just right, food was very tasty.  I had t","useful":0,"cool":0},"-upVJ3ob_ALt8lMg4pCwIg":{"text":"Always like to visit Who Dat and have breakfast/brunch (which they serve until 3pm every d","useful":1,"cool":1},"wfiBREU6qE-SlljnXz0B2Q":{"text":"Nice coffee/breakfast cafe, with friendly staff who are a little slow at times, but if you","useful":2,"cool":1},"zfLzsc7wB4GVgiZ0ztSgxQ":{"text":"This place seems nice with lots of choices. Nestled in a sweet neighborhood with lots of A","useful":0,"cool":0},"i8bbmKZHgpEF45APEuLDQQ":{"text":"I discovered this place right before I moved away from New Orleans for good about 7 years ","useful":0,"cool":0},"yulXmlwQZvh0S12j77FD9g":{"text":"I walked over here to grab some lunch just before noon on a summer Tuesday. The service he","useful":2,"cool":2},"21kTpovE0ovJQ-IdWVzY3g":{"text":"I just had the catfish special for lunch. The catfish was sublime as always.\nHomemade blue","useful":0,"cool":0},"V9_sMKOba23HWk-cKI-HjA":{"text":"Iced coffee was amazing and the quiche was even better. Add some homemade jam and a perfec","useful":1,"cool":1},"HpH_fbtCCfj0sRlsDE7aWg":{"text":"Went for impromptu breakfast and was beyond satisfied. Food was great and coffee cocktails","useful":0,"cool":0},"-a4skiva64nav7xaWadFvQ":{"text":"Great establishment, just a little bummed the kitchen closes at 3 pm. So we ended up getti","useful":0,"cool":0},"2H-_kJIrkkOvt-ykWNpYkA":{"text":"Phenomenal. I'm a very picky eater and I've never had corn cakes before... I tried my girl","useful":0,"cool":0},"knETVOsk3hF5CJpFAkuPnw":{"text":"Great vibe (chill and yet \"alive\"); great staff (everyone is authentically nice); great co","useful":0,"cool":0},"dS3AIWqng3p2ikVh2UHxjA":{"text":"Friendly, fast service without a long wait. Crispy bacon and hash browns. Quiche was crust","useful":0,"cool":0},"PaCdD8US6g9K8QiOEJeKyA":{"text":"This is ABSOLUTELY my favorite breakfast and coffee shop in New Orleans! You cannot go wro","useful":1,"cool":0},"ggi-bDwCdsv_ugDydEz-yg":{"text":"I can't go anywhere else for coffee, Who Dat has ruined me for any other coffee shop. I wo","useful":0,"cool":0},"oq679DIWj9HShkcZm2w3Eg":{"text":"sympathique café de quartier, simple, agréable. Le café est juste ok, mais c'est plus pour","useful":2,"cool":0},"pL6OiHc5iDK-gFagR601CQ":{"text":"Came here for the first time yesterday and so far I am impressed. I was happy to find that","useful":4,"cool":4},"eWdaLaG2yOnlu5-xaL-B8A":{"text":"Breakfast and lunch food are good. Good also for wifi. Parking is off street and decent.","useful":0,"cool":0},"ZJdq8rBwMa1USHJ9Yq9Ftg":{"text":"Friendliest place, with great food offerings and truly adorable waitstaff!   Lots of dog w","useful":0,"cool":1},"3l-_SC3Zxfyw1yBapE0iVw":{"text":"Best breakfast and brunch place we've found in NOLA.  All their benedicts are amazing and ","useful":0,"cool":0},"-_xOqOBOsJR8W1ySR9dZRA":{"text":"Everything on the menu sounds delicious. The st Phillip quiche was amazing. And my friends","useful":1,"cool":1},"bmR8pT0sk_f9qvPyYsAjzA":{"text":"Cute lil spot in a trendy neighborhood. Loved the food and atmosphere. It was a great last","useful":1,"cool":1},"dlp3PC8k-Zaxz8zppWyFrQ":{"text":"Nice little breakfast/brunch café with a very 'ma and pop' feel. Seems like you're eating ","useful":1,"cool":0},"4YkCTGxWvi3zMNOvb5KcFg":{"text":"Good breakfast; good flavorful food!  Nice vibe.  Friendly service","useful":1,"cool":0},"gUn-iiJRKkU25m-MA5S3Pw":{"text":"Best place to eat in Nawlins! Ask for Donna!","useful":3,"cool":3},"bu3ZPAM9zQsPe0uGUno_Vw":{"text":"With a name like \"Who Dat\" it's gotta be good, right?\n\nThis is a neat little Marigny coffe","useful":8,"cool":5},"HU_Ee4AiT4g5ota4bLbT8w":{"text":"Yummy breakfast options, especially the cornmeal cakes. Nice atmosphere outside.  Service ","useful":0,"cool":0},"tnDe_N1n-5EKwPs98jfLGg":{"text":"Who Dat is a Nice coffee shop. I could see why people like to come here. Wi-Fi / Internet ","useful":0,"cool":0},"FaNRtVQkPTjKvAW8NaRBQg":{"text":"Love this little place! The guys who work the counter are always super sweet and welcoming","useful":0,"cool":0},"Wbt6jmrQbFmzbfP6CE9FJA":{"text":"Food was very good service was NOT. The young waiter was very slow and inefficient. Had to","useful":0,"cool":0},"9_JqBcMf35KB1vdRXjwjhQ":{"text":"Sweet, quiet place to enjoy a fine cup of coffee and get some work, offline or online done","useful":3,"cool":3},"IuMsXGm04Jfgp4nZWV2dkQ":{"text":"I love sitting outside and doing work here. The lemon ginger iced tea is delicious, and ri","useful":0,"cool":0},"2snXOhyZ9XIgBEhg8lEOUA":{"text":"Absolutely love this café! Tucked away just beyond the craziness that is the French Quarte","useful":16,"cool":17},"KnSwbeX-dr8TJBqqLzdRSw":{"text":"I'm picky about the price of food at places and I typically find coffee shops over charge ","useful":0,"cool":0},"N4QSMLMfc2rVBnHPAj7F3A":{"text":"My family and I come here every week. The WhoDat is the place that you would NEVER imagine","useful":1,"cool":1},"1N-BjtHtOh4j-1-G97WfqA":{"text":"I love this place! Have been going since before the restaurant opened. The coffee is great","useful":0,"cool":1},"aVx_KYJGDLhK9iwiUFqjDQ":{"text":"We came here for our last morning in Nola based only on the one review on Yelp here that s","useful":1,"cool":1},"AfJKv662q5_-NWMquDfmVA":{"text":"Sometimes when I need to study, I will go out of my way and drive from Ponchatoula to go h","useful":1,"cool":0},"HdY7BxgctfSzGm6Lv_exAQ":{"text":"Definitely my personal favorite coffee  shop. Staff is always friendly, coffee is amazing ","useful":0,"cool":0},"uWTJAKaXtu9wLaONzsyfcQ":{"text":"Great place, loved the vibe and the decorations and the food of course :) Our waiter Humza","useful":1,"cool":1},"YEBauEL0K8PHdcTYWXgkFA":{"text":"While visiting New Orleans, Who Day Coffee Cafe adopted my friends and I as regulars. We r","useful":1,"cool":0},"lZYIRSl-CYWBG0G8Dd3ePA":{"text":"Lovely atmosphere! Service was prompt and courteous. The coffee was full-flavored and nice","useful":0,"cool":0},"uzxjERbrfSeAMDaQAUOEAg":{"text":"Great food. Great coffee. Ample seating outdoors and indoors. Neat vibe. Great neighborhoo","useful":0,"cool":2},"ki38VdYB7fVlwKNzalb2BQ":{"text":"It is very hard to find a cafe with such a friendly staff as Who Dat. I was going to The O","useful":0,"cool":1},"hJyN8B2EyDzq0hsnLXH2gw":{"text":"My husband and I live in the Marigny/Bywater, and make our way over to Who Dat once every ","useful":1,"cool":1},"K_DQ_4T_a12hQet2sE1gNA":{"text":"Shhhhh don't tell anyone!! Although with the hotel finishing up across the street soon, I ","useful":0,"cool":0},"s12g-fvYKg0e8dvtN0nb0A":{"text":"Best King Cake in the city! I also had their baked granola for breakfast the other day whi","useful":0,"cool":0},"2gkxo-u19Qmnx5T69WVyCA":{"text":"Yo! The breakfast here was fire! We called in a huge order for 14 people and it was 100% c","useful":0,"cool":0},"Llhb7Py4chllWB8pSKQgKw":{"text":"Great breakfast, home made preserves, best coffee, great place, nice people.","useful":0,"cool":0},"uPD8aZn1P_RriB3W7YYRIw":{"text":"This is my favorite bfast/brunch place in New Orleans! The food is crazy good and the serv","useful":0,"cool":0},"AeeOg3415MafARKeK4TJqg":{"text":"If you get here before 10am you can save a few bucks on the classic breakfast! Food, servi","useful":0,"cool":0},"588Zf__J4CgZwBaRYHClgg":{"text":"The coffee was fine, the atmosphere pleasant and interesting, and the staff outstanding, b","useful":0,"cool":0},"U8_iSYenPoRR2vPWFIdKlw":{"text":"Wonderful atmosphere and service here.  I walked in just before the kitchen closed at thre","useful":2,"cool":1},"pB2SRnv50NucF4G93BUCkQ":{"text":"This little hidden treasure is on a quiet residential street in the Marigny. I stopped in ","useful":0,"cool":0},"TGqpBsJLAEtsRE8TkZVwig":{"text":"The odd name suggests depths of funkiness that are left largely unexplored. Very few vegan","useful":0,"cool":0},"_3IHtcjnoOv_DelLo1TjOw":{"text":"This place is wonderful. Talked to a nice lady named Sheila while I drank coffee. They do ","useful":0,"cool":0},"YVV_jYtKAioI8uAKbqktFA":{"text":"As a coffee shop I would rate it as a four, as the baristas are all super sweet, I love th","useful":0,"cool":0},"8NuBT9VPsFoDgLfKCFnDDQ":{"text":"Came here during Essence Festival. Staff was soooo nice and the food was good and reasonab","useful":2,"cool":1},"wLlR4JGcoqp-KfUgdo3TZQ":{"text":"As much as this coffee shop brings back weird memories for me, they still offer a great me","useful":1,"cool":1},"U8taKiif1bz03xkHuEdFUg":{"text":"Super cute cafe style ambience. Offering delicious southern interpretation of breakfast in","useful":0,"cool":2},"BM9PlupDKQFbz3lJQXQIDQ":{"text":"Head's up: I review the coffee and experience, not meals here.\n\nI like to refer to this ca","useful":1,"cool":1},"cEpl8zSDhuPznX0Odh6lyA":{"text":"what some patrons praise as a plus, turned out to be a negative for us.. obviously not loc","useful":0,"cool":0},"ugmrsqhsHgH6LKrwOZHrkg":{"text":"They had us pay $15 (without tip) for 2 coffees and 1 piece of banana bread this morning. ","useful":2,"cool":0},"wVYWO5ysHuLvc5AuJnBt7Q":{"text":"There is always a warm and comfy atmosphere when I come here. The neighborhood is always q","useful":1,"cool":1},"vI1qXHWTtKJFi8wtw05rdQ":{"text":"Good\nCoffee\nAnd the space\nTo chat, linger,\nOr type furiously away on macbooks.","useful":1,"cool":0},"YIN7TB2NqtdDBRFFDGkf3w":{"text":"This is my coffee joint for my New Orleans trip. I come here in the morning to get work do","useful":0,"cool":0},"oNzszsyofBd_m0RzzD5XBQ":{"text":"My happy place!!!!! Employees are friendly and make you feel right at home, the coffee and","useful":0,"cool":1},"ImL8i-dlRr03ujEiiQqdPg":{"text":"Delicious, freshly made coffee with expertise and southern hospitality. Joe made my coffee","useful":0,"cool":0},"L-JGY5uolxIpWag6-kcs0w":{"text":"I recommend no yo momma\"s cornbread, it has a nice balance of sweet and savory flavors...A","useful":2,"cool":2},"VjhfjCXzNYoapfU58tvkLA":{"text":"Great food, cozy atmosphere. Really \"sympa\" feel at Café Nero/WhoDat. Like eating with fri","useful":2,"cool":0},"J5e1n3dFqdmLFdFkyXfWCw":{"text":"A hidden gem in the Marigny.  If I lived in New Orleans, this would be my spot.  Not too l","useful":1,"cool":1},"L4JegC1dWl7NaSPEsM0QHA":{"text":"I love the burgers here! I come regularly and am always satisfied with the food. \nThe serv","useful":0,"cool":0},"0a3DGqGIsr0suJChfkBBkg":{"text":"Wait, you can make my café au lait with almond milk and still make it taste amazing? Well,","useful":2,"cool":2},"Nmp1kyxYcc10PLSMaEQGDw":{"text":"Turns out a high school classmate is one of the partners in this cafe.  She was out of tow","useful":2,"cool":1},"Zb-op14bB5vn6L3LchPtWA":{"text":"Really good coffee. Great brunch, too. Waited a bit long for service, but they were very a","useful":2,"cool":2},"KmBaTNdMQIK4tn8IVoftbA":{"text":"Stopped for breakfast with group of friends and it was a wonderful experience. Everyone wa","useful":0,"cool":0},"dIMA4iZxAvj7ARecME6M6Q":{"text":"What an awesome place! Full Service Coffee House and so much more! The food is fantastic! ","useful":3,"cool":2},"dUC4ErysShMXV1sDsyNMWA":{"text":"Wow! Best little cafe in New Orleans! The brunch menu is Food Network worthy it was so goo","useful":1,"cool":1},"mv-RSO44OkeWIR7GSDsXmQ":{"text":"I had the not yo mamma's corn cakes and loved it. But the other 3 people I was with didn't","useful":0,"cool":0},"chDYKR0frYjChDAk8nVxXw":{"text":"This has always been one of my favorite places in New Orleans. Who Dat Coffee Cafe is set ","useful":5,"cool":3},"CzqcPplllAYhgw4pbShURg":{"text":"Wow. Completely blown away by this Yelp find (thank goodness for Yelp!)...My family and I ","useful":1,"cool":1},"zgYBZYTAlJEqslEo9uJX1Q":{"text":"Me and my family of four had breakfast there 3days in a row and had different choices ever","useful":0,"cool":0},"5Lp_XWeaof--pngEtcTG1A":{"text":"I didn't realized Who Dat is a term that is used to refer to New Orleans's football team S","useful":7,"cool":6},"8fZQuFTpCIC69L-dVPZUvQ":{"text":"Breakfast was great! The \"da Cajun scramble\" was definitely worthwhile. Coffee was excelle","useful":1,"cool":1},"YM09h5MAii91HJFmqxeNHQ":{"text":"This place is ABSOLUTELY AMAZING! I had the \" Not yo momma corn cakes\" and my fiancee ate ","useful":1,"cool":1},"-TNXRrO_laYxYdmA_EdxsA":{"text":"Had breakfast at this awesome place during the duration of my stay in Nola. Staff are grea","useful":3,"cool":3},"8ardarn1V638MXLhetVOhA":{"text":"Great little hidden gem! My iced white mocha with soy milk was delicious and creamy. I sat","useful":0,"cool":1},"dmGmiJWsr8J0qU0duTFHZQ":{"text":"This is great for coffee and brunch! Service is incredible, we're visiting from out of tow","useful":2,"cool":2},"2T4kZWmWBhZrt27RaO1ztQ":{"text":"I've been there 3 times. I got the early bird bfast twice, 2 eggs, bacon, a biscuit and ho","useful":1,"cool":2},"1jlxDqOh3BTgmfcz-HBc7Q":{"text":"Cute coffee and breakfast spot in Marigny. The Not Yo Mama's Corncakes are amazing. It com","useful":1,"cool":1},"xmcV7tpdKkZBKdySVnAvIw":{"text":"I will visit New Orleans again just to come here for the Not Yo Mama's Corn Cakes!  OMG!!!","useful":2,"cool":2},"_Wc3N8SDf4BW64wQFBvnyQ":{"text":"Delicious coffee and I yummed the crab cake Benedict! It's cute, friendly, clean, and make","useful":0,"cool":0},"dlAYstFdgkBEn6iZluCZHA":{"text":"Hidden little secret!!  Service is outstanding. Food is delicious!!  Enjoyed the corn cake","useful":1,"cool":1},"_eyeI8pM0LU4jILHDsurTA":{"text":"I went here like a year ago, but I still constantly think of the amazing brunch I had.\n\nWe","useful":1,"cool":1},"j0eBK-imt89S9rey0WAg9w":{"text":"What a great place... the ice mocha were amazing and those chocolate chip cookies were the","useful":0,"cool":0},"vyqkh2fSl-JlnIt81Zzjhg":{"text":"This is a very cool little cafe. Good food and super friendly staff. If you are in the are","useful":0,"cool":0},"YPiCM4Jtaf174jMmAL8ueQ":{"text":"I was told that not many people know this place exists. Maybe they do and are just keeping","useful":4,"cool":3},"XaIPYr1O6NJexNUNrrcE6A":{"text":"Great coffee place with plenty of outdoor seating and a lot of space indoors (and somewhat","useful":5,"cool":4},"cYTP4JPAXFy6fTIcO-zfoA":{"text":"Wooo saaa!!! Is all I can manage to say after eating & relaxing at this quaint little piec","useful":8,"cool":7},"TRB8iLN3B_XQ40aq6isvcg":{"text":"Great food, excellent service. We tried the french toast with fresh strawberries, corn cak","useful":1,"cool":1},"a5MCNNAND4noSsqg8Bo_DQ":{"text":"What an adorable place - super friendly service, really creative drinks menu including tea","useful":0,"cool":0},"ZISqA1QgyCDHAzi7Mm97AQ":{"text":"I don't know why I don't love it. The coffee is good, the snacks and good, the people are ","useful":4,"cool":3},"QEK0ADxDo3ggnFH1hgjrYQ":{"text":"I am writing this review a long time after visiting this place, planning on a return visit","useful":1,"cool":2},"gv9epNa9xvcpR7VZaqLNMw":{"text":"Lovely place. Charming location in Marigny close to Bywater. Plenty of covered outdoor sea","useful":1,"cool":1},"uy1QrJLnZyxbs8kZpreaLA":{"text":"This cafe is amazing!  The service was awesome and the food was fantastic.  I visited with","useful":1,"cool":1},"xTynH11UpOnb6Wyve5vL7A":{"text":"Great spot, delicious food, amazing coffee and very nice staff. Every time I am in New Orl","useful":2,"cool":1},"LuRX0SKw7bu-k15S-8_ZcQ":{"text":"What can I say? A LOT! This has become my home away from home. Craig, the owner, treats ev","useful":0,"cool":2},"oFWwK5Es81kQ4XNALWAXLw":{"text":"Been here for the amazing 7am brew and super friendly faces BUT Ohhhhh man it was my first","useful":1,"cool":1},"tUpWMzq4bbMgvTMh-vMXuA":{"text":"This place is the real deal! Cute little spot with phenomenal food and outstanding staff! ","useful":2,"cool":1},"U8mzviS992chUZi08Z0dFQ":{"text":"This review is strictly for Cafe Nero.\n\nWhen I first stepped inside, I was into it. I love","useful":3,"cool":1},"XLqN4QBJc2prRQHjG8PadQ":{"text":"One of the best vegetarian quiches i have ever had.The restaurant ambience gave us the NOL","useful":0,"cool":0},"0bDjO_39JrQLi4u_tjk4aw":{"text":"Went here on the recommendation of the Airbnb owner and, wow, we were not let down!  This ","useful":1,"cool":1},"2VNbzf99Lbq8mc16wJEgIA":{"text":"We had the Bywayer Bene and the Cajun Scramble. Sat outside on a lovely day and enjoyed pe","useful":1,"cool":1},"DuDQVBbOP8eQoncdbJjZuQ":{"text":"Perfect coffee cafe! Loved everything about it from the Cafe Au Lait to the biscotti. Nice","useful":0,"cool":0},"1eT1fq6WOZIrHzqkPhhflw":{"text":"Who Dat Coffee Café serves up two of America's favorite vices:  coffee and alcohol.\n\nWe ve","useful":16,"cool":19},"-9gDVFH2fVOT9QQUxkCtug":{"text":"I stayed just up the street from here so it was really convenient for coffee/tea & snacks ","useful":2,"cool":1},"p9zn9gnaj2PcPaG-VrjPOQ":{"text":"Coffee is rich and flavorful. Lovely pastry selection. Plenty of outdoor seating. convenie","useful":0,"cool":0},"3X2nl5TNGz5RgfENjrxizg":{"text":"This is my favorite place for breakfast in my neighborhood. The staff are great and will o","useful":2,"cool":2},"rj0h_2QaPa-7v2a2OEBTLQ":{"text":"Adorable staff! Food was exceptional and the sausage gravy was wonderful! Great breakfast ","useful":1,"cool":1},"c8nSsirKI9E5K2V46hBhQg":{"text":"Great breakfast! Fresh biscuits, homemade jellies! Great atmosphere, friendly staff, we wi","useful":0,"cool":0},"nu0NiGT7dnkA4toL06atgg":{"text":"Need a whole lotta breakfast?  Who Dat definitely delivers. I'm only in Nola once a year, ","useful":2,"cool":3},"9YJG8geFISt5GNgOEYHrcQ":{"text":"Cute little place. I had the BLT and my husband had French toast. Both were yummy. Good co","useful":1,"cool":1},"YjqHpqUyNBsRunDfmx5AHA":{"text":"Just like everyone else has raved about, their corn cakes are da bomb! It's a giant plate ","useful":3,"cool":0},"PAF750eBX3Iugw-1OrBHWg":{"text":"I stumbled upon this restaurant yesterday when my first choice was closed (who closes on a","useful":4,"cool":2},"3b3ZjF0bD-bzTfQSc9u9UQ":{"text":"We came here for an early Lundi Gras brunch and missed the rush. Even with the rush the wa","useful":1,"cool":3},"YTSLck3npFAgcAFrX_nNaQ":{"text":"Our last day in New Orleans we stopped by for breakfast.   Amazing!! Corn cakes are a must","useful":0,"cool":0},"vTXvCCCe_dlNZW5WK2MI3A":{"text":"What an amazing place! Amazing customer attention, amazing food, amazing Cafe au lait (bet","useful":0,"cool":0},"NUamRP7IxJe4GhFeS_c18w":{"text":"Everything was delicious! Servers were helpful, enjoyed an omelet and corn cakes, amazing ","useful":0,"cool":0},"cFHwV-hPo96kH0QI3XmGOA":{"text":"Really, really, really good place for breakfast!  Staff was great, attentive and on point.","useful":0,"cool":0},"8E8v-YC8ufs3tN87_DLcZg":{"text":"Great service.   The food was amazing.  There is nothing but love and goodness being used ","useful":1,"cool":1},"cdAllxttsY6gIPAQySA5Ng":{"text":"The corn cakes are out of this world.  They are heavy though, so the perfect sharing dish.","useful":0,"cool":0},"temCXg-sGildRo-VB0d48w":{"text":"Always slept in and missed breakfast. Now I know where to go!!! \n\nFriendly staff, great at","useful":2,"cool":2},"YykxN49IS35NKRMUdityWw":{"text":"Their food is great  and the drinks are too! The workers are polite and they are always we","useful":0,"cool":0},"DUZIRRVsOKM4oT1JPA_6fg":{"text":"Came upon this place on way to French Quarter Fest. Didn't have time to stop at that time.","useful":0,"cool":0},"W6euI1VuboEKamcTf03l3w":{"text":"Read amazing reviews for this breakfast place and was not let down at all. Solid coffee an","useful":0,"cool":0},"YNGb4SajZdGT9oUFqI6IRQ":{"text":"This place was fantastic! Best coffee we had while on vacation in New Orleans. Love the fe","useful":0,"cool":0},"uZyzMrHJpVPVOG4YZK8ouA":{"text":"This place was awesome!  I had their specialty breakfast, the corn cakes, which were delic","useful":0,"cool":0},"PqCO8ckFajTXE377-9Vurg":{"text":"Came here on Lundi Gras. The food, service and drinks were amazing! I started with the bes","useful":0,"cool":0},"8ma-q_2pNyIBQnPQ5gEqqA":{"text":"Is 6 stars an option?!!  We got 4 different meals, and they were all FABULOUS!!  Crab cake","useful":0,"cool":1},"d51ZwsCY9sToYedwGRWsoA":{"text":"My husband and I stayed in a hotel nearby just before Christmas, and each morning we would","useful":0,"cool":0},"KCsR7lQ4zPq6j0AZSImfoQ":{"text":"The food was amazing which is why this rating is so high. The issue- the hostess and front","useful":0,"cool":0},"GEM7jzkH7IEU17wpms0oog":{"text":"I love this place!  Very friendly neighborhood gem. Great food, relaxed atmosphere, and ni","useful":0,"cool":0},"gQ_OmmGXKkeyArNGko3vvA":{"text":"Very good coffee! Had a Irish Cream latte, delicious! This is quality coffee. Also had a l","useful":0,"cool":0},"-JohClF5pSKJd99F-BOvFg":{"text":"What an amazing find!  Who Dat represents their city well, with delicious and beautiful fo","useful":0,"cool":0},"pNYI3T7b_tIOnVihKtkYGg":{"text":"Best breakfast in town! I walked in not knowing how amazing this place was. I wish I could","useful":0,"cool":1},"n8Euqf6uzy99QxVQ4QdslA":{"text":"Such an amazing meal! Huge menu with tons of coffee choices, and a full bar.  Super sweet ","useful":4,"cool":2},"eSEdeJ5bf9PFB6gPC_nEjg":{"text":"Recommended by our awesome Airbnb host, and the pace did not disappoint. I had Da St. Phil","useful":0,"cool":0},"gpBJ2qH1MNDuC6qI0wTgEg":{"text":"not infested with hipsters or gutter punks. nice guys working. wide range of customers fro","useful":2,"cool":0},"r3J4DUG8t7Hz5b6rtlaOEQ":{"text":"Fantastic service and delicious food!!!! Popped in for breakfast on our way to Nola for Ma","useful":0,"cool":0},"Yk-SpvmMAo_-M5-10KdS7Q":{"text":"Very good brunch with homemade eggs recipe and delicious chai latte. Nice outside seating.","useful":0,"cool":0},"2PgYHb1PxRKgcTt83nDsVg":{"text":"This place was great ... the server abd the atmosphere was spooooo good... off the beaten ","useful":0,"cool":0},"LJU6EXbEPU2N2dTwVxG0cA":{"text":"My gf just moved in the neighborhood. My first visit there left me with a less than favora","useful":4,"cool":0},"yeFC63nKTJ2i2G4jfrDuEg":{"text":"On our first night in NOLA, a local recommended this place for brunch, and I was so happy ","useful":0,"cool":0},"KumfJ-xm4JqemthftrIogA":{"text":"Great ambiance! The cafe was around the corner from the AirBNB we stayed in for the 4th of","useful":0,"cool":0},"qw-Pq-bgt1kp1RmJWvzyvw":{"text":"We have breakfast here often. Everything is always fresh and delicious. The staff is alway","useful":0,"cool":0},"oRdT645KBTbzCIyrWd6o6w":{"text":"Loved it when we were staying down the street at Peter and Paul.  The perfect neighborhood","useful":0,"cool":0},"_2S7d22FG9XLqMcodM6GUQ":{"text":"Who dat?! It's a friendly local cafe in Marigny. I walked over from the French Quarter on ","useful":0,"cool":1},"kwqzhNKSlmni9DfOu3YK7A":{"text":"Love coming to Who Dat Cafe. Very relaxed atmosphere. Food is always good and the customer","useful":1,"cool":1},"mp4B-k1rk3R3uemY87mQJw":{"text":"Cozy place . The food is ok . The grits were hard and cold. I had to send my food back to ","useful":0,"cool":0},"s4IXCXVLshZ_dR8ZupDcsA":{"text":"We have been to Who Dat Cafe maybe 5 times. Twice to dine in and the rest for coffee and p","useful":0,"cool":0},"_W47xv7nxzoEKgeHswTZ9Q":{"text":"Most weekends we can be found here for breakfast or lunch, or breakfast and lunch :) we lo","useful":0,"cool":0},"uSUNyELYwId67VCmW5eZGg":{"text":"The best breakfast in New Orleans. The food is great, service is awesome and the atmospher","useful":0,"cool":0},"PRkU63w0FKnz5hH3H5VZ-Q":{"text":"If you want great breakfast and awesome service, go here!\n\nWe came in before 8, coffee bar","useful":2,"cool":2},"UaF0ZJ1DGwLbSWKy93q7pQ":{"text":"My \"go to\" place for coffee, brunch and lunch. The Who Dat personality is best expressed i","useful":0,"cool":0},"0iNWFzNdKWSg6DNORpIr0g":{"text":"Service was pretty slow, but I think they had some staffing issues. Food was phenomenal! W","useful":0,"cool":0},"ZRU1qTyaK7byMML3-qmwDg":{"text":"I just moved in the area .. and I visited total of 4 times yesterday for breakfast it was ","useful":1,"cool":0},"p8dyrtt3p1P4n_1Ptar7eg":{"text":"We have breakfast here often. Everything is always fresh and delicious. The staff is alway","useful":0,"cool":0},"ePPDbrqSBlVorUbTGUETuQ":{"text":"Super great breakfast, probably one of the best omelette I've had. I loved that it had thi","useful":0,"cool":0},"GoagCm6mPBi01l9JjbFt1w":{"text":"In NOLA, I have to pace myself.  WDCC was a cruel experience in restraint. The baked goods","useful":0,"cool":0},"REA71OsAaahY4oq1WmJVqw":{"text":"This place is great! Totally accommodated our obnoxious group! The epitome of neighborhood","useful":0,"cool":1},"R4JP5AovRN8F_5mV51QhWQ":{"text":"We were taking a short cut thru the  neighborhood and came across this delightful cafe. We","useful":0,"cool":0},"AU7zwL63ksb0WXd5hInYWw":{"text":"Great food and friendly staff.  Laid back cafe with better than expected food! Sandwich ca","useful":0,"cool":1},"SJZkAP0MMb9L79Wofe04Uw":{"text":"Good food, but the service was terrible.  Even with three or four people on the floor, the","useful":2,"cool":2},"Zmk6WeVzhCUW-2xRSIwndw":{"text":"Awesome place! My husband had the corn cakes and I had the catfish bene, both were so deli","useful":0,"cool":0},"qK14yHReIzeR5AZi93qRmA":{"text":"I was on a vacation in New Orleans with 9 friends we stopped into Who Dat on a Friday duri","useful":0,"cool":0},"60WUGa0vzPE6XziLahMGBw":{"text":"This restaurant is a hidden gem.  I do not think that this place gets the recognition that","useful":0,"cool":0},"f67uIFACIkNnwBg0xHgK7Q":{"text":"What an amazing find!  We just had some of the most amazing food and the service was perfe","useful":0,"cool":0},"flB7UA0c4b7GQQruDHC9Hw":{"text":"I love this restaurant. The food is excellent and the almond milk lattes get me going ever","useful":0,"cool":0},"tH7T29CU649c7ndOSVn17w":{"text":"Flavor explosion!  Mandeville omelette is excellent.  Full of fresh ingredients.  Cappucci","useful":2,"cool":1},"lk2WjUZaGvj0HIL4-eCjpg":{"text":"The best part is the friendly service and at home feel.  I don't feel rushed to leave and ","useful":2,"cool":2},"O-D8uyeMVWxujaM42vej1g":{"text":"Came in early on a Sunday (early on a Sunday?!) and we were greeted by the owner with enth","useful":0,"cool":0},"jsor0ZT-dR3YW4ULTIiGlA":{"text":"I am in LOVE with the \"Not Your Mamas Corn Cakes\" dish! It's AMAZING! The flavors are heav","useful":0,"cool":0},"u5HRqJ1sRaQnIyx1hSwdhQ":{"text":"During a short stay in New Orleans, I booked a couple of nights at an apartment down the s","useful":2,"cool":0},"8yvldpC0daYt4y9aDsF03w":{"text":"This is my go to spot. I probably come here once a week and never have any issues. Good fo","useful":0,"cool":0},"eak-dyKOuu6re4tDFOJ-FA":{"text":"Literally the best tasting coffee I've had in the city. So far I have tried Sacred Grinds,","useful":1,"cool":1},"CaN7f36hcVTNWe-Ex-8sfg":{"text":"Stumbled upon this little coffee shop because I ended up leaving for work too early... but","useful":2,"cool":0},"geJoRjiOSX3VxgYjkO7tKw":{"text":"I think this is my favorite brunch place that I've tried out in New Orleans. It was locate","useful":2,"cool":3},"cdufITMm8V_njdQkSc8B1Q":{"text":"Awesome people working here, indoor and outdoor seating, laid back, good music. The standa","useful":0,"cool":0},"g7Di_9chEPi-GE3VZVqODA":{"text":"First coffee stop in New Orleans and this place is amazing and friendly! Fresh coffee and ","useful":2,"cool":1},"m00_qU7DPu_B6bMdsP35NQ":{"text":"If you come to New Orleans and don't eat here, you've made a huge mistake. The food is fan","useful":2,"cool":1},"9Jvxt_S7Ze_GkxlavORbNw":{"text":"This place may change your life..... If you get their crazy corn cakes that is. Oh em gee ","useful":3,"cool":3},"Lo3zUgmF6aAo4Jb9ME7OOg":{"text":"Amazing coffee, great food and great service. We were in New Orleans for a bachelor party ","useful":1,"cool":1},"3wAo6guuNwIsie7LdbBX2g":{"text":"The food was delicious and service was good. It was very busy, but the wait wasn't too bad","useful":0,"cool":0},"LpZPpuqbGoOrTxxtzT0bdQ":{"text":"I walked here after brunch (from the ruby slipper) to get my authentic NOLA caffeine fix. ","useful":0,"cool":0},"mBaCjT6r9rcu8e_lFBPeVQ":{"text":"I'm glad this place serves brunch, because there's never a wait on the weekend and therefo","useful":0,"cool":0},"aR_Yhry2VA3VA5wHLGig7A":{"text":"Nice people, cute space, yummy corn cakes! Also liked their ginger lemon tea. And they wer","useful":0,"cool":0},"BOA_vXnvhQp0TVihghtu7w":{"text":"Stumbled on this coffee shop as part of our walk through Maringy.  Super fun atmosphere an","useful":0,"cool":0},"KrL0dxkjRTM0u7bss1wRcQ":{"text":"Great breakfast and coffee spot! The neighborhood is great, the service was excellent, and","useful":0,"cool":0},"ZNwsFQYU6B95Aaklk4M0Xw":{"text":"One of the best coffee shops in the Marigny featuring a wide range of sweet treat cookies ","useful":6,"cool":6},"Fsv4d9tuvELBvK9wSjjCWA":{"text":"My favorite brunch & breakfast spot! Such wonderful food & friendly employees. My husband ","useful":0,"cool":0},"PzcC6ybwDywAOVVJMiSxYw":{"text":"I am not sure how I forgot to give a review when I was there in January 2016 but that was ","useful":0,"cool":0},"WtTh__YiHeE3Nkj1_upJnQ":{"text":"Fantastic food, but you really need to come with that casual no-hurry attitude as the serv","useful":0,"cool":0},"0OFpRHjMUYqqsstEKeow6g":{"text":"This is a friendly little coffee shop in the neighborhood that I would highly recommend fo","useful":1,"cool":0},"FNZrgvrrm-HzzUYMbo4-uw":{"text":"Best food in NOLA. Great food and better people. Its a must go","useful":0,"cool":0},"QO1WcXXCJyWL1N7XI233PA":{"text":"Loved this quaint, neighborhood coffee shop! Delish! Quiet atmosphere and a good chance to","useful":0,"cool":0},"L3nUpFrDAlFaxW0OmWxtYQ":{"text":"I wish they had table service to ale your order- waiting In line to order is kind of a bum","useful":0,"cool":0},"83aqFTjRAfMIeCEkF_8snQ":{"text":"Really good breakfast.  We didn't get to try the quiche bc it was sold out. According to o","useful":1,"cool":0},"yvfWv7r2nk8tVXOkhb2OVg":{"text":"Their food is the truth! True creole flavor! It's a great hidden gem. It's a small, quiet ","useful":0,"cool":0},"KqyTmotMgjIodAMIDqDeIA":{"text":"The absolute best coffee spot in New Orleans. HANDS DOWN! Staff is extremely friendly and ","useful":1,"cool":2},"qZ0iF1f31AjRZxG2gjcbdQ":{"text":"Great local spot! Cafe au laitwith Chicory coffee is a must in New Orleans! Try the Catfis","useful":0,"cool":0},"kLVZ-LhjrKV-ixju33DEEA":{"text":"Came to NOLA for spring break and wanted to explore... but something kept bringing me back","useful":1,"cool":2},"9oPz1u5ncETc_NLSEVmkAQ":{"text":"BLUF:  Big fan of this place for all possible reasons.  Exciting menu with great standard ","useful":2,"cool":0},"YVAdUIA8lDxOSQy-KIvLaA":{"text":"Just happened to find this quant little cafe on our venture on the streets of Marigny! I h","useful":0,"cool":0},"qo29MFsjJaMcJ1e6bm5VNA":{"text":"For something quick & light check out the delicious pastries & coffee! And for lunch, Cafe","useful":1,"cool":1},"3yAgotjElH_zQ1YMotQgTw":{"text":"GREAT bloody mary and I loved the different fresh jams they have. I got bacon and eggs and","useful":0,"cool":0},"dQlRUS6193sE1u-6wF8-mg":{"text":"Had breakfast and the food was good and the coffee was excellent. Service is outstanding. ","useful":0,"cool":0},"KUQHPX2KlrY_NF9kV1wlIQ":{"text":"Came to this spot looking for some breakfast since I had seen a video of the \"not your mam","useful":1,"cool":0},"UBz51CdQ1QG9A3MN68CiNA":{"text":"For a restaurant that serves breakfast, to tell me that I cannot get \"real\" eggs scrambled","useful":2,"cool":0},"42blc278Ymx6L5kSW6pH1g":{"text":"The food, the staff the everything was amazing.\n\nI don't think anyone had a crumb left on ","useful":0,"cool":0},"NNmf_94_fwcijSN3jCCSBw":{"text":"Who dat's staff raised my kids. \nWe've been patrons of theirs \nFor 10 plus years. \nThey ta","useful":0,"cool":0},"fhmnZUo-05m8gp83L1fVWQ":{"text":"This place is a wonderful\nPart of the Marigny neighborhood and we Stand and Applaud Craig ","useful":0,"cool":0},"mmy-lQE_ppZAajrras8UDQ":{"text":"This is a boutique breakfest diner in the Marigny.\n\nProduct: Breakfast foods. The selectio","useful":9,"cool":5},"iaZvNIJEHfidVYqOnlfJRA":{"text":"This is an adorable coffee shop with a comfortable atmosphere and good service.  I got a c","useful":2,"cool":1},"H3ux2KSb2WBHs9pktOU2pg":{"text":"The last few times we had breakfast at Who Dat we had to sit downstairs next to the counte","useful":0,"cool":1},"Xn2eQfeYaVdLUGjFKW0srg":{"text":"Went here to celebrate best friend bday.  What a tray. Table ate not just in restaurant bu","useful":1,"cool":0},"3BLBk3sTivfL8lyyLPakGg":{"text":"I used to work down the street from Who Dat and came here every day (often twice a day) fo","useful":1,"cool":1},"4eOCSe3QxbNbsBJEql8Qrw":{"text":"Food was amazing   $5 mimosas or bloody Mary's. Mimosas were mainly champagne so that was ","useful":0,"cool":0},"6bGn6TBl-ulgG1jA8UO4tA":{"text":"The big chain coffee shops have their place. But cool local coffee shops like Who Dat Cafe","useful":1,"cool":0},"W4WZ4GCl_I0axCdRFWl8rw":{"text":"My gf and I had breakfast here while we were in town visiting friends. The food was great ","useful":2,"cool":2},"5NJge-xJE0dSbrzrqjutyQ":{"text":"Amazing food great customer service . Food was absolutely one of the best breakfast food I","useful":0,"cool":0},"7uiuLaGaalG7_kTjV9J0Rw":{"text":"Amazing. Seriously, just come here. The food was excellent and the people very friendly. \n","useful":0,"cool":0},"P270fAywV6xlgB0R8fBWoQ":{"text":"Really solid neighborhood option.  We did not partake in the food onsite, but popped in fo","useful":1,"cool":0},"Q7HO_qLVLOVxoMpTsaWAFg":{"text":"Legit coffee, friendly staff/management and good God the good is amazing! Our server, Bill","useful":0,"cool":0},"qzeVHFT7rwKxWI922XXBkA":{"text":"The food was pretty good. I got the Cajun scramble. It was eggs, peppers, onions, sausage,","useful":2,"cool":1},"4V2VceDNNE36NkqLyTKHgw":{"text":"Great local neighborhood coffee shop. Had an Irish coffee and mimosa and the most deliciou","useful":1,"cool":0},"FZ30_n_lM1D1oqBOxCQqJg":{"text":"This is an amazing place. Friendly service and exceptional food. Thank you for standing fi","useful":2,"cool":0},"DdQD9uAmnwN4Oe1r4UaWHA":{"text":"Best coffee house in NOLA. Went there on Super Bowl Sunday when da Saints were supposed to","useful":0,"cool":0},"mFU9i59nz13Ju4jCk7P3xQ":{"text":"Great spot and place to escape the Quarter madness. Food is excellent and folks were too!!","useful":0,"cool":0},"8qD0HQLHRkhGlzrGDwDW2g":{"text":"What a yummy spot for a Sunday brunch! This was just a few blocks from where we were stayi","useful":0,"cool":1},"ShUs1eUJFRnKZrS5xhyaJQ":{"text":"Friendly, fresh, charming, and corn cakes yum!!!!l Good $5 bloody marys, choices for every","useful":0,"cool":0},"tuUZNzr8eXZ4irUoMdXARQ":{"text":"Green Tea Latte with Almond Milk. This is my third time asking for a latte at this place a","useful":1,"cool":0},"8xlfBbIQo76To-03Yp6k4A":{"text":"Had the crab cake and egg dish.  It was delicious.   5 stars.   Sit inside if you can.  Th","useful":0,"cool":0},"BYBeLV-LqZxbvILFVt4jcQ":{"text":"Such a cool coffee shop. I really love the location. It's such a nice time in the year to ","useful":2,"cool":1},"YmzNRH665hhwu-plux4eWw":{"text":"Love this place! The service is always great, the food is delicious and they are doing it ","useful":0,"cool":0},"PJiWIoorptnLHd4JG4mwmQ":{"text":"CAFE NERO upstairs is an excellent restaurant with gourmet sandwiches;\nNOT YO MAMA'S CORNB","useful":6,"cool":3},"gI2tw0gjXfMRI0awS_pIow":{"text":"The food is extremely overpriced, the owner seems to have issues with locals, he's unpleas","useful":1,"cool":0},"Gt0ha9QoueMI6XEBhxbHRg":{"text":"Yum  The Boozy coffee drinks are where it's at and the staff is super awesome & friendly","useful":0,"cool":0},"2PsKCsdys-xTK_58wuLk4A":{"text":"We came here for breakfast and it was amazing! Great vibe, staff was super friendly, perfe","useful":0,"cool":0},"fC9BJhCGONkSGzyeOLEHtQ":{"text":"Amazing hole in the wall place! Great people and great environment. They went out of their","useful":0,"cool":0},"jkM0s642NvLA4lNOFTnM7w":{"text":"Wowzer!  What a treat. This is a must for a foodie to visit. Cafe au Lait with chicory was","useful":0,"cool":0},"53tF9fk98pr-ve_DLugb7w":{"text":"The service was amazing and the food was seconded to none! I will definitely return to the","useful":0,"cool":0},"P8_C9FnMSd0Jzem6-F6fSQ":{"text":"Love this place. The two guys working today were so nice and the coffee was amazing, my om","useful":0,"cool":0},"_MRxNGM9OIj-z3qZ9RVmlw":{"text":"This restaurant is so cute, the food is delicious, and the service is even better! Everyth","useful":1,"cool":0},"gHM915Rp8e4x203PwxS08A":{"text":"We got in early checked in our bags at the hotel but couldn't get the room yet. So we deci","useful":0,"cool":0},"XKgoTNL0VkdyFMaAXxQGig":{"text":"The staff is very friendly and helpful. Country fried steak is yummy! Grits are great cons","useful":0,"cool":0},"TgkJNy8B93eyy9aPbK3nHQ":{"text":"I love this place!  The service is friendly and quick.  The food is really really good (es","useful":0,"cool":0},"i7kWBGN1XlMllAYwr9JVLQ":{"text":"Always friendly and inviting atmosphere with delicious coffee, treats and food. I love thi","useful":1,"cool":1},"caMyUQb6t80TSAZJB6MIRw":{"text":"They pull shots for real, here! Pretty impressive. I daresay the only place in New Orleans","useful":18,"cool":9},"2ltT7GFR2yWlhRtTXY0THw":{"text":"My favorite place for breakfast in NOLA. Amazing staff and the food is to die for. Try the","useful":0,"cool":0},"UqTFtrf3020_NIseiItZNA":{"text":"During my visit to New Orleans for VooDoo Music Festival, I had a chance to check out Who ","useful":21,"cool":12},"zR-SoA9uQ2GcTxcLmwt9tQ":{"text":"I have been waiting for two months to come back here and I was not disappointed.  Breakfas","useful":0,"cool":0},"pIdqN353ELJqdl-_naZ4pQ":{"text":"Best brunch we've had in awhile. Cozy, gorgeous interior; colorful, eclectic place overall","useful":0,"cool":0},"AjVE31o9rlg3vlJDCs5nuA":{"text":"My favorite place in the neighborhood. Kind to locals and visitors alike. This is why I se","useful":0,"cool":0},"WcDVIoe0BW9ydRUaLBG5_A":{"text":"I have been waiting for two months to come back here and I was not disappointed.  Breakfas","useful":0,"cool":0},"SQ0YPU5wqJ9v0X1xnYkuhw":{"text":"YES PLEASE!! These guys did an awesome job setting up outside, (an actual 6 ft apart setup","useful":0,"cool":0},"Mr9pI0jL4BX2lQXHeg7SLw":{"text":"Twice as good as Ruby Slipper without the noise and the wait.  Hubs had the Cajun Scramble","useful":1,"cool":1},"Sqz7kNgaJvyiyMb_cs93vQ":{"text":"I used to like this place a lot then I encountered one of the owners.\nWe were in the lower","useful":1,"cool":0},"4zCKwmlLvAFpUY32Cn4Puw":{"text":"I stopped by for a quick latte - service was wonderful - the cups are biodegradable and I ","useful":0,"cool":0},"60YeORiGBqtWpXg5Cf5mHA":{"text":"Not Yo Mamas Corn Cakes. That's it. That's the whole review. The beginning, middle, and en","useful":0,"cool":0},"XOfl72Ja6KPA2XJv54BU8g":{"text":"I enjoyed the breakfast here. We were unable the sample the quiche as they had run out by ","useful":1,"cool":1},"fHG9sjXCYxaNvZ4m6hwNMg":{"text":"Absolutely delicious food, really good coffee, attentive service and a chill neighborhood ","useful":1,"cool":1},"_xogjfHAuBW-n0ra4h035g":{"text":"I'm waiting till I have more battery life to write a full review because 11% battery life ","useful":2,"cool":0},"AK3KQOXhHLRDpfHpulUzlg":{"text":"I was so happy with the food!! Taste was great.  Homemade jelly was delicious.  Dont let t","useful":0,"cool":0},"AhDlkAdHa9oBNI58duvy1A":{"text":"I've had breakfast here 3 times and each time is better than the last.. Try the White Almo","useful":0,"cool":0},"Iap7CnTacISZ_CtxZx5KrA":{"text":"Amazing staff and food!  Beyond happy that they are nailing safety with their COVID protoc","useful":0,"cool":0},"XSp0A2btn6WYgTqtHjP0Dw":{"text":"Amazing food! I got the blueberry muffin and a side of bacon. My boyfriend got the country","useful":0,"cool":0},"YI9eJMid4oQRVplPO7K61w":{"text":"They require proof of vaccination to dine inside. I support this. The food was delicious. ","useful":1,"cool":1},"hOZ1jS-7UtjJbiwvxws_FQ":{"text":"You've got to get the corn cakes!!!  Staff is amazing and dog friendly too if you get a ta","useful":1,"cool":0},"-EiEHAQe3QwQ7FAJlAg73A":{"text":"Fantastic food, friendly service and always a table available on the sidewalk outside, eve","useful":0,"cool":0},"SIM3bHsgVwzOCMsPvITlSQ":{"text":"This place is awesome. Hands down the best coffee. Da Mandeville Omelette is very tasty. I","useful":0,"cool":0},"M2bB3Nwp0A4dskx7YmD7Xw":{"text":"This is a great place for breakfast!  The staff is very good and very friendly.  The atmos","useful":0,"cool":0},"0SLRGcG7siH7nnqfhINydw":{"text":"My wife and I just spent four days staying in this lovely neighborhood and  the people at ","useful":0,"cool":0},"cqy1VDR68NWXmG4yGrpRhA":{"text":"Was visiting from out of town and that food and hospitality were AMAZING! Excellent portio","useful":0,"cool":0},"YtuDq5eGbqR3_u_ERnd6ew":{"text":"This place was a hidden Jem until the first time I visited then started telling everybody ","useful":1,"cool":1},"9agOMSi_Sav7sUPNsXXJEA":{"text":"Cute and quaint tucked into a cute neighborhood, literally in a house, with great service ","useful":0,"cool":0},"JWsJFDZRNPQ0Q7xZsZvdzA":{"text":"best breakfast we had in NOLA! i had the cajun scramble which was fantastic, but my sister","useful":0,"cool":0},"hqxKZPkHwmyqDtYLIZh34w":{"text":"This place is fantastic!\nWe had 8 different entrees between us and everyone raved about ea","useful":0,"cool":0},"hB0H-3LXVIF-_gOTgdvpnw":{"text":"I am a New Orleans native and have dined here on several occasions. I went last week with ","useful":1,"cool":0},"t-gb_2tRAyNeUgP2BiuVgQ":{"text":"We were staying at an Air BnB down the street and stopped here twice for coffee and breakf","useful":0,"cool":0},"V81iixIGWZjO2KCiapFoBg":{"text":"We've been twice since they reopened a few weeks ago.   \n\nIt is one of the few restaurants","useful":1,"cool":1},"HDc_8b9o_rKwAkESgGKBKg":{"text":"If you want a local neighborhood breakfast spot you can count on or you are visiting New O","useful":0,"cool":0},"XEeBW6lgDkrjSPrncdQmug":{"text":"Only gave this place a 4 Stars bc I missed there kitchen being  open Lol ...the wait was a","useful":1,"cool":1},"p30jl21f-EapULRzRBel_A":{"text":"This was my first time in Nola and this was literally the best breakfast. They're corn cak","useful":0,"cool":1},"Zj4f0wNU0cLAJGEo7ktPvg":{"text":"My family and I went here for brunch and when I sat everyone loved their food. Myself and ","useful":0,"cool":0},"o6d8l7zwQ0MKpNsP6LJLHg":{"text":"Cute place with good food. It was a nice local experience. Pet friendly if you sit outside","useful":0,"cool":0},"nM4X4-b51OefiVAfC_0OUA":{"text":"The greeting was everything they were really polite. All I know is the waiter tried to sit","useful":0,"cool":0},"20G9D8SccMd3fs8M4bHYwg":{"text":"Customer experience was the worst I have ever encountered. Would never patronize this busi","useful":2,"cool":0},"NSLEIa3OVosi21NCPNDh4g":{"text":"Went to Who Dat Coffee Cafe today and had a Chicken Fried Steak sandwich on a cheddar jala","useful":0,"cool":0},"wohr1BUtcx50lKLOSWRhUg":{"text":"Big ups to all my ladies! Two dope women with dope fashion greeted us at the counter.\n\nDon","useful":2,"cool":2},"yTiTc9Dbx19GC4XlAsa7Ng":{"text":"Delicious Bloody Mary, lovely outside dining, tasty food. More off the beaten path. I got ","useful":0,"cool":0},"EB1nQk0BPnUSFgIeC4Ecjw":{"text":"LATE POST! I had an opportunity to try out Who Dat Coffee Cafe not to long ago and it was ","useful":1,"cool":0},"zu_9FSbKwtVws7ae_pC6hg":{"text":"We ate here before heading out of town and we were so glad we did. I had Da St. Phillip wh","useful":0,"cool":0},"do7v-JpUURtqssnMhqbp9A":{"text":"Nothing to complain about here! The inside is pretty cool with a lot of unique finds and a","useful":3,"cool":2},"pZCjK54bfblYP8EV72VKxw":{"text":"Best brunch ever. Hands down. Best cappuccino. Best lunch specials. Best people. Best ever","useful":1,"cool":0},"E0puwDaeF-SkhCM-BAdzQA":{"text":"Upon entering the location, we were asked if w would like to sit outside as the location w","useful":1,"cool":0},"h0CtNdC5XV-cnfwi0cSrHA":{"text":"I have loved Who Dat since they opened. They are always welcoming and warm to me, any frie","useful":0,"cool":0},"SPlP_ZUfy5V07TnIaw_0nA":{"text":"Great food, great people, great service. This place is right around the corner from our ho","useful":0,"cool":0},"PUJ6RzbX24-B_22nUfnRxw":{"text":"Yesterday was our first time going to Who Dat Coffee Cafe. It is a cute place inside and o","useful":0,"cool":0},"UYUtiw2M-J83zVLVIiWAtg":{"text":"This place was recommend by my daughter and niece!! Freaking Amazing!! The staff was amazi","useful":0,"cool":0},"zsT0zR1VO1yHW07JsKLy6g":{"text":"So slow, we left.  No one greeted us; our table had still not been cleaned when we left - ","useful":1,"cool":0},"Oe3ooFp_pF6OdVXcFnu78g":{"text":"Very curt and short attitudes from the staff. Walked away before getting food or coffee.\n\n","useful":1,"cool":0},"bH0IhiPXX1cSpb2NrWhQIQ":{"text":"Yeah haven't been in about a year...came back for my corn cakes and service just felt very","useful":0,"cool":0},"QwxvIodLVQDpoSDnVxfDWg":{"text":"Great food and service. Though I live close by I hadn't been here til recently. Glad I fin","useful":2,"cool":1},"O7KMH2xSUmoVdkBbHRb5qg":{"text":"the who dat cafe is the best coffee shop in the city! hands down! they're doing sooo much ","useful":0,"cool":0},"oBRsimgAVZ3GVFM2lf2xpw":{"text":"I wanted to  fall in love with Who Dat Coffee since I had  heardd such great things. It wa","useful":2,"cool":0},"DMmgmBntdd7jZedgswRupw":{"text":"The breakfast was fine, it's hard to mess up pancakes and bacon, my sister (who is also in","useful":0,"cool":0},"gGbP9YqYHifS6BqqDGA3qQ":{"text":"So maybe I built this up too much in my mind and after three years of thinking about not y","useful":0,"cool":0},"yYcgBkMIfLcEs0FCnaHOkA":{"text":"Excellent service, food and drinks! Great pour on the mimosas. The crawfish pie is a must!","useful":0,"cool":0},"t0PqiBKUTU9PFIovhiWWSA":{"text":"To be honest, I was pissed we didn't find this place until our last day.  This place was a","useful":1,"cool":0},"G03N8wc31OXKtqHDjLbE6g":{"text":"This Cafe is a cute little place which was super close to our Airbnb. We stopped in for br","useful":2,"cool":2},"ZU6I-qGxGWNLx7kinUB54Q":{"text":"Had breakfast and as always it was very good.  Waiter and staff were very helpful and acco","useful":0,"cool":0},"6VbeMuPt60wxxnJxNgqQxw":{"text":"This is my go to breakfast.  The staff is always pleasant, and they take Covid seriously. ","useful":0,"cool":0},"NELjUyeyG1yMhFojnJdGvg":{"text":"Clean, quaint, eclectic cafe with friendly staff and most importantly AMAZING food! My hus","useful":0,"cool":0},"5kZdOt2BFNBPTKtHI4WgmA":{"text":"Super friendly staff, awesome service!\n I had the cheddar soup to start off \nLater I order","useful":1,"cool":1},"5-LA9I_dFFZOPrV59XZggA":{"text":"Guy at the door was very rude and refused to let us sit down even though we had proof of t","useful":0,"cool":0},"k0kyuXlFs7ku7Rb_W4bwoA":{"text":"During our 5 day stay in NOLA, we visited Who Dat coffee 4 times. Everything from the amaz","useful":1,"cool":0},"mg901aJOdrJN8nXHXGVqGQ":{"text":"I love Who Dat, and am so glad that their summer hiatus didn't become a permanent closure ","useful":0,"cool":0},"7WrCaKS8jLH1NZii4Y_7MQ":{"text":"Very cute coffee shop, with SUPER AWESOME owners/staff. They had boozy coffee I should hav","useful":0,"cool":1},"48Ho1LNPfkEINuege60v2A":{"text":"I use to love this place but I feel that everyone is using the pandemic as an excuse to no","useful":3,"cool":0},"6GeGdrEsir5YTvdzQkfXUg":{"text":"Open on Mardi Gras! The service was great despite the mayhem of the hoards of costumes. My","useful":0,"cool":0},"r9W6HFUqvQBxz142vIoPbA":{"text":"Our go-to spot for brunch, I always recommend the corn cakes.  Sometimes I wake up just th","useful":0,"cool":0},"3c9pmcwTW8WnA5p7kULWwA":{"text":"I would have never thought to come here, but found it online and thought to try it out.  Y","useful":1,"cool":0},"nxr602rbCEPXVdG5Th-89g":{"text":"I cannot say enough good things about The Who Dat.  The food is AMAZING.  I'm partial to t","useful":0,"cool":0},"mOSzjxN7xle_bZs1tcD44Q":{"text":"I wanted to support local during Quarantine and ordered \"Da Crab Stack\" and a small carame","useful":1,"cool":1},"WtVRwUqy0NP36ED24QotSg":{"text":"Great place for a quick coffee, grab and go breakfast or a sit-down meal. The seating arra","useful":1,"cool":0},"uPAceVwZuojrlTKmJb2rdQ":{"text":"Post workout, this gal was HUNGRY --- thus delivered to just the place to satisfy my carb ","useful":5,"cool":5},"Fa6p9lhCYUZ6USu9A3u_7Q":{"text":"REAL (fresh n scratch) & D-LISH early mornings (b4 1000h), special brekkys 《 a tenner.\nTop","useful":1,"cool":1},"IO_r4ZrJAYmCFryXcmaT0w":{"text":"While I'm Who Dat Nation, I had to try @who_dat_coffee_cafe. \n\nThe spot was about a 30 min","useful":0,"cool":0},"DI9iASOhD-cTOr7Iyo4-Ng":{"text":"Living 25 miles from New Orleans \"Who Dat Coffee Café\" is normally our first stop for brea","useful":0,"cool":0},"UJJFqEWpyiS2XZJGsGp6kg":{"text":"The food is soooo delicious. The staff is friendly. Stayed at an air bnb close by and came","useful":0,"cool":0},"2ybAiYsMGK_G5gYdTVaqdg":{"text":"I love their americanos!!!  It's the only hot drink I've had.  It tastes the same no matte","useful":1,"cool":0},"Wq5R7RUPjAeycCiQ1QwY1Q":{"text":"Loved this trendy cafe in the Marigny! Everything on the menu sounds amazing but do yourse","useful":4,"cool":2},"fVJd0yayYFSuBQmybC4Blw":{"text":"Their food was lowkey trash. And they made us sit outside during the pouring rain when the","useful":0,"cool":0},"S3zp5PU0391xz_3CGfIJbQ":{"text":"My husband and I have been going to Who Dat Cafe for years. While most of their menu isn't","useful":2,"cool":1},"-iEZmwA2vi-zAkcgwwa71w":{"text":"The best food by far, the staff unbelievably attentive and friendly, the entire restaurant","useful":0,"cool":0},"-YwManUEw5as7C96ej-CfQ":{"text":"Only place in the area on July 4th, and I was very happy to find it.  Didn't have time to ","useful":1,"cool":1},"4kJ2wCWqehKRuTxS5khqFA":{"text":"Morning coffee, check. Friendly staff, check. Great food, check. I love this neighborhood ","useful":0,"cool":0},"up81-5fLl4MhHenV3ejV4Q":{"text":"Craig just expanded the kitchen and is now serving dinner Thursday - Sunday.  The fried ca","useful":3,"cool":2},"yi4cfVxrdqOczALdYKDLJQ":{"text":"Post ida and during covid visit update :\n\nI love the way these guys do breakfast and was c","useful":1,"cool":0},"tGyRNkJtc5HSch1SKFPZzQ":{"text":"Loved this place on our week's stay in the neighborhood; became temporary regulars. It bea","useful":1,"cool":0},"E0wgXRtP0lamS8SODWnfnA":{"text":"- They're open 'til 10pm, but their kitchen is open 'til 3pm! \n- Free street parking nearb","useful":24,"cool":20},"HC5frBv1Lvft9i6zeRGCQg":{"text":"Great little spot a friend told me to try out. Hands down the best quiche I have EVER eate","useful":0,"cool":1},"WjPzcaGgzsxlbXD6fUge_g":{"text":"This place is amazing! Everything about it. The staff is super nice, the place looks beaut","useful":1,"cool":1},"L0XETJP-SkWQT63d5DHiTQ":{"text":"Very cute coffee shop with plenty of indoor and outdoor seating under a patio. Service was","useful":1,"cool":1},"3qgSkrNmR1cr-iOmvW5pVw":{"text":"Great good, fun atmosphere, and lovely outdoor seating right in the heart of the Marigny.","useful":0,"cool":1},"1_0LieE7aLtue-eY7Bz5hQ":{"text":"There are several coffee shops within walking distance of me and this one is the best. The","useful":3,"cool":1},"N1eQYtJFHzEtI9k7WNywgQ":{"text":"A strong 4 stars for this tasty breakfast spot.\n\nWe pedaled over for a nice breakfast and ","useful":3,"cool":1},"zv_rW0kg3VywrxNNGb7MSg":{"text":"I was planning a trip to New Orleans and found this spot on Yelp that was close to where I","useful":1,"cool":1},"qQQIAIVNTFXH4hUvTaMqdw":{"text":"These guys always brighten up my morning. Every server and barista here has the best darn ","useful":0,"cool":0}}