{"0c3m-Sa2_ygtA743K1xI5Q":{"text":"I really don't bother with negative reviews, but this time an exception has to be made.\n\nI","useful":15,"cool":0},"bJtcxCLVUvtDP6QgsabqNw":{"text":"I. Love. This. Place.\n\nIt's rather hit-or-miss, but I have picked up some lovely things he","useful":3,"cool":1},"EZJoTOIpsxYRL2hw4ejiCQ":{"text":"Everything here is quite overpriced, disorganized and generally crappy. The people who wor","useful":5,"cool":0},"4cSftQ494gKm-KBIbpPzPw":{"text":"Eh. They seemed to have a lot of cool stuff if you're willing to sort through the junk. Wh","useful":4,"cool":0},"_9VZoSWON31FBijAqjJpNw":{"text":"They should change the name from \"Antique Mall\" to \"Junk Store\".  I've always enjoyed look","useful":4,"cool":1},"5IYHEYANoLOwqQ1dhcavwQ":{"text":"My friend and I were advised by the clerk that we would need to leave our hand bags in a l","useful":4,"cool":0},"I0wGzypXEcDdJsENqqZYzg":{"text":"This place is a bit low down on the rungs of antique shops on Magazine Ave. They were quie","useful":1,"cool":1},"t-mN31GPIRqQQoOzCJJwSg":{"text":"Looking for a treasure? Or a questionable collectible? Or maybe an Infant of Prague statue","useful":4,"cool":1},"J3SMk2UzCSHqf1_C9natag":{"text":"Not a flea market or well organized yard sale. It's an antique mall with various vendors s","useful":0,"cool":0},"cNMCPtqlTuMKWxDRp1DM0Q":{"text":"Love this place.  Everyone is helpful and welcoming. Always find treasures at great prices","useful":0,"cool":0},"I1Bce7HD-CYtnlAraCbm8w":{"text":"Like most places of a similar ilk...\n\nThis is more of a museum of bric-a-brac than a place","useful":0,"cool":0},"s3Qhtv3DT8XjByOk23xN7A":{"text":"Ha! Christy L beat me on this review.  \n\nI take my Mom to shop here at least once a year, ","useful":0,"cool":0},"nFDPZvIXsbZ9grvvCVUskg":{"text":"This place is awesome! I personally had no issue handing over my bag (to put in a locker t","useful":3,"cool":0},"n7vJldnogL9cIGVw6lB_4w":{"text":"There are definitely items in here that are overpriced. However, hidden among these items ","useful":0,"cool":1},"P4GssK60l8zeTb8qk-SfXQ":{"text":"I bought a beautiful crystal and steels my silver rosary here. Very nice and helpful staff","useful":0,"cool":0},"Zbeep31iquHTSh7sqmshzw":{"text":"As others have mentioned the staff is curt and to the point about taking your oversized pu","useful":1,"cool":0},"bKwd7IG8nS6HCT7gNAU1SQ":{"text":"Sincerely I don't understand the bad reviews. Yes, you have to check your bag at the door ","useful":1,"cool":0},"SuQuUwqFdMz8BHx2F--pMw":{"text":"Lovely customer service.  Lots of antiques, maps, records, etc.  Thanks for the Lagniappe!","useful":0,"cool":0},"8VuDYO_XR6BN8DLu4VrqLQ":{"text":"For someone that are interested in browsing and looking for \"treasures\", Magazine Antique ","useful":2,"cool":1},"GpSmc-GX1QoxxlEEdeSsgw":{"text":"RUDE.\n all the people that work here are rude.\nnot a pleasant experience.","useful":9,"cool":0},"n7G6W9voFx8d-FIaHf1_Rg":{"text":"This antique mall is nice but way over priced. Felt pretty uninterested in spending time t","useful":3,"cool":3},"_W_0fH-RyYk7CPDguALJgQ":{"text":"Typical of most antique stores, this place was a mess. Some areas looked better than other","useful":0,"cool":0},"3K3FQo1_LGAU_PC3C0PTfA":{"text":"The employees who work here are unbelievably rude and ill tempered.  It's a mall though an","useful":6,"cool":1},"mqU4MzLHditH79qgc2ek7w":{"text":"Appalled at the treatment I received here. I was uncomfortable turning in my handbag (my s","useful":3,"cool":0},"ux93F0QXLJQLAgXPfuLHXg":{"text":"Loved this place! Some good prices, some high prices. They didn't negotiate at all, so don","useful":1,"cool":0},"Jy_wAo82sJypAQAwB0nPpA":{"text":"I've always liked to mosey on down to magazine street on my time off but this time I visit","useful":6,"cool":0},"wSsAxvqS6rqdV2LFYxG5_w":{"text":"This store is very cramped with lots of items. Yes, u must check your handbag and/or any b","useful":3,"cool":0},"_bEfbf-BtBeB6-hUEYkHow":{"text":"I bought a vanity and asked to come back and pick it up after Mardi Gras parades. I'll go ","useful":1,"cool":0},"DuFYczPigcI80x50l4uFzg":{"text":"Was walking down Magazine Street and found this place online in my research of \"antique st","useful":7,"cool":0},"lQIgPnJfmMyG1lCxJl0IaQ":{"text":"I was really looking forward to looking for some old Julep cups when we happened upon this","useful":4,"cool":0},"W5vq_2k0wMfzsWiXHpa--w":{"text":"As far as merchandise this place is awesome.  They have everything you could possibly imag","useful":2,"cool":0},"_iUm_5Aebt_1x0-tinmR-w":{"text":"I always seem to find some sort of treasures here, be it vintage victorian photos or a gir","useful":0,"cool":0},"Bk-29pYyGtgduu341rSD8g":{"text":"I found this place to be very cool - alot of history to purchase at a low purchase.  I wou","useful":1,"cool":0},"ooDUOd1hNAkRCGMjnHzhIg":{"text":"Great selection! Nice and helpful staff. Good place to find all sorts of fun antiques and ","useful":0,"cool":0},"0s33gmM3WI9PE4FfygmGQg":{"text":"We stopped by last Friday afternoon and got lost for about an hour inside this Antiques Ma","useful":2,"cool":0},"JFRHN2ZV2FN4cU1-kmC-jA":{"text":"This place was on my list of places to see when I was planning New Orleans. I had read mul","useful":1,"cool":0},"rIQlLvemd5fdBOZu8G2WGA":{"text":"My sister and her friend were visiting NOLA and wanted to wander around Magazine to do som","useful":7,"cool":1},"zf7NF4LXFq-NfBobVdaFIA":{"text":"This place is mostly a pile of junk for which someone wants you to pay an insane amount of","useful":4,"cool":1},"X-GicjbZkBPA5OrOe22XFQ":{"text":"They have a half decent selection of things but mostly way overpriced. The kicker was the ","useful":0,"cool":0},"3OyU69LwwqSuyCy1dVDqHw":{"text":"Terrible place\n\nSaturday afternoon supposed to be open but closed.\nNo sign\nNo explanation\n","useful":0,"cool":0},"80Oev0bx0CNua6Hz1ZT1VQ":{"text":"They had some handcrafted slates that were made from different buildings and sites around ","useful":0,"cool":0},"IeVH-VKylMBgHOKPv67AYQ":{"text":"Appalled at the treatment I received here. I was uncomfortable turning in my handbag (my s","useful":20,"cool":4},"t7BbBsaL8KO6ImUlIBe-IA":{"text":"Had to come back after second guessing a glow in the dark our lady of Fatima alter statue.","useful":1,"cool":0},"95JoZClOzjks1oRg4FDqUg":{"text":"If you like thrift shopping then this is a great place to visit.  When you first enter, if","useful":2,"cool":0},"e_RRll9vtqj1WO313Cefig":{"text":"Awesome antique store. Most booths are well maintained and you can find just about anythin","useful":0,"cool":0},"7n71vCTmw-v3tziR9I4MSg":{"text":"Found a couple of great decanters and the staff was incredibly helpful! They wrapped every","useful":0,"cool":0},"_OrvPI_TkhefBV5RYT46Qw":{"text":"This is not an \"antique mall\" it's a flea market. If you Re from out of town, pay attentio","useful":8,"cool":0},"RSfVJS1p8Q4CLgLKBEKkvQ":{"text":"A really cool antique mall.  Prices were fair and it had a broad variety of items.  Defini","useful":1,"cool":0},"Nd-UGqqi_ajH4kr-eNp8Ww":{"text":"We popped into this establishment to kill some time on Magazine before we headed to our ne","useful":2,"cool":0},"BECSXSLnYd15sOSLWmiHbg":{"text":"Huge space with a lot to find. Good selection of items and very nice women who work there.","useful":0,"cool":0},"HplTpf9V7ylDNJ9SFnnf7Q":{"text":"What an absolute gem! During my first visit to New Orleans, I knew that I wanted to do som","useful":0,"cool":0},"upt71VrrWFUGWYYKcsyAJA":{"text":"If you enjoy thrift shopping, this is worth the visit. This store is pretty large and full","useful":1,"cool":0},"RSHDikkwzsq8K-jP4tJcdg":{"text":"I'm visiting from California and wanted to check out some thrift / antique stores. I wande","useful":0,"cool":0},"kJIgBvu7KG-raZdhWTLoGw":{"text":"This is a great antique mall on Magazine Street.\nIt's your usual antique mall with multipl","useful":1,"cool":0},"e2dIJSsJdPIsk38VntMp8Q":{"text":"Places is a shit show. Stuff all over the place most of it is overpriced garbage. Staff is","useful":5,"cool":0},"hUYOH01CkRNbTn3T46ZelA":{"text":"Lots to look at and most was reasonably priced. Spent about 1.5 hours looking at various p","useful":0,"cool":0},"Bhc1ILAt3-TrxoHcxMtt0w":{"text":"Like many other patrons I was asked to give them my bag a few minutes after I started look","useful":2,"cool":0},"iHwUKakaCgBAxhZPBYv3nQ":{"text":"Browsing for unique finds today when a very loud female starting yelling at the nice lady ","useful":0,"cool":0},"S0KhyWqBVEKFkPkVBUMAyA":{"text":"They sell Nazi memorabilia. That's a big nope for me. Too bad as they had a good amount of","useful":0,"cool":0},"aEaG8AUZVcdbEbtzgNz7KA":{"text":"I went to the Magazine Antique Mall with my family to shop for a lamp. I found a dirty, br","useful":18,"cool":0},"mWVcpeBiamFlbTj2kJMm5Q":{"text":"I went to check out the Antique Mall and I really enjoyed it. Lots and lots of cool stuff ","useful":0,"cool":0},"tyqEz5yTonMphaZoXcLl6g":{"text":"My fave antique place in Nola so far! I've only lived here for a few months, but I'm an av","useful":0,"cool":0},"zIAPTlxJPR55LohSNeVmow":{"text":"I'm sure there's some difference in the price points between NOLA and Texas. But seriously","useful":8,"cool":2},"i5Y8VavPK55JpVHYJ31ikQ":{"text":"I had a wonderful time perusing this great selection of vintage collectibles and to my sur","useful":0,"cool":0},"obG6Vw5gq9aQcIGQuYyQ7Q":{"text":"Found some less than common vintage Pyrex for a great price!! Now the only problem is how ","useful":1,"cool":0},"E2HOlNucITf3uV-on1IVQQ":{"text":"Immediately greeted as we walked in by a nice lady. There was sanitizer right in the entry","useful":2,"cool":2},"hnyDCJHh8x_9HLZ5sXn0bg":{"text":"As soon as you walk in they make you hand over any shopping bag you have-as if assuming ev","useful":2,"cool":0},"9ya_m0kG9cI4bbKFp7qlKQ":{"text":"Ok, so a little like going through your grandma's attic... but who doesn't LOVE their gran","useful":2,"cool":2},"mXtWVA4CfLeXkb_YmaB_5w":{"text":"This is one of my favorite antique malls! I give myself at least an hour to look at every ","useful":0,"cool":0},"81KM4VCYodLvK9ghZS7Y2A":{"text":"Usually I love perusing antique treasures but this jumbled heap was downright overwhelming","useful":2,"cool":2},"XUZpzSn0p5hUZJN5TBdaww":{"text":"#NOLAtourism #retailtherapy This place is amazing and huge.  The collections of crystal, s","useful":0,"cool":0},"hdYg9qEtOOHQkFYtNI-cJA":{"text":"This place sells extremely racist figurines and displays them visibly. The staff's respons","useful":2,"cool":0},"88lVkIPufD5_vt2u7oO-vA":{"text":"I actually really loved this place. \nBeing from out of town, I got an insane deal on a vin","useful":1,"cool":1},"Ac75o64MAM8aQRN1KtlJ-w":{"text":"I don't know that I've ever purchased anything at the Antique Mall, but my friends and I a","useful":1,"cool":0},"loScYzsuZRDNw2XJbQwZsw":{"text":"Always something wonderful and unusual can be found in this shop! There's over 40 vendors ","useful":0,"cool":0},"siRWPrimt6l1fq4IFboApA":{"text":"They have a lot of really awesome stuff but it can be kind of expensive. They are doing gr","useful":0,"cool":0},"1Beks2fql9oq5dGXdaORgA":{"text":"Whaaaaat ever.\n\nGranted, I'm not a die-hard vintage shopper. But after rummaging through t","useful":1,"cool":1},"bXwkqvgAmlQXXcysN6Nu6g":{"text":"I've been coming here for years and enjoy the experience every time. Today we went in for ","useful":0,"cool":0},"QWir74OamjuV6Wl1n8JrDQ":{"text":"This is the worst antique store in New Orleans. The prices are absolutely ridiculous and t","useful":3,"cool":0},"cNYQmifNqsSO_kTLOhdM0w":{"text":"Great variety of stuff in here retro, Victorian, antique furniture, military wwii Vietnam ","useful":0,"cool":0},"KvOaF4sxH_0-GMYIPSShag":{"text":"Parents do not shop here!!! After coming to this place on my vacation devoutly for several","useful":6,"cool":0},"nQ1bdAdYuaKjaILHXLj9Qg":{"text":"The antique mall for me is like traveling back in time. Things from my childhood pop up al","useful":3,"cool":3},"DThr3T2278QJhdASHhYd7g":{"text":"Magazine Antique Mall in the Garden District is a far cry from the antiquarian shops on Ro","useful":2,"cool":0},"3KN-zYJEwOVvDaCpwJCE7g":{"text":"I feel I need to step in here and defend the Magazine Street Antique Mall. You may think m","useful":2,"cool":3},"gm4401Dv20Zwe6-neNdFig":{"text":"Would give zero stars if I could. \nWas genuinely perturbed by the amount of racist imagery","useful":0,"cool":0},"_di7Kx43q6IKaNVKud2B8Q":{"text":"Let's say you're looking for a creepy Victorian-era baby portrait in an oval frame with cu","useful":7,"cool":6},"iiv4Mjq_acF9In8oJGHxAQ":{"text":"STAY AWAY FROM THE MAGAZINE ANTIQUE MALL. When we questioned the price of an exorbitant it","useful":8,"cool":0},"951tSWPmU2gJMAX_v8Fehw":{"text":"Nothing antique about this place. Looks like a bunch of stuff from your parents basement i","useful":1,"cool":0},"F6DuBsSUgU-jT8P_VqEAVA":{"text":"In every city or town I visit, whether for business or pleasure, I make it my business to ","useful":1,"cool":0}}