{"SRt8rsWS6P9IB-VzpzhrqA":{"text":"Excellent music, great cocktails. \n\nSeating was a little tight, but at least you can take ","useful":0,"cool":0},"1QZz92vkBFQJrRMbz5NZ6A":{"text":"Great ambiance, less bro-y than the rest of the bars on bourbon.  Solid live band, good se","useful":0,"cool":0},"M7rjH5oO91MLsi82V4Rz2A":{"text":"This is a great place to listen to jazz.  Very good music. Great band.","useful":0,"cool":0},"BNE8ZGvR1broJe5ZI0ULWw":{"text":"Music is amazing!! The ambiance is cozy and festive with the Christmas lights.  I love the","useful":0,"cool":0},"a8R9RfNWbNsAX9taLyHuUQ":{"text":"Let's get the biggest problem out of the way. Drink prices. Yes. They're high. But this pl","useful":5,"cool":1},"pdLKBKyetW1WLGyhi_zV4Q":{"text":"Music was amazing best pure jazz I heard on Bourbon st! However atmosphere a bit too cramm","useful":0,"cool":0},"rVMxWpuo5KDgxJn-9ovwZQ":{"text":"Great band. The place is old and gross, the drinks are overpriced and so so, but the music","useful":0,"cool":0},"B0bonl783i3jrRhjXjJ8Hg":{"text":"My husband and I had a long philosophical discussion on what the word \"touristy\" meant aft","useful":0,"cool":1},"LD7hs437cFthaew8AhgtdQ":{"text":"Frizel's is an anomaly on Bourbon Street. We had no idea that the French Quarter was going","useful":2,"cool":0},"-O-8kJ0E1GdUChHR_p_GiA":{"text":"For the music a 5 the rest that goes with it a 2 or 3.\nThe band plays feel good jazz music","useful":0,"cool":0},"76-rLdtpbKcFoXjNhEnlQg":{"text":"We've been to NOLA a few times and my absolute favorite place to be on any given night is ","useful":0,"cool":0},"O1NUH3j3jPf7Hf-tUKmgkg":{"text":"While you can definitely find cheaper drinks on bourbon street, I seriously doubt you'll f","useful":0,"cool":0},"_IIT-t8A1M_awpIqmojZ8A":{"text":"I was here during Mardi Gras. And somehow, during Mardi Gras, we couldn't find many clubs ","useful":1,"cool":1},"tKa1HRRtSBAzxK3M1lAuog":{"text":"This place was awesome. The jazz was great and the ambiance was right up my alley. The onl","useful":0,"cool":0},"j299PEX9xHG8Edcv63KfpQ":{"text":"Music was decent this evening but I'm docking it because like most of the places on bourbo","useful":3,"cool":1},"caUhqXjAhVboso6U2JyVHw":{"text":"Excellent club! \n\nFor management: Ann is a terrible waitress, very rude exceptionally unfr","useful":2,"cool":0},"XSurkbvaNCpDjo5MEpB4YA":{"text":"Amongst the madness of Bourbon St on a Friday night we found this great little jazz club w","useful":0,"cool":0},"beL_pR25SZSiMqH8jIbrgw":{"text":"We wandered in to Fritzel's without any idea what to expect and we were blown away by the ","useful":1,"cool":0},"SykW8v7FRklAjq5nSC-wRw":{"text":"Truly a NOLA experience.  We enjoyed the music, service was ok... but the beer was good an","useful":0,"cool":0},"2QdzWmWnv0YiOba3e9zXCw":{"text":"This place has all of the New Orleans charm you could ever expect. The drinks are good, th","useful":0,"cool":0},"Uy1EmgtC_wZHTr9bQLSnbQ":{"text":"So many of my preconceptions busted by this town. I don't like cooked oysters. Well I love","useful":0,"cool":0},"4uJivMZgi4mKBJQUISoDMA":{"text":"Our favorite venue in Nola! Always great music and the service is top notch!  Hidden gem o","useful":0,"cool":0},"9U3thv0d0Elo3Q0P2McolQ":{"text":"This joint on Bourbon street is the German claim to this part of the party strip. Another ","useful":3,"cool":2},"1uOdKeYtc_Za7gJHQfOlzA":{"text":"Heard the house band and they were terrific! A great place for jazz right on Bourbon Stree","useful":0,"cool":0},"PCsF8reHvMjyX0jsQQYBUg":{"text":"You want live jazz? This is by far a great place to stop by if your from out of town.  The","useful":0,"cool":0},"yDIkuWCqwTXmISgl9l4L8A":{"text":"This intimate club is one of the coolest spots on Bourbon Street, serving up fantastic mus","useful":0,"cool":0},"oib7LMA7dIYM0YjKTOA5qA":{"text":"We came to Fritzels on a Saturday night in Dec, looking for \"Dixieland Jazz\" music for my ","useful":0,"cool":0},"k775QyybHMTzmwqfWLc_Xg":{"text":"Oh, Fritzel's.  If I could convince my parents to remodel their basement bar after your ba","useful":1,"cool":0},"NGJwnvA_yyhQuCrrzUGz2w":{"text":"The place is small but yet cozy. This is one of only a few places on Bourbon Street that d","useful":1,"cool":1},"qSaBm7KUNkkNZZNnlaJ37Q":{"text":"It is what it is: Kind of a dark, quiet bar, at least before 9pm. But you know what? $4 li","useful":2,"cool":3},"Egz9ECdxZzoNbqsHenonGA":{"text":"Great music!  Great drinks!  Wonderful service and waitresses!!  Nice quieter bar and musi","useful":0,"cool":0},"Z69RkB6IHWbQw0GBskbFzg":{"text":"With only the hope of listening to some great music I strolled in and sat at the front of ","useful":0,"cool":0},"8exevhKpj5G4BZEkyNPjCQ":{"text":"An oasis in the middle of Bourbon street madness. Cute live music venue that looks like a ","useful":0,"cool":0},"JmfQDAeqYMMCF0mAhk3DOA":{"text":"My favorite place for jazz music in New Orleans! It's quite different than the rest of bou","useful":0,"cool":0},"mrup_cG_u7BprgLe4zYtRg":{"text":"What a great place to catch live jazz.  Get there early for good seats, because it's just ","useful":0,"cool":0},"q51I3aw5CNuVKZfUZZr9YQ":{"text":"Really enjoyed my time there. The bartender who was working was exactly the friendliest pe","useful":0,"cool":0},"2pT0FVGakYFKjwtlccMTBQ":{"text":"Spent 6 days in NOLA. Went to Fritzel's 2 seperate nights. 2 best nights I had were spent ","useful":1,"cool":0},"dArlI8-2mdN5mAYKiotjHA":{"text":"This place has my favorite beer that is seemingly rare in the states. Live music is always","useful":0,"cool":0},"mSKdHjxKNhIhdfKh5TjoFw":{"text":"Thanks to Fritzel's for holding out against the lame karaoke or ultra-uber-blues blaring o","useful":1,"cool":1},"679IowkfVrdDbonqqM84lA":{"text":"The bar is good, but nothing special. Their jazz daiquiri was very popular with my wife. I","useful":0,"cool":0},"BTPIAfHrzzLgGck16bHhJg":{"text":"This was my favorite live music place on my last NoLa trip. I love the vintage feeling, li","useful":0,"cool":0},"8f2aZdca-JFGhIe70LkchA":{"text":"Solid jazz place on Bourbon St. Probably the best jazz option on bourbon st as others have","useful":2,"cool":1},"Ohpf22tMZZjOUpSM594ocw":{"text":"Great music,  good drinks,  nice atmosphere.  All the essentials to a good time.  Worth a ","useful":0,"cool":0},"uammjt3jzWUeQLbGSX2GAA":{"text":"My friend found this place by chance and we were so glad she did. An oasis on Bourbon St. ","useful":1,"cool":0},"N3Sifb_R1GotxYjqUNQctg":{"text":"Great music! We wanted to enjoy the real NOLA experience on Bourbon Street so we popped in","useful":0,"cool":0},"3zIvG2RGgyMH-czGt3hHwA":{"text":"We never miss this place. Great music, stuffed to the max and everyone is friendly. An aut","useful":0,"cool":0},"1JjNb041TRKIWl6IRtCjmw":{"text":"Recommended by a local, it did not disappoint. The house band on Saturday night was amazin","useful":0,"cool":0},"hCl4xwjfw8J-2Y3aSEBgQA":{"text":"IMHO...best \"hidden gem\" for Jazz on Bourbon Street. I almost don't want to tell people ab","useful":1,"cool":0},"7iT76Xln9eP-5iP3UlyH7w":{"text":"Completely enchanting and magical. This place was incredibly cozy and let you be up and cl","useful":0,"cool":0},"m2zFKTRz8QEGKJaAK2-DVw":{"text":"It has been 20+ years since I visited NOLA, I was expecting the old good times as back the","useful":0,"cool":0},"eCYgOWrroL6ARId3GfvN7Q":{"text":"Small cozy dive bar. The stage in the back is surrounded with chairs. A hostess directed a","useful":0,"cool":0},"xJzJpTYC_1k_EE0AWTOPXw":{"text":"The only reason I am giving this place 4 stars is because they allow smoking.\nI LOVED LOVE","useful":1,"cool":0},"tSj63rMqSrSc3oklD3REKw":{"text":"I loved this place!  The music drew us in and a group leaving just about the same time ass","useful":0,"cool":0},"wBgEbKeQHguoAmIZq1I9dA":{"text":"Great music, great environment. I made my second trip to Fritzel's this past weekend and e","useful":1,"cool":0},"FCwwigL5jm7FBGg1J1ogfg":{"text":"We visited Fritzel's several times during a recent week in New Orleans. It's small and int","useful":0,"cool":1},"w3BdkD5fWULxSMFIZiktig":{"text":"We were just walking around at Mardi Gras and heard some amazing music inside this bar. So","useful":0,"cool":0},"3FUcD1zXoCPzroSwen0T7w":{"text":"The one place on bourbon st where you can count on some true classic new orleans jazz. Ser","useful":0,"cool":0},"pXuWSnWwIlcycdZcrlkNRw":{"text":"Great traditional jazz right on Bourbon st.; the band was fantastic. Bartender was doing a","useful":0,"cool":0},"njUx8ypWnMfcQ0NQXyM6jw":{"text":"My girlfriend found this place online. I was skeptical but after about 2 mins of hearing t","useful":0,"cool":0},"H_KgxYLc5xpXaJsn--XtCQ":{"text":"New Orleans: birthplace of jazz and blues. So whyisit that most bars on Bourbon Street wit","useful":1,"cool":1},"ggdwdThtkqPzCLJTJRhIaQ":{"text":"yes, this hit the spot.. if you like the old style jazz. We heard Fats Waller, Louis Armst","useful":0,"cool":0},"psrnm-WmWxUW9QffSNQGcw":{"text":"Excellent music and nice ambiance. The staff was polite and the intimacy of the small venu","useful":0,"cool":0},"zA5b5ID2ILglaa2iyZP0Yg":{"text":"Excellent venue for French Quarter Fest. Lots of seating and a patio. Generic bar selectio","useful":0,"cool":0},"FGQrHbW7oaA19FYNPyj7OA":{"text":"I don't know if this is \"tourist trap\" but I'm more than happy to be trapped here. Right o","useful":1,"cool":0},"vVmXTNgCdfDhyh32N5OfIQ":{"text":"The drinks were a little steep for the price.  Definitely a bottled beer place, avoid the ","useful":0,"cool":0},"sPQU-nFIDcOg0t0y90HqhQ":{"text":"Room oozes history. Maybe the best place on Bourbon to hear traditional jazz left. We alwa","useful":0,"cool":0},"_CjMhfu-5NKw-oEv41Bicw":{"text":"One of my must stops while in town. Great jazz on Bourbon St.  One of the best bands in to","useful":0,"cool":0},"eL12-xDrpdoCsDUHgR6RZA":{"text":"The music is the best! Can stay there from 6pm to midnight. Richard Scott is the best!","useful":0,"cool":0},"ZPst7uqqb6OxBDopv4B9iw":{"text":"One of the few great places on bourbon st! It's really a different world, once you get in.","useful":1,"cool":0},"Okkqz0u1Tginy4kRQBmcjg":{"text":"Love it! Great music and the seating was decent. I think they call it \"European Jazz\" bar,","useful":1,"cool":0},"z-8vmEanhY6r4HCN1zahsw":{"text":"a great place to listen to \"real\" jazz with civilized people.\n\ntotally agree with Christa ","useful":0,"cool":0},"LDR1ZwxqQ6ZaK9Wb32L0WA":{"text":"Hands down the best place for live jazz in the French quarter. Always a variety of talent ","useful":1,"cool":1},"Usv6WjIG7nbnLDDH3AkGcg":{"text":"The music was some of the best we heard on Bourbon Street.  Much better than the cover ban","useful":3,"cool":0},"1fQLldEw0lEoFXguCZu7jw":{"text":"Fritzel's is a nice jazz bar. Quick service. The people who are complaining about drink pr","useful":3,"cool":0},"LaSZ9bNzseJ_rYdgV2HfpQ":{"text":"Fritzle's was recommended to us by a nice couple while at 3Muses on Frenchmen Street.  Gla","useful":0,"cool":0},"rmYWFjBu233R3wyOJrFCBQ":{"text":"I think the review by Marissa L on 9/30/13 is right on the money. She described it perfect","useful":0,"cool":0},"e57oVhCxvZ24yMMTMSnsVQ":{"text":"Come here for the music, great house band with intimate seating that let's you really feel","useful":0,"cool":0},"IlKErW64w0ZsgZQguTGA1Q":{"text":"Talk about getting lucky. We were just strolling down bourbon street and noticed the sign.","useful":2,"cool":3},"LJ47RsvQWMqfVn9ioILlnA":{"text":"This little hole in wall bar smells like a ashtray, charges $5 for a bottle of Kirkland Co","useful":1,"cool":0},"5lT4WPBSRnHVQOUiVtk9uQ":{"text":"The place to go if you are bent on listening to live music in the French quarter. Warstein","useful":0,"cool":0},"oDMdZ2C-MFoHAbrc7XvsBA":{"text":"If Bourbon Street is not your thing, but jazz is, walk through the drunks and go to this p","useful":0,"cool":0},"W8smOcYxLvTDDxGzlOsjRg":{"text":"I'm all for a minimum drink purchase requirement in a place with no cover and good music. ","useful":4,"cool":1},"EX6vavY4apNlA2yD3xDfJQ":{"text":"Such a fun hole-in-the-wall that is a completely different world than the nonstop drunken ","useful":0,"cool":0},"OJxLUNDWJv7jm-NJxBo53A":{"text":"Super cute, good music and beats most of the nutty stuff on Bourbon St.","useful":0,"cool":0},"9ZCiuXocyQzN7MVw50A0tg":{"text":"First the good: No entry fee and the music is great. Now the bad: The venue is small and s","useful":0,"cool":0},"IPMppPLGoaNUzPc2gxYqDA":{"text":"This bar became our go-to place when I came to NOLA for the first time The vibe in this pl","useful":0,"cool":1},"67hLio5kv8MvFAvnp61pzw":{"text":"Beers are more expensive here.  The service isn't the most polite.  They allow people to s","useful":0,"cool":0},"UpCxdV-N7Ss4Ao39iBBYsg":{"text":"Great cocktails, live music. We weren't the \"blow our eardrums out, hand us a fishbowl of ","useful":0,"cool":0},"ou0PUbAkM-iqltyLxzXYRg":{"text":"I went to New Orleans with a couple of friends over the first weekend of November 2013. Th","useful":0,"cool":0},"NeD58V1KKJOXQWdRMR3FgQ":{"text":"Went to Fritzel's twice during Mardi Gras which isn't exactly the best time for relaxed pa","useful":0,"cool":0},"FFNRW4glvDC9_xTOgOlvvQ":{"text":"This place was great! We went last saturday night and the band was fantastic! Don't know t","useful":0,"cool":0},"tgmFppL2QJnNowuIY8w4cw":{"text":"Warm, friendly, charming.  Only there one night and the jazz band was incredibly good.  It","useful":0,"cool":0},"BRHaQsUKotsJUhCLlS-x-w":{"text":"Favorite place we found to listen to jazz on bourbon. Drinks aren't cheap but not crazy. B","useful":0,"cool":0},"C46F6y5GxF91lVXg6Hi3Gw":{"text":"Next time I am in New Orleans I will be coming back to Fritzels. Great music, a little dan","useful":0,"cool":0},"0Mm4pd_dPBqFZDgkN_70KA":{"text":"Nice place, cool crowd, reasonable prices and very good vibe! We found a spot super easily","useful":0,"cool":0},"yQ9AZPKVF9lVmdOogLu9MA":{"text":"If you visit New Orleans for the atmosphere and jazz, this should be your stop on Bourbon.","useful":0,"cool":0},"6jsJdNXu1ufiaeN0X9tpPQ":{"text":"Come here if you want to stay away from the craziness on Bourbon.  Great music, but even m","useful":0,"cool":0},"Gi6Zz3Z-D4fsCJW_IlMzYw":{"text":"This is one of the few spots on Bourbon Street that actually play jazz and not blast pop m","useful":1,"cool":0},"DtYS1r4bpcek2x94O33qTw":{"text":"Great spot for those who don't want to be surrounded by puking 20-year olds with Yard-a-Ri","useful":0,"cool":0},"h-hiG8Q25BX4rv-akkzbtw":{"text":"Excellent music and drinks. We sat for several hours enjoying a great band. There are two ","useful":0,"cool":0},"KbRwe0MnMss4VgL7LhdgPw":{"text":"Music was good. Hostess was on top of things. They charge you nearly $6 for water even if ","useful":0,"cool":0},"QyKES8NTkQ8WGIzI_d8KqA":{"text":"I don't actually drink, I came here for two reasons...One was to escape the warm vomit sme","useful":1,"cool":1},"d2zVGJSDMlR2VXS2uQHdSg":{"text":"Amazing Jazz!!! The musicians were so incredible and inspiring! The drinks were outrageous","useful":0,"cool":0},"cbpEfoulRhmvn6-Jljtrbw":{"text":"We went here last weekend after a friend's wedding.  It was awesome.  The band played grea","useful":0,"cool":0},"dzAdQAq15I8hNHf-Qf-eNg":{"text":"Came here 2x on our recent trip to New Orleans. Loved this place. Its a casual European ja","useful":0,"cool":0},"4LaLSFtl5srz2jR9KZ6dog":{"text":"This was a really cool place to relax and catch some good jazz.  The seating is limited un","useful":0,"cool":0},"j38qNSnppmDm232Z8TrAkw":{"text":"We saw Richard Scott at the Mint earlier in the afternoon and decided to go check his band","useful":0,"cool":0},"Vfu96omrsRHJQvrslHGCLA":{"text":"This club is exactly what it claims to be: a small intimate old time New Orleans jazz club","useful":1,"cool":0},"Gg3MUCcp0ORZkXfMrtgP-w":{"text":"The name Fritzel's European Jazz Pub was truly fitting as the audience was 97 percent a gr","useful":0,"cool":0},"6lKwzQaJYepzOCtHrZVntA":{"text":"I always have a good time at Fritzel's.  Maybe it's because the Jumbo Shrimp Jazz Band is ","useful":0,"cool":0},"9iaVYgkyqEZtj0T5y3NvKg":{"text":"First bar I visited in New Orleans, and it was awesome!  I've never seen such a \"boring\" l","useful":1,"cool":0},"Ne8LrL2Y0uu4_vWSHHVyig":{"text":"The only place on Bourbon street that I really liked and had a good time at.  This place a","useful":0,"cool":1},"CoJoBOt_gw2dcZtSw23_Yw":{"text":"A few reviewers mentioned it was family friendly. Since we were looking for a place to tak","useful":0,"cool":0},"FF8TLDZW9hlNQ8PsbfwI1Q":{"text":"Good bartender, they show a $5 hurricane on the sign but that is premixed.  The bartender ","useful":0,"cool":0},"qgwqknHpL-Weq2IunfjOrQ":{"text":"Great find in the quarter.  Small cool, little place.  We actually hit this place as our f","useful":0,"cool":0},"PW5hDx-EpoCkVgh9c_mhGg":{"text":"I really like this place because for a few reasons:\n\n1-it's a quiet place on Bourbon Stree","useful":1,"cool":1},"vxO2mku0iMcyB0c8kc9NBw":{"text":"The band was amazing! The drinks were decently strong and compared to all the craziness th","useful":0,"cool":0},"3SMLZGnf3Y8HS7QVr9UrIw":{"text":"cool place with cheap and strong hurricanes :P","useful":0,"cool":0},"lWH374Wyk7kH9iaLM5FumQ":{"text":"Staff at the Preservation Hall recommended this pub as a place to come for good live jazz.","useful":0,"cool":0},"ds9YR6e9B6X75xD6L4TUWA":{"text":"This place was my favorite spot on Bourbon Street. Yes, I'm in my mid-30s, and I preferred","useful":4,"cool":3},"ZBGlWMgiFRCSQKxl3WIoGQ":{"text":"There's something pretty incredible that happens here.  Go early to snag a prime seat and ","useful":3,"cool":0},"Q0qR-gQPRK1WVQ0Sw4Svkw":{"text":"Great little jazz bar with a ton of character.  I liked the jazz a lot particularly the cl","useful":0,"cool":0},"XB0_E3jXE-bvSLT_8_TbuQ":{"text":"This place was so swinging we went back two nights later.  \n\nWe caught the house band on a","useful":4,"cool":1},"D3xUoMTnK4Qu827-gO6bhQ":{"text":"This was the best NOLA experience in town!! Great vibe, great people, great music. Up beat","useful":0,"cool":0},"JJJocZXCYGMLrpG-7Z1Vbw":{"text":"LOVED IT!  Laid back crowd, incredible live music.  Everyone was in great spirits listenin","useful":1,"cool":0},"Y4yfFlVOGahG3Xim92kPNQ":{"text":"This is the best place on Bourbon Street to listen to some great live New Orleans Jazz mus","useful":0,"cool":0},"Gxlxu7Rug2tM_V7sS4x6fQ":{"text":"During our 6 day trip we ended up back at Fritzel's 5 times.  While the bar/service is not","useful":1,"cool":0},"5ZE0XArHh_l_u6B2_KswZA":{"text":"Loved this place and their cheap, cheap, cheap to go drinks. Really strong, though. Really","useful":0,"cool":0},"ZoP0RNIq4quWBfJ65pruog":{"text":"Great jazz hangout in the middle of the madness on Bourbon street. Very local feel, cheap ","useful":0,"cool":0},"LX5hhqWafmAzSyzhLjoLYw":{"text":"Incredible music upstairs and downstairs.  Every time I've been here it's been really, rea","useful":0,"cool":0},"f_jMPE4TZ-ZFHPOGodTgCw":{"text":"Cool small jazz bar. Good music the Monday night that we were there. German themed spot. B","useful":0,"cool":0},"oHIo0JHjyNef48GKHzodSQ":{"text":"Great unique spot on Bourbon St. The live band was crowd pleasing and fun. The trombone pl","useful":0,"cool":0},"0AIdlBpLHAJbbdPiKLQ82Q":{"text":"Fritzel's, located in the heart of Bourbon Street, is unlike its trashy neighbors who serv","useful":5,"cool":1},"gPWBdGGYQMWgqz687-dX4g":{"text":"fun place.  Great music, nice atmosphere.  Would definitely visit again.","useful":0,"cool":0},"SlYB0Sfjb4GBVeRHBSQ0XQ":{"text":"In the heart of the French Quarter, this is the place to go for incredible traditional jaz","useful":2,"cool":2},"sSRUFOl786H1Jx4znYphWw":{"text":"Simply amazing! Have been to fritzel's 5-6 times and every night the Jazz is amazing and s","useful":0,"cool":0},"GnRh8IV9eQXoi7Fq5oWHaw":{"text":"We went twice, once saw Richard Scott (solo), and once with a band. He is an amazing piano","useful":0,"cool":0},"FUpCPm0X9HHQB62oFtJ0tg":{"text":"Loving this place! Beautiful music and decoration. \n\nTheir drink prices are a little highe","useful":0,"cool":0},"B1u2wLj1WpGkfq4t3nbKJQ":{"text":"Hands-down the best local dive-bar jazz experience we had in New Orleabs. So authentic and","useful":1,"cool":0},"SZ2Y0BzJqxwWrbQLSvWptQ":{"text":"Excellent live jazz music and Irish coffee.  Bought a band cd on the way out the door.","useful":0,"cool":0},"yOSzvi5MTbmEKuzI23j2ng":{"text":"There are next to no jazz places left on Bourbon. This is one of two that I saw and my fav","useful":1,"cool":0},"Pa_UYjLwOJ7fapUy6YjG4A":{"text":"The drinks are mediocre, at best, and they're not exactly cheap, but you don't come here f","useful":0,"cool":0},"6MexSOKJCPoioA00Fggs5Q":{"text":"visited in December 2012.\nThis pub has the best live jazz ever!!!\n\nCan't wait to go back :","useful":1,"cool":0},"9Q9PDEbcf5T4JKgcq9i2eg":{"text":"3.5\n\nStumbled into this place on a late Saturday night, grateful to find a bar on Bourbon ","useful":2,"cool":1},"x-z41_1MXBvgZZ2eMTrdCA":{"text":"This is the place I crave!! Been going for years and always stop every night to listen to ","useful":0,"cool":0},"FySTjtLMtxmzHyBtHH0vmw":{"text":"Always a favorite in New Orleans. Great classic jazz in an old school atmosphere. Creative","useful":0,"cool":0},"niiX3iwuveMYhhw1YceS8Q":{"text":"Would have been a 5 star if the young lady who brought our drinks would have smiled. \nNo c","useful":0,"cool":0},"bwdL_u1sjBUWJEly5QNZ-Q":{"text":"Awesome music, lively atmosphere, friendly service. Beers are served up cold and fast. Ben","useful":0,"cool":0},"1xZeh-UW5eZ-g5fDlV3Frw":{"text":"Lovely jazz music.  Went on valentines night, was crowded, lovely atmosphere.  I had taken","useful":0,"cool":0},"XvgC0KtePzKV-LbRViqTMQ":{"text":"Don't bother with this place, there's a lot of better places in new orleans. This place is","useful":0,"cool":0},"Pyvn9UxAyfDs_9_953p2Hw":{"text":"Fritzel's European Jazz Pub celebrated it's 43rd birthday in 2012, and is the only authent","useful":8,"cool":4},"xbpjhEhqqVkud7ympE1uiA":{"text":"This little unsuspecting dive was full of entertainment! We stayed for hours enjoying drin","useful":0,"cool":0},"qPPRNnudKkZfKiBQ2pRbJw":{"text":"This is definitely my favorite place on Bourbon Street and my favorite place for live musi","useful":1,"cool":0},"sEkY8thVn1jhl98s4QPyBQ":{"text":"We saw live jazz at Fritzel's twice during our trip. Once on a Tuesday and once on a Thurs","useful":1,"cool":0},"f59CYXroeVVMUT1t7yoCEQ":{"text":"My very favorite!  There is nowhere else that I have found that has consistently great and","useful":0,"cool":0},"d41XLGodW5hHzpOeNhSFDg":{"text":"Gorgeous old school lounge and wonderful jazz. Cocktails were delicious. Wandered in off b","useful":0,"cool":0},"NfWNpvBpvxEReBtfiR7QAg":{"text":"Best live music in The Big Easy! We LOVED this place! Small quaint bar that we visited two","useful":0,"cool":0},"1-yB6uBjgnQfywYGwCYPEA":{"text":"Fun jazz club. Music was good and a nice break from the craziness of bourbon street.","useful":1,"cool":0},"hPl45uGzAGvOk5ra17Mp6w":{"text":"This place has amazing live music.. i mean some real talented folks play here.  This place","useful":0,"cool":0},"GF1LHw7kO59YwcG760DnNQ":{"text":"I was walking the strip when I heard the music come from this place. It almost called to m","useful":0,"cool":0},"RLkKd9MJHqU8Sco9PHswtA":{"text":"Fun, intimate jazz joint on Bourbon Street where you're right in front of the stage! If yo","useful":1,"cool":0},"bE50C06IN9OKqJLw9idJgA":{"text":"Went on a Monday night, they had a great fun band playing. The waitresses were not the fri","useful":0,"cool":0},"SQ3QsJkyMgLzprwxnuPfkg":{"text":"So after the 4th night of hanging out on Bourbon street... we kinda wanted a change of sce","useful":5,"cool":0},"3shywDAkM2VzkVYPlE7WAg":{"text":"True live jazz, New Orleans style. Loved it! Small and comfy bar, good service. Quality dr","useful":0,"cool":0},"-uqlW0g8MkT-ni12mqxfcA":{"text":"This place is the shit! Dang good time. Intimate setting with fantastic jazz! Minimum of 1","useful":0,"cool":0},"Xhzn-uHmbD75gwu9o-V9ng":{"text":"Big fan of this jazz bar. Came to NOLA with friends over Memorial weekends from Chicago an","useful":0,"cool":0},"GUOaS-VryN_Za7dkG2kmWA":{"text":"Place has great atmosphere. And the band was great. But as far as the bar goes it was not ","useful":0,"cool":0},"TAk7FMMBe8NlztIOne_OJA":{"text":"Great vibe!! The band is awesome and full of energy\nIt gets a little bit crowded as the ni","useful":0,"cool":0},"MnCMqn9NxJobQ2j9_C4sqQ":{"text":"Fritzel's is one of my most favorite places in New Orleans.\n\nWe were there last week and s","useful":0,"cool":0},"0hPWzB2HljyinSMZvcnsPw":{"text":"Best Jazz in New Orleans! I will come back!! Yay!Best Jazz in New Orleans! I will come bac","useful":0,"cool":0},"sbD-OWEcncv4PONdVGuSoQ":{"text":"Nice place but a lit bit crowded. Try their Bloody Mary! You'd love it! The service is nic","useful":0,"cool":0},"EJqB0Gg09AjY2AiGq173wQ":{"text":"i stopped by this bar wednesday night upon the suggestion of 1 of my out of town friends w","useful":2,"cool":0},"hOSFj_Ub3BMbQ3lw-NcEhA":{"text":"This is one of the two jazz clubs we went to on our trip to NOLA, and the live music conce","useful":0,"cool":0},"E8jGV5kDU1Jz_47tXJyIHg":{"text":"Great music but....  we show up they charge us 10$ for a bloody Mary the band plays one so","useful":0,"cool":0},"jck5rn7ws6Ezg7MYqbNtwg":{"text":"If you want to experience dixieland music on Bourbon Street you'll find this is the only p","useful":1,"cool":0},"IMNZG_bYmJoTkjTYw9yecw":{"text":"What a little hidden gem.  We ventured inside here after walking down Bourbon for awhile. ","useful":0,"cool":0},"KzWHcKmXa0n2WR9-TzgbcA":{"text":"Stay away. This was recommended by a friend who says the music is great. We didn't know wh","useful":1,"cool":0},"WSFici39gdDNevmdbvb6KQ":{"text":"OK... Those who say there is not good quality jazz on Bourbon St. clearly overlooked this ","useful":0,"cool":0},"kqXEUadOEn3Eq0T-pqRiWg":{"text":"I felt very much at home at Fritzel's! The house band is fantastic and really put on a gre","useful":0,"cool":1},"D14ZBL9td-Oo9PWZ2Rapyw":{"text":"Over Thanksgiving week I was in New Orleans for the first time in my life. First time ther","useful":0,"cool":0},"UzfH1f867_GQSg_5fFa8zQ":{"text":"Ok here's the worst part , the front is .... small ... so get over that and soak in this c","useful":0,"cool":0},"31muMDwKf_-DJT-IPoORoQ":{"text":"i was eyeing this place all week and finally made it here the final night. Just a quaint, ","useful":0,"cool":0},"Ps8mTzhi1wUwEO5H6Fcv0g":{"text":"Cozy and good music ! Recommended to arrive 30-45min before the beginning of the concert. ","useful":0,"cool":0},"yqdZLd95dP1r0kTcLRJI9Q":{"text":"This is a great bar to go , have a drink and listen to great music. The drinks are cheap a","useful":0,"cool":0},"lbwz-_4EO8m01T-OZaB15g":{"text":"No matter if it's day or night, Fritzel's is a must on Bourbon Street. My first stop was d","useful":1,"cool":0},"haMsNY5atDTv0T1w7PukJA":{"text":"This is a really cool atypical bar on bourbon street, it's a German jazz club with live mu","useful":2,"cool":0},"WqGfDPiNeD9EI1gNloDjlw":{"text":"This place is incredible! I was in town with a few friends and we were looking for a fun b","useful":0,"cool":0},"EZXCqZ_HZ_dRDKU5iUfaQg":{"text":"Relaxed, pub-style atmosphere. We listened to Roamin' Jasmine and enjoyed their lively mus","useful":0,"cool":0},"Ol42KuG0lvtkHxzPDfLzIg":{"text":"The only good things my good about this place is the musicians. The device staff and speci","useful":1,"cool":0},"uBAkWnyZ2ZOP8Xb5r6wdDw":{"text":"A perfect evening spent with music flowing through my soul. Upbeat, great location, excell","useful":0,"cool":0},"HDe7B9Jb32qRfWfWZjnQLQ":{"text":"The jazz was good, and there was football (association) on TV.  No cover, but they get you","useful":0,"cool":0},"Dk7a-wk6EuCoJ066Js3RpA":{"text":"Excellent night at this place!!!! I enjoyed it very much!!! Thank you for the wonderful ni","useful":0,"cool":0},"42hJWxNMvqKBPzsZH6Q9kA":{"text":"I LOVE this little pub! It feels authentic, great drink selection, great music, and quick ","useful":0,"cool":0},"TUsyOcZlgaB3H1sT3BG-rQ":{"text":"Horrible staff; rude and unhelpful. One particular woman, with an indistinguishable accent","useful":1,"cool":0},"hdgzH-NszzXu5MAEzcFNLw":{"text":"German beer and jazz - yes please! Stumbled (not literally, which is possible in NOLA!) wh","useful":0,"cool":0},"bRtMT391keAApckcYL3Eag":{"text":"We stopped by towards midnight on a Monday night and the place was packed! Not sure the na","useful":0,"cool":0},"PIavY0IdYRQGTgYuaf7LXw":{"text":"I adore this place.  The ambiance is just electric and I can't help but be delighted whene","useful":0,"cool":0},"0js_S4XG6XO0Wj4NjFWlWw":{"text":"Without a doubt the most fun I had while in New Orleans!  I knew from the get go that if I","useful":2,"cool":0},"_ik5Y7g950BGO9FYCiz2MA":{"text":"Happened to stumble in on our first night in NOLA, and am SO glad we did. I love a dive, l","useful":0,"cool":0},"FJQWOIaTIRlpYGgnOXpFxQ":{"text":"The in house band is absolutely outstanding! High energy great musicians. Talented and the","useful":2,"cool":1},"Y-G-vNlo55j3z6Umb8UK3A":{"text":"It's tiny, cramped, and has a 1 drink minimum (draft beer $8). The bands are fantastic - y","useful":0,"cool":0},"ILVnoL_Y61ELMYgz_jWdZA":{"text":"This places was really cool, the music was amazing and the drinks were really good,\nThe pr","useful":0,"cool":0},"OS6cQxOE3gJmlIMMW-20Eg":{"text":"Great little jazz club with a 1 drink minimum. I enjoyed the music and the service was ple","useful":1,"cool":1},"yvCi0-VH2lyuPgIc1xeOmg":{"text":"The best music experience on Bourbon St, hands down. We didn't eat here at all and we did ","useful":0,"cool":0},"RrUGJFyVErCDdC39fNLbMw":{"text":"If you are wondering which jazz bar to round out your NOLA experience, this one is a must!","useful":1,"cool":2},"EBOGE5gDaeaJvKqINGi5rg":{"text":"Fritzels Jazz Band was playing, their house band, traditional New Orleans jazz, Louis Arms","useful":0,"cool":0},"flDWIht-P9LNaNOu5Rm1JQ":{"text":"Beware!!!! As of one month ago, they stopped serving food (which stinks because the pizza ","useful":1,"cool":0},"1hbWY4826WwF6z0JRRr1Jg":{"text":"Tired of it. Just rude. The owner (some people refer to her as the hostess but I'm pretty ","useful":0,"cool":0},"Fs3H8BS--ocH-CjQa1Wt8g":{"text":"LOVED IT. Tell the Host the Vampire sent you. Bring cash. $10 cover to be taken to a priva","useful":0,"cool":0},"XiU07AlogP-mUwos2C4Abw":{"text":"Best place in NOLA, hands down. Incredible music, good drinks, cozy atmosphere. A breath o","useful":0,"cool":0},"-PiOPkmV_SR1zgogQLWLnA":{"text":"Absolutely love this place. Went twice amazing music both times. Both nights other musicia","useful":0,"cool":0},"EGobw4o4BhXftg6f3kJAsg":{"text":"The past two times I've been in New Orleans I made a point to stop by here to get some gre","useful":1,"cool":0},"J72N0tvd8-ZlD551_nMHXg":{"text":"We had a nice time at Fritzels Jazz pub.  The jazz started at 9PM but we got there a littl","useful":1,"cool":0},"CSwcRW4oTI03RD4-DUUtoA":{"text":"Absolutely a horrible experience. I stopped by the bar tonight and can I tell you I've nev","useful":0,"cool":0},"rsTF3o3tLBvuTPJkUk_jAw":{"text":"The place deserves most of the hype it has. It is cosy and well run. The music is much bet","useful":0,"cool":0},"MPPQp_JhbKESLeNtWRPpKA":{"text":"BIG fan of jazz and a BIG fan of Fritzel's Jazz Pub!!\nIf you are looking for real live New","useful":4,"cool":0},"UD7YVYbszyo0warL-wWkjw":{"text":"A visit to this little pub came from a recommendation from a tour guide. We couldn't make ","useful":1,"cool":0},"RHJ8I4gxh8cMF5paYKEiog":{"text":"I wish Fritzel's was in my backyard! I love this place!  The drinks are a bit pricey, but ","useful":0,"cool":0},"s8UE412Q_PenbTP7xB97wQ":{"text":"Great traditional jazz.  The house band is incredible; they should be playing to packed ho","useful":0,"cool":0},"Hv8k8MlV2M5Lgy22qPBq-w":{"text":"MUST GO! The jazz band was fantastic and the atmosphere is intimate and warm. We had a rea","useful":0,"cool":0},"zaKbVJr90JCmRhfR9c2PbQ":{"text":"This is probably the best place for live music on Bourbon street.  I came here 2 nights an","useful":2,"cool":2},"eMxQnxxPES_iSpkRX5oJUw":{"text":"Jumbo Shrimp Jazz Band is what gets this place 5 stars. I know I know I've been handing ou","useful":0,"cool":0},"OPh85bG-uVnPr3Q3QNLgaQ":{"text":"Ended up coming here 3x on our 4 night trip.  This place is awesome.  1 drink minimum, mix","useful":2,"cool":0},"8elrx93cw0DfFGeJRIuU-A":{"text":"Come here for the music, nothing else. THe food is quite awful and the drinks are substand","useful":2,"cool":0},"tOffKU3u8Ephcz9lhCafGg":{"text":"The band is fantastic! I bought a cd because they play a song that I am crazy love. It cal","useful":0,"cool":0},"ugK2SLQ55D93UvkH4mbb4w":{"text":"This place was spectacular! They sat us down immediately which I honestly didn't think wou","useful":3,"cool":1},"ds6KqgK4I45qP1PuSqVpGA":{"text":"This was the only place on Burbon Street that delivered the NOLA experience we were lookin","useful":0,"cool":0},"3Q-L9ukL-vb6wMAfsw-AWA":{"text":"Place is ok, a little small and they fit people in real tight. The drinks are way over pri","useful":2,"cool":0},"Z6jdOY6Pk7vT7OCrjQbIyA":{"text":"Great spot for New Orleans style jazz. House band is phenomenal. No cover. There is a one ","useful":0,"cool":0},"o0unhEYmOFmybZ9ptQ80Rw":{"text":"The hidden jewel of bourbon street, come a little before 9 to get a decent spot in this in","useful":0,"cool":0},"Q50emN4Gx-hUo4ZxJbX-NQ":{"text":"Chill intimate spot to enjoy surprisingly excellent jazz music while sipping on drinks rig","useful":0,"cool":0},"U8B1X-C8_q-gTEu1WD43BQ":{"text":"I wouldn't say i'm a typical \"bourbon street\" person, and in fact, I kinda cringed a the r","useful":0,"cool":0},"25E8hWDvg0XHh_HV7B4jmA":{"text":"I didn't know tap dancing to swing was a thing. Small place with easy seating, good ambien","useful":0,"cool":0},"_pH596B0LJK2-ZfU9b77SA":{"text":"Fritzel's used to be our favorite Jazz spot on our frequent visits to New Orleans but afte","useful":1,"cool":0},"oI-z3tCux6qlIspyw4KffQ":{"text":"This is a gem among the trash-holes of Bourbon Street. Hands down, my favorite bar in New ","useful":4,"cool":1},"2LRjPKNx84IOiFoSmTWwmA":{"text":"Live jazz music is such a nice change from the typical shenanigans that happen on Bourbon ","useful":5,"cool":2},"e1q9XX5tAhN7mbN_EcIleA":{"text":"Loved this place!!! The enjoye the live band so much that we bought the CD they had availa","useful":0,"cool":0},"wg2HY_2jHR0jLp1KXy0FfA":{"text":"WHAT A GREAT JAZZ BAR!! Had such a great time listening to some awesome jazz and blues mus","useful":1,"cool":0},"NvVjrom3rYl6LSh24DMFKA":{"text":"Loved this place! Stopped in on a whim walking down Bourbon St. and so glad we did ... Mus","useful":0,"cool":0},"kJYWI7AYo8pr-V5lWczVsA":{"text":"They had a pretty good drinks but the band was AMAZING. The guy on the piano had my mouth ","useful":0,"cool":0},"QarC_ds5mazBh3vNqUhKfA":{"text":"The reviews are dead on! The Jazz music is 5-star plus!  Totally worth putting up with Gru","useful":1,"cool":0},"Vd_IOusg67a3q_YQXgtQRw":{"text":"On our third night in New Orleans, we were growing so disappointed with the music scene...","useful":0,"cool":0},"luhz6kY_DrBnSMP_7Bikag":{"text":"My husband love this place and had talked about it since I met him,  three years ago. .. W","useful":0,"cool":0},"X2bKYplDvSd20hrNENCDew":{"text":"Very nice place to have a couple of drinks. Bartender was excellent and talked to us like ","useful":0,"cool":0},"X4vcStBjty3Xg0-qsgxEZg":{"text":"Love this place! Came just to hear Tom Fischer. He's the best and have heard him many time","useful":0,"cool":0},"tyHMveqDkeqdUER_yFWZsA":{"text":"I come here every time I'm in New Orleans. Excellent place with great music. Bathrooms cou","useful":0,"cool":0},"AkMl38vzoFHGKzDhH7QTlQ":{"text":"The band was good, but the servers and the incessant \"get a drink now\" in broken russian w","useful":1,"cool":0},"iuUHsHtE4BLNhHUFcpJPyg":{"text":"凄く近くで聞けて雰囲気最高です！大好きなお店です。\nお店の料金もとてもお安く、あとは演奏者にチップを払うだけです。是非良い演奏にはチップ払うのをお忘れなく。","useful":0,"cool":0},"ivD0DFhK8ExjZbflVJIGmQ":{"text":"Great bar, not cheesy at all like the rest of Bourbon St. Heard Tom Fisher and Friends, a ","useful":0,"cool":0},"X14htXB_RdPQRCB3cxeSJw":{"text":"We try to stop in whenever we come into town. Great music, pretty good drinks, cozy atmosp","useful":2,"cool":0},"zqE33mVBxGJD_HNj_UxuSQ":{"text":"One of my favorite memories in NOLA. there is a one drink minimum but bear in mind it does","useful":0,"cool":0},"CDNtTPPcDinsW9xAs4BVrg":{"text":"I was here for French Quarter Fest awhile back and gotta say Fritzels was my favorite plac","useful":0,"cool":0},"b5b0VzS9w14vE2gsd6h_Kw":{"text":"After eating a ridiculously good meal at Royal House, we skipped on over to Fritzels for s","useful":6,"cool":6},"qPV-tXcsE9iam-CVYlhc1A":{"text":"Im Teil mit dem größten Trubel hat sich dieses Pub etabliert, das sich dem Jazz europäisch","useful":0,"cool":1},"mLq9A0dtiJD1Pw_Al87RJA":{"text":"What an awesome place with great jazz music ... When you walk in they want you to purchase","useful":0,"cool":0},"Y3OfeX124X75DzraCy5JyQ":{"text":"This is an OK spot for listening to jazz. They tend to pack you in like sardines here, so ","useful":3,"cool":1},"4yJ6VtHaW7KfWQal0nR3zw":{"text":"Amazing jazz club, pianist was exceptional. Good drinks and higher end atmosphere compared","useful":0,"cool":0},"Aw_yKQnrqL0nDSr6WkaQ-A":{"text":"Fritzels is a great place to check out, as long as you know a few things going in...\nFirst","useful":0,"cool":0},"M663r9LgbtI5FhAhWzPbcQ":{"text":"THE BEST Bloody Mary ever!! It was spicy and oh so juicy. My friend who doesn't even like ","useful":0,"cool":0},"lTNvjL2cQA13wi-j04xrJg":{"text":"Great lively ambience and really enjoyed the music here. The place was packed and there is","useful":0,"cool":1},"_At5DB5stwChXpUds5R9HA":{"text":"This is for the very rude bartender and her alone.  On my third visit yesterday afternoon ","useful":2,"cool":0},"xG-3oHbQ1Q1xMvdH9E1AYg":{"text":"A place on Bourbon St. that has charm and actual, New Orleans style jazz. It's a lovely ha","useful":0,"cool":0},"_5Wy9d1gDAS3WdoGiX8HKg":{"text":"I love live music and live jazz! This place is small and cozy. I had a Bloody Mary and it ","useful":0,"cool":0},"EtZMyqb3OlrdzKKigsjX8w":{"text":"Just found another place to cross off my list of \"show me around\" establishments. The serv","useful":1,"cool":0},"kF1CxzIv7wlMUG9tDdLfBg":{"text":"I REALLY liked this place. This was my favorite place to enjoy a drink and enjoy live musi","useful":0,"cool":0},"Zpfhm6WwbKSh_FrLpEORJw":{"text":"We were sent here by our hotel concierge to experience a more 'local' jazz bar on Bourbon.","useful":1,"cool":0},"XFQWVE4wPgCBrRcyfe2K9w":{"text":"I have been here so many times over the years, and always have a great time! The only hold","useful":0,"cool":0},"jP5EILWrAx55I6Y_fuEpcQ":{"text":"Excellent club! Our favorite in NOLA. \nwe lucked out with the band. Excellent performance.","useful":0,"cool":0},"XQct1H_mBcaAEXqWW5_D6Q":{"text":"We stumbled in here on a fluke and enjoyed it more than I would have expected.  No cover b","useful":1,"cool":1},"_EuAch5OulME0VuxlWZWDg":{"text":"This is such a great little stop on the Bourbon Street walk. Its everything you think New ","useful":1,"cool":0},"k9A15vhN8eIolZadRj_k9w":{"text":"Even though I listened to a great band once, both times I visited here I thought the staff","useful":2,"cool":2},"Oy_md9qxOyPNFp13jiLR3Q":{"text":"If we ever have to take people to Bourbon street when they visit, this is one of the few p","useful":5,"cool":4},"yTq7HPPXl8995SJIC119PA":{"text":"Angenehme Atmosphär, freundliche Bedienumg, leckere Cocktails und Schöne Musik. Uns wurde ","useful":0,"cool":0},"_IqzvXsYJKZ4Ls8h0oz3ww":{"text":"I really cannot express how much FUN my husband and I had at Fritzel's! We were wandering ","useful":0,"cool":0},"rpAdunflfizUozc0EC0DIA":{"text":"This was probably the most fun we had during our long weekend in NOLA.  After grabbing a b","useful":0,"cool":0},"lOvBLISrEWa7uzop1CuNxQ":{"text":"Where to begin? This is one of the older venues on Bourbon street, home to some wonderful ","useful":0,"cool":0},"ilAimxNozt99Mx5C0PfqxA":{"text":"Gross drinks!! Gross! Every time we walked by there was no music playing which was a disap","useful":0,"cool":0},"OeECNLzqHCHydhm_MqNVZw":{"text":"I was pleased with Fritzel's. It's cozy, the service is friendly, it plays authentic New O","useful":1,"cool":1},"Z8NqMXifHMQ1deLsoyKa2A":{"text":"Cozy lil place with good music, benches were laid in front of the podium so the audience c","useful":0,"cool":0},"yQFnq4yLeriskEGT45Ppsw":{"text":"The band was Excellent and entertaining to watch.  We were given a seat as soon as we walk","useful":0,"cool":0},"oPIGainxvTmkyVZBy-NGDA":{"text":"This place is a little jem! and hands down my favorite place to go to in New Orleans. I've","useful":0,"cool":0},"71xXWrk-w_y_lCqU15ECVg":{"text":"Hands down the best bar on Bourbon. Fritzel's has the best music - I cannot go to New Orle","useful":1,"cool":1},"537yS4kmUEEqenH9liZ2jQ":{"text":"I love this place! Between the souvenir shops and the strip clubs you might not realize th","useful":5,"cool":4},"aUAYZB5ZyshTtpXindDGZA":{"text":"The bouncer tonight was heartlessly rude to a homeless person and it completely ruined my ","useful":0,"cool":0},"MOlKbGx2lW2-2m-PuP4weg":{"text":"I have been to NoLA often and I must say that Fritzel's is the best entertainment on Bourb","useful":0,"cool":0},"fOT53X-rzfNDPsVjpYfgqw":{"text":"If you love Preservation Hall and enjoy a tasty, cold beverage in a slightly more mature a","useful":0,"cool":0},"QyrW73SiDwXELhk-01X6og":{"text":"Our second week long trip to NOLA, and this place never disappoints. Always a pleasure to ","useful":0,"cool":0},"9Eu1E9-YIEnFPaGVLpW38g":{"text":"Music gets an A+! The Fritzel's jazz band was amazing, so much fun and wildly talented. Ho","useful":0,"cool":0},"BjOFw68sMUW5zZ3fHr8Q5Q":{"text":"Love this place. Waitresses are very attentive and drinks were on point! Music was awesome","useful":0,"cool":0},"gKCANEpGdhxsaqeWzR72vA":{"text":"Fritzel's is pretty fantastic.  It's dark and small with a ton of character and really fan","useful":3,"cool":1},"Wjs8hZss0nxhlGLG7QrsNA":{"text":"So while in NOLA and while we were staying in the French quarter I knew that we had to go ","useful":2,"cool":0},"s3FWPH-afOt7B8taR-EBMQ":{"text":"All I could think was \"meh, ok.\" The bar only had two others inside, but my wife needed to","useful":0,"cool":0},"LYBLm-uq-QO7K6x0csSAbA":{"text":"Best Jazz on Bourbon Street. Bitchiest waitresses in the country. STINK-EYE ALERT :-)","useful":0,"cool":0},"9mIbCkWj73hPcCVSCKxWlw":{"text":"*4.5 stars only because they allow smoking\n\nWe visit New Orleans a few times each year. On","useful":5,"cool":1},"cykYWU65Kf9hLIBKRm7a4g":{"text":"One of the few places on Bourbon street that didn't blow my ears out. The music was great.","useful":0,"cool":0},"efwyE46hkfvIkSJIVciiNg":{"text":"One of my best life experiences.  Had to wait about 10 minutes for the set break, but it w","useful":0,"cool":0},"H0-kMU_rzyzj-t_lRa-OGQ":{"text":"Came here on our first night and our last night.  It was our first experience with New Orl","useful":0,"cool":0},"1V35uP3DxyjLTdCWRK3Ydg":{"text":"Great place for music and a good time. The music is unbeatable and well worth the visit. T","useful":0,"cool":0},"OG0hh30JbBX5jPyqbyh1VQ":{"text":"Maybe Bc it was a Sunday night but my friend and I just randomly stumbled upon this place.","useful":0,"cool":0},"qzgEgiPDPiJ-T_DXcH71qg":{"text":"A great joint for classic jazz and a standard haunt every time I visit NOLA. Please don't ","useful":0,"cool":0},"qPyh5x8om7e_Pxi2okzUkw":{"text":"If you just want to chill and listen to some killer jazz, this is the place for you!\n\nSupe","useful":0,"cool":1},"sykcgw8YZtX-Bw_R4XxFCg":{"text":"Outstanding show! We had such a great time with a really fun band at Fritzel's. No cover t","useful":4,"cool":3},"XvDuEMlwt9qMqpnH62TIYw":{"text":"Great atmosphere and even better music!! The service is friendly and there is a one drink ","useful":0,"cool":1},"ZBgMhFkpiH7jOPCehCnmnw":{"text":"This is my favorite bar in NOLA. I come her often each time I visit. For me, the music vib","useful":1,"cool":0},"TFfAu7D6vJxp0MXyXcdouw":{"text":"This review is submitted a little later than intended... this is a great music venue to he","useful":0,"cool":0},"PhUIJgVV6qC8Zm1JWmI1kw":{"text":"Music is fun and traditional New Orleans, but the service leaves a lot to be desired.  The","useful":0,"cool":0},"df4VKqp32XjFKacsIXJSXQ":{"text":"How have we missed this little gem so many times? Well I'm excited I have found a cool pla","useful":7,"cool":7},"zjrtQ8ZFGU2TqVVSw3P8FA":{"text":"My friends and I stumbled upon this place after walking down Bourbon. It was a nice escape","useful":7,"cool":5},"-laZrBomX7VeKd22niOjhg":{"text":"Went in the Monday after Easter, was dead most places that night including here. I kinda l","useful":1,"cool":0},"LaRemjaWgbTVp8z8ZP5ULA":{"text":"If you're feeling tired from the craziness of Bourbon Street this is a great place to stop","useful":2,"cool":0},"JS6sqCp7BVixkDjHiOc9Sg":{"text":"Great jazz music in a small setting. Waitress will bring you drinks and you can sit down.","useful":0,"cool":0},"qYOtG-_JILYmvd_l1Q3HfQ":{"text":"Can't say enough good things about Fritzel's. We were there on a Sunday so we saw John and","useful":0,"cool":0},"VcJ3di3hWvE2jmKqYc4mSQ":{"text":"Definitely a must if you are visiting New Orleans. This fairly small but mighty bar offers","useful":0,"cool":0},"KQbamkDsCjMYlLI4EdYQyg":{"text":"We are not big Bourbon St folks, but we actually make Fritzel's a must each visit. The hou","useful":0,"cool":0},"cXfVzC-l9dkNern8YTWfVg":{"text":"This place is terrific!  Out of all the bad music on Bourbon Street that is not from New O","useful":0,"cool":0},"Fb7NiAuPMN0IgLDT1_HXYw":{"text":"I love Fritzels. Great music on Bourbon! The place is small but it's so worth it. The staf","useful":1,"cool":0},"IDt8OXxkUzDOmdDlN5dLWw":{"text":"Not a friendly place at all. We mistakenly, I guess, bought a drink at the \"to go\" window ","useful":1,"cool":0},"My0kj-u-T7CJJBIYdJNOCg":{"text":"Best hurricanes on Bourbon St!\nGood music too occasionally.\nNo food is served but drinks a","useful":0,"cool":0},"FqT9juH-aNUrAhbDdsS9pg":{"text":"We came in here because we were just looking for a quick hangout spot out of the hot NO we","useful":0,"cool":0},"fxMizzDsRW5B66rSuiQ3_g":{"text":"passed by this place while walking along bourbon.  there was a fun jazz band playing - 5 o","useful":1,"cool":0},"F3qdoWqbU8R39Ba0ISkNDg":{"text":"If I can give this place 10 stars, I would love to do 11! During my 5 days trip in New Orl","useful":1,"cool":0},"ZxY1G_l_werxGmewKCYZpA":{"text":"We went here twice on our first visit to NOLA. Great music, no cover charge, we loved it. ","useful":0,"cool":0},"Dvl1VpETM0dTL7k9mqip8w":{"text":"The absolute best Jazz Club In the French Quarter!  Maybe the best in Nola!  The house ban","useful":0,"cool":0},"wAZloKir2EtTP66-kXjleg":{"text":"Don't let the Bourbon Street address scare you away.  This place is LEGIT for some good ol","useful":0,"cool":0},"vq45Q3ivanjDoTC2xDUgCw":{"text":"Our favourite place on Bourbon Street. Music was outstanding and they make a mean Bloody M","useful":0,"cool":0},"w0a21cN2BzLBU2I3KFSLxw":{"text":"First, please notice that there are no four or five star reviews from people who actually ","useful":6,"cool":0},"9UNBzKC1UWJsR6IOPybE8Q":{"text":"This is the JAM!!! Literally, lol. NOLA is famous for their jazz, and here is the place to","useful":2,"cool":3},"qoYaRjh1zu0dZjDZ1Jp85g":{"text":"The music is fantastic!   Could have sat here for hours.   Can't believe after at least a ","useful":1,"cool":0},"AqZ8QCdnckUCBs6x6p0UPQ":{"text":"Katie is the GM and after we purchased our shots for our friends we were asked to leave fo","useful":1,"cool":0},"qXOSE1RwJv5ge1D2dqSnUg":{"text":"This was quite a unique experience, and not necessarily in the good way. The music was ok,","useful":1,"cool":0},"_KEIUkVV5LikT0t9KSHo_g":{"text":"This place is great. A nice break from the party bars on Bourbon street. It's a spot you c","useful":1,"cool":1},"5OXzW6CvSRUKjbOxPmgkGA":{"text":"Music very good if you love jazz!! Service not so good slow!! Drinks very very pricey! If ","useful":1,"cool":0},"8_Z11fmzVPm63l5kb6LvpA":{"text":"This is the only place I went to on Bourbon Street. And to be honest, I didn't stay here b","useful":6,"cool":8},"3Mozoon0ZDY6wxN_UFxunA":{"text":"Always a treat to go to Fritzel's for some killer live jazz.  Drinks are well made.  The v","useful":0,"cool":0},"AJh3zwykumBewfRDzomBhA":{"text":"I love Fritzels - always on my bucket list for New Orleans!\n\nNo cover, great music, and ri","useful":1,"cool":0},"Y0zHHn29IpXJW5HQQ3Owcw":{"text":"Had a drink and sat about 6 feet from a great jazz band.  This is what New Orleans is all ","useful":3,"cool":4},"k36813DWdwDtpjbWQXSQww":{"text":"Being a local, who has been living in New Orleans downtown for half a decade, I will never","useful":2,"cool":0},"_zqTsbvSNh0XugnlpDjqSw":{"text":"We really enjoy it here!  We make sure to go every visit to NOLA.  The music is always gre","useful":0,"cool":0},"QjPEyieTGRrFn1TUQoPB2A":{"text":"One of the only stops I will dare set foot in in Bourbon but it's definitely one of my fav","useful":2,"cool":1},"MvGKZazR_CEuP24-Elg0Gw":{"text":"Looks like a really cool place. Didn't eat here but got a cold Wahrsteiner to walk around ","useful":0,"cool":0},"UzoRxcuXnZ2cgG0s4KPNUQ":{"text":"I wanted to like this place but our experience was terrible - specifically the drinks.\n\nFo","useful":0,"cool":0},"7vTrtzEzlF6JdlB91xmViw":{"text":"I was here with friends this past Tuesday evening and the hostess attended to my friends (","useful":2,"cool":0},"ihKFdsFmmhTJml3nBHvcmw":{"text":"Very crowded, but it's part of the vibe. Amazing jazz music, my favorite musician is Catie","useful":0,"cool":0},"FhgQib76BQfXUHSn-lLF0g":{"text":"We were in the mood for great live jazz in a friendly, cozy setting and boy did we luck ou","useful":0,"cool":0},"6zAFWwkD85s5ecqjyXH54Q":{"text":"$5 for a bottled water for 1 of our party who wasn't drinking. Told we weren't allowed to ","useful":2,"cool":0},"Sa9HfBPbEHE1cFVZdXugIA":{"text":"Favorite place in NOLA. Even on a busy Saturday night, service was attentive and drinks we","useful":1,"cool":0},"Qg68X8x1oTboxb3qesvTAA":{"text":"Fritzel's is a must stop when visiting New Orleans and staying in the French Quarter.  If ","useful":10,"cool":12},"LsYHhz5PXh5Yn_XWn_q-kg":{"text":"Fritzel's was host to the most fun live performance I had the absolute pleasure of experie","useful":0,"cool":0},"HrBgZhRtwreDP3a3pxBtCA":{"text":"oh my goodness WHAT A GEM ON BOURBON. Fabulous atmosphere, great cocktails, music was spot","useful":0,"cool":1},"AExrgHW-8oTskRp0pxDi6Q":{"text":"We stopped here everyday during our trip to NOLA and we'll definitely be back for our next","useful":0,"cool":0},"aPSLpzx2o5ZVhc7vmhd_6A":{"text":"Way better than preservation Hall at this point.\n\nDixieland jazz played to perfection.\n\nTh","useful":12,"cool":8},"v_AqFUWnWb_h8h7O1oGFzw":{"text":"Went there with friends on a Saturday night. Half of the place has bench setting, no table","useful":0,"cool":0},"rrTVWI_PT4titMtjxTv3vQ":{"text":"Fritzel's is the place to be when you're in NOLA and if you are in the mood for some great","useful":1,"cool":0},"hAcNW-sZ2T8ERy7EfvOqBQ":{"text":"Wow wow wow, this place is something else!\n\nIn my 14 total nights spent in the funnest cit","useful":2,"cool":0},"E0VREP_7Y585Z3rTpp4fGA":{"text":"I got a to-go Hurricane down the street at Johnny White's, then left to wander down Bourbo","useful":3,"cool":1},"TV9_yS7vCPgnExlvRHnsbw":{"text":"BEST. LIVE. MUSIC. EVER. Seriously, skip the crazy clubs, go here and enjoy. Great beer se","useful":0,"cool":0},"GRFP61Qc6mwvQj9h21OGLQ":{"text":"Great music and atmosphere! My favorite place to catch music when not on Frenchman's Stree","useful":0,"cool":0},"UL8RezjcTFMyyat9Gku7XQ":{"text":"Besides going to the PH, Fritzel has the best Tradition & Dixieland Jazz in the French Qua","useful":4,"cool":5},"H4NyrLQCnRp_lhpZqeOljw":{"text":"If I could give this establishment a no star I would. We arrived to a packed house with an","useful":3,"cool":0},"ue9TSbrBkd3S3nscHycaZA":{"text":"A treat on Bourbon Street of all places! I have an instinctual aversion to Bourbon - if I ","useful":0,"cool":0},"aoq1XSk_Kple6pG6zdxqqQ":{"text":"A small jazz pub located on Bourbon Street, it doesn't have the cheesy Bourbon St. feel.  ","useful":2,"cool":2},"HRi9FTnGtpxt_PguQgmX-A":{"text":"A a tourist out in the district, I stumbled upon this place through a friends recommendati","useful":3,"cool":1},"UoTCB_fuXgsO65CvPHO1Nw":{"text":"Fantastic place. The musicians gave it all to the crowd. Very skillful and great handling ","useful":1,"cool":0},"FfkVO8PMN1Pb7vhz-qnqOg":{"text":"Super Jazz Kneipe mit deutschen Wurzeln. Die hauseigene Band spielt super, allerdings eher","useful":0,"cool":0},"TBO9MhC0hkaykRN2wgWd8w":{"text":"Amazing live music, service... hummmm... so so.\nThe female bathroom door don't lock, heheh","useful":0,"cool":0},"UW-zyKvpuEbuELbnbM-RKQ":{"text":"Great jazz... this was the only jazz bar that I spotted on all of Bourbon St (granted, I d","useful":1,"cool":0},"uAngDyzsSsE7an0vW98odA":{"text":"Had a great night with friends here! It is cozy with tables and chairs all close together.","useful":0,"cool":0},"E01iJy4evr1f1Xu6bbjePg":{"text":"In love with this place. Nobody in my party drinks alcohol, but the servers were more than","useful":0,"cool":0},"ZxP-h6-QQHCcgj4dVkz5pg":{"text":"It would be 5 stars if the band wouldn't advertise their $20 CD after every other song, sp","useful":1,"cool":0},"au4M-V9KPmkM9l4pELQ-fQ":{"text":"This bar is over priced. The music is great but the staff appear to be stuck up snobs...no","useful":1,"cool":0},"1d8uMtedcAwbf59ab1VheQ":{"text":"Holy cow! A few friends told me about this place, but I was still a little skeptical, beca","useful":0,"cool":0},"HdIYwJyk9Z7QMWrp4IQL4Q":{"text":"To be real, Bourbon Street is not my cup of tea...but Fritzel's Jazz Pub totally is! It's ","useful":6,"cool":7},"agcNJJkdxjVcdhFN8LFxTg":{"text":"This was my absolute favorite place for good jazz on our trip to New Orleans. I was appreh","useful":1,"cool":0},"zpHFjXxExB2TrBDcPoWjJg":{"text":"May be my favorite bar in town. I kept gravitating towards it my whole vacation! The ambia","useful":0,"cool":0},"4O_BhG5cYWmtf0y1S1Hnrg":{"text":"Neat little jazz club with live music. Would definitely come back here when in NOLA. This ","useful":3,"cool":0},"E8HK3ZNCaEMrgU_S7IKtGQ":{"text":"My friends and I wandered up and down Bourbon Street trying to find the kind of New Orlean","useful":2,"cool":1},"gL_fnbyhpRnOZkCnKflV_g":{"text":"This is the nicest pub on Bourbon St, and it's the only one I will ever spend any time in.","useful":0,"cool":0},"BkKcy_hJAN4BUEVp9kdxMg":{"text":"DO NOT GO HERE UNLESS YOU ENJOY GETTING PUNCHED IN THE FACE BY THE EMPLOYEES. We were allo","useful":0,"cool":1},"nttjKKAlovFmwYkPxQAbfg":{"text":"no music til 730. cigar in the back alley porch. all good. not sure if there's a balcony o","useful":0,"cool":0},"tKM5qKVmzaaFSaeHu64g5A":{"text":"A nice change of pace from everything else on Bourbon street. Me and my boyfriend came on ","useful":3,"cool":3},"-GZ769hpJekLYubAjAsGQg":{"text":"Yes there is a lot of good music in NOLA. But there is not a lot of Dixieland.  There is v","useful":0,"cool":1},"Iv9eAwbKOXXr3m4oFJJ9dA":{"text":"People have to remember traditional and specifically German seating is panic tables to soc","useful":0,"cool":0},"FajHjAetDlZ6mv51-0SCAw":{"text":"This was what I imagined when I pictured coming to NOLA.  Small club in a well worn facili","useful":0,"cool":0},"pi7PTwVSKdKTZ-6mmVq1zA":{"text":"Get the hurricane, it's strong as fuck and it'll get you lit, get there early for a good s","useful":0,"cool":0},"OWIErsQG0o6GtCnNmP3bXQ":{"text":"I first set food in Fritzel's in the late 1990s, and I go as often as I can. They always h","useful":0,"cool":0},"OsTbINc9A7fYVpfIyllgKg":{"text":"Pros: \n- Great music. JAZZ! \n- Great atmosphere. \n- Genuine people. \n- Legit NOLA feels.\n-","useful":7,"cool":10},"rSnyJh0ii3vlHkeMrmXfTg":{"text":"I have been to many corners of the Earth, from Africa to Asia to many poor towns and party","useful":0,"cool":0},"3iQkwkL6z3CaIPPDuCTc8w":{"text":"If you are in the French Quarter, this place is a must. Fritzel's offers authentic, live j","useful":7,"cool":7},"ufy3u2g8oQh1j11MwPVQzw":{"text":"This is the best place to hear New Orleans Trad Jazz.  However the place is not big, and h","useful":0,"cool":0},"LgCuXxkiP00zuQT31tafqg":{"text":"We've been coming here for years, since my 40th birthday in 2014. My wife hates live music","useful":0,"cool":0},"4yhgmsePXAGn3g50Vd5Dnw":{"text":"We happened to share a cab with the manager and a bartender from Fritzel's on the way to t","useful":5,"cool":8},"vjNIiaupcLxRlZ3c8ufy0w":{"text":"Absolutely obsessed with this place. The bands are incredible, the bartenders are attentiv","useful":1,"cool":0},"4VOhUgr9GTuL1X-8v5CygA":{"text":"Located on Bourbon Street, it's a small intimate pub with an old school feel. A hostess gr","useful":7,"cool":6},"45jADECx8RsUm5soIi9FNQ":{"text":"Fritzel's will be the reason we move to NOLA  Excellent bands all night and reasonably pri","useful":1,"cool":1},"2NlGzl0-LIzNTGFARc2Bdg":{"text":"Richard Scott is absolutely amazing!! Came here twice during my stay in New Orleans to hea","useful":1,"cool":2},"V6bWqkcpCA1GqdEXxOv8Cw":{"text":"I think Fritzel's is my favorite place to go for live jazz. It's one of the very few place","useful":3,"cool":1},"vGU-_GlRHdj7thXQlc3fvw":{"text":"I agree with most of the other reviews of this place. You go for the Music!!!!! Staff is n","useful":0,"cool":0},"LeUC6sjCcLvNaZG-AMP-Cw":{"text":"If I could give this place 10 stars, I would.  We walked by one night and it was totally d","useful":0,"cool":0},"pFj1F0og9PWpNJOVUed4Dg":{"text":"Mike is the coolest dude in the world. If you're lucky enough to have him make you drinks,","useful":0,"cool":0},"n6bVNgYnsKdIMsX5qitHHg":{"text":"What a great jazz band! \nSo, first Saturday after Mardi-Gras, the first time New Orleans a","useful":2,"cool":1},"dpxB6OSeezAUIBiIts7WvA":{"text":"City wide, I'd give Fritzel's a 4, but Christ, if i could give it a 6 relative to the othe","useful":1,"cool":1},"CfKmQ8NDCuRDOtijtQ_bmQ":{"text":"Hands down the best place for great Jazz, cheap and nice drinks and NOLA vibe in French qu","useful":0,"cool":0},"UR--PCXDXX96wEKaz90T_w":{"text":"Music: AMAZING!!!  The band was incredible- each and every musician surprised us with thei","useful":1,"cool":0},"jXIjtQAwNzZ_OeivPGmfqQ":{"text":"So much fun. The Jazz band was so good and fun. 1 drink minimum and the prices are average","useful":0,"cool":0},"XQqZ0kjnwwd1V6o7Cl8CnQ":{"text":"Smashed in with the endless bars of karaoke, cover bands and strip clubs,  Bourbon Street ","useful":7,"cool":3},"yvGrAqOHwLj3WbsrKBBiyQ":{"text":"First time having a Hurricane!! Best drink so far! So good on hot day! Live music later - ","useful":0,"cool":0},"0MK5o3d6F7zABCAHmP1p-g":{"text":"YES! You should absolutely check out this place when in NOLA for some Dixieland jazz. It's","useful":0,"cool":0},"rqVhtqREuqaiHjO62laaYQ":{"text":"Aside from the Spotted Cat Music Club on Frenchmen street, this place is the only other on","useful":2,"cool":1},"yMGTS3YrCmNAP3OgkFzixw":{"text":"I love this place so much.  So different from everything on Bourbon Street. The music is m","useful":0,"cool":0},"vh2JomHuXxjSvhwSvwQ12A":{"text":"Bartender Claimed her OWN tip on my card--\n\nOther than that, I really enjoyed this bar. It","useful":0,"cool":0},"4VIOwsu6xBktuIisZyUDtA":{"text":"Google search \"Best Jazz Clubs/Bars\" and you'll certainly come across Fritzel's European J","useful":13,"cool":7},"LF7AJAR5gOoBh2cnn0AJvA":{"text":"Amazing time  listening and watching the local bands play. The atmosphere is romantic and ","useful":0,"cool":0},"ij-FyEN1q5XHiw7rGiIyAA":{"text":"The music was good, I'm very very disappointed, I will never go back I was with a friend s","useful":2,"cool":0},"NOCCOrnYbvW1zeEkXVC3Fg":{"text":"Nice jazz music. Rude staff. We sat with my family oThe waitress approached to us offer us","useful":0,"cool":0},"z6kYoyWPye33b5Wo9lfq8w":{"text":"Awesome service, awesome drinks, awesome music!!!! Visited here during spring break in New","useful":0,"cool":0},"StUkfpFzZsY_-RR_byoCDg":{"text":"WOW!  I didn't even know I liked Jazz until my daughter brought me here.  I felt like Mia ","useful":28,"cool":26},"m5e5cSqOkkU5m_d4tBDsHg":{"text":"We went to Fritzel's on a Monday night, deliberately picking a slower night.  We arrived h","useful":8,"cool":0},"x2zpmrXOZH6Rb94tjPOfGg":{"text":"Only place on Bourbon we have found with jazz music the past two week nights.  No cover.  ","useful":0,"cool":0},"QFdqdJO7y0l-aOviBw_ffg":{"text":"Came here looking for a spot to listen to jazz music & get some drinks and it couldn't hav","useful":0,"cool":0},"L8kE4ntDzxyE0ig4_hqhCw":{"text":"The private speakeasy upstairs  \"potions lounge\" was so cool ... 3 years ago when i discov","useful":0,"cool":0},"NFpRASNn86OM0cjNv_V5JA":{"text":"The vibe is chill. Jazz music is great. The drinks are strong! Definitely check out the ol","useful":0,"cool":0},"apKbDSrSFEXkWU0YoBg1sA":{"text":"Uh if only I could be in NOLA once again, listening to  the beautiful voices and a drinky ","useful":5,"cool":3},"I5XjQDG5tVORCSrIwPE4fg":{"text":"I saw other reviews discuss the drinks. I didn't notice. This is the only real Jazz bar le","useful":0,"cool":0},"oGBL65SaV28kECzUcKHA5A":{"text":"Fritzel's is a fabulous spot if you like the live Dixieland-style jazz of old New Orleans.","useful":4,"cool":3},"bD_GAqDUhNh02WXj9HB4fQ":{"text":"I try to visit Fritzel's every time I'm in NOLA. Have a drink or two and enjoy the music. ","useful":1,"cool":1},"T3mE3aMSNCnhcRT1tDvt5A":{"text":"The music was great but the service was beyond horrendous. \n\nReally terrible attitudes, tr","useful":3,"cool":0},"jbvhSCn6LRWfW6s1XZ36vA":{"text":"This place has the best live jazz in New Orleans.  The drinks are a little expensive, but ","useful":0,"cool":0},"P5Q0fxZIaBhUW7jYjA3neg":{"text":"I'm so glad we walked into this place! Band was so fun and you could tell how much they lo","useful":1,"cool":0},"AmpmwRIL_K7EzFlqNa0f7Q":{"text":"Came here on a Monday night\nFree entry\nDrinks were not overpriced\nGreat atmosphere\nAnd eve","useful":1,"cool":0},"IzdRHEZaIhZLspfGmP5Uow":{"text":"The purée of music from seventeen different sources garbles together as you walk down Bour","useful":2,"cool":2},"qAFjAOiglKnslvRbi7_HvQ":{"text":"if this is your first time to New Orleans (like it is for me), go here! They have great ba","useful":0,"cool":0},"wekS-4DkkPwkgybRNDT76g":{"text":"Do not go here if you're black. They make it very clear they don't want you there and it's","useful":2,"cool":0},"w5uurMKsI9NzPOfgEz485g":{"text":"I thoroughly enjoyed my time at Fritzel's, especially listening to their All Star Band. I ","useful":0,"cool":0},"ZonWvPuCuMzGLhI9l3vwbA":{"text":"Likes: The music.  As other Yelpers have mentioned, this place is great if you want to lis","useful":1,"cool":1},"70IHXGJD9_1UPV-syzbqeg":{"text":"Jazzy good times in the close comfort of great music and good friends.\n\n  If you spend muc","useful":5,"cool":3}}