{"Vl10f44IL61N4bPk7gJHsQ":{"text":"Great place to catch great rock and roll. I recommend hitting this place on a weekday when","useful":0,"cool":0},"F2oZcZgp_E40Tnw1wiRX9g":{"text":"Great place to dance, any night of the week!\n\nB Street Benny (the house band) was awesome ","useful":0,"cool":0},"WOQAhnMW0lmVlXdI8JUyWg":{"text":"Only in NOLA can you drink your way down a street stop into any bar such as this and rock ","useful":0,"cool":0},"CZ9FQtcFhB5LrPGj_Ug8uA":{"text":"Fell into this bar when the bouncer said \"everybody's already in there!\" We already had dr","useful":0,"cool":0},"OrVLxhtxbTxM3f1oBAaJ-w":{"text":"My friends and I liked this place. Great music, the drink prices weren't bad and there is ","useful":0,"cool":0},"51TpbV3Bz-jMLMMNyFLZ6g":{"text":"This bar is a complete and stupid mess and i LOVE IT is disgusting, and crazy, and FUN! Ta","useful":0,"cool":0},"C2MyzKmqfUBtB61Yt5xE5w":{"text":"This bar was fun, the lead singer of the band (petite) small lady along with her band has ","useful":0,"cool":0},"E8YkeclnFLCLjq6vOqC-ug":{"text":"Went on a Saturday night. I guess it becomes a dance club on the weekend. It was decent mu","useful":0,"cool":0},"Z-li06lzO0KDngvwMzw3rg":{"text":"Coolest place on Bourbon! We went multiple times over the weekend we were visiting. The gu","useful":0,"cool":0},"Fmv6EFIqfYNCXy4GWHn8Pg":{"text":"My girlfriends and I were in NOLA celebrating my bachelorette party and we happened to stu","useful":0,"cool":0},"s42_5PIOINlvXPHx97g8yQ":{"text":"The balcony access is free! But the the drinks are hit and miss depending on the bartender","useful":0,"cool":0},"U3Tip5R3QMLilLcgC-CLcQ":{"text":"Brilliant place and brilliant music, but beware of the bar staff. We were there on Monday ","useful":0,"cool":0},"o21kQhU6g7IPfLg8cgBQVg":{"text":"Bourbon Bandstand is a great place to spend some time listening to great music and having ","useful":0,"cool":0},"ltP0wWDwUyZV_cDCzeMCfw":{"text":"Friday night. Heard some \"Party in the USA\" playing, saw the dancing people inside. We hop","useful":0,"cool":1},"IAkQeGKz0Bizu8oITlyRlw":{"text":"Awesome lil spot in nola with good music.. A must see spot for good live bands & booz!","useful":0,"cool":0},"t9x7zgelBRRGzO29a3O9tg":{"text":"We loved the band there. Some how we ended up there every night! They could probably use a","useful":0,"cool":0},"i22cRwhm0iJDVKXyvgCbGw":{"text":"This is my favorite place to watch a band in NOLA! Will be back when I'm back in town!","useful":0,"cool":0},"WOwx0_SE1KRrrbrszto6CA":{"text":"Good for dancing. They sang more recent and / or more famous songs that the average person","useful":0,"cool":0},"YbThmB970ZD2h4ytfmbPAA":{"text":"FUN FUN FUN!  The band, the staff and atmosphere is what you would expect in New Orleans!","useful":0,"cool":0},"6HdlDmpc6aUTldudVNF0tQ":{"text":"The only reason that I am giving this establishment one star is because I have to. In a nu","useful":4,"cool":0},"dwwueXg-APeuRxRDZ59i5A":{"text":"My wife and I have been to this place several times on our trips to New Orleans and we lov","useful":0,"cool":0},"bkqbGikbR2llAsPIxdsgUg":{"text":"Who is the tiny blonde with the BIG voice?  Dang that girl can sing.  Trumpet player also ","useful":0,"cool":0},"xn8CMvLZFtuMJOTgLvlnbA":{"text":"We were lured in by the sounds of an amazing cover band that was rocking out throwback jam","useful":1,"cool":1},"IM_qF3E_j52_GoUr4oZPCg":{"text":"Walked into the bourbon bandstand for a 2 for one happy hour and got charged 26.50 for a h","useful":2,"cool":0},"2DobGedbj-rbg67bV1KDgQ":{"text":"This place has the worse bar tending service in the world. Upstairs bartender ( 5' 10\" red","useful":2,"cool":0},"biL6OelcCGXRPvh9IwCthA":{"text":"These people were ungodly rude. I was sitting at the bar with friends not doing a single t","useful":0,"cool":0},"PP2DHaNbjFOH24BXk0aysw":{"text":"Watch out at this place. Depending on which of the three different bars inside you order f","useful":1,"cool":0},"A0_2kGQO-U9U5ljAFlrsEA":{"text":"I will start this by saying the live music and vibe is awesome.  The only reason this plac","useful":1,"cool":0},"UObTUYpz2ZXKjvJ52xmiEQ":{"text":"If you're the type to chill and watch some great bands this is your spot! I will be back w","useful":0,"cool":0},"WdqfxAwEcftA4t1nTbgreg":{"text":"Good music!  But drinks are average and they charge extra for water, even if you order mul","useful":1,"cool":0},"x-k_6AcAU3PGvvQJPslQqg":{"text":"DO NOT GIVE THIS PLACE YOUR BUSINESS. I was assaulted and shoved to the ground by the mana","useful":2,"cool":0},"8VG8Zn6sUWs37mnEaO34Jw":{"text":"The best party plane in the French Quarter. Dixie Heathens and Chicken on the bone are the","useful":0,"cool":0},"djKMP1zoJnXYN9nPoqKgzQ":{"text":"Although they had some great music, their waitstaff is rude, the bathroom attendant is a t","useful":1,"cool":0},"dgn1gJfjYxgCnnLAsQC3yQ":{"text":"I had friends in from back home. We of course take them to bourbon street. We see this clu","useful":2,"cool":0},"AWetibOcpkhSIPCQHFrBLA":{"text":"While in NOLA this past week we frequently stopped in for dinks and to listen to the live ","useful":0,"cool":0},"hZalcIipvHHNKkPy1P5xcw":{"text":"Service was great!  The band was the real draw, until I had to use the bathroom.  There we","useful":1,"cool":0},"EoQ9rWqoDh3kmlN5xZB61g":{"text":"Just leaving this place. A fight started between two guys and one hit my friend during the","useful":2,"cool":0},"9LwDTuAsaByfteQbkVw2gQ":{"text":"We were celebrating my friend's engagement, my friend kept taking those tube shots that go","useful":3,"cool":0},"cPuoDbSUGhUTUfe1zdShrQ":{"text":"Stopped by this bar 3 nights in a row and each time a really great band was playing. The s","useful":0,"cool":0},"xH8Dyj-cqS51a-aicOUB4Q":{"text":"Worst bar I have ever been too. Ugly bartender with grandma glasses reached across the bar","useful":0,"cool":0},"42Di7pByApf3Z-vTbTUXUQ":{"text":"Cool place to people watch. OK priced drinks and you can go upstairs on their balcony to s","useful":3,"cool":4},"dEBCllnh3EuxWEqXgeKBgA":{"text":"We were here last night and downstairs was wack but upstairs was legit af.  The bartender ","useful":0,"cool":0},"Gg1S2XYr7SSFiGe_jqfayg":{"text":"Great spot for after dinner drinks and we were fortunate to find a spot on the balcony bec","useful":13,"cool":11},"Yl6oagwK7CkjuhPFPGlN8Q":{"text":"Waited patiently and was extremely polite also tipped well and was given all club soda whe","useful":0,"cool":0},"cnCz9LDD8pOz3BVqanwhyQ":{"text":"Charge $3.75 for a cup of tap water, this should be illegal as it contributes to alcohol p","useful":4,"cool":0},"Tk46hVF2xgWhe_jDCjufhA":{"text":"Mannnnnn i had a BALL! We went early during the day and also during the night. From NC and","useful":0,"cool":0},"pKk6GzgEtBjUqai6WM0dMw":{"text":"We visited twice during our stay here. Thursday night was definitely our favorite. There w","useful":0,"cool":0},"aKFhfntj6LMizbgxciudiA":{"text":"The music was great. The service could defintely use some work. The bartender was irritate","useful":2,"cool":0},"4fhW2dvvhdo0k7esgowMcA":{"text":"The bouncer was nice but the bartender....\n\nBasically this blonde lady bartender kept igno","useful":1,"cool":0},"LysvIOP9rhQ3gSxFRiY6tA":{"text":"Prepare to band\"STAND\" for an hour to get your Bourbon. \n\nI didn't get her name but the bl","useful":2,"cool":0},"f7Rr2aubuJOv9ADLOuMDjg":{"text":"I came here to celebrate my 21st birthday. My first impressions of the place were great! T","useful":0,"cool":0},"GjWKRGE2gm64enkF_9Z0fg":{"text":"If I could put 0 stars I would!!! The security guard denied me and my friends ID and said ","useful":1,"cool":0}}