{"uR1XheNY6H8Gqsruqbcemg":{"text":"I was in New Orleans for the SEC tournament (Go Big Blue!) and my wife and I had an amazin","useful":0,"cool":0},"lRQO3DYSH2zOhaSByawkAQ":{"text":"Very cool guy took us around named Josh! It's a really cool way to see the city. Fun and w","useful":0,"cool":0},"EBRZQ5NJS0lC6yVpLxCerQ":{"text":"Now this is what I'm talking about! I was caught in a pinch for the Barkus parade. You kno","useful":10,"cool":2},"i7vtQeYsltNFtpP-s_77Lg":{"text":"The novelty is neat, but a 5 minute ride (20 minute walk) was $23.00. Wish I had known tha","useful":0,"cool":0},"VlN6Aa4pQWPTuT08P1A6eQ":{"text":"For a wicked good time, call Thaddeus.\n\nHope we get to meet you again before we leave to o","useful":1,"cool":0},"x3Nnh3gRcDY19bT1B3g9eQ":{"text":"We used Need a Ride NOLA twice last week. NOLA French Quarter was crazy last week and\nwe w","useful":0,"cool":0},"UsAv8Y0QsvOA_pW2uii1RQ":{"text":"I would give Need a Ride a zero star. Horrible! As a local I do not understand why I was j","useful":1,"cool":0},"95RoKi-t2Egattmyg_9mwQ":{"text":"Kevin and Hillary took our group around town and they were AMAZING! We had the best time w","useful":0,"cool":0},"P0SI8XcEkVG67vFzDUC4Bw":{"text":"I came to Yelp to post a favorable review and was quite surprised to see negative ones. Th","useful":3,"cool":0},"LOKl7IJnRt9GjWSp2AKGsQ":{"text":"Need a Ride is the BEST thing to ever happen to New Orleans!\n\nBeing disabled, they catered","useful":1,"cool":0},"t6NPXDVVxxFOEavLH3by5Q":{"text":"We used this service to return (part way) from Jazz Fest. We had walked around a mile and ","useful":1,"cool":0},"NYF70DUZ6f5W8SClCv4IpQ":{"text":"Usually take a regular cab from my hotel to where ever I am headed, then a pedicab back.  ","useful":0,"cool":0},"1ZD6siwRlgbJEtt2cJB4Rg":{"text":"Hello, I wanted to inform you that you have very unprofessional operators. On yesterday ev","useful":0,"cool":0},"LSvy77KQiwX_d0LnO-b6JQ":{"text":"Calem was great, Picked me up and got me to the Superdome in time for the Saints game. The","useful":0,"cool":0},"JbBYkyAeaftdMrWm-QlhKw":{"text":"I was picked up from the Goldmine in the Quarter and brought to Walk-On's. The guy peddlin","useful":3,"cool":0},"WFWrpJEi1Wk7lPahliWJVA":{"text":"This one pedicab charged us 20 bucks to travel from Jackson Square to Saks. What a load of","useful":0,"cool":0},"ufikXX35togkU2SPdhnPyw":{"text":"Wonderful way to see NOLA! I rode with Michelle K and Sara. Both ladies were awesome. We e","useful":0,"cool":0},"Shvyc4hT1SQf6ZopqYDzjw":{"text":"Had a bad experience with this company.  Suggest you agree on a firm price before stepping","useful":2,"cool":3},"3clCYA4Q-1dkWsuIhkVOUg":{"text":"Resided in the Maritime for the past week recovering from knee surgery.  Used these guys t","useful":0,"cool":0},"7wf6MiFNxrY0VJkg5vtKRA":{"text":"A great way to get around New Orleans especially during Mardi Gras when many of the street","useful":0,"cool":0},"lrTMBosWg5t3GRN3-8okUQ":{"text":"Called dispatch for one of my guests in the CBD and, as promised, a pedicab arrived in les","useful":0,"cool":0},"wjYso2QO5LiPWCo904t-Yw":{"text":"At $2/block, it's best to negotiate your fares before you jump on.  It seems that when the","useful":2,"cool":2},"YgiC95xOW-7B6vGmoA5wVA":{"text":"On Fri., June 22, I took Need-a-ride Pedicab to a friend's.  Upon arrival the driver said ","useful":0,"cool":0},"k-B9MJuv1cFtSiqPH43ANg":{"text":"My wife and I were in New Orleans recently and after walking all day and in to the night n","useful":3,"cool":1},"cmEtj4tO2BSaYk2fq5DSNA":{"text":"Kevin and Hillary are the best! They made our tour around NOLA so enjoyable. It was just l","useful":0,"cool":0},"D-dGMz4GSpris5w_R7x96w":{"text":"WOW highly recommend, 10/10 would ride again, you absolutely will feel like a prince/princ","useful":0,"cool":0},"1FBqk5_V8Fsa4cExbF1YNg":{"text":"We had a second line for my son's baptism and needed MANY pedicabs for some of my elderly ","useful":0,"cool":0},"08SXPd_GljbgYi0pSvwSlQ":{"text":"I have worked with Joe for several jobs. Last night, Joe and his team were hired for a wed","useful":1,"cool":1},"nCVmz5z5m8mLshpSZZSaBA":{"text":"We used a pedicab for the first time today. The rider was a pleasure and knew her way arou","useful":4,"cool":0},"BcnIIiLNIeetKrz_KYUTkg":{"text":"Driver was 20 minutes late, over charged us, not at all worth the $$. I kept looking over ","useful":1,"cool":0},"0JZa6-HALalJQJrbOXrvsg":{"text":"My sister and I had landed in NOLA and me with a broken knee wanted to see downtown withou","useful":0,"cool":0},"W20Q9MiZK44Vz0oMnO4Bew":{"text":"I had to write this as soon as I got home so I didn't forget to TELL EVERYONE HOW AWESOME ","useful":0,"cool":0},"ROOrNcncTmYwYOqA4xmXCw":{"text":"What a coincidence, the best driver there is named Rick Shaw! He is very funny, profession","useful":0,"cool":0},"yJ0n2q8yf6xeAbyxd0fJHg":{"text":"Josh was awesome! He gave us recommendations and was very friendly! I definitely recommend","useful":0,"cool":0},"PWbf6WAKxS92OhqzpqCiQg":{"text":"The best way to get around NOLA!!! We got to enjoy the beautiful city and views on our way","useful":0,"cool":0},"zYfZLAZvpJ2_ApD05wJZvQ":{"text":"WARNING: VERY EXPENSIVE! $$$  We paid $20 a couple days ago for a pedicab ride for 2 of us","useful":3,"cool":1},"__3tq2GlvEVy1jTuMfH2PA":{"text":"This is MONTHS after the fact, but my experience with this company on my wedding day Novem","useful":0,"cool":0},"8wNM2nHu5NjIyh0rNe68Cw":{"text":"We were there in March 2017 and wanted a easy tour of the city with some fun. Carriage rid","useful":0,"cool":0},"2zMpwmpDtQzgngCw7wS84A":{"text":"Josh was an extremely friendly and entertaining pedicab driver...the ride was enjoyable...","useful":1,"cool":0},"thLS880QuDQLrgfbFN61sA":{"text":"We had a ride with Joshua down Bourbon Street.\nThat guy was just extremely friendly and on","useful":2,"cool":0},"cU0mVX6O-ULzwEcvWyxBBw":{"text":"If you are NOT  Black, Spanish or a person of color you should be fine. I am a paying cust","useful":0,"cool":0},"wJSYTvw2a1JDDXTvjsUgBA":{"text":"My wife and I recently spent 4 nights in NOLA and had the GREAT fortune of taking one of y","useful":0,"cool":0},"FSYw7mU4kBTs9BJ2XvPMWA":{"text":"We got picked up by a Need a Ride pedicab while in transit between hotel and restaurant, a","useful":5,"cool":1},"nq4WMsY7xO0Uta2K4gp39g":{"text":"I used Need A Ride Pedicabs in New Orleans, LA on 4/15/2015.  It was the 1st time that I u","useful":3,"cool":2}}