{"1d7D46qXP-PO9AYYY0sJ1g":{"text":"Don't cheat yourself. When we come back in town we make sure we get a po-boy from here. Ou","useful":0,"cool":0},"YlArBn5CN7AKIcUl4201Xg":{"text":"I come here all the time but never reviewed it before for some reason. Their boiled seafoo","useful":1,"cool":0},"IgPTtUJWoajMk9MM_o1dvg":{"text":"Man I been coming to this place since I was a kid! Truly some of the best seafood in the e","useful":0,"cool":0},"aDzB4kfjgs0qjio42f-SBg":{"text":"Some of the best seafood in the city.  One of the few places you can get your food cooked ","useful":0,"cool":0},"R-4v5oBXyNalLaHwHYOH7Q":{"text":"SEAFOOD/POBOY HEAVEN!!!! The only drawback, it is ALWAYS crowded with lines out BOTH doors","useful":0,"cool":0},"Riw_zXXcwzKz-Kxqtm1Nuw":{"text":"This place was awesome filed with locals and the nicest people ever the food was good and ","useful":0,"cool":0},"RTdMt0y6-Zf4QMSF5HFcWg":{"text":"The oyster po-boy was pretty good for a Saturday afternoon after getting stood up by a cus","useful":2,"cool":0},"VzyjoVbHehbakgx3YxPTSA":{"text":"The shrimp sandwich was good but severely over priced!!!! Small ass sandwich for 6 bucks..","useful":2,"cool":0},"4RdBNOCHynXMYGYm7w4Ifw":{"text":"Excellent food and service! Kent you are awesome....we appreciate you taking care of us. I","useful":0,"cool":0},"Wrzk_kbFIPA0q0_fITAudA":{"text":"This place was so goooooood.  They are only open til i think 6pm, so get there early.  The","useful":0,"cool":0},"-OnqNg8bxe4zIJEGHS3Ivg":{"text":"Excellent shrimp poboy! had a great coating, perfect seasoning. the staff was very attenti","useful":0,"cool":0},"biEERpDCmruOHO1N0LNaJw":{"text":"So good.  Get the combo po-boy - Oyster and Shrimp are amazing, and the crab cake thingies","useful":2,"cool":2},"hr1Ufj0ujt4RqlSq6LC9xg":{"text":"The best place for boiled fresh or fried seafood in New Orleans.","useful":4,"cool":1},"YEKZDoo_tBJh2qcHp40MvQ":{"text":"Well, sometimes there are tourists here, but we tried to blend in!  We came from San Franc","useful":0,"cool":0},"YZIiJSj9OYR4-JgW21Y9qw":{"text":"Great place to grab some crawfish for a party, fresh fish, or a quick snack. Friendly staf","useful":1,"cool":3},"MdFGm1tSNeiqeQAVk_MiJg":{"text":"Its like a pound & a half of shrimp in this poboy!!! Sooo fresh & filling. I could only ea","useful":0,"cool":0},"LFp9J4yVhD97Jn4TcGXzxQ":{"text":"I am not from New Orleans but I come down every chance I get. Castnet is ALWAYS my first s","useful":0,"cool":0},"cEXWhbLqBAmjt0gyZOSk3Q":{"text":"Good food and great portion sizes. There's alway a line which is an indication of how good","useful":1,"cool":1},"tAavpvIYMcp0ZHFllbEaIA":{"text":"This place is incredible, forget all the tourist attractions, for real authentic New Orlea","useful":2,"cool":0},"Qk5Vv8ofF2XgwRJCeWdz-A":{"text":"What made me fall in love with New Orleans. Met a girl out of town in school and this is t","useful":0,"cool":0},"KuWZ_TB_7qU9awFHEbdmxQ":{"text":"This place stays packed, local favorite poboys are overstuffed well seasoned. Definitely a","useful":1,"cool":1},"3me6vzT43PyQq-iKmGMxOw":{"text":"I love my parents, I really do.  My mother carried me in her for nine months, my father ha","useful":1,"cool":1},"6UIhqbsHVvvkL5F2yhbtJQ":{"text":"This the best seafood spot in new orleans east and probably one of best in the entire city","useful":0,"cool":0},"uDFbBDsBCNgDFxpa2sRO8Q":{"text":"If you want seafood done right, you need to go to Castnet. This is a family owned operatio","useful":0,"cool":0},"Wd9yUx_2tzdqKBpbF44pag":{"text":"I've always loved their seafood; but today my wife bought me a cold roast beef po-boy!! It","useful":0,"cool":0},"Oa8KqgNTrrc2nLIDiTYdLw":{"text":"Neat little seafood, sandwich shop.  Very busy.  Freshly made so order so a bit of a wait.","useful":2,"cool":0},"zIhzlwNhLpazhRgBiQebzQ":{"text":"A New Orleans East institution! I was raised on the seafood they sell here, every family c","useful":1,"cool":2},"cfF8M4eme3XNSw1QGoJPRA":{"text":"The crawfish were seasoned really well. Less salty than most and a bit of a kick. Had a do","useful":0,"cool":0},"vYja6hAao9Md06YVM8c7jA":{"text":"Who wanted crab-stuffed redfish for Thanksgiving? Who was crazy enough to haul to Castnet ","useful":4,"cool":4},"6Os1m6m5kxZumbeXcYl6Cg":{"text":"Love this place! Got off early from work and drove all the way to New Orleans East. The cr","useful":3,"cool":0},"ywb4SmdbRvViJ6LkZzJ9Ig":{"text":"Tourist read this!  Go here, get a number, wait, order CORN, shrimp and crawfish. The corn","useful":3,"cool":1},"pc8q_9lGxfLpdzy1ZnqNlA":{"text":"I had the best oyster Po boy and shrimp Po boy here.  I would say the best in New Orleans.","useful":0,"cool":0},"HC36shQXSh54V3ljy329XA":{"text":"Castnet has always seemed like the place to be if you looking for freshly made , lemon zes","useful":0,"cool":0},"RrJlhJW0p0_1TQxtRglWMA":{"text":"Crawfish review:\nI'm generally hesitant to eat crawfish that has not been prepared by a fa","useful":1,"cool":2},"l5QzQqSkLGJaXRAYjhZa3w":{"text":"They're fried catfish and shrimp platter are So Good! Well worth the money! 2 big pieces o","useful":0,"cool":0},"tg3t4-5rcRGYOIJ0qyyNXQ":{"text":"Absolutely necessary to pick up a shrimp poboy when I arrive in NOLA. Some places literall","useful":2,"cool":1},"ZPzu2fO7lP6BKBYFdC1GKw":{"text":"Cast net used to be THE place for seafood. Now the seafood, especially the shrimp, are alw","useful":0,"cool":0},"4dfvCNwduQt6zA_bskt52Q":{"text":"Their fried shrimp is by far the best I've ever had. The portion was HUGE and the price wa","useful":4,"cool":0},"74XPDheBBAqZMyQqZDZcrg":{"text":"Great food. Excellent food, if you could ever get them on the phone. Their food is fantast","useful":0,"cool":0},"Z0YcsHbyfLgxFo9r0viW_Q":{"text":"This was my first time here. The food is very fresh and delicious. Great amount of food fo","useful":1,"cool":0},"gjYSFC1_c2BGX5CeHX_JyA":{"text":"Came to castnet a few months ago but it's still on my mind so I thought I'd leave a review","useful":0,"cool":0},"VVDw9z2VuOgFxVLIvCKUcg":{"text":"Food is okay. They cut their shrimp in half. I like whole shrimp. It's like cutting a drum","useful":0,"cool":0},"8405DQOyVqtCn6SU9OGfFg":{"text":"A couple of us took a drive out the East early this spring, and had our first crawfish of ","useful":2,"cool":0},"6egak5KGvaCWj0HEE-POAg":{"text":"this place is great.  quite a haul if you are coming from downtown NOLA but well worth it.","useful":2,"cool":1},"ZW1Pf4_KlJ4ckCUxKgxjKA":{"text":"If you are in New Orleans Louisiana and Like or LOVE  FRESH SEAFOOD this is the place! Exc","useful":0,"cool":0},"z8q7kTQmsQIzZB6pYFrLTA":{"text":"Absolutely delicious!!! Loved the boiled crawfish and the fried shrimp! Definitely recomme","useful":1,"cool":0},"jIxtbH9iN3Qv4ONElZ4vdQ":{"text":"Generous!\n\nHubby and I came in October and shared a po boy.  So glad we shared one because","useful":1,"cool":0},"YV0d25sZZNqZP-hvoZKsCQ":{"text":"Delicious seafood. Shrimp po boy sandwich was enough to feed 2. Off the beaten path, poor ","useful":0,"cool":0},"mo3qn8At1T95_7oHxxxVFw":{"text":"I absolutely love this place!! What a gem in an area with no quality food at all! Castnet ","useful":1,"cool":1},"7DMD9luifbT_M0Kj3UCnXw":{"text":"Service is great. Everyone was friendly and helpful. The food was terrible. We had crab sa","useful":1,"cool":0},"cib2mNJSVATHXVB00EQi2w":{"text":"Great place to get raw or cooked seafood. This place stays PACKED! Casnet has been around ","useful":3,"cool":2},"Bc2HiirxZhJAf75_xf8p2Q":{"text":"The best little seafood place in the east. Whether fresh to prepare at home or fried and r","useful":0,"cool":0},"9oErgjP46RbvWeDqqb4EOg":{"text":"Got lunch for a group of customers.  7 people ate a mountain of food and everyone was happ","useful":1,"cool":0},"iWQxO4DnHcfQXOiby81qDA":{"text":"If you want to get away from the Quarter and venture to get non-touristy crawfish, shrimp,","useful":1,"cool":0},"yK3PDwLIaFVkRUIgL8ew4Q":{"text":"Aww man, I'm going to have to be the one to spoil the fun.  A couple of friends and I made","useful":4,"cool":0},"4YATygQ19Aj4drotF2FHhg":{"text":"Another Yelp find for me.\nWe wanted some Crawfish before leaving town and boy did we find ","useful":3,"cool":0},"6FcuF_rBZWQr9nLxpm55bQ":{"text":"Well, my last two trips here have been less than stellar: \n\nFried Oysters - now fried too ","useful":9,"cool":2},"OuFrK1ZaWZFGwnFOh-aXdA":{"text":"Fresh fresh seafood, friendly staff and delicious overflowing porous! Hole in the wall cro","useful":0,"cool":0},"ovEtea-vA6oHMA-tbCZlwQ":{"text":"I Casted the net and left with fried oysters!!! If it's fried or boiled seafood you want, ","useful":0,"cool":0},"7K3LEW6-yGISrQwj5cmdYQ":{"text":"Castnet has the best food & a great staff!\n\nFrom their poboys, shrimp, & most especially t","useful":4,"cool":0},"MC818WzPKArnTur_dG7YSA":{"text":"Wow cool place here. Is a seafood market, BBQ place, made to order seafood items. Very bus","useful":1,"cool":0},"3J48bBMpn3i7SBV0_-fP-w":{"text":"I wish I could review this place for the food. It was closed when we arrived and all the e","useful":0,"cool":0},"JMM6uXK5liPjqwLrHezR5w":{"text":"Seriously this is the best freshest seafood I've ever had. The staff is friendly, the seaf","useful":0,"cool":0},"1H1aQgUHIa2VMTYEL2wmFg":{"text":"My husband is from New Orleans and I fell in love on the first visit. I have not had anyth","useful":1,"cool":1},"kyk75r1YIEOrDLFRXGIrLg":{"text":"For a first time customer it is confusing knowing where to order, thus we ended up in the ","useful":3,"cool":0},"oH7-BYRp6SgWtOJ5zPRy5A":{"text":"Best fried seafood in nola. Period. Worth the trip, but expect a thronging mass of people ","useful":0,"cool":0},"9LcKE2Awts0Ix-LeScR76Q":{"text":"As always, Castnet never disappoints! I have been coming here as they say in New Orleans, ","useful":0,"cool":0},"h6CI8faBxI_o0z-QhDl_5w":{"text":"Before I left NOLA during my roadtrip through the US, I wanted to get crawfish, and Yelp h","useful":0,"cool":1},"N_lu4Sf0VtLpSRel1I0x1Q":{"text":"My dream spot,  a real seafood market that also cooks to order.. No thrills except for the","useful":2,"cool":0},"1b2T0SO1jO41pdgZaXAYhQ":{"text":"What at one time was one of my favorite seafood spots is no more. My family had been going","useful":5,"cool":1},"cGtOrWFQbj3suaY0EMB36A":{"text":"I had no choice but to continue the trend of 5 star rating.  This is the most awesome plac","useful":0,"cool":0},"X3J1TCWOP-Gzu1I_GldnQQ":{"text":"Ordered a half & half (shrimp & oyster) Po Boy.  Damn it was good!  Thanks to the guy in t","useful":2,"cool":0},"QiWgOFWaSZqfRyC6CapXgw":{"text":"I love this place my family has been going here since I was in elementary school and the f","useful":4,"cool":0},"uM-C5l0ixsG5NocoFSPZ_Q":{"text":"This has got to be one of the best kept secrets in New Orleans for fresh seafood and po-bo","useful":2,"cool":1},"LqRj5P-6oPFdmv3NqOrNOA":{"text":"We went strictly for the boiled shrimp.  Great flavor, spicy.  My 12 year old niece is a b","useful":6,"cool":2},"g2Tgmo9UGN2bda1PgvFRvw":{"text":"Shrimp and oyster po boy with the works.  It will blow your mind.  Theres nothing else to ","useful":0,"cool":0},"194MbJjjQuDL7T_nmlggwg":{"text":"Always the best food in New Orleans!!!!!!  Seasoned to perfection and always fresh!  Best ","useful":1,"cool":1},"nhUXWr9mKFsr5wsesMyIdA":{"text":"Best oyster po-boy around, hands down!  Part of the reason is because the oysters are so f","useful":0,"cool":0},"UgI_db6dF_oX-hVK1B8TsQ":{"text":"Craw fish and shrimp spiced extra super duper on point, buy it by the pound.  For like 8$ ","useful":0,"cool":0},"pkDSmYIxpsa6idlrh8wWvQ":{"text":"If I'm rating this restaurant from a sheer dining experience, it was subpar at best. The o","useful":1,"cool":0},"Com9sTLxYzRYva-Onz3ngg":{"text":"I'm one of those few lucky tourist who got to experience Castnet! Castnet combined with Wa","useful":3,"cool":2},"aJWx937uyyo2HwFwLYLrUw":{"text":"I stumbled across this place while looking for the site of the old Lincoln Beach, it's alo","useful":0,"cool":0},"iVZVlh_-C-i41dxeSFNNNw":{"text":"One of favorite places to get crawfish. If you love garlic these crawfish are best for you","useful":1,"cool":2},"Cpvd54n8pQ_npx0WaHpg2A":{"text":"Went to New Orleans for a business conference. Good friend and co worker is related to the","useful":1,"cool":2},"jp1FHbrorARNNRokDFK1qQ":{"text":"We got fat at Castnet.  Seriously fat.  But if there is a place to get fat, this is it.  T","useful":6,"cool":3},"wN2sPf4jLFd3Ot7T8kN6SQ":{"text":"Castnet is widely considered one of the best fish markets in New Orleans which is really s","useful":1,"cool":1},"gvPK_NDLCW9QMzUu-rpraQ":{"text":"Best seafood place in New Orleans for my tastes. Whether you're looking for a fried shrimp","useful":0,"cool":0},"oEfgGynO3OV3TI4-bhGBzA":{"text":"Wonderful seafood. We  the po boys !!! We're in the area and loved stopping by to enjoy th","useful":0,"cool":0},"isLzT92npTrSwBLGsBQZfg":{"text":"If you're out in the east then you can't really do better. A staple since my childhood for","useful":0,"cool":0},"Jc7bTmlWcTId8v_oxh-kqA":{"text":"This is hands down the only place I buy fresh seafood and boiled crawfish. I'll warn you, ","useful":0,"cool":0},"8Y_IBa_M4KLi8MPHLm2IJw":{"text":"My favorite hole in the wall seafood place for fresh or boiled shrimp, crawfish, you name ","useful":3,"cool":0},"NAF_vx30_IOXLK3TIzp_sw":{"text":"We stopped here on our way to New Orleans after reading reviews. We were pleasantly surpri","useful":0,"cool":0},"-gtPRSrtmYd2FPS8NpHMLw":{"text":"THE BEST SEAFOOD IN TOWN. Totally worth the ride out to New Orleans East for a great meal.","useful":0,"cool":0},"15nNcm2jWP3ik6N4lj7XMw":{"text":"Been going to Castnet as long as I have been alive..lol Food is always good, some days can","useful":0,"cool":0},"csn1BI1W-FD2mF6gR0_4UQ":{"text":"Very good seafood very fresh, excellent poboys can get crowded at lunch time.","useful":1,"cool":2},"viH9MqetVuCf4fjsPDq1kA":{"text":"I found this place via Yelp and visited today for the first time at 2pm. By the large amou","useful":2,"cool":0},"bu1c2NwvzxdURZjrcGURSg":{"text":"I'm 20 years old, almost 21, and I've been loyal to this place pratically since birth. I'v","useful":2,"cool":1},"93nZXwQl1w0G_CW-iISThQ":{"text":"This place is a diamond in the rough.  No frills or fancy ambiance here, just a clean busi","useful":0,"cool":0},"hX9fhN8B2oeGA8on_4atUw":{"text":"My aunt always brings seafood: shrimp, crawfish, from here when she visits California and ","useful":0,"cool":0},"_6ryvpt4gCeSPvaL5W9bYA":{"text":"Best crawfish i had the whole time in NOLA! Everything was decently priced and the staff e","useful":0,"cool":0},"oqeBp4h3feFw3YNK4wUXow":{"text":"Oh, my goodness, am I ever going back here! I went here last Saturday and had the best fri","useful":7,"cool":2},"PS2FFyTxtF5gWWzsxlX6SA":{"text":"This is some of the best fried seafood ever! The fried trout, the fried crab plate, friend","useful":0,"cool":0},"19HFSVBevNZ43GRq1CeWzg":{"text":"Ordered crawfish, snow crabs, corn and potatoes. Good flavor! Not to spicy or sweet, but n","useful":1,"cool":0},"GgCZZXV7AbIlidIbtzc8pQ":{"text":"Great fresh seafood my favorite place to visit for fresh and fried seafood! Small hut like","useful":0,"cool":0},"RVcYpv9hiXPNJlzX7x3CQA":{"text":"This place was a stand out in our trip to NOLA.\n\nWe got the oyster poy, fried  & fried sof","useful":1,"cool":0},"HTJnwgiRn0XPSsh66im8_g":{"text":"Most visits to castnet are great experiences but this time not so much. just 2 pickles stu","useful":1,"cool":0},"tJiRwvdxUs2bkHDVDz7b_A":{"text":"Boiled shrimp was excellent not to spicy but just right. Shrimp was large and you could or","useful":0,"cool":0},"pTT-p5jwypOF-kFUavWedA":{"text":"If you DON'T eat here you're wasting your time. This restaurant was by far the best we had","useful":1,"cool":1},"8yxVNhJjRluZkXr1VnJQnQ":{"text":"Castnet Seafood is seriously underrated in my opinion. It's a 30 minute drive for me, so I","useful":0,"cool":0},"FYj0XX3Zg8pyNs5RB-pQ6A":{"text":"As always the food was delicious we even got out of season Crawfish and it was perfect! It","useful":9,"cool":5},"YNTiZHDBaAX3PQ0_4Uz9rg":{"text":"A-MA-ZING!!! Easily some of the best, fresh, delicious food in town!!\n\n....or anywhere for","useful":1,"cool":1},"Fg0z3mm_PnV3eS9sw8ZCBA":{"text":"My \"Can't go wrong\" seafood spot!  Didn't feel like traveling far from work to eat and wan","useful":0,"cool":0},"o9z4syuEAgtUFsnuZt9zzA":{"text":"I feel sorry for all those first-time visitors to New Orleans who end up spending a small ","useful":5,"cool":0},"MsrxsQM6yn9A8F7FyFz_oA":{"text":"Reserved a couple of sacks of live \"select\" crawfish for a boil we planned at our home. Th","useful":0,"cool":0},"OvYx1isuINHX073Mgua4Cw":{"text":"This restaurant is a hidden gem.  \nWe are on a road trip and stayed at a  RV park, this re","useful":4,"cool":1},"6BydfEXcDWOXrjtuiZAdiw":{"text":"The food was bland and over priced. Though the service was great, the food was seasoned on","useful":0,"cool":0},"vF_OqX80AJ1UucM6olN6Pw":{"text":"THE BEST! Where the locals go.....don't waste your time on lesser-quality po-boys at other","useful":0,"cool":0},"n2ZmQbi7jGeB2juz4TkQ9w":{"text":"Lived in the east my entire life so Castnet is a part of my family...lol LOVE LOVE LOVE th","useful":1,"cool":2},"skS25M9Ne-7wA1Il4Jl6UA":{"text":"Had the best dungeness crab outside of San Francisco today. The best crab you can ever eat","useful":1,"cool":1},"iWX64SVLLibmuI-TDFvN8g":{"text":"The best seafood in the city boil or fresh absolutely delicious. It's busy but you wait is","useful":0,"cool":0},"DJAq_DAaGEdVd8bGhg8VzA":{"text":"I've visited this spot a few times, food is great. But the crowd their is always a challen","useful":0,"cool":0},"YU1Y3kKVtOgYL7xw_Aq0TQ":{"text":"This is a dive seafood joint slinging boiled and fried delicacies from the waters of the a","useful":4,"cool":2},"4hnTn9ORo5kQqTrHL66rEw":{"text":"I am so glad we were recommended this place. For anyone who wants to stay away from touris","useful":1,"cool":0},"H7yV7etZjCpSz_M2y78Cxg":{"text":"You must go here if you are in New Orleans. Rent a car to get there if you have to - it is","useful":1,"cool":0},"D6hgPV_SRHI2kxA4POKaYQ":{"text":"Over priced over hyped always crowded horrible parking ok crawfish staff has attitude food","useful":3,"cool":0},"pr7cv-IUXt5Rjgz0EUZH_Q":{"text":"this is a gem..one of those places ive been to but forgot it was so damn good..i know ass ","useful":1,"cool":2},"C-wZmYMuEPz6Nd3mWY3emg":{"text":"The Best Seafood in New Orleans. The po-boys are great, the fresh fish is awesome and the ","useful":0,"cool":0},"cwc0yXd4ulxDNJ3jLEvCEA":{"text":"When you get there,  tell them that Dwight sent you. ... best/fresh seafood to sit down or","useful":1,"cool":0},"cVi7NnAGX7rcs2SRo1_YIA":{"text":"This is my number one place to get crawfish. It is like a little market where you can orde","useful":5,"cool":3},"tkPBe7xGzXq7oOEvjo6kvA":{"text":"I mean it was okay, the fish was good I had 3 pieces but not a lot of seasoning to my tast","useful":0,"cool":0},"6iOegOGDOD0GYCmwW31oHw":{"text":"One of favorite places to take people when I'm in a group. \n\nThey started serving Lobster!","useful":1,"cool":1},"ouDCemsMjHn7U-mnNGAdxQ":{"text":"Castnet is in my neighborhood and it is a local favorite. The seafood consist of fish; shr","useful":0,"cool":0},"g6wWx0EhwvjDOxbM1lcJZg":{"text":"Wow, love the food. I met the owner \"Kent\"\nWill tell everyone best seafood in New Orleans","useful":0,"cool":0},"LXgRrKvPfJk69Pjeahx6cQ":{"text":"Castnet, so much memory here. We visited New Orleans from Houston and I brought my mangers","useful":1,"cool":1},"ZpH655rbt2rB0YJfk4xoOw":{"text":"This review is for the sugar-free flavor so-balls ONlY. If you are considering the sugar-f","useful":0,"cool":0},"k9SUQR4-PNb1rSeFfUkAVw":{"text":"It's a old neighborhood favorite but lately the hot food hasn't been so good . I tried the","useful":0,"cool":0},"jbvVlJI1_djp1mdQgLShhw":{"text":"By far the best meal I had in Nola, and probably a top 10 in my lifetime travels. Castnet ","useful":5,"cool":3},"HHts1xGswj1I_QlzYtirvw":{"text":"If you're looking to get away from the tourist areas and you want great food for low costs","useful":1,"cool":1},"8ncbc8homd7dMF7X1d22sQ":{"text":"I have been coming here since I was a little girl. The prices have went up but that comes ","useful":1,"cool":1},"cGhwyjC3FH3yWl8qaVbxMQ":{"text":"Had a craving for some boiled crawfish, potatoes, and corn. Always forget this place is ri","useful":1,"cool":1},"hVZRh_UEzHsHAh1Ezj28lA":{"text":"Never a bad meal. Every PO boy, seafood or meat has been good for years. I always order ah","useful":1,"cool":1},"OkHR0hghhBGGQZU344XTqA":{"text":"Hmm so Castnet was claimed to be similiar to the packing house in south Dallas in Dallas, ","useful":9,"cool":5},"lmaHK1h5LncfI0BoJfBJpA":{"text":"A local favorite always!! Fast, hot, and fresh!! Love eating here, when the line isn't wra","useful":0,"cool":0},"eeTBXHOF7E81jcue660FWA":{"text":"We are a regular customer, we buy crawfish, shrimps, turkey neck and crabs to bring to our","useful":0,"cool":0},"38nWY25FDMaBUNcIJziqAw":{"text":"Hands down Best Seafood in New Orleans. Staff very friendly \nBest Crawfish Ive ever eaten.","useful":0,"cool":0},"Y4Xe9f50xcJSfQyZpx_HyA":{"text":"Best seafood in New Orleans!!! This is where my family goes for crawfish and fish plates. ","useful":1,"cool":0},"uDbxrGQ-pVjiE3NXEEavwQ":{"text":"Favorite seafood spot! It's a neighborhood staple and the best boiled seafood in NOLA!","useful":0,"cool":0},"dsSRQl_KYGVEcnmExmo3Eg":{"text":"After reading all of the amazing reviews, I was disappointed with what we received. BUT we","useful":0,"cool":0},"9MiqjM893K9GnJonkqwyGQ":{"text":"Great seafood place.  However, the owner walks around with no face mask on during a global","useful":2,"cool":0},"eEYiLVcGdpBhO3E1KGDXuA":{"text":"Great place for a po boy and fresh seafood away from the French quarter. I have a friend w","useful":0,"cool":0},"h4Z9YcpqWh0dNh-bwPRS-Q":{"text":"Everything was great. This is definitely where the locals go. We ordered crawfish, corn, a","useful":2,"cool":1},"4XFqzbXaywOoGd8rKIWkTA":{"text":"This is the best place ever to get fresh seafood or cooked seafood. There is no debate to ","useful":0,"cool":0},"7K1OGU75ICWeIx52o5LnTg":{"text":"Amazing Food and staff!! Always fresh!! So close to home as well, don't forget to try the ","useful":0,"cool":0},"23GtPRMN3ig1rPoHhd9LrQ":{"text":"Castnet is no joke. I am not a local but get to New Orleans every year and I ALWAYS make s","useful":0,"cool":0},"YJvzb08qukP3uEzMSDkAKA":{"text":"When in NoLa, do as the New Orleaneans do. That means having boudin, gumbo, and crawfish. ","useful":2,"cool":2},"X4zGAnCkBbKbob_K6TD2Sg":{"text":"Love this restaurant! I get food for the whole family just about every Friday. Especially ","useful":0,"cool":0},"1BLXuwOQ2N0KRYkI6JTmbg":{"text":"Best fresh fish and crawfish amaziiiiiinnnnggggg. I frequent here often and am always sati","useful":0,"cool":0},"oV_AcPCbHHs-i3oIel61DA":{"text":"Always nice to visit a food spot from my childhood! The food was as good as I remembered i","useful":0,"cool":0},"qN-Ewac6gxO46-owFRGzDw":{"text":"Some of the best seafood in the city. I highly recommend them to tourists alike. I love th","useful":0,"cool":0},"7uyObwpoLnsb1ShVN4ufwA":{"text":"Best crawfish in the city. Easy to get large orders. Great catfish sandwiches as well.","useful":1,"cool":0},"UlFLobIv8nSQgNd-qkZpjg":{"text":"The shrimp poboys are always consistently delicious. Service is prompt as well if you plac","useful":0,"cool":0},"Nm01Pzoe0hmPEGz1MqrL2A":{"text":"If want a true experience for a po boy shrimp, hurry and stop by you will want more, yummy","useful":2,"cool":1},"gP5Bsl-yv1t3JZ3Vo2OcUA":{"text":"I had the hot sausage poboy and my BF had the shrimp. It was average. Not bad or spectacul","useful":2,"cool":0},"LK0bymLjRSx9Vg4hSk5zpw":{"text":"Literally a New Orleans East staple! Castnet's boiled seafood is always so consistent. Gre","useful":2,"cool":0},"ZYP3eSZWIo752XXpoYVlvA":{"text":"Have to eat here EVERY time I come to New Orleans! Love this place.  The food is always go","useful":0,"cool":0},"5EL4UNaMyVjkxHuKg0Jhvw":{"text":"To simply Express my thoughts on this place......THE FOOD IS  GUUUUUUUUUD!!!!!! The seafoo","useful":0,"cool":0},"jQkO2m6efTVlbR68CG6Gag":{"text":"Well if you want to eat good food then you have to go where the locals eat outside of the ","useful":0,"cool":1},"QNxpyxtksHtCUBPg_RMNfA":{"text":"I've been coming to this place since a little kid. Every time I visit NO/home, I try to ge","useful":2,"cool":1},"qo-iRZBWiXxLiNZFZ6yr8g":{"text":"The best place for fresh seafood,and cooked food, the soft shell crab is delicious  and I ","useful":0,"cool":0},"HDmDCBrstXeau8JnxFIdZQ":{"text":"It took five days to find decent food at a decent price that is deliciously appreciated. W","useful":2,"cool":1},"86G86RIZJvdL5tO5-yGjpA":{"text":"Visited several times & NOW I am sitting to pin my experience. \n\nA functioning thriving bu","useful":13,"cool":9},"ueDCAtpCr5Y_QRahEj0Uhg":{"text":"Looking for a good place to buy LIVE crawfish?!? This is the spot! Crawfish comes already ","useful":1,"cool":2},"1P30uyYDzUah8D-sXhtq_g":{"text":"This is easily my fave dive this year.  The authenticity and deliciousness of the oyster p","useful":5,"cool":2},"iHVL-Zqjxzne1MUhGKsHcw":{"text":"It looks different in here. I'm glad they opened it up.  Crammed or spacious. The food is ","useful":1,"cool":1},"PMJ0Cr41ktEsXistZD02bw":{"text":"We decided to try to find a new spot before we headed into the Quarter. This place is half","useful":3,"cool":3},"gc-cJu7gVnpSWKIOcovu-A":{"text":"First timers from florida their system is a little confusing but everyone was so nice and ","useful":1,"cool":1},"T_97vvKhCHy9FPSV1zH7VQ":{"text":"This is a great local spot. Sells fresh seafood in also cooked seafood, plates, poboys etc","useful":3,"cool":0},"uYmoDyheoIIjm0j26a7C4w":{"text":"Always the best! Perfectly seasoned, great prices; in and out. Large variety of seafood op","useful":0,"cool":0},"lj69b4C8Ph8gQBjD_sa-xg":{"text":"I am a New Orleans native, but I live in California. My Wife and I visit every 1-2 years a","useful":2,"cool":0},"1xru-W8nICvh6u2D2z7ctw":{"text":"We visited New Orleans for the first time early March and camped nearby and craved seafood","useful":0,"cool":3},"oKQva7SJYmT2f3X-jW0sQQ":{"text":"I forgot too take a picture of my food. \nFood really good, especially for those who do not","useful":0,"cool":0},"eOg0h6lW6K2EAbr6DpJUxg":{"text":"This place has quality seafood. The boiled seafood was superrr fresh and seasoned just rig","useful":2,"cool":1},"PrRRzGIxyeMtjp97HMlVTQ":{"text":"Words in a review can't do it justice.  Let's just say I crave it all the time.  Don't for","useful":1,"cool":0},"VHHhbFTTR0tztM-5W4pMXw":{"text":"This is near my house so I anticipate that I will be here again.  My crazy new to NOLA beh","useful":4,"cool":2}}