{"cuYwld3asu7BujeMiYZUsQ":{"text":"We decided to try walking in on a Saturday afternoon, for pedicures, and we got right in! ","useful":0,"cool":0},"m-JK4pGZkVkawgarDoSowg":{"text":"Although one of my bestest buddies recommended this place, saying it was over the top fabu","useful":8,"cool":1},"tRs0hOp_8l3SmHKtOfE5Jw":{"text":"One of the things I look for in a nail salon is of course their work and the location of t","useful":1,"cool":0},"EvI-1ooSGwaY6ych8gmgPw":{"text":"I have gone here twice and both times I have been happy with my acrylic fill! The techs do","useful":0,"cool":0},"IQo8SaW2-MbJS1a0D4IqOA":{"text":"This is the best place ever!!!! I've been to several nail salons and spas. I've had both g","useful":4,"cool":3},"g09zydunI2XgLvnn3wYMIQ":{"text":"This place is a joke.  First time I waited over and hour but thought I would give it one m","useful":1,"cool":0},"mySuTmagGtao74Mvlzj98A":{"text":"Absolute worst manicure I ever received. Nails were not properly shaped, she didn't cut th","useful":3,"cool":0},"xySpXU9KEwWRp5stR_REcw":{"text":"This is the best nail shop in the New Orleans area. They are polite and they move fast but","useful":0,"cool":0},"yzkpfsoftoAnfIr3Swgvpg":{"text":"This place doesn't get much credit and I was very hesitant to come but I had great service","useful":0,"cool":0},"cJUqPQ5OlQfVUrCPwZ42jQ":{"text":"You know, despite the other reviews, I really like this place. The mani/pedicurists are ef","useful":0,"cool":0},"-QdA9T7jMqYRQ5c3k7Fu8w":{"text":"I went there for a mani/pedi, and it was sensational! I forgot to take a picture but I wan","useful":0,"cool":0},"05xX1hf7-UR5gWIEC-JFuQ":{"text":"The price was decent. I got a manj/pedi for $39. I thought the nail tech Tracy did a very ","useful":1,"cool":0},"QnEA81pqcI04EfFSBeD8Uw":{"text":"My friends and I ended up here after the other nail salon we wanted to go to was seemingly","useful":2,"cool":3},"yood3yu_OU-3SRSFxnAjhA":{"text":"I just moved here and have been looking for a reasonably priced place to take care of my n","useful":0,"cool":0},"h5BzjPhzN_u7Z1U6lfhNlQ":{"text":"I love Pinky Nail Salon. I've been going for almost a year now and the only place I go. Gr","useful":0,"cool":0},"zGsb5lWSpEKc2aPtaz6KNw":{"text":"My friend and I stopped at Pinky's yesterday for mani/pedis. They seated us in the pedicur","useful":3,"cool":0},"5kKz8_U_R8cP0Z7TmFhfuw":{"text":"I went in today for acrylics and was immediately helped. My nails came out looking great a","useful":0,"cool":1},"OX7d-0p49QDHgP5Zx24dAQ":{"text":"I will never go back to this nail salon, the owner was abrasive and disrespectful to me wh","useful":4,"cool":0},"GqXOcqxV7F-NxRLSID7__A":{"text":"They were awesome! They were able to fit me in last minute & the ladies there did a wonder","useful":0,"cool":0},"nSlOQM8P1dOF-9-yqjClHg":{"text":"Pinky Nail Salón staff were very friendly they give you exactly what you want I showed the","useful":1,"cool":0},"D2SyAZJIpk7PaoyieZ5LbQ":{"text":"I have no idea why people give this place low ratings.  Their prices are extremely reasona","useful":0,"cool":0},"eTN11OESiG3yXF9OG4_yqg":{"text":"Did not like the service honesty. My nails didn't even come out that well.  Plus they had ","useful":0,"cool":0},"JrnDtpm43nXTSLU2J_111A":{"text":"Vu is my favorite nail Tech! Been going to him for months now and the only person who can ","useful":1,"cool":0},"oPt7X60Vz90bzcIBnsEcow":{"text":"I Love THIS Place..David, Wendy, Kim and the crew are to die for...I drive all the way fro","useful":1,"cool":0},"Iljl8m6nIp8AnYovirewRA":{"text":"3 weeks ago I got a manicure and pedicure at Pinky's.  Seriously the best job ever done on","useful":1,"cool":0},"0DFZj6tBzAp4S2KtNvkEKg":{"text":"First visit I got my eyebrows waxed. Not in the \"Diva Seat\". I wasn't in love with them be","useful":4,"cool":2},"wzPaSHhkyoECVkQEmU-ZSA":{"text":"i hate to be the person that tries a new place and immediately gives it a bad review, but.","useful":3,"cool":0},"MvDZRmI05kYRVCBBjp2NeQ":{"text":"I dunno, I like the place.\n\nThey've put on a full set of acrylics and then two fills since","useful":8,"cool":5},"eBcOaSFwZywKJ7L3m7H-Hg":{"text":"I love how they do nails but very expensive if you get full acrylic set and toes polished ","useful":0,"cool":0}}