{"bg68TaBJvwBGfg6hZRsiJQ":{"text":"very fresh raw oysters , taste sweet. Fried oyster is nice. Cajun chicken is tender and ju","useful":0,"cool":0},"BCvJFIXqPMj23NUPDBI_VQ":{"text":"Landed and needed food! This place was awesome. Oysters were fantastic and the salmon was ","useful":2,"cool":2},"HCCJPaeyEBylj3qwAjyk3w":{"text":"First of all, I loved the atmosphere of this place. As we walked in the hostess was just j","useful":1,"cool":1},"arysihpHeUa2V-Mo9tKXCg":{"text":"Wow, just wow! What a wonderful surprise! My daughters and I had dinner at Gallier's last ","useful":0,"cool":1},"7wDyHkb_Nym3QYGVijq2ow":{"text":"We walked in for happy hour and met Kelly. She made our happy hour a great fun experience.","useful":1,"cool":3},"8JWnXvPz0KH5PWPg83UooQ":{"text":"Devon and Alex are the best shuckers in New Orleans! Very friendly service and tasty oyste","useful":1,"cool":1},"CBnK0k2gPyx5hRuOsZHoUw":{"text":"Nice oysters bar and quick service here. And all foods is good. But special for me is a so","useful":1,"cool":2},"d7zs5oJue86BEHMxhxmEiQ":{"text":"Da bomb... red beans and rice off the chain... oysters are exceptional... stopped in for a","useful":0,"cool":0},"GKGNY1GQKYw3eGhmdXYqIA":{"text":"My wife and I were looking for a place to eat that was close to our hotel and we found thi","useful":0,"cool":0},"66_mTPxGyeCdiHNpzxxo9w":{"text":"Excellent service and atmosphere. Creole oysters recommended by the server were excellent.","useful":0,"cool":0},"UbZAjIl_CZdhKrFgg9Oknw":{"text":"A New Orleans classic. I've eaten here several times and never been disappointed. I love t","useful":0,"cool":1},"3UVcK90VvClD8kS5GGVwIg":{"text":"Great service and great food! The crab cakes are small but all crab and the remoulade was ","useful":0,"cool":1},"NS1xh_6WBIoeO2C0qY6ZZg":{"text":"Great breakfast, great service and great mimosas. Very impressed with this place. The Rock","useful":0,"cool":1},"yCnb1bS8PmyHrSYafWdG0Q":{"text":"This was my first time eating an oyster po boy from New Orleans so maybe I don't really ha","useful":0,"cool":1},"2x_SN27aCbfbZPWBCjs7eA":{"text":"Filip was an awesome server. Stop by for some incredible food. Some of our dishes ...Shrim","useful":0,"cool":0},"BsTBXvrMPmocnjAyJfM_ng":{"text":"It was close to our hotel so we thought we would try it. The shrimp po boy was stuffed wit","useful":0,"cool":1},"TAhi8a0r_2iTCOa1dQtsFQ":{"text":"Delicious and generous portion breakfast dishes and the Rockefeller oysters were heaping w","useful":1,"cool":1},"y1sHR-ag0lNGd6cwKFeONA":{"text":"Delicious.\nThe bowl of gumbo was delicious. And only $11.\nThe blackened red fish was heave","useful":0,"cool":1},"wXuVDRLQ06UykdDGZXTjSA":{"text":"This place is awesome ! Great service along with a colorful personality by the staff from ","useful":1,"cool":2},"qtMwWU3uN4KTR9di6UAzKQ":{"text":"We came for happy hour, but the food looked great. The bartender, server and hostess were ","useful":0,"cool":0},"XHS23FmhS0OlPooqpf_gUQ":{"text":"We came for happy hour. The hostess greeted us with professional friendliness. The ambienc","useful":3,"cool":2},"VkNQQKGyHlVkKRLv-EEAjw":{"text":"We wanted a quieter place to dine after walking through all the noise and crowds of the ar","useful":0,"cool":2},"rqe7e7J1_Johj8-vXUUatA":{"text":"Made the trek here in the middle of a storm. The service was absolutely great. The only qu","useful":1,"cool":0},"d2ARVvBvURa3yixkS4jMIA":{"text":"We came for the oysters. Great service. Great atmosphere. Oyster were super fresh and the ","useful":1,"cool":0},"zGRMST6D2j8tlOp0mhev1w":{"text":"Absolutely fantastic from start to finish! This is ideal for all occasions.  The decor is ","useful":0,"cool":1},"i4uB5EEem3ntqDV2z-FFFQ":{"text":"Absolutely amazing fried oysters in a spicy sauce.  Excellent meal, great service, and goo","useful":0,"cool":0},"DmSniyLfSYsGDAqcoA6Ing":{"text":"This place is absolutely amazing! First off, our waitress Kelly was just all out AMAZING! ","useful":2,"cool":1},"bSvtxxqgN3KgBN0jIebs6A":{"text":"I wouldn't recommend going ... they were quite insensitive ... refusing to seat two people","useful":0,"cool":1},"TgWGoKLiGib_bcYgDcqXfw":{"text":"Omg, grilled oysters the best, if you In New Orleans you have to come here for your grille","useful":0,"cool":0},"K2uxBGIxlk0adwT1EsNAhA":{"text":"Really good food. The oyster special at happy hour is very good. Service is excellent and ","useful":0,"cool":0},"I610_t3LwvGldCZysibhrg":{"text":"Popped into Gallier's today, and it's really coming up! My bartender was Jerrod--he was ad","useful":0,"cool":1},"kFJuDmCbiK3kl8W0HaL-Lg":{"text":"I ordered a dozen of raw oysters and gumbo today. The raw oysters that I had were not clea","useful":0,"cool":0},"C3gXZAPgctvVnTtiRiQJhg":{"text":"What a great find! Great drinks, delicious food, and friendly staff. The pear martini is d","useful":0,"cool":0},"lTH2hfxnpEsyOfX3HEob2Q":{"text":"Perry is an expert oyster shucker and oozes warmth and hospitality.  This place isn't fanc","useful":0,"cool":1},"hDvqTvZqr4bU-ZrHa9FdtQ":{"text":"They have the best oysters in town by far! Always fresh and perfect size. They are relativ","useful":0,"cool":0},"X0zh9rIMuc9qS-sdLXbubA":{"text":"I was looking for a fried oyster salad, and I found it.  In truth, I prefer a spinach sala","useful":2,"cool":1},"bbV2UWghNHXpEr65QQe6YQ":{"text":"I came to Nola for a weekend of eating. I enjoyed meals at Commanders Palace, Cochon, and ","useful":3,"cool":0},"2aLyMletGjwXD55X0HDtlw":{"text":"By far the best charbroiled oysters on the planet!!  Incredible flavor, fresh, and melt in","useful":0,"cool":0},"L4WlljYp5bXnu0KrXv3pcQ":{"text":"Very average food, our server was very sweet but the host came off quite aggressive toward","useful":0,"cool":0},"HXl9uN7-6fbNxwRrMOIv3A":{"text":"After going to this restaurant, I must say I'm surprised by the high ratings. I kind of wa","useful":0,"cool":0},"hbGGfBcnbzGapOWkOR03Cw":{"text":"The wait staff was amazing! The drinks were a little pricey.. However, they were very good","useful":0,"cool":0},"IiJ3v5tqDbgsca8MBAQhLA":{"text":"Wandering through around Canal starving and this was the closest place to us on a search. ","useful":0,"cool":0},"nfeRWIgEBVYn9rF47lAKCg":{"text":"Al was a great server and bartender! The food was authentic and absolutely delicious. We h","useful":1,"cool":1},"CxQP0ozgK7kqpINTcYdrqw":{"text":"Best sandwich I've eaten in NOLA. Try the Gallier. Fresh oyster fried to perfection with g","useful":0,"cool":1},"iUAurN2dPwS1bh_SpTbHlQ":{"text":"Showed up at 5:00 for early dinner. Heard Oysters were as good as Felix which we had sampl","useful":0,"cool":1},"1SnLN687jggwUXwRyEdWIg":{"text":"Great food!! Great Service!! The Creole Oysters were a dream come true!! I will come here ","useful":0,"cool":1},"O-Vua9qtzPARsQEgcx80YQ":{"text":"Good oysters. Easy atmosphere. Good drinks. A great start to the New Orleans experience. T","useful":0,"cool":0},"JZhZZQ1_ha9SSL8zDN7W7A":{"text":"Great experience from start to end. Was greeted outside by a smiling face and seated right","useful":0,"cool":0},"snX0Vf8lY0b1E-D-iyqZfQ":{"text":"Had lunch and the meal was Great!  The grilled oysters very tasty along w gumbo my only co","useful":0,"cool":0},"Oa6d32hhCV4Iefw7v4HLBg":{"text":"Came here for happy hour twice on a 4 day trip. It was very close to our hotel and we love","useful":0,"cool":1},"6wAPofSWyuQERrjGbbGIUg":{"text":"This little place was a bright spot during our short trip to New Orleans. The raw oysters ","useful":0,"cool":0},"X6Y3pUh6M3u3GbbPvOVP9g":{"text":"Fantastic happy hour, $9 oysters on half, and gumbo was amazing with a little Crystals. Gr","useful":0,"cool":0},"R8as_J6VVNHlmcQtm3tIkQ":{"text":"We were craving good gumbo and did a yelp search for the area we were in and tried Gallier","useful":0,"cool":0},"88AdwB7-75i9eBd4u_9eZA":{"text":"I had the charbroiled oysters and they were great. The service was excellent - very friend","useful":1,"cool":0},"7cXLEA9NLcyw4yy5c8DUqQ":{"text":"I had a horrible experience. We ordered oysters as appetizers and did not receive them unt","useful":0,"cool":0},"R_AOGF0ReWKYuwbhCuAMEg":{"text":"Fadi is is the real deal. As I am from the Middle East and background I am super fussy on ","useful":0,"cool":0},"P0Y6Pq9OJAkZVa7TJBLejA":{"text":"We went there around 4 pm in on a Saturday.  HAPPY HOUR food!  For 30 bucks we could not h","useful":1,"cool":1},"JmEG-GRKkOJk11HAHevfzA":{"text":"Huge oysters with no flavor. The charbroiled ones were helped by butter and cheese.  No at","useful":0,"cool":0},"FJp5Hufw5Y3FdDkmD_v_uQ":{"text":"First stop upon arrival for a long weekend in New Orleans.  Charbroiled oysters were fanta","useful":0,"cool":0},"cyuNFRI0YS2NLium91tbfQ":{"text":"Great crab cake!  Delicious without any fillers.  Best I ever had and I try crab cake ever","useful":0,"cool":1},"GePkGs8nZsKQlMoFiB41tw":{"text":"Pretty low-key place compared to some of their competitors-- not a bad atmosphere if you w","useful":3,"cool":2},"Cu9SZu4V_7OPGHyVoiwiKg":{"text":"We found this place on yelp....And as our first time in New Orleans we wanted to make sure","useful":0,"cool":0},"1howgH9kRe0gishxghxR5g":{"text":"Luckily happened upon this place after getting into town and let me tell you do yourself a","useful":3,"cool":1},"MMsqtqorcPEDefdOo6eAYQ":{"text":"After reading all the great reviews, I had to give this place a shot. As far as ambience g","useful":4,"cool":0},"mHgMkKKX4WOuHNgTqTRF4w":{"text":"Great food. Staff kinda ghetto.  We had cajun pasta, seafood pasta, shrimp platter, red be","useful":0,"cool":0},"ArvgjTfLCB5CBiBQodlDSQ":{"text":"Seafood..Oysters.. isn't it must when you are in NOLA?\n\nFOOD//\nBless happy hours for half ","useful":0,"cool":0},"QNCSi1-SjStQ3gyULlETNQ":{"text":"I happened upon this place while on a trip with my university. It was about 7:30 on a Frid","useful":0,"cool":1},"9hQpfWd4pgh6gn57higtZg":{"text":"The best oyster and Bloody Mary pairing I've ever had!!! Excellent staff! Will visit here ","useful":0,"cool":2},"eve92ZqP1vs-s3ICP94jVA":{"text":"The food was good, ample portions, cost in line (not outrageous) server Ashley was friendl","useful":0,"cool":1},"P9LqrWvgkH3IO9XslW0Y5w":{"text":"Food was okay. Fried shrimp were great. Pretty sure the red beans were Blue Runners. Prett","useful":0,"cool":0},"QcSJwxi0pPdH7kujChRjHw":{"text":"My friends and I were staying right by this place, kept passing by and chatting with the \"","useful":0,"cool":0},"aABtx4hrxH3f_3ExTfNCSQ":{"text":"Broiled oysters were delicious. They had a really good beer selection with local craft bee","useful":0,"cool":0},"RHVGD7z8TdOlUnjWPn7Kog":{"text":"Service was great and happy hour was even better! Lots of great deals and specials. Their ","useful":0,"cool":1},"UXD59b_jkYatSP6kCjDgEQ":{"text":"We went to Acme the first night of the trip and I will tell you, Gallier put them to shame","useful":0,"cool":1},"qItnq8az9n5Kx1WLDz83fg":{"text":"Gumbo was way too watery and too much oil. Cajun pasta(forgot the name) was over cooked. O","useful":0,"cool":0},"tqMoA-9DbQNQ-1oMs8Ym-w":{"text":"They've got happy hour from 3-7! Discounted drinks ($3 drafts) and $9 for a dozen raw oyst","useful":0,"cool":0},"dQ2TEujD1_ho1gWGMrZNXw":{"text":"Funny enough, but the oyster schucking man made this experience above and beyond. Staff ar","useful":0,"cool":0},"nx0MzQvi_B9gQVGbi9mrgQ":{"text":"Great service.  Fresh oysters and redfish.  Off the beaten path and reasonably priced!","useful":0,"cool":0},"szalaHjGQOlOurv3K2Osqw":{"text":"Fantastic raw oysters!!  And the rest of the meal was amazing too.  Excellent service and ","useful":0,"cool":0},"MNBmPzLvhmVlLYzt6xnjtg":{"text":"Probably the best place we ate at in New Orleans so far! Everything is so flavorful and pr","useful":0,"cool":0},"cdCiKRVIH85RItBt9KEGPw":{"text":"It is very unpretentious but the service and food was superb. I had oysters and crab cake.","useful":2,"cool":1},"tn2XRFaO4tAZrZyBhRvyZw":{"text":"We went here for a Saturday brunch to celebrate two birthdays. I called on Friday (nothing","useful":1,"cool":1},"75GcCKTtoBJ1wRmx1-IbYQ":{"text":"Best Oysters i have ever had! The raw oysters are fresh and delicious and the charbroiled ","useful":1,"cool":2},"V_hFKmEoPmNY8Tn52OJt2A":{"text":"I've been to New Orleans many times over the past 10 years. I've enjoyed many dining estab","useful":0,"cool":0},"Ii48X5sBUP5GDFUbSOUMVg":{"text":"Wow!  Local feel oyster bar, local prices, extraordinary quality service and food.  David ","useful":1,"cool":2},"ohf8hTn2abB-p_R-C09OWQ":{"text":"Had the beignet sandwich - perfect for me! They also have the usual presentation of powder","useful":2,"cool":0},"x9ZpjbqGluAXc8HEEt-g9w":{"text":"I almost don't even want to write this up because it is such a treasure and a part of me w","useful":1,"cool":1},"n-s5g3ahSCK7f2qeKOw_Uw":{"text":"We came to New Orleans to find a great seafood joint (that of course had plenty of drinks)","useful":0,"cool":1},"9TxeZheeoyxkuo9eOeN_bA":{"text":"Service is absolutely 5 stars or maybe just thats the south. \nRaw Oysters are great; but t","useful":1,"cool":1},"V_aESMc7wt-tiPNj2Hv5Mw":{"text":"Of the many food experiences one can have while in town Gallier Restaurant & Oysters stand","useful":1,"cool":3},"trFPULPmxLD96UJXnO6sQg":{"text":"I really enjoyed my time here. The servers and bartender were very friendly. I came in for","useful":1,"cool":0},"jQo8xL_oYo016LfW-96IMw":{"text":"OYSTERS OYSTERS OYSTERS! We came for happy hour (everyday 3-7 pm) and we got 3 dozen raw o","useful":0,"cool":1},"DZNkJ1Pfp9UWJdGlx85mHA":{"text":"We ate there three of the five days we are in New Orleans. They're Creole oysters are outs","useful":0,"cool":1},"noIMqLxmmZ2uzOTfCXxR5A":{"text":"Great service, really nice, friendly waitress. We arrived at 7:00 pm on a Tuesday and ther","useful":2,"cool":0},"UVzF9b70q_fZCJxn4e2VNQ":{"text":"Read good things about the Charbroiled Oysters at Gallier so I had to check them out. This","useful":2,"cool":3},"eqtvO79aMDS3KBtx1mTaKQ":{"text":"DO NOT EAT HERE...\n\nBecause the oysters are FABuLoUS! \n\nFirst time at Galliers and went du","useful":2,"cool":3},"jtfhuFA6KFVb4RYGSPs5Aw":{"text":"Found this place on Yelp when we arrived in NOLA hungry.  Just a few blocks from our hotel","useful":0,"cool":0},"TzM7smcpO_TiF3gAxJP7Aw":{"text":"Went in for oyster happy hour. Oysters were very cold and tasty. 3$ drafts. Wife had shrim","useful":0,"cool":0},"9rrWaFuEmBCzJZ845fcllw":{"text":"Don't worth to wait .. we left the restaurant after 40 mins waiting at the table for RAW O","useful":1,"cool":1},"W2eoVCw_HTrBBaSab-q90w":{"text":"Very nice place! Food is better than anywhere else we tried while our stay in New Orleans.","useful":1,"cool":1},"X7hMyr4vUo8tGF7CTswNzw":{"text":"Great restaurant and very accommodating staff.  The char-grilled oysters were yum. Our onl","useful":0,"cool":0},"_DEgusbbk6sjR5nXOQL4Wg":{"text":"You can't go wrong at this place. We came for breakfast and both the Ouster Benedict and t","useful":0,"cool":0},"acykcL0SddM_maHEbJHDzg":{"text":"Kelly recommended the grilled creole oysters and they were fantastic! Great casual atmosph","useful":0,"cool":0},"OKSOhMIUeSRvyebTwBx8QQ":{"text":"Great food!!  Nice ambience .  Loved the Gallier Poorboy with fried oysters and bacon and ","useful":0,"cool":0},"iExdb0lylF9LXWWTxgcy2Q":{"text":"Had my reservations regarding a new restaurant. But this place had some of the best Raw, C","useful":0,"cool":1},"5LIOaYrKzaRfCXycLlNf4w":{"text":"Great place! Raw oysters and Charbroiled oysters were amazing. I had the chicken penne pas","useful":1,"cool":1},"A_DyOXtjiq8qrPDfku-v7w":{"text":"Food was good, but the hostess was horrible. She couldn't keep up with all the people comi","useful":0,"cool":0},"ycGHiijH4gYXFCuz79y-SA":{"text":"Great restaurants! Loved the chargrilled oysters. Nice atmosphere, will definitely be back","useful":0,"cool":0},"UKDMukGt9rBhw9bXQfHZFQ":{"text":"Great oysters raw & grilled - delicious food. Seafood pasta was creamy, savory and just ri","useful":0,"cool":0},"UhO_gL9CWn4lu-sjId_NQA":{"text":"If you're an oyster fan for flavor this is definitely my favorite place I've been to in NO","useful":0,"cool":2},"fuqCuCnd73wP9LYupsZQAw":{"text":"Stopped in here on a Tuesday and sat at the bar. It wasn't busy at all and Dawn took care ","useful":1,"cool":1},"XjawrE4XOmQEJjclmTFdgg":{"text":"I highly recommend this restaurant!  The service was excellent, fast and the staff were al","useful":0,"cool":0},"eluSZgZ2IGYwv46ou-puBg":{"text":"Friendly service, Kelly is very sweet and attentiven. Also they have yummy oysters! Go dur","useful":1,"cool":1},"MdUu7X4VVZAfN-YPsMrA_w":{"text":"$15 bottomless mimosas and bloody Mary's! Great breakfast menu. The crab cake Benedict is ","useful":0,"cool":2},"WuAKiX0yGsECwssLZxcMeg":{"text":"What an awesome find. Yelp directed us to this and we were not disappointed. Our waitress ","useful":0,"cool":0},"1fg0cUHAHyW9ThtTRpikfA":{"text":"Get the Rockafella (or Rockafeller) Oysters! Simply the best oysters we have ever had. Gre","useful":0,"cool":1},"FC0L3sqUtHU-C3BH4JTaDQ":{"text":"Extremely disappointing. My mother said the gumbo was tasty but very runny and not very fi","useful":0,"cool":0},"J4_6Sg1q0V8RdldA66pyEg":{"text":"We wanted to give this please a try since it's new and some reviews were good, we came aro","useful":0,"cool":0},"Or1oUlY9JyAfyskpeclVbw":{"text":"Great atmosphere friendly staff.  Owner is very personable and staff is very attentive and","useful":1,"cool":0},"YFOzvu73mt2kJBwpc8T9bQ":{"text":"BeSt oysters in NO!!!!  After eating super food at some of NOLA's fine Restaurnats this on","useful":0,"cool":0},"ye-SC2HRoTLMX3jjLcPIiw":{"text":"Used to live very close to New Orleans so it holds a special place In my heart and there a","useful":0,"cool":1},"lvIbAY664Rx9L8nQ8eLjIQ":{"text":"Saw the reviews and decided to give it a try. Great decision. Daniel's was shucking oyster","useful":2,"cool":0},"P9eMDH2oklYQggHMPvrkDQ":{"text":"The hostess and waiter were very sweet! As for the food!! Not even worth a star!! Got the ","useful":0,"cool":0},"H9CmLesXeoIoFilVZGB9ug":{"text":"Stopped in during a trip to New Orleans.  Wasn't to sure about it at first having walked b","useful":1,"cool":0},"KWkh1DnmL_RKYpNJXCfILw":{"text":"The food was amazing.  Wait time was minimal.  So fresh!  Cooked just right.  Try the broi","useful":0,"cool":0},"aJJAPT-4D0U_mPFnmQQ3XQ":{"text":"This was exactly what we were looking for! Amazing fresh oysters shucked by Perry and grea","useful":0,"cool":1},"VfILq4BfrneXfcLhExM_Kg":{"text":"We went last night for drinks and oysters. Sarah, Katie, and Perry were fantastic hosts. W","useful":0,"cool":0},"yQvA3NVw9UjdIDVPozeRKg":{"text":"Best oysters I have ever had. Perry behind the bar is one hell of a guy shucking your oyst","useful":0,"cool":1},"2HsO3XsZNTP8FA_pp8HEVQ":{"text":"The food was awesome and the location is perfect, just 1 block up from Bourbon Street but ","useful":0,"cool":0},"rH_Mym4qxTTxTGC80mN7yA":{"text":"Dawn provided Excellent customer service. She is also a bartender. $6 you call it martinis","useful":0,"cool":0},"w8QXlM508dTjJk_YUrNetg":{"text":"Between Blind Pelican, and Superior steakhouse, so far Gallier Restaurant has one of the b","useful":0,"cool":1},"4s_6b352Z9HsOEKRaUPUxQ":{"text":"What a little gem of a restaurant to find. We are staying nearby and needed a little somet","useful":0,"cool":1},"ztbBjqEFPmlAdRlxBoqGWg":{"text":"We came on a Wednesday night, with only a few other tables occupied. Because we only had a","useful":0,"cool":0},"3oa8Pzdy96L5UYkgOMl6tA":{"text":"Nice quiet place across Canal street and just off the main insanity of Bourbon street. Raw","useful":0,"cool":2},"2Dtk-DJ-YjJPQRciu1fQPg":{"text":"Early dinner of gumbo, red rice beans and rice for me, my buddy had the shrimp platter. Al","useful":0,"cool":0},"Xz4UoF4bUJ88qdFIviiyvg":{"text":"Great ambiance, great food and great service. What more could you ask for?  The oysters we","useful":0,"cool":1},"Sfmds3SZUWIhwNUkFRumfw":{"text":"Great place for brunch. Kelley was our server and she was very attentive and professional.","useful":1,"cool":0},"cz8Lhna_5qloDUTF3ePqxQ":{"text":"Old fashioned was horrible, rib eye was overcooked and they automatically include 18 perce","useful":0,"cool":0},"28Xmt1Y6-RAF1sc1n8VlZg":{"text":"Frickin love this place!! Sit at the bar and laugh your ass off with Al, or get amazing se","useful":0,"cool":0},"Xzg0Ubi-26zxcerkm1o_6Q":{"text":"This place by far has been the best place to eat and drink in New Orleans! Have to try the","useful":0,"cool":0},"23KNKdVnsELrlT1EWqoDPw":{"text":"質量値段共に素晴らしかったです。\nカキは3種類の調理法があるので、全部試してみることをお勧めします\nあまりに気に入って滞在中2日間ディナーに通いました。地元の方も多くいらっしゃって","useful":0,"cool":0},"stmPTkJsRzH1EsDF-qIIEg":{"text":"We stumbled across this restaurant and were pleasantly surprised! I had the shrimp remoula","useful":0,"cool":1},"-k3YFCjyeWsmdGA0Z3mT1A":{"text":"We went Seaworthy because it was close to our hotel and we were supposed to meet some Co-w","useful":1,"cool":2},"ml98daYLMYym7HxC7IckCA":{"text":"The char-grilled oysters are decent, but their fried oysters are fantastic. The breading i","useful":0,"cool":1},"B0DJhY3C_bNwgWyIEFq4aA":{"text":"Went in for lunch. Had the shrimp POboy. Shrimp was good with a light breading. Potato sal","useful":0,"cool":0},"Xr5CJTg3eGTxRHvUCypIhQ":{"text":"Dropped in for a quick bite, close to hotel and rated well in Yelp.  Totally agree with th","useful":0,"cool":0},"RFoWSEHipmpcoG6xcFTCcw":{"text":"What a find! Our family stopped in for happy hour and had a great experience. The food, dr","useful":2,"cool":1},"47puZLbRjxAdzxc_OrTxRw":{"text":"There was a really nice lady standing out front trying to persuade people to come inside. ","useful":0,"cool":0},"_2aoz9aCQDUCdT1TM4CkYQ":{"text":"This little place has just become our favorite little restaurant for oysters in NOLA.  We ","useful":0,"cool":0},"fjFBKy9NzxI5TnRD5hLr2g":{"text":"Ate dinner here tonight.  Delicious food, great service.  Went out of their way to make ou","useful":1,"cool":1},"MsfEdFJDXiubOklmCZgWHg":{"text":"I frequently travel to New Orleans for business & am always looking for local flavor when ","useful":1,"cool":2},"xjKovFUfQLBIBIdqoAanog":{"text":"Oysters are good and fresh, good place for drinks. Food was ok. Host were rude and b****. ","useful":0,"cool":0},"fyxa_z8t7joOLc6UupnXwQ":{"text":"This is my first time to New Orleans, I had a great lunch here the other day. The charbroi","useful":0,"cool":2},"dBvsHhb9KEWI4DiGVkAFsA":{"text":"Stopped in for Chargrilled Oysters and a drink.  The oysters were decent (not the best we ","useful":0,"cool":0},"-a2M7MjpajUq6YiQAgLnRw":{"text":"Kelly is one of the best servers I have ever had. She made recommendations to us and was s","useful":0,"cool":1},"d0xSa9Chd0bOXXxLaKPJcQ":{"text":"Good place!  Great food!  Had the raw oysters and crab cakes.  Both were delicious!  Kelly","useful":0,"cool":1},"wgppK6UEC1DfLNWGPeLYWg":{"text":"Ok, this place was so good we had to come back! Food, service, everthing exceptional! Davi","useful":1,"cool":0},"4ggxLNryQf3HAqBLDQL1nw":{"text":"Sorry no pictures, the food was that good.  Other half declaired the fried oyster sandwich","useful":0,"cool":0},"LIeHfGdP0yxlQYpTx-OIRw":{"text":"We just got to New Orleans and wanted something authentic.  I found this place based on re","useful":3,"cool":1},"syPK2Et57u-UoGKWAhKeIA":{"text":"Wonderful service with a great happy hour until 7:00; don't let the noise on the street at","useful":0,"cool":0},"S1s1a7RPhVlmdW_rFIW4Zg":{"text":"Amazing service!!! Manager came to our table twice to speak to us. Once to ask us what we ","useful":0,"cool":1},"dMF9C_FGg2ycSF-HPHUPcQ":{"text":"Best fried oyster salad of my entire life and I was born and reared in southern Louisiana!","useful":2,"cool":1},"198thv7aLiiAv04r4Cd7xw":{"text":"My wife and I have been lucky over the years finding terrific dining spots - in some cases","useful":0,"cool":0},"fDNPlmH2mln7TYRogzlBMA":{"text":"Service - not much: ordered three dishes and an ice  tea - the server plopped all three di","useful":0,"cool":0},"zBODTdRV9xeUV4q5_KaSdg":{"text":"Good food, the gumbo is amazing, Oysters are superb, and the service staff is GREAT!!! THE","useful":0,"cool":0},"pIpotHF5BaHf6U230sVb7g":{"text":"Came here with high hopes. I had the seafood pasta. Can we say I a thumbs down the pasta w","useful":0,"cool":0},"E_Z8L7rS8u6RjQpqRm44iw":{"text":"We only stopped in for breakfast (twice) but the food was great and so was the service. Th","useful":0,"cool":0},"eZ-he0Aesw1XSI1BukoOdw":{"text":"Good food nice people.  Very good oyster raw and charbroiled. Was going to Acme it would h","useful":0,"cool":0},"k7ZvnDTra8INzYsHW6IGvQ":{"text":"We found this place on yelp after ACME had a line wrapped around the corner. No thanks! Wh","useful":0,"cool":1},"L6nK3KC7bF4vy6UUGBCX2g":{"text":"What a hidden gem. This place is AMAZING!!!! I am an oyster fanatic and this place offers ","useful":1,"cool":1},"MUiNXdiqzm6-CQyeZftW_Q":{"text":"Great service.  Oysters are fresh and huge.  Gumbo served NOLA style...very hearty and ref","useful":2,"cool":2},"i81bVLNZuaQjUT0NvMv7TQ":{"text":"Recently found out about this place through yelp and the happy hour seemed really promisin","useful":4,"cool":1},"XuZtr6D1SQOH2gNulDKWcg":{"text":"Best Oysters in the French Quarter area! Don't forget to ask for Lorenzos' special sauce","useful":2,"cool":1},"AVtt3kTA9m76RtCaAqYKrg":{"text":"The night we went, they only had 1 server and she was overwhelmed serving all customers (t","useful":0,"cool":0},"dsH5i4Vdsmd2ApGrX9mLTg":{"text":"This may be my one the best kept secrets in New Orleans. First they have bottomless mimosa","useful":0,"cool":1},"pQsrZSq8SfIZJvKzC8LuoQ":{"text":"Service was exceptional and super friendly.  Decor is a bit spartan but clean. The Penne p","useful":0,"cool":0},"4T6y3GsVp5c9oniz8FqF5g":{"text":"The food and Bloody Mary was great and delicious.\nHad my first poboy NOLA and this place d","useful":0,"cool":0},"vw3HEBIa0u6SAOL-SAXtwg":{"text":"Good seafood. Me and my wife both enjoyed our selection. Redfish and shrimp PO boy. Drinks","useful":0,"cool":0},"xbj-uTTdRk_wSdbrZBSzlw":{"text":"Service was great! The food was pretty good! I got the Cajun chicken sandwich, the Po Boy ","useful":0,"cool":0},"FMv47GCr79uYEUTrHERjaw":{"text":"Great, friendly service. We had the fried oysters appetizer and the seafood penne pasta an","useful":0,"cool":1},"weP-POGyjC4Dhh0wFGlrdg":{"text":"A new neighborhood place yet so close to Bourbon Street. Excellent seafood. Friendly staff","useful":0,"cool":1},"_DK5ab369uu9TTm_quGoFg":{"text":"This place is simply amazing. I'm from Louisiana born and raised and will always come here","useful":1,"cool":1},"waZsps_JYRR45NBJCVb05A":{"text":"We went for dinner on a cold rainy night. This is a small place with a nice staff. The foo","useful":0,"cool":0},"YXF1ySYV1_nTHipu_rBrWA":{"text":"This is the cuties little place on our fun adventure through New Orleans for the next 2 da","useful":0,"cool":0},"XPfgjwOVyPp4ZGp68IktOw":{"text":"Omg. What a find! We stumbled upon this place one night & I'm so glad we did! They have a ","useful":1,"cool":1},"yB7kBDVI-4jRr1Kf4kIpPQ":{"text":"Close to hotel and looking for some New Orleans oysters, I visited this place and sat at t","useful":0,"cool":0},"JqsSFU_CLjB6GfFn-zBdYQ":{"text":"Only come here if you enjoy amazing food and out of this world customer service. You are t","useful":1,"cool":2},"pjs66vkrOcb9uHif__fBXw":{"text":"Got a dozen raw oysters. They were very fresh and tasted amazing! Definitely would get the","useful":0,"cool":0},"w_BiBeXTEkh12L1Xqb3YXA":{"text":"We stopped in more for a snack than a real meal, but enjoyed some gumbo and a glass of win","useful":0,"cool":0},"2nPTHKyT3lM6xzw_haINpA":{"text":"We just did an order of chargrilled oysters. They were very good but I didn't personally l","useful":0,"cool":0},"e4oLGJI0s5bjcodezr7-aA":{"text":"Nice quiet bar/food joint just in the other side of Canal Street opposite Bourbon street. ","useful":0,"cool":0},"pcxn3UYlx1ROH6nN2surSw":{"text":"Had an amazing dinner with friends. Service was perfect and the food was delicious. We dev","useful":0,"cool":0},"9_fYSpwPp-S3wU_j9AwjGg":{"text":"Awesome gumbo. Maybe the best I've had in awhile. Very relaxed atmosphere and good custome","useful":0,"cool":1},"y2lrLSGEIXTmJVjxc9ggwA":{"text":"Everything we had was delicious. We really came for the happy hour oysters, and cocktails,","useful":0,"cool":0},"peDxrM7n60HPBFVFuObpnw":{"text":"This place was great.  And the service from Lynn was even better.  I had the salmon which ","useful":0,"cool":2},"AJkAUEAFxUauP8QfLHjAHg":{"text":"Great place to start the day.  Even opened the doors early for us!   Bottomless Mimosa and","useful":0,"cool":0},"R5MHeF4t6BujRyp7VrsfOw":{"text":"Enjoyable spot just on the edge of French quarter away from the noise....serves local food","useful":1,"cool":0},"Z2iZ_tNvsonXNlsbEAXBcw":{"text":"This place definitely my fav so far.. we had 3 dozens fresh oysters and 1 dozen charbroile","useful":0,"cool":2},"m3jGqxEGf00DNuuKFQDx5w":{"text":"A brand new restaurant in the CBD on the edge of the French Quarter. Specializing in local","useful":2,"cool":2},"yMl6lI3gq637sRXXKNcWwA":{"text":"My new favorite casual dining place inNew Orleans.\nThe price/quality ratio is great. I had","useful":2,"cool":3},"io2wzQgS1730bZohQPfzGQ":{"text":"I am really starting to love this place.  I've been working in New Orleans for about a yea","useful":0,"cool":1},"OpMlYbJO_3mJRBPGN1NdMA":{"text":"My first meal in New Orleans. The picture of charbroiled oysters drew me in and I don't us","useful":0,"cool":1},"aQ2i84jNJMUFZ8DDJDN6pQ":{"text":"This place is great! \nWe were lost and walking Along the streets downtown looking for oyst","useful":0,"cool":1},"OVDD-N8ReJklYnhTjM9c3g":{"text":"Great food and more local off the beaten path vibe. The bartender was outstanding and offe","useful":0,"cool":1},"s7ALEtgDGCGs7Atn0liSKw":{"text":"Seriously the best oysters in New Orleans! We had a dozen charbroiled and a dozen Rockefel","useful":1,"cool":0},"Oiirw5t4BH1tT7ZsLWd5Wg":{"text":"I had the best dinner at this restaurant. The oysters were fresh and yummy and specially t","useful":0,"cool":0},"Nwt_26ViPr5865DA7KYvHA":{"text":"Words cannot describe the incredible service and food - the basilica on their salad was pe","useful":0,"cool":2},"C1Xx8QbQkdxN5DZRv29f0A":{"text":"When I bit into my Oysters Benedict I nearly fell off my chair. Soooo goood!!!  The servic","useful":0,"cool":0},"RHMUOcvJ6m3ErXq9LuiUSw":{"text":"Kelly was excellent \nFood was great. Our group had a mix of breakfast & lunch. The fried s","useful":1,"cool":1},"CzYxtQYsolZWDAMpn7jttQ":{"text":"This was my first time here, and I plan to make it a regular stop on future trips. Got the","useful":0,"cool":1},"MELdkSRiSSzY9cWQyeuWag":{"text":"There's not much to say. \n\nWe came here for happy hour. It's $9 raw dozen and $2 off selec","useful":6,"cool":3},"_shmprQ8RSjvWDgpIQlUxQ":{"text":"Was in New Orleans two weeks ago and had a great dinner here. We had the mix, from steaks ","useful":0,"cool":1},"b5JSttuH3QC129qTJGvsHw":{"text":"Omg this place is amazing!!!! Went here for brunch had their crab cake Benedict's!!! The c","useful":0,"cool":1},"KfcSi6TEW_PSaru-xryfPA":{"text":"Great place! Great oysters! Great service!\nTotally recommend! Especially raw and charbroil","useful":1,"cool":1},"4EVZT4N2qRgI3OgJgMtUhg":{"text":"Great little restaurant near the quarter.  Service was friendly, as fast as can be expecte","useful":0,"cool":0},"PK1EocZ4GyKQ2kv2K5yMyg":{"text":"I was having the worse day ever after a crazy night before :) I walked in here because the","useful":0,"cool":0},"Rbzs54erCTu5-sM9YFXJlA":{"text":"Al, sarah and mrskb are the BEST ! If you come to NOLA a visit here is a MUST! Happy hour ","useful":0,"cool":0},"kCZYdHvLIC0mxj_8rlbDRw":{"text":"The eggs Benedict and French toast were amongst the best I've ever had. The staff was very","useful":0,"cool":1},"HjvXcU_jMl2-yQnr9bnfrA":{"text":"I went for dinner. Service was great. Food was good too. I did expect slightly more from t","useful":0,"cool":0},"A_FHMcIorCYwGaR0E-qr5Q":{"text":"Wonderful breakfast. We had omelettes, French toast, and the traditional eggs Benedict and","useful":0,"cool":0},"IRt8xuQyufw9aXTdD0jsYQ":{"text":"Bottomless Mimosas for $15! The food is decent. The staff was friendly and funny!","useful":0,"cool":0},"pwHSseX8IWNiqGAYKk-3jg":{"text":"Great find . Wonderful service , especially bartender . Little atmosphere but food more th","useful":0,"cool":1},"gDkuUXvHQ2YPkWlPX6CU_A":{"text":"I highly recommend this place! The staff made us feel right at home and the food was amazi","useful":0,"cool":1},"yE3dRaPCS69UGieNmm2ioA":{"text":"CAJUN PENNE PASTA\n\nPasta was very creamy and flavorful. There is enough sauce to dip the g","useful":2,"cool":2},"icSqHpvCRI13q4FrE_ob1w":{"text":"First time that we have eaten here. Thank you, Susan the cheery hostess, for greeting us e","useful":1,"cool":1},"FYs9qzTgx8af7Wge_0OARQ":{"text":"This place is an absolutely amazing find!!!...very local cusine with a quaint atmosphere t","useful":0,"cool":1},"rx-T-OO76tbAJOR88kq8uw":{"text":"Such a great find! The Crab Cake Benedict was fabulous! Service was excellent. The mimosas","useful":0,"cool":0},"bxeKbcCFMe1mo1_--DCLgw":{"text":"This charming restaurant has the BEST charred  broiled oysters.  Their potato salas as a s","useful":0,"cool":1},"RuwD8SKu7wQ7Bn08ayt_MA":{"text":"We went at happy hour, totally impressed all round. We had 2 dozen oysters on happy hour, ","useful":1,"cool":1},"9ukVB8xir1OLxTFLSHuzIQ":{"text":"Amazing spot for oysters! Tried the char-grilled and raw and hands down some of the best o","useful":1,"cool":1},"VfQIzxrAFHm7f45LBzDbIQ":{"text":"This place was within walking distance of our hotel. That was a plus! We were invited in a","useful":0,"cool":1},"sN-ZVzUCP_O2sacFo0eDSA":{"text":"The best part about this place was the atmosphere. It's kind of tucked away out of sight b","useful":4,"cool":4},"xO5cgs_Tj1xbR7sQkdAxZg":{"text":"Food and service was awesome!  Had the charbroiled oyster app,  blackened redfish and sear","useful":0,"cool":2},"fybQGXWu2Dy0HrmHiAIjaA":{"text":"This place has the freshest oysters in New Orleans. Our waitress Ashley and bartender Jare","useful":0,"cool":0},"hRPtjSxH0TRcpcf5LN73TA":{"text":"We went there for dinner after reading about their excellent happy hour. It didn't disappo","useful":0,"cool":1},"yHtI2-ve8VQwrBG8JbIC6g":{"text":"This was where we had our first New Orleans dinner. We Yelped for a place close to the Wal","useful":0,"cool":1},"ao4LLIaFw9zC5aw5lAiJeg":{"text":"My husband and I were staying near by and gave this restaurant a try\n I ordered a Bloody M","useful":0,"cool":1},"YfL-SDCn8PfHEyZPNQ53Jg":{"text":"Had my usual in New Orleans, some charbroiled oysters and a fried oyster platter. The food","useful":0,"cool":0},"G_Drz-uFYERVRFChTTgadQ":{"text":"Got right in with no wait. Charbroiled oysters were outstanding and our waitress, Kelly, g","useful":1,"cool":1},"MMmz9cVen2PY7LnM3IrS1w":{"text":"Great place for a laid back dinner. Red fish was very well prepared and the chocolate moch","useful":0,"cool":1},"2IuUC1fr4pOMV1eMr2hQKg":{"text":"The oyster is great.  However the shrimp salad has a strong smell.  its not fresh.  I had ","useful":1,"cool":0},"1z_6RqxNCIXYzQjvl9sXPw":{"text":"Looked at Yelp for guidance on new and exciting restaurant. Galliers came up with good rev","useful":0,"cool":1},"cyrcxdreo6UK6YHBaeIzPQ":{"text":"Some of the best oysters I've ever had! So good we came back for breakfast after dinner th","useful":0,"cool":2},"NvDV4qX7kb0sRgyEHu2BAw":{"text":"Best place ever for fresh raw oysters for happy hour! Great martini's and drinks! The staf","useful":0,"cool":0},"AMaWxIE4wp9j4nOx8gEBug":{"text":"Gallier's opened on Valentines Day 2017!\nGreat Yelp reviews, so we gave it a try.\nReally g","useful":1,"cool":2},"aRr4YseP2GJRJrA4NGaNSQ":{"text":"Came in on a Saturday night with an 8:30 reservation for seven people. I'm not sure we rea","useful":3,"cool":1},"2xEa9dKvZlP0sD-tuEhKsA":{"text":"I stumbled upon this restaurant on a short conference trip to New Orleans and went there t","useful":0,"cool":1},"N2n8iVDLCSo9xZFyzGnc2w":{"text":"Good food but rude waitresses\nThe food are good with reasonable price but the waitresses a","useful":0,"cool":0},"m0xWOdZ7Z66Zehe4a4KIxg":{"text":"The oysters here are so delicious! Gumbo was okay and the famous gallier sandwich which my","useful":0,"cool":0},"GQpYaKoWve4o4isPG4tRjw":{"text":"Nice little start-up bar near Canal street in the heart of NOLA. The food was exceptionall","useful":0,"cool":0},"ocqHIzdPQsjraYGGsa_bng":{"text":"This place is so great! They have bottomless Mimosas and Kelly is the absolute greatest!! ","useful":0,"cool":0},"r5P7Z89UsTGiOISXin8bQw":{"text":"Visiting from out of town and we saw a sign out front for $15 bottomless mimosas! We visit","useful":0,"cool":1},"DQKRizzjMUMJcrGUM-AxEg":{"text":"We came here twice during our 4 day trip to New Orleans, which probably says something in ","useful":1,"cool":2},"PqEVGEGjxjo_fHnS0xForg":{"text":"I love this place! Bottomless mimosas and bloody mary's!! Yess please!!! Shrimp and grits ","useful":0,"cool":2},"k9Fg2qE2S-IUY9hNYBA0Xg":{"text":"I don't understand all the great reviews. This was definitely one of the worst meals I've ","useful":5,"cool":0},"3HzV_i5EOd84A04RHPtFag":{"text":"Bar lunch was good so I figured come back for breakfast the next day. Opens at 8 got there","useful":0,"cool":0},"gzl0YPHEZfStD694M-4x9A":{"text":"Everything was good and fresh, including the service at 930 pm CST.  Fried shrimp was the ","useful":0,"cool":1},"WKM_cv_2SnEDPugZI9XL2Q":{"text":"Food was good. Kelli was a great waitress! We were a table of six and each of us enjoyed o","useful":1,"cool":1},"7zAdKBpBdlTmtCAcOiDLsQ":{"text":"Had the oysters and gumbo... very good.  I'm in town on a work trip and really like this p","useful":0,"cool":0},"732paMMDDSkUnh5o90_jUg":{"text":"Chose this place since it was close to our hotel and it did not disappoint! Char grilled O","useful":0,"cool":0},"hiVSzvUHH62-sEN0m9OgZQ":{"text":"Kelly rocks! She served up one of the best meals we've had since we've been in Nola and th","useful":0,"cool":0},"4iF9E7DSw-JC-MXts8uk7Q":{"text":"Oysters were delicious!!!  BUT BUT BUT, entrees were not delicious.  When I first got my f","useful":0,"cool":0},"N1uZxVnwW99iqzoRTZkJ0A":{"text":"Best Oysters I've had so far. I'm from Michigan and our oysters tend to be tiny. These oys","useful":0,"cool":0},"-2wVv28O7QH0-OkJwTQovA":{"text":"Great Food, service and ambiance. Kelly was extremely sweet and helpful. We visited this r","useful":1,"cool":1},"gAXCiavnq4z57Xnn7WpT6A":{"text":"Fast service, great drinks, and our waiter was fantastic. The food was delicious without b","useful":0,"cool":2},"JjKlM1hCi1eaTuVUxtC9qg":{"text":"The mimosas are no joke! Bottomless mimosas for only $15 until 4pm on Saturday. Kelly was ","useful":0,"cool":1},"nTbLMa8LVq1rqx2sXUE86w":{"text":"We stopped by for breakfast and it was very good. The coffee was good, the food even bette","useful":0,"cool":1},"LoMj_6N9FZnF5yndPiSTfw":{"text":"Great food (loved the ribeye & gumbo), relaxed clean environment with amazing service! Kel","useful":0,"cool":0},"HXh6IulNqfJW7gvaT9AXBg":{"text":"Superb food in a casual atmosphere. Big plus: Happy Hour with half price oysters. Easy to ","useful":0,"cool":0},"IzfKyldnm2ap5qZRYnxhfw":{"text":"Sat at the bar.  Oysters were unbelievable and Redfish was awesome.  Better than that was ","useful":0,"cool":1},"jluU4N6W_9BvcT06ZpKRvA":{"text":"Had a great meal and great time with my family here. At first I thought the menu was limit","useful":1,"cool":2},"KTDxq8yXjaydPFvonUQqSg":{"text":"We ate here during the Essence Festival 2018.  Let me say in the defense of the restaurant","useful":0,"cool":1},"6Eo8xBPleWWPjqk835QJhw":{"text":"Located off Canal, right across from Bourbon. We stopped in after checking out the Insecta","useful":3,"cool":2},"LDyKFrIGAvOQwQsL4rInrQ":{"text":"What a find! The service was great and environment was relaxed and laid back. We got here ","useful":1,"cool":0},"D8prYhhnWGKxLopQ3KgYeg":{"text":"Amazing: oyster happy hour!\nTry the fried oyster salad and show up for the oyster specials","useful":0,"cool":0},"LjEhuPdKWPcvTFG6ZjQ_IQ":{"text":"Great oysters, cold beer and the pecan pie was made fresh! And Kellie, our food aficionado","useful":1,"cool":1},"jgpFMed1-YW7BDQf4vfy9A":{"text":"Website is misleading. Not a \"hot spot\" in CBD, no \"healthy choices\" selections. Tired, ne","useful":0,"cool":0},"D9I_AcVV_Ebo7oaQ4IKpaQ":{"text":"Tiny place, big flavors. Experienced and trained chefs make the difference. Well done. Fri","useful":0,"cool":0},"yhRHCSfT_DLm-i0phYIlkg":{"text":"Oysters were awesome. Gumbo was best I've had in NOLA. Service was fantastic (ask for Kell","useful":0,"cool":1},"V6Us34nEVHADqAf8fzVQFg":{"text":"First time in NOLA and this was our first meal in the city.\n\nThe decor of this place is ad","useful":5,"cool":2},"Q56fDVLUd-ibFdFqD9MLyw":{"text":"Fresh tasting seafood. Did the take out with Uber eats at our hotel since parking in New O","useful":0,"cool":0},"PQVhLaJdUqOk0dQpQLMYhQ":{"text":"Shrimp po'boy was really good! And the fries were also really good! Actually, the food was","useful":0,"cool":1},"hIU4BzP4rHX4_8Cv6DmgtQ":{"text":"The chef was amazing. He made us something special that's not on the menu.  The oyster bar","useful":0,"cool":0},"4LPKejKfFyPVPod_qHFoLA":{"text":"Great, huge oysters! So delicious and gumbo was so great! Ji and Perry gave the best custo","useful":0,"cool":0},"0FoSA5FImBA7qk0pevdigQ":{"text":"You've got to try the Elder Pear martini!!  We also tried their red beans and rice - yummy","useful":1,"cool":1},"Sk3ZRhhTyiRQ5CvjOsMI3w":{"text":"Excellent happy hour stop!  Kelly provided excellent service while Joe shucked tasty oyste","useful":0,"cool":0},"jQTe0pA8qSwQxuQA-2Z0LA":{"text":"Great service, great food southern hospitality at its best!!! A must go to. The bottomless","useful":0,"cool":3},"uK4_3iODcLoWgyGbs0_26A":{"text":"This is a small nice restaurant. No wait for us. Fresh oysters. Nice cocktails.  \nGood san","useful":0,"cool":0},"Xcdx5nmi7v6WHExRDpH40g":{"text":"Bottomless mimosas for $15... what else do you need to know? Food was great, service was b","useful":0,"cool":0},"xqZBvABmtRVlolDw60D9fQ":{"text":"Creole grilled oysters are excellent. Red beans and rice also excellent.  Good beer select","useful":0,"cool":1},"Toib1Op0c3iOb8OdvdEwBg":{"text":"I'd give this place 4.5 stars if Yelp would let me. Wound up here after lousy front-of-hou","useful":1,"cool":1},"IuVSX3slSDYNg1Rc7vgRdA":{"text":"We came here for some greasy spoon breakfast and got it in spades.  Some New Orleans flair","useful":0,"cool":0},"xn-zOmhh-Tzi4A40xJoYzA":{"text":"First of all, we came here for the unlimited mimosas. We were pleasantly surprised with ou","useful":0,"cool":0},"ehliTB3qAOyjS5UC_zWvtA":{"text":"I expected this to be better based on the reviews.... i was a little disappointed. I had c","useful":0,"cool":0},"oSGr1oWigih1VYqvermh_g":{"text":"We got here for happy hour. $9 for a dozen of the biggest oysters I've ever seen. Deliciou","useful":0,"cool":1},"2Z8sQDDBoypJxTF4ejbNlg":{"text":"Great chargrilled oysters and amazing bloody mary's. The bar tender was fun and shared inf","useful":0,"cool":1},"W6BKUz1m5Tb0qWEh809-kA":{"text":"We were looking for a last minute meal during our last minutes in NOLA and we were so happ","useful":1,"cool":1},"ThqqNH2YBKeRD46T6H-wfw":{"text":"New place, I was on an overnight business trip and stopped in on a whim.... have to say it","useful":0,"cool":1},"12vjBx-2YvKvyV0PEQarcg":{"text":"AmaZing!! I don't even usually eat oysters and I was licking my plate. Definitely a must e","useful":0,"cool":0},"hJxhGhkeHtGIYtFBNhpZqQ":{"text":"Amazing and cheap oysters. Friendly staff and very affordable food. Check this place out.","useful":0,"cool":0},"6br9W4bKgTmEmmVy_GTWjw":{"text":"We were a party of 8 and set a record for the number of oysters ordered-11 dozen and we en","useful":0,"cool":1},"uW2fH_LLWnWptTwu-_68og":{"text":"Went for brunch.  Cajun eggs Benedict and fried oyster platter both great.  $15 unlimited ","useful":0,"cool":0},"uCWiMD-gVTXFMKlSWRTqAg":{"text":"Great food, especially the oysters!  Not pretentious, casual atmosphere.  Great happy hour","useful":0,"cool":0},"RVyeJEiscSpzqu_CmaeIEA":{"text":"From a local, trying Gallier's for the first time.  Customer service is unprofessional, sl","useful":0,"cool":0},"QvwURrq_gCVmk8QXj7vAjw":{"text":"Came here to try it out and it was ehh. We showed up early in the afternoon on a Sunday an","useful":0,"cool":0},"DW6EJI6fImO9dnMXPcqYiQ":{"text":"This was an awesome  restaurant. We had the bottomless mimosas for $15 and the oysters and","useful":0,"cool":0},"VaghOd6eteZnLe_mRXOhHg":{"text":"Came for a the happy hour deals and was not disappointed. I had a dozen oysters and they w","useful":0,"cool":1},"-ACNO2UIMWFQHxGo8rhpRA":{"text":"The oysters are amazing. From the raw, charbroiled to fried!!  Fantastic. Our server, Kell","useful":0,"cool":1},"1WAV_9xrN3qQfLm9zItbmw":{"text":"We went here for breakfast and I had the best Bloody Mary ever. The bennies are terrific, ","useful":0,"cool":0},"-kzrWBEBg-Zp1pTKEXx1Zg":{"text":"I would give this place 6 stars if I could. This place was right by my hotel and has great","useful":1,"cool":2},"R8y_PklsCtEphk0CVeDfSg":{"text":"Food and service was AMAZING! This is definitely a diamond in the rough. Will definitely b","useful":0,"cool":1},"AYugiA7IV5sBrUToJWuhMw":{"text":"This quaint little place that is a 2 minute walk off Bourbon is a gem. Great gumbo. Top sh","useful":0,"cool":0},"9yLKj8cXW6ophmljHx66Dg":{"text":"The oysters are amazing.   We asked Christine for her recommendations and we all enjoyed w","useful":0,"cool":0},"Vdmh_AqVmCcg8f0ri2F8ow":{"text":"I had a blast at this little eatery, the oysters were amazing, the gumbo gave me a fire an","useful":0,"cool":0},"ax88j0Njfjwk0GDKj23Gsg":{"text":"Place is supposedly highly recommended during Happy Hour but, when we visited on St Patty'","useful":0,"cool":0},"zJ_yMr6sh6lwghmKxMYjdA":{"text":"Visited at 9:00 p.m. on a Wednesday night. Place was nearly empty. Sat at the bar. Had a d","useful":1,"cool":0},"rMzNpYLdY7bUT5MU0-NnPQ":{"text":"Fantastic shrimp remoulade, fresh oysters and fresh salad. The homemade waffle chips were ","useful":0,"cool":1},"xL0W3BZVUj60LZGjSplwTA":{"text":"The best food and service in New Orleans! I highly recommend this little joint to anyone l","useful":0,"cool":0},"O3iaoMsYyHXceHE5NN_NhQ":{"text":"Unfortunately we chose this restaurant as the first place to eat on our first visit to N.O","useful":0,"cool":0},"e8nVyowy6PhkBsTYZs5mIw":{"text":"I am so happy that I turned left instead of right as I was trying to find redfish cafe on ","useful":0,"cool":0},"iQ7tNGfe9yE4vTFmMpM0YA":{"text":"This is not my first time coming this place. I ordered median rib eye that day but the ste","useful":0,"cool":0},"K7H6qpQvwHkHdUWdDUrqhA":{"text":"I love oysters and this is the place to go for oysters! What's even better that their dail","useful":1,"cool":1},"a8L5pgMDHS1DxRevQxxg5Q":{"text":"We were looking for late night eats as our flight in got delayed and this place was open t","useful":0,"cool":0},"oWSStc0aJGYAcfrTquxYGA":{"text":"Great service. Food was good but didn't wow me the way I expect NOLA to wow me. Boudin app","useful":0,"cool":0},"groG7bT8WtMawdNWkwkH1w":{"text":"Yum!  I normally don't leave reviews, just read them.  But this place is worthy of it sinc","useful":0,"cool":1},"FcFgJKTbT6ATuCDaMjGPkA":{"text":"I'm at this restaurant every time I'm in New Orleans. Delicious food, nice atmosphere, and","useful":1,"cool":0},"pnjOsmf9vr0CyEGdDBf0tw":{"text":"4 1/2 star average? Maybe it's because my expectations were just so high about NOLA cuisin","useful":0,"cool":0},"vp8RQvKzlj-UZFj8KmOeOw":{"text":"The charbroiled oyster was good  but the food don't let the pics fool it's not as deliciou","useful":0,"cool":0},"Sfvt54znOWL6NvNLo0UEDg":{"text":"What can I say that isn't already said in the photo below--whole fried snapper!! Oh yeah, ","useful":0,"cool":2},"sWC4dT4MwQoVV3aTV_qZuw":{"text":"Sit at the bar and enjoy Dave's drinks and Perry's oyster. They make you feel like you are","useful":0,"cool":0},"EMA4aCR84jl2aoLQ10mSmQ":{"text":"This place served a great gumbo, and excellent cocktails. Friendly service and a creative ","useful":0,"cool":2},"cN5_PzI-QsxZTZD4frr-Dg":{"text":"Great food, great service, great value!  What more do you want?\n\nCame back two mornings in","useful":0,"cool":0},"QLRGoClEgq1jjeE1YCmC-w":{"text":"I dined here for brunch and it was great. \nFood was priced very reasonably and my party wa","useful":2,"cool":2},"f32qMD7pbm-THMsw0pRI1Q":{"text":"Lunch was wonderful! The gumbo is delicious! Kelly was fantastic! We had beers and a great","useful":0,"cool":0},"Sl61LcjvDBDP_RpTbOB1pA":{"text":"Awesome place.  I was on a business stay for 20+ days and hit a lot of the \"have to\" place","useful":0,"cool":1},"5wEgv81viePomMz6tFCj3w":{"text":"Came here for happy hour with my husband and a friend. We enjoyed the raw oysters and also","useful":0,"cool":1},"nfC1x8WhIjSjo_4JsiVglA":{"text":"$9 for 12 oysters at happy hour, and fine oysters they are. Drinks are $3-5 for hh as well","useful":0,"cool":0},"2widEsbxQ9E5ZvZLYOgMHA":{"text":"After reading the reviews, I had high hopes for this restaurant but in the end I was disap","useful":0,"cool":0},"FXn0HfNvyQS43VpiR_0yFQ":{"text":"It was okay to me.  Food came out quick but the gumbo was not as good as I had in Lafayett","useful":0,"cool":0},"VGj4vPFPaV-JnKS9mFmAmA":{"text":"Dropped by for the happy hour 3-7 PM. Gi and Perry had excellent service. Perry was funny ","useful":2,"cool":1},"3qfYssjXDawfOfbJrsmMHQ":{"text":"Delicious food!! Loved the char grilled oysters and red beans & rice! It hit the spot and ","useful":0,"cool":1},"fe5Vmj8yn2iL48RkMHxy9Q":{"text":"Awesome Brunch today ate here around 11:45am.The food was hot and delicious. Amber was a g","useful":0,"cool":0},"AV2Sl4TBWveCk2_PW7komw":{"text":"Absolutely delicious food and wonderful service. The blackened redfish, gumbo and coriande","useful":0,"cool":2},"E3ZBWUltAI3sEjKKt_Ic6A":{"text":"My daughter and I had dinner in this restaurant twice and we highly recommend it. The food","useful":0,"cool":1},"WqO3ZUfWiUau7An378KucQ":{"text":"So glad I happened to run across this restaurant. Everything was delicious. Started off wi","useful":0,"cool":1},"G4wRAa1EN7sxkUeSTEUq_A":{"text":"My friends and I decided to come lunch here yesterday and I wish we would have just went t","useful":0,"cool":0},"5CxwonPDNPBrks0rsHzTuQ":{"text":"Unfortunately we chose this restaurant as the first place to eat on our first visit to N.O","useful":0,"cool":0},"FPg755LtKZcHhC4BS-L0Ag":{"text":"I would said 3.5 stars.\n\nWe catch the 3-6pm happy hour. Happy hour is selected items only.","useful":0,"cool":0},"bZ4shyrtW9NNdFz2w2hcLA":{"text":"We seen good reviews and wanted to try Gallier for Breakfast...It was very happy experienc","useful":0,"cool":2},"CxjtP6ASTUEKnZ50po72_w":{"text":"Great happy hour deal on oysters! Red Beans and Rice and shrimp and grits were pretty good","useful":0,"cool":0},"kkaycOPfquSR1s2AVUMnTQ":{"text":"Love this place, we went twice because great food, drink specials and awesome friendly sta","useful":2,"cool":2},"RlIr8Oi5iGXicm_ZXHsksw":{"text":"The oysters were 5 stars. Loved the creole oysters and the sauce they were baked in. The b","useful":0,"cool":0},"wk_-AU_RJkPQGeFInIp87g":{"text":"What a waste of a meal in New Orleans. In trying to avoid the fried crap on the menu, I or","useful":0,"cool":0},"oqQE09tIWgZELhi2iv31xg":{"text":"出張中に立ち寄りました。生カキがプリプリ。1日に400個出ているそうです。隣のおじさんは1人で3ダース食べていました！お値段も非常にリーズナブル。オーナーもフレンドリーで、名前を聞","useful":0,"cool":0},"MND25FVfuYaoKW3kunNRJw":{"text":"Service was ok, just started a little slow. Ended up great. Had the Crab Benedict, eggs we","useful":0,"cool":1},"HGvP8KE7bQaJKsy66mARkQ":{"text":"Went in for oyster happy hour. Oysters were very cold and tasty. 3$ drafts. Wife had shrim","useful":0,"cool":0},"xooKZ0ST0IeMZihvMfvMng":{"text":"Mrs Kelly is legit!!\n\nGreat food, better service \n\nAwesome gumbo \n\nGreat place to watch sa","useful":0,"cool":1},"4OIQXCbxnam3K5Dh2PX7rA":{"text":"The oysters were amazing!!! Our waiter was a bit sassy (in a good way) and suuuuper nice. ","useful":0,"cool":0},"FBhciJ_X0tnfFiBTx385Iw":{"text":"Stopped in for happy hour today and had the best experience. Kelly our waitress was so fri","useful":0,"cool":0},"V5t2PHSgP7x5BeFz_haiXw":{"text":"Nice little Restaurant with a good happy Hour Deal. Staff is very friendly. Not as tourist","useful":0,"cool":1},"HAwnQ8T_5LS3RWPQRUdQPA":{"text":"Sunday morning and kicking the day off. Place is quite. Good staff. Good bar. The gumbo ho","useful":2,"cool":1},"eo-X4gnlEcGQFeldosIkHQ":{"text":"Breakfast was great and service by Al was excellent. In town visiting with wife and had th","useful":0,"cool":0},"THudRIyo41lt-9zHxZSlXg":{"text":"Love it!!!! Ordered Seafood Omelet and French Toast  There was no wait, got here around 11","useful":0,"cool":0},"Qh73TsEDCgzD4DqGvML8bQ":{"text":"Food was ok, service was so slow.  They were not busy at all and took forever for someone ","useful":0,"cool":0},"-ESgQEiRyfRY_KvnOLruqA":{"text":"The service was great. Would have given 4 stars but my red snapper was over cooked and I h","useful":0,"cool":0},"ZMplQx7M943qMRgl8P98rw":{"text":"Great place! The Rockefeller and creole oysters were amazing! The gumbo was great too. Hig","useful":0,"cool":1},"bxF6ALIqaikLa1mNZs347g":{"text":"Really great food! Had fried oysters and jambalaya, wow! I'm here for business and had one","useful":0,"cool":0},"cy-uDbkTJb-FmD1eZ51J0g":{"text":"We searched on Yelp for restaurants serving an interesting Happy hour menu and that was ne","useful":0,"cool":0},"8QhInuRtlgOm8EU1bVvPWQ":{"text":"We came here when all other restaurants we wanted to go to were booked. It's a casual rest","useful":0,"cool":0},"uU_trw8qoxN6hHw2Y412wQ":{"text":"This 5 star review is strictly for Kelly... her service was fantastic. Perfect spot for br","useful":0,"cool":0},"EccbC5xDuaZCDZw5_ZfbIw":{"text":"What a treat! Our bartender Al was the perfect addition to a great lunch. \nWe had the frie","useful":0,"cool":0},"fkyQwTT_-9OJAVuCoe0K5w":{"text":"The shrimp étouffée was one of he best meals I've ever had here.    And the $15 bottomless","useful":0,"cool":1},"ldLyH6dtLYVLYNknn_48uw":{"text":"Great little find in New Orleans.  Small spot.   Friendly people... that what find here on","useful":0,"cool":1},"RmIKhdqKJJGizfnl85GCJw":{"text":"The meal was excellent.  We split charbroiled oysters, gumbo, the fried oyster sandwich an","useful":0,"cool":0},"5zmWHKPtXDPKNwRBWY3ijw":{"text":"Oysters and drinks are their thing. I don't really like their entrees or gumbo (way too sa","useful":0,"cool":1},"dJj6fRwkNb-prnY5lzO9pA":{"text":"The oysters here are divine.  Freshest we have had  short of gathering them ourselves! The","useful":0,"cool":0},"ekFyrb-Tza9jtgR7iJhn3w":{"text":"This was one of the restaurants on my list to visit for oysters but, we came here by mista","useful":0,"cool":3},"7T9K4fFKR4is1ZicLFrFIg":{"text":"I stumbled upon Gallier Restaurant by accident after my first choice fell threw. Casually ","useful":1,"cool":2},"uaaP3zeJMCf2yia_BH7WzQ":{"text":"Always love to come to this restaurant when I'm in town!! Everyone is so friendly and help","useful":0,"cool":1},"kOXHRrz6qOr-ZqPGLre2HA":{"text":"Food was OK. But the waitress and the manager has no idea what are the ingredients in the ","useful":0,"cool":0},"2O5XVh94pUfYGruWVnqNDw":{"text":"The oyster shucker was amazing we was a Nola native which me and my husband loved. He made","useful":0,"cool":0},"louUZq8R5-cAW-JBkO_iEg":{"text":"Right down the street from our hotel, on the way to Bourbon St.  The plumpest, juiciest, s","useful":0,"cool":1},"2peBzIdlvsj7XtoUvNAAKw":{"text":"We've been here 3 or 4 times and it gets better every time. The crab cake Benny is phenome","useful":0,"cool":0},"PCTWKOc5aaCEzpy4A_wFEQ":{"text":"Good fresh food! Came the first day and had happy hour $5 food: etouffee (2), gumbo (2) an","useful":0,"cool":2},"IdA46igHxpTWxDAryAK8aA":{"text":"Happy hour prices are awesome. Oyster trio is delicious. Coming back for the raw. Big shot","useful":0,"cool":1},"AIq1Ijg4i1-VeUm9ld0HIQ":{"text":"This is a great spot a hidden jem in New Orleans the food is exceptional the atmosphere is","useful":0,"cool":0},"9nzbqUVAmuOvN2EWyowf5Q":{"text":"My wife and I dined here at this gem on Bourbon Street during the Essence Music Festival a","useful":3,"cool":2},"VN804ucuhuNRw7yLMGDWBg":{"text":"To compare, I had oysters at Felix and Acme in the French quarter before I came here. This","useful":0,"cool":1},"W3MfI5ocsTcncHl4G3diNQ":{"text":"After several fried fish meals in New Orleans, we decided to give Gallier a shot provided ","useful":0,"cool":2},"vZaIg2F9rW6s0cNXn3h3FA":{"text":"Nice little neighborhood bar and restaurant. \n\nHad the seafood omelet which was surprising","useful":0,"cool":0},"2SCwYZ_dAUb5ZlH4Q1dRZA":{"text":"Was here for a conference.  The best place.  Large fresh oysters. They are the best broile","useful":0,"cool":0},"DuHirmWm5fiNOaON5z-X8Q":{"text":"Atmosphere was pleasant, the gentleman shucking the oysters was wonderful to speak with! H","useful":0,"cool":0},"fMtnOm1e1Ye6fk1OE95wfA":{"text":"A cute little place, with awesome service - Al was so friendly and attentive. We came here","useful":0,"cool":0},"QaM1KEP4G3fKOElHNMMYVQ":{"text":"What a hidden gem! My last night in NOLA my husband and I came here because it was close t","useful":3,"cool":3},"ww8a13WRIk18DJ54aEe8eA":{"text":"Last year, I came here with my group of friends and got myself the crab cake Benedict's fo","useful":1,"cool":0},"yWHuZ1zYnld7XVt9eme55Q":{"text":"Ohhhhhhhh mannnnnnn this is the my favoriteeee spot when I came to visit. We happened to j","useful":0,"cool":1},"lNF_wtWRLTWy4H5sM0omFg":{"text":"We just had one of the best meals in NOLA. The charbroiled oysters were sensational. My fr","useful":0,"cool":0},"aV_yHkmodm65_AqpiNDEHg":{"text":"Absolutely delicious fresh oysters. Great service. Avoid the lines at ACME and come here f","useful":0,"cool":2},"fGUXMqBepEZTnBpwCcpDdg":{"text":"Great food.    Drinks are good and strong.  Worth the visit.   I would rate 8.5 out of 10","useful":0,"cool":1},"zIxSEkI1UIbbcRow5Yas3A":{"text":"The shrimp remoulade sandwich and potato salad was really good. The customer service was e","useful":0,"cool":1},"Oevx5a9RVrRftPhv8b0V2Q":{"text":"Complete opposite of NOLA which was a horribly horrible experience.\n\nDecor is fine. Food a","useful":0,"cool":1},"VxnM7vA5D-ewk9prNkNMWw":{"text":"Ever go to a place that you know has great potential---but you seem to get the worst servi","useful":0,"cool":0},"pnFnjceAAsVa6EUyaT9odQ":{"text":"My boyfriend and I stumbled upon this restaurant during one of our walks and I can tell yo","useful":1,"cool":0},"wlYrmPkulzSsKUwjI90k1Q":{"text":"Good charbroiled oysters. The po boys are on buttery French bread. The seafood omelet is p","useful":1,"cool":0},"Mrjf21S-OBf_8351MqeTiA":{"text":"This place was recommended to us by a friend that grew up here. He said to go here over Fe","useful":1,"cool":1},"nCl5HQULO0ridnn-I050og":{"text":"The chargrilled oysters were some of the best that we had while in town. The seafood omele","useful":0,"cool":0},"IZl6JBQOgYHYQmVOK1xmtw":{"text":"That shrimp po boy was absolutely divine. Staff was extremely friendly and helpful. Would ","useful":0,"cool":1},"5TKciiV0FPRti5VmnDBqsA":{"text":"We dined here on Super Bowl Sunday.... It wasn't busy however the service here was SUPER s","useful":0,"cool":0},"03LMCRyKHoyOoUwTWRFJWg":{"text":"Stayed at the Hilton Garden Inn down the street and we were looking for a breakfast spot! ","useful":1,"cool":2},"dgiSlwcvu0LNdQS_JYAIGg":{"text":"Went for happy hour. Spent 2 1/2. Oysters, gumbo, shrimp, grits, crab cakes and I could go","useful":0,"cool":1},"Yp39UcKJVOCyK-hIvNUsqw":{"text":"Absolutely amazing food and Lyka was super on top of our service.  I would HIGHLY recommen","useful":0,"cool":1},"BoCdD-uEfbi6e00zlRuaDw":{"text":"I came for breakfast and was pleasantly surprised by the Rise and Shine Special, $3.99. Ex","useful":1,"cool":0},"wnG1faw5kcP4G40HaEyh5Q":{"text":"We had the fried oyster benny and seafood omelet. Also had some arugula with tomatoes. Eve","useful":0,"cool":2},"4JXRxxsQazsZZhNYuToHhA":{"text":"Love this place! Great happy hour menu and service is knowledgeable, helpful and professio","useful":0,"cool":0},"C2U0LtIG-XmfEA_A8bWiqA":{"text":"A group of 9 of us did not have reservations and immediately got seated upon arriving duri","useful":1,"cool":3},"FBJOMGnyyXUaGCobT6mJyQ":{"text":"Came here because we arrived to town late, it was near the hotel and we were tired. We had","useful":0,"cool":0},"OQ3_79JGsmiJ0QwiyjGpnA":{"text":"Best deal for oysters in town. Bloody Mary's were also on point. Wait staff is friendly! \n","useful":1,"cool":2},"9yVqhUEAQyfIPIW7im6FIQ":{"text":"Did not like this place at all. We arrived and got our drinks pretty quick. We ordered our","useful":0,"cool":2},"nMz6w_23FomAT92EYPcSwQ":{"text":"Food is AMAZING but the service is AWFUL AND the place is EXTREMELY HOT!!!! I ordered Happ","useful":0,"cool":0},"hYwnOiA0G55pxJVtnxufHg":{"text":"I personally thought this place was better than Acme Oyster House, better pricing and they","useful":0,"cool":1},"jaSXl_d7W8Hjrw5LhYdn3g":{"text":"My wife and I ate breakfast there this morning. The food was great and the service was bet","useful":0,"cool":0},"0A-XiVTkV7vdPT7tnTgxTQ":{"text":"Was so good!\n\nWe ended up sharing a bunch of appetizers \n\nCrab cake 9$ - large and amazing","useful":1,"cool":2},"LN_mgQl1PAeJbNr9e5Y5rg":{"text":"We liked it so much we went twice!  \nBreakfast was large portions and great flavors. The o","useful":0,"cool":0},"ue64RyS_ffnM_x84uBgtgA":{"text":"We chose this place because we wanted seafood but didn't want to deal with crowds on a Fri","useful":0,"cool":1},"nG0pTl-02Won0tGEhcncxw":{"text":"Great place. Had the chargrilled oysters and they were amazing.  Great flavor. Ordered the","useful":0,"cool":1},"BVydkCEsce-JtxHsk2NBWA":{"text":"Cool place with a great bar.  The Taste of New Orleans lets you try the gumbo, crawfish et","useful":0,"cool":0},"pJqst0NovIJ5_sn7l7cvYg":{"text":"The food here alright, especially the pasta. THE RED BEANS AND RICE ARE A DISASTER. We ord","useful":1,"cool":1},"1yxl6SNel3SmUNyyGmdWUQ":{"text":"I found this place on yelp and thought I would give it a try since the reviews of the raw ","useful":0,"cool":0},"WLcloYT0hKO1SRyFySSVGQ":{"text":"Went here twice.  Happy hour oysters are $10 a dozen and are the freshest in NOLA.  Shrimp","useful":1,"cool":1},"YABWlvZWGdGAeDhsW76nzQ":{"text":"I still think one of the best things to do in Boston is to visit the red brick district...","useful":0,"cool":0},"5XyTw1SocbQhZXmUZS3vgQ":{"text":"Visited New Orleans last week and stumbled upon this gem.Best charbroiled oysters of the t","useful":0,"cool":1},"yDvDcdog8Sp5m21rO8Q-RQ":{"text":"Incredibly slow service. They didn't have any oysters. Ran out. And the rest of the food w","useful":0,"cool":0},"57NYFbt67lwD9dhqJu0c8A":{"text":"Absolutely the best place to get giant oysters that are delicious . If there's a line you ","useful":2,"cool":3},"lcKpqzhJdAOtIzhBPoOoTw":{"text":"The staff was amazing. We were greeted by the host in high spirits and she gave us a seat ","useful":0,"cool":0},"O3EpfjA-mfTIkeKbu1QDcQ":{"text":"We ended up stumbling across this place in between our hotel and Bourbon St, just wanting ","useful":0,"cool":1},"14eAoDzv59yXHnJNZNumuQ":{"text":"We found this place while looking for oysters at 11pm after a wedding... what luck! The at","useful":0,"cool":0},"fI-fzBZyRuZaB4mFb1DGdQ":{"text":"Fresh oysters on the half shell and a wonderful amber beer...what a wonderful way to begin","useful":0,"cool":1},"zdgiO9TuaoZPKltSp-9-hg":{"text":"I would not recommend this place, it has to be mostly a tourist trap due to the location. ","useful":0,"cool":0},"D6pEoGAUtx9-6VFJ_lTlMw":{"text":"The service is nice, however the chargrilled oysters were subpar, especially if you've tri","useful":0,"cool":0},"xg1nfcZNcbJ1_LGndkpelQ":{"text":"We came in for Mardi Gras and were looking for a restaurant to eat at and this one had 4.5","useful":0,"cool":0},"Rem_GAKGsm9ojpsbvP-8OQ":{"text":"I personally thought this place was better than Acme Oyster House, better pricing and they","useful":0,"cool":1},"q_nLWsZCQOrj5kbqRHyNAg":{"text":"Small restaurant that you might miss if you weren't looking for it. Well you should look f","useful":0,"cool":2},"fl6EnBijMZYwYWIY5jf6rQ":{"text":"Ate three times at this restaurant during my recent trip to New Orleans. The food is great","useful":0,"cool":2},"lNvYJ72DHP6FdSln-g55kw":{"text":"Came in town for a long weekend and stopped in 3 different times for some oysters and drin","useful":0,"cool":1},"9sjM_ASlHrxKKoCsuO-h5Q":{"text":"Happy hour on a Monday, came in around 5 and place was pretty empty.  Sat at the bar and g","useful":0,"cool":2},"A-xABAMc4pp9GRgTEHwJaw":{"text":"Good environment. Absolutely delicious Charbroiled oyster. Waitress was very nice.\n\nHoweve","useful":0,"cool":0},"rw0TIlp9PwQ2PHuOZmqenA":{"text":"Probably the best meal both the boy & I had our whole trip. Poached eggs on my delicious C","useful":0,"cool":0},"m2eDt-cW2anSDEaDSkWoQA":{"text":"The food here is good but not great or extraordinary or mindblowing. My boyfriend and I ca","useful":1,"cool":1},"mBl3sUc77-Li4y691bn9fA":{"text":"Great shrimp po'boy for lunch!  Best shrimp po'boy of 6 days of eating them at various res","useful":0,"cool":1},"Q5vAebNYW419X2haBNxrAg":{"text":"Over priced and underwhelming. The food was bland and service was just okay. I got the rib","useful":0,"cool":0},"LyD56-OUchStBj7uogUNPA":{"text":"Omg I can't rave enough about this place we came for drinks and a small bite.\n\nWe order th","useful":2,"cool":0},"uWglN1VR_ZX0p7bdnAD62g":{"text":"Y'all need to go and try there oyster special. The ambiance is great the music is good whi","useful":0,"cool":1},"gflbsE00yUFkqqNLGUQdnw":{"text":"This place is THE brunch spot. It is off Canal St so not on the main strip but boy this is","useful":0,"cool":0},"xuq_CreZyDDT0atUy4YvMw":{"text":"Excellent service. Even better food. I had the special, but all six of us had something di","useful":0,"cool":0},"vPIYG8FiAyx1jE1DH-Lo3g":{"text":"Tourist here. Came to eat some oysters. The oysters here were fresh but not as sweet as Ro","useful":0,"cool":1},"nT0qq7RgqjpWYR3JHwX-8g":{"text":"This place isn't good. Don't waste a meal in New Orleans. This place was a wasted meal! Ug","useful":0,"cool":0},"7KEdREwulcG0gYHKsxMfyg":{"text":"Great little spot. I stumbled on it my first night in New Orleans and wasn't disappointed.","useful":0,"cool":1},"OjkpKXHKXbs1aNSCosMCMg":{"text":"Fantastic experience from beginning to end!  I intended to walk in and start off with a ha","useful":3,"cool":3},"yOdaN9-qzWzfpq9b2MSd2Q":{"text":"Love coming in town just so I can stop by this restaurant! Such a great restaurant with gr","useful":0,"cool":1},"PnpdAeQxQn_u9rISmTKdiA":{"text":"The food was pretty tasty.  We had the eggs Benedict traditional and with crab cakes as we","useful":1,"cool":0},"eQDzBCEIC2OZ-XNGXjknYQ":{"text":"I was hungry and had a couple hours to waste so i decided to try Gallier out. The place wa","useful":3,"cool":3},"6KyoYFmMiusZKjwuCzaocA":{"text":"Went to New Orleans with the family for a few days and came across this restaurant on our ","useful":1,"cool":2},"pvPwXZveh9c8B9zrQ1hECw":{"text":"Simply delicious!  \n\nThis place seem to be the in place for college stude t's and younger ","useful":1,"cool":2},"nD1KuH5ggOCYwJKdzoh-eg":{"text":"Probably the best HH in the French quarter. I always come here during my visits. The crawf","useful":0,"cool":0},"VB1jotKGkkwO7uSbLDLbTg":{"text":"Our server Kelly was awesome! Had the Fowl and my husband had the Cajun chicken! Great atm","useful":0,"cool":0},"SnPOyjzZq94ki6nQ7JuPnw":{"text":"Stumbled upon this from yelp.  Great food!  Oysters were perfect!  Service great - will de","useful":0,"cool":0},"q6J7ScT3Jrn3WFcqwImw3w":{"text":"My \"blackened redfish with seasonal veggies\" came out as a piece of fish on a salad. I don","useful":0,"cool":0},"8uh2jbrG32IpQIoofe-F_Q":{"text":"Came for the oysters and walked into happy hour. Dozen oyster $10! Large, meaty, and not t","useful":0,"cool":1},"bd1imTo8Nmj3VqdbgmyP4g":{"text":"We ate at Gallier for dinner. The Creole ousters were very tasty. Its a little bit spicy, ","useful":0,"cool":0},"-KR57bt6p4i_OlboIfYCzQ":{"text":"Come for happy hour and enjoy 1/2 price draft beer.  Abita, Susie B, Lazy Magnolia Souther","useful":0,"cool":0},"TY-qcjH5WuuHupZtFeEjtA":{"text":"My friends and I visited from out of town, and decided to stop by here after seeing their ","useful":1,"cool":0},"rmyEgt8rigespWGM3RuHBw":{"text":"Hands down the best oysters I have ever had in my life!! The grilled are the best!! Full o","useful":1,"cool":1},"W8XybBuT1vDJRfOLA4jpWg":{"text":"Incredible oysters. \n\nCame here on Christmas Day to enjoy some more oysters while visiting","useful":3,"cool":2},"lfstg8Rpi_ol7mgYZeooBw":{"text":"Randomly stopped in for a quick bite with friends. We made it for happy hour. We had a doz","useful":0,"cool":0},"I8Ggo5ZtPCh7owUcgui6cg":{"text":"Would give it a zero if I could. Crab cakes are frozen and no crab all filler. The only th","useful":0,"cool":0},"wYU1MuDVIVTnThxaYeGVnQ":{"text":"The food was delicious!! Huge plates of food, service was great, and very affordable. Defi","useful":0,"cool":1},"bcBnygBLwtrTlJ4aFiAMPQ":{"text":"We went for lunch and the drinks and chargrilled oysters were so good, we went back the sa","useful":0,"cool":0},"qSEHFinVn6Dp-PUKkCKDyg":{"text":"Stumbled into this delightful little hideaway just off Canal.  Lines into the other two re","useful":0,"cool":1},"KVodE3_zysORnuxvCpi_Ow":{"text":"Friendly staff, but our server was HORRIBLE! The food & ambience of the place made up for ","useful":1,"cool":2},"Q1dJAF8IRhKhDYvlyazFNQ":{"text":"We went today, as we do before all home games and they weren't honoring their happy hour. ","useful":0,"cool":0},"xtvEBBLB0VJpQpCZDOK6DQ":{"text":"Great bartender and great food and drinks!!!! Rohan was amazing literally the best bartend","useful":0,"cool":0},"ZAY9lc8pDIA9r7-il9QVpw":{"text":"I wandered past Gallier and stopped in for a late breakfast. I enjoyed the crab cake Bened","useful":0,"cool":0},"eEH3-jMDTFP_fvTi--jPkQ":{"text":"I came here because of the glowing reviews, but was extremely underwhelmed by both the foo","useful":0,"cool":0},"wbymbdXagiZcWM4ycNXLTw":{"text":"Came in this morning for breakfast.  I ordered a fruit bowl that was suppose to contain a ","useful":0,"cool":0},"W537xMJhvkDcwU1gI4Drig":{"text":"We tucked in here for happy hour right as the sky opened up on us. They have an extensive ","useful":2,"cool":2},"IipxbHv0XslOFx4TCc3M0w":{"text":"Wow! We were looking for a convenient Cajun restaurant and found Gallier on yelp. Prices a","useful":1,"cool":1},"yp19fc4HY70XJqZ_srpm5g":{"text":"Let me first say that I'm not a seafood lover, but my wife is.  Gallier lived up and excee","useful":0,"cool":1},"N3HORpfKMsuiKgv10ogFsw":{"text":"Oysters and potato salad were amazing.  An excellent \"hole in the wall\" spot!  Gumbo was g","useful":0,"cool":0},"2S2h9RKpRqniT_dtHMCLyg":{"text":"Right down the street from our hotel and our first night in NOLA so we stopped in for some","useful":6,"cool":7},"MRwN212LPa3YY6pnafRqEQ":{"text":"Amazing food.  All oyster flavors are fantastic.  Perfect fry on the oysters and shrimp.  ","useful":0,"cool":1},"szW8mee5mg8HOUqa0Eha3w":{"text":"Gallier's is worth consideration for lunch or dinner.  It is a casual establishment and no","useful":3,"cool":5},"EbSG2gZRI721XHeOFYXQ3g":{"text":"My husband and I decided to google the best oysters in New Orleans and this popped up. I a","useful":0,"cool":0},"UILHsPTP7PHXiwHobeKl2Q":{"text":"Outstanding. Lucked out at Happy Hour and Appetizers are $5 each!!!  We ate until we could","useful":1,"cool":0},"WfFZDJ-4rTD-Fy0dP3E1cA":{"text":"The Gumbo is way too Smokey flavored for us. The crawfish Ettouffee' had a fairly good fla","useful":0,"cool":0},"9oan24KEzrGoSDwBEk0D6Q":{"text":"My wife and I were there about a year and half ago and were talking about this restaurant ","useful":0,"cool":0},"ivPnXTn8z2y9IsKmcbSwLQ":{"text":"Wonderful cajun breakfast which was a great deal !  Rohan the bartender was attentive and ","useful":0,"cool":0},"sVYWYE4MQYOtkDxFjoVawA":{"text":"I was in town for a conference and was looking for a nice place for dinner. I picked Galli","useful":0,"cool":0},"If-RhxurHSGLjA27LbjIHA":{"text":"The food was really good and the oysters were huge. The crab cakes and poboys were what dr","useful":0,"cool":0},"n2LuOgzsfz05IgXHmsAnng":{"text":"Great breakfast spot and happy hour spot! Small restaurant with great friendly staff. Love","useful":0,"cool":0},"ndEwK-w0hr0YY76ow9owbQ":{"text":"Hung out at the bar.  Oyster were excellent and the atmosphere ur bartender Anna was amazi","useful":0,"cool":0},"vyuIQgJEMyhErTjryzAq7Q":{"text":"My husband got the Oysters Rockefeller and he said they were really good. I got the banana","useful":0,"cool":1},"3JbXa7kKh2aovfhfkpNBAQ":{"text":"Service and food was decent and great environment for the money. I'm from Philly therefore","useful":0,"cool":0},"FBxeJOLF8NSaqLzFr_AgVA":{"text":"I could wait to get home and review this place. Visiting NOLA and have had a couple of not","useful":0,"cool":0},"DiCHOY2C6raV2w5zl9T-Tw":{"text":"Always challenging to choose a restaurant when there are so many in town.  Boy, did I make","useful":0,"cool":0},"hc18I0KHO3JjKDNKQzIA5w":{"text":"Just happened to see this restaurant on Yelp and decided to try it out for lunch. Even tho","useful":0,"cool":0},"vYvxdz9fE7QWtKR0SoGbpg":{"text":"The bellboy at my hotel recommended Gallier.  It does not look like much from the outside ","useful":0,"cool":0},"aiOi5IQg4-oowaKAjsBgeg":{"text":"I'm so bad with taking pics cause I eat it before I remember , lol. That's how good this p","useful":0,"cool":0},"wu2SXq5EUj87IvrRIOS03w":{"text":"Do yourself a favor and get your butt down here!  Charbroiled oysters will scare you for l","useful":0,"cool":0},"LsXEn_kcKU9g_1xzSi8RVQ":{"text":"What a hidden gem! My last night in NOLA my husband and I came here because it was close t","useful":2,"cool":2},"68tlXZ8ot5DGXmfJiZx9Ww":{"text":"we had a french fry that tasted like garbage. it was so bad. we passed it around the table","useful":0,"cool":0},"ofAjYSLgTEYv6tnGS0UlJw":{"text":"Don't bring your grandma and grandpa here because they may break their bones. Floor were s","useful":0,"cool":0},"4WX9eBPVe3G1V_DRIC6JDw":{"text":"I went to NOLA for a little trip and I knew that I had to try some oysters. There were man","useful":8,"cool":7},"SW6_4xwRw1hYG1Y7D11t3g":{"text":"This was a happy accident. Stumbled by our first night and were not disappointed but pleas","useful":0,"cool":1},"eF-O4hgUF41SdOZfDEyimQ":{"text":"Food was great, well seasoned and fresh. Service was also excellent. The charbroiled oyste","useful":1,"cool":1},"IlOO6Jn3qhP3w79DHmPPUw":{"text":"Stopped by for happy hour oysters. Raw oysters were very fresh and tasty. Also tried creol","useful":0,"cool":2},"ZsX9J7rI1a8Sy4snb4awhw":{"text":"We're local and were so happy to find this spot for oysters. Rohan was our bartender and s","useful":0,"cool":0},"1L66SSWR26I79L--7PZxxQ":{"text":"Loved the half plate of Gallier's oysters. And the waiter was very attentive and concerned","useful":0,"cool":0},"h_8tT9C2tplkWWAEQtcq1g":{"text":"Delicious food, just got the basic Gumbo. So wholesome. So would recommend anyone to pay a","useful":3,"cool":4},"shACFnp-5cTFb9aaAzGFJg":{"text":"This was the very first place my boyfriend and I stopped after a missed flight, issues at ","useful":1,"cool":1},"uj1xRPVuwHdxCJ3rLgFIsA":{"text":"Best restaurant in New Orleans! Jeremy the manager was the most accommodating manager we'v","useful":0,"cool":1},"EfKzFTvd_75gxR6Lnq9bGg":{"text":"Just stopped by for a quick happy hour that currently ends at 6:00. Sat at the bar and had","useful":0,"cool":0},"fJJdSaao9-YvN4sL_JWEEA":{"text":"Enjoyed the raw oysters and gumbo!  I would fully recommend this place. You get avoid the ","useful":0,"cool":1},"4Nis-FbUj2noZ8CZKxFJKw":{"text":"Was in town for my wedding and found this spot close to our hotel.  What a gem!  Fried oys","useful":1,"cool":1},"5EsIhL-SyVwXN1i2dAxBZg":{"text":"Great place! First time to New Orleans and we have gone back every night! Friendly servers","useful":0,"cool":1},"aCVgDGlfpnvqAEdLRPlQCQ":{"text":"Unbeatable happy hour prices. Everything we ordered was tasty with generous portion sizes.","useful":1,"cool":0},"TWDlVBczUTsOh5bynV0mtg":{"text":"Dinner was fantastic! Had a shrimp po boy and a cup of gumbo. Sounds plain, tasted awesome","useful":0,"cool":1},"WQ0zlTRxStSBor4GX2l96A":{"text":"This place was our spot during our brief stay in New Orleans.\n\nIt was perfect for us.There","useful":26,"cool":23},"QYE583y--_XXQsiUgbdvXw":{"text":"Very  good happy hr spot the prices are very  reasonable and the staff is awesome. A must ","useful":0,"cool":0},"zPIRCpRfyNZ28UoR3Jh48A":{"text":"I'm no expert on Southern food but I know good food when I eat it and this is a top spot f","useful":1,"cool":0},"-2pin2BTMyFygodMuPxyHQ":{"text":"I was expecting really good food when I read the reviews.  I ordered the blackened fish wi","useful":0,"cool":0},"hSHQSKgcN58S1tpRfVtl5Q":{"text":"I love the feel of this place. The bartenders are always nice, attentive, and talented. Th","useful":0,"cool":0},"eliJXmZ_F-TgGFVDt5VLog":{"text":"Stopped by for a late solo lunch and Pimms cup. Ordered the Taste of New Orleans - the red","useful":0,"cool":0},"ZAnghE3B_XqhLWbZRe6Tig":{"text":"Visiting NoLa for the weekend, we came back to this place twice cause it was that good. Th","useful":0,"cool":0},"NfK38tP7NCp3wDBK7nwZFQ":{"text":"Got recommended this by a friend and saw how great the reviews were and I am disappointed.","useful":0,"cool":0},"NJ1rZmXEQMct1HX_ss8Rpg":{"text":"Oh man, their reviews and the pictures don't do it justice: in a bad way! The pictures mad","useful":0,"cool":0},"sFj5rk2PwFWU3vwITs_mBg":{"text":"Ordered the ribeye which maybe was my mistake for ordering meat at the oyster bar. The rib","useful":0,"cool":0},"2S0tArSoKF_IhMaxO_t0mg":{"text":"Come for the Oysters....not anything else. Came with a group of friends, service was slow,","useful":0,"cool":0},"SKJVaT87f3LSV0mJl5uztg":{"text":"Awesome food! Awesome drinks! The Gallier's Special (Oysters cooked several ways) is the b","useful":1,"cool":1},"xhVIISBSXWibgVHQQKwwRg":{"text":"Great service and excellent food- oysters for breakfast, red beans, and generous omelettes","useful":0,"cool":1},"Z__QBiBBceLnhxwOwyQbMQ":{"text":"As a Concierge I've been sending people here for 3 years. Not ONE bad review from my guest","useful":1,"cool":1},"IWRrL7jIzXY-7JMNhTLWJg":{"text":"We chose this place while looking for a lunch spot close to where we were staying.  I'm so","useful":1,"cool":1},"kX97X0rgugN_szAOL9Lsxw":{"text":"Great seafood. Decent prices for the menu. Great service. Must try - fried oysters. Spicy ","useful":1,"cool":1},"zObomdDM82Sb3f9zIh7Y_w":{"text":"Great food.. friendly staff.. happy hour apps were delish! Totally recommended for good fo","useful":0,"cool":0},"cGAxT5zAPkuHe-R9jcOIkw":{"text":"My review is a little late but this is the best restuarant that we have had the pleasure o","useful":0,"cool":0},"fEPw1ybjMI3SH1pBCJ7tuA":{"text":"This place was amazing! The charbroiled oysters, blackened redfish, and fried oysters were","useful":0,"cool":0},"KS0OrZYjkUawAjtfCDVLFw":{"text":"Nice quaint restaurant in the quarter. Food is excellent. Staff is friendly. Seafood is fr","useful":0,"cool":0},"j1kXvyaB1c1LDyZN7gf_nQ":{"text":"Happy hour was the best!  This place is right off the main drag of bourbon street, which f","useful":0,"cool":0},"AS7TRlVWcbvfjN8JvSbW8w":{"text":"Just looking for brunch on the last day of our Big Easy get away and stumbled upon this pl","useful":1,"cool":1},"OuvGz7XD40ikd2sZYdZM5A":{"text":"I walked by this place during an afternoon stroll and stumbled upon their daily happy hour","useful":7,"cool":3},"UVL_1mxJONqhaImUMhp0HA":{"text":"Came here after church for brunch. They had bottomless mimosas and bloody marys for $15! T","useful":2,"cool":2},"dOQiQcRV5EeR47LVWi4RGQ":{"text":"Oren was our bartender and he was fabulous!! Such a great time here. Good drinks...great s","useful":0,"cool":1},"KlAIrPtonIt707ZjHraV7w":{"text":"Fish po boy was really good and fries were even better. Fast service! They left the front ","useful":0,"cool":0},"i1WX3m1u_h3-I7AjN9ir2g":{"text":"Delicious food and enjoyed the Lazy Magnolia beer, however the service was questionable. H","useful":0,"cool":1},"smP8e0bQ24UMp6AVN3oANw":{"text":"Had a good time here the other day. The cocktails were great as was the food. The atmosphe","useful":0,"cool":0},"clCNsYxkqkSzcJVWBpCW5w":{"text":"Me and my fiancée came last night for dinner, needless to say we had the BEST time!! The w","useful":0,"cool":0},"r6FgKiPdkiaYPQLWhamgpQ":{"text":"Food was great, waitress was attentive and helpful.  Food was reasonably priced and fresh.","useful":0,"cool":1},"KOJ8dpFd1U-SkSaYujNrbQ":{"text":"I love oysters and the oysters were shucked 1 hr before so they had no juice . I love oyst","useful":0,"cool":0},"a-EbbejNqKfB6eZ8SshRZg":{"text":"Wow... seriously underwhelmed with this place. We made the mistake of not having dinner re","useful":0,"cool":0},"sBHY0hlFfbkYtPbRXmP_ig":{"text":"We stopped in on our honeymoon for an impromptu late dinner and what a fabulous stroke of ","useful":0,"cool":0},"Ys_VN3CGABlPA-08Y65DQw":{"text":"Highly recommend for happy hour 3-6. We got grilled oysters (3), crab cake, bcue shrimp, a","useful":1,"cool":0},"M8q8kacNFsfXMv2NmIK6ww":{"text":"Ok, so after arriving in New Orleans from San Francisco I was expecting a great experience","useful":4,"cool":3},"Mnl2H3Uh7M7aDGByCJLnTA":{"text":"Came here for breakfast on a Monday morning. Place was pretty empty. Our waiter was very n","useful":1,"cool":2},"hfAklPxQGh0o4Fb1yBf1Bg":{"text":"I was not impressed. My oysters were frozen, my wife had the Cajun sampler (red beans and ","useful":0,"cool":0},"zRQPgJclLPk9NIZCxIW12A":{"text":"I was visiting and stopped in for the fried seafood on the menu. It was great! The staff w","useful":0,"cool":0},"fvW-7FvG7VC2gVRs4iC6SA":{"text":"Very disappointed based on the high ratings for this restaurant. The shrimp and grits was ","useful":0,"cool":0},"sSMNikNkJqtGf-Aow_DOHg":{"text":"Solid casual bar and restaurant near many of the downtown hotels. Went for their happy hou","useful":1,"cool":2},"N-vtC0LENeK0jTxbzr84kQ":{"text":"We went here this evening and our server, Jilly earned all five of these stars. She was th","useful":1,"cool":1},"-9zvaHiHkNvtPuN6s9O2dw":{"text":"Nothing special.  Hurricane cocktail and charbroiled oysters were good though.  Would I go","useful":0,"cool":0},"3AaNIZcO0XOg7jboe1F4Gg":{"text":"Seriously impressed by this establishment! Every single meal we ordered was delicious, the","useful":1,"cool":1},"OBj5nZS7xtjhITWn3UdZHg":{"text":"We were on our way to their neighbor and came in here after discovering the other place wa","useful":0,"cool":0},"sdyKjEXYsCNUrYEiUNBaHA":{"text":"Stopped in here for dinner with friends after an afternoon invitation as we walked by earl","useful":0,"cool":2},"wGiIxKyVTe6g6FF56FQStA":{"text":"I came here with a group of friends for dinner. We ordered a variety of plates. I had the ","useful":0,"cool":0},"06l54LsS0flxJJzxrU51RQ":{"text":"I'd been craving Oysters Rockefeller and I thought I'd give this place a shot. The hostess","useful":1,"cool":1},"UCJckD6ZNrpIEPMMZiwPRQ":{"text":"Amazingly food! Please order the oyster sampler, it's worth it! Cajun pasta dishes were pe","useful":1,"cool":1},"ABzL5_oOaZwNNE84QsmBWQ":{"text":"Their charbroiled oysters are the best I have ever had! We ended up going back the day bef","useful":0,"cool":0},"VUb5MV8j8PXp3QNQzOshag":{"text":"We came here for the happy hour ! Great small bites and a drinks menu. Beers were around $","useful":2,"cool":2},"gdfgIuJvA7IbbWSbDhNA3Q":{"text":"We had the oyster special. It was amazing and delicious. Highly recommend this lovely plac","useful":0,"cool":1},"a9PXIv1Vjpk7XDn53KhjXw":{"text":"This was the 1st restaurant we tried when we arrived! And no regrets here. I got a taste o","useful":0,"cool":0},"fEkQiQsLsVayvXJO_WJowA":{"text":"We were on our way to the museum and stopped in for breakfast. It was relatively empty so ","useful":1,"cool":3},"49Z23TD9MljpflBVZkaR7Q":{"text":"Our first night ever in New Orleans (11/14/18) very cold with a brisk wind. After walking ","useful":4,"cool":3},"uB7onbMLIGBvsr1Gjzl2cA":{"text":"Came here for brunch on a Saturday afternoon and my boyfriend and I were seated immediatel","useful":3,"cool":2},"a9WyR9g2V2FLZDCjST77aQ":{"text":"Came here because it was recommended by our tour guide. She aid those was her favorite pla","useful":2,"cool":2},"yc44v-R7FoM-FE64wZAebw":{"text":"Fantastic food! Everything tasted fresh, and so well prepared. Red Snapper, Shrimp Poboys,","useful":1,"cool":1},"JwapSXjh6lD9YUmm00P3-A":{"text":"BEST OYSTERS IN NEW ORLEANS HANDS DOWN \nI've tried mostly all the oyster restaurants in Ne","useful":0,"cool":0},"U6OQWVgUUDYV6N9pe6fiyA":{"text":"This gangsta spot is awesome for happy hour!! $12 for oysters?? You can't beat it. Managem","useful":1,"cool":1},"5QCK5dGI4ZnHToAWYOdNKQ":{"text":"We had such a good time here. The service was excellent and the oysters were sweet and ple","useful":1,"cool":1},"8Qrawb3pPBlAgarmsSyD_w":{"text":"HAPPY HOUR HEAVEN! What a great little spot. Friendly, attractive waiters, great food and ","useful":3,"cool":5},"-aatRKkccjsWT4iJFAC2UQ":{"text":"The bartender was amazing ! Rohan was amazing best bartender I have ever had! The wait was","useful":0,"cool":0},"irzrMnx1bx_TddsTq2W3Fw":{"text":"We were looking for fresh oysters, gumbo, and seafood. This place didn't disappoint! It wa","useful":1,"cool":1},"5i2x48OlKA5WKXCayAQKxg":{"text":"Went for dinner, even though oysters weren't going to be on the menu for us. I tried a cou","useful":0,"cool":0},"45bwjII0eFlGS3rSBRi7dQ":{"text":"The good was delicious the service amazing, Kelly so sweet and recommended what to order. ","useful":1,"cool":1},"x3bpApLydVaHMdwjZXNP5w":{"text":"This is a small bar restaurant. Old style New Orleans. Small, but clean and classy. We had","useful":2,"cool":0},"VtyaFPc_JOZtHSGsP4G9-g":{"text":"Nice location and good food. Oysters Rockefeller, Red Snapper, fried oysters,and shrimp po","useful":0,"cool":0},"CmI64sHJ8MaVuVurDXca4g":{"text":"Oysters and oysters. Came for a late dinner and the oysters hit the spot. Got the chargril","useful":0,"cool":0},"VqynjYHiQ2To0GfpAUw4yw":{"text":"Great meal and great waitress! Every meal was delicious and the oysters were THE BEST I'VE","useful":0,"cool":0},"08QoSZbnC_YFuIRkiZPhlA":{"text":"My FIRST NEW ORLEANS RESTAURANT. I found this place as I was walking around street.  I lik","useful":0,"cool":0},"_pU0X75sfduZldbjC5iL6w":{"text":"Stopped by for a few happy hour beers.   Ordered gumbo, at the bartenders recommendation a","useful":2,"cool":1},"jONobt1RIHWqcjCju-N4Jg":{"text":"The food and the service was very good considering how busy they were when we visited. The","useful":1,"cool":0},"GYN9Bjyt8VHZMKsoZbT_Yw":{"text":"Best charbroiled oysters of all time! Great Red snapper. The food is a 5!!! The atmosphere","useful":2,"cool":1},"SKFChXJlC7M-EfflbRwhGA":{"text":"We waited 45 for a table and instead sat at the bar when seats opened up or else we would ","useful":1,"cool":1},"TUwN2G-lny5vYn1pSLVIOQ":{"text":"Came here for breakfast.  We ordered the steak and eggs and both steaks had a funny taste.","useful":1,"cool":0},"LUsorvm1CP4wZk5F-rsM6g":{"text":"Susan and I have frequently enjoyed meals at Gallier's, and we have been looking forward t","useful":5,"cool":6},"UkjaQ2pDNW793LAIjBC3Rw":{"text":"Best oysters in the city. The food is so good... it's a little place so there's a wait to ","useful":1,"cool":1},"sSuuS2RaHdgLIn7iTrYLrw":{"text":"Food was just ok. Red beans and rice has no rice and crab cake mediocre. The top shelf mar","useful":0,"cool":0},"Ccet7zyjpTtGkm2MWm6X3w":{"text":"Found this restaurant searching for a Po' Boy while on vacation in New Orleans. Started th","useful":0,"cool":0},"SX0ngfVokeybycpLRMV4ig":{"text":"I came here for a late night dinner with my girlfriend on a Thursday and it was very calm ","useful":1,"cool":1},"KkcXQyM6QY97ijOeBW3H9Q":{"text":"Loved this place! The food and service were great, and we had the best conversation with J","useful":1,"cool":1},"YRbf9tyK0MEYrj_bIiyt5w":{"text":"Our steak was over cooked with way too much peppercorn. They were nice enough to take the ","useful":0,"cool":0},"Kmj1Z8uViVe0kVrHjAAPZQ":{"text":"The food is delicious the drinks are strong and the workers are great. Feels like home coo","useful":0,"cool":2},"QTJA2xkNW9kTXOxvCt49Yw":{"text":"Everything that I shoved down my gullet was delicious!  The bread pudding was an excellent","useful":1,"cool":1},"jWIgTnmVjwltPIooLWG9jA":{"text":"When first arrival, there was a 10 minute wait for this little store front restaurant. I h","useful":0,"cool":0},"nCdtdPs4dWG7nQpKntSZfw":{"text":"Enjoyed the Red Snapper! The restaurant ran out of oysters; I will definitely go back to t","useful":2,"cool":0},"y0muWhfndcaK-va6oGEP-g":{"text":"Our party of 4 recently stopped in for raw oysters & a cocktail during Happy Hour. The spe","useful":3,"cool":3},"L354nTcF_zzBFPqhimD5lw":{"text":"We came here from the North, and this is the BEST cajun pasta I've ever had. The rest of o","useful":1,"cool":0},"SexCOPE37yx6BPARlnfw_w":{"text":"Pretty tasty. We ordered the oyster trio as an appetizer and this was my favorite part of ","useful":1,"cool":0},"rtSwwFbsVbqXCp6CxBVjfQ":{"text":"Ok, so we went to Desire's but they were closed for an emergency. I checked Yelp, reviews ","useful":1,"cool":0},"Qqv9gougeFRfYa9xC0-Tpg":{"text":"Decided to give this place a shot while looking for a dinner before leaving N.O. \nService ","useful":1,"cool":1},"_vOai5v1jnrBBTqDZPEaZQ":{"text":"They have great service and prices! A must visit, better than the wait at acme.\n\nFood is e","useful":1,"cool":1},"dDABV2Z2nrMOtTX_kCvwZg":{"text":"Total disgrace to nola grilled oysters!!! Decided to give a try after we had some awesome ","useful":0,"cool":0},"OE0GPc7lvRPpsCLjDbMNYA":{"text":"Relaxed atmosphere with first rate chow.  A terrific deep roux made for a delicious smoky ","useful":1,"cool":1},"QeZnRumpDZFWpbwFBfcS1A":{"text":"This was so delicious! I got the Cajun chicken sandwich, my husband got the blackened chic","useful":1,"cool":1},"E6eVUohSRjyGGjLNxlAkRQ":{"text":"Phenomenal food and overall wonderful experience. We came to town as oyster virgins and Eb","useful":6,"cool":1},"dMvqMJMSNk2NL1fDaMA7ng":{"text":"Looking for dinner within walking distance? We were welcomed on the sidewalk, usher in to ","useful":2,"cool":2},"pIqimfvO3Gz9B73QH0Kh0g":{"text":"Excellent! Great people, great atmosphere and most important the food was awesome! I will ","useful":1,"cool":1},"M0v-i-00IrLBohZ20budSw":{"text":"They don't take reservations but on a Friday night we only had a 30 minute wait. Not bad!T","useful":1,"cool":1},"bhQx6Shp-MCxYzu-RLFjaQ":{"text":"This place has bottomless bloody mary's and bottomless mimosa's from 10am-2pm. I really ca","useful":6,"cool":3},"VgQ3QP304D_ZOD7XvNNHSg":{"text":"The food was really good! I was very impressed with the food and service midst Mardi Gras ","useful":1,"cool":1},"PZrImg6OemW6alyn2D7vvw":{"text":"Everything was excellent!!  Oysters were A+ for sure.  Just off Canal Street and definitel","useful":2,"cool":1},"T1UlFaCVtz1g9hJskeNJYg":{"text":"We eat here on every trip to New Orleans. Their oysters including raw are fantastic. I thi","useful":0,"cool":0},"sKo5FHs_8b7gUrbbbWUnWQ":{"text":"They were out of steak..so I'll definitely be back to try It out. I got a seafood pasta th","useful":1,"cool":2},"lNZKbq9rjWaSCKofutwzVw":{"text":"Jelly was very kind & she was Always smiling.  So ask 4 Jelly when you visit.  Food was re","useful":0,"cool":0},"hMFKsCxyqXyL35PUHA85EQ":{"text":"Absolutely delicious! We wanted charbroiled oysters and Rockefeller and both were really g","useful":1,"cool":0},"VyPc6EKvoAqnf4F4dhUwHQ":{"text":"Came here for a Sunday night dinner. We ordered the chardboiled oysters for starters and t","useful":2,"cool":1},"Jrm0Qmo4EUL66OluisHvuA":{"text":"This is a must for excellent food, great service and extremely clean. This is not a drunk ","useful":1,"cool":1},"7iWSZVlhLciGtzcYikwVbw":{"text":"We were searching for a great place to have a birthday dinner not realizing we'd walked by","useful":0,"cool":2},"xvZOFvoXUWPm4g0BWAoxJQ":{"text":"Went here two times during Mardi Gras weekend and the first time around it was great! Seco","useful":3,"cool":3},"nFEz0UCV787ijwQTEE3xSg":{"text":"Good happy hour specials, dozen oysters for $10 and drink specials. Orders are large and f","useful":0,"cool":0},"JXWmKJVk3OH2bCCqf4LeEA":{"text":"Came in to Gallier's  with 4 of us to the happy hour during mardi gras! nice and quiet! at","useful":0,"cool":0},"RDr5IZtRMmh-TMSUU6lRng":{"text":"I highly recommend this restaurant!  The Galliers Special oysters and the red snapper!   T","useful":1,"cool":0},"uUR3nbYfPar_2_j2y6y-eA":{"text":"We decided to try this place because one of our favorite dinner places was closed.  We'd j","useful":0,"cool":0},"2yaWRZKdMZ4gcwSzaxlUbw":{"text":"I had previously saved this restaurant on my Yelp when I visited NOLA earlier in the year.","useful":1,"cool":1},"kzV5PFncqBMwwoLyCZ6Amw":{"text":"Soft shell crab platter and andouille and chicken gumbo. So very good. Prices are reasonab","useful":1,"cool":1},"FPSY_LENo8L-Gf3Q4o0tXw":{"text":"We were looking for some good Cajun food off the beaten path a little bit and boy did we f","useful":2,"cool":1},"wjMu_ZPCGWUyk6dddO1B0Q":{"text":"I recommend EVERYONE try The Gallier sandwich. Appropriately named because it is this rest","useful":0,"cool":2},"jclg0D0JBdxBhVbJYwsmlA":{"text":"Wonderful no wait brunch spot near everything, serving up drinks to order, oysters, steak ","useful":1,"cool":2},"GFwQprAuCqU-ZKscQcX6nA":{"text":"I don't even like oysters but their oyster trio was so good! Happy hour deal is great. Coc","useful":1,"cool":1},"ldqhvp2L5v5KZQGlwdn_DQ":{"text":"I wish I could them them a 0 star . Horrible service, service waitress and cold food. \nThe","useful":1,"cool":0},"hxb64VywCQ187oW_WOmwqA":{"text":"This was our first place to eat in NOLA! Wow!! Happy hour oysters on the half shell at $1 ","useful":1,"cool":1},"TuhGjsupp0j3YUQO_nSwGQ":{"text":"This place was awesome! We ordered the charbroiled oysters and were picking all the scraps","useful":2,"cool":1},"0ChC6s-D50CaIDie_RHBGw":{"text":"Ordered cranberry and vodka and dozen chargrilled. Great experience on a Wednesday. Stoppe","useful":3,"cool":3},"XFO25cV7SU_1rk69ZVYiMA":{"text":"The bartender was friendly and helpful. I ordered a Spicy Bloody Mary. It was spicy and re","useful":1,"cool":0},"TVD7iLBNycp5VhZFUbRinA":{"text":"Found this place on our way back from our adventures. Had to travel through some sketch ar","useful":2,"cool":1},"eteobuoNXCw5E6AVyY0duA":{"text":"Got the shrimp platter (a little on the salty side), fresh oysters & hubby got the taste o","useful":1,"cool":0},"PPXUuP09gr0MnL1n-uuxDg":{"text":"I have had their char broiled oysters with cheese .  Excellent . Barbecue shrimp and grits","useful":0,"cool":0},"FpiOe6gHOPbH3H9A9v8dEQ":{"text":"A MUST for all you oyster lovers! The Oyster trio is out of this world, great atmosphere a","useful":1,"cool":0},"0T5bN50HcAxWaaX2r8Yxlw":{"text":"While I was on vacation in New Orleans, I was up early one morning searching Yelp for a pr","useful":3,"cool":1},"C7rsTVPwtIFqBC_aCzZ6OQ":{"text":"This was a wonderful \"find!\"  Not going to lie, we had walked out of our hotel around 8:00","useful":1,"cool":1},"-xwnryKDP7QeJg__psva2Q":{"text":"We were a group of 9. First 4 dishes came. 15 minutes later 3 dishes came. Then a while la","useful":0,"cool":0},"lIOCNo4LR49kmlQbqJNA6A":{"text":"Great food, oysters Rockefeller, fried green tomatoes, crab cakes, shrimp poboy and great ","useful":1,"cool":0},"y2CzDc_BKEPIp1ZFniQF-Q":{"text":"The food is fantastic. Very flavorful and definitely gave me a taste of what New Orleans h","useful":0,"cool":0},"IaltlRQpDsZVCukIAMt2Ag":{"text":"We came from Jacksonville, FL to come eat good food and to find some great oysters. Stumbl","useful":1,"cool":1},"YQxbgwl_-N3dKdio_7EhHA":{"text":"Happy hour was magical. Dozen raw oysters for $12 and a cooked trio for $5 - the Cajun and","useful":1,"cool":1},"joz8uLsoN990GpHTtcI0cg":{"text":"Gallier is a clean, unassuming diner off the main thoroughfare and without a recommendatio","useful":5,"cool":6},"85r37Hy2RkYB8Y-wC6_EVQ":{"text":"Visiting New Orleans and stopped by Gallier's Restaurant & Oyster Bar for a cocktail. The ","useful":1,"cool":1},"fO6R0FlH9nNatIqHdqC_xA":{"text":"Came for the Happy Hour for the 9$/Dozen raw oysters and a couple drinks ($2 off cocktails","useful":2,"cool":1},"iJucYyepAuqi6Ui2h613AQ":{"text":"I rate it 3.5, but since I can't give half-stars, I had to rate down.\n\nThis is very much n","useful":2,"cool":0},"qWtBJqpoAxcY6RMoAeRoIg":{"text":"Excellent service coupled with the taste of New Orleans that everyone expects. This diamon","useful":2,"cool":2},"nFAWkfgugdXk4UGeUaHhtA":{"text":"Food was just okay.   The place was mediocre at best.  Wait staff was busy but super nice.","useful":0,"cool":0},"ciePcBp6RvZJcrMyDLUk6A":{"text":"We stopped on a Friday night as one of my children was looking for a fish fry while on vac","useful":3,"cool":0},"a4e0k5fqnRuOoVXXOxGk4g":{"text":"This was on the way back to our hotel and open late in what apparently is a late night foo","useful":1,"cool":0},"4PEaarFtuju2kdMUW5XsBw":{"text":"Great experience! We were actually looking on different place and stumbled on this gem! Se","useful":0,"cool":0},"WOD70hkrhCSJqjlH3kBF7g":{"text":"BAD SERVICE... waitress mixed up one of our orders and we just said we would keep it , the","useful":0,"cool":0},"BP_M4SFJ77BNqX_2TpnR0g":{"text":"A total GEM of New Orleans!!! Visited with friends from out of state and the food is incre","useful":2,"cool":0},"5hNZ0R0jKQKuDjpKnyxESA":{"text":"This was my first stop in New Orleans.  The staff was extremely friendly!  I had the New O","useful":1,"cool":1},"fbnxkntoxY0za18nDPd4Sg":{"text":"Oysters were a 10! Blackened snapper was equally as delicious. We will definitely be comin","useful":0,"cool":0},"i36ZWESVNz8Z1LDyLxvlTA":{"text":"One of the best hidden gems right across the street from the French Quarter. Best food in ","useful":1,"cool":2},"PLHHWamAl_SgWpgNwCDSoQ":{"text":"I had the grilled oysters and hoooooboy!!!!  They were fantabulous!  Atmosphere was bustli","useful":1,"cool":1},"lGnlwXGx_u20A8SOIg0zaQ":{"text":"Very good. Got in at happy hour. Raw oysters were good, per boyfriend. Red snapper was kil","useful":2,"cool":1},"OY5w-ndD2gdFLMMQ8Hnsog":{"text":"Can't speak for the food. Never got any. Sat for 15 minutes waiting on the server to come ","useful":0,"cool":0},"eFPPtfEWrThV-gOafzU8_Q":{"text":"Awesome experience for brunch. Quick to be seated, friendly service, and our girl Kelly ke","useful":1,"cool":1},"-2shQzgFv55ckiLoZMB8oQ":{"text":"Crawfish pasta was very good and the charbroiled oysters were off the hook. Fries were a b","useful":0,"cool":0},"-BOVo8VEBGwoUNuZwY4VxA":{"text":"In New Orleans for a girl's trip and we were  looking for somewhere to eat, I looked on Ye","useful":0,"cool":0},"o3x8zlylXNZWF_G3JXg75A":{"text":"Excellent oysters and service. I've made the pilgrimage to acme oyster house and fave gott","useful":0,"cool":2},"8Be7Hnl2Wbal6P-RQ8vhFg":{"text":"omg this is the best place we found in nola...service and food is out of this world....and","useful":0,"cool":2},"VVC3W8_7ErmKHVsOV6veUw":{"text":"The first night we went to dinner here. The waitress was amazing. The cajun chicken was ex","useful":0,"cool":0},"_2fZhrrKd1OpPtxt3iRmpQ":{"text":"We went here for dinner. This place is small but they were turning there tables. They had ","useful":0,"cool":0},"DXxbk0JdAh0L6R_UlmMKPw":{"text":"The \"best \" oyster Rockefeller ever. Chad is the best. \nFealt like home. This is my new go","useful":1,"cool":1},"eze2AduKR1odzACwhvcKlw":{"text":"I came across this little quaint place while walking towards Canal street. I was looking f","useful":1,"cool":1},"8dF_efw5CVw69w9sqU3uXw":{"text":"I don't know the name of the tall bartender but the way he runs the place, you would think","useful":1,"cool":0},"bpOHkwrA5L0eU9SfJRG5Cg":{"text":"Bad service, good happy hour. Went here with a group of 8 for a birthday girl snack. We we","useful":2,"cool":1},"lXSVeWwV798ZLM7MOiBPdQ":{"text":"Don't know why they have received 5 stars . One year later ..what happened ?  Looked dumpy","useful":1,"cool":0},"8iu7y5mBAZkdLIVPqxOjcw":{"text":"Best salmon!!! Wonderful & knowledgeable about the menu staff! Great oysters! Not a long w","useful":0,"cool":0},"bKFXrNpgJIDxs0t7M1y9fA":{"text":"The Service was great, friendly staff. My husband had the fried oysters and they were good","useful":0,"cool":0},"kkCpsissNJ3dxIkKjMdJTw":{"text":"Good place. Came in for a nightcap during Mardi Gras weekend. A nice change of pace from t","useful":0,"cool":0},"KSGIo7xGJEmdaiJ8qcB5Rw":{"text":"What a deal on oysters! Happy hour is $12 for a dozen oysters. They were great. CJ was so ","useful":0,"cool":1},"cBc1jQaCGSHyY9bGkXS0YA":{"text":"Terrific meal. Worth the wait. CJ was a terrific server and the hostess did an amazing job","useful":1,"cool":1},"mcnDh--llk-cq0sUe11Mpw":{"text":"Excellent oysters and excellent grilled gator bites. If you can, choose grilled gator tail","useful":1,"cool":0},"vBkQ8eDUzNDJoV9d-d3zrA":{"text":"We stopped here by chance and so glad we did. We hit Happy Hour and had the oyster trio. W","useful":0,"cool":0},"QL6VvtTZFUWsbnm4oi-ODQ":{"text":"This restaurant was so welcoming for my friend and i coming in last minute. The host was q","useful":1,"cool":1},"cAXRTH5PQP1-CxN8aNekeA":{"text":"We were looking to eat brunch and all the places we chose were either closed on Sunday or ","useful":0,"cool":0},"iwKHjwuh_0LX-2674aAf2g":{"text":"Awesome happy hour! Came in not expecting to pay such good prices for delicious food, got ","useful":0,"cool":0},"bilMYAo_hjRw9AWLbk_4XQ":{"text":"Really enjoyed my meal here. Had the blackened redfish with Caesar salad and green beans. ","useful":0,"cool":0},"pzCmnyln-SL9TpnQdDpTlw":{"text":"Very impressed with my meal.  I had the blackened redfish with the crawfish sauce, and veg","useful":0,"cool":0},"X1vwwLI9J5tOIfQct4kZ0g":{"text":"I'm not sure why this restaurant received 4 stars. It should be 1 star across the board fr","useful":0,"cool":0},"NOUYV8hCFs0zuSq7VPqQJg":{"text":"Friendly, knowledgeble service, excellent Rockefeller oysters, great music & atmosphere.  ","useful":0,"cool":0},"C5an-0qnLE_AZhuMAlva9w":{"text":"Excellent food and service. Had the blackened redfish, really good. I would highly recomme","useful":2,"cool":1},"sofVv3p4SzKk3PHCdYh7DQ":{"text":"Despite being very busy, the service was incredible (Thanks Jelly!), we got our drinks and","useful":0,"cool":0},"XY43h0buwdcy11Ae9ShoBQ":{"text":"Admittedly, on this trip to New Orleans a fair amount of the food I had was just so-so. Th","useful":5,"cool":5},"xzI69kdw7zSdBKu76_hEFg":{"text":"Great food, great service. I come to NOLA twice a year for work and always stop by Gallier","useful":1,"cool":1},"Y5bqbLWnyzZRFyt-bhAbHw":{"text":"The most Amazing Oyster PoBoy and the Taste of New Orleans didn't disappoint a bit. If you","useful":1,"cool":1},"dZJnC4ZJsAPBRuFHUXsU7w":{"text":"Awesome food. Awesome drinks. Definitely make it for happy hour. Friendly staff. Would rec","useful":0,"cool":0},"BCg5GgPC3bJCrcAkqL49Xg":{"text":"Found this again by trusting my fellow yelpers.  Doesn't seem like much from the outside b","useful":0,"cool":0},"Ez-dVtKLBWVesiSRDjjYxA":{"text":"Walked past this fifty 'leven times during my trip to the Big Easy and what began as a vis","useful":3,"cool":2},"HaH9vNfL53qkR-OZte8oBQ":{"text":"It's not very often that I've been fooled by a Yelp page into going somewhere... But nothi","useful":2,"cool":2},"U6qnZ19EH2zYMAW3ZlwzbA":{"text":"Great place, wait was not long hostess was very friendly.  Smaller place but cute. Sat in ","useful":0,"cool":0},"7Hxtf8Y-svyoV-f_giFMdQ":{"text":"This restaurant was located within 2mins walking distance from our hotel. Very convenient ","useful":0,"cool":1},"viiIN_fA-pnxIF0CmRsoNg":{"text":"Fantastic food and service. Neighborhood bar feel with upscale food taste. Much better tha","useful":0,"cool":0},"V7x0VKJAlb2jABQXzyUimA":{"text":"LOVE this place. I wish I could give it more stars. The drinks, the oysters, the entrees w","useful":1,"cool":1},"py3eNFYot56ndKUpibrG0w":{"text":"This is my second time here, the food is on point and the service is great. Black owned an","useful":1,"cool":1},"LDsxhkCeK5HCuo8IT2pOhw":{"text":"We were on vacation in NOLA for a few days. We stayed on Carondolet St and continuously wa","useful":0,"cool":0},"Q2m-7bJELL-2Exx2tblFVA":{"text":"We ended up here by chance and IT IS AWESOME!!!! Elena (at the bar) was WONDERFUL (sweet. ","useful":0,"cool":1},"Rf_m4yEDDiBTzI5uYx5G5g":{"text":"Service is amazing oysters delicious our mains not so much. Gumbo was watery and lacked fl","useful":0,"cool":0},"I6eMCA3r6XlFMyhyTuwjnA":{"text":"This place is absolutely phenomenal. The staff was beyond exceptional. Possibly the best c","useful":0,"cool":0},"5_2qAsyu1Vkrb244g_Bklw":{"text":"Visited from out of state and wanted some place to get authentic flavor. The seafood was a","useful":3,"cool":2},"Z3mnTyNxedVD8uBvop1zjw":{"text":"Will not be going back, we were nervous when the oyster plate arrived and was not iced.","useful":0,"cool":0},"NAqjOUQYohJHMeo4I4K8XQ":{"text":"Sorry but not jumping on the bandwagon.  Oysters Rockefeller and grilled were just OK.  Sa","useful":0,"cool":0},"7-eBsuzbD-v7CBKDa5np_A":{"text":"I had the oysters and gumbo. Small place but good food. They had only one server when we w","useful":0,"cool":0},"hvi8oGCs-poSZSEu2DL7zA":{"text":"Food was very good. Service was fast! I had the oyster platter for dinner and it was amazi","useful":0,"cool":0},"O6EZc_G5LtS3pPDFEkzCcA":{"text":"I tried the Taste of New Orleans and I must say it was the right choice! It's located acro","useful":3,"cool":1},"GvnT3hGXPTtcJZFsladtMA":{"text":"Late night dinner before closing time. Our waiter was friendly. Oysters were good. Jambala","useful":1,"cool":1},"TjiuTGVNGLmHGKeyhelcZQ":{"text":"Food and service were both below average - average. \n\nFood:\n\nWe ordered crab cakes, gumbo,","useful":1,"cool":0},"ipjpyQUqzghuL-Um3_seCQ":{"text":"Tried Gallier after walking the French Quarter with friends and to my surprise they did no","useful":2,"cool":0},"LQXnWaZq-QDEp8Qx8JFPGw":{"text":"We had a reservation and we were seated promptly. However it took over an hour for us to r","useful":1,"cool":0},"gdBFGfcQ5bqcL_ZkUTlSLA":{"text":"Best raw oysters in New Orleans. Hands down. My wife and I visited New Orleans last year a","useful":2,"cool":1},"BJwzBJP5ZDyp147PzRgvzg":{"text":"The menu looks extremely excellent and affordable. However, I made reservations at 12:45pm","useful":2,"cool":0},"lxET8bYxjWiYAcYdJdDl6Q":{"text":"Visiting Nola just needed a snack in between dinner and lunch.  Casual dinning restaurant,","useful":1,"cool":0},"gN4xEMkTuaEsY9VBorc5QQ":{"text":"Service was good. Food was good. However, when the check came\nand we gave our credit cards","useful":0,"cool":0},"aRTAqw_xEWL1fpYVzzMt8g":{"text":"These by far are the best dishes there. The stuffed oysters were so plump and filling. I c","useful":1,"cool":1},"YqNOF90JDz_PzTNXDcz7XA":{"text":"Just happened to walk by this place while looking for something to eat, and i am glad i di","useful":1,"cool":0},"YWIcXBdFRgS_XVkfYYVcYQ":{"text":"Overall amazing experience. The food was perfect, and our server Rohan was one of the best","useful":1,"cool":1},"TS-kyZnuYjpr5CVKllZatA":{"text":"Long wait just to be disappointed. The waiter got everyone's orders wrong. Then wanted to ","useful":0,"cool":0},"m-DYs7Vr3V19UFLcRilgcw":{"text":"Babbbyyyyyy this place is delicious!!!!! I cannot wait to go back!!! The seafood pasta was","useful":3,"cool":2},"LJTaDurU7UVURPKDmAWXCQ":{"text":"The staff is very nice but it definitely makes you uncomfortable that they are wearing mas","useful":1,"cool":0},"7Tw0_YJdR733gkvGuEKKbg":{"text":"I'll start off by saying OMG!!!! This dame place right here, smh. If your looking for amaz","useful":2,"cool":1},"Y74jSeCAvgFx0PMAlaVE6Q":{"text":"Best charbroiled oysters I've ever had. Get the platter where you try them all - you won't","useful":0,"cool":0},"1fv6eE05JrH2aoya5mxnkQ":{"text":"Between my love of oysters and being made to feel like family, I highly recommend this pla","useful":1,"cool":2},"hHFxmb5bmTt1CvDv7yBn2g":{"text":"EXCELLENT red beans and rice, Jambalaya, gumbo, and raw oysters. The fried alligator was a","useful":1,"cool":1},"zmmiDNwvK3fVmjuvNnq_5w":{"text":"The food was amazing!  The restaurant was able to accommodate a party of 12. Although we s","useful":0,"cool":0},"qh79KUv2E_F-0cQ83Y9b5w":{"text":"SUPERB! Our favorite of all the restaurants we tried for the week. Ate here 3 x's because.","useful":0,"cool":0},"c3U-K9CRg-NhLt4tXLt9hg":{"text":"Food was delicious and service was good. No complaints! Will definitely revisit when I com","useful":1,"cool":1},"9WzMQBKerxWcz4EpieBa7g":{"text":"The oysters here were amazing! They were super fresh and they were huge! My Hazy IPA was  ","useful":1,"cool":1},"Z9xfcsjWxwNlMGh7oTjidg":{"text":"5-star friendliest service in NOLA!!! And the food was good too. That red snapper with the","useful":4,"cool":3},"5YVheEVk5achfzodgkkDMg":{"text":"What a nice little find. Opposite Bourbon St. this quaint little gem is a definite stop. C","useful":1,"cool":5},"uzAY4uPuTQicChChsLiitQ":{"text":"The happy hour here is amazing! I was able to get a dozen oysters for $9. They were huge s","useful":1,"cool":1},"YK5j74jvwbiI0R4CERluBw":{"text":"Great oysters and cocktail choices. Great service from Kelly and Suzanne. This place is lo","useful":1,"cool":1},"lkTm2p3aqmgjdOY3T3hzyw":{"text":"Party of 3. Greeted and seated right away. Service was ok, water cups were never refilled.","useful":2,"cool":0},"EBvs4aJ_M9mzZwzLKq-6EQ":{"text":"Walking into Galilee Restaurant, we were not expecting very much. The atmosphere is very b","useful":3,"cool":1},"V_3zZlFVPVCqoDSgwh8-zA":{"text":"Worst service in New Orleans. Waited over one and a half hours for our food (only 5 people","useful":0,"cool":0},"ISAWElwc7Rs7NVcWUww-eQ":{"text":"Wow!!!  Absolutely amazing food!!  The Oysters, Red Snapper, Salmon, and Red Fish are a mu","useful":3,"cool":1},"F5j5fh5NuTeQ-1zqj499CQ":{"text":"I do recommend this place!\nEspecially \"Raw oysters\" and \" Charbroiled oysters\"\nIt was firs","useful":0,"cool":1},"ZPNAO7sFGHIu7YaAxAedpA":{"text":"They have an awesome happy hour. We had the $10 dozen of raw oysters and they were fresh a","useful":2,"cool":1},"p4Xg6b1WTq7wJxYdHz4ZEA":{"text":"We were looking for a place to eat a late lunch since it was after 3pm and lots of places ","useful":0,"cool":0},"VMkhJx0op2z0ooWOONshaw":{"text":"Great food, great service. A good place to go off Canal St. Fried Oysters were terrific.","useful":0,"cool":0},"4caLrQYSQJq0r6k4mlZxLQ":{"text":"Amazing Service. Felt comfortable here from the moment we walked in the door and were seat","useful":0,"cool":3},"NXt2QZApVdwUgL7DG5ScGQ":{"text":"I'm not a seafood guy, but the Cajun Chicken & Maque Choux was fantastic. Paired with the ","useful":0,"cool":0},"qdU_j-cu1SSrtQ8-BGlrBw":{"text":"Wrost experience ever. Been in New Orleans for few days and on our last day we decided on ","useful":1,"cool":0},"OCPHi5K0JdMxTlMKQjAJag":{"text":"Food was delicious! Wait staff was very attentive. Atmosphere was nice as well. Very close","useful":0,"cool":0},"SWiHlieoetSX_pyQFILXAQ":{"text":"Great oysters and services. It was not too much crowded on Friday night around 5:30pm.","useful":0,"cool":0},"3c7cZxCPp_OOKk34fKQ9Jw":{"text":"By far the best oysters in town. I was just in to visit and had the pleasure of sampling s","useful":1,"cool":1},"ox7HlZW_4rAKlF0O9-4iMg":{"text":"We loved our evening here! We are staying nearby and wanted to eat at a convenient but als","useful":3,"cool":1},"7gbp2vXU-mBiIcxnpvxtHg":{"text":"Good good good food!!!!!\n\n\nThe oyster rockerfeller...the blackened chicken....OMG. \n\nWill ","useful":2,"cool":2},"uBxgpMb2QSHEvCvwEhLXQw":{"text":"We started to eat here but after looking over the menu we decided to eat elsewhere.  \nI di","useful":2,"cool":2},"LMxD7S03-CJrZlU4EFGnWw":{"text":"Can't beat $9 for a dozen oysters at happy hour. Attentive staff, good drink list and grea","useful":1,"cool":1},"6cZVCZL8k4sZA7G0Ap_N2g":{"text":"Excellent service ... Great food !! Varied menu.. Friendly atmosphere.. Located convenient","useful":1,"cool":1},"eIa2k943RXbSoUhqCiCEag":{"text":"They have a creole oyster that is really tasty. My wife had the fried catfish and I had a ","useful":0,"cool":0},"3gfqOP83Cv5LNO6nqWIMYg":{"text":"Great dinner stop for our first night. The crab cake and fried alligator po boy were amazi","useful":0,"cool":0},"v5D-kvAXzLMAdFbPE-HEHw":{"text":"We came here for happy hour! The raw oysters were very fresh and medium - large sized. We ","useful":4,"cool":1},"aQoB-rIxVYvKNaWSWwQK5A":{"text":"My family and I ate there while vacationing in New Orleans! We loved it so much, we ate th","useful":2,"cool":0},"t-uazDQ8lxIJEp-LmgHy2Q":{"text":"The customer service was great! The hostess greeted us immediately and took us to a cute l","useful":1,"cool":1},"_MeQrfVvb34rdWirGuqiGQ":{"text":"Alright so to start we were mislead by the reviews. \n\nWhat we ordered:\n1) Blackened Chicke","useful":1,"cool":0},"UVJMG6FaK2IGzYyag0Uu8A":{"text":"Good happy hour spot. My husband and I walked into a very empty place at 4pm on a Thursday","useful":0,"cool":0},"BQgweSjgNfda-j5HL5S1Ng":{"text":"Loved it. Food, service great on a hazy Sunday afternoon. Oysters were big, fresh and good","useful":0,"cool":0},"ZqWE5D3jTCu1kS0GV18P6g":{"text":"I had a great time at Gallier's!! My seafood pasta was spectacular and the service was ext","useful":0,"cool":0},"IsjMYwQl7c1vMg3n6s_Lug":{"text":"Fresh, yummy, quick and friendly service.\nNot sure why in a place like this water is serve","useful":1,"cool":0},"N-Qt_mXczCUxK9k8mHAtPw":{"text":"This is a very nice place. we were going somewhere else and saw this place had more stars ","useful":1,"cool":1},"HgW6-gk5IUxFNjywof7WAg":{"text":"This was the first restaurant we went to in New Orleans after checking in to our hotel. Ou","useful":0,"cool":0},"O058CU866LkvdmCb6NbhQQ":{"text":"Very delicious! Kelly was awesome, great waitress and she makes great recommendations abou","useful":0,"cool":0},"zPLRNqm0Z4FvtP3zixKa4w":{"text":"tried oysters for the first time in my life here! not a huge seafood fan but i actually li","useful":0,"cool":1},"c-AAS7cJAmwbOg_44WaPXg":{"text":"Excellent service in a very welcoming restaurant. The menu had a variety to meet the needs","useful":1,"cool":1},"gfvw_2pZdURuhqMOSwuj8Q":{"text":"Come on! This place is great! It was only a block from our hotel, and when I checked in th","useful":1,"cool":1},"aDsfymWbihAByzNtpRRqxQ":{"text":"Honestly everything about my experience was top notch. Food was INCREDIBLE. ( we got the C","useful":0,"cool":0},"3O_DijZ8PaxCMSfa9s85ew":{"text":"We had the best service and the food was great! The cup of gumbo, crab cakes, and raw oyst","useful":3,"cool":1},"Pguv-Q8SYAsQfiQRj7t4rw":{"text":"Been in NOLA for 3 days and tried a few oyster bars and by far this spot was the most cons","useful":0,"cool":0},"FVCNQlaVan6DvDwbn3-oCg":{"text":"So good at happy hour! From 3-6 pm, they have $3 drafts and $10 for a dozen raw oysters, a","useful":4,"cool":0},"0dMgHV8JMvdpT41Xwap9ow":{"text":"We ate on a Sunday night, around 8pm. Had a 30 minute wait. Friendly but slow service. Res","useful":4,"cool":2},"tq3O8Pn6AeA8O3aRWTQixQ":{"text":"Had a fabulous time at dinner last night. It was decently busy but our food came out so qu","useful":0,"cool":0},"rZUSHVmba8gUaRnye64oNA":{"text":"My best friend and I just went here for a late dinner and it was amazing! The host got us ","useful":1,"cool":1},"i0YnXYNUfm9TUmLUl2ziNQ":{"text":"Me and my boyfriend got food poisoning here on 10/30; we had fried oysters, cup of gumbo a","useful":1,"cool":0},"g3iohyS6F4Ql-xPNos9QlQ":{"text":"The food was delicious and reasonably priced!\nWe ordered the Gumbo and Jambalaya for appet","useful":1,"cool":1},"dQe7yIq2Z1m1wC0MuyCLLQ":{"text":"My Husband and I stopped in for dinner and sat at the bar on a Thursday night. We ordered ","useful":8,"cool":6},"2eMrkDQtNIlya0fL_RvMCQ":{"text":"DELICIOUS!!! We had Fresh Big Salty Raw Oysters and Fresh Fried Oysters served with Sweet ","useful":2,"cool":1},"iVD7YYahlXJh0P6fRVnpqw":{"text":"Returned to NOLA and stopped for happy hour 2 nights in a row. Awesome raw oysters and ser","useful":0,"cool":0},"KK4b6eWc5iF-K4J3hFQqSA":{"text":"We came here for the happy hour and were not disappointed!  $10.00 for a dozen oysters and","useful":1,"cool":0},"_wtfaxS51wMzZHs3IGdqew":{"text":"We enjoyed our visit here overall, but I would definitely get something different next tim","useful":0,"cool":0},"r5QxMP5aKJh03fLfMdgOsg":{"text":"Fantastic Happy Hour!!\n\nGreat food and staff... Highly recommend.\n\nJust over heard a large","useful":0,"cool":0},"y4dAwz81hcx2b7HXJDMwtw":{"text":"So we were starving and needed food after visiting the WWII museum and found this place. I","useful":1,"cool":2},"NBZCz5L-LWALQD6HJS0Yhg":{"text":"Had the Happy Hour Gumbo was very good ..My party had the Bar  B Que shrimp and grits it l","useful":0,"cool":0},"5w5VGMZz9s0b6V5k7SgMRA":{"text":"Came in during happy hour. Ordered two beers and two appetizers. 20 minutes for the beers ","useful":0,"cool":0},"ZGoPXnam6RX4NJIknURauA":{"text":"Came here for the happy hour. Oyster - big in size but it's just okay. My oysters were war","useful":0,"cool":0},"bdmx4XP2vTY97zzR85ECoA":{"text":"Gallier Restaurant and Oyster Bar is a low key restaurant that seems like a diner. Service","useful":13,"cool":8},"GepxtAACO9JPEMFMr1Ewcw":{"text":"Stumbled upon this gem. Grilled onions on the Cajun chicken sandwich--tender and juicy. Oy","useful":0,"cool":1},"M1IuHpo_XuPXbk_mD0ZzYg":{"text":"Definitely a hidden gem! The gumbo and shrimp & grits were incredible. And my husband was ","useful":1,"cool":1},"p2zUfF6BF9Z2taCBbOjk4A":{"text":"Best oyster Rockefeller in the states!! Order that and you will not be disappointed! Great","useful":1,"cool":1},"aRJxT_qWAiZMcQSpOPKBEA":{"text":"We stopped in to Gallier Oyster Bar for Oysters.  We had to wait for a spot at the bar but","useful":1,"cool":0},"g7ZPiYTgATJRyBd6DQWkSQ":{"text":"Great, great oysters.  The red snapper, amazing.  Service was done right and with a smile.","useful":1,"cool":0},"jXkxY3jGRdyReEnIdauD5Q":{"text":"Absolute perfection. Couldn't have been happier, and the bread pudding was amazing as well","useful":1,"cool":1},"WtWK8P7QLzj-1zSV2vm7ig":{"text":"Bf and I saw the great reviews and decided to give it a try. We were seated very fast then","useful":0,"cool":0},"Np5n3w4LBOZjQm7p9SEjvw":{"text":"It smells of bug spray.  The food was ok.  Not worth checking out. Service was friendly.","useful":0,"cool":0},"G56OmPfHEkFmjNHMJxjfow":{"text":"So so yummy oysters are great.  Red snapper also really really good.  Bread is awesome.  V","useful":0,"cool":0},"fkzNs7bxN3KgZO1c97kzUg":{"text":"Went here on the suggestion from the bellhop. There really wasn't a wait and the waitress ","useful":2,"cool":1},"WZm5SnhSZPr0E8kH61j-Ng":{"text":"Would give 5 for oyster quality. Shrimp po boy quite good. Fries were lacking. Nice friend","useful":0,"cool":0},"bnS-o3yRGyiGSIRVzXIY8A":{"text":"This is a neighborhood kind of place. Nothing fancy. We ordered raw oysters and they were ","useful":2,"cool":0},"DY-fHNgnZwqUF2984s-lzQ":{"text":"Great fish options.  I had the Red Snapper with a Crawfish cream sauce over it. Spectacula","useful":0,"cool":1},"_3ciA0hkgzHEptJ4-e9F4w":{"text":"3.5 stars. Oyster HH special has increased in price to $12 per dozen, but quality is bette","useful":0,"cool":0},"M1zzHmb5lY2j9ytxYUKTfg":{"text":"Ate here last night, about 1 1/2 block walk from the hotel. Sat right down and had the fri","useful":1,"cool":1},"0Qg7zYK3DnU977-yXARVVQ":{"text":"The Creole Oysters from here were to die for. Literally crave them on a regular basis so I","useful":0,"cool":0},"W3kCZJdK6dQEqm-gUKyNNw":{"text":"In town for business. Obviously strange times everywhere no more apparent than in The Fren","useful":2,"cool":1},"okU8eM6elr7VEzALVRVzfw":{"text":"Service was pretty good. Waiting for a table was about 10 minutes a little before dinner t","useful":0,"cool":0}}