{"yTdfnyswdwL4jlRgSXpL4A":{"text":"Slightly dilapidated, but that's why I enjoyed it. Very friendly staff. Clean enough, good","useful":0,"cool":0},"t8PNPW9Rf6lumHIAa2tsXw":{"text":"St. Charles Guest House is a wonderful place for groups.  We have stayed there with a yout","useful":0,"cool":0},"yGcegNk_STUydB3Ccq6NFw":{"text":"Worst... Bed & Breakfast... Ever...\nCollapsing building, no housekeeping, no fresh towels,","useful":1,"cool":0},"fcSadGitSMZ0uXdKwN6LzQ":{"text":"stayed here for one night. its awesome if you like a place with real character and don't w","useful":2,"cool":0},"54opQ3b9EJgkPG_j8FFc4w":{"text":"My partner and I stayed 2 nights at this adorable bed&breakfast. As a first time visitor t","useful":0,"cool":0},"PYReHsFeynkyh71W5yMcAw":{"text":"Every year we meet a group of our friends in New Orleans two weekends before Fat Tuesday f","useful":0,"cool":0},"vT6C7VUG3oC0blguOMkMRA":{"text":"I feel like the people who don't like this place should probably be staying at a sanitized","useful":0,"cool":1},"-N2wAFrQZ8ki4qpLMV7kBw":{"text":"I love this place! It is dripping with character and charm. The outdoor pool and patio is ","useful":2,"cool":1},"68_sYcuH-5lZTosH-bIizQ":{"text":"It's been 3 years since I stayed here so my memory's a little foggy. I stayed here when I ","useful":1,"cool":0},"Ws2FhM3iRdfUVMKayMYxiQ":{"text":"St Charles Guest House is a beautiful, quaint place.  I felt as though I was warped in tim","useful":2,"cool":1},"P8k5ZVo7Yvqe5hXvzhSRUg":{"text":"You get what you pay for and this place even offers a bit more.  I had several friends tha","useful":3,"cool":2},"l32jtaFtjCg-r3dYTiBJNw":{"text":"New renovations and new management by the owners' daughter. But still has the gravitas and","useful":1,"cool":0},"cJtSIFPC9rAzfU4XTqoCWw":{"text":"its basic and very reasonable, even during Mardi Gras. The rooms are funky, but clean, and","useful":3,"cool":0},"fTKM1IWArY1cVgMyIhFB8g":{"text":"stayed there a while back and... bedbugs. seriously. bedbug bites all over my legs in the ","useful":0,"cool":0},"iV1FwTEY3mAOL0Uf952sCg":{"text":"This is a very old, quaint guest house. The people here could not be friendlier. It went w","useful":2,"cool":0},"mkU6IQ9X3Rv3onmxskYSvQ":{"text":"If you're looking for an adventure then this is the place for you!!\n\nAs a 23 year old girl","useful":1,"cool":1},"_smPprhcCl3SpcEo_Mf1hA":{"text":"I really wanted to like this place. We got to our room on the first floor.. One giant dead","useful":1,"cool":0},"RVMPn7U2BI26Cn0Zdq2KiA":{"text":"Very very dirty.  Do not sleep on the sheets - there was set in blood stains on mine.  Do ","useful":0,"cool":0},"qdQEoOxJ2Rkaje6SJG4gWQ":{"text":"Checked in on a Saturday afternoon and the front of desk man was very helpful and made sur","useful":2,"cool":1},"uMH5jqfta_N3ou1WeGSStw":{"text":"Come back and join the regulars! This was the first time in five years that I've stayed a ","useful":0,"cool":0},"R5xvM-H_tDpZkKkIg7c38w":{"text":"So here is the deal with the St. Charles Guest House:\n\nYes, the bed is way too soft and th","useful":9,"cool":4},"dbWd6oiX30Qazcw2C9W8Yg":{"text":"My best friend and I booked a trip to NOLA for a senior road trip after graduation. Needle","useful":0,"cool":0},"qHWq0d9xjVYmdGVlIxUZ_Q":{"text":"Save your money and become part of the family!\nI have stayed here twice and looked around ","useful":0,"cool":0},"n5Oc13f2wYrNas-7tRE0ZQ":{"text":"We visisted for the week before Mardi Gras and we loved staying here. You just need to kno","useful":0,"cool":0},"qLsqrDAAaWUQ39UyHMw9Vw":{"text":"Take A Minute - I've told you about the location and accommodations at St.Charles Guest Ho","useful":0,"cool":0},"1KyzWBPnUBPmmVc-GQwDtg":{"text":"This is a great place for the budget-conscious traveller, who also likes to \n- hang out an","useful":2,"cool":1}}