{"0O_wR2cHmmI6reHJSo4izA":{"text":"I made my Yelp account for the soul purpose of reviewing this place; I think that very muc","useful":0,"cool":0},"voAH1NN73xZ9JSrmfz9wCQ":{"text":"Had a great breakfast here last weekend before we headed out. You order at the front and t","useful":0,"cool":0},"3WdmIq-vZ-yicuSKb551pA":{"text":"This is another one of those anytime coffee shops. You can come get some work done, people","useful":2,"cool":0},"yGt6Fp4Bf7_Y1mtyr61SgA":{"text":"comfy place with good egg sandwiches and really amusing bathroom graffiti","useful":0,"cool":0},"qumbqjYR_tcDYyf7n7KIKA":{"text":"Iced Irish cream coffee was exactly what I needed. Free wifi, chilled place. Outdoor seati","useful":0,"cool":0},"ZhE0yTQS9dg_e5TKsCGvyw":{"text":"The service was not bad, it did however have a line that went out the door. I suggest goin","useful":0,"cool":0},"HgMzA_SAY99BFr9UT3nNow":{"text":"Around the street from our hotel this place was great for morning coffee and a pastry.\n\nJu","useful":0,"cool":0},"_siwielDM35IFyiMhDkarQ":{"text":"Place is on the edge of the French Quarter in more ways than one. But the coffee was good ","useful":0,"cool":0},"nIGnbBAvRjX7_FZzxGdPdA":{"text":"Awesome for dine in or take out....groovy staff. We like to sit outside and listen to the ","useful":0,"cool":1},"s2IV7Jd_pQqU7fZo6ya6Fg":{"text":"The shepherd omelette was amazing!! Goat cheese, red peppers and portabella mushrooms were","useful":0,"cool":0},"A0Nfa4ckzdrNJhBCgSUrUw":{"text":"Competent simple egg dishes, croissants and paninis.  The chef knows what she is doing.  S","useful":0,"cool":0},"PnHbCcM48cUJhRxamaFRWA":{"text":"Looking at the photos of this place makes me homesick and I am not even from New Orleans! ","useful":0,"cool":0},"KpPlot-OsFg_8mRHhHtjEg":{"text":"Clearly a local joint which was nice. Good service and decent food. Eggs where good, best ","useful":0,"cool":0},"Vq6vNgqyPTEoBG-61QfGYA":{"text":"Pull up a chair, it's time for grandpappy Jake to talk about his life.\n\nWhen I moved down ","useful":4,"cool":2},"lFbPYIsfy9KT0DU1g57U7w":{"text":"Cute coffee shop with lots of room and space. Free wi-fi. Cheesecake was great. They had s","useful":1,"cool":0},"ykrnzdOjeq7xDv-rFj46jQ":{"text":"Every time I get coffee for work in New Orleans I go here. I absolutely love their staff a","useful":2,"cool":1},"kfPGIxejJ1xMos2KD_uuBg":{"text":"Probably the best White Russian I've ever had in my life and it was only $5.50.  Staff was","useful":1,"cool":1},"Wy1zEv7t1UDde1xJkQ5vDg":{"text":"Very relaxed and chill atmosphere, great food/drinks! Friendly staff and clean. Menu offer","useful":0,"cool":0},"h1YIjuWObe0LGlxIW7YMuA":{"text":"We came here for breakfast. Loved the menu options. Also, the atmosphere was perfect with ","useful":0,"cool":0},"ZcmzFvc5_qATYNbCRUkOJQ":{"text":"Great service, yummy lattes, very good espresso and almond milk! Didn't have any food but ","useful":0,"cool":0},"tzWHPAuN2AjwZIXMm6u8KQ":{"text":"Envie is a great spot for people-watching or reading. The baristas are friendly and good a","useful":0,"cool":0},"7lUySR8anfrXlYmV9znS5g":{"text":"Got here as they were getting ready to close down - needed a caffeine pick me up before th","useful":0,"cool":0},"IuKcvpv4PWHTbSwk9-XZcA":{"text":"Awesome experience as our first meal after arriving in New Orleans. Lady up front was grea","useful":0,"cool":0},"S4VYwSHqyDKyqlVYd_cT3A":{"text":"Great food and awesome drinks!  The breakfast sandwich was great - and HUGE!  Bacon and bi","useful":0,"cool":0},"Ejhx_vptl7qVEuyjk-ddEw":{"text":"A lovely little space that offers a big, delicious breakfast......I had eggs with ham and ","useful":0,"cool":0},"ZuI54qj6yfqT32bTFm2kPw":{"text":"They do the coffee/tea right, the location is great and you have to like an open-air cafe ","useful":0,"cool":0},"FCXseIWrkSUzC5wHZxVXrw":{"text":"Good croissant, brie, egg sandwich!  Nice lattes, delicious hash browns (almost like a pot","useful":1,"cool":0},"gwE9RZBtfmG_s-2Oem3iYQ":{"text":"Delicious coffee and breakfast!   The shredded hashbrowns were a standout, nice and spicy!","useful":0,"cool":0},"-kHva0hK8slq8bG3MXQ_yA":{"text":"The small rainbow sticker drew us inside. Always glad to see GLBT friendly businesses. \n\nT","useful":1,"cool":0},"PA_Iqq_9MNq8u27Kczu2Qw":{"text":"Great coffee spot. They have a large selection of coffee, teas, and coffee and alcohol dri","useful":0,"cool":0},"4jSEYzBRSDxFfpLhOuBy6Q":{"text":"I can't vouch for the coffee, but we had some nice peppermint iced teas here.\n\nThe space i","useful":0,"cool":0},"zpNvsOlPaS0B4h9vBWBFiw":{"text":"Was looking for a good place for breakfast that wasn't full of frat boy wannabes and found","useful":0,"cool":0},"CKV7kAUT0Y0cAiVOp0gDhg":{"text":"I'm giving Envie a four star for a lot of reasons, but most of all I think it's for the se","useful":2,"cool":1},"iYvx8xcJ-CWf9jeI0pb24Q":{"text":"The expresso macchiato was tasty! The regular expresso was a little bitter. Not a big snac","useful":0,"cool":0},"u41idk1kvHgPIw1HaUnDsg":{"text":"I will be the first to admit that rating this place so highly is heavily influenced by my ","useful":0,"cool":0},"NMR9n_Anlc_2lpUiRjQkUA":{"text":"Great food at a fair price. If your in a hurry, go to a fast food joint. If not this is th","useful":0,"cool":0},"Y0nq8Plb5tlyLdJT2mO2LA":{"text":"It definitely gets crowded, but NOLA is a destination. There's nothing we can do about it.","useful":0,"cool":0},"Ae3gjEWI1LjKMDd1RGhfHg":{"text":"This was the best coffee around the French Quarter that I could find.  A nice place to sit","useful":0,"cool":0},"apRb9gBWs1jZ_QvtbCPffw":{"text":"My mother-in-laws favorite coffee shop in New Orleans so we had to stop by! Very impressed","useful":0,"cool":0},"anWpeN1ECHx03rqIs5c9mw":{"text":"We loved Envie! We ate breakfast here two out of the three mornings we were in town. \n\nThe","useful":0,"cool":0},"qRRr7bRZWvRL9v4pWz26Xg":{"text":"Surprisingly, Cafe Envie was one of the best meals I had while in New Orleans. Cheap, hear","useful":2,"cool":0},"1mx0PFel4Z6WoFdLtnpHKA":{"text":"Came here the morning of St. Patrick's Day, and the barista was pretty festive. \nApparentl","useful":0,"cool":0},"m53kSa1D00dI-bxAT67tpQ":{"text":"Cafe Envie was an amazing cafe to visit while in NOLA. The espresso my sister got and the ","useful":2,"cool":0},"zkFDhczI6j3UN6iA4WPZfA":{"text":"As an out-of-towner who masquerades as a stodgy professional but secretly (even not-so-sec","useful":1,"cool":1},"jyJrp3sNI7zyAxZA5UWO7g":{"text":"The coffee was wonderful, as were the scones and croissant. Then we got the prosciutto and","useful":0,"cool":0},"cMdA0YqgqdyOGXBr5GSP9Q":{"text":"Pricey but good! Two of us had breakfast here for $26. I got a coffee (nice big serving) a","useful":0,"cool":0},"JAHuJtvVGRBUgJFrWPwhAQ":{"text":"Cool, welcoming atmosphere with nice-feeling wooden interior. Quality coffee, king cakes (","useful":0,"cool":0},"DBjjTgNtnSIesSQ0KHOhOg":{"text":"The coffee is OK and it's fun to get a shot of booze in it. I'm never really excited by wh","useful":0,"cool":0},"zb2NJuJC1Ek-hNlWmbz5VA":{"text":"Delicious food and fun atmosphere. Great for a hot chai, spiked coffee, pastry in the morn","useful":0,"cool":0},"EaD63sv-V5R7B1jK-HmE-Q":{"text":"I didn't manage to order anything here because the line was too long and my boyfriend lost","useful":0,"cool":0},"osH6RAaQf5O55yTja11qpQ":{"text":"I have finally achieved my Envie dreams and squired my check in cookie. As I sip on my wee","useful":1,"cool":1},"XDrklSZWRW6qqu8ydTlXgA":{"text":"I'd also like to boost this place and clear up a few misconceptions.  In my experience, gu","useful":6,"cool":1},"Wis0Kp15QT81UEwjDXufgA":{"text":"Coffee was very good, especially the iced americano. Pastry was also delicious. Casual atm","useful":0,"cool":0},"QpHTicDUlWMJHhnfGqbUlg":{"text":"I had just discovered this cafe the other day, thanks to the people I am staying with here","useful":1,"cool":0},"BNG6s-GsSwZKmiD5ZSlEuw":{"text":"Visited New Orleans this past weekend and ate breakfast at Envie every morning and lunch o","useful":0,"cool":0},"S3JO-tdXMh4IjM8DPwyOuw":{"text":"This place is quite nice. The servicer was very kind and informative. I got the breakfast ","useful":0,"cool":0},"_3N6V8fxuHyRqg5G6uW7Jw":{"text":"My best friend & I came here 3 out of the 5 days we stayed in NOLA. They knew who we were ","useful":1,"cool":0},"5CTZ98sYXIeKpVk_WIryiA":{"text":"On 10 days in New Orleans this was my favorite spot. While small there always seemed to be","useful":0,"cool":0},"9ltRBcPei9kqwDTLk309mg":{"text":"4.5/5.\n\nThis is a great local establishment somewhat removed from the hubbub of the French","useful":0,"cool":0},"DthbMvcgZi1m4v8Sj4LzYg":{"text":"This place was so cool! We got our coffee all but one morning during our stay in new orlea","useful":0,"cool":0},"xMbiXrQBOzs_fDvc-GMi-g":{"text":"I happened across EnVie with three friends this past holiday weekend, and we absolutely lo","useful":0,"cool":0},"q3W68UAeS7VB0IvTXfjb7w":{"text":"My favorite little cafe (just on the outer cusp of the Quarter) to just hang w/o obnoxious","useful":0,"cool":0},"eBNFTVB4mpW5D065EuQuMg":{"text":"I live right around the corner from Envie so it is a convenient spot for me to grab coffee","useful":1,"cool":0},"oDyRO1ku4MKNu5MLNrcYqQ":{"text":"The best coffee I had in New Orleans...and we drank a lot! Phenomenal breakfast. A+++","useful":0,"cool":0},"YnPki3C-wLTk7TgNkFH0nA":{"text":"Visited this unique restaurant with my family and it captured the essence of a quaint cafe","useful":0,"cool":0},"s2b5wRtNrBHbufIKv9u2Pg":{"text":"My boyfriend and I really enjoyed our visit at Envie. We ate the Breakfast in a Go-Cup; a ","useful":0,"cool":2},"1vMHfDkWEzofgneZt1EEgQ":{"text":"I like Envie - reasonably priced breakfast, yummy cookies and friendly Baristas!! I never ","useful":0,"cool":0},"vUc1pZ4lNX7slCUYWdOHGA":{"text":"Cafe Envie and Espresso Bar offers Continental breakfast in the French Quarter. This place","useful":4,"cool":5},"FBSkKPiyREnIhUO9qjTBWw":{"text":"This place is just as sweet as the pralines they sell down the street. Baristas who are pl","useful":1,"cool":0},"cssaWRaXUkDu52g0pxGs7Q":{"text":"This place is great. Its not a table service place but it has a fun atmosphere, good food,","useful":0,"cool":0},"JaJwU-IUBwBgyzo7QMubkw":{"text":"When I'm here in New Orleans this is my away from home place for coffee. Mostly friendly s","useful":0,"cool":0},"f-uEFNWd5XxyzkrN5gLE5w":{"text":"Yeah its small , Yeah the Wifi is a bit off , but this cozy moody coffee shop has that rea","useful":0,"cool":0},"4a7O-wDyEW0is_0JFD0Ysg":{"text":"Cafe Envie is great for coffee in the morning, probably good for lunch, not so great late ","useful":0,"cool":0},"hxmEhUZj18L9jo_54JWVlA":{"text":"Its off the main path, pet friendly. Looks like a place local visit and free WiFi. If you ","useful":0,"cool":0},"BKj5yVRlE_l9hdAVYe7YtQ":{"text":"the owner was very helpful and friendly, we got there about 12:15am (looking for a quick l","useful":0,"cool":0},"6YhKlW478sQrxBsRDho_pg":{"text":"Great late late late night early morning place for a cup of Joe. \n\nSeems like there are so","useful":7,"cool":4},"1FoLkHsmnGoXXtANjBzLDw":{"text":"Horrible iced coffee.   The cashier was rude and standoffish.   Told me the next person wo","useful":0,"cool":0},"a4ZnWnoKpBiU9nRYeDoZyA":{"text":"Food:\nSmall overpriced grilled sandwiches: ~$9\n\nFree WiFi: great!\nBright open airy place t","useful":0,"cool":0},"Jb38Y9SSrxpLLfPXcKNJhg":{"text":"My asparagus prosciutto omelette was excellent. The fresh biscuit was great. The whole mea","useful":0,"cool":0},"Lr2c33Z8eqosJipBqmTIoQ":{"text":"Super cute coffee shop. Only came for cookies which I was recommended by our server at Lou","useful":0,"cool":0},"qbKX1QhLTuEW1Ru2DvAg_g":{"text":"ok. stop here and get a cookie. i would rather have an envie chocolate chip cookie than a ","useful":0,"cool":0},"hqCZK51qr2B6b7kzrlpJyg":{"text":"This has been a frequent stop for me after a hard night of drinking. This past Sunday morn","useful":1,"cool":1},"xD9UOnYDxRBVr5bj-NPmWw":{"text":"The prices are just the same as your starbuck places. We had regular coffees- Mexico Chiap","useful":0,"cool":0},"43ZkP7_feEQJcSgsnkWyUQ":{"text":"Hung out here a lot post Katrina. Nice place.","useful":0,"cool":0},"hxCEevPzny0bdFF5PmGyBA":{"text":"This is my favorite coffee shop in the quarter. We stayed at Le Richelieu right around the","useful":0,"cool":0},"e0ElPHXdt9VYFm24V9Z4-g":{"text":"I meet a friend here for coffee often because it's a convenient location for  both of us. ","useful":1,"cool":0},"f_-QSpdnQ7ZDvOGvAbOJ1g":{"text":"This place was right down the street to our hotel. All I have to say is YUM! We had the br","useful":1,"cool":0},"exqFJ7HJBmMKd1otmauWOg":{"text":"I was so glad this place was right around the corner from my hotel which had the worst cof","useful":0,"cool":0},"g-K_6tQjtOsnU2rHfTG3Lg":{"text":"LOVE THIS PLACE!! Stupidly left my purse hanging on a chair last night and Tessa the baris","useful":0,"cool":0},"qlfwHvcHnDrjO6G5aurlQA":{"text":"Barista shows some love to my dog every time we go.  Friendly place and really good coffee","useful":0,"cool":0},"3sIpevIHqqfD3G3D3wCwxg":{"text":"Was in town for four days and ate breakfast here twice.  Coffee tasted soooo good.  I wish","useful":1,"cool":1},"AvXy5cYU0Gyeb5AVSVVG3A":{"text":"Love this place.  Is this what Starbucks was before they became a big Coffee house? A loca","useful":0,"cool":0},"LRv7YOxKcLdkS01uMctjHQ":{"text":"Cookies the size of your head.  Best coffee and tea.  Friendly and open late.  Have little","useful":0,"cool":0},"GZNZKYT9kURsq8cn5jp_IQ":{"text":"Woohoo is right! Hubby and I found this great place on our fifth day in this lovely city. ","useful":0,"cool":0},"R9d3PWGysrDXbNj-FhD9gg":{"text":"Obviously there are tons of French Quarter places for breakfast and morning coffee. Most a","useful":5,"cool":5},"bsr70HxClH7NQnjk58l8jQ":{"text":"was in new orleans this past weekend.  vic and i stopped in here a few times during our st","useful":0,"cool":0},"PTpyjj7qbubLy3Tvx5ljHA":{"text":"This place hits the spot on every note. Strong coffee, delicious biscuits, & perfect NOLA ","useful":0,"cool":0},"b48nRstr9Y2GJlnic4eC0A":{"text":"Just got back from a trip to New Orleans.. and came upon this delightful place by chance..","useful":0,"cool":0},"SltmF2wUm4C2kDAGEmYl-A":{"text":"The best grits I ate in New Orleans were from Cafe Envie; they paired surprisingly well wi","useful":0,"cool":0},"f_AtXpHc_xMSiP_Ndt907A":{"text":"Who: myself\nWhen/where: summertime, French Quarter\nWhat: ICED COFFEE\n\nWhy: If you're here ","useful":1,"cool":0},"dZUPyZ1BE8t6WVkhsAVcxA":{"text":"We stayed close to this place and stopped in for breakfast before leaving town. Super cute","useful":0,"cool":0},"WDvgO8etK_7ruSVz80n6pw":{"text":"Really like the coffee, and very friendly people. Have been there twice in the last couple","useful":0,"cool":0},"D0ZlMXW-v8o5ZI92gGzcMw":{"text":"This is a great little place if you want to grab a quick breakfast, lunch, or coffee. They","useful":0,"cool":0},"IajEKQBd35b1-BygdcK9gQ":{"text":"Normally here for my go to business trip on the run \"breakfast in a cup\" which is complete","useful":0,"cool":0},"-an_M0pvOGIQRxZz4rk1jw":{"text":"This place is perfect. The food is great, coffee great, very kind customer service. This w","useful":0,"cool":0},"ZZQJUteiIIQ3bHLDq1EvDg":{"text":"Awesome little spot. Clean and friendly staff. Food was delicious.  Great spot if you're l","useful":0,"cool":0},"E7XvWJTKmZ-TweW5Xvtj_w":{"text":"Great for people watching, great centralized coffee spot hangout, so-so wifi, outdated dec","useful":2,"cool":1},"J_uoITH62LCaZJSbWtr7HQ":{"text":"I am always up for a good afternoon iced coffee, especially in the heat and humidity of Ne","useful":3,"cool":2},"XvSCY3IbX6D7onf6wdLnbQ":{"text":"Great vibe, treats, and coffee. Add the fact they have a bar and I think I should be capab","useful":0,"cool":0},"f9K5FFJKG_uVx15wmESQIw":{"text":"Envie is a bad influence. No, not a bad influence... \"Negative Encouragement\"\n\nPros: Well-","useful":6,"cool":6},"BtGkEb1BupnqN5b9rsOQJg":{"text":"Eh... really wanted to like this place but the coffee and pastries fell short. \n\nWe came b","useful":0,"cool":0},"vkXXKYAtwXpFGtCH_nBEfA":{"text":"ZERO complaints from this kitty cat. I strolled in on a Sunday afternoon and had no proble","useful":0,"cool":0},"IEtFSRdKXsQcjSkE067d4Q":{"text":"Great, relaxed open cafe. The coffees decent, the irish option is a must. The service is s","useful":0,"cool":1},"fGrianS7T3z-Z3v-lEb9Qg":{"text":"Stopped in for my morning coffee and had to wait 20 minutes to get served.  The couple tha","useful":0,"cool":0},"pt9upK0o3cvqRoa5y2GJVA":{"text":"Very good cafe au lait, in a town with many great cafe au laits.\n\nLocated in the eastern p","useful":0,"cool":0},"vUbdwHD5JAjYFqgIJ6IKcQ":{"text":"We had very good breakfasts here.  I had the farmer's eggs and they were perfectly cooked.","useful":0,"cool":0},"kBLywpSKFS1QlZttmnJoXQ":{"text":"VERY much above average latte. The building is dirty and chaotic with people and dogs ever","useful":0,"cool":0},"vnqDfjnuxHUW9IbJvIAihQ":{"text":"Very pleasant place, so relaxing, dont expect to be seated, just get the coffee and GO! Sp","useful":0,"cool":0},"_9DqYeNfYT_nRMEyAhLXmA":{"text":"Sunday, 9:00 PM.\n\nQuickie:\n* Drink quality\n++ Friendly staff\n- Cleanliness\n+ Fast wi-fi\n+ ","useful":0,"cool":0},"mh5HkFoaSZQyvMR7UfjtFg":{"text":"Sunday in NOLA I was on my own for breakfast. Of course I made this a huge deal in my head","useful":2,"cool":2},"AkrK8a5i9PEH5tLZVSX0_g":{"text":"The girl at the Electric Ladyland Tattoo said this was the best place to get a mocha and s","useful":0,"cool":0},"A1aMOLwgVUzgKmIC8qkpCg":{"text":"Not only does this place have great coffee, but the desserts are amazing & the omelette I ","useful":0,"cool":0},"8C0QlFIQde7HmXB7Hwh1xw":{"text":"We ducked into this charming coffee shop on a rainy day and were immediately charmed. Loca","useful":0,"cool":0},"voAybggXDgS7MdnQZ1v5aw":{"text":"I liked the flavored iced tea and the beau liked the espresso.   When I was forced to walk","useful":0,"cool":1},"T6JEkfv_raMKYqtpYfRhDA":{"text":"Good cookies and coffee. Pleasant service. Lots of tea and coffee choices.  A good stop fo","useful":0,"cool":0},"9cqdEJtHi5lz2pZCutTWqQ":{"text":"It's Christmas Day and everything is closed. Kaytlin, super energetic cashier tells us the","useful":0,"cool":0},"zowPW-6VSSD1DHroDe6diA":{"text":"Always had a great morning and experience here. The staff were friendly and the food was g","useful":0,"cool":0},"_jwNEIPjdwMRezBONAq-FA":{"text":"Coffee and alcohol is an award winning combination.\n\nAny tourist visiting New Orleans will","useful":1,"cool":1},"x4qjRYdKyWg88O3DkgrwhA":{"text":"We grabbed some delicious cheesecake and carrot cake from here a few weeks ago. They hit t","useful":1,"cool":0},"dAuAy6covPDBO_B31ticHA":{"text":"On a christmas day, I was looking for a coffee(Cafe au last specifically) after a sleeples","useful":0,"cool":0},"wJKUheSDv3ircETi_qog7Q":{"text":"Food is OK, coffee is really nothing worth screaming about. I love 'em, but they, like mos","useful":0,"cool":0},"8TppNQuYXnK7Dap6JPVb1Q":{"text":"Wonderful stroll through the neighborhood, cute place, no wait.  Very pleased with my capp","useful":1,"cool":0},"wOwwPJSGjKGuR6r6EyXBsQ":{"text":"I had the farmers omelette and it was very good and flavorful. The biscuit was absolutely ","useful":0,"cool":0},"4jNWKFvYIGkAGKM3-QCMQQ":{"text":"Nice place to chill.  Laid back staff.  The coffee is good, but u just have to try the ras","useful":0,"cool":0},"3SHmfRwE90oDd8uujRL6Rg":{"text":"Quaint cafe in the quarter. The food was okay. Not anything too rave about, but satisfying","useful":1,"cool":1},"M98VRGh3BhBR-gRK0Oomgg":{"text":"We went to Envie because I saw it on the show Broke Bites. We loved the Breakfast in a Cup","useful":1,"cool":0},"33bfyhi17HKEUp2VcErZ1Q":{"text":"One of the most charming stops for me in the Quarter.  Full bar, eatery, and coffee shop. ","useful":0,"cool":0},"xD1Gl6D6TBhRSl99q3e0Hw":{"text":"Nicely designed coffeehouse (lovely octagonal tiled floor, wood paneled coffee bar, large ","useful":1,"cool":1},"IhdPYxuoasg5hjMS31Na1Q":{"text":"Great neighborhood spot. Great atmosphere and service. They have many options for iced tea","useful":0,"cool":0},"Ye-U8zqwKHZJuPPFkOP3Wg":{"text":"I'm used to cities where you can find a temperature-controlled coffee shop with comfortabl","useful":2,"cool":1},"RF9KoJ7ymcy8AGVi09TPGA":{"text":"Cool as the other side of the pillow!\n\nA coffee bar with stellar espresso drinks and well-","useful":4,"cool":2},"mCNch9C21BNnoXZEmxYR0w":{"text":"Came here just once around breakfast time during a visit to NOLA, but was impressed. Outst","useful":0,"cool":0},"83q_4f1E07ubTfsGncWiQA":{"text":"Friendly service - killer breakfast for a coffee shop. The feta and spinach wrap is money.","useful":0,"cool":0},"W2_pgyDXLyPo01EdHR-Q3Q":{"text":"Everyone posts about the breakfast in a cup as if it's the best thing since sliced bread..","useful":0,"cool":0},"DXXxWid8Aphqz16czjNrwg":{"text":"Had breakfast there. The signature breakfast sandwich was great, the coffee was good, and ","useful":0,"cool":0},"ksjslaAnDNz4Gkb5IA73MQ":{"text":"I have loved Envie for years. I'm a big fan of Sara (Sarah?), who generally makes my latte","useful":0,"cool":0},"dT8zlG95A6JiNwoU1TGimg":{"text":"We got the white rushin and the fireball mocha... Both great! Loved the vibe.. Live music ","useful":0,"cool":0},"kHksWZFUo2n36op8Tw-XZg":{"text":"I love the music selection! From TV on the Radio to Belle & Sebastian right into The Notor","useful":0,"cool":0},"zGX03qtFVbWrkdNTowePPA":{"text":"I use to come here for this amazing veggie bagel with a side salad. Apparently they change","useful":1,"cool":0},"0ojYeyjZVROr4mJZrCARTw":{"text":"Good Capuchino. That's what I'm here for. Service and atmosphere don't matter. As long as ","useful":0,"cool":0},"AbwgykJxkutiyyzqLfMuXw":{"text":"Strange service -- sat at the counter and the woman behind it acted like I was strange bec","useful":0,"cool":0},"ZuLuof_WV2U33MwHEnkIcw":{"text":"Stopped by on the way to Frenchman st. As a tourist I asked my NOLA resident friend where ","useful":1,"cool":0},"mlsbOhZYziBawF6xdMI3dw":{"text":"excellent latte! the ambiance is kind of artsy... the surroundings could be a bit cleaner,","useful":0,"cool":0},"rpe2G8LNQK9owdMVQsVNeA":{"text":"It was surprisingly difficult to find a place to sit down in the French Quarter for just c","useful":0,"cool":0},"HlrR4crvUGgus_2EZujcPg":{"text":"Went to Cafe Envie (new location). Beautifully crafted macchiato! Made with love and taste","useful":0,"cool":0},"xjMdrfpd2d_ztcueRGBC5g":{"text":"Go to place for a fast and really good breakfast and cup of coffee. Had the breakfast in a","useful":0,"cool":0},"Bqjd3JphqKTcjzc2dwVQhw":{"text":"Drink menu is super unique, albeit a little pricey. I wanted to come in for some spiked co","useful":0,"cool":0},"yHFDJg-2fUEWR0T7Jb60Tw":{"text":"I love cafe Envie. I've been coming here every other day (between both Decatur locations) ","useful":0,"cool":0},"tj12We3osxr4cZ6WCDMp3Q":{"text":"Great service! Had an Italian soda and a latte. The kind of place they remember you. Perfe","useful":0,"cool":0},"BkTWx54IdT_UI5ZsjG0XJg":{"text":"I went here with my family on thanksgiving morning. We all got coffee and a meal. We all r","useful":0,"cool":0},"p3JdLKX0XVzaLOzw6X8xtg":{"text":"Really nice service. Cheap food esp. For french quarter. I got a pastry and coffee for $6 ","useful":0,"cool":0},"zT32Iy5IJE1eCC45E9NKug":{"text":"Best muffins I have ever, ever, ever had! Their breakfast options are not that extensive, ","useful":0,"cool":0},"e2EpKrHrdMvHX_t6MfzDDQ":{"text":"Cute coffee spot with snacks. The coffee is decent. Friendly staff, great location.","useful":0,"cool":0},"fs5KmKg09h4LQfi3hwlNiQ":{"text":"Great coffee drinks (with or without alcohol) and some tasty treats in the cabinet. I had ","useful":0,"cool":0},"WTWvQXjlJgHsOYbh2-PgHg":{"text":"I got coffee here a few times while visiting New Orleans. The cold brewed, keg coffee is a","useful":0,"cool":0},"lCD1l7-DSeIdE7dDrn3bNQ":{"text":"Best hash browns I've ever had in my life. Got the eggs envie it was great. Friendly staff","useful":1,"cool":0},"68zmVhLT35p5W7eoXtV7eA":{"text":"I can't say much about this place, other than their coffee is a life saver. Their iced cof","useful":11,"cool":8},"-0UydxElstzlxDkzXfK6bg":{"text":"We had French toast, eggs, bacon, hash and a couple of lattes, French toast was very good,","useful":0,"cool":0},"0P9Pz_XponQaVZ-2S_6rzg":{"text":"As is so often the case, I stayed up way too late cleaning and packing the night before ou","useful":1,"cool":0},"O4dQQf4bgygFGIDMsCyaVA":{"text":"Ordered a beef and cheddar....,out of beef. Replaced with steak quesadilla with pasta sala","useful":0,"cool":0},"7Z_5Q9o1p9WC6-WncpjsiA":{"text":"Great place to stop! The servers were very nice and had lots of recommendations. The beer/","useful":0,"cool":0},"xDXGANk0A0ecvUT43L9sCg":{"text":"Random Yelp lookup since the place we intended to eat at had a 1.5 hour wait. \nNice and ca","useful":1,"cool":0},"nllqY_sHvCRL2PCyKEBr7Q":{"text":"We came here twice to get some coffee and use the Wi-Fi but when we got there, we were off","useful":1,"cool":0},"2GQbxi6iDJRQcGKICcdFrg":{"text":"We enjoyed our bfast.  A bit pricey, about 24$ for two bfast items plus coffees but we enj","useful":0,"cool":0},"rRFhKzuQVaX4FBTt44fHlg":{"text":"My fav cafe with the best peanut butter cookies ever!!!!\n\nI absolutely adore this place. W","useful":0,"cool":0},"5ssAt0d55SYSyXKkPiTHGA":{"text":"I've been here three times now because the coffee is really good, as is the food.  It's un","useful":0,"cool":0},"M5DU5IZOO1DZn3alEWRjGw":{"text":"What a charming cafe. It has great character, and the breakfast combos are delicious. It a","useful":1,"cool":0},"V5FdfiZ3fR67O_dFpezmRQ":{"text":"We were looking for a place to rest and recharge. I didn't realize \"espresso bar\" meant a ","useful":0,"cool":0},"jLymd092bFgTclIDWoyvFg":{"text":"Stopped by to grab a warm coffee since it was a chilly day in Nola. I wanted a regular cof","useful":0,"cool":0},"7N3E3Jt1fm8uE3AKK3xbWw":{"text":"Actually strong coffee in New Orleans (which can be hard to find, for Starbucks-esque dieh","useful":0,"cool":0},"eSZA-66ParAahiY64aAJkQ":{"text":"I get my coffee here daily. Alittle expensive, but worth it. The women with the tattoos, a","useful":0,"cool":0},"prfzRsgPHkcSSnw8AVOSOA":{"text":"Went here in early January. Nice place to grab a coffee on a cold morning.","useful":0,"cool":0},"-1rytnmmSsO-DtlH7jbUfA":{"text":"I walked in to find the counter server talking with his friends. After 10+ minutes, he fin","useful":0,"cool":0},"VClC1v388I-2X2-UEwmGFg":{"text":"I LOVE this place!!! Great people watching, fun and helpful staff. Great drinks with or wi","useful":0,"cool":0},"bDzFsy2alshjjAgjR0pfmA":{"text":"This is where I like to eat breakfast in New Orleans !!! \nWe just spent two nights at LeRi","useful":1,"cool":0},"gSsif6sk4CJ5Uh0-rKwZGw":{"text":"Simple and delicious- nestled into the quarter. \nPeople are incredibly friendly and the fo","useful":0,"cool":0},"TRk42kyFUKOOSIjb3jxwSg":{"text":"The WORST.  Ordered hot coffee and they gave me cold coffee. When I gave it back they adde","useful":0,"cool":0},"71xatPGXzYBUsZksBa3u0A":{"text":"Four stars for the coffee.  Ordered their iced coffee....not bad at all.  Their brew is ac","useful":0,"cool":0},"ojjywVWIdpN7GWpzhConSg":{"text":"Food and coffee is good and I would give it a higher rating if they would give the place a","useful":0,"cool":0},"TWblSDLde0R6QZAEutoq5Q":{"text":"Nice little coffee house with a good eclectic menu for breakfast and lunch. You can relax,","useful":0,"cool":0},"KzupHbjD_pvci1QBmEXpcg":{"text":"This is one of my favorite places in the Quarter and has been for quite some time.   The s","useful":0,"cool":0},"K5-y_QklyIJD3yH1QsIaTg":{"text":"Sometimes I feel like I'm in a relationship with Café Envie. I visit often since I work ar","useful":0,"cool":0},"A3UkkUS-6Yl1STdFtAtTWg":{"text":"Staff is awesome, yum spiked coffee and hot chocolate. Best coffee house. A must stop for ","useful":0,"cool":1},"qDz4nJN_mX_49TV1a0gjYw":{"text":"Great little place we discovered around the corner from Le Richelieu where we were staying","useful":0,"cool":0},"nX6WnZT8txPsBHAjR39sSQ":{"text":"Best breakfast - omelette, biscuit, etc. - in the French Quarter. Proper hit black tea wit","useful":0,"cool":0},"0lNKa4W8xKMSNrT_r30qOQ":{"text":"I visited this place several times while on vacation in New Orleans. It's conveniently loc","useful":1,"cool":1},"U8DMOJGnAb7I5nqO1qjVHA":{"text":"From the breakfast in a cup to the oh-so-yummy coconut cake and gigantic cookies to the co","useful":0,"cool":0},"ZhElngqa9ChNjrbWXPK1Hg":{"text":"When my coffee date suggested it I realized I hadn't been here in AGES. The best thing abo","useful":0,"cool":0},"o8lehc4CiWK8gxvSgVO1fA":{"text":"Cafe Envie is a solid spot to sit, have a couple of drinks, get a bite to eat, and while a","useful":1,"cool":0},"JJBPnMIvnNcK5Qesqp9qiQ":{"text":"Extensive espresso cocktail bar so they have every syrup imaginable for whatever flavor co","useful":1,"cool":0},"BLfFPXm7mVdoZ5fqAIgDTg":{"text":"My wife and I recently visited New Orleans and stayed just down the street from Cafe Envie","useful":0,"cool":0},"9P9A4N2JMVoOEHRKoaNs0g":{"text":"This place is pretty alright. I got the chestnut praline iced coffee and it was fine. Not ","useful":0,"cool":0},"QQYSyzx2cPuWwV-6QJqfBw":{"text":"This place is one of those places I always pass by but never walk in. But, one day I decid","useful":0,"cool":0},"6aTSvIuxurZObsre59HLLA":{"text":"As the weather gets more comfortable, my tether to my apartment gets longer.  So, on a rec","useful":1,"cool":1},"Y9ZcCpekt4VIJsIwVGDccQ":{"text":"It was freezing cold in New Orleans, so we decided to stop by a coffee house to warm up...","useful":0,"cool":0},"dH0F4waqN-2RajixSy0rWQ":{"text":"Cakes and coffee are both good. Ordered the red velvet and capuccino. Small capp has two s","useful":0,"cool":0},"dPl1RglkizrEgP6VHhBMhw":{"text":"Sarah and Ashley are so helpful and sweet. I got the traditional breakfast plate. Best has","useful":0,"cool":0},"CKMgY8zOimzAS3rCdm4pXA":{"text":"Farmer's omelette was huge. Comes with ham mushrooms cheese tomato. A side of hash browns.","useful":0,"cool":0},"vJcmnYjm2EovVFIE42RCag":{"text":"We came here a number of times during our 3-day trip and had a good experience every time.","useful":1,"cool":0},"A2KJJkaEAn91DPFPFk8FCw":{"text":"This has become a must go to spot when I'm in the city.  My homeboy that I stay with lives","useful":0,"cool":0},"xRdLMA-JvUsQ_jrnsW8ruA":{"text":"A little expensive but absolutely worth it! Probably one of the best coffees I've had in t","useful":0,"cool":0},"OBjGFjFigxg9Lbrq1v1TIw":{"text":"Amazing local atmosphere. The breakfast in a cup was incredible! Pumpkin spice latte was d","useful":0,"cool":1},"JAzu6lQWqaWASA7ExHy88Q":{"text":"Friendly staff, clean space, free wifi and great coffee are always the ingredients to a li","useful":0,"cool":0},"xMz4MgxhUG3llp4lK1OMxg":{"text":"Came for breakfast.  Ordered the asparagus and prosciutto omelet,  very good!  The place i","useful":0,"cool":0},"32nGNU3-q3uUkAs1hacnbQ":{"text":"A chill atmosphere, wireless, coffee and more, and a cafe.  What's not to like?\n\nWhile exp","useful":0,"cool":0},"w5_AYMMvrVgFKCCIcAgUvg":{"text":"One of our favorite places to stop by in NOLA. My wife would come back to new Orleans just","useful":0,"cool":0},"Qe6PkgLHjLAYBknh02n12w":{"text":"I really want to give this place a positive review, it's just difficult for me because I w","useful":3,"cool":0},"n5DNRg_9_3ickwrpQIws1w":{"text":"Coffee: good. Service: friendly. Food: mehhhh. \n\nWe stopped by because it was one of the c","useful":0,"cool":0},"sXyWAQOYVprMOA_eU_LrLw":{"text":"My kind of coffee shop.  It's a coffee bar that looks like saloon.  When the weather's nic","useful":5,"cool":1},"fK-mrW_YSDE19s-_yHMDNQ":{"text":"This café became our breakfast go-to on our trip to New Orleans. Reasonably priced for ver","useful":1,"cool":0},"dOFvRPbN3YmjP256ZwldZA":{"text":"My husband and I stopped in for coffee after lunch one afternoon. \n\nI liked the location n","useful":0,"cool":0},"j1tUiY_KGWaCKboy6t4Pew":{"text":"Employees are friendly and helpful in explaining the different drink and sweets options. L","useful":0,"cool":0},"76D8MM4m-yQdtddvubtfeQ":{"text":"Awesome place! I came here to read and was able to do that. I had the best breakfast sandw","useful":0,"cool":0},"fEiJu6wCS2-XIEC7aYB9BQ":{"text":"I like hanging out here-- the people and the ambience are cool and laid-back. But I don't ","useful":0,"cool":0},"qmjedlzOEOX9R9XNYkthjg":{"text":"This spot is excellent for late night espresso runs. I recommend having a quick shot or a ","useful":0,"cool":0},"sVs8d_3lT_a4Bagbxy4WMg":{"text":"Breakfast served all day... This is my kind of place. Check the chalkboards for all of env","useful":0,"cool":0},"-TBe236rvKd2qlHcSM2gFg":{"text":"I miss some of favorite NOLA coffee haunts, but this place is great!","useful":0,"cool":0},"bTjZaxLx8cc4Y4a_y7Fz2g":{"text":"Decent coffee, cool environment. Not the friendliest staff, but it's a nice & quiet place ","useful":0,"cool":0},"VsDPz7ve8OZyC8ZjwaXgKQ":{"text":"I spent a tremendous amount of time at this place while busking Decatur street. Open wifi,","useful":0,"cool":0},"tZ3mC4sYwUrMuBOa-aMtmw":{"text":"Best Frenchtoast ever!\nVery friendly staff. Delicious cappuccino. \nThe prices are reasonab","useful":0,"cool":0},"LSreGGqT1Q9mfzKEkBq3Fg":{"text":"FOOD:\nWe ordered the breakfast in a to go cup! There's actually plastic cup inside the foa","useful":5,"cool":1},"EEzACmI5ntOQePY7twxRgg":{"text":"Having visited NOLA with my caffeine-obsessed brother and his equally perk-loving  lady, I","useful":0,"cool":0},"PJORxvtaHdy1MlJsVW7OqA":{"text":"Great place for some breakfast, cup of coffee and to appreciate the best of the Quarter.","useful":1,"cool":0},"lzJQm7-Qs5ld9DPOdNHFVA":{"text":"My friends and I had never heard of this before we saw it on the street; what drew us in w","useful":0,"cool":0},"GZb-dvrIrfw9yqrMIJialw":{"text":"The Hubs and I shared most everything here. I had the breakfast veggie burrito, pretty sta","useful":0,"cool":0},"cSbdBzC-ghcJrXQQYz0cPg":{"text":"I've always liked this location. There is an endless, riotous mix of odd characters paradi","useful":0,"cool":0},"12Ss2DxZRLHozFuOF5v-OQ":{"text":"Love this place! I go here to study all the time. they have the best coffee in the city an","useful":0,"cool":0},"YKAPucgK--_VlfIKjcmMQg":{"text":"the wifi never works, the coffee sucks, gutter punks work there, wtf else could they possi","useful":3,"cool":2},"5On7m2TUKPviBLjC-y31kA":{"text":"A great place to meet locals and tourists. The outdoor seating will give you a direct insi","useful":0,"cool":0},"Lh5PlT6qJQz7Qjhl0j914g":{"text":"I don't get the complaints. I spent the better part of a St. Patrick's Day weekend morning","useful":0,"cool":0},"0DQaXrjTJvmHhbPa84YQvw":{"text":"Friendly staff and great coffee!\nBe wary of some of the pastries though. the lemon bar is ","useful":0,"cool":0},"wBUy2Ou2R5LWtTmD2FGsnQ":{"text":"not super busy so far as food goes but terribly slow service and they got my order wrong. ","useful":0,"cool":0},"rbFTF3p3bZAR9MkHJC0rvg":{"text":"Three days in a row consistently good espresso drinks.  Today had a cookie too which was a","useful":0,"cool":0},"LcTGq1vwCGPA1CeK4v7IUw":{"text":"Suffices for breakfast but not so clean, hash browns overly salty, omelette overcooked.  E","useful":0,"cool":0},"nMlT65kX4Ge6ArcZ-lt2ZA":{"text":"I had the French Toast and it was amazing. Service was great and fast though my hubby said","useful":0,"cool":0},"nVMTlZLLJjc9_WSFABnlKg":{"text":"Great place for coffee.\n\nBeautiful building. Great place for a quick breakfast in the FQ. ","useful":0,"cool":0},"yJEzBjwsCfru9ytUyt6m5A":{"text":"Outdoor seating. Close to the French market. Nice Americano. Good crema. Pleasant staff. T","useful":0,"cool":0},"rljJGIZ10PHMPurVk7zMaw":{"text":"Love this coffee shop. Dog friendly with tables outside. So I walk my dog to get breakfast","useful":0,"cool":0},"DqaR_5122qiCFpUjGvz8YA":{"text":"DEEELISH!! the eggs envie were my favorite!! cheap eats and the food was great, highly rec","useful":0,"cool":0},"3_Q34i_6-1I0bxfJWwAyUw":{"text":"Had the Sheppard's omelet very good. Goat cheese tasted rich and all the veggies were fres","useful":0,"cool":0},"ahJp0Vdn_bm0vgn8Byl7Zg":{"text":"Great coffee and friendly service! Next time I'll have to grab a bite to eat. Everything I","useful":0,"cool":0},"nbKz-06xzYHHciYdaiFWJQ":{"text":"Breakfast sandwich was gross: basic cheap sliced white bread with funky egg, hospital grad","useful":1,"cool":0},"lP3OY0kEDbZNzhxRV0_KzA":{"text":"Great setting! Was out early on a Saturday morning walking around the French Quarter takin","useful":0,"cool":0},"wCDRjxGpEOLlmwPEuWtSaQ":{"text":"i'm not a breakfast person, a decent coffee and nibble of something sweet to get the day g","useful":0,"cool":0},"ESjWbA8havZgsLHswiiOaQ":{"text":"We'd been trudging the French Quarter for hours, poking around in shops and whatnot, and f","useful":0,"cool":1},"s4ygD_qhA0HSbj5DvJrLOA":{"text":"Stopped here to start our Sunday morning! Tried out the chicory coffee, Bavarian chocolate","useful":0,"cool":0},"8lR7Eg5dZ3FjrO8rH0jDwg":{"text":"This is an interesting coffee shop located at the edge of the French Quarter quite close t","useful":1,"cool":1},"ndJIgB_9MMEfz0tjzsDJ-g":{"text":"Love it! My favorite coffee shop for working late at night. Open til midnight and they're ","useful":0,"cool":0},"No_iGOIJxWYb0RbCy2RXMQ":{"text":"They probably serve the hottest coffee every. Considering that I like my coffee burning ho","useful":0,"cool":1},"aq4AkgslIDLjI60RGe3A_Q":{"text":"I had a pretty nice timing dining at Cafe Envie. The location is stellar--in proximity to ","useful":0,"cool":0},"jQ7h3hQDZ_e65m02-Wk8kQ":{"text":"While staying at the Frenchmen Hotel which is a 2-minute walk away from this joint, I want","useful":0,"cool":0},"Vq9oYSDnODUdfi1tbIyMnA":{"text":"I saw the \"breakfast in a cup\" featured on a things-to-eat-in-New Orleans list so I gave i","useful":0,"cool":1},"wLBc-dX1JYZ4VwjZhKmf8w":{"text":"Just popped in for a respite. We only had the cafe au lait. It was very good. We had a out","useful":0,"cool":0},"RG0E4kOIwt1SlYiQkOKxXw":{"text":"One of the best cafes I visited during my time in Nola. It is big, has indoor and outdoor ","useful":0,"cool":0},"wbd9tVlhpLNZFfZ45j0pEw":{"text":"i had breakfast (well, brunch, really) here yesterday, and I have to say it was quite good","useful":0,"cool":0},"_2i2wZw8a-AC_XNDQQ39rw":{"text":"Almost out of the way if you're just visiting the quarter and market areas. Good breakfast","useful":1,"cool":0},"jKYzWje-Hg8BhvMklZcFeQ":{"text":"Solid, cheap food, and absolutely outstanding service. I accidentally spilled my coffee an","useful":0,"cool":0},"Tbt828dBT2F_AK1ikzy1wg":{"text":"We were surprised to find Bailey's Irish coffee! Server was courteous and coffee was great","useful":0,"cool":0},"1ZLs1rnbDCDXd6qfgddKNA":{"text":"This is our go-to for great espresso and coffee when we are in NOLA. Staff is super friend","useful":0,"cool":0},"HQKyIX-yg0gt673FZlDgRw":{"text":"I really wanted to like this place and I was thrilled to see it open on Xmas. However, our","useful":0,"cool":0},"9VdsRWwEA4uAxYSkctnG0A":{"text":"Busy coffee shop with a hustling staff. We had spicy bloody Mary's and fruit.\nThe service ","useful":1,"cool":1},"LWcQdLcrzKC4rOKEehdM3g":{"text":"I love this place. The staff is so friendly to me and my shihpoo. They always offer him wa","useful":0,"cool":0},"5p0JRqd3vtD4tGT8mRkPoA":{"text":"Gutter punk is amazing!! Best alcoholic coffee!!","useful":0,"cool":0},"z_Zj4hJyIdyY_egQeLd9SA":{"text":"Very cute, comfortable place, especially the little 3-seat bar in the back that was perfec","useful":0,"cool":0},"QMs4iJxYBLqeULCZV3dWqA":{"text":"Friendly service and great special coffee selection -- a really great cup! Nice place to c","useful":0,"cool":0},"X0sL8AywJOxiJNIhSvLHxQ":{"text":"Dear Envie, I'm only giving you 2 stars because frankly, your performance has gone way dow","useful":2,"cool":2},"_orioi9nvld-jHyTZq4iSQ":{"text":"Envie has great coffee. It's a really busy joint, so it's hard to work satellite from ther","useful":1,"cool":0},"8mQ101gGqzbptzjJ8lc5-w":{"text":"Delicious pastries and coffees. Southern pecan was my favorite flavor. They have other bre","useful":0,"cool":0},"BuVBkPeAKxi8kvF4tCsaQQ":{"text":"We went to this cafe for a quick breakfast before a boat tour. Service was quick and excel","useful":0,"cool":0},"ZVNpFURu1PKFoLKCYImwOw":{"text":"Our taxi bicycle lady (Shannon)  recommended this place  and said it was good.... When we ","useful":0,"cool":0},"A9m8VugaekNQuM2dO9_8HQ":{"text":"Glad Yelp people suggested this place. I am a coconut lady and they have coconut flavor sy","useful":0,"cool":0},"xGn6wUaP2iNzbFULTMoMAw":{"text":"After learning that my hotel charges for wi-fi, I made a quick search for free cafe's with","useful":0,"cool":0},"io59QCTNkELbOjorpjb5Pg":{"text":"Terrific place. Original and great-tasting food. Really fantastic coffee and espresso drin","useful":0,"cool":0},"4hM6GbEq5Jt-YZ0vRN1-Lw":{"text":"Great neighbor-hoody coffee shop.  Atmosphere is real cool, inside-outside setup with awes","useful":0,"cool":0},"xbeYWopbyV92_-IhTURT9Q":{"text":"LOVE!!! Strongest coffee that I have found in New Orleans, and they sell alcohol! They als","useful":0,"cool":0},"9A_sj-JkwbLagRMgJ1V-Mg":{"text":"Great spot in the quarter with free wi-fi and some good grounds. Bathrooms are super clean","useful":2,"cool":1},"XOt-gSrKpcbgjLHUeg6JZQ":{"text":"Pretty much a Quarter rat I've walked by Envie hundreds of times.  I always thought it loo","useful":0,"cool":0},"QRMO_ItXbegXP69NtMirpQ":{"text":"Short wait but the hash browns were not \"crispy\" as they advertise. Coffee was super yummy","useful":0,"cool":0},"EFjXjrwIyRi3oJXRDKKEwA":{"text":"We came here for a late breakfast on our last day in NOLA and were lucky enough to score a","useful":0,"cool":0},"dROI6o1jvK7iQekMtsP_lQ":{"text":"Just came here to load up on caffeine. Ordered the chicory coffee and relaxed at the bar. ","useful":0,"cool":0},"EDQeNYjfoQiO1BxrON8k3w":{"text":"Guy behind the counter is nice as pie, first of all. Next, their \"Nola Fog\" is amazing - i","useful":3,"cool":0},"bdkOH7HPWP9EjnpYyQ8HDw":{"text":"No idea why a lox and bagel took an eternity to be prepared, but I had to ask for it twice","useful":0,"cool":0},"IbQ_nK2OHPp5qXR4MjS08w":{"text":"Best Service very genuine employees . traditionally New Orleans as one can get. Great food","useful":0,"cool":0},"1dnGMFUDXyL2HckKprNzKg":{"text":"The girl at the Electric Ladyland Tattoo said this was the best place to get a mocha and s","useful":0,"cool":0},"IJZh27IJKivo4tUqZTqJAw":{"text":"Cafe Envie, how do I love thee? Let me count the ways. 1) Breakfast in a go cup: heart-sto","useful":0,"cool":0},"sq09cm_gsbGWfbzXlUPARg":{"text":"Cute little cafe. I ordered a cafe au lait - delicious! I also ordered the infamous Breakf","useful":0,"cool":0},"a1i1xDAqwzS_cwq82CUyTg":{"text":"When I say, \"GLORIOUS\" that's what I mean! My wife and I were in town for Madi Gras and we","useful":0,"cool":0},"ADGmhpBbHxzWjdlxy0DwdQ":{"text":"Best breakfast spot that is inexpensive and cheap in the quarter. The hash browns are quit","useful":0,"cool":0},"rKtomYMOrlT2x3umtScRkA":{"text":"Had an omelette and mimosa. It was rather mediocre. Wasn't a real busy place, but convenie","useful":0,"cool":0},"8B4JkqeDlmXZ9UU9ETBflw":{"text":"Solid choice for coffee and breakfast. Because it is far away from Bourbon the place seems","useful":0,"cool":0},"bXhVFeb8DMMJpv9AZJpVwQ":{"text":"Great coffee and lunch spot - On my first visit I got the iced mocha and something like a ","useful":1,"cool":0},"PpLQQ8Y01Syz0kLDt_hLXQ":{"text":"Has wifi, though it wasn't working when we were there (wireless internet access is a major","useful":1,"cool":0},"JDtUJPwnY0vj3iGgPJpHCg":{"text":"Coffee was decent and it's a so so place to study. It's on a busy street so except it to b","useful":0,"cool":0},"zR9ZZ2K20rpW-mvs7LpI8w":{"text":"We go to New Orleans every year and always stay at Le Richelieu which is right around the ","useful":1,"cool":1},"25bXSLTBf0k12JelZmMPIA":{"text":"Try the iced blue eyes tea. Tastes like a vanilla flower. Slow service but interesting atm","useful":2,"cool":0},"gzl2E69GlrDD97wOhrCUKQ":{"text":"After my epic fail of coffee at Pj's I stopped in here to order something. I ended up gett","useful":0,"cool":1},"Oc64oh8ogLKJcKijwwuocw":{"text":"If this doesn't cure all the bad decisions you made last night, nothing will.  Hash browns","useful":0,"cool":0},"htkTnZlRQ0EJQybpyZgUoQ":{"text":"Open late. Decent coffee.  Dog friendly! Their lemon squares are the best.","useful":0,"cool":0},"CPJaDG2_Qi49rDJ_VVCkpA":{"text":"The girl at the Electric Ladyland Tattoo said this was the best place to get a mocha and s","useful":0,"cool":0},"1DHDpwm184fpfa5f0GYa3Q":{"text":"Nice shop with friendly employees. The espresso was great, the drip coffee was pretty good","useful":0,"cool":0},"M9mt5yKFeMid9PGuIIF6kg":{"text":"This cafe was by far our favorite place for breakfast and coffee on our trip to NOLA. We c","useful":0,"cool":0},"z4K9lWvd1roH4Y_gU1Pa7g":{"text":"Friendly staff. Decent coffee. Huge menu (and I mean huuuuuge) to satisfy any need. Ok pas","useful":0,"cool":0},"N8IPyC1vYg3LhcFVLuRBaw":{"text":"Person who took the order was not helpful in placing a vegeterian order. She didn't even g","useful":0,"cool":0},"IrgH90Vzl22SqRByqx5u-Q":{"text":"Worse service in New Orleans and terrible cold brew... taste like coffee cooled down with ","useful":0,"cool":0},"akeoUVualW9iqoDqbj_GCw":{"text":"Very hipster coffee bar, with a lunch and dinner menu and tapas served after 5PM.\n\nWhile I","useful":0,"cool":0},"PVMwzrwVHLza0cK8t69R1A":{"text":"Wife and I stopped for breakfast on Sunday of the Memorial Day weekend.  Got in just befor","useful":0,"cool":0},"nEUoKr2bRKwUp_WqaR-SZQ":{"text":"Always friendly and speedy service, and delicious coffee! My go-to coffee place in the Fre","useful":0,"cool":0},"l-p0z-8Fflk3YWCXmhWk8w":{"text":"The hash browns are very good. The coffee amazing. The iced tea, okay, but they have inter","useful":0,"cool":0},"rPVxOhUwnb1rCxFJCkNmZQ":{"text":"I severely dislike places that don't list prices, and baristas that can't tell you prices ","useful":0,"cool":0},"zeGqmad5o5ld7-CmkN40zA":{"text":"Came here five times during our trip for breakfast every morning, and iced coffee whenever","useful":0,"cool":0},"Feey2vPiKqsfkePReE_2Pg":{"text":"This place is my go-to coffee spot everyday before work! Great people serving delicious co","useful":0,"cool":0},"uJV11zulogw08V3e0vhEew":{"text":"The food was awesome. The girls were fabulous. When I come back I will definitely make sur","useful":0,"cool":0},"8lWR785fMp67rZ6oNZgRCg":{"text":"Came in for a bagel and caramel cappuccino and paid an arm and a leg, and waited a very lo","useful":0,"cool":0},"95CuaV9GPTkzmSwL_4NRuQ":{"text":"Great Place for morning coffee! \nWonderful service, great coffee and nice pastries. \nThey ","useful":0,"cool":0},"r1_siCOfSHyeEYHLq7-toA":{"text":"I really enjoyed the omelette I had. Staff was accommodating and the coffee was amazing. J","useful":0,"cool":0},"DYPdtU_QCI_bWRQTUinbfg":{"text":"The hotel was nearby. We ventured out for most meals and loved it all. We asked a few peop","useful":0,"cool":0},"YuIAd47GMV2riHVjcSyv1Q":{"text":"We came here for breakfast during our New Orleans vacation and it was a really great exper","useful":0,"cool":0},"kGe_5YM1jOBxfLYAFcBFUg":{"text":"My sister came in town to visit and I wanted to make sure she had a great time. But I was ","useful":1,"cool":0},"zjXWnaPR8k_-Itqwy_6-Wg":{"text":"Relaxing little place, set apart from the general madness of the French Quarter. I enjoyed","useful":0,"cool":0},"_8t2PD8IIk3mUpoIXY7y6w":{"text":"After seeing their 'breakfast in a cup' online I just had to stop in.  It's a charming caf","useful":1,"cool":2},"BXowCM0A3-OMjIHFsSoRDA":{"text":"Just as you know you're in a coffee shop in Amsterdam when there's weed for sale, you know","useful":1,"cool":2},"EjzfGoLwi5WS8hBr1KyUjg":{"text":"A wonderful \"neighborhood\" coffeehouse in the Lower Quarter. Great breakfast food and wond","useful":0,"cool":0},"UJFUOn5koRt-vJGalrJ0EQ":{"text":"This place has a good atmosphere and the food is great! but the internet is kind of slow.","useful":0,"cool":0},"Lqk-kcVmY6as-VXV1pBDqQ":{"text":"Needed some caffeine in the tank so I waltzed in looking for something warm. I ordered a l","useful":0,"cool":0},"5lUG-0b7YmYVYf9IL5AcVQ":{"text":"This is a low key get away from Frenchman street.  It is for sure a hidden gem.  My husban","useful":0,"cool":0},"RDsP_Y8FxGoLb8x8uIJt6w":{"text":"For those who know me, they are keenly aware that coffee and spirits play a vital role to ","useful":0,"cool":1},"IR52qgmP4pJyDFsVzOX2yg":{"text":"I've passed by this place a number of times and on a few occasions have come in but for so","useful":4,"cool":2},"eeCBVSJjKNlrLQwfKnJfzg":{"text":"I arrived in desperate need of a cup of strong coffee. That's all I needed and that's what","useful":0,"cool":0},"qBpPXSzECtdhYE7mkWlapw":{"text":"One of the rare places that has both really good lattes and serves full breakfast. The has","useful":0,"cool":0},"BefHGD8BTClxZzdg0xm4Mw":{"text":"Cute spot for a hot drink, snack and a great Bloody Mary! Didn't try any good but everythi","useful":0,"cool":0},"8zLbGuXqEiQW4W2lRV-h-Q":{"text":"Time to update my review. Envie is now my favorite coffee shop in NOLA. The reason is not ","useful":2,"cool":1},"bLe7BuKks6R1ziIisr020A":{"text":"This will be a temporary review as I have not fully explored Cafe Envie. However, I stumbl","useful":1,"cool":1},"J9v2ufop1FKvTCxfXBCAJA":{"text":"Envie's gotten simultaneously better and worse since I started coming here. \n\nWorse: I mis","useful":0,"cool":0},"prM7mz4Y6gEExxmCtFlt_Q":{"text":"I have been going to this place for years. It's mostly about the location. I can deal with","useful":3,"cool":0},"9aeUWTyG-h5Cb-PK0pD_WA":{"text":"I love this place. Their location is prime for Halloween as well as any other festival in ","useful":1,"cool":1},"idMMFyGDw8pypln8-SFhrQ":{"text":"When I moved from Mid-City to the Marigny, I replaced The Bean Gallery with it's trendier,","useful":0,"cool":1},"Ts1oPXWHubaCtshALpyFJQ":{"text":"OMG. I went here for breakfast with my wife and I wish I could put more then 5 stars. This","useful":0,"cool":0},"jWiRX2zzF9_e4aIclzWJOg":{"text":"Love this coffee bistro. Johnathon the cute sassy one behind the bar always makes you feel","useful":0,"cool":1},"VZrdbF6MD4xPjLvEnKJYRw":{"text":"Don't feel like waiting in line at cafe du monde....head to this little gem with great cof","useful":0,"cool":0},"CG1ZJmB8Rxt1i9PQmnV_Qw":{"text":"Awesome service, good hours, fun art for sale, good music, and they can Irish up your coff","useful":0,"cool":0},"R67GLrzSUXn97gd2sJATeA":{"text":"In my opinion, this is some of the best espresso in New Orleans. Had a double shot Marchia","useful":1,"cool":1},"ZoaMpgK00oFG3CMWEzldRA":{"text":"As a coffee house, I'd prefer that they open earlier rather than remain open later, but th","useful":0,"cool":0},"JX8SpmuZutKUAZp9UdHGsQ":{"text":"Amazing service and the breakfast in a cup was incredible. Great iced coffee too. I will d","useful":0,"cool":0},"Wp4LErbRsjaTI0aMtlfIVw":{"text":"Probably one of the best Cafe au Lait's of my life. OMG wow. If you are looking for a grea","useful":0,"cool":1},"BR5vsnnhmid1iXmtxWb6Gw":{"text":"Yey! I love this place! I use to work across the street and I was highly addicted to their","useful":0,"cool":0},"lxa40IcKF69smsAYUZMinw":{"text":"I've been frequenting Cafe' Envie for many years and watched it change hands. I eventually","useful":6,"cool":1},"2PeriR0BSvp6DBy2-urbEw":{"text":"This is a rather nice coffee shop in a busy part of the city. The place gets a little pack","useful":1,"cool":0},"UocnLUKehwrWV5whNtdE3A":{"text":"Great place to sit in the evening and watch the circus and dogs and regulars, including at","useful":6,"cool":3},"_zLnYJTC3yE51wD505XhDg":{"text":"FAUX-LENIANS: and wannabees hold court, ruining Envie's potential charm;\nUNEVEN: Eggs Envi","useful":4,"cool":2},"a4zvHPVAbUl3j6yR9M7ffQ":{"text":"Very nice coffee house. We visited early on a rainy Sunday morning. Excellent coffee, beau","useful":0,"cool":0},"KXntf__CqTCO0FF9MWIBKw":{"text":"Agressivley unhelpful. \nHad to ask for a rag to wipe or of the many tables covered in stic","useful":2,"cool":0},"49ZfTf7pnARsRVzKCt19uQ":{"text":"Tasty little paninis and your friendly typical hipster coffee jet set, what's not to love?","useful":0,"cool":0},"iZKLSU460XHeX0K76HflrA":{"text":"Envie popped my Irish coffee cherry and in true virgin fashion, I was in love with it's ic","useful":3,"cool":1},"yZ8APwR4mwoEI0pZgcFX8w":{"text":"On a windy, bitter coldChristmas day, my friend were looking for refuge from the elements.","useful":0,"cool":0},"AU62FJ8fcB_gL9W-hbV8IA":{"text":"This was the Best coffee bar I visited in New Orleans. The coffee tasted just amazing . I ","useful":3,"cool":2},"5Pm8BImE3kALltKW4XISOA":{"text":"Breakfast and coffee were decent but holy s**t the barista was so vile and rude that it ru","useful":1,"cool":0},"3_mHtgrxEQ5_kAj8dJ-C0g":{"text":"Super friendly staff, delicious food, and great coffee!\n\nOrdered a bagel and lox plate.. D","useful":0,"cool":0},"lAX2BPk4ZyWd9FxhuGmgFA":{"text":"This is a great, convenient spot with wonderful coffee and flavors. I love that they also ","useful":0,"cool":0},"5V91lXXhVI6UlHUg5wSAhg":{"text":"We stopped by the coffee shop at 11:50 PM on Saturday, 2/22/2020. So to be fair, the two-p","useful":1,"cool":1},"8II0Q1UvHIwBMsfXDupGCg":{"text":"Came here one morning after a night on bourbon. Heard about the breakfast in a cup and had","useful":0,"cool":0},"UE8wgH9ebbG2vNLA5rIJ4w":{"text":"This was a perfect dining experience.  Every single staff member was super friendly, and t","useful":0,"cool":0},"ukOoUKZimqoGvH8WJbNRPA":{"text":"The best iced mocha! It was rich and strong. Great coffee house feel!","useful":0,"cool":0},"Akc7rjbYh9Bd0A1qCCH6WQ":{"text":"Can't say much about their coffee since I've never had it, but the cookies are UNREAL. Bes","useful":0,"cool":0},"xyclO0t73NfAHA5ydNoXzA":{"text":"I should have listened to one of the other yelp reviewers - my boyfriend and I got the sam","useful":0,"cool":0},"tzltmZ0Jrp3F7WijNoX2Mg":{"text":"This was a great little coffee house we found near the French Market after shopping one da","useful":1,"cool":0},"XEpCSzYXS_EgvyPdzh2UOg":{"text":"Great atmosphere and drinks! They have some clever creations with alcohol too. Chai fireba","useful":0,"cool":0},"AFIFl-pcl0VKQt4Ehq8cig":{"text":"Ask for Kaitlin. She's the best! The Cold Brew Ice Coffee is my favorite. They also have a","useful":0,"cool":0},"6gl-uFYD3G0iSSvH7FDl-A":{"text":"Best chai latte with soy that I have ever had and I've had many!!! The barista was really ","useful":1,"cool":0},"cMtmmAWBJw7CbN9miWgXFA":{"text":"Great place,food, staff, I bring my grandson Joseph everyday for a chocolate muffin...Staf","useful":0,"cool":2},"uY2_LPfm-ejl3lnkrAEMaw":{"text":"My favorite #1! Just one block away from the historical French market. Everything around i","useful":0,"cool":0},"AgYQskwqEvPRh0bmuyG06A":{"text":"Very rude employees. I ordered my breakfast and as I was checking out their my purse was b","useful":4,"cool":0},"8XtHORoLphX2Vqm7_DO41g":{"text":"What's the point of asking me \"How do you want your burger cooked?\" ???\nI've had 2 burgers","useful":0,"cool":0},"UHtVr6HNYL9OvCmRPS1M6Q":{"text":"Wonderful coffee and atmosphere.  The food was actually very good too! The cheesy grits we","useful":0,"cool":0},"krYcj_yX0UQVi3EBYZN6sA":{"text":"Great spot with delicious coffee options including spiked coffee. Food was delicious.  Thi","useful":0,"cool":0},"brtp72F5cZ0kZYu97EYhDg":{"text":"Nice place to stop in for a quick bite, service is very fast and the Brie and ham panini w","useful":0,"cool":0},"Hx7-t7-5rewBRNVU92A16g":{"text":"Holy cow! The breakfast in a go cup is next level! Helped cure my hangover!","useful":0,"cool":0},"2a9dUzSs8ZzFZJdGTDu0uw":{"text":"Jonathan knows the deal. Just tell him what you want and let him do his thing. FYI The che","useful":0,"cool":0},"LNTErbHd_3qdwe4hxMZ0lA":{"text":"Best coffee shop in the city.  Great staff, excellent espresso, decent music, and breakfas","useful":0,"cool":0},"g3hS6jAMakUPI6mCPuOkFA":{"text":"Great coffee great food and amazing building . That's it folks nothing more to say Yelp is","useful":1,"cool":0},"Ti7XblNHuL5mll53tFIipw":{"text":"Great coffee roasters, with some of the best espresso that I've ever had. The baristas roc","useful":6,"cool":5},"Nojy9hJAv76Vtk1AIZDKiQ":{"text":"Subdued atmosphere, yet eclectic. Envie is located in the French Quarter and despite being","useful":8,"cool":4},"SDSiQ5t7ljl6p3FHpud_rA":{"text":"Love this place. Love the vibe and calming music. The iced coffee is fantastic. Had the fa","useful":0,"cool":0},"zIvYzlM4Si8Uc_2uYc61dQ":{"text":"One of the best local coffee shops with bakery foods.  You can't go wrong with whatever yo","useful":0,"cool":0},"XybeGAXSWwZM--uifNYDaA":{"text":"Nice little cafe, good selection of pastries, brunch, etc, reasonable price, good service,","useful":0,"cool":0},"kMhQ-BRMT9TvCh0rWYH1_Q":{"text":"Wrote a lengthy review but did not get posted, so I will cut to the chase.   Rob and Cathe","useful":0,"cool":0},"hzSWNM8FIw1pOrDr9xiWmw":{"text":"Cute place with friendly service and nice atmosphere. Grits are creamy, the veggie wrap wa","useful":0,"cool":0},"Hs9wPcnxpTfMLx9GyiDyQg":{"text":"After having the french toast breakfast promoted as the \"best\" in NOLA, or beyond, and bei","useful":0,"cool":0},"TNzsd65Z-gsleHCYS287dA":{"text":"I stopped in here during the middle of a parade for  some caffeine and warmth. The Zulu Qu","useful":1,"cool":0},"EXMrgQSf5SxG1Sk9SRMa-w":{"text":"Literally my daily coffee shop. The staff is super personable and lovely. They usually kno","useful":2,"cool":1},"imUSLum-neUr4XpXYTvo3w":{"text":"Velvet Eggs, I went in early every day, 8:30am, plenty of seats, fast service and so graci","useful":0,"cool":0},"nI8-cVWbBXb0QYapLwRd7g":{"text":"Great place, good coffee, the reason for the 1 star is the absolute rudest people!!!  I ha","useful":0,"cool":0},"Mg6hKl59EuVplwyB4aBnnw":{"text":"Very much enjoyed our first breakfast in New Orleans here. Tried the shrimp and grits and ","useful":0,"cool":0},"nvOZLxk1UUk8_79vebs1Vg":{"text":"Great little lower French Quarter coffee shop!  Clean.  Friendly service.  Fair prices.  F","useful":8,"cool":9},"3noRYeWgFPRwmTJ15h-gWg":{"text":"We went to Cafe Envie on our last morning in New Orleans.  We loved the old-fashioned salo","useful":0,"cool":0},"QCBFzUcrfS-IzZWEl7eMeQ":{"text":"Come to Cafe Envie \nFor a coffee or a pastry!\nThey have a small menu\nWith yummy items just","useful":1,"cool":2},"3CVdZBEs_V6necoXNahAcQ":{"text":"Fast, convenient, good with lots of choices for the various tastes in my family. The break","useful":0,"cool":0},"3U5d9X4iQWUR-7Rqyc7W5g":{"text":"This place attracts gutter punks, riffraff, sleeping chowdaheads, and grumpy employees. Th","useful":2,"cool":0},"wkvX29s-NEE9Ib2mTMvBRQ":{"text":"We were looking for coffee and a bartender on Frenchman recommended this place. I had a fi","useful":0,"cool":0},"7D31hMPjsT0jbgG6tz4iTQ":{"text":"Whether I am out during the day shopping in the French Market, or if I'm about to go catch","useful":0,"cool":0},"5J6pTOLD16N9WymUAhnTNg":{"text":"Great little sorta hidden spot with tables to grab a coffee & brekkie.\n\nI had a cafe au la","useful":0,"cool":0},"teGk1zGJr0qfr1aW38KVkw":{"text":"Great coffee, slow Internet, bad muffins. Other than that everything else was great.","useful":3,"cool":0},"pxxxh-CwQOferRsg0GklVQ":{"text":"Really disappointed at the food and coffee here.\nIt is the worst coffee I have ever tasted","useful":0,"cool":0},"Y94zJVtaRXv7o51vmM9RuA":{"text":"One of my favorite places for coffee and a snack. Grab a chair or piece of sidewalk and en","useful":0,"cool":0},"8SZYcdAwYzwJO5TA8zD8yQ":{"text":"Review by a coffee fiend...\n\nTrue, when one is fiending, you might think any ol' bean extr","useful":16,"cool":7},"KyRqDnZY-aRMsgv58DY1fQ":{"text":"Tall, hot coffee with brandy--and coffee liqueur. Hell, yes! And my friend loved her cafe ","useful":0,"cool":0},"Pdot2s74d3Q5ok4ismy_dA":{"text":"This is the only coffee house I've been to in New Orleans since Katrina where I consistent","useful":2,"cool":2},"w-6ud4W_fUWM8rqMPGidLg":{"text":"Great Cafe Mocha\nFree wireless\nGood ambience\nNearby town","useful":0,"cool":0},"_4Tfg-tJiicfHHkNDqv-bg":{"text":"As a local artist in the quarter, it's important to have a reliable coffee shop. The peopl","useful":1,"cool":2},"6sEhjwhg64q3fDQ5xpny-A":{"text":"Loved our cappuccino and danish!  The staff working there both times we went were friendly","useful":0,"cool":0},"OH7rFgOWFQH6PUud4L3_4g":{"text":"Excellent Service, Best Coffee I have ever had and Baristas that know what they are doing.","useful":0,"cool":0},"Tr08UJ4i34c42xS2PNriTw":{"text":"After staying the night in Frenchmen, we needed a pick me up the morning after. Great spot","useful":0,"cool":0},"Dlkptbta0_LG2BIbJ4Msag":{"text":"Definitely stop here for breakfast in the French quarter! We went here one morning after a","useful":43,"cool":44},"P0Ngk4F-llol2DFlGxpXXw":{"text":"I live up the street from this location, and frequent it almost daily. Excellent coffee an","useful":0,"cool":0},"rt7cbBicAn9sYVdhOiKVCw":{"text":"THIS PLACE IS DELICOUS. Hot choc not to cold or hot. MAKE THIS A GO-TO. You will not regre","useful":0,"cool":0},"gOCjs0GIKHWQEzS5V8vvyg":{"text":"This is the place that has the awesome \"Breakfast in a Cup!\"  and basically any coffee you","useful":0,"cool":0},"o8xw6fvqxVWDyGW05mUydg":{"text":"Envie is an artsy coffee shop, where the locals go, \non the end of Decatur Street, at the ","useful":4,"cool":2},"Xp5pTYJ1vBZK2_RW1RqYdw":{"text":"Happy to find a coffee house to set and relax with a cup of coffee to continue my walk thr","useful":1,"cool":0},"LB6fWWbc_eAQqBAKO2CmYg":{"text":"Boudin omlette! Need I say more? Everything here was delightful from the good eats and ama","useful":1,"cool":0},"AvoVBb_2F3LxqrruHoDs-Q":{"text":"Love this place. The best Viennese iced coffee (on tap no less!), meals and snacks (well h","useful":1,"cool":2},"ULAY14Tlql6ZrftHAwkViQ":{"text":"waited 30min for 2 scrambled eggs w/ cheese and almost missed my kayaking tour. && when i ","useful":0,"cool":0},"C063vOVw-Tzp5QivpK1roQ":{"text":"Love this quaint and hip spot! Anytime I'm in the quarters, I forgo my typical Starbucks c","useful":1,"cool":1},"LPDnpdgUUWkCgW-tdtcIwA":{"text":"This place was on the same block as Le Richelieu Hotel where I was staying. The place look","useful":6,"cool":5},"MfoO6J6wSLGokz9VS3-i6g":{"text":"My husband & I walked over here for lunch. They had a hefty line and the cafe (inside & ou","useful":8,"cool":4},"TMGQuf0Hf54t6B4uBEe4Rw":{"text":"Cafe Envie  Not enough stars. \n\nGreat Food, Good Times, Good People.  Cafe Envies courteou","useful":0,"cool":0},"UU-x-OJtP0oZ_FmXAxgdsg":{"text":"This was the only place we stopped at three times during our recent trip to NOLA. Their co","useful":2,"cool":1},"efaEYMJBvOkoFg4aBkDVwQ":{"text":"Wowy wow! They know how to make a killer latte here. I am totally down with this joint. Fo","useful":7,"cool":4},"L_lp3vL7jfQ59azd9160uA":{"text":"The hot chocolate here is amazing. We came here multiple times after walking around in the","useful":1,"cool":1},"3D3aDGiE0LNERHvTU6kjwg":{"text":"Fantastic coffee and charming atmosphere. They have a variety of different coffee blends a","useful":0,"cool":0},"1h6QHgiHw-MrbIA45i-Htw":{"text":"My favorite spot to grab some breakfast. I went there a total of four times during my trip","useful":0,"cool":0},"CinV4zElY8WhHi7R_URjBQ":{"text":"Have I just been consistently coming to this place for 10 years without ever reviewing it?","useful":2,"cool":2},"2nVSfNaf2qgJcGoR7JtbCQ":{"text":"Loved the service! The hummus plate was a chef's kiss! Sooo good!\nYou can be seated next t","useful":0,"cool":0},"ASrgC6LrQWlnUmtVmxRFBw":{"text":"Pretty awesome coffee bar... I mean a fully stocked bar. See my pictures. \n\nPros -\n\nIts ch","useful":0,"cool":0},"fYBruOw7xMtMw-GPgHpnYA":{"text":"After walking by this cute place a few times, I finally had a chance to stop in. The space","useful":2,"cool":0},"7BgR9R3JzwYBNQAWoXaN0Q":{"text":"This was a coffee shop by my hotel in New Orleans. For lack of a better word, it was a cut","useful":2,"cool":0},"qNsEZFKzY9sPH4O4WgJGTg":{"text":"The perfect breakfast place! A nice venue, friendly staff and tasty food make this place p","useful":0,"cool":0},"HLArVDmhIn0d3XrCdg6WgQ":{"text":"Needed a breather with the family. Beer, hot cocoa, cold coke - everyone was happy. They'r","useful":0,"cool":0},"k4vRiFc0Sy9mg5mgZqm-0w":{"text":"Great breakfast and not expensive at all. I liked the farmers omelet and hash browns so mu","useful":0,"cool":0},"XK3aGHjjMCCgpTIp8F2IYw":{"text":"You can finally get a good coffee here for breakfast, not that horrible Community chicory ","useful":0,"cool":0},"k6eQYxbucYsPxb4ehzZTMw":{"text":"I reall liked the laid back scene, locals were kool, bananas foster was perfect","useful":1,"cool":1},"fEOBVWnrDInOCPbW7x6RxQ":{"text":"I love the look of the place and I don't mind their coffee. I'm not a fan of the gutter pu","useful":0,"cool":0},"NyiA8VD0H_TYYv8y15_IXA":{"text":"\"Why do I not live around the corner from Envie?\" These are the words I ask myself every m","useful":3,"cool":5},"Dr1vQMx4hJeIyGUjECHUPQ":{"text":"These are some of the nicest people ever! I came in in sugar-shock and was shaky and order","useful":10,"cool":8},"HPQ_vP5PMk_uw5_r1TUAOg":{"text":"Nice neighborhood atmosphere. Grandson enjoyed his bagel. The shrimp and grits (supposedly","useful":0,"cool":0}}