{"gUtoXa8wC-E52Sn8raBABw":{"text":"Great burger.  Perfectly cooked.   Huge baked potato.   Best drink I had in New Orleans al","useful":0,"cool":0},"VjgBx6O-f1YP6cbexsZfnA":{"text":"I've been eating at the Port of Call since 1969.  It's not a regular place for me but I go","useful":0,"cool":0},"KZB14KK8lPmAQXiQjqEr2g":{"text":"I am a big fan of a good burger, and I had a coworker tell me this was the best burger in ","useful":0,"cool":0},"ai2KCoS3Ib6uZ0ayzZe3lg":{"text":"Do you want to get a good buzz going?  Get a Monsoon at Port of Call!\n\nDo you want to get ","useful":2,"cool":4},"keJcoPpbwafylxoUx2x9tw":{"text":"Port of Call has the best baked potatoes ever !!! It literally melts in your mouth. The bu","useful":1,"cool":1},"v56eThLr2DghewxsRzgeMg":{"text":"After opting to not get in a line that promised at least a one hour wait for dinner, we de","useful":0,"cool":0},"0S1o23dX1JNg6Ho6DhuAvw":{"text":"Seems to me that Port of Call is the kind of restaurant...where you LOVE it and every time","useful":0,"cool":0},"lnVQMuEjJGsoZIbOH-YDNw":{"text":"The food is great but gets quickly defeated by the negative dining experience.. Not sure i","useful":0,"cool":0},"JuSwZJLbXovHjWxUdTVcMg":{"text":"So so so so good. If you're craving meat and potato, this is the place to go. Nothing fanc","useful":2,"cool":1},"hHDKLD-bN0DNphI0f7OkTw":{"text":"Pretty darned good.  The burger was fantastic and the baked potato was really, really good","useful":2,"cool":0},"GgCINfIXEd5VNlFMTvQ2pA":{"text":"BEST. BURGERS. EVER.  Love the fact that the burgers come with a baked potato instead of f","useful":0,"cool":0},"B5GcphLvxwdJq04-V85SdA":{"text":"I love love LOVE this restaurant.I recommend going in the middle of the week to avoid the ","useful":0,"cool":0},"wXy_Woeot8AgmMCPx-GCnw":{"text":"Seems like there is always a wait at this place. We came by just to grab a drink and there","useful":1,"cool":2},"3CNM7BsyU_BgIAHJD-A7pA":{"text":"Their slogan should be \"good food, no bullshit,\" cause they don't seem interested in your ","useful":1,"cool":1},"NUwg9qCxeRcaM1tHohN1CA":{"text":"This is my favorite pre-French Quarter destination. The menu is simple. Steak burger. Bake","useful":3,"cool":1},"1G_diNX7AxUu1B2KxY1RaQ":{"text":"The best burger you will ever have, hands down. Go loaded spud and burger all the way. Sim","useful":0,"cool":0},"_u3zHrylhL73CmCtnOKqgg":{"text":"I was told specifically to come to this restaurant and try the Huma Huma drink.  All I can","useful":1,"cool":0},"-L6DiN3JTNheDasEJyVRAQ":{"text":"Always such a great place to go when I'm in town. I like it b/c it's not touristy like man","useful":1,"cool":0},"JQb1lv2dT-_Bhk_XOJtpOQ":{"text":"Oh man, who doesn't like a burger served with a freaking baked potato? Their burgers are h","useful":1,"cool":0},"all9E6KkxrtMMdwYbwUq-g":{"text":"This restaurant was kitty corner from the hotel my hubby and I stayed at on our last trip ","useful":0,"cool":1},"dw4YbHmAKrqybgJ7dEYxHw":{"text":"Great burgers are a really fun place.  It is very crowded and the wait can be long but the","useful":0,"cool":0},"Ujd5FVurI2y4EQyGZ-D--w":{"text":"I avoided going to Port of Call for a long time, even though I've lived on Esplanade for s","useful":1,"cool":1},"kKeZx_dmndDNDDbkThfqkQ":{"text":"When you think places to eat in New Orleans, almost everyone thinks seafood seafood seafoo","useful":0,"cool":0},"M7YxdnkhcywLfw-DB3wQ2w":{"text":"Listen to what everyone says and just give this place a shot. The burger could use a littl","useful":0,"cool":0},"sf_as8rs1_t2AtUw2oWb0A":{"text":"Despite the fact that the majority of reviews are from tourists (including myself), I woul","useful":0,"cool":0},"jZercXsMX3jSrOmi426VXg":{"text":"This is a really fun little, crowded place tucked away a block off bourbon street.  Not mu","useful":0,"cool":0},"nNoi0n6nqRmDEUBYlf07AA":{"text":"We walked in on a Friday around noon and got right in. This menu is VERY limited - burger,","useful":0,"cool":0},"J7xWjo-LeBR3EX0OZOwkmw":{"text":"The burgers are alright, but the baked potato is amazing. Get it with bacon bits, chives, ","useful":0,"cool":0},"bDp1QsyulrY4x3nl54Yq5g":{"text":"Port of Call is a funny restaurant because I don't think it ever meant to be cool - they j","useful":0,"cool":0},"Fp9ettiAiLpN6VDGDZuAsQ":{"text":"This place is a staple for when you come to NOLA.  More than likely, you will wait and pro","useful":0,"cool":0},"IqLkhnB5NrdnRcAbNaESVQ":{"text":"This place is perhaps the most well known burger place in New Orleans, I am not sure why i","useful":1,"cool":1},"BIDHGhsEUYo5mGd9xK2ooA":{"text":"Great burgers and baked potato if you don't mind the wait. Last time we were there a creep","useful":0,"cool":0},"Xh4i4ypC2_YEBj9IIliZdg":{"text":"Port of Call is a great local dive & a welcome respite from the rest of the tourist throng","useful":0,"cool":0},"jpH5wopJZEm9B9-lAC88nA":{"text":"This place is awesome. Monsoon is super strong. Burger is super good. Baked potato is amaz","useful":0,"cool":0},"aTU4uEcEkpUcKb7FlckrnA":{"text":"For everyone that says Port of Call has the best burgers in town, you need to get out more","useful":1,"cool":0},"xqS7cIWMu_FBDMcLThL6sQ":{"text":"So, we'd been eating a lot of cajun and a lot of French Creole in New Orleans.  All okay, ","useful":2,"cool":1},"DZeezP8zQRSCU9fKKzWNgg":{"text":"Great hamburger! Great cocktails! There was a line outside but we could easily find a plac","useful":1,"cool":1},"eEABoqQw46BnNxvirIpkgQ":{"text":"When my husband and I first moved to New Orleans, we were coming here about once a week.\n\n","useful":0,"cool":0},"gq7c3nZSGfGyaVDvJ0OIig":{"text":"It was the end of a long day of French Quarter Festing when we decided that the sun and th","useful":10,"cool":6},"8aN8FXP4NRhFhYBs_1vgFw":{"text":"The food here is great! I wanted a steak for my birthday and they did not disappoint. The ","useful":0,"cool":0},"eTd-R-LSBhRB7VGhXBA9RQ":{"text":"Love this dive! One of the best burgers I've ever had. Have been coming here for years and","useful":0,"cool":0},"rg2vlzc3d4WET6m2v1TbDg":{"text":"The best burger of my life. Everytime I return and everytime they are fantastic. Served wi","useful":0,"cool":0},"8Ez-q-3QZWFiBCXxsB7h9A":{"text":"This is a very good burger place. Not small but also not too big. The burger is charred ju","useful":0,"cool":0},"SEI5lwAaGT6iHsdEO_hxvg":{"text":"One of the best burgers around. There's nothing fancy, just an abundance good quality ingr","useful":1,"cool":3},"9BTvLIrZkVZI4tCbNeVoug":{"text":"If you are in New Orleans you have to stop by here and have the Huma Huma drink. The night","useful":2,"cool":2},"-uBLSjDjH4MZSNoayYuYNA":{"text":"This place has a very simple menu--steaks & burgers served with baked potatoes (no fries).","useful":0,"cool":0},"4wu4yKMQZrP7EyT6mQ0JRw":{"text":"I have searched far and wide for the best burger... THIS IS IT!   The flavor of the meat i","useful":0,"cool":0},"egxYy-dzxvmZByONz1KXTQ":{"text":"This place is a joint but it serves the best damn burger I ever had and throw in the naked","useful":1,"cool":0},"0AXn1efXMAtnlX8dMGkGnA":{"text":"First time to NOLA.  Atmosphere was ok.  LOTS of honey booboo looking people and tons of d","useful":4,"cool":1},"7j91j2KOniHo570cpqkG_A":{"text":"Monsoon + burger + baked potato = drunk food coma.\nThe Monsoon is so alcohol filled...that","useful":3,"cool":1},"EDXDUqEUGOXHuM9yUaPV_Q":{"text":"Port Of Call has, very likely, THE BEST burger I've ever had... and I search for \"the best","useful":0,"cool":0},"UdXhhIDElIYFRjmxcTrn9Q":{"text":"This place is like Sam The Butcher. It brings Alice the meat!! \n\nAlthough all I had was a ","useful":0,"cool":0},"JdUTA0_UAWDZmacTJ_55xw":{"text":"All I can say is OFF THE CHARTS! One of my best friends told me i had to try it and I am s","useful":0,"cool":0},"nxyqTerpQSCUjFE66aN8Lg":{"text":"As a vegetarian, I was skeptical when my friend insisted we go here on the merits of the b","useful":1,"cool":0},"asskIm4OMGrt_CnObh2LHQ":{"text":"The restaurant just opened up on a Saturday morning and we were able to walk right in.  Th","useful":0,"cool":0},"mJx4UaDAlZ9IZTfg-6p0sQ":{"text":"I give this place 5 Stars in the category of burger joints.  I loved this place.  For $11.","useful":0,"cool":0},"CiWaFY4aBdQjSN9WTqMKAw":{"text":"Port of Call is located on beautiful Esplanade Avenue near the French Quarter. The restaur","useful":5,"cool":2},"dPLcfmYpvunIVhqw0jkefg":{"text":"My wife and I had so much fun at this amazing little bar. great food, great drink (dangero","useful":0,"cool":2},"MRkSwDGy-IsK4ZeZ42d4ZQ":{"text":"The food was not good and they charged $2.50 just to add sour cream and cheese and the bak","useful":0,"cool":0},"vV0DqNqsxvzVSOZ7e3hZBw":{"text":"I've been waiting MONTHS to get back to port of call. This is my second time there. The ow","useful":0,"cool":0},"jkvXtPDNhJvE1KgiCFVcCA":{"text":"I came here with some friends after my brother-in-law said this was a great place to check","useful":2,"cool":0},"ZX8WF42-4SzpIUY-QjgHzA":{"text":"I have been here a couple of times trying to give them the benefit of the doubt. I would h","useful":0,"cool":0},"0Gus5_ftdas9Su6BRqFysQ":{"text":"Seriously you can not go wrong with this place. It is one of my local favorites and many o","useful":0,"cool":0},"i_ezAkG0Dzh2gH__rUP_RA":{"text":"Great burgers, great atmosphere.  We love going here everytime we are in town.  Usually ha","useful":0,"cool":0},"Gq3t77SEB9r2W6R09gwi7A":{"text":"Massive portions of food! I ordered the Mushroom-Cheeseburger with a baked potato and all ","useful":0,"cool":0},"93Aikqqjpc6Fcx84rCL4Ow":{"text":"Best burger in the world hands down. A lot of people complain about a burger that is so si","useful":0,"cool":0},"tvkcAg7_Qt-qInET7enbLA":{"text":"This place is me and my people go to spot. The drinks are strong and good and the food is ","useful":0,"cool":0},"L4vu7MyDnXKjBIhoKrm5LQ":{"text":"I couldn't think of a better venue!  My wife and I were here in January 2015 and had a del","useful":0,"cool":0},"RR_38y5yRJNqRD-5vVxNpw":{"text":"The food is always good. Best burgers in town they say.  I would agree but, why get a burg","useful":0,"cool":0},"DX8x9jkHwpXU7W5NQwWH6A":{"text":"Hands down the best burger I've ever eaten! It made the wait in line, the flies, the cramp","useful":0,"cool":0},"CfghkomUuFj2zy8ypVZTxw":{"text":"If you love the idea of dunking a freezed potato in sugar water mixed with rubbing alcohol","useful":4,"cool":0},"kU6JdX_GENGyeVV3bdIX7g":{"text":"My review is for the restaurant only, I didn't have much experience with the bar area. \nI ","useful":0,"cool":0},"oXtMSVwDWsrOvGCHiblFmA":{"text":"Great burger and potato.  Very simple and to the point.  Cool little spot that is definite","useful":0,"cool":0},"jyTfh21QNb73NpSCMI5dxg":{"text":"Got there at noon on a Sunday and the line was out the door. Waited about 45 minutes and i","useful":0,"cool":0},"M02ENVf4ioz-crg39XGrpQ":{"text":"Good food for the value. Service was a bit slow which surprised us because we got there be","useful":0,"cool":0},"6blsuzKjrocFdX66k1cTIw":{"text":"This is the best burger place in New Orleans, and one of the best places to get a steak.  ","useful":1,"cool":0},"yGxUkLUmVJugzO8ScM0wEg":{"text":"Amazing burgers and drinks. Real old school NOLA. Do not pass up this experience \n\nReal ti","useful":0,"cool":0},"XqKOmVGcXtVz0wztpttfvw":{"text":"Best cheeseburger I've ever had. 5 stars.\n\nCooked medium rare and to perfection. Loaded wi","useful":0,"cool":0},"ApfxZJx9dOxo61RUnM2OMA":{"text":"Not impressed. Burger was dry and not flavorful. Baked potatoes had imitation bacon bits a","useful":0,"cool":0},"GJp282VvFPjUY0amOyNNgA":{"text":"Super tasty burger, nice baked potato, good drinks.  The vibe is pleasantly divey, service","useful":0,"cool":0},"r2DIm2yiBznOkGToWyYZtw":{"text":"The cheeseburger and baked potato were really tasty but service was absolute crap. My frie","useful":5,"cool":0},"eI3_glFpCZoj0OhmI3UE-g":{"text":"If you want the best burger you will ever taste in your life, make the trek to Port of Cal","useful":0,"cool":0},"XE9gdtIX-0QCgIMRurTtNg":{"text":"Omg!!!!!! This is one place any one should visit. The food is to die for and the baked pot","useful":0,"cool":0},"n0avsQ6xOex6ayqGLqNkSA":{"text":"I was there some time ago for one of their admittedly fabulous burgers. The place was dark","useful":2,"cool":0},"lIPIXlLcR3ln__GcWGjVbw":{"text":"Best burger ever. Monsoon tastes better than hurricane!!!","useful":0,"cool":0},"pZFMG5iE1xW8eIkzQbd2EQ":{"text":"The burger and baked potato was ok... Nothing special and I've had better...","useful":1,"cool":0},"GkQhNasiuNBG2cjSYVYQSg":{"text":"I was surprised to see how desolate this place was when we arrived on a Wednesday evening ","useful":8,"cool":8},"83ekZbvIBDTA_vFpPfKfuQ":{"text":"I placed a to go order and Pat, my server kept giving me a hard time and I kept throwing i","useful":0,"cool":0},"LcyOrH7bUvRRbzfxFM0kEw":{"text":"I'm a huge fan of burgers. Whether it be Huey's in Memphis, or Blanc in Kansas City, every","useful":3,"cool":1},"-Iee-W0Lse6yXPBfO9G-Lw":{"text":"This place is as good as Bartley's Burger Cottage in Harvard Square. The Monsoon is a must","useful":0,"cool":0},"DKb1T12CuAgTUAWM8Bbz7w":{"text":"The burgers and baked potatoes here are fantastic and everybody knows it. There is no shor","useful":1,"cool":1},"BUdHOq5EVPlaBwy8DFaXoA":{"text":"Love this place. it's kinda a dive but the people, food and drinks make it all worth it. T","useful":0,"cool":0},"e1QAwr1Mw2OUZFaTu_dYag":{"text":"So funny, we went all the way to N'Awlins and my husband said this was probably his best m","useful":1,"cool":1},"ETbTxs7-CDtGxR6V6BzBbg":{"text":"Really good burger!!! And the roasted potatoes are delicious. Super nice environment. Howe","useful":0,"cool":0},"vIh7BwKxjI76rJ8bj3ehMQ":{"text":"Burgers were good. Pizza was pretty mediocre (possibly something frozen and reheated). But","useful":0,"cool":1},"YfAIh1g0mIjiGEGCWWCngw":{"text":"A friend raved about the burgers here but being from Texas, which I think is burger capita","useful":0,"cool":0},"x72zrPNWHkiscVueSbAhww":{"text":"The best place we ate in New Orleans. Couldn't decide what was better the baked potato or ","useful":0,"cool":0},"SU1uFt7OeIRhYMrh5v1soA":{"text":"A trip to New Orleans without hitting Port of Call is like a trip to Amsterdam without hit","useful":0,"cool":0},"eJXHYTbdxwV0b4ZozJ22Rw":{"text":"Totally mediocre food. Dark restaurant. Not sure what all the hype is about. Check your di","useful":1,"cool":0},"Z1gDDiVrh6O3XZBt7DZvNQ":{"text":"So I ate here on a recent visit and it did not involve 109 beers, 10 monsoons, etc etc. \n\n","useful":1,"cool":0},"1XUVCFUPOUGzNkpF3aNqoA":{"text":"Serves the best hamburgers in Southeast Louisiana and probably the entire country. Typical","useful":0,"cool":0},"OlnAKMKAi_yfarJoHtVyaQ":{"text":"They didn't take our card here because they don't accept Discover, BUT they didn't flinch ","useful":0,"cool":0},"kdotHixQNMnJP9jbOobo_Q":{"text":"Cheeseburger was really good. Not a huge fan of baked potato, but they had no other option","useful":1,"cool":0},"f60a4HTVmIBOMZYnF6vqCg":{"text":"If u like eating hockey pucks on a bun then you are in luck! The burgers are always too th","useful":1,"cool":0},"NX5SPMDs8ZscOq3CR7k5xA":{"text":"This is my favorite place to eat in New Orleans. This is always the first stop when i visi","useful":1,"cool":1},"m_H_LDS9hsa4Jo-vJsJAbg":{"text":"Definitely off the beaten path, and a local favorite.  Great burgers but make sure you get","useful":0,"cool":0},"p8sO4qZMeB-RlWHX4Vi05w":{"text":"Had pretty high expectations from recommendations/other Yelp reviews.\n\nThe waitress was ve","useful":0,"cool":0},"pFmfDmGSni9gXtjlxtkUDQ":{"text":"Yes - make it happen!  This place makes a great burger! Big, thick and juicy with plenty o","useful":0,"cool":0},"kSDzbFCpR4F6bYgDzz_xhA":{"text":"Fun place to go while in NOLA.  Gotta get the monsoon, burger and baked potato. Warning th","useful":0,"cool":0},"quGU3h7uBVPJqBdywx2ANg":{"text":"Such great burgers and the baked potato was on point! All the Hawaiian words used for the ","useful":0,"cool":0},"Q-kgy98_RxbQZ1BOGk0zog":{"text":"One of the Best Hamburgers in the World!!  A little wait and cramped, but worth every minu","useful":0,"cool":0},"XF1uTez-bB36-SdsR5c4DQ":{"text":"Definately my favorite place to start a night on the town.  Fill up on delicious burgers a","useful":0,"cool":0},"hAWRbjzixtDtD-6hPVmMAg":{"text":"My experience here was ok. I felt the burger lacked flavor. \"Bacon\" for the baked potato w","useful":0,"cool":0},"U9lyw_-cwf9X9cHCDG3XTw":{"text":"I DO NOT understand how this place is considered or even claims to have \"the best burgers\"","useful":1,"cool":0},"zP7dRzdQhbmdAGIdjF_i4Q":{"text":"I can't even give this place any rating because I wasn't \"allowed\" to eat there.  Walked i","useful":3,"cool":0},"7G6KiST9VRIJp9W0FI3xhA":{"text":"Best burgers an potato to be found. Great to go to a place and quality is the same for 30 ","useful":0,"cool":0},"T5FPEhkjsuG3h-rwxWCEcg":{"text":"Came here on a Saturday night around 9pm and told that it would be an hour wait, which tur","useful":0,"cool":0},"KvLBkr7IvFfIv7f-EJmQLg":{"text":"While in NOLA, came out to this place as it was highly recommended by locals. I had to try","useful":0,"cool":1},"i8Gn1ejP8un2eUCZli95eQ":{"text":"I came in, grabbed my Monsoon drink and headed out to Bourbon Street & The French Quarter ","useful":1,"cool":0},"bRMcrybZzpnmTdvH_d_swg":{"text":"The reputation of this place is very good.  But let me share my experience there, on Sunda","useful":0,"cool":0},"-o_YCs21Wh2lr1rJekxiYg":{"text":"If you want a great burger in New Orleans, you must visit Port of Call. I was taken there ","useful":1,"cool":0},"mnXFO-XQTa8ONe4vgJusrw":{"text":"Simple short menu of food...basically get the burger with a loaded potato.  Some nice spec","useful":2,"cool":1},"qsXmYU9Uc4h13sLUlWXzFA":{"text":"\"Drink your dinner\" is the rule that should be observed here. The drinks are all fruity, y","useful":0,"cool":0},"Qx84ZOMr7nCiX8HPSqF9dQ":{"text":"Excellent burgers served with a yummy baked potato. Their menus is limited to burgers & st","useful":0,"cool":0},"1I2f2tpE_clDXIKJEnZjFA":{"text":"Came here during Halloween weekend. The wait was supposed to be an hour but only took 30 m","useful":0,"cool":0},"gcpg-ozRlhXobIEKRZDV_Q":{"text":"Ok, I'll admit it....I'm a lightweight. I should have known better than to order a Monsoon","useful":1,"cool":0},"I4J3ZAr0lkPwDMD_lltIJA":{"text":"Still hands down the best burger I've had at a restaurant. The fact that it comes with a b","useful":0,"cool":0},"kldaVgNJSoubhuCSQ_Q7IQ":{"text":"If you're on Yelp, then you probably like reading reviews. And if you're looking at review","useful":3,"cool":3},"yESbj_xruXU8YTmgU7F1tg":{"text":"Oh yes! Port of Call. We were taken there last night by relatives, longtime French Quarter","useful":0,"cool":0},"tsWY2c2x1evQTP685x-drg":{"text":"Sit at the bar. Order a cheeseburger, loaded baked potatoe, and a Monsoon. Thank me later.","useful":0,"cool":0},"gCCKuYoqvlhtxvhPCm53Og":{"text":"The place is a small hole in the wall. I'm glad I called in for pick up cuz it was packed.","useful":0,"cool":0},"PvIxk5eQl0y8U6STfjAilA":{"text":"Loved this place! My boss, who had been to Nola 10 years ago, recommended I come here. I f","useful":1,"cool":0},"Umn5-_GqRFNjtPSxwD-Fsg":{"text":"Fantastic burgers.  Probably my favorite in the city.  Unfortunately the place is so popul","useful":0,"cool":0},"MZmSDBW0k6D58KkDhJhIHQ":{"text":"I've been going to this place for years and it's one of those things, sometime you forget ","useful":0,"cool":0},"le7GJ4OqAQz8ms442C1ctQ":{"text":"This place lived up to its reputation! The food is delicious and simple. They know how to ","useful":0,"cool":0},"FS3co25s9u7b8kfHm835Jw":{"text":"So this is where you go when you need a break from all the creole, spicy food. Not a good ","useful":0,"cool":0},"KQUzF66-Ovl5vmw7ichoXQ":{"text":"After an entire morning/afternoon of drinking, we headed over to this lovely spot. Away fr","useful":1,"cool":1},"zt2OH7C7pJa0b-VVyta3pA":{"text":"Oh.  My.  Goodness.\n\nSo as I'm crossing the finish line of the New Orleans Half Marathon o","useful":2,"cool":1},"gHOHgQNPF__FMuAilNj2yw":{"text":"Probably worst pizza I've ever had at a restaurant in a major city. The toppings looked an","useful":1,"cool":0},"9FDlEOrKy5n9N0S-J0P21A":{"text":"If you're planning on grabbing a drink or a bite here, be prepared to wait. This local spo","useful":1,"cool":1},"f66vlU_gAXbLKjzwD0chhg":{"text":"Fantastic atmosphere great burgers and steaks however the Menu lacks alot of food options,","useful":0,"cool":0},"SFmKySE2fuNxWgocf-eqgg":{"text":"YUM! Always a wait but for good reason. Just grab a seat at the bar! I love a big, thick, ","useful":1,"cool":1},"8iLrNnXUdDPPJqTy8ilbTQ":{"text":"The food was decent.  The burger was tasty and cooked well.  The waitress was very nice in","useful":0,"cool":0},"bjSKvfeXFJa9kL2I-xaumg":{"text":"One of the best ways to start or complete a true NOLA experience, this place is a must in ","useful":0,"cool":0},"PdnzyKCR50LkuXz8baxLLA":{"text":"Nuestra anfitriona de Airbnb nos recomendó este lugar, en Esplananade muy cerca de nuestro","useful":0,"cool":0},"0-W1lkvsRMT01C-y8t0evw":{"text":"After a ghost tour and several beverages along the way, my friend and I wanted to simple, ","useful":0,"cool":0},"R7OI4ltA09bmvQT-zG32MA":{"text":"The place is dark and filled with 50-60 year old folks trying to relive their youth. The h","useful":0,"cool":0},"AmzTwILR2lCiiQla3XNiPQ":{"text":"I love to read the quirky comments from folks who call the food unseasoned or nothing spec","useful":1,"cool":3},"n5Vy_5c3FAm4c2Rzphs5RQ":{"text":"Port of Call has the reputation of best burger's in the country.  Unlike that floozy Cindi","useful":1,"cool":2},"-SVOQ7x3Jq0-YCIsEFaFNw":{"text":"The best hamburgers you will EVER have... period.  Excellent baked potato, super mushrooms","useful":0,"cool":0},"pwMx_YsVbSj_m50LTHUtKg":{"text":"4.5 stars if you are looking for an amazing burger and a great selection of drinks that wi","useful":0,"cool":0},"ic4r8WA_NkL0kf6bGhqfQA":{"text":"Love this place!  Decor and set up is rustic and old school.  Mudslide drink is strong but","useful":0,"cool":0},"FlYA6FAjI2oO315SXObIdw":{"text":"Best burger. Hole in the wall joint, phenomenal hurricanes that will get you wrecked!","useful":0,"cool":0},"dZXA6QcWF-Wa3xqZsS1bqw":{"text":"Although the Bloody Mary held up to it's greatness, nothing else did.  They gave me half a","useful":1,"cool":0},"jfEfn2YUQUDLJAqdyKHiag":{"text":"This place is a must whenever I stop over in NOLA for a few nights. The monsoon is just th","useful":0,"cool":0},"tPk60QIACKClzQIafrXm8g":{"text":"This is the best place to have an awesome burger in the city. Great vibe, small and intima","useful":0,"cool":0},"9EjVSLDIPDTVrWCm5h-ZMg":{"text":"This place is legendary. Fantastic hamburger. Great atmosphere. Be ready to wait however.","useful":0,"cool":0},"vx1ye31KZPZ03_nBXksPCg":{"text":"Freaaaaaakkkiiinnnnn good. Great service and when they make a mistake such as little fruit","useful":0,"cool":0},"taHY4_9oM3eWPiQJLFsqrA":{"text":"A very decent burger and right near Frenchmen so is a good jumping off point.  Can get ver","useful":0,"cool":0},"mBj7yHp5s73_XYn2cqScjA":{"text":"I love this place. The steaks and burgers are over the top! Great drinks. Friendly staff. ","useful":0,"cool":0},"2LL8mBCoNs7YXcShKSkPkA":{"text":"Went here with the WIF last weekend on our overnight to NOLA...... drinks are good...... b","useful":0,"cool":0},"gmN_zY4F4M7FIZsRUGfSXA":{"text":"For many years Port of Call was a \"must\" for dinner on every visit to NOLA.  I would beg p","useful":2,"cool":2},"8cGpPvlhTK57h3mEf-K1tQ":{"text":"Great burgers & awesome baked potato. The only downside.....the wait. There are only 12 ta","useful":0,"cool":0},"I_flYzGBJ4-HvxjTHhiG7A":{"text":"We asked a bartender at Razoo bar for suggestions for a good meal and were sent here.  Aft","useful":0,"cool":0},"eKTJR3PQJgCevZgU86on6Q":{"text":"It was raining cats an dogs so we yelped something close to where we are staying.\nFound th","useful":0,"cool":0},"aMLsNP3DWR5nVLHDQyKT4g":{"text":"Awesome burgers. Best in the Marigny. Cooked to perfection, thick, and served with a baked","useful":0,"cool":0},"f-YEqka4HpAOpPH7TvWPow":{"text":"I have visited this place a half of dozen times. After the first visit, I usually just go ","useful":0,"cool":0},"SBaMj1Gq2SLmZuw7-5mFzA":{"text":"Let me preface this by saying this used to be one of my favorite burgers, years ago.  Well","useful":9,"cool":3},"AZPSPzMag9pqFTRNTau5Hg":{"text":"I freely admit I'm no hamburger foodie authority, but I've seen my fair share of great pla","useful":1,"cool":1},"HZjBUQ-X-RdJ9ElFKs8cBA":{"text":"I looooooove a good burger, and Port'O'Call is one of my favorite burgers from anywhere I ","useful":0,"cool":0},"kSqlkD0_9RfvPFeYB9JHYg":{"text":"The drinks are very good, the hamburgers, why would you eat here when you could go to Yo M","useful":4,"cool":2},"ZpjkESJLH7WRPqHIz5jL5w":{"text":"I came here yesterday remembering how amazing my last visit was. After eating here and won","useful":4,"cool":0},"FieZoBA1zJl9eM6r36lk7Q":{"text":"Best burger I've ever had. I wasn't sure it was worth the hype, but this is a friendly pla","useful":0,"cool":0},"criA5ngbByF7rrQIpP6Q_Q":{"text":"A little hole in the wall with an amazing burger. Took a hunted tour and was hungry at 10 ","useful":0,"cool":1},"8xamcyL2ISCA1E2XlDZHAQ":{"text":"I know there's better burger places...\n\nI know there's better drink places...\n\nI know it's","useful":1,"cool":0},"ixvLs0HMLzoTOZuUAioqpw":{"text":"A perfect burger. Not fancy, not obscenely huge, just perfect. Tastes like a burger, not a","useful":0,"cool":0},"27h0zTiZs-0ej2dDFXGocg":{"text":"melt in your mouth yumminess.  where the locals go for a hurricane and burger.","useful":0,"cool":0},"XI13Cgow-f9-JVxsq8R8jg":{"text":"The menu is not big burger or steak with make potato. But you will be blown away! This is ","useful":1,"cool":1},"5VQRYKtkhCQ9uQRglGsB-Q":{"text":"Hands down best burger in town! I also love the baked potato fully loaded! Must have a mon","useful":1,"cool":1},"93yvgawYmXIbuSU73KGn2g":{"text":"Do yourself a favor and leave the craziness of the Quarter and eat here.  Its a great plac","useful":1,"cool":0},"4CmAcKhOHm4mY6N0zL3SIw":{"text":"This place is a hole in the wall and not to be missed.  Awesome burgers - simple menu (onl","useful":0,"cool":0},"0e-magwbnRQTLFvdB6MQ5w":{"text":"Oh Monsoon, Gombay Punch and delicious burger with baked potato, how you have been the sta","useful":0,"cool":0},"6jBGuFkQP60iaB4wAq4Alg":{"text":"The BEST burger I've had in New Orleans! And not to mention the side baked potato was defi","useful":1,"cool":1},"DwZ0vMhuSStg-Uu_yqLBoQ":{"text":"I'm not going to lie, I don't have a ton of eating-experience in New Orleans, but this mus","useful":0,"cool":0},"8-bFInCYLRMuMbgp2awXAg":{"text":"Touted as the best burger in NOLA, we had to try this place out. It's located a couple blo","useful":0,"cool":0},"BX8MMs6ZYRqZLwO37CVR7A":{"text":"The burger was good, but the wait was ridiculous. Place is small, there's no waiting area ","useful":2,"cool":1},"_HNMcGCHcwpPK5_u0dFSYw":{"text":"I used to go to this place allllllllll the time.  Lately it has been pretty hit or miss. T","useful":3,"cool":1},"56ondTe1Kq1z-ZWTGiWMLQ":{"text":"I will sum up your experience in on word, are you ready? Here it goes: \"meh.\" Friendly sta","useful":0,"cool":0},"fgO4--g6vhKlS4MRz5Z5pw":{"text":"Good solid NOLA kind of place. Lots of food. A bit pricey. 2 cheeseburgers 2 iced teas $40","useful":0,"cool":0},"zNbV4hMyWkiyldOHxmkjZg":{"text":"The burger was delicious but it was gone in two bites. It seriously needs to be at least d","useful":0,"cool":0},"x3n2yk1GRNsH3aQKKKAeMw":{"text":"We go and eat burgers here everytime we visit New Orleans. Why are they sooo good? Awesome","useful":1,"cool":1},"KKntCty7H8d1UpoVIsPqRQ":{"text":"Best. Burger. Ever.\n\nWell, it was the best burger ever the first night. Great burger the s","useful":0,"cool":0},"FO7zQTm1fgt9V629tvx3Cg":{"text":"On our last visit, which was a Saturday night, my four companions and I pleasantly spent o","useful":2,"cool":2},"GwvuyTIcPawkiibZvpM2og":{"text":"this place definitely has character. dark and crowded, with wonderful decor and wonderful ","useful":1,"cool":0},"dQ8ozPkdggJJL6Uzj5KP1A":{"text":"The burgers were bland and boring but the drinks were stiff as hell. That's the reason to ","useful":0,"cool":0},"cGkPbYFguGbFTfwDY6NKtA":{"text":"Great experience. We were suggested to go and try the burgers in this bar and a huge line ","useful":0,"cool":0},"Eg36h2BO2IdcOILeQDYFrQ":{"text":"Tried Port of Call a few weeks ago for the first time and I'd been fed a lot of hype befor","useful":0,"cool":0},"rWR8uWs6ptyjNphFOiVj5w":{"text":"My husband and I had two 'Monsoons\" each and we ended up taking a taxi home and it was onl","useful":2,"cool":1},"pP_vpg2YCjd-0izlOjmFNQ":{"text":"Only had to wait 15 min for a table! I guess I came a the right time. This was my second t","useful":0,"cool":0},"WPhg64l4PbKXPK2D--Gk_w":{"text":"I couldn't justify giving this five stars due to the fact that I have been here twenty tim","useful":0,"cool":0},"NUcQHU5xV5_rBzEmhTlV_Q":{"text":"This place needs to be a stop on your way into the Quarter for your first cocktail of the ","useful":0,"cool":0},"P2ibBNTBPXd26MILwmLDfw":{"text":"Dark and crowded, this place might be a bit offsetting to people. But the food is very goo","useful":2,"cool":1},"Fhpk90VIFe3zqE8WaSuSsw":{"text":"As we walked in the door of Port Of Call the smell of dirty feet , mold, desperation and s","useful":2,"cool":0},"uaPvZBR58Ecv96xkgYtUFA":{"text":"A must go place!!  Lines are long but food and drinks are worth it.  Just try to go off pe","useful":1,"cool":1},"OkienNVjlvLfAF4_jg36Wg":{"text":"Excellent burgers, cooked perfectly to order. Potatoes were large and tasty. Great locatio","useful":0,"cool":0},"VbvO2NU4KMpVlpBp3IVYdA":{"text":"Maybe if I had ordered one of the huge, sweet, boozy drinks almost everyone else in the re","useful":1,"cool":0},"sxPjL6jHaoGjNsHZA6LopA":{"text":"This place is,  a little secret haven...\nGreat food excellent service and real nice atmosp","useful":0,"cool":0},"3bqgXjc0UFoMH9oY63u-eg":{"text":"Excellent burgers served with a yummy baked potato. Their menus is limited to burgers & st","useful":0,"cool":0},"10_IM6yURgMMKuYjDOcJNA":{"text":"Great burgers, food, and drinks all around. Friendly servers. Had to knock off 2 stars for","useful":0,"cool":0},"fCrhsJwEjYwYNsddOrolyw":{"text":"I've been coming to this place for years and it's still rock solid. You want a great burge","useful":0,"cool":0},"guGHaa4iY0PuXlViKkIFiA":{"text":"Great hamburger and baked potato.   Beer is cold.  Great place after a night on Burbon...","useful":0,"cool":0},"mh8HkoKQX22t8whSnyRKMw":{"text":"After you make your way through the wayward seas of the French Quarter, take yourself to P","useful":0,"cool":0},"g3c7XdpMNEHtFhGo_oWguw":{"text":"We have been trying to eat here for 2 days, both nights the line has been out the door and","useful":0,"cool":0},"-ZXxdbxQh_SER0xwJIRr4A":{"text":"You know you have found a sweet spot when they only specialize in steak, burgers, and bake","useful":0,"cool":0},"App9aZfGcUQ_JcZS5gfxUA":{"text":"BAKED POTATOES!!!!!!\n\nI love love love love potatoes. Fried, mashed, baked, hashed, you na","useful":0,"cool":0},"jPL9g9eI9idPRkMyBtQOeA":{"text":"I had a cheeseburger and potato with sour and cheese, and I was happy with both. The place","useful":0,"cool":0},"7a9b-OJVBRVrgV0CQd1k_g":{"text":"Not many options. It's pretty much burgers, beef or mushroom, baked potatoes, and salad. N","useful":0,"cool":0},"Zl99tdnyjalP3IMNnIxP3w":{"text":"I only made it here once when a friend who lived in NOLA for two years brought me. He can'","useful":0,"cool":0},"eFI8pkKMd8dn33uod8QIAg":{"text":"I'm now on the look out for a burger that can beat this one, I think it's gonna be tough! ","useful":0,"cool":0},"707zCP4f8_JPJ6TxmdpMuw":{"text":"The food was good, but I've had better. Definitely over-priced due to it's history and pop","useful":0,"cool":0},"yWXGBDGWo_bDXmR2A0y9YA":{"text":"Trying to wrap my brain around what I just ate. Best burger ever to grace my presence and ","useful":0,"cool":0},"xbNSEyGSee3JIn24OWsoOA":{"text":"A classic, beloved New Orleans bar with some of the best burgers in the whole damn city. W","useful":0,"cool":0},"YqVJjF2IUNrTjJQaZQSCTQ":{"text":"I don't understand why everyone loves this place so much. The burger was OK. Nothing speci","useful":0,"cool":0},"ObWfl8xgXsDvxGTlR1as6w":{"text":"We went with a party of 15 last weekend. The restaurant is really small and we waited abou","useful":0,"cool":0},"VpSi6h5S-QjtVy1NbJYpfw":{"text":"Best burgers in town!!!\n\nFirst of all, without us asking, they asked how we'd like our pat","useful":0,"cool":1},"7t351p4IvAvuOlDsDPiIxQ":{"text":"Many will tell you this is the best burger in the city, other will tell you it is extremel","useful":1,"cool":0},"G-BnLTnZI8lrWHa7HpG_UA":{"text":"Burger was decent and the potato was fantastic. Too bad it's all ruined by the horrible wa","useful":0,"cool":0},"0naWpVdL1MtPk0aZemXZtg":{"text":"The wait can be a bit long, but the burgers are definitely worth it. Skip the menu and go ","useful":1,"cool":1},"egszLKakTCg6Q3bEOTYzBQ":{"text":"This place was ahhhh-mazing. Great burgers, great bartenders, and even better drinks. Next","useful":0,"cool":0},"wTrYjwC2HuFuQyLuDN04KA":{"text":"- 30 minutes before having a table\n- 20 minutes to have the right to order (and a comment ","useful":1,"cool":0},"O1uqGy9CBPfELTBhSbDsJw":{"text":"I came here last Thursday with some friends.  Sat in about 5 minutes.  Started out with re","useful":3,"cool":2},"kEt8RsIBr8l4q0TifJpgnQ":{"text":"Not sure what the hype is about, I thought the burgers were fine. The atmosphere is great ","useful":0,"cool":0},"m1x19dUR3v5bEx2iaJy6tA":{"text":"The interior is dark and a little dank but the food was excellent. I had a cheese burger w","useful":0,"cool":0},"wdII9WN-o1oC7KUv6WNeiQ":{"text":"Just look at the pictures, you can see that this place has some serious burgers and potato","useful":0,"cool":0},"kNzIt4JRknccTxQtM0KGXg":{"text":"Warning: very long lines and a drink called the Neptune's Monsoon are a very bad combinati","useful":0,"cool":0},"fXdNOwT4xWaorDkz4hjrSQ":{"text":"Burgers were tasty and juicy. Yum. It comes with a side of baked potato. Word to the wise,","useful":0,"cool":0},"xfvHgF83hFuxYkZHF0mF9Q":{"text":"Monsoon in a \"Go Cup\"\nEnough said.\n\nThe Burger was ok.","useful":0,"cool":0},"qmOmARbXn0oN0Gleqf-daw":{"text":"My 5 star rating is based primarily on the hamburger (and the baked potato) since, um, tha","useful":0,"cool":0},"VatrKzZ5j8vT1Lr_GoeAuQ":{"text":"This place is really something. I don't really understand the atmosphere or know why it's ","useful":2,"cool":1},"BJtrQ0CBSklwMzkUV-VdLg":{"text":"The good:\n\n1. The cheap cocktails.\n2. The really friendly bartenders. \n3. The eclectic pat","useful":0,"cool":0},"GkPyKwYT3w1qt-xMbicjGQ":{"text":"Stopped by on Halloween night and wasn't disappointed. The atmosphere was great fun. \n\nI g","useful":0,"cool":0},"UxK-gVYbkk6zNlKqt0Jehw":{"text":"If you're in the quarter you should just go to Port of Call (on Esplanade). The wait could","useful":0,"cool":0},"K2LRCIHvrGaUMfKJ8s56_w":{"text":"This is a quality burger. They ground their own meat daily and you can see and taste the d","useful":0,"cool":0},"L8lTCIeW7GOWzLJe44OGxA":{"text":"In my opinion they have declined not my favorite anymore but, still decent. Last few times","useful":1,"cool":0},"KG2_pRFyvbdQeKX67UYR1A":{"text":"I am one the usuals that has never eaten the burgers here (i don't eat Beef/red meat) BUT ","useful":0,"cool":0},"pOaPyaGN_2jhBUML-H53hg":{"text":"Burgers are really good and they serve it with baked potato. I wish they would give you th","useful":0,"cool":0},"JLGv3PclQZLEJVhqPattug":{"text":"On another visit to New Orleans we were not able to get in because of the crowd. This time","useful":0,"cool":0},"9ikikGigiKizcLC4oUKMMA":{"text":"If you crave a burger while in Nola this is the place.Dive bar with great food and good cr","useful":0,"cool":0},"GF5de0xZLiWRmTHeoHVDaA":{"text":"This is the best burger place we tried in New Orleans. The menu is small but mighty. You c","useful":0,"cool":0},"E2u3bLYAzMqelUwDVvm-Qw":{"text":"After reading some reviews about port of call we decided to check them out personally. \nAt","useful":0,"cool":0},"eQaMpDcaslK2OfwOVaE3eA":{"text":"Hands down, one of the best burgers I have ever had. I have ate here at least six times wh","useful":1,"cool":1},"3c8FGC532YTWW8_FFvpcsg":{"text":"Walked through the doors at 11:15am on a Sunday and caught one of the last tables before a","useful":2,"cool":0},"TCe4wL2i9uBNUbwByKIa-w":{"text":"The wait was almost an hour but the food was worth every minute. The woman's bathroom is a","useful":1,"cool":0},"QIk_WArrcTvNeX9MYy65kw":{"text":"Definitely one of the best burgers I have ever had, plus the Monsoon cocktail, YUM!","useful":0,"cool":0},"fz9KSWr2GRHQcX7BmcvIjA":{"text":"A 10 min walk from the French quarter which would seem like a long walk if you're not ineb","useful":0,"cool":0},"2kxGBKtumhOzfuIZYX8yeQ":{"text":"One word describes this restaurant: awesome!! I have never had a burger this good. The mus","useful":0,"cool":0},"6ceXAPXoqqgGqtq9ZsYVog":{"text":"Best Burger I've ever had... Hands down.\n\nMy girlfriend had been talking about this place ","useful":3,"cool":3},"s_WSxbhHa3OrE5KddVvccA":{"text":"I LOVE this place. I really do, do, do!! You'll never hear me say \"no, I don't feel like g","useful":1,"cool":0},"zus6HkwGFVwDmPN8T3g7kg":{"text":"What's so great about this place?? I've always heard you must visit port of call in New Or","useful":2,"cool":0},"t488LUxLoKfpw2zE9MIOow":{"text":"Burger and potatoes were excellent but service was slow rude and horrible! Still waiting f","useful":2,"cool":0},"dUB48fxgmb5inKLsQBtAPQ":{"text":"The bartender has a heavy hand. I'm buzzed from just half the monsoon. The burger and pota","useful":0,"cool":0},"dgjTnJktCZD0XG_K8BZC3Q":{"text":"I'm originally from New Orleans but had never been to Port of Call. So after I got wind of","useful":0,"cool":0},"zo1gCYyetnOEBEzct2li4A":{"text":"Port of Call is a burger place that has some of the best burgers anywhere.  For around $12","useful":0,"cool":0},"Xbbi9FRTV5lqUEm8KYhF-w":{"text":"Hear me now, believe me later! Bury me at Port of Call.\n\nI've been going to Port of Call f","useful":1,"cool":1},"bFP_32NEpiHBvrcxLKu9LA":{"text":"Warning:::Seating is hard to come by at times!!! Thats why Im giving 4 stars. Love this pl","useful":0,"cool":0},"VVsbDj_UnXheNguSbV9rmg":{"text":"Yes, the burgers are great.  I don't like that I can't get fries with it though.  Is that ","useful":1,"cool":1},"WgTySYLhnYp-9xSZJjC87g":{"text":"This place is amazing! It came highly recommended by a local.  Its known for burgers, stea","useful":2,"cool":0},"tRgOOxbUoK-4bCZCFz4Tcw":{"text":"Great atmosphere for an important but casual business lunch. \n\nGotta try the burgers, pizz","useful":0,"cool":0},"-tGEwO-s6dJXHnCjhD76DQ":{"text":"when you are trapped in the maelstrom of the French Quarter and you have been wacked to th","useful":2,"cool":2},"yPjET25WHdtJ6_z8uIfDiQ":{"text":"1/2 pound hamburger and a baked potato with you choice of fixings. The burger is obviously","useful":0,"cool":0},"f-G3xbFdF70bxEvdDFFgug":{"text":"After hearing people rave about the burger here, C and I decided to check this place out. ","useful":0,"cool":0},"Myo4gzxdZPeIKRbhSdznzQ":{"text":"Ok so people from all over the world have heard of this place and this is also a very loca","useful":0,"cool":0},"LBqrQJZo4OSReWxScTlQng":{"text":"I wasn't sure what to expect but the burger and baked potato are as good as the other view","useful":0,"cool":0},"00PNhg1v5EY6WyuZeuviGQ":{"text":"Burgers not up to hype. This is a fun place to go and grab a drink and burger. Burgers are","useful":0,"cool":0},"cERcO2_416uTXjlRe9iIyQ":{"text":"I read Yelp and other site reviews playing this restaurant up for their hamburgers so we w","useful":3,"cool":1},"3-UBmYgtDSfdLdtJI4d3jA":{"text":"Burger tasted exactly like a homemade grilled burger does- if you took a plain pack of ham","useful":0,"cool":0},"qJYZtxznpXHch0IlOLfiXA":{"text":"Monsoon drink is everythinggg. And only $11. \n\n1 is enough, but 2 will have you wobbling. ","useful":0,"cool":0},"TSZfNIRCNY3xwOIZTSJ3zA":{"text":"This is the burger of burgers, no doubt.  \n\nI never eat hamburgers..............ever. Howe","useful":1,"cool":1},"l2fCSFrh4lgWAiTdXSer_A":{"text":"Maybe if you're a local and there isn't much to compare it to, but this ain't much of a bu","useful":2,"cool":1},"TMrhXMT1RTDmYHukKbyKmA":{"text":"Smelled amazing as we walked past the resturant, so we decided give it a try!  Our burgers","useful":1,"cool":0},"p6wag_24vvsXFfpl2qemZA":{"text":"Service, food and drinks are on point! This was simply the best burger I have ever had. Ev","useful":0,"cool":0},"qQKJPZmTWB-_K25wV8Z6Kw":{"text":"Awesome ambiance and great food. Tired of the tourist traps around the area? Head over her","useful":0,"cool":0},"RLpFGujh3vu5IgPjH_fW7w":{"text":"All of my friends have been telling me that I needed to check this place out. \"You have to","useful":0,"cool":0},"czaOctK60vZyDB7Z05skCA":{"text":"Customer service was surprisingly poor during this visit. Rating: 3/5\n\nThis was my 2nd or ","useful":1,"cool":0},"lrpB78sXDhFQOXwutqa_VQ":{"text":"Love this place! The burger, baked potato, mushrooms in wine sauce and Monsoon were fantas","useful":0,"cool":0},"hgcCGauHgN7fp2fJLxTrlA":{"text":"A tiny hole in the wall of deliciousness...\n\nBest Burgers on the planet!  This is a \"must ","useful":0,"cool":0},"hzXa9Hnx9cDw1j8SIS83hQ":{"text":"REALLY 4 stars.  \n\nNO WAY.  This place has ok drinks but dont make up for the poor food.  ","useful":5,"cool":0},"e_AkfUEsw0uNtPYriPuG7A":{"text":"Off the beaten path, tucked in a neighborhood, once you find it and go in you'll swear it'","useful":1,"cool":1},"SYZj0fY0vGdwmGui10x4yg":{"text":"Out of this world burger, huge salads, potato cooked perfect... Beware of the monsoon--- p","useful":0,"cool":0},"LDOjXJToxrY-qpc6LKmusw":{"text":"Totally agreed with Jess C that anyone giving less than a 5 star rating isn't in it for th","useful":0,"cool":0},"LRVUzLPMVu5UVgJDLWsWQQ":{"text":"I have live in New Orleans my whole life and do not understand the hype about port of call","useful":1,"cool":0},"1a9JmiwgFe2cyjRq_iE3kg":{"text":"As other reviews have mentioned, burgers and baked potatoes are great.  The speciality dri","useful":0,"cool":0},"ZvvuRZMizK2HUXewKhr7Lg":{"text":"Unfuckwithable burgers & strong drinks in the shadow of the French Quarter? Sign me up. Ea","useful":0,"cool":0},"1LrxKDHRxLflKvuGPIa0Hg":{"text":"Great burgers and baked potatoes. You have to get the monsoon. Laid back atmosphere and gr","useful":0,"cool":0},"AyecAQooJPk6rX-ZWXKdFQ":{"text":"NOLA might now scream \"burgers\" to most tourists, but, I am married to a burger fiend, so.","useful":0,"cool":0},"33x7D0vj1b0ZyGUSAzDYNw":{"text":"This is my new local. Great staff here. I always have a fun time.\n\nNormally I sit at the b","useful":0,"cool":0},"42djnngYUbl4KT1nEGG2mw":{"text":"Best burgers when you are in the area. Definitely worth a walk to when you are in the Quar","useful":0,"cool":0},"m-Sfx3sJHgWYIYo8bcuFXA":{"text":"The best burger ever!\n\nWhat a great place great service, quaint \"hole in the wall\", not to","useful":0,"cool":0},"vCg1ubGYMuz_g-CpZnB0bA":{"text":"This is quintessential New Orleans and I love every single piece of it. From the loudness ","useful":0,"cool":0},"N6XeZM_baPp8UofmEIqP6Q":{"text":"Awful. Just awful. Place came highly recommended and I cannot understand why. Burger was m","useful":1,"cool":0},"Ode7XGjB8KaZhgkNq9q7EQ":{"text":"My boyfriend wanted a good burger, so our uber driver recommended this place. We asked aro","useful":1,"cool":0},"2EaGaKY4JEBQMc9030VeGw":{"text":"The mushroom cheeseburger was bomb. The monsoon cocktail hit me really quick. Service was ","useful":0,"cool":0},"xMaDU9Qx9EEagYLrMbik0Q":{"text":"Been here countless times. Always get the cheeseburger, medium rare, and chives and bacon ","useful":0,"cool":0},"a8Wbun1RKZlapQnGGDqKxg":{"text":"Not the best burger by any means....It was good but not great!  They say the burgers are a","useful":0,"cool":0},"E6xLgQPoLoM14a20njeC5g":{"text":"Perfectly cooked burger and delicious baked potato. I highly suggest ordering the \"big dad","useful":1,"cool":1},"PDlV8G9JApjfJ1wJWk0Pxg":{"text":"If you like thick juicy burgers, this is your spot.  All burgers come with a baked potato ","useful":0,"cool":0},"23Ab-QwmcUiJk13ryemAmw":{"text":"Get a hand grenade and walk up to port of call for a burger, they are SO good (and huge). ","useful":0,"cool":0},"nAWvMlsJ0h2A9WlOWwTBPA":{"text":"We were here mid-day on St. Patrick's day, and it was packed with people (and for good rea","useful":0,"cool":0},"PEzyyDQRjs8PZ2Vz6cEtIw":{"text":"Even if you aren't hungry- start with an enormous cocktail...your appetite is sure to foll","useful":0,"cool":0},"OkJxwyuQKSIMnfjajYiqQA":{"text":"I was in New Orleans visiting last week and my friends and I had a late dinner here in Sat","useful":0,"cool":0},"0GXhTpvhsp5qbMCXe-TY7g":{"text":"Stopped in for lunch during a business trip. It's in a quieter area. Had the burger, which","useful":0,"cool":0},"myxnu3jpmL5bEq8cSu9lRA":{"text":"omg.\n\na monsoon with a burger (medium rare) and loaded baked potato with mushrooms...\n\ntha","useful":0,"cool":0},"8yDKD0PJ5GFlXONNSzNp0Q":{"text":"Amazing food with amazing service. The best burger place I've found in the area. When you ","useful":0,"cool":0},"u4QpF--cwIBoiXO8HXquqw":{"text":"This is the first review on yelp I've ever written. I don't get it. I went twice hoping to","useful":1,"cool":0},"2A0QAnX-4ifiLf8JXDxCKw":{"text":"This place never fails, the burgers are always delicious and cooked to perfection","useful":0,"cool":0},"kRyGWdviwlqA0s2IsmddZQ":{"text":"It  just isn't worth the wait. Food was good but the line wasn't . Great place for a group","useful":2,"cool":1},"GaDWXuPjW2rC1XcVvtK4EQ":{"text":"If you think you can't finish that ginormous burger, you can . I believe in you. \nThey're ","useful":0,"cool":0},"7SmmF-mUUQcf4npCzaBs2w":{"text":"Still a great joint for burger & potato. Rumor has it that a special POC pizza will be on ","useful":0,"cool":0},"8t7vQsNgq82MN60vwAqq6A":{"text":"Burger edges seared, perfectly medium, good tasting beef (large thick patty- no grisel). S","useful":1,"cool":0},"6KjcKm8AlaT0DUfNUEqPLg":{"text":"A must !! The best burgers and stakes in NOLA . The burger felt like it melted in my mouth","useful":1,"cool":0},"gtfmC1GgjFNBZDtNI96jxg":{"text":"I have never had a bad experience here! Sometimes the wait to be seated can be long and th","useful":0,"cool":0},"qhqopuhEGW8F6yJ0k7EZHA":{"text":"I'm only giving this pace a 3 stars because I didn't get to try their full experience.  My","useful":2,"cool":0},"g9mmwmufc2vfCKEmJZahzg":{"text":"Very good fresh burgers and baked potatoes. Signature drinks are also good. Do not come he","useful":0,"cool":0},"YcQBkhVEP4b6crD6W2srag":{"text":"Definitely would have never made it out here without Yelp.  Menu options are would you lik","useful":0,"cool":0},"p72aNo9F-cNkkOMTKKEvSw":{"text":"Well known among locals and tourists alike, Port of Call is famous for its 1/2 pound burge","useful":0,"cool":0},"o37-1aE3DjDmqXcrE4T7rw":{"text":"U cant leave NOLA without tasting a famous cheeseburger from here.  Came here from NY and ","useful":1,"cool":1},"wpdLbBxCBf6p0GAe8o8H-g":{"text":"I love this burger. I love this potato. I love this jukebox. I love everything about this ","useful":0,"cool":0},"Rs87axd5A6qfYptOtx_8ew":{"text":"Today was one of those days that we should've stayed in our hotel room because it was rain","useful":0,"cool":0},"CMNSxIoNbcdblLtROhV8PQ":{"text":"My first time coming I looooovvvvved this place. But if last I night was my first time goi","useful":1,"cool":1},"nPXLhQAB9t6pNRKp3N6TwQ":{"text":"I ordered medium burger,  got medium rare. My cosuin ordered medium well and got well done","useful":0,"cool":0},"6ei8LHrmRGx7qMenSTbbhA":{"text":"Yum! If you like a good burger and a mouth watering baked potato, this is the place for yo","useful":0,"cool":0},"DWczUqMvHV1qSinLagUwMA":{"text":"The best burger place in the Quarter,  and probably the city. Amazing house drinks, with a","useful":0,"cool":0},"3v7A8Ph-4PlgUSNdIkEXpQ":{"text":"Service is GREAT!\nFood is GREAT!\nI came to New Orleans to eat some authentic New Orleans c","useful":0,"cool":1},"9IJBPynA_104wXoLgIKZbQ":{"text":"Best burger I've ever had! The staff is also amazing! If you can sit at the bar, do! Travi","useful":0,"cool":0},"SclrhEJfvmeq6O7x1UjBcg":{"text":"This is a great place to get a burger.  They have burgers. Go here for a burger. Comes wit","useful":0,"cool":0},"N2OfVIENNlfh6ii9x0Lc0A":{"text":"Monsoooooonnnnn! And the burger - was as big as my head, even when I tried to squish it do","useful":0,"cool":0},"sL12Z3s23axsGG4W-JZitw":{"text":"OMG!!!!!! Where do I start! Thee best burger that I have ever had in my life! Cooked to pe","useful":0,"cool":0},"8HontBXc7vaKAIxQ5Gl1fQ":{"text":"Port of Call is hands down my favorite burger in New Orleans...maybe anywhere!  A cheesebu","useful":1,"cool":0},"D8JX6I2JOsOofXIzvM4JOg":{"text":"For all those people who are complaining that the burgers weren't anything fancy, that's t","useful":0,"cool":0},"Hh3X-XDVJ9dhxfbxvgnF2A":{"text":"Burger literally melts in your mouth. Best burger I've ever had. Order the baked potato fu","useful":2,"cool":0},"qh_O45qZPVWC2ZklCqCyeQ":{"text":"Dive bar/restaurant. Great atmosphere. My burger was med-rare, I asked for medium. Bartend","useful":0,"cool":0},"n8ktNloaaYZFPI8uykkKBw":{"text":"Best burger I've had in a long time and I eat a lot of burgers. Their signature drink was ","useful":0,"cool":0},"D5e3ePY5oeNalr3mvoOxWg":{"text":"It's a pretty decent burger. I got the cheeseburger and side salad. They said they make th","useful":0,"cool":0},"Xd7MzZ8pm5mMD-30WmReUg":{"text":"Quality and cleanliness has gone down.   I didn't enjoy myself last time I went.  I think ","useful":0,"cool":0},"3L_d_glZlir1TlXwx1irlA":{"text":"One of my favorite burgers in the city. Great dive bar type atmosphere. The loaded baked p","useful":1,"cool":0},"7Y_2gS_qxub5Osfiiyledw":{"text":"3.25/5 little adventure\n\ni've been eyeing this place for a couple years now - specifically","useful":4,"cool":2},"D6w6AybxtfZxENNurH38BQ":{"text":"Port O Call has been one of my favorite go to places every time I am in New Orleans.  They","useful":0,"cool":0},"TgwRymt8olfz09ZBD_F8Qw":{"text":"I say the best burger in the world!\nNot what you would expect, pour a Monsoon in your mout","useful":0,"cool":0},"pfVtXYOynMJthalY_6zdFg":{"text":"Omfg... This was amazing. A few friends suggested that I eat here during my trip to Nola a","useful":0,"cool":0},"ltIHcyokkCV_sLUKVLEZnA":{"text":"We were on vacation and stayed in The Marigny.  We saw a line at this place every time we ","useful":0,"cool":0},"LsXl-GYQnv8uizBQj-QarQ":{"text":"Amazing burgers and loaded baked potatoes.  But the best of all the the Neptune's Monsoon!","useful":0,"cool":0},"uewiEyxSXFhRgzi6zYK8rg":{"text":"Superb. \n\nWorth the wait.  \n\nYes a better burger than Yo Mama's,  ( Funny, I never had to ","useful":1,"cool":1},"HcJHKhVexe384nM1_tqiJw":{"text":"It's simple...the best burger I've ever had, matched with a loaded baked potato and a gian","useful":0,"cool":0},"3SX8ZNljOJM_VZReiRHt6A":{"text":"Normally, I order to go but on those rare occasions when I can actually find a seat, the s","useful":1,"cool":0},"metKxG2_P5ZxniF-cu0qUQ":{"text":"Tough for me to make any sweeping statements about New Orleans burgers 'cause I just moved","useful":0,"cool":0},"4DXOrs45Wbgkpd75HsJddA":{"text":"Dark and crowded, usually a wait. Drinks and food make up for it and then some.","useful":0,"cool":0},"kCi_JTLEnPwnXZWvzZ__JA":{"text":"Amazing hamburgers.  Not a ton of things on the menu and we had the hamburgers with baked ","useful":0,"cool":0},"YYbaGPiQU0z84R9dehDdqQ":{"text":"Musty smell, but great food and drinks. Loved the wood beams and old New Orleans atmospher","useful":0,"cool":0},"3FnOFklSFh0YDE4qqBeZwQ":{"text":"Possibly the best restaraunt burger i have ever had.  It is absolutely not gourmet in any ","useful":1,"cool":1},"NKXjo-t-qqpoQ9UY75K-6w":{"text":"The best burger you will ever taste. Nothing fancy but cooked to perfection and make sure ","useful":0,"cool":0},"AXgL5Uo5YtPpV7kwjfcAcw":{"text":"This is a long over due review. Arrived in New Orleans and  the first meal I'm having is a","useful":1,"cool":1},"dR9IP1wraQPY-dEAbzmoVQ":{"text":"Very good hamburger.  Lousy service (even for New Orleans).  The $5 windjammer is a strong","useful":0,"cool":0},"NWQJ9ZowHwWtGhu7tzs_mg":{"text":"Simply put......the best Hamburger in the Universe.  Make sure to get the Monsoon along wi","useful":1,"cool":2},"2OGaM81LHO5K2X7j4C6Ljw":{"text":"Split a Cheese Burger and their Baked Potato loaded with everything. Their drinks are pote","useful":0,"cool":0},"IfWnLOewi-P646Ic7Z9xNQ":{"text":"I agree with the more \"sober\" reviews. Way over-rated and a total tourist trap.\nMy bloody ","useful":0,"cool":0},"4mxn0QNpLjFgdScWl1ObHw":{"text":"Loved it! Great atmosphere, fantastic service and really awesome Burgers. Can't go wrong h","useful":0,"cool":0},"8PpmOpB7Nro-_aIfIhY8Fw":{"text":"I'm really surprised nobody has commented on the smell of this place.\n\nIf you actually tak","useful":2,"cool":0},"LeiyZ8Ix-FkVYadAUUXMhA":{"text":"Great food! Burgers and cooked to perfection. If you're feeling like a drink or two be sur","useful":0,"cool":0},"btN80JqPxjlewg3VWvdjqg":{"text":"A Monsoon, cheeseburger and baked potato from Port 'O Call is the hangover cure of the God","useful":2,"cool":0},"KzxLow8_0smytOQsQDCGNA":{"text":"Food was good, especially for a hangover cure. BUT service was terrible. I get it, it's Su","useful":0,"cool":0},"11SUuKZ1z_3XgFFnTnm-dg":{"text":"Some of the BEST food in all of New Orleans. Such a fun atmosphere so close to other highl","useful":1,"cool":0},"z8KrJ2i11wx6ndqE3FveLA":{"text":"Staff was cursing about the cook sending out under cooked burgers and overall poor quality","useful":1,"cool":0},"dKcZf6YALbGMn0L8BLbUJg":{"text":"Eh...not sure what the hype what was about! The burgers were just average...the baked pota","useful":1,"cool":0},"1V2rYDJfE7Vt09Yhv7A8Ow":{"text":"Place smelled...even by New Orleans standards. I could see that the cleaning standards are","useful":0,"cool":0},"eulSjIaZp_qNPF73EwH1MA":{"text":"I'm not a hamburger eater, so I can't personally vouch for those.  However -- a fresh gree","useful":1,"cool":0},"PRq3mni6jZOfTMPSua4PTg":{"text":"Great burger and awesome atmosphere. Staff was friendly and we sat and ate quickly on a Sa","useful":0,"cool":0},"X-fVHKbAuPTjDohTbRmR4g":{"text":"The best burger on the planet.  I try to visit Port of Call for lunch every time I am in N","useful":1,"cool":0},"Wv2qiUYZg_EMplGjLX1_fQ":{"text":"I actually really liked the burger itself here.  It was meaty goodness, and I liked that i","useful":0,"cool":2},"5at1EoU23QJ7E7uKhq-07Q":{"text":"A must if you want a great burger. It seems like it's always busy, and for good reason. It","useful":0,"cool":0},"VlyBzJYoiOKc6E1otcDpJg":{"text":"Good food. The bake potatoes that comes with the burger was nice and soft just plain delic","useful":0,"cool":0},"ts39aoCpEdBD9Pjv4Of04w":{"text":"Stopped in for a quick bite in between tours over the weekend since I was craving a burger","useful":0,"cool":0},"lf0lA6koa8rq_P-ClY2UzQ":{"text":"Visiting New Orleans for the weekend, we had dinner at Port of Call before a night in the ","useful":0,"cool":0},"K0PvEodkRJJjsgpRwmBiRw":{"text":"I think this place is  overhyped.  Maybe its because I grew up in the midwest, but I would","useful":2,"cool":1},"gWAd3_CIXOX3PAztrTaiqw":{"text":"When you think of Port you think of seafood. Well theres none, just steaks, rubbery bugler","useful":3,"cool":0},"YIZYtOMknOzG0clP6UpOOw":{"text":"I go here again and again and again, and every single time, the food blows me away. How do","useful":3,"cool":3},"EKwELiZa0JuvmHWdOHK07w":{"text":"Incredibly simple burger. They know what they're doing here. They make just a few things a","useful":1,"cool":0},"Ce_l69QXTWQN0kPQOQDA6Q":{"text":"My favorite burger in the city. Nothing fancy, just a big ass burger cooked perfectly. Don","useful":0,"cool":0},"Vhra9jaLgAeh5NUK5fqLUw":{"text":"Great, great, great burger. Go with an appetite because your certainly won't leave hungry.","useful":0,"cool":0},"mlO2bNV5n8WazA6FkE8SVA":{"text":"The food was great especially when I'm in the mood\nFor a good burger. I gave them 4stars b","useful":1,"cool":0},"VYrN5wVNjQUOTVHFekZilA":{"text":"Good spot but not my favorite... Seems expensive for burger, no French fries only a baked ","useful":0,"cool":0},"MdY8WTJWQnLQMBXdV1phYg":{"text":"I am not a big meat eater, but every time I visit New Orleans, I find myself in the dark, ","useful":0,"cool":0},"x72xFtLO-5X2-pcYdDJvJg":{"text":"off the beaten path in NOLA, and perhaps the worest area to find parking.. I found one of ","useful":0,"cool":0},"ioibJ2-6v24VhMjtL7BXsQ":{"text":"Their burgers are like nowhere else.  I love these cheeseburgers.  The monsoon is really g","useful":1,"cool":1},"8k3tgVWQVe1qpckmIIHXsw":{"text":"STEAK? HAMBURGER? MONSOON???\nIf you like beef, potatoes, mushrooms and a large cocktail...","useful":1,"cool":1},"vu_tpbgPhx8ArcZd7VIzmA":{"text":"Loved the burger. Excellently cooked and prepared. The baked potato was very good as well.","useful":0,"cool":0},"uJq02fodLPyg52z_lafCow":{"text":"I have to honestly say that this was one of the best burgers that I've ever had.  However,","useful":0,"cool":0},"QhVVJ7KL0cA8J5DHL1woTw":{"text":"5 star drinks, 3 stars everything else. \n\nI did not go here for any reason other than to o","useful":1,"cool":0},"kuekntSCtiefmIVj-VuSBA":{"text":"Monsoons and burgers are a great way to start a day in New Orleans.  I have been coming he","useful":0,"cool":0},"plC2ycQOBxnXpJs2smiCIA":{"text":"Try the \"Red Turtle\". It's too good. \nLoved their cheese burgers. Would definitely recomme","useful":1,"cool":0},"QCpAagMRnQ1o2QzkDIO39w":{"text":"Best BURGERS EVER!!! This spot is a very chill dive, where locals and tourists Love to eat","useful":0,"cool":0},"0MENHbRpujkuaMxWEq2BjA":{"text":"Despite the massive wait on a Sunday morning, this place is incredible. The menu is basica","useful":0,"cool":1},"DOFh2YWf2_0msYLkTy9lRA":{"text":"Great freakin' burgers and huge cheap drinks.  This place is very good!  The music is nice","useful":0,"cool":0},"oqwal2vif5tnfhNaXQ3WMQ":{"text":"So this place seems to be popular, its a small spot located in the French Quarter. The wai","useful":0,"cool":0},"iMhvN8jbYao8pIR2ke1CxA":{"text":"I've been to Port of Call three times, strictly for the Monsoons. The first two visits wer","useful":0,"cool":0},"pTPFdYTXrShPxQfHNc0Lyw":{"text":"The place had a long wait outside when we got there as the restaurant is pretty small but ","useful":0,"cool":0},"s046_bxkSK5S1L9lU7wgZQ":{"text":"Big Burgers, off Bourbon cozy dive feel and a friendly attentive staff.  The Drink menu is","useful":0,"cool":1},"_jH7-U36AgiS4BnEmoiqIg":{"text":"Hello long line! Hellooooo worth the long line! \nFriends who are Nola locals recommended t","useful":0,"cool":0},"M6EwHWL8g-KJbtvhy7Q9XA":{"text":"I know, did I just give it 3-stars? Really? Hm. I could give it a 3.5-star but I'll leave ","useful":1,"cool":0},"Eh8ggYazSxuiBHnPsqloBg":{"text":"I am a chef at a 5 star restaurant and when i want a out of this world burger I come here ","useful":0,"cool":0},"d314ZmXypLmjrquqB0mzWw":{"text":"You've likely seen the place on TV. Your friends likely told you to eat here. Locals likel","useful":1,"cool":0},"0M8k02nMEEGqU15ml5L4dQ":{"text":"Had a great burger and baked potato!! The monsoon was a great drink to wash it down. We ha","useful":0,"cool":0},"rYUbKG_RDOK5Xkb07PLhWw":{"text":"The burgers were mediocre here; however, I must say their MONSOONS are the BEST!!!! Of all","useful":0,"cool":0},"tqbHTPCY3UIuhFGAh1PEzw":{"text":"This place used to be the creme de la creme of hamburgers. Now they survive on reputation ","useful":2,"cool":0},"N0o-ExbKuUSmR10anVcRPw":{"text":"I guess, there aren't any quick \"burger joints\" around here. I love me some Five Guys and ","useful":1,"cool":0},"eOdgNenWpJ-mzOh99e6--Q":{"text":"You can never go wrong getting a burger here it's the same every time I come and the baked","useful":0,"cool":0},"brrBoU0mN4v_vzxG-MFMJw":{"text":"The place to go in Nola for a burger and baked potato.  Great atmosphere and service.","useful":0,"cool":0},"G74_pHsBw5SAXDqi74gdrQ":{"text":"Port-O-Call is dark, and relatively small, with limited bar seating and a small dining are","useful":11,"cool":9},"9iUVYkpo2-hXropCMz3cmQ":{"text":"This is my favorite stop in New Orleans to nurse a hangover. They have the best burger in ","useful":0,"cool":0},"Zpx780voooDfhrtinTRKMA":{"text":"The food was ten ten.  What let down my star rating was the staff. The woman in charge of ","useful":1,"cool":0},"7PfqBm7Ij_Pq3mR5-zyuZw":{"text":"Huge, delicious burgers in a cool, dark setting. Perfect thing for a hot summer day!","useful":0,"cool":0},"ITt8Gyz7G-8i1-tV0dN0FA":{"text":"This place is 110% New Orleans. It's very hodgepodge and the vibe is very chill. Has a loc","useful":2,"cool":3},"HNZP5oz3mKS0c7MX9erUEw":{"text":"Let me preface this by saying this isn't a review on the food because we didn't eat here h","useful":0,"cool":0},"rE4GFKoxWGgXCyB1OK1krQ":{"text":"Best damn burgers in town!!!!!! Enough said.","useful":0,"cool":0},"Gc9odpUcRdMGi_eydN9-mg":{"text":"After a late night, this is the place to go. \n\nMenu is simple (burgers and baked potatoes)","useful":0,"cool":0},"9PQUz2g1u-sPinr6Rd6eMg":{"text":"Great hangover spot. Burger is good and the loaded baked potato is a cure all for the hang","useful":0,"cool":0},"8yqYwgwVsXzz3HbDM7zh3Q":{"text":"One of my favorite burgers in New Orleans. I come here pretty often and while the food is ","useful":0,"cool":0},"cImV2alQUlKkZFqo_m8c4w":{"text":"Not long of a wait tonight, but I'm sure there normally is. There is not much sitting, but","useful":0,"cool":0},"xbk8P08RPyGK5c9elw0V3A":{"text":"Line outside the door as we approached - which is always a good sign. Obviously, based on ","useful":0,"cool":0},"CDAUb5lzU9iz8seNa8pYPA":{"text":"My son lives in New Orleans and took us there because he said they had the best burgers. W","useful":2,"cool":1},"TLPRJxMIN_ZH05R6BlvbKA":{"text":"This is another New Orleans institution that shouldn't be missed for huge and delicious ha","useful":0,"cool":0},"y1JEv1F4W8Cf5v4F07Fpeg":{"text":"Had lunch here and had the burger and the baked potato. The burger was bland. It needs sal","useful":0,"cool":0},"Qh4kx4g0B9dw7cl7hLjL1A":{"text":"Best waiters & service!!! \nThe food is amazing. Can't go wrong with their baked potatoes.","useful":0,"cool":0},"_XartaITXc7M6dPf7DeV5g":{"text":"Let me start off by saying that this is my first review on Yelp EVER. Let me continue by s","useful":2,"cool":0},"by-wnWKUQMXaNI81_v-bxg":{"text":"I could go on about my burger and its deliciousness but I'll just say YUM instead. No fril","useful":0,"cool":0},"6hJdtv-iBpag4SEo0TNaTw":{"text":"By far the best baked potato I've had in life!!! Wowwww, the burger was also great. Their ","useful":1,"cool":0},"41eiYeIm_oXR7alJ6kil5Q":{"text":"Great simple burger, strong drinks and all at a price point that makes it more than worth ","useful":0,"cool":0},"ri7NOxw76zTzBBQV4fvqNg":{"text":"I have never missed a visit to Port of Call in all of my visits to Nola. It is probably my","useful":1,"cool":0},"RH4K_3XbNV-7xySuz61mug":{"text":"Best overall dining experience! The Monsoon and a burger is a must have and definitely wor","useful":0,"cool":0},"LTxgxyT6ce-bpo9jvcCx9w":{"text":"A friend of mine raved about Port of Call as having fantastic drinks and hamburgers.  She,","useful":1,"cool":0},"vTdrm9bIk0rC1zhJc943Vg":{"text":"The last time I went here (no other time have I encountered an issue) --The wait was ten m","useful":1,"cool":0},"sH8cWs8UvnBKTAtDI_D2Rw":{"text":"Not impressed at all. I've eaten here on several occasions and the only thing I can think ","useful":6,"cool":3},"gv_cSZzVjQsaREuRvsFLkA":{"text":"Best Burger Ever. The End.","useful":1,"cool":1},"IxHMs6eNCu2JGUUSckPmbQ":{"text":"Everything was amazing. I got the scooner salad and a loaded potato with mushrooms. Staff ","useful":0,"cool":0},"S68hw4KBaYnMQXdKdoHlNg":{"text":"We lucked out and went on a slow night and were seated right away. Good thing, because we ","useful":0,"cool":0},"KccGrQ48KFJdgYa-qha4Cg":{"text":"Good service, sit at the bar if you don't want to wait. The menu has about 8-10 real items","useful":0,"cool":0},"RWqMV9FshbyiZgdjdqBfjQ":{"text":"This place is so dark inside that you cannot even see if your food is cooked adequately or","useful":0,"cool":0},"OYz5ruq8DBPgN4cszFmaGg":{"text":"Total dump. \n\nCame here because or reviews on yelp & honestly the place is a complete dump","useful":2,"cool":0},"3H5QKODTb6KMKVLXF-JJdQ":{"text":"I have yet to have a burger with the right ratio of chuck beef and sirloin as port of call","useful":1,"cool":1},"RSIxPMozpdNRbWujqarZiQ":{"text":"a good burger on the border between the french quarter and the marigny.  but it's just a b","useful":1,"cool":0},"esrsTWkaXTiIX0-ZltNh7g":{"text":"The kitchen is filthy, along with the people who work in it! Absolutely disgusting.\n\nThe b","useful":4,"cool":0},"vYtRwoyQR5V1TOD-YjbrNA":{"text":"Same review as before, but I heard Tracy no longer works there.....so dont ask for him!!  ","useful":1,"cool":1},"-xpLx7bBJfgGJUSXT3ZR4Q":{"text":"When in NO, I stay near the Port of Call so that I can walk by each day and if they aren't","useful":1,"cool":1},"Y5pPyA1E5FhtZ62owXGmhw":{"text":"So our super cute Uber driver \"toyota\" recommended this place. The cheese burger and the M","useful":0,"cool":0},"LZDUozSRzYm-pd3U0lCfPA":{"text":"I had a mushroom cheeseburger and had a bit of trouble trying to bite it once I added the ","useful":0,"cool":0},"GZxRzglCX8G7sHrQYaj7aA":{"text":"This is a bit farther away, as it is in the Marigny, but it is by far the best burger in t","useful":0,"cool":0},"F9QEjW7UZ2pslnXEwv2Yjg":{"text":"This is probably my favorite burger place in town. They have other things on the menu, but","useful":0,"cool":0},"vLjnBmZXwY3ypMd1WTIYMA":{"text":"Quiet laid back place to grad a drink and something quick to eat. Not too far from Burbon ","useful":0,"cool":0},"qFDPQzimkUn59O8DGT83Vg":{"text":"We walked in and were able to sit right away which apparently is a feat here, given its si","useful":2,"cool":3},"aWk7GhthT3IpiLjtiz64oQ":{"text":"Menu is pretty simple.\n\nBurger or steak, and decide what topping you want on your baked po","useful":0,"cool":0},"MgWJH7qK7Er-ft2K0RZ0bg":{"text":"Port of Call defines DIVE in the best possible way. You can tell this place has been aroun","useful":0,"cool":1},"0x0v9KLIIPQMv_vXtmhdiw":{"text":"Best burgers and bar in town. Service is great even when they are swamped (which is always","useful":0,"cool":0},"7A4bVPmH3OFPkATVqDfciA":{"text":"It was all I had dreamed of....best burger (mushroom cheeseburger medium well)....best dri","useful":0,"cool":0},"Wiqq1nZgzD4tOXrzcnK7BQ":{"text":"What a weird and awesome place. If you like fussy stuff this isn't going to be your spot. ","useful":1,"cool":2},"iqVgerylXVEwYjqTj7-htw":{"text":"We came here after a loooooonnnnngggggg night of drinking on Bourbon.  What heals a hangov","useful":1,"cool":0},"ElGB4-vSVA7fuvVBMe_V-Q":{"text":"This is the second 5 star I've given out. Wow. Just wow. Absolutely amazing. The best burg","useful":0,"cool":0},"KclK4IPuwb8PYaEkomI3sQ":{"text":"After dropping our bags this is always our first stop after arriving in New Orleans and th","useful":0,"cool":0},"5Qw4vwNGFfmXKzZlOXQ0Qw":{"text":"The entrance is a small door and when we walked thru it we entered a dark bar and bumped t","useful":0,"cool":0},"SlwCrJncDiYe1KAkjlyK5A":{"text":"I always try to visit when I'm in Nola.  The burgers are really good with cheese pilled hi","useful":3,"cool":2},"9m_VXoScUUie_fY-zZ2N4Q":{"text":"Hello!! Yummy baked potato, burger, and strong drinks!! Definitely a great place to eat an","useful":0,"cool":0},"sKc7E54lXmwMXIuSxYAjqg":{"text":"Don't Bother.\n\nThere are too many good restaurants in New Orleans to waste a visit here. D","useful":1,"cool":0},"pScghJ8Hu2sqWZHjSOzJ6w":{"text":"BAKED POTATO. Burgers are great too and never say no to a monsoon, but potatoes are amazin","useful":0,"cool":0},"rtw7T2HCGSe8O0siGsEP8w":{"text":"Well...at least the monsoon was strong! The burgers are sub par at best. It's says 1/2lb. ","useful":0,"cool":0},"LwRyE3hTzcT9pJQ0NdOtUA":{"text":"Get here early as this is a popular place and usuallya line and someone inside taking name","useful":0,"cool":0},"cJsVVBMhb_6rIP9gADlyLw":{"text":"I had a friend take me to port of call after she had already been there and checked the pl","useful":0,"cool":0},"fakwd5U8PqYmdrAe10wMRQ":{"text":"Heard about this place from the locals. It was okay. The potato was great. The burger didn","useful":0,"cool":0},"GuZB1zkoSQglf5-QTfJ5uA":{"text":"Menù non molto vario, ma la qualità è davvero ottima! Geniale l'idea di inserire in un pia","useful":1,"cool":0},"WV9rvyDZ5m4_aUMhLiL6WQ":{"text":"Burgers are the best....and the specialty drinks are very strong (and inexpensive) here. M","useful":2,"cool":0},"FEQ2BGGX1IEp3dCeM2hA0w":{"text":"One piece of advice....get here early as there always is a line we went at 130PM and waite","useful":1,"cool":1},"xwZgCghzhylrN-1ft7Enng":{"text":"I was told I had to get a burger and baked potato at Port of Call if I were going to NOLA.","useful":1,"cool":3},"2bO1oH5paaqgbQbLmr-HRQ":{"text":"I have been to New Orleans 20+ times and so far this is my go-to for burgers.  They are th","useful":1,"cool":1},"6VAzqL2m-9fuzJZFcbwKug":{"text":"Best burger....maybe ever.  Would really like some fries though, only baked potatoes. Had ","useful":0,"cool":0},"1kY5IR1A9BrHws9SGhGY5w":{"text":"Sincerely, deeply, truly love the cheeseburger with baked potato and the Monsoon.  The pla","useful":0,"cool":0},"6pOXWLgQn89WcbyCCNmfOQ":{"text":"This was an okay burger joint. I was expecting a Cajun twist to the burger or maybe a litt","useful":0,"cool":0},"LwZrjTLfbQWBuLQyqQE5TQ":{"text":"Sent my burger back once because it was nearly frozen in the middle.  Came back, same burg","useful":0,"cool":0},"I4od-PvU4uG5WZkuBcqZ2w":{"text":"One star off for the crowd, which I hesitate to do, for they are a part of the \"experience","useful":3,"cool":0},"W9F7bgw2T6AsfIasgQpTmw":{"text":"I went here on a Saturday night and ate at the bar. \n\nWhat I got: hamburger and baked pota","useful":0,"cool":0},"xiG7dsktAfkZTYyEPgiyWw":{"text":"Good food,  little dark hole in the wall place  but they crank out some amazing burgers an","useful":0,"cool":0},"O36HHgTbryas0h3epdpTZQ":{"text":"This place is awesome.  Best burgers and baked potatos you can find in the city.  I never ","useful":0,"cool":0},"kLpBSClf3Wj_7zbcqKqbpw":{"text":"Simply the best burger. Long time patron and have eaten new burgers throughout the designe","useful":0,"cool":0},"UKOVYfFPUu1i25qeyN6dLg":{"text":"Went there yesterday as they opened.  A tour bus of mardi gras partyers were lined up to g","useful":2,"cool":1},"i_zYNlBG8otcBz5q-cNf4w":{"text":"Burgers and baked potatoes. Great, fun, dark place. Rum punch is great too. Would go back ","useful":0,"cool":0},"OHwureHyWQTlvraDD5b2kg":{"text":"My friend and I came here on a Thursday (I forget...all the days mysteriously kinda got sm","useful":0,"cool":0},"WZr9BAief2yOR5hfLhEWjQ":{"text":"People love this place. It reminds of the food you would find at a restaurant in the 80s w","useful":1,"cool":0},"IfAammpa8C7VCtFPXKLpXg":{"text":"The Best Burger in the World!  PoC holds this ranking in my mind for the past 9 years.  Ki","useful":0,"cool":0},"E38Xg_b_XUc6iFrdbMlGpg":{"text":"Had to wait 30 minutes on a Tuesday night @ 8:00, so figured it was good. Had cheeseburger","useful":1,"cool":0},"JqOkNSPtWStYVENDeHhZDw":{"text":"We were told about this place by a sales girl at Laurel mercantile in Laurel Mississippi. ","useful":2,"cool":1},"Q_T2OQpnguRHqJJvgTthKA":{"text":"went on a monday night late night and chatted with the bartender.  we got the baked potato","useful":0,"cool":1},"2cKSOffGpzB4rxBcHuHGrg":{"text":"Our family of four got immediate seating around 5pm on a Wednesday evening. \nThe ambience ","useful":0,"cool":0},"m3lmJQv8vCMo3Q2EE8MY8A":{"text":"We went here for lunch based on the recommendation of a fellow traveler, who said it would","useful":0,"cool":0},"mDzXSr0TrYVM9lD0ABCDlQ":{"text":"The mushroom cheese burger was soo good! Wow this place has great food! Small menu but the","useful":0,"cool":0},"yGtPjEe3OMrQAubK_jdPog":{"text":"super terrific burgers and the baked potato thing must be a New Orleans thing. it was grea","useful":1,"cool":0},"Fb-uNOYRXHzn5J7jpZmbmg":{"text":"Found this place by accident. Long wait but so worth it. The burgers were delicious and th","useful":0,"cool":0},"piqeDhjaD8vakoDpSupA-w":{"text":"I shared a \"Monsoon\" with a friend - we took on to go and H-E-L-L-O we forgot we were drin","useful":0,"cool":0},"6NBszXHo5tOKBOhUOQtKrw":{"text":"My favorite place for a burger........anywhere. They have been consistent for decades!! A ","useful":0,"cool":0},"EJIG-kKzgx8RPS31z-xFNg":{"text":"Excellent food. I love Cajun cuisine, but it's nice to get a good steak and potato. Decent","useful":0,"cool":0},"zz-VWJ70Qdtp97_s2s_54A":{"text":"I don't think you can find a better cheeseburger ANYWHERE! Worth the wait. Bring your appe","useful":0,"cool":1},"7coWMlPdfpKXqYsg75PdTg":{"text":"\"Best burger in New Orleans\", you have got to be kidding me!  Wow, this place is over rate","useful":1,"cool":0},"8B2v-riDe0QAsoq0s9waxA":{"text":"One word. Monsoon. \n\nI was told by a friend to find this place so I took his advice. Yep. ","useful":0,"cool":0},"yO-FW2NMO4uk-SjEj7wTvA":{"text":"A couple of years ago, I was in New Orleans for a nursing \nconference....I took a group of","useful":0,"cool":0},"qDBfc4jDPRNb_H9h-SiBSA":{"text":"Came here after reading some pretty good reviews on Yelp and I was not disappointed. The l","useful":0,"cool":0},"kI6J-luIInMr_BIhBZ_Mng":{"text":"The burgers were phenomenal!!! Sooo good. The bar is DARK and not very big, but the waitre","useful":2,"cool":1},"PH3-3SMmtiPb25eUR9iPog":{"text":"Them monsoons get me righteous! \nWhen I come to New Orleans we always stop by port of call","useful":0,"cool":0},"xPssz2Q1vApEuzDOlxCWog":{"text":"Small, packed, long wait but of so freaking delicious. I had the burger. It comes with a b","useful":0,"cool":0},"OeBC75xZS3LoINwRJHsqbQ":{"text":"My \"PORT OF CALL\" moment of embarrassment\nI'm not fond of sharing bad news or negative rev","useful":2,"cool":0},"-XqeJCED1GJJ_ABr_qht6g":{"text":"POC is one of my favorite restaurants in the US. Their burgers, baked potatoes, and drinks","useful":1,"cool":0},"wc0AJnCx4xv7x_wubBVJ7A":{"text":"I have to admit that I planned to eat only seafood during my visit to New Orleans. However","useful":0,"cool":0},"zIbSOHZfJhC9VDXBPzG9iQ":{"text":"My friends and I decided to have dinner here for the last meal in New Orleans before the e","useful":2,"cool":0},"svHQZdieIcJk4EWs9N3VkQ":{"text":"Came for NOLA to experience Mardi Gras. This place was by our hotel and always had a mob o","useful":0,"cool":0},"XajoRIdfSWI0l3Kt_82Bnw":{"text":"The wait was super long. Was expecting fantastic it was just ok. Not the best burger or po","useful":0,"cool":0},"wLMdC4x6a35HvczTzkWDFg":{"text":"There is a wait but so worth it! Came here after a recommendation and on a Saturday night ","useful":4,"cool":1},"BXJXjpyv0jXYTzTDBdIA0A":{"text":"If you're in the mood for a great burger, this is the spot! There won't be much else on th","useful":0,"cool":0},"FzxaxckK45vLzlirMmgZDQ":{"text":"Okay so I didn't try anything with the mushrooms because I'm not a mushroom guy. So if you","useful":1,"cool":0},"BXXYCBgPiHIfFfSjQmVJRA":{"text":"Best burgers on the planet. That's all that needs to be said.\n\nBe prepared to wait a long ","useful":1,"cool":2},"xxVMHtX1iEhoXsGhWexE-A":{"text":"Would definetly go back.  Great burger.  Good service.  One note of advice:  You may make ","useful":1,"cool":0},"55Wh08z0fR0SWAPfIVG2wA":{"text":"Based on other reviews, I expected an amazing burger. After eating it, I found it to be ju","useful":1,"cool":0},"ZoLAW3WPfxkvxp-gTU6WQw":{"text":"Cold beer , the burger that I got was huge plus the baked potato hahah awesome ! We will b","useful":0,"cool":0},"6u1YPsNyn8rq455SkDEblw":{"text":"Amazing! Best burger in Nola. This hole in the wall place always has a line but it's worth","useful":0,"cool":0},"WGoYl617WasqiiyqsRE83Q":{"text":"Just booked our 2nd trip to NOLA and realized I never gave my review. My Hubby said this w","useful":0,"cool":0},"7LDvNCePrVxQNnyG4ZOFCg":{"text":"Long wait. \n\nBaked potato was five stars with all the fixings on top, burger was a 3.5. \n\n","useful":0,"cool":0},"MG1gHnkZ3Y0osf2kCCoiRQ":{"text":"If you go here with children, make sure you get an Uber and a babysitter if you plan on dr","useful":0,"cool":0},"whJ9_QGsiLL6rIaWBXFLHw":{"text":"It's been 8 years since my first Port of Call burger and I'll definitely be back on our ne","useful":0,"cool":0},"9-xA89ZBV3eP1IrJZ3SorQ":{"text":"I will return. I really thought I wasn't going to find a burger this good. When to the bar","useful":0,"cool":0},"vd33-XLLVeIbB1UvUeMi2w":{"text":"Love the place-it is my Sunday afternoon treat, very simple menu, a good hearty meal for a","useful":0,"cool":0},"NCd2Eem3cbDUD6ThDiPh7Q":{"text":"We went to this restaurant on a Saturday night and the wait was about an hour.  OMG it was","useful":0,"cool":0},"2T5vgIgrnCeGyyqZtC5d-A":{"text":"It's gets a 2 because the food was pretty good, but the service and experience was sub par","useful":1,"cool":0},"2QIVAkCQl-rEgVYL78t7Vg":{"text":"We were recommended to try this place by our tour bus driver and it was really good.  I lo","useful":0,"cool":0},"9mMLZ_C4UwoDQT5oMa8iqA":{"text":"Wow, where to begin? This place is famous throughout the country (world?), so let me just ","useful":0,"cool":0},"4KfK7RDEz55MrbnCoK-JCw":{"text":"Out of all the places I've been to in this great big world Port Of Call is by far the cool","useful":2,"cool":2},"SSWopBMmO1NKKXqhrU7mxg":{"text":"Let's just go ahead and get the bad out of the way first. Service in the restaurant was te","useful":0,"cool":0},"cmNRkCxpDHv9TF4l4GUu2Q":{"text":"Cool place. Attentive service with great burgers and baked potato. Will go back! Didn't tr","useful":0,"cool":0},"ki9bwERqHSaEtfpdilGnLw":{"text":"Excellent, juicy burgers but the baked potatoes with toppings are amazing and the real sta","useful":0,"cool":0},"M5qkKWn_GpQDRRmda5hH7g":{"text":"So Frickin delicious. Had a burger and it 1/2 lb.) was seasoned and cooked perfectly. It c","useful":0,"cool":1},"QyFRUHz5i4s-mJWzKUCDPw":{"text":"I've been here a few times and always have the burger cooked medium well.  I like that it'","useful":0,"cool":0},"19ipCbJ4FsAzs4f-tQegxA":{"text":"Well we had to try it after hearing all the good recommendations in town and reading all t","useful":0,"cool":0},"Vh9040_XGJWGo9dK10-f4Q":{"text":"I moved to NOLA in the summer of 2013 and I've been to Port of Call a number of times. Han","useful":0,"cool":0},"nj1EMX_lUrZ3XTn9Zz8-Qw":{"text":"Incredible burgers. Get a baked potato on the side too. Sounds odd but it's a natural. \nWe","useful":0,"cool":0},"q4nIAgpTrgNoSGGt1--1-w":{"text":"Seriously, y'all?\n\nI absolutely cannot comprehend the five star ratings...if there was a h","useful":5,"cool":2},"dnPkgN34V7VUO0cNN6ytSA":{"text":"Some friends that are local recommended this place and my one regret is not having been ab","useful":0,"cool":0},"K2NTuQ2aoREAIY5o0uxCZw":{"text":"I heard really good reviews about this place. I'm assuming because of the holiday and esse","useful":1,"cool":0},"3P0HYDMk6oJ6oIrGjwHxSA":{"text":"I feel bad for rating this place with 3 out of 5 stars. This used to be one of my favorite","useful":0,"cool":0},"XO_OUW-gFQESbHaP6W98Bg":{"text":"Hamburgers to DIE for!!!!! Went the first time because I was craving a burger after DAYS o","useful":0,"cool":1},"ZLP9CVwq_VxfYVztIvg0ag":{"text":"Best burger and baked potato I had while in Nola. The prices were reasonable and the servi","useful":0,"cool":0},"ED35dJCn-t-h9gkLRAF5ng":{"text":"Burger, potato, monsoon! Im good. Give me another monsoon and its ALL GOOD. Cool atmospher","useful":1,"cool":1},"tDCVae0et5_VPYXbtfzQaQ":{"text":"Long ass wait?  no problem!  get a Monsoon, that will tie you over till the food gets to y","useful":0,"cool":0},"yHB0EprqrH-dYMA7G0JFkQ":{"text":"My brother recommended this place as \"the spot\" for burgers. I was a little let down after","useful":0,"cool":0},"8MhIAaAHpmuoM622YLjPSg":{"text":"The BEST hamburger I've ever had. Lots of locals mixed in with the tourists. If your going","useful":0,"cool":0},"HSFT6CP92doy8zezRMZWSg":{"text":"Great burgers!!! I would've given it 5 stars but they put imitation bacon bits on the bake","useful":0,"cool":0},"vZU6S8Pc_PNY-sV_mJAo9A":{"text":"Best burger in town. There's usually a line outside the door during peak hours, but you ca","useful":0,"cool":0},"fGO-dNpABGOLqVCtDxNrcg":{"text":"While visiting in December our Airbnb was literally two blocks away from here. We happened","useful":0,"cool":0},"kMylLYonEdofDyOu4LNTYg":{"text":"Good service.\n\nFood is okay. I just seem to remember Port of Call being sooo much better.","useful":3,"cool":0},"AdozBNvdf7_XQrFhL3dlyw":{"text":"Fun historic hole in the wall, just be ready to wait. Our wait was about an hour. The serv","useful":1,"cool":0},"2ZteeeOIX8W-Hzc9oe1_Gg":{"text":"Cheeseburger (medium); cheesey banked potato with chives and bacon bits on the side?!  Yes","useful":0,"cool":0},"KnmI5rc5a7fQj8lSoUV1Ew":{"text":"Was recommended by a relative, definitely not worth $12 for a cheeseburger, bill end up to","useful":0,"cool":0},"WOt3tEfiQilQOcJVZuc_uA":{"text":"i was brought here by one of my friends from new orleans.. after walking 45 minutes to the","useful":0,"cool":0},"j20KRaMOnK_gyFeJpmYwSA":{"text":"One of the best burgers I've had in a long time.  Their signature Monsoon drink wasn't too","useful":0,"cool":0},"8TXo7bzsJOT-xZrsUfevQQ":{"text":"Great burgers, hole in the wall atmosphere!! A must have in NOLA!!! First time here & ever","useful":0,"cool":0},"3a0f5lDbjDZ7vOEWKTpxBw":{"text":"Monsoon beats a Hurricane easily.  I just wish they had a location closer to the main part","useful":1,"cool":0},"6qgrvsdzgskO0xwxjWtJFA":{"text":"Some really good people at our hotel recommended Port of Call so we tried it out. Our hote","useful":0,"cool":0},"-76jUumlpKwJDpA6qTW-uA":{"text":"I can see why people rave about this place. This was on my potential places to check out f","useful":0,"cool":0},"BfJ4CCLPtxEieqBdAH2bfQ":{"text":"This past Saturday evening around 6:30pm my group and I waited outside for 90 minutes to b","useful":1,"cool":0},"i-tGFrBU9OSloNFJaT9_7w":{"text":"I haven't been to Port of Call in a few years and the boyfriend and I often talk about it ","useful":1,"cool":0},"x0ZdqqqEhtmgqx6BIXQXcQ":{"text":"Greattt burger and cheap for the amount of food you get! Small place and if you don't come","useful":2,"cool":0},"BF7M-ocac0piYJ1G275Kiw":{"text":"You know, if somebody had said to me: When you go to New Orleans, you have to try this bur","useful":0,"cool":0},"1J76liDoyt-uQt820hmcmQ":{"text":"Where do I begin its simply amazing the burger is on point and the baked potato has to be ","useful":1,"cool":1},"ctdazjmZE8gatUfHb8FxPw":{"text":"Looking for a good burger in NO?  Look no further than Port of Call.  When you first step ","useful":0,"cool":0},"fqQUyEpvku5pldnzgwAFpg":{"text":"great new orleans experience. excellent burger and loaded baked potato. mansoon is the dri","useful":1,"cool":1},"-NX09RGc88WfvxDJ19I76w":{"text":"The burgers and baked potatoes were delicious. Simple menu with big taste. My only complai","useful":1,"cool":0},"RTUoklgWXKP0U0mOfQudEw":{"text":"I don't know if its because I haven't eaten here in a while but the burger I had the other","useful":3,"cool":0},"Nc9t8UCl5g2R9gnAdvgYEA":{"text":"This is such a delicious hamburger! Big and cooked perfectly every time. The mushrooms and","useful":1,"cool":0},"ujdW1SLp6mP8t7Vf7-49CA":{"text":"Fantastic burgers with an all around cool vibe. Loved the fact that they pair their burger","useful":0,"cool":0},"a2ID6pUJE4yQao7h9nZwTw":{"text":"I love this joint, the monsoons will tear down a hurricane from Pat O'Brien's anytime! The","useful":0,"cool":0},"-91Ed-jrkD5mB2YQaFWK5g":{"text":"Seriously some of the best hospitality I had in New Orleans. Pat made our visit memorable ","useful":1,"cool":0},"1MRxUTeVf5N-DrTUz4HQnQ":{"text":"Best burger I've ever eaten.  It looks like a dive, but the food is rockin!  We went there","useful":0,"cool":0},"FAtO95d7WWeM0lsYulcujw":{"text":"A friend told us to try it. We waited for 10 minutes for the person to put our name on wai","useful":2,"cool":0},"WXFemMu1s6iVHujbwXjksA":{"text":"In speaking to many locals inquiring about where to go to eat, we had many say \"PORT OF CA","useful":0,"cool":0},"kFFlNtqzCzzKjPRhQPVV_g":{"text":"I couldn't stop saying \"wow\" as I ate the cheeseburger and baked potato. Absolutely worth ","useful":1,"cool":0},"eVzBo5INuw5AdeamuY80PQ":{"text":"We stayed one night in New Orleans and I had heard of this place from George Motz's Burger","useful":0,"cool":0},"K45gy-A5BwLsTe4Y1HwLAA":{"text":"This place is beyond words.  I never go to NOLA and NOT go to Port of Call.  It is always ","useful":0,"cool":0},"4tmGpkvIJlUePgWj_7MzNA":{"text":"Every time I visit, this is my go to spot. The menus is basic, burgers and baked potatoes.","useful":0,"cool":0},"x4rX4m5EOPFZlp75RExf7w":{"text":"OK. Port of Call is not only one of the best \"dive\" joints in the Quarter, but their chees","useful":0,"cool":0},"p79YUhRZ6-D96gbfZi8rzw":{"text":"The best hole-in-the-wall restaurant you'll come across in downtown New Orleans. Very simp","useful":0,"cool":0},"Jkc3RasCJtOFDL4VbQfsMg":{"text":"The best burger ever! I make this a stop in every trip to NOLA yes there's a wait,  yes it","useful":1,"cool":1},"3bf-1qDduL3b8N-p5n9BYA":{"text":"The food was good, but I've had better. Definitely over-priced due to it's history and pop","useful":0,"cool":0},"naKfB9u2G-mfw27RxVTPqA":{"text":"Recommended to us by our cab driver. Had the monsoon and huma huma. They come in hugee pla","useful":0,"cool":0},"vdZ8-JHtQdfd7ZwvpSmA6Q":{"text":"So much talk about \nThis goddamn burger but the \nPOTATO is best*\n\n*how? why? I don't even ","useful":1,"cool":1},"qH5UnpfzytPCY-OvFAXJLQ":{"text":"Came with a friend a while back after hearing great things about the burgers here and was ","useful":0,"cool":0},"sr0bofXJHK_V0AjYdTTsFA":{"text":"I'm honestly very disappointed with this experience.  Between the reviews I'd seen on Yelp","useful":3,"cool":0},"FC0-_XYCL-RUm3g8Df1dPg":{"text":"From out of town. Stopped in due to trusted recommendation and wow, I'm glad I ate here! H","useful":0,"cool":0},"8M_HQJkXO12D9gtc7pR2pQ":{"text":"One of the best burgers I've ever had. Cooked and seasoned perfectly. I am not a big fan o","useful":0,"cool":0},"rN-K97efID3eBIy4Bvz8Sw":{"text":"Absolutely one of my favorite places to get a great burger and a buzz! The host was very f","useful":0,"cool":0},"OShXjCCJElZk8M4_JQtGDQ":{"text":"Is a great lil restaurant/ bar to try. was told to try the monsoon drank it was pretty goo","useful":2,"cool":1},"IHl_OlPnulwZA_8Ul1sb4w":{"text":"Everyone told us we had to try this place but we aren't really sure why. The food was ok a","useful":0,"cool":0},"ZDK9_zsvhifj4iEQVlQGlg":{"text":"Best burger I've ever had!!! This was a life altering experience and has forever raised th","useful":1,"cool":0},"DQMcRt3AvSUMntLb_xsbNw":{"text":"Port of Call burgers are ok - but now there are better burgers in the N.O. area.  \n\nIt is ","useful":1,"cool":0},"nUH2sgpDF3TjCCMyemM3mg":{"text":"Supposedly the best burger in Nola, I beg to differ.","useful":1,"cool":0},"6TDQL_bkf3NfsudtVYAKfQ":{"text":"Great baked potatoes! Cheeseburger was awesome as well! Its a hole in the wall, but those ","useful":0,"cool":0},"7oajYFtlIM8psga38iig5g":{"text":"Best burgers in town was told about by locals. Has signature drinks that were very tasty a","useful":0,"cool":0},"YRXVRbPZv96JzW01qoyXBg":{"text":"Delicious burger!! I had a plain cheeseburger and was in heaven! Full alll day long!! The ","useful":1,"cool":0},"v0l119bdnibh_tXyO4Tk5w":{"text":"The food here is great the lines are long and the service is well, \"I don't care we are po","useful":1,"cool":0},"EvvB2R48xC37jNg-CdRsvw":{"text":"Fresh, organic and delicious beef cheeseburger with baked potatoe!!\nIf do you want a delic","useful":0,"cool":0},"fOnlAjZcp5db_rxVBXTSAQ":{"text":"3.5 stars - it's a cool local joint.  We beat the lunch crowd and got one of the tables.  ","useful":2,"cool":1},"DVo1gtMdwCfwbNB-KQQ_oA":{"text":"I LOVED Port of Call! We came here last weekend during our trip the Big Easy for Mardi Gra","useful":3,"cool":2},"0uQ2_VtDh4Kvek8NT2tJ0A":{"text":"Wow...just wow.  Get a monsoon, a cheeseburger, and a potato, and the rest will be a smile","useful":0,"cool":0},"RU3QUMS-glCCOdjuEP1b_w":{"text":"There's a reason why Port of Call is always busy....it's because it embodies what is aweso","useful":5,"cool":3},"-lp0WM0JJF4P96qqEcSVEQ":{"text":"Totally a hole. This place smells funny, like restroom, not sure if it was just that parti","useful":0,"cool":0},"rHH-yDFarCo_FC6nthw_tA":{"text":"Stinky. Didn't eat the food, but the burgers looked good. All the drinks have tons of suga","useful":0,"cool":0},"0y27hGIRYuZGOpo3I1edsA":{"text":"3 Stars is the most I'll rate this place, Don't get me wrong but the whole staff needs to ","useful":0,"cool":0},"qiuYiI_-ie-k6S27Im9Kkg":{"text":"One of the best meals I had in NOLA!!!  \n\nI really don't recall what led us to walk all th","useful":0,"cool":0},"GaFBQRin1qi44NUhlWVpSQ":{"text":"Quite possibly the greatest burger I have ever had. The patty was so juicy.... So tender a","useful":0,"cool":1},"vW7C2Y9wLxNDpxyx992zFA":{"text":"We love local dives, and this is certainly one of them came for the ice waters stayed for ","useful":1,"cool":0},"jeUkiFCGH2IpNbOM4QluRQ":{"text":"My doctor recommended Port of Call as her mother lives nearby.  These really are some of t","useful":0,"cool":0},"hHXvGXmeTdwjLdL52nDNEw":{"text":"My husband and I decided what better way to celebrate National Cheeseburger Day yesterday ","useful":0,"cool":0},"0dX1mqPfDwleobEWAV99PA":{"text":"Been coming here for many of years now.  Finally got the routine down.  Come early or prep","useful":2,"cool":1},"U0mGI4Yq_6eRTncNvZikBQ":{"text":"Port of Call has a very nice and limited menu that consists of about 6 or 7 specialty drin","useful":0,"cool":0},"qClRewTCN0F6DWxt9KZVIQ":{"text":"Great job today.  I normally fuss but it seems back to the standard I had there several ye","useful":1,"cool":2},"iDMBtcqU5M6Y1qnAr9HpbQ":{"text":"Crazy busy and my medium burger was raw. A total stranger sitting next to me at the bar se","useful":0,"cool":0},"8CHhd_SGd0wa-2an9_kbmw":{"text":"My wife and I had cheeseburgers and the cheese on it was very excellent. We loved the look","useful":0,"cool":0},"FXDn0iKAXaxYDSy-hMmg_A":{"text":"The burgers are massive, the baked potatoes are good. The wait wasn't unbearable, we split","useful":1,"cool":2},"fl7Qu9ueIaMfJEwlIIKKbg":{"text":"I never visit Nola and not stop here. I've been coming for years very sad that the burgers","useful":1,"cool":0},"-SutwW57SiivUWA7iedzIg":{"text":"Out of the way, but worth the ride. Gigantic baked spuds with all the toppings. Burgers ar","useful":0,"cool":0},"djgd4BVPMABn023d3SRQlQ":{"text":"I'm not sure if a better place exists for burgers... ANYWHERE! Some places have amazing bu","useful":2,"cool":2},"sNbyFhkz9ObGz-QRCPTNxQ":{"text":"Before Katrina, Port of Call was awesome. Great burger, baked potatoes. They even had grea","useful":2,"cool":0},"rgDUfDjzyIaqVbQeyFo9bQ":{"text":"Much like everyone else has said - the burgers are good and the baked potato tasty. The mo","useful":0,"cool":0},"JPaVasofiqecYgiJuNFk0g":{"text":"Have you ever had a perfect meal?  Head to this effing ridiculous place and you will.","useful":0,"cool":0},"sQj2yQU83Wp4EuIJ7FbXZw":{"text":"So I lived down here for about a dozen years or so a long time ago and I always tell peopl","useful":1,"cool":1},"rkHbUlfrUmbkOtgkgFyA9Q":{"text":"Overrated tourist trap. 1/2 pound of flavorless ground beef.  Not worth it all. Plus the s","useful":0,"cool":0},"vt8SYZfhJEL0pKswMg7U5Q":{"text":"It's a little on the expensive side for a burger, but it is well worth the price.  The bur","useful":1,"cool":1},"kk-L_cByEj2CacuglYcGTQ":{"text":"The hamburgers were pretty good. I like that I could get a baked potato. However, I asked ","useful":0,"cool":0},"ttJWmcXxSlad_TlN3iVN0w":{"text":"This places lives up to everything everybody says.... AMAZING, GINORMOUS BURGERS, AND A KI","useful":1,"cool":1},"Md63fErc_LNlo4AhePMSTQ":{"text":"WOW. So glad I was able to try this restaurant before leaving NOLA. \n\nIf you love burgers ","useful":0,"cool":0},"YI52M7gUX8R_EiccGnhKLA":{"text":"Perhaps I've eaten too many delicious burgers in my life but I just didn't think that the ","useful":2,"cool":0},"ovJHCcALOMHpYoBszYHEAA":{"text":"The limited menu meant I ate my first burger in like 20 years. It was a very, very good bu","useful":0,"cool":0},"Ts-Z650AoL3DfjwV65XV7g":{"text":"Decent burgers and a decent bloody mary. I like how they have picked green beans in the bl","useful":0,"cool":0},"TbWC_UsonbscLojJcuhURg":{"text":"I was very happy that I read the reviews (and saw the pictures) so I knew we only needed t","useful":1,"cool":0},"x5r8KxmCiDDFf8Ktt9Oo7w":{"text":"Like the burgers here, but the long wait is always the issue, especially since you most li","useful":1,"cool":0},"FYbl-BTSEBhmEj7H_8Da5g":{"text":"Great Food, Great Place!  This is one of the must try burgers in the US.  Make sure and ha","useful":0,"cool":0},"8IwpDYmJfEHQ7y1iqOSwUg":{"text":"Have you ever seen a burger the size of your face?? I have! At Port of Call!! \n\nHonestly t","useful":2,"cool":3},"yB-CI18eTdhXnZ-aN9u-yQ":{"text":"The best meal I've had in New Orleans. Perfectly cooked burger. The wait at this place is ","useful":0,"cool":0},"JTx7HhEmNGoO0t55qKQ1vQ":{"text":"Great burger, i love when a place does just a few thing. Chances are good they do them wel","useful":0,"cool":0},"bZHpAG5H6mwXGjAdSyV1Gw":{"text":"A friend recommended this place and though I thought it as a little divey, my boyfriend an","useful":0,"cool":0},"4VGNcCuvlyyNX19oNAcV8Q":{"text":"One reason I like New Orleans is that there are a LOT of well-kept secrets.  I almost feel","useful":1,"cool":1},"LllSz-ZLsv63XCiZ4gn87g":{"text":"Loved it! The first time we visited, we were turned because they had mechanical issues. Bu","useful":0,"cool":0},"B9n0Ji4kFKCVdtWjJMCKEQ":{"text":"A great local restaurant with excellent food. This place came highly recommended to me and","useful":1,"cool":1},"jsadb6T1_LuLlsvMG_9rig":{"text":"Be prepared to wait and then be surprised on why you waited.  This place is consistently i","useful":0,"cool":0},"2z33vP-v-9EFr3IsZcJgtQ":{"text":"You should go once and get one of those crazy giant drinks and a burger. Go at an off hour","useful":0,"cool":0},"B9SeH0ISY74PQsOfD9wHog":{"text":"Seriously....the BEST burger I have EVER had.  They are always busy, so it took 3 times to","useful":0,"cool":0},"EMcwaOLgSm9qKbfOwytNYQ":{"text":"Decent burger, but not sure what makes it unique or special enough to cost 20 bucks. Like ","useful":0,"cool":0},"QFYENTk4gkvL5JyMv2aiLw":{"text":"Wow.  Lots of very positive and very negative reviews on this site for a great dive bar an","useful":0,"cool":0},"ac4VVAxhcvCnHsGFqGEFUQ":{"text":"We're in New Orleans on vacation, and my girlfriend found this place in a travel guide.   ","useful":0,"cool":0},"whCYKGkQlT168FyxsE1wfQ":{"text":"Love this place. If there is a special event in town, be ready to wait. Cheeseburger and p","useful":0,"cool":0},"TuQstabD1OO3Mc4a03O_DA":{"text":"We wanted a break from seafood for a meal, and Port of Call did not disappoint. \nGreat bur","useful":0,"cool":0},"1mwfURpih-G02sJytI2xwQ":{"text":"Ribeye was cooked as ordered, service was decent. Meat was poor quality- stringy, not marb","useful":0,"cool":0},"ckeMqq0i6Bt8BbcwcWBoDA":{"text":"You know a place must be good when there's only a couple things on the menu BUT it's Alway","useful":0,"cool":0},"oDtUS0WatqxNjtiDuQnxOg":{"text":"I know a lot of people here consider this the best burger in town but not me. While it's t","useful":0,"cool":0},"QMsrwmZHif5loHNyAZz6qw":{"text":"This is the best place to get a burger in New Orleans.  It is filled with service people s","useful":2,"cool":1},"ubOwfh8zob_JOY8cYt0dYw":{"text":"I enjoyed my burger here. It's a cool place with nice food. The place is dark and I don't ","useful":0,"cool":0},"RgXrEA5MLS2D1r4nxdJWTg":{"text":"I get as excited about getting a burger from this place as people do for election season t","useful":0,"cool":0},"zTjwUo0AO9aLB8kKqpdufg":{"text":"I had heard all about Port of Call for a few years before I actually made it down there.  ","useful":0,"cool":0},"dNs9ElFgVoW8CiHp5HRQzA":{"text":"I don't know if adding another review to this would make a difference since there's alread","useful":2,"cool":0},"UYdOMJcD-qQ9eGOy5DBZ2g":{"text":"Fantastic burger and baked potato!  We just returned from eating dinner.  I don't know whi","useful":0,"cool":0},"MBMS9a32I0CCEuchCu_O2g":{"text":"My dad used to tell me that on nights when my grandma burned dinner, the family would eat ","useful":0,"cool":0},"Iog2XXXdWpuFL_m3_v6wMw":{"text":"Consistency - Year after year it's still the best burger anywhere in NOLA. I've been comin","useful":1,"cool":0},"JC4VRdQo5iwy9Fmpp35Gkg":{"text":"Great hole in the wall spot for a burger and a beer. Be prepared to wait, there is always ","useful":0,"cool":0},"fRpio2-PZMKFA9Y1g9mnaw":{"text":"Probably the best burger I've eaten since puberty.\n\nIt was another late night in New Orlea","useful":1,"cool":2},"ToL8V2BKs2wh0Fl2UekGKw":{"text":"Great place,and though I may have been drunk, their burgers are AMAZING. And the baked pot","useful":0,"cool":0},"U92GxTBeIr4JZizUxncbvA":{"text":"Port of Call is one of our favorite dives to go to in New Orleans.  The atmosphere is smal","useful":2,"cool":1},"ibknR5MsRi-4FanlGL6G8Q":{"text":"Beware!!!!!!!!!!!! \nThe Monsoon will getcha!!!!\n\nThe first bar I visited in NOLA. Walked t","useful":0,"cool":0},"FdEvKh9cRRbkOYS5LNx70Q":{"text":"Went here after a very long ghost tour at around 11pm. It's a small place. I got a cheeseb","useful":0,"cool":0},"u52Kb65zp-Kv95LND2_-fA":{"text":"Burgers are good, try medium instead of medium well next time bc I thought mine was a litt","useful":1,"cool":0},"ME8QG2IZk2dF8jh8n_jbog":{"text":"They have the best baked potato I've ever had. The burgers are delicious too. Cool bar, go","useful":1,"cool":1},"rVxwYWA1WKiSlSo4tJq8YQ":{"text":"Fantastic little neighborhood bar off the normal touristy areas.\nDark and small inside jus","useful":1,"cool":0},"WxFWycLERmd8ATPeGMr9CQ":{"text":"New Orleans institution. Small dive bar kind of place. The food is exceptional. Get the bu","useful":0,"cool":0},"QoyUxYUqn5MKCt9PM81HMQ":{"text":"three words. ho. lee. shit. \n\nif you like burgers and baked potatoes and stuffing your fac","useful":5,"cool":5},"A0CTKPPV3oMxRjy5AV393A":{"text":"Cool local place but it smells musty.  A decent burger and potato.  Service is slow but no","useful":1,"cool":0},"9GUQXgQ9LjoYz5yjCVGIfg":{"text":"I've eaten here twice and both times were great.  The burgers are scrumptious and come wit","useful":1,"cool":1},"3uDkSRWbUxh3pzt41-tr7w":{"text":"Best burger anywhere. Medium rare is the only way. The loaded baked potato is a delicious ","useful":0,"cool":0},"uymKf5uKGWQypUuEV-P43Q":{"text":"Perfect night. Mushroom cheeseburger, fully loaded baked potato and a monsoon. You will be","useful":0,"cool":0},"ik1iBvgZcEfFqUCcDA-qMg":{"text":"Huge burgers, great baked potato, strong drinks. Been here several times on my travels and","useful":0,"cool":0},"tme7GUtzIJrDsVJWDQLW7w":{"text":"Come for the big, juicy burgers served with delicious baked potatoes and dangerously stron","useful":2,"cool":0},"dG5IG-1fVv_oGcMVCm5yxw":{"text":"Can't remember the last time I made an appearance but I had a ball! The after/after bar sp","useful":1,"cool":0},"e76FPHENfoMXaDtcDfz7hQ":{"text":"I've been eating here for 41 years (1977) best burger I ever ate.","useful":0,"cool":0},"FlZDG5IEG9VXPZ_q6tHJSQ":{"text":"This restaurant is located on a quieter street in New Orleans. It's a bit dark in the rest","useful":0,"cool":0},"U7RAeiIgVngSlx3WxIlI5g":{"text":"Dark and dreary interior. Came in and ordered their specialty, the Monsoon. I tried to mak","useful":3,"cool":0},"2TeDvjb3rVSwAOfQQDN6xQ":{"text":"My friends from out of town, have all told me to stop selling \"Porta Call\" as the best bur","useful":1,"cool":0},"IMVQk-nnEXwMNIThYekW0A":{"text":"I know a lot of you think Port Of Call has the best burgers around. I very much disagree. ","useful":8,"cool":3},"5XVpJ-EOJSCs5tesZQ1K0g":{"text":"The menu may be small and simple, but everything on it is good.  Juicy, perfectly cooked b","useful":0,"cool":0},"VWCdtcqvYvJjHZ92uNTl_w":{"text":"Burgers are awesome and the Monsoon is probably the best mixed drink in New Orleans.  Only","useful":1,"cool":1},"2PouvOkSPxC8e1QmcYQncw":{"text":"Out of this world burger and potato!! Delightful, surprise of the beaten path of bourbon s","useful":0,"cool":0},"5slxKS6kyll2BKK0S8wszQ":{"text":"Best burgers in Nola, hands down. Whether dining in or getting to go, everything is always","useful":0,"cool":0},"HJDvzCA4h0M4dScVdwFGog":{"text":"Best burger ... Ever. Great steaks, easy atmosphere. Don't look for health food, but if ya","useful":0,"cool":0},"IX50x4eH6f6ql7SmcKafMg":{"text":"Fresh-ground patty cooked medium-rare was juicy & delicious, as promised.  \n\nServed with a","useful":0,"cool":0},"8vGxDpH7Mtt-ny1VU2mmyQ":{"text":"The steaks are great! Wife had the filet Minot and I had the NY Strip. Both were tender an","useful":0,"cool":0},"qnLHSzmIO5r9T65xz5SGHA":{"text":"If you don't like Port Of Call you and I cannot be friends because something is seriously ","useful":0,"cool":1},"TtDrvvUgtomIevgitZTLDw":{"text":"I am going to preface all of my burger reviews by saying that I am a total burger aficiona","useful":0,"cool":0},"wnr-TuX5-ngfaYj75RvW_g":{"text":"Second time here. The first time I can't remember. Started with the Monsoon that I learned","useful":1,"cool":0},"97ubLbeavBh90uxQvfb5gw":{"text":"I just don't get it.\n\nAfter having multiple strangers go out of their way to tell me about","useful":1,"cool":0},"lGoAC4TX7biAKghQ8egO7Q":{"text":"This is a great local place,  Seemed to always have a small line at night but I was happy ","useful":0,"cool":0},"RNme7zKXofqAhUxPLcaUGw":{"text":"I think this is my favorite restaurant in America.  The bartenders are AMAZING.  I don't k","useful":0,"cool":0},"3dSjcUr4QBwpz-NBpRgQHQ":{"text":"Great Burgers! Great Atmosphere!  Best Baked Patatoes!Make sure you have a Monsoon!  Servi","useful":0,"cool":0},"a5eUiR-0JUSU_--2RjrfqQ":{"text":"I can see how the dude came up with ideas for his bar, I'm gonna have a bar and there's go","useful":0,"cool":0},"axiwAy__TFOmy9R-eaMblA":{"text":"Service was awful. We waited for 45 minutes for burgers and the server didn't come over to","useful":0,"cool":0},"Yi8jSy2aQ7sxcsc1lhb1kw":{"text":"I love  that most of the reviews list the baked potato as the best thing.  They are the on","useful":0,"cool":0},"fREeWkyVtOZC09Wnyqf_fg":{"text":"Met a friend that lives nearby while in NOLA as he said it's a good local eatery. That it ","useful":1,"cool":0},"kz3vcNtmP-1qh_5Nn6irVQ":{"text":"Service wasn't good and we were there right when they opened. It seemed as though we were ","useful":2,"cool":0},"7SiHu_X0d733d1UtVf5kXg":{"text":"Totally loved this place.  The burger was very tasty, and the baked potato was a very nice","useful":0,"cool":0},"zxkxdanw8asBTdR9ZYd3rw":{"text":"Hands down the best hamburger and baked potato I have had! My fiancé said this place was a","useful":0,"cool":0},"N-dUErgTWwC2UwSjHBlx5w":{"text":"It's a wait but when you want a good burger or steak and tasty strong drink... This is the","useful":0,"cool":0},"QwObv7XWZAMLRD-b7No87A":{"text":"WOW! Talk about a wonderful dive bar experience. This is a hole in the wall type of place,","useful":0,"cool":0},"NqTmeXlpmIGEr16j76NhKQ":{"text":"Just three burgers and three steaks....all served with a baked potato.  Perfect menu at al","useful":0,"cool":0},"BcoJtOtJCMW55eAZmq0Srg":{"text":"Burgers are great and they actually accurately cook it to the temp you request! I hate get","useful":0,"cool":0},"ROqVaRfKDeo1NVBltgKkvg":{"text":"best burger in new orleans! this place is not a fine dine restaurant so leave your blazer ","useful":0,"cool":2},"2rj0s-yWclVk8eD7ueQUwA":{"text":"Our family went to Port of Call in NOLA today. It is a small restaurant, so don't go at no","useful":2,"cool":0},"y_Cl_JmktRXE_kw9mnnieQ":{"text":"I've been going to this place for over 10 years! It still remains one of my favorite place","useful":0,"cool":0},"tHwabMZDufEzzLIr6sNTtA":{"text":"My favorite low key spot to go at night when im in NOLA! awesome idea to serve the baked p","useful":0,"cool":0},"bdnuB80FhgYXAMZ2HMZS8w":{"text":"Great service and great food! Simple menu but if it ain't broke, don't fix it. This place ","useful":0,"cool":0},"8zE9FdLwAfFUeYxzPALz_w":{"text":"Headed over to Port of Call with my wife and loved it. A bit if a wait but soon enough two","useful":0,"cool":0},"-CYKtmGSx2t6VFVUHKV_UQ":{"text":"Love the atmosphere dark and dingy and the room located behind the bar is a nice chill spo","useful":0,"cool":0},"ii7OMTJNkDbUf_qrgQjHhQ":{"text":"This hamburger is HUGE, the size of your head!!  They will cook it to your specifications,","useful":1,"cool":2},"SG63JRRKfEYxIwCn8MRu4w":{"text":"If ever in Nawlins go get a cheddar cheeseburger with a loaded baked potato and you will b","useful":0,"cool":0},"C9NRwdxnlpNWvsJgbHvglg":{"text":"This is the only restaurant in all of NOLA that had dijon mustard and not just yucky plain","useful":1,"cool":0},"PvcMWVxFmg0zXYm9YjpzOA":{"text":"Houma Houma!!! They've upped the price to $11 now, but this is still one of the best drink","useful":0,"cool":0},"HuWZJO7kh6GLjD3_1Qf5Aw":{"text":"If you love the following things, this is your spot:\n\n-Hole in the wall feel\n-Delicious dr","useful":2,"cool":1},"6sNAjotsdJ6Gkl9boYJsqQ":{"text":"Absolutely LOVED this place. Very friendly staff. Great food and such a cute location. Not","useful":0,"cool":0},"k_vTpah4pDR-8KrcSlDquQ":{"text":"Not a fan at all! Walked 30 minutes to get there, 2 hour wait only to find tasteless hunks","useful":1,"cool":0},"Mi21vA6tbW_MyCHTlF2new":{"text":"Stopped by Port Of Call by the suggestion of 2 friends, one from Houston and one local.  W","useful":1,"cool":0},"xudqvl1Kf3D8pflPAyZgSQ":{"text":"This is the BEST spot for good food and drinks! The burgers are too die for and PLEASE get","useful":0,"cool":0},"7B4mySXIPem3cAVZOoahtw":{"text":"This is usually my husband and I favorite place to eat for steak!! This was also our secon","useful":1,"cool":0},"GGNNpZIbQshNqev9iFvk6g":{"text":"Long story short, great food but I don't think it was worth the wait.\n\nWent here for dinne","useful":0,"cool":0},"4LcqD5cudQK8WijXpg9oJg":{"text":"There is definitely a reason there is almost always a line to get in.  Best burger in town","useful":0,"cool":0},"JRXpwiQj4a47MG3sBLq5wg":{"text":"If you are in the mood for a good burger and loaded baked potato this is the place; its ab","useful":0,"cool":0},"sNmbBBr6yAVjtMpefq4aew":{"text":"A little bit off the beaten path. The rib eye steak was good and decent sized. It came wit","useful":0,"cool":0},"MchuORcbcrOYqmy6V_7zXw":{"text":"Great burgers. Great drinks.\n\nThis place has a very simple menu- burgers and sides. The mu","useful":0,"cool":0},"8X1lWJXDfNpp9kZldAxlxg":{"text":"I love Port of Call!\n\nI've been here several times and I have to say - just about everythi","useful":0,"cool":0},"_EWLu9Q74VJEWriWpHtGxA":{"text":"Another place whose popularity continues to elude me after almost two decades of living in","useful":2,"cool":0},"EFOqgbMtIv16vQU4lEM7UQ":{"text":"So a friend from NOLA said I had to go to Port of Call. I went and was discouraged by the ","useful":0,"cool":0},"pvgf5pf64OhSeZSBeSge3w":{"text":"What a great place!!! Who would think in such a seafood oriented city you would find an aw","useful":2,"cool":0},"SbhytzkCnGJsOLWTwT0TnQ":{"text":"Bomb burger that is worth the wait, and you can get sloshed on a monsoon without getting t","useful":0,"cool":0},"gzeH5O0iXBQ6f4Bsb8wtQg":{"text":"I hear a lot of people hating on Port of Call lately. Mostly saying that it isn't like it ","useful":2,"cool":1},"HIk-fGljdlsxXqmhAXiNhw":{"text":"Great burger and potato. Had a large Goomba punch and it was good too. Was told later that","useful":1,"cool":1},"urt-08oyE_DKlhg1di51hQ":{"text":"The freshly ground burgers were pretty good. Though the burger seems to let the freshness ","useful":0,"cool":0},"uj6OTQ6W1bVs8UYcE231xw":{"text":"Burger was delicious! And the baked potato was tasty too.  It's nice to not have choices s","useful":0,"cool":0},"F7UxiZUhC2ElMHcCjcIWIA":{"text":"Three stars was even questionable for me. Half decent service. I noticed they were somewha","useful":0,"cool":0},"bcOuGlaMTwxgM8eNLVe7jw":{"text":"I can now understand why people rave about this place. Best cheeseburger I have ever had. ","useful":5,"cool":1},"_FFkP60BexuC5YgZdH6rYA":{"text":"it was quite a walk from our hotel but this place was featured in Burgerland, so it was a ","useful":0,"cool":0},"_NOurMxJ9uMqlg8cvY2C1w":{"text":"Not my choice to come here. Was not in the mood for a burger so we ordered pizzas to share","useful":1,"cool":0},"FQ6q4n_TFq3nz_5SwxX16Q":{"text":"I loved this place! A few friends and I rocked up to PoC based on a local's recommendation","useful":1,"cool":0},"d7UdcRZZUcaHKOSG9Ma6NQ":{"text":"Walked right in and got a seat. I guess we were lucky since most people have to wait in li","useful":0,"cool":0},"LNfcuX7u4RVnPU3bGAqC6w":{"text":"Still one of the best burgers in NOLA but the drinks make it. They are sweet and strong, a","useful":0,"cool":0},"-HINMaVDQQJmTk2PydduLg":{"text":"In one sentence, a wonderful place for a strong drink and a large burger.\n\nPort of Call is","useful":0,"cool":0},"OyBStEoPdY6KW9CQXHYKEg":{"text":"Port of Call. The spot of my 21st and 25 birthday dinners, the night before my college gra","useful":8,"cool":12},"o2smHpBJH6WmwSAqx4fhMQ":{"text":"A real joint. Lunched here with a party of 11 yesterday.  A big task for this restaurant d","useful":0,"cool":0},"TOmtFNVhBMsREwUA079MOw":{"text":"I am a really picky eater.  Especially when it comes to hamburgers. But i was feeling adve","useful":2,"cool":0},"HQA4Urv-9GGiaPmkeZrSiQ":{"text":"I love Port of Call. Ever since the very first time my mom took me here during my first se","useful":0,"cool":0},"efWLmchqdVyeTlGQCjkVXA":{"text":"BEST. BURGER. EVER. !!!! Coming back to New Orleans just for this place.\nCrowded, but sat ","useful":0,"cool":0},"pjHiFHOgbA-uK9EhwKzIMQ":{"text":"Ok food and Damn good Bloody Mary's. \n\nIt has turned in to more of an \"experience\" for tou","useful":3,"cool":0},"q0y8GzfflFHvgjYnSjyH-Q":{"text":"I have ate at Port Of Call on several different occasions dining in. I took to go for the ","useful":0,"cool":0},"xhK77EQhTqZ16wj04OxNUA":{"text":"One of my good buddies who spends a good deal of time in the NO brought me here.  This is ","useful":0,"cool":0},"MLA8_WcI0Rmu8OjCL3ywrQ":{"text":"Schooner Salad was good, enough for 4 people to share.  Burgers, not the best I've ever ha","useful":0,"cool":0},"mrnvD1qrP9bsd_xF1Vp6Iw":{"text":"This was a fabulous burger place. They also make a great cocktail. I really hope I remembe","useful":0,"cool":0},"vKDQ7wRreHaKB7iq_sGDRw":{"text":"Very, very overrated with extremely unfriendly service. Would give it 1 star, but the bake","useful":0,"cool":0},"7jlMYBDlL7rGLHHR4I0B4w":{"text":"I have eaten here three times. I swear I have. I only remember, with the sort of vividness","useful":0,"cool":0},"lQhC2TsPnujlUixUXLrKMw":{"text":"Our taxi driver suggested this place so we decided to check it out. It was a great place t","useful":0,"cool":0},"2s2jRqHhcrRANffISNSBbQ":{"text":"Always our first restaurant stop in NOLA. I'm mean, we get off plane, check into hotel and","useful":1,"cool":0},"O_lFaqNTBaKXeYs0w611Qg":{"text":"This place was really awesome to stop in for. Went the 1st time and had a few drinks- they","useful":0,"cool":0},"-oUHJgYKZwrDQesTgz8OLA":{"text":"This is my 2nd time here and damn I'm in love.  Went on Monday (lundi gras) and they handl","useful":0,"cool":0},"6_EsSQ5oCH5klb0rUHrI-Q":{"text":"We hadn't been here for a long time. Arrived early, but it was bustling. Good salad with t","useful":0,"cool":0},"pB0LkBi5oOMiJGQv-MtNQQ":{"text":"When I visited this place on a Friday morning, Travis the bartender made me the best Blood","useful":0,"cool":1},"xdR29_qc3PtcdE1mS4sTdA":{"text":"OMFG. We waited half an hour to be seated and ordered 2 cheeseburgers. Took another half h","useful":1,"cool":0},"6_HNDh8FXlZAGpCoKaVzgA":{"text":"A great burger.\n\nMy mouth often waters thinking of how good this meal was.  The burger is ","useful":0,"cool":0},"KAXhoeAy9z3M5MMsZcUMow":{"text":"I've been eating and drinking here for years. Won't make a trip to NOLA without getting a ","useful":0,"cool":0},"bXF9SXJ8-LH48axkm_LqeA":{"text":"The monsoon was delicious. The burger was good enough to get us to go twice in one weekend","useful":0,"cool":0},"eb_wUJ-6avzWNeIybHzx0g":{"text":"Great start to a late night.  Shared a burger with a HUGE baked potato.  My hubby had the ","useful":1,"cool":0},"yXbHokiV7awc5KaUV6qokg":{"text":"The burger is a side to the potato!! Delicious!! We sat at the best table in the place, wi","useful":0,"cool":0},"JIBs4EhH60L5XGF-3kzSWg":{"text":"Un sitio muy familiar donde comer buenas hamburguesas cuando estás harto del pescado refri","useful":0,"cool":0},"3gWrAD547139vWMTpZloGw":{"text":"One of the best burgers I've ever had, if not the best.  The meal I generally get is 2 bur","useful":0,"cool":0},"DiH_vlz32KTuLIPrX-I4IQ":{"text":"I thought this place was fine but I don't buy into the \"best burger in NOLA\" hype. I think","useful":0,"cool":0},"Qi1uPLAteosRD-2bX69RhA":{"text":"Phenomenal! You gotta try the burger and loaded baked potato. It's to die for. Try their s","useful":0,"cool":0},"Pfh489Upn4jL_961olHzCA":{"text":"It's was every tasty. I found the staff to be very kind but not overly friendly . \n\nThe bu","useful":0,"cool":0},"QkXYbu610UhkUHeKduqlVg":{"text":"The only person who makes a hamburger this good is my husband on the grill!  Baked potato ","useful":1,"cool":0},"2T3Rkmptv0N1Sc3KOEui2A":{"text":"Delicious food.  Had the burger and baked potato.  Restaurant is dark and cramped but stil","useful":0,"cool":0},"JppH8HABsWq_oyKqsLSGxQ":{"text":"Totally loved this place.  The burger was very tasty, and the baked potato was a very nice","useful":1,"cool":1},"UuB5-q2gZHCG240PPYSb0w":{"text":"Now, this place is extremely popular and a great all around hang out but don't let that fo","useful":0,"cool":0},"pp3XBo5nXZPhPMJAW13uRQ":{"text":"If there is only one place I could suggest you eat in New Orleans, it would be Port of Cal","useful":1,"cool":1},"YR19kuFMjjqn-L7_iVguGg":{"text":"I was visiting New Orleans and my friend told me about this as a good place for visitors a","useful":0,"cool":0},"Pn7Hu8B_4-WS1-8pbJN8EA":{"text":"This was one of the best meals I had in a trip full of fantastic eating. Nothing special b","useful":1,"cool":0},"fq8S22USbJhQdwjOywotqA":{"text":"In Hunter S. Thompson's \"The Rum Diaries\" his protagonist's favorite watering hole only se","useful":4,"cool":4},"y19NpKvBfxzw6YpqO1Mpxg":{"text":"Ok! So my guy and I use yelp EVERYWHERE we travel. We trust in it to keep our tummies happ","useful":0,"cool":0},"vYN2yZ9ocFZpvnDpSVJUvg":{"text":"I enjoyed our visit here. The wait was tremendous. We ordered 2 big monsoons and walked ar","useful":0,"cool":0},"2U768XGY26zF2uJ2oZ-63A":{"text":"Great service! Very good food! Our server Kevin was awesome and informative. Best kept sec","useful":0,"cool":0},"4sa11F3jOMH_Qtg-U1xk7w":{"text":"WAY TOO MUCH HYPE...recommended by many in NOLA but I'd never go back.\n\nBaked Potato comes","useful":2,"cool":1},"dhka9i4udQjDXr4ossLXMw":{"text":"Visited while on a road trip to New Orleans and it was quite a good experience. So burgers","useful":0,"cool":0},"ZyAQ74PeAPHQ4TmhsbWIYg":{"text":"I am a first timer to New Orleans. My Airbnb host recommended this place. Although the foo","useful":0,"cool":0},"k04pugc07YaGiPiF2qzj2w":{"text":"By far one of the best things about Nola. The burgers and ambiance are amazing. If you dis","useful":0,"cool":0},"FDWZQHuXZq8_57fjXdZkCA":{"text":"Awesome burgers!! They have the BEST bakes potatoes and their drinks are amazing. Definite","useful":0,"cool":0},"Ul_Q4xghCcFloJzu2IPTfQ":{"text":"Olde thyme new London Conn. minus the shitty aquarium but plus lots toursits thinking they","useful":1,"cool":1},"SFmFa5ouHp1_oZHx0mB3-A":{"text":"All I can say is WOW. If you're visiting NOLA and just want a break from the whole Cajun t","useful":0,"cool":0},"_ESbKj7T1bN-n9AOHnYJjA":{"text":"We came here because the lady that sat next to us at the airport said they were the best r","useful":4,"cool":0},"vmkJnu5tqKzsOYyUMgvN9g":{"text":"Love this hole in the wall! It is a little off the beaten path but worth the hike. After a","useful":0,"cool":0},"otX__brMEfm2ACm0KlpNbw":{"text":"Best burger in New Orleans hands down. The menu is limited to burgers and steaks. Burgers ","useful":0,"cool":0},"ExSUmkcesCa85nCYPA0bXQ":{"text":"This place is great.  It is not much to look at and it was quite far from most of the hote","useful":0,"cool":0},"9GtjaVLAieBlWLjuwV54kg":{"text":"Quick review : Was it the best burger I've ever eaten? Not quite. But Port of Call is a gr","useful":0,"cool":0},"1UOrEul4V2OFpF6nDXVr8Q":{"text":"Whether you are looking to nurse a hangover with a great rum drink and a delicious burger,","useful":0,"cool":0},"SVLJHEsADF0uMo3nksGshw":{"text":"So the ranch is AMAZING. I honestly wish I just ordered a salad and baked potato. Do not o","useful":0,"cool":0},"9s7cJR40ANUjkb4pJ1qgHQ":{"text":"Is always a must stop when in New Orleans. When not there all I can do is dream about one ","useful":0,"cool":0},"4uUv_h0_tGOTwZkLgpsmsg":{"text":"Best hamburgers in New Olreans, hands down!","useful":0,"cool":0},"B2K1p8vI5BjnixKMR_PYJw":{"text":"When you think of Port you think of seafood. Well theres none, just steaks, rubbery burger","useful":4,"cool":1},"fU9ktGjeAD6F0c9CFKv4rg":{"text":"Had the Monsoon, if you have one..., you've had one too many!!! Lol well worth it. The din","useful":0,"cool":0},"rK_8450aBE3CdDOIGPWssA":{"text":"While we were waiting in the line for Preservation Hall (see my separate review for that v","useful":1,"cool":0},"M61wOd6z85Rh-Fu4gblgYw":{"text":"Baby when I tell you amazing! I have always loved to come here. Went there on my lunch bre","useful":0,"cool":0},"w7Bi3XdUnvEgrzEkL5a6Ew":{"text":"Low key neighborhood bar. Cheap drinks, extremely limited menu.","useful":0,"cool":0},"JtkUuAJ7J4u4P5O_9MdSTg":{"text":"A radio DJ from Albuquerque I met on the train recommended a great place for me to get a b","useful":0,"cool":0},"c2jAoD67vennZM0NS2b-rA":{"text":"Here's a tip. If you go on a Tuesday in the middle of April when there aren't any festival","useful":0,"cool":0},"yn8J1YJQljQaAu9-kqX0Hg":{"text":"The burgers, potatoes, and drinks are definitely tasty and plentiful. The optional topping","useful":0,"cool":0},"d1YDy4vsn8S-fY0NggxKNA":{"text":"Classic staple in the city. I've been coming here for years. Great place to get a steak wi","useful":3,"cool":1},"IPM5NLSICQUyw2WLJNE_bg":{"text":"This is probably the home of the best burger I've ever had in my life. This is the kind of","useful":0,"cool":0},"EKpxEAkremjflXWoVJWQdw":{"text":"Simply said, burgers get no better then here.  The drinks are good too, but a hamburger an","useful":1,"cool":0},"mEpNiq7n0_0eUyPwaviagQ":{"text":"I'm a native. Port of Call is the shit. Are the steaks phenomenal? No. Are the burgers phe","useful":0,"cool":0},"WLl3mJ3_kNGJL3nUvzLQWw":{"text":"My boyfriend and I ate here today.  Right when we walked in we were in for a ten minute wa","useful":0,"cool":0},"-sLTUBicgF-c_sGrUaBAjw":{"text":"I like big, meaty, greasy burgers without much seasoning.  That's what this place does.  \n","useful":3,"cool":4},"ckPe9ikuOr7Jf0SEf5Dckg":{"text":"This place came recommended by several locals. Simple menu. The burgers were great, thick ","useful":0,"cool":0},"7Xi69xNJypfRsFl0cNNNnQ":{"text":"The best burger and baked potato ever! Their meat is ground fresh daily, and they add fres","useful":0,"cool":0},"q6ponttmZleOqVKnJa43aw":{"text":"I probably shouldn't have gone to this popular burger joint to eat a steak but I was curio","useful":1,"cool":0},"OEiFAR4Vp1eTwtNNrzb9ig":{"text":"I was in the mood for a good burger and Port of Call offered one up. Be prepared for the p","useful":3,"cool":1},"Vyf3eEowfGVGwWK9g6KwKA":{"text":"They say this place makes the best burgers in town, and while we didn't have many other bu","useful":0,"cool":0},"W2XYMSJFqCfdg6JAUBJAnA":{"text":"Port of Call has gotten so touristy that I really dont go that much anymore because there ","useful":6,"cool":1},"aRvnVoBXMlITJNPzrJ7geA":{"text":"Burgers here are hockey pucks and if you Luke them you have no taste. The drinks are good ","useful":0,"cool":0},"lITmZr662xtmVIWZ_Ypd0Q":{"text":"Went here with the ex and my buddy a few years back. My memories may have faded but for no","useful":0,"cool":0},"AYTzXhhD6fvBbvCc-2sNxg":{"text":"Execellent Service with some good food! Hamburgers were priced just right and overall tota","useful":0,"cool":0},"l63njqFevZeI64dDklJpcg":{"text":"Way too much food.  Pretty damn awesome...but not cheap.","useful":0,"cool":0},"KUPG6v571NQ0ItSCEvlMvw":{"text":"really dark interior.  the burger was really good, i also liked baked potato thst came w t","useful":0,"cool":0},"3wxym7IRsrCfDrSoKY06mA":{"text":"This is the best hamburger in the known universe. It's a damn fine thing. A must on any vi","useful":0,"cool":0},"wl0iFUE6J8igf7c3fZZqBQ":{"text":"Been coming here more than 20 years, burgers are still the best in new orleans. Order the ","useful":0,"cool":0},"_bUppoxKUZG0SZboVvyLEA":{"text":"After hearing \"the best burgers are at Port of Call\" a few times during my trip to New Orl","useful":0,"cool":0},"jpzV2kerHr_ANbH5hZ1bHQ":{"text":"A couple of people recommended this place to me while we were in New Orleans so my friend ","useful":5,"cool":3},"cEvk_vhvkcfp7BSsf0APcg":{"text":"get the burger and the accompanying loaded baked potato (and a few beers of course).  nuff","useful":0,"cool":0},"0Q1sIKGgVS7halgQ896Srw":{"text":"The restaurant is basically in a house! It is jammed packed up in that joint! If you are c","useful":1,"cool":0},"XpdCD30jxA92w3-zHUyPvQ":{"text":"Great burger! Man, I was so happy when I took my first bite of the burger. It was So good!","useful":1,"cool":1},"_-fG_dx6Hw0OGm6QTKfPbA":{"text":"The whole gang and I went in for dinner and we knocked back about 14 shots, 17 bud lights,","useful":1,"cool":1},"TytpnAu8rG30Zd8-cwuxvw":{"text":"I used to live in NOLA and I hopefully will be returning for good soon. On a recent trip, ","useful":0,"cool":0},"_vnDcBZ8E86fEsBBcMzEdw":{"text":"The burgers though! My friend and I went in on a Sunday night after multiple recommendatio","useful":2,"cool":1},"Oo9g9CI6m-8slQax5x2_3A":{"text":"Big burgers, big baked potatoes, big drinks, big noise, big crowds. Too crowded to meet pe","useful":0,"cool":0},"OQm-pm9YqT0m9QEzOjekpQ":{"text":"From the outside it looks like a hole in the wall, but the food is an absolute treasure. T","useful":0,"cool":0},"SirF8mC0ocNnte6NeFJEZw":{"text":"Delicious juicy simple burgers with a huge cheesy baked potato. I enjoyed every bite of th","useful":0,"cool":0},"SfdVZdafvpi9CeWiu7NAog":{"text":"Super slow. Super super slow.\nHamburger was great. Baked potato was ok. Place was a dive. ","useful":1,"cool":0},"Pwottr49DVBXzW0u7tfVfA":{"text":"We had some decent burgers and really good baked potatoes. All in all a pleasant experienc","useful":0,"cool":0},"QVpqgJfDP37RrF88hNVnuQ":{"text":"The burgers here are amazing.  Every time we go to New Orleans, we have to make a stop her","useful":0,"cool":0},"Hof44tob494xOFOp9E0EZw":{"text":"I love Port of Call!  It is our special date place.  They actually cook a medium rare burg","useful":1,"cool":0},"G6FV9PLWok_KJRpnK2UPFw":{"text":"i went to this place based on recommendation from a friend.\nhad the worst burger ever. don","useful":0,"cool":0},"ZmU6g7_2cQRoPYpMnCncmg":{"text":"Whew. We waited 45 minutes to get in this place the day after Halloween. (Hangover central","useful":0,"cool":0},"qvPQXXiWjt9oWAuG2mSzXw":{"text":"Delicious burgers and even more delicious baked potatoes. Giant, boozy drinks and friendly","useful":0,"cool":0},"GYLsPTkvbv7tYCvQvyhqDA":{"text":"Many people recommended this place including my ex-girlfriend. She begged me to take her h","useful":4,"cool":2},"2bdUQt9Ja_jhUssivCHWtw":{"text":"Finally I made it, I have been wanting to go to this place for quite awhile. This is a coo","useful":0,"cool":0},"vZNGQ3mGwU1UQgpPL4-9KA":{"text":"Best burger in town without question.  The burgers come with a baked potato instead of fri","useful":0,"cool":0},"HliuFzqmx0ourXOs_pDJbQ":{"text":"Perfect burger with all of the fixings- including pickles!  The baked potato is great too,","useful":1,"cool":1},"xVFkPZs0s63BWTTtou5vTQ":{"text":"The Monsoon is no joke. Order this drink!! \n\nThis place was delicious, authentic and perfe","useful":0,"cool":0},"Bpm3_nVQq2xcyNXd2Y2b6Q":{"text":"The burger by which all burgers are judged.  Closes at 1200 but food orders stop at 1130pm","useful":0,"cool":0},"3zjA4iLFtm_i8xsO80m1wA":{"text":"Giant, and I mean giant, burgers that come with fully loaded baked potatoes.  The burgers ","useful":0,"cool":0},"z0uJwcJy2bz1mL-1kIrpZg":{"text":"I thought the burger was just ok.  The baked potato was really good and their homemade ran","useful":0,"cool":0},"f9kfXqq2-YPOOo7yxqXnxA":{"text":"A local favorite!  The best burgers anywhere!  On the weekend be prepared for a long wait.","useful":0,"cool":0},"9ED9_okxid2qDc1Egw759Q":{"text":"Burger was good but baked potato and Monsoon were great. A little on the pricey side (for ","useful":0,"cool":0},"NWSkCuDMEcT6ZEUH-hzCGw":{"text":"Hands down the best burger in new orleans. 99% pof the restaurants here automatically serv","useful":0,"cool":0},"1jlQ3zB5QbKPQjWiqn7Exw":{"text":"The burgers are aaaaaamazing, you have basic options like cheese and mushrooms, as topping","useful":5,"cool":3},"vQfZTIyMAelrGra0FHTAew":{"text":"Not bad burger.  Not bad baked potato.  My arm candy really liked the baked potato, and ke","useful":0,"cool":0},"4x30B6QLYto0SLd4AcrC2g":{"text":"Food is great if the bartender would quit drinking long enough to wait on customers on a f","useful":0,"cool":0},"8Y3JkIooHXkjBa_AbKh52A":{"text":"This is a solid Burger and cocktail place with great atmosphere and staff. I was sitting a","useful":2,"cool":0},"d4HeTp0ixWUzHg5xBQs0vw":{"text":"50 plus years on the same corner  says it all. But if that does not impress you....how abo","useful":1,"cool":0},"yzYWejT-qww6DYmgryG8qg":{"text":"First time in New Orleans but this place was highly recommended to try during our stay. We","useful":0,"cool":0},"98N9lsgTPUHKl51U5qAv8g":{"text":"Wonderful experience for us at Port of Call. We expected the wait so we put our names in, ","useful":0,"cool":0},"7xMvaP4kYris66fAlVXm4w":{"text":"Ok, I don't eat beef. So I only came here for my boyfriend since he does. We waited for 1h","useful":1,"cool":1},"eJRZc0mjDj4JfSGiwKwxKg":{"text":"Outstanding burger. Might be the best in town. Cold beer, and interesting patrons. What mo","useful":0,"cool":0},"RIdRnD-goFQEpR2KbL_0qg":{"text":"The best buger joint in the city of new orleans.  I love the atmosphere and don't get me s","useful":0,"cool":0},"ahgTvki52istk6dxFwy98g":{"text":"You won't leave Port of Call hungry - that's for sure! I ordered a loaded baked potato and","useful":0,"cool":0},"jt7_Wdws5tsZrhoDslmQUA":{"text":"Best burgers, steaks, potatoes, and drinks in the city. I recommend the red turtle. No exp","useful":0,"cool":0},"IfQ8rCfh7G1xQ_JKyqaAQQ":{"text":"Looooong waits. Mediocre food. Sassy bartender who rags on customers after they leave. I a","useful":0,"cool":0},"XFrua4EdtvfHkGfeDkyXSQ":{"text":"The burgers were fantastic.  The drinks were too.  Staff could not have been nicer.  It's ","useful":0,"cool":0},"Qr6n_5LSkVC5LAV5W32AUA":{"text":"This place is great.  The burger was so huge, though, that I could barely get through half","useful":0,"cool":0},"xNdNhhYdZVD_7A7P5YXKOQ":{"text":"Was crazy packed when we went there considering it was the day before mardi gras but we go","useful":0,"cool":0},"gpu0TfSpbpIG61Mp9Z3_sQ":{"text":"Awesome atmosphere and great prices.  We both had the ribeye, which was mildly seasoned bu","useful":0,"cool":0},"C70tALzX0RVmss9fdsh9BQ":{"text":"Our last day in New Orleans and burger it is. I give this place 4 stars and not 5 because ","useful":0,"cool":0},"jy1oo-mGcwcsjE--PLMT3Q":{"text":"Best baked potato & the coolest owner in the world! ;)\nWe were super hungry and tried to g","useful":0,"cool":0},"TsOlBPB8GyeUyVbGiP8h5g":{"text":"Great food, drinks, and cozy. The weekend waits are long but well worth it. Prices are fai","useful":0,"cool":0},"lDuuJYtybm1ZeOlMNhgChA":{"text":"The food gets five stars, the wait for a table gets 3 stars, with service equal to 4 stars","useful":1,"cool":1},"qkgaMZia4uSdDYOfxvNXBA":{"text":"So where to begin.  A good burger, yes.  the best burger... maybe in NOLA, but not in my b","useful":1,"cool":0},"pjYidONIdhisbF9RooJL9w":{"text":"Delicious. Their burger is everything you need and more after a night out drinking. Always","useful":1,"cool":0},"n4WCJvh-vhbmCmLvV-0esA":{"text":"Ok, I have been to the Port several times, and have had the bestest times ever.  I can't r","useful":1,"cool":0},"_VNznjej7a-ouWVAM2NRvQ":{"text":"Great burger after a long night on Bourbon Street. Its a very small restaurant so expect a","useful":0,"cool":0},"z-ycPQOqCtAqt8H1t0qLnA":{"text":"I read all the yelp reviews prior to visiting this establishment during my visit to New Or","useful":2,"cool":0},"KfxXnGp1SR-firCfCDLnIQ":{"text":"Waited for a while. This bar can't handle the crowd. They don't seem worth the wait. Hoste","useful":0,"cool":0},"LfXaGKvw22FV-Cl63CKvWw":{"text":"You know... I don't even know if the burgers are \"that\" good... I have never been here in ","useful":3,"cool":3},"REucqsjUa4ov5ifwdlgWvw":{"text":"Don't understand why this place is so highly rated. The food is not horrible, but you can ","useful":0,"cool":0},"EO71nkblCkUF16YWCFspQQ":{"text":"It was really good hit the spot. I got the cheeseburger with baked potato. And they give a","useful":0,"cool":0},"k0PXM6tXtymWLPjHfmuD-g":{"text":"Please make sure you have the Monsoon it has to be one of the best drinks in New Orleans! ","useful":0,"cool":0},"CiZ27bFWN3_bvS02XyWquA":{"text":"The best baked potato I've ever had I tried here. The burgers are also incredibly good. We","useful":0,"cool":0},"fQftkShjwGfI6WW4x53ugg":{"text":"Always love the cheeseburgers and baked potatoes. My only issues this time was the hostess","useful":0,"cool":0},"iiQ4myz396amGbu5Il3X4w":{"text":"Decided to try this place while visiting New Orleans based on recommendations from friends","useful":1,"cool":0},"PXe0aS938DI3wvzZZXw69w":{"text":"Best hamburgers in New Orleans. The steaks are also good for the price. Their signature dr","useful":0,"cool":0},"Vzdhnqt1_WMBGaham3wDEA":{"text":"Good food. Nice staff. Great drinks. \n\nWorth the wait. Best burger ever! \n\nThey pour heavy","useful":0,"cool":0},"efzCKJOI3yt2sVorwfGhpQ":{"text":"Been disappointed the past couple of visits with the burgers. Today however was great.  Th","useful":2,"cool":0},"MWIoDuGZTuaWfPfIITc7rw":{"text":"So nice we came twice! The burgers are juice and taste fresh off the grill..... The loaded","useful":0,"cool":0},"bGvnWsBtwlV2OLNu7ENasw":{"text":"Nothing fancy, just really solid burgers. Juicy, good size, fair price. Can get really cro","useful":0,"cool":0},"iDFlxqhH6tgm-y7aWZtuVw":{"text":"Port of Call has been said to have the \"Best Burger in New Orleans\".  That was enough to g","useful":0,"cool":0},"KB1GnjTUPlNWFdZwznCwbA":{"text":"great atmosphere, food and drink. wish they had more steak sauces but aside from that perf","useful":0,"cool":0},"FlFQlQT1W4SO4p9DlEmUhQ":{"text":"Amazing Schooner Salad! Def try the cheeseburger with the baked potato, simply delicious","useful":0,"cool":0},"CjexP_tTjL2z-Uu4fhlnsQ":{"text":"Best burger in the city!  Monsoons won't leave you disappointed!","useful":0,"cool":0},"KihJy2vyhg6usHhzirkJVg":{"text":"I was directed to Port of Call by a co-worker late one evening while visiting New Orleans ","useful":0,"cool":0},"9FW_Yt3dtMZnw2jMLh8PIg":{"text":"I guess I just expected way too much from this place.  After going here I really questione","useful":1,"cool":1},"XUrdzkWzIK6qXwQQqIoqUw":{"text":"This place was disappointing. I ordered the pizza and it was made with frozen crust. The t","useful":0,"cool":0},"lXsRXdK9eQ_xYkR6wFMaHQ":{"text":"So...I've been hearing about this place for YEARS and finally made it in!  Yes, of course,","useful":3,"cool":2},"kt7MhpUz7SeubmhC_mYENg":{"text":"This burger and baked potato should not be missed great old place doesn't endorse the clas","useful":0,"cool":0},"q-IrhzZhKxX2aYtoQABfiA":{"text":"This was our first stop. Burgers are out of this world! Drinks are no joke and fantastic!!","useful":0,"cool":0},"-AgwE8_lghbEHx2x_Iz4hg":{"text":"IF YOU ARE IN NOLA YOU HAVE GOT TO GO HERE! (I'm not kidding)\n\nThis is no joke. This place","useful":4,"cool":1},"NLyDw87SMhm1ZXWnC-EAmQ":{"text":"good ole 838 esplanade ave. i love me some port of call. i used to of course get the monso","useful":2,"cool":2},"yIEp3udlQr4ll_IkLFOoiw":{"text":"Really good as usual. Get rid of the imitation bacon bits and then up to 5 stars.  Waitres","useful":0,"cool":0},"nyJC-DM7FfDoeqdTJlhuWA":{"text":"Best hamburgers in New Orleans. The steaks are also the best you will get at that price.","useful":0,"cool":0},"xWyaITZfUZefJb_sp0Hi0A":{"text":"Went there June 2013 and it was horrible. It was a Monday night and our waitress was waste","useful":0,"cool":0},"caROrfZ3ntuTb2Qs00Y1Nw":{"text":"This place may have great food, and we were excited to try this place out, but the service","useful":1,"cool":0},"YQfiL3rjJ5iYfW0aegxR8A":{"text":"I loved my vacay to New Orleans and Port of Call was one of the highlights. The burger was","useful":0,"cool":0},"QBJQW21C958MatgcA9J-3Q":{"text":"Yum","useful":0,"cool":0},"t69rxJOl1WKQkw3yrnJRYA":{"text":"First time at this place and was really excited from all the great reviews. Went here on a","useful":0,"cool":0},"mPuDIVl0fC-pe0UkX1BE_A":{"text":"Great neighborhood place with delicious burgers. It was a little bit of a walk from our ho","useful":2,"cool":2},"RCyA9INaozvleAn0MMrigQ":{"text":"This place is great for a hearty meal and a stiff drink. The only place itself is small an","useful":0,"cool":0},"dC6Awsh2JdHe_kyuUavH5Q":{"text":"When you are known for your burgers, and you only serve 4 kinds, they better all be good. ","useful":1,"cool":0},"WK3blQ_kaTJ3oBmwzQJ2Cw":{"text":"Burger + loaded baked potato + monsoon drink = HAPPINESS\n\nI wish I could eat there tonight","useful":0,"cool":1},"E1Mk9aQnfxHSbiJh5Z6fYA":{"text":"One of the best burgers I have ever had!. In my opinion when a restaurant only has a few m","useful":0,"cool":0},"7VHxDtyqFElJkuYcQsep3A":{"text":"We were drawn to this place randomly walking by, to a convenience store. My husband said t","useful":0,"cool":0},"TFAp29G-yOahBsZNLatBhg":{"text":"Hard to beat a great burger served with a side of baked potato. Strong drinks that hit the","useful":0,"cool":0},"6nwisqLoNRDbm2tVyAGLgQ":{"text":"I loved Port of Call.  \n\nMy husband had been before and wanted to bring me to try it.  It ","useful":0,"cool":0},"Ad60xceT2J81BF8Ezt0XCQ":{"text":"Suggested to us by a local in the area. Neat setup with dim lighting and a full bar. Menu ","useful":0,"cool":0},"VidznB3MBdXgdXhtl3In0g":{"text":"I'm always on the hunt for the perfect burger place and sadly, this isn't it. It may have ","useful":1,"cool":0},"VoAJjx7XvERLkxGkw5NGhQ":{"text":"I can't seem to give a NOLA review under 5 stars yet, it's because I've been bewitched by ","useful":0,"cool":0},"dhiXsUnFwl9c4s79xDiVIA":{"text":"This a really small spot to have a beer and some delicious burger. I went there on a Wedne","useful":0,"cool":0},"9RYRW_RENVQFNubCpkzzEw":{"text":"Supposedly has the best burgers in all of NOLA. They messed up my cheeseburger order- I su","useful":3,"cool":0},"WShsFiaTjU4ErdR5eDEuaA":{"text":"Our first interaction was with someone from the kitchen staff on our walk from the car to ","useful":0,"cool":0},"JfrdnbOYVsPTHRqJRmjOig":{"text":"Some places are just worth all the hype.  POC is one.  I hadn't been in years, but always ","useful":10,"cool":13},"vABcsIrg2Xf-WVH5FNdV5w":{"text":"Damn those were good burgers- life changing? Probably not. Have I had better? Yes. Are the","useful":0,"cool":0},"xeZYRXUl4ve8KzkKJ3cbUg":{"text":"Simply delicious. Their hamburgers are SO good. I love the atmosphere,  dark. If you are c","useful":1,"cool":1},"bLoBPXUgUuapxPQqrFGdvA":{"text":"A New Orleans staple and something to experience. \nBe sure to get one of the overly sugary","useful":1,"cool":1},"_hn1kARhFipjavfEY9sX5w":{"text":"Lets get it out of the way, Port of call is a hole in the wall.\nIts dark, its tiny, its on","useful":1,"cool":0},"kfbd1f40-vcfK6cBARXj5w":{"text":"Incredible food! Try the baked potato with all the fixin's. Burger melts in your mouth. Fu","useful":0,"cool":0},"1vzb2As9psq8CurRV9eMyw":{"text":"This is legitimately the best burger I've ever eaten at a restaurant. I don't want it to e","useful":0,"cool":0},"0WSrdOSiq9Btw1nBOSfmdw":{"text":"We discovered this spot quite by accident many years ago, and since then it has become an ","useful":0,"cool":0},"PIwHMMAlDTnt4UaC0Lmjrw":{"text":"Phenomenal burgers that come with a bakes potato.  The salads are actually quite good, too","useful":1,"cool":0},"BWECyLQa2ZSp-FETozjBUQ":{"text":"We heard about this place from multiple people -- saying it was the world's best burger. \n","useful":2,"cool":0},"rOIzwMtTTPM4rGZmDs2HTw":{"text":"Unchanged in my 25-year experience, Port of Call deserves its rating as tops among burger ","useful":0,"cool":0},"4IsTDJi8lizJT57hXyGuJA":{"text":"Absolutely delicious burgers! Loved it! Best birthday dinner ever.Best burger I've had in ","useful":0,"cool":0},"IZh5R-vjIUFaKZgdd6CTmg":{"text":"I am almost afraid to tell people about this place because it's so good I want to keep it ","useful":0,"cool":0},"QBK7MjogyP9CK01ovESF2w":{"text":"Solid dive bar with a long standing reputation.  Had to stop in while I was in town and it","useful":1,"cool":0},"iwJXZAYW77pB9ClleXX_EA":{"text":"After a full day of driving to get to the Big Easy, Port of Call was a great spot to grab ","useful":0,"cool":0},"0QEdxghKVZnYdnwXehFeoQ":{"text":"A friend said to try this place. At 3:45 in the afternoon no empty tables out of 8 tables ","useful":0,"cool":0},"y273HxdGh303wzvaYMW7ow":{"text":"Great burger and baked potato. Be prepared to wait but it is well worth it. I didn't drink","useful":0,"cool":0},"5hGjFVmskOcOH_PypYt1rA":{"text":"Omg, the burgers here are absolutely amazing. I came here from Houston by recommendation o","useful":0,"cool":0},"4JWOpNywkzy8vqc7yAapPg":{"text":"I must note that I have never left a review on yelp before. If I could leave them no stars","useful":0,"cool":0},"waBmbHbBIDpSC8qO4rZnqw":{"text":"Went here after Krewe Du Vieux because it was a short walk and we were starved, and this l","useful":4,"cool":1},"BL1706Y40t9feRlxEoW5qw":{"text":"The burgers were good and the baked potato was outstanding.  The signature drink, the Mons","useful":1,"cool":0},"Rzo7CVtRuW5g_0YlZW1v_g":{"text":"One of our favorite meals out while we spent the week in NOLA. Burgers were fantastic-- dr","useful":1,"cool":0},"BCgjFeZZJeK5q73fPS_p5w":{"text":"During this trip to New Orleans I asked for some suggestions for lunch and was told about ","useful":0,"cool":0},"_Cah6lpJeqsYR5cGMghSYQ":{"text":"It's fun, but best burger is a stretch!. Granted the burgers are huge cooked to temp, but ","useful":0,"cool":0},"x8KSkddt1nSZYbl_0O_3Vg":{"text":"Very small restaurant so be ready to wait a while. Burgers are decent sized but way overpr","useful":1,"cool":0},"oVj2dFWT9JSwwcuhDwED4g":{"text":"So...I love Port of Call. Always have. It's a staple when I head to New Orleans...simply a","useful":0,"cool":0},"IQHfHQCaggA3ViXIc6TE6w":{"text":"Wait was l-o-n-g but the burgers & baked spuds were excellent!  Well worth the wait. Thank","useful":0,"cool":0},"7JhmRs7T_PRkbLcgV-DO9A":{"text":"Delicious!!! Not sure if it was because I was jet lagged? Famished? Or a bit drunk.. but I","useful":0,"cool":0},"HgoufdIxLO5oyiHrL9DVVg":{"text":"Had the filet mignon and it was very good. Loved the baked potatoes. They do use bacon bit","useful":1,"cool":0},"TucMNHMuD2gb-i5m-YREdA":{"text":"Always Worth the wait! Any of the rum drink variations pack a punch and taste good. Huge, ","useful":0,"cool":0},"tyQu-3qmq8Lqz_Qfb6QhTA":{"text":"Best burgers anywhere.\n\nBest mixed drink in New Orleans:  Neptune's Monsoon - worth every ","useful":0,"cool":0},"8MuE9f2szBG4f6VCTegHCQ":{"text":"Somebody recommend this place and said it was the best burger in NOLA.  He was right. Grea","useful":0,"cool":0},"glSmrOJHHCCkfT2Lz0fy8A":{"text":"We had a party of 14 and it took them 2 hours to seat us so that definitely taints my opin","useful":0,"cool":0},"h-lwbe_qkqbZt4ETHEH6JQ":{"text":"Wow, what a hidden gem\n The burgers are amazing,tender juicy and delicious...and a loaded ","useful":0,"cool":0},"y8hOnWfYl5X7bGAJphtMWA":{"text":"I'll get to the point.\n\nThe Burger:  Great burger...not the BEST but it's something I alwa","useful":1,"cool":0},"Ieo1v1ypSLgFUbw1pwigqQ":{"text":"Monsoon!!!! GET ONE OR TWO!  Love this place!  My favorite stop last weekend!  The burgers","useful":0,"cool":0},"A2ovqQoPHoIE6agzUzEyPg":{"text":"wow, i always search for the best burgers in town. this may be it. i went against better j","useful":0,"cool":0},"1_Y1sAk1SXMyaLqtXapwBQ":{"text":"Port of Call...I love you unconditionally. \n\nI love you despite your dark, crowded and sli","useful":1,"cool":2},"bjRazWIZPAQ35gRNuqic0A":{"text":"Port of Call can get pretty busy, and for its small size, the wait can be long too. Parkin","useful":1,"cool":1},"F2H4k2jkMtypInKn43bAJg":{"text":"One of my favorite places in Nola!! I mean, a huge baked potato with your burger?? Yes ple","useful":0,"cool":0},"rYzV4NXMNlsZ4dBvCLzG0Q":{"text":"This restaurant was pretty busy on a Friday night, but the tables were flipping fast (GREA","useful":0,"cool":0},"i2YCyxB_7Za6qSiLYLUd6Q":{"text":"Perfect place to start our week here. Yummy burger and potato and big drinks. Locals frien","useful":0,"cool":0},"5_PmOEGEkfZ5nmdPdWZvnA":{"text":"Yes, this place is a bit of an institution.  If you've never been, plan on having a Monsoo","useful":3,"cool":2},"gUR35BQKTob4oEk6wATT7A":{"text":"Had to queue for a bit, but it was worth it. If you are sick of the whole jumbalaya spicy ","useful":0,"cool":0},"l7D3ON8OaPY3QUNK0MHbbw":{"text":"When you first walk in seems kind of sketchy because it is a little dark and small. Servic","useful":0,"cool":1},"WBkep2IdTIWFOeKA2SfuBA":{"text":"Me my wife and my brother went to the Port of Call it was a great experience good food gre","useful":0,"cool":0},"HLaRQCXRewe4R3opAMZLcg":{"text":"Beautiful burger and great drinks! Staff made you feel right at home. Place is busy so gra","useful":0,"cool":1},"XeXmj451gs1RIAyeI3NxIA":{"text":"My favorite burger place in New Orleans. The Monsoon is a great drink to take on the go wh","useful":0,"cool":0},"y3F_d55HnhnMM15K0k6txw":{"text":"Dive bar atmosphere, burger and steakhouse joint. The establishment is off Esplanade at th","useful":0,"cool":0},"Hi_GqDXKtbC3FNPJ0-MSXA":{"text":"The only good thing about this tourist trap are their monsoon drinks and loaded potatoes. ","useful":0,"cool":0},"RfLQiXOueJ4YENY8QECzqw":{"text":"Never a bad burger at port of call first place I came to when I got back in Nola and ill s","useful":0,"cool":0},"08g1NW1ZmhhSlrgY_9mOjA":{"text":"I've heard so many great things about this place from their burger to their drinks. But, y","useful":1,"cool":0},"yc7st0kbw3CkjBMU59WWvQ":{"text":"yeah yeah yeah!! i love this place!!!\n\nwe got rained out for jazzfest- it was crazy downpo","useful":1,"cool":0},"AWVf3hZG66zNsZUc3kOUyQ":{"text":"Best Burger with a whole potato!\nMedium rare, full of flavor and as big as a whopper that ","useful":0,"cool":0},"MBp5PAgHeuT6jEj5aQAlyg":{"text":"Really old fashioned place. Same menu for 55 years. Burgers taste like your dads did on th","useful":0,"cool":0},"LApT6ZQC6FaTwdNTbc8lkA":{"text":"Suggested by a local friend as we are in from Missouri for a wedding. Port of Call did not","useful":0,"cool":0},"nDPDgiwodKbowzcb0kdh-w":{"text":"Saw this place on TV and said it was great hamburgers well they weren't lying it was excel","useful":0,"cool":0},"v0Ejp-YmPWHxWjFkKLxvtA":{"text":"Had the cheeseburger which seemed like a good deal considering it came with a huge baked p","useful":0,"cool":0},"oXUQX_igIKQr_It_swYbtw":{"text":"One of the best places to get a great drink and a bite to eat! The Monsoon is delicious an","useful":0,"cool":0},"ylZSz4rMrxM84sLLo_iUDA":{"text":"Parking can be found mostly along the streets.  Make sure that you park where it's well li","useful":0,"cool":0},"tcf8HHmMNT0qG1-My7pO9A":{"text":"Top quality burger! Large and perfectly cooked with an excellent bun. The baked potato was","useful":0,"cool":0},"pPNE_d6lUV7WSTZUsxFNmw":{"text":"When I came to Nola for work, I didnt realize how many great bars and restaurants were goi","useful":2,"cool":1},"cq-US5nrEQXpfrvaw7jQRQ":{"text":"This place was packed when we showed up around noon with a few locals and a lot of tourist","useful":0,"cool":0},"8QfOcinh0d4621D8WUZqMg":{"text":"Is NOLA serious when they say this place has the best burgers? I've had bigger and better ","useful":5,"cool":1},"52A0FzIHf-ZYTyCZXM46iw":{"text":"Studying late for finals, getting off of work late, need to catch up with friends, wanna g","useful":2,"cool":1},"cf3yH52GPiuUn4LCg9kn6Q":{"text":"Absolutely the best burger in NOLA! Pair that burger with a Monsoon and it can't be beat! ","useful":0,"cool":0},"RzvfuKKbdC2MyQXB4KZYsA":{"text":"The restaurant had great drinks but the burger left much to be desired. I ordered a cheese","useful":0,"cool":0},"Rcm9TbzB_j9ajTvzCNEFXw":{"text":"We do not recommend \"Port of Call\", which once had great burgers, but is in serious declin","useful":6,"cool":1},"MAXLRWOaZjZ2_sNRBKUBGw":{"text":"One of the last places I went to eat during my vacay in NOLA. This was highly recommended ","useful":0,"cool":0},"NIJXea3mnIJ_69O3K5L3tw":{"text":"Best Burger in the City!!!!  Enough Said.  Also, monsoons are great.","useful":0,"cool":0},"ZaMAcwNVL5_rjfupPHL69Q":{"text":"One of the 3 places that are \"musts\" each time we visit NOLA (the others are Drago's in Me","useful":0,"cool":0},"JeKRFLrenxE3TYUPwwHoyw":{"text":"Great local spot.  First time in the big easy and was tired of all the French Quarter hoop","useful":1,"cool":0},"JSawYzqaPDQq1s1pD4RLGw":{"text":"I have a love-hate relationship with burgers. A good burger can cure sickness, it can make","useful":4,"cool":5},"cZeoWrrROvHbBQaZLTczzw":{"text":"This bar-esque type restaurant is on the edge of the French Quarter.  After a recommendati","useful":0,"cool":0},"Uz9wyBbdxGtxs_CvoTvvGA":{"text":"Always my first stop when I get to Nola!  The burgers and baked potatoes are incredible!","useful":0,"cool":0},"84fUjR5g5zrzyMjcZ3HeFA":{"text":"Small place, great burgers and loaded baked potato. Only bacon bits for potato nothing fre","useful":0,"cool":0},"f3tNXOCZOE7c2fatdHHtGA":{"text":"Best Burgers in the country.  \nyum\n Yum\n   YUM \n  YUM!!!!\n\nand huge strong drinks too. \"Hu","useful":4,"cool":1},"e9x80OTWksbUFKdQa3PbYg":{"text":"Port of Call used to have the reputation of having the best hamburger meal in town. It cam","useful":6,"cool":5},"jfFreoIGidu9TTKyhwe1Rw":{"text":"Simple fair but done perfectly.  One monsoon and I'm gone.","useful":0,"cool":0},"t99DP0d-F5HpErPDznruIQ":{"text":"Great burger, good cheese.  Interesting dive bar atmosphere.  Good neighborhood.  Everybod","useful":0,"cool":0},"cuwsDnKJpceHG2u-59C5xQ":{"text":"Loved this place! From the moment you step inside it's a whole vibe! Lights are nice and d","useful":0,"cool":0},"7KSLCE-Z0XC8XQQzcVwnGA":{"text":"Love Love Port Of Call. This was my second time going and it wasn't as great. But try it o","useful":0,"cool":0},"qaoc9ctOh8P9rHR_XHTgcg":{"text":"Ovvveeeerrrrrraaated! I heard this place had the best burger in town. I wasn't impressed. ","useful":1,"cool":0},"IIrKZ_BTDZsAax2yQINgFg":{"text":"Obviously the bad reviews are out of towners who have no idea how POC works. Kind of funny","useful":0,"cool":0},"EaVgaTZe1cpNEVwPjkSEpA":{"text":"Whatever you do, don't miss this.  Service isn't great, but the dive bar ambiance and the ","useful":0,"cool":0},"dHxVrJ8tJ8GlyZAS-PabBA":{"text":"Very chill ambiance. Tried this place out while vacationing in New Orleans. Servers had ex","useful":0,"cool":0},"mHhxEU5Bz-SFWgHt0s0yFg":{"text":"Overrated is an understatement.  Only frequented by tourists and suburbanites, it has an u","useful":1,"cool":0},"MS_x-xMXcvZgb15QgypmXQ":{"text":"I have been to many of the specialty burger places in town , but have not yet found one to","useful":4,"cool":2},"33NmuaOuC-QVunf25IhU4w":{"text":"A little whole in the wall/mom and pop joint. This place is one of my favorite places in t","useful":3,"cool":0},"edttTbY8P6PzJPAq2j0G_g":{"text":"This place makes good burgers but Its overrated because they serve huge cheap cocktails. P","useful":0,"cool":1},"BDWVCkQ-p568UQka8LYCdA":{"text":"This dive bar has the perfect burger to coat your stomach before a night of drinking on Bo","useful":0,"cool":0},"44PSrHmunjztgT4k2Jd0LA":{"text":"Waited a bit for a table but it was totally worth it... Bomb burgers and dranks! Fast, fri","useful":0,"cool":0},"7M2jHwsW9FyKtJzzIDEVcQ":{"text":"Been coming here 18 years and it never disappoints, drinks area spot on a great price and ","useful":1,"cool":1},"jBM0QwnnS4JrJ5byPRVm3w":{"text":"I'm always happy with the burgers here. Takes a while to get a table and get food, but hey","useful":1,"cool":1},"aTdCK6HdcWyVNs2D1o3YRg":{"text":"I ate here again over Labor Day weekend... this time in the early afternoon.   Again they ","useful":0,"cool":0},"7UImyx6Y4_mokiKLZzHV5Q":{"text":"My new New Orleans spot whenever I'm in town now. The burgers are delicious and the drinks","useful":0,"cool":0},"ecH53dn9oVD9sLgM8Xtd2g":{"text":"If I could give this place 0 stars, I would. This is neither a steakhouse or a burger join","useful":0,"cool":0},"ksTHh4UfnuZa_aoNktAJUA":{"text":"While the environment was great, and the drinks were suburb, I was left wanting when it ca","useful":0,"cool":0},"LBYLuG3no6TseuYa27WZcA":{"text":"This place doesn't have a fryer. What?! How can a restaurant in New Orleans exist without ","useful":6,"cool":1},"P0TR52s1yssP7YRNzFR68Q":{"text":"Great Steak!  They are known for their Monsoon Drink, but should be known for their steaks","useful":0,"cool":0},"ubbBZXJbqOYvrwfbWQXu2g":{"text":"Amazing!!!! The best burger thy I have had. When visiting New Orleans, it's a MUST stop!","useful":0,"cool":0},"0weecmtcaZ_XqzUFV2vnCg":{"text":"If you want the worst service in the City then head on over to Port of Call. I went there ","useful":1,"cool":0},"_oElIGGZgCOKQvadcqdW3w":{"text":"We had great service and enjoyed the environment  and food when we were there but all thre","useful":0,"cool":0},"aG6Q4b6EjUGeHBtIRG007A":{"text":"Good burger and very fresh.  Onions lettuce and tomato thick sliced and perfectly balanced","useful":0,"cool":0},"T__9-ORk0hJ81SwlOaCqCg":{"text":"Service was fast, drinks are killer, burgers are huge and pretty delicious. Best baked pot","useful":0,"cool":0},"_IVo0OKYZfvToKq88pzdog":{"text":"I used to live in Southern Mississippi and would visit my friends in New Orleans every wee","useful":0,"cool":0},"RPzvF9WWeEmFiiPi2C4KBg":{"text":"Pathetic service.  Ok... I get it.  It's a bar that serves food.  However, you'd expect th","useful":2,"cool":0},"tURsbPjRZC2ikz9M1-3erQ":{"text":"Good charbroiled burger. Baked potato was good too. Best part was the cocktail. I can't re","useful":0,"cool":0},"zddRT3DOYkm0Ze5SnQ2faQ":{"text":"It was ok.  A little too crowded and dark for much conversation.  The bugers were melt in ","useful":0,"cool":0},"YmMGsYhUW5szwkYHRQ7wrQ":{"text":"Strong drinks, amazing burger and baked potato what else could you ask for? \n\nBest burger ","useful":0,"cool":0},"QNU_W266bHL5brfcUXiebw":{"text":"I've been here before and I recall it being amazing. I got the mushroom cheeseburger again","useful":1,"cool":0},"xwF-u9dd4cL8BS3giMFCAQ":{"text":"Good atmosphere but a bit over rated I think. Burger was good but not the best I've ever h","useful":0,"cool":0},"dXVg2s26VlA5ea2uhHZNsQ":{"text":"Burgers were juicy and perfectly made. We enjoyed the good very much. The mushrooms were t","useful":1,"cool":1},"Qw-c7ik_u4MyA5yANMDozg":{"text":"OK, if I could only have one thing to eat every day for the rest of my life, it would be h","useful":0,"cool":0},"2Ufwiqee5VrwGz6PkAr8NA":{"text":"Seriously, how did I not know Port of Call exists? I've been in NOLA a billion times! A fr","useful":3,"cool":1},"LJnTe0FLvCBJn3uRlNfreg":{"text":"Just wow.. Probably one of the best burgers I have ever eaten. Do I need to say more?","useful":0,"cool":0},"xouedoqiZBzmwX6beov_mQ":{"text":"My favorite place to bring people visiting the city. The atmosphere is great, as well as t","useful":0,"cool":0},"T1ToElES-AMnoqvL58HL_w":{"text":"I went back after a year and many debates. I still maintain that the food here is lacklust","useful":0,"cool":0},"EMJpUB5culgKHl7BDURz5w":{"text":"Any restaurant that has burgers or just three cuts of steak on the menu has to be doing it","useful":0,"cool":0},"5nAZXoAQaK9AZANqUwvTNw":{"text":"Cool dive bar vibe. The drinks too sweet. The burgers meh.  I've seen rave reviews, but al","useful":0,"cool":0},"gUZLExJj4DhbosDfydSkTw":{"text":"This was our saving grace of nola. Finally some good food. Every restaurant says they have","useful":0,"cool":0},"FVdjK10mHukEvl_0mz5eSQ":{"text":"Wasn't expecting much since I came to NOLA with the thought of eating Cajun and seafood ev","useful":0,"cool":0},"EGZLaOSZdaWjTMerN8JEIQ":{"text":"The best burger in New Orleans period. Drinks are good too.","useful":1,"cool":0},"kCL79oq-kHmRzzHTYDovSg":{"text":"Came to Port of Call because it was conveniently located by our vacation rental and becaus","useful":0,"cool":0},"sBqD6l2BabrjVIyzWL2UAQ":{"text":"Went here on the recommendation of my Dad, who has proclaimed this his favorite burger in ","useful":0,"cool":0},"SeFYf1B_o6wOFIvpWQo8YQ":{"text":"Burger was cooked perfect! Drinks are always strong and worth it! It was my first time eat","useful":0,"cool":0},"1KaYumpUro8eag871ZhkFg":{"text":"Bottom line up front: A good burger, but not worth the wait, and it smells like a locker r","useful":1,"cool":1},"GQLNc28ZlrBLENJmSNy6vg":{"text":"Tasteless dry burger on a cold bun with cold cheese and lettuce that I would have been emb","useful":3,"cool":1},"x9YXB5NFj-VD9diktfN3hA":{"text":"This place was good but not great! It took us almost an hour to be seated, which I totally","useful":0,"cool":0},"lnFyh1ZUCK5z25sZd02WcA":{"text":"Here's my tip....don't sit in the very back room with a table of 8 very loud intoxicated g","useful":2,"cool":0},"fSqTgZyrhzYWuzfCr0d4nA":{"text":"Hostess was rude as all get out and blatantly ignored customers. I get that you're busy, b","useful":0,"cool":0},"hl7R7uL1tKe8lFZHlYtkeA":{"text":"Absolutely LOVED my dinner here the other night. We were in town for the weekend and a loc","useful":0,"cool":0},"wq6CxDrJUEJcIWn1WClDIg":{"text":"My boyfriend and I came here after a recommendation from our lyft driver. She claimed they","useful":2,"cool":1},"UighYhSNg6BmJrQbuPdD7w":{"text":"This place was awesome!! BEST DRINK EVER!!! If you go you must get a Monsoon. Best 11 buck","useful":0,"cool":0},"iCnOD3XwKXcVEyU8ZbtPDQ":{"text":"Soooo we came here as a recommendation from a local (with him saying they make fantastic b","useful":0,"cool":0},"_D_n2Aw5AT_tpNy6qJ5QJg":{"text":"We were visiting from California, and during a drunken night I said I needed a burger. A l","useful":2,"cool":2},"3veVD7tTF2kjN-iTX6HfIg":{"text":"Allow me to summarize...\n\n*The best burger in New Orleans\n*The Monsoon/Gombay Punch is abs","useful":4,"cool":2},"6vYm0bGPoJPgw9cwzzoxzA":{"text":"The bartender was very friendly & polite. My steak was cook as I ask (Medium/Well) & it ca","useful":0,"cool":0},"dDdsSNMXAirzygxWS-LTNw":{"text":"Unfortunately, my experience here was terrible! Although the burger was good, the service ","useful":0,"cool":0},"lYxJb4hKIh_pO3BCBcExPg":{"text":"Love this place! Staff is always friendly. Monsoons are amazing. We stop here every time w","useful":0,"cool":0},"QrCtEDFLKU14zespAh-yVg":{"text":"I cant believe some of the ridiculous nit-picky reviews here. Please don't put down my fav","useful":2,"cool":1},"kp833swsJY2Gpo2tXqAoPQ":{"text":"Horrible customer service. We attempted to eat here yesterday..entered to a very empty bar","useful":3,"cool":0},"cA_kdl9GwdymEjQUC_3enA":{"text":"Visited this place because it was in a book of the best burgers. Had a fun night out. This","useful":0,"cool":0},"JNe0d2JLZhgaBEo8pBvBrQ":{"text":"Now this place was really built up to me by some friends... they said its the best burger ","useful":1,"cool":1},"9Mn4p5r6vd9gKGvpBUW3lg":{"text":"Stop to pick up dinner mushroom cheeseburger and loaded baked potato fantastic meal my hus","useful":0,"cool":0},"sWZ5s3jw_gfzg7tqeVBnEA":{"text":"Best burgers and rum punch in the city and you can tell by the lines of customers waiting ","useful":0,"cool":0},"lgo5jm5FmuNdIXEb9oCbSQ":{"text":"Great burgers! May be a bit pricey but delicious and large portion. I have the mushroom ch","useful":0,"cool":1},"IYN_PHdWnImFgvi1bxvU7w":{"text":"Best burgers!!! This place always has a waiting line. But it's well worth it! I always sto","useful":0,"cool":0},"fzVgsinLrVV0_2Ueknli1g":{"text":"Every time I am in town it is a must visit. Consistently amazing food, the hamburgers are ","useful":1,"cool":0},"eOXtumZPppHy1Q7bzVClyg":{"text":"After I discovered Port of Call in college, I celebrated every one of my birthdays here. I","useful":12,"cool":11},"6GknXsQ547ifUl6h7jDO0Q":{"text":"We came here for the burgers after a night out in the French Quarter.  We got in and were ","useful":0,"cool":0},"Z3cmDA9x5a9Sjw84sPg6cA":{"text":"My husband and I went today because we heard about the Monsoon drink. The burgers and drin","useful":0,"cool":0},"TEqcMpdGgujEOQpnadZPvg":{"text":"Fantastic food with a terrible ending to the experience. I have been looking forward to tr","useful":0,"cool":0},"iUHR2BaTD6DNAmudwQOBOw":{"text":"Step 1: Order burger, baked potato, and Monsoon.\n\nStep 2: Play some Dio on the jukebox.\n\nS","useful":2,"cool":0},"JaPZ9qheHeKdDs6uw7jwZg":{"text":"The burger is fantastic! Especially when smothered in mushrooms. The baked potato would ha","useful":0,"cool":1},"42PHqR70FiKHIWA3xJ8GmA":{"text":"Mushroom and cheese burger delicious potato was so so, not as good as Niagara Falls...","useful":0,"cool":0},"q6iPRwbBp0y4lWg_ky7_6A":{"text":"ROACHES!!!!!  BIG ONES!!!  This was one of my favorite places, so not having been there si","useful":0,"cool":0},"-THCb88vjhvKmWkVYQ9Bwg":{"text":"First time at this place and the service was great, the food even better! Loaded baked pot","useful":1,"cool":0},"xIiMLbCGjp7mcO_w-5LVeQ":{"text":"Hamburgers and baked potatoes. This is definitely a thing. Yummmm. Do yourself a favor and","useful":0,"cool":0},"HlcG6Sb-7O3-NonR0sz81g":{"text":"Staying right next door for the weekend and almost every uber driver had mentioned this pl","useful":0,"cool":0},"uQdCAsdVTWc9KIoEwUcv6w":{"text":"First time visiting.  We dont like \"touristic\"places but everytime we pass in front of por","useful":2,"cool":1},"tj3_3t3WKSmgS9SM48kkUw":{"text":"These burgers are worth the wait!!! So juicy!! We came here again when visiting - I rememb","useful":0,"cool":1},"aV4Z-rSE4SWiJuNIzxCVsg":{"text":"This place is obnoxious, poorly staffed and the food is NOT worth the wait. I've heard tha","useful":3,"cool":0},"DvTXp9TFZq6sJWcCh4w28w":{"text":"Port of Call is practically At World's End of the French Quarter, situated all the ways ov","useful":2,"cool":3},"xBu7-fzsKXvhNHADVyDAlQ":{"text":"Baked potato was good, wife enjoyed the alcoholic beverages but the burger was bland and p","useful":0,"cool":0},"r6b3RFvddVB8dKQ8XPlSIA":{"text":"Easily a 5 star joint\n\nHoly hell dudes and dudetts, the food here is friggin amazing. I ca","useful":3,"cool":2},"Majw8ZNEx3gMMfSf_bmboQ":{"text":"you go for the burgers & they do not disappoint but the baked potatoes are out of this wor","useful":0,"cool":0},"r6kRFOSm3123xgwqZ8bUgw":{"text":"One of the best hamburgers that I ever try!!! Yummy flavor and excellent quality. The staf","useful":0,"cool":0},"SBip_JAUf260pv3wKKGPUA":{"text":"No better food in New Orleans! I've driven 2 hours each way on numerous occassions just to","useful":0,"cool":0},"5QEknwJZZ5YpqMbPJXRHBg":{"text":"love love love love the burgers here. beef ground fresh daily. big, juicy burgers. amazing","useful":0,"cool":0},"YDgZ_kCMOLjKeT4E2OOaxw":{"text":"I go to NOLA 2+ times a year and have been to every upscale and every dive. I was craving ","useful":1,"cool":0},"RA0hEWNM9XyvXKJV_AyEFw":{"text":"Port of call is a great dive bar with great burgers drinks and potatoes I would suggest th","useful":0,"cool":0},"eYNm0t29j7wpxBru5uOdfg":{"text":"Port of Call is a legend in NOLA and for good reason. The wait is usually long, and becaus","useful":0,"cool":0},"nyXbBBMf2UQQVggNFvYNGg":{"text":"I was told by a local business owner that I needed to check this place out, there was a wa","useful":0,"cool":0},"aZD2kIK2l24-EJK3rwHlXg":{"text":"One of the best cheese burgers that I've ever had the pleasure of consuming. Do yourself a","useful":0,"cool":0},"FG2qjX0oQxAOpLuuUaC0SA":{"text":"Had a burger from Port of Call today...DELICIOUS!  Worth the 40 min wait.","useful":0,"cool":0},"_Y-jAPx1dd-elNid7pus-g":{"text":"I've been coming here for years!  They have the best burgers with a baked potatoe and you ","useful":0,"cool":0},"W6BbuQJEonp9N5PVwXoKtA":{"text":"What a awesome way to begin the weekend! On a quest for a tasty meal we found this gem. In","useful":1,"cool":0},"PRN5yarHFftVDIplCvH-gA":{"text":"I've been to New Orleans twice and every time I have visited, I always manage to make my w","useful":0,"cool":0},"DBw1kH1WmI9Np9odPlUq3Q":{"text":"There was a 30 min wait... but other than that the food was great. I. Just think they need","useful":0,"cool":0},"Y8On6V4qWOJ7--lDdxcM8Q":{"text":"They might have a chronic mold problem in this place, but you will forget the musty smell ","useful":2,"cool":2},"EAyUqv9sz4A0xx2NuAoLEQ":{"text":"One of the best burgers and baked potatoes I've had!! Come to this place ready to eat!","useful":0,"cool":0},"ketkbcYRN-gYUEpCwAhhaw":{"text":"Oh my goodness... Port of Call delivered the best burger I've ever had, and being from Wis","useful":0,"cool":0},"j4MJRs6IcaHQg6bjELlSiQ":{"text":"Want the best burger of your life??? This is the place. Be prepared to wait a long time bu","useful":0,"cool":0},"KYHGV-HEVm9UA4PAIbA2Ew":{"text":"Reliable burger, but I wouldn't ever stand in line for it. We just happened to arrive at a","useful":0,"cool":0},"qrMMqliuIJm2gShgz0SQWA":{"text":"Loved this place.  The burgers are great, but what really surprised me was the filet. It w","useful":0,"cool":0},"vlz3KCeLv_ncxE7r7dcn5A":{"text":"Amazing burgers. Wow. I don't know what they do to them, but they're AWESOME! And convenie","useful":0,"cool":0},"nvy4mBDoyijTGUJvM7RIAQ":{"text":"Very rude hostess. Burgers seemed pretty-made. I remember it being better a couple years a","useful":1,"cool":0},"Lc403BMBPnYW-HKe96OTxQ":{"text":"This place is pretty special. It was just a short walk from the B&B we stayed at for our v","useful":1,"cool":1},"coss1mCgKkBSePAHGQ1rqg":{"text":"We went here during Mardi Gras after a long day of walking. The place was small and cozy a","useful":0,"cool":0},"3iFzM_xBL2aY54CAiPM-rQ":{"text":"I have been coming to this establishment for years and sadly today their service was subpa","useful":0,"cool":0},"nr03bfEppSxxR75cZe9gqA":{"text":"Food was really great. lonnnggggg wait, but it's NOLA on a Saturday night.\nLots of food fo","useful":1,"cool":0},"xjAFHis4Nokh3imlIbPQ7Q":{"text":"I have been here before and after all these years still delicious and consistent.  Bar is ","useful":0,"cool":0},"PDi-T5tryIDDHVQ-HoOuCQ":{"text":"Bike tour guide pointed as we went by and said it was really popular, good burgers.  I wen","useful":0,"cool":0},"YihJk72z5AJ-GgY19--Deg":{"text":"The girlfriend and I ate here today. We have heard many great things about the burger. So,","useful":0,"cool":0},"pafaEeKMAtXw7mngWlgBfw":{"text":"It was ok ... I think a lot of hype because it's an older restaurant ....they have steaks ","useful":0,"cool":0},"USY4mXZwcbIXMJznd2JfeA":{"text":"Home of the TASTELESS burger.  This is my 1st visit back since January 1, 2005 & the place","useful":3,"cool":0},"6cdc-pN8BB3nKYggGWyg_g":{"text":"Amazing food but this waitress was awful! We were there because our friends are regulars a","useful":1,"cool":0},"Cd3C89OXJ6GL-21bE5YU_w":{"text":"I've been hearing about this place for years and just recently decided to see what all the","useful":0,"cool":0},"pqsdTDm73lkkN3ZgfQJEng":{"text":"Celebrating a friends birthday and this was her must go place of the weekend as she eats h","useful":3,"cool":3},"dM2PsDj-ZCL6NIYhprx0ZA":{"text":"I've come over the course of the last 6 years and it's exactly what I remember. Good loca ","useful":0,"cool":0},"gH-cZB2riK0ijqB1G2ssyA":{"text":"The only problem I have with Port of Call is the parking.  Once you find a place to park, ","useful":0,"cool":0},"aLiwI_NfFzHbtphUSvhVHg":{"text":"Absolute New Orleans favorite where you cannot get a burger with fries! The drinks are sto","useful":0,"cool":0},"nSfmFivmrYd-uqpvcMZFRg":{"text":"Put it on the must-do list. Get a monsoon and a burger with a baked potato. Don't plan any","useful":0,"cool":0},"TjintP1gARBlo9pzvSPnrg":{"text":"THIS WAS A GREAT FIND! I had two recommendations for this restaurant, and thank you for th","useful":17,"cool":16},"Rm5EcY7UswXcoj9g0fK3YQ":{"text":"When you know what you are waiting for then its well worth it. Seating at the bar is first","useful":0,"cool":0},"0FVz0QhrMS0T2c8k5SuI0g":{"text":"Ran across this place when we were wondering around the city and needed a little snack. A ","useful":1,"cool":0},"jUxXwClxxbGdna819mjb2g":{"text":"I love P.O.C. hamburgers with every fiber of my being.  EVERY. FIBER.\n\nBut I have a pretty","useful":0,"cool":1},"I23enC2bxGKGWscKXfbn0A":{"text":"The best burger joint in the french quarter area. Very simple, but very delicious. The pir","useful":0,"cool":0},"2aqIIi0vQSd481fJPi1WxA":{"text":"Dam good burger and baked potato. The drinks are pretty good too! There is usually a wait ","useful":0,"cool":0},"DkRka7kD90_nML5AzCtxeQ":{"text":"Enjoying a Monsoon while waiting for a table. Had almost 2 hr wait mid-afternoon. Not quit","useful":0,"cool":0},"rIc2AhwQRJkIOpP9FAvNkA":{"text":"Perfectly cooked burger and delicious baked potato. I highly suggest ordering the \"big dad","useful":0,"cool":0},"e_BRwz_RaoCrA6xzm9muyg":{"text":"This has always been my husband's favorite burger place, and I get why! The cheeseburger i","useful":0,"cool":1},"HYboh3xqacef7CqUZuJm8Q":{"text":"This is a cool place to grab a drink. They make some seriously strong, and large, mixed dr","useful":1,"cool":1},"j4dj0tAvYyVNHINPPx0iHw":{"text":"If you like divey good eating, you'll love port of call. Words of advice:\n\n1. Ask to be se","useful":0,"cool":1},"A7yoDbT_YMJeA8SF6pbu_A":{"text":"To be completely honest my uncle had visited this place years ago and told me since I was ","useful":0,"cool":0},"ZJ7SHOZFdOo158SqD2Vqlg":{"text":"This joint is a homerun. Nothing fancy and very simple menu. Drinks were the highlight as ","useful":0,"cool":0},"dhNihwpm5wSjmEfkZP4bbQ":{"text":"Way overrated! Canned/jarred mushrooms on the mushroom burger. Fake bacon bits on the sala","useful":3,"cool":0},"VOzYxS8l-KNy_yQuni9qXA":{"text":"Delicious! They really only have three things on the menu, steaks, burgers, and potatoes. ","useful":0,"cool":1},"Ps2aZd6vqTDX0WIR39zxGg":{"text":"Port of Call has one of the best burgers I've ever had, anywhere in this country.  I'm a r","useful":1,"cool":0},"HnZI37-t4ml4Z-oDrI6vJQ":{"text":"The Port of Call has, and will continue to be a benchmark burger for me. Quality meat, the","useful":0,"cool":0},"RrGTxgOi0X9FxHhPdkLf0Q":{"text":"Located in a great section of New Orleans is a really great hamburger eatery.\nPort of Call","useful":0,"cool":0},"mYVUfN4DDkKvQkf8i9r59g":{"text":"I had bookmarked this place a couple of months ago. So I was happy to actually  go here an","useful":3,"cool":2},"Xfw4bKv8FrXXEMyUqqj8ow":{"text":"small dive bar with couple tables. pretty straight forward pizza,burger or steak. ended up","useful":0,"cool":0},"1L-QQ1ibNem7_ffu4NuPGw":{"text":"Sat at the bar cuz it was late and we didn't want to wait. Both of us got the mushroom che","useful":0,"cool":0},"PTAYLux7wD2aliwjljpVNg":{"text":"New Orleans classic. 2 meals in one! Huge filet mignon,  huge side salad, and huge baked p","useful":0,"cool":1},"NHmFa7XQKlhNaVN5oTy3kw":{"text":"Best Bloody Mary's in New   Orleans and their burgers aren't to shabby either.  Nice big j","useful":0,"cool":0},"7uv3WR8QG9sfMgWp0179qg":{"text":"Always the best.  Too bad the line is so long most of the time. If I can get there early I","useful":0,"cool":0},"jizMw86bEvcUUvz8_9LGmg":{"text":"This place is always packed, and I know why! Best burgers in town, and the potatoes are gi","useful":0,"cool":0},"2CsCi7OSnZXTR1rKWrMEfQ":{"text":"Great food, fast service, and great prices, what else needs to be said about this place. I","useful":0,"cool":0},"bPsGPLWc0qEtbUjBxgQvlA":{"text":"We love this place! We've been coming here for 40 years, even before we got married. This ","useful":0,"cool":0},"HdISGwfx_YYntJT0WwNXpw":{"text":"Absolutely loveeeee Port Of Call and I don't think there is anything they can do wrong lol","useful":0,"cool":0},"TINL7hSDc318QadEPX1cRQ":{"text":"In the Quarter or on Frenchman for cocktails?   Maybe a bit hungry as a result?   Port of ","useful":3,"cool":3},"cFCzE7LEyMrsgeJpooYqxA":{"text":"best cheese burger ever and baked potato.  I could do without the fake bacon bits tho.  th","useful":4,"cool":3},"HC8OX06SBoJDy9VdwRtMHQ":{"text":"I love small divey places like this with their well-worn decor, home-grown staff and local","useful":0,"cool":0},"B9PENpfmidKYApL0c6iaew":{"text":"What a great little place! We went on a recommendation of a friend. This was my first time","useful":0,"cool":0},"sXOV13NawouD582BF34e3A":{"text":"Amazing cheeseburger, amazing loaded baked potato, enough said. We had been feasting at fa","useful":1,"cool":0},"lwDJZqmalcvbDO3j5Ngzmw":{"text":"Burger fell apart. Had to fork and knife it \nDelicious though. No follow up from staff. Wi","useful":0,"cool":0},"wcCAzIRFAuYN49T_GlEUHw":{"text":"Any more reviews would just be piling on but it's so well deserved.\n\nI wish I'd seen the w","useful":0,"cool":0},"ZImOkuMhnuuhf2RZyV3y3A":{"text":"My family and I came here due to a recommendation from our Uber driver. At first I was hes","useful":0,"cool":0},"WnQr0HOJ9kA325dzoL_6Og":{"text":"Table of 4. We go out of our way to eat here while in town but we won't be back. The drink","useful":2,"cool":0},"0yeAwjRn4d_w4_gRdd0itA":{"text":"After devouring half of this burger, I felt sick.  The burger was huge.  It was a bit dry ","useful":0,"cool":0},"DqSd54GlPzF1eET26L8zYg":{"text":"I finally got to Port of Call when there wasn't an hour wait and got to try their famous b","useful":1,"cool":0},"J_lL09r5RUboE3Nkv5Pbug":{"text":"Overrated, overcrowded, and underdone.\n\nA dive bar that serves burgers, and not done too w","useful":5,"cool":3},"5dGGWjbXnJ9n9BwhFKzr7Q":{"text":"Nice dive bar with good drinks that don't break the bank. The pizza was wayyyyy way too ch","useful":1,"cool":0},"SoGKGM0oeyhRnTbrn7XVdA":{"text":"I can't say enough good things about this place. They're open late and their food is aweso","useful":0,"cool":0},"AGvbye5Ap_EAvBHeyIJfXQ":{"text":"Started our first night in New Orleans here.  Delicious, giant burgers and baked potatoes,","useful":0,"cool":0},"BDqvTXlQqo6CwlNe67hr9w":{"text":"I was so excited upon arrival but very disappointed once I bit into my burger. Everyone br","useful":2,"cool":0},"_xNXdS_rQwM9IpJyrZqJog":{"text":"If you want atmosphere and a large array of items on the menu, go to CCakeFactory! Now let","useful":0,"cool":1},"7UXosXrHb72H9k_evsvvig":{"text":"I had the fried oyster poboy & seafood gumbo. Both were very tasty. Will be returning for ","useful":0,"cool":0},"ZI2FjMphfwQQNKoH9ERo8w":{"text":"That was awesome!  I got the mushroom cheeseburger with potato and wiped out everything ag","useful":0,"cool":0},"4ZuLpBjANlDDwbH8hWueVg":{"text":"We didn't eat there during our stay and boy do I regret this! But the drinks are amazing d","useful":0,"cool":0},"d6wm1qW0te3hgwxeWSVftA":{"text":"The bad (trust me, these are just me being picky):  \n\nThe sitting is a bit strange since t","useful":1,"cool":0},"CkHmN9QMxD5QhlBlZPcRzg":{"text":"This place has THE BEST baked potato in ALL of New Orleans! The burgers are huge and total","useful":0,"cool":0},"PSUSB0fZpZl9YC0f0_LMiw":{"text":"Been coming here for close to twenty years... this I the longest relationship I've ever ha","useful":0,"cool":0},"o4wNL0bPHefdfIyyK--Erg":{"text":"Busy on Saturday for dinner but we expected that. The line went fast and we got a table fo","useful":0,"cool":0},"K0RSNJ5hdxSd4iibW3lFGw":{"text":"Port of Call needs a disclaimer for their Monsoon \ndrink because it is that strong. \n\nMy f","useful":3,"cool":2},"MUKbkhxfobhZ2ZoYKxT1GQ":{"text":"My husband and I ate here last night and their burgers are the ultimate comfort burger - h","useful":0,"cool":0},"EgJdIBUG9QwDJpT_qtHsZA":{"text":"Hands down best burger and loaded baked potato on this side of the Mississippi. I don't th","useful":0,"cool":0},"OYZkdc6NjCAcw3jzJZXS8g":{"text":"just looking through my reviews i suddenly realized i had not reviewed this... wth????  me","useful":1,"cool":1},"5j4Oxow8IJSug85ylmu6Hg":{"text":"Best burger! We always make this one our stops when we visit. I've only had the cheeseburg","useful":0,"cool":1},"IcXyPJ-HsZhzuLAzFiS5Yg":{"text":"Terrible lay out, extremely hard to get into, even to get around, crowded tables, aisle, e","useful":0,"cool":0},"Fj1eiIyUdgc-kWk91sV0Tg":{"text":"Monday afternoon for lunch... no lines. I kept getting recommended here to eat. I don't kn","useful":0,"cool":0},"fUr7fNPFfC4vcwzVA7zbxg":{"text":"Fast seating in heavy crowds.  Awesome service.  I enjoyed STRONG drinks and a fantastic v","useful":0,"cool":0},"s5MWr9tutD3xHzziDBzw7g":{"text":"Seriously the best burger I've ever had, and burgers are one of my two main food groups. C","useful":0,"cool":0},"nuI4wVlutdLp_XDjcLKMDg":{"text":"I don't get it. I live in the neighborhood and see the constant lines outside Port of Call","useful":2,"cool":0},"S3jSwyW4lkmO-Pto2wyTDw":{"text":"As many other reviews have stated previously, this place is tiny so expect to wait. Our wa","useful":2,"cool":0},"-ef4IZ44WB4TsTZ-S3xY5Q":{"text":"Really good burgers and drinks! Unfortunately, the hostess,Allison, really ruined my exper","useful":0,"cool":0},"w1CE386xKn502oYAI6eaGQ":{"text":"An employee I'm training told me about this place. We were working close by so it was deci","useful":0,"cool":0},"gYtKtQULxyJYOgZGFiu9oQ":{"text":"Love this old, dim, rustic corner dive bar. The staff are accommodating. The food was fant","useful":0,"cool":0},"Ei25ntb0RjtQpEp56RVq1g":{"text":"When we went on our vacation to New Orleans, the girlfriend strongly recommended that we g","useful":1,"cool":0},"AknsQYQZ9j2SK-Wmh__QFg":{"text":"This restaurant is outside seating only due to COVID. No issue for us, it was a gorgeous d","useful":1,"cool":0},"yIZsVvqX6FludvFS8_LVQA":{"text":"The wait here has gotten ridiculous but Port of Call serves a mean burger with a required ","useful":0,"cool":0},"ytBBzYwpil2mis1HA6SPyw":{"text":"I'm giving this 3 stars and I'd probably give it 4 if the wait wasn't so incredibly long. ","useful":0,"cool":0},"H24Ch9_OCT9F32w60KGY0Q":{"text":"Got a tip that this place had great burgers so we decided to give a try. Its a pretty smal","useful":2,"cool":0},"2yBhIw9a0xxZYmdcV4q9mQ":{"text":"Who would think to have a loaded baked potato with a burger?   Well guess what, it so work","useful":0,"cool":0},"Vf9KiLmcJuaQhssEZPbhaQ":{"text":"Where to begin.... well, first, let's start out that when deciding what to order, we saw l","useful":3,"cool":2},"VqTXxCDFiWdd50wZHCyyAw":{"text":"I had such a wonderful time at Port of Call.  I left there wishing I could open a place li","useful":0,"cool":0},"fJ4aZYzrqFVLgB8jAWAMdQ":{"text":"Once again the best burger and potato ANYWHERE in the country! Bloody Mary right there as ","useful":0,"cool":0},"2mx7O6DK5LAWtMMtU9ViTQ":{"text":"Sat at the bar and enjoyed watching the drinks being made.  Had a HumaHuma and a Monsoon w","useful":1,"cool":1},"s4W7IsesCqayRsDL6yrj0w":{"text":"The burgers, baked potatoes and pizza are always tasty. My only complaint is  that the cha","useful":0,"cool":0},"1GMFyHHe_ndE5CS9sWKM0Q":{"text":"50 plus years on the same corner  says it all. But if that does not impress you....how abo","useful":2,"cool":1},"4WWSbg_uq7QLfJV0kZ5Gnw":{"text":"The famous burger is pretty good if they are on that night. The place has become a big fra","useful":1,"cool":0},"Jk9yGbSZCAAPaeHJojN3og":{"text":"Very fun little pirate-esk bar and restaurant. The drinks were amazing . I love the non tr","useful":1,"cool":0},"ZZ3oQFNUAONwcLhRevi6tw":{"text":"Their burgers, baked potatoes, and drinks are phenomenal! This is one of my regular stops ","useful":0,"cool":0},"xlrK6XeJlw1mxgW3u92HEQ":{"text":"This is by far the best burger in the state of Louisiana. I've been eating here since befo","useful":0,"cool":0},"1KcMbf2xssjGKAgsTfVDKg":{"text":"Plain and simple, Amazing burgers. They're full size man sandwiches, Great drinks, decent ","useful":0,"cool":0},"TsnXRPs40zolwCY0t0yjbA":{"text":"Best burgers in New Orleans in my opinion.  You can taste the quality, unmasked by cheeses","useful":1,"cool":0},"U5Cf33CsfipCmATjQV54og":{"text":"I only go here for the Ribeye Steak! I love it! One of the best in the city. I've had the ","useful":3,"cool":0},"-PPDWTRpdMefRF0UjL4xqw":{"text":"I am traveling for work and the carnivores of the group insisted we try this place. I am n","useful":0,"cool":0},"CuoEqNS4T_L1uxZVyyvQaA":{"text":"Small place. You can sit at the bar or a table to eat. Best hamburgers and baked potatoes!","useful":1,"cool":2},"bVbdXs2X4u4Lm6nPMGCyNw":{"text":"Be prepared to take a \"doggy bag\" home.  They really give you a lot of food.  They do have","useful":2,"cool":2},"ODF4n5I2Qsh85LuEuE8h1w":{"text":"I have always absolutly loved this place, great atmosphere amazing staff and food and of c","useful":0,"cool":0},"gdqrNCzu4Biyr3AwNxCNaA":{"text":"Recommended to us by someone who grew up in the area, Port of Call was our first stop for ","useful":1,"cool":0},"oVl40ML9mtKrz5MDArM0kg":{"text":"Ate lunch here on our way out of New Orleans. The cheeseburger came highly recommended, an","useful":0,"cool":0},"XWzUhI_k6YXLJ-EvAcMT8A":{"text":"Youv'e got to try a burger from Port of Call!\n\nI found out about this place years back and","useful":4,"cool":3},"_7bUJ2jIl6Sn2Ed4wC35tQ":{"text":"This is my first stop when I get into town.\n\n For a city that's known for it's food I thin","useful":0,"cool":0},"3kRT27Cakco2UHxMAVTbcg":{"text":"Best Burgers in NOLA, specially a Mansoon Drink with it!!! It's always our first stop..","useful":0,"cool":0},"gowUWqHawNXe3_aGhLnYOw":{"text":"My favorite restaurant in Nola!!! The steaks and burgers are incredible quality meat and g","useful":1,"cool":1},"dZbOLq9JSg4ckq-cNl91lw":{"text":"A MUST on your visit to New Orleans. If you need some carbs to sober up, this is your next","useful":0,"cool":3},"yhICaFcFbBTYelKhoIDing":{"text":"I always forget about this place, since it is somewhat tucked away on the edge of the Fren","useful":4,"cool":1},"qOL-KDo19gI1p5A4sjqEJA":{"text":"A New Orleans spot! Very well known by locals. They serve burgers and potatoes , and a few","useful":1,"cool":1},"K71oY1KYTnS-0fu_bnwAzA":{"text":"Hands down my favorite restaurant my husband and I are always here for our date nights in ","useful":0,"cool":1},"E_aj5tCconPtWzoCmsxepg":{"text":"Sooooooooooo good. Fantastic burger. Fantastic baked potato. I don't even eat baked potato","useful":0,"cool":0},"KUhny6J-otTXaSG6H2Ncmg":{"text":"I absolutely love coming here.. the drinks are never a disappointment and the burgers with","useful":0,"cool":0},"C0ixrxttyJDw_UP4ZObXZg":{"text":"Awesome hole in the wall place to come for great burgers and drinks.  Burgers are filling ","useful":0,"cool":1},"2M1Vpmzvn5DWgRt8xP5zKA":{"text":"Not quite sure why there's so much hype around this place. I was told by a local that this","useful":2,"cool":0},"Pk7K8yoxGEl5TUcSKN74SA":{"text":"Loved the food and drinks!!!!! The baked potato was so soft and delicious!!! One drink and","useful":0,"cool":0},"OanHikeYNueFojqfrIK0OA":{"text":"Our Uber driver recommended Port Of Call for a great lunch option. It is a cool place. Ver","useful":0,"cool":0},"O41OmG_Txl64zl6mbRy8FQ":{"text":"Simple menu but everything was delicious! Salad, steak, burgers, and baked potatoes hit th","useful":0,"cool":0},"7imKp8v6E6HH6pRcMZejgQ":{"text":"This is one of New Orleans best kept secrets. The monsoon is to die for. Get the large so ","useful":0,"cool":0},"d8rL2xV4_30PzbKEqI1wyg":{"text":"New Orleans Icon.  I love eating here when I visit NOLA. Staff is always very friendly and","useful":2,"cool":0},"OvOQB78BihDgDMFUxSAt1Q":{"text":"We are looking for somewhere to eat different today and decided to use Yelp for restaurant","useful":3,"cool":2},"EGc0Qg721ag9CDq83XtnrQ":{"text":"It was crazy busy and crazy fun!  Great burger and potato!  We sat at the bar and drank Mo","useful":0,"cool":0},"TW7Peb6WCrjfxMqSvjI1mw":{"text":"Hit up POC for an early lunch right when they opened - a handful of other people had the s","useful":0,"cool":0},"rhEiEsHOfUlsZQDJgYNrDQ":{"text":"Drinks were great! Super cool environment! Loved the outdoor seating! Get the monsoon it's","useful":0,"cool":0},"NpxUraDincF5VXoqIrqVDA":{"text":"Port of Call has ALWAYS been my go to in NOLA.  Been coming here and bringing groups of pe","useful":0,"cool":0},"GWiN5PmbxtsdQdoixeGnwg":{"text":"My husband and I went to New Orleans for my daughters 15th birthday and we took her took h","useful":0,"cool":0},"PEGuP82CbdTYebT5W5NdGg":{"text":"I went here for the first time and i LOVED it. It's a great place for burgers and steaks. ","useful":2,"cool":1},"Dxx2hXM2CNc8Y8xnfUUZDg":{"text":"Mushroom cheeseburgers were good and so was the baked potato that came with it. We came he","useful":0,"cool":1},"5WJ1MJBRf4iigWH8Z3Rk9A":{"text":"Best Burger in town!  First time in New Orleans and we wanted to find a local restaurant t","useful":0,"cool":0},"HISZWG9-eQERXyfdkG7Cbg":{"text":"Friendly service. Burgers and potato were good but not life changing lol. Food was hot! I ","useful":0,"cool":0},"TUAAsC5I0wV4b5nlAQPSVw":{"text":"My friend and I came here for burgers since they are popular . Nice atmosphere ... I order","useful":2,"cool":0},"K7OoaXHDDmu-tHuOJ0NvRQ":{"text":"I have been going here since the 90's when I was in undergrad. I had heard post K it as no","useful":0,"cool":0},"6VkT_BXgVi5VDVdGZG7EJA":{"text":"The manager who looks like Jerry Garcia is garbage. \n\n45 minute wait\nSlow and inattentive ","useful":1,"cool":0},"6rCKyggNFk5z1WFitTTu-Q":{"text":"Food is pretty good...big salad, juicy burger, huge baked potatoes. Service was very poor,","useful":3,"cool":0},"LQgWLb-BIWMXQ8kBJh5EpA":{"text":"I Made it to Port of Call for the first time for lunch today. I had an excellent meal as d","useful":0,"cool":0},"GNlbMjtihtMrHeI6iUxyyw":{"text":"True story: I'm in love. And I've been in love since 2003. \n\nWhen I first tried this spot ","useful":6,"cool":5},"ugragzT9UsX_6OX_RYd5aA":{"text":"This place is a joke of an establishment. The long wait was not an issue, it was the servi","useful":2,"cool":0},"6VCST92Yb3hDZq1X0aX6Mw":{"text":"Bomb bomb bomb... after drinking and partying on bourbon street we managed to take the sho","useful":0,"cool":0},"MFyXw0vS-gUuqsM33wQ5vw":{"text":"I probably come here too often to really let this one review stand alone, but after headin","useful":1,"cool":1},"J1EflBGokcswiq_vbilEnQ":{"text":"Hand made burgers with a baked potato as a side. Simple place but best burger in NOLA. Wor","useful":0,"cool":0},"Y0Rr4BhkhBk8hp-mnR4-tw":{"text":"Definitely a must go spot for locals and tourists. The location is located outside of Fren","useful":1,"cool":1},"nobYVOE970epfMRhYckCgQ":{"text":"Came here months ago with my brother and the burgers were delicious and the drink he order","useful":1,"cool":0},"mfgrQLNSWPp5d-hhqobPRQ":{"text":"I am from Detroit and when we visited New Orleans this was a place that was recommended to","useful":0,"cool":0},"PM_j1EJ7__98VrsgoUcMpw":{"text":"Every time I'm in New Orleans I HAVE to stop at this gem and get a burger. Hands down the ","useful":0,"cool":0},"1QZWNKc0aHf0mPFWmWxTsQ":{"text":"Fantastic burger! The loaded baked potato is a nice compliment. 23 years since my last vis","useful":0,"cool":0},"PNI9aoeZo5qCSky4yNL-qQ":{"text":"Love this place. Absolutely delicious burgers and potatoes. One of my favorite places to c","useful":0,"cool":0},"0KhnLCK4w8Bb4iRbr4AkHw":{"text":"If you are in NoLa for multiple nights and need a REALLY good base for one of them...say, ","useful":2,"cool":0},"jmC_a21uJ5WoiPkQpgYCmw":{"text":"This is definitely a NOLA staple. I have been here at least 20 times. The menu is never ch","useful":0,"cool":0},"eQqdOoMq48GRlZr-tfVXEQ":{"text":"I thought it was weird they served a baked potato with their hamburger.  Until I had it!  ","useful":0,"cool":0},"UWo59mS5b8AlfXWB7C7pdA":{"text":"I visited for lunch on 4/20/15 around 1pm.  We got seated right away as the place wasn't t","useful":0,"cool":0},"f6BxkeHytcgl9Un0cF0Adg":{"text":"Hmm, so Port of Call came highly recommended from everyone I spoke to about NOLA so I gues","useful":0,"cool":0},"jl68n3j0njjzSNDDrgSjng":{"text":"Been years since we've been here and I can't say I was impressed.  The potato was dry like","useful":0,"cool":0},"gLk0ofT3jlQ1EtnVXyL6mQ":{"text":"I did a search for the affordable steakhouse and decided to go here. The steak was amazing","useful":0,"cool":0},"vHisSfMIits4sonfAU_JfQ":{"text":"Service was AMAZING!!!! 1st time being here and can't complain one bit!\n\nThey have a full ","useful":1,"cool":0},"c-GOX3jZ93xbmG6k0DQBaw":{"text":"This restaurant has a nice simple menu that prevents you from getting too distracted.  The","useful":1,"cool":1},"CBjeb_549391njDF8ENBgg":{"text":"This is an awesome dive bar.   Wait, I mean this an awesome restaurant.  Still not right. ","useful":0,"cool":0},"nx4lMSdjwaUxnh5BPjBjig":{"text":"Hamburgers are just ok... staff is rude!! Felt extremely sick after eating here. OVERRATED","useful":0,"cool":0},"zQIZIt4sYpUf6tQosVfbbw":{"text":"This place was fantastic! It was a little bit of a wait to sit and eat, just because the r","useful":0,"cool":0},"VIqBKlAcz4jICmQW0NAfwQ":{"text":"One of the best burgers in New Orleans! Go to spot when bringing in out of town friends. C","useful":0,"cool":0},"TbtPQ1Ycej5sFYjFxX_l2w":{"text":"I have been told that Port of Call has THE BEST burgers in the area...well, since I don't ","useful":0,"cool":0},"3TtWwLB1ETeDy8ZSDHqCFA":{"text":"Awesome atmosphere, great food, enjoyed myself first time...will be back for another mushr","useful":0,"cool":0},"qJuiVO-Bhi6OHFXatQjOOg":{"text":"True story: there was about a year of my life where I pretty must lived on baked potatoes.","useful":10,"cool":13},"Lt4ODO58kG9jLLDEp1PN6A":{"text":"Great service. Perfect hole in the wall food joint we look for! Service was great even dur","useful":1,"cool":1},"BVdjZp4TC9LGxMNrI7dbtA":{"text":"The burgers are definitely good.  If you really want something surprising, go for the stea","useful":0,"cool":0},"_sQSxwyxzY1n-B7ffM4vUQ":{"text":"Decent Burger, no fries but had baked potatoes, and the girl bartenter was extremely rude.","useful":1,"cool":0},"uMBUG0dgkAYjfN8CUwtpcw":{"text":"Thick and juicy burgers and steaks. And strong drinks to get you ready for Bourbon Street!","useful":0,"cool":0},"fHCAeQicKvP6kSRTlTPD5A":{"text":"Their potato is delicious!!!! The bacon on top is amazing!!! I love the shredded cheese an","useful":0,"cool":0},"g422mLkyW_v7jFjkd287MA":{"text":"A good burger joint for sure. I agree with the one review that said the burger wasn't SUPE","useful":1,"cool":0},"-gujLw39aLewOV-sOvcUqA":{"text":"This is one of my \"must eat\" stops when I hit New Orleans. The food and atmosphere never d","useful":0,"cool":0},"oY30OR8AWZNr_0Tv1JuNCw":{"text":"As always this place fails to disappoint.  They mushroom cheeseburger and loaded potato ar","useful":0,"cool":0},"7JLF6hqu14rl6EFb_SegTg":{"text":"Port of Call is a place I've gone to for many years and I can honestly say it ain't what i","useful":3,"cool":2},"PqNdDItNAOYkb-8EOXaAMQ":{"text":"Hands down, my favorite place to go when I'm visiting New Orleans.\n\nI love the hole in the","useful":0,"cool":0},"Ug3BiKfYy5dUQDMFEgRAIA":{"text":"I go every Friday night. It is always fun to learn where other patrons are from and it's m","useful":0,"cool":1},"zMJhTSwO2se0BHPD_JLWxQ":{"text":"Had the worst service experience ever. Manager???? Was the rudest woman I have ever dealt ","useful":0,"cool":0},"q75vyHnZ7TkRXJCh3lUqoQ":{"text":"My stepson saw this restaurant either on the Food Network or Travel Channel so we made a t","useful":0,"cool":0},"x-A8xqIt2_CZy95EQgiryg":{"text":"This place is definitely not lacking in reviews, but that is for a reason. For a classic b","useful":0,"cool":0},"6zkxhF7a335QI0yIW7hBZw":{"text":"Just had a late lunch .... while the food was as good as it is always, the service was awf","useful":1,"cool":0},"egEL48vdANo53mqfsar65Q":{"text":"A MUST GO if you are ever in the big easy.\n\nGet the burger, loaded potato and monsoon and ","useful":1,"cool":1},"5wFXYZvvSTSrCFg-klVhvg":{"text":"2 Words:  Worth It!  If you're in New Orleans you've got to visit this spot.  One of the b","useful":0,"cool":0},"b6wEB8_i8--pi704CwlwcA":{"text":"If you're looking for a filling meal and a great drink, Port of Call is your spot. It has ","useful":0,"cool":0},"ymDEGPLjGs8VPTAcLo67rw":{"text":"Great place with good food and STRONG drinks. The place is small and cozy but stays busy.","useful":0,"cool":0},"yeQdrVn6EzKLzv__On9sXg":{"text":"Seating took a while as expected. Heard a lot of reviews about this place for their steak ","useful":0,"cool":0},"Dga3W6SW4TqsDFzW3cwUmg":{"text":"A friend recommended that I try this place for my visit in New Orleans. Its really packed ","useful":1,"cool":0},"ecVz8ZNHM141sgh5rxKACg":{"text":"Legit burger!  Love that it is served with a baked potato instead if french fries.  \n\nThe ","useful":2,"cool":0},"v_gz1aAEgNfBjn3l2AKIqw":{"text":"Must ordered The Red Turtle drink. The burgers are huge and the bake potatoes delicious. I","useful":0,"cool":0},"-aDtkXsbqDbQwiYebHcKaA":{"text":"I know what you're thinking: who goes to New orleans and promptly chases down a great burg","useful":0,"cool":0},"h64F_tc1NkWpE6p63Bom7A":{"text":"This place is a classic dive bar, but with one twist. They have fantastic burgers, I have ","useful":0,"cool":0},"wRrDbi6-qzBPD7H8mOBNsg":{"text":"We come to New Orleans every few years and many people have told us about this place. It w","useful":2,"cool":0},"F1nr0d-fUxRGLhXWHWSOQw":{"text":"This place is just unreal. Eaten a million burgers. None better than Port of Call. Perfect","useful":0,"cool":0},"g634oL7teSiYcrm2WSr0Dg":{"text":"One of your employees needs to be a little bit more educated and less MOODY with the peopl","useful":1,"cool":0},"trmSsCmT8UriWlWSUrN8Sg":{"text":"Just go. Seriously. Best burger in New Orleans. Menu is simple. Good drinks. Expect a wait","useful":2,"cool":1},"vZBmVX-0N5ABWzxo2YoTdA":{"text":"Read about the burgers.   So, after a very long, hot bike ride, I decided it was time to c","useful":0,"cool":0},"ACiNsZigbBTiUwksf8RLxA":{"text":"The menu is small and to the point. Loved that. \nThe burgers here are great! --very homest","useful":0,"cool":1},"7E3dNnmTD-faLDTGQUUvNA":{"text":"The best Burger in the south, I never miss it while in NOLA!","useful":0,"cool":0},"mek8BN8GLcKrU8glO4m6dw":{"text":"The burgers were SO UNDER COOKED neither me or my partner could take more than 2 bites. It","useful":2,"cool":0},"5Dq9MmDKHM64qIrIt2uJqw":{"text":"Holy shit, the Port of Call. This is one of the first restaurants I ever went to in New Or","useful":1,"cool":1},"E09qMn6uQkjYsAcD0L0wrg":{"text":"Hostess is a bitch. Plain and simple. Don't waist your time eating here because she might ","useful":1,"cool":0},"tKHF0W95VZwYkGRrqf77OA":{"text":"Everyone in New Orleans raves about Port of Call and how they have the best burger in town","useful":0,"cool":0},"sa3G0azWxm6FDRfRH8by5w":{"text":"Every time I visit, this is the first place I need to come to. The burgers are the best bu","useful":0,"cool":0},"5MKipKfQ_xeNSDJho1q_kw":{"text":"This place is completely over-rated. It isn't what everyone claims to be. The burger was d","useful":1,"cool":0},"afxbHjsbH4o8GVAz-hKkNg":{"text":"Thank god our uber driver suggested this place! It's definitely a hidden gem in the French","useful":1,"cool":0},"WfT9NOtGdhdQb21OfQmDvw":{"text":"First of all let's get it out of the way that the service blows. BUT that being said the s","useful":2,"cool":2},"-PHLvOTTt0srCNwaQEdmdA":{"text":"Ok. What is this burger. This was recommended to me by a friend so I yelped it and came. M","useful":0,"cool":0},"VBjPoaiTCRlupXiEIweXgA":{"text":"Awesome food, but holy cow is it a lot.  It has a very limited menu, but what they do have","useful":0,"cool":0},"EF3pOTJyOuCJfK3zKg_nNw":{"text":"People must come here for the drinks (which I didn't have at lunch) because the burger was","useful":3,"cool":0},"oWhGGnzQxbpGy54bKuJYtA":{"text":"Port of Call is a great spot for a delicious burger and baked potato and a cold drink.  Th","useful":0,"cool":0},"sRgtwSlkUvYsEcMon7Xczw":{"text":"Great burger, good steak, excellent hanging out either on the sidewalk or at the bar and t","useful":0,"cool":0},"ga8Un434CARF_Zbxg6kpCg":{"text":"Haven't been here since before Katrina. Nothing at all has changed, and that is high prais","useful":0,"cool":0},"bibWn5GFdAwMCeGkPzVzFw":{"text":"3 words...Best Burger Ever! We placed a to go order--we had the mushroom cheeseburger medi","useful":2,"cool":1},"iK0JJ6wk43cQt1CUIaIiEw":{"text":"Food great, but service appalling. Bartender possibly homophobic? Or just a big, sullen je","useful":2,"cool":0},"Zcv48rUz4VvmtGpcS-FWCw":{"text":"Great hamburgers! Who would have thought a baked potato would go with a hamburger but it d","useful":0,"cool":0},"oD4n0PMDfrcXav8nphknug":{"text":"Best burger in town. Better than company burger. Char grilled and juicy and falls apart. L","useful":0,"cool":0},"L6D45AFT7LdQEXBSpaiZJg":{"text":"Came back again it is a must do in this great city love love love the burgers and drinks!!","useful":0,"cool":0},"5OXumc72l1Zw5Pn3IT0qdQ":{"text":"Great food! We arrived late yet the food hit the spot. Will definitely return. Was surpris","useful":0,"cool":0},"snjx_dH7bz7BaGEFqIe3AA":{"text":"I can't believe I haven't reviewed this place. Port of call is a New Orleans institution a","useful":4,"cool":4},"thPgXBBc4FBmRSrnZGfS0g":{"text":"PORT O CALL\n                                        https://portofcallnola.com/index.php/m","useful":0,"cool":0},"8gpzCWuFan-uRvixk_kUbw":{"text":"Great burgers. One of my top ten favorite burgers, for sure. Yummy rum drinks, too. Friend","useful":0,"cool":0},"sucBJtZ5YK37ZZRs32p_DQ":{"text":"STABBED and mauled its local rep after Katrina by catering to the FEMA crowd;\nIN the curre","useful":6,"cool":2},"bbOBRPzHIz-udQTo0p8toA":{"text":"Pretty good burger! Popular place with a decent wait time on a Friday night. Order a Monso","useful":0,"cool":0},"omPNR4wLutAmYI9l4iHUjQ":{"text":"Great burgers! The Monsoon is a drink that reminds you of the Pan Galactic Gargle Blaster.","useful":0,"cool":0},"I4Ki43S_fFhtTwYLkyXUlw":{"text":"The waitress we had tonight tried to take full and complete advantage of me and my party .","useful":1,"cool":0},"fxhpOuMKp3bbSyXyiJGEuA":{"text":"This restaurant is one of my favorites in New Orleans. It's all about the atmosphere, that","useful":0,"cool":0},"r3Bmr-v6r-aw6J2ZF07TAQ":{"text":"The best burger I've had in awhile.  I sat at the bar, ordered the Mushroom Burger with th","useful":0,"cool":0},"p09u1W2oGLLHkuGJ7pc6vA":{"text":"Both 1 star and 5 star ratings are absurd for this place.\n\nI can really get down with a bu","useful":2,"cool":2},"e0oYDBHI-p8IY55OPy9n5g":{"text":"Super yummy! I got the cheeseburger medium well and it was great. Not greasy but still moi","useful":0,"cool":0},"176oOAcRWfsgKAOpPyLDIg":{"text":"A simple menu and good burgurs but if you hit it at the wrong time of night the service is","useful":0,"cool":0},"LFrV_pFjm57j48ROhq-_HQ":{"text":"My second and final night in NOLA.  My pup and I headed out on foot to see what we could s","useful":2,"cool":2},"dqXk_hMJsUp4cTmrnQo6Qg":{"text":"Large fresh burgers with shredded cheese! Tasty! Very busy, so plan to wait at least an ho","useful":1,"cool":0},"WgUCSL1_o6TcX_r3iQurIg":{"text":"Oh my gosh this is a must go to for NOLA!\n\nI thought this was One of the best burgers that","useful":0,"cool":0},"29rU3o4ysqOV-EDYPo_cCg":{"text":"By far one of thee darkest bars I've ever been in. The bar tenders are some of the friendl","useful":1,"cool":0},"6JwqS0CzkggDMuCBYaO61A":{"text":"I'm giving this a 5 and I'll give 5 reasons why.  1) Its a hidden gem but yet everyone kno","useful":2,"cool":1},"tj4qUEDcjq21HZIXmFn8GQ":{"text":"So my buddy Eugene was like \"we are going here because they have great burgers\" and I'm li","useful":0,"cool":0},"6ALPRfKBb4UAGxSx9PgQpg":{"text":"If you get here at a certain time you will wait! However the wait is worth it. The hamburg","useful":1,"cool":2},"eESCkzKP_uwVQ8h9MeF7hg":{"text":"The burger and loaded potato were so good! First time being there and was not disappointed","useful":0,"cool":0},"2yYLeetg6jKha13vbj8YwA":{"text":"1 star because you can't leave 0! Walked up and got on list for dinner for 4. Several part","useful":0,"cool":0},"paaTs1WKWxir_qXoTSBM4A":{"text":"The drinks are strong AF and the burgers and so tasty! I normally don't like baked potatoe","useful":0,"cool":0},"IVtZqu1ROsSycdjeLp6RQA":{"text":"Amazing food amazing drinks sat at the bar with fiancé and pigged out nice size burgers ba","useful":0,"cool":0},"mU2Z6V4Hnw2GiHU8WXsoPQ":{"text":"A neat little place on the far side of the French Quarter that serves up an excellent chee","useful":1,"cool":0},"a8GsC4_NNu2Sd8OZIaehkg":{"text":"Burgers & potatoes are great. Large portions. Beware of the drink called the MONSOON...if ","useful":0,"cool":0},"NCSXBNa22-ozDLr1jCVc7Q":{"text":"I love a good burger but was sadly disappointed with this place.  The service was terrible","useful":1,"cool":0},"Lztv4yXtvMWe4AhCYh6Kxg":{"text":"Everything tastes like sour cream. Unless you add some\nBBQ sauce to your plate, in which c","useful":3,"cool":4},"znm2epg8n0P3ONANUgIwHw":{"text":"I have visited this place many times since Mardi Gras of last year. In addition, I have in","useful":1,"cool":0},"zr-Ubqpyqa8KuJxPUeoZ3g":{"text":"What was once a New Orleans classic has now turned into an ordinary and disappointing burg","useful":4,"cool":0},"GVv7wPo6LvyMecETpbadvg":{"text":"Because you have to.\n\nLiterally.  HAVE TO.\n\nYou walk on in to the small, dark surroundings","useful":2,"cool":0},"oTlChjtaLIkPDdfCb7YkBw":{"text":"Big baked potatoes, bigger burgers piled high with cheese, and even bigger drinks. Yup, Po","useful":0,"cool":0},"uPWSB200DT0AeW9ih237_g":{"text":"Love the burger and loaded baked potato here.  It's the best and so is the monsoon drink.","useful":2,"cool":1},"v2-1rW02lseERj5k8-_7oA":{"text":"Wow...I RARELY ever leave negative reviews,  but holy cow.  This place is well deserved of","useful":1,"cool":1},"ivTrFdxPBedxr1o2IkEThQ":{"text":"What's more New Orleans that burgers, Booz and making new friends by eating a meal at the ","useful":6,"cool":3},"fXjMQXiU_M9uaOJ8IfedRw":{"text":"The Monsoons were delicious, and the burger was juicy! Would definitely recommend for a go","useful":0,"cool":0},"h0QxvNGQZnvLWNF_hwmxBA":{"text":"I have been going to port of call for over 30 years. I have made friends with the employee","useful":0,"cool":0},"IcLzboP1IjZMbO4Uu1SX-Q":{"text":"This is one of our go-to restaurants when we visit New Orleans! The best burger I've had a","useful":0,"cool":0},"qelPyt5NKZFvYkOv1mQazw":{"text":"Loved the Port of Call! There is a bike rack conveniently located near the entrance for al","useful":0,"cool":0},"M59yqam77T8SqAvDDvBzNg":{"text":"LOVE IT!!!!!!!!!! \n\nMonsoon & hamburger (medium) always in order!!!!!","useful":6,"cool":5},"7uMG2B1n3z8hE8iIbGZGjg":{"text":"Best Hamburger I have ever had that did not come off my personal grill.\n\nBest Baked Potato","useful":1,"cool":1},"625V5HuKyx14aB-LgJQ6hw":{"text":"Best burgers of my life! I couldn't believe how juicy, cheesy, and intensely flavored thes","useful":0,"cool":0},"og-yXDnzNclzTblTH0aIug":{"text":"People that give this place less than 5 stars are not looking at it for what it is. \n\nThe ","useful":2,"cool":0},"OpvLpA4Gb2vgi3s5n5s2jA":{"text":"Best Bloody Marys ever. End of story. Incredible! Pickled green beans? YUM! These guys are","useful":0,"cool":1},"bok0P4ZUO-7ML-HBcKIRaA":{"text":"I would not recommend this place for food. The drinks here were decent. But the food was n","useful":0,"cool":0},"RM0AjlDYLdG3q1zpAFwuMQ":{"text":"Best cheeseburger ever with a mound of shredded cheddar?  Yes. Hottest, fluffiest, most to","useful":0,"cool":0},"pvpP-h9LfpBFtrYG_bhnJQ":{"text":"Note to self: I really love this place and I need to come back next time I visit. Also, Ca","useful":0,"cool":0},"zHoLVR4NCxaZNwwxJm2QIA":{"text":"This is one of the best kept secrets for locals in all of New Orleans. They have some of t","useful":3,"cool":2},"v0psw-4JnS-zzANzountsw":{"text":"We all had the burgers. They were amazing. This place is well worth the wait. Service was ","useful":0,"cool":0},"z34J7xcHpV-vMQ7qaRjQjw":{"text":"Be prepared to arrive starving, establish a solid buzz while waiting for a table and depar","useful":4,"cool":6},"6kE49Rgff23fvOdS2HDgkQ":{"text":"After our dinner plans on Frenchmen Street failed, we took a nice stroll to Port of Call w","useful":2,"cool":0},"ZiTYEeKrSgdZECXs3cYHNg":{"text":"I was a huge fan of this place when I was in college (pre Katrina) so I was really looking","useful":2,"cool":1},"4PYKJAtU8NC7DlBBnG1fjQ":{"text":"So glad Port of Call reopened during COVID.  They are observing the pandemic by offering o","useful":5,"cool":1},"L_JnKB2f71rqN7YLaYCsiQ":{"text":"Ok. I have only been here 5 minutes and I already love the service and drinks. What a nice","useful":1,"cool":1},"tSYFsUZT5EkElx81Nghxkw":{"text":"The burgers and bake potatoes are HUGE and OVERSTUFFED!!!  The drinks are 90% alcohol and ","useful":0,"cool":0},"S_s9ewY30wjMgZ-G6pfQ_w":{"text":"I am very disappointing with Port Of Call, based on the reviews I had high hopes for delic","useful":0,"cool":0},"xSW245JjrVTKZbcwaT7Tfw":{"text":"Finally, locals! I hate tourists. And this spot is tourist free and I loved it. The ambian","useful":1,"cool":1},"S_RNkwrDryJVdxKW1nD2Cw":{"text":"After numerous suggestions to try this place out...on our last full day, we made our way h","useful":0,"cool":1},"F4CYPs2HjcTr4P7lXK-QJw":{"text":"I'm going to do a musical tribute to POC. Or at least, try. Picture it:New Orleans, 2016. ","useful":8,"cool":5},"OzVfVDXz_w5QsK9fYsB3ow":{"text":"I have and will always love Port of Call. Their burgers are amazing and always cooked to t","useful":0,"cool":0},"t40PySiwI8YXK51-WKHfcw":{"text":"The food was great with huge portions. We went on a Saturday night, it's was very crowded.","useful":0,"cool":0},"WND-XBv4WrYreBnI7OG--A":{"text":"OMG!!!!  This was our favorite meal during our 3 day stay in NOLA.  We visit NOLA frequent","useful":0,"cool":0},"3do-CjUMgdDHEwDFhD7yCA":{"text":"Delish.  I got a burger and we all got whatever the big strong drink is - and it was, of c","useful":0,"cool":0},"6ewoyQRRdquiVlrJhW5RKA":{"text":"Visited in November 2020 (sorry it took a bit) We went as a group and it was good food in ","useful":0,"cool":1},"UMtL4II9c4T7mO4UQAJYpQ":{"text":"Heard this was the best burgers in town and had to come see for ourselves! Port of Call de","useful":0,"cool":0},"9PeU1BvhdQAbXnWVHSZArw":{"text":"Went to this restaurant back in January because it was recommended by a local. Was told it","useful":1,"cool":0},"SkjR54XCZYQop5gtxwjwyQ":{"text":"We ate here the evening before Fat Tuesday and had a great dinner.   We had to wait about ","useful":0,"cool":0},"gzlX4XnbPZrcPnl6VOfiuw":{"text":"Always a great time.  If your chill, service is great.  Go there to have a good time, not ","useful":0,"cool":0},"krJm-ruS93KJ28aTzCQ5Pg":{"text":"Port of Call has been on my list of places to go for a few months now. I finally got the c","useful":1,"cool":1},"xbwN8W7dx84uwoV2W_BFMQ":{"text":"YUM YUM and YUM! i love this place and go back often the best burgers in the city (even ne","useful":1,"cool":1},"3dveFuOVSh0fOLt5GisTPQ":{"text":"Port of Call is one of those places you don't want to miss. Their signature drink, The Mon","useful":1,"cool":1},"PQxZho7W35dFanJwddA6qA":{"text":"High priced dive crap hole. Served us raw bloody burgers and potatoes with the cheapest fa","useful":2,"cool":0},"Vvk3Dlym19xqMdGSfaxpNg":{"text":"Really good food, laid back vibes. This small dive bar has a really short menu that they d","useful":0,"cool":0},"uGGpXE5iUgr7UT-VXp_J2A":{"text":"Hamburgers are great and served with a bake potato for a twist on the usual hamburger and ","useful":0,"cool":0},"87GNJld3_KGiujGjDRPt5w":{"text":"I can't believe I haven't reviewed Port Of Call before today.  Ever since I was first intr","useful":5,"cool":2},"_Xjm_-H_O7OUgPl1_FVMNw":{"text":"Burgers and Potatoes were excellent! I was confused at first when I walked in, just a larg","useful":0,"cool":0},"EEy6yoIiunJqp88bSymeCw":{"text":"Don't listen to the tourists who don't get it.  This is an institution.  Dirty, dark, and ","useful":2,"cool":3},"5pV1xpdL5QJjaa2Cfj0vZw":{"text":"Huge baked potatoes\nHot, juicy burgers and steaks. \nOh, and salads too. \n\nThat is the menu","useful":3,"cool":4},"ElJzYw3dzlFK6cnuuN5--Q":{"text":"Was in town for my friend's bachelorette party. We walked in Friday night as a party of 6 ","useful":5,"cool":1},"9YAzGWldUUan3xgvk0bNng":{"text":"Went there on a date a long time ago. Steaks were superb! It was always the place to go in","useful":0,"cool":0},"PxU-tfSfvO7PaBsu-nSl2g":{"text":"Great burgers and the Monsoons are really good too, but they'll sneak up on you.  Probably","useful":1,"cool":0},"ES7LuPD6pW27ETOY2PcHnQ":{"text":"Cannot leave this place without a full stomach! A hearty burger with shredded cheese and l","useful":0,"cool":0},"GJYHm1RQtn_sP5EseLQJHw":{"text":"We heard great things about their burger, but when we arrived the servers were very rude a","useful":2,"cool":0},"y9aNcUWMzwZl6waREOq7qw":{"text":"Monsoon? Good. \nBaked potato? Good.  \nBurger? Blaaaaaaaaaaaand. \n\nI couldn't add enough sa","useful":0,"cool":0},"hCgoivSWSXCS19ge63KJ8w":{"text":"I absolutely loved how simple and straight forward their menu options are; nothing fancy n","useful":0,"cool":0},"qUyXfvLR9croOgGT-UD2OA":{"text":"If you want a local \"joint\" off the beaten path....hands down the best burger I ever had. ","useful":0,"cool":0},"R8IpamamZoOoGNs3loHeoQ":{"text":"I have heard of Port of Call for years from friends that make the trek to New Orleans ever","useful":4,"cool":4},"6vbySh2RQPp8fwSEfkYLVg":{"text":"I've never experienced a more racist experience then from this manager Steve. If you are a","useful":1,"cool":0},"L0uyPNsTtYFKbrvF5FAi4w":{"text":"Best damn burgers in the state. Disagree with me? I dare you. Get extra sour cream and but","useful":1,"cool":1},"JIr3d0tXhgOWRzCTyLUT4w":{"text":"meh.  Yes, its an institution, I know....but inasmuch as Lafitte Blacksmith is to beer, Po","useful":1,"cool":0},"hm1KTEgA-7-vIyoH87Nf1w":{"text":"Ate at port of call over the weekend. I would have to say this place is overrated!!!! I ra","useful":0,"cool":0},"JFEkdQE8PtotOMLEQyNpmg":{"text":"What a find!!! Neptune's Monsoon, and the best burger in NOLA!! If your looking for a burg","useful":0,"cool":0},"fuxQ9BcCVamfxYGlkOc6Mw":{"text":"Well, this is cool that my first restaurant review after moving to New Orleans a few weeks","useful":2,"cool":0},"2LM7Vsiby98JLkZnXbVU1w":{"text":"This used to be. The burgers and baked potatoes are pretty good. The burgers are the real ","useful":0,"cool":1},"0In2QAHyTgY37asHgkNg5w":{"text":"I waited ten years to go back to this place! I've dreamt about those burgers, monsoons and","useful":1,"cool":0},"Xr6QGtSWKEou4GpGEzbHnQ":{"text":"If you're looking for strong drinks and an excellent burger, go here! Seriously! This is w","useful":0,"cool":0},"xXOCDmBPbc0bqnVwNgPHrw":{"text":"The folks who run the B&B around the corner swear by this burger and I will forever hencef","useful":0,"cool":0},"o0_afRORzY3f_MLR_sV5xQ":{"text":"Best baked potato I have had in my life! Hands down, they are magical. My waitress was gre","useful":1,"cool":0},"57VA1SlmIY8i4dYUCEpjtw":{"text":"Great burger and drink at this small bar/restaurant on Esplanade and Dauphine. Just Walk a","useful":3,"cool":1},"-bx9esBfUB8qQ4cvuzWKZQ":{"text":"By a show of yelps, how many people here have been caught in an epic rainstorm, risked cat","useful":0,"cool":0},"kDp6XNC-iJLdZMPozzzyyA":{"text":"TWO STARS BC THE FOOD WAS OK. My friends and I decided to eat at this establishment on Mon","useful":1,"cool":0},"49VWcOj-9uEcvGSOJ8k0fg":{"text":"I came here twice during my stay in NOLA and the food was delicious both times. (I'm obses","useful":0,"cool":0},"MfKsZekX4nUM2X7T_3zRGA":{"text":"Nothing wrong with the burger, it was OK, but what's with \"#1 burger in N.O., as described","useful":1,"cool":0},"Tf7VOHjTQ4t3EQ1gTS23xQ":{"text":"Good burger, the kind you literally can't put done between bites. Baked potato was the per","useful":0,"cool":0},"07hCdQ2dXow9ciy4M_FQmA":{"text":"I think people like it here because of the nostalgia, but I never saw the hype. The fact t","useful":7,"cool":3},"TqNb4LhYXaixtgkzYXjwkA":{"text":"The burgers are awesome, I've been here about three times now. The first two times it was ","useful":1,"cool":1},"xd18p6zdYc-wnSD8rTBXew":{"text":"I enjoyed the mushroom burger and the baked potato it was delicious not to mention the Dri","useful":0,"cool":0},"55BVQxPIk5SAPzrYVQ1s9Q":{"text":"Burgers are amazing here! Worth the wait! One of NOLA go to eateries! Loaded bake potatoes","useful":0,"cool":0},"vl7EdTU8mF2DULJQ5qrr9Q":{"text":"This would be a regular haunt for me if I moved to NOLA. Why? It's sheer perfection. From ","useful":40,"cool":43},"EGXEMfgUHhPFVMCg4Bhn5g":{"text":"This place is damn good.  I was too hungover to try a Monsoon, but a big greasy burger and","useful":0,"cool":0},"yrwK2FkcTlSlcKnBkGp3LQ":{"text":"I had a great time here and I don't even eat burgers. I got a salad which I bet no one at ","useful":0,"cool":1},"Mx6-jiwUnCltFKy2XNrs1g":{"text":"Awesome place, mushroom cheeseburger medium is a must, drinks jumbo a must. Great service ","useful":0,"cool":0},"X5uGvsWsuxOtT05AIJtC7A":{"text":"Come for the world famous cheeseburgers and baked potatoes, stay for the monsoons. Oh lord","useful":1,"cool":0},"sUM4gp3LCHATYB_1CHT6fg":{"text":"1st visit to Port of Call and it's well worth it. We saw this place on one of the Food Net","useful":1,"cool":0},"QSxMNWFTvWWQ3sDcBc-_tw":{"text":"Another tourist trap near the French quarters. Food portion was small and hamburger looks ","useful":3,"cool":0},"NCPGR_7FEZvkTExqbx8uVw":{"text":"This place is an absolute JOKE. If you're looking for a place to have the worst service of","useful":3,"cool":0},"2MiVQAEKRx2iPXzscKHv-Q":{"text":"OMG! I love this place so much it almost brings a tear to my eye! I have always loved Port","useful":2,"cool":1},"BhGhhUfoQi9jehDb4bL__Q":{"text":"Don't want to knock it- but the burgers are good (not out of this world).  It's definitely","useful":1,"cool":0},"WiGxV32HFmXoqhyIVHihJg":{"text":"I've been coming here since I was little and they used to serve dark and stormys in copper","useful":1,"cool":1},"IzN4V6FID4QZ3IyVTQjM6g":{"text":"Burger was supposed to be cooked medium- it was more on a raw side. Bartender (didn't give","useful":0,"cool":0},"iG9UbmT1f_ButVyIJb6qmw":{"text":"This is my favorite burger joint in the city of New Orleans. Great vibe and no fries allow","useful":0,"cool":0},"N_THaFQdQw49K67gmjaB2A":{"text":"All I have to say is that I was not impressed and it did not live up to all the hype that ","useful":0,"cool":0},"HPb2AqLBE4KiE4d3o9AIPA":{"text":"I am back in New Orleans and I have to stop at my usual spot. I don't know what it is abou","useful":0,"cool":0},"_fjfoZADU-nz7sWDf6IwKA":{"text":"I heard a lot good things about this place and when I went there I realized something. The","useful":2,"cool":0},"UtuS43FpLE5ai9fwy80yrw":{"text":"My stomach regrets coming here, but my spirit does not. I will blame it on the virgin hurr","useful":1,"cool":1},"z__wx22vYEU1djunVQurmQ":{"text":"I'd like to be able to just rate the food, which would have been a 4. However the service ","useful":1,"cool":0},"ThiEFYWJQHGFzpZM-LT9rw":{"text":"Last night was our very first visit to Port Of Call. I was looking forward to dinner becau","useful":0,"cool":0},"rhmrcCSHbRYCyejnrKAf8g":{"text":"Once we got In the restaurant we waited 15 minutes to be seated at the door before someone","useful":0,"cool":0},"UQyeqONl70KeKjcUYW1V6A":{"text":"Stopped by Port of Call for dinner on Memorial Day, 2016. I was not at all impressed. We d","useful":0,"cool":0},"FiR86_EL6fgFuRLsAfrC4g":{"text":"Best baked potatoes and good burgers. Not the best in the city, but good. Love the shredde","useful":0,"cool":0},"HwlHUbLJhwN769iRazwYAQ":{"text":"Big juicy burgers and the bombest Monsoon in all of NOLAS!\n\nMy homies and I stopped by to ","useful":5,"cool":3},"kkERIq7G9eyDslT5OAIARA":{"text":"I have always heard that the burgers here were the best in the city, I am not from  N.O. s","useful":0,"cool":0},"Zvsgg3HmozIgW0SxxEiOoA":{"text":"Service was quick and accurate! My cheeseburger and baked potato was so good! I decided no","useful":0,"cool":0},"2bp7G0PuEDbqE5tqSrNINA":{"text":"My boyfriend and I ate here last Saturday and the burgers were delicious! This place is of","useful":0,"cool":0},"hpLiIcXwkz2obeLaiZ48nA":{"text":"The entrance is a little confusing.  You enter and then stand on the walkway until a staff","useful":0,"cool":1},"ZS_f0npBC6CklxnMx22-jg":{"text":"Hamburgers are out of this world. Served with a fully loaded baked potato. Dark but they p","useful":0,"cool":0},"mFflaFfAOAWdXEl9lLMLIw":{"text":"Come for the drinks, which are good and somewhere to go if you are just hungry for a casua","useful":0,"cool":0},"N4lJ-gqIaFj5zn2njKEIyQ":{"text":"This place never disappoints. Get the monsoon. Boozy and delicious. Food is great too. Alw","useful":0,"cool":0},"Bc8XRSZwadnMn7CtkbKhVQ":{"text":"I went here because I am a burger lover and heard these were among the best in New Orleans","useful":1,"cool":1},"MbkQmz1h3UmzUcOKpLQdOw":{"text":"You can't go wrong with Port of Call. I've been coming here with my husband for 8 years. I","useful":0,"cool":0},"7D7vX8sb8Ugv82r3cTIawg":{"text":"This is a destination known for their burgers, baked potatoes and Monsoons. There is a lin","useful":2,"cool":0},"6_a8tGUTyPh-BAdf1fmB2A":{"text":"Had the most terrible experience at Port of Call. I am a native New Orleanian and have alw","useful":2,"cool":0},"egk1Ef7AVdkJK3YiQCqVLA":{"text":"On May 28th, 2005 we were married. It was beautiful.\n\nEight days later we ate our first Po","useful":3,"cool":1},"obbj-bm00dBlfECsANUHRA":{"text":"I don't know why everyone is raving about the burger and baked potato. I asked for medium ","useful":1,"cool":0},"rlNGbv05OtUPOB1UC9-p8w":{"text":"Hands down favorite place to grab a drink & burger! Strong drinks and good food. Can't bea","useful":0,"cool":0},"R3Eb1-eE27ZUcDOqURbEVw":{"text":"Bang for your buck: 10/10\nQuality: 9/10\nService: 8.5/10\nAmbiance/Location: 10/10\nOverall: ","useful":2,"cool":1},"neEbedXOq8qyeltlpjBmLg":{"text":"Excellent! Tried something different, must say a huge delicious salad....schooner salad! H","useful":0,"cool":0},"9izKEgn7dQq1yejlG6X3sg":{"text":"I'm soooo glad we picked this place on our last night.  The place was packed with happy Sa","useful":1,"cool":0},"Jqwl12vXmRKpm99ajsDD9Q":{"text":"One of the best burgers I've ever had. The place was extremely crowded when I went with pe","useful":0,"cool":0},"rBagJ4gPr1x8ZV42qlImCg":{"text":"The ambiance is as if a cracker barrel has met an old biker bar.  Always crowded at the ba","useful":0,"cool":0},"fsRyYnizm51HKitRs0inYA":{"text":"Four of us, Sunday, April 9th, around 9 p.m.\n\nLoved the atmosphere. For people new to NOLA","useful":0,"cool":0},"HpSrBnyEg8rn07B2_ITaWw":{"text":"Recommend by a friend to stop in here while in NOLA. Definitely some decent burgers, but n","useful":3,"cool":0},"bG8r_tx8biCKeo4eTOEbZA":{"text":"If you are new to NOLA (come from away) as I am, or a returnee (the hubster was here durin","useful":0,"cool":0},"8aD2LBde_9Anci2vylgyeA":{"text":"Giovanna is the best bartender ever! She makes a kick butt pina colada! The baked potatos ","useful":0,"cool":0},"UCAL-gOUgGloAkGQXzmG5Q":{"text":"I'm surprised at this low quality presentation and item. I expect real bacon on a loaded p","useful":1,"cool":0},"k90KmxRmJi1L5rVeDk3F2Q":{"text":"So, I finally got to check out this place. We sat in the way back, and I ordered a mushroo","useful":1,"cool":0},"h5AwHngqEkV8v3hNE6E4Sg":{"text":"I will NEVER go back to this restaurant! Horrible, disgusting and un sanitary. They basica","useful":1,"cool":0},"oOStru8toOk2ywOMDWclEQ":{"text":"Best hamburger!! The hamburger is served with a baked potato instead of your typical fries","useful":0,"cool":0},"29y4QhiPsTuRyJY543Mw2A":{"text":"Port of Call is a must visit in New Orleans. I was in New Orleans for my bachelor party an","useful":5,"cool":6},"g6G-8IhIo0DphQjD35xvUg":{"text":"This is the best \"hole in the wall\" place too eat in New Orleans. Known for their amazing ","useful":0,"cool":0},"1rYMvnWhiDoQr1SIg3cHnQ":{"text":"Always a good time at Port of Call. I went on a Friday night- around 10pm- so of course th","useful":1,"cool":1},"_sjSBVdC3fRtkVG3_NadUA":{"text":"Good burgers and strong drinks. The wait for a table was kinda crazy though. Good hangover","useful":2,"cool":3},"KNkwXo7A3c_cVTsh0AefJw":{"text":"I have been coming here faithfully for 3 years and it never fails.... The burgers are grea","useful":0,"cool":0},"nSnlmumzf7ypmNs9v0X27g":{"text":"Best as always and my 1,000 times eating here.\n\nWhen I came home I ate 2 beurgers at one t","useful":0,"cool":0},"ExXV8T2OjnWptAv9409Z2A":{"text":"I've decided these are the best drinks in New Orleans. Huge tiki drinks? Yes please. Give ","useful":15,"cool":16},"-6pygpTT77Esw-PWucgaog":{"text":"In a city of GREAT food, this is the best restaurant in New Orleans. You might not believe","useful":1,"cool":1},"xiGLzM-QIQ6FL3tEhPo9jg":{"text":"So we came back.. finally someone was there to do some hostess duties. Put ourself on the ","useful":1,"cool":0},"aMcKFdzNiiugOMDtG4EStQ":{"text":"Love the monsoon! Better than a hand grenade, IMO. I finally got to try their world famous","useful":0,"cool":0},"Kx0vCZHrxYh2ntH8CjwEpg":{"text":"This  was the worst worst absolute worst service I've ever had in my life. This one girl w","useful":3,"cool":0},"pcHRY7SuBT9oeVKIfuJXlQ":{"text":"Great steak and even better drinks. We got a burger and steak. Our bartender said they get","useful":0,"cool":0},"N_6tBYwhGjhnOVBDWgshgw":{"text":"Wow... I went to Port of Call last night and I'm still digesting. I've been wanting to go ","useful":2,"cool":3},"YFdp2QleYdFpoo3VlO95zg":{"text":"Place smelled amazing.. but after having 5 different employees look at us at the \"wait to ","useful":1,"cool":0},"F5MxVGRchIc_Tf1E55aV0Q":{"text":"Had a few word of mouth recommendations to go here from some yelpers. Dropped in for dinne","useful":1,"cool":2},"9w7lSWP87yJgRg0Xu6XaGA":{"text":"This place is meh!! It is very tiny. We were seated in the dining area around he corner fr","useful":3,"cool":0},"PWy2Lk1ATv-iMvfzAfG71g":{"text":"Great burgers and drinks in a dive bar setting. Our plan was to go for lunch. My brother s","useful":2,"cool":2},"_3Trpu50J7RHeo_wKWqd5g":{"text":"Always a solid burger. Recommendation - Just show up late.  For some reason the burger and","useful":0,"cool":0},"N3mb8QJkUFfFUZtIMpoh8g":{"text":"I ordered the cheeseburger with baked potato. It was average. Unfortunately, I didn't get ","useful":0,"cool":0},"Km-OHeM0Q9pMDC8K4j0Beg":{"text":"Amazing burger place! Worth the distance from bourbon and it's a good local place for a ma","useful":0,"cool":0},"UqU1tnV1djrysH1vBNz7mw":{"text":"After five years and 20+ visits, I can't believe I haven't yet reviewed my favorite burger","useful":11,"cool":8},"fQqgErrOMZ7NdFtzJIoGPw":{"text":"We stumbled across this while walking around on our visit. We had several people tell us t","useful":0,"cool":0},"YE6HTxEUC9RmcW52SBULGQ":{"text":"I didn't get a burger but I've had them and they are decent. I got only a baked potato. It","useful":1,"cool":1},"_rqTWc-EZKnBXZHyCn7ysQ":{"text":"I was craving steak, but I really wasn't in the mood to drive to Texas Roadhouse on the We","useful":3,"cool":0},"yonyohFD_xka-strNyMHqQ":{"text":"Food was good. Wait staff adequate. Fruit drinks - okay - too sweet/and too heavy alcohol.","useful":0,"cool":0},"0m0Jta-Zt7G-JWOhFStvUQ":{"text":"You come here because this is a classic New Orleans staple and if you are looking for a da","useful":0,"cool":0},"XdjEgqiPBmr9C-cSmo3tcw":{"text":"A local uber driver told us to check this place out and we loved every damn bite. Not your","useful":3,"cool":2},"x_D1Ug0uqC1ohEqRulNlkg":{"text":"I cannot even believe I have click on one star.  What a terrible place.  The tourists love","useful":0,"cool":0},"JhamTKcgQZ1oONiIkKuTbQ":{"text":"The burgers and steaks (burger in particular) they serve up here are ridiculously good. Am","useful":1,"cool":1},"ay7NBAI2t1eLXhVFPUy-IA":{"text":"This place is money in the bank. Not overpriced. Nice walk away from bourbon street. Dark ","useful":0,"cool":0},"bzjyP58DD3D24Gvs6bmJEQ":{"text":"\"It's refreshing to see a baked potato served with a great burger.\"\n\nThat was my one and o","useful":5,"cool":4},"sdCU2QWGu0lbeeK2Uzf6rg":{"text":"We have heard so many good things about Port of Call and we were excited to eat here. They","useful":0,"cool":0},"CuAX5z230L228vWv3MJABw":{"text":"This is one of my families favorite spots to eat. Love the burgers and loaded baked potato","useful":0,"cool":0},"CjOLy2Fd2OkKu_xd4iKqRQ":{"text":"It pains me to take what used to be my favorite burger joint in NOLA down from a solid fiv","useful":24,"cool":12},"mJzqitboP254GEy_V-8LDw":{"text":"They only have two items on the menu and, for your purposes, you should really only care a","useful":1,"cool":1},"cFa-6lQ8j2AObjttTdurAw":{"text":"Burgers delicious, and drinks amazing. Only issue is the restaurant is very small so wait ","useful":0,"cool":0},"nvkHwkfifPhMG6zneMChWQ":{"text":"I'm so happy that I was able to visit while traveling to New Orleans for the first time si","useful":0,"cool":0},"AnU0bpiz-Tnq645a5p4gMA":{"text":"Thanks for ruining New year's 2019! Called on New year's Eve to verify pick up orders. I c","useful":0,"cool":0},"eRN6pL91NJX0ooQ4clkk_w":{"text":"Listen, this place is hole in the wall! The staff will be friendly but you will  have to  ","useful":1,"cool":1},"hrhVIqHwd355nYzCPTBq8w":{"text":"Meh. 2.5 stars. I think people like this place simply for the cheap booze. Seriously, I do","useful":2,"cool":1},"csdWCEuhOwKK2WroRUoq-w":{"text":"Terrible service. Got there gave my name to the hostess and waited 30 minutes. Then anothe","useful":0,"cool":0},"VU8sjhQZ-NBIYOoobyr_vw":{"text":"Hit this place a few weeks ago (first timer).\n\nOddly for me, a burger sounded like just wh","useful":3,"cool":0},"eeK9AVG1bJpGp3EGLbkq5w":{"text":"They have mediocre burgers or steaks on menu. Nothing else credit card machine was down. N","useful":1,"cool":0},"BbKqsyPSRnxqVnnLHs-NaQ":{"text":"A local friend from New Orleans recommended their cheese burger and the drink called \"Nept","useful":1,"cool":0},"_ZGMCXERJ4_ZnpC506yYYQ":{"text":"It's a good burger with an unmistakably steak-like quality to it. Patties are kept very th","useful":2,"cool":2},"tJC39LCxMrW12Dwdy75VFA":{"text":"Came in here on a recommendation.  Service was good.  Simply put, this is a bar that serve","useful":0,"cool":0},"GBJGpAQKEGEPRUKwHvZfQg":{"text":"I rarely leave reviews through Yelp, but if this helps anyone avoid a negative experience ","useful":0,"cool":0},"MxA8cQdb_rE-EAo7f4MbWQ":{"text":"I have heard so much great things about this place, and was craving for a new burger place","useful":6,"cool":0},"K3rc5rojeJ5_kWJ3EODRug":{"text":"We have eaten here before and have always liked it. It was a busy night so we had to wait ","useful":1,"cool":1},"o9WF5dr1tEUtCjzr19VELQ":{"text":"Best place for a late night burger and baked potato!","useful":1,"cool":0},"KeZs5Zgte9IMLIz95i_zNA":{"text":"Went here for dinner because I heard they had a decent steak. Getting seated was a little ","useful":0,"cool":0},"slZJlgPbeLUTsR0rtI66xA":{"text":"Always good dependable restaurant. Great wait staff always a  wait for the burger but ,alw","useful":1,"cool":0},"pvPa72X5W8cw949DzkrJlA":{"text":"Definitely a cool place.  I happened across it just by walking by.  After reading the revi","useful":0,"cool":1},"2aKn7in5pWqCqf4o27NWGQ":{"text":"A must-visit, if you want a good, simple lunch in NOLA.\n\nThis humble restaurant has a simp","useful":1,"cool":0},"-OCUv40EcNG8pgPBS579ow":{"text":"Good but not for me! This place is clearly a hot spot for locals and tourists alike. It is","useful":1,"cool":0},"aP364e_WMOQkMGZ9bghX4Q":{"text":"Great place for a burger and a drink. Food was fantastic and service was friendly. My only","useful":1,"cool":0},"3hHUgaf8khiORTMIvje4HA":{"text":"The food is awesome, the bartender was hilarious, he made the best drinks I had in New Orl","useful":0,"cool":0},"s9RFeMzccQaBOP52-EIfzw":{"text":"Was it the best burger ever - no.  Did I care - no.  It was well worth the trek down shado","useful":2,"cool":1},"c5ZGJCvYtLXtp9HJYEuESA":{"text":"Love this place! We were last there in 2012. We will be back in 2018. I can't wait. Tasty ","useful":1,"cool":0},"WMyNmxcE9DHy4Wlk2iNzXQ":{"text":"Not the best burger in Nola but it's not the worst either. It was dry but still managed to","useful":0,"cool":0},"FRHhvOWUjCsiNDNkuQFAZA":{"text":"Ok, I had a bad experience here about a year ago and have been on boycott ever since... wi","useful":7,"cool":5},"f6Kn2J5jpj5AjXflHBCB3Q":{"text":"I got Monsooned. Not once. But twice.\n\nIt's dangerous here. Drink and eat wisely. \n\n*Get t","useful":9,"cool":8},"qgXbDTXiLOVIOrJ2APVLZg":{"text":"We walked here from our Hotel (Cornstalk) on Royal Street.  There was a short wait but it ","useful":1,"cool":1},"tZQk9koFfSQY5VtzIP8oEQ":{"text":"I know it's a tourist spot, but I'm willing to pretend to be a tourist for a day if it mea","useful":0,"cool":1},"QY4wzIqd7Wjl69KerLlbbw":{"text":"No hamburger, baked potato, or Mardi Gras cup is worth being totally verbally assaulted by","useful":2,"cool":0},"o7Mm--TE93ntph6HQ29ivg":{"text":"This is truly as good as it gets!!  This place has the best burger and loaded baked potato","useful":2,"cool":1},"qYkhUbkBZ9BfnoXG2l5_gg":{"text":"This secret little gem never disappoints. When I lived in New Orleans as a local, we would","useful":2,"cool":2},"wz6U2pABWRCQmCUFCKEDUw":{"text":"Red Turtle is sweet, tart, and delicious. Cheeseburger with mushrooms is also a must.","useful":0,"cool":0},"WhsEKv7N_wfFFQ4VYDKhpw":{"text":"Review #1000! Can't wait to talk about this spot. My Uber driver is waxing eloquent about ","useful":1,"cool":1},"Vq3F2CamW6O_LOS2ILLkbw":{"text":"This has been my favorite burger place since I was a kid, and it only gets better once you","useful":0,"cool":0},"QxYLKbCBVMoK1LXWQEckxA":{"text":"I'm a local and dunno if it's covid or whatever but this place has lost a step. Burgers ar","useful":3,"cool":0},"SEnLIdwpeeKqji7K0rqoag":{"text":"I just love the food at port of call! But I truly HATE how they changed up on what used to","useful":0,"cool":0},"vYtijJCFtUZq58et_PIC9w":{"text":"What can you say about one of the most famous places in New Orleans (at least it should be","useful":1,"cool":1},"GrN08lo4GR2aNQx_8gtXlQ":{"text":"The original never fails. Came late night weekday n there's still wait inside  but lucky i","useful":1,"cool":2},"JXSXaxJrfsYA9vHJZ94vuw":{"text":"Well as much as I hate to do it... my TIME has expired here at PORT OF CALL. Why??? I'm gl","useful":14,"cool":5},"TPqE-Wkw_UbRnSsAIHN6Ag":{"text":"I got a medium rare cheeseburger and a baked potato with chives, sour cream, and bacon bit","useful":2,"cool":0},"TOUAF6iBDAjoUvOvQrjEqg":{"text":"Great burgers.   These are real burgers that your grandpa would have made.  Relaxed place.","useful":0,"cool":0},"BL3VxCXbbzv0837qhCvqSA":{"text":"We almost didn't make it to this place and having gone there and enjoyed their phenomenal ","useful":2,"cool":0},"ENpSAAqQer9_SGH1q6-7jQ":{"text":"I came here with my friends for dinner after we had finished running the New Orleans Rock ","useful":0,"cool":0},"UL8A_DxLz9sGvG7WGVnEHQ":{"text":"THE BEST BURGER I HAVE EVER HAD. Came back to New Orleans and this had to be my first stop","useful":1,"cool":0},"JTagmTmCIz3JIkD-wFeQOg":{"text":"Here is why I didn't give this place 3 stars.\nAll the employees are very nice even while w","useful":1,"cool":0},"Md7F0YtzHCUyRL1a20e7pg":{"text":"There is a list of the top 3 Burger joints on me at all times. Port of Call is and will al","useful":5,"cool":3},"xvnYPHuAR61nNO8mxhru5Q":{"text":"Best burger and baked potato ever! We had to wait for 50 mins. but well worth the wait! Se","useful":0,"cool":0},"Y-Af7GwYOPNnAvxpJhvWBg":{"text":"When it comes to burgers, I am an aficionado, and let me tell you, this place's burger is ","useful":1,"cool":0},"X_k2E9OeN-keAiti-CFyQg":{"text":"Awesome food as always!!! Burgers are always great but check out that filet you'll love it","useful":0,"cool":0},"TFfRNGrE5LP69qLzbBzIiQ":{"text":"I dont care what anyone says! This place is great. I don't view it as a tourist only desti","useful":1,"cool":0},"hk28iRa5Amo-1Gbhm7nBBg":{"text":"I heard so many great things about this place, I half expected the burgers to be ground up","useful":6,"cool":5},"oExixaHxY77IjQuW5SO6HQ":{"text":"Great service the burger was amazing! I really enjoyed my first time here. The only issue ","useful":0,"cool":0},"ST6Tw2mvGGMglv6ePo1i3g":{"text":"Order: Cheeseburger and Monsoon\nPros: Plenty of alcohol in the drink, good burger\nCons: No","useful":2,"cool":0},"azJr7JiWMiP1mzpIaKVNJA":{"text":"Oh Port of Call, how I've missed you since moving to the west coast.  \n\nTook my boyfriend ","useful":0,"cool":0},"oCqHVrXvVTzssfQjNvYobQ":{"text":"This place has the best burger I've had in a long time! The staff was very professional an","useful":0,"cool":0},"63PH7JidxulRm47MTPXPOQ":{"text":"I was blown away by this place. I love the cozy layout of the restaurant and the food was ","useful":0,"cool":0},"M31O-46CdOl0iu8ruRshfw":{"text":"I wasn't lucky enough to come here for a burger, instead I stopped by here for a monsoon b","useful":2,"cool":1},"CgbKsL1lyHQ5rbWqZk2h7g":{"text":"Drinks are great but I had heard amazing things about the burgers... mediocre at best.  Co","useful":0,"cool":0},"UktS9OoxGY88q5GBNwIqXw":{"text":"No frills kinda place. But their mushroom cheeseburger whole roasted garlic was delicious!","useful":1,"cool":0},"PhvADoG-X5kg9X8vAdR_Jw":{"text":"HORRIBLE, OVERRATED TOURIST TRAP. The burgers suck, the steak is bland, and the pizza is t","useful":2,"cool":0},"yAUGqWipPFFkIuVNRW_iyA":{"text":"So this Tiki Bar dressed like a Sailor walks into a Steak House... and says \"OW Mister! Wa","useful":0,"cool":2},"chZG8SoiJSPy3ZbjBH7R9w":{"text":"I'd been hearing about Port of Call so we finally tried it. It's a small bar, no reservati","useful":0,"cool":0},"aPqy8QqOCWcK1M4lfHdHZA":{"text":"This is my first review but I feel compelled to let the masses know that I would be comple","useful":0,"cool":0},"yovW6pKc11UY9XwCC5Vc_g":{"text":"Here at the Port Of Call, my group of 5 all had burgers (hamburger, cheeseburger, and a mu","useful":0,"cool":0},"RY0uDteh9PB1cOLgeWlP6w":{"text":"Just left after waiting 10 mins for someone to take our drink order...was looking forward ","useful":1,"cool":0},"3lABkVqy7uVIxZa035oUxg":{"text":"Any of their \"Speciality of the House\" drinks are equivalent to a circus strongman...Huge ","useful":1,"cool":0},"kHSicQzdjJnTX6Nppll5mA":{"text":"This is just a NOLA staple even if you only get drinks. I lm a Huma Huma girl but the Mons","useful":0,"cool":0},"Z9zrfIYETOv-zGivlfxzDg":{"text":"A group of coworkers and I came here based off of a recommendation and we weren't disappoi","useful":1,"cool":0},"Dn0SMHByKeNUcxuVnA1n_g":{"text":"Hell, if you're looking for a burger - there's no other competition in the city. Port of c","useful":0,"cool":0},"8QVPy8gb06wv6fG6LNTa4A":{"text":"This place is everything you want in a hamburger joint in New Orleans. Its dark, its divey","useful":5,"cool":4},"CVozFxXOAqIsW30rt3G5ug":{"text":"So this place is unique and so bomb!!! I was in NOLA for the essence festival. The drinks ","useful":0,"cool":0},"l2TP8dd6eUYLoZUQmNHY3w":{"text":"Although it doesn't offer traditional New Orleans cuisine this my favorite burger place in","useful":0,"cool":0},"Zb-_AHyW-E9_acpR7TvWLg":{"text":"I can't believe I am just now writing my review on the best burger in the entire city. I h","useful":0,"cool":0},"t_nCOLafZegIIx3rmh4poA":{"text":"We were lucky enough to get seats at the bar after only a few minutes of waiting, which is","useful":1,"cool":1},"Jv2sqG2oOc1ZaxcPYDDRHA":{"text":"Everyone talks about Port of Call so on my last visit to NOLA, I decided to give it a shot","useful":0,"cool":0},"qgzp9Gcvg7L2X_8tmx630A":{"text":"We visited Port of Call a couple of years ago and LOVED it, so we couldn't wait to go back","useful":0,"cool":0},"k4v3fJ2K3tEJpB2219F2vg":{"text":"This was one of the best burgers I have every had. I had the burger medium with cheese and","useful":2,"cool":0},"gUc_RYIljilxKv4W60hsmA":{"text":"Cool spot, but don't come for the steaks. Overall cool ambiance. Service was fantastic, dr","useful":0,"cool":0},"_C3-em1agPaWk3ewB1gDNg":{"text":"This is a wonderful dive bar. I don't know if there ever is NOT a line to get in. So, be p","useful":0,"cool":0},"Mdzp79gmRQfIqqaRVDZnBQ":{"text":"Very small restaurant not far from burbon st. Many of the locals say it is the best burger","useful":2,"cool":2},"74hHiba6_yXMPK9e1Dm5jQ":{"text":"I rarely leave any feedback on yelp but I feel the need to give you a little glimpse into ","useful":0,"cool":0},"OhLQrCELsTw2Lw8FT35e1w":{"text":"My boyfriend kept talking about this place over and over so when we went to New Orleans th","useful":0,"cool":0},"-eo_V5BcOhCrzOxtunW1Xg":{"text":"New Orleans isn't known for burgers but if you want one, here you go! The char taste and j","useful":0,"cool":1},"RDj0aB_xj-ZbMPlzgi2qFw":{"text":"What a GREAT Burger! Possibly the best burger in NOLA. That's what several people told us ","useful":1,"cool":0},"X4DBjoTDCmFSFEBd3DGH-Q":{"text":"This place came highly recommended by our Uber driver as a great place to grab a burger. M","useful":0,"cool":0},"Ms1PWb7EupgVeb7WzzOSrQ":{"text":"Absolutely loveeeee Port Of Call and I don't think there is anything they can do wrong lol","useful":0,"cool":1},"O8ZBRErwyNfkCh4CMuiVSg":{"text":"Amazing burgers! This was recommended by our Uber driver.  Burgers are fresh and great siz","useful":0,"cool":0},"-d3M83S0z2bhdAN2CrD4fg":{"text":"Best hamburgers, baked potatoes, and drinks! Prices are great. Drinks are strong and large","useful":0,"cool":0},"x7-KuL0looU1Be19vhWlGQ":{"text":"Great place! The drinks are good, the staff is quick and friendly (Miles was the bomb!) an","useful":0,"cool":0},"aGpm5fScmKAo7OJGIWSlBw":{"text":"This is one of my favorite lunch spots in New Orleans but only if I can take a nap after! ","useful":0,"cool":1},"arAsPsLe-L6wrtAlSjJPlg":{"text":"Decent looking from outside but everything was average like blah ..baked potato had a bunc","useful":1,"cool":0},"OKU0v9aOwYp-U8GjBJGJVQ":{"text":"One of the best burgers of my life.  Do not miss Port of Call if you are visiting NOLA.   ","useful":2,"cool":2},"5YXXFP8in8Dj4RTRjmPceg":{"text":"Another place my son drug me to. I guess it's supposed to be known for fresh ground beef. ","useful":12,"cool":6},"EUXv7iinfcIwACR6jwHwBg":{"text":"I had the hamburger and it had to be the best thing i ate in New Orleans my whole visit. O","useful":1,"cool":0},"IbgL41pBzge8F5wvdimtRw":{"text":"I don't know why everyone is raving about the burger and baked potato. I asked for medium ","useful":0,"cool":0},"ysgoLQAZe5_WQ2zEVvpJOg":{"text":"We were recommended this burger/bar on Esplanade by our Air Bnb Host. She said it was one ","useful":1,"cool":1},"Wi8KqPu97gElC3brjCpaUw":{"text":"Food was good. I'm not the big get at fan of flame broiled meat but overall it was good. M","useful":0,"cool":2},"EVd01NePTke7Dne3b0GJYA":{"text":"I spent a full week in NOLA eating constantly and this was hands down my absolute favourit","useful":0,"cool":0},"SAW8VS71vu6osCU8b_DQOg":{"text":"This is the epitome of a hole in the wall. Especially in N'awlins. Located on Esplanade Av","useful":3,"cool":2},"MwVCHjFLOIlewvL9yi63lQ":{"text":"Terrible service; their menu boasts of breakfast all day but when I ordered a breakfast sa","useful":0,"cool":0},"lvVS7vFlBGuFBCYcnfYShQ":{"text":"Let me start off with, order your burger more well done than you normally do. This was the","useful":3,"cool":2},"ebdDVXBF9NFRMG-3Sf_Hag":{"text":"Classic huge juicy burgers and baked potatoes, though you may have to wait to eat.  If in ","useful":1,"cool":1},"M_KzCUS-M7_VWzfHM38ZTA":{"text":"This place was recommended to my group by locals . They serve huge burgers and baked potat","useful":0,"cool":0},"Y9atkKEK1mXXqkOX6WmDrw":{"text":"I went here with a friend! Wonderful place with a lot of selections. I ordered a salad and","useful":0,"cool":0},"WkNIYenbKAwhAV1wf0ymvQ":{"text":"The food is just solid.  Great burger, great baked potato.  Bustling place, sort of crowde","useful":0,"cool":0},"njNkikGa0wjLKFzhSF1HdQ":{"text":"Nice little restaurant bar , a bit crowded ... I was told best hamburgers in the city ... ","useful":0,"cool":0},"LjyvCRPgzSvrI2DGsuoMuw":{"text":"Sometimes while I eat lunch I entertain myself by reading Yelp reviews of polarizing place","useful":1,"cool":1},"d7Iry3b4Ea7lUq1ckY5CFw":{"text":"Okay, let me just start off by saying that I eat a lot of burgers, I understand the respec","useful":1,"cool":0},"kltY0yTOs5l2efyuDuRSUg":{"text":"The burger and potato is definitely 5 stars. I went with 4 because it's so chaotic to get ","useful":2,"cool":3},"rGYfozFXgu4y8CbsMzSgLQ":{"text":"Still one of my favorite places after 20-something years since my first visit. Best steak,","useful":0,"cool":0},"MqA_sHAJi1qvjcwmKPK7gA":{"text":"Spur of the moment kinda thing! Gotta love those! Sat at the bar and ordered a cheese burg","useful":10,"cool":6},"8nj7o2urL4A5m-aiPC-YnA":{"text":"Such a quirky corner restaurant complete with a fun layout draped (literally) in a nautica","useful":1,"cool":1},"vKEt69BOGLiFbnGdXh6lnA":{"text":"Here with one my friends who is a NO local. She was excited to bring me here. I love that ","useful":1,"cool":0},"82c2lUbNVV8juPGnxVOBog":{"text":"Came in because a few of our Lyft divers recommended this place. I got a cheese burger and","useful":2,"cool":0},"J59K22hnbDHMke01-7wHhg":{"text":"Great service! They were super busy when I came in but very attentive. I got a burger and ","useful":1,"cool":1},"CHh3l-jpvQVxoFMSjo0rng":{"text":"Hugeeeeee delicious burgers! Only 4 selection of burgers but the quality is top notch! Fas","useful":0,"cool":0},"jzMqfK7_7uVgx7oK9_ZBew":{"text":"First time here & I loved it. Our server Travis, was a beast! Had our food out quickly, dr","useful":1,"cool":0},"AaHKAyckcvehfVk94pMA8w":{"text":"Literally the best combo of a perfect little side salad and loaded potato. I've been eatin","useful":2,"cool":1},"03wWVgISZ9anye1GU8KMWA":{"text":"The burgers are amazing, the potatoes are HUGE, but if there is one thing to take away fro","useful":3,"cool":0},"rznC3QVcRCX6kjre6h8KWQ":{"text":"Long wait!!!! \nVery interesting local vibe feel\nAmazing burgers ( I got the mushroom chees","useful":4,"cool":4},"hNiv5CKstwDZdnFZy4OUVw":{"text":"Looove the atmosphere and the drinks. My baked potato was great and the cheeseburger was c","useful":0,"cool":0},"CM8UK2ZpfQZmInAbKh1YNg":{"text":"This place sells steaks and burgers. I probably had one of the best burgers in my life her","useful":0,"cool":0},"T0IFvtUusDfIGjvF3M3-ng":{"text":"Ever since 1997 NOLA has been a 2nd home for me. I've lived there worked there and vacatio","useful":0,"cool":0},"PnEbnx9qlZDoaK9mU0m0sw":{"text":"This place was recommended to me by a few different Uber/Lyft drivers, so I made it a poin","useful":2,"cool":0},"98VtD00JSVZ_E2pej8KrTA":{"text":"Loved this place. Heard about it from a friend who visits NOLA regularly. Totally hole in ","useful":0,"cool":0},"T6h5D83irPz8GmNWDqn2bg":{"text":"Great place to get your eat on before you get your drink on. I recommend splitting a burge","useful":0,"cool":0},"snYV0qnwI5wbi1wkhb_iaA":{"text":"Had to sit outside since I didn't have proof of being vaxed. Service was pretty quick. The","useful":0,"cool":0},"fx1HmtwUyFkj7X_cUO1nLQ":{"text":"I've been coming here since I was a kid and it never disappoints me. I've never ordered th","useful":0,"cool":0},"iIXj8XVJVpxre7dTD3XNiQ":{"text":"Famous NOLA hole in the wall restaurant with amazing burgers and baked potatoes. I wish th","useful":0,"cool":0},"T697k2AlumavdiBXo_rL9A":{"text":"Estuve un domingo al medio día y en un día lluvioso, la espera para obtener la mesa era má","useful":0,"cool":0},"LalPDIa3wjWVHI_muG3xDA":{"text":"I LOVEEEE this place!!!  From the nostalgic digs to the food. The burgers and baked potato","useful":0,"cool":0},"R1Z79RdV9jKZWgXasCgRYw":{"text":"This place was the only restaurant on the island that wasn't crowded at dinner time which ","useful":0,"cool":0},"r142S-nQbYOEGF002lzvvA":{"text":"You might think what's so special about a burger? Well at any other place you are right. A","useful":1,"cool":2},"Cl6x9O5VSflcT-VcoAyhcQ":{"text":"I have been going to this place for 3 decades and it use to be great food and service. In ","useful":1,"cool":0},"7GG4pa513igDCF5Wg_0gog":{"text":"Great dive bar near the edge of the French quarter serving up classics like loaded baked p","useful":2,"cool":2},"O5wrjlTRsF77hucd_Z3kqw":{"text":"Ridiculous.  You help them where you can then they revert to the same terrible service to ","useful":2,"cool":0},"zS-CCRpTd7DkK0zkvOMWkA":{"text":"Now how can anyone take a trip to NOLA without hitting up Port Of Call.  Its kind of a rit","useful":4,"cool":2},"tzCG2z5zged2OpGYMFtJKQ":{"text":"Told by locals to go here for a change of pace, and they were right.  Small space, but ful","useful":0,"cool":1},"ktcLE2s24dRU-ZObyfQSzA":{"text":"We were turned away two days in a row.  My group of four Ubered to POC based on the posted","useful":3,"cool":0},"jxjXqRAvIvVDSvmvjcz4Kg":{"text":"Best hamburger in New Orleans one of my favorite places to go eat . Never disappointed !","useful":0,"cool":0},"ZeI_Je9ytDLWmtCkt6O4tw":{"text":"Our venturing out into the French Quarter for the first time since the pandemic started wo","useful":0,"cool":4},"pUaSU5mlU9TtjOODFFftTg":{"text":"Weeeeell let's just say that this place is much to be desired the baked potato was delicio","useful":1,"cool":0},"cHSzq4BZZJjOhMLnMTsiEQ":{"text":"As a vegetarian, the menu here is less than ideal as Port of Call is all about burgers and","useful":1,"cool":0},"R-C_fDGGwdLZQPR89C0AOg":{"text":"I'm not sure how this review has eluded me. I've been here dozens (hundreds?) of times and","useful":1,"cool":0},"JpbPeGjaKgy7etXO82kdNQ":{"text":"I went here due to the sheer amount of recommendation for it and I must admit, the experie","useful":0,"cool":0},"E4an2h9CQbNT8vjpkrtuXA":{"text":"As a New Orleanian, I hereby declare that every local has to visit Port of Call at least o","useful":3,"cool":1},"sa6uGmt_JIdJLtp2Z6ZB2Q":{"text":"Terrible customer service. Will try to fit a party of 13 into 2 tables of 4. We tried to s","useful":0,"cool":0},"htDKPSiluQb89JDSG7pWQw":{"text":"Amazing burger! So much flavor and everything tasted fresh. The only problem was there wer","useful":0,"cool":0},"CT8Y8otg7XlvMMq2IN1E5w":{"text":"This place was recommended by our Lyft driver and had outstanding reviews. You have to wal","useful":0,"cool":0},"w7x1-iceuaVWeRjHiQcUjA":{"text":"I remember coming to Port of Call on a Habitat for Humanity trip through my high school. T","useful":3,"cool":2},"caBAK2RD1b915GppaAk7KA":{"text":"If you love huge delicious burgers, incredible loaded baked potatoes, and tasty cocktails ","useful":0,"cool":1},"2iwgOPh_iYKGAbHQQcPLoQ":{"text":"Delicious filet mignon but it was a bit too well done for medium rare. Still enjoyed Port ","useful":0,"cool":0},"Y_CvkzyElgIMMCBsF4JTXA":{"text":"So you come to Port Of Call for a spud on steroids with all the fixins and a NOLA style bu","useful":19,"cool":15},"XisB0Ebyoud-elZvylbgsg":{"text":"Talk about serendipity! \n\nWe decided to walk from bourbon st to the Frenchmen st and got h","useful":2,"cool":0},"VXaJ3B1lerWSKsiHp8LFyg":{"text":"Fantastic baked potatoes and good drinks. Atmosphere is nice and service was spectacular!","useful":1,"cool":0},"HWj8WHjExnu-82eESStgeQ":{"text":"My bf loves the burgers here at Port of Call so on my last day in New Orleans, we made the","useful":9,"cool":6},"jykW0WNS3Na8HOitvGp-pw":{"text":"Still the best burger I've had in NOLA so to date. You must have a Neptune Monsoon while t","useful":0,"cool":1},"mCgL-9NPXU23VWbrVTouVw":{"text":"The wait was so worth it here! We were visiting NOLA and heard through the grapevine that ","useful":1,"cool":1},"ih0FcJ2BQACY6nqsnSOtuQ":{"text":"Worth the line!  Maybe the best cheeseburger I have ever had.  The chargrilled goodness ho","useful":0,"cool":0},"7iRAFSH-BxdiTPg7bW1KUg":{"text":"We walked about 3 blocks from Bourbon St, it's a dark small bar type place, we came for th","useful":0,"cool":0},"oH7SFpw3lq3vnqo0ZVczFQ":{"text":"Burger was excellent.   Tables are arranged really close together.Lighting inside the rest","useful":0,"cool":0},"ig8so2rLd7gCq_3xuWy48Q":{"text":"In town for the Superbowl and we heard about this place from many people. Some of the loca","useful":0,"cool":0},"Ba0ieQfoMOvHgU4UXECUAw":{"text":"LOVE this place!!  Another locale that I've eaten at years before I ever discovered Yelp! ","useful":1,"cool":2},"RxVt4STpVHxjUrmLZL-Hlg":{"text":"I am the kind of woman who loves a loaded baked potato.  And this place has the best baked","useful":0,"cool":0},"W0Gj5Rvw09rpkZ-xery1vA":{"text":"This was my first time in NEw Orleans and my boyfriends 7th and our first time at Port of ","useful":0,"cool":0},"ojItCEwopfXcwDamInYQcg":{"text":"The last time I visited the city, my fiancé and I visited Port of Call. when you first wal","useful":3,"cool":2},"SFWGSbZi1MyOKN9m4JKipg":{"text":"This place is so simple: drinks, burgers, baked potato. That's it. But that's not it, real","useful":3,"cool":0},"EH05yq5ASzXwGtM1PS1toA":{"text":"Great food, cocktails, atmosphere and for all of you that complain about the bathrooms, ge","useful":0,"cool":0},"c-BV2bDjGGSgOti_-Nd6hA":{"text":"Always a go to stop when I'm in New Orleans. And of course we order the burger with the ba","useful":0,"cool":0},"alMXKUFUk7e8pDlbVXMi9w":{"text":"Excellent food, great people watching if you are fortunate enough to get a window seat. Mu","useful":0,"cool":0},"_JCwkfms6uxSLIh-K1rskA":{"text":"I'm glad to see this restaurant open and operating super efficiently. We tried not to stay","useful":0,"cool":0},"qD4tXIjuQejOx5VZEgc7wg":{"text":"Probably the best cheese burger in the French quarter! Love this place! No fries, but...a ","useful":1,"cool":1},"57Ev-3xNvvaNMFQTUxwbAw":{"text":"Before I went, I read tons of reviews about this place. I'm glad that I went anyway and di","useful":0,"cool":0},"dVxeKJPtAATnn2c8AHxPiA":{"text":"Was it the best burger I ever had?\nProbably not, but it was definitely a great burger.\nThe","useful":1,"cool":1},"cdH4hNHGxHmodRtLplJfFQ":{"text":"After a long wait a Good burger and a great baked potato. Lots of food for a great price. ","useful":0,"cool":1},"j-hfbh1p1vt4E3Vc7nE4vw":{"text":"Food is consistently tasty. Our server was super sweet. We got there at the right time bc ","useful":0,"cool":1},"NqOouuiwccV02qyY9qyJ5g":{"text":"Unfortunately, this was probably the blandest burger I've probably ever had. Frankly, I wa","useful":2,"cool":0},"9BJl9qJpZRp0GqBxrZO2hQ":{"text":"A packed restaurant of both food lovers and getting a drink to go crowd. You walk into a d","useful":1,"cool":0},"w8wjs35B9fIYBVTfx5ByKw":{"text":"Everytime I eat at Port of Call I get blown away at how delicious the food is here.  The b","useful":1,"cool":1},"4mMmwKdts-iozU3REpO1gQ":{"text":"Had dinner here after the Bayou Classic game last night. We hadn't been here in years but ","useful":0,"cool":0},"O9TQZdZ0z76FKzmiAwqeuw":{"text":"I decided to come here all a night out in the French Quarter! And I'm glad I did. This pla","useful":1,"cool":1},"V0SBS5t66R-4aKQDsySo-g":{"text":"Thanks to Damon B, Jamie D, Farrah A, and Alex L for your glowing reviews on this place. W","useful":6,"cool":7},"fH6NppD2QnKWzWpxIvmqdA":{"text":"They serve a great burger that is served with a potato that you can not possibly finish. (","useful":2,"cool":3},"J6Mo3ZNVwDx1JHU4OqemGQ":{"text":"Burger tasted like I was eating a steak. What have I been doing wrong my whole life to not","useful":2,"cool":4},"OjO-QU5g8GvvloOAXq88TQ":{"text":"Thursday early evening dinner. It took 10 minutes to be approached by the hostess just so ","useful":1,"cool":0},"qzKKtfRR_X88oQlbeRrDdA":{"text":"My cousin took me here and I got a Huma Huma and it was so delicious. So good we went back","useful":1,"cool":0},"mpKg7W2rk67-udKTMImCWQ":{"text":"Got here at 10:50 AM, didn't get let in the building until 11:15 (when they open at 11) di","useful":0,"cool":0},"VCWUTC3drpVTRxQrRtg_-Q":{"text":"One of my personal favorite places in NOLA. We use to frequent this restaurant when we liv","useful":25,"cool":24},"2ubYvYHauSx6CiamUiLHPQ":{"text":"My guilty pleasure! Yes, it's a dive bar, but its darkness and simplicity is its allure! I","useful":0,"cool":2},"tdZocaiY5FJQb8J5QGlPmA":{"text":"So.....Port of Call is most certainly a dive. However, it's an experience and I never get ","useful":0,"cool":0},"MCAhIZQDIKIbNSvJt2jC7Q":{"text":"Best. Burger. Ever.\n\nI know what you're thinking. Who goes to New Orleans and orders a bur","useful":3,"cool":4},"_Gk_5EhgrzQIzO9438PzzQ":{"text":"BEST. BURGER. EVER. my wife ordered the burger. I ordered the filet mignon. I would almost","useful":0,"cool":0},"wAlC6GGaHUfB8IyQd6SEPA":{"text":"Went here tonight with the family and food was amazing. Only a short 15-20 minute wait. Ti","useful":0,"cool":0},"kG-7hkxI2ZdW6nQgG_vP0Q":{"text":"Best burgers my mouth had ever tasted. Their burger was SO tender. I had it medium rare so","useful":1,"cool":1},"7wyJirla4xw79DEPy2TdfQ":{"text":"Yum yum yum. That's all! Watch out for the Monsoon. It will sneak up on you. Wink wink. Ha","useful":1,"cool":0},"BBGSgqUa339dK3UTP4f3Jw":{"text":"Ok food, extremely limited menu. \n\nQ: anything else on the menu?\nA: no - we haven't update","useful":0,"cool":0},"AfkCqNc-J2t6CDWv41x1tw":{"text":"This is quintessential New Orleans and I love every single piece of it. From the loudness ","useful":4,"cool":2}}