{"Bu3rfMX9j8IrkK7NW6Nd9w":{"text":"One of my most favorite places to visit while in the French Quarter.  The raspberry truffl","useful":0,"cool":0},"Afnpvc67xPzBBF5u0m9QGg":{"text":"Great job on making classic cocktails!!  I had a couple old fashioneds.  The bar is in cir","useful":2,"cool":0},"hswD7njt2CNNL_fyykcSUg":{"text":"We wearily stumbled into the Carousel Bar inside the historic Monteleone Hotel after an af","useful":10,"cool":10},"14GFmUT0-loBAtz-jm2HpQ":{"text":"First and foremost, since this is a bar, I feel obligated to discuss the drinks.  My Kahlu","useful":0,"cool":0},"7ROovKxIvBiS6FNczS6N-Q":{"text":"I've been to a lot of bars, but never one that spins (slowly).  It is a classy, swanky bar","useful":0,"cool":0},"akG_ScbR5ijpQZaCJfT60Q":{"text":"Sure it's kind of gimmicky. And sure it will be full of gawking tourists. But my advice is","useful":0,"cool":0},"pKOITdUIKlchBkBxLzZXbw":{"text":"I recommend pims cup and seafood beignets good crowd good music historical and will exceed","useful":0,"cool":0},"68oBQvFMOFO9GQZ_PuDMDg":{"text":"Absolutely loved this place! I only had a chocolate martini, but sitting on a bar that mov","useful":0,"cool":0},"3i975bjkcqLnajLdFRGr3A":{"text":"I went here twice on my first trip to NOLA in March. The first time I went around 9pm on a","useful":1,"cool":1},"6IFhdB-EKhIfRQHoIl0pwA":{"text":"We were referred to the Carousel Bar by another bartender in town.  He was right; these gu","useful":0,"cool":0},"NCG5p0Yuf4MEwXzjlKV10Q":{"text":"One of my favorite bars we visited on our trip.\n\nThe Carousel gimmick is super cool.\n\nOne ","useful":0,"cool":0},"GVUpdl-rknaaHjP3XyAwhQ":{"text":"You sit at the bar and it takes you back to the 1930's when this was one of the great cock","useful":0,"cool":0},"MvVbT6ua3dYUkuQR4T7E4g":{"text":"It's nice to go there just to say you've done it, but if you're in the mood for serious dr","useful":0,"cool":0},"DxVF2MNuA9XPP14iACnhJw":{"text":"Located in the Hotel Monteleone, its a Hotel bar with a twist, literally. The bar rotates ","useful":1,"cool":0},"QTE7MDaEP4R0uGM2YJoJ9w":{"text":"Located in the Hotel Monteleon, the Carousel Bar is not just a cute name to attract a cute","useful":0,"cool":0},"ArfRhW7pCUDNpli6n1C2qQ":{"text":"Great place.  Live jazz music was great and drinks were super.  We were there last night.","useful":0,"cool":0},"Hvq1PqRFyCOO3a1LzA6ZsA":{"text":"I came here for some drinks. All i had were gin and tonic. They were tasty and made really","useful":0,"cool":0},"0UtoZkzhNRlmlefx7hWw6Q":{"text":"I find it amusing that the conservative, upper-class Hotel Montelone caters to its older c","useful":1,"cool":1},"thauEw6FuhwnJ7GyroJhRw":{"text":"A bar where the barstools move in a circle like a carousel is indeed as nausea inducing as","useful":0,"cool":1},"QEt7HSh48sAP6x8Iwa5HtA":{"text":"Absolutely my favorite place/bar in New Orleans \nNo cover charge just good drinks we actua","useful":0,"cool":0},"biuFhr1uHHKuIXqMpJEnqQ":{"text":"Do yourself a favor and go to the carousel bar and order a Pimm's cup. We were at the back","useful":1,"cool":0},"dv_29DBH-5dLYwJfWOTe4g":{"text":"I have been to the famous Carousel Bar twice now.  The first time I had simple mimosas....","useful":0,"cool":0},"Cdvpqiuud4eGa28XDXZrRA":{"text":"Great drinks...the Gin specialty drink was Excellent...Downside you have to jockey to sit ","useful":2,"cool":0},"XhjcRjK-6I4yLrUft9cM7A":{"text":"Great atmosphere here, a lot of history going on as well. We stopped in just to check it o","useful":0,"cool":0},"Nh_g0uhusLVO0_q38H2cyw":{"text":"Sat down with a party of six around 3 pm and waited 15 minutes. Had to get up and get a me","useful":0,"cool":0},"1XY3TSwMFq3D1-k1q7CXcg":{"text":"First bar we visited and it was PACKED, great ambience with live music and a rotating caro","useful":0,"cool":0},"LgTJs_CU4-WUUaedmCDhDg":{"text":"Fun place to hang out and get cocktails. Try their French 75 and take turn around the caro","useful":1,"cool":0},"9_S3XK7Xf97vtCFNdoyN_w":{"text":"Great bar, and had very good singing.  the rotating bar is amazing and hard to get a seat ","useful":0,"cool":0},"9ctxFsTPG6xJp5BCwudxGQ":{"text":"Great atmosphere and ambiance. Quiet bit busy the best feature is the carousel of course. ","useful":0,"cool":0},"kicrcs6UtGMTK0XOCtBzNg":{"text":"If you can manage to get a seat at the bar, I would say its worth the experience. There is","useful":0,"cool":0},"3MFShtCAYyJ2wMryW9OKrA":{"text":"It's all about the ambiance in this place.  Romantic.  Mysterious.  Boozy.  A slice of New","useful":1,"cool":0},"P8jEOAnSu-98Rlz4v5FkVA":{"text":"Fun! The bartender Jonathan was really nice when we asked what we should check out around ","useful":0,"cool":0},"txLhyBzeRn6t8kIVusrMGw":{"text":"Nice setting, but still room improvement for services, unless you sit at the moving bar it","useful":1,"cool":0},"8KCjlOl2mjyZWVCoQaUVLw":{"text":"Get there early if you want to sit at the carousel bar.  If you come at the wrong time, it","useful":0,"cool":0},"l1IE_FNIBHLJ5P_vw-5PRg":{"text":"Amazing drinks and an overall classy experience:) I saw this bar on Booze Traveler  and wa","useful":2,"cool":0},"kqdGSCe-YEfzST7VJ6AQAw":{"text":"Great place to grab a drink, listen to some music and meet people. The bar spins in a circ","useful":0,"cool":0},"sRsUgZDaxeoMeWd7hgojrQ":{"text":"A must see anytime you're in NOLA.  \n\nGo during off hours and it's dead...which means you ","useful":1,"cool":0},"AJB7nFnR9UhtXEnHO9deeQ":{"text":"It's decorated for Christmas now and it's beautiful. We simply stopped in for a few drinks","useful":1,"cool":0},"JdSXqsasoZka_ig3ISZCpg":{"text":"Nice spot.  The cocktails were good and reasonably priced, and the live music was great.  ","useful":0,"cool":0},"czDd0KbbdGQ7OoqrsoPFbQ":{"text":"Magical rotating bar with a carousel theme! You will feel drunk as soon as you sit down!  ","useful":0,"cool":0},"mPGTrOUzihtr0Jt9acXa3w":{"text":"Staff was rude and dismissive especially the bartenders. Be prepared to wait a long time f","useful":0,"cool":0},"lwIafBms0cTebXPlkdhrUw":{"text":"Hotel bars can be a bit cheesy.  Normally,  they're filled with passerbys with empty faces","useful":10,"cool":8},"gF2c4l29SV6G3kRMQNj5Kg":{"text":"Cool bar, nice bartenders, slow service. Sit in the lounge near the stage and watch the ba","useful":1,"cool":0},"o1sZlkM3RXmgV_BmxmyaQA":{"text":"Cool rotating bar. They claim to have invented the Vieux Carre. Pretty good for a whiskey ","useful":0,"cool":0},"OaWEnotlbVC4WU15zFz2vA":{"text":"A bar that spins around. Well made classic drinks and free bar snacks. A New Orleans stand","useful":0,"cool":0},"kXwFcVYbuVD65SZSxN38gg":{"text":"This place. It's an interesting watering hole to say the least. There is no waiting list t","useful":1,"cool":1},"fcvzHdimSUDR_72Lu3mtHQ":{"text":"Loved the Carousel bar! Such a cool concept! Was lucky to get seating both times we came t","useful":1,"cool":0},"e2HjpzVvTucxpr22MnmrMw":{"text":"I'm insanely glad that I discovered this bar.\n\nFirst off, it's just kind of fun to sit at ","useful":2,"cool":2},"oaIwo7f2IDYf6zwahi43Dw":{"text":"You must come here and have some sort of New Orleans type drink. I had a Pimm's Cup, which","useful":2,"cool":1},"VLZGzNoL1WACadpOaILvMw":{"text":"We heard about this bar from a friend and wanted to check out the \"carousel\".  While there","useful":0,"cool":0},"hRsusoJ8tI4-1SjrG4VE5A":{"text":"A drink at  the Carousel  bar should be on everyone's bucket list. Thankful for us this wa","useful":0,"cool":0},"mFtTjg1fUVzIwg5smsZNQw":{"text":"Amazing and cool. Drinks and bartenders top notch. Loved the spinning bar. The only way ou","useful":0,"cool":0},"9fW0c7s9dh-1_eDGRBIjbw":{"text":"This place is worth a visit. A little pricey but worth it. The service was excellent and i","useful":1,"cool":0},"EEFeQ4oRmW0jx11kFukKvA":{"text":"This place is totally worth a visit! The fact that there is a bar with a carousel theme is","useful":2,"cool":0},"Iik5KqVJjz2cXEqzUW5cUg":{"text":"Okay really Circle rotating bar got it if your view changes every now then  cool if you're","useful":0,"cool":0},"x3j4k_mY-52e98x2hG-6ow":{"text":"Amidst all of the down-to-earth, raggedy, ratchet, and low key vibes that you find all acr","useful":3,"cool":4},"o7rHVFJ6nE7FSbCWX8oFKg":{"text":"Based on its drinks, selection, and prices, it's absolutely average in every way. Based on","useful":4,"cool":3},"2sELGgNmnZ7_wucqcBOhxQ":{"text":"There's no way to sugar coat it: the bartenders here were mean. I'm hoping it was an isola","useful":3,"cool":2},"01QX5E1HtXm-6gz27bUWNQ":{"text":"I love Carousel Bar as a cocktail lounge that serves classic cocktails as well updating th","useful":0,"cool":0},"f8s3GH82g9YF2Va1EqH1cg":{"text":"The Vieux Carre and Sazeracs were tasty but quite strong (go hard or go home?? lol) but de","useful":1,"cool":0},"E3t0-paOhXRJ92QozDCxPQ":{"text":"Good for a quick pop in for a drink. People are very well dressed. Good for before dinner ","useful":0,"cool":0},"hjaM5fLyjrETM6rTfFXxCg":{"text":"It's always a fun time at Carousel bar...if you can get a seat! Because this place is so p","useful":3,"cool":1},"5-A9ouRD-yWCf_WR8hdXng":{"text":"The Carousel Bar is located on the ground level of Hotel Monteleone on Royal St. (parallel","useful":4,"cool":3},"KtV8OGE2LHjAI-0xZOmpbw":{"text":"This place has charm, and it has history... but this place is WAY OVERRATED for what it of","useful":2,"cool":0},"DBcKd6MmC5ajaUvRNOIYPw":{"text":"This place looks fancy, and although a bit pricey on the drink front, definitely a fun tim","useful":3,"cool":3},"BGLMVBcPC-McSFE1GQK4qQ":{"text":"I went here mainly for the music.\n\nWe were #shoik by its interior designs and the moving c","useful":0,"cool":0},"wA1-smgJo8M2LL61RvKC1g":{"text":"The coolest thing about this bar is the moving carousel and the live band. Other than that","useful":0,"cool":0},"FWY80q0cgHmVc3S9KhLpnQ":{"text":"I am a culinary professional by trade. I graduated w/a bachelors degree from CIA in '08. M","useful":0,"cool":2},"Fd0Dp0dzdwVWuz5UnXKzeA":{"text":"We stayed at the hotel Monteleone which houses the bar. However every time we passes by th","useful":0,"cool":0},"O8fKGHY1OvQwjzyP38F7hw":{"text":"Awesome location, stop in and see Travis at the back bar for excellent service. You will n","useful":0,"cool":0},"jxiR7M9ShXf_KFcvNIaDOA":{"text":"A Ramos Gin Fizz without the 12 min shake(not even a 1 min shake) and way too much orange ","useful":0,"cool":0},"fyiIJZtigH82ELAfsOB5gA":{"text":"The Carousel Bar is kind of a must-see in the French Quarter. The atmosphere is nice for a","useful":1,"cool":1},"eNUqxaYLbx2XBUdve2ZUVg":{"text":"If you like to talk about all the places you have been this it. Great for meeting with new","useful":0,"cool":0},"8Zv7h5-9KJCRZOFa_R2MHQ":{"text":"This bar was a blast! Delicious drinks (I got the French 007 and the pisco drink), fun bar","useful":0,"cool":0},"Es44NFkr0SMwnQm7emtmpw":{"text":"Holiday cocktails and super apps at the Carousel Lounge in the Monteleone Hotel on Royal s","useful":0,"cool":0},"l5-X8o361dGncumk5IywJw":{"text":"Can't speak too much for the drinks but the lounge was more gimmicky than I expected. The ","useful":0,"cool":0},"zTcZIxPbhymR82nk0dJsVA":{"text":"Awesome concept but too crowded to actually get a seat at the revolving carousel bar, whic","useful":0,"cool":0},"8d40bX2adOhE34eWV4IXtQ":{"text":"Yelp lured us to The Carousel Bar & Lounge. The reviews were fantastic and we were sold. \n","useful":3,"cool":2},"rdZEl_yF4-3Sp4NYK-_Nkg":{"text":"This is the home of the Vieux Carre!  What more do you need to know?!?  Lol!  Neil the bar","useful":0,"cool":0},"i7oX5TLZFG8lHH0zbUajDQ":{"text":"Not really my scene. It's a bar that spins as advertised. Fairly boring crowds and not a g","useful":0,"cool":0},"q4ol1qtnqnfeeoChdk-mdw":{"text":"My Vieux Carre was one of the better drinks I had in New Orleans.  Super strong and truly ","useful":1,"cool":0},"JUjg7u6kYw5NYh6hbEqsPQ":{"text":"To not give 5 stars to this place would be a travesty.  We came in here about a week ago j","useful":0,"cool":0},"AcZENlsE4JPgEwWGMPpJTQ":{"text":"Here's the dirt:  You know what?  It's a pretty cool place.  Sit at the bar and be transfo","useful":0,"cool":0},"iJq32IGh6fCtTRdNBe5kWA":{"text":"Maybe I'm just being an overgrown child here, but how could anyone NOT fall in love with t","useful":1,"cool":1},"iYd8IP0tn7OhltdpdyOQpw":{"text":"Reaaaally like this bar; it is very very hard to find a seat at the actual spinning bar bu","useful":0,"cool":0},"eF5wR88A3zZmJgDRnwhrlg":{"text":"One of the most infamous and intimate places in all New Orleans. It's more than just havin","useful":2,"cool":3},"XDQkxQnzTMurRdvc1c4bSg":{"text":"Nice bar. A bit gimmicky but that is the point. Great bartender when we were there and had","useful":3,"cool":2},"eS1b2LTriy0gWdpwjTrSgQ":{"text":"Supercool and fun. Ambiance is old-school-classy with a gigantic, actual carousel as the b","useful":0,"cool":0},"6Fz5GnF5Y9alhdjm0MlfSw":{"text":"Why haven't I written a review on the Carousel sooner than this??!  I've been here a milli","useful":2,"cool":2},"M_hOH98j15J5Z_xqdjMtxg":{"text":"The renovation on the Carousel Bar just kicked it up a notch. More windows for people watc","useful":0,"cool":0},"NqgdDXNgn1bkROx5pp8DxA":{"text":"Nice environment, very pretty.  They have the uniqueness that the bar actually rotates.  N","useful":1,"cool":0},"t4agpoObo8K2Rq0sYctHHw":{"text":"Get there early if you want to sit at the carousel bar.  If you come at the wrong time, it","useful":0,"cool":0},"uIz6eAFIYpWe9QSorDwD9g":{"text":"Merrily we goes around and around and around!\n\nHaving a drink or 2 sitting at the carousel","useful":1,"cool":1},"zLL0rcDrNSM8sYLWfllAGw":{"text":"Really cool and unique spot to grab a drink! I wouldn't get your hopes up for actually sit","useful":0,"cool":0},"QS06A3nU3y8sRtXMnHp3Rw":{"text":"Hurricane was great. Beer was flat. Service wasn't good.","useful":0,"cool":0},"1tx4xpyBAi9d8mG3FJgeVg":{"text":"Love it great drinks. \nGreat bartenders. \nTry the house drink it is wonderful. \nWe also ch","useful":1,"cool":0},"gM4F_tmz5ORcS95IV1X9pg":{"text":"Yay! This place is so cool. I love the whole setup of it. The bar itself does turn and tha","useful":8,"cool":3},"bahRy_onDqcLHFEPR3Q7FQ":{"text":"Nice ambiance, good drinks and pub food. The carousel rotates once around in an hour.","useful":0,"cool":0},"D8LQTPWEbP9XT8SqZAGPJA":{"text":"The drinks are incredible.  You have to sit at the carousel at the bar.  Really cool exper","useful":1,"cool":0},"AT9bZPwcqu88Y9op2XCi7g":{"text":"Maybe I hyped this place up too much in my head but I thought it was just okay. It *is* co","useful":4,"cool":0},"4O6ClZCWk9LipOMnvTL5Pw":{"text":"Love the moving carousel bar! Gin fizz is pretty good","useful":0,"cool":0},"dFwje2V52Du5OIwU6D4ECA":{"text":"the bar really is on a carousel, it turns round and round...  it can get crowded and if al","useful":1,"cool":1},"04xR6D9XSUdnh46HajWATQ":{"text":"Carousel Bar has been on my bucket list since I've moved here and now that I've crossed it","useful":4,"cool":1},"cV3QUbpf4JydB73ttWrKMA":{"text":"It is very unique and most people want to sit at the moving bar.  We came three times befo","useful":2,"cool":0},"80hwHM5G0YNl02-Kf2Qaiw":{"text":"Such a cool idea. I wish I came up with it. So it's basically a bar on a carousel that usu","useful":0,"cool":0},"XtGBldeQDL61wxTxtRkiVg":{"text":"Fun spot! You have to wait for a spot at the carousel but it's totally worth it. We had Cu","useful":0,"cool":0},"QwbVueB45TkzpsQ8WotSgw":{"text":"We had a wait at another restaurant, so we stopped in here. The rotating bar was very uniq","useful":0,"cool":0},"5zOVHv73rAmioPRAEnFnPg":{"text":"Huge fan of this unique and cool bar, and it was definitely a highlight of our trip! It do","useful":1,"cool":0},"lUT0QXoWj60N9Z8nb5MURQ":{"text":"Every time I go to New Orleans, this is a must stop for me.  I went twice this last time.\n","useful":0,"cool":0},"VosRWQsyUkBaJGqnDuo0Dg":{"text":"A hidden gem along the border of CBD and French Quarter - it can be hard to get a seat on ","useful":0,"cool":0},"cEGj-0YrAPnxWxoaWF11VQ":{"text":"The best place for a cocktail in the French Quarter?  Probably. Carousel Bar attracts all ","useful":4,"cool":1},"gFjjrJzLKqPIUIF79AMtXA":{"text":"What a beautiful place. Outside of the unique carousel bar that turns at a drinkable pace,","useful":0,"cool":0},"aCAOu5qedEV-WFj7T51pVQ":{"text":"I went with some old friends for a bachelorette party to Hotel Monteleone.  As we walked i","useful":1,"cool":0},"iiduncIfBMfyYNH6Xs0xXw":{"text":"A must visit bar in NoLa. The bar turns so it is very fun, but most importantly, the servi","useful":1,"cool":1},"xBM3YsOijtKsIXyfBQE8lQ":{"text":"Such fun! The bar is located inside the gorgeous Monteleone hotel. It's pretty much exactl","useful":1,"cool":0},"miV4iGk9D3Yq4TeLTCuGgw":{"text":"I liked the revolving bar novelty of Carousel Bar and the bartenders were really friendly.","useful":0,"cool":1},"pJ7jeJm6NZb2ZSNCsrkHJQ":{"text":"Cool theme bar with great drinks. Yes, drinks are higher than the bars on Bourbon Street, ","useful":0,"cool":0},"Mv5hgiie9Y1P1LcrQz4GdQ":{"text":"I went here to see the bar and atmosphere. It took a little bit to get a seat, and then to","useful":0,"cool":0},"V3dCmbzgOj0zqNiN66tlug":{"text":"Good service and classical atmosphere is the attraction to the Carousel Bar.  The servers ","useful":2,"cool":0},"13ICO0EevqWAwzL1pw-TEw":{"text":"Stopped by per a suggestion from a friend and I was not disappointed.  Although their sign","useful":1,"cool":0},"IBhJgt0jEmUWRTgZcVxOOA":{"text":"Just wanted to grab a drink for me and my wife at the famous bar.  And the bald headed bar","useful":0,"cool":0},"AyodO8zDG4NsEMIqBC5U2Q":{"text":"My wife and I went on consecutive nights when in town for the Sugar Bowl.  Loved the atmos","useful":0,"cool":0},"DUkSkuelPRN4AiDVFfa5Hg":{"text":"A pretty bar to check out for an afternoon cocktail! The bar itself is an old carousel tha","useful":0,"cool":0},"Pxf9-ALEVeCOgizs6HmARQ":{"text":"Nostalgia wins me over, particularly when my spots reinvent themselves and keep it alive. ","useful":1,"cool":0},"2Um5rolto5lrCnvjDT_YQQ":{"text":"This bar is more of an experience than a place to go for expertly crafted cocktails. Every","useful":0,"cool":0},"4NeXiua1bNojBvZ8rBHq6w":{"text":"Charlie and I are riding the carousel bar and loving the Pimms Cups! Soooo tasty and not t","useful":0,"cool":0},"9b89tyMtx7o7aosIsksZSw":{"text":"1st time in NoLa! 1st time here. Beautiful! So bit of a mature crowd, inviting atmosphere,","useful":0,"cool":0},"x2K7-pgvuSZeV99luBbcQg":{"text":"Beautiful hotel with a very cool bar concept of a revolving carousel. However, service was","useful":0,"cool":0},"NADce5X1t5UujFFbcj7inw":{"text":"Outdated carousel bar. Looked a little run down. Prices are $12 a cocktail which is within","useful":0,"cool":0},"rkbyMRpVLx9W2SZXAzMFHA":{"text":"This was a cool unique place to check out in New Orleans. The big selling Point here is th","useful":2,"cool":2},"_naQi5ElRXZdBZdTNNE0wQ":{"text":"Neat place the moving carousel was very unique. The drinks were great we just fought them ","useful":1,"cool":0},"u4x74F00HFv6LXDtKkWl3Q":{"text":"Meh. This is certainly a place that attracts people for its old timey charm and the fact i","useful":0,"cool":0},"J8USox0EM36ZgCrZnPolXQ":{"text":"Love love love this place. How can you not love a bar that is made of a gorgeous lighted f","useful":0,"cool":0},"aP1Fqg_8FwmVRWTXS8QbZQ":{"text":"I don't know the actual history of the Carousel Bar and I really don't care enough to find","useful":0,"cool":0},"vQgAj_Dv9KmINTk5SbCfKw":{"text":"The Carousel Bar is located in the beautiful Hotel Monteleone in the French Quarter. It wa","useful":0,"cool":0},"0PkpRVcQrl0xBnW9EPRS4Q":{"text":"I love this bar , classy , fun people, professional staff . Reasonable drink prices. a mus","useful":0,"cool":0},"d4u6tGLmz8NyqZEfY184cQ":{"text":"A great bar and lounge to hang out with friends and listen to great live music. I didn't g","useful":0,"cool":0},"GmejvNKLb10-qEy7LOjowg":{"text":"This is a must-visit bar when in New Orleans. They have a revolving bar that is like a car","useful":0,"cool":0},"6hSxk2t359qxl13nQ_7MqQ":{"text":"Classy crowd, no attitudes, great atmosphere and service....refreshing.","useful":0,"cool":0},"52D17BIQxTH-3btvu6Yf7g":{"text":"The Carousel Bar is a spot in New Orleans you've got to visit. It's not your standard hote","useful":0,"cool":0},"PCuH7yHU55yppfDTxbHeaA":{"text":"You do not need to be on the carousel to enjoy the atmosphere of the Carousel Bar. Find a ","useful":0,"cool":0},"O9lHfPoiXJjW48YzW79mrA":{"text":"Great ambience. This place is beautiful. Love the revolving bar. Great for an afternoon dr","useful":0,"cool":1},"FfbheP0YFNdmOJXPJkRQ3A":{"text":"Espresso cocktails in the morning!\n\nThere is a poem by Sharmagne Leland-St. John  that sta","useful":0,"cool":0},"R792zfpWR5hX6xbPJA8RxA":{"text":"Definitely a touristy place, but worth a visit. The rotating bar is pretty unique, but if ","useful":0,"cool":0},"TrC6rwfaOK8KvZDteXjZbg":{"text":"The place is absolutely beautiful. I loved the cocktail. The live music was amazing. Servi","useful":0,"cool":0},"1B9ZXSh1HrqfrAeGc4-7FQ":{"text":"This was just such a fun experience!  We came here on a Tuesday night, and it was very bus","useful":0,"cool":0},"UG5L890EvREzOkNcm7wa-A":{"text":"First time in NOLA but we've heard so much about the infamous carousel bar! We stayed at h","useful":0,"cool":0},"9gBy6n1cyxQC4IkdlYT4FA":{"text":"We thought we would drop in and see this legendary bar, and maybe make a quick toast. But ","useful":0,"cool":0},"Rr4rfk59fd7nci2r4Bpdjg":{"text":"Well it's a bar and it spins. Not quite as cool as the one in fear and loathing.\n\nWe just ","useful":0,"cool":0},"bNrXtQnjrqGgzOc2BdzVww":{"text":"Carousel Bar's taken down the walls to what was once the piano bar!  Yay! Although it's no","useful":1,"cool":1},"0qEWK_g7H012hakabGkLDQ":{"text":"Fab-u-lous! Get there!  If you are in the New Orleans area this is a must stop in for a dr","useful":0,"cool":0},"SRiMxJWtQs2gerXzCLzylA":{"text":"Shame sitting here trying to have a cocktail during restaurant convention been here 20 min","useful":0,"cool":0},"KNIM8JQbJxxSXjfC76fBBw":{"text":"The Carousel Bar turns 60 this Thursday! We visited this bar a few times when we were stay","useful":1,"cool":1},"ywKFThq_443BlRq3EDH2bw":{"text":"The bar is often packed. The first time we came here we just turned back around. Had bette","useful":0,"cool":0},"J4dy4X8SeBHY9H_EZ6YoNg":{"text":"I liked it, the bar went round and round, kinda like a carousel and they served me booze. ","useful":0,"cool":0},"iIqCHzgVne-EmyXagxB89w":{"text":"Quintessential bar experience in New Orleans.... Take a highly coveted seat at the bar and","useful":0,"cool":0},"55lOR0_c6oniMdPL5QNW-g":{"text":"WHO: The hubs and I - who were in desperate need of a (good) drink after getting soaked to","useful":6,"cool":6},"U0vLclEIhh7UUsxhabdrJA":{"text":"I really enjoyed the Carousel Bar.  I would say the moving bar is 94% amusing and 6% distu","useful":1,"cool":0},"AjxT83_JTEd_Zrci0mpGCA":{"text":"3.5 stars- Very nice fun active bar that does go around in circles. The drinks were ok but","useful":1,"cool":0},"gBsFPKsnaALnX4gN0tLbpQ":{"text":"Carousel bar is a legend and consistently on the top 10 best bar list in America. Spotted ","useful":0,"cool":1},"v6e-JMfS14Lr5RCuSM7Kzw":{"text":"At times, there can be a bit of a wait because of limited seating around the carousel bar,","useful":0,"cool":0},"VBowbYWsT-aLb_Lp1zxVhQ":{"text":"Cool location...cool bar that rotates around the bartender station every 15 mins!  Got a h","useful":1,"cool":1},"RQHaYTGQJnDlkbs1c7z9Mw":{"text":"Spent several hours here over the past few days since it was usually my last stop before s","useful":0,"cool":0},"BE_PdBwo1xxotcsD9NxU_w":{"text":"I've been here twice and just can't nab that coveted seat at the carousel bar.  And geez, ","useful":0,"cool":1},"KRwmEE8NxCoCev3F3pvodg":{"text":"What a concept of a bar! I'm not sure if there is any other bar like this in the world! Ei","useful":0,"cool":0},"yh6ujeBT7UFiSxvB-7ImFw":{"text":"Just like all \"space needles,\" The Carousel Bar is fun to visit and enjoy for its novelty.","useful":3,"cool":1},"fN3fJQxwnclSa1MwJNKYcA":{"text":"What a great idea, although the lights weren't on tonight and there were no free seats at ","useful":2,"cool":1},"qE5sba4IF4uxe9x5n2vUiw":{"text":"What's there left to say about Carousel Bar that hasn't already been said? It's a fun litt","useful":0,"cool":0},"ol9I8H-R0IEDimmIjirh2A":{"text":"The live music playing timeless classics and the elegant setting is the perfect adult sett","useful":0,"cool":1},"b5o6TjDL5KRvrFgL0v5Cxw":{"text":"Came to New Orleans looking to find some real Sazeracs and this place definitely made the ","useful":1,"cool":1},"AWbOmqOa-zlGvrH1fxBlDw":{"text":"The Carousel Bar came highly recommended when we were planning our trip to NOLA. We really","useful":0,"cool":0},"18wixgnuSz804r4UTfVgww":{"text":"Go to this bar, wait for a seat and then never get up!  limed seating at this rotating bar","useful":0,"cool":0},"edHlr8C8FvBoTvG2UvNXQg":{"text":"I tried the southern comfortini this evening which is a TotC signature drink at the Carous","useful":5,"cool":1},"noJSpiy0ZBEFPPg3UbQrRQ":{"text":"the carousel rotates! whaaaat.\n\naside from the gimmicky carousel bar, there's another bar ","useful":1,"cool":1},"ApaVM1QA_nlyXurnVRnsHg":{"text":"Great cocktail place! Inside the Monteleone hotel you'll find this bar with a real rotatin","useful":1,"cool":0},"kxRT3JpI_nEPQ1xmLlQvLA":{"text":"I find it intriguing to see a whimsical novelty ride for children dispense booze. But hey,","useful":0,"cool":0},"kOFUk5sPDdwtWn9dqFH5FA":{"text":"The Carousel Bar is located in the amazing Montelleone Hotel in French Quarters. The bar i","useful":2,"cool":0},"ZcXp4h3lBwOF5JkIi-nWSg":{"text":"No matter time of day or day of week this place is packed but the drinks are amazing, espe","useful":0,"cool":0},"AcIyDf3e4Y3gBR3cpY_Wug":{"text":"BEST. SIDECAR. EVER. The bar spins just slow enough as to not make a drunk patron nauseous","useful":2,"cool":2},"qGv6YtRnESjhcAl97BW6CQ":{"text":"Located inside Hotel Monteleone, Carousel Bar can't help but feel like a tourist hot spot ","useful":0,"cool":0},"g9LroZhgH2fDX2HmCwm5iA":{"text":"Excellent atmosphere!  Wonderful service.  We came at 11am when they opened and were able ","useful":1,"cool":0},"vgyr0b8UHesHKbk767wgig":{"text":"\"Have you seen my date?  I know I put her right here...\"\n\nGreat place that a tourist can f","useful":1,"cool":1},"MvimbbDiO1q3ip1nqknI9A":{"text":"Very cool bar with some nice high-end cocktails. \n\nI don't know what I expected when I sto","useful":0,"cool":0},"c_VA1he8fKhG82Io3DXN7A":{"text":"Preppy, crowded, after work bar for business types, which I am, but I thought it was a bit","useful":0,"cool":0},"RuxVBd_92OYDNY-YYZgjuQ":{"text":"Great atmosphere and classic New Orleans cocktails. A little pricey but worth it for one o","useful":0,"cool":0},"P1Pg9_av06Om-YRQ44VExA":{"text":"Want to get a drink where Capote, Ferber, and that Ya-Ya Sisterhood lady went when things ","useful":13,"cool":9},"l1Gdq9HXx8ZTHNoaX0KFtQ":{"text":"The. Greatest. Bar. I. Have. Ever. Seen. I just wish I was able to sit at the bar. *shrug*","useful":0,"cool":0},"YXq4W-NAwO6V9c3vpjJb4A":{"text":"This is a very unique bar that gets very busy. I tried to stop in here twice before and th","useful":0,"cool":0},"fsPvKEoP1LPh_h2ZPOV7Eg":{"text":"A must see in New Orleans. A quaint and wonderful piece of history with unique cocktails t","useful":1,"cool":0},"MkQ4VLMt4o1-6dAJZbrwwQ":{"text":"This is a great bar, and it is located inside the Hotel Monteleone.\n\nCheck out the bar its","useful":0,"cool":0},"oCE2qDbIUCAgPLVXVOiKHw":{"text":"Over priced and didn't have music. But it's defiantly a must see in Nola the bar does spin","useful":0,"cool":0},"TCfQKacsVWa-V3udrkyWYA":{"text":"There was no room to sit at the bar so we didn't actually stay for a drink BUT I am review","useful":1,"cool":1},"xM29JY7reXgy1YjANbwmrw":{"text":"Couldn't snag a seat on the actual carousel, but received excellent service and a fine dri","useful":0,"cool":0},"cSFP7DxvUUj6oPU8281cgA":{"text":"Such a fun and unique bar. My friends and I stopped in for morning mimosas on a saturday a","useful":0,"cool":0},"4WOTddE0wUhRjdLnmtWCgg":{"text":"A revolving bar with a vintage carousel....Yep!  Pretty cool concept, and better yet, tuck","useful":0,"cool":0},"SASeapPT65oa_n2SlVyEIg":{"text":"I had an extraordinary experience at Carousel bar in the Hotel Monteleone. So extraordinar","useful":2,"cool":1},"0QPNSWSfAb8RxQpgkAEnJA":{"text":"A classy grown up bar in the middle of the French Quarter craziness. You will feel so eleg","useful":0,"cool":0},"pvVQ6D6V2PFuEuE1TlQpTA":{"text":"One of the very few  mid-century Carousel (Merry-Go-Round) bars left! Staff is great. \n\nTh","useful":1,"cool":0},"fNQUdxnVRdS8akcYOwNtKg":{"text":"THE BEST BARTENDERS IN NOLA!\nI can't find strong enough words to say how AMAZING Corey and","useful":0,"cool":0},"m4XSxSDnqF7Zu_Oepw7CNg":{"text":"Definitely different than any of the bars down Bourbon Street. We were dressed pretty casu","useful":0,"cool":0},"zRbm7jDNZpeL5kapNJe3dA":{"text":"Great music and good drinks. Great place to hang out after dinner. It gets crowded quickly","useful":0,"cool":0},"RdXlhci_ZTozZd4csBvQHQ":{"text":"Great atmosphere, live jazz in the evening.  Nice drink menu.  Clientele are 30-50 folks w","useful":1,"cool":0},"qX953fV5g720Epi56TM8Rg":{"text":"Ahhh, a microcosm of NOLA- stiff drinks on a colorfully painted carousel that never stops!","useful":0,"cool":2},"sEiD9nMGCV16ONyeIvUbjg":{"text":"So you've been in the French Quarter all morning and walking back towards Canal Street to ","useful":2,"cool":2},"JFUcSQUMVrE5nxehADN0bQ":{"text":"This place is pretty classy  bar staff know their stuff!  great ambience and live music mo","useful":0,"cool":0},"e_BrZSZthT-IjkH3ZuLOkw":{"text":"I have been before and always found it to be a good starting point for a night out, howeve","useful":0,"cool":0},"zzeUGXqlFq9PideIK7PtxQ":{"text":"What a fun spot!  The bar is an old carousel that slowly turns (slow enough that it wont b","useful":0,"cool":0},"VeJQY90p0tBJUkmyYiG4Tw":{"text":"This place is so cool looking. They have a carousel inside a bar!  They had music playing ","useful":0,"cool":0},"EHGOnMGrmKFXBsPbzd48Rg":{"text":"Great atmosphere and nice energy.  Drinks are really good, and the band keeps it interesti","useful":0,"cool":0},"6mgo-obCaf9kzZ-pYpYE_w":{"text":"This place is a real hot spot in the Hotel Monteleone!  We stayed here for a wedding and e","useful":1,"cool":0},"1oBT8BWfazx1IOPI9OzU-Q":{"text":"Fun little novelty bar to check out. They have a carousel that spins around the room. Obvi","useful":0,"cool":0},"43TlsgtiDKNo_6lhHsRR7A":{"text":"It did take a few minutes but we were able to get on the carousel. It was definitely an ex","useful":1,"cool":0},"xqvc34I81IJPVvI6Gvvm8A":{"text":"Pretty place. The carousel bar is nice, but crowded. We sat at the one in the back. Had my","useful":0,"cool":0},"ircjcdelIIVN8VTxXd55Tg":{"text":"This place is a must see.  Its haunted, its historical, its a great place to try the offic","useful":0,"cool":0},"7QLrlDkq9HBSAdsBfdQJVQ":{"text":"The only place where they try to get you to drink so that the room stops spinning. \n\nIt's ","useful":0,"cool":0},"LAs3MllC7sj2jHR4wQPlaA":{"text":"Good times. Pretty damn cool bar in s nice historic hotel that actually spins. I timed it,","useful":0,"cool":0},"KdBwz-q-8u4fKgvv4vZElA":{"text":"I would have given this place 5 stars for the awesome day service and delicious drinks my ","useful":0,"cool":0},"u4SXOxOmE8TbbPKfb-L3WQ":{"text":"Pretty nifty bar I must say. I always admire things that are exceptional and different and","useful":0,"cool":0},"yAEBcDgTPDj2K7XCgMV94w":{"text":"Great place to hang out.  Close to Marriott New Orleans, Sheraton and JW Mariott on Canal ","useful":1,"cool":1},"ph3L9RFYzH4eKQ0NTT3k7A":{"text":"The bar spins. The best part of the spinning is the occasion pass by a mirror so you can c","useful":0,"cool":0},"qhz2Tk6TVg_UYxa10dtiQQ":{"text":"What a great idea! A moving carousel made into a bar.  We had to wait a bit to get a spot ","useful":0,"cool":0},"EWlWt9iw4oN6ACiOCqMGfQ":{"text":"Probably one of my favorite bars in the city.  I think it has a great ambiance and they ha","useful":0,"cool":0},"sLpHRQbKFwyL3YvQI4IeFg":{"text":"I really liked this place!  \n\nIt was a really neat idea and obviously different from the o","useful":1,"cool":1},"0x91YEdATcVMc1UPQr08gA":{"text":"** 3.5 stars **\n\nA famous cocktail bar in the Hotel Monteleone that has a long history; it","useful":1,"cool":1},"Dl8HKwdmbkfug3POovQkVw":{"text":"Very Cool Bar!! You must visit this place if you are in NO! The drinks are amazing and the","useful":0,"cool":0},"RoxfrYnAaZJjZGyMOO-Nag":{"text":"Love to come here when in NOLA but during the last visit I was overcharged and the badtend","useful":0,"cool":0},"yle0jcjHxXLudlUXza9FoA":{"text":"I came here to have a sazerac and feel important.  Everything was wonderful right up until","useful":1,"cool":0},"cb3SGOFtDacjlJuBULvX2Q":{"text":"I, as well as the rest of the group I was with, were incredibly disappointed with the Caro","useful":1,"cool":0},"eQKBe9VRrlFCdFMgIniRVg":{"text":"My friend and I came here twice in one weekend because the drinks and ambiance were both s","useful":1,"cool":0},"aFMHf35hmLPdTXWUbkItFQ":{"text":"Really cool bar in the French Quarter.  We were lucky enough to get three seats at the rot","useful":1,"cool":0},"1egsMx7-zUaSt6NygGAM8g":{"text":"Ambience:  4.5 stars.\nBand:  4.5 stars.\nService:  4 stars.\n\nCarousel bar is one of my favo","useful":2,"cool":3},"0pgAQBcdsHNa7BKJdU1hNg":{"text":"If you miss the Carousel Bar while visiting New Orleans, you haven't had the visit you cou","useful":2,"cool":2},"w4a8o7A0tDs_28QU8vihdg":{"text":"A must-see when visiting New Orleans.  This is a fun hotel bar with an actual revolving ca","useful":0,"cool":0},"hOOnWYIYTRk9bU62k5wO5A":{"text":"Okay I get the novelty. Extremely loud and crowded. Made 2 rounds on the carousel and it w","useful":1,"cool":0},"vIHVbx_KG9XYbE_PNuPsDA":{"text":"We stayed at the hotel here so we walked by the bar a bunch and MAN, this placed was alway","useful":1,"cool":0},"aC8-jezQz0HHWWOPoPP3ww":{"text":"I agree with other reviewers: this bar is a great \"photo op\" and a novelty to see, but not","useful":3,"cool":1},"hvSuvJXciTz0blE6zaX8EQ":{"text":"Pretty near bar where the main bar rotates as if it was a carousel. Drinks a bit overprice","useful":0,"cool":0},"xyonjNoxqEA2N0a9CKd0RA":{"text":"My husband and I spent back to back evenings here! The cocktails are fantastic and the atm","useful":0,"cool":0},"vo4RYLWdntIst4nOIg5xuQ":{"text":"Nice ambience! I gave it 4 stars because I couldnt sit at the revolving bar. Other than th","useful":1,"cool":0},"cQSNtegqePDabeqZW4eH9Q":{"text":"This is definitely a spot you should check out for at least a drink to experience the caro","useful":2,"cool":2},"Sc2Q1G0kBAwjkya9dUkHOw":{"text":"This is a hotel lobby & bar you must see in New Orleans French Quarter. It's fabled haunti","useful":0,"cool":0},"_VzsjrM3_pBTYc_UIrr8gg":{"text":"Ok so here's the trick , find a table that advantageously allows you to face the carosel b","useful":0,"cool":0},"vM4nfsgd86p44h8homg4WA":{"text":"I have a lot of 4 star reviews going for my NOLA trip, but it was that kind of trip.  Caro","useful":0,"cool":0},"bhGsN1WwAr2elqKv6M0Vcg":{"text":"This is a real bar with actual bartenders making actual cocktails. Neil is a craftsman bri","useful":0,"cool":0},"BNbEajy0JyEnxsad0sCOZQ":{"text":"What an amazing place to have a drink. I got a seat at the bar out of sheer luck. And I wa","useful":0,"cool":0},"ArMO2qtMXSovtCotZnmMQw":{"text":"I loved staying at the Hotel Monteleone, and the Carousel Bar is certainly a NOLA bucket l","useful":0,"cool":0},"lWKOwiF6GoM2_sSx8XJNEQ":{"text":"Stopped in for a cocktail before heading out for dinner! I wish we could have sat at the r","useful":1,"cool":0},"0m1AOqABkp9FkSXpML5h_A":{"text":"Well made drinks, friendly bartender and fun atmosphere. Great place for a couple to grab ","useful":0,"cool":0},"B9avZsUMpF0GbJ6wWQ6C7Q":{"text":"HAIKU REVIEW\n\nDr. John has been known\nTo brazenly tinkle here.\nThe ivories, that is.\n\nGrea","useful":1,"cool":2},"q3aRpQzad4jjRaUeSScx7Q":{"text":"I suppose this is one of those places you go to check it off your list. Busy hotel in gene","useful":0,"cool":0},"vufzhwfxU9maty-4cHDXoA":{"text":"Very cute bar to attend at Hotel Monteleone!! Make sure you get there early since the bar ","useful":1,"cool":0},"Jnxx_Qb_K0ADf4vaW-94Sg":{"text":"Great setting for hotel lounge/bar.\nDrinks are a little pricey but they are good and stron","useful":0,"cool":0},"s7kMFvJseSSH7E6IWbtIsQ":{"text":"The atmosphere is great!  Who doesn't want to ride a carousel while having a cocktail.  Th","useful":0,"cool":0},"Zcwv9uD9dgnCjlEwOCeBgA":{"text":"Carousel bar is an attraction within a hotel. It was recommended to us by a friend. And th","useful":0,"cool":0},"IRi34yP3M9d3x6Gqznw-zA":{"text":"Carousel Bar and Lounge is a cool place to check out. The bar is actually on a carousel an","useful":0,"cool":0},"gmS9xw-1dl8amDbCdqxqgA":{"text":"Don't go here just for the carousel bar, cause you'll most likely be underwhelmed. Not tha","useful":0,"cool":0},"vehIJrGTvHBn95EB1aQybA":{"text":"Awesome!\n\nMy friend and I came here the Monday before Mardi Gras after having a massage at","useful":2,"cool":0},"_KMkPcQ7UwMsonIODWx2jQ":{"text":"Very unique setting and very new Orleans. The bar really rotates. Sazerac traditional drin","useful":1,"cool":0},"OjvFMhA-LN5LjgfGBjWgwA":{"text":"In town for a convention and we would generally have a large group for a pre-dinner cockta","useful":0,"cool":0},"W8tV6U2JgjIvTdk8YhZYGg":{"text":"The actual bar MOVES around just like a carousel!\n\nCorey, a very nice bartender/mixologist","useful":1,"cool":0},"aGV_CtwieKcWs6iOwoKtCQ":{"text":"Great bar and good drinks ! It's a must go place in NOLA.\nI'll be recommending this place ","useful":0,"cool":0},"Bl_dhIGy-ls5Eyug8YZPJA":{"text":"What a night. We arrived at midnight which was a great time because we were able to find t","useful":0,"cool":0},"bF93Zwf0ityMZOoM8lscWg":{"text":"Was attending a Team Meeting for the week being held at the Monteleone, arrived at the hot","useful":3,"cool":0},"q-rlaq1rGstRmgoIJo_KrQ":{"text":"I have been going to the Carousel Bar longer than I can remember. It hasn't changed since ","useful":3,"cool":1},"ceHQVGrq0EXBoSIf8q69MQ":{"text":"Neil was amazing! Drinks are good and the customer service is even better! We came twice d","useful":0,"cool":0},"cZIl3HcTu1NMBQ2M4Jik5g":{"text":"Yes drinks are a bit on the pricey end but it's New Orleans in the French Quarters and the","useful":0,"cool":0},"OUd9geJnUkZR2DhsJdX64Q":{"text":"Coming from Binghamton, NY (the Carousel capital of the world - according to Wikipedia, we","useful":1,"cool":1},"_bQGLlYObROVyMuLJ_uHkQ":{"text":"I love this place. This is by far the coolest \"hotel bar\" I have been in. \n\nWhile the chai","useful":9,"cool":9},"w7R44qcHlyesfxsjPkqYJw":{"text":"Well known,  popular spot because the bar rotates... but they use red, fake,  maraschino c","useful":0,"cool":0},"1-ILlwrcrW88D5WcgV8vOw":{"text":"Came here on a Friday night and we found seats pretty quickly! \n\nThe seats revolve around ","useful":2,"cool":0},"mid4H1J8DVO3gXJcOGMQIw":{"text":"The Carousel Bar was my first stop during my weekend in the French Quarter. I arrived fash","useful":5,"cool":4},"fB0yWCCo820Ac2hRCLZxPA":{"text":"Logic would dictate that a rotating bar in the French Quarter would be a bad idea.  The no","useful":0,"cool":0},"WOzczC7ql1E1akoEjn-4Gg":{"text":"I really like this bar and lounge -- classy and quiet, unlike the college frat row madness","useful":0,"cool":0},"GxtwyDiOS8T4AeAAeTG2gw":{"text":"Must stop in this bar, which does spin slowly. It's just inside the entrance of the hotel ","useful":1,"cool":0},"O36uR_4iLs-vyu51y-c-wg":{"text":"You have to go there at least once on you vacation in NOLA.  Yes, it is a tourist trap but","useful":0,"cool":0},"pPSdBQYCSic7NqpCItaToQ":{"text":"Carousel Bar is in the Hotel.  I thought it was some cheesey dive bar but it's actually a ","useful":1,"cool":1},"Rw-_WGjZ0Ja9cq-QKu2n1A":{"text":"Sh*thole full of old snobs. Avoid at all costs. Smells like a nursing home. Drinks are ove","useful":0,"cool":0},"qYPgEvAf2wnXp8-kZzghLA":{"text":"It's funny how listening to a certain tune on the radio or detecting the intoxicating arom","useful":14,"cool":10},"G09Gw6SWWfQI3qocoqfjhg":{"text":"Definitely a \"tick the box\" place in the Quarter, but when you look past the kitsch and th","useful":4,"cool":0},"TFMQ9dBQx-TE2Lpa9quUrw":{"text":"What a fun spot!\n\nI dropped by with a friend for a drink on a rainy night and we were luck","useful":0,"cool":0},"ORyyVbr6Veq2O8nU7rKlow":{"text":"Drink are good when ordered from the bar and the bartenders are nice. At this point I woul","useful":0,"cool":0},"ao1-xBUeujZ45l-yYRdZLA":{"text":"The 1 star is for the ambiance.  The service that we've received is horrible.  We ordered ","useful":0,"cool":0},"ithkp_DmsXLC2oClGqgeTw":{"text":"The only place I know where you'll feel like you're drunk even before you start drinking!\n","useful":13,"cool":14},"JeDdhOf5zCixvzlG-TzCoQ":{"text":"How can you give this place less than 5?? Unless you get angry cause you go to the bathroo","useful":0,"cool":0},"Ew5JJ9137lnE3-b4TfBWhw":{"text":"It is fun to have a drink at a carousel bar and made great pictures.  the bartenders were ","useful":0,"cool":0},"BkAskQ5Xtr-PTH50CQltBA":{"text":"Unfortunately I previously recommended this spot to all my out of town friends bc the gin ","useful":0,"cool":0},"TrVjb0RW6MBYgEP7uoh4xQ":{"text":"Very cool concept for a bar. With an actual vintage carousel bar inside that rotates so th","useful":0,"cool":0},"ngYEpWa9TKChUlnwW3Wt0w":{"text":"Last minute decision to have a late dinner here...service was great - our server was knowl","useful":0,"cool":0},"WNZ0Btc2E6EBRMrqY--SAw":{"text":"Great cocktails and great bars!!!!\n\nThis place is a real NOLA classic. The bar of course s","useful":0,"cool":0},"nbdIs04QRL8miNB0Gra2qw":{"text":"Not so much a fair interview on my part, but we made our way over to try this place out. O","useful":0,"cool":1},"MJAHe_7n_0ChAYPE4yrtfA":{"text":"Love love love the champaign cocktails here! Some of the nicest bartenders in all of New O","useful":0,"cool":0},"nFMPU8-eIetfPz80BKjtWg":{"text":"Nice. Cool concept with the moving bar. Good place to have a drink, but a bit pricey.","useful":0,"cool":0},"0MlJlZvLuQzaV077LK3vEA":{"text":"it's a novelty, but with overpriced drinks, and it can get very loud after a while. I coul","useful":0,"cool":0},"SdxZX5h5V_5ngfaG0_DmYw":{"text":"The bar is located in Hotel Monteleone. Gorgeous setting & if you are lucky you might nab ","useful":0,"cool":0},"rHfwnZaFcpOMg1r8oyGI_Q":{"text":"Another one of hubby and my favorite stops while heading out for a night on the town. Some","useful":1,"cool":0},"QJfVEqQQEtGVPGYfc-kTXw":{"text":"This bar was so cool and a must when visiting New Orleans!! The bars seats rotated around ","useful":0,"cool":0},"m7LC5htiPLzNz6KIAF_F8w":{"text":"Returned to visit the Carousel Bar after several years and although the atmosphere and rot","useful":0,"cool":0},"XxeKkfGqKjH18wyPu7-QWg":{"text":"It's a great place to listen to live music. Very nice drinks.","useful":0,"cool":0},"5nmU1a6Hos-NsFFGxzTiXA":{"text":"I'm definitely a fan of this bar. It's nice, clean and offers a quite place to take a date","useful":0,"cool":1},"pYNmg3fEp9LlZj1ckGDmQA":{"text":"This is one of the tourist must sees in New Orleans. It's a bar that rotates so I have no ","useful":0,"cool":0},"PbtRUHP5Ie4CEJmBPdKYTg":{"text":"This bar is fun lively and beautiful great music live band not a bar you should miss in Ne","useful":0,"cool":0},"h6A56J48Hig2nlFkF_nHRA":{"text":"Carousel Bar offers a little bit of kitsch and a lot of class.  Featuring a slowly-rotatin","useful":5,"cool":4},"OSYdF_ksnrUrnTipVUasJw":{"text":"Go here even if only to earn the obligatory, tourist checkmark. I may or may not have expe","useful":1,"cool":0},"4SKQl426USXTaZg-7gVVUg":{"text":"My favorite bar in New Orleans! The drink menu is diverse and the bar tenders are very ski","useful":0,"cool":0},"3EWPcEjWEt9CjsXbvtjh_g":{"text":"I finally got a seat!!!! I passed by this bar four times over the course of several days b","useful":1,"cool":0},"HCWda6UuFxXGeil1lxmUyw":{"text":"A nice upscale hotel bar that makes a good cocktail for $10 or so.  Also the bar rotates, ","useful":0,"cool":0},"D3AkSOND4SzRx4-w7qQ__w":{"text":"Was lucky enough to get a drink voucher from my hotel for the carousel bar. Had a deliciou","useful":1,"cool":0},"SghmX1j7ulj0XXSCpYoTPg":{"text":"We managed to snag some seats at the revolving bar after a short wait. Very fun and differ","useful":0,"cool":0},"nyDYnEPLj0nXbPHf9jiyxA":{"text":"Great ambience, greater band.  2 or 3 drunks but they took care of them real quick.  Class","useful":0,"cool":0},"r4BlLG8rvxBXaoZwzLciKQ":{"text":"Super cool place. Got there at 11:00am to hope to beat the crowd. Not so much, place was p","useful":0,"cool":0},"EiSFtl6fI41YkIoeMLV0Pw":{"text":"The carousel bar is a must-do when visiting New Orleans    Make sure to sit at the bar and","useful":0,"cool":0},"s06mk_8JJVh_zAKK5csV-w":{"text":"Amazing cocktails and waitstaff.  Seafood beignets were great.  Nayo Jones performed and i","useful":0,"cool":0},"u8O-mHhpl5uRa0ZZ-Fg-NA":{"text":"Jacques is the best bartender in New Orleans! This place is a must see spot. Get the papa ","useful":0,"cool":0},"Qamhgnfw55rhMt7WOswINw":{"text":"Really cute bar located in Hotel Monteleone. Able to sit at the rotating carousel bar in t","useful":0,"cool":0},"m01bOIcBBnbe021HisDmuA":{"text":"This is a must-see bar in the French Quarter for its unique atmosphere. The bar is a rotat","useful":0,"cool":0},"H9W0g4XugUpjmdag_SeQog":{"text":"Great cool rotating bar which is a carousel located inside the Hotel Montelone. Very cool ","useful":0,"cool":0},"1cAkbqwA_TfOy7H7lgoYgw":{"text":"This is one of those places you have to go to to check off your list when you travel to NO","useful":0,"cool":0},"Sl_SadRX-mQSKJyoHrPzPA":{"text":"nice place- drinks were very good, although the waitress was a bit frazzled- having to cov","useful":0,"cool":0},"OyyTiqzXA1HydpaqkRYRRg":{"text":"This is another mega tourist hot spot. They are always way over capacity and probably shou","useful":1,"cool":1},"ThYkAO_cDG5a7zcPEdOSlA":{"text":"Personally I think this bar is a bit overhyped but people seem to love it. I don't think i","useful":0,"cool":0},"5ToW2Y_wEVbwiiF5qO7Syg":{"text":"Great classy place to go as an alternative to the party scene in the French Quarter. Barte","useful":0,"cool":0},"rZ7PMEyQ_h3xG8RUrfKK2A":{"text":"I am sooo happy we stopped in during one of our last days in nola. We didnt sit at the car","useful":1,"cool":0},"KLyPhKc4KZwwuNARRg1eaw":{"text":"Solid bar choice in New Orleans. There is the novelty moving carousel, but it fills up rat","useful":1,"cool":0},"z1dEBQy6fZtJ8OElELbLwQ":{"text":"We stumbled upon this place, just walking by looking for a place to have a drink in the ea","useful":0,"cool":0},"kX1mk7sXdDaYpSi_HySp8g":{"text":"Cool Bar atmosphere, but could not get a seat at the Carousel Bar...does not have much sea","useful":0,"cool":0},"iQDYxDzApeda3T3-2xGWPg":{"text":"Excellent service at a rotating bar on the first floor of an historic hotel. Signature dri","useful":0,"cool":0},"Er7KUnwdEJMdhMPya44iJQ":{"text":"Small bar, but if you get lucky you can grab a seat. the bar rotates so its really cool, a","useful":0,"cool":0},"KjBJWamw63fl9GAUveNZnA":{"text":"This is a great classy bar.  The bartenders take time to craft your drinks and I beleive t","useful":0,"cool":0},"VO17cpRgZYGxOhU3RAdyiw":{"text":"Meh. Such a tourist trap. I was expecting a much more gorgeous and impressive bar. All I f","useful":1,"cool":1},"iuX2DJEKnnKbIptjEcfVMg":{"text":"What can I say about this place. It is absolutely fantastic here. I'm so glad that I got t","useful":2,"cool":1},"vlskTmKQ_jwyfFbzJZJ7ZQ":{"text":"I have been to this lounge couple of times.  I like the atmosphere a lot for sure.  I mean","useful":0,"cool":0},"dqJd836W351lzkM0p-gD3A":{"text":"So much fun! The bar itself is an old carousel and it (very slowly) rotates while you sit ","useful":0,"cool":0},"vOqBY_fSypVeuA7TC42wSA":{"text":"Nice atmosphere.  Sure, it's touristy as hell, but settle in, have a few drinks and enjoy ","useful":0,"cool":0},"VOzY-nS4kmw5BPqubUTotg":{"text":"We stopped in on a Wednesday afternoon in March and it wasn't too crowded, but we still ha","useful":0,"cool":0},"4cnjJsE809giUlMXYBNSDA":{"text":"The service was horrible, waited and waited and no one came. Couldn't get a seat at the ca","useful":0,"cool":0},"NqtFTJswxoqj1TOR-JJp4A":{"text":"All in all its a novelty to come sit at the bar while you slowly spin around the room. But","useful":0,"cool":0},"3CMXSfk5ZVGQ1TX-WJjXxA":{"text":"This bar is really unique.  It's actually made out of a carousel, which rotates around the","useful":0,"cool":0},"bc5wl4Wgm1mzu5zMKfAKRg":{"text":"Delicious drinks! I ordered the Cherry Manhattan and my friend ordered the French 007. I w","useful":0,"cool":0},"X6MqdS9eNuUMg8CWr6837A":{"text":"Stopped by on our last night in town and got to sit at the bar.  Very unique and drinks we","useful":0,"cool":0},"E27uSgs3JlV31z2VYpqniQ":{"text":"WEEEEEEEEEE!\n\nThis is a nice upscale bar in a beautiful hotel.\n\nThe bars main feature is t","useful":1,"cool":0},"4vZwkD-6Bd7yitnu4vDAjQ":{"text":"Located inside a hotel. It is a big carousel that turns. The place is pretty busy as it is","useful":1,"cool":2},"AYbQuO3lKLw3ETPdJyYw-g":{"text":"Amazing craft cocktails! Fun carousel bar, which rotates slowly! Beautiful paintings and l","useful":0,"cool":0},"8O9gfiLd-DIdsRwHLGgs6Q":{"text":"This is such a unique experience. We sat at the carousel and ordered The Monteleone (not o","useful":1,"cool":0},"7Cla9gvboLFRnnF8x6OBuA":{"text":"I just had a random flash of something that made me laugh- something that happened at the ","useful":4,"cool":4},"KuHgY9iTTgbkhaPHZE5Ifw":{"text":"Great fun at this top 20 bars in the world. Be patient and have the drink of filled fun an","useful":0,"cool":0},"0Mlz-Lv9SkWTy2HV84Pp4g":{"text":"Our server, Jacques, was awesome!  He made the drinks fast, he was friendly and funny.  \nT","useful":0,"cool":0},"DVY2ZK0me26eC8M8XHZIhA":{"text":"Torin the bartender at the stationary bar was nothing short a shameful representation of t","useful":0,"cool":0},"Zu2_m6OKg-8tj8YM0PUTFg":{"text":"What a different twist for a bar. It's a must visit if your in nola at least for the exper","useful":0,"cool":0},"Cs0Wki0_zaqKpjeUbSqq4w":{"text":"Yep, it's true, many people will tell you to go here, but there's a good reason, and its n","useful":0,"cool":0},"MUZanTklJ_g2YF_e_QwZeg":{"text":"This is definitely a spot to check out just for the experience while in New Orleans! It's ","useful":1,"cool":0},"Kck6qHF6-I2L7gKqYC4ezg":{"text":"This place is awesome! We went yesterday morning just when it opened, so got seats pretty ","useful":0,"cool":0},"S-1nV8shFfIInkCu6WJzJA":{"text":"Great atmosphere. Excellent drinks. Friendly bartenders, for the most part. Pimm's cup is ","useful":0,"cool":0},"OU18YVSYtiZFWugRmytoiw":{"text":"Whoever decided that drinking and turning around in circles was a good combination?! I'd l","useful":2,"cool":1},"8aAOvOKHGAwYbCeGMoB49g":{"text":"Hard to get a seat at the bar, but even if you can't the atmosphere is great, the service ","useful":0,"cool":0},"c79RLoSqqGbVV1FUzcQfbQ":{"text":"I was not a fan of this lounge/bar, it's very over rated! The concept is very cool but it'","useful":0,"cool":0},"0DxvBX2r01Iz_ZnwmT824Q":{"text":"Great sazerac. The place is always busy but the back bar area is quieter than the carousel","useful":0,"cool":0},"-W3OJuUjy8gYzWrXLCUUcg":{"text":"Solid drink and appetizer bar in the quarter. The spinning bar is pretty cool. The Cuban s","useful":0,"cool":0},"xAecSgAl-ab7auCWlNlNuA":{"text":"The bartenders give exceptional service. Helping everyone around the bar abc lounge to mak","useful":0,"cool":0},"q_dwHZhuRxd6zhJgBL1r-A":{"text":"Super fun and cool bar!  would def come back here when I visit Nola again.","useful":0,"cool":0},"vam1g1HwGAxOUdkM5ZeGUA":{"text":"Corey is an amazing bartender!!! We've come here every time we are in NOLA and this is the","useful":0,"cool":0},"iYLqcWe85WV9L6rFEEkn7w":{"text":"Make it stop!\n\nAs the name indicates, the Carousel Bar turns around, and around. Sure it m","useful":9,"cool":4},"ITc8sv1X0Ps-6ZKdXG77GA":{"text":"This place is pretty solid.  \n\nIt closes early though (compared to the rest of the bars in","useful":0,"cool":0},"iLFFH6Y0z-Frpfe0185kVw":{"text":"Great drinks and friendly staff!\nHotel is gorgeous and well kept.","useful":0,"cool":0},"P8cBQbUba8WZ8Bpgzl3Lbw":{"text":"I've had mixed experiences here...this bar spins, like a carousel, and is located in a hot","useful":2,"cool":1},"S78f_zh34IID-3naaXDCSw":{"text":"This was my fave bar! It's a completely round bar that slowly rotates. It takes about 5 mi","useful":1,"cool":0},"V5_Zu2Ir0qdwd-jv_ZD5wg":{"text":"Bars that slowly rotate can make for a confused evening after a couple of drinks. Luckily ","useful":0,"cool":0},"sL4T5DIWpn31YxO8qdrE2g":{"text":"This bar is fun yet classy - such a refreshing change from the madness on Bourbon St.\n\nI g","useful":0,"cool":1},"u2FL4KZKXVes4aih-DazUg":{"text":"Wonderful cocktail menu, atmosphere, and appetizers.  Highly recommend the pimm's cup!","useful":0,"cool":0},"GrBfMu8RywWFtGBFBHzTTg":{"text":"If you have visions of yourself riding a white pony around a spinning carousel while sippi","useful":1,"cool":1},"pxTuR_NFNkLMVK_FfOJvvw":{"text":"I was expecting to sit on a horse, but sadly it isn't that kind of carousel. :( What I did","useful":0,"cool":0},"FIxttrJvysHgzfM2ynkKPA":{"text":"Great novel bar! Definitely a place to go. I would go in the beginning of the evening for ","useful":0,"cool":0},"qZbJQ8qPoNF71J7NqQs7uA":{"text":"Very busy, wasn't able to order anything as there was no where to sit and it was during a ","useful":0,"cool":0},"eepGkuHzPdCkXHQ-EhXibQ":{"text":"Definitely  worth a try, one block away  from bourbon st and away  from the rambunctious c","useful":0,"cool":0},"ymp6OpMpj-2nZ3qnpaKbRA":{"text":"This is a good place to have drinks if you want to avoid the regulars of New Orleans. lol","useful":0,"cool":0},"MqMlqtwl-5qrzVtzuzPKkQ":{"text":"It's a great spot and fun but if you want to drink don't go there. The bartenders were awf","useful":0,"cool":0},"LS2MV0Ix5sHQNjVE6b3sOg":{"text":"Sazerac, nuff said.  \n\nLocated inside the Hotel Monteleone is a great bar (that rotates) b","useful":1,"cool":0},"unW93vVQ5TKoamcTzVQXGQ":{"text":"I finally got a chance to hit Carousel Bar and the stars aligned and a couple was getting ","useful":1,"cool":1},"sjsjTDcGt0eI9xYntWiXLg":{"text":"Came here with my friends on Monday night after an amazing dinner at Sylvains and this bar","useful":0,"cool":0},"_zMapyfLpkeGtWpYZFqLqg":{"text":"If you like trendy places, it's a must-see in NOLA. My friend and I managed to score seats","useful":0,"cool":0},"pDRBZIEBo6dY3z8O_Z-HRA":{"text":"Fun spot!  Tried the Sazerac and Pimm's Cup.  Both drinks were good.  The Sazerac is stron","useful":1,"cool":0},"Vtm3CGZVvkDrmHkZwXBMWA":{"text":"Thank you Yelpers for helping me find this awesome bar!  We hit this up before heading out","useful":0,"cool":0},"u7z6-uBX-TB3dnAa_9sw8g":{"text":"Great atmosphere, terrific cocktails! If you enjoy whiskey, you must try the Vieux Carre!","useful":0,"cool":0},"Do9UVSDBWXr6idfVimAStA":{"text":"This bar makes my head spin.  :)  This may be the most desired Real Estate in NOLA.  Snagg","useful":0,"cool":0},"ObEeUJGHrfDWECLmQqUcDA":{"text":"The Carousel Bar and Lounge is an excellent space to listen and watch live bands. The Caro","useful":9,"cool":10},"PWzFfw6eZg7krsKyvd7FqQ":{"text":"Walked by here on the way to dinner. Heard a super happening place around the bend and saw","useful":2,"cool":1},"vvQQF7-YDOFnn5dKKPFWsw":{"text":"This is a lovely lounge, but any time I've been there it was chockablock with whatever con","useful":0,"cool":0},"yqELVAfc6rgis6ANBnatGA":{"text":"We had the best time at this bar. The bartender was very attentive to our refills and bar ","useful":0,"cool":0},"dZDnph2wrvJdPC6dDtepTA":{"text":"Atmosphere was awesome. Bartender was generous with alcohol and very knowledgable on the h","useful":0,"cool":0},"C4dHQuu3kV7v5v061UAtWQ":{"text":"This is a super cute bar with a very slowly rotating carousel. Unfortunately it was always","useful":1,"cool":0},"iQQ_dR_O1wCaheQC5xB9YA":{"text":"Definitely a must see. The bar is beautiful the carousel moves at a slow speed. If it's bu","useful":1,"cool":1},"BM13xAehSeCTBGH6zFXK-A":{"text":"The Carousel Bar at the Hotel Monteleone is one of the Bucket List bars as far as I'm conc","useful":0,"cool":0},"0A1k8T1V58Vr6a3JK4w_BQ":{"text":"The bar is really cool to look at since it's a freaking moving carousel! Sadly that's the ","useful":0,"cool":0},"h9wGIR7RFQFGWwtfWvL5gw":{"text":"Place was a nice hotel lobby bar that slowly rotated. It was nice. Overhyped. Why people t","useful":0,"cool":0},"1Exyq1GDqMzsw9sX9nYzOA":{"text":"Great low key place to relax and grab their signature drink. I had a pimm's cup though and","useful":0,"cool":0},"xzUUWaziZDh0iIdrYFFnRA":{"text":"Incredible atmosphere, drinks and company. I put this place on my bucket list after Booze ","useful":0,"cool":0},"DLNNU2NXBRTBjWI2PUgHjw":{"text":"What a cool bar! Huge carousel in the middle of this hotel bar and the seats revolve with ","useful":0,"cool":0},"KpI21nVAZMxpY00qFhaaKQ":{"text":"I had heard great things about this bar, and while it's definitely worth a visit for the n","useful":0,"cool":0},"lqaJeWXZ4M_JgkMbNjGr4A":{"text":"It's a great break from the regular scene in New Orleans.  It was a nice bar for a quiet c","useful":0,"cool":1},"hWn80gbDNZZgaRf3jevwpg":{"text":"From the first time I walked into this place about 5 years ago, I fell in love and that lo","useful":1,"cool":0},"NcmaYoyXpS5r_UxlCjdy4Q":{"text":"Classiest bar in N'awlins.  We had drinks here around 2am on New Year's Eve night and had ","useful":1,"cool":1},"q-ISXn_bj0LD1Ds5LSItww":{"text":"Our party waited 30 minutes at the bar to be served and never was served.  Great atmospher","useful":0,"cool":0},"aeqVtk4TMy6u9jTI8tz1Uw":{"text":"This is a good place for old style NOLA where the barman knows how to make a drink as you ","useful":0,"cool":0},"lEiO34vwdCjF00msQBfNYA":{"text":"Note: I am not a bar person, so take this with a grain of salt.  The bartender was very co","useful":0,"cool":0},"UuA8M5KKXUgIWVX-HgcOHA":{"text":"While most people's reviews focus on the Carousel in the bar as the focus, this one will n","useful":6,"cool":4},"56j0sI4Zr3bpL18aDXo4iw":{"text":"Surprisingly good choice for a cocktail bar - seats at the slowly rotating carousel seem t","useful":1,"cool":2},"1uRFUXdoQshqMkzSEPw_lw":{"text":"My favorite bar in NOLA. Ah, so snoody and yet so contagiously wonderful. It's fantasy mee","useful":0,"cool":0},"j8vmgwv13H4Nr9988Qfa2g":{"text":"My wife and I were travel ling to NOLA with friends and The Carousel Bar was recommended t","useful":0,"cool":0},"U-wpzlYTFd5I48YldeltGQ":{"text":"The bar is a carousel! Yes, it rotates. For that alone you should make sure to visit but m","useful":0,"cool":0},"SoTrTIsQF_lYJsyUBaUTig":{"text":"We had a great time here. Yes, you will need to step up to the bar to get your drinks. The","useful":1,"cool":0},"eXJmDOqtiWdGbW6MOAIzcQ":{"text":"I always end up having amazing time in this place, friendly & professional staff especiall","useful":0,"cool":0},"H3ueRDhY1oogt6n72tA9fg":{"text":"Located in the beautiful and historic Hotel Monteleone lies the Carousel Bar and  Lounge. ","useful":1,"cool":1},"E8Jrl4due0sUaRLagke0TA":{"text":"The concept of a carousel bar is definitely fun, but not as fun in real life. There aren't","useful":1,"cool":0},"_mcZZbi3WckPY6Ej9iGzGQ":{"text":"So this place through Facebook and in the video it looked pretty cool. Just a heads up. Th","useful":0,"cool":0},"mHBFKXCgm0Nk0nHcGRYRlQ":{"text":"Best bloody bull ever.\n\nThere is no better place in the city of New Orleans to grab your f","useful":4,"cool":0},"XxXQGNurgrk5o1RV2wM-7g":{"text":"Truly a gem located inside the Hotel Monteleone. The Carousel Bar is unlike anything you h","useful":2,"cool":0},"nGqGw9cZeED3wdSpykPboA":{"text":"Neat concept!  The bar turns very slowly, yes, and you only really look at it if you're in","useful":1,"cool":0},"tsihhw8aySqszoNQrtC29w":{"text":"Cool bar to check out while in the french quarter.  The bar itself is located inside the h","useful":1,"cool":2},"1DfI-iLWIRhMm0Iz2yju9Q":{"text":"The bar is set inside the Hotel Monteleone and has 2 bars. The front bar is set on an old ","useful":2,"cool":1},"sgorwdZbZH2Yr7MKKswNFA":{"text":"I love the Carousel Bar and really like the updates throughout the bar and the hotel. Like","useful":0,"cool":1},"oS0HkpeG0_KgBTso7OgOtw":{"text":"This is one of our favorite places to stay in Nola.  Unfortunately we had a horrible exper","useful":0,"cool":0},"DnW8AIslnHs95THKbi_Qvw":{"text":"Very nice place to relax and have a drink.  My wife was very excited about the spinning ba","useful":0,"cool":0},"qarSe0llL8oBZDWN9NRtew":{"text":"Staying at the Hotel Monteleon, of course we had to have a drink at the carousel lounge. L","useful":0,"cool":0},"zYzvjfLgZ2yV28tTHRW5nA":{"text":"The bar itself is amazing! It's historic and just plain fun and cute!! It takes 15 minutes","useful":2,"cool":1},"Cb8JD5NWu7V_1QuvYGwJcg":{"text":"The place is cool: kind of upscale, but with a bit of tackiness.  They make a lot of class","useful":1,"cool":0},"Dva64XsmphWA9O5alVWIpg":{"text":"Love this place! Awesome drinks and unique scenery. I would definitely recommend it to any","useful":1,"cool":0},"CBbSeJCczYW9piGnk3O42g":{"text":"Touristy yes, novel absolutely! I loved the seats at the rotating bar and even with drinks","useful":0,"cool":0},"nCSgfdKDTlYC7KPQAM4w_g":{"text":"When you're tired of the yards of beer and beads on Bourbon, this is the place to go. As m","useful":1,"cool":0},"WwlDxPtu2mSiT2wPQbr95w":{"text":"Blue Crab Beignets.\n\nGet them. \n\nAnd then get a sazerac or a vieux carré. \n\nThen get anoth","useful":0,"cool":0},"eaNeGiIkpggJXPliO4tmHA":{"text":"This is one of my favorite bars in the city.  It's definitely at the top of my list of spo","useful":1,"cool":1},"SUmVhvYGyXR3sf7EHg85Jw":{"text":"Fun fun fun. Ride the carousel bar and act like you are one of the rich and famous. Great ","useful":0,"cool":0},"2B1fOIFyiD63hozBDHsFsw":{"text":"This is a must-see when in the French Quarter.  Located in the historic Monteleone hotel, ","useful":0,"cool":0},"DfGjfMWegz-b6Bu0VJni0g":{"text":"So my husband made sure we visited the Hotel Monteleone on our recent visit so that we cou","useful":0,"cool":0},"0jQhZd7KDcfwtSy-nX-EUw":{"text":"Marvin is the man ! He is attentive, historical and the bar rotates. You can't ask for mor","useful":0,"cool":0},"2Sf5F_r4a0pgLuyi1uMslg":{"text":"This is such an awesome concept. \n\nHowever, the slowly rotating bar can get annoying fairl","useful":0,"cool":0},"Em-kgYnKno_mT2Y9UzuVmw":{"text":"Super fun! We loved hanging sharing a cocktail on the Carousel in downtown New Orleans.","useful":0,"cool":0},"HP0fYyqgr2wN0trJGBq_VA":{"text":"Excellent and friendly bartenders. I had a gin fizz which was the best one I've had yet. A","useful":1,"cool":0},"d5iygvd3onbxLBNSUskjoA":{"text":"You're coming here for the experience. The drinks are nothing to write home about...but si","useful":0,"cool":0},"GNo68-3ajubLq5cUecc0UQ":{"text":"The drinks are fantastic and the bar is beautiful, but it is extremely popular. We were th","useful":0,"cool":0},"9FQdgGU4ayOVo0Un_RiIlA":{"text":"Awesome placw to grab a drink and talk. The rotating bar is def a plus. The drinks aren`t ","useful":1,"cool":1},"JcFb3dSS_9n9my1QgV5HnQ":{"text":"Who doesn't love riding a carousel. We came to NOLA on vacation and had heard of this plac","useful":1,"cool":0},"XrcEl0G05PJCHQIbhsdS-A":{"text":"I stopped in here just long enough to get a beer and take a ride around the bar. I was the","useful":1,"cool":1},"kpVCjF6P4a7q_G60vVRBXA":{"text":"Awesome idea for a bar! Spent hours easily spinning around the bar and meeting great compa","useful":1,"cool":0},"jeubFgblRzQS4zb6O7imfw":{"text":"Most creative bar I've been to. The rotating bar is usually full but if you grab a seat ne","useful":1,"cool":1},"hB5T7FHzZMPN8Mo1lhywpg":{"text":"Within The Monteleone Hotel, The Carousel Bar is always packed with people. As you walk in","useful":0,"cool":0},"_jl1fu3h8cx34nckdnvZHQ":{"text":"Great bar. Wonderful cocktail list, but even better - an attentive, knowledgable bartender","useful":0,"cool":0},"UHjdjYhup5GH5J9pXVZZVQ":{"text":"I came here just to said I did. It was BEAUTIFUL!!! But also packed,I guess that's to be e","useful":0,"cool":0},"av86KrtBpMtDdfl5Tyn9Jw":{"text":"Round and round, grabbed two seats on the carousel and enjoyed their craft old fashioned. ","useful":0,"cool":0},"-bDY8XbQ7BU2wLa5g2i-ZA":{"text":"4.4/5.0 would recommend to a drunk with class. Just watch out cause I get really dizzy. Li","useful":0,"cool":0},"aHvXGD_5jzRmUzQNctMSOw":{"text":"Relaxing....nice music...good cheese plate... didn't get a seat at the actual carousel bar","useful":0,"cool":0},"WiClcG0XJYcVakiB8zPmCA":{"text":"This is one of my favorite bars to go to before a dinner downtown. There's something about","useful":0,"cool":0},"QWvGGS1toh72EDaHEgudwQ":{"text":"This is definitely worth stopping in for a drink just to see the carousel.  Unfortunately ","useful":0,"cool":0},"X7DZ7MZwn3G7xwp6HnCiIg":{"text":"Best to be seen bar in Nola a tradition! Great drinks good times and the scene and service","useful":1,"cool":0},"7aE-ET3mJacTVebFm9ju7w":{"text":"If you don't know this place is there, it's easy to miss. There's really nothing that dist","useful":1,"cool":0},"FwgOpxaovSPbFWdkALECgQ":{"text":"Just to the right of the Monteleone lobby is one of my favorite bars on the planet, and on","useful":1,"cool":0},"duyZsRIqeJRu6eSjAafZbQ":{"text":"Phenomenal experience, and make sure you watch the people at the bar. Those people who hav","useful":2,"cool":0},"igA0xjkNhNtteWpEz5--4w":{"text":"This was a fun place to check out while we were visiting. Fun atmosphere, great music and ","useful":0,"cool":0},"qNM1N4rlyzV-TSLLjwF9yQ":{"text":"Inside the Hotel Monteleone  Carousel Bar is always a great novelty to hit up for a nice a","useful":0,"cool":0},"Yr18WvTsp8xW6aw1OfhkBw":{"text":"This is my favorite place in New Orleans by far, and I've been going there at least twice ","useful":0,"cool":0},"lhvWIWH3r7Hm2zF0I2vLvw":{"text":"I knew this was going to be a tourist bar but I so badly wanted to experience this place b","useful":1,"cool":1},"pjGo4xBcYeQ_AERqevfUxA":{"text":"One of my favorite experiences in NOLA. I actually sat at a table, but it was still cool t","useful":0,"cool":0},"zXuMHVyZbmtNgtjX1VKoGA":{"text":"Cheesy and touristy but so much fun and worth the trip. The revolving bar is fun and it ju","useful":0,"cool":0},"biFhgTQewWpFEKb658g8xA":{"text":"You really just go for the experience & fancy drinks. Tuesday around 7 was packed. The car","useful":3,"cool":1},"q1WvKJWxVNEXGButYAODHg":{"text":"most of this rating is owed to the convivial atmosphere of hotel monteleone's \"Carousel Ba","useful":1,"cool":0},"_msT1WBuWBa-5BCMFifqgQ":{"text":"Very cool ambiance sitting at revolving bar.  The bartenders take their time and really do","useful":0,"cool":0},"OUtxj7GiVOyTYDmTc5YFXQ":{"text":"Carousel was our first stop after checking into our hotel. The Carousel Bar is attached to","useful":3,"cool":2},"BPDopxD68jF7_9Ci4VCWfw":{"text":"A must see in NOLA. The bar is not very big but is worth the wait. The cocktails are delic","useful":0,"cool":1},"ol2h206282NU8GRfO0TRDA":{"text":"This was definitely something cool to check out, but that's about it. I walked by a couple","useful":0,"cool":0},"eMC8Il68zzGk_j0p7wv5Qg":{"text":"This is a absolute gorgeous bar, i stayed at the Hotel Monteleone! Defiantly something for","useful":0,"cool":0},"JbeKtm43o_apMsBwJzGWAw":{"text":"We had two very different experiences here.\nA 5-star experience on our first night in New ","useful":0,"cool":0},"6CXTSpqSAmqw7en3tbCA5A":{"text":"Can't beat the history, buzz and uniqueness. Hugh served us well and made the experience e","useful":0,"cool":0},"Aj4ZWVwew_Nw3Zda6JSgWA":{"text":"This was a fun and unique place to stop for a drink. The bar and the seats revolve slowly ","useful":1,"cool":0},"QmnRFpejiptxBxG-GpUtwQ":{"text":"A beautiful bar, not just for the novelty of the movement of it... but for the classic det","useful":3,"cool":1},"9Y2F0ocBVLa1qotJA911IA":{"text":"First of all the hotel this bar is located in is breathtaking!! Sky high ceiling and super","useful":0,"cool":0},"ma6zCmjMml3epQoqV-cOuA":{"text":"This was a really nice place. The wait for a drink on saturday night was pretty bad. Howev","useful":0,"cool":0},"e-2fvgsUa2RKHQbzn39Z6w":{"text":"I had bookmarked this place during my first visit to NOLA and forgot all about it and then","useful":7,"cool":1},"lhRN4RQHwb4Bfs3kp7BfPA":{"text":"This place was simply OK.  Not as ornate as I had imagined.  It was very loud, couldn't he","useful":0,"cool":0},"wB9a7DyPX7rCbQIdcApacA":{"text":"I had heard about this \"Carousel Bar\" from a few people before coming to NOLA and it defin","useful":2,"cool":1},"EpN2h4M59XJ0m2wrI9GcKg":{"text":"The Fleur de Lis drink is the best thing here! Hendricks gin with muddled cucumber- perfec","useful":0,"cool":0},"URE8ZTk7WCJjjxTmbELfYg":{"text":"Pleasantly Surprised! My wife wanted to go visit this place and I finally acquiesced to he","useful":0,"cool":0},"Dwrub08mMBi_vRTnqTnYvg":{"text":"I'd heard great things about this place but I wasn't that impressed. It seemed a little ti","useful":1,"cool":0},"OvSzNcBrweani-ru94G3-w":{"text":"We just happened in on this place... What a treat!  We were lucky enough to get 2 seats on","useful":1,"cool":2},"yPCbhbgN1X_23bJ6veBwxw":{"text":"A bar that spins? Surely you jest! But that's exactly what what this bar does. It is a dro","useful":9,"cool":6},"7RtizXv-o24Q9QWUassCPQ":{"text":"This is another one of those New Orleans institutions that \"people\" insist you must hit wh","useful":11,"cool":8},"ltUgdzyG9qymdB0iZsOr0A":{"text":"You pretty much have to try it once, but from a local stand-point, it's overrated. \n\nFun i","useful":1,"cool":0},"faK7q98Hi8uKANtyx8h4fw":{"text":"I LOVED the atmosphere and ambiance of this bar; it was classy and the concept was unique.","useful":1,"cool":2},"yRMqaK0gGj_6iGZqOaoctQ":{"text":"Beautiful hotel and bar. Friendly staff, despite very busy and crowded. Loved the actual b","useful":0,"cool":0},"13Ui0peOwUf0yItZv2rbzQ":{"text":"The Carousel looked really cool! It moves very slow and it is beautiful to look at. Unfort","useful":1,"cool":1},"S6XiLmQwSDIY2sfjTHbvDQ":{"text":"It's a bar. It has a nifty carousel bar where the seats and surface slowly rotate around t","useful":0,"cool":0},"y5Gc-gRiMNYbB5vO7j2rBw":{"text":"Well I start off saying that I've only stayed with a friend here before I moved here and n","useful":1,"cool":1},"GSxznu64aJUpnX_x_l3A5A":{"text":"My first rotating bar. What fun! \n\nAside from one unpleasant individual positively leaning","useful":0,"cool":0},"RS4bf7In_sVO9_nU2qxZ2A":{"text":"Dicks. I think they might treat you well if you're a senior citizen which was most of the ","useful":0,"cool":0},"m9gtonUOq4y6aoHFBGwGmw":{"text":"I had heard this place was an amazing place to grab a drink, but I was a bit disappointed ","useful":0,"cool":0},"DWmrTUKM4H33htFDvPOKrQ":{"text":"One of those bars that you have to try at least once. I recommend going during the day so ","useful":0,"cool":0},"lIwrBYxktEMrfAiNeOEMqA":{"text":"Childhood brought into adulthood. On a moving carousel as I have a drinks and appetizers. ","useful":0,"cool":0},"Ix4b9E_85p7uyXIo0z51FA":{"text":"Forget that the bar is a big carousel that moves slowly.. That's what brought us here but ","useful":1,"cool":2},"8gilEBohY5WR7Q2Db0lyAA":{"text":"All tourists ask the same question, \"I've seen all the tourist stuff, but really, where do","useful":6,"cool":11},"x97pcl1Nv-RPV9BlP_4fQA":{"text":"Very packed, no seats at bar, but great atmosphere and music, drinks were good. Service wa","useful":0,"cool":0},"4sTlWhE_aMIbEgG4D5pRPA":{"text":"We hit this bar up twice in a recent trip to town.  The first time, the fun was largely ce","useful":0,"cool":0},"7ISw4H9uMr2dyMtlbk8jVA":{"text":"cool place to visit. The bar / hotel itself is neat to see. It's tough to get a seat at th","useful":0,"cool":0},"FQwg44r2lLvTbslVjhljyQ":{"text":"I've been to the Carousel bar many times over the past 20 years. It is a fun bar with a pu","useful":0,"cool":0},"91ix67NqGQf6gcC7DjsiSA":{"text":"3 1/2 stars.  Most people who are my age like going to fun, hip, cool spots that offers gr","useful":0,"cool":0},"bce1Ddfu5hrPmtfLUL3I0A":{"text":"The bourbon milk punch, it's not sweet at all even though they add simple syrup. Which you","useful":0,"cool":0},"Me3REi4B8-Ppu1mfQqzORQ":{"text":"Fun! Walked in and got two seats! Bartenders seemed very overwhelmed, but the setting was ","useful":0,"cool":0},"TIjP5q6kl2Z87bhgcSWhvw":{"text":"very cool bar. service was terrible. everyone wants to sit up here so u have to cone when ","useful":0,"cool":0},"DFCzE2-HYEKgH_7drAHJEw":{"text":"Not as epic as I expected it to be. The drinks were ok and the bartenders were nice enough","useful":0,"cool":0},"9Ldb9WfWAt-ZF_-4ezEbvg":{"text":"One of my favorite stops when in town. Classy without being pretentious, a unique gimmick,","useful":0,"cool":0},"l1-1AjNHdTkLtaCR-tzq9w":{"text":"Bar is located at the bottom of the hotel.  Huge sitting area with tvs everywhere!  But ma","useful":0,"cool":0},"PtKl6ecsQWvI81-7Ff_pTA":{"text":"Wanted to get a seat at the carousel bar but was unfortunately full. Cocktails were okay, ","useful":0,"cool":0},"_mWWmv_B_ge6cGr6y17q6Q":{"text":"Great unique little round bar that rotates.  Marv and Jason the bartenders are great at co","useful":0,"cool":1},"IJpb2BkcC9y1_Oc_iBv0eQ":{"text":"By far my favorite spot in New Orleans. It is hard to catch a seat at the bar but there ar","useful":2,"cool":1},"xqZXiH6JVwFdCHKcCcrvHA":{"text":"This is probably stupid but I somehow thought there would be an actual rotating carousel. ","useful":0,"cool":0},"PbYKItWvumVxOKWK3kMqhA":{"text":"Wandered in here after walking streets of NOLA. \n\nSpinning bar! Woooo! Upscale. Very chic.","useful":1,"cool":0},"xrwVdxvWMqQeBeb6WlNvPg":{"text":"Took a break at the historic Carousel Bar in the Hotel Monteleone! What a fun spinning bar","useful":0,"cool":0},"C_mgC57-OhZ1bF67tZaWxQ":{"text":"Its always nice to make sure you hit a spot that you've seen in movies and feel like you'r","useful":4,"cool":3},"VCRr9jHxO9jp71HgyBeEPw":{"text":"This was a fun and memorable bar. It is located in The Montoleone which is a nice hotel. H","useful":0,"cool":0},"vWtHKsMXynF54c9vdnT2rw":{"text":"It's neat to see a moving carousel in the middle of the bar. The service was slow and it w","useful":0,"cool":0},"Y0_9G653uKpX5i8VawQx2Q":{"text":"If you're visiting the French Quarter, you HAVE to stop in for a cocktail. The hotel is st","useful":0,"cool":0},"q3pJSr9O9xbpjXET_QO8-A":{"text":"Delicious cocktails and very nice bartender.  We went in the afternoon and there were peop","useful":0,"cool":0},"E55sdL7QnEaR8PjL2rjnLA":{"text":"I love carousels. I love bars. BOOM. Together, they were just as great as I hoped! Solid c","useful":0,"cool":0},"jrcWho-1jXBlJcZOPDY9UQ":{"text":"Carousel Bar is a beautiful bar. I also love how the bar is slowly revolving. It's also a ","useful":3,"cool":1},"7e9oXgBvNpAq1St9-x4Mxg":{"text":"What a cool bar, but you MUST sit at the bar since it is a carousel...where else can you d","useful":0,"cool":0},"sJaOmkPifRxZBJBf771PcA":{"text":"Seriously, this place is magic. I wandered in, mid-afternoon, just hours before leaving NO","useful":1,"cool":0},"AUh08F3F8Gcrw48vB1WhrQ":{"text":"Delicious drinks but pricey. 2 drinks were $27. But I will admit the drink I ordered was a","useful":1,"cool":0},"BamYr9Q1ndAMIOHRI35VVA":{"text":"Get a drink here called the Goodie! This drink has the goods!  And if you spill any on the","useful":0,"cool":0},"oGH_DRos5ReSZbfRj2t7_A":{"text":"Love it! A MUST SEE IN NOLA! Get there early or you'll be standing.","useful":0,"cool":0},"Q8zeCw86UcxMf6Madqnwaw":{"text":"Classy bar and crowd here. Grabbed a seat and enjoyed my Fleur-de-Lis cocktail. It's a nic","useful":0,"cool":0},"6Rou4xXDME65y_p6mfnCeQ":{"text":"map props on liking donuts ;)","useful":0,"cool":0},"_KWUACCdIO117UCQs-oXyw":{"text":"Pretend you're with Hunter S. Thompson and enjoy the ride. \nGreat signature drinks, Marvin","useful":1,"cool":0},"wlVgVkVl2V6Ucn-Ayh-VTw":{"text":"Rudest bartenders I have ever run into. Surly, unresponsive and impatient, the bartenders ","useful":0,"cool":0},"3Qg_QpYChVA4DYNhP5Jenw":{"text":"My friends and I decided to just walk and find solace for dinner and stumbled onto this re","useful":0,"cool":0},"z7GVVg2NK9PWlEA06h62AQ":{"text":"If I could, I would give it 3.5 stars, but the unique and fun setting makes it closer to 4","useful":1,"cool":0},"Xn0Y-51CFmMM8vE3nSnmHQ":{"text":"An must-try upscale bar and lounge in the Hotel Monteleone. Grab a seat at the rotating ba","useful":0,"cool":0},"IwYNx5YS6QVcRDIX2_g8yg":{"text":"This bar is all kitch but worth a visit. The carousel goes round and round and if you spen","useful":0,"cool":0},"Cv91pTdP2C5G5bBu6UZ2CA":{"text":"Super cool spot with great service. My wife and I had a gin and tonic and they brought bar","useful":0,"cool":0},"TWxwD7NmUU4qERFUqwQgYg":{"text":"Went here for drinks before dinner. Very historic location within the Hotel Monteleone. As","useful":0,"cool":0},"3gtlvAZuBRF0erDOyVFkdw":{"text":"This is one of my favorite bars in the quarter. Gorgeous bars, some of the best bartenders","useful":1,"cool":0},"FZi0EnYD1quVRcvsbGC5Lg":{"text":"Great drinks, and it's very cool how the carousel rotates. It's just very hard to get a se","useful":3,"cool":2},"-XHIdPqc75jX4WOG9bIETg":{"text":"Sure, the rotating carousel bar is a gimmick, but it's a unique and surreal experience tha","useful":0,"cool":0},"0G8hr7KGvmpOAVeAzoH2Bw":{"text":"A unique place that everyone had recommended to me on my trip to New Orleans. You walk in ","useful":1,"cool":1},"sbESvU2z8u8JTVwkOtv-Zw":{"text":"what a cool place! sat on the rotating bar while killing some time. Had a decent cocktail ","useful":0,"cool":0},"iILqLnx7jSCGLC_trsWi-Q":{"text":"Really enjoyed this bar. The drinks are stiff, so be prepared - this isn't the place to go","useful":0,"cool":0},"ZSXpBzQAjSNWVeVBgH_ZiQ":{"text":"The very best place to start your Nola evening out or perhaps an afternoon cocktail...or t","useful":0,"cool":0},"iPpzAUuvIXN6K1IbaM7o5g":{"text":"Very interesting and slightly disorienting (round and round we go), but fairly lack luster","useful":3,"cool":3},"uYzxLJ_pYfqXA32mYkeSpw":{"text":"Great bar that makes very good traditional NOLA cocktails. On my list for \"Sazerac Sundays","useful":0,"cool":0},"a8IWTF0zTv-0dXNAmnIJMQ":{"text":"Cutest bar I've ever been to! Literally a carousel that moves around - albeit slowly, but ","useful":0,"cool":0},"2l1UTDXBk5kZJCcEkTjnaw":{"text":"Nice staff, amazing bar, but their drink menu needs to be updated.  Too many sweet drinks ","useful":0,"cool":0},"RuWWxgs7tpvFwOLmuikZSw":{"text":"A bar that rotates. Need i say more? Classic drinks. Friendly staff and fellow patrons.  G","useful":1,"cool":1},"jVMVFmbk6dOkCXNZL01B-Q":{"text":"I came here for the aesthetics and the carousel inside the bar was definitely a hit for ma","useful":1,"cool":1},"uvKAZZjw_WV2uHAtL3mL-Q":{"text":"I thought I reviewed this place already....??\n\nIt's swanky, it's in a hotel, there's a pia","useful":1,"cool":1},"1si6NGi3PlFLE19_MdZx9A":{"text":"Fun atmosphere! Smaller than expected but drinks were good and bartenders were friendly. D","useful":0,"cool":0},"eVEdSd7DQeoBmmixAgCjOw":{"text":"Not sure if spinning is naturally a good thing when it comes to drinking.  Even though we ","useful":1,"cool":1},"1qC3xM84_3UHE2GtEUtcDw":{"text":"Very cool spot to grab a drink...if you can find a seat at the carousel bar.  If not, it's","useful":0,"cool":0},"AESTnLD0l7k1LPk60ul29A":{"text":"My wife and I were vacationing in New Orleans, and this was on our list of must-see spots.","useful":0,"cool":0},"3fYTN48AzLBDdcvT3YRg_Q":{"text":"Very cool bar/lounge to grab a drink in when visiting downtown NOLA. Our group got several","useful":0,"cool":0},"_F2p5ia_Pdk6JaCJ9ymJzg":{"text":"Went there with my hubby. Good cocktails and a delicious dessert (had bread pudding) AND~~","useful":0,"cool":0},"1MRhy0oNJ6pAlQ_wBleiJw":{"text":"One of our favorite places to visit on our short trip to NOLA...drinks were delicious, but","useful":0,"cool":0},"3N3b24WKdBUX22ssTqi0HA":{"text":"got lucky with one seat at the infamous carousel bar...the perks of traveling solo, met a ","useful":1,"cool":1},"Z7GMPiI21t_WxttbrBntrg":{"text":"This was refurbished and made larger in a beautiful renovation done in the last 2-3 years ","useful":1,"cool":0},"bl4SB2b05L7TSmG9H-ilQQ":{"text":"Took us 4 tries to finally get seats at the bar. Once seated it took 30 min to finally get","useful":0,"cool":0},"mIUA9V2Pyp9eRrpHjTOsBA":{"text":"I hope you don't get motion sickness!!! Just kidding - the bar rotates so slowly that you ","useful":0,"cool":0},"tqqBb0uAQQAZ16n-LnXhBw":{"text":"Granted, I was here a convention and graduation weekend, so the town was super busy, but I","useful":0,"cool":0},"sNdqUp-9VGBoyXub18sPKg":{"text":"Live piano music = good.\nLive piano music that's so loud you're in danger of puncturing an","useful":1,"cool":2},"8YsRuro4BMQATDVRHAvhLw":{"text":"It's a beautiful old historic bar in a old historic hotel (whose lobby is beautiful, at le","useful":1,"cool":1},"OwFSiea1AxAMT0dKLSc_5g":{"text":"Posted up at the bar for the early afternoon, great atmosphere and good vibe, watched the ","useful":0,"cool":0},"rsJBmmrWIVjIuCpNtG9dFQ":{"text":"This Old School hidden gem is hands down one of the best bar/lounges i have attended. Loca","useful":2,"cool":1},"Xrk-J61almWX4MBtqj__cA":{"text":"Really cool bar. The carousel actually moves... not fast enough to make you sick, but fast","useful":1,"cool":3},"aErIJlxb4fpSEj38MQYOEw":{"text":"Everyone needs to spend an hour enjoying this New Orleans tradition. It's on our list for ","useful":0,"cool":0},"1GjbZkcCUEqX50Q1GDjquQ":{"text":"Very fun and unique place to finish off the night.","useful":0,"cool":0},"iIfC4osoa583wmxHEQPCyA":{"text":"This is a great place to go to get out of the hustle of bourbon. We had a lonnnng night th","useful":0,"cool":0},"MF9RhKZVg6F4NZF5I8BXDA":{"text":"My second time in New Orleans, and my second time passing by. My favorite... as normal as ","useful":1,"cool":0},"OCryAwuh-hWT3fKQ2ESfQw":{"text":"5 stars just for the unique experience provided by a spinning bar. The drinks are expertly","useful":0,"cool":0},"q0J3xuAkTmb5AACxxfVh8Q":{"text":"I have fallen in love with this bar. I think it is so fun that it rotates like a amusement","useful":1,"cool":2},"U3TsxmoK7UiO89cTgLqE6w":{"text":"Where un-classy people come for the gimmick and attempt to be classy.  Sorry I ever wander","useful":0,"cool":0},"ZMUrQIU4it7LSrd-Q6Wa3A":{"text":"Always crowded....but worth it! Usually the crowd is a bit tipsy and super friendly.  And ","useful":1,"cool":0},"7UI8Ko8KWCjQl2qAnbtGHA":{"text":"Sitting at the Bar was GREAT!  Service was good when you are able to get the bartender's a","useful":0,"cool":0},"8KWcYADiIoduVrUVq57rqQ":{"text":"Cool place to visit but service was extremely lacking. Barely acknowledged by cocktail and","useful":0,"cool":0},"PDqv5LbxLriIWWlvhHhlBw":{"text":"Stopped into the Carousel bar but did not go around in a circle.  We actually visited twic","useful":0,"cool":0},"CTpc0rExiQlaZ8RI2dszvg":{"text":"Good bar at the recently remodeled Monteleone Hotel in the French Quarter. Staff is OK not","useful":0,"cool":0},"DvfIZ7Yj5K0OiWT8_gC3iA":{"text":"A coworker of mine had recommended checking out this bar while in NOLA. It wasn't your \"Bo","useful":0,"cool":0},"Yb7KaU-Bb2qAnurk9zqyxw":{"text":"This was my home base when I volunteered for Tales of the Cocktail. The bar is beautiful, ","useful":0,"cool":0},"H0FaVZDiWa9V4yr5B4Naqg":{"text":"I give the carousel bar three stars. Mostly for these reasons. yes I understand that the b","useful":0,"cool":0},"yZ6pWytqC4sOrSJ6mW3B9g":{"text":"Everytime we've come here it's been packed. Consider yourself lucky if you get the chance ","useful":0,"cool":0},"mVkOodHxxlN8S4TME9d03A":{"text":"I used to hit up this place whenever I was feeling a little bit classier/needing a change ","useful":0,"cool":0},"ErtYbWnfgm6rT326siSMgA":{"text":"Touristy bar built On a carousel in an old hotel ( The Monticello?) drinks are expensive a","useful":0,"cool":0},"xzUZFpb18XK0pCykvxL3Xw":{"text":"Overall impression:\nIt's fun. Should try it at least once. Pricey but you pay for the expe","useful":2,"cool":0},"gqPCIqv5bx1KwqMQcfPXWw":{"text":"I can't really remember how I ended up at Carousel Bar. I was pretty drunk, walking down R","useful":4,"cool":4},"PHXYsgu9-TXAhN0nlOsd7A":{"text":"Wow Marvin is the best bartender I've ever had. He was even so kind to share his delicious","useful":0,"cool":0},"SyMXZ-z1bBTApj6NX9_lOg":{"text":"My husband and I had a great time here on New Year's Eve! The renovated lounge is classy a","useful":1,"cool":0},"P6CQ19akCxIBaE03TJW5ug":{"text":"The Carousel Bar is a good place to grab a drink before you go somewhere else. There is no","useful":0,"cool":0},"1_mFrPbymKM6D0AW8qUiTA":{"text":"I have previously stayed at the lovely Hotel Monteleone. This time my conference is at ano","useful":0,"cool":0},"K0gaLfRikTKVQLwm4ZoXow":{"text":"Interesting bar but not one I would likely visit again. It's in a hotel lobby which was un","useful":0,"cool":0},"nej6tx18ZKzuQJgln_0_6A":{"text":"My girlfriends and I stopped by here to check out the carousel. It was pretty crowded on a","useful":0,"cool":0},"nkerryn33GgnR0c5uHmW3A":{"text":"I had been to New Orleans a hundred times and found the Carousel Bar on Yelp while looking","useful":2,"cool":0},"jVGpFc3MtKeRa3ZQFIiQnQ":{"text":"This place has a really nice vibe. I really enjoyed the live jazz music. They were playing","useful":1,"cool":1},"_bfdCXsdqryoKDNWyCwaJQ":{"text":"Very underwhelming. Described as a revolving bar on the website, I thought the whole bar w","useful":2,"cool":0},"7i01GcEi0zFiKWaw2Clmxg":{"text":"Inviting atmosphere, good people-watching and excellent sazeracs.   The main bar rotates (","useful":0,"cool":0},"4_fLAGxKyX_ZWcM2z2lU2w":{"text":"The bar spins... ah might not be a good idea... just saying. blaaaaah \nOf course when told","useful":5,"cool":5},"4hrW15GCg85EH7job8HFJw":{"text":"When doing New Orleans, this is a must stop, so you can go home and say \"I went to the car","useful":0,"cool":0},"8ttAwcXuU2e_0PxhpVwmLQ":{"text":"We went over to the Monteleone on Wednesday 1/25 to see the renovations to the bar. Thankf","useful":0,"cool":0},"Ith-2JprsPDYAXwSAp9Eaw":{"text":"The drinks were delicious, the jazz (Thursday night) was awesome, and it was a comfortable","useful":0,"cool":0},"ZJ15C8duZ3lR7S4TMvne-w":{"text":"Fun place to have a drink and people watched. We were able to get seats on the carousel an","useful":0,"cool":0},"lcKYQvg_WQiNN3H5S4OOmg":{"text":"Tourists - walk in and see the bar and leave; if there's a seat available and you reeaalll","useful":2,"cool":0},"E49ZoBtY9N1J9ytepWxq-w":{"text":"Cool bar, nice bartenders, slow service. Sit in the lounge near the stage and watch the ba","useful":0,"cool":0},"sZ-CbErGUuC2UvqwSkhIXQ":{"text":"I'm not sure what the hype over this place is. Pretty underwhelming. It has a fairly stiff","useful":0,"cool":0},"k_yJgi6Y_cHjLM5nAIQEHw":{"text":"I finally made it to carousel bar a few weeks ago and have been returning since.  Their Ra","useful":0,"cool":0},"wooZl5HheijWkbo3KnzERg":{"text":"Pretty fun bar.  It spins.  I had a bourbon milk punch and my friend had a Vieux Carre. Th","useful":0,"cool":0},"FH0bxxUDQLjMEgXVDF3XYA":{"text":"The surroundings are lovely, the service is worthy, cocktails EXCEPTIONAL!, and the freaki","useful":0,"cool":0},"k9nsmppEsPKHNQOD1aglCA":{"text":"The Carousel Bar has forever and will always be lovely. The recent renovation of the space","useful":1,"cool":0},"bhqdRNP6-g3ZJ0DB7jJgRQ":{"text":"We arrived at 10:50 am...and were able to grab two seats when the doors opened at 11:00 am","useful":1,"cool":1},"X6APf95EknJAf5ZgEqwEVQ":{"text":"Stopped in to check it out. Super busy and people didn't seem to be leaving the bar to rot","useful":0,"cool":0},"Cek7YYIzMUwHWa2q7MI33g":{"text":"Such fun! A real carousel where the bar turns around.... bartenders have to climb over the","useful":0,"cool":0},"jjoL1Jr7x61CcKK6G4L8LQ":{"text":"What a unique bar. Get there early to get a seat on the carousel so you can enjoy your han","useful":1,"cool":0},"SoEVC0QTBjTtD7v6PlBiUQ":{"text":"So, this was probably my most expensive drinking night in New Orleans. The bar is located ","useful":2,"cool":2},"R-qevCrU1PTPMMCbCbfAWA":{"text":"This was the perfect spot for after dinner cocktails. We intended to get one drink and mov","useful":7,"cool":3},"Wzd-kmexskuxE2HnnZTLRQ":{"text":"Located inside the Hotel Monteleone The Carousel provides a nice escape from the \"uniquene","useful":1,"cool":0},"kqfvjzq8E-k2TtPOf_r5KA":{"text":"Fast service, even when they're extremely crowded.  \nOutstanding live music.  Beautiful bu","useful":0,"cool":0},"gxzzkvALzbJFpQghCJRGoQ":{"text":"Just dropped in for an afternoon break and drink. Fabulous drinks!! No skimping on the liq","useful":0,"cool":0},"cHFEq2v1Cp9nGxmOWoVXtA":{"text":"I had high hopes for Carousel Bar based on locals recommendations.  My friends and I walke","useful":2,"cool":0},"syWaBfGzAbp7pPA0Fp1gsw":{"text":"First of all, the bar rotates! By the end of one rotation I'd met and conversed with a cou","useful":0,"cool":0},"LR2cRAQhn2_oUM_qAVdXHQ":{"text":"My husband and I stayed at the Hotel Monteleone for a few days over Christmas. The only ti","useful":0,"cool":0},"01XjGjAKG10Pb1msDvyHKQ":{"text":"Well. This is a \"I've been in Nawleans\" destination but the service is lousy, the drinks a","useful":0,"cool":0},"agRCS5sqy-aejHZSOvDpow":{"text":"This little bar is really cool.  It is like stepping back to the 50's.  If you sit at the ","useful":0,"cool":0},"QAlUxlqznmZtIJ81b3bxcg":{"text":"Very unique bar.  The bar seating section moves around the service well.  This can actuall","useful":1,"cool":1},"gcYAQL6NOUDTmnOLPt2XrA":{"text":"Carousel Bar is worth one visit or two if you're a tourist or business traveler. Try and g","useful":5,"cool":5},"83jmgmxaafueBQIpUBTfIQ":{"text":"Play my favorite drinking game:\n\nSee how many martinis you can drink in one revolution aro","useful":0,"cool":0},"E2v4ZCQPBa0TQ9FaZvcA7g":{"text":"Try to find off hours when you have a chance at getting a seat inside or even better at th","useful":2,"cool":1},"2ljGG0dNnHRq_V3IP3zOqQ":{"text":"The Carousel Bar itself is always crowded and guests get a little protective of their real","useful":0,"cool":0},"DGtE3HNqErLFUpB2EsaahA":{"text":"Located in the Hotel Monteleone, this bar is worth it just for the architecture, decor, an","useful":0,"cool":0},"naf5Fy80ZcGnqt7Mrfgqng":{"text":"Only in New Orleans will you find such a wonderful, unique thing!   This is a classy bar t","useful":2,"cool":0},"pNAHgcVVGGA5KGCysCGyXA":{"text":"This bar is so much fun! \n\nWe stayed at the Hotel Monteleone for a fun trip and were offer","useful":3,"cool":1},"i3h24IJmN0fDTx49zPQv2w":{"text":"Believe the hype. We got a Pimm's Cup and Fleur de Lis. Pricey at $12 a pop but it was the","useful":1,"cool":0},"NVhwWdKPmSGRV7VsrJXKhw":{"text":"As one who loves all things carnival, a visit to Carousel Bar was a must during my trip to","useful":1,"cool":0},"d1AKDO5WCjhoMKn1iTqlGw":{"text":"Are you tired of Bourbon street craziness? Did you have enough Hurricane drinks? \n\nOne str","useful":0,"cool":0},"1AoxWL8mBxX-rgxrLdF_Lg":{"text":"I stayed at the hotel a few years ago but was with a nondrinker so I did not go to the bar","useful":0,"cool":0},"f09Ysi7KXoRfj30MsUhgig":{"text":"Nice atmosphere but drinks are pricey. We  enjoyed the band, the female lead singer had a ","useful":0,"cool":0},"Cx2-3cMmjsTMn7hoAxleYQ":{"text":"Awesome happy hour, great service, fun atmosphere\nYou can't lose!  The bar revolves at 14 ","useful":0,"cool":1},"QdxuBxil4TGahaTju4MnDA":{"text":"A classy lounge in the boutique Hotel Monteleone in the French Quarter, with an actual car","useful":0,"cool":0},"qovkKp66Tq7Mcxqd4KaGrw":{"text":"We stayed at the hotel and really wanted to spend time at the Carousel Bar. It was packed,","useful":0,"cool":0},"wM0fVfO_5cdg0n938W20Hg":{"text":"The stars aligned when I walked in here with a business partner and two seats at this bar ","useful":0,"cool":0},"8wW0CaOb-TVCb2ZrL1dZRA":{"text":"It's a great environment and really cool to sit at the rotating bar. The fm drinks are wel","useful":0,"cool":0},"0lbLTini2bP8bfEbRbsDIA":{"text":"Yes it's a tourist spot, yes it closes early by NOLA standards, and yes you absolutely sho","useful":2,"cool":0},"VaJhJVlBaG6lRen73KhR9w":{"text":"Used to love going to the carousel bar. Still an interesting place but will not go back fo","useful":0,"cool":0},"DT2C7os-uKGu9k-IiRaJhA":{"text":"Nice cocktail lounge. The bar turns slowly as you sit back and enjoy the vibe. Drinks were","useful":0,"cool":0},"rrDZgYPdJg9zYpjxP_fn2A":{"text":"We stopped here for an after dinner cocktail. It is a cool bar. There is a carousel right ","useful":1,"cool":0},"DNXwPLHa1QGLrTc288g4cw":{"text":"A great alternative for anyone who wants something more sophisticated than the Bourbon Str","useful":0,"cool":0},"6F5e7d0Qk9oLhsfN4t1nrg":{"text":"Love going here for cocktails! It's a great place to go with a group if you're having a fa","useful":0,"cool":0},"5Wx2M6VtyXkhKPZ0ApK9yw":{"text":"New Orleans Birthday Trip = Drinking in the French Quarter\n\nWe got in so early that even a","useful":4,"cool":3},"dfia-ToiziTogKyDjnyJyg":{"text":"Drinks were unique and the little tail mix they give you is tasty. It's hard to grab seats","useful":0,"cool":0},"2LPrJ0rr4q2LDc3EzZTqPA":{"text":"Finally made it to Carousel on a fancy lady-date with a friend from out of town, and I mus","useful":4,"cool":2},"C8qgV7yzIqJYHjHMKBJxRA":{"text":"This place is awesome.  \n\nThe only downside is waiting to get seats.  But I mean, when you","useful":0,"cool":0},"5IBjoTqCsRNAYIsDJOc4xw":{"text":"I enjoyed the Hurricane drink and the spinning bar. However the bartender.. not so much. I","useful":0,"cool":0},"_hEHgpx-sX-FkQR6ImxHRw":{"text":"Food (drinks):  Didn't try the food.  Drinks were good though.\n\nAtmosphere:  very cool.  Y","useful":0,"cool":0},"HqkHzkigY3D04k9BONyOpQ":{"text":"If you can get a seat at the carousel it is so much fun!! The vieux carre cocktail which w","useful":0,"cool":0},"9OrfGobYNgRFumLxIjX_HA":{"text":"The bar spins around - what more do you need? Drinks were very good, although the service ","useful":0,"cool":0},"UPj4m0Yz4QKIXEvngcpsBg":{"text":"Like previous reviewers had said, this place is more of a novelty and worth checking out. ","useful":0,"cool":0},"wazyCgJMCUs4BeD94bEFkQ":{"text":"The drinks are impeccable. My favorite is the Aviation but you can't go wrong with a Ramos","useful":1,"cool":1},"h0tKiPeGjvJTnCclXYjP2Q":{"text":"So different! It took us 3 visits before we got to actually sit at the carousel bar. Drink","useful":1,"cool":0},"khCfuyMAQlTZTLQDxWjtxQ":{"text":"Fabulous place for a mid afternoon cocktail. Their signature cocktail list is studded with","useful":1,"cool":0},"9Yu6ojDovkbwX83vgAo2XA":{"text":"I really wish that we could have had a cocktail here when we stopped in however, there was","useful":4,"cool":4},"TTg0WDhB7GXdnx4jIkL8Ig":{"text":"Solid hotel bar.  High end service and atmosphere.  Just a short walk from bourbon street ","useful":1,"cool":0},"9HmEk6PxhzOijhWJGSQgqw":{"text":"very small and crowded, u will be lucky if you get a seat at the carousel bar. drinks aren","useful":3,"cool":1},"0tBKfuioM44b_u_ry0Wsng":{"text":"Fun place to grab a drink.  A gimmick but a cool one at a hotel with a ton of history!","useful":0,"cool":0},"-oYE2OWcbVbNxqMkoGS4FQ":{"text":"High end bar that rotates.  Really great.  Expensive and crowded.  Very popular touristy p","useful":0,"cool":0},"qc4mMvhgohd3rAZGkwa4aQ":{"text":"What a fun place! It's located in the Monteleone Hotel and there's a huge bar, but only a ","useful":1,"cool":2},"JvF-iJJRcvYJcIP75DUHVA":{"text":"We just ordered two drinks at the carousel bar and they are terrible. I mean, a free drink","useful":0,"cool":0},"aTOj_cnyPAoANVJ0bTlWVQ":{"text":"This was a really fun place. The bar is actually a carousel! How neat and unique is that. ","useful":0,"cool":0},"2i5bc2_HgbykZk9F4NLCtg":{"text":"This was an amazing find and by far the best sazerac in New Orleans! The bartenders were k","useful":0,"cool":0},"Bg2tfeyLvapt72jrCHRgvw":{"text":"This bar is very unique and very cool. It is worth checking out, however, I think it is a ","useful":0,"cool":0},"3dlIR7rtZMsH6qUbNL_How":{"text":"The Hotel Monteleone is high class, as well as the carousel bar. It's a unique experience ","useful":1,"cool":0},"VcdXB7BnjRh3POSN0tTwxw":{"text":"The carousel bar is located inside Hotel Monteleone, immediately to the right when you fir","useful":4,"cool":4},"BCVc2KBJjqlcT8blSsO_bA":{"text":"This is a must see! The seats around the bar actually moves in a circle around the bartend","useful":3,"cool":1},"HfxUtoXJJWgEdz8Jdt2HAw":{"text":"Amazing drinks and fun atmosphere!!! Getting a spot on the actual carousel can be tricky s","useful":1,"cool":1},"_2JDT2-n4M1ZQ-xHzed1DQ":{"text":"This place is really cool. I suggest going to check it out. Although the carousel itself w","useful":1,"cool":1},"C986S1v1_jUO3BjWYz_ABA":{"text":"Great drinks but really busy for a Tuesday so we didn't get to experience sitting at the c","useful":0,"cool":0},"7b1AGygOFhxURExdGXpvkw":{"text":"Packed on a Saturday night\n\nActually got a seat and the waitress was great. Her name was S","useful":0,"cool":0},"yghKUmpnUjVI6lqmAljtpg":{"text":"One of the best places in New Orleans to have a drink with the exclusive carousel bar . Ro","useful":3,"cool":0},"Cs6qEyplYxWjCdqXpW4eVA":{"text":"Everything about this place is FANTASTIC! We went here one afternoon during my Bachelorett","useful":1,"cool":0},"qNTdi0jVmq2XzPFF9Mc7NQ":{"text":"I just love this bar  \nEvery trip we go and the drinks are consistently delicious. Clean b","useful":0,"cool":0},"teJBMdIio27C_9ZkEScShQ":{"text":"My group of 6 visited the Carousel Bar at 11:30PM on a sunday night. We were disappointed ","useful":0,"cool":0},"z9iCkgf2zurKXWYLWTVvgQ":{"text":"Very nice bar...it is actually a carousel and it moves. Moves round and round, whoopee whe","useful":0,"cool":0},"ffbSSJ9rTzkT_N36NzFeAw":{"text":"Stopped in for a drink. Fun tourist spot. Good service. Atmosphere is nice. Definitely coo","useful":0,"cool":0},"TkGRU_kJp-HqHBQLlOPXfA":{"text":"A favorite. I didnt get to sit at the carousel bar but I had great service at the other ba","useful":1,"cool":1},"kAPfX7744nGmyOVE2-g1wQ":{"text":"This was by far my favorite bar/ lounge in all of NOLA. Hubby and I really just enjoy the ","useful":3,"cool":1},"SkT2KqrzXEoX_-T6rSBQtA":{"text":"We loved this spot so much we came back the next day after our initial visit. Such a cool ","useful":0,"cool":0},"IF_kLCj16KlFPKw7zlsLew":{"text":"Great music. Good drinks and ambiance. Lovely Staff. If nearby, stop by for a drink.\n\nWhen","useful":0,"cool":0},"fOn1U93LkRN5SN_yiTTZow":{"text":"The Carousel Bar is a very cool experience. It opens at 11am and I would suggest getting t","useful":0,"cool":0},"PNji8b3o45Z5fLvalWEAKQ":{"text":"Despite stopping by the Carousel Bar 3 separate times during my weekend trip to NOLA, I di","useful":0,"cool":0},"nP2cvEvlQkic9vPxpfcbnw":{"text":"Dark atmosphere with great setting. I'd come here again. And I'm here again. Telling you t","useful":1,"cool":0},"xqlzt7JaR6Jm4mujPKozSg":{"text":"This is a formal, classy hotel bar that has live jazz and a great atmosphere. It's elegant","useful":0,"cool":0},"ayl16dAn0bqCYHspmZ3_qA":{"text":"Located inside the Hotel Monteleone, this bar features a fully functional carousel that ro","useful":2,"cool":1},"u0EC8hUvDhir_3V8vlL1mQ":{"text":"Super cool, classy bar. We went on a random Thursday afternoon, it was PACKED! Our group o","useful":0,"cool":0},"I6s868s2eTtSZEaCTFt83A":{"text":"Cocktails were amazing, ambiance is great when you are there outside of peak hours. Place ","useful":0,"cool":0},"Txdy9J78vyVe7n6oSci4aQ":{"text":"A friend recommended I checkout the Carousel Bar and I am glad I did.  It was a Saturday a","useful":0,"cool":0},"2Kl1Gq0wPHG8a9C5UFRm_Q":{"text":"Pretty pricey but luckily we had the 2 free drink tickets for our honeymoon. It really spi","useful":0,"cool":0},"-aHQODycyippyI-lQQuTDw":{"text":"This place is such a cool concept! It is literally a carousel and the bar is circular and ","useful":0,"cool":0},"2lRz_oy4d4k4W9xkllkAmA":{"text":"What can I say about Carousel? I wanted to drink a Vieux Carre at the place of it's origin","useful":1,"cool":1},"dFy6HzMsw5lxZC9Vpqgn8g":{"text":"Such a beautiful place with amazing waitresses + bartenders!!\n\nSeating is first come first","useful":0,"cool":0},"yJ0eDE2Ofv-KWTxYyM1IHQ":{"text":"Very interesting spot sitting on a moving bar lol and drinking ,great drinks good service ","useful":2,"cool":1},"warCdjYAWSTDLtLdNrfopQ":{"text":"One of my favorite bars in NOLA when looking for a slightly more refined sip than the usua","useful":1,"cool":1},"x2Mnp0_A4lA8vTn3uBGUVw":{"text":"I come here every trip, great Vieux Carre.  Friendly staff and patrons.","useful":0,"cool":0},"T960n2TycwGePsDJ9Gy8ng":{"text":"Good but not amazing. Gambit indicated you had to try the crawfish and blue crab beignets.","useful":0,"cool":0},"l4hQGSfiNtGWhGPUCyUz0Q":{"text":"I heard so much about Carousel, that I just had to check it out.\nEveryone and their dog re","useful":5,"cool":1},"urYjWJmYM4VVMYfLGhpr_w":{"text":"We had to stop by and have a drink at The Carousel Bar & Lounge since that was one of the ","useful":1,"cool":0},"Qh9vO1Ob2EOPHzbX_1M_UA":{"text":"Yes they have a carousel in the bar... but yes it comes with a bunch of snooty patrons... ","useful":1,"cool":0},"FJ50j7WYWmQ6i3uPvNK_tg":{"text":"The draw to this bar is ostensibly the carousel, but the drinks aren't bad here and the ho","useful":2,"cool":1},"Evsq0a-hgXjP_uPDuBN4hg":{"text":"Nothing like drinking a beer on a slow moving carousel in New Orleans.  Beer was ice cold ","useful":1,"cool":0},"WS2DGJeZ5xTyMvLHaalQ2w":{"text":"Old school legit baller bartenders.  Pros.  Sat on the spinny bar and had bourbon and rye ","useful":0,"cool":0},"NWP3r6MQy6V8uRcbu2Gu5g":{"text":"A great place to go if you want to sit or stand, drink and listen to some jazz tunes. I lo","useful":0,"cool":1},"denumQDX27sMU-biS3TMpQ":{"text":"My birthday girl friend loves Carousels so this was on her list of things to explore. We c","useful":0,"cool":0},"sQKeSOZXq6KrRcDma8k5zQ":{"text":"I visited the bar yesterday and ordered whiskey sour with Johnny Walker Black Label... all","useful":0,"cool":0},"BJ3UbiSEFAECAMi9TygkKA":{"text":"Had the best pina colada ever! Not the frozen kind...it was over ice and it tasted like pi","useful":1,"cool":0},"Zgn_mHFIdEz-0DwrLPe4lQ":{"text":"The Carousel is a landmark in NOLA, but that doesn't mean that it's truly fantastic. If yo","useful":0,"cool":0},"2R6o2QfEozE20V0I0AXRlA":{"text":"I learned about this popular bar and had to give it a spin. \nEvery time I attempted to go ","useful":1,"cool":0},"waMvxr95gtd1wMloz3aHYg":{"text":"Can I put a carousel bar in my living room please?  Although this bar was on my list of pl","useful":0,"cool":0},"DTJzrvCKy4LQsZGzrkZyyw":{"text":"This is a bit of a tourist trap. The carousel does not rotate at a noticeable pace unless ","useful":0,"cool":0},"lvqHeKnfJw07tzXi4gb4aQ":{"text":"Of course we ended up here the morning after we watched Girls Trip in our hotel room.  It ","useful":0,"cool":0},"aTHzMOWadVLQyG07Zip3Hg":{"text":"You spin me right round, baby \nRight round like a record, baby\nRight round round round\n\nI ","useful":2,"cool":1},"wMnKFJDO0ko0LZaPjdis0Q":{"text":"Excellent place to visit - highly recommend. We were surprising our son in NO and picked t","useful":0,"cool":0},"R-rAQ8Wdg5jTT-FGUh-RKw":{"text":"A very cool place in New Orleans, with very old school and heavy duty cocktails. a lot of ","useful":0,"cool":0},"ooJ0q8B33LfzM0F-a9r09w":{"text":"This bar is sweet. While you usually need to pound several drinks before the bar starts sp","useful":1,"cool":0},"uFSw07UGtZcuxH2iLhB1Gw":{"text":"Best drinks in the French Quarter.  Great bar tenders.  Excellent service.  We wish we had","useful":0,"cool":0},"skZGto3ISZ22aKRD1y-bCg":{"text":"Love this gem of NOLA!! This year my birthday fell on a Thursday and I got to see and hear","useful":0,"cool":0},"uYVJkAAEzLe2jTD-4hUDWg":{"text":"I just love this place for afternoon or early evening drinks. It is incredibly relaxed and","useful":0,"cool":0},"3_D85JPyNNi4W9yCsZCqTA":{"text":"This place was awesome. The bad playing was great. Our waitress April was super friendly a","useful":1,"cool":0},"X-QULp20DUtKWeZL90gr6A":{"text":"I know the bar is kinda touristy and its inside one of the most popular hotels but the Car","useful":2,"cool":2},"sDjwoNd2TOqlJbwYm0IRTA":{"text":"Food was OK, given it's bar food. I ordered a sazerac, it literally took 20 minutes to get","useful":0,"cool":0},"CZBq5f_tVGWhLQPkuJ5Qlw":{"text":"Really cool bar. An actual carousel with bar stools that moves around the bar......slowly.","useful":0,"cool":0},"ozXn-i2sQbyeXZ06P6U4pA":{"text":"I've heard a lot of mixed reviews about this bar and I'm not sure why.  Every time I've be","useful":6,"cool":3},"ezLd_43NIJCNx-K_Xo64XQ":{"text":"So the bar décor is that of a carousel. It's cool, something different, but so packed, and","useful":0,"cool":0},"8ZI4q5Qt6eFtFPlZMJlycQ":{"text":"My man Justin was on top of his game.  I have been here mny times before but not since the","useful":0,"cool":0},"pHVuN0F3QFSpzFin8AL2WQ":{"text":"We were disappointed, when making our trip this was one of the must go to spots so we put ","useful":0,"cool":0},"LRQtNinhGwigsAc8CqvN4A":{"text":"I have been dying to go to this place for forever and the interest of it definitely lives ","useful":1,"cool":1},"XikoopkoK_bl3DzWtrWhMg":{"text":"What took me so long to discover the revolving Carousel Bar?  No matter.  We found out abo","useful":0,"cool":0},"-uAuK07e_7rVk56R5VGrrg":{"text":"Such a cool bar! The hotel lobby was gorgeous! I couldn't quite tell if the bar was actual","useful":0,"cool":0},"N5ok9YPkwqvK0_jd1AlGFQ":{"text":"I tried coming here with friends three times during Thanksgiving holiday. It was extremely","useful":3,"cool":1},"whj9K_GQjO_6osgLdipJAw":{"text":"Take a ride on this spinning...yes spinning...bar! Don't worry! It's not like a roller coa","useful":0,"cool":2},"Nkht18TA9m5RHRbPlIG-CQ":{"text":"This is a super cool bar. The side car was tasty, not too sweet, perfect! I will definitel","useful":1,"cool":0},"YTff6gcrLAzLjyQz0F8Ilw":{"text":"Probably the single coolest bar you will ever sit at. Get there early and grab a seat at t","useful":1,"cool":0},"pZtBkMWfQVo2qqudHzDKhw":{"text":"I was the youngest person at the bar by ten years (time elapsed was either an hour and fif","useful":0,"cool":0},"33nyGqa0NJIPPju7Ay5T1w":{"text":"Pro tip: I went on a Tuesday in January, this place will ALWAYS be packed if you show up a","useful":0,"cool":0},"6ab4qUl_BOMTxZsGSaDRCA":{"text":"Bar is kitschy.   It was too crowded to actually get a seat on the \"carousel\" but we did l","useful":0,"cool":0},"oqMUeqHrF6ka8TXILKbhXg":{"text":"This bar is so unique and in my mind a must do while in new orleans. I saw this bar featur","useful":0,"cool":0},"2vQLaIsV00JEsiOqW0fryA":{"text":"My favorite place in New Orleans to catch an after dinner cocktail! Love love love ! Staff","useful":0,"cool":0},"8KtfBzo5w7SUaiyvDEb5rQ":{"text":"During my last two trips to New Orleans for Tales I've spent a bit of time in the Carousel","useful":0,"cool":0},"BXGrfK-THSHY-Aa3hyRg7Q":{"text":"This place is hopping and I can see why.  It's got an upscale feel being in the lobby of a","useful":0,"cool":1},"7xNuAoEnNpxdO_em6Zn33g":{"text":"Don't count on getting a seat at the carousel bar, but there is plenty of other seating. I","useful":0,"cool":0},"gICGH7Yhl5CBD2nDMtcAiA":{"text":"Beautiful cozy bar!  It's located in Hotel Monteleone so it's usually full of tourist and ","useful":1,"cool":0},"e0lAw1nz1wbDkXN5RJlORw":{"text":"This was a fun place to grab a drink before heading out to dinner. Cute ambience and fun t","useful":0,"cool":0},"A1LD_rc7xPSdTq9EzEir4Q":{"text":"My FAVORITE bar in New Orleans! Very spacious place with a beautiful carousel rotating bar","useful":0,"cool":0},"tsrKZ46Je8CCm9S4j_H2Ow":{"text":"I know it's probably a little cheesy, but I love sitting at the carousel for a couple of d","useful":13,"cool":10},"gCTqCUQ1lbj9F_Bhvaya0Q":{"text":"How can you not visit NOLA and experience the infamous carousel bar?! For my first ever NO","useful":0,"cool":1},"Ljl9XY4x3ch0cQCCZ7d4WA":{"text":"Classic New Orleans, you have to come here at least once. Very cool atmosphere and fantast","useful":2,"cool":1},"dI3vFyHymdCc6feaWFELAQ":{"text":"This bar is awesome. It makes me feel like I'm a kid  again on a carousel in city park, bu","useful":1,"cool":0},"GWn_qzwe753POUxra5sJTw":{"text":"A really unique experience that you absolutely must try if you're ever in New Orleans. I c","useful":0,"cool":1},"Cx0lTxq1SQ3TWg9lcsYs9Q":{"text":"I had a great time grabbing a drink at the carousel bar here where the Vieux Carré was cre","useful":2,"cool":1},"IX1eQJyBiwaghCyXg_4l5w":{"text":"Cool concept. Sit at a carousel bar and you slowly move around the bar. It's old fashiony.","useful":0,"cool":0},"-ERiDgmmDFE6ix9GX7ZFWw":{"text":"Best sports bar in town!!!! \nTigers ... Saints... whatever team... great times!!!\nSports s","useful":0,"cool":0},"jTeZUOvU2xxnweLiADky1w":{"text":"If Travis is working at the back bar, get a Sazerac from him. That man knows how to mix a ","useful":4,"cool":2},"MYDHY_Y__JmDYydEAHnz0Q":{"text":"I consider this my French Quarter Living Room--and this from someone who actually has a pl","useful":0,"cool":0},"YorFTM6bfOk5V5hxx827XA":{"text":"Thank you Lena Prima for a memorable show at this great venue. Can't wait to go back!","useful":0,"cool":0},"wQ05arM0DND1FlnbU7_6Zw":{"text":"After a few nights in New Orleans, I walked into this place looking like I had been carrie","useful":16,"cool":23},"WzM7LqA0mRsHxdGz_a2aAg":{"text":"I remember seeing this bar listed on some Travel Channel bucket list for best bars in Amer","useful":3,"cool":2},"2883wGwqrpZKbSy6B2_uBw":{"text":"Round and round and round and round...\n\nThe Carousel Bar is great. I must admit, we came b","useful":1,"cool":0},"AdsYcgwv-oJR1kCZPavyHw":{"text":"A def must do when in NoLA. Where else can you sit on a rotating carousel while you drink!","useful":0,"cool":1},"l7gaItRdho13mfuDme5DYQ":{"text":"Thought it at first as a bit snobbish. Ambiance was a bit off putting.  I was wrong. \n\nDid","useful":2,"cool":1},"DapTbnDjgcIULLIu8izZvw":{"text":"A must see and ride. \n\nThe Hotel Monteleone is beautiful unto itself, the bar just adds to","useful":0,"cool":1},"Q6oO8tWcTbQaY8oMIoBFUQ":{"text":"It's a fun place. The carousel details doesn't stand out as much as during the day. The ba","useful":1,"cool":0},"nCeg-yD5OhGDEQxgam1hHQ":{"text":"Carousel bar actually turns slowly, revolving around the bartenders and the stationary cen","useful":0,"cool":0},"UaIRDwbt19NVhbBKNH9xnQ":{"text":"This is probably the most unique bar I've ever been to in my life. Not only does it look l","useful":2,"cool":1},"Fv1y6b3OzJ70mS_EFtRiQg":{"text":"I love the carousel bar.  When you're sober it's fun to watch the drunks be confused by th","useful":0,"cool":1},"19TGdXiN94Sgvqv-adlxyg":{"text":"I was really excited to finally get to go to a real carousel bar but the end result was di","useful":1,"cool":1},"RFYcZFKkTXZiiY9mxWFveA":{"text":"The idea of a bar made out of a carousel is great but how it actually plays out leaves a l","useful":5,"cool":4},"PUsZ9tmh_PTQoMbcRa54sA":{"text":"Great place to stop and rest your feet after walking the French Quarter all afternoon. I c","useful":2,"cool":2},"2kmdJljdwrnOq84b3YgKgw":{"text":"Good drinks. Slow service, and they don't sanitize their glasses. The sanitizer sink has j","useful":1,"cool":0},"BmgT3_42TW43HmYWY62lZg":{"text":"Went here to have a few drinks and watch the soccer game! Drinks are kinda pricey but good","useful":0,"cool":0},"PDRVVJMVwZ4YbzesRwDk8g":{"text":"Not as great as we had hoped. \n  The whole bar and lounge area was packed. We stood around","useful":0,"cool":0},"Dv247P95KUA76dLno_vxfw":{"text":"Me:  \"I'm already drunk.\"\n\nHim:  \"We haven't ordered yet.\"\n\nMe:  \"I know...this rotating b","useful":7,"cool":6},"IfhGB-SBj04NcNvOYUFtBQ":{"text":"So worth a visit.  The chance of getting a seat on the revolving bar is luck of the draw. ","useful":0,"cool":0},"3opo4N3NLanZ5_yfydwuOw":{"text":"Tourist trap nice to sit at a rotating bar, however the people hound you so they can sit d","useful":0,"cool":0},"5F9ITfliHBJGRaHrauAKLQ":{"text":"The bar rotates, so you know you can't get much better than that. This is a nice haven in ","useful":0,"cool":0},"DtyraMfh5rKh4Xubiosmwg":{"text":"This is a must do when visiting New Orleans. I do not know how I visited so many times and","useful":0,"cool":0},"tOHNGtd960iLXbyzoFUhEg":{"text":"Absolutely love The Carousel Bar! \n\nDon't let the fact that the bar is full scare you away","useful":0,"cool":0},"8VcuF3dZLqqO15V8KCHgRg":{"text":"Great atmosphere! Service was nice! I went Bc I seen it on the movie girls trip. It was a ","useful":0,"cool":0},"-Vp4eAAFogrZvlxLm2ijzw":{"text":"Very cute! The bar slowly revolves around under the carrousel.  We had a piña colada which","useful":1,"cool":0},"aZyK-xTGq5mREijGQ54xBA":{"text":"We go during the early afternoon to avoid the crowds and always get a seat at the bar. So ","useful":0,"cool":0},"spZu2_E75QjT5ttB-i4KtA":{"text":"kind of too touristy but still worth the trip\n\nlike most places in the area they make good","useful":1,"cool":0},"iiyE-ISxSqDRgxVLVei7Sg":{"text":"If you're sick of the craziness on Bourbon street, come here.\nClassy lounge with older, mo","useful":1,"cool":0},"_gVprx_sDBvkePLiQKS0Fg":{"text":"Always a stop in Nola. Best Damn sidecar made in Nola.  Amazing atmosphere as you spin slo","useful":0,"cool":0},"MSz32e0sOLXImBUTlkzW9Q":{"text":"Very cool bar and vibes in here at all times. It gets really busy but when you have a bart","useful":1,"cool":1},"W74bm6S9fwzP2XFnd8nr1Q":{"text":"This bar was so much fun and a cute concept. There is limited seating at the carousel but ","useful":5,"cool":2},"hDHv0sGtGilnrYcHuSXgcw":{"text":"Stopped in here for a drink on a well deserved Friday night (that's my story and I'm stick","useful":1,"cool":0},"3LOS02z7bvU2rFyZtPX8xA":{"text":"I've experienced the Carousel Bar both as a guest at the Monteleone, and finishing off a n","useful":1,"cool":2},"7GsjBbihX-3jDT3CfcQe2Q":{"text":"Huge crowds at the Carousel Bar is no exception, but NYE is tough. Standing room only in a","useful":1,"cool":2},"Gf_F9JrKEQEGyZGAsVaRxQ":{"text":"I came in for a cup of coffee after a fabulous dinner in the French Quarter. We didn't act","useful":7,"cool":6},"fRhfYfkhOIKNZIg4SWKQAA":{"text":"We were only able to sneak into here on Sunday morning as there was a craft cocktail conve","useful":0,"cool":0},"rT1WrbOZr4lkiXtgkhi9nQ":{"text":"This is a bar in a carousel. You have to come here to experience it. The seats actually mo","useful":0,"cool":0},"6bOkELTKTSwISyy8vFB4GQ":{"text":"This is another classic New Orleans bar nestled in the Monteleone Hotel.  Yes, it is a car","useful":0,"cool":0},"lj5iofxSBkW4JUpGThAjVQ":{"text":"This place is out of a fantasy, and I wish I could have lingered longer. It does close -wh","useful":1,"cool":2},"JL_xxMyztasU9zl6McBUQQ":{"text":"Met up with a lady friend at the bar as soon as I arrived in New Orleans.  She kept creepi","useful":2,"cool":1},"S_cK0aZpBHsl32UU3hY9Mg":{"text":"Fun really popular place to drink. Bar circulates around with a ring of guests around it. ","useful":0,"cool":0},"K9b8Vp6-4h-lde9peuicvg":{"text":"Wow.... great jazz music! Fun atmosphere and delicious cocktails. The hot spot for sure!","useful":0,"cool":0},"3hNgIVwcZ5ht9ZkHLyYqLg":{"text":"I was struggling.  The build up of nights left me with one just right night, followed by I","useful":1,"cool":1},"hZ2IymDl9QYZFt4trKmw5A":{"text":"Cool idea and the drinks are  good. I wouldn't recommend to anyone. I was expecting the ba","useful":0,"cool":0},"Ff-z12wZykj41OhTooDQAA":{"text":"Profoundly disappointing experience.  Given the history, beauty, and uniqueness of the pla","useful":2,"cool":0},"IPlOEiLsgkPq-5VhTSTgeQ":{"text":"This is a very picturesque and Instagramable location. We  were visiting New Orleans and w","useful":1,"cool":0},"GqHWGqiAaMlA26dv8n04vA":{"text":"How much you will enjoy this place is all about the timing.  We stopped in at 4:00 (don't ","useful":1,"cool":0},"dcvRXD5mK78bEALuDxcAKA":{"text":"One of my favorite bars in the French Quarter, I have been here a few different times and ","useful":1,"cool":1},"MLjfatP7On09Djlkw2cvdQ":{"text":"Very cool bar with some cool vibes. The moving carousel bar is a nice touch if you're able","useful":0,"cool":0},"zQf6iUI60QKOc9hZIaOOAg":{"text":"Such a beautiful place to stop in for a drink. After seeing it on TV a few times, we had t","useful":2,"cool":0},"GtLl4VF7aA9VHtIy1SgYxg":{"text":"This bar is absolutely gorgeous. As you've probably gathered from the name, the Carousel B","useful":1,"cool":0},"ubgtvHluhMVPT9KMvLW61A":{"text":"Great spot for a drink and relaxing. Came here with my brother and a few friends, very nic","useful":0,"cool":0},"kTFuPdBE4uLkML-S6-jjag":{"text":"This place was so fantastically entertaining.  I did not notice that the bar was slowly ro","useful":0,"cool":0},"rmDzJEkx8X4wQlKqNgkvyQ":{"text":"First time at this bar it is a must see in the French quarter the carousel works and the d","useful":0,"cool":0},"WAuDOQBDji7hXGk9SYcVIA":{"text":"I'm torn about this one. I actually hate the carousel part of the bar and really dislike t","useful":4,"cool":3},"gG54tF6R15jg1ooi2hpWeA":{"text":"The car was really cute and it turned slow enough where you didn't feel nauseous after dri","useful":1,"cool":0},"6F8W0nC8_ZVQYagUXiyd4Q":{"text":"I hate to keep making Disneyland comparisons while reviewing New Orleans, but it's impossi","useful":1,"cool":0},"vBd2tq7_C511kfTF7iUDaw":{"text":"James and I having a wonderful time at The Monteleone, and the Carousel Bar 2019 August! Y","useful":0,"cool":0},"uJWqjGL3euRphVXvs6woFA":{"text":"The famous carousel bar is located inside Hotel Monteleone in the French Quarter. \n\nThere ","useful":0,"cool":0},"YTKMHsg3AvLMJnULG0eDeQ":{"text":"Great drinks and even better experience! Loved getting to sit at the bar and people watch.","useful":1,"cool":1},"pshP2J3rGfFBjXH7L_4a6Q":{"text":"Loved loved loved this bar it really spins very diverse hotel bar with the BEST damn peanu","useful":0,"cool":1},"ydLT3wAkRAGSDwJrrUraRA":{"text":"Drink and Ride with no worries!  What a fun place to stop in and have a unique spin on the","useful":0,"cool":0},"nxouVI-sO4PTg7vc5yumjQ":{"text":"This was my last stop on my way out of town. I love carousels, so the idea of a carousel-t","useful":13,"cool":9},"ZcFFmPYVVAz7WZ7jnGiI2g":{"text":"The Carousel Bar's  colorful, hand-crafted combination of lights, mirrors, and intricately","useful":2,"cool":2},"i_agdYg3mdm4K30IOunrjQ":{"text":"Cute touristy carousel bar. If you're in town it's worth it to stop in and check out the r","useful":1,"cool":0},"KAZI_bTuv4TOairqO-O26A":{"text":"Great experience! Line up around 10:30 to get in at 11. The bartender Marvin is a goddamn ","useful":0,"cool":0},"r4lX62IvEF787zUwOJIH5Q":{"text":"This bar is a conundrum to me.  It is either such a great time chatting with friends or ot","useful":2,"cool":0},"cBc170YRfxysu6xrs4hZNw":{"text":"it's a great attraction to visit but nothing to rave about... pricey to compared to just g","useful":0,"cool":0},"cSv7qzIttFnlikfmXd2Jcw":{"text":"Stop in. Ride the carousel bar around. Have a Vieux Carre cocktail. It was invented here.","useful":0,"cool":0},"wqvIdkbhjE0URojMySCmMg":{"text":"Good cocktails in a whimsical atmosphere. Get a vieux carre and sit at the rotating bar.","useful":1,"cool":0},"wbTXRVlTvItssgAvLVHlJA":{"text":"The decor and seating were lovely.\nThe band was great.\nThe service was pretty good conside","useful":0,"cool":0},"G-uKUUSAswH2xHF9xemNLw":{"text":"If you're visiting New Orleans then the Carousel Bar at the Hotel Monteleone should be on ","useful":2,"cool":2},"Svk0oaRQ-BRVVf5tDLIglA":{"text":"This is a must when you are in New Orleans. The service was especially attentive consideri","useful":3,"cool":3},"lmG0_zFbQXlrfNSnH4UMlQ":{"text":"Cute bar located inside Hotel Monteleone. Our group wasn't able to grab seats at the movin","useful":3,"cool":2},"gCBEuAyBX8XyqTmNvFmr1Q":{"text":"Neat retro space.  Saz was mediocre.  Waiter tried to stiff us out of 20 bucks change.  If","useful":1,"cool":1},"RQIx6_TogLC6ZlR92IZYig":{"text":"It is all about the Carousel gimmick. Fair to poor drinks, overcrowded, not enough waitres","useful":0,"cool":0},"OGm8vlzH0jtlFhaBOcQK9g":{"text":"This place is a gem! If you are looking for a classy bar and lounge with beautiful and int","useful":1,"cool":1},"RbwcykUJMYaPNmaSMkAOzA":{"text":"This is the coolest bar I've ever been to! It is constantly moving so you get the chance t","useful":0,"cool":0},"EhQA7SNTjrrmAbkMZW5_Vw":{"text":"Yes, It is a gimmick, but its also fun. Plus they make the best damned Ramos Gin Fizz I've","useful":0,"cool":0},"4RuWqcjHe0WIZ7OGO5nlcw":{"text":"Must get the vive Le fleur cocktail! Carousel is really cool to see and sit at but can be ","useful":0,"cool":0},"CsqYt7XGjipSsqt_ETUJ1w":{"text":"Located inside of the Hotel Monteleone, the carousel bar looks really impressive, in addit","useful":0,"cool":0},"S_LWL8bWCSZPf9J-c0liXA":{"text":"This was the classiest joint we visited in New Orleans. Having been referred here by a cou","useful":4,"cool":6},"c2oXzNAC_wXWMKuIZv9BSA":{"text":"Live jazz, blues & mint juleps. And a bar that rotates so you can people watch without mov","useful":6,"cool":5},"5gMjDS4fMCc34W0SEUa5jQ":{"text":"Everyone who walked through the doorway into Carousel looked just a little awed. Senior ci","useful":3,"cool":2},"47X7IFlUPL0a392Yv3XMDw":{"text":"My husband and I loved this place! We sat at the bar and just went around and around talki","useful":0,"cool":0},"N-mWcfy2WM_95e58X-klNw":{"text":"We stayed in the Hotel Monteleone, so naturally, going to the Carousel Bar was a MUST. \n\nT","useful":3,"cool":1},"t8CRvkAVuv8OreaDIwvggA":{"text":"Friendly service and great drinks.  As the carousel spins around, bartenders are busy maki","useful":2,"cool":0},"8ORCIp14c-PKjH0lTvzIhg":{"text":"The Carousel Bar is one of those locations you must visit when you're in the city of New O","useful":2,"cool":1},"VH660ZeLBAGZ2BxduFVOSA":{"text":"This place is so unique & good! The pina colada was AMAZING! Corey our bartender was super","useful":1,"cool":0},"EZIKBG-5h07zXy0hAfR2_g":{"text":"I've come here several times and have yet to actually sit on the famous revolving bar lol ","useful":2,"cool":2},"dGOCstWb3BjSWI42nDCYxg":{"text":"So, when you hear that there is a bar that is also a carousel, you're thinking 'I have to ","useful":1,"cool":1},"DiIeUm98edr_qTG_GL-K7Q":{"text":"The Hotel Monteleone hosts a number of outstandingly gorgeous venues, and the Carousel Bar","useful":2,"cool":0},"HHQEFxpSc5Dn6NQzc4AHhg":{"text":"Great location! Nice looking bar with tables to sit and have a drink. Only downfall was it","useful":0,"cool":0},"15CdaloSyn_PQ_PuZPYeTw":{"text":"One word: overrated. Heard the hype to check this place out and picked a non busy time to ","useful":0,"cool":0},"eou_EX7pvQvDL8fu5Ggdcw":{"text":"I was in here a couple weeks ago this is a pretty awesome bar, it's so beautiful the carou","useful":0,"cool":0},"cB-fs96wVWzKDLATrEYzKQ":{"text":"This bar was recommended for a more mature crowd, nice music with a real spinning carousel","useful":0,"cool":0},"VtTNSmvsLC-R-19LKWdtoQ":{"text":"Classy, elegant, yet so fun! This is the best bar to go to in NOLA. The whole bar area is ","useful":1,"cool":1},"MpuFR_yEBsqIbAfpOHyLCA":{"text":"Carousel is a unique and novel bar in that it's main attraction, as its name suggests, is ","useful":0,"cool":0},"r6TzVT1M1FC-QUv3Xk3i9Q":{"text":"Good experience and unique atmosphere!\n\nVisiting New Orleans, we stumbled upon Carousel Ba","useful":0,"cool":0},"7z9R6jjOETn5IJ2y36SwYQ":{"text":"This is a great place to have drinks. The drinks are unique, the atmosphere is cool yet co","useful":0,"cool":0},"1zvwm4pgSJWsTntgj83ukA":{"text":"Nice place, interesting concept, but a little too pricey and prissy for my taste (in other","useful":1,"cool":1},"CkXIF8EuSFDiD661WYaODg":{"text":"This is a Great Bar, a Must go to if in New Orleans, Friendly Bartenders how know there Dr","useful":0,"cool":0},"WHWrnpAa6h4Q0UJ2UD8e4Q":{"text":"Travis may be one of the best bartenders I've ever seen. Packed bar on NYE and he makes su","useful":0,"cool":0},"0ybxFiSwCI-cE_O3jThgOw":{"text":"This is a must-do if you're going to NOLA for the first time. We got in line (AKA lingered","useful":1,"cool":0},"xJyyHg0g2pVa60cHAbJWFg":{"text":"We went in to sit at the bar, but decided to  grab a table instead. Nice location and a go","useful":0,"cool":0},"601TK5uCwfFVK1bX4KLh6w":{"text":"The best thing that I had in NOLA was at Carousel... and they are the blue crab and crawfi","useful":2,"cool":1},"axW6K6VqQlxCH757HX0uew":{"text":"This is a cool place. How often can you sit at a circular bar that is actually rotating?  ","useful":0,"cool":1},"NHcufPE1AGo7bOEZv6xzXw":{"text":"Carousel Bar is how to be classy in New Orleans.  I was enchanted by the idea, so we went ","useful":0,"cool":1},"_Nw9uCE5732JKwggPkD3TA":{"text":"YAY, indeed! I am so, so happy that I finally got to try out this establishment. My fiance","useful":2,"cool":1},"me26gjH2lloc9tyHFLpLpg":{"text":"Awesome place! Hard to find from the street, but once you do you may not want to leave. Sh","useful":1,"cool":0},"SN05NdTAQCJsPVB-ZznFKw":{"text":"Very cool place! So so crowded though. No place to sit at the rotating carousel. Also the ","useful":0,"cool":0},"VAOP6VqfsAG_JNvTga_SvA":{"text":"When you walk in you truly need to take a moment to appreciate the level of detail in the ","useful":1,"cool":0},"tc-z3DEYUjKQ2D2xbMlElQ":{"text":"Came to New Orleans with my daughter and this was on her list of things to do. I had been ","useful":0,"cool":0},"ZkT_bqCZi1vNxhrbyTwVrQ":{"text":"I love this bar. The main bar not only looks like a carousel, but also slowly rotates the ","useful":0,"cool":0},"nzKAKYOFbzCdHP_A8ddxww":{"text":"The place was very busy and service was a little slow. The one plus side is if you sit dow","useful":0,"cool":0},"0h86fGtMZlhU9b2ICiZULg":{"text":"Cool bar, nice bartenders, slow service. Sit in the lounge near the stage and watch the ba","useful":1,"cool":0},"noEEvIgs3u3qchyQIdL1bg":{"text":"Come for the ambiance of the spinning bar carousel, but don't stay too long-- tons of peop","useful":6,"cool":2},"j93XGGj35yh3qoCdCQoBfg":{"text":"18 dollars per cocktail to be served in the cheapest plastic cups along with all carpeted ","useful":0,"cool":0},"ug9TGmgbGNW_B4Pg_bMKkA":{"text":"What do you do when your having the worst summer of your life?? You go to your favorite ho","useful":15,"cool":11},"oaDy1h3hbst5hz8o_rW8Tg":{"text":"This is now one of my favorite bars in New Orleans.  It is located in the Monteleone Hotel","useful":0,"cool":0},"3ONPM1aMWNvfE364_jDmdA":{"text":"Great place to grab a drink! Ordered the French 007 which was nice and refreshing. The boy","useful":0,"cool":0},"ZHNwWFk6IVjsEE_7l4q2Ng":{"text":"Crowded? Yup! Overpriced? You bet! Tourist trap? Absolutely! GO ANYWAY!\n\nI'm an overgrown ","useful":4,"cool":2},"4LAHry9FxIEd7OOsD_9Ppw":{"text":"So. Fun. The bartender's were great! I had the handshakes Pina Colada - not too sweet. Ser","useful":1,"cool":0},"yrl4a4OpCD_6alKmnnPDjA":{"text":"The carousel bar has a very cool atmosphere and the bar spins! It's well located in the Fr","useful":0,"cool":0},"41PZEYt4DgQo-rwT2es-AQ":{"text":"Great ambience, we didn't try any food but drinks were great! The jazz band was amazing an","useful":0,"cool":0},"yE6wujDIM4DXmtNB1deq9Q":{"text":"Came into Carousel for a late afternoon drink with friends, post shipping, pre dinner.\n\nTh","useful":5,"cool":1},"j8GLdJgD125wxP1UPPW5gA":{"text":"Love the atmosphere, the drinks are delicious, great live music and the very best--the 9 y","useful":0,"cool":0},"ljmsYBioCqf_EhHZLYhARw":{"text":"This is my go to bar in the french quarter! I love the Carousel Bar! Fun atomostphere, gre","useful":2,"cool":3},"QXTlt0jatTJiSLgdPiXSWA":{"text":"Best drinks in NOLA. We've been to Brennan's, Commander's Palace, Restaurant August and ot","useful":1,"cool":0},"XTYCXEHkcEYB8xkG4OkSSw":{"text":"I've been in the hospitality industry for over 35 years.  Cory, the bartender at the Carou","useful":0,"cool":0},"2g8MHJrrq6rhVP6KEK8GdQ":{"text":"I love visiting this bar whenever I am in NOLA! It's beautiful and the drinks are amazing.","useful":1,"cool":2},"jr1u_kO1AiW7IcudF2fN6A":{"text":"New Orleans is one of my favorite city's in the US. Every time I am in town I make sure to","useful":0,"cool":0},"MACk2-apuQEApXo-vU4Cog":{"text":"Just checked out the bar area, Cuz it was on a visitors bucket list. \nHere's the attractio","useful":5,"cool":0},"wFEAhWrwCsxOKK7-daMw-g":{"text":"Gorgeous beautifully constructed bar! As soon as you step in, you see the carousel itself ","useful":2,"cool":0},"wk7ToVVCTwWQzD2zycyMJQ":{"text":"Kind of cheesy and not much to it. The seats rotate around the bar. I think it even made m","useful":0,"cool":0},"VmZSs6SQfOY60saXruFpyw":{"text":"Awesome gorgeous bar in a great hotel, while Bourbon Street is filled with frozen machine ","useful":5,"cool":4},"Ez6WI_CETfuV2T_p6jQAXA":{"text":"My friend told me to hit up this place and I was surprised to see it was located in a hote","useful":1,"cool":0},"22Rm0y7GvA0EhR8ErgwxMw":{"text":"We haven't been to the Carousel bar for some time but wanted to stop by for a drink. The b","useful":2,"cool":3},"uOar4YTm_BZfQtsxILrc1w":{"text":"Forget the dive bars and throw up on bourbon street and roll over to the Carousel Bar insi","useful":3,"cool":0},"qRDrI0crMNjl6xyY83sztg":{"text":"Very slow service. Drinks are good though!\n\nCarousel Bar is a must try, its inside Hotel M","useful":0,"cool":0},"_EN4GrAyPpFWkUTMhgXthQ":{"text":"I was told to go here from a colleague who I trust and she was right, this place was worth","useful":1,"cool":1},"XZiSK2bfuf_QdKFyoS_aTg":{"text":"Always a good time...  the vibe of the city...  the unique bar...  brings out the best in ","useful":1,"cool":1},"4JAvZWiR3-xoX4vRNpoRjQ":{"text":"Beautiful and reminiscent of Fear and Loathing (the carousel bar rotates!)! Large space wi","useful":0,"cool":0},"En_vEBNa_MhjIG-9nV4Gug":{"text":"THE BARDS AGREE\nThe Carousel is one of the best bars in the country. It's not pretentious,","useful":10,"cool":4},"mhQRiWoUzUGA6lwqiY2q0A":{"text":"Parker Davis, Eddie, and Eduardo are my favorite people at the Carousel Bar, that is curre","useful":3,"cool":2},"1x7-wVwLl1EqxczINTTxeg":{"text":"Located inside the monteleon hotel this cocktail bar was everything I have heard and more.","useful":2,"cool":2},"sydPktM1rrRQvQIeLU81Cg":{"text":"First time here. If you enjoy classic cocktails and an upscale ambiance, this place is gre","useful":1,"cool":0},"P_vaDu0DQc0eGi5ENLkvKA":{"text":"SOOOO disappointing!!! We decided to stay at the hotel for our 40th birthday celebration b","useful":5,"cool":1},"rkHAiDP3qj-HH9klTQQ2YA":{"text":"People come here because the bar rotates like a carousel. However, there are limited seats","useful":0,"cool":0},"-TFPPqgML2wD_suMbaRZJQ":{"text":"Very cool bar. The bar slowly moves like a carousel, the drinks are strong and delicious. ","useful":0,"cool":0},"MrZxJiHYMKrq1sHrkgU3tA":{"text":"This definitely was a nice place to escape from all the craziness on Bourbon Street. Place","useful":0,"cool":0},"vHbibuom6UejZKCCQXbHeA":{"text":"As fun as the whole carousel-aspect of the bar is, the gimmick doesn't go too far when 1) ","useful":1,"cool":1},"knbfifmEtTv1r61ppDFiyw":{"text":"Came here during the week and I was able to snag a seat at the rotating bar right away . T","useful":1,"cool":0},"1Ohz7sDe3lQfiv-EgEfbsQ":{"text":"My husband and I came here before dinner one evening to check out the carousel bar and lou","useful":2,"cool":1},"hqB4skpyDc_PsC8sCx8XGg":{"text":"Definitely a unique bar that I had to come and see once. It's beautiful set up and the car","useful":1,"cool":0},"IOvh6bzYiTtzQC5YLpmgYA":{"text":"I came to sit at this famous bar and have a cocktail, but there sadly was no room for my s","useful":0,"cool":0},"kfMPIDuUeShyB3h8swDT2w":{"text":"It was super cool!! A must do. It's fun to just stop for one drink. The seats fill in fast","useful":0,"cool":0},"duLWsS3EPCR9aKRZKtqOmg":{"text":"Bar has tons of great drinks and great staff. COREY was amazing and made our experience on","useful":1,"cool":1},"Vfx2Md8ha7_oCxqHT8nl9w":{"text":"This is a beautiful landmark - not to be missed.  Absolutely you MUST visit the hotel if o","useful":0,"cool":0},"_aZ-9adjZgetqZbv0VlhyA":{"text":"Alright this will be brief, even for an elite yelper. The drinks were good, prices were to","useful":1,"cool":0},"n22lSy1Oyug1KgL6oTUEpQ":{"text":"Excellent ambiance, classy, scenic, and a revolving bar.  It's a must visit after walking ","useful":1,"cool":0},"UTB3CpGOddJcKmb0WMNnQQ":{"text":"An absolute must when you visit the greatest city in the world. Experience the Carousel Ba","useful":0,"cool":0},"4YbsnPaHLdoWI_otGEe3Bw":{"text":"Great ambience, the carousel bar was a lot of fun. But the drinks were very disappointing.","useful":0,"cool":0},"R-x-D-nc2FvyN1lefhYgWg":{"text":"The ambiance is outstanding but we were there last Saturday & the bar was crowded & there ","useful":0,"cool":0},"NZKWKJP5yQEVeaQ8a4D-4Q":{"text":"I do love how big the space is, and that there's live music. However, the bar gets REALLY ","useful":1,"cool":1},"q4C0QHmL5kPuplCg4raSFw":{"text":"I thought this place was going to be mostly gimmicky, but it turned out to live up to its ","useful":2,"cool":0},"5ruv10tqRDZ7SHZBSrzzPw":{"text":"Got the French 007 and it was delicious!! A bit expensive ($12) but totally worth it becau","useful":2,"cool":2},"MwkdF5m4p_2RZn7hf1bI6w":{"text":"I can't believe I forgot to review this place!  It was my favorite cocktail and bar experi","useful":2,"cool":0},"3IoLKtPCvXS6JlgZbNFyCg":{"text":"Such a wonderful experience!  The staff was all superb and top notch. The host/Maître'D wa","useful":0,"cool":0},"A1IPzcbwD1PL3LA-2ffxjA":{"text":"Love this bar! Carousel is awesome! The art work is amazing and we have a great time. Park","useful":0,"cool":0},"-eQ0NtYS_FmiV2sn2z9sDg":{"text":"What a cool idea. If you can get a spot at the bar, it's fun. They have specialty drinks. ","useful":1,"cool":0},"9kytuAkuxryeYgLMRsq8jQ":{"text":"Very cool and shaggy bar that is a must to visit.  You actually spin around the room while","useful":0,"cool":0},"onN0ToHdvAEAS2ryvz9Y4Q":{"text":"Ok, the bar is gorgeous. How often do you encounter a story-book spinning carousel as a ba","useful":0,"cool":0},"GDTVtZwvfkE0XleZz_MsfQ":{"text":"It can get packed the moving bar is pretty cool. The drinks are hit and miss. I've had rou","useful":0,"cool":0},"bU6IvQR0ZZBRyQyMfeNtQQ":{"text":"First Impression - I loved the big rotating carousel bar.  Nice jazz music.  Older crowd. ","useful":3,"cool":1},"edwkHPW2BxXmVY90Q2hCdQ":{"text":"This place is great. Every drink I've had here has been wonderful (and strong). Even if yo","useful":0,"cool":0},"woUTa4TYWlZ_piYgcoozeg":{"text":"What is not to LOVE about this bar & lounge. We knew we had to visit while in town. The fi","useful":9,"cool":10},"xNgPnSoqG_r93iyStmV2nQ":{"text":"Amazing experience,  with the bar that slowly rotates. The cocktails are really good and t","useful":0,"cool":0},"rLtKeaFE-G7VV9rCbDS7gw":{"text":"I was here back in April and had a great time. If you decide to sit at the Carousel please","useful":1,"cool":0},"dCtNbaMrto183NA1eK0xLQ":{"text":"Love the atmosphere. Couldn't sit at bar but found a cozy corner instead. It's quiet enoug","useful":1,"cool":1},"iBLpzAHrWUa888M4IZrRfw":{"text":"A nice way to end my trip in NOLA. Fantastic bartenders, ALWAYS. Drinks are so well made, ","useful":0,"cool":0},"N1IjpoGXT594l3RVaPY4jA":{"text":"I wouldn't make this  part of a Friday/Saturday night  bar hop but for a chill cocktail ex","useful":0,"cool":0},"5tlD1ojO8kQb7iovOwm2mQ":{"text":"100% a novelty/bucket list item. \n\n-Long line up to get a chair at the bar and smelled a b","useful":2,"cool":1},"4LuW0Dt1-lgrLfGEB49LbQ":{"text":"The Carousel Bar in Hotel Monteleone is a pretty cool bar but it is also a pretty damn cro","useful":7,"cool":6},"36wVXriKckDzDZqPD6LRPA":{"text":"Get a spot at the bar unless you had a couple too many already. Could prove to be a little","useful":0,"cool":0},"SdLvFfjUZ-FxFH929fq2uA":{"text":"The atmosphere is great!  The fact the room is spinning doesn't matter because it's probab","useful":0,"cool":0},"1zPBvpUdhp8pPqib5ALrNg":{"text":"So fun and so memorable. Try to get there early so you can actually sit down. If you go on","useful":0,"cool":0},"kdDEGdVnpzB4dJfawdTJDg":{"text":"This is such a cute experience!! I love the atmosphere it feels very old world and classy\n","useful":0,"cool":0},"KT4awjJaPFonvdL2RUapgw":{"text":"Great spot to grab a drink before or after a nice dinner. That's what we did. :-)\n\nHighlig","useful":1,"cool":1},"3n8xHZrP0VhHuuTpodBufQ":{"text":"First of all Hotel Monteleone is swanky.  Second of all the Carousel Bar located inside th","useful":5,"cool":0},"afArotjE9s_XSK7dTlO43Q":{"text":"I kept hearing from everybody how I had to visit the carousel bar. There was a storm the d","useful":0,"cool":0},"bLAmuPDW2jhb_j2Et2mgQQ":{"text":"monte's spinning bar\nscenery changes for you\nthree spins and cocktails\n\nAbove average cock","useful":1,"cool":1},"FcHqD-n6QpPkZYsCZMJEhg":{"text":"Came here on a Saturday afternoon with two friends, we were hoping to get a seat at the ba","useful":0,"cool":0},"Upp4OBX7dVopGWyqjRe69Q":{"text":"It's definitely crazy if you go during the weekend! \n\nI tried the Milky alcohol drink and ","useful":2,"cool":1},"coS2I6tANb8V5k0JOk-CzQ":{"text":"5 stars everytime i come here...have to mention my favorite bartender in nola Mr Travis...","useful":0,"cool":0},"ZzeobBoJxlp3i1cN0Qaccw":{"text":"A bar that moves?! Sooooo cooool. Keep in mind it's not drastically spinning but the bar t","useful":4,"cool":1},"Sb0UUOOLScdNXwbAIFl2vQ":{"text":"meh... it was cool to see a carousel in a building and that the bar turns while you are on","useful":0,"cool":1},"v4nLJOE83DKp_6nlkmRR2A":{"text":"Pretty darn cool. We went on a Wednesday around 11 and there were only 3 seats left. Someo","useful":1,"cool":1},"UMRkstEqmRKt9z3GsAxS8w":{"text":"This place was really really cool!  Unfortunately we probably stopped by during prime time","useful":0,"cool":0},"d9WBEGxrVZhVJfQaDuXfNQ":{"text":"I was enthralled as soon as I came around the corner.  No one was going to take the next h","useful":5,"cool":6},"Zkyhgaf03yS-N6d44esfCQ":{"text":"We stayed at the Hotel Monteleone for New Year's. Thid was my Christmas present from my wo","useful":1,"cool":0},"s0xnBFr0FGqXq3LB0NP7Xw":{"text":"We came here to sit at the carousel bar but due to COVID the carousel is CLOSED. NO SITTIN","useful":1,"cool":0},"IGlysHsYgSefNnFcwcieaw":{"text":"No place like it in any hotel in the city. Custom drinks and intimate ambiance welcome gue","useful":0,"cool":0},"neQXhHCRrjHJ7cJK2cc0xA":{"text":"Get there as soon as the door opens at 11am and wait in the line. I'm serious that's the o","useful":0,"cool":0},"NmhfLLReOGr2vrSKBgZSvA":{"text":"Fun place! Great drinks! Go early to try and avoid the crowd if you want a seat on the car","useful":0,"cool":1},"yzI1RHMotFbJa6e07l4eZw":{"text":"This place is beautiful!! If you can get a seat at the main bar (carousel) it's really coo","useful":0,"cool":0},"GM0I4i7VVRUvXsBtl7p_pA":{"text":"After 4 frigid days without power or water, we were able to get out of Texas and take a ho","useful":0,"cool":0},"_d5WbGm-3iQj1Qm_uowHlg":{"text":"The iconic rotating carousel bar in New Orleans is a must see when you're visiting but it ","useful":4,"cool":4},"GshOchEuWQ8tD5dsbbF0MA":{"text":"It's a lovely bar with a carousel that slowly spins. you can't even notice when you walk i","useful":0,"cool":0},"H3g9vUO33PdrQ4Wb70Z3bg":{"text":"Cool stop for a drink...we never did get to sit at the bar.\n\nFinding a seat is like Walmar","useful":0,"cool":0},"GUugaFDqxVnQ9H_5KKXi2Q":{"text":"Went here while staying at the Monteleone- it's great! The carousel is super fun and very ","useful":0,"cool":0},"vhSuP5aLQVnQOyrICIDVLQ":{"text":"We stumbled over to The Carousel for a drink per our Lyft driver's recommendation. It's in","useful":3,"cool":3},"KwxIu5AAinitO8Gtl9IxxQ":{"text":"The novelty of the bar is not worth the chaos and crowds. I stayed at the Monteleone. We w","useful":2,"cool":0},"01FpA8Dthewa0ykBxjawUQ":{"text":"Pimms No 1 cup and fleur de lis cocktails were very well mixed.  Pricey at $12 each but qu","useful":0,"cool":0},"UdUU8TGPRoc-_9Zyq0EqBg":{"text":"Rudest most unaccommodating staff I have ever encountered at an \"upscale\" bar. Bartender g","useful":1,"cool":1},"xqlBpRLuGqRyTaBiUBgokw":{"text":"If you are looking for a place to visit and wear a cute outfit Hotel Monteleone Carousel L","useful":1,"cool":0},"UhjzeQXDGB3o3WJuBgRcgg":{"text":"Tourist trap.  I visited here on a Thursday afternoon. The bar was busy as expected, but i","useful":0,"cool":0},"-r2PeE72duHDFpPqpyIRUw":{"text":"You will likely have to wait a bit to sit at the rotating bar, but it's worth it for a vie","useful":2,"cool":0},"9QQxdGU2Gw9IhEuY1vSGbA":{"text":"I was so looking forward to my visit to the Carousel Bar, unfortunately so is everyone els","useful":0,"cool":0},"l66RP49a7-pQRythWtU4tg":{"text":"Hands down my most fav bar in New Orleans, but this space also comes with the hardest seat","useful":8,"cool":8},"K6xZjKfxAWWDSEvVlpX8uQ":{"text":"Yes!!! I was told by multiple people that I needed to come here on my trip, that it was a ","useful":4,"cool":3},"FFMIGX_Mm9jx7hgLyXpEgw":{"text":"The best oyster Rockefeller's !! Huge oysters baked to perfection , plus 4 for only $12 yo","useful":0,"cool":0},"ASvq5xRvJ_S1yMT5fTbljQ":{"text":"We came here on a busy Saturday night after strolling Bourbon Street. I didn't know we wer","useful":1,"cool":2},"1XckO8Ts3CuIoPyUhlr0Mw":{"text":"This was on my list of historical bars to pop into when I was in NOLA a couple weeks ago. ","useful":3,"cool":3},"6PpHy2a9EtHgVkucOmK0CQ":{"text":"After seeing the Carousel bar featured on a BuzzFeed article, I had to add it to my list o","useful":2,"cool":1},"URFDA8BXiJ3S0PVicfmNrQ":{"text":"Great atmosphere...rotating carousel bar...really cool...found a corner to enjoy crab beig","useful":0,"cool":0},"nJqN1h85hzDnlT5o06a9UA":{"text":"We sat down for drinks on a Monday afternoon and they were very short staffed. It took for","useful":0,"cool":0},"jB0Zh7Gp8o4DOX-423I12g":{"text":"Iconic bar in New Orleans and a must visit.  The drinks were top notch.  The ambiance play","useful":1,"cool":0},"ur013rhoo38P_SE5WFiK7w":{"text":"Came down from room for drinks and dessert, lovely time and relaxing jazz music. Highly re","useful":0,"cool":1},"mHosGXYsjujWYloljvmGXg":{"text":"Fun place to stop in NOLA! The bartenders are amazing. The 2 we had had each been there ov","useful":0,"cool":0},"G8dtBogb-p-nwiPbsfcQlw":{"text":"Trying to be served and it's outrageously busy. The floor is trashed the bartenders are no","useful":1,"cool":1},"LpHjd-vlCrGZ9qZc56VGQw":{"text":"Yes, it's a gimmick.  But every once in a while, there's a place that has a gimmick that i","useful":3,"cool":3},"DBiN2SUJ-nIrLfa6VKru7Q":{"text":"FINALLY got to sit at the bar! Mission accomplished! As evident by my use of exclamation m","useful":5,"cool":3},"dZwRk8qcH18NN_BgvQgV0A":{"text":"Love, love, loved this lounge! To be honest, I'm glad that I wasn't seated at the revolvin","useful":3,"cool":3},"5TES0rBF7E3mbOcC7b2Mxw":{"text":"Very nice bar, cool atmosphere, nice music And good drinks. We made a pit stop here before","useful":0,"cool":0},"oCW7z_S6RYh_nAW6Fn_S3g":{"text":"Worth a peek. Definitely unique and mesmerizing. You might have trouble getting a spot to ","useful":1,"cool":0},"PyrsX01mbYVW0T5tRuVUmg":{"text":"Roaches on the bar. No shit. German cockroaches on the carousel bar top crawling by the pr","useful":1,"cool":1},"39o5i19TAWTkHv507tyalw":{"text":"So good we went twice during our short stay in NOLA! Good environment, great drinks and ev","useful":1,"cool":1},"KmMuYwD7A6qxyizaozYt9A":{"text":"We went on a Friday afternoon and it was SO CROWDED! We weren't able to get a seat by the ","useful":6,"cool":1},"3-45gG0PUx6HMzAzIP2cHw":{"text":"Something fun and different to check out. The bar and lounge area are worth looking at eve","useful":0,"cool":0},"4AC5ZKH7YhpUQee7lmGRWw":{"text":"By far the classiest place we visited during our trip to NOLA.  Smooth jazz, cool bartende","useful":1,"cool":1},"XHFwgDDlHHidNJwMGzo7mQ":{"text":"Of course you're here to enjoy a cocktail with a friend or loved one. Perhaps you opt to s","useful":2,"cool":0},"n0QbuYmujSaK90PWr5Xm2A":{"text":"Beautiful bar in a stunning hotel. The drinks are delish and the atmosphere is classy and ","useful":0,"cool":0},"vj9LwlKWEpO4P_d8D1aXpA":{"text":"Not impressed. I thought we were going to be on a moving carousel but I was let down. The ","useful":0,"cool":0},"9A-W0MUSUKBbSD2208ZC0A":{"text":"Iconic. Fun. Great cocktails. Take a few go-around and try to remember where you left your","useful":0,"cool":0},"0mTvRn08f8B3RfC4OWL1ow":{"text":"Visited New Orleans for the first time and googled must see places. And this place did not","useful":0,"cool":0},"eMwg6xYYUxiGagHq11gz7Q":{"text":"Very cool place to have a drink or two. It was recommended by a friend so we had to stop i","useful":0,"cool":0},"26fI2ppsafCdQFVeNaYlnA":{"text":"This is a really classy place. The bar is inside Hotel Monteleone and is really cool. You ","useful":0,"cool":0},"yFGV5a5de5BiOUCGxrAVzw":{"text":"First stop every time in NOLA. Top notch cocktails (Vieux Carre' is outstanding)  and usua","useful":0,"cool":0},"AKWaUodBZruzBDB5fj_QCw":{"text":"I finally convinced my friend to walk ALL the way down to Carousel Bar (it really isn't th","useful":3,"cool":2},"l5Lo7mHxx_y9okoGPkUwVw":{"text":"Great music - fun scene.  Great selection of classic New Orleans cocktails - can go casual","useful":0,"cool":0},"sza4Pnb4mj3tjWd601gHGQ":{"text":"We have always tried to visit and enjoy this wonderful lounge when in the Vieux Carré. But","useful":1,"cool":0},"R3wt_B4WM8r8ZpQlwiCjFA":{"text":"Hello!!\n\nI  not trying to be SAPPY but this bar really makes me feel like a kid again!! We","useful":8,"cool":8},"NikDzmukSEtdH4F9yLniKg":{"text":"When I found out that there was a carousel shaped bar that actually turned, I immediately ","useful":2,"cool":0},"1aWGQa35T74eTUq0OpQMVg":{"text":"We stopped here on Monday late afternoon hoping that it wouldn't be too busy to get a seat","useful":4,"cool":0},"i9jAv3DxxO2bIKeWntNYYA":{"text":"We were told by several people that we had to come check out this bar.  After hearing abou","useful":1,"cool":0},"BsQ3zRNefG67BuKA5qvYRw":{"text":"Located inside the historic Monteleon hotel, it's a piece of history that must visit. \n\nTh","useful":0,"cool":0},"VNEX2KvQ5HuSWvdCV-YYrw":{"text":"This is such a cute instagrammable spot for pictures! I love how the bar is an actual caro","useful":0,"cool":1},"GjQmK5s0j3_R3mnib0tTWg":{"text":"Fun place to spend some time and eat a quick meal at the bar. When we finally made our way","useful":2,"cool":2},"y4oEgqJmsj70Vcf95cupsA":{"text":"This bar is a must go to whenever you're in NOLA. The revolving bar was so cool. I got the","useful":1,"cool":2},"H6Hm5ckEJlzrku9pEHbM6Q":{"text":"I came to Carousel Bar on Valentine's Day with my wife via the recommendation of our serve","useful":0,"cool":0},"9YrLSk1dWgyP9uKtT-rkEQ":{"text":"What an excellent place to relax in wonderful leather wing back chairs, with refreshing be","useful":0,"cool":0},"DSJ7u6LLPKWJ2b9v5WcSVg":{"text":"This is just a novelty bar that everyone wants to go to for its spinning counter set-up; h","useful":1,"cool":1},"GbCHF2fVgIEeWVDGs97ICA":{"text":"Just stopped in for a drink at the bar,bartenders were arrogant and oblivious to an empty ","useful":0,"cool":0},"eDS9CzlmC9-3R6iZ3Qh3ag":{"text":"So this is the second time I've been to the carousel bar. The first time I visited here it","useful":3,"cool":1},"SU0gvuFOws2kISguyuNFZQ":{"text":"What a delightful place to sit on a hot day.","useful":0,"cool":0},"PFcOWZr975U-UGd8DabCoA":{"text":"This is a great looking hotel and the Carousel bar staff was fantastic but going in circle","useful":0,"cool":0},"NYjtvNC0EQB-OIyTXAauZQ":{"text":"The bartenders at Carousel Bar are really impressive. After taking our drink order (my gir","useful":3,"cool":1},"4IUumYGzRE0T3OsW_60bWw":{"text":"This was a cute place, but the drinks and shrimp dog was a snooze. My friend had the truff","useful":0,"cool":0},"J2PyXeJNQqDQtTwtYPdNCw":{"text":"The carousel bar is a unique experience that everyone should partake. If you get there ear","useful":0,"cool":1},"44nZ2bqnGLgcziN7u1KU4Q":{"text":"No lie. I had to wait on the opportunity to grab a seat at the Famous Carousel Bar. Yeah i","useful":2,"cool":1},"IQVDT3pwUG08NprYqNSdXg":{"text":"The area around the carousel was super packed and there is limited seating around it, only","useful":0,"cool":0},"4BMQ72HlSFe0qvX9SoQvtQ":{"text":"Beautiful place. Great French 75. A wonderful experience. Excellent attentive service give","useful":2,"cool":1},"PvE11UhO_jHmFbrpnoWvtg":{"text":"A must see place, but go before the lunch or dinner rush. We arrived at 4:30 pm on a Wedne","useful":0,"cool":0},"hRBn7JQ6a0-oR_Av_V_Kfg":{"text":"Great spot located in the heart of New Orleans. It is inside the Monteleone Hotel. Very co","useful":1,"cool":1},"PJLveHXFiPosw0fjYydZLA":{"text":"OMG this place is just so frustrating. \nThe carousel theme would probably be cool, if your","useful":1,"cool":1},"v-RgVd8YTsgYngeDwLp2tw":{"text":"Ahhhhh the famous Carousel Bar in downtown New Orleans. I have been dying to visit this pl","useful":3,"cool":3},"OLEGhvI3SQiOvQsKcW2GSw":{"text":"Best location in NOLA! Mr. David and all staff are very nice! I want to come back soon!!","useful":2,"cool":2},"f8a9BNTAjv0DTCvd6v1w5A":{"text":"Carousel Bar located in the beautiful Monteleone Hotel on Royal Street is classy and elega","useful":3,"cool":2},"GPWPpGnvSAppWIHZVE1yRw":{"text":"This is a must-visit in New Orleans.\n\nMy friends and I just came for a drink, but we loved","useful":2,"cool":0},"ehVTC22spJHws1OjpM1O8Q":{"text":"The bar/lounge is located inside a hotel. What makes this place unique is the rotating car","useful":4,"cool":3},"SgfOS8Ffh-d8w95eS4IpvA":{"text":"I went to this location for a drink and ended up having 4.... the first drink a blody mary","useful":0,"cool":0},"fMw6hX7t5i1dX-ocfz-D8A":{"text":"Stumbled onto this restaurant after a night of drinking at Harvard and stone. The quality ","useful":0,"cool":0},"Lyc7wQgygcV_qwIwDcPgKA":{"text":"What a great experience. This is one of the more unique and beautiful bars I've encountere","useful":0,"cool":0},"OIHEGZbshaCUn6xW4pdbDQ":{"text":"This bar is a gem! It is so beautiful on the inside, the staff is quite experienced, the s","useful":1,"cool":0},"RySqA3Md4qd5EXZKavtL5A":{"text":"Pretty cool to see the carousel go around. Luckily there are two bars and waitresses to se","useful":0,"cool":0},"rj_yK9SoSMzjeTcqtRcelQ":{"text":"Super cool Carousel Bar that moves around the actual bar at a nice slow place to give you ","useful":4,"cool":4},"ANR8_iA_hCXJx2WpiAZXVg":{"text":"I was a little thrown off by the fact that it was located in a hotel. I really wanted to s","useful":8,"cool":7},"Thch6ALnH07Y7JZKwnC7NQ":{"text":"Really loved this place sat next to a lady and had a great conversation it was funny cause","useful":9,"cool":10},"PFYr3JabMjAG2Il8cIZqCQ":{"text":"This is such a beautiful bar. I kept previewing reviews and browsing pictures for a clear ","useful":2,"cool":2},"7uFk_DxgvM57gxZ9jeAdfA":{"text":"Whoa!  The room is spinning!  And it's not because I've had one too many.  \n\nThat's right,","useful":10,"cool":14},"XNHdZ9T_o5cIW9PaDfsmRQ":{"text":"Fun afternoon hangout. Try the Pimm's Cup drink! Ask for Corey the bartender - he gives a ","useful":1,"cool":0},"itvqMdiPWbo9qHdcBl6AIw":{"text":"The Carousel Bar is another one of those stops I make to entertain my guests. The inside o","useful":5,"cool":1},"fdArsQSGQDvOyfxkLg1Mlg":{"text":"This bar is really awesome. It has such a great theme and tasty drinks. It is a big bar, b","useful":0,"cool":0},"4XBw7fwb8VO9-2n1QeGyFA":{"text":"Great time. Extremely relaxing wonderful drink menu and beautiful ambiance! Our family rec","useful":0,"cool":0},"ahcLhQZAwFwBC8VJYW2b8A":{"text":"This was almost not a good experience but the waitress saved it.  Very busy bar.  Found a ","useful":0,"cool":0},"GWngpD5YqH7sThXnWW78Ug":{"text":"Unfortunately do to the pandemic the actual Carousel bar part was closed which was disappo","useful":4,"cool":1},"y3niXq8PDh5_W5EQmhkWBg":{"text":"Finally was able to check out this iconic bar in the French Quarter! They have officially ","useful":9,"cool":6},"2cAr7CVeA4Jr0Sw2Ccr-aQ":{"text":"Wonderful ambiance and cocktail selection, the bartenders are efficient and friendly. One ","useful":0,"cool":0},"G3--X70yZyK9Vj_B86rrew":{"text":"This place is AWESOME! I mean, what a surprise to walk in and find a revolving bar that is","useful":0,"cool":0},"0B3MGKaMw3DB0YUwG1afVg":{"text":"The aesthetic of the bar is really cool! We didn't have a chance to sit at the bar due to ","useful":1,"cool":0},"4WCQMqcOWwIX-2NbXHx2Zg":{"text":"New Orleans, LA is one of my favorite places to visit and even though I have been here doz","useful":0,"cool":0},"AHvY3G1u9pyMWrHGF0QrQA":{"text":"I've only been here once, but I loved it enough to give it 5 stars...\n\nIt is just so uniqu","useful":1,"cool":0},"wxTIqFWrfWp2YMccTAWflw":{"text":"The carousel bar is great fun! Imagine walking into a hotel filled to the brim with old sc","useful":0,"cool":0},"VlQwNcghAij5-XDyHp3K1w":{"text":"The bartenders here were so sweet and they talk to you as you go around. The bar itself is","useful":0,"cool":1},"DFyd59FKLSlG_zojbZr6YQ":{"text":"Of all the bars in New Orleans this is definitely at the top of my list before I entered I","useful":0,"cool":1},"6K-vua40wN3xpJfmZ_YPZw":{"text":"Very cute and unique! Food and drinks was great. Only down fall is the wait time. It took ","useful":0,"cool":0},"OPQrF7cv5iYZe8uVBP335w":{"text":"Our friends, my husband and I had a fabulous time here. It's a beautiful carousel, actuall","useful":2,"cool":1},"P0s35_2T4PKeDpezT4rV1Q":{"text":"We came on a Friday night as that was when they had live music. We waited in the line to s","useful":1,"cool":0},"WJi_LvpzQ8u5j53LecZdTw":{"text":"this place was something. a spinning carousel that's actually a bar? whoa.\n\nit's a nightma","useful":4,"cool":4},"QwwgHbNCJsR_V_NKQ6FNMA":{"text":"Drink prices are good.  Wierd having the room spin before I started drinking.  Bartender w","useful":0,"cool":0},"1Y6k_YBh1fmSjG4oGTl2HQ":{"text":"This place is boring and pretentious with over-priced drinks BUT is still worth checking o","useful":1,"cool":1},"1Zzii-mpjxRC_RZVMQhQ_g":{"text":"I came here on the recommendation of friends. We were not staying at this hotel, but they ","useful":0,"cool":0},"-4eqZR3E7pY42cdJZAdzFg":{"text":"It's a cool concept, but spinning around isn't necessarily what you want to be doing while","useful":0,"cool":0},"hHJeJ-zfx-usou0cM-efOg":{"text":"Beautiful bar and cool history. Love the gin fiz but not consistent, depends on the barten","useful":0,"cool":0},"84hPJ0CIWENWZQzXzFOKEg":{"text":"I'm staying at the hotel for several nights, but it doesn't matter.  Stood in line for ove","useful":0,"cool":0},"05JNiFuWFAl96KIL_gIsoQ":{"text":"This was our second time coming here, and this place is ALWAYS busy, no matter what day or","useful":1,"cool":0},"_R6cRSJjVs50gRkvhgIbhw":{"text":"The Carousel Bar & Lounge is right in the thick of the French Quarter in New Orleans. It s","useful":20,"cool":18},"Mq60BTE7YsX9t3KaISHxZA":{"text":"Am I drunk or is the bar moving? I'm getting Fear & Loathing vibes. \n\nI seen this Carousel","useful":0,"cool":0},"yADIIyHwEo5o0pGroXrchQ":{"text":"Does having a bar spin in circles really make a lot of sense when mixed with alcohol? (the","useful":3,"cool":1},"dujLTbSwlsU1IYtIqCb2Tg":{"text":"Nice classy bar inside the Monteleone Hotel. They close according to business, so be sure ","useful":0,"cool":0},"S4Zsv5YjqW3aSyAmSAoPWA":{"text":"Live music at The Carousel Bar was a good time. The place is classy but let me get away wi","useful":3,"cool":1},"41PjEVgZYE6XS9EUmCs1Jw":{"text":"You had me at carousel... I've always been a fan of  and knew I needed to stop in to see i","useful":0,"cool":0},"mwtpJCPAfTjDLEf-0vgAuQ":{"text":"Stopped in for a drink on the way to dinner. Loved it so much we came back later that nigh","useful":0,"cool":0},"l7TceM-WsYFl_-Fyyj7RfQ":{"text":"I don't recall who gave me the recommendation, but I love this bar and lounge. FYI, Katie ","useful":1,"cool":1},"VugQeBPaB4KKMSmrpZKsVg":{"text":"Beautiful bar and experience. We got there about 20 mins before opening and there was alre","useful":4,"cool":0},"PurOavxLxxsQ3I40wOl_kQ":{"text":"Definitely need to go at least once.  You have never seen anything like it.  The only prob","useful":0,"cool":0},"Mr0Z0aUAkcZJUVUitl5Ksw":{"text":"My favorite bar in New Orleans - and I'm a local! Nothing like spinning around the carouse","useful":0,"cool":0},"HuosyzvDIxVw9hPq8F7zag":{"text":"Review update: this is still one of my favorite places in NOLA. I love this bar. They can ","useful":8,"cool":8},"rIX2F5kVK3MDC35QCxHvWQ":{"text":"This was one of the highlights of my trip to New Orleans. It's really neat to be inside is","useful":2,"cool":2},"5g0ZQSRfMoqdxU27Ao5Icw":{"text":"If you want a unique cocktail bar experience, Carousel is your place. It actually moves...","useful":4,"cool":2},"vydq99d4Q4DrFvyFJfOgjw":{"text":"Such a fun bar! After dropping our suitcases and getting breakfast me and my friends neede","useful":0,"cool":1},"cniFBB13WwZiOJCmd2USdg":{"text":"Novelty bar with limited seating options. The people who are lucky enough to obtain a seat","useful":0,"cool":0},"kF4Ohhyq8BO8hM3-MVDY6Q":{"text":"I've never had a BAD time at Carousel Bar, but it's also hard to give it a ringing endorse","useful":0,"cool":0},"E_pigIEVsNiOUUO9BPAtnw":{"text":"Very cool bar!! As all of the other reviews stated, the bar is a slow revolving carousel. ","useful":1,"cool":0},"tTXMN9079-kxOxZG-4yoEQ":{"text":"The bar was spinning and I wasn't even............\n\nAlright, I was little bit drink when I","useful":6,"cool":4},"ejSYV9vUtuucc5FvAU05RQ":{"text":"Good music and super nice bartenders! The carousel decor is really interesting and the vib","useful":1,"cool":0},"DcMTjMvjrk_GSUVbZT3L1w":{"text":"Had an old fashioned; went back to my hotel at the Q&C for a sharper drink. The revolving ","useful":0,"cool":0},"WDFUTrmRE4rtVVlfZye-Xg":{"text":"What a beautiful hotel! Inside the is this vintage bar that is moving... \n\nA CAROSEL BAR! ","useful":21,"cool":26},"mXt96YuMtPtdqTWMOkytsQ":{"text":"Such a beautiful bar. It's definitely something that you need to visit while you are in Ne","useful":3,"cool":0},"-CUyTzkVIYLPlMqfzc50RA":{"text":"AWSOME  AWESOME AWESOME.\n\nService is a +10 - food AWESOME beans , drinks so so good . They","useful":0,"cool":0},"YAsz6ruuzU-8mxtsXmKhyQ":{"text":"The Carousel Bar has been a long standing tradition in New Orleans. It's rotating bar is a","useful":1,"cool":0},"jJ28V4e9AopGTG4qYejR5Q":{"text":"Best Bloody Mary in town! I like my bloody Mary's spicy and the bartender Corey did not di","useful":2,"cool":1},"XOmLTxnF9EkEN1xtOy0Rjg":{"text":"Had to stop by here after seeing pictures and hearing about it. The bar is cute and spins ","useful":0,"cool":0},"AEejmEuz_JfPNZp5I9LGhQ":{"text":"A pretty bar inside a hotel. It was hard to grab a seat on a Saturday night but the live m","useful":1,"cool":1},"QYtpzdLc_avUVAwffMmdTA":{"text":"So fun! We had one drink and I think we rotated twice around. First off, I was wary of the","useful":0,"cool":0},"kHnJE_IU53cW9aI76trgPQ":{"text":"Come here for the bar and Sazerac but NOT the customer service both hostess & waitress pro","useful":0,"cool":0},"h80TsZRCk0PAv9WM7gnR_g":{"text":"Today was my last day in N'awlins and having drinks at Carousel Bar was the stamp and seal","useful":3,"cool":4},"Rq8HdKzg1rGQqDDY4R-fzA":{"text":"Why is this place so highly rated ?? I have yet to still find out.\n\n\nIt's horrible to find","useful":1,"cool":0},"_odELhxjVY-in7dqaMfkdA":{"text":"The process to get in to the bar is a little crazy. But overall we had a great time! There","useful":0,"cool":0},"mSR2l71-5kuTvJAJnSiCZA":{"text":"Located inside the Monteleone Hotel, this bar is almost always packed with people. When yo","useful":1,"cool":0},"X9GmqtojfCPulD1wNpn9LQ":{"text":"Great music, drinks merely ok. On popular nights it is REALLY impossible to find a seat in","useful":3,"cool":0},"976YtJjXGVjomYIZRgZ_wQ":{"text":"Too crowded. Bartenders can't keep track of who is next, so I nearly got into a fistfight.","useful":2,"cool":1},"iYV8cQwBVNz46ta89zMoig":{"text":"This was a beautiful bar but the service was extremely POOR! The host showed favoritism al","useful":0,"cool":0},"pOyTVoKVd9tiBPT287oCNg":{"text":"Located inside the Monteleone hotel, it's a very cute bar with a rotating carousel in the ","useful":6,"cool":3},"2xMXVO3dK_TDSukIF5m0MQ":{"text":"Other than the obvious allure of it being different and usually highly recommended for tou","useful":0,"cool":0},"k_ZRMv0sEg8xfFclzY-1TA":{"text":"Honestly I hated this place. I came with 6 friends while on a girls trip to New Orleans. T","useful":2,"cool":1},"0kKC39_foIFuc6c8IH_snw":{"text":"Super cute! It goes super slow but do it Corey is cool if he's at work.  I love when they ","useful":1,"cool":0},"CL942KAxboegDQfkN_5YCg":{"text":"Fun gimmick to a bar- rotating bar. Literally.\n\nWe got a sazerac here- it's not really a m","useful":0,"cool":0},"DnMkn029CtVCDp1J1iYf9Q":{"text":"It may be 3.5 stars.\n\nWe went on a Sunday late evening in the dead of August, so it was fa","useful":0,"cool":0},"ZRPE83uCayjIMQvqowaLjQ":{"text":"So cool! Parker is the BEST! He hooked us up throughout the night and knew our orders well","useful":1,"cool":1},"T1cSnAGF0Ltc_jOVHRiQCg":{"text":"A little patience and a little luck and the horses will turn your way...\n\nIn the heart of ","useful":22,"cool":18},"4t-1UO1JyMPRlloHPoZbAA":{"text":"I wanted to love this place but for $15 and a glass of poison handed to me it was not wort","useful":1,"cool":0},"w5c9Xj6xTcUYUMyqab51ww":{"text":"This is one of those spots in New Orleans that is elegant but at the same time you can fee","useful":3,"cool":3},"e8C4YgY-5QDObg8xfr2w7w":{"text":"I know there's a lot of Jazz clubs in NO. But I must say music , cocktails and service I h","useful":4,"cool":6},"cp9oFBWBer5vTCqRpuSz2g":{"text":"I love the Carousel bar! It's just kitchey and happy enough to be cool but not take itself","useful":1,"cool":1},"hD9hrQu2M3AHPBvOdOhb2Q":{"text":"Bar food: 3 stars (pot stickers, shrimp jambalaya)\nMusical entertainment: 5+++ stars\nServi","useful":1,"cool":0},"UMx4fvGjRJFPXhAgHK5ChQ":{"text":"You must go to the Carousel Bar and take a seat at the Carousel. The seats spin slowly aro","useful":7,"cool":2},"wTCtPhNt7iaCqPNlj2cboA":{"text":"I can see the appeal to this place and why it was overflowing with people. What I don't fo","useful":5,"cool":4},"4p_xRwErsN3sypR5P2aQeQ":{"text":"This is a joyful place. The drinks are good (and creative). The bartenders are talented an","useful":0,"cool":0},"CoX7kDMhepl3C0-7sM7WJw":{"text":"Fun fact: It takes approximately 15 minutes for one complete rotation of the namesake caro","useful":5,"cool":4},"Fxb9A3U68Qxkjrew5wTRsQ":{"text":"Overrated is what I would say. Super crowded, a tourist spot no doubt, but nothing super s","useful":0,"cool":0},"9CdQZgJ0zDPPcoFvJXT6Jw":{"text":"A friend of mine recommended this place to try their signature cocktail called the Sazarac","useful":0,"cool":0},"tzGZq_us5W95R4Qk-m0Aiw":{"text":"The ambiance of this bar was only matched by the excellent customer service provided by Ch","useful":0,"cool":0},"x4PrZh5CBv0DDZdlGZrGQw":{"text":"Locally owned hotel, Monteleone family still own and are active in the business, with a gr","useful":5,"cool":2},"Ty6Mh3QVyvhTM4Y0WBvI_w":{"text":"This was a great experience. The bar rotated slowly, as you sit on a carousel. The cocktai","useful":1,"cool":0},"qd2fng0FF_urfPVoTb1K0A":{"text":"Cool spot for a quick drink and if your friends name is playing. I didn't realize I needed","useful":0,"cool":0},"-B591B76Z_MrhNUZZkp9Sg":{"text":"This is a must stop when visiting or staying in the Quarter for any reason. The Bar has be","useful":4,"cool":2},"uTJ6n87-5b4KMy2Rfeh0EQ":{"text":"Absolute must do while you are in the French Quarter.  How many times will you get the cha","useful":0,"cool":0},"ZxG1V6FUkQdw_tUgAUt2zw":{"text":"The Carousel Bar is located inside the Monteleone Hotel. The bar is always crowded and you","useful":0,"cool":0},"RsgN-KrKEHe1YmvfZqWpcA":{"text":"Excellent location, absolutely beautiful bar and lounge and killer drinks!!!  Corey & Kend","useful":0,"cool":0},"c9Otvaeg78iFURqrIa1qPw":{"text":"When I was a little girl my favorite hotel lobby had an ice skating rink in it and was in ","useful":29,"cool":22},"OXCKHA6gQ4nno5PGHERSsQ":{"text":"Such a fun concept of a bar. It really makes a full, slow revolution about 15 min. Easily ","useful":1,"cool":1},"btUPFYY3cIndcS_I1igZkg":{"text":"Drinks were tasty, and service was great. we had a group of 8, and I wouldn't recommend co","useful":0,"cool":0},"LjyQPvRwN0LbHJ_Dofxyog":{"text":"A MUST-DO while on Royal Street!  Great ambience- love watching the carousel and the drink","useful":0,"cool":0},"o04aIJ0sJXr5sPQDDYj2iQ":{"text":"If you ever want to see or be seen, this is the place!  The crowd cranks up early and last","useful":1,"cool":1},"HQyLKHvArnTgjoTlZdDl4g":{"text":"This is just one of the \"must\" visits in NOLA!  Lots of history here, unique bar with grea","useful":2,"cool":0},"fFuaIDGIXAbMNlSJnD68tg":{"text":"Very classy bar in the French Quarter. Appreciate the excellent service, great food and co","useful":0,"cool":0},"x3OK5pVw19P_BX0yjI2Riw":{"text":"Carousel bar is one of those iconic hotel bars where locals take their visiting friends to","useful":21,"cool":19},"g3fBO9j2SMmyZoBNIih6Bw":{"text":"I Love This Bar!  We stayed here at the Hotel Montelone on our first trip to NOLA.  We arr","useful":4,"cool":1},"oz__05pg_VIvb25H3JevJg":{"text":"The Carousel Bar would be nice if you got to sit on the rotating bar. Otherwise, it's just","useful":4,"cool":1},"m6QmSH4LD_qRI-jwdsqpcw":{"text":"I really wish we had one of these in the DMV. It certainly has history and is one of many ","useful":2,"cool":0},"p8bObhTiiRkQDQQi4prU_Q":{"text":"It's a nice hotel, so service is very friendly and eager to please. Tried two new drinks, ","useful":2,"cool":0},"_ssRTi_AmLytFVTdxKVnLA":{"text":"After my meal at Arnaud's, I walked to have a night drink and see the bar. I was stopped a","useful":0,"cool":0},"PL8EpLA7WvzzZYihwWDzQg":{"text":"What a glimpse at vintage New Orleans style!\n\nBar patrons were friendly, and quick to let ","useful":1,"cool":1},"RQAGS6y6BNBsVdRdRteWgg":{"text":"We went back the next day and bartender was great. Taught him how to make him negroni.","useful":1,"cool":2},"6LsqvzkbWbC2Xx0SjoaCDw":{"text":"This is our second time there and we brought friend along this time.  The bartenders are g","useful":1,"cool":0},"fPpRdCpEY3izcRvxzvA33g":{"text":"Such a fun spot! We were delighted to find two spots at the bar, which is indeed a rotatin","useful":6,"cool":4},"CxsoxUBiakhrvli3gK8Ulg":{"text":"A must visit for your bar crawl in NOLA! We stopped by here before dinner thanks to a reco","useful":4,"cool":5},"QidTRtUGmBuw04jSob5QQA":{"text":"One of our main reasons for visiting New Orleans. We had a bartender who needed a little w","useful":0,"cool":0},"aCNHCsRGDOGKD9Sn5ANgUg":{"text":"I ended up going there Sunday night May 23th. Carousel Lounge is located in the historic H","useful":3,"cool":2},"EYud1fnbKPT63sMOg-7muQ":{"text":"Bartenders are very nice and accommodating when they can, gives you history and knowledge ","useful":1,"cool":0},"PwgdD4lDOj3ID-TpKqFEMw":{"text":"This place gets a big \"meh\" from me. We came around 3pm on a Thursday and it was sooooo cr","useful":1,"cool":0},"RKY9_Paed5aXYVx5CDxZrg":{"text":"I had no idea what a Ramos Gin Fizz was. Well, now I do, and it's pretty damn spectacular.","useful":1,"cool":1},"APIjCbZySZpXPLjqPfLEIQ":{"text":"A definite go to spot when me and my girlfriends want a chill night out. It is a touristy ","useful":1,"cool":0},"x40izppIq3m6FZgI59vpng":{"text":"Trendy, Creative, Great Drinks\n\nI stopped in with three friends hoping to sit at the carou","useful":0,"cool":0},"bokAz3bGFwnBT4KnekLxPg":{"text":"Just sit and spin (slowly) while you enjoy a delicious martini. This place was really cool","useful":1,"cool":0},"M1vWeW0HIrhtlcB4skq3rg":{"text":"This is a touristy and gimmicky bar that has rotating seating that circle the bar tenders.","useful":1,"cool":0},"wlW1EXJn4U4123Mz1P-kug":{"text":"The Carousel Bar, located inside the Hotel Monteleone, is a revolving bar that manages to ","useful":3,"cool":2},"k2-KAraeQCAsL-sbxd1I0A":{"text":"A fun, must visit bar in New Orleans is The Carousel Bar! The vibe is fun and different. I","useful":0,"cool":0},"ZXWeK5yk8mgAnFHxhKb59Q":{"text":"This was on my bucket list and thankfully the hotel we were staying at allowed us to hold ","useful":3,"cool":2},"LRN0Go0YGi4LAKx9qv1wAw":{"text":"*FINALLY* After 4 previous trips to New Orleans, I sat at the Carousel Bar.\n\nNow, I have v","useful":1,"cool":0},"tjbam4NAJpUSTXpUCd4Eeg":{"text":"The only reason this gets two stars is one, because it's a carousel bar, and two, because ","useful":0,"cool":2},"4xl3Yva61Yve_90XYefrTA":{"text":"It is pretty unique bar with unique choices for drinks. But very expensive. The bar moves ","useful":2,"cool":2},"_dLbLR5KuaaNgYiNTZx4vw":{"text":"The bar moves! Literally, grab a seat (if you can find one) and enjoy the ride! It takes a","useful":5,"cool":2},"KrwGMwfnfFfelL2ZU2__Mg":{"text":"Okay, so I thought I wasn't going to like this place. I saw it on a list of things to do i","useful":2,"cool":1},"rPbVqszCTc2nxDH64ePgEQ":{"text":"Let's keep this in perspective. This is a novelty stop, a photo opportunity, and not much ","useful":1,"cool":1},"gJTG8GsFlcaweR_4GK7dwg":{"text":"Blast from the past and a wonderful place for a cocktail.  The bar is charming and the sta","useful":0,"cool":0},"rrMu_TwjLXHNXUVKTANX2Q":{"text":"OMG!! The Carousel is beautiful!! \nGreat service and I had the best time celebrating my Bi","useful":0,"cool":0},"cGZLsj86XgfxgG63-suC4w":{"text":"I loved this bar I got to visit a few months ago. It's definitely a tourist attraction and","useful":1,"cool":0},"MbtXYhZXSXsd6_55Xx-Psw":{"text":"Round and round she goes. Actually. Round she goes for 15 minutes. We timed it. Obviously ","useful":3,"cool":3},"yd4cNCNX3irTZPPSbV0XLw":{"text":"This place is a must when visiting! The live jazz and spinning carousel is so regal. Servi","useful":0,"cool":0},"FaF2k1tIxYuVE6oZiiRcCw":{"text":"Never knew it'd be so hard to grab a seat at this bar. We've tried for 4 damn days and it ","useful":0,"cool":0},"HWmheBMf0Pjvg-1B1Lu1SA":{"text":"It's one of those places. An historic location and a must see to believe. But with the rot","useful":0,"cool":0},"x14XMnVLKQc0mTWbn7goDQ":{"text":"SUCH A CUTE PLACE. I have noticed all bars in Nola have a heavy handed pour. The drinks he","useful":0,"cool":0},"yZro9nX5sTtiKN6ZTDBSFA":{"text":"This place is worth it for the experience alone! The rotating carousel bar is the only one","useful":1,"cool":2},"9QUha9YK-qWzrcc_QJSe2A":{"text":"Coming back from dinner, we had to stop in the Carousel Bar for a drink or two.  Unfortuna","useful":5,"cool":5},"zdEUMd-gPD0LW3cjnAiUdQ":{"text":"Great concept but overly popular location. The bar is almost too crowded to enjoy. It's pa","useful":1,"cool":0},"81srC7psD09MTLZoeYt3Ug":{"text":"We were told we absolutely HAD to make our way to the Carousel Bar and boy, I'm SO GLAD th","useful":1,"cool":0},"oQsH2-ttqtEyO7VAxDI5kQ":{"text":"On our walk from bourbon street we stopped by this hotel bar. It had a cool concept of a r","useful":1,"cool":1},"oybb-05o_mA8H2JPCpqBsg":{"text":"I can cross something else off my bucket list. While in New Orleans a few weeks ago, my bo","useful":3,"cool":3},"Ix2m10zO4A2RFF7PtsYegA":{"text":"A carousel bar - enough said. Its a fun hang, loud, friendly and filled with people. They ","useful":2,"cool":0},"iwD1UpGTQD85Vu8ajz7JCg":{"text":"Awesome bar located inside the Hotel Monteleon in the heart of French Quarter.  The hotel ","useful":9,"cool":9},"u9X1RuaqR3WhFmbK0SsQ0Q":{"text":"We went there place was fully packed. No organization whatsoever. A waiter said he would g","useful":1,"cool":1},"8obh24eqzViCAfhbSupaWg":{"text":"The Carousel is fun for one go around of drinks and if your a tourist in town it's somethi","useful":1,"cool":0},"wjIR9T7Q9UKmcLw_2FqS8g":{"text":"We sat for 20 minutes and received no service. We saw other tables that arrived after us g","useful":0,"cool":0},"zXj0XjAzzH95vQZjnDPBWg":{"text":"Round and Round we go.......\n\nThis is inside the Hotel Monteleone.  One of the older hotel","useful":2,"cool":5},"ZEnc8KVO_KD7mQfB2KFDAQ":{"text":"The Carousel Bar is one of those Pinterest finds that I stumbled upon... If you're familia","useful":6,"cool":6},"pRAQEB3osyG3pZJgSwPUJw":{"text":"It is a family tradition to take each child to the Carousel Bar. We don't sit at the bar b","useful":0,"cool":0},"wk9JC6PDJO1unBrsPkNkWw":{"text":"No seating at the bar. People come to sit at the carousel but no one gets up to have the o","useful":1,"cool":0},"ZbzkNhOeV6-jIeR_l_1lOQ":{"text":"My husband and I stopped here for the infamous Ramos Gin Fizz which has gin, egg whites, a","useful":0,"cool":0},"PJhlaIsln1-Nw8yGhtTJvA":{"text":"Breathtaking hotel and bar. I was totally amazed and blown away until my friend from Germa","useful":0,"cool":0},"ESZYb58GP0b7grRmGUrISA":{"text":"Ernest Hemingway, Tennessee Williams, and William Faulkner always made 214 Royal Street th","useful":1,"cool":0},"XuYOEdtdOM0yZBnwZaFmtQ":{"text":"Who doesn't want to ride on a carousel while having a drink!?! My party of five arrived ar","useful":3,"cool":2},"9-iZGmQVhjJRcESBKHlVrQ":{"text":"Nice bartender, tasty cocktail, if you can get a seat at the bar it's worth the stop.","useful":0,"cool":0},"_h-ebn-IEJ7zcBazZIf57w":{"text":"Walked in thinking no seating but there were three together and we took two. Ordered drink","useful":1,"cool":0},"latlzynzhIVLFREOLmF82Q":{"text":"The perfect place to stop in the french quarter! The atmosphere here is very nice and the ","useful":0,"cool":1},"QtU4I52KdYw2JbC3gx5o2A":{"text":"Beautiful place, wonderful drinks, service and the beignets with crawfish and crab are del","useful":0,"cool":0},"Fr_W3GgFV0iByccZMx-SiA":{"text":"Best bartenders in Nola. Amazing setting. Just a great place to meet people, have drinks, ","useful":0,"cool":0},"-OyuebPhoaLdDAZdRPh-SA":{"text":"OK I'll admit it I've got a thing for this place. I mean how much fun is it to ride a caro","useful":1,"cool":0},"14YbOi3aCOwYA1byCoUr0Q":{"text":"Love this place! If you manage to get a seat at the carousel bar, you're in for a treat. T","useful":0,"cool":0},"67NrFvN4OwuZgOWn7a3KHg":{"text":"A fun place to drop in to try out some classic and even some newer cocktails. The Vieux Ca","useful":0,"cool":0},"A-pXdVflNqLUE2NKq8ZLFw":{"text":"We waited 1/2 an hour to get in  on a Wednesday at 9 pm , last call is 9:30 , bar closes a","useful":0,"cool":1},"eoW_9Ow-aMs61Nx8mPAh4w":{"text":"We actually got to sit at the actual carousel bar and we \"only\" had to wait for about 35 m","useful":5,"cool":3},"9CPGr95rqTZZhT9FyHEnbg":{"text":".Beautiful hotel bar, reasonably priced  highly recommend you stop by if you're in French ","useful":1,"cool":1},"8soO__TNUT5c6FOg31ROmg":{"text":"Warm and cozy environment. The carousel itself is kind of fun. I'd rather watch it from af","useful":1,"cool":1},"rpM0Ns99uMC-225oiRlhVA":{"text":"Fun atmosphere, quick service, good drink selection. Expect to spend a bit of money. Worth","useful":0,"cool":0},"aCbP0sIFtpdZpdWQSp4Qsw":{"text":"This place was AWESOME!!! My boyfriend and I went here after an amazing dinner at SoBou fo","useful":0,"cool":0},"ZjmA0NCe_8nyvhhDbrW_ow":{"text":"Great atmosphere and you just can't beat the \"bar seating\".  The prices are high but its i","useful":0,"cool":0},"Nez_D2RJ83b6gWJR1uE-ug":{"text":"When it comes to pina coladas, I'm a snob. Call me a pina colada snob if you'd like. For m","useful":2,"cool":1},"1PtWDCrts8dvcci2rGAy4w":{"text":"This is a fun spot if you want a little classier experience than the strip.  It gets reall","useful":0,"cool":0},"9j-CrsgG20Ptmuxd9kdRDQ":{"text":"The atmosphere here was great, and the carousel is really charming and makes you feel like","useful":3,"cool":0},"S5xrYU5XAmtyhhUOZyQVgQ":{"text":"I visited the Carousel Bar on the recommendation of a friend who I was meeting there. The ","useful":0,"cool":0},"SpMJ2wyBFDsaJSc2YrsaDw":{"text":"After all the amazing southern hospitality I've received in New Orleans, this was truly di","useful":2,"cool":1},"yrxEyu0TLDwAOXnyOQYTfQ":{"text":"Great ambiance and drinks. The fact that the bar rotates, adds a special touch to the plac","useful":0,"cool":0},"EPZtU8EdwywLvalKTVeb5Q":{"text":"The Carousel was highly recommended by a local we met on a trolly.  Great place, good musi","useful":1,"cool":0},"y4LEtqsWSzbeyaVM93iHTw":{"text":"This place is really for the experience. As tourist in New Orleans you have to go to the c","useful":0,"cool":0},"8Mami3xDaMYBpTu9jNGy-w":{"text":"Yes I am a fan!!!!\n\nLocated in The Hotel Monteleone and let me just say pictures don't do ","useful":3,"cool":3},"mfH7TeBcd-ch_kwMiUzrcA":{"text":"Great service. This bar is located in the lobby of the monteleone and it rotates! It goes ","useful":2,"cool":0},"bYT_mP9-KOt-v7AELoYkSQ":{"text":"Here visiting from Texas. Absolutely, loves this bar. Parker the Bartender was the sweetes","useful":0,"cool":0},"MdLO6Egl0guu3u010XfUWg":{"text":"Came here on a busy Friday night during my stay in New Orleans. The place is a little hard","useful":1,"cool":0},"fvKyJA30Ku-W4xBncf5OgQ":{"text":"There are so many better bars in New Orleans, don't come if you have any taste. Crowded an","useful":1,"cool":1},"pQ1CAj12Q5kiVEgjEY_Hog":{"text":"Small bar but carousel concept is cool. It goes very slowly where I didn't even think it w","useful":0,"cool":1},"IPIEFljCtMu3wXhmdZ8zCQ":{"text":"In a city so rich with history, energy and culture, you will find yourself with unlimited ","useful":49,"cool":51},"h16csnPg9GDUuq42DIcrFg":{"text":"Good bar with incredible history. Drinks are amazing, true original no water down drinks m","useful":2,"cool":0},"k33Dqp4lad5ZenBGTuL6iA":{"text":"My husband and I just stopped here for a few drinks while we were in NOLA in February. The","useful":1,"cool":2},"NL2W19aumW1uTWi-3HHf-Q":{"text":"An oasis in calm of the tumultuous sea of the French Quarter. I absolutely adored this pla","useful":3,"cool":2},"UGyMF6mij0ituhURyGyPfw":{"text":"Highly recommended bar! This place was amazing- we waited a while to finally get a seat an","useful":3,"cool":2},"NWch4igxrhdS7QEv5BgzPw":{"text":"OK, so the carousel thing is kind of cool. The seating area that is on the side of the car","useful":1,"cool":1},"S3awWondDjZ6OTeS1zjt0w":{"text":"Fun environment, friendly staff, strong drinks and decent prices. No complaints. A must vi","useful":1,"cool":0},"xyWQxsXIG-7BlYfbjeT1cA":{"text":"Loved the ambiance, yummy pina coladas! We had to sit & wait for a seat on the carousel fo","useful":0,"cool":0},"ZbyFnVGur41IpKi6475JsQ":{"text":"Love the atmosphere and the bar is unique and beautiful. Our food server was pleasant but ","useful":0,"cool":0},"drGB3sVM5jZHKPIHulh8tA":{"text":"The novelty of a slowly turning bar dissipates very quickly when the bar has a sour smell,","useful":0,"cool":0},"QytNqrVWGIVj48P3jttaTA":{"text":"This was the FIRST bar we visited in NOLA on a girls weekend - and we started things right","useful":0,"cool":1},"kMb20vDfCvtxBkU-DK8ZcQ":{"text":"At first we couldn't find the entrance to here. It is located inside a hotel and this plac","useful":0,"cool":1},"-sXJIsDdlgdl24EDjP_TRQ":{"text":"Come for the Vieux Carré cocktail and a rotating bar. If you can score one of the comforta","useful":1,"cool":1},"3yBf3WINpACU5_MCqQVc5w":{"text":"My favorite place and it's only my first time to actually make it inside. We're celebratin","useful":1,"cool":1},"A96ljZXG28fP1wLX9LNOoA":{"text":"The service abs drinks were awesome. Marvin and Kendall did a great job of taking care of ","useful":0,"cool":0},"TTkc745rjGjNzFlYwMDdDA":{"text":"The Carousel Bar is definitely an experience every tourist and local should cross off thei","useful":17,"cool":8},"RP6xhe2_OMNkGQFG3X1Bww":{"text":"Signature cocktails: Ramos Gin Fizz, Grasshopper, and Sazerac \nLiterally what it says. The","useful":1,"cool":1},"aeGOrwTaYtdg88x7HUdIag":{"text":"I was able to finally visit the Carousel Bar while in New Orleans. When we arrived, there ","useful":2,"cool":4},"Gu0bu2daImuhPyB8Z5wSsA":{"text":"Good times at the Carousel Bar. \n\nCouldn't get 2 seats at the bar so we're in a table next","useful":1,"cool":0},"5lwy1Mca2IKLd5tV8MHh_Q":{"text":"Enjoyed this one of a kind moving bar. Fascinated to drink while on the move LOL. The bart","useful":2,"cool":1},"2nnZFzl7cTx5FOm3Fl5uxQ":{"text":"Great place for a photo or two! But the service was slow, understandably, come here to sta","useful":0,"cool":0},"uBDvtchJgMaabFowYmXSLQ":{"text":"Carousel Bar & Lounge cozied us at one of their tables with comfortable chairs since the a","useful":1,"cool":2},"jTH3W3AMDhoS2w9b0atbVg":{"text":"Such a fun time. Loved our time on the carousel. Kendall made some of the best French 75s ","useful":0,"cool":0},"2sdpOGKsfB7Ro4kGrB0QHw":{"text":"The fact that there is a working carousel inside the hotel is really neat.  The fact that ","useful":2,"cool":1},"5AJB2CiaNVObf9d32NKA2A":{"text":"This is a place where you can revel in the decorations as much as enjoying the libations. ","useful":1,"cool":1},"ni12kNLoCxDy97jzcs4Jlg":{"text":"This place is fun!  It was super crowded the night we went and it took a little while for ","useful":2,"cool":3},"o2Jz3pFRcdgzxnUoNPZmsg":{"text":"Nola is a bit like Disneyland -  There are so many 'must do's', that you have to really pl","useful":6,"cool":4},"roapbj4LtaN_CwWpGbi39Q":{"text":"Always a fun go-to in New Orleans. The elegant decor, and rotating bar never fail to impre","useful":1,"cool":1},"1yymAeI7yISLjfaTNi_7Hg":{"text":"One of the best bars in Nola and Eddie and Parker are two of the best bartenders. This bar","useful":0,"cool":0},"oSYeSMdW7ei-CXxIM6jxTA":{"text":"Aside from the history of this bar this place now stands out more because of the awesomely","useful":5,"cool":2},"nlatgJgnlTyNW7CEsb5KvA":{"text":"I've heard about this place but just coincidentally happen to stumble across it as I was w","useful":4,"cool":3},"gz0A9DSTM7n8Y2NIHakkmA":{"text":"We stopped here for a cocktail Friday night and enjoyed ouR time! We sat at a bar table ne","useful":0,"cool":0},"Mi-PJd8ZAyG2I7bo7h4EXA":{"text":"We have been coming to this bar for years.... I have never had to wait even five minutes f","useful":1,"cool":1},"yo3uLX91uOaSj60zFDxpnA":{"text":"Yipes!!!!!!\n\nCarousel is a must for any first time trip to the French Quarter. Stopped in ","useful":0,"cool":0},"10iF7GmGmZnx1ZWi7jWE0g":{"text":"Such a cute place! This is inside of a hotel, so when you walk in, you see a bar but the c","useful":0,"cool":0},"2v7hBPleOndgdhxpBOMnyg":{"text":"When Bob said \"let me Bayou a drink\", we took a hard right on Bourbon to go to my second f","useful":9,"cool":6},"tB4ExAFfMjXpTSnBTkHOEw":{"text":"Popular bar in New Orleans. The main bar is a slowly revolving carousel. It's a cute place","useful":3,"cool":0},"_S9mRDTVmy6GTUU6kqHn_Q":{"text":"Just had a Vieux Carre.  So good.  Beautiful bar, nice service!\nI wish I had more time, I ","useful":1,"cool":0},"6YmZL6YkKZpgzlfmeRprNQ":{"text":"Fun place with excellent drink menu and upbeat jazz music. An upscale find in a nice hotel","useful":1,"cool":0},"OITezndCbT6IwCP0f24tzA":{"text":"My friends and I had a good time here. \nIt does get really pack and if you want to enjoy t","useful":4,"cool":3},"OPFEN4z0AS_0JKQQE1T7cA":{"text":"This is one of the coolest bars I have ever been to. It was slammed and getting seats take","useful":0,"cool":1},"0rR2cl3PVVues4lyKcULmA":{"text":"I think this may be one of the coolest bars I have ever been to. I mean how many people ca","useful":0,"cool":0},"7ysEL4bHgPhJNzNR2aX-9w":{"text":"Kudos to the bartenders for being able to make and serve drinks in a moving carousel! Been","useful":2,"cool":4},"sIP8GWrh8Jw5BDU97u0O-A":{"text":"What can I say that hasn't already been said about the Carousel Bar at the Monteleone Hote","useful":0,"cool":0},"w6DsFHBetZMtw1IgLWocUg":{"text":"Whether we are staying at the hotel or we are just stopping in for drinks this bar is a mu","useful":0,"cool":0},"sy1PEPR_WaavtxzXZ4bapw":{"text":"The Carousel Bar was one of the highlights of my trip to New Orleans. I know it's consider","useful":2,"cool":0},"AdtgpdA-8RkEPUAzN5zgrA":{"text":"Shortly after we sat down we over heard the history of this hotel and looked up while sipp","useful":0,"cool":0},"_MGezR8IqH4zah0pKi2CTQ":{"text":"Bday celebration beer and cocktail at 11 am\nSo we walk in and wait to be seat at the carou","useful":0,"cool":1},"Nwz5o33Dp-_PbHo7lR7ckA":{"text":"I feel horrible having to leave this review but the treatment I had by a manager named Kel","useful":2,"cool":1},"sPZU5zhSCdeKyr19-kTyMg":{"text":"Service was a little slow but this place was packed! Nice experience and would go back if ","useful":2,"cool":1},"7vr9baqogBKh-YBR8PKb4Q":{"text":"This place is on every list I read prior to our visit! It's in the Hotel Monteleone. We vi","useful":1,"cool":0},"Z_Xdcyua_jillIljHTvQ2w":{"text":"A beautiful and classy reprieve from the dive bars of Bourbon in the swanky Monteleone Hot","useful":6,"cool":8},"xAPM6CPE9621VdZITuuBcw":{"text":"Very disappointing. We were able to get seats at the carousel bar, but weren't ever acknow","useful":3,"cool":1},"BnGurWA_fVpKFszGcpNydA":{"text":"This unique bar is an actual moving carousel! Super hard to get a seat at this bar but so ","useful":0,"cool":0},"UCBHM1CkLgrNHHW-QS4veA":{"text":"We did not stay at the hotel but I heard AMAZING things about this place and decided to tr","useful":1,"cool":1},"xboIBSE8QgsdyCtkQkMogA":{"text":"My friend and I popped in because it felt like a must-stop while on our trip. The concept ","useful":0,"cool":0},"SYlknZmiUKr5AXgI_HV9Mw":{"text":"Pretty cool establishment. Thought it was pretty busy when we went on Thursday night so th","useful":1,"cool":1},"jIGK8Rypzgj_k7ImvF589w":{"text":"Love the historic nature of this place and everything that is represents in NOLA. This is ","useful":1,"cool":1},"b7L1oieG70OZU4TJrYoP9A":{"text":"Love the Carousel bar -- one of our favorite places on the planet!   The table near the wi","useful":0,"cool":0},"t8qPmB05UuGlOXqKU8y8mg":{"text":"This is just a cool place to go. If you can get a seat around the bar, the stools move aro","useful":0,"cool":0},"8z4j7Ue9-CMxSmU0Z6CYfw":{"text":"After reading about this bar on several blogs, I was really excited to finally visit! It w","useful":3,"cool":4},"BC9bZvVStVgT2AZOl1S2Ew":{"text":"Such a classy and unique bar located in the Hotel Monteleone in the French Quarter -- defi","useful":2,"cool":0},"nTuyuQ4YvkcM5C9f8qxUHQ":{"text":"Great service and drinks. 15min to run a full revolution. Pricing was fitting for the spot","useful":1,"cool":0},"f95WkQaAA2My93u98Wpyqw":{"text":"Nice bar and lounge but on a Saturday night it was so packed that we couldn't even get a s","useful":0,"cool":0},"jvxnk8r8g-zGVbOm8R-10Q":{"text":"Big time Catcher in the Rye fan over here and my dreams came true when I found out about t","useful":1,"cool":1},"qh_EzyELFsdBYcmdwjYPiw":{"text":"This is a very trendy upscale lounge. I really enjoyed it here. The music was great. I def","useful":2,"cool":2},"DQdxwRjgG90W5AZYurJqtQ":{"text":"You have not been to NOLA till you have been to The Carousel bar. It is amazing. Get here ","useful":2,"cool":2},"o2_bSxItJUy1uiMRUJ8IVg":{"text":"What a cool place! Drinks were great and the bartenders were funny and welcoming! It's in ","useful":0,"cool":1},"kig7N9aIRmjKIy_p2N9C_Q":{"text":"I went in at noon and ordered a glass of Perrier-Jouet and they served it to me in a plast","useful":1,"cool":1},"40T5HaOfdoqpxG3qt_0FRg":{"text":"I am just going to say that you need to visit it for yourself!! AMAIZING!! I dont remeber ","useful":0,"cool":0},"WyBiP-IEhWuzvfVDk7bmtQ":{"text":"Poor service. Very inattentive. Asked if I could have a glass of water only to have an emp","useful":1,"cool":1},"pVcQ5LuGqV7wYDyJFzOCWA":{"text":"This was probably one of my favorite bars in NOLA as far as the taste of the drinks and th","useful":0,"cool":0},"0-V8TbHfZ6qa8RdSyvnDlg":{"text":"We can here on the recommendation of our tour guide. Touted as the best Sazarac in the cit","useful":1,"cool":0},"W6k2wKann8Q8OcB-ZC0LwQ":{"text":"What a beautiful bar! The hotel is decorated ornately as you walk toward this playful bar ","useful":4,"cool":2},"y-01XYdzOHKTknRO_enWyQ":{"text":"We stayed at the Monteleone hotel for a long weekend in October. Stopped here several time","useful":1,"cool":2},"YumibuCCVvKfv3DnePgNWA":{"text":"Absolutely terrible service. I was told to sit anywhere so we at an empty table that just ","useful":2,"cool":1},"bKS3h7dtMJLETp3CDBYXZg":{"text":"The concept of a carousel bar THATS MOVING is super fun and unique but what will surprise ","useful":2,"cool":3},"fhoWuQ0JAnoc8fMekQy7tw":{"text":"If you can't get a spot at the actual carousel it's kind of just an expensive hotel bar fi","useful":2,"cool":1},"TyGVV3Ows1rQrlysy7jfhg":{"text":"Ummm....So we went for the experience. Saw the scene from \"Girls Trip\" and just had to go.","useful":0,"cool":0},"gLSnbeTAE987NggMCVJfTQ":{"text":"Went to New Orleans for my mother's birthday this year, and this was one of our favorite s","useful":0,"cool":0},"izTUvpuk-bGsAKUTa-n3Ow":{"text":"We were disappointed, when making our trip this was one of the must go to spots so we put ","useful":0,"cool":0},"dsvx0QZf--lNfkevrlfIlw":{"text":"This bar in the lobby of the Hotel Monteleone is beautiful. It is literally a carousel tha","useful":2,"cool":0},"PSXWuDgv93_TxeLFYGpbvA":{"text":"I just adore Hotel Monteleone and I loooove the Carousel Bar located inside to the right w","useful":4,"cool":2},"jLy-zHHQpvyrnIaYYJ6KhA":{"text":"People come for the rotating carousel but will never find a seat if your group is bigger t","useful":2,"cool":0},"oSe-DJMhE5YCQJAiKRKe5A":{"text":"A must do! We went early afternoon and had a pre-dinner drink and appetizer. It didn't tak","useful":0,"cool":0},"FShfMD7x6gDHIG3xTo-Kfw":{"text":"Well the city of New Orleans is in level 1 covid restrictions so we stayed at the Hotel an","useful":0,"cool":0},"aebPn3SfZBHOS3kL-UngMw":{"text":"Beautiful little bar located on Royal Street. Love that the carousel actually spins, which","useful":10,"cool":6},"6eKUdFOqrwPX9dhfMzG-MA":{"text":"I was visiting New Orleans and was told that I absolutely had to check out the Carousel Ba","useful":1,"cool":0},"maVvnpWioGAenXmUYdpsrw":{"text":"Loved this place! I would have given 5 stars but only 1 flaw about this place. The bar its","useful":3,"cool":2},"C7dBYN1OqGMTsZVeT-p1TA":{"text":"There's a couple of things I reaaaaly like. \n\nBreakfast in bed.\nSeeing my dog run at full ","useful":3,"cool":2},"GnpMSPpZ8HVqqp0lEkur-A":{"text":"Classy establishment, especially on Christmas Eve. Cool experience, the bar actually is on","useful":0,"cool":0},"Te8ua4duh97ctQN-NTztgQ":{"text":"One of the cooler hotel bars I have ever been to. The food was good, the drinks were tasty","useful":1,"cool":2},"-tAPdrbvC0RV7UrB2ZZgZg":{"text":"This was an amazing brunch spot! Everything start to finish was perfect! The carafes are t","useful":1,"cool":1},"lNo7vRJPPQKwGqeBz_0Kzg":{"text":"This place definitly has an upscale vibe to it compared to other bars on Bourbon Street. I","useful":1,"cool":0},"GTo_pPFuMZL5YMLF0gg3yg":{"text":"Best place in French Quarters by far... if you've been to the French Quarters you'll know ","useful":0,"cool":0},"ReVjCvqSKUxbseVEXktfJA":{"text":"If you go to only ONE bar in NOLA, this should be it.  \n\nA heavy drinking friend of mine i","useful":2,"cool":1},"JFB1Yp0HVzEXIwKmuQNWkA":{"text":"First time in New Orleans... OF COURSE my girls and I had to come try this place out. The ","useful":1,"cool":1},"TaJ1gUxQTrkA5OoWVJ-krg":{"text":"Best Old Fashion I have ever had.  Neat place to take a load off and soak in an authentic ","useful":0,"cool":0},"B8p4bfKoNIrEw_l52riohQ":{"text":"If you are in Nola, you need to start your evening at the Carousel Bar in the hotel Montel","useful":3,"cool":3},"JBfaWTbyrbXyJ2fyImOj-g":{"text":"Go see Frank P. ! He was not wrong when he said he doesn't make a bad drink. In fact, he m","useful":0,"cool":0},"v9x3JRBA93nLIz-YnBeMKA":{"text":"If you like loud and crowded, this is your place. Rotating bar is a vastly over rated nove","useful":0,"cool":0},"Kr-RBikH1WPmB0b8srYhIA":{"text":"Bar is located in fancy looking Hotel Monteleone\n\nThis place is cool in the attraction of ","useful":0,"cool":1},"wL0c32wyUN-3fXTRVg6LIg":{"text":"What a cool concept bar, get there early because there aren't many seats and this place is","useful":0,"cool":0},"MUztoimCSZ1_qB6Bz8OMeA":{"text":"I had this place on my wishlist for months now, and finally got\nto come for a birthday tri","useful":1,"cool":0},"Y_9WG0rfFdZUjsjezBdtJA":{"text":"Unique gem in NOLA. The carousel bar features a moving bar seating area slowly turning lik","useful":1,"cool":0},"_IYIjbV9Kb2zjxnLrvdwgg":{"text":"Parker is the man and his cocktail is great.  Even made a Ramos Gin Fizz and shook the lif","useful":0,"cool":0},"kmX74YS4kEz3pdFeaNrRqQ":{"text":"This place is magical for me.\nEvery visit to New Orleans has consisted of a visit to Carou","useful":2,"cool":0},"TNRjxyznmy8kfxBndeU2dQ":{"text":"We got a couple different cocktails and they were fabulous. \nA great Margarita and Pimm's ","useful":0,"cool":0},"oemfEtFOfJ4bkjPLF2OSiQ":{"text":"First of all, the Carousel Bar is a tourist trap. No doubt about it. It is still, however,","useful":2,"cool":0},"mYQbvob8hFtwFVLrMUinKw":{"text":"I think this place is just trendy. I'm used to trendy/themed places like this in New York ","useful":2,"cool":0},"ayccMHsviB6zXZnIIzbe4w":{"text":"My husband and I went here for a drink.  Terrible service.  Overlooked several times by ba","useful":1,"cool":1},"rtF55E9k7fJyYe8Uwe-4VQ":{"text":"Best drink: Vieux Carre. Best bartender: Marvin! Have a wonderful time here because we alw","useful":0,"cool":0},"NHEF5LT45x1_9EawmwB01g":{"text":"Snazzy, smooth, elegant all come to mind with this place. A date-worthy venue!\n\nDefinitely","useful":0,"cool":2},"YaVWsR3zQZhIPFZcEOy5JQ":{"text":"This was a fun place to start the night!\nFirst of all, the red dress run had happened earl","useful":2,"cool":2},"AmFRkHBKI99bDvaYzhhEEQ":{"text":"I really enjoyed the idea of this bar and it lent itself to some fun photos! But I do thin","useful":1,"cool":0},"37sUcdk4IJuP0cQYuHU1TA":{"text":"This was a huge hit for us, but it might be a bit of a challenge for you.  You see, it's o","useful":4,"cool":4},"S-caZURD_lz5PU5RopwHvA":{"text":"As San Diego's food scene embarks on opening up what they call \"Inspired by\" but it's down","useful":8,"cool":8},"VMTGwMYjsI9YYTg_ZDL3kg":{"text":"I think everyone visiting New Orleans has The Carousel Bar on their list.  I certainly did","useful":2,"cool":1},"GwLXZUwNy3XWC-sHV586kA":{"text":"I came in twice and wasn't able to get a seat the carousel. That's not why I rated it as s","useful":3,"cool":0},"_nxvdmP4JQYKObXS1E0GaA":{"text":"This is one of those bars you've got to check off your \"NOLA to-do list\". My boyfriend and","useful":1,"cool":1},"6TgHwNLXu__Dm3Jn852oZw":{"text":"this place is always busy but for good reason. it's so fun to sit at or around the carouse","useful":1,"cool":0},"CVhRkPuOV6lidZoHU8GQGg":{"text":"Ah the carousel at the Monteleone. An iconic bar in New Orleans made only more so by the f","useful":7,"cool":6},"D-PpUPPMFglG26Yg2AQ_qQ":{"text":"Definitely worth a stop, especially if can get a seat at the spinning bar. People watching","useful":0,"cool":0},"AgBnzgExoCgLFzKZse8jaw":{"text":"This is one of my favorite spots for a drink in New Orleans. If you don't see a seat avail","useful":1,"cool":0},"MKW8IGCH0GMK69HOWSzprA":{"text":"This is a really fun, nice bar if you want to get a drink while in New Orleans, but you al","useful":1,"cool":0},"zBS7GJxdWoU9-BUqgsogfw":{"text":"Go for the experience and grab a cocktail at the bar. The service is excellent and even if","useful":0,"cool":0},"3NxmbkWxewM1G0bsBvvWyQ":{"text":"Came here for a few drinks with friends and loved it all the drinks were amazing I had thr","useful":0,"cool":0},"jxygaNVx1FKmWDe6PzxFdQ":{"text":"I'm glad we did this.  You should do it once and then the novelty wears off rather quickly","useful":0,"cool":0},"lTOpvVMXKSGPJgXSbpN_tA":{"text":"The Carousel Bar is a 5-star setting that serves up 3-star quality drinks. \n\nDespite an ai","useful":2,"cool":3},"dl5ZGuoEkOb5E2cYIa2CLg":{"text":"This might just be my favorite place. I love love love the bar. I can't stop raving about ","useful":1,"cool":1},"23Z7tkKN6g75LK46LReenQ":{"text":"Definitely a unique bar. Worth a trip for a drink, it was very busy and difficult to get a","useful":0,"cool":0},"gj39VEeVo8aDbmZ_xW0r2A":{"text":"Such a neat and quaint bar. Tucked inside the Hotel Monteleone on the right hand side when","useful":1,"cool":1},"hy40f8nkc6DBuZ_cW27OTA":{"text":"Quite touristy, but solid cocktails and you get to ride the carousel while you drink!","useful":0,"cool":0},"2PDxJhQS73r2psu8BKQ0sA":{"text":"The Carousel Bar at the Hotel Montelone is a must. Where else can you find a rotating bar ","useful":1,"cool":1},"0GFltR0MMi7Q5t17Q_ff5w":{"text":"I came to the Carousel Bar with my girlfriends to celebrate my friends birthday. Up front ","useful":0,"cool":0},"BWNGMOCobLaItaCTFgspwQ":{"text":"The Carousel Bar is cool. If you sit at the bar, it slowly goes around. It's obviously not","useful":6,"cool":6},"u2pxqzFN86ihYP9cjFA4Aw":{"text":"Loved this bar! Bit on the pricier side, but it makes sense given the quality of the cockt","useful":0,"cool":0},"stj5kXn_v1SYN9pIlw3RTg":{"text":"This is such a cute bar and lounge. The bartenders are knowledgeable about spirits and are","useful":1,"cool":0},"o3CDU0j6QI9t19meU9BFyg":{"text":"I'll start off with the minor bad thing I've experienced with this place. Service is slow ","useful":2,"cool":0},"vqmrhpO60blchfuX9xYn5Q":{"text":"Great bar with a great staff.  By far my fav for after dinner drink in French quarter.  Me","useful":0,"cool":0},"0z2qPb1tEBsCUYQaRBEzHQ":{"text":"Awesome atmosphere! Sitting at the carousel bar was pretty lit! People there are so nice a","useful":3,"cool":1},"M5mBTrtH85xEbTKbRhLvSQ":{"text":"I scoured dozens of websites and articles to find the best places to go for cocktails in N","useful":2,"cool":2},"C5ap-ZUze-jD7ZeacsNU7g":{"text":"Slightly disappointing! Great ambience but after waiting 20 minutes for the bar to open an","useful":1,"cool":0},"Y3LtAgC3tQJjgtRm-Il6-g":{"text":"Such a great concept, the ambiance was very intimate even though it was busy.  The car goe","useful":1,"cool":1},"e-M-czh0PKnII6ew2IwdQQ":{"text":"The experience at this bar was horrible.  The manager, Judy, argued with us over a drink a","useful":1,"cool":2},"HY60GexFXms1D99pQoYUFg":{"text":"Fun to watch the bar patrons go round and round while sitting nearby in the less crowded a","useful":1,"cool":0},"DxT3Ce3aZSMdyJgt2NQGxA":{"text":"Its a bar and its a real rotating carousel.  They recently remodeled the bar and expanded ","useful":6,"cool":4},"S7tHlTyoLK8V_Z0x-UJdvA":{"text":"Stopped in for a night cap on my way to bed and I'm so glad I did.  They checked for proof","useful":2,"cool":1},"EJVJHixgP_q7YGpF07ltKg":{"text":"Really cool place but pricier than others due to it being in a hotel. I got the Ramos Gin ","useful":1,"cool":0},"zRoPOafGoztIRBcw7J_InQ":{"text":"A bit of a s------show...but it is a bar in New Orleans...lots of bachelorette parties. Wi","useful":2,"cool":2},"IYby_AsoV1Y4zo-EvmX02w":{"text":"In search of a bit of the dazzle, but still experience the smoothness of jazz, Carousel Ba","useful":1,"cool":1},"V60s7dLYCi8R0XqcMea5LQ":{"text":"Consistently rated one of the top lounges in NOLA for good reason.  I still tend to favor ","useful":2,"cool":4},"n-x2Q0GQKjJ1siHNkhTRDw":{"text":"Bang for your buck: 7/10\nQuality: 10/10\nService: 7/10\nAmbiance/Location: 10/10\nOverall: 9/","useful":1,"cool":0},"sc8eUOj683xEyDXNFGLTSA":{"text":"Why run around in circles looking for a classy bar when you can literally sit at The Carou","useful":1,"cool":0},"wEOY6uji9jOoyZZIupaQdw":{"text":"I really had a fabulous experience at this bar.  It was one of the greatest times I has in","useful":2,"cool":3},"zutMM-7CocKSfVXSJxJveg":{"text":"Go early, small groups are better to try to get a seat. The service at the bar was fantast","useful":1,"cool":0},"l4npjdDvbcIyifdJoFjsdg":{"text":"Heard about The Carousel Bar on an Internet website rating the coolest bars in America. Wh","useful":0,"cool":1},"ATfKU8HJ5R6jrm3U6TNewQ":{"text":"The service was excellent and we didn't mind the price for everything... But we ordered th","useful":0,"cool":0},"4WfHAPaENOfAToabgdVGzA":{"text":"Went here for my friends bachelorette. Get here early if you want to sit at the carousel b","useful":0,"cool":0},"6MzbV6idsO3Bel1B35eMWQ":{"text":"Understandably the seats on the carousel were jammed pack which is why we settle for loung","useful":4,"cool":1},"5Lu7HM1iMidbFkteIgeXOQ":{"text":"This place is so elegant. I could stay here all day drinking. I know the carousel is the r","useful":32,"cool":31},"xanQJiB5TTlYWEAejjwUqA":{"text":"Carousel was recommended to me by more than one person I met in New Orleans, and I'm still","useful":1,"cool":0},"rW-YTXPjjiHZgwa5V7QQ3A":{"text":"Located in Hotel Monteleone in the French Quarter, the bar is open from noon to midnight 7","useful":30,"cool":28},"OoMKoscYYbirHeQ6Sm2hxQ":{"text":"Two words:\nCRAWFISH BEIGNETS.\n\n[drools]\n\nThose are reason enough to move to Nola.\n\nGood dr","useful":0,"cool":1},"UmeROmzAZmvMYQdT5NVShg":{"text":"I was looking up things to do in New Orleans and hitting up The Carousel Bar was a must on","useful":67,"cool":60},"F0NOV3CzkkubcMSY6oLqJg":{"text":"Sophisticated fun. This is a must visit on a return trip. \n\nAtmosphere 5/5 - This is defin","useful":1,"cool":0},"NWJlnCHVU3G-kU448H0xsg":{"text":"Loved the atmosphere here. Very classy and elegant place which still has the NOLA flare. G","useful":1,"cool":0},"mwOYH7Eh88Qktq4mvcOEpw":{"text":"Giving this place a one star, not because we drank or ate here but because when we walked ","useful":1,"cool":0},"tts7MIKaeqy9MaLVVV241Q":{"text":"Just a fun place, great piece of New Orleans history and one of those places that you have","useful":0,"cool":0},"C_D0iHh3WsXAvBwmZeR3wQ":{"text":"What a unique spot in our city! So love coming here, sitting at the bar, having a cocktail","useful":0,"cool":0},"6cibYXN8PtSO-JadZx4Vzg":{"text":"The drinks here were good but it is more of a gimmick than an actual bar. \n\nInside of Hote","useful":2,"cool":0},"rm08R2AqPBydqptCD6yOzg":{"text":"I heard from multiple people this is a must-go in NOLA so on our last day when we weren't ","useful":2,"cool":1},"Kz8amSdKGCn8rW4rii22bg":{"text":"The hotel in which this bar resides is beautiful.  The bar itself is gorgeous.  The staff ","useful":1,"cool":0},"Wx12gv5GGC0UGWxVcu9qaQ":{"text":"All about the atmosphere!\n\nThis is a great bar to grab drinks with friends, but be prepare","useful":1,"cool":0},"QaimRqiuRO_qVrcJERcpTw":{"text":"Super cool location, through hotel and restaurant to the carousel bar. Nice ambiance, grea","useful":0,"cool":0},"UDIBj2x_Lu4L-MeIFb_2IA":{"text":"The Carousel was packed. It's first come first serve. Dinks were as they should be but a l","useful":0,"cool":0},"I-YXjknL4vYAQzwWiDvMMw":{"text":"I want to give this experience higher rating, but one star is deducted because people don'","useful":0,"cool":0},"mtclPqZQPp0CLyWyGyzHlw":{"text":"What a pleasant little ride! If this is on your list of to dos, get there early!! The bar ","useful":2,"cool":2},"IMb1X7DqJYQo4IHqDP7ZtQ":{"text":"So you want to go to a hotel bar.  Well it doesn't get much better than the carousel bar! ","useful":0,"cool":1}}