{"IhGUTME4Ol22OG8Ss5VD-g":{"text":"We need more small locally owned pharmacies like this in NOLA. exceptional personal servic","useful":2,"cool":0},"H-uqCTTZ_88x2zDSQLFDwg":{"text":"Friendly, convenient, reliable, helpful. Walk in with a new prescription and walk out 10 m","useful":2,"cool":0},"S7wrdloAG2jJ74glHpVjBQ":{"text":"Moved all my prescriptions here and away from Walgreen's and Majoria even though they are ","useful":2,"cool":0},"Vsl3n01hjohmdPqRhlNI_A":{"text":"Without a doubt, Charbonnet's is the best pharmacy I've ever used.\n\nI found this gem a yea","useful":3,"cool":1},"OdTpt5eyMit1AWEheCiajA":{"text":"This is the best pharmacy. They have a very knowledgeable and friendly staff and you get v","useful":0,"cool":0},"iySz605y8g_PklEMv-aB8Q":{"text":"LOVE this pharmacy! You are treated as an individual not a number and a real live person a","useful":0,"cool":0},"aFkk-LfPRGeSzXwy9rnkPQ":{"text":"I can't possibly say enough great things about Charbonnet Pharmacy! Steve and his team are","useful":3,"cool":1},"28knpKArYp8i_1nrDncdQg":{"text":"Very helpful staff and great location. Steve and his staff will move mountains to help you","useful":1,"cool":0},"9yOW9i-a3N9Oy8PvrwrQ4Q":{"text":"Super fast friendly service which is huge when you have a whiney sick baby. Will have all ","useful":1,"cool":0},"UepvxpL5-z1davvk0qYOkw":{"text":"We live nearby and have transferred all of our prescriptions here.  Wow they are courteous","useful":1,"cool":0},"-cchrNThqt_7EEX1oxDVvw":{"text":"Taking care of business like it should be!!  Hassle free value for your time and money wit","useful":3,"cool":0},"LhVl1X--0lbHCeKuyUtGvQ":{"text":"This is what a Pharmacy is suppose to be like. No corporate chain pharmacy monkey business","useful":0,"cool":0},"l8iQBoN9V8aXYe-KYei6uQ":{"text":"Fastest and easiest pharmacy I've ever been to. Staff were friendly and professional and m","useful":0,"cool":0},"J-kDy6jAptXxdjMt47dpUA":{"text":"Hard to get to. Doesn't have a variety of items I would like in my drug store. Not really ","useful":1,"cool":0},"D0pTIH3NMpZnIpTN282N_g":{"text":"You no longer have to wait in the ridiculous long periods to fill scripts at wallgreens...","useful":0,"cool":0},"eTv-SzKiEowXzYjK5kU1SA":{"text":"Quick and friendly staff. Very helpful in getting a prescription refilled before I had to ","useful":0,"cool":0},"mj0QO346UAMDMb5AkY-7tw":{"text":"Friendly, fast service. No waiting for 45 mins for a prescription. If you drop it off and ","useful":2,"cool":0}}