{"agsSiObWFwXy9Ao7urEj-Q":{"text":"I had the Edison here and I dont normally like anything too sweet so i was blown away when","useful":0,"cool":0},"7EyqjPi_t-QD_SjTMCC1IQ":{"text":"Edison's just is not the small local artisan coffee place they're trying to advertise them","useful":0,"cool":0},"9VppGOALPJB2WwsFs_O9oQ":{"text":"My new Husband and I came to NOLA for our honeymoon and stayed upstairs from Edison. We im","useful":0,"cool":0},"-l0NH2LO7LDR6fLHSAGKxA":{"text":"What a horrible experience! The server was so rude and unpleasant. As a local I wanted to ","useful":5,"cool":0},"rY5ssbWK1OeJsN6kaCVe7w":{"text":"Really terrible coffee stand inside of the Pythian Market, an exclusionary \"food hall\" in ","useful":1,"cool":0},"kO4xbB1qV-bXoPZJCgKNbw":{"text":"Decent coffee; nothing spectacular. Service was a bit gruff/terse, but not too overbearing","useful":1,"cool":1},"JA24EDigMvpg85JDbAaQGA":{"text":"A little espresso and tea bar inside of the Pythian Market. I just happened to stop in to ","useful":3,"cool":2},"Rs-9VASJoEw7fkxwipfX8g":{"text":"Great little spot in the Pythian market. Coffee is good, service was helpful and friendly.","useful":0,"cool":0},"7I2NA5TjiTZzkTbPBkcCbA":{"text":"Located in the Food court across from our hotel (Holiday Inn), it was a quick, convenient ","useful":0,"cool":0},"tmkJh_hqd1eXpNqemHLhAg":{"text":"Four words: mediocre coffee, terrible attitude.\n\nI won't get into the details, but after r","useful":1,"cool":0},"kjElF3RzFmsl-PI0xNPG1w":{"text":"I clearly went wrong here by not reading the menu. They don't have regular milk. So very m","useful":2,"cool":1},"qLk2Y5SLH_BmEsfMc9iEVQ":{"text":"I live in a nearby building, so, naturally, Edison's is my first stop almost every morning","useful":0,"cool":1},"GjaH9nWse5lFzgJUyG_JYg":{"text":"Get the Banana Nut Coffee Cake!!! They also have a yummy blueberry muffin that I like. Thi","useful":0,"cool":0},"h-o5H6QJ7BKyo3Zm_cKIPg":{"text":"Coffee was extremely hot and had a burnt/bitter flavor. Eventually threw it out after a fe","useful":3,"cool":0},"q0HUcrSjfSEW65z-JCTuaw":{"text":"Great coffee with some tasty light breakfast choices. The signature Edison drink is one of","useful":0,"cool":0}}