{"crVaveUmam4RfI0UpldfNA":{"text":"We just left this place. Absolutely horrible service.  Ordered the sweet corn and jalapeño","useful":0,"cool":0},"-OnHFra_OFMS8Lyd7ueMVQ":{"text":"Great ribs and even better entertainment. I was surprised with how good the band was going","useful":1,"cool":2},"BL6bWBaQC32cwmHeGf0OuA":{"text":"Our service was great. The food was overpriced and pretty poor quality. I added the shrimp","useful":0,"cool":0},"yFt76WRjUb7MZwtnU42uvQ":{"text":"We had the best time! Go here and ask for\"Hollywood\". He took care of us and was so entert","useful":1,"cool":1},"Oj1W8IN7O_f3tq4DeQK3Tw":{"text":"Was craving BBQ and googled BBQ near me. This place came up. Had never been here before. O","useful":0,"cool":0},"0Mee0pNt8C3F17uGcNS8NA":{"text":"Absolutely delicious!  OMG the Chicken Fried Chicken was truly the BEST I have ever had...","useful":0,"cool":0},"GL-4oqGCCPpKE9mJgOLAQQ":{"text":"Came here on a Thursday night.  Music was outstanding.  Good was good.  I can't believe th","useful":0,"cool":1},"2eebnEAwix4Lz0CeqzxByg":{"text":"Wonderful atmosphere, wonderful food. Brisket is AMAZING. Chicken strips were good. Best p","useful":0,"cool":0},"14bvAlO9QfHLD8j78LGO9w":{"text":"Awful tourist trap. Came with our NOLA Krewe for drinks/appetizers. We were charged $3 a p","useful":1,"cool":0},"I7hIsXGswNSzn-Z8B4UtQA":{"text":"BEST HURRICANES! Not too sweet but very strong and tasty! We went on a Saturday night and ","useful":0,"cool":0},"xzTbowoFB9Jjq2dqElrTdA":{"text":"Sorry BB, the food here needs a lot of work. Brisket sliders were awful. Old, dry and thin","useful":0,"cool":0},"UvyS6T6MBZNP7GJZv1R59w":{"text":"Don't think this place is \"commercial!\" It was big, clean and the food was friggin' fantas","useful":1,"cool":0},"qS9dQgbAY4-JPUKt3dOvnA":{"text":"I loved the atmosphere of this place. The live music was excellent and provided for such a","useful":0,"cool":1},"DvsjaJPxW0snrkLFL9yyFQ":{"text":"Had a fantastic time. Thirsty is the best bar tender around. Funny and great drinks! Mojit","useful":0,"cool":0},"YRLPJ0y67X1wsBZOdYPWvQ":{"text":"Great food!! Service could use some help. Great atmosphere for a night out, but not if you","useful":0,"cool":0},"XAkjQcW1GqWWFPHU3n44cA":{"text":"Great food, good music, fantastic service by our waiter, Hollywood!  The shrimp po boy dis","useful":0,"cool":0},"tuQKUQfdFTKrSZpNnegk9A":{"text":"Not a great experience. There was a cover charge and the band was on break the entire time","useful":1,"cool":0},"v4uU3AebiWi9ibOJiu3L9Q":{"text":"Go to B.B. Kings Blues Club and ask if Bar is working she's the sweetest! We had the best ","useful":0,"cool":0},"I1GIpO58FwFuJp6QeLgwAQ":{"text":"Ate an early lunch at BBKing's. We were literally the first lunch customers of the day. Th","useful":2,"cool":0},"DSD1V3MkQ9GZC1GxI4gGog":{"text":"Came as a party of five for some dinner.  Good place to hear some music, but it means it g","useful":0,"cool":0},"2uvZbi8US8jqo-skjo_0Vw":{"text":"Hey Everyone.  \n\nI guess this is a must-see place when you go to New Orleans.  But I wasn'","useful":0,"cool":0},"eOTvttRjLpL-CXxEG9UzKw":{"text":"LOVED the atmosphere! I can't express enough how much I loved the blue band that was playi","useful":2,"cool":1},"iPDMiTqK2vRkpShc1HrCJA":{"text":"Food was great, live music awesome.  Definitely would come back. Place is clean ambience i","useful":0,"cool":0},"fgKMgKMT7vObC-GXA1Z6Pw":{"text":"Great food,great atmosphere!!! I had the ribs and they were pretty good.Live band was very","useful":3,"cool":0},"F0bRAa_TnafrGpr9PUnxkA":{"text":"The only good thing I can say at all was that the live music was great!  But hey, this is ","useful":0,"cool":0},"wpjA1SekadTciOT-B6BfqA":{"text":"OUTSTANDING! We've been to BB Kings in NYC & Universal City Walk & THIS location here in N","useful":0,"cool":0},"DTeKqETf1_PLqaQguMR0rw":{"text":"Best Bloody Mary we have had in NOLA!  We did not eat but the menu is good and everything ","useful":0,"cool":0},"zkK3Mr7n6RaUUUJQn4oQbQ":{"text":"This was my first time and I absolutely love it. This was convenient and such an nice plac","useful":0,"cool":0},"2Kw2YWBfYgUksQWik5AW6Q":{"text":"Service was slow, they were out of French fries on a Monday afternoon. No one let use know","useful":0,"cool":0},"P5Y7nEB4FYupAalu-n1deg":{"text":"My first feeling was one of disappointment. While waiting to approach the host, the manage","useful":1,"cool":0},"coGXJ_IPs6PVOP8jhwTyfw":{"text":"The music was excellent with Marcella and Her Lovers group. Service was amazing the food w","useful":0,"cool":0},"Z0Qhk5Q5NhdwqmvCUnEhAA":{"text":"It is all about the entertainment and definitely not about the food. If you like the Blues","useful":2,"cool":0},"H8_J9WvhnWcOYbnLwXq0IA":{"text":"Great food. The crab dip appetizer rocks and the fried pickles with horseradish is also go","useful":0,"cool":0},"hf5o1nsaJ8PVqxKBARu0MQ":{"text":"Hollywood!!!! We are evacuees from Florida during hurricane Irma and Hollywood took fantas","useful":0,"cool":0},"5PTbvgKBAWcMcHqWmKbFAA":{"text":"Drinks here are pretty expensive. They also didn't have happy hour prices.\nGood part about","useful":0,"cool":0},"9KZhGBWecmSfHH-4yRy7mw":{"text":"We are locals and have eaten and had great food and service 3 times since New Year's Eve s","useful":0,"cool":0},"MN-yOjA9YfvzV6Ih5MaeAQ":{"text":"Here it is, a simple and sweet review.\n\nFood is good, staff is friendly and the live band ","useful":0,"cool":0},"GJZoxacbyZ0orxS4mBwksQ":{"text":"Went back tonight and they discontinued the prime rib!!! It was awesome. Also, it is obvio","useful":0,"cool":0},"5am6gtH30Nx5b35hizG_yA":{"text":"3/17/2016 \nWe had the pleasure of going to this spot on St. Patty's day. We arrived at 5:4","useful":2,"cool":1},"8BMweRFDITCs_v0EuxP1SA":{"text":"My friend and I popped into this joint to finish watching an NFL game. The bartender (Jerr","useful":1,"cool":0},"aayPSgmGW9K_C5X6_rNmUA":{"text":"Good little blues bar. Band was funny and very talented tonight. The food was good. I had ","useful":1,"cool":0},"MatmJTwP2GJqe3yOLLCL5A":{"text":"Sitting inside B.B. KINGS enjoying the live music experience but not great things to say a","useful":1,"cool":0},"xHYDEZ2KABeBNTROT6MjLw":{"text":"Live music was great. Friendly staff and delicious food. We had the bbq brisket and the sh","useful":0,"cool":0},"JuJDOStAGV87iE5ajO4OWA":{"text":"I went there last night and heard Eric Gales with the BB King All Stars. It was like the b","useful":0,"cool":0},"-3659wdgd2Zl-D4lv3PfkA":{"text":"We made our reservations in advance and three hours before called to add someone and it wa","useful":1,"cool":1},"htt1RrNITnCSjeJJaiEPtQ":{"text":"Amazing, great show good food. Our server Paula was the best. Would go back just for her!!","useful":0,"cool":0},"kI9T7VanxhbRIjxNO1cW1A":{"text":"Maybe it's just my bad luck in timing, but I've been to this and the club in Nashville on ","useful":0,"cool":0},"HWObWJNNJAlHpFo7nUZrYQ":{"text":"Food was overpriced (chicken sandwich and soda for one person was twenty bucks!) and not v","useful":0,"cool":0},"M80XmssFs8vYMHH-lKbVpA":{"text":"We were greeted very nicely and had nothing but great vibes about the restaurant. Upon get","useful":2,"cool":0},"ss1821N8DwqQhYXF0J4KCQ":{"text":"This was probably one of my favorite places that I visited in New Orleans. The atmosphere ","useful":2,"cool":1},"PXNfFXRA6k4tvHVdXA0u5g":{"text":"They just made our day and our whole New Orleans trip so special!! We came in at very wron","useful":0,"cool":1},"t1uZLtgAqwNbP3QG-6ZL4Q":{"text":"I was so sad by the service I received at the bar today. I was super excited to go to a BB","useful":0,"cool":0},"g9X5zTK8CVGon7eLOxyvIA":{"text":"Absolutely one of the best accidental finds EVER ! And the band is AWESOME! The crawfish p","useful":0,"cool":0},"3b5qM4ibQKMyCPBvgSoTEw":{"text":"Love BB KIngs\n\nWe walked up and down and all around the French market shopping area, poppi","useful":3,"cool":0},"yWXtCMoOS6i8cTcu51gHsw":{"text":"We ended up at BB King's because they had a balcony where we could sit outside and still l","useful":5,"cool":0},"-JkuguTd3Xvm3pWDzgbvsg":{"text":"The best ribs and greens I've ever had! Our server apologized to us because we waited a ve","useful":1,"cool":0},"BkKRzysTdpIlz2bCjIwkeg":{"text":"We happened on BB's while wandering and sat just  inside by the bar. I had the pulled pork","useful":0,"cool":0},"3R-N-Sr7VMebCU309scdqA":{"text":"While on vacation, my wife and I stopped there to get dinner and listen to some old-school","useful":0,"cool":0},"CTwuzrd9jOLmKU8RP4qJvA":{"text":"We came here on a Wednesday and we were impressed with the food, music and service. One of","useful":1,"cool":0},"gz7xPzRb_MHIO_ADK5cNbA":{"text":"Look. I am not one to judge this adversely. However. First, there was a cover charge that ","useful":0,"cool":0},"t_agRWmgD47fH14wCizhsQ":{"text":"First time in bb Kings today our server Hollywood did a fantastic job the debris fries wer","useful":0,"cool":0},"So1dNsZN6CeOxGUIKnYLNw":{"text":"Stopped for a drink while shopping at the French Market. My wife doesn't care for horserad","useful":0,"cool":0},"jztEKc2VJMe4BD9M9ZVeLQ":{"text":"First off the music at this place was AMAZING.. we would have stayed the entire night if i","useful":0,"cool":0},"DuYFJrcUJyzq3X6RDZ5mHQ":{"text":"Ok... I loved and hated my experience here.  Let me explain a bit.\n\nCons:\n- Our service wa","useful":4,"cool":0},"UwweYbMYjmVCazJsnlrICg":{"text":"Do not waste your time. The place was 1/3 full and it took the kitchen over 60 minutes to ","useful":1,"cool":0},"ouN5eGadCnDBfKVeb1I2-A":{"text":"Small cover charge was well worth it!\n\nOrdered ribs (really good) and a chicken sandwich t","useful":0,"cool":0},"lEdj2Y1BNC61rbnSaPufqw":{"text":"We stumbled across this place while in a bus tour and were very glad to have done so. The ","useful":0,"cool":0},"_2yKJ7mBMCeZ8vSIEpmBhQ":{"text":"The atmosphere was great good music we had good seats so I was excited but it took forever","useful":0,"cool":0},"s0lmhCCm9G6w5aQ26mp5Aw":{"text":"I was recently emailed by a member of management. The message was so very kind. She assure","useful":0,"cool":0},"Vk5QN2zxBpsO-SAWeQqEcA":{"text":"Three friends and I walked an hour from our hotel to this club to see Aiden Anderson perfo","useful":0,"cool":0},"M1l7XW6k6gfQMSV7_QgGHA":{"text":"I went there to celebrate my graduation with my family. What started off as a great dinner","useful":0,"cool":0},"-tXwePpbkWzeQieBigNvbA":{"text":"Amazing band! I never wanted to leave but my boyfriend was tired of sitting with me for co","useful":0,"cool":0},"pFdi5kEyiBMqD8rCeukDdg":{"text":"Our server was the only person working the tables. She was running ragged trying to keep u","useful":1,"cool":0},"WClHzj32G2le6yDEr6Bxmg":{"text":"We only had appetizers but both were surprisingly good.  The shrimp skillet is delicious a","useful":0,"cool":0},"6Fk77TwDHWKF2XViBVTNmA":{"text":"Went here during a trip to New Orleans to see some Mardi Gras parades.  Overall the food w","useful":1,"cool":0},"xdRyAKmuLKcC30F4DGIL3g":{"text":"It's pretty good for what it is. The music is run of the mill \"blues\" standards. The band ","useful":0,"cool":0},"l7g3EU-mGumL2iCrKK8gIw":{"text":"The fam and I enjoyed our experience here.  The service was great.  Food and drinks came o","useful":0,"cool":0},"mNSoXd3T_sesC77kyitRPw":{"text":"Cool place . Good music and the food was tasty. Service a little slow but with good music ","useful":0,"cool":0},"kvtdKdM0zQ8pJGjrbAfYNw":{"text":"The atmosphere is awesome! The band was great and our waiter Josh was great as well. The f","useful":0,"cool":0},"HkmMKPb_wURdxxDg30oj-g":{"text":"Stopped in after lunch just to take a load of and have a beer. Band playing and stayed a c","useful":0,"cool":0},"5uTqW6ki5Z_oGfMm4EkMnw":{"text":"After shopping in the market place we were so thrilled to find a FANTASTIC PLACE with grea","useful":0,"cool":0},"CKa3k4rWETHN58dplKMA2g":{"text":"We did a random stop in for food and drinks, and I must say, I'm impressed! Service, food,","useful":1,"cool":0},"sRACEUF09cJnR53PRyxZQw":{"text":"Great food, great music!  Right downtown on Decatur. Ribs just fall of the bone and the sa","useful":0,"cool":0},"knybfFXlX22wtVhUBxLkkA":{"text":"Great food ,great music I would definitely go back. I would recommend the yazzo catfish an","useful":0,"cool":0},"VSo_arrOox-r0VwaOtnPPw":{"text":"Poor service, late last night of Mardi gras. $20 cover for 5 into an empty restaurant. No ","useful":1,"cool":0},"cqzLq__xFgVtwuP8ll4Zcg":{"text":"AMAZING SHOW STOPPING MUSIC!! Plus, if you are white, you don't pay a cover charge.  My br","useful":0,"cool":0},"nCJ0TdbxYoh3HPmMp2wWIQ":{"text":"Great drinks, food and live music. Two of the musicians stopped and introduced themselves ","useful":0,"cool":0},"joPQYnguU8dtiQ6qrQN1PQ":{"text":"This is a great place to have a meal in New Orleans. I came for lunch and it wasn't too pa","useful":0,"cool":0},"sgT0CwHMZdYysfY9oYba8g":{"text":"Even enough we had reservations, we were told they were overbooked and it would be a 25 mi","useful":0,"cool":0},"uSaeC4dEgbmxU8_dFbuayw":{"text":"My husband and I LOVED this place! There was a $2 cover charge, no biggie. Our waitress wa","useful":0,"cool":0},"WAKql7tzncjmAu7IE1hyFQ":{"text":"skillet shrimp and ribs were really good, ribs were falling off the bone and really juicy.","useful":0,"cool":0},"0dnIPdlKd7H9PW50kGms2Q":{"text":"My experience at BB Kings the other night was nothing short of FANTASTIC!\n\nWe sat ably the","useful":3,"cool":0},"vfY8QhhBOHBmJfT5EilgDw":{"text":"There's nothing like celebrating a wedding in New Orleans...unless you go to BB King's.\n\nW","useful":0,"cool":0},"pWlbrzoaGAuEKdVBxHk-mQ":{"text":"Sehr gutes traditionelles Restaurant \nEssen ist absolut zu empfehlen.\nMusik ist super \nEin","useful":0,"cool":0},"9e9KcPaTG6VXeAkFSvgI_Q":{"text":"The band Allstars with Darrell is absolutely incredible. We have been to New Orleans 10 ti","useful":0,"cool":0},"k4ZoF_wNUMPZB72YEo7w1Q":{"text":"Came here on a Saturday night.  The band was really really good.  We ordered fried pickles","useful":0,"cool":0},"q4zI2prjQiUKfTHgXinpDw":{"text":"The food was good and the entertainment was even better. The white chocolate banana bread ","useful":0,"cool":1},"h_dVEGd4dh9x1eaIHUY5Ng":{"text":"This restaurant was a stop for a quick lunch.   The music was good. The food was okay noth","useful":0,"cool":0},"n0pnFsw0lgAKa_TF6TKs_Q":{"text":"OUTSTANDING! We've been to BB Kings in NYC & Universal City Walk & THIS location here in N","useful":0,"cool":0},"9pRvu5a_S_vbR-gSvaxWZw":{"text":"Great barbecue and beer nice and cold. Having lunch and listening to good music. Nice clea","useful":0,"cool":0},"cQrbSO98f4aXj98B3nBgiQ":{"text":"I ordered the ribs, my husband had the shrimp poor boy and we both loved our meals. The mu","useful":0,"cool":0},"0g1O1qHkinQeoocLJTNWmg":{"text":"Catfish Po Boy with come back sauce was delicious and the music was top notch. The waitres","useful":0,"cool":0},"145Y5yjNXUuJfuw-iCehIA":{"text":"Really great atmosphere.  Saw a.few bands over.a.couple days and they were all pretty good","useful":0,"cool":0},"oYTf6wJmqnGkTXV-S6EYBg":{"text":"This place is a joke. Worst restaurant experience ever and I work in one. Food and atmosph","useful":0,"cool":0},"E7J9ivkQbg0BHPCkp9vdgQ":{"text":"The BBQ Ribs were very good. Just a little too much sauce (I'll know for next time). The b","useful":0,"cool":0},"spCeWjE3kj5MAfjNbM6obw":{"text":"I cannot believe during all my trips to New Orleans over the years, that I had never come ","useful":2,"cool":1},"pHv0ueOanbHMujMgweeLcQ":{"text":"House Band is hands down best playing in the city right now. I'm a local and it can't  be ","useful":1,"cool":0},"VYF1KgPUOU2UfEbwneSrCQ":{"text":"We loved the atmosphere...BUT food and service left a lot to be desired.  This culinary ex","useful":1,"cool":0},"JkFYktmEC27YRYTo6SBZ5w":{"text":"My family and I visited B.B. kings during our girls trip. My sister and I had been to the ","useful":0,"cool":0},"pykWCdqb6fTYkkDVcFhsGQ":{"text":"Stopped in here with my Hubby we sat upstairs our Bartenders name was HOLLYWOOD OMG!!! He ","useful":0,"cool":0},"hjWuf8vnMX6YEFRkEVisHA":{"text":"Relaxing environment. Great music. The food was very good. We were fortunate to get a nice","useful":0,"cool":0},"qJIppBOUyQ7D_LhpTvsLmw":{"text":"LOVE this restaurant - family and I were walking through the NOLA June heat all day and dr","useful":0,"cool":0},"WTtsK61Bc6zluewsjP_2EQ":{"text":"The bartenders were rude and the drinks were over priced I came with a group of 8 and they","useful":0,"cool":0},"pdz3UIq-dHt_sFZT_pJ5TQ":{"text":"Food was very okay not saying it was bad just wasn't for me but the atmosphere was great t","useful":0,"cool":0},"lg-mL7MVjF8mCODmme7W7A":{"text":"I love this place! \n\nThe restaurant just has such a charm to it. The stage where people ca","useful":1,"cool":0},"AjlRopNd-0SJYMU3zN_a2g":{"text":"Savannah the hostess became our server... much to our surprise she was amazing!!!! She's i","useful":0,"cool":0},"TZ7afFmnh3FKsl4N2mhxwQ":{"text":"Such a cute place for live music and drinks! First time visiting New Orleans and our serve","useful":0,"cool":0},"R-ewLQsS1HkGT0IP86Sypg":{"text":"We had a wonderful evening at this place yesterday night, on a Monday. My husband had the ","useful":0,"cool":0},"YtTdM-LSdGYdbd55JiLZZA":{"text":"Had reservations, can not seat anyone, over 1.5 hrs waiting still not seated, don't waste ","useful":0,"cool":0},"92nVrlIe8ChcM5-HaOmuUg":{"text":"This place was so fun! The ambiance is worth every penny. The Red Afro Queen (Ms Silky Sol","useful":0,"cool":0},"C4BaWxJraYiAwl5bvVCaiQ":{"text":"Mediocre service. Orders were wrong. They were out of three things we originally ordered. ","useful":0,"cool":0},"kON2fNgaafVs0n0rvlyPTA":{"text":"The worst place in New Orleans.  I recently hosted a party there and was completely ripped","useful":0,"cool":0},"vI9ckYDaP5U-R20h2aF_Xg":{"text":"What an amazing and awesome place.  We were very fortunate to come across this establishme","useful":0,"cool":0},"mNZp8H36xpREA53hlzU9fA":{"text":"LOUD! LOUD! LOUD! Seriously, this is horrible. You can't relish jazz music like that. Ther","useful":0,"cool":0},"C7gFEvhePVcQ0cGhSx5THw":{"text":"Stopped in for a quick drink and some live music.  Was HOT outside so found a small bar on","useful":0,"cool":0},"tsgJEfbojDUsRoEGT2Mp7g":{"text":"We went there for dinner and had a great time. The food was very good (my wife and I split","useful":0,"cool":0},"sV1goJOnTwj3lBF3F-SYlA":{"text":"Great food but the place is a bit too loud for me.\n\nI had the ribs and the sides that come","useful":1,"cool":0},"iCVaydnYYMozQugiWFluqw":{"text":"Been opened about 3 weeks.  The food is amazing!  Try the ribs...outstanding along with fr","useful":0,"cool":0},"iKzO4arnahnFXJmAzcRkZg":{"text":"I was sad when Buffet's left the Quarter. It was his home for gawds sake.\n\nBB Kings moves ","useful":1,"cool":1},"c59Akyw4SpFEH-jA6qYOSw":{"text":"Really ho-hum drinks and apps. Margarita was too sweet. They did have some decent music go","useful":0,"cool":0},"YymOK137GFj_e-tBDEISSg":{"text":"I'd rate the food a 5 star\nWaitress 2 stars because of her lack of awareness. All my drink","useful":2,"cool":0},"xUsalfps39hdlpp2w12usw":{"text":"Entertainment is fantastic.   Was at Coop's for dinner and wasn't impressed.  Wish we had ","useful":0,"cool":0},"nGFLohPhnMaBDg_9lAzXwQ":{"text":"This place is a parody of what a jazz/blues bar should be. It does a real disservice to BB","useful":3,"cool":0},"UiV_tip6_Xi7NYaTosOJog":{"text":"We stopped here for lunch and were seated upstairs in the balcony...beautiful!!!! My siste","useful":2,"cool":0},"mww_oHnBFX8SKbG2UNnQ3A":{"text":"We stopped here for lunch after hearing great music blasting out of the doors. The music w","useful":1,"cool":0},"vXm-cVfie-qVM7v_lolc4A":{"text":"This is definitely a tourist restaurant. My husband and I live an hour away. My husband go","useful":1,"cool":0},"ZDGfhOuaiqCsmRuylfmBPA":{"text":"They just opened.  The service and food was excellent.  They also had a live bad that was ","useful":0,"cool":0},"Ngd_L-G60TTDasV9QFLt6Q":{"text":"While the food and drink were good, our waiter was not. Unfortunately I do not remember hi","useful":0,"cool":0},"oAflj-CJT2bPp_hDJK66nA":{"text":"Great food. Great service. Ask for \"Hollywood \". He's wonderful. Super friendly and helpfu","useful":0,"cool":0},"Mfu4HDPtIVj_iyhwb6XZBA":{"text":"We had an amazing time there!! The band playing that evening (Thanksgiving day) was just a","useful":0,"cool":1},"R6SPWzhBajyz-D8ZkaQitQ":{"text":"We tried to stop in for a few drinks Saturday night as I am a huge BB fan and wanted to se","useful":0,"cool":0},"Cm87me9KywrJ569B6ZOTug":{"text":"Ribs were excellent.  Sides wanting. Cole slaw totally bland. Potato salad was eh. Just a ","useful":0,"cool":0},"798KEbbfNJ2BL8IiHg5EwA":{"text":"The music is great, and this is a fun place.  The food is over-priced and under-portioned.","useful":0,"cool":0},"nuWckBfmaGss0M7TLqyL7Q":{"text":"I would love to give this place a 5star, but theres always one person that ruins it!\nFirst","useful":2,"cool":0},"8p7hT-oOkFherUWPvS4uCA":{"text":"Pretty expensive for an average quality dish. THERE ARE NO RE-FILLS, I spent like 10 USD o","useful":0,"cool":0},"q5Za5LIs0u5mjeAUW0gT0A":{"text":"This place is absolutely awesome! Great Music & Great Food! I recommend this place to anyo","useful":0,"cool":0},"xg3JW3P9fOHefFg3ScCByQ":{"text":"Thirsty Jones pulled us in off the street, sat us down at the bar and gave us some of the ","useful":0,"cool":0},"BxR3lrbeqKjjeLvlpq8aew":{"text":"So me and my son was walking around the quarters looking for a place to go.and my son hear","useful":3,"cool":0},"eIR0n2RDX5ZofpO-yUXFQg":{"text":"This place was fantastic! The live music was great and our food was good. They had a coupl","useful":0,"cool":0},"9Trx9mwXsxsizgK_XW0_Jw":{"text":"We stopped in here as we were walking through the market because we heard the music. Best ","useful":0,"cool":0},"cfFu7yAE6RzaVEGzYulB7A":{"text":"Music was great but the beers will cost you. At $8/glass (and for nothing special... we ha","useful":1,"cool":0},"xDSR0t14OWvSorkwRXsd9Q":{"text":"The music was fantastic. We stayed 2+ hours and could've stayed longer if the chairs were ","useful":0,"cool":0},"kPqO9gRjvFs3pE16Zz0LUg":{"text":"We really enjoyed this place.  We had great drinks and food.  Their hurricane drinks were ","useful":0,"cool":0},"F2kbVMA7gsYKiemv488v2A":{"text":"One of the best experiences visiting New Orleans. Staff was amazing, especially Devan, Mus","useful":0,"cool":0},"U-c8jl5J6GwgHp4xOXEtUg":{"text":"Food is delicious but service was bad under staffed never had such terrible service!  Fift","useful":0,"cool":0},"g_7BxiRNO5I0uvV5tmwMNQ":{"text":"the star is for the food , it was great ! But the service not so much , my server ( Julia)","useful":2,"cool":0},"eqO5vy-TlDNwjo__5G8X2A":{"text":"My friend and I came over to this place ON St. Patrick's day, after the parade (or close t","useful":1,"cool":0},"Q-8ptcNlRtzkOiRzODQmIA":{"text":"We had lucked out on Frenchmen Street while scouring for a place to eat and listen to a bi","useful":1,"cool":2},"KwXEFpvjdwPvLpLahnvGjg":{"text":"We decided to try something a little different.   We headed to the blues cafe.   My husban","useful":0,"cool":0},"L0__1zOCMuNL_18ihaz89g":{"text":"Thought the shrimp PO-boy would be good; Very disappointing.  Bread for the sandwich was n","useful":0,"cool":0},"_gRyOSw9m8wfW8WkDqX-sQ":{"text":"We wanted peach cobbler and did research to find this place but after waiting 30 minutes f","useful":0,"cool":0},"6j15R-Y_VNaSjQTJQyiwgg":{"text":"We enjoyed this spot with my family. The blues band, the food the drinks and the staff wer","useful":0,"cool":0},"Xq_Jwiqrz0dzRuc8K5gWvg":{"text":"I dropped in to this restaurant while entertaining a friend that's never been to New Orlea","useful":0,"cool":0},"_CTwI1pYze7ZX9kRhD0tPA":{"text":"Oh my goodness!!!  This place!!!  Seriously!!!  If you love jazz, blues, Marvin Gaye, BB K","useful":0,"cool":0},"vfJmT3aQBPDOxA8OYJHTbw":{"text":"We had a catfish and shrimp plate with fries. Very tasty, not over the top, but pretty goo","useful":0,"cool":0},"u7gIKYCpdrM7Ryno2nNO8g":{"text":"I had an amazing time. Came across this place by just walking down the street. They turned","useful":0,"cool":0},"7sf2Rzw7gyxhOitjOq_JDA":{"text":"Went here Friday night.. Walked up to host stand.. Manager asked if I had reservation and ","useful":0,"cool":0},"5RXKOThWb6eZbyg9Dt-hpA":{"text":"This place is incredibleeeeeeee. The food was amazing and our waiter HOLLYWOOD was the bes","useful":0,"cool":0},"4N1jyq8dYzD7MaD0vzoO_w":{"text":"We celebrated our mother's 85th birthday at B.B. King's last night and we could not have m","useful":0,"cool":0},"roe5V-w9t_MeikPVo2qe7g":{"text":"Do not order the Shrimp Po Boy, hard bread, small shrimp, skimpy on the portion. Horrible!","useful":0,"cool":0},"MSPjnrpvI3qZvAO2ShqVbA":{"text":"This was a great place to stop by for a drink and listen to some music.   Our hostesss Dev","useful":0,"cool":0},"boj4gmixqx41G729xs6AFQ":{"text":"Interesting experience is the best way I can describe this. The band we amazing! I would g","useful":0,"cool":0},"l56PUMSyaO0BFkKUe4scVA":{"text":"Unfortunately many restaurants in the New Orleans Parrish were closed due to the inclement","useful":0,"cool":0},"MdYQ1_2ul6jTFnEiEXRJnw":{"text":"First time in New Orleans, left the French market and stumble onto this place. Liked it so","useful":0,"cool":0},"HnUqYQOjXpDQSULuIE7Tdw":{"text":"Great food, amazing musicians and the best staff I've experienced in a long time! Go now.","useful":0,"cool":0},"v93HmXRBjHO8obKw4_EkZA":{"text":"Excellent music, great food, attentive service (thank you, Simon!!). What else could you a","useful":0,"cool":0},"Ug2ea9KOhYxbqoBA9YtQFQ":{"text":"I had a roast beef po boy that was so delicious.  Husband had the ribs, excellent.  Entert","useful":0,"cool":0},"p29kTo64CpfAIPJ9HiLXrA":{"text":"Wandered into this place after hitting the French market. Live music was awesome! Had the ","useful":0,"cool":0},"yUldpG3wd37fbMlYPH9trQ":{"text":"We couldn't wait to experience the place.  Went there with a group of 7 during French Quar","useful":0,"cool":0},"KkBYBkXRbg7Sy-4tas9ocA":{"text":"I came here with my two friends after walking in the French Quarter all morning. The music","useful":1,"cool":0},"1lM5zhzvw4ZvJsYK2yEHbw":{"text":"Very good food & nice atmosphere. After a few days in NOLA & not having the best meals, we","useful":0,"cool":0},"p_dHExj1OcpQ89ybdKK2hQ":{"text":"Came here mainly for the music and what a great show we got. \n\nWe just ordered a small app","useful":0,"cool":0},"D96A_YfaJ3XtP5RkvZPzgg":{"text":"We are in from out of town.  We had an outstanding time and meal.  The band was amazing, b","useful":0,"cool":0},"h295L57B6ge1VilxVM2JfQ":{"text":"Hands down the best experience I have had in New Orleans. The staff is INCREDIBLE. Meredit","useful":0,"cool":0},"ZrqGU5rho644nnZOdX_AkQ":{"text":"I made reservations for Christmas Day. My party arrived a few minutes before our reservati","useful":0,"cool":0},"QeyScCM5IAtfv9fDNnxSMw":{"text":"Hollywood is the best! Awesome personality and great service! Thank you! Their bloody Mary","useful":0,"cool":0},"e7ESwpnSVrCe6bgXT1HpUg":{"text":"Good food ! Super chill spot ! First time coming here and I would def return!! We got the ","useful":0,"cool":0},"nIBV4LTmrIOHu1mZG0KFzg":{"text":"The food is amazing and Hollywood is the best person EVER! Thank you, Buddy! You rock!","useful":0,"cool":0},"ajmhfjDnuctkpWSWYPQ6wg":{"text":"Great food and service.  Best in city.  Great music also.  Will definitely be back.  Went ","useful":0,"cool":0},"5OUDsAwQ0QssadpncBHV1Q":{"text":"Great food,great atmosphere!!! I had the ribs and they were pretty good.Live band was very","useful":1,"cool":0},"8Ctfy7cAuLHTDiTWS25zaw":{"text":"First restaurant in New Orleans we visited. Live music, great food (fried pickles, definit","useful":0,"cool":0},"yDhCd18Lh11I2WDn6MkWZA":{"text":"So if your going to compete in the NOLA market you need to have a great mix of food, drink","useful":2,"cool":0},"F9291FKPW97LPnAK22J5aA":{"text":"Catfish Bites are great! Good time but too commercial. Local joints on Decatur have more t","useful":0,"cool":0},"-ImRQ0UMxyWM8JRgORn9Ng":{"text":"Horrible service. My partner and I sat for a half hour without being offered a menu or eve","useful":2,"cool":0},"-TPvs3AXC-YpHirEOS7Y8g":{"text":"I haven't been to the French Quarter in a very long time but some friends came in from out","useful":0,"cool":0},"tT1r_pea7aEGej92N1S49w":{"text":"I hosted a dinner for 40 people at BB Kings.  The service, food, atmosphere and entertainm","useful":0,"cool":0},"df-0h4s9fcCI1pcn4SCd4Q":{"text":"I've been to BB Kings in West Palm Beach as well as New Orleans many times. Always a pheno","useful":0,"cool":0},"t1lwIcVddO4mVL74T63AEA":{"text":"Our family came down for a vacation to New Orleans.   Jenny was our server, loved her smil","useful":1,"cool":0},"ONeQ6jkuuXSiPROIeFpVCA":{"text":"Had to pay a cover even though we just wanted to eat dinner. Fine, whatever. Was hoping it","useful":0,"cool":0},"khxWqHMEp_dQtvlw-mSb4w":{"text":"We went just to get the Banana Bread Pudding and it did not disappoint! We also surprising","useful":0,"cool":1},"4PrLMRh9MgFktfLyis84Zw":{"text":"Manager was very accommodating for seating. We sat at the bar and ordered drinks while we ","useful":0,"cool":0},"S3KvZxIOF4huH3m0V4IvMw":{"text":"Went to BB King's for dinner had some really good ribs, with coleslaw, and beans. The ribs","useful":0,"cool":1},"w_Uekxez-efwtoo1jUlM4w":{"text":"We saw this and had to try it Before we left. They were just getting ready to play music b","useful":0,"cool":0},"y47VFAxtbcZFn2eGdZIYXQ":{"text":"Took a break from the market on a Sunday and came across this place...OH the music, the mu","useful":1,"cool":0},"t6XsWzSyZwNt7nnoeJV83A":{"text":"We had such a wonderful time at BB King Blues Club!  Dont worry about the  small cover to ","useful":0,"cool":0},"KIOVFDycouchUBEc4b4Wug":{"text":"The ambiance was cool.\nLive band.\nHostess shown excitement of our choice to dine, but when","useful":4,"cool":2},"oeqypzkQAnrPQTblH4QoiA":{"text":"Please update the website to reflect the correct closing time! The website and yelp reflec","useful":0,"cool":0},"OO6lsu1iIAKMcR1pCGNpqg":{"text":"We were visiting New Orleans and decided to try out BB Kings. We had a group of 13 people,","useful":3,"cool":0},"1VwaCTIz0NPEzG3LGurAXQ":{"text":"The Lucile beverage is great, and the sweet onion hush puppies are amazing.  They usually ","useful":0,"cool":0},"NbTyfq6E1JesB92LNaTDeg":{"text":"Thirsty is the bomb dig. All you other bartenders are just riding on his coat tails. The b","useful":0,"cool":1},"oaVYOug616xrpnc4qIvgYg":{"text":"This place has got it all: great food, great music, great atmosphere and great service! Go","useful":0,"cool":0},"ozQ_ACHoAbwgB-7or5pKKQ":{"text":"Our server was phenomenal, she did everything right (short blonde hair with tiny buns on t","useful":1,"cool":0},"21FbhxZ_aUGlDI2uxmkXrw":{"text":"Great bands, food is good. Surcharge of 3$ each when entering. Hostess was not so nice!","useful":0,"cool":0},"odSSnRcm2_cqJGdt8mxmtg":{"text":"Love BB Kings in NOLA!  We have been to BB 's in Memphis many times and love it there too.","useful":0,"cool":0},"e9vJNZgC3chrBQVsAVwtqA":{"text":"A friend recommended that we stop in for dinner and music.  A lovely venue!  Food was grea","useful":0,"cool":0},"2rTgaEkOdqKfld2hOyqNvw":{"text":"This place was awesome! The food was yummy, the performers were great, and the service sta","useful":0,"cool":0},"GfjWomMLedvj4PECGEl0kg":{"text":"We came here to watch the Saints game with our friends. Our server, Hollywood, was really ","useful":0,"cool":0},"ejq0DwvojRPyQF7_oAgKug":{"text":"Good food, good service and really good music!  We ordered ribs and grilled chicken. We go","useful":0,"cool":0},"A_XmQNGAHVbsjRzZbRr3Fg":{"text":"Our service was pretty horrible. Took almost 40 minutes for our food to come out and our w","useful":2,"cool":0},"eKydHm1k3Cn3ZLVfcr-pjg":{"text":"Food okay , drinks hmmmm watered down...\n\nLISA AMOS! \nWe popped in and heard music paying ","useful":1,"cool":0},"H5eFnNFXWnUwDGNLHBhlFw":{"text":"Hollywood took great care of us during our visit.  Cool dude! We were visiting from Housto","useful":0,"cool":0},"r51JIAwONPXN8NlpKEiAaw":{"text":"I made a reservation about 10 days prior to my company coming to New Orleans for a convent","useful":1,"cool":0},"MS4GWa-65x0d8Dl5s9opmQ":{"text":"Awesome place! Good music all night. House salad was very good! Gumbo was not. Rice was no","useful":0,"cool":1},"7nNF1oTJRT-bM1aFmLSnyg":{"text":"My friends and I visited BB's during Mardi Gras weekend. We understood it would be a wait ","useful":2,"cool":0},"rbUDpBs7mHlNiGgESMRoEQ":{"text":"This place has it all! Friendly staff, great food and live music! We were greeted and seat","useful":0,"cool":0},"WMOHzVITm516519LOb8wKw":{"text":"Band so great tonight. The dance floor is full. Beers are pretty pricy for New Orleans but","useful":0,"cool":0},"0sEbTLUsTJV4HLt2V0SR4g":{"text":"BB Kings did not disappoint.  Great music, food and service.   Nigel was our server and wa","useful":0,"cool":0},"bx2dKSyqySDjFR2dZjGdyQ":{"text":"Been to New Orleans and Mardi Gras more times than I can count, but found a new favorite g","useful":0,"cool":0},"DtJ43lfmdNcnJFxvPbHT_w":{"text":"Dined here with a group of friends. We all thoroughly enjoyed our experience and meals ! H","useful":0,"cool":0},"2YduTNsdyFa9yHRlTC6hZw":{"text":"Just went as a tribute to BB, otherwise the drinks were bland and the servers were not BB ","useful":0,"cool":0},"m6c1Z3wR5F5SHoMM6iTPOA":{"text":"First time visiting one of these chain of clubs, it was best experienced in NOLA.  They ha","useful":2,"cool":1},"BhMBFa7XpYur9Bd40947yw":{"text":"I came here because of the live music. The food was decent and the drinks weren't very str","useful":1,"cool":0},"jxKDol8H_1G8S6GqCLxbEg":{"text":"I'm giving them 5 stars for the band alone. I only caught the last few songs of their set ","useful":0,"cool":0},"aXfVHpugztHkn5zWzn2bmA":{"text":"I come to NOLA from Florida EVERY couple of months. The ONLY thing that brings me to this ","useful":0,"cool":0},"gJEAopAHPLl1i7AsCPbqAQ":{"text":"Not sure why they say they are closed...maybe because of extra guests (rats).\nThey did \"on","useful":2,"cool":0},"VBgzF1SpwYFHZ8wttkB8wg":{"text":"This was my first and hopefully only bad experience in New Orleans. The food I would like ","useful":0,"cool":0},"0J2Ia1VdOH_vI3mlZhWhGA":{"text":"HOLLYWOOOD! I couldn't say enough positive things about our waiter. First of all, he's fro","useful":0,"cool":0},"qOfiHqUZACcediS8LOs36Q":{"text":"Hollywood was great. Solid service and music. Would recommend for a quick bite in the area","useful":0,"cool":0},"ubd3sjLATATkUyzBanf9PA":{"text":"Awesome place to grab a bite with a little sing along. Amazing musicians and the food does","useful":0,"cool":0},"rMBz5Musy1N5WV7LidPAcA":{"text":"We took my mom here for her 71 birthday u talking about everyone enjoy they self especiall","useful":0,"cool":0},"vO550BVUPSg2Ay-XV5bKfw":{"text":"Great food, excellent atmosphere and great live music! Highly recommend the roast beef po ","useful":0,"cool":0},"rAguVa62bcvu9fOnLuwymg":{"text":"The music and food were great! The place is was very clean and the service was excellent! ","useful":0,"cool":0},"h0vAX4fkBeZRolWPfIpbhg":{"text":"Great food and atmosphere! Our server Hollywood was super friendly and informative about t","useful":0,"cool":0},"TpJXw_oP8umh73V9NzdFKw":{"text":"Loved the brisket. Music wasn't as good as I've become accustomed to from this place.","useful":0,"cool":0},"wgVcWJxtNx53ivMik8Oycg":{"text":"Excellent Food, fresh food. Hostess was great helpful. Megan the waitress was very helpful","useful":0,"cool":0},"NglD5ZEpjME5XsBT4kyU3g":{"text":"The worst gumbo I have ever tried. Too much sticky rice in a cup of what tasted worse than","useful":0,"cool":0},"6XNtQlrkUaG-B57ncP6MuA":{"text":"Can here looking for good food and music.  The food was great, large portions and tasteful","useful":0,"cool":0},"j4J5MKJPAo6C9nmmkCFBIg":{"text":"I love this restaurant. Hollywood was the best server and treated us so graciously. Our fo","useful":0,"cool":0},"a2fDtdW7kRb_FaF6zQLuWQ":{"text":"Let me tell you, this was the PERFECT note to start our vacation in New Orleans on. After ","useful":3,"cool":1},"8D00aynokJNHGAxNcX9j0g":{"text":"One thing drew me in here - strolling by and on the other side of the street, I caught a g","useful":0,"cool":0},"9yklEnNMlXIjGay9ad_3Uw":{"text":"Run. Run far far away. I will not return to any of their locations.\n\nThis place has insane","useful":0,"cool":0},"7sLuozXrKnaj8FTk735IYA":{"text":"The Bloody Mary is amazing! Basically lunch in a glass, with vodka and tomato juice thrown","useful":0,"cool":0},"O3_xvY2CsrAcgCxs17SpNw":{"text":"I don't know if it's because I am from the Bay Area but this place has the best ribs I've ","useful":0,"cool":0},"Kvv2_eAG1HUWjf-dAWearQ":{"text":"Awesome rack of ribs. Best service we've had in USA. Fries were as good as we get in Austr","useful":0,"cool":0},"SabeRwP4mE1BO0RP6n30jA":{"text":"This place was so much fun! The location, atmosphere and food was amazing. Not to mention,","useful":0,"cool":0},"WbrWY5O5LQvstK9BPQqSQQ":{"text":"I had a horrible experience. To begin with, they made us pay for a band that did not even ","useful":0,"cool":0},"1UVh5wHo4DVwpidZ6bxuBg":{"text":"Great place: the food was delicious, the live music was poppin, and our waiter Hollywood w","useful":0,"cool":0},"CVSS7HB-BxVHtffzSszM1w":{"text":"You must come here for food and amazing live music. We tried the chicken fried chicken - d","useful":0,"cool":0},"aSGjgO5K-_Zo0ye2mG4HRw":{"text":"We were celebrating a birthday in New Orleans and headed to BB Kings for dinner and drinks","useful":1,"cool":0},"eDCf4ehgBQxVkZ8rG3anZQ":{"text":"Fun place to have a couple drinks with live music and a dance floor.  \nOur bartender was D","useful":0,"cool":0},"I-W90Y4OBy5zrhO8Si6LfQ":{"text":"This retaurant was amazing!!! The live music was incredible and interacted with everyone w","useful":0,"cool":0},"xsqLugH1hg_fR6HP0YqXug":{"text":"We had our reception here after our wedding ceremony and it was beyond perfect!! The food ","useful":1,"cool":1},"2D1Coq00Z0nx2AMfZe0mqw":{"text":"Music music music. Really great experience. Our waitress was great super attentive. Meal w","useful":0,"cool":0},"nATLEo98Kvq25h7BT4ZVCA":{"text":"I went here last night with my boyfriend and another couple. \nFirst, the band was awesome!","useful":0,"cool":1},"rRJKuKkX3MJe-gs1H82alA":{"text":"The band was good and the food looked good as well. However, while my girlfriend and I wer","useful":1,"cool":0},"QoEdAJY3dRFbTOR7PrPsJQ":{"text":"For an unplanned stop near the French Market, my expectations weren't necessarily high; ho","useful":0,"cool":0},"x3nvervMmbtQ-RJDBmKSPA":{"text":"This place is the best... Our server Hollywood treated us like queens!!!  He actually ran ","useful":0,"cool":0},"xvIIqVHpJBWEXcw3Mb39Ng":{"text":"Went again. Food was good and there was a cool blues band playing. Pity hardly anyone in t","useful":0,"cool":0},"MoOtbxda1VHuAYtPfBI8Mw":{"text":"Came in from California to visit New Orleans Great visiting experience TILL  We were a lit","useful":1,"cool":0},"t-_EFV46M_BvGQyQCoUmbA":{"text":"My husband and I went here for lunch. We enjoyed our time here. The food was cool. Differe","useful":0,"cool":0},"d8ufvJ9dRbv2cgqO1IPLaA":{"text":"Great atmosphere for wonderful jazzy blues entertainment! I ordered the Smokehouse Burger ","useful":0,"cool":0},"l4jVrC1I50Odruy1M7UYfQ":{"text":"5 stars for Hollywood! Me and 3 friends visiting from California came in looking for a cas","useful":0,"cool":0},"SHWkIjM9JTmBYrRWb3W-Uw":{"text":"Great place to come in and cool off from the heat with some great music and food. Our wait","useful":0,"cool":0},"LF2GoXHSJk4RYxUO55lAlg":{"text":"Writing this review mostly because of Zechariah. We were there with a big group, and he wa","useful":0,"cool":0},"mZbc9-EF5fYfnycJszRIkg":{"text":"Music was great!\n\nFood wasn't fancy by any means but tasted good for sure. \n\nDrinks were s","useful":0,"cool":0},"47TDB5lEfjHLbhax87xLjA":{"text":"Had reservations for 8:30. The place was packed so a reservation will save you a lot of ha","useful":0,"cool":0},"NUHX8XPesKFM8gMGrJi12Q":{"text":"jack was amazing. we like him so much we came back twice in one day to hang out with him. ","useful":0,"cool":0},"zDuvc9in4nl8BPUMCwMG5g":{"text":"BB King's was a fairly average restaurant, as far as we were concerned. However, we only w","useful":0,"cool":0},"PMhAa9LhL4msQRt-2lblNg":{"text":"Cool bar. Live music all the time. Quintessential New Orleans. Shout out to Thirsty, aweso","useful":0,"cool":0},"DlKh0b9YBnbogGg1YmsEVg":{"text":"Terrible service, my boyfriend and I went in to have some lunch on a Sunday and they charg","useful":0,"cool":0},"r4mouuRyWGWtT-z-Mt9YwA":{"text":"Great live band, but keep in mind that there's a live band! Sounds silly but I overlooked ","useful":0,"cool":0},"FHZGx9MBwRNrrWY2mCtHtw":{"text":"When in NOLA listening to a live band playing the blues is a must in my opinion. We manage","useful":0,"cool":0},"iyuTMt63t6Chh8J-LxnWVw":{"text":"I wish we had more time to hang out here but unfortunately we only had time to grab a supe","useful":1,"cool":2},"C_4EOceGZ4CKBEaY74pF_g":{"text":"Enjoying my birthday with wonderful friends. Love ya ladies and thank you for joining me i","useful":0,"cool":0},"gTFEXUfbwzaKwecwdNOpmw":{"text":"Our server Hollywood was awesome! He was super attentive and made us feel welcomed! When y","useful":0,"cool":0},"Q_QoyooeqLBsEm05L6QZLQ":{"text":"WARNING: If you are reading this, I may of already passed still waiting for my food at BB ","useful":4,"cool":0},"KkpTnl5Uv0wZK6qBJ_vNiA":{"text":"Wow! What we thought would round up being our worse experience quickly best experience in ","useful":0,"cool":0},"q9AED_tuasVqylOuuZ8ZWw":{"text":"We absolutely recommend this club for the best blues/jazz you will ever hear. This group h","useful":0,"cool":0},"0ZimYV2Avpf5j9ScrCkG6A":{"text":"The absolute worst experience we've had while in NOLA. They made us spend $30+ a person si","useful":1,"cool":0},"FHut8nF-KU-5xfC1T0Gm6w":{"text":"Great atmosphere!! Great drinks, food and service. Our waiter, Hollywood, was so awesome a","useful":0,"cool":0},"JN86ocZKeBf-3weTBDJ53A":{"text":"Wonderful atmosphere and music, really hard to have a conversation but you can during the ","useful":0,"cool":0},"Aqp8Rd3RJbeNAeck5rfJRw":{"text":"I made a reservation through Open Table. Granted it is Christmas. HOwever we waited more t","useful":0,"cool":0},"saOOQFzdLw2QL_11FRpFsA":{"text":"Had a great time here watching the Super Bowl with the boys. Food was good and drinks were","useful":0,"cool":0},"CHG-uU1fFkJ2uYuLYXr8mA":{"text":"Came in for the great music with the Kevin Gullage EP. The drinks are reasonably priced fo","useful":0,"cool":0},"KQNUQBIL7km9BU0zHgB5IQ":{"text":"Great food and great music. Will definitely be back soon. Will bring all the girls here fo","useful":0,"cool":0},"8zaLtYB1f_L0arh0R9me8w":{"text":"Had a great time watching the band. That to me is honestly should come there for, & not th","useful":0,"cool":0},"X_I1Y5mdvu2ctKPLWe-Olw":{"text":"This was our first visit to New Orleans. To be honest, we ate here because everywhere else","useful":0,"cool":0},"SXGQQzidZ71lBV7ib74J4w":{"text":"The food was ok. Nothing spectacular, not a lot of choices, but the ambiance more than mak","useful":1,"cool":0},"yu4Lm0W0NNnU7vHk_cRqkw":{"text":"Great music playing for a Saturday afternoon which made for great atmosphere and people wa","useful":0,"cool":0},"YF8EMTMgx0Vwiy6zZEprcQ":{"text":"Went for Lunch / it was great, got the BB's Chicken Salad, it was delicious.\n\nVery friendl","useful":0,"cool":0},"p0yJAsKqf2z6NLee97B5zA":{"text":"If you want a friendly staff, and awesome live music come here! Thirsty is the best barten","useful":0,"cool":0},"aXgBexKIuov5kWq3h1pcSQ":{"text":"Great atmosphere with live jazz band. Had the boudin and ribs--both very good. Jambalaya w","useful":0,"cool":0},"POlsKHG3Je9NbxASDFo6zA":{"text":"It was a perfect afternoon! Kevin Gullage's band was so talented and entertaining! Traditi","useful":0,"cool":0},"nX_7oWbRSSI4FyVMiQuUBQ":{"text":"Stopped in here for a drink after walking around the quarter. The staff was friendly and t","useful":0,"cool":0},"CzDq_VhvSNrv_OuKz9fyvw":{"text":"The food and atmosphere here was amazing! Hollywood, our waiter, made sure we had a wonder","useful":0,"cool":0},"_8_a3NGWJ8Y501ji5gmygw":{"text":"Our waitress Morgan was amazing! She was friendly and we tried her recommendations, she di","useful":1,"cool":1},"AKOcD2_WzCwGaXlSwtGTBg":{"text":"Walked up last night and saw a large group talk to the door man and walk away. Wasn't sure","useful":4,"cool":1},"iZuwMwd5hCRM7h4O4Z9NTg":{"text":"Live music is great, food was fine, but service was absolute TRASH. Our server came to our","useful":0,"cool":0},"XIl9TFZZzDdRrHHd80G5JQ":{"text":"When my boyfriend and I first moved to nola, we came here. It's definitely a bit touristy,","useful":2,"cool":1},"eeBI8pNJn8Jr53WqsK557w":{"text":"So I haven't been here since they changed ownership. And what an amazing job they've done.","useful":1,"cool":2},"9H_0A7DFobzg8itSWyuXPQ":{"text":"Great food and music! It's located just across from the market. We had an earlier lunch an","useful":0,"cool":0},"NrMS6LDFqT-rWS-VkU9AXw":{"text":"Service is TERRIBLE! Waitress has a bad attitude and can't wait to walk away before you ar","useful":0,"cool":0},"PkD1tIqpXtZEqfDWzg3tnQ":{"text":"Good kid friendly place to listen to some good jazz and food/drinks.  When you visit ask f","useful":0,"cool":0},"AGPqbWMR1MLUFHTBf_bKRA":{"text":"Had a great time listening to the music and having a good meal at a great price. Our waite","useful":0,"cool":0},"F1klEgLzCjN3cH-EcN_JGA":{"text":"Our first impression I would've given this place a 1 star. However the new manager made up","useful":2,"cool":2},"VqGdI52PF9WPUaDvNhw4_Q":{"text":"Yes to the food. Yes to the music. YES to the service! \n\nThis is going to be a long one. S","useful":4,"cool":4},"kJJNtXwVFYrSYCw4SDXIHg":{"text":"This is a wonderful place !! Great BBQ and amazing music . \nI cannot wait to come back!","useful":0,"cool":0},"wDfACL7mxRfwBXfJisbuog":{"text":"I really wanted to check this place out for the atmosphere and live music. Turned out not ","useful":0,"cool":0},"ji5euUWi6im-gjSqyprDjQ":{"text":"Not the old BB King - fo sure! \n\nThe host was most unwelcoming.  Waited an hour for our re","useful":0,"cool":0},"1ZUH4f3-sw5KtZTay_JOoA":{"text":"After always having such a great experience with the bb kings in Memphis we were excited t","useful":0,"cool":0},"hV8rqtQ0Miqevzfa8qzYtA":{"text":"Had a wonderful time listening to the band. The food and drinks were great as well. A good","useful":0,"cool":0},"w-IR2u7j_MDl_IKKGO23AQ":{"text":"The food was decent, and service was poor. The only good thing about this place was the mu","useful":0,"cool":0},"02tWWazSGek64xnFhZbdIg":{"text":"Food was great, drinks really good. Had a great bartender, but issues with food service. I","useful":1,"cool":0},"yOOFcZBD7uU_LAG17ZQaMg":{"text":"First stop after arriving in NOLA. Walking the French Quarter and heard live music from th","useful":0,"cool":0},"tSCuPs5YkFhPuBPHaSI_TA":{"text":"next to the \"farmers market\", we came for breakfast/lunch and found out, to our delight, t","useful":0,"cool":1},"imRDbbGk3aJjo0m9KezYhQ":{"text":"Meh.. drinks were small and weak for $9 (and I don't like super strong drinks, so that's s","useful":2,"cool":0},"TW1drBg746chr4iB3bGVCA":{"text":"I found this place online and I like that they have the music calendar posted so I could k","useful":0,"cool":0},"v3lB6wg2TFlfxx2rMCeKgA":{"text":"Great food and awesome music. We really did enjoy ourselves.  If you get a chance stop in.","useful":0,"cool":0},"804ZM7Nl3SexwQiWGZbNvQ":{"text":"We had a very large party and our waitress was amazing. She was on top of getting drinks a","useful":0,"cool":0},"lZe5LDdm3GBvGoMH6hamjg":{"text":"The music was great, but incredibly loud so you can't talk to the person next to you witho","useful":1,"cool":0},"--GdhPbOF76_wuFdRrmD1A":{"text":"What a great place!!!! From our server, Holliday, to the band that played that evening we ","useful":0,"cool":0},"pgjlI_2KsB6WWBRzAxjIOA":{"text":"We only went to use the restroom and ended up staying for 2 hours! The band was amazing om","useful":1,"cool":1},"wPOrmh6UdaJ9_j7E9Ggx4A":{"text":"My wife and I were walking in by accident looking for some chicken wings, started reading ","useful":1,"cool":0},"BwGR8-LQagpbz-ZU3QhvDA":{"text":"We happened upon B.B. Kings as we strolled thru the French Market & what a treat for us!..","useful":0,"cool":0},"3PcIcATaPeEKInaVY0KGMw":{"text":"Wonderful atmosphere and food. There is a band fee to get in but well worth it. The house ","useful":0,"cool":0},"1TaGxSsctjqEu9NIDxt23w":{"text":"This was a great place to eat! It took a while for our waiter to acknowledge us but he was","useful":0,"cool":0},"5XpxUpk5dc7MCGEb_BN3GA":{"text":"when i tell you i am so pleased to have visited this restaurant with my sweetheart \n\nthe s","useful":2,"cool":1},"AFB8AD0yvevhFttvlwSPww":{"text":"Food was just ok, server was just ok, but the band Chucks C was out if this world.  Fun an","useful":0,"cool":0},"5yPRv9MLFZ2W1T7GpUDVEQ":{"text":"The food today was wonderful! Thanks Hollywood for such wonderful service! We really enjoy","useful":1,"cool":1},"cg7GVD7cswL20b4fYE2mDg":{"text":"It was our anniversary weekend, so we decided to head to New Orleans. We just drove a roun","useful":1,"cool":0},"coN0Jorkw9e_cn_hQR5pvw":{"text":"My husband and I stopped in for lunch on a Tuesday afternoon and there was an incredible l","useful":1,"cool":0},"AghqrJI1FB5esnj6uv4f1g":{"text":"I picked this place to celebrate my birthday. It was busy due to St. Patrick's Day weekend","useful":0,"cool":0},"M-7vcs47uuS0jC7DYP6-kw":{"text":"Probably one of my worst dining experiences I've ever had in New Orleans ... there were fo","useful":0,"cool":0},"OYBXwRDJtAxab1D0Z-9RHA":{"text":"We sat waiting for our ladies and our server Eric was a fountain of information for our st","useful":0,"cool":0},"RkOhhVxVNNwYHSNZo_IK5g":{"text":"Our first stop in Nola. Music brought us in the food and service kept us. Hollywood served","useful":0,"cool":0},"hEqWuEkamtO1oS4yLEGuoA":{"text":"I came here by myself and sat near the street. It was nice. I only went for the music and ","useful":0,"cool":0},"iXTPfjyT4HrvUTVUiqcrAg":{"text":"Stumbled upon this place after wandering around the flea market.  We started off with the ","useful":0,"cool":0},"RZ8lptSVM95BkHlosEBXsw":{"text":"Had the greatest experience here!! Collin was the most amazing bartender. Planned on havin","useful":1,"cool":0},"2ljotKGaF5YTnkNNZy9EEA":{"text":"It looks like a tourist trap, but the food and music is great. We were really glad we went","useful":0,"cool":0},"NOMiLZJj03Q97RcFuQwhlQ":{"text":"This is a great restaurant to bring friends and family when they come from out of town bec","useful":0,"cool":0},"vUvFCmiUMLYH3J94ooFeXg":{"text":"When we walked in we were greeted by a very friendly hostess. There was only one other tab","useful":0,"cool":0},"eftSnpClBl8RtNpT9gbTYA":{"text":"Great live music, plenty of space, delicious food! Plus great service! Hollywood was full ","useful":0,"cool":0},"vKzljIDHF6ct7_s_zzhkDQ":{"text":"Amar was our server and he was great!  The jazz band playing was amazing.  We'll be coming","useful":0,"cool":0},"0-MSEci0UwqmF-3fKwqEbg":{"text":"Not a single thing bad to say about this place.\nIvy, Liz, Mike, employees, staff, manageme","useful":0,"cool":1},"2GR9o4KbLjN5929lmgb8zw":{"text":"We decided to eat lunch here on a whim and were blown away by how much we enjoyed this pla","useful":0,"cool":0},"Xn_GeeQBdYEQpLMEsi81pg":{"text":"The iconic BB King Blues Club is down on Decatur in a large open space that has great site","useful":1,"cool":2},"g3g_0qppy_pVMz-AUSr1Cg":{"text":"Great atmosphere, food, and music! I recommend the catfish. Greg the bartender was awesome","useful":0,"cool":0},"gNiDrxgglv_o8ilxpZnoFw":{"text":"Originally gave 3 stars, but the waiter asked us how the gumbo was and gave us another one","useful":1,"cool":1},"PpH5wmwBlf3gjFO9gbSmNg":{"text":"3 stars with the possibility of 5!!!\n\nWalking the streets of the French Quarters when we h","useful":0,"cool":0},"D_lvjQtMz-RSRHutQAZL9g":{"text":"Music - 5\nFood - 4\nCocktails - 3\nSaw numerous bands. All were great. Service was great. Fo","useful":2,"cool":1},"oWmLFC0oT9zAgraXmN_C_A":{"text":"Vacationing down in NOLA for the week and wanted to enjoy our 2nd night out with some good","useful":3,"cool":0},"VyuIQooeoIOC0vF2twUIRA":{"text":"Yum! Delicious food with great music! What a pleasant surprise on a hot day. Cold beer and","useful":0,"cool":0},"tNUBVDfz1WZrd1pqPUVHiw":{"text":"Please go. You won't be disappointed!! Fabulous music, ambience, and food make this a plac","useful":0,"cool":0},"TP3rL2KvQisODAhaJfOzjg":{"text":"My husband and I ordered the prime rib and the chicken fried chicken. Both were great! The","useful":0,"cool":0},"3Igan3gVa_E3px_3OIqUsA":{"text":"After a tour visiting plantations we stopped here on the guide's recommendation. We sat on","useful":0,"cool":0},"urEYkesbq8JdHBuBPZA-yA":{"text":"Went for lunch and was underwhelmed. There was no band, just a loud radio. The service we ","useful":0,"cool":0},"aNUx7A6BFWIjo1Fxv7VXaA":{"text":"By far my favorite spot in NOLA! Good food, good drinks, great entertainment and a superb ","useful":0,"cool":0},"JOnvvMUg6-0hc4Z6r1cyJA":{"text":"Devan our bartender... seriously an expert.  Chilled out martini glasses & they have flavo","useful":9,"cool":8},"0tukS8VZUDB8U4eZMlrPgw":{"text":"Food is good and the live music lifted my spirits.  The music is nice, reminiscent if a by","useful":0,"cool":0},"icdEwwjhj42lHYCO_9jvPg":{"text":"Wow wow wow!  The music was phenomenal!!  The BBQ was delicious!  Great location nearby th","useful":0,"cool":0},"3jhG-5zygIUzEk1uE6DmWA":{"text":"I loved the environment, live music & drinks. Gotta give a shoutout to Hollywood for check","useful":0,"cool":0},"L8xq7ZnCZXMxHjcExJWsbg":{"text":"I happened to be in town on Essence weekend and since I didn't go to any concerts or semin","useful":1,"cool":2},"N2x4hpM6KiGmTPNSxkL6Ow":{"text":"Five stars for being open on Christmas Day!  We were wandering around the French Market an","useful":0,"cool":0},"oEtiAXk1SSy-RJ3_XIisiQ":{"text":"We had a great time! The band or trio was awesome tonight. Our waitress Nicole was top of ","useful":0,"cool":0},"5Fc7oWh0-jBwpVGzIOGwtA":{"text":"This is the best blues bar in New Orleans by far for food, drinks and entertainment. Locat","useful":0,"cool":0},"RnGmCAOxJGy7TcC8jmKK6w":{"text":"Great place! Live music, cold beer and good food! Came in on a Saturday afternoon had no p","useful":0,"cool":0},"ah4SW_2unLUI3ruI3NKo1w":{"text":"The food AND the music are great. All the reviews are absolutely right about the ribs! The","useful":0,"cool":0},"cNjrAnR5L38ZKn8Yo_XheQ":{"text":"The food was great and we really loved the music, but What happened to the concierge progr","useful":0,"cool":0},"cB9WlEKfQokuEsWKxlbiFQ":{"text":"Good food! Great atmosphere! Ahmad offered great service! If I'm in NOLA again, I'll swing","useful":0,"cool":0},"FjuSx8Uku_pbhX1Axlyh0Q":{"text":"Very good food and atmosphere for people who want a good NOLA experience. We had the po bo","useful":0,"cool":0},"iibgIn4ZGkTcwMXgrEHyWw":{"text":"Good live music. We arrived a few minutes after the kitchen closed, so we weren't able to ","useful":0,"cool":0},"sJBTxf7_zodSXOjntnsUZA":{"text":"Have the Yazoo!!! I can't recommend it enough! The food and entertainment were sooo good.","useful":0,"cool":0},"kZU2j_N5rqG-_dZ1FN6gHw":{"text":"Nice escape at night to sit back, have a drink and an appetizer and enjoy very good music.","useful":1,"cool":1},"SxUFFLMcJ0S8pGjTKs4FJg":{"text":"Great atmosphere, Hollywood was a great help to us and very nice. The music was soulful an","useful":0,"cool":0},"AAHt1qx53z7kDXbbizz5HQ":{"text":"We stopped here during our bus tour because it started to rain. There was a great jazz ban","useful":0,"cool":0},"llfCMSIZOQQ3ZY9FMIcMTA":{"text":"Music 4\nFood 3\nService 3\nLove music n atmosphere is the reason to really come here. The fo","useful":0,"cool":0},"ZM1tOs12r2iloNOZEWW_Zw":{"text":"The music made it great!  We made reservations on a Thursday night and were seated right a","useful":0,"cool":0},"byl80qgtN3TMQYZym7OzcQ":{"text":"Look at this receipt!  Be ware oh the pre-calculated tip!  There was an unscrupulous barte","useful":0,"cool":0},"3cFT4_IcOwmsxRtd9y9QDA":{"text":"New Orleans is a great food town, and this was  a wasted dinner. For starters, we were a p","useful":0,"cool":0},"0euvrZBK8-DDDo2cXmPqhA":{"text":"I reserved a table months in advance, and they called me a few hours before dining to canc","useful":0,"cool":0},"OB2TtBo4M4CvEbS40BwKoA":{"text":"Enjoyed blues while in New Orleans, the vibe is very cool and laid back, all sorts of peop","useful":0,"cool":0},"5xQ08ikcCBe35GVOCDdQLA":{"text":"Didn't plan on this place as a destination... but we were walking past and I heard the mos","useful":0,"cool":0},"tb6us9OSs7YTVZINbXhU8w":{"text":"First time came to New Orleans for my girlfriend birthday and had a blast here , food grea","useful":0,"cool":0},"ZsoCpM-Wo-nioweQJLD4Cg":{"text":"I was in New Orleans for Essence Fest 2019. The service was amazing! The Manager, Hollywoo","useful":0,"cool":0},"Pk6POoAGn4DGLurTX6yXAQ":{"text":"My husband and I visited BB King's on our recent trip to NOLA and had the absolute best ti","useful":1,"cool":1},"qPRg63Sy1Sx9RucBw9Cv8w":{"text":"Great food, great service, great music! The chicken finger were amazing. Savannah was exce","useful":0,"cool":0},"OVuolGC4uDgvZA0o2iB-Gw":{"text":"Though it feels a bit more commercial than some of the other music spots in the Quarter, w","useful":1,"cool":0},"0Zloh0nSszAzaNhG3sWL2w":{"text":"Went into this place on a typical Friday afternoon... my husband and I went together... I ","useful":1,"cool":0},"n-y4xspy2UsGm7LFxy-isQ":{"text":"Food: We split the Debris Tater Tots and they were delicious; the roast beef was so tender","useful":2,"cool":1},"fRet-HxEBIJxUU2VK9Zr-g":{"text":"We had an amazing experience! Zach L. was our server and we couldn't have asked for a bett","useful":0,"cool":0},"8CSt255Vfic03jd13HW4dQ":{"text":"The environment is quite nice and the music is lovely. As a vegan there weren't many food ","useful":0,"cool":0},"9M8nbyc8etJNvl2gTnEQag":{"text":"Best BBQ pork I have ever eaten and I have been at plenty rib cook-offs.  I got the BBQ pu","useful":0,"cool":0},"_ib8eHRyYe64k2TiIYPeWA":{"text":"Great service! Delicious food! And very entertaining band! Loved everything about the atmo","useful":0,"cool":0},"XdlJ0u0RroS3kjxELuPqKw":{"text":"I had the shrimp po boy and it was so good! The live music was great and the manager was p","useful":0,"cool":0},"9ZUbkN3mZoGfGwTK-e_aIg":{"text":"The vibe and entertainment was great. Was a little thrown off though because I made a rese","useful":1,"cool":0},"Waj02H6DDk2SZIqX6uGbog":{"text":"The live music is great. Be prepared for very loud music, this is definitely not a place f","useful":1,"cool":1},"dbPnC6MkToIA7iV-MCHd1A":{"text":"Had a wonderful lunch with great music after arriving in New Orleans. Hollywood was our se","useful":0,"cool":0},"zzsE6sLtpS15-3cRe_8q-Q":{"text":"First visit to Nola. The live music was great and the pork BBQ sandwich was awesome. Our w","useful":0,"cool":0},"46yxovJO-ZJK06QG4AJ69g":{"text":"The music was so loud it was miserable.  We left before we even ordered after we paid a st","useful":0,"cool":0},"q-EeXyc_DW8IeI4MVxOk5Q":{"text":"I know there is different taste for every one. But this place i can see getting 5 stars fr","useful":10,"cool":10},"sFim0JaVyeCZScf4_7W0kw":{"text":"Made reservations and showed up for our time. Was told just because we have reservations f","useful":0,"cool":0},"E_b53HF2HwYNU1eJOSXHzg":{"text":"We had lunch here while enjoying traditional blues. Food was good with plenty to eat. We e","useful":0,"cool":0},"hDcrnbcOTI8pG7pg1ODByA":{"text":"Service was attentive and the band for a Tuesday afternoon was really good!  Recommend any","useful":0,"cool":0},"N-Igt3COtWoiVjCcpFJOTw":{"text":"Wonderful live music. We were charged a cover charge for the band which makes sense but it","useful":0,"cool":0},"IYRJPel2h4Obsbmopdgqqw":{"text":"Excellent.  Hollywood treated us wonderfully.great food. Atmosphere. Homeboy from nyc.","useful":0,"cool":0},"yam8IgmQQMxG6fyNBY-C1A":{"text":"Plan was to come in , have a couple drinks, listen to some great blues and go eat more loc","useful":1,"cool":1},"yg-eqNywYDD66GUTISiecA":{"text":"We sat in the high top area on the balcony... no live music playing. Food looked great tas","useful":2,"cool":2},"GwVtZGDc_S6GlENKe4Oj5g":{"text":"Stick with the Appetizers Burgers & Wings. The BBQ ribs I got were over cooked and under s","useful":1,"cool":0},"VqQo3lODO0YhtR8rkqOjaw":{"text":"If you're in the French Quarter and want to sit down with a drink while you listen to live","useful":0,"cool":0},"M5DVpzlvNEj5lgvIZOYxRw":{"text":"Pretty good all day happy hour.  But there is a BOGO flyer around that I happened to have ","useful":0,"cool":0},"1MvNGVcElPNSyx2x6zqmCA":{"text":"We were on the way to the Satchmo Festival when it began to pour.  We snatched seats at th","useful":2,"cool":2},"x5DCE_Ieg0TZHbAg44XdkA":{"text":"Have been twice to this location while visiting New Orleans. First time had gumbo and catf","useful":0,"cool":0},"6rTMB7oPXx0j5fYgDIXLWg":{"text":"Came in at 2 ish to have some drinks, listen to music. 15 open tables & the Manger asks th","useful":0,"cool":0},"PdRDIw_tadzrqmmNnasx4g":{"text":"Decent food. I had the blues burger and she had the red beans and rice. All were eaten. We","useful":0,"cool":0},"hU8jyiCE6XE7wBMG9RaFAQ":{"text":"We ate nachos, Tator tots, wings, and fried pickles. Our waitress lilah was super nice and","useful":0,"cool":0},"9680wnB3k6UIouv6EuAgaQ":{"text":"I had the 8 rib plate and the ribs were just as good as they are in Memphis.  I can't reme","useful":1,"cool":1},"lS0u5PB7EyoQ1Wdhp4e-Wg":{"text":"I come to New Orleans monthly and always bring guests. I've always made B.B. King's part o","useful":0,"cool":0},"UJW_v1APesR1sCjWvenB6A":{"text":"Ugh first of all, I love New Orleans in general. This is the epitome of the culture and vi","useful":19,"cool":12},"qiw66DemM_RtsQPkfd9bgw":{"text":"We stopped in here while strolling around because there was some music playing. Certainly ","useful":1,"cool":1},"KSwii-S6Tzc2d_tXYiZtqw":{"text":"Fantastic spot! The food is nothing short of delicious and the live music was a nice touch","useful":0,"cool":0},"rQaiyZGiYfvJpk0YBZ75pg":{"text":"BOOK ELSEWHERE! Very disappointed in one of my favorite establishments! Since my engagemen","useful":0,"cool":0},"zxqEQGBykFGQx4473z9wlQ":{"text":"Stopped here when Coop's Place was unavailable. Was pleasantly surprised! We came on a Fri","useful":0,"cool":0},"xbSOZwRBOuzCxQNSY7KV4w":{"text":"The food and service was horrible and as a local New Orleanian... I was embarrassed for us","useful":0,"cool":0},"1XewXQm6OI1tAWPS9qj2SQ":{"text":"Wandered in on a it day to take a rest and ended up meeting server Morgan and Manager Holl","useful":0,"cool":0},"Q40bTu81MOBLoV4WqirLyw":{"text":"Excellent lunch menu with great live music! Terrific menu and very affordable. Our server,","useful":0,"cool":0},"ws1Vn8ZUTac8X7yPtytUHw":{"text":"My family and I frequently visit New Orleans and try to eat somewhere new and different ea","useful":0,"cool":0},"5L0SVGuPKtnsAZ65efep1A":{"text":"Y'all....this spot has a place in my heart after this meal!! Check the website to see when","useful":0,"cool":0},"7FXwf0rUc5aigQ6VquvkuA":{"text":"Great food best Gumbo I had in  New Orleans. Music is awesome..Made reservations and I was","useful":0,"cool":0},"vyw7oGSWhPoe0s4BF0-0ig":{"text":"Great band!  The former location of Margaritaville...very nice. The band is a must hear.","useful":0,"cool":0},"PzECXNlWUdBrRsHLfX5Tgg":{"text":"5 STARS for this sweet joint... ask for Hollywood- he is a gentleman server like no other,","useful":0,"cool":0},"F05xF8DBX4KVWMaAJb5Vrg":{"text":"Was not expecting much as this is a franchise of a national chain, but stopped in because ","useful":0,"cool":0},"xkzPzkRGeqJsYE6zFzVCPw":{"text":"We had a fantastic time at this establishment! A really nice spot with fantastic food exce","useful":0,"cool":0},"VAAFS8BXftNHpjOm2MvQYA":{"text":"Outstanding service from Hollywood today! The food is above average but not amazing compar","useful":0,"cool":0},"2Xcg8jyDGI0qOkse32YKxA":{"text":"I came on a Sunday night at 7:30, just in time for the live music to begin. The band was s","useful":2,"cool":2},"wamE9-1yBtyAq-899XccTw":{"text":"I came here on a Monday night while visiting NOLA! It was a blast! Live music, great bands","useful":0,"cool":0},"sPuikB582tvkyhw4D90-gA":{"text":"Great ribs, great live music, great atmosphere, good drinks, and bad service. This is the ","useful":0,"cool":0},"yIQ3ZiCwV0lPL7fF_gwhuw":{"text":"Lets start with the positives. \n\n1. The band was fantastic. \n2. The sound was well balance","useful":2,"cool":0},"qYFZeYOaPxDncKY2XnO3Kw":{"text":"I come to New Orleans monthly and always bring guests. I've always made B.B. King's part o","useful":0,"cool":0},"8c_MjniDuVXPWipfT3h4sw":{"text":"What a time we had on Father's Day! I'm not a father but had a blast bringing my husband h","useful":0,"cool":0},"XunJ06jDYazGTZ2NGEpr4w":{"text":"Came here for a bachelorette party dinner and everything was amazing. The food and music w","useful":0,"cool":0},"AarAD_gVERX849UdhTi1rQ":{"text":"Really good food, great music. Would definitely go back. Exceptional server. Had the ribs ","useful":0,"cool":0},"RY4dj0k02WGJIA3gMvAdyw":{"text":"Stopped by on our last day in New Orleans and had an awesome time. Hollywood served us and","useful":0,"cool":0},"Y_33lYs_r0GWwbSCcAfjNQ":{"text":"We had the best time at BB King's while we were hear. We loved it so much that two years l","useful":0,"cool":0},"kmvGQfaV1VRydOdrdvCPiA":{"text":"Made reservations 6 weeks in advance\nFor a family get together.  Showed up to find out tha","useful":1,"cool":1},"XTETJ2HvlLGQpQ6_PZxnLA":{"text":"I had dined at B.B. King's Blues Club in Memphis and had a great time so I was more than e","useful":1,"cool":1},"4e5EC8hq2lvmrbYEWwQPuw":{"text":"Food was amazing! The catfish poboy, I dare say it  is the best in town with flaky fish an","useful":0,"cool":0},"AVHOWp86IEhn9m6ijoE4uA":{"text":"AMAZING. music is great. service is great. food is phenomenal. would definitely recommend ","useful":0,"cool":0},"g9rehAKJSw1Q0G4hIHyYHQ":{"text":"Happened to come upon this place with my family after walking around and we are so glad we","useful":0,"cool":0},"huDxpGqLNTyNQs0aems04Q":{"text":"Only bbq place we found and the wings were so good. If you like collard greens try these! ","useful":0,"cool":0},"lrAfhVsTSMfDoNwaJbDiBA":{"text":"This location was okay...Food was a little cold and not prepared the way we requested. I p","useful":0,"cool":0},"UtBDhJ0fzjd--28OWOSfmQ":{"text":"Some good blues in the heart of the Quarter with open air feel.  They have out and about l","useful":0,"cool":0},"lNH3U9d7JyS89gS3g-c3lw":{"text":"Came in for happy hour, great drink prices. Ordered the cheeseburgers sliders and they wer","useful":0,"cool":0},"NB1epTu2ZG_WvXCgkOX5Rg":{"text":"Went for dinner, made rsv a month ahead, arrived on time, got a table for 4 on the upper l","useful":1,"cool":0},"ZhTrUccu80_5LEoTCfEckQ":{"text":"After another fun day in New Orleans we had made some plans for dinner and some music at B","useful":0,"cool":0},"OMQMASvpxo2FoMcw88Xg-Q":{"text":"I don't know how they messed up shrimp and grits, but they did. The grits were dry and clu","useful":0,"cool":0},"Q8ubLrLkmPC4UcRVkt2Yqg":{"text":"Last night, my family and I decided to have a quick birthday dinner here. The service was ","useful":1,"cool":1},"cwz-0SU4ugF1yTXn--Nguw":{"text":"Great staff(handled our party of 6 without a problem) the food and drinks were on point (f","useful":1,"cool":1},"RsN3pUpi8bn3CSFXFeMpFA":{"text":"I recently visited BB King's with a group of 60+ and it was a solid experience. \n\nI come f","useful":1,"cool":0},"CmxdrbaQS5wyKpX4tT_AVQ":{"text":"This was definitely a good choice if your in the French Quarter. I was thrown off by the $","useful":1,"cool":2},"zJy7hmJopFUNY1650QWxhg":{"text":"Absolutely loved this place. Atmosphere was great, my favorite place in New Orleans! Wonde","useful":0,"cool":0},"CGuvCiXFaF4RHAFfi7yKFA":{"text":"Delicious. Wonderful location. Great service. Band was awesome! Drinks great! We will retu","useful":0,"cool":0},"RLCxpxgmWwcVc_RwwuKs8Q":{"text":"Table reservations is a huge plus, sat right next to stage! Beautiful music great servers ","useful":2,"cool":0},"KF7SDMDLDlVSRVwHx2zqHg":{"text":"Worst experience in New Orleans this week. Service was extremely bad. Charge you $3 for en","useful":0,"cool":0},"I-48FZPc-YSpPhVcnaIKpw":{"text":"New favorite Nola spot! The live music was amazing and had an over all authentic feel. We ","useful":0,"cool":0},"-IgoE9zux8sfHfVq_TS7HA":{"text":"Very disappointed... :( Jambalaya came out cold, Ribs, came out cold, Shrimp and grits cam","useful":0,"cool":0},"GIF7r24ElrIJpff8RhdpmQ":{"text":"A must go for those visiting New Orleans! The atmosphere here was perfect, I had gone late","useful":1,"cool":1},"qz84rQjUSaP2XrnqD0vC0w":{"text":"Started off shaky but ended up being one of the best services while visiting New Orleans! ","useful":0,"cool":1},"ewAEWLmSV5TvXUIlXS9Ztw":{"text":"We were charged a $5 per person walking in the door for the band we had not even heard. Re","useful":0,"cool":0},"Afoh5TGo90qo6AU-4pMspw":{"text":"We found this place while walking through the French market. it said live jazz music. fant","useful":0,"cool":0},"mARdIBBbcIhVwo5ncwDYUA":{"text":"We popped in here hoping for a good New Orleans meal. The atmosphere was as expected kinda","useful":0,"cool":0},"-vRhHsRiIClbkDp7xe53pg":{"text":"Went to BB King which used to be Margaritaville. Our waiter was amazing the blues jazz ban","useful":0,"cool":0},"FkZ_FeXQb262_x59UNYLFg":{"text":"This place is terrible all the way around.  The food is average at best.  They have the sa","useful":0,"cool":0},"TW1EeZInFqXew8ll_Tuu9g":{"text":"I came for some drinks and music. The atmosphere was great, drinks were on point and the b","useful":0,"cool":0},"1dUZBcHTXn1tDAAVARNDHQ":{"text":"Hollywood was amazing super sweet and very considerate. The bands are always diverse and t","useful":0,"cool":0},"bGRiHEnGW9djPo0fzM9U9A":{"text":"BB King's Blues Club is the perfect spot if you're in the mood for live music and great fo","useful":12,"cool":8},"s-WTCN25UzjFuKZL8WcwJQ":{"text":"MUST GO! For any tourist, family, couple, etc. Great atmosphere, great food, great service","useful":0,"cool":0},"EVca6LDaBCaOnhrVX80IqA":{"text":"The combination of great food and great music was the best!! The B B King all star band is","useful":0,"cool":0},"dnbxplnDHP4O7YPOMo155Q":{"text":"I was looking for a place with live music where I could go with my 17 y/o daughter and I g","useful":0,"cool":0},"UDvACb7EdkNk5EC2LvTDvA":{"text":"5/5 for the music and 5/5 for the food!\n\nI had the roast beef Po boy and the blackened cat","useful":5,"cool":4},"pYl5kHWQpiZm436Jg71KIg":{"text":"I go to BB's to listen to the best band ever because their music is relaxing. After I've h","useful":0,"cool":0},"6Eb8z9peCEo66Dr9bc-3Zg":{"text":"The service was horrible. Took forever to order our food and get it. Being out of BBQ Chic","useful":0,"cool":0},"YGVFYuKxcOKLhsLL6Du0mw":{"text":"Can't asset to the food as we only sat at the bar while one of us had a frozen pina coloda","useful":1,"cool":1},"5DwZG5HfXNn9pF7ymBv2gQ":{"text":"$10.75 beer and bad service! And the band sucks! What a joke! And it smells bad! Yelp want","useful":0,"cool":0},"AmSgqQWsnafKJTHXoN-_6Q":{"text":"My friend and I were walking down the street headed to a reggae club and I heard a woman s","useful":0,"cool":0},"JaCqR2hO_X9lqKH5E8IADw":{"text":"NEVER AGAIN!!!! If you don't read this whole thing, just remember these words- NEVER AGAIN","useful":0,"cool":0},"ZZFebzxEqicZmh2G_Pg4LQ":{"text":"Good food and great atmosphere! 100% worth the $5 entertainment fee/cover charge. We had d","useful":1,"cool":1},"J_Tn1XlsmgkwKJs8rP7USg":{"text":"Arrived at about 9:30pm. Had to wait about 10 mins for a seat when there were several tabl","useful":2,"cool":1},"lZRmUKyiuKlAYiQCT_Catw":{"text":"We happened to stumble out of the rain into this place. Didn't really want to go because i","useful":1,"cool":1},"xR-eI-HiAXkRP95O2Zj7Nw":{"text":"The food isn't that great, side aren't seasoned food is very bland. I ordered the ribs and","useful":0,"cool":0},"ByAEwRpt75XHdLu_6AdSbQ":{"text":"One of the best management teams I have ever worked with Hollywood was one of the most han","useful":1,"cool":1},"-XWgZBmxSLUJg81EPO-njg":{"text":"Great place to wander into and enjoy music spontaneously as we strolled near the french ma","useful":0,"cool":0},"kX7ktJr9wvBE6eFoeCTe8Q":{"text":"Rented the top floor out for an event. The environment was intimate and we loved the outdo","useful":0,"cool":0},"wKD5xYd8BBf2H06X2tzn1Q":{"text":"We came for jazz and some late night drinks and was awarded with an incredible show by the","useful":0,"cool":1},"DqY5aocZitC6I4r0mG5FmA":{"text":"Food was wonderful. Well priced meals. The beer is cold and the music is good. Definitely ","useful":0,"cool":0},"b3FCINZy8V_YpsusB_U9SA":{"text":"Really fun quick lunch today with an awesome Blues set! Our waiter Hollywood was absolutel","useful":0,"cool":0},"7X03-vCtedaWGkkgOAlhzA":{"text":"Great music! I ordered nachos and lemon pepper wings very good! I'll definitely go back ne","useful":1,"cool":1},"LKTwsYLCBPbK4XlVFvFNuw":{"text":"Drinks were super strong( good thing) and super good. Food and music was amazing. I had a ","useful":0,"cool":0},"Q00H1uVkbQfpRfPyymfEAg":{"text":"BB king's was a terrific experience. From start to finish. Small cover charge for good ban","useful":0,"cool":0},"gbdyYZZxk4IKu4W_ta9Fug":{"text":"The food and music is great, however the hostess was extremely rude and couldn't answer an","useful":0,"cool":0},"6auCvzN8JH9AzFqpDXGKkA":{"text":"Everything was on point. Great place Great service. A little loud but what the hell, Must ","useful":0,"cool":0},"RukMPrH7dMwBdCqGasPlXA":{"text":"The music is good. I went on a day when their was French jazz. The only issue I had was 3 ","useful":0,"cool":0},"7eZfwIvAVQgoUcYTRFCD0w":{"text":"Been waiting on wings a d sandwich for over 45 minutes!!! Bartender said it was season the","useful":1,"cool":0},"43mDPbLhMKQkG1UStYDZnQ":{"text":"Music was great. Had a live Jazz band play during most of our lunch. We made a reservation","useful":2,"cool":2},"QFFWiN0zh_kIexCcAMu1WQ":{"text":"Lets start with the positives. \n\n1. The band was fantastic. \n2. The sound was well balance","useful":3,"cool":1},"LrkftG2q9GkEnlhcN6Q3lg":{"text":"I am from Nashville so my expectation for BB Kings music venue was on a different waveleng","useful":1,"cool":1},"DKCwjyMqeA0hPXHw8hXhbA":{"text":"We celebrated my sister-in-law's birthday.  The food was good, but the service we received","useful":0,"cool":0},"-3SHVRMfGN55932Zzbupwg":{"text":"What a lively place! We stopped in for beers and happy hour treats (instead of usual beign","useful":0,"cool":0},"QGWjK1tZ_NIKfcv0drkQVA":{"text":"We stopped in honestly to get out of the humidity for a few moments by cooling down with a","useful":0,"cool":0},"R6TdX8JcMAb_RVXqBSHfgQ":{"text":"Best starter salad I've had in a long time! The music was great, ambience was great, and t","useful":0,"cool":0},"MYQQlwtVyjZXf4IEYIW-sA":{"text":"A place where the foods aight but the music is tight and the service is right. House band ","useful":0,"cool":0},"goeL0tJFcjo1nXz4YFn55g":{"text":"Super cool restaurant we ran across while exploring the city. Love how they have live musi","useful":3,"cool":2},"CnEWnZ58URGhjmSZNIuYQg":{"text":"BB's is a favorite for us to use as a quick drop in when we're hot, thirsty, and need to u","useful":2,"cool":2},"q3vma712UY490qaRj-U3Lg":{"text":"Savanah was a great hostess. Wish she could of been our server. She is a great hostess!","useful":0,"cool":0},"T0kJxBYXYA4p5necK92vkw":{"text":"Good was great. When you make a reservation they don't mention that there is a cover charg","useful":0,"cool":0},"_IzPw3IiZdk2sf0LxI-Gvw":{"text":"We came to BB Kings kind of on a whim. The staff was so gracious and friendly. The friendl","useful":0,"cool":0},"futcaQbiYr8CecADY5XfCA":{"text":"Outstanding Memphis style bbq in NOLA.  Great band playing on a Tuesday afternoon.  Our se","useful":0,"cool":0},"8E6F6038ZIVrcvnJ08uA8g":{"text":"Had the best drinks and food(deviled eggs boudin balls Mac and cheese bloody Mary's)!! Ask","useful":0,"cool":0},"ZvYKcrIx-TBkmVKrzihGQg":{"text":"Sweet tea! Atmosphere...location. Music. All great. Wasn't impressed with the food, but I ","useful":0,"cool":0},"wGOid6uDZF8xJJlvyveDfg":{"text":"This is one of my favorite places to go, especially when it comes to bringing out of town ","useful":2,"cool":1},"6Y3u-VVeDrrUAVeUkUumLg":{"text":"I located this restaurant on opentable.com. I was excited to use one of my $20 gift certif","useful":3,"cool":3},"iuVkWx74_cXztDuTBv9s3g":{"text":"Checked this place out on our last day in NOLA. The atmosphere was so cool. There was a li","useful":1,"cool":1},"mCFNrF0A9cejHSO_1KU8hw":{"text":"We meandered down to B.B. King's Club for Sunday Funday expecting a typical experience at ","useful":2,"cool":1},"3XUrAKDMEzKNAUmEQo0ZwQ":{"text":"BB Kings in New Orleans is a French market area tourist trap. The staff are very nice, but","useful":1,"cool":0},"F7X11V9npxCJ3c4-EGrY8g":{"text":"This is the second night we come here.  Music is great, service is great, food is great. W","useful":0,"cool":0},"DgwpoeQrX0K3dKmyJrqTgg":{"text":"First restaurant we went to in French Quarter. Live music was fantastic, I honestly think ","useful":1,"cool":1},"0qBC3mOvjOxdWFtlA4kXAg":{"text":"So to start it off the location of the restaurant is right beside the French Market which ","useful":0,"cool":0},"FbLRgkYz4PWt2hDmXeQ24w":{"text":"If you are going to tack on \"something like a cover charge\" at least be up front about it ","useful":0,"cool":0},"IiJvrVh866DWKKkboCvOsw":{"text":"Looking for a place to eat lunch while visiting the French Quarter. It was my mom's first ","useful":1,"cool":0},"e_xX54_O-czyXO-79LCU6w":{"text":"Came on the last day of French Quarter Fest. Had a great meal and enjoyed the drinks serve","useful":0,"cool":0},"deBlIDPXZ5Sys_ljY5GghA":{"text":"I've been here twice and have enjoyed myself both times. Once at the bar and once at a tab","useful":1,"cool":2},"6l_exQ_zCpiSUAsGJRTM4Q":{"text":"Great live music! Good happy hour specials. Had seafood gumbo delicious. Tator tots, a bar","useful":2,"cool":1},"dWQQm_ihYK6yYUx_XXpVBw":{"text":"Made a reservation on Open Table. When we arrived and told the hostess we had a reservatio","useful":4,"cool":0},"CtksMhIC474A2_8FL65Cgg":{"text":"The music is everything!! The BB King Allstar band was absolutely incredible tonight. Ever","useful":1,"cool":3},"uWqJ-kHcW_dXfafNxCYhAg":{"text":"We stopped for lunch and ordered our drinks.\nAfter we were served our drinks (a Coke and a","useful":2,"cool":1},"yPOQBx4qYexZrG5yScskGQ":{"text":"My Food Was Delicious, Nice selection & prices, The Service & Atmosphere Was Great and The","useful":1,"cool":0},"lhvQKii8XQ1XLN1lkXcHEw":{"text":"This place was AWESOME! The band was stellar, dance floor stayed full, vibe was HIGH! BEST","useful":1,"cool":1},"45xAUVaTALLw1PDGl-77wg":{"text":"Anthony \"the door man\" brought us inside to enjoy some great music, friendly service and d","useful":2,"cool":1},"zzhCyjptLTRxlWgepCA66A":{"text":"Party of 7 (4 adults, three kids). Seated immediately. Took a few minutes before waitress ","useful":1,"cool":0},"ydS4DyQm0QPZRcjAewktVQ":{"text":"Great way to end our time in NOLA! Good tots, awesome bevvies (try the Leadbelly Lemon!) a","useful":0,"cool":0},"B8RNJZ4cqh1aRQ9wRMCufQ":{"text":"Hollywood was an amazing server!  Food was great!The drinks were cold!!  I highly recommen","useful":0,"cool":0},"UW7GLA3sbE70fs4WDV4y2g":{"text":"So I was in town about a month ago. I heard from a friend who had visited BB King's and he","useful":0,"cool":0},"leEHkQwsWrq2-Zbpk7UlFA":{"text":"The food was delicious and humongous portion sizes!! The wait staff was nice and friendly.","useful":1,"cool":1},"LAcDrZSnBie4lstt2h4tSg":{"text":"Hollywood and Mama Jack made our visit very enjoyable, Mama Jack seated us quickly and Hol","useful":0,"cool":0},"tmwL-La-stulsOzq2C_zCQ":{"text":"Had high hopes for this place since \"BB King\" is in the name. He's one of the most well kn","useful":2,"cool":2},"nLCoganeIKKcgo5a_Vf8pg":{"text":"Had great lunch. Big portions. Cheap drinks. Meals kinda pricey. Live music the entire tim","useful":0,"cool":0},"1nM2SWwY90WcvaxVlbxRkg":{"text":"My night was awesome. I came with my wife and we were not on the best of terms. The music ","useful":0,"cool":0},"EvS3NoUE-qHbFGl6dGhIIw":{"text":"Best restaurant I've been too in a while! I think the manager was named Hollywood. He's do","useful":0,"cool":0},"PwQzqqz9UAb2N-oqs8kv_w":{"text":"If you want to hear excellent music and get the party going go to BB Kings! The BB King's ","useful":0,"cool":0},"tebnroF5buoM-maHhw-8ow":{"text":"Stopped here while walking around the town with my family and I'm so glad I did!! The live","useful":0,"cool":0},"NIEmtmuCa7ShdouKkeNO7g":{"text":"After our long last day in New Orleans we finally found a great beef burger and french fri","useful":0,"cool":0},"skv08nscmdCDnVKSLjVVMA":{"text":"Enjoyed BB King's Blues Club! Great music and service, our waiter was Hollywood and he did","useful":0,"cool":0},"pAJuCQkVlvhJJv1oORfEpA":{"text":"Note: $15 per person when you walk in the door to cover the band but then the band also re","useful":1,"cool":1},"jm3xI2VtRcxhg7XElh9JyQ":{"text":"The food is absolutely PHENOMENAL!!! However, ( a party of 8 on our bachelorette) we arriv","useful":0,"cool":0},"iAci-DkokZ5UaNFpvRAcsw":{"text":"Hollywood is the best!!!!!  Thank you for taking such good care of us!!!!  Great music!!!!","useful":0,"cool":0},"cChad5_T3md4oCpBZA7kbQ":{"text":"We've been in louisiana for a week now and this is the best food we've had so far. Such a ","useful":0,"cool":0},"YQjh8FLiux8GnD9M_87AwQ":{"text":"We had a fantastic lunch today here. They were very welcoming from the minute we walked in","useful":0,"cool":0},"iN9CalO98h9oUuSd_X8AQA":{"text":"So I was in town about a month ago. I heard from a friend who had visited BB King's and he","useful":0,"cool":0},"lBZYNNsUV6SwjR_0ZwV4Xg":{"text":"We love it here! Hollywood is a manager now. No surprise there. He's amazing. He came by t","useful":0,"cool":0},"WD8Bimih6dU86JMwxmFq1w":{"text":"We heard the music flowing out into the street as we were leaving the French market and de","useful":3,"cool":1},"MswahQ_lksKUSYzmU6qGFA":{"text":"Devin was our server and did a great job. He was funny and served our food promptly with a","useful":0,"cool":0},"XLmWgeGkaG41RlqCY4fSRw":{"text":"I was looking for some cheap food in the French Quarter. I found here. I checked the menu.","useful":0,"cool":0},"s8yHntfo42edB-Hr7txT-Q":{"text":"A friend recommended this place. Food was good, drinks were good. The star of our visit wa","useful":0,"cool":0},"4pX9X949LSUeMUcQWw1PMw":{"text":"Poor service,  took over an hour to get our food.  Manager wasn't very concerned. Would no","useful":1,"cool":0},"-QJBMAMrn5QOJvXxoY9JfQ":{"text":"Music was great, the atmosphere matched the music and the smell of BBQ. Glad, we came here","useful":1,"cool":1},"DfbOQEiE5RDwYfQtsQBFJA":{"text":"BB King's Blues Club, a unique atmosphere with an authentic New Orleans twist. The friendl","useful":0,"cool":0},"hMlYpmYmmi8h_tmoxHDCbg":{"text":"This food was AMAZING as well as our waiter Hollywood He was super friendly and so funny. ","useful":0,"cool":0},"O-vOoMsW7rVWCFRfSznmGw":{"text":"Yelp needs to update the hours--spent $18 on an Uber ride there tonight only to arrive at ","useful":2,"cool":0},"cmvz5E5vmctxQNqyVmBhtQ":{"text":"If you're looking for great live music, delicious food and tasty drinks, this is the place","useful":95,"cool":82},"jk2LQm1fmjqL5wUNQasG8g":{"text":"fuck bb kings new orleans and their disrespectful bar staff!!\ni politely asked a bartender","useful":2,"cool":0},"1yMIfLfE-yF3vrkq4xYXrw":{"text":"Tourist trap.  But hey no shit.  They do have live Music that ain't bad.  Food aint that g","useful":1,"cool":0},"fZOTvsNciLN5MG3qMl9p2w":{"text":"Food was great and live band was nice. They charge a $5 cover but it was worth it. The tat","useful":0,"cool":0},"c0-qQorEe2GazNKWA9BVgA":{"text":"Great music, good customer service but food was so-so. We ordered some drinks and boudin b","useful":0,"cool":0},"V-vdOGGBN4nwYz5KigjR7g":{"text":"This has been a long time favorite of ours for years.  We have had amazing experiences eve","useful":0,"cool":0}}