{"bNyb8LNw-i9sd81dHBfVHw":{"text":"This is a perfectly decent Subway, and a lifesaver if you are flying out of the New Orlean","useful":0,"cool":0},"uw2-2BKcGUlEPjkpcqBoRg":{"text":"Like many of the reviews at this location, I'm here to say this really is the worst subway","useful":0,"cool":0},"QgnOitID7z1zIPSQkY37BQ":{"text":"TERRIBLE customer service. The rude worker mumbles under her breath about me & when I aske","useful":1,"cool":0},"u-XwQwXHP34YK12M0sd3rQ":{"text":"Don't get the tuna sandwich. It was the only thing I ate today and I got food poisoning tw","useful":0,"cool":0},"ECl72m8VmZK0IbynRduzFg":{"text":"Worst service you can possibly get. Out of everything all of the time and employees are te","useful":0,"cool":0},"fzRlPft7rC82iAloc9UptQ":{"text":"Arrived at this location at 8:35, and was VERY rudely told that they were closed. Door was","useful":0,"cool":0},"lWCGEPrTcDVSSstHk_5RXw":{"text":"Stopped in for a sandwich this evening and after noticing no one was there,  I thought I w","useful":2,"cool":0},"aHOepQw0ahWfVwA3qTS4ow":{"text":"I'm appalled. I give this 2 stars. I appeared this venue at 7:20 and they not open. Warnin","useful":0,"cool":0},"dfksZXQEN5fzZNDYrGHycQ":{"text":"Angry subs made by angry people. This really was my impression when I ordered my sandwhich","useful":1,"cool":0},"RKajtWB2GLToyW-bXNQoWQ":{"text":"I have given this place to many opportunities to prove they are better than what they act.","useful":0,"cool":0},"0V8Ph5gD8IOs8dtIvkfOqA":{"text":"Worst service \nEvery time, anytime.\nGot to be the worst  Subway ever open in all of the wo","useful":0,"cool":0},"9854Drv-ruiuB7soB_VkGg":{"text":"I can't complain about the food, it taste like a regular subway sandwich, however I can co","useful":0,"cool":0},"Pa2QD_ldP3GZTZ8X-lAowA":{"text":"This location is very close to home, but even so, I chose not to go to this one. I haven't","useful":1,"cool":0},"V67ifFZHlThI_Eplmz-0Ig":{"text":"Horrible customer service. Counter girl was very rude and inconsiderate. I left the store ","useful":0,"cool":0},"sd1sZkfHCDunLPGiCsrFrA":{"text":"This is my neighborhood Subway and I have no complaints.  I've always found the service to","useful":5,"cool":5},"cQrzjFnu9xQsOWCqLXiB_w":{"text":"Worst subway ever! Completely ignored two people in line and all employees except for one ","useful":0,"cool":0},"L49HF7Pwlf9NgLTQ9Bht0w":{"text":"Wish I could put no stars, I asked for lettuce, she puts half of what the other subways do","useful":0,"cool":0},"WZMkSdA3_lxcooeuKxUS_A":{"text":"Just left this subway and it was the most enjoyable interaction ive had at any subway. The","useful":0,"cool":0},"nuqr8W1TqqJGrQllVrwhrQ":{"text":"This is the WORST subway I can't even believe this one is still in business. They hire the","useful":3,"cool":0},"4mteVxqKFVbTTCSDV9RVXg":{"text":"I don't usually eat at subways because they don't have many veg options, and I prefer loca","useful":2,"cool":2}}