{"571u2fOdqVQY1-ziKeNyUw":{"text":"We came here for late lunch Saturday, so got to pick three small plates from the menu. The","useful":0,"cool":0},"bcXOuYn3xO9SjcujZIwP_w":{"text":"Food was well-prepared but not terribly exciting. Service was attentive, but unnecessarily","useful":3,"cool":0},"b7Sx7dTkox8XEhBODZBEsA":{"text":"My experience here was so New Orleans, Ben Kingsley to my right a woman dressed in crocs t","useful":3,"cool":1},"aE9_4tJiJIjqXwPvjcB7Dw":{"text":"Food is amazing. Though we are from Texas, my husband ordered the brisket.  Delicious.  My","useful":0,"cool":0},"XJudL97_6Wz5Iwb9LU5rpQ":{"text":"Me | Bf\nApp: Scallops | Veal Sweetbreads\nEntree: Duck crepe | Rabbit roulade\nDessert: 10 y","useful":1,"cool":0},"XcnWiCmu6PeITT-AWvheOA":{"text":"A truly disappointing dining experience. Admittedly we were spoiled last night at Restaura","useful":5,"cool":0},"fmIORTpNBRZytGJfkHjaBQ":{"text":"This place was amazing! Ask to sit outside in their quaint little courtyard! Prepare to be","useful":0,"cool":0},"A0raf-1ZaxhI0EPQ1l-D_g":{"text":"Great food!\nI had the sweetbread app with caper sauce and they were divine.\nThe duck breas","useful":1,"cool":0},"AKNdB_UPpJlXiZoTdpsZpg":{"text":"I had eaten here many years ago with my husband but recently stopped by for lunch with my ","useful":1,"cool":3},"NefOL_HD1G6CGvznoOnMeQ":{"text":"A bit of an old boys club, Bayona is a charming place to dine in the quarter. The food is ","useful":0,"cool":0},"t3a1TbFbyMhVZ4AEaCsGoA":{"text":"Fabulous , expensive  but worth every dime . My only regret was we didn't have a chance to","useful":0,"cool":0},"eomreeN_Ykl2jOhUH9IO_Q":{"text":"Don't understand the hype on this place - other than the patio has really nice ambiance. T","useful":0,"cool":1},"-disj9UDQWh8ca6kN9swNQ":{"text":"Amazing food and great service.  Enjoyed a drink in the fabulous courtyard before eating. ","useful":0,"cool":2},"b1_rvzAiBd4qW7Q0iQWgyg":{"text":"I've been there for the second time. Starters (grilled shrimps) and the main course (red f","useful":0,"cool":0},"oZ-Bt8aaZETpDQVlGbg8FA":{"text":"We celebrated our 5th wedding anniversary here last night. It was amazing! \nGreat service.","useful":0,"cool":0},"5SKHZXgcD-vWq39uYXdXHQ":{"text":"Technically, my rating is 4.5 stars, but Yelp doesn't let you give halves. \n\nSometimes it'","useful":0,"cool":0},"BspjUPkdIzZcCji15ODG-w":{"text":"Lovely outdoor patio in a charming courtyard would have delighted our group were it not th","useful":0,"cool":0},"c_GSHw5RhQMaKy-a79E4hw":{"text":"The living room waiting area and courtyard are just beautiful. We also really enjoyed the ","useful":0,"cool":0},"XHuMZSMVo1jazYJ4RrW2LQ":{"text":"I'd wanted to come to Bayona for years, and actually have come along for lunch (which I do","useful":0,"cool":0},"-x8vM9exfBljyCCrVGj6Tg":{"text":"We found our way through the doors of Bayona on our first night in New Orleans. We had no ","useful":1,"cool":1},"hjrGX6-PgEuPPmEk2P85bA":{"text":"I've been mulling my Bayona dining experience over in my head for the past few days, and t","useful":0,"cool":0},"wrnpv9fcH4sPbMtWvACI6g":{"text":"Overfed, native New Orleans businessmen tend to predominate the crowd and extra-rich pan-L","useful":3,"cool":1},"Pq_EecbCuoTsEJWUMDFxrg":{"text":"Finally, something to cheer sbout in the Big Easy. Great service, great imaginative, daily","useful":0,"cool":0},"dDnRN9l9vh-0zNisdJhKqQ":{"text":"I went here with a group of girlfriends while visiting New Orleans, and we were blown away","useful":0,"cool":0},"m4Ancnel67PjQQioXojcBQ":{"text":"Got there 20 minutes early and the hostess was not too friendly. We ordered eggplant cavia","useful":4,"cool":0},"KPIVNWRl9kX6ZMAXzuTOag":{"text":"Brand new Hostess and busboy very nice. Waiter was not friendly or attentive.  Waited 1.5 ","useful":0,"cool":0},"UewcQSQFIvLW2vIqps8F_g":{"text":"Susan Spicer's restaurant is in my top 3 in my hometown of New Orleans.   Exquisite cuisin","useful":3,"cool":2},"B0_9E3VLSx58NSzlzwrx1g":{"text":"Here are some things you should order at Bayona, in the event that they are on the menu:\n\n","useful":3,"cool":3},"RLPT_gEreSRdG7CWSqVb7Q":{"text":"My coworkers and I went to Bayona for dinner last night as they have been raving how it is","useful":0,"cool":0},"ua737fuHmktociokzmiWYw":{"text":"A very good lunch. \n\nWe started with the shrimp and black bean cake. I wasn't too fond of ","useful":0,"cool":0},"QjCUE4mu5zySp400ogfnLg":{"text":"Bayona is as good as it gets for truly delicious and creative meals.  Just make sure you g","useful":0,"cool":0},"ADqQYfxGtgl-CQ4oBdtK7g":{"text":"As a traveling winemaker and brand ambassador, I get to eat at the best restaurants betwee","useful":2,"cool":0},"XAwukAywPkWoQ4VoXjRYqw":{"text":"Unexpectedly one of the best steaks i've ever had.  Other dishes varied from very good to ","useful":0,"cool":0},"joSZy1-JpoQxQBjk2jmQOw":{"text":"Susan Spicer's Bayona is tucked away in a quiet part of the French Quarter and looks very ","useful":3,"cool":1},"d_BrGDT47yeUvXnldwWQEQ":{"text":"Heard many good things about this restaurant, which opened in 1990, and the chef/owner Sus","useful":0,"cool":0},"zNxqRA5gBQhaRjcbmSnNKA":{"text":"Susan Spicer needs Gordon Ramsey!!!  Scallops were grisly & only one out of the 4 had sauc","useful":0,"cool":2},"U0VMtjaDRDN7brtLgBI0Ew":{"text":"the smoked duck sandwich with cashew butter and pepper jelly here is one of the better thi","useful":0,"cool":0},"210UDYdat3z-6sq780IDCA":{"text":"overall a very good experience dining here.  the service was good, but dishes took a very ","useful":0,"cool":0},"rlvA1wpmy04uvOLCLrQvqA":{"text":"Super disappointing. We came here for our anniversary dinner, which happens to be on New Y","useful":0,"cool":0},"lh1AZobp4TgWaV09rZLTOA":{"text":"One of the best restaurants in town. The foods complexity, taste layers and combinations w","useful":0,"cool":0},"oG2Qzm1Tpf_dB8Wbr5QwnQ":{"text":"Ate here about a month ago on my girlfriend's birthday.  I privately asked the waitress if","useful":0,"cool":0},"H-qLJDJIwgJoUBbezIlPbQ":{"text":"It took us six years to get a table here - we should have waited longer. We tried to just ","useful":4,"cool":0},"NVF7I0BwIyOlX_L0cQwteQ":{"text":"We went there in sept with work people. Everything was awesome. \nI ordered the lamb and it","useful":0,"cool":0},"Papl7MxfissWLNWtthpYwA":{"text":"Best meal I've ever had in New Orleans, hands down.\n\nWe came from Chicago to New Orleans t","useful":3,"cool":2},"x3SH74eZ9X7b6vBoC6WKlQ":{"text":"The Pros: The outside of Bayona is adorable. You feel like you're sneaking into a secret, ","useful":1,"cool":1},"dVh8KYwCk5ba43b_eLA_Rg":{"text":"Last night our travelling troupe of foodies hit Susan Spicer's Bayona.  Hands-down it was ","useful":0,"cool":1},"jf6t35d8_Y64mHpxN46ovw":{"text":"Something rustled in the leaves by our table on a night outside in the courtyard.  It was ","useful":1,"cool":1},"4YfQcBB5-ysO8CL3wt928A":{"text":"Could've been great. Delicious food, paired with inattentive and condescending waitstaff m","useful":3,"cool":0},"Iaz9jDcCQbbLo_B_RJ_B7w":{"text":"Went there for dinner with friends and sorry we did. Service was horrible! Servers didn't ","useful":0,"cool":0},"d_vZAvg5DblPvlxsUPoPoA":{"text":"Chef does this amazing 3-course \"light lunch\" on Saturday for $25 prix fix. The incredible","useful":0,"cool":0},"Wc9YLenqC0PJ08aNAbEkSA":{"text":"The food is delicious here.  I am deducting one star for the clustered upstairs attic I wa","useful":0,"cool":0},"ZuAq5p3lIKtoTfUconUFTg":{"text":"Lots of pork, pork shrapnel, and pork drippins:  Bayona will make you fat, and you will en","useful":0,"cool":0},"sZKpWf2r1PEBEG-ASsJ1ZA":{"text":"The food was terrific but portions were very small. I had the bbq shrimp with grits and co","useful":1,"cool":0},"wPMhOUXYKxPYP659GXVpqA":{"text":"We are foodies, there is no doubt about it and after living in New Orleans for just over t","useful":0,"cool":0},"RF1NF2k7nQKHLTYuDn8sAg":{"text":"Excellent from the door to the dessert!! This is definitely my favorite restaurant in New ","useful":1,"cool":1},"AYSB3iokJhi-1ynZq63U8w":{"text":"Bayona has never really been to my taste and a recent visit confirmed what I have long tho","useful":1,"cool":0},"PQ2n2PS-IlcQASSqzL4qkw":{"text":"In the French Quarter, many restaurants practically scream for your attention. This is, af","useful":1,"cool":1},"Wb9bhejzGiKVxqeLsgvcnA":{"text":"Holy wow!\n\nIt took me forever, but I finally made it to Bayona!  So worth the wait and I a","useful":0,"cool":0},"SyGF-pkebLIBg46IX0kvXg":{"text":"I have been blessed enough to eat in some of the most wonderful restaurants.  And, while t","useful":0,"cool":0},"WSDijSvQO6Decf0SSVC6UQ":{"text":"One of the best meals I've had. We did the Saturday brunch which has certain items to sele","useful":0,"cool":0},"CERjQkRFIWu61dAVNFiS6g":{"text":"In 2002, Bayona was listed among the top 50 restaurants in the world, so we went with high","useful":0,"cool":0},"pb1NSUfhNLb8QV51YvCa7Q":{"text":"I finally ate at Bayona's a few months ago. I had heard about it and its famous chef, Susa","useful":1,"cool":1},"HZL4DoX84VVcLhsZdCn0Fw":{"text":"We came to Bayona for our anniversary and it was a great choice. The staff was friendly, e","useful":0,"cool":0},"bcGwz208ybAEczduCdswVQ":{"text":"Just ok. Don't listen to the hype on Yelp and then maybe you'll really enjoy the meal. The","useful":1,"cool":0},"o-2_vt85NZH0xIkAg_XMEA":{"text":"Everything was amazing!  We were with a small group.  Had the duck livers, sweetbreads, cr","useful":1,"cool":0},"P0QqDQAVF_qcWLsaYONkAA":{"text":"Everything was delicious here. From the specialty cocktails to the amazing desserts. I had","useful":0,"cool":0},"QtvVw0rd_I8le93Frn8k-g":{"text":"Excellent again. Garlic soup is wonderful, the roasted garlic adding a touch of smoky swee","useful":1,"cool":0},"ACJMf7mX-JB1DLrrJ1i0gQ":{"text":"One of the best meals ever.  We had a party of six and every dish that was ordered was inc","useful":0,"cool":0},"93ZW2ve2jTDXZkdLzor9Vg":{"text":"Dinner was so good we tried lunch the following day and were not disappointed.  It is one ","useful":1,"cool":0},"vL2XhH5KWVY9ZV6SCjmwCQ":{"text":"It had been almost 10 years since I went to Bayona.  I just don't get to the FQ fancy rest","useful":3,"cool":1},"4NAL4zik37t-eZoj3sKSpQ":{"text":"So far awful service.  Unfriendly  non smiling had to ask 3 times for bread.  30 minutes b","useful":0,"cool":0},"sACTFCAG-8iLy3AqNSYQzg":{"text":"Superb food as you would expect from Susan Spicer.  The  3 or 4 ? course lunch deal with c","useful":0,"cool":0},"ePJQsJaPtjpu9wm0byAYXQ":{"text":"I am not giving Bayona 1 star because the food was bad.  It was good.  \n\nI am not giving B","useful":10,"cool":2},"-SMG-cifnEPpiLm97rH9AQ":{"text":"Go here. Don't just eat but meander through the adventure of dining at Bayona. The place i","useful":0,"cool":0},"WZbWoUBtQg-Oj3SmBcCi2w":{"text":"Disappointing...the fast food equivalent of New Orleans cuisine. Quite honestly, you'll pr","useful":1,"cool":1},"aO4QkYVSr9A8M5bm4hRHRA":{"text":"I had never been to this place when my boyfriend took me to celebrate my birthday.\n\nFirst ","useful":6,"cool":3},"N3W85GYZD4X6a9tmAf3xUw":{"text":"Bayona is easily one of my favorite restaurants in New Orleans. \nI came on a Monday night ","useful":4,"cool":2},"rLbQGvut9DXUyyIhvtfL9A":{"text":"This was my second time here and I was yet again, not disappointed! The reason for dining ","useful":2,"cool":1},"ZMPkqpIcfsySsyibLG4Q9g":{"text":"No doubt Susan Spicer's flagship restaurant makes some of the most innovative food in this","useful":6,"cool":4},"-CBwpdkRUK4pIxld_QRwoQ":{"text":"Good food; I hesitate to say great though.  Pork chops were slightly tough and chewy, seas","useful":2,"cool":0},"0WxijRFZcVqlTr5ejI2IiA":{"text":"If I could assign a 4.5* I would. So close to a 5. Food and service were impeccable. It wa","useful":0,"cool":0},"W8O9heP5tJ53ybjbrpHdrQ":{"text":"Hubby and I Treated ourselves to dinner at Bayona during the 2012 Jazzfest.  Lovely settin","useful":0,"cool":0},"cd1LR7k3p38xdByzS_UM3w":{"text":"Exceptional outdoor sitting area. I thought the service was very good and the food was wor","useful":1,"cool":0},"ccfaWb-7Fucc3AI4y-rmpA":{"text":"We had a terrific meal. The welcome through the goodbye, the staff was terrific.  Some wou","useful":1,"cool":0},"IG9jzyzNTgHkKdQElyuEUA":{"text":"During our most recent trip to the Big Easy we booked a reservation here and were greatly ","useful":2,"cool":1},"_mOF4XwpRhQjMhuK6jBsZQ":{"text":"This was a difficult review, the ambiance and service was great. Unfortunately, the food w","useful":0,"cool":0},"9zCc6pHlL0h8q0bOGDElJw":{"text":"Weekday lunch review\n\nWe had been beefing up on episodes of Treme during our NOLA trip and","useful":0,"cool":0},"T4r3YBlonCYLO7lShRTBmA":{"text":"Excellent dinner with a large group of people. The waiter was fantastic and very friendly.","useful":0,"cool":0},"vVd6Yj-Y7Zq5Ko3g6jXUdQ":{"text":"Great, creative food with a touch of NOLA","useful":0,"cool":0},"CJ9t_eEmJ8HeJqFpJM8UpA":{"text":"Ever since I went on my first cruise, I found the experience so delightful, so fulfilling,","useful":13,"cool":12},"xygGySnOejwW724LZX3Wpw":{"text":"SATURDAY LUNCH special: 3 courses for $25 was an amazing way to get to know one of NOLA's ","useful":1,"cool":0},"n_HEYPSUlyF1755cikcX-g":{"text":"The rabbit entree and the sweetbreads appetizer are some of my all-time NO favorites.","useful":0,"cool":0},"dwZWXUsBSmvee4qILb1UJg":{"text":"This meal was like a roller coaster.  A roller coaster ride where the meal started at the ","useful":2,"cool":3},"czsIf0IK7AI1eZvufNcxFA":{"text":"This is my second time dining at Bayona and while the last time it was a second contender ","useful":0,"cool":0},"xxf8Ydic5_PT2h71B_dnWw":{"text":"This is by far the best rabbit ive had in the world. They also had a very nice brandy sele","useful":0,"cool":0},"CyjuQQamTWBCum7RmtBnjg":{"text":"We went there for dinner, both the foods and service were phenomenal. We had a wonderful t","useful":0,"cool":0},"vnAn2ORkjk-fv31ozYI2KA":{"text":"The food here was amazing.  Let me start off with that, so that you don't have to read dri","useful":0,"cool":0},"mO6fpuqfY0KEiF3GXPykmA":{"text":"Had lunch at Bayona today. Food was ok. Service was in a hurry. The worst thing was that t","useful":0,"cool":0},"W6rZAC_1-T_Mb6WYt3OO4A":{"text":"Amazing. Some of the best food I've ever had in NOLA, which is saying a lot. F Emeril. Sus","useful":1,"cool":0},"is6meZxgt_leEUDKkcKXzw":{"text":"Pals rave; sw-breads keep them coming & raving. But when 3-4 oz. of wine is $14/glass, AND","useful":0,"cool":0},"ejsV4kO0Cf0WVPnOwM1umw":{"text":"This restaurant was strongly recommended to us by a chef friend, so we were very much look","useful":0,"cool":1},"H87nci80QiH-4ZiloSxknQ":{"text":"Excellent food and service. \nBayona was suggested to me by a friend that is a fan of fine ","useful":1,"cool":0},"y1yoDL23ZOKFeCPqTLwCaw":{"text":"Pricy but worth it. This restaurant came highly recommended from a colleague. Make a reser","useful":0,"cool":0},"kF8huG8NFtv0Yr3UlSnMDg":{"text":"By far this was our best dining experience in NOLA. Everything was perfect.  Chef Susan Sp","useful":0,"cool":0},"GCfvK99bs4WyigyLIxpQVw":{"text":"This place was recommended to us by my husbands colleague. It was one of our best meals in","useful":1,"cool":1},"OaWPmcjje9E1dvgUo8x1rA":{"text":"Not feeling this place .  Service is very spotty.  You are welcomed to wait in a lovely si","useful":0,"cool":1},"IKjZMbtFDYog6C9jiJPwKw":{"text":"So many pleasant suprises in this place. Gorgeous walkway to a fabulous courtyard for outd","useful":0,"cool":2},"CHo2hroCAy6rymCYbepXxA":{"text":"This was the nicest meal we had on our recent trip to NO.  We had heard good things and wa","useful":0,"cool":0},"SWnHQVuVFzqdwEVsBxJY7g":{"text":"With a show starting at 9pm last week, we called up Bayona at 7pm and they were nice enoug","useful":1,"cool":1},"fix6U41bJBm9dm9stuE7Dg":{"text":"I usually don't review based on service. Anyone could have a bad night. The food was very ","useful":0,"cool":0},"w1mTH66-PcDNykM4b2J1vg":{"text":"I've been a gastro-stalker of Susan Spicer since her first restaurant, Savoir Faire in 198","useful":4,"cool":2},"HUIHpAsPblMneHyo5FTmIg":{"text":"We were recommended this restaurant by a friend and we loved it. The restaurant itself was","useful":0,"cool":0},"E7M9S9sZyU_jwbLot50uZg":{"text":"Charming and warm.  Inventive dishes, yes.  I would have liked to give this restaurant 5 s","useful":0,"cool":0},"tOtvTVfO_Yihqi3Vbg8HaQ":{"text":"Take it from a local.  The BEST restaurant in the city...\n\nI love that Susan Spicer is sti","useful":1,"cool":1},"bgl_NiolGWIe_5NenAusUw":{"text":"Lunch at Bayona was fantastic! Jane and James, our servers were amazing, and took very goo","useful":2,"cool":0},"tJpe64ON0N0B6rAy4g1Pxw":{"text":"Beautiful ambience in a intimate cottage house. Service was slow, but we were in no hurry.","useful":0,"cool":0},"4F9Pi4pyc_6wTKNuYxS8xg":{"text":"The food in this restaurant is absolutely great however they have a snooty and i mean snoo","useful":2,"cool":0},"XIk8BSLvg90nbOngiNXpUw":{"text":"Very delayed review-I enjoyed their prix fix lunch last year. Top notch!","useful":0,"cool":0},"Wo3E0J334gNp2EOzssoweQ":{"text":"This meal was the first meal I had where every bite was mouth watering delicious.  We star","useful":0,"cool":0},"zuEQutY8xRmAyGHQasWOxA":{"text":"It is not a trip to New Orleans without a trip to Bayona.  This restaurant is what I consi","useful":2,"cool":2},"y2kBV_9U9EugQH0_1_ZzGw":{"text":"We have a phenomenal lunch here last week on the back patio.  The setting is lovely, peace","useful":0,"cool":0},"K9ECMh647swRwoNxJLELVA":{"text":"It is clear Chef was not on site. Not impressed with the menu. The dishes were mediocre. A","useful":0,"cool":0},"J5y4pH_uh7DYqlkka7rdpQ":{"text":"If possible, dine on the patio.  It's surrounded by plant life, well shaded, and very quai","useful":1,"cool":1},"U3gYoXSaFZRqi55M-FQcKg":{"text":"the house of Bayona has proven the test of time.  if you are looking for really good food ","useful":3,"cool":1},"ItSo5BS81fN6OQPc8bhA3w":{"text":"I stopped in for lunch on my last day of a recent trip to New Orleans. I was happy to see ","useful":0,"cool":1},"dVFS7B4Ulc9Wu4Am1NWd4w":{"text":"The fish was good and the apricot doughnut were wonderful.","useful":0,"cool":0},"Yf_DKkZKen1LMJIZQN8SgQ":{"text":"The food was fine if you are willing to spend three New Orleans hours waiting for it.  I h","useful":0,"cool":1},"7jHILP0whRWx8YjIDXinNg":{"text":"Unbelievably bad! Worst experience ever. Vote with your wallet and do not patronize this r","useful":1,"cool":0},"Sn3Io08CPll-LSA0vAGVWA":{"text":"0 Stars for service, 2+ Stars for my meal, don't know if I'll return...\n\nParty of 5 for a ","useful":4,"cool":1},"6BGjLuAVNljdYjImmS2Vsw":{"text":"Food quality and ambiance was fantastic.  The portion sizes were perfect.  The table prese","useful":0,"cool":1},"QErLqUm2M7pnFaHaGpKndw":{"text":"We had two hours before we had to leave for the airport so we decided to eat close-by our ","useful":3,"cool":0},"u3lrmVAhKAG-5aiXC0ov3w":{"text":"It's such pretty restaurant; the uniquely decorated dining rooms, floral arrangements, and","useful":6,"cool":4},"4TwyAe8CcnwvgDDxjGpLTg":{"text":"I'm a planner. That's what I do, so a month before my trip to New Orleans, I already knew ","useful":0,"cool":0},"TrU79XDJhapMyx9w5aVEpg":{"text":"Bayona has a great space and fabulous service. All of the food that we had was in the \"ver","useful":0,"cool":0},"7rftdViuEALfYoSVOvSO-A":{"text":"Started with the crawfish , garlic soup , lamb , then Nutella . The food was all delicious","useful":0,"cool":0},"Ue23jsMtVjb07ANDXI7Qlw":{"text":"The food here is superb!  I had the Duck and I literally wanted to lick the plate. My frie","useful":0,"cool":0},"0DfTKJzJnHyzTEjcBiSDPQ":{"text":"Eating vegetarian in the Big Easy isn't all that easy - and knowing this from our 12+ year","useful":11,"cool":9},"U5-1sTQCZVFLWDeHc7Udeg":{"text":"We came here based on a recommendation from a server at Restaurant August.   It was nice a","useful":0,"cool":0},"VBwJd_veSLh2kdNxF97m-w":{"text":"We heard the food was good so we decided to try Bayona but had a horrible experience... Th","useful":0,"cool":1},"zw24rRTj7JqUUSh69D8O1Q":{"text":"The best surprise of our recent visit to NOLA. Loved the food, atmosphere and everything a","useful":0,"cool":0},"DBaZ6XefrNCPW-zVnPg26g":{"text":"I think we are not cool enough for this place. Service was polite. Maybe they had a bad ni","useful":0,"cool":1},"NqfWQ4aEN1pc3ufJJWx2wA":{"text":"I had dinner at Bayona last Friday night and have to say that I was REALLY disappointed wi","useful":2,"cool":1},"Ybdw6uTXcbtEHGFpUye6zw":{"text":"When there's a special occasion, this is the place that I want to go to. I only go for lun","useful":0,"cool":0},"QLUY9KdhSOP-hgbqBNvLvw":{"text":"This place has become a tourist trap.  Susan Spicer needs to pay attention to the front en","useful":0,"cool":0},"NX2gfQPAqSr2QIRc6qA5qA":{"text":"Went here our 2nd night in NOLA and was very impressed by the entire evening. Bayona is a ","useful":1,"cool":0},"Nm1vTUKK0Iv9eYKwWg9DTw":{"text":"The perfect place for our last lunch in beautiful New Orleans. Our party of 6 had the plea","useful":0,"cool":0},"CXLfrZVMJI2WbdURfeHOXw":{"text":"My wife and I had lunch, nice atmosphere in what appears to be an old home in the French Q","useful":0,"cool":1},"Uhd348NJS54VR8EELOUnLQ":{"text":"Been to Bayona twice during my most recent nola visit - once with boyfriend, once with fri","useful":0,"cool":0},"xcIegyaQU7zq7BmEoQdHzw":{"text":"Dined here last night.  Although busy with visitors to New Orleans, sadly this restaurant ","useful":0,"cool":0},"EMwq-Sm51GQ7nevlFijKFw":{"text":"Bayona was definitely the culinary highlight of a recent trip to New Orleans.  My friend a","useful":0,"cool":0},"j1OFps_-hX9Z9fnjOMhDKA":{"text":"My date and I went to Bayona for the Saturday lunch where you can order three small plates","useful":1,"cool":0},"bl35YAV_dQ_eQAaPV749Zg":{"text":"Ughhhhhhh.... We had a reservation but were a little late aka 10 mins I guess that means b","useful":1,"cool":0},"GRNbikWiFAwHhFXb1SVxNQ":{"text":"Very disappointing meal due to slow, slow service.  Got drink order wrong. Three of us ser","useful":1,"cool":0},"u0IJRZCo974p7DuA3uJcBA":{"text":"Some of the best food I have eaten in my entire life.\nA staple every time I go to the big ","useful":1,"cool":0},"cuqEup_t50UFFZenEUzuZg":{"text":"For starters, be prepared to wait even when you have a reservation.  The atmosphere is com","useful":0,"cool":0},"F-2t2P_TVmNYTZB8eEBrqw":{"text":"Cashew butter.\nPepper jelly.\nDuck breast.\nSandwich.\n\nGo to Bayona for lunch and eat it and","useful":4,"cool":3},"oqRPCSiR-8sIABQgiRE0Tg":{"text":"Appetizer:\n1. Sweetbread--this is why i gave the restaurant a 4 star rating. Soft and melt","useful":1,"cool":0},"XsRhCQ0cNFAJR9yWuS5yKg":{"text":"Very intimate setting, waiters were very nice and helpful although they should be for the ","useful":0,"cool":0},"2WR4RzKx9BbfeKEtm0Ynjg":{"text":"Some of the best food I have had in New Orleans! Our server was super knowledgeable and at","useful":1,"cool":0},"9vNonh0qLNRYMDuRnNKydw":{"text":"Went  to Bayona based on some  yelp reviews and also on an episode of Best thing  I ever a","useful":0,"cool":0},"oqZOSDWQnE6vdYQ5e4ZrNw":{"text":"Dopest lamb in the quarter. I give it 3 hand grenades up. Wine list blew my dome to pieces","useful":0,"cool":0},"8ewCAv4qIAckc9rjGiTSuA":{"text":"I have been to Bayona many times and have always been eager to return.  This time, no. Cle","useful":0,"cool":0},"uVvvjJpyGZgmcZtuudz3iw":{"text":"Our waitress, Jane maybe, was fantastic! So knowledgable! Cream of garlic soup was great a","useful":0,"cool":1},"mNYfGF97BjYve3IdNaRJkA":{"text":"My wife loved the Garlic soup and the sweet potato brioche (maybe the best bread we've eve","useful":0,"cool":0},"uDwG5zI-DjmCHWeK7Jb-Hw":{"text":"Bayona was just OK, not the 5 star excellence I expected. Service and ambiance were very n","useful":0,"cool":0},"Hm4hQiYoeHZLn4oF3ecWPA":{"text":"I did not order a starter and had the rabbit roulade as my main (a bit light portion-wise ","useful":2,"cool":2},"rQS_AQHVE7ciM1s_eV8X0g":{"text":"Very disappointed! I ordered the beet salad, it was flavorless canned beets on field green","useful":1,"cool":0},"6rbavOf35-iT318LjBVF5g":{"text":"Very slow, but friendly service. Food tasty but neither appetizer nor main courses were ho","useful":0,"cool":1},"Fxo1e0kmGgCBrvuKEZrz4A":{"text":"Excellent restaurant avec une cuisine délicate et savoureuse. \n\nRecommandé par tous les gu","useful":0,"cool":0},"G528S8x57yoEW0Tf1-tyYg":{"text":"We went there for lunch right before the start of jazz fest and were very underwhelmed.  T","useful":0,"cool":1},"6myncGq57qq7mBfPi1V9SA":{"text":"Overal our prix fix unch took over 2 hours and the courses really were sub par from our ma","useful":0,"cool":1},"_GXxn339WK_ST6ODbzTFZg":{"text":"I get to NOLA about twice a year.  The Smoked Duck Breast PBJ is like Christmas!\nThe servi","useful":0,"cool":0},"68JkaqhI2DTxKDwNYhcpIA":{"text":"We had a superb brunch today at Bayona. The manager, Shannon presides over a professional ","useful":3,"cool":4},"a4_8iiRqjPaKIwAyvHWVWg":{"text":"First off - I really don't know why a lot of reviews on here have their panties in a twist","useful":1,"cool":2},"HDajox2iB5oMdDpwII34tg":{"text":"Very comfortable setting with class. Sweetbreads! Thanks Chef Spicier.","useful":0,"cool":0},"gmSoi742QGQ90TxMx_kENw":{"text":"Our last meal in New Orleans and picked purely on strength of Moon guidebook. Glad we did!","useful":0,"cool":0},"zY58d3EoAK-3knSh2U5cgw":{"text":"To start with...the cocktails here were amazing! Had a smoking jacket and royal dauphine, ","useful":0,"cool":0},"JKJmVJY9K7OwkYC9uku8Cg":{"text":"Loved the cucumber julep cocktail as well as the beet and fig salad.  However, our entrees","useful":1,"cool":1},"SuqiL9VVJ5Cydv75h_QZcg":{"text":"Had a very nice dinner here with the hubs. Started off by ordering the sweet potato brioch","useful":0,"cool":0},"NOYZ6qhujv2NqT9A7vXeRA":{"text":"I cannot express how amazing this restaurant is! Susan Spicer is a culinary genuis. If you","useful":4,"cool":2},"XXboU77YFuBnj5qTilwnow":{"text":"The king salmon was the best I ever ate! Huge portion and very crispy on both sides of the","useful":0,"cool":0},"SrtJbVV23YohCk6w8VePtA":{"text":"This was a pretty disappointing experience. I lived in New Orleans for 4 1/2 years through","useful":2,"cool":0},"NghaJ3xCehKa8NSOeK2Xjg":{"text":"As always, Bayona was incredible. It's been a long time since I've visited, but the food, ","useful":0,"cool":0},"xoeAvdISkDQEw-B_zBV1LA":{"text":"My friend and I sampled the January fixed price lunch special. I must say, I have had bett","useful":1,"cool":0},"qpM6yM4XmZc1hxCkjpmYdw":{"text":"My wife Lynn had to attend a conference in New Orleans . . . the National College of DUI A","useful":0,"cool":0},"La-BPPVYAQcvajnMZxRLMg":{"text":"SO I get invited by a friend to eat at the famous Bayona. One of the restaurants that I ha","useful":0,"cool":0},"IB60X3bFBzahCaodPlOtwg":{"text":"A favorite. Chef just knows what things taste well together. Never too fussy or self-consc","useful":0,"cool":0},"iawziqdnsN6wHGgVnwyEyQ":{"text":"I won't forget the meal I had here for a long time:\n- cauliflower soup with almonds and le","useful":1,"cool":0},"95NHL-_NK4WEjlH0q1l2Ng":{"text":"working in the area, i only was able to make the trip into the quarter for lunches.  but w","useful":0,"cool":0},"ciguM8fWa5eXKwN5zKou5g":{"text":"My boss's attorney Sam R. lives in New Orleans and what better way to explore food than th","useful":0,"cool":0},"QxcK1nQihaedK5hNmzHScQ":{"text":"The menu doesn't adequately describe the dish. Sit back and order, because all of the food","useful":0,"cool":0},"0Xn5vxCoky3bb5u0I7teHA":{"text":"Wow, damn tasty meal!\n\nI almost passed this place by--the entrance is off of a courtyard, ","useful":2,"cool":4},"hzE1XxtN061_C6SefrnDSw":{"text":"Delicious food with prefect portions. You'll want to dress up a little bit a this place de","useful":0,"cool":0},"NZSBRujPZ7exMKZwP-dcgA":{"text":"Behind it's unassuming exterior, Bayona is an elegant treat in French Quarter. I was on so","useful":0,"cool":0},"vDF_-eiT5zpcudzBZyjvNg":{"text":"One of my first meals upon moving to New Orleans was at Bayona.  The food is described as ","useful":0,"cool":0},"xq-VBaCk0n0xuHmAMZibAg":{"text":"\"How had I gotten here?\", I wondered to myself.  \"Curiouser and curiouser\", I repeated in ","useful":4,"cool":13},"kiKA1nEv-fX6o-MJZVxAuQ":{"text":"My favorite place in NOLA. Outstanding food and service in an intimate setting! I settled ","useful":0,"cool":0},"9Z-1-jR2E3SP95RgSb_0aQ":{"text":"Hubby and I really enjoyed this restaurant.  You have to make reservations weeks ahead bec","useful":1,"cool":1},"-F7yfeIYcsAxJilCR_UR2A":{"text":"Bayona is a great place for a special occasion. The food is delicious, and there are veget","useful":0,"cool":0},"u7-Ctf7AC9xvkZkSmjFOdQ":{"text":"The food here was probably the best food I had in my life.  The service was also excellent","useful":0,"cool":0},"taq5bMFf2jNwzMI7miRqKw":{"text":"Susan Spicer's restaurant has been on my list, so this came with some high expectations. T","useful":0,"cool":0},"FS8DVfcyQjuuebkGe-neyQ":{"text":"I came here for lunch after a long morning of walking around the French Quarter. It's loca","useful":0,"cool":0},"p16-JhdAN4RiyKoTP1Ztsg":{"text":"My favorite place in New Orleans despite a lot of stiff competition, consistently a winner","useful":0,"cool":0},"vox04TabCWlIjKqyZoS27A":{"text":"Believe the hype...Bayona has it all: charming courtyard and vintage furniture, impeccable","useful":1,"cool":1},"BYDPopb79KH-aMt3do3Mjg":{"text":"I was so happy to finally go to Bayona, I've been wanting to for years and as a local it's","useful":2,"cool":0},"CeaOzC-A4P26UN-hs10ORQ":{"text":"We went here for our first night on our recent trip to New Orleans. Service was great, the","useful":0,"cool":1},"_ixjM56nTQr6KdiT27FvqA":{"text":"We came here a few years back and really liked it, so came back again. This time around it","useful":0,"cool":0},"ANMgUf-Ug9PmpCEc0xG4dw":{"text":"One of my favorite meals in New Orleans. The ambiance and service were spot on. We ordered","useful":0,"cool":0},"lZuF2ClY5NGV8DI2aWz2cA":{"text":"I wish I could give negative stars. It was so bad, but words can't give the full experienc","useful":1,"cool":0},"FzUDKSjTle0-mRmP_dTUhg":{"text":"One of the finest places I've dined. Certainly one of the top 5. I'll be very explicit.\n\nI","useful":4,"cool":2},"sBpHlMYBehO7ey3CnHw0Kw":{"text":"Wonderful restaurant recommended by the \"Where NOLA eats\" FB group.\nBeautiful inside with ","useful":0,"cool":0},"yZrpcopr3ikVRHw1cxix9A":{"text":"Thank you for the wonderful evening. My friend and I both enjoyed all the dishes we ordere","useful":0,"cool":0},"LrpKF5Lg1TbWbYe6o3rCAQ":{"text":"I would have given Bayona a higher rating, but I was so disappointed in the service.\nI cam","useful":1,"cool":0},"kNnbkqaT5tyx1CKoua9IIA":{"text":"Sadly, I just had to abandon dinner at a place I have wanted to eat for 15 years--\n\n\nAfter","useful":2,"cool":0},"MC4DHTim3oKB0Qi3rex1sw":{"text":"The food's decent enough -- I'd give someone else at least 3 stars, but a place of this ca","useful":3,"cool":1},"JWVn78DCRo9zavnS1IqidQ":{"text":"This is what I'm talking about Baby! Excellent food, professional waitstaff and lovely din","useful":1,"cool":0},"Frnkh63vEaoo00Y2pfqUQA":{"text":"There's a good reason it's rated one of the best restaurants in NO. Outstanding food and s","useful":0,"cool":1},"QlDxPiTM_MBUldB16ZEi6Q":{"text":"Bayona's performance went from penthouse to outhouse in less than 30 minutes - and stayed ","useful":1,"cool":1},"ZJ1TSy9Eu6xCrWoj1poOIg":{"text":"While the food was delicious, especially the dessert option of smoked duck in puffed pastr","useful":0,"cool":1},"fvJUt-SXrI-RMykMTVLN3A":{"text":"Weekend dinner here. They have 2 menus here: one which comprises house specialties and a c","useful":0,"cool":0},"uyul8P63Mfz7EK6sey5C9A":{"text":"This is one of the best restaurants in New Orleans famous for their sweetbreads which are ","useful":0,"cool":0},"mzB-cb9YzHwGyF9c3ajQvQ":{"text":"Amazing...a hidden treasure, the staff  was very attentive and a very sweet manager that m","useful":0,"cool":0},"Ypk4SWFerQ51qhu-nCwMMQ":{"text":"One of my favorite places in the quarter.  Last time I was in, I had the venison wrapped i","useful":0,"cool":0},"kAfO1pVZOAHb-7uigfPkWg":{"text":"pretty tasty. came here for their three course lunch menu for 28 dollars and martinis for ","useful":0,"cool":0},"BcbRaDwnaXFCdmV2-tSsIw":{"text":"Sadly, Bayona wasn't particularly memorable.  My dining opportunities have been curtailed ","useful":2,"cool":0},"qMSNKKiI9PHPjoukcB_Y3g":{"text":"My best and favourite meal in the French Quarter.  If you want to include all New Orleans ","useful":0,"cool":1},"B1b451KI7DYgiJam-TJiCA":{"text":"My dinner party group had one of our annual winter holiday dinners at Bayona. The service ","useful":1,"cool":1},"TpA0AfEmzSOaaX8zcA84Ow":{"text":"Chef Susan Spicer is one of those famous chefs that still cooks at her own restaurants... ","useful":0,"cool":0},"U1VBBmhVy3ACqHpFmXswmA":{"text":"Had a very nice dinner experience. The waiters were on point and very patient as usual. I ","useful":1,"cool":0},"IRjPzsiNuATHNikbLYtDNw":{"text":"Excellent food and great ambience.  The reason I give them 4 stars instead if 5 is because","useful":0,"cool":0},"70T3T_eZOiAOWZuu1d94dg":{"text":"Highlight of my trip, food wise. I can't find a single thing to complain about. The restau","useful":0,"cool":0},"bNfh4jlHqjA9Lqyh8pUv-g":{"text":"We came for the Saturday lunch, which is a small plate selection. 3 small plates for $28, ","useful":0,"cool":0},"nhYUV1FIKdpdtP8ncy6idQ":{"text":"I've eaten here twice on a business trip and quality of food and service was great. The 2n","useful":0,"cool":0},"yphTJqcrm10bFgYXJDEKSw":{"text":"My absolute favorite restaurant in the world, bar none.  Service, food, decor, ambience th","useful":1,"cool":0},"0HX6kpfVfgApIaB2LsNd6g":{"text":"Best meal I have ever had in my life!  I stayed across the street from Bayona on a previou","useful":0,"cool":1},"PVCQ7veUa6GnavzucBd2eA":{"text":"We were looking for a restaurant near our hotel that could accommodate 6 people and get us","useful":1,"cool":1},"DaL81Z1UbfKytyXLrdJNMA":{"text":"Try the sweetbreads...yes I know what they are and they were top notch.  I had the duck as","useful":0,"cool":0},"_If0C9f_coqH1UCBKynTvw":{"text":"The sparkling wine, phyllo wrap crawfish with yogurt sauce and lamb with gorgonzola was am","useful":1,"cool":0},"8ZlNPrxGWM3ItSlc-ukZjA":{"text":"Wow. This place was delicious. I had eggplant caviar for my starter with some mini toasts ","useful":0,"cool":0},"cjsdUImRQPbl99Xv-8-9Ig":{"text":"Was told this would be an excellent place for Creole food\nWas good \nWorth the cost \nWhich ","useful":0,"cool":0},"u4xtbtZ9Y9FNC6jcvhOIBQ":{"text":"Simply put, Bayona is incredible. The food is delectable, the service is impeccable and th","useful":0,"cool":0},"K11EDiFxAc30DHtCskgF7g":{"text":"Solid quality food, presentation and service. Everything was wonderful and my meal was exc","useful":0,"cool":1},"RfLp6SLew1yEqUVFtaTnzQ":{"text":"Interesting, strong, delish drinks (like the absinthe-infused Pixie Punch).\nImpeccably cra","useful":1,"cool":0},"7Aly8px0JS9yB9up3eVTPw":{"text":"Beautiful courtyard, the food was very good but nothing in particular stands out in my min","useful":0,"cool":0},"WheTuK-okerwK3wuRxaEpQ":{"text":"So, my boyfriend (yelpie Paul R.) tells me that he made a promise to himself that he'd sho","useful":0,"cool":0},"aUMLos9I4jM4gG8ifCDaYw":{"text":"You'll need a reservation otherwise it won't do to even try to dine. I got turned away whe","useful":0,"cool":0},"WjFvwUjMbyLDloh_ve4lxw":{"text":"Bayona is a nice little restaurant in the French quarter. The staff were really friendly a","useful":0,"cool":1},"EeofaGFj-MpML50Qa-cL7w":{"text":"Great New Orleans food in an old New Orleans house.   Nice quiet setting in one of the lea","useful":0,"cool":0},"rGbSi6QeDkOWR7Od6-bAMA":{"text":"Never been disappointed. Love Susan Spicer and her cookbook! Food is always great and we r","useful":0,"cool":0},"9Vev3F21hYhPM1UGu6m1XQ":{"text":"Heavy food lacking innovation. A bit boring and the music loop did not enhance the experie","useful":0,"cool":0},"VeNDFP6qBIA3YvkeBqmbbw":{"text":"excellent lunch options!  super cute patio (esp for a date).  definitely worth the visit. ","useful":1,"cool":1},"2GOicQsA2dgie5Kwl_x1IQ":{"text":"\"With an S on her chest...  she's a superwoman\" -Alicia Keys\n\nSusan Spicer knows how to th","useful":1,"cool":2},"5TjvROPSfHBS-iqkmcEY1w":{"text":"The food is good, no doubt.  I particularly liked the duck-PB&J concoction, but everything","useful":1,"cool":1},"duBtNlsh610NAGmZRy5OPQ":{"text":"Great food and a nice setting but terrible service. Sat us in a lounge waiting area and fo","useful":1,"cool":0},"Q_PnYewtQ1iCBBbkAE2a4w":{"text":"I don't think Bayona was originally on our radar when planning out where we wanted to eat ","useful":1,"cool":0},"DTUJJIeYcwqWW5eUSBj1dg":{"text":"Came here for the light Saturday lunch. Thoroughly enjoyed my beet and cucumber salad with","useful":0,"cool":0},"TumsbTc4cjfp-Npn0d48oA":{"text":"Went here for the Saturday light lunch. It was good, but not as good as I was expecting gi","useful":1,"cool":2},"2Jp5KujywzObCur-LhU4Cw":{"text":"Fantastic!  The food, wine and service was top notch!  The ambiance was soft and inviting.","useful":3,"cool":2},"_4C6MwCJCA_Uyxz7SHFr2A":{"text":"Had a horrible dining experience at Bayona. I was excited to finally try this restaurant a","useful":4,"cool":0},"Riq3VABM-aBiSHvXCgoHAQ":{"text":"Blown away by this place. Order the smoked quail salad - you will not regret it. Under pri","useful":0,"cool":0},"Q_Wgy3ADCiloyaGQPhbYxg":{"text":"after years of coming to this place during our annual jazz fest visit we will no longer co","useful":2,"cool":0},"H2ox0459LK4_XomJnlPbZQ":{"text":"Friends who are frequent visitors to New Orleans suggested Bayona to us, as we had one nig","useful":0,"cool":0},"ijA8C9ITDlexv_vZoTTycQ":{"text":"Doesn't get any better than this. Every single flavor was perfect, had a suprising nuance ","useful":0,"cool":0},"HxufwMjbMK120lBJtWbKeA":{"text":"One of the most amazing food experiences to date. Chef Susan Spicer is a creative genius. ","useful":0,"cool":0},"3CaWX3VPiuCSK6QnyV_0aQ":{"text":"So on this, my 7th trip to NOLA, and 2nd time to Bayona, I find myself still in love with ","useful":0,"cool":0},"TjArVezCsvU1dZja-_H30g":{"text":"Sweetbread is a lust and must. Scallops perfectly prepared. Lemon semifreddo dessert paire","useful":0,"cool":0},"w-Ymb6CwYZUIZY02Ghq82w":{"text":"Amazing...go here....not much more to say.  Not typical N.0. fare but just great.  The swe","useful":0,"cool":0},"iFJIIC6oRYlJ-otjnNarSA":{"text":"Good restaurant with creative gourmet fare in beautiful surroundings.  Appetizers, salads,","useful":0,"cool":0},"v4T7Ua19Kq5rpV_I5TaR2w":{"text":"We were recommended Bayona as one of the best restaurants in the city.  Friends have raved","useful":0,"cool":0},"KaeSEprDX32gar_S8fB7cQ":{"text":"OMG.. amazing food, great atmosphere and wonderful staff.  I will go back when im in back ","useful":0,"cool":0},"XvesEu1jd5nvlVOf68o9og":{"text":"This spot was recommended by a friend and it's definitely a cute spot. I wish it was nicer","useful":0,"cool":0},"QJ7R-3-AG4qT8pGYntk8UQ":{"text":"I haven't been to NOLA for sometime and went to Bayona.  It is really a now a classic New ","useful":0,"cool":0},"wJMMGIEUS3N_eKhguJVILg":{"text":"love the food! service was good...I love that they are organic and  NON GMO ! I will be ba","useful":0,"cool":0},"s20u8pgOAfvDby2a_24j_A":{"text":"Excellent lunch spot...even with all of the construction outside the front entrance.  The ","useful":0,"cool":0},"vxjniA8OCXJZzgCnclmZfg":{"text":"On a recent visit to New Orleans, we decided to try Bayona.  The following are the pros an","useful":0,"cool":0},"KCcrECHKPpbf9o0-xA54TA":{"text":"My wife and I went to Bayona last night.  Ashley was wonderful as wait staff.  The sweetbr","useful":0,"cool":0},"xqDFLtCkE2_aAcECarkyYw":{"text":"Susan Spicer is the new queen of New Orleans cooking. The character in the show Treme is l","useful":0,"cool":0},"w43geUejK-CyhWWH4avE9w":{"text":"Whew!  We got really lucky, and scored a cancellation.  This was the best restaurant we've","useful":0,"cool":0},"ggY5JTOIzTns6cZ7Vpq3OQ":{"text":"I had the duck thing and the quail salad. Poultry is wonderful here, my girlfriend's pork ","useful":0,"cool":0},"XRyJKMmefHmM3gtdFP7TqQ":{"text":"A bit of a disappointment after our Saturday lunch. Maybe the chef was a bit Burbon'd from","useful":0,"cool":1},"oNjvC1ZupaYQujXjvskREQ":{"text":"If you're in New Orleans, you absolutely need to go to Bayona and get the sweetbreads. Don","useful":1,"cool":0},"77GBmBBQ67BfyPZjz1uAAQ":{"text":"Bayona was okay.  But not what I was expecting from a highly acclaimed, higher end restaur","useful":1,"cool":1},"dS61ys91ROOI1PfElEb1pQ":{"text":"A great part of our affection for this restaurant came from the waitress there. There were","useful":0,"cool":0},"taYHPpOuokCZQuP_1JA3Xg":{"text":"Will always be one of my all-time favorite restaurants in New Orleans (which has a lot to ","useful":2,"cool":0},"I2Fic8MiXM9gzq_sr57uZA":{"text":"I'm a bit upset with myself for being a native New Orleanian and only recently having expe","useful":3,"cool":0},"fc1W7OPRZ44yQGDhbjwRcA":{"text":"Take advantage of their specials and the waiters' recommendations. The menu is nicely orga","useful":0,"cool":0},"73xi-Tt5uYoiTtgOnuNtJA":{"text":"Last night we are ate here again after not having been back to New Orleans in many years. ","useful":1,"cool":0},"XqBWffqU4OoJ32c2yU3jyw":{"text":"One of the best perks of working in the French Quarter is the proximity to so many of New ","useful":2,"cool":1},"VDS2UrGRguxjN4zaIFGntw":{"text":"This was an unexpected treat.  They were just about closing but the hostess showed us a co","useful":0,"cool":0},"jWQvdY-LSaUKrs8wCF1o0Q":{"text":"Actually 4 1/2 stars to be honest.  Very good food.  Actually, the appetizers were better ","useful":0,"cool":0},"Cvcrs6anMPj3JTR1ZhnOlw":{"text":"Elegant. Beautiful flowers, impeccable service, excellent menu... well worth the cost. The","useful":0,"cool":0},"LpUgbts3T0gvy4pR14LFKA":{"text":"One time visitor.  Thought this was a great meal.  We had just arrived in NOLA that aftern","useful":1,"cool":0},"656hgIe_zZ1j5KvjUWwsVQ":{"text":"I'm not sure why they're rated so high.  Out of all the restaurants we went to in NOLA, th","useful":2,"cool":1},"Mqv97r8ddRSBdlfwuBCr9g":{"text":"I'm only giving them 1 star for the service. I took my boyfriend here for his birthday and","useful":1,"cool":1},"4KmoB4CRwAsZ1T3OGKyq6Q":{"text":"Excellent!  Susan Spicer was as friendly and nice as much as her food was delicious!  Even","useful":0,"cool":0},"2reMvRVnFcLU22Z7J1M9dQ":{"text":"Wow...I went there having not been there in twenty years.  A major disappointment.  The fi","useful":1,"cool":0},"AAxOmVEJNb79gnTVO1BNJg":{"text":"summer 08 - 18th anniversary for restaurant, lunch is 18$ all summer, good deal. I wanted ","useful":0,"cool":0},"iLGF5Vsss5b28BIhDol4tw":{"text":"My four friends and I dined at Bayona on December 23, a busy holiday night in the French Q","useful":0,"cool":1},"ZNVYGl4fpA1ibW6RMAxb-g":{"text":"This was our second go-round for dinner at Bayona, and it did not disappoint! My husband a","useful":0,"cool":0},"FO1GLrcvBXa-7du2VIx3Cg":{"text":"This was the best restaurant I've ever been to in my life.  \n\nThe service was SUPERB; our ","useful":1,"cool":0},"hVJp2qGMTDs0P9NHqd4EOw":{"text":"This was the best meal we had in NOLA, and that includes some stiff competition. We'd had ","useful":0,"cool":0},"3nxy1RNSQDA85-HEnGu_EA":{"text":"I had been wanting to try this place seemingly forever, and today I finally got my chance.","useful":0,"cool":0},"vSIkH5fl65fWrTIn3e2M2Q":{"text":"Everything was outstanding (duh, 5 stars). Great service, comfortably elegant atmosphere, ","useful":0,"cool":0},"nV-VL1V5g57asA5Wei11Hw":{"text":"We arrived early for our reservation at 8:30 to find the room almost empty. We wanted to h","useful":2,"cool":0},"1L3yW6Vx2q51JTp9b6C_jg":{"text":"We booked this restrauant for my 52nd birthday and man we were sorry. I'm from New Orleans","useful":2,"cool":0},"77QVAOsJYAm4vEdZhFRY2A":{"text":"you only need to know one thing about eating at BAYONA:\n\nhave the lamb.\n\nthen go back the ","useful":0,"cool":0},"9ehb72MUnU4MNCglOWIFGQ":{"text":"Years ago, before the 21st century food revolution, Bayona was my revelatory experience wi","useful":0,"cool":0},"5DIefirV2nUdcV3-mGlNog":{"text":"This place had .28c martinis and 3 course lunch menu to celebrate their anniversary. Every","useful":1,"cool":1},"UHY_F5ZaxRyzv96rN4U5Fw":{"text":"Oh, Bayona! I have been to this restaurant several times in the past when visiting New Orl","useful":1,"cool":0},"-Zp5vaQUJsXSd716NYEq0Q":{"text":"I was hesitant to try Bayona as the menu was small. However, the concierge at our hotel re","useful":1,"cool":0},"HBls6Ytl5WVqcZQXQ1gfNw":{"text":"I've only been there once, but my experience there didn't live up to the reputation.  Serv","useful":1,"cool":1},"1hXEcx_mJpgoxt3gAjCVig":{"text":"Susan Spicer's Bayona is my favorite of the top notch restaurants in New Orleans.  Everyth","useful":2,"cool":1},"Jj7VGUH6RCdtQLqedbRFAw":{"text":"I have had dinner at Bayona three times in the last five years.  They have all been excell","useful":0,"cool":0},"LPzAquwFJtrCtt-NflBVlA":{"text":"Full of old charm and serving up amazing food! Cannot wait to go back to NOLA and eat here","useful":0,"cool":0},"zFCZhVWpxLk_f4k7lfppxA":{"text":"This would have been a wonderful meal except that it was all but ruined by the unacceptabl","useful":1,"cool":1},"EMIitq6jTq3HGc2SBdJm8Q":{"text":"Stopped in for the Saturday lunch and was not disappointed. The restaurant was so cozy, th","useful":0,"cool":0},"ZHLKeOxl4Ts4WMMX79pC8w":{"text":"There is a saying that \"you should never meet your heros\" because they can't live up to yo","useful":1,"cool":1},"M2Io7Ax_ac3GkyoaViU-Ug":{"text":"Truly one of the best restaurants in the city.  Never disappoints, great food, great servi","useful":0,"cool":0},"8lCadiGHT6WYr78UFn6a_g":{"text":"Food: Chef Susan Spicer's meals did not disappoint!  Everything from the veal sweetbreads ","useful":0,"cool":1},"MbgR4U_SCcn3nf4iZ9gNRA":{"text":"Have passed by this classy restaurant on previous trips but this time we made it here!\nVer","useful":0,"cool":0},"FYH0wjVdz4SOZKoV_mqOiA":{"text":"I didn't start following chefs until I heard of Susan Spicer and this restaurant.  I like ","useful":0,"cool":0},"OUAq5x-yVDg9QVfeZsmyKA":{"text":"If I had ordered three quail salads as an entree, I would be so much happier and would fiv","useful":0,"cool":0},"I8LnAazGg5xiDXZyJKxd2w":{"text":"Found this spot via yelp. WOW! What a great place for dinner. The restaurant is about two ","useful":0,"cool":0},"hoNUEXfoJTydkRj1UVjzwA":{"text":"A fantastic dining experience. Service and food were right on the mark. Best sweetbreads I","useful":0,"cool":0},"eBQEG8i3qo38OUQNHLurBw":{"text":"A rainy afternoon, big windows, and great company for lunch in the French Quarter. What a ","useful":2,"cool":4},"f3GNIkWF4Uh7fzc16yFRfQ":{"text":"Doesn't get better than Bayona.   Tonight rabbit pate, sweetbreads, duck, shrimp and rabbi","useful":0,"cool":0},"AwjyN-sHYbeOcHf6K6wMWQ":{"text":"We loved our lunch at Bayona.  I started with a simple green salad with parmesan, which wa","useful":0,"cool":0},"DKYpxwUKu4O54xgfYYSc5Q":{"text":"Top notch dinner with excellent service in a very traditional NOLA setting! They have the ","useful":0,"cool":1},"vOAjAceMCmepcO3jzqJ1NQ":{"text":"The food was superb without qualification with excellent preparation and exciting flavors.","useful":0,"cool":1},"oK31twKL4MpRYfitxmHITg":{"text":"This long standing restaurant is a classic Romantic New Orleans Classic. I've never been d","useful":1,"cool":1},"eFseJEM-65SV7hhSUGWsVg":{"text":"We visited NOLA last week for the first week of Mardi Gras festivities (Family Gras!) and ","useful":0,"cool":0},"H9Ii-0I4EX6CC5L1MXcI0A":{"text":"I heard about the sweetbread. OMG, this was delicious. I highly recommend it. Very well pr","useful":0,"cool":0},"8xpyOwi_liE1VvrbR9fZKw":{"text":"Great food, mediocre service.  The sweetbreads made me a fan again after so many bad sweet","useful":0,"cool":0},"scDVfAquk0qhxkyBzN30Gw":{"text":"Went here on my last night in New Orleans with three coworkers.  This place came super hig","useful":3,"cool":0},"SOMKtnIlmxwN3LdptRbRXA":{"text":"Great food.  Good service.  One of the top places in New Orleans.","useful":0,"cool":0},"PUzvW6lhH9TOY2lzRIa38Q":{"text":"Ok. I'm going to start by saying my girlfriend and I may have had the best meal of our liv","useful":1,"cool":1},"H6WjAXKouzz00voQBAIeFg":{"text":"This was an incredible and romantic dinner. The restaurant and patio are beautiful. We sat","useful":0,"cool":0},"jFRPP3s8URr_jEIUfOjNgQ":{"text":"Fabulous food in lovely atmosphete.  Sit in the serene back patio in good weather.  The se","useful":0,"cool":0},"4hrVpbuX2s-UGq-7pHZLbw":{"text":"Heavyweight champion in a city with the highest food standards in the US.  The duck in dat","useful":0,"cool":1},"gQl0GqmP-Dz35h5Tnipm_Q":{"text":"Possibly one of the best meals I have had.\n\nI'm from Philly and I love New Orleans and it'","useful":0,"cool":0},"kp4uUDQJN8ZM4fGJ2ZijPw":{"text":"Amazing food, AMAZING service...AMAZING ambience...best accidental discovery in awhile.  I","useful":0,"cool":0},"zFRrOLxb_pydzGiqde9wjA":{"text":"Some local reviewers praised the place as the best restaurant, so decided to try for a din","useful":0,"cool":0},"ZkvhNDbWpJ4a9ilJofE1nA":{"text":"Not for vegetarians-\nMy husband and I are both vegetarians and had a reservation here for ","useful":0,"cool":0},"EWMEXQbX5zoLk2JVJIO4bg":{"text":"This place is amazing! We went here for a business dinner and it was fantastic. It's got a","useful":0,"cool":0},"U0I18r2E999Fv_DdsSq4Rg":{"text":"This review is for the Light Lunch on Saturday. It was my birthday on Friday and I had mad","useful":5,"cool":2},"NmxTixP1-JOLeodzoqfwZQ":{"text":"Four of us went to Bayona and the experience was uneven at best.  The scallop appetizer wa","useful":0,"cool":0},"5jxynZSC10bmaVvbjKBosw":{"text":"Beautiful restaurant in a historic building with very good food and wine list and terrific","useful":1,"cool":0},"oFdDns-azqSz36uDdISN0w":{"text":"While the food was very good, the service was lacking in attention to detail. It took 100 ","useful":5,"cool":0},"kIWJnWYbZ8rCNpFnmPFUrQ":{"text":"We are big fans of Bayona.  We have been there for several special occasions and for the l","useful":0,"cool":0},"qmcAukF7ADPWlRXoevkLIQ":{"text":"Had lunch here today! Delicious! My husband had the bayona salad as his starter, I had gri","useful":0,"cool":0},"75wocO1o92UgGMICfS092Q":{"text":"Disappointed is my general review.  The location is stunning, but the decor is dated and n","useful":0,"cool":1},"5ikDd9UPxqpfhtl0H1SImg":{"text":"In the interest of your time, our experience can be summed up as follows: \n-great food\n-to","useful":7,"cool":0},"0i7Qe9h0QwJsqBip66ApjQ":{"text":"As others have noted, the food was incredible, but the service was leisurely. In Bayona's ","useful":0,"cool":0},"Sys0cTNUVP2_lwUnRHJ1uw":{"text":"Our favorite restaurant in New Orleans! So excited to return after about nine years. As go","useful":0,"cool":0},"XVUItZMc1HdJ359EOvRlRQ":{"text":"The food was very good. However, I did not find it to be particularly unique.  The three s","useful":0,"cool":1},"dDmVhtgTZ3Bjo6P8KPz5JA":{"text":"This is an excellent restaurant where you absolutely have to go!\nCould be award by the Fre","useful":0,"cool":0},"fkq0xiUhTIAKTRpwPrnqfw":{"text":"I had forgotten I've been here before. Wednesday lunch with the wifey is very different fr","useful":2,"cool":0},"rq2SZ9CrHMkLaiutg80RjA":{"text":"Been walking by this place for several years bur always ignored it as its in the middle of","useful":3,"cool":1},"BUW36KSuE0PbJs6XBOjB2A":{"text":"Food was great. Service was slow and the waiter was inattentive at best. We ordered a $420","useful":4,"cool":1},"0cXBSodOZ74Hsy0sxBz28A":{"text":"Don't go to New Orleans without dining at Bayona! You won't regret it. Fine dining without","useful":0,"cool":0},"iWIZmz7mrCWHhtWJ7k4Msw":{"text":"Terrific spot with wonderfully subtle, but vibrant flavors in all dishes. The Veal Sweetbr","useful":0,"cool":0},"7FtMUKY5Ploo4JXDeif4fw":{"text":"Hand down the best meal we had in our 5 days in New Orleans. The goat cheese crouton was i","useful":0,"cool":0},"qNUYAcFuf7kdMMiSQIWX5A":{"text":"Beautiful decor with even better food. The lamb tenderloin was outstanding ut rhe sweetbre","useful":0,"cool":0},"mAJJmm-5apj6nhtC-GfwDw":{"text":"I am sad that I only got to have lunch at Bayona.  There are so many things on the menu th","useful":1,"cool":0},"6nbQZNXKBtsT1x1Q5Gd7xg":{"text":"Omg. This is an odd thing to say- but the menu items always don't sound that appetizing. B","useful":0,"cool":0},"--M77BSnjScXH8UkFzyhlA":{"text":"I have only been here once and the food and service was great. My only quibble is that it ","useful":0,"cool":0},"JJbChQqUgwaVWoJdieQyww":{"text":"I have been to Bayona twice now. \"It's good\" is the best way to describe it. If you are lo","useful":0,"cool":0},"uYvfLdNk6ifiK_O_6_gjeg":{"text":"After a lot of research, reading reviews, and seeing it on the list of most romantic resta","useful":0,"cool":0},"hDpSIxpiSz28e3M0EbQzTA":{"text":"Do I start by mentioning a rat on the garden patio during dinner hour?  Do I finish by not","useful":2,"cool":0},"JdXH3IhOvQQ0rG6YE5K-WA":{"text":"Wow! Absolutely Fantastic! We were in New Orleans for 3 days, and this was the best dining","useful":1,"cool":1},"VobGsVI6v67s-5Rtzkym9Q":{"text":"First off, this place isn't bad. It's just not good either. The whole time you feel like y","useful":2,"cool":0},"30i-6-fTl2_8b-SLC6NYuw":{"text":"Whilst wandering in the FQ, we decided to pop in here for fancy drinks. I remembered my de","useful":5,"cool":1},"EKSV1VEFQx78eMXyNQmPnw":{"text":"One of my top two restaurants in the city. Loved this place when we dined the night before","useful":7,"cool":8},"p8SI3Bx9Q_WX8cDKAMjkiQ":{"text":"Great food, average service, and overall Bayona is a restaurant I would return to.  The cr","useful":3,"cool":0},"yteAQNnBRCEVFJlDdDq-Cg":{"text":"Elegant and confortable restaurant.  Our lunch ($25 per person for any three small plates)","useful":0,"cool":0},"nxxGBPEWhuwWHzYcahR9VA":{"text":"\"OK\" food, number of yummy things but a lot of \"eh\" and subpar things also. Definitely not","useful":2,"cool":1},"pAZI9f-9m89R_B9ZJ1I1bg":{"text":"You can't go wrong here even if you tried, and I did try . . . very hard.  Our waiter sugg","useful":2,"cool":0},"Zjqsqs1HBt_UAzkzE9rP5g":{"text":"Good food but excruciatingly slow service.  Reservation was at 8:15, we did not get our en","useful":0,"cool":0},"L3PjLmlgaeYiEUe6Q8Yl3w":{"text":"For all the great reviews, I was very very disappointed.  \n\nMy hanger steak was poorly exe","useful":1,"cool":1},"DJ0yKEhtpLP8rZXGgOqYYg":{"text":"Amazing sweetbreads, and the goat cheese crouton is out of this world. The chef has an ama","useful":0,"cool":0},"Ku08zsh71pldJ_uS-qaveg":{"text":"We headed to Bayona because my friend knows chef Susan Spicer.  I would have never known t","useful":0,"cool":0},"7njSZeu9_ihKS4U8bHNm7w":{"text":"Not recommended, food is mediocre at best and the service is very bad. Took them 25 min to","useful":3,"cool":0},"PSXQqUEYJZeol9R53yJMeA":{"text":"Abstract: Elegant, delicious, and romantic. The food was inventive, fresh, and worth every","useful":0,"cool":0},"frIFFLFyfuq0fLjIEiuAPQ":{"text":"Not worth the money!\nWe had a LONG wait between our appetizer and main course, and for me,","useful":0,"cool":0},"Xh5tbm6ca_v2r8A7-9ojMA":{"text":"No complaints here. Great food and very quaint atmosphere. Service is great. The chef is v","useful":0,"cool":0},"tAWsSLIbrWElwk-RdmOsXQ":{"text":"We were here for the weekend with my girlfriends. We couldn't get a dinner reservation so ","useful":1,"cool":0},"be2cAyj1ipH8_JeAFG1XSw":{"text":"My wife and I had reservations for dinner here on our first night in New Orleans. We had h","useful":0,"cool":0},"3JB5uI-h8if3TNDgTyHOwg":{"text":"Never in my life..... the waitress came to our table maybe 3 times during a 3 hour dinner.","useful":0,"cool":0},"Vjya8oa3bE1rMZwLruKaZw":{"text":"My wife and I visited this wonderful restaurant last Saturday.  I had not informed her whe","useful":0,"cool":0},"fGv2z-lQINqdp1jwJweTng":{"text":"We choose Bayona for our first Honeymoon dinner in New Orleans and we left very satisfied.","useful":0,"cool":0},"mOLUwXSc8Wv-kY2WY-P3Fg":{"text":"Sweetbreads were very good as a starter.  The lamb was cooked well, as was the stuffed rab","useful":0,"cool":0},"ZlBsHLzBt1qsGrIRNVoB4g":{"text":"Excellent food and fantastic service. The waitstaff are knowledgeable and friendly. They m","useful":0,"cool":0},"fqqVMa2exrFMdnnVRhPQRw":{"text":"Bad experience! I find no pleasure in writing this negative review. This used to be a real","useful":1,"cool":0},"ptyWAjfJJzssNqVUVXBzJQ":{"text":"Charming little restaurant in the French Quarter.  \n\nService - The staff was friendly and ","useful":2,"cool":0},"LpdluqqLAJ2FGsqcWwJqfQ":{"text":"While visiting New Orleans on business I had the pleasure of dining at Bayona. The propert","useful":0,"cool":0},"ljBGrPCkdp2jMGxIYvYbLQ":{"text":"- Great space\n- Atmosphere was cozy and not too loud\n- Courteous and well paced service\n- ","useful":0,"cool":0},"205LZ66Lo05_9fQq_HMvmw":{"text":"A quick update to say that I have frequented Bayona for 8 years whenever I can while in th","useful":2,"cool":0},"4KjAYv_t1lsAXIXh5swBVA":{"text":"Love, love, love this place! Sat out in the courtyard. Had quail salad, lamb, mojitos and ","useful":0,"cool":0},"d1SsX1bT_NMviUoLcjCHfQ":{"text":"I dined here back in April and September 2009.  In April it was a 5, September was a 2.  M","useful":0,"cool":0},"Wb4eEkmYW443v9Lz78ysfQ":{"text":"Beautiful atmosphere and delicious food, but the service was awful. We had a 7 pm reservat","useful":0,"cool":0},"va69TxQgyxI385DW_Fx-cg":{"text":"Just ate there late Friday night and it was amazingly delicious. Great Bayona martini (wit","useful":0,"cool":0},"h1WrxeVfDS78S7Y8IHIocQ":{"text":"Poor waitstaff.  So-so food.  Very expensive.  Bland and completely tasteless.  Take a pas","useful":0,"cool":0},"bTJcbRclIPiEWcs18S9rMg":{"text":"We started the meal with smoked Mediterranean salmon, then the strawberry and grapefruit s","useful":0,"cool":0},"D1Y8Dp4Xbu-S6WVvKUM5rw":{"text":"Susan Spicer is such a nice lady! We went there some years ago with friends from N O. It w","useful":0,"cool":0},"AaNtGEPRDDgteQQ6UgrIXQ":{"text":"I have come hear many times over the years and have had some great meals. Tonight I have b","useful":0,"cool":0},"UDxR6VhYqGo7MiHK4ssHrg":{"text":"We loved loved loved this place!  Best caesar salad in the world. The fish dishes were per","useful":0,"cool":0},"PhtR3OZpxTdd5RGMx3F7YQ":{"text":"We had a spectacular lunch!  The Duck PB&J was complex and beyond delicious.  Housemade wh","useful":3,"cool":1},"Z0dHrm92L4iBgQ3NTrgIVw":{"text":"It was our 10th Anniversary and we opted for the pairings with the menu and it was \"spot o","useful":0,"cool":0},"5wQgyL-zH2JV5ehZcoJjGw":{"text":"One of the best meals I've ever had.\n\nGreat staff, incredible food.  Be sure to dress up a","useful":0,"cool":0},"3jiMFqjXWFyFCSn9yiXfMw":{"text":"I'm still full from last night.  Yes, it was very good but I wasn't blown away.  Maybe my ","useful":2,"cool":1},"BfNF9Kx75O06hBY-t4J7Zg":{"text":"We were very disappointed last night when we arrived at Bayona at 10:01 and asked if we co","useful":0,"cool":0},"HPFAWEYgwG-9Wrhk73DIqQ":{"text":"Best meal we had all week! Sat out in the courtyard - very romantic. Dress is casual to dr","useful":0,"cool":0},"z2MUl33XI29jW73oVE_cOw":{"text":"My girlfriend and I picked Bayona for our anniversary after having gone through a list of ","useful":0,"cool":1},"th9-tmEDwKzLJxK0faF2Ng":{"text":"Total 5 stars!! Amazing meal and service. The sweet breads are delicious! Everything is co","useful":0,"cool":0},"2VRQHh08T4nv7NquBhULkQ":{"text":"Excellent culinary experience!! Our party of 7 had the fixed price Saturday lunch, a three","useful":0,"cool":0},"3MFpzZX7_W4QpUoF2hPvfw":{"text":"Bayona was a great surprise! It had delicious food, great service, and fantastic atmospher","useful":1,"cool":1},"mCl_-9O-g3sArx5_y8LmZA":{"text":"Bayona is real classy without being pretentious, and it seems as though all sorts of peopl","useful":0,"cool":0},"xTPsSgrthtF5Ca3cDClYnQ":{"text":"Delicious Food! The lamb was exquisite.\n\nWound up here independent of checking Yelp, which","useful":0,"cool":1},"4FT-4D-t9ozgA3Vtp5Mf0g":{"text":"3/26/2012     After Oysters at Bourbon House and dinner at K-Paul's we walked over to Bayo","useful":0,"cool":0},"5HCAfBgErX4Y_JowJz6m3w":{"text":"This quaint little restaurant is my Dad's favorite New Orleans establishment, so we decide","useful":3,"cool":0},"7Hi-80xo8H8Po-Pf4qVOcQ":{"text":"We stayed at the Dauphine Orleans, and would walk by Bayona each day at least 2 or 3 times","useful":3,"cool":0},"Sk6nxA2dDgaiSUTt8_dUug":{"text":"Overall ok - but lacked service.\n\nHad reservations for three.  We arrived 30 minutes early","useful":0,"cool":0},"z1BSlOZXmJG7nqdlrHtI0w":{"text":"DISAPPOINTMENT. \n\n2 Stars for the food\n\n3 Stars for the service\n\n4 Stars for the vibe\n\nOn ","useful":1,"cool":1},"WvgdFPXNjxVmqYTTl1rPJw":{"text":"Bayona was amazing.  the food was classic and unique.  flavors were out of this world--ama","useful":0,"cool":0},"XuSp295fxCmYZ2Dp6OT9RA":{"text":"DO NOT EAT HERE IF YOU EXPECT TO FINISH IN DINNER IN 2.5 HOURS!!\nOur group had a 7 pm dinn","useful":1,"cool":0},"l7-xAaFjGILFFkb5nH0kzg":{"text":"Looking for a romantic evening to eat a fine meal in an outdoor courtyard? Look no further","useful":0,"cool":0},"pDWxsPrUqP-54Rs-wN6DaQ":{"text":"Had a great time recently at Bayona.  We were entertaining my dad and his wife and this el","useful":0,"cool":0},"_laG5GGBlRv6IOYNtO4N6g":{"text":"I am a native New Orleanian who has been wanting to try Bayona for a long while and finall","useful":0,"cool":1},"JKO7m4psLDhbAeJDAEzJAA":{"text":"Susan Spicer has long created exceptional food, and though some chefs' complacency allows ","useful":0,"cool":0},"YzbA-6f31uXM6BamkXqsvg":{"text":"On our first visit to New Orleans we dined at Bayona based on a friend's recommendation wh","useful":2,"cool":1},"pi8zVMetXnfpQGCDHR_e1A":{"text":"Ate dinner with work colleagues. Able to get last minute reservation. Although I don't eat","useful":0,"cool":0},"rjbvy0W4gWg25rTkDC0uQA":{"text":"My favorite restaurant in New Orleans.  The food is out of this world and they have a very","useful":0,"cool":0},"a6HVDVk-glDd81wwKgG7_w":{"text":"So, we have lunch here on Halloween and our waitress is dressed as a cat and meows...Now, ","useful":1,"cool":2},"srSo9e7EP89tJnkJc7LYzQ":{"text":"My husband and I celebrated my birthday here. The atmosphere is intimate, charming and rom","useful":0,"cool":0},"Kpj78RgGtGU8BmtWLWEm3A":{"text":"I trusted this restaurant with the celebratory meal for a major life event, and I was extr","useful":4,"cool":1},"DI7mIOmY3I9p8wvv_5yHmA":{"text":"I haven't been to Bayona since the fall, but I've recently been broke-as-a-joke and dreami","useful":0,"cool":0},"67RnBYxXe8NLxfz2-TxOGQ":{"text":"My husband and I went to Bayona's for lunch. We got the anniversary special which includes","useful":3,"cool":0},"VGo28yEV0ePk4gY5j9gI-g":{"text":"A quiet, elegant and romantic restaurant in the French Quarter a bit off of the beaten pat","useful":0,"cool":0},"HSueHy1tdANEf4wkoY7dgg":{"text":"Had a great meal and great service!  If you are in a hurry let them know and they will acc","useful":1,"cool":0},"5QAmXFKMqxGroxi2iVyWbA":{"text":"I have been a Susan Spicer fan since she was at the Bistro(23 years ago). We were at Bayon","useful":0,"cool":1},"2pYZ_-R1gpiMQVHZlyst-g":{"text":"Upscale, beautiful courtyard in the French Quarter. Nice place to take business clients or","useful":0,"cool":0},"xXLBqgFFosRqC2K8MmMEnQ":{"text":"A must try!  Let me start out by saying I have been coming to this place for years and nev","useful":0,"cool":0},"AcpYLVhJewTZ0jC0u01scQ":{"text":"Not knowing what to expect, we were smitten. This place feels like walking into a classy e","useful":0,"cool":0},"1puqAW8WjwqZ_wZxBTwXoA":{"text":"While planning our trip to New Orleans we saw this restaurant was across the street from w","useful":0,"cool":0},"bJoM-ISLmIxCpWgaKliURQ":{"text":"We had a lovely brunch on a sunny Saturday afternoon.  The three course menu had something","useful":0,"cool":0},"GxNTpiORGiyn3aKXp7mHYw":{"text":"Oh Bayona, I love you so much.\n\nI pick this as my meal before I die, if I am so lucky:  Go","useful":3,"cool":2},"YFL2Ynlf89J-U4wAAUGHcw":{"text":"Worst service I've ever had at a restaurant this nice. The food was amazing but I can't re","useful":1,"cool":0},"YOPAuAjGkCWo4U9owwY9Qw":{"text":"The hostess said as i put on my blazer in th 100 degree weather \"honey, you don't have to ","useful":0,"cool":1},"1n0OhDKMTYLrzsuraF4Npw":{"text":"Chef Susan Spicer finds ways to showcase local foods/ingredients in her culinary creations","useful":0,"cool":0},"BP9p8f8uHwvoY-edb47twQ":{"text":"I am a local...a local foodie....who on an absolutely beautiful day in nola went to bayonn","useful":0,"cool":1},"4V8kQMK3p1n4JS0VmjoK0w":{"text":"So the deal here is \"slow dining\", which in theory sounds like a good idea but also could ","useful":1,"cool":1},"SjG6WvEwbFOSdAdhccbtMw":{"text":"Our waitress came to the table like a bull in a china shop-- she also kept referring to pe","useful":0,"cool":0},"eJNyd9ySVfqzowikJjx2Og":{"text":"During my trip to New Orleans, I really wanted to go here because of the garlic soup.  I'm","useful":1,"cool":1},"O3qiRWOAUkSVawmVLJ5TJQ":{"text":"Disappointing experience. Arrived 5 min early for reservation and was directed to sit in w","useful":0,"cool":0},"BIzYlavBTivAPQfyBr2AiQ":{"text":"Perfection. We sat on the patio on a beautiful evening, had attentive friendly service, an","useful":0,"cool":0},"NycrR_0PlmBhGxHS-r_7gg":{"text":"Not sure how I feel about this place- the menu is expensive and portions are small. Even t","useful":0,"cool":0},"mF65OoOcCMnstUI_qEWgNg":{"text":"On the edge of the French Quarter this quiet  place is impressive. The service and food is","useful":0,"cool":0},"8G_tUYj_S3PbJ-2s8kCpww":{"text":"Eaten here twice, and both times the food and service was exceptional. The wine list is cr","useful":0,"cool":0},"980yf04EkwU81YKJMTq7FA":{"text":"It's been many years since last visiting Bayona. Back in the day, it was on the front of n","useful":0,"cool":1},"Pn193yl207DdBBr8uI29eQ":{"text":"We happened on Bayona by accident. It was barely noticeable from the street. We were there","useful":0,"cool":0},"HRmIRTNr02_gdyjb3rQwQw":{"text":"Went to Bayona for a business dinner.  We ordered every appetizer they had available and s","useful":0,"cool":0},"D-2O05maXOe0Svnde1JQIQ":{"text":"Ambiance and service was phenomenal.  Food was good.  Loved the quail salad and the lamb. ","useful":0,"cool":0},"i9MZOXinrHiewuZjl17d-Q":{"text":"This is one of those place that had fallen off my radar for a while but I had been meaning","useful":1,"cool":1},"u3uHFlJm_R-nzijNWA1iBA":{"text":"This restaurant never disappoints.  It is always outstanding. The service is impeccable, t","useful":1,"cool":0},"kWPz2dHabkvPazTTIoOAiw":{"text":"I choose this place based on some reviews on yelp as well as other services. The restauran","useful":4,"cool":5},"5cXns2iOeabdx5IE5hXBlQ":{"text":"Wonderful meal with a delightful, funny, unpretentious wait staff. The crispy Quail salad ","useful":0,"cool":0},"xYqApupusU5MNpayyNyuiw":{"text":"Okay, first I was not too impressed.  Maybe I am spoiled by the fantastic dining of my hom","useful":0,"cool":1},"YgS8HEYHHULZgxVjzlr5LA":{"text":"Totally overrated. Mediocre food--about at the level of a \"good restaurant\" in a small or ","useful":0,"cool":1},"l36NRosl--sJ2kO-op5RRw":{"text":"We had a very disappointing experience here- celebrating our anniversary on Valentines Day","useful":3,"cool":1},"qq73piZWiydYphfRcb26Hw":{"text":"My husband and I come here at least twice when we are in New Orleans on vacation.  The ser","useful":0,"cool":0},"Oeevh1dfr7zg3yP1IgMwjQ":{"text":"We enjoyed the summer coolinary menu here..:...wonderful Susan Spicer menu at an August su","useful":0,"cool":0},"H-gK8m_1yg_BkHjPQe4sPg":{"text":"Amazing food. Everything , every little detail and every single  ingredient was just cooke","useful":0,"cool":0},"JN80efyv4r1M-V9nanPqpg":{"text":"The food was very good (otherwise I would give 3 stars). The service was very awkward and ","useful":1,"cool":1},"YGgUeDHQmiLb1EacE_iJEQ":{"text":"I was in New Orleans for work-related reasons last week and went to Bayona with colleagues","useful":0,"cool":1},"5u45RnkhEWlHFKPp8r7kww":{"text":"Beyond expectations on lunch.  They don't have wait staff but quick friends.  How can you ","useful":0,"cool":0},"rPCWqTpfkIdaLSd-poJFXA":{"text":"Food was great, servers were delightful, but we had to wait a long time between courses. A","useful":0,"cool":0},"zjPvTO21r7FSQ6Quyr1gLw":{"text":"Visited Bayona for the first time for my friends birthday this past Saturday. Overall had ","useful":0,"cool":0},"sR8XChBmbx_BYR5ix-CHxQ":{"text":"I have had the fortune of going to New Orleans quite a bit on business over the past few y","useful":1,"cool":0},"O0Q07ssQO0Ec8mLlrn28MA":{"text":"My wife and I visited Bayona and were not disappointed.  We arrived at 8 pm for 8:30 reser","useful":0,"cool":0},"vJhUAh8nvWrsfE0dO86GxQ":{"text":"I was set to experience NOLA cuisine in true form when I decided to visit Bayona for their","useful":2,"cool":1},"e0qbBrPEPNnJqLr80wCv1Q":{"text":"This might be the lowest rating I've ever given anywhere. I want to give no stars, but as ","useful":5,"cool":0},"9518HiZLqk4b8x9LCMorcA":{"text":"A good restaurant, but definitely not great. My expectations were pretty high after going ","useful":1,"cool":1},"ba1fcFGX1iPDRTVzjY2irA":{"text":"The setting is lovely, effortless, and elegant.  The sweetbread apps were delicious; the d","useful":0,"cool":0},"3VEK8FSWjvBtZLpRUJLCGA":{"text":"The succulent rabbit w/ cherry wild rice and mashed potatoes are what culinary dreams are ","useful":0,"cool":0},"RV1UGRJbJLO67L_lC4XwVA":{"text":"Everything was delicious. It's a quaint little place with charm and old world. The shrimp ","useful":0,"cool":0},"ga2rACiJF4n0xUK_e09JvQ":{"text":"Wonderful service.  Food is excellent, but you don't need to travel to New Orleans.  The m","useful":0,"cool":0},"ULxGkTJA1OSkZpvcNpZUpg":{"text":"This place is wonderful! This is the restaurant I like to bring visitors from out of town ","useful":0,"cool":0},"8SDB-hjLmS4-hDMzjHqseg":{"text":"I would have rated this place higher had they had a better selection for vegetarians. That","useful":0,"cool":1},"jdR6qWwhB_hnEtlA7x-DwA":{"text":"This was absolutely delicious. Delicious cocktails, entrées, and deserts. Came here with c","useful":0,"cool":0},"O8RDAT89_R_aL892Bl0lMg":{"text":"Everything about this experience (business dinner) was amazing.. the service (and in parti","useful":1,"cool":0},"nS159939Upe2BWX-BVn6vQ":{"text":"I have been to Bayona twice! Once 5 yrs ago & more recently last friday 9/9/16 for dinner.","useful":0,"cool":0},"kDu1yY9IfPp4zrvAD7BC0Q":{"text":"Bad all around!  Our salads were nondescript, over dressed, and flavorless except for the ","useful":1,"cool":2},"yo3ltkaO1BufXjdrhjQV_w":{"text":"Consistent wonderful food that they happily custom-make to accommodate allergies.  We brin","useful":0,"cool":0},"7wM4a35ks0w3Bxgf0gHp0w":{"text":"Crowded. Noisy. Slow service.  But I don't care, because this was a fine meal from beginni","useful":0,"cool":1},"NDkGBsUTu5M1z3h1DMbzcw":{"text":"Went for dinner last night, first stop on our trip to NOLA...service was outstanding, Jaso","useful":3,"cool":0},"--5bDnuK7eaNqij1FHu3AA":{"text":"Visited New Orleans for the first time just after Mardi Gras 2010 (missed Mardi Gras on pu","useful":0,"cool":0},"73j2fQ0m1a9pg67Ys4TmFA":{"text":"no question here. had a friend come into town and lucked up with a table on the second sat","useful":7,"cool":4},"i1jIPS-AHUiRJyNyuusMtw":{"text":"Great food and wonderful experience a not miss!","useful":0,"cool":0},"Z0X3smCizy5sZV9EA-_gVQ":{"text":"Went for my SO's birthday. The crispy quail salad was good, though the quail seemed a touc","useful":1,"cool":0},"xTEhLqduk83cPN74AL1gwA":{"text":"My wife and I visited Bayona to celebrate our anniversary and had a wonderful time.\nThe re","useful":0,"cool":0},"Ugs8gtZ1GRnIjRU2zUk2pQ":{"text":"I had eaten here before years ago and the food was excellent both times. However, this tim","useful":0,"cool":0},"Fzhn-s7Id2sPI-FO_oVARQ":{"text":"Bayona is one of New Orleans' great restaurants. It's been around for so long (20 years?) ","useful":5,"cool":4},"EVV5LQ75Swqt8nHKvfHnbQ":{"text":"One of the best meals I've ever had.  Fantastic patio seating, impecable wait staff.  If Y","useful":0,"cool":0},"Dfe_DtS-XEdXdTlNamlvgg":{"text":"The small plates for weekend lunch were fun and I was surprised that I left totally full. ","useful":0,"cool":0},"Es2Dt4eieS8fPnuNZ75QKg":{"text":"Unbeatable lunch experience.  $25 three course meal app,entree,dessert but you can choose ","useful":0,"cool":0},"j2_Vu7sjw0tn1IB3h0nJsw":{"text":"A visiting diner at our favorite sushi place, Akiko, told us about Bayona and said we need","useful":2,"cool":2},"e_iFSV8dEONI-LSVu-lOag":{"text":"This is by far the worst dinning I've ever experienced in my life. I honestly have been ma","useful":1,"cool":0},"l2-vCLBvD8EMlfZe27OVFA":{"text":"Fabulous! Simply fabulous. Great location, beautiful building and atmosphere. Service was ","useful":0,"cool":0},"PIWs-3npIt5iSq8DhUBOmg":{"text":"Filet melts in your mouth.  Setting is pure French Quarter charm.  My hubby proposed to me","useful":0,"cool":1},"mvHogbaPPxI7yEzyS2U5KQ":{"text":"One of my favorite restaraunts in New Orleans.  Food is consistently good.  Romantic setti","useful":0,"cool":1},"pRHFkGuyeHoIETVSe2Ekmw":{"text":"We were lucky enough to pick the right time to try this restaurant!\nFor the Saturday lunch","useful":0,"cool":0},"NWQ4LfDslXj44LC4pH-HVg":{"text":"Hands down best meal I have had in NOLA.  Its a tiny little cottage style restaurant with ","useful":0,"cool":0},"-t9rO9jhcaVE-UQUfEeutg":{"text":"Bayona is in the heart of the French Quarter but off the beaten path. We had 3 of the star","useful":0,"cool":0},"Kk_CTJ_-u4eIXMGBseuWbA":{"text":"The food here rates 4-5 stars based on imagination, taste, presentation. The courtyard amb","useful":0,"cool":1},"MfAPLTm18Vd0ojJlWyr15g":{"text":"Bayona is the most beautiful restaurant in NOLA (5 stars all the way), but the food was no","useful":0,"cool":0},"hzjp3TtGKaSHx9PhqvlqpQ":{"text":"Food and service were fantastic! Sweetbreads were delicious, from someone who had never ha","useful":0,"cool":0},"1Iu179yykzW-DGHNflSzJg":{"text":"Horrible service by pretentious staff overshadowed the wonderful food. I rarely write revi","useful":0,"cool":0},"XdXj8tAyBSAE0I7HsGD7xw":{"text":"Look further. If you can deal with the very tired and dated decor the food is nothing wort","useful":0,"cool":0},"CQGJ3PU4ny60-_qGolKriQ":{"text":"Wow, what a disappointment.  Service was the worst I have seen in many years..   Totally i","useful":0,"cool":1},"a_kWSeV4wOqKqQr3yhQ68g":{"text":"OMG..This place is the BEST!!!\nThe menu changes daily, super fresh ingredients, awesome se","useful":1,"cool":0},"0kwciQ84sabLgyL124YqoA":{"text":"Awesome experience at Bayona last Saturday.We had to do early (6:30) reservation time,buit","useful":0,"cool":0},"tskxfip1RUbjn02pIR4BeQ":{"text":"Excellent dining experience. Make your reservations well in advance.  If the weather's nic","useful":1,"cool":0},"ro6-N13PhS41HS4xjeH__Q":{"text":"How is it that I'm a native and have never, in it's almost 30 years, been to Bayona?\n\nWell","useful":3,"cool":1},"J8ur9gUZZq6vvKasBslwbA":{"text":"\"Regarding the Smoked Duck Cashew-Butter Sandwich, it may be the single, greatest sandwich","useful":2,"cool":2},"ndxDeh-s4RqyOtyPrNs9og":{"text":"The acting manager handled an unfortunate accident by the waitress in an incredibly inappr","useful":2,"cool":0},"2B8bAeva85luTiCOEglTsQ":{"text":"This was my best meal in New Orleans and if you've been to New Orleans you know that is sa","useful":1,"cool":1},"38g2sOpoJ2E5kqod5AGhIg":{"text":"Wonderful lunch!  The restaurant is beautiful and while in the quarter, is a short walk aw","useful":0,"cool":0},"ZFqASur4sFtAJ_kmno05bg":{"text":"My favorite restaurant in new orleans and I've been coming here for years. I don't say thi","useful":0,"cool":1},"etvGzWJTPghSw1tl_5diyw":{"text":"we make it practice to dine at Bayona during our frequent visits to NOLA. as usual, Bayona","useful":0,"cool":0},"WQ7ScS0XUfTkHsT47cZJ_A":{"text":"Bayona remains at the top of the list for great restaurants in New Orleans. Half of the me","useful":0,"cool":0},"jeXLAkqOXak0aSqe0lC4PQ":{"text":"Arrived at Bayona with my girlfriend Monday (yesterday) at 8pm. Was told our table would b","useful":0,"cool":0},"cInpEz4-IKYr5Zazh_FNuA":{"text":"We came from Los Angeles with a party of 6 for our friwnd's birthday. Kristen and Sarah we","useful":0,"cool":0},"i7VHGP6PoBnZ3M4KsVWVdA":{"text":"I have dined around the French Quarter, and this was the first overall amazing dinner. The","useful":3,"cool":2},"aRqchTKS1NuQ8ZOGVQb1HQ":{"text":"I stopped in here for lunch based on coworkers recommendations and the television show The","useful":0,"cool":0},"xAoA9PB7ixrx2Awk_7PvTA":{"text":"Awesome all around restaurant. Was in New Orleans visiting and this was by far the best me","useful":1,"cool":1},"vJw7yIjSu96zsRF0kT7FdQ":{"text":"By far the best dinner in NOLA that I've had ever. Bravo Chef Susan. The balance between t","useful":2,"cool":1},"dnPuxH8mAGRK6Wrmxslsdg":{"text":"Very unique atmosphere.  Intimate.  You will miss it if you don't know the address.  It is","useful":0,"cool":0},"GlPG-FktztIdVXfVFteJLQ":{"text":"We'd gone out earlier in the night for a light dinner/happy hour because friends could onl","useful":2,"cool":3},"VBsKxBs9H-fpfImmE9ViVg":{"text":"Per usual I was invited to a fabulous Coolinary dinner by the fabulous Lyn Morein, the man","useful":2,"cool":0},"kCJgvcOKJAvTFZJ5aRyBZg":{"text":"I have been to this restaurant two times\nMy complaints and setbacks really are the fact th","useful":0,"cool":0},"6bJoSuMKSBadfW5hpumTdg":{"text":"My wife and I went to Bayona on one of the last nights of a week long trip to New Orleans ","useful":0,"cool":0},"fQZXMR3d0P__0TgCI348yg":{"text":"Bayona has been around a while and isn't as \"sexy\" as some of the other new options in tow","useful":0,"cool":0},"U6SMV7d55ORcdvzabPeaCg":{"text":"Stop and Read: Don't pay too much attention to the bad reviews. This place was beyond grea","useful":0,"cool":0},"G-7LRSeT2--SSzD0TG-Dog":{"text":"I'm writing this review to say how delicious one appetizer was, it was the best appetizer ","useful":0,"cool":0},"Ure41sw0_WoaLVBVTFSzJg":{"text":"I did a lot of research trying to pick the perfect place to celebrate my boyfriend's birth","useful":5,"cool":1},"7n9JtBHB9zi1qIQq0s7ESA":{"text":"Night three in New Orleans - had a busy day of talking to too many people so I was happy t","useful":0,"cool":0},"aDTDG-wdnUq2t-xlqBOAnA":{"text":"On my visit, food was just ok, service was terrible. \n\nWaiter's were non attentive and ver","useful":0,"cool":1},"lX0McLsbYBZm3nZg_sBK7g":{"text":"Oh, nothing like August in New Orleans. The heat, the rain, the humidity. Why do I visit i","useful":1,"cool":1},"MapWLR6Oppg9dlkAx3RIdQ":{"text":"Bayona is a solid restaurant that I will definitely return to.  Many of the dishes have a ","useful":0,"cool":0},"inGy53FwTrrRgLD35acnGw":{"text":"A extremely beautiful restaurant. Amazing food. We had the buffalo quail, then the beet sa","useful":0,"cool":0},"sgPK-A41lYnC9vv8NO1bBA":{"text":"We had a very nice dinner there. It is a small quaint place with allot of character. The s","useful":0,"cool":0},"3EP8IbpG3TCcDT93UYt50A":{"text":"Stellar lunch experience! Cream of garlic soup was rich and delicious. Salads and Wild Flo","useful":0,"cool":0},"nUjACruQv3G-7NPRRAgBVw":{"text":"I would've given it 5 stars if it weren't for the mediocre service.  Food was incredible..","useful":0,"cool":0},"qqIlSsBs0tXS71u32Lu0wQ":{"text":"For most of us, this is a special occasion spot, but by no means a bank-breaker.  \nIt's a ","useful":0,"cool":1},"l5My2vX11e8Xm_l9AJcxHg":{"text":"Slow service:  Waited over half an hour after our reservation time to be seated.\nAppetizer","useful":0,"cool":0},"aWEn4NMkXDa69PYkuyxllg":{"text":"When in New Orleans your trip is not complete unless you eat at Bayonas . Garlic soup a mu","useful":0,"cool":0},"Z5Sstfv0hb4GfgnTGZpE_A":{"text":"We visited Bayona for a honeymoon dinner based on a litany of positive ratings we read onl","useful":2,"cool":1},"nIdWRKouDG02AGVB46CCAQ":{"text":"The food is tasty, service attentive, cocktails well-mixed, and the courtyard a lovely, ca","useful":0,"cool":0},"x7-g3iOD2rhvqc06dmCpcQ":{"text":"Had a great dinner appetizers where delicious \nI ordered the scallops and the waitress sai","useful":0,"cool":0},"SbO0RF8BuMPT0KTiEhgssw":{"text":"A perfect evening before Hamilton at the Saenger.  Sweetbreads, eggplant caviar, peanut so","useful":0,"cool":0},"qjV17ZhHl7bgEqwt9-fDkQ":{"text":"Very disappointing.  One of my close friends raved about Bayona, so we were anxious to go,","useful":1,"cool":0},"vM-1Tnpod7UxTAu8WU5W3A":{"text":"Where do I start?! \nThe kitchen or the staff? \n \nNew Orleans has a lot to offer as far as ","useful":0,"cool":0},"Sd4g_f426W4H7Xkq8I7K2g":{"text":"Susan Spicer is one of my hero's! I've been to Bayona a couple of times, once in the \"off\"","useful":2,"cool":1},"SYTdxdknyo-MQzk2WzahnA":{"text":"This was underwhelming. The wait between courses was ridiculous. Even to get a drink took ","useful":0,"cool":0},"wc0Hv3YhpuLE5reMxspc-Q":{"text":"The ambiance was great. The food was very good but the waiter we had may have been the big","useful":0,"cool":0},"6AB8gx6qY5FDePpWKobyqw":{"text":"Horrible, Horrible service. Staff was rude including the manager. Wouldn't recommend to an","useful":3,"cool":0},"5AnXPXivFTcm_QUFgt_mog":{"text":"This place, the chef, the ambiance was wonderful. My friend and I came in town for a confe","useful":0,"cool":0},"6RyIs_2U8rENLA3j0n_mQg":{"text":"Dinner on Saturday last Saturday night was an experience.  Being from NYC, I cherish the N","useful":0,"cool":0},"ocNHtrJB81zR9xrYIy5rJA":{"text":"Everything we ate was yummy!  Duck, lamb, steak, and tuna...can't go wrong at Bayona!  Try","useful":0,"cool":0},"jqxU2dvfNK64uU9k4xZ-IQ":{"text":"This was our 3rd visit to this delightfully charming restaurant and yet again not a disapp","useful":0,"cool":0},"af3I4Y5wolVpULuX5vxY9w":{"text":"The starters didn't wow me, but everything else was absolutely five stars. The service is ","useful":0,"cool":0},"zyGAJ7O5sES5Igakce0K2Q":{"text":"what good does it do to leave a review if Yelp censors it b/c Bayona pays them off ? This ","useful":0,"cool":0},"lNpmTeOEo73EQo4DbxOC_A":{"text":"Last year we wanted to eat here but it was full and we ran out of time so this year....we ","useful":1,"cool":0},"N7FYuh5RdQCN6y3mbd5wXw":{"text":"In plain English: Food was fantastic, service sucks.   \n\nAppetizers were fantastic, main c","useful":1,"cool":0},"ptw3u0Som074d-9qygFjsg":{"text":"Our night at bayona started off bad when we arrived five minutes early for 7:00 reservatio","useful":1,"cool":0},"kNncTijC5RepgdgKTd9Q6w":{"text":"Bayona is a Cattle call.  \n\nWe were seated in the upstairs wine tasting room with a window","useful":1,"cool":1},"R4f4eUUNpYK8n97_rc-AGg":{"text":"(Dec 2011) Fantastic experience, the veal and the rabbit are highly recommended.  And the ","useful":0,"cool":0},"8qiiGCHDLj6IsxGjULHQAg":{"text":"We went for coolinary menu which was fabulous! Sarah and Niles were a wonderful team! The ","useful":1,"cool":1},"MDYihSXKSFoJdySslQNtEQ":{"text":"Incredible! Everything from the service to the food and wine suggestions were done perfect","useful":0,"cool":0},"Pg5HdV8gr1iuO6-TSdok1Q":{"text":"Went to this restaurant for Valentine's Day and am extremely disappointed. This quality of","useful":1,"cool":1},"P-MzR1LeksdL6PIYz3RnNg":{"text":"For so many good reviews, you can give this place the old SKIP. Caesar salad was bad, thos","useful":0,"cool":0},"Gm8gln0jSE6ZtWmXE5AKBQ":{"text":"I dined at Bayona and the food was pretty good. However the night turned bad when I went t","useful":1,"cool":0},"6MvOGDvVYYWerrsQlGuTPw":{"text":"My boyfriend and I had reservations for 5:30 on a Saturday night. We were seated promptly ","useful":0,"cool":0},"_pwcCrKz-hhrNhGLephDJA":{"text":"A quant & elegant cottage like restaurant by famous New Orleans chef Susan Spicer with an ","useful":0,"cool":0},"u9wgxfF2OpLMElw24G4hBA":{"text":"Wow. Just wow.\n\nHighlights:\n\nGarlic Soup. This was fantastic. The description does this di","useful":3,"cool":1},"cbimnuofaHZ1wZSY8ENVvA":{"text":"Bayona is one of my all-time culinary highlights. The setting, the staff and the food was ","useful":0,"cool":0},"VOM0AXMbnadSXct195nYWA":{"text":"So pleased to receive a recommendation for this gem here in New Orleans. Our first time he","useful":0,"cool":0},"Nisxx_J5B5JDrNUd01xgxQ":{"text":"Food was ok. We were a large party  took  10 mins to get someone to take drink orders then","useful":1,"cool":0},"1AwBbkOwglYOcc_pGzNu9A":{"text":"Unfriendly hostesses.  Tables too close together.  Waitress literally shoved into me and d","useful":0,"cool":1},"rzMY2xNB7pitik67HgeOHw":{"text":"Fantastic restaurant. Best one in new Orleans. You have to try the shrimp with bean cake. ","useful":0,"cool":0},"6OIRpF-M7FXTm438SMrhww":{"text":"We had the small plate lunch, and the experience could not have been better.  We sat in th","useful":0,"cool":0},"5JpPIJmoCjBmTLi8uc2EvQ":{"text":"I ate there twice this week because the food and service was so well done! Ask for Hector,","useful":0,"cool":0},"ic-6ucdTU8id01u3M3DdcQ":{"text":"Pro: Beautiful restaurant, friendly staff, panna cotta dessert was incredible, lamb loin w","useful":1,"cool":0},"ZXmQgGgKGgzshgNaG-hkog":{"text":"Bayona was certainly a wonderful treat in New Orleans. Prepare to splurge and be very plea","useful":0,"cool":0},"uVld9gbbUuDxWj9m-TapUw":{"text":"This was our first stop on our trip to New Orleans for Jazz fest this year.  Had a reserva","useful":0,"cool":0},"7OAqiNFZ2tGIYGeAIxl1yA":{"text":"Really disappointing - went 10 years ago and thoroughly enjoyed, tonight a lot to be desir","useful":0,"cool":0},"xs0vRRTIvFuemM7Cu8PPBA":{"text":"Best sandwich in New Orleans is here!!!! the duck, almond butter and pepper jelly sandwich","useful":0,"cool":0},"Z0O4dnFj1TOXINTx-AP0kw":{"text":"Bayona has been on my bucket list for TWELVE years! Thanks to a concert planned during the","useful":7,"cool":5},"4LZlmEKpA0RlUD68vegTHg":{"text":"Charming ambience, welcoming staff, fun and delicious food and wine--what can be better?  ","useful":0,"cool":0},"DlDKHAkdREGjTq6E4uEbTQ":{"text":"Excellent service, all four of our entries were amazing ranging from salmon, pompano (fish","useful":0,"cool":0},"Gh6It83aKQUaZUCh5qE3ng":{"text":"Disappointed.  Out of the gate, I got told that we couldn't order an appetizer until we we","useful":1,"cool":1},"8E534v4bTM1gGtMr0bCeNg":{"text":"Service was nice. Duck and fried rice was Asian and just how it sounds. It was good. I don","useful":0,"cool":0},"rH0FRbF8BYKu0ZIoEZbupA":{"text":"Pricey dinner, decent food but nothing to write home about.","useful":0,"cool":1},"aH7gdxpg_t4aURpbl7yoSA":{"text":"When what I remember from a meal is the subpar service, that's not a good sign.  \n\nBayona ","useful":3,"cool":5},"3BxszaSG0C3esjUaSO4tlA":{"text":"Items Selected:\nIced Tea\nPickles and Garlic\nSweet Potato Brioche with Maple Butter\nGoat Ch","useful":7,"cool":5},"oskjrejVLK15vZeVefMwHg":{"text":"Outstanding dining spot! \nService started out a little shaking but ended up exceptionally ","useful":0,"cool":0},"DfjxdSIbCpDSN_hsvIKoiA":{"text":"Simply amazing, one of the best meals I've ever eaten. I had their signature lamb dish, ab","useful":0,"cool":0},"48fZOaxDX-6XxTPCraac9g":{"text":"I had heard about Bayona from a friend and couldn't wait to splurge and go there on our tr","useful":0,"cool":0},"MLA0qjOQB39yeZ9QrJi5FA":{"text":"Ya'll.\nI'd be lying if I said I did not stuff my face FULL of all the goodness Bayona had ","useful":3,"cool":2},"rMu-omJgxiRXsc3DcgkzDg":{"text":"Awesome upscale, chef owned place! Great cocktails and wine list. Service very attentive.","useful":0,"cool":0},"69rOlAU26uv8TX0YpmeKTQ":{"text":"A lovely evening with highly highly accommodating staff. The entire meal was perfect with ","useful":0,"cool":0},"JiHJt3hRYXmftNhtUuDnMg":{"text":"Wonderful dining experience on 12/6, after not being in the restaurant since prior to Katr","useful":0,"cool":0},"dcU3iNaQRi-4bVYhBTLNOA":{"text":"If you're looking for great atmosphere at a more upscale hideaway from the bustle of Bourb","useful":0,"cool":0},"tvLhexoEQ4V19MvbdwyPwA":{"text":"It was just OK. The food was fine. Nothing that special. The low rating is mostly because ","useful":0,"cool":0},"myzTqcPw35AYbQ_YqqVgSg":{"text":"BEST SERVICE and the BEST Salmon I have ever eaten.  Shannon and Whitney were so incredibl","useful":0,"cool":0},"6ALDA1a4JlB1_qQ-qrIuWQ":{"text":"We went to Bayona for Valentine's Day. However we were not informed it would be a prix fix","useful":2,"cool":0},"hKwD0I30Crb_s9nCYmEvSw":{"text":"Our family of 9 arrived in New Orleans and wanted to start the vacation off right with a d","useful":0,"cool":1},"apLYP2gZdPqaXxshBChJYw":{"text":"Bayona is a quaint cottage- turned- restaurant located on a relatively quiet street in the","useful":3,"cool":2},"fK3AsAkMaOh6kaB7YY4xkA":{"text":"This place was very nice. Great murals painted on the walls and good location. \n\nI had the","useful":7,"cool":3},"R8Z_uMX0USShKkYrx1liOQ":{"text":"So in the light of day my former love looks a little older and none the wiser.\nI have been","useful":4,"cool":2},"37eoLfQG07tzsYvt421nkA":{"text":"One word: Mediocre.\n\nThis place was talked up by Yelp, articles, and friends as one of the","useful":2,"cool":0},"FNWlcmNE8se56rcX8c6cgw":{"text":"If I could give zero stars I would. The staff was extremely rude, our food took almost 3 h","useful":4,"cool":0},"jFAYW_jTf69cK7d2EpG6ig":{"text":"Amazing food and service! Sat outside for a romantic evening. Best part of my stay in NO.","useful":0,"cool":0},"ltGlgdCESGW4H0Lo3cMgZg":{"text":"Plain and simple, one of my favorite restaurants in the city. The food, service, and atmos","useful":0,"cool":0},"ElyNjf7Q90pCmVrIOrRvsA":{"text":"I really can't give an up to date review because I haven't been to Bayona since 1999. I fo","useful":0,"cool":0},"zOtBR6bS7Egepreapo7lGg":{"text":"RUDE, RUDE, RUDE, CHAOTIC AND WEIRD. Last Saturday evening I was there with a group of bus","useful":1,"cool":0},"3nkG_flJvfNtxipauAdokA":{"text":"Cute dining room of a well-known female chef.\n\nFood: 4, Atmosphere: 4, Service: 3.5\nCost t","useful":2,"cool":1},"_5DMXu0VXhEWH_oI8olFvg":{"text":"Rude service. I mean, at times aggressively rude about a long wait for entrees (we complai","useful":1,"cool":0},"Fan6qs8_XpDOk1Z8uxQHvw":{"text":"bayona pays yelp to censor out any bad reviews.... overrated and not very good. My first a","useful":1,"cool":0},"GD9Ejqb6HevMG0VvmX6jMA":{"text":"It was our last night in NOLA, and I wanted something special.  This was a fantastic dinin","useful":0,"cool":0},"wRbexxuJRxrYJCjCfjJAMQ":{"text":"So weak, I can't believe that my most expensive meal was the least satisfiying.  Don't bel","useful":2,"cool":0},"sKeU1VnVkC53Zcufl2wEYg":{"text":"Came here for my wife's bday dinner on a weekend get away to NOLA. Food was very average..","useful":0,"cool":0},"v1ijWP7AxZTK77h0XkNy7Q":{"text":"Booked this restaurant for dinner in advance and was looking forward to it. The menu, the ","useful":1,"cool":1},"6cC2KZJIlZPbqgEaiHw1uQ":{"text":"Bayona is the 7th stop of my journey to hit all  2018 Top 10 New Orleans Restaurants. I ca","useful":2,"cool":1},"ydiFUDsmZEhITrx5iSuAqQ":{"text":"The poor service, absent and unfriendly staff were most memorable. The house manhattan, ro","useful":0,"cool":1},"sIGQK6U8EBoRqfdFoyHucQ":{"text":"Ambiance is great. People were nice to begin with. Ordered my meal and it never came out. ","useful":2,"cool":1},"ts-5GZKUtLBMTFQ1HjuEuQ":{"text":"Romantic classic Nola establishment.\n\nMy old friend always hosts here with parties of five","useful":1,"cool":1},"bnfc6pMf4HtTBTz2nLlYCQ":{"text":"I've been to New Orleans several times.  This time, I decided to surprise my husband with ","useful":0,"cool":1},"ox1dudJzxCICcgWJSAyHkw":{"text":"Ohhh lets talk about being a bad boy...\n\nI walk in (or should I say stumble) in here 3-mak","useful":1,"cool":2},"utzynoK53rdmcPAgxDRwRQ":{"text":"Delicious and great location. Highly recommend to anyone visiting. I had the red fish and ","useful":0,"cool":0},"jN4c0wWwMEsMdrKp37pb2A":{"text":"This is my favorite restaurant in New Orleans.  Everything on the menu is made with love. ","useful":0,"cool":0},"Ac1F1m890qChBjbukWSZZg":{"text":"After seeing Susan Spicer on \"Great Chefs of New Orleans\" many years ago, we finally got a","useful":0,"cool":1},"CoK7jOYLMUnlBzphQW-enw":{"text":"This place really didn't measure up. I know friends who loved their meals here, so maybe i","useful":1,"cool":0},"NjGeVV1B36txCk7a-ASWHg":{"text":"The food was good... The service lacked. The servers weren't friendly. Maybe they are unde","useful":0,"cool":0},"Oy_TniJOicE5fUAzfGGaPQ":{"text":"Upscale. White table cloths.  Businessmen and Old money.  \nGreat Service. Delicious Food. ","useful":1,"cool":0},"eZzKwsiAT1IV9hqa_T7PFA":{"text":"It is a challenge to fully experience all a restaurant has to offer in on seating.  If an ","useful":0,"cool":2},"QlbqEtSUVm-de8zeP01VWg":{"text":"Excellent food and friendly service. \nThe prices are a bit high but they don't rush you th","useful":0,"cool":0},"qwFHekE-aztNeHNsW-ZeMw":{"text":"Everything from the customer service to the atmosphere was hands down elegant and wonderfu","useful":1,"cool":1},"WD9Sowg5c52Adh-ypUoMSQ":{"text":"Was in New Orleans for a bachelorette party and a large group of us are here on a Saturday","useful":0,"cool":0},"LMq-WrlNN9pF0IjAMtpfMw":{"text":"Tried Bayona for the first time with my husband and a couple of friends. The restaurant an","useful":1,"cool":0},"yQcz1JWpMev5UG6pbNw10g":{"text":"Excellent food, good but slow service. Went for Saturday lunch at the recommendation of ne","useful":0,"cool":0},"pKZsy092ONiZ7c3cGfqK2g":{"text":"My boyfriend and I had been told we had to go to Bayona during our stay in New Orleans, an","useful":1,"cool":1},"Fj1whlL76SH8btELGi6mQg":{"text":"Had dinner on a Friday night.    My wife loved her Stormy Morning cocktail, I found the cu","useful":0,"cool":0},"q-5wiiuhPqJThbxptAzIBQ":{"text":"I was there for a private event.  The Tuna conservation salad and the smokey pork butt wit","useful":1,"cool":0},"MDt_1fMUv0rr3OPKhC-bIw":{"text":"Very disappointed with the service. First they lost our reservations, even after we showed","useful":2,"cool":0},"KykNdVU59mkymQMjh6zSAg":{"text":"Wow. Did I say wow?! Elegant and romantic dinner with my husband. Eggplant caviar appetize","useful":1,"cool":1},"xkp3Cpm0TVN1WsgudUsusg":{"text":"This restaurant is owned by probably the most famous female chef in New Orleans; Susan Spi","useful":2,"cool":1},"C17G21FpQPjxJEzPCSHkVA":{"text":"I came her during lunch and shared the grilled shrimp for appetizer and had the sea scallo","useful":0,"cool":2},"iuQ0PCKPoWrL98KYmuJAXQ":{"text":"It's freezing in here!  Everyone has their coat on and complaining. It's freezing!\n\nFood i","useful":2,"cool":1},"vTK_ceDzlY20nLZwhulT6Q":{"text":"One of the best restaurants I've ever been to!  My party of 4 walked in on a Saturday nigh","useful":1,"cool":0},"GMl5NhkvvGb6_31D5_tS1w":{"text":"So the food for the most part tasted good be the service... \n   \nBeing an employee of a hi","useful":4,"cool":0},"ECSCPjBw_P3QTmKJM6s5dw":{"text":"My friend has been talking Bayona up for years saying it's his favorite restaurant. I was ","useful":3,"cool":1},"TP1hz-7EkH1zH0E-r0Rhhw":{"text":"After walking by Bayona literally every week or so I decided to finally eat here. A friend","useful":6,"cool":4},"tdArFjTa4HwcyQ-GfiOprA":{"text":"Saturday night we had a group celebrating my good friend's bachelorette party.  We wanted ","useful":10,"cool":2},"VhP7-ftrNVHdbSNYSizu9Q":{"text":"Take your woman here for a date and you're sure to receive some late night...cuddling. \n\nR","useful":1,"cool":1},"aamjlUmGuQ6jchzxs2hn9g":{"text":"Super disappointed in the food here. We made a reservation before our trip to New Orleans ","useful":3,"cool":1},"RciyvsMfbrNClnV0y9C7eA":{"text":"The best place to eat in Nola. I would recommend to everyone and I totally told everyone t","useful":1,"cool":2},"iJ2bgMIoHvcf0y2FzetouQ":{"text":"We've enjoyed Bayona almost since they opened 25 (?) years ago.  The food is still excelle","useful":0,"cool":1},"GDDLzc24gPzV19gksP37ww":{"text":"ROASTED GARLIC SOUP, QUAIL SALAD: 23 year favorites!\nVARIED ENTRÉES: 8 people can have 8+ ","useful":5,"cool":2},"F1aO0ng7ZxDHd6JWsIy06Q":{"text":"I had dinner here on 11/5/18 with friend visting from out of town. The hostess and FOH man","useful":2,"cool":0},"9WJ1hxWBMR2uRKh3Mc07Eg":{"text":"WELCOME TO BAYONA! The Quarter's best fine dining-themed circus. \n\nStep right up and take ","useful":13,"cool":2},"z_jx7IeLkoOJL38YnyLttw":{"text":"Let me start with the most important part; if you skip the quail salad you are making a hu","useful":0,"cool":0},"BTdyKf3nr2LM37MAb7jMUg":{"text":"On logistics: Even though I made and confirmed our reservation well in advance, they made ","useful":0,"cool":0},"0qnw3zle8Q_CtB2TN8gllg":{"text":"120 bucks for lunch, the center piece of which is an upscale PBJ sandwich? Sounds like a j","useful":1,"cool":0},"Tk5AzhAInMvth-urr0runQ":{"text":"Just the perfect evening!  Our servers, Sarah and Griffin were effecient, helpful, charmin","useful":0,"cool":0},"_AhlMEh9DKj-C8fwMgQGsw":{"text":"Thanks a lot, Bayona - you just ruined PB&J for me forever. WHY did you want to use cashew","useful":3,"cool":1},"t2460pWnT7sSz4I3GMDniA":{"text":"Service great.  Food quality was average.  Nothing of this restaurant stood out as a quali","useful":0,"cool":0},"zakpwftRUUDiTZwyOya5tw":{"text":"We wanted some damn fine food and after I saw my boy Chris L's review we made reservations","useful":2,"cool":2},"YxmlLdy5_4uFEHROtMtBIw":{"text":"Worst meal I ever had in NewOrleans\nWest Indies salad was ok. Garlic soup was one step abo","useful":0,"cool":0},"gtkte8rzSKU9cTOcKNiuLA":{"text":"The food was absolutely delicious, especially the cucumber and salmon cream cheese dish, b","useful":1,"cool":0},"NKnQUwh3HWm1eU33Uletig":{"text":"My partner and I went for dinner in late August, aka slow season for restaurants in NOLA, ","useful":3,"cool":1},"dLF0lEHsatcfSSsNYqEufg":{"text":"Went here on our last night in New Orleans. This one is a tough reservation so plan ahead ","useful":3,"cool":0},"tzPohX4MTkZcbPgSBtnFPw":{"text":"It is too bad to say that we will not be coming back to Bayona anytime soon. We dined here","useful":6,"cool":1},"uiPptQ4djM2PFqurzY2jjA":{"text":"Food great as in past.  Server almost spilled bottle of olive oil on me ( right after I re","useful":0,"cool":0},"ZTITi3pff7Lt5je__YTECw":{"text":"There was a cockroach that almost crawled into my aunts hair. I finally killed it and show","useful":1,"cool":0},"Cd7xSQbaHU6-7_zsJOS6Vw":{"text":"The menu was short but very interesting and food was very well done and presented. The ser","useful":1,"cool":2},"x4RwRmNYICR-1Sof6hx83w":{"text":"Anniversary dinner was unbelievably great!  Wonderful service and the food was delicious. ","useful":1,"cool":0},"aaKA1qVu4j8XdHYdLoOV5w":{"text":"This is a very nice and authentic place if you want to feel like you are in New Orleans. I","useful":0,"cool":0},"0Mv0enhxb-zKIk-y9EZG2Q":{"text":"Absolutely superb.  We loved every dish, seriously.  This is 10 times better than NOLAS Re","useful":0,"cool":0},"8l-9VXnxSrEAiGJjiIySlQ":{"text":"Please. Pass on this passé restaurant. \n\nI fell in love with Bayona based on its website a","useful":8,"cool":2},"w5ClGQdlkHSGvimCNgff0A":{"text":"Sadly, this was not the experience we expected. My mother ordered a glass of red wine whic","useful":0,"cool":0},"7BGjcS0GZQ5WXiuCuo05GA":{"text":"I've had a lot of good food in my day. I've met some world renowned chefs as well. This me","useful":0,"cool":1},"SSRhHCEfdlNrkap-hWbwAA":{"text":"If you are looking for a taste of New Orleans, this is not the place to go. The food is so","useful":0,"cool":0},"QSSpVzKqyTjojPmfMgb0Zw":{"text":"Bayona offers a unique dining experience just north of Bourbon Street. \n\nMy friend is vega","useful":3,"cool":3},"6ovT2RbCXg-pisUengveTA":{"text":"Let me preface this review by saying that Bayona has been a favorite of mine for at least ","useful":11,"cool":0},"eRiGGSKTtMlN7_2HcF_06w":{"text":"Start with garlic soup.  Entree scallops were great. Duck jelly onion sandwich! Great comb","useful":0,"cool":0},"x-m48jmAA_Kr6yNhwwmR-g":{"text":"Let me begin by saying the cuisine was excellent, once we got it, but dining is an experie","useful":3,"cool":1},"rH3w0tcIMlE8HBiv6wgorw":{"text":"Most of the time I eat out, my focus is on the food, but at Bayona I found myself aware of","useful":0,"cool":0},"iCwRDUaNyyqHQ30l9Lr34Q":{"text":"Food was great but service was terrible!! Waiter was less than enthusiastic to begin with ","useful":0,"cool":0},"6SJIKezZru9Xc520irEKwQ":{"text":"I'll preface this with saying I only knocked one star off because of the huge gap in betwe","useful":1,"cool":0},"fqxXwFomGq3Jb6P1o4tpIA":{"text":"My sister and I were on a business trip and we went to Bayona on Monday, June 21. I was ve","useful":0,"cool":0},"gN7sf14VfmQC4r4pQybPxg":{"text":"Why have reservations at 5:00 pm ( dinner service )  when we weren't served even water unt","useful":0,"cool":0},"PmfEBJP-6Ysj6FIg7DIRAQ":{"text":"First post-Covid dining experience here was great! My friend and I popped in for their new","useful":6,"cool":5},"buuzq1pMBqU0h0_3ZYsT8A":{"text":"Bayona was chosen to celebrate my mother, brother and his girlfriend being in town.  And B","useful":2,"cool":0},"LiP_r7kBu0_ddePBeruuyQ":{"text":"The service was outstanding and every precaution was made during this COVID madness. Made ","useful":1,"cool":1},"hGSYHx2qzi76bJbsF04mUA":{"text":"This was my second time at Bayona - which says that I originally wanted to come back. The ","useful":2,"cool":1},"Dmea84f6n8OxLrS1WzCXDA":{"text":"Went here with high expectations on yelp. There was a reservation that cancelled so we wai","useful":7,"cool":0},"in0hk5s0uSfBt5MrHW_WJA":{"text":"My first meal in New Orleans, and what a meal! I showed up a little worried b/c I eat plan","useful":0,"cool":0},"gqXxxrbbS2EOan7Tx1EkKA":{"text":"I came here for a rare date night with my husband, and it did not disappoint. We sat in th","useful":0,"cool":0},"kbH3ZVgznmLr9A12Rc-ZrA":{"text":"Hadn't been in a long time. Service great, unobtrusive but very attentive. My wife had the","useful":0,"cool":0},"TLKpy9Sw3PMlYCBbMtdDRQ":{"text":"To start I will say the food was fantastic. Great food. As for the service... my girlfrien","useful":0,"cool":0},"J0BqAVqDXNqoPOo0ZhyP9A":{"text":"Tried it out on our last night in New Orleans as a break from the fun, but loud and hot, j","useful":0,"cool":0},"pzlUmVFoSueFV9koZhJKow":{"text":"Went for New Year's Eve dinner and wanted to love it, but they were sold out of literally ","useful":0,"cool":0},"h3kzbebK8297quQ2U5i7_g":{"text":"I have always wanted to go to Bayona, but usually waited too long to get a reservation.  A","useful":1,"cool":0},"wbYpoLlY4R2ZWAsejKsMqQ":{"text":"If I could give this place zero stars I would. The service was terrible and the food was e","useful":0,"cool":0},"MGHKtSLO_TgvX1JplzIUBg":{"text":"Went yesterday for dinner and ordered off Coolinary menu. The Red Snapper was missing the ","useful":2,"cool":1},"OoF7epbAMfrgkBQWZBk2Eg":{"text":"First trip to Bayona, after also visiting Mondo. The food in each case was among the best ","useful":0,"cool":0},"gQGTR-ARoDZouav0-km20g":{"text":"I was so excited to try this place out. One of my favorite chefs highly recommended this p","useful":2,"cool":0},"gulEvgsNJIlk1YICzVrK8A":{"text":"This is a fine dining experience that was overly enjoyable. The staff was accommodating an","useful":0,"cool":0},"XO2lRIuAMuuj4V8urxXj3g":{"text":"Had reservations for 8:00 for 6 people last Saturday night and came in with such high hope","useful":2,"cool":0},"1Bd3OpCFBPxsX73uITMSQQ":{"text":"We are local and get the chance to eat at a lot of really great reactants in the city. Bay","useful":1,"cool":0},"rpWNp7DoH43FHB4MVtKVmQ":{"text":"I couldn't possibly say enough wonderful things about Bayona. Both Shannon and Whitney wer","useful":0,"cool":0},"RTsr7Wp-g4r6W7ozdWXedA":{"text":"Bayona is in the heart of the French Quarter but off the beaten path. We had 3 of the star","useful":0,"cool":1},"PlA174W3Ikna2VMS0GWB_g":{"text":"Reservation was sat perfectly on time & the service was perfect. The good however was noth","useful":0,"cool":1},"cSBEABS-wd4yyHyl4kqfYQ":{"text":"I'm gonna keep this short and sweet. The duck PB&J. Just . . . yeah. \n\nCame here with da w","useful":0,"cool":0},"yKbHdCVG3Y-YV253d2zQ3A":{"text":"We had a special meal at Bayona, having secured reservations a week ahead for 7:00.  Our p","useful":0,"cool":0},"h_3Scy15-8C8ujPAZEQGJw":{"text":"Sorry, but this place has terrible service.  We ordered apps, wine and entrees so I though","useful":6,"cool":0},"As7iW8NWp14-zM3lMAbDzA":{"text":"I'd been scoping out this restaurant for a week or so now determining if I wanted to actua","useful":13,"cool":2},"11G6xF-hCnClpwfzSs2Jog":{"text":"Bayona, a favorite since the mid 90s but a place I have not been to lately, admittedly, be","useful":4,"cool":2},"ILYoAT4O9NO8tWG-sNEY5A":{"text":"My wife and I celebrated our 6th wedding anniversary with some friends at Bayona during ou","useful":0,"cool":0},"opOmzzly9PS31YH2hh7uhQ":{"text":"Bayona is kind of like the Commanders Palace's younger, less popular, attractive little si","useful":2,"cool":1},"uayfROdH3yifxN9mLMyJlA":{"text":"Our first meal in New Orleans and it was...good. Tucked away on Dauphine Street, we passed","useful":1,"cool":1},"-OAa-qNme0Q0ePXZcPVGAA":{"text":"Best meal I had during my week-long stay in New Orleans.  The ambiance of the building is ","useful":0,"cool":0},"m_xhl18QPjT33A9-Di1A6A":{"text":"Susan Spicer's Gem in the French Quarter definitely lives up to the billing.  I came here ","useful":1,"cool":0},"CGvjVYv7Jhe8J6rjNGtDSw":{"text":"I keep seeing amazing review for bayona so I tried it again. This time I went for lunch. A","useful":2,"cool":1},"fotbQnLvBTr33noFb42Chw":{"text":"Came here for our anniversary dinner, they didn't make an effort to making our dinner spec","useful":0,"cool":1},"sLvflaJHhG9_-UfOBQK6Lw":{"text":"One of the best restaurants in a city full of great restaurants. Got there early on a Frid","useful":0,"cool":0},"Ak9FAxWsChScUjvYD2annQ":{"text":"Nice little spot. Their food menu is small but good. Drinks are amazing. Did the pomegrana","useful":1,"cool":0},"hWETiNaIYU7yymQPK7Ba_w":{"text":"Let's be frank: this place is clearly living on past glories. \n\nWe ordered the quail salad","useful":2,"cool":2},"7NbcD0Xf1CmFaxM1TGdbAQ":{"text":"Good, but I would not go back. On the plus side, the food was really good. I had the artic","useful":1,"cool":0},"aFQRi64WQizLcUIeBuctjw":{"text":"This is a review for Bayona pre covid.\n\nBayona changes the menu rather frequently- every c","useful":1,"cool":0},"5Gkmg9UtNCUosEtR4MdXIQ":{"text":"Asked for appetizers and were told the chef likes everything ordered \"at the same time\" ve","useful":0,"cool":1},"4RGVGo3xO_-wnucO702bMg":{"text":"My friends wanted old-school elegance for our last meal in New Orleans. Bayona fit the bil","useful":0,"cool":0},"oZMLxt_PJQ4BElJWtkmYWg":{"text":"It was the best of meals, it was the worst of meals. ... dinner at Bayona was one of the m","useful":6,"cool":0},"-GZD7KhNwqUF1gTZVz7c7w":{"text":"For the most part, we felt the food was WAY too rich. We enjoyed & shared several apps (ve","useful":1,"cool":0},"rwU-TYLO1KQp68Eu-5YoCA":{"text":"Came here on vacation - fantastic menu with lots of delicious options. \n\nWe had a couple s","useful":0,"cool":0},"0jAF-bFhVChk4XGNVLuttQ":{"text":"Omg this place!!  Not only is the outside area so gorgeous, the food, the waitstaff- every","useful":0,"cool":0},"3BDjdpjdgAWFF47dNtlUdA":{"text":"My boyfriend and I are visiting NOLA for vacation and made reservations for Bayona a few w","useful":0,"cool":0},"BsP6PCmTwX-F9NmLpdjpQQ":{"text":"Not only was the food amazing, the staff makes the experience next level. \nThe sweet potat","useful":0,"cool":0},"-CJGvnbCXPnRFVHy7YLJiw":{"text":"The worst dining experience ever. The wait staff and the manager were so rude. After we or","useful":3,"cool":0},"pGoocCW7LhGhWLoMeT9Otw":{"text":"If negative stars existed, this restaurant would be the perfect candidate. \nPlease read al","useful":0,"cool":0},"1YWQQ5TarO-ckr67j5o-EA":{"text":"Bayona is recognized for excellence.  Not so much Saturday July 3.  We arrived for our 7:3","useful":0,"cool":0},"JRBGCl7F9BwJZJxwAQi96Q":{"text":"Located in the French quarter this unassuming restaurant located in a beautifully restored","useful":4,"cool":3},"GunAII1oLqPgpKrhzgxBsw":{"text":"I'll let you in on a little secret... Bayona's 23rd Anniversary, 3-course $23 lunch, with ","useful":13,"cool":5},"dzpBokBJbT1M_G5NOHe4jQ":{"text":"Wonderful warm, friendly service. Calming ambiance and each room is decorated differently ","useful":1,"cool":0},"DbcaFj0VS9UyKs6XwoQXTA":{"text":"This is where I would go for my last meal before I die. It is that good. Bayona's only coo","useful":1,"cool":1},"YSHAE8WSoqXFxRhAg98IAA":{"text":"I had a wonderful dinner here last night with a friend.  Seating is in the beautiful court","useful":0,"cool":0}}