{"hyey1jiUnLeHKbKGgrejNw":{"text":"Great French Quarter location, especially after dark when you walk out the door, turn to y","useful":2,"cool":0},"Yv9kiyOZR5m0xizD-vPRIw":{"text":"Was in New Orleans for business.  Stayed here for 5 nights at 199 a night.  This place was","useful":0,"cool":0},"F23yMk3iVkjtd4raB1YdjQ":{"text":"Meh.\n\nStayed here in a tiny room, and the food wasn't terrible. The service was excellent,","useful":0,"cool":1},"rYusJlo3GenvW05zPkuRGw":{"text":"Just came back from my second visit to the Bourbon Orleans, and it was almost as great as ","useful":3,"cool":0},"TNOBX1S-BqGvQYq3XOuQZw":{"text":"The game room sucks.  Mackie was especially rude and unpleasant.","useful":0,"cool":0},"LSboJRcxTvvbcJQCChrWBQ":{"text":"Yes, haunted, wonderful, full of character.  A bit imperfect, but somehow fits with the wh","useful":0,"cool":0},"RT8pUJ2gFekBybkv2dJShg":{"text":"If you can fit it in your budget, request one of the balcony rooms on the 2nd floor.  Some","useful":2,"cool":0},"FuqXV_F0CYWkMjqR6I0CEA":{"text":"The location alone is worth staying here. It is centrally located in French Quater right b","useful":0,"cool":0},"SsG0Jtl5rphBh_MCZkFTpQ":{"text":"Very friendly staff.   Great location.  \n\nGarage must be far from hotel as valet took a mi","useful":1,"cool":0},"Ar2FtXpPzCLRHrBCy5JI7w":{"text":"Going through some of the previous reviews by fellow Yelpers, I agree that the walls are p","useful":3,"cool":0},"gZ2lEFQauWi7msG2cjwfwQ":{"text":"Very cozy and quaint- Excellent location\n\nWe stayed here for 3 nights- right in the heart ","useful":1,"cool":0},"t4N8t1jtiN4AiACXSp7w4Q":{"text":"for the price from orbitz I paid and having booked my room the same day I found clean peac","useful":3,"cool":3},"Dq3_5mJXMJma4M2kOQequg":{"text":"The Bourbon is a pretty standard hotel, but great location.  Comfortable beds and great sh","useful":0,"cool":0},"uJ3mFPzymaaOiuvqOQIDnA":{"text":"Between the long dark hairs in the bathroom, maid service staging hallway demolition derby","useful":4,"cool":0},"01lzzBAYl82p9iPizpyg8Q":{"text":"Comfortable, Friendly are two words that describe this hotel in the heart of the Quarter. ","useful":0,"cool":0},"3YEoRWi1_XDTStU3pAm-aw":{"text":"Booked a room here mostly on the location factor - was throwing a bachelorette party and n","useful":2,"cool":1},"RGXHW6I6jQSPX4g0UYrCgA":{"text":"Stayed at this hotel during JazzFest. Was relatively happy with my stay. As my boyfriend a","useful":0,"cool":0},"Fh3dZTq6CBbAiv_styPqYA":{"text":"clean, wonderful, afforable. we stayed right on bourban street and were in the middleof th","useful":1,"cool":0},"Gc9arq-9l60s90eqHqWIjQ":{"text":"We just returned home from the Bourbon Orleans and cannot say enough good things about the","useful":0,"cool":0},"PPICmV3h1fwubuo0o9cSXA":{"text":"The only thing bad we can say about this hotel is that their concierge needs to really upd","useful":2,"cool":0},"J_G-xF6ox89svvvZwWEpMA":{"text":"If you're looking for a hotel in the French Quarter near all of the action, this is a good","useful":1,"cool":0},"fQbuHWGGa0JXgZVTCwzwvQ":{"text":"We came to Bourbon Orleans from Chicago during Christmas week. When we arrived they were s","useful":0,"cool":0},"Vhz7uLsDEYOPhbWhwmN3nw":{"text":"Location, location, location.  Located right behind Jackson Square, you really can't find ","useful":0,"cool":0},"HA-n-p9sd9xokDslFiZ69Q":{"text":"The happy hour prices can't be beat ($2-3 beer with a great selection and $3 wells) and th","useful":1,"cool":1},"vy42RQKdMSXqhHTIQHhZqw":{"text":"Excellent hotel with the antique French atmosphere that we all want while staying in New O","useful":0,"cool":0},"iYmGlEn-M5x5AhXdj-6-ig":{"text":"My friend and I stayed here for an entire week with absolutely no problems. We got a packa","useful":5,"cool":0},"HsvYX-j_Phrs0gi-H3SWDA":{"text":"Bad experience with Bourbon Orleans.\n#1 Walls are paper thin. You can hear everything.\n#2 ","useful":4,"cool":1},"qkmSvJ5vnaezcz_8BMuX9w":{"text":"This is one of the funnest places on earth that I ever had the pleasure of staying. I only","useful":3,"cool":1},"5Yx9uTBbr5H2a72XInQ8Ig":{"text":"I stayed here for Mardi Gras and you just cannot beat the location of this hotel if you wa","useful":2,"cool":1},"5BVmA2lR1wH6Hh51vVpCKA":{"text":"No longer a Wyndham hotel. And you can tell. \n\nOLD facility. \nTINY ass rooms with the thin","useful":0,"cool":0},"fBkeQ7KMy182z6EHLN6D7g":{"text":"i stayed here, but i didn't spend much time here except to sleep.  the lobby looks lovely.","useful":0,"cool":0},"IzjHAbBt0r_Keii6AU12cg":{"text":"Probably the best bar we found in New Orleans, thanks entirely to Terry, the bartender on ","useful":4,"cool":3},"eYbpZRgU95bgakvgH89Q3A":{"text":"We received a tour of the hotel from a manager, when we dined in the restaurant. Things we","useful":3,"cool":0},"16WVUDWw0rdZ2VDGrpuHqA":{"text":"Fantastic location- RIGHT on Bourbon st. This was my 2nd time in New Orleans and I was ext","useful":1,"cool":0},"5ugZsy3qbLANeOGc3QhWRg":{"text":"OK, so I get here at 12 noon after staying at the Astor Crown Plaza for almost a week, muc","useful":4,"cool":2},"Oei8DbXNgB11KGuTaRgBQQ":{"text":"Where to start? Overall I was very unhappy with this hotel. When it comes to location in t","useful":7,"cool":0},"YtvrHIY8ut6NXV4wAMy9FQ":{"text":"Such a wonderful experience here! Arriving at the hotel, I was already elated to get out o","useful":1,"cool":0},"0YVGgKGjGgiihq65tbkdEQ":{"text":"I read mostly good reviews about this hotel before booking, but let's face it, it is the s","useful":0,"cool":0},"0fEXGmaFzMgYyuOl4kya0A":{"text":"We stayed at the Bourbon Orleans for two nights this past week to celebrate my birthday.  ","useful":0,"cool":0},"GwdiBv5nNeFhpTl-367WcA":{"text":"Stayed here to see if this would be a good spot for our wedding reception- the answer is N","useful":0,"cool":0},"qGCwb2XJS3-J6NcFNIB_xw":{"text":"The room to request is the townhouse suite! it is a room with a loft. downstairs is the so","useful":2,"cool":0},"JtLfgTaBVKPI4QeYYyuWOA":{"text":"Old world charm, grace and style.\r\nWyndham knows how to run a hotel and treat guests as we","useful":2,"cool":0},"wAhspQJTNN5h00-HR02FAA":{"text":"The maid walked into our room with out knocking while I was naked. We complained all the w","useful":2,"cool":0},"1uI7-njK3iMpb2CAKZTUDg":{"text":"I love the location of the Bourbon Orleans... right off of Royal Street in the heart of th","useful":1,"cool":0},"pTAS8JKZ4raB5Zo2aLV37w":{"text":"It's just alright, but they get two stars for what they claim to be. \n\nThey say it's a \"bo","useful":2,"cool":1}}