{"midx-zt9uXHW7tY80wwQ5w":{"text":"Nothing short of a five-star experience.  I stay in a lot of business class hotels, and th","useful":0,"cool":0},"NuysRHHB0gAiJxKrjl8wRA":{"text":"Don't waste your money. You will have better service at the Harrah or even a motel 6. \nThe","useful":2,"cool":0},"UCPfKa3-j_MjI1d1beSONw":{"text":"I booked a room at the Hilton Riverside in an attempt to be close yet slightly outside of ","useful":0,"cool":0},"NmLCxCq18-PGNbcBVmizIQ":{"text":"Well appointed, clean rooms, friendly staff.  It is a bit of a walk to the French Quarter ","useful":1,"cool":1},"HXGNpSgqPhWRLpKkFXqbkQ":{"text":"The rooms are outdated but the lobby is very nice and modern so when you get to your room ","useful":0,"cool":0},"CNLjyF1bdCj49i_CqUJu_g":{"text":"I was very impressed with the texting option. I really like the convenience of being able ","useful":0,"cool":0},"RnX7Kv9SGi2-XbnBOmt0Og":{"text":"Great location close to the French quarter and also convention center. Overlooks the river","useful":0,"cool":0},"gtp0s_kSjHZiMHA2bl6Uww":{"text":"Nice hotel and clean. Enjoyed the stay. Huge hotel with Riverwalk mall at bottom level. Ha","useful":0,"cool":0},"YmYHkaKQ5JNdgOJ0nDMPOg":{"text":"Let me start off by saying my first day here was wonderful, love the staff... Day two was ","useful":2,"cool":1},"WyacYJ3FrCfYbZqPSAJy1Q":{"text":"Great customer service and a good room with a great view of the Mississippi River.  The ja","useful":0,"cool":0},"rrZH6dSyOr7nIxzDHmO28g":{"text":"stayed here for 5 nights recently, for a global conference i attended....\n\nhadn't been in ","useful":1,"cool":2},"p1DwYOY0k-Ls1W5lf3H0qA":{"text":"We stayed at the Hilton as part of a package put together by Expedia; so our rate was very","useful":0,"cool":0},"TAjpzvZQkn38RRN4ecg06w":{"text":"The first room we got was a little small but great view there was a stain that they were s","useful":1,"cool":0},"k0iatR9Clt-YW5J2RabdWQ":{"text":"This hotel offers one of the best locations in the city. It is right next to the Mississip","useful":0,"cool":0},"pAfvOSuNI6gkTJc8POweEw":{"text":"We have stayed here in numerous occasions and have had no issues. Staff is courteous. The ","useful":0,"cool":0},"0jjmyT6QARK7sxazApe6Kw":{"text":"The rooms are large and clean. The mattresses seemed new, not saggy and very comfortable. ","useful":0,"cool":0},"HIjWCOyawOLSLoK_liTFqQ":{"text":"So after a terrible experience (see previous review) I sent a \"feedback requested\" report ","useful":1,"cool":1},"6QImt2L82EbRUBWsBplvCA":{"text":"I stayed here for a convention. My room, in the main tower, was large and nicely appointed","useful":2,"cool":0},"o9klguD56c3eKiVtkjvjxA":{"text":"Good grief. Another city, another Hilton hotel. What more is there to write that hasn't al","useful":1,"cool":1},"4obwATtREdzbIbaikZQxYg":{"text":"One of the worst experiences I've ever had. We were told we would get special prices on th","useful":0,"cool":0},"bOv7SqfSlXY5WeDRI4LmZA":{"text":"Love the location! Easy walk to the French Quarter! Love that there is a huge indoor three","useful":0,"cool":0},"CKYyxv699hNt0fA2GA-xeQ":{"text":"Very nice room. We stayed in the building closest to the river. The rooms were large and u","useful":0,"cool":0},"cjGJ5XNniB3fDmY8pGHC_Q":{"text":"The staff is friendly and efficient. However, the hotel needs to be updated. It looks old,","useful":0,"cool":0},"IINVdBWkneuVCHjwSi2jdg":{"text":"I booked via Priceline on a bid. At first I was upset because the price I paid, for just a","useful":0,"cool":0},"gA-GZN6vajQJA0iKwZLzZQ":{"text":"It feels like a motel inspite of the price. There is no microwave in the room, nothing in ","useful":0,"cool":0},"AMmVLTR-OUsUMxkePsp7kA":{"text":"More closer to a 3.5 stars.  \n\nThis place is very large, and the location is decent, and i","useful":0,"cool":0},"C-EXmE38om2SapM6PSnGhw":{"text":"This is a nice hotel on the river. My room faced the river, but the Windows were dirty so ","useful":1,"cool":0},"boywxjIN4Di53lVOLexQTw":{"text":"i just have a question, what is up with the lady who answers the phone when our room key w","useful":0,"cool":0},"mrk4Jk1VkoyiC3m9Y_4aFA":{"text":"They staff was helpful and extremely speedy. I attend conferences all over and this locati","useful":0,"cool":0},"mX7ArmuqNsfCCodVqSS3JA":{"text":"Checked into the hotel at 11 pm had to check out 15 mins later because of roaches in the r","useful":0,"cool":0},"7Ah5XvcDfXEMmymGI4bUbw":{"text":"The room was spacious and clean, no complaints. A con is the gym hours which closes exactl","useful":0,"cool":0},"dBeStxbFr8c80H2yRNDyag":{"text":"It was Christmas and my parents 35th Wedding Anniversary celebration. The stakes were high","useful":4,"cool":1},"_mdVe4zI2yNvRJ8_v4hTUQ":{"text":"I'm a Hilton Honors Diamond, so stay at Hilton and other hotels several times a year. \n\nI ","useful":5,"cool":1},"BCoxwNSquuQklYR5rl0EmQ":{"text":"I came to New Orleans for a conference and stayed at the Hilton. It was clean and comforta","useful":4,"cool":0},"oUsj-MfNsAUpZY6WGS47WQ":{"text":"Great location. Streetcars are right outside the front doors. \nOur hotel room was HOT! It ","useful":0,"cool":0},"ieOr9uNvyHNPM5lWyhZXJA":{"text":"UPDATE: Spoke w Brock at the front desk upon check out and he was awesome! Made up for the","useful":0,"cool":0},"EwzQbwrh1M9NnKo2GZ6dmw":{"text":"I got married here this weekend! First of all, Beth Tusa and I worked together for over a ","useful":0,"cool":0},"K1exYJcvNSESTXzfVSPZQQ":{"text":"Hi my name is mike and i had a horrible experience with valet parking employee name Robert","useful":0,"cool":0},"JG25wwUpaMn76nAqvKvzsw":{"text":"The main thing this hotel has going for it is its location. Very conveniently located near","useful":0,"cool":0},"tlpANeolDufmebfDSmexIw":{"text":"The cleaner stole all the money out of my pocket while I was at the pool. Everyone running","useful":0,"cool":0},"myWdOei7dC5MvCPeSvHdmg":{"text":"This hotel was okay. Our room smelled like heavy stale cigarette smoke. Our towels had mas","useful":0,"cool":0},"SsO0RFa4TlMEVZsOG7Lr-w":{"text":"One of the lesser quality Hiltons I have stayed at over the years. Old property, extremely","useful":1,"cool":0},"NJGpsg7FtdgheheJOvepng":{"text":"The service is good in general, but the stuff is not trained well. The guy on a reception ","useful":0,"cool":0},"VV9gwRCMyaBPTuoaEw9sSg":{"text":"Lower end Hilton, quite in need of renovations. Guest room internet access was down for 2 ","useful":1,"cool":0},"vbrM0o2txbOhKNIrwPYz8g":{"text":"Stayed here for a basketball tournament (Super 60). Very nice hotel and rooms. Beds are co","useful":0,"cool":0},"ejyN-WofSFY6BGd0oDfZyg":{"text":"Have you ever watched that movie \"A River Runs Through It\"? Me either...so you know that t","useful":3,"cool":3},"QaY4khxY-eV2r6PttcU_yA":{"text":"Hot or miss. Mostly miss. Some nice standout people, but overall this venue is mismanaged.","useful":1,"cool":1},"ZiZb6v2309zbg78q8QSimw":{"text":"This review is fo the breakfast buffet only.  On occasion we drag the kids across on the f","useful":1,"cool":0},"W5hSIYjOK-hGwYRB_ulo4g":{"text":"We're back again and they continue to go out of there way to please.  The concierge room w","useful":0,"cool":0},"49yWIvICggzPyBFghWMGRQ":{"text":"Rooms are just ok.  Service has been prompt and staff has been polite.  I am very disatisi","useful":0,"cool":0},"nkW99yenfRFQFEn6Xfce7A":{"text":"My husband's company put us up in this hotel for a week. We rarely stay at chain hotels bu","useful":2,"cool":0},"hkctnZ4X1i74m9jl81lJ2w":{"text":"After staying at this Hilton for many many years and enjoying the the Executive Lounge all","useful":2,"cool":0},"VxwjDLavo7vbIRQOLBCGVg":{"text":"We arrived at 3:30AM last Friday night/Saturday morning, after a brutally delayed flight. ","useful":0,"cool":0},"vJzZGpwv--pSGbsZJxCWcw":{"text":"I've never been so relieved that my company paid for a hotel....if I had paid to stay in t","useful":6,"cool":1},"j9vVlL5cQDVeCqY1WzjWQQ":{"text":"I frequently travel to New Orleans for work and because my corporate limit for New Orleans","useful":0,"cool":0},"A3jhOPTcztTe6djBJ2Ubnw":{"text":"This place is huge and kind of old. But the thing that really stands out is that there is ","useful":1,"cool":0},"nVwGRFqkueyTSww2Bu3N9g":{"text":"We stayed in June. It's obvious that the plus side is the location: right next to a nice o","useful":0,"cool":0},"MFCWrh3pHLfv2011aFpAig":{"text":"I accidentally left my iPhone at the hotel. No problem! They stored it at Security and wer","useful":2,"cool":1},"d1oLDpI1vY0UBcgFa-A1ZQ":{"text":"Unfortunately, my first review on Yelp won't be a good one. My experience at this hotel wa","useful":0,"cool":0},"ZDGjZInNTkyUOoo5saZgSw":{"text":"It is a HUGE hotel. Super busy, tons of people. But they have one elevator with a glass ex","useful":9,"cool":4},"P2BupkD3HUE4jjIDW4L8Wg":{"text":"I was in town for a cruise. I was blown away by the beauty of this hotel. I was really dis","useful":0,"cool":0},"oD2bVQBY5GAhZ5J7M0kvSg":{"text":"I spoke with Roger, Director of Property Operations and he was very apologetic and really ","useful":1,"cool":0},"Pl7YbSQLYYsdJ4t3poVIlg":{"text":"Hotel: Impressive space but small shops and small rooms. Paid the upgrade to have access t","useful":0,"cool":0},"t33XrbVeCWSWnd81Jwn9Cw":{"text":"Stayed here for a conference at the Convention Center.  10-15 min walk to CC thru Riverwal","useful":4,"cool":1},"dG-Zn90sLoCnmEtMPOdUmQ":{"text":"Price to me was very high, but was actually reasonable considering it was Mardi Gras week ","useful":2,"cool":2},"UTqv1kKTIXkitgwGzzqGRQ":{"text":"The room setup has been upgraded which is nice. The closets are way too small and the slid","useful":0,"cool":0},"Ejf1FV5esyhIVIrrqoQiiA":{"text":"I felt bad giving my (company's) money to the Hilton.  I really wish Paris would fall off ","useful":0,"cool":0},"T8O_03Ug9jEfCCGO7Bob7Q":{"text":"I stayed here on vacation for two nights. We got an executive level on the 27th floor for ","useful":0,"cool":0},"-pX5ynWAwcB8SU5HN94LMg":{"text":"This Hilton is a really nice hotel in terms of location and appearance but I am totally ba","useful":2,"cool":0},"eJQhGtk2A-e91M0qtODzaA":{"text":"Location: 3/5 - The location is great if you just want to go to Harrah's Casino. However, ","useful":0,"cool":0},"eJLTQCYxjgx_bh6efnh8Ng":{"text":"Stayed here June 2-5 to celebrate my bachelorette party. Great hotel in walking to distanc","useful":0,"cool":0},"pGlx0Nduk2ct2CskqReZhg":{"text":"Maybe the fact that my room was $400 a night had soured me on this place, but it wasn't th","useful":1,"cool":0},"VVjQkdmj669pg-h0FhdNsA":{"text":"Perfect location! Conveniently attached to the Riverside Outlets, right down the street fr","useful":0,"cool":0},"v39y-ixsEflbhzVLiW0H4Q":{"text":"The hotel is ok but large and places are not easily accessible - too many escalators or el","useful":1,"cool":1},"ioxMQHQ4tXwrDSHblkc45A":{"text":"If you're on a business trip stay away from this hotel. \n\n1. The rooms do not have closets","useful":4,"cool":0},"BIUyQ7ANl_78fut7OPRsxg":{"text":"Great location and hotel. Diamond upgrade took us to the top floor with a great view of th","useful":0,"cool":0},"5MUUSQ6LFtF_gsF4giLi7g":{"text":"Staying here for a professional conference and I have definitely stayed in better places. ","useful":0,"cool":0},"4BONkenUrkUHVj2ODxELAg":{"text":"Nice on the inside and right next to the convention center. But there are literally train ","useful":2,"cool":0},"65H7JMyW9o8FoQTcQ_3HYA":{"text":"I will never cheat on Starwood again. Won a trip from work and it included 3 nights stay a","useful":1,"cool":0},"60l29lq_X9kOuhJgKqia8g":{"text":"The main thing this hotel has going for it is its location. Very conveniently located near","useful":0,"cool":0},"G4PITVwDYe46nFB74IOk2g":{"text":"Great hotel! Good service, great views from your room and best of all the location of this","useful":0,"cool":1},"t2E6CLfFZt0awdvwjWqLBA":{"text":"About $35 + tip by taxi from MSY airport. Great check in experience with Brandon, quite ch","useful":0,"cool":0},"AzX3MaZ2nmL3kgWagRw8eA":{"text":"Terrible terrible terrible the staff tries, but hotel over booked, no bell hops to help ex","useful":0,"cool":0},"tg4lc3fkPP8zG-AOw9vsJw":{"text":"We had a large conference here, our party could not stay there, rooms were sold out and th","useful":0,"cool":0},"IPB7-Cz-ADBHx9LmM39MEg":{"text":"Terrible terrible terrible the staff tries, but hotel over booked, no bell hops to help ex","useful":1,"cool":1},"nw-GcOmCFa8pslV-606IGA":{"text":"Pros:\n-Great location (right outside the French Quarter)\n-Nice rooms\n-Plenty of amenities ","useful":1,"cool":0},"mPFqE2xZfE6tvyIKqbV9dQ":{"text":"Stayed our wedding night due to unfortunate experience with another hotel in the city. Che","useful":2,"cool":1},"4wRJ9UfTuARIBUfQiehGxg":{"text":"Everything about our stay was perfect and the entire staff was helpful and more generous t","useful":0,"cool":0},"-bFfTUamSKJsACfI13vEpA":{"text":"Stayed and attended a conference here a few times. Never had any negative issues here. We ","useful":0,"cool":0},"B8gj4di44URB9Cp1AzCw7w":{"text":"I enjoyed my stay at this hotel and the proximity to everything wonderful in New Orleans! ","useful":0,"cool":0},"9zvirEcQW74dLxOpasryUQ":{"text":"The best thing about this hotel room was the view!  A gorgeous sunset over the Mississippi","useful":1,"cool":1},"4BXA-EOQRJG8iy88iaW6Dg":{"text":"As many times as I've been to the Hilton, I've never actually stayed here. My review is ex","useful":5,"cool":1},"cN9cCGeh0igQB6iP6e5O8g":{"text":"Very nice hotel that is pretty big and located along side the river in the Central Busines","useful":2,"cool":2},"Ei94HWZC0Zxrm5nNFmvvJQ":{"text":"This was our first time in New Orleans attending a conference and we decided on the Hilton","useful":2,"cool":1},"mrl74jxr5OXgYYeC-CzxSw":{"text":"Great customer service at check-in. The front desk helped me choose a really, really great","useful":4,"cool":0},"WkYASzrOgNygZylaQ8u9zw":{"text":"The staff is phenomenal.  The Consierge Service knew the city inside and out.  The locatio","useful":0,"cool":0},"kEQz-PBZphrUfP8DP0R6jA":{"text":"Great location but the staff is in serious need of some Ritz Carlton training.  On a Frida","useful":0,"cool":0},"ujaKqFJYgG_ID9DTLryfpw":{"text":"My sister and I stayed here on a short 4 night vacation in NOLA. The service was quite goo","useful":1,"cool":0},"Q7FsBVn77kvkuWbmR66eGA":{"text":"The hotel is overwhelmingly large but don't think that goes for the rooms. I don't know if","useful":4,"cool":0},"yK0sD7ah-PUxyzfB8mUBdQ":{"text":"This is the worst Hotel I have ever stayed. Rude, unprofessional and unwilling staff, dirt","useful":3,"cool":0},"gk_PqayJfuIhL5slZ5Wnzg":{"text":"We called asking for directions and rep was very rude! Actually the whole city had rude wo","useful":0,"cool":0},"Fv42nKWirkLBLGehp4iUTA":{"text":"First day our room was not serviced by housekeeping until after 4pm. Second day we left ou","useful":1,"cool":0},"iAIIo0j-pWk7dFxe1WYdlw":{"text":"Dragos is to die for! If you're staying at the Hilton, you need to eat there. Chargrilled ","useful":0,"cool":0},"FUrpLDgCRDiIu4KFXbbWTA":{"text":"Very nice rooms and helpful staff. Centrally located so a quick walk to the French Quarter","useful":1,"cool":0},"Ds3_5NxXdHUOYxl2ZdylAw":{"text":"Came here for a couple of days before my cruise out of N.O. I have stayed at the Hilton Ri","useful":3,"cool":2},"wE_9MOmF3an_sJZqXRW9pw":{"text":"Not a bad place to stay.  The rooms were clean and the staff was friendly.  The location i","useful":0,"cool":0},"frZ52RAemCjZl6pnQBzGcw":{"text":"Big hotel! 2 heated pools! very nice gym with racket ball, basketball, ping pong, & tons o","useful":0,"cool":0},"c7SkO1B28e67NlqxXvjVYw":{"text":"This hotel was perfectly situated to be far enough from the craziness but close enough to ","useful":0,"cool":0},"hmz3K1ByNOU88GyIn0aoZg":{"text":"DON'T waste your time guys! Stayed here for the weekend prior to Mardi Gras, more than 250","useful":1,"cool":1},"mpd7kBkBJ4v1ZPrqKvCm9w":{"text":"Room has a funky smell to it. Came here a few months and ponies up for the suite and paid ","useful":0,"cool":0},"6fOkqYZ3DQgKKc2ArImJ1g":{"text":"Location: 4 stars\nMassage: 1 star\nHealth Club options: 4 stars (would've been 5 but their ","useful":2,"cool":1},"v0kCNLFlYWFuw-BdZMRkoQ":{"text":"I found this hotel to be disappointing. We came into town while there were two conventions","useful":1,"cool":0},"LXeE3heOOe4Z3o3xSO_Jmg":{"text":"Had to switch to this Hilton for last night in town as town was virtually sold out per sev","useful":0,"cool":0},"IRPYVLKaxK29xNL2PkWQhQ":{"text":"Just the nitty gritty:\n\nPros:\n1.  Close to riverwalk and walking distance to the French Qu","useful":0,"cool":0},"tX52obLmiypaDa7eGGKFFA":{"text":"Kind of a mixed review. First, the place is nice, clean, very comfortable. I expect that, ","useful":3,"cool":0},"BU-i7NP8EFymlxtMsFZ-qg":{"text":"This hotel is located on the river, right across the street from Harrah's Casino. It's a f","useful":0,"cool":0},"PrqshrETLakc3LQGC6xoWw":{"text":"Do yourself a favor and stay away from this hotel. This is one of those businesses that de","useful":2,"cool":0},"mWSEgsRTYfQ7WJgwdkRDGw":{"text":"Without a doubt this is one of the worst hotels I have experienced. The service is poor an","useful":1,"cool":0},"SHKSOe-lVTqLsGWKTmN0IA":{"text":"I stayed at the hotel for two nights prior to my cruise. It was extremely convenient to th","useful":1,"cool":2},"blM2bGdiUVzo0S5QXr7iOw":{"text":"Quite possibly one of the worst hotels I've ever stayed in, staff has no idea what's going","useful":0,"cool":0},"fIya-rqj_c0BYV763nanKQ":{"text":"Really enjoyed our stay! The hotel was extremely crowded and the bellhop whisked us off to","useful":0,"cool":0},"3hJVyf4XAlZQdlouuCqAEA":{"text":"Yikes!!  Weak.\n\nI travel a ton for business.  What a surprise to find this in a town that ","useful":2,"cool":0},"nVnJGdx2efPUh1BfFdxUwg":{"text":"Our first time in New Orleans, specifically requested higher floor with nice city view.  I","useful":0,"cool":0},"TD_E0CLFWmiX7m1B85jz_A":{"text":"Adequate room for a big city price.  Located a short distance walk to the French Quater it","useful":0,"cool":0},"TDROX5UoD4Gbiz-PTm-ASg":{"text":"Very nice room.  The very best fitness centre I have ever seen in a hotel by a mile, but O","useful":0,"cool":0},"x-nTUoX2GLqSWEh7sZn3xw":{"text":"I'm a Diamond member that spends a fair amount of time here. While the hotel is a little f","useful":0,"cool":0},"buQmtqsX5LXd9Of1ZBzcTQ":{"text":"Booked this hotel online and wasn't pleased at all with the overall service of this locati","useful":0,"cool":0},"UjwlhejVo1l-8H8W8xxwtQ":{"text":"This poor rating is mostly due to this Hilton's sneaky policy regarding packages sent to t","useful":4,"cool":1},"RVB9aRLgkZaP4OiNsiJDaQ":{"text":"Hilton Riverside is wonderful in all regards expect one . . . they do not have a fitness c","useful":0,"cool":0},"b1KkjZmryZQFpAm5brI_9A":{"text":"We stayed here for our Wedding weekend and although it was a great stay experience, they g","useful":0,"cool":0},"ttLjSd8tELsQ_rtvfuZ6vw":{"text":"My husband and I stayed at the Hilton Riverside for five nights. We had the pleasure of st","useful":3,"cool":1},"6TV0QCKjIv3iTrWhfbuIWA":{"text":"Positives: \nSafe location\nNice and very clean rooms\nGreat service and staff\nDeals to be ha","useful":0,"cool":0},"HEIHauvtYPQaRbX2ZSS4cQ":{"text":"I was at the Hilton Riverside for a conference and had no choice of hotel.\n\nThis is a conf","useful":5,"cool":1},"hymQWSM0FulXzXFrKQDbEQ":{"text":"The front desk person asked us if we wanted a smoking room in this hotel property giving u","useful":1,"cool":0},"z-bru_FBLijY2O2GR3a9jg":{"text":"Staff are friendly ... Good food and good ambience .. Nice to lounge and talk with friends","useful":1,"cool":0},"zwmCufjtPE553FxDDlgQOw":{"text":"Honestly I struggled between a 1 star and 2 star.  My family and I stayed here over the ho","useful":7,"cool":0},"oVRAO19niNpKV05eGRczFw":{"text":"Rather than a story, I should just do a list for this place because it is really a mixed b","useful":6,"cool":0},"trGE9czG-eyy5634hHv_Sg":{"text":"This has to be the worst dump that I ever stayed in.  First, when I got there, I ate dinne","useful":0,"cool":0},"NiXm2E0P5MewyOun2pUNjg":{"text":"My husband and I stayed at this location a few days ago while we were in town for my mothe","useful":5,"cool":0},"OkCAY81ByZ6ijj_lwgoKbg":{"text":"The senior citizen behind me in the \"hilton honors\" line was clearly very tired and in dis","useful":1,"cool":0},"u4dIK4l_On6LKh-ICyCe7Q":{"text":"The starbucks inside took so long and the barista had a shit attitude. Took over 30 min an","useful":0,"cool":0},"jAzzs6GA_F5VMwYWjpxWjA":{"text":"Beautiful hotel with great views. Great location with the streetcars in front.  Beware of ","useful":0,"cool":0},"Tk_2Sqmbc4Q3LDkLexwbow":{"text":"This Hilton is one of my favorites. \n\nBefore I decided to move to NOLA it acted as home ba","useful":2,"cool":2},"-PtlQGgiECqPB_1JuujYqQ":{"text":"I stayed at the Hilton riverside for a conference. This place was booked and the lowest ra","useful":1,"cool":0},"lGmDRHncUTfd89lEmbwRxQ":{"text":"I had such a great time in New Orleans it's a shame I must come back and write a less than","useful":10,"cool":1},"nsGGQWShC2IoROGLt6tsLg":{"text":"I really wanted to like the hotel. After reading other reviews, I almost booked at a diffe","useful":0,"cool":0},"uw4urvYdWejUwu9YnIt4PQ":{"text":"Well, I DID stay here during Mardi Gras, so I guess I do have to expect that the entire st","useful":0,"cool":0},"3r117Iy65dK-MS98xrU4_w":{"text":"The amenities of this hotel are awesome, not to mention the perfect  location. But if you ","useful":0,"cool":0},"DcfNBdJJ2Xf0rsBAP-XewQ":{"text":"If I'm comparing this Hilton to my horrendous Motel 6 experience in Eureka, CA, then it ge","useful":1,"cool":0},"mu0hP6fuxbvb8HsUPMU3OQ":{"text":"We were in town for the final four and had a blast! On our way home, I asked the question,","useful":0,"cool":0},"0s_ZmOn0GCR6PSWRqQdKiw":{"text":"Been in line to check in for 15 minutes. Staff is eating in back room. At least 25 in line","useful":0,"cool":0},"7-32DwNoN3x7N6rIxtniWg":{"text":"Located slightly outside of the French Quarter, the Hilton is conveniently located to reac","useful":4,"cool":0},"uix3Vo-SM0WAVM7CcqkqCA":{"text":"Staying here for a conference. It's old, smells musty, and I caution anyone with breathing","useful":1,"cool":0},"whu1hDLVLFvYdQOoHyfYKA":{"text":"The front desk told me I had free parking on my block of rooms. When I tried to access fre","useful":0,"cool":0},"fYEP9AFiMf7e_7lFu58z4Q":{"text":"Well, after my first night in New Orleans at the Doubletree (review posted) I walked a few","useful":1,"cool":1},"KsVicYZ-BWFR2KGruYntkQ":{"text":"I usually stay at Hiltons for business travel, so I love the brand.  This one not so much.","useful":0,"cool":1},"5Q0D9OTO7fcI-cU9HsHK0w":{"text":"These days I prefer to stay at smaller hotels. I stayed at the Hilton Riverside one night ","useful":0,"cool":0},"AYlM37G0GPmZZYZkef3Hbg":{"text":"I stayed here since I was attending a cyber security convention. When I got to the room th","useful":0,"cool":0},"kmZlulpBaN4G60pRaz0hDw":{"text":"I checked into the first room and it smelled like mildew. The \"manager\" told me they could","useful":0,"cool":0},"d02K597Vlm6EcRUPS9gx8g":{"text":"My company stayed here for a business trip from May 4th to May 10th (6 nights).  On Saturd","useful":1,"cool":0},"kjF9RGjLDhhd-DfetbAUqQ":{"text":"Don't leave anything in the room because Housekeeping steals. We have stayed here countles","useful":3,"cool":0},"IufYIb0wC8AmlCyYc5g3tQ":{"text":"i stayed here last week for my honeymoon and despite being super sick, i had a fantastic e","useful":1,"cool":0},"4JNdmoxYJA_jzO9keQAneA":{"text":"Good location but the fact that you have to pay $44 a day to park is outrageous then they ","useful":0,"cool":0},"H4_0MTMbYEH_P4HZzSqk6Q":{"text":"This location is fantastic for both business and tourist trips to New Orleans. For busines","useful":2,"cool":0},"o4r25qKApwRgX9u1pte8zw":{"text":"Again we had to return to New Orleans and our choice of hotel was Hilton Riverside. We had","useful":0,"cool":0},"kR8iG-xiCgZAipUPzpmsYg":{"text":"Not the best experience I have ever had at a Hilton property.  The front desk staff was co","useful":0,"cool":0},"luu5RKAsK9hqjs-E10XNow":{"text":"Conference experience\n\nI stayed here for a conference and found the hotel to have its good","useful":0,"cool":0},"685uqBwgL5RcZUm3DDYXbA":{"text":"This place was awful from the beginning. There was confusion with our booking (3rd party i","useful":0,"cool":0},"ikZb99aZl12PVMcanMcxDw":{"text":"Very disappointed in Hilton. They want to charge their guests for using the gym. Tired if ","useful":0,"cool":0},"QAOT7meobG7iKygToaid-Q":{"text":"Came here for a presentation for the american society of criminal justice and I have to sa","useful":0,"cool":1},"nsjIYQ3gbbskdcvDoXlCPQ":{"text":"This is mostly related to the Hilton's hotel bar - Spirits Lounge and the manager Danny. I","useful":3,"cool":0},"Yfm-bB6StH9YJkKpSkgkOQ":{"text":"pros: 2 heated pools & 1 hot tub, hot water in my shower, on the riverfront streetcar line","useful":1,"cool":1},"XsxlPvIcBDH4FDYMcUSW8Q":{"text":"Gibt es die Möglichkeit 0 Sterne zu vergeben? Falls nicht, seit ich dieses Hotel gesehen h","useful":0,"cool":0},"DrQTjkC6Q0rCOPPBdZ1ryw":{"text":"I really wasn't a fan of this hotel. I've stayed in the Sheraton across the street and it ","useful":0,"cool":0},"kCO2xF0oUGhBaawjCuwVUw":{"text":"Well located if you're attending an event at the convention center. Also within walking di","useful":0,"cool":0},"cjFhoCJBOvexsgtwag-t5w":{"text":"Dont bring kids here. Everyone will glare at you angrily just for existing, even if they a","useful":3,"cool":0},"vQuIlvObonmsp-70x3DCrg":{"text":"I went to a wedding here, so this is a review of a wedding experience.\n\nFirst off all, the","useful":2,"cool":3},"MW1rfY-tQoW88PiofpLg4w":{"text":"I have to downgrade my previous review. I took a red-eye from LA and left my IPad on the p","useful":2,"cool":0},"OP7RIf6bD9sSzcubYOwRVg":{"text":"I'll update this review as the days pass, as I'm currently a guest. We drove our car and d","useful":3,"cool":0},"buYHfQnbGyAuJDenvVxppQ":{"text":"We are locals and like to visit the city randomly. We decided this hotel for the weekend a","useful":0,"cool":0},"4ADny5SGLFqI5J2LoUz2aA":{"text":"Great location if you're willing to do a little walking. Drago's is an added plus since it","useful":0,"cool":0},"9ZJrbCzHLgaZJpct2UUn_A":{"text":"Awesome view of the river, close to the convention center and Saks Fifth Avenue, and compl","useful":0,"cool":0},"hHpLBdy44KWR6AebCcqV0w":{"text":"Hilton New Orleans Riverside is in the middle of everything! If you have a trip to New Orl","useful":1,"cool":0},"tRMGeXAzU-De4qpNiJkfYA":{"text":"I just stayed at this Hilton for a conference.  The riverside rooms have all been refurbis","useful":2,"cool":1},"tZPi9ZAgjsqM60LM2UoHow":{"text":"Good service, great location, hotel is showing some age.  Could really use a spa,  best me","useful":0,"cool":0},"IYB8YSZuEeqCqHkqbYhn3w":{"text":"Really disappointed to be honest. Great location, nice bar and restaurant, service is well","useful":1,"cool":0},"2MN9KJhS7516TjyUv0rYWA":{"text":"Sometimes, when you go to a conference, your company makes you share a room in order to sa","useful":3,"cool":2},"Z33yGBkiW3ynmTVQ59SJXw":{"text":"Top line: it's a hotel! You can sleep there. It doesn't suck.\n\nI stayed here for 5 nights ","useful":0,"cool":0},"Os9Z5QfrcKNOnYOFphh3cg":{"text":"Located at the end of Poydras Street, it's an easy walk to the Canal St. street cars and r","useful":0,"cool":0},"l_ZjSJSkUDftW1eF0wX8qw":{"text":"The best hotel.. near indoor mall, onsite restaurant and I stayed in an awesome suite with","useful":0,"cool":0},"2NJw5BZmAF-1tvgxAl050A":{"text":"I am currently staying here at the Hilton and is extremely disappointed. For a four star h","useful":0,"cool":0},"kaEnMvRq9VSMAK4Uj9-R3Q":{"text":"I'm a Hilton devotee for my personal and business travel. I chose this hotel for its locat","useful":1,"cool":0},"WHun5vMeg3vMB54Cn0JpFA":{"text":"Beautiful hotel! I was fortunate to get a corner room overlooking the river when I stayed ","useful":0,"cool":0},"lJ7c0gsXO7v3n2ob2yrbkg":{"text":"The wedding that brought me to NOLA was happening at the Hilton and since the husband was ","useful":0,"cool":0},"MWxCTELvpSM1Lv3WnspcGQ":{"text":"If you are going to a conference and it is being held at this hotel seriously consider sta","useful":0,"cool":0},"hewZq3vvj57qkQ_-6B7Z9g":{"text":"Pros:\n* Free internet in the second floor lobby\n* Most of the staff was very nice and help","useful":2,"cool":0},"UdNIoSVb7mS0YEDAm9o6vA":{"text":"Great place to keep you close to the commotion of the city but not right in it.  You can w","useful":0,"cool":0},"fsQhNCerS9kOljivDSXkgg":{"text":"Excellent location! Harrah's casino is across the street. Riverwalk is right there. The Fr","useful":0,"cool":0},"X1UEvfvi93QHeM-l85YM-w":{"text":"Many negatives to this hotel.  \nTwo standout negatives with my experience here:\n1. We rese","useful":4,"cool":1},"FXNg1FPtnvnEo8hTBpCxuQ":{"text":"The Hilton Riverside is proudly hosting ALEC, the American Legislative Executive Council, ","useful":0,"cool":0},"-BwBmGEIMKjjdzlU3Sl0Rg":{"text":"The front desk woman was sad, the hotel pool was sad, the room service was sad, the air co","useful":1,"cool":0},"oiBub5n92x1VVvhI5WMjLg":{"text":"Good hotel, standard Hilton hotel. \nBonus star for having Drago's right downstairs with th","useful":0,"cool":0},"BkTKgL0semcbJMmBclGsEQ":{"text":"When we first checked in, we had just unpacked and decided that we needed to ask for a roo","useful":3,"cool":0},"EHMZwfgJe_U_eiiL-BWT3g":{"text":"Very Nice Hotel - About one mile from Superdome but a walkable distance. And two or so blo","useful":0,"cool":0},"sLyo6HkcrwxDWOeK3b0VQQ":{"text":"My college days have long since passed.  While my trip to New Orleans may have been in the","useful":1,"cool":1},"mejqZvuzhi730hwEcI_ydQ":{"text":"Beg Bugs!!!!! I got about ten bed bug bites on my feet! Never experienced this in any hote","useful":0,"cool":0},"zDKTL2emwOvzUrrxPd1Ksg":{"text":"Room service was inadequate, often late and didn't replenish coffee. Dresser drawers don't","useful":0,"cool":0},"dfiNWNpH8ClU_fjHhdb-JA":{"text":"I stayed here for two nights attending a conference. The hotel and conference facilities a","useful":0,"cool":0},"06mpYnniL4jCmoX0A8_m1g":{"text":"When I returned home I realized someone who had access to my room went inside my travel to","useful":0,"cool":0},"pB59cRsYGOE2QEz0rG1BOA":{"text":"Good hotel for it's price. We really didn't have much of a view but then again, NO isn't e","useful":0,"cool":0},"ooh_ruZpuEl-Ob785sULGQ":{"text":"This place is a dump,  room smells like an ash tray and mildew,  I tried to eat in the res","useful":0,"cool":0},"QDClJ5SqU0sM0pGxTNr3TA":{"text":"I came to New Orleans for a conference and it was at Hilton New Orleans Riverside. Since I","useful":1,"cool":0},"D28xk1FxkKnVXbpe3k3iQQ":{"text":"Great hotel and superb location!  I was in town for a convention and was very pleased to s","useful":1,"cool":1},"ee_40LnrpS-788fGmsh4Zw":{"text":"To my amazement, I have to give this property 4 stars. It has been upgraded since Katrina'","useful":5,"cool":5},"3cfv55X5eVMChJkLWst1MQ":{"text":"A six day business trip May 4-10 turned into a nightmare when over $1300 worth of jewelry ","useful":3,"cool":0},"lczganvSr-PPd-67DdKmHg":{"text":"$300 room and no indoor pool and $12/day to use the gym. I had to run a mile to another Hi","useful":0,"cool":0},"nqo59SRz75e3VO68mW7gPg":{"text":"We stayed here one night during Jazz Fest, then moved to the Marriott for a less expensive","useful":2,"cool":0},"gbRpOwUvkaeeQXBfVQyYIg":{"text":"Ideal location. Next to River Walk shopping, ferries and the river boat. Located in New Or","useful":0,"cool":0},"G2AAwvBqrsz-8Pyq_95Klw":{"text":"I find myself agreeing with a lot of the other reviewers.  I was in town for a conference ","useful":2,"cool":0},"1bPm-eQQvGIbp3qF58ymAA":{"text":"This is the worst hotel I've ever stayed at.  \n\nI received an e-mail a week before my arri","useful":0,"cool":0},"KkgMfOHDyoJRIng4nJZO4w":{"text":"Not recommened unless you enjoy being nickled and dimed for amenities that are free at man","useful":1,"cool":0},"1ndm_7kuMnjEfA4gii3PyA":{"text":"The Hilton offers everyhting you could ask from a hotel. It has restaurants, bars, store, ","useful":0,"cool":0},"4K-WdFd--A2hUUYTmxkduQ":{"text":"Stayed here for six nights when in town for a convention.\n\nLocation was great if attending","useful":0,"cool":0},"XeknMSoyj_TyMuduCbFVsg":{"text":"I've been a Starwood guest for years and remain loyal,  but this was a wonderful stay. We ","useful":0,"cool":0},"7VG23cRO4bH_pJnk3P5-Wg":{"text":"I had a seven day stay recently,the Hotel was the worst Hilton I have ever stayed in. They","useful":1,"cool":0},"eSQy6_EQpMSPfcsc16dyRQ":{"text":"Check your bill carefully!  I was told there would be NO charge for internet because I am ","useful":2,"cool":0},"NBhfPrJmOvhfcXif2Rxp5w":{"text":"I am a Hilton point whore, so I was pretty pleased to find out a conference I was attendin","useful":0,"cool":0},"5YquVoIMZm4Sqks_fEIeDA":{"text":"They failed to inform you that there is construction going on outside your window starting","useful":4,"cool":0},"phxHw08Fs0StXdAlWorTYQ":{"text":"Always love the Hiltons. Had a room overlooking the Mississippi River on the 19th floor. E","useful":1,"cool":0},"pKSUdUm6tRfUYBEUkjnJng":{"text":"I and my lady spent two nights here and it was perfectly fine. The location is excellent a","useful":0,"cool":0},"Il2tt7GQQf9Xf8iprvRVHg":{"text":"I love Hilton and I'm a member. This place gives Hilton a bad name. I booked a riverside v","useful":1,"cool":0},"QCgjhCSklDTKMtZ_mfVO1g":{"text":"Oh my God! Where do I start? I stayed at this hotel from Jul 22-25 with my mom and little ","useful":0,"cool":0},"4xDLewZvwMMDmDj2sA0zhg":{"text":"Although I love the Hilton Brand, this property let me down. The room was typical Hilton; ","useful":0,"cool":0},"Tm0Yvj83prmzGMGV7ROgxA":{"text":"Solid location. Very clean rooms.  Excellent fitness center.  Poor wifi access, inconsiste","useful":1,"cool":0},"8CG5p16MCwenR8_tcZUIVg":{"text":"Had an issue with my reservation and the manager Charlotte went above and beyond to provid","useful":0,"cool":0},"KVtl-vbndJ1A2vj_YLqvMg":{"text":"If you can fit it in your budget, stay here. \n\nWhat a great hotel. Right on the river, gre","useful":2,"cool":2},"CY2XxeldgfXDQlxrumDZ-g":{"text":"I'm writing this review as I am staying here. We checked in on Friday night. On Friday we ","useful":0,"cool":0},"POTAMllvW5sx-GNvwmuWeQ":{"text":"The location of this hotel is ideal: at riverside, next to the casino and easy walking dis","useful":1,"cool":0},"DEmm7VhWwLQ49AWhwtRfFw":{"text":"I was having a little get together and I went to take a look at the hotel before I actuall","useful":2,"cool":0},"ZfPTwSscrjUx20S-yY1LXA":{"text":"First impressions of my room:  Is that an old french fry on the floor?  Gross.  Is that a ","useful":3,"cool":1},"KeYz7hRvEa95PvvINiTEBQ":{"text":"The parking is maybe the most expensive in the city. It starts at $13.00 an hour, and this","useful":1,"cool":0},"4xBSG_VzZ4SaWHP4gvpvuQ":{"text":"Filthy and gross are possibly the nicest words I could use to describe my stay at Hilton N","useful":2,"cool":0},"7o_-7juqx5RGDnEHeKeDBg":{"text":"Went for a brunch,  it was way over priced for a basic breakfast brunch and by far the wor","useful":0,"cool":0},"JBrhp5ut5nv6zWsieira-Q":{"text":"I would LOVE to have given this place a four star review, but some of the minuses out weig","useful":1,"cool":0},"j0zET0-Hpah1ZaG0c-sIGg":{"text":"We stayed at the Hilton New Orleans Riverside for a group event. I don't think we've ever ","useful":2,"cool":1},"mceopOFerM2BhNSeXLRUog":{"text":"After reading some of the reviews I was not happy about being assigned this hotel. WELL I ","useful":2,"cool":0},"uIuQwbE5DAGrxcN162Ws2Q":{"text":"I thought this hotel was really nice, despite the negative reviews I read prior to checkin","useful":0,"cool":0},"EKitOA4FZSlX-TzgM6DB4w":{"text":"Considering your hotel options in New Orleans, you really can't go wrong with the Hilton R","useful":0,"cool":0},"6zvXJVhF1F8Bjx1odBsx_A":{"text":"Stayed here during my recent stay in New Orleans.  The hotel is located along the river, j","useful":0,"cool":0},"leXd8VcCAq5-Py3jrZBdUA":{"text":"1 Star for Location\n1 Star for the Staff\n1 Star for Housekeeping\n\nThis hotel is easy to ge","useful":0,"cool":0},"RBf_S8zMKuOeaF9PmWU34A":{"text":"Gute Lage, moderne Zimmer und sehr viele Parkmöglichkeiten. Der Preis war nur durch das Ja","useful":1,"cool":1},"ydYldYkOhUUB2cTxqDn-Vw":{"text":"The lobby is on the second floor. \n\nThe rooms are located in separate towers.\n\nTake the ev","useful":7,"cool":6},"6lBYuhu_owytak3phXjE-A":{"text":"Room clean: check\nmaze like location: check\nNice staff: RoseAnnie who works in the starbuc","useful":2,"cool":0},"8RhIyVqnguYWj2GlScytjA":{"text":"For you char-grilled oyster fans in the audience, Drago's is your kind of spot. Sit at the","useful":1,"cool":0},"nma9-UR8AWvdSPaN2vmfKA":{"text":"Location is great. Oysters at Dragos are still dynamite. The staff is pleasant. The only r","useful":0,"cool":0},"6hb3hOqF2I4W8P3bP4WnNA":{"text":"We were given a room which faced the train track. The train blew their horn twice in the m","useful":1,"cool":0},"kVB09d2sRds-gc1W3PE5mA":{"text":"First of all, the location is really ideal - it's attached to the Riverwalk and has the Dr","useful":1,"cool":1},"Ce3shevkc6US9edJYPo84Q":{"text":"Rooms are not very big. The hotel is quiet. Located by harrahs and convention center. $1.2","useful":0,"cool":0},"zB7oPvnsftfxLlzvSPy0qQ":{"text":"I give this place three-and-a-half stars.  Rooms were nice.  Staff could use a bit of trai","useful":0,"cool":0},"JB7Py6liwccL7Eol2IePEQ":{"text":"Incompetent and rude staff. My original flight was postponed one day (thanks \"New United\"!","useful":0,"cool":0},"QOeecdhqbTuozrHZNIFjqA":{"text":"Convenient location if attending convention center event.Property is tired and in desperat","useful":0,"cool":0},"rokvgKnhB9erQwVu4wYYNg":{"text":"A great experience.  A tad bit pricey but it is New Orleans     The room was top quality. ","useful":0,"cool":0},"-lyeII61oIjblQe72szoTQ":{"text":"I stayed at this hotel for a convention in May 2016, (the lack luster rooms were over pric","useful":0,"cool":0},"sXTdA3hpBi6Z9jmFw6i0Sw":{"text":"Overall it is a good hotel. Good location bc you can walk to may areas. Casino is across s","useful":0,"cool":0},"d985IS6P1lVVwm6hvthBLQ":{"text":"The plus: it's on the river and within walking distance of the French Quarter. Otherwise, ","useful":1,"cool":0},"A_KqMoofc9DVWEZQhmMFew":{"text":"Booked the Hilton because my husband is a Hilton Honors member. Hotel was a 5 minute ride ","useful":0,"cool":0},"qBqovN2sdX81PZj8r8gcbA":{"text":"Everything about this place is overpriced, and staff didn't give me a four star treatment.","useful":0,"cool":0},"ErcPLUZC2xPNCIQUCabXLg":{"text":"The hotel itself is very nice. The conference rooms are also nice. The bar & Drago's are p","useful":0,"cool":0},"Uz-9N7ied8ipcBTsSoDShA":{"text":"Stayed here a couple of nights for a convention being held at the center next door.  The r","useful":0,"cool":0},"5vKYCLY8799nCyIy5doQFQ":{"text":"I stayed here while in New Orleans to see the Ohio Bobcats play in the New Orleans Bowl.  ","useful":0,"cool":0},"h8J_jOm0vxxrKFPItaEuhg":{"text":"Gibt es die Möglichkeit 0 Sterne zu vergeben? Falls nicht, seit ich dieses Hotel gesehen h","useful":0,"cool":0},"8ZG6YhUivZJjzc6doF_UPg":{"text":"I guess I am just sick of the hype,  This place is just an old disgusting, over priced hot","useful":0,"cool":0},"8wQRo9dExRAkUNzcugf1Ww":{"text":"This hotel, and frankly Hilton, should be ashamed of themselves for the room rates they ch","useful":1,"cool":0},"CRHn4wnGe3E62KxOGn9DaQ":{"text":"I love this hotel.  Not too far from Bourbon Street, where all the wild crazy fun is.  I l","useful":1,"cool":0},"xBJZO92If1cB4L1Zr_iMGg":{"text":"My husband and i came here for MACNA 2017  August 24-29, mostly because the conference lis","useful":0,"cool":0},"dw4bN_xM867DLuMS4Ghc4Q":{"text":"Came here on a recent work trip. We used several conference rooms, had food catered severa","useful":2,"cool":0},"v_igCrD0ERPVq3WQo-dEHQ":{"text":"Giant hotel. Can be a zoo. We checked in via the mobile app and even got the key on our ph","useful":2,"cool":0},"14Ys0z_f4x8PNkHkS_JMfA":{"text":"I agree wholeheartedly with Courtney L's review from June 2017.  I stay at a lot of Hilton","useful":0,"cool":0},"pC78xIL934uE3VB8KHrRFg":{"text":"I stayed in this large Hilton over the course of Mardi Gras weekend. Due to a Krewe's ball","useful":0,"cool":0},"fV952FMsGW8kVP7uA3apVw":{"text":"We just spent 6 great nights in New Orleans at the hilton. I must say this has been our be","useful":0,"cool":0},"NKfTO1AVATOz0iwJqQf-_g":{"text":"Clean rooms, great atmosphere. Awesome views of the MS river. Was only in town for 3 night","useful":0,"cool":0},"ww-QwfIgJfto7b0pgPoJXQ":{"text":"Stayed here 3 nights for a conference and hated it, for a business class hotel I'd expect ","useful":0,"cool":0},"EK5_U99mzf3fwdQ6L1jqjQ":{"text":"Checked in at 1230 am,  after driving 5 hours from Montgomery.  I ordered and pre-purchase","useful":0,"cool":0},"cBNsEY1M4cj6aoyNOEUZ8A":{"text":"Central location & Friendly Staff. But book for conventions only.\n\n Hilton usually serves ","useful":0,"cool":0},"3XqNc2kHPF04Xc1_8P9Hag":{"text":"Good location, and adequate rooms. It's a Hilton.  Only knocks for recent visit were blata","useful":1,"cool":0},"yStIApKnLtXpvvfDcjt4zg":{"text":"Ok.... this is not an ive's stayed here review.  This is a.... we hold an annual party her","useful":1,"cool":0},"3PS6323WkHP0CYfeKjmOag":{"text":"So we stayed over the holiday weekend.\n\nOver all the hotel is great and was priced great. ","useful":0,"cool":0},"7LklqkpoMmiLJGe0k2v6BQ":{"text":"I stayed here for NCORE 2018, a 3800 participant conference. The conference facilities wer","useful":1,"cool":0},"x2h6mtJK2HzYvUfnx1Ft7g":{"text":"We are Hilton Honors members, and have stayed at many of their different brands. We booked","useful":0,"cool":0},"b24Nd5u8k0Z5DLpTCj40VA":{"text":"I enjoyed my stay here. Very large hotel near everything.  Unfortunately, the pool had bee","useful":1,"cool":0},"j16fYnfzud95ASEYSSeBDw":{"text":"I have visited this hotel many times over the past 5 years for various conferences.  I was","useful":0,"cool":0},"hMvcKiHvUOEucJOOrWi26w":{"text":"I feel that this Hilton is acceptable at best.\n\nUpon arrival we were told our SUV was too ","useful":0,"cool":0},"eakPCgAsE4hVClwooPzi7A":{"text":"Wonderful and updated hotel. Grand second floor, open-courtyard feel that looks down to th","useful":1,"cool":0},"24Zz9Gm8ng0AopMwimNc0A":{"text":"Lousy convention center! \nOverflowing trash containers.  Poorly stocked bathrooms that are","useful":0,"cool":0},"Om7KBkBMInPC9ANYyX78MA":{"text":"I thought I posted this review last year, June 2015 But it's been in draft form all this t","useful":1,"cool":0},"gLxKqLCHz6jzvQvQPblUEw":{"text":"Stayed 4 nights 5 days at the Hilton Riverside.  We arrived early around 11am and the room","useful":0,"cool":0},"CR6QMTVVVSdcF_I32yDYkA":{"text":"This is a really nice hotel.  It definitely needs some updating and I was told that that i","useful":0,"cool":0},"LEWS8wV-IFDzFBDjdHr2Zw":{"text":"Sucks when u have reservations and these people tell u they overbooked and don't even care","useful":0,"cool":0},"4JUTTjMlqq_P6qqwkXuABw":{"text":"The location was great and close to the convention center. But I was disgusted by the cock","useful":0,"cool":0},"ADvb5KLhAZ4h6t5h9s4A4A":{"text":"Don't bother wasting time with the app and selecting your own room at check-in time. They ","useful":0,"cool":0},"3ecjm41mvC6FQloehh7KAw":{"text":"Meh, definitely unimpressed. Catering and banquet services were not bad, so our business m","useful":3,"cool":0},"TQHLZ4_XIQF23St365K4PQ":{"text":"Planned a trip for Mardi Gras with friends & ended up staying at a few different hotels b/","useful":2,"cool":0},"Y1EtEUKemBxLr5q1KoidRA":{"text":"Great location, staff and rooms! We come to visit our son at Tulane University and stay he","useful":0,"cool":0},"8KnfZzg90vsKlkydlrQ4Hw":{"text":"As part of our hotel reservation, the hotel didn't even offer the basic amenities as part ","useful":0,"cool":0},"tIGKEUZ4ByB9YeiUnXFF-Q":{"text":"Two stars for location.   Bar and breakfast bar way over priced, this place is more ridicu","useful":1,"cool":0},"K-IZnfnyorohhllh_VZGOg":{"text":"What kind of major hotel chain has NO notary??? I have to have the concierge make a hand w","useful":0,"cool":0},"VwvhlDpu82qhidxtnycEjA":{"text":"Cockroaches in room and horrible follow thru.  Not a Hilton Experience.  Very disappointed","useful":6,"cool":0},"FHWU7ju6TMO2g6oa-aUM0A":{"text":"I stayed here while attending a conference in October. I was one of 10,000 managers stayin","useful":0,"cool":0},"WsTwsfA6AGO51wHR4wNd9g":{"text":"This hotel is really big, which is good and bad. It can be cumbersome getting to things, b","useful":1,"cool":1},"lHj_wjl6s3OUxkOl9gqgJw":{"text":"Love this Hilton especially because of their health club. Having a decent gym is pretty mu","useful":1,"cool":0},"tQxkUMfbS0DWSTVkbwYSEg":{"text":"The rooms are dated and they seem to cater to those of us going to meetings and conference","useful":0,"cool":0},"MRM2ZaCObGi0iTbisBFfvA":{"text":"Nice, clean rooms.  Good location.  All positives for this place are negated by the multip","useful":3,"cool":0},"QO69YTc60TwIG8SDtbkDnQ":{"text":"I actually didn't stay here but my conference was held here (and at the Loews). It was wel","useful":1,"cool":1},"Q5xbFsZJfV2KImRZBeGz7A":{"text":"Very nice. This was comp room from a friend. Thanks Janet and Gary!","useful":0,"cool":0},"-qYROSNW3nmfYC1ef7xNGg":{"text":"// LOCATION // Adjacent to the Convention Center and Harrah's Casino. 10-15 minute walk to","useful":0,"cool":0},"0br-IxQ4FpPL-XRd02Uo_g":{"text":"We got a really cheap room at the Hilton for $99 for two double beds. It was a really larg","useful":0,"cool":0},"V_xbQBkidqF3UDAA3XZctg":{"text":"I know, I know, the Hilton Riverside is a chain, but I am breaking my vow to only review i","useful":0,"cool":0},"T6px_gifwuzRk-XIaXtysA":{"text":"Huge hotel! Check in was very busy but our room was ready early and the front desk staff w","useful":1,"cool":0},"ZDzjOXLba3XRQqcVomYb-Q":{"text":"Please avoid if you can. New Orleans was awesome. The Hilton New Orleans Riverside was a m","useful":0,"cool":0},"dgJ_TxsDraQSDs3Z1d5Gkg":{"text":"It used to be that hotels would hold a package for you as a service.  Now they have gone t","useful":0,"cool":0},"fJsoOZQ0r5GzWxKi_ZHS7Q":{"text":"Absolutely nothing wrong with this Hilton!\n\n1. Drago's is RIGHT INDOORS. Super convenient.","useful":0,"cool":0},"gOasmNnvFMYg6tRa-2MOZg":{"text":"The hotel and staff were amazing! The rooms are very clean with plenty of space. The only ","useful":0,"cool":0},"PzLnYTFsYCfR9fXgZ6Tvhg":{"text":"This hotel is in close proximity to everything you could possibly want to do in New Orlean","useful":0,"cool":0},"NSYatIBowOhoumT_3fgkKw":{"text":"Although the room and hotel features are nice the front desk staff is rude and not at all ","useful":0,"cool":0},"CzjuxbbHlg0AkuKWVyRlIw":{"text":"I enjoyed this spot. We were only there for one night but I would have stayed a couple  mo","useful":0,"cool":1},"rXIvQqZSmn4bHE0jF9Bbug":{"text":"The hotel rooms are very run down and smelly. No upgrades have been made to the room. The ","useful":0,"cool":0},"FmEv7NaPlxtB_VCMx_6fiA":{"text":"Cockroach in bathroom.\nCalled cleaning service but they didn't show up.\nWent downstairs as","useful":3,"cool":0},"IQBcY8NIcgUm0bAfJ4kiFg":{"text":"Very poor experience. First, no toiletries in the room.  Then the jacuzzi that they boast ","useful":2,"cool":0},"_zsUt4b3BRDuubrdQzo3dA":{"text":"Efficient, accommodating, and friendly staff and management. \nLess a star as Hilton websit","useful":2,"cool":0},"fVMF6L2lKyrrK42fWTR_BA":{"text":"This is a nice hotel located right on the river and adjacent to the convention center.  Th","useful":1,"cool":1},"E_vTVR2xbcfZlbwTx-jFMQ":{"text":"This was a strange and overpriced hotel. $325 a night is a bit ridiculous. The pricing for","useful":0,"cool":1},"s6e7Yh6dULkxTyOlUp27mw":{"text":"The Good... It has a good location if you're in town for a conference at the Convention Ce","useful":2,"cool":0},"DH_6qlZBv8GsWrcK_9i7Sg":{"text":"Room was clean and comfortable.  Not sure how old the hotel is but my room looked and felt","useful":0,"cool":0},"-learI8qyq2m2kbxPjKyrg":{"text":"Hilton Riverside is a nice hotel along the Mississippi River. It is conveniently connected","useful":0,"cool":0},"9ABGY2w2p6Q2LjOV3Pg7SA":{"text":"I have stayed here numerous times prior to moving to New Orleans.\n\nThe executive lounge ha","useful":1,"cool":0},"pJD-ACuN1gz9gyxJAbk2oA":{"text":"DO NOT stay here. Rooms were fine good location. But I have a confirmation for one charge ","useful":1,"cool":0},"oz0ghZd4I3fYlclLVmOKUg":{"text":"If you just need a bed then this would be fine. Disappointing for a Hilton. Zero shade at ","useful":0,"cool":0},"weDvGpDkxRgC3wR8WSVngw":{"text":"It can be a little tough to find the entrance to this hotel the first time you go.  \nWhen ","useful":0,"cool":0},"fDv3kdL6Mp8-fWWwXzY4LA":{"text":"We had a very pleasant stay here. Stayed here for four nights around Mardi Gras time, whic","useful":3,"cool":0},"VgETV2cQrTfiUuriqpWpAA":{"text":"This place is really in need of an upgrade, both in terms of it's facilities and it's mana","useful":2,"cool":0},"-BAbMnFPXFFSDFlylYTA4g":{"text":"The location is great. Walkable and easy access to transportation. The mall outlet is conn","useful":0,"cool":0},"3GnfH_v3T15zbyEBLPacmw":{"text":"Do not stay here.  I'm staying here for a conference at the convention center.  There is c","useful":0,"cool":0},"W3sx95s16TuprG2fvGtEzg":{"text":"Second day 1:00 pm.  Key did not work.  OK, that happens. Back down.  Get a new key.  Back","useful":1,"cool":0},"iaOhLQw2QTavv6wjD1UFPA":{"text":"Now I know not to book a hotel that is also a huge conference center. Check in was pretty ","useful":1,"cool":1},"U__VcMCq9aWvxx5mVf6GbQ":{"text":"I don't get the knock on this hotel. It can be touristy and full of conferences, but I've ","useful":6,"cool":1},"IgUd6r_bNT3dRqS6f13iKA":{"text":"Perfect location near a streetcar stop and the outlet mall, maybe a 6 or 7 block walk to C","useful":1,"cool":1},"J46RoWffnoQiatq-FDR3eg":{"text":"Worst Hilton property that I have stayed in. My room smelled of horrible cigar smoke.  Gue","useful":1,"cool":0},"WM_yt2LYR1Kde4qNxEqH9A":{"text":"What a joke. 28 people in line to check in. 14 stations with only 3 attended. Line hasn't ","useful":0,"cool":0},"FfFWd6LC-VItg6SwjvkybQ":{"text":"Hotel is in a very good location connected to the river walk mall and across the the stree","useful":0,"cool":0},"ozsU2O4OrpxmC_THyuiZoQ":{"text":"Wonderful staff and great restaurant (Drago's). I'm only giving two stars because my hotel","useful":3,"cool":0},"uzOntSW771RjkejMExXN6w":{"text":"This hotel is a total joke. I was quoted 1 hour and 45 minutes for room service\nNo one car","useful":0,"cool":0},"vk04px9UF92r6KhfHh0CKQ":{"text":"We had a wonderful stay. We were in town for a conference and I was amazed at how well the","useful":0,"cool":0},"KylhgyJ6r-E6-ffDPovzjA":{"text":"Great hotel! Top notch service, food, location.\n\nTip:\nIf you have an opportunity, check ou","useful":0,"cool":0},"hrEkY4wV3bFGogbEgocYgw":{"text":"For the price (and for a Hilton) I definitely expected better.  The location was fine but ","useful":1,"cool":0},"GhWSAri7wYQOV7B-_k7nJQ":{"text":"Not impressed. Very first thing we were given a room that already had someone staying in i","useful":4,"cool":0},"iwlYE8JIj-1j2ZmcCXc5yQ":{"text":"Attended conference at hotel.\n\nRoom....clean, good.\nHotel....hallways dirty, room service ","useful":1,"cool":0},"y3Q2I-v1sT6sal0BLQM46w":{"text":"By far one of the most poorly designed and arranged places I've been. Takes forever to fin","useful":1,"cool":0},"KNM1HlXcgC4xGcTMciTN4g":{"text":"A good hotel a bit past it's prime. Spacious rooms and everything you need.  The interior ","useful":1,"cool":0},"RWeChHrlXca0J9UC-qausQ":{"text":"Nice location by the riverside. Good size rooms. Small bathroom though. Housekeeping was e","useful":1,"cool":0},"KRoOQmfmNgYC3Hpk2wfD5Q":{"text":"Everything everyone else are saying about hotel  \n\nGreat location\nGreat service throughout","useful":2,"cool":0},"2UkwdUfV3UR22uZHUNZy2g":{"text":"This hotel would have been really great if it wasn't for the fact that the housekeeping st","useful":0,"cool":0},"aRUjwFv5JDBQIp3AF0VP_w":{"text":"3.5-stars. A sprawling hotel + conference facility perched close enough to the French Quar","useful":0,"cool":0},"IAJGPpUXLrGp4Wt3J4NCfQ":{"text":"You must be kidding.... I kept checking if this was a Hilton.... The room was nice but the","useful":0,"cool":0},"kYbGzgwK4tpbGeny5MsDRw":{"text":"VERY large hotel. Attended a conference here. Nice, large hotel rooms-- many courtyards ov","useful":0,"cool":0},"PbffZM7wA9UovOhZuGIM7w":{"text":"-Location is good; has a trolley stop\n-Lyfts and Ubers arrive immediately, almost no wait\n","useful":2,"cool":0},"RNljlYPvYFcmRZhnw5hBhw":{"text":"Thank you to the parking lot attendants who saved the day and taped our windshield. Watch ","useful":0,"cool":0},"d10Ikb1BS4bfUK1KscSYOA":{"text":"I was utterly disappointed with this hotel. It fell well short of my expectations - ESPECI","useful":3,"cool":0},"bb9sbjHtErseR3aWCyeHeA":{"text":"The hotel is undergoing some construction so, hopefully, at least some rooms will be an up","useful":0,"cool":0},"QD1zY-kY9zVtj97E6f1chw":{"text":"My health hazardous stay at the Hilton (Room# 727 & 2002):\nI was expected to sleep in a ro","useful":0,"cool":0},"JdhpIa233jFy-qdLdaynTQ":{"text":"The best part of this hotel is in the name...riverside! Be sure and ask for a river view i","useful":9,"cool":4},"wm3bUkHKy_S-tE7yneJqzw":{"text":"I expected better for a 4 star hotel. The hotel doesn't have much amenities. No in house s","useful":0,"cool":0},"bB21CNjkdr5UctE7MKHw5g":{"text":"I stayed at the Hilton New Orleans Riverside Hotel recently and thoroughly enjoyed it. Thi","useful":0,"cool":0},"PF1mgYEYlipW4ihdopzxzQ":{"text":"I've stayed at this hotel several times and I was excited to know this would be our host h","useful":2,"cool":0},"o65lLLu8zMN3WkBIVa1rqg":{"text":"Came here on Oct21-25 for a conference and the suite on 29th floor was horrible! Room was ","useful":2,"cool":0},"EVp8bsyYvndc2NNcUYyP4w":{"text":"They need to figure out their amenities. For $250+ per night they should not be charging f","useful":0,"cool":0},"YbaYPOoRAhqm16_jpCEgBw":{"text":"I'm following up on my last review.\n\nAfter a number of attempts, customer service got back","useful":0,"cool":0},"TCKM2mAlpMa4mGROavtXGA":{"text":"Last time I stayed here was almost 15 years ago, and at that time I thought it was a decen","useful":0,"cool":0},"EToZ6I3tRgZx1Gx5qJ_jpQ":{"text":"Nice hotel and it's on the river. It did smell a bit musty inside. Room was clean, hotel f","useful":0,"cool":0},"9w9dEZXxnRiuVa9nCsDuWQ":{"text":"This is one of the worst hotels that I have ever been to. The staff was extremely rude, an","useful":1,"cool":0},"zhGmJkmNVVX4w3xbQmhR-A":{"text":"Traveled to NOLA for business. Stayed in room 2042 double queen, because my King room was ","useful":0,"cool":0},"UVvOX1OlpTtWbwvOAahsjw":{"text":"This was our first time in New Orleans (NOLA). We came for Labor Day weekend. The first pl","useful":2,"cool":0},"1kXTUOSrwRTsNh4kpB17-Q":{"text":"When you first get here it's a little complicated to find a parking spot if you have a tal","useful":0,"cool":0},"fdydHvPsycTAa55LWCV9Kw":{"text":"I have stayed here a handful of times. I have never been impressed but the location is why","useful":0,"cool":0},"wChwgjW94ukTAQc7jf87mg":{"text":"I've stayed twice at the Hilton: in 2010 the week leading up to the Super bowl, and in 201","useful":1,"cool":0},"KiVjmOrOrbQoY0vQsUAJ9w":{"text":"WORST HOTEL EVER \nthis was my first time staying at a Hilton i never stayed her before cau","useful":0,"cool":0},"RLJXB6adWYb4QYQ8JuwyYA":{"text":"Black lights be damned, nothing says \"home\" to me like a hotel.  When I click the heels of","useful":2,"cool":0},"kjhWLnSWsFakPvRLA2r1wA":{"text":"I just stayed at the Hilton this past weekend for Mardi Gras with a few friends. \n\nThe goo","useful":1,"cool":1},"dXzT-JoQhMMdJY42lFItKQ":{"text":"Stayed at he Hilton during EMS Expo. Group of 11 with many of us on the same floor. The Co","useful":0,"cool":0},"AudF6qOq2GD3cjpVNB8F8A":{"text":"Nice hotel on the Mississippi River. I was in town for a conference at the convention cent","useful":1,"cool":0},"7gseRTaR_ussOSB1uVxSpg":{"text":"Enjoyed everything about my visit.  I was there for a total of four nights and the hotel s","useful":1,"cool":1},"o4VMedPGzqDcb3pKnrRJDg":{"text":"I stayed at Hilton Riverside for a conference last month and it was HORRIBLE. We had a MOU","useful":1,"cool":0},"3bstnsFt3XFIHR5JLtXuug":{"text":"I just want to take the time to say thank you to your best team member at the front desk n","useful":0,"cool":0},"V1jthF1aACCgwRbfXDGNMg":{"text":"Most respectful staff I have met! Best place to stay with no disappointments from the staf","useful":0,"cool":0},"UvTNXsmMKmp9ibnjTc_9Lg":{"text":"So disappointing....Excited to get into NO for the weekend only to be greeted with unwelco","useful":0,"cool":0},"7HEFA1D38ZQLMPOlmAeuNg":{"text":"Rude customer service agents, no shuttle service and the in room dining is very poor quali","useful":0,"cool":0},"qt-WSVctvRFaR5dJh7I_rw":{"text":"i thought i was in a cloud then realized it was a hilton bed.\ni just accidentally took a 4","useful":1,"cool":0},"6Sfk25kgLg01qGUiieJ-xg":{"text":"The hotel was outstanding as Hilton's always are. My only complaint was that there is noth","useful":0,"cool":0},"UxsNWgEtn7ZT0tC25Vwbaw":{"text":"Where to start? Let me start by saying if you can, don't stay here. Definitely not a four ","useful":1,"cool":0},"AJ6CWD3A2RIHkYXf2qrdtw":{"text":"I really enjoyed staying here.  Since I'm a Hilton Honors member I didn't have to wait for","useful":0,"cool":0},"ztR6REqTu6eUcSBZYi05zg":{"text":"This hotel is a bunch of contradictions. It is luxury in some ways, and like a motel in ot","useful":4,"cool":2},"9FMuSrtCdTkivtJA33M02g":{"text":"I have been very disappointed with his hotel their service. Refreshing my room has been ho","useful":4,"cool":0},"RJ2cTl0-wS2r4PZV_saiOA":{"text":"Old hotel that definitely shows its age.  Very small outdoor pool for such a large place. ","useful":0,"cool":0},"92CNASzbDCP2OHN_4CAntw":{"text":"I always book Hilton when it's available because I know what I am getting. But this Hilton","useful":0,"cool":0},"se4vmDho1wZ7a-DFZufRsQ":{"text":"I stayed last week all because I stayed last year... while attending a convention last yea","useful":3,"cool":1},"1GU4ng9EhwJtNGZqwqdzWQ":{"text":"I travel frequently and have stayed at hundreds of hotels. Some are cheap and some are rat","useful":0,"cool":0},"q2wR91z7bTUpwrbuaJQV5w":{"text":"I have stayed at some of the other Hilton owned properties (Doubletree and Embassy Suites)","useful":1,"cool":3},"lBhJKk26OyzYDmCy-6-CUQ":{"text":"Normally, this was one of my favorite hotels in New Orleans. This time wasn't so pleasant.","useful":2,"cool":0},"M5H3W0wPzc3zMZ1g_RtkGw":{"text":"Hard to find a hotel everyone likes in New Orleans because all the hotels experience heavy","useful":3,"cool":0},"Wy6TiDksIKCl_jcgHhjT9Q":{"text":"We sent guests here from our travel agency.  The rooms were very expensive for the product","useful":1,"cool":0},"xYPLKtOkqV0JjRZAM3I7pg":{"text":"Hotel wasn't bad but my wallet was stolen at the bar down in the lobby area and they could","useful":0,"cool":0},"BZIv6c5SwAKbHKafE972Zg":{"text":"We stayed here while in town for our anniversary. We upgraded our room to the executive le","useful":0,"cool":0},"HUwaDtLdbgjI0JMM2_dimQ":{"text":"Stayed here for a conference. Location is good . It's attached to the river walk shopping ","useful":2,"cool":1},"TmYxyGTZF4OMWNbEJGpH1A":{"text":"If I could give zero stars, I would. I was in town for a conference at the convention cent","useful":0,"cool":0},"sg4COKJ8eBjG3STA2DQhyg":{"text":"Hotel rooms are in need of paint job and upgrade. Also, this is the loudest hotel as far a","useful":1,"cool":0},"ZHIvxbA3TOO0FEP0_-rFVg":{"text":"Nice clean hotel. Stayed for a convention in town. I would recommend this hotel; it's clos","useful":1,"cool":1},"lTb6abMjyRnQW0Uuj13Ojw":{"text":"This is one big ass hotel.\nBig as in it's bigger than the typical big hotels that I'm accu","useful":7,"cool":3},"zsJs6ya-Z7aYKUoXwPx2SA":{"text":"I chose the Hilton Riverside for my recent trip to New Orleans, based on previous reviews,","useful":5,"cool":1},"RkvvaxAUqx1xEAAkJRQW3g":{"text":"Very conveniently located by the riverwalk for shopping, run or stroll, great view. Across","useful":1,"cool":0},"jjujRzxezQGAJzuUHD1i1Q":{"text":"*Location - just far enough away from Quarter and across from Harrah's.  \nYou can walk 10 ","useful":1,"cool":1},"nHNihM4Ndqve4I-SWReeRw":{"text":"The check in was very, very slow. As was the check out. We probably had to wait 1/2 hour b","useful":0,"cool":0},"Ofy_HABMbCwimSAsWVwDPg":{"text":"Not super impressed at the hotel that was picked for my work conference. My room overlooks","useful":0,"cool":0},"JINgIdzpDk1P822ubd9O9A":{"text":"The Hilton river side is a perfect place to stay while at a convention.  Very accommodatin","useful":1,"cool":0},"TPSah_NUN7Rf5pieWALhTA":{"text":"It was gross.\n\nCheck in and check out took forever...\n\nDirty.\n\nOutdated.\n\nI would never go","useful":3,"cool":0},"HE_IeKrwFudu5itDm5cFyQ":{"text":"I am pretty sure that The Hilton Riverside is the largest Hotel in New Orleans. In additio","useful":8,"cool":4},"ZW_fZIoraRpE7VVKNSL0uQ":{"text":"The location of the hotel is great, but that's the only thing this Hilton is good for. The","useful":0,"cool":0},"3NaRTNiCPa-mz4S5gE4Hiw":{"text":"This place sucks and I've only been here two days so far. \n\nFirst of all, HORRIBLY overpri","useful":3,"cool":0},"z4VAIV7J23gWPN1d2PFTZQ":{"text":"My wife was here for a conference, but I was here for a short New Orleans vacation. \n\nHote","useful":1,"cool":1},"J9FUXvTkfoNTD_0Px8FNww":{"text":"Checking in on the app is easy, however when you arrive you still have to check in on a ve","useful":2,"cool":1},"3ig3zGpkn9qGWKX7I8XX-w":{"text":"Room was ok!  Location is pretty good as well.  The 1 star is for the front desk and check","useful":1,"cool":0},"xZNKb7-8HsKIc7NEFDm4Ag":{"text":"We stayed here for a convention at the convention center. Everything was top notch from th","useful":3,"cool":1},"Uh4ethJ2QYzkBtfc9rJIMw":{"text":"I read a few negative reviews about this place before we traveled there for work, but we h","useful":1,"cool":0},"Uqq1qUi70U8ny7Ev-HY4OQ":{"text":"We just stayed and was very disappointed. We are a family doing a road trip vacation and h","useful":1,"cool":0},"-gQmm17w1UJR4YCWayBDBw":{"text":"This ginormous hotel host several conferences simultaneously so expect it to be very hecti","useful":1,"cool":0},"q8ksOokBh8Nk5v7YbYNnHg":{"text":"One of the worst run hotels we have ever been to.  First night we arrived, they gave us th","useful":1,"cool":0},"Yksb7-mLYHpxi9sT1VFMkA":{"text":"Worst customer service ever experienced at a Hotel. From the rude people at the front desk","useful":2,"cool":0},"YD2RhG3abqFLMZTuIj9tLw":{"text":"Location is really only upside.  Had a king room with a bathroom so small you had to close","useful":0,"cool":0},"zmYrrd5ljVkX1Vn7EtZ4bA":{"text":"After reading so many mixed reviews I was a bit hesitant to stay here. So glad that we did","useful":1,"cool":0},"cDrh2JQK_1KGvJ1KofUNsw":{"text":"Poor service.  Lazy staff.  Seriously entitled people in this place...entitled to a payche","useful":0,"cool":0},"p-dfBvqG5pr03195GBQLGQ":{"text":"UPDATE - through the text service that the registration staff provide, they reached out to","useful":0,"cool":0},"QJN_3uEqs64JV8bcxSZ0Fg":{"text":"I have stayed at this Hilton location twice and I truly enjoyed my visit each time. The st","useful":0,"cool":0},"ubXDKpAQFB81NyqqCJ-_3A":{"text":"Overall, I found my stay here to be comfortable. The room was clean.  The check in process","useful":0,"cool":0},"WMFxYX3RB3p6tNX6t6fzLA":{"text":"It's Mardi Gras time in New Orleans, which is our favorite time of year. After booking thi","useful":1,"cool":0},"wOBsMkphq2BFFEsY_ehkyw":{"text":"Hilton New Orleans Riverside was a delightful stay. I was there for a 3 day forum and was ","useful":1,"cool":2},"O7r75f2Np4JSA6xK7v3xFg":{"text":"Stayed at the Hilton Riverside last weekend and pleasantly had a great stay. The staff her","useful":2,"cool":0},"sLBOMRGxjG0OYMtHIC1Lgg":{"text":"Spent my birthday weekend at the Hilton with a riverview. The hotel wasn't busy at all so ","useful":0,"cool":0},"3fhRcd6bSraaRu7awPiiMQ":{"text":"I liked the shopping mall that was connected to the hotel more than I thought. This was a ","useful":1,"cool":1},"jIp4uWpbPfegeNrSRj1lJQ":{"text":"I haven't had good much with Hiltons lately and this one was no exception.  I stayed here ","useful":0,"cool":0},"-Ih3KVLMk4paD-gMoQfeNw":{"text":"In town for a conference and this hotel is a good option.\n\nThe room was clean and was read","useful":2,"cool":0},"i29wmO8VgilIyvetu6arfg":{"text":"This hotel is located in a central area within walking distance to some good restaurants a","useful":0,"cool":0},"acEZoyCus2CdstbP8idq9A":{"text":"If I could give this hotel 0 Stars - They don't even deserve the one star.\n\nStarted with c","useful":3,"cool":0},"2oVJlss8Pl7cagpz0wg3JQ":{"text":"This property just didn't live up to the Hilton brand. To start, the check in process took","useful":1,"cool":0},"1kRAEpGtv8stVav3z8A3Ng":{"text":"One of the worst hotels I have been to in a long time. As a business traveler, I'm in many","useful":1,"cool":0},"wqW8v2lYN9LFYTelb3WvxQ":{"text":"I would choose to stay here again when I'm back in the Big Easy! Clean, wonderful staff, c","useful":3,"cool":1},"UeqHbmWrX2NOnipmagxTOw":{"text":"My stay at Hilton Riverside NOLA was great. The room was large and clean with a big view o","useful":3,"cool":2},"piu8USvPdGB2QgQsJqgWDg":{"text":"Large hotel, almost too large. It is a long walk from the parking garage to the hotel. The","useful":1,"cool":1},"mXa6L_3a9WpvagGkrIkWJg":{"text":"Don't like my room. Weird rumbling motor noise until about 2am.  Room has door joining nex","useful":0,"cool":0},"H5h3dv-8yzQVqwMaWDJdyA":{"text":"Have stayed here several times in the past but will NEVER return. Horrible customer servic","useful":1,"cool":0},"R0bSTf2poTJGX8o4xweD4g":{"text":"I stayed here to attend a conference and received a conference rate. They wouldn't extend ","useful":1,"cool":0},"rrh9PtdIvCrTInZTiEh_ag":{"text":"So where do I start ! A from from the rude service and front desk people to the room atten","useful":1,"cool":0},"eotbPV-I6fhCqhGwgZFNYQ":{"text":"What a nice surprise -- great hotel with a beautiful river view. Bonus that it is hooked o","useful":0,"cool":0},"eHmqz-buIf50rzUsxvg_YA":{"text":"My sister booked some rooms here for my nieces wedding. For them I'm sure the plus is it's","useful":3,"cool":2},"84et6VOZY3-0DQLaR7TL_g":{"text":"Terrible hotel, especially for the cost. As a Hilton Honors member I expected much more. H","useful":0,"cool":0},"12gr4DqVd03Zd6OkLEC54g":{"text":"Upgrade to a room with river view. It's worth it.\n\nThe room service menu is the bar menu w","useful":2,"cool":0},"ZSUgdA8L5Ix2UpfKsZEQwA":{"text":"This is one of the worst hotels that I have ever been to. The staff was extremely rude, an","useful":0,"cool":0},"Yx6etjeenQRJSv8g9fPBLQ":{"text":"First, let me say that we are Hilton Honor (Gold) members. We have stayed at MANY Hilton p","useful":5,"cool":1},"jST50wFpjAV0nzKkBlVPfQ":{"text":"Very friendly staff and especially accommodating. Upon finding out that my husband and I j","useful":0,"cool":0},"Z7KdL8rTGuL7VdFupCzjKA":{"text":"I was at this Hilton for a conference. The location is ideal and in walking distance of EV","useful":0,"cool":0},"dxL_bhl3S5PjoHKFPtDeHA":{"text":"This is a nice hotel! They have a very accommodating staff who are willing to help out and","useful":1,"cool":0},"jwxUItziMcekATvycQot3w":{"text":"Meh. This isn't a top Hilton property, and it's far from a top Nola property. \nCheck-in, v","useful":0,"cool":0},"IrYipU--DEuebkbgLI118w":{"text":"Wow \nWhat a hotel \n\nThey really set up our holiday party super nice \n\nFood everywhere \nBar","useful":3,"cool":3},"TfmvfhwPPmhhBLADEaaXmw":{"text":"Wow, I hate to give only two stars. I will explain why.\n\nI love the SPG family. \n\nHere's t","useful":5,"cool":4},"XvZ_rLN5-JGOgz6O1kcLOQ":{"text":"This hotel used to be quite nice but it is an overpriced dilapidated mansion. There are ro","useful":3,"cool":0},"OiuVfyDMXZqXUeAODoW2HA":{"text":"Overbooked the hotel the night I got there. Got one of the last rooms available despite a ","useful":0,"cool":0},"dVqTuSe4lmrNa3AmXBp-LA":{"text":"We had a suite at Hilton New Orleans Riverside for an event we were hosting, and it was pe","useful":5,"cool":4},"tR7bbxEwl5XCD6tbFFmKdQ":{"text":"Excellent hotel to stay in if you don't want to rent a car but be in walking distance from","useful":4,"cool":2},"m5CxQdbvIddOm4T-n-NZLg":{"text":"This place is amazing! We had such a good experience from the moment we first checked in w","useful":0,"cool":0},"HOEF0jN78X0JZMexplA1Jw":{"text":"I stayed at this hotel for a conference for work in January 2013. On day 1 we had no worki","useful":3,"cool":0},"qEiiVkDfvpNG-wXzI1PvVQ":{"text":"Really disappointed in this place. Although a few of the staff members were really great. ","useful":0,"cool":0},"XTx1ebX1FlrmwKK3f74ZbQ":{"text":"A disaster for us! TV signal cuts in and out. Bathtub will not hold the water, leaks out n","useful":0,"cool":0},"sYiaZKVDsRNw-OptfY5U4A":{"text":"I believe the motto of the city of New Orleans has become \"why bother\" and the Hilton Rive","useful":2,"cool":0},"ysig-6DjROOfZCtZo4LlBw":{"text":"The stay was nice. The location is conveniently located by the cruise port and the Riversi","useful":0,"cool":0},"bY_JR03dHIBe-zgT8mL4mw":{"text":"Not bad but wasn't amazing either. Bathroom could have been a little bit cleaner. Also the","useful":1,"cool":0},"Fsf64accKWHEAcQoy2Zj8Q":{"text":"The worst hotel EVER at people-handling.  We stood in a line to check in, the room wasn't ","useful":0,"cool":0},"dvL87BeYt60yeot8R2MdXw":{"text":"I stayed here for a convention this past week. The building is huge, so give yourself enou","useful":3,"cool":0},"UDl3SW0GrCvmiGJ2OksRfw":{"text":"A great location. Good service. Busy hotel. Right next to the casino and riverboat, and co","useful":1,"cool":1},"UHz0wehZItjUZ4ktZiNrfg":{"text":"Room647 this room cost $340 a night it is a pitiful room for Hilton we're looking at the s","useful":0,"cool":0},"OeX1AsZ1FhIzaTCdANU_jA":{"text":"I wouldn't recommend this place to anyone.\n\n Pros: nice bell boys and maids, decent locati","useful":3,"cool":1},"Frsj5P3PDzsOtmwiywQrgg":{"text":"Before you make your reservation you might like to check the college football schedule. Du","useful":0,"cool":0},"t7fcSORWXmLGxRpvk-33VQ":{"text":"Large hotel with a lot going on at all times.  Check in was efficient and rooms are comfor","useful":1,"cool":0},"Fcm2BIgG5MXKod1pZXt33w":{"text":"Near the Port when off from a River Cruise. Mixed experiences from the Staff. Everything w","useful":2,"cool":1},"XLkEMmTUURJnUeHC8FOPgw":{"text":"You know, just a great hotel in a great location. Expensive, but what do you expect sittin","useful":0,"cool":0},"OUvDchMGhSUWGW0ZmEF6uw":{"text":"Was planning on going to a nice dinner our last night in NOLA, however the bed was so comf","useful":0,"cool":0},"lQOHkTv9oSHDMHeTd0vIrA":{"text":"1- Housekeeping: bathroom too small and shower with mold.\n2- Food: Breakfast is of poor qu","useful":1,"cool":0},"KXrfQHc6sOjVad2OYrGGuQ":{"text":"Nice place to stay but bring supplies to snack and drink. Not much at the end of road to g","useful":0,"cool":0},"gIaQ6UMAKSfcLvzzWLniPw":{"text":"On Tuesday about 5:40 AM, I approached the registration counter to add a guest to my room.","useful":1,"cool":0},"XOyJ9iNZhwoOqIwvMpC26w":{"text":"Not a great place to work. Security supervisor treat Lisa treats employees like garbage an","useful":2,"cool":1},"ZDWnMvYLSQc6ciWTYG_74g":{"text":"The hotel was nice but definitely outdated for the price. However If you are in town for M","useful":0,"cool":0},"CdbI3Spxjz27NDxkrupO4g":{"text":"Conveniently located to everything, next to Harrah's Casino, right on the Riverwalk with u","useful":0,"cool":0},"8ONZQe0XCQQk3RGr7_FjWA":{"text":"Bugs crawling all over my bathroom each night, moldy, greasy fingerprints smeared all over","useful":0,"cool":0},"Xp0TXfvjqWKn2JvYhZbCMg":{"text":"Stayed for a convention, and couldn't believe how nice the staff was.  Being from Boston, ","useful":0,"cool":0},"qybEAoijo96gznFFLpKOYw":{"text":"Nice hotel, good location, overlooks the river and right on the river walk... within quick","useful":1,"cool":0},"nD7R8SiSVdjiU3i-l3pLXw":{"text":"Truthfully, this was a 4.5 star stay. First, the location is great. You're right across fr","useful":2,"cool":0},"rbb9WHgnk7TxrSoE2e1pGw":{"text":"I visited New Orleans for a sorority national convention and Hilton Riverside was the host","useful":1,"cool":1},"lQqeR3HR6TDGen7TDMJoGw":{"text":"It's starting to look long in the tooth. Classic \"convention\" hotel. Prices are outrageous","useful":0,"cool":0},"SJodHOCBuHRPKCJiG37JSg":{"text":"NOT a pleasant stay. \nWe stayed for two nights at $250 per night. \nCheck-in was handled qu","useful":0,"cool":0},"1any4DMK7Nj0xeVogkdlDw":{"text":"Booked this hotel for 3 days. The service was great, the rates are great. But the rooms ar","useful":1,"cool":0},"AMF4impUw0JbYUT--2klnQ":{"text":"Very disappointed!  It was a nightmare.  Prior to my arrival, I wanted to make sure my wor","useful":3,"cool":1},"w46X0Rdc3W4r84AAZqL0hA":{"text":"Asked for a nice room, well the room was nice but the mattress was probably 20 years old. ","useful":2,"cool":0},"-NcJiOjZAJ9nouWK56KuLA":{"text":"There is so much to do at the Hilton New Orleans Riverside.   There isn't even a need to l","useful":2,"cool":0},"cAJmQgGdKfMQPCjm_h5x9w":{"text":"The location is great-right across from Harrahs and beautiful view of the river. Lots of c","useful":0,"cool":0},"c2Xbe6LMAz50QOc1G40N_Q":{"text":"Very overpriced, even if the river views are amazing.  We made use of the executive lounge","useful":3,"cool":0},"KIzLS5vfvEVwBLsIzoABtw":{"text":"They only got their extra star for location. This hotel is very over priced and outdated. ","useful":0,"cool":0},"X_gmwBguEFTcDuhGVmAcJw":{"text":"In late July 2021 on a Girls Trip to NOLA, I got into a turrrible  physical altercation wi","useful":3,"cool":1},"gsjqgPGIVe_4kIePLq0wBg":{"text":"Tons of problems with my visit:\n  1. Almost no hot water for my 7AM shower. \n  2. Awakened","useful":0,"cool":0},"w1kft95fkXZyOUUKyobk3g":{"text":"I stayed here during Decadence.  Prior to my arrival, I read a lot of the reviews here and","useful":2,"cool":0},"3LHUWmAT9ZBbSJZ1v3hNFw":{"text":"Hilton Riverside is a massive but nice property, save for the filthy carpet in the room th","useful":0,"cool":0},"CNQK8g4yUYkx4uWrOh1aLQ":{"text":"This is my favorite hotel in the city. The distance between shopping, food and tourists at","useful":3,"cool":2},"a8kP7iWsA-aB_M6QeBMh_w":{"text":"This hotel was not up to par with what you would think of a Hilton. Sometimes there is too","useful":1,"cool":0},"wXRtwrVzO6uIVQN7X7t6Cw":{"text":"Staff was wonderfully friendly on check-in and very welcoming.\n\nI received my room through","useful":0,"cool":0},"aVFsQ5HWCIlX3YT3TBwjtA":{"text":"We had a wonderful stay here. No lines to check in and we were actually able to check in e","useful":58,"cool":52},"ilwMSB5HG5Jo6w81IusoWg":{"text":"We are gold Hilton members, and get extra perks - including water. Both days we were there","useful":1,"cool":0},"Tx5-zgTRxxlv43Yn2JCd4g":{"text":"We had a great family staycation at Hilton New Orleans Riverside. The hotel has so much to","useful":2,"cool":1},"9uQrkJR_VchTMYK8yAYtdg":{"text":"We stayed at this hotel because we couldn't find anything else and we knew we were going t","useful":1,"cool":0},"Rzg31iBjoxR_rlP33uTyIw":{"text":"The hotel was clean and the staff were courteous.  We arrived earlier than the check in ti","useful":0,"cool":0},"-1ZaAdyYE9oMZtZS2MJTNQ":{"text":"I have such mixed feelings about this hotel.\nMy boyfriend and I were here for 7 nights. Th","useful":2,"cool":0},"MHcA1OEKgA0qnD4XQupjjw":{"text":"First time in New Orleans and the room was close to the Harrah's Casino practically next d","useful":0,"cool":0},"aUzTWTZPBXEuXqFVNWansg":{"text":"Do no ever come here! Whoever works the front desk are horrible, my first day the toilet d","useful":0,"cool":0},"pRZAWn80EIXJPl1ocoKmNg":{"text":"My family were register at the Hilton Hotel in New Orleans Riverside with plans to stay fo","useful":0,"cool":0},"QGImHoNZai-0uAFo70NLeg":{"text":"March 2017 - We were there for two days before a Riverboat cruise. It is huge. Mom had a h","useful":0,"cool":0},"8oAs9XcmBvvpbGpqayjU8w":{"text":"Was excited to stay at Hilton Riverside.\nBut..... it was horrible, here I go... \n\n1.) Got ","useful":5,"cool":1},"zgeC8fzX9vqDKe1cIFPfWg":{"text":"I stayed here for my business trip which was 2 nights.\nI chose this location because of th","useful":1,"cool":0},"2B-98vbj7KSRxR-GW7tqEA":{"text":"This place had a lot going on for it when we first arrived.  But I'm glad that I was here ","useful":19,"cool":12},"TDEKSxPnl_p3QpK_w2N8xA":{"text":"If they updated the lobby, this hotel would be great.  Upon arrival, I was thinking it was","useful":5,"cool":2},"KgC6oQOvq0NWjff3mP5ZqA":{"text":"Having to come back and stand in the longest line ever simply to get my keys after checkin","useful":3,"cool":1},"TE7dwycldKmAym1z1hSSLw":{"text":"I was a guest at the hotel from 7/14/2021 until 7/18/2021. I had 3 separate reservations, ","useful":1,"cool":0},"OTZO9o6ZawXd0svnBxgPng":{"text":"Dude, it's a Hilton...and damn it's big!!!  Room was great, in town for a conference which","useful":2,"cool":0},"uj7s1B9oI02U-zE7eCvjYQ":{"text":"This is a wonderful hotel in a perfect location! Quinn and Christian at the lobby check in","useful":0,"cool":0},"AIfegZ821jpkbfSvtUFkeQ":{"text":"If you are going on/off a cruise, this Hilton is very good location because the dock is ri","useful":5,"cool":3},"fFIZEIU_w8xsSCWxs_oFZg":{"text":"This Hilton location really needs some work. First, their website should be updated with c","useful":1,"cool":1},"HrWWOyBxVsnugGxtS4h8Hg":{"text":"So, if so can sleep on a train track you should be fine here. Our room was 533, it was nes","useful":0,"cool":0},"mcPvkpP0ZmDPyHunJyOVRA":{"text":"Their keys deactivate for any and all reasons, their shower is horrible and janky for it t","useful":1,"cool":0},"SrSdgQD6TmI0KRypVfvT5g":{"text":"Ok. I'm gonna jump right into it on this one ladies and gents. Rarely do I ever rate with ","useful":4,"cool":0},"nhwdd88ePna7zyat1UJMoQ":{"text":"Hilton Riverside Hotel is usually our first choice when visiting New Orleans. Why? \n\n-Staf","useful":13,"cool":12},"9Zy2PHujeYST2XYXxmb9nA":{"text":"This hotel is in the middle of everything. All tourist attractions within walking distance","useful":0,"cool":0},"eCCaEfhbA-cvT-b2DXyfMw":{"text":"I absolutely love this hotel! Close to river walk, outlet mall, casinos! They have PickleB","useful":0,"cool":0},"pvBYpLrNIlVZ2llRBEx44A":{"text":"Wow, expensive and old. So much construction going on around it, crazy. \nDragos bar staff ","useful":1,"cool":0},"32CPcJ0DLtImNXOciQEB7A":{"text":"It's okay if you're in town for a convention, but wouldn't stay there for anything special","useful":0,"cool":0},"xTmp8JgcHwTn5GuOxenD9g":{"text":"Pros: \nBeautiful hotel & rooms. Our room (2 queen beds) was very spacious (we usually stay","useful":0,"cool":0},"fViSRH3OWgBRru-UNkEA3A":{"text":"This has to be the worst Hilton I've ever been to and I've been to a few in New York. The ","useful":0,"cool":1},"UvZ68EnHb4dBQQmjy2czlw":{"text":"Nice spot to stay for a trip to the Big Easy. \n\nLocated right along the mighty Mississippi","useful":30,"cool":26},"KE_imPIq41_Km2bUXnx59w":{"text":"The hotel is in a nice location but stay somewhere else until maybe late 2021. The Covid r","useful":1,"cool":0},"XejzAkw3q3D_Aju64ZTbMA":{"text":"TL, DR: Be prepared to wait 20+ minutes for an elevator to the lobby from your room. Also ","useful":5,"cool":3},"7OzyRIov6ialrIitNZ4CDg":{"text":"Stayed here recently for a conference. The hotel room seemed a bit outdated, but the rest ","useful":1,"cool":1},"2vyX7jxrTCUygc__2GR8oQ":{"text":"This Hilton is very convenient for conventions. It is connected to a mall that you can wal","useful":1,"cool":2},"LuAHJFtDVfwqwIihSj6s0Q":{"text":"Front desk was very helpful and welcoming. We had two separate rooms and they were able to","useful":0,"cool":0},"tEfUGgd9JkZgGJZ1FmNfAA":{"text":"This is probably one of the best hotels in New Orleans. I love the area - it's in the Cent","useful":0,"cool":0},"pnOtarjbP-Iwy2C2yKPySQ":{"text":"I enjoyed my stay here years ago, when I enjoyed my riverview room. I could not confirm a ","useful":12,"cool":15},"0Z_UtPAiDM25m7gJgtLXrQ":{"text":"All Hiltons are classy, clean, and courteous.  The lone exception being the black sheep, P","useful":4,"cool":1},"-LW24Dv_Y3HTb0LzCMNUvQ":{"text":"I've stayed at this Hilton years before when I was younger. Overall, I would say it's not ","useful":1,"cool":0},"iDXEQeJS9-iz4ih_o-eiqA":{"text":"This is a review of the breakfast only. The hotel is also a 3/5 at best due to some room i","useful":3,"cool":0},"zCy_jnoYHokHTY7HlIGoYw":{"text":"3 hour wait for towels...come on Hilton! I'm appalled at the level of service here. The ro","useful":1,"cool":0},"1ESE_pcLI4gw2zTF-9wKbQ":{"text":"Very slow check in.  More than forty people on line and clerks chatting with guests about ","useful":1,"cool":0},"XGqitV0rwRtto9ie6esmHg":{"text":"Location is amazing. \n\nIt's close enough to walk to the French quarter, but far enough fro","useful":2,"cool":0},"Vlgsm5cAle7Tt8aHZ1Ax5A":{"text":"Yea the location is great but your room might get broken into and have things stolen!!  I ","useful":3,"cool":0},"NDOcECqU9vbphzhAb_KqTg":{"text":"The grooms are very nice and spacious. However, it's 3:10 and my room still has not been c","useful":2,"cool":0},"8Sy_WZlucACzollcurYOPQ":{"text":"I am staying at the Hilton Riverside and wanted to leave review for Janice at the check in","useful":0,"cool":0},"NWKHPQ_5VEpuUTaOHW6nbA":{"text":"This is one of the worst hotel you can stay at, o have attached pictures of the damaged br","useful":1,"cool":0},"joDA9Vc2wXQzh1v7V1amyQ":{"text":"I have stayed here previously and everything was fine. This time was a disaster from the s","useful":2,"cool":0},"4H4EEZb-FgcH4KeM44ZE1Q":{"text":"This hotel is great. We arrived super early and they gave us a room. We originally booked ","useful":1,"cool":1},"S8r1NkivRHi4ClVu7BDtTw":{"text":"The Hilton Riverside is huge and the layout isn't ideal. With multiple buildings connected","useful":4,"cool":1},"_QJlw1Vhyepmv8xaWYiY5g":{"text":"I had such a horrible experience at Riverside hotel in New Orleans. I have a disabled son ","useful":0,"cool":0},"YhTMKj4EgifMV0PD0TlLNw":{"text":"We stayed at the Hilton New Orleans Riverside during the Essence Festival so you can imagi","useful":2,"cool":0},"KSJbinm-Tl4G51Z9w23XnA":{"text":"Update time....in town for the Yelpy Awards and needed a room for the night but the rooms ","useful":5,"cool":1}}