{"XEm4pwdziak32mS7ik8kmA":{"text":"My family and I were evacuating from FL due to Hurricane Irma, and little did we know that","useful":0,"cool":2},"m46v_UH2NuuQsJm_zlq5PQ":{"text":"I will start with the staff. Everyone who works here is extremely friendly. They make sure","useful":0,"cool":0},"yMgTeXiiohAwVYeiJpifEA":{"text":"I came to know about this place through Yelp. While I was visiting New Orleans, we were st","useful":1,"cool":1},"9s3tIS7QcNSwDaoT8rzxUg":{"text":"Got coffee here every morning I was in New Orleans last week. Really good coffee. This is ","useful":1,"cool":2},"aFHj5vsFta7NA4-zSA8MsQ":{"text":"Love this place!  Best coffee and food experience I've had in New Orleans. The food is mad","useful":1,"cool":0},"5M-OGml7ghc_MHQds6AX6g":{"text":"Great place! Loved the service, the coffee/tea.  Very accommodating!  The most refreshing ","useful":0,"cool":0},"YaLFk0BGxGROjxp-E9DCkg":{"text":"Really disappointed here. In general, I'm in favor of a larger serving size, but it just d","useful":1,"cool":0},"QPPRWt95zhhTL3ojfmwZQA":{"text":"As out-of-towners from a coffee lovin' state, finding a good cup of coffee in NoLa proved ","useful":1,"cool":1},"QTVa5TFAX-_zK1ma3upzCw":{"text":"This is a super cute coffee shop that's centrally located near Bourbon Street. The employe","useful":1,"cool":1},"Q7vjxh7k7Q29CFujRGLsWQ":{"text":"I'm a hardcore coffee drinker. Everything all black so I can taste what coffee should tast","useful":3,"cool":3},"RA7YRuoxO_e1VctwgKSa1w":{"text":"I happened to be in town for a wedding and staying across the street. I was looking for a ","useful":0,"cool":0},"toJ2mM70HZDU3pyCb8Z33g":{"text":"I was in NOLA this past Spring, and Addiction was my go-to coffee place in the quarter. Wh","useful":1,"cool":1},"8izM7TV8sfAyDf_I106Usg":{"text":"The iced vanilla latte is the way to go to beat the heat and get your much needed caffine!","useful":0,"cool":0},"jarHRIqE3ReJkZq7PSIc3A":{"text":"This place is so funky and amazing. The iced coffee was solid -- not the best  I've had--b","useful":3,"cool":4},"2_VctQISbc5lpPMMjle1xw":{"text":"On my first visit to NOLA in a long time, I was drinking bad coffee for four days until I ","useful":0,"cool":0},"b3fwpkl8tL4E_ea81xZO0w":{"text":"Wow !!! Everything was phenomenal from the food to the service !! It wasn't a restaurant t","useful":0,"cool":0},"nWBQ63R22Mo_qtq6lsLlMA":{"text":"Great barrista. Great location. Pretty good coffee at good prices. It was a wee bit hot th","useful":0,"cool":0},"5uHolbVVhW8yKykqOF7sbg":{"text":"This is a great coffee shop that is a perfect place to get a quick espresso -- it was seri","useful":1,"cool":1},"LEiwA3ErySxXWhJbp--F-Q":{"text":"Great coffee with unique flavors and clever names. Brandi and Kevin were so friendly and h","useful":1,"cool":1},"4rnj9Mp0dMq4igsAvd0a-w":{"text":"Starbucks begone! This is a great place to spend your morning while you're waiting for the","useful":0,"cool":0},"85K0jD5iHmDtnaHn8lGOpg":{"text":"So nice we came back twice! Purveyors of the perfect cup. Lovely ambiance and friendly, kn","useful":3,"cool":3},"j42cQRbaQFpRpz75MWFMww":{"text":"Addiction was everything we thought it would be and more.  My husband and I had two Miss T","useful":1,"cool":0},"Blvp_W0_LAMwRx5Zh0P5wA":{"text":"We came for coffee, surprised by BBQ offering. Seems like coffee is an after thought here.","useful":1,"cool":1},"frlJu5OjP6f_iuYdpcSL8g":{"text":"Friendly baristas, could definitely chat up a storm! There's nothing not to love about thi","useful":0,"cool":0},"2grUoeP7c2a-dGDXZ_19fg":{"text":"the lady behind the counter makes good drinks, the next day there was this guy who made my","useful":0,"cool":0},"IgtVJm4q1YrFXcJYn1lMYA":{"text":"Came for Miss Tracy's Addiction and was NOT disappointed!! Shelby and Ben made us feel lik","useful":5,"cool":2},"-WutOg6qIgqa30jtiXb72A":{"text":"LOVE this place! Went here every morning I was in Nola. I loved the Tracey's addiction thi","useful":1,"cool":0},"k5crCjo7TyB1mygZvemJXA":{"text":"Really needed a fix while on my trip here. I found Addiction via Yelp and thought I'd give","useful":1,"cool":0},"xyPUyRVrBqSdl43__aS5xw":{"text":"This is an amazing place! They're currently remodeling so the shop is being run next door ","useful":1,"cool":1},"9LNhrGMUC9IoH6-oxYkPKw":{"text":"Miss Tracy's Addiction is everything it's cracked up to be - espresso, steamed coconut mil","useful":0,"cool":0},"LqMjVYbmJCQK0LQ1gzYGaQ":{"text":"I book marked this place to try.  For some reason, the Yelp map shows them near the Museum","useful":2,"cool":2},"ipNHjGMqZNyvZhIa_yz7Fg":{"text":"Loved the Miss Tracy's so much we went back the next morning for another! Not until Ben wa","useful":1,"cool":1},"3GfkMPpwayGRzBZwoOvjpQ":{"text":"Hands down best coffee in the Quarter. While in town recently for a conference I made dail","useful":0,"cool":0},"jr_Wl0ibZC9aULYE_Nns_w":{"text":"Stopped by for a quick coffee.  She made my cappuccino with no foam as requested.  Basical","useful":1,"cool":1},"JM5xOhA_DCR5Y-CYraCXSA":{"text":"Deliciously made, the Miss Tracy will be my go to whenever I visit Addiction. The combinat","useful":1,"cool":1},"BRrEsZJgU6U95T_qxX73fQ":{"text":"So glad that I stopped at this place on our tour of espresso throughout a New Orleans trip","useful":2,"cool":2},"vww7AFwHVoeLczwjj2lDcw":{"text":"This was right across the street from our hotel and we found they had great reviews on Yel","useful":5,"cool":3},"Q_FmDijU0H_XJutlYhDE4w":{"text":"Cayenne in my coffee? Yes, please! I was greeted by the friendliest smile, you can tell th","useful":2,"cool":2},"Y0KHMxMJWls3CYKzZU1wCQ":{"text":"I came here even though I had already had my morning coffee, but I just had to try out thi","useful":0,"cool":0},"Zq6YnpiyVcbMolPdngTmdQ":{"text":"We were in New Orleans for a short visit and I was thrilled to find Addiction! Delicious c","useful":1,"cool":1},"OGODMmh-PFmxM9YX2UiuDQ":{"text":"Kevin was really nice! Got the New Orleans iced coffee! Have to get the miss Tracy's addic","useful":1,"cool":1},"A-Z6rDVp2bwkTDhySHgkPg":{"text":"One of few places in NOLA with fantastic coffee and brew bar. Cool decor and relaxing vibe","useful":1,"cool":1},"Pok4MGyi_s1FHSWXFvU5ag":{"text":"One of the best lattes I have ever had which was accompanied by great service and a welcom","useful":1,"cool":1},"gpPmrTpmuuIGS0aBTySAeQ":{"text":"i hate to spend 5 dollars on an ice coffee...  It was good, but c'mon.   There was also cr","useful":0,"cool":0},"29QdsMci99AictufkV_SPA":{"text":"find this place, it's a little off the beaten path in the Quarter, but great coffee, super","useful":2,"cool":1},"z5pLcAz5PBvovbXFnbd6uA":{"text":"Discovered one of my favorite drinks in the world here. (I have a tendency to exaggerate, ","useful":1,"cool":1},"uA79FDD2pRjppbyoXKeD8w":{"text":"Great coffee shop! Atmosphere is calm and cool; Barista is the same! I asked what was the ","useful":0,"cool":0},"F3a2bziZ5AXc0syAsE_aRw":{"text":"Great coffee. Had the Iced Tracy's Addiction and it was awesome. Super friendly staff.","useful":1,"cool":1},"_NShCVa3WW8vBdBm-2rl8Q":{"text":"As a person who begins their day with a coffee, this was THE spot. Iced coffee is usually ","useful":0,"cool":0},"IcOmKEn4QCVCff7ZjHwZ9g":{"text":"Found this great coffee shop on Yelp when staying downtown. Tried it and would definitely ","useful":0,"cool":0},"FdHcaPhI9zRPOMbJp3qBMg":{"text":"#1 - Ben is awesome.\n#2 - The coffee rocks. (Try Miss Tracy's Addiction, New Orleans Iced ","useful":2,"cool":2},"PaT0zkmtnhMrU5OX7lP1zA":{"text":"Orgasmically delicious coffee. So smooth and superb, I could drink cupful after cupful. Hu","useful":1,"cool":1},"v5s8orj08y1RH0mnGNStUw":{"text":"Yikes.......this is where yelp let's you down.   Place is in the process of closing,  stri","useful":0,"cool":0},"Fuj6zWFia7HEzcAl4W3iUA":{"text":"This is a great little coffee shop in the French Quarter. I was hanging out in NOLA for a ","useful":2,"cool":2},"aU4nhygtsAjGbqAdaYCEzg":{"text":"Great place. Great service. Great coffee. Thanks Kevin for the Miss Tracy's recommendation","useful":0,"cool":0},"Nq1WuggQmtuCsfTCAnp6iA":{"text":"I'm so in love with this place! To start with, the atmosphere as you walk in the door coul","useful":0,"cool":0},"Rj9wQaptQBXb1ym5QqE5zA":{"text":"While walking around Bourbon street we were looking for a local coffee shop and yelp led u","useful":1,"cool":1},"70rSK7KsdIqP-O3KO4Vs5A":{"text":"5 stars for atmosphere, 4 stars for coffee and tea, so let's say this is 4.5 stars. \n\nIt w","useful":4,"cool":5},"zz6P4twvhO4ISVJyoDS7Zg":{"text":"Don't sleep on Ms. Tracy's Addiction. We tried to just get a drip coffee and the barista g","useful":0,"cool":0},"CNKCqKbYBT9Sval8yToNsA":{"text":"We go here whenever we are in town, which is often! Can't believe they did not make the sp","useful":1,"cool":0},"zC6QB-92-USg0S1eMjGiWg":{"text":"Cool unique coffee shop. Atmosphere is chill, raw, original; not grunge or pretentious. Me","useful":0,"cool":0},"KUZooqOYF68XiC4akkMAIw":{"text":"I had some time while wandering around the city and am so glad I found this place. The cof","useful":4,"cool":3},"V9m7JDsUHX4sONkXkvo_xQ":{"text":"This place is AMAZING! Get one of the muffins, cold brew, and Miss Tracey's addiction. Sat","useful":1,"cool":0},"1_vg0oqif8-5lDxx_Hm5ng":{"text":"The miss Tracy is absolutely delicious! Espresso layered over Smooth coconut milk with a h","useful":0,"cool":0},"1nkHtNNOvpYiAPSgs-AX2w":{"text":"Addiction was about a block away from the boutique hotel I stayed at. I came here for the ","useful":1,"cool":2},"jZlNndp4iEWKE9ua4rNWZw":{"text":"I loved this place a year ago, but their only milk options now are the kind from a cow or ","useful":5,"cool":0},"2rR5CFf4NVxmPZvtl8Vd8w":{"text":"Stopped in for my daily fix.  Just got an iced coffee.  You can taste the excellent qualit","useful":0,"cool":0},"NY7Xurq-MfHyNWVxMQNvFg":{"text":"Such a cute little place. Loved the atmosphere. We tried the drip, pour over, two black ey","useful":0,"cool":0},"lZvarSZmxhp0nZUyAH4tfA":{"text":"This is a swanky coffee shop in the heart of downtown New Orleans with fair prices. My hus","useful":0,"cool":0},"5Bqb77JNs4jVqKJWF1IbAA":{"text":"Great ambiance; even better almond milk lattes. Ben, the barista, couldn't be more welcomi","useful":2,"cool":2},"c1qT0xZLPjTdSZlMJTZXYw":{"text":"We stopped in to get something before our bike tour and the coffee was very good! I also g","useful":0,"cool":1},"39zqrsFDCe7AtJQJXSCzDw":{"text":"Yep, the hype is true!! Very small with a cool artsy vibe. Out of the way and I almost pas","useful":2,"cool":0},"Fqq-ie-Ovv3hyYLOqipdvA":{"text":"Great people, great service, my new favorite place to chill with good coffee and company. ","useful":0,"cool":0},"CONG1blF38mccq3D_iPupg":{"text":"Stopped in after hearing about it from a friend. Loved the ambiance and felt welcomed imme","useful":1,"cool":1},"31hja0iFZAj10Rj0vwJvAA":{"text":"Tale of two cities but I am rating on the latest experience. Our first visit we got the ad","useful":0,"cool":0},"R3AF6Z-1TRroNg2ANtnCwQ":{"text":"You have to stop by here and see this place if you have the chance. Even if you are not a ","useful":0,"cool":0},"NaDobTaqrNyOyxxrXtLhvA":{"text":"I highly recommend this interesting and delicious coffee shop. I stopped in for a coffee o","useful":3,"cool":3},"k2EDkBatU1yXImqwCaFH2g":{"text":"Love the place! Owner lady is so nice, she made all the furniture herself. decoration are ","useful":1,"cool":1},"atjlfM3Oy6AOitD4_1p-OQ":{"text":"Addiction is quickly becoming my favorite coffee shop in New Orleans. The staff is pleasan","useful":0,"cool":0},"j2uWtdmDA4YG29T0NdRDbw":{"text":"Amazing cold brew, 90's R&B, funky decor, strong cold-brew and friendly staff. Addiction c","useful":0,"cool":0},"Y-W2XDfQi_fznFapjpRxqw":{"text":"Needed a serious caffeine fix after my first night in New Orleans. Woke up early and decid","useful":1,"cool":0},"hDpgVeCIwSwHP3kHHSM8FQ":{"text":"Thank You fellow Yelpers!\n  Once I read about the delicious Miss Tracy I had to go. I even","useful":3,"cool":1},"1bLnpC4fVf4-5hupk5qGuw":{"text":"I visited this coffee shop during my trip to New Orleans\n - Its a nice and cozy place. The","useful":1,"cool":1},"6SOqoD4Z-D2dcridjbaBig":{"text":"Fantastic ambiance and strong lattes! Love the vibe in this coffee shop and how it connect","useful":0,"cool":0},"wz0saJosSR7Y7A21ROmPHw":{"text":"A great place to hide from the New Orleans rain with a laptop or a book. The signature con","useful":0,"cool":0},"RGSc9jNHNTT83_1e2BEy8g":{"text":"This is the best coffee house! In French quarter just off bourbon on a  little side street","useful":1,"cool":2},"95qx4HkOEX0N_o3vc2Qw6Q":{"text":"Great coffee. I always get Tracy's addiction iced. Usually they ask whether or not I want ","useful":1,"cool":0},"F04SM9Pxbn0ClyZ3j_3T4g":{"text":"Super solid little coffee bar on the edge of the French quarter. Very relaxed vibe with to","useful":0,"cool":0},"4Pg5OWDdaScgi3vkp6TbmQ":{"text":"Delicious coffee 2nd best place to get coffee in the south. Strong coffee I stay in NOLA f","useful":0,"cool":0},"u8ZImrPWQwCuOiddZRpcow":{"text":"There was no pig here!!! Apparently it grew too big so the owner can't bring it in anymore","useful":0,"cool":0},"TFaw6HSaVMuer5s66INUxA":{"text":"Decor is relaxing with a rustic appeal. Customer service seemed on point. I got there in t","useful":1,"cool":0},"E5Y0VHkksf5qvZBAMktzYQ":{"text":"Love Addiction!! I come her multiple times a week to study. They coffee is great but the s","useful":2,"cool":2},"Iu7sJsmqhO6TXY0E_hfRQg":{"text":"Just had a fabulous experience with Kelly at this little coffee shop! Miss Tracy's Addicti","useful":0,"cool":0},"i311P5nGDEGGM7ke-R7gtA":{"text":"This is a great little coffee shop, a very refreshing take among so many chains. The Addic","useful":1,"cool":1},"qFd2NM4rIAj-07p1adfRHA":{"text":"This was my first day in New Orleans and I needed a quick midday pick me up before the fes","useful":0,"cool":0},"yusw-YXygA7z20_n_F0SKg":{"text":"Kevin was super friendly, and perfectly made my order!  If I lived here, I would make this","useful":1,"cool":1},"J8YRN4bksl-8VeE8B0MA6Q":{"text":"Shout out to Brandi, she was so helpful and sweet! Best barista ever. Very cool atmosphere","useful":0,"cool":0},"8IfdtVRgzqThmwHFJGuOew":{"text":"Fantastic vibe, staff and coffee at Addiction!\n\nOpen at 7am every day, Addiction serves co","useful":5,"cool":3},"ke5WxitK6YtjiI1t6Yci0A":{"text":"I spent a week in New Orleans, and found this place my first day there.  Everything from t","useful":3,"cool":0},"7fR-lWXFZeK2Q3ZtDMU1tQ":{"text":"To start this review off, if you want cheap food, do not go here, but if You are willing t","useful":0,"cool":0},"E6U9dx6X8l96jJZzmqcXPA":{"text":"Oh the charm, the charm, the coffee. oh yeah, and the tea. For an afternoon wake up, we st","useful":2,"cool":1},"UMmjxmCRLaaViU40DaSi1Q":{"text":"Amazing decor and excellent coffee. Try the Miss Tracy's addiction.  A perfect blend of ta","useful":0,"cool":1},"kTgGivw1QZVFHG3ntlA9MA":{"text":"One table that seats six and a bar alone the wall that seats four or five in the whole pla","useful":0,"cool":0},"K5qPoyiogoK4g0Rymzz9eQ":{"text":"We stopped by today at noon, but the doors were locked and the lights were off. According ","useful":1,"cool":0},"Q9rMtM0r_DkmYyUybHmUfg":{"text":"Best coffee house in New Orleans.  Coffee was delicious, decor and ambiance welcoming and ","useful":0,"cool":0},"8lKLEn1aqOj2XwTS-sr0nw":{"text":"Pros: clean, nice decoration, well located and super welcoming staff. \n\nCons: the coffee i","useful":1,"cool":1},"gWF2iNKfzbenRIXujrehmg":{"text":"Awesome chill spot! Great coffee and atmosphere! Huge table great for studying in groups!","useful":0,"cool":0},"7E6us5B6_k9-fde-EebkwQ":{"text":"Can't go wrong at this coffee shop. The baristas are so very friendly. Shout out to Ben le","useful":0,"cool":0},"XPYsw4rW2uAtsiQhP9HGmw":{"text":"Ms. Tracy and her coffee shop made my trip to New Orleans.  Thank god that my sisters and ","useful":1,"cool":0},"_8xDm7TiAGD9dFHZPjxsww":{"text":"all coffee loverのみなさん！ここは必見ですよ！フレンチクォーターにあるいかにも名前からして癖になるドリンクが楽しめるカフェ、Addiction.\n\nとっても蒸し暑い","useful":6,"cool":2},"Lc5gtwJ6y-bTnkowo4pYzw":{"text":"\"Miss Tracy's Addiction\" is simply the best coffee drink I've ever had.  Simple ingredient","useful":1,"cool":0},"2_JEPds93hJ0GLur2s8AZQ":{"text":"Stopped by for a cup while in town for a conference, and the pour over was fantastic! High","useful":0,"cool":0},"liitHkutFLIoUI6V4QnN-A":{"text":"The iced coffee was very good but prices for coffees were very high. I spent $5 for a smal","useful":0,"cool":0},"NhlQI66uMZM-xb8g7vwzhA":{"text":"This place is super good! Really neat wood tables, great specialty coffee drinks, and frie","useful":0,"cool":0},"X623xjn8U5l1bpyRApWwSQ":{"text":"I missed the pig! BOO! The pig's parent is the owner of the shop and piggy is getting too ","useful":2,"cool":0},"iVZzN3CewHzDUMS35yUxJA":{"text":"Great coffee, great staff, great vibe. The milk is from a farm 45 minutes away, and the pa","useful":0,"cool":0},"y1piabwv6HMLMZscbykW4Q":{"text":"What a joy! This was one of the first places I stopped in for a coffee once I arrived in t","useful":2,"cool":2},"dey-XiF0aKHUIHbSesp5zA":{"text":"This was one of the coolest coffee places I've ever been to. Definitely try the special wi","useful":0,"cool":0},"L9-x5HPU0x9G2nvLPuFKHA":{"text":"Miss Tracy's Addiction is the best espresso beverage I've had to date. \n\nThis place is a g","useful":0,"cool":0},"OJxF5kFuutUMIqnyHOx4yA":{"text":"I really appreciated my experience at Addiction and I'm glad I ventured to try this place ","useful":1,"cool":0},"15oFxSmhGWEEJQ2dnaJRNw":{"text":"Came into Addiction looking for a cold drink and talked to Ms. Tracy. She recommended tryi","useful":1,"cool":1},"xmiv3ZoE0-v8p-JJKNHrtg":{"text":"Miss Tracey's addiction - $4.50\nHoney, syrup, espresso shots, coconut, and steamed milk wi","useful":1,"cool":1},"fuzMJGPN6YJKmglSPiWVRA":{"text":"For New Orleans Iced Coffee...bold, smooth, awesome in every way! Stop in here for a pick ","useful":0,"cool":1},"LktgcuCirtbjk1UngnkEKA":{"text":"I was staying at the hotel across the street and wanted to try a local coffee shop...it so","useful":1,"cool":1},"HyE5-lmlOh6oPNG-dcBi3w":{"text":"Addiction has great coffee, a fantastic staff and a great ambiance. We enjoyed stopping by","useful":0,"cool":0},"r-W0cjpGFImynZViCJ28hQ":{"text":"I wanted to love this place, I really did!  My morning routine consists of a breve latte a","useful":2,"cool":1},"XNKOF41B02yK9hE-OfoZdQ":{"text":"A superb coffee shop- everything from the quality of the coffee to the handmade refurbishe","useful":1,"cool":1},"HKAQ0wRYfnl0iarUhJRvyQ":{"text":"Truly an addiction! Stopped by just to try this coffee with coconut milk and cayenne peppe","useful":0,"cool":0},"LxrAJhXy9nNWtGRciWQ4jw":{"text":"Delicious coffee, funky yet unpretentious atmosphere. The iced coffee (with chicory) was r","useful":1,"cool":0},"yywjtL-K0wcAGDpqICMXkw":{"text":"When traveling my sister and I always map out coffee and dessert shops to visit since we'r","useful":3,"cool":4},"iU16lwpEelvKdE0do21Pqw":{"text":"Was such a cute and nice coffee shop! A good place to rest and be calm. The staff was nice","useful":0,"cool":0},"yeANdgLIHQjNem8nJvxmYg":{"text":"It's one thing to charge $.50 for a splash of cream.  I've never seen another coffee shop ","useful":0,"cool":0},"-mpemBZOPFLErgoE2p-5MA":{"text":"Just awesome! David (the owner) is just the nicest guy ever. The place is adorable, right ","useful":0,"cool":0},"g1RQOAmvQtnGnAbKKShMaA":{"text":"If I lived in New Orleans, Addiction would be my Addiction for coffee. What a great find, ","useful":5,"cool":4},"1RjUXMUjzJVqUQHbhg0tFQ":{"text":"Had a Miss Tracy's Addiction. Excellent drink. Kevin was the barista there, very friendly ","useful":0,"cool":0},"2pKaAurrKbUNzbcYO4BnlA":{"text":"Hi my name is Cookie and I'm a addict. My drug of choice is Affectionately known as Miss T","useful":0,"cool":0},"xMGPL_FZFGLqdAgx92PZAQ":{"text":"This is the best coffee and service.  We walked in and were warmly greeted.  The coffee is","useful":3,"cool":2},"GFtochHhZOltVndRl1MQLA":{"text":"Came for Miss Tracy's addiction! Awesome kick!  Great vibe and service, paid with bitcoin.","useful":2,"cool":1},"GUBVd191Lt_yIrVYib4_nA":{"text":"I love this place!!! I come in here to study all the time. The staff is great ! Everyone i","useful":1,"cool":0},"p3-jnKTH3B6oJd0Ho_EccA":{"text":"I find it hard to find espresso in the USA which meets the impossibly high standards of Ne","useful":0,"cool":1},"xioYsD6XberuWLp24rI7cA":{"text":"Yesterday morning after reading all the great reviews we decided to pop into Addiction for","useful":1,"cool":0},"4KyOs7Je0AngkYCMeXPCbA":{"text":"Miss Tracy's Addiction!!! Was by far the best speciality drink I have ever tasted. Very ni","useful":0,"cool":0},"CqdtPxpfNfQ2S1-MGpOIwA":{"text":"Awesome chill spot! Great coffee and atmosphere! Huge table great for studying in groups! ","useful":1,"cool":0},"zLnaUbSlEsDeWdOnYPIofg":{"text":"Best fucking cup of coffee ever!!!!! You will be Addicted at Addiction... no joke. You mus","useful":1,"cool":1},"wWA-aJl4n2K0NZiNXWqIvA":{"text":"This is a great coffee shop with deliciously crafted espresso and superb service. It's a f","useful":0,"cool":0},"WMb2amxfgDKx1yT6M4uztA":{"text":"I drove two hours from Grand Isle just to come here and it was worth it! I highly recommen","useful":2,"cool":0},"Ubg7-1wI_osVDt6Wqz8ERA":{"text":"Although hard to find, as there isn't a sign.... We explored until we found it. We Stopped","useful":0,"cool":0},"75FjSOYwaB5dNhKvkndGPA":{"text":"Miss Tracy and her crew are seriously the best. They all have the most amazing personaliti","useful":1,"cool":0},"NQjb3EkyL4OHEH80fc23Cw":{"text":"I love coffee, and I consider it a personal obligation to visit any and all local coffee h","useful":4,"cool":1},"DZQ7nw81D_3jIO_li_RWzw":{"text":"This place had a very cool vibe but I was not that impressed with the coffee. The Batista ","useful":0,"cool":0},"9ZmRcYI5elAaEmpU15PB3Q":{"text":"At the door we were greeted with a hand written sign that said, \"Ran out of espresso beans","useful":1,"cool":0},"2Kzlwd-UOrsoNHdl4OAUdQ":{"text":"Addiction Coffee Shop ...this place is simply #Amazing the ambiance and décor is as welcom","useful":1,"cool":1},"DeJFMIbD7YVF5MwzAfbnWQ":{"text":"The drinks are great and fairly priced. The space is awesome; it has a nice modern/rustic ","useful":1,"cool":0},"Y-_Mi80lXulzdRpQl6ybWg":{"text":"Ben is the guy my mother warned me about. When he suggested Miss Tracy's Addiction he fail","useful":2,"cool":2},"CbtPJRyvXUl0PX9QVEA8aw":{"text":"My fiancé and I heard about this place from a friend. The coffee and service was so good t","useful":0,"cool":0},"kHzNtn1s8Tm0TDz4GyU0rQ":{"text":"Decided to check it out based on reviews and went with their house specialty. We requested","useful":0,"cool":0},"Oow2f3hyuszRDQWxg9sf-Q":{"text":"Super cute coffee shop! Lots of plugs and seating. Miss Tracy's Addiction is like no drink","useful":0,"cool":0},"2BO1FiowBH86AsI8jfLx0A":{"text":"I absolutely LOVED this place. My boyfriend and I were vacationing in the area when we stu","useful":2,"cool":2},"X8rCZIKYbohFb2niU0bA2g":{"text":"Kelly was so nice and cool! The coffee was great but the stuffed croissant was amazing. We","useful":0,"cool":0},"zHXjBCSHOzQxGa_NC6JsGg":{"text":"Not just another coffee shop. Addiction has a unique artistic vibe When you go, you need t","useful":0,"cool":0},"3rUWo-V7HeheLT-6oTy1mg":{"text":"Wonderful coffee!  Great atmosphere!  Support this place!  Truly a masterful approach to t","useful":0,"cool":0},"qRn3ZyDTTBoFeitrUJgNEQ":{"text":"OMG!!! \n\nALL I HAVE TO SAY IS MISS TRACYS SPECIAL COFFEE.... WOW. My girlfriends and I wer","useful":3,"cool":5},"6RNI4QLjeGEoIz8MhkqQxg":{"text":"A little hard to find but was so happy when we did! The place had a calm atmosphere with l","useful":0,"cool":0},"XW7z07a4DgZa_Tm8oz0TWg":{"text":"Hands down, best coffee shop ever! It was around the corner from our hotel and I'm so glad","useful":1,"cool":1},"VgspHroxP3Up5ZGA_CVblQ":{"text":"The owner David and Miss Tracy are the nicest, most generous people. We met after a short ","useful":0,"cool":0},"6BGXqodZaABr4ULu8MSf-Q":{"text":"Unquestionably the best coffee in New Orleans. And get a haircut next door anyway you like","useful":2,"cool":2},"dcWPnt-bDPwA5kca9hAFWQ":{"text":"Addiction has a great atmosphere, friendly and welcoming people, and fantastic coffee. I s","useful":2,"cool":0},"3WJC4tyK0gL4fg1c2LYfRA":{"text":"My experience at Addiction was pleasant and fun my Florida orange tea made by Miss Betty w","useful":0,"cool":0},"XBMI-4v9Unx-LwpdbF-AMA":{"text":"Addiction is as good as it gets. I went to the old location when I was in NOLA a year ago ","useful":1,"cool":1},"M161zGSb9z4yDuAHuaLH7A":{"text":"This place is super cool! The manager and barista were really nice. We tried Miss Tracy's ","useful":0,"cool":0},"PLwyeqe54WK3Thny06Zkfw":{"text":"Wonderful little coffee shop I discovered yesterday and visited again today. The style and","useful":0,"cool":0},"4hsAVIs9aw-q32kLBOftAA":{"text":"Love the decor and coffee drinks. Wish they had more food options for those of us who aren","useful":0,"cool":0},"IJRH1FaD3AcguRiaEbh0aA":{"text":"Great coffee. Only wish their to-go cups were a little bigger. Service is friendly and the","useful":1,"cool":1},"cNXr-R8O2v7eHcUHyUVriA":{"text":"Sadly, we were very disappointed by today's visit. We've been customers of Addiction previ","useful":3,"cool":0},"eCxQBlP3zcCwcGBuRFfaLw":{"text":"Searched for a coffee shop in the French Quarter that would make a proper cup of coffee.  ","useful":0,"cool":0},"yEhcnZHeAi3bewW6ooswuw":{"text":"Everyone needs to try The Tracy. The atmosphere is perfect and the coffee makes it even be","useful":2,"cool":1},"VfyOq3bW1TC-6_cPBM691Q":{"text":"There's a reason this place is 5 stars, well a few reasons actually:\n- super friendly peep","useful":2,"cool":1},"ffYI0HOFjCOCodueBTU3tQ":{"text":"Must Go! Best coffee I've had. Tracy's Coffee Addiction. Becomes my addiction. $4.50. Togo","useful":0,"cool":0},"qp3Umbj5vnml64DDXGDnjQ":{"text":"Rugged, cool coffee shop. The latte I ordered was watered down. Not the best service. The ","useful":0,"cool":0},"qoQcIG86S_3bqF7JVWFarg":{"text":"Love Addiction!! Came to addiction during a weekend trip to New Orleans and learnt the mea","useful":1,"cool":0},"F0-d4i9IMPU9IFhyx4y9cQ":{"text":"Adorable little cafe with tons of eclectic New Orleans charm, offering unique twists on ol","useful":16,"cool":13},"M3nhj7ZGpnLzqfAlDPxiLw":{"text":"The place is adorable and the staff friendly. I got the special and it is def not somethin","useful":0,"cool":0},"qJEOJB0xuNidnt8-D6vM-g":{"text":"Quirky but not pretentious ambience, feels chill. My pourover was solid and the staff was ","useful":0,"cool":0},"yam8pUEUMXoCSjBh66n6TA":{"text":"Amazing coffee, super friendly staff. My friend and I got hooked on the Miss Tracy's Addic","useful":3,"cool":2},"w1WQuGLPyCe0obtSAGbc4g":{"text":"Tiny coffee house which has an open doorway to a hair salon next door.  That is very stran","useful":1,"cool":0},"40nkV_T7UPHXWCMJPAK4-A":{"text":"Love the atmosphere and the simplicity of the menu. I decided on the Miss Tracy's Addictio","useful":1,"cool":1},"ESExLKjMQVCiqvuAnC4s9A":{"text":"Best coffee I've had in the city so far hands down.  If all you have had is big corporate ","useful":0,"cool":0},"GghHTL2Sd4GJgRQM-JsC4g":{"text":"Great little coffee shop with single origin pour overs and delicious (giant) muffins. This","useful":1,"cool":1},"xoKPJa5-2Xfv79ximjWW7A":{"text":"Cool place with a heady vibe. Kevin was very helpful with suggesting the miss Tracy's and ","useful":0,"cool":0},"bOESJoFQQdZlTjA2d-uJQA":{"text":"Love the spirit of this place. Not to mention the Rock-on coffee! Every time we come back ","useful":0,"cool":0},"IideU5_k2HQp1bIHMgTTZA":{"text":"Wondered in on an usually chilly morning and started with a warm macchiato and fresh cranb","useful":3,"cool":3},"aMbrTsKOj7rQZZSZNz_7Kg":{"text":"Best coffee shop in New Orleans, and one of my favorite anywhere.  You need to meet the ow","useful":2,"cool":1},"JHQm7ykrhM48xpDZH22kJw":{"text":"Can't go wrong at this coffee shop. The baristas are so very friendly. Shout out to Ben le","useful":1,"cool":1},"xTN83YmatacGi-h9gtmegg":{"text":"One of the best decisions I've made in NOLA. Who'd of thunk coffee,cayenne,honey and cocon","useful":0,"cool":0},"I9OF5Kaq87ijRhcstms8xw":{"text":"Super cute cafe with a very nice owner. She said they just celebrated their 1 year anniver","useful":0,"cool":1},"QX01S_h1kmby-K0ZKNA1-g":{"text":"Really friendly staff!\n\nCarrot with bran Muffin\nChocolate and white chocolate swirl muffin","useful":1,"cool":0},"GfNS9m1Ruc83efEzqaw_ng":{"text":"Cool, unique and comfortable interior. Spacious and hip. Great pastry items. Coffee select","useful":0,"cool":0},"nIOfoESFJj4P3RsU7FUQVQ":{"text":"Last morning in NoLa and had to get to Addiction due to the high ratings. Sorry to say my ","useful":0,"cool":0},"lwJjZPM9r0wuO2NsHjWMsQ":{"text":"I usually don't write a review but this is an exception because It was \"exceptional\" I got","useful":0,"cool":0},"DWKc2mUasHNpXIUsudDAbA":{"text":"As we walked in we were greeted with a warm welcome and a smiling face. David was so frien","useful":1,"cool":1},"xi7ym34Zrz6uHjPyEmWMaA":{"text":"Great place!! Can stress it enough this is the place to get really good coffee. The atmosp","useful":0,"cool":0},"_ErwTHAFPC6FP_kxPZR_rQ":{"text":"Funky little coffee shop, geared more towards a younger crowd (i.e., not one of those tour","useful":1,"cool":1},"4Edh0CdT1jBlxgyq3_TMPA":{"text":"Friday, 10:00 AM.\n\nQuickie:\n+ Drink quality\n++ Friendly staff\n+ Cleanliness\n+ Quick turnar","useful":2,"cool":0},"6mO5i0o7NexvhpCFfd_dCQ":{"text":"I visited New Orleans two years ago and I still think about this coffee shop. We stayed at","useful":1,"cool":1},"TjVxgrtwu4v6dHMzwSAQ0w":{"text":"I'm back home in L.A., and no expresso drink can compare to Ms. Tracey's Addiction. I miss","useful":3,"cool":3},"x-ZuVcAbRJHvzAFk69AqYA":{"text":"So pleased with Yelp... This is a beautiful place that changed some of my views on coffee!","useful":2,"cool":1},"htVesMccQ_xJrl8F3EOkmQ":{"text":"Amazing little coffee shop with a unique and fantastic atmosphere. Came to town to plan a ","useful":3,"cool":3},"kqKQ-4ziBE2SgYKvCTAinQ":{"text":"Best coffee in NOLA!!! I met David this morning and hearing about his vision was inspiring","useful":1,"cool":0},"wEHqf1t9INrdOzBrt-PpdQ":{"text":"The New Orleans iced coffee is awesome! Great atmosphere and great service. A lot of choic","useful":1,"cool":1},"iZkCDz-opzKPR1y46S0U8Q":{"text":"Do you want your sox blown off and your toes to curl? Try Miss Tracy's addiction. It's a c","useful":1,"cool":0},"JFHQ9KipnugohuMh6yn03Q":{"text":"I have been in NOLA for 2 weeks and having trouble finding a proper latte.  even asking fo","useful":1,"cool":0},"yoBz4wBOwQoOp3PHlrk4gQ":{"text":"The atmosphere of this place is crazy. Gorgeous rough wood tables, a hipster goth barber s","useful":3,"cool":3},"k6gMstiQCQ4HcjqHxuNp5w":{"text":"I loved Addiction both in the old location and in the new. Amazing coffee (the Miss Tracy'","useful":1,"cool":1},"ghVgV32SXI4X0eKGwYGJuA":{"text":"Absolutely loved this place! The staff was nice especially the lady that talked to us. Bel","useful":2,"cool":2},"ZNasuWCjvEsdRnGAYK6lFg":{"text":"Wife and I got the Miss Tracy's Addiction. Really amazing coffee both hot and cold! Cayenn","useful":1,"cool":1},"5Dd3CgaFHHORKyVVlFF92g":{"text":"I'm addicted to Addiction. It' my favorite coffee in the city!\nDrinks are consistently awe","useful":1,"cool":1},"CYZUmnpjUIww5cV5h4IJGw":{"text":"Extremely difficult to find, totally interesting on the inside, if one is desperate for co","useful":1,"cool":1},"K2pyhAq0F1lyIF4xZbU5Rw":{"text":"Awesome owner of the coffee shop and hair salon next door! Super welcoming. We stayed acro","useful":0,"cool":0},"n0C2zqmrmD_EcAPuvbL-Vg":{"text":"Found this super cute gem of a coffee shop right in the center of the French Quarter. Must","useful":0,"cool":0},"S5nk9FocXSCzY3Eo6zOSdQ":{"text":"This coffeeshop is closed and out of business. No one in there.  All lights and locked.  W","useful":1,"cool":1},"kG1fU86gg8uUX4dTmj8Qrw":{"text":"I tried the \"Miss Tracey's addiction\" which was very good! The dash of cayenne gives the d","useful":1,"cool":1},"su5Gz16ah7JjoWOLWWh9kA":{"text":"The reviews are correct.  This coffee is good.  I also want to eat every baked good in the","useful":1,"cool":1},"LzDTcFGbpPyEJ3BQxchy3Q":{"text":"It's apparent by all these other reviews that my experience luckily wasn't the norm but I ","useful":1,"cool":1},"CZulsSSh5MywxWPDlSLB_g":{"text":"Wow!! I just had a Miss Tracy's Addiction and I now know why Addiction has so many great r","useful":1,"cool":0},"B5eYqEHZjTX8qGcnwAwn3A":{"text":"This place is awesome and Kevin was the perfect host!don't miss this when in the French qu","useful":0,"cool":0},"0CGTlXqq5uycr11z0wgKJg":{"text":"The coffee was wonderful. I had the addiction. A little on the sweet side but very good. T","useful":0,"cool":0},"l6MKdYJfA3MBIN-bPKXXJQ":{"text":"This place is great! Miss Tracy's Addiction is incredible - I had it iced. The blend of fl","useful":1,"cool":0},"IteVqo4qht8Wl_1SOi0zTg":{"text":"Woke up every morning on my vacation to get the Miss Tracy's Addition. It was FANTASTIC! T","useful":0,"cool":0},"87IlIIsMlknFWFjlhac4Lw":{"text":"Miss Tracy's Addiction is amazing! So simple with so much flavor - and Miss Tracy and her ","useful":1,"cool":0},"vH-O93X1dTm5ZyTvspzDDQ":{"text":"Fun and original coffee shop. Miss Tracey's addiction is a wonderful masterpiece and a mus","useful":1,"cool":1},"01HVMIowmdbE3AxzdF9PsA":{"text":"Best muffin I've ever had. Coffee is not bitter as i wished. It's mild but has good flavor","useful":0,"cool":0},"TlCZsmf1idGMb3q8Tx-vbQ":{"text":"Wow what a great place. The nicest people inside. Great coffee cool place. The furniture i","useful":0,"cool":0},"w198-Zavb3945IvEm0DJAQ":{"text":"My favorite stop in NOLA!!! This FABULOUS place is expanding and growing. The new location","useful":1,"cool":1},"177ZXQD0FbmLjVsG3m88nw":{"text":"Awesome place. It has a really chill atmosphere. I got the Miss Tracy's Addiction and it i","useful":1,"cool":1},"jNYsGZbQLJe8Tt4rVW9HUg":{"text":"I really recommend Miss Tracy's Addiction. I'm really not a coffee drinker but that was re","useful":1,"cool":1},"1K1KlIa1on2io0mOMeSkTQ":{"text":"I really wanted to like this place after seeing the amazing reviews but can't say that I d","useful":0,"cool":0},"iFrhkFCR8fGgEYITg5xncw":{"text":"Hands down the best coffee shop in town. Inspiring design by the owner who made it all fro","useful":1,"cool":0},"YLo90XbpTSYnX-ES8stQzg":{"text":"Addiction is set to be one of those great New Orleanian hangouts.  From the repurposed fur","useful":1,"cool":0},"I9UZGqap4IckjdgokWAPDQ":{"text":"Miss Tracey's iced coffee was indeed delicious. Only wished they had pastries or something","useful":0,"cool":0},"00RnE-BcoGX03tIipEFBaQ":{"text":"Great place, nice chill vibe with cool decorations. Got the \"Miss Tracy\" and it was delici","useful":0,"cool":0},"iKG7i4DLL1g5l_5unQI2Ww":{"text":"If Miss Tracy were to transplant her coffee shop from NOLA to SF there would be a line of ","useful":7,"cool":6},"ifM2edI2stt9kXT96pI6GQ":{"text":"The atmosphere is as warm and welcoming as the staff: antique furniture and gorgeous hand-","useful":0,"cool":0},"OKbbbPzYjjKY1nFoo4gK-g":{"text":"Excellent place! Has a great atmosphere and very friendly staff (Jesse to be specific) he ","useful":2,"cool":1},"p_gcd3gnAz6UZFC5rr1pfw":{"text":"BEST. COFFEE. EVER. This place is welcoming, unpretentious, delicious and beautiful. My vi","useful":1,"cool":1},"8r_GsvIBN8ceKYBXyovK-A":{"text":"Located on Iberville across the street from The Courtyard Marriott. Everything Addiction o","useful":1,"cool":1},"HQpgwthDnxRsG9F_co7MIg":{"text":"Super friendly staff, delicious coffee and a local discount/reward program=my new favorite","useful":1,"cool":1},"X6uESSQuIIMddHnx2fPlZw":{"text":"My goodness. Eating here made me come back to yelp to review. It was such a wonderful expe","useful":1,"cool":1},"qkG_VaDov3IDBNXZewetwQ":{"text":"Miss Tracy's addiction is just that addicting. Delicious smoothness with a spicy kick in t","useful":0,"cool":0},"Tbj7a6Rnt48IxE_-FK0Fgg":{"text":"ABSOLUTELY AMAZING!!! Not only was the food phenomenal but so was Miss Tracey! She was so ","useful":1,"cool":0},"Zb1P1UrL5OswWGIqmeQbXw":{"text":"Beautiful space, promising locally-based business model and super-tasty coffee!\n\nI was in ","useful":0,"cool":0},"wX8BzGkdFsImo91dd2ACUw":{"text":"Little hipster spot, lovely chatty energetic staff, and the iced Miss Tracy's Addiction is","useful":0,"cool":0},"4kNnup8w81TAfd9k2k1SzQ":{"text":"I stumbled into this gem seeking non hotel Starbucks coffee. Wow. A find in the quarter wh","useful":1,"cool":0},"fHG9sJH4IJ9SZVTvPtsyCw":{"text":"Addiction isn't overly fancy or plain. It's not a place to visit for hours on a quest to g","useful":7,"cool":2},"wmFFsa2lyu4DcWRbdHYuJA":{"text":"Great little gem in the French Quarter of New Orleans. You would not notice it if you came","useful":0,"cool":0},"hnGKqVOZpjiEt5d0BU3zuQ":{"text":"So glad we stumbled upon this place during our trip to New Orleans!\n\nCoffee was amazing! I","useful":3,"cool":3},"iUQ7i0YsBkhfmzWQIcQldA":{"text":"Came here in the morning before a conference. Latte and baked goods were excellent. Caffei","useful":1,"cool":0},"sHT5wpx2ba_ELQMd2Z-QJg":{"text":"This place is awesome! The two black eyes will definitely wake you up for hours! One of my","useful":0,"cool":0},"MKE39J0T1V-g9DYZWgZErQ":{"text":"Addiction was the wife and my coffee shop of choice for our morning caffeine fix while we ","useful":5,"cool":4},"3K4aEk6PZ7ydGybD36n0Sg":{"text":"First impression was a very chill vibe - lots of woodwork and interesting things to look a","useful":0,"cool":0},"eWIkQrL0nYbgETrfZ1w47g":{"text":"Came her based on a recommendation from a friend who stayed at the Marriott across the str","useful":1,"cool":0},"P0y_tyInPiOD4qej65OwxQ":{"text":"Iced coffee was great but the air conditioning either wasn't on or had stopped working com","useful":1,"cool":0},"4ubPNxcCWgIubdPns4CWLg":{"text":"I'm from out of town and I came here hoping to try it but it was closed! Even after readin","useful":0,"cool":0},"tnVbU6VqDeo_2eEQ-bp-gg":{"text":"Great service and innovative drinks!\n\nWe were in the Quarter for one day and dropped by du","useful":2,"cool":1},"OCyxAuuq4aAIq_xbtF7zOA":{"text":"Definitely at a high level.  Great pour overs, interesting choices. Cool decor.  Currently","useful":0,"cool":1},"wolU0AeipyN8aT3S64mjWw":{"text":"You could have something other than a Miss Tracy's Addiction.\n\nYou could stay in your hote","useful":2,"cool":2},"zWNnL9fRYYVGlUChrCHKQQ":{"text":"Was in town for a gig staying at a hotel near Addiction and needed a good coffee to get me","useful":1,"cool":1},"tPvaWG83kkfzxi7DU2hfvQ":{"text":"Great little coffee shop, ask for Miss Tracy's special coffee!! She even had coffee delive","useful":1,"cool":1},"Sh432wn6Gz6tdQW4wIh9Dw":{"text":"I went to Addiction twice while visiting NOLA. While it was a quant place and I appreciate","useful":3,"cool":0},"wiCXfr4hTPALgfsCm2scig":{"text":"Hands down, the Miss Tracy's Addiction is the best coffee I've ever had in my life!!!!!  N","useful":0,"cool":0},"VHa6eWRQowU-XV11CUQPvw":{"text":"Whenever your in town addiction is your choice of establishment for coffee. The atmosphere","useful":7,"cool":5},"UDrmoHuC7WCQ4IxBvgG7-w":{"text":"\"Addiction\" coffee is conveniently located in the french quarters.  While the coffee stimu","useful":1,"cool":1},"29sXGv9cGx7rAvkFIP4Okg":{"text":"What's up with the hype? Boyfriend and I were in town on a visit. We found this 5-star cof","useful":1,"cool":0},"9zqL48zhAQqZJ0Oj-RF_EQ":{"text":"Best coffee I have had in the .. that good had to have 2. Annndddd got a haircut by Brandy","useful":0,"cool":0},"RBtacMJH9hdsWTdrujhFyg":{"text":"We stopped in after a rain storm in serious need of a hot beverage, and I'm so happy we fo","useful":0,"cool":0},"BWiFZZFiKFiqYe1qUDAe9g":{"text":"delicious coffee with super friendly service... and many dairy alternatives for a lactose ","useful":0,"cool":0},"x4K2arBTeEqmJ9c_MUDO0g":{"text":"Amazing. Magical. Superb. \nMiss Tracy is an artist in many mediums... coffee is one of the","useful":2,"cool":2},"C1p8mNDo-CMY5frhZpg0nA":{"text":"This place is fantastic, a welcome escape from Bourbon st.  The staff are all excellent - ","useful":3,"cool":3},"WD65akm0xosj6D053L9jaQ":{"text":"First timer today, Yelp told me I might like it and they were correct. With the sign not u","useful":2,"cool":2},"t0QioHwvaFAQJXBaq4uFcg":{"text":"I went her today for the first time. SOOO HAPPY  I did. Miss Tracys Addiction is a delight","useful":1,"cool":1},"UznjMdCcIbgllyHAQGTHfw":{"text":"This place deserves every star it's received. The owner is passionate about her coffee. Gr","useful":4,"cool":4},"JRwdSoCS5jsTYS6-ZtewOQ":{"text":"First let me say... This is the most amazing coffee place you will ever go to. The coffee ","useful":1,"cool":0},"GsJmNAdtKwr4d55AOdhPWQ":{"text":"We stayed at one of Miss Tracy's nearby AirBnB rentals while in the area, so we frequented","useful":1,"cool":1},"6P-oeki5vbPW6kRlW0H_ow":{"text":"I've tried to go here 3 times now and every time it is closed. I thought it would be nice ","useful":0,"cool":0},"KsR2-CN3FkMTUnfqlYtCvA":{"text":"A coffee place that began from humble beginnings, saying that its just \"great\" is an under","useful":0,"cool":0},"E1ZVTIqIUJpKmAx-VaiXig":{"text":"Amazing coffee, excellent baristas, phenomenal vibe! Best coffee in NOLA certainly. The pl","useful":1,"cool":0},"90B0TFbvBs9k49HBoKsgOA":{"text":"Hands down the best coffee in the Quarter. The Miss Tracy drink is a Must-Try... Don't rea","useful":0,"cool":1},"4LZlTMCdW0-SYBGT9uhVWQ":{"text":"Great latte and very friendly staff!  Dog friendly as well.  Hung out here for a while on ","useful":0,"cool":0},"VHwV8Do9V28OK7dzBkBFAw":{"text":"Most delicious coffee I've found in a long time! Amazing atmosphere and decor. I'd recomme","useful":0,"cool":0},"VVhHeiljIHoAYg5LOQclTw":{"text":"Miss Tracey and her daughter are so nice, warm, and welcoming! They provide a really good ","useful":0,"cool":0},"uh5oGyp9F0Ev9nGhFL8B_Q":{"text":"Unfortunately, the coffee was way too hot and the milk was poorly emulsified. Overall, it ","useful":1,"cool":0},"QCbP3U7H81ABYP2zBNe0Fw":{"text":"This establishment, nestled between old town NOLA and the Downtown area, has a stunning im","useful":2,"cool":2},"zzPKSYEXXVr8KM8d0FWgeg":{"text":"Awesome little coffee shop in New Orleans . Great coffee with some unique selections , coo","useful":0,"cool":0},"7DEXuH_hl19nceHTbrMdpg":{"text":"Miss Tracy is worth the hype, I'm from Australia so OK with paying $4.50 for coffee, nice ","useful":0,"cool":0},"kCOGEPx0zPoljIql4VyojQ":{"text":"This newly opened coffee shop located across from the courtyard marriott has amazing coffe","useful":1,"cool":1},"oMkt9m0rHoQ7Fd8cO_Pb6w":{"text":"Strolling the French Quarter, with their New Orleans Iced Coffee in my hand and feeling no","useful":0,"cool":0},"WUiwVFFBbhjOjSFxPh9GMg":{"text":"Excellent coffee and a very cool place. We went with friends and the staff was very friend","useful":1,"cool":1},"moIP-1YZ2GiE_QQu5hYkOw":{"text":"Amazing coffee!!!  Kelly was working the day I went and not only made me a great cup of co","useful":0,"cool":1},"96lqZCY7zrOEjp7ew1YV_w":{"text":"Miss Tracy's Addiction was a refreshing change from your usual coffee drinks. Interesting ","useful":0,"cool":0},"OFy9MhsUOZ5YdSGeC-EOJQ":{"text":"Okay, this review is more for the ambiance and service than the coffee.  I only got the dr","useful":0,"cool":0},"eXmwwgeKJ4YI1-BwIUHdRA":{"text":"First and foremost the baristas have got to be the nicest I've ever met, and I'm a coffee ","useful":2,"cool":1},"OmROwvdlOfKJwGkNY-IUQA":{"text":"It was a cool looking place inside with excellent reviews so I thought I could try them wh","useful":1,"cool":0},"7q5npv0ibbTjaNtWQWbM-A":{"text":"Miss Tracy's addiction is unholy. Jesse is the man. Pretty much a  moment from start to fi","useful":1,"cool":1},"05mkCK2eCpJWXg7xXJ_jeA":{"text":"I had the New Orleans ice coffee (meaning it has chicory in it) and it was very good. The ","useful":0,"cool":0},"Chz5o9TwBQP7in3HehWisA":{"text":"I usually take my coffee without sugar. Still I feel the Miss Tracy is by far the most int","useful":1,"cool":1},"6keeT8p2wtjTPrOX-NU_hw":{"text":"Great local coffee shop! The staff was super nice and the coffee was delicious!","useful":0,"cool":0},"uqhPzMS-gPuJR38obYyd9A":{"text":"I got off the streetcar and this was the closest coffee shop to where I was. This place is","useful":0,"cool":0},"SEvyhXgug8um2RLIpRUSlA":{"text":"This is a very unique coffee shop.  It had great muffins.  We had chocolate and blueberry.","useful":0,"cool":0},"Wcr-bm09VIsv0zUu-gzG9Q":{"text":"Nothing too special about Addiction. Maybe because I just got a cold brew iced coffee and ","useful":2,"cool":1},"l3toXzYnHnaBQuTMfoYZzA":{"text":"The kindhearted service, from a young man, that enjoys what he is doing and took great car","useful":0,"cool":1},"3KmPDZvjyycZv9jnqSwa6Q":{"text":"Who wouldn't be tempted to go to a business that has a nearly perfect rating out of a dece","useful":6,"cool":2},"VEV5rIR2aiwlrCEocT_kug":{"text":"Awesome coffee with honey and Carrot Cake muffin with Fantastic Service. The ambience was ","useful":2,"cool":1},"5jkrTjlim6ENHlyd-ZuU4g":{"text":"Yes, yes, and yes. Sometimes a coffee shop just delivers the perfect combination of neighb","useful":0,"cool":0},"pVVxxx_6uv275xgskOoa4Q":{"text":"ADDICTED TO ADDICTION ! \n\nWOW! What a place! I arrived in NOLA late Friday afternoon and w","useful":1,"cool":2},"ZxsXtu-6cee52YBbpria2A":{"text":"Coffee was not good, experience was not good either.  Very dark and sparse coffee shop. St","useful":0,"cool":0},"p6rKL13DR7u2EIqgFyM1DQ":{"text":"Not really sure I understand the hype. The location is not ideal, there aren't enough staf","useful":0,"cool":0},"qd7r8-yYq5ulBDT1IrPzkg":{"text":"Ahhhhhhhmazing!\n\nExtraordinary!\n\nPreservation of coolness! \n\nYes they serve excellent grad","useful":41,"cool":41},"lgtQ-oI5Yg6LEiBRsmcAwQ":{"text":"I'll continue to try and make the perfect iced coffee on my own, but every time I do, I tr","useful":2,"cool":1},"ndmenpShZWQw_jxC26s2xQ":{"text":"I came here 4 days in a row on a recent trip to NOLA and I was really unimpressed with the","useful":1,"cool":1},"JEy3B5hJu_OKiE_J4rC9-A":{"text":"Great coffee and really friendly staff! My fiance and I had a Mocha and a Miss Tracy's Add","useful":0,"cool":0},"JkupCAmZuK1-vVkHz2Kixw":{"text":"Believe the hype! Miss Tracy's Addiction is an inspired and delicious creation -- had it b","useful":0,"cool":0},"PgjmRbAP7TKuXrz3GmE5mA":{"text":"I like to check out local coffee shops wherever I go and found Addiction through Yelp. It'","useful":2,"cool":2},"A_WWIVi6TQ73zMmWlVUhzQ":{"text":"I'm not a coffee aficionado by any means, I just enjoy a social coffee every now and then.","useful":0,"cool":0},"QelZGNMbxjbGCtaMI5HEDw":{"text":"They know how to make coffee here, it's delicious. They don't only have muffins, but you c","useful":0,"cool":0},"_PMACo0HOhVPWk0PZgzv4w":{"text":"It's got good coffee, and great atmosphere. Almost more fun just to hang out and look at t","useful":1,"cool":1},"R7QpyABCjSrBU9f-m14fNg":{"text":"Phenomenal coffee and perfect ambience = my productive best even while on holiday! A cute ","useful":0,"cool":0},"7g2aegdbuA76XDhHrm7ziQ":{"text":"Wow!!! Addiction is as good as it gets. I had a pour over and my girlfriend had the Miss T","useful":0,"cool":0},"h3tmfnidbUlYjG73WxcVRg":{"text":"Great coffee and espresso drinks. Location is perfect and well decorated. Service is top n","useful":0,"cool":0},"QCmilsHSCcHzXJj0o35YFQ":{"text":"Amazing service from the lovely barista Kelly! My fiancé and I both ordered Miss Tracy's a","useful":1,"cool":1},"5w9CMF8OdHujZf6Rr5xmBA":{"text":"Tired of Starbucks, PJ's, all the other chain coffee shops? Addiction is where it's at. Th","useful":0,"cool":0},"wIh6FjN9csDO2qrmzO6BTg":{"text":"As a heavy coffee drinker; I am a huge advocate for a well balanced robust cup of coffee; ","useful":1,"cool":1},"zwJ3Oz44q9xVFv-KK5PSIA":{"text":"Great take on coffee. Had single origin pour over and it was made with love.  Also had the","useful":0,"cool":0},"RquKEeSVU7JYRyLrQDPtig":{"text":"Miss Tracy's addiction....it's something I can't really put words to, just amazing. The ho","useful":0,"cool":0},"DX6HqpaxJvWWzgB4PCe19g":{"text":"Excellently coffee, good vibes, friendly staff. Will be returning for my coffee needs","useful":0,"cool":0},"XbjstPiif0bl8vk4FY1HBg":{"text":"Cool place.. quick fix and the place screams urban creativity at its finest. Pull up a sea","useful":6,"cool":6},"PmR5Kf7ptJprLoEaldlYvA":{"text":"Great atmosphere with unique and comfortable space to sit and work. I'm going to differ fr","useful":2,"cool":2},"UMimp-SFX7dGh1MulUJqfQ":{"text":"Ms Trscy's is THE BEST!!  I love coffee!  No, really! I love love coffee and should probab","useful":2,"cool":2},"o2I1ZuAf7lOimKupgyVHaw":{"text":"I just have to say that this is by far the best coffee in Nola. You can go in and enjoy yo","useful":0,"cool":0},"T75VETLCRDAvRp8ujwl-uw":{"text":"AWESOME coffee spot with great staff. It had this very obscure underground New York gothy ","useful":0,"cool":0},"1fmdrbsGedQBJOIVoh_nJQ":{"text":"Miss Tracy's addiction...all you need to know! Hot if you want more of the coconut milk sw","useful":2,"cool":1},"V6BIoHi6q8eAhEmbgUsYjQ":{"text":"Besides having amazing coffee the staff is amazing as well. Very nice hospitable team. You","useful":0,"cool":0},"Ivfg0irleK9iz5C80IXoTQ":{"text":"Walked a half a mile  in the hot sun at 8 am to this coffee shop because of the great revi","useful":4,"cool":0},"b5-dxjW4OLZaoheoCKlGtg":{"text":"Welcoming atmosphere with friendly staff and yummy iced coffee. It was a great place to st","useful":0,"cool":0},"BRP12ZBysaOboOG1tBUzSg":{"text":"Totally deserves 5 stars, best pour over coffee ever, and the muffins ain't bad either!","useful":1,"cool":0},"EQM6Vjg63d8p-BCIngaV6w":{"text":"Love the atmosphere. I was interested in Miss Tracy's Addiction but was concerned about th","useful":0,"cool":0},"whE-upnYul-mMzdva7hM3Q":{"text":"Tasty coffee. The addiction drink was delicious but overly sweet. The two black eyes was f","useful":1,"cool":1},"aXwWtwAwQ1Re9LFxfneukA":{"text":"Great atmosphere, delicious coffee. A great stop for NOLA first-timers. Ben & Nina were fu","useful":3,"cool":3},"7LEAapsRYkAZUb2CvUoERA":{"text":"Great coffee and the owner is very nice! Definitely try the miss Tracey addiction LOVE THE","useful":0,"cool":0},"hUniB0B9QuyUcosNQpd9_Q":{"text":"As simple as it gets!  No frou frou anything!  Milk choices 2%, whole milk or half and hal","useful":2,"cool":1},"qq9lgizfIbcI7YqnyKJsyQ":{"text":"Addiction is probably the newest coffee bar in New Orleans and was conveniently right arou","useful":6,"cool":6},"4wk6jntSbVQ9ucjd5pKwZg":{"text":"I holed up here during the working part of my \"vacation\" and this place was really a nice ","useful":3,"cool":1},"UY4tYemDIuXoM-nPq-W98Q":{"text":"Went to the best coffee shop in Nola today and the staff were great. They have a new girl ","useful":1,"cool":1},"2kpy8jX4ycCmsArxOIKByg":{"text":"Stopped in due to all the reviews to try the miss Tracy's addiction. It was soo good and i","useful":0,"cool":0},"7oEedeBJ7kID31VDQRRyCg":{"text":"Their signature cayenne pepper coffee drink is worth a taste (expensive tho), but other th","useful":0,"cool":0},"uM6set6xwd7LWox2epYfEA":{"text":"I love this place. The hole new Orleans world should come here. Love you Tracy ... The muf","useful":0,"cool":0},"a3qqjPMHg9RJ79OrAGg5iQ":{"text":"This is an eye catching - aesthetic place and Good, really good coffee. Had a regular coff","useful":1,"cool":1},"TiLzv5oTLAQpjRehDDHLBA":{"text":"After reading the description of their coffee, it reminded me of another coffee spot in Ch","useful":7,"cool":7},"cmqz5qAHpb44om7FF2NIxA":{"text":"So glad this was across the street from our hotel. Their coffee is excellent. Great atmosp","useful":1,"cool":1},"uziAMG_yOEE3IcfzEEAZHw":{"text":"Simply amazing!  Try Miss Tracy's Addiction....you'll be hooked.  Great space for working.","useful":1,"cool":0},"2CupcsvFHeLffHaMp9bteA":{"text":"Great coffee. You have the option of drip if you don't have all day for the poor over. Own","useful":1,"cool":1},"xVCS3ptAhYOXbcEGd2OYCQ":{"text":"Miss Tracy's addiction is amaaazing!! Brandi was warm and friendly, and really helpful wit","useful":0,"cool":0},"5aRVY9yBwd1NYY_B_s-dkg":{"text":"The real deal!! I can honestly say they serve the best cup of iced coffee I have ever tast","useful":0,"cool":0},"FX5G0Q4cIa-eKvd288_ICA":{"text":"Delicious coffee. Very reasonable prices. Nice decor without being *too* hipster (I guess ","useful":0,"cool":0},"rIb9kQydY2tP8YcP86ZgTg":{"text":"Addicted to their cold brew!\n\nOthers seem to love Ms Tracy's Addiction.  Be warned that it","useful":0,"cool":0},"IUjcyPDEU_nCCuVksvd1sQ":{"text":"This place is great, delicious coffee. I stayed right across the street at the courtyard, ","useful":1,"cool":1},"uRr1NUqjZzWkYZXBPRW_AQ":{"text":"Addiction rocks!\nGreat staff, very warm and friendly, very homey feeling without the crazy","useful":3,"cool":2},"0YDDwqoh0v-FSXQNN6vL9A":{"text":"Got the popular Miss Tracy's Addiction based on another recommendation and I'm glad I did.","useful":1,"cool":0},"fWtHiJQkBp7XH5iQySBuqg":{"text":"Really cute cafe far enough away from Bourbon street that you avoid bad music being blaste","useful":0,"cool":0},"IQ9o6J5Nf8aTduYuib6obQ":{"text":"I am so upset I didn't find this place earlier in my visit to New Orleans.  Just a hop and","useful":4,"cool":6},"p3oScnrTqJ6RJi5cVLFH1g":{"text":"There's always something new to discover when dealing with miss Tracy herself but her drin","useful":3,"cool":2},"pdHdc2P_WCi-7c5uydWOxg":{"text":"I tried Miss Tracy's addiction special ($4.50) and it is worth the wait & price! The espre","useful":1,"cool":1},"W_EVZxo1QJ09rcgqD0M2DA":{"text":"Worth going out of your way for a perfect cup of coffee! Great pour over and iced coffee.","useful":0,"cool":0},"jHC5F8UK1EYJJZ1ueedHOw":{"text":"Came here everyday that we were in NOLA! Loved the New Orleans iced coffee and Miss Tracy'","useful":2,"cool":1},"6Y_FMcfIMQbwZfCJgJ2MBg":{"text":"After some great reviews we were excited about this place. We visited today at 5pm and it ","useful":0,"cool":0},"GBgBnC8GNgOYLF_EnbceiA":{"text":"Great coffee, cool decor, friendly wait staff. If you're in the French Quarter, stop in at","useful":0,"cool":0},"x-br8inZR05enN6oO8H8HA":{"text":"Stopped by here for coffee, the addiction specialty drink is amazing! Jesse was also super","useful":1,"cool":1},"_hwH5Ck-sL7_rcvKdTtjNg":{"text":"it's true.it's true. miss tracy's addiction will have you addicted. \n\nit was the best iv'e","useful":0,"cool":0},"7UpmTs6WmtcxtC1nPmpRbg":{"text":"Fantastic coffee! Fantastic service! Ms Tracy's addiction is delicious! Coffee and Cayenne","useful":1,"cool":1},"7KUQKB8wuB7_o5japIgqDQ":{"text":"The best local spot to grab a cup of Joe and some friendly conversation. \n\nI had Miss Trac","useful":2,"cool":0},"UyaT-ZIhkXYgjbAb6P5tMg":{"text":"Being from South Florida I needed my \"cortadito\" and I ended up here, and per Shelby's adv","useful":0,"cool":0},"JY5ujbFU5iaOT8Lv18RYKA":{"text":"Bam! Your ears may ring suddenly if you quickly slam down Miss Tracy's Addiction - a hot c","useful":2,"cool":3},"eab-LsL560LoVr8Z_xav9Q":{"text":"Love this perfectly named place.  We were going to run in for some to go coffee but stayed","useful":1,"cool":1},"7-s72rCCfVFxxBiTH6kmDg":{"text":"I love this place. The hole new Orleans world should come here. Love you Tracy.you have to","useful":0,"cool":0},"Xj6orgqi812RtSTk6dg4oQ":{"text":"Addication coffshop on my opinion \nIs the best coffe house in United States\nNot only the u","useful":0,"cool":0},"h4BTu82D89qRRqgH2vr7rQ":{"text":"Love this French Quarter gem!  Laid back awesome friendly service, top notch delicious cof","useful":1,"cool":1},"GtaBV_rA4ESVCSPrvuNONw":{"text":"OMG, I'm obsessed  with miss Tracy's addiction, unbelievably delicious and truly addictive","useful":0,"cool":0},"ZWzI4cPu9ARVVA9nCzDluQ":{"text":"I'm addicted. There I said it. I was recently in NOLA on vacation and was looking for a co","useful":5,"cool":6},"uzBUmidr24esUNgR_5qE5g":{"text":"We stumbled on this place across from our hotel when the hotel let us down with coffee cho","useful":0,"cool":0},"bJh1o1YKAZtb_JNSFm4I_g":{"text":"Best coffee in NOLA!!!!! We were vacationing from Indianapolis and Tracy and the whole cre","useful":0,"cool":0},"dUu0of_0KBkfryWX75fYag":{"text":"I happily admit that I am a coffee addict, and because of this I take my coffee VERY serio","useful":0,"cool":0},"sXAMv2n2c2VF-4GI8QdCuA":{"text":"Dip your oatmeal raisin in the Miss Tracy's Addiction. Game changer!!!!  Put the raw sugar","useful":1,"cool":1},"IcYXgZZmMYPGLsZ50uMlnA":{"text":"Delicious, must try the Miss Tracy's Addicition coffee, we came back for another during ou","useful":0,"cool":0},"99WWagatC3NqgqDSKqzjyQ":{"text":"I ordered their lovely signature Miss Tracy's Addiction. I got it iced. Very good! The fla","useful":0,"cool":0},"cRZvNTPcYmQxkHxe42D5zw":{"text":"Great environment! Great customer service!! I loved the place and we had some great cofee!","useful":0,"cool":0},"mJUElN8w-azylAQrxp851g":{"text":"Great coffee! Had the addiction coffee and it was made with coconut milk my favorite! Gonn","useful":0,"cool":0},"U9XgmAFjcLP9LB-ovYW8NQ":{"text":"Omg so I Love this place I thought today was going to be a regular day grabbing my regular","useful":4,"cool":2},"TPDlYY9A0c3mqMB-erNoBA":{"text":"The coffee is fantastic and the staff is wonderful. You have to try Miss Tracy's Addiction","useful":0,"cool":0},"PGZMp3ALUFuCaNZybLCTrA":{"text":"Excellent coffee and incredible local business. Tourists and locals alike should come supp","useful":0,"cool":0},"wCxuh-K9-_goq0QbTF4e-w":{"text":"I stopped in to this coffee shop strictly for the Miss Tracey's Addiction. It was beyond w","useful":0,"cool":0},"roE4Elukqf93339DBwF53w":{"text":"The icing on the cake for our last morning in NOLA. Managed to squeeze in a trip to @addic","useful":0,"cool":0},"oE66z26CUlVegC_df_c2yQ":{"text":"I got Ms.Tracys addiction and it may be the best coffee drink I've had on ice! Awesome own","useful":0,"cool":0},"qY5r5hHYCs4Lpw52VPSebA":{"text":"Sadly, \"proper\" coffee is not mainstream in the US; they seem to prefer the bucket of coff","useful":1,"cool":0},"UHdHWrt0VCtn7Aj8vaK4SA":{"text":"This lovely place is most definitely not closed.  It's open and delicious!  Bananas foster","useful":0,"cool":0},"i2gWR4p6nFeOtXNDnYDUqA":{"text":"Addiction coffe house is amazing.\nBest customer service.\nBest price for higher quality cof","useful":0,"cool":0},"guBxnI6w6tbS3eZSvoS6iw":{"text":"I work for a tech startup down in Miami - who regularly consumes Panther (automatically ma","useful":3,"cool":4},"Tk8mH4WX3Z6X0HC8hxK11w":{"text":"My friends and I walked passed this coffee shop/hair salon and appreciated the steam punke","useful":0,"cool":0},"uguoIToZ5JN7C7BC_lgU4w":{"text":"Great atmosphere and convenient location within walking distance of Jackson Square. The de","useful":3,"cool":1},"RfKoC6dK9LRjNEgkqofcuQ":{"text":"Had a layover day for vacation plans and stopped by Addiction for a pick-me-up. Sean hooke","useful":0,"cool":0},"44ORqSBi3VvKIj0CwEFfGw":{"text":"Shelby is the best!!! She hooked it up with some of the best coffee in the French Quarter!","useful":1,"cool":1},"Q_dwcROKhobmdD9jf54goQ":{"text":"Awesome shrimp and grits for breakfast and good coffee to boot. I would definitely recomme","useful":1,"cool":0},"J9zsi72NOEp1q4CFUGSfYg":{"text":"Hands down best coffee in NOLA. Even my coffee snob girlfriend was pleased. If you are an ","useful":0,"cool":0},"JGdtXUhFSsQK00T1DNnYTw":{"text":"Fun eclectic coffeehouse. Outstanding coffee served out of a brutalist storefront offset b","useful":0,"cool":0},"bqPu6oSYXp4oNfSM9AuYWQ":{"text":"Extraordinary coffee! The coolest batista ever. A little bit pricy but worth it. I'm not a","useful":0,"cool":0},"pTIk5ILcVoV57VxW1N6cvw":{"text":"Fantastic pour over and amazing service. She was so nice and talked to us after our first ","useful":0,"cool":0},"6f6vWlWDf1k4-mdvEvo0Fg":{"text":"Got Miss Tracy's Addiction and it didn't disappoint. Just the right mix of flavors with th","useful":0,"cool":0},"UOKGjiBwb_QUPHUbeNKBHg":{"text":"The shrimp and grits at Addiction is super tasty, and the coffee rocks too!  I would recom","useful":3,"cool":2},"aUv2EIcs0q3gzmN64BGW-w":{"text":"I love this place! I work in the quarter and it's right by my parking garage. It's my go t","useful":0,"cool":0},"JY2kjzZSohj7HCi0UXZg6w":{"text":"My husband and I are visiting from Indianapolis and we have loved going to Addiction every","useful":1,"cool":1},"JefEcAmz8rEursEWbjZtNQ":{"text":"Sometimes you go into a coffee shop, and you come out with a story. Brandi told us the who","useful":1,"cool":0},"7tVtjWwuAqnP41leYe4Zqw":{"text":"I'm so glad I made time to stop at this hidden little gem my last visit to The Big Easy. T","useful":1,"cool":0},"K5kg8bQA1BngFLQKKKKoHg":{"text":"I never write reviews, but I have to say -- Ms Traceys Addiction is the best iced coffee I","useful":0,"cool":0},"rnNYMz4_3yvGUs8nv0Up2Q":{"text":"Ben and Ryan were very friendly and welcoming ! Second time here and always great service ","useful":1,"cool":1},"3wKB6QB5VjQ1_O-cmy2MCA":{"text":"Only three month in business and these guys seem like pros!  The space is decorated with a","useful":1,"cool":0},"PizC_ACcK4_hOGKKvjlVWA":{"text":"YELP -- A business moves because they have grown! What's going on? I recommended this loca","useful":2,"cool":2},"w35BAJzhXFSd4NHUA3QEFg":{"text":"I love this place. The hole new Orleans world should come here. Love you Tracy this is a m","useful":0,"cool":0},"5b5eSZKpGXzB08RqrM6Hgg":{"text":"This is the neatest little coffee shop!   Amazing Design!  I love the vibe and the locatio","useful":1,"cool":0},"cGu7CqdHVwtKejO943ZgEg":{"text":"Very bad cappuccino, and bad service\nThere was no foam , no taste . \nHad read such good re","useful":1,"cool":0},"HjcCs_r0MwnjDQ_1bMZPtw":{"text":"Only thing as delightful as the cold brew is Brandi -- who could not be more friendly, gen","useful":0,"cool":0},"0NoZn2rTF5CapARZEulVIA":{"text":"Addiction is such an awesome little coffee spot! My girlfriend and I had the bittersweet e","useful":0,"cool":0},"2uACHimv9YP8K7N-9pNzhg":{"text":"Nice place to escape from craziness of Bourbon St.  I tried Miss Tracy's Addiction, and dr","useful":1,"cool":1},"1UekskmitYIPJSRo6sZqhw":{"text":"I'm addicted, so much so that I this is the only place I get my coffee from. I pass the il","useful":2,"cool":1},"xBVVhC1o1PI4scz_XunvIA":{"text":"This is such a nice coffee shop that also sells shrimp and grits which might I add tase de","useful":0,"cool":0},"IsFHHMdWCt4lwd-zyg9aew":{"text":"Went to Addiction after a friend went here after his run and told me he had the most uniqu","useful":0,"cool":0},"yM6hiP0NitwrxUbepfYFkw":{"text":"Great spot to relax and have an awesome coffee beverage.  Had an iced latte with honey, pr","useful":0,"cool":0},"lvXYWDWhidJjZbGsTzb38w":{"text":"On a recent trip to NOLA, my hotel happened to be right across the street from this place.","useful":14,"cool":10},"tEWgKgxevAYmSi-ZDImi9w":{"text":"This is such a nice coffee shop that also sells shrimp and grits which might I add tase de","useful":0,"cool":0},"UM3IaGSm2Qg1NByTgolkwg":{"text":"I wanted to love this place! On the bright side - it's big, breezy, cool decor and has fri","useful":0,"cool":0},"b1bRVlpe1uhDO7itGOv5iw":{"text":"We enjoyed it a lot. Coffee was excellent. We had \"Miss Tracy's Addiction \" which was uniq","useful":0,"cool":0},"3SCnI3BGLMUEyVVuqEsyPQ":{"text":"This wonderful coffee shop was just a ten minute walk from our Airbnb and it was a wonderf","useful":0,"cool":0},"lFwFJhTFicksLO-Zj_Vy8Q":{"text":"Cute funky little coffee shop tucked away in the Quarter. We enjoyed the house special, Mi","useful":2,"cool":2},"HfkgvAZe9imVj-RPmc6aeg":{"text":"Stayed at airbnb a block away from Addiction.  We arrived on a Thursday afternoon and was ","useful":0,"cool":0},"BlU85viHQR2OxuRCWdgKlQ":{"text":"Yummy coffee, terrific handcrafted witty decor, and genuinely feel-you're-home friendly. I","useful":0,"cool":0},"SXvuyW1hTHTxPDp4qqPR5w":{"text":"My friends and I stayed a few blocks away from Addiction last weekend and ended up getting","useful":0,"cool":0},"C2Dpb3A9XuOcXTlakI1E5g":{"text":"We were looking for a local breakfast spot and found a true gem.  Service was impeccable, ","useful":1,"cool":1},"sQ-o2wiuNYIPPRNQGUXOVg":{"text":"What a great place to start your day off! The coffee and tea here was great, as well as th","useful":0,"cool":0},"QeWhOdJnFVqN2kLBNeaNIg":{"text":"I found this cafe listed on Thrillist and when I saw they had a latte with honey and cayen","useful":0,"cool":0},"DF53EDlcSkYUjYC5H2-t7Q":{"text":"This place is awesome!! Only in town for one day and on our way out we stopped by to grab ","useful":0,"cool":0},"16bUlFLM3pacsqg3CVxDqw":{"text":"Amazing coffee! Delicious ribs! Top tier service! I will definitely be coming back here an","useful":1,"cool":0},"WhGPtJIlGwDnpouaZDnaRQ":{"text":"This was on yelps list of places to hang out and study, and I can 100% agree that this was","useful":0,"cool":0},"mcCTKg19TjP3rjkDsEa2zg":{"text":"Perhaps it was the fact that twice, I stopped by during normal business hours and twice, t","useful":8,"cool":3},"DbIyhrqOp8w9JsJeRqfajw":{"text":"Shelby and Olivia were awesome best coffee and muffins in New Orleans ... Play great music","useful":0,"cool":0},"lOMgkr0gMwsXHLCrntAbrw":{"text":"Miss Tracy's Addiction. That's all you need.\n\nSuper unique twist on your standard latte. D","useful":8,"cool":7},"d1K_aXAVOUcBxZV9Qz-nyA":{"text":"Best cold brew coffee I've tasted. I'm from Portland and it's really hard to compete with ","useful":2,"cool":2},"d-DJf_7UDRWny-OjEch6Eg":{"text":"Visited NOLA again, and this place moved... and yes I did follow them. Miss Tracy's addict","useful":3,"cool":3},"F0wCNWHS3d0FhR5JLtrNbg":{"text":"Love this place and love Ben! Not only is the coffee great but their customer service is o","useful":0,"cool":0},"BhWZznSUqXxL7PX8VPKEsA":{"text":"OMG!\nBest coffee & barista ever!\nShe even opened on Christmas for a bunch of thirsty patro","useful":2,"cool":1},"9tGpRGzj37NmSqidqthJDw":{"text":"If you love coffee, this hidden gem is for you. I recommend Ms. Tracys addiction. Its a Do","useful":1,"cool":0},"D4z3oYVx81VbMJCXHL5o3A":{"text":"Our experience here was 5 stars for sure. Upon entering and moseying up to the counter whi","useful":1,"cool":1},"Q0a6PRh2IuLjMC9olWZLcg":{"text":"I love this place. The hole new Orleans world should come here. I feel so at home here and","useful":1,"cool":0},"wQVzQEKeO4QF4icWJ7hjWg":{"text":"One of a kind coffees sold here along side muffins that leave you drooling with even more ","useful":1,"cool":2},"-mIgOD_tUyRAp2slCWTQkQ":{"text":"It's a beautiful place to enjoy a delicious cup of coffee. Service is excellent and very f","useful":1,"cool":1},"YSwJvHAsC6kA-8QQqObm9w":{"text":"The barista was very friendly and her children were adorable and outgoing. I ordered a moc","useful":0,"cool":0},"gG17CnwV0chG6ctcpOy94Q":{"text":"Amazing coffee in NOLA and the French Quarter finally -- and a warm, cozy place to enjoy i","useful":2,"cool":1},"0X6U4ESrvE9Y9D5SjyTs0Q":{"text":"The best coffee shop in NOLA. Miss Tracy's addiction is this flavorful spicy concoction th","useful":3,"cool":4},"OGhfGHnePQL7XtsGfna2Lw":{"text":"One of the best cold brew coffees I've ever had. Super friendly staff. Can't recommend hig","useful":0,"cool":0},"rKnATIhch7A3ZThzaRQT_A":{"text":"So happy this was located directly across the street from our hotel, so no Starbucks for u","useful":2,"cool":1},"II_uMdFapEogh5PaG5XUMQ":{"text":"Great name for this place! If you can drink here and not become addicted then you're some ","useful":1,"cool":1},"sSw4eM047UG08tWDYESrew":{"text":"This place is incredible!  And very aptly named.  I was in NOLA for three days and went ba","useful":3,"cool":1},"iPkwA_bgDeNStxEr2krZ_w":{"text":"I usually get drip coffee, no cream/sugar, but figure I should branch out with a specialty","useful":2,"cool":3},"qPPNqOWaFkL3kh8wVr53Yw":{"text":"Venture from the hustle and bustle of Bourbon Street to the hidden gem of all cafes! Shoul","useful":10,"cool":8},"-Y559ITcsCrvmaEDcr0JQQ":{"text":"Coffee experts!  Serving local beans and local dairy.  Start your day with Addiction!  The","useful":0,"cool":0},"tjHF_yDZWduHzKkldWRMQg":{"text":"I came to Addiction Coffee after meeting Ms. Tracy (the owner). She swears by the \"Ms. Tra","useful":0,"cool":0},"93JmdBvWmTLNOr9Zypxvbg":{"text":"Yelp says this business opened at 7am. When I got to the door at 7:05, the Closed sign was","useful":0,"cool":0},"L3uC8Dkg_6GZPjc9EYreEA":{"text":"If I could give ten stars, I would. I'm a graduate student in NOLA and I can't find a bett","useful":0,"cool":0},"V-yannkSFr7irpl6iXvA2A":{"text":"Love this coffee shop and their staff. Their specialty Miss Tracy's Addiction is is amazin","useful":0,"cool":0},"-bXMxeSOKowiYaXveuTtXg":{"text":"Omg  this is the Best of the best coffee shops in New Orleans. If  you aren't from here th","useful":1,"cool":1},"4KO-8EbdPP1AaieugR9N-A":{"text":"I've tried to go to this coffee house twice during business hours listed and it is not ope","useful":2,"cool":0},"kYo2ej99GSciHB0aTIpczw":{"text":"Great local coffee, great staff, cool place! Put down the Starbucks and head over to this ","useful":2,"cool":2},"LkLHbiVcrtMc4_iohjzPHg":{"text":"Fantastic coffee shop.    Ms.Tracy's coffee drink is delicious!    If you are in NOLA, thi","useful":2,"cool":2},"1g8GLOH3w6bQsM7F7vxSsg":{"text":"This is the best selection of iced tea I have ever encountered, with six or seven kinds.  ","useful":1,"cool":1},"htJYdmbjl5eeLLFlpX9WcA":{"text":"Addiction is my new addiction! Been waiting to try this place for some time now and finall","useful":3,"cool":2},"hqcJV4_EOnEZ0hOYiSEr0g":{"text":"The Miss Tracy's Addiction is so so so good. Don't miss it. Plus, the pigs in the backyard","useful":0,"cool":1},"ZkKVajiIRhrf-Y6F52M-Ww":{"text":"My friends and I went to Addiction Coffee and had a truly memorable experience. Ramsey the","useful":0,"cool":1},"oSM--aIVXo8w0dRSjADHWA":{"text":"Miss Tracy. Get it. If you're not into sweet coffee much (I am not), you should ask for ma","useful":3,"cool":3},"K20ObgfPw15aSZryHOw3Gg":{"text":"Very cool spot and nice staff. There isn't any working WiFi yet, but they said it'll be up","useful":0,"cool":0},"TGXjZHd3GYxSXDIkf00GOQ":{"text":"I wish Ms. Tracy would open up an Addiction 2.0 in Los Angeles! I visited her coffee shop ","useful":2,"cool":2},"GeXmtdH1CAYPirM0H1Kw5g":{"text":"I created a Yelp account just to express that THIS IS ABSOLUTELY INSANE!!! I have been to ","useful":2,"cool":1},"OWyvvM4wZCv95WhhDWeUhQ":{"text":"I needed a coffee boost and stopping at Addiction was the best decision I made today. I or","useful":2,"cool":1},"z_f505SaLs4eGifsA9MyxQ":{"text":"The service was friendly and quick. The coffee even better, if possible. I had an iced ver","useful":1,"cool":1},"c1-3OWT7O0L7DfI0puyh5Q":{"text":"Charming little coffee shop with a modern edge. The service was excellent. Coffee was grea","useful":0,"cool":0},"TRvWSaJh0Ei_aRNqVv6Pmg":{"text":"Sooooo good. The employees are very knowledgeable about the menu. Miss Tracy's Addiction w","useful":0,"cool":0},"fXjVaSc78gGLsdCWL1KPdg":{"text":"VISITORS:\nTHIS IS THE COFFEE SHOP YOU ARE LOOKING FOR!\nWhenever I travel to a new city I u","useful":8,"cool":4},"Uod4_3QR7T4C3yTJkjlewg":{"text":"Spicy shrimp and grits, delicious spicy coffee, and friendly staff. Great breakfast. Came ","useful":0,"cool":0},"6wM0Box74XGaF0uT_NvyJA":{"text":"What a weird & amazing joint. Miss Tracy's Addiction melted away my head cold. The decaden","useful":0,"cool":0},"mbtXl9lDeshWPBls8aLprQ":{"text":"Miss Tracy, wherever you are, God bless you. Miss Tracy's Addiction is the best coffee I'v","useful":2,"cool":2},"hNJyaU1mv9gYjhfsXTXzAg":{"text":"Love the decor of this place. Wooden chairs and wooden tables (literally look like slabs o","useful":1,"cool":0},"HGTGly0lECe0XvSR-yTI8A":{"text":"We came in for Tales of the Cocktail and as a first time visitor to the city, I have to se","useful":2,"cool":2},"FoyFv41W1OitkqfnAfPXfw":{"text":"Amazing customer service!!!! We walked here on our last day in NoLa and was hoping to try ","useful":2,"cool":1},"g09ka0EqfzH6UOtdhOAdJQ":{"text":"Fiiiiiiiinally got a chance to go to Addiction! I love coffee and this has been bookmarked","useful":1,"cool":0},"1sFxMJ1BfYWu36L2d1Ld9A":{"text":"CLOSING UP & MOVING TO CLAIBORNE AVE\nReally sad walking by stripped down Addiction today. ","useful":6,"cool":4},"LEjd4Y4nZ8wczlUdg41w5w":{"text":"I just heard a rumor that they may be moving... :(  \n\nDuring our New Orleans visit, I abso","useful":11,"cool":11},"53FauhHTxVmBrhbjxyOAAw":{"text":"Miss Tracy's addiction has me addicted! For a 5 day trip, I came here 3 times! And it's no","useful":1,"cool":1},"7ZxCBYGppS4vHh6RViTdiw":{"text":"Best coffee in town! Very cool vibes, beautiful backyard space, and gorgeous unique interi","useful":0,"cool":0},"zeX6OLDGKIC0sUELQFHfZA":{"text":"After finding out that this place recently reopened, I had to check it out! I saw the over","useful":18,"cool":11},"A7PlNUa9Zv0Fk9tQV4Q8gg":{"text":"The Addiction is a lovely and eclectic coffee shop! Their prices are no more than you migh","useful":3,"cool":2},"i0asKcwXo_KTUr9c0Ax3Dw":{"text":"What a wonderful place. Brandi and the crew here are super duper friendly and welcoming. T","useful":0,"cool":0},"y08F7d5NhLgfcbnxgnSsAA":{"text":"R A M S E Y made our morning during our stay here in New Orleans. This centrally located c","useful":0,"cool":0},"U8wBVhsYV9qZPF_vABWHcQ":{"text":"Awesome coffee and the service was wonderful. We were here during Christmas and they were ","useful":2,"cool":2},"33zZfbBmTAFPrhK5ws6K0w":{"text":"JUST GET MISS TRACY's ADDICTION!! \n\nI hemmed and hawed and ordered something else. Paprika","useful":2,"cool":1},"GvjHzGZzidB2PJGVH30EQQ":{"text":"3 words... Miss Tracy's Addiction. I died and went to coffee heaven for that moment. I've ","useful":2,"cool":2},"DW9H6LqUIs10ZGHD0a6IaA":{"text":"Uh, hours say 8am-3pm. They were locked up tight at 9am. Called and emailed to get updated","useful":1,"cool":0},"LIxUQCZjjc07zdxXYRz9Pw":{"text":"The best coffee in NOLA! A friend suggested this place as she got her caffeine fix with th","useful":7,"cool":6},"jDfK-5UwDvfCgOUANDQlTw":{"text":"This place is fantastic, it's like walking into someone's house. Get the Ms Tracy's addict","useful":0,"cool":0},"CPreucvU8IT7TSXLgUcdoA":{"text":"Expansive coffee shop, plenty of seating. Expansive, friendly employees. The kind of comfo","useful":0,"cool":1},"Aq1LPyAkyrW3GnD0yg4jzQ":{"text":"During my short visit to New Orleans, I was desparate to find a place that would have bett","useful":2,"cool":2},"GzjPXr-awpOZW_UZvMz9Ug":{"text":"Friendly, welcoming, & southern hospitality... I love this place already! I came for the c","useful":4,"cool":4},"gizthW-9NPYiEpIp1rMTJg":{"text":"The best coffee shop in NOLA! We had Miss Tracy's Addiction, two shots of espresso with ca","useful":1,"cool":1},"8pkY3pTY687dwG43O3-JgQ":{"text":"Under normal circumstances I would avoid anything that would become an \"Addiction\" especia","useful":4,"cool":2},"fkPF33yRA6TdQapHOaQSQA":{"text":"Great spot with friendly employees and owner. Greeted me with a bright smile and gave grea","useful":2,"cool":2},"9iQV2wnp0RB2AgPH06VahA":{"text":"So I'm late to the party...but I finally made it! First drove by the original location in ","useful":2,"cool":2},"zRDlr_oQsdOQwo0Hw0QZfQ":{"text":"I suspect this place has potential and I will adjust my review after another visit. I orde","useful":0,"cool":0},"YOsDMRsWU3tLn2xVSnw1aQ":{"text":"This place is so cozy and warm. The barista was very friendly and enjoyable to chat with w","useful":0,"cool":0},"7qAGLrXj467yhgtZAZuKJw":{"text":"I had a uniquely NOLA drink here an iced latte concoction that the barista made with care.","useful":1,"cool":1},"bdUF0MOOhSJwmchxosqRvg":{"text":"Such a great coffee spot in this spot of town. Don't let the front entry fool you, this sh","useful":17,"cool":9},"lrm_NtGJGBg-Q9Ls60y0FQ":{"text":"Love the interior decor at the New Orleans location Miss Tracy! Cant wait til I visit your","useful":0,"cool":1},"S3wq2Q5Nz_dPU0dZRzraPg":{"text":"In New Orleans for the first time & found this coffee shop. I ordered the Miss Tracy's Add","useful":1,"cool":1},"XZKgPuJLa_GKymD48M-xmA":{"text":"ok this is what the community need,postive business in the neighborhood with vreat service","useful":1,"cool":1},"HhFzgpAJWRGdgOv00x05vw":{"text":"Found Addiction via Yelp. Worth the walk wherever you are coming from. We got a latte and ","useful":2,"cool":2},"FyiTjcNVdhEYhEqU-BHiyg":{"text":"This is the best coffee I've ever had, and I've had some COFFEE. Addiction is the perfect ","useful":1,"cool":1},"Y-ZqORt8W9uMLKB30ply_A":{"text":"Cute little place! Has an artsy vibe and the workers are awesome  Not the best to do homew","useful":0,"cool":1},"Om2OwOo-z3ynF-wROny08w":{"text":"Went to get coffee before leaving New Orleans. The coffee was so delicious and the service","useful":0,"cool":0},"Fk_SZ3nRkqPdYGDVpj3Z4A":{"text":"Delicious coffee, super cool atmosphere, and Tracy is awesome. Make an effort to go there ","useful":0,"cool":0},"8uS8eZKklHeGxwUwNHRtVg":{"text":"Great atmosphere for studying! Great coffee and also a good selection of teas! Also fantas","useful":0,"cool":0},"y6XWyNoj69G3Jerfg1Zspg":{"text":"Love. At. First. Sight. Will you just look at the photos of this adorable place? In fact I","useful":15,"cool":11},"ldnyUhUPbBUlp3Viqac48w":{"text":"I don't impress easily and this place totally impressed me!!! Excellent service and a fun ","useful":3,"cool":3},"oCqvHu7QNo5su91YnMWJjg":{"text":"I happened upon this coffee shop today while wandering through the Quarter.  What a refres","useful":0,"cool":0},"5YVLrhaKeo0jD5-PbPxRWw":{"text":"Yelp definitely has it right when they say get Miss Tracy's Addiction.  I wasn't sure how ","useful":5,"cool":4},"E3DtS7PJZSPRMWuK12P3Ig":{"text":"After seeing the amount of reviews and the 4.5 star review I was surprised to see it way o","useful":1,"cool":1},"tgGs5Znyg56Cpg0F86m4Tw":{"text":"We were up early and ready to eat. We stayed a little off the beaten path so I was looking","useful":0,"cool":2},"tcpwUmoIRi_dtFatWURQwQ":{"text":"Close proximity to Hyatt French Quarter, which was super convenient for me.\nI had a good N","useful":3,"cool":2},"Ra-8nTHa6qrqpwmbNtePRg":{"text":"In New Orleans for the first time & found this coffee shop. I ordered the Miss Tracy's Add","useful":1,"cool":2},"uQbccReutOo5R6rmy7TnuA":{"text":"I cant say enough great things about this place!!! My friends and I came in one evening de","useful":4,"cool":5},"twqb-OffKDFMQsNNTbMMyg":{"text":"Inconspicuous from the outside, but much more interesting inside.  It's not my kind of cof","useful":5,"cool":2},"DmAIJh48p84utwNChz0oNQ":{"text":"We wandered into this quaint little coffee shop after reading some good reviews about it. ","useful":0,"cool":0},"fY27bOzN5R4k8kYm31TzBw":{"text":"I loved this small coffee shop with so much character and away from Bourbon in the FQ. Lov","useful":3,"cool":3}}