{"9pF_tmjPPRhbnAa5PJ05-w":{"text":"First time visiting and totally enjoyed the experience.  Come with an open stomach because","useful":0,"cool":0},"u_TjGKFKbjp_KKZVPUhGHQ":{"text":"Although 5 stars is justified it's too soon. Will need a few return trips for that last st","useful":1,"cool":0},"uDJ7Dh36NsSVraExbS1hgA":{"text":"EXCELLENT food and service. I made reservations ahead of time, when I got there I was sat ","useful":0,"cool":0},"cBxhjRheT8fKpPPMOodMDw":{"text":"Jason & Drew ROCK!!!! \nWent to \"Fogo\" with my entire Denka Plant Shift: Total of 16 people","useful":0,"cool":0},"8qH3VRCzcp5zMu-vgLflFQ":{"text":"Enjoyed some wonderful Brazilian Bites at Happy Hour. Shredded short rib sliders and spicy","useful":0,"cool":0},"X6Qcx0MRHyyA2TlyPjcCZw":{"text":"Consider this place if the carnivore in you needs to be heard and your budget is ~$70.00 p","useful":0,"cool":0},"D6rje0mihWuIP_T9QfVnjA":{"text":"Although 5 stars is justified it's too soon. Will need a few return trips for that last st","useful":1,"cool":1},"dsUSGmbLydraCjsMzkF32A":{"text":"Went for my boyfriend's 40th birthday, and the food and service were excellent!  We had no","useful":0,"cool":0},"2cxaigXW1zHCBA0GB4vChA":{"text":"Everything you can possibly want from delicious potato salad to mouth watering sirloin and","useful":0,"cool":0},"kYQF0VnqwqsGBMDsmmSLxw":{"text":"This was our first time...service and the food was outstanding.  All the different types o","useful":0,"cool":0},"k2tYbkOUWSDoOESk0cYw4Q":{"text":"Costly Food Not So Impressive \n\nHere's a place that serves a variety of salad and Brazilia","useful":0,"cool":0},"lx_PpUsqywm53udzSVI1hQ":{"text":"We were starving when we sat down to eat at FDC, so I think they had an early advantage. E","useful":0,"cool":0},"xKSpVZ1HF3AowIM7WiBuSg":{"text":"We went today for five friends July birthdays. The service was incredible, we were never o","useful":0,"cool":0},"OdSlnVWldjol5bgaWVhFlw":{"text":"The best: candied black pepper BACON!\nThe good: the wine list has a lot of choices at reas","useful":0,"cool":0},"lPB-L3S9yPzcdg3CR-8Oew":{"text":"Carlos and the staff were AMAZING! The service was impeccable and everyone was so nice and","useful":1,"cool":0},"OkKRa8T3iO2td9lnwJwmdw":{"text":"My boyfriend and I went on Friday night and were seated in less than 5 mins. The salad bar","useful":2,"cool":2},"bQEQQ6TNECmR_zLke6g3Vg":{"text":"This is late, but I came here twice so far. One time for dinner in March and one time for ","useful":2,"cool":1},"06qk5BiwknLrFoGIZbYZRQ":{"text":"Very good, go hungry!! Salad bar was not an ordinary one, lots of unique items!! The MEAT ","useful":0,"cool":0},"pvv1tQxvaIgDfRqqZXNkIQ":{"text":"We went for our anniversary, and the experience wasn't worth it at all. The market bar had","useful":0,"cool":0},"fdyudIp6uOUrHBl5SU1eOw":{"text":"Of course the food was incredible but the service was what truly impressed me. From the se","useful":0,"cool":0},"w-9doevzhUur7jwwBxG5-Q":{"text":"This was a great place to go and celebrate my sons birthday. The food was all very good.  ","useful":0,"cool":0},"Fu8OtpKLLSwUVuejF32fFA":{"text":"I will never go back to the disaster that is Fogo De Chao. I made reservations on Feb 15th","useful":10,"cool":0},"x-A_dwOY1ZbW4nec-ekVBw":{"text":"If you like steak this is the place for you. They are quick to get you in and it is imposs","useful":0,"cool":0},"jbKy5fifs9zIYnRPgn_lWg":{"text":"Came down for Mardi Gras with a few fellas, food was great, service was sub-par so that de","useful":0,"cool":0},"qF7Ryxfi2Jn_8KfzQi65MQ":{"text":"Food was good, but wish the salad bar had more variety. They had butternut squash soup( I'","useful":0,"cool":0},"q5dU5TgyEUBMXQg_WRCD8w":{"text":"Awesome bar with great service! Jason is an awesome bartender and really connects with his","useful":0,"cool":0},"YaRlWh6ERLb2zHC5fPavxA":{"text":"Fogo De Chao should be renamed to Fogo De Cow.\n\nIt's a given that you should come here rea","useful":4,"cool":2},"ffs3C1MIa0luLKFLaxjbjQ":{"text":"This place is epic!  Incredible to think I've waited this long to try it.  Every type of m","useful":1,"cool":1},"un_1WG9YSVrpey4Rv_OKWw":{"text":"My wife and I went Dec 2nd To celebrate her birthday. The service was not good at all.  We","useful":0,"cool":0},"3rifQhq2WCQ6z2aKT_h0fA":{"text":"Excellent! The service and setting were wonderful. However, just to add to the experience ","useful":5,"cool":3},"d1q1qO4Y1M5Pz82Lmr0kHA":{"text":"We booked a table for for on Open Table and we're seated right away. Hubby and I always en","useful":3,"cool":2},"Fx3BBFetNuOaG-6pUkYCuw":{"text":"I've been to a few Brazilian steak houses between the U.S. and Canada, but Fogo is hands d","useful":1,"cool":1},"zholm7PIGmh7apQUDoWg_A":{"text":"Stay away, stay FAR away!  We hail from Chicago and comparatively speaking, this restauran","useful":8,"cool":0},"Oys2Khqv4_r1KeqE-0ru5g":{"text":"Left me flat. Tried it once before and swore I wouldn't return but I did. Decent salad bar","useful":0,"cool":0},"3JoUoRY1EbeEpKAocrnsJA":{"text":"So upset that I had such a bad experience at Fogo de Chao the other day. The restaurant wa","useful":1,"cool":0},"PZRKTmtzKVgC5qx3_AoFqA":{"text":"This time will be the third I dined in the restaurant, but before was in Vegas and now it'","useful":1,"cool":1},"Al7dH8yv4gDOrnb2kkai4A":{"text":"We received a free lunch or dinner for dining on Valentines Day so this was our second vis","useful":0,"cool":0},"6YVcBjC2mPzCjxeO5MJa3A":{"text":"Péssima experiência!!! Buffet de saladas muito ruim. Garçons despreparados, fazem sempre o","useful":0,"cool":0},"sTRXd13E_pnWfrI3-q74ww":{"text":"Oh Fogo! You are the only chain restaurant that New Orleaneans will come to love. New Orle","useful":2,"cool":1},"Eb_JIeaCvwmDBGZ-eKogTw":{"text":"The first time I went here I was blown away by the whole idea of non-stop meat. Well this ","useful":0,"cool":0},"3zru2RPFXOV97N6GEMvHYw":{"text":"I was at New Orleans for a conference and made a couple of new friends and we all went the","useful":3,"cool":0},"orOlt2oJFj8tczBfCrOxPA":{"text":"Decided to try this place for lunch in lieu of driving to Texas de Brazil in Baton Rouge. ","useful":1,"cool":0},"fH7gxR1D2MAkeO6dbCqKTw":{"text":"The restaurant is very clean and attractive. The salad  bar was excellent. The service was","useful":0,"cool":0},"blXCvrx4mEBSK1rhhB8nLw":{"text":"Food and a service was outstanding!  I took my 13 year old son who loved everything item s","useful":0,"cool":0},"9xXSVm-7vQRS84AsKWQP7Q":{"text":"Attentive servers, the salad bar had great variety and everything was super fresh, and all","useful":0,"cool":0},"rVTCtsnpsdfznciwZ4bILQ":{"text":"Some buddies and I were pumped about Fogo coming to the Big Easy.  So we booked a table fo","useful":6,"cool":0},"3ZUEqJHMleGiVU_wdniDxQ":{"text":"After learning my flight to Boston was cancelled until the next morning and that every hot","useful":0,"cool":0},"sbAHT15VOCus_-fMXdh_8g":{"text":"My friends took me here for my birthday dinner. Everyone was extremely friendly and welcom","useful":0,"cool":0},"bmlV9Ee9M5eHjcpexq11VQ":{"text":"We go to fogo in Houston, Texas frequently. On a trip to New Orleans, we decided to go to ","useful":1,"cool":0},"zoe17Tf7wECjSaGsZdYXHA":{"text":"4 of us were in town for a convention and wanted some good meat like some steaks. The usua","useful":0,"cool":0},"P1ScWjhcEX06l852UtM8bA":{"text":"I do not eat a lot of  red meat but sometimes I crave a great steak (has to be a good one)","useful":0,"cool":0},"RSN1yf2IoQUf6plLCGAQSA":{"text":"Date night with the boyfriend. Chose this place mostly because he had never been and it ha","useful":0,"cool":0},"t-Bp-uOsJpw2-g7ID3aNAw":{"text":"Sucks! Used to be better. Full of bureaucracy just to get a table, when the restaurant is ","useful":1,"cool":0},"a3cBO0nIycK_X3BoYWcdAA":{"text":"If you are a carnivore lover, this is a must to visit and experience!\n\nPros: Valet Parking","useful":1,"cool":0},"4yPYhDD9rsK6hyTcZYG2DA":{"text":"I absolutely LOVED my first experience here! The staff was kind, attentive and, they made ","useful":0,"cool":0},"ZI0zD5GPqQUtJTEB-Ez8Uw":{"text":"Went to this restaurant last night and while the food was good it was certainly not what I","useful":1,"cool":1},"AkypLYEL8neUFRQxraHlSw":{"text":"Great place! Great Food! Jason the Bar Tender is Great! Service is Great! But don't leave ","useful":1,"cool":0},"MfrXvMUqbfW9MRnaKW9saQ":{"text":"Amazing service. The food was delicious and Matt has the best cuts. From the very beginnin","useful":0,"cool":0},"P5j7KsLA_xlZSNB2Xnc1CQ":{"text":"To be avoided for breakfast at all costs - beyond bland/dry eggs, potatoes etc.  Service w","useful":0,"cool":0},"hRCmXx991dmZnq8IXQh6zQ":{"text":"A friend of mine and I stopped for a drink at the bar to wait for our ride. We ended up st","useful":0,"cool":0},"2wpSCZ1OX45b3AkOiVVxPQ":{"text":"Very disappointing.  A very poor meat selection which was surprising as I have been to Fog","useful":1,"cool":0},"IsumB9Q47GvkbSJPb3gc0g":{"text":"Very disappointed. Service was spotty at best. Took three requests to 3 different servers ","useful":0,"cool":0},"Gv1Z15gl-BRtkBCvxKxong":{"text":"Trying this place is a must, but bring your appetite! You can't go wrong with whatever you","useful":0,"cool":0},"wwnj7L902ihdO3ZFH4yqGg":{"text":"The food was delicious.  The servers were quick.  Its a bit pricey BUT you can stay until ","useful":1,"cool":1},"Gu5zIlA1iXhObJbVv3V9rw":{"text":"Breakfast buffet was impressive.  They had all the usual stuff done well.\nThen we searched","useful":0,"cool":0},"kH1DhORl4tnZ5hWfgNDycw":{"text":"It's a pretty cool experience! Love how you can try so many different cuts of beef,pork,ch","useful":2,"cool":0},"bzsfJyvOn4nuecr9Z9R_sA":{"text":"Honestly I was hesitant to try this place out bc of the terrible reviews from people I kno","useful":0,"cool":0},"nY243nPUSpdzrUGzXEovWw":{"text":"I like it, the wait staff is very attentive. There's an amazing selection of meat to try. ","useful":0,"cool":0},"A-AV4pnR653DpiSKPJ9-jg":{"text":"So my brother in law came into town today and while we are strolling canal street he insis","useful":0,"cool":0},"O1pTI2R6-JiJG9DUQtqRXA":{"text":"Excellent service food was A1. Staff messed up the bill, but the service and Hospitality s","useful":0,"cool":0},"MvbA1_KSuzZw5CJp0wa3gg":{"text":"STAY AWAY FROM THE \"BRUNCH\"!!  I don't know what was \"Brazilian\" about it - maybe the rude","useful":0,"cool":0},"a5fghVppN40FJVtbNjFgBg":{"text":"The restaurant is very clean and attractive. The salad  bar was excellent. The service was","useful":0,"cool":0},"QTwCi4b0Kmo5hurbb4jPEw":{"text":"Attending a night of the soft opening on 1/6/16 at the New Orleans location, The service w","useful":3,"cool":0},"sjT0F-eXviZwyk7Km6FIeg":{"text":"OMG  absolutely love the ribeye and the  bacon wrapped filet. And the complementary desser","useful":1,"cool":1},"d44EsGo1ripHm2C63AcjBA":{"text":"Awesome place! We have dined at several locations around the country, and we are excited t","useful":0,"cool":0},"oBeY2LEELQTHWKr9vEnx2A":{"text":"Went in for some cocktails and Jason was our bartender. He did a fantastic job and was so ","useful":0,"cool":0},"E9cau2BlTupv6E0FoqBzJQ":{"text":"Went there today for the New Orleans coolinary experience and the restaurant does a swap a","useful":0,"cool":0},"F9MXdZF8g87Jq6kRSj5pWg":{"text":"Me and my 2 brothers came to dine here about a week ago and we LOVED it!.. The selections ","useful":0,"cool":0},"qc7FcEC5gvgd6t3jQGOZhg":{"text":"My lovely daughter took me here for lunch yesterday. It was a very enjoyable experience. I","useful":0,"cool":0},"loJNIYK9iXDIV1L8lhvPYg":{"text":"I've been to Texas de Brazil a few times and love the experiences I've had there. I give t","useful":1,"cool":0},"EnZcj4Llb8jat2ipc2z-5w":{"text":"The worst service ever.  We were barely served any of the meats in the brochure.  We could","useful":0,"cool":0},"jA8_hU0Rnh9HSxN4txHbtw":{"text":"I wanted so desperately to like this place as much as I love Texas De Brazil, but that jus","useful":1,"cool":0},"meifRH9BsyMsqLTHz1TsHA":{"text":"Best service ever.   I could request a meat from one server and he would immediately go an","useful":0,"cool":0},"n6yGvm_R2crVvBbGynFEJg":{"text":"Ron was one of our servers today and he was simply fantastic, wen you go to FAGO THEY ALL ","useful":0,"cool":0},"KvtJ1H-k91Zo99ZAJSPoyA":{"text":"The first time we were truly impressed by a Brazilian steak house. Great valet parking wor","useful":0,"cool":0},"1z331ipKoJWBpeobquLjaw":{"text":"Where do I begin. Initially we had to greet the front desk. After stating our last name an","useful":0,"cool":0},"X86SjJsXr2soW5tsouhQFg":{"text":"If you like Texas de Brazil in Baton Rouge, skip this place. We went thinking it would be ","useful":5,"cool":1},"Z7cdzH52YodTqLHcykoM-w":{"text":"Overrated and over priced.  Customer service needs a lot of improvement.   Wouldn't recomm","useful":2,"cool":0},"Ocm3hzmw7THxzcRaidDxdQ":{"text":"Ok, this is a chain. Now that everyone in New Orleans has collectively gasped, it's a GOOD","useful":0,"cool":0},"spdt939XVCI41nKAQWh3rg":{"text":"I have never been to a Brazilian steak house before. The experience was wonderful and the ","useful":0,"cool":1},"daGjpZ2kI_jQsz9mtFNugA":{"text":"Came here after a less than appetizing experience at Jimmy J's. Fogo never disappoints. \n\n","useful":0,"cool":1},"3svrnTGo5f4gZh837gPzJQ":{"text":"Awesome food and service!  Loved our waiter!!!  How can anyone who loves meat not like thi","useful":0,"cool":0},"xxOUkaiIfQu3fV9KMQJFHQ":{"text":"I have to say I'm Very happy they opened this restaurant in New Orleans! \nOn every visit, ","useful":0,"cool":0},"GMCjP9LTkeB8az54OmJVBQ":{"text":"Let just start with how I never ever write a review about anything. This was definitely so","useful":0,"cool":0},"TxmQIdzJlAQPS9Z62dAsvw":{"text":"I used to be a fan of Brazilian steakhouses, but they are slowly fallen no out of favor wi","useful":0,"cool":0},"oX0R3l8U_aj5CY9jW_0AYw":{"text":"Happened upon this place for some appetizers and drinks, ended up cancelling my dinner pla","useful":0,"cool":0},"8pPO80KmZV8QLrKd3l8gtQ":{"text":"This was our first visit to Fogo De Chao in New Orleans.  Obviously we had countless choic","useful":0,"cool":0},"1x5W_hWTo481G3UWylrDig":{"text":"Bought dessert and some drinks. It was great. Totally would've done the whole steak dinner","useful":0,"cool":0},"b7iKi7Vgi4AtL8A8fcWfSA":{"text":"Fogo de Chão is a must experience or any Brazilian churrascaria for that matter. This was ","useful":5,"cool":3},"c9cq5AVwOkzp-0JrpajvzA":{"text":"Just okay. The \"salad bar\" was small but had good, fresh items. The meats that we were ser","useful":4,"cool":0},"tbkL0YKEguqFKwLggLYBCw":{"text":"THIS is an experience.  I had a great time.\nwe drank lots of wine, we grazed at the stella","useful":1,"cool":0},"zh7qYOs8peCRyjmcLDCzdw":{"text":"We came for Sunday brunch. Our waitress, Jennifer, was terrific. Excellent service and ver","useful":0,"cool":0},"Ip6CW0yOjzIB2OlgMoKSfw":{"text":"An amazing dining experience at grand opening.... celebrating my brother's birthday. I hav","useful":0,"cool":0},"ExNK2ckKN6lLE8MAap-Ufw":{"text":"The ambience at this restaurant is phenomenal. The food was superb and the staff was very ","useful":0,"cool":0},"aT9j_O5t7gZEdW6I0MYtwQ":{"text":"My husband I, had the pleasure of celebrating our 13th Anniversary at the New Orleans rest","useful":0,"cool":0},"bWD9gIqdIe5gODmDj73Sqg":{"text":"Came in for dinner, was excited to try it. We're from Charlotte, NC and have a similar res","useful":0,"cool":0},"lVyQJq7eTF0jdXR_Or6HKw":{"text":"I have been to multiple Fogo de Chao locations for the past ten years (DC, Baltimore, Chic","useful":1,"cool":0},"kcj5kpnVE7s_mrqnlYn5Dg":{"text":"While I had been to similar restaurants, I'd never been to this one (nor any other Fogos).","useful":0,"cool":1},"MdLl0rqv9Ocdj017eaEnpA":{"text":"Food was pretty good and came quickly.  But once the meats stopped it took awhile for the ","useful":0,"cool":0},"qb9Gs3_VjfdAbI0iLrs4qw":{"text":"We reserved a star for next time. This was our first time and it was great so perhaps just","useful":2,"cool":0},"p_zFyloYJs7kXUQlDrUOKw":{"text":"My experience here at Fogo de Chao thus far has gone only as far as my experience sitting ","useful":0,"cool":0},"Gb-9ylVxWQurUdhMYkH7tg":{"text":"The service was excellent and the food was great. I was so full I could hardly walk when I","useful":0,"cool":0},"2bQYhiELojXtAp5oVT8WfQ":{"text":"Thoroughly enjoyed my experience here as I usually do at fogo. My husband and I ate here t","useful":1,"cool":0},"04ks9etLMoWGsKusu1rQpg":{"text":"Food was amazing! The meat selection and quality was phenomenal. Must try and the service ","useful":0,"cool":0},"6voyt0TkUsVRi07xc2Shqw":{"text":"Thank you Fogo De Chao for an awesome experience! We enjoyed a wide variety of delicious m","useful":0,"cool":0},"tRxYBthpm44Hgp5PYVWPZA":{"text":"Wonderful service. The food was great. My husband loved the meat. He was so happy we went.","useful":0,"cool":0},"inxhBF1bWg2WZcCyNjhiWA":{"text":"I have been to a Fogo de Chao in another city and once I saw that there was one right by t","useful":0,"cool":0},"u8Kaw5NGJA1VXUZotyiYsA":{"text":"I came in for lunch alone while traveling for business and the service was amazing. The fo","useful":0,"cool":0},"ZZKqesTK-rVzAngOSu3t8Q":{"text":"I've been to other Fogo's and also remember that they had a location in New Orleans pre-Ka","useful":0,"cool":0},"clXR8QGVmBlmaedsk9Vnmw":{"text":"So we went back with our BoGo. I will say this, the service was outstanding. There was a l","useful":2,"cool":0},"CsEvTWKAqqVjLygK4x9buw":{"text":"I definitely think this is a place you can try once in your lifetime but after that - it's","useful":1,"cool":0},"ZqsIgf1Euen7KgFPMz8W-A":{"text":"I had a reservation last night at 9:30 for my for my anniversary with my boyfriend, it was","useful":0,"cool":0},"47HkPD6nWDzBifcq9xGogg":{"text":"We went to the bar at Fogo de Chão before we left New Orleans.\nThe bartender, Jason, was s","useful":0,"cool":0},"Rt-YiGJhSWl43VxUfpEokw":{"text":"Went to dinner with fiance and dad. I was a little disappointed that the salad bar was so ","useful":0,"cool":0},"-Gd45ZF0_KaiE3XMxwWoKw":{"text":"The service & the food was flawless. I didn't eat all day & showed up for dinner to cause ","useful":0,"cool":0},"B8LubSSm9HpwrKttw2aInQ":{"text":"I CANNOT speak highly enough about this restaurant. The staff is so wonderful! We've chatt","useful":0,"cool":1},"6nqprbnYbdkVj4XtHV-DXA":{"text":"One of my top three choices of steakhouses! The steaks at always cooks to your liking. The","useful":0,"cool":0},"uNJwaLSsxOtYhITN_yWnmQ":{"text":"It was my first time at this brand of Brazilian Steakhouses. i have been to others in Texa","useful":3,"cool":1},"OlcG-F0XWomqP4_7DHrKcw":{"text":"There are not enough words to describe how great the food and service are at this restaura","useful":0,"cool":0},"rhRuLTwVnX5Heje2GiX4cg":{"text":"Food as always is excellent and more than enough. No whining about  food amounts here. It'","useful":0,"cool":0},"rxQfeNQ-aGvdmtKEuN4zdg":{"text":"Bland food, bad service, overpriced sugary cocktails. Beautiful location. Id rather pay 50","useful":0,"cool":0},"duaTEGUwWXAIwbfLR7vIKg":{"text":"JASON THE BARTENDER IS AWESOME!!! He made a Strawberry Caipirinha that gave me life!! Perf","useful":0,"cool":0},"Z22pLW0Nu5V05JLM7nmJ4w":{"text":"We have been to many Fogo de Chao's all over the country.  The service as well as requesti","useful":0,"cool":0},"0PljUAMSMGPibuEvlUyhLw":{"text":"Meaty meats and all you can eat! Don't know if I can handle another round but maybe one da","useful":1,"cool":0},"eetJjsVMGeexzIIk4notJg":{"text":"I was on a solo business trip and was looking for a place I could get a small meal and a d","useful":0,"cool":0},"PwUwz7ZO-asqN8B_Wpka2A":{"text":"I was very disappointed with my recent experience at Fogo.  The food was great but the ser","useful":0,"cool":0},"p7ZLUBi5pyttLexlYDZbRA":{"text":"We got a table right away, all the waiters and waitresses were really nice. The meats were","useful":0,"cool":0},"WHOKPfcta98zJH3ODxVeCw":{"text":"I tried out FdC for the first time for Easter dinner.\nWhen we walked in, the two hostesses","useful":0,"cool":0},"b_D-H2sGh7M_VBH8pdjKbA":{"text":"Yes, FOGO is finally in New Orleans!  I was so excited when I saw it i could not stand mys","useful":3,"cool":1},"SvklGlpR1WQ7pSMICwyvSA":{"text":"I've been to Brazilian places like this before but less sophisticated. This place was clas","useful":0,"cool":0},"QAkn_RKqg0P10i3I-PA17A":{"text":"I guess they were paying attention to all of the previous reviews because our food was off","useful":1,"cool":0},"-h3UWNcqTiAKsE9x3FsvVQ":{"text":"The hostess was very short with answering my question. Which was whether there was a break","useful":1,"cool":0},"viMims4t5vesti1OeYXbMg":{"text":"If you are in New Orleans, do yourself a favor and stop by here! From valet parking to ser","useful":1,"cool":0},"Sm3poWAQcaJDKjICnJllYA":{"text":"I absolutely love the bar in this establishment. Our bartender Jason had a drink in mind f","useful":1,"cool":0},"Ilr1VXfbLWClE4DPo9EO4Q":{"text":"We made reservations to see how it went.  We arrived and were both greeted and seated imme","useful":1,"cool":1},"1d47y6qRAq4eFvl44xloSQ":{"text":"This place is just dumb. \n\nMy dad chose to go here for Father's Day. They were running the","useful":2,"cool":0},"0pHWEVmd85UVOPOOVFZ51A":{"text":"My siblings and I had dinner with my Father here on Sunday. He absolutely loves this place","useful":1,"cool":0},"lrmR876rD3LSskfMPDwR8A":{"text":"Great restaurant. Jason and Erika behind the bar were amazing! They worked non stop while ","useful":0,"cool":0},"b33yg8uoXB1WiCg3W5UoYg":{"text":"My experience here was great. I have eaten at Fogo in D.C., Dallas, and Houston, and love ","useful":0,"cool":0},"BGOsHQrT8VW7W4FSWto7Ag":{"text":"I have been to many Brazilian steakhouses, including in Rio, but never to a Fogo de Chao. ","useful":0,"cool":0},"rh4T_uufWjvVmkB6XE3rMw":{"text":"Had dinner here last night.. While the service was good.. The food wasn't.. Salad bar was ","useful":0,"cool":0},"RB5VyxyOnZdZp5ZObO1gpg":{"text":"Just got in to town & was starving! Walked in & was rejected because I did not have a rese","useful":1,"cool":0},"daL5uKBTAnGXB4NOnZxqkg":{"text":"Dinner - omg.... maybe come here after not eating for the whole day!\n\nSO MUCH MEAT! And it","useful":3,"cool":0},"WxzLEFNC_k7OAiGl-8Be4A":{"text":"You must try a Fogo or Brazilian steakhouse once in your life. My life was sorely lacking ","useful":0,"cool":0},"Fu9FUmKiP4Qt9GeLSbjQLg":{"text":"While Fogo de Chao is certainly not unique to New Orleans, it is an amazing dining experie","useful":0,"cool":1},"4TxLYHLRq0DCJjnQDm6NiQ":{"text":"Amazing table service and customer service!  The BEST food we'd had so far in New Orleans!","useful":0,"cool":0},"mJXCfgO9GaRmY8EBMuQcfg":{"text":"Worst Fogo I've ever been to. Meat was undercooked and not properly seasoned. Pork chops l","useful":1,"cool":0},"pGYBHNLmK03C1DgRGErGOA":{"text":"Ok I've been here several times before and had nice experiences this time not so much.  We","useful":2,"cool":0},"hPPBgLeuAHFVKDRJqvGiTg":{"text":"What a different steakhouse experience for New Orleans!  The food was delicious.  The wait","useful":0,"cool":0},"4YiTcVdNdQlSZpn4ZU1_gQ":{"text":"Our waiter Earlie  was absolutely amazing. He went out of his way to make the birthday gir","useful":0,"cool":0},"1RHfH28MRE-_MAWI7R37_g":{"text":"Exquisite dining experience.  Prompt table service, elegant white table cloth service.","useful":1,"cool":1},"OLE0oi4_HDw77Q8t9u8xjQ":{"text":"Delicious.  We were seated by the kitchen and had amazing service. We were there early in ","useful":0,"cool":0},"_YGwl7yHHDL1l-OVBwB0Sw":{"text":"I love fogo de chão, I've been to 6 different locations across the country (and have alway","useful":1,"cool":0},"2FxNSTOKICqEPieDln5opA":{"text":"I've been to Fogo de Chao maybe 30 times, mostly in Dallas but also California. I've been ","useful":0,"cool":0},"HaZewamJNtgRoxq1WUgPSw":{"text":"This place is amazing.   If you have ever had a dream of endless,  amazing,  perfectly coo","useful":0,"cool":0},"z0NV8eWtBqm_5opktFVdAw":{"text":"First time last week while in town on business and really enjoyed. The \"market garden\" buf","useful":0,"cool":1},"7zoRc6V5dQUodo1dkEf4lg":{"text":"Very nice place to eat. Very clean big selection at the bar prices are decent. Food pretty","useful":0,"cool":0},"Jj_JQAddNqWkVT20Uq6WVA":{"text":"Great Service went opening day Jan 8th, Derick our waiter took great care of us. What so g","useful":0,"cool":0},"kSFQo5x0bEsPk2BjA3JpPw":{"text":"Hands down one of the best!!!! We used to drive to BR for Texas De Brazil & the food here ","useful":0,"cool":0},"AxB1IbbHUah7t-QdXcFuUg":{"text":"Visited recently and had a very nice time.  I stopped earlier in the day to ask about rese","useful":0,"cool":0},"1_Poe1Y_orgS_ITh6xCbAQ":{"text":"jason....the magnificent bartender!!  My pineapple old fashion was great!!! The service wa","useful":0,"cool":0},"Mhl-xLAquGAeX_smAQmcpQ":{"text":"Some of the meat was really solid. The filet mignon was delicious, the lamb was alright, t","useful":1,"cool":0},"EHl3_YM91bCdr1-Fbzj3tQ":{"text":"Firstly let me say this, I've been to Fogo's in other cities and had great experiences. I ","useful":1,"cool":0},"JJYYVJJJ5Munx5xm1fC3HQ":{"text":"Terribly disappointing. I have been to this restaurant (in Atlanta) on multiple occasions.","useful":0,"cool":0},"4GnGnnk5Jl2MRoIhJSEM7Q":{"text":"My wife and I were visiting from Chicago and stayed at the JW Marriott. There is a Fogo de","useful":0,"cool":0},"mw0ckdeo6knvfB7kGzfpZQ":{"text":"Overall a good experience . I enjoyed the black beans from the market table as well as the","useful":0,"cool":0},"mTL2aHd4iNelZrjZ8kLzwg":{"text":"I don't like to writhe a review but this place honest its the best place I never been , th","useful":0,"cool":0},"j0x2e0qN-mNI0qy6SBsjpg":{"text":"I've been to many Brazilian steak houses and this one disappointed.  I wanted to like this","useful":1,"cool":0},"_VeczRVBWvsxnFhqRkZLhg":{"text":"We had a fantastic experience!! Awesome wait staff.  Awesome food experience. I would high","useful":0,"cool":0},"xTWokvkCaPZkdx8IeeU7iA":{"text":"I had no clue this was a chain. Anyway, it's a chain that stays honest to it's roots. It i","useful":0,"cool":0},"5tw3Uv9MnCCrP5V-L_LZHw":{"text":"Ate here for a dinner.  Food was very good.  The salad bar is a much smaller with fewer ch","useful":0,"cool":0},"PrAIGUrY9R2lCK73KJCqLw":{"text":"Forget Arby's, Fogo has the meats. We arrived with another couple to try out the new place","useful":0,"cool":0},"f1U-a4JqdekD1RA0O-rrIA":{"text":"We just popped in off the street without a reservation and were seated with only a 2minute","useful":0,"cool":0},"cEp3_iSle1tt1OHCuN9KQg":{"text":"We went there for lunch today and we had a very pleasant experience. The food was amazing ","useful":0,"cool":0},"bnuEjhBvO_aKdOLBoNwDKQ":{"text":"Our first time and it was delicious. The salad bar is prime time, imported cheeses and mea","useful":0,"cool":0},"pZP9YOKVXuMcms8JoodmBA":{"text":"I was in town for business last weekend and absolutely fell in love with a special drink J","useful":0,"cool":0},"YrkGjeFWwP2OrVHA5gykOg":{"text":"We had a wonderful 50th anniversary breakfast here.  What a great assortment of foods and ","useful":0,"cool":0},"_OKk_wH7RUMEUmd4raY8kQ":{"text":"One of the best dining experience ever! the staff was delightful and very attentive, defin","useful":0,"cool":0},"J2Axs6upPB3zVWaiIaM9bg":{"text":"Ok. I thought I'd try this restaurant once again, because I throughly enjoyed it the exper","useful":1,"cool":0},"1NJA1R5udtqbHKj-kljixw":{"text":"It may be on the expensive side to most, but this is definitely a top notch restaurant tha","useful":2,"cool":2},"cWUDF3YELVozp5Au15zgvA":{"text":"My husband, my two children and I frequent this place. Tonight by far has been the WORST o","useful":0,"cool":0},"8rNDEb4Atm-AYRgYVmopmw":{"text":"I only went here because it was close to my hotel. It cost about $50 for meat and salad/ap","useful":0,"cool":0},"PWx6_T9OAb1YljewMQw1fQ":{"text":"This place is the epitome of good food. The enthusiasm of the workers are inspiring. The w","useful":0,"cool":0},"yPrdl_-NAnXhRGjlbCr-_Q":{"text":"I visited Fogo for a second time for lunch and have to tell you that the lunch is a great ","useful":7,"cool":5},"cE65JO3ngKXDZBDTpZ2-mA":{"text":"What can I say-excelent food-excellent service- and absolutely beautiful decor. I took a f","useful":0,"cool":0},"ZOWk2yancMk-3xF2ik2Glw":{"text":"I expected more from them. Heard great things but dining here was not that impressive. Ser","useful":0,"cool":0},"0CKyZEN32CpzBaXURz9b4A":{"text":"fantastic, the best restuarant ever, my husband and i was in heaven, considering he's a me","useful":0,"cool":0},"83L-HQ4QV37y9hYZsuoXMw":{"text":"Good food but experienced terrible service from what I hope was a new, inexperienced waite","useful":0,"cool":0},"ti_2Jbb9ard9EQCGjfQ2Ig":{"text":"Thank you Fogo De Chao for an amazing Birthday evening for my amazing Mom!  Everyone from ","useful":23,"cool":17},"3HMSoaJJibAhqFGCareAFA":{"text":"If I could give zero stars for this restaurant, I would do it. Two words: FOOD POISONING. ","useful":0,"cool":0},"kCYUW6fBtZUrkFs_Ryjm7A":{"text":"We wnt at 11:45  internet said open at 11 and no tables were ready. The plave smelled bad ","useful":0,"cool":0},"-i5u45Q2px--rPncWJyUug":{"text":"This was a wonderful experience. I took my fiancé here for his birthday lunch. We did the ","useful":4,"cool":1},"FH6ejUoLGfiYODNW-o5-Ng":{"text":"It was ok. Salad bar didn't have too much to offer. I gave them 3 stars because they didn'","useful":0,"cool":0},"VYFxoRyPEfyUe0btFOb2iA":{"text":"The food was ok depending on what you were served and by who. Some of the selections were ","useful":1,"cool":0},"zwxDzFOYB_6DPON6QQ1cnA":{"text":"For the price you pay to eat here there are MUCH better steak houses to visit. Food is med","useful":2,"cool":0},"_o_orw0-cq7V3tYU4v21Tw":{"text":"We had a blast here! The food was great as well as the service. So glad we decided to do s","useful":0,"cool":0},"cWGFqNgjjOsVeM5Rbg9tJA":{"text":"All 4 diners in our party had explosive diarrhea less than 2 hours after our meal. We got ","useful":2,"cool":1},"RESwwu8MzEXgNU0ZaaE12w":{"text":"I'd say the best of its kind we've been to. Been a while since we went in NY but was happy","useful":0,"cool":1},"G_sYdIOlCk8sWf5CzutGHA":{"text":"The bartender Jason is amazing. Kept us coming back all weekend. \nHas the best pimms cup i","useful":0,"cool":0},"EzkcVor4pkxFIAvVgL1fCw":{"text":"Jason is the bar tender of the year! He's helped us the past two nights, we've been to a l","useful":0,"cool":0},"bp6Q-ffE7YTgF_W6b5fMpQ":{"text":"I went to this restaurant at the insistence of my hosts, who are New York natives who have","useful":1,"cool":0},"7yvgk-dwqjW7759cj4odCQ":{"text":"Had a visit for lunch to celebrate my 30th birthday this past week. We arrived at 1:40pm a","useful":0,"cool":0},"GmV93jpXtOONrosTBS1PhQ":{"text":"I came in for a caipirinha on Sunday afternoon and Jason, bartender was super friendly and","useful":0,"cool":0},"tn7WopT2BcE0jnVLdXsvDg":{"text":"It's a place to experience once. There is an extremely large amount of food that you have ","useful":0,"cool":0},"bxysUzW0x67Jmq2FMfWu6w":{"text":"Amazing service! Food on par with others in the chain. Come on an empty stomach. My favori","useful":2,"cool":1},"UC5b1k59ruFs7CbinyMCrw":{"text":"No seafood here unless you want the shrimp cocktail but the meats and the market table (sa","useful":0,"cool":0},"kq0dd2dCUX4RlYxL29GxXA":{"text":"Terrible service. Had a reservation for 9:00 PM. It's almost 10:00 and we still aren't sea","useful":0,"cool":0},"3DYCN4doSjTsgO656JpQLA":{"text":"I love fogo de Chao. The food is incredible. My beef with this Fogo is the waiting service","useful":2,"cool":0},"j9UH9Ch58phJa_AGMWvJfg":{"text":"Special thanks to my daughter Lauren, and my adopted additional child,  Kat for giving me ","useful":0,"cool":0},"6zHSvSIi2RoqbzJ3uyEiWA":{"text":"This place is nicely decorated. Open and clean. You can valet at the hotel for $15 and tel","useful":0,"cool":0},"JrOeby5n_JB4lMeGCmmmJA":{"text":"Had to wait 20 minutes for a table and we had reservations. The hostess was a miserable pe","useful":1,"cool":0},"SUDHYdHEyPvXl05JaLVvWQ":{"text":"Awesome food and great hostesses!! Truly a wonderful experience. \nLove it! Can't wait to c","useful":0,"cool":0},"TEnnFqZAvmVOlU9njwoLjw":{"text":"Incredibly disappointed!!!  I have been to Fogo in multiple locations. This is my second v","useful":0,"cool":0},"4_k66w1tSZDi4gvxsd_VdQ":{"text":"Came here to treat my fiancé to a birthday dinner because he loves his meats. It's the fir","useful":0,"cool":0},"aa4l7CsM1mQuAm1n1RWa8w":{"text":"Their food might be good based on the other reviews, but I cannot say likewise. The server","useful":0,"cool":0},"pePWebQGMAvUPJr0hKEg5w":{"text":"Honestly the entire experience was very underwelming. You walk in with zero waiting area, ","useful":0,"cool":0},"pLqZd_HZ9OrZA9x4OXcLTA":{"text":"Every thing is Delicious and we will coming back again .. we went early 11:30 am Reservati","useful":0,"cool":0},"_V3nLnokQud5OvZCmCIlDQ":{"text":"I was definitely expecting more from Fogo de Chao based on my experience at the Fort Worth","useful":4,"cool":0},"tI_3l0nAolwnxucTSAST1A":{"text":"The level of service at this place was ridiculous as they discriminate against race. The w","useful":3,"cool":0},"ECvFkczRKyVMqfiUGkvfIw":{"text":"Everything was over cooked and salty. Not worth the small fortune to come here. Salad bar ","useful":0,"cool":0},"j_HHNVo9i86fLz4tnX5xVQ":{"text":"Always friendly staff and Market Table (salad buffet) is always kept fresh and clean, as i","useful":1,"cool":1},"iX_EPsx0dkQiflo83eSWgw":{"text":"First time at a Fogo.. had heard so much about them. We did the Fogo experience (all you c","useful":0,"cool":0},"ub5_xGNIa9dXpQTVcVs6cw":{"text":"They always seem to under-book the restaurant for reservations. Several times we booked la","useful":2,"cool":3},"2jmBxVIfnK8d9inggaUsMA":{"text":"Wow I had the worse experience ever. First of all salad bar was only half way set, so exci","useful":0,"cool":0},"-xtbvt99YjLnEKSQoOEhbw":{"text":"Oh my God, this is my first review ever and I don't even know where to begin. I went to Ne","useful":0,"cool":0},"rEQC1feHlbcHHX-Uldiutw":{"text":"Overall the evening was wonderful.   The food exceeded our expectations. We saw some of th","useful":3,"cool":2},"6o5CLKYjTjUBmPBWkFz8VQ":{"text":"Great food for the ultimate meat eater! The food was coming so fast. You must try them all","useful":0,"cool":0},"ZxpQuNjaxxJWkckv3szgfQ":{"text":"I decided to come in on an otherwise lazy Sunday, to treat myself for a belated birthday d","useful":1,"cool":1},"Je3n1D7LHLFYXoKgaKLFqg":{"text":"Fogo de Chão Brazilian Steakhouse is really an ultimate flavor of yummy goodness to a youn","useful":1,"cool":2},"jhAPnlPdCHdFzT_1nYV2ZA":{"text":"My wife and I dined here and had the best experience because of our server Bry. Not only w","useful":0,"cool":0},"BSFtDgmdZPZu2CM9wLWKxQ":{"text":"My family and I have visited several Fogo de Chao restaurants across the U.S but I must sa","useful":0,"cool":0},"tQqAExfZWfronAYI_jCZyg":{"text":"My party of 8 was in town for a girlfriend's birthday bash and we decided to have our cele","useful":0,"cool":0},"_0AgJ09e7Sidp2_jinjKwg":{"text":"Service was outstanding thanks to Tommy Nguyen, the server of all our dreams. His wine rec","useful":0,"cool":0},"cJ3yaGlS_ZMmZadOhBqjyA":{"text":"My gf and I came here during our vacation for her 30th birthday with very high expectation","useful":2,"cool":0},"tvMkyz8zJ-LYCJo_cneskg":{"text":"Highly disappointed I had wanted at a Fogo De Chao in DC previously that was excellent thi","useful":0,"cool":0},"VROei88ebURo16tjIpAGpw":{"text":"I went to Fogo with a party of four and sat at the bar. We ordered the beef empanadas, shr","useful":0,"cool":0},"dO2MawqBz2Pyv64pLk0b6Q":{"text":"On our last trip to New Orleans we visited this restaurant. We were seated promptly and we","useful":0,"cool":0},"aNFiC_ChXVthmAs0BxxySA":{"text":"This Fogo de Chão not only has the signature meats but a lot of fun, just learn a few Port","useful":1,"cool":1},"qxXtm3KMEosEvCkmuESOTA":{"text":"Absolutely great service especially the waiters and the management, the food was great and","useful":0,"cool":0},"0JrLitXXbMIdq0j68nlEcA":{"text":"The atmosphere was sufficient. But for the price, the quality of the meat served was medio","useful":0,"cool":0},"4mp5JRZmYIsBnsmGn-LqnQ":{"text":"If you come here you are going to want to be hungry and you are going to want to be a meat","useful":1,"cool":0},"uoiAtvofEbjXcCyZh_0u_A":{"text":"I've been to two places like this before but this was hands down the best one. Normally th","useful":2,"cool":0},"9-B5BGqJGhVHQLzcOA9cVg":{"text":"I came here for my dad's and boyfriend's birthday. I had been to Texas de Brazil before so","useful":3,"cool":0},"UNsZqcMZgA27I2jSOHFKsQ":{"text":"We didn't have a reservation on Thanksgiving day.  The manager was very helpful in getting","useful":0,"cool":0},"PcR7kSTFf8Hg1ttXjT2kSA":{"text":"We went to Fogo a few weeks ago for a celebratory dinner and it was fantastic. If you've b","useful":0,"cool":0},"gpRut55QH9Cp4zPYVhB5Pw":{"text":"For the first of my Birthday dinner outings, It was time to return to Fogo. I arrived earl","useful":0,"cool":0},"_w14E62BYx4PJlOydwZBvQ":{"text":"I went there for a birthday dinner and it was incredible, nice meat, amazing service and o","useful":0,"cool":0},"Nbq2MHbI7ZO6UrM9iYwEyQ":{"text":"I would have left a zero star rating review if that was possible. We had a reservation at ","useful":0,"cool":0},"1SdJv6jJAvo7WZjAk8Pbfg":{"text":"Everything started off great. The waiter took our drink order and the meat started coming ","useful":5,"cool":0},"kVZoVHQ-iNEu3Mt-Kj6KMA":{"text":"Had a great experience here. It's nice that they offer the option to have just chicken fro","useful":0,"cool":0},"VYBixmHA_l3kg8jnlqiPHQ":{"text":"Wonderful service, wonderful staff, and even more absolutely stunning meats. Our server Kr","useful":0,"cool":0},"56UPw5m3jwoE_yyAzflkQQ":{"text":"The Service was spectacular. Between Erika and Josh, we were absolutely showered with grea","useful":0,"cool":0},"M-r9ulhuerDMZU2uep6d3w":{"text":"We used to come here because of the delicious meats and the great service. We come more of","useful":0,"cool":0},"cYWpx8wPGfmXmhbPs_0uOQ":{"text":"Fogo is one of my favorite restaurants. I have been in pretty much every other restaurant ","useful":0,"cool":0},"8-nsLctHXOSKDJ4fJmBO6g":{"text":"The whole experience is wonderful! The service was incredible.  The salad bar is fresh, di","useful":1,"cool":0},"Rb18LveaudcOS4nNJIa5Bg":{"text":"Great food great people! Jordan was awesome was bringing us everything we were requesting ","useful":0,"cool":0},"qmS7QGf2fG4lNFGKfL28Aw":{"text":"Best Brazilian restaurant 5 star. We drove for two hoirs to get to New Orleans and forgot ","useful":0,"cool":0},"7J51eznxfKyJdIm4QLbAkQ":{"text":"I chose Fogo  de Chao for my birthday dinner and was never more disappointed.\nHad to wait ","useful":0,"cool":0},"_349UqVhzFVGIFWiWav5vQ":{"text":"I had a difficult time deciding what the best star rating would be for tonight's experienc","useful":9,"cool":0},"D1XQpqBogWT7SQJvd8UjUg":{"text":"I've been to Brazilian Steakhouses before but always get the takeout box in Boston. This w","useful":4,"cool":0},"I-fLUN9LB7k8zw4Sv4-_sA":{"text":"Amazing experience during my Girls Trip! Food was delicious and the staff was very polite.","useful":0,"cool":0},"JPZKByh56jE_gcoYwsTKGA":{"text":"I have to give a 4 stars to the staff...SO nice and attentive. My first time in a Rodizio ","useful":1,"cool":1},"4n72xkDydxqQHAplKNSRTg":{"text":"Not worth the money. All you can eat. However asking you how would you like the bills befo","useful":0,"cool":0},"QBrvd5ianSBKaAeGODd3yQ":{"text":"We checked into JW Marriott and were starving.  Noticed Fogo de Chao was part of the hotel","useful":0,"cool":0},"K-k9X-q8TRBd1WnswgZEUw":{"text":"What can you say other than the greatest meat experience of your life. Don't waste you tim","useful":0,"cool":0},"W8kZ0Wi_7pbemNBu_uVOgg":{"text":"The soup and salad bar easily could be a meal in itself.  Besides the regular fare, it had","useful":0,"cool":0},"I-FYJ8CmYo4HMng4c7YBEg":{"text":"this is the third fogo location i've been to and i was sad about it ! the salad bar at thi","useful":0,"cool":0},"ota4MqcRPej6koGiF0Rimg":{"text":"My husband and I love eating here because of the variety and unlimited meat you get here! ","useful":0,"cool":0},"TfiqDlC-P6TfEKS3Fk460Q":{"text":"Met with a couple of friends for a celebratory birthday dinner here this past Saturday.  W","useful":0,"cool":0},"ugPKwe7Ib9SH3L3BILtXSw":{"text":"This Fogo de Chao is smaller and more expensive than most others. It is tucked inside the ","useful":0,"cool":0},"j-7nNodFX__-7GO6euo57w":{"text":"Came for Easter dinner and was a little disappointed all the meats really didn't have much","useful":0,"cool":0},"-EQnmh4pI5lEnnTS7sxHiw":{"text":"I've come here for lunch twice recently - got the full lunch once and the salad bar deal o","useful":3,"cool":2},"XKRcxQzBKAdc-rVlaIrQYw":{"text":"Came here to treat my fiancé to a birthday dinner because he loves his meats. It's the fir","useful":0,"cool":1},"28naDv-bRBJjnbBMBCHWow":{"text":"Really good dinner!! In our group, we had 2 salad bars and 2 ultimate experiences. The sal","useful":0,"cool":0},"NrSTAw1Q_RSyaeEBZoFiMQ":{"text":"The food at this establishment is freaking amazing. As are the cocktails, and the sweetest","useful":0,"cool":0},"VfI-gFL69VSbtwzdeMVuRw":{"text":"If you go here go as a large group.  My small table of two was invisible to the servers.  ","useful":0,"cool":0},"8HIKDqV9xXFIdiycnrFuUA":{"text":"Having been to, and enjoyed numerous Brazilian Streak houses across the country, I can hon","useful":0,"cool":0},"Zjv_mwzmXbQ9v32FOyWqww":{"text":"This place is so delicious! I almost got full off of the salad and soup bar. The meat sele","useful":0,"cool":0},"e-PwIbbMqDmBkBzpcqyKRw":{"text":"My husband and I celebrated a special date night together here. He ordered the full experi","useful":1,"cool":0},"bbQPFJP8GwoLCmOgkJo8yQ":{"text":"This is the best Brazilian steak house restaurant I've been to. The food was amazing and t","useful":0,"cool":0},"QhANnGgNxKbeNSchvSEYBg":{"text":"We went last night for Christmas Eve dinner and this was not my first experience dining in","useful":1,"cool":0},"eYWc2DNPVdXr-rO6XFiEFw":{"text":"The food was excellent and service was great! Steven was an excellent team member! Very at","useful":0,"cool":0},"hmgrdhR60Mi0p8I0xfg54g":{"text":"This is a wonderful, yet pricey, steakhouse.  Delicious food-and you do not have to have t","useful":0,"cool":0},"cCWycwsl1HSq2LmeHMRlNw":{"text":"Once again Fogo hits another homerun the food was fantastic the service is just as good Ja","useful":1,"cool":0},"ElpAnXga6ZmpRuY-UTPkQw":{"text":"Destiny was a wonderful waitress amazing service very helpful and always had a smile on he","useful":0,"cool":0},"BTEs8wvXuEaMqmyzpu9hQQ":{"text":"The food and service was fantastic! My server Josh, Elise and Angelette were amazing! The ","useful":0,"cool":0},"ZkAjEwIieWS5K2iySmBGXw":{"text":"My first time at a Fogo de Chão! WOW is an understatement. I was helped by a team of staff","useful":0,"cool":0},"4gqrKqutmXeSeCIHRlyL8A":{"text":"I came here for dinner with my friends. We wanted to check the place out since we were nea","useful":0,"cool":0},"Dksyb56MKLn5dih59ddPUg":{"text":"I was so excited to visit Fogo de Chão. Unfortunately I was very disappointed. The food wa","useful":2,"cool":0},"hV6n_DnJciO2xi-jwIuu_A":{"text":"This is our second time here and it is an amazing experience for anyone who have not been ","useful":0,"cool":0},"KTdbqjmTZ7SPVRdi4h-ewg":{"text":"I had a great time here for Father's Day with my kids. The food and service both were good","useful":0,"cool":0},"4FNBFrMu0ez9MxgXSsdAtw":{"text":"Overall, the food was very flavorful and we enjoyed our daddy- daughter dinner. The salad ","useful":0,"cool":0},"DjymCCFpXo2KufGY7v3sGQ":{"text":"Pretty pricey for a whole lot of average seasoned proteins. Drinks were fine but the salad","useful":0,"cool":0},"pjCLoVuOmhfZD22_CCKiQQ":{"text":"Awful. A bumped up Golden Coral. Rude and incompetent staff offering no menu presentation.","useful":1,"cool":0},"VZDKGyeQwhSGaEgZO-yXEQ":{"text":"We went with friends for dinner and not only ate way more of the delicious food than we sh","useful":0,"cool":0},"RKkWyuEw13-9Del6kMGzeg":{"text":"Challenged by the floods and a lost 9 AM breakfast reservation for our party of 14,  the s","useful":0,"cool":0},"6r39gNxVgN0-u2wqXeYNTQ":{"text":"The full churrasco experience at Fogo de Chão is a meat lovers paradise. Though i did not ","useful":0,"cool":0},"ihUmRSH5kb7u2j_ZEHi_TQ":{"text":"New Orleans never disappoints and neither does FOGO! The food was fantastic, atmosphere an","useful":0,"cool":0},"xKf5USQuV1OMqMpL4PmmgA":{"text":"This restaurant was the only place in town that we can get reservations for 10 people easi","useful":0,"cool":0},"5Y7K5N1sDL5KUxxYOzR17A":{"text":"Lunched there a while back. One of the worst experiences I'v head. There is no menu, only ","useful":2,"cool":1},"qdeC6xazFCEwTpCn6Tn_Gw":{"text":"We got in late night and the restaurant was about to close. They were nice enough to let u","useful":1,"cool":0},"jp5HWHYs3WiVHZ56VUfoyw":{"text":"I've been here a few times but kept holding off on writing a review. I really wanted to li","useful":1,"cool":0},"eu2Dglh2Bhsb2YMA0Ck3Aw":{"text":"Jenny was a great waitress! Awesome conversations and service. Always make a reservation, ","useful":0,"cool":0},"1wVRI3vrjWsreubfhjPulA":{"text":"Had a great dinner with a great gaucho Shaun. He was able to get excellent cuts of meat.","useful":0,"cool":0},"EhUwrV5Fgw4CE6MyqTgN4A":{"text":"This place is great for Sunday brunch especially. The selection at the salad bar as well a","useful":0,"cool":0},"FT9ebiVeqVEtccXMoxaG9g":{"text":"Fogo de Chad was a fun experience for our group of 9.  Every found the service to very goo","useful":0,"cool":0},"-MWECVV9CmsmY3S0frsb0A":{"text":"The food was delicious and the whole staff was amazing. It is a different kinda experience","useful":0,"cool":0},"h566uzUu5lBSTvMQKXBs8Q":{"text":"The taste of the food was good, but service was terrible. Individual servers were pleasant","useful":0,"cool":0},"leDBcX-c6p5Sa3IAwejbgA":{"text":"THE WORST!! If I could give this place a \"0\", I would. All of their meat was either severe","useful":7,"cool":1},"o8qhO7kkZ_VpAv5M0tudOQ":{"text":"Me and my wife celebrate our anniversary there the food was fantastic and the service was ","useful":1,"cool":0},"6n4i_qTQsWOcUCA3qYdckg":{"text":"Great food, great service, and awesome staff. I dined there with a friend visiting in town","useful":0,"cool":0},"vwbErDM0OJeT51fzcaaPqg":{"text":"Came for a private event in the upstairs lounge space was beautiful should totally have a ","useful":2,"cool":2},"FoBByBYZA83w1TMB9w18Qg":{"text":"I've been to nearly every Fogo in the U.S. but this one is not as great.  Their starter/sa","useful":0,"cool":0},"7OWac1R7OY5PMf6niVeEwg":{"text":"Amazing food and the stuff it's very professional , I was traveling from Los Angeles and I","useful":0,"cool":0},"N64YRPATn-pd4NJK12CqZg":{"text":"Alex and Carletta (the on-duty manager and server in that order), started my first NOLA FO","useful":0,"cool":0},"1heICpApZ5HQtVGrSyIudQ":{"text":"We really enjoyed our experience tonight. The pace of the meal was perfect, the music was ","useful":0,"cool":0},"d6FM7-6wl1S91wNvmO0kXA":{"text":"I absolutely loved the food and my server. Demi went far and beyond to make sure my honeym","useful":0,"cool":0},"nBWl8wLdxTsGH-9Is85y5Q":{"text":"This was my first time visiting and it is a very good restaurant. So I will be returning t","useful":0,"cool":0},"BzSZqrpIDrxkmkMxePpA6Q":{"text":"I really like this place. I had a minor issue here due to my own error in ordering. The ma","useful":0,"cool":0},"UDprsr0KVu8J-PxcLfbLvQ":{"text":"We came in tonight to celebrate a birthday and Eddie was a fantastic waiter and made our e","useful":0,"cool":0},"widfCZlZB_lSTK6KLcxRGg":{"text":"The place was nice, a little small. The servers were really confused on what the do. At on","useful":1,"cool":0},"qtYhG5nEH3tMk7Bfm53N1Q":{"text":"Jason at the bar is phenomenal.  It is so hard to find balanced lemon drop martinis.  He d","useful":1,"cool":1},"qLXvpHx1Kr4tIX_uuQzuPQ":{"text":"Visiting New Orleans, we decided to eat breakfast at Fogo de Chao. We arrived and could no","useful":0,"cool":0},"wmmYbKroNXNnJFixYrBOLg":{"text":"The food and service was fantastic! My server Josh, Elise P and Elise L were amazing! The ","useful":0,"cool":0},"T485e5a-EEwmFu8kPd_6NA":{"text":"We were in a hurry to catch a plane. But it was great. We weren't dressed up but we never ","useful":0,"cool":0},"kjRbLA8GoNksdU2LKeTIsg":{"text":"Sunday 06/23/19 we arrive at this location at 1:45pm, waiting exactly 22min to someone sho","useful":2,"cool":0},"AFFEeXh1x4a35hDvSV5VLA":{"text":"The staff was very nice and attentive; They were constantly aware of our tables needs and ","useful":0,"cool":0},"3jSJ9y0hlZi0AIFtToYxxw":{"text":"I loved the one in Boston and was happy my hotel had one for me to visit while in NOLA. Th","useful":2,"cool":1},"vZEDqvETOrk6T16PQi8Fzg":{"text":"Owen and the other wait staff went out of their way to make sure we were satisfied with ou","useful":0,"cool":0},"diIB4rRhoIl6ztCb64ROjQ":{"text":"I can now say I've been there and done that- had the experience, but I don't think we will","useful":3,"cool":1},"MsLHrg1sMdPAmmhTJylJNw":{"text":"I really wanted to love Fogo de Chao. Texas de Brazil is one of my favorite restaurants, s","useful":5,"cool":1},"gAGa9UlDuir3jzl-KqDDZw":{"text":"First time visiting this restaurant tonight, took my mother there for her 71st birthday!  ","useful":0,"cool":0},"HTDr6XKBrs9ruoJF_2Vgcw":{"text":"While the food was amazing, the real memory makers were the staff. Kind, friendly, knowled","useful":1,"cool":1},"1XtgPKbVkoJJthJOpMU5hw":{"text":"I dined here for my birthday celebration and I was not disappointed. The staff was very ni","useful":1,"cool":0},"-jq-CoYUnynVNnQR_3yHUA":{"text":"First time ever at Brazilian restaurant and was very happy. Good food, awesome service and","useful":0,"cool":0},"hq_eOz11pgiCUj4-d4H9qA":{"text":"I was a first time let to this restaurant, and I may say it was phenomenal! The service wa","useful":0,"cool":1},"33FD-gIpMnN62nI6xFfZeA":{"text":"Some seriously nicely prepared meats! I didn't care too much about the appetizer and salad","useful":0,"cool":0},"O9atW7A5YnbYA-O_AhRQcg":{"text":"So let me start off by saying this was an awesome experience , over-whelming (in like a re","useful":0,"cool":1},"Fp15OznquBsEfy2iZBw6DA":{"text":"We had an amazing experience. The food was great...plenty!!! Our server, Joseph, was fanta","useful":1,"cool":0},"yBLOQutyXrM8XG0HUCmdHw":{"text":"It wasn't what we expected, we made a reservation for 7:00pm so we arrived 5 min early but","useful":0,"cool":0},"3jgafUv8Aq2TufzApii0yw":{"text":"The experience was decent overall, but there were some concerns. First one was that the fo","useful":0,"cool":0},"BkXXro2yHfK06xtiWXm5QQ":{"text":"Plan accordingly. Don't eat during the day and build AN APPETITE. You'll be tempted plenty","useful":21,"cool":17},"CbYo1tBfFvOnRs2VMCaLNA":{"text":"Mom wanted to go here for Christmas Eve so I obliged, realizing that it was going to be su","useful":3,"cool":1},"ofscG7-u6lrYdZWmpaQi6g":{"text":"Went for my anniversary and loved it. The food was great they kept it coming ... I actuall","useful":0,"cool":0},"35BA9Op8rFzqAhUBoek80w":{"text":"We previously ate here twice, and thoroughly enjoyed both experiences. Yesterday, with the","useful":3,"cool":2},"_sTbRBDQkr7l6IVvuk4pXg":{"text":"Had an amazing time food was amazingly delicious. Had the pan seared salmon cooked to perf","useful":0,"cool":0},"ZC0BqvV3ht4Uh_zf42d7OQ":{"text":"Everything is good at this establishment. Particularly, the bartender Fern! I recommend th","useful":0,"cool":0},"wHdySEUGOYshd0gjnB7f9Q":{"text":"Were there June 15. If you don't mind expensive overcooked dry meat, than this is your pla","useful":1,"cool":0},"hWWMUlGN0EqN6AswstH4vA":{"text":"Went there recently and the entire restaurant stinks. The smell was so bad we couldn't eve","useful":0,"cool":0},"UmqusPzVr_kpbhQzweFB0Q":{"text":"The food was really delicious. Our server Jessica did a great job of explaining the menu. ","useful":0,"cool":0},"lNeDHHXI_r1KHLNQUH4kNg":{"text":"If I could give no stars, that would be my top option. The food here is TERRIBLE!! My expe","useful":0,"cool":0},"qcR6hjuJQI7L-1mascGJbA":{"text":"I'm really torn about the rating system on this one. I wish I could give it more, but I al","useful":2,"cool":1},"3-w9wF-6xX5tOsbOxythFg":{"text":"This is my second time eating at this location.  I first tried them when they first opened","useful":1,"cool":1},"7BT10PHM5A0gET-F9kvFiw":{"text":"Went about an hour after the Saints and Bucs game. The service was awful. The server admit","useful":0,"cool":0},"MTfmnRhzlx_p3ke_sBqC6Q":{"text":"Fantastic. Always a dining experience. The meats were perfect and the salad plus bar was f","useful":0,"cool":0},"TP_hyR91ht1uS6U4w5W77w":{"text":"So really surprised at the great reviews, almost look fake based on my experience last nig","useful":1,"cool":0},"P5uQHg_UFBCREqfFt0mUuw":{"text":"It was a great experience, all you can eat. One of the waitresses Taih-ja was amazing.","useful":0,"cool":0},"Rp2NQawputHpqBFx3CcI8g":{"text":"This is a rarity. I usually give restaurants the benefit of the doubt and don't slam them ","useful":0,"cool":0},"G-DLzTl8O18xuGtL7tngGA":{"text":"Me and my fiancé have been very busy with work lately and don't get to enjoy a nice night ","useful":0,"cool":0},"g_YQ28pUcFBf-Pf9Iou_Vg":{"text":"Shaggy headed brunette male server compained about us coming in at our reservation time 9:","useful":1,"cool":0},"gdT81xrc-TP2f_dxrpWPPQ":{"text":"All-you-can eat meats and salad bar. This was definitely a fare to remember for our family","useful":14,"cool":4},"hjWrJFQXUKy_Ip-uNWtbOA":{"text":"I cannot say enough about this carnivore's paradise. Except that if you don't eat meat the","useful":4,"cool":3},"wNjbCUhvQdGBy8B5e7PQbg":{"text":"Fogo de Chão never disappoints. The service the food all exceptional. It is an experience ","useful":0,"cool":1},"RZHbjDmzwROiUyFasmxeVw":{"text":"I came here to celebrate my boyfriend's birthday and it was absolutely amazing! Of course ","useful":0,"cool":0},"vBPTD_69VsxQk31oYluJTw":{"text":"Fogo de Chao is located in the same building as the JW Marriott, the hotel we stayed at du","useful":1,"cool":1},"2ToMgffdjuMMF_dRXEoSMg":{"text":"HIGHLY RECOMMEND for dinner in NoLA. I had a wonderful experience here travelling for the ","useful":0,"cool":0},"3iQZOoyLilzahLUY-MCnWA":{"text":"Went there for the second time on Valentine's Day and it was unpleasant. My wife and I wai","useful":0,"cool":0},"qwsrgnAP14iuiE2kt238jA":{"text":"This was my first visit to the restaurant/chain. I enjoyed myself. Others in my party were","useful":0,"cool":0},"iXQ8FnjnXtAGxOVSkn4Qtw":{"text":"Went here 2 times in a week with a crew of people from work. Food was good, love the 'all ","useful":1,"cool":0},"OONcr2YbAAJR3rRetj2jpA":{"text":"We had an amazing experience here.  Salad bar: 10/10.  The beets were fresh, the asparagus","useful":0,"cool":2},"vvt7DGLwD1tB3EGbrJXCSQ":{"text":"I came to restaurant today and  Taihja was our waitress.  She was amazing.  My first here ","useful":1,"cool":1},"9bnijdN1rz-Mu6r1aNIG5w":{"text":"So exciting to finally have a Brazillian Steakhouse in New Orleans. It's about time that t","useful":2,"cool":0},"jvL4zhxxx4Td8mj-hLHqmQ":{"text":"Top notch operator! Great team, courtesies always extended! You cannot go wrong! Efficient","useful":0,"cool":0},"92l9c0GlmcXccFkXgLUI-Q":{"text":"Went to a dinner last night and my party and I noticed that most of the staff did not have","useful":0,"cool":0},"SoBmtOtf4qdQXdMQSEWKqQ":{"text":"Was so delicious excellent service I don't eat read meat but the chicken was so good salad","useful":0,"cool":0},"6YuOpeWd-QnRhtUdLZTbUw":{"text":"Today was my first time ever going to a restaurant this nice . It gave me high expectation","useful":0,"cool":0},"4xuCfyTd4n0hniWFsfDIog":{"text":"I think based at my previous experience at the Tysons corner location this would be a 2.5.","useful":0,"cool":0},"0hqkcInNa88l2RG1rA8dtA":{"text":"This really was an amazing experience. Me and my boyfriend fully enjoyed ourselves. I have","useful":0,"cool":0},"Z2YG8w6pc9b4NghrlPFsxg":{"text":"Me encanto toodo! \n\nMe parece excelente que pidan la vacuna del COVID a todos los clientes","useful":0,"cool":0},"H3TneSDg67pUih-R5ViX1g":{"text":"Horrible service and I expect the reason is either A) Judging me by my appearance or age, ","useful":0,"cool":0},"ZmfzFA14ykIDSu893r31qA":{"text":"One word. FABULOUS. My husband took me here for my birthday. Excellent experience. Highly ","useful":0,"cool":0},"yNpOyhVsXSMeVkzs2_UsOA":{"text":"My Dad has been indoors as a single male for more than a year. So after receiving both sho","useful":3,"cool":3},"vOCOrUyersLax9Q6hFubpQ":{"text":"Dylan was my waiter and the service couldn't have been better.  He was prompt and made sur","useful":1,"cool":0},"dk4KgNxMh04ZYOSUhArhrQ":{"text":"This was an awesome place to eat.   Although the food was amazing the waitress seemed to b","useful":0,"cool":0},"vuycSyw-ueVdj4mqBC-70Q":{"text":"Today was the worst experience I've ever had with RACISM.  We decided to eat at this resta","useful":1,"cool":0},"YjrROtabR3Iaw5AXQDhzOw":{"text":"Elise was our server. She was literally amazing. Loved her. The food is on a whole new lev","useful":0,"cool":0},"RSZEBG5sW1ofRKAN2nf5hQ":{"text":"We had a nice birthday dinner here! It had been a while since I'd gone to Fogo and had nev","useful":0,"cool":1},"l-qrdfVpH1Uw5obu1aPLLw":{"text":"I have eaten at their Beverly Hills location and this New Orleans location  many times and","useful":0,"cool":0},"vjx38QcBGTAuBgqV5xkcvg":{"text":"Everything was amazing. 5 star experience. Jessica was fantastic!! Her service was the bes","useful":0,"cool":0},"LqM0tpski4tzaWt3_wg06g":{"text":"My fiancé and I were excited to try this place when we heard it had opened. They have a $2","useful":4,"cool":0},"pDJE8hCZofQGkuwRLboqJQ":{"text":"Exceptional customer service, food is amazing staff is attentive ambiance unforgettable wi","useful":0,"cool":0},"vM4YYV7XRaljWe9mruJ2uQ":{"text":"One of my favorite chain restaurants. Dependable and reliable wherever you go. Caring wait","useful":0,"cool":0},"E6IHrm3I7r38iU0feDRPIA":{"text":"I went here for lunch recently with a friend and it was during the all star game in NOLA. ","useful":1,"cool":1},"q0px0RbzhT8Mr4xRaJ43kg":{"text":"It was a little different being served from the salad bar instead of buffet style due to c","useful":1,"cool":1},"swv6lfhEZCNN7vDaR_Ulbg":{"text":"First time I've ever gone to a Brazilian steakhouse and it did NOT disappoint! \n\nWe made a","useful":1,"cool":0},"fp3WGaDcN5EbhfSjOLxYoA":{"text":"I had my birthday dinner party here and from the first phone call about reservations and b","useful":0,"cool":0},"l4AinOg1SNNYXMxyQb5_1Q":{"text":"Last night me and my family dined here at this location and Carletta was one of our waitre","useful":0,"cool":0},"sqPOxAQVO9YL_8TlngVapA":{"text":"7/17/21\nAmazing , Unbelievable, Stunning, Incredible .... These words pretty much sum it u","useful":2,"cool":1},"ff5G-8SlRSedT4xAYij6jQ":{"text":"I love this restaurant great food and a much more intimate ambiance! Great for a romantic ","useful":1,"cool":0},"u6PBTyYMyy0JGbcIa_Uu4g":{"text":"Most of us in NOLA are not big into chains and especially this close to the French Quarter","useful":5,"cool":5},"m14D4ClYhsLP9DkQN9cOng":{"text":"Restaurant connected to where we were staying. Food, very very good. Waiter? I seriously h","useful":1,"cool":1},"xp3-I1-x8BiX_PNGB3TNnw":{"text":"Five stars! Restaurant was clean & the atmosphere was of fine dining. The staff were profe","useful":0,"cool":0},"uJ-KenD28cUUBwz4Hb2Arw":{"text":"The customer service was excellent.  When we first got there we got seated right away.  Th","useful":0,"cool":1},"VgqLWY9PYhPb7IqQtSUCFQ":{"text":"This was amazing.  Each course was better than the next.  Our manager lissett was just fan","useful":0,"cool":0},"AR5OaT1U9l9TyAsT5FkAhQ":{"text":"Love this place. Was in New Orleans for the week but we have this place in Atlanta but it ","useful":1,"cool":0},"g4h_uWxX54GZyczGerMW4A":{"text":"We all know the vibe at Fogo de Chão. From the salad bar to the meat. It was all great. I ","useful":0,"cool":0},"zhBhcuqMxNqQHp9Ef9zWvw":{"text":"Wonderful experience. It was our first time here and we went for our 25th Anniversary. The","useful":1,"cool":0},"UiUocztWWRDeNmTn20Wy-g":{"text":"What's not to love about all you can eat meat? I went for lunch one day with a co-worker. ","useful":3,"cool":2},"S29WlU3UtAjUfV60PeCnnA":{"text":"My meal was just good. I didn't dislike it, and I'm not against visiting again, but I've b","useful":3,"cool":0},"9a5_nVa2kN4k_Dx6erhY5A":{"text":"Great food, great staff! I celebrated my birthday here visiting out of town.  Will definit","useful":0,"cool":0},"1nfCFo09WkZoFsGcx6B_TQ":{"text":"We went here for Valentines Day since my S.O. had never eaten at a Brazilian Steakhouse. I","useful":3,"cool":1},"To7-fqrjkL_CyyW03W6AbQ":{"text":"We drove to New Orleans from Lafayette, La to eat at Fogo de Chão for my husband birthday.","useful":0,"cool":0},"Mfd7SYYcFbl0U0dzirz7Hw":{"text":"Food was great and experience before covid was great. Had a table of 15 we all ordered dri","useful":0,"cool":0},"qzDzeObphCTvaVoIrSJXfQ":{"text":"This is by far my favorite restraunt in New Orleans. I have been here multiple times for b","useful":0,"cool":0},"_h3SEEJcEMetLnVrsiAjhw":{"text":"Waitress Amanda was superb. The young man carving meat at table was attentive and friendly","useful":0,"cool":0},"9m5h3Enh55y8mPlc2Cw1kQ":{"text":"The food and experience here are amazing. Attentive and friendly staff, my wife and I have","useful":0,"cool":0},"Mzkx_2W4xXiCIsamC_zg7Q":{"text":"OMG!!!! MR. Brandon our meat guy and the manager Sidenei Zanin were amazing! It was my son","useful":0,"cool":0},"eKSQhp_5otCD0tnBJ2ptQQ":{"text":"This was such a great experience. Especially for my birthday. The manager Lissett Figueroa","useful":0,"cool":0},"ViRp9e3M76pyBaMbRLWihQ":{"text":"Well, I tried Fogo de Chao again to make sure my last trip wasn't an anomaly. The food was","useful":0,"cool":0},"Fspi4v_FCnyRGCvWKEwjmw":{"text":"Great location & amazing staff! Everyone was very friendly & attentive! I enjoyed the guy ","useful":1,"cool":0},"06qrxHk7yD_0ASsJ6ZcPSQ":{"text":"Visiting New Orleans for the first time and we've had our fair share of seafood. I am crav","useful":9,"cool":1},"kQcO1pxxXZZrzitpyeGRNA":{"text":"This was my first time ordering from Fogo de Chao since the pandemic and I have to assume ","useful":1,"cool":0},"JlocdRJmgUMUc8JL0rMnxA":{"text":"This is definitely the best location we've ever dined in!  The service is exquisite, from ","useful":0,"cool":0},"QuZGaTCQ_brZpSdEqC7KeA":{"text":"Excellent place for a group dinner! We went for the grand opening and they made no mistake","useful":1,"cool":0},"BbUJmK6veEm72pLZOKQOSA":{"text":"Had an excellent meal here over the weekend. As usual it was great but a bit pricey. \n\nMea","useful":0,"cool":0},"5bvR6l4TqGlWZWa_Hq13yg":{"text":"I went to New Orleans for the first time last week and popped in to Fogo de Chao located a","useful":0,"cool":0},"tpUVIaehNmkNgm7irT7VFw":{"text":"This spot has the best customer service ! I definitely enjoyed the strawberry Hibiscus coc","useful":0,"cool":0},"bqRmgQBGGwJoQktee6126w":{"text":"Gotta give 5 stars to this great restaurant \n5 starts for the food \n5 start for the staff ","useful":0,"cool":0},"Tz4-AWWBSe77AgjM3LRvNA":{"text":"Stay away. Rude,lazy staff. Just wait to visit another city to enjoy this restaurant, beca","useful":2,"cool":0},"MaMBLduPdMeNyZCc7iSV4A":{"text":"This place serves one of the best steaks in town.  Get the Wagyu strip and I'm sure you wi","useful":0,"cool":0},"s6bY_RNn0IGEUidH63ZzpA":{"text":"Ordered take out the server was very polite and attentive. The place was very busy. The Am","useful":0,"cool":0},"7_vjGX-nwy85PIFEAtmMtA":{"text":"The service here was wonderful. The servers were attentive to our every need, making sure ","useful":1,"cool":0},"w1pmmVw9vU99tnpm54FRXQ":{"text":"This by far was my worst experience ever at Fogo de Chao, the fact that this is where I ch","useful":1,"cool":1},"Fye4J3AMNH7Nb5Hgozv4TQ":{"text":"It was my very first time here. CHRIS and everyone there was very nice and polite. I love ","useful":0,"cool":0},"ns-DHsgyznzUmi5Zm27Alg":{"text":"Have been wanting to try this place for some time now.\n\nIf you planning to drive here, you","useful":0,"cool":0},"nIjzOMrae5f-EGya_gPZug":{"text":"This place has cut the brakes on the hospitality train and went downhill! Talk about a cha","useful":0,"cool":0},"QyyAS9lE81y05Y77q8b3ow":{"text":"We previously ate here twice, and thoroughly enjoyed both experiences. Yesterday, with the","useful":0,"cool":2},"n0y2YfHQreANgldi5vw39w":{"text":"This is definitely one of the better Fogo de Chao locations and the meats are usually well","useful":1,"cool":1},"5BdEXH3gM9I4mXHtFxhTHg":{"text":"I went to Fogo de Chao on 2 different occasions in the past few months.  The 1st time was ","useful":5,"cool":3},"ozOe3xXZJmAlR-iqZikO2g":{"text":"The best food ever is Brazilian. Keep the Mears coming, cannot get enough I wish I had a b","useful":0,"cool":0},"xdqUo5imKqQ-zHDFavLRsg":{"text":"Hi, I am writing this review to let you know that the food was good  and me and my family ","useful":1,"cool":0},"D-EgPyUFf3tgDnU9dMvIWw":{"text":"I was excited to come here because there aren't many Brazilian places in the south. Howeve","useful":0,"cool":1},"fFvuwOl4rvcAjkrBTrzN8w":{"text":"I found hair in my steak last night mid bite. I wasn't offered compensation but they did o","useful":0,"cool":0},"6cdmRHTgrrw4BWHEzqw0PQ":{"text":"This place is excellent. Talk about service and quality! The atmosphere in here is great a","useful":1,"cool":0},"McztL1ZqqP2iwASQEoZ6eA":{"text":"We had relatives in town and they wanted steak. We decided to try this restaurant because ","useful":1,"cool":0},"3bMF3GY5KNq6H6UKfYaTPQ":{"text":"This place was packed with hungry diners during the dinner hours.  It is a Buffett style d","useful":0,"cool":0},"hK7Vm5WiMH6GsdrWO55Q7Q":{"text":"No chicken hearts. PERIODT. I am very disappointed. My little chicken heart is broken. Als","useful":0,"cool":0},"A1MdfWRJmGgXq3SrQi5HCw":{"text":"One of the best food experiences in town if you are a carnivore meat lover. The deal is un","useful":10,"cool":8},"GvMPc5jT0jADdvIZdrbf6g":{"text":"NARY A VEGETABLE\nNO UNMARINATED GREEN\nEVEN THE KALE IS TOPPED IN BACON\n\nOkay, so I unapolo","useful":8,"cool":3},"L2FkSQhjNgpdda7GHQA82Q":{"text":"This is a great place for everything - the meats, the salads, the bar food, and the servic","useful":0,"cool":0},"zJhmIpd9Ql2vJINH1LQa7g":{"text":"Excellence! An all around wonderful experience! My husband and I were celebrating our 13th","useful":0,"cool":0},"wYLbxyJh4KFzimEdcAoB1g":{"text":"Omggggggg!!!! My best visit ever....  not sure if it's new management or just new people b","useful":0,"cool":0},"YHs8RNRhrf60nZd0NkCUZg":{"text":"We had fantastic service and really enjoyed the personalized cocktail service. If we came ","useful":1,"cool":0},"3sYTG9V5MO1JgnT17nqQ2Q":{"text":"We visited this restaurant on Christmas day after making reservations online for  4pm.  We","useful":0,"cool":0},"ZjtvROM50YaY8x_8OIegZw":{"text":"Come hungry my friends for this it more than a meal it is an experience.  This is my 3rd g","useful":3,"cool":2},"iQePLWmue0lRr6AwCvFE1w":{"text":"I enjoyed my experience. The meats are continuously passed out,it doesn't Stop  I will ret","useful":0,"cool":0},"evpxxL97h9PRdPPGwDHTcQ":{"text":"This was our first time to experience a place like this. We ordered the full experience. O","useful":0,"cool":0},"fBTkPeO1zSo0716xu_wrGg":{"text":"Hi, me ans my family went to fogo de Chao the food was amazing good meat and all. But I ga","useful":0,"cool":0},"ggbSJQlilzVu-g1yZnKzfA":{"text":"Awesome food and service. We went for Sunday brunch and it's basically exactly like dinner","useful":0,"cool":0},"O8DOeRnnY7ZZtZ1JiJTHpg":{"text":"Fogo has a really neat setup with the all you can eat meats and sides bar.  During covid, ","useful":5,"cool":0},"NQk1P54LBvhMkD3sZX_jlA":{"text":"After the game dinner! What a treat. The wait staff was outstanding, especially Gary. Gary","useful":0,"cool":0},"0-GuYfnqcwznj4JUbodXNQ":{"text":"GREAT spot to try something else while in New Orleans. Teddy served us the best Brazilian ","useful":1,"cool":0},"8jUn_XyZnSGjBpUpr6a9YA":{"text":"We took our daughter here for her 22nd Birthday.  There were great times had by all.  The ","useful":0,"cool":0},"KbUBtQRMY74rG-6BsMXlCQ":{"text":"We had reservations for 6:30, were totally ignored & didn't get a table until 7:40. It too","useful":0,"cool":0},"xLJHbJpd0ZgFMta0s0QGrw":{"text":"A great place and wonderful service from Douglas! 5 stars! Service was excellent and the f","useful":0,"cool":0},"cHkDqvFgAJL1aKee0dbQ8Q":{"text":"Me and my boyfriend went for Valentine's Day . The food was really good. The servers come ","useful":0,"cool":0},"89qkwcLLgz78PkvNSfE-lw":{"text":"Military and kid friendly! We went here for Veterans Day and it was my first time at a Bra","useful":0,"cool":0},"1eSZWYv1i4vnafUHF19rdw":{"text":"Not worth it for me for the price you pay they need to do better the salad bar was absolut","useful":0,"cool":0},"HukoNFONMaEIKgigoxpxcg":{"text":"Really disappointed.  We went for an anniversary dinner.  We love Brazilian steak houses. ","useful":1,"cool":0},"99s__Zf_3v_kNT0UanC6Vg":{"text":"I came in and was greeted by a young lady named liset and she was very nice and made it a ","useful":0,"cool":0},"uK4DWZrOcryA3h-_S_ay8g":{"text":"My family were in town visiting from Alabama and my brothers decided to treat us to a dinn","useful":0,"cool":0},"JXFppUgv-hqykAlhFBv6-w":{"text":"My husband and I are staying at JW Marriott and we noticed this place and immediately knew","useful":0,"cool":0},"ke7G7S6RFpL9wr6y8kuB7A":{"text":"We had an amazing time!   Our host Chris Hamilton was truly delightful.   He ensured our v","useful":0,"cool":0},"FWxL6m1cEf_gnEt91ZZApA":{"text":"First time experience at Fogo De Chao New Orleans, and all I can say is OMG, everything wa","useful":0,"cool":0},"SlXCdvXEeFRH2BveYc-NBw":{"text":"Wow!  So much that was so good!  Great food and great service.  Literally everything that ","useful":0,"cool":0},"7jV6xPBntuUY0OdfgifirA":{"text":"People come to Fogo de Chão for the experience, and my experience was like none other! It ","useful":0,"cool":1},"wG0T0bQKWMUcY8yBYEfLIA":{"text":"My boyfriend brought me here for my birthday and our experience was absolutely amazing. It","useful":0,"cool":0},"_XxqMPzeFnBCGOZHjvtkPw":{"text":"This place is the last place I would choose in Denver. So many other great spots. Rosie th","useful":0,"cool":0},"IqnIuGuhcIup1VOsjQ7vDQ":{"text":"Fogo never disappoints. Great attentive service; fine ambience; great convenience; expecte","useful":4,"cool":3},"9NpdYi_W1YQgixaQzlEeJg":{"text":"Ok this is really hard because it's opening was very very much anticipated especially sinc","useful":2,"cool":1},"hT6esCdpTzZ31ixdkZ-0IQ":{"text":"This review is for some dishes we had from their booth at Wednesdays at the Square!\n\nWe ha","useful":1,"cool":0},"9grAbwnll_yAgAqrcEL1Ig":{"text":"This was our first time at Fogo de Chão and it was an amazing experience. Our server/barte","useful":1,"cool":0},"BIw7U1zdG4EhF88nwWQqXw":{"text":"Took my son here for his birthday. Food was great, wagyu beef was awesome! And then came t","useful":0,"cool":0},"ukNKm3UeENBYKCgJoVEjGA":{"text":"Ah fogo, one of my favorite chains to indulge in my favorite meats, sides, and salads deli","useful":0,"cool":0},"aMhF_mufT_C49Zs36uG6LA":{"text":"We were a group of 3 and came into the restaurant behind a group of 11. Nobody acknowledge","useful":1,"cool":0},"FcNTWp5RmAHQ4J8tcIrkAw":{"text":"This Place is amazing gave us great service I'm from Chicago and and I believe that the st","useful":0,"cool":0},"CtVubb-gd2P8WC-w38DD_Q":{"text":"I do recommend making reservations, it took about 15 minutes to get a table during lunch t","useful":1,"cool":1},"Oq1LqRYBvILnmPcwNuYQmA":{"text":"Excellent service. Everyone is very hands on and welcoming. The drink I had was sooooo goo","useful":0,"cool":0},"fMNKNl9lr_zWqrZUkQezmQ":{"text":"The food was great, they will make sure you try every meat in the world! Meat was cooked t","useful":0,"cool":0},"nTfiJhqtVRz-AQkNc_DLgA":{"text":"We drove to New Orleans from Lafayette, La to eat at Fogo de Chão for my husband birthday.","useful":0,"cool":0},"KUICfvzwFXhcrNMoOxYWYg":{"text":"My wife and I dined at Fogo de Chao New Orleans last night, the place is spectacular, the ","useful":0,"cool":0},"rqG5T3kGSP1fJVptqb9ZXg":{"text":"Amazing service! Our waiter Zach was very friendly and attentive, just like every other st","useful":0,"cool":0},"Q6xjPS2ws83sjdlrHpkdnw":{"text":"I've done Brazilian Steakhouses before, but this one is overpriced IMHO. The meats were bl","useful":4,"cool":1},"XlHLKbHK0arhKHZp63IFyw":{"text":"Fogo de Chão was one of my favorite places to dine in NOLA. I got the experience where the","useful":0,"cool":0},"xPOfDMmCBXmzjAMSzwImJw":{"text":"I've been to the NOLA location two times so far and I've also been to Fogo many times in H","useful":1,"cool":0},"o209m9vhNAvKC8XbKeSZhA":{"text":"This place was great. They passed around about 10 varieties of meat. Mainly beef and pork.","useful":1,"cool":0},"RZuegWzYcESTMuBMANOu-A":{"text":"Do not waste your time or money! I've been to a Fogo De Chão once before and I do not reme","useful":16,"cool":9},"BwvZ0nw_aH2VrBZR5hnRgQ":{"text":"This was the worst food I have ever eaten if I tried to make it this bad I couldn't the co","useful":0,"cool":0},"yRvo1A80CyKPnlpu2WQXQA":{"text":"The perfect restaurant for those who like a lot of food but don't like having to make any ","useful":0,"cool":0},"dX8Hz_ZPYvIibnxZGGolBg":{"text":"The food was amazing, but I wish the service match the quality. I had a reservation, but w","useful":0,"cool":0},"EjZPfnyOuvsbJ9WYqhM2YA":{"text":"One of my favorite Fogo branches, their selection is exceptional. The manager here, Erika,","useful":0,"cool":0},"O2uPf7eOTYOwLmu7g7-LiQ":{"text":"Fogo is cool experience but you have to prepare for it.  The food is delicious and it just","useful":0,"cool":0},"zlmAeD0eawufrfn9Gakmyw":{"text":"So let me tell you a little secret, Fogo de chao is an awesome experience and you pay for ","useful":0,"cool":0},"cPUmAS2M5kYknhXl0e17Gw":{"text":"This place is unbelievable, the Meats, the Service, was excellent---\n\nWell priced---it was","useful":1,"cool":0},"Bqvb9dgOSNz78D-ZTuhA2g":{"text":"The best bar ever!! I also love the food and the atmosphere here!! If you haven't visited ","useful":0,"cool":0},"ux6srp0t2JV_OmmLik5VKA":{"text":"Enjoyed a wonderful dinner with great friends.  The best was the service.  Jake Coovert wa","useful":0,"cool":0},"QPBdeXp87njCd2egoiSYgQ":{"text":"Great Restaurant!\nGreat Food!\nGreat Location!\nGreat Staff! (Our waiter Ron was the BEST)\nW","useful":1,"cool":1},"07xi_lEx2X6pdY2OqGYOFQ":{"text":"When we found out that Fogo de Chao was on coolinary month, we invited friends to eat and ","useful":1,"cool":0},"wL6-cV9imOzq54aU2JrN4A":{"text":"The food is good but they could do better on keeping the market table, soup and bacon stoc","useful":1,"cool":0},"9Wq6VAk3ff5hA7IV7Q1QeQ":{"text":"The experience was great  Lots of different meats and cuts as well as all-you-eat sides. V","useful":1,"cool":0},"s9LQ_VJZZOIKvoKYlmU1hw":{"text":"Last weekend was my first time trying a Brazilian steakhouse and, I must say, it was a nea","useful":0,"cool":0},"Z3AxLQ_OU-42jPRcEDr8Lg":{"text":"We were not happy with the host/front desk service at all.  We made reservations for 6pm a","useful":0,"cool":0},"ZucZFGRxWpo7Fj5HVtRo2A":{"text":"I know that NOLA is the place to eat seafood, but eventually, the carnivore in me emerges ","useful":0,"cool":0},"431pOAki3p5vXjSq9TPZig":{"text":"Pretty standard for a fogo de chao. Great service but the market table was on the smaller ","useful":1,"cool":1},"59TfSWdj4YuDyOF0IDU_MQ":{"text":"FOGO\n        If you have never been to a Brazilian steakhouse, then you're missing out. Tr","useful":1,"cool":1},"tfZabCCjbpW0f_p3jJAfZQ":{"text":"We always wanted to try this Brazilian dining place since long time ago but never got a ch","useful":4,"cool":0},"U00bMSnhw371RZujNFAdSw":{"text":"Maybe it was because I went late in the day, but the experience just wasn't a good value. ","useful":1,"cool":0},"8gL8CsiCsYZUMZfVyDr0-g":{"text":"Fogo de Chao is always a great experience. I have been to their locations all over the wor","useful":10,"cool":9},"NChn-vWTFj_Vg46ZEe8JPQ":{"text":"The food wasn't bad and service wasn't horrible either the waitress or (floor slaves) as t","useful":0,"cool":0},"NG-rIlPFg4qYL-bAIzMLWg":{"text":"I have been to Fogo 2 times prior to this visit. This 3rd time one of our servers were nam","useful":1,"cool":1},"37rsmHQ2Hyagl_vEGAip3w":{"text":"So let me start with the good. The valet is extremely convenient considering they are smac","useful":2,"cool":0},"9IcgxmuKZPba0WvKSqObXA":{"text":"I came here Mardi Gras evening and what can I say? It's a meat orgy with a salad, cheese, ","useful":3,"cool":0},"rtSuACIjMvqzmg5VQn1-og":{"text":"Decided to have our annual holiday sequin party here this year because they told us they c","useful":0,"cool":0},"mt_5YyH348z9b-DrmdxPgQ":{"text":"Visited recently and had a very nice time.  I stopped earlier in the day to ask about rese","useful":0,"cool":0},"aw9NWI9f2jouvR4fKP3-5A":{"text":"I've dined at the New Orleans location twice since its opening and experienced a drastic c","useful":7,"cool":1},"AfJ0mFNuM62V8LFh1O0_jQ":{"text":"Went yesterday for our anniversary. Great quick service the meats served at an amazing med","useful":1,"cool":0},"tn3wthpVstMgVMdwIM2U3Q":{"text":"Our group of six dined here on a Sunday night when the restaurant was quite busy. There wa","useful":1,"cool":0},"RV95LIEuVuWTHYAxXQVu-A":{"text":"Because I ordered the \"Superfruit Lemonade\", now my nickname is superfruit. \n\nThe steak wa","useful":0,"cool":0},"5oz_sSdXUAyKbM2E6DVkhg":{"text":"One of my favorite places to go is Fogo de Chão in New Orleans. The meat is always prepare","useful":2,"cool":2},"5bBJOwRA1aOQhbH6w-NQoQ":{"text":"I am only giving one star, service was slow and ordered the salad bar which seems to be th","useful":0,"cool":0}}