{"FjVr2UuAr8QSlp4ajl905A":{"text":"The spa was a wonderful experience. The staff were friendly and took such good care of me.","useful":1,"cool":0},"TVdN2lJ0hC-fLQTN22p7bg":{"text":"Cupping and massage...Lana was amazing! Great experience, feel overly relaxed, while it wa","useful":1,"cool":1},"ogTpATS7ULF5IUun4sDSAw":{"text":"My entire experience at the Waldorf Astoria Spa in New Orleans was one of the best I have ","useful":0,"cool":0},"7FuHJoi6HYgYFmRQ45-woA":{"text":"I just had a Hydrafacial with Cassandra and I am in love! The spa is the perfect mix of re","useful":1,"cool":0},"62ThlqawHOsC3B3bJJnDuw":{"text":"The spa was wonderful. It was a tad small, but I guess the old buildings in New Orleans ca","useful":0,"cool":0},"eQvKeSD3JJVHwGxSpcvUJw":{"text":"I just can't say enough good things about this spa and the people that run it - my only re","useful":0,"cool":0},"K0oSTonwxXG2Y_XSWxoGPw":{"text":"My Waldorf massage knocked my socks off! Gloria was my therapist and she was amazing. I pr","useful":0,"cool":0},"sJf2j_b6KjFoBIKjuQ2Sog":{"text":"This is an amazing spa. The ambiance and calming atmosphere was superb. The rooms are beau","useful":1,"cool":0},"X6HJAQf2wpxuUN80UMuL3A":{"text":"Staff were friendly and accomodating. Bathrooms were well stocked. The cleaning of bathroo","useful":1,"cool":0},"L-2VBbC7wM0NNTmzS_P8Eg":{"text":"Came in to town for a large conference. Had a lovely experience at this spa. Booked a pren","useful":1,"cool":1},"IRvGgT0r4UsUqHMmUrczOg":{"text":"As a New Orleans tourist, I was looking for a nice luxurious spa to kick off my boyfriend'","useful":8,"cool":5},"ANPoMfIygSVzjN7TIniz5g":{"text":"I want to give a thumbs up to Lisa that worked at the front desk for going above and beyon","useful":0,"cool":0},"d8tpPqnoYMA3cwDU6-iC_w":{"text":"Ethel did a fantastic pedicure & the massage was great.  The hostess lady was kind, not fr","useful":6,"cool":5},"B4FgGYbpBI4IiDF0HBksAw":{"text":"The spa is nice enough.  Has a nice room with soft beds to relax with water and tea.  I wo","useful":0,"cool":0},"CxOhpw9zaMiiKy8i5cgKoQ":{"text":"DEFINITELY do not recommend!! Such a nice hotel with such a crappy spa, who would've ever ","useful":0,"cool":0},"9OOppuHmG_yA8jNP-9Cvyw":{"text":"BFF and I researched before deciding on Waldorf. We booked the entire day with a treatment","useful":1,"cool":0},"0tt03-luqBRojajtSziKPw":{"text":"I'm currently staying in this hotel. Excellent location near all activities. Hotel lobby h","useful":3,"cool":0},"pwFSvUnqaIxpDPP8tzM8wQ":{"text":"To be fair: My spouses massage was amazing. She was happy with her therapist. She was very","useful":2,"cool":0},"AZ2yyOSc-F0poFmkl3RMOA":{"text":"My husband and I had a wonderful time with the couple's massage ans couple's experience on","useful":0,"cool":0},"-GFQBmI8A56UY1UqHuAcGA":{"text":"Came here for a bachelorette party for 6. Appointment was at 3pm and we came at 305. Our m","useful":1,"cool":0},"RRkOI44l9BNdGeXBf5NJCw":{"text":"Amazing! Facial with Thi, who was one of the most beautiful and friendly people I have com","useful":1,"cool":0},"YwkeaEGI_jyBEan97_u2Wg":{"text":"So, the aesthetics of this spa are the best in the city. The massages are not the best how","useful":2,"cool":0},"S5si4SVxDoI5acxJKNXdsA":{"text":"Love love love. My initial appointment was at 2PM but due to my mid day nap, I had to push","useful":8,"cool":3},"pU_xrhqajsULdpKCoufHCw":{"text":"Today, my mother and I received the signature massage and we both were so impressed. The f","useful":2,"cool":0},"KcQqzYgt00g9ZfUkqKIJGA":{"text":"We had a fabulous day at the spa preparing for the Endymion Ball. This was truly an upscal","useful":3,"cool":1},"liVpxGnsHk89hErGEGi-Iw":{"text":"An absolute stellar, clean and gaudy hotel filled with impeccable and friendly service thr","useful":2,"cool":2},"p7P2RmLVFroqn257AhLnBQ":{"text":"A quiet spa that offers a variety of relaxing massage services.  They even sell UGG produc","useful":2,"cool":1}}