{"iHE-ao9TJ-7IzishPG4cjA":{"text":"So Emeril just got the boot from the Food Network...I guess all the Bam Bam'ing wasn't eno","useful":0,"cool":0},"bTUeobSdcO45fZ6FMhuOaw":{"text":"Fantastic meal from start to finish. The service was impeccable, yet warm and friendly. We","useful":0,"cool":0},"rcr25askhOfAb1H31qY1TQ":{"text":"This restaurant is completely over rated. The food was good, I had the salmon gumbo as my ","useful":0,"cool":0},"Fau-23nRQ44VdhPwASGg5g":{"text":"It's been almost a whole month since I ate at Emeril's and the reason this review has take","useful":9,"cool":4},"ovSZRhpqNgZBOKwFL8hCiA":{"text":"Love this place. Every time I'm in town I long for their pork chop and i don't even like p","useful":0,"cool":0},"T2xm6MqxUAzEBmHmXhbUeQ":{"text":"Amazing! Had made a reservation for me and my husband. We were seated promptly at 8. My hu","useful":0,"cool":0},"hZEDSKL1pceuGFBWodrLqg":{"text":"Very good food.  I imagine that they get a lot of mileage out of the smoked andouille saus","useful":0,"cool":0},"B6JRqB68vzrCbfuOk4ASYg":{"text":"Unbelievable and amazing. Cheese plate.. Lamb neck nachos.... (Off the charts) and the Dru","useful":0,"cool":0},"iROV8Wp91BSoDG2OBgbOYg":{"text":"Despite Emeril's penchant for being a world-class chef, the food (and ONLY the food) was n","useful":1,"cool":0},"rH1tskNq5YBY2QSaTUE63w":{"text":"Had previously posted as 5 Star rating for Easter brunch last year. Downgrading to 4 Star ","useful":1,"cool":0},"9-YYAZHV386cGOck-KxoaA":{"text":"This made it into the list of places to visit for a weekend trip to New Orleans with the g","useful":0,"cool":0},"Rhs5VHmslgDwSNUPnUcM-A":{"text":"Great food, excellent service, a perfect dining experience!  Gumbo & banana cream pie stoo","useful":0,"cool":0},"tU8cBJOezjAZMBpKCCkSlw":{"text":"Wonderful food and service!  We were offered a table right in front of the kitchen and did","useful":0,"cool":0},"PZwFKbRmn4USixbRac7Bjg":{"text":"Went in without a reservation on a Friday night. I tried to find a seat at the bar but no ","useful":0,"cool":0},"kUjp5IFPody7bSbqzl7XNA":{"text":"Eh. Old hat at this point. More and more, Emeril's restaurants are phoning it in.","useful":3,"cool":1},"s1K1yrn4OjpWuPj0TnhWhA":{"text":"Our 1st time here to thoroughly ENJOY Emerils!!  Everything was superb from start to finis","useful":0,"cool":0},"qnmDGUEa8V1w9afFvcalvw":{"text":"We were a little nervous going here on Emrills 25th anniversary weekend with our two kids,","useful":0,"cool":0},"qtL_3db_exU0ryYBeujISQ":{"text":"AMAZING New Year's day lunch! After reading the reviews and talking to friends who have be","useful":0,"cool":0},"JvQBZUKPMurfHXJ89Nv9lQ":{"text":"My whole experience here was amazing. From arrival to leaving I enjoyed myself immensely!\n","useful":3,"cool":3},"vRbBL0z44fu_TqZ-YkoPNQ":{"text":"Had a good meal last night.  The staff was very friendly and knowledgeable about the recip","useful":1,"cool":0},"RS7R2spZChICV_madtmLcQ":{"text":"I'm a fan!  The attention the wait staff gave our table was unrivaled and even tho there w","useful":1,"cool":1},"Bec7L06EVA_mmRqf-jXz6A":{"text":"Good food!  Great service!  Business casual. Inviting decor.  We had a fun time eating the","useful":1,"cool":0},"a2GOEJ9onPc0RX-P0eL6cQ":{"text":"One of the top meals I've had in my life!! Amazing from start to finish, and the wait staf","useful":0,"cool":0},"tZlvtwU03aIOqkPrrL3MlQ":{"text":"The old warehouse had been nicely converted into a trendy restaurant with wine refrigerato","useful":0,"cool":0},"RfPKPsCcD06eI7zwrj0NXQ":{"text":"Fantastic food, friendly waitstaff, and you really have 3 waiters attending to you.\nWas fa","useful":0,"cool":0},"ra4lyBoHeTYbDjvvxXzceQ":{"text":"Everything we had was absolutely amazing: pork chops, friend chicken, duck, and beef!  I h","useful":0,"cool":0},"gqRe58rPobB5FkpxR5b38Q":{"text":"Absolutely outstanding!  I think this one is the original of emeril's chains, but it was a","useful":0,"cool":0},"v19ZUUUcwi9PZQwR7-LUDg":{"text":"I first dined here 15 years and it was easily the most delish meal of my lifetime. Then ag","useful":6,"cool":5},"o9IO2VwlzB7E0nATihQZGQ":{"text":"OMG, Amazing first the ambience is magnificent. I've been to this restaurant twice and bot","useful":0,"cool":0},"CjQkLZo3XILgkxt7iVHGig":{"text":"We celibrated our 20th wedding anniversary at your restaurant. Our experience there made o","useful":0,"cool":0},"OleVrtnxim9VPp4T7MWJWQ":{"text":"Had banana cream pie. Not overly sweet and terrific. I didn't have dinner but got it to go","useful":0,"cool":0},"B1Pgt4WZQBa1ZZ45hWmwkQ":{"text":"Fried chicken is really good. Pork chop is excellent. Great service. Fun to sit at the che","useful":0,"cool":0},"EWyd8jbEXmwyZa3Ymj94jg":{"text":"Ok, full disclosure, I only had dessert and coffee here.  But, what I had was super fabulo","useful":0,"cool":0},"XmmzFZD94oxXeYPhkMoeVg":{"text":"My friends and I had to make a stop at Emerils on a tip from local artist Jamie Hayes. We ","useful":0,"cool":0},"VDUPXUt_dws3NXBdp1qVsQ":{"text":"Superb service and food! We had a party of 6 was catered to our every need with no problem","useful":0,"cool":0},"81vfG8pJWAbPNllyu7IkuA":{"text":"What a great and sophisticated southern food experience! I always have a love/hate relatio","useful":2,"cool":0},"4GH29tOgvXBQ65XkPt39vA":{"text":"The second best of the Emeril places in NOLA.  Exceptional food and service and the desser","useful":0,"cool":0},"eiNYqQRWHiTZoFtSD1Ouhw":{"text":"Service was amazing but food is overrated. I had the drum which was breaded yet almost fri","useful":0,"cool":0},"FzOw04rbtMm9ZnaO3G62vw":{"text":"I really want to love Emeril's. I really do. But I've been here a couple of times now and ","useful":0,"cool":2},"IhogHi-jxCne3PsmoMCG6g":{"text":"I want to start by saying that I thought my experience at Emeril's was fine and would not ","useful":1,"cool":0},"ttQ5ujwjSikQNvPN8H2qTQ":{"text":"Just got back from dinner...this place just does not live up to the hype! The sweet cornbr","useful":2,"cool":2},"o9SOSckO2gAr4ndYyXBk1g":{"text":"You are never sure what you are going to get at a celebrity-owned restaurant.  This one di","useful":1,"cool":0},"V3COvN_53ZAVjSWXkq4dkw":{"text":"Very good meal but not great. The highlight of the meal was the mussels. Had the pork chop","useful":0,"cool":0},"SroTMzaQiHTv1rALbn7hLw":{"text":"Had a great experince. Service was good and the food was outstanding. We sat at the counte","useful":0,"cool":0},"o2pGW0lRCOZJbWNOwhwOQg":{"text":"The first thing you notice on entering the restaurant is the decor, it is amazing. From th","useful":0,"cool":0},"cLbazUEkEAKYBM0EFwcQiQ":{"text":"Came in for lunch with my boyfriend. We had the bbq shrimp for appetizer. Then we both had","useful":0,"cool":0},"oxNtkRWPxlEaNzUfW7UHxg":{"text":"The food and service were beyond superb. Very much worth it. It should be a must for someo","useful":0,"cool":0},"R_Z8xAfXYc8zvLCXvPYmBw":{"text":"I had the rainbow trout for lunch. Although the food was delicious,  the server was nice, ","useful":0,"cool":0},"HSPU-BVEGXbNZJdLw6XDGg":{"text":"Emeril's is the quintessential dining experience. The food is exquisite and the service im","useful":0,"cool":0},"BT6Ey29DlSgd64yocAGSvw":{"text":"Very attentive service in a pretty dining room.  However, an overall sense of OK, not wow.","useful":0,"cool":0},"GVfn5qhxYdF2PGyVYoJa1A":{"text":"We were in town for the New Orleans Jazz Festival and I made a reservation for Friday nigh","useful":2,"cool":1},"oNsdrISBWWrrmIZwqJXLSw":{"text":"Unfortunately the best i can say that this is just another chain resturant. The kitchen wa","useful":0,"cool":0},"Fd6K42jsJ3aG3qZ9F2768Q":{"text":"WOW!  The best service I have ever had in my 68 years.  I was called by name and treated l","useful":0,"cool":0},"L1OkRtEyWSZG0aEkzeWkfg":{"text":"Gourmet restaurant in New Orleans. Emerils original restaurant offering amazing lick your ","useful":0,"cool":0},"f2d2AkGPEAuocDz0XrL-JA":{"text":"I took my husband there for his birthday and we loved it. This was my second visit. His fi","useful":0,"cool":0},"25Gjegmap7XMYRYaOlK6yw":{"text":"Emeril's flagship restaurant on Tchoupitoulas Street still manages to execute at a high le","useful":14,"cool":0},"2_79eO72E7E2Q_1zhMK43w":{"text":"My husband and I decided on Emeril's restaurant for lunch on my hubby's birthday.   The st","useful":0,"cool":0},"Pq7OICa8BIBMa5gGhHkoEw":{"text":"So, husband and I decided to treat ourselves to a fancy meal while in nola. Being a fan of","useful":0,"cool":1},"qN-mCIEixs-mOxHge7Li8w":{"text":"Possibly the best dining experience I have had. The service was absolutely perfect from th","useful":0,"cool":0},"z8tj90Zv8-4HXMD1FK0veA":{"text":"By far the most amazing food experience I have had to date. All of the options I tried wer","useful":0,"cool":0},"s0DulL4thFyFw50K1685lQ":{"text":"They were so busy when we got there (9pm) and we didn't have a reservation! They were hesi","useful":0,"cool":0},"6JVxEJKIvf2b_3vOH_KsCw":{"text":"We had a truly wonderful lunch at Emeril's. I don't care that he's on TV or anything. In f","useful":0,"cool":0},"ZRklshrBQ-Z_KMM3NtvLFA":{"text":"My best meal in new Orleans tried del Monica restaurant rebirth Muriel's Dickie Brennan's ","useful":0,"cool":0},"Fq4SBXbfrjGmVo6X_d_kLA":{"text":"my favorite restaurant in New Orleans! Can't go wrong with anything on the menu and the ch","useful":0,"cool":0},"DLohnnJ6GxSxNrxwMQaNGw":{"text":"Very disappointing. We saved Emeril's for the last night of our vacation expecting it to b","useful":0,"cool":0},"sPAQqEkpnrzGl4qHWn6zBA":{"text":"The food far exceeded expectations, I had the rivets cap with short rib, and she had the w","useful":0,"cool":0},"DcpZ-9xdfS9LuLfnOXxu2Q":{"text":"First restaurant me and my friends came to upon arriving in New Orleans a couple weeks ago","useful":0,"cool":0},"fXIpn1GG_I_VtIbJrMqTUA":{"text":"I came here with high expectations given Emeril's reputation and the restaurant's consiste","useful":0,"cool":0},"Axg8T0iidi-bN3SE_1Ne0w":{"text":"Great food and great service. Banana pie is fantastic. Chocolate bread pudding great. Grea","useful":0,"cool":0},"iBuVUFUz3TNC3TeVtoToHQ":{"text":"We spent four days in New Orleans and this was the best meal by far. Emeril's delivered. W","useful":0,"cool":0},"Vm1LRLOPzBzsFvZfokLxzg":{"text":"Absolutely beautiful restaurant.  This was the first place we dined at.  I would say, okay","useful":1,"cool":0},"NLHx6ZLocpTtFnmex0_DjQ":{"text":"This place was amazing!!! The service, the atmosphere, the cocktails.. the food! This was ","useful":0,"cool":0},"XFhV7ebLxIZPRR5HaWuuDQ":{"text":"Haven't been here in years but I have to say that we have had much better all around. Food","useful":0,"cool":0},"1TaXA8zpcdRSNHYbCopx-g":{"text":"Excellent dinner.... exceptional service.... certainly a treat!\nWhen visiting New Orleans ","useful":2,"cool":2},"pHQ9tdR2rvFXJQHomvzAwg":{"text":"Did not disappoint. Excellent service and superb food. My wife and I had wonderful experie","useful":0,"cool":0},"OXx9-w3dlbVNNL_XCteYgg":{"text":"Went for lunch and ordered:\nFresh Angel Hair Pasta with Louisiana Crawfish Tail in a Creol","useful":0,"cool":1},"2WvkuBBj3UoFMY-nPeCjIA":{"text":"Everywhere in NO is awesome with friendly people, but the people here were over the top aw","useful":0,"cool":0},"pjC9D2Cb5fC0wOdFG3wP8w":{"text":"Im gonna give it a two, when it should be a 2.5.    The service was immature, inexperience","useful":0,"cool":0},"M4JL6bkjbVryFVJxOGaGeA":{"text":"Food was amazing. Couldn't have been better. We started with Moscow mules and cucumber bas","useful":0,"cool":0},"Ln1YGRXFESix9yVqryWozw":{"text":"I'm not afraid to tell anyone that Emeril will always be one of my favorite celeb chefs de","useful":0,"cool":0},"iGlY-hT9dGeJLQ5SyRu7tA":{"text":"From a nice Malbec to the outstanding pork chops with mole verde made for a memorable nigh","useful":0,"cool":0},"IUBTAIqNgn8QqWywv27xdg":{"text":"Went to Emeril's with colleagues.  Overall would say food was decent, service and ambiance","useful":0,"cool":0},"udiiFA1gv0to6u5p0vjIiw":{"text":"I'm honestly just not sure why the hype for this place is so great...hate to say it but it","useful":0,"cool":0},"d1_B2zkcf6s5VVhxrxNchA":{"text":"The duck wings were the best thing I've eaten in New Orleans.  I want to come back and ord","useful":0,"cool":0},"aR2_lauI4U9M3iP72l7J_A":{"text":"Had a good time eating at the counter watching the cooks in operation.  Had the shrimp app","useful":0,"cool":1},"ygQcmptKY5O_QSGIlkRTDQ":{"text":"I arrived with my children, two of whom are not appreciative of fine cuisine. Nonetheless,","useful":0,"cool":0},"sW4LFyAkD0uNapEri8AwVA":{"text":"Wow, great restaurant.  The food and the cocktails were both amazing.  We were a group of ","useful":0,"cool":0},"ImPGOxd144zNeVXA-jFAIQ":{"text":"First off, let me say that no matter how good your food is, if you don't have good Front o","useful":1,"cool":0},"UjcjpX1KmgGYoBMPW8YWKA":{"text":"My husband and I attended a corporate sponsored greeting reception that was heavily attend","useful":0,"cool":0},"n_OROQ93k4X4ZWZuJWxwdQ":{"text":"BBQ shrimp sauce was good but too peppery and the shrimp seemed undercooked.  I'll never l","useful":0,"cool":0},"6d8MQ7QWckLtGGCQd58YqQ":{"text":"Everything about this meal was fabulous! The service was impeccable and the food was fanta","useful":0,"cool":0},"7emne3tC728Nk-ECnQqbag":{"text":"This was my first trip to New Orleans...and as I searched for places to eat, I found Emeri","useful":0,"cool":0},"18Iz7_0NRLlfxFzplTtLhA":{"text":"Went here for a business dinner last night. The customer service was amazing. Our waiter, ","useful":0,"cool":0},"a9vT1emV3gOqcGXkFzOMBw":{"text":"Emeril's didn't meet the hype for me. It was good, but it wasn't exceptional. Good service","useful":0,"cool":0},"y9Fey5Z75SukJ4P01k40iw":{"text":"Of course we had to do an Emeril Lagasse place while in New Orleans so we headed to his fl","useful":2,"cool":2},"m4PJ_-mi4252xg7dQQIjaQ":{"text":"The service was superb. The staff members we attentive to details and most impressed with ","useful":1,"cool":1},"mApPxNei2lzzrgaJ_WWicQ":{"text":"It was ok. \n\nI came on a sunday 730pm. Was really hoping to order the fried chicken, but a","useful":2,"cool":0},"LNEisYAx4-20OpMsM6jnkQ":{"text":"I have eaten at amazing restaurants (in L.A., San Francisco, Chicago, etc) and was looking","useful":0,"cool":0},"FKIJZFY_z9JOxm4dLKlhMw":{"text":"Emerils lived up to the name and legacy!  We came here for our last meal in Nola and it wa","useful":0,"cool":0},"V_khoCa62j1ymoXk-6FltA":{"text":"Hate the personality if you must but, goddamn, this guy runs a rockin' restaurant.\n\nThe fo","useful":0,"cool":0},"TTG6lzh27iZD7toymsDA3g":{"text":"This was the chosen dinner stop for our third night in NOLA. Having had great meals the tw","useful":1,"cool":1},"kHH2cU19OLZjRYGfbJgMhQ":{"text":"We were completely baffled by our experience at Emeril's, since both the food & the servic","useful":3,"cool":0},"mok2WxcNT3KTB_VRQ3VH4Q":{"text":"I went to Emeril's with a group of 5 other girls on a recent vacation to New Orleans.  We ","useful":0,"cool":0},"-_AjzZtHnxglR4t_ewlZcA":{"text":"Delmonico will always be my favorite Emeril restaurant in the city, but a group of us went","useful":4,"cool":4},"Zw69ZTUO9ccjx-hlg72Ypw":{"text":"We were not prepared for the best fried chicken we have ever had! Especially when we went ","useful":1,"cool":0},"054ncsCPoyk2H-19yS-yWQ":{"text":"This may be the best prix fixe lunch in NOLA.  We did not have time this trip to do Emeril","useful":0,"cool":0},"C-KvyU_6t89EDtVFiewcHQ":{"text":"Bbq shrimp. Duck wings. Appalachian and euphoria cheeses. Lobster tchoup. Pear flower.  Yu","useful":0,"cool":0},"APKlilklmFZfd-CsBZBVUg":{"text":"We decide we needed to have a nice dinner out while visiting NOLA & choose this place & bo","useful":12,"cool":6},"dzZJWNbfQcbRycyFq6mUBQ":{"text":"One of the best meals I have ever had in my life- definitely eat there if you are ever in ","useful":0,"cool":0},"LJ2LOXVYGEBjzD7UQiPZ2A":{"text":"Impeccable service and food! I had the black squid ink shrimp pasta which was incredible! ","useful":0,"cool":0},"GK2NMuzjhjM4bL_zywGzng":{"text":"Not  a fan!\nWe didn't have a reservation. Seated nicely at the chefs counter, which is one","useful":0,"cool":0},"__eHmrBJmCb5UueFBCRnMw":{"text":"Double cut pork chop with mole sauce: HUGE. Pretty sure I could have fed myself for a week","useful":0,"cool":0},"d4tsLWEHjR7woFIzHIEzIg":{"text":"Just returned from New Orleans and Emeril's was one of 3 excellent dinner locations. We al","useful":1,"cool":0},"DUSk-GviVbcoKjrleS1mTQ":{"text":"Two amazing dinners in two nights.  I never go to the same restaurant twice when visiting ","useful":0,"cool":0},"bG66CBFsvzjPZHM0e-ep6A":{"text":"Thanks Herman for great dining experience.  Fried chicken with Mac and cheese and the wagy","useful":1,"cool":0},"mNYhYNv5GMe1Do6wy_rI4Q":{"text":"My wife has been a huge influence on me eating at some classy restaurants.  The first time","useful":8,"cool":2},"EedauP84Rz2aOr85zWbnMg":{"text":"I had high expectations for this place and they were pretty much all fulfilled! Delicious,","useful":0,"cool":0},"5YaL8oygs-pSBMTQ8dZHtw":{"text":"First time in NOLA and visiting Emeril's has been on bucket list. BBQ shrimp was wonderful","useful":0,"cool":0},"mbNapPp160oUckw2zDo1hA":{"text":"I have been a huge fan of Emeril from his first show. I have made a multitude of dishes fr","useful":0,"cool":0},"Wx5BXoWIjsjq1ey-EW2lHw":{"text":"Stellar service\nOne of the best dinners yet (my meal - drum with shoestring taters and gri","useful":0,"cool":0},"qg3bz0q6dbnin2buZCbHEg":{"text":"Quality service, great atmosphere, and outstanding food and drinks. The andouille crusted ","useful":0,"cool":0},"ll13uZjImUENs3Tj1OV1Wg":{"text":"My husband and I celebrated our 10 year anniversary at Emeril's and could not have been ha","useful":0,"cool":0},"xWtX4SVpuMR-VrVdbYXiqw":{"text":"The ambiance, staff, drinks and FOOD are incredible. It is not a hockey tourist trap. It's","useful":0,"cool":0},"keyD_eG2G-b6_3ZnVmbGIA":{"text":"Super delicious! My friend and I didn't make a reservation, but we were able to sit in the","useful":1,"cool":0},"XkxQnePRRyqssy4g_Eou6Q":{"text":"This was an amazing meal.  I ordered the 3 course meal. I was sitting at the bar over look","useful":0,"cool":0},"7CZuruAtJJjehccEywGoxA":{"text":"I went with a group of 7 to the Emeril's on Tchoupitoulas Street for lunch.  I must admit,","useful":2,"cool":1},"plGEpjnSXGDeqkh732U24w":{"text":"Sat at bar for a quick lunch while wifey had girl time with friend). Have been to the Las ","useful":0,"cool":0},"LEh1NzIsPEgOspi9EbpP3Q":{"text":"Good food though not totally up to expectations.   The restaurant itself is very noisy.  O","useful":0,"cool":0},"ZfbQYaEXwG11hABwmnO7Ig":{"text":"Visiting New Orleans for the first time...had to go to Emeril's...and \"Bam\", it was delici","useful":0,"cool":0},"yg0fphsBV84Tti6POo2-tw":{"text":"My family and I recently visited New Orleans for the first time. My husband and I decided ","useful":0,"cool":0},"Vl-y2tpZxlV4TeSFgWUEsA":{"text":"We hit Emeril's for lunch (we ran out of touristy things to do in the FQ, so we wandered t","useful":1,"cool":0},"kJeaf1dCsW8wpnY03CIjgw":{"text":"Nice place to celebrate special occasion or business dinner.  Elegant decor and attentive ","useful":0,"cool":0},"atrrHIB5ArO_5kYJQWVQgQ":{"text":"Had lunch here yesterday and what a great time it was!!! Had calamari,chicken & waffles , ","useful":1,"cool":0},"BAioTlWvXKY8EKrtS7Fbqg":{"text":"We were a group of five in from Boston and we all loved Emeril's New Orleans!!! From the w","useful":0,"cool":0},"sKYc9sFfVCyrXTUl41dIQg":{"text":"First of all, I need to say that the fact that we got to dine at the kitchen counter defin","useful":0,"cool":0},"CTneqaiKb5Z25PGWMwigLA":{"text":"Emeril's New Orleans the flagship for lunch. After being blown away at NOLA, I was excited","useful":2,"cool":0},"K8UHZDpMZblJmWfivLi2ew":{"text":"Bam.....well, not in a good way.   Not impressed at all.  Went to Mr. B's last night, and ","useful":2,"cool":0},"jAynlaC7w5fvRnZFKH69gQ":{"text":"This is one of the best restaurants I have ever ate at. This is my second time eating here","useful":0,"cool":0},"tNEGsDuL9V7Qqhb8woNkyA":{"text":"Sat down and was served cold and hard bread. Sent it back. Ordered the bone-in fillet and ","useful":0,"cool":0},"YE3bf87PZBoZ_TK9Ex_vTw":{"text":"delicious food; rich flavors; EXCELLENT service.  A bit on the pricey side, but whatever. ","useful":0,"cool":0},"ooHiANSDVWc5S85If2GoCg":{"text":"Awesome! Service was great, no complaints lunch was perfect, Order whatever on the menu an","useful":0,"cool":0},"kzBU-KVc1eAowhNIsLJZiA":{"text":"Ah, everything was so good here! This is such a fun and open restaurant. Although it might","useful":1,"cool":1},"N6N22ReQRV_bLK7EY-vfEg":{"text":"I enjoyed lunch at Emeril's while in NOLA for homecoming festivities at Xavier University.","useful":0,"cool":0},"jhiwf0q01rjRD9J21g92wA":{"text":"Finally decided to try this after receiving a gift certificate from a friend.  The service","useful":0,"cool":0},"GncbsE_jpsuadSAqLqIACQ":{"text":"I must be fair. My dinner at Emeril's, while expensive was truly an awesome dining experie","useful":0,"cool":0},"YJyG6hpUXSRPWdfNrbumQA":{"text":"Outstanding food and potions make the price worth it!  Service is top notch both professio","useful":0,"cool":0},"kI_7cOk9Z4JMRyF19A5OfA":{"text":"Visiting NO we had a group reservation at Emerils flagship.  We started with apps.  Very u","useful":0,"cool":0},"f7SKc4sGj5Pz0uWPy43apA":{"text":"We ordered from the Lunch Menu. I am only rating Emeril's  three stars because of the \" Ch","useful":0,"cool":0},"nAiToT1L4yD0iwQEYp_ljg":{"text":"Went for my husbands birthday, and every was amazing !! Our waiter was great ( I wish I co","useful":1,"cool":0},"nwTwKShhrMaAvzSUGa8NCg":{"text":"The duck is amazing, I mean so AMAZING!!!  The crawfish app is a must try.  When I come ba","useful":0,"cool":0},"mg1zzIRZOYi_zn9jgYlx8A":{"text":"One of the best dining experiences I have had in a long time. Amazing service with a knowl","useful":0,"cool":0},"eYJQHI-pblFASSfaU0bb-Q":{"text":"Excellent food and service! This restaurant came highly recommended and I was very pleased","useful":0,"cool":0},"kkzlWdDqkaCiy1IplVTzUw":{"text":"Nice restaurant, the prices weren't that bad, but the food was no were what I would call a","useful":0,"cool":0},"I_g_xbhgtux4hmk4Dni3gw":{"text":"Hands down the best service ever at any restaurant. The water was never low, plates never ","useful":0,"cool":0},"V7efVQ2OtUwIBw39FyQYAA":{"text":"Excellent service, fabulous rib eye, fantastic chocolate bread pudding, and outstanding wi","useful":0,"cool":0},"UqH46mvzMoS9aSv1yvD1zQ":{"text":"I hands down, without a doubt, give Emeril's 5 stars. I have never had a bad meal here. Yo","useful":0,"cool":0},"rSPTkxXDOeOKa6K7GI34cg":{"text":"The decor and ambiance were great and there was very attentive service.  Unfortunately, wi","useful":1,"cool":1},"xT-K5-IQpyhDVh27p7EUCg":{"text":"Went here for lunch while in NOLA and got the Chicken and Waffles and the burger. Both wer","useful":0,"cool":0},"SVcHYMQHXzPJo37amiw12w":{"text":"Was really excited to eat at Emerils. Husband is not a foodie and being in NOLA, we though","useful":0,"cool":0},"qn6ezTla7UO0_bC5BG1ZuA":{"text":"Came here for dinner and was extremely impressed by the food and service! I am a huge Emer","useful":0,"cool":0},"X9X9oj0qCN5ZWvRMX23YHg":{"text":"Fancy service. Elegant dishes. Misleading names. This reviews is on the truffle fried chic","useful":0,"cool":0},"_24y0DpV3dTc1qP-M8LAmA":{"text":"Outstanding meal, great service glad we had a chance to enjoy this experience. Checking ou","useful":0,"cool":0},"Ezkyp-4QbrupZ1S3NSAYvQ":{"text":"Disclaimer: this review is for the banana cream pie only. \n\nI found out later we got there","useful":1,"cool":0},"T0da1VUb8yARZt_lHCinQw":{"text":"The list of entrees was relatively short, which I like since there's a better chance of su","useful":1,"cool":0},"sXSA9WqysowmiIFo2mi1Vg":{"text":"With this visit, we've now been to all three of Emeril's New Orleans locations.  This and ","useful":0,"cool":0},"f6YnO5vxk_IIt9kwfuIeUg":{"text":"Oh !! believe the hype. Absolutely s wonder experience.. fine dining at its best. Will def","useful":0,"cool":0},"_BQY2I2kaNjNcx9QIErPqQ":{"text":"I am so impressed by Emeril's restaurants in NOLA.\n\nWe came here for lunch and had a pre-f","useful":1,"cool":1},"4U8P6KMA5rxVaFzBdoULMQ":{"text":"Had lived in New Orleans prior and had never once been. Came for a visit and went last nig","useful":1,"cool":0},"4czQuXY7tt35xko9fVgbUQ":{"text":"Ordered the Andouile Crusted Drum, really mild, flaky, juicy fish with great outer crunch,","useful":0,"cool":0},"d055MzBOWdMJqY7GMqKpsQ":{"text":"We had lunch here today and loved every bite.  The food and service were both excellent.  ","useful":0,"cool":0},"RV2EJ_T6eHXq8LSkCr-oeA":{"text":"Emeril himself would be very proud of how his restaurant is being run. The service is very","useful":0,"cool":0},"xKrR9EWCR-EBRpx2OxMw_A":{"text":"Very good service, decent food, nice environment for a fancy meal.\n\nWe stopped by a bit ea","useful":0,"cool":0},"pxDkiBQMmu1aFhkxSdUV_A":{"text":"Service is outstanding. We have 2 waiters waiting our tables. Drinks always refilled. The ","useful":0,"cool":0},"cv6GLeGxVIrA-VF27ow4KA":{"text":"Great food, excellent service! Fried mozzarella ball, great bread, duck drum sticks, lamb ","useful":0,"cool":0},"Rhm1KIWJBtal9KvExUMd2A":{"text":"the lunch express menu is a steal.  i love the atmosphere and was one of the best dining e","useful":1,"cool":0},"xdShDd3wQtEldTOhUJ3QtQ":{"text":"This place rocks!  \n\n We had the fried chicken that is covered in truffle pate and  deeeee","useful":1,"cool":0},"QjvIospNSYN551NUxl5YnQ":{"text":"You know how Paris Hilton basically has no talent and yet she's famous? That's what I thou","useful":3,"cool":0},"DeWGJUvtxUSeS4Z_TK_5qQ":{"text":"Amazing staff. The cooks were fun to watch. Entrées amazing. Desserts to die for. Ambience","useful":0,"cool":0},"2Vf5cNNqtaTdRRRBYTP7mQ":{"text":"5 of us dined here tonight and it was a wonderful experience.  All food was perfectly prep","useful":0,"cool":0},"GApKu45jMjMM6bDH1oPYjg":{"text":"I had dinner here during Mardi Gras weekend; the service was impeccable and the food was g","useful":0,"cool":0},"EXJyPu1SP50yD2AFSb4dvg":{"text":"What a nice restaurant! It has what you want..good-to-great food, excellent service and qu","useful":0,"cool":0},"HI1Wje7u0uSapaad7QobBQ":{"text":"I came here during the New Orleans Coolinary special which offers high end restaurant menu","useful":0,"cool":0},"m4QqRU0G3w6kgIh_qNyw1w":{"text":"I went with a large group of 50+ and dined on a fixed menu. The atmosphere was as expected","useful":0,"cool":0},"XZPTurdp2FIxL7ZFJK9t2g":{"text":"Came for a friend's Bday dinner.  The entire atmosphere was as upscale as you would imagin","useful":1,"cool":0},"FrooMKKWZ2eP-XcKCKsvjw":{"text":"So, I was recently here for an interview and it was delicious. I had some tasty gumbo to s","useful":0,"cool":0},"iZgjR3sZSZV3hfQtOsIG6A":{"text":"Best service I have probably ever had at a restaurant. The duck entree and fried chicken e","useful":0,"cool":0},"36s7C7sDwAB9sjILX_Wdyw":{"text":"One of the best food and dining experiences I have ever had. From the time we entered the ","useful":0,"cool":1},"7G9XLfGU-F_FF1YOaR697w":{"text":"Dining with a flair! We came for an anniversary lunch and had a lovely meal with one blip.","useful":4,"cool":3},"HFUhmeYorlic84p-yH336w":{"text":"We had a fabulous experience at Emeril's.  We came just for dessert and coffee because my ","useful":0,"cool":0},"6U-U8gRX1vMOPZE0NqNj1A":{"text":"I have put off eating at an Emerils restaurant the entire three years I have lived here. I","useful":1,"cool":0},"SxD467YU16L-TW5K3pYn2Q":{"text":"Several visits never disappoints. Wine list is very extensive. Service is outstanding room","useful":0,"cool":0},"fuX3fcVfJfNw2_gXXqAEhw":{"text":"I have been here a few  times and they don't get the simple things right. They bring out t","useful":0,"cool":0},"FX5c3PxJrU5z6WBH50laPA":{"text":"Awesome food! Clearly a little bit of a tourist trap, but for all the right reasons. I had","useful":1,"cool":1},"uZPFDAg0DkLNRcM9m_LFyw":{"text":"Quick note before you read my review: I am from San Francisco therefore my style and taste","useful":2,"cool":0},"ndKjPfIMNosnbwe1IxnmJA":{"text":"Dessert is what you come for. And I've come JUST for the dessert. Banana cream pie hands d","useful":1,"cool":0},"CCo4_RkiBNFi4bvsUH43Sw":{"text":"I visited he recently and although I enjoyed it I was not blown away.  The service was ama","useful":0,"cool":0},"J89w2c2IqWAC_SgkUw9RDg":{"text":"I'm in New Orlean's for business and had to do something touristy, so I figured I would tr","useful":0,"cool":0},"OfyH6Kh9TXy0sEkKcig4aA":{"text":"The sausage appetizer had some awakening flavors. The Strip Steak was perfectly cooked and","useful":0,"cool":0},"NRe0juhXylgCWn98ko5WzA":{"text":"Horrible experience!\nWe showed up without a reservation. Hostess said to wait at the bar -","useful":1,"cool":0},"oN8a_TO6Sy6BM_JRvVaJ3Q":{"text":"My wife and I literally walked in off the street without reservations.  Granted it was aft","useful":0,"cool":1},"L1YEl18ivXbHX5_lvx81AA":{"text":"Loved it.  My pork chop was probably the best I've ever had.  Bannana cream pie, again, be","useful":0,"cool":0},"iZG1S1RiJuy9DbnE86uBvg":{"text":"We made reservations and got a great table. Wonderful food from the salad to the barbecue ","useful":0,"cool":0},"Pw6SGikVEQS6CK_BVez-Jg":{"text":"Great food and outstanding service.  They treated us like royalty. The attention to detail","useful":0,"cool":0},"ylcm3D98jMDPaxvOATxnfg":{"text":"Bam! Okay... I must be the 400th wise acre to over use that one. But this place seriously ","useful":0,"cool":0},"xZZeJXS_IBdHN-a2TV7-pA":{"text":"Emeril's is a very fitting place for my 700th review.\n\nEver since Emeril opened this resta","useful":5,"cool":5},"-s2J7cSuFZveDuqOQYAHLQ":{"text":"Sat at the chef's table so had the opportunity to taste a variety of tasty dishes both on ","useful":0,"cool":1},"k7ovBagDidfeN5x7Zt6Ang":{"text":"Food here was great and the service was on point. I had the scallops and am happy to repor","useful":0,"cool":0},"QGFnO5VqdOJPkixSHJ9w1g":{"text":"My wife, two adult children, and I had dinner at Emeril's New Orleans around a month ago. ","useful":0,"cool":0},"gH2GQfgD8Ea5WWvZG1UMWA":{"text":"Great great service!! The banana cream pie is amazing! Sherry and Larry are awesome and ga","useful":0,"cool":0},"LqCZrEXyYMlZAP9uN8Fq5g":{"text":"Can't say enough good things about the drinks, food and service at this place. The drinks ","useful":0,"cool":0},"I4bzyjdWBZRRwK4lChLq_g":{"text":"My first visit to emeralds was a wonderful experience. The waiter Brandon, made it super n","useful":0,"cool":0},"HswTsNknS7xAp_p7XWp_PQ":{"text":"Ambience was nice, but our waiter could have been replaced by a cordial robot, however Tor","useful":0,"cool":0},"mveSm0pOQaDgp2teBf0GgQ":{"text":"Emeril's, in brief...\n\nIt's high-end cuisine, with reasonable prices, with a loud and fun ","useful":2,"cool":1},"nrtX7J_AwEM4ZuY3tUmJ-w":{"text":"I went to Emeril's Nola and wanted to get some dessert for takeout to bring on the plane f","useful":0,"cool":0},"ZVqEjn_pWr2Wulf321bdog":{"text":"I had the pork chop with tamarind sauce over sweet potoatoes. Amazing!!!! Darryl was our s","useful":0,"cool":0},"geFmgnUco7gDrSKU3Zwi4Q":{"text":"Great service great food worth the money loved it if you come in New Orleans you have to g","useful":0,"cool":0},"9l03pZzykB0RwJuj0iiv3Q":{"text":"Wonderful decor, perfect lighting. Great food!\n\nI ordered the White Bolognese. It was the ","useful":0,"cool":0},"Z-Zu5417Oe3cGmyvnWCXag":{"text":"I'm giving it 5 stars.\n\nWe visited NOLA in August when it was 95 degrees and like 99% humi","useful":1,"cool":0},"1yRVZ6G7ylxAM8cS7ao4Tw":{"text":"Came here with high expectation but left disappointed. The service was average and the foo","useful":2,"cool":0},"Tr2B56A5btPsZa5z27sZ8g":{"text":"Best meal in New Orleans hands down. Ordered the fried chicken, bbq shrimp, kale salad, ar","useful":1,"cool":0},"ZtAA7BkGNMX4bVvpPN3X8g":{"text":"My Girlfriend and I made this first place we ate on our trip to New Orleans. It's a beauti","useful":0,"cool":0},"HXfAfSgwAJtsjGtGowNOjQ":{"text":"Poor service. My wife has celiacs and must eat GF. As u can expect, we told the hostes, an","useful":0,"cool":0},"DWII_EOIrIKSKGa9EYofGA":{"text":"How have I never reviewed this place? It's like my favorite restaurant. I've been here man","useful":6,"cool":3},"u3DeY_17M3NEZArawvAtyA":{"text":"My babe and I arrived at were seated at a great table by the grill where we could check ou","useful":31,"cool":30},"U1Z3g9o6rnV-yK3d4xtbSg":{"text":"Good food and service. Came here for a conference dinner, about 35 people. Food came out t","useful":0,"cool":0},"lkEbk3a6vI-Ii8g-y4dDrQ":{"text":"Great service. The drum was incredible but the desserts were just OK. I would still recomm","useful":0,"cool":0},"wVIh0gsIsDXMqMdVjvF_Cw":{"text":"The meal started off with a sweet potato roll, a potato roll, and a corn bread with sugar ","useful":4,"cool":1},"t_Be2zrcBWk78FCoKdZ0YQ":{"text":"At first we wanted to book the reservation at Commanders to celebrate my birthday. However","useful":3,"cool":2},"5lmg-emMnuz6wzhoskP0NA":{"text":"For food, this is a definite 5 star experience, but the service weighed things down starti","useful":0,"cool":0},"JNGCP3L0Uv6KfqS0U1va6Q":{"text":"Wow, just freaking WOW. This place may be owned by a famous chef and the experience rarely","useful":0,"cool":0},"Bo41WQaZBZOvQdansh8BAA":{"text":"On my trip to New Orleans for the Sugar Bowl it just so happened to be that we ended up st","useful":3,"cool":2},"jOR36k4FndUqVFIzBYJbRg":{"text":"A must go to if your in New Orleans. Dinner scallops are on point. Fun location for aftern","useful":0,"cool":0},"5kXJ95h5LOoWTf6CgPQGMA":{"text":"I was prepared to be disappointed - I've been in his other restaurants in Las Vegas and Or","useful":0,"cool":0},"mVmXvd5_lEiOczjX8EP5KQ":{"text":"Good food. Classic Emeril style. Severs were very attentive. Pork dish will \nmake me go ba","useful":0,"cool":0},"Wx-J9wgFVoW37baA2ymeqw":{"text":"The wine appetizers and food were over-the-top. Everything was served fresh and prepared e","useful":1,"cool":1},"K9H2ifoOlPt051yAtMtaUw":{"text":"Bam! If you've seen Emeril on tv you get what I'm saying. Anyways... the food here was ver","useful":0,"cool":0},"3MMnHq7QKtY0TeLl-0G0tQ":{"text":"Last meal on our vacation was Emeril's. Enjoyed an amazing lunch! Chorizo po boy, swordfis","useful":1,"cool":0},"4b82ZA6CMmTjpx4BeQEGbQ":{"text":"In nola for a convention, made reservations a couple of weeks out.  Good thing as the plac","useful":0,"cool":0},"zOPwVQi6y3rI77OEyuHKoQ":{"text":"Oh my goodness! I wish I could have sampled everything on the menu! From the appetizer to ","useful":0,"cool":0},"r0sWfEBUpCBPG1nzvUuHUA":{"text":"The service was excellent. The food was just above average; not as good as I'd hoped for. ","useful":0,"cool":0},"bLd6Wgz_k0DTMfmWdNbsng":{"text":"Excellent service...I expected more from the food but I think I was just overly excited by","useful":0,"cool":0},"lxJiMk-NgbrElHOdM_BqaA":{"text":"We have been regular visitors to New Orleans since my law school days here.  Emeril's neve","useful":0,"cool":0},"APR2ocO2kE77iXexx-93iA":{"text":"Service was excellent and attentive throughout the meal and the head waiter was personable","useful":1,"cool":0},"91NnyzrEK8stP4zukoYssA":{"text":"I came here on a Tuesday night with four other peeps.  We were seated promptly without any","useful":0,"cool":0},"HCPxZu-3a0RVLPSBk8q01Q":{"text":"Really wonderful place.  Top notice service, tasty menu, great location.  Not cheap but qu","useful":1,"cool":0},"w74pCgA5rkBPXASUDYeezA":{"text":"Very attentive service in a pretty dining room.  However, an overall sense of OK, not wow.","useful":1,"cool":0},"gWkydC8Q_NUvO5SSQjSQrA":{"text":"I will begin with the servers were outstanding and my wife enjoyed her dinner. I ordered s","useful":0,"cool":0},"wmhcR6P8n0zSJbJa3wzSWw":{"text":"Had the chance to visit Emeril's for the first time since before Hurricane Katrina and we ","useful":0,"cool":0},"LN8tuCQBD5zptiWwS897Pg":{"text":"There are three emerils restaurants. We chose this one. The place was beautiful. The serve","useful":1,"cool":1},"V2C3CZtp99PEaWx3bFCDvA":{"text":"I went to Emerils New Orleans last night Saturday 6PM. I don't normally eat out at this ti","useful":1,"cool":0},"6lX-QmdfttcPVR1zcTWbVA":{"text":"The pork was amazing. It was the most softest and most pork I've ever eaten. $35. Worth it","useful":0,"cool":0},"KtZgLkbvsEJ7iH-5Nw42Vw":{"text":"short the 5th star due to the slow pace of service (granted, we were a big party of 15 peo","useful":1,"cool":3},"JjqE0ru7UvuTPZAkms0LDw":{"text":"Less hectic than NOLA but just as good food and service. Great place for business dinner.","useful":0,"cool":0},"nDDlv7I47LQ2kDJK4Q7lTg":{"text":"This is a restaurant that I visit every time I vacation in New Orleans.  The service and f","useful":0,"cool":0},"aERR4zZ5iWKLaQdj9mYpfA":{"text":"Easy walk from the JW Marriott. We LOVED this restaurant. We had a nice view of the kitche","useful":0,"cool":2},"zTR4V2V-tfNJ_Dik-LuU2Q":{"text":"Overall: -2 Stars. NOT recommended.\n\nFood: -2 Stars.\nWell... they literally ran out of foo","useful":0,"cool":0},"wsVlpDm1C41oe0tl72hLqg":{"text":"Wtf!!!  This was the worst experience of my life!  Let me start with good because it will ","useful":1,"cool":0},"XbJxfgPpYM-wOGWmCZwLiQ":{"text":"Thos might be the best dam meal ive had.  The dessert was lack luster after such a great m","useful":0,"cool":0},"cn3-Kl2gddCJxdROh14i_w":{"text":"If I could give negative stars...I would. First off u can def get better more authentic fo","useful":1,"cool":0},"suYTZIrolk1L8o9V4NnxOQ":{"text":"My wife and I did not make reservations ahead of time and were surprised that we were able","useful":1,"cool":0},"K9mIxefEp118UQw1C34n4Q":{"text":"This was probably the best meal I have ever had!!! \n\nWe took my dad here for his 50th birt","useful":1,"cool":2},"bUZs5iuCwf2Vv7xtCFlhWA":{"text":"Out of all of the places to visit, this place was the one I was the most excited about. Em","useful":0,"cool":0},"7gZ-nWpyt0qD9IACNJL_FQ":{"text":"A bit over priced but the food and service was amazing. If you want to try a restaurant by","useful":0,"cool":0},"3JfU5EgH0o3mrrvzbXZksg":{"text":"Emeril's is one of those places that I get frustrated at Yelp and think... its 2016.... wh","useful":0,"cool":0},"rJzdX5lDuucQ1fkNTuMaFA":{"text":"When visiting Emeril's in New Orleans, I confess I was a bit skeptical, since Lagasse seem","useful":1,"cool":0},"i2KBDkKqEZqiSZlT0ZXcxw":{"text":"Good food. Nice setting. Very friendly and helpful staff. The banana cream pie is amazing!","useful":0,"cool":0},"j3MnXaVrcIpkHzvC5GwwBQ":{"text":"My husband has been dreaming of going to Emeril's since he started watching him create cre","useful":0,"cool":0},"GnRQTf2ZzEB9XpC_lkCUxA":{"text":"I took my friend here for her birthday recently. Staff was very sweet!! Porkchop was very ","useful":0,"cool":0},"G1kz6SDrr06PHMTkBhovnw":{"text":"Pretty swanky place to eat dinner solo, but the Pecan crusted drum is as good as advertise","useful":0,"cool":0},"7X2VGGZDSZjz6OAPvU2Hfw":{"text":"The wait staff was very friendly, helpful, and quick. The food was a little disappointing,","useful":0,"cool":0},"ic1TnuQmteLguoRnnt7WTg":{"text":"Great service, relaxed ambience and fantastic food. I had the gumbo of the day which was f","useful":0,"cool":0},"X_knj0H1ZBG759NhWuGtKA":{"text":"I've always wanted to go to one of Emeril's restaurants.  It was everything I expected and","useful":0,"cool":0},"iD8HgH9KGQl46tT1N-UvMQ":{"text":"Had one night to go out in New Orleans and we went with Emeril's.\n\nThe service was top not","useful":1,"cool":0},"R-CNkhvLi-Ooi0_XBagsfw":{"text":"I didn't like it...plain and simple. When we first made our reservations, I looked over th","useful":1,"cool":0},"T_DAmlPujfI8Pd62B58EKg":{"text":"Gosh where to start?! The food is fabulous! I haven't been an Emril's TV fan and not a fan","useful":2,"cool":0},"tEuCvyfnC5c9fYbg0fwikA":{"text":"Duck Milanese was Devine! Enjoyed the restaurant, our adorable and very knowledgeable serv","useful":0,"cool":0},"8eivwOCldM0Ba9cinoHKGg":{"text":"Amazing experience! They have valet parking which was a great start to getting into the re","useful":0,"cool":0},"FvIdgmtnZhi6YmqHJYxFsQ":{"text":"Had another remarkable meal last night chez Emeril.  The truffled fried chicken was delici","useful":0,"cool":0},"YyxVoSc4Bc-Mucexz4CmTg":{"text":"Solid 4 stars. Although the restaurant has a formal look and feel to it, I really apprecia","useful":0,"cool":0},"8vF747geaSiFp3zrOWBj-Q":{"text":"Another fun time sitting at the Chefs bar watching passionate kitchen staff doing what the","useful":0,"cool":0},"UN8ET9Ckqol5UDmyYbEeYg":{"text":"Food was fantastic. It definitely lived up to the brand name. I had the duck and it was pe","useful":0,"cool":0},"OELImD9JfhNERyZpyK95CQ":{"text":"After our New Orleans vacation was unexpectedly extended by two days we quickly jumped on ","useful":0,"cool":0},"IUMfE9UB15opJsjdTUNB5g":{"text":"This restaurant is truly as good as it gets! I was with a group of 11 people with hard to ","useful":0,"cool":0},"OSKAvoBiUt-rtFgdH8xMJg":{"text":"Kitchen was sloooooow.  \nWent here on my birthday while we were visiting Jazz fest.  The w","useful":0,"cool":0},"0GvlXyU6s1lLUlS4bCpeWA":{"text":"I hate Emeril Live and I am glad it was canceled.  And I didn't want to like this place.  ","useful":0,"cool":0},"8HeCB3frHTckDX8xjb2TPw":{"text":"My husband and I visited New Orleans for the first time and wanted to try Commander's Pala","useful":3,"cool":1},"fhMPXGTzvfLF0Madh-lsrA":{"text":"We had a great dinner experience here recently on my 2nd trip to New Orleans, however, on ","useful":1,"cool":1},"07yvPHSeD-DhkDkxsB8NSg":{"text":"This is my first review on yelp and I guess I'll start with one of NOLA's more famous plac","useful":0,"cool":0},"a30qcA0fC3HcbjBK5k-2PQ":{"text":"being first time in NOLA had to try Emril's cocktails nice wine list good but expensive se","useful":0,"cool":0},"Lb25Ppef6vtekrv7l1Uzkg":{"text":"The nachos special was wonderful! Meals were heavy which is why we enjoyed his other tapas","useful":0,"cool":0},"RBi7GO7kZc853RwOtIfPVg":{"text":"Had high expectations that were no where close to being met. My husband enjoyed his food b","useful":1,"cool":0},"sCyaxb-A3mKa0x9xFddS5Q":{"text":"My boyfriend and I went here for his birthday and I have to say the service was what wow'd","useful":0,"cool":0},"jdsnQwdMVIk1Qyk4SJrKbw":{"text":"This was our first time here, and we thoroughly enjoyed our experience. We started off the","useful":0,"cool":0},"Rv2Y9TCmKJGWFdKc8Su9NQ":{"text":"I hate to admit that I avoided eating here for years after the flippin' fantastic meal I h","useful":1,"cool":0},"lDTyZEyh9Njnl0eE-aTAHA":{"text":"I came here with a group of 12 people. Usually when the party is this large you get all so","useful":0,"cool":0},"MBtGX3qdfdvuRvXZNkiHwQ":{"text":"Im basing my review on the FOOD.  Service spot on 5. Food quality weak at best 1. My sons ","useful":0,"cool":0},"BCb555Ht7Aa4RFIDV9k92w":{"text":"This experience was really disappointing. I don't understand how there was a service team ","useful":0,"cool":0},"T8LbWK-0q481nxh8Q88U4Q":{"text":"Been there multiple times and it's been worth every penny.  The pork chop is out of this w","useful":0,"cool":0},"1_hJ4Gv4b8hVB-duvNTFcA":{"text":"This place is awesome. The food is fantastic. I went with a friend during lunch, I ordered","useful":0,"cool":0},"qUB8egUMj-CXgiZJNHth4A":{"text":"We found the food to be pretty good, but ultimately nothing special and therefore somewhat","useful":0,"cool":1},"JKK2AoUcxVNFst8VL_9bnw":{"text":"Wife took me here for Father's day dinner. I've eaten at the Las Vegas location and thorou","useful":1,"cool":0},"bKrYdJlK3w5wr9-PyAcKsg":{"text":"We picked Emerils as we wanted a nice special dinner during jazzfest and we were disappoin","useful":0,"cool":0},"g6ZMeNH--Gmf-dXY732rSQ":{"text":"High quality, excellently prepared food without the essence of Emeril.\n\nWe ate dinner here","useful":0,"cool":0},"lMKtL_6za9liSJ5YhEyTKw":{"text":"The best food is something that makes your mouth explode but you don't know what was put i","useful":0,"cool":0},"g0atCQusAXCWKY-9iUibSQ":{"text":"Service was very good.  Would prefer for the bread basket to be left on the table instead ","useful":0,"cool":0},"AtcR8C8CZvsOXV9id4Ep1Q":{"text":"Neat place, nice service and big open kitchen. Foods are good, Seafood soup is good. And y","useful":0,"cool":0},"Um-mnbUbxpUeAiuSriRIAA":{"text":"So glad my friend said he wanted to try this place.  We came here for lunch and the staff ","useful":0,"cool":0},"_Ji04mr6ZuRe8JuvbjSH3g":{"text":"I liked NOLA better, but the open loft atmosphere at this place was gorgeous. The food was","useful":0,"cool":0},"91y-RWVHcDw0lr8GijBJuQ":{"text":"One of the best restaurant experiences in New Orleans. Loved watching the chefs, and seein","useful":0,"cool":0},"Y-Sc3ZH9_9QXTmCbtS5wJA":{"text":"Great dinner at Emeril's last night.  There were 4 in our group.  Each person had a differ","useful":0,"cool":0},"huaU99MF52lyTPRVdWp4Ew":{"text":"Our family of 5 had a late dinner here after an afternoon in the Garden District. Excellen","useful":0,"cool":0},"nDb0FSvslCnMO3FpnBDVGw":{"text":"What a treat!  They said you had to be super dressed up btw, but people were chillin' in t","useful":1,"cool":1},"AIVVeq0mpNtqp8Z7E_ojYA":{"text":"As I get older I realize more and more that fame is a product all its own, not always the ","useful":2,"cool":2},"LyLwxXr-kH9ohoGZTxBsDw":{"text":"Bartender in out hotel recommended Emerils flagship restaurant for its fried chicken for t","useful":3,"cool":1},"AdqAOlIsfhKl0owQKyRxGg":{"text":"We went to Emeril's for lunch about a week ago when I was in town for a convention; locati","useful":1,"cool":1},"hEQ_KqKEIusxFV9x69F6_w":{"text":"Emeril's is Lagasse's namesake restaurant on Tchoupitoulas in New Orleans. While it is str","useful":1,"cool":1},"72xwe9ZuoNK9HIB-KR4Gdg":{"text":"This was one of the worst meals I have ever eaten. The stuffed clams were awful. The BBQ s","useful":0,"cool":0},"HxguQk5i1NkSW3GSGv5piA":{"text":"Delicious salmon and avocado salad - super fresh. The swordfish entree was amazing and the","useful":0,"cool":0},"36fmP2vIM0YsAG7qRxd4eg":{"text":"I'm in the city of New Orleans and at Emril's restaurant, my expectations for food are und","useful":0,"cool":0},"i6IGGGU6pjkl7yq3chGr8Q":{"text":"Wonderful drump gulf fish...I am from Florida Keys and know good fish.  This was the best.","useful":0,"cool":0},"4gBRzQftV95wVjrVYypcxg":{"text":"First, some will hate the place because it is named for the celebrity chef.  Or grade down","useful":0,"cool":0},"f9MWJIJECbxiDqky7J0Amw":{"text":"Best meal this trip.  Great service with a friendly staff.  \nStarted with the house made s","useful":0,"cool":0},"-qloa5LZbhBPCHMYjYWfqQ":{"text":"My husband and I had a great dinner at Emeril's last weekend. He had the red snapper speci","useful":2,"cool":0},"7fPDUDY_SLkH6ldwaXLcjg":{"text":"For all you foodies out there - sit at the \"food bar\" aka the open kitchen so you can watc","useful":0,"cool":0},"7wM7-rtTQVPqQddKA5HHfg":{"text":"The service here was impeccable. As often as I complain about mediocre service... It was f","useful":0,"cool":0},"4u-bZwRRwFuv2KNVOHw9Zg":{"text":"The food is still pretty good, but the service has fallen into the abyss. The servers we h","useful":0,"cool":0},"tMtkyv8k6wx3jKKwa7rf1g":{"text":"Was so excited to see that Emeril's restaurant was only two blocks from my hotel. I grew u","useful":0,"cool":0},"brsBE-mBqSmwt9TekoWadg":{"text":"The food was good enough and tasty, but certainly not what we expected from all the rave r","useful":0,"cool":0},"BLBb94glgMGZr9W-5juBLQ":{"text":"Service:  2 out of 5 stars.  Devon was our primary server, and he's a bit disappointing.  ","useful":0,"cool":0},"ptsJ9NmfAy3NcdtpfAF8FQ":{"text":"Nice decor and I recommend the banana cream pie. Layered with fresh bananas and chocolate ","useful":0,"cool":0},"UewUm0wsVh6jTQajZGFB8g":{"text":"Group of 7 went to Emerils NOLA the week of Mardi Gras. We were treated like royal guests ","useful":0,"cool":0},"90nVxmcbGVLDni1tG17t7w":{"text":"Emeril's is like what you'd expect but that sort of makes it a disappointment.\n\nMy ladyfri","useful":0,"cool":0},"Q3iErXkzQ4CFBn1uWgG2ww":{"text":"This is not the place for a large group of 10 or more. No one likes to be rushed out howev","useful":0,"cool":0},"5ukTXZHCYM_py3r-7nfVOg":{"text":"Never wanted to go to an Emeril's restaurant because I presumed it was would be overrated ","useful":0,"cool":0},"nXsC36rPDe37CC_da1ZwkQ":{"text":"It was so good that we came back the next day to try some of the items that they were out ","useful":0,"cool":0},"dSe92IhT4KrK6VY6VhAcBw":{"text":"I returned to my buddy Emeril's last week for the second time after my trip 2 years ago. O","useful":1,"cool":0},"EaKX4zSt1nTCurwaL4BqRw":{"text":"Had the best and largest banana creme pie in my life. Was worth the $8 for it. It had a wo","useful":0,"cool":0},"sBiUa2HYP6JiQSSSJ6c6xw":{"text":"I have to say I have always been at least a little bit  smitten by Emeril   Despite all hi","useful":13,"cool":13},"e6DVB5pO4zD0HOJcEr6-cA":{"text":"Got a chance to experience this restaurant during a short trip Mother's Day weekend. Ok. L","useful":2,"cool":0},"J9RkMp7DXZpOvv7l-1fRkA":{"text":"Went with a group for lunch and was less than impressed. Service was OK, not what I would ","useful":0,"cool":0},"gaAh_FGXWf0MIkfC-7T7Jg":{"text":"Arrived here and seem very upscale had 2 gents. Waiting on us. The breads they serve are g","useful":1,"cool":0},"nOg8oYx1Jk_ciTuYAJCS5w":{"text":"I was told all of the specials were unavailable and only 4 of the long list of entrees wer","useful":1,"cool":0},"QTtJkOiNoy4FZGgvyeomzQ":{"text":"Came in for dinner on a Wednesday night with a 6:30pm reservation, and luckily so. Soon af","useful":4,"cool":0},"Z_g0E-1HLh7bGam7W0fGeA":{"text":"The drinks and food were fabulous, but the best part was the incredible attention from the","useful":0,"cool":0},"tTRYDgN2QRHG0MSHJ6H4wQ":{"text":"Touristy. The reputation is inflated. It's not worth the money, the time, and I found the ","useful":0,"cool":0},"IOfk7JZG33-zx3uaqPYXvA":{"text":"SHUT. UP.\n\nEmeril's is synonymous with New Orleans. I know this. When someone's trying to ","useful":0,"cool":1},"MbFCzFFEYq3Dg9K9-GOZOQ":{"text":"Wonderful in every way. The service was great, the atmosphere was busy but not overcrowded","useful":0,"cool":0},"jj7DIbvCUlyig76nBwL9Gg":{"text":"Loved everything!  Special was swordfish over fried green tomatoes. Loved it. This is our ","useful":0,"cool":0},"9yQN4mvYaKRdow1IEYqwwg":{"text":"Was there for lunch last October, great atmosphere, the food was delicious, but I was real","useful":0,"cool":0},"M3YeI--JPvAS8J6bR_plRw":{"text":"Our experience at Emeril's was 5 star for sure. Each of our waiters were very attentive & ","useful":0,"cool":0},"Nz5tiFWftSq4Njq1m6Y6wg":{"text":"This is by far my favorite Chef and Restuarant in New Orleans. I was born and raised in Ne","useful":1,"cool":0},"2sZhMuU1b7iZDlrpmWe7TQ":{"text":"A surprisingly poor experience all around.  The service was slower than molasses on a hard","useful":0,"cool":0},"rp6nidNQAVL61TCYzfMDkA":{"text":"I went to Emeril's Nola and wanted to get some dessert for takeout to bring on the plane f","useful":0,"cool":0},"BQHcf61lBx1n0OqZ2xD26Q":{"text":"This is, by far, the best restaurant/dining experience I have ever had across the USA.  \nT","useful":1,"cool":0},"ldg__WXyVeoCW-9pk8g1JQ":{"text":"This was one of the best dinners I've had in a very long time!  It was also the highlight ","useful":0,"cool":1},"JlYRRtuKH9WuvAjeGGjnXw":{"text":"Sunday night, great crowds and bustling environment. We were a party of 4 but half of our ","useful":0,"cool":0},"eVLAVyoexizRCaAAPiD4kg":{"text":"We had a fantastic experience. The cheese platter is a must. Definitely worth the time and","useful":0,"cool":1},"LBrHTguUFFUWj9By-VIzMw":{"text":"We came here tonight based on a recommendation from family and they did not disappoint. Th","useful":0,"cool":0},"oaLb6QQ-nWnT_2-XmND4JA":{"text":"I go to Emeril's three to four times a year and spend $50-75 per person. Every time I go I","useful":0,"cool":0},"6glTU8aG3evAjc-Ehi0yPg":{"text":"Arrggh!  Bourdain!  I feel like you have thrown me under the bus...\n\nAnthony Bourdain is m","useful":0,"cool":0},"snaGeU8S85i4TASF_GoFXw":{"text":"I am going to be bold and give it 3 stars although it probably dserves 3.5 or even 3.75...","useful":1,"cool":0},"OXyWHkvLAYuUzVYuILcvAw":{"text":"I shy away from celebrity chefs.  Have found that the more \"celebrity\" and the larger the ","useful":0,"cool":0},"HywM-WOFg8jetvzGiKorig":{"text":"The anticipation lived up to the experience. Great service, a beautiful restaurant ,and se","useful":0,"cool":0},"U_wEiURy78oFNq-h0ahsPA":{"text":"This place id definately not what is used to be. Of the 4 meals i had in New Orleans this ","useful":0,"cool":0},"s26iCVDPRlDGGfN7ZHqTnQ":{"text":"So this is THE restaurant of the ones that Emeril owns that I wanted to go to.  I couldn't","useful":0,"cool":0},"NvKvogLkDO9k5Td_tuZcNA":{"text":"This is a very late review as I was here twice well over two months ago. But the experienc","useful":1,"cool":1},"RWmpGX2bkgRWF9FzZLg8jg":{"text":"This was a last-minute lunch choice, and I am SO GLAD I went here! Even though we were dre","useful":2,"cool":2},"iaYDNi-QokDqgrVJs0cXow":{"text":"Most everything was solid here.  Don't bother with the mussel; go for the duck legs.  The ","useful":0,"cool":0},"5m-49qIO76GxHUaxbCIf1Q":{"text":"Does it need to be said that the Banana Cream pie alone makes the trip here worthwhile??  ","useful":1,"cool":0},"0uC73iPZxUHvx_GURx-7ww":{"text":"Emerils lived up to its reputation- it was everything we thought it would be. Service was ","useful":0,"cool":0},"yGjkCqqxy-guMnKfMRmV2g":{"text":"We had a really great experience here as a party of 8 and made a reservation. Service was ","useful":1,"cool":0},"6t3uqXv8qxv-EZIATN87UA":{"text":"Great ambiance, decor, wait staff. The AC was turned up real high though, it was very cold","useful":1,"cool":2},"CswX2jxUBo9YP8Whrk94fQ":{"text":"Absolutely loved this place. It's a really good location on the other side of the city. My","useful":0,"cool":0},"fo4-S9m91rLMilIPYqDU8A":{"text":"we came for lunch to celebrate my daughters graduation from Tulane, and this is a restaura","useful":2,"cool":2},"sZ8HTekqqcElUmFPubwEjg":{"text":"I'm not sure there is anything I can add to the hundreds of other reviews, except just GO!","useful":2,"cool":1},"J5QlvyVm6tMqt1qKZt5F2g":{"text":"The food here was good, but I honestly was expecting to be wowed, and wasn't. The service ","useful":0,"cool":0},"i9dsJiOu4FBsR9hBagLW_A":{"text":"Let me start by saying that this is a high end restaurant where incredible service is to b","useful":0,"cool":0},"Cq2rp6znnCit7-yW-nvN0w":{"text":"My husband and I had our destination wedding in NOLA this New Year's Eve.  The entire wedd","useful":4,"cool":3},"d3_j6YY3FRz3TGVLYwbzGQ":{"text":"To give this restaurant anything less than 5 stars is criminal. THE best, most flavorful f","useful":0,"cool":0},"ipyzboCPJmLuFZa7uJU5IA":{"text":"Fact. Most celebrity chefs are scumbags. \n\nFor example... Paula Deen is a documented racis","useful":1,"cool":2},"4vREx1thwVDvrKDqZsVQnw":{"text":"I went in not expecting much, I'd tried an Emerils before and was just not a fan... that w","useful":0,"cool":0},"WtsEQwHDQrDxHh_LzpB3CQ":{"text":"Amazing lunch!  Great way to finish our trip to NOLA. Couldn't ask for better service  ver","useful":0,"cool":0},"SlFsLeyQL5uPIW53yifgIw":{"text":"After a really bad experience down the street at Cochon we came here as a back up. \n\nWe ha","useful":0,"cool":0},"8exDwdWM69G8ajCtfOAUPQ":{"text":"Had dinner at Emeril's last Sunday. We were looking forward to a fine dining experience an","useful":0,"cool":0},"hbg61pElpoye3BpEayjzYQ":{"text":"Came here today for lunch with friends. I love Emeril and was looking forward to dining at","useful":0,"cool":0},"mNi21zfIT9momB5q7YUsmA":{"text":"Yum I really really enjoyed my dinner here (shrimp and quail entree). It was the first ent","useful":0,"cool":0},"wENKapjrzhVPfRD0socccQ":{"text":"Before I became a Yelp user I visited this restaurant in 2009. I had the opportunity to vi","useful":0,"cool":0},"5Uq_NphsWhW-H5E5oAtCkA":{"text":"Unfortunately, the worst food we had in New Orleans, and also the most expensive. (On our ","useful":0,"cool":0},"QDiJrTrLmirUoHnbOmm04Q":{"text":"I will say the service is impeccable and unmatched. But other than that you have found a d","useful":0,"cool":0},"fsauhhtu8F1Yd0LwfLy2Og":{"text":"I definitely showed up a bit under dressed in my sandles, t-shirt, and shorts.  But was qu","useful":2,"cool":0},"4v9lH2Ncp2oNsefCLNkVog":{"text":"AMAZING!!! The most memorable dining experience I've ever had. The meal was perfect -- fro","useful":0,"cool":0},"1PG9tAs2B-rZeWl5Xgmk8w":{"text":"Amazing experience.  Wandered in after a long day of work and thinking we were under-dress","useful":0,"cool":0},"D1bGeQZXO4Zhpujqp5hJtQ":{"text":"Eh service was mediocre. The waiter sounded like he was about to start a fight. It took ov","useful":1,"cool":0},"oht-HkW8Kz4yqXq3w2iGxg":{"text":"I couldn't make my friend's milestone birthday dinner, so I called the day before to send ","useful":0,"cool":0},"obWr9JRsUcQmVF5KjILH0Q":{"text":"I really really wanted to like this place. The ambience was great. The service was excelle","useful":0,"cool":0},"RveMpDD-k4eamoQ8lNTeQw":{"text":"Yummy everything...waiters are fantastic & I can't wait to go back!!! Get the BBQ shrimp &","useful":0,"cool":0},"Di1ftBCMVisk-3p_ME1rfg":{"text":"Again, I followed Anthony Bourdain's recommendations to try out this place despite the pre","useful":0,"cool":3},"79wEtgRrV8GzDTp4PSDsqw":{"text":"If you're looking for a good 3 course meal, this should your first stop in NOLA. We were a","useful":0,"cool":0},"eIU8TqEbICR5_RxLbw8nBg":{"text":"Sat at the bar and ordered BBQ shrimp appetizer, cheese platter appetizer. Both were great","useful":0,"cool":0},"UcCZSQNKViyumtvhvsbxjw":{"text":"I was in New Orleans back in Feb during Mardi Grass, went here to have dinner by my self o","useful":0,"cool":0},"yv0iMQywK7lW07VFjOisCg":{"text":"TLDR: Really can't make a mistake in ordering anything here :] Everything is stunning!\n\nAp","useful":1,"cool":0},"uJOTnsfw-pe5Z3Mi318NEA":{"text":"My girlfriends and I came here on accident and thought we had a reservation through open t","useful":0,"cool":0},"IJeh2pouorddlwiMzVBl1w":{"text":"So again from my 07/08 trip to NO.  \n\nI expected more from this caliber restaurant.  But p","useful":0,"cool":0},"-8bjHw64JXSqA5E6WC-bwA":{"text":"We topped off our trip to NOLA with a special lunch at Emeril's! The service was EXCELLENT","useful":1,"cool":1},"pVcMOgqWCXOJubGBfOoi3Q":{"text":"Where do I start? Party of 22 reserved month's ago. Total fiasco. Our group was split over","useful":1,"cool":0},"M6NelO2YtLpZp-R-WEBXnA":{"text":"Originally our reservations were for Delmonico but they lost our reservation despite us sh","useful":1,"cool":0},"Pphdm6Y0PTBsCmmB17f5xA":{"text":"We had just an Ok experience because we were looking for a relaxing lunch while on vacatio","useful":2,"cool":0},"LOsW8gA02gYzYfdapYP8mw":{"text":"BAAM, I said it!!! There is a reason why the man is a Legend. Seafood galore and beverages","useful":0,"cool":0},"pwPZoYgNH6ny5ZIxT6oAiw":{"text":"Great atmosphere, wine list, and food! Pork chop and fried chicken were amazing! Newly ren","useful":0,"cool":0},"UIQVKglxM3ad511IerkwiA":{"text":"Sometimes these restaurants are overrated, but we were not disappointed. We both had the S","useful":0,"cool":0},"vzIoRon7UPYIYcGOjCmvpQ":{"text":"The food and the service here are both excellent. Favorites include the glazed sweet potat","useful":0,"cool":0},"Ggy5P8CFrFa8vqArSDarKw":{"text":"For me, the hype is real.  My experience here was fantastic.  Started with the bbq shrimp,","useful":0,"cool":0},"5ZmcT3Cwy3GtK4FEAZYOkw":{"text":"Great meal. The prices are expensive for the warehouse district, but the food cannot be be","useful":0,"cool":0},"GU_ehNyYK4R_53YW2ZSEUw":{"text":"We had 15 people in our party. 8 of which were kids. I will say the service was great.  Ou","useful":0,"cool":0},"eXaF8dFydH0gK8yggfvXlQ":{"text":"Our M(modus) O(operandi):  Wandering into restaurants around the globe, in the rain, & bei","useful":0,"cool":0},"3M-4xzQs1TKvcK8xyOwWmA":{"text":"Made reservations and got seated right away. Had the gumbo, smothered pork chops, shrimp a","useful":0,"cool":0},"4d4IAqWDMuNFCJdJJqhDMA":{"text":"The night started out well with delicious bread and cocktails. But quickly turned sour aft","useful":0,"cool":0},"JiRQy0YYMBmDFzzPBP1FKg":{"text":"Everything from food to service was excellent and above all welcoming and friendly, much l","useful":0,"cool":0},"w00rTN2wuzBUkOlt3wwZ5w":{"text":"I have been to many of Emeril's restauants and have never been disappointed. This one is o","useful":1,"cool":0},"Rf44_r95lJ0y4Cn6A98i5A":{"text":"I've been to Emeril's multiple times both pre and post Katrina. Emeril was one of the firs","useful":0,"cool":0},"QHAjlqQI323DIxsBWPjw_w":{"text":"We really wanted a tasting menu in New Orleans and after looking at many menus we decided ","useful":0,"cool":0},"2MiYLbe3Y2_tONsRNXuPXg":{"text":"The food is excellent and the ambiance lovely. But the waiters and floor staff are way to ","useful":0,"cool":0},"WNoxz_QmfzYCqNZk0k9DdQ":{"text":"Pros: great ambience, good service and some top dishes. The stuffed clams and king cake mo","useful":0,"cool":0},"3Jr5ajBCEA82dSyKwCoKOg":{"text":"Delicious meat, preposterously huge portions. Order accordingly. Crispy duck appetizer and","useful":0,"cool":0},"ydSiR7YyALkmmACVNtXzhg":{"text":"We expected a lot when we went to Emeril's. We were passing through New Orleans and Yelped","useful":0,"cool":0},"ynYFfwpBzUytWi-1u0qpmg":{"text":"Nice, homey decor. Very casual setting. Super friendly staff. \n\nThis was one of the best m","useful":0,"cool":0},"Y7Y6N72R_htCFSD7Dy7i4w":{"text":"We went last night with our three kids ages 1, 4 and 12. We arrived early but they sat us ","useful":0,"cool":0},"VOanP2u4TMzLFKnZJdImmA":{"text":"A marvelous experience in exceptional dining. Excellent service, mouth watering dishes des","useful":0,"cool":0},"xF8iC3OOWt32ptlX3pyoFA":{"text":"We had eaten at Emeril's two years ago and had a good experience so we went back again thi","useful":0,"cool":0},"3D9-A0FrdMXIqLk9k5KCWw":{"text":"If you go, ask for Young John!!! He was our waiter and was so knowledgeable of the menu an","useful":1,"cool":0},"v7WoC7aXUOh8FGf14ju6LQ":{"text":"This is the flagship restaurant in case you are wondering the difference between all the o","useful":0,"cool":0},"waStp4PBDY0h6xD2_EBKJg":{"text":"A lip smacking good time!  I have had business dinners, as well as celebrated with friends","useful":0,"cool":0},"YrPG5uYtCejE0PX2zwPPSw":{"text":"My mother and I loved Emeril's so much that we ate there twice. Once for lunch and another","useful":0,"cool":0},"h6oFBZCiXY4oSjUxoN13vw":{"text":"This was an amazing experience. I was here on a work trip from out of state, so we had a r","useful":0,"cool":0},"_1ePuBpA5FQXY4uocwGSWA":{"text":"This was my family (party of 7) and I first time at any Emeril location and I must say tha","useful":0,"cool":0},"nUJ6AFVibFwJq6geJkyL9Q":{"text":"Oooohhhhh..... the banana cream pie....  \nWe had a wonderful meal with impeccable service!","useful":0,"cool":0},"-14NdoRSWm-yQMi6P6mBcA":{"text":"If you have not enjoyed Emerils, you are missing a wonderful experience.  the mussels were","useful":0,"cool":0},"TQJrcm0E_b9xDOlqFKP5dw":{"text":"Food was amazing! My husband and I ordered the chicken cooked two ways (fried and roasted)","useful":0,"cool":0},"MFJQsMtB95AhxEeHqyI4jQ":{"text":"Wow! I was so impressed!  Although, I should expect nothing less from Emeril. \n\nSuch a gre","useful":0,"cool":0},"cBkpHP3wj67pv4pjkFWJ9w":{"text":"there's nothing negative that I could say about this place. the wait staff is very attenti","useful":0,"cool":0},"-29lmptTswU1zHx2vKCodw":{"text":"This place is a bit of a zoo on the weekends--the bar is packed to the gills.  And oh yeah","useful":2,"cool":1},"Qj1X-9nCMhx2_RVPYlzciQ":{"text":"We stopped in for the prix fixe lunch, $20.00 included an appetizer, a main, and a dessert","useful":0,"cool":0},"-otg2RziejH9F7DHkG13OA":{"text":"We came to Emeril's for their Taste of Summer menu. We have dined here a few times in the ","useful":0,"cool":0},"pQl_gbqwnFabGgkfujRBdw":{"text":"Going to New Orleans I was expecting good food, it was hit or miss.  On one of my last nig","useful":0,"cool":0},"5b-XFrsfkHsqaK4tOQCb8g":{"text":"I do not think I can put into words how good this restaurant is. I was there in March, jus","useful":1,"cool":1},"f92eWwkr2g1a7WnBqkPVPg":{"text":"I came here for the pre-fixe lunch. $20 for 3 courses. \n\nThe service was great, the waiter","useful":0,"cool":0},"mGIjCjaqdijqJci16YYMTw":{"text":"Got the swordfish and it was delicious! Great cocktails too. Was a little noisy in the res","useful":0,"cool":0},"CqYGqq8BV06Vk-Rmdq89VQ":{"text":"There are simply not enough superlatives to describe Emeril's.  You undeniably get what yo","useful":1,"cool":0},"QatYtpQdebyUzb4ihx9uSg":{"text":"This was the best meal so far the crusted duck breast and hubby had the rib eye.  All was ","useful":0,"cool":0},"TaXaGxOcXwp4X9RVDJfjww":{"text":"Liked the decor, would give the service 5 stars but found the meal to be good but not grea","useful":0,"cool":0},"D2QT0uNHeLcso_LhKCjJPg":{"text":"I expected a lot from this restaurant and maybe that is why I was so disappointed. I will ","useful":0,"cool":0},"4Ei_cPIM-GSwGCC21jxVIQ":{"text":"HIGHLY RECOMMEND THIS RESTAURANT! \n\nMy friend turned 30 and this couldn't have been a bett","useful":3,"cool":2},"yIWQH9pXw4_BREqQohiQYA":{"text":"Some of the Best Food and Best Service I Have Ever Had\n\nThis is our 2nd trip to this wonde","useful":0,"cool":2},"8K078LJG_Ty4QanJ-rCQ4w":{"text":"Service was great. Food was delicious. Drinks were awesome. I enjoyed it and will not be n","useful":0,"cool":0},"Coa8Hli7QoOTyusQ87lksw":{"text":"I've been to Emeril's a few times, and every time it's a delicious albeit expensive experi","useful":0,"cool":0},"Kr-2VCu-XMdgkGLgRrE4fg":{"text":"Since this was our first visit to NOLA, we had to make it a point to visit the city's most","useful":0,"cool":0},"-3IUrrkvfuilZ4jlT83JkA":{"text":"My first night in New Orleans, I took a walk and found that Emeril's was just around the c","useful":0,"cool":0},"MvioTQerCtKIfumS8uAfBw":{"text":"Had dinner on Wednesday evening. Bottom line: the food was good, but too salty. 5 stars me","useful":0,"cool":0},"Nzd9Llw0QWCzC2-vuksJVg":{"text":"Classy, casual and inviting atmosphere.  High end wait staff and fancy menu.  I ordered cr","useful":0,"cool":0},"VU9FX-KNcD-eT5pq7-D6ig":{"text":"HOLY PORK CHOP BATMAN!! Service was excellent with a bowl of gumbo funk. Everything about ","useful":0,"cool":0},"s86yRNVnV4Sl3jEF6nuKZg":{"text":"Wow! This place is amazing in every aspect! 5 stars all the way!!\n\nI dined here almost 2 w","useful":0,"cool":0},"tFj9pqbBIdYAA8CWeoaygQ":{"text":"Food was delicious we had the duo of beef.  Service was excellent!! You won't be disappoin","useful":0,"cool":0},"EI8VrVCsmbA5nfmjg6Envg":{"text":"My Dad loves Emerils so I grew up watching his show on the Food Network. I knew when I wen","useful":0,"cool":0},"cAm7RuU5z3lPStyxWzt1Lg":{"text":"Very excited to visit NOLA and Emeril's.  Centrally located, we walked to the restaurant a","useful":0,"cool":0},"dSNBN0XYQsDZ5Vct-DMbFw":{"text":"I really liked this place. The atmosphere, the food, and the deserts were great. I know we","useful":0,"cool":0},"9mQNcj9QprgbkL94Rf3FDw":{"text":"Fantatic three course meal with wonderful service. The breads that were brought out in the","useful":0,"cool":0},"hf9YJRjzWMgKqoJBd8A3RQ":{"text":"Horribly disappointed in the service. Thanks for spilling a beer on my wife. Imagine your ","useful":0,"cool":0},"9BvSS3VmZ77raSCEiLDRLQ":{"text":"I have never been to NOLA, and my perception of cajun/creole, all authentic NOLA food is l","useful":2,"cool":2},"LNPu2FRLbjaSVOCHZqOh4g":{"text":"I'm glad I experienced Emerils so I can say I tried it.  Overall the service was nice and ","useful":1,"cool":0},"_neJ1FOKXGq0F7X2muSa3w":{"text":"what a great experience.   our waitress was fantastic and really knew her stuff.  had a la","useful":0,"cool":0},"H_QGlawKcoyo8gswhX9LJQ":{"text":"Emeril's New Orleans has an \"upscale casual\" environment with a very attentive wait staff.","useful":0,"cool":0},"dIUYnNBVYG7oYS0OVrjbJQ":{"text":"I was torn between Emeril's restaurants while I was in New Orleans. I was really glad I pi","useful":3,"cool":0},"mm0IGekr9ffGsEwNXA940A":{"text":"I was very impressed with the service. The wait staff were pleasant, friendly, and efficie","useful":0,"cool":0},"2jOUMnsiVJqf645ukEHf0g":{"text":"Service was impressively efficient for our large group. I appreciate how they coordinated ","useful":0,"cool":0},"vtpzUcYqUgRMViz6lGVjHg":{"text":"We walked into Emerils for brunch on Easter Sunday and at first was quite excited as we we","useful":0,"cool":0},"OFCdo1U0lRNt2Tbx1avhXQ":{"text":"Great service and delivery of the food. It's all  orchestrated so everyone's plate hits th","useful":0,"cool":0},"eTVVcO9DjZGo-IzsLGLBwA":{"text":"Had made reservations ahead before visiting New Orleans. Absolutely LOVED THE FOOD! The se","useful":0,"cool":0},"xZMsor6sdkNz5joKFtz-Jg":{"text":"A true New Orleans classic. Okay, well - it may not be one of the flagship restaurants of ","useful":0,"cool":0},"DnNjo2Etx2J7gicv0DvFqQ":{"text":"We snagged a 5:30 reservation here on Valentine's Day.  The service was great, with multip","useful":0,"cool":1},"WLV3NODLOr2DU_2WfZMgjA":{"text":"Ok, I have to say I'm biased because of watching Top Chef New Orleans, so keep that in min","useful":0,"cool":0},"wnbkJIIsnJhSESugdJLsYQ":{"text":"I'd like to think this is the flagship of the Emeril Lagasse restaurant empire. We did a r","useful":1,"cool":1},"nf_ohZhC7s9orKGt_G7DSQ":{"text":"Able to get a same day reservation. They open@ 6pm and I chose that time hoping we could g","useful":0,"cool":0},"SP-UcMM5BAFQBrVQEUMxDQ":{"text":"This is an excellent restaurant. Very vibrant. The service was superb overall.  A little s","useful":0,"cool":0},"gueyb9a84Kkd8pyaDCdfrw":{"text":"Amazing! Delicious!! that banana cream pie....omg I still have dreams about it. All I can ","useful":1,"cool":0},"tpCKcub57EiCHQkjmq2P2w":{"text":"The famed Emeril Lagasse is known by many.  Although I don't watch the Food Network anymor","useful":3,"cool":0},"dU_1iEJBddkQRLAx0jeUYg":{"text":"In gorgeous New Orleans there is no shortage of amazing food options. Thanks to the amazin","useful":0,"cool":0},"JQeTLHBiY0MCZWXLXqSNOQ":{"text":"So this weekend I hosted a girl's trip to my hometown (NOLA) for my birthday weekend. Afte","useful":0,"cool":0},"R6FI_Dd1JCJsvXVzsPqS-A":{"text":"Absolutely would travel back to New Orleans just to eat here!! Excellent service and the f","useful":0,"cool":0},"Hv8yJwtL-l5Wrsq-3dInrw":{"text":"Yes.  This was absolutely one of the most delicious meals I have had in ages.  I had fish ","useful":1,"cool":0},"21jV0k3fG0-e1AGj4y56XQ":{"text":"First time to new orleans and first time to emerils. Wonderful food and wonder customer se","useful":0,"cool":0},"lwUDNSE36leees5q1OZObg":{"text":"Banana Creme Pie ... mind blown, waistband not far behind. Seriously ... best ... desert .","useful":0,"cool":0},"JU_2H7c9fsbNyrZOyKX6pQ":{"text":"Ate here week before last with a female friend.  We arrived early for our 6:00 reservation","useful":0,"cool":0},"eEock7TC12V6imvpXELZCQ":{"text":"I was very excited to try Southern Style Cuisine here. The food did not disappoint. The Po","useful":1,"cool":0},"SPEnw76ROJeUaeoYwYZtcg":{"text":"When we first got there we were very impressed with the ambience and the three waiters who","useful":1,"cool":0},"ggZcLy0pQSBhdGOFFfUCNQ":{"text":"I went with a group of women in October 2011. There were about 15 of us. The service was w","useful":1,"cool":0},"rnJHvJeb3JwZ0Uur83iYYg":{"text":"Our experience at Emeril's was just 3 stars, exactly A-OK. We had much better experiences ","useful":2,"cool":0},"GzAeumoxri0YYIlO2n348w":{"text":"Ate here the 1st night of our trip to NOLA and this definitely set the bar high. Ate with ","useful":0,"cool":0},"93cyBj6N9dWXDd7Ouqyeaw":{"text":"A group of girlfriends and I were absolutely ecstatic to go to Emeril's for our friends Ba","useful":0,"cool":0},"J5-ccx-ixFXN4-9X3TFE6g":{"text":"I'm a sucker for celebrity chef restaurants. Usually I leave disappointed because after al","useful":4,"cool":3},"31moJrIFwU8PwCUkAmlSbg":{"text":"Have tried most if the menu and have to say the food is always a delight!\nI came in one ni","useful":0,"cool":0},"4Nlh-QMFwujnv5INAG995g":{"text":"Phenomenal!! The gumbo was shrimp and oyster, and out of this world! The creme brulee was ","useful":0,"cool":0},"09-TaY76x2_L76rtAUrlcQ":{"text":"Heard how great the Banana Cream Pie was so decided to have appetizers and a salad and the","useful":0,"cool":0},"kmtLXtbavuyrTRTlxBy2_g":{"text":"The service was fabulous!... I can not say enough good things about the staff!!  From the ","useful":0,"cool":0},"QFGAz_rxVfRtAcFVfwLUAA":{"text":"Our group dined in the private wine cellar/vault.  I found it stuffy because we were tight","useful":0,"cool":0},"DKNi5X-6gzqqCHLXABIfgg":{"text":"It's worth it...bam! Lives up to the hype and I hope it continues to do through for a very","useful":0,"cool":0},"2cUOJir3okw4p7wy6aBTsQ":{"text":"YUMMY!!!! That's all i have to say!  I had the pork chop with Sweet potatoes & my bf had t","useful":1,"cool":1},"vve-oXgw1x0fubw_J1zzQg":{"text":"Emeril's is not really my style of restaurant.  It's a huge, somewhat characterless space,","useful":1,"cool":0},"BeDs7I1kGUeqVShumsHcjA":{"text":"It was our last day in New Orleans.  We already had brunch plans, but were walking by Emer","useful":2,"cool":1},"mofgdYwLcTWvbLfzs0XJJg":{"text":"What a great dining experience here overall. We could not wait to try an Emeril restaurant","useful":0,"cool":0},"ydrCLB_7okA3H8meQdWpcA":{"text":"We went here for lunch on A Saturday. Like all Emerils other places the service was top no","useful":0,"cool":0},"4ZTaXp0gGaeVAJMnVFJ28Q":{"text":"A business associate and I had the most wonderful experience at Emeril's.  The restaurant ","useful":0,"cool":0},"NlhewT64C6dlpreAb-XzIw":{"text":"The food was not all that great.  The shrimp was too salty for us.  We ordered three dishe","useful":0,"cool":0},"dCYjFQApjhxTGgBwOr95xg":{"text":"OMG if they have fried chicken and waffles on the menu, you have to get it---be prepared t","useful":0,"cool":0},"P04oYY-UfaF_A9ZtTj-UzQ":{"text":"I was going to give it only four stars(no place is perfect) but after that Banana Cream Pi","useful":0,"cool":0},"ZWYCRAR3S1Iy09g87kZZ_A":{"text":"Went there with a group just for late night deserts. 3 couples each ordered the banana fos","useful":0,"cool":0},"cNoyJ2DctKdVQcCmCjfpBQ":{"text":"We had to try eating here once! the andouille was lucsiously smoked. Prices were high and ","useful":0,"cool":0},"N5v7jSWvhbgoVk3Fx8Q2XA":{"text":"It was alright. The food tasted OK but it pretty pricey in my opinion. The atmosphere was.","useful":0,"cool":0},"IWTxXa3ztsNA5EnmQsWyWg":{"text":"I visit once or twice a year with clients and tonight was a real disappointment.  The appe","useful":0,"cool":0},"tD5SGaKmwStHzwidhzgn4A":{"text":"About a 2-2.5: We were seated right away, next to a curtain divider, in which there was a ","useful":1,"cool":0},"CfhVRKA3u0CKDQbOuMCqWA":{"text":"The food was outstanding!  The service could use a little fine tuning.  My boyfriend and I","useful":0,"cool":0},"X_ep7VEqsArE0BJXxTBmlw":{"text":"Lived up to expectations for us. Service was excellent, highly attentive without being ove","useful":0,"cool":0},"eMDhWD5ATIgGTuYDUcjByw":{"text":"Very good.\n\n- BBQ shrimp: Tangy, tasty, full flavored.  Very nice\n- Green mole pork chop: ","useful":0,"cool":0},"RfZw6Poi_vsw9cAO5OLBsg":{"text":"While the food was good, we felt rushed by the wait staff. Normally we like to enjoy our d","useful":0,"cool":0},"CNma4iiMORBY20bl0I1JIA":{"text":"Our evening was perfect because of the food and most specifically the service. Our waitsta","useful":1,"cool":0},"vx9ah2dvcYiJa3Moq2iNxQ":{"text":"Aw yeah, babe...\nJulius & I went on New Year's Eve, so the atmosphere was very festive:  a","useful":2,"cool":1},"z3q6IiBtUl30s3Shasy1vg":{"text":"I live in here in New Orleans, and I had never been to Emeril's but finally checked it out","useful":0,"cool":0},"uOOswTHWJF_ZzRi0Q_uZuA":{"text":"Emeril's was across from our hotel and after a long day at the French market, an easy deci","useful":0,"cool":0},"soft89mjuLEzaZDUu8uBLQ":{"text":"I used Open Table to make my reservation and I sat at the Bar Exposing the Kitchen.  I too","useful":0,"cool":0},"o3AnmpmgUcm6WhtUO_x0cQ":{"text":"The food and service are really good. We had the Who Dat burger, chicken on waffles, BBQ s","useful":0,"cool":0},"qpg57qg1T2l_0F6wzCneVw":{"text":"Food , service, ambiance...love it , love it , love it!!one of my absolute favorite places","useful":0,"cool":0},"teaxzU0kwEeMquyFo8yH6g":{"text":"We made a lunch reservation at Emeril's on 800 Tchoupitoulas St. because no other reservat","useful":0,"cool":0},"uiG64sP5TOkGyNotz1PnZw":{"text":"Cucumber Basil Lemonade - strange\nGumbo - terrific\nMuffuletta bruschetta - terrific\nPork c","useful":0,"cool":0},"fMEEdlgH_KdyJ2RHTWrXhA":{"text":"I ate here in May.  We came for the \"lunch crunch\" where you pick one appetizer, entree an","useful":0,"cool":0},"-UWz7SBvJwTlL-8tS74ICg":{"text":"I went here a couple years ago and it was one of the best meals I've ever had. Went back t","useful":0,"cool":0},"FhA89xxeav6LD4wjpfN6_Q":{"text":"Service and food were both impeccable!  BBQ shrimp, GIANT pork chop and banana cream pie -","useful":0,"cool":1},"RNaZUASGegs6cg0mRv2auw":{"text":"The ambience in Emeril's is fantastic!!\nWhen I walked in there was a heard of \"old buzzard","useful":1,"cool":0},"U_ORwaYER8we_pNa3BjZiA":{"text":"On business from Chicago, I was skeptical when our host chose Emeril's. I mean, we are in ","useful":1,"cool":1},"j0LIdDNAqOVYJd33rNmIbA":{"text":"The fried chicken and waffles are unbelievable! I had the creme brûlée for desert - specta","useful":0,"cool":0},"hsxrgrj2zt9VdrIvmP74Tw":{"text":"The update is the Emerils gives a cr@p.\nSomeone read my review and asked if they could cal","useful":0,"cool":0},"KfRpnS_umthMuDHC4X1NoA":{"text":"Emerils is a nice little trendy part of NOLA...not a far walk from Casino. Service was exc","useful":0,"cool":0},"FHKQ6R0IQk9_S2K7HvC4Og":{"text":"This place is fine dining at it's best. I recommend sitting at the Chef's bar because you ","useful":0,"cool":0},"m_4qqSQjcHJZM9IVcZeGGw":{"text":"A group of colleagues and I were in NOLA for a conference and came here the night we arriv","useful":0,"cool":0},"NCWzFTlLvFsyHpVwizSwIg":{"text":"In all fairness, I would have rated any other places 4 stars but here is the kick, when yo","useful":2,"cool":0},"4ZXrZ8Sch6-MJ-ILLR4D8A":{"text":"Celebrated our engagement here and could not have asked for a better experience. Service w","useful":0,"cool":0},"V2I5c33hwA3y0vYhPYSPiQ":{"text":"Amazing food, beautiful atmosphere and great for date night, or take the whole family to c","useful":0,"cool":0},"Zike-ldNyKhuBqnUHSmCog":{"text":"I have been to New Orleans several times now and wanted to finally give Emeril's place a t","useful":0,"cool":0},"vwGIS7f_I9jNkXnqtMvvzg":{"text":"I am going to preface this review by stating that I actually came down with a terrible sto","useful":0,"cool":0},"z1j_GHajO85GEQ_zy4UrEQ":{"text":"All I can say is BBQ SHrimp. You have to get this appetizer. It's amazing. I went here in ","useful":1,"cool":0},"5hxUHbLHUvpbYdbXAY_5BQ":{"text":"From the moment you are greeted at the door you are completely taken care of! Emeril has c","useful":0,"cool":0},"QFgreLmCVWW-JJ7WEpXlFg":{"text":"Went here with my boyfriend on a Friday night and it was a fairly strange experience. Firs","useful":1,"cool":0},"VHL3nBvYtZ05L84rgCRy0Q":{"text":"This is the best restaurant I've ever been to. The service was hands down amazing. I work ","useful":0,"cool":0},"s8lg6eq-HQCvhduLWFS0cw":{"text":"Brought my husband this time and requested the Chef's table\n\nI was in heaven watching the ","useful":0,"cool":0},"qEQO5Uk3f6KKxBwN3G7KkA":{"text":"I would say you have to give 5 stars to any restaurant that makes your husband say, \"babe,","useful":0,"cool":0},"7dcjoLJiiTkJM33u6z05WQ":{"text":"I went for lunch and order the 3 course meals for $22.50. It was delicious! I had the Argu","useful":0,"cool":0},"Ya0jW6uEBpIJbcIdCK9UZQ":{"text":"Very very good.  Not 5 star but close.  Glazed salmon was melt in your mouth.  BBQ shrimp ","useful":0,"cool":0},"GUB1TfHP_hRsa3wNgMpiUg":{"text":"This was the highlight of my New Orleans visit. Amazing service,  and even better food. Th","useful":0,"cool":0},"CQR3PI1_RjZNqMhvyMN7oA":{"text":"Celebrated my son's and future daughter-in-law's graduation from Tulane Med School there a","useful":1,"cool":0},"0AaKL7vonqnuZsUQwC1G8Q":{"text":"There is something about Emeril's New Orleans that makes you feel as if you are special.  ","useful":2,"cool":1},"q9Lt9Ju61SKK6-JrihDi9w":{"text":"Excellent. Had two glasses of Emeril's wine, the shrimp soup, the sea scallops, and the up","useful":0,"cool":0},"3JRG90RjlMwjbdKZMYKpyw":{"text":"Made last minute reservations and got right in.  Arrived a little early and was immediatel","useful":0,"cool":0},"5cIy0wwzPj4raXU9PNIVwg":{"text":"Great service. The food was good. The maple chicken came as a huge portion. Loved the cala","useful":0,"cool":0},"3WgvOSQp5AZSJ6YKntfV1A":{"text":"My sisters and I had lunch here.  We had:\n-BBQ Shrimp;\n-Andouille Sausage;\n-Roasted Garlic","useful":0,"cool":0},"iMD2lgJ-k2onFblrvoTzAw":{"text":"It's not bad but it's not mind blowing either.  The appetizer I had \"Flash Fried Oysters\" ","useful":0,"cool":0},"HggV1mlC9CNH6TgJBAyzOQ":{"text":"Service is terrible. We waited for half hour before menu were added. Food came extremely s","useful":0,"cool":0},"1pWgPG5n04AtxuYmOq_ptA":{"text":"I have nothing negative to say about this place. Truly a 5 star experience for me. I had a","useful":0,"cool":1},"sv4aJFij-YK6pHmIebW5_Q":{"text":"Impeccable service. I took a business associate there for dinner. I had the arugula and Br","useful":0,"cool":0},"6K7HMOHBsBuwpiK9JsTvFA":{"text":"Service was perfect. My dinner, the pork loin, was really good but not AMAZING. The weirde","useful":0,"cool":0},"ljlRP49yQB7BfdwkDJkRWg":{"text":"For a famously vivacious city known for it's magniloquent flavors, Emeril's dishes had a r","useful":0,"cool":1},"Mwgdw6EnJE0mRdHq7vjDYA":{"text":"As for our last meal in New Orleans, we saved Emeril's for last thinking it would be the b","useful":0,"cool":0},"G6bPg0vEyQhSXGnall5m-A":{"text":"Well there are some decisions you make in life that are totally perfect.  Going to Emeril'","useful":2,"cool":0},"UE2wYnvygzi7jME_2tvGAQ":{"text":"It's fancy and the prices reflect that. Everything was fresh, tasty, and well prepared as ","useful":0,"cool":0},"eKCvYdhZdSRxQ71uJ27t8A":{"text":"It's unfortunate to have high hopes and expectations for a restaurant such as Emeril's and","useful":1,"cool":0},"a2eO4b7v5Jn5nmu61AAS0w":{"text":"First of all, our main waitress was such a nice and peppy server who demonstrated extensiv","useful":0,"cool":0},"04YGwU8IV_7BFYdsIhGofA":{"text":"2.5 Star\n\nService at Emeril's is excellent!! Our waiter is friendly, kind and generous! He","useful":2,"cool":0},"6MppvxKbtdqfpOb9jCzviw":{"text":"Don't regret having eaten there, but was also not blown away. It is as much about the expe","useful":0,"cool":0},"-z_ynJIYHDJVP-pEinnVVQ":{"text":"I went to Emeril's for the first time this past weekend and thoroughly enjoyed it.  I've d","useful":1,"cool":1},"KQLkVCYMef9SwoD3ODCc-g":{"text":"While I think this restaurant is a solid Three Stars, I must say I was sorely disappointed","useful":2,"cool":1},"9tryL0YTAi_YyKlqaSSkzw":{"text":"I had a great time at Emeril's. The service was fantastic. We were a large group (10 peopl","useful":0,"cool":0},"hTalm4Ndxe3jHfn0lOVWzA":{"text":"This was easily my favorite restaurant of my first visit to NOLA... in fact I visited here","useful":0,"cool":0},"v1beEwc6H5xUZkWyBKQSxA":{"text":"Service was over done. They hang all over you. The food was mediocre. The manager was will","useful":1,"cool":0},"W4_t6Po-bp1Pu-83WstwOw":{"text":"I'm torn between 3-4 stars . I did like the ambiance . Nice restaurant but not stuffy .. c","useful":0,"cool":0},"oW5Fo_fBwLA7ekYUyQPUjw":{"text":"Seriously, who makes fried chicken fried in truffle oil? Emeril's, that's who!\n\nI came her","useful":0,"cool":0},"1_ZohGerMN_6dZ8KdpaUUw":{"text":"Wow, what can I say. Excellent service, food and atmosphere. My children ages 6,13 and 17 ","useful":0,"cool":0},"8rwMnaxlej9AzXNLaOvu8w":{"text":"Our best meal in New Orleans, hands down.  Everything we had was exceptional: cocktails, b","useful":0,"cool":0},"fBZ5Hgg_2jd-PAuQm1k4Ow":{"text":"If you enjoy good food, Emeril's restaurants are a must while visiting NOLA. So we tried t","useful":0,"cool":0},"FENZus0qYQ2TmpV66OvZvw":{"text":"Very good but not perfect. One of the signature restaurants of new orleans and worth givin","useful":0,"cool":0},"Jrg1ssKZDSc_sO9SLx69og":{"text":"I love the fact that it's an open kitchen I really enjoy watching them at work All our ser","useful":0,"cool":0},"Ycof4HnEmU4B5rSgN3C0Nw":{"text":"Had the chance to eat here twice in one week.  The food was all very good, but the service","useful":0,"cool":0},"ZSeo0EC7CfDo8i9zU1AZeg":{"text":"Reservations at one of Emerils was what I did immediately after booking my flight to New O","useful":3,"cool":0},"iUjpU0NyVIW3l_tTFS-dDA":{"text":"We celebrated Mother's Day with a large group and had a fantastic time! The food, wine and","useful":0,"cool":0},"ZWR9eGSbSGpRGHxWMynHOQ":{"text":"We've been here a few times and like sitting at the chef's food bar, that's the attraction","useful":0,"cool":0},"B4GK9v4HitJj_Tc6dAJx_g":{"text":"Attentive service, flavorful food, and swanky ambiance.  Wow!  The emeril hype was well-de","useful":0,"cool":0},"pZq9x7U0lFuQ0waWtMnWug":{"text":"We had a reservation for 4 people at 8:30 pm.   When we first walked in, we saw Justin Lon","useful":0,"cool":0},"of0_nn2Wy5xIueZuW5DJeQ":{"text":"Believe me, I know how much of a cliche it is to say that Emeril's was the best food we at","useful":0,"cool":0},"34hfxSnlRoWH5_khl69DTA":{"text":"Emeril's didn't just serve Nova and I the best meal we had in New Orleans. It served us th","useful":0,"cool":0},"iXPGKvzZGuRbqt7TKASezA":{"text":"Great food and great service! Alexis was amazing and the best service we had in New Orlean","useful":0,"cool":0},"Q54GYHlSQb8N0QRA00bxCg":{"text":"The service here was outstanding and the food was pretty good too. My friend and I came he","useful":0,"cool":0},"cYhaBaeRJOGacq4TA_UDNg":{"text":"I am basing this review for this particular location on desserts alone, as my friend and I","useful":0,"cool":0},"ZfRHG-fDuA4CO_JcNRHxMQ":{"text":"I had a great dinner with my kids.  We shared the Thai BBQ ribs.  Very tasty.   We ate it ","useful":0,"cool":0},"lILxc5u3jFunjWHSgJAyfw":{"text":"Best service I have ever received at a redstarts time! They make you feel like a princess ","useful":0,"cool":0},"BcQwIY9iUCnSck_pIcnd9A":{"text":"I'm really surprised and very disappointed to be rating our visit to Emeril's with only 3 ","useful":0,"cool":0},"fgE5v08XpXpp8iR4qIYolg":{"text":"I would tend to agree with most of the 3-4 star ratings. We didn't initially have Emerills","useful":0,"cool":0},"QprXt2HTYP1KhEfLCAht-A":{"text":"This is the 4th time that we have visited Emeril's while we were in New Orleans and it nev","useful":0,"cool":0},"oH8kThzE9pl1olFUzLaM_Q":{"text":"Chocolate soufflé rocks. Perfect and light, worth the wait.","useful":0,"cool":0},"TuODrnjRe9T_dZwPoSjoxA":{"text":"The onion bisque and the sticky toffee pudding were both phenomenal. My main course-chicke","useful":0,"cool":0},"AJo_huahnTtDG5_RGPJjng":{"text":"I've itemized this review.  Skip to the section that's most important to you, or just chec","useful":0,"cool":0},"7QD3m4THjwj3HI9ztmbnFw":{"text":"Do not come here! Bad service and rude staff! Apparently the staff gets overwhelmed on Mon","useful":0,"cool":0},"-tvyvVkC1OCk9yWjLHMWdw":{"text":"Perhaps I had high expectations with the Emeril name attached to the restaurant, but the f","useful":0,"cool":0},"1rZ6wqjCbRxb6iX3CuHxwA":{"text":"Beautiful restaurant in nice neighborhood. Drinks were great, wine list was huge. Had the ","useful":0,"cool":0},"7FBsaoor8n96P2JMT59Ztg":{"text":"Hands down best service ever!From the second we walked in everything was A+++++! I have be","useful":0,"cool":0},"EvodiZLpR0FbLZ9JQgKbIA":{"text":"We had dinner here 20 Dec on a whim. We've always enjoyed Emeril restaurants. This visit c","useful":2,"cool":0},"MzaSlDsSKT3gTvVyo6m23A":{"text":"Had the fried chicken after reading the reviews it was good. The Mac and cheese WOW enough","useful":0,"cool":0},"wlEQJQWQqM0QvHKO5ga3Cg":{"text":"Delicious! Came in at around 7:30 pm on a Tuesday night and they had no tables available. ","useful":0,"cool":0},"4nAT2eeApTfjfNaajyTx7w":{"text":"Excellent service, meal and dining experience. Truffle fried chicken for two was delicious","useful":0,"cool":0},"8KrEV9i9CsaPv_xxWZxoNA":{"text":"I'm not sure anyone would be surprised by a good review of Emeril's.  They just have that ","useful":0,"cool":0},"D9ERzbt5Zq08x_7F6dQzdw":{"text":"Okay, we are back again and it is as always. Awesome, the food, service and the experience","useful":0,"cool":0},"guCYeVnPj3nKdsp3EXteZg":{"text":"\"Bam!  Taking it up a notch!  Bam!\"  Truly an awesome fine dining experience even if you h","useful":0,"cool":0},"YbT-TzRjyPj-hYis9YvOsg":{"text":"My husband and I walked in without a reservation and we were offered a seat at the kitchen","useful":0,"cool":0},"laA27-_qn5ERRyqoGJdNFg":{"text":"First time in New Orleans...went to Emril's and sat in front of the kitchen. Food was amaz","useful":0,"cool":0},"cd-eHq8D7O4u5ouQdgwNxg":{"text":"This was an amazing work dinner! We left our hotel to look for food and we found A dinning","useful":0,"cool":0},"teUS7C5yLmYhQDusLh42FA":{"text":"3 stars for service. Definitely not worth the $$ being charged here. So many better option","useful":0,"cool":0},"37lw5bkZt1RVSyKSuY0dkQ":{"text":"The server was good although my girlfriend pretty much ate by herself as they failed to pr","useful":0,"cool":0},"CHLOz9zNAj6_QPigZmTZlA":{"text":"The food was excellently prepared.  The best Gumbo we had during a week of Gumbo in NOLA. ","useful":0,"cool":0},"J024Bf8i1dRfYwpZht9TYg":{"text":"Good news first... best service ever! Every condiment or dish that came out was served swi","useful":0,"cool":0},"aYuSrDo7xAEA3OQJpnZDYg":{"text":"Always delicious New Orleans cuisine. Had the fried duck heart salad (they'll fry anything","useful":0,"cool":0},"QEMa5AudMmV5Wp0P_KXZZQ":{"text":"Gave it a 4 compared to commanders \nPalace\nEmerils is a great place","useful":0,"cool":0},"2xEy83oHuGPGKJPeRAFoEA":{"text":"It's hard to describe how awesomely good the food is at Emeril's. A definite MUST while vi","useful":13,"cool":6},"9hlsKcW2s3tXnHPOPLDHTQ":{"text":"My husband and I went to Emeril's on our anniversary. We didn't expect to go to a fancy pl","useful":0,"cool":0},"BG-EJwr4Ouoj7q_oZ9dBMg":{"text":"Emeril is a favorite chef of mine. Sooo disappointed. Great service but the food was BLAND","useful":0,"cool":0},"XrwY63eb5YfiGP7GJ73GXQ":{"text":"I was worried that Emeril's would be very overrated and just living off the name, but it w","useful":3,"cool":1},"M-kuWAcpbn4tpT9xf5QMTg":{"text":"My husband and I live eating at Emeril's because the food is always the best. Today, my dr","useful":0,"cool":0},"39RII9Bqxo04LGHmef8lRQ":{"text":"Still refuse to go back to your rathole resturant. Why should I?  I ate, well I tried to e","useful":0,"cool":0},"DI4S9_Pccxg9VG21uplNqw":{"text":"Excellent service, excellent food...but then what else would I expect from Emeril! It was ","useful":0,"cool":0},"zBL0L-k8d-NcM1mWTq035g":{"text":"Loved it. Staff is fantastic. Had the house salad then glazed chicken and both were delici","useful":0,"cool":0},"11tG3XUmjLuN4okSgo_Y5A":{"text":"The New Orleans barbecue shrimp is a favorite to try anywhere in the city, and you can't g","useful":0,"cool":0},"hDvDh9qboZj5EUtFe2ArSA":{"text":"The food was absolutely exquisite but not only was the food amazing, the staff were too! K","useful":0,"cool":0},"UdaeQ-420UTMgMlZMHloVQ":{"text":"Given that Emeril is now a nationwide brand who appears on TV seemingly every few minutes,","useful":0,"cool":0},"5niM-SX8LGz3LbFuyh77rA":{"text":"While visiting NOLA on Christmas vacation I took my hubby here for lunch. The service was ","useful":0,"cool":0},"-FHQqgak1V48TI2G09gSpg":{"text":"The evening before we ate at Commander's Palace.  That venerable old insitution creaked al","useful":0,"cool":0},"cNoebwnnSr2UeeO0NrFEzQ":{"text":"Emeril's isn't pure unadulterated creole food, so if you want \"authentic\" I would go elsew","useful":0,"cool":0},"aJy5ZPpHbWQW-Ch471K5BA":{"text":"We loved our emeril's experience!  The staff was so friendly and our waiter was engaging. ","useful":0,"cool":0},"Clfkb8_XdFlt5dfYnYqA1w":{"text":"The meal was absolutely fabulous! Being in New Orleans as a first time visitor we highly r","useful":3,"cool":0},"-Db2kBH6rL1S-woDuoayWg":{"text":"They cooked the fishes my sister and I got perfectly! Not overcooked like other restaurant","useful":0,"cool":0},"Zq0D5l16ZjBmm83dpOQLPw":{"text":"BAM! My time at Emeril's was truly memorable. \n\nI stopped in on a whim while on a business","useful":1,"cool":0},"drCcZoLlxuPzosHHrG8o7w":{"text":"Had the fried chicken for two with fixins and crème brûlée for dessert  the fixins being a","useful":0,"cool":0},"7lPjQTbd-B2FjRLZcN-oZQ":{"text":"I have been to New Orleans many times, but I had never dined at famed chef Emeril Lagasse'","useful":0,"cool":0},"xYLQJtNOsaWVupwwOdHkeA":{"text":"I'm very surprised with some of these reviews. I thought is was some very good food (not q","useful":0,"cool":0},"uy0lD5eqsFxqqJ4N_h4lgw":{"text":"Awesome. Awesome. Awesome.   Great wine, great dinner and dessert.  A very special and mem","useful":0,"cool":0},"Cn7DrUydxz6RdN3itNTQBA":{"text":"My first time at one of Emeril's restaurants and I must say I was a fan.  Made reservation","useful":0,"cool":0},"HDRD8YVM7Wup3KNGhI7vLw":{"text":"I had somewhat lower expectations coming in as I'm kind of the belief that all these resta","useful":0,"cool":0},"E7PrQlFda2uPFoiIHC43Ww":{"text":"I've been here several times, and have discovered the same trend every time -- the appetiz","useful":0,"cool":0},"xnsyNJbj4p72xkjQQbieHA":{"text":"Delicious and creative food, very attentive service (almost too attentive...they refilled ","useful":0,"cool":0},"amAGa78BuASLwU_dA8UZzQ":{"text":"While our visit was far from typical, it was exceptional.. We did a multi course tasting t","useful":0,"cool":0},"tOO1bP18Ab_7CSlgdzNcpw":{"text":"I don't understand why this place isn't 5 stars!!! Emeril's was hands down one of the best","useful":0,"cool":0},"ceoM4R_QdLSsBPSk9Gd1lg":{"text":"One of the best dining experiences I've had to date. From the exceptional service, to the ","useful":0,"cool":0},"6Ayp2eWN5lDOlEnTbxL8VA":{"text":"Sad to say the left side of the house has a huge refrigerator system that causes you to be","useful":0,"cool":0},"yUJTkwl7R70eeoD0uoAYgQ":{"text":"Big name that actually delivers. \n\nBeen here a couple of times, both times great. \n\nFirst ","useful":0,"cool":0},"usO4GbEGP7HYlMiKPnehuw":{"text":"Came here two days in a row. \n\nFirst night we were full already from other restaurant down","useful":0,"cool":0},"uxzjaeGj_9UD39-wOnMvTQ":{"text":"Gordon Ramsay makes Emeril look like a bus boy.\n\nI had high expectations for this restaura","useful":0,"cool":0},"fTktsPMz0grQtkI1hEA08Q":{"text":"The food is entirely sinful. I don't understand how this food is legal. I had the bone in ","useful":0,"cool":0},"K5EJeGThFH8kgoPxyhXYZg":{"text":"Disappointed. Sat at the bar and ordered our dinner. It was a wait and wait and wait...I f","useful":0,"cool":0},"jg7tJrgKu843t6WSIOS3Wg":{"text":"Had reservations when they opened and had no trouble getting seated. Menu had a variety of","useful":0,"cool":0},"xAucA57ye4Nh-oBB_XJ2wg":{"text":"Had my first dinner in New Orleans here. Not bad! Good service and good food. For appetize","useful":0,"cool":0},"j532tnOL5SdfRSHIIX-QDg":{"text":"The food and ambience were very nice. Had the BBQ shrimp as an appetizer and the double cu","useful":0,"cool":0},"_WlPSE0xdg7Kp1UG-0rlOg":{"text":"More of a 4.5 star restaurant.  We tried this restaurant for the Banana Creme Pie seen on ","useful":1,"cool":0},"qjlkaGYMJOVLbsIN1gYxsQ":{"text":"Came here for lunch The service is beyond excellent was in a hurry to eat and they took ca","useful":0,"cool":0},"Eqpc96gWzB9xRtn8RBP-_A":{"text":"I love the service!  So organized and so prompt with everything!  It was so nice!  Of cour","useful":0,"cool":0},"ME4h6SlvbGf9HI5rVMgwWw":{"text":"Nawlins has some good food and this place is no exception.  I got the pork chops with swee","useful":0,"cool":0},"KYbO5Y7NLB2kvcHWwS8xJQ":{"text":"It was a real treat to go here for my 44th birthday and sit at the Chef's Bar. You get to ","useful":0,"cool":0},"kflVHrArrZIz_NL-lEK6xw":{"text":"Don't let the hype fool you.  This place is overrated and underwhelming.  I brought my fia","useful":0,"cool":0},"qwwEhFr_foOzJwz0nNAbJQ":{"text":"The restaurant has a great ambience and the service is exceptional. We had two waiters jus","useful":0,"cool":0},"4fMqvqevZlOTutVpqB3Isg":{"text":"The great service and the great food,by far better then Brennan's,no snobs  serving you,Re","useful":0,"cool":0},"cbnEOumhO7NP94RINFgkHw":{"text":"Great food, Top notch service, this is a wonderful restaurant!! My wife and I had the duo ","useful":0,"cool":0},"QzkTkwdb8dUY5R7JkF0NpQ":{"text":"Always great food, fantastic service, and a generally fun atmosphere. But what pushes this","useful":1,"cool":1},"AgG0ZULqsHETVPJ2q5pGUA":{"text":"You can't come to New Orleans and not eat at one of Emeril's restaurants.  The restaurant ","useful":0,"cool":0},"Xf561_bojoZdl8y3qLoGvA":{"text":"came for dessert and ended up falling for the wonderful bread basket. we ordered\n\nbanana c","useful":0,"cool":1},"mMAFEE426LsCZUnUD-iO2g":{"text":"Grea food and a lively atmosphere. The service was always on their feet and had an outstan","useful":0,"cool":0},"Un-x36kD9yWq29rXsXxsEw":{"text":"No, I'm not generous with 5-star reviews.  This place was just amazing, that's all.  \n\nMay","useful":0,"cool":0},"Sd7cG-brNbB_u5hfiveOyQ":{"text":"This was my favorite meal throughout my whole trip to New Orleans.  First of all, we came ","useful":2,"cool":2},"Nw9cHORHXbV3ALddbGAevA":{"text":"BAM!\n\nAs soon as I knew I was going to New Orleans, I knew I had to try Emeril's food. He ","useful":2,"cool":0},"0AI0FsZhlX1qNHYZciaoAw":{"text":"I have never been so disappointed! While visiting New Orleans I was told by numerous peopl","useful":0,"cool":0},"61BW8OvSYhmt5-VA-zukjA":{"text":"Ambience is relaxing, classy and welcoming . The open kitchen is just a fresh of breath ai","useful":0,"cool":0},"OCe7l9u4HsLjzQgLwoiIPg":{"text":"debating between 3 and 4 stars but decided this place is more like 3 stars. \n\ni was really","useful":0,"cool":0},"BkhgAM3HMoJHhSyASRuwTQ":{"text":"Service was impeccable .drinks were delicious . We had the diver scallops which were very ","useful":0,"cool":0},"p15IljGbqqMYZmDTmYgPwQ":{"text":"Great service but the food isn't as good as some other steak houses. I loved the soup, the","useful":0,"cool":0},"30AlGP4JqLoFFKJ2TTn_tA":{"text":"ALWAYS THE BEST!! Best service, best food, best atmosphere! An absolute never fail always ","useful":0,"cool":0},"hUxz_44f1pHWXW85KizaBg":{"text":"Great food. Sat at the bar with bartender Kyle, serving up Veltliner and Chicken Gumbo wit","useful":1,"cool":0},"8zP3ULmRsl_DIR-7Bre0wA":{"text":"I don't think I could come to NOLA with out dining at Emerils. Should we be trying \"other\"","useful":0,"cool":0},"23GCFiaw7eV_q-A6z1b2Hw":{"text":"Stopped by for dessert to taste the legendary Banana Creme Pie. It was good but I expected","useful":0,"cool":0},"5zSA1TlT6Armh8uwO-7Kig":{"text":"I have never been to a more accommodating restaurant. The service was excellent as was the","useful":0,"cool":0},"mlGW79rjI_xCIY1yeDYQrA":{"text":"Great service, delicious food, and it wasn't as pricy as I was expecting. \n\nInstead if a f","useful":0,"cool":0},"pS8KlJxvWT2pzcfu2DZEFA":{"text":"Overall a great dining experience.  Visited for dinner during a last minute trip to New Or","useful":0,"cool":0},"xWHONCo9QvnQRJ01_EI9hw":{"text":"SO Salty!  Second time eating here, not at all as good.  Service excellent and attractive ","useful":0,"cool":0},"ZKCc8-9T43wv9szktxg8Qg":{"text":"Sadly, this was the most disappointing of our dining experiences while visiting New Orlean","useful":1,"cool":0},"kG0HFH4JBGO828HGC_24hw":{"text":"The staff and service was great. Fast and courteous service. But I have to admit I didn't ","useful":0,"cool":0},"8qqMOZBnIZGftRdrg5i6Gg":{"text":"Came in to get a drink at 10pm on a Monday and sat there for 15 minutes and was not even a","useful":1,"cool":0},"faPcUNwsfu_btNX5sUWtUg":{"text":"My steak and desserts were great but my guests didn't like their food.  They thought it wa","useful":1,"cool":0},"lMNVPlBitEiXa-B6BUhTFQ":{"text":"My wife and I went here for dinner after reading all of the reviews..\n- Service was excell","useful":1,"cool":0},"qAnkQfAnXQBrdaeJn7kW7g":{"text":"A group of 6 of us went to Emeril's while vacationing in New Orleans; we were taken care o","useful":0,"cool":0},"7DNyIWU59jDIKkpd5Q8KQw":{"text":"Service was spectacular and food was delicious. A wonderful place to spend my husbands bir","useful":0,"cool":0},"i3T_Ilu280KQ850zY2RO9w":{"text":"I was not impressed with Emeril's. I found the menu a bit narrow and the drink list titled","useful":0,"cool":0},"WZHKg-Yn9W0oVrFlZ1igJw":{"text":"Was in New Orleans recently for our 25th anniversary and had an amazing time. One of the h","useful":0,"cool":0},"WRgLrkMt0qRWr2kaXRTBcA":{"text":"*Mobile Review*\n\nCame here with NYUCD ADEA faculty and student doctors.\n\nDecor: 4.5/5\n-We ","useful":2,"cool":2},"lbiQhGtaAKmkPpm3-jXmGg":{"text":"First time here. The bread included a very delicious and soft cornbread and a sweet potato","useful":0,"cool":0},"C1AL958HT2TXu_bCiRfhXA":{"text":"This is another restaurant that I visited on my first trip to New Orleans. I remember it w","useful":0,"cool":0},"jwbfJk-MtvE3R-m_Tw06kQ":{"text":"My dining experience was amazing! The food and service is the best that I've had in New Or","useful":0,"cool":0},"EpkF_bHqc7i0IbgdXDfiRw":{"text":"I'll preface by saying that if Yelp offered 1/2 stars, this review would be 4 and a 1/2 st","useful":5,"cool":3},"A5z3vkF3JkjBwdFBe5cPaA":{"text":"Don't get me wrong, the food is good here, but there are other places where the food is be","useful":0,"cool":0},"N_j1xjaaRq0BO-LHqVB6Pg":{"text":"I had been to the Emeril's location in Orlando many years ago and I was way to young to ap","useful":2,"cool":1},"_iImIysZnnagrYt3CE7fVQ":{"text":"Forgettable!\n\nI wanted to go wild for this restaurant. Maybe I was expecting too much.\n\nTw","useful":1,"cool":1},"zV_bDNknFYAvC9QwRy85Zg":{"text":"Overall good experience at Emerils. I will have to say the waiters were great. First time ","useful":0,"cool":0},"uBcjARXyMVzWAYG33kuWnw":{"text":"My husband and I were really disappointed.  I made a reservation weeks in advance of our N","useful":3,"cool":0},"E1n01iklQMOfXCjK9qZtGA":{"text":"In town for business and booked this place in advance with a friend. We were very excited ","useful":0,"cool":0},"qRoOEWwZNyf3ZXl5JtufUQ":{"text":"I took my friend here for her birthday recently. Staff was very sweet!! Porkchop was very ","useful":0,"cool":0},"DFJrid-fi0X23nko3ymw0g":{"text":"Absolutely amazing dinner. Sat at the kitchen bar, which was great. Watched all the hard w","useful":0,"cool":0},"aR1tBvUQaZODU-nw3GA3MA":{"text":"I booked my reservation at Emeril's two weeks before my trip to New Orleans upon arriving ","useful":0,"cool":0},"pba3cORshw4B3VU1ZDrUiA":{"text":"I must admit, I came here wanting to hate it, but I left very happy.  Service was excellen","useful":1,"cool":1},"M0JKqi03n-DdGIInQKMnLg":{"text":"This place is practically downstairs from my boyfriends' condo & in my neighborhood as wel","useful":0,"cool":0},"Sxj3_4NmT3efUC29V5d8og":{"text":"We wanted to get some dessert before we left New Orleans and saw Emeril walking into the b","useful":0,"cool":0},"STrl6U_Mz7Mfl7zw4G8ryw":{"text":"Food was great and service was even better!!! I highly recommend the Duck enchiladas!! Eve","useful":0,"cool":0},"PLxymn6zZlhQcSc5iiSz2Q":{"text":"Some people claim that celebrity chef's restaurants go downhill after they become famous. ","useful":0,"cool":0},"avPL_y-E0gTZcJki-7DgRw":{"text":"I'm all about fine-dining establishments. Delicious food, phenomenal waitstaff, able to cu","useful":0,"cool":0},"ADj4Z8XYn8aXpTZbuJgHeg":{"text":"One of the best evenings. They treated us like rock stars. Food was outstanding. Come hung","useful":0,"cool":0},"kFWOeIXt0JTrfGWhxiIeHw":{"text":"Not sure what all the hype is!? No one was impressed with their food. The only thing I rea","useful":1,"cool":0},"roYsSHyIpuqbdTKWT8HX-g":{"text":"I couldn't miss the opportunity to visit one of Emeril's restaurants and this was within w","useful":0,"cool":0},"F7K5f5ii7eXOkWZpIMQ_VQ":{"text":"Going to New Orleans and not visiting Emeril's and having the banana cream pie would be li","useful":0,"cool":0},"MoCmy8D7OFvcfo8qzf9Gjw":{"text":"This was good! I was showing friends around the city. One of them had never been to N.O. b","useful":0,"cool":0},"wemt3T6vUfPS9mmIGoaqew":{"text":"We thoroughly enjoyed dinner here.  Sausage and meatballs apps., our party ordered the and","useful":0,"cool":0},"cjnaqp4WiAntIk6TsUbDWQ":{"text":"I decided to treat myself for dinner and it turns out they had a four course menu for $45 ","useful":0,"cool":0},"StyKnrRFObURD6kvbqcH9g":{"text":"I was expecting to be let down by visiting a \"name\" restaurant with a long history. Given ","useful":0,"cool":0},"aJZDWAdvCGYl1YsU6vIBfw":{"text":"Went to Emril's for a dinner.  I had the quail to try something different than normal.  It","useful":0,"cool":1},"3yD6u0DL1kXUXaneFI160g":{"text":"Hot damn! Such great food! Every dish is like a work of art - perfectly blended herbs, spi","useful":0,"cool":0},"3CHJgFYihgW9F3x-xTwRsg":{"text":"We had a wonderful dinner at Emerils, one of our best in New Orleans. Started off with a n","useful":0,"cool":0},"YwlP7ivQ0K6oUNC9m3gqMA":{"text":"(1) Loved their trio of bread: cornbread, rosemary, and french roll\n(2) BBQ Shrimp with Ro","useful":1,"cool":0},"1ngOKowc1iDWhndySqbmWw":{"text":"It's fine. It's expensive comfort food. The calamari was good. Drum AND duck covered and f","useful":0,"cool":0},"e69FbHasrlt73EBWbAAPZg":{"text":"My reviews are based on 2 stars for product, 2 for service, and 1 for the overall experien","useful":0,"cool":0},"vAcKeie-uUcv067Y4CrvVA":{"text":"Awesome place to eat. Reasonable prices, excellent quality, friendly atmosphere and outsta","useful":0,"cool":0},"DzeMgH4c5G0fCSnN-LdJ_w":{"text":"Perfect service.....seriously.\n\n\nFood was just ok.  I recommend the scallops appetizer.   ","useful":0,"cool":0},"1vvi0XYvPKBmzaT4QGmuzQ":{"text":"Emeril's was good, this past time, but has fallen since last time we tried it in 2011.  I ","useful":0,"cool":0},"Nsor-HdE0SFtNkEi1nQgBQ":{"text":"I have no clue how this place only got four stars.  I took my wife here for our first anni","useful":0,"cool":0},"a1b7wfCd0yRyzArmf48YBw":{"text":"I was impressed - I didn't really EXPECT to be impressed... but Emeril's really was a culi","useful":0,"cool":0},"6w5KdVzsQrqNdl62ebKViQ":{"text":"Coming from Orlando, I've eaten at Emeril's at Citywalk many times, so we wanted to check ","useful":1,"cool":0},"H4xv-ATC-V38KZiHrUv_tQ":{"text":"Had the grilled pork chops. \nThe sauce is to die for. \nSo make sure you ask for more. \n\nAl","useful":0,"cool":0},"dtOiyWoCbnWRi7rJPUdK1w":{"text":"April 26th we made a reservation at Emeril's on Julia and Tchoupitoulas Streets.  We were ","useful":1,"cool":0},"FrpsbvUMOp6qjo5XsfdWEw":{"text":"Disappointing.  Save your money and palate, go elsewhere.  Food is underwhelming at best, ","useful":0,"cool":0},"d5Q8_6ww-HF9-1fdztjIOg":{"text":"Truffled shrimp Louis salad -- AMAZING. Delicious spice, bits of flavorful bacon, creamy d","useful":0,"cool":0},"JBweJzNR4raIELo1X2qErg":{"text":"First time to New Orleans and dining at Emeril's was  top of my \"places to visit\" list. Ev","useful":0,"cool":0},"Z3fiivqwr-SWrHprQZLBXg":{"text":"Wonderful! Loved this place SO much. The customer service was outstanding and the food was","useful":0,"cool":0},"PnmdZO-IDBHhkSXdbfDytA":{"text":"From the minute you walk into this restaurant you feel welcomed. The wait staff is as prof","useful":0,"cool":0},"9uAFOgINhdDvv1TBkeKvtw":{"text":"Incredible!  I am not sure what was more impressive, the food or the staff!  Watching the ","useful":0,"cool":0},"3WbYopZrIyueAR5Bxh0BEQ":{"text":"Everything was beautifully cooked to perfection. The waiter was very attentive and provide","useful":0,"cool":0},"kUEn7_wpCViimSPMFnX2aA":{"text":"Love love love!\n\nService- absolutely amazing. First class experience \n\nFood-I ordered the ","useful":0,"cool":0},"-aC_QquyU8uJNYRAdr4aag":{"text":"Whoa! Emeril's is by far the fanciest place I've ever eaten in my life. I probably wouldn'","useful":5,"cool":1},"cuq8EXqwGGGBGLruGpBsww":{"text":"I was blown away by the excellent service and food from Emeril's New Orleans.  I've been t","useful":1,"cool":0},"0mOMU4CHOLQiSNc8VwyB8A":{"text":"The staff was terrific. Did their best to accommodate us even though we didn't have a rese","useful":0,"cool":0},"JkOHANv9lHSUMIL8ieLPng":{"text":"Start off with service. Thinking since I was going to a fancy place there might be some sn","useful":0,"cool":0},"PD_w85pW-Nm0OEl09n7RLA":{"text":"This restaurant exceeded our expectations. The food was too good! Barbecue Shrimp was awes","useful":0,"cool":0},"fh1ZvNTl7BozmQi1EI-oZA":{"text":"The service was top notch. The food was on point. Loved the soft shell crab and the pork d","useful":0,"cool":0},"7Upt8tZmD_d2f1cjFdvsLQ":{"text":"Every trip to New Orleans, we find ourselves making a stop at Emeril's. Sometimes, we just","useful":0,"cool":0},"9h46b2vxDuFjWax54GY8yA":{"text":"Sometimes when a celebrity chef has a restaurant people go because of the name. I saw the ","useful":1,"cool":0},"x0JeVHA76Xb4NMIymU_geQ":{"text":"Came to NOLA with 9 of my girl friends for my bachelorette and we had dinner here on our l","useful":0,"cool":0},"J4FsNmuoPRmGj9Ew_X_7aA":{"text":"So I have dined here several times but never written a review. The service is always pheno","useful":0,"cool":0},"y_WsMPYcBcEFbuaK_TK5Hw":{"text":"My fiancé and I had a great dinner here. The ambiance was nice and the decor is pleasing t","useful":1,"cool":0},"GApH2LZ3nmA4r85vD3PpwA":{"text":"WORST SERVICE EVER. We arrived and were seated in a very NOISY dining room and a very rude","useful":1,"cool":2},"5WL_ZZaehgy6bnED4yTPMA":{"text":"Do NOT waste your money or time in this tourist trap! Shame on you Emeril for fooling us! ","useful":0,"cool":0},"QzVap9AY4yFJjU9ReHpYog":{"text":"We have had fantastic meals at top rated places this week but tonight's meal at Emerils wa","useful":0,"cool":0},"P7wDhPUXBB_s4DPLT3Lu3Q":{"text":"My husband and I went here for an anniversary meal and it was SO worth the price we paid. ","useful":0,"cool":0},"bbkWEWS8NgDyrXLeswa4pQ":{"text":"I wouldn't waste your time dining here with all of the other great options in the Big Easy","useful":1,"cool":0},"QU4k7dIYPSL7qU1qYlo8vg":{"text":"So far our worst meal on this vacation.\nAlthough others have said that the food is well ex","useful":0,"cool":0},"ohPvr__XXmIR0DzQuy9reg":{"text":"As always, Emeril's did not disappoint. We had the pleasure of eating in the kitchen with ","useful":0,"cool":0},"RJNIaM0Td3p1zkRcixhZUw":{"text":"This is a grand place lots of interesting choices. The best gumbo ! and we had the duck wi","useful":0,"cool":0},"KAc9pcBkJ9ScgihADxWLgw":{"text":"Good atmosphere and the wine list is impressive. That being said the name of the restauran","useful":0,"cool":0},"EpclJnfq_iRlif3yg_HgDA":{"text":"You have to really like seafood and Cajun style food to possiby like Emeril's NOLA. We had","useful":2,"cool":0},"LZW_yVbCZTgT9xQJAN4Vvw":{"text":"First a couple of comments. I do not send food back: ever. If the meal is wrong I don't ne","useful":0,"cool":0},"nwvvViTcX4CqB4KDfoe1NA":{"text":"Great place! A group of us in town and decided to come here for dinner.  Food was outstand","useful":0,"cool":0},"2KLHv2WoJazbgU1pWYgbGA":{"text":"My son (12) and I went for a special dinner together to try out Emeril's food in person. I","useful":0,"cool":0},"7aPmNq024eGC9hoAq5asCQ":{"text":"Emeril's New Orleans is one of the better restaurants I've visited while in New Orleans. I","useful":0,"cool":0},"Txm04hSngmJpZgnEb1KMmA":{"text":"Being an Emeril fan as a child, I idolized the renowned chef and his culinary works of art","useful":5,"cool":1},"ERXhLPL1elHQFI0fsY4EHA":{"text":"Fast service! Delicious food. Kind staff. Great breads! Dishes were scrumptious! The bread","useful":0,"cool":0},"nPC6nW6ZInkAhP-0uDW7Hw":{"text":"We were on a trip celebrating our anniversary.  We decided to try Emeril's.  The service w","useful":0,"cool":0},"Ry_7pocLHzf3fip7JgqXcQ":{"text":"Incredible service. Truly amazing. Had the Pork Chop and it was spectacular. Never had any","useful":1,"cool":0},"To8W6_YNcZCeeAgNuDtQAw":{"text":"Fantastic food! The chicken and Mac n chz is a must have! Some of the juiciest chicken I h","useful":0,"cool":0},"p91cHuUpvCk_bWU2om8ijw":{"text":"Meh, I've experienced better at every other Emeril restaurant so far.\n \nI have to say that","useful":0,"cool":0},"kn5BRJoai2XAv4evbolTmA":{"text":"5 stars across the board. This is a restaurant that has everything someone could want in a","useful":0,"cool":0},"tUZuCvZKbCaHoPzI50MUBw":{"text":"To to bottom everything was lovely and classy servers were very attentive and professional","useful":0,"cool":0},"uob5H-iIePerIQl-YuUaWg":{"text":"The best made all my culinary dreams come true much different than the one in Orlando. But","useful":0,"cool":0},"mDLYFg16X7ATUfEyyk4t7w":{"text":"Walked into Emeril's 1 HR before closing and was kindly greeted by both the valet and fron","useful":0,"cool":0},"d9ynmoSfBM3YXAh6ENccwQ":{"text":"If I could give more than 5 stars I would. This was our first time here, visiting New Orle","useful":0,"cool":0},"JhEbxInIGeNZd2M1UTJ_jA":{"text":"I highly recommend this place for dessert!!!\n\n5 stars for the dessert, which for me was Da","useful":0,"cool":0},"t-xOcTHdAAlr0t3TwW15hg":{"text":"All around best place to eat in New Orleans! From the service , food and wine list this pl","useful":3,"cool":0},"adqYNHSWOtVFMmo-Ebkr0g":{"text":"Surprisingly and disappointingly mediocre. The atmosphere is great. The place is beautiful","useful":0,"cool":0},"eGLAlFbPd7teoTTBgUGvhQ":{"text":"I feel terrible that I did not write this sooner after I ate there (it's been a few years)","useful":0,"cool":0},"PsrsvrzksV1TVn4unSJUxQ":{"text":"2 stars. made the martini wrong, no olives as requested. Star 1, shrimp and oyster gumbo, ","useful":0,"cool":0},"5zXc0QgPHHHCp4PxrNKyUw":{"text":"Disappointing...  Perhaps celebrity chefs are unfairly held to a higher standard, but we l","useful":2,"cool":1},"Ou6kXxC-Jl62KeVxRcef6Q":{"text":"My two friends and I came here because I wanted to come here after watching Emeril on TV s","useful":0,"cool":0},"D9PaN1sMPROnYtYiDeJjfA":{"text":"This was without a doubt one of the top 5 meals of my life. Everything from start to finis","useful":1,"cool":1},"-jKDUvyY71AE0uI5FFaIDw":{"text":"This was our third day in NOLA and this was my favorite meal- by far. It hit on all notes.","useful":0,"cool":0},"Hs5wtOg3BagabG6S6I0jNw":{"text":"Had lunch here today.  I've eaten at Emeril's Vegas a few times, and NOLA here as well as ","useful":0,"cool":0},"GkWFwGNRQbbR0oplE9LcKw":{"text":"The entire meal was outstanding. The stuffed oysters were flavorful and well balanced. The","useful":0,"cool":0},"Uztgzo4hFvrvztzE0NJJPQ":{"text":"Try it out for yourself, but be prepared to wait for your meal. We ordered a glass of wine","useful":2,"cool":0},"yWwmYyE8qqqM5hdX68MxwA":{"text":"I ordered the truffle chicken for two and couldn't be more satisfied. It has a herb rub un","useful":0,"cool":0},"qz4EOVVwHwrTpNv2oaDsoA":{"text":"We had New Year's Eve dinner here. We like Emeril restaurant but I have to admit the food ","useful":4,"cool":2},"3ZBSGLuJD2Ig9uHx4coN2A":{"text":"Service is great here. I had their gumbo. It was good but I like the gumbo from the gumbo ","useful":0,"cool":0},"xlAV9IIJjSOEnS9_II7KQw":{"text":"Had to try it given its fame. Lunch was very quiet on a Friday with a 1:30 reservation. Se","useful":0,"cool":0},"wlSyqVwsoVeXPzAxdTqL2Q":{"text":"Best food we had while we were in the south! Clean, nice, cooked to perfection, and very a","useful":0,"cool":0},"NhAiDg-6B9i5fehHBkRaBg":{"text":"Only for those too lazy or unimaginative to find a better eating place. Worst restaurant t","useful":0,"cool":0},"rW-Fja7pmX2753G-pnKb6w":{"text":"Shrimp appetizer was good but not great..free corn bread was ok not great..my fish was dec","useful":0,"cool":0},"_UMhzegdOWqpVF5lOgFWZQ":{"text":"I like this restaurant. The servers are friendly and accomodating. The food is handsdown a","useful":2,"cool":0},"51ebRordon5P3MM05MXDKw":{"text":"Considering both the service and the food were below average and the price was too high I ","useful":1,"cool":0},"HDGgpOduG6bObE095HdR6w":{"text":"Emeril's definitely lived up to the expectation of amazing food and service. Each thing we","useful":2,"cool":2},"PKlWo480d3BUnpnKErPA5Q":{"text":"My brother and I recently took our elderly grandfather for dinner while on a trip to New O","useful":0,"cool":0},"6Z1EcklkxYIXBODHfzKm3w":{"text":"Fine dining and breathing:)\nMy friend and I visited New Orleans for the very first time th","useful":0,"cool":0},"79Blla69M4fpjH5fqs7wLQ":{"text":"My BFF and her crew had dinner here last July during the Essence Music Festival.  We were ","useful":0,"cool":0},"9pA4rY4bxiZLSYOKR4iIQg":{"text":"I drove to Emeril's in New Orleans to eat a good meal because I have ate at his steak hous","useful":0,"cool":0},"c48WHSFpwtambc-R-6YNsQ":{"text":"Absolutely amazing service and food. Go fir a special occasion and you will not be disappo","useful":0,"cool":0},"V5iTvW3znYGkFtlocjxO6Q":{"text":"Food was fantastic, staff VERY professional. Only complaint is that i made a reservation a","useful":0,"cool":0},"VzDsXrkJKIt2ANgi_5Vz9w":{"text":"We held a birthday celebration dinner in the Wine Room at Emerils.  Ashton Senn was very h","useful":0,"cool":0},"wSyApm7-GapJwEbvaThY2A":{"text":"The food was great, the service was amazing and very precise. At no point did our glasses ","useful":0,"cool":0},"30a_Y21n-8buy1MWZj8cgw":{"text":"I ran into Emeril doing some filming in a whole foods in Virginia. I like it better when I","useful":0,"cool":0},"ggZXmxhsa5K8Ua3cgqooHg":{"text":"We were eager to hit one (or several) of the celebrity chef's restaurants while on a girls","useful":1,"cool":0},"xC3GBOMmVN-LX1hL1vjXYg":{"text":"I had the opportunity to eat lunch at Emeril's with some colleagues and it was just okay. ","useful":3,"cool":0},"p8jMPCz3x7XlKXmMimj0cg":{"text":"Wait staff was great and attentive.\n\nFrom what I can remember I especially liked the BBQ s","useful":0,"cool":0},"KkQ8bFlJIloB_8eo734W2g":{"text":"I went to the restaurant with a healthy dose of skepticism.  I am pretty snobby about food","useful":1,"cool":0},"NNeDXavToG7rPP6ed9zrvA":{"text":"As you might expect, Emerils is quite popular. Reservations recommended. \n\nI enjoyed an ex","useful":1,"cool":0},"kJwmX0cW4ePFvlvGWqS8CQ":{"text":"A visit in NOLA can't be complete if I didn't dine at Emeril's. Service was friendly and p","useful":5,"cool":3},"sNuQREIDRej66TEtA6JZyQ":{"text":"The andouille crusted drum was awesome. Wife ate the steak - which was great - but not tha","useful":0,"cool":0},"NOmOmEcBV2BzlgwLfDms2g":{"text":"As a New Orleans native, I've eaten at many a New Orleans restaurant, and Emeril's stands ","useful":0,"cool":0},"7KPbLE8XI-ha2xQwKd_U1g":{"text":"The food, ambience and service were an absolute delight. Thank you for making my dinner a ","useful":0,"cool":0},"yrB31Hsi1io5JfB2cL1T7A":{"text":"Ideal for sitting at the bar and having a snack. Great great design, lighting, all new. Ne","useful":0,"cool":0},"qNcSe8fU1DXQKoeUVHvzeA":{"text":"The bread samples were amazing, our meal creative & delicious, dessert was amazing. The se","useful":0,"cool":0},"KVGKZhydRP0Ewo0TtHSykQ":{"text":"I have to oppose some reviews that claim this restaurant has become sloppy. The staff cert","useful":0,"cool":0},"PuBKTe32QH2WFntFa3KKqQ":{"text":"Reservations, though no necessary are highly recommended. It's on the pricey side but you ","useful":2,"cool":0},"AyGCegDrhac5TPSOVddGGw":{"text":"Shockingly mediocre. I've dined here numerous times and it has always been a true pleasure","useful":0,"cool":0},"6m0r7m2jO0o3fn-ufVix4w":{"text":"While out seeing the sights of NOLA, we dared to go to Emeril's for lunch... looking like ","useful":0,"cool":0},"yYaebaxFPnwxoWO2EYCDMw":{"text":"Good food, check.\nGood service, check.\nFood out fast, check.\n\nFrom the begining every thin","useful":0,"cool":0},"6OzFv0hCl7LgsrMiDd3TjA":{"text":"Nice place, good service ...ok food.\n\nThere is nothing special ...group of six and several","useful":0,"cool":0},"iOAMpbiXnsrYH9WCCxx3dA":{"text":"My mom and i went for lunch here mid-week and were both pleasantly surprised by the profes","useful":0,"cool":0},"J0HabDisGdahLrEW0XS6sg":{"text":"Let me start off by stating this restaurant inspired me to create a yelp account after abo","useful":1,"cool":0},"nU0dBDzdXrQGx05KJaFffg":{"text":"My wife and I were pleasantly surprised that Emeril's lived up to its rep. So many times B","useful":2,"cool":0},"C6tK-a1n0az1w-uGxQ0v0Q":{"text":"I took a friend of mine from out of town, and had dinner here this last Saturday.  The cho","useful":1,"cool":2},"bPcDqPLlOEDzBxSxRH0xgQ":{"text":"Amazing food, amazing service.  Went with a party of four and we all enjoyed everything ab","useful":0,"cool":0},"hPRSV-kJbN7kKYPGt-QDtA":{"text":"The breads to start were awesome and addicting. Read Momo B's review as she does a much be","useful":0,"cool":0},"CxSi4rDgjd8BkikLe2SixA":{"text":"I ate at NOLA's the first week it opened, Emeril's Delmonico in Vegas and Nawlins, so my e","useful":1,"cool":0},"YCjwnnDKRR0aqoIaa1DReQ":{"text":"Great service. Fish cake and the bread at the beginning was good. Wait staff was incredibl","useful":0,"cool":0},"F-ablxTtyXnRx6r87b7jWA":{"text":"3.5 STARS\n\nWith reservations, we were seated right away. Though it did take awhile for our","useful":1,"cool":0},"uMF6-YFf1QjQCBxL34w_0w":{"text":"On business from LA, but it was a homecoming as I was a regular when I resided in NOLA.\n\nS","useful":0,"cool":0},"-5x263tM7TQd5qcgZZIb5w":{"text":"We had a hit and a miss. I got the drum fish with the creole sauce. The waitress explained","useful":0,"cool":0},"JTFLJ52cVimzROsD45Huzw":{"text":"We just had to try an Emeril's restaurant while in NOLA. We had a Lamb meatball app that w","useful":0,"cool":0},"7e0J6-RVanXJJeOWbskkxA":{"text":"They have an extensive wine list but the prices are outrageous.  We ordered a 75.00 bottle","useful":1,"cool":0},"EHzHUD0-Bge4lFrW4gUWmQ":{"text":"Went there in December.  We were a group of four, hubby and I were entertaining people fro","useful":0,"cool":0},"CmoCacZD8PjoJ8IIVDbJXg":{"text":"I have to confess that I am obsessed with celebrity chefs and I especially love Emeril. He","useful":3,"cool":1},"6Nq_S_w1UTq3jVXhJMf62Q":{"text":"Creative fish of the day was solid.  Swordfish over crawfish and fries covered in gravy.  ","useful":0,"cool":0},"KebAOac8wf8TLUCZ7b-FHQ":{"text":"Never a disappointment when I come! The food is dynamic, service is genuine & friendly! Ch","useful":0,"cool":0},"_hwuiRvLMSk_Ht5cP64ryg":{"text":"It pains me to give an Emeril's three stars, but out of the four locations I have sampled ","useful":1,"cool":0},"582bWyoocBc4quivDJFUvQ":{"text":"Dined with two business companions for lunch. I had the \"BBQ\" salmon which was good, but n","useful":0,"cool":0},"MkAsF9QskrK4I_x_xrp2aQ":{"text":"Not very good by New Orleans' standards.  Ate here twice to make sure the first time wasn'","useful":1,"cool":0},"RVxhlqo2-GTp3fa0rl_KKA":{"text":"Amazing food! Amazing service! Amazing presentation! This was such a good meal, I would re","useful":0,"cool":0},"dhcvurtpNIuqxkhZUYlm-A":{"text":"After a disaster experience at Nola's a few days before (see my review) we decided to try ","useful":1,"cool":0},"iPTUwpEdMh2-W_KyvcZR7A":{"text":"They kicked it out of the park! THE BEST service! Great appetizers! They gave us a surpris","useful":1,"cool":1},"4AAshZXFsxp6c7fYb3yMAw":{"text":"Fantastic. We had a pretty large group (6) and they accommodated very well. Highly recomme","useful":0,"cool":0},"8FZhOBrPlF0m_wBHhfW3Fg":{"text":"We were disappointed with the food. We had a 9:45pm reservation & were too hungry to wait ","useful":1,"cool":0},"cNTNtK7gWB4fdzH1EensmA":{"text":"My wife and I were visiting New Orleans this past weekend...decided to give Emerils a try.","useful":0,"cool":0},"aJPGw6S7deKBoAqI4fJOfQ":{"text":"Went for the name...and was a bit surprised that the experience proved to be so solid on a","useful":0,"cool":0},"7sPK0CwzGCy-58GxFhMRWA":{"text":"Dinner at Emeril's The food was amazing, but the wait staff needs more training. Pointing,","useful":0,"cool":0},"_TlLFfEO-YAvhaSZNXbMrA":{"text":"A staples of New Orleans cooking, Emerils has the daunting task of being able to supply th","useful":2,"cool":0},"IVCOmSZkAbTxnWlTaN9rGA":{"text":"We went to Emeril's on our first night in NOLA on a whim. We didn't have reservations but ","useful":0,"cool":0},"YTJa24JVwCuqCaPWRIMvdA":{"text":"We came for just the dessert because heard the banana cream pie was out of this world.  It","useful":1,"cool":1},"43Sh-94l_uSXTDWSBXxfEA":{"text":"We were in New Orleans for a couple of days after a cruise, our hotel was one block from t","useful":0,"cool":0},"Ui1ccBS18cUnvd_gwRYjRA":{"text":"You know the man. You know the food..now..come treat yourself to some fantastic service wh","useful":0,"cool":0},"RcClAzPPOLxQJBXQ8ii9Cg":{"text":"Came here for lunch during our vacay in NOLA.  We ordered the crispy calamari, chicken & w","useful":0,"cool":0},"kmz8eWHgSaM034mwVN1ySg":{"text":"The insanity of yummi-ness! I'm local, and after a long break have eaten here twice in two","useful":0,"cool":0},"o5yPUXksdOIY0FcVVDrzOg":{"text":"I'd probably go 3.5 if I had the option.  The food was good and the service was nearly per","useful":0,"cool":0},"vVZUBpuX2zfXHuVfFb78rw":{"text":"Amazing! NOLA is still my favorite, but this was a close 2nd. Wine list was awesome and th","useful":0,"cool":0},"8cdoRaXwVaSszRYPsflaZw":{"text":"Way better than i was expecting - not sure why i always thought it wouldn't be good. I was","useful":0,"cool":0},"_0uWfESvyth2Ctzo9KKFNg":{"text":"Service top quality, but the ribeye very hard to chew seemed of low quality! The pasta was","useful":0,"cool":0},"kXe_loRT2ybusFuFU4ZKng":{"text":"Incredible service! From the moment we stepped through the door the maitre-d knew our name","useful":0,"cool":0},"2QQPDJWE-sr5QZinuTSYWA":{"text":"Food was great! Service could have been a tiny bit better but the quality of the food push","useful":0,"cool":0},"FVSTvy-m8IoY3Mr218PoQQ":{"text":"Great place and food. Really liked the special appetizers which was fried green tomatoes w","useful":0,"cool":0},"yCUyyK--BCInk86FDpkGCg":{"text":"Had a great time with a group of 5 and the waiter was very helpful and had a great twang w","useful":0,"cool":0},"fKwVwgSEngKd_slCzUif4w":{"text":"Great food, meh service but not enough to deduct more than one star.  Started off with som","useful":1,"cool":1},"uHPKznORY-ygfd1ixqH-kQ":{"text":"Good, not great, just good.  Ordered the salmon, which was cooked to perfection, but the s","useful":0,"cool":0},"2pR_3L8bzdR6j1olaTrk8A":{"text":"Being a visitor in NOLA, I felt the need to try out Emeril's restaurant.  Boy am I glad th","useful":0,"cool":0},"81DMRTiKMV0DIcWM0pF0-w":{"text":"Had to drop by one of Emeril's Restaurants during my stay in NOLA! I had tried NOLA (anoth","useful":1,"cool":1},"0XnztMKch7M1YicR33xt-w":{"text":"What a fantastic meal we had here!!  We started with the BBQ shrimp appetizer which consis","useful":1,"cool":0},"8_ELQSrxnmT6MCwbWcEIig":{"text":"I'm not an upscale eater normally, so this was a real treat. More often than not upscale r","useful":0,"cool":0},"v62twRadDAo3UnRdAwKg8w":{"text":"Came here for lunch on a Tuesday afternoon and it was fairly empty. The service was specta","useful":1,"cool":0},"pfSqTIWDX5VehzAXhs8_4w":{"text":"The best meal I had in NOLA.\n\nFine dining at a reasonable price, complete with servers put","useful":2,"cool":0},"GzaRdrbvJaSCXyh_1Nx1qg":{"text":"Started off with great service.  Each had a drink before ordering dinner.  No soup or appe","useful":0,"cool":0},"dL2pmo3eLTpxwzlYbDvKHQ":{"text":"Given the owners reputation I had high hopes for my meal at Emerils. I was disappointed. \n","useful":0,"cool":0},"4vHQy2Xlpj3tR_nJHucC1g":{"text":"This was our first visit to this restaurant to celebrate my birthday. The attention to det","useful":0,"cool":0},"AXrP9mnNSjBxg0bvo44VvQ":{"text":"I was skeptical of going to Emeril's, even though everyone told me it was not to be missed","useful":2,"cool":1},"Ra3yzX5iX55QWeigGs5Vjw":{"text":"Great decor!. Business Casual. Bright crisp dressed waiters. Expensive but worth it. Pront","useful":0,"cool":0},"BP4f3aUd0RFIFWNMWwLKyw":{"text":"I cannot even begin to describe how incredibly good the food is at Emeril's. A definite MU","useful":0,"cool":0},"5dE97OEDb2qaZ5cpiAazIw":{"text":"There was a party in my mouth and you guys were not invited!!:-) I'm so glad that I got th","useful":2,"cool":1},"u34CByB9i7OH27fyTP5UbA":{"text":"We are long time Emeril fans and we're looking froward to trying his flagship restaurant. ","useful":0,"cool":0},"kF3N8m2ULzx2yURRY1iVUw":{"text":"I think I was a little too excited to be going to Emeril's. I'd been anticipating this din","useful":0,"cool":0},"bIQqy5VwsBWOO2yH8Ohq-Q":{"text":"I am giving it a 3 because even though I stated my food restrictions,  they still brought ","useful":0,"cool":0},"4P_fQ_NrNzoXX-E-_vsXpQ":{"text":"Went in September 2008 just after Gustav. Even though most of the city was evacuated dinne","useful":0,"cool":0},"blbsCknACep7yTgVxFj-NA":{"text":"Food was excellent, and the service was even better!\n\nMy dinner was cooked perfectly, I ha","useful":0,"cool":0},"SpC5WzDdwLU8snT0uMABqQ":{"text":"I've eaten at a few different Emeril's restaurants in my day and they were okay. This part","useful":2,"cool":1},"GLiAPVTsJOG__nF-ysMEww":{"text":"Holy goodness! We hit the jack pot today on food, but this place was incredible! I don't h","useful":0,"cool":1},"SeK9C6qt5mHK49e-1QZxpw":{"text":"We made reservations for the restaurant a couple weeks in advance but this place was delic","useful":0,"cool":0},"WPux7sXbw0NVLSGQ4FqK2g":{"text":"Best duck I have ever had anywhere! Completely tender and full of flavor. Also ordered the","useful":0,"cool":0},"MsYlVrJswO7IQrtohmVR9A":{"text":"if you are visiting New Orleans, I would recommend this place for a nice dinner!\nmy wife a","useful":0,"cool":0},"jP9tsVDrGP58b3anPdkl1g":{"text":"First time in New Orleans in a business trip. Also first time visiting Emeril's. By far th","useful":0,"cool":0},"br7VmgnMn8um2g8p6pMNdA":{"text":"Don't just look at the reviews make the reservation!!! I came here for my 23rd birthday. A","useful":1,"cool":0},"1QXpuUyDwGw0q1VD3P2T_g":{"text":"I had a fantastic dining experience at Emeril's. Though the reviews on here are quite mixe","useful":0,"cool":0},"sGX1p_wLgocjdCiHUVpn4w":{"text":"I visited Emeril's for lunch and for dinner. The lunch was better in terms of food, the di","useful":0,"cool":0},"4eetuYqzF2fPA8-ORQh68Q":{"text":"Awesome overall experience. Staff was friendly and took care of us. Food was delectable an","useful":0,"cool":0},"TemgOcMCvkKEXPIlHsnVAA":{"text":"Amazing! We were walked through the restaurant and everyone said hello. They said our diff","useful":0,"cool":0},"B4CR5I_rvSwa9w2aWzVyuw":{"text":"The atmosphere, the food, the service, the creativity, the presentation....you've got it a","useful":1,"cool":0},"gCSXdbk4VnnaMz6S2KsGBg":{"text":"Maybe it was my experience that made it 5 stars. Sitting at the kitchen table made my whol","useful":0,"cool":0},"AA5p9AfvjsJlI0zXDMPrQQ":{"text":"I was expecting so much more from Emeril's. Their food was mediocre. I feel the price we p","useful":0,"cool":0},"9VL6VtU81yTMt4koHM55kQ":{"text":"This was an amazing lunch with a disappointing dessert. I really didn't like the peanut bu","useful":0,"cool":0},"KXGfSiBYLLQcdt3V-BgriQ":{"text":"One of the best meals I have had the pleasure of experiencing.  \n\nThe bbq Shrimp appetizer","useful":1,"cool":0},"BQGWBwF7Ql02HB6bD29PHw":{"text":"My husband and I started our dining experience at Emeril's with the BLUE CRAB & BRIE appet","useful":0,"cool":0},"631Gm3x8brx45HV8ttS7xA":{"text":"This was my wife's pick.  She wanted to see where Emeril got his start.  Personally, if th","useful":0,"cool":1},"wkB_f89qUPb4RSWS6v0E8g":{"text":"So first off I was so excited for trying his flag ship restaurant and after loving the one","useful":0,"cool":0},"-7zaHSF4rdv-yWswvVNKkQ":{"text":"What a great place! Never had an experience like what I had at this restaurant. We sat and","useful":0,"cool":0},"DJdmG4YKgQcWBg47OHmu2g":{"text":"Absolute favorite meal in New Orleans, Hands Down.\n\nWe have eaten all around the world, an","useful":1,"cool":0},"SHxuQcP-UoIQoyoZ3B0oiQ":{"text":"Fantastic- Best of many meals in this Food City  - including Commander's Palace and Mr. Bs","useful":0,"cool":0},"DxEplBfrf1Zk6yEvnAtSgw":{"text":"We were looking forward to a fabulous dinner, but found ourselves faced with ordinary meal","useful":0,"cool":0},"8OjF97KAmwkrdGDRyE8CZg":{"text":"Everything was great until the main coarse came.\nNew York steak..  the worst.  Surprised t","useful":1,"cool":0},"P6gz43DF92-3rCF_w80mtw":{"text":"I made reservations for 5 for a Monday night. When we arrived, service was prompt and atte","useful":0,"cool":0},"2L5lrQDaQGedhi8Rsl5tlQ":{"text":"Sorry to say it didn't hit the expectations.   Friendly service but kitchen was slow. Gumb","useful":1,"cool":0},"7OlMYMWAlHX7NVBnclX-3Q":{"text":"The service is superb. Food is absolutely delicious! Ate here for Easter brunch. The drum ","useful":0,"cool":0},"G1lCefOrDN0MbSbVYIYvPw":{"text":"This is great restaurant! \n\nThe place itself is fairly large. Lots of exposed and painted ","useful":2,"cool":1},"I2LLyDPAGe56bULQ9v_uSQ":{"text":"TL;DR: Unremarkable food and spotty, inconsistent service. Made for a disappointing New Or","useful":0,"cool":0},"xJ3vN7J2ocKqzqp7W5Nd3g":{"text":"Wow! The service was spectacular!!! The prices were amazing and the food was delicious! We","useful":0,"cool":0},"kj4JOfCtNQwDIrhHXu7LaA":{"text":"One of my favorite places to go in New Orleans. The place sets the standards for service a","useful":0,"cool":0},"hK2cLhgYc_1EWYzgAtEIGw":{"text":"I am a tad wary of celebrity restaurants but am awfully glad I decided to have dinner here","useful":0,"cool":0},"vcI62MPIGS-rD_2WFrdlLw":{"text":"I was super Excited to visit the famous Emeril Lagasse restaurant!  I grew up watching him","useful":3,"cool":0},"i7A7FVuu12TqVb2YAt7ufg":{"text":"Emeril's is a classic New Orleans restaurant with a modern and upscale yet relaxed atmosph","useful":1,"cool":0},"WmJxhZTe9NuDP1n25XY04Q":{"text":"My Now fiancé and I went there for our first date and i could not be anymore satisfied wit","useful":0,"cool":0},"X7us-TsAlztchp-PVPI69g":{"text":"Incredible meal!\nService is excellent. \nThe staff goes the extra mile to make your dining ","useful":0,"cool":0},"LAaqb_QPW3hKzT8h9_FPdA":{"text":"Here I am sitting at 3am writing this review after a very disappointing birthday dinner at","useful":0,"cool":0},"HqctGZDpsbpH9ADZ3PK7YQ":{"text":"The anticipation and expectation did not live up to our standards. Unfortunately my swordf","useful":1,"cool":0},"R9x4GQ1YBl4bXtKWXNt7DA":{"text":"Not too bad. Emeril's is a nice relaxing environment.  Enjoyed the experience. As our grou","useful":0,"cool":0},"c11jPPppfVH-Ytsq1pc9bw":{"text":"The food was only lukewarm. When the waiter and manager came over, what they could offer w","useful":0,"cool":0},"U7S7-49Nup0oBaSHFA_HVQ":{"text":"Fantastic experience.  The service was exceptional and the food was delicious.  My daughte","useful":0,"cool":0},"NanyPwR6KVcbKYiBuxKiWg":{"text":"Was unsure of heading here and was pleasantly surprised with a fabulous lunch at the chef'","useful":1,"cool":0},"nIBszCgNuRuwHU0NUvc1Cg":{"text":"Any city that I visit that Emeril has a restaurant is sure to find me there! I've been to ","useful":3,"cool":2},"yBj-Uj0ivXLAQA5_chJuhw":{"text":"The paella and seafoods were Great. As well as the roasted chicken. Escargot was delightfu","useful":0,"cool":0},"XfKIpoccOxkTuygGvUa-ZA":{"text":"Amazing food and great time. It's truly a wonderful culinary experience!!! Will come here ","useful":0,"cool":0},"At9WoDGzB7T6YtUDBkNHBg":{"text":"I was pretty excited about visiting Emeril's while I was in New Orleans last weekend, but ","useful":0,"cool":0},"uU7yTzUFouGSCXePkaw0lw":{"text":"Just a terrific restaurant all the way around.  Food, service, drinks, and atmosphere are ","useful":0,"cool":0},"yy8aSyETeV1lUqNwLSPwqA":{"text":"This place was phenomenal!!! When a kid says that their parents cooking is the best, it's ","useful":0,"cool":0},"NlwnOCOTJh0QM0zAtHmWlA":{"text":"Delicious! I started with the gumbo, man it was so rich and tasty. Fantastic southern flav","useful":0,"cool":0},"1BeKxsD_0wtq6H96Pkiwig":{"text":"I have had three good meals at Emeril's in the last five years and brought my wife there f","useful":0,"cool":0},"Ua8slh7mkDxzBIGdL8Rh3g":{"text":"I was skeptical because I am wary of celebrity restaurants BUT Emeril was a chef before he","useful":0,"cool":0},"40hQQrTx0hdwgo_mMsuklg":{"text":"Four and a half stars. Excellent food and service. Mac and Cheese that was awesome: One of","useful":0,"cool":0},"uNPlpjLmzZEDKBkmZlsHsA":{"text":"Our delectable chocolate soufflé of a waiter brought us our incredible main course... More","useful":0,"cool":0},"xDLVaWdnMbf1MQtsG6Efsw":{"text":"Easily booked a reservation for a Thursday night for three which we later changed to two. ","useful":1,"cool":1},"wDCaDzke-JFpJSUEdcHBzw":{"text":"This was my first time in New Orleans and I was excited to visit Emeril's as I was a huge ","useful":0,"cool":1},"8RkD5lUabYZTmMCskBzycA":{"text":"Banana creme cake!!! Excellent. In general, I don't get the whole thing about New Orleans ","useful":0,"cool":0},"vfJ0P1ZOANGUbP_amiubMA":{"text":"The food was amazing, as expected. Best chicken and waffles of my life. with crispy skin, ","useful":2,"cool":0},"Nyyq-ulIe1EnBQJpfBpisg":{"text":"The cuisine is very good, pretty much what you'd expect from a famous chef such as Emeril.","useful":0,"cool":0},"GWxtJAG3U-461n8AFPlfig":{"text":"We chose Emeril's restaurant in September to celebrate our wedding that took place earlier","useful":0,"cool":0},"Knsqcf_dQlrv9pQyNeBwvQ":{"text":"The service and food here is amazing. You will not have a better experience anywhere else ","useful":0,"cool":0},"lvPTN56M_w5rcViVvRvTGQ":{"text":"Went here for brunch on Memorial Day! It was fantastic. Service was phenomenal and the foo","useful":0,"cool":0},"33RzgVt3craPU3L2_wtmWw":{"text":"Had an amazing dinner last night. We got the lamb nachos (def recommend), the salmon, the ","useful":1,"cool":1},"mQwF3oo8r_oKTLG8GOpXKw":{"text":"Amazing! From start to finish, this restaurant was phenomenal! I came here with 4 of my co","useful":1,"cool":1},"O8SVpc1arK8-iDShWXx2iQ":{"text":"Service- Lots of staff. Very attentive service.\nMushroom soup soup du jour- very good\nGumb","useful":0,"cool":0},"MezhzGJwIqIjdUk-Iyd0bQ":{"text":"I came here for dinner with my brother. We arrived a bit early for our reservations, but w","useful":1,"cool":0},"poAVxYD2xQfptW09Qz1WVg":{"text":"Alexis was our waitress and was very attentive and helpful. .....we had anappetizer specia","useful":0,"cool":0},"wRgRMibZO_YGLJA5KgRGBA":{"text":"Dined at Emeril's on 4/17 with my wife while visiting New Orleans.  For our appetizer we t","useful":0,"cool":0},"M6DuTYPMPMBRuBwBWnPM6Q":{"text":"The service is amazing. Can't think of a better staff in recent memory. One of our party w","useful":0,"cool":0},"COX0ht4WgdgoqLwSjg0VBw":{"text":"Great (and I do mean great) wine list.  Good food but not great food, and not terribly cre","useful":0,"cool":0},"ofqPe6nm4buXjh733P56Ag":{"text":"Had lunch here during a conference. It was within walking distance to the convention cente","useful":0,"cool":0},"Jnf4xLo6wvEy-oPTbLjrFg":{"text":"Bar-b-q shrimp with a twist! The smoky, slightly sweet velvety sauce provided the perfect ","useful":0,"cool":0},"WLMxunusAq-vKNVetIz19Q":{"text":"We had reservations and everything was going well at first. The team that served us was su","useful":1,"cool":0},"WJOBrlPP9NSf4Jlvt30VRQ":{"text":"I can't tell you how excited I was to eat at Emeril's and the overall experience was wonde","useful":1,"cool":0},"PUnQWj86u0PyvzYtzmq1ow":{"text":"Loved the mushroom bisque but was put off by the ginger in my pork sandwich. Lovely servic","useful":0,"cool":0},"R6UuEcIqtEellXaDwhhrgQ":{"text":"Amazing! I need to eat gluten free and they were very accommodating! The shrimp appetizer ","useful":0,"cool":0},"5ILNPmj2jC9a7il1Huv5Ew":{"text":"Was really looking foreword to a great meal-by the reputation-the seafood bisque was excel","useful":0,"cool":0},"MVK4EmJasBeWWaeJsFLcqg":{"text":"Lovely atmosphere, wonderful service, amazing food. I was skeptical of a celebrity style r","useful":0,"cool":0},"7yXH_gSXrbk5C9WqnGWCwQ":{"text":"Came all the way here from San Francisco just to eat at Emeril's. While the service was fa","useful":0,"cool":0},"e9hws52DEqXiuSfETFh8Hg":{"text":"I LOVED THIS PLACE!!\n\n...ummm from what i could remember! :)\n\nI visited New Orleans back i","useful":5,"cool":5},"cg69NlnG0v0VzlD3SrOV7g":{"text":"From the moment you walk in, you feel like royalty. You are greeted with smiles and warmth","useful":0,"cool":0},"t5LJDbO-DzkwWUcbMglOKQ":{"text":"The first time here and ate at the bar. The food and wine were fantastic! Very expensive b","useful":0,"cool":0},"FN9NusKzlLEco6ARwEd7Eg":{"text":"My husband and I were on the hunt for some good food in New Orleans but we didn't want to ","useful":0,"cool":0},"I3CEoKJyGHzLeeKqyuCYKA":{"text":"In full disclosure, Philippe has always been privately skeptical of Emeril. His mentor che","useful":0,"cool":0},"8haz8ROzrbRJowYdpONh_A":{"text":"We went to Emeril's with a group of volleyball Players and parents as a treat. The server ","useful":0,"cool":0},"EDB2S7Y_IVtTzVZ1lTvyag":{"text":"Emeril's is the #3 dining experience I've had in my life. The atmosphere is incredible, bu","useful":1,"cool":1},"8g_bAxgLhzsL69Gv9E8JLg":{"text":"It's not all about the hype--it was all about the food and the attention to detail by the ","useful":1,"cool":0},"oSAveWjyR_aATDq6S-4kAA":{"text":"I'll probably be the first one to say \"Bam!\" in my review so . . . Bam!  Legendary NOLA sp","useful":1,"cool":0},"A83Q2h0QE9Ozsu2YXvBm0Q":{"text":"BAM!  I love it!  If I didn't work in government, I definitely would've become a chef.  I ","useful":1,"cool":1},"4kAOp3lI08jk3-uVNmHabQ":{"text":"I can't review the restaurant.  The power went out.  \nOur 6pm reservation was put on hold.","useful":2,"cool":0},"27oD9ZaUCDb2islOkAVo_g":{"text":"Last night I had dinner at Emeril's; it was very disappointing.  The service was poor from","useful":0,"cool":0},"HWsXml8kI7V2z6KzL_QVzA":{"text":"I stopped by Emeril's for lunch.  My server, Toni, was awesome.  She presented the special","useful":0,"cool":0},"2HVLkbNlUnDv64AHPCgI-w":{"text":"sat at the chef's dining bar/kitchen bar? funny, they made a big deal about how there may ","useful":0,"cool":0},"T8uoPpqteajZzLFGO04q_g":{"text":"Normally with Celebrity Chef restaurants, I tend to bring my expectations down a notch, be","useful":0,"cool":0},"hcA0d6Fei4ZW7-98gWUwjA":{"text":"We went to Emeril's on our last night in New Orleans.  Everything was simply amazing; from","useful":0,"cool":0},"tFTMK7QRzg-2gJt0HsTHCA":{"text":"I have eaten at just about every Emeril brand restaurant in this country, and this locatio","useful":0,"cool":0},"mO0gXVchMFGdA5rCK0ZXyQ":{"text":"If I was rating solely based on food, it would be a three star.  But seeing how the servic","useful":0,"cool":0},"jGVLroou1S26n5koZ7MBPw":{"text":"Delicious! I started with the gumbo, man it was so rich and tasty. Fantastic southern flav","useful":0,"cool":0},"nS5bzNeIgU9CLhdXXbHCrw":{"text":"Went to dinner with the bride and daughter and we absolutely loved it. The mussels over po","useful":0,"cool":0},"GL-BtLVTh3NHANMHtG1AZg":{"text":"oh man, did i love the food... a couple beers, bbq shrimp, some angel hair pasta with craw","useful":0,"cool":0},"MWqNsgPYbZNUR9z5MxQTtw":{"text":"Bucket list restaurant \nThe food was overall just okay\nDrinks were pricey compared to othe","useful":1,"cool":0},"vWuN1Ys0PZ6BCnmW7VKzew":{"text":"Great service, friendly staff but the worst food we had in New Orleans. Everything was way","useful":0,"cool":0},"i4OMUKnmD_OwyxEZ9fhHJw":{"text":"Very nice dining room, great decor, nice view of the downtown street with a large window, ","useful":1,"cool":0},"PSC26BofZep-NeMADSoYtw":{"text":"I am speechless.  Great food.  Outstanding service.  THE best place I've reviewed on yelp ","useful":0,"cool":0},"KGTsm_5ZTtJggJUymEVnYA":{"text":"My boyfriend had the shrimp main course and I had the salmon.  Both were delicious!  The c","useful":1,"cool":1},"6xL_LX1E2-SAsg7H0_YetA":{"text":"You can sit at a bar overlooking the kitchen.  I highly recommend this.  It is awesome to ","useful":0,"cool":0},"mOeUs3NBKrpW2SDWJwK1_A":{"text":"Very solid.  Wonderful service, good food and a nice lively (albeit touristy) atmosphere. ","useful":0,"cool":0},"fb8YcItI1R7MdS15gV326Q":{"text":"Three years ago I spent my birthday at Emeril's and had one of the best dining and service","useful":0,"cool":0},"swPagciVG-eyic3OmG0O-A":{"text":"Fantastic!  I was wondering if Emeril's would be a bit touristy because, but it wasn't at ","useful":0,"cool":0},"hlgYH3tiMJuOax0RfbyyGA":{"text":"Delicious. Not cheap but ok for what it is. Good atmosphere. I ate at the bar because I wa","useful":0,"cool":0},"1ibaarFyCroO-dwAsEaX4Q":{"text":"Very unimpressive overpriced meal.  Service was good. Had fried chicken and barbecued shri","useful":1,"cool":0},"f39vv9PYCVf99ehfuN5I2w":{"text":"Great service. I dined by myself and the staff made you feel comfortable. Food was amazing","useful":0,"cool":0},"N6y_wg04S9kV2qvttrQUoA":{"text":"Great food, excellent service, prices are a bit high though. Favorite part of the meal was","useful":0,"cool":0},"cmYOI8HRp7XB1epNgdntzw":{"text":"I order the special of the night which was the gumbo. It was basically a light stew loaded","useful":0,"cool":0},"Ic3Jhjc847quFSXB4iBxNw":{"text":"We had reservations for the Easter Sunday Jazz Brunch. \nThere are several things that I ap","useful":2,"cool":1},"zkZpfv23WDql30PRLMy4Bw":{"text":"I had great food and great service. I went in pretending it was just an ordinary restauran","useful":0,"cool":0},"Ifb5VrL7nJc9IJY5JgqLiw":{"text":"My sister chose this restaurant because Emeril is one of her favorite chefs, and this rest","useful":0,"cool":0},"555ASvB8XubVTWDat4yRTg":{"text":"Seriously the best food. Sit at the bar take the recommendations and enjoy. It's been cons","useful":0,"cool":0},"71g4SeOz2OwvWr6NOkECDA":{"text":"Delicious!! Ordered one of the shrimp apps and snapper entree. Well seasoned with rich sau","useful":0,"cool":0},"leMT-msDcxXchkCXqKJGzQ":{"text":"I took a group of customers here.  I'm from Chicago where there is no shortage of great fo","useful":0,"cool":0},"LroNT9Fu3Kha87G3fpc7ig":{"text":"Great dinning experience. Gluten free options and knowledgeable about menu and preparation","useful":0,"cool":0},"QTCHR92ajaeGtiB-Qelvvg":{"text":"Food was pretty good but very expensive. Gumbo was a bit salty for my taste. I got the rib","useful":0,"cool":0},"JSoZM33twzIA9DAgrGKRRw":{"text":"First:  I am a BIG Emeril fan and have many of his cook books, watch his shows, etc. etc. ","useful":1,"cool":1},"zak0XQCPIzRB5MUASVz0CA":{"text":"Even with a reservation, we waited 15 minutes to be seated. Valet was wonderful.  Our dish","useful":0,"cool":0},"jQQD69JuueJHcienykMJ2g":{"text":"Fabulous. The breads that they server you melt in your mouth yum. Split the rib eye with m","useful":0,"cool":0},"3VAsN5RT3NVNmAGbtzUBrQ":{"text":"Must have the bbq shrimp and pork chop!!! Finish that off with the banana cream pie for de","useful":0,"cool":0},"O7NkpbtuVOyYoFDR6l7chw":{"text":"Awesome service and food! We HAD to visit while in NOLA since we used to watch Emeril on t","useful":0,"cool":0},"_5EmS8HtxpSkXsOPniPYCQ":{"text":"My husband and I came here for dinner for our anniversary.  I was worried we were going to","useful":1,"cool":1},"u8EETAxgAtuJm8cO12-CPg":{"text":"I recently went to Emeril's, and I was very excited to go to the restaurant of a famous ch","useful":0,"cool":0},"G_S2MugIDiP9CGVimMcnHQ":{"text":"first off...i'm not a huge fan of emeril the tv personality in general. i'm not really imp","useful":2,"cool":1},"u9MYJyIhLK1JnevHfoxsCg":{"text":"Eat at his restaurant in Las Vegas great food super service would go back. How ever! Went ","useful":0,"cool":0},"ttdrTSJvICroldpu1bfU7w":{"text":"Food was fine. Nothing special. Two dishes had andouille listed as an ingredient, but it w","useful":0,"cool":0},"BCKtvZPHVPqDSE5FEHynKA":{"text":"We went to Emeril's to celebrate my birthday, I must have been wished happy birthday at le","useful":0,"cool":0},"95KkNilc_DuiBUzKilJKCw":{"text":"My best friend and I were in town for a girls weekend and Emeril's was on our list of must","useful":1,"cool":1},"Vit1gq7gQAS2I3UpD4FE-w":{"text":"Like others, I am leery of celebrity-chef restaurants.  But the staff was on top of it, th","useful":0,"cool":0},"TanOI2th40HZKJxakzCDKw":{"text":"Excellent service!  The swordfish entree I had was excellent.  One of my dining partners e","useful":0,"cool":0},"gRtUCxg7og9oPZF8xHkDJg":{"text":"The food, service, and most importantly the wine was superb. \n\nWhen I walked in, they knew","useful":1,"cool":1},"aHC__k-DKFFxuWk56quXdw":{"text":"Awful!!! Stay away!!!\n\n\nThe kale salad was ok same with the duck wings. The gumbo was runn","useful":0,"cool":0},"LMRFdxHo1v_vIqm59YdSzg":{"text":"Heard about the lunch crunch deal here and booked a reservation here for our mini Hallowee","useful":0,"cool":0},"m7MSKqF4_cqBQYXA_9dU6w":{"text":"Good service, fun location (although kind of hidden), FANTASTIC corn bread. They have the ","useful":0,"cool":0},"suUatdATsueyGKhhFJj-VQ":{"text":"Do yourself a favor and order the Banana Creme Pie. O M G. It was heaven. I don't even lik","useful":0,"cool":0},"8IxgXWeZ-l34n-Bsrjd1Mg":{"text":"I planned my trip to NOLA with this dinner being my highlight. I made reservations a month","useful":0,"cool":0},"sALdgGiH33WMecp4bsuYRw":{"text":"Great food , great customer service and very accommodating with our infant ! I recommend h","useful":0,"cool":0},"jNBWQS7duI2kQzXexM5pcQ":{"text":"The food was not bad, but the price was on the high side.  It was good to try one time, bu","useful":0,"cool":0},"JeXPjb0Oub5H1bbSepyEiw":{"text":"Very nice restaurant. Amazing service! I only came here for dessert. I had the BANANA CREA","useful":0,"cool":0},"Zt9YsIf9d0GohYrRMj05eg":{"text":"My first time at this restaurant was in Orlando. Great food, great service and great ambia","useful":0,"cool":0},"lHp_NL9rbrYvJOcTiX8uIQ":{"text":"Nothing was wrong with it, necessarily. Like other reviewers, I guess I expected more. The","useful":0,"cool":0},"DbW4bBzIGviSUDZHrfwO0g":{"text":"Emeril's is, of course, famous, so I went in wondering if this would be all hype or really","useful":1,"cool":0},"56lWoDJ8fRiY004urEff4A":{"text":"I had high exceptions for this place, perhaps too high. Living in New York City, I've expe","useful":1,"cool":0},"q0u9TwwTSfri52O__6YvkQ":{"text":"A classic in New Orleans culinary scene. However last night we went in for the Happy Hour ","useful":3,"cool":1},"pxgxFwA4n-QUeCTvfDC9dQ":{"text":"I am really surprised by all the good reviews here. This was the worst experience I had in","useful":0,"cool":0},"P7bFV1cd9ZYLj_Tr0DpJkA":{"text":"I love this restaurant. Food is really good with awesome customer service. Waiters/waitres","useful":0,"cool":0},"faqMBC_DHk4fN-26csitfw":{"text":"What a huge disappointment. If you want food poisoning, order the whole fish  special beca","useful":3,"cool":1},"_3SsujWfnInqwMEvfdU45g":{"text":"This has to have been the worst meal that I ever ate in my whole life.  Started out with a","useful":1,"cool":0},"2F1acarBF3ejfjYwg8JMOA":{"text":"Walked the kitchen great food! Local foods. Chef with a true soul for food. A must stop in","useful":1,"cool":0},"G3Ve7wgK3Dqvu361ehcf1g":{"text":"It was good, kind of a machine branded corporate place. The pork chop was good, but I felt","useful":0,"cool":0},"nDecbqWY1RP_ksufod8MDQ":{"text":"Disappointing.. small portions and food took a long time to come out. My girlfriends steak","useful":0,"cool":0},"EzZmqjS8wHQPUj1LliRFPQ":{"text":"Let 's keep it real.  We made this reservation two weeks in advance from Colorado because ","useful":0,"cool":0},"HqLD_ylPHPNQxFT42Inp1A":{"text":"Service was very good.  Menu was uninspired compared to our past visits.  Flavors were not","useful":0,"cool":0},"m4jYXDSaymA0MvILrzvfiA":{"text":"So glad I tried this place on my trip to new orleans. Went for a quick lunch.  The lamb na","useful":0,"cool":0},"guKIkhZS6i6wKa8lGjivjg":{"text":"Such attentive service and great food. Our anniversary dinner was memorable. We enjoyed th","useful":0,"cool":0},"Z7cR1NzX2LYr89dyQPnk9w":{"text":"Excellent food and service. Had a company party in the back room and brought the kids. The","useful":0,"cool":0},"ptft73VKzxOs7Ge6EOTatg":{"text":"The nachos..OMG the NACHOS. Never imagined nachos could taste that good! The rich flavor a","useful":0,"cool":1},"Z7_gSy-z-yNYLcfKw_BSxg":{"text":"We dined here last night. Service is a solid 10/10. Food did not disappoint 9/10. The room","useful":0,"cool":0},"uKWiL1IMjqgyzxlBAtviJA":{"text":"Emeril please come back. This place is mostly hype on your name. Service at the bar was ho","useful":0,"cool":0},"woEJ0MG9YHlg4Re31Y5Ovw":{"text":"Wow!! What a great experience. Promptly seated, great service, fabulous food. My husband d","useful":0,"cool":0},"Q8z_206gv-akqYTjl5CeVA":{"text":"Probably my favorite new place to hit up first when Im in New Orleans. Sat at the bar with","useful":0,"cool":0},"smCtMlfgAGhaJ9E8v4b6Mg":{"text":"We got the chicken and waffles and the burger for lunch. Both were delicious! The burger c","useful":0,"cool":0},"NgkTl9pIahbaQqAUwnH3bQ":{"text":"We came to NO for NYE and wanted at least one nice dinner while in town. Reviews were good","useful":0,"cool":0},"cIFit5_Alfc_M-V0BD4m4A":{"text":"Traveling to New Orleans Emeril's was the #1 restaurant I was dying to try & had heard goo","useful":0,"cool":0},"D0Xt2lEc0iRVwDOp1ftSMw":{"text":"A classic in New Orleans culinary scene. However last night we went in for the Happy Hour ","useful":0,"cool":0},"3fmX-j1wgwq8JfD4Eet10g":{"text":"We enjoyed a most amazing Easter brunch at Emerils in New Orleans this afternoon.\nIt is a ","useful":1,"cool":4},"xuzHj08U_snmK4GmVp5VLw":{"text":"Amazing dining experience and food.  We sat at the kitchen counter and was impressed by th","useful":0,"cool":0},"d7UTRv4bsjwi602DHJPjSw":{"text":"If you have a special event to host in New Orleans, look no further. We hosted a party for","useful":7,"cool":6},"saCYtt00mY9E55rH5iuFuQ":{"text":"Emeril's doesn't rest on it's laurels, the food and service were excellent. I ordered the ","useful":1,"cool":0},"uQ-eTa73ni3S6bo6AoXzdA":{"text":"Came for the banana cream pie and ended up eating everything else. I was worried that this","useful":0,"cool":0},"6k3eSdCfz_vOloLSYcownw":{"text":"Amazing meal and the bananas foster was so good! Kevin was so much fun - very knowledgeabl","useful":0,"cool":0},"jMFIC2pocQbDhaT7P_k8xA":{"text":"It was the night of the \"BIG\" Winter Storm in January of 2014 and the entire city was unde","useful":2,"cool":0},"eaiU13KuE8uuVPZhJ_T6ZQ":{"text":"Went for lunch and really enjoyed the food and experience. Service is excellent, however a","useful":0,"cool":0},"nnktqf7pBxpOZ3ySotkucg":{"text":"Walked in with a party of 6 on a weeknight, half expecting to be turned away, they seated ","useful":0,"cool":1},"lWKSIMwBM9pKq-44dYSxiw":{"text":"This place is undeniably the upper tier of gastronomical excellence. If you enjoy an excel","useful":0,"cool":0},"Axcyj0-PjD49iU_gDsIh7g":{"text":"Start your review...The food, the service and the atmosphere are top notch.  We had reserv","useful":0,"cool":0},"5wzaPFJGvK0LRphXL6ZVUA":{"text":"To top off our New Orleans weekend, we all planned to have one nice meal as a group, and w","useful":3,"cool":1},"x6cIXmE5j2czKsToFfKTew":{"text":"Admittedly, the \"celebrity\" factor got us in the door, but the wonderful food kept us deli","useful":0,"cool":0},"abxmbvRKYFMdzf8rQAoCYA":{"text":"Everything one would expect......Beautiful, Delicious, and phenomenal service. I cannot wa","useful":0,"cool":0},"CoVbP6RUKduEGpuVPecGLg":{"text":"What was most memorable about Emeril's was the impeccable service. The food was amazing as","useful":1,"cool":0},"svbqXVrdGaD82hgrW2aUsA":{"text":"Extremely slow service.  Initial bread offering is tiny cheap and tasteless (as well as co","useful":0,"cool":0},"Y8q13jejPORjego5CrtHIQ":{"text":"We made reservations for a Thursday night which was a good thing because the place was pac","useful":1,"cool":0},"V9po-aVYTAzw8vVovA2uow":{"text":"The food, service, and ambiance were all amazing... Also, Emeril was cooking in the kitche","useful":0,"cool":0},"gwARR8HPTnSi7cOhc--2jw":{"text":"I ate here twice on a recent trip to New Orleans for work.  Both times the food, atmospher","useful":1,"cool":0},"rDO1aR1BbpwLqCR2lvvArQ":{"text":"Came to New Orleans on a work trip and hesitated going to Emerils, since he has restaurant","useful":0,"cool":0},"BFFK1LDRIWRZun_UzI-WhA":{"text":"The food was amazing. Expensive, yes. I may have to take out a second mortgage. But amazin","useful":0,"cool":0},"FgcrkqbWC3PH1l-hljYPhw":{"text":"Of course Emeril's is good.  My salad and scallops were awesome and of course the banana c","useful":0,"cool":0},"pCrsfgFRL2huVl9yjOPGvA":{"text":"So Good!!!\n\nEmirel kind of annoys me, so going to the restaurant with all of my coworkers ","useful":0,"cool":0},"OLdMJ5w9mg4Vkx02YeuOHg":{"text":"We always come to Emerils when we are in town. Everything is always perfect. Today was str","useful":0,"cool":0},"MJnIcj-XE_MsSpxwMco7yQ":{"text":"I came here during my first visit to New Orleans. The food was fantastic, the service was ","useful":0,"cool":0},"2r_H6XodoQihUfQ-qxvRsA":{"text":"We tried that place during our stay in New Orleans, the ambiance is nice, not like a typic","useful":0,"cool":0},"RPxRsqne0jBo_IjKDcj1kA":{"text":"Amazing dinner (see my entree photo).\n\nHands down this was the best meal that we had in NO","useful":4,"cool":4},"ZCunuOzIP3NU1bccK-irdQ":{"text":"The three stars given are not the result of the food.  Emeril's New Orleans served us deli","useful":1,"cool":0},"K9yuip9zkNi0s1X3BypMlw":{"text":"Delicious food and fantastic service. I started with the charcuterie which was a special. ","useful":0,"cool":0},"r-41cFH_rg46DdJtyvpmiA":{"text":"We were just in NOLA for our 29th Wedding Anniversary.  We had dinner at Emeril's that eve","useful":0,"cool":0},"7T0ZNttMzc2eJgmJKtOJVA":{"text":"Where can I start? How about with one word -- \"wow\"!\n\nMy friend and I both had the 3 cours","useful":0,"cool":0},"THcoFfUdMeN_1i68SIFlhw":{"text":"LOVED their boudin and home made andouille sausage appetizer and the chicken gumbo was exc","useful":1,"cool":1},"pW-u6cEAomnTRqgWLUiZYw":{"text":"I stumbled upon this gem while I was on my way to Cochon (mostly because I was hungry and ","useful":0,"cool":1},"g5tesUfWx5q8Bskpbtl0IA":{"text":"Very impressed with Emeril's.  The service was exceptional, and the food was great.  We li","useful":0,"cool":0},"Y5PuCmst4jXrJtL6ivWAwg":{"text":"Emeril's is a must visit! The food is excellent and the service is superb. All of the serv","useful":0,"cool":0},"vRpuJ3mMjQE65PNQiuA9Hw":{"text":"Emeril Lagasse may be the most polarizing chef in the world. Casual foodies who enjoy watc","useful":0,"cool":0},"Kzd5Y_MkEqTzuaCoDW6PFQ":{"text":"I have had the opportunity to eat at all three of Emerill's restaurants in NOLA. When I wa","useful":1,"cool":1},"H-gC-mDGGYmNUHTHssIEdQ":{"text":"Ok calamari, bland but crisp tender.  Decent hamburger, stale bun and limp french fries. G","useful":0,"cool":0},"MgAVmTYWhSo05kpyeKXkBA":{"text":"We had a great dinner at Emerils last evening, WOW!!  We had this amazing seafood lasagna ","useful":2,"cool":2},"0OGIDUfIFbv5wCKQnPxtkg":{"text":"Good food, service was not so great. I was surprised to see questionable service at this r","useful":0,"cool":0},"PNnfCp0AnRyr8DGnBV9T-A":{"text":"We had high expectations for our big night out in New Orleans. And they were about half me","useful":0,"cool":0},"yTH6bYrQCLq802wouNNhGg":{"text":"A decadent experience!! The service at Emeril's was phenomenal. They welcomed my family ba","useful":0,"cool":0},"YAlSxZhR64vlyHtNayVA8Q":{"text":"As much as I loved my Salmon I was upset for not getting the meal I desired. I am allergic","useful":0,"cool":0},"hixmpvvqT2xTb5uopw49gw":{"text":"Whomp. Being that it is Emeril's flagship restauraunt I had high expectations.  Took an ar","useful":0,"cool":0},"LAOc3p9FuBW5FbJF0SwDMQ":{"text":"The food was delicious. I was caught off guard by the Mac and cheese collard greens but su","useful":0,"cool":0},"fsK85OfjiTwANVGZwrpKsQ":{"text":"Let's start with the food (when it finally arrived) was very good.  Unfortunately, that wa","useful":0,"cool":0},"uHzFRqpwHjjn-6bQz68ZBw":{"text":"A few tips:\n\nIf you order the Quail Milton make sure you season the haricots verts (string","useful":1,"cool":0},"Q4_9Pl_NYavN_Fxa-twTng":{"text":"This place was hyped in my mind and it came through in every way. First off my wife and I ","useful":0,"cool":0},"3wyKGKbctXMIzhVXxZhFYQ":{"text":"I hate when you read  that place is 'dressy' and you show up and people are in shorts and ","useful":3,"cool":0},"vNki2erHkFhuc0t82B0HCQ":{"text":"The food was SPECTACULAR! For appetizer we had the duck wings ... I'm still licking my fin","useful":0,"cool":0},"RmASkMaIq9ggWLPU6wUhOw":{"text":"We have eaten at Emeril's many times before,  but this will be our last time.  It was by f","useful":0,"cool":0},"vlZNrUdhh9IjsOjWKtXL-g":{"text":"Made reservations for four people on a Saturday night. The restaurant was extremely busy. ","useful":0,"cool":0},"2yPXNmuUyqONcf3J96kBuA":{"text":"This was our big \"splurge\" meal on our vacation, and it was very good.  I was feeling unde","useful":0,"cool":0},"Dsj939GRlAxUNYSQhd7XiA":{"text":"Went here for a large family dinner on a Sunday night.  We were seated promptly.  We order","useful":0,"cool":0},"Og21yMJN6zkaL9mwOxRDhg":{"text":"The food was great, the service was amazing and the restaurant ambience was welcoming.  Ou","useful":0,"cool":0},"_DnaTt5MURO8qwtKUHLYDw":{"text":"I almost could not decide between here and NOLA but after trying both restaurants I know t","useful":1,"cool":0},"PfPNQFmipTh91XV0kcgG6w":{"text":"Really attentive waiters and excellent food.  I got the shrimp and grits as an entree and ","useful":0,"cool":0},"GBmiCgXtXEZ264ljrXkm1w":{"text":"This was a good time! Beautiful restaurant with great service, impeccable timing and good ","useful":0,"cool":0},"c2O41S2KDcprxs0ZlImepg":{"text":"I went there for lunch special.  3-course meal for 25 dollars.  The soup and pasta were de","useful":0,"cool":0},"Dk3DnmB7wW_iJC9BmEKl9A":{"text":"Come here prepared to be pampered! Each table is personally greeted by a floor host, with ","useful":0,"cool":0},"EwpPl8jmoE7MTGy9-ZW7Pw":{"text":"Wonderful! The food was five star. This was out first trip here and did not disappoint!","useful":0,"cool":0},"Bcq7iUCTUp_uxJ3KTmdJlQ":{"text":"I am ambivalent between a 2 or 3 star rating.  The food was at least a 4.  Service was a 2","useful":0,"cool":0},"xdvCLE7Eb1FsKAcOEVgRCQ":{"text":"I had very high expectations going in to this place given its celebrity chef owner and all","useful":0,"cool":0},"tpAEOUMYzW0uEDGUcxzILg":{"text":"The $20 \"Lunch Crunch\" is an excellent value. Between all of us that went, we tried almost","useful":0,"cool":0},"gS3pYqTa9h25SsX7HDd9fg":{"text":"Dining at Emeril's is probably a must when you're in New Orleans.  I booked our dinner res","useful":6,"cool":3},"qZefCVQWBlaqBMWPMqQFVg":{"text":"We dined at Emeril's for my friends birthday. She is a newbie to New Orleans and this was ","useful":2,"cool":0},"h-CF0ngFnmpE_AavQfzvPQ":{"text":"My husband took me here to celebrate my birthday dinner in March.  Unfortunately I was rea","useful":0,"cool":0},"Gsf332g95JJd8aXkM_wyJA":{"text":"Fabulous dinner - the service was impeccable and we weren't rushed at all. My husband had ","useful":0,"cool":0},"2703GE6INjhENkTawZ6z_g":{"text":"WOW!!! Three days later and we're still talking about the best customer service and delici","useful":0,"cool":0},"10F2XRgYnSgORq63ppQHfg":{"text":"They gave us a cocktail menu and never asked for our drink order.  They up sold us on the ","useful":0,"cool":0},"fP7IuEOMBlFcQrmitn6QuA":{"text":"I've tried several Emeril's restaurant and this was def 1 of the better ones.  Service was","useful":2,"cool":0},"UUbFOulrfFl61RmfUp3bkA":{"text":"More modern appearance to the restaurant. Nice metals and earth tones. It's fairly noisy i","useful":0,"cool":0},"tQw030Ih-1_vO92Grj30_w":{"text":"By far best meal of the week in NOLA. Service was impeccable, food was an amazing experien","useful":0,"cool":0},"INgY93dD6DienEkMcsaBgQ":{"text":"The service was great and what I expected from an Emiril flagship restaurant.  If not for ","useful":0,"cool":0},"__P494648oADgrv1odUS7Q":{"text":"Beau restaurant et belle ambiance. La grande cuisine est ouverte sur la salle à manger et ","useful":0,"cool":0},"dEHzvBdV4U_uqMOu9d95UQ":{"text":"I was let down.  I ordered a truffle fried chicken for two. The description sounded fantas","useful":0,"cool":0},"WzwR4sxGyLz_I965ukjR9A":{"text":"I wish I could put more stars for this restaurant! This was one of the best meals of my li","useful":0,"cool":0},"4cAu47n2N74WHcBwkdNIzQ":{"text":"First time going to any Emeril's Restaurant and it was pretty good.  The prices weren't to","useful":0,"cool":0},"58Nol_uviiaWsPuZpUrC8g":{"text":"I didn't think I was going to love this place as much as I absolutely did I am not very fo","useful":0,"cool":2},"0zHvJdxEaQ2Ryz9JFwftvw":{"text":"Terrible shame on your Emeril, your not doingmuch for quality control in your establishmen","useful":0,"cool":0},"qcaOrUH-WaDRxoxg4XF9FQ":{"text":"I think it's a bit overrated. \n\nThe food was good, but I think there are better places to ","useful":0,"cool":0},"bA7H61uu_vWicQ0g2lTImw":{"text":"This is my favorite restaurant- ever. The food is always incredible and the service is awe","useful":0,"cool":0},"a1We7Uy7RVHQiT-_CumfcA":{"text":"Had high expectations and was not disappointed. The food was tasty and reasonable, the ser","useful":0,"cool":0},"czcQvJHsEIfyUG4SoRqgRA":{"text":"The service was good and they tried to pay attention to detail but it wasn't quite the exp","useful":0,"cool":0},"UwVoduxcZAfAAbM7MNbuCA":{"text":"The bride and I returned to Emeril's on the strength of our visit three years ago. I'm alw","useful":0,"cool":0},"ylsEPl-fTv-3Kt3sXxYjEw":{"text":"The evening started off with a bang as the bartenders served up some awesome creations. No","useful":0,"cool":0},"ymWvemGjHjoBg7WNUxPfcA":{"text":"My Hubby and I made a trio here while staying overnight in New Orleans. This is such a spe","useful":0,"cool":0},"M2QsKmBjYdurkgj6fqH6aQ":{"text":"Emeril was my first image of what a chef was. I don't think anyone who's mom watched Good ","useful":1,"cool":2},"bBvZKRTqdFwnjhENxeQhOw":{"text":"Wow the pecan encrusted drum was very good.  One of the best tasting fish dishes I have ha","useful":0,"cool":1},"9jc4LB6MvXZNCmZZit-4jw":{"text":"Girlfriend and I were recently on vacation in New Orleans, we were recommended Emeril's by","useful":0,"cool":0},"xsYk2WFe7-uc_2P31jTkjg":{"text":"Fantastic meal, definitely pricey, but interesting.  I had a house made andouille sausage ","useful":0,"cool":0},"6HpYqGdDi57y82_ihLOSHA":{"text":"Our meal was perfect from start to finish.  Attention to detail was front and center in al","useful":0,"cool":0},"jCWcedi2VtwrDxk6Yu9vmA":{"text":"The appetizers were terrible. The service was slow and below grade for the price. The only","useful":0,"cool":0},"Rin9GxKsvVLaw_DGHfUjhw":{"text":"I have always been a fan of Emeril since his days on the Food Network so when I found his ","useful":0,"cool":0},"T3inCjbKcljD6SNoVuZaqw":{"text":"Get's 5/5 yums to the face boys and girls...\n\n-BBQ Shrimp appetizer is amazing. Get it. Th","useful":3,"cool":1},"SgSyjRQF-uCh5EgiVpjhuA":{"text":"Overpriced for mediocre food. Staff was amazing but was extremely disappointed with the fo","useful":0,"cool":0},"fGusPfaLVXVPi1GiZEsS1Q":{"text":"I know some people think this place is cliche and over hyped but we honestly had a great m","useful":0,"cool":0},"-AYxvam2ZXZfrcJRr2KpYg":{"text":"Great restaurant with great food from a famous chef.  Great service and great wine selecti","useful":0,"cool":0},"YTLKBRqJLRF89ImExFf3Ag":{"text":"Ten years ago we came here and remember this as the best meal we had ever eaten.  Amazing ","useful":0,"cool":0},"rvJLRI9RzsQMmvpSCESvZg":{"text":"So... I went to Emeril's but wasn't really impressed with the food.\n\nThey place is nice an","useful":2,"cool":1},"F97CyYOjNnsDMiCUHVZnCA":{"text":"Just got back from dinner and it was one of the best meals I've ever had. \n\nFirst, the ser","useful":0,"cool":0},"CbLvJ3IEfmFokCQOWODeqg":{"text":"Oh man, I almost forgot to give this place a 5 star review, and that would have been a sha","useful":1,"cool":2},"YKEIj0quQP9q7XH9noPkEA":{"text":"Wonderful food and service!  Our waiter Thomas was very friendly and took great care of us","useful":0,"cool":0},"bLbXXi-8q3tBRscDEUbb8A":{"text":"Love love the banana cream pie. We had to order an extra slice, had a bite so we could tak","useful":0,"cool":0},"1Chwup34W8IeShq_ez8a5g":{"text":"It's Emeril's restaurant. Must I say more ?\n\nAtmosphere: 10/10 (although a tad noisy)\nStaf","useful":1,"cool":0},"BvKYkyTQgAJ3OknkzgqJ3A":{"text":"Amanda at the kitchen counter is a MFing gem. Not only does she slay at the grill, but she","useful":0,"cool":0},"1YhHi6fwpLgNxxkUNwagRg":{"text":"We were able to grab a 9pm reservation last minute on a Saturday. We ended up with a great","useful":0,"cool":0},"QHgxVPHyb3J44uJuBNIDQg":{"text":"Everytime I go here it's not just about the food, the experience is top notch. I highly re","useful":0,"cool":0},"bUYEDABODA5uJbtK85nWXA":{"text":"I have to admit that I was a little hesitant to try Emeril's in New Orleans after having d","useful":1,"cool":0},"4BAiHcq2LcojTtoHm79o6A":{"text":"Visiting NoLa for Mardi Gras week. I'm from Los Angeles and this place was a recommendatio","useful":0,"cool":0},"-yZPb-Ywhn1qzAt4SQlKkQ":{"text":"The food and service were excellent. I would highly recommend going there. My wife and I w","useful":0,"cool":0},"6LYBzmbT3hmiZWzInqHeBQ":{"text":"We had reservation, and were seated immediately. We recommend Emeril's as a place in New O","useful":1,"cool":1},"PmEUWQK77wfwpDHy2VWx1A":{"text":"I went with a group of friends for a bachelorette party, and we were impressed! The servic","useful":0,"cool":0},"t0ltIdWzM3cQK5XpE4WXKg":{"text":"Everything from the service to the food has been amazing. I have been to many restaurants ","useful":0,"cool":0},"YdJi80jh_ZrOKgQI1WoLZg":{"text":"Let me start this review by saying I have been a longtime fan of Emeril's and have eaten a","useful":0,"cool":0},"y9__gTh3cJWVsLFS-mHxZg":{"text":"This restaurant was such a disappointment. I have been to Emeril's restaurant in Orlando a","useful":0,"cool":0},"hB1mQL8lGRNurbZvhc4gqw":{"text":"The food and service was better than expected. The chicken and waffles were the best I've ","useful":0,"cool":0},"VgudjzBe9mxKIBwC74os5A":{"text":"Wow! Thee most extensive wine list imaginable, 5 Star eats & outstanding service! Maybe th","useful":0,"cool":0},"sjeb5zlUtMb2qr1m07WqmQ":{"text":"Classic New Orleans lunch. Bloody Mary and bbq shrimp were lovely. Had the rainbow trout o","useful":0,"cool":0},"mcuGjP8x3d1JkdfB08QanQ":{"text":"I was visiting New Orleans for work and heard about Emeril's through a friend. We had a pa","useful":0,"cool":0},"ki1dHrXHvwTuI0ZxdY6mEw":{"text":"Extremely disappointing meal. Ordered the cheeseboard as an appetiser which took almost an","useful":0,"cool":0},"piqalsBUr8lzWPOj93ElOA":{"text":"The service is EXCEPTIONAL!!  Thomas, Herman, Mims and Douglas treated us like movie stars","useful":0,"cool":0},"PHV8BFtvOSTS0GtRVyUrTQ":{"text":"Very disappointing  experience, food came out simply bad, over cooked then returned under ","useful":0,"cool":0},"SrbXPYdPcMZ5iEbIh4DFYA":{"text":"Lovely food great atmosphere , great service. That crusted drum fish was too yummy and the","useful":0,"cool":0},"_56nQNv7ezai8W0YL8coog":{"text":"Plain and simple, the food is to die for and the wait staff is very attentive. Highly reco","useful":0,"cool":0},"0ARAVos0cqskcsNa0qQZsw":{"text":"Wow great food! We tried the bluefin tuna and omg the flavor was wonderful. My husband had","useful":0,"cool":0},"xQMGbLw6eWZv5L-PUUMJ5Q":{"text":"I was so looking forward to this meal! And, mostly, it did not disappoint. Signature cockt","useful":0,"cool":0},"lrJv74pLg0mk-HZirxHiWA":{"text":"Service was impeccable and food from appetizer to soup/salad to entree, and finally onto t","useful":0,"cool":0},"V28ejFRXB1N5XbgdlJ07UA":{"text":"Great service but the food was not great nor up to my expectations.  I ordered red snapper","useful":0,"cool":0},"IUA9_HIjhJLSO92c89oLVw":{"text":"Excellent food, great ambience...\n\nHad a quiet lunch here. Food was excellent. Dessert was","useful":0,"cool":0},"WtjZNwwU-vCNhN-KtmPg5g":{"text":"The service was outstanding--we had a rotating group of three waitstaff supporting us, all","useful":1,"cool":0},"TxvkmUdCyotGRY5H1-F-0g":{"text":"Emeril's does it right.  From the ridiculously freshly made bread at the beginning, to the","useful":0,"cool":0},"rXkvhroUWqG_XqgE6RThRw":{"text":"OMG.......how disappointing...and this has always been my go-to place when visiting New Or","useful":1,"cool":0},"k4v76SgQhezL1tChvUxhnQ":{"text":"Last time I was here I made the mistake of ordering my entree based on the sides. This tim","useful":1,"cool":0},"zKYY_J6LrWv6sc3_WX4hEg":{"text":"This place is sexy, and I like it way more than Emeril's Delmonico (too stuffy, full of to","useful":1,"cool":1},"FIRP9jE3hSr0VbD1nIgglg":{"text":"We had a private party at Emeril's for a birthday party and it was PERFECT. The wait staff","useful":0,"cool":0},"mfSYAq3ctkPkLxh9jRL4dA":{"text":"Two other friend of mine and me went there for dinner, they were really mean to us, they w","useful":0,"cool":0},"C9nnsgLiBMUSKPWB3h_DFg":{"text":"Tell them to sit you with \"Lil Mike\" from NYC. And watch out for his sweet talking jive. Y","useful":0,"cool":0},"cp2JvUVcjryNY-ZhH4PlHw":{"text":"Very disappointing. Worst meal we had in New Orleans. I ordered the swordfish off the tast","useful":0,"cool":0},"MtIo5jEYNKyHtbJmkb-dnw":{"text":"I'm surprised to read all these 5-star reviews. I was wary about going to a \"celebrity che","useful":0,"cool":0},"CurwCup_lh8I3T22KICEWw":{"text":"Exceptional food prepared beautifully. Our server was very good, but he didn't seem to rem","useful":1,"cool":1},"eF5Hcmget0bxN-w-_gjCZA":{"text":"The cream corn soup with crab is to die for. Maybe sounds a little \"off\" but nothing like ","useful":0,"cool":0},"m-7w7EQJFzBAOvRPHO81iA":{"text":"Excellent food and impeccable service! The waiters are superb! They really cater to the cu","useful":0,"cool":0},"ktLH2Ht04OmbSZ-3p22cIg":{"text":"On our last night in New Orleans, my friend wanted to end it with a \"Bang, BanG, BANG!\" at","useful":3,"cool":2},"l5Drse2_bznXPLMGxXPujg":{"text":"It's sad that some restaurants automatically assume they can get away with a chef's namesa","useful":0,"cool":0},"oeoyshQPhScBx3NM7YCJqg":{"text":"A must visit when in New Orleans...Emeril's flagship restaurant with amazing dishes and Gr","useful":0,"cool":0},"58BSetxEvdDdNQnp-5ttDA":{"text":"Great food, great drinks, great experience and great service.\n\nEmeril's is a homerun.  His","useful":2,"cool":1},"kA29tCj9dvXlKMm2ZrZolw":{"text":"Pretty classy environment. Only came for drinks at the bar but the food others was having ","useful":0,"cool":0},"NhdlXtgcmRE0m_4Vkjm6jQ":{"text":"We traveled to New Orleans expressly for the food, bragging about the exquisite dishes to ","useful":0,"cool":0},"6VF_YU-dh1ZfHQQ4qHUMDQ":{"text":"This is a tourist trap. The 'Emeril' name gives the illusion that the food would be good, ","useful":0,"cool":0},"DEpiZZY9cbmg9pkGhNQTRg":{"text":"The restaurant is very nice. The service was excellent and the food tasted so good!! If yo","useful":0,"cool":0},"E2vpOu_AtP0EDAeD7YeRgA":{"text":"Another great meal at Emerils.  Food and the service were excellent. BBq shrimp and pork c","useful":0,"cool":0},"vIevEWGU-w6wXpyT_ezHSw":{"text":"After the hype on Yelp I decided to give this place a go and boy, I wish I didn't.  \n\nWant","useful":1,"cool":0},"w0ps6Lxmcx2yYppo6tLVKw":{"text":"Came in as part of a bachelorette party trip. We'd been disappointed all weekend but Emeri","useful":0,"cool":0},"NBp1iuCxj0H-WrkR1vZcbw":{"text":"Great restaurant but may need to wait for table.  The restaurant is good for few people to","useful":1,"cool":1},"7aNmiYTUyYhtGtC3r2vsUA":{"text":"We went to NOLA for visiting some friends. We ordered a table in advance for 4 Persons and","useful":0,"cool":0},"wKgOT2IJIfKY_HT1fElGjA":{"text":"First time at Emeril's flagship restaurant. Our experience was exceptional from the time w","useful":0,"cool":0},"dg0-5-hH073SM1p_PLQ7iw":{"text":"I was in New Orleans for a conference when a colleague suggested Emeril's. We managed to a","useful":3,"cool":0},"MkIo4kSzpbuj1I9necQX0Q":{"text":"Not all of the dishes were worth the hype. Most things were good even if we would not nece","useful":0,"cool":0},"A24ROe9s61i1U3jlGs47NQ":{"text":"I just had lunch at Emirils.  I was very impressed.  I wasn't able to get a last minute su","useful":0,"cool":0},"ZdTLyYiJFJsjGIo-BMPCbw":{"text":"The two stars is for the food and the food alone. It was tasty, but the service...atrociou","useful":2,"cool":0},"k5Rw9tRwJyTlkk3TQepGcA":{"text":"Ok ok...I think ppl think this place should have the New Orleanian food representation but","useful":0,"cool":0},"5_YvT-lKHkEyv__sjzJiNA":{"text":"Over the years I have been here for dinner 3 or 4 times, and we hosted a corporate party h","useful":3,"cool":0},"xI-wBCxGT3qGiEpC81jtFw":{"text":"Great food and service nice ambiance very busy, Friday night at 8:00,\nHad very loud table ","useful":0,"cool":0},"fgEj1l0IqdmX0MDe6anXIw":{"text":"I was expecting more from the restaurant just from the name. The service was nice was slow","useful":0,"cool":0},"F37HKsGTD27iSIq5M1LPkg":{"text":"We had a group of 7 with one more person arriving later. It was 8:30 when we arrived and w","useful":0,"cool":0},"YLyfLdE-3UBMz1TglR3USA":{"text":"We were in New Orleans for vacation back in July 2018\nThe food and service was Excellent! ","useful":0,"cool":0},"947sPkrzyQ2vSX-I8H3-pA":{"text":"I've been to Delmonico's in Vegas before and had a great experience, so I had high hopes f","useful":1,"cool":1},"3ESYMqvv5bqvUDJ2NaFl6g":{"text":"I was in New Orleans and was extremely excited to try Emeril's.  I'm a huge food network g","useful":0,"cool":0},"EKSciGQwLozB_UVld8ZRrQ":{"text":"BAM!  Due to the Water convention, this place was packed for lunch.  Luckily, my son and I","useful":4,"cool":4},"mMJ4q29PivrHfq20fnoHhQ":{"text":"I went to Emeril's this past Saturday night for dinner. We enjoyed our appetizers of scall","useful":1,"cool":0},"VYMJ6lg_xzd34MXZY1KIgQ":{"text":"The service and food was great!  We had like 4 servers tending to us!  They made sure my T","useful":0,"cool":0},"1rUNdlN4XsEYzLfNyobFqg":{"text":"We go here every time we are in town. The service was superb - as usual. The food was amaz","useful":0,"cool":1},"f5ANfl81ir591wMlsMXmCQ":{"text":"Great for dinner New Orleans warehouse district food was fantastic service was old style 3","useful":0,"cool":0},"3xqXUSlvSouED7PARo5khg":{"text":"i was kinda skeptical about going to this place due to the fact i generally like hole in t","useful":0,"cool":0},"DN0d54ANmHGOKFOjeB-w9w":{"text":"So I've eaten at this location before, food was good nothing great, court of two sisters a","useful":1,"cool":1},"XLZSUTCYA_oMR_cHU4zG1A":{"text":"Ate at Emeril's back in April and while it was a pleasant time overall, there were definit","useful":0,"cool":0},"GE_me92cYTJwY_ii8610Uw":{"text":"I was really hoping for something great. That did not happen. Everything was good but noth","useful":0,"cool":0},"t_u_kaONFGkdwO9dLbDUiw":{"text":"I was actually not expecting much from Emeril's, but I was positively surprised.  It was d","useful":3,"cool":2},"XDVmgw28f2LPlbc4k_TRLg":{"text":"So very disappointed, to pick this restaurant for a 60th birthday was the worse part of ou","useful":1,"cool":0},"GXHULzH_BHSevQ0hfEoqwA":{"text":"This restaurant is very overpriced for the quality of food. Some of the worst lobster fett","useful":0,"cool":0},"vzpoDKHg0ffeErmiIF94eA":{"text":"As vegetarians, we thought this might be a bit suspect.  Wrong!  They were great about acc","useful":0,"cool":0},"XuO7X1hZKpNDu4ftcsHPGw":{"text":"Really, bam, not BAM! In town for a conference and headed to Emeril's for dinner with some","useful":1,"cool":0},"HO4q7RxHSyArg8ftbn_yBA":{"text":"I was annoyed when I found out our boss chose this place for a business trip. Didnt want t","useful":1,"cool":0},"aWINHSQFcke1lnFjVd0tVQ":{"text":"So I've gone through many other reviews on here and I had to check twice to make sure this","useful":5,"cool":0},"sOIj539g-CdyyCyfezNEJA":{"text":"I am probably a bit more difficult to please than most, having been a waiter in NYC for ov","useful":0,"cool":0},"-IL2IEckO9uCW024VvUHjQ":{"text":"The service we received was incredible. My husband got the lamb which he loved and lobster","useful":0,"cool":0},"Z68MxsCOV4hzBY8LNwQ8lg":{"text":"Food was solid but Servers kept congregating and gossiping. Sign of an untrained staff\n\nWh","useful":2,"cool":0},"zK6bQ_yoZW3E31drOrSOoQ":{"text":"Wow!  Super great Cajun food, very busy place but the staff seemed happy and definitely kn","useful":0,"cool":0},"Lf0JBHoQemeEbWNOR7it4Q":{"text":"We loved Emeril, so that's why we decided to have dinner while we're visiting NOLA. The at","useful":0,"cool":0},"V9COF67pKGaorODgj-0mxw":{"text":"The food was excellent and the service was out of this world! We started with the bbq shri","useful":0,"cool":0},"dL6cYYQkLXO5FevehcJltA":{"text":"This was a fabulous place. From the moment we walked in, every staff member we came across","useful":0,"cool":1},"1LzyYE2EHW7zi38JA7L0dw":{"text":"I think some people just like to slam any restaurant that is owned by a celebrity chef.  N","useful":6,"cool":3},"zzlzZzTM18CSPyNaa9C7eg":{"text":"Does not live up to the hype, but above average. Staff is knowledgeable and very good serv","useful":0,"cool":0},"p5uNYjqFHWP0fwlW5tThhA":{"text":"Best meal we've ever had.  Beautiful restaurant with attentive and amazing wait staff.  We","useful":0,"cool":0},"9BCqqIkoiSAoDp_-RdFEQQ":{"text":"They forgot our apps. A few mins before being there a hour our mains came out. They where ","useful":0,"cool":0},"86WUK2bt-zMc1yfYEO_eaA":{"text":"We had been in NOLA all week and somewhat disappointed in the restaurants until we venture","useful":0,"cool":0},"x3E3egIntzl5GBLv63drhA":{"text":"Although I am a local this was my first time visiting.  I checked out the menu online befo","useful":0,"cool":0},"9dVrzwxoUPPFIqVBq12yPA":{"text":"Great atmosphere. Service was great but smothering. 3 different people were in our face wi","useful":0,"cool":0},"_s2_wdbziUp3E1LKFEFBDA":{"text":"Keisha is THE best server. She is so smart, with a great sense of humor. She put up with o","useful":0,"cool":1},"3z6VfBfzVpbc0r9MKMDypw":{"text":"Still fantastic.  \nHad a food coma after this meal.  \nThe service was a little rough, but ","useful":0,"cool":0},"PWw-CYeUahMSrzjh5rHyqw":{"text":"We enjoyed Emeril's NOLA for lunch. We decided on lunch as we were visiting NOLA as a fami","useful":1,"cool":0},"_aPDKl_W-iqQLuWBl_HALA":{"text":"So amazing!  I don't think you would know this was Emeril's restaurant just from the insid","useful":0,"cool":0},"tYkUqeRrAS6Ft-n2Db77EQ":{"text":"We had a very disappointing experience at Emeril's. We were in New Orleans for a long week","useful":0,"cool":0},"JrAINlpYeXM1cler2IS9pw":{"text":"I am a long time fan of Emeril, so I was really hoping to be able to post a positive revie","useful":0,"cool":0},"OKewWDINqDaAiaT2FYcvHA":{"text":"Their service is impeccable.  We had the drum and the swordfish.  The swordfish was really","useful":0,"cool":0},"pMjkITP14d7jHme5ss8fUw":{"text":"My wife and I had dinner at Emeril's New Orleans this evening. We had been to Emeril's Las","useful":0,"cool":0},"ezGBYYf-tGDvsOLh3eDhVQ":{"text":"Loved this place.  Every second was a culinary wonder.  Our head waiter was Young Mike.  W","useful":0,"cool":0},"quOcgdIeGVqCPmJP_1vnBw":{"text":"Went here for lunch with a group of 5 while we were in town for a conference.  The service","useful":0,"cool":0},"WPwqr-nIWNOby_8BVsIwlA":{"text":"What a great place! I am sure this one will be on the top my list when I visit NO next tim","useful":0,"cool":0},"C-LFMOr3y_4MY0znALanGg":{"text":"If you're lookignfor authentic New Orleans food, try again.  The food was very average, es","useful":3,"cool":0},"8Mcw0dZvg-rftVdyvgjVPQ":{"text":"Went there for lunch then dinner. Seafood gumbo is fabulous!  Lemon cheesecake yummy. Grea","useful":0,"cool":0},"dJxqcXa2q3YuP-_3kO1vtw":{"text":"One of the best dinners we have had hands down!  Food and service was spectacular.  We sta","useful":0,"cool":0},"Md4RDGvlWqzcb8E8LVpfGA":{"text":"I visited with my mom for a pre-mother's day supper. Summary of pros and cons are below:\nP","useful":2,"cool":0},"b3uVBSdrdzUotav2llrFUA":{"text":"You know how college kids sing that song when their underdog team beats the heavy favorite","useful":0,"cool":1},"Wr9B45LkmqPNcy8CtQP19g":{"text":"Enjoyed Emeril's while in New Orleans, and boy oh boy did we indulge. The bread was fabulo","useful":0,"cool":0},"LE7N8C_krLp7KKRdQz935Q":{"text":"All the food we got was cooked perfectly.  I was not too keen on the tamarind worchester m","useful":0,"cool":0},"V7G0zm30DRk72WA3JGnzMw":{"text":"After a late flight into New Orleans, we rushed to make our 10:00 p.m. reservations. The r","useful":3,"cool":1},"VXklRBTKgAQNPCkrT5NRpw":{"text":"Ok food. Thomas Keller kicks Emeril's ass any day of the week for the same amount of money","useful":1,"cool":1},"LsplVeL3OzXcEjl4h-A8CQ":{"text":"I had a very disappointing experience here last night. I had dinner with 5 coworkers and a","useful":0,"cool":0},"U_UHc5_F_3gAr4gnC6OWng":{"text":"Total rip-off.  Simply put, the food is subpar.\n\nI think some are enamored just by his nam","useful":5,"cool":3},"oS7r4fuAldbnjK-sTDJmGA":{"text":"Very good meal, had the Pork Chop which could feed at least 2 people.  The Red Snapper my ","useful":0,"cool":0},"DdRa9i6oWqjMNf9H3tvMVA":{"text":"I was entertaining a colleague and a customer for lunch----both whom were never to NOLA. I","useful":4,"cool":3},"xl2TdL2kanYhPNQMbbBb5A":{"text":"I was very disappointed with the food. The service was slow, the waiters were amazing but ","useful":0,"cool":0},"zlz9_TA0FrBQNm74JJki4A":{"text":"food was good. seemed more of a fast paced restaurant experience. i have had better food i","useful":0,"cool":0},"k0RHGcvB72UA1nGsAyvwbw":{"text":"Very disappointed!!! I've ate @ Emeril's in Vegas many times and never have we ever receiv","useful":0,"cool":0},"m2Br_aa2e_fSCV0ZucMgeQ":{"text":"Our food was fantastic last night and the staff was spectacular . Emeril was present cooki","useful":0,"cool":0},"oIdPLpe348mp-w3cPBunog":{"text":"Emeril's ambiance and mood was very relaxing.  They were kind enough to allow us to check ","useful":2,"cool":0},"AIb9tUgcGf91X1nfpapcig":{"text":"Great food. Great service. Swanky place. \n\nWhite linen table clothes, wine glasses and the","useful":2,"cool":2},"o3Du8sLFBnqYhndIflmO2Q":{"text":"Great food great service and great price .... Try the grilled  lamb entree  and oysters ap","useful":0,"cool":0},"ZlO_KCSKma9nhe9Y6MBtjg":{"text":"Went on to Open table got a table the day before Fat Tuesday... Amazing flavor excellent s","useful":0,"cool":0},"I67GmE73SPFhXUK2H5-Juw":{"text":"When my daughter ordered the chicken i told her she should branch out and try new things i","useful":0,"cool":0},"g_7DVMLniTfZF9Ho457hWw":{"text":"Maybe the best restaurant in New Orleans.  Classy as it gets but you can still have a fine","useful":0,"cool":0},"gqnckxCxrrUJjf7l9Zm2JQ":{"text":"This is my second time here and it never disappoints. Last time I sat at the bar and had a","useful":0,"cool":0},"Bb2L7aCgsyTqaKI4NZZJSQ":{"text":"I cannot believe I've never written a review about Emeril's - I've been to NOLA three time","useful":0,"cool":0},"cWUKlEjfJ9QRvkfxz4_cAA":{"text":"This is indeed the best meal we've ever had...both food and service we're impeccable. Thai","useful":0,"cool":0},"hurnlmkr27TLXnGGLputMA":{"text":"Very excited to try my first Emeril's restaurant!\n\nAmbiance is modern upscale and we went ","useful":1,"cool":0},"_TRrJwuqKDxWTAB4h4tEqw":{"text":"Service is excellent. A bit on the fancier end than I like, recommend dressing up. They ha","useful":0,"cool":0},"QF8lsCptfozApxztI-Jz9Q":{"text":"Emeril's very \"pig fat love\" based cooking is not my favorite and I avoid pig fat whenever","useful":2,"cool":0},"-BLFRLcq-lZTV3BMkejeFg":{"text":"As a visitor from the nation's capital, Emeril's didn't disappoint those accustomed to maj","useful":0,"cool":0},"Bp9NV_pyuMFRcTRSRYR-OQ":{"text":"Had a wonderful evening at Emeril's!  Our waiter, Young Mike, made note perfect recommenda","useful":0,"cool":0},"yKrgd_zKTEa_fer5-1RNqw":{"text":"Left the restaurant hungry and with pain in my stomach. Called the restaurant in the am to","useful":1,"cool":0},"6MW9SmXIGnXJ_geQccaX9Q":{"text":"Was so happy to finally eat at a restaurant owned by Emeril! The food was amazing, worth e","useful":0,"cool":0},"03P1F6z_xq4_C2lMaW8atg":{"text":"It was good. I got the drum (white fish) but I wish I had gotten the ribeye. The barbecue ","useful":1,"cool":0},"6_qQIUqj60TtxZbFR3FHtA":{"text":"Best word to describe this restaurant: \"meh\". \n\nFor the record, had I not been with a larg","useful":1,"cool":1},"tY-INIdm3jwkfvLtsfoSZQ":{"text":"Excellent service and excellent food.  Waiter suggested chicken and waffles and it had a l","useful":0,"cool":0},"LkDdh4TtiKbfMvVlI300qw":{"text":"*** Dessert review only***\n\nI came here for dessert after a great dinner at Cochon.  We ha","useful":0,"cool":0},"hnmQ0h9gdCpKiMWqkASASg":{"text":"Visiting NO for Jazz Festival with my friend Pam. I always try not to go to the \"tourist t","useful":0,"cool":0},"hBImuVeZqXOoU3yNPthPxg":{"text":"Food:\n1. The chicken was great, both fried and roasted. \n2. Normally I don't help myself t","useful":0,"cool":0},"Oo3HsZ8I5b-jkSPxocgF2A":{"text":"This was the worst food I have ever had. My chicken tasted like chemicals and my waiter wa","useful":0,"cool":0},"P_mYCeMpRLJVCLGX7rFrmA":{"text":"I feel like I made a mistake.  I really wanted to like the place, but I just wasn't impres","useful":0,"cool":0},"zawKwimNLyTmt5NTbaTERw":{"text":"Slightly pretentious yes however well deserved.  The BBQ shrimp could be in the top dishes","useful":0,"cool":0},"XAZvHguw6jaf3nai9SLshQ":{"text":"I've been wanting to come here for years, and even with several trips to N.O., I never mad","useful":0,"cool":0},"CvVnQkCQh8D_eJEnk_F1kQ":{"text":"To;dr - Unfortunately, I had the worst dining experience here. It's actually the worst din","useful":1,"cool":0},"uTMv-9bg5h3tbuVZjSem2A":{"text":"I recently went to Emeril's on a saturday to celebrate my wife's birthday. I have to say t","useful":1,"cool":0},"1KDUPGEcyOwadWm5I_01_A":{"text":"Never made it to Emeril's on our prior trips to NO.. this trip it was a \"must do\"... we we","useful":0,"cool":0},"6wNcT0dotnWaeG7lPPcXaQ":{"text":"Excellent ambiance for a New Orleans restaurant but somewhat noisy and bustling. The servi","useful":0,"cool":0},"Fp6vLZ6CalTDbX-Fd1Vglg":{"text":"Had a good experience. We sat at the chef's bar.  Bread assortment was nice.  We had the c","useful":0,"cool":0},"ipmwRhbFUNDaIYDNHesiVA":{"text":"Amazing service and very good food. This Restaraunt sets the bar high for places in the ar","useful":0,"cool":0},"xWkg-uSO1omoRLQW8rB_rw":{"text":"Service amaaaaazing. They put on a great show. Great presentation and attentive. Jarod too","useful":0,"cool":0},"WTTANp_-xmCLRWf0Fzbg3w":{"text":"Just as delicious as I hoped it would be. I grew up watching Emril so I was a little nervo","useful":0,"cool":1},"aihLwnvbExEyt00ZzMi_pQ":{"text":"Changing for the worse\nHadn't been there for 3 years and fond memories were dashed. Our la","useful":0,"cool":0},"22Jg8GYU7XETuTlYtjl8_A":{"text":"Food was fantastic!  Best customer service I've ever seen in a restaurant.  Highly recomme","useful":0,"cool":0},"Jmoga-_VtC2hoJa2ukH0Uw":{"text":"The service started out good.  Then an hour and a half into our dining experience, we didn","useful":0,"cool":0},"wGFvbUELSiW2sdUrUjUqFg":{"text":"Disappointing, the food was good, but we ordered two bottles of wine, and when the check c","useful":0,"cool":0},"TiH8LT2Xo6hofacgl17Npg":{"text":"We had a wonder dinner at Emeril's.  The pork chop was delicious and huge. The banana crem","useful":0,"cool":0},"w-A5qRFCMSqTKAINMhiHwg":{"text":"A beautiful restaurant with top notch service and hearty rich food!\n\nAmbience: 5/5\nMy boyf","useful":0,"cool":1},"OpVJIyblqmdswmOUEIM9sA":{"text":"Another great dining location in New Orleans! \n\nEmeril's is located just outside the Frenc","useful":0,"cool":0},"uo8jQ2-Cii1AUmZNwXKSCw":{"text":"Had a duck sugarcane glazed duck awesome flavor to see everything was cooked to to taste. ","useful":0,"cool":0},"obmgRfgZb2-b81z91zPHpw":{"text":"Like Emeril's flagship restaurant a lot but if I had to choose (and I have), I would pick ","useful":0,"cool":0},"KKGcAakgHppRnxOkSZu_dA":{"text":"The service was the best in awhile. Now the food. Beyond my expectations. The duck was mos","useful":0,"cool":0},"Fjm5KGzjIjLn-_2FGezz-Q":{"text":"At first I was excited to be coming to Emeril's. We were ending our honeymoon at a famous ","useful":3,"cool":0},"CBeSyJMFxwux0T-tUOoyRQ":{"text":"Thoroughly disappointed with the service AND the food.  Give me a break!  If you like over","useful":0,"cool":0},"ro2AQf8Ww7eNWmMguhOQ0w":{"text":"Amazing food + amazing service. We loved it and will come back for sure. We didn't even ma","useful":0,"cool":0},"tSkwgLD0-bk1bQnE-j5kTg":{"text":"The food is amazing... it's very classy and elegant but not stuffy . Great dining experien","useful":0,"cool":0},"vRqfqsCHCW_6T7eVcUb_8w":{"text":"Diversity of textures and flavors is amazing at this classic New Orleans mainstay. \n\nBam! ","useful":0,"cool":0},"6L9BCLyWRwB9JCG2gVbP-Q":{"text":"We sat at the bar Top that overlooks the kitchen, such a fantastic experience. The pork ch","useful":0,"cool":0},"riLUebmVMnPaxFWR43zw8Q":{"text":"Great food, an institution. Was not remarkable, it has been 10 years since my last visit. ","useful":0,"cool":0},"ioqGY6GXksFsXGOJLA-LxA":{"text":"This was a last minute decision to stop in for lunch after arriving to town. They made sur","useful":0,"cool":0},"aonfeRec1A5bcMaBtHqdNQ":{"text":"Ok, nice environment and service but the food is really mediocre to me.Not as good as I ex","useful":0,"cool":0},"XndoCxaht9sj0PuUVzFqmQ":{"text":"First class all the way: beautiful restaurant, attentive and very capable service and best","useful":1,"cool":0},"GxCIh5ZBQrEdie3uA_4zjg":{"text":"Very good food as expected.  Portions were very satisfying and we were able to have some l","useful":0,"cool":0},"pe3sb_CkVWfyPrVr42rwIw":{"text":"I have been a LONG fan of the guy and his enterprise (before many of you yelpers could spe","useful":0,"cool":0},"49CU64uJjGm9Lf5oi5DI7w":{"text":"Cliff Notes\n\nPros\n- Service/Ambiance \n- Anything andouille\n\nCons\n- None\n\n\nBefore you think","useful":1,"cool":1},"X-c8njF3jhH6LSWuAOcxZQ":{"text":"Was in New Orleans for a week...this is the best restaurant we went to. Service was A+, ou","useful":0,"cool":0},"GQsrEp7XSexNE1ZoMRKFdw":{"text":"So let me be forthcoming about this experience... I walk in on a bro date with my guys, lo","useful":1,"cool":0},"kg7rgqYu2esUF6tZtRxBGA":{"text":"Incredible service by Jimmy and his team. From the time we arrived to when we left. The mo","useful":0,"cool":0},"mdoRoG7I1CCX8l8EgDsZkA":{"text":"We were in town for a wedding and decided on our last night to come to Emeril's for some t","useful":0,"cool":0},"pxd9Ze1PC3YRYWKapexwMA":{"text":"Having been here 20 years ago and having been a fan of Emeril's show and trying dozens of ","useful":0,"cool":0},"wSBmTymowEQrjgvYBHBoSg":{"text":"I fall in love with this place! Food is amazing and service too! The good happy hour!","useful":0,"cool":0},"3sE39ntdi_X3e2T7hR8wSg":{"text":"Spectacular lunch. Best fried chicken I've ever had. The Burger is top 5 in life. All arou","useful":0,"cool":0},"RLJH6nxmxAbHlf8XCnG8Qw":{"text":"Eaten here several times but never took time to review, but they deserve one.  \nConsistent","useful":0,"cool":0},"B5CIW_IWAkdPYxrjP3qmSg":{"text":"Dining alone is never fun, but I was on a business trip and on my own for one of the night","useful":3,"cool":0},"5hxswmdIsaK4-hSDCSrzmg":{"text":"Every time we go to New Orleans we make an effort to hit Emeril's at least once. The food ","useful":0,"cool":0},"WF_fVEfpRwa4xPBOSMCMyg":{"text":"I felt a bit of an obligation to visit Emeril's while in the city.  After all, his was the","useful":3,"cool":1},"-VJXzZj9y4QYf4odVMdi6g":{"text":"This iconic New Orleans restaurant is a must stop if you are in the area.  They have some ","useful":1,"cool":0},"L-jW-yp4HqtNcJv1VK2BOg":{"text":"This place is running on name only.  The starters we solid.  Stuffed little neck clams and","useful":0,"cool":0},"FdUZttXiMyTZnUh-iFH03g":{"text":"I've been wanting to come to Emerils for forever, my dream!! The experience did not disapp","useful":1,"cool":0},"RmhKBqTSHAgqP1boWbWb2A":{"text":"If I had to sum up this restaurant in one word it was be UNBELIEVABLE!  We decided that a ","useful":1,"cool":1},"0PfFL5fATGVc6GjcEFrD-Q":{"text":"Really excellent fine dining experience. I had the BBQ shrimp and grits (my first experien","useful":0,"cool":0},"y-FVr69uG_Poc6eN98hveg":{"text":"Emeril's never fails to be exceptional.  Making this an even more enjoyable evening was ou","useful":0,"cool":0},"eti7Y07dzyO6dE1i726tLQ":{"text":"Excellent food and service. What a way to spend our last evening in New Orleans. The porti","useful":1,"cool":0},"6ZUF7AOZj_IuIsVj88xTiw":{"text":"Good food and service. I try to come to New Orleans and visit this restaurant every time.","useful":0,"cool":0},"LrRXapq3UNtKP9HuSrskXw":{"text":"There were three guys returning home trip from a fishing trip. This was our final night to","useful":3,"cool":3},"DYGt8Bm1T3EX9lmErLT6Eg":{"text":"Meh. We were thrilled to get to visit this restaurant yet our experience fell flat. The fo","useful":1,"cool":0},"hke8dRld1Wdb6wgm66AJug":{"text":"This is a place you MUST go for the experience and food. You have to set at the counter. T","useful":0,"cool":0},"uZbXjca9D9HSbzlduEUUKg":{"text":"Beautiful restaurant and great food! The fried chicken with Mac and cheese was delicious.","useful":0,"cool":0},"Rwv-1oxkkaMsSNtvje_GHw":{"text":"Excellent food and service. The experience was what stood out the most. Our waitstaff were","useful":0,"cool":0},"YhjSaFAlell0ZdiopC6Bsg":{"text":"My first time at any Emeril's restaurant and I had to do it. Being travelling TO NOLA and ","useful":3,"cool":1},"g9b0-TWt_Epg5iiEBcnXqQ":{"text":"A perfectly flavorful lunch. Wonderful service, fresh seafood, and delicious cocktails.","useful":0,"cool":0},"Orsl4PxFHaxIBNHBuwG4pQ":{"text":"Had a nice family dinner.  Wished the reader had anchovies in the paste not just on top. P","useful":0,"cool":0},"FrApDJkKsFmIqyYa2k8A2g":{"text":"This was a beautiful experience! Dana and young Mike took really good care of us. We felt ","useful":0,"cool":0},"HMw65-D0SPGMMyLvNlcgFg":{"text":"Visiting from LA, and made an impromptu dinner stop.  Young Mike has the best jokes ever, ","useful":0,"cool":0},"VJThDdt1p291rQZFZjUWYw":{"text":"What a great dining experience. Our waiter was a young lady named Jorden. She was excellen","useful":0,"cool":0},"FVNQkQ4F-pWoQg58ti_iXQ":{"text":"This place had the best banana cream pie!! We went to eat somewhere else for dinner and ca","useful":0,"cool":0},"oLdyqMab3Eduiv7pY4dWSQ":{"text":"Very good restaurant.  We arrived for lunch on a Spring day in New Orleans in April with t","useful":0,"cool":0},"CyLSmL5LcRmKfSqBlXVsJw":{"text":"Scott is amazing! He was very very noticeable. He made me feel really appreciated coming t","useful":4,"cool":2},"p0-E0ktny7TB2RBn2JS6kg":{"text":"This was a beautiful experience! Dana and young Mike took really good care of us as well a","useful":0,"cool":0},"XBvezZ2t6DrYNKX2ObdoJw":{"text":"The best, #1, greatest meal ever.  From the bread to the Emeril's Salad to the Sweet Barbe","useful":0,"cool":0},"Zjq1m4EQxdm2icHFdms0Ug":{"text":"Very disappointing on every level!\nThe food was okay but not authentic creole as advertise","useful":0,"cool":0},"fMQOq-okOf5tNX7z8vV2XA":{"text":"This is a terrific choice whether you're a local or a visitor to New Orleans.  Fabulous fo","useful":0,"cool":0},"XwT5BAWt4Ctqy79TimCqtw":{"text":"Had dinner at Emeril's in NOLA for New Year's.  The place was packed and the location was ","useful":1,"cool":1},"oOzsvh0iF96OmS6eE3vrnQ":{"text":"It is a classy place and they have their service act together.   You won't find better ser","useful":2,"cool":0},"gM-PO_Xhr3K7R0EFqI5hNQ":{"text":"After getting back to my hotel and finally trying to relax, I just could not. It's been si","useful":0,"cool":0},"k-Iu9RHKKbaYAKNwDk1aDg":{"text":"Went there last night...the staff was really nice, but the atmosphere gave out a really se","useful":0,"cool":0},"QsVi3euTqfhBDeFmxUoCkA":{"text":"Was finding for some authentic NOLA cuisine that would be sure to please, particularly sin","useful":1,"cool":0},"O9EvNASg4QJaqlLqVuMHLA":{"text":"When we chose to have dinner here we had very high expectations. Having ate and many famou","useful":0,"cool":0},"y184vdN8k5FPIyd4NRiCnA":{"text":"Our service was great! We were very disappointed in the food. The fried chicken was extrem","useful":0,"cool":0},"fRgzv66fTBWGilcJiFazOw":{"text":"My husband love the calamari but my salad and steak was nothing to rave about.  Service wa","useful":0,"cool":0},"tWH79OU5zDy7K6nP3NgY9g":{"text":"This was hands down the best experience I had at dinner in New Orleans. We came once befor","useful":0,"cool":0},"rl81iMdOe0pTVtcCpJCC4w":{"text":"Great food, great service, waiter. Young Mike was the best server we have had. He was awes","useful":0,"cool":0},"B45eGCPz_0q2PHHuZ9JZVg":{"text":"The service is top-notch. My appetizer (stuffed clams) was amazing. The wine pairing and c","useful":0,"cool":0},"RluzzAsh2nnazmngPnbPcQ":{"text":"Greetings from CA!  Awesome venue and food was spectacular. To match was great service fro","useful":0,"cool":0},"-UdUTFaO-kqq8QDqz5RxgQ":{"text":"Everyone I know raves about Emeril's. The food was just ok. Small potions. However the amb","useful":0,"cool":0},"lOSoCeBGKov4ocLw5Ngf-w":{"text":"I was excited to try the restaurant I'd heard so much about. I was disappointed. \nI have t","useful":1,"cool":0},"L2-FrUJ3M-pYc8L85IAgQg":{"text":"First time at Emeril's. It was very good overall. Had three customers with me, two of us h","useful":0,"cool":0},"yenVVj8xqmtZ5xCWdotwzA":{"text":"I took my wife and parents out for the First Saturday Gallery stroll in the New Orleans Ar","useful":0,"cool":0},"s2ZKJv-IMi_0WK5gcZEEUw":{"text":"Emeril's original location did not disappoint with amazing food and service.   \n\nThe choic","useful":0,"cool":0},"_dotiAhVGDLBfGD6JgRbeg":{"text":"We were excited to eat at Emeril's for the 1st time this past weekend. The only reservatio","useful":0,"cool":0},"2iyVPVm0qIpSXxawi5KZ6A":{"text":"Loved this place! The service was great, albeit a tad slow for the time we were there, but","useful":1,"cool":0},"wPjtiu5rjFbUG80XhFGRIg":{"text":"The food was absolutely amazing. The corn bread and focaccia bread were delicious. The cal","useful":1,"cool":0},"FoOfUoCK_xW8xSZCoFA0DQ":{"text":"Eat here every year for my birthday and I've always had fabulous experiences. The BBQ shri","useful":0,"cool":0},"I9X9x0btBqpdujKHJBGShA":{"text":"I had a total pigout at Emeril's in NO back in February.  I got the pork chop, which was a","useful":0,"cool":1},"lUoVjlVtF9HHPutbyaIOww":{"text":"4.5 stars. There's a reason it's packed on a Tuesday night. Solid service and good food. \n","useful":1,"cool":1},"vWw0_RHYeOnkT21SWxJh-A":{"text":"Very underwhelmed.  Made reservations weeks in advance for Saturday, Mardi Gras weekend an","useful":0,"cool":0},"-2cO1nxOblngNFqKQ8POlQ":{"text":"The gumbo is amazing!  I had the salmon entree and it was probably the best salmon I've ev","useful":0,"cool":0},"GqHl8JH9bTU6auPxfvl8eA":{"text":"For the money, this place was okay. Drinks were okay. I wasn't blown away. Courteous wait ","useful":0,"cool":1},"VIkcAa4baqzj4FcLInM5Wg":{"text":"TL/DR - food was 3.5 stars, service was 1 star at best. Doesn't live up to the hype\n\n--\n\nW","useful":3,"cool":1},"HNWpNgB6FbOuXtS6aU71aw":{"text":"Fan.. flipping.. tastic place!! Took the wife for dinner and we were thoroughly impressed.","useful":0,"cool":0},"iOt8Kjma1gVACGiRCOlyZw":{"text":"Great restaurant!! Close to the convention center, and our hotel! Service was great! The w","useful":0,"cool":0},"HPNPr-c9t5dSoGPQGF8uaQ":{"text":"I had the lamb t-bone. It was ok. My friends enjoyed there food. The service was good. We ","useful":0,"cool":0},"JMyUw1ZOyb9VjfN-ecGcPA":{"text":"Emeril , this is my Sixth time try your restaurant, this is my second time in New Orleans ","useful":0,"cool":0},"K1DamXaNvh0wica5xcCNsA":{"text":"My husband suffered an allergic reaction (where his throat closes up) that forced us to go","useful":5,"cool":2},"NcXlXMmQnuQH_snbeSNPZg":{"text":"Worst meal I have ever had . Eaten at many of Emeril's restaurants and I have to say this ","useful":0,"cool":0},"_8dqNVmwLcDhekDvjldM8A":{"text":"Quick review:\n\nservice was slow but that was probably due to the kitchen being in the weed","useful":0,"cool":0},"PyUw6Gn4DJ8ER_rS3Ycpdw":{"text":"Our first and only time visiting this well known Emeril eatery. 6 of us had lunch here tod","useful":0,"cool":0},"yy0omun9lMeCsoE-zRfoIQ":{"text":"Everything that we ordered was disappointing.  Ordered the Gumbo, tasted like boiled water","useful":0,"cool":0},"c4qQFkE6m5A7WQSc5Ayrdw":{"text":"Oh man. Talk about mouthgasm. From a fun steaks, gumbo, scallops, incredible wine and the ","useful":1,"cool":0},"LXV-ejUnBQFA6h3TE6Nf_g":{"text":"The who dat burger was the best burger i have ever had! The server Alan was exceptional an","useful":0,"cool":0},"0LueAvy4vvylZ04zGIHR6Q":{"text":"Visiting Emeril's was not on my list of destinations while I was in town, but was invited ","useful":0,"cool":0},"VSSfizGde-MZi8EM0MkI7A":{"text":"If I was a chef, I would remove my name from the restraurant.  Beef tenderloin tasted like","useful":0,"cool":0},"7VVx_UnUmEdFtMWnopEJdQ":{"text":"Basically I come here for the banana cream pie. It's a must have and it's amazing. The ent","useful":0,"cool":0},"4VF-f4A3nTt5uXeNn4h46g":{"text":"Ok so I made a reservation for 6 for Valentine's Day since that's where my group was trave","useful":6,"cool":4},"pw7KVmMf2llukE3GBsiSjA":{"text":"How can you come to New Orleans and not come to Emeril's. As the most recognizable chef fr","useful":1,"cool":0},"_C4ARqn1Sm7AbK7laIdwLA":{"text":"Omg - you need to have the chorizo and sweet potato soup. The delicate heat from the chori","useful":0,"cool":0},"ojfPgGuCAU3aht_SSTC55g":{"text":"Service and food were great for lunch. We were lucky to see Emeril and he was nice enough ","useful":0,"cool":0},"Wg3DccvQgZhCE_alWPxWCQ":{"text":"For about ten years now I have been hearing this story about how my parents ordered an ent","useful":2,"cool":1},"i00ogDOBs3RmuOhQhvRb8g":{"text":"My second time here and it was just as great as the first! We had the fried chicken for tw","useful":1,"cool":0},"j6uSn3XLj3npIdUyULoY9w":{"text":"Emeril's was the perfect place to spend my birthday dinner. The service was outstanding. W","useful":1,"cool":0},"muXWFYuQE6dPPrPtcjqUpQ":{"text":"Walked away feeling 'Meh' over all. And maybe thats just because I expected more or becaus","useful":2,"cool":0},"fsoXxWaQpyX5_Cht3pbdqQ":{"text":"The only good thing here was the bartender.  The scallops were so old they tasted like amo","useful":0,"cool":0},"ns8GLs-Lj_XTdOa39VWxSw":{"text":"I appreciate the fact that I grew up watching Emeril Live. Emeril's restaurant lived up to","useful":0,"cool":1},"H0NBtkISyrFmpEMKeiy42A":{"text":"Managed to get a seat at the bar and ordered the chicken and waffles. Wasn't expecting muc","useful":1,"cool":1},"eQYHnSHpL-uwbSQExheJCw":{"text":"After seeing Emeril on Top Chef, we were very much looking forward to going to Emeril's. T","useful":2,"cool":0},"8Xv3iUgxK4r5o-W1RpHHLA":{"text":"One of my favorite stops on our trip. The wait staff were very attentive. Our waiter expla","useful":1,"cool":0},"BFTQ317Mq829d-cSAEzi0Q":{"text":"Oh my the long awaited opening of one my all time favorites was less than stellar. To be s","useful":0,"cool":0},"bv4ConMgckPEkgFCqJB15Q":{"text":"Visited on 8/1/2014 for my bday weekend.  What a great way to start the weekend!\n\nSERVICE\n","useful":4,"cool":1},"x2WxshzEOC-LB9UcKl8OkA":{"text":"I was hoping for more. The food was bland, the service was slow, but the prices were retai","useful":0,"cool":0},"L2wGoNZoJzDZWmDEYiVzjQ":{"text":"After watching Chef Emeril on tv for years, I had to try his restaurant in the heart of NO","useful":0,"cool":0},"PE3FhrIgq3QAgsBWSU1T0Q":{"text":"This place is WOW! Had the lobster fettuccine and it did not disappoint. Also, their Rose ","useful":0,"cool":0},"xk52T0Poq19ukGLj2k6dFQ":{"text":"This place was DELICIOUS! I'm always a bit skeptical on fancy restaurants be cause I don't","useful":1,"cool":0},"x8ojN8OLVWmwlfhxuZXKrA":{"text":"Came here for lunch and was blown away. The staff is nice, the restaurant was clean but co","useful":3,"cool":0},"ZSwFVNW_S3lfQmfvcWnzPw":{"text":"I went to NOLA on a girls trip. We arrived Easter Sunday and made reservations at Emeril's","useful":0,"cool":0},"R4ChrE6ISNUbmHRbXBzXKA":{"text":"Had a reservation & upon arrival 10 mins early was told to wait at bar BUT once I requeste","useful":2,"cool":1},"kHQ9YSRFinSdOrjd6R9VBw":{"text":"I am continuing my Southern states road trip. The next stop was to the \"Big Easy\" New Orle","useful":0,"cool":0},"pka4a-VlGuxdMHbXhj8deg":{"text":"Not impressed AT ALL!  I felt VERY RUSHED!  menu was very limited. The person I was with e","useful":0,"cool":0},"sqG4AxzTakxr_njDTfW51Q":{"text":"If I can describe this place in one word, that word would be WOW! Ever since I was young, ","useful":0,"cool":0},"FUhSy1RiTeYm94w2_vdtIg":{"text":"We started our  New Orleans experience here and it was a great experience and meal.  The s","useful":0,"cool":0},"w7jEm9BtMVtKfKro8T8eJg":{"text":"Classy ambiance but don't worry about a formal dress code. I saw customers walking in with","useful":2,"cool":0},"-c2J39hRCY5n3avPMW0p9g":{"text":"A group of us came here for my friend's birthday on a Friday night. The food was absolutel","useful":0,"cool":0},"iz63popVmkH0ZrLAw7xtjQ":{"text":"My wife and I often come to New Orleans to get away for a couple nights. We thought we wou","useful":0,"cool":0},"pRbpHHlBtRpqYbzhuZYkWQ":{"text":"NOLA trip in early August. It was sweltering hot, so I had on a casual dress. Immediately ","useful":2,"cool":2},"YNVLMugtf-2o1XE3VkkQpQ":{"text":"Very disappointed. My boyfriend and I were excited to try Emeril's but left very annoyed a","useful":1,"cool":0},"7e-jpCIfQf7motwUc6ZEbw":{"text":"I will say I was a bit nervous about trying Emeril's flagship restaurant. This was mainly ","useful":1,"cool":0},"5KYQ7Prda8FOB-kJ4CqrtA":{"text":"The food of course was outstanding. The service however was not. The three servers we had ","useful":0,"cool":0},"Vvu7fx7H51U0T7xd6YpecA":{"text":"My husband and I had the five course tasting menu. We were very disappointed. The food was","useful":0,"cool":0},"BczUpOIFjjEjv2Nw2HZf-A":{"text":"After putting off dining at Emeril's for almost thirty years (I was waiting for the hype t","useful":0,"cool":0},"6ho4KXRkubiZwPOzOIbulQ":{"text":"Very well done!  I was a party of one, but was treated with great service from the outstan","useful":1,"cool":0},"qtmc1FLnkvM4gOMZBvI-8Q":{"text":"Amazing service and friendly waitstaff but completely underwhelmed with the food. I was so","useful":0,"cool":0},"mqJFRi3fELVddOBL9fONBA":{"text":"Just another check on the bucket list for a foodie in New Orleans. We made our reservation","useful":6,"cool":6},"vlGkSKLpO2AdXNPSpSfl3g":{"text":"Where's the \"BAM\"!?!? I looked all over the menu. \n\nNot authentic, not creole, and not eve","useful":7,"cool":5},"P7V6qRTknMlOikUE0HOgyQ":{"text":"A friend a dropped in for an early dinner.  The service was great, super on top of things.","useful":0,"cool":0},"WdjtTms5ny-nVWOqmAWnVw":{"text":"In a recent trip to New Orleans we decided to have a nice dinner out and we chose Emeril's","useful":0,"cool":0},"gLuVmKsuUx59fGoO8txs8Q":{"text":"We had the pleasure of dining at Emeril's for our joint 30th birthday celebration and the ","useful":0,"cool":0},"qjgd82nC2HGw3yA67Kcmlw":{"text":"While my previous review still stands, I'm bumping Emeril's up a star for being so incredi","useful":5,"cool":2},"CnaM8SylNp3D4zt3yVm4Ug":{"text":"Emeril's did not disappoint! This was the first time, in a long time, that I did not have ","useful":0,"cool":0},"vwoqFyRZZNbrx2zAg2P_LA":{"text":"The restaurant  was nice the service was great. I couldn't help but see how good the manag","useful":0,"cool":0},"9o-NIspP0Q2K3oqpctSayw":{"text":"What started off so great ended so poorly. We hoped to have a white table experience but g","useful":1,"cool":0},"YTsLIK2xRvF9JxbYIbuXsw":{"text":"Had dinner here on a business trip.  Made a reservation ahead of time.  Glad we did.  We w","useful":0,"cool":0},"mzYGhplzGwr4sJ_ysI1SVQ":{"text":"\"Bam!\" That's how I felt about the banana cream pie. The custard was thick and you can see","useful":1,"cool":1},"M-pCw0hJJc_F6P8MOeEzzA":{"text":"If we are in New Orleans they should have more seafood items or Cajun items on the menu. I","useful":0,"cool":0},"IokNewVTaC8LFdQVYC7pTA":{"text":"Had to try the original Emeril's while in NOLA.  Beautiful restaurant with a rustic but cl","useful":2,"cool":1},"n3HVvqRIJuG6W7XMUlYdqw":{"text":"Impeccable service!  I have a lot of food restrictions and dietary limitations and the sta","useful":1,"cool":3},"jpTDhtv_qXB58O7k7kDRYQ":{"text":"This place is amazing. Come hungry because they give good size meals as well. For our appe","useful":2,"cool":0},"aaMFbihx4o7T4Qi-28RwDg":{"text":"We hadn't planned on going to Emeril's, but ended up there for an early lunch.  Our server","useful":0,"cool":1},"KOJ6nZEtQOYXogh-BuQoxw":{"text":"Went twice in a three day period. Once, the first, for a round of cocktails, on me, for a ","useful":1,"cool":0},"OXAee9gzwr6VIMfQ4Y_Bbg":{"text":"We had an amazing meal at Emeril's. The service, food and ambiance are first class. Our ex","useful":0,"cool":0},"-AQjIXaWrCchbO3qlbboJg":{"text":"Wow, how the mighty have fallen.\n\nLet's see:\n- Inattentive waitstaff\n- Mediocre drinks\n- A","useful":9,"cool":4},"M0qELpB3JF6SO2pD2PTjzA":{"text":"I am in absolute awe of this restaurant! This was my favorite place I dined at while in NO","useful":2,"cool":0},"lPDiWSPwyiIsH9zQunWj-A":{"text":"This place always impresses me. Came here with a group of 14 after wedding welcome party. ","useful":1,"cool":0},"Z5duKycsc1_OdGAJRcE8Ww":{"text":"Last Saturday we had yet another pleasure of going to one of the best restaurants in town ","useful":1,"cool":1},"6zO0V8iNVMgs0G1k7WTRzw":{"text":"Wow! Why did it take me so long to eat here? You need to come here! Just because Emeril is","useful":9,"cool":5},"DBfzC_btlDNdlxkGVXUsnA":{"text":"My mom and I came here for a late lunch after the WW2 museum. It is a little fancier even ","useful":0,"cool":0},"rgazbPqOyjSh9DjVN8xv1A":{"text":"Packed on Friday night dinner.  Full bar.   Attentive and professional servers.  Subtle wa","useful":0,"cool":0},"lWXy3X7o91mLL76YjhwBtA":{"text":"I travel from Chicago to nola to celebrate my bday whit my friend on emerils we enjoy the ","useful":0,"cool":0},"iVW-moTc-GVsdAMjkFO6ZA":{"text":"I didn't think I was going to love this place as much as I absolutely did I am not very fo","useful":3,"cool":4},"qbaSTOOZ-ykJS-nBZn06YQ":{"text":"In celebration of the Sugar Bowl and the New Year, I attended a big family lunch at Emeril","useful":11,"cool":8},"PCskinCdlVIyEDBZFpWzgw":{"text":"Friday September 13th, 2019. As we arrived as a party of four, early for our reservation w","useful":0,"cool":0},"XBwgocOQccndSnUTVMuIdQ":{"text":"Five of us diner here for lunch on a recent Tuesday.  I had dinner at Emeril's in 2011 whe","useful":1,"cool":2},"6mvz603xQfcPv78NW1QV0g":{"text":"One of New Orleans few examples of an overrated restaurant.  Poor service, but what do the","useful":3,"cool":2},"Ka2mZsgRNmnZ1OGWDcz5iQ":{"text":"I'm not a fanboy type so going to Emeril's was not on any top 10 list but I have to say th","useful":0,"cool":0},"LrEaf5MkWV2lAEvAoT9Q9w":{"text":"I give it 5 stars...really I didn't think it would be so good...but it was actually fantas","useful":1,"cool":1},"16hrvF7AVLvpG26UgECKNQ":{"text":"This was our splurge dinner out on our last night in NOLA. I was traveling as part of a gr","useful":3,"cool":2},"H-Q9OLLwlsUYcb5YOPcjcw":{"text":"Fantastic meal and great show from our counter seating overlooking the open kitchen. I sta","useful":0,"cool":0},"dWEskSQrVKF9u1B6yDPGnA":{"text":"This was our first time being at one of Emeril's restaurants and what can I say... wow!! W","useful":0,"cool":0},"SWbVsZv-vH9OqreUNfvxiw":{"text":"Great dining experience from the moment we walked in. Staff were all friendly and sincere.","useful":1,"cool":1},"SrISMcv2nCeQEca6ZDon8w":{"text":"Food was all executed wonderfully but I thought it was very over priced. My ribeye was 45$","useful":0,"cool":0},"Oez2GP6Jgs6T86VPqbQu0w":{"text":"Delicious and service was fabulous! Had \"second chance\" cocktail of the day -so smooth and","useful":1,"cool":0},"b1LMbf-DkrqPDvCBZvAqBA":{"text":"Went here with a group of 10 for what was an excellent meal from start to finish. They gra","useful":3,"cool":2},"ePfX39-n41FwCt3rrU5_hA":{"text":"Let me just start by saying two things.\n\nBBQ Shrimp and Banana Cream Pie.\n\nTo die for.  It","useful":3,"cool":1},"YxFQvvpZf1AqpCtBFtsOaQ":{"text":"Fantastic, loved the food, environment, everything. Started with the yummy stuffed clams, ","useful":0,"cool":0},"tE2ChunNWt9mSLQx6NiF4g":{"text":"This review is just for the happy hour, which currently features a German-themed snack men","useful":1,"cool":1},"0BIBb7Fnr5wNnyQ-yVd_DA":{"text":"This was my 3rd visit to Emeril's over the years - and it just keeps getting better. The f","useful":0,"cool":0},"8OLxBqHTVeoT_8FQEN1Evg":{"text":"Pretty good, I got the mussels and they were lovely. My complaint is that tourist go here ","useful":0,"cool":0},"lybj2tA8NMZBWz-ZvMD0mg":{"text":"Can't believe this place only has 4 stars. Easily one of the best dining experiences I've ","useful":1,"cool":0},"rRolmmVJ5eIFErepS5e8Nw":{"text":"Had my Birthday lunch here .... Very nice and elegant restaurant ... My husband had chicke","useful":0,"cool":0},"NQ2gvtrm8q9fpRPAYgbmZQ":{"text":"I've been an Emeril fan since his Food Network days  but never got a chance to try any of ","useful":0,"cool":0},"H5nnNVpLE7XmULPyvievLA":{"text":"This is Emeril Lagasse's original Restaurant in New Orleans.  We came to here for dinner. ","useful":0,"cool":0},"C3Sz3uHKc2BXpGJKhHvmDA":{"text":"We celebrated my daughters 30th Birthday here.  Overall the experience was  nice, with the","useful":0,"cool":0},"Y1999NWDnbX68XoTdqqDsw":{"text":"The lady friend and I get fancy once or twice per year and this year we chose Emeril's for","useful":10,"cool":7},"MXU1eOW_GEB244fMlnRahQ":{"text":"Went to Emerils on our last evening there. It was a tasty meal but GW fins was still the b","useful":2,"cool":0},"tEj55kB12ut-23pdQ_Vkmw":{"text":"0 stars really - FLAVORLESS filet mignon and dried out mashed potatoes.  Totally disappoin","useful":0,"cool":0},"7KGNiX2RDZqHcaO36DygCQ":{"text":"My boyfriend and I love this restaurant. He frequented it alone before he met me and it's ","useful":0,"cool":0},"7xYqvr4R2FiACAJd49keMQ":{"text":"This restaurant is A-OK, but after making lots of Emeril's recipes I was let down by our e","useful":2,"cool":0},"eLhAUrVV3Xik_ORtXehyKQ":{"text":"I'd really give the restaurant 3.5 stars. It just didn't meet the expectations I expected.","useful":1,"cool":0},"URgS1u8xXcZO_LI0pm-fbQ":{"text":"What a great place for a special dinner!!  I believe this is his flagship restaurant in Ne","useful":0,"cool":0},"D9H1pvzoo3G2ytpg4_hg4A":{"text":"Mind blown. (So is my food budget for the entire week but what the hell, you only go aroun","useful":3,"cool":2},"aw5XVPnInW515VWuM3JsIw":{"text":"Went to New Orleans for the first time this year and ended our trip with dinner at Emeril'","useful":0,"cool":0},"mLZxYY0t58zHmDYZAyU06g":{"text":"Hats off to Emeril! Let me start by expressing that the location is beautiful . I really e","useful":0,"cool":0},"lfS9LLGCXVHYlUcatdyYVw":{"text":"Amazing service.  Food was off the charts. A little loud by the kitchen, but the show back","useful":0,"cool":0},"cjQ83hW3Q5lt1pIMho1rNA":{"text":"I'll start with the good, before I get to the bad and the downright ugly. We were visiting","useful":0,"cool":0},"JDdGWoi3aGZB5YsV4--k0w":{"text":"I am very sad to write this review as I have had extremely good experiences at Emeril's Or","useful":0,"cool":0},"ntTU2m-WoXRUzT3PE04gMQ":{"text":"First visit while attending conference in New Orleans.  Outstanding service,  menu choices","useful":0,"cool":1},"_felz1lmimNpSOew6vtTnw":{"text":"The service in this place is INCREDIBLE! It was my first time in NoLA this year for Mardi ","useful":0,"cool":0},"A4MkVhyLaMcKzaGBLNmWUw":{"text":"Hands down, best dining experience of my life, and I love eating at new places. \n\nWe made ","useful":2,"cool":0},"8u74RUtCroiLZYg3EOSwuQ":{"text":"Sort of at a loss here... we were in town for a convention  a couple nights ago and my ass","useful":1,"cool":1},"oFzQ0ZwkTA-47erhSMveYQ":{"text":"This review has been wayyy overdue but I am here now. I see it is temporary closed and hop","useful":0,"cool":0},"5yLFbXkxHd6ZG9wytKQz6Q":{"text":"I've only eaten here a couple times so this is just based on today's experience.   This re","useful":7,"cool":3},"V3bkVu0tzB-NbWQyv2VPNw":{"text":"I get a feeling the service in this city is getting jaded?  All 4 of us were seated with b","useful":0,"cool":0},"wZ4r81vR7GkM85OGSMnsQg":{"text":"We couldn't go to NOLA and not eat at Emeril's.  Emeril's is an institution, and well wort","useful":1,"cool":0},"Epp_hz2Xo_yq5EYOGFYClg":{"text":"Service and ambiance: \n\nEven though service was superb and on point, the food just wasn't ","useful":2,"cool":1},"nHBENswU6t4EiqVcffTakA":{"text":"Baked River Trout and Mussels with Swiss Chard and Patty Pan Squash at Chef Emerils Restau","useful":0,"cool":0},"Dp21k8kFt3kIKjP2oCSBkg":{"text":"Well\nThis place lives up to my expectations.  Two of our party of 5 were vegan and we were","useful":0,"cool":0},"XdjgdwaFJ6qGmB0PFh52Qw":{"text":"There is a lot to like about this place. The ambiance is great. It's a converted warehouse","useful":1,"cool":0},"E4pl4AAjiXN-o9WyVP3ihQ":{"text":"We had a lovely dinner at Emeril's tonight.  Food was good, as expected.  Service was fant","useful":0,"cool":0},"IvQxe0SuK1MPMtG1ztsUyA":{"text":"Worried it'd be a bit cheesy, but ended up being one of the best meals we had this trip.  ","useful":1,"cool":0},"wFJIOuKA2QTmy-ZnrYnPLA":{"text":"I was beyond disappointed. I would give the food 3 stars and the service NONE! My husbands","useful":2,"cool":0},"_GJRS_ht7jpUokPINMu51Q":{"text":"We ate at the bar which is actually quite interesting if you wish to meet people. Food was","useful":1,"cool":0},"JoWYMALdNRrIs4wsiCE7cQ":{"text":"Items Selected:\nIced Tea\nSeafood Sausage with Watercress and Saba\nCornbbread, Honey Wheat,","useful":7,"cool":7},"OGanlaNjZJOjtwzl8nX8jg":{"text":"Actually, 6 out of 5.\nThe best restaurant experience for as long as I can remember.  Came ","useful":1,"cool":1},"BhJiJrvDLXIwWaBBRqJ4fw":{"text":"WARNING....GOT MAJOR FOOD POISONING.\n\n We were visiting NOLA and wanted to go the Emeril's","useful":3,"cool":0},"QVscesLrFiuzjg8-d2LWxA":{"text":"My personal opinion, This place is overly hyped! First and foremost our server was REALLY ","useful":1,"cool":0},"tNZXu5UcBdpwZr9sfG-ghQ":{"text":"When in New Orleans you gotta try Emeril's, right?  Well we thought so so we tried it for ","useful":2,"cool":0},"y7aq_yw5EY2TdziO5OFXvg":{"text":"I hope you've got time because this is a lengthy review paired with a horrible experience!","useful":3,"cool":1},"xDLIL0jEVhRwYtled4_1Jg":{"text":"We went to New Orleans for our honeymoon and part of my family's gift to us was a giftcard","useful":1,"cool":1},"N2kcGWTPwZV48JwvRAItoQ":{"text":"I think that Emerils treats you like a celebrity most of the time. It took a while to be a","useful":3,"cool":1},"8gsr1MWsbjnRkSnGQKftbw":{"text":"The atmosphere was wonderful, food excellent and oh my God the service was wonderful. Love","useful":0,"cool":0},"BDTw5H4T9RPXI8Ff8pZ0dw":{"text":"BAM! What's the fucking rush, guys? I sat for my 6pm reservation Sunday night, ordered dri","useful":6,"cool":6},"unCknly5z5H6nzoJpTDDlQ":{"text":"We were in New Orleans around Labor Day weekend for a convention. I had always liked watch","useful":0,"cool":0},"lWxHbqyBWWyfWi8_9w2y6Q":{"text":"I would give this place a 10 star if I could! Emeril was the first chef that I ever laid e","useful":1,"cool":0},"xjVFciZC6uQML4DaMKGzBQ":{"text":"I went for the first time on what happened to be their 21st anniversary. Emeril himself wa","useful":3,"cool":2},"BnyiZDWV_rGMSw_4VlVlZQ":{"text":"I grew up watching Emeril so it was a real treat to finally get to one of his restaurants!","useful":0,"cool":0},"M5q7mDGsDzMEbb4EmdHexQ":{"text":"I have always liked eating at Emeril's; it always feels comfortable.  The food is reliably","useful":0,"cool":0},"6Ttw30y7yO3-2pDAuaRSUw":{"text":"Emerils is a top flight restaurant even IF it's the crown prince of celeb chefs. Great wai","useful":3,"cool":6},"_dNvxQUPHSM69jL-soAyDQ":{"text":"Party of 4 for dinner Thursday night.  Food was average. That is disappointing as I have h","useful":0,"cool":0},"rxMSL3M0SxxY3aPoOGwy7Q":{"text":"Last min change of plans landed us at Emeril's New Orleans for dinner. It was amazeballs! ","useful":1,"cool":1},"uJtGM7QavZbEMJlYB4NWyA":{"text":"Damn you Emerial and your amazing food!\n\nI have eaten at Delmonicos in Vegas and it was fa","useful":2,"cool":0},"3HB6Jgi7CpTlnIVQdhyODg":{"text":"Brandon was the server who made this a truly enjoyable and fun dining experience. Customer","useful":0,"cool":0},"h9s-hT-yJLgJP2oP-s-PdA":{"text":"This place had THE BEST service! When you walk in and out the waiter and waitresses greet ","useful":2,"cool":1},"9jn5m3-w-q3dlBfjavCoEw":{"text":"The boyfriend made a surprise Valentine's Day reservation for an early dinner/late lunch. ","useful":2,"cool":1},"AP4TLpuOsTH4h25NQr88_Q":{"text":"I absolutely and thoroughly enjoyed the experience at this fine restaurant.  My waiter was","useful":0,"cool":0},"e6DT3UZyvk5NksJ9juOpuw":{"text":"We started off with the Signature Sangria, light and fruity. Then shared the wedge salad w","useful":0,"cool":0},"onRMGq1YfsAnW2fC02A6KA":{"text":"In town for a conference, a large group of 16 people ventured to Emeril's for a midweek di","useful":19,"cool":21},"ImQ5OGQ5GTrECV7iEnoozA":{"text":"Absolutely mind-blowing porkchop.\n\nWe were a large group and had a late dinner around 9 pm","useful":1,"cool":0},"0ZcNk9fAyXTZit5ITrCZQA":{"text":"This was a huge disappointment.  We were seated in the edge of the dining area that connec","useful":0,"cool":0},"V_ApE5icTVIysYBW3AXa_A":{"text":"We started our  New Orleans experience here and it was a great experience and meal.  The s","useful":1,"cool":0},"A_J942j_l55wclk0CuqcUg":{"text":"We were in New Orleans the same week as a few large conventions so getting a table where w","useful":0,"cool":0},"N5uMqGLGEZ0R6d4VyJBcww":{"text":"WHEN THE CAT'S AWAY...\nSloppy. It's becoming endemic across all of Emeril's restaurants: t","useful":12,"cool":4},"ng4Cr3PBPwdb2ueyEaduaQ":{"text":"Bam! We started our NOLA dinners with a bang, or a bam. \n\nOn previous visits to town Emeri","useful":4,"cool":4},"3iCh0pHJWQqTq0Ze4BZTAw":{"text":"LOVED this place. Dreamed of coming here since I was little. Of course it's going to be ex","useful":0,"cool":0},"aMvisV2ijqECVXlcAJsz7Q":{"text":"Loved this restaurant. It has a very quiet and romantic feel to it. Overall the food was t","useful":2,"cool":1},"4pqNX7Lqj4nfS0NWKMJCrg":{"text":"Oh, my. What a great eating experience. The food was amazing. Our waiter young Mike took g","useful":0,"cool":0},"qGD52UZFnOcO74CgB-pYtQ":{"text":"WHERE IS THE BAM?  Went for Mother's Day. Disappointed with the \"bland\" seafood gumbo, rai","useful":0,"cool":0},"k2zFZGsK_xjEfxTxGcIsFg":{"text":"Went for dinner and the meal was very good overall. They brought out fresh baked bread, wh","useful":0,"cool":0},"-R2hTNkv9w83yed7Jp1kBQ":{"text":"This is my 3rd visit to Emeril's and every time they deliver quality and service in every ","useful":0,"cool":0},"cJiETs5ssRVtRpw0mYVHKw":{"text":"Best place we ate in New Orleans, and that's saying something! Amazing service spectacular","useful":0,"cool":0},"PzzHB3o6nQA3rY_rq59zGA":{"text":"Came here twice in 24 hours. Wasn't actually my choice (reservations made by 2 diff people","useful":4,"cool":3},"qHKiP74cZld5kbcipL0pjQ":{"text":"Emerils is delicious! The service is unbelievable and the atmosphere is something special.","useful":0,"cool":0},"i8Ue1-_SBVsbs7QUQuBjFQ":{"text":"I went to Emeril's for a birthday celebration. We were late for our reservation, and upon ","useful":3,"cool":3},"F1AyQkHgad1LuNqiKINdVg":{"text":"BAM! Not impressed!  Emeril needs to \"kick it up a notch!\"\n\nI ordered the pork tenderloin ","useful":3,"cool":0},"D3uErPbiMNNLt7OkI3CnUw":{"text":"I really wanted to love Emerils. But tonight we were very disappointed. First off we order","useful":0,"cool":0},"gJBNZBbrpw0jzjjjaXSc2Q":{"text":"What did I expect? A tourist trap. Tons of stretchy pants wearing out of towners celebrati","useful":10,"cool":10},"oiYkK_S_LPSWzhKQq1lfqw":{"text":"This is as good as it gets.  The food was great, the service was as well.","useful":0,"cool":0},"Kouaz9rP_kAJ26ufSaIdiQ":{"text":"Sat at the bar for a Wednesday night. Jason was an excellent bar tender. Landed on the \"Ol","useful":0,"cool":0},"xqLabOXVt6EOF7_I7Hjsew":{"text":"Came here for dinner with my dad. First off - the cocktails are incredible. It is dangerou","useful":2,"cool":1},"dRvlmQCMLg2L6kJ0M5xI9w":{"text":"Dinner here was excellent, a wonderful treat after having been disappointed years ago by N","useful":3,"cool":1},"b8s4nR_u_n-MoTaCb4EtVQ":{"text":"Going to Emeril's is an experience. We went with a friend who lives in New Orleans and hig","useful":8,"cool":5},"11atXIZKuMoSpdRTZQ8nLw":{"text":"This is my second time dining here but it has been a few years since I had first visited. ","useful":1,"cool":1},"iEy_fE4bm0hR6TbkBLfylw":{"text":"The service was impeccable! We had two people dedicated to making our experience memorable","useful":1,"cool":0},"2TTFEBzfSbusRHxKVC8kGA":{"text":"This. Place. Is. Amazing.  \nWe had high expectations and they were exceeded.  Young Mike w","useful":1,"cool":2},"r47TZ9vaZDd1k95GiG9iog":{"text":"We ventured to Emiril's because it was right next to our hotel and we heard really good th","useful":1,"cool":0},"UWSGL7sf8iBAUqKPX0g6dg":{"text":"I felt special dining here. White table cloths and my own waiter. The staff were attentive","useful":1,"cool":0},"Wo7XfjeJkjVWIkR36qR00A":{"text":"Dinner was amazing.\nThe restaurant was very nice and the wait staff was amazing.\nWe had tw","useful":0,"cool":0},"8qQvwXFg3wVxT9CmmBSoMA":{"text":"Ok, well this was a 9 out of 10\n\nWe sat very close to the kitchen which is open and I was ","useful":2,"cool":0},"qcGjnYWSCMZ4xu3O5pL6Fw":{"text":"Beautiful space, wonderful service, fantastic food and warm atmosphere.  I dined here with","useful":1,"cool":2},"7EvmtP_20LTByaOKCmqPbQ":{"text":"This was the capstone on our trip along the Gulf Coast.  I timed our trip to have dinner a","useful":8,"cool":7},"p8hiuzKKABb6jtpUzaRo5A":{"text":"I wanted to give Emeril's a 5 star so so badly. Literally every dish was delicious and so ","useful":2,"cool":1},"XOO5emLLRSHhInUBDEnUNA":{"text":"My boyfriend and I brought his parents here while they were visiting us in New Orleans. We","useful":0,"cool":0},"s8X0rOlYSC7hp9t5j1_lbg":{"text":"I can't believe that I've lived in this city for 30 years and have never eaten at Emeril's","useful":3,"cool":1},"0RWU0m73AuQkWy5sMIG6DQ":{"text":"Emeril's restaurants are all top notch... I have never had an experience that was anything","useful":0,"cool":1},"66b11MfzipFKHlqkF8p_AQ":{"text":"With so many reviews of Emril's flagship restaurant, I struggled with whether to review an","useful":1,"cool":1},"2jUR68iRS3X1pLfd0gWBmw":{"text":"The food is absolutely, insanely incredible. But I will give this as an honest review of a","useful":3,"cool":0},"0-trfEDmdH3WMRy2fQJJIQ":{"text":"Went here twice during a convention this week.  Lunch was skimpy for the price, but dinner","useful":0,"cool":0},"bB5bFB3C0Ay1a56L_BzjBQ":{"text":"My husband has been bugging me about Emeril's for ages. Finally we have time for \"date nig","useful":0,"cool":0},"0jL5pUdvPayreidJVi8r5Q":{"text":"Slightly disappointed during our meal here. We came just to try some of the appetizers and","useful":1,"cool":0},"ZF2j2rB_YUUcbiRR-Y3K9Q":{"text":"My husband and I sat at the bar for dinner (full menu at the bar) because the place was pa","useful":1,"cool":1},"KxMd2iiizLNWjwSn13VMaw":{"text":"Great Food and wine presentations knowledgeable service was impeccable!\n\nWe ordered the 5 ","useful":1,"cool":1},"oFc6x7_FIG80FPAg4jYfAg":{"text":"What's not to like? I ordered the healthiest meal I have ever ordered and it was the top t","useful":2,"cool":1},"jytI9dCzID7EjJNsEOo5JQ":{"text":"I ate here about 15 years ago. One of the best memories I have with my grandfather, a WWII","useful":3,"cool":1},"muiuA-i-u-OFG4RgOjn5-Q":{"text":"It's an extraordinary restaurant which is no surprise. \nI'm not sure you can get a bad mea","useful":0,"cool":0},"OOdaJ0-n2fyVO30rSqaJxw":{"text":"App: 5/5\nEntrée: 2/5\nDessert: 100/5\n\nComing here was mandatory after seeing the banana cre","useful":3,"cool":1},"_txfs6od9OcIt68WUs4cRA":{"text":"I thoroughly enjoyed my visit to Emeril's. \n\nThe service was great...our server was very a","useful":3,"cool":2},"PazA2JpaEOUrTEXvqAiP2Q":{"text":"My friend and I recently had lunch at Emeril's on September 24. It was an awesome experien","useful":0,"cool":0},"q2sRCCDlDP7VaKl3-JkWiw":{"text":"Do you like to feel like a King/Queen? Yes? Then I recommend Emerils. The staff is extreme","useful":0,"cool":0},"wGVJEsFT_FoSnLDookFBzg":{"text":"Have eaten here on several occasions over the years.  I have never ever had a bad meal or ","useful":2,"cool":0},"lAURUyyGNnIQKVRMhrTVmQ":{"text":"This place is apparently amazing for omnivores, however it sucks for vegetarians. \n\nI had ","useful":7,"cool":0},"1M_CWximRNs32zefJUmctA":{"text":"I've come to appreciate fine dining over the years and while my palate isn't as refined as","useful":2,"cool":0},"NzTQTxqpd4EMz3y_qiKSQg":{"text":"Emeril's New Orleans was an amazing experience, I'm so glad they re-opened during our vaca","useful":22,"cool":18},"1ZA67JBhgDpbVUlzlany_Q":{"text":"You think of Emerils and you think of this great restaurant. We decided to go with the che","useful":0,"cool":0},"195gd1I2JVubKppSfUa16g":{"text":"I must say, I really wanted to love this place. The space is beautiful and the food was go","useful":5,"cool":2},"94GAitugocyiDuiX8aMyLg":{"text":"A little late posting but better late than never.  Ive been to almost every restaurant tha","useful":2,"cool":2},"8KpSdpUxGL52V6Z_7MbDJQ":{"text":"Definitely the spot to be if you're looking for a nice, upscale restaurant in New Orleans.","useful":1,"cool":1},"l0aRvdcyrhNrx6M_athSoA":{"text":"I dined at Emeril's for a second time. The food was good, but I feel the prices have incre","useful":1,"cool":0},"eQ0dnRR-eL_lGjnjIT8dUw":{"text":"What a treat to be able to visit Emeril's flagship restaurant in New Orleans. We made a re","useful":0,"cool":0},"Z5dTmc9td_dC3YQPFO_aCw":{"text":"Beautiful ambiance and excellent service.  The wait staff was courteous and welcoming.  As","useful":2,"cool":0},"oCV7EWDL-0XE3afo_f7PQA":{"text":"This place had great service and ambiance. I would certainly recommend it for a date or bu","useful":0,"cool":2}}