{"hjxovTfMbP0cjJUQWfKSlw":{"text":"Cute place. Got the Italian American.  French bread has a heavenly crunch. Love sandwiches","useful":1,"cool":0},"97dr4tbG1h5uh4QpjOUXrw":{"text":"Yum! Fried Bologna Sandwich was unreal. The wedge salad with everything bagel seasoned dre","useful":1,"cool":1},"J31z00JnhFE18S6w86_Ftg":{"text":"Highly recommend the wedge salad and collard green melt, ridiculously good. Love the sense","useful":0,"cool":0},"LDKwX8uzcuKfhb8RK1Unmg":{"text":"Damn, I'm not sure to start with this place. I was here with the whole band and tried a li","useful":0,"cool":0},"rO1rrl03WAQrDYhWPJzeTA":{"text":"Def on of the most innovative restaurants in Nola!  These guys bring it full throttle!  Th","useful":0,"cool":0},"dmQTMc69wqijXW3MUVtOFA":{"text":"Been here once, but don't think I'll be back. I had read about this place in Bon Appetit s","useful":2,"cool":4},"SGYkTM0v-HsNOnriGHoi8Q":{"text":"I want to come back and try it all!!!! Had the wedge salad, it's amazing! Loved the retro ","useful":0,"cool":0},"nYizI1x0lfF4curTcDCowA":{"text":"The Italian sandwich was pretty good.  However, the cabbage salad was so dam spicy, I coul","useful":1,"cool":1},"2VYy4jEVud3oHxj27Tb7cA":{"text":"OMG. It's like a time machine back to after school lunch at a friends house c 1986. I dest","useful":0,"cool":0},"dYJnpq_f-1YLF3s5u_TE-w":{"text":"Really yummy cocktails and the greens and coleslaw melt sandwich was SO GOOD!  I went on a","useful":0,"cool":0},"jeasNnTcjmdwm5hw57PiqA":{"text":"These sandwiches are dank as shit. If you don't like dank sandwiches, don't come here, bec","useful":2,"cool":1},"ItaJeEcjsL2z__c6p_gNBA":{"text":"Great neighborhood gem.  This place is a renovated gas station done up in a 50's 60's them","useful":1,"cool":1},"LagagylTGNIotn5OVwEQzw":{"text":"So. Good. Believe the hype! I had the fried bologna sandwich and deviled eggs and they wer","useful":0,"cool":0},"ta0s0kQ8geOwI8OItGhZgA":{"text":"Best fried bologna sandwich EVER!!  This was a fun little quirky place. Follow them on Ins","useful":0,"cool":0},"07KW3cGwqum5FejHTT2Qkw":{"text":"Very interesting sandwiches. The turkey cran was really good but pretty small and very may","useful":1,"cool":1},"BxFtbQs1ArnXT3fW_jWRcA":{"text":"This place is really neat. Frog salt and pepper shaker: plus for this frog lover. Sweet te","useful":2,"cool":2},"l9fJ1dpuT3cAePxEE-t5wA":{"text":"Amazing!  Was at a conference and came here for lunch based on a recommendation from a fri","useful":0,"cool":0},"MZgrWUt_01zaEfhAooUVnA":{"text":"Very cozy, got a veggie sandwich and a cabbage spicy salad. Both good, the salad perhaps w","useful":0,"cool":0},"kUKwbNg9XI0mKH8yw8nltQ":{"text":"Absolutely delicious! Lamb roti, kids grilled cheese and the lettuce wedge!!! Yummmmmy!! E","useful":0,"cool":0},"-wTf-iVDa2Ixp1qR2An79Q":{"text":"Turkey and Wolf is very much worth the hype! I love everything about this restaurant from ","useful":0,"cool":0},"25X31LxO3wDDZU0rQHiR9g":{"text":"Yum!!! Line was out the door and to the corner of the street, took 30 minutes to order a s","useful":0,"cool":0},"ZdRhivPZIVDHkVBrO-PHjw":{"text":"Perfect funky sandwich plate. I got the lamb neck roti with cucumber, yogurt and onions an","useful":0,"cool":1},"vHjXLrZekSraa1pHnMdU3A":{"text":"Absolutely fantastic sandwiches, but the fried pot pie might be the best thing I've ever p","useful":2,"cool":1},"-hquLZKIhbtO_0V5kpmkdw":{"text":"The collard green melt sandwich is a revelation. Like a reuben, but with collards instead ","useful":0,"cool":0},"NvHc5aCgrV4kG-4nNvM_6A":{"text":"So, I have been wanting to try this place for a long time.  After shopping, I decided to s","useful":4,"cool":0},"LetxPwhmmCHcuCo40Bcjmg":{"text":"Seriously a hidden gem of the city! This unique take on sandwiches matches flavors that ma","useful":0,"cool":0},"ZDgczxmwiFUguWc8Chy1Iw":{"text":"It's worth the trip and any wait! Everything we had was unexpected and phenomenal. Highly ","useful":0,"cool":1},"T5tvYPy2CDd78OMIAcQqxQ":{"text":"Sandwiches are delightfully life altering. These guys get it right. Line to the street whe","useful":1,"cool":0},"-U5fD9UABXLXFq1f19rB6A":{"text":"Service and setting was very nice. All the food was made well, but they missed the mark a ","useful":1,"cool":0},"kWDwVoYOBAwtQEgcONrHYg":{"text":"Tried Turkey and the Wolf for the first time today. Oh my goodness!! We'll certainly be ba","useful":0,"cool":0},"4zw7OX_WYc7sU1wsj6qmXQ":{"text":"Well, this highly acclaimed new Restaurant is all the buzz, so we were excited to try it. ","useful":0,"cool":0},"X2fIakTXlwph49VaqzV1Zw":{"text":"Interesting combinations of flavors, and we enjoyed them all. The sweet potato sandwich wa","useful":0,"cool":0},"VQqhwYp06WNBiuJ_a2Ef6w":{"text":"Holy cow! I had the ham sandwich. Probably the best sandwich I've ever had. The 2 year old","useful":0,"cool":0},"TPeUX3r2QhBBSB0jIVI8XQ":{"text":"If you love exploring and trying new foods, definitely check this place out! That being sa","useful":0,"cool":0},"Ye3h8q5iXYvzEKt5AWhcPA":{"text":"Wow, just wow.  Don't be scared,  just go for it.  I'm describing my first cheesy collard ","useful":0,"cool":0},"QaLtjIzLifG7rZ6hkKNeGA":{"text":"Food was great, but male cashier had an attitude. It is a huge menu that needs a little ex","useful":0,"cool":0},"bgjd9IPvlggWTl9mKrXGDg":{"text":"Great food, \"home\" cooking with an inspired twist.  Had the wedge salad and the collard gr","useful":0,"cool":0},"x_hZa4j_4WztPbhIIHJ7mw":{"text":"This is a little hole in the wall with a small eclectic sandwich menu. You stand in line t","useful":0,"cool":0},"Y9ZeaYihWBUrczI8kuQEHg":{"text":"I ordered the ham sandwich, and as much as I wanted to like (and eat)  it, there was way t","useful":0,"cool":0},"AUMsC9Un5MlxKOxU_q0Law":{"text":"This place is so fun and quirky and the food is amazing. The bologna sandwich is everythin","useful":0,"cool":0},"ECt4T-FnQHB1MLlEwAZGXQ":{"text":"There is a reason everyone is talking about this place. You will not be disappointed. Deli","useful":1,"cool":1},"QEKOYnfTb2_SHSFG-CFo_w":{"text":"I can't stop thinking about the fried bologna sandwich.  It's overly cheesy, the bread is ","useful":0,"cool":0},"ly-RObSJ7IzjuMtEjftEwg":{"text":"Hands down the best Wedge Salad we have ever had! Drinks were creative as is all the food.","useful":0,"cool":0},"nKGkZ_KGCpUbPFLFJj6ULw":{"text":"My coworker and I went to the Turkey and the Wolf during our lunch and let me just say thi","useful":0,"cool":0},"hMiRaWiyDfDPHL4SKeK2OQ":{"text":"After reading all the hoopla about this joint my friend and I came to see what all the fus","useful":3,"cool":1},"1qhR0iVQ7iIqzRyZ5sQj2w":{"text":"Thank you for the best sandwich ever! The country fried chicken sandwich was incredible. T","useful":0,"cool":0},"QTpE_i9TPVSJIqumZynK7w":{"text":"YOU NEED TO GO HERE! This funky little restaurant makes the best sandwiches in New Orleans","useful":1,"cool":1},"JLyi0YKMO9NXT5bKf60Rsg":{"text":"An amazing food experience! I would recommend to all, their sandwiches are spectacular! We","useful":0,"cool":0},"Jb0rNuoPZ_72jSVYtq_Ssg":{"text":"The chicken fried steak sandwich is honestly one of the best sandwiches I've ever had in m","useful":0,"cool":0},"eOKyeHvEZkG6aZDfkVgjiA":{"text":"This place deserves much of its hype! According to Bon Appetit it's the best new restauran","useful":6,"cool":3},"t5gtTMGMNZR0GDjAAdOwiQ":{"text":"I've been looking forward to eating here ever since I read the Bon Appetit article, and I ","useful":0,"cool":0},"gxhXlk8cxHyC0cn-hb8A5A":{"text":"Had the collared green melt.  A wee bit too much mayo.  Otherwise excellent.  If you go be","useful":0,"cool":0},"iH8a7nT23xyGZByA5nSiJA":{"text":"My fried bologna has a first name it's T-U-R-K-E-Y...when your umbrella is inverted and fu","useful":0,"cool":0},"FYeo1zmYETCDWBwJm0vRxg":{"text":"I saw this place on \"Somebody Feed Phil\" and had to make it a point to try this place out.","useful":0,"cool":0},"s7Jqy6fwWJ_H8xh_uWtqkQ":{"text":"Cute neighborhood lunch spot - tried the handheld chicken pot pie, the greens melt, devile","useful":0,"cool":0},"VMbXYN-Uhf17TtPqe_lT_w":{"text":"Really amazing sandwiches. Well worth the 15 minute wait in line. The fried bologna sandwi","useful":0,"cool":0},"pnk7LcE7UTA6GRbtXEA4CA":{"text":"I didn't  expect  to like this place, hence, no pictures. Well they proved me wrong. The m","useful":0,"cool":0},"Foxo_RkYw0zJY3xFi9M20A":{"text":"I thought the place would have a turkey sandwich but it's just in the name. Lol. The meatl","useful":0,"cool":0},"uAKHL3j1xbx1OiqNviY9vA":{"text":"The seasoning and flavors are wonderful. They serve complex menu items. I'm assuming the m","useful":0,"cool":0},"4zZwN0tzFeLI1B4eCJwPKg":{"text":"Hmm I understand the hype and glad I stopped by as I was in NOLA. It was not too busy on a","useful":0,"cool":0},"sJ8aDsSpoamA6AqOK0UfHA":{"text":"It's hip, it's different, and if you're in New Orleans for a few days it's definitely wort","useful":1,"cool":0},"qidB_2GVYrpxIZ7IZyti0Q":{"text":"Deliciously eclectic menu! I got the lamb roti and our table shared the devil eggs. This i","useful":0,"cool":0},"T728a2nxgwA3T0AYHk_9BA":{"text":"Loved the wedge salad! Great place for lunch. We have seafood allergies and this place was","useful":0,"cool":0},"zvLHcEpixYAJEY1LESn6mw":{"text":"First time customer even though I live 5 blocks away.  I'll be back many times.  Had the C","useful":0,"cool":0},"mL-gDLAgSLu9LJ45PfbqNg":{"text":"Creative and yummy food! I never thought of making collards into a sandwich, but it's deli","useful":0,"cool":0},"CQlouqO3zzYg3tCuV3exFw":{"text":"Awesome lunch\n\nOn this NewOrleans trip I've dined at three fine dining dinner spots and Tu","useful":0,"cool":0},"-4Pa077zj2rG5f5kQ42onA":{"text":"Oooo baby, believe the hype!!!! Arrived at 11:30am, 30 min after they opened, and the plac","useful":0,"cool":0},"Hc3G1F67mzayWto30eMhSA":{"text":"This is the place you go for an intimate, fun, lunch date or break from the rat race!  I h","useful":0,"cool":0},"QNQzUGJJ_tBVMKlkCm6lHw":{"text":"We showed up at 11 am and the line was long waiting for the restaurant to open. It was bus","useful":0,"cool":0},"5f3b2vjnnc2fhAoSVRzujw":{"text":"Great place for stoner food. Greasy but delightful. Share a couple with your friends, beca","useful":0,"cool":1},"oI85W5DYM3NlgH7A6tSS2Q":{"text":"We got the fried bologna and the collard green patty melt. The collard green sandwich was ","useful":0,"cool":0},"HeVEsvD_9hiWub9t6MlVBg":{"text":"Ate here today. My friend recommended the place. Was so good! I tasted everything on the t","useful":0,"cool":0},"KGrrRpmgi_jVv2v27QtayQ":{"text":"Didn't live up to the hype. The place looks kind of like a generic bywater \"rustic corner ","useful":1,"cool":0},"mi_eWLWN-skR7Y3KTImukg":{"text":"Came across this place on instagram a couple of weeks ago and I knew I was going to New Or","useful":0,"cool":0},"2Ru6uCEsZtMNgnP2sRNrqg":{"text":"AMAZING sandwiches, ice cold PBR & a fun funky dining experience- you have GOT to get ther","useful":1,"cool":0},"VlIygjNE4mp0dyQac6zrIA":{"text":"Saw this on 'Somebody Feed Phil' which is a Netflix classic if you haven't seen it before.","useful":0,"cool":0},"2oMKIVF0iSgQDL8GIFwlEA":{"text":"Delicious wedge salad, great soft ice cream desserts with mostly savory toppings! Everythi","useful":0,"cool":0},"VuCzjeBNJRcLgcBEbSOtvA":{"text":"The only thing I really enjoyed here was a special drink of the day that had lemonade, cra","useful":0,"cool":0},"KBZr4PbCh14B78m-rNNqqw":{"text":"We had the Italian and ham sandwiches.  Tacos and deviled eggs with chicken skins. I thoug","useful":0,"cool":0},"n5nogooMVhBN4GLZyjBtRg":{"text":"It's not fair that there not enough places like this around.\n\nThe food is amazing and with","useful":0,"cool":0},"Y5kg6jql5uoGDZmQNJDDvw":{"text":"Go now!  The Collard Green Melt is in the top 3 most delicious sandwich I've ever eaten.  ","useful":1,"cool":0},"TO1nTIMqOHtrR1VzLT2TYw":{"text":"Life-changing sandwiches. Come hungry and don't plan on eating again the rest of the day. ","useful":0,"cool":0},"wqcWtnFdSnGUREiLx25iCw":{"text":"GREAT new place in the Lower Garden District! We were able to sit at the bar and bypass th","useful":0,"cool":0},"vIxhuFMW8Fg1amOvgfzyKA":{"text":"Best new restaurant of the year? Nahhhhh. Not even close. BUT, let's not get bogged down i","useful":0,"cool":0},"UUNcK6Lr93owYBCe0oUBYQ":{"text":"Food was so good. We reached the location right at 11am and there was a small lineup alrea","useful":0,"cool":0},"KjqLwd1OopfPgvgNdRwyDQ":{"text":"As far as lunch spots go this place is perfect. Fast, reasonably priced, and most of all d","useful":1,"cool":1},"YH7tdMMNnuGugGL4YeUSKg":{"text":"I went to this funky establishment during a rainy, parade season day and found it to be ne","useful":1,"cool":0},"MruqYZciPrBuZiCXKDnbpg":{"text":"Everything was amazing. Cant go wrong with anything on the menu. But the fried bologna and","useful":0,"cool":0},"goUgG-GjmxnNQhzx9ivMGA":{"text":"I want to pick up the entire place and plop it down in Austin, TX and watch it thrive. You","useful":1,"cool":1},"4Qz9iSauYQJmYMgLo-T6vQ":{"text":"The collard green sandwich & wedge salad were really good, but the other dishes were avera","useful":0,"cool":0},"hGEYcQ9GIk8Xw5ETD-GnWA":{"text":"Very few places live up to the hype like they do here! I showed up for lunch with the line","useful":0,"cool":1},"WibaWexRa1LAE5BPdBu5MQ":{"text":"Meatloaf sandwich was yummy, as was the lamb neck roti. Cool collection of Gumby character","useful":0,"cool":0},"9YnBDnNFwwL1nW9kqMENSA":{"text":"Best bologna sandwich ever. Period. \n\nNow, is it \"Best new restaurant in America\" per Bon ","useful":2,"cool":0},"K0Bgw3VwqlwI1X6KV0i1Tw":{"text":"A little off the beaten path, but definitely worth stopping by. It has a very eclectic, co","useful":1,"cool":1},"41fximVibAAOZf9BJWS8zQ":{"text":"Went here for lunch on a Saturday and was surprised by the crowd considering they're prett","useful":2,"cool":0},"n5yYZwpxjRaYySC1ziTdwA":{"text":"Really like their sandwiches-especially the collard greens one!! Laid back vibe with top q","useful":0,"cool":0},"cvxA-bIv_D4XJ7b8XD68yQ":{"text":"OK so this place for sure has it going on! The food here is ridiculously good and creative","useful":0,"cool":0},"NJMokpD5FrFxqMWihNY80w":{"text":"Not even the best sandwich place on the street.\n\nCame to T and W with high expectations af","useful":4,"cool":1},"nbaNnU1VxBmjAhGMWqfaOw":{"text":"Located in the old NOLA Smokehouse space on Jackson, the strangely named Turkey and The Wo","useful":2,"cool":0},"jmYSW57Z8X1m8Sq4C4KV3A":{"text":"Great food, cool environment!! Food was great! Went around 11:30, perfect time to go! By t","useful":0,"cool":0},"Insxu-ZVJvTA_RJ8k08iSg":{"text":"So much fun and insanely delicious! We loved it! The fried bologna sandwich ( with potato ","useful":0,"cool":0},"rxM9kBiKCVodbn0QsraSHA":{"text":"Mixed feelings about this place. The chicken fried steak sandwich is amazing. We also trie","useful":3,"cool":0},"osMOf5zyKRMv8rzgvt1F7A":{"text":"I don't even know how to start describing my experience at Turkey and the Wolf. It is in t","useful":1,"cool":1},"rZwvkJAHzgyXdmhHDaCEtQ":{"text":"I went here to try the collard greens sandwich - sounds weird but it was delicious! I and ","useful":3,"cool":2},"fJB8Y7Jh1IXaYdc6sSSpww":{"text":"The hype is real!  We went and had the deviled eggs, lamb roti, and collard melt.\n\nThe col","useful":0,"cool":0},"Rt4rSR0gOtXFcNtpEacykg":{"text":"You must check out Turkey and the Wolf if you're looking for specialty cocktails and sandw","useful":0,"cool":0},"gRd15OWRvMwxfOPs2OmWXQ":{"text":"Great vibe, service, food---fun place with great grub---fast, courteous people!  Worth the","useful":0,"cool":0},"niLhsY5KT-3v4NG1RoivKA":{"text":"Finally made the pilgrimage!!!  Well worth the wait. The fried bologna sandwich is all tha","useful":0,"cool":0},"Pq1MqainBl7Mt7lPEMDIxg":{"text":"Life-changing sandwich (collard & swiss). Tremendous salad (wedge). Hooray for day drinkin","useful":0,"cool":0},"wA8XU7cm-Yxfcs59_o8sEQ":{"text":"I had been anxiously awaiting the opening of this spot since I first heard about it. I sta","useful":13,"cool":11},"erdy_sjYn9hZBVfvhEyw8w":{"text":"We had the collard green sandwich, ham sandwich, asparagus sandwich, bologna sandwich, and","useful":0,"cool":0},"npctwjez5hbBYD_Xs1oGUA":{"text":"Sooo good. I got the lamb sandwich and it smelled like Xmas. Saw this on James Beard Nomin","useful":1,"cool":0},"R80AfFLGTHiIuTHTg-Cs2Q":{"text":"OMG!!!! Not that this place needs another 5 star review, but. I felt compelled to write on","useful":0,"cool":0},"daBWCTqjOje7mZuu48RTyg":{"text":"FOOD was delicious and a unique, I had fried pot pie /w a roamalade sauce. Pot pie was wel","useful":0,"cool":0},"YzKuQhtXNIWScYYsOSW-pw":{"text":"Soooo good! We got the tacos and the deviled eggs with chicken skin! Everything was amazin","useful":0,"cool":0},"I_G1T9UXV7WuopnFf10v6g":{"text":"Turkey and the Wolf was on our list of places to visit after seeing their feature on \"Some","useful":0,"cool":0},"pcR99sXD4RZjveCn3ctWhA":{"text":"Turkey and the Wolf, a new sandwiches and more restaurant in Irish Channel, was recently a","useful":5,"cool":0},"04h6Ma6iTf-Z7i5yVRPOiQ":{"text":"Make sure you get here early for lunch.  There has been a line the two times i have gone. ","useful":0,"cool":0},"1OQCgbFtfMk8IX2RDAMH-Q":{"text":"I would highly recommend the collard green melt.  The spicy slow-cooked collards, and pick","useful":0,"cool":0},"77Ua-SnSEPmDME8-G1hITA":{"text":"Dude,\n\nI've (foolishly) passed this place so many times without even giving it a thought. ","useful":4,"cool":1},"VSUGxToe5xcE-8Pbta_n9g":{"text":"Wow. I just had a collard green melt that ruined my shirt and rocked my world. It's a doub","useful":1,"cool":0},"YuPHu5sRgjHAzgH9vxYU9A":{"text":"I was super excited to visit this restaurant when visiting NOLA because the owner is actua","useful":0,"cool":0},"W71fe5bPtHyKC5PrEty9Ug":{"text":"Everything was perfect! Food was so flavorful, decor cute, and staff was pleasant. I'll be","useful":0,"cool":0},"3zqPu_BEdSyKhqVAz4Y1jg":{"text":"Collared Green Melt is an absolute must!!!\nGet there before 11 if you don't want to wait t","useful":0,"cool":0},"iD8hZUw6UScp-4jhh1dTLQ":{"text":"Came here around 12:15pm on a Wednesday and still plenty of tables and no wait to order.  ","useful":0,"cool":0},"BfAsmQgAajzSA_RwQjKFsg":{"text":"I've been here twice and thus far I've been impressed. The line at the counter moves quick","useful":1,"cool":0},"yVX_QumwCG5AOGtzQemh4g":{"text":"What an awesome food place! I had the fried bologna sandwich and it was so good! My fiance","useful":1,"cool":1},"56g0VG0n7XKFxER4JIX8yw":{"text":"YUM!! This place is soo tasty. Never underestimate the power of a delicious sandwich--this","useful":0,"cool":0},"3cv9xt95P8NxDVuo3jqpJA":{"text":"After seeing Bon Appetit named this place the best restaurant of 2017, I had to make a vis","useful":0,"cool":0},"-MKpZaSjoi_FiyRaJRVyNw":{"text":"This place is crazy good!  I wish I would have had an other day in New Orleans to try more","useful":0,"cool":0},"TxqagIBJeidTaDAGkfzfAg":{"text":"Wow. Wow wow wow wow wow.  Eat the chicken fried steak sandwich. Eat the cabbage salad. Re","useful":0,"cool":0},"brUQ9LKfpqOmj9i4ccPy3g":{"text":"This place his a hidden gem. Got their lamb meatball special...that sandwich was good AF! ","useful":0,"cool":0},"vuqcRBo9rNqtg_7TdKuHRA":{"text":"One of the best sandwich shops I have ever been!!! The deviled eggs were delicious and the","useful":0,"cool":0},"tsplgHWHSQz9v33uNQbjFA":{"text":"We went for dinner and I had a cocktail. I ordered \"Dave's punch\" I belive it was named. B","useful":0,"cool":0},"TKCeU2pZlUavPkbwMRhF2w":{"text":"Who would've thought looking back at the building and all it's blight and other incantatio","useful":2,"cool":1},"KH1ZO9k4lJNjYR3mlK98zQ":{"text":"Simply AMAZING. like you absolutely have to eat here every time you are in NO. Had the cur","useful":0,"cool":0},"ibzB0d2P6EQtzgQD-DgDNA":{"text":"Holy crap this place is amazing! I went to lunch with husband and two teenage kids. We had","useful":0,"cool":0},"eRDph4vxm8Nob1Cgb4-raA":{"text":"Yummy sandwiches! We came later in the afternoon on a VERY cold day, so there wasn't reall","useful":0,"cool":0},"7TagWEhBTqwefSBGeqRIWw":{"text":"This was one of the highlights of our week in New Orleans. We came at the recommendation o","useful":0,"cool":0},"Gwn2Hei0ZjDhErhwIy7MMg":{"text":"The fried bologna sandwich is the thing to get here. Ingredients are so simple but yet it'","useful":0,"cool":0},"bo2VZAIvQROeXC5Z0oL3Fw":{"text":"Went there on a Sunday and have to say the food was very good.  We had the fried baloney s","useful":0,"cool":0},"Iqn0oAAfYRcaZ-WfhyNCzg":{"text":"The menu is pretty sparse; there were more items with American cheese than vegetarian opti","useful":1,"cool":0},"gRNv0w5j5axEsse3iOtiKA":{"text":"Yes. It's that good. Get the bologna sammich...get the collard melt...get anything! GO NOW","useful":0,"cool":0},"YNRL66kcUWiERK1NYWEbxg":{"text":"Before our trip to New Orleans, we read that Turkey & the Wolf has been named #1 best new ","useful":0,"cool":0},"yJBALMB91k_oKF5INgrI9Q":{"text":"Stupid good. Collard green sandwich was rich and wonderful. Bologna sandwich made me recon","useful":0,"cool":0},"axsSFuovjhbi9fOJOciUUA":{"text":"After eating for the first time at Turkey and the Wolf, I'm unsure about why there's so mu","useful":1,"cool":0},"eV2YZg72gfUbdAhdnaehjw":{"text":"Absolutely delicious.  Tried the collard greens sandwich, pot pie, fried bologna sandwich,","useful":0,"cool":0},"TMpWgHlScInsF0_u7TR-8g":{"text":"I had the head cheese sandwich and it was pretty good.  But for 11 dollars and no side I e","useful":9,"cool":1},"J1IWagvRp3w8ZeXFeFOjmQ":{"text":"We showed up 17 mins after they opened and there was a line out the door, we waited about ","useful":0,"cool":0},"j3hnjic08aE4TqQjrHmfEQ":{"text":"First time to New Orleans and walked down the street to a little hole in the wall place. D","useful":0,"cool":0},"KFryECqqB7lCgDdGShzYJA":{"text":"We headed over to this place because of Food & Wine's recommendation, and they weren't wro","useful":0,"cool":0},"P3ZdxbYlbBFFVyDm77HIig":{"text":"Really trendy lunch spot away from the CBD which I learned means central business district","useful":0,"cool":0},"p_mdn9lFvNhL_cTlroFhoQ":{"text":"Absolutely great place.  Fantastic food. Always a line, but worth it.  Not pricey.  Funky ","useful":0,"cool":0},"yBTQ3QghLA_p3KxRQnAeUQ":{"text":"i don't know what to say.  I guess I will say this...can you please offer a turkey sandwic","useful":0,"cool":0},"TdZJAoLFQe7IEPm_TLKCuQ":{"text":"Best sandwiches I've had in New Orleans. The Ham Sandwich was awesome and the chicken frie","useful":0,"cool":0},"KPlKL1GiMm2beB5QMNhzTg":{"text":"A good vegetarian sandwich is hard to come by and the collard green melt certainly came th","useful":0,"cool":0},"LHbfjRGCA_DKOEmkGwE00g":{"text":"I had the carb boil roll while my sister has the chicken fried steak sandwich. Both were i","useful":0,"cool":0},"xy6WRzXZO_XAkkLN9kg3wA":{"text":"I have been meaning to check this place out. It's in my neighborhood,  right? \nWhy not sto","useful":2,"cool":2},"f9Zxz_wK-DJq_lr2YsDi6A":{"text":"Absolutely delicious. Inside plays great music. I had the Lamb Roti and it was absolutely ","useful":0,"cool":0},"HozNRBmpHkDcLmwNOsLhww":{"text":"Yummmm!  Stoner food meets farm to table is the best way to describe the menu.  Fresh and ","useful":0,"cool":0},"ieWRUu2JvElT6kma4xil1A":{"text":"Enjoyed everything we had here - if not in the mood for a sandwich, we tried the tacos whi","useful":0,"cool":0},"q5n_dtPoaC3OHJg-B2dr6Q":{"text":"Wonderful! Best wedge salad, lamb roti is a knock out, meatloaf, collards, everything is s","useful":0,"cool":0},"SJ19Gh_urnJ8lKXmDAUceQ":{"text":"Great spot for lunch that is New southern. Who can say no to cracklings! The bar has a won","useful":0,"cool":0},"oIyyNEbZZwOE6heipAr80g":{"text":"We had just read Bon Appetit's review awarding this little sandwich shop The Best Resturan","useful":1,"cool":0},"hOLcCleFILq5Rtu-vxDUmA":{"text":"environment\nit's purposefully kitschy. it straddles the line between trying too hard and..","useful":0,"cool":0},"A1ZYduT4d8FF-JNC5U2g6Q":{"text":"We had a great lunch on the patio. Ordered the ham sandwich which reminded me of Thanksgiv","useful":0,"cool":0},"DTg6cBJKujSPcAz726t4jQ":{"text":"You can't miss this place, as it has a gorgeous, colorful mural on the side of the wall. T","useful":0,"cool":0},"fnT8YSdUMuhdH26QgRqCKQ":{"text":"We came in with no expectations and left feeling like we hit the jackpot. Its a simple cou","useful":0,"cool":0},"CpMgqMxV6nPVcddZMQcZeg":{"text":"You MUST get a Wedge salad for the table. I got the ham sandwich but had food envy for my ","useful":0,"cool":0},"ErzB0SIs06K3C8b14x8kfw":{"text":"Mind blowing flavor! Best gumbo I've had next to Grandma's, love how it is served with col","useful":0,"cool":0},"7AEgFr5g38AI4b2N7kXTCg":{"text":"The food is good, the vibe is good, but the collard green melt is to die for!! Take a bite","useful":0,"cool":0},"oKOPBr9JIQ2yjlwM51Kj2g":{"text":"Yes folks it's that good! This restaurant is just as good as you have been reading in the ","useful":1,"cool":1},"4hmuCZtrwuOaxlJlEwIQ1w":{"text":"With much hope yet skepticism we visited this restaurant to see if indeed a basic sandwich","useful":0,"cool":1},"6WyxWfdo5xlkXsdMRuWVvA":{"text":"Lives up to the hype! The collard greens melt was delicious. While crowded and informal, t","useful":0,"cool":0},"kQMNo8GFGGz0LSfEhtQmyw":{"text":"Worth the walk from downtown. Delicious! The lamb roti-something was amazing. My mufaletta","useful":0,"cool":0},"a72VXSx6pqYSOWZpcQKQig":{"text":"The Wolf was so sweet, but the turkey was perfectly well behaved. \n\nWTF am i going to say ","useful":1,"cool":1},"y-pqtpmcKJHQrJ7NX3C0jQ":{"text":"Finally had lunch here on Saturday. About 1:45pm there was a line, looked at the short men","useful":0,"cool":0},"if2eINxm17vXxIalrk-Xqw":{"text":"This place is great. We live nearby and have tried a few things on the menu and everything","useful":0,"cool":0},"Og7DYHU9W0uEcB40j9TlCg":{"text":"Heard about this sandwich shop on Feed Phil on Amazon. It was amazing. Creative sandwiches","useful":0,"cool":0},"gRmyEwcB2oufcZ8ZU2vCHg":{"text":"Got that fried steak sandwich. \nShit was p good.","useful":0,"cool":0},"t2my8OjBCgiNxhugQxBXqg":{"text":"Awesome trendy cafe. Picked it after an hour of indecision and a sketchy looking cafe, fou","useful":0,"cool":0},"S5JrZiSwhux0M8DejuhVTw":{"text":"Fantastic. We had the cabbage salad and collard green melt, which are two of the best thin","useful":0,"cool":0},"OAxDWrCXN73iLakWnDG8Cw":{"text":"The reviews for Turkey and the Wolf are outstanding, so I was so excited to eat lunch here","useful":6,"cool":0},"EsNSVmlR-J7kdxJR3oaamg":{"text":"So good to find a restaurant , solid, with clarity of mind.\nInnovative but with purpose.\nA","useful":0,"cool":0},"lrj4AXbrZRcfwGE4hwTv-Q":{"text":"There was a really reeeeaaalllllly long line out front for brunch but it moved surprisingl","useful":1,"cool":1},"1FxEiLCJ_WV6MAN9-2u3xg":{"text":"Don't let the hype scare you off...the place delivers quality food at a reasonable price. ","useful":0,"cool":0},"kIxhcWgkG-9TqPCJJJomxw":{"text":"I have legitimately dreamed about the cabbage salad several times. Yelp is telling me that","useful":0,"cool":0},"qmMmUIulisDirEzI_Nii2Q":{"text":"Fast and excellent! You order at a counter (or the bar) and have a seat in a super cool an","useful":0,"cool":0},"zY1oaS4uZZRY_juzGaHYuQ":{"text":"Whoever decided to stick fried chicken skins on a deviled egg and dribble hot sauce on top","useful":1,"cool":1},"iVqCU5mVdKmFFyfwxGOtBg":{"text":"Decided to come after hearing all the great reviews and seeing it featured in magazines. D","useful":0,"cool":0},"e7VEVcpXRiWNYvczzApy4A":{"text":"This place lives up to the hype. We had the ham and the bologna sandwiches which were both","useful":0,"cool":1},"VIaS1rT0PE19d9OrBursew":{"text":"Ummm..... yes!!! Unique, DELICIOUS, adorable atmosphere, friendly staff. We had the meatlo","useful":0,"cool":0},"CSg8LzPhTMBzF_zNcjTZ7A":{"text":"Yummy stuff, I love their modern take on comfort food. I had the meatloaf sandwich, the co","useful":0,"cool":0},"xWhTwxHZwsyyud2p8_CzHA":{"text":"Never thought after a week in NOLA I'd come home and say \"the best thing I ate was a bolog","useful":0,"cool":0},"uRt4iXzCR_G9LgjkoPInEQ":{"text":"Kudos for doing something different! In a world of bland sandwiches, Turkey and the Wolf t","useful":0,"cool":0},"Oqo_vpMGO_ybH45pKr2z5Q":{"text":"What a quirky place! Fun atmosphere and eclectic food. We had the cabbage salad, deviled e","useful":0,"cool":0},"b7OhUygPtFx6TBT4lNn2cg":{"text":"Goooooodaaamn!!! This place was CRAZY GOOD. With a limited menu, my friends and I went IN.","useful":0,"cool":0},"awiolLR3lYVnI8Vp6pCHlw":{"text":"While I'd heard amazing things from my meat-loving friends, I was a little worried about g","useful":0,"cool":0},"QCBapddZU7CrayPN3FpDLQ":{"text":"It lives up to the hype... Do I really need to say more? I had the fried bologna sandwich ","useful":0,"cool":0},"__0sC-TCM1YD7xOnodsgvQ":{"text":"So my husband has been completely obsessed with this place on instagram for about a year. ","useful":0,"cool":0},"XEmG15xjnog7PZs4yDdyqw":{"text":"Veggie Rueben will change your life. Fried bologna close second. One of my favorite NOLA m","useful":0,"cool":0},"vWAYrEgwKOGzr5BDhCCiVg":{"text":"Fantastic spot for lunch. Sandwiches were great cocktails too. Luckily we were there with ","useful":0,"cool":0},"MFU1o7xMl1qhMsV2vgpduw":{"text":"Phenomenal food.  We had the fried bologna and the collard green and Swiss - both were out","useful":0,"cool":0},"l7cbw93Nb6nt9gHr0WqwtA":{"text":"Great place and worth the hype. I had to go with the fried bologna, that is what put them ","useful":0,"cool":0},"2CVPGgncDBZHXimpvn5Adw":{"text":"Ate here on vacation- I'm not vegan on vacation btw. My friend and I ordered the collard g","useful":0,"cool":0},"omJPkr4ZHw6X-0997UQytA":{"text":"this place is super delicious, but they don't sell turkey meat or wolf meat, which makes t","useful":0,"cool":0},"BnkPwp9AOMprHrpcURLE0Q":{"text":"Just ate here for the first time since place changed.  Eclectic pseudo-Cajun  menu, very y","useful":0,"cool":0},"DwJyfHINTwIU3qUuDxE7CA":{"text":"Sorry, I can't imagine what all the hype is about. For me, it's one and done. My Uber driv","useful":1,"cool":1},"3yRqVPoRvHHK20_WlNwirQ":{"text":"I am not a fan of deviled eggs, however my wife believes they are the best thing going in ","useful":0,"cool":0},"vOZbXFHCjbzswBso-gPMJA":{"text":"It's Interesting. I give it 3.5 STARS\nIt's a small menu, maybe 8-10 food items and a coupl","useful":0,"cool":0},"e8C-3hZDBgzVXvEpgOyM8g":{"text":"Get the bologna sandwich. While I do think they could add a couple more slices of bologna ","useful":0,"cool":0},"eiddck7ckaF4C-PiGH1M9Q":{"text":"The chicken fried steak sandwich is honestly one of the best sandwiches I've ever had in m","useful":0,"cool":0},"nycd_J6JBINhHeCIB2DmhQ":{"text":"Tried the ham sandwich, bologna sandwich, and deviled eggs. Kind of pricey for a casual lu","useful":0,"cool":0},"-W8cCJLK8dowWL64S1eSiA":{"text":"Literally some of the best food and coolest staff! I'm from Texas and I send everyone I kn","useful":1,"cool":1},"giVnGMqEZDlVFMbvNAQdlA":{"text":"This food is something else. Creative yet simple. Collard green melt is a must have- the f","useful":0,"cool":0},"BlveOlHSep8nDJLfnteHFA":{"text":"Super great joint... however my sandwich (collard green melt) was so greasy that I couldn'","useful":0,"cool":0},"Hmkb4LCI5aG8ffE-3VhlZw":{"text":"The sandwich shop for the foodie who wants to leave the French Quarter, walk into a spot b","useful":0,"cool":0},"2997yDS0_DquyQlrJg19gA":{"text":"Decent food and unique atmosphere, but way too pricey.  It's like $13 for a sandwich I cou","useful":1,"cool":0},"4SkCnIcI-QIo4MzTlwMUHA":{"text":"Definitely worth the hype!  I had the collard green melt, wife had cabbage salad, kids had","useful":2,"cool":2},"D1qYIbcs_OVk-akAtHAVGw":{"text":"Probably the most amazing bologna sandwich you've ever had and the last you'll ever need.\n","useful":0,"cool":0},"koiayS2eUz1aaCQZ3WK8ug":{"text":"Thoroughly enjoyed the collard greens melt.  Everyone I had lunch with today raved about t","useful":0,"cool":0},"KJK_2KDLf2ixucSdb-vqaw":{"text":"This is by far one of my most favorite restaurants in New Orleans.   The sandwiches are so","useful":1,"cool":0},"sMFuXHpY7XH7arKVR-k8xQ":{"text":"It's a weird name, it's quirky food.  They serve on mis-matched plastic plates and first g","useful":0,"cool":0},"8GyG2e_ZyVfsrMMB7Wm-2A":{"text":"I also came here after I saw the show Someone feed Phil on Netflix. When we arrived there ","useful":0,"cool":0},"J_sGWCkayygSwjMVQjURig":{"text":"We came in December with a few friends who wanted to try this place out. We got a salad, t","useful":1,"cool":0},"vgIP6eMerRWf9IZq-Zt7wA":{"text":"Wow! Came here on the recommendation of my nephew and discovered a gem.  Our 2 1/2 hour dr","useful":2,"cool":2},"vSsI7IBz51vF3b17kxbh5w":{"text":"Absolutely amazing!!! Here from LA on vacation and was referred here by a friend. Everythi","useful":0,"cool":0},"dsy8R-1hpzyAjNsp7sS7Xw":{"text":"Oh man, oh man! That vegetarian sandwich with greens is possibly the best sandwich in New ","useful":0,"cool":0},"Ep3qlLlPm-j3yUkVgf550Q":{"text":"Small, quaint place. You're going to walk in and order at the bar and then it's open game ","useful":0,"cool":0},"ywZrepccQb-QnRTJ7UgyRQ":{"text":"Loved the atmosphere! Very unique and fun! Food was plentiful and delicious. Nice to have ","useful":0,"cool":0},"p93P4mwmQV7PBQ1fKVQjRg":{"text":"Only one thing that I didn't like at this restaurant was that they didn't let me choose an","useful":0,"cool":0},"tR7ep15E1iDlhPoMN1fGew":{"text":"Thank you, Bon Apetit, for introducing me to the amazingness that is the collard green mel","useful":3,"cool":2},"-d0bNc9GgWiRz5TxFfV9Gw":{"text":"I had lunch here. We ordered the collard green melt, the wedge salad and the lamb roti. Al","useful":2,"cool":0},"VBUkHMq8EoTnBv2VRJBwng":{"text":"Totally delicious, great service, loved the chicken fried steak and sweet potato sandwiche","useful":1,"cool":1},"2-JHnD0Rwu9fAlFzvAIGvQ":{"text":"Very disappointed in our visit today.\nWe were there for the first time the day of the cnbc","useful":3,"cool":0},"2Rzn4i0SaA0EGqnAx5eu_w":{"text":"Stopped in for lunch today and I see why Bon Appetite voted this joint #1 Best New Restaur","useful":0,"cool":0},"xlcW5ruHMIdd8058fMyKTw":{"text":"A bit of a wait, but understandable as the restaurant is so well known at this point. We h","useful":0,"cool":0},"NYJ9lW9sfB8L81K9DblgwA":{"text":"My review is solely based on the food my friend brought back for take away. I ordered the ","useful":1,"cool":1},"vLl8p96_HjkAdAEIdHGKKw":{"text":"For a sandwich place the options are delicious and just mouth watering!!! Their drinks are","useful":0,"cool":0},"l_QMEBAyJO_nGvBUWw-oNg":{"text":"Everything was absolutely delicious. Every sandwich and the salad was huge and complex in ","useful":0,"cool":0},"15rAw4cKz0qsBLKRxNbbng":{"text":"This place is AWESOME! I'm so glad I found out about it from a bon appetit magazine. It's ","useful":2,"cool":0},"yqQR01IY_f8Pd1hWQ4K01w":{"text":"I found this restaurant the same way I find all my restaurants to eat, Yelp. I was pleasan","useful":0,"cool":0},"NT6I0kHY0YgTiHLFasUxDA":{"text":"Y'all. This is the spot. The simplicity of the dishes is challenged by the complexity of t","useful":1,"cool":0},"stoJc80QGT3g1Ml4o37kaQ":{"text":"Sweet Jesus, I didn't know a wedge salad could take me to another dimension. But it was ex","useful":0,"cool":0},"HQco7YUl3z48I-K55u2SSQ":{"text":"Just incredible food. The Collard green melt is one of the best sandwiches I've ever eaten","useful":0,"cool":0},"F2A-oFRAxpHWCcgoK9wFyQ":{"text":"I can't wait to come back and try everything and new things on the menu. Staff was delight","useful":1,"cool":1},"K-AjBBQvh7MHNZ2sG0gCtw":{"text":"What the heck just happened in my mouth?!?!?!?! This off the beaten path restaurant is wor","useful":0,"cool":0},"4uoFy2mWRZj8kj6OGxjnKg":{"text":"Been wanting to stop by this place since they opened. All I have to say is \"Fuck yes\". Fro","useful":1,"cool":1},"k7t60_hs6vTOVvlTlLixVQ":{"text":"Turkey and Wolf is decent. There is nothing special about this place, I find it very hard ","useful":0,"cool":0},"luwmp2CZgqDzShRUrOdSMw":{"text":"I could eat here every single day. Flavors and textures for miles. In every bite. I am in ","useful":0,"cool":0},"EH_thzA-8WsI0WtmbPsvIA":{"text":"\"Y'all think you real fancy.\" That's what my neighbor says to her kids when they are putti","useful":17,"cool":8},"OLkIZF0yyy3yoy8NexOe4Q":{"text":"Probably one of my favorite hole in the wall type restaurants. The food is oddly delicious","useful":0,"cool":0},"qCrAjX5TP9vXrJ0U5rIgtw":{"text":"Amazing sandwiches that combine ordinary ingredients into extraordinary food sensations.  ","useful":0,"cool":0},"_3UdrypK9MW4v7b-t2Z9eg":{"text":"Fantastic restaurant, I haven't had a bad meal there.\n\nI am always willing to support a bu","useful":0,"cool":0},"l4S1fc6BoQb7DF_CgXjPnw":{"text":"Not big on sandwiches in general BUT I crave the sandwiches from here.  It is a bit pricey","useful":0,"cool":0},"yTBHOt6pZWrtBQhArsSK5Q":{"text":"So !!!!!!! This place deserves way more than five stars! It rocks! We got the collard gree","useful":0,"cool":0},"ksChgvbEzRMlRTEGnFszdA":{"text":"Let's see where to start,  totally hipster heaven dive joint!  An they have all the cups a","useful":0,"cool":0},"S_PTd1ChiU2_3y9mGqYMYg":{"text":"I was a little let down by the number of menu options, but the fried bologna sandwich made","useful":3,"cool":0},"R26-pGD9g30fAOdk5Lx1Aw":{"text":"On visiting a friend on Wednesday he suggested Turkey and the Wolf, he lives nearby said i","useful":0,"cool":0},"ALEH2xsfXN44MUmDJF_LUw":{"text":"The food was amazing! Definitely add fried pot pie to your order, you won't regret it! I a","useful":0,"cool":0},"loDpeA9FVJEGAO5fCHPXrg":{"text":"My boyfriend and I was watching this Netflix show called \"Somebody Feed Phil.\" We wanted t","useful":2,"cool":4},"xsGEtOAPy3hcCutLN--JXA":{"text":"Turkey and the Wolf was the coolest little place! Came here for lunch the other day - I or","useful":0,"cool":0},"8yPBmGkDVBuwHIQvYuqqog":{"text":"Holy shit, the collard green melt is seriously one of the best sandwiches I've ever had. T","useful":0,"cool":0},"iRDmxqlG6LGGwIg_Khei7g":{"text":"The chefs are creative genius's! Trail Blazing culinary that doesn't get any better! It do","useful":0,"cool":0},"BMZzU1iEqf86BAS2QjSvWA":{"text":"So good I can't wait to come back to New Orleans to come here again.  It's the kind of pla","useful":0,"cool":0},"IIqz0V9rQ_v5V1qI0v6OVg":{"text":"This place is a foodie haven and every bite was better than the last. A true ode to Americ","useful":0,"cool":0},"gI1kV5NjztxMO6dOB2c6bw":{"text":"Don't get the Italian American it's the smallest sandwich I have ever seen for the most ri","useful":1,"cool":0},"OPHWKhsxJeFSlusrRD-5cA":{"text":"This was my first time here. The Lamb Neck Sandwich was very flavorful. The ingredients we","useful":0,"cool":0},"V5fztSqXs4tZXQuARcVBIg":{"text":"Don't believe the hype!!\nHighly Over rated. Should have stuck with my 1st mind. Can't go w","useful":5,"cool":1},"ChiF8cW496xTtZPDIPUzbg":{"text":"This is my new favorite spot. I brought my parents here as their first taste of new Orlean","useful":0,"cool":0},"7LYv4H7uGy5K2N3fIFd33Q":{"text":"This place is so charming and unique, the food was absolutely delicious and the staff was ","useful":0,"cool":0},"0LEioBeU-ZkjmMgYYE9EjA":{"text":"My favorite.  Expect a line but they move it along and the staff is really friendly. Custo","useful":0,"cool":0},"V1KxrGqLQQBpImc81CzVGA":{"text":"Interesting sandwiches served in a small busy, noisy restaurant where you order at the cou","useful":2,"cool":1},"Kya6DROMvW0oa_A9hYG9lw":{"text":"So I went to Turkey and the WOLF for  well first of all cool name and lunch , I'm in! I or","useful":1,"cool":0},"yoQDpusEyhjRJb22nLubfQ":{"text":"It was really good. Devils eggs is just regular tho, I got the lamb neck and that was deli","useful":0,"cool":0},"ioiTxEqktj8oMHJplfJ-pQ":{"text":"T and the W is brightly lit and lacking the grit of other Big Easy lunch spots. These hipp","useful":3,"cool":3},"scTtGI68UAKRHa652Bz3WA":{"text":"First let me start by saying when visiting NO this place is a must. \nPlace feels like you'","useful":0,"cool":0},"IWLhluFoiLGe2wx3Td5ETA":{"text":"This place is the bomb. Really amazing, innovative comfort food at affordable prices. The ","useful":0,"cool":0},"46R4WyjjEepwybnkw3bxpw":{"text":"The service is great, the workers are awesome but I it just didn't taste good to me. First","useful":0,"cool":0},"GPAvfkoCjLIQ1mX7pJcvfQ":{"text":"Fun and odd sandwich\" at the same time. Small little place tucked into a neighborhood migh","useful":0,"cool":0},"s9E3N3FrW8Y3dLwA4R0z-Q":{"text":"I had a fantastic experience at Turkey and the Wolf last night, the second time we have ea","useful":0,"cool":0},"quHrcKOnVB3_qFTDUAHScw":{"text":"Great food. Quite original. Lines can long and seating limited. I had the collard greens m","useful":0,"cool":0},"2hcFSy1Oga3aXYwEaIZDmQ":{"text":"Food is really good, but place is packed and expensive. More than $10 for a sandwich is cr","useful":1,"cool":0},"QR1OSTZ-ga8goQ3QxkuApw":{"text":"Great for lunch  all four of us ordered something different from the menu so I wanted a li","useful":0,"cool":0},"MyjSMNUdubienv9lNBa1ug":{"text":"I tried the Fried Bologna sandwich.  The lettuce is basically shredded from a bag, the bol","useful":3,"cool":0},"VLDfh6X0B98AsV88PUlIOA":{"text":"This place did not disappoint.  We tried the deviled eggs, meat pie, collard green melt an","useful":0,"cool":0},"_B4Mi-f48B42O7a-103gYw":{"text":"I learned about Turkey and the Wolf from watching a food documentary on Netflix called, \"S","useful":0,"cool":0},"I-FtQqCBg7KJn4FpRgY65A":{"text":"We both agreed: one of the very best sandwiches we have ever eaten: slow-cooked collard gr","useful":1,"cool":3},"hEuAwR_nJhTluKebsQTqqw":{"text":"The hype is real! Came at a friend's recommendation as Bon Appetit listed this as the best","useful":1,"cool":1},"tGAzo6a2OmaS8rO5RkKClQ":{"text":"A few people recommended this place to us during our stay in New Orleans.  The great revie","useful":1,"cool":0},"osAoPSlIujy9qREpgk95IQ":{"text":"Mind blown. My mind is officially blown. This was the best restaurant in New Orleans. I go","useful":0,"cool":0},"FbUw_uuQBDQe6lEh96HYgw":{"text":"Let's be honest, guys, what I'm about to say isn't going to be anything new. ;-) This plac","useful":1,"cool":1},"JXpeIpwumdZuoOTM0gzWLg":{"text":"I don't think anyone can really complain about this place? Getting a table is a pain, but ","useful":0,"cool":1},"d5V49Ycz-SNAtgbXNyY5sQ":{"text":"I love this place and they love me too. Delicious. See the food. Smell the food. Eat the f","useful":0,"cool":0},"H4W9t83cBQrhCbH30jQnlg":{"text":"They take pride in their sandwich here. Had the ham sandwich served with greens an herb ma","useful":2,"cool":2},"pzVGWELD-vNaDutDmHds9g":{"text":"I like it; I don't love. The sandwiches are GREAT. The experience leaves a bit to be desir","useful":1,"cool":0},"4DGHGv5YdrwU1ouTKfQCXw":{"text":"Everything on this menu is decadent. Don't think that by getting a salad you're missing ou","useful":1,"cool":0},"PYv8kkflBVNdSiR6Y3le3w":{"text":"New Orleans is not exactly a city of salads and clean eating, and this place is no excepti","useful":0,"cool":0},"4AD4ynPkXOyLlW4hxCwqRw":{"text":"Very impressive pork and pepper. A bit Asian fusion vibe. The taste of the pork and pepper","useful":0,"cool":0},"ZAz8KdcvGitZlGQX62ZLbA":{"text":"Outstanding. I had the bologna sandwich, and chicken skin deviled eggs. As you would expec","useful":0,"cool":0},"v_DpDl0AhzwWBfL5YC9U8Q":{"text":"Both of my visits here have been tasty and satisfying! I came on a slow evening for dinner","useful":8,"cool":6},"6L8d31NqJpoiezQZRx-ADQ":{"text":"When a menu only has 6 sandwiches listed there is probably a reason why.. because they're ","useful":0,"cool":0},"d50rB7cXU-esvW9Nnn5ylw":{"text":"Best sandwich in City? The world? Dont think so at all. Ham n swiss...too small, not enoug","useful":0,"cool":0},"gIYBXw84OFaUCFUFFmd5wg":{"text":"If you look at all the other reviews,  -  DITTO!\n\nI recommend this place to all the friend","useful":0,"cool":0},"D1OiNQJolIUNSy1wCUyrkg":{"text":"This spot has absolutely amazing food. I tried the fried chicken pot pie which has oodles ","useful":0,"cool":0},"ghXTWEJrrBNmySoDK32NTw":{"text":"Never been, just follow on social media and I'm obsessed. You could have trash sandwiches ","useful":0,"cool":0},"xtv49naRFPNP-xFk9jrChg":{"text":"Retro plates and cups and a modern diner feel. I got the wedge salad and shared the fried ","useful":0,"cool":0},"wbZRcQbT6xwWgeIkIyslOw":{"text":"This is a very cool eclectic spot with a hipster diner vibe. The menu is limited to just a","useful":0,"cool":0},"pkx4jv9alM7DsMtlfbnUJA":{"text":"I definitely recommend taking the time to Uber/Lyft or take the cable car out here. A lot ","useful":11,"cool":8},"Rdh5PyGXQpZEIrfSoQ3YHw":{"text":"I will die happy now. \n\nThis is former far kid paradise. Bologna sandwich w cheese, Texas ","useful":2,"cool":2},"nOdANbP4GxKenoe_8oMX5Q":{"text":"Amazing food! The fried chicken pot pie was one of the most delicious things we ever tried","useful":0,"cool":0},"hutNiKlCu7vmSbSAA_O1uw":{"text":"4.25 stars.  Turkey and the Wolf has received a good deal of positive press from locals in","useful":5,"cool":3},"K3ZnTE-mB7KRK7SCC4Nx0Q":{"text":"This was not our intended location for lunch today but due to the St. Patrick's Day parade","useful":0,"cool":0},"6V9KI08Fhy9jB08cmgUt6w":{"text":"Always looking for creative handmade food ! CONGRATULATIONS.  You hit it out of the park. ","useful":0,"cool":0},"dZ0HMGWJLmSrzDwIXv_vPQ":{"text":"This spot came recommended to me by the tourism board and I am so glad that I made the tre","useful":0,"cool":0},"fdCyWwGZmPd3DakATqm23A":{"text":"It's no Paneras but it's still pretty ok. Only gave 4 stars because they don't offer the p","useful":0,"cool":0},"FwI24CXUWTmlkcEZ2ApS7Q":{"text":"Google \"Turkey and the Wolf\" then click the bon appétit story. They said it better than I ","useful":0,"cool":0},"dYG3DpLa3_2o-AEKYpsTdA":{"text":"Great. Fantastic. Can't say enough good stuff about this little place! Fried chicken pot p","useful":0,"cool":0},"fAevtKQO9q49Gkh1wVCRmw":{"text":"Over priced hipster place that tourists love. The taco was a joke. A smidgen of meat and l","useful":2,"cool":0},"XwhM0uCy3lz2nVoMD7L2pA":{"text":"Named best dish by Bob Appetite magazine and now we know why. We loved both the fried bolo","useful":2,"cool":1},"3XhvuEgl7vNG2gHXPq-K6A":{"text":"Very creative menu. Extremely casual & hipster crew. Place order at the counter & service ","useful":1,"cool":0},"dG5L9BNNmpY6-ebsnMNABQ":{"text":"I learned about Turkey and the Wolf from watching a food documentary on Netflix called, \"S","useful":0,"cool":0},"bYixyqyaINQmYth2jfcxzg":{"text":"This was a dive, but superb food!! Line looked long, but moved fast. The menu is short, bu","useful":0,"cool":0},"Duj9HdQ1A9SwANzRmxA0Cg":{"text":"The Yelp General stopped into Turkey and the wolf because he's a huge UVA fan, wahoowah.\n\n","useful":1,"cool":0},"xZM3wAPqi-MFw6rGDzMFsQ":{"text":"I am never disappointed when I go here. I am notorious for always ordering the same thing ","useful":0,"cool":0},"pRaTQJ8zyN6o0VuYbAhhAw":{"text":"Excellent lunch spot. We had the bologna sandwich, the collard green melt and the cabbage ","useful":0,"cool":0},"C-fnrYppNO5cMEiXWfQo9Q":{"text":"What we ordered: Deviled eggs, meatloaf sandwich, and the wedge salad. I'd go back just to","useful":0,"cool":0},"eDtmIZ6p5yW-_5p4qD_WzA":{"text":"This corner shack between Magazine Street and Tchoupitoulas has an indie vibe with the bes","useful":0,"cool":0},"XlJvgl-W9eJYNSSFSnFy7A":{"text":"@turkeyandthewolf is a delicious sandwich spot located Uptown, a few blocks right off Maga","useful":0,"cool":0},"OriDcyGCppATJXnMGivLKA":{"text":"Tried the lamb roti and was really impressed. It had a great balance of flavor and the lam","useful":1,"cool":1},"G79cf5jcXpwHzpUnkiWAyA":{"text":"The wedge salad was a bit or miss. The wedge wasn't rinsed it felt like I was eating strai","useful":0,"cool":0},"HV8jx_x5T0cJkp22b1z-xQ":{"text":"Food is absolutely phenomenal!!\n\nQuiet, quirky, pseudo-dive a few blocks off Magazine Stre","useful":0,"cool":0},"bEJlvXsC1Uqlsg9JUNahaA":{"text":"Food: 4/5. Service: 5/5. Fried pot pie; pork & peppers; deviled eggs.","useful":0,"cool":0},"HQAddCa5gP7Z4TrSUY1NRw":{"text":"My Uncle took me here while visiting him from Illinois. Upon first impression it seemed li","useful":0,"cool":0},"2dyshfp7TU4mqKDpXYbJjg":{"text":"I read the hype and then agreed with the hype. Got dropped off here on a Monday as soon as","useful":0,"cool":0},"hWa9k5jbYs8hQaRKTRvgQA":{"text":"Simply put, the best sandwich I've ever had. It's definitely funky and out of the way, but","useful":0,"cool":0},"C_8kjzqKg7lTMunr9W4KmQ":{"text":"A friend recommended this place while I was visiting NoLa, and I am so glad I went out of ","useful":0,"cool":0},"2Vwe9q-qzqcLVBgF6oyBww":{"text":"Date: 3-17-18\nTime: 1245\n\nBrief: Best food I had in the cresent city at a decent price and","useful":2,"cool":1},"mJ7xy6844M3S1Pg-9CoLAg":{"text":"The food is life changing.  EVERYTHING is deliciously rich.  Please open a sister restaura","useful":0,"cool":0},"nUT9PNveS_XUPVKxjrVpTQ":{"text":"Imagine a small restaurant where they stole all of your grandmothers Tupperware cups, all ","useful":0,"cool":1},"2g8fY9NZPeUY-5iemboiDg":{"text":"Showed up about 5 minutes before opening on a Saturday morning. A line of about 10 people ","useful":0,"cool":0},"_vnXlQLcynnzg1jYvFNy3Q":{"text":"This was our second trip to Turkey and the Wolf. This is absolute heaven! We love the frie","useful":0,"cool":0},"mYv5h3OtEpne1uEbAQhKpQ":{"text":"So fun!  Great zany decor. Front order service was efficient but spot on welcoming. Really","useful":2,"cool":1},"fyrU_ARv5FYXn1gXc-iyrA":{"text":"Thought the all the hype would lead to inevitable disappointment but was wrong. Wow. Loved","useful":0,"cool":0},"hR0MGvhnQlAYPmwpRbf59A":{"text":"So. Freaking. Good. We got the deviled eggs, fried chicken pot pie and a bologna sandwich ","useful":0,"cool":0},"s5ukuTxP5h8Q5qZuCJ2lVg":{"text":"You are doing yourself a disservice if you come to New Orleans & do not try the bologna sa","useful":2,"cool":1},"PEp2FX2GY6Mpm3EeLK4jqQ":{"text":"I had the pasta special and the chicken fried steak sandwich. Both plates were rich, heart","useful":1,"cool":0},"FXbINdKV_LOt_uTTebXwOQ":{"text":"Two friends and I were in NOLA for a girls getaway.  We had just finished the Garden Distr","useful":0,"cool":1},"UdHraUR6Qt2Hm4mVD4TV8g":{"text":"Love this place to death, but updating my review from 5 to 4 stars because I just really d","useful":1,"cool":0},"Vn_qwUMvyGurpcPO3BdqxQ":{"text":"High quality food and great service! We'll be back! Deviled eggs with chicken skin were re","useful":0,"cool":0},"SOKNS85njfI1xFhT4kF_sA":{"text":"Good sandwiches, but the best new resto in the country? Don't think so. Would come again f","useful":0,"cool":0},"3iO2wbCgsAmlQltuRQcwgw":{"text":"One of the Best lunchtime treats I have had in New Orleans. The sandwiches are innovative ","useful":0,"cool":0},"xwg2wBGhSnw4Ha99Ru0o5A":{"text":"Very unique menu. My sandwich was amazing. Friendly stay and they have outside seating","useful":1,"cool":1},"A-i2BUNvGqMd7W2IkP8XWA":{"text":"Wonderful! Fun! Tasty! Not sure what you look for in a sandwich shop but I'm totally and c","useful":1,"cool":1},"hezjc-8x9m164PB1cQ6osw":{"text":"never eaten there but one time I sent them a Bologna and they put it on their Instagrams s","useful":0,"cool":0},"ytZx_dvn4VLsS2gpm7eIhA":{"text":"Everything I hoped it would be\n...met fellow Yelper Katie , along with my Pirate for a qui","useful":7,"cool":6},"hVA5Fj4dHhpOSL86pAyL7g":{"text":"Really wanted to love this place as I heard amazing things and came from California. I fee","useful":0,"cool":0},"1z_nhv8eZF_HqQml9LFi2g":{"text":"We pretty much never give 5-star Yelp reviews. Unlike millennials, who dole out fives like","useful":0,"cool":0},"kbKCSt2-0XUjEus5Ncw3YA":{"text":"I didn't see what the hype is all about. They should change the name of the wedge salad to","useful":0,"cool":0},"L813Z1ZLIdXBBeIEr0_opQ":{"text":"Turkey and the Wolf is a great place to stop for lunch. I've been a couple of times midday","useful":1,"cool":0},"7dsR781zkn58JU3-IA8jqw":{"text":"I'm sooooo elated I finally got to try this place, and I will be back! I saw this place ov","useful":0,"cool":0},"6K_UWpsr4AwbIBq3ZaD55Q":{"text":"Got there at 1:20pm--perfect timing! Got a parking spot in their lot and virtually no line","useful":1,"cool":0},"VEoge6hd2pMvdZ3PNSnZSQ":{"text":"Surprised this place has such high reviews, American Italian sandwich is pretty bad and co","useful":0,"cool":0},"V3jJ_ehRW52JqTNUgZRDnQ":{"text":"Glad to see great fare in bustling neighborhoods. I stopped with coworkers before heading ","useful":0,"cool":0},"EUXSBm5r8088BKtnyw2dZQ":{"text":"This was recommended to me by a hip Local.  The name intrigued me!!!  I was shocked at how","useful":0,"cool":0},"zERt-B0DNFknInImivrMjw":{"text":"Taking Comfort food to a WHOLEE NOTTTA LEVEL!\n\nYes, it is ALL the hype. They are only open","useful":4,"cool":4},"w71wMcIVqEDTdNM1vTmUag":{"text":"Guys, this an easy review! LOVE everything about it from the friendly smiling faces to uni","useful":5,"cool":1},"tHJ2w7lggtJivW_eFGyyyg":{"text":"This place is amazing! Love the eclectic vibes and cute touches! The food is incredible! H","useful":0,"cool":0},"lhS4YZ9H2_wpmyV7kL5avA":{"text":"The only thing that matters is the collard green melt. I thought it would be all hype- but","useful":4,"cool":2},"1sotBBduJzT-6H65UwCrAg":{"text":"We went for a quick lunch on a Sunday. The service was great and the food came out quick! ","useful":0,"cool":0},"LnPXdVO5XM-3sWQWXRXtfg":{"text":"A friend told me about this place.  We got there just before they opened and were able to ","useful":0,"cool":1},"lapbCI3S6tYe4x-xc60BrQ":{"text":"tl;dr Hipster's food paradise. Ready for an orgasm in your mouth? Order the fried bologna ","useful":10,"cool":11},"ZnwO1_u5yElJNCVBNBM3oA":{"text":"Words cannot express how good the collard greens sandwich is - go there and try it for you","useful":1,"cool":1},"eR6TOE0LTCqaV4hnlogChw":{"text":"Food was amazing. Tried several dishes. The collard melt and the wedge were my favorites. ","useful":0,"cool":0},"fYfBtjlJGUvqYIlGkcUMWg":{"text":"Great space, great food and great service. The ham sandwich and deviled eggs are outstandi","useful":0,"cool":0},"mwp51JPKHjaxUGgIdj08Vg":{"text":"Have you ever eaten something so delicious, so perfect in every way, that you felt overwhe","useful":0,"cool":0},"JZQ2Mbn2mlMQvqhZft-LRQ":{"text":"This review is only for the food since I had this via Postmates. \n\nIn town for a friend's ","useful":1,"cool":0},"CaVAGfxncvM_1s4X76y-gA":{"text":"This place is a super fun, hip, lunch spot a little removed from downtown NOLA. I would HI","useful":0,"cool":0},"h8sNzgCX0DF_E_1JWTThgg":{"text":"Food was great! Michael our bartender was very friendly and knowledgeable. I highly recomm","useful":0,"cool":0},"Qne13uFSPPJgAzPaD5udVQ":{"text":"This place had a good vibe and the food was delicious. The ordering system and seating was","useful":0,"cool":0},"-6MSvn3g4r7hYbDjrcg7ww":{"text":"My friend and I came here on the advice of both a professional chef (his friend), as well ","useful":4,"cool":6},"c73-XauZIn02yYIbsXmtvA":{"text":"Lots of hype, almost too much hype.  We had the Collard Green melt, the deviled eggs, and ","useful":0,"cool":0},"XBzMG-Bvq29W-Y4S8ePQPw":{"text":"Great place for unique foods. I had the lamb and it was amazing. Wish they had a few more ","useful":0,"cool":0},"lcabICJ67iU6zqaFYKp22Q":{"text":"This is such a fun, quirky place for a quick lunch. Street parking only, line goes out the","useful":2,"cool":0},"PKj7kEjSbcQe2k1IkTvAog":{"text":"Turkey and the Wolf is the best lunch spot in NOLA. It has received a lot of national reco","useful":1,"cool":1},"0hXObD78_ld8mAFpvULTkw":{"text":"What a treat! Brought me back to childhood favorites! The service is great even during bus","useful":0,"cool":0},"9vd5PJrPacKj-S4fe38e0Q":{"text":"Really good sandwich spot. I liked the cheese and apple sandwich and then the veggie waffl","useful":0,"cool":0},"uNte9n3ZopzUSzq7bGBbDw":{"text":"What an amazing spot!!  Definitely glad we sought this one out, everything our group got w","useful":2,"cool":0},"D7mCzevIc0eDuNxKjOkwGQ":{"text":"I'm, YUM. Creative eclectic food if your not trying to watch your calories. Casual atmosph","useful":1,"cool":0},"l415F6xKxTNdCHvd0IV2Lw":{"text":"Get the Collard Green Melt! Love the space, decor  and cocktails are quirky and STRONG! We","useful":0,"cool":0},"GAiFyUsnDbfvQG0vnY6oNg":{"text":"As good as any sandwich place I've been to in NY. Pretty much everything I had was delecta","useful":4,"cool":1},"Px2y-ucn3F7LM9Y1Clpiog":{"text":"Very tasty, but this place has a big problem with over-saucing/dressing everything.\n\nHam a","useful":0,"cool":0},"f9RFwiV9M3x-7zEfxQyroA":{"text":"Friends, the hype about this place is real. Yes, the menu is small (indecisive people rejo","useful":2,"cool":1},"7xI61rkUE5yTQzgJN6dpcg":{"text":"I saw this place on the Netflix show \"Somebody Feed Phil\" and on various articles mentioni","useful":7,"cool":4},"LzR487A6TQPtwgkjynByKA":{"text":"I had chicken pot pie, it wasn't the best thing i've ever had, but it was good enough for ","useful":0,"cool":0},"cHc18fOD2HU5a3hdR3U_qg":{"text":"No me gusto el trato. Fui en el horario del Happy Hour y no me quisieron vender los devils","useful":0,"cool":0},"iDgyvMWGCF1spjW2L3zzsQ":{"text":"Great place, super talented chef in charge as well. Full bar with specialty cocktails. The","useful":0,"cool":0},"usteyMcSWI-U0ko9unXBfg":{"text":"This place is off the chain!! Been here twice in the past week. Tacos- amazing. Salads- ki","useful":0,"cool":0},"XDRetL-aHz7sFneRCxNloQ":{"text":"It's very rare that I go into a restaurant that is hyped and I still get WOW'd from the fo","useful":0,"cool":1},"fb_9B9b3mNPDtIK4qdh06g":{"text":"This place is average at best. Everyone I know locally has the same comment \"it was ok\". A","useful":2,"cool":0},"egDIB-SwqQyPKOxiDiB25A":{"text":"Wanted something different and noteworthy for new visitors to New Orleans. Great little pl","useful":0,"cool":0},"jNNVv05LSXgzrU0_wX_Byw":{"text":"I thought this place was good & very unique. A fun vibe, decorations and menu (although pr","useful":0,"cool":0},"_fZeDA3U0Yk4fFwPMmbSLg":{"text":"I am not a huge Sandwhich person, but this was in my top five ever eaten. The atmosphere w","useful":0,"cool":0},"JpMZ9QnUSKELJw4T5rWtuA":{"text":"This was around the corner from our Airbnb and damn this was good right after a flight. I ","useful":0,"cool":0},"dGo3IutlsaAA_xm9Kh9fxg":{"text":"I got the collard green melt when I went there. I have to say, it was fantastic! You would","useful":0,"cool":0},"fN-9QOMfAH1XSTlb_Kz2Ow":{"text":"We came to this restaurant because my husband saw it on the Food Network. \n\nFirst, we wait","useful":0,"cool":0},"jvkIQCr6QGt_DDHshhZiCg":{"text":"Three words: collard green melt. After reading about this highly acclaimed sandwich, I fig","useful":0,"cool":0},"rWHvZKtDBCsaYcLVVjHuEg":{"text":"Hands down best restaurant in New Orleans. Every time I go I leave there full and happy. I","useful":0,"cool":0},"1Lx8saaKVRDYRBaYm8wqlA":{"text":"Finally made it here after long time of wanting to try that collard green melt and it was ","useful":0,"cool":1},"ewLQQNFgwq9oxRCbcSvTeQ":{"text":"Just ate two burgers, two fries, and a cheddar brat from Mama Tried's pop up event. Gedamm","useful":0,"cool":0},"CUs8JeMPEaUebux52vj-0g":{"text":"Still dreaming about that pork pepper sandwich... So good, I had to come back twice during","useful":0,"cool":0},"4LjQgB15ko4oKCPQ2yfFpw":{"text":"The collard green melt is one of the most memorable dishes I've ever had. I wish I could h","useful":1,"cool":1},"Qt-7uKsjb7RpPncGE6Zhbw":{"text":"On the advice of Bon Apetit and seconded by an extremely reliable colleague, I grabbed a r","useful":1,"cool":0},"g-h0S5dmpGvk9vA5hhU1hA":{"text":"This place is awesome! The collard green melt and the fried chicken pot pie were very good","useful":0,"cool":0},"f-u7wF9ECIr12No_XG3Fiw":{"text":"Sandwiches are always ON POINT. And I love how much fun the staff is having while you're t","useful":0,"cool":0},"u0GYkIJ46xFQN1C6fITKxA":{"text":"The deviled eggs are good, but for $2 a piece, they should be. The bologna and cheese has ","useful":6,"cool":1},"yzEouJAWmyrCGFPQPen6zQ":{"text":"Unbelievable flavors on everything we tried, Pork and Peppers, Collard Green melt, fried p","useful":1,"cool":1},"WGAaJx_4V7GymURpZWucJw":{"text":"I can't wait to come back and try everything and new things on the menu. Staff was delight","useful":1,"cool":0},"LC-VCKw_EYNCiulfH1lz2Q":{"text":"Got a delicious wedge salad and my friends ripped through a couple of orders of deviled eg","useful":0,"cool":0},"3ZguYSanyhv5hepknlffmQ":{"text":"Nothing fancy but so good. Collard green grilled cheese was the best. I wished I had order","useful":0,"cool":0},"wDszu5EXXzrmi4zTgU_3EA":{"text":"Really over priced limited sandwich joint.  I had the ham sandwich. Nothing special about ","useful":1,"cool":0},"os74Ik7De4B_xlo1btaGUA":{"text":"Swooped into NOLA for the weekend and stumbled upon this little gem while wandering throug","useful":1,"cool":0},"zaeb3bnRuLIaNTnMEMFpwQ":{"text":"A few more visits and I still love this place. Now it's a hot commodity, so hopefully you'","useful":1,"cool":0},"DqHhTMA3ItdPH7X5YnFeMQ":{"text":"At this point, I've had everything on the menu and nothing has disappointed. I get the dev","useful":0,"cool":0},"BH7dS75BIRLNbZwJas4Czg":{"text":"Grossly overrated. The \"best sandwich in America\" is very basic and can be ordered at just","useful":4,"cool":0},"QwVoqeQ72Qgd48kK35eLmA":{"text":"I've been following this place for a while and it's been exploding on social media and tel","useful":1,"cool":1},"9YjEdCG7gcUrsqKJyBOCdw":{"text":"Love all the hipster decor of this place. Had the chicken salad sandwich, bc had the lamb ","useful":0,"cool":0},"dpnqsmnjtqDVgmnKsKH7-A":{"text":"AMAZING!!!\n\nT&W was the best meal for me in New Orleans! We almost skipped here and  I am ","useful":6,"cool":6},"h0bsRL7mbWo0bzS5Wf1eHA":{"text":"Turkey and the Wolf was packed when I got there, so we took the sandwiches to go. Sandwich","useful":2,"cool":1},"eorAfcpm08ORxX1DDtV3cQ":{"text":"Imagine a small restaurant where they stole all of your grandmothers Tupperware cups, all ","useful":1,"cool":1},"0WqixbIgUq_tuk9uku8Dmw":{"text":"I really wanted to like this place and I hope it continues to succeed in spite of my less ","useful":2,"cool":0},"6TT42h4yUXHqWs_KzkeZjA":{"text":"Best sandwich I've ever had. And I've been here twice. Which means so far each time I go I","useful":0,"cool":0},"ZqTBbgEfnlWSvaKumRlBaw":{"text":"I stayed in a former firehouse and this sandwich shop was 2 blocks away. It was busy from ","useful":0,"cool":0},"gbGPyuyBY4n_u3-3Iwm-Hg":{"text":"I'd been hearing amazing things about Turkey and the Wolf for months and refused to leave ","useful":3,"cool":2},"5Vm6kf7e7XI_tA6MATuZYA":{"text":"Food was ok. Very greasy and not very \"green\". Not the best food first thing in the mornin","useful":0,"cool":0},"kCMLLneUecgVNyiBI6MHQA":{"text":"Fri 3 pm the place was a loud, crazy zoo.  Stand in line to order - then sit on under-size","useful":3,"cool":0},"Xr2jRlGEdunIR5SzDMa9IQ":{"text":"We did a take out run to try some of the food, and we were glad we did. Even at 2:00 pm th","useful":0,"cool":0},"GiYFF25pd3O5Y1QYC2xz7A":{"text":"Our Lyft driver recommended this place in garden district and so worth checking out! Loved","useful":0,"cool":0},"UskYf8FYE62p_nNggxV_XQ":{"text":"My new friend Mary and thanks Brendan sent me over to check our this sandwich shop. Feels ","useful":0,"cool":0},"rOXC_HsGqMO9flPoULRBFg":{"text":"my mom and i split the fried chicken pot pie and and the wedge salad, both were delicious!","useful":0,"cool":0},"gITIySOTLCyQyKDfNT-k7g":{"text":"Lived in NOLA for two years, and did my research before living in the big easy. Spent many","useful":0,"cool":1},"qpqim3pAD_iPDtmVmJE3ww":{"text":"Oh my. I did not want to like this place. I was wrong. I thought it was over hyped. I was ","useful":0,"cool":0},"VaI5wJ0MvQ691NJ7TKPrpg":{"text":"The combination of words known as \"collard green melt\" would normally make my butthole puc","useful":0,"cool":1},"XWJwptkffOB29I10rUP4TA":{"text":"A great sandwich spot in Nola. Best bologna sandwich in Nola and just an overall cozy a** ","useful":0,"cool":0},"TV07kJZvgOF2xjuipysvHg":{"text":"Collard Green Melt! Best sandwich on earth.\nI have to stop here every time I'm in Nola bec","useful":0,"cool":0},"h2vKCEN-HN1zbs2r9OczYg":{"text":"We tried the fried bologna, wedge salad, and the pork and peppers. It was all delicious bu","useful":0,"cool":0},"zqWsnUrgPn4VBLXscjCVnQ":{"text":"Was driving around trying to avoid the Saints' traffic downtown, and landed on them gem.  ","useful":3,"cool":2},"4JteclVJQCMLhXjg75vxAA":{"text":"We came here based on a local's referral but we were not impressed. The sandwiches were al","useful":1,"cool":0},"ps5Lab-pHaEQ3d-o5DkajQ":{"text":"Thus is simply the best sandwich shop in all of NOLA, with such great creations and flavor","useful":0,"cool":0},"Iqoi6ScxhIexPSVet1HFkQ":{"text":"I just said that NOLA is well known because of its amazing food scene. You can have creole","useful":3,"cool":3},"d8b5pGkdChJe-3MhvuJSKg":{"text":"This is a new favorite for me in New Orleans. My friends and I came here for lunch and spl","useful":0,"cool":1},"h2g-I23ne5-x5vFblsFJZQ":{"text":"thiswon national Rstaurant of the Year last year.  Very innovative.  You have never had th","useful":0,"cool":0},"SNV6K9FZdTMCnuQjr8xccQ":{"text":"This place is really cool. The staff is really friendly and funny. I had the fried bologna","useful":0,"cool":0},"JlXaoeWN5QgxoqrmqdORsA":{"text":"My husband and I came here for lunch while we were in NOLA for a long weekend. T&W was rec","useful":0,"cool":0},"nU73VH69PCLpV2cNUGrxew":{"text":"The fried bologna sandwich is not s sandwich, it's a freaking event!  Honey mustard adds a","useful":0,"cool":1},"z3SKY__DLapn0O3Alw6edQ":{"text":"Holy shit! I am from Oceanside California and usually when I travel to other places and ea","useful":0,"cool":0},"tt5geyl1vTT-OtwTWMyo5g":{"text":"Amazing food great staff love the fact of the vintage dinnerware the collard green grilled","useful":1,"cool":1},"JzoIyy6UrJ9dDD5NmPxg_g":{"text":"Been wanting to check this place out since i started following on Instagram about a year a","useful":0,"cool":0},"nbZ543MFU_ZLiDnob6gkaQ":{"text":"On this New Orleans trip I've dined at three fine dining dinner spots and Turkey and the W","useful":0,"cool":2},"QMZqEDamrtbNCkSb9BMlWg":{"text":"Thank you for helping me maintain my weight.. . I took a first date over here because I wa","useful":0,"cool":0},"qvIgVvCwOwZii0a2h5cTKA":{"text":"Turkey and the wolf has some of the best sandwiches around. I had the ham sandwich which w","useful":0,"cool":0},"SB60g8IWBFATgIScbz0C7w":{"text":"I've had Turkey and the Wolf on my bookmark list since Bon Appétit named them the best new","useful":5,"cool":5},"kwRvSCTUx4747voYPE36uQ":{"text":"I don't know who the Turkey or the Wolf is specifically, but I think together they make qu","useful":15,"cool":13},"cJa-_qTZYM0N2UbT7OexWQ":{"text":"Highly overrated awful white trash food shitty service no bathrooms why would anybody go h","useful":1,"cool":0},"_h2mner9SI7h3-VZzHTS8A":{"text":"If I could give this place no stars, I would. Customer service has to be the worst that I'","useful":4,"cool":0},"7E5M0yrBMUDPITxMkI3dYw":{"text":"Excellent lunch dive! We shared the wedge salad, ham sandwich and fried bologna sandwich. ","useful":0,"cool":0},"yFElepVoPeEwf8ue7c2CMA":{"text":"Cute space, creative menu! The sunflower and cabbage salad is the best salad you will ever","useful":0,"cool":0},"BQS5OHY76F5VHhLkGCmL7g":{"text":"So odd. They were all just too much. My daughter looooooooves these sandwiches. I like sof","useful":0,"cool":1},"mbtbGvWZVFUSSU4vefqJww":{"text":"We ordered the pork and peppers, collard green melt and the sweet potato sandwiches to go ","useful":3,"cool":1},"kqOTSkLVlWjPPAkNvflIuA":{"text":"I can see why this place is so popular!!!  Loved the vibe and especially the funky music p","useful":0,"cool":1},"WIEAvloZmVH1rhyQr2y7kg":{"text":"We stepped foot in NOLA and were starving, so we set out on foot near our rental and came ","useful":0,"cool":0},"gQp6aUyRXUZRY1yv0kBiXw":{"text":"It is a local place in a quite neighborhood. Good drinks and the food quality is very good","useful":0,"cool":0},"V0llbsMqUFGy6r4bK-oWiw":{"text":"THE COLLARD GREEN MELT *insert drool* so glad I order it haven't tried everything But I fe","useful":1,"cool":1},"TbQxQcWM1KUetRWapCf_Fg":{"text":"Everyone knows that this is amazing. If you left without trying the Cabbage Salad, I got b","useful":1,"cool":1},"kX7Junb1wN_4-M7mG9bAaA":{"text":"Was in town for a visit and super stoked to be back in my hometown. Had read about this pl","useful":0,"cool":0},"-07-Csvz7inz7HByHyE3jw":{"text":"I had the collard melt on a McDonald's Hercules plate; I think it was the muses one. It wa","useful":0,"cool":0},"LsiMdYF2q25YHixh30yVWQ":{"text":"Never before has a restaurant obliterated and exceeded my expectations so resoundingly, as","useful":34,"cool":27},"Qa2qE0c_H0769cte-eF_rA":{"text":"One word sums it up \"Amazing\" \nMust try the popular fried bologna sandwich and wedge salad","useful":0,"cool":1},"Rk2KUc_YTEeVbpRsZ7yVqA":{"text":"Food is great. Fried Bologna sandwich is the star. Fried peach pie was good as well. But d","useful":0,"cool":0},"GwS8psrwktLkbd8eVyF6Vg":{"text":"This an excellent place to eat food from New Orleans with a modern twist.  Their pork & pe","useful":1,"cool":1},"y00M9nJukRDBMU7PsQhP0g":{"text":"Our story begins last year ( August 2017 ) just after all the \"hype\" broke out about T & W","useful":8,"cool":6},"yDCBHVFKefhH0MOZ7Qw8aw":{"text":"Love this place. Favorites are the collard green melt (which tastes so much like a Reuben ","useful":0,"cool":0},"nDc1V7mQxzpe_CB0thMU6w":{"text":"The most unique and delicious tasty sandwiches in the city. \n\nTo know it, you must visit. ","useful":0,"cool":0},"vUDkR2aSSzN9SID9dzcmdA":{"text":"I originally heard of Turkey and the Wolf through Bon Appetit, since they named it the bes","useful":2,"cool":2},"7qvd0x4U05kVqBSBMTExrg":{"text":"I had heard a lot about this place but when I got there, I found the menu a bit limited - ","useful":1,"cool":0},"ylBDroZhzSB52eOWnn8-Hw":{"text":"Visiting New Orleans for the weekend and Turkey and the Wolf was recommended, the tacos we","useful":0,"cool":0},"xztZl4wh5qMzaavHDvWRIw":{"text":"Off the beaten path (of magazine st) but absolutely worth it. Had heard about the wedge sa","useful":0,"cool":0},"gkgwfN97OZVPLHU_X4wYcQ":{"text":"Always a hit. The friend bologna sandwich is SO good and the pot pie is a must. Every sand","useful":0,"cool":0},"ne03zxQ8Igkhn-5MtkO_NQ":{"text":"A ham sandwich is usually something I wouldn't give a second glance, but the rave reviews ","useful":2,"cool":2},"3OT0ZiEBzudgWM37hW5H4w":{"text":"It's supposed to be a 5 star place for price of a 2- star restaurant. Ordered collard gree","useful":0,"cool":0},"CkFk9doVwuEqbUw7ZDNI7A":{"text":"The collard green melt was the best thing I ate in New Orleans and maybe the best thing I'","useful":1,"cool":1},"mOhRCz5SRk7jSZtxn5BwDQ":{"text":"We saw this place on Diners, Drive-ins, and Dives and just HAD to try it. It did not disap","useful":2,"cool":1},"JwJd4WachDoq94RuVaG43Q":{"text":"Visited again in April 2019.  \n\nThis is more of a reminder to myself, but if you're not a ","useful":2,"cool":1},"Wnq_Qdr1nav893vb4BlpEg":{"text":"I was a little nervous upon seeing a fairly limited menu. Turns out everything was amazing","useful":0,"cool":0},"hBR7aXP-r-FVwSoXjMODuA":{"text":"Excellent, unique, accommodated me as gluten free. Cabbage salad was unique & amazing.","useful":1,"cool":0},"ay7DhE8kS6d4nmRA2SG_sg":{"text":"Pretty good food especially for lunch. I had the wedge salad and deviled eggs...both were ","useful":1,"cool":1},"w4XlquU17M2Ct1zP0o_awQ":{"text":"If you have not heard, this sandwich shop was selected by Bon Appetite Magazine food criti","useful":1,"cool":3},"Ioi9Oonvcehwkb2ubd6PTA":{"text":"I ate a lot of fried bologna sandos as a kid and loved them but somehow as I aged they bec","useful":0,"cool":0},"0x9QmO2J67bVhWndQMRhaA":{"text":"A coworker of mine raved and told me about this place for months now. I finally was able t","useful":0,"cool":0},"di8sZqIFvowEau-aodmh4w":{"text":"This place is laidback and the pork and peppers openfaced sandwich was heavenly. Don't let","useful":0,"cool":0},"CpieotYHwY5r61wUUoAOmg":{"text":"Collard green melt. Unreal!!! The line was out the door and across the street but the wait","useful":1,"cool":1},"w6V4mbiqW4eooRXmFdBcxQ":{"text":"We had our rehearsal dinner here and had the best time ever! It was so much fun and our gu","useful":0,"cool":0},"yXGT27DE2QE1sCAKbLa-EA":{"text":"Look. Listen. This might be the greatest sandwich shop of all time. It's certainly the mos","useful":5,"cool":2},"m8JBoNYoFV8EMYeeJ0otng":{"text":"The best sandwiches. On the planet. This is a small but mighty restaurant. Love love love.","useful":0,"cool":0},"Q395WbzcWTR2XAkaVRrCkA":{"text":"This really was a tough one to give two stars (and my girl was really pushing for 1 star) ","useful":1,"cool":0},"NNCESVZ8uLGMJ-JUrG_o1w":{"text":"We visited here for our first lunch upon arrival to New Orleans from Texas. I was impresse","useful":1,"cool":0},"HcTjbr7T9QHIuNRLL2AvMA":{"text":"Sandwich kings and unique things right here. I highly recommend this place if you like del","useful":0,"cool":0},"iuCUf6kYaRG7DwIP-TFJOQ":{"text":"I was exited to visit this place, I was waiting outside for someone to take my order 10 mi","useful":3,"cool":0},"dAkVRPVQI_ZnRzr7TyZJsQ":{"text":"I really, truly want to love Turkey and the Wolf, but I've now been three times and I can'","useful":1,"cool":0},"Y02uv0VbrBxPLLC-ptGiYw":{"text":"Love love love the collard green sandwich. Just enough balance of greens and spice. I woul","useful":0,"cool":0},"4dMmCVEmFdDRE_RrbeplLQ":{"text":"There's a lot of buzz around Turkey and The Wolf and i've wanted to try it for a while.  i","useful":0,"cool":0},"sTIzqK4MKrySG9NEx5aHGw":{"text":"Don't be fooled by the non-traditional menu - this place is outstanding. I played it safe ","useful":0,"cool":0},"58r9Tg8uJEeZWytKOP6ZHw":{"text":"Best sandwich joint In the city and the straight up definition of hole in the wall. I got ","useful":0,"cool":0},"UrJXb7ASyjDKQGII3fnI2g":{"text":"Ordered the chicken skin sandwich. It was a very messy experience with the sauce dripping ","useful":0,"cool":0},"jQ_6yv2nS7bVqwXVAVYQ1w":{"text":"You know that feeling the day after Christmas? Or that moment when someone surprises you a","useful":14,"cool":1},"aTQ4VitvKNU9typNZdwpig":{"text":"Food was incredible. The textures and depth of flavor they got into the sandwiches was ama","useful":0,"cool":0},"ZvECKo4cdBGXorHquut0Qw":{"text":"Corky, fun and eccentric from the owner and the people working there, but amazing food cou","useful":0,"cool":0},"pCmbQ1MXI1wWlPUxw2tKWA":{"text":"Today's Special..::Fried Chicken Salad Roti....hits all of the taste points....Off the F**","useful":0,"cool":0},"9R4lbAgjsAduf3Tng4rqyA":{"text":"Collard green melt and this review is done! Damn never thought it would be that good but w","useful":1,"cool":1},"9-mebOZZx8cnkAoflVDpjg":{"text":"Hipsters and hot sauce. Seriously this place sucks. While sitting between the entire table","useful":13,"cool":3},"6Rm1Y_jzStEwtZf-kEcmQg":{"text":"I would give this place ten stars if I could. I am not sure if this place cares what kind ","useful":2,"cool":1},"_4qMBfCHyHKHc2Mkc_Aqwg":{"text":"For the longest time, I've always thought a sandwich is a sandwich.  How special could it ","useful":9,"cool":5},"QUBxoWze4K6zK9bCHNuccw":{"text":"Simple but very well done. No surprise Bon Appetite gave it such praise. Don't expect a to","useful":0,"cool":0},"3Jt-zOWUJeukR9SXoaO9mA":{"text":"Trendy, hip atmosphere. Order at the counter, take your table marker, and food is brought ","useful":0,"cool":0},"JY73DQitUbPyBePX5G01xw":{"text":"Real talk: I would go back to New Orleans just for these sandwiches. They are that delicio","useful":4,"cool":2},"osUv4rSrp9iCXAPDoy9AYw":{"text":"We tried the fried pot pie, ham sandwich,  and the wedge salad.  All were delicious and fl","useful":0,"cool":0},"fQeaZ8JbvH_74NYM5z84EQ":{"text":"Just had the collard green melt. Put on some green Cholula hot sauce, and it was incredibl","useful":2,"cool":1},"zE-QJ6852n07IlRLjx1A7g":{"text":"I'm going to be honest with you... I love this place, I love the food, I love the vibe.  \n","useful":6,"cool":3},"ADCL61dA9ukTDHrhOIyCug":{"text":"This is the kind of place you should regret if you don't end up getting it. Not only are t","useful":0,"cool":1},"jWIAwH0Ve-hZVG8J_87Mww":{"text":"Very cool little sandwich shop, limited menu, adult beverages available and a hard working","useful":0,"cool":0},"0R_zUnjC1mGc70VQl78uVg":{"text":"Everyone knows that this place is amazing. If you left Witt out trying the Cabbage Salad, ","useful":1,"cool":1},"pB2Hv20ENz5CI00w9jsmmw":{"text":"Drop everything you are doing and get your butt to this place! I was pleasantly surprised ","useful":0,"cool":1},"QbgPbLEU_mNHS92obewrBQ":{"text":"Went on a rainy day and the place was packed. After all the hype, I decided to order what ","useful":2,"cool":1},"VuwyXWQa8MX2SCt8-r24Eg":{"text":"Really good sandwich. Price is a little high. $15 for a sandwich is a little excessive. Th","useful":0,"cool":0},"qCtVRiiAhL7I4b5CYtubDQ":{"text":"THE COLLARD GREEN MELT *insert drool* so glad I ordered it, haven't tried everything but I","useful":1,"cool":0},"Z6Fav2zeRJLdMwhVbfw6tg":{"text":"Turkey and the wolf is currently closed but I am finally getting a moment to review it fro","useful":0,"cool":0},"luAJ5n6anD-tYAfWQEgg5Q":{"text":"Bon Appetit magazine named them the best new restaurant in the US in 2017 - and they hit t","useful":4,"cool":3},"9zMJ9DdEKBGJXW8tTjnDkQ":{"text":"AMAZING sandwiches and salads. So innovative and flavorful. Memorable. Try the cabbage sal","useful":0,"cool":0},"VZ-42BFnSwiK906e2gf8eA":{"text":"I am sitting on their large outdoor patio right now after just finishing the collard green","useful":0,"cool":0},"CfgOct9ki8dx5xajh5X7Cg":{"text":"Ate lunch here 2x in 2 weeks and had the amazing cauliflower sandwich both times.  They ma","useful":0,"cool":0},"CknNru9voOShffuYhIZcTQ":{"text":"Not what I expected at all but quirky and good.\n\nI have been meaning to check this place o","useful":9,"cool":6},"pvQLWJKSGjrp3Jv2nCwlhw":{"text":"Mama burger - average at best - comparable to the double burger someone brought into the o","useful":1,"cool":0},"x2XzO33QRQNlVbK4_ZiymA":{"text":"Came here for a quick bite after visiting the nearby garden store. Got the frozen margarit","useful":0,"cool":0},"hzQZ670yhgwgpcnare3LPQ":{"text":"Decided to try this place for the first time today(saw it on Diners, Drive Ins & Dives las","useful":0,"cool":0},"5P3yKh7luWWHA9Jy9NIGyQ":{"text":"First visit to turkey and the wolf was pretty amazing. As soon as we parked, we saw the am","useful":2,"cool":1},"LX34HNT81zDTnOtePgElbw":{"text":"Different in every way, Turkey and the Wolf offers outstanding combo sandwiches and advent","useful":0,"cool":0},"wrLj1C9jwMr2pnnIzGPXlg":{"text":"First of all: the food is just alright, but not worth giving money to an incredibly rude o","useful":5,"cool":1},"Frwol-wvq7j0bBXW7ixgeQ":{"text":"Definitely worth all the hype. My boyfriend and I went for a late lunch and it was fun! We","useful":0,"cool":1},"gWDbuIY5TQm2Mm7tfHc9Yw":{"text":"I only ever eat the cabbage salad here (no beef or pork for me) but this place is BOMMMMB.","useful":0,"cool":0},"d-4e5XRDqqxmfP31Gdz33A":{"text":"Went here with some friends and shared sandwiches! We've been meaning to go for years, and","useful":0,"cool":0},"RPBLBwn1llWQTqlmhFY0pQ":{"text":"I love this place! Fun 80's/ 90's childhood atmosphere. Employees are nice and helpful. Th","useful":2,"cool":0},"L2iSKkpmfAbARsd1Zuymwg":{"text":"I'm a little disappointed.   I have been here several times in the past and every morsel w","useful":0,"cool":0},"jYdscT05YWFcKP16QM9SCQ":{"text":"I've been to Turkey and the Wolf two times now. After reading rave reviews online, I just ","useful":3,"cool":1},"crOP-eS9v8jsLdHHt5D7MQ":{"text":"Great vibe \nhuge huge huge sandos \nbut the fried bologna was not in evidence as much as I ","useful":1,"cool":0},"RrwO30qjqViUtXKgyq2_ew":{"text":"The menu is deceptively simple. Don't let \"a sandwich place\" keep this off your food radar","useful":2,"cool":0},"_ebnIr7EntDbEBrMsFqEcg":{"text":"I hate to be the spoiler here but was very disappointed in the sandwich I had here. It was","useful":3,"cool":0},"lRzRtHNzAfYQMZBO0t9HgA":{"text":"A no-frills, cute sandwich joint. Definitely get the Collard Green Melt!!! It was so delic","useful":0,"cool":0},"ktEn8-vcycxEcgT0e_mltA":{"text":"Been waiting to try it out since its well-hyped debut. I was excited for a recent opportun","useful":1,"cool":0},"n_r-K0OHRsxayELN-kguTg":{"text":"Fantastic sandwiches.  Big on flavor and just perfect for a cheat day type of lunch.  Big ","useful":0,"cool":1},"fn0EyWyoToRzWOhFbaPl7Q":{"text":"I was exploring the Garden District on foot and started to feel hungry.  I sent a text to ","useful":0,"cool":1},"9kaF7n9wa5pr7Xc61Fyyaw":{"text":"Glorified bar food, overpriced with a long ass lone that leaves you wondering why the he'l","useful":2,"cool":0},"gnx8CuiXPvtlx30L3OYpAQ":{"text":"I was in New Orleans for vacation and looked forward to try this place , since I've heard ","useful":1,"cool":0},"dEvvYh2Rgo5agnEjERx_oQ":{"text":"Oh lord.  Everything is great. Crazy things like fried bologna sandwiches and deep-fried p","useful":0,"cool":0},"NB0hJsmrZbq8dHhVtC-3yg":{"text":"What a rip off! Set menu, no indoor setting due to COVID, I guess. They actually charge yo","useful":1,"cool":1},"weh113fASUxds58mcWi4_A":{"text":"I was excited to try this place after all the hype, but honestly wasn't as impressed as I ","useful":4,"cool":0},"Kd9qbviZ6BjFWdv0bhNhtQ":{"text":"Honestly, this is the most iconic sandwich shop I've ever been to, no regrets. We went aro","useful":0,"cool":0},"Dslh15MlFbxNemy1XoXl2A":{"text":"Werid. But in all the best quirky, hipster ways without being annoying. And that's just th","useful":2,"cool":2},"_Dwi888iD9fZ2xluDB7K7w":{"text":"I've heard my friends raving about this place for awhile now. I'm really not a big sandwic","useful":0,"cool":0},"rOCkMVke22Mx1-0T6wwTfg":{"text":"This food is so delicious and thought out every time I've been. \n\nFancy food in large port","useful":2,"cool":0},"Gh4If-oGCIbNRuAUA96umw":{"text":"Giving this a 5 purely for the collard green sandwich.  I am salivating as I'm thinking ab","useful":1,"cool":0},"JnU6Nxp7LLX1s3muDTT3vA":{"text":"Unbelievable!!! Our friends recommended Turkey and the Wolf and specifically the fried bol","useful":0,"cool":0},"BKRQbB-XQTfNwTC9iX-cWg":{"text":"What an awesome spot.  Came for the first time on a quick trip through New Orleans.  Very ","useful":1,"cool":1},"vwc2Dkp4jWbAAaSbIfy6nw":{"text":"Great lunch spot! We enjoyed several sandwiches, burgers and sides! The menu constantly ch","useful":0,"cool":0},"BheaXF4Jc4jazvVA9UEmoA":{"text":"Not open today in spite of Yelp listing it as open. No sign on the door, no notice on inte","useful":1,"cool":0},"KJlM876iwuZS8zY2LyEcWQ":{"text":"Cute and quirky decor. I was excited to try what's supposed to be a badass sandwich shop a","useful":1,"cool":0},"PUhrksFazXZZ3bUCoDMo-Q":{"text":"This place was a mix of funky, cool, and sweet. It gave off a good ole hole in the wall vi","useful":0,"cool":1},"jGSWPhojYdqIQLT7A21mCg":{"text":"******WARNING********\nTHIS IS NOT NEW ORLEANS CUISINE \nAND IT SURE IS NOT NOLA CUSTOMER SE","useful":4,"cool":0},"TrviWguDuXya-ZA7s2xhdw":{"text":"A definite must on a visit to NOLA.  The food was amazing.  Can't you say \"fried bologna s","useful":0,"cool":0},"h_Sg5VWc6fQhwTszV2f7Og":{"text":"Best food ever!!!! Was presently surprised by how amazing the food is here. Quick service ","useful":0,"cool":0},"6rgF8hhhvkFfdJWYtyYsKw":{"text":"Fried bologna sandwich--Amazing!!! The ambience is fun and funky. It's a small place but h","useful":1,"cool":0},"9-6faqfpXj9yAsP7QF4YRw":{"text":"I can tell you this place appealed to my inner child and that's why I loved it. 1970's Mac","useful":1,"cool":0},"tOS-DnWhNF_MUwk5JcBtXA":{"text":"We stopped by for a vegetarian sandwich after seeing in Somebody Feed Phil.  It was spicy ","useful":0,"cool":0},"VqCnqVI_l2X3513MlHsuMw":{"text":"Heard a lot about this little place. It is very small but has a nice outdoor area and is p","useful":0,"cool":0},"ZiCpeE9ih5QoQzps4cTKtQ":{"text":"Everything about this place is the bomb-diggitty!\n\nI don't even like bologna but the fried","useful":1,"cool":0},"Sbpy4W7KANZloENTllEwUg":{"text":"This place is extraordinary- the service, the energy \n, AND THE FOOD!!!\nOrdered the fried ","useful":0,"cool":0},"6vsj2FfocCAp7rXVKcXvtA":{"text":"This place was recommended by a friend.  It is now on my bookmarks.  Very small but big on","useful":0,"cool":0},"fzU6yCurKkzEtPq9OYU-Eg":{"text":"My first sandwich at Turkey and the Wolf was pretty good.  I had the ham sandwich which ha","useful":2,"cool":2},"qVZHoTYzQyIqR6Z6RjCHQw":{"text":"I've had Turkey and the Wolf on my bookmarks ever since Bon Appetit named them Best New Re","useful":21,"cool":19},"lyXv9qARMptU2Ctcp9wLOg":{"text":"My dad's favorite city in the world is New Orleans, and he comes every October with a bunc","useful":2,"cool":2},"Al10knqzxkRQ8QSV2WfQOw":{"text":"The environment was super overwhelming for me, the menu didn't have descriptions of the sa","useful":1,"cool":0},"X9PRWUnf8N8l0P1doMs38w":{"text":"WOW! Just WOW! I ate here twice in one day. I just couldn't believe how unbelievably packe","useful":2,"cool":1},"YZ1DDnhifXuqbZuN4FgSzQ":{"text":"If you enjoy incredibly greasy food served by rude, attitudinal employees this is the plac","useful":2,"cool":0},"Wb0jTSgOv2UBH63oCw5KVg":{"text":"They had a limited menu but everything was outstanding. Definitely would recommend going h","useful":0,"cool":0},"cGP_e_E3F6cRgazvc0Lujw":{"text":"After placing first on a certain best ofs list, this place has probably been booming. We c","useful":4,"cool":1},"atE8uI8stV2-OflX-essjA":{"text":"We visited when they had yet to open up the indoor seating. Cans of cold PBR are sold - de","useful":1,"cool":1},"4HgWZ3QXrZHStgaxXQMONA":{"text":"I didn't know I needed a bologna sandwich in my life. Then again I didn't know a bologna s","useful":0,"cool":0},"1J2qEKSa4q2To5W6I3XCKQ":{"text":"OOEY GOOEY\nThe under-reviewed Ham sandwich is an warm eclair of slathered herb mayonnaise ","useful":7,"cool":1},"dvItngLYesNy7FQf0a8Cdg":{"text":"Some experiences you have just make you re-evaluate food. Turkey and the Wolf fits into th","useful":1,"cool":0},"Q2L5ezt8oCqs4SAYVwdkew":{"text":"We heard of this place before and after looking over their menu we decided this was a must","useful":2,"cool":2},"fCX3uyENMf8ogpRAVx09ng":{"text":"The food, atmosphere, decor were amazing.  I love this place.  My friends and I ordered th","useful":0,"cool":0},"3lIfm-Bb9irCxToDlNQotA":{"text":"Every sandwich here is what your dreams are made of. The decor is fun. The service is frie","useful":1,"cool":0},"vbhmQqXXZs_xhJss9i9Dhg":{"text":"An experience like no other in Nola. \n\nSimple look yet sophisticated taste. Haha. This pla","useful":0,"cool":0},"oUb5tKn6bodWyg0MbLXqcQ":{"text":"O V E R A T E D. *clap*. *clap*. *clap* *clap* *clap*.\n\nWas really disappointed with the F","useful":4,"cool":2},"wjnIvWSlpRvmTRng2D2PYA":{"text":"Oh myyyyyyyyyyy. Masan you killed it my man. I run of the best butcher shops in New Orlean","useful":0,"cool":0},"Z5FHoEegiWzOpOk5GDWe4w":{"text":"THIS PLACE IS THE TITS. If you haven't tried it (and you're local)- you're dumb. Okay but ","useful":2,"cool":0},"jrctTnacLvzej9G9H3T3Tg":{"text":"Recommend? Yes.\nDelicious vegan \"chicken\" sandwich. There's nothing spectacular or special","useful":1,"cool":1},"7yQnwoCuPtuOvsVbPN_NWg":{"text":"Does not live up to the hype. Salads are gross; sandwiches are just okay. When you take in","useful":1,"cool":1},"m2P5mgyBCDqFzPwlXxeA5A":{"text":"Found a bug in my food. Told manager and they said it's New Orleans, it happens \nFind a cl","useful":2,"cool":0},"IfONVXKIQRaE08DANahl7w":{"text":"Great sandwiches. Awesome vibe and good people. Would definitely recommend for anyone who'","useful":0,"cool":0},"MIaav5pRaxWyjdzaZiSniw":{"text":"The best sandwich I've ever had. I had the fried bologna. I don't even like mustard but oo","useful":2,"cool":0},"ErVXeXMRa_IJ19Z3dEEuOw":{"text":"Got here about 10-15 minutes after opening on a Saturday morning and it was already bustli","useful":3,"cool":1},"0OOJFfHOJtlHVI_ueqsMIw":{"text":"Absolutely insane lunch and a must stop in NOLA. Got a frozen margarita, Topo Chico, Hog's","useful":2,"cool":1},"vJPOFcZPNVRUgOkgs3aiTA":{"text":"Stopped in for lunch and had the crab meat grilled cheese sandwich. They used Italian chee","useful":0,"cool":0},"z01YTjoUUqucD1yw7NzLdA":{"text":"First and last visit there today.. Limited menu and overpriced. Paid $15+ for a 6-inch ham","useful":0,"cool":0},"G7UG-Wm9kxeBEwzGLYH_rw":{"text":"Oh my god, this place! Took us a while to come here and we're sad we didn't try it sooner.","useful":1,"cool":0},"sTDjk35JvVABykQNgEHCdA":{"text":"Was a disappointment.\n\nYou ever see the movie Vacation when Chevy Chase goes to visit Cous","useful":3,"cool":1},"iihM-LR2N3Y5iHO0Eo9C-Q":{"text":"On Instagram they have a yelperssuckfarts hashtag they just posted. Not sure what happened","useful":7,"cool":4},"jj9UflInpbKPJJCy4f2I9w":{"text":"The best restaurant I visited in New Orleans. I have not only recommend fed this place to ","useful":2,"cool":0},"Q6vuC7tsDV92go46U_iYLA":{"text":"Great customer service, great food. 10/10 Would recommend for a friend. Marg wasn't too sw","useful":0,"cool":0},"saqLhA-ykqDgV8xQTtDEUQ":{"text":"Never tried it but drive by on the bus and also respect their attitude on race, equality, ","useful":0,"cool":0},"n18z5fgqzNIFkU3gri1zKA":{"text":"Oh my gosh, so glad this was part of my quick weekend in New Orleans food adventures!! Was","useful":3,"cool":1},"4TJ-ZbploHV9qu8-yI3-ig":{"text":"The collard green melt is the best veggie sammie I've ever had.  Been meat free since 03 a","useful":0,"cool":0},"EzlpEPTfhtM6gAzBs6TMTw":{"text":"I live outta town but any time I make my way down to Nola I make sure to stop here.  It's ","useful":0,"cool":0},"LngZ216-3WvIxWgPk5QBfQ":{"text":"I was really apprehensive about checking this place out. It has bomb reviews, but nothing ","useful":2,"cool":1},"X5i4SKy2hUF-Eda17Un2IQ":{"text":"I've been super excited to try this place for a very long time. Welp, the wait was over to","useful":1,"cool":0},"nzTUYXqPC1hDbZ5vbwQqRA":{"text":"Came in search of the heirloom tomato sandwich the last day before their 10 day summer vac","useful":3,"cool":2},"fa9aJB2JwJQRkY80nA2yBQ":{"text":"The sandwiches and salads here are truly unique... in construct, flavor and overall creati","useful":6,"cool":1},"OYcciBY7Naudo4ymGHpeFA":{"text":"Turkey and the Wolf was recommended to us by 3 different Lyft drivers within 12 hours of l","useful":6,"cool":2},"7uJDnF7kQfgUND3k7QbWsQ":{"text":"Food: 50/50\nService: 25/25\nAmbience: 25/25\n\nDue to covid they are currently just a walk up","useful":3,"cool":2},"prwhN8M9b7kfr4mbBKxWpg":{"text":"I feel real lucky to be staying just 4 blocks from Turkey and the Wolf because the collard","useful":5,"cool":2},"SMxVTnjdB5lXMxg4bJT9aw":{"text":"There are some places on earth that shouldn't exist but somehow they do.  New Orleans itse","useful":1,"cool":2},"4SygGHQGAUq5N_VslN6wAg":{"text":"oh my god this place is the best. i've been a few times and always get the fried bologna s","useful":1,"cool":0},"HDaHfuOLJUfw48lQjFvHjA":{"text":"YUM!! The best sandwich I've had in New Orleans. Very special and unique. I got the sandwi","useful":1,"cool":2},"6nLZR_7ZnPqzj8HKc6J-Xw":{"text":"KenScale: 9.0/10\n\nFor the second time in a row, my best meal in New Orleans turned out to ","useful":4,"cool":2},"CSjCq-j54JWqBab8iZOI5g":{"text":"Wow. We ordered to go from here after taking an early morning flight to NOLA, and found ou","useful":2,"cool":2},"_pcuhdjxH5O2j7rZusOIAw":{"text":"Drove from BR for the fried bologna sandwich and it didn't disappoint.  Also enjoyed the c","useful":1,"cool":1},"a4GuGoaNxHtBlCXqiHuhSQ":{"text":"Who would have ever thought that putting thanksgiving food on a sandwich would taste so he","useful":2,"cool":2},"DUTRXQtt5x3Rlkq_gOdu4A":{"text":"What a gem. This local shop may not look like anything special based on its location but l","useful":0,"cool":1},"QeZpy4b3lgsGWWUix6_vig":{"text":"Unfortunately the WORST place in America. Honestly they only have so many reviews and cust","useful":2,"cool":0},"hjqSG8GTvhbc9iF4Spcfng":{"text":"Meh not impressed. No restrooms, which was a pain because we had been walking around the g","useful":2,"cool":0},"rwT3WLc4Z8BGThDGUabIeg":{"text":"Shoot, I cannot believe I have never reviewed this place. Like most everyone else it was n","useful":4,"cool":3},"hZvrZ3l6_bKyhQcoUKgJ6Q":{"text":"Did I just stumble into Brooklyn? Turkey & The Wolf definitely exudes hipster in the best ","useful":4,"cool":4},"eJiXGnVVVD5TzoWe35tyNw":{"text":"Delicious food. I had the vegetarian chicken sandwich and it was sooo delicious. Tasted ex","useful":0,"cool":0},"h6Bql7QuabY-bx22Fo3FkA":{"text":"Second lunch of collard melt. Amazing! It's a double decker sandwich starting at the botto","useful":2,"cool":2},"2RYCbiQA4aaHuXwJIZFsWw":{"text":"Turkey and the Wolf. Words cannot explain. Seriously. Yes it's a sandwich shop, but really","useful":1,"cool":0},"pRzFaucSSUPgSEjl5giRLg":{"text":"The hype is real. Been multiple times,\n\nHave tried\n\nFried Bologna sandwich- It's my fav on","useful":1,"cool":2},"TKGU9z0pq6MtwkW3SOUtDQ":{"text":"Turns out Mardi Gras is the perfect time to visit this popular lunch spot. Being inside th","useful":1,"cool":2},"ZzMlLbnLRzzoiarCQ9UnEQ":{"text":"I've been wanting to go to Turkey and the Wolf for years, and finally had the chance to ma","useful":3,"cool":3},"RgD6mg4RMUZMrjfRhk-MUg":{"text":"With Covid restrictions shifting back to Phase 1, Turkey and the Wolf is currently taking ","useful":2,"cool":1},"8PZ1kV9upD6LEfNndGAcXA":{"text":"Sheeyut. Look: Bon Appetit called this the best restaurant in 'Merica. So my lame Yelp rev","useful":1,"cool":2},"DWmPD7YAhc27yFLlgGYt5w":{"text":"At last we dined at the famous Turkey and the Wolf.\n\nOur meal was delicious, if not transf","useful":0,"cool":1},"Aotg-HpNXqADLec9DMIE5g":{"text":"This. Place. Is. So. Great. --- that I ate here 3 times within a two week period. That's h","useful":4,"cool":2},"yi0tiXUa-T8OCaEUfUiWkA":{"text":"Phoney Bologna!!!! Need a sandwich go somewhere else. I don't Yelp often, but when I feel ","useful":5,"cool":1},"qVi4cGWK-ljPVgQES7uTHw":{"text":"I've heard about this place from TV shows and from local newspapers. It was apparently vot","useful":2,"cool":1},"JerGhTQAwvgCZiNqFfMAJQ":{"text":"This is my mom's favorite restaurant in NOLA. My expectations were very high, so the food ","useful":1,"cool":0},"xCOAIiUJ2e58cCT8waFTEw":{"text":"I've eaten and gotten food from Turkey and the Wolf a while back and I really enjoyed it. ","useful":1,"cool":2},"wtBIyA8nVmFjwRq0YjSydg":{"text":"Mama tried burger is bomb. Highly recommend! So juicy and cheesy. The collard melt is perf","useful":1,"cool":0},"0IcWt2yJw35cwqHvMNyJ4A":{"text":"Great lunch spot, with a cool vibe, limited menu of awesome sandwiches and a fried chicken","useful":3,"cool":3},"Qj7Lw0UZeMQggOBHwBNXZQ":{"text":"First of all I would like to say that I enjoyed the sandwiches and salad. We had a great w","useful":1,"cool":0},"JIcb_fSyvMtLWDgYoauh3A":{"text":"Wandered back in here for a late lunch on a Saturday and was pleasantly surprised to find ","useful":5,"cool":1},"-D-ZVa4aCW9hQq44tFW-5w":{"text":"Are here 4 times in one trip after I discovered it on my first trip to Nola. The food they","useful":1,"cool":1},"RPJ2hQ5HMgsQOqZR-Tn5EQ":{"text":"Amazing lunch spot. Get the collard green melt. One of the best sandwiches I've ever had! ","useful":3,"cool":3},"6xEb_u7Sz8T_zCveNHyjFg":{"text":"Almost went elsewhere, but decided to take a chance on T&W. No indoor seating, but pleasan","useful":2,"cool":0},"4Rh6sp7JPfagJ1uUJmZJXg":{"text":"I went here for lunch with my roommate and some friends and honestly it was ok - I'm not q","useful":3,"cool":0},"IJh_o9jub-5X3dRuB-3Mbg":{"text":"Stopped by around noon on a Sunday. There's a few parking spots right in front and you cou","useful":5,"cool":1},"GGPz4Z6-QOsTVb3kJujLhQ":{"text":"This place was a bit of a marketing fail. The menu online doesn't match (or come close) to","useful":5,"cool":2},"Okypx_ohCVyzu14uVc5lqw":{"text":"The best sandwich I've ever had! Try a few split them with friends. The fried bologna sand","useful":3,"cool":3},"5jMW3guOngtLCqhEUYNjvg":{"text":"This was the worst restaurant we ate at in Nola. We only went cuz it was rated best restau","useful":4,"cool":0},"PJ494hOuE4KXojS5QjBy1A":{"text":"WHAT A GEM. Don't let the casual walk up line counter service or the retro plates and glas","useful":1,"cool":0}}