{"QLHztsR4iTovo85MGxP77A":{"text":"Jeremy was awesome behind the bar. The charbroiled oysters were off the chain! We stumbled","useful":0,"cool":0},"wwrZDmHa_Svkrh1r0Xg3Xg":{"text":"I really can't rave about this place enough. The gentleman who greeted us at the door was ","useful":0,"cool":0},"ktKamlsQXnmiR80dR4_3cQ":{"text":"Had the shrimp remoulade sandwich that included fried green tomatoes and arugula on fresh ","useful":0,"cool":0},"7e4AWvT2Y5pdd8QZYfDQvA":{"text":"Came for a birthday brunch. Started out great. Gio was nice and attentive. Things got real","useful":0,"cool":0},"cHpAoGUpX-q5PTMUz_MKXQ":{"text":"Not pleased with this place. Stopped in to kill time, ended up killing a lot of time waiti","useful":0,"cool":0},"Fu8uam_DtKKGd9Y0P87ESg":{"text":"While the food here was quite tasty, unfortunately the service was INCREDIBLY slow and ver","useful":0,"cool":0},"X6PoX3o5PEcsay8b9Iry0w":{"text":"This was the highest quality food I had my seven days in Nola! The charbroiled oysters wer","useful":0,"cool":0},"APRdhGgNzIW3INw5sc_FoQ":{"text":"I must have gone on an off night because the food was meh. The seafood gumbo was super sal","useful":0,"cool":0},"dkjZNZtc21myI6q0nf5W2w":{"text":"We love Basin. They have great happy hour specials with their bar menu. We especially love","useful":1,"cool":0},"465lHRIG8ODkO1JMESCZYw":{"text":"Delicious fried oyster salad. Prompt and friendly service. Not too noisy for lunch.  Only ","useful":1,"cool":0},"7mj_ifLxNIjC_UNaU9k62w":{"text":"Service was fantastic. Smoked snapper dip is a great starter, fried avocado was unimpressi","useful":0,"cool":0},"tzF0a20b3FM6MH_0Sm321Q":{"text":"It is really too bad this place is not better. It has a great location with outdoor seatin","useful":3,"cool":1},"30lhthaQg_kotCQLhG3nZg":{"text":"Basin is a regular spot for us to visit. The location is great, the atmosphere is relaxed ","useful":0,"cool":0},"82-A8VbIfY7bW55mVrm-Ew":{"text":"Wow, this place rocks and more people need to know about it! Happy hour is 4-7, and the ap","useful":2,"cool":1},"B5LUNTB2Ck0mM10cWk8T9w":{"text":"We decided to go to Basin for their great food. Went as usual, parked in the lot next to A","useful":0,"cool":0},"U65xhE9AxvTpJ3GAo3IALQ":{"text":"The boudin balls were so delicious, but my favourite was definitely the deep fried catfish","useful":0,"cool":0},"Nbs0W662DxasYi09vMmCuw":{"text":"Best gumbo we had in New Orleans.  On our last night, we wanted one last bowl of gumbo.  A","useful":0,"cool":0},"4OcOqA0342713y5JVOseFA":{"text":"Great chargrilled oysters and crawfish beignets where delicious. The New Orleans mule was ","useful":0,"cool":0},"BSyxf8Q5KDtsc7od_msjQQ":{"text":"Great seafood with a friendly staff and a creative cocktail menu. Two must haves are the r","useful":0,"cool":0},"iO6tgfqAANHheoff524_Dw":{"text":"Blue crab and crawfish beignets are delicious.  The fish tacos look tasty too. Boudin ball","useful":0,"cool":0},"2M7XklKQpUX_cmzdbhqa3w":{"text":"There was a live worm in one of the oysters! I don't care if some people think that's acce","useful":2,"cool":0},"AU5xAyJ3EwzjJgzQdFETZg":{"text":"Had the most delicious crab and crawfish beignets at a Happy Hour last week. This was my f","useful":1,"cool":0},"Iejn5_mI6_6uyDYXlxe_oQ":{"text":"They charged us ten dollars for water because we got a bottle of spring water and one spar","useful":0,"cool":0},"4QQW0r9VHGIzzoOFY5QMug":{"text":"We thoroughly loved our lunch. The charbroiled oysters were delicious as was the po boy. F","useful":0,"cool":0},"gMqii4oZhw-xbBJ2yXtzvA":{"text":"We stumbled upon this place while trying to find a lunch spot. The place was pretty, good ","useful":0,"cool":0},"Pbcq854_sxyDDK9R_jqEEg":{"text":"First review, just wanted to say that Caitlyn was hands down the best waitress I have ever","useful":0,"cool":0},"wJOFamQCruV_qNrOyjAWjQ":{"text":"I loved their chargrilled/ charbroiled oysters thatI have to come back for a second time. ","useful":4,"cool":1},"y7mjM5Zv6jjNtY0-lnY3EA":{"text":"Awesome 50 Cent oysters on Monday with a fresh fish special when we visited. The bar next-","useful":0,"cool":0},"5NRjcsplsLXa2Dt-a8cf4w":{"text":"Great little spot. The Gumbo and charbroiled oysters were spot on. Very relaxed and friend","useful":0,"cool":0},"svxaXYpIrSiMza5Yt_TVDw":{"text":"My friends brought me here as a belated birthday lunch and it was fantastic. I found out t","useful":0,"cool":0},"7pPwvhzf8Qzq5oFTEVrVvQ":{"text":"Amazing food and super friendly staff. I highly recommend the pork hash! The server was su","useful":0,"cool":0},"ox-SZCtETQidDQFDSzIzbA":{"text":"This was our second time at Basin, and it proved that our experience the first time (in Ma","useful":0,"cool":0},"ZEWGSAeo0la4nqgPyX70bg":{"text":"Had a lovely meal with my daughter after a day of touring Tulane on Friday. Started off wi","useful":0,"cool":0},"3QNDAnPHS0hBu7XXSUbsXA":{"text":"Yummy seafood place.  Very excellent charbroiled oysters but the highlight was the risotto","useful":0,"cool":0},"6k-_L4B-SwI4-pfBvo26Jg":{"text":"Was taken back by crawfish beignets. Had to try them before simply dismissing them. I'm gl","useful":0,"cool":0},"0Ai0e-oJE3X3Y6akpOVFfQ":{"text":"I really can't wait to try this place again.  As much as I'd like to try more of their men","useful":1,"cool":0},"AIhJA1JGCLDlHLo2NEiBDg":{"text":"I LOVE this new seafood restaurant! The snapper dip is incredible!! The owners are hands-o","useful":0,"cool":0},"CA0DtHlUGoIVSSednuLeAQ":{"text":"My wife and I liked this place. \n\nIt is easy to spend a lot of money on food in New Orlean","useful":0,"cool":0},"1NXoNxw7FoEXDlvSacO-OA":{"text":"Been here about 6 times and keep coming back with visitors! The crab and corn bisque is li","useful":0,"cool":0},"FuDXYJxpON_pj6RcUAIfOg":{"text":"Stumbled upon this place after a day of shopping on Magazine. I am in love. I had the crab","useful":0,"cool":0},"v5hHagKXf8r2bwWukeW3IQ":{"text":"Had a really lovely dinner at Basin. After an afternoon shopping on Magazine Street, Basin","useful":0,"cool":0},"DcRRRVj7ykQvOLG1vodKQQ":{"text":"I've heard a lot of good things about this place since it opened, but have yet to try it o","useful":1,"cool":0},"U9XcNyByWgZ4OOr7UnGxQQ":{"text":"Everything was perfect! I came with a group of seven girls. We tried multiple appetizers a","useful":0,"cool":0},"IcKVVFrJQu1tA4oX1i1AHQ":{"text":"Terrible service. The $25 BBQ shrimp was overcooked and didn't come with bread or grits or","useful":6,"cool":0},"qlmfmWUq5GYi8PLjKZiEeQ":{"text":"So underrated! Especially for the area. Wonderful drinks and attentive staff, but the real","useful":1,"cool":0},"LsKP6weM4IShOi4mZy-jfw":{"text":"Tho I had enjoyed Basin previously, I hadn't been there in a few years--happy I returned. ","useful":0,"cool":0},"rEdlHrvclPJJ5wvtxYUG_Q":{"text":"I've been in town for 7 days and I've made it a point to try everyone's gumbo. This is the","useful":2,"cool":1},"T0Tqzeew2nxkycOOmxAYGg":{"text":"Stopped on for a late lunch,  small menu, but some great items. Had the crawfish and shrim","useful":0,"cool":0},"fUS0pawo3bJ_yIz0bi2hOA":{"text":"Wow. Is there a zero rating? I don't even know where to start. Long story short. 8 PM rese","useful":3,"cool":0},"w726eUl9V9AQ656oTyKSxA":{"text":"I can honestly say this was the best meal we had during our stay in New Orleans. Let me ju","useful":0,"cool":0},"xdAmqaDXKOmHsRmdDznIMA":{"text":"I had a meeting to go to and decided to go to Basin's Happy Hour since I was early. I have","useful":4,"cool":2},"Q_hf7jzfmuTIj22qnpHOEA":{"text":"Wonderful find! \n\nThis charming restaurant has a brilliant and varied menu for lovers of s","useful":3,"cool":1},"9eXWq4F4Zte33z6I5pt3nw":{"text":"What a neat find! My friends and I stumbled upon this place while shopping on Magazine Str","useful":0,"cool":0},"dpIkRGAo_OWaTv5-GUcg2A":{"text":"Sunday brunch was delicious. Smoked snapper dip was amazing but somehow the cucumber firec","useful":1,"cool":0},"4m3OwZcaHfAoeT3Xp_9Ebg":{"text":"I have been to Basin twice and had a good experience both times. Nice chargrilled oysters,","useful":0,"cool":0},"IrQ7TgOcU_5y8FK5dJtdVA":{"text":"Really enjoyed the happy hour. We stopped in for the raw oysters, while there we got the h","useful":0,"cool":0},"Ahv_141D80FucvWQtMqBKA":{"text":"Light and beautiful char grilled oysters..\nNot drenched with butter.\nOwner ran and got ste","useful":1,"cool":1},"pO0ddUzM--ZuI_mTMUcBeA":{"text":"This was a great and random find.. it's my mothers 80th birthday, we're staying in the gar","useful":0,"cool":0},"biPtKM523OxK6V4_6SA7XA":{"text":"I had the \"fresh catch\" special, which was a red snapper.\nThe plate was huge, the fish, bi","useful":0,"cool":0},"P-jBkgL7fKmAMnRBJ824Rg":{"text":"Solid little place in an adorable neighborhood.  Loved the pork & hash.  Crab & crawfish b","useful":0,"cool":0},"cvLPXtKwgHzVAMpHszqu1A":{"text":"SO YUMMMMY, must try if you're in Nola! I walked here with a couple of my friends during o","useful":0,"cool":0},"EJKUW3xMPHwCefuYTtVMqA":{"text":"I came into this place not expecting much other than a good mimosa buzz from their $13.99 ","useful":4,"cool":1},"2slO3AjbDPMaZLNevP8A9w":{"text":"Let me start out by saying that based in the food, it would be 5 stars, but our server was","useful":1,"cool":0},"J1CA8Ux_MOkhqYnoSHIodw":{"text":"I should preface this review by letting you know I'm a vegetarian- I do not eat seafood, b","useful":0,"cool":0},"_5ZXV5zSKwlj5u3pClIJtg":{"text":"Highly recommend. We found this place off of an IG account that posted a photo of the craw","useful":0,"cool":0},"EWhE6x6J78sGApEOhHFQig":{"text":"The food is great and the service was even better. Flo kept the mimosa's coming without us","useful":0,"cool":0},"tBM3Foly5tYu1yHVTLXuCw":{"text":"Great service. Yummmmmmy snapper. Great atmosphere -- must try watermelon margaritas !","useful":0,"cool":0},"aX4sEWAP7tz1SSyYNkGJ5w":{"text":"Fantastic experience coming here that I recommend you try it out. Came in with a group of ","useful":0,"cool":0},"M5VnhXkgWhap0mZjqP9MhQ":{"text":"This is the second time I've been to Basin Seafood and Spirits, and the second time I've c","useful":1,"cool":0},"khATrHk9p1_cNhbq5DFLCQ":{"text":"Basin is one of the city's hidden gems. It's not popular or ostentatious. It's not classic","useful":0,"cool":0},"T-MRSN2WB0YDAXZ6xdtxrQ":{"text":"I went here for bottomless brunch on Saturday with 5 of my girlfriends.  It was amazing.  ","useful":0,"cool":0},"3Y-IzL9ywiEjOJd3t4HBfQ":{"text":"Hot and thirsty, checked on yelp for a place nearby. Dropped in for happy hour. Had the sp","useful":0,"cool":0},"1ye_863M0Rx6dvzYtDBLwQ":{"text":"I've only been there once. Fairly decent food but could do better given all of the choices","useful":0,"cool":0},"SvA_eib_YmnAsCEZSI-P5g":{"text":"We went at happy hour and had one of everything except the octopus ceviche. Fish tacos wer","useful":0,"cool":0},"xKFYWhLdFPVV-ju_gggwwA":{"text":"Caesar salad with fried oysters was the winner. \n\nCrab risotta was flavorful but would hav","useful":0,"cool":0},"3aQge1HQyS9u-BAk1cAO2A":{"text":"I have been twice and literally licked my plate clean both times. Food is out of this worl","useful":0,"cool":0},"q2XnWRdd5LeVhHDKdyCfnw":{"text":"Great find! It was a Saturday night and we didn't have a reservation, but they fit us righ","useful":0,"cool":0},"NygUpiUEdDaUTYPUFzTBtw":{"text":"I've been here a billion times and it never disappoints. TBH, I've pretty much had everyth","useful":1,"cool":0},"jI-J_uOuOJpByalOQld6tQ":{"text":"My Friends and I had bottomless mimosa brunch and had the most amazing service and food, o","useful":0,"cool":0},"ZoTXiYD4qjC_PrfFGYBZZQ":{"text":"Great gumbo and awesome mojitos. Gotta try a blackberry mojito and blueberry ginger mojito","useful":0,"cool":0},"AUcJGnJBa8fAIKYQX3w59g":{"text":"We went here for a late lunch at about 3pm on a Saturday.  The charbroiled oysters was our","useful":1,"cool":1},"RJGXJsAtHTsqqSs15EJu0Q":{"text":"Where has this place been all my life?! Fortunately we visited Basin on our first day in t","useful":0,"cool":0},"4IHbFdd1ypVC6iqkBAYUqQ":{"text":"This place has great food. I think so far one of my favorite po-boys, I have ever had in N","useful":0,"cool":0},"SyMVSyhbc_LBw1LWvT5IcQ":{"text":"Heard great things. Waited 40 minutes for a drink. Never came,  we left. Will not return.","useful":0,"cool":0},"7KxfweDrzfL7j3P9TnXeVQ":{"text":"Best charbroiled oysters in town!!!!! Great location and great staff, had a great time.","useful":0,"cool":0},"bahQK1_opgK0WCK78EP79Q":{"text":"We have eaten at Basin a few times now.  Most recently, we did a Monday night dinner to gr","useful":2,"cool":1},"-cW_ahIruIuO6mUtZT_-Og":{"text":"Basin has a great happy hour with a bunch of 4$ dishes- all very decent. The fried pickle ","useful":0,"cool":0},"FCfB2VMHVhtVstOi6DDBZg":{"text":"Excellent ambiance with many simple, delicious items to offer. The ahi tuna is especially ","useful":0,"cool":0},"2-hdCtdGn5SfY4zzhk1RhQ":{"text":"Raw oysters and chargrilled oysters are dynamite.  Great little establishment.  Would be n","useful":0,"cool":0},"spHj3PMwuyGIj_KRLn5aLA":{"text":"What an incredible restaurant. I had lunch here on a Tuesday, which I'm glad I did, becaus","useful":0,"cool":0},"jOX9RyeQvRW4QByKB8TYHw":{"text":"First meal in NOLA in ten years, mixed reviews from family. My salmon poboy was grilled we","useful":0,"cool":0},"Lt68T-iLyXMX26p8pLBcyA":{"text":"Decided to try this after driving by a few times.  Made a reservation but probable could h","useful":0,"cool":0},"b92XYPMZdUwlrFt0AUqjaw":{"text":"Was excited to have a local's secret for seafood uptown. \n\nI scheduled a preview dinner be","useful":0,"cool":1},"skc3aQzjjiC3HggmbAs_Iw":{"text":"My boyfriend is from Germany and has never experienced the city of New Orleans. My good fr","useful":0,"cool":0},"3M6o5l4I9GDpc2gIQSsDnw":{"text":"Great new place to eat seafood.  A must try.  Service was prompt and friendly.  Prices rig","useful":0,"cool":0},"AOAQleiG3tEMOU8V-3X0PQ":{"text":"Stopped in for lunch on a whim and was not disappointed. Service was great, the space is c","useful":2,"cool":0},"lVxpPKzWTN5IH7Irlz2EpQ":{"text":"There are certain expectations when dining out. First, one expects that the ingredients li","useful":0,"cool":0},"xJ9xaNu871zJx_Tp6HQXUg":{"text":"Found this place on a whim. We wanted a sit-down place away from the FQ madness. Basin's r","useful":0,"cool":0},"Iu9WDuA_XDjc77CcRuTLLA":{"text":"After a walking tour of the Garden District, we were just a little bit hungry but knew we ","useful":0,"cool":0},"uWuQF029YzTCIMwPKPdwKw":{"text":"Uninspired, overpriced, and underwhelming food. \n\nOfferings are not anything different fro","useful":5,"cool":0},"mODSIMOq2ATJM9nGMJkGnQ":{"text":"Had the fried oyster eggs benedict for brunch that was on special and started with the Cra","useful":0,"cool":0},"PdLXxLu3vZAcs5kozMRHzQ":{"text":"Simply the best happy hour in the city!  The fish tacos are epic.","useful":0,"cool":0},"rcz57iX_gnXfJwIZA8X7_w":{"text":"Best shrimp and grits in New Orleans! We also enjoyed the Jambalaya and Brussel sprouts. E","useful":0,"cool":0},"tgEPrz8NN2DsTW82wyV9kQ":{"text":"just stopped in for a few apps and can't really say that i was blown away by any means. i ","useful":3,"cool":0},"0ur3J8YMHkigbIOmkYhmXA":{"text":"Went here for happy hour (it was a Monday after 3pm): $0.50 raw oysters, $4 appetizers, $3","useful":0,"cool":0},"o2lUypOQEppTZb1jn0gY8g":{"text":"The Best Oysters I have had in my life. Hands down. So goood! \n\nThe food here is great, an","useful":0,"cool":0},"wV3tLV7ADGIWTBgr6UbX6Q":{"text":"My group absolutely loved all the food, including some long time Nola locals. We had the h","useful":0,"cool":0},"wMnxNjezcKUWJuNhw3L1rg":{"text":"Yellowfin tuna sandwich was cooked perfectly and the grits and fried catfish to die for!!!","useful":0,"cool":0},"bTN44uJtM_b9bjOWvddmeQ":{"text":"Not even one star.  It would be Zero stars if possible.  The seafood/lobster platter was i","useful":2,"cool":0},"xwFYJHzDh8FvQ9XQD0ZR-g":{"text":"Amazing food. Fabulous service thanks to Jeremy! Bottomless mimosas! Loved the shrip po-bo","useful":0,"cool":0},"rcpWJDdh27nhCxTMhHXUHA":{"text":"We gave a one star because of the disrespectful and immature female waitress. We came here","useful":0,"cool":0},"0aBPth-T5cONo3rejCotuw":{"text":"Yum yum yum! My first restaurant I tried in Nola. Ended up coming two times in 4 days! Eve","useful":0,"cool":0},"v5CVViI59mEGPoqcRYiIpg":{"text":"My friend said \"Crab & Crawfish Beignet\" and I was out the door in record time.\n\nIf you lo","useful":6,"cool":4},"yMuwEdW75a1a_NjzV0juMw":{"text":"Freshness of food, stellar cocktails and seafood. Great service. I would go out of my way ","useful":1,"cool":0},"_8re6ctfGBlnOL-KXAGepA":{"text":"5+ for food. Service was one star - surly and inattentive. Took over 20 minutes to get wat","useful":0,"cool":0},"rxmwSEp7W_UhvK8fGHujww":{"text":"This day was the final day in New Orleans so me and my friend wanted to try another seafoo","useful":1,"cool":0},"xOiMcSB70BvYLybyg3E60A":{"text":"The bartender was really nice and helpful. Our server...not so much. We stopped in for lun","useful":0,"cool":0},"ACh-MJvc182YjnVNpuCzZw":{"text":"I've been to Basin Seafood and Spirits several times since they opened last year but never","useful":2,"cool":0},"-0H6dt7PFj2sDYW69VxfUQ":{"text":"Based soley on the charbroiled oyster. Does not come anywhere close to Drago's. It's decen","useful":1,"cool":0},"S0u9ZIRp6Sc9bKOktYbhpQ":{"text":"Think this was our most satisfying meal during our stay in New Orleans. We happen to arriv","useful":0,"cool":0},"RjGOXnA3meVPXa25r3N1tA":{"text":"This is some of the best food I've had in New Orleans. 50 cent oysters on Monday - can't b","useful":0,"cool":0},"j-ajxokitKNk5BbQH9kS_w":{"text":"We stumbled in on happy hour. 50 cent oysters were amazing. Also tried boudin balls and cr","useful":0,"cool":0},"y9hLE9lFucLFTQJ72QL-_Q":{"text":"Nice place to stop by on Magazine Street for Happy Hour.  Today with it being lent, I got ","useful":0,"cool":0},"YMXVGe4nb0fBExEMBroa8A":{"text":"We went there on a very busy Fat Tuesday and had a great experience! \n\nThe dining room is ","useful":1,"cool":0},"tQqreyNTKAl7V8zacGyq4g":{"text":"Stopped for a quick lunch. It was great. I had boudin balls that were perfect and a shrimp","useful":0,"cool":0},"NyKsAbP9I-a9FratzlkXCQ":{"text":"Looking for a good Happy Hour? The restaurant provides a weekday happy hour menu from 3-7p","useful":0,"cool":0},"g770Tzh8lsxCwi2FqVjjyA":{"text":"I've noticed a lot of restaurants in new orleans have really high ratings,  even when they","useful":1,"cool":0},"xxJv_5P3BKJHGYGzlGnkBg":{"text":"Great shrimp and grits, fish taco was excellent and my bottomless mimosa was never empty!!","useful":0,"cool":0},"m4KlUFBtJveE6vXKOBlPhA":{"text":"So good. Food and drinks were great. We had a mix of brunch and lunch food. We liked the f","useful":0,"cool":0},"cTWzID6S4NB-73rJ9NUtFA":{"text":"Absolutely horrible service. We got very much ignored and talked down to for being college","useful":0,"cool":0},"mnYRMwTsVqU6dBoiR26p5w":{"text":"The food is not nearly good enough to make up for the terrible service! Our table of three","useful":1,"cool":0},"FvxxMkuEo7edwfpp13xADQ":{"text":"I was in town visiting the other day. Having not been to south Louisiana for seven years, ","useful":0,"cool":0},"sc7AsJQ6VvX-QeJ9TTss6w":{"text":"Stopped in on a Monday afternoon just in time for happy hour.  There's a good selection of","useful":0,"cool":0},"IBdO052DnVBDN1BEVy-3Rg":{"text":"Holy smokes! Beautiful oysters for $9/dozen,  unreal Brussels Sprouts, and the drinks ... ","useful":0,"cool":0},"f6mPy-sAjDk8YIIyuYfToQ":{"text":"I love this restaurant.  Last time I was in New Orleans I ate here 3 times (in a 5 day vis","useful":2,"cool":0},"QUn6X3q06z1wepaAtextuQ":{"text":"Food was great service was great the drinks were awesome customized try the burnt onion ai","useful":0,"cool":0},"py11QgD01lU3rCYt9gGShw":{"text":"I always pass up this place. I've gone to the neighboring restaurant several times. But my","useful":1,"cool":1},"TxWIEyyu4lNblWM4dBh9nA":{"text":"Went for the first time this week.  Had been wanting to try it for awhile, and was glad I ","useful":1,"cool":0},"yqUewAP7pTfkhsvH93nKtQ":{"text":"We love Basin. We live nearby so we often walk over. Enjoy sitting out on the sidewalk, my","useful":0,"cool":0},"o_DL0SzcTZht9Jvlw9wDzw":{"text":"Nice little spot to watch the Saints although the back patio is fairly small. The service ","useful":1,"cool":0},"rf4IMDIRMVCm26_Qh4Y0bQ":{"text":"This place has decent food but the service is absolutely awful. There was hardly anyone in","useful":0,"cool":0},"dtipPcjnLH15mW0KvcRbVQ":{"text":"I met up with friends at Basin recently for happy hour and was impressed. Got the beignets","useful":0,"cool":0},"lkHsgMxg9Is8FttoUGz4Og":{"text":"Hands down the best meal I ate while in New Orleans! The service wasn't great but definite","useful":0,"cool":0},"W48scApxuX-S5pss4UerOw":{"text":"Incredibly delicious! We came hungry and made it in time for the $4 menu. We tried several","useful":0,"cool":0},"SGL67qHEul7UxM0rgmfILA":{"text":"We just happened upon Basin when we were in NOLA a few months ago.  I guess it was lucky f","useful":0,"cool":0},"5dGn9eUyaEaSjDHdeu5jUQ":{"text":"The food and drinks were amazing, the atmosphere very comfortable. We split a dozen of eac","useful":0,"cool":0},"LN7aOeJ36MPJ50sxfWbYNw":{"text":"My first experience eating charbroiled oysters. They were phenomenal. It was a cuge space ","useful":0,"cool":0},"5EUho2KzuXnd7ROMfOKLQg":{"text":"Wow - come here on a Monday! Oyster special is amazing. We got the whole fish (yum) and it","useful":2,"cool":0},"FkAod8g2llTPDqpWlgyC3g":{"text":"The food is average , perhaps I already had some of best seafood in town at French Quarter","useful":0,"cool":0},"FNK1VlnbUbVFzKF2cvLQpA":{"text":"New magazine st restaurant with crawfish boil. Seems a bit over priced. Underwhelmed by so","useful":4,"cool":1},"-LP27hgCVPPIXXHgKeHOfQ":{"text":"Now this was a great spot!!!  Went here to meet a friend for dinner, local and great food.","useful":0,"cool":0},"_87XMXVeRpDBnuujl5ih8A":{"text":"This place is intimate, but has outdoor seating available. Me and my party went for brunch","useful":0,"cool":0},"vaOe44topDTihm-OFOqpig":{"text":"This place is the real deal.  Excellent food and excellent service.  Every single dish was","useful":0,"cool":0},"JOXi_fOnZy0gzd3k4lZOiw":{"text":"Shrimp and grits 10/10, charbroiled oysters 10/10, crawfish beignets, smoked salmon dip, a","useful":1,"cool":0},"GlYre0ONkiZ0WHwsKMmCaA":{"text":"This is our 4th night in New Orleans and our second night at Basin. Everything about this ","useful":0,"cool":0},"SaUyrg0xsfCSyG4ZfzzY6g":{"text":"Great service, great food. Ron was making great recommendations. Red fish grilled and riso","useful":0,"cool":0},"8KlDVlhZckJuicxw15Y0gQ":{"text":"DON'T WASTE YOUR TIME OR MONEY HERE. SO many better options for seafood in this city! I wi","useful":5,"cool":0},"UMO76mt9WZ0Evc9jUyzOEg":{"text":"Great good! Loved the dip and gumbo. Chargrilled Oysters were as good as acme! Saved us a ","useful":0,"cool":0},"WtEA5QZlWk617wGS5qbK4Q":{"text":"My husband has been telling me for years how good the food is in New Orleans is. This plac","useful":0,"cool":0},"ro9wmWTMl8mBvD1-KIB1Ew":{"text":"I love New Orleans and I love Magazine street restaurants.  Basin fit the bill to a T.  Gr","useful":0,"cool":0},"hel-JJO7CWtTvTYMsEdndQ":{"text":"Just came in for a quick snack. The crawfish Mac n cheese was incredible...wish I could've","useful":0,"cool":0},"NYqxpmC459BPcJln2qIqBg":{"text":"We were visiting New Orleans and wanted a taste of some real New Orleans fare. We came her","useful":0,"cool":0},"KqgZeXtnZ_ba_8OEvxsYAQ":{"text":"This place has a really nice ambiance, great wait staff, variety of menu items. I thought ","useful":0,"cool":0},"RKJcbiv43QNNTcN3D-Y5ig":{"text":"I spotted this place on the bus tour and had to go in. They have only fresh seafood and th","useful":0,"cool":0},"2qGthRJUz62ELSn71aXOXg":{"text":"Had visitors for the weekend and picked Basin to have Saturday lunch.  We had never been t","useful":2,"cool":0},"RL-hW_H5jp7Z-rImuXGpWA":{"text":"New Year's Eve 2015 was just another night at Basin, and I love that.\n\nWe had a reservatio","useful":4,"cool":4},"zkeAfP8OkLi9DiLcw-dJWw":{"text":"Went here on a food tour.... do yourself\nA favor a go here. The grapefruit vodka drink was","useful":0,"cool":0},"nUb-ciUb2ddwBtBosVrx7A":{"text":"You know. I really want to love this place but I didn't enjoy my meal. The .50 cent oyster","useful":0,"cool":0},"3UOHoYLisn3P1S_XCrhWCQ":{"text":"The crab and crawfish beignets are really good along with the crawfish mac and cheese","useful":0,"cool":0},"9XFV7vKkJVmaeh9LWHXXTg":{"text":"One of our neighborhood favorites.  Great selection of small plates, entrees and drinks.  ","useful":0,"cool":0},"u0N52p2VyWPfWo0nJrQ0wQ":{"text":"I've heard a lot about this place over the past couple of months and was eager to try it e","useful":1,"cool":0},"F3QyxWOdYQpg2s2eIj9ZtA":{"text":"Service was great. \nOctopus ceviche was refreshing. \nWhole fish was ok, just didn't have a","useful":0,"cool":0},"YXeayJPQ-y72HciE0bnoUA":{"text":"Terrible management, but good food. \nWent with a group of five, nice room, friendly waitre","useful":1,"cool":0},"25a0EW82Y-D-UDGt2t0GUQ":{"text":"Red royal and crawfish and crab beignet appetizers were delicious. Drinks: the \"Good Life\"","useful":0,"cool":0},"7eFONR37yoU-LFllON4z-Q":{"text":"Food was absolutely delicious! \n\nWe tried the half dozen oysters as a starter and they wer","useful":2,"cool":0},"O7FpZE4ThPJ0-PJHe4B4ag":{"text":"The place wasn't very busy, but extremely loud inside, like a bar. I assume it's building ","useful":0,"cool":0},"t7K2klSAKtfNV-zoNk6NTw":{"text":"The food was amazing, delicious with every bite better than the one before. However, our s","useful":0,"cool":0},"k0VNdJAwjB3IfAb8N6cRUw":{"text":"Basin is delicious, great food and great selection of beer and wine.  Outdoor seating to b","useful":1,"cool":0},"Bl3Qhzf6R8dMtIbhad3IIw":{"text":"This place sneaks up on you. Not that its unassuming.. Just that you don't realize how goo","useful":0,"cool":0},"RklVxWpfHXUXc_R4FwVOZw":{"text":"My cousin and I were the last two guests that arrived prior to closing on last Friday nigh","useful":0,"cool":0},"Vy_fTICSkljr6uCKwsD8iQ":{"text":"Basin is located on Magazine St - a nice area I suggest out-of-towners check out both duri","useful":0,"cool":0},"hFemvt0VqWjPdcz9F_MQSA":{"text":"New Yorker ventured to this cozy spot for some oysters. First of all, prices were amazing.","useful":1,"cool":0},"-zrXjFM06ax2CEtD20g4YA":{"text":"Food was delicious but it took FOREVER to arrive. Kitchen is so slow and disorganized. Pre","useful":0,"cool":0},"o0_rslJxBIE9d4YSYKB5Pg":{"text":"Stopped in today with a craving for oysters after a long day at work. Major bonus, it was ","useful":0,"cool":0},"bPs3polNmousj5QP2wuYew":{"text":"Great food and service. Fantastic bartender. Great local food at a fair price. Nice  place","useful":0,"cool":0},"mSybS-XE1peQqqrs6uywnQ":{"text":"Amazing oysters, jambalaya and gumbo...and we've had these dishes at quite a few places in","useful":1,"cool":0},"-tcKCUtdnOoNv-k9M1FmPw":{"text":"10:30 pm, Sat nite. laura lyn the waitress was great! The grilled red fish was SUPERB, cha","useful":0,"cool":0},"no9UTa7vZOj4P216sjlj4Q":{"text":"I revisited this restaurant recently and had a much better experience.  We sat outside on ","useful":0,"cool":0},"-y0ylniXb28N_y7Rw7QTNA":{"text":"Some of the best food I have ever eaten. Stumbled upon it and stopped in. Big portions and","useful":0,"cool":0},"d0bWcig6U5qYEsz5Bmj8-Q":{"text":"Staff was so patient with our party of thirty and our craziness. The chef contacted me per","useful":0,"cool":0},"he1C6Yrd4VAThdINzzGfng":{"text":"This place is so delish when it comes to seafood. I ate brunch here on my birthday and it ","useful":0,"cool":0},"Ypq_m6nm0xARXdu9E2VvXQ":{"text":"Stopped by Sunday for an afternoon snack of Crab and Crawfish beignets, oysters in half sh","useful":0,"cool":0},"-9JbIYbatCx9rLAV_mERLg":{"text":"Great food, Chef really knows his stuff.  Had the Crab Corn Bisque to start, the presentat","useful":0,"cool":0},"PuBqfmo4oyFERxKrzmKW4g":{"text":"The good:  great happy hour specials and 4 dollar appetizers.  We had the boudin balls and","useful":0,"cool":0},"B_bx3fvFxqBiMddp68HIGQ":{"text":"Great spot! My boyfriend, his daughter and I went here on Valentine's night for an impromp","useful":0,"cool":0},"zFecV4v2VVgH1AclsGuo2g":{"text":"This is a really fun menu.  I really appreciated all the many options with small plates, s","useful":2,"cool":3},"s1kuv60tCF6ppMsb35oeOg":{"text":"This restaurant was everything and more! A large group of us booked a brunch reservation w","useful":1,"cool":0},"2pdiuivX2MevoasjIGTUsg":{"text":"So far my favorite restaurant in New Orleans. The drinks were delicious, the entrees were ","useful":1,"cool":0},"pI50PbgPA2TaqZ4eiZSsaA":{"text":"My sister and I tried this place last night. The small plates that I had were all deliciou","useful":0,"cool":0},"wGpetdIhH_OWHSPYM5GW_A":{"text":"The charbroiled oysters were delicious. Fish tacos were also some of the best that I have ","useful":1,"cool":0},"X3U83uyuoqGdD8rOHvWQHA":{"text":"Everything was delicious. Chris, our server had great recommendations. We will definitely ","useful":0,"cool":0},"6ICTU3XMulc1bOsauBrGdA":{"text":"The atmosphere is calm and romantic, the service is friendly. But most importantly the foo","useful":0,"cool":0},"2Ht_yWA3zbDodKSkPMIpIg":{"text":"Food was the saving grace! To the point that I went and tipped the kitchen staff for their","useful":2,"cool":0},"8W6g6A_7h9PNqVUTjHd8GQ":{"text":"This place was good. I'd like to give it 3.5 stars (instead of 3) bc the crab & crawfish m","useful":0,"cool":0},"lKXBAEyJcMg5mL19SXkABg":{"text":"Absolutely everything from service to craft cocktails to each dish.....amazingly delicious","useful":1,"cool":0},"QB89GyAV7_BfVVFJbLjwBA":{"text":"This is where I go to get delicious, fresh seafood. It's always perfectly seasoned (and pr","useful":3,"cool":0},"uVWYkKhsxWfRR_zVba42Zg":{"text":"Came to new Orleans for the first time this weekend.  Walked from downtown to this restaur","useful":1,"cool":1},"MdBajPHiHtF0w6V71Lx-8w":{"text":"Shut your mouth and eat because that's all you'll want to do when you order the seafood gu","useful":0,"cool":0},"xqkaXfRFWavlKkkocH_gzg":{"text":"Really great place for lunch!\n\nI got the fried shrimp po'boy and it was super tasty! Beers","useful":0,"cool":0},"zAf9cRg8EjLciFvYdI-2-Q":{"text":"Awesome service, ambiance, and food. Next time I'm in New Orleans I'll definitely be back.","useful":0,"cool":0},"1JRh0MDODWhMSTxE_kfeDw":{"text":"The service was great. Out of all the plates we ordered, I would recommend the crawfish be","useful":0,"cool":0},"AJAu5XuP_PozFj80m1b2Kg":{"text":"The best chargrilled oysters I have had ( and my husband used to make them at a well know ","useful":0,"cool":0},"z9R5C-Ur2eS7ijQRngdi2w":{"text":"Sitting at the bar Monday the aroma of charbroiled oysters accompanied by crabmeat beignet","useful":0,"cool":0},"bdzRxTS0QVuoKDilLSdZuA":{"text":"Basin is truly a hidden gem in Nola's Garden District. The seafood and cocktail selections","useful":0,"cool":0},"q5iLuFxwuys-cknsh76a5w":{"text":"Come for bottomless brunch... Great food.... But whatever you do.... DONT sit outside if y","useful":0,"cool":0},"REJfr5Cz0cE4r922Nd1xuA":{"text":"Random find walking on Magazine St. Very impressed. 5 of us had dinner and everyone was ve","useful":0,"cool":0},"z7MxxsvFfUeWWyOBGIWC7Q":{"text":"I love this place! It's a total gem you could pass if not bouncing around. They have a gre","useful":0,"cool":0},"PsO5pd2Xd5mmTPUIekAKOA":{"text":"Cool vibe and very friendly bartender. We had some charbroiled oysters and they were ridic","useful":0,"cool":0},"viBhBp5oDY6yIzJMQBIKTA":{"text":"We have been loyal local supporters of this place since they opened-- and for awhile we we","useful":0,"cool":0},"GHdNNo-a-MMWhPWd4FwFAA":{"text":"Had great charbroiled oysters and seafood gumbo. Don't order pecan pie here it's a little ","useful":0,"cool":0},"FnUA8yA6qt2yz7sQomSuhg":{"text":"Went for Monday oyster happy hour. The oysters we're very fresh, clean and not sandy. The ","useful":1,"cool":0},"5J44pz5LXEqstJ2ffluleg":{"text":"Great flavor, great service, cocktails and desserts. The drum was outstanding. Super casua","useful":1,"cool":0},"VifWN8T9PQpr06yhlZmgLQ":{"text":"Delicious and wonderful service. Get the blue crab and crawfish beignets!!! We ended up ge","useful":0,"cool":0},"b4NyON90J9yU43StBVAj3w":{"text":"The staff is so nice and helpful. I called at 4:30 on Easter Sunday to see if they had a t","useful":0,"cool":0},"hwT8jAQ6wk4CeVwUKk3ksw":{"text":"Good charbroiled Oysters and great catfish and grits! Would definitely recommend this quai","useful":0,"cool":0},"fdbsrjmuLJrSdTxPLMnEqQ":{"text":"I don't know. It's been open since May and still seems to be finding it's footing. Our ser","useful":7,"cool":4},"A7pNrl-SRF_pZ7--u96stQ":{"text":"This is the 3rd time I am visiting NOLA since January 2016 and have, literally, eaten my w","useful":2,"cool":0},"IJ8e8U0Ba8E2GgRwsjDQKg":{"text":"My husband, daughter and I just finished yet another superb meal at Basin. I can now tell ","useful":0,"cool":0},"fYwHJcZjCK6fiAoyrzL9vQ":{"text":"Best meal I had while visiting New Orleans. The crawfish mac n cheese & oyster risotto was","useful":0,"cool":0},"Nzqew3JmE7X_At5kvIwViw":{"text":"French Toast- \n I was shocked when the plate was brought to me and it looked nothing that ","useful":0,"cool":0},"8H0aUABUaDxkvkQ1jAny-Q":{"text":"There are certain expectations when dining out. First, one expects that the ingredients li","useful":0,"cool":0},"p4zSoPJESfbApSMvYaquMw":{"text":"Whether you prefer to say \"bees knees\" or \"cat's pajamas,\" either is an appropriate descri","useful":0,"cool":0},"Mr79u7tH-veMOtkODLR8Ew":{"text":"We were there for Mother's Day and it was fabulous. Fried green tomato eggs Benedict was f","useful":0,"cool":0},"CQkdkZiOdgoZX6yjbdd6yQ":{"text":"We tried several small plates and shared some lunch entrees. Everything was delicious and ","useful":2,"cool":0},"WyQwXR-5OARuy0XUcsCZzw":{"text":"Cool little spot and I mean that literally. There is not a lot of space in here. It feels ","useful":1,"cool":0},"MjaNKXFKT567xHZQt2Azyw":{"text":"Come here alot and never been disappointed!  Love their crab cakes...bisque...pretty much ","useful":0,"cool":0},"5Pc8TsrEvqG6q0YKqtE45w":{"text":"The restaurant was not very inviting.  Service was polite, but not very friendly.  Beer is","useful":0,"cool":0},"crmut5NCkTuvW2-iowq3Lg":{"text":"This place was ok. VERY expensive and the food was mediocre.  There are several better pla","useful":1,"cool":0},"FjUHxwvpw6a_wb3gjcDkfg":{"text":"My wife and I came here in a Friday night for a chill evening with some good food and cock","useful":0,"cool":0},"dYy-brvnOEIwvYCYjAe_HA":{"text":"We came here one night after jazz fest. The food was great! We ordered oysters, fritters, ","useful":0,"cool":0},"ZkPhbVQn3XR0nyHsM86TEA":{"text":"Excellent happy hour that includes food and drinks until 7:00. They also do 50-cent oyster","useful":0,"cool":0},"JWED7b9MP56gR42a3WgSGw":{"text":"My husband and I love Basin! It's so good. I recommend getting the red snapper dip. you're","useful":0,"cool":0},"zMf33UojzcZtMvjZOAR4kw":{"text":"I've been to Basin several times since they've opened and every experience has been great.","useful":1,"cool":0},"-tT1OwM1TnW8Emt33X7UkA":{"text":"My husband and I were recommended this place by a New Orleans local who, like us, had grow","useful":3,"cool":2},"kk4HmOwPyhS10MjRDA-f_A":{"text":"Wonderful place for lunch. The charbroiled oysters were amazing with a great presentation.","useful":0,"cool":0},"QzGhk6-xqD1PtVA-QgXeGw":{"text":"Basin was great! I went with some friends and we started off with drinks. I had the Americ","useful":3,"cool":2},"dDeGkSvUYe0zTF1hBD14TQ":{"text":"We started here for Happy Hour, which has great deals at $4 local craft brews and $5 wines","useful":0,"cool":0},"G0RjFzeyn9dG08g0GSKFgw":{"text":"Fun spot for brunch! Drinks are delicious (and strong), eclectic mix of southern seafood i","useful":0,"cool":0},"zbMKfp_TJSxlMRTj0OZ-Ug":{"text":"I have had Hanger steak all over North America wile traveling for work the past 10 years, ","useful":1,"cool":0},"kx7cU_gcOqr9aG-Shl4xLA":{"text":"Oh my word! My wife and I took a tour of the Garden District then went on a walk. We just ","useful":0,"cool":0},"pDfFh5a2XHbL9ckCbHdyqg":{"text":"This is one of our favorite spots to dine in New Orleans. Food has been consistently excel","useful":0,"cool":0},"YilmIpBMBjo7kU5IKHxd8g":{"text":"Very good oysters and soup!!!! I loved this place and they have the best charbroiled oyste","useful":0,"cool":0},"PD_yATVuAblJFdpHU8i4TA":{"text":"During our 5 day stay in New Orleans, we ate at some of the best restaurants in the French","useful":0,"cool":0},"39NwwaR9g2yCFOYLxeWiGQ":{"text":"I had a pretty solid late-night meal here a couple weeks ago. After being at a bar around ","useful":1,"cool":0},"BCmp8SbDWjcuqXVPPfMP1w":{"text":"We were looking for a place to eat outside.  My companion wanted Rum House but we weren't ","useful":3,"cool":2},"gtdIK8InzXeIczNh22WPVg":{"text":"1:15 short of happy hour! Grrrrr. Amazing looking specials but we couldn't wait. Great win","useful":0,"cool":0},"cTJpWGOL9U2yaYnVxasJ2Q":{"text":"Basin is very good for brunch.  The food is awesome; the decor is jumbled up and average. ","useful":1,"cool":0},"7l0XVGULVAi9cb0L9MBT1Q":{"text":"This was a great find during our visit to NOLO. The waitstaff was the best and the fresh o","useful":0,"cool":0},"wK3YuVyMrqKV5tgwxs_tcQ":{"text":"Despite the staff's lackluster attitude (we nearly walked out the door after being ignored","useful":1,"cool":0},"Lho8do3C75TNyLzrRg1nwQ":{"text":"We went to this restaurant twice and tried a variety of dishes. They ranged from inedible ","useful":2,"cool":0},"QWvdOotq-M7SDH47INzPDg":{"text":"Best fish tacos in New Orleans, and since I'm from the west coast you can trust me on that","useful":0,"cool":0},"x7eJzeLX8HPU1Nn_5NzsJg":{"text":"Service Review \n- Came by on a Friday night, the restaurant was about half full. We asked ","useful":0,"cool":0},"Rq20Qa4boA-KPYIL322gGQ":{"text":"We just kind of came upon this place.  We were walking around Magazine Street when I saw t","useful":0,"cool":0},"oSj3xBMPs7qsjblWHqVbxQ":{"text":"I absolutely LOVE Basin!  It's a cozy seafood restaurant nestled in busiest area of Magazi","useful":3,"cool":0},"YL7m6vcpSlvLGK4XmqZJEg":{"text":"Food is delicious. Service is sub par. Restaurant was empty for lunch. Ordered catfish, an","useful":2,"cool":0},"mcD7iL-Jx9eest8k-dzIwQ":{"text":"Everything I had here was great!  The bartender made an excellent margarita.  The red shri","useful":0,"cool":0},"utFwXHS2gVf1cMF6SIyymQ":{"text":"We came here the Sunday after Thanksgiving around 7pm and were very surprised that the res","useful":0,"cool":0},"TeOVMjRN1X7_YeDPoEHDig":{"text":"Great find. I just randomly was wandering about the Garden District as an out of towner an","useful":0,"cool":0},"4SgpUYsBqsuAkBLD79QYAg":{"text":"I can't sing this place's praises loudly enough. Seared Yellow Fin Tuna sandwich and 2 doz","useful":0,"cool":0},"sdCJb9binSJ9LG-O0V4tKQ":{"text":"This was my third time eating at Basin and I am already looking forward to my next visit. ","useful":0,"cool":0},"NjW1D1LVRCLDA1CNL7yvXA":{"text":"We had a wonderful experience here on Sunday evening and it was due equal parts to our ama","useful":0,"cool":0},"nSW4Di3FssoNkQaSsxNd_g":{"text":"My husband I went here with friends for brunch to start our week long vacation. What a per","useful":0,"cool":0},"e-ybXKXF7KxKMLkMLoUL_A":{"text":"My fiance and I was here on Monday and had the raw oyster and it's was amazing. It's the b","useful":0,"cool":0},"b4xLV9BVgAQrL0scT7cQrQ":{"text":"Small street entrance, hard to locate among other restaurant neighbors. Several nice sidew","useful":1,"cool":0},"0_wYTFsZLXKdyFzT5uLHgA":{"text":"This review is regarding brunch:\nEverything from the blood Mary to the appetizers ($4 happ","useful":0,"cool":0},"GQmILEi3PQAR_CbduXsvdw":{"text":"I've gone here one other time previously, so I decided to give Mr. Chris another go. Not o","useful":0,"cool":0},"uJGryQY322euH6lhEnlN5Q":{"text":"The price of the food was extremely overpriced as far as the portions go. \nThe service was","useful":0,"cool":0},"EddS9eNM3d7J5X-ijh9y5g":{"text":"The Hanger Steak was cooked very well. Great experience and I would highly recommend. Serv","useful":0,"cool":0},"U4aDZRg5e7eloW_B2ZbA9A":{"text":"So this is my husband and my go to spot.  We always start the conversation when trying to ","useful":0,"cool":0},"7rpIRSc0rylQ5ByDv8gEcg":{"text":"I live in VA and enjoy visiting my boyfriend in NOLA, especially for the great food! We ha","useful":1,"cool":0},"OEbPBmg426jdEqpKGnzsRg":{"text":"Had cocktails and appetizers here yesterday afternoon. We had the NOLA Mule and Jackleberr","useful":0,"cool":0},"HkaZOLUYZpAIDznwmq9v8g":{"text":"We went for a Bachelorette Brunch with 13 girls. It was delicious! \n\nCute place with $14 b","useful":1,"cool":0},"oeJROytteTXUmNzk1vi3rQ":{"text":"The crab and crawfish beignets were delicious in the remoulade sauce! I had the Grilled Ma","useful":0,"cool":0},"yxyk_r7BNk1SDVziXryO0w":{"text":"Wonderful service. Great server.\n\nOrdered bottomless mimosas on Sunday brunch for $15.\n\nFo","useful":2,"cool":1},"5loXWrCizliarmZ5zS1g8g":{"text":"While we didn't enjoy a full meal here, the Brussels sprouts were really delicious and the","useful":1,"cool":0},"S9_AcKLJiNBLSfe5ACoHyg":{"text":"meh, oysters were ok. food in general little over-priced for the quality. same story with ","useful":0,"cool":0},"2_spttW35vfBz_eWKVYLwg":{"text":"Came here on Saturday around noon and were seated right away for brunch. We started off wi","useful":1,"cool":0},"DfXNEZGVijIr7hEA2GgGpA":{"text":"We came here twice in a four-day trip, and our return trip was after we went to Acme and r","useful":3,"cool":0},"E9F4QDljjKsveLUh7XtTyw":{"text":"I previously visited Basin with a friend for dinner and enjoyed the meal. I had a friend i","useful":0,"cool":0},"9-w201NS1GkM8wAFYUcsiA":{"text":"Went to Basin after a few pints at the NOLA tap room. We made our way through most of the ","useful":1,"cool":0},"xrE7M1KsMMh_id-mC8S_dA":{"text":"My go-to for fresh, perfectly cooked seafood that's not fried!!  They have a wide variety ","useful":1,"cool":1},"H8GdPxzCoeQovmAmSF7dxA":{"text":"After completing a lovely tour of the Garden District we found Basin on Yelp and walked in","useful":1,"cool":1},"aEh7BDQiot6zRxSZpzP9Rg":{"text":"Decent seafood restaurant. We got the smoked snapper dip to start. It was too smokey for m","useful":0,"cool":0},"s-kHJWZcwoICQZNUW-neng":{"text":"Solid seafood spot, super cute interior with wicker chairs.  Ordered the crab and shrimp b","useful":0,"cool":0},"t8NpCWTkd6SEd3aW6pkWQQ":{"text":"Great brunch spot, especially if you're looking for a place with little to no wait time. B","useful":2,"cool":0},"_v60LH9CZYN4dZf4wX8xnQ":{"text":"We ordered the charbroiled oysters and we ordered it again because they were fantastic. Th","useful":0,"cool":0},"-iW6iY9pCxAlydyL6YpmUA":{"text":"This was a pretty chill brunch spot in N.O. Menu not too complicated, bottomless mimosas w","useful":0,"cool":0},"s0FmHcfBc4Quqj4DmkaraA":{"text":"We were driving around New Orleans on Fat Tuesday looking for solace to eat that didn't ha","useful":0,"cool":0},"Ksf8YmkpA3vTw1uC0WFAfQ":{"text":"Was excited to have a local's secret for seafood uptown. \n\nI scheduled a preview dinner be","useful":0,"cool":0},"wpvbeOBCz8WxKsXrrPC-MA":{"text":"Absolutely everything from service to craft cocktails to each dish.....amazingly delicious","useful":1,"cool":1},"TjY7XC3uDlEB9_6HZ0nBxA":{"text":"After the 8 hour drive to NOLA we wanted something good for dinner and Basin delivered.\n\nT","useful":0,"cool":0},"3msp9i4kPYgZ05J89x39Vw":{"text":"Came here last night with my sister. Basin Seafood and Spirits is on Magazine Street, but ","useful":0,"cool":0},"4pEhXQOqxYcB_52_G4168w":{"text":"I don't even know where to begin with this glorious dining experience. To any foodie or an","useful":1,"cool":0},"4CYm2-maPnl-9XSsFnxhnQ":{"text":"Service was bomb!! We had the boudin balls and crab beignets. They were crispy, hot, and d","useful":2,"cool":0},"V0fpeyFsBIAk2vTwM7Q4rw":{"text":"Basin is a great addition to the restaurant scene in Nola. They have created a cool spot o","useful":0,"cool":0},"WRtJTOVfp2_s9MY2A4S-Ww":{"text":"Food is great, service is consistently below mediocre (bad by New Orleans standards). I've","useful":0,"cool":0},"2pdATF7WeLxUNHP6syLwYA":{"text":"Just popped in for oysters & left with 2 dozen oysters and some fried fish. It tasted incr","useful":1,"cool":1},"-lCFooCsl1Q01pDsRNQe8w":{"text":"Basin is unbelievable....you don't have to be a local to appreciate, but it helps. Frequen","useful":0,"cool":0},"5QZDBRvz20tyKeOTncNlZQ":{"text":"I must say the food is very good but everything is pricey. My wife had a bowl of Jambalaya","useful":0,"cool":0},"0smEjpCv05XByWyRIokz4Q":{"text":"Had a great lunch today with my coworkers. Everything we ordered was delicious. We had the","useful":0,"cool":0},"Mk64W_dXMZ_uz5YCwHA1sw":{"text":"We we came here right after happy hour and it was packed. Luckily there were some empty ba","useful":1,"cool":0},"05oGC9FXwbZveivckoAWTw":{"text":"Another big success on our week long NoLa Eating and Drinking tour. We did the Garden dist","useful":0,"cool":0},"SLRinArT8gT0_qDN9Sq4CA":{"text":"Dropped in this lovely little spot on Magazine St. with little knowledge beforehand - Pics","useful":0,"cool":0},"iZfeVUMdyVdSXNm7gRRqEQ":{"text":"We enjoyed a very tasty dinner here for Friday night date night. We ordered a few of the s","useful":0,"cool":0},"_gEI_B92lCVU-LmJ8BI5NA":{"text":"We stumbled upon this place after another spot had a 45 min wait on a Friday morning. Our ","useful":0,"cool":0},"ZvYR1l29pfof2GwjmSzb_g":{"text":"Very good food! Great cocktails! Friendly servers who ACTUALLY ENJOY THEIR JOB! It's a lit","useful":0,"cool":0},"-EP-jM0-KbEj4FutbxwuPw":{"text":"We went there for brunch.  Excellent people watching while sitting outside.  The crab and ","useful":2,"cool":1},"hLD9JPCGUOM56_dBBF7hfw":{"text":"Went here for a boozy brunch during my bachelorette weekend. I ordered the catfish poboy a","useful":1,"cool":1},"8Dfaw1-ST3bhUMOsr7lA9g":{"text":"Great find while we were in town. While there were big waits at all the other places we we","useful":0,"cool":0},"98A1R2KTWAzTgrsxiOvTAg":{"text":"The rue of the gumbo, as dark as the night\nThe salad, exquisite, the oysters, alright\nThe ","useful":1,"cool":1},"7iF_juy1xmUJXSp8TU4Oaw":{"text":"Excellent food.  Excellent service.  Very friendly wait staff.  Love the atmosphere, and o","useful":0,"cool":0},"zNxwr-r7ByonmBl3NrV8bQ":{"text":"I have been to Basin quite a few times. The food is consistent and absolutely delicious!! ","useful":1,"cool":0},"gB8JAm3MSMCdSPUthZn9eQ":{"text":"Oh my god, this is probably the best seafood restaurant in New Orleans! I had the redfish ","useful":1,"cool":1},"A09mbYn_FFLRIuGDwKJBqg":{"text":"Good, but not great. I think there are better choices in the area. \n\nVery simple....we wil","useful":1,"cool":0},"MM3mG54_ydnW6p_0jksGVg":{"text":"Best shrimp poboy (ask for remoulade sauce). I've had a lot of new orleans foos but its ni","useful":1,"cool":0},"sSYGQzkooePRkeWlGJEMUw":{"text":"Best grits I've ever had! My friend's crab risotto was great too. Dropped in for late dinn","useful":0,"cool":0},"rRUTzrwIpy1VV57e3nT6lg":{"text":"Food and service was friendly and delicious. It was pouring outside and we snuck in for a ","useful":0,"cool":0},"3bDUsWQxYDmMrVjvs232rA":{"text":"Excellent food with great service. I started out with appetizers, raw and char grilled oys","useful":0,"cool":0},"bRLBzfbH00gVhUGhh9FgUA":{"text":"This place was the highlight of our trip. We had the oysters raw and charbroiled and they ","useful":0,"cool":0},"DNN3C3K_8uMU_a6UMOD7cw":{"text":"The Ketel One cosmopolitan ($9) was neither sweet nor sour enough.  It tasted watery.  Smo","useful":0,"cool":0},"tqutabmTEwmvs7YqCpGA7A":{"text":"Very disappointed with the service. We came here before and loved it. On July 3rd We arriv","useful":0,"cool":0},"HXWwkkgCgVg1H87s81zVSA":{"text":"I was first introduced to this restaurant at a yelp elite party. I was very impressed with","useful":8,"cool":1},"rDnfICuRaV6-aIqBv7hc-Q":{"text":"GIGANTIC OYSTERS! This was our first dinner in NOLA.  We ordered 1 of everything from the ","useful":0,"cool":0},"-Lr1dwOwTUhbC35LFYhJYw":{"text":"Nice spot for a late lunch after shopping on Magazine Street.  Crab and crawfish beignets ","useful":0,"cool":0},"GWeQV1g-oDlqDq-MXg-N3g":{"text":"Came across this place while trying to find the best charbroiled oysters in New Orleans. I","useful":0,"cool":0},"bURcjUFK4Yi29xaS19O_XA":{"text":"This place is nice. It's definitely more for the drinks that anything else. I thought the ","useful":0,"cool":0},"wCVSMOQn7v0Joe8nNmjd_g":{"text":"Great restaurant. Food, service, and atmosphere were excellent. \n\nWe loved the charbroiled","useful":0,"cool":1},"1qr2vbL2odO8-KrDa54JNg":{"text":"Food was okay, but ridiculously overpriced and slow service. We even got charged to add ch","useful":0,"cool":0},"-LwmzxghuVDGlTufV8OEUw":{"text":"Honestly, wasn't too impressed with this place. The food was good, but the portion size wa","useful":0,"cool":0},"JlLxJ22ktNXrkgg5z6nhdA":{"text":"What a wonderful discovery on Magazine! We wandered in last night at 9:55, just before the","useful":2,"cool":1},"SBOYWKcIC2S90-bHP2278A":{"text":"Food was awesome the catfish was perfection but the service was a bit sub par could have d","useful":0,"cool":0},"a_epc9iPlK2QNohzGp5Aag":{"text":"This is by far one of my new favorite restaurants here in New Orleans.  I had lunch there ","useful":0,"cool":0},"qGt8A6p8eL7_hM6NjmSBoQ":{"text":"Started off the meal with very tasty Jalapeño infused Cucumber and Watermelon Margarita dr","useful":0,"cool":0},"oVduvgPMSpFrxBzirEDrIQ":{"text":"This is still one of my favorites on Magazine Street.  We went on a Monday and enjoyed 50 ","useful":1,"cool":1},"KUS75YC09tl7nf0Sq_Z-HA":{"text":"This was our first time at Basin Seafood & Spirits.  We saw it and thought it would be wor","useful":0,"cool":0},"VNl5S3F2INwm8cT-1n2FAw":{"text":"One of those neighborhood gems that's under-rated, casual with great price points, and yet","useful":1,"cool":1},"0ixPXhah5d_OL_P4bpxYGw":{"text":"Had my birthday dinner here and they were very accommodating when a couple of more friends","useful":0,"cool":0},"c-O7t5sYjlLAyFiysIN4Kg":{"text":"Bottomless Mimosas on Sundays! They kept my glass filled up the whole time so worth it. I ","useful":0,"cool":0},"hpcSc39DBlywZRKOPv6nKg":{"text":"They make their Daiquiri with fresh fruit. Loved the pork belly hash, and the fried chicke","useful":0,"cool":0},"5m_3cUlHhWD8tmzgpB-rRA":{"text":"A friend and I popped in here early this week. We just intended on a few drinks at the bar","useful":0,"cool":0},"4mDljS0Y6mk-AJ-YYzy7gA":{"text":"Hand muddled cocktails -hell yes!\nSeafood gumbo is spectacular! \nShrimp Remoulade - a must","useful":0,"cool":0},"zHnUfoDxd40aArNZ6B61mA":{"text":"This place was on our walk back to the hotel. We were hot and hungry and wanted to stop fo","useful":0,"cool":0},"Nwg7PKxSOUKynsawADRj6w":{"text":"Everything we had, from the grilled whole fish to the Royal Red Shrimp to the Chargrilled ","useful":2,"cool":0},"rAfGOa2Eio6rpoqz2FeU0w":{"text":"We stopped here for dinner on a drizzly Saturday, and ended up pleasantly surprised with t","useful":1,"cool":1},"hWe9WrKZKhkk3hM5nKmfww":{"text":"Walked down all the way on Magzine. I had fried cat fish. Great local seafood eating.","useful":0,"cool":0},"Z5BChpal3n-JwCkNq55EFg":{"text":"Came here with a girlfriend for lunch one day. Serious props on the charbroiled oysters th","useful":1,"cool":0},"BYX3EsAZH6egA8WNuu4E8Q":{"text":"Great food and drinks, out for a stroll and decided to stop in. Glad we did, amazing food!","useful":0,"cool":0},"jlITPTwEfvX80lQEcUwTkA":{"text":"Really enjoyed my lunch here. Went with a group and no complaints from anyone. I had the s","useful":0,"cool":0},"KhlHOwaC2RqFL6OEWYqQ-Q":{"text":"I was very unimpressed. The food wasn't terrible, but not good either. With so many good r","useful":3,"cool":2},"3cdUnjU5lI0esGIIfv8f4Q":{"text":"I live a few blocks away and am so happy that this restaurant is open! We've been here for","useful":0,"cool":0},"0-XGI_aSAC1U9CICWtn9Zg":{"text":"This place has some excellent food!!!  Butternut Squash risotto topped with crab meat, smo","useful":0,"cool":0},"af7ki0-11BuFykxkbK25-g":{"text":"Great food! The Seafood Beignets and Gumbo is excellent! I definitely will return soon!","useful":0,"cool":0},"oAB4Vz9TcL9DLK629_h0qw":{"text":"Stopped in for brunch on Saturday afternoon after a long Friday Night on Bourbon. The bott","useful":0,"cool":0},"HhSdUSKL41MjHsfABjytZQ":{"text":"Yum!! Shrimp remoulade and crawfish Mac and cheese is to die for!!! Drinks were really goo","useful":0,"cool":0},"0J_sV4YYwcRCRnhsbOYUug":{"text":"Basin Seafood is a great spot on a popular, but otherwise pretty bleak (food-wise), stretc","useful":0,"cool":0},"llfHz8L2HOjbARAfCSk1EA":{"text":"The second time I ate at Basin was just as delicious as the first. I've had a review sitti","useful":3,"cool":1},"d59js4hcVa6F7_OP79Tzwg":{"text":"Looking for some legit NOLA flavors in the garden district, we found ourselves at a nice o","useful":2,"cool":2},"YH0S1Hhcv1TFU1uaHYbm1A":{"text":"Such a fun brunch spot! Went with five friends for their bottomless mimosas. They were sup","useful":1,"cool":1},"2ARknH2tq6czl1eru600bQ":{"text":"Great stop for lunch!  Cold beer and tasty oysters!  Friendly and attentive staff. Oyster ","useful":0,"cool":0},"t963DRtyfJDEyP6bfOMmzg":{"text":"Lots of people seem to like this place but I just found it underwhelming. I thought the me","useful":1,"cool":0},"9ES1HG34X4T6hiaSUlQdiA":{"text":"OH. MY. GOODNESS. Some of the best food I've had in a while. I was in town for work and ha","useful":0,"cool":0},"rjRTkdDbMetqMYXNNm8sPg":{"text":"Absolutely amazing 5-star cocktails (that I'll be trying to replicate at home) -- and very","useful":0,"cool":0},"zja9KZtUZsj6IvS696jjCA":{"text":"My best friend and I went to Warehouse District in New Orleans for lunch/dinner.  We happe","useful":0,"cool":0},"eHuDJU5msF4JcR8qNrkJzg":{"text":"Went there during happy hour. Food was very delicious and service is fast and friendly. Wo","useful":0,"cool":0},"g5jjakcnwC0Tl-H4xuyDzA":{"text":"Begged the hubby to come here for the Monday raw oyster happy hour prior to going for dinn","useful":0,"cool":0},"fCP0rowtPwFowe_ipDeROQ":{"text":"Yum. Great happy hour. $4 for some incredibly tasty crab and crawfish beignets. Drink spec","useful":0,"cool":0},"9W-6sUKQzgDxmOcVPuyOCw":{"text":"I have patronized Basin Seafood & Spirits in the past. The food is always delicious and th","useful":0,"cool":0},"V-Z-ZgTbZvdncD5xrrg7KQ":{"text":"We stumbled upon this place with a table of 10 and they quickly sat us. Their drink menu i","useful":0,"cool":0},"IBR6KnFSuBk4gMwr7zHlog":{"text":"A slam dunk. Don't know what to have? Throw a dart at the menu and you will not lose! Grea","useful":3,"cool":1},"pm3cB9Scm-qRHt_xBKGWiQ":{"text":"Hubby and I had the best char broiled oysters we've ever had and the small plates were per","useful":0,"cool":0},"em84FUTE20oOnC13qC8RYQ":{"text":"Great place to eat, especially during happy hour.  We tried the raw oysters which were won","useful":0,"cool":0},"rRoiOtrGKg_cSTB8pbh6mA":{"text":"We went during happy hour (3-7 pm on weekdays) and got a DOZEN RAW OYSTERS for $6! The oys","useful":1,"cool":1},"GVA6V6f-Hf2Cb1GacTZgfg":{"text":"Came here for the 50 cent monday oysters. It was amazing! One of my favorite meals in new ","useful":0,"cool":0},"nVEz_FE4PlT-bdBQt8Necw":{"text":"Located in one of the busiest and prettiest streets on Magazine street I was fortunate to ","useful":1,"cool":1},"WUuaxBV06we3_Xr-gqc9AA":{"text":"The service from our waiter Teddy was fantastic! We enjoyed our experience immensely! Shri","useful":0,"cool":0},"JWqxI8IXFjN4A8zsAwHnZA":{"text":"Everything we ordered was delicious! The charbroiled oysters, pork and hash, chicken and w","useful":0,"cool":0},"3-w25vHUJU-wzPdYI8IMSw":{"text":"We were wonderfully surprised with this place.  Four of us ordered a lot of small plates a","useful":1,"cool":2},"46ztTK4VvCYsvzwCDQNB0Q":{"text":"The food was outstanding and the portions are generous. We ate several appetizers and move","useful":0,"cool":0},"LPBTmdN-ORHMPuQbJohKng":{"text":"This is my Covid-19 support local takeout review...chose Basin seafood this week because o","useful":1,"cool":1},"eWSVWqWBhVPtnuzZhPxasg":{"text":"My sweetie and I walked here for a quiet Sunday lunch and toddled home happy and well fed.","useful":9,"cool":3},"XrzxwohhitVLUDFURqbYFQ":{"text":"food was delicious. Very comfy environment. Food was served immediately. Highly recommend","useful":0,"cool":0},"Zeg8eZkGfqThvMiPBJ64UA":{"text":"After a long day at JazzFest I was looking for a good quick meal. I walked into Basin,sat ","useful":1,"cool":0},"HWUpg6bQMgG8NPsxKPXhtA":{"text":"I've been here two times now and each visit has been excellent. Food was awesome, and I ma","useful":0,"cool":0},"Pemhd75NXil43duABBDxdw":{"text":"Great location. Great ambiance. Service was just a tad above average. Ordered the char bro","useful":1,"cool":0},"mVOLrlTC9E9G5K9zMxcRvQ":{"text":"Great little spot in the garden district to stop and get a bite to eat.  They also have so","useful":0,"cool":0},"V_HtHMqT9pcjWG5LMfN5Lg":{"text":"Came here as we heard they have Royal Red shrimp which are to die for. Came at lunch and o","useful":1,"cool":1},"qYptcIyNHrYPb4D6bB2elw":{"text":"Came here on my vacation, everything was outstanding, we had the charbroiled oysters, octo","useful":0,"cool":0},"6jK2OfSsGcnf2o_Et0iuag":{"text":"Pretty good food terrible service. The waitress literally yelled and berated me in front o","useful":0,"cool":0},"wMu4HEaVMjgbCfPr_AvH_A":{"text":"I was very disappointed by Basin. The charbroiled oysters at $12 for a half dozen sounded ","useful":3,"cool":1},"CAoNlg-ReQGZ5BSwLBAtrw":{"text":"Amazing food, the food was fresh and it was the best oysters I ever had ! I highly recomme","useful":1,"cool":1},"_XQfOL3GEi7OFVcngRbVfA":{"text":"I've been here 4 or 5 times this year and each time feels better than the last! The food i","useful":0,"cool":0},"KA4zUVK-GAWyxlz4grbbrw":{"text":"We had THE best waiter when we visited on our last night in NOLA.  He was great - I think ","useful":1,"cool":0},"fp6s7_FgKhQzt15Oughjiw":{"text":"One of the best seafood restaurants in the town. Oysters were incredible. Mussel sauce was","useful":0,"cool":0},"EAPDiRwLhvcHOOdgrF0jXg":{"text":"I read the reviews and put this on my list of must eat places. Let me say Me and the wife ","useful":0,"cool":0},"OdjHL1RIQpJx4UCXdtRSGg":{"text":"Awesome spot. Amazing food and great service right on Magazine street. Our server EricK wa","useful":0,"cool":0},"6GKuLuuayHwnhylIwjq4Fg":{"text":"Let's talk about the chicken and waffles offered during brunch! These are the best chicken","useful":0,"cool":0},"yvG9XJI3qqKu6LmYhabQiw":{"text":"A friend and I were strolling magazine Street on a Sunday afternoon looking for something ","useful":0,"cool":0},"RRSaQL4u-Iur17mYNdfYAg":{"text":"Making my way down Magazine Street (which is one of my favorite areas so far in New Orlean","useful":1,"cool":1},"cTXXauUbSksjJzYFVw7WTA":{"text":"The good? Fresh and delicious oysters, both raw and chargrilled. Bloody Maries are made wi","useful":0,"cool":0},"IznIQqUG8T4C3bWQyO96gQ":{"text":"I knew I would love this place. It's been on my \"to try\" list for the longest. I have freq","useful":0,"cool":0},"yTi0nyPaM-dwQSn78FiNJg":{"text":"We ended up here when it was one of the only places we could get a day-of reservation on a","useful":0,"cool":0},"VoZIxU6pZPdp5CTr6oLPyQ":{"text":"We stopped in at Basin Seafood on Magazine Street for a late lunch today. I ordered Crawfi","useful":1,"cool":1},"VOoeHTm6_UX0Nqc4-0MWYA":{"text":"The huge oysters were delicious and the drinks were good.  As a bonus, the Golden State Wa","useful":0,"cool":0},"YJoloMUEhDrczgOei9PzMQ":{"text":"I came here on a Monday for their oyster happy hour with a group of ten people. They put u","useful":1,"cool":0},"BD_-Y7UCCfQ1gucI_3YPTg":{"text":"This was our 3rd time there and it was, as always, AMAZING. The charbroiled oysters were d","useful":0,"cool":0},"3Tv2juSBWzZTeQT434c9cQ":{"text":"Ambiance is not very warm. Outdoor seating a mess on broken sidewalk. Actually unsafe. Tab","useful":0,"cool":0},"YPQV2dKEnz8aTxXTr2k4MA":{"text":"Laid back and delicious. Bottomless mimosas. Char grilled oysters fantastic. They don't ru","useful":0,"cool":0},"UGOzLex-l8DTQ502VeJQAQ":{"text":"Was walking Magazine St looking for somewhere to rest and eat. We found Basin Seafood and ","useful":0,"cool":0},"2_BXVaeUcS2uHypNFAvhcQ":{"text":"Enjoyed stopping here on a food tour in NOLA.","useful":0,"cool":0},"jwUBUnaPv4faySNioJNJOg":{"text":"Exceptional food and mimosas. Off the beaten path from all the French Quarter hum drum-nes","useful":0,"cool":0},"b5HDRZPffuKQ9AQEKNDudQ":{"text":"Oysters with mignonette were stunning even though I'd been warned that oyster season wasn'","useful":0,"cool":0},"IYfkBrSNRJMqKeFJQ6nQZg":{"text":"We loved this place!  Friendly service, pleasant atmosphere and delicious appetizers and e","useful":0,"cool":0},"adxr86LFme6gJW3-XbVKcw":{"text":"What a gem. A hidden oasis of fine food, good drinks, and friendly people. The smoked snap","useful":0,"cool":0},"zb6wIRjKQuGkFNThxEupCw":{"text":"Came here for happy hour and ordered the Basin Cocktails. They weren't happy hour prices, ","useful":2,"cool":1},"LXdsgx7uhPD4wIhy06eH9A":{"text":"I was pleasantly surprised with Basin's happy hour! I usually expect the food to be medioc","useful":3,"cool":1},"_Pkp26ZoSS_7rFK7Obxf7A":{"text":"My friends and I were in NOLA on a 3 day trip and we visited this restaurant 3 times! Evey","useful":0,"cool":0},"D0g01QL5yB4F5a-ZiP-hug":{"text":"This is a seafood restaurant that occupies the same building as was used by a pizzeria (wh","useful":3,"cool":1},"ixNEvQsABPNDBGmhgAosdA":{"text":"Basin is a very underrated spot in a busy part of Magazine. The food here is always fresh ","useful":0,"cool":0},"xkWS-v5BlF7eF6wRZbFj2A":{"text":"This is was my first time dining here. We went on a Saturday afternoon and with no reserva","useful":0,"cool":0},"abDYvbnOhxz3BneinAVjPQ":{"text":"Definitely give this place a try.  The charbroiled oysters were top notch.  Tender and del","useful":0,"cool":0},"fR2DfWw6D3wUiRSpZQi8pg":{"text":"Decided to explore outside the the French Quarter and this local seafood restaurant in the","useful":0,"cool":0},"x7u6hI9VxmsUnD3S2s6tUw":{"text":"It's been a few years since we ate at Basin, but we had another great experience here this","useful":0,"cool":0},"9d5HbPaLavXk9yMqZ1ddfA":{"text":"Staff is amazing and so friendly! Love the vibe. Food is good, just needs a little more sp","useful":0,"cool":0},"pZJQcRzCVHn8qY5TXZ7iNA":{"text":"Service was slow.  The waiter was a nice guy but was not real attentive.  The food was goo","useful":0,"cool":0},"RoZaeFvHsVWvNrYdkJ-szw":{"text":"Crawfish mac and cheese and jambalaya were not to be believed. Also blackened snapper and ","useful":0,"cool":0},"hCeV4btODYI2Bceo67YRlQ":{"text":"Was looking for a spot close around work and stumbled upon this place. Had the perfect lun","useful":1,"cool":1},"h-oTFbVJPvxyhPw8zLt06g":{"text":"Considering I sat at the restaurant for an entire hour and only received our appetizers, e","useful":0,"cool":0},"2mJSx8vSK3ig3bnAkqKpCA":{"text":"After a full day of day drinking and shopping on Magazine Street we decided to stop at Bas","useful":2,"cool":0},"VUmp_bloThNnDlMq2byhIg":{"text":"The weather was pleasant, so we chose to enjoy the outside seating option. The staff and t","useful":2,"cool":1},"X1Pjx80g-kMlHqicVjNEag":{"text":"I've been here often. The food is always good, the oysters are outstanding, but the servic","useful":0,"cool":0},"lmcffp5Q_Q3cjTij8GDS1A":{"text":"Food is very good but it's too expensive.  You can get great food at a lower price elsewhe","useful":0,"cool":0},"pKr3UwdeoX2zzTnWGGgylw":{"text":"Delicious Cajun seafood with esoteric specials and great service from friendly staff. Auth","useful":0,"cool":0},"DzuPeCA1P1VPySfrmU8Dbw":{"text":"Great seafood, untouched by a fry batter,  in New Orleans usually isn't cheap. Enter Basin","useful":12,"cool":6},"zH-XOFMmBRPoKbQei-yM9w":{"text":"Had the Soft Shell Crab, it was fantastic. Wife had the seafood gumbo and Beet Salad with ","useful":0,"cool":0},"CB24-pYKpkvFK5iy9zSggQ":{"text":"Thank you Madeleine and Robb for giving me such a special evening at Basin. I arrived at a","useful":2,"cool":0},"xHkBB7CYnO9Pt3aipEWSCA":{"text":"An amazing meal shared with friends in the post quarantine time was made even better by th","useful":0,"cool":0},"cGRSBBazfozcxSqpo2jKuw":{"text":"When the in-laws were in town and I had 2 requests: gumbo and fried seafood.  I figured th","useful":1,"cool":1},"UJnOgEh-Vx-nBDAvV6lrhw":{"text":"My overall experience was pleasant at Basins.. The service was very friendly and upbeat an","useful":1,"cool":1},"M3JH-bsz7Ky2VWBGtDhJmA":{"text":"This was such a fun brunch! I had a group of friends visit, and choose this place solely o","useful":0,"cool":0},"j1iympoJuPF7vKtuRJJbfg":{"text":"All I needed to hear was $.50 oysters on Mondays.  We were coming in from L.A. to move our","useful":0,"cool":0},"vizosuhNEykLFxeDhSzS0A":{"text":"BOTTOMLESS MIMOSAS ARE AMAZING !!!! The raw oysters are soooo good and refreshing. It's su","useful":0,"cool":0},"_abODsUiRcwozvn2MWXTlw":{"text":"Great food and great service. Went here on a Sunday and was able to park on the street nea","useful":2,"cool":2},"xEnwGPcmjqypDNYKDpYJug":{"text":"It was my first time stopping by with my daughter & her boyfriend  both Airforce Doctors v","useful":0,"cool":0},"ct354bvxdZ53KqoFFRT7Lg":{"text":"This is absolutely the best restaurant in New Orleans!! Everything that we had was the bes","useful":0,"cool":0},"1BY5BS6nuoy4BycAXaxIfg":{"text":"This place was really close to five stars but for a few reasons:\n\n-the service was really ","useful":0,"cool":0},"YjRavMwqkBHiHDD535xoiA":{"text":"Love the customer service at this place. Cat is the sweetest person and she always take ca","useful":0,"cool":0},"5NqmTsu7rIdTVL0wGd5bRQ":{"text":"Amazing food. Probably one of the best meals we had in all of New Orleans. The crab beigne","useful":0,"cool":0},"g7KnHcsJ2-oSzfCUsTmQVA":{"text":"Excellent seafood spot. \n\nRaw oysters - delicious\nCharbroiled oysters - A+\nTuna tartare- e","useful":5,"cool":0},"vhO4Ziq-cOQUp-agNG-CtQ":{"text":"Always exceeding themselves! Nothing like taking something horrific, like this Pandemic, a","useful":0,"cool":0},"IXv7bvscLl6w3mQ-K3jUKw":{"text":"The best thing about a bad dining experience--you can cross that place off your list and N","useful":2,"cool":0},"ZvJ5dINrCdwj5M8l4J4_hg":{"text":"Wish we'd gone sooner! Excellent service and incredible food! I enjoyed my seafood gumbo a","useful":0,"cool":0},"BxK3kmLG4dK4KWvm5amRTw":{"text":"Came across Basin Seafood ro grab a drink and it's a cute seafood restaurant. Didn't eat f","useful":0,"cool":0},"KPTY84jjEA8QZB0SxAusUQ":{"text":"This place totally rocked! Turns out Monday night is 50 cent oyster night...pretty awesome","useful":0,"cool":0},"ShMh6EokCRNG1olLb8lP6Q":{"text":"We had reservations but got there early. The place was empty. We were seated and ordered d","useful":2,"cool":0},"YGgUqVBrpo_TPrjqJJN7Jw":{"text":"Walked in at 6 on a Sunday night, not a single soul in sight should have been evidence eno","useful":2,"cool":1},"acuGi63jRPnRImRWNcyafQ":{"text":"I wish I could really even write a review about the food, but they never ended up seating ","useful":0,"cool":0},"ajAWG8phLDCVTH8kQN_7mw":{"text":"This was my second visit to Basin Seafood & Spirits during Covid, and both times were memo","useful":3,"cool":3},"8ny3dDl_NrpdN-oqZIuD-A":{"text":"Talk about amazing! If you're in the garden district and looking for amazing cocktails and","useful":0,"cool":0},"tLO_HFB4UWmwo1R4SOxzSA":{"text":"Basin Seafood and Spirits is a cool spot to eat and honestly i believe they have better oy","useful":1,"cool":0},"p8jO6Yz6Dmd3P4ONb4Z3qQ":{"text":"By now, I've probably been to Basin about 7 or 8 times, and it's always consistently fanta","useful":0,"cool":0},"4zz8BX1koi9835kVg-g-MQ":{"text":"I was so pleased with the service, FOOD And friendly staff!!! THE FOOD!!!!!\nI will be back","useful":0,"cool":0},"0ZHlap-F79szBWEP_JO3CQ":{"text":"Second time here.  Had the muscles and wine sauce.  Also had oysters grilled and raw.  Muc","useful":0,"cool":1},"Td4b77dHJ2pFg3Je74rVYQ":{"text":"Great food! The smoked snapper dip is the bomb! The Cochon pork sliders are delicious...fi","useful":0,"cool":0},"gmmgpdb5_PQ3w02ySLU0PA":{"text":"This was a great early dinner after a hot day walking and drinking. This place has been on","useful":0,"cool":1},"dz6YrHxRWPjGwpyW7cNphA":{"text":"This place is an incredible gem on Magazine St. We came here for brunch during and got oys","useful":0,"cool":0},"AH-CYrR0s5qVtBDB-rT0Wg":{"text":"After church, I thought to myself, \"What better way to start my wholesome Sunday than with","useful":2,"cool":2},"iv2-gi0N86IjURbmy0dccQ":{"text":"~DELIGHTFUL LITTLE GEM OFF THE BEATEN PATH IN NOLA~\n\nWe found this place on Yelp and decid","useful":1,"cool":0},"29zT7FfkyhdsADsWXgeNnA":{"text":"Omgaaawd the food was to die for!! Biggest oysters we had in NOLA, best flavors, Crab beig","useful":0,"cool":0},"_U9sGsjYMbFWioc6Ikz0Ww":{"text":"Great service & even better food AND cocktails.  The crawfish Mac & cheese is outstanding.","useful":0,"cool":0},"1iEfsg7wDxkTyQWgyKT5JQ":{"text":"Some friends and I had eaten here once previously and it blew us away. The cocktails were ","useful":1,"cool":0},"DMWi3B7bZJxvLlLKkdmSJQ":{"text":"Stumbled on this restaurant on a Monday and found an amazing 50 cent oyster happy hour dea","useful":1,"cool":0},"wC8hcHkzVDZqidmZM4r4eA":{"text":"Char grilled oysters needed more char. The beignets needed more crisp. Busy place. Remoula","useful":0,"cool":0},"3cxpRjYnQzWh4SlGKMJMPg":{"text":"In town for the weekend and just popped in while walking along Magazine Street. The servic","useful":1,"cool":1},"ryImqdTMqdE9vOtTvuVUJw":{"text":"Amazing place!!  Bartender is very knowledgeable and friendly. Try the beignets they are a","useful":0,"cool":0},"b6v_5GNY3lsMX3S4f9CZBw":{"text":"Fantastic menu and even better service! One of the better bottomless brunches in Nola. Jer","useful":0,"cool":1},"HU3pFFpEGmekYrb95SAaNA":{"text":"Basin recently opened and we are regulars already.\nThe charbroiled oysters are great, as i","useful":2,"cool":1},"H8u-7spWamss0koneKAkCA":{"text":"Hubby and I were craving oysters so I logged on to Yelp in search of a HH that served oyst","useful":3,"cool":1},"Nux3u403hB6MZOwDeJk0mw":{"text":"I've had brunch here a couple of times now and it has never disappointed. My go to has alw","useful":1,"cool":1},"Eh-L2cHmtAVfkcYZBel2KQ":{"text":"Basin Saefood & Spirits is an amazing simple, small restaurant but please definitely GO!!!","useful":2,"cool":2},"xD0E3YGqQBOHUll_Rp6yNA":{"text":"My fiancé and I came here for brunch one Sunday before the Saints game. We got there right","useful":1,"cool":1},"JWgFVXD1wxMylsKclPLQJg":{"text":"NO NO NO \nshort staffed\ntook 30 min to get my first drink\nparty beside me did  not get the","useful":1,"cool":0},"e1cUK927YGNBsEghZmgWVQ":{"text":"When a friend visits it's a rule that Brunch is a must! After attempting a few places that","useful":0,"cool":0},"rS0xwoawfJUGgOA0-YYf4A":{"text":"Do not let this place fool you I looks are not 5 star but the service and the food are wor","useful":0,"cool":0},"8z44p-2Ve0omITJVYQoZ-w":{"text":"I have wanted to try this place since it opened and I finally did last night. Wish I would","useful":0,"cool":0},"e8d0W1K4M7UqvhaR5FZMWg":{"text":"My boyfriend and I are making a habit out of Wednesday HH at Basin, and we are loving it! ","useful":0,"cool":1},"WwhXHNiiSug7Tx8FyG7m-w":{"text":"Great spot on Magazine. Definitely make a reservation. We got lucky on a Saturday and grab","useful":0,"cool":0},"YkDQWIz2UROtWRUe4zSsVw":{"text":"Goodness where do I even start? They were rude and definitely not welcoming. \n\nI'm not ver","useful":1,"cool":0},"hT0GP116hGRDc8V03e4psg":{"text":"Top-notch service by Jennifer. After waiting over 15 minutes for a waiter at another nearb","useful":0,"cool":1},"ciMHcLz11iW_ylvM7boQdA":{"text":"Really enjoyed the food here. I'd love to come back once things have settled down a bit an","useful":0,"cool":0},"WcvIPKj3TfxSiz2n0KGiKg":{"text":"I decided it was time to play tourist on magazine street. Usually I just drive to wherever","useful":2,"cool":1},"NIJ5Uvt9jO9vxRS9egv4iw":{"text":"The food at Basin was delicious, and I regret having to leave an unfavorable review. Howev","useful":0,"cool":0},"Y8vPmE9PMz3BZrmDxVws3w":{"text":"Happy Hour is alone and well, (and HELLO Wine Wednesdays!), at Basin and tables are availa","useful":2,"cool":3},"tglgdkdPjeqTUGUixnjRUA":{"text":"Boudin was phenomenal!!  New cocktail menu was superb!  Highly recommend!!  5-Stars from m","useful":0,"cool":0},"bNA_mrYk9wfYQeP5uRm85g":{"text":"Looking forward to a simple yet tasty dinner in the garden district, came away disappointe","useful":0,"cool":0},"1-jDDN_x1DNdrybnHBC4KA":{"text":"Went there twice during our 3 day stay in New Orleans","useful":0,"cool":0},"mcxYVMUg_O022oJrd-2h5A":{"text":"My recent trip to Basin was on a Saturday for lunch, but I have been once before and loved","useful":1,"cool":1},"LcipncBNSzziq-8bg-XsJw":{"text":"Lovely restaurant. We stopped in after shopping on Magazine St. decided to sit outside and","useful":2,"cool":2},"PE-syBgZgYcz_zaYJ3IhTg":{"text":"I guess I just had high expectations for this meal. It wasn't bad, but the best part of ou","useful":2,"cool":1},"3EImQC87J5IjekqNUXIxAQ":{"text":"It's only been open for a few weeks and I recommend you add it to your list of  must try. ","useful":2,"cool":0},"SMiaeZ8AVUI60TtPf02r-A":{"text":"The best Oysters in this town. They are incredible the staff is great. Prices are reasonab","useful":0,"cool":0},"X6ySRWGRa9x9jSkCfJ_urQ":{"text":"So we were visiting from Dallas as we do two or three times a year we have family in town.","useful":0,"cool":0},"1MreUrSsMbWxUVKhp6P16Q":{"text":"It was a little past lunch and too close to dinner for a full meal so we needed a snack.  ","useful":5,"cool":2},"YEFisgXlY2XFJTjrm84C3Q":{"text":"This place was recommended to me in my neighborhood group, and it did not disappoint! It i","useful":2,"cool":0},"dmktPSHPPWtdGGWdczTQUw":{"text":"Not sure if there has been a change in management recently or what but Basin is typically ","useful":1,"cool":0},"qAXJPZVPDTZlVS4bnyOEug":{"text":"Great place for happy hour and 50 cent oysters. We hit the jackpot when we went because it","useful":3,"cool":2},"rSezbg_E-icRggrxIWEUbw":{"text":"Very disappointing! We ordered two oysters and they gave us two dozen. They took back one ","useful":1,"cool":0},"p05-lItG88Gj3sXzJkgFSg":{"text":"Well this was definitely a date night for the books full of delicious food, inventive drin","useful":0,"cool":0},"h7vK2vewZ9_kuQWwcvQoBg":{"text":"One of the best little restaurants in New Orleans.  The food is always great.  I highly re","useful":0,"cool":0},"WyuI0L_1tUFJhJf53Q3_xA":{"text":"QUITE POSSIBLY THE WORST SHRIMP PO'BOY \nin New Orleans, and it's outrageously expensive!\n\n","useful":8,"cool":4},"6cki0ua_VQhZO88p-5Or4Q":{"text":"I feel bad not giving more stars because the food was very good, however it took two hours","useful":0,"cool":0},"S8k1gZDYEp1XX5HVw2lsXg":{"text":"Made reservations for four for dinner. Service was great but food was mediocre and the pla","useful":0,"cool":0},"Ad6twe2Y_vw8gqRULx44WQ":{"text":"Went to Basin last night with family.  Arrived at 7:30pm and waited till 9:30 for our food","useful":0,"cool":0},"yzPKvAMk61r-VQ2T7ywTBw":{"text":"Oh my goodness!!!! The charbroiled oysters we hands down the most delicious oysters we've ","useful":1,"cool":1},"PGGCJc86FMHKoeDocZI0yw":{"text":"It's an okay place. We had a gift card and I am glad we did. The char-grilled oysters are ","useful":3,"cool":1},"HCQ9qwK9nePP5rDDhAyOAQ":{"text":"The food is eatable but not great.\nThe octopus ceviche lacked acidity and flavor. The baco","useful":4,"cool":3},"ZjmLCBT_OWzjK4ZNV76UEA":{"text":"Basin Seafood and Spirits is one of my favorite brunch spots! The entire restaurant sets t","useful":0,"cool":2},"0a-MUJmKYtK2yq0sIuJVwg":{"text":"An inventive menu and delicious food keep me coming back to Basin. The chargrilled oysters","useful":0,"cool":1}}