{"qB6c9Gd3Ngu7mAJT32ddKg":{"text":"Drinks are expensive. But parking was easy and seats were comfortable. I saw Bianca Del Ri","useful":1,"cool":0},"XVAN84rPaWQS7wsHAyiOnw":{"text":"This is one of the worst theater experiences I have EVER had.  After seeing shows in NYC, ","useful":1,"cool":0},"YmkY2vGN16NF8mjmbW92MQ":{"text":"One of the best city owned venues in America featuring a sound system that is second to no","useful":3,"cool":0},"1YgT17UwMZ8Fmlzcj_yRig":{"text":"Came here to watch my niece's dance recital and it was a great environment. This was my fi","useful":1,"cool":0},"RjjSgEkr1nok1uSy7OxTvQ":{"text":"First visit here, went to see South Pacific. The stage is quite small and not good for cha","useful":0,"cool":0},"K_Kafm2SvJ9M6em3zmk_WQ":{"text":"Watched my very first Broadway Production musical WICKED here and I love it. The theatre i","useful":0,"cool":0},"-BtldDgs6qpZMKw8WQJg3Q":{"text":"5.15.15\nThis is my first time visiting this theater. I am seeing the Louisiana Phil Harmon","useful":1,"cool":0},"39w1GX53LssvB1_8aw9jkA":{"text":"I recently saw Jersey Boys at the Mahalia Jackson Theatre. It was my first visit and I was","useful":5,"cool":1},"wltgO8JV2nNokL1-Pscaow":{"text":"We went to the Mahalia Jackson Theater for the Performing Arts last night to enjoy the 10t","useful":2,"cool":1},"wbfLCrfaDx8TOu0vaZyC7w":{"text":"I just love Mahalia Jackson Theater.  I was able to attend the Color Purple Musical and ha","useful":4,"cool":1},"PH_Ktk3F8k4VBr_WeH1XtQ":{"text":"Nice venue, seen two shows here, will be back next Spring for the Lion King","useful":0,"cool":0},"x3vZOJTPRxn9ksAH_V7-GA":{"text":"Second time here and I say romantic this time because I'm with the best guy getting ready ","useful":0,"cool":0},"9DvWSHQco-j97Sc5mUgo8g":{"text":"I go to the Mahalia Jackson Theater about a half dozen times in a year, either to see conc","useful":3,"cool":1},"mKSR2Ewe6wdWcUu4k6Wjsw":{"text":"We sat in the nose-bleed section, but this place is better than some of places I've been t","useful":0,"cool":0},"ajmSubVq7q9SO3k9XdqekA":{"text":"The Mahalia Jackson Theater is a great place to go for entertainment. I have season ticket","useful":1,"cool":1},"mf9x0Ni1B4MUMle1P65HdQ":{"text":"This theatre has been serving as New Orleans primary since Katrina. It has good acoustics ","useful":0,"cool":0},"bNVBTt3QVGyFYWXdzffw6A":{"text":"Came here for the Edward Sharp and the Magnetic Zeros. Super group  What a great place for","useful":1,"cool":0},"UU73axIRmiM_qtXb_qAx9A":{"text":"FYI - OnStar navigation has a heck of a time finding this place. The address listed on Yel","useful":9,"cool":7},"cP9FAybD5vqx_wwZ1CSuNA":{"text":"I came here for the all American rejects and boys like girls. Nice facility","useful":0,"cool":0},"SlLCuze24DIDGPtbiVzStw":{"text":"The Theater of the Performing Arts was your typical 1970s era venue...until the Katrina fl","useful":0,"cool":1},"2lvR1JSLlCmRMQy_-LXFqA":{"text":"I'm excited as the next local that the Theater is renovated and open again, but there are ","useful":4,"cool":0},"OfS7jxnwNltTQ3HPFhVhiw":{"text":"This place is an Oasis in a shady part of town. This theatre and its grounds are perfect s","useful":5,"cool":2},"5qKkIuunNEc8v7Pxaj8OQQ":{"text":"This is a beautiful venue. Not all seats are good.  We had obstructed view sears on the fa","useful":1,"cool":0},"9qZSxNVfFyrptYUMsFTaSQ":{"text":"BEAUTIFUL theater off of Rampart in the Quarter.\n\nThe focus is on large production shows.\n","useful":0,"cool":0},"x7hY0t03Ov-r8q6VpT4j5w":{"text":"The comedy show and the facility itself was great. The location is easily accessible and t","useful":1,"cool":0},"CTSczxiU6XJ9QroTQgZCBA":{"text":"Beautifully renovated as described by other reviewers.\n\nI went last night for the first ti","useful":2,"cool":2},"shH62Q08xW6UcgioupFKLw":{"text":"I wish I could give Mahalia Jackson Theater a better rating, but it just wouldn't fit. Thi","useful":5,"cool":3},"z7jpRzqXAesRRjxjKWBegQ":{"text":"Saw a comedy show there . Zero organization or anyone who could tell me whats going on wit","useful":2,"cool":0},"er_tqQCcI5tqjHuFvIymxA":{"text":"I recently had a chance to visit Mahalia Jackson for Cirque Dreams illumination. Its a bea","useful":1,"cool":1},"CdWjdU-xlw5BohbK4bqjTg":{"text":"The Mahalia Jackson Theater is surprisingly nice. If it were just my experience inside, it","useful":8,"cool":2},"OICbudWpjB4RyKL8HdVTJA":{"text":"My sister used to have her dance recitals at the Theater of the Performing arts during the","useful":0,"cool":0},"8vadfe5VvA_JEIleOLVquQ":{"text":"Hubby and I came to see Chris Tucker on November 30,2019 . The opening comedy was very fun","useful":0,"cool":0},"SCbJMvCmyhzYyQ-wNv9gkQ":{"text":"Our particular show was to start at 7:30 and the security line was still very long at 7:30","useful":1,"cool":0},"LlBCHEw1dNpL9ROsM-oEVw":{"text":"We have attended two shows here in the last couple of years - The Jersey Boys and the Ron ","useful":1,"cool":0},"c5daOVo7z5wL9Wpsdqziig":{"text":"The theater was extremely spacious. The acoustics were AMAZING. Clean bathrooms but there ","useful":1,"cool":0},"AILxaBmfMGs9lhOxNge2BA":{"text":"Great intimate theater with all excellent seats.  The sound moves and bounces nicely.","useful":0,"cool":0},"sou64UfXP1XuzBwUo1Eo5w":{"text":"Old school later 20th century stylings (so no awesome gold leaf anything, just glass, wood","useful":2,"cool":0},"FaBrEdYNs_cBppPFfJKH2g":{"text":"I've seen a great many shows here over the years, everything from local dance recitals, to","useful":5,"cool":1},"3KtbG1b5UDZD7Qdty6SiNA":{"text":"Wow. It's been 8 years since I reviewed this theater and I was an FTR back then! I must sa","useful":6,"cool":4},"lOUHXFp-EMRfG4n4aW3AhQ":{"text":"I have to say I've never been here until Broadway Across America started showing at this t","useful":2,"cool":0},"3J-JY3Xss59Nx3XsrCNTPw":{"text":"Mahalia Jackson is a great place to see a show, either a symphony or a concert.  I've been","useful":0,"cool":0},"DEVjSbW2tcBc6gvS67vxfA":{"text":"The venue is impeccable. Went to see the Lion King and seats were located on the upper bal","useful":1,"cool":1},"d0wTARD_q8CycE9yv61ZKg":{"text":"Attended Joe Rogan Strange times 2018 Tour. Enjoyed the show though it started 1/2 hour la","useful":1,"cool":0},"YH22kam_sbC2httBuBFxIg":{"text":"A lovely place to watch a play or musical. So far I've seen Wicked and Dear Evan Hansen he","useful":1,"cool":1},"zy6OSX7aY7yguTH3nBRy8Q":{"text":"Parking is  $10. Be aware this is in one of the most dangerous parts of town when walking ","useful":4,"cool":0},"6fbo_yS8OD9hHwNXFzGs0w":{"text":"Came here the other evening to see Louis C.K. and it was line central! A slow long line to","useful":4,"cool":2},"8NylI4543gdbSdYS4Zpm5g":{"text":"I visited the Mahalia Jackson theater for the first time when the  Saenger Theater was clo","useful":1,"cool":1},"a1wZh5AH2nTsuR__3jnvjg":{"text":"For a theatre I expected a little more. The reason I'm giving this review such low stars i","useful":1,"cool":0},"AUA-JVbyW1bLeRjFt88JzA":{"text":"I love this theater. This is the 1st one I went to here in New Orleans. I have not had a b","useful":10,"cool":10},"QnKzRT5ueDS382rygYUUlg":{"text":"This theatre has the worst sound system ever. This is the second show we've attended hardl","useful":0,"cool":0},"5RH_X8mVqjn38tHh__Z5Ww":{"text":"Wandered in on this venue quite by accident. This was a welcome surprise. The facility is ","useful":1,"cool":1},"CwcD21qNX74j_4yDmqut8A":{"text":"Returned to Mahalia to see the musical, Sweeny Todd, and everything went quite smoothly. N","useful":3,"cool":2},"6_z-vsWzEL6o5qcWsR26BQ":{"text":"Mahalia Jackson Theater is a great place to see a play, a concert, or dance groups.  Come ","useful":6,"cool":2},"xyXVfkcv7yUSdleNgGMk3Q":{"text":"My daughter's dance review is here every year. Nice theater in a not so nice part of the c","useful":3,"cool":4},"0v-qY_WCEWUambsMQh1r6w":{"text":"The Mahalia Jackson Theater was disappointing.  The seat room was uncomfortable with a lot","useful":3,"cool":2}}