{"iwncOGf2Q5305ovCCqk7eA":{"text":"Breakfast here is great and there's never a huge wait. The place has the feel of old time ","useful":0,"cool":0},"CtD_p7unDZTUfeQ7HDAAxg":{"text":"I went with the roast beast and a side of a chocolate milkshake. It was delicious and mess","useful":0,"cool":0},"Iz973CWc7erobrpXubUvGA":{"text":"C'mon, what did you expect - Commander's Palace? At least they sweep the floor once in a w","useful":0,"cool":2},"_Ldpvf8mcgpFh0x0vY4s0A":{"text":"Ted's Frostop is an excellent little burger place across Tulane's campus. While it is a ta","useful":0,"cool":0},"BQBuj0Iw9DU_uJg5CStUTw":{"text":"The Best Burgers in town. Love everything about this burger, and the bread it just PERFECT","useful":0,"cool":0},"RTXTB97XKaNmaX1dnoyBQg":{"text":"Awesome, cheap breakfast!  Just the way you want it.  Great for lunch too, lots to choose ","useful":0,"cool":0},"awU_cryyau30_ByyJrqtcQ":{"text":"My neighborhood burger joint. Fully revitalized and restored recently by new management. S","useful":0,"cool":0},"HkoK9YXNhhEHzDpIGoF8hQ":{"text":"As a fan of greasy-spoon diners that serve great burgers, I'd hoped that Frostop might be ","useful":3,"cool":1},"gviCDS5ybOrjkdOGxPw1fg":{"text":"I wanted this to be a fantastic greasy spoon with thick milkshakes and cheap, yummy burger","useful":3,"cool":0},"2CYpLYrWlEQRN2apawX0lQ":{"text":"Cheap greasy food and root beer floats, what more could you want?  There's the now upside ","useful":0,"cool":0},"fFXRz205b8fiju3VfbcWrg":{"text":"Amazing food! The best place in town to grab a burger for lunch. The staff is extremely fr","useful":0,"cool":0},"K6pnpCQAtfIDkBVdeLVwnA":{"text":"I like it.  Plain n' simple.\n\nMy brother-in-law isn't a fan - but I am.\n\nCame three times ","useful":3,"cool":2},"E3nPPlztFDva7CAaGxHHEA":{"text":"Best Root beer!!! We even walked 2 miles to get here! The burgers were good too! Small lit","useful":0,"cool":0},"HSqO6CRVkI1ONrV6JSya5A":{"text":"I want to compliment Ted's Frostop Diner for Excellent Service. Ted greets you as you come","useful":1,"cool":1},"y8Ab69Nnf0DXsa6jSXO6og":{"text":"Love the Lotto Burger; The Iconic \"upside down mug\" is great; but until they start serving","useful":0,"cool":0},"wtMlyNzI11RKw6Bn6aIhPA":{"text":"In the morning, I like to get an egg over easy on toast for like 2 bucks. If you come a fe","useful":4,"cool":3},"e_vCf8UtVKe8SJsohhrH_g":{"text":"If you want a greasy burger served on Bunny white bread, then this is the best ticket in t","useful":0,"cool":0},"JdOeSxxP6WaGZqlh6Qf3Iw":{"text":"The food is good, but their hours are ridiculous. Who ever heard of a burger joint not ope","useful":0,"cool":0},"wYkYY8TvmWJyVuj7RSfBZw":{"text":"Ted's Frostop: it evokes a feeling of nostalgia for days past, where neighborhood diners a","useful":0,"cool":0},"ZEgDN_gxpKkgP8AxeC6eDA":{"text":"We go here for the burgers and root beer, definitely not the service!  We've never had one","useful":1,"cool":0},"nbIYSxjXhlQz6QbQXSpz4Q":{"text":"I can't speak on the food as I came strictly for a root beer float to satisfy an intense p","useful":2,"cool":2},"3eQ9ehRWFExm2CEFaKzP8g":{"text":"Stopped in to Ted's before our weekly Thursday ride. It was a throwback experience. If you","useful":3,"cool":3},"cFBkeFmRU06t3ePwBoAirw":{"text":"I love a good burger joint and this one is great. I had an intense craving for a Frostop b","useful":2,"cool":2},"aQ8npD4_PD_emqrDFOGIDQ":{"text":"Ted's. What a place! From the moment to drove by it, I knew, that place is special! It was","useful":0,"cool":0},"2BAlSfAPKUaqzvHGalvEAg":{"text":"Call me crazy, but I REALLY like FroStop! Over the weekend I had a serious hankering for a","useful":2,"cool":2},"03nByyQgZ5urSdjnXeDWRQ":{"text":"I stopped in this morning for a quick breakfast with a friend. I ordered the grits and bac","useful":0,"cool":0},"kUcmOBG7EbqB1wvxEmKk8g":{"text":"We found this place from Roadside America. Stopped in and had breakfast and a root beer. T","useful":1,"cool":0},"KexHW-3KTbLuzWp6zl_Bbw":{"text":"It is what it is.\n\nI liked the kastleburger-- so sue me.  Small, cheap, delicious trashine","useful":3,"cool":2},"fGVc6NecmwA69vCFtDbnAg":{"text":"The wife and I had a chance to check this place out.  Apparently the wife used to frequent","useful":2,"cool":1},"hBf8xnvXAqwVYMxOo5JmlA":{"text":"Old-School Southern Burger. I forgot how much I love this place and the food, the burger w","useful":0,"cool":0},"_vm4KjTUBAbN7or3RwMgAw":{"text":"I'm the Duchess because this is my go-to burger place when I'm craving a burger at work. T","useful":9,"cool":7},"5m7vii1GHvUsaWAh_CncwQ":{"text":"Four stars for the atmosphere.\nFour stars for the food.\nThree stars for the price.\n\nThe at","useful":5,"cool":1},"5iCeYwZAMQCSN7559MvYLw":{"text":"Ted'a Frostop, is a throwback in more ways than I can count.\nGood Burgers, good fries, goo","useful":0,"cool":0},"jzew02d_TQC0kEcr1mPnSA":{"text":"This diner is located near my school so i come in here very often. I find that the staff i","useful":1,"cool":0},"ZsC06Q5WvQ7AUezkTU3HWA":{"text":"Cheap breakfast for 2.99, got some grits, eggs the way u want them and choice of bacon or ","useful":0,"cool":0},"AdivJQspnl2kD64RuUbs5Q":{"text":"Last month, I was running errands along Claiborne Ave and decided I deserved a Frostop bre","useful":4,"cool":3},"hLBZRrCCUOakhMXNjR30Bg":{"text":"the burger was pretty good the root beer float outstanding. just your old style car hop ty","useful":0,"cool":0},"YR31bVXitbhIc5DnfpnYyQ":{"text":"I enjoyed my burger and fries for $5.95.  The staff was friendly enough and the meal was h","useful":0,"cool":0},"4KjnZPkwHDc2FNjRKs8BDA":{"text":"The Pros: great atmosphere, fast service, takes NOLA Bucks for Tulane students, awesome ro","useful":0,"cool":0},"46VrvUpmaT_w3_uiIrywfQ":{"text":"We visited the recently renovated Ted's last weekend.  When I say renovated, I mean partly","useful":1,"cool":1},"W_gZ7PxyBAHnfO-5AVoz-w":{"text":"The burgers are delicious. I ordered two double lot-O-Burger fully dressed for $9.95 each ","useful":1,"cool":0},"tUhNwgk53EGio7bFsBU3eQ":{"text":"Very diverse menu, burgers, breakfast, meals like etoufee, po boys, etc.\n\nThey make a grea","useful":2,"cool":1},"J-V_usQsyv9E6QmUNQ0cjA":{"text":"I love this place.  Great food and specials on the weekdays.  Their breakfasts could rival","useful":0,"cool":0},"9cRMzRWPoYpX98lmVSWM9A":{"text":"Very clean old school place, with free pinball games. The food is above average, but the r","useful":0,"cool":0},"k83QXWQvtHTB-LfreLRP5Q":{"text":"I'm a dumb-ass for getting red beans & rice instead of an actual burger. \n\nIt was a Monday","useful":4,"cool":0},"yB2j3EhBjZD_YYU3e2Db7g":{"text":"I had a good hearty classic diner burger there a few days ago and the lady at the counter ","useful":0,"cool":0},"lCfv3Z_P3I9Mp6uU2bPleA":{"text":"Why 3 stars? \n\nI love to bring my little grandson here for Saturday breakfast before we he","useful":0,"cool":0},"0IoCnbQqWGnJL9D1tgPY8Q":{"text":"The burger here is among the best in the city. Nothing fancy, just quality ingredients pre","useful":0,"cool":0},"jcSww8ZT45zqOcs9Y7fxxA":{"text":"Awesome breakfast, great staff and not expensive.  My wife, son, and I frequent there whil","useful":0,"cool":0},"3S1R8ESkFDVwdn_4vEuOtA":{"text":"I like Ted's Frostop. It's a no frills yet friendly locals type of place. The workers know","useful":4,"cool":0},"qYZij8J2MkLMTRMQxUb5SQ":{"text":"Burger wasn't fully cooked but other than that everything was great. Great service, awesom","useful":0,"cool":0},"PN685jhfpQCff2akpY5lNg":{"text":"I love this place for the Lot-o burger and the castleburgers.  They're awesome and I drink","useful":1,"cool":1},"9xhj9EMn1PZiitB8a200Vg":{"text":"Honestly, I just... I dunno.  It's just... ugh.  If I didn't feel it was my duty to warn p","useful":4,"cool":2},"om1M3PQVT6yMMnPA8X7EPQ":{"text":"Welp. Where do I begin? Decided to stop here earlier today as I'm visiting NOLA and picked","useful":1,"cool":0},"Bz8I_hpM2f1lVUtKks1LHA":{"text":"Microwaved burger, mediocre fries, crappy (somewhat rude service). If I were looking for M","useful":3,"cool":0},"FeJ7AHK5N9sjQSYr3Oo6NQ":{"text":"This review is for a love that began on a Tuesday afternoon between my belly and a very sp","useful":5,"cool":2},"AASlZeiW3U7LlmvXTqMyYw":{"text":"Thought the Jr. Loto was quite tasty. Not gourmet, but what do you expect for $2.99. \n\nAnd","useful":0,"cool":2},"gqk3it-ol8dPu4dk6LO4TQ":{"text":"My bf grew up in NoLA and he used to come here with his family.  It is definitely a cute p","useful":2,"cool":1},"NFERKt6gX32nlL7-3vFb1g":{"text":"With all the new fancy burger joints in town the ol Frostop still stands out.  You can hav","useful":0,"cool":0},"dUneU5Deo-ghUcdc6yE5bA":{"text":"This was a hidden gem. Amazing burgers at just the right time. In the Mecca of food that N","useful":1,"cool":0},"0GSNEKZMHQebni9g_xwPJQ":{"text":"Breakfast was great!\nHubby has eggs sausage and potatoes. I\nHad eggs shrimp and grits whic","useful":1,"cool":0},"Vzmbhc9UQ92mDcXFbRZaHg":{"text":"Breakfast was great!\nHubby has eggs sausage and potatoes. I\nHad eggs shrimp and grits whic","useful":1,"cool":0},"kvLNHHg51nBcE0p7bzq2FQ":{"text":"Great place to eat. Really good burgers. Very friendly environment. Perfect before a Unive","useful":0,"cool":0},"dNv7kRhhS2oeynrQ4orKnQ":{"text":"This place is vintage diner all the way. Loved the atmosphere. The people working there we","useful":0,"cool":1},"XdekL2YS-o4mT4wj-16jXA":{"text":"This is one of those old school burger joints that create their amazing burgers with speci","useful":0,"cool":0},"i_Mi82GKvvRsUEq5D3Yghg":{"text":"Ted's Frostop has the best burgers in town hands down. The Double Lotto Burger is like a k","useful":0,"cool":0},"Ltkxi4uLRok9U0XnSMxBbQ":{"text":"Frostop serves good, solid food. It isn't gourmet, though, so you shouldn't expect a \"gril","useful":0,"cool":0},"NW8RnI3Rx61tix3avZ9ETg":{"text":"Always a great stop for anything on the menu. Still a great old school spot that I love co","useful":2,"cool":1},"rMHAWL27xhK3RsmtCj3oDg":{"text":"These people should close with the sorry attitude they have. The food is mediocre. I've tr","useful":0,"cool":0},"w516rmmzPCTyL6nozqp5Cg":{"text":"Ok so they have repaired and put the giant mug back up and it is once again working.  They","useful":3,"cool":2},"CAs39Wn8KfXrq4a-fauGDQ":{"text":"Very friendly and fast. Delicious burger! Love the rootbeer and cream soda. Great legacy o","useful":0,"cool":0},"t8tnqBodUe7QWp858CS1Fg":{"text":"Super great atmosphere, very close to Tulane. All of the workers were very kind and courte","useful":1,"cool":1},"JI9-gB8AYNrAdXAYPH01Qg":{"text":"This is my first time eating at Ted's. I sit at a table and the bus guy told me you had to","useful":1,"cool":0},"R-rkiOYfWrHYG19Li8nsDg":{"text":"Excellent burger and onions rings and a root beer of course ! . Terrific service . Cashier","useful":0,"cool":0},"lRMknKWN-lK2Y6GLOCkZmA":{"text":"Great people good food. You can't go wrong. Get a burger and a root beer, its the perfect ","useful":0,"cool":0},"ko5hTZwyS5BQ4c1m4DFRaw":{"text":"Sadly this formerly fantastic chain has been in a long slow decline and I believe this is ","useful":2,"cool":0},"I--XQau2QjuKniWx6cULow":{"text":"If you plan on going to a fast food joint for a kid's meal, don't. Frostop has great deals","useful":3,"cool":1},"ajy96RCnhnh5Nj3V98zXiQ":{"text":"Wouldn't change a thing!\n\nI agree that this is more a place of nostalgia than anything, bu","useful":2,"cool":1},"uvMrFNzLCeoXdUR1EZRRfA":{"text":"Only reason I came was because my friends dragged me here. Didn't go in with great expecta","useful":1,"cool":0},"b9XVC175c6qPWq5yEJ9z2A":{"text":"omg I love this place!! theyre down the street from me and they were actually open on Lund","useful":0,"cool":0},"MiNUz7xX6e_ZJ7pj1DBNbQ":{"text":"So Ted's Frostop has been chugging along for several years since my last review and they s","useful":4,"cool":3},"VjVsSQ3MErFV9l2VIkxp5g":{"text":"Great customer service! Burgers and fries were hot and fresh and prepared quickly. Very lo","useful":0,"cool":0},"QvsU_coKBxa4VLYrOJ3Krg":{"text":"Yall, the Lotta burger basket (with fries and a drink), is the best burger in town! Cooked","useful":0,"cool":0},"mOx6kP-bycRIEN8Y9cmZlg":{"text":"A POTEMKIN VILLAGE\nSure the front of the store is intriguingly retro and the post-Katrina ","useful":7,"cool":4},"DgNjnk_Hy5bXs22G_SQ9fg":{"text":"Oh yeah my at the register was so friendly man made you forget that it was busy\nI come wit","useful":0,"cool":0},"BovjhdCvl-0JtXfDkTL3JA":{"text":"Great fun for the family! Delicious food and super friendly staff! The nicest ladies. Lots","useful":1,"cool":1},"2maZDZNWbgHSXTO2T0CgmA":{"text":"Adding a star. Frostop isn't perfect, but it is very good. Great simple burger joint. Don'","useful":0,"cool":0},"iqEX9MygPdb3mobWKX_wPw":{"text":"Ok old fashioned burger and rootbeer place. Decent burgers good rootbeer. Outside seating ","useful":2,"cool":1},"h3w2lIhTy08rQL7nCDvVEQ":{"text":"good comfort food. fast. but not fast food. if the place is empty, they tend to give you f","useful":0,"cool":0},"1CCPUuyRujk7YC3jShDsbw":{"text":"there are many frostops, but this one is the best. the chatty old lady who takes your orde","useful":3,"cool":2},"Vw3JQ4PN4KppSrlbf-uqLg":{"text":"Really nice staff.. reminds you of \"old times\". Very clean. Offers lunches, red beans, sal","useful":0,"cool":0},"EnQDpwIMTjrB6P106FtEWw":{"text":"This is exactly what I want out of a diner. It was so so so tasty, and we sat outside at a","useful":1,"cool":1},"3ni2zFYGHYuWD3O7h9he-g":{"text":"The delicious burger I was craving today  was  tainted by the rudeness of the lady taking ","useful":1,"cool":0},"L2NZKCaL9-uV3SUwfPLOSQ":{"text":"Definitely best quality burger place in the city. Don't go anywhere else! Everything about","useful":1,"cool":1},"h44ApUWOuw6dwjovet6ZXA":{"text":"Great throwback diner. Fun atmosphere. Wonderful flat-top burgers and a mean frosty mug of","useful":1,"cool":0},"iATaB07n-5ssZQg-A34WEg":{"text":"Such a great find! This place took me back to the 60s with their retro themed diner. The m","useful":0,"cool":0},"dx94Sg2w9RdcmiuiMRzUMg":{"text":"Best bacon cheeseburger in town! I don't get anything else!! If you add fries it's a littl","useful":0,"cool":0},"TQzRFSA6UsOilLK0jYd6hA":{"text":"Step back in time to enjoy a Burger, Shake and some onion rings! Don't forget to treat you","useful":2,"cool":2},"XjtiPGMHcthSXcIbfHfxVQ":{"text":"I will admit frostop serves good breakfast. Yes there root beer is fantastic also.\nThe lun","useful":3,"cool":0},"Qj3Mj1dBqumZZYe9-w1VNw":{"text":"Burgers were spot on. Straight up old school flat top burger. Crisp lettuce, tomato, pickl","useful":0,"cool":0},"ZeL_rCe3fAU6rKJ5-0C95g":{"text":"Classic no-frills burger and Po boy joint.  Playing good southern diner music.  Video poke","useful":1,"cool":1}}