{"Ofjxsx1P2gRp9B8kQBbcaA":{"text":"Love this building. The Pimm's cup was really good. I also loved the bruschetta. The atmos","useful":0,"cool":0},"N2HWh3MzcYAbw3_GxRTv7g":{"text":"I was watching JFK and in the opening scene when the President gets shot, the main charact","useful":0,"cool":1},"uRCtFRvQoFimbKqD3ICRig":{"text":"Excellent local cuisine at very affordable prices.  Located in a building \nwith historical","useful":0,"cool":0},"gfk0K7NhNg7buE2A06V6-Q":{"text":"This is my favorite restaurant in New Orleans. When my friends/family come to town I alway","useful":0,"cool":0},"lHbHc0BGDdUiOGfqE4NNTg":{"text":"Love this place and come here every time I'm in New Orleans. I'm a big fan of sazeracs, an","useful":0,"cool":0},"UygNFj0nZFZV8c867VgkCQ":{"text":"Pretty damn good for NOLA. Menu is simple, but includes some excellent Italian fare, as we","useful":0,"cool":0},"DLHzN6PUow5RTQrRttcJLA":{"text":"We went here based on the recommendation of a friend who grew up in the area, and we were ","useful":0,"cool":0},"IuRayUo23FgeWjfm1cofDw":{"text":"In LOVE with Napoleon House.\n   Excellent Sazeracs. \n   Try the Corsican salad to start. O","useful":0,"cool":0},"z8jahtONUaTxYBX9N3k6gA":{"text":"As we walk up to this place, a guy in a horse drawn carriage yells to his tourists aboard,","useful":0,"cool":0},"77T42FA_mRdfFCqt9hKIow":{"text":"I can't remember our meal here too well. We split a muffaletta or however the hell you spe","useful":8,"cool":8},"-parGRCVLlemzF8uh-AdbQ":{"text":"The service was very friendly and the jambalaya was phenomenal. Decent local beer selectio","useful":0,"cool":0},"s6ist8Rj5eTCIxyWrFkq7g":{"text":"This place is one of my favorites.  I usually make it there at the end of my trip, so by t","useful":1,"cool":1},"Ax3sTMxPkoASuu1kRjPs-w":{"text":"The muffuletta is as good as described. It's meaty, warm and the bread is soft as can be. ","useful":0,"cool":0},"5hSH7gIYPxkHMgMldzkvhA":{"text":"Food and service were excellent! Great atmosphere. The hostess working the door on Monday,","useful":0,"cool":0},"I7ct2bRZI1Ni5uTLCFzIxw":{"text":"We walk down da street til we can't walk in dis heat no mo. We go inside dis joynt and gra","useful":1,"cool":0},"_zOA09I6gDGmpYVyo9dCJQ":{"text":"We popped in for a quick lunch. The muffuletta was great. I like it served warm. That's al","useful":0,"cool":0},"906xqRil5tYH7bwt5lc5WA":{"text":"Housed in a landmark building dating from 1797 that's rated among the most historically si","useful":2,"cool":2},"zfg4PmON5LMow7dX057WbQ":{"text":"We've been here twice. Good vegetarian options. Solid drink choices. Casual.  Friendly, we","useful":0,"cool":0},"KQ8j3tHWhvNU15RJDs6oLg":{"text":"While in NOLA for a conference I wanted to try a Muffeleta and Sazerac... and stumbled acr","useful":0,"cool":0},"QSF6cH56QABdwlKA3C2weQ":{"text":"The Pimms Cup had nothing on the Victory Bar (Central Business District) and the Cheese Pl","useful":2,"cool":0},"uNJhT8PStRSUFKvTwuHiYA":{"text":"My first impression of Napoleon's was ruined when I saw a mouse crawling about on the floo","useful":0,"cool":0},"AdSGejcrGWoG_0YebhQM2g":{"text":"First time I've been to NOLA and we went here for lunch. The service was awesome and the f","useful":0,"cool":1},"xdeoXAtpy7gF5W8dbJ3RKg":{"text":"I've been deciding if I should review Napoleon... All I had there was an Abita SOS and som","useful":0,"cool":0},"qmXMGc1E2oNQgFHsJv4d0Q":{"text":"Came for lunch and the food, service and ambiance was excellent.   We split a muffuletta, ","useful":0,"cool":0},"ta84TIKIv14swd49jZKPsA":{"text":"I love the inside and outside look of this place. We sat outside and our waiter was super ","useful":0,"cool":0},"l3LUJK9JIKPK6JuNSOVcSg":{"text":"Walking into Napoleon House on Halloween, with classical music filling the atmosphere and ","useful":1,"cool":1},"a8s2rzYBWYI_DcwCxDUmpA":{"text":"We were here for the muffuletta and it did not disappoint! We all agreed this was the best","useful":0,"cool":0},"hkFv5PHXGrj7GfzNq76crg":{"text":"Skip the food; you can eat better elsewhere for the same price. That's not the reason you ","useful":3,"cool":0},"eqgRz_T5mjjqWhpPzEv2-w":{"text":"Had the 1/2 muffilata and seafood gumbo. excellent my first time eating the muffilata and ","useful":0,"cool":0},"ZHYOXcB8wiRDg490sdlkUw":{"text":"This restaurant & bar is a New Orleans favorite, and I'm glad that I tried it for the firs","useful":0,"cool":0},"SPHzMaHMe8tX1qeBHcmNCA":{"text":"A friend of mine who grew up in New Orleans told me tales of his underage drinking and deb","useful":0,"cool":0},"kDXaqLJEqa3TKtpWeh7r2Q":{"text":"Design is nice but the food is regular that does not correspond to its price!!!we expected","useful":0,"cool":0},"01KhMspEiQZjS-tvjpRRdQ":{"text":"When you're picky eater says the muffuletta was the best thing he had the entire trip you ","useful":0,"cool":0},"aGslfvBJBsvqtewjPDCLyQ":{"text":"Napoleon house is one of those rare places that make one long to return to a city, just to","useful":0,"cool":1},"q445MaQqhVIhKipiNqTltw":{"text":"Meh. That pretty much sums it up. Nothing against the service or the delicious Pimm's cup,","useful":0,"cool":0},"4vBiyE2AVEIOhfH8Blo-2A":{"text":"alright, the pimm's cup is not as good as it used to be.  but you know what?  since i lear","useful":1,"cool":0},"NbsGmIBz63QfCwI8FJMO2Q":{"text":"Had my first Pimm's cup here on a history of the cocktail tour and it was great.  The buil","useful":0,"cool":0},"g369MYS-5CoPUbqHh4S4TQ":{"text":"Omg!! Best muffalettes ever!! I asked for extra toasty and it was perfect! One of the mana","useful":0,"cool":0},"KSTZRafxQ1IzauXfeN5QCA":{"text":"Pimms cup was refreshing and my wife enjoyed her bourbon milk punch...twice!  Excellent mu","useful":0,"cool":0},"pCPeQjtFv9yKJ5PL7nqoPQ":{"text":"I LOVE Muffaletta sandwiches but had never had one in NOLA, so upon coming here this past ","useful":0,"cool":1},"s3VnmqCoCspS28J791t9Vg":{"text":"Skip this place. While on our Honeymoon we ducked in to what looked like a fun place to ea","useful":0,"cool":0},"FewCy7xNFrTsZsuIPYQL4A":{"text":"Really frustrating experience here. Showed up around 6:10 and was told it would take 30 mi","useful":0,"cool":0},"JlikMUyqIVdLgAg7W9wRPQ":{"text":"Excellent muffulettas and pimms cup! Well priced, good food and euro ambiance made it a pe","useful":1,"cool":0},"R-uz4EPteXdZ5_TEEoB37g":{"text":"Mercy!  85 reviews and counting!  I'll try to keep this short.\n\nI've dined at Napoleon Hou","useful":2,"cool":2},"Rukwr5bTFvZNTYdIDgRvzA":{"text":"Napoleon House is our mandated first stop for on every trip to NOLA. It's become a traditi","useful":1,"cool":1},"aWzfDPSpkWhcq6T0eIWgtA":{"text":"We were told by locals to get the Muffalotta here. I will be thinking about that sandwich ","useful":0,"cool":0},"DzGu3MGW9J1BWsX4nHxpAw":{"text":"We stumbled on to this place as we walked the French Quarter looking for a lunch spot. It ","useful":1,"cool":1},"-iOg96OtqSUUYc1SnuiH0Q":{"text":"The food was amazing, the service was incredible and everything is at a reasonable price. ","useful":0,"cool":0},"dQd7rB3-GzFT8QUmaet8LQ":{"text":"I enjoyed spending a lazy afternoon sharing red beans and rice, and drinking a pimm's cup ","useful":0,"cool":0},"VJ09l4JiM2ursehWefIfOg":{"text":"what was excellent: Pimms cup - this is their specialty. it is good and worth coming to tr","useful":0,"cool":0},"W8bo3jA1j_hcEbMRMFOSaA":{"text":"My advice: Stop in for a drink, and leave. Sure, it's in a cool part of the Quarter, but t","useful":2,"cool":1},"J6PEFayC3_DVPBAlQGIXeQ":{"text":"This place is fantastic.  The bar oozes with history, the staff are fantastic, and you wil","useful":0,"cool":1},"_-lstyxrlO_fUPfupA-ZJg":{"text":"The muffeletta  and pimms cup drink were greet. However the service was horrible! The bart","useful":0,"cool":0},"Oks5y3QrVnX34wWtb5pzEA":{"text":"Ah, Pimm's Cups on the rainy July afternoon. This place was built for Napoleon himself but","useful":1,"cool":2},"52JxcR8DAPjFVHY_J1uSnA":{"text":"Fantastic ambience, pimms cups off the charts, good food especially the muffaletta. Not a ","useful":0,"cool":0},"AdGG56uc-iPLN1xiK8yzbg":{"text":"First time having a pimms cup. Awesome!","useful":0,"cool":0},"k917Ej0-Vk5_Ivc6mcKtzQ":{"text":"After a night of walking around New Orleans on a Haunted Tour, I was hungry. Napoleon hous","useful":0,"cool":0},"JcBCuDWuYB9m2GnO7t0QKw":{"text":"Very mediocre. Shrimp po boy was lacking on shrimp or any sauce, and the bread was stale a","useful":0,"cool":0},"pN9cm13h_SO_Qse57ql1uQ":{"text":"I must downgrade my initial rating. The staff completely ignored my coworker and her siste","useful":0,"cool":0},"3bx2MIqt3357RFbHBPfe1w":{"text":"We were directed to this establishment by both my cousin and our tour guide. I wasnt total","useful":0,"cool":1},"LNuFdMRblTk9tYvnsdq_fw":{"text":"Affordable for New Orleans and the Pimm Cup is soooo good!","useful":0,"cool":0},"t5tbkrRSlCbrRTvRPpfHGw":{"text":"Order the muffaletta. And a sazerac. That's what I did and I had one of the greatest meals","useful":0,"cool":0},"_4QFRLKynkhiRLDXaDgEag":{"text":"Stopped in for a Pimms and a muffuletta. They were both outstanding. The restaurant has a ","useful":0,"cool":0},"Y7QAHlNf1P-iGCo1ctv8Kw":{"text":"My lady friend and I, whilst wandering the area, chanced upon the Napoleon House a few day","useful":6,"cool":5},"SRwsgeHVl2nB0ggkCsZ-9Q":{"text":"The Pimms Cups at the Napolean house are probably the best in the US. The food isn't the b","useful":0,"cool":0},"UCZFbpFnd-f6XaIBWg153g":{"text":"My husband would probably give Napoleon's 4 stars for the architecture and history alone, ","useful":1,"cool":0},"8M6zIM8ILsRqtXy72Y-YTw":{"text":"Came here for the Muffaletta and it did not disappoint!\n\nThe building is really cool; old ","useful":1,"cool":1},"ZIGEk_11GI_kV9llaaRLLA":{"text":"Everything we ate there was fantastic. A perfect muffeletta. Delicious jambalaya and rice ","useful":0,"cool":0},"OmpJmOahXcMm5_DAS6B61Q":{"text":"Plus\n+Mario makes the best Bloody Mary's and Pimm's Cups on the planet\n+The muffuletta and","useful":0,"cool":0},"iFg-1a4B493vJWbq8TDV5g":{"text":"Best Muffalatta in the world!!! The place its vintage, which make you feel you are in the ","useful":0,"cool":0},"ZNavF2mGZbDjzZCJRZDifA":{"text":"One of the stops on our bike bar your was napoleons house for their famous pimms cup. It's","useful":0,"cool":0},"SGVLq2c94DTz1cl-Nm3n3g":{"text":"Walked in this afternoon with 17 high schoolers and 5 adults after flying into town from W","useful":0,"cool":0},"L95S0iHmO3pkAFEKqn82Jg":{"text":"you know, I really like the vibe and ambiance here - all the old crap on the walls, the wa","useful":0,"cool":0},"0jtAavGL6sQOrwHS9sz_Gw":{"text":"worst restuarant experience ever. we waited 20 minutes before anyone took our order. then ","useful":0,"cool":0},"fflcqBXoyz335Cs2Bsgwkw":{"text":"Having a great time with a big group of friends. Great atmosphere and drinks are flowing a","useful":1,"cool":0},"M5BQtzPxM8bloa7f8D1KMA":{"text":"We sat at the bar to grab a quick bite and drink and to get out of the rain.  So of course","useful":0,"cool":0},"9L01HmorHDBIoCglJF20Gg":{"text":"A perfectly toasted muffaletta filled my belly with much needed nurturing. This place had ","useful":0,"cool":0},"Zu4I1NwMaS9Fy6qOK-wITQ":{"text":"Great place to eat or get a drink in the city here are some more ideas to do for your visi","useful":0,"cool":0},"vNWnxNc7DqT6MBQ3_ZZXLQ":{"text":"My go-to spot to eat and drink in the quarter. This is the one place where locals come to ","useful":6,"cool":2},"KF8Zpacl-pX84vwoyKrR7w":{"text":"This was my first time to NOLA.  The atmosphere was superb.  The food was as great as the ","useful":0,"cool":0},"RQvIzb9tjY-eHepQPaiPGA":{"text":"The best part about this place was the atmosphere, followed by the service.  \n\nThe boudin ","useful":0,"cool":0},"z3nBrp8u9-Ymyln8a3gCbQ":{"text":"Absolutely eat here instead of Mosperos across the street! Everything about our visit was ","useful":0,"cool":0},"v7einwBz5BDqnDchbs3Cdw":{"text":"In our ever quest of finding new places to eat in New Orleans, we stumbled on a place call","useful":0,"cool":0},"lwsDJwG74Z74M1ak9awLzw":{"text":"We were only there for drinks but the waiter was so pleasant, accommodating, and attentive","useful":0,"cool":0},"jIuzJ8YECrlTKAusWg6F_g":{"text":"Had the best muffelatta sandwich here for lunch at a very decent price!! The serving sizes","useful":0,"cool":0},"4Q4xMo2Sd6eJD1iP2-RRdQ":{"text":"Cool atmosphere and nice patio seating. The history behind the building was awesome and th","useful":0,"cool":0},"lvRn2MDAS000H7BHHZwJKQ":{"text":"Today was my second visit to this place.  Yes, this is the place for a Pimm's Cup.  It is ","useful":0,"cool":0},"fFmhgXXT6s_muxaOpG7zow":{"text":"Their muffaletta -- quite simply the best sandwich I have ever had in my life.   I usually","useful":0,"cool":0},"5WmvKk80lfjUpC_5gzyHmg":{"text":"Great atmosphere for when you want to get a drink or an appetizer. The food was cold and n","useful":2,"cool":1},"XnRpvzsMDmTE4YOLDkLfAg":{"text":"We stumbled upon Napoleon House in a daze from the previous night's celebrations and libat","useful":0,"cool":0},"whCkk9eUQT8eDPjMijMGLA":{"text":"Rude and inhospitable.  That's how I would describe my experience at Napoleon House.  I gr","useful":3,"cool":0},"EVFir-oWjd5Yjb94IPdVJQ":{"text":"I stopped in here hungry for something authentic New Orleans and I got it.  I sat at the b","useful":0,"cool":0},"EuKXym1nyiBUyiwq_GCpVA":{"text":"What I like most is sitting outside in the garden and listening to the classical music fai","useful":0,"cool":0},"FzOwyrzTF4qBZ3wBtkRj8g":{"text":"Once again I stumbled on a place in NOLA. We were going to eat at Johnny's down the street","useful":0,"cool":0},"VqFrk2Of0Uu5qlSVhfK9Fw":{"text":"This was our first restaurant upon checking into our hotel. The front desk recommended Nap","useful":2,"cool":0},"xfgttyZ4sulgWoPQADcI0g":{"text":"I only have one complaint. I didn't eat here until my last day in town. I asked everyday a","useful":0,"cool":0},"sCMTjN-uJYvdOA8gI1Qx9Q":{"text":"I heard they had the best muffeleta and I had a half which is still pretty big. The bread ","useful":0,"cool":0},"H3jrIXStRxOYMIfaQQDePw":{"text":"We went there as part of a bar tour and the manager/bartender was so rude to us and our to","useful":0,"cool":0},"XKgoPHnQYovezrEkBU5LiA":{"text":"As an previous resident of NOLA and long time customer of this place I can't begin to tell","useful":0,"cool":0},"ztXP6J1ZNOnHSLBBNp4-Mw":{"text":"I doubt I can say anything more than the millions of words already said about this place. ","useful":0,"cool":0},"k9tY73sQrMFG0v16RB3CUA":{"text":"I'm sorry. \nI really am. But our once beloved place is gone. Went today to meet some frien","useful":4,"cool":1},"nVX2KI-a4c76KhaPtTngFA":{"text":"Jambalaya: yes. Muffuletta: no.\n\nThe jambalaya is great - savory and not too salty.  Good,","useful":0,"cool":0},"RnfM3tQZYkdZAqrge_jciw":{"text":"OMG. Best Muffuletta ever and get the margarita too. Decided Brennan's was too Foodie for ","useful":0,"cool":0},"b0c2KOBLxlTpcgYqCs7wRA":{"text":"The service and ambiance was good. We had a muffuletta and a shrimp po boy. They were both","useful":0,"cool":0},"9ark30Mii4PauZh0zdH1Gg":{"text":"This is gloriously anti-Bourbon Street. Dark and cool on the hottest days, classical music","useful":2,"cool":2},"DMgZaDwJD-FPqD-jenpcjQ":{"text":"Love this place.   So much charm.\nThe Pimms cup is like no other since they\nMake their own","useful":1,"cool":0},"20h8P6XwoRrylMTGHOlApg":{"text":"Honestly if I lived here, this would be my hangout spot. Delicious drinks moderately price","useful":0,"cool":0},"1wR8qEebc1HMNFU0erexHQ":{"text":"A friend of mine commented, as we sat on the charming patio here, with crumbling plaster o","useful":2,"cool":1},"lZ0SEjjODtShg1jR4jtZpQ":{"text":"Good tastes authentic, homemade and fresh. Louisiana Pesto Pasta Salad was a little hard (","useful":0,"cool":0},"nuUGHjOKEhvw9r-PDU--Xw":{"text":"After dining at KPaul's, you can go across the street to the Napoleon House for a nightcap","useful":1,"cool":0},"Z0z-csnmTUicHjWCfhaD6g":{"text":"Still one of my favorite places. Cool on the inside. Looks fancy without fancy prices.  Th","useful":1,"cool":0},"2zluIn9WEH1KTxXVolGL6A":{"text":"We all had the big Poboy and it was delicious.  The service is great also.  You ha e to tr","useful":0,"cool":0},"x8QHnjji_BSOO7kt3phDDg":{"text":"We met a couple and has some drinks with them one afternoon and they absolutely raved abou","useful":0,"cool":0},"dT6di4vIb5qqfihjhwCUDw":{"text":"Best muffuletta I've ever had. Then again it was my first time have muffuletta. This was a","useful":0,"cool":0},"GapPxIc4_yDEWRdCykMukA":{"text":"My first ever Pimm's Cup was here and because of that this place will always hold a specia","useful":0,"cool":0},"HO0hHUVHifHGTlKFZEa_Ag":{"text":"I came for your pimms cup and left a happy man, the waiter who served us was great. He tol","useful":0,"cool":0},"ON7yK0gLs8X4fvZAcBFQEg":{"text":"What a disappointing experience my last visit to Napoleon House was. Although the muffalet","useful":0,"cool":0},"8J2yfu-9E3WtWPfDV8KGjg":{"text":"silverware was dirty and we asked the waiter to change it. He gave us a look and brought a","useful":1,"cool":0},"9a8oAdj4FRtLdHAr2BFXoA":{"text":"Great food and drinks !!! Great service!!!  Had shrimp po boy and mufflletta , servings ar","useful":0,"cool":0},"ukLKJ4fdxIU8YCfXLadl5Q":{"text":"If you're looking for history and class in New Orleans, this is definitely a good spot to ","useful":0,"cool":0},"QYspIo9I-96nclia6XHtdA":{"text":"My review is only for the sazerac the bartender mixed for me. Stopped in for drinks only. ","useful":0,"cool":0},"kBKusY-HC7fG6Aq2S1LcCw":{"text":"Not much more can be said about this place...\n\nThe bartender (avec moustache) makes one of","useful":1,"cool":1},"T2rd1xSascXacEfNxNGTBg":{"text":"Nice atmosphere and a great place to dine. Prices are reasonable and the wait staff if rea","useful":0,"cool":0},"jKo3hNRHekY7TE6lVtp_ew":{"text":"Sit in the doorway. Or the courtyard - both are amazing. Tasty red beans and rice for lunc","useful":0,"cool":0},"qkYNbAUUvnGk0ewuFmWyOg":{"text":"Great pimm drinks!  And more than just the usual. \nThe muffuletta was excellent. Served wa","useful":0,"cool":0},"SHlRlryKfsNhbcwYCaor2w":{"text":"This is a great place to have a cocktail in the French Quarter. The service is great. Drin","useful":0,"cool":0},"dZ0LPAAslRWxbaLfc9qprg":{"text":"This little gem was recommended to us, and we could not have been more delighted. If you g","useful":1,"cool":1},"T1W_JMXouXlDlh6VMMPfKw":{"text":"Delightful. Excellent drinks. Relaxing, historical, quiet inner courtyard. Delicious muffa","useful":0,"cool":0},"GdZ3qnDyV6-_uLWRpR2xYg":{"text":"Stopped in here and tried the muffeleta.  It was pretty good. I would give more stars but ","useful":0,"cool":0},"W2q_ESzIU5FxDyyI17y63w":{"text":"After doing some research on where to buy the best muffuletta in town, we settled on Napol","useful":0,"cool":0},"Zfz-s_N_LqkWjEWeGc925g":{"text":"Walked around the French Quarter for the first few hours of being here and was told to vis","useful":0,"cool":0},"vVPnSdgllvPOwCtPNoeTFQ":{"text":"Muffaletta is yummy goodness.  Eat it while it's hot because the bread gets too hard when ","useful":0,"cool":0},"pr_D-pEKynViTCTl0a1eUQ":{"text":"A historical place in the French Quarters.  Food was good but more on the average side.","useful":0,"cool":0},"Oele6LHe7jS8WOsZBdwleQ":{"text":"I was seated in the patio area, I recommend you ask for it especially if you are on a date","useful":1,"cool":0},"pfhc3BdxWxQfBlhDuuUh6g":{"text":"We checked in on Facebook to Crescent City Books after just arriving in NOLA around 1 p.m.","useful":0,"cool":1},"8GohX6aDX-BuZQCALZ4T_A":{"text":"I decided to check out this cool historic little joint for my first drinking and dining ex","useful":1,"cool":0},"q3mScDATQurJU9LGbPfDhQ":{"text":"Rich history.  Great staff.  Great selection of alcohol.  Classy look.  Love the patio.  T","useful":0,"cool":0},"D1i519H5W53SWmwW4c--tQ":{"text":"The end of a 25 year plus love affair.  I've been visiting NOLA almost yearly since the 19","useful":1,"cool":0},"oZJSs-KljgYdllAsxXcPdQ":{"text":"Pimms cup! Not underrated! Highly recommend. All other food was average. Service was a lit","useful":0,"cool":0},"D6S449BqAcYrWrInExx3QA":{"text":"Awful place. The bartender told me they already did last call but kept serving hipster reg","useful":1,"cool":1},"8c_jIfrBB2N9qmD1GZdu8A":{"text":"love the interior/atmosphere.  waiter not so knowledgeable-couldn't tell us about the chee","useful":0,"cool":0},"fs_3dC7QttZNmQpIIReoVA":{"text":"I'm sure this old, beautiful bar has more to offer than an Italian Po-Boy, but that's what","useful":0,"cool":0},"cngED5IZN1gvcAkbRWyWmw":{"text":"It was great service and the atmosphere in the courtyard was lovely. If you get anything h","useful":0,"cool":0},"RjKs6cjBVEl00pEn1iN8Sg":{"text":"Best Muffaletta in New Orleans. The building and restaurant are very historic = read about","useful":0,"cool":0},"rFzs7aOjCQmY_IbCTAeexg":{"text":"So much history, I just want to sit in it all day. Enjoy it for what it is, a great piece ","useful":0,"cool":0},"rIWuduWv5e7CytFlcMhtIw":{"text":"Napoleon House- Since 1791, This wonderfully historic bar and light eatery looks like it i","useful":4,"cool":2},"O19cd5ZdhS1OhO3S9WEeig":{"text":"I want to start by saying I love the food at Napoleon House. I really do. Like a lot. I wo","useful":0,"cool":0},"ol8zXuKc50S5KA94EIPhNw":{"text":"Wow wow. First off this places atmosphere was fantastic. Beautiful old house, with classic","useful":0,"cool":0},"2ubyOZJOs_OE9h6txbUDFA":{"text":"If you want a muffuletta, come here, not Central Grocery. \n\nWhy? The muffulettas here are ","useful":0,"cool":0},"qsJIicB1IGYNwXw-AdJHBg":{"text":"My husband and I went here for drinks and I tried the Pims cup which was very good and ref","useful":0,"cool":0},"TUQpGmA1WkSCa4NQ1wz1jw":{"text":"This is the place that lays claim to popularizing the Pimms Cup cocktail in the United Sta","useful":0,"cool":0},"qh6_QiO71m1ibFml-ZIcpA":{"text":"We had a group of 13 that went here last night for dinner.  I live in Houston, but grew up","useful":2,"cool":0},"qQbJ9GTUkJMCh5kZECBocw":{"text":"on the expensive side but the Pimms cup cocktail was great.  I like my food and the waiter","useful":0,"cool":0},"LjYImbRp-SpDp-WX-o-F7g":{"text":"Tasty Tasty Pimm's Cup and it wasn't made by Mario so I really wanna go back and try one m","useful":1,"cool":2},"bMVwn3RWylNyoHymf7oypA":{"text":"The food was fine, but our waiter was inattentive and distracted. I am not sure if he was ","useful":0,"cool":0},"2tz4ISNtEHQKi7Jr2ZzJIQ":{"text":"Read about this first on Lonely Planet as a recommended lunch spot. \nWe came for a late lu","useful":0,"cool":0},"yI1e5hsuFVzxdXIuO3X3XA":{"text":"The building is undergoing external renovations, so you might miss it and walk right by.\n\n","useful":0,"cool":0},"6fTCPlNvFLdagfDYO2HDqw":{"text":"We only went in here for drinks.  The bartender was very nice.  We also got a cheese platt","useful":0,"cool":0},"_7aeg5w7l3eY2va3FKqO8Q":{"text":"i simply LOVE this place.  their pimm's cup is THE thing to get, especially on a rainy day","useful":2,"cool":1},"cd9EshmG0SDXHIiv-t_IVw":{"text":"Absolutely terrible!  Stay away!  We decided to go based on a friends recommendation, desp","useful":1,"cool":0},"5prQxE8f1RGU0yDdm4KEPQ":{"text":"The food was very good -- definitely recommend the muffuletta and the shrimp rémoulade, av","useful":0,"cool":0},"A6pffX6kjP-NwakSJ72o7Q":{"text":"We headed into Napoleon House for a late dinner on Friday night.  The server, hostess, and","useful":0,"cool":0},"yy3CMVAxi1BFpNQoUXTLJA":{"text":"Although the food was really good, I wanted to get up and explore the Napoleon House becau","useful":1,"cool":0},"b0hZp1ZX2aipQWQbCZZGRw":{"text":"The muffaletta was really good, as was the Pimms Cup. The courtyard is gorgeous, and the i","useful":0,"cool":0},"SiAP4yw4xSSYyn17vMxITQ":{"text":"The bourbon milk punch is delightful and refreshing. Their muffuletta was the best of my l","useful":0,"cool":0},"SQIHcgZyxxog1EZlUqtHqw":{"text":"Cute ambiance and friendly service. We went there following a muffuletta recommendation. W","useful":0,"cool":0},"hVJUBk3IgVOeOge8PwZPfw":{"text":"The ambience was nice but the drinks were okay. It was an old establishment which had clas","useful":0,"cool":1},"q_NYHcr3NVv8YwSds-jytg":{"text":"Originally built in 1791 for Napoleon himself, charming place for a Pimms Cup and cheese p","useful":0,"cool":0},"zgmlNhhnCnTZTsJ9lDbB3A":{"text":"Loved this place for a few reasons: great service, ambiance, seafood gumbo and PIMMS CUP!!","useful":0,"cool":0},"4mIiu0b7tPxI-GcpQeu_EA":{"text":"This place is wonderful. The food, the service the price the location, everything. I went ","useful":0,"cool":0},"E3YtJO5RPXScS1J3rz0JaQ":{"text":"Seriously one of the best lunches I've had in a while! The restaurant itself is gorgeous a","useful":0,"cool":0},"NgLJeASLIxr8lbaUM-33GQ":{"text":"Great lunch place! Prices are good as well. My husband had the sausage poboy and I had the","useful":0,"cool":0},"EG5mZUMTXyihvOmZPKrBVQ":{"text":"I like it here, it's just as a bar should be, dark, mysterious and serving drinks! I like ","useful":1,"cool":0},"mg-INmZcPlD04OjKyFVX6g":{"text":"Turkey club was good, my husband got the grill cheese w avocado and bacon and it it was al","useful":0,"cool":0},"jeAHNQYA2udCAd32TqgRJQ":{"text":"I had the best sandwich I have ever eaten at the Napoleon House--their Muffuletta. It's so","useful":0,"cool":0},"w3xYZ0zCfH0DwhD-9wfF8w":{"text":"Best lunch so far in New Orleans.  Generous portions, great flavors, and quick service.","useful":0,"cool":0},"E8J1cVEpDh_vV-lEVlaHUw":{"text":"Beautiful. Fare prices. Wonderful staff. Good food. After a week in NOLA this has been my ","useful":0,"cool":0},"RyKS3HMLS0q7PdL7mqpj6g":{"text":"The Food:\n We weren't super hungry so we only ordered the seafood gumbo and a side of jamb","useful":1,"cool":0},"uCkAGpQCn8XDgk6OFfBiXg":{"text":"I really, really wanted to love this place. We walked by it on our first evening in NOLA a","useful":3,"cool":1},"EG_64bziTSNGBMtRtQ44ZA":{"text":"Food was good, but not planning on returning or recommending to anyone. We had a muffulett","useful":0,"cool":0},"2O_4SGj8y0v9fJ-a9Schdw":{"text":"This place is awesome. A quiet, candlelit resturant, historic preservation, beautiful cons","useful":0,"cool":0},"zXFOhVPWq-9TQjBJ0q2Jng":{"text":"Muffelata at Napoleon House is best in NOLA. Red beans and rice good. Pimms Cup and strawb","useful":0,"cool":0},"sksobM2Av4zuZVS0nU_Ehw":{"text":"Pimms Cup was excellent and the place is dark and old and charming.  Food was very good an","useful":1,"cool":0},"CX6U6J2i32NUfy7tXJDk2Q":{"text":"Very atmospheric. Boyfriend loved his muffaletta, while my shrimp remoulade-stuffed avocad","useful":0,"cool":0},"tlavz9OW9Vz2nC3_LL9kDg":{"text":"Pimms cup is a MUST. Arnold palmer tasting, very refreshing. Old building, great feel. I w","useful":1,"cool":0},"mgMM8BmoHLPHDWOsgQWarw":{"text":"This review is for the bar only.\n\nMy friend and I stopped by here a couple times on the wa","useful":0,"cool":0},"QOyUayqk1ArgsAh9W3T5rw":{"text":"Stopped in to rest our feet and fill our bellies, boy were we glade we did! We sat outside","useful":2,"cool":0},"-Pf5INVlOHGIF8sIp1L7hQ":{"text":"This is a location with great history and the stories told here are sufficient to draw you","useful":0,"cool":0},"T-z9VXRgq3IgmzgrsUWA1Q":{"text":"Two words: Pimm's Cup. Do it. \n\nThe Pimm's Cup is an amazingly refreshing drink consisting","useful":3,"cool":0},"tz7FI9L-1Rm8BMohma-NxA":{"text":"This little gem and our waiter Jordan made our trip to the French Quarter.  Jordan recomme","useful":1,"cool":0},"Tly0DbIjXDM_ne2ofXcFmQ":{"text":"Delish food, a place with some interesting history and a very nice homely feel. The muffal","useful":0,"cool":0},"W8QCAVMbhn-MZEA3IBoe0A":{"text":"my rating is based on the fact that my feet did not cross the threshold after viewing the ","useful":0,"cool":0},"1zBuy4vSixNDHryE9jw9Dg":{"text":"I'll give this three stars only because of the ambience, they have a cute courtyard. We we","useful":0,"cool":0},"NGwD-LmCIeMLrTVuz21u7w":{"text":"The place for pimms cups! Food isnt bad either. Great location in the Quarter right by the","useful":0,"cool":0},"1ZmPLm-o0hhKFLYnVjN_aQ":{"text":"The muffuletta and shrimp avacado salad were fantastic. Two of the best things I've had do","useful":1,"cool":1},"9EGL8ADMeb8h9t6mfQyfvg":{"text":"I had verification from a local shop owner that this was a good place for lunch. I was loo","useful":0,"cool":0},"APuyzBjAfNED3kcOwZy-Xw":{"text":"Came here just to try Pimm's cup. We were seated outside and I highly recommend it if the ","useful":0,"cool":0},"QpWezkmVt3mCq1_y3MG4AQ":{"text":"Simple food done well.  It appears they ate focusing on doing one sandwich at a time, righ","useful":0,"cool":0},"-nYKjrwL15wiQbdKc_Tp7w":{"text":"We wanted to relax for a bit after walking around the French Quarter. We found this place,","useful":0,"cool":0},"y8OCPJ8Tz5UAMNete5vtuA":{"text":"Some of the coolest bartenders around, they know their spirits.  Great drinks, great food,","useful":0,"cool":0},"nk5klklcOIAiVBPjAwS8yg":{"text":"It's one of the oldest buildings in the French Quarter, Napoleon was said to have been hid","useful":0,"cool":0},"qAxjiWg5KZJ4Og-eStoBEw":{"text":"This was the bar my dad hung out in all through college. I tried it four decades later and","useful":0,"cool":0},"-LnbR1hjJZoSO4dkW0m_rQ":{"text":"Cute courtyard with a simple lunch menu ranging from the necessary seafood gumbo to the sh","useful":1,"cool":0},"UU0K6U_kPul40reiEEJDYQ":{"text":"the pimm's cup tasted like lemonade. good, but nothing special.\n\nthe mufuletta was quite a","useful":0,"cool":0},"z1TUqw8sSKzfKUoDYwGjig":{"text":"The food is good, and I loved the muffaletta and avocado salad. Service was pretty bad, an","useful":0,"cool":0},"QgtiAGEWmXKOXRyzXoFViw":{"text":"oOOOh the greatest Sazeracs! Ahhhh refreshing Pimm's Cups too! This here is a drink review","useful":4,"cool":2},"1kI532CI58DY1zIpbWXOkQ":{"text":"I see a lot of four-star and lower reviews because the place is busy, or crowded, or becau","useful":0,"cool":0},"pwjFA8oNtSVKT4m_gmdQLA":{"text":"We had a great lunch here and got great service from Bruce. We shared a muffuletta along w","useful":0,"cool":0},"l4P1CEMVFO1LOT79h8CWwA":{"text":"Went here for lunch and sat in the really cute and heated courtyard today. The service was","useful":0,"cool":0},"6GAyZa3hB0zmYRVV46CEDw":{"text":"We have visited here twice while on vacation this week, despite making it a point to alway","useful":1,"cool":1},"iRnnwzOSee8xPRZ-lA4fHQ":{"text":"Order a Primm's Cup (get the souvenir glass if you must) and the assorted cheeses and pate","useful":0,"cool":0},"exSkq9BD6hnIvxrOCgmbGQ":{"text":"Fabulous. We came the morning after a drunken night out so i was grumpy and partially blin","useful":1,"cool":1},"JeZc11OKnmSaF1Wn-52Nlw":{"text":"One of my favorite stops on my visits to New Orleans. I always get the Shrimp Remoulade St","useful":0,"cool":0},"CsPLQ3wGFKg4bSxDjct3hQ":{"text":"Stopped here for our first bit of NOLA dining, fresh off the plane from Charm City. The ba","useful":0,"cool":0},"zlKqClG3wZDoh6uAPIWxbQ":{"text":"One of my favorite places for jambalaya in the Quarter. Napolean House's structure is old ","useful":0,"cool":0},"ZledaYFFHUduPPX7yp37hg":{"text":"What a great place to eat. I had the chicken and Brie sandwich and it was amazing. The atm","useful":0,"cool":0},"Xz0INKd6SUV4q4yKNOtEKQ":{"text":"On our recent trip to New Orleans it was recommended to us by several people to check out ","useful":1,"cool":1},"kvoWvzosdTU-xUgyG7_rWA":{"text":"This is a wonderful place it was recommended to me by a local bookstore owner I'm glad I l","useful":0,"cool":0},"b8cemPbLJ8sJa0-1tE6_2g":{"text":"I loved coming here not only for the food (I had an Italian Muffuletta, duh) but also the ","useful":0,"cool":0},"GvBF0I7Jwr7qgCPOPPIGuA":{"text":"Sadly we weren't hungry at all, but we stopped in for drinks and to take in the atmosphere","useful":0,"cool":0},"ysmXI5XLAEXEo3bQ1-Y1vg":{"text":"We sat at the and the service was very fast considering how busy the bartender was. We had","useful":0,"cool":0},"I7VQINt6TWw0oWY4nIxtpw":{"text":"Use to go here all the time and loved it and the buildings history is very interesting. Ha","useful":0,"cool":0},"nwVXb7WZ1rIKJ7AJJt2uQA":{"text":"This place is really beautiful. Dark and cozy its great for a relaxing dinner. I had the m","useful":1,"cool":0},"36uWDFD16j-EdKAE01-ajg":{"text":"The highlight to me was still their Italian food though -- MUFFALETTA!\nI've never thought ","useful":0,"cool":0},"Bd6JR1oq8a5hi96wtGO1_w":{"text":"So not impressed with the food or service - rice was not fully cooked - sausages were dry ","useful":0,"cool":0},"67IPA8Dhkh5fHizUTbuVCQ":{"text":"Stumbled on this place looking for a quick dinner and found great cocktails, good food, fr","useful":0,"cool":0},"Le2vcBzn0GkRErPgoOL4nw":{"text":"Really cool and unique vibe. My husband and I shared a muffuletta, side of jambalaya, and ","useful":0,"cool":0},"xplGfbyjcTLDT8xUI8lI1g":{"text":"So good! I went with a huge group and everyone was happy. It was a comfortable temperature","useful":1,"cool":1},"xUiuXQx36tHKgktBj8ZjWg":{"text":"My first Muffuletta as recommend by the hotel concierge. Great taste as well as a roll toa","useful":1,"cool":0},"vuXmcH57jaRJnErVDahyfQ":{"text":"Crap!  Skip it!!!  service was terrible, food was laughable in a city that boasts some of ","useful":1,"cool":0},"tqvBHNzhNRtXZZQZl1x-Kw":{"text":"The drinks are expertly made. The organic sandwich is a delicious veggie option. The jamba","useful":0,"cool":0},"YP6IAcZHV-cWeE2_sbsvqw":{"text":"Our waiter seemed a bit preoccupied and not truly with us. The muffelletta was actually go","useful":0,"cool":0},"7vwbDgbUibKknJoJl0IaRw":{"text":"I'm seeing all of the positive reviews and wondering if I am just jinxed, but the last two","useful":1,"cool":0},"QdobOlAiYFogDZFCqvXypA":{"text":"Nice place to stop in and has great history and ambience. \nFood was on the better side of ","useful":0,"cool":0},"2dSZgqt2gdakCjJ-SthB9g":{"text":"Food is OK. I like the jambalaya a lot. But that's not what they're known for or what the ","useful":0,"cool":0},"e1zWjKEDjMY9585lveyr1Q":{"text":"This was a stop on a local Cocktail Tour, and one male employee was so incredibly rude to ","useful":0,"cool":0},"_ZzoIFLOVPWVM6QbqjZtfw":{"text":"Visit 2/27/17\n\nTook notes from experience NOLA tourist and every time Napolean House Gumbo","useful":2,"cool":1},"InT2M6coYR3onmtFNcP_mQ":{"text":"Went here with a large group for a private dining experience and was greeted with a dark a","useful":0,"cool":0},"XNptnyjhRuZ3EWFU4pGm8Q":{"text":"After being a little disappointed with the inauthentic atmosphere at Lafitte's Blacksmith ","useful":0,"cool":0},"Xm1xLbQV1D_0-e4lqDQCog":{"text":"A server at Red Fish Grill recommended this restaurant for their famous Italian Muffuletta","useful":0,"cool":0},"rNhqixHNuwLjoKASAmYWoA":{"text":"Food was awesome.. But Gregory the waiter was TERRIBLE.. unfortunately the poor service ov","useful":0,"cool":0},"iXx0TnQFSyyxVBn3KUalrQ":{"text":"First timer. Lunch. Great atmosphere, the decor is fantastic. A classy older gentleman gre","useful":1,"cool":0},"Iz1MtnNiAHMJUnU4oTYa2w":{"text":"Full disclosure, I did not end up eating or drinking at Napoleon House so this rating is o","useful":0,"cool":0},"0cSOPuGjtbU47CUb9AXu-w":{"text":"Fantastic!  Waiters are all business, but pleasant.  Food is very good, especially at rock","useful":0,"cool":0},"STWDtFampxZipvnsqZS8BQ":{"text":"When it comes to atmosphere, Napoleon House is tops. You can practically feel the history ","useful":1,"cool":0},"gy35du6TixQp8qDAPSBbEA":{"text":"Napoleon House is where you go if you live in the Quarter or are an Uptowner entertaining ","useful":1,"cool":0},"ebS6UPU-ohGSrfxylg1hUg":{"text":"Great Pimms service was just ok.","useful":1,"cool":0},"Pi1LZwhOpo-AjycXutgg4Q":{"text":"I'm much more familiar with uptown restaurants and friends always ask what is a good place","useful":1,"cool":0},"IR8UPvEDQHMG85etVwv7_w":{"text":"Food was fine, nothing special. It's all about the atmosphere, here. You feel like you're ","useful":0,"cool":0},"hEHikth2QW5hChuURN_hFQ":{"text":"This place has mediocre food and sassy service. It's just about exactly what you'd expect ","useful":0,"cool":0},"dXeugsukWZUox_59z7PN7w":{"text":"At what point does decor go from nostalgic to gross and dusty?  I think this place has cro","useful":0,"cool":0},"SbkKlFJFzTx4kSAl3EOJTQ":{"text":"This place was recommended for the Muffuletta. The restaurant is rustic and old school New","useful":0,"cool":0},"0rziiLCT4cyX32_05Su_7w":{"text":"Stopped in for a late-night muffaletta, which I thought was solid, but not out of the ordi","useful":1,"cool":1},"UnJpyCd-_iecOE8VRqpd-g":{"text":"We loved it!  The building, the history and the food.  The bruschetta was delicious! Plus,","useful":0,"cool":0},"LDmglAlNTjdJqQVHkPLwxw":{"text":"Yuck, yuck and more yuck.\n\nThis was one of those experiences you wish you could rewind.  I","useful":1,"cool":0},"CgaGBbJEONbn536wc_qhVg":{"text":"I might be a little biased toward this restaurant, but I can't help it.  I've loved it sin","useful":0,"cool":0},"PrP_y-i9kzh0_pSbnR2mdQ":{"text":"Food is good. But come here for the Pims Cup. It's my favorite drink ever. Very refreshing","useful":0,"cool":0},"fsMPyH5csCfbXPZzopVBCw":{"text":"Sat at the bar for drinks waiting to get into K Pauls, Bartender was having a bad night.","useful":0,"cool":0},"xwycrPNws6alkb--on_ZcA":{"text":"Was on a quick trip to NO  and had to have a muffuletta - but Central Grocery was closed. ","useful":0,"cool":0},"iIg1ncIqob6Rj5y5IEmJRg":{"text":"Something about this place I can't put words to but I always feel as though I've arrived o","useful":0,"cool":0},"NoNTIEDzkjBlRkzOoX04bw":{"text":"I went to Napoleon House on a recommendation from my parents, who visited in the '80s. I L","useful":0,"cool":0},"HmWCp6kQKRtvCcjciYS7_A":{"text":"We stopped in for a refreshing drink and ended up staying for two. Mario the bar Jeep is a","useful":0,"cool":0},"8k3xQ94FQrPHE0i7a9iEFw":{"text":"Historic building . . . sidewalk cafe tables and seating inside the restaurant . . . chees","useful":0,"cool":0},"pEVnRH58eRs2saqEQglNbQ":{"text":"A caveat here, I haven't eaten here and can only review the abilities of the bartenders. A","useful":0,"cool":0},"ugvgSTJLXtPnK_NvV5J6bw":{"text":"I want to give this a 4.5. Wish they had half stars. I make sure to stop in when i am in t","useful":1,"cool":0},"Fek4mzTfMzeyoz7OdO8fng":{"text":"Had a Primm drink and a muffalatte sandwhich, cool place. price was average.","useful":0,"cool":0},"WYs5ODe65B_Ygzanpnm26g":{"text":"We had the ratatouille sandwich and garden veggie sandwich. Both were amazing. Very cool a","useful":0,"cool":0},"bJZ-jOF_axiPIeJrU-azhg":{"text":"I'm not much of a drinker but I had their famous Pimm's cup. I'm converted. It's light and","useful":0,"cool":0},"hO5F3Lnlmcv6h5D-XBoy9A":{"text":"So I've been here a number of times over the years, and it's where I like to go when I wan","useful":2,"cool":1},"q9v4c_6OJQZGOMRrvRyCdQ":{"text":"A beautiful place with reach history and nice story. Good food. We really enjoyed shrimp r","useful":0,"cool":0},"Qnn34YeLBZ_ZXtJ50UK1kA":{"text":"This place was a nightmare. Supposedly famous service, and it took us 15 minutes to get a ","useful":0,"cool":0},"4raL8YgBjr--AFBzTop02Q":{"text":"This is a New Orleans landmark. It's been here forever and the wait staff basically retire","useful":0,"cool":0},"02yFzN_Z_1HpECwTiFFZ3A":{"text":"Looking forward to going back and sitting on the patio, it looked gorgeous! Bartender was ","useful":2,"cool":0},"ciKzc-4nBmXlRkYzeYrFiQ":{"text":"The Napoleon House has been around since the 1700's and is one of those classic New Orlean","useful":0,"cool":0},"BG2IB1cgYr4DPv_Wua7sqQ":{"text":"Eh. You aren't coming here for the food. The big draw of this place is atmosphere: classic","useful":1,"cool":1},"_ttJuXzpAWYKLsgWuRImBA":{"text":"When my food came, the first thing my  husband said was \"mall food\"...and our drinks taste","useful":2,"cool":0},"vjEQvWibS2_vlSi9KiGvUA":{"text":"We decided to stop in here for lunch after wandering around the French Quarter.  We read t","useful":0,"cool":0},"OcCBPxD37WEFgWLf4eceQA":{"text":"Loved keeping the history going in this restaurant founded in the 18th century, but, yikes","useful":0,"cool":0},"6x2SGdRik7fKFfiHDrsSoA":{"text":"Its one of the best lunch spots in the French Quarter. I like the history of the place its","useful":5,"cool":2},"1ifQKGkL5A-fj6uNV0ls9g":{"text":"Great old bar--- fantastic drinks.  Beautiful classic music in he background----classy bar","useful":0,"cool":0},"HS5FOiH7ZNQ8UNteaYYPYw":{"text":"Wow. What a great surprise! The location is great ( we sit outside in a perfect weather). ","useful":0,"cool":0},"Jzi6jxMUy38HaRfI5ElJCw":{"text":"I love this place. Pimms cup and Muffaletta me. So dark, so shady, just right. You'll enjo","useful":0,"cool":0},"5FeqyyPmNRUX-ygxxv2Dog":{"text":"Best thing here was the muffelata. We tried the muffelata at general store next day. We ag","useful":0,"cool":0},"d2DeL0ZPuxlkiu02K9dujQ":{"text":"The muffuletta and the Pimm's Cup were good. I tried both the original and the seasonal Pi","useful":0,"cool":0},"mYRaQEsEV2ndml5Ra9pTWw":{"text":"When in New Orleans one must have a muffuletta. There were so many places to choose from. ","useful":1,"cool":1},"s4mqg1vGufOPNm3t5r4M4Q":{"text":"With warm weather finally taking hold, I am reminded of my favorite summertime libation, t","useful":1,"cool":1},"4ARIWoI8cNgACWqKrj93Ow":{"text":"Muff 2 - huge, giant sandwich bread, out of proportions with amt of food in the actual san","useful":0,"cool":0},"lqYnP1K_RPnoE2P0wVoPEA":{"text":"Came here with the taste of nawlins food tour and got to try the jambalaya! Not that I've ","useful":1,"cool":0},"pY8uOmxNYV5bqbu2cEY4EQ":{"text":"This place should be in your New Orleans bucket list ! So rich in history and the food is ","useful":0,"cool":0},"p-0AuTqtmQ8L2NdwGkocoA":{"text":"By far makes my favorite drink and best Pimm's cup in New Orleans. If you are in NOLA, Nap","useful":2,"cool":1},"-gyH5DUxEqVdsdKvyvaSFg":{"text":"Convenient location and pleasant staff.\nGot the \"roast beef poor boy\" and the Caesar salad","useful":0,"cool":1},"8HkW47EXoRzEEekpk5RzQA":{"text":"Pimms Cup was delicious! Left me wanting more! I would definitely recommend this to cockta","useful":0,"cool":0},"93bJ5poFxAhN044D43N8ig":{"text":"My #1 place for a light lunch and a refreshing Pimms cup when I'm in the quarter on a hot ","useful":1,"cool":2},"bCOE4tIRH8jHIGGQaEtJqA":{"text":"UPDATE:\n\nInstead of reaching out to inquire about our experience at this establishment, th","useful":2,"cool":0},"GGUzVmykstGy2DtEpoa3QQ":{"text":"Must-see for any visitor. Excellent food and cocktails, but history is the reason to visit","useful":0,"cool":0},"ZzLRXULTWoAaoA6xZByvJA":{"text":"Stopped here for lunch on a Friday.  Interesting place with historic paintings etc. on the","useful":0,"cool":0},"Jg6O6TnsdG70XujVYkNrmg":{"text":"We were searching for the best \"muffalettas\" to compare in New Orleans. This came up in th","useful":0,"cool":0},"UKewPdRJ9CwFx51Kw6Wtqg":{"text":"Entering Napoleon House is like entering a different time! It's a casual yet calming and s","useful":0,"cool":0},"H7ZmH502b3XsNQld-RP1CA":{"text":"The last two po-boys I had here were unspeakably poor. The salad I had two days ago was ju","useful":1,"cool":1},"iGHgMhGpFXJhJYl-e9wZiA":{"text":"This was THE BEST place I ate at while visiting New Orleans. I still dream about those red","useful":1,"cool":0},"0_VyWjR-qN2TBB3Dn9jFfg":{"text":"I had one reason and one reason only for coming to Napoleon House. I wanted a Ponchatoula ","useful":3,"cool":3},"2vHURQONWq90tXTQaihb1w":{"text":"Fun.\n\nGreat and historic spot in New Orleans. Super awesome staff. Food was ok, but the co","useful":1,"cool":0},"LNLzK4VH3EtVqRefK7lZ1g":{"text":"Always a stop on every trip to NOLA.  Last trip, shared the warm muffuletta.  Awesome, as ","useful":0,"cool":0},"VB8fzgrbM0kqezsI6vOq0A":{"text":"Good comfort food at a reasonable price. I started with their specialty drink, the Pimms C","useful":0,"cool":0},"hMc7LMxmnruv_R3d7UVbww":{"text":"Terrible service. No one waited on us after sitting there for over 20 minutes. I finally l","useful":0,"cool":0},"JQS-Hi3w8pELcjsf72w09g":{"text":"The warm mufalatta was very good.  I like it better than Central Grocery.  If you're not s","useful":0,"cool":0},"oYGUtAKrW5TX4hLGWpWnbQ":{"text":"Angriest bar tender ever.   Guy with the mustache.    Not a hipster but an old guy.   Very","useful":0,"cool":0},"bnl3fYMvatm9R33W6QxeQA":{"text":"Have a Pimm's Cup and a Muffaletta - they are both perfection here.  And the wait staff ar","useful":0,"cool":0},"gs_YEprcHaLNBAQj9z570w":{"text":"I really loved this place. The muffoletta was the best in NOLA and the patio was lovely. L","useful":0,"cool":0},"ILraMwHBpF7OldJ9guxtQg":{"text":"This was our last stop in NOLA before heading to the airport. The building screams history","useful":0,"cool":0},"6JmPmzhB3ZIRb2_AnnyylQ":{"text":"I was hooked by the ambiance at first loved it!!! however the short man  with a mustache w","useful":0,"cool":0},"NxJ13aPQr35CTl0wSmlMOw":{"text":"Looks good but the decor is the only thing going for the place.","useful":0,"cool":0},"x6iN5Aqs5Xdtu6kbFCEUqA":{"text":"The outdoor patio in the back was beautiful and my Pimm's Cup was great, but the service w","useful":0,"cool":0},"gqhx3XRfcJbNJXpY8rvVWg":{"text":"We apparently got lucky coming here on a slow weeknight. Our group of 5 was seated promptl","useful":0,"cool":0},"tLYy2I7I7YCEz8Radg0tuA":{"text":"What is a muffolatto? Stop by the Napoleon House and find out. Tasty, burst of flavor, ava","useful":0,"cool":0},"GTxfFFzGfjwpZqesTvRE_w":{"text":"The building is as old as it gets in the Big Easy, the interior walls look like they have ","useful":0,"cool":0},"T-Rs2u4mqUftlESCwzS6vA":{"text":"I was so excited to go to Napoleon House for one of their amazing muffulettas. When we arr","useful":0,"cool":1},"muzZLEXoWdp-3obROvPLpA":{"text":"We loved the Napoleon House! \n\nSo there wasn't any one things that makes the Napoleon Hous","useful":1,"cool":1},"zpTgXknqzhENITvjVuDedg":{"text":"We loved their Pims Cup. Enjoyed the warm mufaletta in their garden too! One of the few pl","useful":0,"cool":0},"rbjixe1mcMtZ8v-FYEAikw":{"text":"I loved Napoleon House! The history and environment are so cool an the food is delicious. ","useful":0,"cool":0},"sfp0wqFnV5wknuR1ALPozg":{"text":"What a flat-out delightful place.  Comfortable atmosphere, classical music,  dangerous Pim","useful":1,"cool":0},"jEOFBnHjb3z0EsoIhSONNw":{"text":"A very historical and nostalgic experience. Ask them to seat you in their patio. Their Ita","useful":0,"cool":0},"_J6xJJ0-kN5XAG5AhYlB-w":{"text":"Excellent food! Muffuletta was amazing. The shrimp avocado \"salad\" was very flavorful and ","useful":0,"cool":0},"3bkrhGpdq6jAZlYufvZr9g":{"text":"This is the first bad review I've ever given and I hate to do this. I should have known wh","useful":0,"cool":0},"qe-oNmWQN94hv8uP2Bj2Sg":{"text":"This is a great spot if you're a geek for history.  It's 200 years old and, fittingly, the","useful":1,"cool":0},"6smtfDmRxsrHyPmM8GGPoA":{"text":"October 2015\n\nBoth of my Witches Brew tour guides suggested this place for their large por","useful":0,"cool":0},"xXyI25ud9IoeKnX-wWcqbA":{"text":"If you are in the New Orleans are it is a must to visit the Napoleon House.  Get off of Bo","useful":0,"cool":0},"ov5FhW9A9D8cGM1lANEx1A":{"text":"The food is fine, but Napoleon House gets five stars for their lovely courtyard, their ine","useful":0,"cool":0},"mzHclaToZ7JdKFdRFTSgEw":{"text":"Absolutely charming patio/courtyard area. \n\nI felt like I was transported into old world N","useful":1,"cool":1},"9Wl4KyE7NgQB7WmxLbJEvA":{"text":"Great place in the French quarter. Not touristy. Menu is reasonably priced with $10 meals.","useful":0,"cool":0},"AUOLuUqlatPs-X2cxAC6Qg":{"text":"We went there due to a friend's desire for the drink-  Primms Cup was very good!  \n\nWe got","useful":0,"cool":0},"iJ0MHyCjrj0xi0HHodq1ew":{"text":"Best roast beef/gravy po boy in the world ! Jambalaya excellent .","useful":0,"cool":0},"2_otiDpdsMYb5ulJPt1vhA":{"text":"I loved Napolean House!  I love that the building is so old and the decor reflects that.  ","useful":0,"cool":0},"-p5KV_nOj9uipKlGyZKO0A":{"text":"One of the coolest bars in New Orleans. Just make sure you order the house specialty drink","useful":0,"cool":0},"MxFGqfgkB02lT0m1dl5j-A":{"text":"The gumbo was good, jambalaya was average. The service needs to be improved upon. The wait","useful":0,"cool":0},"2hgh8wWRPSCDP8b8PBbuqw":{"text":"it's a charming spot, the decor is a nice historical journey and there is outdoor seating.","useful":0,"cool":0},"YJja4t_ezz1mhuGE27NsQQ":{"text":"This place was awesome. Excellent Po Boys and cocktails at a really great price. Service w","useful":0,"cool":0},"t-bxilXML_-u1RV2MQ7bxw":{"text":"Fun place with a lot of character.  Had a shrimp and a sausage po' boy and muffaletta sand","useful":0,"cool":0},"VF3rSLfT1kWQKHqYRFLmBQ":{"text":"We were looking for a muffuletta and came across this place, the food was good and super f","useful":0,"cool":0},"RQmqBzN-6o4wnNyepnj3RQ":{"text":"Very cool story behind this awesome location. I am from the Pacific Northwest and they jus","useful":0,"cool":0},"cnwUGVoDopxWRpRZe1TeLg":{"text":"Food was great, potato salad my favorite. Our server was great at the beginning, we were a","useful":0,"cool":0},"nuPjRAmJX1_qIp2U0nqWVQ":{"text":"There are tons of places to try mulfaletta in the french quarter and we just so happened t","useful":1,"cool":1},"X-3xtfBJUwhPXEIO14tGDA":{"text":"The food was good\nLarge portions with the muffuletta- bread was soft, and the half with a ","useful":0,"cool":0},"enkyP3xjE4xsTiWmq-2ARQ":{"text":"The rooms feel like you are in a haunted inn.  There is interesting artwork and stories on","useful":0,"cool":0},"wy3N45QYCK1GTmf5Tuss_Q":{"text":"Pimms Cup is all I had here as it's their signature drink, but the old bar feel and barten","useful":0,"cool":0},"NQKzo6RCxcDKveYR7sompg":{"text":"Ate lunch here and enjoyed the food and drink. The smoked gouda grilled sandwich was excel","useful":0,"cool":0},"Cg5eoAj3dGbtdBWfMfWHXA":{"text":"I don't really like eating in the Quarter, and Napoleon House is a perfect example of why ","useful":8,"cool":4},"o-W2155IYTCvVFmIF4oyOw":{"text":"Our waiter was very snooty about being employed at a glorified sandwich shop, but it was a","useful":0,"cool":0},"h3WTzQ-9f4dDkjUDKHweNQ":{"text":"There's no distinct sign, just know that this restaurant is located at the southeast corne","useful":0,"cool":0},"lcqathNh2tNO0TcIMAa55Q":{"text":"Ate here on a recent trip. I'm torn on this place -- the food was so-so (we had red beans ","useful":0,"cool":0},"1jhZXrI_Ahjaawe3Ok3DIg":{"text":"We had the most peculiar experience here... dropped in to have the Pimm's cup, because tha","useful":0,"cool":0},"g_KZLGRocKsgDSeym5h-iw":{"text":"We went for lunch and sat inside. The place is very rustic looking, but that is what gives","useful":0,"cool":0},"IXvh-Mq5BYWm01f32YBk8g":{"text":"Evey thing here was pretty good until I found half a receipt at the bottom of the plate.  ","useful":2,"cool":0},"eL_6dAPM0TrjIAaCRhqHqQ":{"text":"Came here for lunch. Got there right when it opened and sat at the bar. They have an outdo","useful":0,"cool":0},"AJ-C3iFPfY5msY7YF8t2Rg":{"text":"I stopped in back in August for a drink and small bite to eat and really enjoyed it. My wi","useful":0,"cool":0},"wBMQ7b2DiZcfbiOjhiZD-g":{"text":"We were here on a Tuesday night. The restaurant is beautiful. Old, dimly lit, romantic. \nT","useful":0,"cool":0},"Y9jWPwl02s7cXti61qB0Rg":{"text":"Very good, great service loved everything that was served.  Loved the olive sandwhich ( ye","useful":0,"cool":0},"jOPTgvlKKNXF6jhdGyQQLg":{"text":"We had a private ceremony here at Napoleon House and I have to say, from the first time Er","useful":2,"cool":0},"2jXMX-KwZjxUiQVbQRtCPQ":{"text":"Napoleon House was on our list to go to for drinks, the bartender was clearly experienced ","useful":0,"cool":0},"-p_I1YrfN4exMn7X3PAoeQ":{"text":"Legit bartender, southern NOLA swag. Location feels authentic, nice ambience with wait sta","useful":1,"cool":0},"RWIOX3D5hfTSGMY5RZVCog":{"text":"Can vouch for the Muffeletta. I was surprised how inexpensive our meal was. Great value.","useful":1,"cool":1},"pWBF-V7v4gs16CCeim3EUA":{"text":"Great ambiance.  Crumbly paint, high ceilings, the works.  Good service.  Friendly, quick ","useful":0,"cool":0},"0RP6glvXnDV3FIs2DrpCtw":{"text":"Came here during our weekend trip in New Orleans. Service was fast and pleasant. Great atm","useful":0,"cool":0},"N-SmUdzXFJDNXu3Lu_bY1w":{"text":"Pimm's Cup is the real deal, obviously. I am a convert, which is problematic, because most","useful":0,"cool":2},"NQdWN4o_upkQACN1lP3VoA":{"text":"Awesome place to eat with good food in French Quarter of New Orleans. I got the seafood gu","useful":0,"cool":0},"BxX1CBhtQKBo1O5Vuo7MTg":{"text":"Napoleon House is why I know what it means to miss New Orleans. It's an absolutely peacefu","useful":0,"cool":0},"G1wJsgfr-Ekdm8Z3VHu96Q":{"text":"So excited to try their muffuletta and it did not disappoint. We shared a half one and we ","useful":0,"cool":0},"_X6XUsvuKTXaduacHirwlA":{"text":"I come to New Orleans often, and always make a stop at the Napoleon House. Their Pimm's cu","useful":0,"cool":0},"vGgDypH-gbwmzOIHJ7n4kw":{"text":"Stepping into here is like stepping back in time  (but,  not in a bad way.) But,  beyond t","useful":0,"cool":0},"kNn7GjFTrY9P8U8hKds7tA":{"text":"A fantastic, historical place to enjoy lunch and a pimms!  I had an alligator sausage sand","useful":0,"cool":0},"btZmygwzIENC7_zujoinpw":{"text":"I had high hopes after being sears in the very cool courtyard. however, my Jambalaya was d","useful":0,"cool":0},"fKI8-yrdg-Twr6HEYuXIHA":{"text":"Love the space and the history. The barman apparently the husband of the original family o","useful":0,"cool":0},"rMfcHetYh5ovYFrvvxm56w":{"text":"13 years ago I stumbled upon this place and ordered my first muffuletta, which my wife and","useful":0,"cool":0},"0oCneFJKIIIxF66Qqosnkg":{"text":"Pimm's Cup is worth the trip! Ask to sit ij the outdoor courtyard.  We ordered a spinach d","useful":1,"cool":0},"3I3QTa_TfkuMXeKcqDTjAg":{"text":"What a waste of time. Service was a joke and the food was terrible. As a new Orleans resid","useful":2,"cool":0},"-A1st32huq58bpMvLYJHnA":{"text":"What a sandwich. Muffuletta was on point. This is the place to get one! I'm done eating in","useful":0,"cool":0},"608TdXLm-b6pqoZNPxt3ig":{"text":"I've eaten here twice. The first time the food was mediocre and the staff was weird. Same ","useful":1,"cool":1},"6QUvcImnm261WHLPqlQMKQ":{"text":"Are at the bar for lunch. The bartender suggested a muffuletta (1/4) with a side of red be","useful":0,"cool":0},"4s3dcwJ3uMT9mLgwrSAQIQ":{"text":"Stumbled upon this one. Almost walked right by it. Had lunch. Had the meatball po boy and ","useful":0,"cool":0},"hUZKvxKlkSORwDYRHE45mQ":{"text":"Stopped in here during French Quarter Fest to take a break from the heat and get a bite to","useful":5,"cool":1},"nFbXfsnqh_UFlxJYt_YtuQ":{"text":"Good food, super charming atmosphere. If you can, sit outside in the courtyard area and ca","useful":0,"cool":0},"GQ4zEKHpfXJei-mjgEiz0g":{"text":"Old school all the way, I don't always get great service but locals go here for a reason -","useful":0,"cool":0},"x7HeWMlBTzrLr9aSQYnr7A":{"text":"Sigh.  I really wanted to love this place and I can't.  It's a great building with a great","useful":1,"cool":0},"K8e3Z9ytTxYp1IeTuOfYgA":{"text":"My friend and I were visiting New Orleans recently and her sister told us we had to get th","useful":0,"cool":0},"bp9SprWy0LPVk43JCius6w":{"text":"Great Atmosphere. And the food was great. Pimms Cup was excellent. Very comfortable space.","useful":0,"cool":0},"kSjlX4OUmRm578IWFazqyQ":{"text":"I have been here once before and had a fine experience. Tonight however was not the same c","useful":0,"cool":0},"eY1yiZCb0HQCG2Y_prhaDQ":{"text":"A Pimm's Cup is one of New Orleans most famous drinks. If you want a good Pimm's Cup, you ","useful":1,"cool":0},"iTe2F_48yeAlMlq4a6Ucnw":{"text":"You will find no better place to relax and have a drink or two, especially the Pimm's Cup ","useful":1,"cool":0},"fNbF6vQKhdC2aOd1qq7LGw":{"text":"We were there on a Tuesday afternoon and ordered a sandwich and a small side of jambalaya.","useful":1,"cool":1},"2d4VLF8F0uJtQutR6eUnhw":{"text":"Napoleon was here. You can read that in the bathroom stall. LOL.\n\nI asked the bartender to","useful":2,"cool":2},"9eS1f2Cysj2vYPuGU98TKQ":{"text":"Dank establishment, not worth the history. Rude and \"tired\" hostess, rude and gross bar te","useful":0,"cool":0},"xJJfD6-ybznFFdJtiupTBw":{"text":"Pim's Cup was DELICIOUS. Atmosphere was very New Orleans - old, dark, moody, gothic.\n\nUnfo","useful":5,"cool":0},"19mqK4-MxeZ-jVajg9LPkg":{"text":"Great spot. Came here for lunch after arriving in the big easy and we were seated in the h","useful":0,"cool":0},"A5HhCORCeX2z9Dcf6rW2tg":{"text":"This is a nice little bar on Chartres Street; not too expensive given the area and with ni","useful":0,"cool":0},"SAyJmwRfeSbamlCrkBxFUA":{"text":"I love this place. We eat here every time we go to Nola. The muffuletta is HUGE, like big ","useful":0,"cool":0},"TWI5y_r9HMgLl76xodCigw":{"text":"I'm one for dark brooding bars, and Napoleon House Bar & Cafe definitely fits the bill.\n\nC","useful":2,"cool":1},"ZyLAOlsI6tO3Vf4oJPDJ_A":{"text":"We came here for Pimm's Cup, as what this restaurant/bar is known for.  They have three di","useful":0,"cool":0},"aI09cOKMjWpivj1PtCTD-g":{"text":"Another joint we always hit when in New Orleans.  Napoleon House is best for a drink and a","useful":1,"cool":0},"7uEHptkAOYBOzhpO5-e_eg":{"text":"The experience of the courtyard dining was my favorite.  I enjoyed their muffaletta and th","useful":0,"cool":0},"G6REN3PrvoB752x-pQf-AQ":{"text":"I'm not sure how this place has become so highly rated, but this was our worst experience ","useful":4,"cool":0},"26LQkesFd-Osb1WmeWOkBg":{"text":"Very cool place to visit because of its history.\n\nWe came here for dinner, but I'd recomme","useful":0,"cool":0},"MXRgyrrCLyJjTjj2hXC3_w":{"text":"Our best lunch in NOLA. The muffelata was tops. Nice atmosphere. Great service. Glad to sp","useful":0,"cool":0},"palfiy1KCaDe6_6mHcy4Iw":{"text":"We were told to try Naploleon House and to get a Muffuletta and a Primm cup. \n\nWe walked i","useful":2,"cool":0},"ClU93BhrBlaq9NZV3qyxZQ":{"text":"Pimm's cup & muffaletta via Joey Stauffer","useful":0,"cool":0},"SUAHXh7vbGnoFz9sUrlfUg":{"text":"The place deserves 5 stars just for the ambiance alone!  Every time I visit New Orleans...","useful":0,"cool":0},"vcDIuNc_uqLTCk7_RGwNMg":{"text":"Drink Pimm's Cup.\nEat jambalaya and red beans/rice.  \nLook at the painting of the silver c","useful":0,"cool":1},"tmKlw6_ZRq9SdjaS_QfRXw":{"text":"Do not leave New Orleans without going and eating or drinking at the the Napolean House. \n","useful":0,"cool":0},"yvaITrVjAOJE8Bo3_-EIYQ":{"text":"If you find yourself on this street corner in the French Quarter it is a must to go inside","useful":1,"cool":0},"S4KbB5U3dxyqjtGQghMdrw":{"text":"The food was good and inexpensive. The building is old and beautiful. Try to sit in the co","useful":0,"cool":0},"ZMs3vJVhW2pQtS471rZBgA":{"text":"I came to Napoleon to try the blasphemous HOT muffaletta sandwich.  That's right, hot. If ","useful":2,"cool":1},"-W52yVY13mEXQ8NS9ZrD0Q":{"text":"Great atmosphere, historic, great music, tasty sandwiches. Loved this place for brunch and","useful":0,"cool":1},"04_TffTeJ-UyYcTixpL3oQ":{"text":"Exceptional ambiance, great service and best of all- delicious AND affordable food! My gro","useful":1,"cool":0},"m2NctekMvh0qeRH14vk2kQ":{"text":"NH is always a sure bet for a fun lunch.  Casual Quarter dining at its best. The food is a","useful":0,"cool":0},"XzbTaZy4ybTxC0ShwiRZLw":{"text":"Chicken Caesar salad: chicken delicious; salad not Caesar and laden with red peppers. More","useful":0,"cool":0},"NZ0xRJBst3_ccm661rHJ_w":{"text":"Decent place to order New Orleans classics in the French Quarter, Napoleon House caters to","useful":0,"cool":0},"3MPncWxi0yFmrWCMhjGLLg":{"text":"The foods good and reasonably priced, but the service was so slooooooow. It wasnt even tha","useful":0,"cool":0},"UeFZsgvwdl-bX_NwMJBafQ":{"text":"Napoleon House was a more upscale place with a bit older clientele. As crazy as I can get ","useful":0,"cool":0},"S44lHEzqIWhin4cA6B5EeA":{"text":"So. Freaking. Good. I'm honestly embarrassed that as a local I've never eaten here before.","useful":2,"cool":1},"ZeVJw0jfWVE57EHNsvCthw":{"text":"Service was incredibly slow. Probably waited 10 minutes for anyone to speak with us and th","useful":0,"cool":0},"kUrWjHrUkcHtYnHcY8zAiw":{"text":"I've been here a handful of times with my family and typically enjoy myself and the enviro","useful":0,"cool":0},"2cf-x3UusbPlpwtKIJiStg":{"text":"Terrible experience from the moment we got sat till the time left. We were seated for 15 m","useful":0,"cool":0},"xR6lY7nwYeq-PJ47wbETDA":{"text":"Its a place that does not try to be something that it's not. no gimmicks, good food and ok","useful":0,"cool":0},"bAwahHEMhHfYORDgMVjYjw":{"text":"As a relaxing bar to people-watch on a nice afternoon and just take a break from whatever ","useful":0,"cool":0},"051F_49ozbtIRdVRwN7XCw":{"text":"Fantastic , wait in line ...\nIt was a cold Rainey day when we found our selves too close i","useful":0,"cool":0},"BXYcS0kuWJo3r5riOyVMwQ":{"text":"At first glance, Napoleon House looks like a 19th century dive bar with its mood lighting,","useful":2,"cool":2},"4Zul7GKArZI1bcOcYd4vlA":{"text":"Napoleon house almost looks like a dive bar on the outside and we almost passed it up, but","useful":0,"cool":0},"QeKvy__c7g3r1gpzAFnC0w":{"text":"The food never fails to satisfy. My husband stated that the Ruben was delicious than he re","useful":0,"cool":0},"czDj7l2Tyo5lWHJOu95qxQ":{"text":"On our first night in New Orleans, we headed into the French Quarter to find Napoleon Hous","useful":0,"cool":0},"galrpqPHY3dTbFSO3-dKBw":{"text":"I loved this restaurant. I loved the old building and interior decor. It had a very old fe","useful":0,"cool":0},"4COjkS2XJs7w0ko80I3x1Q":{"text":"A muffaletta and Pimm's Cup. Nothing could be finer.\nAlways a part of our New Orleans visi","useful":0,"cool":1},"snbVIbGY5vH4uzSlr1xNOA":{"text":"Napoleon House is one of the better known spots in the Quarter, a must for first time visi","useful":0,"cool":0},"HPuL8X6_55BnVFUdLwI9uw":{"text":"Great food at a great price. Nice to eat something other than gumbo/jambalaya/oysters.","useful":0,"cool":0},"9VytFCmxYrwAfY0SEEKLeQ":{"text":"Atmosphere is awesome, food is OK, service isn't great.","useful":0,"cool":0},"6vjLotX8h_b_KtqIIpEhQg":{"text":"We came for lunch and were cheerfully greeted with Christmas bells hung on our necks, aloh","useful":0,"cool":0},"LRpEOuQ245ywtR-MwCswcg":{"text":"The highlight for me was a great bartender (Zimmerman) who went out of his way to share hi","useful":2,"cool":0},"OH6x1Y4Ix2eh-tIUERuPqg":{"text":"I really like this place. As everyone else has, I came for the Pimm's Cup and was so pleas","useful":0,"cool":0},"L5RfkLYB0_B1wGve8KGOiQ":{"text":"The Napoleon House was known for a surly reputation and having previously experienced that","useful":0,"cool":0},"eZxTIN0zQNZbbqQP5j6MlA":{"text":"Unfortunately I can not critique the food due to the poor level of service. When the signs","useful":0,"cool":0},"4YNFI6bxB8-zn_dGeAt5KQ":{"text":"Found this place on accident. But it certainly did not disappoint! The muffuletta, hummus ","useful":0,"cool":0},"hfqE2mse6y9awBCuQfZftA":{"text":"Had a work dinner here in the garden. Had a Pimm's cup (of course) and what quite possibly","useful":0,"cool":0},"N-dEajYCCGMvZ7ErGNPYeg":{"text":"I gave it 3 but I really want to give it 2.5. It's getting stars because of the decent fre","useful":0,"cool":0},"NCHWPkX1Q62S39ig0w6JIQ":{"text":"The long line outside is a farce! Don't let it deter you! There are likely five tables ava","useful":0,"cool":0},"XFd9Jr7RIVJLvbdJ0WullQ":{"text":"Napoleon House is a must when visiting the French Quarter.  It is one of the oldest establ","useful":0,"cool":0},"vIJY9-MgZf9ManRPtaqVnw":{"text":"Stopped in on a whim. We sat at the bar over lunch. Service was fantastic, but the food wa","useful":0,"cool":0},"EXYXY4U9ig3qZktAWGefxQ":{"text":"I never write bad reviews. Ever. But this place? Have to do it. We were greeted quickly, a","useful":0,"cool":0},"4mpTUCDuoxsn7-OXnxDZ_w":{"text":"We were a party of five. They seated a party of 3 at our table. They moved us to a table o","useful":2,"cool":0},"_TBFn-VioJN6Qfh2rA2yyg":{"text":"Un bar con mucha historia que data de la época de napoleón, de ahí su nombre. cuenta la hi","useful":0,"cool":0},"tyCXyNYfNJ74XCj2lNYnEA":{"text":"Stopped in for a muffuletta to go when Central Grocery was closed. Kind of a long wait for","useful":1,"cool":0},"p09Bmup-GLDjerb69bisYA":{"text":"Very poor service. We waited at the front door for 10-15 minutes and never once were asked","useful":0,"cool":0},"FfKAZ62Lsgq0JzqvhYWltw":{"text":"Beautiful old world ambiance. Food was mediocre at best. Boudin sausage was mostly rice, l","useful":1,"cool":0},"i0cikcBiWRrq-uNAQooXZw":{"text":"underwhelmed.  i'm going against the grain when i say that, but i was totally underwhelmed","useful":1,"cool":1},"__20F2XoKYk7bsmB_Gx-Ig":{"text":"Napoleon House was really the turd on our trip.  The server was such a dick - I'm not sure","useful":4,"cool":0},"wZJCpbPGS1vo4uuDhl2rKw":{"text":"Cocktails 3 stars. \nFood 4.5 stars\nValue 5 stars\n\nThe Muffuletta here was the best sandwic","useful":0,"cool":0},"FYicDFrBjGoNv8pNJAfPKw":{"text":"I didn't get to eat here but I went here for a drink before going to dinner elsewhere.  I'","useful":0,"cool":0},"F1ElVsZoR8uRXNm16WMc7Q":{"text":"The Bruschetta was good! The red beans and rice was also tasty but nothing too special (ju","useful":0,"cool":1},"_q-rstzpnjUOfts0zOtOwg":{"text":"Napoleon House is a place I love to take visitors while exploring the French Quarter. It h","useful":6,"cool":4},"qHwm9A5Wshby7vSHDHOXiA":{"text":"I was in new orleans for super bowl week-(just friday).I was seeing the typical new orlean","useful":0,"cool":0},"tnE_eJ2_GbJM2kCv7I6leA":{"text":"Great old look.  Food okay. Service not so good even at the bar.","useful":0,"cool":0},"xSjTfQKYco9Wv-fAKUuNwQ":{"text":"I came just to try the Pimm's Cup and ended up getting a muffuletta as well.  The Pimm's c","useful":0,"cool":0},"4YUy6fO7YGSjM9MfKh3_Ww":{"text":"Had the cream of mushroom soup & a salad which was great! I really liked the style and fee","useful":0,"cool":0},"eyCLZcX0m032fOVeVDioFA":{"text":"Pretty good spot, good food a little noisy and great setting.","useful":0,"cool":0},"QOpG4mYdOiIkp_vBInsAew":{"text":"I love this place--sit in the courtyard and try a bloody! Been there a few times in the ra","useful":0,"cool":0},"ix0NQTLmIhWMFLaJ4nGjcQ":{"text":"This place was recommended to us by pack up and go. I looked at the menu that was on Yelp ","useful":0,"cool":0},"C20J2ah3XIbGYB8BPA7KjA":{"text":"My husband had the roast beef and gravy po boy, I had the jambalaya.  We were both overly ","useful":0,"cool":0},"gQXvNhdt93e0zIPT_-uSEQ":{"text":"They're clearly coasting on their prime location. Food was uninspired and bland. My duck c","useful":1,"cool":0},"aA8tb_DWwZTF8nHRYuHzvw":{"text":"I was there the weekend before Mard Gras 2012 ended. Excellent red beans and rice! Love th","useful":0,"cool":0},"goU5xfIX80IelDNqxM_pgA":{"text":"The muffaletta did not live up to the USA today review. It lacked flavor quality was not g","useful":1,"cool":0},"bOi3wwDil8arrs_x5pT3FA":{"text":"I loved this place! Atmosphere and food, were beyond perfection. It was a dark and antique","useful":0,"cool":0},"EEKhDazsHBVCUJL9pFPnBg":{"text":"The muffuletta is amazing, best you'll have around. Me and my party ordered about 3-5 of t","useful":0,"cool":0},"a9SPlSniMHwUOyWFQ5Iegg":{"text":"The food is good but not amazing.  The environment is fantastic.  Locals, outdoor seating,","useful":0,"cool":1},"YPyRP4ftuWYOV2B0QhiN4w":{"text":"Again. Terrible. Why do I keep stumbling into this place?! We were walking around the Fren","useful":2,"cool":0},"Yg6KLZj-Lwf6Rg4Rl6L_LA":{"text":"Too many happy tourist reviews for this place.  The food is decent enough, coffee is terri","useful":2,"cool":1},"Qe_jzIOsllagTaQeA3g1fA":{"text":"Greatest Bar in New Orleans and One of America's and The World's \n\"Great Watering-Holes\" I","useful":0,"cool":0},"YStQUXaQYqHsjichxjuouA":{"text":"Impulsively stopped in with a friend on our last trip to Nola. Great muffuletta and jambal","useful":1,"cool":1},"BlyQtDf87DMc_wO_3QqOCg":{"text":"Went during our weekend trip. My boyfriend had the alligator sandwich and I had the famous","useful":0,"cool":0},"wJgw_tPS9ny9HcMVm2b2lQ":{"text":"I visited Napoleon House with Ruggy J. as we blazed a trail in New Orleans for the Best Sa","useful":1,"cool":1},"VQRjhUSZ5IMu6vxsbHZJAA":{"text":"The waiter was really, really fantastic, as was the atmosphere.  The food and the value we","useful":0,"cool":0},"z8UH3HWTN7QaNo9MXszFGA":{"text":"If you like rude service, 4 items available on the menu after 8 pm on a Saturday night (WT","useful":0,"cool":0},"IdH_XhFLHaYr4U2vezv7cQ":{"text":"Le sigh. (That's my French side speaking)\n[This concludes all of the French that I know]\n\n","useful":1,"cool":1},"VDGbZcvdPDwDbGskjxmq5Q":{"text":"For a touristy place in the quarter- great atmosphere, great service, and good food.  I us","useful":0,"cool":0},"-feyrgsLBv1doMo1PcvKrg":{"text":"Underwhelmed by the cuisine but the service is excellent. Zimmerman was our server and was","useful":0,"cool":0},"PXED4_WwEL-S2dHtkisOlQ":{"text":"Our group of five tried Napolean House for lunch our first full day in NOLA. We were seate","useful":1,"cool":0},"kTbmgJGFniaq7eTYtYUfdg":{"text":"This ambiance of this place is really quaint. We came here for lunch after checking out th","useful":0,"cool":0},"8bBnIQoPeU2rvN0570zXEg":{"text":"Had the famous sandwich. A lot of bread but good flavor. May not be 100% of the value but ","useful":1,"cool":1},"GyZXXcLib2TtTSVVeV2Qig":{"text":"We had our rehearsal dinner at Napoleon house. What a absolutely fantastic French quarter ","useful":0,"cool":0},"OJwpqNhowFMcSzc0WxNZVQ":{"text":"A nice place for lunch. Seasonal Pimm's cup was sweet and delicious. Chicken and Brie sand","useful":0,"cool":0},"Fp_H5mX-h-PATNb4opay2w":{"text":"I've never been a fan of their food or their surly service, but the experience of sipping ","useful":0,"cool":1},"amxuWwIWtZIj5sak0_gzYw":{"text":"When we got into our room at the Omni, we asked where we could get a quick bite, preferabl","useful":0,"cool":0},"S3fWgvzxUy8RoAeCU9jLrA":{"text":"We came here for lunch and sat in the outdoor patio area.  Loved the ambiance of this plac","useful":0,"cool":0},"gOMzsoAYPIdRHsCkX0jrow":{"text":"Went in for lunch today with a friend as it was recommended to us. \nThe building is beauti","useful":0,"cool":0},"mFNCKAUZxuA3j8Qvp2phuw":{"text":"I absolutely love this place. I love the staff, the location, the restaurant, the bar and ","useful":0,"cool":0},"wBmF9cfNNur3eKTbT0G3Mg":{"text":"I have been here dozens of times, and it's always terrific.  Best Muffalettas in the Quart","useful":0,"cool":0},"AfeJeEhsSF_vCfIFcXuR5A":{"text":"Delicious lunch menu.  This was my favorite lunch meal while in New Orleans! The service w","useful":0,"cool":0},"k1cUVJ4Up8wkvKSlfIgJoA":{"text":"After finishing up one of the New Orleans French Quarter tours, we figured we would try th","useful":2,"cool":0},"Wy3rJ22kRdWb77mna2boSg":{"text":"had a few pimms cup cocktails, some muffuletta and a shrimp poboy. I cant think of anythin","useful":0,"cool":0},"HVJR18-enMDDFaNWQhDfJA":{"text":"There is something cool about dining or enjoying a drink in a historic place.  You will ge","useful":0,"cool":1},"Yz-4VPY3_iaA2HFbPTFe-Q":{"text":"What a wonderful place, go off the Bourbon st. Path and find it. You won't be disappointed","useful":1,"cool":1},"h4dQ3vjA9_1OC-yz-rTgsQ":{"text":"Perfect Monday afternoon?  Absolutely.  Pimm's cup, muffaletta, The Carmen Overture, and a","useful":3,"cool":2},"WClwwb5emfPPLO68kUEjfw":{"text":"I was determined to try a muffaletta sandwich on my trip to NOLA.  I know the Central Groc","useful":1,"cool":1},"BGP-hx7nyf-rOEFXYg_K8Q":{"text":"Deliciosos \nMuffaletta was wonderful...love the history of the place. Service was outstand","useful":0,"cool":0},"4hCunSPCqXWF8Tcfs9Azcw":{"text":"Nice patio, quieter section of FQ, no line to get in! Gumbo was good, food was average ove","useful":0,"cool":0},"yekEqOS-FuSLFT7tY0Nbfw":{"text":"Probably one of, if not my favorite places in New Orleans. It's so well done on the inside","useful":0,"cool":0},"gwUgzSM_423XE59gcxtBPw":{"text":"Just an okay selection of wines. Service okay. Location pretty great.","useful":0,"cool":0},"BEGaigbcOS_bqPa3Ncroqw":{"text":"One of the best bars/restaurants I've visited in NOLA. \n\nDim, intimate, away from the craz","useful":0,"cool":0},"IsIrQWaaAuCQsGZBfPB0FA":{"text":"Great ambience and history.  Food is solid.  Not necessarily the best, but definitely best","useful":0,"cool":0},"yrHHEP_uwbsXgkhM9NoQVA":{"text":"This is a great choice if you are in the French Quarter and don't want tourist traps. The ","useful":0,"cool":0},"_MmboW0KbHihopexDfa7AA":{"text":"Courtyard is awesome- I wish this was my house. But, if that were the case others wouldn't","useful":1,"cool":0},"y-EotbDWzawPyDz0_zOnaQ":{"text":"After doing some research on where to buy the best muffuletta in town, we settled on Napol","useful":0,"cool":0},"ZYxNAgn-1BhFI-Zdb6IC0w":{"text":"The muffeletta sandwich was out of this world.m. I couldnt stop eating more..i was stealin","useful":1,"cool":1},"XIgWcHJO-q8ltYFQFylcfg":{"text":"Wonderful music and ambiance!  Really enjoyed muffuletta and jambalaya!  My wife got the r","useful":0,"cool":0},"Ud6FOGIDye7Em4iZ2aYkug":{"text":"The building is amazing, and it was fun to imagine everything the walls had seen, but judg","useful":4,"cool":1},"3BmAmxR-ZLICeMct5fnoFg":{"text":"I LOVE getting away & going to Napoleon House for lunch - my fav lunches are their Corsica","useful":0,"cool":0},"r46cgMc10h2lsLJ5K5ZEKQ":{"text":"This place is great! Very cool old building with a past. We had a Bloody Mary and sazerac ","useful":0,"cool":0},"86Ms_r-GJnEzjMieTM0yUw":{"text":"Read several reviews both positive and negative.\n\nFirst impression was at the door. Not ma","useful":0,"cool":0},"jLvUNqFDKZMlS1XGw8TUHQ":{"text":"Great little place with fair prices. We shared a half muffaletta and the jumbalaya. Pims c","useful":0,"cool":0},"i74Cdt6Y5tGtQqNA7viqqA":{"text":"Nice patio/courtyard, good (cheap) muffaletta.  No complaints.","useful":0,"cool":0},"_NT5YbgKxFNfW51VFMdRIQ":{"text":"I moved away from New Orleans for a few years and on one visit back, I was craving a Pimm'","useful":0,"cool":1},"zZBC1hiUQtow7YtbkiuNaA":{"text":"Gotta say this was one of my fav's. The Muffuletta was great - as it didn't taste too \"oli","useful":0,"cool":0},"i5Jq-4M5RxMw_wKPYc_Dvw":{"text":"This the worst dining experience in the 2 weeks I stayed in New Orleans. My wife ordered j","useful":1,"cool":0},"cpVmqUuaKunF4NmN0JZnew":{"text":"I am not quite sure how this establishment has 3 and a half stars.  We just arrived in NOL","useful":0,"cool":0},"CPM4wxEx8emg2JZmZ-zO4w":{"text":"Outstanding atmosphere, yummy cocktails and great snacks.  But then again, I have a specia","useful":1,"cool":1},"rQhIF8ASdrf7Wksl_GrqIQ":{"text":"Their catering menu is definitely a lot different than their menu. Or at least when I went","useful":0,"cool":0},"mHuQlI3ERhu9OflwQDLvqg":{"text":"We asked around where we could find the best muffeleta in the French Quarter and were told","useful":0,"cool":0},"5L6utEqfi9w1XzGvVSPaQg":{"text":"On my last day in the French Quarter, I specifically came here because the place had caugh","useful":2,"cool":0},"_B_YFmGPhy1RPUXOI56sRg":{"text":"This place is good for a quick drink. They serve food, but we were out on the street when ","useful":0,"cool":1},"aDsL6uwvvZ7U4GlXLGNWOQ":{"text":"recently visited New Orleans and this was one of the best restaurants we ate at. The price","useful":0,"cool":0},"C1PwmmheJnckYtScgc5JOA":{"text":"Napoleon House has beautiful decor and excellent service.  Our waiter was attentive (we we","useful":0,"cool":0},"hMB4w-mjbhTprVf48CK00g":{"text":"The story of this establishment's name is that it was offered as a residence to Napoleon i","useful":3,"cool":1},"TYATZZFkqnAx6rGxhRgBVg":{"text":"I REALLY like this piece of history!! Initially just came here for the original Pimm's Cup","useful":2,"cool":3},"WdSQmPpNmeDjkulaR7k-KA":{"text":"Great Pimms drinks and nice servers. Cheese board was a waste of money- it seemed like the","useful":0,"cool":0},"CV6Si1NvUdssYbLcY1B5WA":{"text":"Drinks okay. Service was snooty and rude. YMMV.","useful":0,"cool":0},"CCJmoAaxmoy2Zw8B-wNy7A":{"text":"Ate at Napoleon House today.  It was quite busy, but the service was great.  Seating is a ","useful":1,"cool":1},"aj6FHbhwBOwf_GhysBzEWg":{"text":"Super fun old school bar!  Not my fave spot in NOLA, but definitely a scene to sit in, hav","useful":1,"cool":0},"Tr12Lmj2F3UlqAtMY8YbXg":{"text":"Nice place to stop by for dinner. I order the jambalaya. It was very flavorful with just e","useful":0,"cool":0},"09Pl2hIcuMyTYda7y1P0hw":{"text":"This was my absolute favorite muffuletta! The bread was warm and soft with a little chew. ","useful":0,"cool":0},"iFE8DfhwJP7AAyebKWZInw":{"text":"The food is alright and the service isn't so great, but that isn't what you come to Napole","useful":1,"cool":0},"CxFnonn05P-7tiq7PCMfzA":{"text":"great location, fun history and decent food and drinks.  Meatball sub was a little dry, bu","useful":0,"cool":0},"l5uKX1RXo0dWPWM4sNP9yg":{"text":"Come here! Get a Pimm's cup (or 4) and a muffaletta and thank me later! \n\nDon't forget you","useful":0,"cool":0},"BVpB95cpGnaJWo75k2ks5g":{"text":"Concierge at the Royal Sonesta sent us here (without hesitation) when we asked for a recom","useful":0,"cool":0},"vMTZKq1TNBe59itBDoT4Zw":{"text":"I've never had muffaletta sandwich, and I was bound and determined to change that in New O","useful":0,"cool":0},"4LBPMGTBQJY_EyRWUiU9CQ":{"text":"Love when a tourist attraction is worth the hype. Enjoyed a classic Pimms Cup & came for d","useful":0,"cool":0},"znE6tMoyS2f90qn9eFqbQg":{"text":"Pimms Cup for two in the souvenir cup is actually a great aperitif for just one. Did these","useful":1,"cool":1},"TyXEO2u6xgFKLYDPQVfbdw":{"text":"Sazerac was mediocre.  Pimm's cup only slightly better.  Muffaletta was made with dried ou","useful":0,"cool":0},"sQHciW5e_lmfu4JpGY7F-A":{"text":"I brought my girl friends here to try the \"warm\" Muffaletta sandwich... and none of us lik","useful":4,"cool":1},"tuVd8sr47QikLXue8kaSLw":{"text":"We had the best crawfish ettouffee here!  Service was outstanding along with the food.","useful":0,"cool":0},"zp69iKg3RBC9jEtHbXFUkg":{"text":"We went here on a Saturday afternoon for drinks.  Ordered the Pimm's cup, which is what th","useful":0,"cool":0},"0ho7THWZX5JK8lt0n5Of_Q":{"text":"My recent lunch/cocktails at Napoleon House (NH) were the easy welcome back that New Orlea","useful":0,"cool":0},"F9V6SwLAE1I2ZZt2iw2woQ":{"text":"Napoleon House is a bar. Typical of bars, it is noisy, but it has two atypical aspects. (1","useful":1,"cool":0},"oENymlP1GNfYYByDcz15yw":{"text":"Stopped by here for lunch after a morning of touring around town. It was recommended to us","useful":1,"cool":0},"Tuwv89NRnJARuXTR_3OqwQ":{"text":"The place has the best atmosphere of any old French Quarter spot pluss good food and servi","useful":1,"cool":0},"0ItnnF4gm10hSfocnNZJ2w":{"text":"Really wanted to leave 4+ stars but the bartender ruined it for us. We went especially to ","useful":0,"cool":0},"h8p6HJRUuC6CmdAwdw2IJg":{"text":"Talk about atmosphere! Paint peeling from the walls, lovers grafitti filling the cracks, s","useful":0,"cool":0},"4RYUdgzzvaMHoU6L85A-Pg":{"text":"Server was great and was very patient when helping another table that had food allergies. ","useful":1,"cool":0},"ZtjMm2z3ExWwqjqxzZ0D3g":{"text":"Great little hideout bar to grab a couple of classic libations prior to night out on the t","useful":0,"cool":0},"Jp2iySqfTp3__G4Nm4eABg":{"text":"We decided to come here because 1. we heard it was good, and 2. it has great historical si","useful":0,"cool":0},"xnrdOGL-omLBVYUBJ4QDTQ":{"text":"I know this is a tourist-y place to some degree, but they had seating on a rainy day and w","useful":5,"cool":0},"Bs05LmFYiP8hHLVPmhIh_g":{"text":"Went here for drinks on a Saturday afternoon over Labor Day Weekend.\n\nThe place has a lot ","useful":0,"cool":0},"5WZlZYfKYn1Q4yhcPRrWHw":{"text":"Amazing historical place plus food was incredible. Obviously recommend the muffuletta and ","useful":0,"cool":0},"EcZQY9qouTTJS5gj7O8Edg":{"text":"Poor service was more of a stand-out than the food. The food was average at best. My po-bo","useful":0,"cool":0},"tsCqlSixwku5z-D1GOGm4g":{"text":"You can't go wrong with the ambience or the history of this place.  Drinks are solid and I","useful":0,"cool":0},"_YRcFwcs7VLYJuA8wRXv4g":{"text":"We came here just for the Pimm's cup. \n\nThe pimm's cup contained British Gin based liquor ","useful":1,"cool":0},"dfssECReV_JknYKCzdWS4Q":{"text":"Yes, I've had a Pimm's Cup or two (or twelve) here in my life, like everyone else.  No, I ","useful":3,"cool":1},"nVfvChkBjpAqBkzVyVAaDA":{"text":"I have to admit I got nervous when we walked into this place - I thought it was going to b","useful":0,"cool":0},"GHM_bCS5AQxsQcqfdlu2vg":{"text":"Lovely old bar open to the sidewalk, waiters in long aprons and white shirts, a touch of o","useful":1,"cool":0},"WCGXAWgV-L_1hM_CyTAdRg":{"text":"The overall atmosphere of the restaurant was cool and had a certain ambience that I enjoye","useful":0,"cool":0},"hvObKAaAR2eKhJm7ZIH3DA":{"text":"My first trip to New Orleans and I was fortunate enough to have found this remarkable plac","useful":0,"cool":0},"Kn60GoH0z7vQOoHEyk2-zQ":{"text":"Stunningly rude treatment.   I was in New Orleans for the first time a few days ago.  I wa","useful":2,"cool":0},"_srbsgWaxnUx7qGrJHrHoQ":{"text":"This classy landmark's old patio / courtyard with stone floors and fountains transported m","useful":1,"cool":0},"4P0efGEkhINrfP_e2x0yrQ":{"text":"This is the house that Napoleon would have lived in if he came to New Orleans.  The food h","useful":0,"cool":0},"5YI2PqUIK7k08W4Wt8py1g":{"text":"I eat here with my mother whenever she comes to town.\n\nI enjoy the courtyard and the madri","useful":1,"cool":0},"Mj7AQZzyMbwGTfLOvbCWGw":{"text":"Great food-- muffaletta is world famous, po' boys are delicious. garden in the back is ref","useful":0,"cool":0},"X7yjkjFYROaUcCRBX-sihg":{"text":"This place has the best muffaletta and jambalaya in town.  The muffaletta is traditional, ","useful":1,"cool":1},"A78Griz3JLJylg323tMdnw":{"text":"We went there for lunch to try the warm muffaletta that I saw on Food Network. I guess it ","useful":0,"cool":0},"x1OKx2WfoDhtsUrvTK1OBA":{"text":"Best lunch spot during a recent trip to Mardi Gras!  Beautiful building with such history!","useful":2,"cool":0},"7EHB8PH9znYLLSrh-zLtSg":{"text":"Went close to closing time, whenever that is and is determined by the staff i guess, haha.","useful":0,"cool":0},"dy6D72m-xs3Z4-c8dWa5vw":{"text":"I make a point to have lunch here anytime I am in New Orleans.\n\nFirst, the place is very c","useful":3,"cool":0},"xzFK_JR9DlrSCA5Dtgy7jg":{"text":"This review is for the bar experience.\n\nI loved this place! The atmosphere is so cool. Cru","useful":0,"cool":0},"0ZxSs7SW4TzlkQQIK0inqw":{"text":"It is lovely, absolutely wonderful. Did you step into a time warp that you feel both respe","useful":1,"cool":1},"34pE3tEIZG6E_axIUNeQcg":{"text":"Perfect place for a Muffaletta and Pimm's cup.\nThe muffaletta is huge. We shared a half an","useful":0,"cool":0},"SWCUMxDomgxqkGTjuzggGA":{"text":"LOVED this place! It was just the restaurant we were looking for! It has the New Orleans f","useful":0,"cool":0},"oX8sRO5tLeWQkWShUTl95Q":{"text":"Was visiting New Orlean's for a work conference.  A group of 10 decided to check this plac","useful":1,"cool":0},"vX_T5vC6Wqs-qEaPe5Vbvw":{"text":"Well thought Moe's mufalatta could not be beat;  I was wrong!\nThe bread was tosted to perf","useful":1,"cool":1},"5ShfcMG1hbvYPsX9b7KCkQ":{"text":"Very good example of the allure that is New Orleans. Kinda hidden in plain sight, but it's","useful":0,"cool":0},"wJDsr3DKnpaIEw2qnn0tjw":{"text":"The food was reasonably priced. The atmosphere was very charming. The traditional Pimms cu","useful":0,"cool":0},"FinxCgT2eGpwSjVzloYn3A":{"text":"I wasn't planning on grabbing a muffaletta because I've only had terrible ones before.  Bu","useful":0,"cool":0},"_FeSect5-82prdOU7M8fJg":{"text":"After an amazing night out, I was feeling the side effects of one too many hurricanes!  I ","useful":0,"cool":0},"MAvYJuRwinNXBdp0yChL4A":{"text":"HISTORICAL, GOOD FOOD, GREAT PIMM'S CUP!\nGreat place! Delicious po' boys, and jambalaya, t","useful":1,"cool":0},"6tWtmnA-4IAzQ3eKU31QXw":{"text":"Cheap and good.\n\nOf all the places we tried, they had the best gumbo and jambalaya. Unlike","useful":0,"cool":0},"4bZfQI2VlpiRCChBEbfBiQ":{"text":"Awesome little place in the French Quarter of New Orleans.  Makes me want to live  in this","useful":1,"cool":0},"7f9xFat6QMu4jry-_8vZPw":{"text":"Poor Service just ruined this place for us - A place with a really great background story ","useful":0,"cool":0},"u5xsdOpPvSyekWSsFKQxeA":{"text":"It was nice to get sat with our party of 6 immediatley for lunch with good people watching","useful":1,"cool":0},"R4Z3S22DVQBU2bVuF-oRnQ":{"text":"Of course, we have to stop in Napoleon House when we're in town for a Pimms cup. And seein","useful":0,"cool":0},"e6hEM4kAxQb18bGUtAwqRg":{"text":"We were seated right away but had to wait for service for 10 minutes.  The Red Beans and R","useful":0,"cool":0},"mduO8ZePGuhbJ-MNUD0JFQ":{"text":"I love this place.  You can feel the history lurking before you even walk in.  I did not e","useful":0,"cool":0},"UEM-8yTny9jj2-agalL87w":{"text":"Great atmosphere and highly romantic.  Great classical music for ambiance with a vintage n","useful":0,"cool":0},"SotiiF6soXW2HYYLn516lg":{"text":"Our server Bobbie A (the first female floor staffer btw) was amazing!!! Friendly and knowl","useful":0,"cool":0},"FXG2H0ZR8xGmZBaOYE61AQ":{"text":"I love this place and will visit each time I come to New Orleans... We visited twice durin","useful":1,"cool":0},"N1jRj0UWM3dSHYJ5wQAeaA":{"text":"The building is worth a visit here. I am so glad I stopped here to have lunch because the ","useful":0,"cool":0},"WmR4LKhP6k3aiGP7lQArtg":{"text":"This is the place for a Pimm's Cup in NOLA but I can't say that I was overly impressed wit","useful":1,"cool":1},"WT5oYgmEF9fitFivXW6wNQ":{"text":"Went here for a reception after a friend's wedding and could not have been more pleased wi","useful":0,"cool":0},"SwlHd3fXKtEXnFZojDC38w":{"text":"The atmosphere is great! The menu is limited but they have the New Orleans basics and the ","useful":0,"cool":0},"DnfrWIsqgC5ctD_H0SQBqA":{"text":"We had lunch at Napoleon House during the first day of our visit to New Orleans. Part of t","useful":0,"cool":0},"noype_l5VF1RhTXwQfNIRg":{"text":"A very cool memory of New Orleans is getting Pimm's Cup drinks at the bar or getting them ","useful":0,"cool":0},"HuTjwxDZXE5TdmEYh8CLaA":{"text":"The menu is pretty...basic. Po' boys and other sandwiches, salads, cold pastas, and red be","useful":0,"cool":0},"MDE7kpy-bSKvBn0nWWgSGQ":{"text":"This place is full of good old NOLA history! I'm not a gin drinker, but we got the famous ","useful":0,"cool":0},"Gw5klBUDYYDUWDH2DGQVzg":{"text":"Napoleon House is like your rich uncle that makes an appearance at Thanksgiving.  A distin","useful":0,"cool":0},"YL59qkoca9sJA2dRHNPbhw":{"text":"I love the space that is Napoleon House. If you sit and just breath in the history, you ca","useful":6,"cool":2},"FinBKBTboWs2bf1hByA95Q":{"text":"Muffalettas are delicious.  They don't have as much olive flavor as most and the bread is ","useful":0,"cool":0},"y3Gg0UlioFbg1rXCPQstNQ":{"text":"This is a new Orleans Original! I recommend the pims cup and eat in the courtyard. Everyth","useful":0,"cool":0},"v4eU-y5fQlcIcoK-GpoNuA":{"text":"My first time having a muffulatta, a favorite of the hubby. He thought it and the jambalay","useful":0,"cool":0},"_MeSqrVCM93iKcf6WQp3wQ":{"text":"Fantastic lunch and great history. Boudin sausage, jumbolaya and a Turkey Po-Boy. Walking ","useful":0,"cool":0},"OVitEOXjjFhoibExpCCjGg":{"text":"What a great place!! I tried my first Pimm's cup here, and immediately declared it my new ","useful":0,"cool":1},"jQDZ1a-pMnG5xDfbS5jKAQ":{"text":"Beautiful, rustic, historic. Great atmosphere. Pricy but delicious drinks.  \"Old\" feel.  A","useful":0,"cool":0},"tq0neTTLtSfzzqY0DyjkCA":{"text":"The Pims Cup here isn't the best in the city, they don't muddle the cucumber and that is j","useful":1,"cool":1},"VcWMgue1ndWhk4qyF-5w1g":{"text":"A local tour guide told us to check this place out for a good lunch with good prices. Love","useful":0,"cool":0},"ZRkYTRYusgslT-RfxVs5Pg":{"text":"Perched on the corner of Chartres & St Louis St this beautiful bar/restaurant welcomes you","useful":0,"cool":0},"vcdKF60Gud_JIXKJSJgfvQ":{"text":"So, I am back in my hometown, visiting from VA, and a muffaletta was on the top of my \"I c","useful":0,"cool":0},"GZfCVczMxTp-sOdkhAN1XQ":{"text":"We didn't actually eat here, but I had to write a review because of the drinks we had.  I ","useful":1,"cool":1},"B7bFI3Y1oi9YSjVzVjEaPg":{"text":"Fun in the French Quarter with Daniel G. continued into the next day. I was asleep while h","useful":2,"cool":0},"14b5U8hBx8UlGcPkqpG3SQ":{"text":"Really cool place to eat.  We sat outside in the courtyard.  The bruschetta was great.  Th","useful":0,"cool":0},"1wo6tG0H3DGBnfCpgSYUOw":{"text":"The Napoleon House on Charles Street has an interesting back story. It was created in 1814","useful":0,"cool":0},"anj8PWjrIOXi1HNHmohp0g":{"text":"The ambiance is worth special note here. The building is a historical landmark -- this is ","useful":1,"cool":2},"otCXXzQRgeWxSFUwG9ikDg":{"text":"Solely on their famous Pimm's cup. \n\nNapoleon House is a really old bar (circa 1797 buildi","useful":3,"cool":0},"B7s9qs451bDsKeEORLtHNA":{"text":"The jambalaya ($6.95) was not great but the half muffaletta ($9.50) we ordered was incredi","useful":0,"cool":0},"2qMoVO12-9XSh3lVSs33VA":{"text":"I cannot say enough good things about this establishment. I love the decor, the staff and ","useful":0,"cool":0},"hJ073YIF-9n2c9dyAn2rIQ":{"text":"Gorgeous building / style and like some of the other posters I wanted to get up and explor","useful":0,"cool":0},"p8swNpbSVwB_JqXU60d_jw":{"text":"We absolutely adored this place.  Stumbled upon it tired and thirsty on a perfect spring d","useful":2,"cool":0},"JIyneGfFcODj5MlbhzpUZQ":{"text":"You must try the Sazerac here, from the city that invented the cocktail. Great bartenders,","useful":0,"cool":0},"c1omSGdr_TEl_e6fzdNxAA":{"text":"I don't visit New Orleans without also visiting Napoleon House.  The front room and the co","useful":0,"cool":0},"mwuEbXLLpeBaO1RnIP9lNw":{"text":"I got the mufalleta and the seafood gumbo. \nThe mufalleta was a unique combination of salt","useful":0,"cool":0},"jiaNL4lnwsJY_Sh7JxV45A":{"text":"Very old building in the heart of the French Quarter. Some have called it a dump. I think ","useful":0,"cool":0},"dpLd0rkLF0ehURqR3l2M0w":{"text":"Famous for their Pimm's Cups, they also make excellent muffulettas. Grab a sandwich and a ","useful":0,"cool":0},"4VpyEsMvMvOI_uVZW8OftQ":{"text":"After our waiter acting as greeter promptly sat us in his own section, he then proceeded t","useful":1,"cool":0},"Q29D3XsIFNx-91yiBpxpbQ":{"text":"This was my first stop after a long day of travels from the Northwest.  Starving and thirs","useful":0,"cool":0},"_nm_9sPw3lRb7IMr67bUnQ":{"text":"Walking into the Napoleon House is akin to entering a time machine. The restaurant was fou","useful":1,"cool":1},"vw9ZhNAQNhEulBFsVTmRjg":{"text":"I didn't know the schtick behind this place before stopping by on a Saturday afternoon.  L","useful":0,"cool":1},"tXf1IJ4ES9iM4uD-HyYYqw":{"text":"For the cost, this is a great deal. I had the beans and rice with andoulli sausage and a s","useful":1,"cool":3},"BetEF6KYUjWW8FcFcFt7Cw":{"text":"Hands down one of my favorite places that I ate at in New Orleans. \nWe split the muffelett","useful":0,"cool":0},"bWFQtQtkUt7J3Q9idWub7g":{"text":"I really wanted to LOVE this place...the history and feel BUT it missed the mark.  The pat","useful":0,"cool":0},"zlcdLjzbpKiep_0Dw4meQQ":{"text":"I love this place!  The place was so interesting, the staff were great, and the food delic","useful":0,"cool":0},"wKOJ5FpbkDFskbsywLsxWA":{"text":"Not sure what was going on today, but every place we went in NOLA was out of pretty major ","useful":1,"cool":0},"dQuNkWL6ZCdlqrXU9tSn6A":{"text":"Prices are reasonable. Portions are perfect. Service was good. Food was delivered fast. \n\n","useful":0,"cool":0},"JXWhYBB8_Z-70Q7TM8EGTw":{"text":"I visited this restaurant for the first time in January 2018. I asked the waiter what the ","useful":0,"cool":0},"BcGJoGn1mo5uH2SPoqB9mw":{"text":"Went there twice recently. Both times the service was sub-par. By sub-par, I mean two old,","useful":0,"cool":0},"Rvpkp60X8LeuQVeXCSDGSg":{"text":"I don't know how to rate this so will go with 2 stars. We were there over the holidays and","useful":0,"cool":0},"sdQg4OBPUGl8E9X-lqdJtw":{"text":"Monday's were made for red beans and rice and this place didn't disappoint.  Good size ser","useful":0,"cool":0},"Xpx9MiB1a_z71waTXV7Ifg":{"text":"Cocktails are amazing, get the Pimm's Punch or the Sazerac. We ordered the Quarter sized M","useful":0,"cool":0},"VMlXfcKcUd7zYLbbT3ZJtw":{"text":"Had my first muffaletta here. I hope to have my last muffaletta here. My boyfriend and I s","useful":0,"cool":0},"CvyyirthHOSltC9GmPsiuw":{"text":"Stopped in for drinks and to order a sandwich. Service was great, food was absolutely amaz","useful":0,"cool":0},"fxGy9KaiK8aq_89kzEPokw":{"text":"This place is a classic-a hidden gem that not too many tourists know about. We visited aga","useful":0,"cool":0},"BlSDljXvpckd40mw4wrK9A":{"text":"It took a long time to serve us (6 in our party) and it took long to bring us our food, bi","useful":0,"cool":0},"4qaLICV-Xy2jzTGIMQHSfA":{"text":"Get what you pay for I guess. Jambalaya overly ricey. Salad too much dressing and not enou","useful":0,"cool":0},"hsTBY-Xj_6HRCx4hvB9zVg":{"text":"I've only been for a cocktail & then only because my friend had heard good things. It was ","useful":0,"cool":0},"y_O8rYxs5Xo9ZegNuTnGcQ":{"text":"Cool, old world feel.  Sat outside on the terrace and had cocktails.  Then had a warm muff","useful":0,"cool":0},"qcUSRf4k4AkYEtglMDH_5A":{"text":"Cool spot to grab a Pimm Cup!  Order one!\n\nThe bartender was a nice guy and chatted us up ","useful":0,"cool":0},"kS3_a9n6rkip4qnYCFliAQ":{"text":"One of the few places where a vegetarian can eat! I stumbled across this place today {as i","useful":1,"cool":1},"QBQbGaPd-itU4rwUckdptw":{"text":"Oh Napoleon House, how I would love to eat there. I have never given a one star but I will","useful":3,"cool":2},"5g3R09lh1POUlj84mAPptg":{"text":"By far my favorite place we visited during our trip to New Orleans last week. The atmosphe","useful":0,"cool":0},"rOJ3ZLwR9JgST10tBSG3Dw":{"text":"My boyfriend and I were down in the French Quarter this past Saturday night for the French","useful":0,"cool":0},"kBBp4Sp7nS7j1sthBXuVuA":{"text":"A classic Nola establishment. \nWent on a Saturday night, so it was a bit crowded, but sinc","useful":0,"cool":0},"5ZdJrT3H0LgbDf1iucIrrw":{"text":"I alway visit the Napoleon House when visiting NOLA.  Don't leave without stopping by this","useful":1,"cool":0},"RyiO64d6B7gcWljC8qoZ8g":{"text":"Come here for the ambiance and experience. It is a legendary spot with great wait staff ..","useful":0,"cool":0},"gP-y91y40TyMVwhoYVh2zg":{"text":"Best muffalettas ever! Pimm cups cocktails were excellent. If you want to do the Best of O","useful":0,"cool":0},"QAVYiHUmhf0ALKlTv6Gnnw":{"text":"We randomly went to Napoleon house and we loved the food and drinks, especially the muffal","useful":0,"cool":0},"sSkJu3Q_ZvXkU2-0eS16Iw":{"text":"Visit for the atmosphere. Truly historic. Very friendly and attentive service. Have a pimm","useful":0,"cool":0},"TIxj0kD9-XAulpVqhWZ_8g":{"text":"This place will transport you to another time and place.  It is one of my favorite spots i","useful":2,"cool":1},"93tSo3SuFnFupZBvKo549g":{"text":"I have found a friend in the Napoleon House!! My new friends are the Smoked Sausage Po'boy","useful":0,"cool":0},"G_h3gCoksO8KL5rsfj0K6Q":{"text":"Nice ambiance and convenient, easy to find location....especially when you are staying rig","useful":0,"cool":0},"ktYSL9Kqy2oaFqw1-OEGjg":{"text":"I can't speak to the food, but the Napoleon House is always on my list of places to visit ","useful":3,"cool":3},"jhqm8XWK8edEPEvreSbAvw":{"text":"My friend, her daughter, and I found this place last night and gave it a shot. They were a","useful":0,"cool":0},"bH37L5T630kkaEBWIlOnyg":{"text":"Mufalato sandwich is amazing. Do not get a whole sandwich and less you plan on sharing . T","useful":0,"cool":0},"uFt--ESV4vk4SMOLMl6jyQ":{"text":"This place was recommended to my relatives very highly, and for the quarter it is an accep","useful":1,"cool":0},"dbvF4XOve7KlK65HX2hihQ":{"text":"I came in here from a recommendation from a friend.  The place is definitely unique and ha","useful":0,"cool":0},"Ik2wKReFJ4VCG16JD3k5Ag":{"text":"Napoleon House does feature great drinks, and amazing menu. Problem is consistency. \n\nOne ","useful":0,"cool":0},"Iy_LmoBs1-0yC86n7VNUeA":{"text":"I think this was my favorite restaurant in NOLA! We came for lunch on our last day, and it","useful":0,"cool":0},"nHmOpTZ7zpf9-mTBAftOmg":{"text":"Without a doubt, The Napoleon House is a New Orleans institution, and deservedly so!  It's","useful":1,"cool":1},"eojlyxMHJOeH5gAoBsa1jw":{"text":"Wondered in here for drinks while walking around the French quarter area. Delicious cappuc","useful":0,"cool":0},"pJZevy_nhRuGeBH_WJYWLA":{"text":"ate at napoleons 5 days ago.best meal we had in new orleans.highly recommend it.the food w","useful":0,"cool":0},"3MYXKY4BlZuUfY60QUDtFA":{"text":"Everyone said we had to come here for a Pimms Cup. It is historic, it is a cool bar, it is","useful":0,"cool":0},"LaGMfJ6lrjWk3HwoLp_GJw":{"text":"I used to come here as a grad student 35 years ago.  It hasn't changed. It's still got a v","useful":0,"cool":0},"1Cm7tsW1_Km7pooWPZz8tg":{"text":"1st Sazerac. Okay not a whiskey fan. I love the ambiance and history of the place. One of ","useful":0,"cool":0},"WkbjIH1iTMfgaK7T5mRJ4w":{"text":"A very dark but decent place to eat (while traveling or local - we were visitors to the ci","useful":0,"cool":0},"qgrnKKbaPMECwCQMPqxUgQ":{"text":"We visited about a month ago for a late lunch - was a nice respite from the overpriced tou","useful":0,"cool":0},"nRAtmPLc3Wriy-9SLtC6Cg":{"text":"Once upon a time, there was an adventure game  This adventure game was called \"Gabriel Kni","useful":1,"cool":1},"0vYl8oJZZc9xzLsHil8eoQ":{"text":"This place was recommended by the concierge in our hotel. First, I have to say the buildin","useful":0,"cool":0},"eHbPqRxW-vnKCdSEIsTV4g":{"text":"Worst. Service. EVER.\n\nWe wanted to stop by Napoleon's for a few drinks to cool off and go","useful":0,"cool":0},"4PDYwQEQw01kQBgy8azxNg":{"text":"Food was delicious! Our waiter was on top of everything. The red beans & rice were out of ","useful":0,"cool":0},"q3a8v4_klgIqZGXfcWu6Jw":{"text":"Had a lovely lunch here with my sister-\nthe outdoor courtyard here is just lovely-\nHad the","useful":0,"cool":0},"vbWqFisV0erejo7cKBMvfQ":{"text":"I've been here multiple times recently and it's one of my favorite places in the French qu","useful":0,"cool":0},"ucDRgqFl3rj9-hEaQ79z7g":{"text":"A hidden gem in New Orleans.  We came here on vacation without planning anything and found","useful":0,"cool":0},"wTfGFEF-XYk6UCDTtFFP3g":{"text":"We stopped in for their house speciality, The Pimm's Cup & bread pudding; both did not dis","useful":0,"cool":0},"_i4gR6-AkaXcujQ3Uv326w":{"text":"This place has been on my radar for a while, as I'm always looking for muffulettas to try.","useful":0,"cool":1},"wRNuSio9tDPVbBdGimcRuA":{"text":"Food was terrible but not as bad as the service. After we waited 45 minutes for a table we","useful":1,"cool":0},"COyk6I8P-JVBkJXfruxAEg":{"text":"We ate here our first night in NOLA, and pulled together a sampler of local dishes. Red be","useful":0,"cool":0},"IVhFLw3rrZuunN1raLginQ":{"text":"My husband and I had the muffuletta with a side of red beans and rice and jambalaya. The w","useful":0,"cool":0},"mcTcJw7DCvhN7PUklRFIdg":{"text":"Po' Boys are the draw at this dark, romantic, and moody French Quarter bar and cafe. Portr","useful":0,"cool":0},"14B7BjsLrHEQmfDidWAQvw":{"text":"I had a poor boy here. On the table. Dripping with juices.\n\n*ahem*\n\nNo, we are not in the ","useful":3,"cool":1},"XKI3Prwis1X4wm61SxVDDw":{"text":"Four stars for the food and five stars for the experience. We were just lucky enough to sc","useful":0,"cool":1},"eFhiMZD3kZgvxzNlzx5M4Q":{"text":"If your'e on a quest for the best Sazerac, you won't find it here. The bar is quaint, but ","useful":0,"cool":0},"r-8LPLwwfqHB0NdKSV-X1A":{"text":"Excellent! We had Noah as our waiter which was completely on his game. Quick seating, fast","useful":0,"cool":1},"hsx9P8qj0JVd_c5DeBpg8A":{"text":"Best muffuletta in New Orleans! Great environment and outstanding service. Get a Pimms to ","useful":0,"cool":0},"2xzCvCdlxCW_VhIiL-n3lg":{"text":"Amazing Pimm's Cup. Terrific Muffuletta (Beats the hell out of Central Grocer!) Beautiful ","useful":0,"cool":0},"5AO14J5roEQEDxZZIr43Fg":{"text":"We got food to go so we could have a sandwich on the airplane. We got the Mufalletta which","useful":0,"cool":0},"KIBQ4JP0R-CC-lTBvyhINQ":{"text":"The charcuterie board was great - the pâté was delicious and the tomato jam was an interes","useful":0,"cool":0},"oUq3f0GKX8qogrCnAZlqBw":{"text":"We walked right by this place the first time we went.  Napoleon House's bar has a great up","useful":0,"cool":0},"06BtM5-tldc_T0KAZ-mZBw":{"text":"I almost hesitate to write this review, lest I ruin it for the locals...my buddy who is fr","useful":0,"cool":2},"R9Xv0Rf5MuLX5JKxi7ZEvQ":{"text":"Coffee was bad and not hot, jambalaya was bad and cold, boudin had little taste and was co","useful":0,"cool":0},"ZUhydrKBmleXFDb7DhsvfA":{"text":"At first sight, this appears to be an upscale restaurant with high prices. Don't be fooled","useful":0,"cool":0},"cjZ0tuNML_ZikTR1Zs5ITg":{"text":"Over rated. Classic historical layout with odd hours of 11-5:30pm. Great poor boy sandwich","useful":1,"cool":0},"qLmIhSlYi2V_ZYdVtTbabg":{"text":"Jambalaya is excellent, smokey and flavorful. Muffuletta is advertised as a specialty but ","useful":0,"cool":0},"DDGsf3ftjjWXkcZxNA-grA":{"text":"I have to go on and on about my beloved Napoleon House when I speak of places to eat in Ne","useful":0,"cool":0},"LTmt7jG8_LI5BHUnmAfl2w":{"text":"I had a quick acceptable drink here with a colleague from work, tipped well enough for two","useful":1,"cool":0},"TipxGkCuTUOfdWwCQq1XcQ":{"text":"I only had drinks, they were awesome, in fact the best drinks I had in the quarter.  I had","useful":1,"cool":0},"fSWd_nbEskUcG3E1qUQUdg":{"text":"What a heartbreaker.  As with many other places in the Quarter, the weeknight experience w","useful":8,"cool":0},"ZHDrBDzl49i3wOF3fn9DzQ":{"text":"Hands down, these are the BEST muffulettas in town.  Yes I know it originated at Central G","useful":2,"cool":0},"RpOnRiah_XGd_6b6kxIhww":{"text":"I have been a customer of the Napoleon House since 1974 and I never thought I would have a","useful":0,"cool":0},"-sPzAHnGdMBDzOF1pH-1fw":{"text":"Do you really want to know Nawlins?? Napoleon House is Nawlins, this 200 year old landmark","useful":2,"cool":1},"MqLdbVoDrqtnO1QVud38hw":{"text":"Nice ambiance, friendly staff.  Food was average.  Pimm Cup was great.","useful":0,"cool":0},"oJnY1puxWkx49FhXWH9vUA":{"text":"Just went there for drinks.  Good ambiance.  Sitting in that quart yard there is nothing l","useful":0,"cool":0},"flahi2tWoXXvIjVMEPLC0A":{"text":"It was busy on Saturday around 1 pm.  The hostess was either over stressed, or just not th","useful":1,"cool":0},"8Fx1B6UDEFO7yppqi6l-xQ":{"text":"I loved just sitting in here. The interior was dark with sunlight filtering in through the","useful":2,"cool":1},"iRAG6-OprFGsh_mxFj1lFg":{"text":"Staff is friendly and easy going. Food is CLASSIC NOLA! I had the gator sausage po boy. Ye","useful":0,"cool":0},"MhMt-PgdZ9OXsgfy6OYEAA":{"text":"I love this place. They make a great aperol spritz and they have yummy food. I love the mu","useful":0,"cool":0},"oP4Xo-a0O-GNx6RCGJkfGw":{"text":"Lemme sum up:  Very good food, excellent service, great atmosphere\n\nI love The Napoleon Ho","useful":2,"cool":0},"YGusj0wXeIOOMVjKAExwwA":{"text":"My sister and I stopped by for a quick bite. We enjoyed a Bloody Mary and glass of rose at","useful":1,"cool":0},"7x4F5ljKGmy2SNQynde9VA":{"text":"Had drinks here    Sat in the bar area and listened to classic music in New Orleans.  Felt","useful":0,"cool":0},"nZvhS0WsJljwE9ID2s6Elw":{"text":"This is always a perennial favorite. A must stop, my husbands favorite patio in NOLA. The ","useful":1,"cool":2},"_S4cG-2XrBgK931jjzPIkQ":{"text":"What first caught my attention was the classical music playing.  A bit of a change from th","useful":0,"cool":1},"rEMzzlZTDN73QGHhZyXWig":{"text":"We stopped in here for lunch on our last day of our trip for a hearty sandwich and a cockt","useful":0,"cool":0},"Wgb4eOc4_U8wJY1VCNsaxg":{"text":"Delicious, yummy and tastes like New Orleans (if that makes any sense?) I had the jambalay","useful":0,"cool":0},"svdGouIochUNluRaXfxesw":{"text":"Historic with great food. I always go every time I am in town great food in a historic bui","useful":0,"cool":0},"dtaYDKl8S2PJKf4iSl6OCA":{"text":"The atmosphere at this place is great.  We sat out in the courtyard which was really nice.","useful":0,"cool":0},"sDzl5evBJITkYrBQSbPiRw":{"text":"Best Sazerac I've ever had, and the Pimm's Cup was perfect! Great atmosphere.","useful":0,"cool":0},"Y5ycd4UrgnZwmHtzp-vBvQ":{"text":"We went to Napoleon's for dinner the other night. We were a big crowd but the wait wasn't ","useful":0,"cool":0},"PhUyLFOLFlB_6ck179WfZA":{"text":"Reallyyy beautiful ambiance. With classical music blasting, for a few moments you'll be co","useful":0,"cool":1},"bqDzQBTcI5axo7nrToGWaQ":{"text":"Muffaletta was DELICIOUS-every flavor exceeded expectations,...music provided perfect ambi","useful":0,"cool":0},"kiROHFdm7fxxPtBzlNb-bA":{"text":"Most items very good!\nSkip the bread pudding...very weak, shrimp remoulade poor.","useful":0,"cool":0},"Ww1gXTcyMp96GQR8lMr_NA":{"text":"The best muffuletta I have ever eaten.  It's worth a try.  I couldn't  eat more than a qua","useful":0,"cool":0},"GkHpVZ1eHAT_0lR9l_2D3Q":{"text":"Prepare to wait around a lot, be ignored, feel hurried, and have your money snatched up as","useful":4,"cool":1},"JcNrot5SavPqfRZmeP6rRQ":{"text":"Neat place.  The Sazerac (drink) was excellent, as was the muffaletta.  I'm not a connoiss","useful":0,"cool":1},"Y2mQ3HO8xTwgsj1eyFWHhA":{"text":"Went here for a late late dinner one night while in NOLA. We literally stumbled upon it de","useful":0,"cool":0},"0YBdL9E-qQCpiWa-QHDt4g":{"text":"Awesome place!  However, they were only serving drinks since they just changed to off-seao","useful":0,"cool":0},"qGaFhhLJRvMPgpLegV9SfQ":{"text":"This is my favorite bar in the world. The pace is slow, the building is ancient, the class","useful":0,"cool":0},"XFKzvKURWwbDinWpNSdhBA":{"text":"We stopped by the Napoleon House for drinks after dinner, and while it's a cool place to s","useful":1,"cool":1},"7ibVbYVJ2PG1FVRBml1AZQ":{"text":"Stopped in for lunch after a recommendation from our Garden District tour guide, and we we","useful":0,"cool":1},"c9547rMTOahgmwYcxLJK6Q":{"text":"Quite the experience of a chilled Tues around lunch stroll about town.  The man knew his w","useful":2,"cool":1},"I-gc5iyXzk9ddlWX2mqtiQ":{"text":"Stopped in for a late dinner and loved the decor. The Watermelon Pimm's cup and Shrimp Rem","useful":0,"cool":0},"yUCOklSZH4Za4V-DS7dghA":{"text":"no complaints - well maybe the single draft choice of Micheleobs-something-dark.  I tried ","useful":0,"cool":0},"RPBjiFZkNPSzFmhB7sE1JA":{"text":"Great restaurant in the heart of the French Quarter   Had the muffuletta   Delicious   Als","useful":0,"cool":0},"gb0d0vSKcpd5T-cU66s8Sg":{"text":"I have been eating at the Napoleon House for many years. It has always been a go to place.","useful":0,"cool":0},"mAgj5bDlriV7HulcyPX5tA":{"text":"I came here with a group of friends for dinner while visiting New Orleans. The selection o","useful":1,"cool":0},"sNPxp7wa2YOedbfFDlyUzA":{"text":"On Vacation with the wife at New Orlean and a Colleague recommended me to get a Muffuletta","useful":0,"cool":0},"ymGSFnf5IG5qUTfDwSkhEQ":{"text":"Love this place! By the looks of it you wouldn't expect them to have incredible Bloody Mar","useful":0,"cool":0},"7hcwqHeO7Iiv5-tl2Z-BMA":{"text":"For our flight back to NYC, we decided we wanted to bring a nice, light dinner -- the Muff","useful":6,"cool":8},"Yf0k7Nv0qXVSo71i1doUYA":{"text":"For a cheap eat oozing with French Quarter charm, the Napoleon House is a perfect spot.  W","useful":0,"cool":0},"dbhbfpGwa6ngmOGU-XAttg":{"text":"The food is okay. The drinks are very good. Napoleon House is one of only three places in ","useful":2,"cool":2},"tEXzGZ0DC5H7Ob3Aomrzig":{"text":"Five stars on the Muffuletta alone. Potato salad and Pins Cup were also great.  Price was ","useful":0,"cool":0},"4wgOI6ipTwz_E7nZzwUUig":{"text":"Walked in hungry and thirsty. Left 15 minutes later after not even being approached by one","useful":2,"cool":0},"nDuxk3JJ_mnh8B-Pm9oPLQ":{"text":"I felt a bit insulted by this place. The menu says gratuity is added for parties of 8 or m","useful":2,"cool":0},"2c4P1aIGD6oZjYHSSwDoaw":{"text":"There really is no other \"required\" visit for me than this French Quarter Institution.  It","useful":0,"cool":1},"y6x2riozNd52qJ-la8jEtA":{"text":"We just went for drinks but Napoleon House is a old restaurant downtown. The pimms cup is ","useful":0,"cool":0},"deateWrYpBZ-WYz7kV28OQ":{"text":"This is one of my favorite spots in the French Quarter for food, however I strongly believ","useful":1,"cool":0},"Y6vsgEWYPoZWHGzKErTshg":{"text":"Great lunch with my compadres from work. \nThe History of the restaurant and food was great","useful":0,"cool":0},"-X0bYLrRng8J3Z2kZ2t5FQ":{"text":"Just so so. Mitch was super slow server and food/drink was only so so. The ambiance was gr","useful":0,"cool":0},"l5PWW4XICs7LuDjkzK9ArA":{"text":"I love Napoleon House so much, I even brought my mother there for dinner two nights in a r","useful":0,"cool":0},"rEI-uAQYSijdvUcWNTv0Hw":{"text":"Great ambiance, delicious food, local bar with extras.  Courtyard seating is preferred.  A","useful":1,"cool":0},"qHCZEvLFC5MqYfUU8gfrqA":{"text":"I thought I didn't like muffulettas. I was wrong. These are so good, as were all the other","useful":0,"cool":0},"cNARJM_c4Uk6ud27qSsVuQ":{"text":"I was in New Orleans for my second time on a business trip about two weeks ago.  Expensing","useful":0,"cool":0},"5_fucKjsZmsl_foZjvSCrA":{"text":"My family and I chose to eat here based on a few other Yelp reviews. We couldn't all decid","useful":1,"cool":1},"HZcwu6T-rBpUoDtXemmLjg":{"text":"If you want to eat an awesome muffuletta sandwich that is huge, this is the place to go.  ","useful":1,"cool":0},"wLkQ-WrjAKNl530EucJKpg":{"text":"Good food and good drinks! We sat at the bar both times we came in. We just got appetizers","useful":1,"cool":0},"dO7_Rdu1SA8PbtLsGqOGyA":{"text":"We stopped by here for an early dinner because it was near the hotel, and seemed to be rip","useful":1,"cool":1},"ef3qiCLc3QcNYXinNJNE_A":{"text":"An old school oasis in a neighborhood of insanity. The birthplace of Sazerac has a definit","useful":0,"cool":0},"QYDsHQEMtKXUWBmuG9wUSQ":{"text":"This review is only for the bar. We ordered the Pimm's cup to go and was very good! They c","useful":1,"cool":2},"Bh2oYP0zL6u0FFmxLbaKww":{"text":"A little overpriced.\n\nBut everything I ate was good, considering the area.","useful":0,"cool":0},"Q6kStSGUb99aeTEkJcRg0g":{"text":"Early October 2015\nDinner 7pm\n\nFor our final night in New Orleans, we wanted a special eve","useful":3,"cool":1},"YRtLaiH87QaDf2Com78-GA":{"text":"I read the reviews before visiting this restaurant, however, overall I left under impresse","useful":0,"cool":0},"09khjxw8yTVM3Hcz1PPiow":{"text":"Coming here since 99 for The Pimms cup which is great... Muffuletta pretty darn good but e","useful":0,"cool":0},"FeyPlxDcpflpA3VKauIEgg":{"text":"There was a huge crowd outside for lunch when they opened, so we kept walking past and dec","useful":1,"cool":0},"HUOtSf6ciSoF5psFDEWf2A":{"text":"Gave this place a shot, because of the interior and the hidden patio seating in the back t","useful":5,"cool":0},"uWUJ_qW3Zl9p7XKMntoAgA":{"text":"I read that this was the second-best muffuleta in the French Quarter, so I scurried down t","useful":1,"cool":0},"yxXYbc-zqgC2pdi2wh0cxg":{"text":"I always hit the Napoleon House when I am in NOLA because I know the family. Was curious w","useful":0,"cool":0},"d5qpeHEV2m8qSH6l8Yy3rA":{"text":"We had such a fun time this week at Napoleon House After a morning of walking, it was love","useful":0,"cool":0},"keOmTcM5ZwGC0pw6PzKqYg":{"text":"Great grub. Open late. Friendly service and people sitting at the bar. A fun place to eat ","useful":3,"cool":3},"ZQ5nY8RU8i9ZX3MvAmp9fA":{"text":"I give four stars for the location and service.  We are outdoorsy types and found it tough","useful":0,"cool":0},"IyRKP3EgPPQsNTu-aT6IZQ":{"text":"Even with all the press, movie scenes, and tour guide bylines, this place has managed to a","useful":0,"cool":0},"GG2uG8JrgeOW0piB-nM9TQ":{"text":"We loved this place so much we ate there twice during our vacation to New Orleans!  Normal","useful":1,"cool":0},"G6ZSGR_viAQcQXheymnwqQ":{"text":"Great place for red beans and rice. Probably the best in New Orleans in my limited samplin","useful":0,"cool":0},"9Bqm-ZNF3tnL3JTvmYmIJw":{"text":"We were originally heading to K Paul's, but upon finding it closed, we looked for the next","useful":1,"cool":1},"zVq_lsk2CXR7cqbEDBye5Q":{"text":"If you like the white horse tavern, Pete tavern and any old bar that has been around for a","useful":0,"cool":0},"QF5RYJCT6N2jQ5pyKwRv7Q":{"text":"Service was very friendly.\nI had a mufalletta and a pims cup, girlfriend had red beans and","useful":0,"cool":0},"YOkCL3tzv46uBGZvv8WIsg":{"text":"My first meal on my second trip to New Orleans.  Muffuletta and Pimm's cup were awesome.  ","useful":0,"cool":0},"GZexLrIHsmv_pfconxL0Qw":{"text":"Really good and relaxed. Definitely get the boudin sausage and the House drink. I had thei","useful":0,"cool":0},"csUhmRW_ytC1L92Jlwzj8A":{"text":"Drink and a meal mid afternoon during the week.\n\nHistorical place with a Napoleon backstor","useful":0,"cool":0},"pgjw-OKmPyNVDznHdbUYNg":{"text":"Always a fun stop. Quality is mixed. I've been there when the gumbo and red beans and rice","useful":0,"cool":0},"eDjlgHwNuJ2CfjTdcCVbcw":{"text":"Best muffuletta! Bread was fresh and not hard, olive salad was perfect. Just an overall pe","useful":0,"cool":0},"UoBHrCkB4WJtT9oB6IKtFg":{"text":"Lunch was great!  Nice atmosphere. Enjoyed shrimp salad in avocado half and split a 1/2 sa","useful":0,"cool":0},"1lt3FjWbhl17Zn5wDIs7Ew":{"text":"Yum, awesome muffuletta and drinks! Glad we came here on our first day in New Orleans, ver","useful":0,"cool":0},"nay0LfXWBh3xzmBSBLHsMA":{"text":"you know, i only wanted to review the napoleon house.  why did i even bother to look at th","useful":2,"cool":3},"IX3N_8izLMGtJiSlOX8ISw":{"text":"HUGE muffuletta sandwich! I ordered the half for myself and still couldn't finish it. Most","useful":0,"cool":0},"NcZVP2VcMyCZfiaAvdFUcw":{"text":"Food and ambience terrific here, really enjoyed my visit.  I had a muffuletta sandwich and","useful":0,"cool":0},"bCpIOP3IVNZDNFeUVYRIpg":{"text":"This place is old world. I don't like all the Napoleon shit because Napoleon was a jackass","useful":1,"cool":0},"r3sSPZxvUz9UZRbPsQxJ4g":{"text":"We have dined at this establishment on several occasions.  Post katrina, the service was s","useful":0,"cool":0},"ZZ_8ypO0A-xnwYG4WOwFhg":{"text":"I've always enjoyed the food and drink at the Napoleon House - muffalettas, po-boys, seafo","useful":3,"cool":2},"KyB0ZLBy1t5YKHLn-0rqKA":{"text":"The food tasted like it came out of a can and it was served in plastic bowls and plates. C","useful":0,"cool":0},"emOQPzwlIg9HI9qMZ56GUg":{"text":"Stopped in for lunch.  LOVED it all!  The Pimms Cup is the best I've ever had.  Also the b","useful":0,"cool":0},"qPZq5rI-0qKy9unw9w0oCw":{"text":"Took an early lunch break before our cemetery tour. Greeted and seated immediately for our","useful":1,"cool":0},"jq7O52qup3jiKuHpuygVtw":{"text":"I love this restaurant. The food is great and well priced. They have my favorite mufalatas","useful":0,"cool":0},"EXQ-gaaEjrSs_e-MKQzzuQ":{"text":"Went for a long lunch break and was very happy with the prices. Other restaurants in the Q","useful":1,"cool":0},"pnQw8Tg_V2_EYB40QBByQA":{"text":"Good food and a wonderful muffuletta!! The service is hit and miss though. They seemed und","useful":0,"cool":0},"Hj051HDoYMXU8VJLaLgXrA":{"text":"Great place to grab a drink at one of the oldest places in New Orleans.  This bar/restaura","useful":0,"cool":0},"1fF3AcvRaIrSyHlse2ikhw":{"text":"If you want a mufflatta and jambalaya this is the place. Small things like grilling the ha","useful":0,"cool":0},"oT86GJeLXFhAgoEDl8uzQw":{"text":"You go here for the ambiance. It's got a cool vibe and a cool history. There are, however,","useful":0,"cool":0},"BTLB-p6RqYKp-EDOmbqKUA":{"text":"This restaurant was recommended to us & it didn't disappoint. I had to drink a Sazerac and","useful":0,"cool":0},"avXg7U7K9jx2634flYyzQw":{"text":"A friend and I popped in on a Friday night -- no wait, fast service, and great food! We in","useful":0,"cool":0},"ZnVpqxZaENhCFP6swUni1A":{"text":"I'm really happy Napoleon House was our first meal in NOLA. Dining under the night sky in ","useful":0,"cool":1},"oQou5DCbRLuntPhxkyWgkw":{"text":"Atrocious service!! Walked in  with a party of 4 and were seated immediately. Gave our dri","useful":0,"cool":0},"wCXwYcQPLhgR7ZmRpGFRAA":{"text":"Decent food and drinks, but I feel like we can put a man on the moon but they can't split ","useful":0,"cool":0},"t2CvbnlAL6zXIxaOnS5otg":{"text":"I got the grilled chicken sandwich with poached apples and an Italian cream cappuccino. Th","useful":0,"cool":0},"E1cuAwGB3_2XkshyEW3uKg":{"text":"Home of the original Pimm's Cup.  This is one of may New Orleans institutions.\n\nIt's an od","useful":0,"cool":0},"m-IgcKymVxotWtB2w_M9Fw":{"text":"Great lunch place. Dark. Very 1700s decor. The server was spot on. My husband had the Rube","useful":0,"cool":0},"mUjibNBTwO2sI3uL0FN64Q":{"text":"The food was good, but underwhelming considering the price. Service was very slow and our ","useful":0,"cool":0},"KlsLgSVVhBchaqK9qWU--A":{"text":"Eek! I don't what happened since I last visited this place a year ago. Against the advice ","useful":3,"cool":0},"gbLSvK9zzCEKYaGeV6pJZw":{"text":"I'm making my way through Eater's \"14 Essential Cocktail Bars in New Orleans\" and this may","useful":2,"cool":1},"i3cVmZUaCMgXy206e9_szg":{"text":"For Muffuletta's...Napoleon House is the place!  Located in the French Quarters the restau","useful":12,"cool":15},"IpueLJ3xsevssT2_ABOBAg":{"text":"Still one  of my favorite places to get a drink. If I find myself in the quarter by myself","useful":0,"cool":0},"ePFd9IrgVhHBbonTY7XlIA":{"text":"5 stars isn't enough. The wait staff was friendly and helpful, the food was exactly what w","useful":0,"cool":0},"ng0iop2I8zUrodoor1apyw":{"text":"Declared a National Historic Landmark in 1970, this restaurant was resident to Mayor Girod","useful":0,"cool":0},"ckMZYfquB6vxwL7CCjrcfQ":{"text":"We ate lunch here on Oct. 27, 2014.  Great place for mid-day cocktails and lunch.  We have","useful":0,"cool":0},"tDuGmjaNz-Y-92-zOIRclA":{"text":"Great place.  Small and intimate.  Beer selection good with write a few local brews.  If y","useful":0,"cool":0},"DPGu2NuAsbeyXBL8CGLLtg":{"text":"We went to Napoleon house during a rain storm this past Saturday night and enjoyed a leisu","useful":0,"cool":0},"XO7gLdmS3AsPNFs4EHjo1g":{"text":"Love love love this place!  Great introductions to Pimms and the boudin sausage is to die ","useful":0,"cool":0},"N7tsSoi_PTiApdR8MnX-qw":{"text":"For somewhere reasonably priced within the French Quarter, this is a good spot. I tried th","useful":0,"cool":0},"wbeY4vfbs2yg-G5yTMZzcQ":{"text":"Must see for a Pimm's & great atmosphere! The atmosphere has an amazing old world bar feel","useful":1,"cool":0},"eJbDnuIuSOckAhA5tvdVnw":{"text":"Nice spot on a corner in the French Quarter. Didn't seem super touristy like some other re","useful":0,"cool":0},"i7sosKheqcGHV11ybVnWzw":{"text":"Pretty good place for a quick lunch.  Request the courtyard so you don't have the possibil","useful":1,"cool":0},"D78KNG0UHOiD9MH_uzRNWg":{"text":"As good as it gets. \nMuffuletta, Nola beer.\nDon't miss the original, the best muffalata sa","useful":0,"cool":0},"X2C5VpKjKvNvsL9qral1-Q":{"text":"According to a local friend, there are only two places to get a muffuletta in the Big Easy","useful":0,"cool":0},"0E70BFL4S_6W3eQP9648QA":{"text":"This was my favorite restaurant we visited in New Orleans. We ordered a muffuletta, a Plan","useful":0,"cool":1},"uph21rs_kVXTw8uWQZ5i5Q":{"text":"Classic old New Orleans in a fun area of town. The mufuletta was excellent and the Pimms C","useful":0,"cool":0},"DR13OrU35Z1_sqofB3T1EA":{"text":"Amazing quaint find in the French Quarter! Unassuming when you enter and then you are plea","useful":0,"cool":0},"KHhcQ6t1Ouh2D0ZwDLWHtQ":{"text":"Awesome place to eat. We got some really good mixed drinks would definitely recommend. Als","useful":0,"cool":0},"D9TSgFGoTqdmKV1m0cM4Qw":{"text":"What a special place to dine. The atmosphere and decor are something out of a movie set. O","useful":0,"cool":0},"O9Ond4s7PGNLJab7gCZWJg":{"text":"Literally horrible. Idk if this place used to be good, but I have had better jambalaya fro","useful":0,"cool":0},"_Ns9wH8J9xmRYUIXTPl2Wg":{"text":"What can I say... the location is great... the vibes are fabulous and the energy gets you ","useful":0,"cool":0},"qZaEo2wzW9jpUxk2kqRZww":{"text":"I have been coming here for years and just had my first bad experience. The waiter complai","useful":0,"cool":0},"Xtusby3lRlPpi0nxb7BMRw":{"text":"BEWARE or roaches and rodents. Myself and two of my friends went to Naploean House around ","useful":0,"cool":0},"PYCqcDFvq1iXabf9sfdAXw":{"text":"We came here after a tour guide recommended this spot. Napoleon House also known as the at","useful":0,"cool":1},"hP_cFP-FBeQe9Ofs1fIA9g":{"text":"We came here because it is said to have \"the best bloody Mary'sin New Orleans\" ... and the","useful":2,"cool":0},"NKuKyW9rlDue22tKSliS9w":{"text":"Had NOLA expats in town last week and we had lunch @ Napoleon House. We ordered Ginger Pim","useful":0,"cool":0},"mVNNbRxLcgM3PS2Spb3ClA":{"text":"Excellent 1st stop on our trip, just getting in from the flight, we took a walk and hit th","useful":0,"cool":0},"ELk7A-XZJzUWlrLC-ZivUg":{"text":"Unfortunately food wise I wont be much help here because I just got the ceaser salad.  At ","useful":0,"cool":0},"YMn0Ra7NKSOMMiCHjX5O_A":{"text":"Tiny hole in the wall that makes THE BEST Ramos Gin Fizz.....so good that we went back for","useful":1,"cool":0},"dEITpsKftgeA4AdU4ttJdQ":{"text":"If you're near here eat here! Perfect service, perfect food, great price. Buy a muffuletta","useful":0,"cool":1},"GIGpqCkt_U3sfn6rbE-7Qw":{"text":"Came here with a large group on a Friday night and had no trouble getting in. We had had a","useful":2,"cool":1},"9k9hLKo2yBaJSh-lG-PUcg":{"text":"Eh... it's alright. \n\nI love the ambience though, I will say that. There's something about","useful":1,"cool":0},"8MgCqgDV12nbrDparrlymA":{"text":"Didn't eat anything but the Muffaletta, but the ambiance was nice, the Abita was cold, and","useful":1,"cool":0},"iVjPxvcZhsAPt1JD0HZhRA":{"text":"So yummy!! This place had a great atmosphere in an older, historical building, with great ","useful":0,"cool":0},"CTwYIsLL603s4DSeGdleaw":{"text":"I highly recommend eating outside. Even though it was raining, there is a covered area and","useful":1,"cool":0},"Ug8Oqlj8NE7wu2BRV0MPAQ":{"text":"Mixed feelings about this spot.  We found ourselves here at just before 11am when they ope","useful":2,"cool":0},"IfnI09HaXU_3f23GwfRFgw":{"text":"Not sure how I've never written a review for Napoleon House. Have been coming for years no","useful":2,"cool":0},"u1lixl0JV_xAbh7zR268yQ":{"text":"Wandered by here looking for a bite to eat and so glad we did. Simple but well prepared fa","useful":0,"cool":0},"FbLar4LQMOskoeXC4k_3JQ":{"text":"Cute spot nestled in the French Quarter! We popped by on a Saturday around 7 and there was","useful":0,"cool":0},"iNrwcAsZPTYv7HGAzg0I9Q":{"text":"We were doing a walking tour around Bourbon and our super knowledgeable and local tour gui","useful":2,"cool":1},"5ceBFOu-88LCKOlBDBY3Ig":{"text":"This place is amazing! I couldn't possibly love a cafe more. They serve Pimm's, the food i","useful":0,"cool":0},"f80-VQzOI55tfueWYrthhw":{"text":"Popped in to share a Muffaletta.  I'm not an expert in this local dish, but, I LOVED it.  ","useful":0,"cool":0},"ElVovTiXfbMIoS4H4NNpfw":{"text":"1st time trying this restaurant.  Would definitely come back!  Mufuletta was really good! ","useful":0,"cool":0},"Nk-lzAnh1UFqKdginmo4Ng":{"text":"My favorite meal in the French Quarter!  We stopped in and ordered the Muffaletta sandwich","useful":0,"cool":0},"30_05ua9hy9Z4BZCsnX8tg":{"text":"Excellent location. Stellar bartender.  Awesome drinks. Great vibe. This bar was a block a","useful":2,"cool":1},"Z77u3DyDWMgpNxvz25s9Sw":{"text":"Lovely atmosphere! I'd only go for a pimm's cup or a muffaletta though. The gumbo and red ","useful":0,"cool":0},"quHbGRxpPgsXY6TIy8YSKg":{"text":"Great food in a historic venue.  Food was superb and wait staff attentive.  Cute courtyard","useful":0,"cool":0},"XpPMRgs4GBW1e4HWoY6uQg":{"text":"Okay- if you're going to New Orleans, you're bound to eat Creole food every night or so un","useful":1,"cool":0},"0X6mMtaDNjhbMXB6eDyiLw":{"text":"Came in here as we were just walking by from our hotel and were wanting a light meal our f","useful":0,"cool":0},"0pODvUBXHmRWMyAwKoI5jw":{"text":"The cocktails are good and the location and decoration really nice. \nThe food are low qual","useful":0,"cool":0},"cS-L19yQKsiHy60T5Xf29A":{"text":"This place was decent for a late lunch, but not amazing.  We split a 1/2 muffaletta & a bo","useful":0,"cool":0},"rsjZMHr1dIqYHKhkVFfnwA":{"text":"Our first foray into NOLA we researched where to go and this place did not disappoint!  No","useful":0,"cool":0},"jeXYag8BL1WHiFdeK-tmgA":{"text":"Somehow it was 90 degrees and balmy just outside of Napoleon House  on that little stretch","useful":3,"cool":4},"DYAcDRlYDFiIs6vfOevw4Q":{"text":"Napoleon House is in an old building off of Chartres St in the French Quarter. It was a ve","useful":0,"cool":0},"9h5Y35R_71rHX4j8YP7Lkw":{"text":"Nice little restaurant we came across while on a tour of the French Quarter! We started wi","useful":0,"cool":0},"My52JvMSFoNvxUusPytm-Q":{"text":"For the past couple of decades I've stuck to my favorite restaurant when visiting The Fren","useful":3,"cool":2},"RSvo-kcXE8NnZd6kTl_4mQ":{"text":"Had a lovely dinner at the Napoleon House. Definitely should try the Muffuletta. The half ","useful":0,"cool":0},"ioW3E-0ay28jiO4tpzsTVA":{"text":"Not open \nEven though they say they are..\nMaintenance can be done after hours with proper ","useful":1,"cool":1},"LOQG_7qFYCm6G45gQhZuOQ":{"text":"Stopped in here for a quick drink on my last day in NOLA. Had the Pim's Cup and it was dee","useful":0,"cool":0},"uqnlRLJjo4Cz0pZxhHhQ3Q":{"text":"A fantastic traditional Pimms cup. Satsuma version was subpar. Didn't taste like fresh Sat","useful":0,"cool":0},"NSmhyGJs4pLQzNMO0CTcxg":{"text":"We stopped in at Napoleon House at about 9 p.m. on a rainy evening and were pleasantly sur","useful":0,"cool":0},"svQuOy-1sPaOPYfiLR8BOw":{"text":"The best muffuletta sandwich ever!!!  We stumbled upon it and were so happy we did.  Gotta","useful":0,"cool":0},"mZJ7Gm8T8O-2eQlIrdoPHQ":{"text":"This restaurant was recommended by a NOLA local and thank goodness we took her advice!  De","useful":0,"cool":0},"XnxZs67IQ42LbV2YulRU6Q":{"text":"I really wanted a muffuletta sandwich before I left nola. I ran out of time and did not ma","useful":2,"cool":1},"5NAEtluag50jJmkDcFMZSA":{"text":"Enjoyable atmosphere and delicious muffaletta!  I highly recommend stopping in when you ar","useful":0,"cool":0},"BdYi526AzLUrvx3I5XzzbQ":{"text":"My first meal in New Orleans!  Yum.  We had seen pictures of Napoleon House online and it ","useful":1,"cool":2},"b7bzTytTcnXu2jmpiaWbYw":{"text":"Decent bar with a lot of history. We went for lunch, service was decent but the food was j","useful":0,"cool":0},"j9K8YCz96jzWn154tBHb9A":{"text":"Such a cool spot. Great drinks (Pimm's Cup). Had the charcuterie app with really smooth, t","useful":0,"cool":0},"xFj3u2_ND9ljYCv22onhiw":{"text":"Food was huge and tasty. The server was very nice and polite. The place is cozy and sweet.","useful":0,"cool":0},"1_v2edrJPl3CP_CefITTvQ":{"text":"The Napoleon House was recommended by one of our tour guides, with the historical distinct","useful":2,"cool":3},"Q6zWHKxTWhUQah7SJ55LPg":{"text":"The Best Private Event Venue in the City\n\nJust held an amazing private event on the second","useful":0,"cool":0},"Twl9r_CPhodHOwEl_8aywA":{"text":"We enjoyed a great muffuletta and muffuletta salad here! The atmosphere is very New Orlean","useful":0,"cool":0},"XRASOxlxQ8tc-RbHQPbSJQ":{"text":"The muffuletta was amazing!  Their version of the Pimm's Cup is spectacular.  Great place ","useful":0,"cool":0},"J6cyMzLl5h4lFAdB6c5AOg":{"text":"Pimm's Cups were excellent (refreshing on the warm patio with the fan blowing). Shrimp po ","useful":0,"cool":0},"HEINaU-BNQ3IEMPRBMNk1g":{"text":"On my last trip to NOLA I saved Napoleon House for my last day, because I know that if I d","useful":0,"cool":0},"Toe_UDBwbthLQTcfFYgQgg":{"text":"This was a recommendation from one of our tour guides so we made a special effort to try t","useful":3,"cool":0},"lvdhpJqbeonpg1PVMtBz9Q":{"text":"Subpar service and food. Don't waste a New Orleans meal here. Classic tourist trap. Just m","useful":0,"cool":0},"J_Cs_RSoiHpKFlvdonI55Q":{"text":"Eeerrrrrrrrrrrrrrrrrrrrrrrrrrrrrrtrrrrrrrrrrrrrttrttttrrrrttrrttrrttttttrttrrrrtttytttytty","useful":0,"cool":0},"qQi67p-vgIOZVpKI7tmSbA":{"text":"I like things with the word \"muff\" in it.\n\nWho doesn't love a nice, fragrant muffin? How a","useful":23,"cool":23},"aWXnWEi8pe-eAzhYFrNSmA":{"text":"All I can say from start to finish is WOW! The muffuletta was out of this world, the jamba","useful":0,"cool":0},"uXW1rYa-4ZLjwxVePHAnFQ":{"text":"Absolutely delicious! Our table had the muffuletta, meatball sandwich, Italian sub, jambal","useful":0,"cool":1},"x6BkNn2uEGksrdG51pLm4g":{"text":"Napoleon House is historic and delicious. Named after the man himself. It's the birthplace","useful":1,"cool":0},"6WWi_0b2LyYNXQkiED59ww":{"text":"Feels like I'm in France...service is the only thing that prevents a 5 star review. The wa","useful":0,"cool":0},"Y4H5-sZpId3yRcfRFp2hXQ":{"text":"When dining and day-drinking in the French Quarter, I can think of no better spot to spend","useful":1,"cool":0},"evAAJZmeiBtVPvpsKJitjA":{"text":"Historic spot in the quarter. Recommend the English Pimms Cup (more gin). Good spot for lu","useful":0,"cool":0},"dqhpyugq9yJCVb-jxalRjg":{"text":"It is SUCH a shame that the waitress we had absolutely ruined our experience here. The foo","useful":0,"cool":0},"jR-QM_WEltFmx8uesF5DuA":{"text":"I visited here last week for lunch and it was just lovely.\n\nHad my fist PIMMS CUP - so gre","useful":2,"cool":0},"U-AuxbSGLy2mH5tlMMMAAw":{"text":"I just recently returned to New Orleans and a friend and I enjoyed a few Pimms outside in ","useful":0,"cool":0},"a8Olme2if1HlY2MH_m-50g":{"text":"Solid cocktails, good grub and some nice hard to find bourbon.\n\nSplit a 1/2 muffuletta san","useful":1,"cool":0},"nJarxpI8efq_hXMe1Gdviw":{"text":"I really liked this place for lunch. Cute interior and really friendly service. Went on ou","useful":0,"cool":2},"XGcx2ka2HZxJUZvc9KP8MA":{"text":"One review had said they hadn't found the servers very friendly, but we found the opposite","useful":0,"cool":0},"blN4cf1ow9KH7DKCh3yqZA":{"text":"Sunday - needed something adults and teens. Pull enjoy.   Home run!   Great sandwiches, ap","useful":0,"cool":0},"NJurrSJRFjEcF09FNrnyFA":{"text":"Used to be a favorite. Not anymore. Unfriendly service (guy waiters - girl hostess was nic","useful":1,"cool":0},"_ZV72aP182Uy7epcgM3hGw":{"text":"The Napoleon house building is rich in history and captivating in its authentic decor. It ","useful":1,"cool":2},"Hb67R3lgUB9PFCa414GJiQ":{"text":"Walking around Lundi Gras night looking for a place that wasn't packed for dinner in the F","useful":0,"cool":0},"4vvARnOd7fFmblrhoTsmkg":{"text":"So many good reviews -- and then there's this one ... \nBeautiful, beautiful setting, great","useful":2,"cool":1},"YZjK4PdkoD4URSmoD00CEg":{"text":"I was surprised that I liked this place. Beautiful courtyard.  Very old New Orleans.  I do","useful":1,"cool":1},"okGhJebXdYhfvHymkzYWdg":{"text":"Great little courtyard inside.  Had the best Reuben sandwich ever!!!   The muffuletta sand","useful":1,"cool":1},"wRbZbp2TSSjrmboZbJgNkA":{"text":"We came here on the first day of our trip and the food was magnificent!! We had some boudi","useful":0,"cool":0},"LQie9cexOzAQlBM92aqIoQ":{"text":"On our recent trip to New Orleans, two natives recommended the Napoleon House for their mu","useful":0,"cool":0},"VS0O8b89tMap1_QzBzh54g":{"text":"I won't delve into a lengthy academic discussion of the building's interesting history, si","useful":0,"cool":0},"XGyUrXvG2lbCKS044n1erA":{"text":"this place is easy to miss. it's right at the corner but it's old gray fascade is easy to ","useful":1,"cool":0},"7AXMk-WYHLGkxM5ZHMH2Ww":{"text":"Been here twice in 3 days.\n\nThe first time we just came in for drinks and a quick snack. W","useful":1,"cool":0},"ymphOlhbawhqfVvzEdUEfA":{"text":"One of our better meal experience's on our visit. Wait staff is efficient and personable. ","useful":0,"cool":0},"IuOSxiCOk-3RU21IZQVLwQ":{"text":"It's hard to add anything to what's been said by the other yelpers, but this (and Galatoir","useful":0,"cool":0},"ftK29o3AoMbsuh9cv1bQ3Q":{"text":"Stopped in for lunch. This restaurant was on my planned list of places to try. We weren't ","useful":0,"cool":0},"Kl0an3SkR2gbiDQldcD7DQ":{"text":"Amazing atmosphere. We went for lunch and afternoon drinks. The perfect sunny afternoon pl","useful":0,"cool":0},"Kc7txOZYpJC93ALen6u4Ig":{"text":"4 1/2 out of 5. Again, listen to the locals. This historic and beautiful location offers a","useful":1,"cool":0},"iKfl_CDx2XnoQimlavslpw":{"text":"Came here for lunch, hubby had the grilled cheese, I had a salad and we had a cheese plate","useful":0,"cool":0},"z1kou0OCXqkxPq0tlMpDtA":{"text":"I was in NOLA for a conference and wanted to find somewhere authentic to eat that wasn't t","useful":2,"cool":2},"0L1mClU2NGdhlIewKa2lqg":{"text":"The combination of service, food, atmosphere, and pricing is what gives this place 5 stars","useful":0,"cool":0},"zEG63q3LX46yyQ9g2G62Vw":{"text":"Attention-Attention-Attention, the Napoleon House is not a Tourist Trap! In fact it's a pr","useful":4,"cool":3},"cfqaNDJbVFIhzbfvABPtYQ":{"text":"This restaurant is extremely wonderful and serves a great warm/ baked muffuletta sandwich.","useful":0,"cool":0},"HOAZEFkmLAx9Enb5JjNX3Q":{"text":"This place is really, really great. It's nestled comfortably within an ancient building in","useful":5,"cool":5},"nEff2FNa-AquprH-v-VRdg":{"text":"An exceptionally beautiful bar and restaurant with a courtyard that is romantic bordering ","useful":3,"cool":2},"Dv201EqiVUlL4W6z7qI8IQ":{"text":"Excellent place for sandwiches, especially hot muffelatas ( sliced meat and garlic-olive o","useful":0,"cool":0},"ptxw-GE5DWAJnaOwAMUdUw":{"text":"Awesome building and history. We loved how laid back the atmosphere was with very good foo","useful":0,"cool":0},"xlrDj9kcrtQgFsIivynrgg":{"text":"I have only been to the bar, I have not dined here. They mix awesome drinks, and the room ","useful":0,"cool":0},"Vj2hqoyAGS1DJkWaeSpRPg":{"text":"Matt the server needs to find another profession, the person at the door needs to be demot","useful":0,"cool":0},"iLqyRrMp1IcPAAd3w1c-yg":{"text":"Great food and an ambiance that will take you back to a slower time!\n Bring your appetite ","useful":0,"cool":0},"mcKCZ8GveIeDT5BZnWDREg":{"text":"Meals were okay. Ambience was okay. I had the shrimp and avocado - was missing a little ze","useful":0,"cool":0},"iit3JGhexzCFWfTU0veIFQ":{"text":"The food wasn't anything amazing, but it's a fun place for to gather friends for dinner. T","useful":1,"cool":1},"LY8X8MCjQD5i7Shyms6OzA":{"text":"Loved Boudin sausage. We sat courtyards but I think indoor has more historical interior. L","useful":0,"cool":0},"LbRMB6nt7Ncy3Dk3PIW0_Q":{"text":"Went for a quick dinner. Not too shabby. Nothing to really complain about, but nothing out","useful":0,"cool":0},"s6WzOw4dQudu-PUdD_u1vw":{"text":"Pimm's cup review.\n\nwe went here to try the infamous drink. I was disappointed by this dri","useful":1,"cool":0},"PjPhzIeSmx-IMPXg5dflEg":{"text":"Great food, best prices in the French Quarter. Kid friendly. Cool room. Very pleased.","useful":0,"cool":0},"evnbnrk9_qpaydYRk8eCcw":{"text":"Local and trusted friends recommended the Pimms Cup but we arrived to find the Napoleon Ho","useful":0,"cool":0},"wMQGX0eQZWIiUZe3bbpi-g":{"text":"I would give this place 10 stars out of 5 if I could. The food was amazing. I ordered thre","useful":0,"cool":0},"b2myk39VLu7zV7X03VF09Q":{"text":"First time here we only has a couple Pimm's Cup cocktails, which were very refreshing!\nWe ","useful":0,"cool":0},"1cRyWTahTvg962_QkOixbw":{"text":"Even though I'm from Louisiana and have been in the French Quarter many times, I decided t","useful":1,"cool":0},"i7iDHxAAU7bjcyrciSDWjQ":{"text":"This place was packed but I'll leave it there. The only reason we showed up was to experie","useful":0,"cool":0},"lvU5JdieSsURBxmGj6P6gQ":{"text":"Had my first Pimm's Cup here and it was excellent!  We enjoyed the nice courtyard.\nWe had ","useful":0,"cool":0},"E-y2MpVLY_te4K3t312-fA":{"text":"Best muffuletta I had in New Orleans. Nom nom nom!\n\nThe decor is very distinctive with gue","useful":0,"cool":0},"o43D8OOo6DRyqy89sO74lg":{"text":"I loved this place. The first time I went, I only had a cheese board and a few drinks. The","useful":0,"cool":0},"sSmpfWbdeXiGoRRsz59Ahw":{"text":"Went for dinner. Muffaletta was fantastic, as was the salad I ordered with it. Waitstaff w","useful":0,"cool":0},"CBLj4wQoweGePrDgYmsvFw":{"text":"we stopped by after a greyline tour - our guide recommended but i had researched this plac","useful":0,"cool":0},"DcfMDvZlTU39cv7dSEnEGQ":{"text":"We liked the atmosphere and location.  \nThe food was just ok.  The bruschetta was differen","useful":0,"cool":0},"uVNi-FViFy9FgNLOdUShJg":{"text":"We come here as often as we can when in nola. My husband's grandmother always brought us h","useful":0,"cool":0},"tRVyKAKytdRdvPithI087g":{"text":"Came here almost everyday for a quick lunch and drink during my recent visit. Was recommen","useful":0,"cool":0},"wgeAEJkfHfka3ON-SDpNnA":{"text":"Silly us, we walk around trying to find a good place to eat when this is just at the corne","useful":2,"cool":2},"oqqvTrhVhtdYGDd35pM2Qg":{"text":"Eating a muffuletta here will ruin eating them anywhere else they are so good!\nService was","useful":0,"cool":0},"5Udjie7e08odC-KsT8XMyA":{"text":"A lovely atmospheric restaurant/bar. I'd highly recommend sitting inside vs the outdoor co","useful":0,"cool":0},"opnYEBzeg9gi07DR8SZopg":{"text":"I love this place! It is so cool inside. I love the bar and the waiters are friendly. The ","useful":1,"cool":0},"0vM2bBDHaac-qv_7KPheHA":{"text":"Can i just say.... small Napoleon, big taste. Love these sandwiches. \n\nAre you drunk? Is i","useful":1,"cool":0},"ky-tn1It2aPvtzymuQAebw":{"text":"We loved this place! We (me, husband, 2 moms and 1 kid with a broad palate) are from Metai","useful":0,"cool":0},"b25IKM8-_mjKSmmOtBA--g":{"text":"Nous avons pris le muffaleta qui était bon mais rien d'exceptionnel. Concernant le jambala","useful":0,"cool":0},"DzCfEhBR4J-sSpDLSyA1Sw":{"text":"This place I can say... has the best muffuletta. Warm, big, and toasty. It almost melts in","useful":1,"cool":1},"qkA1TYQKstwaBrvKU6yD7w":{"text":"The Napoleon House was the first governors home in New Orleans. The food and service was a","useful":0,"cool":0},"MTnqfUZI-sOxddHUq0nERQ":{"text":"Great Pimm's cup. The Muff is also good, as it is a hot Muff.","useful":0,"cool":0},"sejTepnM2vMYAtnt8_RCYA":{"text":"Stayed near FQ 4 nights and this is the only place we are at twice, Muffuletta both times.","useful":0,"cool":0},"UKYuYMSkDVayPk6l311kvQ":{"text":"A couple friends had recommended Napoleon House when we visited New Orleans for a few days","useful":3,"cool":1},"5qDvVRYBwHDAJckXqLhd6g":{"text":"I'm a long-time fan of Napoleon House. They don't really excel at anything in particular, ","useful":0,"cool":0},"nsQfNGCh_2vg-7oMyghzRg":{"text":"I really enjoyed my visit to Napoleon House. The best Pimm's cup! It is their signature co","useful":1,"cool":4},"BWBftl6UvE09Y90GXqQ8wQ":{"text":"My wife and I sat at the bar, only to see three bartenders walk by without so much as ackn","useful":0,"cool":0},"cYxv7RMU8KFKQwicfE6CQQ":{"text":"Good service but it seems that it's a place to just come for the atmosphere and the histor","useful":0,"cool":0},"OsNp3J_ZMM82TaMXiCEviw":{"text":"This bar has some of the greatest prices for poboys (around $9 vs $13-$14) and the muffule","useful":0,"cool":0},"r0Sakk9MaICIp_YzVn56-w":{"text":"Great service, interesting history, nice atmosphere and delicious food. The muffuletta was","useful":0,"cool":0},"FhbmoROec3YOXx57o9SOUw":{"text":"Great place for a muffuletta very cool interior and history behind the building. We ordere","useful":0,"cool":0},"GqnZJb8BNnzv9KWLNDy38Q":{"text":"This was not an enjoyable experience. They sat us and luckily we ordered right away when t","useful":0,"cool":0},"MSMGQ7tr5QzzCxdlZcSPEw":{"text":"NH reminds me of my hometown of Boston, a very old bar with a great menu and wait staff wi","useful":0,"cool":0},"YUvYfQq5mVY28DcOH-g_7g":{"text":"Muffuletta salad was great. Po boy was really good too. Nice ambiance and have enjoyed for","useful":0,"cool":0},"HJ9e0Q4NHL4xT6hZeEDQEA":{"text":"This place was DELICIOUS!!! The spinach artichoke dip, jambalaya, beans and rice, muffalet","useful":0,"cool":0},"g-4M9beHrG8XGduO8_1TCw":{"text":"My family and I stopped in New Orleans, before taking a trip to Pensacola Beach. I had pre","useful":0,"cool":0},"_XVDx5bske_3HGbeiZckLw":{"text":"Pass this place by.  Really the only reason we are here was because the line was short.  T","useful":1,"cool":1},"2IL8--a8vNipa-vZmVAK-Q":{"text":"The place is nice. I ordered jambalaya. The dish was rather cold with undercooked rice. No","useful":0,"cool":0},"C8OOA65yzAzrkJDI9NZEBw":{"text":"fantastic food and beautiful historic setting. the patio is a really sweet spot. also, the","useful":0,"cool":0},"yMdr06cvUkKIktO7-qvgfw":{"text":"Went twice for lunch on our week long visit. Absolutely excellent service. Very attentive ","useful":0,"cool":0},"Gmz8Pajm-FTHntBsbMwPXQ":{"text":"Had a Pimm's cup, jambalaya, and muffalata and they were all great. I liked this muffalatt","useful":1,"cool":0},"EdKhTCqKaJTMhRhPt2gxwg":{"text":"Cool, casual atmosphere, good food.  We had lunch here and I was impressed with their food","useful":0,"cool":0},"X2FThn_Y-Dc1lNZ-stV6JA":{"text":"One of my best friends has a lot of military friends that need a place to stop for the nig","useful":0,"cool":0},"20TNvPxhA4egHjktOorqNw":{"text":"I went here for lunch with my family and we really enjoyed it . They make you wait for hal","useful":1,"cool":0},"WGc4khcgLo4uhlYtKs7uhw":{"text":"Beef PoBoy perfection? Yes please!\n\nThis is a must stop for me.  I introduced by hubby to ","useful":2,"cool":1},"x6oSs78kxYIbNiFasb-eCw":{"text":"Very cool vibe here. Food was alright. The service was pretty slow and didn't check on us ","useful":0,"cool":0},"TCPP8KJcrmGasE6yLEJxYw":{"text":"I sort of stumbled in here one afternoon. It was Wednesday so a couple of my favorite plac","useful":0,"cool":0},"Uxr0Zqb27gX2l-jEhNxw5w":{"text":"To experience the true New Orleans Mufaleta you have to have one at the best place in The ","useful":0,"cool":0},"mtZTiy8UGFImhInX52Fq5Q":{"text":"Stopped by late at night during the French Quarter Festival. Needed a change from all the ","useful":0,"cool":0},"Eyi5bikzOvHu1OkDw6kiXQ":{"text":"If you're searching for old New Orleans, this is a great place to find it. From the faded ","useful":1,"cool":1},"Y2vYM6vxpuYxqLxnpTjHQA":{"text":"We had fine service, quick and attendtive, if only a bit snobby, but we suffered no conseq","useful":0,"cool":0},"368TTc4ZWH1I_oO-jHIs8w":{"text":"went here with friends from out of town, and being a local?  had drinks here, but never ha","useful":0,"cool":0},"8rTI6ZZM1ZnTT9CES498DA":{"text":"Just went to the bar for the Pimm's Cup. It's refreshing and goes down smooth. Stop by and","useful":0,"cool":0},"iMwnGYPSvStqzzmD50AnXg":{"text":"So delicious and not too far off the beaten path. You need to eat here if you are over the","useful":1,"cool":1},"z9R-Ikbts3faf-Wruuw8oQ":{"text":"I did not eat here but had the tasty Pimms Cup and really enjoyed it. It is one of the few","useful":0,"cool":0},"kcdJRZbkk07U8_KnHiNifA":{"text":"Waiter, older stocky middle age man w red hair had terrible attitude. Ignored us for 20 mi","useful":0,"cool":0},"Q2iHBKM0yHR9lg-nygrg7w":{"text":"Great lunch spot to stop at if you are in the French Quarter. The building itself is desig","useful":0,"cool":0},"NRkzGaV2kHOH0DYeatxY3w":{"text":"Review is for dinner.  Two shared a whole muffelata.  Had a lot leftover! Served warm and ","useful":0,"cool":0},"r5MSp6ohx8OJK3vQEHHtqQ":{"text":"Good Food, Great Service! I had lunch here after I had a French Quarter tour. I got the re","useful":0,"cool":0},"rcA_lGWrlLTvai2ovktcpg":{"text":"Their Muffalettas is fabulous.\nWe went their right after our guided tour of the pharmacy m","useful":7,"cool":7},"9iR8RW8EeE2XTYd-4r2z8g":{"text":"We were in the  French Quarter of New Orleans and we were told they have the best Muffulet","useful":0,"cool":0},"hkW3LIaDSBYs62iqtSzNZw":{"text":"Great lunch, variety on the menu of sandwiches, salads, soups and Cajun specials.  Ate in ","useful":0,"cool":0},"HSs8HkVibx0MlzoYfv2bpg":{"text":"I will definitely visit the Napoleon House again the next time I'm in NOLA. I took the adv","useful":0,"cool":0},"t1J3KHrsa1Rzq6zE_I_nQQ":{"text":"Great lunch spot that I always hit up every time I'm in town.\n\nGrab a seat in the courtyar","useful":0,"cool":0},"5otA4-tuLKiybpgLF9jgpQ":{"text":"Stopped in before dinner for a Pimm's Cup of course.  Really cool interior and super frien","useful":4,"cool":1},"Z6OEg3Jew8qWjxtwyjZGwQ":{"text":"Absolutely loved this place! It had that classic, old world charm which made the experienc","useful":1,"cool":0},"08b3tqn4zzMKe-VEu3csoA":{"text":"This is hands down my favorite bar in the world. Quaint, quiet, a cool escape from steamy ","useful":0,"cool":0},"iLd1B4dWc358LBhYjcu_7A":{"text":"Great ambience, great muffuletta ...fair price and great service. This is a great choice f","useful":0,"cool":0},"pcIF4RAM76OPS0Bcwes-9Q":{"text":"This was a really nice, relaxing place to have lunch.  Simple as that.  Despite it's good ","useful":0,"cool":0},"81Rz6BFOiLLOxXpv3F2KMA":{"text":"Slow service, marginal food, but OK drinks. \nI think there are much better places to eat i","useful":0,"cool":0},"c_K3rfWS7lKYaoEEsEnIew":{"text":"We had the spinach artichoke bread bowl and it was creamy, gooey and flavorful, a great st","useful":0,"cool":0},"u0J2byVSSE4mT9fq3_rkgQ":{"text":"They are known for their Muffulettas and I enjoyed mine quite a bit but my wife thought it","useful":0,"cool":0},"GsHd0XJtz1-e0vizfkavVw":{"text":"This is an interesting place.  It's got an old, 'beat-down' vibe, in a solid old city type","useful":1,"cool":1},"O7UvXOFucprRMToHCxKUBg":{"text":"Decent place.  Pims cup was great - too bad I thought bartender was somewhat rude.","useful":0,"cool":0},"zAZ19QJnmZYhoUCoQk1cPg":{"text":"Incredible atmosphere, great cocktails, good food, shockingly affordable. A great spot for","useful":0,"cool":0},"sWBviyaViwsDm8D6T2BKdQ":{"text":"We asked our doorman at our hotel (The Intercontinental) what was his favorite place to ea","useful":0,"cool":0},"uACUhkRLqbdYgGKuBdNqAg":{"text":"On a one night stop in New Orleans, we decided to stop here for dinner...\n\nThis restaurant","useful":0,"cool":0},"u6aKtxPR7fEXGR5MwhYgOw":{"text":"I have to agree with Sarah K.  I really like this place.  I'm veg and I love the organic s","useful":1,"cool":1},"BQfkx_A5MKVky_c2TrJvfg":{"text":"The price is right and truthfully, the food was alright but not remarkable.  Plastic plate","useful":0,"cool":0},"D1IfOBJLoW3Qm8zlWw_TAA":{"text":"Napoleon House has been my absolute favorite place to eat in New Orleans for years and I'v","useful":0,"cool":0},"CZ4oSE7F16hb_o1tQjshpw":{"text":"Five for our server. Unfortunately we never got his name, but he is from the Bay area of C","useful":1,"cool":1},"vLx1RFY6CAsODXfcU0u2wg":{"text":"What a wonderful little find! Set inside a historic building is this fantastic little rest","useful":0,"cool":0},"_N655m_Z1atTVBvX3LYAGQ":{"text":"This is a great place to be immersed in the history of the French Quarter and get fine foo","useful":1,"cool":0},"2g7hWPqiJKavMJ_HpdHYxg":{"text":"Beautiful old bar with great selections and service... our favorite hangout in New Orleans","useful":0,"cool":0},"EYvjcFbCExnba4R_tOelfg":{"text":"Two stars is generous. Pretty sure the gumbo was Campbell's soup with rice in it. Waiter w","useful":0,"cool":0},"gaO9wIkBAbjC8b9_67k0ig":{"text":"This wasn't even on my radar. Jean, a docent at the Historic New Orleans Collection recomm","useful":3,"cool":2},"m70r5fWi4oSHG2PGfcXYSA":{"text":"Old world charm in the heart of the quarter.  filet was cooked to perfection and service w","useful":0,"cool":0},"4ddZ7KOmJx5Ds1Zk4pENkA":{"text":"When our waiter dropped off our check he said \"Meow.\"\n\nWe spent a majority of our meal tal","useful":2,"cool":2},"zAjK5uaRwkbQ7HfaYPZ8sw":{"text":"Located a short skip off Bourbon Street, Napoleon House is a fantastic value in the French","useful":0,"cool":0},"o9baYTZuab32R4jQ73J9Zw":{"text":"i thought i didn't like gumbo til i had it here!!\ntheir seafood gumbo is da bomb!!\ntheir j","useful":4,"cool":2},"qWY0t5B1tKIQP8DMB_xMow":{"text":"This place is ridiculously good. Do yourself a favor and eat here. Historical place with e","useful":0,"cool":0},"qnY4EVHKvxOZ6xbzkmUNHw":{"text":"Absolutely wonderful old resturant in the heart of the French Quarter!  Reasonably priced ","useful":0,"cool":0},"wZcENaPiRlrf64jQgZgBUw":{"text":"It was ok. Mediocre food. Rude waitress. And a cockroach crawling around the walls. Good p","useful":0,"cool":0},"3FgmOUbCE7eVH5RX2RudLA":{"text":"I'd return to give it another chance, but was somewhat disappointed in the experience.  Th","useful":0,"cool":0},"hCfPiD7s97XwRufSBI2TBQ":{"text":"They're not kidding when they say their muffaletta is the best. It's SO damn good. The sam","useful":0,"cool":0},"VTpVTDysYurCi2SBto_mVA":{"text":"One of the best spots in the French Quarter. The muffuletta is delicious, along with the p","useful":0,"cool":0},"TE05o3umrbInC5jaWEUzvA":{"text":"We ate here a few times here. We thought the Muffeleta sandwich was delicious and among th","useful":0,"cool":0},"nTPbGnNUrA1Ao9SXkaKaWQ":{"text":"Eh. Seating for two was in a cute, little, cozy spot. Ordered beans and rice- food came wi","useful":0,"cool":0},"AtGo3zbgdgQ01mY7KDHP9Q":{"text":"I went here for lunch yesterday and had half a muffuletta and some gumbo. The food was goo","useful":0,"cool":0},"my-H3h6tsFsdpNHn9aeIzQ":{"text":"You don't go to Napolean House for the food. You go here for the ambiance and the Sazerac.","useful":7,"cool":10},"gZSlW0gGNejy505u-kzJDg":{"text":"This place was highly recommended as the best place in town to have a muffuletta.  It did ","useful":0,"cool":0},"Un6R4-yue0zVDS_COqFhOA":{"text":"The highlight of our eating in NOLA is the muffuletta here. Holy cow is it amazing and the","useful":1,"cool":2},"V90vpAQkEfDjX7H-8OG92Q":{"text":"Food was good but the service wasn't the best and our waiter had an attitude throughout ta","useful":0,"cool":0},"Oy1WDA1MakIEVfWx1v1EdQ":{"text":"The ambiance alone makes this place one of my favorites in the Quarter. But the muffaletta","useful":0,"cool":0},"LEeXxJPl-es8b1tV_YOnZQ":{"text":"Get the muffuletta! My husband got it and I didn't think I would like it but it was amazin","useful":0,"cool":0},"h2AInQZuKvO2RP4gUBi20g":{"text":"Wow, impeccable service and delightful dishes made for a very memorable dinner. My wife an","useful":0,"cool":0},"dC6RqhMpknes5MdzZze8Jw":{"text":"Had a great dinner and drinks in this quaint little restaurant! Our server was professiona","useful":0,"cool":0},"Iw5TAvJU8_k2twlSofkhWA":{"text":"Best red beans n rice ever! Muffuletta was outstanding. This is a must eat if ever in the ","useful":0,"cool":0},"_7Koml7g10D0fCBjQILt1Q":{"text":"We had a food tour the day prior, and were chatting with the Chef/Owner of another place -","useful":6,"cool":2},"Ls9WXIlPRcuESMkXPUJcyg":{"text":"Enjoyed a relaxing hour here, had a nice glass of Rhine wine and sharing a panini. Had to ","useful":0,"cool":0},"fagDL4j4Kwqv5PV99crfrA":{"text":"The ambience, that perfect Pimm's Cup, and that muffuletta!!! I came here for the muffulet","useful":1,"cool":1},"fyVwErWd8CVHiqtsv5CSsA":{"text":"This is a regular stop. Never in NO without a Napoleon House muffuletta. Best in town, han","useful":0,"cool":0},"4HgmQBLmeb994W0SqFpgnQ":{"text":"I loved the decor and ambiance of this restaurant! My friends and I had dinner there on a ","useful":0,"cool":0},"5nQcBF6lfZRyLT6zHsodoA":{"text":"Stumbled upon this spot on our French Quarter stroll. Waitstaff is friendly and food is go","useful":0,"cool":0},"eePIr8PC_EYTVuFS7jewDg":{"text":"Tons of recommendations for this place and the wait was a little long. Atmosphere was a li","useful":0,"cool":1},"omtXn_mpdO58yckGT-649w":{"text":"We were told this place has great food. It DOES!!!!  The two stars is for service. Liked t","useful":0,"cool":0},"0xpf-KQ-pA1uAfOrw8zRKw":{"text":"Big portions and good food. Service was slow and my drink never came...","useful":0,"cool":0},"FvJt8BPJmSQgheAbouMbmw":{"text":"What a beautiful, historical place. Used in a 2013 Mercedes super bowl commercial - neat t","useful":0,"cool":0},"_HrDUuLyvmgmrgmKUl5LHg":{"text":"Best Pimms Cup in the quarter. Dark fun bar is perfect for and after dinner drink. Service","useful":0,"cool":0},"yff_OlimCHdnio4ukliqmQ":{"text":"An institution and was fun to get a drink at with a large group of friends. We sat in the ","useful":1,"cool":1},"WZU_h_nucRQB-Pf8nv692Q":{"text":"Strolled in here one night to grab a cocktail to get our night going. We both ordered the ","useful":1,"cool":0},"K8AUWHx4ey3sXA-9FJ45Iw":{"text":"Loved this little restaurant! A lot pf history again as almost everything in New Orleans. ","useful":0,"cool":0},"zIWlft3bvo4Gq4nulacw3g":{"text":"Long overdue review from our trip to NOLA in April of 2013.  We arrived in the city around","useful":2,"cool":0},"wgbXak72bTfBIo8YDl2TJQ":{"text":"Had the Pimm's cup original, the Italian Po Boy, & red beans & rice. One of the best meals","useful":0,"cool":0},"kOWasHPdPs3xVKDlO8Ylqg":{"text":"This review is for the bar only! The BEST Pimm's cup in the quarter! I always make a stop ","useful":4,"cool":3},"5nor7QcPeD3nkB-EXK29XA":{"text":"Cheese board. Charcuterie board. Side of red beans and rice. Yes please. It was awesome. I","useful":0,"cool":0},"00upk_-kcyAyGlii3IhVMQ":{"text":"My favorite spot. Had the Red Beans n Rice, The Muffuletta sandwich and the Jambalaya. Eve","useful":0,"cool":0},"PyIQuXKG64ItgGfzGmk3GQ":{"text":"Really a 2.5 Star review. We enjoyed like decor and the theming, as well as the spinach an","useful":0,"cool":0},"5fMKXmGBl_-wHY1vRnblSA":{"text":"We were really excited to go to Napoleon House on our final night in New Orleans. It was m","useful":0,"cool":0},"HGW15qOe92x-yK7hjbuNUQ":{"text":"My husband ordered the hater sausage po boy and I was terrified but holy crap it was amazi","useful":0,"cool":0},"eRzsXUbwajAFP2i0FfEVSQ":{"text":"Napoleon House was so good I went twice during my visit. That might not seem like a big de","useful":1,"cool":0},"zsFmukslj4SOCYuFzHBtsA":{"text":"Wonderful historic building in the French Quarter! Check out all the artifacts on the wall","useful":1,"cool":0},"mBYGihFeDbP2p0mGsaFvHQ":{"text":"Restaurant was right across from our hotel so we stopped in for lunch. The English Pimms w","useful":0,"cool":0},"FFuWt0QDG49pxGBHLuIRjA":{"text":"Our food was delicious, and the patio area is beautiful, our server however was not that g","useful":0,"cool":0},"dAzkB8I9LZcdBPOBimGzRA":{"text":"I loved the muffuletta.\nOur waiter was super nice friendly and very funny!!\nHe gave us a t","useful":0,"cool":0},"quw-Mq79gvzLTU4YGmBCvQ":{"text":"Can you say ambience? Can you say location? Can you say good service? And how about GREAT ","useful":0,"cool":0},"J8QeM1S92ZtT_VZUMkL7wQ":{"text":"Best Muffuletta in town.  My mother, who lived in NOLA in the 70s, came to visit last week","useful":0,"cool":0},"jRQQMwK-kl9IgolmpI8W2A":{"text":"If you like old NOLA architecture, check this place out. Pimm's Cup is the way to go if yo","useful":0,"cool":0},"53nWV_YKrNIdcdy-9urS_w":{"text":"Delicious muffalettas! Seriously, after a week of mostly delicious meals here in NOLA, thi","useful":0,"cool":0},"oDmHwaeRxZiz6by-WrRe9A":{"text":"Someone who recently moved to the city recommended this place to us during our trip. We ha","useful":0,"cool":0},"UZ7bEgmnIWQs8Zpai1Fh9Q":{"text":"We had a nice late lunch and cocktails in a true New Orleans experience.  We ate in the ch","useful":0,"cool":0},"1ZAmULeQWN4U32oFdPnE9A":{"text":"The Mufaletta is their saving grace. \nIt is an exceptional dish!\nTruly outstanding!\n\nThe s","useful":0,"cool":0},"uod1m9IrxsAhJP001c5W9g":{"text":"Delicious food. I had the chicken/Brie/apple sandwich and it was phenomenal. I also split ","useful":0,"cool":0},"GcG2RJhAH1CQ66-ZNva3Bw":{"text":"This history rich building is filled with smiles on end! My sister and I being from Maryla","useful":0,"cool":0},"AdJshMmUL40ND4VDU1wFKg":{"text":"Came in late evening for a snack and a drink and we were not disappointed. The Muffaletta ","useful":0,"cool":0},"m2xbwuIgTxvJUIs1VArbhw":{"text":"Prompt, courteous service. Cappuccino was excellent, as was Pimm's Cup drink. Entrees come","useful":0,"cool":0},"kRqAkt0_ZTMyDl2lRg7PRQ":{"text":"Not open \nEven though they say they are..\nMaintenance can be done after hours with proper ","useful":0,"cool":0},"-M_R1Hv3jHEkoAj4WPxdBg":{"text":"Muffuletta, red beans & rice, and alligator sausage po'boy were to die for. Spectacular se","useful":1,"cool":1},"qLPJBnbBJ7K68jp2c7koZA":{"text":"My muffaletta was very good, I prefer them warm. It was a good toasty bread, great meats b","useful":0,"cool":1},"KqKVgJ-HUjhBS-tXz_uR9A":{"text":"Been to the Napoleon House before but unfortunately their fame may have gotten the best of","useful":7,"cool":1},"kwhVSwjyZlopBXfx1RAIeA":{"text":"This restaurant was recommended by a friend and it was wonderful! I ended up going back wi","useful":0,"cool":0},"uT8N_DhGhR_Z5TPPjV12wA":{"text":"Went here after a friend recommended and it was Delish.   Spinach artichoke dip was devour","useful":1,"cool":1},"JbQaX5FFB0qJQC5vWOnuZg":{"text":"Awesome environment with good service and delish pims. It feels like you step back in time","useful":0,"cool":0},"9XIOIPw1T1hhAYqiqAwTIA":{"text":"I was worried that I wouldn't like the Napoleon House A) because of where it's located, an","useful":1,"cool":0},"PPltxQq9TLGBfw5aWoKgoQ":{"text":"Great atmosphere, loved the history that goes along with it.  Just off the madness of Bour","useful":0,"cool":0},"i_7DNlh7A3rs5pzj6WkdWA":{"text":"Asked the server if the $9 seafood gumbo was good.  She hesitated and said the seafood gum","useful":0,"cool":0},"IpaU2l3kRS7HIzxOFwi6Tg":{"text":"Cool, eclectic place! Great sandwiches! Had the muffuletta, Italian sub and alligator sub ","useful":1,"cool":0},"Wbm6e44FyvkEIOIGcMQyhA":{"text":"Thank you Yelp reviewers for sending me here for the muffuletta. Yum! Served at just the r","useful":0,"cool":0},"pEzuUC-pEJqCsOGyXKl-Rg":{"text":"My wedding reception here was a dream! Staff are incredible, the food is incredible, and t","useful":0,"cool":1},"2ZEJ0nX94QNAf4QSlEG18g":{"text":"Ok. So I was skeptical, I'll admit it. But I was wrong!\nThe food here is GREAT! \nWe had th","useful":0,"cool":0},"sZUYk1rfVbFqarvOKngm1A":{"text":"We live in NOLA and this is one of our go to spots when we are playing tourist in our own ","useful":0,"cool":0},"Euw8B2ETUSXoAce56HJ2kw":{"text":"Ah New Orleans.  You crazy town.  You drunken-yet-classy-yet-still-overly-drunken-yet-hell","useful":0,"cool":0},"4auAPbkh8w9HT_wpIs4MmA":{"text":"This is a great little spot. The sea food jumbo was delicious, but the real star was the m","useful":0,"cool":0},"Zt77yUmPCsEoDRKZ5gdyJQ":{"text":"Loved this restaurant! Sat out on the quaint patio. My guy ordered the 1/2 of muffuletta s","useful":1,"cool":1},"AjE0p_SP_qanq47sNVuykg":{"text":"Napoleon House\n\nNapoleon House - 500 Chartres St., New Orleans, LA - Remaining true to its","useful":0,"cool":0},"cAH-vRdqBS1X2aozT4o60g":{"text":"Such a great atmosphere. We had the pimms cup and it did not let us down. It said gin base","useful":0,"cool":0},"8xy72krjhq-I4hA64m3Rug":{"text":"Napolean House has a special place in my heart, as it was the first restaurant I ever dine","useful":1,"cool":0},"xCZwTlMGovTXJf1x_jHa_Q":{"text":"Their Muffuletta is elite. Can't say much more about Napoleon as I haven't gotten anything","useful":0,"cool":0},"aePj5NhZNlrcCriXK476-g":{"text":"We visited New Orleans (\"NOLA\") in December for a ten year anniversary of the last time we","useful":0,"cool":0},"qdaUz6bOgJUMJVYXHcO9Jw":{"text":"This review is based on on drinks only so if you are looking for comments on the food this","useful":1,"cool":1},"WOIXy0_7O9vqJOQLzu2Qbg":{"text":"Food tasted good but luke warm temperature. Good for lunch but not the best menu for dinne","useful":0,"cool":0},"3_q9PPgTrH_lLTLfY7VLww":{"text":"these photos aren't much, aight, but lemme just tell you as a very-much-tourist in this to","useful":3,"cool":4},"y_M_NhBf0Q7eeW1tLRI6eQ":{"text":"Sooooo the BF and I were informed of this place by the lady at Southern Paws. She said, \"a","useful":3,"cool":1},"4B8mVJJ9JJb1ZiBAgqzLrg":{"text":"absolutely amazing food! couldn't put down my sandwich. the environment of the restaurant ","useful":0,"cool":0},"xifLkZmVEnT-Byj5CQ3JEQ":{"text":"Great spot in the French Quarter. Drink the Pimm's Cup (original I recommend). I had the s","useful":0,"cool":0},"vbaZSuqP0QMFyYcJc0LpFg":{"text":"We love this place. The ambiance is amazing. It's beautiful and grungy and it feels like y","useful":0,"cool":1},"y5mEolfxq_yaamkqasHVOQ":{"text":"Came here on my last night in New Orleans with a local. She recommended Napoleon House for","useful":0,"cool":0},"rF58t_DX0zN5uF4f7oqxbA":{"text":"Shrink po boy was excellent! So was their gumbo. One of the BEST gumbos I've ever had. Onl","useful":0,"cool":0},"XzTzApPJU-_X9EbfZlkWOQ":{"text":"Late lunch on 5/9/21.  Shared the muffaletta with 3 others and had 3 Pimms\ncups.   Our wai","useful":0,"cool":0},"RRwxUGQmqlHWtHYXgc1aWg":{"text":"Love, love love the atmosphere here. Indoor/outdoor seating felt very much like Paris. The","useful":0,"cool":0},"aJaTHikKJBNzaKFjpvO0Hw":{"text":"If your a fan of history, this is the place for you. \n\nThe restaurant itself is in an amaz","useful":0,"cool":0},"xagyKNO7BhTX1YmNC75cSA":{"text":"I want to go back to NOLA just for this place! Such amazing food. Some of the best I have ","useful":0,"cool":0},"eBrkCzXgIwpX7UuCpg4stA":{"text":"Holy cow the muffuletta is seriously the best sandwich I have ever eaten. My husband thoug","useful":0,"cool":0},"3FhfBSWUB5Jslmhe7yrlTw":{"text":"The food was delicious! The muffuletta was incredible and the jambalaya was pretty tasty. ","useful":1,"cool":0},"9y4REvzuOYR9rBKd1yP1mA":{"text":"It's good, but the menu wasn't as broad as I was hoping. But their charcuterie board is am","useful":0,"cool":0},"2dGsT_o94mAu1FzSrNK_aA":{"text":"My photo doesn't do these plates justice. Wow! The sandwich is huge and so freaking delici","useful":0,"cool":0},"-HLGriD9Es-cpPo6i8kDDg":{"text":"The service is great. The food was even better. We split the half Muffaletta, seafood gumb","useful":0,"cool":0},"5mfLx6orZOGbNDoRczqkTA":{"text":"Great food. We went there twice. The mufflatas were recommended to us the best in town... ","useful":0,"cool":0},"LfVDEv78jksN1e5fjOJCCw":{"text":"The muffuletta is great full is perfect for two, porous are very good as well...bread pudd","useful":0,"cool":0},"cbVtkBMlMYBglekiMgDpoQ":{"text":"This was recommended by some locals - and it was Awesome!  Ordered 1/2 muffuletta and it w","useful":0,"cool":0},"MeV1gPFupkivH5-4oWJGiA":{"text":"I love this place. We visit the every time we're in NOLA. It has a great, cozy, old world ","useful":0,"cool":0},"RnuXXehHrRkW_4dY1O0GlA":{"text":"Awesome ambiance. Love the history here. \n\nDigging the background classic music.\n\nBut the ","useful":6,"cool":6},"ssITPaWPVDf_4dmb8WrNSA":{"text":"I ate here lunch time, service was friendly, polite and awesome, seafood gumbo was good.\n\n","useful":0,"cool":0},"b__HugMUyG-Puti1x8jsmQ":{"text":"OMG. This was freaking amazing!  My hubby and I split the Muffuletta sandwich.   While it ","useful":3,"cool":1},"oP8wCTwsjdfZBFJWsZY8cw":{"text":"zzzzz,-zzz,,, z-  -$'-z,z,,, zzz,a zaza,x,,zz ,zz,,,,zzxzxzzz,,,,,,,,-,-,-z,, zaza, z,'---","useful":0,"cool":0},"-4-vUETZ21PZtOIxtq-KOg":{"text":"This review is based more on poor service than the food. This restaurant was recommended b","useful":0,"cool":0},"uGTQI-Cnezbyi3r2r8oIbQ":{"text":"The food was good and the atmosphere was great. We sat outside in the courtyard and it was","useful":0,"cool":0},"nxu0Q2vwomGRFbJc2OiiuQ":{"text":"Stopped by for drinks and the famous muffuletta. Fantastic service and food was great!","useful":0,"cool":0},"SL8RM1h-w1-vbTPfpQzGEQ":{"text":"PERHAPS THE BEST MUFFULETTA IN NEW ORLEANS\n1. The bread is made in-house daily by the Ralp","useful":9,"cool":5},"e8zPtw1W2lBX2IdOUtW4nA":{"text":"Of the many must see restaurants and bars I share with my out of town visitors, Napoleon H","useful":4,"cool":3},"tnY6TURW3SVeqsfetbFH5w":{"text":"Came here because during a walking tour this place was said to supposedly be a safe-house ","useful":4,"cool":3},"NV8cO21KZ9JYJzxLfK6WQQ":{"text":"intimate bar/restaurant that seems to be packed, but the servers are quick and will help y","useful":3,"cool":3},"yLnfSv995or1goLmS7DIFg":{"text":"Stopped in for a sazerac and muffaletta late night. Dark and intimate, the Napoleon House ","useful":0,"cool":0},"ixYTV_AV5NH_SDd4o2QgjQ":{"text":"Literally my favorite lunch spot in the French Quarter. Amazing spot for day drinking Bloo","useful":1,"cool":0},"uxWbIPFM9x7PiqkyrJyytg":{"text":"Barf. Everything was gross and cold. We got the roast beef po boy and it tasted like somet","useful":0,"cool":0},"Hzkod8MCdHg5AamaD4GgtA":{"text":"Went here last night for dinner and ordered the Alligator Po Boy and the bruschetta!!!!! W","useful":0,"cool":0},"tFmxK9e1N5NYUuZY8evyfg":{"text":"Was referred to this place by a local. The location is large and has a cute outdoor garden","useful":0,"cool":0},"tylztVTTdZXJe8eBMr_CIQ":{"text":"Had dinner here on our first night in New Orleans. The staff was amazing. Very friendly an","useful":0,"cool":0},"96YtainoyJ_czrBmEy9-5A":{"text":"A real New Orleans treat with a great history to boot. Food was great as were the drinks. ","useful":0,"cool":0},"RcLYTuO5YHIRloKQzjn_aA":{"text":"Amazing muffuletta! Best I have ever had in NOLA. Gumbo was amazing also. Would recommende","useful":0,"cool":0},"-_c5lw8UtCeBJMQD_BtBVQ":{"text":"Their muffuletta is best sandwich we have had since we were in Italy last year! Later we f","useful":2,"cool":2},"P5trESf1E1sJQeXl0wtPkA":{"text":"Decent service. Got a quarter of a muffuleta and a side of jambalaya w/ an irish cream sod","useful":0,"cool":0},"ZKkKhBCmbYclntg5zRGcKg":{"text":"The mufflatta that we had there was the size of your head!  Service was great and it was r","useful":0,"cool":0},"WBkUnn9jvYrs8CQ7omcs6g":{"text":"If you only go here for the muffuletta you won't be unhappy.   It's my favorite in New Orl","useful":1,"cool":2},"k_WCAnGXfxxGFg6fsocEWQ":{"text":"First time in New Orleans and stop by for lunch and try gumbo and the muffuletta and is ju","useful":1,"cool":0},"qEgNYiasDfu251fErLw3Fg":{"text":"Damn that Muffuletta was the best! I've had it cold, but never warm and toasty and melty a","useful":0,"cool":2},"kJhPnhSq9tDeaia9NAi1_A":{"text":"A recommendation from a friend that lives in Mississippi to try this place out.  Price is ","useful":0,"cool":0},"Y-N-2OBHemnOf1aAm1hKUg":{"text":"Yay how amazing the Napoleon house was open when I visited the French quarter. I had the m","useful":0,"cool":0},"dw9y_VJsYlf2jWmM_eaTXQ":{"text":"Stopped by here on Saturday night of Memorial Day weekend and were able to grab seats at t","useful":2,"cool":2},"QCEjmj21Y3UPYlvg6oSqHg":{"text":"Swung in here escorted by our friends who are locals.\n\nWe all had muffuletta sandwiches wi","useful":1,"cool":1},"xfIK41siXpU2gBpV2SScyg":{"text":"Best Sazerac I had on my trip. Not overly sweet like a lot of the other bars. Great ambian","useful":1,"cool":1},"HITuienKyFqEXwF0-uCKUQ":{"text":"Here's why you didn't get the 5 Stars.\nWe had a recommendation to come here to check out t","useful":1,"cool":0},"vxle13AuV1J-COQpdY0lNg":{"text":"The worse bruschetta ever! Got really disappointed with the food quality. Waiter was aweso","useful":0,"cool":0},"SjxqftNTJpcdqXJcTh2RUw":{"text":"Covid-19 Update:  We got some curb-side take-out from Napoleon House this weekend. They ar","useful":6,"cool":6},"a1PcbZ43qek7sVIMGlM3hg":{"text":"I'm pretty sure the nearly 200 great reviews for Napoleon House all say \"Pimm's Cup on the","useful":4,"cool":3},"kUy7CNPKJF0Ab87khYtnFg":{"text":"To begin with the service was subpar. Food was not better than mediocre. I had the stuffed","useful":0,"cool":0},"t0RY9cie8hN0IDz3YDLBxg":{"text":"Hands down, the best muffuletta sandwich I have ever had. The acidity from the olives, the","useful":0,"cool":0},"YhxUBj8NjJhiLtptOz5MaA":{"text":"Omg... went out for a different restaurant but the wait was forever long so we went walkin","useful":1,"cool":1},"jKs7hp1ExvudDKgJug5Apw":{"text":"Went out of our way to eat here because it was recommended.  Can't figure out why, unless ","useful":1,"cool":0},"kAlUepOZmAmgIFZ1M7SBcg":{"text":"Interesting little restaurant in the French Quarter.  We had taken a walking tour and our ","useful":3,"cool":1},"PYPMMaPZmsyivwlWJMKGEQ":{"text":"Food was affordable, but meh.  Drinks were small but the atmosphere was nice and the staff","useful":0,"cool":0},"J2gBuylULp5m8IEF45Q2zw":{"text":"We were sat in their inner but outdoor area. It was a nice patio setting and had a really ","useful":0,"cool":0},"TtqdB5HCT5f7yGBq9NxNnw":{"text":"I had to stop here. It's a great location with a lot of history. However, whoever is handl","useful":1,"cool":0},"Qc8Yuw1ungqbiiusuP6tnQ":{"text":"Beautiful courtyard, lots of charm, great service and the food was excellent!  Muffuletta ","useful":0,"cool":0},"9Q6Zy6q7hLgHFqissDPKdg":{"text":"Beautiful place, highly recommend to people visiting the french quarter. Was recommended t","useful":0,"cool":0},"tICZ2GXXe7WQADtqpD1LcA":{"text":"Amazing atmosphere!\nGreat food!\nI came here on a recommendation and was not disappointed.\n","useful":2,"cool":1},"OYuZxLhPO8fTSH6JFTlQyA":{"text":"This is my favorite restaurant in NOLA. They have the best muffulettas. I love their jamba","useful":1,"cool":1},"OEDY0XjtnfXuVIH3x8uUeQ":{"text":"Great atmosphere, great food, great service. Muffuletta was on point, especially the bread","useful":0,"cool":0},"atwDn52Lb_Vkvkms-leGAg":{"text":"The building alone is reason to visit this bar.  As you walk in you feel like you are ente","useful":0,"cool":0},"Qkou0hsZ-108zk4-sNQ_YA":{"text":"Prices are extremely reasonable and food was fantastic.\n\nMuffuletta sandwich was amazing. ","useful":0,"cool":1},"kg-81ueDrcrs2OXIwhtmgA":{"text":"Love this place.  Limited wine menu but the appetizers and dinner menu is fantastic and af","useful":0,"cool":0},"lw1etSsQnj982_8XpKZmzg":{"text":"Adorable place, sitting in here makes you feel as if you have been transported through tim","useful":1,"cool":2},"X3YwkgI1uEzxB6HoiJI8jg":{"text":"Stopped in to try their muffuletta.  The shaded courtyard was a great place to enjoy lunch","useful":1,"cool":1},"7trPcGDHTK7Jqaqz2ahEUA":{"text":"I visited here, pre Covid, and absolutely loved it! I was in town for the Garden Center Gr","useful":0,"cool":0},"sx3GIZNbyT9SFi0c3xn55A":{"text":"My cousin showed me this place a few years ago. we stopped in for a drink early on a weekd","useful":5,"cool":5},"RXuOe3pjnUTmI66YHEte9w":{"text":"Great location in a historic building?  CHECK\n\nDevouring my first Muffuletta in record tim","useful":1,"cool":1},"b37zvguu2GFJ0fyT3-RPVA":{"text":"Big fan of Napoleon House.  I expected old, but the place is a little dumpy, but they abso","useful":0,"cool":0},"b3ZwnbWc3SQXtdMwmM9gVw":{"text":"Napoleon House has an excellent atmosphere (the back courtyard is beautiful!) and the buil","useful":1,"cool":0},"GxG1eGinmF6UENiZrDvwNw":{"text":"my mum and i decided to come here last minute and we loved it!! they initially told us the","useful":0,"cool":0},"ZVWPjYfYjHQqLkUvxp6nmA":{"text":"I believe Napoleon House has the best Muffuletta in the city. We make a point to stop here","useful":0,"cool":0},"HHyIUiY8PRB36SwIPkZomg":{"text":"caveat:  we ate here once and only had the red beans and rice and jambalaya for lunch. \n\nr","useful":2,"cool":0},"jvBD9ylQIGiX1-P0JTHpVg":{"text":"Loved this restaurant. They have great staff and outdoor seating. The Sazerac drink was de","useful":0,"cool":0},"YNNYBp2-vi9wblV53YDUIQ":{"text":"Huge surprise! In a positive way. After two (2) visits, I am confirming that the Ruben san","useful":4,"cool":4},"jK-HPpg8_Vt7UlLrTrzruw":{"text":"Excellent! I highly recommend this place when you visit an area you want to try places tha","useful":0,"cool":0},"Uo1QgpelAPw7fQJlOz1WYA":{"text":"Do they always play opera here? They sure played it the entire time we hung out here. I'm ","useful":20,"cool":20},"ndR0e8uZlHJZrLb3oRfugA":{"text":"I come here every time I'm in the Quarter.  Their roast beef po-boys are great  as is thei","useful":0,"cool":0},"IsF_l0QcIQqQ1zLWLTebtA":{"text":"We really were glad to be able to dine here. Looking over countless menus in the quarter s","useful":1,"cool":1},"rtbc9msXBrkbxbgNOYYZZw":{"text":"The food was dynamite.  We had a roast beef po'boy and the muffaletta.  Both were deliciou","useful":0,"cool":0},"-1W66sep7vTlc0_3Nasy5A":{"text":"On our fourth stop of our food tour with DK tours we ended up getting an interesting take ","useful":0,"cool":0},"gb_xvqTrRXWlsK9PxBFoLQ":{"text":"This is a great classic restaurant in New Orleans! It's been around since 1914, I think bu","useful":1,"cool":0},"_-R279XYoNntnvx_1WbCsg":{"text":"The pimms original drink (I think that is what it was called) was so light and fresh. It w","useful":0,"cool":0},"gQGA8DfkxjIVcMJX3NB-Ag":{"text":"The waiter seemed to not want to be there at all. The food was mediocre- if that. The brea","useful":0,"cool":0},"alfsj0droD_KYnhZF-SgCg":{"text":"Excellent place. Good place to get a Muffaletta.  If you go to New Orleans you need to tra","useful":0,"cool":0},"k-JsTogiBCd89tWOWKIFTw":{"text":"Omg...great atmosphere, great service and great food. We got the cheese board appetizer an","useful":0,"cool":0},"IHP9btHydqBtDk_dNyCfIQ":{"text":"A must stop in New Orleans! Such a quaint and historical spot. Really enjoyed the muffulet","useful":0,"cool":0},"AXgmr6e3zd7a-z8VCwTZzg":{"text":"Good food and a lot of history. I strongly recommend getting a half order of the muffalett","useful":0,"cool":0},"EAXbkxUjnQMOTIJe1WcUGw":{"text":"Got the Muffalatta and Pims cup. What a perfect combinations! I am going to say, I think t","useful":1,"cool":0},"IRljL7j9KuewBrWHaEgNHw":{"text":"This place is really good! I was a huge fan of the dips and especially the spinach and art","useful":4,"cool":3},"NgZwYIzAOHUvM0LPhMoUdQ":{"text":"Napoleon House was a great place to grab a bite to eat, including some New Orleans favorit","useful":4,"cool":4},"sVKc-Ta9AR-qoOA1UBh5lg":{"text":"My friend and I happened to stumble upon this place when getting lost in the French Quarte","useful":2,"cool":2},"6EeQBiBBwdxsg_rntUk_gA":{"text":"We were in NO early December and Napoleon House was our first stop for dinning.  Truly enj","useful":6,"cool":6},"mS6vmg_MpWKAYnONFgL0dQ":{"text":"The ambience is cracked paint and old wood beams.  How do they get away with that?  With  ","useful":3,"cool":1},"tWVtUI3z-me6Ca2t6sHpLw":{"text":"It was great! Fantastic atmosphere, I loved the courtyard.  The chicken apple sandwich was","useful":0,"cool":0},"U3Am-Ki_pnv5OrwKXfajUg":{"text":"Really enjoyed this place - staff was friendly and efficient, prices were good, food was s","useful":0,"cool":0},"V_1JCxnUbvVThR786eBOYg":{"text":"Ambiance is key.  Great place with a true mobster feeling.  Felt like I was back in St. Lo","useful":0,"cool":0},"eh-2ehL2CLAEeUg6MFrVXw":{"text":"Very cozy \"old world\" bar/restaurant that plays classical music, with a bartender in suspe","useful":0,"cool":0},"hvjTVX3N4bry3uAfOnZrxw":{"text":"Would definitely recommend dining here. This former house has amazing character and the fo","useful":0,"cool":0},"6TGy8EHvr0OJFliJlUS8Mg":{"text":"I loved sitting in the back courtyard it was very quaint and a nice environment. The histo","useful":0,"cool":0},"iuLGChpFgIXzqZ0-99HDqA":{"text":"Great po boys and jambalaya! Very neat history here in this hotel   Had my first pimm cup ","useful":0,"cool":0},"BenF7lsBe79RXpOPoi5vLg":{"text":"The food and drinks were pretty good here. Service was not bad. We sat in their patio area","useful":0,"cool":0},"VZMDB7J3Y1p7AGn6eLIVKA":{"text":"I was overall disappointed with my visit. I ordered the gumbo with a side of red beans and","useful":0,"cool":0},"j0bZGRf28i4RZO9FyhFGxA":{"text":"Great drinks and lovely courtyard. We heard about this place and had to check it out. Love","useful":1,"cool":0},"cNDOcZgfl2QYSlClHE9LQQ":{"text":"Expert level staff from the front desk to the bus boys. Old world charm and vibe especiall","useful":0,"cool":0},"f-1h2w55C5XFUFjSPyWiGg":{"text":"My wife's friend from grammar school who lives in NO recommended this place immediately wh","useful":0,"cool":0},"e9UlJgpYJrco9fVLQ77YsA":{"text":"I have been coming here for nearly 40 years!  I have always loved this place.  I miss the ","useful":1,"cool":1},"BQfjsQkZvMhNgBEwP1mB9g":{"text":"Best muffuletta I've ever had. I recommended that to my friend who got the quarter sandwic","useful":3,"cool":2},"I1HChgetElZNiqHSzBmhtw":{"text":"I'm so happy we found the time to make it out here. We came here on our last day, and alth","useful":43,"cool":46},"pvIbK9A041G59ZLbz4xiqg":{"text":"The service was wonderful. We really enjoyed the cheese board and a delicious muffuletta w","useful":0,"cool":0},"l0Y9JWuyRBDskSRe3U7_zw":{"text":"A longstanding favorite first haunted by us 30 years ago.  Love to stop and sit in the tin","useful":1,"cool":1},"CfMDUdNVZGEf6EVNdtLP9w":{"text":"They have the best muffuletta in New Orleans- hands down!  I recommend getting extra olive","useful":1,"cool":0},"zFtaXWmbzDWz6yui25OEYA":{"text":"My father and I had ordered the Rueben and Meatball Sandwich and spilt both between the tw","useful":0,"cool":0},"qG_kHmvulhSijZeqPKXkLg":{"text":"I travel to NOLA quite frequently and every time I am in town I stop here. Do yourself a f","useful":2,"cool":2},"wTJU5PFTYlfUtWqL594RhQ":{"text":"After a long drive it's important to indulge in some good food. We headed straight to NH t","useful":1,"cool":1},"Qm84yEkCYBwpSQSsslYJ4w":{"text":"The Mufaletta is their saving grace. \nIt is an exceptional dish!\nTruly outstanding!\n\nThe s","useful":1,"cool":0},"T6yhb55tftd7Dq1py0tiVg":{"text":"This place has character ! The Napoleon theme is obviously built into every painting, bust","useful":0,"cool":0},"dZNIZOuqy43YyxsOe6N9Vw":{"text":"The muffuletta is the best in NOLA. hands down the whole is huge so I would recommend the ","useful":0,"cool":0},"0EZPJ_ivGk6lPgSd-dbKxA":{"text":"Great food and service.  Had a half muffuletta, enough for two servings. Highly recommend ","useful":0,"cool":0},"-RNZuxaNwdo-hAr8g98Erw":{"text":"The food was amazing and the ambience of the restaurant is so cool. Are you dimly lit, and","useful":0,"cool":0},"8NG2ZE5SVGM_QekydYFS5g":{"text":"The food is B or B+ good, but the atmosphere is A+ classic old New Orleans. The Pimm's cup","useful":0,"cool":0},"Ei402fUuVMiO56f0H7C1fA":{"text":"I don't care what they say about Central Grocery, the Napoleon House has THE BEST muffulet","useful":0,"cool":2},"49VORtO6PU0Xs3ldCp44dQ":{"text":"Our tour guide recommended Napoleon House so we decided to try it. May i say...it did NOT ","useful":0,"cool":0},"_LjsYiRTaBVBhKtOsYI8Mg":{"text":"Food is clean, fresh and tasty. Recommend it to anyone the like quick grab. We ordered pas","useful":0,"cool":0},"NcHd8aWJbLc-a_k9QHAHDw":{"text":"As we walked in we were greeted by Mr Lou who was absolutely adorable and had a great sens","useful":1,"cool":1},"IQoWmQdvMQE6fN8AKaLIxg":{"text":"This is on our must stop when in Nola. Get the pims cup! I'm not a gin drinker and I love ","useful":0,"cool":0},"UrXs8vB3qK04m0o9y8Rb8Q":{"text":"Great spot and super cheap to eat and drink.  Really enjoyed it!!  Will def try it again b","useful":1,"cool":0},"hkWWO4ySy-OVNzmC7Ou_5A":{"text":"As I write this review, I find myself completely saddened that I do not have a muffaleta i","useful":0,"cool":0},"TnX98azxSaz25rTxJcfXbg":{"text":"Great muffuletta!  A whole is too large for two unless you are really hungry.  I like this","useful":0,"cool":0},"hQf0V76pjAIb0Bk_32IVgg":{"text":"food here is super good! a great place to drink and have a bite to eat. service  wasn't te","useful":0,"cool":0},"RK5af7P5a-mMvdUOWDUfRw":{"text":"Totally Unexpected!! Let me just say that I was not expecting to like this place. We came ","useful":0,"cool":0},"pEPlmfhk3RTNjnZHIXBglw":{"text":"My family of four very much enjoyed our visit last night. The atmosphere was fantastic and","useful":0,"cool":0},"FHKX_L0QzvNkaA8a2ByLew":{"text":"The Napoleon House was recommended and for historic reasons, I wanted to visit. The food a","useful":1,"cool":1},"RsiW0zLQc8Yk-uQ5WChcFQ":{"text":"This is an amazing spot. I came here on a food tour and had the pimms cup as well as the m","useful":0,"cool":0},"g55JdQiTesC7Ulv1emsQgg":{"text":"LISTEN! Lemme tell you about Napoleon House! \nWe went midday on a Wednesday and it was alr","useful":1,"cool":1},"vz0YGqv1oeHUyOsrTgMNgg":{"text":"We requested a table in the courtyard\nbecause of the pandemic and it was very\nnice and shi","useful":0,"cool":0},"OGOVPyJFpuenhVS-kaMUYg":{"text":"My favorite spot for historic atmosphere, a warm Muffaletta and a Bloody Mary in the Frenc","useful":2,"cool":1},"XUNhloq5Nep_2uNpdieKkQ":{"text":"Had to stop by just for the ambience, if nothing else.  Lunch was very nice, though.  The ","useful":0,"cool":0},"nuHCBSu5sde-PWupaRJFag":{"text":"First time in a recent trip to NOLA. Tried the quarter Muffaletta, Red Beans and Rice and ","useful":1,"cool":1},"cvNdoqFwwsAeLY-sDEJjgw":{"text":"Do not miss!!! Almost skipped this and so glad we didn't. The sandwich was even better tha","useful":0,"cool":0},"928nVRkbUTZflQmzksvqOw":{"text":"This is for the wedding I attending here. It was held upstairs above the restaurant. The v","useful":1,"cool":0},"_pCt6DMSvOJkBSW6zVdcTg":{"text":"My favorite muffuletta in Nola. The perfect spot to soak in history after walking around t","useful":1,"cool":1},"gqyzC67vXOz5x4iYYTldYQ":{"text":"Another NOLA favorite! This is a must for a casual lunch. Their sandwiches are HUGE, delic","useful":1,"cool":0},"jUUR1HX0sGQDUciL6fxXcg":{"text":"The muffuletta was amazing!  The Pimms cup went down smoothly; the salads are crisp; the a","useful":0,"cool":0},"bFDTZ5LyXCnr68fTdFEXew":{"text":"We heard decent things about this place but this was one of the bigger disappointments of ","useful":3,"cool":2},"fYG-5QGHavNwYk4Gnj67rg":{"text":"The service was great! The gentleman at the door, Andrew, was very helpful. Our server, I ","useful":0,"cool":0},"3mJtS6MbQRgsX6h5VjNMKA":{"text":"Not a day goes by that I don't dream about their amazing muffuletta that's I was down with","useful":0,"cool":0},"uTO85QvIR_aPeYIknxzEGw":{"text":"We had a great brunch at the Napoleon House. The wait went quickly and the drinks were gre","useful":0,"cool":0},"lVHlvY5G7Lhycu59KExgiQ":{"text":"We were in New Orleans for a few days and were in search of a good Muffuletta, since Centr","useful":0,"cool":0},"dfg_dcTaEs161Wj8LIwh_Q":{"text":"Of course we had the original Pimm's Cup cocktail which was great, as well as the Boudin S","useful":0,"cool":0},"pw2cC3HZSmnktHR-ay-3_Q":{"text":"Read the reviews and was hoping for some great jambalaya but it's not here.   Very nice st","useful":0,"cool":0},"3qFQI4KnIo6ucuCC2eVcGw":{"text":"This came highly recommended from a friend so we had to check it out. The house was built ","useful":1,"cool":0},"DJLS73j6HfZPezE0d8A4gw":{"text":"I enjoy going to restaurants that have been arounds for generations.  I've been here a few","useful":0,"cool":0},"Iemp4QsuSOd0Cy9-E84how":{"text":"Muffuletta!!!! So!!! Good!!!! One sandwich was more than enough for two people, and even m","useful":0,"cool":0},"hbTcIM831s_6eq5kjFLk6w":{"text":"I've never had a muffaletta, so what better city than New Orleans to try my first one.  Lo","useful":1,"cool":2},"mVEI60ckqE2Hvb8dohZy_A":{"text":"Planning a wedding reception here and so far the staff have been super helpful with everyt","useful":0,"cool":0},"iLAAMo3wkQ6Ka9QTywjBlw":{"text":"Must get the boudin sausage. Everything else is okay but fairly priced. Great place to com","useful":0,"cool":0},"dL9msVyZW0SUa48no1df1Q":{"text":"The food and the drinks  are made well. Tried the original Pimms cup and switched back to ","useful":1,"cool":2},"V1qzXZ_k4TOCwl2NqwejGg":{"text":"We had been on a great food roll until we came here!!  The ambiance sucked.  It was so dar","useful":2,"cool":0},"MucvJPDnMLvukhMJniLFvw":{"text":"What a great place! The prices are great, the servers were awesome and the food is outstan","useful":0,"cool":0},"ix-A0h_OXf2MHKabYc0XfA":{"text":"Came here for lunch and my husband and I loved it! The atmosphere really takes you back in","useful":1,"cool":2},"Kh5-SXkXZRbRptH12Zc25A":{"text":"Great history of the building. Very nice staff and quick in and out with the order. Was ou","useful":0,"cool":0},"ejB1hUz8P3UYsIJNx7N7gw":{"text":"Cool vibe place. Great courtyard with small fountain. This was the first place we visited ","useful":0,"cool":0},"V_7EhGT93U16UbnwELmJSQ":{"text":"So they're known for their muffuletta. I'll have to admit that I don't like muffuletas, an","useful":1,"cool":0},"824rj45Eaucppr-0x44eDg":{"text":"We ended up at Napoleon House today because a different restaurant (that we intended to vi","useful":0,"cool":0},"4RIgp6pSwa2OZKuzFXYj-w":{"text":"Took 15 mins to get a table on a Sunday night around 8. Passed by a bunch of filled tables","useful":1,"cool":0},"JiJ2wyoh_aW2g5xW7wakDg":{"text":"Napoleon House doesn't look a day over 200. Paint peels off the walls, vintage lanterns ha","useful":9,"cool":8},"L_cBBRbJwDQxWu-3rWitXw":{"text":"After four days in NOLA- we all agreed that the muffelata sandwich at Napoleon was the bes","useful":1,"cool":0},"x7ublwp3C7FMbvbI7zxppg":{"text":"Bouncing around the French Quarter, and my friend had a stellar idea! Temperature taken at","useful":0,"cool":0},"zROgI4wTQ-tpJ1mAVx3X6Q":{"text":"We love this restaurant. Whenever we visit, we always make time for Napoleon House. A Pimm","useful":0,"cool":0},"FVCQnD2P8ID-UvZ9fe6b-A":{"text":"Take a step back into history and dine in this local gem. The building has been here since","useful":1,"cool":1},"ONFtn62TR2ZVAEcWmjVNBQ":{"text":"Yesterday was our first visit since the ownership change. We always came here to have the ","useful":1,"cool":0},"GohX7VhJHiAiPE4wmFVIDA":{"text":"Beth and Karen are so accommodating and so very sweet! They made planning our wedding SO e","useful":0,"cool":0},"DvJISDeWMbxJBltzN5iRMA":{"text":"Stopped here specifically to drink the infamous Pimm's Cup and take in the history of this","useful":17,"cool":17},"bismLnkLha4upGoAZAJhvw":{"text":"Being from the New Orleans area and having a palate for seafood. The flavor existed in the","useful":0,"cool":0},"c7cTj9ElKR5MmHqyELs2bg":{"text":"I've gotten a lot of recommendations for this place so I was excited to try it out.\n\nThe b","useful":1,"cool":0},"pAeBlGQyvctDHpp2Ke7PsA":{"text":"Stopped by for a quick lunch. (They check vaccination cards to get in) \nWe 9rdered the Muf","useful":0,"cool":0},"k47ucVN55YwBD6i8ShkNqQ":{"text":"In the heart of the French Quarter on the corner of St. Louis and Chartres, Napoleon House","useful":4,"cool":2},"GAy6bAx_a7wbigmj2Bc7Fg":{"text":"We were highly recommended to get there and see that the menu had changed and that the ser","useful":1,"cool":0},"EJZttSz4xx6Vpe54rgeSMg":{"text":"Went an hour before closing and felt like the staff didn't want us there but that's on us.","useful":0,"cool":0},"qsHUtR4Kw1oz_xNeNyWwEA":{"text":"Since our last visit, things have changed. My beloved bruschetta no longer had Roma tomato","useful":1,"cool":1},"-LoNUMkch-nMrHF7Jds7OA":{"text":"Highly recommend! We chose this place for the muffaletta, and it lived up to its hype! (It","useful":1,"cool":1},"PtvrobyRLvy1M08kdGvHsw":{"text":"If you only go here for the muffuletta you won't be unhappy.   It's my favorite in New Orl","useful":0,"cool":0},"LUYhHLj8r-YuBQ4ka6eqbg":{"text":"Cute little spot with craft cocktails. We had a muffuletta which was the absolute best we'","useful":0,"cool":0},"MVi03vi5JnG9B0TbXpJgJg":{"text":"Super duper friendly staff. Nice atmosphere. Took excellent care of us and fantastic food.","useful":0,"cool":0},"fA2OkZX8EjreODotpWw-Ew":{"text":"This was second time here. I came in July now in Dec. Great atmosphere. We sat in courtyar","useful":0,"cool":0},"4i_dxIRiT7zd4d5mnrLhSA":{"text":"Visited here for lunch specifically for muffalettas and we were were not disappointed.   T","useful":3,"cool":3},"MbPsFAad7fwX9Bka4xZG2g":{"text":"First time trying the po boy today. Enjoyed it along with the atmosphere of the restaurant","useful":0,"cool":0},"m3mlQ2EbpUZAgIDbHhzkOQ":{"text":"Ok finally I got a decent place with decent food, NOLA French Quarter was a complete disap","useful":0,"cool":0},"qq6S74bjGaMBLFhT6wAqag":{"text":"Nice aesthetic\nEasy to find \nStaff was friendly and brutally efficient (positive)! \nPrices","useful":0,"cool":0},"XqF9vtGI2g8RrbKkuGo8mw":{"text":"Quintessential NOLA!! This place is a historic landmark that's been around 200+ years and ","useful":0,"cool":0},"7EmafUcESzlhKlVAlQEo3w":{"text":"Heard about this place from Yelp - SUCH a better option in comparison to a place like Orig","useful":4,"cool":1},"HicG2qj_9S2fbqQV8yDwrQ":{"text":"Great service, very cozy and classy ambiance. The food was of good quality, you will not g","useful":0,"cool":0},"HtWIGVCePwPrwO6TegWBbw":{"text":"Napoleon House will never fail you if you utilize it correctly.  I shall formulate a quiz ","useful":6,"cool":5},"JRMku9xgEhSbT1fria-XsQ":{"text":"Decided on a weekend away to NOLA and started picking places to eat.   This popped up as a","useful":0,"cool":0},"skHNAgpeKmMZ5LAlI5EcCQ":{"text":"I'm going to be totally honest with you. We came here to use the bathroom. But as we awkwa","useful":4,"cool":4},"4IzXK7cdRGiJG9al4Cnayw":{"text":"This review is for the Hot Muffaletta and the red beans n rice. I got a kit off Goldbelly:","useful":0,"cool":0},"qpTvOqUNTAdPAinBjGIYwg":{"text":"The atmosphere is delightful and the food is delicious and gourmet. Definitely worth a sho","useful":0,"cool":0},"k6o_9lR7OqJvh0klosIRzQ":{"text":"I went with a group of 7 and they were happy to provide separate checks to each of us. I o","useful":2,"cool":1},"zW0OnILCRtIFAMBz7Db17g":{"text":"My girlfriend and I decided to try the Napoleon House on a recommendation from a friend wh","useful":0,"cool":1},"2ax3JDl_zm5gGjMPlEmE5A":{"text":"Every time I come here it is not only amazing hospitality, a beautiful garden but also con","useful":0,"cool":0},"5a3EtgY3YkpMQLjQOqeNxQ":{"text":"Dining at the Napoleon House was a pretty cool experience. The inside of the restaurant is","useful":1,"cool":2},"9hAYiPimOfbg8O05NtJ0Lg":{"text":"I get such a kick being a patron at establishments that have been in business for several ","useful":1,"cool":0},"Yawk1IztL5-d-W0urpD26g":{"text":"Overall this was a good experience!  Our first Mufallata was delicious and I'd definitely ","useful":2,"cool":1},"C8TbvAnsIwzCUTYa-wwPdQ":{"text":"I've tried to make it a point to eat at Napoleon House on as many of my New Orleans trips ","useful":2,"cool":2},"Ga3_TDE0-MYHA2iI7vpL8g":{"text":"This is my absolute favorite place to eat a muffelatta. Most places they are not served wa","useful":4,"cool":2},"Xjt4Mmqz2AUp1SEPbfPIFw":{"text":"Napoleon House was easily my favorite place we at at in NOLA. The wait wasn't long and we ","useful":1,"cool":0},"M9d8HD7Oft2DeoDvbW2Wow":{"text":"Hadn't been to Napoleon House in a long time, but decided it was our best option for lunch","useful":6,"cool":1},"5futh0pRZue2LlB1IGEsIQ":{"text":"Can't come to New Orleans without ordering the Napoleon House's muffuletta! This time, enj","useful":0,"cool":0},"AgY5gFKwruImiAcmpJ9mdQ":{"text":"Do not leave New Orleans without coming to eat here. The food, the drinks, the atmosphere ","useful":1,"cool":1},"CtyoIGdVRtIjZGzGQsaDPQ":{"text":"Great food and drinks with a great service! We had a great time at Napoleon house, I'll go","useful":0,"cool":0},"Ckv8Q8QXyV__iN5m7lZhmA":{"text":"This is the first restaurant I came to when in NOLA, I was excited to try the Muffaletta. ","useful":0,"cool":0},"sE3WDXtd_LWADnPePKWPVg":{"text":"I had the best Po Boy in town at this place!! Price is very affordable, it had a great tas","useful":2,"cool":3},"27Ipui_KZnozaYztlLhWRg":{"text":"Love the history of the house, built in the 1800's for the  Napoleon Bonaparte when he was","useful":1,"cool":1},"n9LXiha50hK6TgMWEc8FSA":{"text":"I was agonizing on how to review Napoleon House because I had heard so many great things a","useful":5,"cool":2},"nutaWvTeDFnxgu5oK_jMDw":{"text":"This is a tough one.  The muffuletta is out of this world good.   5/5.   A whole muffalett","useful":0,"cool":0},"lVXBphMQNHrjWn2gJhyg3A":{"text":"My family and I, coming back from a local football game, stopped in on a quiet Sunday even","useful":0,"cool":0},"mqTwtZtchSzVy4Zyy5M3Yw":{"text":"The fabled bar and restaurant that is home to the Pimm's cup.  Classical music greets you ","useful":1,"cool":1},"XX6AJllUYwUdPVPz8ljdGA":{"text":"This is probably the best restaurant I've ever eaten at. If you don't go here if you're in","useful":1,"cool":0},"3p7qNNjm-zHqSwHihhgXmA":{"text":"Pimm's Cup: This is the place to get this and by far I think it's a good drink and I am ce","useful":1,"cool":1},"Psc-txbD1yopBUewGz9o5w":{"text":"Like Sazeracs? Dig an old school hang? Enjoy rapping with friendly bartenders? If you answ","useful":10,"cool":10},"5SJiJ4Dpwxybk0mh4gsJeg":{"text":"ahhh, how I loved Napoleon House.\n\nan absolute refuge from the french quarter mayhem.  eve","useful":4,"cool":5},"yjAleHvJGYXfsemyv74crQ":{"text":"So incredibly disappointed! We came into this quaint restaurant (mind you there are TONS o","useful":2,"cool":0},"F3od6QmVJDYWZvs-8Bb3gA":{"text":"I finally had a chance to try Napoleon House's famed Pimm's Cup and found it to be the per","useful":0,"cool":1},"mKuId90DTQklxfq6ujg6pw":{"text":"@Eating.Drinking:\n\nBased in #NewOrleans' incredible French Quarter is the equally incredib","useful":2,"cool":1}}