{"f0R5VnrjmA0nW5Q_2fvsnA":{"text":"I have used \"vrbo\" and home away websites for a longtime. This is the worst experience I h","useful":1,"cool":0},"bvEF7Wq2aMMwrHI1RTU-KA":{"text":"Once again, I wish that I could give half stars, because this is really a 4.5 review.  Sim","useful":1,"cool":0},"giY8qHW4v-xwV-262rx8sw":{"text":"I spent a few days here during the Easter holiday and the hotel is really nice. The staff ","useful":1,"cool":0},"wnHD1fxCdnIY377Bh0amwg":{"text":"We booked the 10 room townhouse for a weekend long presentation and it worked out wonderfu","useful":0,"cool":0},"7gdQ9hFuVN3euDmZlyQ0YQ":{"text":"As we walked up to the hotel we were greeted by friendly staff.   We are checked in quickl","useful":0,"cool":1},"pJKaBntDrYOHmW2RUWxZeQ":{"text":"I'm so happy I found a vacancy at this hotel after a nightmare situation at the nearby bed","useful":2,"cool":0},"4R-hO86ZrUO4KcBT2As1dw":{"text":"Positive: Great price. Easily the best we found in the French Quarter for what it offered:","useful":1,"cool":0},"6wAIOW_6aHIyBMJMyK2wHA":{"text":"This was my first time to New Orleans. I had no idea what to expect from the hotel or the ","useful":0,"cool":0},"nAPXJDRKlOR2MlXn9snP6w":{"text":"My son and I stayed here for the night and we are so glad we did. The room looked like a c","useful":0,"cool":0},"4Vo3K2ctGyM-1Hf1BZfFRw":{"text":"We attended the Final Four basketball tournament early April and stayed here with our grou","useful":3,"cool":0},"S4fZmVrqge7NfEfKjGW0cQ":{"text":"The hotel was good for our needs - clean, spacious, and accommodated pets. However, it was","useful":1,"cool":0},"oWWlt36J8WUKXKAPJ_Dj0w":{"text":"This place seems to be a work in progress. First, some of the things folks say are dead-on","useful":0,"cool":0},"Z7QAeDIhbQzuo3KrAyXYBw":{"text":"Great location but desk attendant and manager were very unfriendly in a way that seemed pr","useful":0,"cool":0},"4JuyvP2qotMbJwiGujV8wQ":{"text":"This hotel is quiet and clean.  You do have to understand it's a bit older, however, the s","useful":0,"cool":0},"a4mO387_O77ebmv8AlQB3A":{"text":"Dirty rooms with paper thin walls. Uncomfortable beds outdated everything. Location in not","useful":0,"cool":0},"eExzl8X3G_h4bvQ-E7qxdw":{"text":"I was so happy to find this location after a huge disappointing introduction to my reserve","useful":0,"cool":0},"6Z1SdHEdkvOMI5jx3jigMQ":{"text":"We traveled to NOLA via motorcycle and stayed at the French Quarter Suites for a week.  We","useful":0,"cool":0},"FQVoTY-yRH7-VW7soCFizw":{"text":"This is our 5th time staying here and we just love it.  Location is great, staff is awesom","useful":0,"cool":0},"CPm0qM4sPxLcJCOznUZMmQ":{"text":"Huge room and great service for a very fair price.","useful":1,"cool":0},"cM2fxVA8D6hl50SyzQcAqw":{"text":"NEVER stay here  I wasn't given a suite, but a room WITH NO WINDOWS!  When I asked the fro","useful":0,"cool":0},"snv8klT9ORBHpsVW2Fk7-w":{"text":"This place came through for us.  For the price it was unbeatable!  The location is just ac","useful":1,"cool":0},"tYXtkKaEM3APJzhZsIuGuA":{"text":"Myself and 7 friends stayed at the \"Party Pad\" bottom level for a Bachelor Party. \n\nPros -","useful":1,"cool":0},"NTzly6OR_0d-Hy0BF__t0A":{"text":"Attended a great pool side party with a group event hosted at FQS hotel. The place was bea","useful":0,"cool":0},"hsJHEfHAeOJj0JhZI1RgbQ":{"text":"We stayed here for two nights during a busy weekend in New Orleans.  The staff here are ve","useful":0,"cool":0},"Io5dLYHRZIuRC_qPlc6R3Q":{"text":"Older building. Smaller rooms. A pool that could be mistaken for a swamp. That being said,","useful":1,"cool":0},"eFObt1EgE3sjip6133Tu7Q":{"text":"We stayed here a few weeks ago for six nights and had a great experience.\n\nThe place is lo","useful":1,"cool":0},"GLPk7VqVv4Rr8JfxWlWbog":{"text":"I love this hotel. I visit new Orleans every other year and I always stay here. Price is g","useful":0,"cool":0},"cktT5EouRTGDSiXRQSAoJA":{"text":"We booked our four night stay at the FQS because it was relatively cheap, or so we thought","useful":0,"cool":0},"fkX-ZKsAF9VyFXeclHSs9Q":{"text":"The best part about this hotel is its staff. From the maids to the maintenance and the fro","useful":1,"cool":1},"-hHklVcH33Yyztk1kkVJ5Q":{"text":"Yes, this place is cheap. However, I still expect them to deliver what they promise. This ","useful":2,"cool":1},"FkEoX6ns7i2x41j-9_OF4g":{"text":"I stayed here for NYE. When we arrived we had a extra person and got a free upgrade to a t","useful":0,"cool":1},"rxnB3IVQqVC_MAQmCisBeA":{"text":"This is the WORST hotel I have ever stayed at in my life. There was absolutely nothing goo","useful":1,"cool":0},"SQBLLv1-hIa3KIrH_gib8g":{"text":"Thank God for this place. We were lucky enough to get an open room at 5am after switching ","useful":0,"cool":0},"YwV9vcpH4m5vrDLjviB3nA":{"text":"Stay clear of this hotel , it use to be clean , friendly and very accommodating back when ","useful":1,"cool":0},"HTkxX8-7FDbd6RJaVjVmVg":{"text":"This is absolutely the only place I will go to in New Orleans. If you want great customer ","useful":0,"cool":0},"a-sX-zhvYUNLrxovsgPcTg":{"text":"The first impression is a building with tons of character.  It looks worn, but in a classi","useful":3,"cool":2},"ewcSIwHTykttGQNJc6dKeQ":{"text":"This hotel's only saving grace was it was not too far from Bourbon Street and other points","useful":0,"cool":0},"tf_Q2KmqTGKtEwSAfEFQcQ":{"text":"This app keeps erasing things as I type then so see attached for my review and pics. \n\nSee","useful":0,"cool":0},"KIitQuAyIlKuD9XPw_RpfA":{"text":"I made our reservation online after reviewing their web site.  No where on the website or ","useful":0,"cool":0},"GSsJgdxmMJP-2IQywcwZ7Q":{"text":"Btw \"French Quarter Courtyard Hotel\" and \"French quarter suites hotel\" are next door to ea","useful":0,"cool":0},"zIK-Rna0XWEdLEpPxYCsiA":{"text":"Man, this used to be a 5 star for me. They switched staffs about a year ago after the sell","useful":0,"cool":0},"NtzZX79YZpkXhLr4uKuYvQ":{"text":"We first heard about French Quarter Suites through friends who booked with them in the pas","useful":4,"cool":3},"BcMOvt_MMk8m9l3r1YKJeg":{"text":"We have stayed here 10years in a row for Jazz Fest and always had great experiences here. ","useful":0,"cool":0},"R9tBvUBVV3RPsJUvZafnLg":{"text":"The French quarter suites is where we stayed for the weekend. This place was nice and old ","useful":1,"cool":1},"nK6_cuu3LPDMAiuEm5YdWQ":{"text":"We chose to stay here because it was in a good location between the districts. It is very ","useful":0,"cool":0},"8RS0Zl1iCjiJgkCrvLVEWg":{"text":"My trip was great from the food, nightlife and energy of the city it is absolutely fantast","useful":0,"cool":2},"NxAY7R9HCVZh39TqJAZ6Zg":{"text":"My timeshare got cancelled and i had to scramble for lodgings.  This place came up in my s","useful":0,"cool":0}}