{"FJQvMOeEa5t9aGwrb40nsA":{"text":"This \"Joint\" haha was on Diners, Drive in's and Dives.  It is defiantly the later but the ","useful":0,"cool":0},"aFd8Vf-PFPhpYXOJqSfMCQ":{"text":"*DROOL* \n\nThis was the last spot I ate at before my flight back to DC. My fellow fatties a","useful":0,"cool":0},"CpMETzC0mQvsMOdAVX21xg":{"text":"Perfection. Just don't sit outside, u will get swarmed with Mosquitos. Although, there is ","useful":1,"cool":0},"9BJAxJkgQ9TZFZiePWR1kA":{"text":"Great barbecue and terrific side items. Nice patio for outside on a sunny day. Ambiance is","useful":1,"cool":0},"cm82b3VU0EU1XAoP_jXDxw":{"text":"This place is amazing!! If you like eating meat, this place is the place for you. This is ","useful":0,"cool":0},"ZkXCE0qhgW2UwmqFSRT66w":{"text":"If you've never been to New Orleans, you're missing out on what eating is.   This place is","useful":2,"cool":1},"mcv1xjRDzIS2bzmlSoQmpw":{"text":"YELPers - you were right!  This is some of the BEST BBQ I've had in some time.  And I eat ","useful":2,"cool":2},"xNT7zn5o26DDuNtJUop5YA":{"text":"This place is heaven for any BBQ lover. Easily the best BBQ in New Orleans. If you go for ","useful":0,"cool":0},"DHBiOMoyTQaqsKp1PmwJzg":{"text":"Awesome local BBQ food. Get there early, because they run out of ribs and brisket fast!","useful":0,"cool":0},"8l9yfmZ9b22y5IeTGVVf0g":{"text":"You know that BBQ joint from House of Cards? This place kind of gave off that similar home","useful":3,"cool":2},"e6aKDFXy7P1MVwcYPtBh3A":{"text":"This place is off the beaten path but well worth the drive!  The BBQ ribs and pulled pork ","useful":0,"cool":0},"PI_I7IHaxl0ZmbYVWqP7MQ":{"text":"The absolute best bbq I've had. Everything is so tender (even burnt ends) and the value is","useful":0,"cool":0},"NpS4CZSQ96CLMFXk0mi43g":{"text":"Love this place. \nEverything you want in a real BBQ place. \nThe outside patio is nice with","useful":1,"cool":0},"zqmNm9uc1ZJ8EE6HPqVaxw":{"text":"Great food and it's comes out fast. I get bored of most of my favorite New Orleans spots a","useful":0,"cool":0},"aN9iezPLhsybP8W0e52m1A":{"text":"Been to several BBQ \"joints\" & this place is at the top of the list.  Great job!!\nPS - Try","useful":1,"cool":1},"-MWXpOnsj8eSeEcqH6oXHQ":{"text":"If you happen to be in the area... as in you are visiting the damages to the lower ninth w","useful":0,"cool":2},"NwtUM1voztDTCh1qUkQZew":{"text":"This place is too legit. I'm talking brisket on fleek. Cuban sandwiches to die for. Amazin","useful":2,"cool":1},"uPZiO0rc-qjRmCzOyERY0w":{"text":"This hole in the wall \"joint\" is exactly the kind of place true BBQ connoisseurs can go to","useful":1,"cool":1},"WDcFzwVlWboP4GhlBwr3kw":{"text":"Cute place in mid city, the pulled pork sandwich was \"ok\" not much flavor so we added the ","useful":0,"cool":0},"TaXt8C0ThbS2ounIA8UKHQ":{"text":"Totally awesome.  The food, the beer, the setting, all were exactly what BBQ joints aspire","useful":0,"cool":0},"lnm-xR4a0KJJ4JeJ-SuXBA":{"text":"i can easily believe this is the best BBQ in town.  The tip about the outside seating area","useful":0,"cool":0},"ywH5yWC3Y0JowOmpMa_dYw":{"text":"I've only eaten here twice. I'll probably have to update this review to a higher rating af","useful":0,"cool":0},"S1fA5tw_eisUJg4p2wdyow":{"text":"This place is legit,  amazing bbq, amazing sauces and you feel like a local here. We got h","useful":0,"cool":0},"nKLEIYnp0Sv_UpiQjCPOGg":{"text":"Best BBQ I've ever had. The ambience at The Joint is stellar, the service was excellent, a","useful":0,"cool":0},"LOMCeFavDn1TrYyv7c3rpA":{"text":"So I'm not a meat eater, in general. I love boiled seafood and I prefer to eat mostly shel","useful":1,"cool":0},"VpETDKpR8naKNzib8RX39A":{"text":"The new space on Mazant Street has more room, plus an added bar and an outdoor seating are","useful":0,"cool":0},"iSlLnSWboTIM-lf_oMzg0w":{"text":"Quality sucks very disappointing.  The person we ordered from couldn't even describe the b","useful":1,"cool":0},"G_OXisL24TmHhVealaZQdg":{"text":"I'm giving this 4 stars only because New Orleans has like all of four BBQ spots in this wh","useful":0,"cool":1},"SPD3M330QyeX87Ry6x1Wsw":{"text":"It's fun ambiance, but the meat is way too smoky for me. My friends and husband liked it b","useful":1,"cool":0},"CJ1R6a-MzzuF-xQf4BFgpA":{"text":"Best brisket ever! It sounds ridiculous to eat BBQ in NOLA, but I'm so glad that we did it","useful":0,"cool":0},"ogA3Yhic28PgzyaKnJww4g":{"text":"There are times when, as a visitor (albeit a frequent one), you need a break from Creole a","useful":0,"cool":0},"AwPMT49k0pYA7Gc85cKerg":{"text":"This was our first dinner in New Orleans and what a great choice. Good food, interesting s","useful":1,"cool":0},"Aye7wXxQbyevX276JUhQow":{"text":"Smells like good BBQ when you walk in the door and it does not disappoint. Enjoyed the pul","useful":0,"cool":0},"MYSI6Nof1_Vu2F30_YIiCg":{"text":"The joint is the only place we go for BBQ in New Orleans. I have tried almost the whole me","useful":0,"cool":0},"jFoXwFjyM07ZGJ7dfPaZew":{"text":"Finally ended up here for lunch a couple of weeks ago. Packed with a great slice of humani","useful":10,"cool":4},"CvoaCjDXuwywmFm2bsHKJQ":{"text":"The real deal.  This is a great spot.  No frills.  Beef Brisket is wonderful.  The sides a","useful":0,"cool":0},"7zBuJm3QM5wUaDEY4PmPQg":{"text":"The Joint was a fabulous find in NOLO with homemade everything!  I had tender burnt ends w","useful":0,"cool":0},"9rSnu7rujsztp4GB8eEWvg":{"text":"Super place. Just what I wanted in terms of bbq. Briskets where delicious. Gentrification ","useful":2,"cool":0},"hwiaua8zT4jWW8-eNOPu2w":{"text":"Dive-y little rib joint that is sure to please. Off the beaten path, but well worth the ad","useful":1,"cool":1},"e_sR0GLpYVS8aLF0mX-utw":{"text":"SOOOO good! I am glad that we found this place via yelp. My fiance and I went while vacati","useful":0,"cool":0},"iisp_SK_JdjMbwzQU05NtQ":{"text":"Boyfriend and I walked all the way from the business district to get here for some delicio","useful":0,"cool":0},"Np1d06BSJ7vDUyL-Pnfl8g":{"text":"I've been told that this is among the top ten BBQ 'joints' in the country or maybe even in","useful":1,"cool":0},"m86ukZQxfVCD8nZ6u3scHQ":{"text":"You have to try the brisket!!!!!! The smoke ring is perfect all the way around and the mea","useful":0,"cool":0},"cY5bpQZR_2E7ixAmKnw_Yg":{"text":"I'm originally from San Antonio, Tx.  It has some of the best BBQ around and I've made my ","useful":0,"cool":0},"1sNDhICRyX5ZReGLTjKzvQ":{"text":"Neighborhood fav, imho overrated.  Edible bbq but not much else to choose from.  Nice loca","useful":0,"cool":0},"IHQgtlKbLGuJbwoTzPlbVw":{"text":"I'm mad I didn't find this place sooner! The food was above and beyond. I had the pulled p","useful":0,"cool":0},"kxoYBV-X2E4St6qh3vecdg":{"text":"Some of the best pulled pork bbq I have ever had...topped with slaw and sauce, left me wan","useful":0,"cool":0},"S1QPRDGslfjD3YQLed-RYw":{"text":"My first experience with New Orleans BBQ and was I ever impressed!  Pork ribs that fell of","useful":0,"cool":0},"D8VlbxK2UIE5DPUXkbIpFQ":{"text":"Worth the 10 minute drive from the French Quarter. Tender smoked meats, classic sides, and","useful":0,"cool":0},"aaw3re0Hb5I75nCWff97Dw":{"text":"Nice low key location in a cool neighborhood, friendly staff, and quick service- can't com","useful":1,"cool":0},"lIYCGyVoeG6QxxsyXDDojg":{"text":"Yum, great bbq and all that i expected. The ribs and links were amazing- the former having","useful":0,"cool":0},"gEj1pcGDJlRz-ZDVgj8Abw":{"text":"TLDR; this place is trash. \n\nOrdered at the counter. 3 meat combo with brisket, pork ribs ","useful":4,"cool":3},"YLZ3aMQJIjoMW2kmXd2zSg":{"text":"I loved the dry rub on the ribs it was so flavorful. I didn't care for the baked beans tho","useful":0,"cool":0},"pfwH2rFNODKW3pqawbhBAg":{"text":"We are from Kansas City and are accustom to very good BBQ. We ordered the burnt ends, pull","useful":0,"cool":0},"xduyThLe5Zgtdkrt_6QGXg":{"text":"Me & my wife went here yesterday for lunch. She found this place on Yelp and it was DELICI","useful":0,"cool":0},"xIH9LZVrtSoz_QUBSvVZuw":{"text":"The BBQ is very flavorful. The facilities are atrocious. Not just dive/hole-in-the-wall-ba","useful":2,"cool":1},"_vstAnQjHmrW6fmHy3c2WA":{"text":"Quite Frankly, I'm embarrassed it has taken me this long to write a review for this place.","useful":1,"cool":1},"n7Cn9SNXaana9bAjwr6DWA":{"text":"The joint is a lovely BBQ joint, and I love the name. The joint is exactly what it claims ","useful":0,"cool":0},"mRtJCEpFKnxl8Q7NVR46Kw":{"text":"Twas my second time eating food from the joint, but my first time actually eating in the p","useful":1,"cool":0},"FqX5ZgpdamdVtELQsKYrjA":{"text":"This is the best bbq place in New Orleans.  It is comparable to many small town bbq places","useful":1,"cool":0},"h5jSdAqKUjYR7taGYLDXFQ":{"text":"Honestly, I don't get the hype. It's not terrible but it's not that good either. Good BBQ ","useful":1,"cool":0},"zZIkYxj9JYzt8KUTjFGaxA":{"text":"Took a walk at Cresent Park and ended up here.  Delicious ribs, baked beans are to die for","useful":0,"cool":0},"t2kZE8EHJUiZpsjfsg523Q":{"text":"Great BBQ overall. I ordered the 3 meat combo and 1 side and got ribs, brisket, pulled por","useful":0,"cool":0},"6omKzcMbU2DD2iUVeQ4RuQ":{"text":"Best BBQ I've experienced. The sausage with the dipping sauce is to die for. The sausage w","useful":0,"cool":0},"rt_WPVwJ5ce1FhEfa0yogQ":{"text":"I was a little overwhelmed with the smell of barbecue walking in (my friends hadn't specif","useful":2,"cool":1},"gcWVky0THgQETxeIbTONHw":{"text":"So, I heard rave reviews about this place on TV ad well as family. I'm in New Orleans for ","useful":1,"cool":0},"_5ewGkkHCzJjSOr-1tH4ng":{"text":"One of my favorites in the neighborhood! With fun drink specials, consistent solid bbq, an","useful":0,"cool":0},"h2PHTOQ_GeacKfEdzvZeZw":{"text":"Between the wifey and me we ate some pulled pork, sausage, brisket, and chicken. The pulle","useful":1,"cool":0},"9IyjLcWtteA4-QRBBe2raw":{"text":"Yes. \nJust... Yes.\nWas walking to Mardi gras zone (great natural food store!) from a frien","useful":0,"cool":0},"W6lfLh9RGMjAg1fYDFrkVw":{"text":"I was very impressed with the quality of meat (pork and chicken) from The Joint. I'm not a","useful":1,"cool":0},"d2aG-P2ZOw_Jv3K6UHELfQ":{"text":"OMG - shoot me now. I've found heaven, and it's name is The Jount. Seriously, this BBQ is ","useful":0,"cool":0},"jcAIL-utOYsnVO_EB77PjA":{"text":"I'm no BBQ expert, but, based on friends' recommendations and my taste buds, The Joint is ","useful":0,"cool":0},"Qz91L-rnPdYP4-x3pnc8Dg":{"text":"After hours of record digging at Euclid worked up a mammoth hunger, I needed something to ","useful":3,"cool":1},"fI4oyzwZ5u1JVgflR440KQ":{"text":"Charming ribs restaurant just outside of the French Quarter (we got there by Uber). Friend","useful":0,"cool":0},"PaOKA3SBReGvKxJeQizRDA":{"text":"One word. Awesome!!! Well, several more words. Real bbq. Excellent flavor. Cool ass people","useful":1,"cool":1},"iliwm0ldpOL3J0c35jR9WQ":{"text":"Really wish I could give this place a 4.5. This place was great. I especially enjoyed the ","useful":1,"cool":0},"CvPRprVveRA-agGQzQtBUA":{"text":"Food was okay, service was poor. Right when we arrived they ran out of ribs, which is what","useful":2,"cool":0},"C6SHQ7SNputeZrThLYY-Vg":{"text":"The BBQ here was phenomenal. My only regret is that I shared a 3 meat plate with my boo - ","useful":0,"cool":0},"IvL6DlwanfdlaXjPJe4q3Q":{"text":"I'll give it 4. Prob more like a 3.5er. It's good, but over-hyped. \n\nThe ribs are really t","useful":0,"cool":0},"hjRaKtzfu2X6huTRI_CbeQ":{"text":"While my husband and I are huge fans of Texas BBQ, we realized we had to try BBQ elsewhere","useful":0,"cool":0},"MFDXGbjTDVRNJyL3bb-7qw":{"text":"This place is fantastic. The food is amazing. Best pulled pork sandwich I've ever had. The","useful":0,"cool":0},"XWUcN2nQWaP4_sweyqcQGA":{"text":"A decent lunch spot. The pulled pork and beef were definitely tasty, but I wish there were","useful":1,"cool":0},"ci1_UeWowu7GezEJgOVTlw":{"text":"Ribs, guys. It's all about the ribs. Treat yo self. Don't bother with sauce. The ribs dese","useful":0,"cool":0},"kzqfVrO7w8MBvtnPU09S-w":{"text":"I was in town for business and got to reconnect with an old college friend now living in N","useful":0,"cool":0},"5c5TZ37X6cDeKjmJCDrEXQ":{"text":"Apparently, the barbecue scene in New Orleans is not great. Nevertheless, the Joint is a g","useful":0,"cool":0},"aylN12W9TjKu1y_u_0aoXg":{"text":"This is the best barbeque in NOLA, hands down.  The Joint looks just like it sounds and th","useful":4,"cool":4},"wGrXKLx5v1dylPUpgBfePQ":{"text":"Best brisket I've ever had, the pork and ribs were both really good as well but the briske","useful":1,"cool":0},"eog2xsw0-LJh7eeG-N1YSQ":{"text":"I hate when people say things like \"I'm from New York (or LA) and there is no good Chinese","useful":8,"cool":1},"aNo3HlANAYUo3xVNfsogZA":{"text":"This place is SO YUMMY!!! Granted, I feel like you can only get here if you either have a ","useful":0,"cool":0},"bQnNYPzRIgnyvqw9Lvx--Q":{"text":"This place is ridiculously delicious. Must stop if you're in the area! We ordered some bri","useful":0,"cool":0},"VyPAiL8nMK8RdL3PUz_jIA":{"text":"First night in New Orleans and we picked this place b/c of the reviews. It didn't disappoi","useful":0,"cool":0},"BDzuMFqJQgm5i4S0qTY_ug":{"text":"Would definitely recommend to anyone who's in the area! Taste is so original and very very","useful":0,"cool":0},"JBv1sw9O8NmrJy2qMhsj8w":{"text":"Not being a New Orleans resident, I guess I can't say that The Joint is THE BEST BBQ resta","useful":0,"cool":0},"kZez9jT_cp8_KhPrZB_uBA":{"text":"Best ribs I've had in certainly many years, possibly my entire life. I am now enlightened,","useful":1,"cool":0},"pCNNvMWSozqgCa5ivhRpSQ":{"text":"Great BBQ. This place is a bit off the beaten path. We took a bus to the resturant as we d","useful":1,"cool":0},"tRH36BfNXd0wuyjn91yK9A":{"text":"I had the beef brisket with mac and cheese. Very good BBQ  Brisket , a tad bit salty. Nice","useful":0,"cool":0},"aufRUreP7EfurUNQc2wzFQ":{"text":"Two Meat Platter with one side for $13.50 I mean.... you just can't beat it. MORE THAN ENO","useful":2,"cool":0},"V0w99_LSrpb2s88AzhXcKw":{"text":"This is the best barbecue in New Orleans, without a doubt. The ribs are absolutely fantast","useful":0,"cool":0},"XHtHlhFJ7nv7vofX8AHCKQ":{"text":"I so badly want to like this BBQ joint but.... I can't. And maybe it is because I am from ","useful":2,"cool":0},"_02sxkL7z8FOaa2lppBcqQ":{"text":"Sitio top! Muy recomendable! Pedimos el combo de dos carnes (costillas y pollo) y estaba d","useful":0,"cool":0},"Hqvats_DnMVbHj9xOK_6_Q":{"text":"OMG!  Best BBQ ever in New Orleans area.  The food was excellent. The ribs, the brisket, t","useful":1,"cool":0},"fG3RfwznJkHJICa6BB_3AQ":{"text":"Had brisket, mac n cheese, and greens salad. Place was packed due to 4th of July holiday. ","useful":0,"cool":0},"x4tyoYVxl-RPMLbG6G3bRg":{"text":"I think I found my BBQ place!! I got the pulled pork and chicken, with mac & cheese and po","useful":0,"cool":0},"HpkdYxZm-l8pCYwueFfQsw":{"text":"Honestly, I'm only giving it 5 stars because 10 wasn't an option. This place is awesome. A","useful":0,"cool":0},"_RiBjphe92aNv8rd-zcOGg":{"text":"Delicious, meat was cooked perfectly. I don't even really like vinegar based BBQ that much","useful":0,"cool":0},"qN77j7_GWnkb-X-funalww":{"text":"Its actually pretty solid bbq. The service is very nice and quick. The bbq meat was good. ","useful":1,"cool":0},"6esGAXYmuwthvmSfyBQOJg":{"text":"My husband and I are honeymooning in NOLA! I saw The Joint on Diners, Drive-Ins & Dives a ","useful":0,"cool":0},"5BYNhFXL0jJwBwtBnUAB-Q":{"text":"Loved it! Great atmosphere and great food! We had the brisket, pulled pork, and chicken. E","useful":0,"cool":0},"Nh6fGQgeRlD11ok4eEqf-w":{"text":"I had heard so many great things about this place so I had to come see for myself. Let's j","useful":1,"cool":0},"CUikYoQ3hhnjk9PNAVSOjA":{"text":"No good. Toooo greasy.  Not well fitted for BBQ at all. No taste. Stomach ache. No food is","useful":0,"cool":0},"GqHmmFcupKODEzoNx1GwBg":{"text":"Best Bar B Que I had in 2012. I think this is a must for anyone visiting. There are so man","useful":0,"cool":0},"_K3Mj-X0uJZFYE2OdTPaxg":{"text":"There is nothing better than needing to clean yourself off with a roll of paper towels aft","useful":0,"cool":0},"XbNkBumn1Tb20DK-z0DL_Q":{"text":"Best brisket I think I've ever had in my life ... and I used to live in barbecue country. ","useful":1,"cool":0},"gTkk7dekQKjYC8MHq4PQ6w":{"text":"Great bbq. Hands down the best in NOLA. Small joint but it has charm, in the bywater.","useful":1,"cool":1},"NvVhc594lYHw9zfaM7LSgQ":{"text":"I asked my cabbie to take me to a BBQ joint he would go to.  He brought me here.  I ended ","useful":0,"cool":0},"PxySN5z_Id5ckUXDwbWjwQ":{"text":"We came around 7:30pm and we got in just before the rush. We got the brisket plate and the","useful":0,"cool":0},"0vN9LJz9Kgoa0CIDgKc5Hw":{"text":"After a random drive to St Bernard, my husband and I were hungry. A quick Yelp search turn","useful":1,"cool":1},"ixjBo0yjxKuiSC1F0xC2TA":{"text":"Preeety good, Joint, preeety good. You were my favorite for years...the only good BBQ in t","useful":0,"cool":0},"IR2O6F5v5s-JRfpgsHVlZQ":{"text":"Not really sure how this place has such high ratings (coming from someone who generally gi","useful":2,"cool":0},"NZMz8csAlJSR5KOgsBgtlw":{"text":"Quit reading and get down there quick. This is some of the best food I ever ate!!! We had ","useful":1,"cool":0},"187zM3wVtt4PjzReD0B52Q":{"text":"There was a line on 7/4. They were out of ribs so we got chicken, pulled pork , brisket an","useful":0,"cool":0},"dnmBekRH27YvJwJ1-KsA3w":{"text":"You should absolutely come here if you're visiting NOLA. All my visitors have LOVED this B","useful":0,"cool":0},"D-tN-ixp9m5ewH7Ivl9_xQ":{"text":"The service was great! The server was attentive and refilled our drinks! Their own persona","useful":0,"cool":0},"Oox7NPnn_E_5RKHZBOdv9Q":{"text":"So yummy.\n\nI had the \"W\" special which had brisket, pulled pork and 2 ribs with a side of ","useful":0,"cool":0},"vTotskKr41hTmhVHB-xm5Q":{"text":"Fantastic bbq. The brisket has a great smoke ring and the 3 sauces are delicious and varie","useful":0,"cool":0},"RinBIoUUT4rZxK2B1XoHzg":{"text":"Okay. Not the best BBQ but it'll do the trick. Nice warm atmosphere and people.","useful":0,"cool":0},"LKfYZDIUJ9C_R92CSykchA":{"text":"im a bbq fanatic and was on the hunt for the best in Louisiana.. THIS IS NOT THE PLACE. i ","useful":0,"cool":0},"IF48uKVPReLPwGNHBWAPyg":{"text":"For a city not known for its BBQ, it is incredible to me that this restaurant is far super","useful":0,"cool":0},"EpgYuCuQGiwx73fndwDV0A":{"text":"This is the best BBQ I've ever eaten. We got the three meat combo and brisket sandwich, ma","useful":0,"cool":0},"rx1X4GC0s68MeRLlqt19Mg":{"text":"This place is nice little dive with Amazing BBQ. Pulled pork and beans are a must here. My","useful":1,"cool":0},"ULeFKOamkgY_TogQR77Aww":{"text":"After a rough night on Bourbon Street, my buddy and I needed a joint... or should I say TH","useful":2,"cool":1},"j006wc3d-N5W2fvfsibnFg":{"text":"If only we got there sooner, but the food was delicious. Totally worth the wait, great mea","useful":1,"cool":1},"6CWszdU4EcKjGb33fnUr0A":{"text":"I give this place a SOLID 4.5 stars, but not quite 5. This place serves DAMN GOOD BBQ, but","useful":1,"cool":0},"JBMzP0Av_uhsBMrLNjlX0w":{"text":"Great BBQ and sides, hearty portions. Well priced. Clean, friendly atmosphere\n Fast servic","useful":0,"cool":0},"ysgZ5F5xzJrVhT3oOHk8GA":{"text":"Incredible ribs, and a super fatty brisket with some surprisingly deep, almost mushroom-y ","useful":0,"cool":0},"k0kmwTO4RtFMFmSQ3VOUdA":{"text":"Awesome BBQ spot. In a town famous for the quality of its food, The Joint certainly fulfil","useful":0,"cool":0},"xXK2gu4reeDKwn1eu607NA":{"text":"Never eaten INSIDE but we have gotten take out a solid number of times for our office (wor","useful":1,"cool":0},"O29H5FW3SloUmMkzGv-vzQ":{"text":"I would eat here every day if I could, and die in the most blissful cardiac arrest. Their ","useful":0,"cool":1},"KtDCK6yJKq6doxNNY2rDjw":{"text":"I cant believe I havent written a review for this place yet. OMFG!! I was recommended this","useful":3,"cool":1},"4aGCiL-of19HxfQhx4Nxzg":{"text":"This place is amazingg!! The 3 meat platter is the best way to go. The pulled pork, and ri","useful":0,"cool":0},"mp14zfP_9Okq6B6RkNJfxA":{"text":"I've been fortunate enough to travel pretty extensively in my life, so I've had my fair sh","useful":2,"cool":0},"p4oxs6OYWfHdEeGPJHIzJA":{"text":"Much hyped BBQ spot in new Orleans. Bit of a distance from hotel but turned out to be wort","useful":0,"cool":0},"muYfKzIv5YNxYbcakyn9YQ":{"text":"Oh my god, I'm originally from Chicago and I go down to NOLA once a year to volunteer. Thi","useful":0,"cool":0},"4cBt5S_jvJnsHauacU4lDw":{"text":"This place lived up to the reviews! The atmosphere was unique and the people were nice. Th","useful":0,"cool":0},"9I-slGjUvLTTt-I8Ky8Q-Q":{"text":"This place is legit! I'm from Los Angeles so saying this is the best bbq I've had is not c","useful":0,"cool":0},"epvaN70KJy2QB9kZhrf4Yg":{"text":"This place doesn't mess around.  Having spent 6 years in NC, I can say with confidence tha","useful":0,"cool":0},"KTMrqqfrISGiaumMGuNWeQ":{"text":"Best BBQ I've had in New Orleans! I live on the Westbank and make the trip out here on occ","useful":1,"cool":0},"LagJRah0tQPiqLB8KkIO2A":{"text":"This is reason enough to fly from SF for the day!  loved the food, the sweet tea is as exp","useful":0,"cool":0},"qF0iFuFqwjFMeeioXEg4QQ":{"text":"The food was awesome but the service was terrible and we were surrounded by flies. It was ","useful":0,"cool":0},"a46QcCIjDYGxZO8JEkSJ9A":{"text":"if there is better BBQ in NOLA, I don't know where it would be....\nThe Joint is infamous f","useful":1,"cool":1},"fu2aVRLxB9Bokuc6lBofxw":{"text":"AMAZING!!!!! Everything is delicious! Great little Bywater restaurant and the price is rig","useful":0,"cool":0},"w8hvczff6cXWewYAKK0Rkg":{"text":"The Joint is in the middle of no where and was the first spot we hit up after we arrived a","useful":0,"cool":0},"w8q9Yb4o1ueps60qJGrXww":{"text":"This was our first time eating at The Joint. The food was pretty good but the service was ","useful":1,"cool":0},"dKgkn_FtVQCcaymRYQEjzA":{"text":"Excellent bbq. They had collards tonight which were awesome.  Macncheese was eh.  Beans we","useful":0,"cool":0},"nyEZ3gSeoMDke5vxReONYg":{"text":"It is time for a review update. \n\nI absolutely hated this place when I first came. There a","useful":3,"cool":0},"vLLMwZwUZyLF79sq2lzmWA":{"text":"The brisket was SO good. This is definitely one of the best BBQ places to go in New Orlean","useful":0,"cool":0},"I0VbzMP6DFQPHldoRRov_A":{"text":"Dear God. Talk about living up to the hype.\n\nOur family ate at Domenica, August, and Petit","useful":3,"cool":0},"nf5j1kOkxqWDC4LysUHVEg":{"text":"Very happy we went here, BBQ as it should be excellent dinner","useful":0,"cool":0},"c4b0TWfUoeJVn96osBvJmA":{"text":"After all the talk about this place I finally took some time to check it out.\n\nLocation: S","useful":4,"cool":2},"UNiL8zL0Ki7t2h9VU2rrjg":{"text":"Very good BBQ place, highly recommended for the ribs so I went and got a three meat plate.","useful":1,"cool":1},"AcVqjP-qJpoBLI24fZ3Pxw":{"text":"I rarely give 5 stars reviews.....\nThat being said.... WOW!!\nThis is the real deal. You sm","useful":10,"cool":8},"ac9hiyvKEv9RGqE5XfSUWQ":{"text":"Good was tasty, staff very friendly. Got a table easily (Monday at about 12:20) and it was","useful":0,"cool":0},"fIX1ZNI1W0_sG0onwdyBUw":{"text":"Just what we expected it to be! The service was fast and the beer ice cold. Thank you for ","useful":1,"cool":0},"sKWuZcFQrRsqeIijKKuI8g":{"text":"Whoever thinks this place does not have some of the best bbq ever is CRAZY!! JK. But I wou","useful":1,"cool":0},"m6O4vtdFAgggvwHGMIo7_Q":{"text":"I can only give this place a five start because that's what it deserves. We had ribs, saus","useful":0,"cool":0},"0Wi0CXPmkNl_Y_6u2EFpiw":{"text":"Whoa!  So good it'll make you cry. We almost didn't come here, but the place we wanted to ","useful":0,"cool":0},"FNBtitE9KFJfJ6ZXDTr-6w":{"text":"Good BBQ, but not the best in town by a long shot (I recommend McClure's, unless you're at","useful":0,"cool":0},"El9c8s-ZPHG7qfdmjUQTNQ":{"text":"Why did it take me SO long to get to The Joint?\n\nMe and a friend came here for lunch after","useful":8,"cool":5},"hgjYr3WrbYqg-loCTlxiiw":{"text":"That's the joint, that's the jam. Turn that shit up, play it again.  \n\nThat's what keeps r","useful":1,"cool":0},"8nNuejciU-wup7WUvIV5mA":{"text":"3.5 stars.  For all the hullabaloo this place was a bit disappointing but perhaps my hopes","useful":0,"cool":0},"A_-l6ooD8PDCUwWKrrAiAA":{"text":"My best friend and went on a road trip last may Bos to NOLA and we were really excited abo","useful":0,"cool":0},"p_r0GLXUnWOt8FZ5fWubLw":{"text":"OK, I love the brisket, sausage, and Barbeque sauce..best smoked meat in town.  nice atmos","useful":1,"cool":1},"EIm66XX6E1byS7SMm28Pbw":{"text":"Best bar-b-que place in NOLA! Nice and attentive staff and food that will have you licking","useful":0,"cool":0},"UcGvfuiOR2K4LOxuvMSTdg":{"text":"Super solid BBQ. I'm a sucker for the pulled pork and baked beans. If I get another meat i","useful":0,"cool":0},"FYcAkr5N_tFG8kcduSrE0A":{"text":"Wow. All I can say is wow. The food has gotten better at every restaurant since we got her","useful":0,"cool":0},"L0gL8RtT20EmzhEoZJbYTw":{"text":"A million stars. Everything is great, all of the time. Usually very solid but limited taps","useful":0,"cool":0},"uTXSYnCNjKc_3eQWx2Q4Sw":{"text":"Ok so this place is a must!!! My partner was craving BBQ ribs so we asked a few NOLA local","useful":0,"cool":0},"9foHiTzqSDAz7JF9MqS2Cw":{"text":"Louisiana knows how to BBQ!! Throws Texas right out of the water. I'd at one point driven ","useful":5,"cool":3},"XJEDIVC6NcaggQQLKukM0A":{"text":"Smokey, falling off the bone, melt in your mouth ribs. Possibly the best I have ever eaten","useful":0,"cool":0},"yhgSYkEm1oBZ1x-vwIltEA":{"text":"Best all-around BBQ and side dishes and service\nThank you for being there and cooking your","useful":1,"cool":1},"biEz8iOvqyj6yX0fkSgB7g":{"text":"Um yes. Everything. About this place, yes. In a secluded part of the bywater, on the corne","useful":1,"cool":1},"h-cRR3IybBvS7nuqug6uug":{"text":"The best pulled pork sandwich I have ever had! My bf had the ribs and they were outstandin","useful":0,"cool":0},"9yfDnsRJ7otz62OIAurUpg":{"text":"I loved the baked beans best in the south, the ribs were good and there service was good a","useful":0,"cool":0},"eQT-yvLXLeoqzz1IvzP0Iw":{"text":"I was told this place has the best bbq in town and let me tell you they weren't lying. Gre","useful":0,"cool":0},"nuuYVg2a0KJnY4TxiE8icA":{"text":"Review from July 2015. \n\nOff the beaten track, local backyard feel. Think Freddy's BBQ Joi","useful":0,"cool":0},"PfX9phrUbhmmqyky5BG14g":{"text":"The ribs here were cooked really well. I ordered 4 and then more afterward. The server was","useful":0,"cool":0},"dgvdW_roG8-ef-M_dTXhDw":{"text":"I love this place! Don't go at noon as it's mobbed with people from the military but after","useful":1,"cool":2},"Mmh6BgRyjHXMs-1IaTvb8A":{"text":"My stomach was on strike too many consecutive days of Cajun seafood. I suddenly got a crav","useful":0,"cool":0},"OBLWpI84oLT_5eYzaKZXFg":{"text":"WHOOOOO-EEEEEEE!!! If you like meat, and BBQ in particular, this is your spot. A tiny plac","useful":0,"cool":1},"mwq-mKtcLSfVON8aVcrglQ":{"text":"I love bbq.\n\nI'm from Alabama -- and I gotta say I've had better barbecue at dozens of pla","useful":0,"cool":0},"iGq0kMZWgH2bnfVG_cgjPw":{"text":"Great place to grab a fulfilling bite. The meat just falls off the bone. Mmmm","useful":0,"cool":0},"-ZEFy-tTEhhAuLEy-BKnNw":{"text":"buy it by the plate or by the pound.   \nyou can smell the bbq all over the neighborhood. \n","useful":0,"cool":0},"BCNrtdO_sRdqL_fQEx38gg":{"text":"Really cool place with really good BBQ.  I think I might actually like the sides here bett","useful":2,"cool":2},"qdJEm4X1Q1aJWEqiCM1QSg":{"text":"Hands down the best ribs I've had in a restaurant, period.  Great taste, and falling off t","useful":1,"cool":0},"kH7zzuIQuQnrfoGSM-hE9Q":{"text":"Seriously probably the best BBQ I've had in my entire life, and I've had a decent amount o","useful":0,"cool":0},"AS0RJCCX0e_SPWQYfq58xQ":{"text":"These folks really know how to cook. Been here 20 plus times in the last three winters and","useful":0,"cool":0},"jdgJVoyRZFyh0-MnKnuTPQ":{"text":"My husband and I both agree this place is a dud. The food was cold and tough. We didn't ev","useful":0,"cool":0},"-w6uPP47G2pjA_j0nZdKrw":{"text":"Great little barbecue place. I was looking for some in New Orleans. Not the best I would s","useful":0,"cool":0},"e3HmRAD2R3ye3KTqXiRtsw":{"text":"The Joint is da shit!  Best BBQ in Nola....the ribs, pulled pork, beans & potato salad are","useful":1,"cool":1},"Tcxz5_W8b0XUkS-XcKYqag":{"text":"Visiting a friend, first night in town, I came here and absolutely loved it! The ribs were","useful":0,"cool":0},"C-N0IvvFASu4Xpl2dzpqeQ":{"text":"Definitely a great place to go to! Food was good and the prices were very fair. \n\nI ordere","useful":0,"cool":0},"w5AIbLByitpSPfBT5HWYRA":{"text":"The Joint is a New Orleans institution. Known throughout the city as the best BBQ in NOLA.","useful":0,"cool":0},"i3IVfYv9AwiTkRF3zobo_g":{"text":"Had I written the review after the first time we went, it would have been 5 stars...excell","useful":0,"cool":0},"c9IZ7fY8OiXkDyz7aNlTOA":{"text":"Whooooooa nelly! This place is FANTASTIC. I'm not a fan of BBQ, never understood what all ","useful":1,"cool":1},"9ZEUrjY65_xJlhZZ1bMSEA":{"text":"My boyfriend and I tried this place on a friend's recommendation when we were visiting NOL","useful":0,"cool":0},"YRUcxjC97NTWg70-D9_NdQ":{"text":"The BBQ beef, baked beans and pork makes me sad I had to leave New Orleans. It was delicio","useful":0,"cool":0},"YfA6kyxix4-F_slsHp07lg":{"text":"The place smells and looks fantastic...exactly the way you'd expect a low-down BBQ joint t","useful":0,"cool":0},"UdeUo-OtFYnqxvycCSwsPg":{"text":"I eat here once or twice a week now.  New location, same awesome barbecue.  They didn't ev","useful":4,"cool":1},"4bBjLOYciffnLxBico2V8g":{"text":"The food was great, Rib plate, Pulled pork Dinner salad,Pulled Pork Sandwich w Mac n Chese","useful":0,"cool":0},"W0-90FyWh0PNVheR6V-FiA":{"text":"My husband and I shared the 3 meat combo plate, which included beef brisket, sausage and p","useful":0,"cool":0},"03OEafYCYpGEvTwBCvVHnw":{"text":"This place is a little hole i n the wall, but has lots of character. The food was awesome,","useful":0,"cool":0},"STOQz1xOP6IG4zTMX0hPXg":{"text":"Delicious!! Everything we ordered was very good!\nBurnt ends, chicken and pulled pork!! We ","useful":0,"cool":0},"mngQCw4b-ZJMK-fLKAmkow":{"text":"Great customer service great food beautiful place in the inside. the neighborhood is not a","useful":0,"cool":0},"b1_UTMdj0G_HYm6ignoixg":{"text":"This is THE place to go if you have to pick one restaurant on your trip to NOLA. best BBQ ","useful":1,"cool":0},"fsiMOxEx7LVkD2aglfBnPQ":{"text":"Best I have ever had. Also, after 41 years, someone bumped my mom's potato salad to #2 as ","useful":0,"cool":0},"cMk2MRDIgioipgq0TaTI3Q":{"text":"The beef brisket and pulled pork is great. It has just the right amount of smoke flavor.","useful":0,"cool":0},"iEeXg1XdfCBvM5TzF7DsHA":{"text":"That's some good BBQ. \n\nWe got in right behind a white van full of frat bras, so we had to","useful":0,"cool":0},"oiHLBh1zQ3hKT8K9gqmY_Q":{"text":"The guys I work with love the brisket and ribs and can't say enough about the baked beans ","useful":0,"cool":0},"p2AV7rspKxQ49fCedTQ61g":{"text":"So, I have been a lot of places in America in search of ribs. Memphis, Alabama, South Caro","useful":2,"cool":3},"ajy26UDva_5OP8kwvwM6Wg":{"text":"I've been stuck on the JOINT for years!! I've tried Central City, McClures, Squeal...they ","useful":1,"cool":0},"oxa5KYxQ_3XiQ7pQ4e1Ddw":{"text":"This place isn't that good. Meat had no flavor. Flys were buzzing around the restaurant.","useful":0,"cool":0},"tGEjCT-N9nntMsE5VWwlPA":{"text":"4 and 1/2 stars.  This place rocks. The casual vibe and friendly service makes you feel ri","useful":0,"cool":0},"beJAJeZosM_wniAJtfFxYw":{"text":"The Joint has to be some of the best BBQ in New Orleans. The pulled pork and brisket were ","useful":0,"cool":0},"FpTXnxioy11QQSdHvoTs2A":{"text":"I am a self-confessed BBQ snob.  We usually don't eat BBQ out for that reason.  Every once","useful":0,"cool":0},"trN7oCuD4g9tGQMgPhqNpg":{"text":"Phenomenal BBQ spot a bit off the beaten path in the Bywater neighborhood. If you're lucky","useful":0,"cool":0},"jBCbcdXgLsLJrRguOKmdYA":{"text":"My 5 stars are based on BBQ for the New Orleans Metro area. The Joint is hands down the be","useful":2,"cool":0},"7rH6VAQUwBt7GB7Na4SQDA":{"text":"Need to get in and out? This is just the spot. We parked, ordered, and ate in 30 minutes! ","useful":0,"cool":0},"LL0-B29b7tReYBUmfcNexw":{"text":"I have been eating at The Joint since before they moved. I have always been a big fan, but","useful":3,"cool":1},"eXOnxE0Rgn7hD9SA-m7SaA":{"text":"This is not an impartial review. Eating the ribs at The Joint was what, I am pretty sure, ","useful":2,"cool":1},"3YziwNgyAcYC93v3qXVM0A":{"text":"Very disappointed. No flavor. Sides sucked. Food cold or like warm. Check off NEVER RETURN","useful":0,"cool":0},"INgTDoAJUHQTrYtTbLOHUw":{"text":"It's not Texas BBQ, but its close.  For those of you familiar with bbq from TX, its along ","useful":0,"cool":0},"Evf6xFQr905b14N-1V5Ivw":{"text":"Maybe the best ribs ever and the baked beans are without a doubt the best.  This may be th","useful":0,"cool":0},"lVmkdvHMAVRHgncNPSaAjw":{"text":"This place not only makes some tasty BBQ, but their different homemade sauces are all outs","useful":0,"cool":1},"DfOYfbrE0gswXpHvwIM3gA":{"text":"Excellent BBQ. I had the pulled pork sandwich and the brisket chili, and I couldn't have b","useful":0,"cool":0},"2MwshN7D4pevMGlzkVHF6A":{"text":"BBQ does not get any better than this. If your in the quarter take a little stroll into th","useful":0,"cool":0},"Xhb7Jgdv1dytjpcXjYd6eQ":{"text":"On yet another trek to the Bywater from the LGD I had the wonderful experience of melt in ","useful":1,"cool":0},"eU7MrBVz3ey2s89rL0oaYw":{"text":"Quaint authentic BBQ joint feel. Nice staff, quick service.Walked to the restaurant from m","useful":0,"cool":0},"9fgkCTkPzFnNkt2T7yGO0Q":{"text":"Was feeling kind of hungry near lunchtime so I went over to The Joint. It was a trek out t","useful":1,"cool":1},"83CuqFj_53gHhPt2A-Nv1Q":{"text":"This place is delicious.  Brisket so tender you can cut it with a fork.  Pulled pork delic","useful":0,"cool":0},"OXs4xoVkO0KFA7_eW3Cihw":{"text":"Best baked beans ever! You could taste the peppers in the beans. \n\nProbably better than ce","useful":0,"cool":0},"_ZRWFJp2ZctY0wtyHRHp6w":{"text":"This is some of the best BBQ that I have had.  The brisket was moist and tender and the ri","useful":0,"cool":0},"28yBMgAeJ7vEzIY1sp3tvQ":{"text":"Visited at location in 9th Ward. Have the best super moist, melt-in-your-mouth brisket. Ev","useful":0,"cool":0},"vZsYPojjEx2M8uvvAK0GcA":{"text":"Here...pull up to the bar...order some smoked protein, apply favorite sauce (slabanero pin","useful":0,"cool":0},"kVVq4QQiTTR7toq0q-t28A":{"text":"Well there is only one reason to come to New Orleans...the food.  Mostly seafood. But if f","useful":0,"cool":0},"yil8UvAksnclUoQUVM2yRA":{"text":"Cool little BBQ joint.  Ended up getting 3 meats to try as much as I could and a few sides","useful":0,"cool":0},"CO3TM0ERh9v9LQMrN79xaQ":{"text":"Ok, its time this place stops getting raves and attention from food network and the variou","useful":0,"cool":0},"5OsoxUVEzZklSvwQtBUyvQ":{"text":"(5/11/13) Awesome! Awesome! Awesome!  I think that just about sums it up for me.\nThe group","useful":5,"cool":3},"32W5r8uWG1fDZzSzJJM77w":{"text":"I catered in The Joint for my husband's birthday. These ribs are TO DIE FOR. Ah-mazing! Ev","useful":1,"cool":0},"QZ9l4CLDcPH-RObMiTYMxw":{"text":"Had high expectations for this place after seeing it on food network.  I dont eat pork so ","useful":0,"cool":0},"lmPpC3djFXdsgKHsjXUlhA":{"text":"I'm reviewing this place as a vegetarian. .. And I still gave it 4 stars,  because serious","useful":0,"cool":0},"0DXcY2B34r-Zr_sJTnC1gA":{"text":"Delicious! We had the pork ribs (meat fell off the bone), sausage (spicy), pulled pork (mo","useful":0,"cool":0},"HNK0WrsE21dQnqzRsI728g":{"text":"What an amazing and funky place! Can't believe I've never been here before. My son Kyle an","useful":0,"cool":0},"AI4boR08s3tXc8k4z7ckHw":{"text":"i am prefacing this review by stating that i'm a native north carolinian whose family owns","useful":0,"cool":0},"BuFvkt8AWK7nEFiQvZ2xUw":{"text":"When I moved from Birmingham to New Orleans, one thing I missed was delicious barbecue. Th","useful":0,"cool":0},"PjIowdgm0Y8gJqK6PI4C5w":{"text":"Maybe the best brisket I've ever had and I love BBQ! The Mac n Cheese was awesome too. Ser","useful":0,"cool":0},"ta1sXu28GmO2u07H2a0gHA":{"text":"You know what? I really friggin' enjoyed this place. I love bbq, and I eat it a lot, espec","useful":1,"cool":0},"sX20AD1mphWeR2OxhlJv4g":{"text":"This place must have an issue with theft.  I ordered a beer from the bar while I sat and w","useful":0,"cool":0},"_uuO-xQE_mkD8RLtGy02hA":{"text":"Amazing food should be served hotter though.  Food came out room temp. Mac and cheese fail","useful":0,"cool":0},"F7B9aIfeHRi4rBrInoBeSA":{"text":"Good BBQ, funky atmosphere, and nice service all for a good price.  They have ribs, some m","useful":3,"cool":2},"U9DnRDflo70vW7IQRztnww":{"text":"Wow. We came into town for work, asked around about barbecue, and this is where we were to","useful":1,"cool":1},"INZ4UBFW9Bj7UCRlFo3xkw":{"text":"I had no idea New Orleans had a hipster area, until this last visit, and it was an eye ope","useful":0,"cool":0},"Yj_uN8xt8LXlln1xfxvytQ":{"text":"Ribs ribs ribs.......and I don't even like ribs particularly. But these are INCREDIBLE. No","useful":0,"cool":0},"wy3N6hKaUU-L-_TZAr_4bQ":{"text":"Went here after several recommendations from friends. As we were finishing our beers, we d","useful":1,"cool":0},"__z9cCTGpW2my7CDq5tsuw":{"text":"The brisket plate- brisket pretty good. Son rated a 6 out of ten. The bread was crusty and","useful":0,"cool":0},"ID_z9ezNKC87XOS2aHGJxw":{"text":"Very very good barbecue.  I wasn't even expecting to eat barbecue in New Orleans originall","useful":0,"cool":1},"e2Yr4Hq0rjAgrzmtplGZ3Q":{"text":"First of all this place has moved from its old location to a new one.. In the move they mu","useful":1,"cool":0},"UorzF1ho08LKKcOIugsbyQ":{"text":"This place has the best ribs ever!, Good vibe and the Links are delicious. Definitely reco","useful":0,"cool":0},"dSSfgknnK94kCKDpKidVxA":{"text":"Found this place on Yelp and had to try it.  I was in Nashville a coupole of weeks ago and","useful":2,"cool":1},"dQuiOXZ3frsbri8_RHJJLQ":{"text":"This little local hole in the wall has amazing food, amazing service and a friendly atmosp","useful":0,"cool":0},"iky1cHK2R2TC2l2F5ITqXg":{"text":"There yesterday, 1/30 with friend and got served a very dry brisket sandwich. When I menti","useful":0,"cool":0},"FoHX86-QOfeTUaMkEWK-eQ":{"text":"4/5 y'all know it's already good. \n\nthis is another review among the congregation who are ","useful":13,"cool":7},"lENQGqUnVxBI1ianr34ewg":{"text":"We walked 50 minutes and paid $15 cab fair to have the 3-meat combo with coleslaw. The por","useful":0,"cool":0},"s6f0AvaRuHUpA67zGNeQNg":{"text":"I'm not sure I agree with all these ppl that say this is so great.  Just because it was fe","useful":2,"cool":0},"X_SzpOMjGNEa0aHtj2TOyA":{"text":"Definitely the best BBQ place I've been to and I consider myself a type of BBQ conoscere. ","useful":0,"cool":0},"7QkwFx9Hz63A_gOsoAzwTQ":{"text":"A missive to The Joint: Where have you been all of my life? When I go back to visit the fa","useful":1,"cool":0},"25wKWmP_LJeW02GzjJzorg":{"text":"Clearly this place doesn't need another repetitive positive review but listen, I'm normall","useful":1,"cool":1},"BQx2huSealSL_2kI6FK0Aw":{"text":"I work extremely close to here, and whenever I go I get the same thing: the two-meat combo","useful":0,"cool":0},"vYLuF7HaVhkX_EID8vVFUA":{"text":"We had been in the mood for great BBQ for the longest time. Being that it was our first ti","useful":0,"cool":0},"Wq1gm5sVS_M0mDNVsCOvTg":{"text":"Please listen closely...you need more sauce options! Regardless of meat flavor not everyon","useful":0,"cool":0},"t5tpHDiTaTawEwFbU4hRAg":{"text":"Amazing food and so fairly priced. I came with three other friends and we were able to get","useful":0,"cool":0},"4_mZOc4xAEKuoSerClJR0g":{"text":"The brisket was so good. The ribs and sausage were pretty good but nothing compared to the","useful":0,"cool":0},"zh7zi9H6oe9dOhd0hUpzgQ":{"text":"I've eaten lots of barbecue and I gotta admit I underestimated this place but the food was","useful":0,"cool":0},"N5YFylt4NOomUfsge3F-8w":{"text":"I've finally made it to the Joint this week, and yes, it it real BBQ. I'm lucky to have th","useful":0,"cool":0},"6s8ep523pczvOVGN89ZAYw":{"text":"Got pulled pork sandwich. Had to add slaw and a ton of sauce, then it was tasty! The three","useful":0,"cool":0},"l88dkE_m1IO8scuEnhddNQ":{"text":"If you like BBQ, this is the place to go. My wife and I have gone several times and the fo","useful":0,"cool":0},"Yj_lIQSIfGYsbFivf_ONdw":{"text":"The Joint serves up some excellent BBQ.  I came last Saturday, the first day they were ope","useful":0,"cool":1},"EspdWxfzheMEkC0FyEEA8w":{"text":"This was some of the best BBQ I've even had. The meat was smoky, moist and flavorable. The","useful":0,"cool":0},"MQZpU7MpKpG94aGd36341w":{"text":"Had a two meat combo the pulled pork and the smoked sausage were an experience and very go","useful":0,"cool":0},"otnnji-WWDiAw-pCY314Jg":{"text":"The most amazingly delicious BBQ I've ever had and portions are out of control! Can't reco","useful":0,"cool":0},"u3pSPR36iteC0OY4BxjbGw":{"text":"My wife and I just finished a 10 day driving tour of the south NC TN MS AL LA GA SC.  We a","useful":1,"cool":0},"27fWOSiszDkmdYvp06t3Tw":{"text":"Came here on vacation. Food was excellent and priced fairly.  Staff was helpful for a firs","useful":0,"cool":0},"u2TSCtcIngz_yoQcnlmnww":{"text":"Came here for lunch on a recent Monday afternoon; sat at the bar, where Erica did a great ","useful":1,"cool":1},"B4ZBTkBvt4E3ceJEK72Xqw":{"text":"Had the brisket, ribs and pulled pork with the potato salad and mac and cheese. Everything","useful":0,"cool":0},"E1_JUR7SX2WvzIybAwL1oQ":{"text":"I went here when it was closing. I got sort of cold food. But that wasn't the problem. I t","useful":0,"cool":0},"aKaYZMMcX7vadhUjSkL4KQ":{"text":"The Joint serves up some damn fine BBQ. I'm sure you got that point from the numerous glow","useful":6,"cool":4},"LIuX-UbjECzT6ANU5iBnog":{"text":"So many people I know speak well about this place, but I've been twice now and have left t","useful":0,"cool":0},"vg7TAmOhn6aQPf-Bl8rcBw":{"text":"Came here twice during my 5-day stay! Shared the 3 meat combo both times to try everything","useful":0,"cool":0},"_PC_Oj0e-SsWWAFKSy3VUg":{"text":"Oh my GOODNESS........ This BBQ is the BEST in New Orleans and arguably the BEST in the So","useful":0,"cool":0},"2ud63SMcuwa6Nt6jybQrXw":{"text":"Best BBQ in New Orleans, hands down. Also probably in the top 15 for the country. Some of ","useful":0,"cool":0},"tEofHGLwQL5Soq_iZ8KiTg":{"text":"This place is unique and has great food.  I really enjoyed my beef brisket sandwich.  The ","useful":1,"cool":0},"NbiS7hmLr_9-DILnxUywlQ":{"text":"Food is amazing portions are out of control, taste buds were in heaven. Meat came off of t","useful":0,"cool":0},"y5YI2lsOSYB69UxnTJFkUg":{"text":"Amazing bbq!! Definitely warrants 5 stars!Can someone bring me back to the moment where I ","useful":0,"cool":0},"tTYoeRdgFIcd1bZhzbeUpQ":{"text":"Ya see, kids?  This is what happens when, instead of spending the majority of your capital","useful":1,"cool":2},"wwY2u1EO1Pz4k8EJ3cifWA":{"text":"I don't recommend coming in the heat of the summer (no A/C) but the BBQ here is amazing.  ","useful":1,"cool":2},"S7hDb13BOhk85u8l4P_gGQ":{"text":"This is the best BBQ that I have ever had! This is my second time eating here and a year l","useful":0,"cool":0},"T8ZvVYC4hRETVRiMt3u8xw":{"text":"Firstly, there was flies on the barbecue sauce outside and the paper towels. The towels we","useful":0,"cool":0},"w8akTT4znMd_vPKdrx5_pw":{"text":"Amazing barbecue spot! Place is cozy with additional outdoor seating on the side. Has a sm","useful":0,"cool":0},"4l1k_KAMpk-zK8W9V1Whuw":{"text":"I love the Joint!\n\nA friend recommended 'The Joint' to us and we are so glad he did.\n\nDeli","useful":0,"cool":1},"lLGrNw3fH7K_eu6b6me4sw":{"text":"Best BBQ in New Orleans.  I had the two meat combo consisting of brisket and sausage with ","useful":0,"cool":0},"uxtSknCrnfhp5_f59hDPIA":{"text":"HALLELUYUR! Good BBQ in New Orleans! I'm a BBQ feign and I have to say this definitely sat","useful":1,"cool":1},"7miFD8pI4sn39Wbeq_bFzQ":{"text":"We were staying in the Bywater area of New Orleans, and trying to get as many different me","useful":0,"cool":1},"rauc8WN5mJrd6GdaWtPREQ":{"text":"Hands down one of if not the best bbq places I've ever visited. Big portions, fair price, ","useful":0,"cool":0},"N9kpNbm4pan5ojLfHvmGpg":{"text":"This place is great.  You pretty much need to be looking for it to find it, it is well off","useful":1,"cool":0},"-Jx0FgHvo_yBE2RnbtpnzQ":{"text":"My favorite BBQ in the city! I get the pulled pork sandwich with the Mac and cheese. The s","useful":0,"cool":0},"tY6zCbfUxfJnFmJe-ZtJTA":{"text":"I recommend the ribs and chicken.  The ambiance was casual and the sauces weren't anything","useful":0,"cool":0},"mi_9vCYeUvtjIP2oqdanuw":{"text":"We got there about 15 min before opening and there was parking and small line outside. \nYo","useful":1,"cool":0},"sPFUFXFBp3RHfcy59tB_Ww":{"text":"They make the  ABSOLUTELY best brisket! It is so moist, it almost melts in your mouth. And","useful":0,"cool":0},"4xr4sYQG1hS-vy4Rln32sw":{"text":"Definitely an okay place, but not the holy grail that others make it out to be. Service wa","useful":0,"cool":0},"XdmoyOd40liw4Sl9KGIvVw":{"text":"I live in DC but I'm down in the 504 quite a bit, and I can honestly say that this place i","useful":0,"cool":0},"hk0FCqnMAwt4EHZm3gTI7Q":{"text":"Based on the reviews, I decided to give it a try. I got there when it opened at 11:30 am. ","useful":1,"cool":0},"HerzNBll-Wb5kx4EJaYHBg":{"text":"Have to say that I was not impressed. Maybe I came in on a bad day maybe I was hungover, I","useful":2,"cool":0},"EM16a7t9FaDl2DR3vZDthg":{"text":"We came for a late Friday lunch, the food was really good, ordered the sausage sandwich wi","useful":0,"cool":0},"s0IQr518ynf5r9nTqT_UPA":{"text":"good ribs.. plenty of meat on them ...\n\ncouldn't eat the whole rack .......\nchicken was pr","useful":0,"cool":0},"_ou7VaHVcV8HfYT7XNTpfA":{"text":"Service was friendly but getting the food was fairly slow.   Thought the cat roaming aroun","useful":0,"cool":0},"JlYr1lQOFIArX-HY6O7DgQ":{"text":"Ate here twice in a week while on vacation in New Orleans. The brisket was my favorite, bu","useful":1,"cool":1},"LbnCEZ5g_n9181jD2JwT7Q":{"text":"One of my favorite spots I ate during my trip to New Orleans. Ribs and brisket both juicy ","useful":0,"cool":0},"mz3KXUYJIwjGMybZIFMcAg":{"text":"I wanted to try just about everything on this menu. And that which I did was really fantas","useful":1,"cool":1},"JNJm4TFPNmXvqQRhFeM1wQ":{"text":"Best BBQ in New Orleans in my book.  Tender with great sauce that you can add yourself.  V","useful":0,"cool":0},"FD2mNyy-JJQiMFvZrdVA1w":{"text":"Had a half rack of ribs with bread and MAC and cheese for $11.50. Also had a link and swee","useful":1,"cool":1},"MwiggAY8nDX4ruRR6k6qjQ":{"text":"Really great spot for neighborhood BBQ! Dry rub is amazing on ribs and the brisket falls a","useful":0,"cool":0},"3pe892XpveBjuTy24FoQxQ":{"text":"This was some if the best brisket I have ever had. It was very juicy and tender. The macar","useful":0,"cool":0},"d_k0_Fhk0JfmWjOJMBjdQA":{"text":"Amazing BBQ! I ordered Ribs, Baked Mac & Cheese, and Potato Salad. It was delicious. The r","useful":0,"cool":0},"Qed3B7DV_6A89OIYzXHyLA":{"text":"Amazing bbq !! Loved this! Love finding good little local joints and this is definitely on","useful":0,"cool":0},"XMT6JI1fZBWaOS6kAwtVzg":{"text":"1st time in NOLA. We got to eat at an infamous pub/dive bar/restaurant called \"The Joint\" ","useful":0,"cool":0},"aVcLXG2KSKwOhabngnkDPg":{"text":"New Orleans' take on bbq is pretty interesting, although I think The Joint does it particu","useful":1,"cool":0},"EtyaRBzpe5FNwLIrU0tH7Q":{"text":"Def great BBQ! It's such a cute place but its actually far from French qtrs. We had to cab","useful":0,"cool":0},"RXQedq1qJRkmaudaoFJgEA":{"text":"From the rub to the pulled pork I had to try them all. Being from NC I know a thing or two","useful":1,"cool":0},"eR1xBIVBtSLObiRLrhNpvw":{"text":"Everyone I know raves about this place, but being a vegetarian I was never interested. A f","useful":2,"cool":0},"Za8vuDBqdKgW1yoPOYzdgQ":{"text":"For someone who is not really a meat lover this place came as a pleasent surprise. The pla","useful":0,"cool":0},"NKcnx07XF-zfaqeDioROBA":{"text":"Delicious meats! I had the pulled pork sandwich and macaroni and cheese. When we got our f","useful":1,"cool":0},"xREbnjggafIE6eUbbodHQQ":{"text":"Great BBQ. Ribs and brisket sandwich were fantastic. We'll be back for sure. Especially fo","useful":0,"cool":0},"lg3q4DkMxpgXm7sbIuUW5Q":{"text":"Really effing good BBQ. Service is wierd and kinda confusing, and the place is always redi","useful":1,"cool":0},"OMLV9dud9KVcTmArM8vl2A":{"text":"Great neighborhood spot. Try the ribs, pulled pork, brisket, baked beans, mac & cheese, pe","useful":1,"cool":0},"hDe6oYLJaaZzVqBcEijmlQ":{"text":"This is what BBQ should taste like!\n\nAfter eating one bite of anything from The Joint, you","useful":5,"cool":3},"e-HhDY545au7fGBPGQSmWA":{"text":"Great brisket. Ok sauce. Nasty but New Orleans type atmosphere. Good price 20 bucks for th","useful":1,"cool":0},"4KcXDNZYnnqfj1dVtg35YA":{"text":"Great BBQ place that has a sauce to die for. A little more on the expensive side but worth","useful":0,"cool":0},"GzuS6pmI-iVVAP4sG4q_rw":{"text":"Oh man. This place is amazing! My husband and I walked by here one night and he said, \"oh ","useful":0,"cool":0},"15d3OtXu4D5UizHPdxpSBg":{"text":"Great beef brisket, who thinks of awesome bbq in NOLA. The joint is one of the best spots ","useful":0,"cool":0},"J5cssMnx9pU9IXP0zca7MQ":{"text":"Love The Joint! A must when you're in New Orleans. Fantastic food, great atmosphere. Great","useful":1,"cool":1},"7TyB3xOQpKmapqXmON1kkg":{"text":"pretty good. as recommended by the uber driver and my airbnb host and a local friend.\n\nnon","useful":1,"cool":1},"Jm_9PFtdJk7mxgoeddsBZg":{"text":"Hole in the wall, neighborhood barbecue joint.... A long ride from downtown, with good foo","useful":0,"cool":0},"XtTboxx3e-9q19CFJzZeuA":{"text":"The ribs are amazing... however... the sides are not so great. Don't order the Mac n chees","useful":1,"cool":0},"uYocMQSy_iVKrBMWHQJeNg":{"text":"They are ADAMANT about you ordering before you sit... and order taker will be rude to you ","useful":0,"cool":0},"E7MRN5BxTNORf7z7lm0YAA":{"text":"This is my favorite restaurant in New Orleans. \n\nThe barbeque is wait-worthy (which you of","useful":3,"cool":1},"uuuJLDDMGURsId94tLLw4A":{"text":"Best BBQ in the city that I've tried.  New Orleans isn't exactly known for its barbeque, b","useful":0,"cool":0},"dehSdN0eXB9ETuGz_NvQVQ":{"text":"Consistency is the key. DON'T GO FOR LUNCH.\nThe first time we went for diner and it was gr","useful":0,"cool":0},"b52WXyerJGzYGXTc5fD4fA":{"text":"Had the brisket, ribs, smoked sausage combo plate with the mac and cheese and baked beans.","useful":0,"cool":0},"ErmWEFJ-agumag11FOxNjw":{"text":"Their brisket is so good that it makes me want to cry. I can't get enough of The Joint. Th","useful":0,"cool":0},"mrsJLHvrPPy-_VzZtdCz5w":{"text":"Pretty decent BBQ spot in NOLA. Got their combo platter with some chicken and ribs. I thou","useful":1,"cool":1},"JZcOurEO4ZCICNXRK2GLHw":{"text":"Even though I had just spent the final morning of summer trouncing around the sewage treat","useful":1,"cool":0},"BSwjTrCayZxq5kzAH9ObvA":{"text":"Wow. We never would've found this place if a local hadn't turned us into it. It's great! T","useful":0,"cool":0},"Gs53OMDPxkx2Ww7WE8GeJQ":{"text":"My friend Troy said this is the best brisket you will ever eat.  I've eaten brisket deep i","useful":2,"cool":1},"GkJyzrM9D2XZK5WoRPnsMg":{"text":"This is a JOINT but what do you want from a Barbecue place. You order at the counter, you ","useful":1,"cool":0},"-rE0LXP3phXTZI9qwotycA":{"text":"I first heard about this wonderful culinary jem on Diners,Drive ins,and Dives years ago, a","useful":1,"cool":0},"IAA6shch9-Jnt9tjTm9Tsg":{"text":"The atmosphere is cool, but my brisket was pretty dry and crusty. I guess I'm spoiled by t","useful":0,"cool":0},"BDNDNZ65R3FE61_s8J0SPA":{"text":"Pretty darn good BBQ \n\nPulled pork is fantastic, ribs are pretty good.\n\nBrisket was dry, t","useful":0,"cool":0},"07HAUSgaD2FgFUw_V6bORQ":{"text":"I dont eat meat and I was impressed.  I ordered two small sides and a salad and was please","useful":0,"cool":0},"3XNcHHDagb1kWoLOatasSA":{"text":"Was there the other day, great vibe, awesome food, just a great experience. If your visiti","useful":0,"cool":0},"DtFbM_YysP-3v5ykAFbDXQ":{"text":"I smell their smoker every day.  I live across the street.  \n\nI love everything on the men","useful":0,"cool":0},"RFfGQ7QpECiPSHS0v4PRWg":{"text":"I am not a bbq kind if girl but my boyfriend is.  And on our 2nd trip to NOLA, I consented","useful":0,"cool":0},"NlG_pjmFO2kBCWTM3x45EQ":{"text":"Probably one of the best BBQ places I've ever been to. I think they use unicorn meat or so","useful":1,"cool":1},"JwGBnOeCRz6emM1Il9wxYw":{"text":"Definitely the best Bar B Que I've ever had.\n\nWas vacationing from California and made me ","useful":0,"cool":0},"jaY6vom8E56iOwLDwmwLIw":{"text":"I must first disclose that my favorite person in the whole world works here so maybe I am ","useful":3,"cool":0},"4K2InBx3D_3WGCJNWSfgHg":{"text":"I figured I'd give this place another shot.  Last time I went it was a long wait and food ","useful":0,"cool":0},"mMoupm_v3gR4E5sQa5LTNg":{"text":"The Joint was definitely a good BBQ place, but definitely not worth all of the hype that e","useful":0,"cool":0},"NCSKnmwwH_-3uEccKVH7ig":{"text":"Great food! The W special was great, defiantly try Coke slaw and Beans. Food was promptly ","useful":0,"cool":0},"KIQFdJcglE6Q6IJQbbqY-Q":{"text":"Best barbecue I've ever had. I had the burnt ends and they were better than the ones I had","useful":0,"cool":0},"ZUDGBxSemuG8XG2vJ_FC8Q":{"text":"Do you like BBQ? I love it!!! The Joint is the place for BBQ in New Orleans, This is the o","useful":6,"cool":3},"heAQMHfxKRxvdAAu2-gW7g":{"text":"So my inlaws told me I had to eat here, that it was that good.  All the meat was smoked an","useful":0,"cool":0},"s-h94QhNG6exsBgmkKyM7g":{"text":"Went for a long walk out of the French Quarter madness into the middle of nowhere it seeme","useful":0,"cool":0},"92p4ULbPuSOqM6xbB-WOvA":{"text":"Hands down best barbecue in the New Orleans area! Only negative was that it's a bit on the","useful":0,"cool":0},"qO6exgvNYslumB0cQRRPoA":{"text":"The BBQ itself wasn't bad but the following were terrible: (1) the location; (2) the envir","useful":5,"cool":1},"C3DMXClwoPCEayj8UbXvVQ":{"text":"Worth the drive! If you are in the By Water area you need to stop and eat.\n\nWalk up & sit ","useful":0,"cool":0},"kWV5Otla4h5TwPxJFdcP0w":{"text":"The BBQ at this place was fantastic! 4 stars because I have had better in TN...  The smoke","useful":0,"cool":0},"4R4SbfeVKPMYXd-nqlU1Uw":{"text":"Visiting from California, and we had to try it due to the reviews. Everything we ordered w","useful":0,"cool":0},"pzJKfDaIVIlUv2EkPD6Leg":{"text":"This is the BEST meal we had in NOLA. Great atmosphere, quick service and delicious food. ","useful":0,"cool":0},"VjgAKqCMyxpC-yOZ48yq8g":{"text":"I had a craving for Bbq & heard about The Joint & decided to try it out - OM GOSH!!!! SOOO","useful":0,"cool":0},"BaRz23QqdV3ywGCDXc2Evw":{"text":"This food was fantastic. Beef brisket was moist and smoked to absolute perfection. \nRibs w","useful":0,"cool":1},"GUak0RSVOx98NFrPT3pXPQ":{"text":"I love The Joint! They have expanded in the past couple of years but still maintain the ho","useful":0,"cool":0},"6yW65FDvHq-1QLon2AQC-A":{"text":"Wow.  This place is exactly what a barbeque place...excuse me, JOINT should be.  To sum it","useful":1,"cool":0},"F79LkRKfGoOCxgc15L-A1Q":{"text":"Can't say enough good things about this place. Went with 3 friends so we tried several thi","useful":1,"cool":1},"RhHgZUyHxXkpPnsf9wzMYQ":{"text":"The portions could be a bit bigger and the macaroni was bland. The BBQ is amazing. Be sure","useful":0,"cool":0},"rOdz8ilLe50M2AQJFnDohg":{"text":"Being from Georgia and living in Tennessee, I wasn't searching out to eat BBQ in New Orlea","useful":0,"cool":0},"8unTKCEA1Ps32LLlATqtOA":{"text":"Best BBQ the boyfriend (recently fiancee) and I have EVER had. Hands down, the best. We bi","useful":0,"cool":1},"64bzl3PtjsTor19vn1dZ5g":{"text":"Hands down the best beef brisket I've ever tasted this is pretty damn good don't be fooled","useful":0,"cool":0},"dQDbST-0RNESqqIziTgW2Q":{"text":"I can't recommend for special occasions as there isn't much seating, BUT the food and side","useful":0,"cool":0},"5LAt4fm2pOhCBbnA4MpXsw":{"text":"HEY YOU!  Yes, you.  Are you in New Orleans right now?  Then stop posting pictures to your","useful":3,"cool":2},"HoOsasiOPS33Q8yHhIeB8g":{"text":"Great food. Cool little place. Bartender, Libby, was wonderful. Will definitely stop here ","useful":0,"cool":0},"CCW7CNGPzqt_d1-qHmLdbw":{"text":"This place totally reminds me of the kind of barbecue places to which my parents would tak","useful":1,"cool":0},"7D3D2-3_7D0Y1RLxnnvCRg":{"text":"I stayed in Bywater during this trip to New Orleans so this restaurant was very convenient","useful":0,"cool":0},"dBr16-rj_-nPOX0nri4pJA":{"text":"I'd actually give it 3 and a half stars if I could.\nWe've eaten there before (last time wa","useful":0,"cool":0},"m6voXBcwtnCrJA_MzXfKEA":{"text":"I just tried to eat here but for some odd reason they didn't except my form of payment whi","useful":0,"cool":0},"py3jyqhlbAlPYOZxJkGnsg":{"text":"Love love LOVE this place...the pineapple hot sauce is unbelievably delicious...the food i","useful":0,"cool":0},"_1qD84WVKh-ig1KlMIj5wg":{"text":"Best ribs on the planet, yes the planet...! A as Native Texan displaced all over the globe","useful":0,"cool":0},"aYki9BW0XzPlthlK-_Ljpg":{"text":"Stumbled upon this place last night. Interesting little bar restaurant nice atmosphere, mo","useful":0,"cool":0},"C6NskALSUyk392xlPbfemw":{"text":"We ate here last week during our trip to New Orleans.  We ate at several high-profile rest","useful":0,"cool":0},"6UugZt42ETqF1ZtlHfa7Uw":{"text":"Can't go wrong with this amazing place, everything is great! Tuesday and Wednesday they do","useful":1,"cool":0},"81suQ7ff7RCqvgiyyhUwfg":{"text":"My significant other and I fight often over barbecue.  I'm a Texan so I'm a beef barbecue ","useful":0,"cool":0},"1gvuGabQXbgpke6zUSH4Sg":{"text":"I really wanted to like the Joint. \n\nMy visit to the Joint was the second time I had gone ","useful":2,"cool":2},"BSydeKRnmh_r1FDJISes6A":{"text":"updated after 3 more visits.....still same old stupid system!!\nthey moved, its bigger, the","useful":2,"cool":1},"6UraPzcm-JbvwxuTpdPoJg":{"text":"Now this is good bbq. The stuff that gets slow smoked all day long and not just tossed int","useful":0,"cool":0},"gmbLsN45rQrJi3i9YG8FXA":{"text":"Awesome bbq in Bywater. This is a lunch counter joint with brisket and ribs among other st","useful":0,"cool":0},"I-rppljtCGlItLFv28-s9Q":{"text":"I went to a place called \"THE JOINT\" to get some Barbecue Ribs and the Ribs were awesome-b","useful":4,"cool":4},"d5CAlTHHN8ADBVay1hY0Cw":{"text":"I ate here for the first time a few days ago and have to say their ribs lived up to the hy","useful":1,"cool":1},"S3oBySjQ4q_w7Hi_XA0zDQ":{"text":"Finally! By far the best BBQ in New Orleans. I went for the first time after hearing about","useful":0,"cool":0},"l2xCQWQME-U0cBN_VhjyHQ":{"text":"If you are looking for a great place to have BBQ that's outside of the French quarter, thi","useful":0,"cool":0},"MUEAoOa1u5TAxOvWQ6WAKg":{"text":"This place has some of the best BBQ I have ever tried. Their Brisket and sides are amazing","useful":0,"cool":0},"BkcmWOcZlLcWYR5crA2-XA":{"text":"Best bbq I've ever had! I got the brisket and ribs and both were awesome. The meat was soo","useful":0,"cool":0},"bX4QjvrzNddtKkT3WJg1vw":{"text":"We had found this place on Yelp prior to our trip to NOLA. We had our fill of gumbo, ettou","useful":0,"cool":0},"rL58JUisTZpZJYinB05SBg":{"text":"So we're here on vacation. My friend recommended this place and I have to say their Barbec","useful":0,"cool":0},"eAHggoPuzz0wjakdKSa-sw":{"text":"After a long hot walk through the French market with friends we stopped in for late lunch.","useful":0,"cool":0},"TWLWGaqol2-GA11nxIJhvQ":{"text":"Okay, I'm from Memphis, so my opinion counts double. I've had nothing but disappointment r","useful":0,"cool":1},"b5RT58jifDHw6qcy5IOfHw":{"text":"LOVE the pulled pork sandwich.  Great mac n cheese as well!  The only bbq place i will eat","useful":0,"cool":0},"Z9au-ugEFabgLaIx1vSxBA":{"text":"Absolutely the best BBQ in the entire city. Every bbq can do pulled pork....but brisket is","useful":0,"cool":0},"nOeOO9oF2GQZHM73ssDK0A":{"text":"Ordered brisket plate with Mac n cheese & baked beans. Meat portion was kinda small but ta","useful":1,"cool":0},"ksGtoF6gIRJVJsFOLvIXVA":{"text":"Love this place!  Food is awesome. He had ribs and I had the pulled pork sandwich.  The pl","useful":0,"cool":0},"Xv5sklDEgLo6y0N8XLH88g":{"text":"The perfect reward after a long walk in the Bywater. Love the quirky atmosphere and all se","useful":0,"cool":0},"4-lNhkcAb-hBZEYQN_k9TA":{"text":"This barbecue spot will not disappoint. The best ribs.  It is fast and m the patio in the ","useful":0,"cool":0},"EVAduy2KitJ_pbtMa5ll4A":{"text":"Absolute best bbq in the city! Definitely get your money's worth of food!! I got the 2 mea","useful":0,"cool":0},"3lVHyo-pcxT2t46uaUqESw":{"text":"Yum! I thought the ribs and pulled pork were better than the brisket and sausage. Beans we","useful":0,"cool":0},"CAGbjO0EEfFkWxkkIvN3UA":{"text":"I never order pastrami sandwiches.  Being a regular Joint customer I know anything they ma","useful":1,"cool":0},"0Dmsx3ljT_2hgqZXGCUlZg":{"text":"I come here at least once a week. That's how good it is. Amazing mouth watering bbq with a","useful":1,"cool":1},"DqTpd1PcW6FFJbsRONBfVQ":{"text":"I personally prefer my bbq sauce much thicker than at The Joint. I felt the brisket was dr","useful":1,"cool":0},"mRZsC1P_SaWqdLmh980e4A":{"text":"The ribs were outstanding. We got them multiple times on our weekend in this neighborhood.","useful":0,"cool":0},"OQLS07fS1bFxhSVr0-ZsVg":{"text":"Great place to eat. Had ribs, pulled pork and brisket with a side of potato salad.  Pork a","useful":0,"cool":0},"fQnGc6yTyTRjEGg_zj1I0Q":{"text":"Food was excellent. \nNeighborhood is a little iffy. \nWell worth the trip. \n\nVery sad to se","useful":1,"cool":0},"gpSZvdqAnl162tHv2eqMXw":{"text":"Deserves it reputation as the best BBQ in New Orleans. The \"W Special\" is perfect for the ","useful":2,"cool":2},"iyht1sOOztCLNiRKTTInRA":{"text":"Sitting here under the fan, outside, I just HAD to check-in and write a Yelp review. The h","useful":3,"cool":1},"xNBMY5M9oVBDogxSWjenMQ":{"text":"Prices are excellent, food is great. Adding sauce for me is a MUST - and theirs is incredi","useful":0,"cool":0},"QOOvQhCxxn4lkvI0PMlSEw":{"text":"Decor says New Orleans backyard bbq, but you feel like your at a uncles house for a shindi","useful":0,"cool":0},"4K2bBhNB7PEJcRInmAQYqA":{"text":"The only thing that could make this 'joint' better would be if they put bacon in their blo","useful":0,"cool":0},"SO8eAcdzUrWfyCKBqC3Kmw":{"text":"The ribs were okay. Not melt off the bone great, which is what I was hoping for. The beans","useful":0,"cool":0},"Ae6oG_sI6LdUMk0RIMO7nw":{"text":"Best damn Ribs I've had. And I've had a lot. Very friendly staff, and a good bar to boot. ","useful":0,"cool":0},"nPshEkblgAwgtXuriS_nZQ":{"text":"Great bbq and sides, nice bar, welcoming, cozy atmosphere.  A winner!","useful":0,"cool":0},"6RInWLjzdJA-w9Ud2YDXOw":{"text":"Saw this place on diner, drive-ins and dives. Came and had the ribs. Good rub seasoning. B","useful":0,"cool":0},"sOzCS8fBDbuPxzEGWBRBsQ":{"text":"Great bbq.  Lots of smoke flavor.  Burnt ends were not what we were expecting...no bone?  ","useful":0,"cool":0},"fTnkaANp4P8X3l5sJcK2tw":{"text":"This place was simply amazing! I am from Texas and my husband is from Tennessee, so I like","useful":0,"cool":0},"7JOzjvkYUjhMBCpKdEdk7w":{"text":"This place is really that good. They smoke the meat for about 5 hours and under 200 degree","useful":0,"cool":0},"I7UzYfHvooy5oobcZr3lcQ":{"text":"If you like barbecue you have to stop here. As seen on diners Driveins and Dives they have","useful":0,"cool":1},"7LCi-7h18FBkxtq1b7WysA":{"text":"Definitely the best in New Orleans, but as a Texan, I wouldn't rate this too highly.  I fe","useful":0,"cool":0},"s-tlvOkCPrlC9qlkFDR5aw":{"text":"YUM!\n\nSuper tasty food, in a super casual atmosphere, with my super awesome coworkers. \n\nT","useful":3,"cool":4},"AiBafikxK4_xZx5uiLYaeQ":{"text":"Delicious!  We were actually heading to Ms Hyster's another local BBQ place, but our cabbi","useful":0,"cool":0},"mUAtYR0JU1g7DD4ABV5qEA":{"text":"Located a well worthwhile walk into the Bywater is some of the best BBQ in the area at The","useful":3,"cool":1},"fIWJbEaGigOrUYz-gz40Ag":{"text":"GREAT food. Quick service. Super cheap. Definitely would recommend for a place to eat with","useful":0,"cool":0},"x--fMo228y7EXj_JVx4m-w":{"text":"Awesome little bbq Joint!!! Would never have found this place if not for my daughter in la","useful":3,"cool":2},"rp_p_zj8jXzUqS-EbYkoTw":{"text":"Wow nailed it. My husband won't stop talking about the pulled pork. I really enjoyed the r","useful":0,"cool":0},"0YzEtRIW5XaMXIoyDGLY2g":{"text":"Bbq Bloody Mary was a great start. The line was to the door when we got there...so that to","useful":0,"cool":0},"pACEHPJx-fh8UgqtKYfK3Q":{"text":"The Joint makes some of the best, if not the best, BBQ I have ever had in New Orleans. \n\nT","useful":5,"cool":3},"ETbyaE2JI44OYbWI3pMoyA":{"text":"I arrived at The Joint a few minutes before opening time, 11:30 on a weekday and there wer","useful":1,"cool":2},"jpU5z_8UQ5NqYhVZTwIdfQ":{"text":"I had to try this place out as it is close by, and won best bbq in New Orleans. The place ","useful":0,"cool":0},"peFd6rtwuKkbSZ94hstpIA":{"text":"Hands down, just great barbeque.  I especially like the pulled pork and brisket.  I could ","useful":0,"cool":0},"snBXSCJWefLvuj9D1cuvUQ":{"text":"Oh how I LOVE \"The Joint\"! Simply the best, real PIT BBQ in New Orleans. Nothing compares.","useful":0,"cool":0},"3FmyzWuPHAtpj59n-6_3Mw":{"text":"Absolutely incredible!  Everything was amazing!  Service was great!  Lauren the bartender ","useful":1,"cool":0},"JTuIIbtdCFW7VHDq_wGRXg":{"text":"The ribs are fall off the bone goodness. Totally amazing. Potato salad is pretty good but ","useful":0,"cool":1},"gw3SnjxxPzrAsFCo1aJSGA":{"text":"This is an awesome, whole in the wall, bonafide barbecue joint in the Bywater.  The food i","useful":0,"cool":0},"D3fiacD28v32oU2V1P8eug":{"text":"Probably the only place to get quality BBQ. I have to warn people, if it's a busy night, c","useful":0,"cool":0},"MCrgwTrAVSsNL8VbqvtWdg":{"text":"The food was delicious! The bbq sauce was missing something, not sure what, but the rub ma","useful":0,"cool":0},"cRaC8GURFKi_bDCRDlEU3Q":{"text":"Awesome BBQ and I don't say that about a lot of places since I hail from Memphis. Brisket ","useful":0,"cool":0},"3OSNbMPfo2f3jCI5-WB-sg":{"text":"Delicious! Friendly staff, great drinks, loved the Paloma and the loco something or anothe","useful":0,"cool":0},"goA0JX-sed3zho9Il3VSKg":{"text":"The BBQ was tasty but definitely lacked some moisture. I have only been once so I don't wa","useful":1,"cool":1},"k4d5J2BuuHujcfIn-GhhLA":{"text":"Best BBQ brisket I've ever eaten.  Also, the best mac & cheese I've ever eaten.  Solid bak","useful":0,"cool":0},"GqmYNV6kvoWvcuxc0Hd9zQ":{"text":"My only dislike of the place is that they have ruined brisket for me forever.  I've travel","useful":0,"cool":0},"pXgow5sqtruorl8NW55SIw":{"text":"I'm no expert, but I been to several bbq places that are rated pretty good on yelp, and th","useful":0,"cool":0},"dDHm2694kHMXDmqbOrlqvQ":{"text":"The ribs fell off the bone and were very tasty. They weren't the best I've had but they we","useful":0,"cool":0},"T49LkGRaT7QyrYC_8WWNmg":{"text":"Great local place for bbq! I recommend the ribs. The potato salad is delicious, but not wh","useful":0,"cool":0},"OauATjL9ejXjVqvYHrkNBg":{"text":"Ok, ok. I so get the hype now.\n\nI could shuck oysters, peel crawfish and devein shrimp by ","useful":15,"cool":11},"VDDsVvpci8rJqGESwRBejQ":{"text":"We ordered 1/2 a slab of bbq pork ribs, 1/4 bbq chicken, cole slaw and potato salad.  We l","useful":0,"cool":0},"d1tpobeiGkaq_TClr2vPCA":{"text":"Stopped by this place while visiting New Orleans this past November. Easily one of the bes","useful":0,"cool":0},"0x0RcI9OKCTJBC5GCFcRmQ":{"text":"We stopped here before heading the airport yesterday.  When we walked in every table was t","useful":0,"cool":0},"3rCWA0lstGDt9P8AxhZGjg":{"text":"Some of the best BBQ  I have ever had. They were all out of the chicken, but the brisket, ","useful":0,"cool":0},"tJmXqYUIrMZ9z_Br5MxQaw":{"text":"My husband really enjoys wood-smoked food, so I decided to surprise him for his birthday! ","useful":2,"cool":0},"OaY1rZ4IejjZ1BHWt_IAsg":{"text":"This place is wonderful!! The employees are friendly and the customers and happy. Loved th","useful":0,"cool":0},"Ixw-MdK45aIOPtQmTIpl0g":{"text":"Zartes Fleisch, perfekt gesmoked. Freundlicher Staff und tolle Atmosphäre. Eines der beste","useful":1,"cool":0},"IcgNDx-N6S9KOgEcaz6eYg":{"text":"I have to say that I \"like\" The Joint but I really don't \"love\" The Joint.  I'm torn betwe","useful":1,"cool":0},"WnKkRDgKCht-Rqont6R3LQ":{"text":"Sitting here right now stuffed as a pig after having this slammin' bbq. Got here right as ","useful":0,"cool":0},"EFDsfUo1-WbRCPJbm8IyaA":{"text":"It was okay. After my tour of BBQ (Nashville, Atlanta, Dallas, New Orleans), this was my l","useful":2,"cool":1},"2f1j_eF_5cSLjJd3Q0_nUQ":{"text":"This place is kinda off the beaten path. It's located pretty far away from the touristy Fr","useful":0,"cool":0},"aypFJwC_EN_bX1YJeiCNQA":{"text":"This bbq was BOMB.COM! My sisters and i kept repeating \"mmmmm...\" and \"omgawddddd dude its","useful":0,"cool":1},"UreyDbD_OrdV76nNVxmoSg":{"text":"Best BBQ in New Orleans hands down. I have dined here a few times now and each time I swea","useful":1,"cool":1},"1hZo_cXaAtqDiE4IKiM4-A":{"text":"We went to The Joint after reading reviews from the locals- it didn't disappoint.  We spli","useful":2,"cool":0},"Ep8KBRAZhkErxwAuZqYRgQ":{"text":"I have to eat here at least once a week.  Best ribs I have ever had!!!  I also love all of","useful":1,"cool":1},"_Cqp3YJMfmxwCbPqNmp-7g":{"text":"The best BBQ in New Orleans. I live just around the corner and I still crave their mac and","useful":0,"cool":0},"gZMyaBJ3rvdPaIPiBP6FKA":{"text":"This place had some of the best brisket I've had for a long time.  Went here with a friend","useful":0,"cool":0},"m7FhaaZW0qI45p6SEHHGSQ":{"text":"EVEN THE TOAST IS GOOD. \n\nThe wait is a bit long but totally worth it. I came in during Ma","useful":2,"cool":0},"Z7TQdNxonW7triKPZVEAnw":{"text":"The Joint done done it again! I get there pretty often, but on my last visit they really i","useful":1,"cool":0},"_Wb5_AK3sws2g4q4IIqtXw":{"text":"Long story short: my life will never be the same. \n\nLong story long: we heard about this p","useful":0,"cool":0},"8whkygTitRkREg1LwEyjCQ":{"text":"Another place that is good but not great. I wasn't disappointed but I was not impressed. I","useful":2,"cool":0},"H0GuhfIF2CrfOaRnOd7EpA":{"text":"Awesome location! Tried the beef brisket, Mac and cheese, and salad with their onion dress","useful":0,"cool":0},"wOXSDmlXoxSaYBgdsrCPEw":{"text":"For the love of God, order the pork ribs.  They're incredible.  A little outside the Frenc","useful":0,"cool":0},"CoPXN5esl3f4lYsxW_7h_g":{"text":"One of my favorite restaurants in New Orleans. It's always good but often time's great. I ","useful":0,"cool":0},"PdRmTNE_p-HXF6MXi75RXQ":{"text":"I might just argue The Joint has the best BBQ I have ever had.  SO GOOD.  We went for lunc","useful":0,"cool":0},"A_I2cafOUxpu8mEg4TIpCg":{"text":"They say you can't get God BBQ in NOLA. Whoever they are there wrong. Had the W special. C","useful":0,"cool":0},"FH_zMWKmN14GnZjjshe65A":{"text":"My first BBQ love in Nola and will always be near and dear to my heart. My favorite baked ","useful":0,"cool":0},"_7O3lyq71kij5mmrJjYXCg":{"text":"This joint rocks. it's the kind of neighbourhoody place that all the tourists would want t","useful":1,"cool":0},"VmqZmK4aiGD60GBHswFGJg":{"text":"Good food and reasonably priced. Line to order was short and we were served quickly. The n","useful":0,"cool":0},"JZBmMJLB1niGhlBKVig8xA":{"text":"Off the beaten path in the Bywater area of New Orleans is some of the best BBQ you'll have","useful":0,"cool":0},"hPw4mf7y5yD7F9DcuFqRiw":{"text":"Tried this for lunch on a recent visit to NOLA. The brisket was delicious as were the ribs","useful":1,"cool":0},"Y9vC8aLV2VRMqdg-YPdTXA":{"text":"We luckily stayed close by this place and literally had to stop every day we were in town,","useful":0,"cool":0},"3Mg_A9CYCeLr3iMt4rk4Qg":{"text":"I used to love this place. ... About six months ago I came in and ordered the Pulled pork ","useful":1,"cool":0},"X5F0xBoD4N9Wj8GdyDaflg":{"text":"The Joint is located in the eastern portion of Bywater making it a about 30 minute walk fr","useful":0,"cool":1},"Fw_py5ijODnvZIvj1wsMQQ":{"text":"On a night of a friend's birthday, we were craving for some BBQ, we stumble upon this one,","useful":2,"cool":2},"q8dnsWPxxkn9BHeKTzbvtA":{"text":"We ordered a sampler...ribs, pulled pork, & brisket w/BBQ beans & potato salad. ALL of it ","useful":0,"cool":0},"qpPFBuX9BDOSLW0Onmx7Tw":{"text":"Good service and good bbq. Since it was during Hogs for the Cause there was no line! I lov","useful":1,"cool":0},"JbQh5JBkZEdc81PH6VtjXw":{"text":"We loved collecting this BBQ experience!! The location is great, especially when you're sn","useful":0,"cool":0},"S3JYcn1AZNmW9qTUs2G11Q":{"text":"AMAZING!!! A must go. I have never been to New Orleans before and this is a must have. The","useful":0,"cool":0},"h0fdXnAUZDRd0UKi6sbrYg":{"text":"Ok I never put 5 stars but I had too for this joint! I never have religious experiences fo","useful":0,"cool":0},"2AKiYkik02x5u20pZkJP_Q":{"text":"This neighborhood Bbq spot in Bywater is really good. Good selections and portion sizes. A","useful":0,"cool":0},"c-ES_9CDhwhItOarahThKA":{"text":"Amazing!! Love the bbq!!! Ribs fall off the bone, perfect smoke ring...and I'm from Texas ","useful":0,"cool":0},"trMQ26E39lrv2cuxEMVUvA":{"text":"The pulled pork was a little grainy, but the beef brisket and the chicken were amazing. Th","useful":2,"cool":1},"kYbqdrKSDQiXGjIbLn7pQA":{"text":"Will have to say this is AWESOME BBQ. The beans different than I'm used to but really good","useful":0,"cool":0},"foWSuteaiDJxg4FARDuKVw":{"text":"Simply amazing, you have to try it to believe it. Guarantee you won't be disappointed!","useful":0,"cool":0},"364OeMrPGzLIP7kQuW_W_A":{"text":"visited NOLA last week.  Loved this place! Ribs were delicious and fell right off the bone","useful":0,"cool":0},"53GsdnKcCVGnWXgqoYSJtg":{"text":"Some of the best barbecue I have ever had, and I lived in Texas 20 years! My husband and I","useful":0,"cool":0},"mM6YhP1i2R5B3UAognnAJg":{"text":"Knew about this place from food network. Love coming to New Orleans because of all the coo","useful":0,"cool":0},"gARCXBGArYD-Mb4-gqfQvQ":{"text":"Good BBQ here. I always enjoy coming here. I love the location because it is a neighborhoo","useful":0,"cool":0},"MvsLrXUp5qcB8skqk5XIRg":{"text":"Wow, they know how to cook some great food!  The dining experience was very different...sl","useful":0,"cool":0},"waDhmrRVUsi4Ia4J-wpPAg":{"text":"Nola isnt known for their BBQ but was in search for something other than seafood.\nStop in ","useful":0,"cool":0},"TttPjAMs3l0OvPEWwOjvVQ":{"text":"Off the Beaten Path - you will definitely need a car to get here... .but it's WELL WORTH g","useful":0,"cool":1},"1wBGGuEtfUfzk_ASXSJZrg":{"text":"A friend took me here and I was anxious to try this bbq place everyone has raved about, an","useful":0,"cool":0},"4cIazqH6ZKv9XQXTAIx9bg":{"text":"Portions were small, but food is excellent and satisfying. Atmosphere and Environment was ","useful":0,"cool":0},"gVSBlhvDw02wCb0hF5qGaQ":{"text":"Might be the worst BBQ I've ever had. No offense to the owners or lovers that read this, b","useful":0,"cool":0},"GOv1-dDjtyAx8oAKyznnmQ":{"text":"Was in town for a convention; the wife and I aren't huge fans of the standard tourist fare","useful":4,"cool":0},"H_g3Q31pmD6Lc8jfyZDOCg":{"text":"Off the beaten path, in a residential neighborhood lies this unassuming bbq gem.  Casual, ","useful":0,"cool":0},"0KJIIGtc-gZ_r-rBKB-0Ow":{"text":"A local brought me to the Joint while I was visiting because she knows I love BBQ; and I w","useful":0,"cool":0},"RyyDOnkRClrZF_MGy9mLjw":{"text":"Location 3- short driving dist from FQ. In a ghetto looking area, but once u get acquainte","useful":1,"cool":0},"9CvI1R10fONYbtHmCouCuQ":{"text":"Food was \"OK\" - the brisket was dry and the worst part was the watered down BBQ sauce!  NO","useful":0,"cool":0},"ROgF53vWothOevVzHpb-ug":{"text":"This place was so good! Omg the Mac n cheese! And the meat just melts in your mouth. I had","useful":0,"cool":0},"U_cTYl9-1eH-Ty8_3FItZw":{"text":"Delicious food.  We got the 3 meat one side combo.  Had brisket, ribs and pulled pork (I h","useful":0,"cool":0},"KjuQwn2SniP7fK31r7dakQ":{"text":"Wow, it is all good. Brisket moist and needed no sauce, sauage same and ribs were better, ","useful":0,"cool":0},"GRkJTy3m4oZ3DBIdHzP_9A":{"text":"Definitely my favorite BBQ place in New orleans!  Especially on my lunch break, though bew","useful":3,"cool":2},"5p0NBVJD3rZKo9IGURenAw":{"text":"I ate here with the boss and two friends yesterday for lunch.  We arrived a little before ","useful":0,"cool":0},"yCTtdyQznDSIp6CaWP0URQ":{"text":"come earlier in the day for the best meat....always good to come here when in town\n\n\n....\n","useful":0,"cool":0},"L9QWnOCzNcboEgtYvnaKGw":{"text":"A friend, a budding barbecueist (a word I just made up) and self-proclaimed closeted hipst","useful":1,"cool":1},"142oMm1qTBRFoIBngbsd_A":{"text":"A fantastic spot tucked away in a neighborhood to bring you that true \"at home\" feel. I ha","useful":0,"cool":0},"XDusgT7DZLHWuEoIKyRjYQ":{"text":"Unbelievable BBQ. We sampled everything and it was all on point. Ribs and brisket were pro","useful":1,"cool":0},"Mn5TvcT83PTCuKPJng7zJA":{"text":"Ummm...we stayed 3 doors down at the Lookout Inn.  It took us about 5 minutes to drop our ","useful":0,"cool":0},"loVJCl6CiSRKAqze0Zd4qw":{"text":"Most defiantly a TOP 5 BBQ spot of in all of my travels! The ribs are amazing. Great flavo","useful":3,"cool":2},"2txAhmtPn_PkvFLTFp8MxQ":{"text":"Ribs were fall off the bone and the sausage w/mustard...oh the sausage. The potato salad w","useful":2,"cool":1},"CQ8obd2CuXuX632n6g-cAA":{"text":"4.5 and thats with being out of everything except pulled pork and sausage. Pork was outsta","useful":0,"cool":1},"mMN3tZ4tvVqV0dKUwj8Sxw":{"text":"good place, funky, nice service, and good sides ok for new orleans","useful":1,"cool":0},"e74HRTiL9ts3FgMmBH3ZAw":{"text":"Scenic restaurant that didn't live up to hype. They were out of brisket so my husband got ","useful":0,"cool":0},"mhlwaQOf-bv9Bs5oZuKj7g":{"text":"The food wasn't bad but it wasn't amazing. I had the ribs, pull pork. The meat fell from t","useful":0,"cool":0},"gDjxtvpEc8aTOkn-ynz00g":{"text":"As a native of Memphis,  TN I have very high standards for southern barbecue.  And The Joi","useful":3,"cool":1},"vHKNKFax7GfZ0dehpfANHQ":{"text":"Okay brisket bun sandwich!!!!! So freaking delicious !!!!! Mac and cheese was good, and po","useful":0,"cool":0},"OAp-pYOZ1vMpjU5HtINpbg":{"text":"Awesome bbq chicken and great sauces on the table.  The real standout though, is the smoke","useful":0,"cool":0},"zF4DN5GCObqHSPs8E6L1IA":{"text":"Got the brisket platter with mac and bbq beans. Brisket was super good","useful":0,"cool":0},"RkuH2DSCvpWt2h2ssbnXMg":{"text":"we had the ribs, pull pork and the brisket! the ribs were the only thing that we enjoyed. ","useful":0,"cool":0},"CWGSO623Eb3eochIqDJgiw":{"text":"Authentic BBQ but needs some flavor. It was literally bland. But baked beans were on point","useful":0,"cool":0},"UxjdQjWcRU8TpqD2lr2E_w":{"text":"Best brisket I've ever had. EVER. This place is a gem that is off the beaten patch. Not fa","useful":0,"cool":0},"HwD17ekYfb7cqNRhpfoe1A":{"text":"Everything here, literally, was great! We got the brisket (not over-cooked, pink to perfec","useful":0,"cool":0},"FkliDTzxYo526zUzBWXHFQ":{"text":"This place came highly recommended from a BBQ expert. The atmosphere was nice, the staff f","useful":0,"cool":0},"CUl2y23ohzdStgJGZHl01w":{"text":"Very disappointing when you catch an Uber from the French quarter only to realize they wer","useful":0,"cool":0},"XjqErbgH295sLLhA050Nvw":{"text":"Some places make their barbecue sauce vinegary or sweet or hot.  The Joint has tried somet","useful":0,"cool":0},"unBf8yLuvFanNroo7bYZYg":{"text":"mmm. this was pretty damn good.\n\ni recommend the \"w\" special. it's a little bit of brisket","useful":1,"cool":1},"itpwfJWDt2gT1vI7vrtVUQ":{"text":"We didn't get to eat here due to an emergency and we were unable to cancel our order. We c","useful":0,"cool":0},"joKY6b0qIC8zgE4O1_ujdQ":{"text":"We ran into this place just taking a drive in NOLA. We had ribs, chicken, sausage, beans, ","useful":0,"cool":0},"-9iSskq0QQGAJnV7raAOgA":{"text":"Amazing barbecue! Best meal in New Orleans during our stay even though we hit some of the ","useful":0,"cool":0},"shzDt3eDhKRiODx0gbX-Nw":{"text":"This place is in the middle of the hood is a completely unassuming building, both inside a","useful":0,"cool":0},"V4wcyUvw_-hjtDxph9dcHQ":{"text":"quick spot for a good lunch. not too expensive, service is fast d friendly. I always get p","useful":0,"cool":0},"sTeNbw900lA1XzOLippTQA":{"text":"Wow- flawless ribs.  Not over spiced (they have 3 different sauces at the table you can ad","useful":0,"cool":0},"tplCEjzI-FeeFC7ZannfyA":{"text":"We're from Tennessee, where people think they know BBQ, let me tell you, I've eaten a lot ","useful":0,"cool":0},"Ip-cMAjsoknTU2IDxLqIdw":{"text":"The Joint is my favorite place in New Orleans for BBQ, far and away the best the city has ","useful":0,"cool":0},"ZbwFuqD02RRKTgmbYmaGug":{"text":"After eating shrimp, fish, gumbo, and oysters for the past several days, I just wanted to ","useful":0,"cool":0},"kUHcZSa6ddCFTFAGb0U1Tw":{"text":"Excellent ribs! Plenty of off off- street parking. Get there early before lunch hour rush.","useful":0,"cool":0},"Su-kYWz4dHcez9Igv1A_zA":{"text":"Well all the high reviews had me pumped!!  It just ended with dry,no flavor and not even t","useful":0,"cool":0},"yMVryyiWsZww9JcF-TiY2A":{"text":"I had given up on BBQ in New Orleans.  As a BBQ snob, I would hit Leitha's in Hattiesburg,","useful":1,"cool":0},"TMe9R7cmVE6K6pHuLPN7ug":{"text":"Okay, the brisket tastes better as leftovers and is on par with the ribs. Although, I can'","useful":1,"cool":2},"ADJCWgGAyGlxCG1AWttz8w":{"text":"This place has the best brisket I've ever had in my life- so tender and flavorful. I never","useful":0,"cool":0},"xqXfyReI0ohYSjZCmB4fzA":{"text":"I have eaten bar-b-que all over America from Ky to Memphis to California and Texas and mos","useful":1,"cool":0},"wuGl2acGAtXk_MO4PZltTA":{"text":"The only reason why I'm giving this 4 stars is Blue Oak BBQ blew the Joint by a mile. The ","useful":1,"cool":0},"3bbsu3EbGV4gMwtxIRPRKw":{"text":"In order of favorites, crowing this 5 stars: baked beans, pork ribs, sausage link, mac n' ","useful":1,"cool":0},"rD7ucvU5DXvksjjIp99-Cw":{"text":"Great place for brisket and ribs. If you are in New Orleans, this place is an absolute mus","useful":0,"cool":0},"QIGcxDr1Da-Zeih8W6IRgg":{"text":"I had a terrible experience at The Joint this week.  This restaurant treats its customers ","useful":0,"cool":1},"CGqeBHUna-4CC46yAUkEeg":{"text":"Everything here is GREAT!!!!!! The ribs have a fantastic dry rub. The brisket is oh so ten","useful":0,"cool":0},"2vwIf4miKijH1s64z_IZ1g":{"text":"Pretty great find, outside of the French quarter. We found reviews on yelp and decided to ","useful":1,"cool":1},"SKMseE9R1G83veWOKsnR2A":{"text":"It's a little pricey but you get what you pay for honestly best ribs I've ever tasted in m","useful":0,"cool":0},"pf5rTcR_SMTSckoOWXp73g":{"text":"First time in New Orleans and I was looking for authentic southern ribs. The place did not","useful":0,"cool":0},"2Wzvs1ORqqSttNOgN3YCVw":{"text":"Oh my word. My friend and I had already walked hours before we decided to go to The Joint ","useful":0,"cool":0},"RIYsVzn6HuT1d25v_iwXDQ":{"text":"I visited here while on vacation and staying in AirBnB lodging in the Bywater.  We ate 2 m","useful":0,"cool":0},"Qdgk4CiFarVOmBhhtAOX8Q":{"text":"Very good BBQ, the Mac&Cheese is simple with a great taste the BBQ beans are awesome. The ","useful":0,"cool":0},"Alul1-ZOW-m33jaQj_ityQ":{"text":"Note, they are NOT open on Sundays.\n\nPARKING: There is plenty of street parking as it is l","useful":3,"cool":1},"lGso_VDIX1WwYC-PXIeWhA":{"text":"Welcome surprise for people who know Texas bbq well. Pork ribs and brisket were phenomenal","useful":0,"cool":0},"EqxQJsBpd8KAVDCOZq9AOw":{"text":"Super friendly staff, great food, easy to get to location. Had the brisket, ribs and pulle","useful":0,"cool":0},"q8OkRLT24W0tnGqiBX_09Q":{"text":"Holy Shit this place is so fucking good I could drool just thinking about it. Like a serio","useful":0,"cool":1},"6ZlttvuDUqVJljlPDcKTIw":{"text":"Great bbq, I had the pulled pork sandwich with slaw and smoked corn grits for a side. LOVE","useful":0,"cool":0},"8cZzorm7z49TH4610wfjpQ":{"text":"I really like the joint. In interest of full disclosure all of my friends LOVE this place ","useful":0,"cool":0},"IwLn21gLBDkWAVt4Rrkb-w":{"text":"This is the best barbque place in town. It's a little off the beaten path and looks like a","useful":0,"cool":0},"vlXvwxrVUD3xYZk0j9Mmxw":{"text":"I love The Joint! From the amazing food down to the yellow building. I've had the ribs, th","useful":0,"cool":0},"9NL8UsnDzDqyt-x9c-tTaQ":{"text":"Everything was wonderful. Meat falling off the bone, moist, flavorful.","useful":0,"cool":0},"M1iS7ZU3A5E9hUf4JfJyaw":{"text":"Decided to give this place a try today. It was actually very good. We ordered the ribs, br","useful":0,"cool":0},"cDLKhDgve9N0jTjTJzbd4w":{"text":"The real Deal!  Nothing too fancy, just really good food and great custom drinks for a ver","useful":0,"cool":0},"wAOIsspq8x-hQXz1pWlebQ":{"text":"This place is the dive-i- est of dives but the ribs were on point. The Pulled pork sandwic","useful":0,"cool":0},"HZTB9ltE1fqh9qlDPWI1iQ":{"text":"Maybe I was in a bad mood on the night I first went to the Joint. Or maybe it was an off n","useful":12,"cool":9},"9geG8xaaeQD8wvNYzMY95A":{"text":"This place was fantastic. I recommend the 1/4 chicken and macaroni and cheese. The tea fla","useful":0,"cool":0},"mAGpYgzLKTlNK1-O0GFnvg":{"text":"Went on a quiet night for dinner. Food was some of the better BBQ I've had. Brisket was te","useful":0,"cool":0},"THZqmSkst9yAaECf9E0Y1g":{"text":"Excellent BBQ, casual atmosphere, quick and friendly service. What more can you ask for? P","useful":0,"cool":1},"bGWYc8VTJxtUs9F4Cjfz3g":{"text":"Amazing food and friendly staff...loved the ribs! The atmosphere was so casual and friendl","useful":0,"cool":0},"h6YRtQ6pBwG3jBinUg83bQ":{"text":"Very nice place. Super fast for excellently grilled food. We ordered ribs, briskets and ch","useful":0,"cool":0},"jBMRa7VkpYEMTVCPbOkzDA":{"text":"This is by FAR the BEST BBQ I've EVER had.  We walked in drenched from the storm after rid","useful":0,"cool":1},"0MZ4CWf6jgdOHWAzd9RrFw":{"text":"Say YES if someone offers you this Joint and be sure to inhale. This is the real deal West","useful":0,"cool":1},"QDWYE5FWBJzC_73rXL6RnA":{"text":"Wow, the ribs are awesome - meat just fell off the bone.  Brisket was delicious and very l","useful":0,"cool":0},"o8gl5lE6-Xs0IQbGNUcPgA":{"text":"Delicious barbeque in a quaint neighborhood about a 30 minute walk from the French Quarter","useful":0,"cool":0},"gcQBYFU0Vo1-h1OmDKTClg":{"text":"The Best of The Best BBQ\n\nThis place is arguably the best BBQ place in the entire metro ar","useful":0,"cool":0},"sAnAT8MFpCPtwvLJfVp-7A":{"text":"Local Favorite. Everything on the menu is mouthwatering and the house sauce and house sala","useful":0,"cool":0},"hgyBKFd5R-8OGYmJ0FIU3Q":{"text":"\" THE BEST BBQ JOINT IN TOWN\" said one local as we were on the bar. \n\nThe bartender seems ","useful":0,"cool":0},"JsGYKSdiR-ai_px8YaXTEg":{"text":"That is by far some of the best bbq I have ever had. You walk in to this down to earth vib","useful":0,"cool":0},"yBte_DeURjkdC_S6Gxxp4w":{"text":"The smoked chicken 1/4 (dark meat) was the best I've had. The collard greens isn't offered","useful":0,"cool":0},"0vQw5emxh_LISvyqlYjGqA":{"text":"the joint has some damn fine bbq. i used to live down the street from the restaurant and w","useful":0,"cool":0},"qAvwLvW_Vy1FQoJjJcX-4w":{"text":"I'll start by saying I never used to like BBQ at all. Never been crazy about it at all rea","useful":3,"cool":2},"EQnU21Hrs6LeKTSIJXDIxA":{"text":"Excellent! I ate here whilst in Louisiana a couple of months ago, so good I hit it up 3 ti","useful":0,"cool":0},"VJPutRJ2jSpFHWZ2SVy0ZA":{"text":"Great food & portions, the 3 meat plate was nearly too much for me to put down, and I'm a ","useful":0,"cool":0},"vzaaqEuK1RXkj5hQ4WfNpg":{"text":"Great BBQ restaurant!! Definitely give the Joint a try if you're craving some of the best ","useful":0,"cool":0},"HngxkH3IN8YBdNaL7JrKJg":{"text":"First stop in NOLA and a good one. Tried several meats and sides.......all delicious and a","useful":0,"cool":0},"au2-Bx8fxMp-NjJLjG5ATw":{"text":"So tasty! Very busy, but goes quickly. Everything taste amazing. The baked beans are to di","useful":0,"cool":0},"f0LZpsRDNklko1HT6bdNew":{"text":"The BBQ was ok.  I'm used to saucier BBQs and not so much dry rub.  It's a matter preferen","useful":0,"cool":0},"oeCSH29zEvQS0lmCEmu7_g":{"text":"This is the best BBQ New Orleans has to offer imho, though I only lived there for 5 years.","useful":0,"cool":0},"FExWkSvOrisS8xQv31kYbQ":{"text":"Not easy to get to unless you uber but great bbq.  Had the brisket and pulled pork and bot","useful":0,"cool":0},"lSNmAQeqcw1rNGGFB7_ZXg":{"text":"I've had bbq in St. Louis, North Carolina, and Texas and this tiny hole in the wall served","useful":1,"cool":0},"NiJUs79tcYcd-25aEq3_uQ":{"text":"Not as good as advertised but still good-my family makes better BBQ in Alabama and I make ","useful":0,"cool":0},"8oMiOE-uG5gzr8p0PqNgZg":{"text":"Friendly service, but the BBQ left a lot of be desired (especially if you live for Brisket","useful":0,"cool":0},"wi-btNtIbAaM38WOMBmoXA":{"text":"This was delicious!!! We had ribs, burnt ends, pulled pork, brisket, potato salad, mac & c","useful":1,"cool":0},"9hvlTr2dBqj-r1aBOkZpjg":{"text":"Best barbecue I've ever had in my life! Loved everything about this place. Affordable, del","useful":0,"cool":0},"ks6M85Rg7yOURDLnGetdxA":{"text":"Un sólido 4 estrellas para este BBQ joint clásico del barrio Bywater (ven un patrón? Me qu","useful":5,"cool":4},"E-swDAq3D2Q8a-KX9fsdIg":{"text":"BEST BBQ WE HAVE EVER EATEN! We got pulled pork, ribs, brisket, coleslaw, potato salad, be","useful":1,"cool":0},"mfX3J249jxs8tpbI2aFoLA":{"text":"The beef brisket it very, very good. Love the fact that you order and pay before seating y","useful":0,"cool":0},"Tik9LnuSZ-120g7WxwC3BA":{"text":"Ate here with some friends last weekend, the wait wasn't very long when we got there but i","useful":0,"cool":0},"b4XVwyvBL-K-wdv7gE3iSg":{"text":"Really, really great ribs. The ribs, are juicy and seasoned mildly- and incredible meaty, ","useful":0,"cool":0},"Rte145G4uU9b7Up46lEbig":{"text":"Authentic BBQ. A bit out of the way from the FrenchQuarter but well worth it. I recommend ","useful":0,"cool":0},"RQiZF8j1BiUN4SICn-1I8A":{"text":"Great tasty heavy rub BBQ. Great staff and service! Brisket and hot links were stellar, I ","useful":0,"cool":0},"qPLdV8fsdIWo5b-7edJVWA":{"text":"Very unique place off the beaten path! Really enjoyed the character! \n\nTender brisket & ri","useful":0,"cool":0},"St-lIy6Q8bXFRejvrdOZbQ":{"text":"The BBQ was really good but they need better sides ..baked beans should not have onions in","useful":0,"cool":0},"h4CJCWjpX83_TmOIyMjj1g":{"text":"I had heard about The Joint before coming to New Orleans, it sounded like it was an awesom","useful":0,"cool":0},"pt5JFe7HWyNQ7BXrOszQQg":{"text":"Some very tasty Carolina/Texas barbeque. \n\nBut they gave me so much meat I couldn't eat it","useful":0,"cool":0},"rioPFQW2NQutSLrBUWKnHA":{"text":"So worth the uber ride from Bourbon Street! Little gem in the Bywater areas, where the BBQ","useful":0,"cool":0},"I3H1Mp9RgJylj0o9z80Row":{"text":"I wish I could give them 10 stars because the bbq was worth it! When first glancing at it ","useful":0,"cool":0},"-T33ahJBoNpUF4Kcx_Z_Qg":{"text":"Do not waste your time with this place. They have the rudest staff in town and are often o","useful":1,"cool":0},"OTkaVDO73jPIplyAgVGJjQ":{"text":"My goodness, the beef brisket is out of control. I was raised in Georgia and consider myse","useful":0,"cool":0},"gxXZnlU66NwlHVwKNb52CQ":{"text":"I gotta go at least once a month.  The ribs, mac n cheese, collard greens (when they have ","useful":0,"cool":0},"jCHmfUVOFhrC4RXhz_QkMg":{"text":"Worth finding a bit out of the way... thank god for uber.  \nIt's an experience of NOLA I w","useful":1,"cool":0},"yzmu2WugZlR28yRu2643Qw":{"text":"Went for dinner and ordered the W Special-- brisket, pulled pork, and 2 ribs with one or t","useful":1,"cool":0},"XdqDY-gqazckQEMWIz9ORw":{"text":"Everyone was nice. Food was very good. I enjoyed the ribs and pork and brisket! Sides were","useful":0,"cool":0},"tzsJl_EgxRhGebZyi8kEXg":{"text":"Best BBQ we've had in NOLA.  Ordered the meaty fall-off-the-bone ribs plate  and the brisk","useful":0,"cool":0},"Y3-bZYEUqBMsg3LUN2lypA":{"text":"Put on a bib and pull up a seat at the picnic table. Prepare to get messy. The Joint does ","useful":3,"cool":3},"X36-5HJ0BN60pcDmiRU1Yw":{"text":"Tasty BBQ is served in this no frills \"joint\" in the Bywater neighborhood, but beware of e","useful":0,"cool":0},"dEARlcHbfugrXysYiqHGXQ":{"text":"This place was featured on the Food Network's diners, drive-ins, and dives so we figured w","useful":0,"cool":0},"WVWaiLatEOJI5P-BZ7invw":{"text":"I don't know why this place has 4.5 Stars. Anyone rating it below 5 stars must not like aw","useful":0,"cool":0},"41FkFdn4Xhnuz0qwjAVL2Q":{"text":"Special drink cost $60....oops, machine  broken and spitting out random prices (drink befo","useful":0,"cool":0},"kst6kqrDKclCCfj5Mw0yEw":{"text":"It was highly touted and lived up to every bit of it. Amazing amazing BBQ. The best I've e","useful":1,"cool":1},"38wIzEM_9q44A3AJ4crCTg":{"text":"There is a God! And I know this because he placed me right around the corner from the Join","useful":8,"cool":4},"m8WOPgArX07pfO88kdRsYA":{"text":"Perfection.\nThe atmosphere is adorably down-home.  The food does NOT disappoint.  They sho","useful":0,"cool":1},"N7VQtPqfFWtCsjGWVfJ0Vw":{"text":"Stumbled onto The Joint as it was near our guest house.  Can't say enough about the amazin","useful":0,"cool":0},"JZ2VRqlxmVws4lXOG14lWQ":{"text":"If you go to one restaurant in New Orleans make this the one! We took a cab and it was wor","useful":0,"cool":0},"UZxMr-G-ses6BFYLdKX9_Q":{"text":"Hands down, the BEST bbq I have ever had!!! I can never decide between the melt-in-your-mo","useful":1,"cool":1},"kVmSN7ofWqysXiVuTsD92g":{"text":"BLUF:  Check this place out it is a great price and great quality!\n\nFor a BBQ joint in an ","useful":0,"cool":0},"YZvG68cd_56dozDVu86EmQ":{"text":"By far the best barbecue in New Orleans. The portions are perfect for a small take home ba","useful":0,"cool":1},"YrJxInkZ8ZUBcMMm6j34dQ":{"text":"I had the brisket sandwich. The brisket was amazing & so was the thin sauce they keep on t","useful":0,"cool":0},"EFyJLAScIlKDegN-8GHYsw":{"text":"Incredible pulled pork. Moist, delicious with their tangy house BBQ sauce. Potato salad gr","useful":0,"cool":0},"6cJt_UBfie-pJWpcneWaag":{"text":"Really good barbecue that was recommended after doing some volunteer work in the area.  Pa","useful":1,"cool":1},"AX5siZLHzJZl0CrINLdHiQ":{"text":"Amazing food! Get the brisket, it is to die for. It's also very affordable and the food co","useful":0,"cool":0},"5sdfqgAKU_X6J55zqiCmRw":{"text":"Always loved the joint\nFood is the best BBQ I ever had, whenever I go to other BBQ places ","useful":0,"cool":0},"LX0W2MJr9F-6wpNVXP9c2A":{"text":"The food wasn't that great at all. It was BBQ with no seasonings. I got the pulled poek sa","useful":0,"cool":0},"lM4bU-T8fqrQLgJt__qbyQ":{"text":"First night in New Orleans and we wanted smoke local BBQ. This is a no frills BBQ joint wi","useful":3,"cool":1},"MHLrhypyhXd1ZEck12safA":{"text":"This place was recently featured on TV, and now I know why!  It's a hole-in-the-wall in th","useful":0,"cool":0},"xY0xL28crjZHOesjCxemTQ":{"text":"Good smoked BBQ. The meat was cooked perfectly and the flavor was rich. The only thing I w","useful":2,"cool":0},"BBCaHc5JxuzpoNnqJreuRA":{"text":"Not too bad! Now i was very worried when  i saw everything comes out dry with no sauce on ","useful":0,"cool":0},"lZB8UU4VHAqhdMAdNIzk1Q":{"text":"The best BBQ in NOLA, make sure you order a slice of pie for dessert.  I loved it all, the","useful":0,"cool":1},"Bk5lKpWVxczQMT8UDn7Tfg":{"text":"What a great place to come for some great BBQ!!!  The ribs are tender, seasoned perfectly ","useful":0,"cool":0},"pcTapnW3V2Ywd6CvYc1fhQ":{"text":"I cant get enough of the place!   I've eaten here about 10 times and I cant wait to go bac","useful":2,"cool":1},"-h1dE-K-t7cY5O32UsPm6w":{"text":"Perfection!  It was very busy but well worth the wait for the brisket!  I just wish I'd be","useful":0,"cool":0},"3zsrwnJwCKzMvgv5_wBKYQ":{"text":"Great food. Come hungry. The ribs are a must have! Brisket is so tender! Potato salad is g","useful":1,"cool":0},"1gPLk03NjJKojRDWo3I4Nw":{"text":"DELICIOUS! I had just moved here, and my coworkers took me out to eat at The Joint. The bu","useful":0,"cool":0},"N1opESvuCADIfo5xMRGFYQ":{"text":"The brisket is phenomenal! A little bit of a weight but well worth the wait. Also order th","useful":0,"cool":0},"N_0so0ZCW_ksLTAiq0ez1w":{"text":"Great BBQ restaurant in the Bywater area. Getting big publicity. Group of 6 served quickly","useful":0,"cool":0},"GqykHbvhH_Je0usc9N5aEw":{"text":"Best BBQ pulled pork I've had in years!  Cute little place with great food and service! Pr","useful":0,"cool":0},"z-jvyOSbwR80bjxOVLOXUg":{"text":"I'm not even a huge fan of bbq and I frequent The Joint for dinner. I have heard people cl","useful":0,"cool":0},"SltTt0NqbsV_nGVtTnT-pg":{"text":"The joint is very likely my favorite BBQ place in NOLA. I think it is better than Blue Oak","useful":1,"cool":1},"ZQ5TyeZjFhvWxf6it1hMSw":{"text":"Same old crazy good meat, better location. What's not to love?\n\nThere is now a real bar, a","useful":1,"cool":3},"Kaui-O4JqQUX46tiDqeU5A":{"text":"We ordered take away and ate at the brewery a block away, so I didn't actually dine in, bu","useful":1,"cool":1},"yqjeZAesOQQ89vKRDkiLqw":{"text":"It's just a bar so don't expect table service and napkins or whatever. Just expect some in","useful":0,"cool":0},"esJEHrqLK8lWGpCJ3dN5dg":{"text":"From the moment we pulled up, including getting parking right out in front, I had a good f","useful":2,"cool":1},"3cW0H9lwtaOkJ0cNvRh_6g":{"text":"Took a little trip outside of the French Quarter to try this BBQ joint... It's small on th","useful":0,"cool":0},"fyFFPoTYqfvm2vn21jgJdw":{"text":"I love BBQ and this place could be the Best BBQ I've been to.  Large portions.  The ribs, ","useful":1,"cool":0},"v2z9Lw017xRE0ApeaP1fsw":{"text":"This place smokes!  And that's a good thing... smokes fowl, swine and bovine. BBQ down hom","useful":0,"cool":0},"ggbdExU1qXGq-1K08qqD8A":{"text":"I'm from the north, stayed in the Bywater this spring for a a week and endless to say this","useful":1,"cool":0},"W7X1WOypqRSmZLv5dmIDWQ":{"text":"After hearing about the Joint and how wonderful the BBQ was I decided it was time to see i","useful":0,"cool":0},"zxA4E2Y1cH2AeY2CnZ5dNg":{"text":"Outstanding bbq, best brisket I've had in many years. Ribs, perfect. Sides were outstandin","useful":0,"cool":0},"JlcIJ0kZoj7jbUE5KdeY8Q":{"text":"If you like metaphors, check out The Joint, an eating joint of real-life metaphors.  The J","useful":0,"cool":0},"4k76rzsjEAXuH_5AAu_bIg":{"text":"When you walk in, notice the message written in rib bones on the back wall--\"Carnivore Cui","useful":0,"cool":0},"R1vxiwEyZ3FkAwhioXaEcg":{"text":"Found this place from recommendation of a local. Backed up by checking Yelp. Thank you, th","useful":2,"cool":0},"LWM2gW4GXMZ382TCT5FNcw":{"text":"Absolutely one of the best barbecue places I've ever been to. My wife and I were babysitti","useful":11,"cool":7},"YAou74iyospwWcZHdFwMCg":{"text":"Great BBQ. Love the ribs. Carolina sauce is delicious. Great potato salad. Easy to order. ","useful":0,"cool":0},"KySpA2NsGdbY00RV9ltGrA":{"text":"If your from Nola than you may think this is good bbq. The atmosphere is cool but if your ","useful":0,"cool":0},"pZvEDSoe6aOQeBNdp1D1og":{"text":"This place offer some delicious bbq. Like most stated it is probably top 3 of the best bbq","useful":0,"cool":0},"Qiba79PsMKpGmDKBRFn-8A":{"text":"I had the brisket and ribs with macaroni and cheese everything was delicious it was my fir","useful":0,"cool":0},"yDvWHDn7QRFnr53pZQd9ug":{"text":"After a 1/2 day swamp tour, husband and I had a hankering for some hearty bbq and boy a bi","useful":0,"cool":0},"YPj3Q378PxqQCj8Ppg0tTw":{"text":"Prior to visiting The Joint, our favorite BBQ was Dreamland in Tuscaloosa...  but The Join","useful":0,"cool":1},"rHO7uU0yl_S6eWLy4ska_w":{"text":"Excellent food, great atmosphere and Great wait staff. Get the three meat combo with beans","useful":0,"cool":0},"dLohbzUcqzmjkWyFK-RLQQ":{"text":"The joint, what to say? The BBQ is wonderful it's a great spot for lunch they are usually ","useful":0,"cool":0},"TB9fx0CttZpWvt2QISUVNw":{"text":"Good food and great casual atmosphere- it's rare to find a place where my kid's loud playi","useful":0,"cool":0},"yYH-62DilxfKBewWbVPA8w":{"text":"Had the pulled pork Sammie and coleslaw. The sammie was great. Nice smoke flavor. The cole","useful":0,"cool":0},"e8pvQYnl-X8jmQ-exe4ItQ":{"text":"No idea why this place is rated so high!\n\nThe barbecue joints in Austin are much better. I","useful":1,"cool":1},"PznyXopnjHs6RN7Dlg9Zug":{"text":"Almost went to another place for BBQ until some folks told us to go here. They were ABSOLU","useful":1,"cool":1},"LOSnT7tdII2aj8sBzY4ViQ":{"text":"We had the brisket and ribs which I thought were good, but something that we could have sk","useful":0,"cool":0},"uzK7wR6EIERpdOy59YtAug":{"text":"This was my first visit here last Thursday, as I'm new to the area. I don't know if it was","useful":0,"cool":0},"_5EDn3_5nWXZETIsj7TS7Q":{"text":"This \"joint\" is great for bite to eat with pals or even a date. Great food and interesting","useful":1,"cool":0},"IUFo590-WuIPcGwceFsynw":{"text":"The BEST BBQ in NOLA! Just love it. Seating can be a bit of a problem so we call ahead and","useful":0,"cool":0},"fg9tWYD5jzxRySfV-vhB1w":{"text":"We did a lot of research getting the best BBQ in NOLA. This place had great reviews and de","useful":0,"cool":0},"-bUMLnrG0iv5Yk8aHznR4Q":{"text":"The Joint is at a bigger and better location. And they have added a bar.\n\nAs far as the fo","useful":1,"cool":0},"FIohlerqynJzcD8HuYPG9w":{"text":"I'm not really sure why everyone gets a big boner over this place. It was ok. The only coo","useful":0,"cool":0},"bjDYPPXiqS9RgUbXrOrKBg":{"text":"Great BBQ. Great potato salad. Great mac 'n' cheese. The only thing I've had that wasn't g","useful":1,"cool":0},"IqVCs9ZATA6r_bRfx7MCKw":{"text":"Delicious! Delicious! Delicious! Best BBQ I've had in a very long time. I had the W platte","useful":2,"cool":0},"ai_b5mGe50SVD1ybV1lRpg":{"text":"The best traditional BBQ joint in New Orleans.  I've lived in Memphis (capital of BBQ) for","useful":0,"cool":0},"werOzZBe2r1lK51lkaH69w":{"text":"When you think of Bar-B-Que in New Orleans you auto pilot to Squeals. Its on Oak Street, t","useful":1,"cool":0},"Sc1QyG_6HCooVwf5lpi35w":{"text":"My partner and I are both foodies and we wanted to round out our trip with some good BBQ. ","useful":1,"cool":2},"4AogRTSAuLN5XcF-gX3-LQ":{"text":"Amazing food and chill people work there which makes it so fun. One of the cooks let us in","useful":0,"cool":0},"x64WU9cuA9K6zVPA5N7x1g":{"text":"This is a really cool place to not only get great food at a decent price but if you want t","useful":0,"cool":0},"sSC6YIBH-pTCwXKHkqUsOQ":{"text":"The last meal I ever have on this planet better be beef brisket with mac & cheese from The","useful":2,"cool":1},"n6uG2Zvu_QvHTLRQ1WDhMg":{"text":"Excellent BBQ.  The pulled pork and the potato salad are awesome.  You have got to try thi","useful":0,"cool":0},"2jMO7fB23YtZ6EhYL0Dviw":{"text":"I had the beef brisket and chicken with a side of macaroni. The beef brisket was the best!","useful":1,"cool":1},"MWOKnal8aNeEtnZjOfh5OA":{"text":"The smell of BBQ greets you when you walk in the door. Their menu isn't huge, but every si","useful":1,"cool":0},"4b8c4cvrGXUalgouyAPCTw":{"text":"Let down. The joint has nothing to rave about. BBQ sucks. Mac and cheese sucks. Food was n","useful":1,"cool":1},"eAr3r3lskpX6UZD6UmLytw":{"text":"Probably the best BBQ in New Orleans.  Real small divey kinda place, but the food is reall","useful":0,"cool":0},"Ow7WwaHxyazsc7RdpGh1iA":{"text":"The second place I biked to that nearly broke my bike was the Joint. Yes, there are a ton ","useful":0,"cool":0},"JBuadE8Xuju-NFZFJ8P1Og":{"text":"Amazing food and awesome staff, best ribs I've had in a while. It's a must if your in the ","useful":0,"cool":0},"cisr6USL2MjpKQse9xTaUg":{"text":"You've probably heard all about it, and let me tell you, The Joint absolutely lives up to ","useful":2,"cool":1},"3PoCXV3Luh8cyE2YVhW2SQ":{"text":"I have been here a few times over the years. If I want bbq...this is where I go. The ribs ","useful":0,"cool":0},"G74rb0szrW8NHhMcIi6Ctw":{"text":"I for got to add how much I love that the guys draw your picture on the receipts for the t","useful":1,"cool":1},"YxO6O3FbLwXGWd_Mx44xaA":{"text":"This place is great!! BBQ and drinks.  Off the beaten path for sure. Sat at the bar, barte","useful":0,"cool":0},"MrmZ0s9GJfwuTE-3NVvrKQ":{"text":"Great little place. The food was fantastic. Between the Beef Brisk and the Ribs it was har","useful":0,"cool":0},"PBOis7ICnSDHg-BGJFCWvQ":{"text":"This is THE BEST BBQ in NOLA! For reals it has to be the best pulled pork sandwich and ten","useful":0,"cool":0},"5vcqHOYySXVrm5q7r5CRRQ":{"text":"Memorial Day is an extremely important day, since it is one that is dedicated to rememberi","useful":1,"cool":0},"cm9_xhPR2xTyqRXryCcA_g":{"text":"The barbecue is AMAZING, but it's not a consistent taste (some days it taste better than o","useful":0,"cool":0},"tp5CvpWEX2MCtjkyZKPJHQ":{"text":"Get here early! When it's gone, it's gone. We arrived at 8pm on a Monday and they only had","useful":2,"cool":1},"QlaEFSQPLocFCVADFFyKKg":{"text":"The best bbq in New Orleans, hands down.  I'm a bit of a bbq snob - I grew up near Memphis","useful":0,"cool":0},"a2p_bfYDG74W60cP8V8GYQ":{"text":"I had seen the Joint on Diners Drive Ins & Dives and knew I would have to try it when we w","useful":0,"cool":0},"dHoKTDGsAhBYOgskqso6cA":{"text":"The Joint is one of the finest BBQ restaurants that I have visited. The meat is pure enjoy","useful":2,"cool":1},"-sQXiNq0vGX_esGI0JYdyQ":{"text":"One of my tweeps recommended The Joint to me. I'm glad I got to check it out. It's a reall","useful":2,"cool":2},"e4jFFjNI4xuZYwKPQ0NcFA":{"text":"Crazy good.  Best BBQ in city hands down.\n\nI had pulled pork and brisket.  Neither needed ","useful":2,"cool":2},"bghTBfQ3CRn12vITSIicsw":{"text":"Really awesome!  You dine on wooden picnic tables. VERY informal--- and everyone likes it ","useful":0,"cool":0},"oKCrqFEzCu9JUA3hteoYXQ":{"text":"Ate lunch here today on our second day in NOLA. This place is fantastic. I had the pulled ","useful":1,"cool":0},"E5wjS009P17O-nHwQlLfJg":{"text":"Best BBQ in NOLA!! The place also has a large bar with great cocktails. Would definitely r","useful":0,"cool":0},"ZUuVGxQgxMtZGP4ooNoYaQ":{"text":"The beef biscuit is their moneymaker, tender and juicy.  Everything else is good but the b","useful":0,"cool":0},"QUltdWtG4lSAffqsQIFOpA":{"text":"I cannot believe this place only has 5 reviews!  People, where have you been?!  The best B","useful":1,"cool":1},"1TRKkzELK2G5Fg_zKCvs8g":{"text":"Love everything. Service was excellent. Pulled pork and the ribs were my favorite meats.  ","useful":0,"cool":0},"yTk2ZLlIw5ebd3jertc_0w":{"text":"The staff here are pretty funny, they just kind of do their own thing. They're not unfrien","useful":1,"cool":1},"sOOcE2zd8xqcmxcjopdXuw":{"text":"Don't let your initial impressions keep you from walkng through the door! This weathered n","useful":0,"cool":0},"_o4DBceYpe5EP8f8cmRoqg":{"text":"Not a good visit this time, my beans and Mac and cheese were awesome butt the brisket and ","useful":0,"cool":0},"uGecG0yZCwqx43PR-3RI0w":{"text":"I feel like I've spent half my life searching for authentic BBQ, well in New Orleans I hav","useful":0,"cool":0},"HQJ6WAYYSU2hDvKxu1Aohg":{"text":"The first time I ever ate at The Joint my friends immediately called my wife to let her kn","useful":0,"cool":0},"QDCGdgaigoNOnKrPHgYu_Q":{"text":"Quite an unusual place. Way off the  tourist beaten track, in a residential neighbourhood.","useful":0,"cool":0},"8CqaqH8G2DEUJoFYadZiTA":{"text":"Great place off the beaten path.  A little hipster but food was great.  We had ribs and pu","useful":0,"cool":0},"OMw11cDf_SoRU6mk3IDmwA":{"text":"One of the best places to eat in NOLA period! I F*****G LOVE THIS PLACE !! Everything is s","useful":0,"cool":0},"bYyBOQIgrWRNvJUWhdFxgA":{"text":"Where to begin... My first night in town, I stopped in with friends for a late night plate","useful":0,"cool":0},"oU5G2dr5wVIChRVECVbxZw":{"text":"Outstanding brisket. The pastrami sandwich is as good as you will find in LA. It's thick c","useful":0,"cool":0},"wWi90yoqv2ipE8Bn8y__9A":{"text":"This is definitely a great place to eat. As a family we ordered basically a little of ever","useful":0,"cool":0},"cuLk1eU9KJsoO_1F0Ehbwg":{"text":"OMG! The best food we've had in New Orleans so far. My family loves BBQ and this was defin","useful":2,"cool":0},"s9yGHb9pB8VUEE4s1Uf1fg":{"text":"BF is obsessed with barbecue, and because there are no good places in Baton Rouge, we vent","useful":3,"cool":0},"KbHOZqGR__dbBvZKrCq_ag":{"text":"Some of my friends who preside in Nola were originally from Texas and they had mentioned t","useful":0,"cool":0},"2s9AfIt8Wk7iskGLLPpdGQ":{"text":"fantastic bbq joint.  brisket is pretty damn good.","useful":0,"cool":0},"wpAcLKQr-no6ZBbaoOkMww":{"text":"The best BBQ I've ever had in my life.  The area can be a little dicey, but it's so worth ","useful":0,"cool":0},"cDRBgZuf3-JuyM2mMITvzg":{"text":"I'm from Chicago & know a thing or two about BBQ, this place is pretty legit. Wouldn't say","useful":0,"cool":0},"g1Y8uqqt-1arNMy9qdgh8A":{"text":"My absolute favorite bbq spot in Nola. I can't even put into words how good the food is he","useful":2,"cool":1},"29E67YH--0bx_wWBx5y67A":{"text":"best......barbque.....EVER!!!!  i live in los angeles and anyone who is familiar with LA k","useful":0,"cool":0},"Jd_hUnEmph5fLW4uXFzrKw":{"text":"Came back after visiting 3 years ago.  Still as good as ever!  Brought our kids this time ","useful":0,"cool":0},"EV3OHCxsXatRKwXXBhw9Rw":{"text":"By far the best bbq in New Orleans.... If you're a tourist and want something great to eat","useful":1,"cool":0},"FV7CIIj1fKSPqga41htmDg":{"text":"ordered a double meat-one side today before noon to go under the name mac. brisket, ribs a","useful":0,"cool":0},"SVQrg2bm1PYZtwZljzQ9cA":{"text":"chicken, and beans, and tattooed boys, oh my!  i still love you, the joint.  you are the o","useful":1,"cool":0},"zQjUCFEU5sN1KHnrYIikKw":{"text":"Ribs are very delicious and the Amber draft was really nice! And you can enjoy it in the y","useful":0,"cool":0},"l-zK52TP6JHN6HojGWK7xA":{"text":"Some of the better BBQ that I've had but not the best. Meats were a little on the saltier ","useful":0,"cool":1},"ny9dA5TwuF2t6IgWKtxP9w":{"text":"The Joint definitely deserves all of the great reviews. The food was deliciously flavorful","useful":0,"cool":0},"YBalmAHDFK45RvmCi2Knng":{"text":"Aug '10 Update - The Joint's been closed for a couple weeks now.  I believe they must clos","useful":0,"cool":0},"WY40me1TE7q_T2wU1Qp5kw":{"text":"We were on vacation a couple of weeks ago doing a road trip of the southern US and this wa","useful":0,"cool":0},"ncPLON6WTaObJC1D8kQuEg":{"text":"Totally worth it! The burnt ends of  beef brisket were incredible. Try the key lime pie ev","useful":0,"cool":0},"0cmVgRNa5GrwREpLgJ6YTA":{"text":"On a recent weekend in New Orleans, we got off the plane, picked up a rental car, and head","useful":2,"cool":1},"PHduLSFr5TzOaTYvpX0tYg":{"text":"The Joint smells deliciously inviting as soon as you've parked and open the doors to your ","useful":0,"cool":0},"gxX8zZOKzlYPcLCu5R9lsQ":{"text":"The Joint is a super cool and tasty spot to visit.  The food, space, staff and bar are all","useful":0,"cool":0},"3ox2P-MBSNtssjBHU0BvwA":{"text":"Ooooo so good! If you live in New Orleans and haven't been here GO NOW, if you are visting","useful":0,"cool":0},"0f1IsovX0vRllX7fMymQQw":{"text":"Came to New Orleans for a mini vacation.  Wanted to try some good authentic bbq.  Research","useful":0,"cool":0},"nrpIAIN4IioDSrv5HhfKjA":{"text":"I had read reviews of this place, but was not prepared for what I was served! The brisket ","useful":0,"cool":0},"Wq0nc84EwYJwubRJ6ChaGg":{"text":"Cool place to eat at. I got the brisket and my friend got the pull pork and 1/4 chicken. B","useful":0,"cool":0},"3uo2cT7TqpfUMfw7R4xMdA":{"text":"One of the best BBQ places anywhere. Smoked meats to perfection with a smoke ring of BBQ d","useful":0,"cool":0},"7zLDdot8sroo0hT-EMeOfw":{"text":"Oh my jesus.  This is the place that made me decide I definitely want to go to New Orleans","useful":1,"cool":1},"PGjyJ2qdgLg_KSDXHOng0Q":{"text":"The Joint is a local favorite and has the BEST Mac-n-cheese in town. The ribs are so tende","useful":0,"cool":0},"NsXaHecAUozWqPgS2eVbcQ":{"text":"BBQ is a very personal thing.... I can confidently say that the joint serves my kind of BB","useful":0,"cool":0},"wEbeV106a2oow6MM0xpXJw":{"text":"We took a cab out of the French Quarter when we were visiting NO. It was worth the fare an","useful":0,"cool":0},"K-n4vE-2gkeFT0v9Si5PJg":{"text":"I'm originally from Texas, and so it's truly tempting to disparage the overall quality of ","useful":1,"cool":1},"T_eqqyZBveMhJKM2m5S-1Q":{"text":"Came here to try their ribs and, while waiting in line to order, was told that they're out","useful":0,"cool":0},"EQCXskYJBnhUvEFtcS6K_g":{"text":"We ate at The Joint last fall after we had seen Guy Fieri talk about it on Diner's, Drive-","useful":0,"cool":0},"wUy3whsRmY-bYHCxPpJ8LQ":{"text":"Oh. Yeah. Pretty amazing brisket for sure. Also, I don't agree with other folks, I thought","useful":0,"cool":0},"oI-MaxZuDjtVCEgAVfVIuA":{"text":"U can't go wrong here! We tried brisket, pulled poke, links and ribs.  Only regret is bein","useful":0,"cool":1},"4Eo2_-hdP-8ht5TjdBrTpg":{"text":"5 fucking well deserved stars man. This place was fast, the food was amazing, and the staf","useful":0,"cool":0},"o6aqqwf25Deol0b2kn_ljA":{"text":"In New O. for a trade show. Looking  for something different and found it at The Joint. Ha","useful":0,"cool":0},"a1RAcPvkABwP1MJNldkpHQ":{"text":"Seriously, the most outstandingly delicious peanut butter pie I've ever had and I've had m","useful":0,"cool":1},"nawy3DbnLdiVqcYb0vvcgw":{"text":"Hands down, this is THE BEST barbeque I've ever had. I dream of their great big stainless ","useful":1,"cool":0},"hi4vKJm__g3GP5traxmcGA":{"text":"Cant believe i havent written a review as many times as i have been to this place. They ha","useful":0,"cool":0},"XjeC2MehPDLSm24zPVU6qw":{"text":"Seriously the best BBQ I have had in New Orleans. We got a sample of everything and we sti","useful":0,"cool":0},"7uDEi2x2F4iIfG0IkHWglw":{"text":"Partook of the Joint over the holidays and got high on the food! We ordered the ribs and a","useful":1,"cool":1},"IRikmZd1Qij_tUwbnX46Aw":{"text":"Awesome ribs!! On point with Texas! Great selection of beer & wine too, chill area of bywa","useful":0,"cool":0},"3hAGlQJiPu23F_jVlAjT3g":{"text":"Yesterday we went to the joint for some bbq. The last 2 weeks we have been travelling thro","useful":0,"cool":0},"Z5cJklbeXfXVX_DFRmWLrw":{"text":"I am not an expert on BBQ but was I lucky to find this place.  My guide book recomands Byw","useful":1,"cool":1},"8FvHN7owEKjdmhUnBOQXZg":{"text":"When we sat down after ordering at the counter I looked around. Adorning their walls was a","useful":1,"cool":1},"_EkM_04HeBPkUZx1E0l_GQ":{"text":"This place is amazing, and let me qualify that a little bit better.\n\nFirst off you can ord","useful":1,"cool":0},"NYMJWmWfQb4ih8vfiFZIEA":{"text":"Seriously, this is as good as it gets. I've had the best BBQ in SF and LA, but while in NO","useful":0,"cool":0},"CbwN4GgPMhh5pW6f_VVViQ":{"text":"Great food, great selection of booze. Ordered pulled pork, slaw, burnt ends, baked beans, ","useful":0,"cool":0},"5lvbiNIsSHJPJfRKgXMmtA":{"text":"WOW. I have eaten some great BBQ and this is at the top of my list. The brisket was out if","useful":0,"cool":0},"RvjCzlNT9YHSXtdfx0ijDw":{"text":"I didn't know what to expect when coming here but it blew me away! The best ribs I have ev","useful":1,"cool":0},"vi3RQ04CHzB6apSpa5793g":{"text":"I recently decided to try this place as I believe it is often off-the-beaten-track places ","useful":1,"cool":0},"ZL28HkMYRSuETKpoJO3A4A":{"text":"Very chill place.\nThis was my second restaurant to try out New orleans, Louisiana. \nWe got","useful":0,"cool":0},"ftIdjZeYupPREFIdeMLc8w":{"text":"Home made peanut butter pie, where have you been all my life????  They make some of the be","useful":1,"cool":1},"or_P19RsOZRY36Bo8SAQbA":{"text":"This place is the bomb! The ribs had meat falling off the rib. The potato salad was excell","useful":0,"cool":0},"U4MykEtOTe25KyRreTM4cA":{"text":"Where to begin....ok GaRbAgE.....no way baby backs should be dry and I'm not talking bout ","useful":1,"cool":0},"OysRkrDQdxyRrziFDWEyHw":{"text":"So good!  for this place being so close to home I had never tried it until tonight. I trie","useful":1,"cool":0},"qUvc_0p2OA5cic_WLHb8fQ":{"text":"This place is such a hole in the wall and looks all sorts of sketchy on the outside. But t","useful":0,"cool":0},"-Nc7x0EJk2xzVsob40bA9Q":{"text":"Best BBQ in New Orleans. I have had every smoked meat option they offer and have either a ","useful":0,"cool":0},"3OgKtqYIWS3G7hZEwuGUrg":{"text":"Amazing flavor had the 3 meat two side combo, portions to share it was great, chicken was ","useful":1,"cool":1},"qHJwC0zf_MwevuWVGeVM2g":{"text":"FINALLY got to try The Joint and I was oh so excited!\n\nI don't know if The Joint is the be","useful":1,"cool":1},"iw5O6OjMw8Qzq1w_Sk3_VA":{"text":"This was my first exposure to Carolina style BBQ. Absolutely delicious. All the food I tri","useful":0,"cool":0},"DMpHig1aQKlSVpqRwETBAQ":{"text":"I'm always nervous coming to a place with a lot of hype, but this place serves up some del","useful":2,"cool":1},"u9Yy_zRLwvi8knUnsAXaCA":{"text":"In a town not known for BBQ, The Joint is the exception.  And it's like eating in your dru","useful":0,"cool":1},"hb_v5RwmykgXVX9m9zl2GA":{"text":"So I was in town for the holidays and my brother-in-law wanted to come here for dinner (he","useful":0,"cool":1},"P_Ui5FFIi9Lpy0oxOLhoWQ":{"text":"Picked up 1/2 rack of ribs & pulled pork sandwich to bring home.  Ribs were excellent- mea","useful":0,"cool":0},"OUOg6zPe6p9DWvre-vyKHg":{"text":"We trekked from Gretna to Bywater for this and let me say--the ribs are worth the flossing","useful":0,"cool":0},"KIei4ebXIbTYu0oiYo_k3Q":{"text":"I dream of this place in my dreams of flying pigs during pink floyd songs in a city of jaz","useful":0,"cool":0},"dVrbTYYC-06WfeQ5vF46qw":{"text":"Great BBQ for dry rub. The flavor is throughout the meat doesn't need sauce. Coleslaw was ","useful":0,"cool":0},"XVk7-2Vg--3LDUyTiXJsgA":{"text":"Was visiting from California and wanted to experience some seriously legitimate BBQ while ","useful":0,"cool":1},"_9pgaiQBqpuQN1dRyM8Kag":{"text":"Ribs are slow cooked to perfection.\nThe sauces are very tasty and distinct.\nPrices are ver","useful":0,"cool":0},"3d1SAK-ugdnq-4GtJ-_LgQ":{"text":"We are 65+, travel extensively and love Barbque.\nThe ribs (Peter's report):  Ribs were goo","useful":2,"cool":0},"FEFZmzfLKZHsxk-jK6bo5A":{"text":"I know, I know. You walk up to The Joint and you question whether to walk in. You see the ","useful":0,"cool":0},"DgwrL8IgnOF_xW4vmaOKmg":{"text":"It does not get much better than this for BBQ.  The portions are huge.  The meat is tender","useful":0,"cool":0},"x56rQX7BvzwYFs8IpPyzBg":{"text":"Lived in NOLA for 10 years and finally went to this place.\nNot impressed at all. Sides are","useful":0,"cool":0},"xtp06O9QsJJButGtnz5trw":{"text":"So. Tasty. I read so much about this place and so it was high on my list. It didn't disapp","useful":1,"cool":0},"StBZX-PLLva12vmcNI7njw":{"text":"Ahh, the Joint.  Meat's what's in order here, so vegans, don't bother.  The chicken is fal","useful":4,"cool":3},"_JZHuzhhs9pJZKG8YzmjJg":{"text":"The BBQ ribs, mac and cheese, and link are all 5 stars.","useful":0,"cool":0},"7pqAGopWjSNEshHoIRZ23w":{"text":"I feel somewhat guilty giving them 3 stars for my experience because as a vegetarian, I sh","useful":1,"cool":1},"rnhGSq0zW6hnTi3gkVXrsw":{"text":"I have never had such incredible BBQ. I don't like pork, but those ribs are awesome. I am ","useful":0,"cool":0},"CePAt6PFB5tQUiyRUObNZQ":{"text":"OHHHHH EMMMM GEEEEEE! I can't say enough about this place, only that I wanted to go back t","useful":1,"cool":0},"Eh3_SjTEHmeJ-e5gl_ID7g":{"text":"So I finally made my way to The Joint to see what all of the yelping was about. I had this","useful":3,"cool":3},"vJ7_eyXN_fAdzVPRkruUcQ":{"text":"The brisket changed my life. It was the best brisket I've ever had in my entire existence.","useful":0,"cool":0},"b7gLDZausSjhB7M96K9obg":{"text":"HANDS DOWN THE BEST BBQ PLACE EVER.... \n\nI got the chance to go here for the 1st time a co","useful":2,"cool":2},"cVqv8b8-Ng8DEyxkM9gEfw":{"text":"Get the ribs. I'm only here for 6 more days and I plan to go back again. Awesome atmospher","useful":0,"cool":0},"iADOIRRiWrcMesMeZ_Upxg":{"text":"The slaw..the Mac n Cheese...the BBQ...and the atmosphere...It's a lil piece of heaven dow","useful":0,"cool":0},"PXUCm_UK32uwI2Ci9xvodQ":{"text":"4+ stars. I was a bit skeptical of this place, given the hype (Food Network et al.), but I","useful":1,"cool":1},"HOiFHC7K1Hv7nI-JgxiZNg":{"text":"Another Brooklyn-esque spot in NOLA. Def recommend for BBQ!!","useful":1,"cool":0},"RRlsX2yruwfnMhFECNc6rg":{"text":"I'm not huge into bbq so i'm not an expert. Had the W special of ribs, brisket, and pulled","useful":0,"cool":0},"a4xyBaVOypuIg9o24xNubw":{"text":"Okay, this place should put any other BBQ place in NOLA out of business. No comparison, th","useful":1,"cool":0},"an2Z21e9PZpwm8g8mmneUA":{"text":"if you want authentic bbq, this is the place to go. amazing pulled pork, Mac n cheese, etc","useful":0,"cool":0},"taa4xeI2T059DS-Rop4Q9A":{"text":"We walked into this little divey place and were wowed!!! On tap were slushy screwdrivers m","useful":0,"cool":0},"NYX9V35P16HeWlMkxl8ckQ":{"text":"ok bbq place. \n\nNothing wrong with the food, but there was a lot of hype about this place.","useful":2,"cool":1},"GTPXYdoVc6D8-Qp1UmJIfg":{"text":"I bestow five stars to any restaurant in this earthly Babylon that manages to fill me up w","useful":1,"cool":2},"03m5SgXk7OfBdvvKtivtRQ":{"text":"Glad I was able to get to this *joint* my last time down to NOLA.  In the middle of Bywate","useful":0,"cool":0},"l_CpG5CJ_woycfHzEiw3UQ":{"text":"This little gem of grilling goodness in the by-water. The ribs stole the show as did the n","useful":0,"cool":0},"gCzzBkN9GHZ4hB33JEaYww":{"text":"It was just as we expected. A friendly different environment where locals appreciated good","useful":0,"cool":0},"2Rr4JIaEvopD_I32cp-Iyw":{"text":"This is a Joint you don't want to pass.\n\nTry to get there early to ensure they haven't run","useful":4,"cool":3},"kRCD_wU69abSsVb7Zx5k9w":{"text":"Probably the best BBQ I've ever had. We had everything. I think the Brisket sandwich is th","useful":0,"cool":0},"DHlhxOIrp1jrxr7MthrL2w":{"text":"I was in town for the NEA convention and wanted some bbq.  There aren't a lot of BBQ place","useful":0,"cool":0},"NOekwUvoquqZ_Q6ReChLdA":{"text":"I'm visiting from SF & got on yelp looking for good BBQ, I obviously did not find it here ","useful":0,"cool":0},"J91TSRjPOlN1UmZ69NG-Iw":{"text":"Apparently, DDD has gone to the head of the manager / supervisor or whom ever Cheryl is-\nI","useful":0,"cool":0},"nhkXJ3HyfUo7QleSU-0Qug":{"text":"Re-visited (for the hundreth time or so) The Joint yesterday. And Pete & Jen continue to s","useful":1,"cool":1},"QUTwJIxtxVo72NKha4A6SA":{"text":"Excellent bbq and service. Tried the sausage and ribs two meat plate with the potato salad","useful":1,"cool":1},"SpXvOxciJ3BjeHFVxepyTg":{"text":"This place is freaking amazing. It's a little off the beaten (tourist) path but totally wo","useful":2,"cool":0},"FIGCFgMkoYbWShux-KGxEg":{"text":"friggin bomb!!!\n\nsecond time here and still so yummy!!! \nsplit the 2 meat, 2 side combo wi","useful":0,"cool":0},"faLEz4a19Yfgb0e5KKlzCw":{"text":"This place beats half the places in Austin for brisket quality.  Melt in your mouth goodne","useful":0,"cool":0},"Hd7KUS8cBzUMnfw9tfxk0Q":{"text":"So after hearing about the fabulous brisket, I wanted to eat here. Because they were out o","useful":1,"cool":0},"HW5Dkeed15GYasCO9RT-ew":{"text":"I had the pick 2 meats of brisket and pulled pork.  Side of salad and Mac n cheese which w","useful":0,"cool":0},"HgpUSur7JSWFnROaroo3Nw":{"text":"Don't let the outside fool you, the food was excellent. We had the pulled pork and the bri","useful":0,"cool":0},"LhFUgF7mJfO8oq7bI34dVQ":{"text":"The best BBQ I've ever had in my life! I'd had my fair shares of BBQ and I'm telling you h","useful":1,"cool":0},"R6tobqIFIc7UWB1rSAhMew":{"text":"I was in town for a week. One week, seven days, 168 hours (give or take a few). I ate here","useful":8,"cool":7},"SZX5yvzwfO4M7gVCMStUfQ":{"text":"This place is smoking, hands down!!! A must eat.... the pulled pork, ribs and brisket chil","useful":0,"cool":0},"yD464zOUhKmV1LWpHPvLHA":{"text":"Ribs, brisket, mac n' cheese, homemade pickles... This place is great, especially for meat","useful":1,"cool":1},"eBBF_fceGSjH2__3qDqeeg":{"text":"Although we live in Metairie, My husband and I often drive to the by water just to eat at ","useful":0,"cool":0},"ByZSny169Yz131cRSoxrKw":{"text":"The Joint is slap-down the best BBQ I've had in Nola. The pulled pork is juicy and light (","useful":2,"cool":1},"JQ-UT4xBcX6JbkspcTNU5Q":{"text":"Oh how I love BBQ, especially when it's done right. The Joint did not disappoint! Fantasti","useful":0,"cool":1},"NLHbKVZQKvLbHwNQtXd2FA":{"text":"True BBQ in the bywater. Loved it all. Reminded me of a true southern bbq joint. This is t","useful":0,"cool":0},"LQZSKfd7n7WlXUBeZimCNg":{"text":"This was my second trip to The Joint. Still delicious as the first time....if not better. ","useful":1,"cool":0},"UgVFoEM0WpGMFAXLaRbk3w":{"text":"Get out of the French Quarter and get over here. I tried a three-meat platter. The pulled ","useful":1,"cool":1},"yIEQwDprWvjlW98KiH1P3A":{"text":"Best damn BBQ in NOLA. No other place compares. The smoker starts rolling early and the me","useful":0,"cool":0},"hJjlotwmnRGiCcBUeEoLdA":{"text":"I finally went here after great reviews from friends and I couldn't believe what I'd been ","useful":0,"cool":0},"iViiKdBdh7UBL-EZXOD1iw":{"text":"I stumbled upon The Joint one afternoon while showing a couple of out-of-towner's around t","useful":1,"cool":1},"gHUf5SapIt150d23G9PIsQ":{"text":"We should've known that this place was great based on the recommendation from Urban Organi","useful":0,"cool":0},"NNjmSPIXjZhdxBTcA8O8Rg":{"text":"I am not a big fan of BBQ at all, but this place is to die for. I must say this place tops","useful":0,"cool":0},"OGrZHWSySnaOmlZE8A6TFg":{"text":"I was right away blown away by the vintage posters on the wall. Soon as I walked in I clea","useful":4,"cool":2},"QxxdJVcuf0Aag09fKg0wbA":{"text":"We are not meat eater but we had to try this place. It felt local and the food was just pe","useful":0,"cool":0},"b-ClhSbYNWxwjXnWdv1R1w":{"text":"My husband had been dieing to try this place for some time.  I was always skeptical becaus","useful":1,"cool":1},"HxdCOP5cuGkhclsKsrXKaw":{"text":"Had the brisket sandwich.  Ridiculous!   Tender with great flavor.  Real homemade mac and ","useful":0,"cool":0},"05zaSMZBUNh89ixV07J8Aw":{"text":"Wish I could give it a 5 star because the food was great... But my mother and I were treat","useful":0,"cool":0},"9gMkkbuGX7r-PBbmyzuHdg":{"text":"We went for a late dinner after drinking at Bacchanal. The Joint doesnt look like anything","useful":0,"cool":0},"bsvYm3DlUGt-A0GYBMOiRw":{"text":"Went because we saw it was highly recommended. It might have been that we had set our hope","useful":0,"cool":0},"tM4JswsnDv5trzPIfwyYSg":{"text":"Found this place on Yelp. It definitely did not disappoint.  Very good bbq. I had the thre","useful":0,"cool":0},"Ff_arop1jqQ9iz1hJVIuPw":{"text":"My friend brought me here when I came to visit in NOLA and wow! Amazing. It is such a memo","useful":0,"cool":0},"Y_vnnIxeRvO4Ec7hmeeu0Q":{"text":"Southern food is okay; I can say that I am not too crazy about it and to be quite honest, ","useful":0,"cool":1},"bv8XNxgDTUbNnVk5Fx7Ppg":{"text":"Looking for a place in NO our first night in town with 12 people. Yelp showed us The Joint","useful":0,"cool":0},"0aWkB2g8NDBYMOUO2CRBTA":{"text":"First time! Awesome BBQ. The brisket is the BEST found in NOLA.  In addition to the briske","useful":2,"cool":1},"S-8wMwIOa8pCIDw3LsRZew":{"text":"I love the fact you can get individual ribs, sausage link and 1/4 chicken, it's a value me","useful":1,"cool":1},"z0wHhhvhl8URPLibp1UOiQ":{"text":"Amazing Labor Day lunch with mouth-watering bbq. I love anything bbq, and this had an outs","useful":0,"cool":0},"tZKfeBGr7k23_usRA7JNsw":{"text":"Don't see what all the hype is about , had way better BBQ at home . The sauce had no label","useful":0,"cool":0},"UH4WwqRFvvU7RyKiLFQmwA":{"text":"Snapshot: 5/5 BBQ, 5/5 Price, 5/5 uniqueness\n\nIf you like smoke, hit up The Joint. Amazing","useful":0,"cool":0},"chkRzx-eY9oEDN9Xu2f4jQ":{"text":"Perfectly good barbecue. I certainly enjoyed it, but it isn't as amazing as some of the ot","useful":0,"cool":0},"hk-yvn0RoDG4ql_JTY7vvg":{"text":"Best BBQ in NOLA in a fun, funky place that just makes you feel good.","useful":0,"cool":0},"scLBkyDwj3QaMZClxEH7Ag":{"text":"Maybe I was just craving BBQ, but this place was awesome.  They had, probably, the best ta","useful":0,"cool":0},"EZZWjht0uEgwmTEbMggegw":{"text":"I don't think any other barbecue I have will live up to the food I ate at The Joint. It. W","useful":2,"cool":2},"Tbi8hzLSxkkPXXfIL2LQGw":{"text":"I love me some BBQ.  If I wasn't with locals, I wouldn't know to be here.  I love how unas","useful":0,"cool":0},"Vh8wGZpZ5AiMpaxjQIAkCQ":{"text":"Our best experience in New Orleans!\n\nWe were very unsure of the neighborhood but ventured ","useful":1,"cool":0},"Esz6e2aLk7yruEWhJPYQRg":{"text":"You are here for one thing.  Ribs.  Smoked, spiced, and barbecued perfectly.  First time h","useful":1,"cool":0},"P6OAAM7n358-EGRQ2L3IYA":{"text":"In a city where the BBQ struggle is real, (let's be honest, folks, it is) The Joint provid","useful":0,"cool":0},"W5dbq6iHczqDhng-AXqWwA":{"text":"wow...what a huge difference from the old location...both good but mostly bad. the good is","useful":0,"cool":0},"82Ag1uWok_6grrnCcdbaMQ":{"text":"I do love The Joint and I go pretty regularly. The space is frills-free, but still does no","useful":1,"cool":1},"w--4swjjVjMEv9d_BpdhMQ":{"text":"Ok, first I need to say this this review is based mostly on personal taste rather than jud","useful":3,"cool":1},"jQ4bWtAqL9Zg1sgk414EXg":{"text":"Ok, to pile on the bandwagon-- this is great food. It is not the Columns Hotel. It does, i","useful":2,"cool":0},"Hz6lJ3sDsFckM5gWMXc6iA":{"text":"Flat out, the best bbq ribs I have ever eaten.  Had ribs, brisket, cole slaw, awesome pota","useful":0,"cool":0},"uZDaOXnlt2qAwvA8eD0tvw":{"text":"best damn BBQ on a street corner in the bywater.i love new orleans.and the waitress cheryl","useful":0,"cool":0},"gRfLKASb_ct0s-VosEoZEw":{"text":"Cute spot, friendly and awesome service from everyone, well priced and delicious!\nWe just ","useful":1,"cool":1},"xO3yovvHxjr3_ycDadag1A":{"text":"Cool place to get some great bbq. We tired a little of everything. The meat fall off the r","useful":1,"cool":0},"zs5r8jLy0Pu3yTnho7_C8A":{"text":"Yeah.  This place was awesome.  Go here.\n\nI am by no means a BBQ expert, but it doesn't ma","useful":1,"cool":0},"qo4VpvqdBvZTt5CUHYBjlQ":{"text":"Disclaimer: I grew up in New York.  Even though I've lived in the south for more than a de","useful":0,"cool":1},"iU048-cW9Y8HMU7A2VgQJQ":{"text":"Beet BBQ I've ever had and it's not even close. The burnt ends were unreal. All of their s","useful":0,"cool":0},"uSNNrADX2QcMwbkRmUrHRQ":{"text":"If you're looking for a bbq place that won't let you down in New Orleans, THIS IS THE PLAC","useful":1,"cool":1},"wc_GMNdf1CSfd75bZfoGNQ":{"text":"Lots of beer, lots of whisky, lots of meat. \n\nI had the Mac n cheese and another side whic","useful":1,"cool":2},"6M3QIJL6mQpJc_E6Gt0R6w":{"text":"Usually pulled pork is a distant second to ribs for me. But the pulled pork at The Joint i","useful":0,"cool":0},"8Hs5vdD00tVMUlxY8Jt4zw":{"text":"I had pretty high expectations and this place delivered. Guy who took our order patiently ","useful":0,"cool":0},"H1woD85MwEPUyt7tMaZnJQ":{"text":"The ribs were tough and needed to have the back membrane taken off. The brisket was not te","useful":0,"cool":0},"RVRwVNT1lFKnGJ5NlVLURw":{"text":"I was working on a Habitat for Humanity house about half a mile from here, and we ended up","useful":0,"cool":0},"PxdTTvMdMFZZDwLJPOPNMg":{"text":"I stopped there for late lunch and I didn't regret, place, music and food were awesome.\nTh","useful":0,"cool":0},"-onW0Dwtdwb7dJZfyCg1wg":{"text":"First time, never again. \n\nMaybe I had bad luck on the employee that served me. Honestly, ","useful":0,"cool":0},"p15fJUVsEHokxxFspsXXyw":{"text":"THE BEST PLACE FOR AUTHENTIC HOME MADE FEEL GOOD FOOD BY FAR!\n\nThe Joint is such an amazin","useful":1,"cool":1},"gVEZKHU0DiGMTG2GVepJ7g":{"text":"Once again, we went to the Joint. My husband loves it. Me, not so much. Unfortunately, due","useful":1,"cool":1},"Q2NXW6lwtsQ2BEY2UeNq7Q":{"text":"I make a mean Mac and cheese and have ruined all other Mac and cheeses for myself. EXCEPT ","useful":0,"cool":0},"XJaPCfvbKRAaoBDKDcy5FA":{"text":"As I travel more and more I am discovering that Memphis has some serious competition when ","useful":10,"cool":3},"2XAJ-pG_leyrmZMcEWB-5w":{"text":"*Tourist Trap* ! I was fooled by the glowing reviews on here and google and it being featu","useful":1,"cool":0},"X6WeYUcf1vmyXRO-qx4JAg":{"text":"First time stopping by to try out some of the best BBQ joints in NOLA and this place was p","useful":0,"cool":0},"bwaHCE1BN6JDbHTkbXcBzQ":{"text":"This place is so good!   I had been craving BBQ and this place did not disappoint.  I had ","useful":0,"cool":0},"pdamGJ9AElyjCfd9PvRJTg":{"text":"I went here for some BBQ. We got some ribs with some sides of cole slaw, potato salad, and","useful":0,"cool":2},"PFw0IIJM9K_CRVhqDzNy-Q":{"text":"After asking some locals about where to eat, The Joint was mentioned a couple times and gi","useful":0,"cool":0},"NLeN51YTi4qUhtJf7Hd6Og":{"text":"For some reason when I eat bbq in the south I want collard greens too. You won't find them","useful":0,"cool":0},"zj8rJb4nJVKYNGSmHwIyYQ":{"text":"Great BBQ! Great folks! This is a mist have when ever I am in the NOLA area. I have tried ","useful":0,"cool":0},"cFyC4hdS4MgLCZ24-JIWNA":{"text":"I'll get to the point right from the start...this place is great! I'm not an BBQ Officiand","useful":0,"cool":0},"0S2zOOsHt62UXAh--5oi9A":{"text":"I have always closely linked the Southern United States with BBQ culture. In most of my tr","useful":1,"cool":1},"AwzoWrBVoSAdIN6F46wqSw":{"text":"Loved their pulled pork sandwich.  It's blissfully good.  I would definitely make this a d","useful":0,"cool":0},"nuHLnMXFFZVcUioxe8SSGA":{"text":"One of our crowd said this was the best bar b que she's had in her life. I say it was in t","useful":0,"cool":0},"Fn40otLcX8WJzpfex2ojaA":{"text":"This place is amazing. Get the ribs and the beans and you won't be disappointed. The rub o","useful":0,"cool":0},"K267tPmm3W91EGiWEeywmw":{"text":"The ribs were very dry, but maybe that's what you prefer. I loved the beans though, so ric","useful":1,"cool":0},"lnPgcwcXNCxrQWwnJjcIlw":{"text":"Hands down, Best food we had in New Orleans! \nDefinitely worth the short uber drive from t","useful":0,"cool":0},"iAP5lNz_QmJvJGdqX_0wXA":{"text":"I ate a sausage made with pork. Probably the first one I have eaten in 20 years. \n\nFreakin","useful":0,"cool":0},"Ibj0kWaHbs4miPwiyg10LQ":{"text":"Holy moly this barbecue joint is incredible! I came here with friends who were dying for a","useful":0,"cool":0},"tfBVrGUdlUO3iDkXJ9z3Vw":{"text":"Excellent! Wow. Just wow. Amazing Q, killer drinks, great price point. Good music. It's a ","useful":0,"cool":0},"WwA8d21a1zdkL8qQX6FUVQ":{"text":"Folks I'm from Texas and take the art of smoking meat serious; this place is BBQ GOLD! \n\nN","useful":3,"cool":1},"JUS9p-w8bkd4ADlwTBnX0Q":{"text":"Good service good environment good fast service alots of strains 2 choose from ... I love ","useful":0,"cool":0},"LTj57gw7VkG7D79Rgk37UA":{"text":"Best BBQ place in NOLA. I only wish that it wasn't located so far away from me in the bywa","useful":3,"cool":1},"t6bzdaqbjIiUTwh6IvMMjw":{"text":"I visited The Joint for the first time last night (a Friday evening), after contemplating ","useful":1,"cool":0},"EZTCAhRpqPReRDh_BP9wiw":{"text":"The Joint is still the best BBQ I've had. I'm limited in my grilling expertise, but this p","useful":2,"cool":1},"aMqpzScgOXbCb-HpJ8-_EA":{"text":"Loved this place. It's a bit off the beaten path, but definitely worth the trip. The smoke","useful":0,"cool":0},"qMyY52U8eDAZZLDpByf01Q":{"text":"Holy moly this place was good. My friend and I both got the pulled pork sandwiches and I g","useful":0,"cool":0},"skA7fAt8UY28P6iG-2aUGQ":{"text":"Stopped by here on memorial day in a mood for some BBQ.\n\nIt was busy, but that's a good si","useful":0,"cool":1},"COJ5XoKGC8XRFH46akZ4iw":{"text":"This is the best American food that I Have ever had.We just met the restaurant by chance. ","useful":0,"cool":0},"9Z_YAulTqweSXisJNXGRlQ":{"text":"Everything was done extremely well.  Good value relative to areas more down town.  Worth t","useful":0,"cool":0},"o4qzvIdk9AE87rTjvBAi3Q":{"text":"Easily one of New Orleans best BBQ restaurants, and it's got the authentic gritty vibe tha","useful":1,"cool":0},"-51J4uZhZnG5z3PttePIUw":{"text":"One of the best bbq in NOLA. Parking is limited, tables are limited but it's so worth it. ","useful":6,"cool":4},"6ZSa8mLe34Tr80YIA4s8Qw":{"text":"It may be sacrilegious for me to rate this 3 versus the 4 stars that I'm tempted to do, bu","useful":4,"cool":2},"xlwGOag0u_f8WXulasea2A":{"text":"I \nI saw this restaurant on Yelp when visiting NO and thought I would try BBQ. When I live","useful":2,"cool":2},"tKOQltteuwZiZmPxPyqn-g":{"text":"Great BBQ ribs at a cozy and friendly neighborhood joint. The white beans and cole slaw we","useful":0,"cool":0},"oO4JsD8NKHvB2rfyqoGUuA":{"text":"Getting there is an adventure and a must when visiting New Orleans. It's a part of the Big","useful":0,"cool":0},"mtUc_zBuMVHYgK9-S1CNXw":{"text":"Granted, I did not grow up in Texas, Kansas, Memphis or the Carolinas, but this is the bes","useful":1,"cool":0},"XGjE5G0SfglHHZlyNqGo4Q":{"text":"Outstanding. We're in town for a few days and didn't want any more fried food and grits, b","useful":0,"cool":0},"fnJEcUCarynoy_CIwUKgPg":{"text":"This is my 3rd time at the joint. This place is definitely New Orleans style bbq. Which me","useful":3,"cool":0},"eCFBfzPs0hiLI8-MhbTcJQ":{"text":"Them ribs!!!!! My wife and I split a whole rack with potato salad and cole slaw. I gotta h","useful":1,"cool":0},"MkRcd9TooUheF5GHPV8FAg":{"text":"If you're tired of all the typical New Orleans fantastic local cuisine and have a hankerin","useful":1,"cool":0},"CacGE-f2rwfjJMOajvB6nw":{"text":"I feel weird about giving so many high reviews today, but The Joint earned this one. I'm n","useful":4,"cool":0},"LAhz9CsLMlaMJq1eQcCl5A":{"text":"A hole in the wall Southern BBQ spot. My Uber driver told me about this spot and I'm thank","useful":0,"cool":0},"9UWHhRa0yg-Stu1n_yS05Q":{"text":"Disclaimer: I went at closing time on a week night\n\nI judge BBQ by the establishment's bri","useful":0,"cool":0},"k2gigr30Yoi4nyqRRaeOfQ":{"text":"love the joint...  its as nola as it gets...   the juke box, doctor bob signs, tea, picnic","useful":1,"cool":0},"WYW4RfNiPcNrysCqKTpvSQ":{"text":"We tried the pulled pork, brisket, and chicken. Everything was absolutely great. We wanted","useful":0,"cool":0},"PyvdRyP9OzI77qEFb4pUKQ":{"text":"Came here for lunch with my family. Had a full rack of ribs, pulled pork sandwich, Mac & C","useful":0,"cool":0},"Y0r2nxLvJfDowWoY75ofNQ":{"text":"I have been to the Joint about 20 times. It is a great restaurant for locals and tourists.","useful":1,"cool":1},"3gKkFbWgXq_VEcYQQ4FMOw":{"text":"The brisket and ribs melted in our mouths and The \nMac and cheese, potato salad and cole s","useful":0,"cool":0},"HcbK35rqKfDcN0a8_pzR0g":{"text":"This was an amazing treat while on vacation in New Orleans. Off the beaten path but well w","useful":0,"cool":0},"tWeumkAkLrO7xkBGCn2c1g":{"text":"Solid food. Dry rub on the ribs was fantastic. Brisket was done appropriately and mac and ","useful":0,"cool":0},"dOOVfOgRLstMr4HXX42ieQ":{"text":"One if the best BBQ restaurant in the New Orleans area.  Have been here many if times and ","useful":0,"cool":0},"PvKfPFP_MumBeqNY41PnSg":{"text":"The Brisket melted in my mouth. The Ribs were hella good!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","useful":0,"cool":0},"tQ7-aQXFJtfYHAAEd2qXRw":{"text":"The BBQ was good but not great. As a southerner, I've enjoyed some good Q and am very pick","useful":0,"cool":0},"H2gQwUr7Uf4sRHF8lB9_hg":{"text":"Went to this little spot twice in one week while visiting Nola! Couldn't help myself lol. ","useful":2,"cool":2},"Nu9lgV-2W8SFU7TSsZqaAw":{"text":"When I was preparing for my trip to New Orleans, I had a lot of people warning me that it ","useful":6,"cool":3},"YDbN8Ko38Gd8AznNwYR1TA":{"text":"Only been here one time.  Being a local, I've passed this place up before and paid it litt","useful":1,"cool":1},"8zD0zunCtuGdYMIIJGYVgg":{"text":"The food was good!  But what we really really loved were the desserts! We would trek all t","useful":0,"cool":0},"KLVAphYUnT4eDa8lWxc-CA":{"text":"This is a legit BBQ place. The ribs are tender and flavorful however mine were served at r","useful":3,"cool":1},"D_yPZifZp-xOYXPzacHb0w":{"text":"This joint would have gotten 5 stars had it not been for the actions of ONE employee becau","useful":1,"cool":0},"3X0ptp1FnjLehqvtLwp3lA":{"text":"We had this on our list of places to check out while in town an we were not disappointed. ","useful":0,"cool":0},"HN0uh5cnQubRBwqdFn_-vw":{"text":"Excellent BBQ that provides a nice quiet getaway from the noisy French Quarter. The ribs a","useful":0,"cool":0},"6FmdIeaTqgrC-V5GVbGNzw":{"text":"Extremely satisfied. Place is dog friendly and while visiting we were with our 3 dogs. We ","useful":1,"cool":1},"2JqHWoTTP6nMI6EAWwEpIQ":{"text":"Everybody agreed on our trip top new orleans that this was some of the best ribs we've had","useful":0,"cool":0},"5VL6K-3OAQv4f9FjjHL4dA":{"text":"YES.  As I was enjoying my reasonably priced pulled pork plate with greens and mac'n'chees","useful":1,"cool":0},"M8njEDTX74CT-csHyv6s7w":{"text":"408 people (oops-now 770) can't be wrong.  This place is the greatest.  My order was ready","useful":1,"cool":0},"FEDSbLEMJSzqJRYF6KCVLg":{"text":"OMG avoid this place like the plague, woman that looks like a monster with tattooed face b","useful":3,"cool":0},"S18uGiwN2wlnpt2j_l9QbQ":{"text":"How could you not absolutely love a place that has a meat smoker on-site?! I usually get t","useful":2,"cool":3},"Vm6ydvXGGgyQfUSvIK22Ow":{"text":"Had the ribs and Mac and cheese. Both were amazingly tasty. Cute little joint. Service was","useful":3,"cool":1},"j4_vxq-jD0ahDETBaufkww":{"text":"I only write reviews when I am disappointed , The Joint disappointed .  Got there approxim","useful":0,"cool":0},"6Svx3UNNr90otYcGN4lbmw":{"text":"I did my research on the best BBQ place in NOLA and in many search results this place came","useful":0,"cool":0},"OZNhPuzCOpXbE_3696mJBw":{"text":"Being raised in the West Coast, I pretty much assumed every southern state would be satura","useful":3,"cool":0},"99b-NYewOGzE7ZQFa6AqlA":{"text":"Tasty barbecue, cool bar in the Bywater. I had the smoked chicken (which was delicious), b","useful":0,"cool":0},"bv3jvFPJEyfvd55ygHIwOw":{"text":"This is one of the greatest out of the way gems in NoLa.  The BBQ is out of this world and","useful":0,"cool":0},"Jjc2Dhweh_TGog4apTATIQ":{"text":"The ribs are GREAT!  But......Unfortunately it was the only good thing about the trip this","useful":0,"cool":0},"KRC9oEpWUoL7oxKthP7A6w":{"text":"Didn't know what to expect when we arrived to this place. It's in a sketchy part of town, ","useful":0,"cool":0},"ZZXKF14qllrPCB6dW5mLTQ":{"text":"holy toledo. i've eaten some\nsmoked foods in my day. and this place is just outrageous. it","useful":0,"cool":0},"Ag0Kk-zD3n1OIrSbrpXK-w":{"text":"I can honestly say I was expecting better but I also have a really hard time with this rat","useful":0,"cool":0},"eC2g3OOvc0ZOgB8omYpEXg":{"text":"Best burnt ends I've had in a while. They were super flavorful, not just charred ends. The","useful":0,"cool":0},"Weze3oG4KzeAdSneLljzVw":{"text":"Now open on Monday's (closed on Sunday only).  Still the best BBQ in the world.  \n\nAnyone ","useful":3,"cool":0},"DXvdd2MPC5kGkH4Y00lzAA":{"text":"The best barbecue. So delicious! Everything is good and the service was great. Would defin","useful":1,"cool":0},"ZJwZtrhbjCCZoK9NssiVQA":{"text":"I decided I needed to get out of the Quarter more, so I settled on this place because of T","useful":1,"cool":1},"aZleVapoa71TG0EbvhvVeA":{"text":"Just entered New Orleans. So, I heard bout this place on Guy's show Diners, Drive-In's & D","useful":1,"cool":2},"poRN7OJ5ZpWdwbdGq05kmA":{"text":"Passable bbq drawing a good crowd in a good neighborhood. Ribs were good, brisket fair, pu","useful":0,"cool":0},"o5Qtw7sSwcuL79keoYmm0w":{"text":"Best BBQ I've ever had. And I eat a lot of it. Ribs were tender and sweet - the dry rub is","useful":0,"cool":0},"Cp5Hu4DAZNjjItqAV8PWOQ":{"text":"Worst experience ever! Tattoo faced woman yelling and clapping her hands at people and the","useful":0,"cool":0},"u9NMxlg5lgaLnaAfIzaRYg":{"text":"I would leave 0 stars if I could. The food is good but they are always randomly closed via","useful":0,"cool":0},"UBcRU0aQkGyDzBtVOg29uw":{"text":"Literally, the best ribs I've ever eaten and please believe me when I say I do not take th","useful":0,"cool":0},"3LBgKYh5hlqtmNjGHWHoMw":{"text":"Would have loved to have eaten here however when we arrived the joint was packed and I att","useful":0,"cool":0},"38-xWYtI9cesJGfKl-OfKg":{"text":"Once again,\n Top notch BBQ. 8pm on a Sat. Nite during French Quarter Fest.  Always great!.","useful":0,"cool":0},"x0MrqF9d-yJXnSJSYonJQw":{"text":"The best BBQ I've ever had. I got the pulled pork plate which came with two sides (I chose","useful":0,"cool":0},"I_6HagzI9FbArgMVxFW_bQ":{"text":"This is a great order-at-the-counter, served-at-the-table place.  The menu is typical barb","useful":1,"cool":3},"nV_J9KFZM1U3FAOmXLc32A":{"text":"Second time at the joint. Had the two meat/two side combo...brisket and pulled pork/baked ","useful":1,"cool":0},"gpVtSf8-q-zxnRDPgNgfMA":{"text":"I came here with my wife based on local recommendations.  It is a bit out of the way and a","useful":0,"cool":0},"oeYrKzmteBwrX2HnZ6Mb5w":{"text":"Hands down one of the best bbq places in the nation! That's right I said nation (based exc","useful":1,"cool":1},"IGoBoxpkKtLX_HWIAGk4Sw":{"text":"Don't judge a book by its cover..... don't judge this place just by looking on the outside","useful":0,"cool":0},"Y80OO4A2Lmt3FeP4ODpJ7g":{"text":"If only this place had existed when I lived in the Marigny, what a nice walk it would have","useful":0,"cool":0},"ZdAQ_v6gB-qnlvb_3L7gBw":{"text":"You want tasty smoked bbq, The Joint is where's it's at. Go in and order at the register, ","useful":0,"cool":0},"0OX5Jgr1hWYa9p2ekJaSDA":{"text":"Not fancy and not slick, but who wants fancy and slick at a BBQ joint? It's all about the ","useful":0,"cool":0},"X5OCnS9UNodGyVuIwCGSkg":{"text":"Let me preface this review by saying I'm from California. We have tons of delicious food f","useful":5,"cool":1},"Snk1ctR8I9mfZw-J1ELsoQ":{"text":"Love this place in the Bywater! Fabulous BBQ, super nice people. Very casual. Pulled pork ","useful":0,"cool":0},"a-g6ETnONAgvr8HR66OuLQ":{"text":"Quite possibly the best bbq I've ever had and worth the trip outside the French quarter","useful":1,"cool":1},"GT04xEd02JHzeMff2jP7KQ":{"text":"Definitely worth the trip to find this place. Some of the best fall off the bone ribs I've","useful":0,"cool":0},"rZjlHvNqMve0iNViLtiEEQ":{"text":"Great barbecue. Simple, delicious and good value. The brisket is so tender and the ribs ar","useful":1,"cool":1},"euEplTlfKJ-XeoAVZ6KZvA":{"text":"My favorite BBQ in New Orleans!  Great prices. great customer service.  My favorite is the","useful":0,"cool":0},"F2DtbrsIcXkzqPQ0SxHq0g":{"text":"This place is proof that looks can be deceiving when it comes to great food. This little h","useful":1,"cool":0},"5R1e779HEKEWzr-iSeD1Kg":{"text":"This is one is the best BBQ places I've been to and it's a shame I don't live in NOLA. Don","useful":1,"cool":0},"eCKS0B5yDi0xjvMFjTAxlQ":{"text":"Wow! This might have been the best BBQ I've had in my life! The pork, and especially the b","useful":0,"cool":0},"7v2puKBzOd7nB974arNZsw":{"text":"Let's make this short and sweet. The best BBQ I've ever had. This was recommended by a lyf","useful":0,"cool":0},"Q0NWjevas7M2whNIytxCHg":{"text":"I love any place with lots of nola character and this place has it.  Small dining area wit","useful":4,"cool":1},"NQTXy7MfCIZKgMY1ouEeTQ":{"text":"Delicious doesn't even begin to explain how I feel about The Joint. You won't want to save","useful":0,"cool":0},"guqh8v7UT3of5af1sZ7FhA":{"text":"I've found it! A Barbeque Joint named \"The Joint\"! Great Atmosphere, Great Service, Great ","useful":0,"cool":0},"kVyuynRvnI0s_Yqd9vbqfw":{"text":"We Don't have BBQ like this in the frozen north.. no no no. My girlfriend and I happened o","useful":1,"cool":1},"cn4r3HnBi0JmDPsDRRFlRA":{"text":"This place has some very good BBQ. I don't really think of BBQ when I visit Nola, but this","useful":0,"cool":0},"wNgJtCgWNEOpuaOx_7NwOQ":{"text":"This is an unusual review. It speaks to the food but also what is the history of The Joint","useful":0,"cool":0},"G-jZN1ypwbA-xdFN0ARVgA":{"text":"FAB BBQ away from city center.  Packed with people but worth the short wait.  Good food, d","useful":0,"cool":0},"s7hlyqKquk6fBWy3hCyJJg":{"text":"Had the 3 meat combo tonight. The brisket was probably the best i ever had. The smoked ssu","useful":0,"cool":0},"dk1p7WbBPMb5KDMnUeOyZQ":{"text":"Very reasonably priced​ heavenly BBQ. The brisket was delicious, tender, and fatty, the ri","useful":0,"cool":0},"8dAG1OFRnV_XlxaeCoTnTA":{"text":"Great BBQ spot. I had the brisket, sausage, potato salad, and baked beans.  All were excel","useful":1,"cool":0},"hPidfWgDTyZJtr-WDSzmtw":{"text":"I've never had such good bbq before. I had chicken, brisket, and the ribs. For sides, I go","useful":0,"cool":0},"aVo6Vs7qIZo5uF2O6RMN8A":{"text":"So happy I went! I wanted good BBQ and I got it! I over ordered stuffed myself stupid thou","useful":1,"cool":0},"R9DatnLV-fkeBvb7Sizn8g":{"text":"The ribs were good, but the Mac & Cheese for me was a standout. For some reason it reminde","useful":1,"cool":0},"B8slDW_EIXPDQygsOqh2qg":{"text":"The ribs and burnt-ends were really well made. Only one of the 5 bbq sauces was decent...t","useful":2,"cool":0},"eNA1QJACPp9Vh6SuqLbUlA":{"text":"Some of the best barbecue available in the NOLA area. I recommend trying some pie on your ","useful":1,"cool":0},"RqCH56Eu3aPr0ssy08lgXQ":{"text":"Great BBQ, good keto options, dog friendly.  And for such a casual place, they have a real","useful":0,"cool":0},"1c5bhitLNvk9vbwux3Posw":{"text":"Some of the best BBQ in town.  Hands down! Sitting in the courtyard area is extremely plea","useful":1,"cool":2},"mH4s7xoGXlai4jFzlUzHTQ":{"text":"One of my goals when visiting another city is to get into the heart of the community and n","useful":1,"cool":2},"Bg8S6FUW5TOE69aan_ugXA":{"text":"Great food and a fun, unique vibe! The mac and cheese was great.","useful":0,"cool":0},"Hy1Bse2Y68E3dWVrWP8l5A":{"text":"We stopped in here with our guide, Robert, from Confederacy of Cruisers Bike Tour. Absolut","useful":1,"cool":1},"qsapn58_judyrFLWCY1Oog":{"text":"This is a famous corner BBQ restaurant in the local area of Bywater. The place is like a l","useful":1,"cool":0},"6nJYCfRAxTO6WuDWFgRxxQ":{"text":"The Joint has the claim of being the best BBQ in New Orleans. It is pretty good...but I he","useful":2,"cool":1},"vCHgqjhe2FF84X5Sr2GPhA":{"text":"Very delicious! Everything was delicious, all the meat is tender and it falls off the bone","useful":2,"cool":0},"iRPgfAcTJrjEthwTeuB5tA":{"text":"I've never had bbq this good. \nThis is an excellent little place with awesome staff and ev","useful":0,"cool":0},"dIc_xLwVS-Mwhcju6znurQ":{"text":"Great low key spot in Nola, went there 4 years ago and this last visit to NOLA they were c","useful":2,"cool":1},"quWISZp__0AkYbnncpXq-g":{"text":"Went to eat here on Saturday night - they are closed. Waste of $$ on Uber. No sign up and ","useful":0,"cool":0},"xnE_Fzdlsr2vqk9sPRs_CA":{"text":"Waited in line and just wasn't wowed by anything we got. Servers weren't trained to bring ","useful":0,"cool":0},"5eBq6f3RuPLOCdVHsf5EnA":{"text":"Gotta say, this place is up there with Franklin's in Austin. Clearly, by far, with no one ","useful":1,"cool":1},"p5sRIVJpdtrZ_-JedcMAcw":{"text":"I had the pulled pork and a side of potato salad. So good! This place is kind of tucked aw","useful":0,"cool":0},"KOwKtISIXMczEDKQDIso3g":{"text":"Would not return - burnt ends already drowned in sauce (never understood this - if you don","useful":2,"cool":0},"-rPvu35LRdWNSIMs0E5LQQ":{"text":"Outstanding bbq, best brisket I've had in many years. Ribs, perfect. Sides were outstandin","useful":0,"cool":0},"pf2UzC83vBcgSYODU2hfpA":{"text":"Food: 4/5.  Service: 4/5.  Best BBQ in NOLA!  Burnt ends, ribs, pulled pork, sausage, cole","useful":0,"cool":0},"HoociHSuaZ-x5ach576DTQ":{"text":"Uber driver recommended this place so we tried it. Couple blocks from our VRBO. Good BBQ, ","useful":0,"cool":0},"s3IwefTnA6x5lJHa-T9ZFA":{"text":"My Homegirls Hillary and Becky's favorite spot!\n    \n      Great amounts of food for the A","useful":0,"cool":0},"SOXT5liqfTldwq9W4N3fug":{"text":"Just go here. The ribs were amazing. The max & cheese was amazing. I hate potato salad but","useful":1,"cool":0},"92vdo9MnzwmN6WqlzSNuvA":{"text":"Yum to the Nth power!  The Joint is the real\nDeal and I'll be back soon. I'm a TXOK dry ru","useful":2,"cool":0},"6ve23Zj324mReEhhKKAkFg":{"text":"I ordered to go I don't think I should've had because I had bbq sauce everywhere this plac","useful":0,"cool":0},"747xSdWnOfwrT1cjbSOnyg":{"text":"HOLY BBQ! I honestly think that I may have died and gone to barbeque heaven.\n\nWhile this w","useful":0,"cool":1},"UjEpxf0xnvDCrkTh6DaIjQ":{"text":"We first saw this restaurant featured on DDD (diners drive in and dives) they are best kno","useful":0,"cool":0},"hL8MCiJPyzwCCYhMNY4RdA":{"text":"I'd give them 5 stars if they'd only had potato chips or mashed or baked but I'm not a fan","useful":0,"cool":0},"0wHaCP1YVcz6VuemcId5pA":{"text":"The ribs.....the ribs.......the briskets....melt in your mouth...the best.....don't you da","useful":0,"cool":0},"ZlrPimo6LrXU1KO0HQEY_A":{"text":"Really great BBQ spot in the Bywater. Portions are big and the pulled pork is delicious!","useful":0,"cool":1},"pBDDYHD9SOQ-hW_5lGvqHA":{"text":"Hard to believe a place like New Orleans would have BBQ like this. It's a hole in the wall","useful":0,"cool":0},"C00ezoNEJ15xCaIk4AdSag":{"text":"The chicken, bake beans & coleslaw were just OK! The BBQ sauce was on point! Don't have to","useful":0,"cool":0},"StdY_bnGbHkMRPogP_4edA":{"text":"\"Oh yeah oh yeah oh yeah\"\n\nAnytime you hear that coming from a neighboring table, you know","useful":19,"cool":11},"njivg5yH6QM37myAnRy2sg":{"text":"Probly  thirty times I've eaten here and not once a bad experience. BBQ is Smokey, seasone","useful":0,"cool":0},"cttkPzBwnS0J2ooCutOLig":{"text":"Great dive bar barbecue joint in New Orleans  about as local as you can get. It's in the s","useful":0,"cool":0},"oyefml1HfufquxHy4Ql0Uw":{"text":"My first time visiting New Orleans and we stopped at this lil joint on on first night. Top","useful":0,"cool":0},"n009wXBSV1bPo6OelUiuSQ":{"text":"When I loved here in the early 2000s, I could never find BBQ, specifically brisket that I ","useful":0,"cool":0},"zyAX4ci_mkOlIG2YE06KVw":{"text":"Hands down, best BBQ in the Big Easy!! The winner winner chicken dinner is that the crew w","useful":0,"cool":0},"dqSR58PXPMPCeYeh8cjc2A":{"text":"Great little place to grab some tasty BBQ. Menu has lots of great options for the carnivor","useful":1,"cool":1},"S2jaZ4dv1nXD1H4a1Q_f4A":{"text":"Staying in Bywater while on vacay (from California) and we decided to take a walk and try ","useful":1,"cool":0},"3zle5s35vl7fyEGm4_DJxw":{"text":"I am a BBQ aficionado.  The ribs here are legit fantastic. Texture of the ribs is amazing.","useful":0,"cool":0},"EHPFg2n3_IoBVWrU0OSoPA":{"text":"On my first day in NOLA my local gal pal the great Morgan F of Yelp said that if I was loo","useful":3,"cool":5},"tx2qpDCiySCwVXeBnJ3Nsg":{"text":"If you've ever lived in Texas you will be disappointed- the brisket doesn't have that beau","useful":0,"cool":0},"7zIKmhvVlLCWTrzQHEWRvg":{"text":"Great southern BBQ. The sides were pretty good too, a different take on the classic BBQ si","useful":0,"cool":0},"YC61VlUq4_U4QZre2rP0rw":{"text":"This was my last stop on my trip in NOLA. It was highly recommended by a friend and so wor","useful":9,"cool":12},"nJKHMGbx3EnaYY_p88CXEg":{"text":"‍I just called and this idiot told me they only deliver for $300 to $400 orders... If this","useful":1,"cool":0},"7_ybhWnIPze71F8PAwYofA":{"text":"One of the top BBQ places I've been to and worth a stop on a visit to NOLA.  The venue its","useful":2,"cool":1},"rgFLfhCT_MswE1gS8CtFbQ":{"text":"Decided to venture to this place when my crew and I were craving some BBQ near but outside","useful":3,"cool":1},"vrUssYPKIDMBUL-C3-E-4w":{"text":"Amazing. Just amazing. Local place with a fantastic barbecue, totally affordable, just ama","useful":0,"cool":0},"UdCxr63N11xapXszunlpiA":{"text":"The food seems good but I wasn't able to try it due to it being closed for summer vacation","useful":0,"cool":0},"709VSj6oKfsHur9SEzYMGQ":{"text":"Excellent food. I mean, really, the food was killer. The ribs and chicken were both cooked","useful":2,"cool":1},"ztDlUnfW1vIocIS7GPBUEw":{"text":"I had 2 combos with ribs, pulled pork,chicken and brisket with baked bean, slow, mac and c","useful":0,"cool":0},"jAQCuRmQERSN5S0hvUysxQ":{"text":"So I found this place by searching Yelp for good bbq in NOLA. I asked around while we wand","useful":0,"cool":0},"fp0HbUU_8tgOm5TLkOy2bQ":{"text":"It took us over an hour to get here from the French Quarter, due to the #88 bus running be","useful":3,"cool":0},"YNAGx_I2-3qW1fcbohf3Sw":{"text":"So be clear this is an off the beaten path hole in the wall but the Q is top notch. I got ","useful":1,"cool":1},"4tJ5KCRxysq98DTKKaYT4w":{"text":"THE BEST DAMN BRISKET I HAVE EVER EATEN!!!\n\nThis place is like a little texan kitchen in t","useful":1,"cool":0},"d2C03JBTYOD29TyPpbSIyQ":{"text":"Yep, this \"Joint\" is all it's cracked up to be! Get there early! The line moves fast and s","useful":1,"cool":3},"oJYJx9OMgcZygCCR-K2jpQ":{"text":"I only got the pulled pork sandwich and it was delicious! It was very tender, no fat on th","useful":0,"cool":0},"sffCE0URf_ZCuFwbT-TvfA":{"text":"The Joint is some the VERY BEST Barbecue I have ever eaten. I have had dinner there with m","useful":0,"cool":0},"vPRqjyHHwhTtfgCmCcUr1w":{"text":"100% my favorite dining spot from my 6 days in New Orleans. Born and raised in North Carol","useful":2,"cool":2},"H1HN3_6slRU4wUf2AiuDIA":{"text":"As somebody who knows good Q, I was disappointed. \n\nWe had driven 5 hours from Panama City","useful":1,"cool":0},"O2M0Zvf0Gv8UqF9mKENldQ":{"text":"I am giving four stars only because I did not have a chance to try various items on the me","useful":0,"cool":0},"l4I1X-fbiuPDuRgZVRY93Q":{"text":"If the smell outside doesn't get you in you can't smell!\nThe Brisket and ribs fell apart t","useful":0,"cool":0},"aAaPv9EkFRUWw68TXhja2g":{"text":"This is some of the best BBQ I've had and definitely the best in NOLA. I've been eating he","useful":0,"cool":0},"wo9DHAh5Al859Bq6YXk23w":{"text":"Oh wow! A friend said they were running out to get takeout and brought back some of the be","useful":0,"cool":1},"Ea260CVrGYgF8e4XxxzmoQ":{"text":"It's just so fucking good. \n\nI've been there twice this week because my craving for decade","useful":6,"cool":2},"zEcedi0gHVlrB1jLOBympg":{"text":"Went there the other day spent 50 bucks on takeout the ribs were dry and old tasting the M","useful":2,"cool":2},"GYLHopJD7vRtl2ibYp9fIA":{"text":"The joint bar b que is the best the city of new Orleans has to offer, I promise you can't ","useful":0,"cool":0},"8CV4T0wsms78JnthmYN54A":{"text":"Ribs.Brisket.PulledPork.Sides.PecanPie. All from a hole-in-the-wall gem  in the Bywater. O","useful":0,"cool":0},"YBcFuU8BiQV7tORaGbQs2Q":{"text":"It's pretty simple..... The BEST BBQ in New Orleans! My go-to is the Pulled Pork, Baked Be","useful":0,"cool":0},"SlsYU0WDNWtkQb8pdLP_tw":{"text":"Dear Cooks and Staff of the Joint:\n\nYou have quickly propelled yourselves to be my favorit","useful":1,"cool":2},"gLf6fYjodm37NIYVuipHEw":{"text":"The food was tasty. The taxi driver asked how I heard about this place I said Yelp of cour","useful":1,"cool":0},"rajwm1jNOGwIJhWV2eGnmA":{"text":"Ok. New Location, new review.\nI know my last review was 3 stars and was critical of some o","useful":6,"cool":3},"ZReRS5bJJza1a5t3eQcSkw":{"text":"Brisket was good,and I enjoyed the key lime pie.I  did not  like the ribs,or the pulled po","useful":1,"cool":0},"jvdCdAhQpzRQhOojeuz6lA":{"text":"I ate at \"The Joint\" Tuesday 7/12/16. My late husband and I ate there when they first open","useful":0,"cool":0},"D5EALZpjr0bTolRX-6Wj0g":{"text":"I ate at \"The Joint\" Tuesday 7/12/16. My late husband and I ate there when they first open","useful":0,"cool":0},"Q4CKf7rUtmgSGcOuOfCtLg":{"text":"I have been patron of \"The Joint\" for years..since they were on Poland Ave. The food is fa","useful":0,"cool":0},"yBNUILoXtPQMWEvbWH1lKw":{"text":"This spot had the best juiciest chicken ever! The rib was on point to and the burnt briske","useful":1,"cool":1},"Dv-KKZrwWhjVNoYD8c9qcg":{"text":"Customer service is horrible, paid $15 for lunch. They gave my meal to someone else in our","useful":1,"cool":0},"Fvs9mh4Y_aV9-V9_QViH4g":{"text":"Best hamburgers on the planet!!! As in you will never find a better burger anywhere I love","useful":0,"cool":1},"5icEkCAalwCWgwA0tezYZQ":{"text":"Best BBq place in new orleans. A little off the Beaten path but well worth the trip. I lov","useful":1,"cool":0},"L9fZRyD_3R4LT38h5pQQFA":{"text":"Love this place and I love you guys. The best burnt ends pulled pork and key lime pie. Nee","useful":0,"cool":0},"AtwBaXVZHpAzJHLJJH4kMw":{"text":"Best BBQ in New Orleans, without a doubt.\nI have now introduced at least a dozen people to","useful":2,"cool":2},"EK9jMW_62gfuMk2YJ88vhw":{"text":"Probably the best bbq I have had in awhile. I got the Pulled Pork Sandwich with Mac and ch","useful":0,"cool":0},"Da3-yv5T49LV_JsnGfSh6A":{"text":"Im so happy that I heard about this place. Bumped into some locals on a trip to New Orlean","useful":7,"cool":1},"VWiGxO1wTr82aRsGzr0vSg":{"text":"AMAZING! \nMy partner was not too sure to leave the French Quarter, so glad we did. The BBQ","useful":2,"cool":2},"H8FJ0NjvOo3v7ZgIR6PWyQ":{"text":"If you're ever in New Orleans, I highly recommend the Joint! The bbq was fantastic, the co","useful":0,"cool":0},"URAvHk3lO7FzXaZxRfMOIg":{"text":"Some of the best bbq I've e ever had. I had to get it back to back. The brisket, burnt end","useful":0,"cool":0},"0XtUTlpPIpga1KrC_Bn6Zg":{"text":"Best bbq in the city.Ribs are absolutely delicious and leave you wanting more.Brisket is a","useful":1,"cool":1},"I8gQLHc8-TgVowRyXhVaVg":{"text":"Came here to celebrate me passing and becoming a EMT and my love for pastrami and let me t","useful":0,"cool":0},"OMG7C3cuI_kDJlzoXFaXgQ":{"text":"Terrific food and service.  I really enjoyed the potato salad and flavoring/seasoning.  No","useful":0,"cool":0},"Nj1Ir7Vn0d7692GSLVB2hg":{"text":"New Orleans is not a BBQ town as everyone knows.  That doesn't mean there can't be excepti","useful":3,"cool":1},"IxtbTTfnoaB_7uQgl9syfw":{"text":"This to me is one of the most overrated places in New Orleans. The bbq is good but its not","useful":3,"cool":2},"2cdQn0GwtzvwMyKzWVZxlA":{"text":"First time here was last thursday with a couple of friends. After only one visit me and my","useful":6,"cool":5},"wH0Be-8NVUXWHxEFLOaWHQ":{"text":"This place doesn't look like much when you walk up in it.  But the smell hits you before y","useful":0,"cool":0},"TPtprsBEdL6Lz7J6xS8Tug":{"text":"To start there were 2 windows. The lady says there's one line. One person in front of me, ","useful":2,"cool":0},"PNo-wRQGrEE3Uc-VvgPQdQ":{"text":"YOU NEED THIS IN YOUR LIFE. If you're in NOLA chances are you'll find yourself in the fren","useful":0,"cool":0},"ozksW84kR8YB8DHtTrRjHQ":{"text":"My goto place for brisket,beans, and consistency I'm always rolling up (2) THE Joint even ","useful":0,"cool":1},"V1hcoXR8uU2gOi4rMc2piw":{"text":"All of my favorite employees, alas, have moved on, but the food is still consistently good","useful":0,"cool":0},"vM8X5q4X5plKCay8QaUCKw":{"text":"Consistent, Delicious ribs, pulled pork, potato salad, and sausage.  Make sure you try to ","useful":0,"cool":0},"3B5m1CHqXAXB0A8ImKutUQ":{"text":"The joint has a cool atmosphere when you walk in. A little confusing that you have to orde","useful":0,"cool":0},"6gCsmIDqDKXpFRDj_8zh6A":{"text":"Slow-smoked barbecue, with a full bar.\n\n\nRibs, brisket, and chicken was full of meat. Bake","useful":1,"cool":2},"bpcjzH2vDG5rT9ewfDBZtQ":{"text":"This is a TOP NOTCH! Must do BBQ \"Joint\"!!!\nWith 15+ yrs in Food and Beverage, and 7 yrs. ","useful":1,"cool":0},"Pk9-_DHvHasZbVxVEYu7gA":{"text":"Amazing place everyone that goes to New Orleans should eat here had three different types ","useful":1,"cool":0},"2te0Wun9nUuDZwai3hNMcQ":{"text":"Hands down THE best BBQ in NOLA. Not only do they have great food they made it possible fo","useful":0,"cool":0},"KCgCZR4xH3-aJ0rZiNenBg":{"text":"My baby and I stopped int after a long days drive from Tampa. We were really looking forwa","useful":1,"cool":0},"PeR3m_8xw_-jpLdPRsWNoA":{"text":"I had read so many reviews raving about the \"best BBQ in New Orleans,\" so being the BBQ lo","useful":1,"cool":0},"Ge6g6RSnjNMAnYaoMthW4A":{"text":"for the grilled meat lovers, you will not be disappointed with the joint......at all! you'","useful":0,"cool":0},"_MweiVSHu_eAZ3rc3G--vA":{"text":"LOVE the frozen drinks! The barbecue is pretty good, the ribs were not what I expected but","useful":0,"cool":0},"36sHkQstvLszr74zQrTFRQ":{"text":"Best smoked meat and ribs in the city. Grat casual atmosphere and outisde dining. Friendly","useful":2,"cool":0},"hJp_e6bNfw1vonwBkXIycw":{"text":"By far the thickest juicy-chunkest brisket ends I have ever had.  My arteries gasped after","useful":0,"cool":0},"QjXaYmPN3o6JzUSJBcGBaw":{"text":"1. The bean is incredible. I highly recommend this side dish.\n\n2. The pulled pork sandwich","useful":0,"cool":0},"2wjON_aivgV5fNrgTdMPQQ":{"text":"This place was good. But I wasn't a fan of the hard spicy cold cornbread or the coleslaw. ","useful":0,"cool":0},"AMkrpsogtfhuYH-wAZWrFA":{"text":"I'm giving this five stars...it may not be the absolute best bbq I've ever had but hey thi","useful":0,"cool":0},"cNxnqfiZrjKXq5gLqhEYGg":{"text":"Delicious hot cooked food. Prompt, attentive, and courteous service. Did not like mac&chee","useful":0,"cool":0},"WUHZcGNJoOmLuQkw9XRuqQ":{"text":"BOMB.com EVERY TIME! The joint hasn't let me down ! Highly recommended this restaurant !! ","useful":0,"cool":0},"ggLLxsCU2OW0qB7Bs5C8yA":{"text":"Not good at all. I hate coming to the south and being dissatisfied with soul food or bbq. ","useful":2,"cool":0},"kjZeLOgAhF_pUYZbZJBVtg":{"text":"Food is good don't care too much for the thin sauces they use and hate that they add a fee","useful":1,"cool":0},"ipdbSV8wBNL2oTNQtwqpzQ":{"text":"God this place was delicious. Burnt ends, sausage, and damn good Mac and cheese & potato s","useful":0,"cool":0},"tR9tZK4YBioz0wwbRWrItw":{"text":"It was literally ok I heard it was the best bbq in the city and I'm a huge fan of blue oak","useful":0,"cool":0},"PV8w3nvqjUaaCKVz9NPCpA":{"text":"This place is the spot for BBQ. Although, New Orleans is not really meant to be known for ","useful":1,"cool":1},"EjIy1m34YJznBXZHMh9oTg":{"text":"This was our first stop right from the airport to get some grub. Unfortunately they were o","useful":4,"cool":4},"04ph3FUzwzrg2dIh5SNQig":{"text":"The sauce is good and the meat is tender. I usually order the meat with two sides and trie","useful":0,"cool":0},"rdDfN2oTEQJyBy2Up-xS3Q":{"text":"At one point, my girlfriend and I went to The Joint three days in a row. The BBQ here is g","useful":1,"cool":1},"le2eVgU7Im8koyjpaKPkww":{"text":"We came here late night on a Friday after having caught some music at Bacchanal. The line ","useful":3,"cool":0},"oROfsRe1N4x8ix7_wNBBIQ":{"text":"Just really good friggin bbq!!!!!!! \nTried the ribs, brisket, and pulled pork. Oh my goood","useful":0,"cool":0},"nTCm9egDS-8rHKZne1Imyg":{"text":"This spot was perfect! I'm so glad that we tried it.\nThey possibly had the best bbq I've e","useful":0,"cool":0},"UTbHdH1Dw1eL2ykBBxHMkA":{"text":"Keep in mind I'm very critical of my bbq. This place was ok. Has the correct vibe and the ","useful":0,"cool":0},"ER2I72LvwCypkaLY_UT1oQ":{"text":"I had my doubts when we drove up, but it had great reviews so we decided to try it. The fo","useful":0,"cool":0},"lG3v49t9Fx6p3BMqkK_bZg":{"text":"This is some of the best BBQ in New Orleans.  Smokin Buddha Bbqieux  and Whole Foods are t","useful":8,"cool":7},"ufRGiNUvswGoU2dbhGTqlw":{"text":"Can't believe I found this little gem. Little hole in the wall place that didn't look all ","useful":0,"cool":0},"kCkUHPTQy9689k_TZo3qSg":{"text":"Delicious barbecue! Our table had pulled pork, ribs, and brisket. I had the brisket sandwi","useful":1,"cool":0},"DqkWWvUt3ctdQqfwCcGfNA":{"text":"Been coming to The Joint to enjoy their 'cue for several years now, every time I am in NOL","useful":0,"cool":0},"TJZ0Rc_Yv3UvvB-WTsfONA":{"text":"Hoo boy. I casually asked a friend what their favorite BBQ place in New Orleans was, and h","useful":1,"cool":0},"Vt51OhNRGwWjmBTJ5XLDFQ":{"text":"If you're looking for the proverbial \"hole in the wall\" place, this is it. Situated quite ","useful":2,"cool":1},"XuqWx_gKHLV7uIQGRNVV7w":{"text":"Good food, good service, it's not hard Junction. Take some notes. Remember costumer is rig","useful":0,"cool":0},"9RwxInhyIPcFgqOm4-7KRw":{"text":"This is an awesome place y'all come and check it out the best BBQ ever!!! Side of BBQ bean","useful":0,"cool":0},"qoxF_ojgfAF2kuboR1ZsHQ":{"text":"Favorite bbq place anywhere! The ribs and brisket are my favorite. That key lime pie is so","useful":0,"cool":0},"SRRCf0VuubHqadpGmFqIqg":{"text":"Real + Deal = THIS! \n\nFollow your nose fellow troubadours! The sing-song smells of BBQ bec","useful":1,"cool":1},"dFnGjaEYSVn7SK0bonQWMg":{"text":"Anytime I come to New Orleans I wanna eat here every day! The food is really good a great ","useful":0,"cool":0},"ZQDL8ZKKRey-hLQaiCCXyA":{"text":"We were soooo looking forward to going here but we're slightly disappointed with the cold ","useful":4,"cool":1},"D0bUPtaEtpOpygWiP04TEg":{"text":"This was my first trip to New Orleans, but my wife had been here several times in years pa","useful":0,"cool":0},"bK46gcE64trAYwkR4_yu3w":{"text":"I have been going to The Joint for BBQ for 3 years and it is my favorite BBQ place in the ","useful":0,"cool":0},"HQ-xDZdMViI5hYr-MO86HA":{"text":"Well I believed \"the hype\" & this place DID NOT live up to it; I found the food to be just","useful":13,"cool":4},"7XqCWIXMkk7_g7aGzYwEZQ":{"text":"WOW! Best bbq I've ever had! I've been to this place a few times whenever I visit from Cal","useful":0,"cool":0},"DdYm693AQbLmVYmEBO2sGg":{"text":"OK it took me several visits to New Orleans before I would try this restaurant. Surprised ","useful":0,"cool":0},"KzvyJYCtW1b87ZTBWEhyDg":{"text":"Based on the Yelp reviews we had to try this place out on our visit to New Orleans.  We ar","useful":1,"cool":1},"gtYp0IW9SwgZt_AbQozvlg":{"text":"The goto BBQ place in New Orleans for me we live in the Bywater so we have been spoiled wi","useful":1,"cool":1},"V3zijCkayBcUl1JreJWMbA":{"text":"Lost and trembling I began my decent.  The wet weeds stuck to my shoes as I walked and pul","useful":4,"cool":7},"CLQfaZaPEYYGQe2-SIdfcg":{"text":"\"Can I just order one of everything?\" - me, upon first glance of the menu at The Joint.\n\nA","useful":3,"cool":1},"90onmrIDE9h1PP_bFKXvGA":{"text":"This was my first BBQ experience in NOLA and I'm glad I came to this place first. The venu","useful":1,"cool":0},"-GmoYrTQJs7GMaZ_F8bxkQ":{"text":"Hadn't been to The Joint in a while and, after a bike ride thru Crescent Park, thought I'd","useful":0,"cool":0},"NdMD_-60ogbM4Vug6r2BAQ":{"text":"Visiting New Orleans over President Day weekend 2021.  In the mood for BBQ.  Looked up on ","useful":1,"cool":1},"VDKgRW0Tdv7OPTs4FkqSMA":{"text":"wow. wow. wow. wow.\n\nMy buddy (and fellow yelper) Michael recommended we check out the Joi","useful":4,"cool":1},"QpUPUGqVtWqTguhtngJygg":{"text":"The best bbq in the city. It looks like a hole in the wall but the food is very impressive","useful":1,"cool":1},"WjM_cd-21RL0LAVMMtJuGg":{"text":"The barbecue at this restaurant is spectacular. The ambience is laid-back and casual. They","useful":2,"cool":0},"4MYfLme6bSJgRd9C5g4F3g":{"text":"Well worth the Uber from the French Quarter.  I wish my neighborhood had a great BBQ and b","useful":2,"cool":1},"rlpKuLufD4WrRELEd0SOOA":{"text":"Nice place really chill staff was friendly. The beef brisket was cooked just right. The ma","useful":1,"cool":1},"sme6DPmdiSlPGmiDI-T0pA":{"text":"I was in town for a business event and a friend brought a bunch of us here for lunch. I wa","useful":1,"cool":1},"A_8K3RSt1b524Oy9GB__Kg":{"text":"When I was living in San Antonio, I would often come back home (New Orleans) to visit. My ","useful":0,"cool":0},"1BeYSjKqOdUImnG9B69QmQ":{"text":"The Joint is pretty damn good, but not excellent, BBQ. You go up to the small counter (or ","useful":0,"cool":1},"hvvxLa_CSf1EOkfe6ZrIwA":{"text":"This place is delicious! Found it on Yelp and decided to give it a try on a rainy day in N","useful":1,"cool":0},"xLrk5mBQqWOh8qTbQcODAg":{"text":"We came to NOLA for vacation and after days of eating seafood we were craving some BBQ, I ","useful":0,"cool":0},"krsbk3gRraEhfHzLOgq4wA":{"text":"The food was good and this place is really fun. We were sitting outside on the patio and i","useful":2,"cool":2},"5JpyVabmOFMiMA1D86dVeQ":{"text":"I have been to The Joint  more times than I can count, since the last time. I've brought f","useful":9,"cool":10},"wTzJSAtvK9L06u5Ss2AjOg":{"text":"I've been going to this place since it opened not too far away in a little cinderblock bui","useful":0,"cool":0},"6ECmh78kckARBK6JYXo8nw":{"text":"This is a great little bbq place off the beaten path. I've worked in a bbq location before","useful":1,"cool":1},"cgVeScdu3jP0rwDI8HdjEA":{"text":"Amazing! We came here because a local we met recommended it. He told us to order the 3 mea","useful":0,"cool":0},"5GF4pP-KBCw2-3onGH16Hg":{"text":"If you try to order to-go here, you're not going to make it home to eat it...\n\nYou'll plac","useful":22,"cool":15},"ArBjUTHaDSzAXCbYyA35BQ":{"text":"On my travels to New Orleans, we came here on Day 3. I told my friend up until this point ","useful":2,"cool":2},"E1wGMwBZMj7iQRei1Ae9Qw":{"text":"I have to say that this is MY favorite BBQ place in New Orleans. The just-funky-enough atm","useful":3,"cool":6},"9LPxZ7Quls7yHZg6ndD4iA":{"text":"We had 4 days in \"The Big Easy\" and so, each night, we were determined to eat somewhere un","useful":3,"cool":1},"jvg0J0lsQKz5mbKB_PM16g":{"text":"The pulled pork was great. The ribs were super smoky delicious. The brisket was nice and f","useful":2,"cool":0},"FvgKIzNOsLOJRcqDVJlERA":{"text":"I really love bbq and since i live in the Bywater i try and support the local restaurants.","useful":1,"cool":0},"gNVbENGTxAlAOWhURBheoQ":{"text":"Let me tell you about this bomb ass BBQ spot! I ordered the two meats and two sides meal t","useful":0,"cool":0},"XNKbgq8uLieN31ZfpNFzrA":{"text":"Some of the best bar-b-q I've ever had. The burnt ends are the best when you can get them.","useful":0,"cool":0},"GYms2bkYbsneqrY7nk26Jw":{"text":"I would go here every night if I could. Great atmosphere and amazing BBQ. It seems crowded","useful":0,"cool":0},"bDi76ii2B0sSxJZ7vhUshw":{"text":"I visited the joint on vacation, March 2020. Nice little bbq spot tucked away in the upper","useful":0,"cool":0},"-Tdhmh-eK5oZnoKwATs_gA":{"text":"This is LEGIT BBQ.  Wow, and I've been to the top places in KC/Memphis/Dallas.  Took a Lyf","useful":1,"cool":1},"O0VaHLIXvXG_79FdAvrNSw":{"text":"I've noticed a lot of dumb tourist reviews on here I'm hoping to offer a little more local","useful":7,"cool":4},"CPUGq6GhtWW9GpcyO7hAmA":{"text":"This was the best BBQ food I have ever had. I recommend the ribs and beans. \n\nThe restaura","useful":0,"cool":0},"uH75B2vixnE6NsyLRKcvvQ":{"text":"Best BBQ in the known universe! I love the staff too!  Would eat here every day if I could","useful":0,"cool":0},"MVMEPLNutVV863DFNxPUsQ":{"text":"The neighborhood was deserted but this place was full of life. Had the best brisket ever","useful":0,"cool":0},"vhQflShA3mSSxGyDWrhWFg":{"text":"I have to agree with the other reviewers. After spending 4 days eating fried seafood and C","useful":3,"cool":1},"cDcg2sXsirJebtAhEtwdcw":{"text":"I got the chicken plate with Mac n cheese and potato salad and Hubbie got bbq tips, ribs, ","useful":2,"cool":0},"PdL5dtxLSMnZioreK4bBNQ":{"text":"I order from here a lot. I live in Dallas now but will not leave New Orleans when I visit ","useful":0,"cool":0},"x_y3prpCOHs906GcxvPHqg":{"text":"I had heard about The Joint before but was never in the area but the other I was going to ","useful":1,"cool":1},"TQCWt5i2sV0dkuh9AjsaOQ":{"text":"The food here is SO GOOD. The potato salad, Mac and cheese are the best! The meat was real","useful":0,"cool":0},"UYKl9xeagoLlO6UfXjonMA":{"text":"Amazing Barbecue\n\nOk, 5 star review here.  This might just be the best BBQ joint I've ever","useful":3,"cool":2},"HizCaR2BnzLlGAfJsZuNmA":{"text":"This is a simple review. They have the BEST BBQ in New Orleans.. period!!!!\nCool place to ","useful":0,"cool":0},"-CyR1ajcyJVhYKmid1kbFQ":{"text":"Who comes to New Orleans for bbq?! I would probably say questionable however I was pleasan","useful":2,"cool":2},"kpyavLUQRj32quNLewEyZg":{"text":"Just landed and had time to kill. Was told about this place and when I heard what they ser","useful":0,"cool":0},"KvxcSWz1fqkpDGvxuZ5mbQ":{"text":"I have been to The Joint  more times than I can count, since the last time. I've brought f","useful":2,"cool":0},"xP8NG4eyf9aZQUm8AHw51Q":{"text":"I am from California and I've had a fair share of BBQ's ( low and slow ) and been to some ","useful":3,"cool":0},"UeQCx39EGUAvP2GjPAbJfg":{"text":"I saw on the food network in my home town in Arizona. Tucson. We bbq every day. So we know","useful":0,"cool":0},"ScfPDxE6BLJUSFWeWwIp-Q":{"text":"This place is super good. It's out of the way so it's not super annoying with dudes bangin","useful":1,"cool":0},"y5a6dX-uUGoSLWVElCTBGQ":{"text":"The Joint has always had great meat but the sides have always been lagging. No more becaus","useful":0,"cool":2},"aXTlV4GPcd0-p51xDu1qZA":{"text":"If you like BBQ, no one in NOLA does it better. Really cool little spot. Great atmosphere ","useful":1,"cool":0},"Fu71kmrBL0v4hWAtCN_7gg":{"text":"man oh man oh man oh man.\n\nJY and I took a 4 mile (roundtrip) walk to The Joint for some r","useful":19,"cool":16},"VmGWuT27jKdZiaCBn8Cb5g":{"text":"We went for an early dinner to make sure they didnt have a line or ran out of any meats. W","useful":0,"cool":0},"BULxkeCZ2AJgMMBmJ6Xh-w":{"text":"Maybe the best BBQ I ever experienced. This place is eclectic. I heard of The Joint on DDD","useful":7,"cool":4},"Kke02OTBZd3V5oPLNPYzQA":{"text":"Glad I took a chance on The Joint. Fast service. Good portions. Everything was delicious. ","useful":0,"cool":0},"8bdqGujdEoJgLhw_zjKFMw":{"text":"The best ribs in New Orleans.\nI've eaten here for years.\nAlways the best.\nCovid take out i","useful":0,"cool":0},"FAGSLb2uowZupwwW4xLQPA":{"text":"Same experience as below. If you like chicken theirs is the best. Plump, juicy and flavorf","useful":3,"cool":2},"X1SbdhChHOltGqaty4vtkg":{"text":"From a bbq standpoint the food was great. I  A bbq connoisseur and heard great things abou","useful":0,"cool":0},"dlavral05zJie6oH67qjGA":{"text":"Me and my bf go here often! He enjoys the unique beer selections and I enjoy the food. Gre","useful":0,"cool":0},"CFVoqxlBSCzmolTGEvijig":{"text":"One of my favorite spots! My favorite is the smoked sausage and the homemade creole mustar","useful":0,"cool":0},"FrXiXRQd8h_riltoPpRHqA":{"text":"I have been to the old location and now that I have been to new location I am happy to wri","useful":3,"cool":1},"rfwz3bksrAVhCd5zElIQxw":{"text":"Ate here about a week ago, still doing window service. Looks like they still have the full","useful":1,"cool":0},"1nZCQ_RFA0hnzBqx7TQnBg":{"text":"MARIGN-WATER BBQ joint saturated with transplants and Carpetbaggers wanting a \"true New Or","useful":7,"cool":5},"_j0Zuxis9F9gPXJNl5J3Lg":{"text":"Great service, fun and casual atmosphere,  and the food was great. I got the sausage and c","useful":1,"cool":0},"Llh7WreLOKNZLxO-iB4kNQ":{"text":"If I could give it lower stars I would. The food was mediocre or ordinary-- not what I rem","useful":2,"cool":0},"kjLNW78Y3gvVkN2yOGMkUw":{"text":"First time visiting.  Run don't walk!\nHidden in a residential neighborhood. \nWalk up windo","useful":0,"cool":0},"52RwuTOim8L2zn8a4_XxQg":{"text":"This place is the best BBQ I have ever had the pleasure of enjoying!! Great EVERYTHING!! D","useful":0,"cool":0},"x7cNsbq_WOhRWSk0d_9cWQ":{"text":"Hands down the BEST BBQ in town. It's located in a cute neighborhood, the bywater/marigny ","useful":10,"cool":7},"Zmw5GsAGfDhdaDOnzjL0qQ":{"text":"Omg this bbq is good. Everything you could possibly want BBQ to be. Great selection, great","useful":4,"cool":3},"7D-y5w601n3lkyya7eGviQ":{"text":"Our final night in New Orleans and we wanted a comfort meal. We had talked about going big","useful":4,"cool":2},"sDnyEllh7YdEqriG-DNQrg":{"text":"So great!! Outside socially distant seating. To go available and quick. Fantastic drink ch","useful":0,"cool":0},"Uyo9699FfPsrIDzIoESNQA":{"text":"Had heard this was the BBQ joint not to miss in New Orleans and it was delicious! \n\nGreat ","useful":1,"cool":0},"u9VO33mxVVpN9e4WDVbisg":{"text":"Where I come from BBQ is its own religion.  In no way should all bbq be treated equal beca","useful":2,"cool":0},"WOtiATt00EgFWEKLIcJh7w":{"text":"I'm from Texas and I take my BBQ very seriously, and this was probably the best BBQ I've e","useful":1,"cool":0},"6d4Hq9sVBgkunZlw2-hjoA":{"text":"Hey Yelpers.... So this place  is a very good BBQ spot. And yes I only gave it 4 stars bec","useful":1,"cool":1},"yeBAV_5EW8X3jBm3pzRE1Q":{"text":"Outdoor seating for now, get the bbq sandwich. Great unique tasting bbq. The baked beans t","useful":0,"cool":0},"dD7a1b9XctyAyVzAsVc83Q":{"text":"Always a staple when traveling to NOLA.  Love this BBQ place.  I have been coming to NOLA ","useful":0,"cool":0},"7o1-7dZvxzJn5jUWjK1kyA":{"text":"This place is really good. Pretty much what you would expect in New Orleans. Nothing we or","useful":0,"cool":0},"WZHGBSBlr3mI9AFEd9cMiQ":{"text":"I know people were upset when a national list named New Orleans as a top contender for Bar","useful":7,"cool":3},"eIscgB0fY6Cv3ghxrGyulw":{"text":"Traveling on business and unfamiliar with the area I decided to consult my handy Yelp app.","useful":11,"cool":9},"0uoOSypwwlwGR0EbTg9Z7A":{"text":"well. first impressions kind of sucked, the two ladies there werent really friendly to my ","useful":0,"cool":0},"sDaujXL7cqGnsxRJflyq_w":{"text":"Wow is this place unassuming. Went there on a HOT summer morning on the way out of town, a","useful":0,"cool":1},"Cfcef5Qm3XMI7epUcmNeHA":{"text":"This was my first meal in NOLA and it did not disappoint. I got the 2 meat combo with the ","useful":0,"cool":0},"I-Q4SfVvFAW4DFDR5JRVqw":{"text":"My partner loves the meat, especially the brisket. They give you large portions and the pr","useful":0,"cool":0},"NOxNJXyNO-RaNgAPJe5raw":{"text":"Amazing food and awesome friendly staff!! Def recommend the brisket and Mac n cheese!!! Yo","useful":0,"cool":0},"lU0Gx0SQe4iau0s_ko9PVQ":{"text":"All I can say is excellent ......................... Not what you expect when you enter th","useful":0,"cool":1},"h5vF96-wUQCWuVnWLucerA":{"text":"These guys are awesome! I loved the crawfish, hopefully you guys will bring it back for th","useful":0,"cool":0},"ibrgwUcLGWTFNsc8Ka211Q":{"text":"Food: DELICIOUS brisket- equally fatty and equally moist. Their ribs are super tender and ","useful":0,"cool":0},"YxJz-F9kcC_2uZXMNiHTVQ":{"text":"Love the spot! Reminded me a lot of north park San Diego. Park in front of it.  Food was a","useful":0,"cool":0},"rtMZ9EFXQzLUqXJUVh96jA":{"text":"I love this place and did t even know it when I was using YELP to find a place for good bb","useful":1,"cool":2},"LA6Tr5An5zQIY-upsFW-8Q":{"text":"**THE BEST BBQ IN THE AREA**\n\nSurely in the state. And honestly, maybe even the best I've ","useful":1,"cool":1},"n9qLZ8WpWNmcq_FcxYMYTw":{"text":"The group of people waiting before opening and the line almost to the door during dinner t","useful":3,"cool":0},"DH-eVVQ8WTP3qv1eybtZZA":{"text":"Super cute little corner joint with pretty solid BBQ! Stopped in while on vacation and was","useful":1,"cool":0},"dchPJIVn1L9_ctXFFw85Mg":{"text":"The Joint is well worth a trip out to the bywater. you can smell the BBQ even outside of t","useful":4,"cool":4},"Y-T3giEY24zlSFdwnZ1PHw":{"text":"Best BBQ in the area. Fall off the bone ribs, tender brisket, juicy pork and chicken. Pick","useful":1,"cool":0},"CA5VIB2BAfnQMPQBygymnw":{"text":"Ribs Ribs Ribs Ribs Ribs\n\nWhat a great place to eat bbq! The service was fast and got grea","useful":1,"cool":0},"-cmYI06rI8k3Q6uqv66h7Q":{"text":"Really good BBQ, fall off the bones ribs. A little out of the way, but well worth the driv","useful":1,"cool":0},"KN2uFYq1egoMe5f3_QyD0A":{"text":"Worth the drive! This place was about 40 minutes away from where we live but we saw the gr","useful":0,"cool":0},"BC3W5m8CKoH1xRE8uRq3Hg":{"text":"The Joint-always smoking!!!! Best bbq in town! As far as I'm concerned , no further explan","useful":0,"cool":0},"-fQ6P6roMZHdC6EgpTGYSQ":{"text":"The place is a great little spot in Bywater. We just decided to drive looking for a place ","useful":0,"cool":0},"MghwI2stiP2HJX4ldp3GvA":{"text":"Amazing smoked BBQ. The ribs are always amazing. I really like all the house sausages but ","useful":0,"cool":0},"WMGTkfqfEwmgQVCDLO61fg":{"text":"tried the joint again with a friend, had a previous lackluster experience and this time wa","useful":1,"cool":0},"glgocJb3on-_F6JT9r9HFQ":{"text":"I've had The Joint on my restaurant wish list ever since seeing the restaurant featured on","useful":4,"cool":5},"QtaTq2KmdubWw5Yy8WMYhw":{"text":"My group wasn't sure about eating BBQ that wasn't from Texas. We went in before the line g","useful":0,"cool":0},"QE-MmdxqkT0vkNv3pjCDXA":{"text":"This place has amazing smoked meat and sides...I also need to say we are from Texas and ha","useful":0,"cool":0},"B6Nu0Ww-E_7pnjFYYhRkkA":{"text":"Seriously was so exited to try this place for over a year for what I heard in the reviews.","useful":0,"cool":0},"pryC6NR88YmGQv9UO4bGmQ":{"text":"I brought a friend of mine here and treated him to lunch.  \"Anything you get here is reall","useful":0,"cool":0},"8Oo1LTuSofdbvq14brkFpw":{"text":"best bbq in new orleans! always enjoy going there, love everything. just amazing. i'm alwa","useful":0,"cool":1},"DRQ0VirIhOixE2VDglXUgg":{"text":"I've gotten takeout here twice since quarantine and have been happy both times. The daiqui","useful":1,"cool":0},"Nbk_Sw2uEwnh_z2h3IQgOA":{"text":"Yes, Yes, Yes, and Yes! This place is awesome!! Awesome BBQ, awesome staff, awesome craft ","useful":0,"cool":0},"B2fGdN_0qDgOs2-aJkbqyA":{"text":"Hmmm. Perhaps I was expecting too much from The Joint. I went here with the GF a few days ","useful":1,"cool":0},"-g1PCzVHVTIiG5r3NB7cyA":{"text":"I brought 8 friends from Detroit to enjoy a good meal at the joint.  The meats were really","useful":3,"cool":1},"_VKvOu8suAm1YNpE4Oyu_A":{"text":"I must admit the bbq is way better than what it was in my earlier reviews, the side items ","useful":3,"cool":0},"kgWyG9S3cXRkcsl7pMPmfw":{"text":"Goat loves good side dishes at great BBQ joints.  Somehow BBQ places make really great sid","useful":2,"cool":1},"CexO4QayAqsXsYlW83UOmw":{"text":"Great food, great service, and authentic NOLA atmosphere. My favorites were the sausage, r","useful":0,"cool":1},"n7aKShdcIAOKpdyvOZBQpA":{"text":"it's not a sauce thing down here.  it ain't about sweet vs. spicey vs. vinegary.  new orle","useful":3,"cool":1},"r8oSey0UcoAqxw87lqi2Ng":{"text":"The Joint is definitely contending as one of New Orleans top barbecue places. With their n","useful":8,"cool":8},"fsWmrRgL8w-Daq-fL6ARcg":{"text":"Why this place is number one i don't know. Walker's clearly has a better BBQ and don't eve","useful":0,"cool":0},"j4RBx4bMab9cnn55VtVRYQ":{"text":"Nope, nope, nope... not for me. The brisket was fatty and tasteless, the burnt ends were t","useful":8,"cool":5},"hfErPF7h7gBxzeoRgStfYg":{"text":"Best barbecue in the South. That's right! Way better than Alabama (Dreamland, Full Moon.) ","useful":5,"cool":3},"TvdbL6ta3bGKuzR9Tho5aA":{"text":"They were out of ribs! I was so deflated.  I ran after my uber outside to tell him not to ","useful":1,"cool":1},"hKmWutHxDDgB-qtBsfF8Cw":{"text":"Another Food Network find in NOLA. Let me preface this review with the fact that as a whol","useful":4,"cool":0},"-zuvj06SznrvRnK-RhYjJw":{"text":"As you read all the reviews, one will realize The Joint receives high reviews 97% of the t","useful":0,"cool":1},"PmBzb1uRU6jHSChqxAHiJQ":{"text":"Was in town and heard this place was good. It's located kinda off the beaten path but well","useful":1,"cool":0},"5vWuR0v4WW23XiJJvkt3Qg":{"text":"Shit I'm pissed when I get there with 6 people. They only have brisket and pulled pork and","useful":1,"cool":1},"49bu3C3T4PK5FbuUkNdJhg":{"text":"I've had this place bookmarked for months and never made it in to try this food that every","useful":2,"cool":2},"p0jGTt_BP2qhZpJiH0WZTQ":{"text":"Everyone else has already said it, but this is the best BBQ place in New Orleans, hands do","useful":0,"cool":1},"UiF5p-c0UIrrrehKY5PCgQ":{"text":"I got the pulled pork with Mac and cheese. The Mac and cheese was creamy. The pork was goo","useful":1,"cool":2},"5SOq5_kMHLedzgejpIYOEg":{"text":"Why 4 stars? Because I appreciate the level of hipsterness here.\n\n   ---   ---   ---\n\nI'm ","useful":7,"cool":4},"lZJbYg7kjaoo5vR9_IIFyw":{"text":"I so wanted to love this place. We first stopped by to get some dinner here a week or so a","useful":3,"cool":1},"Mu0JiO3tDkLTUt72CYoP-g":{"text":"The reviews for this place are stellar and I had a good time, but didn't blow my mind away","useful":0,"cool":0},"tXw03S2MNgmuUOR3L0H-Ig":{"text":"The Joint is a cool local spot located in the Bywater.  A friend and I were in NOLA for a ","useful":1,"cool":0},"nSVLllVuRZfXueapkabRGQ":{"text":"I haven't had BBQ food in awhile and coming here made me miss eating it. The closes BBQ pl","useful":1,"cool":1},"-rORGKiVjek5wIUv8Wfi8Q":{"text":"Hole in the wall, neighborhood barbecue joint... A long ride from downtown, but good food,","useful":1,"cool":1},"dGe8unMVNm1u8VzqNPri2A":{"text":"Some of the best BBQ I've had in a long time. Just incredible. We got a huge variety of th","useful":0,"cool":0},"ojlgQbVJ_bUbtpTBE6x17w":{"text":"The Joint is a pretty cool and unique BBQ joint not too far away from the action. We were ","useful":3,"cool":2},"-s4YBEfomjhG6BRGJYygJw":{"text":"The one and only problem with my food here is that it has forever ruined all future bbq jo","useful":3,"cool":1},"bfRbwE_wHXMgtqdUJCOoQw":{"text":"Tried this place for the first time based on Yelp reviews. I was not impressed. I definite","useful":0,"cool":0},"wb6AFsvOEFIZUAjVnBSFeQ":{"text":"Probably one of the best BBQ experiences Ive had in soooo long!   The venue is so rustic, ","useful":1,"cool":1},"KOc-5t18S5-U00792EdnHw":{"text":"I love this place. I love their food. After hearing about it for awhile I finally got to v","useful":0,"cool":0},"q8JTaBSH4Zr-zmtSZF64Ew":{"text":"This place is located in a sketchy neighborhood.  Once you step foot inside, it's a nice c","useful":2,"cool":1},"jrg-SgQAMx2_fiGRDKFn_Q":{"text":"Excellent smoked brisket. Juicy, large grind pepper dry rub, melt in your mouth. Some of t","useful":2,"cool":1},"IZvoKyee968CgRrUpQlFrw":{"text":"Decent barbecue in the bywater. Ribs and pulled pork are very good but chicken is hit or m","useful":1,"cool":0},"cW1iOpgucYulgXjWtXljZg":{"text":"my neighbor wanted BBQ, so we ended up here one Sunday. It was hot, because they have an o","useful":2,"cool":2},"ku_c_O6kUrpfxitatwC3gw":{"text":"What a great place! Comfy little bbq spot with some great drinks. I had a half rack of rib","useful":0,"cool":1},"0Uu8NcIK9LTJZKlGgA0ISQ":{"text":"I come here very regularly because we live down the street! The Joint is very consistent a","useful":3,"cool":1},"Vozl0AzawNSdCMbdMiwo8g":{"text":"OMG!  I lived in Memphis for 20+ years and our 2nd house as a child was in the Quarter but","useful":0,"cool":1},"HGCfnQ1fefQzP3dM9XR3Zw":{"text":"A popular BBQ spot highly recommended on Thrillist and Yelp. There's usually a 10-15min li","useful":2,"cool":1},"Cq8iPXq5xv1SoftBi149Iw":{"text":"We were recommended to try The Joint by the homeowner of the Airbnb where we were staying ","useful":2,"cool":0},"tzcj4JuzljWKdj5fCnWpow":{"text":"Hey folks, Foodie here! Here's a small BBQ joint that serves a nice variety of smoked meat","useful":0,"cool":0},"YGHN17yKyMiT6ouRNWH6nA":{"text":"Trying to find food in New Orleans can be easy and difficult at the same time. On one hand","useful":0,"cool":0},"73o4tIY4ncsUMf-zD-bIAA":{"text":"If we are in town and they are open we have to go there the best tri-tip I've ever had !!!","useful":1,"cool":0},"IYOs-OpVTJRLcFbAY4Yqbg":{"text":"The Joint.. it only gets better. The line is damn long so don't expect to be in and out. I","useful":7,"cool":2},"kQKPeKqyJHEHoywKjvcbrQ":{"text":"Post COVID prices and servings are unreasonable!!!! My husband loves this place but unfort","useful":1,"cool":1},"eXcaqD7rtswtfFkpKqxUBg":{"text":"Best BBQ in town. Love the beans, potato salad, ribs (so damn tender!!!), and brisket.","useful":2,"cool":3},"bSj9ETsI8vTaWO3GnKteWw":{"text":"The ribs are finger-likin-good and could easily go head to head with the best dry rub ribs","useful":1,"cool":0},"D9R1MOyVKO6wrr1sRfBAFA":{"text":"If you really want good tasting BBQ with a bit of a spice, then The Joint is the best plac","useful":1,"cool":1}}