{"t2UEvBbbIs6I4UqwoiTNFQ":{"text":"Shaarrrkk attackkkk!!! Get outta the water!!!!! This will only make sense if you order one","useful":0,"cool":0},"ekZcrEDLQe-FaYEXmqty8A":{"text":"Hand grenades, baby!  Get it \"skinny\" = less sugar, less calories, same amount of alcohol.","useful":1,"cool":1},"jIuLTLHMH4aw_VRnvaudzg":{"text":"If you buy one drink in Nola, buy the grenade. Its $8 for one and ITS STRROONNGGG. Drink w","useful":0,"cool":0},"1VRyxD-VHG_4-cMpG7THzw":{"text":"Really simple drink list\nWhat's the point in going here if you don't try the grenade? Try ","useful":0,"cool":0},"Oen9JMrPzGUqjeTdG8K-Bw":{"text":"Hand Grenades... Beware! Highly potent and guaranteed to help along a wild night!","useful":0,"cool":0},"hj9yQr_zCDc3kZCfToQbSA":{"text":"I LOVE IT.  Their specialty drinks are so good and the souvenir glasses are great for deco","useful":2,"cool":2},"CcW9e67I09pxRiOCe5TRdw":{"text":"In the spirit of getting the full Bourbon St experience, I stopped in this place to grab t","useful":0,"cool":1},"lCI0ZiYQb57c1vkHO6sZkw":{"text":"The hand grenade is bad news. Just a warning. The live music is alright. But this is Bourb","useful":0,"cool":0},"aRlmuO4IY_PX0a3XyAAMdw":{"text":"It's a place to get the famous Hand Grenade and get loud and crazy, you're not going here ","useful":0,"cool":0},"GLaks8Md2uTWJYUA2LTk2w":{"text":"Had a blast with my friend! We danced the night away and drank like never before! Amazing ","useful":0,"cool":0},"2oeKE4iXMuAC2sqSlTUf7g":{"text":"This place is a must for any NOLA first timers. Grenades are the legendary drunk here and ","useful":0,"cool":0},"60SADDRVe2NbgGzwYC508w":{"text":"My dolls and I got hand grenades from here. They were the right tool to get the party star","useful":0,"cool":0},"B6J4CMwlomYV5O8exVbsfA":{"text":"Hand grenade...I really don't even have to say anything else, hahaha! I was not impressed ","useful":0,"cool":0},"MGBO8uAlxRWnQKfMKLKLZg":{"text":"If you're in New Orleans and hitting Bourbon Street you have to stop at Tropical Isle for ","useful":2,"cool":6},"zCUCwa-06XmNbMu9Tyq9Jw":{"text":"Staff is very good.  I ordered a small Tropical slushy drink for the walk on Bourbon in th","useful":0,"cool":0},"lYXHunfsdGxATmYouMoOgw":{"text":"Holy cow!! The hand grenades are fantastic but be careful.  If you are not a big drinker d","useful":0,"cool":0},"RGsMM2TKjgyK7PHEX6TF5Q":{"text":"This is, by far, my favorite bar on Bourbon Street.  Even with the pull and appeal of the ","useful":0,"cool":0},"djWoQ6aVSbomGrI7cILPQg":{"text":"Overly sweet and strictly a novelty. If you must order one get it skinny - less sugar. Not","useful":2,"cool":1},"hADOnesYgz-_lEV6ho_30Q":{"text":"Had to start of the night with one of Tropical Isle's infamous hand grenades which come in","useful":0,"cool":0},"TUG6SxxGMrkq_bccq7BI9w":{"text":"They will double charge you hoping you do not notice. Disgusting practice. Avoid this plac","useful":0,"cool":0},"bJZalcFx-0hk_qk0scU19g":{"text":"A must do when in NOLA. \nWARNING: Hand Grenades are dangerous and you should not drink mor","useful":0,"cool":0},"6GTyK4Iv4cE2DGCNimiACA":{"text":"Boyfriend and I sat on their upstairs deck for literally 8 hours during French Quarter Fes","useful":1,"cool":0},"BXLrcaNOpRubJCPvR5XE5g":{"text":"As if one touristy cocktail wasn't enough, a Hand Grenade completed my boozy tour of the F","useful":0,"cool":0},"KcDpTN3Zd1z_QgZLS2p1dQ":{"text":"A good time whenever I am in town. With at least three related bars you can get a drink at","useful":1,"cool":0},"Au3rHF5EocTG7_2ifblw_A":{"text":"As Frank the Tank would say \"I'll do one!\"\n\nOh yes... but please, do ONLY one - or you wil","useful":2,"cool":2},"AHRkLYJEYuPMK80HCumByA":{"text":"Best place in New Orleans, Hands down the Hand Grenade will sneak up on you in the best wa","useful":0,"cool":0},"1ZOTq4CwXKgVp5thId5jjQ":{"text":"Hand Grenades did not disappoint. Quick and fast service which was great.","useful":2,"cool":1},"qRcSs5qj8G4uEp4q_o2Acw":{"text":"Wasn't as impressed with the hand grenade as everyone else was, but something to try.  Wou","useful":0,"cool":0},"P_ULB_oH1VWil2RFR_-bZA":{"text":"This 5 star is for the Bayou Club. The ONLY place I have found in the French Quarter who p","useful":0,"cool":0},"qdwhj0Ix52WEMhb3u7m0hw":{"text":"The large hand grenade ($8) was definitely worth it.  My friend told me to try that drink ","useful":1,"cool":0},"Xqdsf1TsEcJi7fGK4e97UQ":{"text":"Big cup of beer was 5.50. Seemed like a good deal. The girl I was with bought one of their","useful":0,"cool":0},"HZEOHo_zdpSRblPCe4IkGg":{"text":"This is a must stop while in New Orleans. That being said, it is a touristy place but you ","useful":0,"cool":0},"oBvYfkWLH90iY3z6LL2ZVg":{"text":"The hand grenade was my favorite drink in New Orleans! Totally gets you messed up with jus","useful":0,"cool":0},"dXYPIG4nPe6-5ve0BAoFeQ":{"text":"Those hand grenades are delicious. My friends and I heard so much about them that we came ","useful":1,"cool":1},"vzCx0PvfjNX6PEJgAVVp6Q":{"text":"Oh, Hand Grenade - how I love thee. \n\nYou've gotten me through several college-days Mardi ","useful":1,"cool":1},"2rl3OEbyyEnLn_iCFHNUWw":{"text":"Hand Grenades...What else needs to be said? Yummy goodness to mess you up good, I had one ","useful":1,"cool":1},"iCrr51SDBWJvaaFZqtIxqQ":{"text":"It is rather unfortunate due to the fact that this bar has a very iconic cocktail that ser","useful":0,"cool":0},"hXYCp920qI-lmTFnEdHyfA":{"text":"Yep. I was a tourist, yep I drank a couple Hand Grenades... On an empty stomach... Left my","useful":0,"cool":0},"1WIHLZzq5bcKggnBS-Czaw":{"text":"Awesome. .. but made a mistake and drank the hand grenade way to fast..","useful":0,"cool":0},"QAcgWkw_fa3Y8tJq6cCZXw":{"text":"Hand grenades are the shiznit ! Get one before you leave NOLA ! Frozen is better because i","useful":0,"cool":2},"an4TrapU6o2v7QMwiX5poQ":{"text":"I came in on a Tuesday night which wasnt really busy which was great because that meant no","useful":0,"cool":0},"XURMHZKUe0fMQpADGfjkjg":{"text":"Like everyone else's previous reviews...you pretty much have to get their hand grenade.  F","useful":0,"cool":0},"qvMrhuGrzqwrqoXS7cvgZg":{"text":"Amazing drink. Love the long to go cup!!! Great service!!! The drink was strong but it did","useful":0,"cool":0},"DbrjdLbVfkpSG6Z-KinBFg":{"text":"When visiting Bourbon Street this is my first stop so I can get a Hand Grenade. I can't ha","useful":0,"cool":0},"_rXn79NrMsgqvr3N-ciZNA":{"text":"This bar is a haven in a pretty crappy field of options. The drinks are bomb (pun intended","useful":0,"cool":0},"rn33Lt_W-zzyukiirGlNIg":{"text":"Cute dive bar. A must do while in NOLA!! The grenade is super strong.","useful":0,"cool":0},"dwSCmf0Q-2yWXjHd2j4j7A":{"text":"Can i just say... the best place to hang out! The bartenders were awesome. I think you gro","useful":0,"cool":0},"t1qaYLnKAZ7yjVR2dHQ2zg":{"text":"Out here for the first time. Hand grenades are serious and deadly lol. Great service by th","useful":0,"cool":0},"Wc55RnFJIZdO6F6J_YeGaA":{"text":"A cool place to stop by when you are on Bourbon Street. They have a live band playing down","useful":0,"cool":0},"4Q2bpvLgGFt2l8WmHcHIjw":{"text":"How cute...a hand grenade drink with a mini grenade placed on top. Classic!\n\nAnd beware...","useful":0,"cool":0},"xqZEueTZ4AXSo3h3MT9BmA":{"text":"Hand Grenade!!! Tropical Isle is the spot on Bourbon Street to get one!\n\nSuper crowded but","useful":3,"cool":4},"5M3rYVJjSoIwPC3j1gw8Tw":{"text":"So, let me warn you... you down one of their hand grenades, it will definitely hit you lik","useful":1,"cool":1},"KKiLCoTKfg4kXRlR7o1T9w":{"text":"Came in from Dallas, Texas. Received the best service all weekend. Jenny was beyond amazin","useful":0,"cool":0},"A5Nr5QI5EUAyHIqZSTVk5Q":{"text":"Came in to try a grenade.  Will not be back lol.\n\nNot exactly sure what's in a grenade, bu","useful":1,"cool":0},"aaIFP3YfhXRIZb2J0yRbBw":{"text":"All I have to say is go get yourself a Hand Grenade for about $8. Don't know what's in it ","useful":1,"cool":0},"YIaNH8fNhpOmRguHrCgpWQ":{"text":"I'm not gonna lie, I spent more time here than I should have while in NOLA.  Most of that ","useful":0,"cool":0},"fLqO8dHeRscvgrGSCHZ7Ew":{"text":"Had to try the NOLA world famous hand grenade. Very tasty but to sweet for a long night of","useful":0,"cool":0},"1vb-yQGb2F34HXW0BChr3A":{"text":"I frequented this place during my visit because the hand grenade is decent (very sugary!) ","useful":0,"cool":0},"GpgogugV2anC04xCg8wtjA":{"text":"Hand Grenades, $3 fireball shots, and when the sign flashes, $2 Jagr shots. Toughgirl bart","useful":0,"cool":0},"UCPZ7fAN3m8ZuaphVIEdqQ":{"text":"Dear Tropical Isle,\nYou are perfect. Never change.\n\nYou created the perfect drink: the Han","useful":6,"cool":10},"ldSjRF1eV7JRJTVIfD7Opg":{"text":"It's a tourist trap bar. The bartenders were ignorasaurases even when the bar was very spa","useful":2,"cool":2},"EW2LpEXieq4o_bbt7WxJNQ":{"text":"2 words: Tourist Trap. The place has very little redeaming value. oh yeah they polute the ","useful":1,"cool":0},"LDol_4CFQTOtNA8e6OIu8A":{"text":"Generous amount of rum! Surprising and refreshing melon flavor! My wife loved it! I though","useful":0,"cool":0},"DqRhnPk8LlW8kD1VtRKLUQ":{"text":"The music was really good. It was a couple of older men who played a range of music. I enj","useful":0,"cool":0},"mWbrrZMaqlhQcgGuXVemNQ":{"text":"The drink is $9 and it provides a nice decent buzz. It's worth it to have the large. The s","useful":7,"cool":3},"F-Mc4zq8WBLb6XEkN3saBw":{"text":"Only gave it two stars because the band was pretty hilarious weird al mates with a parrot ","useful":0,"cool":0},"uCvjfALTyELA78T8_ZzSbg":{"text":"I don't know why there are so many Tropical Isle's, but it's a decent place to get your dr","useful":2,"cool":0},"2xLR4eHDRhFSeMSfcyRxWA":{"text":"Shout out to my girl Ericka S. for putting me onto the legendary hand grenade! \n\nI would t","useful":0,"cool":0},"DofGE9wPazrBauT2ieesgQ":{"text":"Tropical Isle is known for their bright green concoctions so grenade if you dare!!! You ca","useful":0,"cool":1},"iLRFaeu8nxrK6-98wUeLUA":{"text":"Hand Grenades will make your evening seem like a series of random snapshots. Every time I ","useful":0,"cool":0},"JNpc0G1Lhq_W7VRiRCz-Lw":{"text":"Forget hurricanes, hand grenades are what's up. These delightfully potent drinks get you w","useful":2,"cool":0},"6glZZia7QGrFWZNJ2xSjmg":{"text":"This place kept popping up everywhere I was going in the French Quarter.  To brag about th","useful":0,"cool":0},"FIovdt9MVDliOLkqttUCtw":{"text":"This place is awesome.  I never went to hang out t the bar...I just grab a hand-grenade an","useful":0,"cool":0},"5OVMIylUm3CEXVT8YfXpQw":{"text":"Hand Grenade came out of a soda gun. Bartender would not tell us what was in the drink. Di","useful":0,"cool":0},"J45YHfhVFjRPAIirEfqCAQ":{"text":"First day in NOLA I drank a hand grenade like it was a slurpee.  Needless to say, I had to","useful":0,"cool":0},"Um79lZOBR1woEm_B51peFQ":{"text":"Stopped in for the hand grenade... YUM!\n\n\nCheck it out. Friendly staff, good music, cute l","useful":1,"cool":0},"c5ZFJ-g0AEJ5tcTfrQz6_g":{"text":"According to the cup it's the most powerful drink in New Orleans. Let's see when I finish ","useful":0,"cool":0},"1chPQky9j-KJBU6OVo_5Uw":{"text":"Located on the corner, with a live band inside.  This is the smaller of the two, the other","useful":0,"cool":0},"jMvEsMzpPP7vpapJMIl8HQ":{"text":"It's a NOLA staple! You can't come here and not have a hand grenade. I've had both the reg","useful":0,"cool":0},"2DsgbhkkcKrpBGrX1YSVbQ":{"text":"Came here to see what all the hype was about. Had their famous hand Grenades and they did ","useful":0,"cool":0},"K32ZolOiuVEkBr37JCzPSQ":{"text":"Shut up and take my money....\n\nI've puked in my own glove box thanks to the hand grenades.","useful":1,"cool":1},"4jqVu790_DaWZq7jV146gQ":{"text":"Fun place to hang out!  Love the Hand Grenade!  \n\nI'll be bock!!!","useful":1,"cool":0},"kgUXaJqli8ePjknCFZuIpg":{"text":"I know its on Bourbon st. But this place is a new low.  I have never been in a dirtier bar","useful":0,"cool":0},"z-W9X5EwJ2NlAQ0evSVyjg":{"text":"When they say that the Hand Grenade is the post powerful drink in New Orleans, they aren't","useful":0,"cool":0},"QGpcGaPJv6W_eauRUchV7g":{"text":"Nice place! They have this drink called the hand grenade which is a really strong drink! T","useful":0,"cool":0},"td4ghMNVhfLnZgY7VWWZbg":{"text":"==============\nRJR - ISSUE #15\n==============\n\nOne of the Famous tourist bars on Bourbon S","useful":1,"cool":3},"Eesfb7b3Ql5hBSBVBNm46w":{"text":"You created the perfect drink: the Hand Grenade. Each sip tasting of Ecto Kool-Aid and Eve","useful":1,"cool":1},"xzWruiEIrykjx0KHmw_wFg":{"text":"Hand grenades are the devil. Incarnate. I don't know what's in these deadly green concocti","useful":4,"cool":4},"eSkCjUWrX51bG57S6NWseQ":{"text":"Service was quick. Had to see what all the hype was about...taste was pretty sweet so only","useful":0,"cool":0},"7dB-7FLoBxvenxv7s5sWNA":{"text":"Hand Grenades! Good and will make you a wall hugger if you have enough. A must do while in","useful":1,"cool":0},"o9OvbQaHh9d8KIbVVti84w":{"text":"Well I am a tourist when it comes to NOLA and this is a tourist staple. Naturally one of t","useful":0,"cool":0},"WpmsUC4gTYwVnA0t8FzFSg":{"text":"This place gets you drunk. Really drunk. Sloppy drunk. Go home with a cougar drunk. So. . ","useful":1,"cool":1},"ZQbFxuk5BAvwyZrCjAvd0Q":{"text":"OK... This is a must if you're going to bourbon st. There is ALOT of places selling drinks","useful":1,"cool":1},"ZRauFkSFMtQNMFdhOCirtQ":{"text":"I would say just by looking/walking around in the French quarter area, the hand grenade is","useful":0,"cool":0},"KDOv7FhuNgCjqE-GqZl8Hw":{"text":"Probably 3.5 stars and more of a functional bar if you are pacing on Bourbon Street.  We w","useful":0,"cool":0},"5LlBE-k2vsPwqpnzjCG4zw":{"text":"HELP ME - I fell victim to a Hand Grenade.\n\nAll I can say is that this drink went down smo","useful":0,"cool":0},"gG_v8ay17cFKGqydPvsExg":{"text":"Skip the Hand Grenade and go for the Shark Attack\n\nThere are numerous Tropical Isles on Bu","useful":0,"cool":0},"g0XPf_IdI_2j-xSM89XpmA":{"text":"Okay I was told to try a Hand Grenade and it was my first stop. It is a freakin' strong as","useful":0,"cool":0},"ABjE0adK1QM4DiU9BN64ig":{"text":"I liked the hand grenades and the other drinks that they had too. They were as fruity as t","useful":0,"cool":0},"IyOWgA7-1CuEH7W7Z7ZGPA":{"text":"Pretty decent bar out of the ones we tried on the legendary bourbon street. Saw it on an e","useful":0,"cool":1},"ado-WLoKVQpaDXmPC7tMvQ":{"text":"This bar was awesome!!!! The bartender was super nice and gave us free popcorn when we ask","useful":0,"cool":0},"TCNcBM8p7yvXOVcq4CGHwQ":{"text":"They didn't let us in because we brought the noise to the party. We love you Mardi Gras. O","useful":0,"cool":0},"CmpIc1rbOa6wq9td1C6MZw":{"text":"Hand Grenades = Awesome Memories And Drunken Good Times.\n\nIn other words, I never thought ","useful":1,"cool":2},"wrSDz7LwDJpSal2kvh9POQ":{"text":"I had been to Tropical Isle twice before, both excellent experiences, and this time was no","useful":0,"cool":1},"znkGejGmKjFhntBLGpVubw":{"text":"this spot is a must stop! and the grenades are a must have! awesome atmosphere with a kill","useful":0,"cool":0},"BYVSs8T4xwQCvRt3deNlWQ":{"text":"Hand Grenades, Best drink in New Orleans.\nAlso, friendly - yet super secretive - staff. Gr","useful":0,"cool":0},"bQOGl1ZFg_Y12DCSZ6KQ0w":{"text":"The Hand Grenade was my favorite slushie drink in NOLA. Get this!!!","useful":1,"cool":0},"4qBUomNNmlYmvYt3ThMcXg":{"text":"When u come to NOLA there are some\nMust did and must sees and must eats and drinks. This i","useful":0,"cool":0},"HZq9Sy9VAA4yrRAjRAvzbg":{"text":"Another fun stop. It's loud, it's rowdy, it's a blast! The grenades are a typical tourist ","useful":0,"cool":0},"hbdIQRHG9gs_9KBUrHBE7g":{"text":"UMMMMMMM Hand Grenades and a Balcony.... what more is there to say??? Oh Ya Hand grenades.","useful":0,"cool":0},"hUnamSGL8CDlX2dmwh1UYQ":{"text":"We were a little put off at first by the dancing hand grenade out front, but once we tried","useful":1,"cool":1},"6-qyo2XsiocTM4ojTYyPYQ":{"text":"Had a blast at Tropical Isle. The interior has a cool theme with just the right amount of ","useful":0,"cool":0},"6yyh02t8DKnbP7_pB9FeCg":{"text":"Hand grenades will get you f***ed up! Lol it's strong but tasty. Maybe my tolerance is low","useful":0,"cool":0},"qRJzNE4prKAMQIBeskWbwg":{"text":"What are those green drinks everyone is carrying around? Hand grenades. Tropical Isle is h","useful":2,"cool":1},"fWd5rI_A3VeNAiNuygJdmQ":{"text":"At least there was Cajun music and the band actually could sing. My vote for best on Bourb","useful":1,"cool":0},"etk48pYJSJ8ThETb9kZSng":{"text":"Hand grenades are the popular drink here. Delicious with I am sure a ton of different liqu","useful":0,"cool":0},"gmdU8tdmAuEOfe-8oHhvHw":{"text":"the grenade is great. the \"hornet gator\" tastes terrible. do not get the horney gator. ter","useful":0,"cool":0},"DozVKWW97aieSTOitDSPOQ":{"text":"MUST TRY THEIR HAND GRENADES!!!!\nGood fruity drink served in a tall green plastic cup topp","useful":0,"cool":0},"ngRcEm8RmQuOEvu7pef4Dg":{"text":"Suffice to say that the grenades are a must! Bartenders here were pretty cool! My friend s","useful":0,"cool":0},"dBA4cl6dkJnUr46yFoTDUg":{"text":"Another must do in New Orleans? Get a hand grenade.\n\nThese lemonade/fruit-punch with vodka","useful":1,"cool":1},"6COzxB3DCKVq_q2GqQZ5cw":{"text":"I guess I am going to add to the hype, yes go get a Hand Grenade!\n\nSo what do I really thi","useful":3,"cool":2},"lJJwFQXUT7WzFOQBOQ-2gw":{"text":"get the grenades!!!!! and word to the wise the horny gator def lives up to the name","useful":0,"cool":0},"Jr3-O4trG7CKuZl7sHM41w":{"text":"Yes, it is a tourist trap. Yes, the Hand Grenade is served in a gimmicky plastic go cup. B","useful":1,"cool":1},"tPUZ9z1hSEX-TVT1gV8bGA":{"text":"Home of the famous grenades.  Right on Bourbon Street.  Has several locations around the F","useful":0,"cool":0},"qQseBqyUX1eLac5nvirIOg":{"text":"5 stars because it was an in and out experience. No lines and No wait!!! Seems like a nice","useful":0,"cool":0},"YmDx8JS1gQHLpBMjt7Y0Nw":{"text":"Hand. Grenades. Taste so good but probs don't have more than 3 haha you definitely can't c","useful":0,"cool":0},"XUd3O7whjIcqDKnOa0SB4g":{"text":"Love, love, LOVE hand grenades! Would it be completely irresponsible to have this as my si","useful":0,"cool":0},"9y0sfpj-Wo5PD08RWJHD0w":{"text":"Let's be honest OK? We all tried that hand grenade, right? I would keep the glass, however","useful":0,"cool":0},"mpCblsDVc78OlTl9uYyGDQ":{"text":"Really liked Tropical Isle! The drinks are great, the bartender Bob was awesome, and they ","useful":0,"cool":0},"ZOdFNoRRLiefqQ_XtZCmJA":{"text":"The hand grenade is the strongest drink I have ever had!  It tasted fantastic....then boom","useful":0,"cool":0},"1ZLAO-A0wa3aeQMGfj40DA":{"text":"Yes, it is the spot to go when you're in New Orleans just to grab a Hand Grenade and go wa","useful":0,"cool":0},"DSx8ObGGq6Gq9DHtY01UqA":{"text":"Quick assessment: It's the Hand Grenade bar.\n\nThey're 100% worth trying, and were way bett","useful":1,"cool":0},"SUzSka2YXuIWe3SRshBVmA":{"text":"Love, love, love the hand grenade. As someone else said, two will leave you passed out. I ","useful":0,"cool":0},"C9bCLi0wAMtJPfC41367SQ":{"text":"Loved the drinks here. The handgrenade gets the dank stamp of approval haha Met alot of cu","useful":0,"cool":0},"oZA7jFS-24cSzUJ70BsOKA":{"text":"Yeah, tourist trap but decent prices for Bourbon St. and a great view from the balcony. Al","useful":0,"cool":0},"pC2ZuIHFkCmAiUo0HmpQvQ":{"text":"This place is very green inside. So green it hurts. I had about 2.5 hand grenades and they","useful":0,"cool":0},"vAKvsjw6FqTL_3aJzi_QfA":{"text":"I bookmarked this bar prior to arriving in New Orleans because my husband was so excited t","useful":0,"cool":0},"V621RbglrHfciYCQGhXarw":{"text":"It has a nice atmosphere and is definitely a must for all first visiting Bourbon street in","useful":0,"cool":0},"uhjxqxFE_cwcTNjGUMasqA":{"text":"10/21/2016 - GRENADES!!!\n\nIf you go to Bourbon Street, you must get one of these. This bar","useful":6,"cool":4},"7vDwsjJw9Py-zvu4CaefxA":{"text":"cool bar as i believe theres multiple locations. i got 2 shark attacks. love how they make","useful":0,"cool":0},"jz6fGhHD3lfr72-31ju-JA":{"text":"All I really have to say about Tropical Isle is their specialty drink. The Hand Grenade. T","useful":6,"cool":2},"7Poe2Y1K5g1ASMamBHnPKA":{"text":"New Orleans is full of rude people but that can't ruin your trip, right? This place sure c","useful":0,"cool":0},"FpryuRtzNQJ_Sc26Ug_Nkw":{"text":"My wife and I stopped in on our way back to our hotel to split a hand grenade. Wasn't expe","useful":0,"cool":0},"9qI4Y_jW-ERJlA7Dx3P-cw":{"text":"Fuck yes!  Why can't we have fun bars like this at home?  \n\nSo bottom floor has bands,  hu","useful":0,"cool":0},"gzsdlSvO8448drjHhGnPZA":{"text":"Okay, so a hand grenade knocks out the kids who don't know how to time drinking it.  Okay,","useful":0,"cool":0},"5hZt3OwVd5qKt00UVy9Rwg":{"text":"I can now say I have had the hand grenade. I would love to duplicate it but I am sure it i","useful":0,"cool":0},"kZSUCpVDIyDegYxRLJk25A":{"text":"Tropical Isle = Hand grenade's.\n\nJUST SAY NO!  \n\nBut if you can't say no - be forewarned; ","useful":0,"cool":1},"f0Nm13VEeaOFL5gaN15LJw":{"text":"Best place on bourbon street I loved the live music. I LOVED THAT  THEY PLAYED behind the ","useful":0,"cool":0},"XINLgN8gi686nkNh4-z70w":{"text":"Felt like a putt putt golf course in there. Really touristy, which I guess is ok for the l","useful":0,"cool":0},"poreaBi9oT9ZlSYC7tDMVA":{"text":"I really enjoyed this place. I wanted a nice drink just to wind down with and my girlfrien","useful":0,"cool":0},"0-_GW0X4NiBhiaFc0ZMRwQ":{"text":"2 words! HAND GRENADE!!!!!! Must have a 6 or so the whole trip. It was an awesome drink. I","useful":0,"cool":0},"GekdDeM5xnUpcap-1YlQOA":{"text":"Like everyone, we dropped in here to have a hand grenade. I must say the drink had a punch","useful":0,"cool":0},"AgIMfmK3pFoEcRmcpzSNhA":{"text":"A local suggested the Shark Attack.  No disputes, this is the way to go. Great and a littl","useful":0,"cool":0},"E0gGLO5LEZZDdUyjloQIxA":{"text":"For being so potent, the hand grenade tastes SO GOOD.  I'm the type that likes girly drink","useful":0,"cool":0},"UzsLYhUaXCDUyvSbdPhXrA":{"text":"I came to Bourbon Street in search of the famed Hand Grenade at Tropical Isle.  Like many ","useful":5,"cool":0},"JIh3Kq7CjYkdpJBvYvlqFw":{"text":"Decent bar with a live band when I went. I enjoyed it but there are a lot of other bars on","useful":0,"cool":0},"nunTJlDGO0eZY9ZfaqfgNg":{"text":"HAND GRENADE! That's all you pretty much need to know when you come here. There are a coup","useful":2,"cool":0},"Hh-Ru9QTxqfacyqa2HfrZA":{"text":"love this place!! absolutely the best idea ever...love the drinks, love the decor, love th","useful":0,"cool":0},"EdyYQOH_SS3-J-CTs4ph5A":{"text":"The handgrenade is my absolute favorite New Orleans drink. This is the holy grail of adult","useful":1,"cool":1},"pCIHpNGkgwGsSRoalV7_Kw":{"text":"They had a live band and we got there before the crowd so we could actually sit and enjoy.","useful":0,"cool":0},"FM5uJ9I93SoHpDNueghWBQ":{"text":"Gotta Love Tropical Isle! We stopped in here for a drink to cure the pain my super high hi","useful":0,"cool":0},"ouYDMnxvxlDVrEDOHwdGGw":{"text":"every time we are in town this is our first stop. i like to go early afternoon they usuall","useful":1,"cool":0},"qej44uWwVSbE2saCFiad1g":{"text":"Hand Grenades! It's relatively cheap, and will get you loosened up quickly. Sometimes toug","useful":0,"cool":0},"-pBW_cSAZMj-IauOAEpVMQ":{"text":"This Tropical Isle (the one on 721 Bourbon St.) was the home for most of the activities fo","useful":0,"cool":2},"o3lbfflQDA0T6HD91sV5cQ":{"text":"Do I really need to write it?  Do I?  Yes.  They have hand grenades here.  All world famou","useful":0,"cool":0},"qpH2StQWm3x4LEJmmA6T9Q":{"text":"AMAZING drinks and loved the roof top deck. Only real issue was how the upstairs looked tr","useful":0,"cool":0},"P_ThJetojRJD-glE5hZ6nA":{"text":"There are about 4 different Tropical Isle in the French Quarter, all home to the \"most pow","useful":2,"cool":2},"cU1znSu9HVqu0oZr6YbfPw":{"text":"Hand grenade that gives you acid reflux. $1 jagger shots (which is okay). Gimmicky tourist","useful":2,"cool":1},"TQQhE42gNmqXxrtuds3RYw":{"text":"Hand grenades all day! Grab a grenade, walk and sip it, come back for a refill on the rock","useful":0,"cool":0},"HCpM2ng97Xqf9qzWX9INuQ":{"text":"Always stop by here for a hand grenade when we come to New Orleans. This place has a nice ","useful":0,"cool":0},"rJtNm8Zse2jwzmawJIET_g":{"text":"No matter where we went on Bourbon Street, we kept coming back to one of their 3 locations","useful":0,"cool":0},"7gi1zD5jxPL0zAKXjcrljw":{"text":"Had the famous hand grenade. Tasted decent, but like other's said the alcohol's potency cr","useful":0,"cool":0},"8sgjGdzruBBJ8fuEd8wUQQ":{"text":"I've never met a hand grenade I didn't like.  Incredible.  Hold on to your plastic hand gr","useful":0,"cool":0},"qc1yybZY_eCaj_sKUt8_Aw":{"text":"Love the drinks. Nothing bad to say about this place. Pool table on the top floor where I ","useful":2,"cool":1},"fHrrcQqqEfTwAanpD3_E1A":{"text":"There are signs on the wall that says $2 Jager bomb when the sign is flashing. They keep t","useful":0,"cool":0},"PI1K8FOD-nKsPVf-xGubMA":{"text":"Their Holy Hand Grenade is strong enough to get even the rabid rabbit from \"Monty Python a","useful":0,"cool":0},"kHgGK2fuTLjmeoWAA9k1Xw":{"text":"Bourbon street is crazy. I can only imagine what it is on a slow day. Seems like it's part","useful":0,"cool":0},"hdAeqTtQhlZF-ntoTTSvOA":{"text":"Yes, the handgrenades are strong and yes, just one can make someone blackout.  I think the","useful":0,"cool":0},"mg3zzAVNJzz3w_Nj-zK4cg":{"text":"I guess it's a right of passage for any visitor to Bourbon st, but once you break your che","useful":0,"cool":0},"s-Ldsi-XvaEpla2pjLJK3A":{"text":"Hand Grenade... Best drink ever!! One and done is what I say. You must try one while in NO","useful":0,"cool":0},"w0qQPJifJHg4QMV7ErGGBA":{"text":"The location was nice and was at the west end of bourbon. The bar staff were super nice an","useful":0,"cool":0},"49T4IsHXDYSvhdnpKMjGbw":{"text":"I'm beginning to worry about my alcohol consumption because I was able to down two of thes","useful":0,"cool":0},"fUdX4OIKT5Cg4q-59epzNQ":{"text":"LOVED the hand grenade! It is SUPER strong, but it tastes absolutely delicious.  Definitel","useful":0,"cool":0},"ivrUz7YuNju3yhFSmDn_mw":{"text":"You have to try a hand grenade, or two, if it's your first time visiting New Orleans...\n\n.","useful":0,"cool":0},"ZRIE_0Di0c3MR_JjxPSD5w":{"text":"There are tropical aisles strewn all over the vicinity of Bourbon Street, but pick one.  \n","useful":1,"cool":1},"MnWlgi7fJZoJt2Qd-R77hQ":{"text":"I will say that I tried to give this place a chance, but I couldn't get into the band they","useful":1,"cool":1},"X9jM-2uX6LnstyNRQjYxug":{"text":"We had a skinny grenade the night before and decided to get the original grenade drink. Ho","useful":0,"cool":0},"jpoFLkxeYxL8tv6RN6Rubw":{"text":"After having some weak a$$, expensive hurricanes at Royal House, and the Hawaiian Punch ty","useful":0,"cool":0},"2e0LDYhcDBO61pUYRJUUgA":{"text":"Get the shark attack. No drink is more fun to order and you get a souvenir shark that you'","useful":0,"cool":0},"35iNzxHmbtIQQ7s2yvENIg":{"text":"A touristy bar in the French Quarter and one of several locations.  They're best known for","useful":0,"cool":0},"mMQADT5jfgXtd16yznxk8Q":{"text":"If you're on Bourbon and want a drink that will kick your butt, get a hand grenade here at","useful":0,"cool":0},"8TqtSPe87nzAvX_zc2TLQg":{"text":"I'll admit it...I was totally drawn to this place based on the grenade statue outside of i","useful":0,"cool":0},"QzRL7tU7N4nQE9UjT6nQ_w":{"text":"We had 2 drinks a piece - one being a beer, the other a whiskey drink.  It was $42 and the","useful":1,"cool":0},"fyJgGCwQGr2lUjHrl9EygQ":{"text":"We always stop by Tropical Isle while on Bourbon St. These will definitely sneak up on you","useful":0,"cool":0},"bgeKpGJInXkjjC7Fd8auvA":{"text":"The Hand Grenade was the first drink we got on New Orleans' Bourbon Street! I'm a sweet dr","useful":0,"cool":0},"p7x0O3LdoW8pc4w5SseCyg":{"text":"While the Hand Grenade has never been my drink of choice - melon-y and overly sweet, and w","useful":1,"cool":0},"Lk2klso1Ir1vXQJMqFMPDQ":{"text":"I hate being a tourist, unless the alcohol is flowing. This place makes a very sweet drink","useful":0,"cool":0},"QQEErQqiJVN9P0JcpawaQg":{"text":"Hand grenades. Get 'em. Everyone else on Bourbon St has one (or two or three) in their han","useful":2,"cool":1},"jDGdussUXcGLBP33H4tTGQ":{"text":"Yes, probably the best and strongest mixed drink in the quarter, but the place is a dump. ","useful":0,"cool":0},"j4dQnNnn8Y21XYbZim_ELQ":{"text":"Came here during the week of Mardi Gras and hands down it was my favorite place to come an","useful":0,"cool":1},"w2DMvg8FfVofYdhU8ObYsw":{"text":"This place blows.  I do love the decorations.  Most powerful drink... not even close.  Fir","useful":0,"cool":0},"KUI-2TCiDAleMGyp89RrvQ":{"text":"Friendly staff and potent drinks - a win/win combo for me!  Their hand grenades are amazin","useful":0,"cool":0},"9HPx9h2BNSZAq-o8Je0qyQ":{"text":"Al has the worst customer service ever!!! He is rude and disrespectful to female customers","useful":0,"cool":0},"vL_rx4f6bHL6ovY82fTbUw":{"text":"In my opinion, best drink here in NOLA! I love the melon flavor and how strong it is! I wa","useful":2,"cool":0},"V2y95AgTYPtmcQB5OyMdiw":{"text":"A cheap drink that will get you hammered. In a big plastic cup. Gaudy and tacky. Strong. C","useful":0,"cool":0},"pwYH-E5AUqRB0-t7wa1oTg":{"text":"Damn you sneaky hand grenade! \n\nHad one at around 5pm and I was good for the next 12 hours","useful":1,"cool":0},"X4uMUEKDwvaptOXX0PTi8w":{"text":"Tropical Isle gets the job done. They didn't lie - it is a VERY strong drink, it's just no","useful":0,"cool":0},"rO6gExCaAI-0uB6MMU4nnQ":{"text":"Grenades headquarters on Bourbon.  Real good,in a portable container. Must try, I liked it","useful":4,"cool":0},"Pf4GE86X2ky11sfiSeBwIg":{"text":"Granadas will get your party started!!! These are definitely a must try when in New Orlean","useful":0,"cool":0},"cnToA4WjXnePbyJWvg627Q":{"text":"So you see people wandering around the quarter with these tacky plastic hand grenade glass","useful":1,"cool":0},"k3Ko5Jl3045ArIrTgV2yhA":{"text":"One thing everyone needs to know about bars in New Orleans and especially in and around Bo","useful":0,"cool":0},"XLMZl-251oMxW_DxHxrMlQ":{"text":"The Grenade is awesome, plain and simple. It is so delicious! It'll get you messed up but ","useful":0,"cool":0},"ENoLgM6og2nz-mWLZTaNHg":{"text":"I had bookmarked this place because I knew that when I'm in NOLA I had to make sure I got ","useful":0,"cool":0},"VrWndPOSL6Y5tdF9rTheUw":{"text":"If you're going to hang out on Bourbon Street, you have to have at least one hand grenade.","useful":0,"cool":0},"SRj_bzJ9aiZYuHKlvXu0fg":{"text":"So fun!  There's an air hockey machine, upstairs patio to people watch. Bunch of tourist t","useful":0,"cool":0},"3ZKkq78KguakL5E1cr72OQ":{"text":"Great rooftop Bar on Bourbon Street. The bartender was very lively and I was completely tr","useful":0,"cool":0},"VYke_dQ9p1yCvhNYpI_p7w":{"text":"You cannot go to NOLA and go to the french quarter without having a hand grenade or two or","useful":1,"cool":0},"0P5v2X-DHsFzkZrLOvsrAQ":{"text":"I have only been to New Orleans twice. Both times, Tropical Isle was a must for me. \n\nI wa","useful":2,"cool":0},"YljrQp9lLgYO11nUGJHdLg":{"text":"My buddy and I travel to New Orleans every year and Tropical Isle is always the starting p","useful":1,"cool":0},"GfSgL5DCv4LSQv5fExO43w":{"text":"Don't do it. Don't give in. You hear about them, you see a bunch of people carrying them, ","useful":2,"cool":0},"tDKHso3TkhpLxs253vy0EQ":{"text":"I think they're actually are three of these bars scattered across Bourbon Street. I know t","useful":0,"cool":0},"u72AoeDyixPSdqv-5KJCyQ":{"text":"Tropical Isle is bar equivalent of the double-dog dare.  You know you shouldn't do it beca","useful":0,"cool":0},"lxXijzTrwyygzRBoYNBczg":{"text":"This bar is a lot of fun. There is a lot going on here (a lot of things to look at, etc) a","useful":0,"cool":0},"EtiEXbAtCzkC87iM90FCnw":{"text":"Oh hand grenade, you were my go to drink in NOLA!!! I must've drank at least 6 during our ","useful":0,"cool":0},"47efoKAdJEVh0C6p3KajyQ":{"text":"Tropical Isle seemed to be typical of other dives along Bourbon Street; but I wasn't drawn","useful":0,"cool":0},"UO3R7jDTtfxgvGMXfmB3dw":{"text":"No better way to take yourself out than a hand grenade. \n\nThese tasty little treats will k","useful":0,"cool":0},"RjKiyXJdnfctohBmDJCzdA":{"text":"All I can say is the Hand Grenade contains happy juice. It's a melon flavored drink that w","useful":0,"cool":0},"I8TpFWaoVl5Doq31jylOcA":{"text":"Why does it get three stars?  Only because I went to this place almost a year ago and of a","useful":1,"cool":0},"8zyKKY5crGSKvJSZ4hyPNA":{"text":"Go down to Tropical Isle and get yourself an $8 Hand Grenade. Sure you'll look like a tour","useful":0,"cool":0},"o84U0UEBVdi8QOkeQYLT-A":{"text":"*Barf*\n\nBourbon urine is green because of these foul sweet azz drinks.  The \"strongest on ","useful":0,"cool":0},"apkXaCN5P7els1dJItVRVQ":{"text":"A relaxed bar atmosphere. Obviously, you're here for the Hand Grenade(s).. plural. Get at ","useful":0,"cool":0},"tSVEwLp9sv56jGoETo6m3A":{"text":"Was told by about 10 coworkers and friends from New Orleans to get their infamous hand gre","useful":1,"cool":1},"S6e0AuCWFtFOu0us7heMZg":{"text":"The good ole days of Tropical Isle are gone. This place is now NOLA biggest Tourist trap. ","useful":0,"cool":0},"kAqt2fTfp9SUExyIft7KPQ":{"text":"We recently visited here during the last weekend in June. We order Hand Grenades and sat o","useful":0,"cool":0},"GL9cHa5SRknHX0dIHkDOiw":{"text":"Hand grenades!! You have to get one from here ! They taste amazing, a nice sour sip everyt","useful":0,"cool":0},"7L1e9S5UzoxUz5ZHUjbIKw":{"text":"The Hand Grenade: nobody knows quite what's in it, but it's a delicious -- and extremely s","useful":0,"cool":0},"NGZ0kxFo5Oqp_lAPHmZyHQ":{"text":"Not overly impressed with this place. They have the gimmick grenade drink that everyone ge","useful":1,"cool":0},"mJ4fgjJx_xMIlAxpVfxESA":{"text":"Just stopped by the front to grab some handgrenades on the go, hand grenades are good and ","useful":0,"cool":0},"xyVFs-SJ4ixcFNYXebu7nw":{"text":"It's obvious that a NOLA trip isn't complete without a trip to the Tropical Isle. One hand","useful":0,"cool":0},"qfDa9CJ3fD2EFV9pm7h--Q":{"text":"All you need to know is that the Hand Grenade is no joke! This thing will snipe you if you","useful":2,"cool":1},"q7xqrwfpiaZj0SxIAbPtjg":{"text":"What can I say? It's freaking handgrenades!! They don't need an explanation. It's a bourbo","useful":1,"cool":1},"ifnHpXBtN4ttp-J27tuW4w":{"text":"Six Words: Hand grenades, ask for Shark Attack\n\nLike most people, we came for the Hand Gre","useful":1,"cool":0},"pGv8-Rl1K7fNK7wnWiB6kQ":{"text":"You can't get a hand grenade anywhere else.  There are only 4 places that serve it so you ","useful":0,"cool":0},"sOqcdGhGqzZvR1r70y-nOg":{"text":"Come for the bar tending staff and the delicious Hand Grenades, chill music and tropical v","useful":1,"cool":1},"BhY7hfL0h9PevARZAnn2ZA":{"text":"We got Hand Grenades. I only regret it a little bit. \n\nWe sat at the bar and enjoyed peopl","useful":0,"cool":0},"iBffonL1ddg6n08xo3jJ3Q":{"text":"The atmosphere is loud, crowded, and fast paced you have to jump in and quickly yell your ","useful":0,"cool":0},"ar_iPzzduebQu3SMQkb8qw":{"text":"I have tried and tried again to have a good visit here...but it never gets any better!!!!!","useful":0,"cool":0},"3nGJOtweZfEU6bCJ42yEug":{"text":"two words: hand grenade.\n\n\nseriously, its strong and tastes pretty good. i made me thank m","useful":0,"cool":2},"FIdGlHqsFhCrWr9lRQ0AtQ":{"text":"Based solely on the hand grenade. These drinks are definitely not for the light weight dri","useful":0,"cool":0},"7rKqXk5LWxLFcvLsZy02cw":{"text":"It's one of those \"must do\" things if you are on Bourbon St. $8/gernade. $7 for a refill.\n","useful":0,"cool":0},"WrwSUBJzRqXB6G9p12SWNg":{"text":"of course you're going to order a hand grenade first, i get it. but instead of going for a","useful":0,"cool":0},"g3YvwPAb-rHFmQDgw4IpFw":{"text":"Got a hand grenade because everyone else was doing it (peer pressure). If you like sweet m","useful":0,"cool":0},"DwRLZTfVjk37IIqp2G9kSw":{"text":"This was a comfortable place with OK music and a pretty decent upstairs area with knock ho","useful":0,"cool":0},"LjQb15sSd9R8ZoDJ9F3fZQ":{"text":"The drinks were abundant and cheap. Drinking from plastic cups that you can take anywhere ","useful":0,"cool":0},"Z5tOs63KmG-s0Xo8sqBjLw":{"text":"We came here for $8 hand grenades, and that's what we got. The bartender was fast, friendl","useful":0,"cool":0},"xnx15CXiH5sggXo08ZzZYA":{"text":"Gimmick-y. Tourist-y. Not that clean. But definitely worth the trip, if not just for the h","useful":0,"cool":0},"3bcGZeP206YrhVOSH12FaA":{"text":"Just had the jag shots in a random pub hop. I loved the music played by cpla old timers. W","useful":2,"cool":2},"8aj_3aR1M1Kv3PjH1jIURw":{"text":"You come to Tropical Isle for a hand grenade, that's just what you do.\n\nYou can get it fro","useful":3,"cool":1},"sMQs6JkUBxxnBB7VznZDGA":{"text":"WARNING: HAND GRENADES ARE DANGEROUS!!! I had to try one while in New Orleans, and it is b","useful":0,"cool":0},"PRO65RwjWIABYUAPO0AL7A":{"text":"Although I'm writing this while rather intoxicated, apparently my typing skills are not su","useful":0,"cool":0},"Y_eWxhHgY9L6S8nQjQxw0A":{"text":"They put way too much ice in the bottle, refills were ONE dollar off and I didn't really f","useful":0,"cool":0},"TK5qFzNUl5ekU9USYFHG0A":{"text":"HGs and Bourbon Street goes hand in hand.  We heard so much about these hand grenades that","useful":0,"cool":0},"ZTj96-HEl1ibKqqTwx5FrA":{"text":"This spot on Bourbon was really fun.  I like that they have 2 bars connected to one.  Zyde","useful":0,"cool":0},"3KDSl5Sw312h4HbimnmT_w":{"text":"Walking down Bourbon St. at 11am and we see a sign, \"Come in and have a hand grenade!\"  We","useful":0,"cool":0},"dMhbN2CMjQ0z0LvbYC25HA":{"text":"So are you longing for a monster killer hangover?  Are you?  If the resounding answer is, ","useful":1,"cool":1},"gPa_z3V8IfDO1YoIr0_VNg":{"text":"Stopped here for the sole purpose of buying the hand grenade drink in the tall plastic cup","useful":1,"cool":0},"olEhAy_UB9EoHPkOmIkGOg":{"text":"Yes, it's a tourist trap.  Isn't ALL of Bourbon Street a tourist trap?  I visited as a tou","useful":0,"cool":1},"Et4l2bJH7nl-Lp9gndr9mA":{"text":"Looovvee this place, there is a few locations on Burbon st all with great customer service","useful":0,"cool":0},"JBW2GiveRNemi6cYMSE4xQ":{"text":"Great drinks and amazing atmosphere at this place! Hand grenade was delicious! Will be bac","useful":0,"cool":0},"njCmGjtKWGenkseROO_rWA":{"text":"Hands down my favorite drink on Bourbon street. I was all hyped and ready to try Fat Tuesd","useful":0,"cool":0},"llbmnR0Wb2MyIHQd1ejZFA":{"text":"Well, I thought the Hand Grenade is just ok, nothing to brag about it IMO. \n\nThey have few","useful":0,"cool":0},"s09iBm6v0ZLQhNPdTTSmnA":{"text":"Hands grenades are perfection! Tasty drinks that creep up. A tourist spot, but a must stop","useful":0,"cool":0},"M4Nu9TIfvNsFg1uTbUOXHw":{"text":"SKINNY HAND GRENADES!\n\nSame taste, fewer calories. WINNINGGGG!\n\nAlso, adorrrrrrrable grena","useful":0,"cool":0},"_k4DfJpGidC5nGx1pppAQA":{"text":"Ashley is the best bartender ever. \nHand grenades are deadly. \nAnd the guy with the guitar","useful":0,"cool":0},"fBy5STegFMM-4cbwsDj1IQ":{"text":"No visit to NOLA would be complete without Hand Grenades. The Tropical Isle bars often hav","useful":0,"cool":0},"ZvPiJOf0gPaRbFRwBCxiuw":{"text":"Only have one!  Only have one!  Only have one!\nIt's a \"secret recipe\" so I don't know exac","useful":1,"cool":0},"lDfAICh7E1P4R3GosTHCcg":{"text":"I spent a lot of time here when my fraternity held their national convention in New Orlean","useful":0,"cool":0},"DysFsJlL7BpbDILJL26c9g":{"text":"After reading the reviews on Yelp, I wasn't sure what to expect. Come to find out the hand","useful":0,"cool":0},"2OUsmfC6pFNVaxMxsTl6Dg":{"text":"Fun place to drop in for the infamous Hand Grenade. We sat in the balcony for a couple of ","useful":0,"cool":0},"B5DvT9FHvaqMnff_BviSYQ":{"text":"Good drinks, good rock music. We wandered in here when we hear Sweet Emotion by Aerosmith ","useful":0,"cool":0},"HxKSeTPNr8RpVt8dMXo1Kw":{"text":"Just like everyone else I came for the Hand Grenades.\n\nNo crowd on a Thursday afternoon. G","useful":1,"cool":0},"ZbX2j_k4_O27J567QCsRnQ":{"text":"Love the Hand Grenade!!! Lots aof good memories on Boubron street here.  Its the one in th","useful":0,"cool":0},"-fV25IPLWSkA1OfXurtt_Q":{"text":"Only gave this bar TWO stars cuz I didn't like the description for the first. It deserves ","useful":0,"cool":0},"NSjKvy7mD09qT_leD8Bv0A":{"text":"Definitely my favorite drink of my weekend in Nola.  I'm honestly not sure what is in it, ","useful":3,"cool":3},"b-2GD0_JnGIfPYMWTfqP4w":{"text":"5 stars for service, 3 stars for this very sugary drink that is popular on bourbon st. If ","useful":0,"cool":0},"N8tRuXQttrNYupGbvyd-oQ":{"text":"The hand grenades were tasty and sweet, but the staff was the opposite of sweet. The whole","useful":0,"cool":0},"FQN2lO7P_FkFvQnN8ZDy2g":{"text":"Even if you fancy yourself an anti-tourist establishment kind of traveler, you need to let","useful":0,"cool":0},"k-ni-oW_93NhyzRkLJ7WKw":{"text":"We wandered into Tropical Isle whose specialty is a drink called the Hand Grenade. What is","useful":0,"cool":0},"Hw1X0_QhZPvlL4H0dg5frg":{"text":"This place is so fun! The drinks are great (albeit a little spendy) but worth the novelty ","useful":0,"cool":0},"rR0fQGKTAVk8RNnAJrvKYQ":{"text":"I'm not entirely sure what \"e e\" is smoking, but it sounds like it's pretty good stuff....","useful":0,"cool":2},"6fnvwFsqt7Nw7ynZOiWNwQ":{"text":"Live music was nice to have. We tried the hand grenade and margaritas. Hand Grenade: EXTRE","useful":0,"cool":1},"W3rAHbaH_mjTlWFMB5siXw":{"text":"Fun fun fun. Good drink specials. Nice jukebox. We hung out here with some other drunkards","useful":1,"cool":0},"i2X9QSR-DoUGQP7FiHClIw":{"text":"Get your horny gator on! \n\nWhat is there to say about this place other than they do their ","useful":0,"cool":0},"6Fzy0VhG3-SZ6x2zkC6GUA":{"text":"If you want a quick strong drink for a reasonable price, this is your place. Unfortunately","useful":1,"cool":0},"j9v8glhpV1t3nkbcya891w":{"text":"My girls and I found ourselves here on our first night on Bourbon St. Just like how you ha","useful":2,"cool":1},"Inj6Pk-K_12sl_QYHnsdcg":{"text":"We got a round of Hand Grenades as our first drink in New Orleans and holy crap, this will","useful":0,"cool":0},"_N9tom5lkEPB5eGSVYaB9Q":{"text":"\"I'm in New Orleans drinking hand grenades.\"I finally got to experience what all the buzz ","useful":2,"cool":2},"GzWCanFEvQidjTEK1-o21g":{"text":"Gotta grab a grenade when you come to NOLA right?\n\nDefinitely worth the $9 and refills are","useful":0,"cool":0},"UyiRQQ8fN2Mu9bEERcVGmw":{"text":"When I'm in New Orleans, I almost always stop here to get a hand grenade. Typically, these","useful":1,"cool":1},"vF6jggw-wAX229naHvhCrQ":{"text":"The grenades are the reason to visit this fun crazy hot spot in New Orleans!! They are del","useful":0,"cool":0},"zQMMKQsp6dQL84paZJCt0g":{"text":"Very water downed drinks\n\nDon't use the lanyards to hold drink, lol the drinks are too hea","useful":0,"cool":0},"7ehybIuCvkTRwgeUG0cqXg":{"text":"Wanting to drink a hand grenade is the only legitimate reason to go to Bourbon. Haven't ev","useful":1,"cool":0},"x9vTMHx7t0UvR4ckVZUttQ":{"text":"SO MUCH FUN!\n\nWalking up and down the strip, you'll pass never ending rows of bars.  It's ","useful":1,"cool":0},"Y9mjAyn5RFvyiMBEhLlSPw":{"text":"\"Hand Grenade on the rocks please!\" I promise this will be all you need to satisfy your li","useful":0,"cool":1},"wzHBeNdEOvjwAKQ4tr6-wg":{"text":"Awesome bar. Very nicely decorated and the bartenders were very nice. Must try this bar if","useful":0,"cool":0},"IB9wXv3sFibMCrq261Uxmg":{"text":"We came, we saw, we... conquered...? A hand grenade is always on everyone's \"must try\" lis","useful":2,"cool":0},"4ndrtEfxYMtMKDuiDqUw4A":{"text":"Hell yes! Home of the Hand Grenade!\n\nReally, that's all I remember about this place. But 8","useful":0,"cool":0},"C2E5kmL-Ide6vsjXFP3Q5A":{"text":"- Hand grenades are a cheap 9 bucks\n- Hand grenades are vodka based in case you're trying ","useful":2,"cool":0},"PggcPrqFGkanzTy3uVIzGw":{"text":"It is very funny to me to see huge guys in camo jackets drinking fruity hand grenades. And","useful":0,"cool":0},"QsUsoKq55LMlFIV-r6XIlg":{"text":"Came here to try the hand grenade drink on the rocks, since that's what they are known for","useful":1,"cool":0},"lLsLhuhM9-ZHEfarG0_0tg":{"text":"Rule 3: Don't \"Google\" the recipe for the TI Hand-grenade\n\njust drink one.\n\nand then a few","useful":0,"cool":0},"9YCRbUtS9YCns01etIbmzQ":{"text":"If you're trying to do the \"authentic\" drink of NOLA bourbon street this must be a stop. I","useful":0,"cool":0},"mBCV-v5eImO8DbZg9GvO-g":{"text":"They get me every.single.time i am in the big easy.\n\n\"your not yourself here\" is the NOLA ","useful":0,"cool":0},"RHD-wzf9oDLOgqopwXRB9A":{"text":"These are not nearly as strong as I've heard or read on Yelp.  They look tacky as hell (bu","useful":0,"cool":0},"USeiBa1Azbg2hd0FM7waDg":{"text":"BOOM!\n\n\n\nBOOM!\n\nYup, this is the place to go for a \"Grenade\".  I've been to the Quarter ma","useful":0,"cool":0},"-ErGON6gQVXVjVv-9icYAg":{"text":"Came here for our grenades. So much sugar. I can see how people can go all night using the","useful":2,"cool":1},"n8gTqXS6XDawiiVUmfZBhw":{"text":"When in New Orleans my drink of choice is not the hurricane but the Hand Grenade! These dr","useful":1,"cool":1},"uvhjjms_ZiAngSSwVNwJkQ":{"text":"Strong hand grenade - $10\nI felt light headed halfway through. It taste sweet and a little","useful":1,"cool":0},"f6mD0BpI7QzFvT3L-c5UQQ":{"text":"Seems like a lively and fun place.  We were walking the street in the middle of the day an","useful":0,"cool":0},"Ai0SuX69A3m7HVtMUq0FdQ":{"text":"Our number one go to spot !! Always the first stop!  Get a hand grenade!!  You won't regre","useful":1,"cool":1},"OGjww8CF-gTj0b31nhLt0w":{"text":"My wife and I have been coming here for years when we visit New Orleans-great atmosphere -","useful":0,"cool":0},"QqptixwBxYFWd4hgaHS72w":{"text":"This place gets packed but most bartenders work quickly to move the line ordered a few han","useful":0,"cool":0},"mYw0OKnlGjTSy7ICcQDR5w":{"text":"Great place the Hand Granada are the best drinks an you are felling it after the first 3 o","useful":0,"cool":0},"rKNYkPW45N-JHSNP9NGRYA":{"text":"A NO staple. Each time I go to NO, we start the night with 2-3 hand grenades at the tropic","useful":0,"cool":0},"VShu_ZLsHPhDnK3fQr0YyQ":{"text":"Hand Grenades=YUMMY! They claim to be the strongest drink, not sure if they are, but they ","useful":0,"cool":0},"ZUrPR7fPLfyZbqqlCxWzAA":{"text":"The home of the infamous HAND GRENADE DRINKS!! as seen on many movies and one of my person","useful":1,"cool":1},"AcHgu9OAEXi7338IftnVQg":{"text":"The reason to come here are the hand grenades. They will destroy you. Don't underestimate ","useful":1,"cool":0},"rWGtoKmzWzR0hi56CMgfCA":{"text":"It's recently been brought to my attention that my reviews imply I'm nothing but a vapid l","useful":13,"cool":19},"JvIdk5QFVnsn6xa9jOQmcg":{"text":"This was our first time in NOLA but a lot of our friends recommended getting the hand gren","useful":0,"cool":0},"ZekECOBF-5JcNEwEHznqaQ":{"text":"Owner is a racist bigoted man. Always talking about how Muslims need to be banned and kick","useful":0,"cool":0},"PQqZdWkE1AC1uHsmmis0Bw":{"text":"I really very much miss this hand grenade bar so bad :(, I also miss the hurricane drink a","useful":0,"cool":0},"1CZ_OuCS3ubVjnN5y0JBiw":{"text":"I recently made my third trip to NOLA, and finally decided to give this place a try. I've ","useful":0,"cool":0},"y6E_UgbLvmX_JCYo4myQ9Q":{"text":"Super brutal way to start a fun evening.\n\nMy coworker and I were in a bar across the stree","useful":5,"cool":5},"HecEOzhqWrYqGNaYixLcQQ":{"text":"Fast and accurate customer service! The Hand Grenade was a good drink, I will visit again.","useful":0,"cool":0},"n9KvpB2dhvgLnSboHA46hw":{"text":"So I have to say my review is based on a limited time here. I wandering up to their \"to go","useful":0,"cool":0},"ct2clZRaSicOl-oAPHXLpA":{"text":"My experience here didn't start off all that great due to my interaction with the bartende","useful":0,"cool":0},"0FozC2_cROKHDUSXwSBLeA":{"text":"One simply does not go to New Orleans and not drink a hand grenade. These babies will do t","useful":0,"cool":0},"7yqH4UQ05XDuKa21a5M-1g":{"text":"So during my college days one of my friends had a crazy group of Welshmen decide to come a","useful":1,"cool":1},"yuGQi6bWDMq_Dl4J3Jkbtg":{"text":"Very cute bar. The atmosphere was fun. There was live music on stage which I love about Ne","useful":4,"cool":4},"ANsFN1nsfCOoTHbEfGnfzg":{"text":"Typical tourist bar, exactly what you expect from Bourbon Street in New Orleans.  Thorough","useful":0,"cool":0},"Ghs1S5zfOXfY53mk8zFwhA":{"text":"Tried the Hand grenade during Marci Gras taste so great. It does sneak up on you as the ni","useful":0,"cool":0},"BZSmOQZ8ZYugPE6UqQ6RSQ":{"text":"Yeah... back in the day one of my fraternity bros got me some of this hand grenade mix fro","useful":0,"cool":0},"_uw2uRpB-1VeMwdvu_pG8A":{"text":"This is the place to get the \"hand grenade.\" They come frozen for girls like me or on the ","useful":0,"cool":0},"B_2Jz4_dnL4um6gk6e0tUA":{"text":"Smells horrendous. The drinks are waaaayyyyy too sweet. I wouldn't recommend it for anyone","useful":0,"cool":0},"w9p05MapMlIzeXVXN3sE3A":{"text":"The hand grenade. A very dangerous (but fun) choice for Bourbon St. The drinks were really","useful":5,"cool":6},"PNC6GtJmdd-gPw5wH4iFqw":{"text":"We came for the iconic hand grenade but switched over the tropical itch once we learned th","useful":8,"cool":6},"T_WY5Dsxn4OBEzxyeSROZQ":{"text":"This chain of bars is where it belongs.  Pam and Earl, the couple owning these tourist tra","useful":1,"cool":0},"sdVheQzN_YEkLVIU660-PA":{"text":"Love the hand grenade and thank you for the Skinny! Their other drinks are okay, but the s","useful":0,"cool":0},"4PJD8A5ErfL98Rv-lNKqlA":{"text":"[Out-of-towner Review]\n\nA huge, touristy extra potent midori sour! Well, that's my take on","useful":0,"cool":0},"XlK6GkirfzqcJCR_2rOnqw":{"text":"As we walked up and down the strip each night, we noticed this place always had some of th","useful":0,"cool":0},"7Qojo8a49zJcnpD7PR8UkA":{"text":"Tropical isle creates memories by drinking their hand grenade lol it's in a tall neon gree","useful":1,"cool":1},"2NFlGt6azt31U70BQNt8hA":{"text":"You know the reason people go here?  Hand grenades. It was sweet and something easy to dri","useful":0,"cool":0},"zNTMmmwkVDxUqhsU3gWwiQ":{"text":"Obviously if you visit NOLA, this is a place you need to stop at least once (although we w","useful":0,"cool":0},"xCH392TD_uDFB5LXzeKG4A":{"text":"Somehow, we received an invite to a SCUBA conference networking event at Tropical Isle and","useful":25,"cool":26},"Q0eayPxvDzp_2DLeY-0TEg":{"text":"If you want to experience Bourbon in all of its glory, I recommend going at night and havi","useful":0,"cool":1},"rnrV9aXw_qTrQ--R9Bva6A":{"text":"everyones ALLLL about the hurricanes in nola but I like the grenades more! They offer a \"s","useful":3,"cool":2},"7eIyZBB9hbdKGfpVZXv9_g":{"text":"We went during happy hour - it seemed very dive bar-like. Hand grenades were SUPER sweet. ","useful":0,"cool":0},"bpknEjoTL4MG_dDv9BEG9g":{"text":"No one comes here because they actually like the taste of a grenade. It's more for the exp","useful":1,"cool":2},"VaD1yFdCzzk0VRQGHafhgg":{"text":"Not your fanciest place but it's home of the Hand Grenades. If you want a drink that will ","useful":0,"cool":0},"cDNmxLf7yGiQmR6hgMsm9A":{"text":"I came here for one thing, and one thing only... The Hand Grenade! I've had so many friend","useful":1,"cool":1},"pEVcufIWsa7YMv3JlOYPjw":{"text":"Great balcony, wraps around the corner of the building, great vantage point for people wat","useful":0,"cool":0},"U4_jyIxyFWXI_mTvkZrzRQ":{"text":"Had to have a Hand Grenade, but one wad enough. Too hard to hangout to long after drinking","useful":0,"cool":0},"WWDKGIhxGAslCdIvL13isA":{"text":"Awesome place! I love the decorations! You can sit and watch the games while having a drin","useful":1,"cool":1},"Ybk7LiduQ4xJrrgsah40Zw":{"text":"Two words: SHARK ATTACK\n\nThis place had super fun drinks & a live band elevated on a stage","useful":3,"cool":3},"UNTzgyfJfzGWbJEPPANYFg":{"text":"You want diabeetus? You got it! These hand grenades will launch you straight into the bad ","useful":5,"cool":4},"1mn6sxbp8GuKI-uCGAXUww":{"text":"We hit this place because we were told they had the best hand grenades! We liked it so muc","useful":0,"cool":0},"hmWu4mRSeteoA6jOFI1iGg":{"text":"Here's a place I happen to have missed my first time around in Nola, another place that se","useful":4,"cool":3},"r9QCOUuPpkoEpDlc7lUJ4Q":{"text":"The grenades are awesome, however, I did not like the way the bartender treated me so I ha","useful":0,"cool":0},"XrLgswg67AL7IX13zEhJ6Q":{"text":"We came for Mardi Gras and we were told we HAD to try a hand grenade by everyone we knew, ","useful":0,"cool":0},"B7-pZT_cdQu5ov_mL9kiCA":{"text":"I stopped in here night of Mardi Gras just for the hand grenades. It was pretty packed. Th","useful":1,"cool":1},"eWBc8Vaw7DfAqQes4p4j5Q":{"text":"We were told we need to come here and im glad we did. We each got a hand grenade and i lov","useful":0,"cool":0},"UpcWrpg8a4papV6a8Gk7Bw":{"text":"Nothing wrong with a touristy spot when you're an actual tourist. Came here with some girl","useful":2,"cool":1},"cp9wNMTK16KIGRkOsXzrXA":{"text":"Mainly a tourist attraction on bourbon street. Lots of sugary drinks if that's what you ar","useful":0,"cool":0},"ntSHr3k_18NM8Sm-i4EP8w":{"text":"Local bar which serves the infamous hand Grenada that everyone was walking around with. De","useful":4,"cool":2},"-qGmbeKOkbZZISM0o_H2FA":{"text":"Delivers strong drink. Service was meh but time of day is slow anyways. Nice and cool with","useful":0,"cool":0},"tFHUMuSMXEXQDSrPOPBzZw":{"text":"The Tropical Isle is a must stop and grab a few hand grenades to go and enjoy this absolut","useful":0,"cool":0},"jfzV8QbUTHv0Xm739Rem8g":{"text":"Frozen hand grenade is ridiculously sweet but definitely powerful. May want to try the ski","useful":0,"cool":0},"rkqytEzNWhmFCnDnI-YxYQ":{"text":"By the time we made it to Tropical Isle for their signature \"Hand Grenade,\" we were in ful","useful":0,"cool":0},"zkfZL1eLZyq0oWI_lc957w":{"text":"SooOooO...\nwe stopped in NOLA for a foodie stop in transit to California!\nI used to live i","useful":0,"cool":0},"L0-0Soj6e0otpFOemu5dIg":{"text":"My first time being here of legal drinking age and a friend insisted I try what's called a","useful":0,"cool":0},"Z_MfejdEW8UaTfMOJPG7Hg":{"text":"Cool spot to get your famous hand grenades! The staff is friendly and let me try their fla","useful":0,"cool":0},"2NqICVJ5CuNOtecdALWj6Q":{"text":"If you're new to drinking, I don't suggest you come here. You're going to taste this melon","useful":0,"cool":0},"7LYfdjZt7MMvbNdNNDwA3A":{"text":"If you're trynna get drunk... I mean basically just drink the grenades from here. They're ","useful":0,"cool":0},"l6SPw7A6ZxhKmlCYCAR9GA":{"text":"you gotta have a hand grenade when your in bourbon street. head to tropical isle and grab ","useful":0,"cool":0},"wD8Rxuor57BLuNXoRMPHdA":{"text":"This place is a must for any NOLA first timers. Grenades are a legendary drink here, and y","useful":0,"cool":0},"0Z12AOd8aPIB9SlhwJIL8g":{"text":"How are the TWO hand grenades that I bought the same price as the THREE that my sister's b","useful":4,"cool":3},"jUzDGEytsvDdVeHiQZLySA":{"text":"Decent drink...quick delivery; hard to hear the wait staff.\n\nRecommend trying a hand grena","useful":1,"cool":0},"3hhzX0V4FB2Vfk8QS4-RIw":{"text":"Tropical isle is one of the bar/pub you must stop in Nola. It's small but has live band an","useful":0,"cool":0},"enccR9-F-kSfbtzquvEM0w":{"text":"WTH was I thinking?  It wasn't like I didn't get a warning.  So I was told that these hand","useful":1,"cool":1},"xh6sPBl7krHmYd6Y5anduw":{"text":"Everyone talks about Bourbon Street and then everyone talks about the famous Hand Grenade ","useful":0,"cool":0},"mR70PJmXpg-lCCtyZ_YKPA":{"text":"Of course we had to stop here to try the world famous hand grenade and check it off our NO","useful":1,"cool":1},"sa_xk_QOlwRb3e-7gD6s3A":{"text":"Their grenades are Amazing better than VEGAS yard drinks and way cheaper! Taste like water","useful":0,"cool":0},"uNpa_z0cFh8ErkoUVeJmXw":{"text":"Tropical Isle is actually not that bad. OK. I said it. A touristy bar in the French Quarte","useful":2,"cool":1},"1h43LqHiIYjxMEpLAsyagg":{"text":"I recommend the grenade on the rock (so did the bartender!)\n\nI tried both versions but the","useful":0,"cool":1},"NrhZW_nLHzIoCxdD10yjxw":{"text":"We were staying at the Maison Dupuy Hotel and this place was like a block away. We already","useful":0,"cool":0},"yaUUmJlQe5Z3YohqVNIlPQ":{"text":"As you come upon a dancing grenade on bourbon street, get to shaking it. Because NOLA.\nA d","useful":0,"cool":0},"o81-TOixcIZmT96eOK2siw":{"text":"It used to be the famous drink of Bourbon Street was the Hurricane by Pat O's but they hav","useful":1,"cool":1},"9BnajI6BrfpLN3f5IJrSeg":{"text":"So I guess when I rate Tropical Isle, I am really rating the Hand Grenade because that is ","useful":0,"cool":0},"JOe0nK7jjRzY1WeATqNy0g":{"text":"Heard about the hand grenade from m a friend. So decided to stop in on this trip to New Or","useful":0,"cool":0},"YJfdf0Wf812IvzwmfLH_RQ":{"text":"Heading into New Orleans for Mardi Gras for the first time, I had no idea what to expect. ","useful":4,"cool":1},"kwemPX-17ujH3Gz7bWHynA":{"text":"Had a great time here, highly recommend the hand grenades! The shark attack was also a fun","useful":0,"cool":0},"GFgxhcNAnPlYwXwNYlP38Q":{"text":"Come here for the Hand Grenades, and that other weird drink with the giant plastic shark i","useful":0,"cool":0},"9sfveRnw0j00_3xq8YyM5Q":{"text":"When I tell you this drink is amazing it is, taste like an pineapple based drink. It hits ","useful":0,"cool":0},"AUpq9ohdRIE6q4VauB-bkg":{"text":"Leigh the bartender with the eyeglasses was so rude. My friend ordered a drink and she tol","useful":3,"cool":0},"N0jHeet42Ae_NiTzAkybZw":{"text":"HOME OF THE WORLD RENOWED HAND GRENADE and the baby daddy of some drunk explosive nights i","useful":5,"cool":3},"nmqUJJeDiCplmOILKf6lhA":{"text":"$8 for a refreshingly tasty and strong hand grenade in a cute cute cup plus a mini grenade","useful":0,"cool":0},"9KeFWKkDa_0agnufWveZOQ":{"text":"Really enjoyed this place! Stumbled across it when we needed to get cash out the ATM (whic","useful":0,"cool":0},"9vnpCIYqghRAXI9IgcJDLA":{"text":"\"Grenade\" it is!! The bartenders are amazing too. 2 grenades will drive you all night long","useful":0,"cool":0},"1VRfl1U2Z_syW_fIauSvNg":{"text":"BEST DRINKS ON BOURBON STREET!!!!! \nY'all, I tried most of the mixed drink places on bourb","useful":0,"cool":0},"P8P8KT7ja2SUXKSMiyqJPg":{"text":"I loved this place.  In the midst of all the crazy and out of control places on Bourbon St","useful":2,"cool":2},"QGSWe9pEc_1SsJphd906EQ":{"text":"This place is made for Bourbon St. They are known for Hand Grenades. Just get one or two o","useful":0,"cool":0},"nLpDF4wAVwi-f0zgoRdr5g":{"text":"The almighty Handgranade. These used to be bigger for the price. Now they are a bit steep ","useful":0,"cool":0},"4UzewyeK14mgbeCSoBMAOg":{"text":"Home of the Famous Hand Grenade Drink!   Balcony seats are the best view on Bourbon street","useful":0,"cool":0},"-2XnKlT9VrYwUO-w3rzoYA":{"text":"You cannot go to Bourbon Street without dropping by Tropical Isle.  It's seriously the bes","useful":1,"cool":2},"DiI9549aYKKjiiwAFrGFwg":{"text":"Stopped in this location with friends. We're excited to try the shark attack which was a f","useful":0,"cool":1},"HGzGTISZnkjVGSMQx1m3Xg":{"text":"It's one of those things you have to try at lease once when you're in NOLA. You will blend","useful":1,"cool":1},"raUEqDPH4quPdvz2XyrNWQ":{"text":"My favorite drink on Bourbon Street! I always make sure to go to Tropical Isle when visiti","useful":1,"cool":0},"j86QWp-lZ6kuf05sjG11hQ":{"text":"If you're looking to hang out with locals, avoid Tropical Isle. That being said, this plac","useful":0,"cool":0},"skJLYtspZSxRoWC36DB25Q":{"text":"Fun bar, lady bands, friendly bartenders let you sample the signature hand grenade drink, ","useful":0,"cool":0},"IFgrkH7BaKLUwNnvRk-fLw":{"text":"The home of the grenade! AND the FUN shark attack! Go ahead, order one ;) This place is fu","useful":1,"cool":1},"1dX5nRjGFUVt-TieE8rxyg":{"text":"The hotspot on the strip on Bourbon Street for good grenades and other daiquiri drinks. I ","useful":0,"cool":0},"dJ2c_xQKGHhH61AkLTHguA":{"text":"No trip to Bourbon Street in NOLA would be complete without at least a couple of Grenades.","useful":1,"cool":1},"Gt4_YcclN4uPpZrlY19WMg":{"text":"The only hand grenades in Nola!! These will get you drunk really quick. They come over ice","useful":2,"cool":0},"mClp5Ej9NQfqTWRtMprnfA":{"text":"You can not be visiting NOLA without getting a Hand Grenade from Tropical Isle. \n\n\"New Orl","useful":2,"cool":1},"KwMQouUO0F0aE_3L5qIxwg":{"text":"Go ahead, you're on Bourbon Street, you're checking it all out, might as well stop for a h","useful":1,"cool":0},"RLGu_Bj98-hco8ufTgRZoQ":{"text":"Yeah Hand grenade did turn out to be a unique NOLA cocktail. It is a cocktail with some pi","useful":0,"cool":0},"N_9BBeAVrJj9B5ussVDl_w":{"text":"Just your typical Bourbon Street spot for frozen daiquries-in pretty large styrofoam cups!","useful":0,"cool":0},"oqzyk-VKSimeDFwyCQZGwA":{"text":"Get the Shark Attack drink. Hilariously fun! The grenades are good and hit you like a ton ","useful":2,"cool":0},"VRS0nqlX9QYqb-VWyQ4FhQ":{"text":"There's only one reason my boyfriend and I came here, and that was to try the iconic Hand ","useful":2,"cool":2},"eRgtOQdN-SA3iTdTStAMGA":{"text":"Live music ..great drinks and even better people !!! We came here not knowing anyone and l","useful":1,"cool":0},"OWQysAUuSMjV1LQUCHOTkA":{"text":"This place is in the eye of the French Quarter! Drinks are so good! The Grenades cost like","useful":0,"cool":0},"CL2Xj0AHlh_qtx8KpLCymA":{"text":"Ummmmmmmmm what type of sorcery is this place!?!?!\n\nFirst of all yes you have to get a gre","useful":5,"cool":3},"VKFhq4L3LLdI0SCqPn0gLg":{"text":"This place is awesome the drinks were so good and the bar tenders were great. Order the ha","useful":0,"cool":0},"AXv7cuY_aTOdc85UGkMDWQ":{"text":"Not enough alcohol taste like I was drinking juice and the bartender was a total dick.","useful":0,"cool":0},"yKEOU5QQoK_BE9sWY_p_fw":{"text":"How can you visit Nola w/o a Hand Grenade?  There are several Tropical Isle's but this one","useful":0,"cool":0},"7VxsGDKDPLRrzxVFWp0hVQ":{"text":"Party atmosphere. Finally got an opportunity to try the infamous hand grenade and it was d","useful":0,"cool":0},"3oifLmhg02NVFEC6IaP_SQ":{"text":"Worst service. I had my paper I.d from Georgia at the age of 30 and they wouldn't take it.","useful":0,"cool":0},"kQtxA9_koabDFkD1Buo25A":{"text":"Loved their hand grenades (cocktails). Men's bathroom was small but not crowded.","useful":0,"cool":0},"sTp9-6ZhCvYaX0xQ3OCgTw":{"text":"Looking to get bombed? You found the place! Order a shark attack for a friend and watch th","useful":0,"cool":0},"t3r_NMnet8TY9ngso7QAEw":{"text":"When you think of NOLA you picture starting your night with a strong drink. There is no be","useful":0,"cool":0},"Usm-JWLhxh5T2uyQ5WJjFA":{"text":"The only place in NOLA to buy a Hand Grenade.\n \nThis NOLA chain doesn't serve good food (t","useful":0,"cool":0},"RmSrYKjdCmeV7vsVuUtSfw":{"text":"I stumbled in here during the Mardi Gras blurriness and barely remember leaving (although ","useful":1,"cool":0},"cJyHtFLaPmoz_juhu43yog":{"text":"Had the hand grenade gave me a stomach ache but my bartender was very nice it was $10 and ","useful":0,"cool":0},"UAN_EXGAv-jW3vrSy9_x4Q":{"text":"Hand grenades are deadly. Drink it slow and don't drink more than 2. \n\nIt's definitely a m","useful":0,"cool":0},"rc3o7oY4kRzFdemcTMnOnA":{"text":"In my opinion the Hand Grenade (Tastes like a Melon and Vodka mix) is okay, a better tasti","useful":2,"cool":0},"lefp5jqmUdcjxCImGrBbBQ":{"text":"Super fun NOLA bar and home of the iconic (and tasty) hand grenade!!\n\nMy friends and I wer","useful":0,"cool":0},"2Be-nH3rm5b_5remxyTKTA":{"text":"It's NOT a night out on Bourbon street without both a Hurricane and a Hand Grenade.  Altho","useful":0,"cool":0},"0rGbu9I3NHBXtm6_FGsjDw":{"text":"I guess if you are 21 and only want to get wasted ass drunk and pass out in the street. Th","useful":3,"cool":0},"1AhQd4Mh0LulgkBV7qMKwA":{"text":"The Shark Attack ($10) was my favorite drink. It tasted sweet but not too much. My friends","useful":0,"cool":0},"o6fY8TJfXBKW5m8dNU7T7Q":{"text":"My first time being here of legal drinking age and a friend insisted I try what's called a","useful":0,"cool":0},"Kn7eudxMmgJl8KTojZgBAg":{"text":"Ohhh Tropical Isle and your beautiful bright colored sneaky drinks... You are a threat in ","useful":1,"cool":0},"3-dNuOANu3g2xPJ1sWFKHg":{"text":"If you want to end up shit-faced in New Orleans, this is your one stop shop. Their hand gr","useful":0,"cool":0},"iOgUi2yrG1cf1LUETPnGwg":{"text":"Definitely a go to drink spot in NOLA. The hand grenades are the most popular drinks, but ","useful":0,"cool":0},"ykgJ4eVBRjIC32V4EHDD1w":{"text":"The hand grenadines are awesome I come here every trip to the quaternary to get my fix! I ","useful":2,"cool":1},"4G-_aPD5t3PwfZIRcWYgTA":{"text":"Everyone said we needed to try a Grenade while out on Bourbon Street. I saw everyone walki","useful":1,"cool":0},"NEbazer15Wk_CqNkO7NcDw":{"text":"My cil's (cousins in laws) at the time were unfortunately tasked with the duty of showing ","useful":1,"cool":0},"LR1f0YjgIksq7LXXgo3Bvg":{"text":"Florence is the absolute best! She is kind, courteous, and goes out of her way to ensure w","useful":0,"cool":0},"4dxNSs7bBg_2eL5D1_ujPA":{"text":"Ehh...not worth the hype. Just one of those drinks to try just because it's a popular thin","useful":0,"cool":0},"5t-vqznXCvZJu_47I4ojYw":{"text":"Walking on Bourbon and of course we had to get a hand grenade. I have had them before but ","useful":2,"cool":1},"DgjuF_NMh-KVevR0RoDnJg":{"text":"Love the Skinny hand grenade! It was nice to come in and sit at the bar and have a drink! ","useful":0,"cool":0},"BEPvYAI8pe3ipwejlbestw":{"text":"Leigh the bartender with the eyeglasses was so rude. My boyfriend ordered a drink and she ","useful":2,"cool":0},"LAg2V9XiqqG4jPSWHeul9A":{"text":"Stopped in for there famous hand grenade and the shark attack drink! Hand grenades taste i","useful":1,"cool":0},"ctJj9m_rGj0iiGJSse9gkw":{"text":"These drinks are really not that strong... and for $8, you're better off getting 3 beers f","useful":0,"cool":0},"2we2DaTmZcmbFLU9Nwna5g":{"text":"If you're in the French Quarter and you enjoy fruity drinks, or if it's your first trip an","useful":1,"cool":2},"Eh3w5bwVT7Y6afQilG1x8A":{"text":"Be as it may be the home of the original Hand Grenade, the drink is still too sweet.  Thou","useful":1,"cool":2},"vc9i16ogNrHQF0E6gOluOQ":{"text":"This place is always a blast! They have a great selection of fairly iconic drinks, though ","useful":0,"cool":0},"p5Tq6r46rDiiPynRrP1cOA":{"text":"Kyle was the bomb ass bartender!! He offered a great conversation and I enjoyed myself whi","useful":0,"cool":0},"SkiFG4koqDuFbxy4i_USJg":{"text":"The bartender was very friendly and courteous! We wanted a drink to blast us off Bourbon S","useful":0,"cool":0},"hZ2SpOdQmHH2xlVIqAVcbg":{"text":"We went back to this bar every night we were in the Quarter because they have a live Cajun","useful":0,"cool":0},"Y_uRBcZwgWdU1qaUuj77Dg":{"text":"Came here one night and had to get the hand grenade. It was actually pretty good. Very swe","useful":0,"cool":0},"xoUsJLPSOFnI_NM-RsWEew":{"text":"We went on a Friday night around 10PM and we pretty much had run of the inside. Most peopl","useful":0,"cool":0},"mVedNnINmLoqnTSHkX9LGw":{"text":"Do you read the New Orleans Bible? Because there's a passage I've got memorized...\n\nBourbo","useful":6,"cool":8},"MWrg7w_9wNblJ0FHXsMUow":{"text":"I know everyone is writing about this, but im telling you, the hand grenades from this pla","useful":3,"cool":4},"75YZD7uVbOxNFztLK6hU3Q":{"text":"This place is DANGEROUS!  This is where you can get one of the famous hand grenades which ","useful":0,"cool":0},"9xcodqgpc3f9YT9optGJcw":{"text":"Ahhhh the Hand Grenade is sooooo good! We discovered this gem too late in our trip! I read","useful":1,"cool":0},"ZZLseWL8Wbq9-7fe9Bg3Xw":{"text":"Is it over the top tacky (but honestly what isn't in New Orleans?)...yes. \n\nAre the hand g","useful":1,"cool":1},"9LMVo63Q1Lqaz2PxalWTnA":{"text":"Out of the two tropical isle I have tried this one is the better of the two. Both places I","useful":0,"cool":0},"KqLKt2FuWy-TbrPItz5s5g":{"text":"The home of the grenadesssssssssss!!!!! First things first; grenades r super sweet. The pl","useful":1,"cool":2},"wEwBMWtY8uFaALSyXVEmHQ":{"text":"Oh Blergh.\n\nI'm sure I'm in the minority, but I did not like the hand grenade going down o","useful":4,"cool":4},"5M-RkxU87sUWiGbIZEB1DQ":{"text":"Hand grenandes were bomb. Best served on the rocks, but they have a slush option as well.","useful":0,"cool":0},"ES5FenSzXJ-QfupWAUNmRg":{"text":"This bar has a special place in my heart! Tropical Isle is one of those bars in New Orlean","useful":0,"cool":0},"f6W2ejRHzdTkPlvfEUCimA":{"text":"This bar is towards the end of bourbon street & is a great location for people watching. W","useful":0,"cool":0},"UWEydKH1JCeotKazGT4JYQ":{"text":"Tropical Isle was one of the many places that I had previously bookmarked prior to my firs","useful":4,"cool":2},"DWu7SMEOGp5m2YSkMBHZnw":{"text":"Hand grenade is delicious! Also loved the Shark Attack! Very entertaining! Also love the l","useful":0,"cool":0},"PYXlFx0benHZ7Zi8dCJalg":{"text":"This is a must stop on Bourbon street, you see everyone walking around with Hand grenades ","useful":1,"cool":0},"A6MT3Aai6H8XtgJg3vlfxg":{"text":"i would give zero for the racist homophobic  bartender. first of all, just because i order","useful":8,"cool":0},"2DyRZc87RUujLy30pnQREw":{"text":"If you've never had a Hand grenade before, you gotta come here to grab one. You can get it","useful":3,"cool":2},"UywovzS2-V-kTwHRYeeBEw":{"text":"Bang for your buck: 10/10\nQuality: 10/10\nService: 10/10\nAmbiance/Location: 10/10\nOverall: ","useful":0,"cool":0},"6OF0DN2-tN-FHYb0d0VH-w":{"text":"Strolling along Bourbon Street on a beautiful, Spring day, we stopped by to order Hand Gre","useful":2,"cool":1},"Umvt2lMkIoS1pMkY131r9g":{"text":"Home of the hand grenades. A fun place to grab a drink on bourbon. The hand grenades are a","useful":0,"cool":0},"T3Dt2UBdVIJANiORZo4bQQ":{"text":"I like to drink.\n\nI like partying with other like minded individuals who aren't scared of ","useful":3,"cool":3},"xM8xO91coaapuy6cDii9nQ":{"text":"we were looking for a place to chill and enjoy without getting to crazy. \n\nfound this plac","useful":1,"cool":1},"2imnvX5wYg6GH9431xqdLQ":{"text":"Home of the original Hand Grenade! My wife absolutely LOVES this place! The atmosphere is ","useful":0,"cool":0},"nW2T0rJICxYLx4RU2FK8ww":{"text":"We went here early Friday afternoon and enjoyed ourselves. The grenades were good and stro","useful":0,"cool":0},"Ken7_B9iGu7jw9YEJk1Bvg":{"text":"Came here for the Hand Grenade, aww yeah. It was the first drink I got when I came to NOLA","useful":4,"cool":4},"OAmoXhDX7RI4R6oAdhdmjg":{"text":"The last time I visited this location was 5 years ago! Goodness! That was a long time ago.","useful":0,"cool":0},"GWRz7ePtoVV0cH3QpbngdA":{"text":"Hand Grenade.  That's it.  That's the Tweet.","useful":2,"cool":0},"LXlsayflpEhhLsGnT1weow":{"text":"If you've never been to New Orleans, you should definitely get the hand grenade.  They als","useful":1,"cool":1},"ooEF6yuUXrM2jKw_AmXS2A":{"text":"The Original hand grenades!!! Sweet/Sour tasting Daiquiri!!! A New Orleans must!!! Liquor!","useful":0,"cool":1},"6mTtJoszQ4YqVqbsXPyATw":{"text":"I can't even count how many hand grenades I got while visiting this town ! omg it was sooo","useful":0,"cool":0},"S4KHmaoRHf2ASBgyeNmSFw":{"text":"There is no other way to describe this place other than extremely fun. The decor inside is","useful":2,"cool":1},"2Z_7zm3ajg6iJLJnydthWg":{"text":"My bf had to get a hand grenade while we were on Bourbon Street. It's the touristy thing t","useful":8,"cool":4},"wrLUcegUNEaqHyl2p3sIPg":{"text":"Hand Grenade is awesome! Russ was amazing! 5 stars. The shark attack was such awesome ente","useful":0,"cool":0},"_T8f46F2RCriGM_zUQI9NQ":{"text":"If you want a good frozen drink on a hot day, stop here. The bartender was really nice. We","useful":4,"cool":2},"a3mwLSmSFNjezU27oR2mtw":{"text":"The name of the drink is a hand grenade and the goal is to get you bombed. The fog of war ","useful":0,"cool":0},"Eb6UJ_z7HXADa8N85kOa6w":{"text":"So then this place is suppose to have this super duper strong hand grenade drink and I'm j","useful":1,"cool":1},"YC8wG37OelIqHem4ph9mVQ":{"text":"Those hand grenade drinks are strong but sweet in flavor.  I was good with just one. Could","useful":1,"cool":0},"R5QTDRe-M0S-vAM1bqW9IA":{"text":"I recommend the hand grenade. It's a drink you must get if you're in Bourbon Street. It's ","useful":0,"cool":0},"8QYQm4UKX6gbcNdP0IX8tg":{"text":"Tropical Isle was my first stop on my first night in New Orleans on Bourbon Street. I had ","useful":8,"cool":9},"cy667CV5pMSLUYVyXc0TZw":{"text":"I heard about Tropical Isle on a travel blog before I visited NOLA so I already had this p","useful":23,"cool":22},"XsTEoVyWL10OqhLCGol5kQ":{"text":"I felt obligated to write this review and warn those who don't know about the famous grena","useful":3,"cool":2},"nKVpxZjXbmqxXEg0XxG3Mw":{"text":"Fun atmosphere that serves the hand grenade everyone comes for! Got a large hand grenade a","useful":0,"cool":1},"9vRXA1vnZrPurYxUNLISpQ":{"text":"This place is best known for those neon green drinks that you see everyone carrying down B","useful":3,"cool":0},"_kS5tEI0h7Hl83QikQ2Zkw":{"text":"DO IT. You just have to do it. On the rocks, not frozen. You're welcome.","useful":0,"cool":0},"YnMJBBryxpJxJ6GbXCxsbw":{"text":"Came here for the Hand Grenade and man, I was definitely not disappointed! Service was qui","useful":1,"cool":0},"aY83ccPp--sNOnt3RTBCQg":{"text":"Hand grenades are very popular in New Orleans. It's great that you can drink in the street","useful":1,"cool":0},"qlsR9QXYVWYbLAgIqe-gcg":{"text":"We came in last night around 8pm to get hand grenades. The bar downstairs was heavily over","useful":0,"cool":0},"5G9Tz0z4oZ-koi_NZ_Mi2Q":{"text":"Oh Tropical Isle and your hand grenade drinks!  So the three for one happy hour sign was b","useful":1,"cool":1},"d4bjAc5X-nWiOzG7vgt7VQ":{"text":"The hotspot on the strip on Bourbon Street for good grenades and other daiquiri drinks. I ","useful":1,"cool":1},"NiKuDW2We5aLEMuk8fTkIQ":{"text":"Need a nice cold frozen drink to keep you company as you walk down Bourbon Street then gra","useful":0,"cool":0},"ZfM6GrNojD0ADwBBl15-MQ":{"text":"SHARK ATTACK. It's a fun place to go for tourist drinks. I recommend trying the shark atta","useful":1,"cool":0},"7CmoLUcrV3GoIues--xZfA":{"text":"Oh, Lord. \n\nHand grenades. \n\nDO NOT think you can defeat the hand grenade. This is an impo","useful":6,"cool":3},"TN3AGBcAcQ5ClHilijW1nw":{"text":"Good cheap drinks but the smell of vomit and bleach is rampant at this location, as is mos","useful":0,"cool":0},"J7MgssTcIJ4V6JETq0jvdw":{"text":"Another great fun time spot with a group: lots of strong beverages and sing-a-long music. ","useful":2,"cool":2},"uM4U2WRsL6eed_xopqhTKg":{"text":"I came back after a 3 year hiatus. I'd give this place 100 stars. \n\nHand Grenades never fa","useful":0,"cool":0},"iRgQQlFdQLWz32xlyUycMw":{"text":"We walked down Bourbon Street and saw all of the people carrying these big bright yellow d","useful":0,"cool":0},"-CbkHpd2tcXYwF8Ah7xR7Q":{"text":"Get a hand grenade, you won't regret it. They get you f***ed up lol There was a live band ","useful":0,"cool":0},"mQKcwBrgB5DLQQ2TAf5OzQ":{"text":"I didn't really stay long at this bar but this place was one of the many places that sell ","useful":2,"cool":1},"cWHXWJcxMVMInGLJBcRE6Q":{"text":"This place is so fun! My group and I came here twice during our trip in New Orleans to get","useful":1,"cool":0},"_VFjGp2SwGgyHIyYZIBGiA":{"text":"Nothing to write home about, but a $9 drink that comes with a souvenir cup is always nice.","useful":0,"cool":1},"LAoTW_-uZuXUPfQrjTzsZA":{"text":"Have you ever wanted to drink a pink starbursts? This is it. So amazingly sweet but not ov","useful":1,"cool":0},"ji7XyjySdojj3aZWHuGpGg":{"text":"LOVE this disgustingly dirty little bar!!!\n\nWe come in for Mardi Gras every year and alway","useful":1,"cool":0},"0imbAIqcwUKROiZO5Hh6Ww":{"text":"When in New Orleans and bar hopping along Bourbon Street a must stop is Tropical Isle.\n\nWh","useful":14,"cool":18},"c4DKQmk16wi1tTN8d-OHyQ":{"text":"The only place we got our hand grenades during our stay in NOLA, as we were only right dow","useful":1,"cool":1},"gj5S3U0WpWqXmYG0pkEdpw":{"text":"Absolutely nothing negative to say. Great place. Great drinks and spirits. Great service. ","useful":0,"cool":0},"1vUEjKvz5QMOA0Dkkf1S9Q":{"text":"You've heard about them...words out...the rumors are true..the grenades here (or any of th","useful":1,"cool":1},"a4iAvDnzK59_45HRAIqO7w":{"text":"The melon-flavored Hand Grenade ($10) is their signature cocktail. It is served in a green","useful":4,"cool":2},"DgpoHwu8qo0rkDXxJW_0ig":{"text":"Hand grenades are strong and reasonably priced.  It's always crazy busy but they serve you","useful":0,"cool":1},"3GU9HQAJMGQjsGRn8Zw02w":{"text":"I wish I could say more about this place, but let's keep it short and simple. \n\nSo we got ","useful":0,"cool":0},"QmNrHxN7UahtdliH_kAuUg":{"text":"Small little spot on Bourbon Street in the Quarter, and home of the infamous \"Hand Grenade","useful":0,"cool":0},"lSjx9e9RcDHb3mAOUgJ-Eg":{"text":"Good drink... will be back! Nice and sweet... but packed with a punch... Love it. Now wher","useful":1,"cool":0},"uYwijlQixLJQbwI-uszEyg":{"text":"Not much to say! Stop by and get a hand grenade while your on bourbon. It's one of those t","useful":0,"cool":0},"8-kLMwQBKpzACaMJKVvkJg":{"text":"Solid place along the madness on Bourbon street. The nights we visited here they had a liv","useful":4,"cool":3},"g-Ki7pek7KM6sqrknyxWIQ":{"text":"Don't go in here expecting a posh spot because it's not. It's pretty much an oversized hol","useful":0,"cool":0},"eUVL-YdbycrcIv37NDpBOA":{"text":"I couldn't give two flying fucks whether this is a tourist trap, will give me Diabetes, or","useful":0,"cool":1},"wthAWiGsemyPOjy3Dxul8Q":{"text":"We stopped by during a pub crawl on Bourbon Street and had a great time. They had some gre","useful":2,"cool":1},"qncln6AnVgvbJishZescFw":{"text":"Tropical Isle is the producer of those green drinks every first timer and out of towner wa","useful":1,"cool":1},"axFvrwMIJm6S77g5Gd0jZw":{"text":"This place is just another bar on Bourbon Street. But after watching someone leave the pla","useful":15,"cool":12},"VymH1Z3EyMH-DZbAHn99Cw":{"text":"Stopped in for the legendary hand grenade!! we went in to get a drink but sat at the bar. ","useful":0,"cool":0},"IJwWH5E76Wu_hWbWsbmFGQ":{"text":"Another place you've gotta try at least once.  There seems to be one of these on every cor","useful":0,"cool":0},"wH7eLTX4i0jFtZoL5wEPxA":{"text":"Great drinks! Wish the bar space was a little bigger. But the drinks are good I also like ","useful":0,"cool":0},"S4wGlNox8MWTczW6zL-clQ":{"text":"I came here after a friend from school told me about the Hand Grenade. I was curious so a ","useful":2,"cool":1},"QQG_HYrnCdIyaXti488wDA":{"text":"This is the home of good strong drinks. I got a Luau which is a rum drink with (they claim","useful":11,"cool":10},"ym5ENxbBbk1zyUHED1j6zw":{"text":"The bf and I were on a mission to drink around the French Quarter and Tropical Isle was ou","useful":1,"cool":0},"Gx-VhtvGRyEzdKNaFlCOPA":{"text":"Hand Greandes.....I dont think there is much else to say.....That and a good band. I loved","useful":0,"cool":0},"W12sRqX_m4AgizKxuF7Mgg":{"text":"My stars are more for the environment of this bar than the drinks...although the signature","useful":3,"cool":3},"smz00BmAkUCqibESt7UVnw":{"text":"The home of the infamous hand grenade and certainly one of the most well known bars on Bou","useful":13,"cool":12},"jyVM9sKYA5AEYU7uyimcZg":{"text":"A cocktail review - the hand grenade.\n\nI've been to New Orleans a bunch.  I love that city","useful":2,"cool":1},"wIPj5MioFw0PV0Yw1cAWLQ":{"text":"I was told that when coming to NoLa I needed to get the grenade drink. So I did. Tropical ","useful":1,"cool":1},"0ymwj4xJBvPNz9MjVJvQCQ":{"text":"Had to stop in and get the famous hand grenade everyone was talking about. It was $20 for ","useful":0,"cool":0},"Fp4O2TL6mPxi1ktkfAbx7g":{"text":"Stopped by Tropical Isle so that these girls could grab a drink. It was their first time i","useful":5,"cool":6},"yhNheWS0NPltDRSXJBEChA":{"text":"The place is great. Staff is amazing. Isabelle and Andrew are amazing !! The only problem ","useful":0,"cool":0},"BGh3yAAIE8tjFael8w5Niw":{"text":"I ordered a hand grenade in a cup and I must say that it was great way to end my trip in N","useful":1,"cool":1},"zqv8mRX1Ar4Ebf_vrvygog":{"text":"My wife and I were here during our vacation in New Orleans and had an absolutely wonderful","useful":0,"cool":0},"sE3e49FwqjD43nvQrYy8zg":{"text":"Uhhh.. I don't really understand the hype. They come in pretty containers you know the ico","useful":0,"cool":0},"TlW5sPGvOZr6A7oA437Suw":{"text":"If you wanna get turnt up!! There drinks are strong and the hand grenade u can get frozen ","useful":1,"cool":0},"WpAMweKrKMXZfYAG9jgJPw":{"text":"Hand grenade!!\n\nNot sure what was in this drink but it was delish and it's alcohol....so y","useful":6,"cool":7},"UwJyy9ANYVFQxAAaLvg3oA":{"text":"As many times as I've been to the spot, I cannot believe I've never written a review! This","useful":1,"cool":1},"6zSks6ps6r52b69FYjuvTw":{"text":"The hand grenade was amaze & im pretty sure this was the strongest drink we had during our","useful":1,"cool":1},"mTifmQi0tCidBGLHYTXXFg":{"text":"Hand grenades - kinda strong drinks with a schtick. They are sweet and fruity and not bad ","useful":1,"cool":2},"8gDwptNO1aaDjOfHXEobQA":{"text":"It's really a tourist trap. I knew that going in. I just wanted to try it. I usually don't","useful":1,"cool":0},"hicLTyx5aPOlX1oyN_t3mQ":{"text":"The place is filthy and the owner has an attitude. I would try one of the places across th","useful":0,"cool":0},"-9WgTnB0mHUQwmr9UtSzIw":{"text":"Tried the famous hand grenade. Walked in and has a designated spot to order which was awes","useful":1,"cool":1},"J15cRQJQDYlIeo1I1ifusg":{"text":"You'll notice everyone holding the hand grenade drink on Bourbon street. It's a hit or mis","useful":0,"cool":0},"aboputfYoWeBsjRwjQJKTg":{"text":"I assume I purchased a Hand-grenade since my receipt says $10, I was so drunk I can't reme","useful":0,"cool":0},"2kifu4v5ciaagmOYaR9tRw":{"text":"A must stop! I feel like this is one of those touristy things you HAVE to do while on Bour","useful":1,"cool":1},"JGU0hBWamq5c-ynQmy2FcQ":{"text":"Watch out for the grenades!! These things are deadly! No joke, you better be ready for the","useful":3,"cool":3},"yov9DpDHupWbKl8Ril_jgA":{"text":"The Tropical Isle is nestled in the French Quarter on Bourbon street. There are about 5 lo","useful":12,"cool":8},"ajqPWFe8CHxXH1KZ-wlnew":{"text":"Stopped at Tropical Isle on Bourbon Street while in NOLA to try the infamous Hand Grenade ","useful":0,"cool":1},"wEhydpdekdrCjj9Hhknv9Q":{"text":"This is a spot that you must stop at if you're in the Quarter. For around $10, its a great","useful":0,"cool":0},"dRLOqyQ7XLq6PqvFOA3qGw":{"text":"Now you can't go to Bourbon Street and NOT get a Hand Grenade aka \"New Orleans Most Powerf","useful":5,"cool":7},"FQflqb_IHAxjqAq19mDXVg":{"text":"Highlights from a recent trip to New Orleans: \n- Brunch: Willa Jean or Ruby Slipper\n- Get ","useful":0,"cool":2},"wsmqwDLzcxQhNBPU2tCVkg":{"text":"BEST BAR ON BOURBON STREET!!! \nYou see everyone with the Green drinks... and this is where","useful":2,"cool":1}}