{"yOkveyhOHBbh7-2pp6K2Pw":{"text":"Good Spanish Tapas in the Bywater. We went an enjoyed a wide variety of Tapas and everythi","useful":0,"cool":0},"dQKSID7qWnphIbcVs3TEFQ":{"text":"Really incredible and unique dishes and flavors for New Orleans. I've travelled and eaten ","useful":0,"cool":0},"bjGk7BiOVW5mKoC9ugVFgQ":{"text":"My husband and I ate here a few days ago and liked it a lot. We tried the tortila, croquet","useful":0,"cool":0},"iEwvY1H8F0gonTzM5w76Bw":{"text":"Excellent service. Quaint seating. Party of 8 and we were able to enjoy an fun intimate lu","useful":0,"cool":0},"fHOfytsDhZZrPweYhxA24A":{"text":"Some of the most inventive food that I have had in a while. It's not about the length of t","useful":0,"cool":0},"5Cl41BzlGs41RAv-gvHt9w":{"text":"Small. Off the beaten path. Totally worth it!  Best tapas and pintxos this side of Barcelo","useful":0,"cool":0},"Yt3smr-cu-XMXJY7dwRx9A":{"text":"Good food. Good wine.  Intimate.  Might just be my new favorite place!","useful":0,"cool":0},"5wXCpBgMyyWlE1hZoHMqyQ":{"text":"Needed a light meal pre wedding celebrations and picked up a little bit of everything to t","useful":0,"cool":1},"IrilJzeAiAjE6_t0gNEffQ":{"text":"This super cute place is a hidden gem! We grabbed a bottle of wine and the charcuterie boa","useful":0,"cool":0},"wpHyPcAW0rLaUCozNRmFeA":{"text":"Estano features simple fresh ingredients that are put together in a delightful way and wit","useful":0,"cool":0},"8CjDckPLL8P7tzgLLBSTNQ":{"text":"We love tapas and small plate places and Estano is a gem. Friendly staff and a casual atmo","useful":1,"cool":1},"AsikDuZHUHFe9w58-2qNnw":{"text":"Great spot, check it out. We went for early lunch/brunch snack and it was a very pleasant ","useful":0,"cool":0},"roEh6ZVnNqtVa93TSNOgBA":{"text":"Expertly crafted coffee & pintxos. Accomodating & knowledgable staff.  Order to suit your ","useful":0,"cool":0},"6YlIIly0BiyViFWjR1fHAQ":{"text":"So this is a place holder review because, upon entering this newest addition to St. Claude","useful":5,"cool":1},"w-GtyuoG0iBLeIX8N6AeGg":{"text":"A friend and I had nice wine although it´s a little on the high side ($9 or 10 for a glass","useful":0,"cool":0}}