{"IV4LE5Z0NnU0dRyeBL0DTQ":{"text":"Great atmosphere and good food, just not the most generous portions. \n\nEveryone working th","useful":0,"cool":0},"PReVfz8qNKxM3D-o4TmPiA":{"text":"My husband placed a take out order here since it was right near our hotel. They were extre","useful":0,"cool":0},"4e13qACJRFud1S6ybz1Y4Q":{"text":"had high expectations for bbq in the deep south.  can't say it was bad but just not to my ","useful":1,"cool":1},"Ys9SML_pwt7P0D1Xt37OjA":{"text":"I like going here.  Not only is it not too far from my office, the food is pretty good.  I","useful":0,"cool":1},"fiO0D7Go1tldSR4yygmHkw":{"text":"The food is decent, service I actually liked, but it was nothing special. We had a brisket","useful":0,"cool":0},"7N3kxneB2H7X5G3_NOEqeg":{"text":"Great BBQ place. My wife and I loved the flavors. The mix of meats etc were amazing. I wou","useful":2,"cool":0},"N2P2C9JpJOQDsqKpRMiwAQ":{"text":"Been here before several times and loved it. This time the lady that brought our food to t","useful":0,"cool":0},"BlwFM-P3UjaM0yLHigJ6bw":{"text":"We were in NOLA for a cheer competition and a friend recommended VooDoo BBQ as a must try!","useful":1,"cool":0},"0diEjYRdUGBKzyknWd5l2Q":{"text":"Perfectly tender ribs and pulled pork with just the right amount of smoke on the meat.  We","useful":0,"cool":0},"Ll26vTMNUoy0_yxpCUYR9Q":{"text":"The food is very good.   But they didn't have any meat with bone in it. They had several d","useful":5,"cool":4},"LMwTVUR1-Npf2MVEVKhuLg":{"text":"loved the food, the BBQ sauce was awesome, the sweet potato soufflé was delicious and all ","useful":0,"cool":0},"kUlVMb7FQla-kOjBkmFlag":{"text":"Saw a banner ad that said \"VOODOO BBQ My Lunch Time Ritual\"  thought that was clever I wil","useful":0,"cool":0},"icY30jl9IerPLJ6AuY5APA":{"text":"I chose the Carolina Pork sandwich. The meat was cooked perfectly, but every time I eat he","useful":0,"cool":0},"NOU8TRXhw6S5U-U53V3F2Q":{"text":"The food was good for a quick meal.  Nice flavors, nothing fancy.","useful":0,"cool":0},"K4oCmWTEPkp1E96rJiqWMg":{"text":"This has to be the best Cajun food I've ever had. The location is easy to access and I lov","useful":1,"cool":0},"IWDD7IsfCu-xEWnk8f2E3Q":{"text":"All I can tell you is that pulled pork is off the chain. It was not dry or tasted like day","useful":1,"cool":0},"IkSfk2FjZmMaR9GH6kTRug":{"text":"Leave the French Quarter. Get away from beloved Frenchmen. Hop on the St. Charles streetca","useful":1,"cool":1},"nHmTgPeE6uORC1w5tb9rLg":{"text":"This place is great. My fiance and I have eaten at the Voodoo in the Walmart in Harrahan a","useful":1,"cool":1},"EEZ3g1AxrWMkU2exy5XC0Q":{"text":"The BBQ here is damn good. I enjoy eating here every time I visit New Orleans. You can't g","useful":0,"cool":0},"92A49G1LEuf3lbAi044xXQ":{"text":"I do believe I live with the world's best BBQer this side of the Mississippi so it's hard ","useful":0,"cool":0},"qw0b-zTvOxErH8zpsyuvzA":{"text":"Our first taste of New Orleans was this neighborhood gem. Casual with a local vibe. Comfor","useful":0,"cool":0},"SJ4-5BITKDGq4GIDlHKj4A":{"text":"We tried this place for some authentic BBQ, and chose it based on reviews.  It did not dis","useful":0,"cool":0},"S1cfsu7LlVqzavoBGYIJVw":{"text":"We were looking for something local and cheap!!  We were not disappointed!  We both ordere","useful":0,"cool":0},"5t3gge1yAFaJEai2uO-1ug":{"text":"The mac and cheese and corn dressing were good.  The meats where delivered luke warm.  The","useful":0,"cool":0},"4nf6WFnbhW5h7y14taeerg":{"text":"Restaurant food at subway prices . Cheap alcohol drinks too . Louisiana grill. Pleasant st","useful":0,"cool":0},"7LFZp-OcM3YXtQOC60BFbQ":{"text":"Came here yesterday with co workers for the $2.00 Tuesday pork sandwiches.  My complaint a","useful":3,"cool":0},"bZhG8Z8cJ8TrITi8CI_q8Q":{"text":"Visited on 7/9/15.\n\nBeing from Texas, we had to try BBQ on our first visit to NOLA since i","useful":0,"cool":0},"q76Yub4SsFbKGRUtV3tWng":{"text":"Delicious ribs and the corn bread is fantastic! It was moist and not crumbly. The bread pu","useful":0,"cool":0},"KeKTKF3NqXvnzEb89NV_oA":{"text":"Disclaimer:  I haven't actually had the BBQ.\n\nEvery couple of weeks when I get a hankering","useful":0,"cool":0},"uNQznletwk95UOus7wa1zQ":{"text":"The BBQ was good not great. The sauces were spicy good and the beer was cold. The atmosphe","useful":0,"cool":0},"uLqg8a1rrwH3SZAc4dEETg":{"text":"Wow saw these place in diners drive-inns and dives. I am so glad I stopped in to eat becau","useful":0,"cool":0},"0omMbwioKF-OC6a0WpDpGw":{"text":"The food is just aiight I guess...way too much playing around at the register if u ask me.","useful":0,"cool":2},"ORPH3zdTD3LWHopOUnL_9g":{"text":"It is a long and stupid story about how I got dragged here, but I'll sum it up: I am a nic","useful":3,"cool":1},"lsUz43_0qMJBaWJqP4SrXA":{"text":"This place is AMAZING!! A must do when in the Big Easy. Pulled Pork is insanely good and t","useful":0,"cool":0},"lNo_EK3nRP8pbP3BdCduCg":{"text":"It was ok. Had the fried shrimp (too salty) but the corn pudding was delicious. Service wa","useful":0,"cool":0},"vIiKN2Kfgv6UKL2pl510Nw":{"text":"I haven't been back to the Big Easy for a couple years, but I can't wait. And whenever I g","useful":0,"cool":0},"kEm2KMd7mxsJsJfO5TZA6Q":{"text":"Fun spot.  Stopped by for lunch while on vacation with friends. The food was good, and the","useful":0,"cool":0},"_bDXU2RW6YI7oCYI80vaDw":{"text":"Eh. the amount of BBQ you get is definitely relative to the price you pay. My husband got ","useful":0,"cool":0},"O8dTtJh6UOxshQ3vupLFSA":{"text":"not memorable..except for a major issue they have with bread portions....like it is gold o","useful":0,"cool":0},"msl4xU72xoe4MDggpFJ3aQ":{"text":"The ribs were sub par.  The chicken was good.  The staff were not super friendly or helpfu","useful":0,"cool":0},"CW0Fyr_3B-iKBtrZcEYxJQ":{"text":"Best potato salad I've ever had, hands down. \nGood BBQ sauce too. \n\nService was casual but","useful":2,"cool":1},"KXBonB9j7ky2rhWRJfditg":{"text":"Visit: May 3\nThis was our 2nd choice to dine after 9pm, as we were disappointed with the I","useful":1,"cool":0},"AsTbdQCy3odAlRruLg8YKg":{"text":"Ooh yeah! Flappers is tasty. I like everything here except service!","useful":1,"cool":1},"MjIdiGmhlQzLvnwiMax59Q":{"text":"Voodoo is great! During my stay in NOLA I would frequent this place for the good BBQ and t","useful":0,"cool":0},"TEfOAWa08ZcOsyWb-tODIw":{"text":"Ok Boy isn't much of one.  Great sausage but it's that and a bun.  Expected a bit more tha","useful":0,"cool":1},"sCNxINhDxOKlWYwAD1SeHA":{"text":"Went there on sunday and had the voodoo burger and it was like any other burger out there ","useful":0,"cool":0},"FYdKfjFQxFGedZhcdOnPPQ":{"text":"Is this the BEST BBQ NOLA has to offer?  REALLY!  \n\nI had to guard my plate for persistent","useful":2,"cool":0},"kT6LhXChttNwkFQRDcKyuw":{"text":"Enjoyed our food. We got the pulled pork and sliced brisket.  Both had great flavor and we","useful":0,"cool":0},"dhGb0R1DH_OEt9ZzNYlDgw":{"text":"My burger took a long time to prepare. It's understandable considering I wanted it well-do","useful":1,"cool":0},"hqq5ch3L4Nn1gZfpUdxvYA":{"text":"As a regular, its expected to have the same experience each time. But i am not that foolha","useful":0,"cool":0},"lz5PD-sfhlA2TvX8y-FWEg":{"text":"The pulled pork is delicious!!! It's soft, moist and seasoned perfectly. Their BBQ sauces ","useful":0,"cool":0},"BypWcm3-qoLlt3g9uewsQQ":{"text":"Great BBQ place. Cheap food. Cheap beers on tap. Sold me a $1 shooter. It tasted awful, bu","useful":0,"cool":0},"EAyBSYdjxuC289_VXpvw8g":{"text":"I don't eat here too often, but when I was a Tulane student, VooDoo BBQ catered events the","useful":0,"cool":0},"9tUcC381_xWYKpUhAqylmA":{"text":"Had the jerk chicken with bbq jambalaya and gumbo. The jerk sauce has a kick to it, jambal","useful":0,"cool":0},"kYcebBKXF_dpMBrezzgB3Q":{"text":"Had the gravedigger with brisket and 1/2 chicken, loved the corn pudding and the voodoo gr","useful":0,"cool":0},"f3-_j1RrVrhVSXBKT5LNog":{"text":"Food is good here but the women that work here are purposely rude. There was one lady who ","useful":2,"cool":1},"y1cW8AiYLxNkzc2hAY4oLA":{"text":"Meh. Food was just okay. BBQ sauce was great but our meats were dry. Atmosphere felt cheap","useful":1,"cool":1},"RUh8q2NrKX1wjVeVN9Y1mg":{"text":"Great BBQ.  I'm from Texas -  I know BBQ.  Though this isn't the Texas variety I'm accusto","useful":0,"cool":0},"tjLzbHR765S-tmGWAXppPQ":{"text":"Came here on Easter... because of the holiday, they were out of a lot but servers were war","useful":1,"cool":0},"MaZ6oB6E8mO1nzaGPvoFcw":{"text":"We loved this place while visiting. Nice comfortable feel. Good food. Great artwork and ch","useful":0,"cool":0},"TSRsP3_0BIGjohpzrw7Utw":{"text":"Outstanding BBQ and southern food. Must try the sausage and Gris a Gris Greens. Very frien","useful":1,"cool":1},"xCHs9jiodkTKyMrUVbGefA":{"text":"Awesome BBQ! I got the pulled pork, beans and greens! It was amazing and the mango habaner","useful":0,"cool":0},"8m3ybWWVKoFLkt6PzoWayQ":{"text":"This place is kind of lame. It lacks the typical BBQ experience. It also is kind of like B","useful":0,"cool":0},"r9EyF3ir-V2E6E3dvkuw9A":{"text":"The staff is nice. The sweet tea is very good. However, I didn't like the food at all. The","useful":1,"cool":1},"ZkAHMPmxFm-nMHBgibPeDw":{"text":"Unbelievable....the sides are incredible and the carnival has everything you need. Great s","useful":0,"cool":0},"tPH1YQ0oS50E_ZXyCXgOXQ":{"text":"Great BBQ !! Wonderful meats, all perfectly prepared.  The three sauces were fully explain","useful":0,"cool":0},"yBOpOtnQt92ryCZgmkcIvQ":{"text":"If ya down for some good tastin' and reasonable Louisiana home-cookin' dis is da place y'a","useful":0,"cool":0},"8OYBsHWbY8E9MQyi_QwnWQ":{"text":"Now a cab driver recommended this place while we where on our way to another BBQ-place. So","useful":0,"cool":0},"wdBVQOEX8vHfwo6aRJ-ZZA":{"text":"Looking to cater an event? Look no further. \"Lane\" is the man to trust for all your bbq ne","useful":0,"cool":0},"1K8d-UrAbL3dMTWa4b22SA":{"text":"Visiting NO figured we'd try it. Ordered the graveyard with greens & sweet potato souffle ","useful":0,"cool":0},"eEFXTe461VIMfra3I1z1Gw":{"text":"I had the pull pork, and chicken as far as the food, I think the chicken was quite dry eve","useful":1,"cool":0},"3EqccoRrqCjGXxaxpYXlNw":{"text":"Food is super good. A little salty for my taste but worth every penny. The staff was frien","useful":0,"cool":0},"4HX8zZVrebKZ8ZyeX-67EA":{"text":"Wanted some great BBQ and wasn't disappointed. I walked in and was immediately greeted by ","useful":0,"cool":0},"H9S8q6X3kuYinvknfAl2qQ":{"text":"When we arrived, they didn't have any ribs, potato salad, french fries, jambalaya, or gumb","useful":0,"cool":0},"8GohA4Sm1qXuvRZLaqmf_Q":{"text":"I was very disappointed with my rib and chicken plate which was the special on Wednesday.\n","useful":0,"cool":0},"66lRR3MOXysHBXsc4JAEsw":{"text":"blech. my jerk chicken was way over-processed. no chicken breast in sight. my dining partn","useful":0,"cool":0},"5fh1wRG1aGElAM8Aofni3w":{"text":"Had the Brisket Po Boy, corn pudding and a draft. Brisket was tender but dry and lacked fl","useful":0,"cool":0},"D3ZYreIc-K1rr5jAfq5lRw":{"text":"Abita Amber (on tap), pulled pork, mac n cheese, greens and texas toast.  The lunch of cha","useful":0,"cool":0},"56cYX2_NlYggU0ppfBtajw":{"text":"quick fast food BBQ joint -- ordered the half rack ribs which were so tender, flavorful, f","useful":0,"cool":1},"7557K5DbWEgAGWHZgrjOIQ":{"text":"Not the best BBQ ever but decent. The meat is only so-so. The sauces are decent. My husban","useful":0,"cool":0},"8ENdoEG3vnx7iYs8ZxoSrg":{"text":"Tried to order for 5 people and the counter person called someone to come up to the front ","useful":1,"cool":0},"1lN2D4ZzgCUr8wo_y0iBwQ":{"text":"Very friendly staff. Full liquor bar. $2 Tuesday and $2 Thursday sandwich special.  They h","useful":0,"cool":0},"W04tARuRzMwKXkddjoWuvA":{"text":"The pulled pork and ribs are amazing! I got corn pudding as a side and it did not disappoi","useful":0,"cool":0},"Nk0D7oQVo2xKGVQKBFPLiw":{"text":"Very friendly service.  Great corn pudding.  Pulled pork was amazing.  Their carnival meat","useful":0,"cool":0},"T71jqGBnGaMdzPliEn-XSg":{"text":"The pulled pork was worth stopping in for. The Louisiana sausage was nothing to write home","useful":0,"cool":0},"_oyQ7RWuhJ-ncUFvl47u1w":{"text":"It's quick, it's casual, and it's a pretty good chain restaurant.  The pulled pork was sur","useful":1,"cool":1},"84H658mQp6X70E7j9S-GDQ":{"text":"Tried their pulled pork BBQ last night. I liked my sandwich and the $2 Tuesday price. I sa","useful":0,"cool":0},"65Dsk3to-McO-daK5PvczQ":{"text":"I went mostly because it was close to my hotel after flying in. Service was great and fast","useful":0,"cool":0},"4CYz5yvK6l7QqX0pFz4vzg":{"text":"Food is pretty amazing. Definitely Feel the southern hospitality. Ribs were awesome and yo","useful":0,"cool":0},"EGLUtqmOLCHWIdUOZpIomw":{"text":"I go the fried shrimp po boy with a side of gumbo and sweet tea.  The food was good, but n","useful":0,"cool":0},"Qc-7dF7gGju7dQjqqjJX2g":{"text":"Voodoo BBQ is everything a BBQ place should be ... Casual, clean, awesome friendly service","useful":0,"cool":0},"2Z7YRghikJJch4Ih1BICbQ":{"text":"Carly at Voodoo BBQ & Grill is the absolute B E S T. \n\nReally though, this place has reall","useful":0,"cool":0},"kjos755mpVQkWhRMiQo_Nw":{"text":"Sorry, but I wasn't impressed with the BBQ here. The meat wasn't particularly tender the s","useful":0,"cool":0},"j6LjH-b_xf0eA1zcFyEGlQ":{"text":"Single handedly THE best BBQ I've had. I could live here! I got the pulled pork and briske","useful":0,"cool":0},"1HJVK3wMccTCzBswdHPk8w":{"text":"Found this place because of their flashy sign. The signs better than the BBQ. The pulled p","useful":0,"cool":0},"n5xj1dxpvd4Q2FQkjtFkwg":{"text":"Food was good and the location to our hotel was just outside our door almost. I would eat ","useful":0,"cool":0},"W6M03xKypqneR_vCBGok1A":{"text":"After 45 mins of waiting in line, we finally were being asked what to order. The cashier w","useful":0,"cool":0},"Knc1Fyvkd-V355Z5ltCIQg":{"text":"I've been in New Orleans for three years now and its time to look back on my first experie","useful":0,"cool":1},"EX3ftMgO655dATa0uRf7iA":{"text":"We actually came here twice during our vacation. The second time we brought our friends an","useful":0,"cool":0},"intmAsvB0TZ7Vmm8RGiv6w":{"text":"I had the pulled pork sammy on wheat and my man had ribs.  We've had a lot of good bbq, bu","useful":0,"cool":0},"WLvUB1h34jatMeOMdRzj0g":{"text":"Déjà juste le check in sur Yelp vaut grave le coup, on a une part immense de bread pudding","useful":0,"cool":1},"0I9G2pNAHNCW2eDE_M0OZQ":{"text":"Originally from Memphis, I am a snob with it comes to BBQ. However, this place was AMAZING","useful":0,"cool":0},"y-RPQqikR6REevRSVP-K7g":{"text":"Kind of disappointed. Hubby and I were beat and wanted to eat in so we got delivery. \n\nWe ","useful":0,"cool":0},"RSx0uHvyHi8dGCNYKL2SCQ":{"text":"great creole gumbo...spicey! Cornbread was sweet and tasty too. Ended up getting a soda to","useful":0,"cool":0},"tZq8evV28-27kAf_YKDsfA":{"text":"This is truly one of the worst BBQ's I've had. Yes, I tried it twice.\n\nI don't know how th","useful":0,"cool":0},"t-sHtg6C4Do6phA2SBlaWg":{"text":"Ordered the plate with 3 meats and 2 sides,the plate only came out with 2 meats on it,ther","useful":0,"cool":0},"r7Rz-IoP_mBxiL7b5A18tA":{"text":"Ribs are perfect. Corn soufflé and sweet potato casserole are worth the trip by themselves","useful":0,"cool":0},"U04AZ47uJWvD2wGm2K3s9w":{"text":"The pulled pork sandwich and corn pudding is seriously some of the best I have ever had. I","useful":0,"cool":0},"etW5nRDKIQIGe-Vtz6L26Q":{"text":"Friends and I wanted to try out BBQ ... this place was recommended by a local, so off we w","useful":0,"cool":0},"b8birKwY7e0x_acjmdaVbQ":{"text":"The brisket was really good and my fiancee said the BBq jambalaya was good. I loved the co","useful":0,"cool":0},"MNagPCMP7APy8iEsqsgGgw":{"text":"Not at all what I expected.  Friendly service. The BBQ was dry and the sauce not that grea","useful":0,"cool":0},"KKlpMWUjblqCatiOz9KWqQ":{"text":"Good BBQ. I love the New Orleans BBQ sauce. The meat was good, but it seems like  the meat","useful":0,"cool":0},"Zer7PQWBRyGr7y34rteVGw":{"text":"Somewhere in between Dickey's BBQ, and Bill Miller BBQ.  They did let me get a kid's plate","useful":3,"cool":2},"huCmd1tvq5_KOYDuaniuGg":{"text":"This place used to be so good. I've eaten there several times since moving to NOLA a few m","useful":2,"cool":0},"DO3H_Ru9xRL8L9lvwO8x3A":{"text":"Really good food. Fantastic customer service. Great restaurant layout and feel. Love the b","useful":1,"cool":0},"M9w8QoqiCAJSw56KG3tgLA":{"text":"I had the pulled pork platter with fries and corn pudding. I thought the pork was very goo","useful":0,"cool":0},"dl8_StG9u1-SNl27Kg7WZg":{"text":"We had the ribs, pulled pork and brisket.  It was pretty good.  The sauces were mediocre b","useful":0,"cool":0},"2FaVIyqaXO2516HKXnoSEg":{"text":"As a BBQ afficiannado who's experienced Carolina, Texas and Memphis BBQ  if this is suppos","useful":0,"cool":0},"nrMxaSIAxR8XUyGn5TYUPQ":{"text":"Great place to eat!! Friendly staff & fantastic BBQ! Best potato salad I've ever had. & de","useful":0,"cool":0},"clTMeT7LYGSB-6pnEJ60pA":{"text":"Amazing BBQ! Fastest service I've ever had!! \nThe corn bread is spot on! And the bread pud","useful":2,"cool":0},"1aV9MrAk9mw_Y19AJ6nvyg":{"text":"Excellent meats and sides. The only downside of the dining experience is the plasticware.","useful":0,"cool":0},"u3ZBEq08Vw5dmLh4YgmA3A":{"text":"This place is alright, the prices are pretty high for what you get though. My boyfriend go","useful":1,"cool":0},"pOaenDF1dTYr7fq6qpFA0g":{"text":"Yes!!!  Simple and delicious. Friendly! Great sauces. Pulled chicken!!! They put a spell o","useful":0,"cool":0},"xd-kEfJiwSCHiwV3yWHgjQ":{"text":"This place is a must whenever I'm in New Orleans. All the meats are de-lish and the corn p","useful":0,"cool":0},"XmHnR9QLWvpa3NnhEXWK8Q":{"text":"Good food! I visited on 6/1/12 with my mother & daughter while on vacation in NOLA. Btwn t","useful":0,"cool":0},"I2VrCiaAnYW6xgd0SOq4MQ":{"text":"I really like Voodoo BBQ. It was actually the first food I ate at in NOLA of so many years","useful":4,"cool":0},"jKYLHndKgf5TuReZdwhbSA":{"text":"Ma mère et moi cherchions à nous restaurer sans trop de chichis autour de notre hôtel et o","useful":1,"cool":0},"F8owtooxXH20cUMgOzGZAQ":{"text":"Good food....wonderful service.   Red beans and rice with sausage is enough for two.  Very","useful":0,"cool":0},"Cn7fpvQeosHYZqxE6Yxu0g":{"text":"Awesome food.  I'm from Chicago. I KNOW barbecue.  This stuff was awesome.  The corn puddi","useful":0,"cool":0},"yGGnKNeHjOajw5nxzNl9QA":{"text":"The food delicious, but slightly over priced. There is no restaurant like voodoo though so","useful":1,"cool":0},"q1j1_k38F0cm13R4538tMQ":{"text":"Yelp reviews & walking distance from my hotel landed me here.(free bread pudding for check","useful":6,"cool":5},"0c9nHJxrHA8S3jYOy7ZGjw":{"text":"Didn't like the bbq, little dry for me personally.   I had the pull pork P.O. boy, and a m","useful":0,"cool":0},"i7z5bh4LBUqiHzfwHLm6_Q":{"text":"Yumm!!!\n\nSo good that we ate here twice during our short 4 day visit.  It is located on St","useful":1,"cool":0},"Jsz3OM-2Yn4iQDEUCsudQQ":{"text":"The cashier guilt-trips people into leaving tips. They bring your food to your table but i","useful":0,"cool":0},"6cmo3eBkB6ivf1dacRh9YA":{"text":"Good BBQ spot on St. Charles in the Garden district. The cashiers were very friendly. I dr","useful":0,"cool":0},"XbzzwP2lL0TuIkFkXJqUZw":{"text":"Good stuff.  Went there for lunch during Wrestlemania 30.  I'm craving the pulled pork.","useful":0,"cool":0},"sAnb5_8fPAJyxbY71kAIMw":{"text":"This is not BBQ, if you know your wood chips this is a crappy chain. place is miles away f","useful":0,"cool":0},"6TFCOhzk7LCCXS0rqYHyGQ":{"text":"Good, reasonably priced and friendly staff. In a city world famous for food, this place ho","useful":0,"cool":0},"J6BhprwCPx6Es6Io1lSI2g":{"text":"Avoid! Dried out meat, flies everywhere, condiments sticky and dirty. Only good thing, Ser","useful":1,"cool":0},"y8i6Lj8ILiYGYdnX_gjBeA":{"text":"wanted to experience new orleans bbq and it was so-so; i've had better. but staff was frie","useful":0,"cool":0},"C2C5ooHBPMBDEFvE3-o6vA":{"text":"Whenever I meet people on the streetcar who are looking for a quick, easy, inexpensive tas","useful":3,"cool":1},"3ytctg3hUCEU76UnI8sjrQ":{"text":"Best BBQ I've ever had in my life. And as a long time connoisseur of the exquisitely delic","useful":0,"cool":0},"UZyCy3GlCdJRwg2KzX4EvQ":{"text":"What a fantastic little place! We drove 20 hours straight to get here and were starving. T","useful":0,"cool":0},"fEC2QVVDYBYrtE79Yv7Flg":{"text":"Good food, enjoyable atmosphere. The corn pudding was on point and so was the Mac and chee","useful":0,"cool":0},"CMhfMYVCosqAHfXODEBnIw":{"text":"This is solid barbecue. It's not prize-winning stuff, but the sauces are good and the meat","useful":0,"cool":0},"MlJEgkWs__l5UnEDPZjmtA":{"text":"Yummy local vibe place. We had the voodoo platter with ribs and chicken. It was cooked to ","useful":0,"cool":0},"iydGrBToo5v9lXEaURRc2Q":{"text":"This place is delicious!  Smoked brisket,  smoked ribs, eaten with a plastic fork!  Yeah, ","useful":0,"cool":0},"tk6xWdnMXTemIz21kRi7Mw":{"text":"Voodoo BBQ ..I am missin' your melt in your mouth brisket and corn pudding! \n\nWe loved voo","useful":0,"cool":0},"chDqBBC_xKwhAOTJGEh6Iw":{"text":"This is place is great!!! Better than I thought.  Sweet potato soufflé and corn pudding is","useful":2,"cool":1},"Ed5DYUR6lPHL5XfoLooKCA":{"text":"While I didn't come to New Orleans to eat BBQ, this place came highly recommended by a fri","useful":0,"cool":0},"ypTKxufl4aKsmaSC03QDXw":{"text":"Great place for a casual quick bite. We rolled in tonight after almost ten hours on the ro","useful":0,"cool":0},"154N4z8KEGRlc0RbPEckKA":{"text":"I had the po boy, corn pudding and a beignet. All of it was amazing!  They have three kind","useful":0,"cool":0},"T35j0_Jp62nxoIPv-r1rmw":{"text":"Very inconsistent food quality, sometimes good, sometimes yuck.    What is consistent, tho","useful":0,"cool":0},"gV1Rr8Sk0E5MAyNQlO_P-Q":{"text":"Yum yum yum\nThe shrimp poboy was very flavorful\nSweet potato souffle was perfect could hav","useful":0,"cool":0},"FBQDAEAkNzjb1jM1FBCLRw":{"text":"They have three different sauces, none of them are very good.  This place is OK, but if yo","useful":3,"cool":0},"syyO2GzpqOyfYJM9T7PsnA":{"text":"So while in NOLA my BFF and I wanted to try some good ole BBQ ribs and cajun chicken. Base","useful":0,"cool":0},"eDdZ9hqIeOsRVzSTjfKNfA":{"text":"Its ok, but no KC BBQ\nbut way better then anything in Ohio","useful":0,"cool":0},"Wn32peNIGhBJx4uwYsEeiA":{"text":"It is a bar, but it has a chain store feel. You walk up and order your food at a counter. ","useful":0,"cool":0},"EmXQFhlbHROdH8-7aR7_XA":{"text":"Large rat droppings in the corner of the dining area and a dead roach on the ladies' room ","useful":0,"cool":0},"YBbErG_whP_Vr50wOaGPnw":{"text":"Great food, great grits, great brisket, self serve drink so I can have as many diet cokes ","useful":0,"cool":0},"cAnwOIFC928bgiouCWOnPQ":{"text":"O good little BBQ restaurant right on St. Charles Ave. I saw this place while down in New ","useful":0,"cool":0},"VZDoUEl5QrEqKCMyBasZ1A":{"text":"Ribs and Brisket were tender and flavorful. We selected their mac n' cheese and sweet pota","useful":0,"cool":0},"QC45mUV3XFiX_YfvYdvG7w":{"text":"Meh... It's ok, I guess. The meat is just ok. The sauces are ok. The sides are ok. So I gu","useful":3,"cool":2},"cwL_ZIBbkfxCWx2rI8XgrQ":{"text":"Wow, VooDoo. I had been looking forward to eating here for the past two weeks. It has been","useful":1,"cool":0},"GWfs_p77HaoFxuiszf7TSw":{"text":"Very friendly staff! So attentive. The mojo sauce is pretty good. They gave me little samp","useful":0,"cool":0},"G_mLmoYh5neAfSiOxwLDLQ":{"text":"Ok the place was good, actually very good but I left remembering the sides and the sauce m","useful":0,"cool":0},"gfzMhE4PqdYfinZSxQEoEg":{"text":"We have been coming to voodoo for years and always love the que. the sides are amazing and","useful":0,"cool":0},"Srnb0GIi6MXnl9Q9s4k-nw":{"text":"good food, meh service. The cashier charged me full price for their 2$ sandwich and I did ","useful":0,"cool":0},"KF5gnzGBh45yD0EVkV3rtg":{"text":"The brisket is fantastic and so is the corn pudding. We were only in NOLA for four days bu","useful":0,"cool":0},"9AsywxTInNhfZyl_hnpSNA":{"text":"Not the best  bbq at this location.   Ribs were good but corn pudding was dry and the pull","useful":0,"cool":0},"bzToTFU7fSv7C4NtMfhsrQ":{"text":"Loved this place, and have been coming here for years! I ordered the pulled pork platter l","useful":0,"cool":0},"AG-lQwVY5F6NI9Z14pR1-g":{"text":"I love every single thing at this place. I don't believe I have ever had anything not wort","useful":2,"cool":1},"MHAUpEBOgL27E4ftSyA_vQ":{"text":"Nous cherchions à manger cajuns sans nous éloigner de garden district où se trouvait notre","useful":0,"cool":0},"6wLTBnf_jkRSxm_zmdOcgw":{"text":"This is right down from our hotel so we dropped in for lunch. They were helpful with sugge","useful":0,"cool":0},"s5bJDTLj8X97VajLQFGtwQ":{"text":"We stop by when we were in New Orleans and ordered the rib platter and frozen daiquiris. T","useful":1,"cool":0},"OqzW0gKvcHW_S2epLRo4qg":{"text":"When I ordered the smoke chicken breast meal, I was expecting a whole chicken breast that ","useful":0,"cool":0},"UFVKV24B7VooXvPwbEXVCA":{"text":"Wow! I had the ribs. They were perfect. Asked for fries with sour cream, bacon and cheese.","useful":0,"cool":0},"nalR22hW5vAGInX4piGEiQ":{"text":"Well I came here on the recommendation of a family member and it was pretty decent barbecu","useful":3,"cool":0},"FTrGCzdhwaDGxlFNFkqZ_g":{"text":"Taxi ride from French Quarter. As were walked in some other tourists were walking out clai","useful":0,"cool":0},"nWhzV1d__aqhRIy2JLhuQw":{"text":"So let me start by saying we love coming here. The staff is always friendly and the food i","useful":2,"cool":0},"9w8NulsSvPEy44M_sUAnSQ":{"text":"Soooo good! Had the Carnival and oh my gosh, YUM. Coleslaw=good\nSweet potatoe=good! rattle","useful":0,"cool":0},"9BmoVWZPxj2unDH0DEx2PQ":{"text":"The food here is really good and the price is very affordable. Located on St Charles Avenu","useful":0,"cool":0},"3k2O-Dlf8noyWRoS_ncPFg":{"text":"Let me start off by saying once I find something I like, I usually stick to it. With that ","useful":0,"cool":0},"YzOzqBVFzkdODnx58id-1w":{"text":"New Orleans is a city known for its food. Among the food it is known for, BBQ is not. Neve","useful":0,"cool":0},"9-qOZiabChx8q4pnVFgRRw":{"text":"Food was really good and the sides were delicious! The sauces they provide are also super ","useful":0,"cool":0},"bw_kkDXCdFRlLcH0v5Z9AA":{"text":"The food was commercial.  It was not authentically Nola.  Nothing special.  I was not impr","useful":1,"cool":0},"RGOZjSPacG5iEXZMXci4HA":{"text":"Its the only game (for the most part) in the city. I think the BBQ is fairly good for a ch","useful":0,"cool":0},"VWBh5RctCjJE1E72Ouz53g":{"text":"Booooooo!  Terrible bbq. Not what you'd expect in New Orleans. Cheap, chintzy, sad food. B","useful":0,"cool":0},"6j2eInVhmRLKLQ61JSYDRQ":{"text":"Delicious BBQ!  For a chain they do not disappoint!  Got combo Brisket and it was all fabu","useful":0,"cool":0},"2x1qvp9rTFs8gX3imjnr9A":{"text":"Can I give it no stars?? DO NOT waste your time or money eating here. The food is flavorle","useful":0,"cool":0},"Vqq9iwv4DcQg29CsNcpECA":{"text":"I ordered brisket meat platers, and it only comes with a couple slices of meat. The taste ","useful":0,"cool":0},"DIKIHHxjPf3D-l4-dkirJw":{"text":"Came here to eat our first night in town. Good thing we came when we did, because not too ","useful":0,"cool":0},"6ZezhyV49JpYocyGGBv5SA":{"text":"Fantastic bbq! I had the jerk chicken, hubby had the brisket.  Good value for the price. Y","useful":0,"cool":0},"w1VVCVWdcJD4Cx8gM4qhFg":{"text":"I'm from Kansas City, so barbecue is one of my favorite foods. I was really happy to hear ","useful":1,"cool":1},"b1Fv6WrB413KjUbIWp4n3A":{"text":"Great hoot. After a bad experience across the street we tried VooDoo BBQ - great service a","useful":0,"cool":0},"T2VEq3_04HVx68Nco6xsgA":{"text":"Good and quick spot for a lunch on the go.  Right across from the street car stop, so good","useful":1,"cool":0},"1AYMQbvPKbHQvPW0dZK2XQ":{"text":"We went here right after we landed from the airport. It turns out that on Tuesday, they ha","useful":2,"cool":0},"YGb2S1BtprBUxshw568dNQ":{"text":"Loved it.  Super fast and friendly service.  Had the half rack of St Louis ribs, they were","useful":0,"cool":0},"a6jufcnCGA32fPOtp4-g-w":{"text":"Great foods,  portions are perfect and I love their bread pudding cake its so delicious. A","useful":0,"cool":0},"QcK8Lh8Q7RX_4MTCfrgbZQ":{"text":"This is the best BBQ ever!! This is our second time here in two days and we can't get enou","useful":0,"cool":0},"Q2EnzKqlen5A6OFAw0Omqg":{"text":"Excellent taste for the price. Everyone was very friendly, service was prompt, and meat po","useful":0,"cool":0},"h0lC7uYDKfgPp8Uf8lPk1Q":{"text":"Fabulous ribs and chicken. Was the Wednesday Night Special. Corn pudding to die for and lo","useful":0,"cool":0},"wJhebksmgMBZetNbE_q3Fw":{"text":"In town to visit with my daughter here at university. I took her and her friend out for a ","useful":1,"cool":0},"_aPYuZw-9IMbJpKAdTOrCA":{"text":"This place was very accommodating to our 10 school students from New York. Food is great.","useful":0,"cool":0},"o9qJU52U7bVNN-PMxjDAMQ":{"text":"Only minutes away from Canal Street on the Street car. Damn good BBQ. The people were very","useful":0,"cool":0},"8OqnYJNF9cAvPKQcxLCB_w":{"text":"This place was just OK for me. Really wanted to love this place because of all the great t","useful":1,"cool":1},"gBVd7eZfTAY3Ad8VYS9S2A":{"text":"Everything was really good! Brisket, pulled pork, jerk chicken (plain but juicy), sweet po","useful":0,"cool":0},"PwYAIXA8mtrF8x7XSXJ6ZQ":{"text":"Great food. Wonderful BBQ.  I recommend the sweet potato soufflé and green beers.  Wonderf","useful":0,"cool":0},"mX-su_NiletW8Hphi-KaKg":{"text":"3/5 convenient during parades\n\nsurprisingly accessible during parades; even on mardi gras ","useful":4,"cool":1},"e-HFN7xmkIdHAt4EGQ5i_g":{"text":"I am indifferent about Voodoo BBQ. I really don't like the fast food vibe of the place. So","useful":0,"cool":0},"TSa0L_rdhmfqjZVfPRdDjg":{"text":"Tonight Voodoo wasn't go great.  I have gotten lunch from the Voodoo Express in the Jeffer","useful":0,"cool":0},"MoxeZOwP75PQ27BB3VuT5A":{"text":"Honestly the best corn bread I've ever had.  Service is excellent and freindly.  The porti","useful":2,"cool":0},"aAlQgS0RdoTNgDnc2x-b5g":{"text":"This is a place I loved!  They were out of wings...Which is understandable because of this","useful":0,"cool":0},"g3aMwN42Fy69k2q4nYqCpA":{"text":"The service leaves much to be desired. The food was mediocre and did not measure up to the","useful":0,"cool":0},"OLoWlk3EjqTelicE-I-ivg":{"text":"Love love love this place. Walked here a mile, two days in a row. Food is amazing love the","useful":0,"cool":0},"R4wH6KZQm9kaxIuG9IRbLA":{"text":"Had the pulled pork sandwich. more bread than meat. Very dissapointed","useful":0,"cool":0},"ekuoDzE_FQBOnjm3VNiO8g":{"text":"Fast and friendly service!! Should definitely try Voodoo Streetcar potion, it's delicious!","useful":0,"cool":0},"zPfU4fAIhmFqx_QhunAtEA":{"text":"Ordered ribs. They were tender but had small shards of bone on the ends. You had to b care","useful":0,"cool":0},"nHfUX4Hfpsfm8vOS5XES4A":{"text":"After we finished our WWII museum tour we were looking for a lunch place to accommodate ou","useful":0,"cool":0},"hBNMXGYtfU3dAKMmZmZmdg":{"text":"Good solid 4Star BBQ. Authentic 12hour smoking on the brsket produces a tender and flavorf","useful":1,"cool":0},"GKkfy7EuSmrsdkyYocgrrg":{"text":"The day was too chilly\nand I had much hunger.\nGood, hot food was needed;\nI'm not getting y","useful":3,"cool":7},"VFp3asGnE1RahaQWY502fw":{"text":"Great food. Ribs came right out of the smoker. Worth the wait. Cajun chicken was delicious","useful":0,"cool":0},"8PybA2kj-88k4ahro2iRBQ":{"text":"Great restaurant!!! We actually found this restaurant on a whim. We were riding the trolly","useful":0,"cool":0},"I1iMGGhQVvZd9uyB4qf20w":{"text":"I had the sliced brisket platter with sweet potato souffle and corn pudding  - it comes wi","useful":1,"cool":0},"TuUmSLmUdI08twaQDvP9mw":{"text":"Smells damn good from the street!\n\nFirst of all, the meat is so good, don't ruin it by smo","useful":2,"cool":0},"Zwz7NyhQWBgDEGbG2LoAXQ":{"text":"It was...fine. Definitely barbecue fast food. With all the amazing options in NOLA, this w","useful":0,"cool":0},"1zUeQGJoBcqUgNG3B2cfGg":{"text":"This place was so good. The cornbread was superb!!! I really enjoyed the different varieti","useful":0,"cool":0},"gsX9scDrohkFOFkX77VRrg":{"text":"This place was super convenient to our hotel and served kid hot dogs, so naturally we went","useful":1,"cool":0},"apVL7WfQu3LBGwd3Bgue9w":{"text":"This restaurant may seem like a normal chain - not at all! The food was so delish!! I got ","useful":1,"cool":2},"fb3PKaxskncr4g35oP5EgA":{"text":"I went to Voodoo a few weeks ago when I was visiting New Orleans. I normally don't write r","useful":0,"cool":0},"GWV-rRE7ipuJUk6nPY_hFQ":{"text":"They were selling real food on the parade route, so that alone is worth some stars.  Unfor","useful":0,"cool":0},"_xy-M4BhEyGNIVc9u7mNmw":{"text":"So this is chain bbq in New Orleans.  Pretty damn good, I'd take this out west anytime.  V","useful":0,"cool":0},"ZTd7x33FAYnnBn_l7fILmw":{"text":"Its a chain and it does VERY mediocre BBQ and its a bit expensive for what you get.  The j","useful":3,"cool":1},"tTSrYatFWzzbKm9p_pcMfA":{"text":"One dollar sign plus four stars equals five stars. The best fast food barbecue in town","useful":0,"cool":0},"TB7q5OycFrH1bfbIx0jDVg":{"text":"LOVE this place! The food is delicious and the service is outstanding.  This is the friend","useful":0,"cool":0},"MGxWWNkTgxqN26B0h-3sAQ":{"text":"Voodoo BBQ is a family favorite for us.  Their BBQ is great and the sides are all done wel","useful":0,"cool":0},"xAd3kYQqwT2vcSKHS_JYjg":{"text":"Stopped in after a day of walking Magazine Street... The service was top notch! Staff was ","useful":0,"cool":0},"J9O0Unr-a6xU_hMXHzDwVw":{"text":"Great food and nice staff.  We had combo platters.  Mine was pulled pork and chicken  with","useful":0,"cool":0},"dmAqx-wa1yyKgpVCvdriuQ":{"text":"This is the place to get some tasty New Orleans' food without breaking the bank. Voodoo ha","useful":1,"cool":0},"ysxv3v7b95YvyVrDiCRCyw":{"text":"I live in Los Angeles and heard great things about Voodoo BBQ from my friends who were fro","useful":0,"cool":0},"EvsOi6qLxjIfw_20kwjMwg":{"text":"I was really disappointed about this place. They claim that they have the best BBQ ribs in","useful":0,"cool":0},"CXbXyvsrpF-nZx89XJUG7g":{"text":"Good food, good service. We stayed at the apartments above for a weekend vacation, and had","useful":0,"cool":0},"FTb-2MifYPf1fh-JSft3JA":{"text":"This was the 2nd best meal we've had in the Big Easy. The price was $20ish for 2 meals, wh","useful":0,"cool":0},"0tzrzo6fW5WTNa51m5ngVg":{"text":"We ate here our first night in town on our recent trip.  it was just down the street from ","useful":1,"cool":0},"sPzj8L_ZYjpJK0eZinXEjw":{"text":"Fun atmosphere and the customer service was excellent! \n\nI had the 3 meat platter. \n\nBrisk","useful":1,"cool":0},"dbZKx-Ya9Z9drWFAJQPP9w":{"text":"Service was good, but the claim of being the best BBQ is debatable at best. I'd expect bet","useful":0,"cool":0},"jJ_2tqKZeVcDoCfdl7z2yg":{"text":"I had visited the Texas location and it was awesome, so I figured I'd give the original a ","useful":0,"cool":0},"N604k1zJw_lFq_09pDe5Sw":{"text":"Clean atmosphere. Very Friendly staff!\n\nFood ... Meh. A bit flavorless. Gumbo extremely bl","useful":0,"cool":0},"dhaxVr8iLJUv_ZlmeCWg6w":{"text":"Being from california with family in thibodoux la my thoughts about southern style food is","useful":0,"cool":0},"rp-IVZ5RvH9_G3-4mTiLEw":{"text":"Basically this is the panera of barbecue. My SO and I went twice here during our visit to ","useful":0,"cool":0},"6zd4VsgCq5MovdU496X17w":{"text":"First time eating here. Friendly service. They were out of the smoked sausage so they gave","useful":0,"cool":0},"wTGpkSBO-_dIGdE894-RXQ":{"text":"Togo or eat in. \n\nSweet potato soufflé and the pulled pork are to die for. Also the white ","useful":0,"cool":0},"eLPogBg_3TqNhpdwUpzZbA":{"text":"The chicken was great, but the tri tip was dry. It looked like a good place to go eat and ","useful":0,"cool":0},"G1Hyrf_J3u2mdAkinylWPA":{"text":"This food was EXCELLENT!!! I went with the pulled pork, brisket,  with beans and mac n che","useful":1,"cool":1},"1VBwn_abXbNhxY-GjK2ang":{"text":"I've been here twice and I can honestly say...worse BBQ in the city.  The ribs are too dry","useful":0,"cool":0},"toQw2i2Ffowie28LnZCfSQ":{"text":"Went there for lunch RIGHT before I boarded the plane (and glad that I did!) to head back ","useful":0,"cool":0},"yHzsMaeGF7fFYI4yEbRYpA":{"text":"I simply love Voodoo BBQ!\n\nSure, I am bit partial.  I mean, my wife and I had our chill re","useful":1,"cool":0},"jF1Ix_JJgl06BT-RGOQAmg":{"text":"Is there any  way there could be a -star?!?! We stood at the check register right in front","useful":0,"cool":0},"_RgRXDP-5Hv4SzOqrTH5kA":{"text":"Had a pulled pork sandwich, slaw, and a drink. Can't complain about the price and with tha","useful":0,"cool":0},"5hVaiJoaZc-kGUbFg5n9lw":{"text":"This location was just barely above average... I really wish I would have had more time (o","useful":0,"cool":0},"UXU07CVckIdrh513q9H6Tw":{"text":"Had the voodoo combo platter of brisket and pulled pork and 2 sides ($10). Had the greens ","useful":1,"cool":0},"t5udmX2gSn9aEFHTujWrqA":{"text":"We are from Los Angeles CA vacationing here and this by far has been some of the best BBQ ","useful":0,"cool":0},"i5XHDBpcBM5ZhHMNhgZUzw":{"text":"Had their Fried Chicken Sandwich, it's called the Mardi Gras Special, damn it was good! An","useful":0,"cool":0},"iPacl9fdRVUBlSj71DaTyw":{"text":"Voodoo BBQ is quite overpriced for the portion size and quality of the food. I ordered an ","useful":2,"cool":0},"7oyss6CS2lFVfZw5ZrrOhg":{"text":"Shrimp Po-Boy was excellent.  Hubs had lg brisket sandwich and it was very good.  Prices a","useful":0,"cool":0},"hnpiwPF_qPhHHPHN3ftpDw":{"text":"The food was pretty good for a fast food establishment. My only issue is when we asked for","useful":0,"cool":0},"LeuxHrPBE8Lhj10IXCNalQ":{"text":"Found this place on Yelp while looking for a place to eat some BBQ after a day at the muse","useful":0,"cool":0},"Li0SSAON4xTB1JAtaGR-lw":{"text":"We were so glad we found this place while we were on vacation. \n\nWe loved it so much the f","useful":1,"cool":0},"9c7VYt-9yH5MIW6U0-n7Hw":{"text":"What a delicious little to-go treat of a restaurant to stumble upon this evening! Authenti","useful":0,"cool":0},"AdjIDtDyIakqTrQmWBydiw":{"text":"We came here because it was close, but absolutely loved it!!  We ordered from the southern","useful":1,"cool":0},"vTluYs81YcRGTNn_sBKZAQ":{"text":"Husband had pulled pork sandwich. There's no bbq sauce on sandwich. They have their 'signa","useful":0,"cool":0},"ZdyTT-Bu5yQZB_I3GJu9-Q":{"text":"Eaten there on 9/23 and the manager he gave us excellent customer service. We're visiting ","useful":1,"cool":0},"GHvwBVaoXuZ94fBxb5hSgQ":{"text":"We were pleasantly surprised at this place. We came for a quick lunch and got the Tuesday ","useful":3,"cool":0},"kwlixvkUym1GjxIMjk9eXQ":{"text":"This place has an endearing quality to it and I really wanted to give it 4 stars but it ju","useful":1,"cool":0},"UrDtZiZsZRuW0XF-rUTAnw":{"text":"Friendly hostess/waitress. GREAT food. Reasonably priced. Comfortable atomosphere. Put thi","useful":0,"cool":0},"3Q-v_85mtKMNXw7Q8eoruQ":{"text":"Ok, so being a tourist the name sucked me in. \"Voodoo BBQ\".  We were also pretty hungry an","useful":1,"cool":0},"2oOPL6m8oUdLOHtZH4y-Fw":{"text":"Glen the owner is so friendly. He goes around asking everyone if everything is going great","useful":0,"cool":0},"yuAdGiR15hDFk9dA6khjhg":{"text":"the bbq ain't bad but you really come for the corn pudding. that is one savory treat. i me","useful":1,"cool":0},"tbTPF9Ep5IT1nI1oxxle2Q":{"text":"It's not terrible. But it's not good eat. Should have known when I walked in the door. It'","useful":1,"cool":0},"7LBjuA4GMTOn8MJ0Lx_yrA":{"text":"Tender Smokey Ribs, Tasty Sides,  Pulled Pork and brisket were well prepared.  helpful sta","useful":0,"cool":0},"REE6KYz04zUNFAeqEJkMBQ":{"text":"We were told this was a 'must do' while visiting NOLA.  We stopped in for lunch on a Sunda","useful":1,"cool":1},"ztNnpCxjTLLfwvhyagUeRg":{"text":"I had the red beans and rice. Very flavorful and filling. Nice friendly service and good p","useful":0,"cool":0},"yNEv3ET8o0I1_erk_Bol2w":{"text":"No trip to New Orleans is complete without a trip to Voodoo BBQ!  My husband and I have be","useful":0,"cool":0},"EbgVIKHFnSWEmu89PD4UMw":{"text":"I was in town along with my brother and boyfriend for WrestleMania and was looking for a r","useful":1,"cool":0},"K0bHdj_CeEQVATxb4GcDmQ":{"text":"I listened to you yelpers and had myself a great meal here. The four stars is for the food","useful":0,"cool":1},"jK3jIQfS3UJV3TyTs-jXhg":{"text":"Food was great.   I had the shrimp po-boy and it was yummy.   Most of the reviewers spoke ","useful":1,"cool":0},"EPsWOuY1Lvntt4WC_W6kUA":{"text":"Great quick and easy BBQ joint. The Cajun sauce was the best of their choices. Stopped in ","useful":1,"cool":0},"v-1gdvcd7L27QuLVjW4Grg":{"text":"I had the Seafood plater with Catfish and Shrimp was great the Red Beans and Rice was good","useful":0,"cool":0},"VfmBsFofR3ywopCtlxGgAQ":{"text":"Food was okay and the drinks (mango margaritas) were awful! We asked if the margaritas had","useful":0,"cool":0},"WwFtd9Mk57_LWXfh3LHbSg":{"text":"Nice place to grab a pull apart pork. The best sweet potato I ever had. The bread putting ","useful":0,"cool":0},"3R0URAnd8_aWN5eU3CJRlA":{"text":"best mac & cheese ever!  gooey, cheesy, melt-in-your mouth... when they give you your serv","useful":0,"cool":0},"HDid-kZJDlV-D54bVaoBKg":{"text":"went on a business luncheon it was ok. I got the Smokey Burger I was told they had good bu","useful":0,"cool":0},"RMBsvX625HqkxhFCbcnRgQ":{"text":"Wish there was a place like this in Cali! Bread pudding was delicious and the sauces were ","useful":0,"cool":0},"Jad1bRJwsQcu64GOZCHm1Q":{"text":"Great bbq pork. I had the pulled pork sandwich.  Staff was friendly. It was pretty busy bu","useful":1,"cool":1},"NfiIa1iheSF0gGiBgMdAjw":{"text":"Good cheap food, I like the BBQ sauce and the shrimp po boy. It's a good spot for a quick ","useful":0,"cool":0},"1Hbaa4L_nxYGHXQ6AI7-hQ":{"text":"Always know what to expect and regularly enjoy dining here. Although there is an express d","useful":0,"cool":0},"aC-43BBJefdVi7s22gfZhA":{"text":"Extremely expensive for what you receive, my turkey was cold and only about 3 people were ","useful":0,"cool":0},"9i8J4pH1j0GabBqRQRCyCA":{"text":"The service isn't as good as the food itself. I had the pulled pork, sausage and brisket o","useful":0,"cool":0},"vUfPj-HSabt3CEg_mUQwJQ":{"text":"Great meat quality and baked beans! The jambalaya was great as well! Definitely would reco","useful":0,"cool":0},"qukrUzQv1uSzngKw-ZO6gA":{"text":"For a detailed review, see my blog link on the left side of the page and scroll to Voodoo.","useful":0,"cool":0},"RpnuMnvEq3mqpvmbXSxQgg":{"text":"This place was much better when it first opened. The portions were larger and you could ac","useful":2,"cool":0},"QpYMdrSIUnLG0AtAUpxa1A":{"text":"I was just happy to find a little cozy BBQ joint called Voodoo, the food must be voodoo-li","useful":3,"cool":2},"6tsw28cIX77FWSglh3Cvrw":{"text":"Love the brisket, sweet potato soufflé and loaded baked potato.  Only disappointment is Ye","useful":0,"cool":0},"MT2Z9FX1cOMP526GMERmrw":{"text":"We had a great experience here! The food was delicious. The ribs were tender, chicken juic","useful":0,"cool":0},"ZzKwkObT-2mwEb7HnUiAzg":{"text":"Voodoo BBQ is a tasty little fast food BBQ joint on St. Charles Ave. in New Orleans. It's ","useful":1,"cool":0},"5YrcrGOaqgFEJOucGBeYPA":{"text":"Great food, good prices, clean casual place. No servers to tip, so it's a good deal for lu","useful":0,"cool":0},"JLTBNKo2GWDC4rS3qbAQqw":{"text":"BBQ is mediocre and dry, macaroni is awful, gumbo is trash. Only redeeming factor is the b","useful":0,"cool":0},"2uNS0JFR0C6XC9GY4ktZxg":{"text":"This is dang good barbecue!! First time I have liked a place enough to post to social medi","useful":0,"cool":0},"BlyCsNROTur6qkNSPcMvgQ":{"text":"Tried this place out on our first visit New Orleans after reading the reviews... At 7pm, t","useful":0,"cool":0},"FbT1eRviPoOju1Aql4-kGg":{"text":"Okay, for anyone going to Voodo I will give you my guide to making sure you enjoy the food","useful":3,"cool":1},"nqaKdM2qKHe8Bg69I5CyGw":{"text":"Quick service, friendly staff. The gumbo was amazing as was the sweet potato soufflé and c","useful":1,"cool":0},"Xt4lwlMca3Zkel1wd0_AsQ":{"text":"This is a great place for lunch if you're visiting in the area and want something quick an","useful":0,"cool":0},"vYCgoejjG3Q90k1320xFuA":{"text":"We had food delivered to our time share condo and it was good BBQ. Only down grade was bec","useful":1,"cool":0},"Nr_FK4vvcEwxaGLn8mUr7Q":{"text":"This will be short and sweet.  The bbq sauce was good and looked delicious on my pulled po","useful":0,"cool":0},"Sjc9_bRIAYalelMZTdKI5Q":{"text":"I had dinner here. It felt like a chain restaurant (I know it's a chain, but that doesn't ","useful":0,"cool":0},"hiHibLRFhS7zH-c2vwo46w":{"text":"I've heard good things about this place from my friends and added to my list of places to ","useful":0,"cool":1},"aSsuwTL9tc1QMJNwUd2omw":{"text":"Pretty good food for the price, extremely fast friendly service. I'd definitely come back ","useful":0,"cool":0},"oK2TnUoIxrGcwJuyuDhLLw":{"text":"INCREDIBLE pulled pork and brisket (super tender).  The corn casserole is to die for.  Eve","useful":1,"cool":0},"OvbgzZWrZA8sXAjN6mKhyg":{"text":"Recommended by our cabbie.  Excellent food for a very fair price.  The corn pudding was re","useful":0,"cool":0},"gytotlKCFZx01IqrswV7jw":{"text":"Ate here on several occasions in August, 2015 ... And it was always great. Lovely, helpful","useful":0,"cool":0},"05pylODQ6pGOjxQb3QRAWg":{"text":"Tender pulled pork, savory corn pudding, flavorful mustard greens and velvety Mac & cheese","useful":9,"cool":5},"0fg3trhVrkgu3fQVHsDm7w":{"text":"Regular place, not really a touristy place, even tho its on St Charles. Prices are decent,","useful":0,"cool":0},"_ywU-hukKowpvQD5xuscsg":{"text":"Mediocre BBQ, small portions, and a long wait for our food... place was mostly empty and o","useful":0,"cool":0},"zYFAK6vRzRCt5xfJ8rtWNg":{"text":"Had the BBQ pork ribs w/mojo sauce, potato salad and greens.  The ribs were moist and tend","useful":0,"cool":0},"gyUHZMFRvEeVhNJzaGN5Dg":{"text":"Good and inexpensive food.  Lots of sauces to choose from.  The sweet potato souffle was a","useful":0,"cool":0},"hoFQ3Qf-MinBcyw2YeeEtg":{"text":"I wish we would have passed on this place. Ok let me say, I eat ribs everywhere and have s","useful":0,"cool":0},"qcHu1Mbz6ebspSOq6GGGTA":{"text":"Dont go!\n\nBelow average food:\nDry chicken, dry jambalaya, TERRIBLE GUMBO, sour smelling po","useful":0,"cool":0},"1bkuFISkNNxCYHysPf3YeA":{"text":"First stop on our first day in New Orleans. We got the mojo wings and daiquiris. Don was t","useful":0,"cool":0},"VjZvyL-V9jtVxflhYhSQqQ":{"text":"Good food, great service, affordable. Enjoyed the different sauces available and the frien","useful":1,"cool":0},"M2TKkw4CY9AdP2Cys7j2Dw":{"text":"Good food, nice staff, left full! \nThe bread pudding was especially nice. Not dense or ove","useful":0,"cool":0},"aERnOlGRYETJIAG__QoYVw":{"text":"I was recently on vacation and stayed nearby. A friend pointed this place out so we checke","useful":0,"cool":0},"qLcvGYul5AG3jPwXgwzQ5A":{"text":"Great food and staff! I'm not from here so this is my honest feedback, I've been traveling","useful":0,"cool":0},"fEaha1Dwi7Y79rMY7fLjVA":{"text":"I have to come here every time I visit NOLA! Great food and great service! I love the bris","useful":0,"cool":0},"Peso7NLM2GMdyXGfgBUgXg":{"text":"Can't believe I haven't written a review sooner.  This place is great!  The sides are amaz","useful":1,"cool":1},"cQeF8rKE5cvBZTUo5PpGQQ":{"text":"I just moved to the neighborhood and I've been to Voodoo BBQ multiple times already. The s","useful":1,"cool":0},"YO1jgejnPftR68iReF8YkQ":{"text":"I had the carnival platter with corn pudding and sweet potato soufflé, and it was deliciou","useful":0,"cool":0},"fNb6__b72LCDyMRjg_NyaQ":{"text":"For a chain, Voodoo is pretty good Q. Good smoked pig and sliced beef. The sides are tasty","useful":0,"cool":0},"YHy91lkHB9m4D0LiYaF9bA":{"text":"Ordered the two meats Graveyard combo platter with Cajun chicken and Jerk chicken. Picked ","useful":0,"cool":0},"LezESMO5hPcWZkbch0R7QA":{"text":"Food was good! Potato salad was disappointing, but the greens were awesome!!!! Looks like ","useful":0,"cool":0},"FMARItRoN2-qEEFeniXZVA":{"text":"Right when we got off the St. Charles streetcar, we saw this place and decided to check it","useful":6,"cool":5},"yA_AdgtSdIYUJ5IUdxSLsA":{"text":"Coming in the sign said \"best barbecue in New Orleans\" and they sure did deliver! The pull","useful":0,"cool":0},"GI1TIol47Pq8WxDsNi4UhA":{"text":"Okay so looking at the other reviews, it seems like my experience was somewhat anomalous, ","useful":0,"cool":0},"Dwtfi9tnXlUPjLRz5CU8sQ":{"text":"This is a great BBQ joint.  Some of the best pulled chicken Ive had, and Ive had a lot.  F","useful":0,"cool":0},"ft9eG26FLvJSABO8QXP7cA":{"text":"Voodoo does a nice job at being a fun, short order bbq place. My two sides are always mac ","useful":2,"cool":1},"o-9MdfTcLEVKU5nLQD-Nzg":{"text":"The man who took my order was very friendly and honest about portion sizes. I wanted to tr","useful":0,"cool":0},"bKXKP6sGPIyP_3FAV1hZbw":{"text":"The food is always great here. They've changed the menu up some and i wish they still had ","useful":0,"cool":0},"OvSe6UfUeksgOGXSmg4qHw":{"text":"Every time we come to New Orleans we eat here and the food has always been amazing and the","useful":0,"cool":0},"GhAsimQHM8D0T7rKSNdftA":{"text":"Food super amazing pulled pork red beans and rice corn bread and chips and can't forget a ","useful":0,"cool":0},"h5601ahACaKqVGPEeZyORw":{"text":"First PoBoy experience in New Orleans was surprisingly delicious for a seemingly fast-food","useful":1,"cool":0},"J9PGpmqGPUEiCgDfKwZEpw":{"text":"This place rules !\n\n Me and the girl were lucky enough to experience Voodoo bbq on a recen","useful":1,"cool":1},"viqOiV5xNTajyXcWYvW0JQ":{"text":"My husband and I have eaten at a lot of expensive delicious restaurants, so I was a little","useful":0,"cool":0},"ezCgiGSbiOZpxCcogdwSyQ":{"text":"Great value! I hate it when casual food places fill their menu with cheap carbs. We all kn","useful":0,"cool":0},"vzj1nWzB262itzIwrn2PsQ":{"text":"good fast food type BBQ. the free bread pudding was DELICIOUS! soooo good I'm so glad I go","useful":0,"cool":0},"W4RwlGo9EPBiLTOgIcC-QQ":{"text":"I had the 1/2 rack BBQ with two sides, sweet potato soufflé and baked beans! My BF had the","useful":3,"cool":0},"v1-9qvX5TcOwUVKwwMEcvA":{"text":"Good brisket, lightly spicy jerked chicken, good greens, a tasty take on gumbo. If you're ","useful":0,"cool":0},"PU0BBklnJFF5iPVqiXVTkw":{"text":"Great place! Really surprised they don't have 5 star reviews across the board. We were pro","useful":1,"cool":1},"DAxIvbVzjVap1UYBqwJ-sg":{"text":"This place is reasonable prices for the amount of food you get. \nI liked all the sides i g","useful":0,"cool":0},"e73J4iRLw5UoGy4dEBMxuQ":{"text":"Thank you, Voodoo. After 3 hours of standing on the corner of Melpomene parade watching, f","useful":0,"cool":0},"07jb13Qn30p3-mAV5-mnCg":{"text":"Voodoo BBQ is the quintessential \"fast food\" of BBQ, if there is such a thing.  Flavorful,","useful":1,"cool":1},"XMJXQ6dnCB6OpJ7sK-qWPA":{"text":"The corn pudding was surprisingly good, but even better with their Voodoo Sauce. The Q was","useful":0,"cool":0},"ctdw6Iqq48lgu1tWOci0BA":{"text":"This was the first jambalaya I've ever had, so I can't compare it to others. That said, I ","useful":0,"cool":0},"FMWyf6iUkeiGkJSXKoeKnQ":{"text":"Customer service is phenomenal.  Mojo sauce, gris gris greens, corn pudding and brisket go","useful":1,"cool":1},"rtJXAth94VQ9evOJPeN61Q":{"text":"Really great ribs, just melt in your mouth, and three different sauces to play with, spicy","useful":3,"cool":3},"i2r6vNSzR1_hrtB-61Ht8Q":{"text":"Awesome spot! Ordered the jumbo fried shrimp they give you a good portion. Great taste of ","useful":0,"cool":0},"wE9kRJepEvRQ-dcibkrXCw":{"text":"We stopped here right quick in Mardi Gras because it was on of the only restaurants open o","useful":0,"cool":0},"7L_tm33TEcFK1QDRbvYePQ":{"text":"We got the brisket and red beans and rice. It was amazing. The food was delicious! We had ","useful":0,"cool":0},"IaJfs6ZAPvG-vsVtagGYig":{"text":"Super casual, local BBQ chain restaurant.  No, it's not perfect for date night, but for $9","useful":1,"cool":0},"moeOwSWQ9WGqAAv3aAxH2g":{"text":"I will start with this is not the best BBQ place in New Orleans, not even in uptown (Ms. H","useful":0,"cool":0},"cdHBFyreaPI-Q6f6VI5Qyw":{"text":"Our group thought the food was really good.  The bbq meats were tender and juicy. And the ","useful":0,"cool":0},"uor1v6JuhGiJw3jp5YXY1w":{"text":"Doesn't look like too much from the outside, but the food is definitely worth it!  Meat is","useful":0,"cool":0},"_Q3QtAp1bHlqxZuVFV3RpA":{"text":"The brisket and the pulled pork loaded potatoes were amazing! Especially with the Cane vin","useful":0,"cool":0},"gakt2DvGMqpiE40WQmz6Dg":{"text":"First time in New Orleans. Stopped in for the five dollar daiquiri and bbq. Staff was extr","useful":0,"cool":0},"hk1uqcvxDksrfXcLBGs8Sw":{"text":"$5 huge hurricanes and when you check in with yelp, free bread pudding.  I like this place","useful":0,"cool":0},"PCaYMnbWrRLqdrr2IIhGKg":{"text":"In NOLA for 4 nights. Ate here 3 times because food and service was so good. Carly took GR","useful":0,"cool":0},"S6YyrT3z8beMx8a_S5Nl2Q":{"text":"We showed up an hour before they closed. (which I don't like doing because I know how that","useful":1,"cool":0},"iW58GGRdpSvZKleOvpZ-NQ":{"text":"We visited here twice during our stay in N.O.! I had the seafood combo special which comes","useful":0,"cool":0},"W52IjcV3LfZ7a8rrsUFYSw":{"text":"I (heart) Voodoo BBQ. \n\nWent there two days in a row while I was in New Orleans for a long","useful":0,"cool":0},"dNJKalM0AgFCtonEXizQDg":{"text":"Devantae was so nice to us tonight! It was our first time here and he gave us incite on ev","useful":0,"cool":0},"pVHvZlVFdCzkqsCG1MOmhQ":{"text":"The jerk chicken is out of this world.  The pulled pork is tender and they have some inter","useful":0,"cool":0},"AK80cO8yajBEtGxUcxianw":{"text":"Seeing as how this is the 1st restaurant I visited when I moved to NOLA, it's kind of stra","useful":0,"cool":0},"UEt8_IOsGgVKnGL57AOUwA":{"text":"Place is downright filthy.... went to use the bathroom and seen a huge rat run across the ","useful":1,"cool":0},"4S7hLIfcMNitMQiW5Nv0_w":{"text":"Just stopped in to grab a bite to eat quick before we left for the airport. The food was a","useful":0,"cool":0},"BgbK8xGwdqGfLJUuiNV7cg":{"text":"The bbq here isn't that bad, I mean it's not at all good or anything and for a time it was","useful":6,"cool":6},"j5UWGzTlxdLjhtNVQh2vHA":{"text":"I had high hopes for this place, primarily because it is close to my house and I enjoy goo","useful":0,"cool":0},"3uWSy2cSvKEIOr4bB6F7dA":{"text":"I am so disappointed in this restaurant. They barely gave me mead on my pulled pork, the p","useful":0,"cool":0},"L_gBeWwd6EGSPbX8Ai01WQ":{"text":"Very good choice for BBQ, served in a casual environment that offers the best parts of all","useful":11,"cool":8},"9H9toKruexu694js5Yh3fQ":{"text":"First time there and it was delicious! Baked beans are a must! Also the staff is very frie","useful":0,"cool":0},"tKZgKSQqgkxvJROlNajfig":{"text":"Very courteous and fast service.   My food was served in under 5 minutes.  The brisket is ","useful":0,"cool":0},"NOLOmd8FuZ1Mk3EhDtZD9w":{"text":"Was this the best cajun food I'd ever had. No. Was it the most satisfying and appreciated ","useful":0,"cool":0},"emeinlQuzr3pklUq_FkPHA":{"text":"Came to NOLA, and stayed at an Inn about 3 buildings down. Got the jambalaya, cornbread, c","useful":2,"cool":0},"XPyYwboPLvySMLNckJuLgQ":{"text":"This place grows on me evertyime I eat it (which is fairly often since there arent too man","useful":0,"cool":0},"E7lFI43yw2oVH5_-q8YUiQ":{"text":"Voodoo bbq was amazing. The brisket was both my husband and I's favorite. The bread puddin","useful":0,"cool":0},"Uj1-wrkInv3HoQes2Qzdcg":{"text":"Unpretentious little BBQ place in the middle of all the action on St. Charles.  Try the fr","useful":0,"cool":0},"6IVZnUbPWc0_nfWVCOrjjg":{"text":"BBQ had oven taste. Sauce was not good. Sides were not authentic. I will not be going back","useful":1,"cool":0},"HtnN9-vCkmTgusHjdgP-GQ":{"text":"This place is awesome! The staff is fantastic and our food was delicious! Would recommend ","useful":0,"cool":0},"PT7RVKd7itEd7XEJrg2KZQ":{"text":"1st time to New Orleans and looking for a quick lunch. Ordered the Voodoo Bur guh which di","useful":0,"cool":0},"6p9bgYHxLy1FDvKwOcp_rQ":{"text":"Two words = Corn Pudding!\n\nIt's comparable in addictiveness to Zea's Corn Grits. Hell, it ","useful":0,"cool":0},"NQRGhUW-tIXEp7k_YRasBA":{"text":"I was looking for some southern style BBQ and stumbled upon here. Located close to the gar","useful":0,"cool":0},"qakKM50e_G6jHmrTH9YVAQ":{"text":"Food was great, prices are reasonable, staff was super friendly! Everything had tons of fl","useful":0,"cool":0},"3zpRUqjl9cj8bRWh9qdqfA":{"text":"Voodoo is to BBQ what Cracker Barrel is to Southern Cuisine = reliably decent, but not for","useful":0,"cool":0},"AFnu0zNI_S-TIXF2v3sIpg":{"text":"This place is great. The food was fresh and delicious. I had the brisket and pulled pork b","useful":0,"cool":0},"zBneXJj9tflJrZVthif3pg":{"text":"Awesome food and a great experience manager Julie was so nice and friendly. The. Riskier w","useful":0,"cool":0},"_74sQBGoEKfB-Zd2qyiagQ":{"text":"We made a stop at the St. Charles Ave Voodoo again last night.  I have been there many tim","useful":0,"cool":0},"u8XnZ7DId8D6kbpwvVnkkQ":{"text":"I went here this week because I was really craving wings and when I arrived and saw that t","useful":0,"cool":0},"_qzuxiIeXOrcfaLY4hZQxA":{"text":"After seeing other reviews I needed to share.\nThis is my very first time in New Orleans. I","useful":0,"cool":0},"zbKnyTr5GSdKc6wBL3soUA":{"text":"Being from Nola, the standard is pretty high...This place was BOMB! I put every single sau","useful":0,"cool":0},"HBMiosbOkInxvAvhlSU8eA":{"text":"Good food. Appropriately priced. Nice employees as of recent. Shrimp po boy is surprisingl","useful":0,"cool":0},"B1zxF5LJJSgvmzvj_lw9Sw":{"text":"Everything was great. The brisket was to die for. And the team was amazing. Will see youll","useful":0,"cool":0},"mU3fRohj7Ao4R2LLMHLsOQ":{"text":"The food was fantastic. The service was spectacular. We were pleased to eat here. I had th","useful":0,"cool":0},"xG3kpA359lmrdZL82iNgBg":{"text":"The brisket and sweet potatoes are pretty good, the ribs, macaroni and gumbo were ok, the ","useful":0,"cool":1},"n35B0v7t7u9fhLCmyluKeA":{"text":"Wonderful food!! Great customer service and hospitality! Traditional Jambalaya and Gumbo, ","useful":2,"cool":1},"ppkFA34OozOgSQE-pLKX_Q":{"text":"Not very impressed. The chicken was dry, cold, and tasted old. My wife waited forever to g","useful":0,"cool":0},"K51BusS4Y7c66FWtBk85zQ":{"text":"Walk into this place and it screams NEW ORLEANS and your greeted by a really funny waitres","useful":1,"cool":0},"aSIjEfol7JtGk6mI6mvGVA":{"text":"Thoroughly enjoyed my visit. The staff were cool and friendly and the service was fast eno","useful":0,"cool":0},"GJfLm0ucBnXiR2NF3xOC8w":{"text":"Fast food BBQ...well worth a visit.","useful":0,"cool":0},"kRxencDo2I7_vx6Q4ZsrqQ":{"text":"Great service! Vanessa was very personable and accommodated my bach party beautifully!","useful":0,"cool":0},"jyBhiHqU6HlsX_c8YcYlqA":{"text":"Good lunch. Jumbo shrimp platter was good and the MOJO barbeque sauce is delicious. The fo","useful":0,"cool":0},"IcehHEPi4l7yLfxsUBJ6tw":{"text":"Mhmm mhmm mhmm the food was all good we enjoyed it very much. For the price you get a good","useful":0,"cool":0},"1Bbu_1fxF81K6OEvMOAgjQ":{"text":"I have to say I have a soft spot in my heart for Voodoo BBQ. The meat itself is good, not ","useful":1,"cool":0},"bpLdmAF_wJMHq4YTBpDmiA":{"text":"Vanessa was so sweet and helpful and everything was SO DELICIOUS. I'm from Pennsylvania an","useful":0,"cool":0},"XcnpkjttaKg_oMFeYquDDQ":{"text":"First time here. We had never been to NOLA before but this place was recommended and did n","useful":0,"cool":0},"Sau1pFaZxwjwecn7jggszg":{"text":"Pulled pork was bomb!\nCornbread was, too!\nMy husband liked his jambalaya and gumbo.\nThank ","useful":0,"cool":0},"2LlQs4jUxN05x28_vWqvlA":{"text":"Voodoo never has had bbq worth writing home about, but my wife stopped in to get a slab of","useful":0,"cool":0},"pKxJzYWycD8twT8F1KoXlQ":{"text":"My boyfriend and I visited New Orleans during (July5-7). We came to Voodoo BBQ & Grill on ","useful":0,"cool":0},"sYQbHgQlln1olZAxSNQ4fQ":{"text":"Good food- reasonable prices. We stayed in the hotel 2 blocks down and it was great to hav","useful":0,"cool":0},"No9y0JjLRztQKB__Lye6wg":{"text":"This was a great stop for lunch. Our group of four had all different items and everything ","useful":0,"cool":0},"U6wRwiS7W-A2qy0kWOy9zQ":{"text":"I was forced to eat at Voodoo again after a long hiatus due to mediocre food and too much ","useful":0,"cool":0},"Zs2uE1LGbXNN2XDyXNy7Lw":{"text":"Within 12 hours of my post,a owner reached out to me to rectify the situation and was will","useful":0,"cool":0},"lxTBBO_ZK7emhyQVQ4JdrQ":{"text":"The food is pretty nasty  this is the worst place to receive bbq this is not the place to ","useful":1,"cool":0},"Ikza1n6ckZ76XuHzGryxgg":{"text":"This place is excellent. We walked to this joint just down the street from our hotel. I'm ","useful":0,"cool":0},"tw0dxNdBcxftpMA5SuKKzA":{"text":"Carly is the best! Definitely get the potato salad. Fantastic.  All the food is wonderful.","useful":0,"cool":0},"OAr6msP9Xg6Du8FpMb8BVw":{"text":"Do it for the bread pudding! And for the meats! Voodoo BBQ is a great place on Saint Charl","useful":8,"cool":7},"RDfSsceSNHZSfzt4u773EA":{"text":"Visiting NOLA with the fam. My teens had the burger and fries, hubby fried shrimp with bea","useful":0,"cool":0},"ORDSU807vjNZAdFXF1iRFQ":{"text":"Love this place! The atmosphere is warm and homey, and the staff is great! We were able to","useful":0,"cool":0},"xhiGcONHAbluEYrCOaKVYw":{"text":"Here for a bachelorette party and came for lunch. Food was delicious and Vanessa is absolu","useful":0,"cool":0},"E6CQgB2nvDepFtvw7BS10A":{"text":"Excellent food.  Don was the best.  After your meal, try the bread pudding! Thank me later","useful":0,"cool":0},"0gNPEr6tOvf5FzgJILgK9Q":{"text":"Corn bread & sweet potato soufflé is delish! I love that I was able to customize my salad ","useful":1,"cool":0},"qvEL2JL-PfPx94nJLW8Lsg":{"text":"Worst BBQ I have ever had! Chicken slimey and undercooked, brisket was tough as leather an","useful":0,"cool":0},"gs_gVez6hNaCKGLFtJIN0w":{"text":"So the Vudu BBQ joint is legit everything I've had on the menu so far has been great the j","useful":0,"cool":0},"FqDje388kFdMga6DNNw_wQ":{"text":"With a large selection of mouthwatering delights, you'll easily find something you'll love","useful":0,"cool":0},"1Q66RLOiLr0HYG_HjRw-GA":{"text":"They don't even know how to slice brisket against the grain. Staff indifferent when pointe","useful":0,"cool":0},"dsqyQwuKwA_mzA3i92SrXA":{"text":"Ordered catfish po-boy. Pulled pork sandwich. Fries. Mac n cheese. Jambalaya. Gumbo. Fries","useful":0,"cool":0},"EVLSXZEE75shb2g1duRQug":{"text":"This place is great I love the food and it's seasoned to perfection. Nice atmosphere and t","useful":0,"cool":0},"Ip9e_rSlu6SRsTSHNpVBbg":{"text":"The the staff was very friendly! We literally walked in 10 minutes before close and they s","useful":0,"cool":0},"ySsmGDCSmaKHtRmvXEvG2Q":{"text":"2.79 + tax for this?  I'm skipping fries next time.  But they did give me ketchup without ","useful":0,"cool":0},"yJ-EfZKGiBrpGHAc4upUEQ":{"text":"Was on vacation in New Orleans, looking for a quick bite. Let me tell you, this place look","useful":0,"cool":0},"D5jjg4Sky6eaZZd_x0v-Zg":{"text":"Other than the fact that they were super busy, ran out of multiple things, and the cashier","useful":0,"cool":0},"YuL20Yd3hTJmE0aEqGAEcA":{"text":"This place is worth the stop!!! We were touring the Garden District and saw this place. Or","useful":0,"cool":0},"tBqMrDb2vOTc1-zw8gDI1A":{"text":"This place was soo delicious. It felt super authentic.. and I'm a vegetarian. The red bean","useful":0,"cool":0},"IqbIo_w5DKWWyEUTa5pgbA":{"text":"Food: 3.5\nService: 5\nAmbience: 4\nDate/Time: 12/15/2019 3pm\nOrder: BBQ Jambalaya, Red Beans","useful":0,"cool":0},"NBArIqAKEtkrtjFDshwvVQ":{"text":"Was searching for something close to our hotel that didn't cost an arm and a leg. This pla","useful":0,"cool":0},"j2A7JZ-XOvNtmZ17w8fq-g":{"text":"We had just driven for ten hours to get to NOLA and I was with someone who had never been ","useful":1,"cool":0},"JWCZAcF8wgtNSfBR4hOdIg":{"text":"Ok so I have been in New Orleans since Friday. Today is Monday. For those of you who don't","useful":0,"cool":0},"fgOsIWodH53b2W3W8iMBcA":{"text":"BEST THING HERE ARE THE PEOPLE.  Today there were a dozen or so ambivalent schoolies in li","useful":7,"cool":3},"2MmgPgKRCybRb29R9lSMTw":{"text":"I came here after hearing from numerous locals that it tasted good. I was extremely disapp","useful":0,"cool":0},"ogSl-2bHgI_SPtcFRzZ5zA":{"text":"Tender well prepared ribs that melt off the bone. They are very fatty which means fabulous","useful":0,"cool":0},"94pDerbHhFVfD939RcQ_lQ":{"text":"Visiting from Houston and decided to give this place a try. This a a great location on the","useful":1,"cool":1},"24rrN0MwxeccgSYm7dupqg":{"text":"Thank you Falan.  This is amazing.  Check out this little gem when you're in New Orleans! ","useful":0,"cool":0},"xAeH_sDaC-qlZNHSu-Sqwg":{"text":"I went here just before the 2020 Nyx parade began and wow I wasn't expecting much (given t","useful":0,"cool":0},"AJOTH2lwNmebQk9PXA8Ezg":{"text":"OMG, this place has amazing comfort\nfood that will put you in a food coma! I wish I had th","useful":0,"cool":0},"f5Mgeg60txDvZ_81i4F1zA":{"text":"Lunch at Voodoo BBQ on St. Charles Ave was awesome. Good food, quiet location to get a lit","useful":0,"cool":0},"7zyfdB8aI9SqsLcJ6KXu5w":{"text":"Very friendly staff. They made us feel so welcomed. We had the catfish platter, the fish w","useful":0,"cool":0},"bd8zkfUKstTt-6Jh_va65g":{"text":"Favorite BBQ stop when we're in NOLA. Brisket and ribs are outstanding!  The atmosphere is","useful":0,"cool":0},"y7kC8O8qNov-52YU_JLgCg":{"text":"The food here? I don't remember. It was good, I guess. \n\nWhat I do remember was the beauti","useful":1,"cool":3},"T1m-oijwFnsD25Y8euym7w":{"text":"We stopped in here during the parades. Food is smoked fresh daily. Large selection of both","useful":0,"cool":0},"OcKGBhSBvjQqVaTsOCfjoA":{"text":"Great lunch and great BBQ, the staff was great as well!!! Highly recommend it if your in N","useful":3,"cool":0},"VPO0FrEAsmjYJViaGsObNg":{"text":"Soooooo good. We come here every time we play a show in NOLA. \nNormally get the Carnival b","useful":0,"cool":0},"C12tuvjDi9rF-s8ITk4paQ":{"text":"Literally where do I begin? I'm from the west coast and was visiting New Orleans! Before c","useful":1,"cool":0},"YQ5bHW25TfehYCMcOxW89A":{"text":"Stopped by after 9:00 pm on Thursday night; there were a few other people inside; we had n","useful":0,"cool":0},"R1J-LmLn3pzLzQr_xYYzrA":{"text":"This place rocks! Food is awesome, service is great, waitresses friendly  and knowledgeabl","useful":1,"cool":0},"v3l8GgCi7S0xfGCQIChErw":{"text":"VOODOO! Hits the spot after walking for miles all day, in the heat, drinking, trading dign","useful":0,"cool":0},"e21RgFgfJiDPgL7iQ_R6zQ":{"text":"We stopped by here as it was walking distance from our hotel.  It's a decent BBQ joint not","useful":1,"cool":2},"K1NhjvIeH2XgsniGJzK6CQ":{"text":"I was talked into this place for a lunch stop during my visit to NOLA... I resisted for a ","useful":0,"cool":1}}