{"Djpp3BHJTXX4SayaZlOO6Q":{"text":"It's Sunday evening... most of the place in french market is closed.\nCraves some chicken c","useful":0,"cool":0},"jhUAnHDkX9l8kknALBJ4Ww":{"text":"came here while in the NOLA. It is what it is.. a touristy chain resto in a heavily traffi","useful":0,"cool":0},"95mZc_0BmnFjLc6x751SvA":{"text":"Great variety of food. The chicken was so crispy it felt like a potato chip trust, it was ","useful":1,"cool":0},"anVy5s1Xs_r1cthQplCE5A":{"text":"BEST BISCUITS IN THE WORLD!!! The chicken was good, the fries were ok....but seriously ple","useful":0,"cool":0},"4EtUDMqk8FDbfy4awndZOA":{"text":"Wow... just wow! The chicken is spot on with a great crispy crust and juicy meat and I hig","useful":0,"cool":0},"KhbpTpJzzbMXHjVigPRcjA":{"text":"Wow....4 stars?\n\nThis place was empty at 7 on a Thursday.  Bad sign for an obvious tourist","useful":0,"cool":0},"vkeog8hRDtPNtmwq_Xw2Tg":{"text":"Do not be deceived by a \"hole in the wall\" daiquiri shop. The food was bomb here and servi","useful":0,"cool":1},"WEEVaPJnxcLjWSThH2brIg":{"text":"Awesome drinks! Very refreshing and perfect for this hot weather.  Staff was super friendl","useful":0,"cool":0},"kG7Se_AaUe8veC7QuiTpew":{"text":"The food was ok and our server was kind of a jerk. I doubt that I would go back, instead I","useful":1,"cool":0},"CZ27HgZqH7WUtQ5SCWRDSA":{"text":"Good food and awesome people. We are local but just can't stay away from Willie's Chicken","useful":0,"cool":0},"5h1yMf0XOKdzC6hsGUZGnA":{"text":"Anything hot n fried while drinking in NOLA is not so bad. They are located everywhere. Th","useful":0,"cool":0},"sHBr-xUW5tJlmP7VzcE1dw":{"text":"I came for the daiquiris, didn't try the food. They let you taste test, which is pretty co","useful":3,"cool":3},"oy8uQPUeOlB6Wt0fEtJAjA":{"text":"My trip to NOLA was hilarious 1st of all. Randomly running into my cousin at the airport, ","useful":0,"cool":0},"gA5PdqB4ahEkGVZpXybyDw":{"text":"This place is the shit!  The perfect late night food spot.  It's inexpensive and so damn g","useful":0,"cool":0},"IilYDY86NLqp_STKdWSSxg":{"text":"Do people actually come here for fried chicken or just drinks? I came here for lunch and w","useful":2,"cool":1},"j860JbVJ1bKsnAsziVCsrA":{"text":"This is an absolute MUST while in NOLA. They have locations throughout the French Quarter ","useful":0,"cool":0},"AobUZ8VBUdWL0EImwCYNVw":{"text":"DONT understand why it is the famous place to have fried chicken in New Orleans. Only thre","useful":0,"cool":0},"jk_vBvI3pIvprbthyO_T2g":{"text":"Excellent chicken strips and shrimp.  Staff is very friendly and the restaurant is clean.","useful":0,"cool":0},"4MiuUDRmYFy4tD31BBfxgQ":{"text":"Definitely a must-go-to stop when in NOLA. They have delicious frozen drinks and I suggest","useful":2,"cool":0},"AuR-3HOJvaaPOVjspa9R8w":{"text":"The chicken is a little overrated in my opinion (tastes like Popeyes chicken), but those b","useful":0,"cool":0},"px9CkSH_iwkg7qCEvzLzNA":{"text":"Willie's has a lot to offer. It is definitely somewhere I'd go back to. I picked up some W","useful":0,"cool":0},"QnYNCl8gx3GlvlRN821EtA":{"text":"NOLA has a huge daunting list of restruants that range from elite fine dining by celebrity","useful":2,"cool":0},"JF7n-KZ18MQgU6zvo7aX4A":{"text":"Love this place, first time to New Orleans, and found this gem day 1.. How can you go wron","useful":0,"cool":0},"Zm9MUivN2MXZS0keJQZWWg":{"text":"Really disappointed with this restaurant.  First, they had a special menu with extremely h","useful":0,"cool":0},"7DYz1PzqLwM2nC-x7Gi08g":{"text":"This place is like a one stop shop for food, drinks and music. \n\nThe slushies are only $15","useful":0,"cool":0},"oOrY6UAkORaK_MNbHWh-0A":{"text":"You know how you feel like Starbucks is around every corner you take, this restaurant beat","useful":1,"cool":1},"nNJRR47NjjqCIvEkN9jDYg":{"text":"I did love the fries, the seafood basket was pretty good and the daiquiri were off the cha","useful":0,"cool":0},"Z4L1SiG-8b_ENQfNsW7BcA":{"text":"Beat fried chicken and biscuits in the world!!!!!!! I still can't thinking about them! The","useful":0,"cool":0},"7Aaw1eLQA35npVFfAEpaGw":{"text":"Firstly, Our food came out quickly and the place appeared clean. Only reason for these two","useful":0,"cool":0},"z8-1c0uMmvJGDINsNdZ38g":{"text":"Drink drink and more drinks! These frozen daiquiris where very refreshing and perfect for ","useful":0,"cool":0},"IOYoikn-unT7Bpj3ntWytw":{"text":"On a break from work tonight I stepped into Willies on Decatur to grab a bite. It's a brig","useful":0,"cool":0},"UjNUvtK9uCfov-j-_u-yZA":{"text":"Great customer service, great food. The staff & other patrons were super duper nice. This ","useful":1,"cool":0},"MtqAqLVZ96S-15OXi7InkQ":{"text":"Good place to get a cold adult beverage and some good fried chicken/fish to detour the onc","useful":0,"cool":0},"ARcApGCVjq0mrpzmgRyrqw":{"text":"Delicious food and daiquiris!! I tried the krispy wings which were juicy and delicious! Th","useful":0,"cool":0},"I_ZLbPk_jr-UUDHkZXhRBw":{"text":"I'm from Kentucky, and this fried chicken right here is something special, the honey butte","useful":1,"cool":0},"IC8oYgN4k8tLmVzET5G7-Q":{"text":"The Blood Mary's were good. Other than that the food is mediocre at best. We got #2 chicke","useful":0,"cool":0},"4_ejNCjFwZYSZE-Lq7GhWA":{"text":"I really enjoyed the food and laid back atmosphere here. The red beans and rice was soooo ","useful":0,"cool":2},"8Nr_OmQywIyZOoYoAeVYrQ":{"text":"This place is ALWAYS A PARTY! I can hear their music from a block away and the staff is al","useful":1,"cool":0},"3xb0Q2jRek0FGtD5DyPZ5w":{"text":"After seeing all the daiquiri places scattered around the French Quarter I convinced Hubby","useful":0,"cool":0},"F1LjNsl0pRHFV83mulbhJw":{"text":"After asking locals about a good daiquiri spot, we were directed to Willie's Chicken Shack","useful":0,"cool":0},"V41nuoXzUG1BpOkjRVJhmQ":{"text":"Everything is wonderful! I should have brought a box of biscuits home! Chicken was crispy ","useful":0,"cool":0},"Hw_5wIiy9JsC99mmTlBpfA":{"text":"This review is solely for the biscuits... I've never liked biscuits until the day I tried ","useful":0,"cool":0},"3P4AZSVng4bLQ355bdrMMA":{"text":"Great drinks!  We had a fried meal with shrimp and catfish.  Super yummy, especially with ","useful":0,"cool":0},"s_DQpXxmrhgLnG7_E1Wosg":{"text":"Do not eat here.  My husband,  daughter, and i all just did.   I had the 3 piece chicken, ","useful":0,"cool":0},"F6MJQ7bdpMHGLou8BCeh3Q":{"text":"Affordable and delicious! The chicken is so moist and big pieces. I mixed half and half re","useful":0,"cool":0},"Nv4LCNwJAs8ig4PntIFS9Q":{"text":"We saw these chicken shacks every block or two on our trip to NoLa so felt like we were mi","useful":0,"cool":0},"mI-5TihcT_HOR9W0_qB3IA":{"text":"Very very pleasantly surprised eating here.  We were so busy visiting Nola and needed to e","useful":0,"cool":0},"0C9y6M4toH_k_y0ZArbbrQ":{"text":"This was my first time in New Orleans and my first time at this Willies Chicken Shack on D","useful":1,"cool":1},"f49vxBOVv_8W3JrLtdhjLg":{"text":"Decided to try this last Sunday around 6:45 pm. Bad decision.  Chicken wings were so dry t","useful":0,"cool":0},"UkaZYY7Ih89Z3F8oJKE0LQ":{"text":"You can get different kinds of fried chicken and a drink or daiquiri. It took a while to g","useful":0,"cool":0},"08hZBKo298sdXFUMySGUqQ":{"text":"Our first time having Willies and it was amazing. We loved Willies sauce and blended marga","useful":0,"cool":0},"tL-VGMoJbCfzWuz4Nnu1eA":{"text":"The food was atrocious and extremely overpriced. 3 people for $50 (water was $8 for the th","useful":0,"cool":0},"2R-xCm4X-g4-Mg4pY2j7tA":{"text":"Fried chicken platter was so good! Even the French fries were delish! Perfected any time o","useful":0,"cool":1},"EJqn6CuKeyhBOVe0RieEmA":{"text":"This stop was just for drinks, although we've had their chicken before and it's great! Bar","useful":0,"cool":0},"dJO-BZjmM_dE0nzNPKoFCw":{"text":"drunk or sober this is the place to be. omg their chicken wings are the best and who doesn","useful":1,"cool":1},"C_DTGYIuzEx1f_z3UL8Umg":{"text":"Ummmm. Best friend chicken tenders and Cajun fries in town! Also, if you don't try Willie'","useful":0,"cool":0},"q1NYKo_r3AJZ2Nc9iqf4AQ":{"text":"I came here because it had awesome reviews. I am not sure if it was due to the location of","useful":0,"cool":0},"ydFfmxr21ccaBtqEUGGsKQ":{"text":"Went here to get a quick bite before going out for the night. We ordered Cajun crispy wing","useful":0,"cool":0},"PV0tN9qg5FElA9QlRYdjHA":{"text":"Being Celiac in a town that fries water can be difficult. I went with a friend to this Wil","useful":1,"cool":0},"_IOUwfUqUvd22PCgADzgmg":{"text":"We stopped by here to get a \"Willies Punch\" which proved to be a nice strong concoction an","useful":0,"cool":0},"2iEi6Tlv0ZzaWVftENaNpA":{"text":"We don't know about the food at this location, however we ducked in here during a rainstor","useful":1,"cool":0},"CzhBjyqInLUN99TXajopkQ":{"text":"The food is good, the drinks are better, and the service... ugh the service! They need to ","useful":0,"cool":0},"yMcEefHr0pPoH4fY6Lt-UQ":{"text":"Decent enough for a food chain. Definitely not the best fried chicken in Nola but decent e","useful":0,"cool":0},"lynM0vaQQOTNHxDLKv7kiA":{"text":"BEST BLOODY MARYS EVER!!! They infuse their vodka and use what looks like Frank's Hot Sauc","useful":0,"cool":0},"_AEjcvdMYpVtjjt-vMgd9A":{"text":"Oh my god I have never in my life eaten fried chicken this good and I have eaten more frie","useful":0,"cool":0},"N6RxRI8LdHDZMDr3j4SZCQ":{"text":"Good chicken  well fried.  good drinks i love the place   Many location all food was consi","useful":0,"cool":0},"FFkIDya3nugpf9fc07Uweg":{"text":"The chicken was ok. The chicken was very crispy and  seasoned well, just a little under co","useful":0,"cool":0},"LmcLPy64ZMR46OQZUY3g1Q":{"text":"This place was delicious and clean. The only reason I gave it a 4 is because the service w","useful":0,"cool":0},"eWabxFwTVg6SzU5WOCO1kQ":{"text":"Chicken was crunchy and delicious. We also had the gumbo and it was savory and flavorful. ","useful":0,"cool":0},"sTzWGcG9nbdrADioBlZSYw":{"text":"My partner and I had different opinions of this place.  For me...the chicken was very aver","useful":1,"cool":0},"enPkkCup9IK8dRcypncBcQ":{"text":"Quick walk in chicken and drink spot. This was my first official New Orleans food. Grabbed","useful":1,"cool":1},"1O0UUb602jyFF-oIgdJhRA":{"text":"Great place, the staff wasn't super fun. But Mardi Gras did just end and perhaps they are ","useful":1,"cool":1},"M0QXmkeN3osWYV7oa4b-RA":{"text":"Buzzin' and Willies was at the corner. Got the munchies, gotta get my fix. \n\nSure, says ch","useful":2,"cool":1},"1Co9AT-0TOJRegRVnuAQ5g":{"text":"Ohhhh all I can say is that this place had some of THE BEST fried chicken during my time i","useful":0,"cool":0},"Wr6cJT5CcySOxBTMCVYd_A":{"text":"Biscuits!!!!!!!!!!!!!!!!!! Omg!!! The best I've ever had in my life. Keep it up! And the d","useful":0,"cool":0},"JoG_h8UC5tQD2cFvnQaPrQ":{"text":"After visiting the Bourbon St location and then this one, I was disappointed. Bourbon St o","useful":0,"cool":0},"VLKiuH5gzxh1nx248K3ZIQ":{"text":"Hands down - Best fried chicken. Maybe because I was tipsy, or it really was that great! B","useful":4,"cool":1},"AWAqnkmcg1W4oi9W21SBew":{"text":"Came round with a local friend as the hankering for fried chicken at some dreadful hour be","useful":2,"cool":0},"CfJiOgqdF8OO8fPZkz5mLw":{"text":"2.5 stars.\n\nAh man! I saw these chicken joints everywhere I turned while staying Downtown ","useful":5,"cool":4},"IZGBWX7yF6sIAQlRGqFjDw":{"text":"Great interiors, awesome fried chicken and good selection of draft beers. \n\nEye catching w","useful":4,"cool":4},"8iIPLY2jsMuDRip62p2y-w":{"text":"One of the best chicken strips you will ever find. Seasoning on the chicken makes your tas","useful":0,"cool":0},"x-Jjvdw_ju4Owp1b_nxuRg":{"text":"The chicken and seafood were all so great, the biscuits were so different from any other o","useful":0,"cool":0},"vKB54S6byjZXQ0mTkA5fvg":{"text":"Gumbo hit the spot; I was a little sick and needed something soup-like. I prefer gumbo wit","useful":1,"cool":1},"Xf_bp0WxtDdSOpG2ZpZpuw":{"text":"Went here last night so awesome! Great chicken super fresh and hot. Great service. The bis","useful":0,"cool":0},"t5WaU5u5WmZgPE4KI-74Yg":{"text":"Andre makes the best damn Bloody Mary in NO if not Louisiana. The Vodka is infused with pe","useful":2,"cool":2},"cVKi-ozZiheErUk9Lp47aw":{"text":"Stay far far away from this place. We had the worst experience with 20+ mins for food and ","useful":8,"cool":5},"U6D5nMhH5DVpMJFP41r8OQ":{"text":"It was mid morning during festival season and I wanted something different to drink. Comin","useful":3,"cool":3},"G56ZgAeYo8T0baf8UhH5WA":{"text":"Food was only ok. Too much breading on the fish and shrimp. They are overpriced. They got ","useful":0,"cool":0},"1yhN8w0kQ9YTR02WAFpVrw":{"text":"A great place for chicken and frozen drinks. The staff seemed to need some guidance. We as","useful":1,"cool":0},"clv4ke0UhgDql-VNfc-SwA":{"text":"Read about this place before coming. Said chicken is delicious. It is!! I got the 3 pc ten","useful":2,"cool":1},"9fNZwe5zPPkSR_Ed3nBQ4A":{"text":"The drink is good to sip on however it doesn't seem very strong but the taste is there. My","useful":0,"cool":0},"lXLdoJMs-w8q1HhPfyLXiA":{"text":"Mediocre gumbo with meager portions (in a Styrofoam bowl)and served WITHOUT French Bread. ","useful":0,"cool":0},"YtIdbYic5L2t7vOxSVpa3g":{"text":"I had the chicken tenders and they were amazing. My husband got the seafood platter and lo","useful":0,"cool":0},"cHoH4bR2fiIP7wx0lr5U3w":{"text":"This location is right by the French Market. I stayed in the French Quarter the week I vis","useful":33,"cool":24},"wow2HN_YDZMiIeMDmrKejA":{"text":"By far one of the best catfish I've ever had here. The fried chicken here is so-so, not as","useful":1,"cool":1},"TwSp4mhHfPyVtHumh8tNaw":{"text":"The fried chicken is awesome. They cook it to order. They also have a wide array of decent","useful":0,"cool":0},"LAQ4dNhnI69d61cmGYkN-Q":{"text":"Fun place to stop for a small meal and a frozen drink. They have several chicken options a","useful":0,"cool":0},"z3lrVEn2SclJxB0q_sZzeQ":{"text":"Recently tried the place out whilst on bourbon. Food is delicious especially the beans and","useful":0,"cool":0},"9B-T--b4CuL7bAU1y9Iy8Q":{"text":"It was the !!!!!!\nI got the white chicken breast and a wing with fries and a biscuit. The ","useful":0,"cool":0},"38l6XIw5McYiXiE1AuBaZQ":{"text":"My SO hyped up Willies Chicken Shack so much when we arrived in New Orleans, so we had to ","useful":2,"cool":2},"hT_9iHx-FPiTw4HB8B6dFA":{"text":"This was a terrible experience. I have been waiting for THIRTY MINUTES for two orders of c","useful":0,"cool":0},"TejdutTMmNh0b3CcxqFsUQ":{"text":"Absolutely best chicken wings and fried catfish I think I've ever had in my life. It's fun","useful":0,"cool":0},"r4FH_SOD2Tla3SuNyxo2DQ":{"text":"I have to note, I was already full when I came. We only ordered two dark pieces to try the","useful":1,"cool":0},"2CpP5WvjNKJHJ9_R5OgfQg":{"text":"One of our favorite places during our entire NOLA trip! Had our first meal here a few hour","useful":0,"cool":0},"yjMyRfd703TnPCAqmQPEjw":{"text":"Stopped for something quick for lunch. The food is good and it's a good price. We got the ","useful":0,"cool":0},"T2dFyHcSEQ6As9hU2Fo-Qg":{"text":"The chicken. Hot, crunchy, juicy, tender delicious fried chicken. Honestly some of the bes","useful":1,"cool":1},"4lxlEWWW0JD97WQYtuvwOA":{"text":"Even if you don't go to Willie's for the Chicken Basket or the Red Beans and Rice, you've ","useful":1,"cool":0},"LVsG5iCArqUyPoIrMh3OFg":{"text":"Mmm, thank goodness for Willie's. On our last day in NOLA, my friend and I stumbled in wit","useful":1,"cool":0},"7tbilAdog4WLfa8DYQH5-A":{"text":"Are you serious!!!!   6 small shrimp with fries and biscuit for $13? RIP OFF CITY!!!! Keep","useful":0,"cool":0},"PsZRj8iBo3KYf88cGgD9wg":{"text":"Good food in a good location with great customer service. To be fair, we weren't in the co","useful":0,"cool":0},"tw6e2UiBq6VFB2UnmRHThg":{"text":"I'm going to be honest and brutal with this review. However, all the hype this place has a","useful":2,"cool":1},"pSrTNrXhPzKTuVvdyb7_FA":{"text":"I have had Bloody Mary's all over the French Quarter, and hands down, Andre has the best o","useful":1,"cool":1},"O7ak3334Ma98i5PgPECcRA":{"text":"I eat here on my lunch a lot and the food really is made to order. I watch the cook make i","useful":0,"cool":0},"ixpY7xz53o63hMeEuo8XGg":{"text":"The chicken sucks and the drinks are over priced and weak. Either be a bar or a restaurant","useful":0,"cool":0},"84EhRVNZfwXb1uf5qeKe9g":{"text":"I am a southern girl who loves fried chicken & this franchise was everywhere. I was pleasa","useful":0,"cool":0},"S8fPu5h2Bo53Lq32ZRgvZA":{"text":"This rating is for the frozen margarita since I can't really eat here due to being gluten-","useful":1,"cool":1},"Po8Ce0Zp37LiDP0FKrxU8w":{"text":"After having so much fun on Bourbon street, my friends and I decided to walk to the chicke","useful":1,"cool":1}}