{"R8oYsRK6icDbhaydDe2_eQ":{"text":"Great neighborhood bar! Such a friendly place with great prices and plenty of live shows. ","useful":0,"cool":0},"-B14WUfENj1YrwOiewJVjQ":{"text":"The bartender padded my bill. Not a credit card purchase so not worth reporting to the pol","useful":0,"cool":0},"6zzVrNzTvWy0fDCuztMeCw":{"text":"Sidney's had the excellent taste to host a trio of great local acts. It had the largess to","useful":1,"cool":1},"kYp7klZWOj5C9fuIQ9hzDQ":{"text":"Great drink prices, friendly staff, and an all around good spot for a drink if you're in t","useful":0,"cool":0},"2ZSccUjSlrZ81md9r1dBtg":{"text":"Their Thursday night comedy show, Night Church is free and has FREE New Orleans Ice Cream ","useful":0,"cool":0},"KiQ2dM02uTAZrd1kC7AY3A":{"text":"I'm the only white person I've seen in this bar three blocks behind my Esplanade Avenue ho","useful":1,"cool":1},"C2Wz2VUJSDz6V6O9YmRubA":{"text":"Great place, nice people and you get to see something else then the French Quarter. There ","useful":0,"cool":0},"r3_6utpMSSJaiomd2j8mVw":{"text":"A gem my girlfriend and I had the pleasure of stopping into during our visit. Bartender wa","useful":0,"cool":0},"TH_kI23q8kCbJElj5n0ekg":{"text":"Specifically reviewing the skinny white male bartender who wears glasses and has a combove","useful":2,"cool":0},"TYYq2Qkz_7MNGXOqHekWhA":{"text":"This is a pretty cool dive bar off in transitioning part of town.  They have live music an","useful":5,"cool":4},"dN7mJXKuWTu53UnqN9-NVA":{"text":"I came to NOLA for jazzfest and the best music and places were in the bars. This place on ","useful":2,"cool":0},"_I4bY4hFwavJyAjDJMKlAA":{"text":"This is a great neighborhood spot with a wonderful free comedy show on Thursday nights and","useful":0,"cool":0},"Fgv99cbjpgTsqDD6njmLgA":{"text":"For generations Sidney's Saloon was a bar that was infamously know for its drug happy clie","useful":7,"cool":7},"5DkDhdEcth5ugmWHobCYcA":{"text":"This place is totally what a dive bar should be - casual, local, and fun. I came here on a","useful":0,"cool":0},"2si5CehUbvcFZFiWME8VaA":{"text":"F'ing rad bar to end your night w/ amazing bartenders (esp. Mr. Steel), cheap drinks and g","useful":0,"cool":0},"jbWP_OsKXY1hyn0fov0TeQ":{"text":"Came here the other night with DJ Heatwave on the ones and twos. \n\nSide note: If your frie","useful":13,"cool":7},"Wa0-ugADlNv-1rwkVePvvg":{"text":"love this neighborhood spot. pool. darts. dance parties. drink specials. open late and a d","useful":0,"cool":0},"k8aEOQkMnIOJ3Sowb0TPlQ":{"text":"Also came here on a Monday to see King James and the Special Men play. Agree that live is ","useful":0,"cool":1},"pZpEsFNG4Y6-92q2-9zVHA":{"text":"This place is FUN! Great bartenders that like to chat, the owner is awesome and has amazin","useful":0,"cool":0},"T9f-rKltl_-SZkZWb7n2nw":{"text":"this is definitely a dive bar. They have pool tables available for play, and open dance fl","useful":0,"cool":0},"3cIAqKzz-aEEzoUUY9nMcA":{"text":"Night Church! GTFO. Free ice cream?! Jokes. Jokes about space. Jokes about sex. Wow. The b","useful":2,"cool":1},"195nvL1S-mN2hg6Uawdxxw":{"text":"Came in to check out the New Sidney's since Robert sold it. It's not half bad. I miss the ","useful":1,"cool":0},"br-YB0NUMw-e2O3ycm6PdA":{"text":"My new favorite bar! It's got such a large beer selection and I don't even drink beer that","useful":2,"cool":2},"QGRQ5BsnuwlFdnmcb95WFQ":{"text":"Cool hang out with cool pop up dining. I'm normally hear on Thursdays for the free comedy ","useful":4,"cool":2}}