{"x-F7dX0fTiu6b5Rs2VLL1A":{"text":"I thoroughly enjoyed our meal here!  Every course was equally fantastic. We loved the oyst","useful":0,"cool":0},"rQYoj5JdS_D1yf335haeOQ":{"text":"I can't speak to the food, but the service was abysmal. We were seated, and ordered shortl","useful":0,"cool":0},"0WNxWGH2-bO0VUle8Zl3_A":{"text":"Classy, expensive, delicious, noisy, open kitchen, good service, amazing smells, great des","useful":0,"cool":0},"Sc0yYZJ-dBvMvDjzlq5c3A":{"text":"Dinner for 4 at 7pm on Saturday.  Our waiter was great, the drink girl was not (she took a","useful":1,"cool":1},"HiIWEV2Q3Jf8BMXBkcGH2w":{"text":"The food was pretty good, but certainly nothing extraordinary. What stood out most to our ","useful":1,"cool":0},"utVXVNPveHKGn6_ssg1YZQ":{"text":"We stopped here for drinks and apps before heading out for the night. We sat on the balcon","useful":0,"cool":0},"ZZtVfoy9Nm8SSeZLfZNYmA":{"text":"I would like to have had the opportunity to leave a good review, however did not make it p","useful":0,"cool":0},"2lD_lBRzl6KzeZEtSV15dg":{"text":"Not a great experience. It started off well enough...we had an 8:30 reservation on a Satur","useful":3,"cool":0},"UvP1sNMq3Ac82U-CZ3GO2Q":{"text":"I've been wanting to write a review since I left Nola! First, the host there was quite gra","useful":0,"cool":0},"nbOOpp68kqRFyt4OdE79vw":{"text":"Loved everything I ate. They have a good looking burger for people who are picky. Happy ho","useful":0,"cool":0},"yWnWBa5w8sB0KV_TcsGY9w":{"text":"Fine dining establishment. Great wait staff. Great water refills. Kitchen was timely and a","useful":0,"cool":0},"rTSH5Nzxx46k-UmV8HFgwg":{"text":"We met two friends for dinner here last night. One person didn't comment on his food but a","useful":1,"cool":0},"vnKaoGgv-Y9A1MH_izZlbQ":{"text":"Absolutely wonderful dinner. This was one of the few places we could get a table for five.","useful":0,"cool":0},"q751lZ-2W-FeIgkAJEvX7g":{"text":"We had a great experience. When we arrived we alerted our server, Scott, that we were on a","useful":0,"cool":0},"hACtDY6WZBbHXSLXU381Sg":{"text":"The atmosphere was nice. The restaurant is in a historic building, not tacky....very class","useful":1,"cool":1},"OQPZT2X4ePlH0_dJucQNoA":{"text":"Our group of ten descended upon Tableau for a 730pm dinner on a Thursday night. We found t","useful":2,"cool":0},"suPnTFeTp8dbv-M7dPcepw":{"text":"At Tableau on old Jackson Square --\nDo visit the upstairs bar there. \nYou might meet Miss ","useful":0,"cool":0},"PkKvsXFaj-E1EVy8WnmDXg":{"text":"The shrimp and grits were fantastic. Portion sizes are small for Nola but that's normal fo","useful":0,"cool":0},"IfQREg9E4yiwYVmN9c4SMw":{"text":"The four of us had a great overall dining experience. Based on the service and our meal he","useful":0,"cool":0},"elBxPa8uObVlaM5qN3DO9g":{"text":"I was really disappointed in our dinner. My spinach salad and the bread pudding we're grea","useful":3,"cool":0},"1-DDg2XGE42CKEQxKmsFEQ":{"text":"I would agree 100% on the awesomeness of the food. The restaurant is conveniently located ","useful":0,"cool":0},"hW6d3v3JD1LoVBdktibEug":{"text":"Lovely Brennan's brunch styled breakfast.  Went classic with the eggs benedict and bottoml","useful":0,"cool":0},"AswVnquNRh3mcuTEZ2zdDg":{"text":"The food was below average for a Brennan's restaurant. I ordered off the Revillon menu, an","useful":0,"cool":0},"8Fh21GoB3UjuGj2SIyRNLA":{"text":"On a Sunday night, at the very end of Jazz Fest, we were on a hunt for a final night decen","useful":1,"cool":2},"uxbYTeK69eyibP0LXAreUg":{"text":"The food here was delicious! Nice portion sizes with great taste! Wait staff is attentive ","useful":0,"cool":0},"ETM2HgzvPCFDecxiqeUP6g":{"text":"My family of six had just arrived into NOLA and were looking for a fine restaurant. Servic","useful":0,"cool":0},"yN_pY7s328X60VdWHfts4Q":{"text":"Exceeded my expectations!! We went for mothers day brunch/brunch following a wedding. Serv","useful":0,"cool":0},"o1BsBsgKDXsS7WmBcYkahQ":{"text":"There were four in our party, exhausted from a day of touring, and we stopped in for light","useful":0,"cool":0},"id_7SIXiWWHlcQmd58bj7w":{"text":"Came here for happy hour. Their menu is good, so that's a plus. Unfortunately, our bartend","useful":1,"cool":0},"AgjfmCKTKsAt93QOrD364Q":{"text":"Still love the venue, great balcony (if they will let you sit up there for happy hour whic","useful":1,"cool":1},"Cs6tWLKxJOgG0LgFup2kOQ":{"text":"Tableau has a great location off of Jackson Square and is in a very attractive older build","useful":2,"cool":0},"ZiA79gapkgDZN8PE6bcmoQ":{"text":"This was the first of our Coolinary outings this year, when we get to treat ourselves to n","useful":2,"cool":1},"8ELi8ariLB68o8kLl95p9w":{"text":"We sat upstairs on the patio overlooking jackson square. Rose and apps were excellent. The","useful":0,"cool":0},"dpy9viguOA701wySZMeqAw":{"text":"This was our first stop when we landed in NOLA so let me say that this review is colored b","useful":0,"cool":0},"ynfACVP64Qr4bdHTG6D4nQ":{"text":"Wandering around the French Quarter on your own can be a little lonely - unless, of course","useful":0,"cool":0},"KNbv1nfWx4KCBrqyFGGpIw":{"text":"Absolutely delicious food! Outstanding service. Sit on the balcony for a great view of Jac","useful":0,"cool":0},"AdFogJPvS1Xqt9ELXi2pKw":{"text":"We must have gotten the wrong waiter today. I'm not used to blatant inattentiveness and ru","useful":0,"cool":0},"EVFoRmluC84qR270VCG76A":{"text":"The droplets slid down gracefully from from the frosted glass of Abita. My teeth cut the t","useful":1,"cool":0},"b_Va6s-SFKOoYqMWLdPkTA":{"text":"Food good and well presented.  Comfortable and unique French Quarter atmosphere.  Service ","useful":0,"cool":0},"Zy3p7ThY4Nd1V9Mk9Xun0A":{"text":"5 star experience this past Friday while the city was buzzing because of Jazzfest.  Beauti","useful":2,"cool":3},"GdkQWCwushaA6SV0ghEEpw":{"text":"Absolutely the worst dining and service I've ever experienced. Avoid at all costs!!!\n\nThe ","useful":6,"cool":1},"uLoPCGOBtTsicaQ9dVrYdQ":{"text":"This place was recommended by a local. She asked us to try milk punch here. They had one w","useful":0,"cool":0},"WARMT62FST1xh4KC4tbG2Q":{"text":"Worst food I've had in this city by far.  Pretty surroundings but poor service and I would","useful":0,"cool":0},"XMDvhRUwnHZ-JrZ-DAJOAw":{"text":"Pricey buy good. Reservations needed but we walked in and sat at the bar.  They offered co","useful":1,"cool":0},"yNCkJZwl0kn5nkg20qREzw":{"text":"Our high expectations for a Brennan restaurant were met and exceeded here.  We had the shr","useful":0,"cool":0},"UAiCVR8IQBDl7od4hJCmGw":{"text":"We dined at Tableau for Fathers Day lunch, which was fantastic. Ambience is elegant but li","useful":0,"cool":0},"Hnsg1Jz3x0j2AzWqZ5vgiQ":{"text":"Food was very good, I would give it a solid 4 . If there was a 4.5 choice I would add that","useful":0,"cool":0},"FYNTmUjXsZhpi5hQ4-EoeQ":{"text":"I was mortified that my dad wanted to eat here as I was in a tshirt and yoga pants. I will","useful":0,"cool":0},"NGRayV29lt-1LomhFyjJyQ":{"text":"Full disclosure: I'm pretty sure I've been comparing very place I've eaten in New Orleans ","useful":0,"cool":0},"HGKjTXDWJ87JVgIbuNmuiw":{"text":"I booked reservations for this restaurant by recommendation. Definitely and old school loo","useful":0,"cool":0},"rtSPCUryn7mRbDjx3J_RIQ":{"text":"Great Happy Hour on the balcony overlooking Jackson square!  We enjoyed some delicious coc","useful":0,"cool":0},"JGiQQtw0GX89quC7y4V-Nw":{"text":"Wonderful food and ambiance with attentive service. An oasis in the midst of The busy Fren","useful":0,"cool":0},"x6d7wfrfWAxDwex3-VgR7Q":{"text":"Location location location! \nThis place is huge ya'll! You could get lost finding your way","useful":0,"cool":0},"UvD6PMUxIxXifAWPmecOtw":{"text":"We ate here twice when we visited N.O. last month.   First time with two other grown-ups, ","useful":0,"cool":0},"GZezAWX1sHrAPOXC0IJ9PA":{"text":"Wonderful Breakfast experience! Exceptional atmosphere coupled with Tremendous Service and","useful":0,"cool":0},"Qilv_oFFZ-yXCGhTRnjtDw":{"text":"The place itself is awesome alone. However, the service is the main reason I will be comin","useful":0,"cool":0},"kJDLi5pW6ndDQtLaNkVGeQ":{"text":"Came here for a private party on the 2nd floor during their soft opening and was probably ","useful":1,"cool":0},"6aHMebCg9fpBzS7tMyQaew":{"text":"Two stars just because I'm feeling nice. Let's begin with the positive shall we?\n\nThe Posi","useful":1,"cool":0},"rim4VPvj33X4CpcJYgjg7A":{"text":"Sat on the balcony with an amazing view. Had the Demi royale appetizer nearly orgasmic. Th","useful":1,"cool":0},"4AzefWJdGOQDDOT6Jwu_pg":{"text":"Tableau is now one of my favorites in the Quarter.  We had dined here on two previous visi","useful":0,"cool":0},"w3kAhbuUDHTenOCvx_OMDA":{"text":"In a word.....RUDE!\nMy husband and I live in the Marigny and this was our second visit. It","useful":3,"cool":0},"kHQakX7BV7SObPlet0FfFA":{"text":"I totally recommend this place for drinks with friends or business associates. Wine list w","useful":0,"cool":0},"VlaRthTj7yLG0loT52SyaA":{"text":"Had an excellent lunch here starting off with the Shrimp Remoulade and then having the Ste","useful":0,"cool":0},"a9kubbCewXMVYhEZnQibVg":{"text":"We came for the view and stayed for the great atmosphere, cocktails and small plates. The ","useful":0,"cool":0},"CHGlQ2fXx1mQ2ggz3mcVcQ":{"text":"I went to this restaurant for dinner. I sat on the balcony and had a beautiful view of Jac","useful":0,"cool":0},"vVoYAI1InpjCUNAzOuQQcQ":{"text":"The overall look of this restaurant is very pleasant and impressive. The dining room looks","useful":0,"cool":0},"XlY69ByOisPGZJ6sRPyN4A":{"text":"Would have rather been seated downstairs, but as it turned out upstairs bar was happening,","useful":0,"cool":0},"KUGBi4B63pSPtM4JPHvFLQ":{"text":"Had the Demi Royals seafood apps which was delightful.  Dip the bread in the truffle vineg","useful":2,"cool":0},"xP5qyGIxW0HGeSf4h_PrgQ":{"text":"Fine dining that won't break the bank.. \nCame here for my birthday dinner with two other p","useful":1,"cool":0},"hvCTtZcozLj-SbBubrWN1Q":{"text":"We loved it!! My wife had the lamb and I had the duck. It was excellent food! They gentlem","useful":1,"cool":1},"EZ8so5_KipjE_Y91QwkahQ":{"text":"Had a dinner on the balcony while on a work trip this week - everything was perfect.  The ","useful":0,"cool":0},"FDNbegWCgIvod3mkD9iOIg":{"text":"Food was fine. Rest of experience unimpressive. \n\nTook 30+ minutes of waiting to seat a ra","useful":1,"cool":1},"QBVZwFaO-M1iCX6zEKtsBA":{"text":"Have been a huge fan since the first time some friends and I decided to try this place for","useful":1,"cool":1},"I-83RdoXKm9TeuF9y2d23A":{"text":"Tableau is a must while in New Orleans. The venue has a beautiful view of Jackson Square i","useful":0,"cool":0},"1fG6-kdkZ61gsU60u29TOw":{"text":"This place gets 3 stars mostly because we had one dish that was pretty good and good servi","useful":0,"cool":0},"YFfuSWS6sHvz8nXykHCMxA":{"text":"I finally went in here, after urging  from my Wife, Lali, who has had lunch here several t","useful":2,"cool":0},"0Wjub_WQ6X2nG1SiztNBaQ":{"text":"I chose Tableau figuring that once they had their act together, it would be  a tough table","useful":0,"cool":0},"xoyDYS21mWclwuhCNBKtKw":{"text":"This was the absolute worst dining experience of my life. The only reason I gave them a st","useful":1,"cool":0},"lKhd45arde87FM-I0mTW0g":{"text":"Had dinner on a Saturday before a play at Le Petite Theatre with friends. First time to tr","useful":0,"cool":0},"B_MbzT8Snr2rDPTY5btrKQ":{"text":"Ate here tonight and absolutely loved it!  We sat on the balcony and you can't beat the vi","useful":0,"cool":0},"HOigce7vXavdydYRTA-t4Q":{"text":"It was very average food. Sitting upstairs on the balcony is awesome but everything else w","useful":1,"cool":0},"K197PTVQlRp8knucSOcB8w":{"text":"We live locally and walk by here all the time.  It's usually crowded on the weekends and w","useful":0,"cool":0},"lTGcmBdZqNZrp6hnTqTiQA":{"text":"Horrible food and bad experience. We were very disappointed in the service and especially ","useful":0,"cool":0},"dvWMx2AZBJ7SF34ETBmz_A":{"text":"Excellent light lunch of Gulf Fish with salad. Nice place, friendly staff. Looking forward","useful":4,"cool":2},"3aRZ_mIYlOFV_ZxXgPbVWg":{"text":"Hanging at the bar .....\nDevon the bartender She is amazing !\nGreat laugh .....contagious ","useful":0,"cool":0},"W1BkCRRJ2xG0gwxYIf-qNg":{"text":"We ate out in the balcony which overlooks Jackson Square.  The dinner was great and the se","useful":0,"cool":0},"qz0VlmlW_nMCGxubd5WioQ":{"text":"The wait staff was pleasant, but unfortunately the service was very slow. The creamed spin","useful":0,"cool":0},"oyDapdQz93fLmnwJlopNyA":{"text":"My wife and I came here on the recommendation of our hotel... Great decision!\n\nI had the f","useful":0,"cool":0},"3spSgzxrqoxzj-2fJa60zQ":{"text":"The wife and I popped in without a reservation after an evening carriage ride at Jackson S","useful":0,"cool":0},"FwGtGwxTSjoUbZGbShfi-A":{"text":"This place is fantastic! Service is wonderful and the food is...well, you'll want to lick ","useful":1,"cool":1},"XgKwu-_nHHMMjXJchkk4ZQ":{"text":"Love Love this place. The servers (Jeremy and Crystal) were great! Nice to see the manager","useful":0,"cool":0},"xlDislRL_kqwtqQMXNrnCA":{"text":"We just had a beautiful brunch here, staff is amazing, I made reservation for our honeymoo","useful":0,"cool":0},"Ya78rCFpaUwqkFcFkN7rKw":{"text":"Made reservations to go here on my birthday and I'm glad I did. The service was wonderful,","useful":0,"cool":0},"S-x_pBSrKMh-uGXweKdWiw":{"text":"Great creme brûlée! Disappointed in french onion soyp..maybe a bad night but no baked melt","useful":0,"cool":0},"PFNkaEYkvZ5gPhIE2hQOHA":{"text":"Awful. Awful. They took some red sauce and poured it over rice and boiled shrimp that had ","useful":0,"cool":0},"RvJRPMnd9VMdm6Ddi2C9og":{"text":"Fantastic!  The food is divine!  Our service was decent--although there were two other gro","useful":0,"cool":0},"tZzu3iyJ4XqygRi9rURVEg":{"text":"THE BEST meal I had on this trip! BBQ shrimp & chevre grits.  It was all I could do not to","useful":0,"cool":0},"fMihy751IRkG-qKl2Zbgdg":{"text":"Our experience was super top notch!!! From the moment we arrived to our exit the staff was","useful":0,"cool":0},"XECSXLEymEJ_DBxKowmL6A":{"text":"Great view from the balcony. The staff took care of us from the food selections to escorti","useful":0,"cool":0},"A6X4_qIpna1SDUAiMsOw7Q":{"text":"Great place in the French quarter. We had po boys, wedge salads, shrimp and grits, chicken","useful":0,"cool":0},"Juisuh9geLrTrAz-f1UQKg":{"text":"Gumbo is inedible, BBQ shrimp and grits are really good, dessert chocolate cake was super ","useful":0,"cool":0},"nmVVgu-zfyC0FCY0Gvqq7g":{"text":"What a gorgeous display of New Orleans cuisine in a lovely historical setting. I feel so f","useful":0,"cool":0},"T0xc3j4jBt8Bcm26QIbovA":{"text":"On a beautiful windy/ sunny day, my mom and I decided to bask in the balcony of this lovel","useful":0,"cool":0},"ttcuvX3SBWEVA8rQw0h2ng":{"text":"Had lunch here today. Got seated at a table upstairs. It was so filthy we almost left. Wai","useful":0,"cool":0},"tZFOMLkbN0xYFH30FZcF5A":{"text":"This place is great. Their atmosphere is beautiful (best place to sit is out in the courty","useful":0,"cool":0},"2u099Z9MvtmmzM9hYUS9fg":{"text":"Great experience! Food quality and customer service were on point! Had the Fried Oysters, ","useful":0,"cool":0},"RGa7-BgH0DeNM8Nm_TEVzQ":{"text":"Absolutely AMAZING food...I'm actually going to say that I had one of the best meals if my","useful":0,"cool":0},"nuuPLZMW8kwUp_Q8PMrqxg":{"text":"We stopped in here for lunch for my birthday last Friday and it was absolutely delicious! ","useful":0,"cool":0},"vyyPJu2V1OOjMAV0VGs7kw":{"text":"Definitely a happy hour stop. 2-5 half price wine and beer. Also cocktails reduced. Get th","useful":0,"cool":0},"3B-zBfYYKatneIJ_-gJfOQ":{"text":"We started with the Grand Royale-- I would recommend that for 4-6 people we had 8 people..","useful":0,"cool":0},"usu6ekVil3zvl9REj4kUsA":{"text":"This is one of the must-go places. This is the type of restaurant that you come to NOLA fo","useful":0,"cool":0},"fSmEbPsdG_KaSEYl2IxTAw":{"text":"This was our splurge diner as the menu was a little pricey.  I recommend making reservatio","useful":0,"cool":0},"0qrit8r5wOGtu-t03waYqw":{"text":"I eat at tableau often and typically order from the bar. Last night, a friend and I stoppe","useful":0,"cool":0},"QEkVvnLojqNta8lJqGGTzQ":{"text":"Stumbled in this restaurant as I was looking for a nice dinner. I started off with the Gum","useful":0,"cool":0},"CLUk_71I2FVk3ynaDEq4ug":{"text":"I love Tableau! I love it so much!!! We enjoyed dinner on the balcony on a beautiful eveni","useful":0,"cool":0},"2jBJpuF2S_FoJPK_6Xv87w":{"text":"The food at this pace is amazing good! The atmosphere is superb! The service is slow! :-( ","useful":0,"cool":0},"2kO_SO74Di97038X5okQ1w":{"text":"Stumbled upon this place for Saturday brunch as a recommendation from our hotel concierge.","useful":2,"cool":2},"PoLg14-9xB0Cc356xv1s_A":{"text":"We ate here on a visit to New Orleans. The service was great and we were seated right away","useful":1,"cool":0},"BymnoL6wapqTdslKNsMtWQ":{"text":"Enjoyed a wonderful Sunday brunch here of a crab and tomato quiche and a light and crisp m","useful":0,"cool":0},"wwKNajNaxlx_wi7LFL2L2w":{"text":"Had dinner there last night after going to gallery opening. We are locals. First time ther","useful":0,"cool":0},"k3vL2iskSNWi1em0UBn1SQ":{"text":"Great restaurant near St. Louis Cathedral.  The staff was super friendly.  I had the Turtl","useful":0,"cool":0},"YlYZVJd8w161-Lo3su7z9A":{"text":"Things I ate and how I felt about them:\n\nFree bread: Ours was cold in the middle! We asked","useful":0,"cool":0},"LCG3pR_hKGXoTluNZrOmgA":{"text":"Wonderful view of the square From the balcony. We hit this place for drinks during their h","useful":0,"cool":0},"q13HjBdYha4e55Kt_FQjWw":{"text":"Had a delicious meal here!\nOysters Maison was perfect and sauce amazing.\nTournedos foie gr","useful":0,"cool":0},"A1tnzAuKTwDnfWelcxNBqw":{"text":"I went with 20 friends since they were able to accommodate our very last minute reservatio","useful":0,"cool":0},"VEFqmYUc_MD-cuRp8ywwpw":{"text":"Hanging at the bar .....\nDevon the bartender is amazing !\nGreat laugh .....contagious\nco","useful":0,"cool":0},"fzHwy0SFTQQmyHWJqUyodg":{"text":"Great spot with beautiful views of Jackson Square from the balcony.  Maison salad with poa","useful":0,"cool":0},"YwXTd4h7bGw6KIfHnPqubw":{"text":"My friend and I dined here on 3/8/16 and absolutely loved it.  The food and wait staff wer","useful":0,"cool":0},"eta_QpG4koAhj7noPgb4TQ":{"text":"Brunch buzz kill. Waited for a drink for a long time, great atmosphere though . Service ne","useful":0,"cool":0},"N9ggkxSih1uSHgyjgiFx_Q":{"text":"I really wanted to give them more than 3 stars but as I sit here with an empty wine glass ","useful":0,"cool":0},"M5hsiorjReGHqbFpVsfW6A":{"text":"Beautiful restaurant. I had the lavender lemonade and it was delicious and dreamy. My boyf","useful":0,"cool":0},"p__ycxYSj5lKWZ1hkRwh_g":{"text":"The food was excellent however service was lackluster and the hostess, Laura was so totall","useful":1,"cool":0},"2l_38Q9oJNSzqH4u6-VBew":{"text":"although we were hopeful for a fun and enjoyable dining experience, the service was beyond","useful":0,"cool":0},"Php7rhV0hMVgkpWgtDgVgg":{"text":"the shrimp and grits are of exeptonal quality and pair quite nicely with the plethora of d","useful":0,"cool":0},"6p3jiApkI5bpSFBmm40iLw":{"text":"Food was good, typical higher end New Orleans restaurant. Service was non engaging and it ","useful":1,"cool":0},"Sp2vfph6K-0vsSloYAzqlQ":{"text":"We went to a neighboring fine restaurant without a reservation and were turned away. When ","useful":1,"cool":0},"64BiKLMDOM-7Hm04aFmGiQ":{"text":"Sat on the terrace. Place is quite busy and loud.  Nice drinks and service was superb and ","useful":0,"cool":0},"qhy6pw3m9atCmrtCWquK_g":{"text":"Great service and delicious food. I ordered the recommended steak frites and a refreshing ","useful":0,"cool":0},"DvXhpIaDGbrbDmO481j4xQ":{"text":"This place. First of all, the atmosphere and vibe is absolutely perfect. Could not possibl","useful":0,"cool":0},"IwRPTOLPDSeetbtaatZwfA":{"text":"It was a rainy Saturday afternoon popped in to warm up, sat in the upstairs bar during hap","useful":0,"cool":0},"FM2ckswXpzOjWQ4NWg-C9Q":{"text":"Nice place. Mojitos pretty good. Steak was great.","useful":0,"cool":0},"ERwE-2HW1qotN61DB-Galg":{"text":"Super service.  I called with only a few days notice and they accomodated my party.  As th","useful":1,"cool":0},"kcAEnbCRrNN--s0ktAtv1Q":{"text":"Large two levels restaurant, with bar on each levels. The best is to dine on the second fl","useful":1,"cool":1},"iNqUpjzg6NFTXWRr_w7D2Q":{"text":"Wir hatten hier im Rahmen einer größeren Veranstaltung ein Essen mit Partnern. Ich muss sa","useful":0,"cool":0},"G9IS76PjUBQ6bW_92nkAmQ":{"text":"Holy cow! Had the most impressive lunch experience with my girlfriend at Tableau during th","useful":0,"cool":0},"j0iGLo_GLR1P3Fh-49heSw":{"text":"Fancy pants... I guess.\n\nThe shrimp and grits weren't the best, all of the flavors seemed ","useful":1,"cool":0},"bH_Yi_eha6XUQbavaqh_DQ":{"text":"Not as good as Muriel's, but still very good food in a good location. It is on the fancy s","useful":0,"cool":0},"CSJPajK-Ap7CntI-QRKzLA":{"text":"Tableau is a fantastic New Orleans Eatery. We were fortunate to be seated near the kitchen","useful":0,"cool":0},"WLyPJngPiH8tn2QvCE1o9w":{"text":"Every Bite a Taste Bud Treat - My boyfriend and I went here based on a recommendation of t","useful":0,"cool":0},"X0ogaD1XrS5jpUMmQNFiLA":{"text":"Service was good and the food was tasty, but the food came to our table cold and my friend","useful":0,"cool":0},"CcwkXIfpH22mJFXvUIxh8Q":{"text":"We had a mini family vacation & my Husband & I had eaten here before. Of course when you r","useful":0,"cool":0},"oYIskxWHz5V_-f-L5dViiA":{"text":"I don't know how Ive always missed this spot with how often I frequent the quarter. If the","useful":0,"cool":0},"gyJO1p0IIwqhQ3J9F-Q6uQ":{"text":"Just had an excellent lunch experience here. Their shrimp and grits are perhaps the ultima","useful":0,"cool":0},"d8mS_F3Qs5hBRC1Iq8MDDA":{"text":"Great little find across from the square in the French quarter. Huge wine selection. They ","useful":0,"cool":0},"euqCM_RGxl8v3fuBSBKChQ":{"text":"Sunday brunch.  Scotch eggs.  Quiche.  Three piece Jazz band.   Outstanding wait staff.  B","useful":0,"cool":0},"xRrZlVTRSrC9fc2zREBong":{"text":"Horrible experience.  Truffle crab legs tasted like small crab legs swimming in Italian dr","useful":0,"cool":0},"qTC-a4MMyg70a3lYq1J3Iw":{"text":"AMAZING!!! \nThe best cremeburlee I had and even in France. My waiter was very friendly and","useful":0,"cool":0},"JBgUmbq0EhX5b0HJ89eKKQ":{"text":"Excellent food for a good price, fun live band walking around, and a great location. It's ","useful":0,"cool":0},"bfcTpu0GRE7k5BkfFelamQ":{"text":"Tableau is a Brennan's restaurant and more than delivers on quality food and service. The ","useful":0,"cool":0},"62mVjtngOiZ4_koO3clLdw":{"text":"My friend and I visited the French Quarter for a getaway full of enthusiasm. As we venture","useful":3,"cool":1},"cIO5llviQIcmd9LAPJ895Q":{"text":"Phenomenal food and service. Lovely inside. The redfish entree and brown butter gnocchi we","useful":0,"cool":0},"0OYcGQImP2gcvcKE96MQfw":{"text":"We searched for a long time for where to eat during our one day in New Orleans before gett","useful":2,"cool":0},"IucKA2aagoVgI6aFMrXljA":{"text":"Nice professional staff, balcony has awesome view - they were not serving on balcony so we","useful":0,"cool":0},"-hAjFJTr6j9u2lphz9nX0w":{"text":"My husband and I had a lovely meal on the balcony at Tableau.  The whole restaurant is nic","useful":0,"cool":0},"thcNEiYPUe51_Utt709TlA":{"text":"Had a bachelor party here(mine) for 20 guys. We got the private room overlooking the court","useful":0,"cool":0},"CGyZypY22oED42myuS1wug":{"text":"Way more upscale then we were expecting based on the menu prices. I can only assume they'r","useful":1,"cool":0},"CiTMpkvOf1hFOD6BFnkDKA":{"text":"I SO BADLY wanted to like Tableau. I've been eying it for a while -- I really love gnocchi","useful":0,"cool":1},"1oNuqVx5fV8EPUYfQcEcgg":{"text":"Tableau may be a newcomer to Jackson Square but the Brennan family's attention to detail i","useful":1,"cool":1},"YLDdjhHgr8Xad2vT97v83g":{"text":"I had Gulf Fish. It was unnecessarily breaded and finished with a sweet something that rui","useful":0,"cool":0},"YLsZ0fzy3SULPmRxie8uCw":{"text":"This was our first visit to Tableau.  We were seated upstairs,  at an inside table, which ","useful":0,"cool":0},"xAtdlN1JNRB9mbT_J3YzpA":{"text":"Nicholas Payton playing on a Thursday night with a quartet of the city's best, delicious s","useful":0,"cool":0},"EJNUbj_5UZYRIj3tlZkxuA":{"text":"A recent addition to the French Quarter dining options, this upper mid market entry from t","useful":0,"cool":0},"9eqJnzk_mH8C0_Qrca49sg":{"text":"Service was so slow, we sat on the balcony and thought our waiter had forgotten about us. ","useful":0,"cool":0},"PP2eDO6UhirhE82_596e_g":{"text":"Great place for a wedding reception/dinner! I am bit late with this post, but we recently ","useful":1,"cool":0},"KRlGWYLj6GwsWA9QrktHXA":{"text":"This is a very nice restaurant with excellent food, but the service left a little more to ","useful":1,"cool":0},"ejTGrko4XF4o38zKLd8bNA":{"text":"Tableau has a nice balcony area where you can sit and get a great view of New Orleans! I g","useful":2,"cool":2},"FLibVpwxz3rrcsObSYX5lg":{"text":"The atmosphere was great! The Jazz music was a little loud but outside seating is an optio","useful":0,"cool":0},"8ATDYROlJ8Zk6q274K8o3g":{"text":"Nice building, with three floors. First floor is airy and nice, but there was a parade stu","useful":0,"cool":0},"41pBQkcbyI-nzy1MJzNgNw":{"text":"Very dissapointing dining experience. Service was poor and managment inexperienced and ina","useful":2,"cool":0},"qSYR8ldylLsusvCW4fy-4Q":{"text":"FAAAAABULOUSSS!! My husband & I are foodies & eat out way more than we should. Always been","useful":0,"cool":0},"MVQTL8FyZR5_qhCMBi363g":{"text":"Ate here with a group of 5 on a business trip. Food was okay. Had a filet mignon which lef","useful":0,"cool":0},"W7TpFqgISL8e89-DvL_z_Q":{"text":"Perfect happy hour spot. Make reservations for the balcony. We had the crawfish au gratin ","useful":0,"cool":0},"DgQiihxvtv5atfBqJRYrMQ":{"text":"Spent a week in New Orleans for a family get together(14 of us). We booked a private room ","useful":0,"cool":0},"74deW1BvlTxV779z5IxhJQ":{"text":"Elegant looking and quiet, this restaurant features extremely slow service and basically i","useful":0,"cool":0},"55cG7CK-okoHE_8FrkQt9g":{"text":"There was a bit of a wait for a table but none for the bar so we headed upstairs, ordered ","useful":0,"cool":0},"T4fGLzEX10gO5OBMePebng":{"text":"We arrived at closing time, they escorted us in and gave us the best food we had in new or","useful":0,"cool":0},"IdwdCiRiBsec74GJzM4fVA":{"text":"We came here to sit on the balcony and for happy hour (daily 2 to 6 pm).  We ordered happy","useful":1,"cool":0},"6fAJdyJV2iOCMtx6NQK93w":{"text":"In January my niece and her fiancé were married in New Orleans.  On Friday before the wedd","useful":2,"cool":0},"MXKDG6IF9EEjrJKzjLq_Zg":{"text":"I was expecting this place to be highly priced because it was a Brennan restaurant and bec","useful":0,"cool":0},"pO43mcg5lb0Ul_iCRyKBYQ":{"text":"I would not go here if you need to leave at a set time. We had about 70 minutes for our me","useful":1,"cool":0},"R_RWmoR2VAOLxxuCvLUvmA":{"text":"Yummmmmm. Food was delicious. Staff was so sweet and kind. The live music really gave it t","useful":0,"cool":0},"bHoCaKfGd2kGVcwS6QyISw":{"text":"Amazing. I'm sitting here eating delicious tomato, crab, shrimp and asparagus salad drizzl","useful":0,"cool":0},"S3iWDdOOJZPqTFQY1lEH3w":{"text":"I understand that it was Christmas Eve, but......we were seated at 6:30 our food order was","useful":1,"cool":2},"EYAKOuDdcvgMhZ-fZv4Xyw":{"text":"I do not like this place very much. It may be a good place for view of the Jackson square ","useful":0,"cool":0},"stmhXstPejGzNZ5ObbXWDg":{"text":"Too pricey. Food was ok. Service was wonderful. If you are looking for a nice place to cel","useful":0,"cool":0},"d3RFDKnKXa2SmpVJhKaBCA":{"text":"We really enjoyed our lunch. We ate outside on the balcony overlooking Jackson square \nThe","useful":0,"cool":0},"YutNi7hn4I49HZquAsnAUg":{"text":"Fabulous ambiance, large three story restaurant with many seating options we sat on the ba","useful":0,"cool":0},"Cj7uQbddQKw2ybW8Mb02mA":{"text":"Stopped in for pre-dinner cocktails and a snack. Lovely bar, great service. Enjoyed the Fr","useful":0,"cool":0},"YD574ydmi2liYyHbEY9anQ":{"text":"Tableau is a tough review for me for a few reasons.\n\nFirst of all, I really like the decor","useful":9,"cool":2},"8SqQsGveE7NrT6dxdjJMQA":{"text":"I'll start with the positive: the food and atmosphere. Both are great. The Just as Well co","useful":1,"cool":1},"SuDga9sThbSU_bpdNds8lA":{"text":"Very disappointed. Went there for my birthday with family, party of 4 seated at 2-top, we ","useful":1,"cool":0},"293BokDvaE7cdFQEaEcZZA":{"text":"Fine food and professional staff. French ambiance was very pleasant. We loved the Filet Mi","useful":1,"cool":0},"0aJEnhD20bSHdgjazY6eBw":{"text":"A very busy Sunday in New Orleans. We walked in around 1pm, and were lucky to snag a table","useful":0,"cool":0},"JY1VA8TmMCLTCZS66aECdg":{"text":"Beautiful balcony views, refreshing drinks, great food. And the wait staff is AMAZING.  If","useful":0,"cool":0},"QRua0pvUuhhfg6Nyk08IFw":{"text":"What a let down! If you want 4 star dining there are plenty of other choices with competen","useful":1,"cool":0},"uRT4TWlyx5OBd7jQuigklQ":{"text":"I highly recommend this place. Great view with a vibrant atmosphere.  Delicious food and f","useful":0,"cool":0},"XCtDPxMz5J4AeBFwZxzswg":{"text":"Yes! Yes to everything here. Redfish bienville. Turtle soup. Crime brûlée. Cafe au lait po","useful":0,"cool":0},"-xtKcsQ_3DxMDnjmg3hCYg":{"text":"I had a great time here as a tourist. I'm sure it's overpriced in locals' eyes, but the vi","useful":0,"cool":0},"gkJ76k6QYk80E35XSPBrcw":{"text":"Had decent cocktails & yummy appetizers in the balcony. Great view overlooking Jackson squ","useful":0,"cool":0},"B05VKbh1oXbGM_42d6mfSw":{"text":"Had 2016 Thanksgiving dinner here and left a little hungry--that in itself is a fail. I ha","useful":0,"cool":0},"W2WJOmQQA_IbeFVuFLw-og":{"text":"This place screams everything that is New Orleans. Live jazz in the main dining area, balc","useful":0,"cool":0},"KdWP_BJ5rT0xFIgjRLXqCw":{"text":"Nice place a little on the fancier side for brunch.  Very limited menu choices. I enjoyed ","useful":0,"cool":0},"5DX6zbZyoAY4klEeY-olYw":{"text":"Just finished our thanksgiving meal here- it was terrible. We enjoyed thanksgiving at tabl","useful":0,"cool":0},"04zfRcxuZ9speLmSjAbuwQ":{"text":"Ate here on a recent trip to NOLA and loved every bit. The food was great, the drinks even","useful":0,"cool":0},"djNgiTjnY3cl8HSW4Etlfg":{"text":"Due to the majority of the reviews being positive, I had high hopes for this place.  It wa","useful":1,"cool":0},"iMdqHxboZw9Y34ZJUO0hDA":{"text":"We had a wonderful evening here. I had the lamb and it was delicious. In fact, everything ","useful":0,"cool":0},"QrhQNpwVa04qJ1an6saUMA":{"text":"Tableau has never disappointed. Visit after visit, the restaurant is just amazing.\n\nLast w","useful":1,"cool":1},"-okyyjEVl8HNpbqZ5Pksbw":{"text":"Went for Valentine's Day... No reservations but we were seated upstairs right away...\n\nCom","useful":0,"cool":0},"t7VFf7nZogxpOWKQw0TPfg":{"text":"Went for a work dinner and it was fabulous!! There were friendly staff and it is a beautif","useful":0,"cool":0},"Dx4pom9JJVKW04mzQgupIw":{"text":"Beautiful interior, great location at the corner of Jackson Square.  Great cocktails if no","useful":1,"cool":0},"IYVGeNj040aCPFQ-OBNItg":{"text":"We had a great Sunday brunch here a few weeks back and am just now getting around to revie","useful":0,"cool":0},"IWxk2zl0BPuBrUspYtKGlw":{"text":"This place is so awesome. The decor is elegant and the food is so delicious. Our waiters, ","useful":1,"cool":1},"wkRiKLTrlBuN36GnMywWLw":{"text":"Amazing service and food here.  We managed to grab one of the two coveted corner balcony s","useful":0,"cool":0},"rcopjHTz9BOqdzQ1Om-egw":{"text":"Four words: Crab claws, Truffle oil. Basically that's all you need to know. Oh, yes, it is","useful":1,"cool":2},"4v5w-lXsflNFxPMGsyxusg":{"text":"This was our 2nd time to eat at Tableau while visiting New Orleans and once again it was a","useful":0,"cool":0},"HQXphAKXcIquHC2tZJ2jTg":{"text":"Wow!! I will be coming here every time I go to NOLA as well as telling anyone I know who i","useful":0,"cool":0},"kVHyrGXHCSmCEK2FSYFmsw":{"text":"I came here last night for a work dinner with a large party and was blown away! I have cel","useful":1,"cool":0},"-h_UaC3jB4N0QJXcpjkJww":{"text":"Had brunch there this morning. Beautiful dining room, good service, great live jazz band, ","useful":0,"cool":0},"qN8uGLErstG8USxREFJclA":{"text":"We had a group of 19 people and the service was very accommodating. We had our own room up","useful":0,"cool":0},"2DN2gGyeGgAx_D2N7nmUDg":{"text":"In my opinion, the sign of a good restaurant is quality food, prepared with innovation, cr","useful":0,"cool":0},"bXTd9S93h3Ebtgjhw0mxGw":{"text":"This place is located in Jackson Square. They have inside and upstairs balcony seating. It","useful":0,"cool":0},"svpesgRaV_HOAwkliX41uQ":{"text":"We came in too late to sit on the balcony, but still had a great experience. Loved the fan","useful":0,"cool":0},"aRW6e8cJ4fkrVNXElfIhcg":{"text":"Fantastic!!! One of the best filets I've ever had in my life. And the rest of our meal and","useful":0,"cool":0},"X_ce_YpzYhif0yLq6fcVtg":{"text":"Food was outstanding. Server was very friendly. We sat upstairs on the balcony overlooking","useful":0,"cool":0},"wJHf5omWOIHrUojn4Efccw":{"text":"Dinner was excellent and the wine list was great as well. The double cut lamb chops were e","useful":0,"cool":0},"J1qATBAlAZIHUTQtUoGmvQ":{"text":"Stumbled upon this and what a delight!  The food was alright. Our soups were much better t","useful":0,"cool":0},"hDWESYgJD8WXXcRqxsjPqw":{"text":"Restaurant was very classy, but the upstairs balcony was cozy and intimate. Try to get the","useful":0,"cool":0},"0PMGK_gqhoekkHFrGVNxXA":{"text":"I came here with a friend Friday for apps and drinks.  We got the gnocchi and the truffle ","useful":6,"cool":4},"psOkbd3MskFzABp-hjU4RQ":{"text":"The decor was for the holidays the ambience inciting and warm the staff impeccable in the ","useful":0,"cool":0},"Uv2Y82v-PqXFrjPDZuMQEg":{"text":"We ate here on 5/29/14 for dinner. Given the spotty reviews, I will admit, it wouldn't be ","useful":0,"cool":0},"F4XF54lLNrU0IWGEr7Y_Qg":{"text":"We went here for drinks and dessert and both were divine!!! The upstairs bar is my favorit","useful":1,"cool":0},"MzNDWLmdlbif6G5prxM8QQ":{"text":"The service was awesome! The items on the menu are defiantly not the norm; I prefer Dickie","useful":0,"cool":0},"RFEIfc7o8Vj-yLaPNBccsg":{"text":"I had 8 pm reservation and was seated inside, when asked for another table on balocy it wa","useful":0,"cool":0},"Fs9WRlA48uDSF6r0I4cnuA":{"text":"We were here with a group for a function and were treated very well. Located in the french","useful":0,"cool":0},"3zdvCoN7eS5Px17L11KJuA":{"text":"Amazing food, excelent service, elegant atmosphere, decent price. Definitively worth recom","useful":0,"cool":0},"0_I94Krf7KqLIUKkPqvXPQ":{"text":"Tableau never disappoints. Four fantastic dishes. Fried Oysters Maison, shrimp remoulade b","useful":0,"cool":0},"g8UBmus27E_d8AzErGxDCQ":{"text":"Servers were friendly but it felt like everything took so long to get to the table.  I ord","useful":0,"cool":0},"Q7JZIlzgls-eUHMuz9iTyA":{"text":"We had a lovely meal for 7 at Tableau on recent trip to NOLA.  The restaurant was beautifu","useful":0,"cool":0},"Y0bpkUV69NGC-sUC_TLlQQ":{"text":"Food was delicious and the staff was awesome!! Outstanding servers, Marquia and Catherine ","useful":0,"cool":0},"Z18gydYeTlLM2lRzqodiPQ":{"text":"I only got to enjoy the Gulf Shrimp Remoulade and a drink here. The service was great and ","useful":1,"cool":1},"Av5blhtZGLleT4cizG_SKA":{"text":"We had about as good a dining experience as one could have at Tableau. The service was imp","useful":0,"cool":0},"G3Y5wYRYbM4YEA5tK6lyhQ":{"text":"The nicest staff, delicious drinks and dessert (we did not eat dinner here), and a great v","useful":0,"cool":0},"9gYjCBWTriFpH39_WEKTog":{"text":"First time in New Orleans and my mother and I were recommended this restaurant by our conc","useful":0,"cool":0},"1bV5IJ2Ywjba4XFdDLiEIw":{"text":"My husband and I stopped by here for dinner and it was WAY beyond our expectations.  He ha","useful":0,"cool":0},"Mm2sfE9WaKxuubyPUR5zKg":{"text":"I came to New Orleans with a few friends to have a nice, fun, long weekend which was unfor","useful":0,"cool":0},"nQMF6fMFSBg-crnmjDFZ-Q":{"text":"So, a local recommended which is always a good sign. The balcony seating overlooking Jacks","useful":0,"cool":0},"dVpdZ8lFaPgIFeuaWoTKjg":{"text":"Great food average  service freindly host.  My wife loved the  upstairs  patio dining atmo","useful":0,"cool":0},"wvhcGfmFFHF0BRGKHC2s_Q":{"text":"Could have been better. The restaurant seemed very short-handed and as attentive as our se","useful":0,"cool":0},"80Aj7T7Wh5P-d8bN9hqqdw":{"text":"went to the bar Ms Lisa was excellent kept my coffee warm and steamed my milk \nSean the wa","useful":1,"cool":0},"WnESu6stapLBG4SXU1eX4Q":{"text":"We loved Tableau, but do make a reservation. We arrived and were seated promptly after the","useful":0,"cool":0},"XEa3NW5gRqadaCxLybO8vg":{"text":"Wonderful! Simply exquisite! If you gave this place a try when it first opened - and were ","useful":0,"cool":0},"v2zli6CvDzJMsuHQcDjHZQ":{"text":"The four stars is mainly for the price. Little much for the plates offered. We ordered a s","useful":0,"cool":0},"76WMbclYD_-MXEaO_2uFJQ":{"text":"True disappoint. My birthday, requested balcony. Cocktails slow, had to request silverware","useful":1,"cool":0},"yRw7nSAeY3JTKGS7qrD9nQ":{"text":"Went for dinner with coworkers. We were in town for a conference and some colleagues recom","useful":0,"cool":0},"kFwPNa_HVVjep8GigxU3TA":{"text":"One of the top five best restaurants in the French Quarter. We had a late reservation and ","useful":0,"cool":0},"BYVj4IxgBd24XH5PFGxjOQ":{"text":"My new go to in New Orleans! The The Redfish was delicious! Hats off to the pastry chef be","useful":0,"cool":0},"_h5uJldweVLzwcIpMhMj6g":{"text":"Amazing! Our dinner was nothing short of fabulous. Attentive wait staff who were helpful a","useful":0,"cool":0},"CNPlBjZvEzEcAgBhMSiBZg":{"text":"Tableau is right near Jackson Square with a great view from the balancing. It being a Bren","useful":0,"cool":0},"WTLqboHCBnU4LVHp77qD8g":{"text":"Dined here for my b-day on a friend's recommendation.  Sat outdoors on terrace; nice ambie","useful":1,"cool":0},"86FsvEACnsI-6c_0rMCnTg":{"text":"This restaurant is fabulous. The shrimp and grits were unbelievable! Great service. The vi","useful":0,"cool":0},"uw59s7mQZe1jNJtDX5Bw8Q":{"text":"Exceptional service, great food!!  They've been open about a week, still working out the k","useful":0,"cool":0},"U-ubzOr19-K5OOEmr2zeTQ":{"text":"Simply yummy.  We ate here on Xmas.  The huge restaurant was packed and they did not disap","useful":0,"cool":0},"lwZPmbAjzU6xrS_x45uIkg":{"text":"The staff and atmosphere will give the impression of fine dining, in a casual way. Which i","useful":0,"cool":0},"lFR8p3X0y78MwearwCCCkw":{"text":"We had such a nice time that we came back for a second visit in our 4 day anniversary trip","useful":0,"cool":0},"6rzGekIKB5JB9MJh68gVrA":{"text":"Steak was excellent.  Accompaniments of a small dish of mushrooms with two small shrimp fo","useful":2,"cool":0},"1ocP1XwNFb2DD4KaOnh__Q":{"text":"With several visits to the Brennan's on Royal street, I was really looking forward to  a d","useful":0,"cool":0},"o5q9-S0iqy4tXO0SZI6Zzw":{"text":"Full disclosure: Sat on the antiques balcony and drank bottomless mimosas on a beautiful d","useful":0,"cool":0},"fLTKvyX4TXudUDN8uVKQUw":{"text":"Recommended to by two different people who live in Houston but maintain residences in NOLA","useful":0,"cool":0},"t4HgZFW2AB_OqKjqtRdSWw":{"text":"Was so excited when they finally opened, i have been in for lunch quite a few times! It wa","useful":0,"cool":0},"w9iE_uMTzd5VnTKG8Eo20w":{"text":"Happy hour was less than happy. We wanted to sit on the lovely balcony and waited about 20","useful":0,"cool":0},"yFZQHtQMBjNz3lVjNyNRzg":{"text":"I was super excited to have a few glasses of wine on the balcony at Tableau after reading ","useful":0,"cool":0},"8CVst0IiQ0LmeYIT7Y8AOg":{"text":"Went here to have a drink and relax, friendliest upstairs bartender (Zoe) wowed us with he","useful":0,"cool":0},"4Bm7LkmbiWf7yVOATMyLcg":{"text":"Had a quick lunch here.\nFirst of all the staff - wonderful! Very nice dining room.\nThe tur","useful":0,"cool":0},"JqC1sMIVupPy3jBJQjQXlg":{"text":"This is a Brennan family restaurant, culinary tradition in NOLA. First the setting is love","useful":0,"cool":0},"ex80zTMSBXj7RVx9w3bqag":{"text":"With all the choices great restaurants in New Orleans it's very hard to call one out indiv","useful":1,"cool":0},"LiqEzjjFBwqDfDQij1iPzg":{"text":"Had a late Sunday brunch here. The wait was acceptable as we did not have reservations and","useful":0,"cool":0},"SIDhuIWjMcM9dtC421u5OA":{"text":"Food was good especially the desserts! Made the reservations far in advance and was shown ","useful":0,"cool":0},"456gTdJe272N-Ogo-Q6rJQ":{"text":"Came for brunch, the food was fine- but service was terrible. Saw our waiter when we order","useful":0,"cool":0},"PlnLENJKczsidHToDPNsSQ":{"text":"Truly terrible.. Bartender could not figure out how to make a mojto or a bellini martini.\n","useful":0,"cool":0},"Il4R5xI9-5ruPT9i_QR0AQ":{"text":"First off the building and the historical legacy of the area draws you in. But for us, tha","useful":0,"cool":0},"NznYUWNUihDnV7VJ2mumpA":{"text":"We were celebrating my parents 50th wedding anniversary and family reunion. The fooD, serv","useful":0,"cool":0},"66-K7eKm255dEt8m450MRg":{"text":"Fantastic in every respect. The view from the balcony is classic NOLA. Friendly but profes","useful":1,"cool":1},"h-cgWeHggPguG7nal5KiAQ":{"text":"Dazed and Confused! That is how I would describe the service at Tableau. \n\nMy husband and ","useful":0,"cool":0},"HLGUIOd7XS9TRBrXN0kUYg":{"text":"Dinner for 2. I was hopeful for a really good meal. Maybe I was stuck with a bad night ? N","useful":0,"cool":0},"avadMnT8EPokZqG_A3GIag":{"text":"An elegant dining experience. I felt underdressed when I was seated in the main dining roo","useful":0,"cool":0},"YfTZxTuKJ2AChaD5p8vTyw":{"text":"After 5 days in NOLA and lots of \"must go's\" checked off our list, we found the place on a","useful":0,"cool":0},"m5_eDr3Be8jyaDkE5_mdtw":{"text":"Beautiful space! However, the food tasted like something you would eat at home or a friend","useful":4,"cool":0},"ZqG4f6QjR25aP-q35SXP7g":{"text":"In addition to the excellently prepared food and a high quality bartender, we were most im","useful":0,"cool":0},"n0Q1zBP9gDxq3fHOFom4WA":{"text":"Located in part of an old theater, Tableau is lively noisy and old world all at the same t","useful":0,"cool":0},"kzkiIssfjT39LvHl3KpCiw":{"text":"On the last day of our trip in New Orleans, we stopped by Tableau for brunch.  We caught t","useful":0,"cool":0},"DZEJN99vKdbLQ8SmGRlG3Q":{"text":"Jazz brunch was a treat! Bottomless mimosas table side band that plays tunes by request wi","useful":0,"cool":0},"Bn_zNe2LeLZRQCg3TDRN9Q":{"text":"We stopped in the night before Thanksgiving to relax in the bar after a long day of walkin","useful":0,"cool":0},"CmSuUtv1gg3wU6J-H7B1Qw":{"text":"Spectacular rehab of an old building.  A little loud for my taste but manageable.  The foo","useful":0,"cool":0},"rBojDWwLNcb3HSIdDS0Eqw":{"text":"The location can't be beat but the food and service leave much to be desired.  The staff i","useful":0,"cool":0},"YRiGvmV6qNJWxJmFu-US8A":{"text":"Beautiful restaurant with great food and speedy service. Hard to get a table for dinner wi","useful":1,"cool":0},"yyjkIb8swmO0gQ6wfQGbWw":{"text":"Hey!!\nReviewers!! It's what we do. We chase new restaurants and RAVE or SLAM on em. I have","useful":6,"cool":2},"5cwnRcsGYfqBHJwiQrT98w":{"text":"I ordered the shrimp and grits with a side of veggies du jour. My husband got the duck and","useful":0,"cool":0},"41t49_F9JvY_aY3xVvu4QQ":{"text":"Pros:\n-The chicken tableau was to die for!\n-The creme brûlée was the best I've had!\n-I mad","useful":0,"cool":0},"dI3pYCAGZ-NG5Hn2G2LvQQ":{"text":"Food and wine were good quality, preparation and sauces nicely done. Prices are within rea","useful":0,"cool":0},"_bUVxftvdDoO_pfh7MsIWw":{"text":"Came tonite, sunday nite w six. Forth nite in a row for dinner in FQ.\nOthers were great, t","useful":2,"cool":0},"La4Tf3WNzzx6RPjPDQb9MA":{"text":"We enjoyed our time here very much. The wait staff was very pleasant and our food was deli","useful":0,"cool":0},"tKc30jmvkg5EVDFqqFdOdg":{"text":"This is a beautiful restaurant, great staff, and outstanding food. Coming from NYC we've e","useful":0,"cool":0},"_Y89NYkjBlVm4ZrQYmhlrw":{"text":"Nice location but rude management. They had 6 open tables in balcony but couldn't let us g","useful":0,"cool":0},"IwmXQvavHSHQRshbRrOjxA":{"text":"When you walk by the restaurant it has a wonderful French Quarter look to it and when you ","useful":3,"cool":3},"tlDkbK_JqQAqhvJM7YkF0g":{"text":"Had fantastic dinner at Tableau last night.  BBQ shrimp and grits was amazing.  Restaurant","useful":0,"cool":0},"0jPZh565qeFnDWgpuh0LBw":{"text":"This restaurant is fabulous!  I had the truffled crab fingers, which are local crab claws ","useful":1,"cool":0},"yYx09J-Lx25xzoIfkfTtAA":{"text":"Great food and atmosphere. Waitstaff really worked hard to please. Will definitely recomme","useful":0,"cool":0},"GwOriL5_bibj9I8duSWJBQ":{"text":"A little background.... Hubs and I are foodies, and on vacation in the city we fell in lov","useful":0,"cool":0},"yTEVfO-O6EmR9OT8mguJ9A":{"text":"I had high hopes for Tableau.  We had some family in town and wanted to take them to a rel","useful":0,"cool":0},"Dg6jdk2fbYeSTrMzQOUuhw":{"text":"1. At checkin the gentleman took out phone number and said they would call us once the tab","useful":0,"cool":0},"_ZL2hAdBGmz3Po77ebYhyg":{"text":"Service was great. Food was ok. A little on the bland side. I ordered the court bouillon\nA","useful":1,"cool":0},"UfrCY3GJDmjI5dnUy8zgOA":{"text":"Food was good, dining room is very nice, and staff was super-attentive. I agree with the o","useful":0,"cool":0},"y_TboEuUh0_ZGQXDUgle2A":{"text":"My husband and I stop into Tableau every time we visit New Orleans. We love the shrimp and","useful":0,"cool":0},"aJ0X6mg_iWyblJRABQmgmQ":{"text":"Our dining experience was wonderful. The staff was attentive to all our needs particularly","useful":0,"cool":0},"i1OH9sKBD3LL2Le37GoR_Q":{"text":"No matter how busy we've always had good service and great food here.  The menu is thought","useful":2,"cool":2},"s4u1OT3E_DMKcKFrfu018g":{"text":"My husband and I came here on the first night of our honeymoon in NOLA. For starters, the ","useful":2,"cool":2},"VtzVKgpmmBg_umKrM85GAA":{"text":"Had a physician partner dinner in private room. Awesome service and cuisine. Had creole co","useful":0,"cool":0},"sDrk7OjkyCDzoBo_YtPzag":{"text":"We had dinner here last night before the theatre! Food was wonderful! The best spinach sal","useful":0,"cool":0},"LmbcGRaeWR1Y1z_eQmseGw":{"text":"Had the oyster brochette and seafood gumbo. Really good stuff. The sauce on the oysters wa","useful":0,"cool":0},"tbGMxGy0xaijBDJDSG9XjQ":{"text":"Oysters were amazing (both the fried and bacon wrapped), but the french onion soup was jus","useful":0,"cool":0},"J7uxqCoSpoEjttD134jPLg":{"text":"We have been wanting to  try Tableau since it opened and finally decided to grab lunch the","useful":0,"cool":0},"ytl00MBjKH0sffbNJwCN8Q":{"text":"All around pass. Food is overpriced and just \"ok. \nTruffle crab fingers were just super bu","useful":1,"cool":0},"7-QDkl3d0fTTNiYeNp2clw":{"text":"Ended a day of shopping at the newly opened Riverwalk Outlet Collection and afternoon of m","useful":1,"cool":0},"1bGD9dpkeLL-pu2fvxtt2w":{"text":"An amazing menu, a professional bar, and a friendly, down-to-earth service team that makes","useful":2,"cool":0},"Jti6tBldelpiB3LslBf1rA":{"text":"I'm giving this place 2 stars because the drinks were good; otherwise, it would have been ","useful":0,"cool":0},"_bhwBLWedizJj9mDgKaF3w":{"text":"I'm sorry I don't mean to be rude but this food was blah plain and disgusting I had the ve","useful":2,"cool":1},"LCqQKPzVjE1UjlxWa5_iig":{"text":"I visited Tableau with my husband on a Thursday night for their \"Wine Down Jazz Up\" live m","useful":0,"cool":0},"XUqqmqxVcij4rJpZ9fkYZw":{"text":"In town for a conference and our off site dinner was scheduled for Tableau.\n\nOur four cour","useful":0,"cool":0},"GlhPkh08uT_7FIu1umrO4A":{"text":"I think this place had a lot of potential but the service was really not that great and my","useful":1,"cool":0},"RY3fsaWaNejtW6ahFKol3A":{"text":"John as a bartender just made this place awesome! Drinks were yummy! Great atmosphere !","useful":0,"cool":1},"VWd6HxzwMKPhAPiardNvLQ":{"text":"Excellent restaurant. Probably the best place I ate on my last trip to New Orleans! The fo","useful":0,"cool":0},"fNljLr2gdfV8NJCYT_K1yQ":{"text":"Tableau is--as I understand it--newer restaurant offering local fare in/near the French Qu","useful":1,"cool":2},"W6j0xIM5C1sTqeGqoLv7Cg":{"text":"Food was delicious. We dined on a Wednesday night. When we arrived the restaurant was basi","useful":0,"cool":0},"GoA0nMKg6so47DYBvUvgmg":{"text":"On a business trip with 2 colleagues who were in New Orleans for the first time, I felt th","useful":1,"cool":0},"_khWbO7SOzqzsMuZbJDMVw":{"text":"We made a 430 pm reservation for an early dinner, but when we got there they told us they ","useful":0,"cool":0},"6PX4HqmY47xfAHGFEiMPXQ":{"text":"Food was delicious. A bit of a queue at 7pm, we went for drinks across the street and they","useful":0,"cool":0},"GCeC3MUEG28utV5DrKgRRg":{"text":"Great gumbo. Nice casual but slightly upscale atmosphere. Reasonable prices on food and co","useful":0,"cool":0},"okPsInpzu_xOsGPqTLgW9A":{"text":"I'm going to go with 4 stars at Tableau because the food was generally very good at a quit","useful":2,"cool":1},"4zFWDRUyW-oDwFZmHpgAPA":{"text":"We were lucky to get reservations today for our anniversary dinner. Certain times of year,","useful":0,"cool":0},"Vm858lKgsddK7dkXf5DLmA":{"text":"This restaurant is beautiful... The architecture, decoration, etc all looked really nice. ","useful":1,"cool":0},"mk0FXg312NNih3xwaN4pXw":{"text":"We had dinner here on a Nola vacation, and I had the Steak Frite Moderne entree. Wow, that","useful":0,"cool":0},"NHmm4R1w1Xkmsga118vkKg":{"text":"Dropped  by on Saturday while shopping the quarter for an early dinner.  This was only the","useful":2,"cool":0},"PbLHDLwLWxVTMdy7TO7_Rw":{"text":"We had dinner at Tableau for our anniversary. The ambience was perfect and the staff were ","useful":0,"cool":0},"oLnzZG_96MZ020Ej7riZ8A":{"text":"Love love love it....ate twice on this trip! Try the \"tryst\" topping on the paneed veal!!!","useful":0,"cool":0},"XdwaBERYdXI8QmrOAb2G6w":{"text":"I see the reviews for this place are up and down, and that sums up our experience.  On the","useful":0,"cool":0},"Ca-pP1IHhh0IpOFsB5JQCQ":{"text":"We had a wonderful evening there. Started at the bar for drinks; bartender was friendly in","useful":0,"cool":0},"pOTcBk59LWhbhcPQsterQQ":{"text":"Our party of five had a delicious meal at Tableau on a warm fall evening.  We arrived on a","useful":1,"cool":0},"vuBsej-EoEstHVwhttqKUQ":{"text":"Did not eat here but sat on second floor patio and had 4 pins cups and a bourbon while wat","useful":0,"cool":0},"bmOsgRYMoSZZGp7pBLqTaw":{"text":"My husband and I went here for lunch with our toddler.  I can't say enough great things ab","useful":0,"cool":1},"vOdbjpwjgCj1G1rhJBoa1w":{"text":"We were disappointed.  The appetizers were good and the entrees looked attractive but did ","useful":0,"cool":0},"emHVIRFAfO4ZyYCVQMcfvg":{"text":"Overall the dining experience was solid, attentive staff and nice place inside.  The chick","useful":0,"cool":0},"wTBiFdJiJGb76-CqFoyD2g":{"text":"We dined at Tableau on 4/19 during our recent NOLA vacation.  We selected Tableau as we se","useful":1,"cool":1},"Bu5SS4IlDVOJWL7347hSsQ":{"text":"First impression, the restaurant is in an excellent location if you're looking to be in th","useful":0,"cool":0},"SMbQMeLZHIA5ovJeSO8lmw":{"text":"Food was very good though not exceptional. Service was sub par. Went there for a 12 year w","useful":0,"cool":0},"7ngXe2ZjGue15pKGqBmcaA":{"text":"We had a wonderful experience here for Mother's Day brunch. We didn't have a reservation, ","useful":0,"cool":0},"cm8tTvKMRVpdB3kYlhV1Dg":{"text":"Immaculate food - my wife had the gumbo and I had the BBQ shrimp and grits. We then ordere","useful":0,"cool":0},"fc7Aze1YTh4dGFQxal-Bmw":{"text":"We had reservations for 5 on Halloween.  We were set up on the balcony which was okay exce","useful":0,"cool":0},"Uk1arUmRYyi9o9YFr9NUxA":{"text":"Went for a late dinner last night. Four stars for ambiance-- sat outside on upstairs balco","useful":1,"cool":0},"l9QqXp5J84CPlUhVKW4ZxA":{"text":"My husband and I ate here last weekend and we were very pleased with the entire experience","useful":0,"cool":0},"14mcX2TnByUP3YZI_EDEbQ":{"text":"So where to begin... Went upstairs to bar. Great atmosphere! Waiter very attentive. Ordere","useful":0,"cool":0},"wjg-c32SXAs59bHSEGtjNw":{"text":"Great customer service at this restaurant & yummy food to go with it! I came in early in t","useful":0,"cool":1},"2TKQbHfCvj8Fr7ztc57JaQ":{"text":"Located at the French Quarter, this place serves Creole.  Situated at Jackson Square and n","useful":0,"cool":0},"X91Qvyz5Nh9CQ55Fy02Gww":{"text":"Stopped in for brunch, great food, atmosphere and live music. Close to everything. Service","useful":0,"cool":0},"7HEfG4pjeWvlJCzrup3Svg":{"text":"I had my rehearsal dinner here last month and was very disappointed. The portions were sma","useful":0,"cool":0},"LGBmwX6l9DxGAQV5C7lCdQ":{"text":"Tourist trap! The only thing this place has going for it is the view from the balcony. Eve","useful":2,"cool":1},"evqCbFVQrj3Rf08V1gt1VA":{"text":"Just had a dinner party for 14 people in the wine room at Tableau and it was absolutely fa","useful":0,"cool":0},"zQ7DDqfiDjyZY5qhH3IH1g":{"text":"This review is late in coming, but better late than never. \n\nI had to organize a group din","useful":0,"cool":0},"mK8Qyr2BnHp25RnNOykEsA":{"text":"After completing our absolutely awesome meal, we all agreed it's better than Commanders Pa","useful":1,"cool":0},"C54Huo-Vn7HAHPCHddNkYw":{"text":"My husband and I were blown away by the food! We were not expecting to be wowed with every","useful":1,"cool":0},"0dvhHnd6LDCxRaNfVMg_hA":{"text":"Great place. Great food. Great drinks. Cute little courtyard. Long wait. But worth it. Thi","useful":0,"cool":0},"WFzAeUoIRg1jRKndy6H8Sg":{"text":"They do not give you enough food.  And the food we did get,  which was the gumbo and whate","useful":0,"cool":0},"P6tJQoPVuwz16xNn41qscQ":{"text":"Our favorite place for happy hour. The patio seating is top notch. Snacking on truffle fri","useful":0,"cool":0},"kQedsYdtjBn81E3JEhE67Q":{"text":"Snarky service, sarcasm like nobody's business, and if the food would've arrived sooner th","useful":2,"cool":2},"3g5zpyKIEmMrsYPpmKJP-g":{"text":"My family and I have visited New Orleans many times over the years and I'm here to tell yo","useful":0,"cool":0},"_DLPhVL8uBxfVrLAdZ8AuA":{"text":"The food was incredible! It was probably in the top 10 meals of my life. The reason why th","useful":3,"cool":1},"bp3vrwTY-MNd4JOpHXuSiw":{"text":"The food will make you stop and think. You will take your first bite and pause - your mind","useful":0,"cool":0},"8pc2FFlBskLSDzb4gVpNUg":{"text":"A wonderful dinner! Excellent service, BUT ABOVE ALL, I left my purse on a chair at our ta","useful":0,"cool":0},"dInq4kB9MMrmSKh3vao02Q":{"text":"My sisters and I decided to have Thanksgiving dinner here. We were ten minutes early and d","useful":1,"cool":1},"_4NRPaDuYqFXVRH-8tyd6Q":{"text":"Prime French Quarter location, Average Food experience.\nWhite tablecloth setting complete ","useful":0,"cool":0},"xhaRsEzOy6kZeY9iENMVIA":{"text":"Lovely pre-fixe menu in a private room on the 3rd floor (yes there is an elevator) for a f","useful":2,"cool":1},"yMHuwlIKz6TLu-5abZ3smA":{"text":"The restaurant is beautiful and overlook Jackson's Square which is amazing. The staff was ","useful":1,"cool":0},"Udtg-kFs7dFL2b8z_1V8dQ":{"text":"We were on vacation a few weeks ago and stopped at the bar here to seek refuge from the he","useful":0,"cool":0},"y3HPjBkyZwA2_Btaanvh-A":{"text":"We had dinner reservations at Tableau a few weeks ago, and the restaurant itself is gorgeo","useful":2,"cool":0},"SYaKBYuD9KvgnkQ7i6jjAw":{"text":"We caught a glimpse of the beautifully hand-lettered cocktail menu on the mirror wall thro","useful":2,"cool":0},"N5FPwUZrpd85v7VHlbpVGw":{"text":"Really 2 1/2 starts is what I would give.\n\nWent there for dinner this evening while celebr","useful":0,"cool":0},"4bPy76FROvBEuwj1JhkWCw":{"text":"It took forever to get drinks and place our food order.  The food was good but the service","useful":0,"cool":0},"4z8_OfGmMXly8V_VkXYznQ":{"text":"The food was delicious! We didn't get the best service because we were in the restaurant a","useful":0,"cool":0},"ZqpllQLz9YF8lpNx68kjVg":{"text":"We went for Happy Hour and sat on the balcony, which was so lovely! We had the calamari an","useful":0,"cool":0},"i9pnriJTjIKYotOYKh9zfQ":{"text":"We showed up a little early for our reservations.  The servers and hostess all were very f","useful":0,"cool":0},"UMhon_B3OHJgP36_qy8DzQ":{"text":"This was my first trip to New Orleans and my trip to Tableau was a fantastic way to end my","useful":0,"cool":0},"x5z79aecfhWPXPrzSVrVXA":{"text":"Very cool setup inside, with a dining room downstairs, a more casual bar/drawing room upst","useful":0,"cool":0},"KP9WkJ8ardympfbNdrWrsQ":{"text":"My brother and his girlfriend got my wife and I a birthday present, by booking us a reserv","useful":0,"cool":0},"Q3Kg4sJrFPcbI6AEpJRYsg":{"text":"So much for reservations! We waited for 45 minutes after our reservation time of 7:30pm to","useful":0,"cool":0},"Ti-2YNlI3pNrSJ6ihkF65Q":{"text":"I went there today for a weekday brunch! That alone was great because a lot of places only","useful":0,"cool":0},"JzZE1tUxglcnUiZ52fKp_A":{"text":"Amazing food and great experience \nThank you Sean and Karl  and Cordero you were all Amazi","useful":1,"cool":0},"BrH4q_q9uFabd3K57BsDMQ":{"text":"My friends and I ate here for dinner during our first night in New Orleans. We ordered the","useful":0,"cool":1},"8XvEeQcRtr9QngPOrMvOPQ":{"text":"I've eaten here 3 or 4 times now, and it has only gotten better. Sunday brunch was incredi","useful":1,"cool":0},"OmmpDy_nB86J0Q5xhi3AfA":{"text":"We went Saturday morning for brunch because we were in town for the USF vs Tulane game in ","useful":0,"cool":0},"YQ9LbOM4bI7nRnh4U3WClA":{"text":"Steak and fries was the move here. Delicious. My Bloody Mary had a nice array of veggies. ","useful":1,"cool":1},"bYrBVoJB9yCMh3qFeRJRaA":{"text":"Loved everything I ate. They have a good looking burger for people who are picky. Happy ho","useful":0,"cool":0},"x0u20HdgwzUsQubAxeXerg":{"text":"Awesome meal with an incredible staff. One of the best dinning experiences in New Orleans.","useful":0,"cool":0},"re4CgdMJM-QTlDtmZMjNPA":{"text":"Delicious dinner with a business group upstairs in the green room. Started with a busy coc","useful":0,"cool":0},"SwoaArHYeU4DDUo-rk_Z5w":{"text":"Came here with my dad for his last night in New Orleans and did the whole Reveillion dinne","useful":0,"cool":0},"SsBuHS18pr1RLvhXU1Q0oA":{"text":"I never noticed Dickie Brennan owned a restaurant on the corner of Chartres and St. Peter ","useful":0,"cool":0},"0XqyuBSJ1rmIwe9kH8cUYw":{"text":"We ate lunch here during the off season, which means we got great seats. Beautiful view an","useful":0,"cool":0},"Ywcd3uwCPoaq6SpZb_id9w":{"text":"The brown butter gnocchi is unique and very creamy/tasty. Had the shrimp and grits which w","useful":0,"cool":0},"G3U0IErfXKbA5wR4MtARSQ":{"text":"Great New Orleans seafood.  Great balcony view of Jackson Square.  Friendly waitstaff. Fas","useful":0,"cool":0},"vcb70pbavPgocgFzQapqZw":{"text":"Pretty disappointed for being a Brennan restaurant. We had steak, it was just ok nothing s","useful":0,"cool":0},"zZ2mm0W1p0yigT3KsdGERg":{"text":"Amazing food, great view up on the balcony. The seafood was absolutely wonderful. Be sure ","useful":1,"cool":0},"OHYFnXk-31oGB3r6BkTRWQ":{"text":"Let's start at the beginning.  My wife and I walked into a very unwelcoming reception.   I","useful":1,"cool":0},"Z4hhv_lPtHnzyiyXnht6mA":{"text":"We were here the second week of Jazzfest with an 8:30 reservation party of 10. The restaur","useful":1,"cool":0},"6Cc9Mz8hPAsBZz31CikV4g":{"text":"We reserved a table for 7pm on a Saturday night, and stopped by earlier in the day to requ","useful":0,"cool":0},"o2fPx-WjdCbddsAXs8iikw":{"text":"We went to this restaurant largely based on a yelp review and were really glad we did. We ","useful":0,"cool":0},"1zX1pOMk147vfaxjgUQtnQ":{"text":"My wife and I had dinner here during a recent trip. The restaurant is very nicely decorate","useful":1,"cool":0},"kBvQDuhQB9sDVrggQHMcTA":{"text":"Second time here, both on the balcony overlooking Jackson Square.  Tremendous flavors, exp","useful":0,"cool":0},"iu4S5jPw2RLxJugoHsDOqQ":{"text":"Very disappointing. Both our entries were off base. She had a steak, ordered medium rare, ","useful":0,"cool":0},"05alQ847DdA2WAmTjkKeLQ":{"text":"We managed to score a great table on the balcony our first night in New Orleans.  The serv","useful":0,"cool":0},"z3u6JWMiRLnBrFEw572jOg":{"text":"Had a great experience last night at Tableau! French onion soup and stuffed redfish were b","useful":0,"cool":0},"mLFDw9n9X3vSbGkmOaeShQ":{"text":"Definitely eat here if you're a tourist, because you won't know any better...\n\nLOCALS...st","useful":0,"cool":0},"WkRNWQvTdWLKU6OyqmAAkA":{"text":"Not for locals.  Strictly French Quarter-focused, get 'em in and out, who cares who you ar","useful":2,"cool":0},"Zh7XwsdiLg3K3iL4f69dpw":{"text":"Nice place for large party. Food was good as was the service. Nothing exceptional. Located","useful":0,"cool":0},"Zu1DJI66U5hWDPh_x67djA":{"text":"Fancy schmancy by Jackson Square. The staff was nice, the waiter that had us on the balcon","useful":3,"cool":0},"Kb9BaEVe6LL-DT8IfniDiQ":{"text":"We had dined here 2x previously when food and service were both excellent so we decided to","useful":0,"cool":0},"smI0ZVleGHAXmlo7yG9oJg":{"text":"Stoped in for appetizers, drinks, and dessert! Had the demi royal and fried oysters maison","useful":0,"cool":0},"qmALhKfE1dOI6RcA0sy1mA":{"text":"Worst service ever. We got there 30 minutes after they opened. The restaurant was barely o","useful":0,"cool":0},"4hxfSTCWx8cVFrpquWgR1w":{"text":"Tableau is a great place to feel relaxed and enjoy their wonderful food.  Went there for t","useful":1,"cool":0},"E_S39xeLv9uE3BBZWDmYdA":{"text":"Karl and Cody were amazing!  Thanks for making my friends' birthdays that much more specia","useful":0,"cool":0},"JDMUB9QE3WJw3jO4NFue5w":{"text":"Wow. Absolutely, completely, utterly fantastic. Great wait staff who sat us immediately. W","useful":0,"cool":0},"pIAXRqZRkBKMBYMZS2A-Dw":{"text":"Tableau is in a historic building that is beautiful and located next to St Louis Cathedral","useful":0,"cool":0},"cws0EFdoNOAIIFCsgye6kA":{"text":"This was by far one of the best meals and most pleasant experiences I've had in Nola in aw","useful":0,"cool":0},"XF-xn2HqLmE2G5i-gtnLZw":{"text":"Sadly the worst food I had my entire trip.  We got gumbo and soup, both were poor.  Neithe","useful":1,"cool":0},"KNVrEi2LHOVnyythZEMybQ":{"text":"Came to New Orleans for our anniversary and chose Tableau for our special dinner. We were ","useful":0,"cool":0},"4eICGrg1E3axMdS3QLnTYQ":{"text":"We chose this place because of its prime location and its cute balconies that had an amazi","useful":1,"cool":0},"rVRg68pLnGskiCFUKKsFEQ":{"text":"The service was exceptional! We were there for brunch! Bottomless Mimosas were legit! Food","useful":0,"cool":0},"5do_euF-JrrH8zG7OQnhuQ":{"text":"Amazing meal! I literally had to stop myself from licking my plate! We started with the de","useful":0,"cool":0},"k5CAjzfQOEi0SgDq0iEg1g":{"text":"Sit at the bar enjoy the view, food, cocktails.  This is a great location right across fro","useful":1,"cool":0},"kOp8tIDresjUg9TVrokqWg":{"text":"Stopped by during their happy hour (2-6pm) on a cloudy Wednesday afternoon and sat on the ","useful":0,"cool":0},"ymg8yc_twCw6KBcjCn0xrg":{"text":"I was scared to go here becaue I generally think that restaruants in the FQ skimp, over ch","useful":2,"cool":1},"llwe2SfTkV-43Ncbv_aHdw":{"text":"Really good meal.  If you have a bad meal in New Orleans, blame yourself.  So much good fo","useful":0,"cool":0},"QTwHVwsqH_8Zw-mlU0LKbA":{"text":"Tableau deserves 3.5. The outdoor ambience was lovely. For the price point, however, the m","useful":0,"cool":0},"Hcw23NtcCtfnst_hgO_A1Q":{"text":"Food was wonderful! However only rating 3 stars due to service. NEVER in my life have I ev","useful":0,"cool":0},"WBiZmrz0Tt4kIZbbuLuNjw":{"text":"This place is great! Great customer service, great higher end options. Definitely has a bo","useful":0,"cool":0},"IdMQEESr9anwyBe57C-WAA":{"text":"My husband and I had reservations for the balcony for 7:30. We arrived at 7:10 and were to","useful":2,"cool":0},"cN_YsecKoUHudQ2X4uPSzg":{"text":"Brunch at Tableau was the most disappointing meal of my entire 4 day trip to New Orleans. ","useful":0,"cool":0},"NvuyJkyaY43-IyZShYE5Jg":{"text":"This place is swanky as hell. If you want to experience a wait staff so professional it'll","useful":0,"cool":1},"b-B8GKdwfDr0naY75Yf7vA":{"text":"We were disappointed at lunch here. The menu was small, service was incredibly slow (despi","useful":0,"cool":0},"AaZla5k7sffwNA6lFaBSUA":{"text":"The service was super fantastic. Marquia was professional, warm and a pleasure to work wit","useful":0,"cool":0},"UXeFplkhnMTildClR2bUzw":{"text":"I expected more out of something produced by the Brennan family.  I ordered the filet mign","useful":1,"cool":0},"z_cgSYxzPM3Ijm04ThxrZQ":{"text":"Can't understand what the problem is. Booked a 6 pm reservation for 4 ppl prior to a 7:30 ","useful":1,"cool":0},"aee5XSKrplo2lqRekDbWZQ":{"text":"Amazing meal from start to finish! We were lucky to get a table on the balcony upstairs ov","useful":0,"cool":0},"OhwMWJiDfYbwBpqg0Vr8Xg":{"text":"Had to give this three stars based on opportunity to be better. I told my waitress that I ","useful":1,"cool":0},"Ff3qIu4gHxXDUOr7BYXz9A":{"text":"Decent food , nice atmosphere.  Had fish for a meeting we attended .  Lot of great choices","useful":0,"cool":0},"ubwFqJGDqNtQGAdpgPhqvg":{"text":"Great food. Great service.  Everyone from Chris B, the bartender,  Jewel our server of Chr","useful":0,"cool":0},"icimHpmTLkgsem8XdufLAA":{"text":"Had lunch with a large group and food was quick and satisfying. Gumbo soup had delicious s","useful":0,"cool":0},"sTImHHrjiNR5tTt3O-vMrQ":{"text":"service\nA+, even asian parents would be proud. they made me a fried oyster po' boy even th","useful":0,"cool":0},"iNBJOUa_A1yCgFFBwQvCSA":{"text":"Great food, impeccable service, and beautiful venue. Couldn't have had more Southern hospi","useful":0,"cool":0},"LPJ2--sADdrS4e0gJ8BJWA":{"text":"Had dinner here while in town.  We started with some drinks out in the courtyard and that ","useful":0,"cool":0},"Y-LxjO1myMEeLCzgGNLh8g":{"text":"Excellent bartender!  Great drinks and nice talk!  Happy hour is the best!  Try the French","useful":0,"cool":0},"8GHTUiHiC4ZR98D9nLL8_g":{"text":"Skip it!!!! I am only giving it two stars for the view and musicians who play around your ","useful":3,"cool":0},"q2s6PLeHiYPpK7-azaHe3w":{"text":"I enjoyed out visit here with a table of fairly well served Jazz Fest goers on a neighborh","useful":0,"cool":0},"cQr5JkE-hptZznHxpPP4kQ":{"text":"Service is great! We decided to go here on a whim while walking back to our hotel and I'm ","useful":0,"cool":0},"vwqyuwQj2NGs32wpbNt0-A":{"text":"Great food. Beautiful location. Fantastic service!\n\nThe decor could be bumped up a bit but","useful":0,"cool":0},"owI9Y76UDk_pV5M_5UFhIg":{"text":"My daughter and I both had the filet, which was cooked medium rare as requested.  My steak","useful":0,"cool":0},"apHDphrAbnBg6qLqURNsLQ":{"text":"Wife and I had steaks and started with a half carafe of \"tap\" wine. Wine not so much. My w","useful":0,"cool":0},"5h7ObtuwC2Y0KMtLaC6zjg":{"text":"Beautiful setting, with view into open kitchen. A nice surprise being situated in touristy","useful":0,"cool":0},"wxP-zFHqVv3Ce7V8JVoAdA":{"text":"Nice place with lovely music. When we arrive a trio band gave us a warm welcome!! Good foo","useful":0,"cool":0},"s42k4Jn3bVNsHfP1c02O-w":{"text":"Bottomless mimosas, live music, and great food! What else is there to say?! Go for brunch!","useful":0,"cool":0},"vWP-M_Rhxer_su2yajduYQ":{"text":"Three words -- truffle crab claws.  Yes. Please and thank you!  During my recent trip to N","useful":0,"cool":0},"ryBrgUPkXCVFc1W7gbpGLw":{"text":"Tried to get at the breakfast advertised on the street at 11am during French quarter festi","useful":2,"cool":0},"ULP1YgyTBJqgchUwor9E9Q":{"text":"This restaurant had such an impression on me that I still bring this up as a place for fan","useful":0,"cool":0},"gx3Ub1TN1lQ46lRI7MzcJw":{"text":"Visited Tableau for an anniversary dinner and we were seated in a room called the \"Library","useful":0,"cool":0},"STI0DQv1aG6hRDhP-tdFyg":{"text":"Soooo. Where do I begin?\nLet's start with the courting of this \"fine\" establishment. We wa","useful":3,"cool":0},"A35CbDzuFrq3--q9kN3Ucg":{"text":"Very cool place with great location and atmosphere.  Service was very good.   I hate to on","useful":0,"cool":0},"szTwDffEoMBujNzFw0XS7Q":{"text":"Great place! Wonderful food, good service although a bit of a wait, but worth it.  Nicely ","useful":0,"cool":0},"srBYMUY5_Tw0gEYwussh8Q":{"text":"I went to Tableau last night for my birthday with a group of people. I had found a reserva","useful":2,"cool":1},"bVMyrzJ5NnWd0TU1uqIa1w":{"text":"Killer spot for a cocktail and fine lunch and dinner menu. The Terrace seating overlooking","useful":0,"cool":0},"muBChrXwGIFM8nTrqtH41A":{"text":"Excellent dinner and servers. The Red fish Bienville was superb and the tart a la Bouill w","useful":0,"cool":0},"GpwrZC9skseuYHX2MhCWNA":{"text":"We loved this place.  Perfect location on the corner of Jackson Square, we were able to si","useful":0,"cool":0},"8aoZR9m72VqcvIXruaZLxg":{"text":"Absolutely delicious! All of the employees were very friendly. Really enjoyed the atmosphe","useful":0,"cool":0},"PT4B38sR7kQfEAkIONXxbw":{"text":"Unbeatable location & great gumbo.  Maybe the best I had, during a recent trip to N.O.  BB","useful":0,"cool":0},"JUzAeWN-wdMJ4gir6N_OLg":{"text":"Had dinner there tonight with a party of 6. Service was horrendous and food quality was no","useful":0,"cool":0},"SgqVPpRCFSnuc9VqIqz4bQ":{"text":"All of the food was fantastic. I will dream about the gumbo and turtle soup for days to co","useful":0,"cool":0},"3o-5bNTeQAhsKIvXfRqzIw":{"text":"Rude, overpriced, and shitty food.  Not to mention I felt sick afterwards.  Definitely a n","useful":1,"cool":0},"1NrOJ7IqQ0p7ZXV6EwQ8jg":{"text":"this place seems classy, and we felt it was a bit aloof, but the food was tasty.\nwe ordere","useful":0,"cool":0},"AdY2E5H3ZPKGbhJKHRQfzw":{"text":"This would get a perfect 5 start had it not been for the blond hair I found in my Trist, r","useful":2,"cool":0},"HCUGOvXWD-JJ-0FEkZuSCA":{"text":"I decided to try this new restaurant during their soft opening.  I'm always looking for go","useful":0,"cool":0},"rRqINQsLN8imzjW-VFA8Bg":{"text":"I was a fan of Tableau, we have had a lot of excellent meals there, but 2015 is NOT their ","useful":0,"cool":0},"Jcg1_ddwHcW5JuzZGinkkA":{"text":"Frankly, I was expecting to be disappointed. It was Thanksgiving, and even the best restau","useful":1,"cool":0},"wUuppMaWnZ_FvCRZWtVr8g":{"text":"I had dinner here my first night in NOLA, and it was a good introduction to the fabulous f","useful":0,"cool":0},"2m8uzZk2Z4nC3HUD5ETsqQ":{"text":"My expectations were high as I'd heard lots of good things...but my visit was GREAT...exce","useful":0,"cool":0},"7dIUud9BNLc8QprwWEydnQ":{"text":"Went for happy hour. They were distracted getting ready for dinner. Food was good. Staff w","useful":0,"cool":0},"tIP51gW1TXDuzLKKKlkDAA":{"text":"If you have the chance to go here in NOLA save your money.  This joint is a waste of time ","useful":1,"cool":0},"GKk6PygDHAgXchPrYKa1-g":{"text":"Definitely eat here.\n\nThis place is awesome. I loved the history of this place.\n\nApparentl","useful":0,"cool":0},"cW7VuaV1VqxaCs6Fec15og":{"text":"What a nice find!  Great food, service and atmosphere.  My filet was perfect with a hint o","useful":0,"cool":0},"byqBbib3o89b-ra85qQNsw":{"text":"Chic atmosphere, with a equanimity of sophistication, Tableau is on my foodie repeat list.","useful":1,"cool":0},"xYshcTxAgl0r32Jik3LGEw":{"text":"We made reservations here for a special engagement dinner. The restaurant and balcony view","useful":1,"cool":0},"7dplFvIEACIsVCmnVwRwsA":{"text":"Happened upon this place at lunchtime and was very pleasantly surprised. In the very heart","useful":0,"cool":0},"r_SvF1IEx09PAnPfUIILBg":{"text":"Walked in here in a massive downpour. Made our way to the bar and were treated like kings ","useful":0,"cool":0},"HZioX2mUbGuAatSVhQL2Ag":{"text":"Attentive service, good drinks and great happy hour. I recommend the Coschon Quesadilla an","useful":0,"cool":0},"oTq3i_hDdzttOok8TT5EoA":{"text":"Four of us ordered from the \"theater\" menu, which we assumed should have us ready for the ","useful":0,"cool":0},"TFyECQOpJJCR-G2zebot6w":{"text":"My daughter and I had dinner there last week. It was our first night in New Orleans.  We w","useful":0,"cool":0},"vv68NbzCHvJM-_SwxhdNWw":{"text":"We had a light lunch Saturday afternoon. My partner and I split the Demi Royale. It was sm","useful":1,"cool":0},"Zap6jF3ulFvGUwdR-hCb6A":{"text":"Excellent service and food!!! I had the French Onion food which was the best I've ever had","useful":0,"cool":0},"gnAHMZIMYanD4ogn7PmbRg":{"text":"Food was average & you can certainly get everything on this menu amywhere else in the city","useful":0,"cool":0},"-UdNDDKckkURb87FIC4teQ":{"text":"Great restaurant. Ordered the filet, oscar style. Cooked to perfection and the crab was su","useful":0,"cool":0},"yKYZA3ZQti1nd5-Prvp2-g":{"text":"The view from the terrace upstairs is beautiful- perfect view over the french quarter. The","useful":0,"cool":0},"nHK_Ex5TNf30rNcVv9LodA":{"text":"Tableau was great!  We got a table on the balcony during happy hour.  The sweet frites are","useful":1,"cool":0},"BR8cke_rJPoTwTs6xSFe3Q":{"text":"Had a private room for 18 of my staff. The building is nice, food ok, service is slooooow.","useful":0,"cool":0},"pOKXSviTd5tVaMyjO3uHkQ":{"text":"Nice place with Good choice for a reasonable price. Our children have enjoy the chicken an","useful":0,"cool":0},"g738RG_qaaY9RMi9Z2r_nQ":{"text":"What a disappointment!  Don't choose Tableau for a celebration.  After calling ahead to pl","useful":0,"cool":0},"TKQvHNSRV2BRnVQa-5jNOQ":{"text":"During a second trip to the Big Easy, we met a few locals who suggested Tableau. I was rat","useful":6,"cool":7},"PakZ-wUHC8VoLcqC-t6C7g":{"text":"If want to relax and enjoy a cocktail at 3pm then this is the spot. \n\nThe place has an ama","useful":0,"cool":0},"och-I5CYUNjLv_qN-hDBGg":{"text":"Back again on Wednesday night and just like before food phenomenal!!!!!!!!  definitely a m","useful":0,"cool":0},"o5Zo32CwnavardmKy6mPgA":{"text":"The food is great! The service is friendly, informative and responsive! The band was great","useful":0,"cool":0},"7gh89cO3svTEA7j0W0IySw":{"text":"Service lacking. Turnover of tables slow even after people leaving. Food mediocre at best.","useful":0,"cool":0},"VjfIUgNjMPe9mwXi_eu4PA":{"text":"Chicken tableau is a MUST! Absolutely one of the best meals I've had in a while. Service w","useful":1,"cool":0},"-EgEf7p5FVdPHR4mp0doxg":{"text":"Made a reservation on the open table app the night of. Perfect place for a nice dinner/dat","useful":0,"cool":0},"NSjP30uw0eb7sGoq3n9jOw":{"text":"We are New Orleans locals and love all of the Brennan's restaurants.   Yesterday we wanted","useful":0,"cool":0},"tgRFSTKd_8kswM77GcLutQ":{"text":"Great place to enjoy happy hour! The rose wine is delightful! We tasted several things on ","useful":0,"cool":0},"YgUNLkFWfhAYaeDAKm-N9A":{"text":"French 75 and pecan pie - my personal fav. Great happy hour cocktails .. The balcony view ","useful":0,"cool":0},"3SRFmiCxKl9vjvTuUpiBtw":{"text":"We had great service from start to finish at Tableau.  The hostess Dejondra was charming a","useful":0,"cool":0},"R5Hvtfts7nRc7TxIgD612A":{"text":"Very disappointing service and blah plain food.  Very expensive, there are better places i","useful":0,"cool":0},"9qKQlKupbjK1Mfg3bRpccQ":{"text":"Tableau restaurant is a nice quaint restaurant and has numerous options for seating, both ","useful":0,"cool":0},"WFbQwq3nbi7QaEZnO45J2g":{"text":"Delicious Madame Croque.  This is our first trip to Nola and what a way to start off our d","useful":1,"cool":0},"2HSXXDorNXGWoZ4JB0OfVQ":{"text":"Wow.... What a fabulous dinner! All but one had the BBQ shrimp and grits, the other had th","useful":0,"cool":0},"1xVsSOzzo1mUClnWH29X_w":{"text":"A truly incredible dining experience.  From drinks to dessert it was awesome. The wait sta","useful":0,"cool":0},"gLVo4Wq89h-g9HskG-asaw":{"text":"Food is fantastic! Good beer on tap, great atmosphere. Chose to sit on the balcony which w","useful":0,"cool":0},"R3slnj9LGb-nEpRJICyh3w":{"text":"I ordered the duck Confit which was very tender and had some excellent flavor to the sauce","useful":1,"cool":0},"Voc58uDpqxrwybtdXJeSKQ":{"text":"The food was delicious - however, I cannot give four stars considering the service. \n\nWe s","useful":0,"cool":0},"e_S6TfjzNSWMQLaZDZeEkA":{"text":"We were three adults and two 12 year old boys for Thanksgiving 2015. We had reservations a","useful":0,"cool":0},"dcgeKFrT184nf2j91G60AQ":{"text":"Great bar area to sit and enjoy drinks and apps. Bar area upstairs and downstairs.  Great ","useful":0,"cool":0},"GA1FAJ6iyyq7ACLE6S_yqw":{"text":"Great ambiance, service and food. The french onion soup is really tasty. This restaurant i","useful":0,"cool":0},"51_QuQfmhWr36y_YTHLuPw":{"text":"We are dinner on December 27. We unanimously agreed that this was one of the best dinners ","useful":0,"cool":0},"KBoxVwi8S5eiavSGbVQwzA":{"text":"Simply put, this is the most enjoyable meal I've ever had. We sat on the terrace overlooki","useful":0,"cool":0},"LultG1-sknFZ34mWdwU6pA":{"text":"The service was great as well as the location right nex to Jackson square. Had the special","useful":0,"cool":0},"MwJ0HJ0HQc-WNd4spqxRpg":{"text":"Great place for food and service. I would definitely make reservations especially on the w","useful":1,"cool":0},"dkKh2VnvGo4FISTDCEdpGw":{"text":"The best meal we had in NO. We have been trying all the 4+ star places on Yelp with thousa","useful":0,"cool":0},"ZDlt5Y1jQXUJuDyOrqZEzw":{"text":"The balcony offers the best view in the city! Located right on the corner overlooking the ","useful":3,"cool":0},"vGbHVcRbwo-7YCcVDht7Aw":{"text":"Great staff and food. The location, Jackson Square, gave me something to do while I awaite","useful":0,"cool":0},"k6yt8Cw0WkEqL7Gmrxy0fg":{"text":"Where do I start... went to this restaurant for my friend's birthday dinner. We had a part","useful":0,"cool":0},"KsVGWgnk_GKOxRywOQ4Frg":{"text":"This has been by far the best oyster bar we have went to during our first time visit to Ne","useful":0,"cool":0},"ToG89xgtMpTO90iIPFysGw":{"text":"This is a old school classy spot, with top notch customer service. Vintage French American","useful":0,"cool":0},"fGUpBiFkBq43Lxmxlm2dhQ":{"text":"Staff was attentive but not as knowledge as they should have been. Having said that the fo","useful":0,"cool":0},"lbZlAZjLymZQ6Ub-SGjlMw":{"text":"Don't go any further than the coolinary menu.  YowZa... What a treat.  Food on the level a","useful":0,"cool":0},"Zwi79qs1ZMRCcvz5-_dW8g":{"text":"We just had our wedding at Tableau and everything was picture perfect!! Our guests loved t","useful":0,"cool":0},"Iu3lpwutczxRWD0W1iGvwA":{"text":"The food here was great, the service even better. Wait staff, bartenders, and managers mak","useful":0,"cool":0},"8hOW55916O1mYfDc62cWqg":{"text":"Sitting at the table for 40 minutes before a server came over. Ordered oysters. They told ","useful":0,"cool":0},"A9wcSTdrz_oiNmT2X_qn0A":{"text":"One of the worst restaurants I've been to in a long time. We picked this restaurant becaus","useful":0,"cool":0},"lFxSDz09B5bZarE2R7iu2g":{"text":"A bit overly fancy French Quarter restaurant.  Better for lunch than dinner, I think.  I h","useful":0,"cool":0},"fYnaNE0jS8WMxf3Qoi0Y3Q":{"text":"The upstairs bar/balcony seating area is lovely - however, it was quite windy and chilly e","useful":0,"cool":0},"hnIxwdBeu8aNLklEmz3kZA":{"text":"had a great dinner here last night! my mom's in town and so I've been lucky enough to have","useful":1,"cool":0},"kfHjB0P4dMmwLZGis8-XOw":{"text":"This will be one of my go-to NOLA restaurants.  After being in-the Quarter so many times s","useful":0,"cool":0},"xlRgZptWJ267uke7cIn2lw":{"text":"The hubs and I met some friends here our first night in NOLA. It's a very charming place w","useful":0,"cool":0},"aJmrr12BDM9tf1RUeaPHAA":{"text":"Went a couple nights ago with my husband. We ordered the crepe special and seafood and asp","useful":0,"cool":0},"1vPIE_G_nTBFf0RdIK7jFQ":{"text":"Lunch December 16, 2015; 3 persons. Shrimp sandwich was mostly bread. Salad tomatoes were ","useful":0,"cool":0},"CdODK0VPetetWMi1KAg2uw":{"text":"Wonderful evening out nice wine list and the food was great. We had 3 waiters for some rea","useful":0,"cool":0},"XhcmB-Vtflp8JbAD0sNfqQ":{"text":"The food was good but the 3 piece band elevates the experience in this restaurant. I'd go ","useful":0,"cool":0},"2jzyg2AKZNV7Xi3NeyqJpg":{"text":"Surprisingly, I liked the appetizers here more than the entrees. I really liked the Demi R","useful":0,"cool":0},"FV78YYv78JcnGWObI89C7g":{"text":"My fiancé and I stopped in here on a whim, and since it was a nice day outside, we request","useful":0,"cool":0},"FGCiH_oWJ9b6R1BbseGuoA":{"text":"A group of 5 of us had dinner here for our last night in NOLA. We loved the ambiance of th","useful":0,"cool":0},"shbciWV2mIXJP2Gv4T2BcQ":{"text":"They served me rancid mussels last night! The other food was edible but not what I expect ","useful":0,"cool":0},"vh3KTN5bew_NKNL98obw-Q":{"text":"I have been here a few times and it's been hit or miss. Service is probably my biggest com","useful":0,"cool":0},"YY1u91pDm0L396AZe_M1VQ":{"text":"Yelp rates this restaurant with only two $ but it's more like three or four. Pricey menu i","useful":0,"cool":0},"yK7Fyt8nvsE29nj8kx5RjA":{"text":"We were celebrating our first wedding anniversary and the Tableau staff made sure we felt ","useful":0,"cool":0},"zoZfLMsxSGgkeQKXp40gpA":{"text":"Food here is so crave-able. I had to write this review because I can't stop thinking about","useful":0,"cool":0},"DHKn1DZrxNihcYUQqP6lSw":{"text":"The food was absolutely amazing, but the service was horrible! I would never go back becau","useful":0,"cool":0},"ImdkizDlUmLzcJmL36Nrpw":{"text":"Thus far all my dining experiences in New Orleans have proved memorable and pleasant, full","useful":0,"cool":0},"Nj79SKi7C49Ui3ePJ0a5OA":{"text":"This is the 2nd time we've been here. Some friends invited us the 1st time. This time we m","useful":2,"cool":1},"P2T-uymv1_BZt6PWVGCtaA":{"text":"Bruuuuunch!!\n\nOh you WILL get the Cochon De Lait Benedict.  Yes, you will.  Trust me.  No ","useful":0,"cool":0},"J0clQDj7J6yq-johJ8rbCQ":{"text":"I really wanted to like this place as the location was perfect and the weather was just ri","useful":2,"cool":0},"3OZZpWfbeLQ6xT1MuaQmqQ":{"text":"Excellent food, friendly staff, pleasant and comfortable place. Great view from the balcon","useful":0,"cool":0},"u1OZLO0qswnk7gcorjl5eQ":{"text":"Food here is phenominal! Staff is super friendly and helpful. And the ambiance is great! G","useful":0,"cool":0},"aa_zUgWGA45rDirlBNNwpg":{"text":"There is a chef who looks exactly like Alfredo Linguini from Ratatouille, 5 stars. Perfect","useful":0,"cool":0},"cImP_XEJU91qt8A-iGhbDg":{"text":"Great staff. Nice wine in carafe or bottle or glass. Great duck gumbo and apps. \nMore to c","useful":1,"cool":0},"9XD3ye35KywDw11eG9cCoA":{"text":"I honestly avoided restaurants smack in the center of the French Quarter because I assumed","useful":4,"cool":4},"nT1IFpMt3n9R2Mg44gd9eQ":{"text":"Fabulous food and decor. Ordered the grass fed beef burger, stew and steak. Excellent serv","useful":1,"cool":0},"fe1kofuoWr9B5xYGRx2I7Q":{"text":"Not sure why this restaurant only has 3.5 stars but that is not an accurate representation","useful":2,"cool":1},"PJ6ElP3scfr-uJLbuWdKhw":{"text":"Want to have an authentic big easy dining experience?  Well this is it!  It's what we have","useful":0,"cool":0},"PSM0QA52YCxZ_ECMxWw69Q":{"text":"My family and friends had brunch at Tableau based on recommendations and I'm so glad we we","useful":0,"cool":0},"WWJ9ulbF_yWn6q349fTgcg":{"text":"Tableau is well worth a visit if you're after a more refined dining experience in the FQ. ","useful":0,"cool":0},"ONZIle3I493kyjuKgK7W5g":{"text":"We had big hopes for this place. We waited 30 minutes for water. 25 to order our drinks. F","useful":2,"cool":0},"vsK4NdHrs_SmGmNYL-h6Qw":{"text":"Awful!!! We waited over an hour for sub par food. The service is lackluster. The manager e","useful":2,"cool":0},"qur1RLX4PT7BsDa442vh9g":{"text":"My boyfriend and I stopped by on a whim after walking around Jackson Square for dinner. We","useful":0,"cool":0},"1REWMdGFJfFTLBGsGK1rsw":{"text":"Just No. terrible terrible service and the food was terrible. As a local we were excited t","useful":0,"cool":0},"867tPkKsBBjHoXEvc1cL7A":{"text":"Best service and fantastic food! The minute we walked in, they took us to the top floor wh","useful":1,"cool":0},"paoTH__tIW-pFnSgHnVYyw":{"text":"Great place to eat my wife and kids, wife got the cheese tray and I got the great cheese b","useful":0,"cool":1},"oD495VOMSup3i4sOPAIhjA":{"text":"Soooo, French Quarter Fest my two friends and I strolled into Tableau. I've had some back ","useful":0,"cool":0},"IJAWLw4Lj40n6CFhYDz4Ug":{"text":"A friend and I went for dinner, and asked to sit on the balcony on the second floor. We ha","useful":0,"cool":0},"tnZeVRR_LoF8Sc77-PleMA":{"text":"Whether you're passing through or a local, Tableau is for you! We were passing through the","useful":0,"cool":0},"cLIpiFACti39ReJ_aUzwzg":{"text":"This was probably my favorite meal in New Orleans. Everything was so amazing and the wait ","useful":0,"cool":0},"PBr8FBDfpfyXF9GT6Hz0lQ":{"text":"The food.  The service.  The ambience.  All excellent.  Half a dozen oysters to start.  Gu","useful":0,"cool":0},"Xd6Ca6fwFil7MZphnwkGxg":{"text":"The penultimate Friday of the summer simply begged to be celebrated by skipping out of wor","useful":0,"cool":0},"R7qeqtF4rrFED49gICRhig":{"text":"Really great food and atmosphere...I'll be going back for sure =) I loveeeeed the cheese b","useful":2,"cool":0},"tqCGDi6Z5tNnZ1FjHPwT6Q":{"text":"We started our New Orleans journey here for brunch. Our server Katie was so amazing and gu","useful":0,"cool":0},"U9ZdrBct-SRcoxrUAJxJoQ":{"text":"The food was awesome but the drinks was phenomenal to start off our date night.  My Wife w","useful":0,"cool":0},"ddU08DLxIpwO2GE3cofqKg":{"text":"We went for free dessert after get all stamps from visiting 5 museums. Thought will be eas","useful":0,"cool":0},"3H-PH2u1ZhSGXst4uzNSmg":{"text":"So, I don't write reviews often if not ever. Not to sound like a douchebag but I just want","useful":1,"cool":0},"o2S_450pB45exFQAYOgi9A":{"text":"A friend of mine had her rehearsal dinner here last week and it was awesome. The food was ","useful":2,"cool":0},"XIh1ns2V2-atK4ujjQhzXw":{"text":"Really great French/Cajun food in a classic old building in the French Quarter. Seemed mor","useful":0,"cool":0},"7la15zoIqMmkfP6acBrgVA":{"text":"The only reason I'm giving it any type of star is because our waiter was good. Our reserva","useful":1,"cool":1},"7MLv6KTnXtqBhVosR7TBIw":{"text":"I took my daughter to Tableau this past weekend for her 21st birthday. I just had to write","useful":0,"cool":0},"0hmshNjY4lOJ-KC-ZPW2dQ":{"text":"Maybe we've been jaded by living in a town with crap seafood for the past eight months, bu","useful":2,"cool":0},"_K_kJC29r-NnQiKZgW-D8w":{"text":"The best seafood gumbo that we had while in New Orleans.  )Even though supposedly it doesn","useful":0,"cool":0},"ldRS20BzQqY93r5fvjw5QA":{"text":"Saturday brunch ... just very bad wait service .... let food sit a while before serving ..","useful":0,"cool":0},"FYVJcwk8-hsgVJAoKFZvTA":{"text":"I had the pleasure of visiting this place, again this year, while visiting New Orleans. Th","useful":0,"cool":0},"ObolZ7-tEOkmdaS1zYOdMQ":{"text":"My husband and I were in town and I haphazardly picked Tableau to make early dinner reserv","useful":0,"cool":0},"GmKOOzKKTNzUH7DQ-ppmOg":{"text":"Tarte a la Bouille is now one of my top 5 favorite desserts. It tastes like a doughy pastr","useful":0,"cool":0},"c36y-f8QXxN10iOezSPsKw":{"text":"What a great find. Drinks on the upper deck, lots of great cocktails to choose from\nCrab l","useful":1,"cool":0},"ywKYGzD9iGC9xUZq-9mKdA":{"text":"Love this restaurant. Came by on a whim the first time and was blown away by the quality o","useful":0,"cool":0},"-iKRNcSpBUj6c4tlRdpu7g":{"text":"Had the crawfish dip, gumbo and redfish.  We were on the balcony very beautiful night.","useful":0,"cool":0},"O1RV7ISJ-DUT4cc3x8oZ3Q":{"text":"This is the best restaurant I have ever been to. The captain Sam is so wonderful and gener","useful":0,"cool":0},"fOHunOIWOkCIvUhXh2Cdcg":{"text":"This place was great! Good atmosphere, great food, awesome drinks. We had dinner on the ba","useful":0,"cool":0},"qhjVJT6hMn5xYzFqXHnN8Q":{"text":"Had one last small dinner in NOLA on the final night of our anniversary trip. Running at t","useful":0,"cool":0},"B_xJESH7rkjMH-wneTbMCQ":{"text":"I had high expectations for this restaurant and unfortunately my expectations were not met","useful":0,"cool":0},"VTH3KMpvW08e6wHRJyVapQ":{"text":"We had the privilege of eating here twice during our stay in NOLA. It's a beautiful restau","useful":0,"cool":0},"q-7U343LwXyhPqBGw9vH7Q":{"text":"Amazing service! The French onion soup is the best I've ever had! it's a must try!  The ho","useful":0,"cool":0},"T9KpZvTtvNzAn_6IJUm-cw":{"text":"What a FUN night! Clarence was our bartender/server and he made the evening even more fabu","useful":1,"cool":0},"YnCkxGAjtFaE176K0I_IUg":{"text":"Food was delish!!! However, it was extremely loud. Not a place for business or intimate di","useful":0,"cool":0},"uZ9yzq0Ry2Rl7ivtQzOyCQ":{"text":"This was my first time visiting New Orleans, and this was the best I could have possibly a","useful":0,"cool":0},"smdW2EX50lq9kc2_mf7aww":{"text":"We have had a great time sitting on the balcony hear and watching people flow in and out o","useful":0,"cool":0},"UIIYX8AQc5A9UYZcb1Be_A":{"text":"To begin with, it took almost 10 minutes from the time we were seated until anyone noticed","useful":2,"cool":0},"RFLDdaSl9s6UHpextDDyKw":{"text":"Absolutely great service and atmosphere. We had dinner with a large group in the wine room","useful":0,"cool":0},"MBjV1OajSqJYlL5ZLQKTvg":{"text":"Spendy - nice ambience and beautiful court yard to spend with your other - another nice cr","useful":0,"cool":0},"dTrk3LMhA0XXwOVl4yl0Ow":{"text":"Stylish, classy interior and delicious food. Definitely worth a visit and one of the bette","useful":0,"cool":0},"F2CcMsL1ah47vESzxZAmCw":{"text":"My husband and I went here for our anniversary dinner and ending up being very disappointe","useful":0,"cool":0},"oxg2hQO-ZUHhT8tkQinizg":{"text":"Fantastic! Cute place in the French Quarter.  We ordered Shrimp and Grits and Court Bouill","useful":0,"cool":0},"KRNInG0y7Mp1XzoB0LYY1Q":{"text":"The food was absolutely phenomenal and the service is wonderful. Take the time to visit th","useful":0,"cool":0},"y6rK8D1Ad8HfOniaZByyCw":{"text":"Went for my boyfriend's birthday dinner. On the reservation I made online I made note that","useful":0,"cool":0},"O3C7dJ4mv90FYNhC4AB8SA":{"text":"What a wonderful spot to take in the local flavor. The food is so good and the service rea","useful":0,"cool":0},"r37inZLNe0cb3_lVPAehCg":{"text":"First of all we did not have a reservation and we were able to be seated   The wait staff ","useful":0,"cool":0},"_K2ps8HtA8w3pSxN5VoXgg":{"text":"Stopped into New Orleans driving from California to Florida and had dinner at Tableau. We ","useful":0,"cool":0},"REMDWdxriM-c5vE6PTxRlg":{"text":"A group of us went here for dinner after the event at the convention center, and we were s","useful":0,"cool":0},"eVpPuQ18fPyN1ZTS7RzZkA":{"text":"My girlfriend and I dined here for the second and last time this past weekend. The locatio","useful":1,"cool":1},"lVyLX1K3kvgji1cOK9eGVg":{"text":"Great appearance and delivery. Service was great but the good was very overpriced, and the","useful":0,"cool":0},"Kq4HrYLozfO1mIVKRXilYw":{"text":"We recently dined here one evening, for the first time. Nice atmosphere and very gracious ","useful":0,"cool":0},"ye9wWwbDhh4FLuG9nv_Y-w":{"text":"UPDATE 9/2019 - We've just returned to Tableau for a special occasion. I personally didn't","useful":0,"cool":0},"oLC8bk9g5d81Yi64Z10gFQ":{"text":"We stopped in Tableau for a quick bite. The staff was great. The Gnocchi was so good. We a","useful":0,"cool":0},"J7SmNHpWLnYesI2-QfVPaw":{"text":"a little pricey (5 drinks cost us $70) but a nice, chill atmosphere. a cool place to stop ","useful":0,"cool":0},"2jH_x8zCbabkp3zfDrd5aQ":{"text":"Great view from upstairs balcony and interesting menu. Friendly, helpful staff. Greasy stu","useful":0,"cool":0},"fNslmrQMz4mw45cBxFiqzA":{"text":"Our waitresses name was Sam. She was the absolute best. Get the turtle soup for sure. Clas","useful":0,"cool":0},"GxgjJjjH0id5JZrQIFk4-g":{"text":"We ended a food tour here and what a way to end it! We sat in the beautiful courtyard and ","useful":0,"cool":0},"NizZaK3SM0q7r8ITs1EMgQ":{"text":"I cannot day enough positive things about this place! I've only been here twice and I pret","useful":3,"cool":2},"iZ3kHgt3Y_wtkJ9Sis_t5w":{"text":"After receiving a long list of places to try in Nola during my first time, we chose Tablea","useful":0,"cool":0},"_sJ1cWCO8JDFrl_FTwmYrw":{"text":"One of the best meals we had in New Orleans. Brunch on Saturday included live jazz going f","useful":0,"cool":0},"Z2kkdrvdy_NqkBsAAgrPjA":{"text":"If you go and like wine, ask for Ricardo ! He is great and knowledgeable and can tell you ","useful":0,"cool":0},"sLmG7scjJo8WlDUSw0Y2BQ":{"text":"A great place to grab a meal. The food was delicious & they have a great hot buttered rum ","useful":0,"cool":0},"9hAZRTgMXaLueKFT4gD3Yw":{"text":"When you want to lick the plate clean and smile with every bite, you know the place is a w","useful":0,"cool":0},"_KD46x3hgLmaKEV1qLHKdQ":{"text":"I would not recommend.  Only subpar service we had in NOLA.  We went for Sunday brunch.  T","useful":0,"cool":0},"_OEQSecd-TZEvs3fTs2T1w":{"text":"One of my very favorite places in Nola! We went on a Saturday and were entertained by wond","useful":0,"cool":0},"ku9Axh735smqNVFsqAs84g":{"text":"I actually came for the music and ambiance to begin with, then after a while I ordered som","useful":1,"cool":1},"5JJmPpVhE1KHAweimGKQYw":{"text":"I've been to most of the restaurants in French Quarter over the years. If you can get in t","useful":0,"cool":0},"rZ2PhoQKPVRPRMO1TDeKCw":{"text":"Had an awesome dinner here!  Located on St Peters off Chartres St, right next to the famou","useful":2,"cool":1},"WDoBXkrkJ5tTR2rBnVWEVw":{"text":"Can't say enough about this beautiful restaurant. \nMy daughter and I usually have a diffic","useful":0,"cool":0},"J6ffakzGGeDFUXFJyx09Lg":{"text":"Food was excellent. Service was a tad ale but extremely attentive. Sweet authentic atmosph","useful":0,"cool":0},"ohNS2E6E0j__qE7rn7wqZQ":{"text":"Dined here on a Sunday night with my office folks while attending a conference in NOLA. Or","useful":0,"cool":0},"Lx14VMjqck-BeW957c0scA":{"text":"Visited here yesterday with three adults and a grandchild. Absolutely wonderful staff. Mad","useful":0,"cool":0},"ZMARNb8YWlTkEdsyhWk23g":{"text":"This place is fabulous.  Next time your in New Orleans,  come check this place out. Lovely","useful":0,"cool":0},"3LHbzeUEEg-MxK4sycDzBQ":{"text":"Fantastic food! This is a classy place with top notch food in NOLA. The only negative thin","useful":1,"cool":0},"MDflFrVf-W-rototQjX2Qg":{"text":"BEST OYSTERS I'VE EVER HAD. We came with about 7 people and were accommodated very nicely,","useful":0,"cool":0},"_iuzhY7aaCuOLkFBivi7iQ":{"text":"Ate Thanksgiving dinner here and it was great. We were seated on the balcony with a beauti","useful":0,"cool":0},"XSOb3IrEa0GzBp7BKgbnpA":{"text":"I originally wanted to try Tableau for their balcony and the view you have on the square f","useful":0,"cool":0},"wAx4-gvt9SRcgpBtRGgx1g":{"text":"We had been to the restaurant for dinner and had an excellent experience. Recently, we dec","useful":0,"cool":0},"zJbU5_kEjBdBabv2gJJkiA":{"text":"This was my favorite place we ate during our stay in New Orleans.  The gumbo is amazing.  ","useful":0,"cool":0},"RaD-UFEQvqEiL9LqicJ_6w":{"text":"Still great food however service was definitely lacking this time sad because the food is ","useful":0,"cool":0},"kkWY18au_GhNsJTVoemV2A":{"text":"We've dined at Tableau every time we've visited New Orleans since our first trip about fou","useful":0,"cool":0},"R6vEW85w4M6dv25-BVgTBQ":{"text":"Tableau accommodated a group of 22 for a work dinner on the upstairs library. We had a pri","useful":0,"cool":0},"l5MICaLlaD1Mpit5Yyhchg":{"text":"What a wonderful experience. We ordered the gnocchi appetizer and split the Chicken Tablea","useful":0,"cool":0},"Ih6ahN9sYtT8F4fG_lwWeA":{"text":"Had the gumbo and appetizers with fried green tomatoes, shrimp and boiled egg.  Restaurant","useful":0,"cool":0},"wSRXb30YqVl2_Im9Nw79ag":{"text":"My wife and I traveled here for vacation and found the spot to be centrally located in the","useful":0,"cool":0},"JLQnBfbMVG-k9p8SYkgCAA":{"text":"Love it here. The staff is friendly and their bottomless brunch is a great time. This rest","useful":0,"cool":0},"A1poiYUCXia0y4LT8E7MRw":{"text":"Amazing amazing food! Katie was so sweet and an excellent server! Ask for her and let her ","useful":0,"cool":0},"FxESKNWaqDPpxdMjjVin6g":{"text":"Tableau is an experience! I visited a few weeks ago with my book club and everything was g","useful":0,"cool":0},"AlXu5W02ANaRsmRGwQYwZw":{"text":"Service and food was amazing.....\nVery unique place... food had lots of flavor and present","useful":0,"cool":0},"k9SLeqHQbhtMPUGIZsE85A":{"text":"I just want to start by saying our server Anthony was literally the best. He was very info","useful":0,"cool":0},"0fexCkYNyYgSFw07fIefww":{"text":"Fabulous food, location and service. Brûlée is divine.","useful":0,"cool":0},"Hddy-sFvp6fUji4Uye_B1g":{"text":"The highlight of our New Orleans trip! The service and the ambiance was exceptional! It wa","useful":0,"cool":0},"FGi-dQJxi4sUekWe0Xhgaw":{"text":"Excellent food and service. Upscale atmosphere without being stuffy. Redfish Bienville is ","useful":0,"cool":0},"sJFbObluvByvR6q03EROkQ":{"text":"To die for one of the best restaurants in the Quarter....service, food and ambience \n5 sta","useful":0,"cool":0},"OSzz3-IuHzD6oXCmKbACjw":{"text":"Phenomenal food, amazing service, food was all super quick and delicious will let the pict","useful":0,"cool":0},"gM93resEV42Vsj6f1UwnpA":{"text":"Turtle soup was awesome.  We recommend taking a friend(s) and everyone getting something d","useful":0,"cool":0},"65XprACaCExD7HnjkwAyQA":{"text":"Best place in New Orleans if you want to enjoy the scene but not be part of it:-)\nSeat at ","useful":0,"cool":0},"kI9V6V4JBaernGeKPWNyZw":{"text":"Incredible experience having brunch on the balcony. Jazz band playing, gorgeous view of Ja","useful":0,"cool":0},"YBASLffs9OfDZZE2PPmRwA":{"text":"My fiancé and I are from Baton Rouge, and we're in the city with a friend from out of town","useful":0,"cool":0},"n66C5_tERhPs81cd7GxH5w":{"text":"I came here for Sunday brunch and we reserved the of table on the balcony that overlooks J","useful":0,"cool":0},"Ew_YHaSarjmrAouhNQfU2A":{"text":"Wow. Wanted bottomless mimosas and I got em! Enjoyed chatting with the servers too. They g","useful":0,"cool":1},"IFPm_glAHSMZ1ZKjvQ-PBg":{"text":"Everything was great - service, wine, food. I loved everything from the amuse bouche to th","useful":0,"cool":0},"vRSfRkYFMutGw7SW-U3t-g":{"text":"We came here in December for a nice dinner. Service was great and went really above and be","useful":0,"cool":0},"PEtLR_w4-dw0110wpf_Xmw":{"text":"Made reservations here since we were looking for a nice place to have dinner as a Christma","useful":1,"cool":0},"caSHYzf4tlu7xhlVtsjpBQ":{"text":"Great dining experience. Came solo and sat by the bar. Taken care of all the way.\nGreat se","useful":1,"cool":0},"RGwJ-nnbim6LHhM1XlH4BQ":{"text":"My daughter and I popped in just passing by and had an amazing meal.  Our serving team of ","useful":0,"cool":0},"rEcuR3ufwVyNebRpWhpu9g":{"text":"Great staff! Awesome drinks. Yummy food! Louis and Jazz were the best - 5 stars for them!","useful":0,"cool":0},"6eILYBc-hwo5hvRXAPAKCQ":{"text":"Great service.  Very nice and clean restaurant.  Everyone loved their food.  The best Shri","useful":0,"cool":0},"f27ibf_OmKMD41Z6B49jAw":{"text":"Paul and Alex helped us to some of the best Bloody Mary's ever, with Wheatley vodka. I hig","useful":0,"cool":0},"5mpPdDnQFVWN9v6HsUpxxQ":{"text":"Waited an hour for food and bread. Food was cold when it came out. Over cooked shrimp. Und","useful":0,"cool":0},"RZAnqgpooF-15P55vONiIg":{"text":"Mya and Ms. Jewel delivered AMAZING service. From there recommendations to just making us ","useful":0,"cool":0},"kRuXc1iI4iCfnak8i5gzGw":{"text":"My favorite restaurant in the world. They have great food and a balcony looking over the F","useful":0,"cool":0},"Z1X1UGUfAPcLVYdgx5S0cg":{"text":"A GREAT find in NOLA!  After a less than stellar experience at Cafe Amalie, (see review an","useful":0,"cool":0},"zQgEjAcFoF_bsNnTIs4rZA":{"text":"This is one of our favorite neighborhood restaurants in a neighborhood resplendent with fi","useful":0,"cool":1},"a5F3mlvvh58hxbqHEHzu3Q":{"text":"Be sure to scope out these pre prohibition cocktails.\n\nThe view of Jackson Square is amazi","useful":2,"cool":1},"1An9sTBWaX2UOVn-O-qJdg":{"text":"Nice atmosphere for my best friends' wedding. We are from out of town but I wish that port","useful":0,"cool":0},"CKi8N_sUfNLVRQe_xJL1gg":{"text":"Tableau sets the stage with an open kitchen, restrained simple design, a great bar in the ","useful":0,"cool":0},"wk-Jr6xTg3ZoQirqDvsN7g":{"text":"The hotel called to confirm reservations and accommodated a balcony level request for NYE.","useful":0,"cool":0},"yWKkTfNnBw59fzhzUGIkLA":{"text":"Service over the top!  Jewel was amazing!  I've never seen anything like it!!  Alligator e","useful":0,"cool":0},"srIlWi5HPz2KhJKLxCCXLw":{"text":"Hubs and I enjoyed the view from the balcony as we noshed on BBQ shrimp and grits and redf","useful":1,"cool":0},"oR1sN-3GCroGXx66vQSItA":{"text":"We sat at the bar and had great service, amazing food, bartender was great. Nice environme","useful":0,"cool":0},"V7RbVY4IvAx7twshVvd_pw":{"text":"Top tier food, great service, location, and a nice upscale atmosphere. Salad was noticeabl","useful":0,"cool":0},"IylPQ5DmCE5OglBwvv16og":{"text":"Delicious food and spectacular service.  Enjoyed the ambiance and located right in Royal c","useful":0,"cool":0},"lBMHdyx8-klzEToU-nUeIQ":{"text":"One of the best restaurants in the city. My wife and I had brunch on Easter Sunday, the se","useful":0,"cool":0},"ymzDgJDLS4u6N9Uo7SIoqA":{"text":"This should be an amazing restaurant. \n\nLocation-perfect\nInterior - beautiful\nName associa","useful":0,"cool":0},"iuxAxLtOFnpp3iwZW9-T3w":{"text":"Best balcony in New Orleans, but really need to rethink the logistics of the upstairs bar.","useful":1,"cool":0},"v9Bsl88pPVHQHtdpgPXtng":{"text":"I don't care for going into the city. Crime, beggars and the overall filth that covers it.","useful":1,"cool":0},"nNHop6Dx22dZw_IMjZ2_HQ":{"text":"Delicious food and friendly service. Listen to employee Miss Jules and order the vanilla b","useful":0,"cool":0},"lJgOpeY4nqLX3hc3KUuq5Q":{"text":"Everything we had was delicious. Fresh seafood, great wines and cocktails, awesome service","useful":0,"cool":0},"IZw9_r0hddw7_fA2ss-Gmw":{"text":"Simply not acceptable. Items not cooked correctly. Service untrained. I could go on with d","useful":0,"cool":0},"S2gLT6QlKGGfu2RfUTpVMQ":{"text":"This was our second stop on a progressive dinner. I was craving good gumbo, and theirs hit","useful":0,"cool":0},"43iFiW9Mho4eIk5iHwrNcw":{"text":"This is about as close to food heaven as you can get in NOLA. Great food, beer, wine and s","useful":2,"cool":1},"l4lznnK8TktEWu31Ybs_yA":{"text":"Food - super delicious. Service - a bit slow, but very helpful and nice people. Balcony/ou","useful":0,"cool":0},"0vkepKn-b5R5IEm1GQC5cA":{"text":"Beautiful restaurant with great service, but the food was just average for a large group! ","useful":1,"cool":0},"O3wZV3F39ybb_9f6_2n09g":{"text":"I had a great time at brunch at Tableau! It's a really fun atmosphere-there's even a jazz ","useful":2,"cool":1},"kaXJJ1XxrCGaK0EFNurnmg":{"text":"Very nice restaurant with great service. They gave us a complimentary ceviche chip with ca","useful":0,"cool":0},"tzeRa1U1jCPVFg1PO2ctzg":{"text":"We hesitated at Tableau's mediocre reviews, but the menu looked good. We were so glad we t","useful":2,"cool":1},"QnWchOxZaIzfBmTAY41wiQ":{"text":"Tableau sets the stage with an open kitchen, restrained simple design, a great bar in the ","useful":0,"cool":0},"2GVaM2d_EA3cOJouxVKatg":{"text":"I stopped at the Tableau on a whim with two girlfriends on a busy Saturday night.  We were","useful":0,"cool":0},"b7VQFJzI4H3fObptXMLuaw":{"text":"Some of the best shrimp and grits I've had. The bar tenders are amazing. I highly recommen","useful":0,"cool":0},"kgWOEZ6uzm2WLhn-Oycvdw":{"text":"We decided to dine here with a party of 10 including 2 kids. The service and the food coul","useful":0,"cool":0},"rVn9ii2dkIuQ3vwa4uQ-DA":{"text":"I was underwhelmed.  I had a beer which was cold, but seemed really overpriced.  Moving pa","useful":2,"cool":0},"1tLWUWIaizsMp-VhJh1EAg":{"text":"We just had a mediocre experience at Tableau, this being our 4th time coming. Our first ex","useful":0,"cool":0},"T3CIHbb4DYAS3DjUNmcfdQ":{"text":"I love this restaurant, I've never had any issues. We came here this past Sunday Brunch to","useful":0,"cool":0},"Y9gcPRms3XjSbJVQEX-oQA":{"text":"We, too, went caroling in Jackson Square and was hoping to end the evening with a nice din","useful":0,"cool":0},"ADjtwin-a1-pBj0yCchmIw":{"text":"My friends and I went to an early dinner on Saturday evening. There was only a 5:30 reserv","useful":0,"cool":0},"pIEfWMA0eZKzQHtgJkuYAg":{"text":"I really liked the food at Tableau. The Truffled Crab Claws were amazing. \n\nThey have a re","useful":0,"cool":0},"Aqu1HsLm2UUY7Dw-LWcyjg":{"text":"Headed into Tableau on a late Saturday night. We didnt have reservations and the wait was ","useful":0,"cool":0},"H0USosfLdOGRba3PKAXC0A":{"text":"Excellent choice but unfortunately reservations are highly recommended as they are NEEDED!","useful":0,"cool":0},"n_6aur_R7f1ttCZYgDyLmA":{"text":"Overall good, but definitely not a place for vegetarians. Our whole party enjoyed their fo","useful":1,"cool":0},"ajCtvx_XgIqizTJT-h82Ig":{"text":"First off, I love the happy hour here and the ambience. My fiancé come here every time we ","useful":1,"cool":0},"MVvf67Qp3YHgukCpbJGEFA":{"text":"Our favorite meal in NOLA so far! Came here for a brunch and were able to get seated on th","useful":0,"cool":0},"TBLzxu2nuNYM6MyiTNQDjw":{"text":"This wonderful new restaurant from Dickie Brennan opened only a week ago. The soft opening","useful":4,"cool":1},"r-TGMJs0cIbY-D2ritI-og":{"text":"Outstanding from beginning to end. After reading some of the reviews, we were hesitant to ","useful":0,"cool":0},"sb2FLNUBrv3Tq7mxXHn9mQ":{"text":"This place had the best ambiance and service i have had in the great Crescent city.  Our s","useful":0,"cool":0},"Zxa9Oe3crX4ezE4vbz7Cqg":{"text":"Great chees platter...service was great...They had happy hour from 2 to 5 pm.  We enjoyed ","useful":0,"cool":0},"72Wzz3tvB0Uvg9HiK5yTqg":{"text":"Best food I've had in New Orleans from all the restaurants we went to while visiting! Drin","useful":0,"cool":0},"mUFDEGFgy_EnKObxRRMKfg":{"text":"Bottomless Mimosa, I outdoor seating overlooking Jackson Square and a gorgeous Sunday made","useful":3,"cool":0},"k--EIf9yKpBDqexuB7mC-w":{"text":"Phenomenal food, amazing service, food was all super quick and delicious will let the pict","useful":0,"cool":0},"jVIjdCn9tsVCSEiSipZaKw":{"text":"I had my birthday dinner here on Sunday and it was nothing short of amazing! I had the shr","useful":0,"cool":0},"BoUQZ7ndL1eizIeXg1tdgA":{"text":"Came for the brunch experience since it's my last day in New Orleans.. Food was amazing!!!","useful":0,"cool":0},"731DV5doCzZB8-wSN_lUmQ":{"text":"Pricy -- but so worth it. \n\nThe cornbread skillet with pulled pork was so good that we can","useful":0,"cool":0},"gKssQdvJ4O7DBci1UweVSw":{"text":"Went here for a bachelorette party dinner a group of 10. They seated us at beautiful squar","useful":0,"cool":0},"M1uGDgAdb8hiOdhW74Y4SA":{"text":"If your a white wine lover the Sauvignon blanc ( elqui valley) which is on craft was so ea","useful":2,"cool":1},"Hq-ysFraFssAZ9ttEH1NCQ":{"text":"Becca:\n\nCame to NOLA for the first time with my mom during a busy weekend, not realizing t","useful":0,"cool":0},"ztGkddKLGDevh9l16MpQ7Q":{"text":"The food there is fantastic. We had shrimp and grits and redfish as entrees, creme crulee ","useful":0,"cool":0},"1LAyQzz63SFymwSI1Ulicg":{"text":"Food:  Best turtle soup I've ever had.\n\nAtmosphere:  Very old South.  Great music as well.","useful":0,"cool":0},"o1ZH5RnbcAFjiBuZkaE21Q":{"text":"Initially my fiancée and I stopped in for drinks at the 2nd floor bar after lunch. Drinks ","useful":0,"cool":0},"9i5LXGKc8U5nLPkAorsMcQ":{"text":"Exceptional service makes this NOLA establishment memorable and worth coming back to again","useful":0,"cool":0},"04bCGuXhS-W1xBvDjEfSww":{"text":"Since I was out at the Cabildo learning about our New Orleans Neighborhoods we thought a n","useful":0,"cool":0},"ZzG-G-lAms_T-GAWxLTQVQ":{"text":"I love this place ! It's beautiful and the staff is super attentive and friendly! This was","useful":0,"cool":0},"IeW3a4Lbm420IBJRDYG_rA":{"text":"Good! \n\nThe menu was good enough for a great selection. \n\nThe service was very kind but a ","useful":0,"cool":0},"5KW_E-v7zwDV_Pq5j1KJIw":{"text":"Stacy, our bartender at the upstairs bar, was amazing! Whether making a craft cocktail or ","useful":0,"cool":0},"SiNb29Lc2oFYuf47lcskwA":{"text":"Came for happy hour.  Can't beat the $5  cocktails.  We got a French75 and Aperol Spritz. ","useful":0,"cool":0},"NvHqlQuYxULfiNck3dUnEw":{"text":"Delicious food & wonderful service! They were packed so our only option was to eat at the ","useful":0,"cool":0},"LBrE6XfiuICCRjmRQB6HIg":{"text":"I can't really say enough good things about this restaurant.  The food is delicious and th","useful":0,"cool":1},"uRIKNF8rHiaGhH81AJKm1Q":{"text":"I had my wedding dinner here tonight and it was outstanding. The food was delicious and th","useful":0,"cool":0},"nmkUiCh-rjQdcy4iGdeWJg":{"text":"Definitely one of my new favorites in the French Quarter. Found it on Yelp, as we wanted t","useful":2,"cool":1},"UaYVABE-Vf-ZvjKZke7kNA":{"text":"Awesome dinner at Tableau. The service was great, the atmosphere is nice but not too fancy","useful":0,"cool":0},"hGfur3GAcP0cwi91lEm3GQ":{"text":"Excellent meal.  This restaurant was recommended by our tour guide, Rose.  We dined here a","useful":0,"cool":1},"u7AJn69PJiwhHSIGMQknNw":{"text":"Was looking for a late dinner at Tableau and they were incredible. Had the seafood curry w","useful":0,"cool":0},"iqaBND5E7u0e82bBDl8RSQ":{"text":"Alex at the bar makes one mean REAL Espresso Martini! Place is classy without being preten","useful":0,"cool":0},"-fvp-lH8xtVsrzZjm336RA":{"text":"The only reason for so many stars is the excellent food. Would give even less because of p","useful":0,"cool":0},"ZJnz7dC0sS4YoC9t7ltKyQ":{"text":"Really enjoyed the balcony view over looking Jackson Square! Happy Hour at this place I ha","useful":1,"cool":0},"IzaWC2UNU13TwF2LmYnt8g":{"text":"Delicious!!!! The redfish was amazing! It's more casual than some of the other Brennan res","useful":0,"cool":0},"Umk0hbvkidhgK0ftRQekbw":{"text":"It takes a considerable effort to annoy us enough to post a one star review but this place","useful":0,"cool":0},"FmBBl1spNRIkdz3MKfmUjQ":{"text":"This place sucks.  We just walked in.  It was empty.  They said they couldn't seat us.  We","useful":0,"cool":0},"f9v5vJMCVHDYPOdpv48CnQ":{"text":"5 stars to our lovely waitress Arne! But not to the lump crab meat served in a gravy dish ","useful":0,"cool":0},"EAW4JUYckXtWpu1eJzSiXA":{"text":"Food and service was excellent. Ricardo is a gem. He made the experience one my colleagues","useful":0,"cool":0},"1z_T6T9II7SYUQLd4xvYsw":{"text":"Yummy food in a beautiful environment with friendly staff.  And in the heart of the fun. W","useful":0,"cool":0},"F04KctefLELETrYbc5Huyw":{"text":"Simply WOW. The food, restaurant and service was top notch. No expense was spared and the ","useful":0,"cool":0},"dfRlAZMtqZtAbo956XAqNg":{"text":"A great choice for dinner in the heart of the French Quarter. just a block off Jackson Squ","useful":0,"cool":0},"Q5mW-KIPnZG-oJAjdE7aCg":{"text":"My friend and I came here for brunch while on vacation. We got to sit on the balcony that ","useful":0,"cool":0},"R0ZTYUXPE6IycXpVdCfX8w":{"text":"Service was terrible and food quality was low-medium. The experience in general was very p","useful":0,"cool":0},"rTjwpDvyZF1-fnL3U-ORrQ":{"text":"Best balcony in New Orleans! We sat on the balcony for afternoon drinks and enjoyed watchi","useful":0,"cool":0},"tRdFEg_IHfkit-qKetfGLg":{"text":"The service was excellent. I asked in reservation if I could have a seat with nice view an","useful":1,"cool":0},"FUefAm4d7_nroM0dDP2qwg":{"text":"I'm teetering on either really loving and respecting this establishment, or kind of hating","useful":2,"cool":1},"6F1PWjp-mAHJ3Oc5ozKVOg":{"text":"Everything was so tasty. I was not expecting this place to be so good. My steak was cooked","useful":0,"cool":0},"4tyvTz9Cn5AnXLHvz3Epeg":{"text":"We recently dined here one evening, for the first time. Nice atmosphere and very gracious ","useful":0,"cool":0},"Mo1rcjQC5u_yh6Kjq68pYA":{"text":"This was one of the best dinners I've ever had. We put that it was our anniversary and eve","useful":0,"cool":0},"Yi9Hu8uTqLA1NlFh8gdXIg":{"text":"I had the coolinary....OH MY GOSH!!!! Delicious!!!! Yesss!!!! I had a three course.meal an","useful":6,"cool":2},"R_-pEgVoCvbgH3U2URN5hQ":{"text":"Customer service: 3 stars: we came 7/22/17 for dessert only. The customer service was good","useful":1,"cool":0},"g_L0K_WWu2nWmBP-ClQDfg":{"text":"One of the most memorable dining experiences. \n\nMy boyfriend and I came on a Friday night,","useful":1,"cool":1},"4hhYvmSVjMxMnsBZlv9S7A":{"text":"Wow, wow, wow!! Such a good stop. A very lively, very educated staff and a wonderful meal ","useful":0,"cool":0},"41LrfA_So6ZyIh1uXQuEsw":{"text":"Popped in on a Friday afternoon for happy hour, had an out of town guest and we were in ne","useful":1,"cool":0},"eknI91QVxc82IdWBsBbkOw":{"text":"Let me paint you a picture. My lady and I were hungry and weary from strolling in the Orle","useful":0,"cool":0},"34s0jLj6R4nmpvXNzv9fAg":{"text":"Tableau is one of my favorite restaurants in the city!!!  Not only is Dickie Brennan and C","useful":0,"cool":0},"6ddUfBzpG4vQ_qVYlS-t5g":{"text":"Tableau continues to never disappoint, it one of the places we return to every time we vis","useful":0,"cool":0},"IaaBMpJhslzOwq2otk2pbQ":{"text":"Beautiful atmosphere, great service, great food. \n\nThe soup of the day, which was a vegan ","useful":1,"cool":1},"tlvgAhaL521h-YUHOI4XUQ":{"text":"While traveling for business, I found myself in New Orleans on a Saturday solo, which roya","useful":1,"cool":0},"yclg3tXY34yCImwtJxZ7mA":{"text":"The decor here was adorable.  The service was nice, however, it was slow at times consider","useful":1,"cool":0},"6CV-IDbPtOQ_XSEBPE2_7A":{"text":"I discovered Tableau the other day after visiting the outstanding National World War II mu","useful":4,"cool":2},"dUoks6EgS62HzG8OobcjJQ":{"text":"Such a disappointment. Came here solely because of excellent yelp reviews. Everything was ","useful":1,"cool":1},"BSho6vLN2lBitXFA6ZBt1Q":{"text":"We chose the Parlor at Tableau for our tiny New Years Eve wedding because of its charm, lo","useful":0,"cool":0},"SS1YJNFE7Epj6iqePwOb3A":{"text":"I don't leave reviews very often but had the worst experience at this restaurant while in ","useful":0,"cool":0},"pkpeIPv074xR9S6IzOFs_g":{"text":"Was looking for a late dinner at Tableau and they were incredible. Had the seafood curry w","useful":0,"cool":0},"V9wC4Roky1VKFoMi0DzK1Q":{"text":"Went for brunch on a Saturday. Food was good but service extremely slow.  Seems like waite","useful":0,"cool":1},"XQlogu9m0aGpksGVZkaa6A":{"text":"The food was amazing but the service was horrible. Such a shame for such amazing food. The","useful":0,"cool":0},"mOyFVZN2fbBy3D-cP4oKjw":{"text":"First time here. Came for my birthday brunch with a few friends. Unlimited mimosas. Great ","useful":0,"cool":0},"fx6Hc7nVsQqXX_RcTgXzOQ":{"text":"My friends and I came to Tableau for brunch on Saturday. We all got the bottomless mimosas","useful":0,"cool":0},"FfCbbOBBp4XWLECvYEde9A":{"text":"Will be back to try more cause we tried the Browned Butter Gnocchi & lost our appetite.  I","useful":8,"cool":2},"EpJ4kq9YROkswxjKr3OGNQ":{"text":"Fourteen of us (7 couples) took a trip to New Orleans to celebrate my birthday, one couple","useful":0,"cool":0},"UH2ZkeU5_iezIBeTqIJZ9w":{"text":"Came here with a very large group for a business dinner.  We had an upstairs room reserved","useful":1,"cool":1},"kj6-Y3dd4NunFHIj_oCN6A":{"text":"Honestly amazing service and Ricardo legit is the best waiter I have ever had. Food is ama","useful":0,"cool":0},"18x2GNJlVhLaWYF1mqYvQQ":{"text":"Came here visiting from Miami. The truffle crab claws and oysters are amazing. I hope ever","useful":0,"cool":0},"pdLJAb2D42MT9GuoRw7iaQ":{"text":"OMG Great food and service. Ricardo was fabulous.  His suggestions were spot on. Lovely lu","useful":0,"cool":0},"S16BfDW2kE438zv5jbcT7Q":{"text":"My husband and I were in New Orleans for one night and, after reading Yelp reviews, decide","useful":10,"cool":6},"4aYfiURn3re869-EVYc9cA":{"text":"Whew!!! I had a blast at Tableau. The BBQ shrimp and grits were out of this world. I was o","useful":4,"cool":2},"wcNS5q8JgntlUXhGsktoXg":{"text":"My first meal of 2020 was at Tableau and it did not disappoint. This upscale spot near Jac","useful":0,"cool":0},"fctM2twB7frY3WK2eu7SDA":{"text":"We loved the ambiance of the restaurant. Very very comfortable and nice. Food was deliciou","useful":0,"cool":0},"DCqIPFlDCHiZQyV1epMW9A":{"text":"Sat on balcony in early Oct for a birthday celebration.  Very good service and super varie","useful":0,"cool":0},"FFLsLlhBnp570FS5EMHRQA":{"text":"The food is absolutely sublime. Extremely affordable for a high-end restaurant. The staff ","useful":0,"cool":0},"hjd_00G-MOjKMmA94Dmwyg":{"text":"Maybe 4* was generous....\n\nWe went for my birthday. Staff was so kind and friendly. They p","useful":0,"cool":0},"tNy2aAzrU_p9zxoC0P8t3g":{"text":"Amazing place and if you can get a table on balcony do it. Such a unique place with a view","useful":0,"cool":0},"1zgZ8V3JsYq7-Lvt5y-cuQ":{"text":"Fabulous food, menu and service. They listened to my wants for the meal and made sure they","useful":0,"cool":0},"rtC4l2RfTl795k40gU_yvQ":{"text":"I can only speak for drinks and dessert but I would recommend this place for those hands d","useful":0,"cool":0},"oPldVmtUMLiOpjbpi0-YPg":{"text":"What a great place for a lively lunch/brunch with great street views from both inside and ","useful":0,"cool":0},"Ep3Ki7T46aHVDXRn0KQ8cQ":{"text":"This was our first time visiting NOLA with my family. We have heard great things about Tab","useful":0,"cool":0},"ZP1qW6gGrtxwOScjYaqyvg":{"text":"Never disappoints!\n\nI've been to Tableau every time I come to NOLA and they are wonderful!","useful":0,"cool":0},"AFzy5FGB5Lx-9B7OhQR27A":{"text":"Two words to start with: Unlimited mimosas!!! The ambience on the upper deck on a pretty s","useful":1,"cool":0},"U6F9UAv_KTI053w7L4zFMw":{"text":"This is a very beautiful restaurant right in the quarter off Jackson Square Park. \n\nIf you","useful":12,"cool":13},"FidhHx3f5OtXPzwZAOlV3A":{"text":"You can't beat the location, especially if you get to dine in the balcony which overlooks ","useful":1,"cool":1},"eDcouBXZoGIaa71Xu-NnqQ":{"text":"Staff was amazing! Food was mediocre, dessert brownie saved my night. I was happy the numb","useful":0,"cool":0},"BgZTc42wUHHguxMeuMqgxA":{"text":"Beautiful spot next to Jackson Square to dine in.  We had a wonderful waitress to take car","useful":0,"cool":0},"5WQOfQb2yPzSSw-MntDZpw":{"text":"We had dinner here last night and it was divine. The food was incredible as was the servic","useful":0,"cool":0},"kAv64bCwRKKd5CxvWweWAQ":{"text":"Tableau is such a classic New Orleans restaurant in an incredible location. It was a perfe","useful":0,"cool":0},"Cv_3p_MH7DI4ld6S5Gqq3Q":{"text":"We came on a Friday night and it was not busy. We have no idea who our server was, or even","useful":0,"cool":0},"dx-tyyA58-GlYJAxvSRrNQ":{"text":"Service was meh.  Drinks and food were pretty good.  Kind of overpriced.  It was ok.  The ","useful":0,"cool":0},"ngQVlVKYRxjWddQN-ec8_g":{"text":"Dinner at Tableau was an incomparable experience. The friend I was dining with was an old ","useful":1,"cool":0},"xjUegPOX60SKSUQ1fWDuqw":{"text":"Well, Tableau does it AGAIN!! They NEVER fail to deliver! Not only does Tableau's staff an","useful":0,"cool":0},"w1s-sYiK7SIkrmHw6xNDWg":{"text":"I met up with my sister here for lunch  . When you first walk in it's very nicely decorate","useful":4,"cool":6},"QfCd1Nx6uDjCmJ9ghl_uXQ":{"text":"Great balcony view with exceptional service. One of the only places to go near Jackson squ","useful":1,"cool":0},"ne9AVVjIpK_Yc14UFmBuOg":{"text":"Terrible attitudes when we walked in at 5:20 interested in their Happy Hour (which is list","useful":1,"cool":0},"i88faHn0ihLyhRbDssnUTA":{"text":"Meh. Highly expected a better experience. Food not fuel. Service was confused and not orga","useful":0,"cool":0},"dQy1AT8GFtL885hQT2ATTw":{"text":"I went back for a second time last week and give it five stars now. Sit in the upstairs ba","useful":0,"cool":0},"OA-c_yegDS-VNLD7LffLQA":{"text":"We had the best food, service, and views for brunch!! Ricardo and Ashley were so friendly ","useful":0,"cool":0},"q-88MuPgWHb818GdqN3_PQ":{"text":"Top place on my list if you're looking for a fine dining restaurant. It's close to Jackson","useful":1,"cool":0},"wkcjHC5q2xPvrYlDgtgCmw":{"text":"This restaurant was so good we can back twice in the same trip. The menu was enticing, and","useful":0,"cool":0},"n1nf88lxL9fYju8wx9Bf-A":{"text":"I'm a local, so I had an idea of what to expect from a Brennan's restaurant.  I wanted to ","useful":6,"cool":2},"As8XjMasqdle2upBiZXqUA":{"text":"I don't even know where to start with tableau. The ambiance is very chill. We sat outside ","useful":1,"cool":1},"V5FEkN7HHclYuPrxaqQl_Q":{"text":"I have been in New Orleans for 5 days and Tableau has been the best meal I've had since ar","useful":0,"cool":0},"c3J8xK_IxcjyKWSGsMkzCw":{"text":"One of my favorite restaurants in the entire city. From food, service, to atmosphere, this","useful":1,"cool":0},"7qlwnklntCTW1wt_ef4E8g":{"text":"11/26/17\n\nWalking by, looking through the large and crystal clear glass windows, you might","useful":49,"cool":44},"4UVatHEJ_VmycXkop8363w":{"text":"Tableau is absolutely wonderful. From service to specialty drinks, they can't be matched. ","useful":0,"cool":0},"FhidyRlgJXxzCh4Drdp4Yg":{"text":"This place is absolutely phenomenal! If you're in the area, you NEED to try Tableau. \n\nWe ","useful":2,"cool":2},"kiW9xWHDajkRSHw9dX-oYg":{"text":"This is a special place that takes good care of its customers. My husband and I have been ","useful":0,"cool":0},"8LeL-wfbBwaxaHcdhuCagw":{"text":"So many great places to chose from in NOLA. Don't waist your time here. We arrived and wen","useful":0,"cool":0},"yKvDZYqEiMFI7Cu6bOmeTw":{"text":"The food was AMAZING, and we loved the jazz band that came around and sang us personal son","useful":0,"cool":0},"C2jgt1P1iQzRadU0jPJdHg":{"text":"I started with the turtle soup. I didn't really expect to like it but decided to try it be","useful":0,"cool":0},"58biT6zkF_aa9a417nfSNg":{"text":"I am a local French Quarter business owner and met a friend for a drink at Tableau's bar t","useful":0,"cool":0},"QCngAUF33TI-Jg5MXytgPw":{"text":"Wonderful lunch at Tableau!  Outside in the upstairs balcony.  Friendly staff and prompt s","useful":0,"cool":0},"YR6uda_bljLlvqO3EbXO4A":{"text":"If you want the best Louisiana Resturant in New Orleans, this is the place.  We are native","useful":1,"cool":0},"GE6X8GFHzFqsKh5g-zsyrA":{"text":"Start with the French Onion Soup-it had a rich dark broth and lots of cheese -the flavor w","useful":1,"cool":1},"lTzj2m0mNsSls-9SulNGkA":{"text":"Extremely disappointed! We were looking forward to trying this restaurant as most of the r","useful":0,"cool":0},"B7fwtv7BCx_y_ucDbZPUxA":{"text":"Honestly, I was so excited to eat here with my girlfriend for our anniversary but we were ","useful":0,"cool":0},"fjwFwXBK7oPazMqU0fLC7g":{"text":"Stop right now and bookmark this place! Evenings are busy, so open table or call to make a","useful":2,"cool":2},"XG9FgiIW6oYDWIL8LtO18A":{"text":"What a great dining experience here! I encourage anyone visiting New Orleans, or even loca","useful":1,"cool":1},"6ErPvOy2_afrgeLDjSBMiQ":{"text":"Worst service for a large party I've ever experienced, and they still added a 20% tip. Wou","useful":5,"cool":1},"CvXMCOC_8blYWDe2h-49YQ":{"text":"Mya was amazing! She knew everything about the menu and what paired with the food that we ","useful":0,"cool":0},"5JcqCo3i4-9iJ26SeDu0Cw":{"text":"Sadly, this restaurant does not live up to all the hype. We had a large group of seven. I ","useful":0,"cool":0},"5pfZGT6yU0UvW9aG-Mnqbw":{"text":"We went caroling in Jackson Square with a plan to eat at Tableau after. We arrived a littl","useful":0,"cool":0},"aaGUuJUQEu02Yr0BQwKITA":{"text":"Without a doubt I stumbled on an great gem while walking around the french quarters. The r","useful":1,"cool":0},"zsBpoLMRiVSMPVux9Js3gw":{"text":"Tableau was amazing!!!!! We went for what we thought would be a quick lunch but ending up ","useful":1,"cool":0},"TZeOTrmJW_9r6YZo2cxP1Q":{"text":"Tableau is another Dickie Brennan restaurant that just doesn't cut it - if you judge by th","useful":0,"cool":0},"JIsdruzyZ73I8KvNVBhAcg":{"text":"Amazing spot! The food, the service, brunch brass band. All amazing! We had the shrimp and","useful":1,"cool":0},"apEqreXr5rDpXFri-NR6kA":{"text":"My first review ever. I've never been inspired to write, but after such a negative experie","useful":0,"cool":0},"48zPhubngneKR2RPTC5Szw":{"text":"Great food, people here really care about what they offer, whether drink or food. Best gum","useful":0,"cool":0},"TqsnJYh93-_Qes0nkkOVaQ":{"text":"We sat on the upper balcony, the server was awesome, unlimited coffee refills, duck confit","useful":0,"cool":0},"YUuNF3xgWloGNnQSMBK03Q":{"text":"My husband and I had dinner here our first night in New Orleans and we had a fabulous expe","useful":0,"cool":0},"8fx9rv6dpzAsSLyv-4JJfw":{"text":"The best onion soup I ever had. The staff is really friendly and it's a nice place. I woul","useful":1,"cool":0},"daGwivNKcfGV07pae3EMoQ":{"text":"We had a wonderful time at Tableau while in New Orleans celebrating our friend's bachelore","useful":0,"cool":0},"icebyBh8259CJe5hQfuQ4w":{"text":"Been wanting to eat at Tableau awhile now, my sister came to town from California so I too","useful":0,"cool":0},"cI3M1RYy8HX45nrowE0pXQ":{"text":"THE SAVIOR OF LE PETIT! A total win/win for the city;\nBRIGHT AIRY & HISTORICALLY DETAILED,","useful":4,"cool":0},"koENGOEnqBK75zr4M_KU0Q":{"text":"How disappointing. \n\nMade reservations for the patio and got sat under a broken umbrella. ","useful":2,"cool":0},"hJu_xhfH7vPAMuri3_FNVw":{"text":"Our food was above average, but our service was not. Out of bread, really? We saw bread de","useful":0,"cool":0},"79tIMvjy7_2BLOgQ-3U5Eg":{"text":"We found this place by asking a local what their favorite place to eat was! We're so glad ","useful":0,"cool":0},"tzAoYJ27wVqwQOdhDcmfBw":{"text":"This place has great food and ambiance. The service was great and we had a relaxing time h","useful":1,"cool":0},"98ot4DfiPTH8OMpirHIH5Q":{"text":"We had a great time eating in New Orleans this weekend! All of the restaurants we booked w","useful":0,"cool":0},"ynwj5voc3O4VQvp_rEd-IA":{"text":"This beautiful restaurant is located right where all the craziness seems to be happening i","useful":0,"cool":0},"9LOb5xDNPrQbgQPmyd41iw":{"text":"Incredible restaurant near Jackson Square with a wonderful outdoor balcony seating and ama","useful":2,"cool":3},"IT609kqM9ODoRAFgXyZGMA":{"text":"Completely underwhelmed my expectations. Everyone raved about this place and everything wa","useful":1,"cool":0},"r2AoMmem6BlVxv94u1tNUA":{"text":"A girlfriend and I decided to enjoy Sunday brunch at Tableau, though brunch is offered eve","useful":4,"cool":4},"pJj6u9yebt8pmmr2cIu8HQ":{"text":"WOW! My friends and I did a quick search and remembered we'd wanted to do brunch here...so","useful":0,"cool":0},"6AgLAe0lrSDPrQOJgIdx-w":{"text":"I am shocked there are not more reviews for this restaurant. This is literally the best di","useful":0,"cool":0},"CoBMvAqjEycFbQwXr_5xWg":{"text":"My wife and I had an amazing experience here at Tableau. Ricardo delivered far and beyond ","useful":0,"cool":0},"Tb17eBfFbh_Fpg_jXIYADQ":{"text":"Went for brunch, and the jazz band was lovely and very \"New Orleans\". However, it too expe","useful":0,"cool":0},"gpCIxTEsTJNJuI4om54nhw":{"text":"We were waited on by two excellent waiters, Ricardo made amazing recommendations!! The foo","useful":0,"cool":0},"_guEK1R04zYHb4es8wFIhQ":{"text":"Had A group Valentine's Day dinner there while we were in town for the weekend. They were ","useful":0,"cool":0},"0S2gkO_IcKs2WVoQ4_nhXA":{"text":"This place has a nice location right next to the cabildo and the service was great! The fo","useful":1,"cool":0},"S3FGclYTK7ey5-MaQe9pqg":{"text":"Our first time to visit this place but was well worth it, and we know Nola!  Food was exce","useful":0,"cool":0},"q2MrqGDpfXV1QvprX058TA":{"text":"We had a fantastic experience here! Ricardo was our server and was absolutely amazing. Bes","useful":0,"cool":0},"IkIlg_5myartFhBk--ejiQ":{"text":"What a great little place this restaurant was. If you enjoy great seafood really good atmo","useful":1,"cool":1},"CC8AgfB3OpsmcOUdsU85Jg":{"text":"I'm we were very disappointed in the 5% service charge for \"COVID\". Really?  All fees shou","useful":2,"cool":0},"6L_xbFb4Y-rlKMENOi6SFg":{"text":"THIS IS A MUST! True authentic New Orleans experience. I recommend to sit on the balcony. ","useful":0,"cool":0},"1W0adWPJsZqdF_GtLgig_g":{"text":"Had lunch here at the referral of a friend, where the description was \"they treat you like","useful":0,"cool":0},"hO9u4dVjBm0hLhsCPlQQjg":{"text":"I have been meaning to write a review for this place as we had an amazing time here. It wa","useful":0,"cool":0},"JY9vWl13NJ2NxX6GdCvYww":{"text":"We wandered down to Tableau because we wanted to sit on a balcony overlooking the square w","useful":0,"cool":0},"lqY52O6THg4oK1v_KeE9gg":{"text":"In town with a group of girlfriends celebrating one of their birthdays. Came across this p","useful":6,"cool":2},"KDLUESIBqIPoQHO-GqRVRQ":{"text":"We made a reservation here for a girlfriend date before a play. Neither of us had been bef","useful":2,"cool":0},"QTJRg-kdR-fX28JDpNw6Fw":{"text":"Huge NO THANK YOU!  I've never seen antics like this from a waitstaff.  No interest at all","useful":1,"cool":0},"vRW28-Gmnmj075JefdKYsQ":{"text":"Loved this restaurant - food is quality and we recommend asking for Ricardo! He will make ","useful":0,"cool":0},"SC5560urerqE9Qed9MLWTw":{"text":"Was recommended this place and it did not disappoint. One of the Brennan's restaurants and","useful":1,"cool":0},"Nn49e0gtw330Ms77UbYp_g":{"text":"An upscale restaurant with pricy and decent food. We had the crab claws as suggested by ot","useful":0,"cool":0},"70fE2xwzj3AsCJHRR-Yb1A":{"text":"Worst meal I had while vacationing in New Orleans.  I ordered the bbq shrimp & grits think","useful":0,"cool":0},"5_2ACd-qpMpsgzhfNb7tiA":{"text":"We had the BEST experience here! It was definitely a main highlight of our trip. The food ","useful":0,"cool":0},"SHGVN20O2G49ehj4QK4YYQ":{"text":"Dined here on a recommendation of a coworker. Arrived early for my reservation so I sat at","useful":0,"cool":0},"sKoFqmiHo1yQAA-VxxMOFw":{"text":"Dined here with about 35 coworkers. Had the entire back room to ourselves and it was BEAUT","useful":2,"cool":1},"7Ky8OWSbwiEkCqikJdJlqQ":{"text":"This eating experience was such a treat! I had the roasted duck with gnocchi and it was de","useful":0,"cool":0},"FwTaunSNiNuQsImtKoGgMA":{"text":"The best part of our experience was the setting.  We had a table for two on the balcony ov","useful":8,"cool":6},"tn9YgT7swTFGpx2Ff54HqQ":{"text":"GOOD FOR SMALL PLATES BUT NOT ENTRÉES\nRule of Thumb: all items earlier in the day under $2","useful":5,"cool":3},"-O_mWD2XHXwefJ2SVnhM7Q":{"text":"Very average decent French restaurant, nothing to write home about. The other places we tr","useful":1,"cool":0},"G3L7-LCpj8fZuNXRo3Xo6g":{"text":"LUNCHEON SPECIALS: 2 course soup & salads $14-$17; po boys & frites $12-$17!\nTRADITIONAL \"","useful":5,"cool":0},"5fHHae4JYOF7_GzVlPWzcg":{"text":"This place is a nice upscale Cajun/typical New Orleans cuisine. Came here a few weeks back","useful":0,"cool":0},"kBVL-UsKuxJvWpx0z73ShA":{"text":"We had the most beautiful romantic dinner on their upstairs balcony while live music playe","useful":0,"cool":0},"yG21hZ6hGEjO7_YrDQYNgA":{"text":"Brunch was delicious and our waiter Ricardo made the experience excellent with his attenti","useful":0,"cool":0},"5Cc0c_5zGm4nuNafrKaL8A":{"text":"The food was really good......when I finally got to eat it after waiting for over 50 minut","useful":0,"cool":0},"nw3i8hLBBtxJuC5gg4totg":{"text":"We came here for the reveillon menu, so this is basically a reveillon dinner review.\n\nFor ","useful":17,"cool":11},"x8uVjPVL219E-P3k1zA4rQ":{"text":"Seated quickly and staff was quick to service. Soft bread with whipped butter was deliciou","useful":0,"cool":0},"-6Ullw-DGUPMnYAaKC-ZTg":{"text":"Ordered from a tasting menu they had available and it was one of the most elegant and deli","useful":1,"cool":0},"NoAu06SHC1tVR61HXixZeA":{"text":"Tableau is a fine dining restaurant in the middle of the French Quarter that is always an ","useful":0,"cool":0},"RiLBCr5a1KzVHUHGR6sTbA":{"text":"BEST FILET EVER! Spiced & seasoned oh so well!  Ambiance was great too! Great for a nicer ","useful":0,"cool":0},"l7c-gStY6VIWLNv5ysYhAA":{"text":"If i could give them 10 stars i would! Visited Tableau with my mom and had the best experi","useful":0,"cool":0},"sFCQMhDUjySip5WatOJmhQ":{"text":"The food was delicious,  the band playiing tableside were all so talented. But what really","useful":0,"cool":0},"sbykyzxFIS0wYiuNHgAT2A":{"text":"The wait staff was very kind and attentive.  My pork chop and drink were amazing! I would ","useful":0,"cool":0},"iVLcrGShHkLL64N-7qWYiQ":{"text":"Well Dickie Brennan finally got it right. We canceled our reservation for 16 at the Court ","useful":0,"cool":0},"QOpMevoeP8X_rQlLyEzUkw":{"text":"There was a bit of a wait but it was well worth it.  We needed a break from the traditiona","useful":2,"cool":1},"J3-nnXILOWhrPpn8CpFv_A":{"text":"Tableau was an amazing experience. From the food to the wine to the service.  Ricardo and ","useful":0,"cool":0},"pX-XlgmQZpvZFA4tO34Xvw":{"text":"Appetizers were awesome! However/ the risotto is tasteless along with the lamb. Service wa","useful":0,"cool":0},"JPnR7p1lmz17pWEisG8NBg":{"text":"We stopped in here for happy hour. We ordered a beer and 2 French 75's and a wedge salad. ","useful":0,"cool":0},"70Wpyijs7QUD6cql-3eU4g":{"text":"We only went for cocktails and dessert but can't wait to return for dinner. I'm kicking my","useful":0,"cool":0},"H_J6AMDVpjGG3GReb7gfug":{"text":"Our entrees never came out of the kitchen before we had to leave to get to the airport.  W","useful":0,"cool":0},"iwRJwQeOCDQe1ZzaO9zlXg":{"text":"Visited this place today and were luckily seated within 5 minutes. The restaurant has a ni","useful":0,"cool":0},"LioxAoFeU87f3vaueH3q-A":{"text":"Really enjoyed the experience with a great view from the second floor balcony, and a very ","useful":0,"cool":0},"8cqzCBo2_AkDx4G4mge5Rw":{"text":"So, We live in the neighborhood so we eat here frequently. Today we walked in for a reserv","useful":0,"cool":0},"l2zgYe9Qum9XD5gTe7lbfw":{"text":"Great atmosphere! Great drinks! Did not enjoy my burger as much as I anticipated. Thought ","useful":0,"cool":0},"g5GN8pF1f5O-HM8lX_7G_A":{"text":"Sat on their balcony on a Saturday night and loved it! I highly recommend the redfish and ","useful":0,"cool":0},"VPMS9IIW7kuYqH1_nTZhQg":{"text":"Really liked the atmosphere and the food. Oysters yummy. Great place to have brunch at the","useful":0,"cool":0},"nMZBkxLd7C3CC1PSQme0jQ":{"text":"Not very happy with the amount of time it took to get helped and served. And honestly it's","useful":0,"cool":0},"wJQFNOZWmxWEmFHRD5BJxw":{"text":"Do not go to this place! The staff are incredibly rude, we had a reservation and was told ","useful":0,"cool":0},"DtLMtuAHRQDpMhlZBg0DQg":{"text":"Shrimp & Grits and the Chicken Breast plate!  I kept stealing the fried chicken from my hu","useful":0,"cool":0},"Min7C47lr7IcCQRRJiNApA":{"text":"The ambiance was very nice. It felt like you were in someones home, grand, tasteful and in","useful":0,"cool":0},"dS29mmh-fnyYs-0ZVlui3A":{"text":"This is a review for Tomas, one of the servers here. When he found out that I wasn't enjoy","useful":0,"cool":0},"znDJEZeSlsqZunzS7UoRjw":{"text":"We were just headed for the plaza, to go see some street art and hear some music when we n","useful":7,"cool":6},"nDrutLCIBwMrXc5-vchEiw":{"text":"Located right next to St. Louis Cathedral. \n\nI came here during happy hour during the week","useful":5,"cool":3},"kbZBPto9qscVY01MfjJYTg":{"text":"I've looked at this restaurant before and decided to give it a try this trip.  It didn't d","useful":0,"cool":0},"RGALmXOMNEWAfJFI8E9CaA":{"text":"Bottomless mimosas- very slow service, but if you flag them down enough, they'll get the h","useful":1,"cool":1},"zVoYOmwTjocfLWdTZC4fiA":{"text":"I ate here two years ago on a girls trip to NOLA and had the best experience, so when my h","useful":0,"cool":0},"GBEs5wolXA7CY_rU_xrDHQ":{"text":"I went to Tableau for a rehearsal dinner with a prix fixe menu, so I did not get the full ","useful":0,"cool":0},"khXdhtu9SYOY-LLL132-zw":{"text":"We found this place on a food tour of NOLA.  It's a Dickie Brennan's restaurant so you hav","useful":0,"cool":0},"F7i6lZKKSSPnVeJhswEaSQ":{"text":"Loved our evening here! The food was really good. But the best part was the staff. Everyon","useful":1,"cool":0},"To7-KrJAn1_t_2W0or6EPw":{"text":"Seated right away ..thought there was a dress code . However, people coming in sloppy drun","useful":0,"cool":0},"64laWPqs0wPd1Nw3gLpC4Q":{"text":"I promised the GM of this place that I would write them a review of my horrible experience","useful":0,"cool":0},"zrYKkt_sub5EdppeGGp3OQ":{"text":"Had dinner here while in New Orleans for business. The food was OK. I had the barbecue shr","useful":0,"cool":0},"PrMXClcpxt-tT7rznyjE-Q":{"text":"GREAT food in a cool location but not the biggest portions..I got the redfish dish and ohh","useful":1,"cool":0},"gnPCzEaLPhrQU5I8BSacdA":{"text":"Bottomless mimosas are hard to beat! \nThis is honestly the best service I've ever had and ","useful":0,"cool":0},"2-SvsLH8xySL4dTx-It3sw":{"text":"We had reservations for our Annual Couples Christmas get-together here in the wine room. T","useful":0,"cool":0},"qGGsbRlZAIdXRTHI0yUyFA":{"text":"Event though Tableau is in the tourist area, it is not a tourist trap.  The traditional Ne","useful":0,"cool":1},"ehb9ZOlbaRbXMgd4BVM4fg":{"text":"Food, service, ambiance and the bartender Derek had great conversation. Would highly recom","useful":0,"cool":0},"_v4BWlD_bdTKMUkt0CoNrw":{"text":"I have visited New Orleans many time and I know the bar is high here for great food and mu","useful":0,"cool":0},"-WNMgJENeikYWaIGWHbH7Q":{"text":"Amazing food with the best staff, management and beyond the best chef!!! Highly recommend ","useful":0,"cool":0},"0fjRlEvvDLqI9B5pNVpcPw":{"text":"Ohhhh. I had no idea I would love this place this much. We were in the neighborhood and de","useful":0,"cool":0},"Wf2em8jDCpkpHwBEGQ7o9Q":{"text":"Sometimes despite the best of intentions you end up dining at a tourist trap. And perhaps ","useful":2,"cool":0},"jbAHMtQff_wm8Px-ZfrPaA":{"text":"A friend of ours was in New Orleans on business while we were vacationing.  He grew up in ","useful":2,"cool":2},"ABSN7FbzIJgcrXGAIU6m2w":{"text":"Tableau came highly recommend for my trip to New Orleans but I couldn't have been more dis","useful":4,"cool":0},"DddGC-Z5j2MsABHPU-TeRQ":{"text":"Three friends and I had a great meal there last night. We each had a different entree (duc","useful":0,"cool":0},"-lzG44b_Chk_KCFB74Uqug":{"text":"This meal was amazing. Hands down. Full stop. My mother and I come to NOLA regularly and d","useful":0,"cool":0},"xN0gxiC4FyauFIp1c4Uiew":{"text":"Nice old fashion historic place of New Orleans French Quarters.  Very nostalgic has that o","useful":0,"cool":0},"yRwogHWCnPSdAhQ_vGgtUg":{"text":"After an 8 hour drive, my Mother and I finally arrived in New Orleans ready to wine and di","useful":0,"cool":0},"HrGFN1E9UDW-tM5pVW6Dtg":{"text":"We came here intending on sitting outside on the balcony, but with the weather we sat insi","useful":0,"cool":1},"rODdIuuheYkbsfWb3F_0CA":{"text":"Amazing food!! Great view and service. Me and my girl wanted to treat ourselves to a nice ","useful":0,"cool":0},"p5y42ckLCwxHsiPcWUDNdA":{"text":"Came here for dinner on a recent trip to NOLA. Wow, I was so impressed! The food was absol","useful":0,"cool":0},"lfkJTemvyDqASq9FKI_MBQ":{"text":"Possibly the worst experience I've ever had. Bottle of wine took 20 min. Dinner took over ","useful":0,"cool":0},"Qykfa30jpWDkVb3Dk2nW5w":{"text":"my first time ever here at tableau! it was for a friends birthday and the second we walked","useful":1,"cool":1},"wrXBJ2Rm3R6MKrSGLpvjWw":{"text":"This was highly recommended for friends.  We arrived at our reservation time!and was seate","useful":0,"cool":0},"x8IrYgeAE39_EyneX7u-6Q":{"text":"Excellent place. Our server Ricardo was amazing. He definitely deserve a promotion. Can't ","useful":0,"cool":0},"7M5lspXHWnCA3gr3T1jK5Q":{"text":"Great quality food , service and atmosphere!  I will keep coming back definitely. \n I orde","useful":0,"cool":0},"N99v6vmNlGHdC-O4J1ahVA":{"text":"Went here for my birthday dinner and loved the ambiance and service. The garlic gnocchi, c","useful":1,"cool":1},"tKDiLFT3UT_QP96o_A_SGQ":{"text":"Wandered in to this restaurant at the corner of Jackson Square.  Surprisingly uncrowded ea","useful":0,"cool":0},"e5Fnm2LLV576_p-LBQ3nog":{"text":"2nd time coming. The music, mimosas and food are just amazing! Kristie was beyond helpful ","useful":0,"cool":0},"XYgzwSMbwfWQK9G48UOdUg":{"text":"The best experience my wife and I have ever had dining out.  We arrive to menus on our tab","useful":0,"cool":0},"GIc5KPYh8Cm3jVYJS87Uew":{"text":"Jewell was the best server I've ever had!!! The food, drinks, and atmosphere were spot on.","useful":0,"cool":0},"vELOgGcMiivTWvy0v8RaRA":{"text":"Love the food and the service! Ricardo was very attentive ! He suggested many things to us","useful":0,"cool":0},"eo9fvRAaRRzyX_5IPYS0ew":{"text":"We stumbled across Tableau and read the brunch menu outside. Sounded good so we went in. T","useful":0,"cool":0},"sep12OW9CS8_WlmXzNhYxw":{"text":"Tomas and his wait staff are a dream.  The epitome of excellent service.  Tomas is in his ","useful":0,"cool":0},"-4ir7tKnq-_MEgg-GmaDdg":{"text":"A fancy dining establishment with a lovely courtyard. It's located smack dab in the middle","useful":0,"cool":0},"6HTSIFCqfELtw-bzb1fpVQ":{"text":"The Dickie Brennan restaurants run different shades of Good. Tableau is their A game. Amaz","useful":7,"cool":7},"J5eCmc1QrF-ZnD-ydgizJg":{"text":"Good cream brûlée that's for sure. But I was disappointed because they serve it on the pla","useful":1,"cool":0},"f-COgOAPlDtZadvEwryLmQ":{"text":"Amazing service, yummy food and great cocktails. Made reservations for a party of 14 adult","useful":0,"cool":0},"sC31pgKSNx_QAtHXZBWRXA":{"text":"The best food in NOLA!! The service was incredible and the patio seating was beautiful!! W","useful":0,"cool":0},"kXj9WxP6n4nDrmg4IQRD7g":{"text":"Truffled crab claws literally taste like crabs in cold Italian  dressing. The food was sat","useful":0,"cool":0},"T7Fs5W6zthO4viKU7sJbzw":{"text":"It was suggested that I go to Tableau and enjoy the upstairs patio.  There was a 45 minute","useful":0,"cool":0},"CzeQckJLUjB-wtamQ8g__w":{"text":"This place definitely gives you the NOLA experience. Lots of people watching, brass band p","useful":2,"cool":2},"-YZjHgTtNtFSG_IUykAVnQ":{"text":"Food were good. Service were ok. We had two girls who took care of our group but seemed to","useful":2,"cool":1},"ghgIakjE5q2Xh6AiVdF_VQ":{"text":"The food was fantastic, the atmosphere very NOLA and super charming. Ricardo was our waite","useful":0,"cool":0},"dI1N06xvaf4SkAFkK51CBg":{"text":"The cocktails were delicious, and I enjoyed their soup du jour quite well. Most beautiful ","useful":1,"cool":0},"NjYxFEDjHTE6SCns8tyk0A":{"text":"Came here with a group of 10 people during our last night in New Orleans. We made a reserv","useful":0,"cool":0},"rqVtkRS8TZJR4gDBuC2MPA":{"text":"Wonderful meal in a an exceptional environment with knowledgeable and friendly staff. Rica","useful":0,"cool":0},"leqMSUbNAmj5pxq0-ToOng":{"text":"My husband and I stopped by here during a shift change. The host could not have been nicer","useful":2,"cool":1},"Humd0iKft_mJQsFSEOXG2A":{"text":"Took my parents out for a nice dinner at Tableau and everyone throughly enjoyed it!!!  Def","useful":1,"cool":0},"DGA_FcEEUlQkZwagnNoxbg":{"text":"They made my husband's birthday special by giving him a hat, his own menu signed by the st","useful":0,"cool":0},"LkeiXaYbMPh_iBqxa3tJVA":{"text":"The brunch here on Saturday mornings is fantastic and the prices are actually quite reason","useful":0,"cool":0},"6WgR9v4hQZt32Kw_KKbilg":{"text":"Our last evening in NOLA for a 4 day getaway we wanted to eat on a balcony for scenery, an","useful":0,"cool":0},"MrF5eynRa3qOIAB3V-o_sg":{"text":"Kicking myself for not having any pics here!  \n\nLooking for something chill and low key on","useful":0,"cool":0},"jFhG1YXhJ3_LGeQOjaUmoQ":{"text":"Wow.. Where do I begin??   It's times like this when I wish there was a negative rating.  ","useful":16,"cool":9},"LugUuwq2b2FsQ00gxQmTfw":{"text":"I had lunch for one at this place and it was quite enjoyable. I had the chicken since I wa","useful":0,"cool":0},"RvE6Gwyl9riJcXMYdx-i7w":{"text":"The Shrimp Remoulade was excellent..perfect pickled relish, crispy lettuce and yummy gulf ","useful":0,"cool":1},"nHtwmbvrPZlCW6h-YSv0eg":{"text":"Was looking forward to a wonderful meal. Have eaten at many Brennan's restaurants but this","useful":0,"cool":0},"_FNIx74cO8lKMftczYblUQ":{"text":"Still great. We came here a little over a year ago for brunch and decided to do it again. ","useful":1,"cool":0},"woudWWyj1xvo2y33CYGLlA":{"text":"They took every advantage on the wine side. They did not have the wine on their list and t","useful":0,"cool":0},"mVUhDuSBV8EG2niIljPKxA":{"text":"This place was delightful! Super cozy and luxurious feeling inside, service was outstandin","useful":1,"cool":0},"loVBrVkLM1In42tVttthQg":{"text":"Nice recovery from getting off on the wrong foot with a reservation snafu.  Food was good ","useful":0,"cool":0},"9I0Pqqi-xywK9py77VpXow":{"text":"Arrived 12:50, asked to see menu (were shown brunch menu), then put our name in for balcon","useful":0,"cool":0},"pUY2m2N0JZxQOcTWtNNLZg":{"text":"Risotto was incredibly bland. Wait staff was pushy and kept trying to upsell us. Would not","useful":0,"cool":0},"IA9xnVgKlw78O_q7uPs3vg":{"text":"I've been here 2 times in the last week. The front desk Gent Stanson is Awesome! Such a ki","useful":1,"cool":1},"53ccKjnAcIOJwNoShtxX3Q":{"text":"Found this gem on open table and OMG was this place amazing!! The service by Jewell was fa","useful":0,"cool":0},"69YS_9vaoT4i0IVL1tmGvA":{"text":"My wife and I visit Nola a few times a year and this will now be a place we come every tim","useful":0,"cool":0},"SzVdYUmPy4KF1hK-SE-3Jw":{"text":"Very disappointing for a Brennan family restaurant! After a fantastic dinner at Commander'","useful":0,"cool":0},"7aqTbtvaAMzM_V60GbWqfQ":{"text":"We waited an hour and still didn't get the food we ordered. Paid for our drinks and left.\n","useful":0,"cool":0},"7hGQ0bmM5N0XV0MYrrpFDQ":{"text":"Restaurant hopping with a friend so we didn't explore the menu completely but there wasn't","useful":0,"cool":0},"62LD_2W-_PrVyZQ-tNWjXQ":{"text":"Come here for BRIAN (not Kevin, his twin). Babe is a Leo and is a mix of Johnny travs and ","useful":0,"cool":0},"fT3S7fmcB7HQRIfQA1HP9g":{"text":"Location if fabulous!  Our waitress was awesome. Go see Kristie V she is wonderful at her ","useful":0,"cool":0},"p0TER4R11gxUGuq57NhHZw":{"text":"Came here last night for the first time and it was great. Sat on the balcony while listeni","useful":0,"cool":0},"aYXcr1xrQsDj3H0kF1eX2Q":{"text":"The four stars are for the staff. They were so nice and helpful. The food wasn't great. Ki","useful":1,"cool":0},"-2ZyqT-a6YL-oyfQBzWTdQ":{"text":"I absolutely love this place! This is only my second time visiting but I was hooked on my ","useful":0,"cool":0},"0qIBcteKuALMVWVhYvoKIg":{"text":"We made a reservation on open table. When we got there  two hostesses said our table was n","useful":0,"cool":0},"2gIAGTWC5u5VJUNVieyo3A":{"text":"Overall bland food, everything needed seasoning and a little TLC. Both of the shrimp dishe","useful":0,"cool":0},"vzv_Qk8LRHkLDSXQjgc-0Q":{"text":"Are here a few years ago, best shrimp and grits I've ever had! Very good service. Nice vie","useful":0,"cool":0},"gdXjDyFpxjmOUhfWz4_Owg":{"text":"Lots of empty tables that stayed empty the whole time we were there but were \"reserved\".  ","useful":1,"cool":0},"SSttPVpjF6PlNmm8Ct2qjw":{"text":"The place was empty which should have been a clue the restaurant was not good since evey w","useful":0,"cool":0},"Ch8JlmPvHhkz83JsQKq8Rw":{"text":"This was our fanciest outing during our week in New Orleans. Everything about our experien","useful":2,"cool":0},"zDXbg3kVDmVxong-P0vbTQ":{"text":"Absolutely impressed!!! Made reservations on Open Table. Food and service were outstanding","useful":1,"cool":0},"KpXn3NF80Duim4FjVI-mYw":{"text":"While visiting NO, my mom and I were walking around the french quarter, saw this place and","useful":2,"cool":0},"PLn5VkSH2KPktACsgXFidA":{"text":"Great bottomless brunch in the heart of the French Quarter! It was surprisingly very easy ","useful":2,"cool":1},"8B1k9ZfZRYbgtc8J0FC8Og":{"text":"We learned about this restaurant while watching a local channel in our hotel. The courtyar","useful":0,"cool":0},"WuJrXToLAKhfceVRSdwqVA":{"text":"Went to Tableau to have brunch and check out the balcony--the view can't be beat! Also, Ta","useful":8,"cool":7},"ZU-hA9VoL8Rdo4Xt0j1SCg":{"text":"By far the worst experience for brunch. Arrived @ the table at 1:00, and didn't get greete","useful":0,"cool":0},"yvtJNt799G5i1SdAKxWgNA":{"text":"Nice service and location, keep il the good work. We will be back soon as this is probably","useful":0,"cool":0},"W0dc6YwDLFCznyTU49nJWQ":{"text":"Tableau has an elegant interior and lovely courtyard. Nonetheless, the atmosphere is relax","useful":2,"cool":1},"ai48c-2VE0ShwxrPXtGCTA":{"text":"I recently had my SURPRISE engagement dinner at your restaurant. I was so surprised, tickl","useful":1,"cool":0},"0prpCJgxvuL8gcRJMYG1CQ":{"text":"We enjoyed an elegant lunch here seated at the bar a while back during the holidays and th","useful":6,"cool":5},"OQcpQCjFO7R-fAExQx_KkA":{"text":"I had my rehearsal dinner here for my wedding back in November. It was IMPECCABLE. We had ","useful":0,"cool":0},"ieWBaiFJyBegkNSDR1l7Gg":{"text":"We decided to dine here on Halloween, we were able to get a balcony seat and we were excit","useful":1,"cool":1},"pBcS9cMv_fRbDJaNvEEHIw":{"text":"A nice upscale New Orleans restaurant in the city center. I made a dinner reservation for ","useful":2,"cool":1},"7ic-NiU8FQ4xmF6qbNqX7Q":{"text":"What's better than BEING A TOURIST IN YOUR OWN TOWN? \n\nToday was a spontaneous day it was ","useful":13,"cool":11},"j_ywcS__6x09_Q0Hb9NmBA":{"text":"We enjoyed our night at Tableau! Our server Mya was very sweet and helpful, and the food w","useful":1,"cool":0},"zTjl8GROutowxozbHQ7W8Q":{"text":"Delicious dinner, easy to make reservations online, good drinks! (Bloody Mary!!) \n\nIt was ","useful":1,"cool":1},"VqjTlDb9O-hvwXWmLfh-6A":{"text":"I ate at Tableau my last night in New Orleans, and I wish I had discovered it sooner, as I","useful":1,"cool":1},"7L04GynUbTOvZaA6hMeiYA":{"text":"The location of this place is great, it is right by Jackson square. The atmosphere in this","useful":2,"cool":0},"HznqFou89uijvV39WrQWNA":{"text":"I love Tableau. They've always been helpful with suggesting Vegan dishes and their cocktai","useful":4,"cool":4},"FlU3EJXURE86U8EY6wuZ8w":{"text":"Attended a wedding that was supposed to be a Rehearsal dinner at Tableau on Thursday night","useful":3,"cool":1},"6e9pBcnLZDRx0eAcccIOcQ":{"text":"I understand that things may be different at Tableau because of the pandemic and I sincere","useful":1,"cool":0},"A2ZucFZ97wiCfqsMRzY1fQ":{"text":"THIS. IS.  AN. AMAZING.  RESTAURANT. I was a bit apprehensive because I heard it was a Bre","useful":14,"cool":10},"y53mM6X1sfm0TCI9FsQqyA":{"text":"Second time in New Orleans for business this year and decided to try Tableau.  We try to g","useful":0,"cool":0},"pF7MrmuCWyvjJMp7yxgWTQ":{"text":"Tell the young girl and the reception area that the customer standing in front of her is m","useful":0,"cool":0},"tQsSFefU55Q_eHL5a9YwSg":{"text":"Outstanding service and food. Be sure to try the gulf shrimp and the French onion soup! It","useful":1,"cool":0},"r-G3Af5QKYapcblBtkqq0A":{"text":"Beautiful setting, great service & a lunch special you can't beat!  Today's special was cr","useful":1,"cool":2},"qI5ePawqHvPP8UcjjCz9Pg":{"text":"I really wanted to love this place. We ate there this past Saturday, 6/5 for 730pm dinner.","useful":0,"cool":0},"Tv9AXn8DA0NrB1fzjReDuw":{"text":"My friends and I came here for brunch. We had made a reservation before our visit so we ha","useful":0,"cool":0},"0MBOFlXxcuIKRJJJfcGe8A":{"text":"My friends and I ventured to NOLA for my bachelorette party, and we went with nothing but ","useful":7,"cool":7},"Us5tDBxZWKZ-6BpZ1rP49w":{"text":"I wish I could give this place more than 5 stars. The drinks, food, and service was out of","useful":0,"cool":0},"K7h8JJIzin7SQOBMMFrc1Q":{"text":"We had a fantastic Sunday lunch here on July 16, 2017.  We were at Jackson Square and Yelp","useful":10,"cool":9},"Vzz9W1VqoWg-S5NcdkaXfQ":{"text":"Well just walking back to the \"tourist area\" from river front in New Orleans we saw a menu","useful":0,"cool":1},"m-eZ8IUbsxpddShJ5JonaA":{"text":"\"...an authentic New Orleans dining experience.\" -- www.tableaufrenchquarter.com\n\n\"Wouldn'","useful":2,"cool":1},"VPQl_MSYrYJ_7yEelroG_Q":{"text":"I just discovered this restaurant. The food was very good, and everyone in a party of 7, w","useful":0,"cool":0},"umh2bBkj-ed7Tz2QAM7Ezg":{"text":"Not shockingly, we had a 5-star experience at Tableau. It was my bestfriend's birthday wee","useful":2,"cool":1},"l6U9vtFelvnvgmvu1ZrJeg":{"text":"Excellent food!!! And the service was phenomenal  from the hostess to the waiters. They we","useful":1,"cool":0},"yyDDjj7TubC7t5GSfTcWug":{"text":"Beautiful restaurant with an interesting history, and food and service to match. Our serve","useful":0,"cool":0},"aaYTj-WH2mWuV2krRyFNFQ":{"text":"Tableau is one of those places that you hear a lot of great things about, and hope lives u","useful":1,"cool":0},"S-UrrnvuFHy7Rfrd2OpRGg":{"text":"There were a few highlights to this place including the nice ambiance and the personable w","useful":1,"cool":0},"iWG_n2LJSKGmk6S2DENMiw":{"text":"The French onion soup was out of this word. Never had an onion soup as amazing and beautif","useful":1,"cool":0},"IIcl8DuPGRiPa1aNmPndag":{"text":"I've dined here twice as a pre theater attendee, and was impressed with both the food and ","useful":2,"cool":1},"93R5gb2AnfcDHp-Rqf9bmQ":{"text":"Had an amazing meal and experience at Tableau! I booked a reservation for a large group a ","useful":0,"cool":0},"YFCDXClIRFNRJecTpWY24g":{"text":"Int. Tableau\nChristmas Eve\nNicole orders the Les Petit Filet Mignon & Frites and splits it","useful":0,"cool":1},"NbupHQJZFuIS2qQBN7Tmag":{"text":"Can't leave without trying out Tableau for brunch. Live band coming around the table is an","useful":1,"cool":0},"Hax6e7VgQEykwwC93Ezx2w":{"text":"I always leave fair good reviews but I can't in this instance. We came at 2 on a Sunday. L","useful":3,"cool":0},"wefkMk7vc_zpv5ODNkURAw":{"text":"Probably the most disappointing meal on our 4 day trip to New Orleans. We had a party of f","useful":4,"cool":3},"3xtqpn8r3kjYaM5Rj-7zog":{"text":"Went with some friends for Sunday brunch and it did not disappoint. Obviously the bottomle","useful":0,"cool":0},"hnI95BMe8l0pZM-afre1rg":{"text":"This is definitely a must if you are in NOLA! The atmosphere is so cute and classy, in an ","useful":1,"cool":1},"WM3Yjc9wfgC1e3ARom_ulA":{"text":"Favorite meal we had in New Orleans. Sat at the upstairs bar and had great service and del","useful":1,"cool":0},"Y8fbgjcCqmwxzSKPWup63w":{"text":"Ask for Jewel; she's the gem in the crown of this establishment. Great wit to match her sa","useful":1,"cool":0},"3B8CxRWtzwdBHEnjCx7cYg":{"text":"I have been to Tableau numerous times over the years for lunch and brunch. The location is","useful":6,"cool":6},"qErdw43Ynp5G9QOmgNAJ6g":{"text":"Oct 3, 2019. I dined on the Creole French Onion Soup, BBQ Shrimp & Grits, & Vanilla Bean C","useful":1,"cool":0},"oAAfzlLtSJf-Vxrljd0_KA":{"text":"Still great! Went for lunch and the food is better than ever! Portions are generous- duck ","useful":1,"cool":1},"-MBLMfscNeYx10l0xTmy4A":{"text":"Two of my cousins wanted to try this place out right before we leave NOLA. I like location","useful":0,"cool":0},"60BiEj9Vy-3WYgrb-H16sw":{"text":"We really liked our Tableau experience on a Friday night with a table for two.  We dined a","useful":1,"cool":0},"1-LFqzgYHRF4g2sWhU3fpA":{"text":"Outstanding food.  Outstanding service.  This was a real treat for us while visiting NOLA.","useful":1,"cool":0},"dfFmmBaI1weOc2pvhUTHIQ":{"text":"I sure wish I could leave a negative 100 star review rather than a 1 star review. I am so ","useful":2,"cool":0},"w-0DmCBkdKKxOe2J6WNkBw":{"text":"Food was good! Nice outside balcony with nice view. Service was beyond bad. One bartender,","useful":1,"cool":0},"Y3TfHmJhODXS4HEhM3VpyA":{"text":"Walked in at 5:20p on a Saturday evening. There were only diners at 2 tables and 10 server","useful":2,"cool":0},"-_a96_EkrqrgT9rmgExhmg":{"text":"Very unimpressed. Service was below average. at best. Had to ask for bread. Had to ask for","useful":0,"cool":0},"AbLVwuTikaxPSPdY5EaHuQ":{"text":"This was the \"high end\" restaurant we chose for our short vacation in New Orleans, and we ","useful":3,"cool":4},"xJ1Mijp86mVlkwee6Tm2sg":{"text":"This was a tough review.  We visited for lunch and found the experience \"meh\" The space is","useful":4,"cool":1},"6_TiKg38qe6vbfUhWM61Cg":{"text":"I've dined at Tableau twice. The first time was years ago for a birthday dinner. I remembe","useful":1,"cool":1},"fuBf3GjwRZp-W6nlLb4YHg":{"text":"I really enjoyed this place. The waitstaff were friendly and helpful and the food is excel","useful":1,"cool":2}}