{"_sHeXxekLnkfSGDVbLXw3g":{"text":"I love this store so much! The best jewelry, the sweetest employees. I miss Angela so much","useful":0,"cool":0},"g-8HkgLM7SQ9S9Wq8xiGkw":{"text":"Wonderful selection arranged in a uniquely beneficial way. (Ask the owner to describe) sup","useful":1,"cool":1},"RNONRU_oCJDbxL6CXKhKJQ":{"text":"Great store to shop at! Love coming here! Owner is super friendly! Great selection and the","useful":0,"cool":0},"i3BjJKknlQdqBg74BjRWlQ":{"text":"Nice little shop. Kind of small so moving around when there are at least 7 people in there","useful":0,"cool":0},"7d-ZVQdXUD6PVUzbMKsDVg":{"text":"A wide array of well sourced, eclectic mix of gems and stones with a kind, attentive staff","useful":2,"cool":1},"O9Xt8P2-JcLMHlH-IKQyEw":{"text":"Happened to stumble on this amazing shop. The energy in the store was incredible I found s","useful":0,"cool":0},"tuAsOQcH-rH6cbhwLWKZrA":{"text":"Bought the lady the most beautiful onyx-like stone necklace. the prices are just too good ","useful":2,"cool":0},"h-Y-rBea4AAmN6iIdmMgNQ":{"text":"I have nothing but love for this shop. We found it randomly walking around in the French Q","useful":0,"cool":0},"Nbq7GtG-ECXQzszrQzeEfQ":{"text":"Today I took a quick tour of the Quarter and visited all my favorite stone and metaphysica","useful":4,"cool":4},"PiCXhxoD4echRZagANYvgA":{"text":"Angela was such a sweet and helpful person. I couldn't return to buy what I liked, but she","useful":0,"cool":0},"04QDII1_jwZJ6k8zqD5I8A":{"text":"Absolutely amazing selection and very helpful staff. The prices are very appropriate for t","useful":0,"cool":0},"cJvFVnC99zhVGwt-M8rK9g":{"text":"Great shop and amazing products. However unfortunately at this shop I had a reading with a","useful":2,"cool":0},"y2H7ZM_Llg7QsxFk-DG1LA":{"text":"Royal Street Stones is a great shop to check out for crystals and jewelry. They have a hug","useful":2,"cool":2},"VUyc6_OUj0UhxFHyqwyjZA":{"text":"Every time I walk in to this place, I have the best experience. The owner is super sweet a","useful":0,"cool":0}}