{"XKc7F5XGETI3OkPEybSZ6A":{"text":"Trenasse is located inside of the International Hotel on St. Charles Ave. It feels upscale","useful":0,"cool":0},"_rvr_pyUBzOuLCW8kGOmWw":{"text":"Absolutely amazing food!! We had the Chefs 3 course meal and we were blown away.  Incredib","useful":0,"cool":0},"CpjcQZaP-BTiNewUYUyJ0w":{"text":"This place is phenomenal. The bartenders are very personable. Jonathan is super friendly!!","useful":0,"cool":0},"Q4UYZzvB4mZ0oIb3x5vshw":{"text":"I was trying to find something new to try and I found this great place. Michelle did an ou","useful":1,"cool":1},"UDgNmLm0K1MIXG7iXfpkXg":{"text":"Stayed at the Intercontinental  for 5 nights.  First night discovered here and was greeted","useful":0,"cool":0},"Phr4jvFd64BdZ4im5NyUkg":{"text":"Yesssss. Had one of my best meals in Nola here...ever. \n\nI ended up here randomly. A milli","useful":0,"cool":0},"VyMgHR6GwUUXoGPat7IF5A":{"text":"Eating at Trenasse was easily the best meal of our trip. Having been to New Orleans many t","useful":0,"cool":0},"66-9QOWgypjrvjnjYaxPCA":{"text":"Great place for Happy Hour for oysters and libations! Sit in the back at the bar where Leo","useful":0,"cool":0},"dQxTjXcYdTmqS-6P4OFbtA":{"text":"We were underwhelmed with the chargrilled oysters Intercontinental.  The frog legs were lu","useful":0,"cool":0},"eVniInur0YW7Izluq_KdkA":{"text":"Located in the Intercontinental hotel. Happy hour from 3-6. Tried the crawfish pie, raw oy","useful":2,"cool":0},"qqPmz-XMrGlOdi81gxZVEA":{"text":"The food was delicious and the oysters were probably one of the best I had in New Orleans ","useful":0,"cool":0},"37ESFQM47SxjtpxJs4CsZA":{"text":"Trenasse is connected to the hotel (Intercontinental) that my friends and I stayed at duri","useful":4,"cool":1},"smjvjyoAeG4yXjAX5UNq8A":{"text":"We are first time visitors to NOLA from Seattle.  Our concierge recommended Luke's.  Walke","useful":0,"cool":0},"nBuewgyiGM9LjqsYZ242eg":{"text":"It was tasty. I probably won't be back. Food was good but I have a problem with my food no","useful":1,"cool":1},"FiF08jakV6od1EAostcP4w":{"text":"I fear that I am the first non-five star review.  Sorry to break the streak but, coming fr","useful":0,"cool":0},"iJm00aq_rvn5QDWiKVlrDQ":{"text":"My friends and I came for the bottomless mimosas and found phenomenal food but the real ge","useful":0,"cool":0},"2GqPeeavfFO1motxyyDntQ":{"text":"All good at this upscale casual fresh seafood joint.\n\nLunch time, good crowd but no waitin","useful":1,"cool":0},"Is4_9MQ26fGoozLMPO5NQA":{"text":"Writing this review while I sit here waiting for the dozen oysters I ordered over 30 minut","useful":0,"cool":0},"ejkLNwLHgpvfypmum7Bgkg":{"text":"Came here for happy hour. You get what you expect. We got raw oysters by the half shell an","useful":0,"cool":0},"4Xur1ejyXbLoGwcFPKGhAA":{"text":"My first trip to NOLA, I did not expect myself to be drawn to a restaurant like Trenasse. ","useful":0,"cool":0},"vFa5ne88KAk18XzksvNFKg":{"text":"Another score for NOLA to make it hard to find bad food.\nPerfectly prepared gumbo, good bi","useful":0,"cool":0},"BhBFz_fXyZZ09CcTx-6_ug":{"text":"Solid brunch option.\nShrimp and grits is excellent.\nBottomless mimosas.\nUsually not a wait","useful":0,"cool":0},"bxYUzzK5Xumd8_vyxSY2kw":{"text":"We stopped here for a late dinner after conferencing. The service was amazing. We started ","useful":0,"cool":0},"GDBuJZ8fsl5IZlMbxAQDFQ":{"text":"Got take out from here while in New Orleans on a business trip. I ordered the crab trio an","useful":0,"cool":0},"BSXipNlUXWiUj1k0DG68zQ":{"text":"Excellent food. We had Wagyu beef, crab cake, duck lettuce wraps and bread pudding with ca","useful":0,"cool":0},"-ngNMgNdF_1r9BrrGByNgg":{"text":"Other than the fact that our 2nd course(firecracker shrimp) came out after the 4th course ","useful":0,"cool":0},"h8e99qfBDa_xxfwF-ZPprw":{"text":"Great food, great service, great time. We went during happy hour on a Saturday evening. Cr","useful":0,"cool":0},"WE2nyKV7Rw0KT0Az0e9FIA":{"text":"Terribly slow service. 45 minutes after ordering our meals the waitress came out and told ","useful":0,"cool":0},"9nhrKLSn9d9Yh9GsiuqKag":{"text":"We came here for Happy Hour on Saturday and I could not have been more impressed.  The $0.","useful":0,"cool":0},"LoLrURyMdRALYf_5k7cG7w":{"text":"Spectacular meal! Great service from Falon. Escargot, oysters and entire menu was amazing.","useful":0,"cool":0},"Pk4_D3i6cuWKOmG7brPygA":{"text":"Yep, this was awesome. Good reviews below are accurate. I'd never eaten frog legs before a","useful":1,"cool":0},"oe8sjFSHaVd6j6t5H1Ebmg":{"text":"Finally find a tasty restaurant in New Orleans.\nLocated in Intercontinental Hotel, they se","useful":0,"cool":0},"nxWbkrRObicAIqUlXSFCYw":{"text":"Stumbled in during \"happy hour\". Raw oysters $.75, smoked wings$6, & $7 Unca Duke's shrimp","useful":0,"cool":0},"ZdvrXsudm1yHmZbi-9L1ug":{"text":"Another great find in nola, thanks to fellow yelpers! \n\nWe went in the afternoon for their","useful":0,"cool":1},"U2pc3Qannvt4fnVZCibsrQ":{"text":"$10 Bottomless mimosas, what more can you ask for at brunch? How about a solid little jazz","useful":0,"cool":0},"cwHubgsgrcaXnkNkVb94vg":{"text":"Trenasse is located in the Intercontinental Hotel New Orleans.  We made reservations a cou","useful":52,"cool":53},"sbiTjLl2RXNvOLIzP9MnIQ":{"text":"loved everything I had!!! Bbq shrimp amazing ! the fish amazing! the endless mimosas amazi","useful":0,"cool":0},"B7nyT-NsgdIQe0j0prRWMA":{"text":"We were here for a conference and had done several \"touristy\" places with many people and ","useful":0,"cool":0},"2QHBybXSXhZ6jvo6M-oZUw":{"text":"I can only give this place 2 stars as an average . The crawfish pie is absolutely amazing ","useful":1,"cool":1},"8OKzueLAvG_rXUkz91GMzQ":{"text":"Came here on a Monday around 4:30pm. Restaurant is attached to the right side of the Inter","useful":4,"cool":3},"9VAv1mA3Mz86lTsOtkVJsA":{"text":"I was taken here by a client last month while on a business trip and I have to say, this w","useful":0,"cool":0},"ha4TyWDVpOcWzfwyp9JvfQ":{"text":"Stumbled upon this restaurant on Yelp and I couldn't be happier! Happy Hour every day from","useful":0,"cool":0},"tQlbvFKFtHbNDRRke-WGKQ":{"text":"Must go!!! Everything we had was amazing! Best garlic bread I've ever had, delicious oyste","useful":0,"cool":0},"ZCbb6TkTMVFWpReT43kLGA":{"text":"This place was good but not my favorite compared to other nearby places we had the shrimp ","useful":0,"cool":0},"zOQXj9iUa4qO7dgahlazQg":{"text":"This place was bomb. Not like, 5 star amazing meal-type bomb -- but pretty freakin' good. ","useful":0,"cool":0},"XKB4I_4AEkwyV7-94REGEg":{"text":"Excellent service!  Delicious food!\nTry the Crawfish Pie and the Crab Trio!  Awesome!!","useful":1,"cool":1},"al3fZ0qQHj4_u7hYfmuzuA":{"text":"Best Happy Hour menu I've had in New Orleans.  Popcorn catfish, Crawfish pie, Debris fries","useful":0,"cool":0},"GraaW3SkbJoSNcrx8fy-hQ":{"text":"I was looking for a break from my conference with a quick lunch out and this place deliver","useful":1,"cool":1},"1f12Uu27LSekuwprKmyiEg":{"text":"We had the fowl gumbo, shrimp 'n' grits, crab bisque and oyster salad - all were great, th","useful":0,"cool":0},"nnMxlvruJM1e7rpi3yBMgw":{"text":"Trenasse is a hidden gem.  First, they have one of the best bloody marys in New Orleans - ","useful":1,"cool":0},"z0OT487dkMh1vs2MhnmVjA":{"text":"I was craving oysters something fierce and I don't wait in lines (aka acme etc). On Sunday","useful":0,"cool":0},"IYqjOXrhHvVJDTDAmxfq_g":{"text":"Wow\nFood was excellent l, was worried a bit about the restaurant being connected to a hote","useful":0,"cool":0},"w5SmHIMc7LQVx3nebWGd2Q":{"text":"I liked the fried catfish nuggets and crawfish pie so much when I was here last time that ","useful":0,"cool":0},"7bVxIwGOM16iwaqMtOcvIg":{"text":"Ordered their cauliflower steak with no cheese & the salad with balsamic... flavors were d","useful":0,"cool":0},"guvjfO7P8FNKc4v1nU1Fzw":{"text":"Happy hour was a steal! The catfish popcorn bites were delicious and the perfect size for ","useful":0,"cool":0},"kD5dK1ebdtffo6Og3DBG9Q":{"text":"Delicious food!  My husband and I went to this restaurant because it's conveniently in our","useful":0,"cool":0},"53aheYOqT-wuzZvlemihPQ":{"text":"Had the blue crab bisque, escargot, lamb rack and crawfish pie, they were all absolutely d","useful":0,"cool":0},"bvuJOV1uGVP49-iGwl-U-A":{"text":"Wow! I'd buy a plane ticket to come back to New Orleans just so I can eat at this place ag","useful":2,"cool":0},"Ml9bvgF-TFskknnpaNRj7g":{"text":"Fabulous, fabulous! We had a late lunch and had a delicious meal! Very pleasant atmosphere","useful":3,"cool":3},"BSSdGZjKSoUsQIrhtddtoQ":{"text":"Good food. But please ease up on the salt. We were a party of 20 and everyone said their f","useful":0,"cool":0},"GSs9csePQ3VOio9L_ao8iQ":{"text":"Went during Happy Hour and got 6 oysters for 4.50 and the Crawfish Pie (entree). The Crawf","useful":0,"cool":0},"OG6X7a2Fk18rQNxeEj-TdQ":{"text":"Great tasting food but truly small portions. I don't like the idea that prices are hiked b","useful":0,"cool":0},"mM1Ib2lXsmy7exE2gVnDoA":{"text":"Really amazing food with the freshest and finest ingredients. I work in the building and e","useful":0,"cool":0},"MRyf69oqz7vUO6sYsCvW_g":{"text":"This is one of the top places we ate during our entire trip! Our alumni group decided to m","useful":2,"cool":0},"DV7NSym2BGysYI2TOmiw-A":{"text":"Amazing dishes. Our table had the Wedge salad with green goddess dressing, the alligator t","useful":0,"cool":0},"7Iwq2RO5IBtkiDrMxqx3wA":{"text":"Took the \"Crawfish pie\" to go to and found a piece of iron-kinda-looking stuff in the food","useful":0,"cool":0},"AGWuxCGWR5z-LblxQkB91Q":{"text":"Friday night in the big town...staying at the La Quinta downtown. Trenasse is walking dist","useful":0,"cool":0},"swwurAmVbGZ1aVyiYfwQlw":{"text":"Food: 4.8-4.9 debatable\nService: 4.0\nInterior design/atmosphere: 4.5\n\nWe were on the way t","useful":2,"cool":1},"1tCa_YlmzL0jC2NGF2ShLw":{"text":"Over priced and TERRIBLE service. Had 7:30 pm reservations but waited almost 30 minutes fo","useful":0,"cool":0},"iHDOEZTA4u8wCDXNMhS9SA":{"text":"We stopped by here for a quick happy hour before dinner. The grilled oysters were fabulous","useful":0,"cool":0},"K3o8o2u0Y3yu9VZJ-Fo-hA":{"text":"Perfection!  The depths of flavors were delicious everything was just the best highly reco","useful":0,"cool":0},"QCxOR7_1nnHR1QVfOsgJKg":{"text":"Its great food. Honestly, what did it for me was the whole yellowtail snapper which was th","useful":0,"cool":0},"aBF57kvccCxwTT1VZ85Cfg":{"text":"Group work dinner. Nice private spot for our crowd. Attentive service. Great raw bar and b","useful":0,"cool":0},"oCSHoYsWkBupnCTt306Z5g":{"text":"The food was good...it was most likely two dollar signs for the upper class though. AND no","useful":0,"cool":0},"1ofBlULyVVj7kqmv13hNxQ":{"text":"Every part of our evening here was wonderful. The service, the entertainment, the restaura","useful":1,"cool":0},"JJmN5-Ix8KrOmihwjgYTFQ":{"text":"Fantastic food!  Drinks are good too.  We had both the Bloody Mary and mimosa, very tasty.","useful":0,"cool":0},"DDtD0v83JL7PbwvJ0T5kfA":{"text":"We went here for a bottomless brunch during a trip to NOLA not long ago and were pleasantl","useful":0,"cool":0},"kVxEkue4Bxx4t0HEsBIflQ":{"text":"Wow! Very good food and service. Our server Falon was very attentive. She knows the menu v","useful":0,"cool":0},"rwKopPDB0MQ_rZSlpbHsjQ":{"text":"Incredibly good brunch! Super impressed with the quality of food, creative menu, and the b","useful":0,"cool":0},"Jel9kgZuZLsnAOzeGEXgLw":{"text":"Good service and food. the Raw Combo \"Entrée\" was really excellent!","useful":0,"cool":0},"HWLVvAaglrI-x1iJci_l0w":{"text":"Although it has a good rating, I was not expecting to be \"wow'd\" by a hotel restaurant, bu","useful":0,"cool":0},"FAXeXDfV8eB4VoDXt-88ow":{"text":"They just kept giving me more and more spoons. Here's your oysters and a couple spoons. He","useful":0,"cool":0},"A_XRhQEjqkl7tyZUUsb1cg":{"text":"I was staying at the Intercontinental and honestly was not expecting this restaurant to be","useful":0,"cool":0},"vB4zwWy8qAkkf4g7jLUx7g":{"text":"The wall of frozen drinks was a real lifesaver in the 90 degree heat.  I had the stinky pe","useful":0,"cool":0},"3ELIgpxrffLlRz8U7wd7rg":{"text":"This place crushes!!!  I have been twice and both times were beyond stellar!  Service was ","useful":0,"cool":0},"c27jS5f2nlNVBEMgO4R-Aw":{"text":"Vegetarian friendly! They have a menu for us non-carnivores, and it was delicious.  Of cou","useful":2,"cool":1},"ETd1s7y1ChwpzkDzwiaMWQ":{"text":"Amazed at how they served party of 10 during Essence fest.  Group loved the food.  We got ","useful":1,"cool":1},"JU8LrLJZPTWjnczUA24y-A":{"text":"Oh my good lord. We were in town for my boyfriends birthday looking for a nice place to gr","useful":2,"cool":0},"mqugrGMHFBC6evPxbnGC4A":{"text":"This place is great love all the happy hour items! Crawfish pie and boudin balls yummy!! T","useful":1,"cool":0},"eJy2JZsgz1WEJ7LlS0qDpQ":{"text":"This was the best meal ever! I had the Taste of Trenasse and my husband had the Roasted la","useful":0,"cool":0},"qmKHIDY6zKFjKhp9LomNKA":{"text":"I've eaten here several times. It's another hotel restaurant. I really don't see what's so","useful":2,"cool":0},"YYuxQpwNuAXTQyRw3TsRJw":{"text":"Pedram Couture loves TRENASSE!  Their food is DELICIOUS!  We recommend everything on the m","useful":0,"cool":0},"KnRtk1ER0txpxdMfA29uvQ":{"text":"The food was excellent and service was great.\nWe were 4 adults and 1 child visiting NOLA. ","useful":0,"cool":0},"nETbT99BQd6WYSttHqXzkg":{"text":"Food is excellent; service is great; cocktails are delicious; ambiance is warm and invitin","useful":0,"cool":0},"yymURjl6pT0709u3nwu8xQ":{"text":"I'm giving 3 stars only because the waitress and bartender deserves some credit. We were s","useful":1,"cool":1},"0DhSQobufuCq4L9EbwxVCQ":{"text":"This place is amazing!  The oysters, crawfish pie and peach cobbler were our favorites, no","useful":0,"cool":0},"JMtMeKO97xPr7qrULpAyMQ":{"text":"Our local waitress from 5star hotel told us to go here.  This little hidden jam is located","useful":0,"cool":0},"D7CjVY5iJ1fryyFY4dzG9w":{"text":"My boyfriend and I had the most wonderful time here. The happy hour features 75 cents oyst","useful":1,"cool":1},"UGhnJuljZ5fnuPR55UtA4w":{"text":"Happy hour oysters are great! Had 21 oyster combo for 7different types. The best are the g","useful":1,"cool":0},"qxi0YXHIjSdI9McPmmtBTw":{"text":"I was disappointed. \nThey need to settle on an identity, I think.\nThey try to combine high","useful":0,"cool":0},"O-V44J-eW0C8oHAsy7Rs3A":{"text":"Absolutely delicious! I ordered the wedge salad (probably the best wedge salad I have ever","useful":0,"cool":0},"UpFHZAmVDz2HZNvyF1CPVw":{"text":"It's true what they say about the Bloody Mary. The bartender that day made them spicy, sto","useful":0,"cool":0},"MTLIGTxlUsOJVeQA3KRq4Q":{"text":"Came at happy hour to order a couple drinks and happy hour appetizers and decided to stay ","useful":0,"cool":0},"DPABvYUUVKC5qzXUBLvYRA":{"text":"Delicious meal, great service. So many things on the menu I wanted to try. Will definitely","useful":0,"cool":0},"w94jnuTupCEiwhn5rtGqVw":{"text":"I ordered a wedge salad to go as I was staying in the hotel and didn't want to get charged","useful":2,"cool":1},"0J-BR1dDIGbd-E_xT2aA4w":{"text":"The atmosphere is a bit lively (read: loud) for dinner. So, if you're looking for an intim","useful":0,"cool":0},"ScazyOfAERGl4BekjiaQkg":{"text":"Trenasse is a class act.  We went on a busy Saturday night during Jazz Fest  and arrived 3","useful":0,"cool":0},"pRUvvFFZrSn1kPtIrMYX3A":{"text":"Chosen for its variety of southern food, as my family's only experience is with my cooking","useful":0,"cool":0},"lU9JRZKXdZ38ImAbJ6gutQ":{"text":"Went with a party of 8 and we had a great time. Service was on point and food was deliciou","useful":2,"cool":1},"nZ6hqhD9_tNg6yUKcnkVsQ":{"text":"Great Easter Brunch\n\n\nMy wife and I had the pleasure of eating here for Easter Brunch. Ove","useful":1,"cool":0},"ML4lJYKml-TsfSQC_rdIOQ":{"text":"Michelle at the bar was super friendly. We had oysters and drinks prior to our dinner enga","useful":0,"cool":0},"WPVLzjcO7e9-wQnK8nRRlQ":{"text":"I had the CRAWFISH PIE and it was better than advertised. It was spicy but not too spicy a","useful":1,"cool":1},"x_h4-vjHsPIoHY6gY_m1xg":{"text":"I rarely give five stars but this places earned it. It's their happy hour that put them ov","useful":0,"cool":0},"T_9dtupLvZ3ooO4qhfKPeg":{"text":"Came looking for a great meal to cap off my buddy's bachelor party weekend, and Trenasse d","useful":1,"cool":1},"cmX86SoHKzwVxo39QtqKkQ":{"text":"Everything we've had were delicious! Ambiance, food, server, Kev and desserts were all ama","useful":0,"cool":0},"SK8vtLDQ70OgfHj0YKohcQ":{"text":"Fantastic lunch with great food and even better service. Joseph Evans was amazing. We orde","useful":0,"cool":0},"yu3DyGWPRvhi8ONTUUnrLg":{"text":"Food was good, not great. We ordered from the coolinary menu.  Perhaps our experience woul","useful":1,"cool":0},"QCRjeYGGu0mAU7nFNf56MQ":{"text":"This is a bar with a menu- that's not a bad thing but if you are interested in food it's n","useful":0,"cool":0},"TCzrFh95foJ_eFjt7HKLHg":{"text":"Great food and drinks! Even tho it's a hotel restaurant the food and service is exceptiona","useful":0,"cool":0},"wnPLCKK6W4IhOdncQ76Lbg":{"text":"You need to know two things.\n\n1.  Happy Hour from 3-6.\n\n2.  $0.75  raw oysters.  \n\nAfter l","useful":1,"cool":2},"jDVyfnW583gPNx0-tGvpmQ":{"text":"Highly recommend, everything was good. Only one warning, make sure to ask if a dish like t","useful":0,"cool":0},"qP_eYi0OK0sEp1aVyoBuew":{"text":"Excellent gumbo, some of the best I've ever had. The staff is very friendly, and the chef ","useful":0,"cool":0},"t6pZhLdJpXsOXhoQPln4jg":{"text":"We had a really delightful meal here. All the dishes were well prepared, well presented an","useful":2,"cool":0},"g5ea42oisDF-oPewcsbwhQ":{"text":"If you like blue crab and oysters, this is the place for you. There are many oyster option","useful":0,"cool":0},"czGpLHMI4gHDgNgip-CB0w":{"text":"Awesome food and great service.  On St Charles Avenue it had outdoor and indoor seating.  ","useful":0,"cool":0},"t5kUXz710p6FAx-1dUtxMw":{"text":"Best shrimp and grits I've ever had. I'm only in NOLA for a day and I might come back agai","useful":0,"cool":0},"jnkazwOyWODbDF2pYtZBdA":{"text":"Intercontinental and the Rockefeller oysters were amazing. Our waiter, Johnny was extremel","useful":0,"cool":0},"rCuy-QUxHzwXhtGccq4nag":{"text":"First time! Great appetizers. We tried the lobster tail, sliders, chili shrimp, soup trio,","useful":0,"cool":0},"82VZCieCNYBchK3ZlufbDQ":{"text":"Nothing exceptional about this restaurant besides the friendly wait staff. The fresh fish ","useful":0,"cool":0},"oX0fSmr0IaIr5du3qr0gMg":{"text":"Great tasting food, but very very very pricey for portion size.  If you love oysters, they","useful":0,"cool":0},"dphNb9czKlpE7MeQdn9QIw":{"text":"Enjoyed a lite dinner of Cauliflower Steak, Garlic Bread with Red Bean Butter, and Boudin ","useful":0,"cool":0},"LmgYsIb8cwsRM4yDVgV8IQ":{"text":"We had a wonderful time, the service was awesome and the food was amazing!!! It was a grea","useful":0,"cool":0},"ennqyLB5zW_Tq7pEVInS9g":{"text":"This place was fantastic, I got the gumbo and boudain balls. Both were incredible. Excelle","useful":0,"cool":0},"rnLq1VVM8rtijIArYwbrag":{"text":"This place is beautiful and worth the stop! I had oysters during happy hour and also the b","useful":0,"cool":0},"aLbsG1nk67sXC5N1rNeOxA":{"text":"Working at a conference in NOLA and ended up having dinner here with coworkers. Although i","useful":0,"cool":0},"4rENLRjky2UqNrsStOvGkw":{"text":"Went here for dinner a few weeks ago with a friend that was in town. We stumbled onto it b","useful":0,"cool":0},"uLjJttL7LDZ_NW-yQQN3Ig":{"text":"Great food, gruyere oysters are killer, blossom of flavor! Fish du jour is always solid...","useful":0,"cool":0},"Qsh2zxDpR-wz0wicF-UQeg":{"text":"Great restaurant in New Orleans. The food was good. The service was even better. We had a ","useful":0,"cool":1},"ph8vVJ-Jl9f_l7ZryB6TZQ":{"text":"Excellent food. \nMust try: Crawfish pie, cauliflower steak, and Ceviche raw oysters. \nVery","useful":3,"cool":0},"JS2PdQh0Q9-HTlok2v1C8w":{"text":"I loved everything I had here.  I ordered frog legs which were EXCELLENT.  This was the fi","useful":0,"cool":0},"Ywmh4gJ5q88VmhewH_Gblw":{"text":"My wife and I were visiting New Orleans during a cross country trip for our 31st anniversa","useful":0,"cool":0},"tsVoTPpnYI1w6Ws6i2IVlw":{"text":"This is probably the most disappointing dining experience I had in New Orleans. The atmosp","useful":0,"cool":0},"KJsMPT-9vyyESsCv2Yycgw":{"text":"Amazing food every dish was better then the next small plates left feeling great and not s","useful":1,"cool":0},"Zfj0keqBz9QbnWrIAQAong":{"text":"Went here for dinner looking for some local flavors. I was not disappointed. I had the gum","useful":0,"cool":0},"Ulf9RR65000Rq0OxnQHClQ":{"text":"Good stop for HH! Their HH is everyday from 3-6 PM. During HH, raw oysters are $0.75 each,","useful":0,"cool":0},"4i0E2ZuCw6CNA2JtFd3lKA":{"text":"Trenasse is overrated and expensive. Firstly, the noise level was very high. Although a lo","useful":0,"cool":0},"mmV-TSAZdBmY2w_7zF_KHg":{"text":"Ok, so... We knew it was gonna be a nice place before we got there but it was really more ","useful":0,"cool":0},"XL4EChXK3huQUIHs3XIU3Q":{"text":"First time I let yelp reviews influence me.  Great choice!  Best meal I've had in NOLA. \nI","useful":0,"cool":0},"QSA-8cyHGuHJTyasg-5Bsw":{"text":"If I could give it 6 stars, I would. Reservations usually aren't needed, but on Yelp it sa","useful":0,"cool":0},"w5Iwmnn-9R5OviBX5fLJPg":{"text":"Jaraud and Tony were awesome. We loved the food and the experience! Conversation was great","useful":0,"cool":0},"sEFQG413cUlDsxJ1ZTi6Zg":{"text":"Great service. Excellent food. Ate too much! So took a star away for my own gluttony! Oh, ","useful":0,"cool":0},"aUU1bcfO6xim0K24tTixSw":{"text":"Very happy first stop for eats in The Big Easy! We happened to go during happy hour, and l","useful":0,"cool":0},"Cl8aUixSHzeVc0iBkIv7qA":{"text":"I went here for Happy Hour. The service was excellent and attentive even though they were ","useful":0,"cool":0},"eeSrrrWjGLpAw-1a7O8KnA":{"text":"Food is amazing but the SERVICE is better ! The atmosphere is awesome but I really can't g","useful":0,"cool":0},"3xmjD1EgMAb1lZGWNCH2gQ":{"text":"Great atmosphere, service was impeccable. Only complaint was bisque was not good at all. I","useful":0,"cool":0},"9qplRja1ddYoUYpwYYQG_g":{"text":"Frog legs were amazing! We came here solely for them because I wanted to try some while in","useful":0,"cool":0},"9qUf6ScrSFGcvv9ciZ1Msg":{"text":"Food was good. I enjoyed my meal. The crab trio could have more crab but otherwise everyth","useful":0,"cool":0},"7_eoL37X2lxZfmzzehGUFA":{"text":"Really good food, ordered the crab and it tasted amazing. The fries were okay, service was","useful":0,"cool":0},"XhAOLb7tgoFBbNfm1NzEfQ":{"text":"Great tasting food but truly small portions. I don't like the idea that prices are hiked b","useful":0,"cool":0},"Fva7cSpdDXlSSvpxTO1nJQ":{"text":"Today I had the pleasure of a lunch with friends in New Orleans. \nOur luck began with a wa","useful":0,"cool":0},"kyopGFaxhnXawo3_VEdUlw":{"text":"Lovely restaurant and happy hour. Their Oyster is the freshest and juicy out of all the pl","useful":1,"cool":1},"oKB9EWympsiYKAdUeMPysw":{"text":"Normally I stay away from restaurants located within hotels.  I am so glad I read other re","useful":0,"cool":0},"4ytscGVx_83V1dgoKqoQMg":{"text":"Awesomeness!   I had the fresh fish and my husband had the bisque, oysters and crayfish pi","useful":1,"cool":1},"2Arcr2KKKFR6Zz7icH3FDg":{"text":"Very... good , was little confusion with my order, but it's Ok ..\nLight lunch :\nSoup Blue ","useful":0,"cool":0},"x1mP4M9fGK_TqHXd9OnpGw":{"text":"Great Fowl Gumbo and..... The stinky stew is delicious. I am not sure why this place is no","useful":0,"cool":0},"qwkGmFKAEOgTxRjbkJBpag":{"text":"Everything we ordered was fantastic！ Our server was friendly and professional. If you don'","useful":0,"cool":0},"vzXGZafjvYndmI5EeIKpHg":{"text":"A great Sazerac and amazing Crawfish pie. That's all I had and I will be back since the fo","useful":1,"cool":0},"qIGftzjNbRjlz5tHP6BdnA":{"text":"Went for lunch. Great ambience. Ordered the blue crab bisque and lunch salad with grilled ","useful":0,"cool":0},"88uPF0ig0YAdLPmZ5zZ6FA":{"text":"Good lunch. They do a nice soup/po boy combo. Gumbo and bisque were both good. My wife got","useful":0,"cool":0},"yReO7WP0vxsW_kmalQ_-aQ":{"text":"This was our second experience at this restaurant.  Our family of 7 was here to visit New ","useful":0,"cool":0},"eCcGqSAsJhxgZsCcZ2mR1g":{"text":"Looks like just another hotel restaurant - don't be deceived; it's a restaurant within a h","useful":2,"cool":2},"o7MbfUWfeksqR2VAc4WlQQ":{"text":"Service here was super slow, despite not being totally full, but everyone seemed busy and ","useful":0,"cool":0},"KSPpD_Ns6BoLodnEWRFoBA":{"text":"Not that great. \n\nPros - Redfish was lightly battered and well cooked\n\nCons - Overpriced a","useful":0,"cool":0},"jNHEzUL-1Heoz8MzyQHTEw":{"text":"Traveling with a pup who needs outdoor space. No dog menu but they allowed him on the pati","useful":0,"cool":0},"yqoZWw3ZV1XcVzWFk2Kb4w":{"text":"I tried one of the specials and it did not disappoint. Great sheepshead fish seared in a p","useful":0,"cool":0},"bvgGdHj4tF0ZPTRjJtvBNQ":{"text":"Fantastic ambiance if you want to sit at the bar or have a date. I sat at the oyster bar a","useful":0,"cool":0},"i9F43zd2VEHe4hAsQm9A0g":{"text":"Simply: if you have a chance to go, go. \nWe went here because a) it was relatively close t","useful":0,"cool":0},"T1SQ9Y2ijD5F_agLuccNKQ":{"text":"I am quite impressed with Trenasse. I had dinner here with my team and we were able to try","useful":2,"cool":3},"RBz1tkzTreM28lR8w2Txhw":{"text":"Love everything that I have tried here. Especially the chargrilled oysters. The drinks are","useful":0,"cool":0},"pBnm0S510j181z9dB_ttkw":{"text":"I came into town for the Beyonce concert and wanted to eat at a restaurant that wasn't on ","useful":0,"cool":0},"spgR2a_qz4hrbf5UYjanEQ":{"text":"Excellent food. I had a duck-breast dish with lentils and brussel sprouts. My husband had ","useful":0,"cool":0},"Bu64SRS6YoS98zINr9afjQ":{"text":"On my last night in New Orleans, I stayed at the Intercontinental, which is how I ended up","useful":1,"cool":0},"3Z39yY92GcwFn4frmCpRoQ":{"text":"Spectacular.  We went on Christmas Eve, and even with a reservation had to wait a bit, but","useful":2,"cool":0},"GX4seCO8DcDBwLNeXrG2DA":{"text":"Amazing food. Great place for a date, but casual enough that we didn't feel embarrassed fo","useful":1,"cool":0},"-q7ZPi8rf3vDTm6mIwa-vQ":{"text":"I am in love with this gorgeous restaurant filled with an even more precious staff. I was ","useful":0,"cool":0},"mXQKDTUNlwMaL9qHlVgVXg":{"text":"The dishes at Trenasse are either a hit or miss for me. Some are delicious while others ar","useful":0,"cool":0},"CbA15mUPspEW-s_LuZZ4vA":{"text":"Excellent oysters on the half shell,  delicious wedge salad with green goddess dressing an","useful":0,"cool":0},"V62GY2CZ5vXU672Q0orn-Q":{"text":"Enjoyed a wonderful dinner here with our party of 9. The food was wonderful and portion si","useful":0,"cool":0},"iUAkt68lCTha_0kkOUz2AA":{"text":"CBD friends, take an hour out of the office and treat yourself to this little gem in the h","useful":1,"cool":0},"HzjLj3rlC21DWeHOdOWH5w":{"text":"Great food. A definite must eat spot. I was a little sketchy since it was in a hotel. The ","useful":2,"cool":1},"0zB8bXXAYJCbJKQK2ieJwQ":{"text":"The food is soooooo good. everything looked delicious. We had the shrimp appetizer which o","useful":0,"cool":0},"OiDySsJ4h1rIgJENGMf8NQ":{"text":"Absolutely awful.  I have actually been wanting to come here.  I came here yesterday after","useful":4,"cool":2},"ZRKqIcn6-17PVPOYTLDiBw":{"text":"We were forgotten! Hostess sat us behind a wall, even though the restaurant was empty, at ","useful":1,"cool":1},"3OBIO2IvIVjAuL1fRE7RXw":{"text":"This place was awesome.  Lian the bartender was outstanding,  the oysters and stinky's ste","useful":0,"cool":0},"UDOz3Z7Y7wzZHC1K_YKQeA":{"text":"The food was great here. Oysters were fresh. Stinky's stew was the best part! Service was ","useful":0,"cool":0},"s_Tpt1NbFXVpp7yOqOBU4A":{"text":"Stinky's stew was the best way to top off our trip to New Orleans. Flavorful and packed wi","useful":2,"cool":2},"Ri30qMh6TJj_G37hzxm6JQ":{"text":"Extremely good I realized how hard it has become to have bad food in new Orleans so I will","useful":2,"cool":2},"GGoyeUf1goaj9pSD6aC5PA":{"text":"This is a beautiful dining experience with an abundance of great food and delightful flavo","useful":0,"cool":0},"CEpV_qNnnf0pajT8isiswg":{"text":"This place was great from the time we called for a reservation to paying our bill. If you ","useful":0,"cool":0},"RkwoRB9Dglsz29E3tz4naQ":{"text":"The food is amazing and the atmosphere is fun! Three of us shared three different soups, b","useful":0,"cool":0},"1LgQSGDDYAbk4YdFegW2LA":{"text":"Ho. Ly. Cow.\n\nWe ended up here after a spontaneous Yelp search when we discovered a nearby","useful":0,"cool":0},"rLqlJeAZlNSGtxVrAWddNg":{"text":"Such a great happy hour spot! During my visit to Nola, I went everyday to get my fill of o","useful":4,"cool":3},"3gvX7GvRFXUO1vAAVXJBLA":{"text":"I'm visiting from California, and for sure, much of what passes for great food in the Sout","useful":1,"cool":1},"bKs-aZ7OJGQUj0sp0mwOfg":{"text":"We had an almost perfect experience at Trenasse. We went on Thanksgiving, and I was surpri","useful":0,"cool":0},"SmeTg6u1GciGGVp8y4SG8Q":{"text":"That was a nice surprise! We were in New Orleans on vacation for almost a week, and had th","useful":0,"cool":0},"6iKzormEdrapx7EyhC8-uw":{"text":"This is a new place that was recommended by a local friend of mine. Don't think it's just ","useful":0,"cool":0},"wuQj4JPBIx57wxEPRo0OgQ":{"text":"Loved this place. Fantastic service, drinks and food menus were excellent. First went to L","useful":0,"cool":0},"UD4i9HACHLyxWRpDiNRyGw":{"text":"Second time eating at Trenasse and the poboys still make me sad. They are delicious, but c","useful":0,"cool":0},"VPTqnVBSQT2dIw-Gyp8HXA":{"text":"Went with some friends that were from out of town on Saturday night. Made reservations and","useful":0,"cool":0},"7m8FiqhnDQMY55mVU02JFQ":{"text":"Went here for my birthday dinner, everything was excellent!! Highly recommend the oyster l","useful":0,"cool":0},"5LJRGPyIVc5Lt3PUqU8ggg":{"text":"The server, Johnny, made the experience. He's from New Zealand and has an awesome humor. A","useful":0,"cool":0},"DVQXHHQ8YEdYP8RDIdwYgg":{"text":"Best value in town!  Trenasse happy hour menu; 75 cent oysters on the half shell, great dr","useful":0,"cool":0},"HatF8331moyemGaKBJEAUw":{"text":"Food is great! Price is great! Staff is AMAZING! They treated me very well when I stopped ","useful":1,"cool":0},"6JNieIL6uPcytQVXsCt0dw":{"text":"Extremely unimpressed.\n\nCame here for the first brunch of Coolinary Month - 35$ for three ","useful":1,"cool":0},"kVYZClAL8bQT64J2cqtfgw":{"text":"Great service, delicious food. Sensitive, aware, and accommodating to food allergies.","useful":0,"cool":0},"07JTx1ncJG-Ku_4Vfwr9hg":{"text":"Food was great and service was even better. Went for brunch and had the bottomless mimosas","useful":0,"cool":0},"8E1zWlB7SYTGPWO0h0rT5g":{"text":"The Fowl Gumbo with a Sazarlac is an excellent start. We had the Redfish Meunière with cra","useful":1,"cool":0},"mDT_CyGuOUqqi0j0LHiDfA":{"text":"Ayunna (hope I spelled her name correctly) was on point with the service!!  The restaurant","useful":0,"cool":0},"3ks3YS6Zz83udVrEjacEHw":{"text":"Great food. Cauliflower steak was incredible. Came in randomly and was very pleasantly sur","useful":0,"cool":0},"9E9GYtRE2rq8VfziIYE5sg":{"text":"I went here with some colleagues for some drinks at night. The bartenders took care of us ","useful":1,"cool":0},"cCLnsdxYKTV2qL4WKwPYnA":{"text":"Awesome food! And our waitress Terry was amazing! Super friendly and sweet! Everything was","useful":1,"cool":0},"lVbBEOpb_eQj0NxUG7trQw":{"text":"I went to trenasse during HH and it was great! The oysters are $.75 each and they are deli","useful":0,"cool":0},"C__GpY1Ftv2RaeOL5gKynw":{"text":"The food was delicious but the service was subpar. This place was located in a hotel and i","useful":0,"cool":0},"Nw8xIopGa5qIYuDRH0qqCQ":{"text":"I was very hesitant when Hub suggested this place for a quick bite - I mean, dude, it's a ","useful":0,"cool":0},"hbK1amwW3yuWj0oiko89gw":{"text":"Such friendly people and the food is amazing and reasonably priced.  Highly recommend.  To","useful":1,"cool":0},"sED0_1bVbsW4ps6YUkAyLg":{"text":"Finally! A fantastic meal while at Mardi Gras. I know I know... New Orleans is the good fo","useful":1,"cool":1},"amAVknkVykCyk3I6h92peQ":{"text":"We had a party of ten and we're seated in a private room. Kathleen took great care of us. ","useful":0,"cool":0},"SVyfQypNzkC1-dzO-5IY-w":{"text":"Everything was amazing. The bacon is spicy and sweet. The jalapeño cheese grits have so mu","useful":0,"cool":0},"d6AqkOIBA4D6fY8hkbDIcg":{"text":"Delicious brunch! You can't beat the bottomless mimosas for $10 per person, and there does","useful":0,"cool":0},"7QRlr1mhur6jhvBz9laFIw":{"text":"Been here twice, once in Jan and recently in Sept.  We were able to sit in their private r","useful":0,"cool":0},"fn5iDH38ARC-FWFgaiyhmQ":{"text":"Good, but nothing memorable. Good option if you're staying in the attached hotel, but ther","useful":0,"cool":0},"N4T3TObB_Ipk9lAB729A2g":{"text":"An EXCELLENT destination for fresh local oysters in NOLA with an incomparably good HH deal","useful":1,"cool":0},"ffPsDKWrA_vohDm8WPeGTQ":{"text":"In the middle of the city, a little outside of the French Quarter, around the corner of La","useful":3,"cool":1},"XIeiME4zpCF5zswXJq5U5Q":{"text":"Very pleasant.  Just  a really nice place.  \nThe grilled oysters were fantastic.  Grilled ","useful":0,"cool":0},"TwVP7khtaa3EVsxHANQG6A":{"text":"My husband and I went here every day for oysters during happy hour. They were definitely t","useful":0,"cool":0},"4uxevThj3cU7cjkoNf0glw":{"text":"Came here for dinner with a group of 12 during the Mardi Gras parade Friday. Complementary","useful":0,"cool":0},"zSalioa2iaaHFLBTuIiHDw":{"text":"The first time we went, it was literally the worst service. Literally he took the order, s","useful":0,"cool":0},"7OSIrT8in688wa08E4LPYg":{"text":"Good experience, loved the great service from Raul, he made sure I was taken care of quick","useful":0,"cool":0},"A2wx5KO8lniNyg3GHr9SXw":{"text":"I enjoyed brunch here a few days ago.  I ordered the Bene, Bene, Bene!  It's a very popula","useful":2,"cool":1},"YsVmpmKEKxKhpBHojZ29HQ":{"text":"This place was excellent. Went for Happy Hour and had 3 platters of oysters, crawfish pot ","useful":0,"cool":0},"0nji-Wo4utxMu_oafDqZcw":{"text":"This place has the most amazing service and food! I had a Sazerac, my first, and the waite","useful":1,"cool":0},"kBsSBIfiS0b_-KKl0n228A":{"text":"Appetizer French garlic bread was great, love the butter and ambience. Was almost talked i","useful":1,"cool":0},"CiykVUpH0MWTMi1u4Xkchg":{"text":"Pretty average food, not sure how they get 4.5 stars. We ordered oysters, escargot, stinky","useful":0,"cool":0},"4pvpuSh1FNfvpwHobD5_FQ":{"text":"Great oyster happy hour 3-6pm,  and great oysters in general.  I like raw oysters but they","useful":0,"cool":0},"uEXSzrDQKEfrsZfa9hXXOA":{"text":"I don't even know where to begin. We started out with chicharrones that came with this ama","useful":0,"cool":1},"4leC6eRCYBvNCm4WwHaDEg":{"text":"The first time we went there wad during the Mardi gras weekend. Had a reservation do got s","useful":0,"cool":0},"fmvcxYHsAr2GKes5spQW7w":{"text":"It was pretty good, nothing too spectacular. I have the combo so I got half of a shrimp Po","useful":0,"cool":0},"8SAhDT1Lh8MzrRpLiiWOPQ":{"text":"After being turned away from brunch at Luke, which we were told was completely booked, we ","useful":5,"cool":2},"P8DXEAmsoJiirtiBrUhvLw":{"text":"Great fresh Oysters if that's your thing. We visited twice, the short ribs were amazing!","useful":0,"cool":0},"TjPFfLSZstWoiGURu9j_yA":{"text":"Excellent food.  I highly recommend Crawfish Pie, Crab Bisque and any fish on their daily ","useful":0,"cool":0},"jTD2_Wmx4gGNgG1ynhDfqw":{"text":"A def fav spot in the city! Great atmosphere and everything is yummy.  My top recommendati","useful":0,"cool":0},"Ux3j2-stggmNek_DxqnMqw":{"text":"Order the BBQ shrimp and ask for extra bread.  Whew!  The staff is very friendly and helpf","useful":1,"cool":0},"0sQPINUZQRebVNnssMphhQ":{"text":"Damn. One of our first stops in New Orleans. Get all the grilled oysters. All of them. Ple","useful":0,"cool":0},"vi0x8KyDIXP35ASZEieetA":{"text":"Great food! Great service! Ceviche was delicious, the mojitos were a little on the bitter ","useful":0,"cool":0},"LHce_d9iUcEeCDnQKiTLIQ":{"text":"A restaurant to visit if you're in town. As a local, you except the best quality food at s","useful":0,"cool":0},"EEgs9TI93xxE2lVM7BFj_A":{"text":"Wonderful food and beverage, great desserts too.  While I'm a hotel, this is definitely a ","useful":0,"cool":0},"5vZCV__R8wQMNGOkRU9w2w":{"text":"Super food super service. The kids menu is awesome. Best thing about the kids menu is choi","useful":0,"cool":0},"FIJnGAq0vu_Msi0go7rhsg":{"text":"The happy hour menu items were awesome!\nThe staff is friendly, especially Michelle. Thank ","useful":2,"cool":1},"10aqxhjZoCy4XGcjaU7hXA":{"text":"I just stopped by for a quick bite and sat at the oyster bar.  I ordered barbecue shrimp w","useful":1,"cool":0},"GHHtnCXyTOwgMJ5jWKWVYw":{"text":"Great food! Awesome service!! Had the Grouper with stir fry. The waitstaff is very good es","useful":0,"cool":0},"JNXAHBhDfH-sHauxRB4dgg":{"text":"Came here for lunch based on the high Yelp review. My wife and I split a few things: crab ","useful":0,"cool":0},"cyOm1XjQbhDwmEVfrNTNjg":{"text":"Trenasse is just wonderful! Delightful staff, amazing food, and if you catch it on the rig","useful":0,"cool":0},"b6Yv1zr9p0xnSlXPPuKnBw":{"text":"Wow!\nThe complimentary pork rinds they give you are out of the world.\nWe ate here during h","useful":1,"cool":0},"WvHzUNkVvWYDFzlqMulUzw":{"text":"We arrived at the restaurant around 7 pm on a Sunday night; it was about half full and I w","useful":0,"cool":0},"7NAypZ17dLDsUcBIcww6Dw":{"text":"Review is only for happy hour, which is 3-6PM.*\n\nHappy hour drink prices are regular price","useful":6,"cool":2},"sMkH4s58e3ibTr-kWKpEYQ":{"text":"Really creative, well executed menu. Fried frog legs with Stilton and honeycomb were perfe","useful":2,"cool":0},"6z2QkvyjZr4NuIpQ-zt58Q":{"text":"This place was bad. The service was slow and our food ended up comped because it was so ba","useful":1,"cool":0},"2PMq9LCuz6RDO4eIG4EFuQ":{"text":"Chose this place for dining on my vacation given star rating and proximity to hotel, howev","useful":0,"cool":0},"kL_F6QhOOH9iACNEDsqkKA":{"text":"Our first dinner in NOLA. We made reservations for a Tuesday evening that was not necessar","useful":4,"cool":1},"7OPIXak5rZUOtpu6sbDgKg":{"text":"We had a group of 7 and we chose this spot as our last group dinner of our trip to New Orl","useful":1,"cool":0},"QelCSE0Y1Uqt632jsotugA":{"text":"The wife and I dined here with some friends and greatly enjoyed the food and company.\n\nThe","useful":1,"cool":0},"6Dlf1dfIuUrxsdIQJCQPAg":{"text":"My family and I were in New Orleans for a short time and wanted good food! This was a grea","useful":0,"cool":0},"Q1gs5TnkeUgk_6QldfOJhA":{"text":"I hate to have to update my review -- but I've seen a serious decline in quality with a sl","useful":3,"cool":1},"b7VQ45mFliuJQD_Kt--sBg":{"text":"Wow! Really great food in a Hotel? Yes. We are here in NO for 3 days visiting from San Fra","useful":0,"cool":0},"_DaHlw22UQrEVoukGo-iQg":{"text":"Had lunch here. This place stands up to any other big name restaurants in New Orleans.","useful":0,"cool":0},"4FL23o59fe7aIVvsH_ESKw":{"text":"Solid 3 star restaurant, I'm thinking its higher overall because of the amount of tourists","useful":0,"cool":0},"66X-h7K22T44TdIcnM_Xzg":{"text":"75 cents oysters for happy hour were awesome! We also tried the crawfish pie which was pre","useful":2,"cool":0},"8yBFZTWbef1tRJpLL8RPrA":{"text":"The food was alright. The reason I'm giving them 2 stars is because the server was very ru","useful":0,"cool":0},"_r6oLGEVgWg0G8_9U3cndQ":{"text":"Best meal in NOLA.  wonderful garlic bread.  lobster tail with fried green tomatoes were i","useful":0,"cool":0},"ZBNc5jkSHVhhGl7U73EQjQ":{"text":"I came here for lunch with 2 friends.  Food was fantastic.  We ordered bbq as an app as we","useful":3,"cool":3},"RrJCk-43E7y0qz4rb7KNTg":{"text":"Food is ok but not as good as Luke's across the street. We ordered French Toast and Beef G","useful":0,"cool":0},"ZRXx7Lpa9h_uYHixiAzgSQ":{"text":"We love the inventive take on contemporary creole. The cauliflower steak is decadent. The ","useful":1,"cool":0},"pguzHeealQX0ciTDZFHLUg":{"text":"I wish we stayed here over the hotel across the street. We only visited for happy hour. Hi","useful":4,"cool":4},"CcF2CVCiJOhUxhyvuzre9A":{"text":"They have a absolutely amazing STAFF!  I had a great waitress great conversation came to t","useful":0,"cool":1},"eCtYyrXrhN6qlWqLtDowtw":{"text":"Happy to discover this hidden gem easily overlooked by tourists seeking the celebrity chef","useful":1,"cool":0},"oem7KLtXjIfWmwZ8WTEDpQ":{"text":"Amazing food & service.  Our waitress was very patient and answers all of our questions.  ","useful":0,"cool":0},"IKz6L6rcfaF7Sb4uJGcGMg":{"text":"It wasn't bad but had hoped for more with the food. Service was really good and very atten","useful":0,"cool":0},"7EPqS84YEEHlPQlG82uA_A":{"text":"I ate here with my work colleagues today and it was a very nice surprise!!...we had an eve","useful":1,"cool":1},"yQ0nxwrV6a8-ShGDjmrfZw":{"text":"great oysters at happy hour, wedge salad is amazing. would come here again, definitely wan","useful":0,"cool":0},"e5_r84f9TqrZBrIiWj9Qiw":{"text":"I was 20 min late for my reservation,,but they were willing to seat me with the understand","useful":2,"cool":1},"N0UPDMrcTif6-aE4lY-NuA":{"text":"Amazing food!\nYou can't go wrong with this restaurant. The Chef is a genius and the staff ","useful":1,"cool":0},"2MmFSGAdLkj9SZlunP-37A":{"text":"I rarely give five stars but this places earned it. It's their happy hour that put them ov","useful":0,"cool":0},"2zzftY7t2T8Wj4DSEOdHLQ":{"text":"This was Not one of the better Cajun food experiences we had in our trip to LA last week. ","useful":0,"cool":0},"veB2Uuf8G4zY74YzYO9rSg":{"text":"Omg!! Second time here and this place never disappoints!! Why would anyone order Jimmy Joh","useful":1,"cool":0},"XFFrUVyiNF4ZMIRSiqIh5w":{"text":"My date and I decided to come here specifically for Happy Hour, as we had reservations at ","useful":0,"cool":0},"CIlU16qQrtEz2swnPuy4FQ":{"text":"Best food of our New Orleans trip! We enjoyed the fire grilled oysters. They were perfectl","useful":0,"cool":0},"FZQjk85-cK3Z9Uyi6j2bZQ":{"text":"Some of the best food my wife and I have ever had!! Get the Crawfish Pie!! I have travelle","useful":0,"cool":0},"DWPSMr4odhwZpPlBqhgiWw":{"text":"Amazing happy hour! Great staff, fresh oysters on the half shell with yummy drinks, crawfi","useful":0,"cool":0},"iJEpeM_wE2IVlSqbRcaTLA":{"text":"4.5*\nThis restaurants looks so beautiful inside.  There was about six of us and we all sha","useful":1,"cool":0},"RT0AzrQOLH-s4I8v38jA5Q":{"text":"This is a great atmosphere, and the food was terrific. We had the crab bisque, which was w","useful":0,"cool":0},"v9toauzNE828ctfQF5gTBg":{"text":"Great brunch and quality food. You can't beat the $10 all you can drink mimosas. Had the t","useful":1,"cool":0},"-LIRhLkPNLmvhDWc8gA8JQ":{"text":"First time at this place, walked in for lunch on a thursday with high expectations looking","useful":0,"cool":0},"0hSCYqcZEU9qdnXXpsgUZA":{"text":"Amazing southern hospitality service!! Our waiter (I don't recall his name) was a young As","useful":0,"cool":0},"v-KDr9hiGk9U5ikEVSgODg":{"text":"Excellent!! I went for happy hour which is every day. Service was great. And the food was ","useful":0,"cool":0},"AkHSphIDhViHQWCIeIstCw":{"text":"Sweet, fresh oysters for 0.75?  Yes, I'm a fan!  Served simply with horseradish, cocktail ","useful":0,"cool":0},"XfCNf6MiUAQDzTDB1fNToA":{"text":"(I'm doing everything in my power to use profanity out of joy for this place) This place i","useful":0,"cool":0},"0mNMlbZlw3JN9e1M2frgLw":{"text":"I was so disappointed by our experience with this restaurant. In my opinion, the food tast","useful":0,"cool":0},"S_SKTiWCA_sGOrywo8n4qQ":{"text":"Everything was great! Happy hours is amazing! Oysters so fresh and clean yet very big! Cat","useful":2,"cool":1},"Ryj-aOrsE4fcYYf2j36Lfw":{"text":"Bread pudding Sundae & chocolate peanut butter cookie with Grand Marnier sauce for Dessert","useful":0,"cool":0},"oZd2sTJvh1WYio5WTxlVZQ":{"text":"We were excited for this one, but Trenasse was a bit of a disappointment unfortunately. Ma","useful":0,"cool":0},"nbJrH8_f2O5138fKhSw-zQ":{"text":"You may not want to dine inside the Hilton hotel, But this restaurant is a great place to ","useful":0,"cool":0},"KVuUTtnN3dwdZM_AT0m7Ew":{"text":"We were an obnoxious large party of young adults, service was still amazing. I ordered the","useful":0,"cool":0},"B-yqwjxcn_LU3fqjRFVLjg":{"text":"Went during happy hour and had a great experience. Tried 5 or 6 different dishes, which ar","useful":1,"cool":0},"fx2uVrXQLB35qDg3RcM-KA":{"text":"We had reservations and was seared fairly quickly when we arrived. We ordered a round of d","useful":0,"cool":1},"JKO1MlgHs_0GxRxK3PqYtg":{"text":"5 stars for food and 5+ stars for service!  Our server Jonathan was friendly, professional","useful":0,"cool":1},"vaVe_VcCGNoluiWzY9ceVQ":{"text":"I am disappointed. The ambiance is good. Food is mediocre. I travelled the country and saw","useful":0,"cool":0},"Dk9kx4U1sjnBXDU72u671Q":{"text":"The staff is really nice and very hospitable. Excellent service and good food. Crab trio w","useful":0,"cool":0},"tULpF_eo1gkeSzkUmZmXJQ":{"text":"Hands down, one of the best restaurants I visited while in New Orleans! The food was 5 sta","useful":0,"cool":0},"xWBmIgQsZF0_ghkHaplymA":{"text":"Very underwhelming experience. Food was just ok. Service was poor. Really don't know where","useful":0,"cool":0},"LO91rJW2srrmpOP8zi6c4A":{"text":"Went for Happy Hour for drinks and a lite dinner.  Told waiter we were there for Happy Hou","useful":0,"cool":0},"EdQpMBiRJuu1nGtMeZKtkQ":{"text":"Walked in for brunch on a Saturday. It wasn't busy and is located in a hotel.  We almost w","useful":1,"cool":1},"Gw74XFQGEW6GGQBwhf_eqw":{"text":"After a long week of eating pretty heavy, I was wanting to find a place with some good sou","useful":0,"cool":0},"j2bUAxdQUkgVFo-Ovj0qCg":{"text":"Lunch is nothing special. Standard po boys and other NOLA fare.  Given the reviews I was e","useful":0,"cool":0},"ALDePT1SI4ouQfKVpn-ZHg":{"text":"Read other reviews that suggested bad service but decided to give them a try anyway during","useful":0,"cool":0},"qoibqczrsAeKT-kvP7_Nnw":{"text":"Get the crawfish pot pie!! It was so good and different from the typical New Orleans menu ","useful":1,"cool":0},"0u-JgU8LOFGjUnAFUpxo6A":{"text":"The crab bisque was probably the best soup I've ever put in my mouth. I would eat this eve","useful":1,"cool":0},"1qFuHyLXS7Pt-mWczjriAQ":{"text":"Went for lunch had the Nola Mule and the Crayfish pie both were quite enjoyable. Service w","useful":0,"cool":0},"mQ0VirQq2MgvpFJT7DnD1Q":{"text":"September 2016: This is a hidden gem.  Yes it is in a hotel, but throw away your pre-expec","useful":0,"cool":0},"RogZ9ZMzFtG8ZBAl6bqrSw":{"text":"We have been to Trenasse a couple times for lunch, but we had a party of 10 for dinner. Pe","useful":1,"cool":0},"QMVNdKnPJLYcbmBGXTOCsg":{"text":"This was my second time at Trenasse and like my first visit I did not leave disappointed. ","useful":0,"cool":0},"kDK96VtoSy61VfUcoeRTtg":{"text":"This place was pretty good. Cute ambience (a bit fancier than most places I've been to in ","useful":0,"cool":0},"7JumYxwXgZaTn01D-sFg4w":{"text":"This is one of my favorite CBD restaurants. Wonderful food, wonderful ambiance and great s","useful":1,"cool":0},"K-pSbxsr7VBqWsPr0oHLNA":{"text":"The decor, ambiance, atmosphere, service, and the food were all phenomenal. Our server was","useful":1,"cool":0},"Jb8g8HZz-ZP1i4KVtyvaAA":{"text":"Delicious crawfish pie. Cracklings with spicy butter?!?! Dang I must be in Louisiana. I su","useful":0,"cool":0},"zEKvo04YNGPGrgMXyD0nXg":{"text":"Atmosphere 5/5\nService 4.5/5\nFood 4.5/5\n\nWe initially had reservations at another restaura","useful":0,"cool":0},"U2lHkyecDfSnCyXTbP8OtA":{"text":"We were walking to the French Quarter on Xmas day.  Not much was open, so we stumbled in. ","useful":0,"cool":0},"CnXEKMu2DyUEWnPS_2dXUg":{"text":"I seriously had the worst experience with a restaurant in my life here. \n\nA couple of my f","useful":0,"cool":0},"0kNHMoMbRev-grKZshYB8w":{"text":"Good dink selection great bartenders mixes very strong drinks and very quick about it I hi","useful":0,"cool":0},"YZ-odo4qykqhfnIbpMVCjA":{"text":"My boyfriend and I had dinner here last night and it was so delicious! We got the charbroi","useful":0,"cool":0},"yhxDSTHnN3VzwZ9oi7wpfQ":{"text":"Dined here because we were staying in hotel and restaurant received good reviews.  Cocktai","useful":0,"cool":0},"62YIMY-H9jUyW5mQzx3dGg":{"text":"After missing my flight :( , I still made it in time for brunch. The shrimp and grits were","useful":0,"cool":0},"aLsiq3Wn-mB2xx7CuMLpTQ":{"text":"You must try their cauliflower steak and stuffed squash! They have been my favorite foods ","useful":0,"cool":0},"gYKnIb1k1LmJ7lYcj4FOIA":{"text":"This was the first restaurant I visited when I came to New Orleans. My friends and I chose","useful":1,"cool":0},"ZinA1zPTyKg-CkPeOUnPsg":{"text":"Service and friendliness = 5 stars.  Gumbo = 5 stars...!!!!   Bread and butter = 4 stars. ","useful":1,"cool":0},"r9uwy26J3U1gX0eEWafWAA":{"text":"Crawfish Pie - the crawfish were overpowered by the rich, spicy stuffing. I would have pre","useful":0,"cool":0},"DkbCPYqsebCKBw0FjPAkeg":{"text":"Not the same old Nola fare for sure. all the food we ordered was interesting!  It would be","useful":1,"cool":0},"np3YYeNuPkouT8fgedOkVw":{"text":"I really wanted to like this place. Not only was it my first meal in New Orleans but I was","useful":0,"cool":0},"7OSvpid2E5WClGH7VwiZHw":{"text":"Came for happy hour and everything was delicious. We tried almost every item on the menu a","useful":0,"cool":0},"rs78v2PqZxw_7UUe0oEIOA":{"text":"Our first meal in NOLA was here, after a long flight, we needed some good food and this pl","useful":1,"cool":0},"r-3m8SqMEHQiWNauuJ9MSQ":{"text":"The food was delicious. We were looking for something creole and it was exactly what we wa","useful":0,"cool":0},"fcx6kpf6MVHwyYV8UxWsgg":{"text":"Tried escargot, boudin balls, bbq shrimp, lamb chops and filet. \n\nAll three of the apps we","useful":1,"cool":0},"PstiH_tLxEnBupn1trHBCg":{"text":"The food was good, but the service was utterly abysmal. It took almost 3 hours from the ti","useful":0,"cool":0},"9RArFlQd46aAWut43axvoQ":{"text":"The menu consists of meals separated into first to fourth course. I got the Stinky's stew ","useful":0,"cool":0},"oN1rTpzOOvy9_aBtzo4tEA":{"text":"Goodness gracious, this food was amazing.\n\nWe arrived at 3pm for their happy hour, but to ","useful":0,"cool":0},"VdLSeUXJE7tqrvz0kU0Yfw":{"text":"OMG! I will definitely be back on my next visit. I ended up here because there was some ev","useful":0,"cool":0},"slVKdRxAGvxi4OWznCy35A":{"text":"My husband and I went to New Orleans for our anniversary and our first stop was to Trenass","useful":0,"cool":0},"IqGYGzP2KGBEZUjYlq8FFA":{"text":"Had dinner here with my wife. I started with the escargot and the wife had the oyster sala","useful":0,"cool":0},"Pgy0SZ1PHvPiIoCOmveSkA":{"text":"Absolutely delicious food! We had a group of nine for my boyfriends birthday and they set ","useful":0,"cool":1},"tTlNEqaHYlTtirEHiaou0g":{"text":"Great experience, in terms of food and service. \nThis restaurant is located inside of a ho","useful":1,"cool":0},"N39xdCYTzYCPO-sfXJKTFg":{"text":"Amazing!!!  The service was great and the food was on point!! Some of what we had included","useful":1,"cool":0},"9EN8UgEwVsCIaR5ucxIhQw":{"text":"The raw oysters were the best I've ever had. I'm 61 years old so I've eaten a few oysters.","useful":0,"cool":0},"nvBMKZTDcb1TH1TnP9WANQ":{"text":"I'm a local who enjoys great food. I come here for brunch at least three times a month. Tr","useful":1,"cool":1},"3rL8WMCCB_-Gr0kLwfroDA":{"text":"Very great service and a nice atmosphere. My sister in law and I went here tonight for app","useful":0,"cool":0},"S41GqwOYxnGdx18XU8QlJQ":{"text":"I normally don't write comments after I dine, but this place is just so slow and awful tha","useful":0,"cool":0},"n5Ht8bhir1ppC_vdxPNBTg":{"text":"Yep I'd go again! Waiter Gilly was lovely and engaged with us, 2 55ish women who love new ","useful":0,"cool":0},"yDKWXABoVdwZhxKntfGuGQ":{"text":"Meh!  The crab soup was nice. But. The oysters:  ruined. Soggy crust and weird corn dressi","useful":0,"cool":0},"VQ0-qG71alPwQ8on6-DImQ":{"text":"We had brunch at Trenasse (Intercontinental hotel) and our server, Kevin was absolutely am","useful":0,"cool":0},"iuGtXAlGl7w4em8W3jSnSQ":{"text":"Red fish & Stinky's soup excellent as well as the blue crab poor boy. First time in New Or","useful":0,"cool":0},"BrqNjoooDWUSd4h7KXw6lg":{"text":"My family and I went for lunch during coolinary and got the special for 20$, we also got t","useful":0,"cool":0},"VfhfLoOAssIyhBOsyhIbIQ":{"text":"Great service and incredible food!  J.L. was a server that every restaurant should aspire ","useful":1,"cool":0},"_5wl3s9RWibLXyyJ52BEPg":{"text":"This place was SO loud that it became uncomfortable and unpleasant as we could not maintai","useful":0,"cool":0},"M2Y72T_9dyV-to2mzPuQtw":{"text":"Loved this place so much I ate here 2 days in a row!  Sa at the bar and had great wine by ","useful":0,"cool":0},"GJ0jz5alU2o7CIDd74SLJQ":{"text":"The BEST restaurant in the city of New Orleans! Amazing food, incredible hospitality from ","useful":0,"cool":0},"pEfKyLoXgaupjqcyyR6_YA":{"text":"One of my favorite HH (3-6 pm) spots for oysters! The ambiance is very lovely and people a","useful":0,"cool":0},"F8IyQnlucv_A_RRBUajUXQ":{"text":"I was going to give this restaurant 2 stars but the Drinks and oysters stopped me doing th","useful":0,"cool":0},"Xe3mCls81XVLeNyFnTtVbg":{"text":"Had the crispy fish PO'boy and blue crab bisque. Outstanding. Service and atmosphere were ","useful":0,"cool":0},"TfRIar5lVgNr0SCOH-kmqg":{"text":"This was so good!!! A recommendation from a friend that was amazing. We sat at the oyster ","useful":0,"cool":0},"ARbTRI8bsJYkvcGPOg33HA":{"text":"Well, when the wife says it is awesome and every other word is OMG, the place is gonna get","useful":0,"cool":0},"Vg3auNhfCzTXfY0RiYNgCw":{"text":"The pirate punch was awesome. We ordered a few different oysters and they were all amazing","useful":0,"cool":2},"C8UPeXcFB60SN3i3cPsjaQ":{"text":"The food was great and I wish I could say the same for the service.   My husband had the w","useful":0,"cool":0},"vXFQWkdCvrdhl4nR2q4cQw":{"text":"Four stars for atmosphere and ambience, the food was good, but probably not largest portio","useful":0,"cool":0},"MJawJMVvltwXhBilsMMgxw":{"text":"Well, Trenasse started stronger than it finished. I was able to make a last minute reserva","useful":1,"cool":0},"UOQksU4aLORjifIq4iPnTQ":{"text":"Food was fantastic and happy hour specials were great. 5$ cocktails and beers and .75$ raw","useful":1,"cool":2},"dBSxI3KQ2ylWvGScW7WSrQ":{"text":"Was craving scallops around 2:30 in the afternoon and didn't want to wait till 5 to track ","useful":2,"cool":2},"ZFaFt5zKyU-XgKhCtDKB-w":{"text":"The 3 soup sampler was so good.  The best was the blue crab bisque, but all 3 were awesome","useful":2,"cool":0},"gVlzxXG4AXAqyHvvcB010Q":{"text":"Came during HH while staying at the InterContinental and it was really good. Had the boudi","useful":0,"cool":0},"ucpj4heZ1uRUb-XlXdkLtw":{"text":"My tween daughters and I enjoyed a fantastic modern Cajun dinner last week. Service, ambie","useful":0,"cool":0},"u_WS8TGttMOoteSx5wDtAw":{"text":"Amazing food!! \n\nWhy the 4 stars? SERVICE! (Service was slow & we had to literally flag ou","useful":0,"cool":0},"WHheebo36cyB1wlrzPiyfg":{"text":"Really superb food. I ordered the scallops special which was amazing. Husband got the craw","useful":1,"cool":0},"3NVKPuBYbWSmAt_FmtfPpQ":{"text":"Traveled a long way to get to this place and have to say I HATE to write a bad reviews but","useful":0,"cool":0},"VZcwjf_jC9aUL0174BpcXg":{"text":"Wow - we were SO pleasantly surprised by this gem of a restaurant. We stayed at the Omni R","useful":0,"cool":0},"6BMiGJlqiXr61_fpCzJ5fA":{"text":"Excellent service.  Now that I have that out of the way, let's talk about the food  AMAZIN","useful":0,"cool":0},"673hpvWiFO7qbSB5lZZXWw":{"text":"Went for Valentines and it was a major disappointment from start to finish. Got there earl","useful":0,"cool":0},"Y4sLOMOPMPrdF-McXP0HxA":{"text":"Overall a great hotel restaurant. I started off with the blue crab bisque, which was highl","useful":0,"cool":1},"P1Zn8NRfptvO-qTne-zJSg":{"text":"Good food, nice location, good service. However I wish they could clean the oyster shell a","useful":0,"cool":0},"MH07wFUCMDiyfgR9eMaXVw":{"text":"Great happy hour!! I thought the bbq shrimp on the happy hour menu was a little too salty,","useful":1,"cool":0},"6b_OR9MXeAS5QmfE72g2qA":{"text":"Happy hour is great here! Our server named Johnny is sooooooo friendly and sweet. Also, th","useful":0,"cool":0},"hf48Uy5KHaGBohWP4TPnkw":{"text":"This review is long overdue.  We visited in January 2016 and after several days of the typ","useful":0,"cool":0},"mlroFMO5xy-TyWGvquubUA":{"text":"What a wonderful time we had at Trenasse. Since we were staying at a nearby hotel, we hit ","useful":0,"cool":0},"QhNCV5KZehdBR38dHTamBw":{"text":"Visited Trenasse for their awesome 75 cent oyster happy hour (3p - 6p daily) and a quick s","useful":0,"cool":0},"2p7NimtG01WMGQhva9b-eQ":{"text":"3.5 stars for being too salty.  Otherwise I'd give it 5 stars . Got the three soup and the","useful":0,"cool":0},"Y1xoFeL-HAvWz5EIeb2rdw":{"text":"Overall very good. Ordered BBQ shrimp, taste of trenasse, and bread pudding.  \n\nBBQ Shrimp","useful":1,"cool":1},"29TzevQd-y5POo4iNLG6iw":{"text":"I went here with my best friend for my birthday dinner. We read a lot of good reviews, dec","useful":0,"cool":0},"S7sVO0D2TcFGXoiCRUFpIA":{"text":"Had dinner here on New Years Eve. What an amazing meal!  My son and I ordered a variety of","useful":1,"cool":0},"q-Hub-a2jVoZXClAK_dmQA":{"text":"For happy hour:  $3/$4 beers $0.75 raw oysters.  So good. \n\nI'm told we broke the record w","useful":0,"cool":0},"9vLTA1jqBr7Fm_9FtIdkbQ":{"text":"A little taste of Cajun deliciousness. \n\nAmbiance: Located inside a hotel, this is a nice,","useful":0,"cool":0},"7NUu6mEcL_FjbkwW8y0rFg":{"text":"The food was wonderful and the live music was terrific. We will be back!","useful":0,"cool":0},"LqS5MknsjKcsZBEJ2Ktytw":{"text":"This restaurant is located in the intercontinental hotel. Atmosphere seemed upscale, but w","useful":0,"cool":0},"lyQsoWQ8847jAvwO78MaCw":{"text":"I didn't like the atmosphere. It was too dark and as it's in the hotel, you could hear and","useful":0,"cool":0},"4EHNvvJvBfCNQnH0Y-2vrQ":{"text":"Arrived to Lowes late. Looked for a close by place for dinner. Liked what I saw on yelp so","useful":1,"cool":1},"XhQwXz9b7gilP1DK9-GtRg":{"text":"My Lord! Go eat here! I've spend 6 yrs eating my way through SF and decided to try this on","useful":0,"cool":0},"jcNwG5Vpa5H7pmRFCmXMzg":{"text":"Excellent choice.  Great atmosphere.  Many different choices of local character appetizers","useful":0,"cool":1},"chIv3aSKvxdB-kXk8TJRPg":{"text":"went for easter brunch.  $10 endless mimosas no longer on menu.  shrimp and grits totally ","useful":0,"cool":0},"9U9tU_BzMvBGrDtU3xKOGA":{"text":"Went for the happy hour special.  I can't believe the .75 cent oysters .  They did have sp","useful":0,"cool":0},"qd-xsWY0hkkyy1-shZjByQ":{"text":"We stayed at the Intercontinental for 3 nights and came down to the hotel bar for 2 of tho","useful":2,"cool":1},"eSDJOGb_PMsM0n3GN8y_4Q":{"text":"We had great service and a fabulous meal.  Don't be deterred by the fact that it is in a h","useful":0,"cool":0},"Kk63MTZG5Si5MgZPiS25sg":{"text":"Sorry but I cannot recommend this restaurant.  Food was good but service was terrible.  Un","useful":0,"cool":0},"2eNT_UuDJRnBcnAUeRT5tw":{"text":"I had the blue crab bisque and fried oyster salad. The bisque was okay. It needed salt and","useful":0,"cool":0},"Oi4LZwMkXlQrre5Y2V3Rvg":{"text":"I Came for happy hour. Had the crawfish pie, Boudin balls and fish nuggets. The pie was fi","useful":0,"cool":0},"WT72i9lM_T0X_u1R3HDJvg":{"text":"The food is absolutely amazing.   I had soup and salad for lunch today (both the taste and","useful":0,"cool":0},"FsZ_YOK6pq_moR1DG0NXVw":{"text":"The food was incredible and the service was awesome. The shrimp and grits is to die for! A","useful":0,"cool":0},"KW8smWOdKG1HvzAROCfUXg":{"text":"Trenasse only gets 3 stars because they had an amazing crab meat po-boy, other than that, ","useful":1,"cool":0},"2mYzk_RBa_Q4MTv9r9MT5A":{"text":"We were disappointed. After reading reviews we were expecting a great meal, but what we go","useful":0,"cool":0},"9_dbCEGtjdddOV5pR7Kzeg":{"text":"Came in for a light dinner on Friday night while visiting NOLA for the weekend. Our server","useful":1,"cool":0},"BnC-VJU_9s_Tlu9umY-pgQ":{"text":"Disappointed. Not sure how this place got 4 1/2 stars. Char-grilled oysters need charring!","useful":0,"cool":0},"yUn9YDZ9qrsnIG5dgVrKfQ":{"text":"On our first night in New Orleans, we were looking for some of the basic well know New Orl","useful":1,"cool":0},"4qeWyXeQNWkWSjfrPcWcKQ":{"text":"All in all,this restaurant is ok.\n\nBecause of Luke (across the street), I can now only dri","useful":0,"cool":0},"IFFvYfV7XWYkYHDw6HhiTA":{"text":"Amazing!!! I wish the platters were bigger, but that's the fun part. Try a little of every","useful":1,"cool":1},"GB5qz2lGWf_TwC-j92Lefg":{"text":"Good food. Little pricy. Tables are very close to each other. Not great for an intimate di","useful":0,"cool":0},"-KvYQniwtxycXu3PiomOlg":{"text":"Trenasse is a bit of a hidden gem, part of and on the side of the Intercontinental with it","useful":0,"cool":0},"2ZsykCTli4yRLJ8bC08yVg":{"text":"Awesome food with good price. Out of the tourist areas so they are not targeting one time ","useful":0,"cool":0},"-ZgxBoowNeqYFsZGMGga-Q":{"text":"OMG! Wonderful food.  I always have second thoughts about eating in restaurants in hotels ","useful":3,"cool":1},"F3JUWpgS9myYjt69WFSy5w":{"text":"I wish I can put 0 stars. My friends and I ate at this restaurant while we were visiting N","useful":0,"cool":0},"VAKo7u_951jEcta6J-Lf2g":{"text":"I had thee worst food this city has to offer and all of that could've been avoided had we ","useful":1,"cool":0},"6cn8F3qG8axI8wfzfit65A":{"text":"Stinky's stew is good, even though price is a bit higher than 2$ sign. \n\nThis restaurant  ","useful":1,"cool":0},"bE0TjkEBSmyugrRMaMQ1-Q":{"text":"The happy hour here is so awesome! Skip the chargrilled/cooked oysters and just order the ","useful":0,"cool":0},"_5RfEQ1L9qva1IoG7plYVw":{"text":"Food was amazing! The gumbo was great! If we could have tried everything on the menu, we w","useful":0,"cool":0},"Q_kM0MI6sXP09loXhBXjhg":{"text":"This cozy restaurant is a must if you are in the business district of New Orleans downtown","useful":1,"cool":0},"xvNFHy2XHp8AZ8rh2vN3qQ":{"text":"Amazing! The raw bar items are out of this world...charbroiled oysters of all types! The G","useful":0,"cool":0},"GwvkpO1LMpxGQrBGpufSog":{"text":"So my review is based solely on the booth they had set up during Mardi Gras. Flipping amaz","useful":2,"cool":0},"kdOV-3VUaBJ8hyO4Qc1dHw":{"text":"Our server Johnny was helpful and delightful. The food was fantastic as well as the \"Stink","useful":1,"cool":1},"4dRLWIqBOXMP4ZaY7NOO8Q":{"text":"Great happy hour menu.  Very cheap oyster on half shell though they are not as briny as I ","useful":1,"cool":1},"vty32O1lhRkRqHfzo-SH3w":{"text":"Stopped in for Happy Hour on a Tuesday around 4 pm and hand some great appetizers and drin","useful":0,"cool":0},"NnS4WU7Nux30AxuJ4mK2SA":{"text":"Great experience.  Good ambiance, great service.  I have never had frog legs so I had to t","useful":0,"cool":0},"LuVXj67LBIJR72uzBKLL5w":{"text":"Being a local there are so many tremendously fabulous restaurants I'm disappointed that we","useful":0,"cool":0},"UcfobvTw4ptoBmWcH92zqw":{"text":"Gregory gave us twice as much food. It was awesome. I definitely needed something to soak ","useful":0,"cool":0},"4vSeLb9KFJHlHmKDIKnBAw":{"text":"Had an excellent meal here last night. Started with oysters and lobster as appetizers. The","useful":1,"cool":1},"hvME5CP1rs-a7KAHp4YEYQ":{"text":"I just checked into the Intercontinental hotel and thought about venturing out for dinner ","useful":0,"cool":0},"-pJ97TPnjvX0AzPDwqsspA":{"text":"Sat at bar. Tasty Benny benny benny for later version of brunch. Audubon cocktail nicely b","useful":0,"cool":0},"X29y3nDimqZOGe5SSPGAdA":{"text":"OMG Crawfish pie is the best thing we ever ate!  Homemade puff pastry crust with a creamy ","useful":0,"cool":0},"wDM5RtxC0Jl26nTgdVN6ew":{"text":"Boudin was great!  Server was wonderful.  Gin cocktail was amazing.  Wish I'd had room for","useful":0,"cool":0},"2Nb_45EZ40BAHyqXRy0Vug":{"text":"Had dinner at another establishment while in New Orleans. Hands down this place has better","useful":0,"cool":0},"MU3ezrmEdpw8SXl2Rc0B6w":{"text":"Our group of nine had missed our reservations at another nearby restaurant but were fortun","useful":0,"cool":0},"XzM7xnzCnyH6isNuQShu_Q":{"text":"Had a great meal . Kathleen our server was awesome.. Highly recommend  Grilled Mahi Mahi a","useful":0,"cool":0},"F88-06KJyC5RjaFvC9a0Yw":{"text":"All we had were the raw oysters and drinks at the bar (for Christmas dinner) but it was ph","useful":1,"cool":0},"KYP-lmw_a6XunXoN5HE-TA":{"text":"The oyster log is a must try, worth trying out. Really enjoyed their cocktails and ambienc","useful":0,"cool":0},"LeLwmbID1WUju7ifV1TMBg":{"text":"I grabbed a late lunch at the bar.  Super welcoming and the bartender had great suggestion","useful":0,"cool":0},"0pc7qitMGHLhoYoLnu5KDg":{"text":"Went on a Sunday for brunch. They offer $10 bottomless mimosas. Our sever was incredible a","useful":0,"cool":0},"xVQEc0y2Hvc7PTDBQRM8Bw":{"text":"Great happy hour\n\nLove Ryan who was sour server.  This is my 3 rd time here and he is the ","useful":0,"cool":0},"3RTay4cMU3qaWHuIEDqpKQ":{"text":"I didn't realize this was in a hotel but it was delicious! My sister and I could figure ou","useful":1,"cool":0},"7kWskCYg8QwwfqRKLFQumA":{"text":"Great experience! Our waiter Eric was wonderful and the food was amazing as well as great ","useful":0,"cool":0},"Nax6yw_asEhYbtrMZfZUGw":{"text":"Came here with my group for a first stop on my food/bar hop Sunday morning. I love a $10 b","useful":0,"cool":0},"lrw8Ub4-ZEpE-Nqqw3Bwow":{"text":"Happy hour is a great deal. Intercontinental grilled oyster is wonderful - the source and ","useful":0,"cool":0},"7F-5BZ-FK90MfW7hm4aOHw":{"text":"Probably one of the best meals I have ever had in NOLA.  Most places have one or two thing","useful":0,"cool":0},"u7qgcqVSYd8dBXYVrBQ94A":{"text":"Even if you don't stay at the intercontinental you should come here. Every single thing he","useful":0,"cool":0},"jh5JobCElSleHN5Le3g1vw":{"text":"Great place to pop in to grab a drink. Hit this place up twice last night, once on my way ","useful":0,"cool":0},"BuesRkhoSAQGq7wWWD-MNQ":{"text":"We went there on a cold and rainy afternoon in April, 2016. This was our 3rd visit to this","useful":1,"cool":0},"LCAGGa7CjbBbd-0sa-svJA":{"text":"I LOVED the food and very welcoming staff... Happy with my choice... I recommend this plac","useful":0,"cool":0},"D-433ck39utEg1ZlFIcImQ":{"text":"Food was average but the whole service aspect of it made it seem even worse. Our waiter wa","useful":0,"cool":0},"Dt5cwgRdjhVfaj_JJ7RVMg":{"text":"Off the chain! Blew up my taste buds and wow'ed me! Service as good as the food. Had the s","useful":0,"cool":1},"Hc0aMnyKjgS2yQsuaDkflw":{"text":"The complimentary cracklins and (red bean?) butter taste terrible, but everything off the ","useful":0,"cool":0},"_hHg3bu-_YjkF6Wi3l97JQ":{"text":"Although Yelp reviewers said it might not be suitable for kids, I wanted a proper meal wit","useful":1,"cool":1},"_ayIVTeEis-_9ImR1orVtQ":{"text":"In a city of amazing restaurants, this is probably my new favorite. I highly recommend the","useful":0,"cool":0},"o1fbKyoxU6BEb9VoNjrW1w":{"text":"Without a doubt the best oysters I've ever had.  Shout out to Amber (the dainty yet someho","useful":1,"cool":1},"95Vie6mHyP89sLkes61L7g":{"text":"Looking for an oyster bar in NOLA and out of all of the options we selected this one. It i","useful":0,"cool":0},"yBsSLPBivBfFFsmMdFCEkw":{"text":"Booked reservation in advance for wedding anniversary celebration while in Nola. Was shown","useful":0,"cool":0},"FFuSZSdtM0OwuMGymn1TIg":{"text":"THIS is the best meal I've ever had. Pure and simple. Great Bisque, great boudin ball thin","useful":0,"cool":0},"LrgBQoD7rWgKykTBatNr_A":{"text":"I always wanted try oysters in New Orleans because my friend told me oysters here is a dif","useful":0,"cool":0},"KdAuFmAvCv4BTfc0QGX67Q":{"text":"I had the beef & grits. My food was so good. They have the best grits ever!! We did the $1","useful":0,"cool":0},"ocGgnHomfV38aWWcK3yXdg":{"text":"This place has amazing service and the food to pair with it. The shrimp and grits are extr","useful":1,"cool":0},"-NdnAVzVkijPpweD5JmEMw":{"text":"The shrimp po' boy was excellent. The shrimp was prepared very well, with a balance of cri","useful":0,"cool":0},"HRPCEU2yEuxJHBZl5dIi1g":{"text":"Their Louisiana Lobster Pie is to die for. We got the taste of trenesse and oyster mix. We","useful":0,"cool":0},"I7qNsB9Aslpy0vSX8J_QPw":{"text":"I ate here last night and won't soon forget it. I experienced the joy of food poisoning sh","useful":0,"cool":0},"UrDNXm34iNtXlMO2m__rCQ":{"text":"Wow. Just wow. Yea it's in a hotel but honestly this place is amazing. Hit them for happy ","useful":5,"cool":3},"dpIdfhTEiWm39SWNxRs9dw":{"text":"Great food, great service.  We were a little concerned about the fact that this was a hote","useful":0,"cool":0},"VBGPmgTFMtsYZZMzGuG_hw":{"text":"I was very impressed. Had the blue crab bisque, which was phenomenal, and the Taste of Tre","useful":0,"cool":1},"Db8E3SYCosB5pUawB4xbhg":{"text":"The food and service was absolutely amazing!!!! It is worth the walk, drive, or flight. I ","useful":0,"cool":0},"-BYyWBxCmXHRRr_IS94mgg":{"text":"I'm struggling between a 3 and a 4 on this one, but Trenasse really gave us some pretty go","useful":3,"cool":1},"5Cbw5w2cZbirlt08TZD6Kg":{"text":"Ate here last year while in town for a Convention- loved it so much decided to stay in adj","useful":0,"cool":0},"99vvV-P9LBdXmc148H4pTA":{"text":"Running behind on writing my reviews but after getting an ROTD, I have been giving fresh f","useful":3,"cool":3},"4NT6aOu4DzOG1PkABgLXZw":{"text":"Came for a quick lunch. Awesome oysters and the crawfish pie was excellent. Loved it.","useful":0,"cool":0},"sc0VDBgNOXFAeyYUF-BEWg":{"text":"Excellent food and service.  We had the stuffed chicken wings, pop corn chicken po boy, th","useful":0,"cool":0},"hzaeREqh6cKs5UnssWD35Q":{"text":"We decided for our first night in New Orleans to simply \"eat at the hotel restaurant\" - fi","useful":0,"cool":0},"Efrcbi9hcjM4HSRpbD6iOQ":{"text":"Loved the buffalo frog legs. Oysters were also great. The squash stuffed with blue crab wa","useful":0,"cool":0},"j7HBK2SkWNplNrbAV9nvAg":{"text":"Excellent food! \n\nNot sure why this place isn't more crowded, the chef executes an excelle","useful":1,"cool":0},"YKRdNqRQnlqWe-egWdZa9w":{"text":"In a city full of good and interesting restaurants, it's easy to overlook Trenasse, tucked","useful":0,"cool":0},"Ch-CibMi4iW97qB8D2xaBg":{"text":"I rarely do a yelp review, but this place was great! The food was delicious! Our server wa","useful":0,"cool":1},"EpVEAykInAILYy3t0OJ-Ow":{"text":"The oysters were insanely fresh and delicious. The crab bisque was velvety and rich. But t","useful":2,"cool":1},"QozAyXDTGK5N9aUPD7ngBw":{"text":"Food was very good, but not enough staff for the number of customers. I'm giving them the ","useful":0,"cool":0},"NKGwZM5P91_TdRlubY_PqA":{"text":"Great food+great service= one amazing experience \n\nWe luckily missed the crowd of pre-game","useful":0,"cool":0},"mn-IY6RKa55XX4ItxEunGw":{"text":"Ordered the ceviche.\n\nPortion size was very small, the ceviche itself was okay. \n\nNot many","useful":0,"cool":0},"S057taOzgvcJUpBxZsyW9g":{"text":"We stayed 3 nights / 4 days in the Intercontinental and it wasn't until our last day in NO","useful":2,"cool":1},"46JruKFBwi_qtY3iR0IouA":{"text":"First time dining here last night. The food did not disappoint. We ordered a lot mainly be","useful":0,"cool":0},"U_gdMh1Did0EPwx3v5WMJg":{"text":"sit at the raw bar, tip the guy shucking $20 and make friends. High end spot but worth it,","useful":1,"cool":1},"W_BGDOkgEVYPiydI2z3WeA":{"text":"My favorite spot for happy hour in NOLA. Incredible staff. Brian and Falon as well as the ","useful":0,"cool":0},"Nj0uriUkqgXBakpR4POLbw":{"text":"We couldn't get reservations for 13 people anywhere else so we gave this place a shot beca","useful":0,"cool":0},"tUeatOTKCHRPFVt2x9pQEg":{"text":"I'm not sure how this place garners 4.5 stars. I started with the intercontinental Oysters","useful":0,"cool":0},"7oUwT1RlEpDd3LC_0g5HKQ":{"text":"Loved this place. If you're limiting your food options to the trendier places in the Frenc","useful":0,"cool":0},"yw_Dd_fuhaXIwnUty2YoGA":{"text":"Absolutely amazing food. We love the server Johnny. Very knowledgeable and very friendly. ","useful":0,"cool":0},"nOGaHNbVlKnhfpzEHrkanA":{"text":"I can say that I definitely enjoyed my meal! I had the blue crab bisque & the crab cake sa","useful":0,"cool":0},"uUofV53a2momN0w6sdkYJQ":{"text":"I'm giving 5/5 stars because of our waitress. She was seriously the sweetest person I've m","useful":2,"cool":0},"pUZlrEeFXDxGZUvDX-Ym4g":{"text":"I was really looking forward to this meal, and ended up so disappointed.  My mistake for d","useful":2,"cool":0},"XaT8IV-pEEqfA_vPHREsCA":{"text":"Service at this restaurant attached to the Intercontinental hotel lobby truly disappointed","useful":0,"cool":0},"4B-00Hjyn8nn-EDT0bsEYw":{"text":"The food was good, but what makes the restaurant amazing was Brian, who makes good recomma","useful":0,"cool":0},"zAosY1JoxNRvhh_S9Gn59w":{"text":"Very nice NOLA cuisine. Enjoyed a great dinner and was able to get in easily despite a lar","useful":1,"cool":1},"5eZD7LlsH1N-wBjJGy7mjw":{"text":"Our 8:00 reservation wasn't seated until 10pm. The food was meh, and to be honest, not wor","useful":0,"cool":0},"vMpU3XCfci4HPR8P2A7_Ag":{"text":"Sooo so good. We had:\n\nCrawfish pie: creamy, so delish, and we were satisfied with the cra","useful":0,"cool":0},"I7JJgUG1aCblVIOIuEqadw":{"text":"My wife and I don't eat as much as we used to, so we're finding not only that Tapas (small","useful":1,"cool":0},"1-_EJSTgx29FON0qIasRrg":{"text":"First night in town,and we had no idea where to go for dinner. Trenasse had been yelped by","useful":0,"cool":0},"neuH27u6YikiMPPQpQ98aQ":{"text":"Absolutely amazing food. Here for a convention, able to make a reservation. Happy hour pla","useful":0,"cool":0},"ewt_tqK9FUF25xP1yKvqaA":{"text":"I went to Trenasse intent on ordering the creole nachos that are so prominently featured i","useful":0,"cool":0},"qAbH-ufKvUqVhzFSLKz0aA":{"text":"This place is fantastic! We came her for Sunday brunch with a group of eight people. It di","useful":0,"cool":0},"kwrlJ1viarmgDNI5KgdJGg":{"text":"We came down for our honeymoon, and decided to try this place out, AMAZING! Our waiter Joh","useful":0,"cool":0},"wnpLrY8WUzbHqpQxIPQbhA":{"text":"Trenasse was probably the best food we had in New Orleans this trip, by far the best oyste","useful":0,"cool":0},"ZMeJZM4V-2RwnoTciezRCQ":{"text":"The meal started promising. The service was very good.  The waitresses was very attentive.","useful":0,"cool":0},"DkHTNERRrn6k9jMRG4Y1Kg":{"text":"Excellent $7 crawfish pie during happy hour. Flaky and moist crust, flavorful and plentifu","useful":5,"cool":1},"GbPU9NDlwc4kkhkHOwZBww":{"text":"Okay, if I could marry a restaurant, this would be it.  My friends and I had found this pl","useful":1,"cool":0},"szSkN3AOPCIDXMy2q77How":{"text":"We came during happy hour to trenasse. We just wanted an appetizer as we were getting dinn","useful":4,"cool":0},"Hi4WSUTvEIfAHG0ipPfBnQ":{"text":"Really it's 3.5 stars.  I really want to take away another half star for the service, but ","useful":1,"cool":0},"yibIlATk6A5AME0cEq6hDg":{"text":"The food here was very very very very impressive.\n\nCraig was my bar dude and he was really","useful":3,"cool":2},"hQ-3baWTk1RqwEHcYYL-iA":{"text":"Shrimp and grits are the best I've ever had without a doubt.  Also had the frozen hurrican","useful":0,"cool":0},"3lEd9SULiuFyqKsxGuvPOg":{"text":"OMG it was a perfect evening!   Austin was attentive but respectful...  we were greeted wi","useful":0,"cool":0},"mBdDzWO1T1m5T3Wb1TGUjg":{"text":"Came from the airport, tired and hangry and my friend and I went right downstairs from our","useful":6,"cool":3},"YkMpjUeRgRSNkVvS431srA":{"text":"Duck Confit - Excellent smokey flavor, tender meat falls apart. Clean with lettuce wraps &","useful":0,"cool":0},"fu1pLX-mV3WPoDxh8Xkntg":{"text":"Great jazz band had a bloody Mary there although the presentation is nice I've had better.","useful":0,"cool":0},"Mw4lI8OhBJRkoiGlN-dzow":{"text":"Went for happy hour to take advantage of the cheap oysters and beer. Very friendly staff a","useful":0,"cool":1},"9dmdyGSypHNBoGxYVln3Ow":{"text":"The BF and I came for the happy hour, and it was the best decision of the day! The $0.75 o","useful":0,"cool":1},"r6EZ6918FJE_NBYKThZaxQ":{"text":"We were anxious to continue our Christmas tradition of dinner at Trenasse for Christmas. W","useful":0,"cool":0},"fTzuvVmQgL8kIlBI9GeFbw":{"text":"Everyone was satisfied with their meal and our waitress was amazing.  We ordered the veget","useful":0,"cool":0},"It-W3LYnmAksktScN9iMvQ":{"text":"Great happy hour. Oysters are very fresh and for 75 cents only. Drinks are great as well a","useful":0,"cool":0},"OyphE6OfpsTGj8mQtiu89A":{"text":"So, so delicious! Very impressive food and atmosphere, especially for a hotel restaurant. ","useful":0,"cool":0},"TGIHPXtTq9WzMiAivy2v0A":{"text":"Happy. Hour. Y'all!! The crawfish pie, Debris fries, mango margarita & of course, super fr","useful":1,"cool":1},"xPzXe3WSNB2B0-pSadp0Yg":{"text":"Great food. Since I got to New Orleans, this is the first I'm  enjoying the food. Good ser","useful":0,"cool":0},"3llSMP3vhGIL_Z1M1dUDHg":{"text":"This may be New Orleans best kept secret. The food and selections here are great. I'll cal","useful":0,"cool":0},"d4fOsuF71kn1MDzceFbgaA":{"text":"The food was good and the people were nice but I just was not impressed. The service was a","useful":0,"cool":0},"Pl745AkZ40s6JkVbkC_0Xg":{"text":"So....I guess the 4.5 star rating on this place must be mostly for their Happy Hour. The p","useful":2,"cool":1},"uXvHQKH3ZPa-ZepPMxb_VA":{"text":"I dined at Trenasse recently with Shari V and Jacob C.  We were promptly seated by a frien","useful":2,"cool":2},"usCMiU1YoqVKLx8lzh3qJA":{"text":"I came here for a work lunch today and my whole group was very intrigued by the menu.  We ","useful":4,"cool":2},"JeV8g8ROXmTRIoi5vL5TdA":{"text":"I sat at the bar and had a late dinner that was outstanding. I had the blue crab bisque, g","useful":2,"cool":0},"YuIcTQpYZ0t6rL3ja1ZiyA":{"text":"Great seafood and excellent service. This is definitely not a hotel restaurant, though it'","useful":0,"cool":0},"-rjKJfKH_BIcjLUfizbXTA":{"text":"My favorite and best food experience in NOLA. Been to NOLA 6 times and have tried Commande","useful":0,"cool":0},"9FOTD9sfPNWdRC4S30fvvg":{"text":"This was a great place! Food was awesome and the service was great. One hour turned into 3","useful":0,"cool":0},"wn1r4qM_kX70On01OzZFlw":{"text":"Fantastic meal. Was a little unsure as it is in a hotel (the Intercontinental) happy I cam","useful":0,"cool":0},"INtsFdZyyLhnOK4x5dCMmw":{"text":"I got some tasty grilled oysters and hash on the side. Overall a good mean. Servers are fr","useful":0,"cool":0},"wzc0Zi8LIPn3ZRt_90hn3A":{"text":"Perfect food though the service could be better.\nDefinitely recommended for a classy ambia","useful":0,"cool":0},"Q0IW5Y3JDw1pMHuikR2KuQ":{"text":"Excellent! We has the pick 2 soup and salad-or soup . Perfect-lunch on a rainy day in nola","useful":0,"cool":0},"vsTJ9AKS59eporE-S0DpCw":{"text":"The Oyster Log had my wife and I in Oyster heaven. Excellent!!! Really enjoyed and will be","useful":1,"cool":0},"WBpznKUBf4W7sQthOCahiA":{"text":"I went to Trenasse with very high hopes looking at the Blue Crab Bisque beforehand.  I was","useful":0,"cool":0},"s4llNux5xhUGanXsI8nf3A":{"text":"I came to Tresnasse for lunch because of the great reviews on yelp.  I ordered the Shoyste","useful":0,"cool":0},"Fqhnk9gDhLaVpB2V1Ea2Eg":{"text":"Crab bisque is amazing! I can't stop thinking about it. Everything that I ordered was good","useful":0,"cool":0},"A243SZ8kGvYupHjksxRxBQ":{"text":"4 stars for food-- the food is amazing. -- 2 for the service which was pretty unforgivable","useful":0,"cool":1},"rPxiJ356Pwwq1e71RJo2wQ":{"text":"Was in town for business and decided to give this place a try, it was remarkable!!!  The C","useful":0,"cool":0},"1o7zAFZE7F9mYhdoX1z4GA":{"text":"Wonderful! The crab bisque was amazing! The snapper was so delicious! Oysters! Love this p","useful":0,"cool":0},"X2d478WhG6v98EE73oitng":{"text":"Tranasse is my first ever dining pace in New Orleans. It is in the lobby of intercontinent","useful":1,"cool":1},"Ajd4dOaiI1-Twj1BM57yow":{"text":"OK there's a few restaurants that I truly believe are life changing experiences, yet today","useful":0,"cool":0},"6DRmsm139jtqYT_QwZmwMQ":{"text":"This place was AMAZING from start to finish. The Louisiana Crawfish pie was to die for. Ev","useful":0,"cool":0},"v8o1qE5azP0PM7nFFicVmQ":{"text":"This place is great! Had a delicious brunch with bottomless mimosas. Our server, Brian, wa","useful":0,"cool":0},"HdGfF9etMrr9-vC19k3Lgw":{"text":"Delicious Cajun cuisine in the restaurant of the Intercontinental hotel. The bread pudding","useful":0,"cool":0},"B8516yEpF7w2joc6wRpKxQ":{"text":"Got the Gumbo and the Mrs got the crab bisque, both were excellent. The babrbeque shrimp h","useful":1,"cool":0},"QqfCUOYs1D5CW09t_U7M3w":{"text":"Came here on a Thursday evening and it was packed with people waiting in line to get a tab","useful":0,"cool":0},"-KVoChuS3j--o1oqXMok4g":{"text":"The atmosphere and staff were great!  We truly enjoyed the pork skins and homemade butter ","useful":0,"cool":0},"GPlfKbUdve6NgWbYM0y44A":{"text":"Trenasse had an impressive collective of photos on social media that had my mouth watering","useful":2,"cool":2},"e-f5WAIdVZCLuPuJCGKCYw":{"text":"Good service and ambiance for sure. I am not the biggest fan of Cajun and Creole food. But","useful":0,"cool":0},"EiPqHwmnMdpRTYfoT9AhuQ":{"text":"Excellent food great service and beautiful decor.\nEnjoyed a little business lunch and will","useful":0,"cool":0},"NcN3V2vzx5Njr18YOPvEtA":{"text":"Wow! Delicious food.  We didn't have a reservation but they let us sit inside as long as w","useful":0,"cool":0},"pQK3H4G995-uX9uO5FQ3AQ":{"text":"If you are looking for fresh salads, soup du jour, and/or soup and sandwich combo for lunc","useful":0,"cool":0},"5uU4-5lfDNncJizMON8Cng":{"text":"Went for dinner on 7/30/16 to Trenasse. It is small but very nicely decorated. Since it is","useful":1,"cool":1},"o7jQKquGKcJUyQZ4Fmh6DA":{"text":"Pretty solid choice if you're looking for a sleek restaurant with a modern vibe. It's loca","useful":8,"cool":9},"XcySmi1VofiRtTlP2qF-PQ":{"text":"It's a nice environment but being in new hotel, it lacks the charm that is ubiquitous in N","useful":0,"cool":0},"fjHi9uMK0jlQoCB073NLSA":{"text":"Great Brunch! Bottle-less drinks and the oysters were amazing! It was a little hard to fin","useful":0,"cool":0},"tp3TUyziYLaxyh6F24zevw":{"text":"Went for happy hour .75 cent oysters, they tasted good but were very dirty not worth the s","useful":0,"cool":0},"9D6fCS2VrgipLIpzCvf6lw":{"text":"All I had were the house oysters. They were delicious. Definitely want to have them again!","useful":0,"cool":0},"NbBWcOl1bHYHZY4HBxbSow":{"text":"Was here for happy hour- $0.75 oysters.  Good deal. They were huge!  The intercontinental ","useful":1,"cool":0},"xRak84chE6DztrU97H3fIA":{"text":"I've been to New Orleans twice and I've been to this restaurant 3 times. This is not only ","useful":0,"cool":0},"TtuhY2yinzDm89Azq0YSdQ":{"text":"This place was freakin great. I say try it if you're in NOLA. It is not a typical hotel re","useful":2,"cool":1},"QvrVHsqXWIIz2h7rVtWXwQ":{"text":"Food was OUTSTANDING. Started with the bisque. It's just okay. Would pass on that next tim","useful":0,"cool":0},"0eKaSLKL-PAiYQbVmjvhhw":{"text":"This place was amazing. Booked a last minute reservation for our first night of dinner in ","useful":0,"cool":1},"FccvYCuodUWbS3W1D_C3rQ":{"text":"Went to Sunday Brunch and had the COOLinary special that was excellent. Had a great server","useful":9,"cool":6},"3TBjTnvBJ2UWNszMLq8RnQ":{"text":"Fantastic. Ate there twice already in one day. Stinky stew amazing. Very nice portions as ","useful":0,"cool":0},"5eO3tvG4BauMdyQaqOjbHg":{"text":"After almost a week in NOLA, I was ready to conclude there was no such thing as a bad meal","useful":4,"cool":0},"bwSZe03Q-I8cizNqXhhK5g":{"text":"I tried their \"Muffi\" poboy at the Oak Street Poboy fest and instantly fell in love. I fou","useful":0,"cool":0},"lGYOV6Lon8ygGGD8TRTG4A":{"text":"The blue crab soup did not have salt or flavor.  The poboy with buffalo sauce was too salt","useful":0,"cool":0},"ZK-eFo1Lf012Nf73EgTzlA":{"text":"We hosted a Birthday Brunch for 3 ladies here and had an absolutely delightful time ! Ever","useful":2,"cool":1},"-vobi3V7Vme5tq632J_TNA":{"text":"Holy crap!!!!! I had the Crawfish Pie and it was perfection!!! Just the right amount of he","useful":0,"cool":0},"q6HlecwPqYqYkoSVqc_61w":{"text":"Stopped through here while driving back home one evening. The atmosphere is great and they","useful":0,"cool":0},"72HclJJPY7mEQjm_fTPFpA":{"text":"Good service, just had papaya salad (light and yummy), raw oysters, Chargrilled oysters, a","useful":0,"cool":0},"vG2aJRhTMRnYl4dC4AqOvA":{"text":"The food and service were great. My only complaint was too much salt on my beef! In today'","useful":0,"cool":0},"N0-8wOtrbsM20n7Wbnzb4Q":{"text":"After a weekend in New Orleans during French Quarter fest, we were tired and didn't want t","useful":2,"cool":2},"qpWUQeoj-4-vJqm_O6_NJw":{"text":"The food and cocktails were delicious! Great crawfish pie! Bryan's service was excellent! ","useful":0,"cool":0},"ezSZiiO9KN_M0n0CvYEGkA":{"text":"This place is almost hidden inside a hotel. The food was really good. The waiter was a bit","useful":0,"cool":0},"5z77loeGRAcdRW3Z5771Wg":{"text":"Great experience!! Terriell was our waitress, and she was amazing!! Coming back for sure j","useful":0,"cool":0},"IB7J5R_ulCuADfeKHV2p1g":{"text":"We have been to Trenasse several times, and this time we brought friends. They loved the p","useful":0,"cool":0},"o3_cCphFe5n_Dlw1ceL3Wg":{"text":"I went here with my colleague due to its proximity to our hotel and the good reviewers on ","useful":2,"cool":1},"hVMSAxaewku5-ynOFDVsqA":{"text":"I am reviewing the Creme Brûlée...ooh this is just heaven...made me come, back! Lol. Gonna","useful":0,"cool":0},"n7FnpZq5jOTfT4C4oUWGzA":{"text":"We visited here in the first week of Dec for dinner, we got the following\n1. Pan fried Red","useful":0,"cool":0},"O77PrZcRSTQnuPRz-R2wag":{"text":"We stopped into this place for a late lunch, after an eventful day. They offered pretty ta","useful":3,"cool":2},"6k8aGyg_r8xASQeJYb2Pug":{"text":"Just had lunch for a co-worker's last day and it was fantastic!  I had the crab bisque, wh","useful":6,"cool":4},"qWyJjnNJZbaXJbuZ76Ks7A":{"text":"Typically hotel restaurants are just a spot to stop in when you're starving and desperate.","useful":1,"cool":0},"7syLdAnf5zzkWTD8-2xFJA":{"text":"Right across the street from Luke. Had a drink one night and had to come back for a meal. ","useful":0,"cool":0},"gR6azwG9hqWtUnmmXdQGCQ":{"text":"If I could give zero stars I would. Wife planned a birthday trip for my 40th. Made reserva","useful":0,"cool":0},"Se_iuhT-Sojv8S76hQwvzw":{"text":"Went today for brunch and loved every bite!  After a terrible experience the night before ","useful":0,"cool":0},"S5EtNT6fBu1c4NriZlqEGw":{"text":"Excellent food, great service, good atmosphere! It's pretty hard to stand out with great f","useful":3,"cool":2},"OGxSrdb1xTMv_spMirrSrA":{"text":"Awesome brunch! The food and the service were both excellent. The crab bisque was to die f","useful":0,"cool":0},"RHPwA_pNnWLVe0UD-KAsPA":{"text":"Went for Happy Hour and had two dozen of the biggest best oysters I've had in a long time.","useful":0,"cool":0},"XslhllTehS1Yqi_g6hEJ_g":{"text":"In New Orleans for just a day and didn't have time to seek out restaurants in town so I ca","useful":0,"cool":0},"idK8fp-0CsMHu6Yye75Dcw":{"text":"We could not decide on a restaurant between all the NOLA options. The final choice on this","useful":0,"cool":0},"jyTkkk7uimKCDw9c9W1xIA":{"text":"I love here! Service is so so so good! The best oysters and crawfish pie ever! If I come N","useful":0,"cool":0},"A5bxufc8j46IDrNae9Bahg":{"text":"Best Gumbo in town and a fantastic waiter!  Thank you Adam for the best service and kindne","useful":0,"cool":0},"KpedLpgTG4ktclTx68gTag":{"text":"Excellent service and very good price. They have an happy hour from 3pm -6pm, you would th","useful":0,"cool":0},"66E1FIurbymAK0xrqGI-VA":{"text":"The food was pretty good. The lemon vinaigrette dressing is to die for. The wait was long ","useful":0,"cool":0},"CuJbl68lmF9syNX_kKRNWQ":{"text":"Sorry all, I was not impressed. We came here on a Saturday night and since we didn't have ","useful":2,"cool":1},"SUZ3F84zB-zzYIsOcp4onw":{"text":"Food is OK, gumbo is good. Service is mediocre, made reservation, still had to wait 20 min","useful":0,"cool":0},"z6h3N-admfMvTOeAsSoj4w":{"text":"The food was excellent. We ordered the Louisiana Crawfish Pie and the Braised Beef Short R","useful":1,"cool":0},"nUJlidKkOyLal_e6u-cKrw":{"text":"We stepped in for lunch on Christmas Eve and were pleasantly surprised by the crowd, decor","useful":0,"cool":0},"Uc43Fk8CsIYpMsRou9zBgQ":{"text":"Trenasse is conveniently located on the first floor of the Intercontinental Hotel with an ","useful":5,"cool":3},"MeZoekNPWB6Oirf9vRWJRQ":{"text":"This restaurant is amazing. I mean everything is delicious.  The staff is super friendly, ","useful":0,"cool":0},"u1RWsgv21_H9azMmKXDBfQ":{"text":"This is tough- food was definitely good however I waited close to an hour for it. The wait","useful":1,"cool":0},"vXhPlM4C0oo73qgmap8HgQ":{"text":"Trenasse was the reason for my recent trip to New Orleans. Until recently, the Louisiana C","useful":15,"cool":7},"_JTCne4uBoFcbmf0vD3MUA":{"text":"One of our favorite things to eat on our annual trek to The Big Easy is that this city doe","useful":0,"cool":1},"s7nCArTY53dCZZEQ-nTuMQ":{"text":"My meuniere dish was lovely (can't remember the fish), though my sauce came on the side, a","useful":0,"cool":0},"2omBemTUBXeIVeWUiUIfbg":{"text":"Service is pretty good and happy hour suggestions are well! I advise to order grilled oyst","useful":0,"cool":0},"0KvWHt2AHlxUxo-6L1vtsA":{"text":"**NOTE: this review is based off of their happy hour**\n\nFood: 4/5\nValue: 5/5\nAmbiance: 4/5","useful":3,"cool":1},"Y6wj-OIn9HpQUB6WDOhS1w":{"text":"Love love love this place the food unbelievable the drinks to die for the dessert endless ","useful":0,"cool":0},"ZNh-eRC2hnrqofpXecz_Yw":{"text":"Oh yea baby...this is going to be what I look forward to on my second visit to the Big Eas","useful":1,"cool":0},"rYtO8-2q1tNtz4RFr6PHjg":{"text":"A good variety of food. Moderately priced. However we waited over an hour for our food. Fo","useful":0,"cool":0},"XaEaDVrdYpY7V1ReXIRGwA":{"text":"This is a great spot! Brian was our server and did an amazing job. All of the food we had ","useful":1,"cool":1},"6MnRzN-u3Ldl5t40ft4zfg":{"text":"My friend and I were there on Halloween and had the dinner at the bar. The coctails were g","useful":0,"cool":0},"xzWjtrmOZtBmstbG6CRQYA":{"text":"Phenomenal experience for fractions of what you pay on Bourbon St. This is real southern f","useful":2,"cool":0},"ttY0lFsmNI4Ud65p7Np8UQ":{"text":"The  food was great and the service was even better. I ordered the gumbo it was pretty goo","useful":0,"cool":0},"B-uBaEqC-TVc8ZXLGqBFkg":{"text":"Awesome! That's all I can say. Lamb, seafood and steak were all incredible as was the serv","useful":0,"cool":0},"BtsTi_fXXtDMuJNbPqXJ4g":{"text":"This is what I was looking forward to when it comes to an early dinner. I had the Shrimp R","useful":0,"cool":0},"Gxa6zbtvagX4SbFArSl9_Q":{"text":"OMG-I had the crawfish pot pie and it was soooo delicious! It was so tasty and savory-just","useful":0,"cool":0},"M8KYS6EVostRGHyUz99Ztw":{"text":"We were staying in the hotel across the street which made this an easy choice for Sunday b","useful":5,"cool":1},"n45Ts_IH1hCA6Do7nC228A":{"text":"Very good food and atmosphere. My girlfriend and me ordered the Trenasse sampler platter a","useful":0,"cool":0},"a_2XabzMA5M6jF-0fvESlA":{"text":"Reasonably priced .. decent wine menu (by the glass or bottles) ... great service & atmosp","useful":0,"cool":0},"yQqhZcGSKF8p_VHldFQMVA":{"text":"First time to New Orleans and this is the first meal. oysters are quite good！","useful":0,"cool":0},"6NBqBT9jFdJ0yLG1l9hkVQ":{"text":"Omg. Food was DELICIOUS!!!!!\n\nMy love had the chargrilled oysters as an appetizer. I've tr","useful":2,"cool":2},"0L0uQ7hEKTpV_-8a27_KSg":{"text":"Amazing! Best staff and chefs in NOLA. There Happy Hour is amazing!!! $.75 oysters on the ","useful":0,"cool":0},"a1pQos91RnVBrqLUO3iueQ":{"text":"Amazing, magnificent, excellent, spectacular, so many words comes to mind. Probably the be","useful":0,"cool":0},"0hmc8ulkWG6fBzpsEDXYug":{"text":"Legit. Service, food, location - spot-on. They know what they're doing. Never had drum fis","useful":1,"cool":1},"62NO7_uUkLZBwqNuY0xhmA":{"text":"Awesome food everything was fresh customer service was A1 and the manager Tiffany was just","useful":0,"cool":0},"DYM_WeTbMVWwJLeMUeYWhw":{"text":"Excellent service, and really good food\nI had the BBQ Shrimp, which was good but more heat","useful":0,"cool":1},"dtFVESXBDoWNYauhIutHXw":{"text":"Wow!! What a great experience all around. I can't begin to tell you the wonderful time I h","useful":2,"cool":3},"Ljae701ck9I1Wk-7E3K90w":{"text":"This is my third time here! I stopped by Trenasse for some dessert after eating at Tsunami","useful":0,"cool":0},"p2tn-4NCx5bBItGfYAVgvA":{"text":"I picked this place based on location and the good reviews. I'm so glad it was great becau","useful":1,"cool":0},"1wBWMcfJYeO_J8Jk9kbGcQ":{"text":"Excellent food, excellent service and great beer! What more can you ask for? Trenasse had ","useful":0,"cool":0},"wA1K4x5YjaliD3vPVViKDw":{"text":"The Stinky Stew was delicious  as well as the bottle of Pinot we all shared for the night.","useful":0,"cool":0},"eONgju_VOMwzchFsm3BdtA":{"text":"Good good . HORRIBLE staff .. Especially the HOSTESS. Older lady with dark hair who talks ","useful":0,"cool":0},"hQL0CoBfJhy7xYYsuUKxpQ":{"text":"The food here was exquisite!! They exceeded my expectations. The cauliflower was to die fo","useful":1,"cool":0},"SewSuCFZYe2p8W1Xqw9_gQ":{"text":"So far the best place in town. Its in the Intercontinental hotel.\n\nThey have local seafood","useful":1,"cool":0},"4NfMBObdi9GxX4t-KdEE0Q":{"text":"Nice ambiance, short rib was a bit fatty and did not have much flavor. Drinks were delicio","useful":0,"cool":0},"RRtUAWTXeNCBCrxnvyj5JQ":{"text":"The service in this restaurant is very good! Blue crab soup is good. Oyster is good. But e","useful":0,"cool":0},"_KtpWogUDh2-RD9Ouv_7DA":{"text":"My friend and I shuffled about half mile in the chilly CBD to Trenasse. There was about a ","useful":3,"cool":2},"cpzL-O9t96pVorvv_PVj7w":{"text":"This place is SOOOO good!! Definitely eat here if you're in town. Perfect for a casual boo","useful":0,"cool":0},"vr7u8kJfKY8iYBMi9HrUuQ":{"text":"Food is okay. For the price I expect more, much more. Stinky stew looks nice, but lacks fl","useful":0,"cool":0},"GcblLATSEoR6jbrkBvO1Zw":{"text":"The happy hour here (3-6 pm, daily) is divineeeeee! Raw oysters, Rockefeller oysters, char","useful":1,"cool":0},"-b3F8_2nLX-gTwcSAn7_iw":{"text":"Fantastic dinner last night. We are attending a conference and came from the Boston area. ","useful":0,"cool":0},"S8eREV4zPUOE89NXN-vpsw":{"text":"Had a dinner reservation and everything was great. The ambiance was nice and the service w","useful":1,"cool":1},"55Ugr7M_3W-pZpuvv0iw3w":{"text":"Took a friend here to eat for his birthday, we both have a big appetite, so we ordered a g","useful":4,"cool":0},"5JXCdCsE0MhVAcex8mkedA":{"text":"Love that this restaurant is in a dog friendly hotel and thus dog friendly by virtue. They","useful":0,"cool":0},"6j6zqlFSYbAhZXFQKo_Zow":{"text":"I enjoyed sitting at the bar and having a bread pudding sundae for dessert. The bar area w","useful":0,"cool":0},"rBKgSbMF3j9kLWhS0gqwgw":{"text":"There were so many types of oysters & I'm pretty sure we tried all of them! I loved the va","useful":0,"cool":0},"3fI5r-Sp5pLjWRlj5Uf4TA":{"text":"Bottomless mimosas for $10 is worth it right there! Loved the tables that looked like old ","useful":0,"cool":0},"BOtEykxmftzmfWdDV9k1Pw":{"text":"So it's been a couple of weeks, and I checked my credit card transactions and no refund ha","useful":0,"cool":0},"-vXwAVMrVRB5VduR9vMoJQ":{"text":"Beautiful restaurant with attentive staff to start. Our table had a wide range of menu ite","useful":1,"cool":0},"LZ7UVeqzPnE8foZjOGlOvQ":{"text":"We went for the Best happy hour!\n\nTheir versions of the Oysters Intercontinental, Rockerfe","useful":0,"cool":0},"vVLioZrQKarMF0Fw8CdAjw":{"text":"It was our final day in New Orleans and my party of 8 was more interested in a boozy brunc","useful":1,"cool":0},"ZNJ4DVAGhKA64aDZdvTsAQ":{"text":"First time ever trying this place was last year at Mardi Gras, the food was fabulous !  I ","useful":0,"cool":0},"WuyJCJYVLAYSetEYTPNPmA":{"text":"Went here after seeing the Buffalo Frog Legs on 100 things to eat in NOL before you die an","useful":0,"cool":0},"UV1OnhMF_Z3kp9pLajbubw":{"text":"This place really impressed me! The food and service was great!  Located inside the Interc","useful":14,"cool":10},"G1kjYHRg9kM7io2FZfH1Uw":{"text":"Chicken, shrimp, salad, oysters all real good. Happy hour works well but I still dropped a","useful":0,"cool":0},"Wv9_8Y_lVVJwG_DYh7IIWg":{"text":"Trenasse is a fabulous little find  that is probably often overlooked because it is a hote","useful":8,"cool":5},"M_HYKiSR752BZUgGOcNMtA":{"text":"It's a 3.5 but not a 3 or 4. The app duck lettuce wraps were awesome; crispy duck great fl","useful":0,"cool":0},"k_pKfqbfu04Pynh1-_FADQ":{"text":"We stopped in on New Years Day for brunch, just me & my honey. We got seated at a booth in","useful":7,"cool":9},"d8IT9el24rV0ShKt-B8oFg":{"text":"When i tell you the crab omelette is everything, it was. The food here is amazing. The bot","useful":0,"cool":0},"YgLlp0AgoX-lpzblSKrLDg":{"text":"I think I would've had a great experience at trenasse but there was one thing that just bu","useful":0,"cool":0},"UtSxmEuJXfKMHCdgaC5j_w":{"text":"Love this restaurant! The food was amazing and surprisingly priced well. The service was g","useful":0,"cool":0},"JpoSURDhq8SvyXZ5ROXnlQ":{"text":"Stayed at the Intercontinental during my NOLA trip. Honestly, even my Uber driver raved ab","useful":2,"cool":2},"2vuuZ5VJLCFLogzbufSoyQ":{"text":"I didn't have any problems with Trenasse take-out at all.  I placed my order at the bar an","useful":0,"cool":0},"zrrhQnRWucFKVDJD1QQJcw":{"text":"Good and very quiet restaurant inside a hotel.  The fresh fish selections were very good, ","useful":0,"cool":0},"_jvm0SKTvlQLmrdgX-x59g":{"text":"The seafood soup of the day was delicious. My husband had the shrimp and oyster po boy. Th","useful":0,"cool":0},"kcg7sJNTg0wdcJTooyveBg":{"text":"Food is amazing! Very flavorful.  My wife's crawfish pie was smoking with heat almost to t","useful":1,"cool":1},"MI4y3FuUaIVzavutODn-sg":{"text":"I ordered the bbq shrimp, blue crab soup ! Muffi sandwich and highly disappointing. Way ov","useful":0,"cool":0},"KSnKnRyVE-gRXNxorNM89g":{"text":"Located a little off the French Quarter, this restaurant is a pretty large space and had g","useful":0,"cool":0},"cJlvbuLVkAJD-iNi4w7iug":{"text":"Trenasse consistently outshines its competition. The atmosphere is cozy, despite being in ","useful":0,"cool":0},"9mhTCp9nhl_MjMPe3cEb_g":{"text":"The Trenasse Restaurant is located on the bottom floor of the Intercontinental Hotel.  It ","useful":9,"cool":12},"r-yvEbduN9lP-2ZLxgLGvw":{"text":"I stopped in due to the reviews. Nice place with a smallish bar area. Great bartenders and","useful":0,"cool":0},"dY09iSyF2Pa9vM46bn9aOg":{"text":"Came here for lunch for a conference and the reviews from the hotel concierge said it was ","useful":1,"cool":1},"qKJmZrWfboGcMlZWgBBM1g":{"text":"This restaurant is very nice. Very nice art work and the food was amazing..Jonathan is a r","useful":0,"cool":1},"4Gp_OVMnuiHWsuqS3Ft1jQ":{"text":"We had the pleasure of attending this restaurant during Sunday brunch menu and services. I","useful":0,"cool":0},"lT9z458Zx-cgnRwHdsF-VQ":{"text":"Definitely catering to tourist crowd. So called char grilled oysters were just steamed wit","useful":0,"cool":0},"rsqqrPNWb6cwahF11_oWMw":{"text":"Service was great and very fast especially for a table of 12 on a Sunday before a saints g","useful":0,"cool":0},"tx0VCXDQkJhvKegyAGZv3A":{"text":"A group of friends & I went for brunch this past weekend. We all ordered the bottomless mi","useful":1,"cool":0},"9Al8wUF93SRJ2nVtoMjkGg":{"text":"Went to NOLA for three days on the spur of the moment to celebrate a birthday.   Trenasse ","useful":0,"cool":0},"pvKu-FL-qOPIu21K5xjKWw":{"text":"Beautiful food . Upscale restaurant located in the intercontinental hotel. Food good. Supe","useful":0,"cool":0},"L2oyZPKE8a6YErPGpUipeg":{"text":"Great shrimp salad, herb vinaigrette was delicious. Local beers, good service. Reason for ","useful":0,"cool":0},"0IhiLNrl_9r8ojkA-OVdXQ":{"text":"From the excellent service to the great food IDK where to start with this hidden place ins","useful":0,"cool":0},"jyOKs_v93hrCVl_uTAVXCQ":{"text":"Fantastic service and cool decor. The food was fantastic: the coleslaw with the lobster ta","useful":0,"cool":0},"jrcVavu5WjgXrOuFN9g0kQ":{"text":"The food was delish. Lived up to my expectations from the reviews.  Blue crab bisque was y","useful":0,"cool":0},"MblXuPFyp7l6TwlEn3dmHA":{"text":"AMAZING service!! I had the time of my life here and the service was amazing. I love the v","useful":0,"cool":0},"H5zktEPKAy0UHV5GaeIAAA":{"text":"Great service and good food. Our waiter was the best, an amazing worker who loved his job ","useful":0,"cool":0},"4pEClKvA2t4qjkMUVzxFzg":{"text":"The food here isn't worth the price. I've had better gumbo and po boys. The staff was ok.","useful":0,"cool":0},"TPiTf7_enaOVJOUbaqrQNw":{"text":"The food was okay, but it was overshadowed by the extremely poor and rude service. I was i","useful":1,"cool":0},"OWXCosOeSY1T-3ZaBIj2rA":{"text":"This restaurant was spectacular. The staff was so courteous. I'm a vegetarian who's allerg","useful":3,"cool":1},"OLv7C1BQVMpscoYp2nB4Og":{"text":"If you're looking to come for happy hour, I highly recommend Trenasse. I've been to Luke a","useful":5,"cool":1},"86teqchzF3Ks1_ESt2_hAA":{"text":"$10 bottomless mimosas - need I say more ? Probably the best eggs Benedict i have ever had","useful":0,"cool":1},"WHiQAXj9wsXO8fJ-ROm2iQ":{"text":"I was staying at the Intercontinental hotel, which Trenasse is attached to, and decided to","useful":2,"cool":1},"rMlfKtrJlxcMSD6DfsROJg":{"text":"\" Super Good, Great Price \"\n\nMy wife and I went to the Trenasse Restaurant in New Orleans ","useful":2,"cool":1},"9Rmjt52KbDu3hNR-GpI5wQ":{"text":"Amazing 42 oz rib eye and lamb cops. Happy hour apps included $0.75 oysters and smoked win","useful":0,"cool":0},"-3kh007A61SrQOtq8Hup4g":{"text":"We had a table of 8 including 2 kids and had a wonderful meal. The ambience and timing of ","useful":0,"cool":0},"oDdDoRGmJowkek_P4FIk8Q":{"text":"Our first time at a great restaurant with flavorful food. They have options for all, but w","useful":0,"cool":0},"D3Yal97hyLikEPXwOocnIA":{"text":"First time but won't be my last at this nice little restaurant on the ground floor of the ","useful":1,"cool":0},"jHL6aCxdnQS0VpLxn4_GsQ":{"text":"Visited one night around 8:15 pm with reservations. Hotel has a business vibe as there wer","useful":0,"cool":0},"RMNaELyxUr5oMZbtCEgkoA":{"text":"You guys. This place is awesome. It's casual and cool and decorated with an ocean theme. H","useful":32,"cool":21},"pdZea_w6Vi-NJ6imRz3lIQ":{"text":"Checked in at 3:15pm, got water at 3:30pm, food bits on water glass so asked for another g","useful":0,"cool":0},"vrNcIKXzWSWtv_HETQmF3A":{"text":"Delicious food and excellent service!\n\nI was attending a business conference in New Orlean","useful":2,"cool":0},"RzryLr__QdRRFmLEyC635Q":{"text":"Fantastic meal!!  Had the gratin oysters to start, they were excellent.  I then had fresh ","useful":0,"cool":0},"PVAblFdgJW2qt5Ukv91bvQ":{"text":"Absolutely great food and amazing service!! Catch of the day highly recommended; some had ","useful":0,"cool":0},"6aLFSUIf-m8iFldPJw-C9A":{"text":"Just get the gumbo and the Trenasse sampler. It is really really good. Some of the best gu","useful":0,"cool":0},"9X6w8yLbBH08RYN69TIxvw":{"text":"This has been our favorite New Orleans restaurant for 7 years running. This review is long","useful":2,"cool":1},"cyMVC1SdroQPcu0RWYJZ_w":{"text":"Great restaurant on the first floor of the Intercontinental Hotel in the CBD is a partners","useful":2,"cool":2},"flCDHO7PjJRYK6MJQIbdPg":{"text":"Cannot rave enough about this underrated little gem! The sazerac is DELICIOUS, particularl","useful":0,"cool":0},"aFhLqe8SW29_sczFHL0FPg":{"text":"HH REVIEW ONLY:\n\n3-6pm DAILY (I believe you can sit anywhere in the restaurant to get HH p","useful":8,"cool":0},"lTf7WAv2w1ne6qafxxd0Tw":{"text":"Food is really good. Had stuffed quail, frog legs, French bread, crab bisque and oysters. ","useful":0,"cool":0},"I-N3jbnCSOAa_VhP5T7dAA":{"text":"We visited Trenasse for a late lunch. My hubby had a Po' Boy and gumbo. I had a dozen oyst","useful":2,"cool":1},"bEGGQF3xF_4JhkOB76GUmw":{"text":"Had this one pending for a while. The food was really fun. Buffalo Frog legs and boudin te","useful":1,"cool":0},"tsqTpa5-I-gjE-rseWMLgg":{"text":"The very first, the most expensive and the only disappointing meal we had in LA.  It was s","useful":5,"cool":3},"VfyEMvWhL9EKXjk13S88Cg":{"text":"Sorry to say, this was the worst meal I have ever eaten in New Orleans! I ordered the Crab","useful":0,"cool":0},"Dq-ZKE1C5YQoKIuVNO1k7A":{"text":"Amazing customer service! From the hosts to the servers & kitchen staff. This is hands dow","useful":0,"cool":0},"I6sXeWhPHOcqaws77Xobgw":{"text":"Fantastic meal at Trenasse! Beautiful decor, good drinks, and a great staff. It's located ","useful":0,"cool":0},"EOhSjWNWpppOGV0Nhi667w":{"text":"Was not disappointed with anything we ordered. Crawfish pie was amazing. Stinky's stew was","useful":0,"cool":0},"Z6_LWu_IK5Jpi5x8_0Bing":{"text":"we enjoyed the Gumbo appetizer because it was the first time i had gumbo with duck in it. ","useful":0,"cool":1},"H6VFDoNKvFiH-sz-fVJtpQ":{"text":"We went here for dinner. I felt like the menu was a little thin for main entrées. I had th","useful":0,"cool":0},"YVftmCUnhPdDLH8D8IItzQ":{"text":"I went to Trenasse for dinner on a Tuesday night, and was greeted kindly by the staff. Des","useful":0,"cool":0},"qtPralvBI2xhHWmzRMe3vA":{"text":"After being extremely disappointed with Acme, I wanted to find a good seafood restaurant! ","useful":5,"cool":1},"Fh0hVT6JT0fE1K7M_j_3Yw":{"text":"The food was uniquely great. The service, not so much. We had 3 different waiters. Some si","useful":0,"cool":0},"QZn8avEW5-C66ceOo6fOpw":{"text":"I had a great experience from Trenasse. I originally wanted to go here for the oyster log ","useful":2,"cool":1},"wOBgsJJoug1OAVBsWwomig":{"text":"My husband and I enjoyed a fabulous meal at this restaurant. I ordered scallops and my hus","useful":0,"cool":0},"utATeTc065-hDgfuh0rqHQ":{"text":"Enjoyed a steak dinner and cocktails at Trenasse and we were pleasantly surprised. I had t","useful":1,"cool":0},"JG1jzlp8-LT0dWUdmR7_pw":{"text":"I'm low carb, so it was wonderful that the \"bread\" was deliciously seasoned pork rinds. An","useful":0,"cool":0},"dIS1-AYKEQcv9kmpf9_7Uw":{"text":"Saved my 100th review for Trenasse. My experience here was awesome. I wish I got the name ","useful":1,"cool":1},"UOjy2sN7O16aE6iyyAigFQ":{"text":"I went with my sister and her friends for brunch on a Sunday. It was the same day of the N","useful":2,"cool":0},"3KUXRZt91612Dh6WRxcS_A":{"text":"Yes! What a great find. This place is attached to the InterContinental, which I guess coul","useful":2,"cool":1},"ZIDJVuip8vlOtTP21A1BnQ":{"text":"I wish the bar was a little bigger. However this place deserves a five. This place is a gr","useful":0,"cool":0},"xJSukLkQK5xR6kjKSxDeVw":{"text":"So disappointed this morning. I planned a fantastic 40th birthday weekend for my husband a","useful":0,"cool":0},"EnCuEVH7L34LCLm_4tzNlA":{"text":"We enjoyed our dinner so much. The crawfish pie was our favorite. The salad was perfect. N","useful":0,"cool":0},"KkXuiomA2njezLxtlXOTPg":{"text":"We had eaten at other local restaurant before we ate at this restaurant. The food is good,","useful":0,"cool":0},"2ZItJrSgrqxvUTYopTtlJw":{"text":"Go see Michelle and Brandy they are amazing!  These girls are all about customer service a","useful":0,"cool":0},"OrdfE7bxazIIoHHhW02wnw":{"text":"The Jimmy po boy is a must try , get there early because I think it's only offered on the ","useful":1,"cool":0},"R4RvMtgiA2Dk4S-VhgsVmw":{"text":"Ordered my filet medium rare and definitely came out as medium....\n\nWe asked our server (w","useful":0,"cool":0},"1L8M5JGmkFr31xZFrjvU4Q":{"text":"My husband ordered the whole fish on top of Cajun shrimp and crab meat. It was delicious (","useful":1,"cool":0},"D3npTSf5LeFfmeuw3vo3XA":{"text":"Excellent service, and fancy food.\n\nEverybody was very polite and courteous.  Our server w","useful":63,"cool":51},"spjNvcVkG7BYftVsWR4Icw":{"text":"My family made a reservation to come here on a non-busy Tuesday night (there were 20 of us","useful":0,"cool":0},"MT8KHZugso6wcwdA8AtfcA":{"text":"It was recommended by a friend and I am so glad we went. The service was great, the food w","useful":0,"cool":0},"2DHnb6EFitrDRRQCsEHr6w":{"text":"The food was worth the price. The service was mediocre at best. The wrong order was brough","useful":0,"cool":0},"rJHwuMh3ZHDTGbChZRvI-Q":{"text":"I had this place bookmarked before visiting NOLA and luckily it was walking distance from ","useful":8,"cool":8},"kmNFcdPC3WXWYImvUzGhtg":{"text":"The food was ok and the ambience was inviting. The crawfish pie was excellent! The frozen ","useful":0,"cool":0},"mqBEjclHQ9ZCPWS4vZBpcg":{"text":"This brunch was fantastic from start to finish. Situated on the first floor of the Interco","useful":3,"cool":0},"hZPBlGE4402FlAiuSvg7Yw":{"text":"Their happy hour menu is pretty good if you arrive on time. I was so stuffed from all the ","useful":0,"cool":0},"80ZADoVf1ASSLnp5f-30FA":{"text":"Wow.  We got here at 5 with a group of six.  Everything we ordered was great.   Had severa","useful":1,"cool":0},"ImlSQ_xPoQKxLj1UoUSX3w":{"text":"Food was gourmet. Presentation excellent. Atmosphere is relaxing, clean, pleasant. Staff w","useful":0,"cool":0},"efN6mDF6lTp2tCThHRSRYA":{"text":"Firstly, the bar tender Kelly was on point! I had the lamb chops, and they were good but t","useful":0,"cool":0},"xNQzrAPnjIlAmxjYA7ocew":{"text":"The restaurant is in a hotel but the service and food was all NOLA. The took a walk up gro","useful":1,"cool":1},"xVYDFl4AZRksjbbVxw7Xow":{"text":"Bro... this bar is straight  If you're looking for a great food that melts in your mouth, ","useful":3,"cool":0},"2hlvZL9U7mpHucvX3YFhYQ":{"text":"Great food and service was top notch! Happened to stop by this place while on a work trip.","useful":0,"cool":0},"OnZ6uuYN-dNrDNuNFHE_Yw":{"text":"I went on vacation here In NOLA around 5 pm and the happy hour was amazing, we got seated ","useful":2,"cool":3},"Oy_X5hdXWbeUc-JM3ZgrDQ":{"text":"The menu and ambience looked great, however the service was super slow and the food was me","useful":0,"cool":0},"ZufrK7pVldEGUoUkYi3z8A":{"text":"I was pretty impressed!!! The food was delicious and the servers were friendly and helpful","useful":2,"cool":1},"QhKynXu11A0lHgYJQYc1ug":{"text":"While visiting NOLA we came upon Trenasse.  We decided to try it out based on the great re","useful":0,"cool":0},"cNHCs9lHvYTweUDQpB6n1g":{"text":"My favorite brunch spot in NOLA! The food is great and the bottomless mimosas are thirst q","useful":0,"cool":0},"b7yCOCohMnJ7D0JBDkU8vQ":{"text":"What a disappointing experience, I think a large part of that was because we had a group o","useful":0,"cool":0},"HR81wYKxTsNHnmoI4tUSCA":{"text":"Excellent brunch today, been a while but as usual they didn't disappoint. Very nice dining","useful":3,"cool":1},"9CSL3BSMtjESBGb3iEHmIQ":{"text":"My favorite brunch spot in NOLA! The food is great and the bottomless mimosas are thirst q","useful":0,"cool":0},"Kft3lYsPN7P0KeE9ZH_hcA":{"text":"Absolutely fabulous best meals New Orleans so far. This is the log which was $62 and had e","useful":0,"cool":0},"7TPP27kz7WFvbScfKW6HfA":{"text":"Excellent welcoming service- loud due to a large group of conference goers who stopped in,","useful":0,"cool":1},"B03pYT7sbRFrjUu1O0RFog":{"text":"Amazing service, fresh fish, nice ambient\n\nI forgot the name of our waiter, but I have to ","useful":2,"cool":0},"MxpzwIfyeckae9_S7R51Lg":{"text":"Mt wife and I recently visited NOLA over the Christmas weekend. While in town, we had dinn","useful":0,"cool":0},"avdwhXiRpLA7zgL-AwUQcQ":{"text":"Great service and great cocktails great food. Will come back! I had the fried fish. Defini","useful":0,"cool":0},"8Ljm6QQFHFeLpbHmENqOTg":{"text":"We enjoyed happy hour at Trenasse. 75 cent oysters! It was very busy at the bar and we enj","useful":0,"cool":0},"AlagbMYHeIgq-k4UsrG98Q":{"text":"Trenasse is conveniently located in the downtown area near all of the hotels, and I think ","useful":4,"cool":3},"3L1Rk5_1CWGREQ8quJCSmA":{"text":"This place has seriously good food and is really well run. Happy hour is pretty cheap duri","useful":0,"cool":0},"Tdx1VcCkxk7LYm326EdpWQ":{"text":"Usually, avoid Hotel Restaurants, but the Blue Cheese Wedge Salad with Fried Oysters was d","useful":0,"cool":0},"Zos2rR9iegvei504AEVQzA":{"text":"Had the pan fried redfish Meunière and the blue crab bisque.  The bisque did have plentifu","useful":2,"cool":0},"U62PZWHTbOBzUUpjzsO99w":{"text":"Good to very good but  Not special.  Dont feel the need to go back.  Above average but so ","useful":0,"cool":0},"1Glp0zg2qzr2D_lDsXeTww":{"text":"$10 bottomless mimosa brunch?!?! I can get used to that!\n\nTrenasse is located in the Inter","useful":3,"cool":1},"m3DykrR0BVMDq6KXiV-2mw":{"text":"We have searched and searched for a place with a decent, well-priced, happy hour for the p","useful":4,"cool":4},"mt-dOJ8BFyYkFbF0zfdKqg":{"text":"Good food, nice menu options, good beer and wine list. Service was good, not memorable.","useful":0,"cool":0},"T5F-kUeg4AD5F3SPUNrUTQ":{"text":"Went there with my husband for a late lunch (he normally does not eat lunch and just had a","useful":0,"cool":0},"GJwsL0qzIiky-crTS0oRXA":{"text":"Loved their fresh oysters, chargrilled oysters, drinks, and service.\n\nProbably enjoyed the","useful":1,"cool":0},"jhilGRv1b0tTWXciJeXFCA":{"text":"Great service and attentiveness of staff. I ordered shrimp and grits for breakfast with cr","useful":1,"cool":0},"hJlTlMSiKfEMP3l6x2j5Sw":{"text":"This place was terrible. I don't understand the good reviews. The food sucked and was way ","useful":0,"cool":0},"SNBIPCG6UexXSrC92GoXaw":{"text":"Very solid. Menu is not too lengthy in terms of offerings but the chef presents very solid","useful":0,"cool":0},"vJXnZ53YAaAYx0tsjpHunQ":{"text":"Stayed an extra day in NOLA and for lunch we stumbled upon this gem. It's kinda hidden to ","useful":1,"cool":2},"rFPJEjkTdZsUGLaz5KvwmQ":{"text":"Excellent restaurant with great food and very good service. Loved the broiled oysters and ","useful":0,"cool":0},"GlP_uGCPBnbmnmCa2sNWEw":{"text":"I would have liked to rate Trenasse 3.5 stars, but because of the service and atmosphere, ","useful":2,"cool":0},"z4nJGhWNT7fDL4fdZ2v6gQ":{"text":"Wow. Just wow. Everything from start to finish was incredible. The highlight here is the e","useful":0,"cool":0},"D0WuGCEmGcORmnbBc2OXFw":{"text":"12.3.16: Like what??? What a great experience. Wish we knew about their happy hour beforeh","useful":9,"cool":7},"IuY653gprkjFT2So2G5EXA":{"text":"Happy Hour Daily 3-6pm\nRaw Oyster $.75/each the oyster was huge!!!! The biggest oyster I h","useful":1,"cool":2},"8YTWlYoNkKVUC9j09yuTlg":{"text":"I had a friend tell me that people don't travel for food! Well New Orleans is one of those","useful":0,"cool":1},"wo5QMUmfBDyQoojbAZy_Ew":{"text":"Trenasse is the complete exception to any other restaurant hotel he will probably ever go ","useful":6,"cool":3},"nIP3VSAtA-dHmalib-ip6A":{"text":"We had just checked into our hotel and seen this place had availability so we stopped in. ","useful":1,"cool":1},"IH2mTJy9hbskJyIAOLLA5A":{"text":"We came for happy hour and specifically for their oysters. We had half dozen of raw oyster","useful":0,"cool":0},"kHsayBbTMI-0l2FKHbsdig":{"text":"Friendly host. Excellent server. Tasty fresh food. I was truly surprised as I am not a hot","useful":1,"cool":0},"rqdVxLPKjTF-IFWMYAVS2w":{"text":"Happy Hour Rocks! But the service does not. But let's skip the latter, and focus on the fo","useful":3,"cool":2},"ONCewnFBhlhrJbe0ZyNGCA":{"text":"Came for HH. \n- Got the smoked turkey. Taste was a 3/5. Worth the HH price\n- The crawfish ","useful":1,"cool":1},"K80ThL0QdGa7J4Wtm4h3dg":{"text":"This is just a stellar restaurant. The service was spectacular both times I went there ove","useful":0,"cool":0},"lohCYOv53BP1thOHzBi-3g":{"text":"Happy Hour oysters and drinks were pretty good. \nNothing to write home about...(pun intend","useful":1,"cool":1},"k9VwOxpEWbIMqcyGz41Igg":{"text":"Great spot with outdoor seating in the heart of New Orleans! My daughter and I found this ","useful":0,"cool":0},"6iB5dRlvwBaZ5hORJxHSSQ":{"text":"The location of this place is nice. The atmosphere seemed very hurried. Our server was gre","useful":0,"cool":0},"QDA43Sx9eIRgvQTY5KkHCg":{"text":"We came here as a last minute dinner and we weren't disappointed! I had the Brie burger an","useful":0,"cool":0},"RZIYVjbgMOrWwgPpImSRYQ":{"text":"The place located inside lovely hotel. Atmosphere inside is very good and happy hour is am","useful":1,"cool":0},"HR1PQauVc2o1eYEx6Xm-LQ":{"text":"They are open during Covid and have pleasant outdoors sitting. We had frog legs, gumbo, gr","useful":0,"cool":0},"r1bhVy0lMmS_pY9z8KXwVA":{"text":"The meal was delectable. Service was prompt and friendly. Bottomless mimosas are the way t","useful":0,"cool":0},"EMXG396X07Z7R9OoE260Ng":{"text":"The customer service here is great, thanks guys! The rating reflects the value of the food","useful":1,"cool":1},"eLlBW20n6Y3KLULn-UTXbw":{"text":"First off our friends said you have to go to Luke's. Well Luke's was booked and I happened","useful":2,"cool":1},"Ae_k11_ZjoifZ_ghXvwCNg":{"text":"This place is amazing. We thoroughly enjoyed ourselves. During brunch they have live music","useful":0,"cool":0},"fARbvKYz-ArMiipJIIoS_A":{"text":"If you want a brunch place that has bottomless $12 mimosas, THIS  IS  YOUR  SPOT!\nOur wait","useful":0,"cool":0},"fuWxQrrw0CdGaeyLKWYjgQ":{"text":"Tiffany (service manager) and Nais (bartender) were fantastic during our visit. We had din","useful":0,"cool":0},"2LudEawYvhz9npqRKsVUKA":{"text":"Okay, so being quite inebriated I can say without a shadow of a doubt.  Chili pepper shrim","useful":1,"cool":0},"sBpVNrXvlHZ5GaCwDK0hIQ":{"text":"My family and I are from Houston, we stayed at the hotel Intercontinental New Orleans and ","useful":1,"cool":0},"BJQ5Gb3fB4W-e8g3vP3oPA":{"text":"Trenasse is surprisingly casual for a restaurant with a long wait. Perhaps that comes from","useful":4,"cool":3},"_h1dx1gf7AF_FfN1m49R-g":{"text":"So many great things to say about this place! The service is really great. Very attentive ","useful":1,"cool":0},"z6RXV9kCtZSsMGfqe88e9A":{"text":"This is, by far, my favorite restaurant in the Big Easy. The food is luscious and presente","useful":0,"cool":0},"UJxdvIjf1isd0CZ6bZU2HA":{"text":"Deleted comments\nWas entered under wrong establishment","useful":0,"cool":0},"q12RFLxpggDeapA8MNtBUA":{"text":"We celebrated my birthday with brunch at Trenasse and it was amazing! They fit us in witho","useful":0,"cool":0},"_Epdxn7FqPeEVjE8YRlv5A":{"text":"After looking for a place to eat after arriving in NOLA, we ended up at Trenasse. We didn'","useful":4,"cool":0},"QVq5HU0bTGUdEE9cGyrDog":{"text":"This was a nice spot.  It's located inside the Intercontinental hotel.  It's not that big,","useful":1,"cool":0},"aoxcj9YIVROtJb3yiA9vQw":{"text":"Updating my review for Trenasse. My girlfriend and I made another trip to Trenasse during ","useful":2,"cool":2},"m1QxUOYLlWL9zG8FvUg18Q":{"text":"We made Christmas Day reservations and were excited to have their Reveillion dinner. We ar","useful":0,"cool":0},"yD-q0sUuwdO3j7uMO7HPTQ":{"text":"Came here for my birthday brunch and everything was tasty . The bottomless mimosas kept co","useful":0,"cool":0},"HIVLtXt1xYRwh1jVE95hhw":{"text":"Friendly and attentive service. I ordered a few dishes during their happy hour special. \n\n","useful":2,"cool":2},"pA1W_YR06JfSUjZU2016zQ":{"text":"Great bar for drinks and food! \nDuring my stay at the Intercontinental New Orleans, I spen","useful":1,"cool":0},"MEVVywUubyEvP3IOBGKj1w":{"text":"This restaurant was the BEST PLACE FOR OYSTERS IN NOLA. It was best oysters and best price","useful":3,"cool":1},"YIcP4M7GmE2pgHLCadx7WQ":{"text":"Hmm... I am quite surprised that Trenasse has such a high rating on Yelp. We went there on","useful":2,"cool":1},"2ZRnXVkU8R2eM-Q7ixZx7w":{"text":"Can't say enough good things about this restaurant! Food was amazing, service was outstand","useful":0,"cool":0},"RKWNh6AAw-KPA_b69dTEGg":{"text":"This is a nice upscale restaurant located in the Intercontinental Hotel. The focus is on S","useful":2,"cool":2},"Sklla4-MXg7XWc7CroWujg":{"text":"Our service was EXCELLENT!! Our waiter name was Eric and he took such great care of us ton","useful":1,"cool":1},"sCPsCncMR3UAreKghSVpZQ":{"text":"I left feeling as though I should have dined elsewhere. I ordered the Crab cakes which wer","useful":0,"cool":0},"vuTnUlWSYme9_SHJraJ6XQ":{"text":"Located on the first floor of the Intercontinental Hotel, Trenasse is one of this city's g","useful":11,"cool":9},"M_Q0giIc6Ib_ivxMBqSurw":{"text":"Loved the ambience of the restaurant and the NBA conference finals were playing. Nice cock","useful":0,"cool":0},"Mb7nqY8H9JhzBWChXZPQrQ":{"text":"For a hotel restaurant, this place has a very nice feel. The service was very, very good a","useful":5,"cool":3},"u6ng7loFfsH36kgOtXJjbg":{"text":"Stopped in for 75 cent oysters and ended up eating a whole meal!  Happy hour is daily 3-6 ","useful":0,"cool":0},"-GLZk_WmB2gKHEEdTFuMog":{"text":"So good we came back twice during our trip to New Orleans. And with such an abundance of d","useful":0,"cool":0},"M7TkyInDVLUDtSIey_2Big":{"text":"Visiting from Dallas. The food was fantastic, will definitely return.","useful":0,"cool":0},"GisNcRtJZbWC8iT9r8GrUw":{"text":"We stopped in for happy hour and the food did not disappoint. The oysters were fresh and d","useful":3,"cool":1},"tYbc3ft4D47Ms8azTbme8Q":{"text":"Good food and good service! My son and wife both agreed they had a fantastic experience an","useful":0,"cool":0},"-lqX1Ski6Lm7_7IS2fxoUw":{"text":"A wonderful culinary experience. Attentive staff who realizes the a meal is an event to be","useful":1,"cool":0},"pCYwlj24Y1dwVB9vRodHJw":{"text":"I got \"stinky's stew\" which is basically seafood soup with snow crab cluster sticking out ","useful":0,"cool":0},"Rb_3dGpOs2ith2tEbP1iwg":{"text":"Overall a good restaurant. We had the Stinky Stew and the Trenasse sampler, and oysters. B","useful":0,"cool":0},"SGZLOhLoVwxcO5TPxCH_fA":{"text":"I went to NOLA for my 21st birthday and I loved the food here. The crawfish pot pie was DE","useful":0,"cool":0},"Tgb4oj5i_T4CXbT5AvEq3A":{"text":"We were in town hosting some customers. We had made a reservation about a week in advance ","useful":1,"cool":0},"imEKxH_I5bhLRJRdYzQLCQ":{"text":"*This review is based on take-out only.*\n\nWe got take out from here for a lunch meeting at","useful":5,"cool":5},"6M4zLGptUXg3mNF_1cKLug":{"text":"Where do I start!? First off all, the greeting at the door was so welcoming and it happene","useful":3,"cool":3},"dgo6CpiA3wFLgCBfH4Ke3Q":{"text":"Our server Eric was the best! So glad we got to check out Trenasse. Nice cool ambience ins","useful":0,"cool":0},"qw29d27PzPs66Aqk2UghFA":{"text":"Okay, so being quite inebriated I can say without a shadow of a doubt.  Chili pepper shrim","useful":0,"cool":0},"-RbiaO_4urZKRjb1IPOiIA":{"text":"The best meal I had during my visit to NOLA! \n\nLocated at the Intercontinental Hotel. Nice","useful":6,"cool":2},"hhsoLt0G232pQk7XorGgIQ":{"text":"Food was good portions were small and price was more than the $$ posted more like $$$","useful":0,"cool":0},"XyLF8LQX3FYDTL-CCdn_aw":{"text":"This is a great place at the bottom of the Intercontinental Hotel, part of the IHG Group, ","useful":1,"cool":0},"FkcvyVJy6gCclQ3mA6t37A":{"text":"Made a reservation for valentines day... got there about 15 minutes early & the waiter cla","useful":0,"cool":0},"nS-7yC_oyFR9ot7vDW2s8Q":{"text":"I have been in New Orleans for 5 days and haven't seen crawfish in a menu, till tonight. T","useful":2,"cool":1},"sCCokSDN_FrYNiwXBYqg1w":{"text":"Meh. Food was good but not outstanding.  Great music and service. We had the French toast,","useful":0,"cool":0},"E4X-X2MPj1z9RG5h_nybVw":{"text":"This was the tastiest meal of our three-day trip to New Orleans. My number one was the bro","useful":0,"cool":0},"H_5WET2UnR1yqt80ptXQuA":{"text":"This place is suck. The food was not fresh, they give me  seafood that was frozen to eat. ","useful":0,"cool":0},"Fwi5laJPOHKuyp0czcjPvg":{"text":"Food was excellent. We got the intercontinental oysters, crawfish pie a must try, and the ","useful":0,"cool":0},"JinQKJz1HVTPrvq9nq9lxw":{"text":"Boudin balls, debri fries and the smoked wings were AMAZING!! Good for happy hour and not ","useful":0,"cool":0},"TG8UQqLBZBuQwgZEfUKMjA":{"text":"Came in tonight with my father after a very long day of driving from New Mexico, very tire","useful":1,"cool":0},"7AHsCzehBe7yXKNRXJQb5A":{"text":"This is an amazing restaurant. Love the food and the staff so much. Gina and Falon were am","useful":0,"cool":0},"RBTwHz-QeOA_FuHiJz3fXQ":{"text":"Just okay. Very corporate feeling, as it is in a hotel lobby, smells like perfumed cleanin","useful":0,"cool":0},"v1sYa8W7miD1sIa-CUrfJA":{"text":"This restaurant was on my bucket list for a while, and it did not disappoint. I loved ever","useful":8,"cool":7},"T9x0E7B8u09uMhBZDDVuDA":{"text":"Food was great! Oysters were even better. I had the crawfish Mac and the platter of oyster","useful":0,"cool":1},"QeeOhxSzFvyIKNYrukPFAw":{"text":"LISTEN!!! This place is top notch. It's not a 5 star, only dress tops and sleek hair kind ","useful":1,"cool":0},"P0gk2kIiA7G6AjU97glAgw":{"text":"An amazing, intimate and safe experience.  Staff was beyond nice, the food was delicious. ","useful":0,"cool":0},"89RV7jB0KPVhMM6iLC0IIA":{"text":"Seemed very much over rated based on the reviews, nothing spectacular that we had.  The oy","useful":1,"cool":1},"9f1ZTzRvldEFt5B-l6gI_A":{"text":"Dined here during Bayou Classic weekend. Great meal and great service this weekend! I only","useful":0,"cool":0},"PPe6OPt7zoIdth6dZq7IqQ":{"text":"This place has the best restaurants in town! The happy hour has so many choices, and the $","useful":0,"cool":0},"1wj8Q9OYWXhuz3QL7we0TQ":{"text":"$10 bottomless mimosas!! I repeat $10 bottomless mimosas!! But seriously, that's a great d","useful":1,"cool":2},"ZYuN1Vaxpxttu1iX_XjtxQ":{"text":"Visited New Orleans for a weekend and dined here for brunch. I had a french toast with bac","useful":0,"cool":0},"eeFLcSt2MSgwYyWR1N96JA":{"text":"I'll cut Trenasse some slack for it being a Saturday night with a Mardi Gras parade right ","useful":0,"cool":0},"dECeb-dM9tgcoag3Njw69A":{"text":"Food and service were fantastic! We made a reservation for 10 but half of our party couldn","useful":1,"cool":1},"2HADbO0c-kXa_kpMWMPk9Q":{"text":"Great hh oysters everyday! It's located in a hotel but for $9 for a dozen you can't beat t","useful":1,"cool":0},"l-wpU31tRSvDGNj6M6qwuQ":{"text":"Food and service was average.  Had higher expectation based on rating here.  The charbroil","useful":0,"cool":0},"-dWENR4eeDA30twvUK-F2Q":{"text":"Had our valentine's day dinner here, got here a little early so we sat at the bar until ou","useful":1,"cool":0},"NrgGrIJex-Tb7n2tWPZl7g":{"text":"The hostess here was incredibly rude. The restaurant looked very slow, several empty table","useful":0,"cool":0},"WpxkTNDmKsKeMAz9ueRzEg":{"text":"Amazing food!!! Everything we had was cooked perfectly and had awesome flavor. The only th","useful":0,"cool":0},"po4jalfhn53G-N2tSlGh5w":{"text":"Our first time eating here for a family dinner outing & I'm so glad that I had Trenasse on","useful":0,"cool":0},"dYlJ6L1CeG6JSQeub_wlEw":{"text":"Great place. This restaurant locate Inside inter continental hotel. Lots of wines, profess","useful":0,"cool":0},"jNCp4gCeJhjjW1BSeWBP4Q":{"text":"Ended up in New Orleans during \"Restaurant Week\" and so found myself in some heavy competi","useful":2,"cool":1},"FnlhmEh9S3FixPEpCS6New":{"text":"The happy hour here is a great deal\nYou can get a dozen row oysters for nine bucks. \nThe s","useful":2,"cool":1},"e3HaLIiaq198l_2M06LrbA":{"text":"This place is so good! I don't know how it wasn't packed. We went the appetizer route sinc","useful":1,"cool":1},"QeEi_abvdbKPeZSwbHM-Ng":{"text":"This happened to be attached to our hotel the intercontinental On St. Charles street. We a","useful":1,"cool":1},"Gi4Q_7sEPKGYgQDC9ITruA":{"text":"Me and my friends came here for Happy Hour on our late day in New Orleans. The place itsel","useful":1,"cool":0},"b__-fUJppMwY0UQMXgs06g":{"text":"Beautiful atmosphere, service was great, and food was outstanding. Definitely coming back ","useful":0,"cool":0},"u5qkpxPzqh8u3JRqovBPYQ":{"text":"Went here for happy hour twice. Awesome location as it was in our hotel. Can't beat the $5","useful":1,"cool":0},"RJu7s3374fG6E7vp4fhrng":{"text":"We did Christmas lunch here and went well. The shrimp and grits were flavorful and the cra","useful":0,"cool":0},"iU3xV_rsmKVpmuZPu-_YHw":{"text":"I wish I could give them 10 stars. This restaurant is beautiful. The food was excellent, v","useful":0,"cool":0},"Ek6ovFFtcTZd0f2VNtz_Zw":{"text":"It was a great restaurant/hotel experience....walking into the restaurant with steamy humi","useful":1,"cool":0},"bIUKn7mEacmQUMJrka4gxw":{"text":"Went there for happy hour and would only go back during that time, oysters were delicious ","useful":0,"cool":0},"L7Z-66mS0D_41xZffHkg2g":{"text":"I didn't except much from happy hours. But this place literally blew my mind. We stopped b","useful":2,"cool":1},"DkfXPCr__TmQej9w4sveFw":{"text":"Happy hour\n\n-0.75$ raw oysters were delicious: bright, mild, and medium size. Ordered a do","useful":0,"cool":0},"wRjunZ-4Ohp9y7-V730kRQ":{"text":"Service was meh and inattentive. Food was pretty good however. Fees a bit overpriced compa","useful":0,"cool":0},"5kfX0wwfNQTFbCETTjFqjw":{"text":"Absolutely beautiful setting-absolutely wonderful food-absolutely fabulous staff-it truly ","useful":1,"cool":0},"DDoUH_HKQVkCmKy3VFUTdg":{"text":"Stopped here basically to get out of the rain and have a drink. But ordered an appetizer a","useful":0,"cool":0},"1YIhUAZF3qjqrXHpaEhLyg":{"text":"The food and service were excellent. We loved it so much we ate here two nights in a row. ","useful":1,"cool":0},"sHJNO1FV_3TkyUCmGinUyQ":{"text":"This place was absolutely awesome!! Great staff and vibe! The food was some of the best I'","useful":1,"cool":1},"1AYaxuZxKpzebjqQxfaXsg":{"text":"I was here twice late February during happy hour (every day 3-6) and two of the items were","useful":2,"cool":2},"Q_zBAAqf-Cc9UHrZ_UYbrw":{"text":"Made this a first stop on our vacation to NOLA and it did not disappoint! \n\nWe sat at the ","useful":1,"cool":0},"8BPSq-XZ10oDnkIchN-hrQ":{"text":"Server charged $1600 which the bank declined and shut the account down for fraudulent char","useful":0,"cool":0},"kaFUKkcz_nTZkU0PFMI5Ww":{"text":"The 3-6 happy hour is amazing! I tried everything from the crawfish pie to the catfish. Al","useful":0,"cool":1},"vdCLTO1uNhTQq-Dh0JkSow":{"text":"I wish could give 100 stars! Me and a couple girlfriends had a reservation for 12:15 under","useful":0,"cool":0},"ONVhmEK9hbrxnLjK3a0R3w":{"text":"Food a service was AWESOME! Went for the bottomless mimosas on a Sunday, definitely will b","useful":0,"cool":0},"jd5vny9Jn-vB1NT5uaWFDw":{"text":"Takeout apparently is not Trenasse's strength.\n\nI stayed at the Intercontinental while att","useful":3,"cool":0},"pm94Kgn-_WHhjK1I4o6NJg":{"text":"I came here explicitly for the crawfish pie after hearing someone talk about it. It did no","useful":4,"cool":1},"YRNMOGzt7BqjipAYIgNtqg":{"text":"I've been for dinner and brunch and both were very good, this place makes some great food.","useful":2,"cool":0},"5YjAx797P4DoIJBji6A0nw":{"text":"I was teetering between a 3 and a 4 star review for this place. The service was good. We h","useful":0,"cool":2},"_E-Y6BmwyG5Z5XQ2XfxvSQ":{"text":"We liked this place. Not too crazy or busy, but friendly service and live music on a Frida","useful":0,"cool":1},"iMh6T5_lXIMUYGJdTn_fDA":{"text":"This was by far, the best place we ate in New Orleans! If you are visiting, make reservati","useful":0,"cool":0},"TFY63WKologAoT1cdlEXsA":{"text":"This restaurant is everything you could want in NOLA! Food is exceptional, fresh and local","useful":0,"cool":0},"rQZOxiF23Qzchs0Z8DL2JA":{"text":"First restaurant choice of 2016, and WHAT A CHOICE it was! It might just leave me in disap","useful":5,"cool":2},"FLIHemo3VN-sra51yus9ZA":{"text":"Not only the food, but also the service was great!\nMy husband and I shared gumbo soup, and","useful":0,"cool":0},"8a00v31g3qRayUz-B2QVjQ":{"text":"My wife and I ordered the creole nachos and stinky's stew and both were excellent. The foo","useful":0,"cool":0},"zdDqRgV9BtNWprV9qxQiPQ":{"text":"Excellent Restaurant! Absolutely the best oysters in town. Great variety of appetizers (th","useful":0,"cool":0},"mwS8LpJ9OoK8x8DBCS8adg":{"text":"Today after church, I was verbally harassed and attacked by SCOTT PETERSON at the Intercon","useful":1,"cool":0},"N1VD-JmvxxB0U2aZDmWArg":{"text":"The food was good but the ambiance and service was terrible. For this reason I don't recom","useful":1,"cool":0},"a7f9svw-lHHs98C6bvU7Mg":{"text":"We visited Trenasse 2x during our recent trip to NOLA. Both times for happy hour. We had s","useful":1,"cool":1},"m1r70O8mQGS4O8flV1tMdA":{"text":"Amazing happy hour ! The quality of food that you are getting for the price it's a no brai","useful":2,"cool":1},"gLTYXz8DwgZ7JDVYWMuzUA":{"text":"Fantastic! We arrived without reservations on a Thursday evening and were seated immediate","useful":1,"cool":1},"1WGiS94-e5jHjEMovuyCcA":{"text":"Great happy hour! 75 cent oysters and good oysters! The services is amazing and super nice","useful":0,"cool":0},"5E_8K-BaO528fOWTPNJTRA":{"text":"This restaurant is absolutely fantastic! We had a group of about 60 people come in a few w","useful":2,"cool":1},"np0XIVW7Qt48aU4KFap3qA":{"text":"Had a very good lunch today.  Boudin bit were good.  Gumbo was okay.  I love the drum fish","useful":1,"cool":1},"YPSBUAW8Jj0XRcXFPxEAEA":{"text":"Very nice sandwiches and, with a 2 for 13$ lunch special, lets u try several items. Pretty","useful":0,"cool":0},"jSW43P763qFCBIzGBbPiag":{"text":"Not bad for happy hour! You can easily eat a full meal here with the variety of items offe","useful":3,"cool":1},"cA19Zr3WLenPVtAQ-VOqfQ":{"text":"Rarely is a restaurant attached to a hotel so amazing. From the food to the ambience to th","useful":1,"cool":0},"-fHeZhhB1CmFi9mS9U5S7g":{"text":"This spot is absolutely fantastic!    I came here on my recent trip to NOLA and was super ","useful":2,"cool":1},"XXVx0Nvwt6_BsVJDl7dEVQ":{"text":"THE BEST LUNCH I'VE HAD IN OVER A YEAR\nand it was their $20, 3-course Coolinary. After a m","useful":11,"cool":5},"47ka3DtvKm-5MdQ1A8OqXQ":{"text":"We discovered Trenasse two years ago while visiting New Orleans.  So having brunch there t","useful":0,"cool":0},"94VB1R8JVFd0zM7jx6LRbA":{"text":"Great food! Beautiful presentation on all the dishes. Awesome service by Alayna, thank you","useful":0,"cool":0},"EZTuYSpoupNq6F0hmdYlpA":{"text":"Wonderful place for New Orleans Cuisine, and since it's in the heart of the CBD, it's also","useful":4,"cool":1},"g6_dugEvYb4gfz1k1WpE2g":{"text":"I usually avoid restaurants based in hotels, but we really liked the menu and decided to g","useful":3,"cool":1},"jZnLViNifeYIP0acAylDUA":{"text":"My boyfriend and I are in Nola for one of my best friends wedding this weekend! We were lo","useful":0,"cool":0},"-2TMlLNSS6keINlaQOaW_g":{"text":"The biscuits were great but was definitely very disappointed in the French toast. It was v","useful":0,"cool":0},"JX79NbyiE2G5YAzODFivAw":{"text":"During this wonderful Lenten season there are so many options for fish on Fridays, so me a","useful":23,"cool":15},"WyBq8E-Jwovo6hO_pmli2Q":{"text":"I couldn't eat enough here.  I was staying at the lovely Intercontinental next door and sp","useful":1,"cool":1},"DCi7Z4QiPZWWwKBywOvrIQ":{"text":"Went here on a Friday night and so glad we made a reservation because they were turning aw","useful":0,"cool":0},"mBZ2XGop35cMtJwSQrRZsw":{"text":"Okay what is up with the high-rating here?\n\nP and I came here for HH, because we wanted so","useful":1,"cool":0},"UUAF-ss3j-PCeiAEAb3kIA":{"text":"The lamb chops are absolutely perfect in every way. The food came out at the perfect tempe","useful":1,"cool":1},"LHdJ2QH1lqXeuD897T8CUQ":{"text":"What a great place to enjoy Sunday brunch Néw Orleans style... unlimited mimosa's or Blood","useful":7,"cool":4},"PBfjyV9suQ4HhtZeSEiZlw":{"text":"The crawfish pot pie was delicious. The restaurant is attached to a hotel. Service was goo","useful":0,"cool":0},"unaaaokLR--YL0bodgBBWw":{"text":"We found ourselves looking for a place for dinner for our party of six on a Friday night, ","useful":0,"cool":0},"-PedfSzjLrBUG6jiJvcrpQ":{"text":"I was very impressed with the crawfish Mac & cheese.. but not much else. The daiquiri I ha","useful":1,"cool":0},"cTTXRy6KNbJE7OAFexQiOQ":{"text":"This is my second time eating here. I visited once in 2019 and then again in 2021. So sad,","useful":1,"cool":0},"Xl5O9BOvuEoMvCmElLwBaQ":{"text":"My wife and I ordered the fowl gumbo and Blue Crab Bisque for appetizers. The gumbo has a ","useful":3,"cool":0},"lSynU_c24pfusV9UEfceFg":{"text":"Our 4th visit to Trenasse & sadly I was disappointed. The good news is my hubby had a wond","useful":0,"cool":0},"IdKzA7nJxYFgMK0jMvoA4w":{"text":"Wonderful place for some New Orleans cuisine.\n\nI had the Louisiana Crawfish Pie. It was lo","useful":0,"cool":0},"otswXVQ0FqkpfaeBETzs7g":{"text":"Mediocracy at its finest. The saving grace was the jalapeño grits. I'm really not sure why","useful":0,"cool":0},"pkgw8oWgGUcRHrUr3beTlg":{"text":"Good food. Had a carry out while staying in New Orleans. Wedge salad was super fresh. Appe","useful":0,"cool":0},"zmzgoKsSv9k5lUSs1UKJ7w":{"text":"Such a quaint little restaurant!  The food was amazing and the service was spectacular!  D","useful":0,"cool":0},"bcEEnwkEEL3IXNi_1xxB5w":{"text":"Terrible service. Remarkably understaffed. Expensive. Out of two of the things we attempte","useful":0,"cool":0},"2f6j0CB7isKUfrWHTKs-OA":{"text":"Horrible service and bottomless mimosas are a scam. I came here with my wife who loves fin","useful":0,"cool":0},"ubD8K1mNNi7KTb0BIQP5sA":{"text":"The food was delicious, but wow are the portions small. I had to ding a star for that. I w","useful":2,"cool":1},"D9RxirJ6ki_TqzXCI_PwFQ":{"text":"Absolutely delicious and I love their bottomless mimosas! I've gone back twice so far. So ","useful":0,"cool":0},"-5yJJNuOJ1t1vXVAF2_BTQ":{"text":"Not your typical hotel restaurant!\n\nWe came in on a Sunday during their happy hour (3PM-6P","useful":3,"cool":1},"YGrTIeBzx_t2jfcGoSDupA":{"text":"Excellent food. Just a little pricey. Excellent service and nice background for pictures.","useful":0,"cool":0},"g1xkJlJHo5jM9RTB2vglnA":{"text":"I had the most amazing bottomless mimosas and stuffed crab oysters! Definitely worth a try","useful":0,"cool":0},"U7zQEmPNQ0zGR5-63vKUew":{"text":"Great ambiance and the food was impeccable!!! Coming back next time I'm in New Orleans.","useful":0,"cool":0},"fX4l5sGDXPKioHgk7hCYBQ":{"text":"I came here after reading the positive reviews for this place in general + the vegetarian ","useful":1,"cool":0},"bJLR7qmIlbXk3d35ozLGmA":{"text":"Friendly service and great atmosphere! Our server was nice, the manager and General Manage","useful":0,"cool":0},"UuL3AroI3VsSE8biN8TLSQ":{"text":"Took the family for the first time, had Blackened Scallops with lump crabmeat, holly sauce","useful":0,"cool":0},"iDk0INknS43u85xWLECpFA":{"text":"Truly a hidden gem in the city for bottomless brunch! I went for the first time with some ","useful":1,"cool":1},"fQ-jBffeAzXj4FZdmVkVBQ":{"text":"This is a nice, moderately priced restaurant with a small, well-planned menu. I ordered th","useful":1,"cool":1},"ypivm_YyKbKYGordTvnb9Q":{"text":"everything is good.\njust incredible.\ngo for the oyster log with side of toasted french bre","useful":0,"cool":0},"MAvRCW8eAmQTX2m6rthbBQ":{"text":"Great place, with delicious food and perfect services! Oysters are fresh and massive, than","useful":0,"cool":0},"V-3xPYZtO6TQ4_0H-8So9A":{"text":"Y'all know what time it is...another day, another brunch review from J. Trenasse has been ","useful":0,"cool":0},"CThwmNUNMBMO8cUvpXBPKQ":{"text":"I wanted to give this place 5 stars so bad! The service was awesome. All of the food with ","useful":0,"cool":0},"MhLrSzQP_3zrPZ1fpazPlA":{"text":"Everything was good. Highly recommend!! Gumbo and stinky soup was great. But you might wan","useful":1,"cool":0},"hxwv2mirFo11u1zCCRQ4_A":{"text":"This was one of the best buffets that I have gone to in New Orleans!  The omelettes were d","useful":0,"cool":0},"7mUEQUaFqlEBw6UezHuDZw":{"text":"Delicious raw oysters and crawfish pot pie.\n\nBUYER BEWARE: the cooked oysters (intercontin","useful":1,"cool":0},"2q1KbnBdAAnMwYhg-Oeo9Q":{"text":"Our last day in New Orleans we decided to check out Trenasse, when we first got there they","useful":3,"cool":1},"Z3peCxy0oCt3EpLGDmR_RQ":{"text":"Ryan L., our waiter, did an amazing job giving the best service. There was also a female w","useful":0,"cool":0},"ntBQF3xMPSGKhnBALknoVw":{"text":"(English)\nI was in the neighborhood \"yelping\" for good, tasty restaurants and Trenasse was","useful":1,"cool":0},"2LZnDDeC3JR-fK8RlU6Z-w":{"text":"We walked to the restaurant from our hotel and got lost at first because the construction ","useful":0,"cool":1},"XGyenvhD7SpOL2XhZgQlYA":{"text":"For supper we split the revillion and the scallops. The scallops were the best I've ever h","useful":1,"cool":1},"z4MERaD4NkaC1VrBSK0x1Q":{"text":"This is a terrible experience, since we travel all the way from Texas, and planing to go e","useful":0,"cool":0},"mT_cDBcEF7CpXQi7Qp1nBg":{"text":"Slow service. Chicken wings were dry, over cooked and burnt as seen as photo. BBQ Shrimp w","useful":0,"cool":0},"I-o3ApOqLPBpZTBG_nclBw":{"text":"Great food! We had Crispy Boudin Bites, Unka Dunks BBQ Shrimp, Redfish Tacos, The Jimmy, T","useful":0,"cool":0},"7NXjZHfr-EgGzyqD4ACHkg":{"text":"Great restaurant. Service was average, but drinks were good all around, as was the food. W","useful":1,"cool":1},"ijpWETtyMAO7bTv3TSfRGw":{"text":"Used to be our favorite place in NOLA but our recent experience left us scratching our hea","useful":0,"cool":0},"caH3y6LzOeBTuE48TRPezQ":{"text":"Located inside the Intercontinental Hotel, Trenasse is what you'd expect to find inside a ","useful":22,"cool":23},"R4NYpYq5KbBVZ-BD4oI3Gg":{"text":"I made reservations, but I thought it was for taco Tuesday and they said it's only for lun","useful":0,"cool":0},"FhSzXg3nNf5IlnFrwt4_Mg":{"text":"The rib eye was flavorful and juicy and overall just everything you'd want from a steak. T","useful":0,"cool":0},"mg39PlXp5MuG0i2Srxhnbw":{"text":"It was simply  ok. The service was ok. The cauliflower appetizer was very good; however th","useful":0,"cool":0},"tfjUO-LziQTMQrq-4zFxew":{"text":"Laissez les bon temps roulez (Let the good times roll)!  Not here!!  Just keep rolling pas","useful":7,"cool":2},"IOXMsj7dC0PyvwWyijf4aA":{"text":"The burger had a weird burnt aftertaste. Creme brûlée was very good but a tiny bit burnt a","useful":2,"cool":0},"RwLdzSJkxwRb_K352oCoRQ":{"text":"Came here back in August. On a Thursday around 8 or 9, it wasn't crazy busy. Do note that ","useful":3,"cool":1},"D7HuYbweGLav8GeaQMuOYw":{"text":"This place was very busy and somewhat loud, but lively atmosphere. Would love to eat here ","useful":0,"cool":0},"4R2avqCJBdrTdl0bCnjJIg":{"text":"I stumbled upon this place while looking for a brunch spot in N.O. This restaurant is actu","useful":1,"cool":0},"CEskEzi2fPptOZe7_jFEGQ":{"text":"Idk where to begin... ok I'll start with the 10 star service that we received from our SUP","useful":3,"cool":1},"-QxHFDFxWTAtKTymmOp-eA":{"text":"Nice cozy restaurant. Came here to try their $0.75 oysters during happy hour after enjoyin","useful":0,"cool":0},"3UY4SRbiU2jcn9qRr3aMtg":{"text":"While in NOLA we were in search of a restaurant that was more our speed with service and q","useful":2,"cool":1},"78KXS9yPg7YmDWBt_t-1DQ":{"text":"From reviews of other Yelpers I was really looking forward to dining here. That came to a ","useful":8,"cool":4},"Fsgb2DiKB1-DdFxIWzecLA":{"text":"Quick service and good food. Everything we ordered tasted fresh and good. From the stinky ","useful":0,"cool":0},"Sl0bwd8u1XQ_zTrrmJmZHg":{"text":"Brief intro, with menu recs further down!: my work moved offices, my boss' office is now r","useful":2,"cool":0},"Y9nCy0m8C3uO04KLii1iAg":{"text":"I was eager to visit this restaurant after seeing the 4.5 star ratings. However, both the ","useful":0,"cool":0},"QBvJ9UQpoiTZoMqBnU79NA":{"text":"I read the reviews and decided to try this spot for an upscale, quick lunch before going b","useful":4,"cool":1},"iN_aMyGBADQjwIz9vB2reg":{"text":"Great food!! The only negative review that I can give is that our waiter had our order con","useful":0,"cool":0},"g5DTtb3mX5poLQIyCmhX4w":{"text":"This place honestly has a tremendous happy hour to fit any bill.\n\nArrived around 5:15  and","useful":1,"cool":2},"dohOKOg7jkYZcHn7oOk94Q":{"text":"There are several photos of the crawfish pie on this site.  Order it!  You won't be sorry.","useful":2,"cool":0},"FtJcLe8R6FZRngkuWFrMZw":{"text":"Some of the best service by Ayana she went above and beyond during the service. Me and my ","useful":0,"cool":0},"zGEfZd8K9DJkHVJoIqKFaQ":{"text":"We had a party of 24 and requested reservations about two weeks out.  The restaurant oblig","useful":3,"cool":1},"8V-1CipKzIz_3qLWgIgYzA":{"text":"Well, I assume this might be a good place but just not for me. I made my reservation for m","useful":1,"cool":0},"-8lePYncNaSc0bzIvYE3NQ":{"text":"Wow this restaurant was phenomenal! Such a great experience eating at @trenasse a restaura","useful":3,"cool":1},"5KK8qVLznZsZr-xQtUI3fw":{"text":"***** Happy Hour Review******\n\nWow, what a great small plates menu and reasonable prices f","useful":0,"cool":2},"gRJ-DihYZAbLskj2-CZECQ":{"text":"Very underwhelmed. Mediocre food and poor service. Not what I had expected based on review","useful":0,"cool":0},"DATkFgSWdNr3YOfToyPzTg":{"text":"This was our first stop for food in New Orleans and they set the bar HIGH! \n\nService was a","useful":0,"cool":1},"C9IUp7GiPIYieGbxMO_q_g":{"text":"I stumbled upon Trenasse as I was searching for places to eat that I haven't been to befor","useful":0,"cool":1},"isHJxBnaj-_mtKfscFdlEg":{"text":"very nice restaurant in a central location, with live jazz music playing in the background","useful":0,"cool":1},"pp62qIOp2i8PljdDgwgAeg":{"text":"Who knew Cajun pork rinds served instead of bread as a starter could be so good?! The food","useful":1,"cool":1},"F-Tsht3bnhN9kqwTwRa2tw":{"text":"Leo made this visit outstanding!!  Eat at the raw bar in the back....AWESOME!!!!  Ask him ","useful":1,"cool":1},"zJVwJrbUFPdT1_pF-FGsEg":{"text":"Wow this place was incredible. Our large party ordered basically everything off the menu a","useful":3,"cool":1},"Q3FZBrs5JFMplbdVfsIThQ":{"text":"Best meal from start to finish. Our server was adorable. She steered us in right direction","useful":1,"cool":1},"DXnZXjYrcVZZDTEoOybEzQ":{"text":"Went there for a group lunch with the girls from work and had a great experience. Although","useful":1,"cool":1},"IPAR7BR1WRiK-BGGr1C-Tg":{"text":"Lazy service or who knows what. \nWe went in at 7:15 asking for a table for 2. The lady in ","useful":2,"cool":0},"a0_xC6HphYU8LZeF2pNvZw":{"text":"Came here for dinner and had an exquisite time! Our server Eric was outstanding, very atte","useful":0,"cool":1},"i9h0hh_lijA6QmOKbDPJlg":{"text":"Trenasse = taste\n\nAlthough I've heard of this spot a bunch of times, I never quite decided","useful":5,"cool":4},"4A_EBiQbjS7Tqps4VPoMGg":{"text":"Where to start? Wanted to go at 7 and was told no open tables until 7:45. Fine, starving b","useful":0,"cool":0},"dX7tk7deiltMtZRvK5DO6A":{"text":"Now, I've been here before for a brunch service several years ago for Mother's Day and it ","useful":1,"cool":0},"Ug63SIjjBpFUBo_F1Q-4Dw":{"text":"Had a quick​ business trip to NOLA for the weekend. I knew one thing I wanted when I​ visi","useful":0,"cool":0},"737B7TJSp09zbdJQYb7E-A":{"text":"Visited NOLA back in July...enjoyed the chargrilled oysters and one of the best cosmopolit","useful":0,"cool":0},"grsQZKyO4m0OHFV3pKIj-w":{"text":"The food was excellent. The crab trio was a great appetizer (small portion). We got the ch","useful":2,"cool":1},"G56XmOutt82x2biX6sW_5w":{"text":"Although I found no particular problem with the service, I found the food to be a bit blan","useful":0,"cool":0},"jzb4kn-0FqW-lkVHLqY9DQ":{"text":"Fabulous Happy Hour. And on a Sunday! Some of the freshest and cleanest oysters I've ever ","useful":2,"cool":0},"w1NJIP4ff4omkMgEdaCMUw":{"text":"Happy Hour is the way to go - fresh delicious oysters, flavorful BBQ shrimp and reasonably","useful":0,"cool":0},"eAiX9XaYIxCEZ-EERtp7fg":{"text":"Visited this place several months ago and it seemed like a good value.\n\nNo more, visited t","useful":0,"cool":0},"cHty20yzk3P0h2UZf9-hww":{"text":"I got an Irish CHANEL STOUT 4/5: Prob. one of my fav. because it reminded me of a Milk Sto","useful":4,"cool":5},"bpjcvqSYxjfrKHs-H5vDPg":{"text":"I threw caution to the wind and ate some Gulf OYSTERS.  Not my favorite kind, but hard to ","useful":4,"cool":1},"wjPBjidywlVcLhME_GBj6Q":{"text":"Didn't even order anything. The hostess and staff were not friendly at all. My husband had","useful":1,"cool":0},"X-BKdIZmYrHm7A8rLPyIsg":{"text":"Ordered takeout as I didn't have time for a sit down before my trip. As usual, Shrimp n Gr","useful":1,"cool":0},"gl6Fx802Hdz1dg715PdQig":{"text":"We came here for appetizers and enjoyed a blue crab bisque that was creamy and full of fla","useful":3,"cool":0},"sWnp_jOrAEdJ-ZPB88390g":{"text":"Came here for dinner with two friends and we ordered only appetizer​s and small dishes. \n\n","useful":3,"cool":1},"7PFDAKuU9soEOMS15bDHiA":{"text":"To say it is in the intercontinental it is nicely tucked away. Went for lunch on a Thursda","useful":3,"cool":1},"2jtUABbUky1csheYxR6E7w":{"text":"A small and elegant restaurant inside of the Intercontinental Hotel. The seating was intim","useful":2,"cool":1},"nGiWa018_bQlEgf54SVP8w":{"text":"4 stars for 2 great dishes! We came here for dinner with another couple and the food was g","useful":1,"cool":2},"1bxMpAIToD8Xd5FT38gcJQ":{"text":"we had a huge group yesterday night...we even got a private room w football on tv lol.  Se","useful":1,"cool":0},"fbmV3RYO3scmj1ytCPIQ1Q":{"text":"Food was delicious! Perfect modern lunch spot with a great bar as well. The choose 2 lunch","useful":0,"cool":1},"9wXuDkxy5IhHZd8khm5-eQ":{"text":"Although the service was a little slow the food still tasted pretty good. This was the 1st","useful":3,"cool":1},"OAWvYYazONXqpXGL8HZKKw":{"text":"This place was incredible in every possible way. First, we appreciated being able to make ","useful":3,"cool":2},"v8dxbrt1-Mn8R-p6rykIvw":{"text":"Ambiance: 3\nDrinks: 3\nFood: 4\nService: 5\n\nHost originally sat us in the lobby of the hotel","useful":3,"cool":1},"K2OWmr4TaLttIlIjt63cvQ":{"text":"Traipsed in unashamed after pigging out for dinner across the street. We heard about the c","useful":2,"cool":0},"_okAyrCEyU_oz40gD5gVUg":{"text":"Excellent Happy Hour\n\nCheap and Good Raw Oysters...Nice Beer Selection... \n\nthe happy hour","useful":0,"cool":1},"gVvELIEmBzDUB-qAF9bSWw":{"text":"Went there and was greeted by a very RUDE woman saying that Nothing was available without ","useful":0,"cool":0},"P7DHPtOJ5aVFGTnixODYPA":{"text":"Great food!\n\nEven though it is hard to find bad food in New Orleans, in our recent trip th","useful":4,"cool":2},"5nz8LHOGnhRh_1bnUYEYAg":{"text":"I came here because it was down the street from my hotel and because the photo of Stinky S","useful":0,"cool":0},"L7Piq7zTGcNtreRZQowKyQ":{"text":"I went here recently with a small group of friends. The address on Apple Maps took us to t","useful":8,"cool":0},"Nw8B2n0YokYlx9zTbkd6Ww":{"text":"This was a fabulous surprise at the Intercon!  It was honestly excellent New Orleans fare.","useful":2,"cool":0},"QrMVf0Svwo805a2nuzWebg":{"text":"Not a good experience!  First off we were seated on their patio in a very uncomfortable ch","useful":0,"cool":0},"TAcdN9Ljbipqipplu5W7QA":{"text":"We came here for a team lunch and it was amazing! They gave us our own room for our group ","useful":0,"cool":1},"jLAPhXEtUUlk-CCwUABPbA":{"text":"Imagine being exhausted after running a half marathon and just wanting to relax...then you","useful":2,"cool":0},"Em6jhiHDxs6NqtLGwqiGyA":{"text":"IN THE LOBBY OF INTERCONTINENTAL HOTEL. It took me walking around the entire building to f","useful":1,"cool":0},"-slfomWm91bgvCHKwKY_vw":{"text":"My husband and I visited over the holiday and had one of the best meals in New Orleans! Th","useful":0,"cool":0},"c4EkSCw2ayKMTOqcT4yzjw":{"text":"My alumni association had brunch here and I was pleased. The staff was very accommodating ","useful":1,"cool":1},"ijfeAhxJuoTgrS0dqMK4pA":{"text":"We came here last night with a few friends from out of town. It's beautifully decorated in","useful":13,"cool":10},"IgMw5c-Ne4i0GAbn9fSbtw":{"text":"I've dined here a handful of times and am usually pleased by the quality of the food and l","useful":4,"cool":2},"61MbRIe-b3iTTPiqG83VmQ":{"text":"Excellent service.  Our waiter Eric was engaging, knew the menu well and gave me a little ","useful":2,"cool":0},"Fm5cd3o-lN_GcAg-hRjZXw":{"text":"This was our first stop for food in New Orleans and they set the bar HIGH! \n\nService was a","useful":1,"cool":0},"thrahGkpfGMoLAt9ArE6Gw":{"text":"Decent for happy hour but better drinks, value and service can be had across the street. T","useful":0,"cool":0},"oQWff-AKgZaiFFSvRdECeQ":{"text":"We made reservation through their website and it was an easy process. When we first arrive","useful":1,"cool":0},"bYtjGC30fMC-6J6XLNsdWA":{"text":"I really can't say enough good things about the food here and service we received this eve","useful":1,"cool":0}}