{"qqiGQnNx2k8KlGdgX0Gs1Q":{"text":"Spot on service and not a long wait for pizza which was awesome. Pizza was great and was a","useful":0,"cool":0},"HVPTgVpuaOYIQxotPHr4fQ":{"text":"I love this place!! It is off the beaten path, and has a large delivery crowd in the CBD a","useful":0,"cool":0},"lHibTY2-Qzk9GDmJOmJS9A":{"text":"italian feast sandwich.  \n\nwe ordered for delivery and what a feast indeed.  the margarita","useful":1,"cool":0},"1YKTSTdkMtBOyGZRohBKKQ":{"text":"--------------ABANDON ALL HOPE YE WHO ENTER HERE------------------\n\nOnly fellow Italian Da","useful":11,"cool":1},"XTytQVMEjFhk1m_pYzW7Tw":{"text":"Came today for lunch with my wife and two sons. I had the shrimp bacon wrap - quite possib","useful":0,"cool":0},"OIfGflW2ZvX_iQ7AMZQoBw":{"text":"We ordered from here again today and I am sad to say the burgers were tasteless and they o","useful":1,"cool":0},"aehhQnKFvJYVeolXamye1g":{"text":"I ordered from this place a few days before fat Tuesday as soon as i got into New Orleans.","useful":0,"cool":0},"UCx-ejkoVeC24RF-ULpzmw":{"text":"It makes me sad to give such a horrible review because for months this was our go to place","useful":0,"cool":0},"6HgBAKf3PUzSNvH-XJZgMw":{"text":"I will never order from here again.  I ordered a vegetable pizza and a caesar salad which ","useful":1,"cool":0},"V1Rk8sAiYj1xpiAsPpOqng":{"text":"Perhaps I should have had the pizza and my review would be different. However, i ordered t","useful":0,"cool":0},"7PMgpbRHLlgRr6VT9WcEjQ":{"text":"If you've ever had a Michelina's frozen fettuccine alfredo meal before, then you've pretty","useful":0,"cool":0},"xp56ELaYnqwhwttF4Tqq8A":{"text":"The pizza here is probably one of best in town and so is pretty much everything else! I us","useful":2,"cool":2},"2dQPc37AeP-cIjR7RyyPXg":{"text":"Watch out at this place! They mixed up our order and there was only 3 of us.....plus they ","useful":0,"cool":1},"bgDzd2MIrOmGGTbPaoOnxA":{"text":"I work literally across the street from Angeletto's and never heard of it until about 20 m","useful":3,"cool":0},"9K2p0z__1RTxfg8uhz0U4A":{"text":"Amazing place. Great food and great prices. They stayed open just to make me a pizza when ","useful":1,"cool":1},"t749-3jKKDyO8QH3VezUHA":{"text":"I work nearby and decided to give this a shot based on the recommendation of Julia S.  I w","useful":3,"cool":0}}