{"8d8DL8EdWLtam1Qu1rQpNw":{"text":"Delicious breakfast food, but in theme with the gentrification of the area, the food and p","useful":0,"cool":1},"iblWQxw00qLpToENe22Yng":{"text":"Yum! I love the breakfast sandwiches and frequent their location on Jeff Davis. I'm happy ","useful":2,"cool":2},"ZjFLlc1xajPz6lYXKqs_Yg":{"text":"I came here Friday to pick up just regular chocolate chip cookies.  $1.50/ea.  They were h","useful":4,"cool":2},"qOPg8KX15vnwabdYEXWe3A":{"text":"Gracious Bakery and Cafe was a fine place on St. Charles. My girlfriend had a croissant an","useful":0,"cool":0},"SZnp4e1FR_KPHZwjhGvcfg":{"text":"Gracious offers delicious pastries, light breakfast and lunch options all in an ambient an","useful":0,"cool":0},"MzpsKoU8AEJWZut-A1pWGw":{"text":"Great great place. It's spacious and quiet enough to work for hours with plenty of outlets","useful":0,"cool":0},"kgPfDLyvmCy6452j9P0rNA":{"text":"I love the Gracious Bakery chain.  I frequented the location on St. Charles, but the one o","useful":3,"cool":0},"I9g1IcO8yyYGaH3Q-vIsuw":{"text":"One of my newest work/dining venues! Gracious is spacious, clean, and has an outdoor patio","useful":1,"cool":0},"RsgGsLnkVxX1bkvB8KloSQ":{"text":"Love this bakery! Great place to do work. Excellent coffee and the salads are delicious! S","useful":0,"cool":0},"JUdCnxO2WZwLFszsIl8FbA":{"text":"If you're looking for fast and consistency -- come here. Everything is freshly baked, and ","useful":0,"cool":0},"Gl1dcrbi61wilF01NMOl2A":{"text":"Space: large, open, clean. \n\nStaff: polite, friendly, nice. \n\nDrinks: house made chai and ","useful":4,"cool":3},"gr0Qw3ozC2c6WUnZqB4x1g":{"text":"It's a fairly new place, large and bright. The prices are kind of high. \nI had a almond cr","useful":2,"cool":1},"56Si1DQ24MfdQk3jZgtxJg":{"text":"Had heard people talking about this place so I stopped this morning for breakfast.  Not ov","useful":3,"cool":0},"cIa6LSV5H2HeCtKUzQeqbg":{"text":"Had a doughnut and it was pretty bad. Coffee was OK. The next day had some of their fancie","useful":0,"cool":1},"EI_K1gBzMbvQmZQjH5_iew":{"text":"Some of the sandwiches are pretty good but it's disappointing the side \"salad\" served with","useful":0,"cool":1},"X2kJXlRYeGo9fuMeQOAFnw":{"text":"I love visiting Gracious- their breakfast pastries and coffee are great! I've never had an","useful":0,"cool":0},"bD9DtNSZ8yd4rSbtag4Yig":{"text":"Plain donut tasted artificially sweet/vanilla-y. It blows my mind how a bakery can mess up","useful":0,"cool":1},"QsHa0k2_EzhP1iEfaIamfw":{"text":"Not sure if we ordered the wrong thing or if it was an off day but baked goods were not as","useful":0,"cool":0},"oKj9QwRoDneXRfy9Qs4DiQ":{"text":"This was my first time stopping in at their uptown location. A few weeks ago, someone smas","useful":0,"cool":0},"Y4L4QplWtDEQNYKoBvT6uQ":{"text":"Im Done !\n\nI would regularly get coffee at Gracious Bakery every morning and in the aftern","useful":4,"cool":2},"OpKSW5zDt3s5clREntyvPQ":{"text":"Love this little casual breakfast and lunch spot. \n\nPerfect spot to grab breakfast on the ","useful":4,"cool":1},"8A-rgU2svAF5h9_OM7rRGA":{"text":"Pandemic update\nQuick update! They have limited their indoor seating with about half the t","useful":4,"cool":1},"slxf6eNq6G-iDX33izamxg":{"text":"One of my newest work/dining venues! Gracious is spacious, clean, and has an outdoor patio","useful":3,"cool":1},"TQFwoN3XggbgIzUWK3P8KQ":{"text":"I had a lovely experience here. The person working was patient as I perused the pastries a","useful":1,"cool":0},"M-_NHOu8uvWvJwTBq7ESKg":{"text":"Overdue review! \nI've been to this location a few times since it opened. And I think it's ","useful":4,"cool":2},"A6XvEGcIlbA-sNt6GU015Q":{"text":"Had breakfast at the Prytania location.  I ordered an egg on the side with a croissant.  G","useful":0,"cool":0},"LEEMJiAWvhIeUKvRS00vPg":{"text":"Subpar donut. Ambience isn't cute. They need to add like greenery, art or better furniture","useful":0,"cool":0},"md5rs8I0wm9UP5tmHiSTHA":{"text":"This is one of my favorite places to go for a quick breakfast. My favorites are their dani","useful":0,"cool":1},"9t4H80Uy06TnsknByaNk1w":{"text":"This place is extremely hostile and full of rather challenged people. They refuse service ","useful":0,"cool":0},"u6Pel2KYT5vGcL88GV-HZA":{"text":"I had a terrible experience, and will never patronize this bakery again. I traveled to New","useful":2,"cool":0}}