{"gWU2Yko2aFH00jcFVYsquA":{"text":"3 separate reviews:\n\nCITY TOUR: 1 STAR -Not worth the time or money. We never got a confir","useful":1,"cool":0},"4IhEOrZs2PhklF4lSPm5Kw":{"text":"Butch did a great job. The tour was relaxing, informative but 2 good stops to eat and see ","useful":0,"cool":0},"F8zq9MblFNC_J_SCH426XQ":{"text":"Really great experience overall.  I imagine the experience varies based on your captain/to","useful":0,"cool":0},"wxh5SzQp-c8vspS7kAB_cA":{"text":"I thought this tour was phenomenal!!! We had originally booked our swamp tour with Dr. som","useful":2,"cool":0},"S-Da9QT7AaWLjOefE2m5Cw":{"text":"It was amazing! We went as a big group and they were able to handle us well. All of the ca","useful":0,"cool":0},"bFR01CN60HVGW9Sgos8FoQ":{"text":"There was too much driving and not enough touring.  We walked 15 min each in the cemetary ","useful":0,"cool":0},"G_xR_MNbagY_isL2PW_U9A":{"text":"This is the tour to take when visiting New Orleans!  Great experience and an even greater ","useful":0,"cool":0},"LXkBK_Lo56kvb0wvzRcjAQ":{"text":"Cajun Encounters ... matching tourists with gators since 19somethingsomething\n\nThey have a","useful":3,"cool":1},"gQW5as1hxlf_Zlmr7mDoaQ":{"text":"Last week, my husband and I went on the swap tour (it was about 2 hours in length). Our ca","useful":2,"cool":1},"ux1QmbeuloWgs2_rWWyb7Q":{"text":"Captain Dan was an excellent guide.    He seemed knowledgeable and committed to maintainin","useful":0,"cool":0},"_n4B0C4bjGahdE9e8Ve6Cw":{"text":"Awesome time with my first time to NOLA. Captain Jules did a hell of a job showing all of ","useful":0,"cool":0},"fG9u9tqKhnI5oMcHq5dRgw":{"text":"What a great way to spend the afternoon!   We (5 girls celebrating our 30th birthdays) agr","useful":3,"cool":1},"MYtnXKlzqsreTl5QlM9N1g":{"text":"This is a great way to spend some time in New Orleans.  The swamp we went to was really be","useful":0,"cool":0},"6bzX4sqry3h5w2NkTsye_g":{"text":"The Cajun Encounter Swamp Tour is a must!  My family took two swamp tours just to compare ","useful":0,"cool":0},"GTzr4_qB6ZCPfrSsj27v8g":{"text":"I would highly recommend this tour for anyone who is visiting the New Orleans area. It was","useful":0,"cool":0},"GCnAb3hvAaGHY2XjuXnBMw":{"text":"My boyfriend and I had been looking forward to our Swamp tour for weeks before arriving in","useful":0,"cool":0},"nQpprNMOVTkZYGXhmPRqHA":{"text":"Had a wonderful time! Our guide was hilarious! Made the tour that much more pleasant. Just","useful":1,"cool":0},"p19UzscUbIWFIkKuzodbgw":{"text":"This tour was great! Captain Ian was knowledgeable and funny. He answered all of our quest","useful":0,"cool":0},"yeCZCjP8nNliAweuXl6Lvg":{"text":"This review is for the Laura/OakAlley plantation tour. The tours were great but the compan","useful":9,"cool":0},"qHvsKQWEB5KkaxWtOPwhvg":{"text":"We had a nice city tour with rene.  Good to do in the rain.  Had a stop at the cemetary #3","useful":2,"cool":1},"jyLWj5m5DUcOJ5CTREi66A":{"text":"We took a trip to New Orleans for spring break/my son's 11th birthday.  One of our excursi","useful":2,"cool":0},"5zc5GnFl7xRY5BRaJiwR1Q":{"text":"First and foremost you'll need to do two things. You need to book a tour with these people","useful":0,"cool":0},"z8lHYmmqpPsPBdGfjj3dZw":{"text":"Very cool tour.  Should be the first thing you do in New Orleans.  Butch our tour guide wa","useful":0,"cool":0},"Zr4HnRlTgXhhAkFEBYrLtg":{"text":"We had booked a late afternoon swamp tour with hotel pick-up. Called the day before to con","useful":0,"cool":0},"PzSRrRBV6f6-u6B31Gd0KQ":{"text":"Not really worth the price or your time. Took the combined Laura/Oak Alley plantation tour","useful":0,"cool":0},"muogERZKkQ8PGBiBHQbj5A":{"text":"Great swamp tour!!!  Took the smaller \"private\" tour. Way worth it.  We were able to get i","useful":0,"cool":0},"86TfCVkD9vX-VlFfpVPpRA":{"text":"We had a fantastic time on our swamp tour with Captain Wade. Everything went very smoothly","useful":1,"cool":1},"qvKF7OI8XcpAs-TBLLQ0kQ":{"text":"Unfortunatelly we did not have the best experience, captain was nice though, very very nic","useful":0,"cool":0},"bQva53W7wliDW_sb9vvxVQ":{"text":"Great swamp tour...I would recommend driving there and save a few bucks if you have a vehi","useful":1,"cool":0},"4VNzEpFw1oF61cp7NRS38A":{"text":"Thoroughly enjoyed our swamp tour with Cajun Encounters. Unfortunately, going later in the","useful":0,"cool":0},"f1FavBxH9a4QvCcuSfRYEQ":{"text":"I really wasn't sure what to expect, but I was absolutely wowed by this experience. Bishop","useful":0,"cool":0},"6BqGnXI9LEtzzpIMZG8G1Q":{"text":"The tour was great. The only thing I didn't like was being subjected to the tour guide's e","useful":1,"cool":1},"a1Bpe3rWlXZQjy5dEkUvfg":{"text":"The actual tour was pretty interesting, and I enjoyed the swamp tour. GETTING there, howev","useful":0,"cool":0},"nG2P_vcNNf8sD-nXAXn9cw":{"text":"We had a great time. Although most people were interested in gators we were most intereste","useful":0,"cool":0},"_kHN8ZERSs2ZAxgedPIopQ":{"text":"I had a blast! Although I didn't see any gators... since it was winter. We did see a bunch","useful":0,"cool":0},"cTUD8VXFVXTX0oOkqkXnAA":{"text":"We took a swamp tour with them about 4 years ago and then went back again this trip with f","useful":1,"cool":0},"abXiu0BtPjdASwREbsW_pA":{"text":"What a great time our party of 7 (4 adults, 3 kids) had! Cap'n Mike was not only knowledge","useful":1,"cool":0},"Kckasz2FIhuIwGCe66-APA":{"text":"Great tour of the swamp. Friendly and informative guides. Length of tour was just right. A","useful":0,"cool":0},"re4tg8OmSdJvSoBtrMVDHg":{"text":"Definitely recommended tour. Didn't think the swamp would be a beautiful place, but it was","useful":0,"cool":0},"5doxWy2RmV5ho7J-8nBXkw":{"text":"Great way to spend some time doing touristy things in New Orleans. From pick up to drop of","useful":0,"cool":0},"Y0DBCwVtPZv4wfEw9r1lYw":{"text":"We booked a tour of both Oak Valley Plantation and Laura Plantation. While I was happy tha","useful":1,"cool":0},"dM_D4u3wBlJouzIlXRXk4Q":{"text":"I didn't realize hotel pick up was in a particular area of the city, so we took the city b","useful":0,"cool":1},"7-RONj-X-fFq5FAppFmGNg":{"text":"I booked a combo plantation/swamp tour for our bachelorette party of 5, and we all had an ","useful":8,"cool":1},"iGYjHI5607c8KWYOcKIibw":{"text":"LOVED IT!!!!!\n\nFrom the reviews below, your first huge tip? Drive out to the location - th","useful":0,"cool":0},"rLejW9hlIo1hNAnetZRmyg":{"text":"Captain Jason was very knowledgeable. He actually lives in that area! What can be better t","useful":0,"cool":0},"fcD3-bPXQGl9WFW3myNrNA":{"text":"The worst tour I have ever taken. Our guide,Noah, spent an hour after picked me up, drivin","useful":2,"cool":0},"Yg4VC_q-HapoL892d_hzDQ":{"text":"Great swamp tour the bus driver and boat were both knowledgable with great stories and inf","useful":0,"cool":0},"wm6LzSVQf3otLHmYz_z-nQ":{"text":"Bought online voucher for City and Cemetery tour and seemed like a great deal. Was excited","useful":0,"cool":0},"w6BULfPo9ujPDCmGwQMZWw":{"text":"My girlfriend and I were staying in NOLA for a weekend and were wanting to do some fun act","useful":0,"cool":1},"T5q7tsfOrLKDRJqwUcgbzA":{"text":"The ghost tour was average. I won't recommend spending $40.00. It started late and was jus","useful":0,"cool":0},"GqR1IruN35lsDL4dYAMQCw":{"text":"These people are a first class operation. Even the restrooms are spotlessly clean & air co","useful":0,"cool":0},"Qr4ZQLmrXrJCPwe1PiXzJQ":{"text":"I booked this for my group of 13 bachelor party. The bus picked us up from our hotel and w","useful":0,"cool":0},"0GMPOmC65w3IsJ6FWRGvCQ":{"text":"Lots of fun and definitely worth the time/money. Our guide was very knowledgable and had a","useful":0,"cool":0},"LMSzoTgKXH0z3w2upP4dpg":{"text":"From the review I really expected more.....\n\nDid the Swamp tour with 2 friends. While book","useful":3,"cool":0},"_Vl2By9TQhMhj3zabXJXSg":{"text":"My boyfriend and I went on both the city tour and a swamp tour. In both cases the guides w","useful":1,"cool":0},"TKzg5rhp1lujltXAjLtVuA":{"text":"We knew we had to go on a swamp tour while visiting NOLA, and this is one of the few who d","useful":0,"cool":0},"1mkbW4_G_hNnv3FGwLI2TA":{"text":"The swamp tour was excellent!  We saw dozens of alligators, racoons and swamp birds.  Our ","useful":0,"cool":0},"QYVBNWt0pjWLj0u3tO15iQ":{"text":"Looking for things to do & see while in N'awlins? Well, stop by Cajun Encounters and let M","useful":1,"cool":0},"eA2ypwzpZuQeecwlZKhklQ":{"text":"I really enjoyed my tour Swamp Tour with Cajun Encounters, in fact this was the highlight ","useful":1,"cool":1},"-PcjFqdcuOVbbBX5u1w5uA":{"text":"We went on a plantation tour.  Our bus driver didn't explain or share anything on our way ","useful":0,"cool":0},"VaPhUW2zgljtdqSvh5A6SA":{"text":"Went to New Orleans with friends to celebrate Southern Decadence.  We arrived in New Orlea","useful":6,"cool":1},"pXYB4sEtndAfy2nHN_6KQA":{"text":"We used Cajun Encounters for our New Orleans city tour and swamp tour. Butch, our city tou","useful":0,"cool":0},"Lz2i2OUkTG0wlL-qr72dVQ":{"text":"They messed up our family's reservation. It's an hour drive one way from French Quarter. L","useful":0,"cool":0},"GphmUdlzYVg53zAhgCdzrw":{"text":"We went on the swamp tour and had the company drive us out. Jewels (sp?) was hilarious and","useful":0,"cool":0},"4ApYgWTSNbtnvgs99LKyZw":{"text":"Wasn't my first choice of activities but hey, I'll go.  And so glad I did.  Loved our capt","useful":3,"cool":0},"Bh4-HF33nOaS9bdNa0jOBQ":{"text":"Butch did an excellent job describing the city I was born in! I learned so much! Thanks!","useful":0,"cool":0},"nQKNqY6Db1_9v_v-JJUW5w":{"text":"Great tour. Captain Bishop was very informative, funny, and entertaining. We got to see a ","useful":0,"cool":0},"Z9nJpDtZvt1ySfoMFFIFGw":{"text":"We did the New Orleans ghost tour. The biggest waste of money, time and energy I think I'v","useful":0,"cool":0},"V_cSiFRLPXxlsY7m74GstA":{"text":"SO MUCH FUN!!! \nIf you've never been on a swamp tour it's a must!! We had so much fun. I w","useful":3,"cool":3},"TEoDoVEwPx16t0i8U93pUw":{"text":"Awesome tour for an awesome price. Our captain took us up and down the river and we got to","useful":0,"cool":0},"mSoISl5MRzEIN1XaMcUHNw":{"text":"We booked the plantation tours (Oak Alley and Laura). Scheduled hotel pickup time was at 8","useful":1,"cool":0},"pCUmQtHbCF-SHMKT7RjzeA":{"text":"Maybe it was because we did a swamp tour in February so my review may be skewed. But we di","useful":1,"cool":0},"_OYrxpLu2_PanJRvHzRk_Q":{"text":"I've only taken the swamp tour but I didn't enjoy it\nThe salesman on canal pushed us to bu","useful":0,"cool":0},"r25hs59_MziV9HXqMxUs-Q":{"text":"We took the earliest tour at 7:30am which is self-drive, and it was pretty much our favori","useful":1,"cool":0},"StbF5GjYEnMhpdYI4wPwKA":{"text":"Taken several swamp tours in Everglades and other places and this was the best. Well organ","useful":0,"cool":0},"Ksp75EzSfxXG5BGbzwGs1w":{"text":"Fun swamp tour!\n\n\nI went on the swamp tour with transportation that picked me up at my hot","useful":1,"cool":0},"18q61ag5-a21P8OuoMsyFQ":{"text":"The swamp tour was awesome!! I was not expecting to see SO MANY GATORS and other wild life","useful":0,"cool":0},"V_iidfpa1aIhhR_PlxcDDg":{"text":"Best part of the dirty dirty for me is the wildlife and the food. The swamps are surprisin","useful":0,"cool":0},"it-b-h9fmGYxfudW6C0lxA":{"text":"We had an amazing time on this trip and saw more critters than we thought we would. Gary w","useful":0,"cool":1},"aILJhxRIsXoIRhO-hLUnLQ":{"text":"Can't say if the tour is good or not as the pickup scheduling was incorrect and our driver","useful":2,"cool":0},"1IXRGMHIx8Y2RLAq9zcNUw":{"text":"Took the swamp tour with captain Greg. Had a good time and was worth it.  Saw turtles, all","useful":1,"cool":0},"SWNPi5VMjOdOOPUClNMxhw":{"text":"Tour guide Bishop was great! He was informative, funny, and made sure to show us all the w","useful":0,"cool":0},"FpOvyorPL8TFNITvb4HyLg":{"text":"You know when you see poorly photoshopped brochures or ads for a company and then have som","useful":1,"cool":2},"URTRYWZLnFnhZVqGmNg7yQ":{"text":"THIS IS THW SWAMP TOUR YOU HAVE TO TAKE! The staff here really make your tour worth while.","useful":0,"cool":0},"W2rWD5ooywpAvt6cJrHrxA":{"text":"Great tours - took the swamp tour and the plantation tour through them.  I will say they l","useful":1,"cool":0},"kotVcC5hqUKjAf_v_Cv78Q":{"text":"There was certainly  no shortage of things to see on this tour . . .sadly none of them wer","useful":2,"cool":3},"31i5OIO54s1yIz47zrbUNg":{"text":"Cajun Encounters is the real deal. Had a great 2 hour tour that flew by. Our Guide Nathan ","useful":0,"cool":0},"47RYKXRA7rZXILhWqtiVdg":{"text":"Excellent tour guide; his stories were great. He really appreciates all that the swamp is.","useful":1,"cool":0},"K6smkLE_zNQRgl0U__oKgw":{"text":"Emmitt was hilarious and I had a lot of fun on this tour! Thank you again! Would highly re","useful":0,"cool":0},"bd5KIRV-t4zIDEhiqu-q8w":{"text":"We did the city and cemetery tour with Mitch.  It was great. I've been to NOLA several tim","useful":1,"cool":1},"VY7EDeqgxRbnd4usBuMQVg":{"text":"Four of us went on the day swamp tour and really enjoyed it. We took a bus to and from our","useful":2,"cool":0},"VqKWaoN50Q53eHXf5iFNhQ":{"text":"Hicimos el tour a \"Honey Island Swamp\" y aunque era invierno y los cocodrilos que vimos no","useful":0,"cool":0},"tsRIRqGU5rd2RR_Lx_iVwQ":{"text":"We booked our morning swamp tour online, pretty easy to do. Upon arrival, we parked in the","useful":3,"cool":3},"KElE0vG40amuPNFF5fHBmw":{"text":"Well orchestrated tour; the bus was luxurious and cool which is always welcome in NOLA and","useful":0,"cool":0},"kyDM7k-XjsuzCvQjnAkOqw":{"text":"Not worth it.  Extremely expensive,  tour guide was a jerk.  Didn't see much.  Very very d","useful":0,"cool":0},"JWNlJIvJ0BWJtC29CQaFxQ":{"text":"This tour was a ton of fun. Captain extremely knowledgable and very funny. The only reason","useful":3,"cool":0},"0oIfqWMIM6W6QcClbqkU8A":{"text":"I was on a girls weekend in Nee Orleans and we decided to do the swamp tour unsure of what","useful":0,"cool":0},"pITmqObt_TVSlHjwFeSI7g":{"text":"You gotta go on a swamp tour if you are visiting New Orleans.   The swamp tour was one of ","useful":2,"cool":2},"h2GFkN363x4AG3XIxsPgyg":{"text":"I wanted to share my dismay with cajun encounters.  I live uptown NOLA and rent out my spa","useful":0,"cool":0},"U-IBmYFxaQGdwhzpldE2qA":{"text":"The Cajun Encounters Swamp Tour was well worth it!! Make sure you can spare about 5 hours ","useful":10,"cool":5},"dZN0qa_DZA5DzKh4KdBz6g":{"text":"My boyfriend and I went on the honey island swamp tour this morning. We wanted to keep our","useful":0,"cool":0},"wQwQB15501bjVsJjTIEj8A":{"text":"Beware on rainy days! We were in a group and it was POURING rain. They loaded us up and to","useful":1,"cool":0},"ZdLhuBgQ4j5iYO-pPhnosg":{"text":"Had an awesome time with Eric our tour guide!! Definitely something I recommend doing if y","useful":0,"cool":0},"ibCkHRvXi834x6tOPZSPxg":{"text":"The swamp tour was a fun way to learn more about New Orleans and some of its native critte","useful":0,"cool":0},"OxcsIY_bEXq4rYPUGZ41MQ":{"text":"The swamp tour was one of my favorite parts of my trip to New Orleans! The swamp was beaut","useful":0,"cool":0},"hgFtFNBGRnlcvl0WLseDlQ":{"text":"Even though it was pouring down rain we had a blast on this tour!!!! Bishop was our tour g","useful":0,"cool":0},"iSVXGftaJrwhC5YrxzZXeA":{"text":"Great tour. After all that walking around the French Quarter it was great to sit back and ","useful":0,"cool":0},"KA7VY7HBqXA8ykPAE80THA":{"text":"We recently took the City and Cemetary tour with Donna. We enjoyed the tour and Donna so m","useful":1,"cool":0},"mlT4uSJ-MME5BM7Pl7Y4-g":{"text":"My boyfriend and I did the Plantation tour with Cajun Encounters. We did the tour that tak","useful":0,"cool":0},"AmHFiuqos3S75-e8wiqDAg":{"text":"If you want the real deal experience book this tour! Captain Greg was king of the one line","useful":0,"cool":0},"bR3T4V4zXHcuJtS3rfqy9Q":{"text":"Capt. Ryan was awesome and I would highly recommend him and a Cajun Encounters swamp tour!","useful":1,"cool":1},"k0LW1h0dDULXCX4HHtc2Uw":{"text":"Very professional, and on-time, the swamp tour itself way amazing. Only drawback is you ge","useful":0,"cool":0},"kgqvPo7EoBPBXXyctGjj2g":{"text":"Let me just say, I HIGHLY recommend the Cajun Encounters swamp tour as a tourist MUST DO. ","useful":0,"cool":0},"J0-pducwt0vHMMAu-vDD8g":{"text":"Second time doing this tour.  Took some friends who'd recently moved to New Orleans with t","useful":0,"cool":0},"Mp6fpeNN61IJBnP0exFU_g":{"text":"Unfortunately, I didn't feel like this tour was worth the $49 at all. This did include a h","useful":1,"cool":0},"JcURw3S0v8xdwWdNOaxBHQ":{"text":"Loved the swamp tour! We saw a ton of alligators, pigs, raccoons, and huge dragonflys. Cap","useful":0,"cool":0},"wnBXFDQGQim9cAJq0wBA0w":{"text":"We took a plantation tour, going to Oak Alley and Laura. \n\nThis was a great tour, marred b","useful":2,"cool":0},"qBNBqZUv2eTKz0R8sOTY4g":{"text":"We did the swamp tour and had a nice time.  Our tour guide Gary had a great personality an","useful":0,"cool":0},"QJO7yerHK3165o_6NzOj3g":{"text":"We did the Small Boat Swamp Tour. \nGot picked up directly from our hotel near Bourbon St a","useful":2,"cool":0},"eVmTFifN5JfzDBM5EZTh_w":{"text":"Had a great time with Bishop, our tour guide!  Funny and entertaining.  \nThe tour was easy","useful":1,"cool":0},"0pfdeWJ4iQk_rNhCBImrRA":{"text":"Rene on bus 46 was our guide. Very happy gent and obvious he loves people and the city of ","useful":0,"cool":0},"7l6gMWi16c9nY2EJ5Z0Rxw":{"text":"We just finished this tour with Rene as our guide, he was wonderful!!! What a great, infor","useful":0,"cool":0},"utfUYbsdTRN794HSeyHrfw":{"text":"I had really bad encounter with one of your drivers/tour guide.  I did not get her name bu","useful":4,"cool":0},"8IgxXjlxDYMKgc4u4x5RSw":{"text":"This is my second time using Cajun encounters for their swamp tour. Once in 2013 and now i","useful":0,"cool":0},"_QdNYk1A3FLQygknu84wCw":{"text":"Woke up early to get to the tour and showed up to the address listed on YOUR DAMN PAGE, wh","useful":0,"cool":0},"Vldhqc_2Z07_VjkCOV4NEw":{"text":"It was a good experience. We were looking for something to do in New Orleans on short noti","useful":7,"cool":3},"I8djFXO0KN6rCCT3CBTg2w":{"text":"Went on the Swamp tour it was amazing! Our captain Troy was great he knew so much about th","useful":0,"cool":0},"Ea2oha2RC-ZPIMw_PwmmXw":{"text":"My husband and I took the city, cemetery and swamp tour. We had so much fun learning about","useful":0,"cool":0},"rDcyhz3t4H97y23mLxUxhQ":{"text":"Tour guide was excellent, john was his name, and informative.  He was a very funny guy and","useful":0,"cool":0},"OdXHj1OWFWnvr9UVdLN3wg":{"text":"Had a great tour with captain Jacob! Saw lots of alligators, a mama boar with babies, a gi","useful":0,"cool":0},"Cc_WhW0CncFXSB6tsruj2Q":{"text":"We did the city bus tour that included the French Quarter, the Ninth Ward, the Garden Dist","useful":0,"cool":0},"8NaoUM478fBG9sdCilaoNg":{"text":"We had a great time on this tour. Captain Jacob was knowledgeable, professional, and a won","useful":0,"cool":0},"KJlUwoKaMDccOmdeZrNCag":{"text":"Cajun Encounters has excellent customer service. The staff responded to my emails within a","useful":3,"cool":0},"hM685yzu9c2JgcUaHCQwKg":{"text":"This was AWESOME!!! I brought 2 friends with me that were coming along to appease me... Th","useful":0,"cool":0},"JGyXsrOU73S7zxSpPjV4rA":{"text":"Going on a swamp tour when in New Orleans is an absolute must. But you gotta do it with th","useful":0,"cool":0},"X-jhTcZwWyOPUoq349TaRg":{"text":"Great, organized tours! We did a whole day thing, with Plantation Tours in the morning and","useful":3,"cool":1},"hqo7OuWPkqtuKPG4cvciog":{"text":"We did the swamp tour. It was awesome. Very informative on the ecosystem of the swamp and ","useful":0,"cool":0},"FRwaEf4WtGIDzNY6WnY0qQ":{"text":"Booked a honey island swamp tour through this company during our stay in New Orleans. From","useful":4,"cool":0},"zVtHt1YB1K24TWDeW1d6Pw":{"text":"My family and I took the swamp tour and the New Orleans city tour and loved both of them!!","useful":0,"cool":0},"FR3CcZmJOztYUk-IDcN-Dg":{"text":"This was one of our favorite excursions in New Orleans. I scheduled the Bayou tour through","useful":0,"cool":0},"TU5RMjL1qsKN7gD1k-lUwA":{"text":"Captain Ryan was great!  Good tour and family friendly. Fun easy day, they take good care ","useful":0,"cool":0},"v9tKHiqI16RAccWqyiiuWw":{"text":"A VP from Cajun Encounters followed up with us after our unhappy experience yesterday and ","useful":0,"cool":0},"Br4EHUh-lK7AM5ZzjtTSdw":{"text":"What an awesome experience! We had Captain Sonny and he knew so much about the swamp and m","useful":1,"cool":0},"DdqHkssPS7ZAsDoaZLkAQQ":{"text":"Our tour guide was Brian and we were on the smaller boat that fits 12. Our guide was knowl","useful":0,"cool":0},"UmjwhitKoEfcA4nPpXp6pw":{"text":"Horrible customer service ruined an otherwise great day. We came here with a bachelor part","useful":0,"cool":0},"Ih0EpaMGuNbdQJ-ewGbV9w":{"text":"Took the night swamp tour.  The bugs were out of control and of all the goofy trinkets the","useful":3,"cool":1},"7wclOvoFQMBome_OSab95g":{"text":"We had an amazing time on this tour. Our guide captain Ron was so knowledgeable and friend","useful":0,"cool":0},"7yzijpTr7-A9ZEC0zsHVxw":{"text":"Swamp tour was good, guide was very knowledgable, was able to see a few gators up close ev","useful":0,"cool":0},"0luyzb9hEBBxx3wkQOxEuA":{"text":"As a first-time visitor to NOLA, a tour or two is a must. Cajun encounters seemed like a g","useful":0,"cool":0},"Y2nmjcM-QLgUh5gh0G3-_A":{"text":"We had a great time on the tour with Captain Emiett. (Apologize if I spelled his name wron","useful":0,"cool":0},"L-vWZLfN2oVs6W_RdQKi2g":{"text":"I have been on two other swamp tours and I was not disappointed. Capt. Ryan made the trip!","useful":0,"cool":0},"MEs10szdCgyeIu9uvtyy7A":{"text":"We visited New Orleans for a 3 day weekend and this was the highlight of our trip, especia","useful":4,"cool":5},"Rvgl0j0OI78wYUHwfDGf9g":{"text":"My mom and I had a great time on our swamp tour!! The location was easy to find and had to","useful":3,"cool":1},"e3D9-dLmhXiHRBe683ZE_g":{"text":"Our b and b innkeeper booked us for a plantation tour, and I don't really know who's to bl","useful":0,"cool":0},"fTYZZD3IaArIrfgDqNCF8A":{"text":"This was a thorough meh.  While it was fun to get up close to some gators and be in the sw","useful":0,"cool":0},"D2CG9B0xkdDZhN34YAikWQ":{"text":"Was well worth the time and money. Our tour guide, Butch, was great. Very knowledgeable an","useful":0,"cool":0},"UzrDKEUACoaksMUL8ecSWQ":{"text":"We just went on a swamp tour with bishop of Cajun Encounters. We saw plenty of blue herons","useful":0,"cool":0},"nzK1zHdEFcKS8_N2n70ofw":{"text":"Wednesday we took the city tour with Karen. I have lived here most of my life and thorough","useful":0,"cool":0},"T7kaAYBsQ_1YJ9va91pZDg":{"text":"We took the Honey Island Swamp Tour in February.  In February, much of the swamp is in win","useful":0,"cool":0},"FwK6CTogjyZdXqbyOPwqVw":{"text":"Had a great time today with Capt Jody. Saw feral pigs, great heron, lots of gators, and tu","useful":1,"cool":0},"D5i7Qzw9f0n7qe0q-RBdnQ":{"text":"Let me just say, you need to take a swamp tour and CAJUN ENCOUNTERS are the people to see.","useful":0,"cool":0},"FgDRanuYxyxdALHBtEeZLA":{"text":"The actual swamp tour is a 5/5, but the organization, shuttle out there and overall commun","useful":2,"cool":1},"5d-DKBFu1-wF8hUKhvRFDA":{"text":"We bought the city tour through concierge at our hotel who states be at the corner by 1:35","useful":0,"cool":0},"-RUO6rln0_IAIqnp_1DU-A":{"text":"The Swamp tour was great!  Picked us up outside our hotel. Our driver, Edward, pointed out","useful":0,"cool":0},"PB2T_wtvPp-B8XKh93Ewrw":{"text":"This review will be more like a journal,lol. Today our first tour is the city & cemetery..","useful":2,"cool":0},"aKpjnxPOcXikbNszBj2OPg":{"text":"Absolutely amazing tour. Driver picked me up at a local hotel in French Quarter. The drive","useful":0,"cool":0},"YEACnH1RvlXA-Srs1rFW4g":{"text":"Tour guide Chris was amazing ! He was full of information and knew how to call the animals","useful":0,"cool":0},"gsFBjJg5vZ1gHhl3H3OxKw":{"text":"Wow, I know it might be a touristy thing to do -go on a swamp tour. But it's def another m","useful":0,"cool":0},"foqWUrgxDjCJuoZG7yIYqg":{"text":"Had a real good time on the swamp tour today.  Didn't see any gators (cept for the small o","useful":0,"cool":0},"UTP7kdz2vZG-RBFtynDJKw":{"text":"We had an awesome time and Capt. Greg was so delightfully quippy and knowledgeable! The tr","useful":0,"cool":0},"md1Ptdmv1Q1EQz3MLFACnQ":{"text":"Awesome experience! Our guide was incredibly knowledgeable, friendly, and insightful. Saw ","useful":0,"cool":0},"oSazjj9tO-YzYfH7c0EQvA":{"text":"of COURSE we had to pick the coldest and cloudiest day of our entire trip to take this exc","useful":0,"cool":0},"fDzxGBergrLgvq3d5UBJJw":{"text":"I did the plantation tour Laura and Oak Alley with Cajun Encounters, great time, good info","useful":1,"cool":1},"Ux4r3phel7rgq0JMVQgpjw":{"text":"Went on the \"city/cemetery\" tour and it by far one of the best tours yet.  Our driver/tour","useful":1,"cool":0},"OmwkXUoW3Qao1SvwFK0uEQ":{"text":"My family and I booked for our Halloween trip to New Orleans. There are a lot of options f","useful":1,"cool":0},"yrRdPVSZaIc9y0UI-cQvkw":{"text":"This tour was a lot of fun!  I was initially worried given the amount of people that our v","useful":0,"cool":0},"KW5voONOY0hjAZiLN3q0qQ":{"text":"We did a swamp tour with Cajun Encounters (see mom, I do more than just eat and drink!), a","useful":3,"cool":0},"7n4Dd2_8zaqVGEuAHpNcNA":{"text":"Was really skeptical about this tour, and the price, at first. Was also kind of nervous ab","useful":4,"cool":2},"8TvXkX5wUhcS4sEnNtmdNA":{"text":"Swamp Tour was great.\nIssue is with transportation to and from.  We were a group of six wi","useful":0,"cool":0},"qJKkRuCHO6Ep8fhIeB8QXw":{"text":"I've toured with CE twice now. Excellent company to  tour with, knowledgeable staff that k","useful":1,"cool":0},"aMGxBQbKb24C6yMMg5T0Ng":{"text":"Just got back from our Swamp Tour. Captain Teddy was great-friendly, attentive, very infor","useful":0,"cool":0},"2ThOwFv3S9lEd5H-0_nCew":{"text":"We took the plantation tour with Cajun, and are glad we did! Nice bus, good informative dr","useful":1,"cool":0},"ST_KTO-csez4ykJRB4cLPA":{"text":"my 1st review is for the swamp tour..first the driver KP really great guy..friendly, funny","useful":0,"cool":0},"S5CGtoP5DwwG1eGtgQs_1Q":{"text":"Fantastic tour. Our guide, George was knowledgable, funny and friendly. Would def go on th","useful":0,"cool":0},"JSMRP7hgbQkWZuuSUkajFg":{"text":"This tour is a must if you're vacationing in New Orleans. The actual location of the tour ","useful":2,"cool":0},"oUCCXF30EUcvxXlfScWS1w":{"text":"We had a great tour, thanks to captain Ron. He was patient and an awesome resource. He del","useful":1,"cool":0},"9Hols8UMtrZTggKfcdEz5Q":{"text":"On a recent visit we took two tours via Cajun Encounters: the City & Cemetery Tour and the","useful":0,"cool":0},"UOqS8KfVxcZQj412-Fmklg":{"text":"I did the swamp tour with Captain Anthony and the city tour with Jason. Both of these tour","useful":0,"cool":0},"i8rvM1d2YaLRIZoLwU65vw":{"text":"This was for my sons 13th birthday. He was so excited to actually be on a ghost tour. Our ","useful":0,"cool":0},"KYJ2H8XVj_vj5RcSsIKnTg":{"text":"Butch was our tour guide and he did a fantastic job.  I appreciated that we visited the se","useful":0,"cool":0},"uqhotRp2WjQhq7CnZ91RYw":{"text":"Bachelorette Weekend 2018! What an amazing experience myself and my bridesmaids had with C","useful":0,"cool":0},"be4ClAH-AeToR1mz2cqXNA":{"text":"We did a city/cemetary tour a two weeks ago today.  The tour was very interesting and we g","useful":0,"cool":0},"V8NULrQGewNVxbFZmcL-aQ":{"text":"Super tour pour faire le bayou! (apparement, le meilleur)\nPick up à 8h ou 10h ou midi, et ","useful":3,"cool":3},"T4hVZAs-73RmkumiXetLmg":{"text":"Although I am from Louisiana I have never been on a swamp tour.  Had a girls weekend and w","useful":0,"cool":0},"7RgJZVjLdmFYJfGulOG3lg":{"text":"FUN FUN FUN!!!!!!!!!\n\nThey picked us up in front of our hotel. The bus ride was amusing be","useful":1,"cool":2},"aGJe3C0itlm3Ck3Ceq0hig":{"text":"We did the swamp tours with this company and are already looking forward to doing it again","useful":1,"cool":0},"SEPMyJs88l6-IDkCWScPcg":{"text":"The tour guide is hilarious! Forgot his name. This is a great choice if you're in NOLA and","useful":0,"cool":0},"ht0McYNlqmbvT16bDC475A":{"text":"BRING BUG SPRAY!!! Im honestly surprised they didnt have any to sell. Maybe they were out.","useful":0,"cool":0},"0Khf4P5F6KWM8omq-bZOhA":{"text":"They advertised covered boats and the tour included a visit to an inaccessible cajun villa","useful":1,"cool":0},"XK-hrPHO5toYX_PUSiVNoA":{"text":"The swamp tour itself was excellent. The return bus trip delivered us three tenths of a mi","useful":0,"cool":0},"RrbXT44AAiB1z1NzfSRAJQ":{"text":"This tour is a must when visiting New Orleans. We had a group of 12 and we were celebratin","useful":3,"cool":1},"EODB20xHe-vpKO7rb_FOgQ":{"text":"I had a total blast on this tour!  Like most tours, it's the guide that makes or breaks it","useful":1,"cool":1},"sJBWmY0bERxkG5Fj16_7rw":{"text":"Captain Gary was awesome! He was patient and kind, answering a lot of questions. It is obv","useful":0,"cool":0},"aFioU_ICKFjQ9lm1JWNsAQ":{"text":"Edward was our bus driver. He picked us up directly from our hotel to take us to the Honey","useful":1,"cool":0},"-aohh3cNpUiPm_zdEfOIJw":{"text":"This by far offered the best part of our trip to New Orleans.\n\nThey picked us up at a very","useful":1,"cool":0},"6fozh4PNaVW-Ywo2xbsK1A":{"text":"We took this company to do a combo tour of Laura Plantation and Oak Alley.  The van/bus we","useful":0,"cool":0},"AdydM2EuIJWn9cu6lpACrQ":{"text":"If your gonna take any tours in new Orleans you must book with cajun encounters. .... frie","useful":0,"cool":0},"U9LNb7FmZ383VFmW5NEyXg":{"text":"We decided to do a Cajun Encounters Swamp Tour the night before.  Our hotel arranged and w","useful":0,"cool":0},"CsiA_MXcY0ETu96GoBC4FA":{"text":"Horrible! Stay away! Dont fall for them, they will waste your day! \nWe booked our tour. Th","useful":3,"cool":0},"52QCB--MVQAHKjiyOrwGVA":{"text":"Cajun Encounters is a must when you visit New Orleans. Yes, it's a very touristy thing to ","useful":1,"cool":0},"Kh0zBGqq2hyKlFgkNKcb4Q":{"text":"Great city/cemetery tour! We had butch as our driver very informative and had jokes! Broug","useful":0,"cool":0},"eoL37jYDBHeya3KizwpvLA":{"text":"Capt Jacob was great!! \n\nWe were very pleased with this tour. We saw it a bunch of alligat","useful":0,"cool":0},"iXELFBquWSVPl0l-ZW8BYA":{"text":"This tour is a must when visiting New Orleans. This was the best $22 dollars I've spent. O","useful":1,"cool":0},"IYcwhADa1HVFiKo5AIhW3Q":{"text":"We booked our Swamp Tour at one of the booths in the French Quarter for the next day at 4P","useful":0,"cool":0},"vf0Wr9FNsPoxmLz5L5w5kA":{"text":"These guys are everywhere, and for a good reason. We took a city tour and a swamp boat tou","useful":0,"cool":0},"YWGy6k3X8uNyg4m1P7X6aA":{"text":"Our guide was Mike and he did and excellent job! Small boat gave more intimate experience ","useful":0,"cool":0},"Mk6RNjf3xm5ORalFCAg6Mg":{"text":"Really fun tour and we got some good pictures out of it! We went during their sunset tour,","useful":3,"cool":1},"oPiSxBDJzcVmUCQxBHxs0w":{"text":"Ghost walking tour was awesome with Trevor! A wealth of history and knowledge with some hu","useful":0,"cool":0},"F1MAX07ekorn4p0vuvXzVg":{"text":"Flying solo for day two and having seen more than enough of the French Quarter, I decided ","useful":1,"cool":0},"kDqTxuB-b0saYWT7lXkYRg":{"text":"The website creates a hyped up experience to what you actually receive during the tour. Ca","useful":0,"cool":0},"QvrSTn7bhVEhULCIFI8RsQ":{"text":"I went on the \"city\" tour in January 2014. I normally don't like tours, but I opted for on","useful":2,"cool":0},"7jaIuzf17BI_dm4e8yV00g":{"text":"A group of 8 girls went on a Swamp Tour through Cajun Encounters during a Bachelorette Wee","useful":0,"cool":0},"X5sXxM75cf_luWHCe04uFw":{"text":"My wife and I went on the swamp tour this afternoon.  Great time.  Captain Bishop was funn","useful":0,"cool":0},"6fAJNXcG7GeN74Ksko3NAA":{"text":"Please be careful when ordering online for there swamp tour.  When I proceeded to pay with","useful":0,"cool":0},"q03a2acyRsKuUpMf7b3-og":{"text":"This tour was by far, the highlight of my family's trip to New Orleans. The boat is covere","useful":2,"cool":0},"z2LnLmoAbppitmooexr8AQ":{"text":"Well. We booked a plantation tour with Cajun Encounters during our brief stay in New Orlea","useful":0,"cool":0},"p9Zr9RYfe3_KvMzJy0u76w":{"text":"Highly recommend.  Captain Bishop was our tour guide.  I believe he said he has a degree i","useful":0,"cool":0},"2l2oIurkSj3uaTLEZkfk_A":{"text":"Took tour on HOT day of city and cemetery. Bernadine was our driver, she was excellent. Go","useful":0,"cool":0},"V4BlXJRJdIMEQBmSX2FT6g":{"text":"We were picked up one block away from our air b&b. They time block was 7:45am-8:30am which","useful":0,"cool":0},"7tSgQqohfStSnVC9uoaQkA":{"text":"This is unfortunately the most boring tour I have ever been on. The entire time felt like ","useful":0,"cool":0},"UvW5b1EFVaOtgRZKbVI_fQ":{"text":"I really enjoyed the Cajun encounters tour of New Orleans. The St Louis cemetery was fasci","useful":0,"cool":1},"SADlmV1tM6IMDzAlmLZn-g":{"text":"Such an awesome activity. Captain Ryan was so awesome! Saw 3 gators, he let us feed them. ","useful":0,"cool":1},"dZCo3hPzrZ_Z_M5E_uVlFw":{"text":"It was my first time to New Orleans, and I wanted to take a tour of the city.  The concier","useful":0,"cool":0},"bMX6z7Y0gbz-G-T5qZI2RQ":{"text":"My husband and I took a swamp tour. Was very sweet, we've seen a type of nature we've neve","useful":0,"cool":0},"bXyYt1vQeiSMORY-2dzNzg":{"text":"I chose this tour after carefully reviewing several swamp tour companies via tripadvisor, ","useful":1,"cool":0},"6eiKxnQOBOR3v8iBP2ZNpA":{"text":"I had been searching for some fun things to do while on vacation in New Orleans. After rea","useful":0,"cool":0},"199hwMqZxqjaO94_Gr-Caw":{"text":"Wasn't bad. I liked riding in the nice air conditioned bus and got a somewhat decent tour ","useful":0,"cool":1},"nhUmXOrp7Pq_BciJLFNo9g":{"text":"Butch was an awesome tour guide. Easy to listen to very interesting the whole time. Defini","useful":0,"cool":0},"57YmFKZ68m1hggYJNeUOyQ":{"text":"I was quite disappointed in the city/cemetery tour we took.  If I had to describe my exper","useful":1,"cool":0},"TbTT1vMreKZe2q2lBrHwWA":{"text":"We did a city/cemetery 3 hour tour. Reflecting back on my trip, It was the best 3 hours I ","useful":1,"cool":0},"JRQF7qvS9PuZsJdPFjtIyg":{"text":"Drivers could be nicer, ours didnt really care.  The tour was cool to be in a boat in the ","useful":1,"cool":0},"mTUHl9fz0lc8hlBHkU-etw":{"text":"A fairly quick drive out to the bayou and 2 hours well spent. There was only one notable a","useful":2,"cool":0},"71pUOQ4PifwlYcLJX6zHGA":{"text":"The swamp tour with Captain Bishop in early April totally exceeded my expectations! We saw","useful":1,"cool":0},"hnEMeKfrNOb0QrZewXAHzw":{"text":"Went on the swap tour with Cajun Encounters today, highlight of my trip to New Orleans so ","useful":0,"cool":0},"C3NVm4qMsVj1bzUKMgjKDg":{"text":"This was a good break from the standard French Quarter shenanigans. Our tour guide (I want","useful":0,"cool":0},"FoA4TNhO5AOIu7VQvOlDTQ":{"text":"Drove to Slidell...didn't mess with the shuttle. It didn't take that long and seeing the s","useful":0,"cool":0},"sQeykN4ykwW01RoS7HKV0w":{"text":"We had captain Gary and he kicked ass! Gary kept the tour moving with a cool humor and he ","useful":0,"cool":0},"_Pg0sK4k5UuvhSkom3xbfw":{"text":"Honey Island Swamp, preserved by the Nature Conservancy, remains one of the most pristine ","useful":4,"cool":3},"DbLXv5tu4j0EQtzaMbYxmQ":{"text":"When my friend first moved to New Orleans years ago (16? 17?) I went on a swamp tour with ","useful":0,"cool":0},"V2h3GcTQSZnm4Are7xpaEA":{"text":"Swamp tour was a highlight of our NOLA  trip. Captain Troy was very knowledgeable. We saw ","useful":1,"cool":1},"m3WTlEzpbmZ7Ki1d9KFtoA":{"text":"We did the swamp tour, pickup at hotel and drive to and from swamp was smooth. We called t","useful":0,"cool":0},"WXwLOGaJAmVqjjjj85sy7Q":{"text":".Over our week long NOLA stay we used Cajun Encounters three times. From the Bayou, the Pl","useful":2,"cool":0},"ETR1126pKU9Y1s-aG-o0kQ":{"text":"If I Could Give This Company No Stars I Would... I Used Them 3 Times, For The Cemetery Tou","useful":7,"cool":0},"M69mT2DKBoseWOnrHEmdvA":{"text":"Cajun encounters swamp tour was fine. It was good actually... Our captain Ryan was informa","useful":0,"cool":0},"-mSH0v5biPVGQYEaJHCb5g":{"text":"We visited after purchasing a groupon deal. We called for a reservation and set up a pick ","useful":1,"cool":0},"IuhHQQ9k-SNlaPJ3KfUWwA":{"text":"I gave them three starts not because I liked it.  The three starts are because it was on t","useful":0,"cool":0},"IjflobEGE1X2VFotku4rng":{"text":"This tour was so much fun and a great deal for a 2 hour boat ride + transportation. Our to","useful":0,"cool":0},"DeuNjZ-xt9CUgm17N_G-lg":{"text":"I was visiting NOLA with 3 friends.  We heard swamp tours were a must, but there are so ma","useful":0,"cool":0},"uJbksesQqECB1rEa6fDznQ":{"text":"Fun tour. We really liked the tour guide. He seemed to be the best out of all of them. We ","useful":0,"cool":0},"NnIT4d32qPZrwzVTzTGI_w":{"text":"A big SHOUT OUT to \"Captain John\", but I believe his full name is Jonathan. \nHe was an ama","useful":1,"cool":0},"gbi8t_wSp6DUVmrI93LosQ":{"text":"Highlight of our 5 day trip! We did the 5pm (not too hot) small boat tour with Jacob and h","useful":0,"cool":0},"T_37H4uhjCDVrYdZ31w2rg":{"text":"Everything and so much more!... the tour was great, Captain Troy was awesome! He was super","useful":0,"cool":0},"bg8-xXzpHRMxLk5opgAoWg":{"text":"They picked us up in a bus to head out to the swamp tour. The swamp tour was neat, but a f","useful":1,"cool":0},"zpc_3TYLDR4XXLf1K-nrpA":{"text":"We took the city & cemetery tour on Friday.  Extremely disappointed.   From the shuttle dr","useful":0,"cool":0},"jHkM0xX2uK5ifxL0fF63Gg":{"text":"Lots of waiting in the heat while the bus driver takes all payments. They need to rethink ","useful":1,"cool":0},"-SBlHw_VXBsTHlT8CH64vQ":{"text":"Swamp Tour was great.\nIssue is with transportation to and from.  We were a group of six wi","useful":1,"cool":0},"HK_aNekw8WjM44hfMAZTSQ":{"text":"Karen was a terrific tour guide! Pricey at $50 each for the city/cemetery tour but informa","useful":0,"cool":0},"qlZsaqgjgXFhHgkTxDcZog":{"text":"I booked a honey island swamp tour with this company while in New Orleans. I thought it wa","useful":0,"cool":0},"zFy_S6QYe3GcU_IOUg_6ng":{"text":"Awesome tour with a great tour guide. Forgot his name. I would recommend just driving ther","useful":1,"cool":1},"8OKoHyUDs8sizMUtO4mJ4Q":{"text":"Ty was a great tour guide!  Good sense of humor and full of interesting information. We ha","useful":2,"cool":0},"Q1Q8jPRlgwawCY1yriybfw":{"text":"go to the afternoon tour to better your chances of seeing a gator.\nalso you can take your ","useful":1,"cool":0},"n_SBce4m9hstZbdbhdVOuw":{"text":"Went on the Swamp Tour at 12:15 in December.   It was too cold for our reptile friends (al","useful":0,"cool":0},"7DtFwLQtTw2ZNhwCB9Cxag":{"text":"This tour company is great value for the money. We used them to tour Honey Island Swamp as","useful":0,"cool":0},"II0M0aSwO2W63o_skpF6yA":{"text":"We decided on our last full day in NOLA last minute to do a swamp tour. There are groupon ","useful":0,"cool":0},"DpQBPEouwefFu-73TL9U2A":{"text":"We decided to visit New Orleans to celebrate our cousin Paris's 50th birthday. We chose a ","useful":0,"cool":0},"GvWzePnU1A6XSX4_r3LTBg":{"text":"Customer service on the phone while booking was atrocious. We stood outside of our hotel f","useful":0,"cool":0},"ZL5P8c5O6YyXObxIoCXnHg":{"text":"This is a review of the city tour through Cajun Encounters. The tour started  out in the c","useful":0,"cool":0},"P8sLsOlDKP21EtJpHGfE3w":{"text":"I went to New Orleans for the first time over my birthday weekend and decided to do the ty","useful":2,"cool":1},"0tlHw5snoLYB9y3uqn9uEw":{"text":"I visited New Orleans for fun and one of my friends suggested taking a swamp tour.  Cajun ","useful":2,"cool":0},"y-Q7Xizpw5tqYusBa30Wbw":{"text":"We drove ourselves and saved a lot of money. Good (not life changing) tour of the bayou. W","useful":0,"cool":0},"sDCWd_GDl4m0Gg9wAFt6Wg":{"text":"Unfortunately the tour started badly. We waited 40 min to be picked up. They ask that you ","useful":0,"cool":0},"mgZ-eA5FD8ERRkT1ZFQ3Dg":{"text":"We recently spent a full day with this company doing two plantation tours and a swamp tour","useful":1,"cool":0},"TdzQLETkcpgdYq7QaQJugw":{"text":"We booked a tour for the Plantations.\nFirst it was for 12:00. Then they called and asked i","useful":0,"cool":0},"AMYFbpfNfCRK9iMTvqlOUQ":{"text":"We booked our swamp tour through our hotel. The shuttle arrived on time. The driver was ve","useful":0,"cool":0},"t2ORG-8S9H4TFIluMnn17g":{"text":"I wanted to do a swamp tour even though I knew that the alligators were hibernating. I did","useful":1,"cool":0},"Ydx5uM94LN_geq9KT5AU7g":{"text":"Tour was good, but it was very cold in the bus, plus the day was rainy and outside was eve","useful":0,"cool":0},"LAocTvvnWGAVu2xTuLqaVA":{"text":"We went on the City Tour. There was a problem with the a/c on our bus, but it wasn't until","useful":0,"cool":0},"2MgtO68BLfiBNZ-LNDcp1A":{"text":"We took the Saturday afternoon for at 230pm with Captain Dan. It was a very enjoyable expe","useful":0,"cool":0},"-Yd_jKtz26_TmG82ThlBOA":{"text":"The best part about this was the actual tour itself! The tour guide and captain of the boa","useful":0,"cool":0},"YlpAVy2kXVnKFPiQextDrA":{"text":"We were EXTREMELY excited to join the Plantation and Swamp Tours. We chose Cajun Encounter","useful":1,"cool":0},"2Tc1oQ2W_UNbaF0uxalp3Q":{"text":"Captain Troy was knowledgeable, engaging, and managed to coax out animals by name (serious","useful":0,"cool":0},"-RFAcGGXTaavaBBUKRPlzA":{"text":"Super fun trip. Saw alligators, hogs, turtles, and lots of birds like the great blue heron","useful":0,"cool":0},"dbdFz3IvtmqBFnyyibjxbQ":{"text":"Awesome swamp tour. Captain Jules was hilarious and knowledgeable. The tour was educationa","useful":0,"cool":0},"WasMr4Dfh3EJj_xAJ6NH5w":{"text":"Tonight we went on a swamp tour with Captain Ryan. What a great experience. Our captain Am","useful":0,"cool":0},"tXpsnTwSnFcsig6_5BPeUg":{"text":"Well organized and reasonably priced. Captain Bishop is a riot and extremely knowledgeable","useful":0,"cool":0},"J-DivjJLvNru1HWBisa_rQ":{"text":"We enjoyed our tour very much Captain Troy was excellent in making sure we seen and experi","useful":0,"cool":0},"8JyHI9d08gIn8P1dN53ezQ":{"text":"A fantastic and informative City tour. Butch our tour guide was \" Vat \" of information wit","useful":0,"cool":0},"IM1oXRnDbuN7sxqp4jU8eQ":{"text":"This was our second time using Cajun Tours and we were once again so pleased with their ex","useful":0,"cool":0},"L742dgFXbMsuJGsJiAGWlg":{"text":"Incredible tour by captain Greg! The hours in the boat flew by, and it was by far the most","useful":1,"cool":0},"vZoXABxhdLstWafKyzSnVw":{"text":"Great tour. We did the hotel pickup swamp tour at 930am. Buses are comfortable and ice col","useful":0,"cool":0},"J-h94SM2N-PSVPBsb8qz4g":{"text":"We saw so many alligators on this tour and our guide was informative and funny. The swamp ","useful":0,"cool":0},"sKlJ-ZZehfGMSyz1RSuXCg":{"text":"This city tour with Cajun Encounters was extremely disappointing and not worth the steep p","useful":0,"cool":0},"JiM8SEPjDoehH2V2PSqeaw":{"text":"Yay! I loved Stacy our tour guide! She was so knowledgeable, accommodating, on time and ho","useful":1,"cool":0},"5wnvaZywl5hKsFROVW8MfA":{"text":"We had a fantastic time on the swamp with Captain Al!  I had no idea how beautiful the swa","useful":1,"cool":0},"t0UHuQxIrGrYfqezCadxdg":{"text":"quick tip: rent a car because you'd want a car anyway to get to the farther out places in ","useful":1,"cool":2},"GCJd1TB6MCjcy5xTdzB6XQ":{"text":"FANTASTIC! I'm a little late in posting this but my family and I visited NOLA at the end o","useful":0,"cool":0},"V0tGPr7b1xIfnsboSYBqMg":{"text":"RUINED OUR DAY!   We only had one day to spend in New Orleans.  We wanted to take the swam","useful":0,"cool":0},"tKOopF7ft1ke8GaEpPuctA":{"text":"Both the bus driver and the boat captain for our swamp tour were excellent, friendly, funn","useful":0,"cool":0},"bGXenBxuRjAlUdwkKmijsQ":{"text":"We *loved* our swamp tour with Captain Nate over at Cajun Encounters. He gave us a lot of ","useful":0,"cool":0},"0hSuGoNFq-6WO0DwtqnGvA":{"text":"We had a blast with Cajun Encounters today! They picked us up from our hotel in the French","useful":0,"cool":0},"vEfemw3yvpz88R6wKM75Yg":{"text":"Captain Greg was fabulous. He led us on a wonderful tour and we were able to get the full ","useful":1,"cool":0},"kCSOhrWC_g2vMyo96wAtEg":{"text":"Our family had so much fun on this tour. Our tour guide, Bishop, knew the history and was ","useful":0,"cool":0},"dliKDx1TkXInCEvmVHaesw":{"text":"If you would like to encounter a cajun, this is where you go.\n\nI wanted to see what there ","useful":1,"cool":0},"dREz3Qsa90ndjuUbrLuQxw":{"text":"We are here for a family reunion and not everyone wanted to take the cruise.  Troy was a g","useful":0,"cool":1},"YhSuVp_YLoDKI6NVlYD_UQ":{"text":"We went on the Plantation tour of Laura and Oak Alley using Cajun Encounters.  The hour lo","useful":0,"cool":0},"1FrOTK6iR1iBreQAkM-7Kw":{"text":"I went on the bayou boat tour. The tour was fine nothing particularly bad about it in anyw","useful":0,"cool":0},"hQs-kMKLX4Ew_1SSoiIjEw":{"text":"Holy smokes!!! What a blast!! We had captain Scott & I can't get over how much fun & infor","useful":1,"cool":0},"OrneGrEJZPQgVJXIFw54EQ":{"text":"I can't compare this swamp tour to any other..but I must say it was well worth it. I saved","useful":3,"cool":1},"sxgIS-xtQdffghL5w8KA5A":{"text":"We took a city and cemetery tour today. I chose this company because the reviews looked re","useful":0,"cool":0},"N-swK7PMZJWlkvR2piSSUg":{"text":"I thought about rating Cajun Encounters two stars, and technically they did provide the pl","useful":2,"cool":0},"ycN7B5dhvinH_8U5mUTRPQ":{"text":"Five stars for the well-preserved wet lands we traversed during the swamp tour.  No stars ","useful":12,"cool":10},"GvUPK9lZfSIR1tbBcGTzbA":{"text":"We had a great time on the swamp tour!  Request Captain Troy, he is very informative, ente","useful":0,"cool":0},"sAXg783T_9zlr0Z1F47f-Q":{"text":"I have to say I was a bit hesitant about going on this tour as it seemed like a chunk of a","useful":0,"cool":0},"_fcgh81D_01sBtox7tGUVA":{"text":"The swamp tour is a must if you are visiting New Orleans. Captain Greg was an awesome capt","useful":0,"cool":0},"bKpgtzvuoPa8ZC5wGfOtYQ":{"text":"After heavy partying for consecutive nights at the French Quarter, we were all looking for","useful":6,"cool":5},"h04Jxzj6kibK0-Lvci2yDA":{"text":"Best experience ever!! Captain Greg as our tour guide made it such a great experience. we ","useful":0,"cool":0},"PsJn4tukjJcCqIzZRheMvw":{"text":"A most excellent experience!  I went on two different tours through Cajun Encounters and b","useful":1,"cool":1},"jXYFrMOD1DQR8L9L95Vl0g":{"text":"Did the plantation tour. Very interesting history and guides at locations. Major complaint","useful":0,"cool":0},"9DIZamUhHq2ilWBXetYHGg":{"text":"First, manage your expectations. These are not actually swamp tours. They are river tours ","useful":2,"cool":0},"4I8GZpLRwHflsBfSIpP0Fg":{"text":"Man, I was ready to give this place a 1-star review when I got on the bus that picked us u","useful":3,"cool":1},"eyTJw58o5pnQBtcyeDkjQg":{"text":"This was our first trip to New Orleans so we booked a city, plantation and swamp tour thro","useful":0,"cool":0},"AvPub7y5F6Ajc3vRPrUnRA":{"text":"City tour was very disappointing. Should have spent 1.25 on a trolley ticket instead. Coul","useful":2,"cool":0},"uFz-jLapzBYNtUj295BbmQ":{"text":"Me and my buddies signed ourselves up for the swamp tour. What a complete blast that was t","useful":0,"cool":0},"kFWUEbNqwv5oNUecQP8TdQ":{"text":"Writing to amend my 4/3/2014 review. Two extra stars to Cajun Encounters for their thought","useful":1,"cool":0},"nrBAc142HwgWi-SyIPd7iQ":{"text":"Took a Plantation Tour with Cajun Encounters through a referral from Free Tours by Foot.  ","useful":2,"cool":0},"1opcnJVH0CY-v_eQbuMUUQ":{"text":"Time for a city tour of NOLA from the comfort of an air conditioned van.  It was freakin' ","useful":0,"cool":1},"f4wSDVw-bKqGFRXW5rbnJw":{"text":"Awesome for the price. Even pick you up from your hotel. Costs 50 for the tour and the rid","useful":0,"cool":0},"dIaEYq7cZyvNd2bb3jymIw":{"text":"My friends and I went on the swamp tour today. Our boat captain was Chuck. This tour was a","useful":0,"cool":0},"2RpGqQ4jPpHEWPbHTaUAyg":{"text":"Decided to go on the day time swamp tour after being in New Orleans a few days since we wa","useful":0,"cool":0},"BLISkvSC9SEcqPLfLg5MKw":{"text":"Came with my husband in January. I highly don't recommend coming when it's cold! Only saw ","useful":0,"cool":0},"UbXSh3mYH_wxFnJDe29JUg":{"text":"We did a swamp tour with a hotel pickup. The driver was right on time and very nice and fu","useful":0,"cool":0},"rlZ7Es4dHyjn-12q-Mcw0Q":{"text":"Such a fun time!  It you're in New Orleans for a few days, definitely take the time to go ","useful":0,"cool":1},"A5CnxynyO2nqQXcZCLn0OQ":{"text":"Cajun Encounters was one of the highlights of our visit to New Orleans. \n\nWe were picked u","useful":6,"cool":3},"ePRBEFDJOmD-sWiXL8CyLg":{"text":"Great choice for a Swamp Tour in NOLA! Cajun Encounters has pick-ups around Bourbon St so ","useful":1,"cool":1},"RQXpwD0SBu0Gk-lKb3JeDg":{"text":"We went on a tour yesterday and had a great time.  Captain Teddy was fun and informative. ","useful":0,"cool":0},"mfzFrwzlgQl_0y0Pv_rkHw":{"text":"The afternoon city tour on the bus was awesome but I do not recommend the ghost tour at al","useful":0,"cool":0},"DxrmsYPpuJlgY-5zw5cvQg":{"text":"I wish I could remember our guide's name because he was excellent.  The only reason this g","useful":1,"cool":1},"hMCfxp7M37fD-G0z9HK7XA":{"text":"We enjoyed our two-hour tour with Captain Jules.  It was amazing to see alligators up clos","useful":0,"cool":0},"G4eWFK5VWk-5VcI7O8QzZw":{"text":"I pre paid for a tour. It stormed all weekend. Tiffany told me we were not on the list for","useful":0,"cool":0},"aIZ2PSKJsaGZw_1mrN8bMQ":{"text":"Amazing experience from start to finish. We purchased tickets with transportation from the","useful":0,"cool":0},"olq3-1UfJ5crKKc54Puk4w":{"text":"The tour itself was fantastic and we had a great time with our tour guide. My one and only","useful":0,"cool":0},"7b-CuxMEwX-hYzfoX6uxqQ":{"text":"We went on the swamp tour and the city tour and enjoyed them both! The swamp tour with Cap","useful":0,"cool":0},"zri1mYvr6Q2wML0FhrBBzQ":{"text":"We took a 2 hr. tour with Capt. Troy. It was a beautiful morning on the water. Our guide a","useful":1,"cool":0},"daCqju3lL7ft2GD6JIMyEA":{"text":"Our tour with Mike was, without a doubt, one of the best activities I have ever done on va","useful":1,"cool":0},"oQ4EjJjbZow4l49ykgRMkw":{"text":"My husband and I booked a package tour that included two plantations and the swamp tour. T","useful":0,"cool":0},"DuTDwoarCOqGpLmU6H6vxw":{"text":"I have taken their swamp tour twice. Just love it. They are on time and professional. The ","useful":0,"cool":0},"vQClbsgOi--12xMVJzSEMA":{"text":"City tour is terrible. Don't waste your money.  Worst experience of my life.","useful":0,"cool":0},"zZBYt6sdMx8ZSkfQoKPGNg":{"text":"We did the swamp tour and the plantation tour with them. Both were enjoyable, but the bus ","useful":0,"cool":0},"rNNdMAkumIryXSyncm20jA":{"text":"This was by far the highlight of my trip to Lousiana. Despite it being a bit gimmicky with","useful":0,"cool":0},"w-EC35vwLaeDd8k-mrvzqg":{"text":"Me and my dad (who flew in from Germany) went on one of the tours in 2012 (I know loooong ","useful":0,"cool":0},"CZ9sbd3_3hoM4UVo-vNM0g":{"text":"OMGosh! I've lived in Louisiana for 25 years and thought I'd pretty much covered all the r","useful":1,"cool":0},"n3M7hHDb7z1rTPHfuUoVSA":{"text":"We went on a swamp tour with Cajun Encounters and it was great!  We opted for them to pick","useful":2,"cool":1},"JsTP2JFd0WQPijjrMe0CvQ":{"text":"Our guide Bishop told us jokes and facts. We saw blue heron, owl,cardinal, turtles, even a","useful":0,"cool":0},"xnlIHl9vssM2TOKyfRQkCQ":{"text":"While on our honeymoon, a gator tour was a must! After stopping at a visitors center in th","useful":0,"cool":0},"DkBmM40uPArPzUR738iwPQ":{"text":"Our concierge booked a tour for us with Cajun Encounters. Got a reservation number and pai","useful":1,"cool":0},"V5LWvtpTEoEN2oTUaT53Ww":{"text":"it is a pretty nice experience in the swamp. though it is feb that most of the alligator w","useful":0,"cool":0},"olFHCeDid6ndZYaTXrnvQw":{"text":"Our bus driver Kathy, (with a K), made our ride fantastic.  She is a wealth of knowledge, ","useful":0,"cool":0},"gOIkuG3PWT1xJX0wAyXPMg":{"text":"Great tour! Our tour guide, Emmett, was very knowledgeable and entertaining. We saw a ton ","useful":0,"cool":0},"h8pw4MILJK_LQ2EfFXRwXA":{"text":"After cancelling last minute for a kayak swamp tour with a different company, we decided t","useful":0,"cool":0},"Vo9tYSHWw6OuWk69sDjG5w":{"text":"We did the swamp tour and it was awesome! Totally worth the money. We were transported fro","useful":0,"cool":0},"dVQFzCjw6K5tvk98z4plqg":{"text":"I loved our swamp tour with Captain Dan! It was the highlight of our trip. We got picked u","useful":1,"cool":1},"U8sJ3lYRJi4mKbYHwdwTAQ":{"text":"When visiting a new city we like to take a tour to get a feel for the area and decide wher","useful":0,"cool":0},"W5dBseVvr56lCrO_zAjveA":{"text":"This was seriously the most enjoyable tour I have done. Our Captain Scott was AWESOME! Ver","useful":0,"cool":0},"r1mIxq_UrobpwrTs74sRuA":{"text":"I was so looking forward to seeing the swamps down in NOLA but this Cajun Encounters tour ","useful":0,"cool":0},"rl-uOc6X5mfCqX_Xsvx99g":{"text":"Excellent swamp tour. I don't agree with the previous posts that said to drive yourself. I","useful":1,"cool":0},"EDXUw4mS3Z_Oq-lniWT85Q":{"text":"What an incredible tour! Renee you were do knowledgeable and I learned so much about this ","useful":0,"cool":0},"cIXZH9lb4AGoDKuSd3dx8A":{"text":"Butch was our guide.  He was fun and very knowledgeable about the City. We normally avoid ","useful":0,"cool":0},"5aJT1LLdga79gNYKbQneqw":{"text":"Doing this swamp tour was our favorite part of the entire NOLA vacation. All of the staff ","useful":0,"cool":0},"1809elnY_sOQ9ygpI7ZHWw":{"text":"This review is mixed, I definitely have tips for you if you take the swamp tour here. \n\nWe","useful":5,"cool":0},"SMapaq2QrcmpLR5jTpa56g":{"text":"I have to say I was really impressed with our swamp tour experience. Our bus driver Derek ","useful":0,"cool":0},"aYgIuFNEXM00Sicxwdlj6A":{"text":"Captain Emmett is pretty cool especially handling my toddler who was on the boat. We saw a","useful":0,"cool":0},"ddWTq_ykpNO8v9lRLwC5tQ":{"text":"Booked an 8pm ghost tour on a Sunday night. Didn't get a good vibe from the tour guide fro","useful":0,"cool":0},"P4tPzGisnF1WE4QHCc6w8A":{"text":"We went on a Plantation tour with Cajun Encounters.  We saw two plantations- Laura and Oak","useful":0,"cool":0},"auCUPqWxApaQsZBiqTkRTQ":{"text":"We only had a day in town and the city tour was perfect! We got to really experience the c","useful":0,"cool":0},"v5Gr2s5BmeDQNQtafsK78A":{"text":"Cajun Encounters' Swamp Tour was probably my favorite part of our whole trip.\n\nWe went on ","useful":2,"cool":1},"SA2zBaUOZtouEcEw6Rnmdg":{"text":"Brent was an amazing tour guide with tons of local knowledge and had very good stories reg","useful":1,"cool":0},"PfroVRnZIq31tZNWb7jshQ":{"text":"Please do not take the PLANTATION tour of Whitney and Oak Alley. This is a rushed tour. It","useful":0,"cool":0},"cpuJxBLmPUKRyURmbw9xKg":{"text":"This turned out to be a great tour. Wasn't sure what to expect but had a lot of fun and am","useful":0,"cool":0},"qCGyoWY7-tZy9Btxuvs_lg":{"text":"Bus driver was great . Oak alley was wonderful . I did not like the Whitney ,too long and ","useful":0,"cool":0},"UFnb3MEo-y_46n_iC5LCNQ":{"text":"Yes, it's touristy but we are so glad we booked a plantation and swamp tour combo deal wit","useful":2,"cool":0},"VNO3WMoFseG93EdUoIXKJw":{"text":"I can't help but laugh as I write this review... I was most certainly NOT an advocate for ","useful":0,"cool":0},"s4bFLKuGdRmcGL2szMXtUg":{"text":"How many times are you going to get in the swamp and have a blast? You will with these fol","useful":0,"cool":0},"w9xlokBqmqrfZjv1Yddx4Q":{"text":"I went on the daytime swamp tour with my friend and we loved it. We paid extra for them to","useful":0,"cool":0},"JUYT_kxSqca8PIx5KAkSyw":{"text":"It's been on our list to do a swamp tour while visiting New Orleans and we finally experie","useful":0,"cool":0},"CSsNmg8nOWgfEO69JD_efw":{"text":"Wade was amazing! Very knowledgeable and showed us all of the great spots around the swamp","useful":0,"cool":0},"VsGaw34N_7vk0Sf2wnEZyA":{"text":"Awesome swamp tour today! Sonny was our guide and was entertaining as well as informative!","useful":0,"cool":0},"K--cUWAA2SSpqFDEpe73gQ":{"text":"We booked with cajun encounters for the swamp tour. They did exactly what they said they w","useful":0,"cool":0},"zmoxWQMY0bnzGsWz_ofAPQ":{"text":"I want to thank Captain Dan for making our tour so amazing! He really wants your tour to b","useful":0,"cool":0},"WNVntTUnYtTR11KoiWHd_Q":{"text":"We had a great time. Picked up at our hotel by KP, nice guy gave a little tour on the way ","useful":2,"cool":0},"3PfrlBMW4jJMdcu7ojZQsg":{"text":"Cajun Encounters Swamp Boat Tour was absolutely amazing and by far the highlight of our tr","useful":0,"cool":0},"zkJCtq5rWjGduw9NvLpvrQ":{"text":"We took a tour with Butch for the New Orleans city tour, operated by Cajun Encounters.  Bu","useful":0,"cool":0},"S2y2d4r5GNl_0PYz4znkNg":{"text":"We toured with Captain Ryan and had an amazing time.  This is a great day excursion from N","useful":2,"cool":2},"kcGlZePhbnUymRcWe9-jbw":{"text":"I was in NOLA on vacation with a big group of friends this past weekend, and we wanted to ","useful":1,"cool":1},"whbpU4B6pI2-knc4rrB42w":{"text":"My family and I had a blast in The Honey Swamp. Our tour guide(cant remember his name) was","useful":0,"cool":0},"5GQMJh6-FC-z4yVdQ-fA5Q":{"text":"We had a great time. Captain Bishop was super duper. Saw alligators and wild pigs. This wa","useful":0,"cool":0},"3fpC4oLFry9GoWqMKgg0LA":{"text":"This was a great tour. Very entertaining and informative. The tour guide was very knowledg","useful":2,"cool":2},"KKAyjjgnFVaLnay8extMnQ":{"text":"We set up Cajun tours as my mom cannot walk around so well and this tour picked us up at t","useful":0,"cool":0},"q6Ebxpkmx0kurehK9qZOpg":{"text":"I did the swamp tour through Cajun Encounters.  This was a great way to spend half of a da","useful":0,"cool":0},"-lgKJhZTIMi4NLYrV-WDVw":{"text":"What can I say... we had the best time and amazing tour captain ever !! Captain Bishop did","useful":0,"cool":0},"IyFnkpnzhRa7UZaQxbfXNw":{"text":"I cant express enough how blown away i am by the staff that run the Cajun swamp tour. I wa","useful":1,"cool":1},"hRWTmX4EEb-JbSF7yH8nbQ":{"text":"This was a lot of fun! Went with 8 friends while we were in NOLA for a bachelor party. The","useful":0,"cool":0},"eDT8dqtcQysCX2McxsUTvQ":{"text":"We went here 3 years ago and knew this was the place to go this time around. Every aspect ","useful":0,"cool":0},"dwcxfusA1Y25urhjvcm-Bg":{"text":"I'm writing this review while sitting on the bus, waiting for the driver to process paymen","useful":0,"cool":0},"cq0w2I5bk34qk--9m7EN1A":{"text":"We went on a swamp tour and came across several animals. More than we expected. The bus dr","useful":2,"cool":0},"xs2-nTiEfTgENDoxUs80Rg":{"text":"This would have been a much nicer tour had the guide been more engaging. I love NoLa, the ","useful":0,"cool":0},"Dp-UapqDj-AP_sGSK4dPaA":{"text":"Swamps do not smell, I repeat, swamps do not smell.  Compared to bourbon street, the swamp","useful":0,"cool":1},"yQMSgAd-xG7PB6Bze2ipGA":{"text":"My husband and I did two tours with Cajun Encounters: the city/cemetery tour and the swamp","useful":0,"cool":0},"b2Y61594vwqZn5IQSEdyQA":{"text":"This is a review of the City and Cemetery tour, which cost $49. I think any tour is depend","useful":7,"cool":1},"3YU0qcM_kY7p4h8lfZKCIw":{"text":"I did the Swamp Tour in the daytime. This was such a beautiful tour, and I got to see some","useful":0,"cool":0},"m_hfpvL4j0_uO-KR2J2wLQ":{"text":"The only reason i am giving them 5  stars is because we received an apology the next day a","useful":1,"cool":0},"8BfOQsysBUCxhN0FT2-gHw":{"text":"My husband and I are so glad we took this tour.  We stopped at the Visitor Center while tr","useful":0,"cool":0},"tmN4NfRLC5_YHHz89oFOCQ":{"text":"We had a great time with Cajun Encounters! We went in April and were lucky enough to catch","useful":0,"cool":0},"vMwPK6OcBZ0D5XX26zTOWQ":{"text":"Horrible choice wish we chose other companies. We had to switch buses because some people ","useful":0,"cool":0},"nccgQ2lfEQ548oOmTAiB5g":{"text":"Very nice tour with Ashley. Lamon was very entertaining and friendly.   Captain Ron was aw","useful":0,"cool":0},"cI48_DizbDu27SeeGeEhxA":{"text":"We did the Mid-Day City tour and it was perfect!  Butch did a great job of covering all as","useful":0,"cool":0},"wMzhoECZo03GpsV-Gt4T-Q":{"text":"Had the time of my life! What a wonderful company! We booked a private boat and Troy was t","useful":0,"cool":0},"MwJFv-S6W-24WTwsEPNdpQ":{"text":"Overall great experience! The transportation was prompt and the driver was very informativ","useful":0,"cool":0},"k5RlwAastR97TmcH8Z-MQQ":{"text":"We booked the FQ walking tour w/ cemetery- It was a GREAT tour.  Our guide, TC Elliot was ","useful":0,"cool":0},"GsUzSV_rqlbj7lyWCI_X-g":{"text":"Had a great time on the boat thanks to Captain Al who had a ton of information on the swam","useful":0,"cool":0},"NpolpPh7B0HRSRVrrCZndA":{"text":"Had an awesome swamp tour with \nCaptain Al!!! Highly recommend this company and tour!!","useful":0,"cool":0},"PfYA-FgGKW-CRJOC0EHQ8A":{"text":"Our second dive into the swamps with Cajun Encounters didn't disappoint. Captain Jacob too","useful":0,"cool":0},"tYQcGFagZlKrLjSpt8IhSw":{"text":"We really enjoyed our swamp tour.  Our tour guide, Captain Ryan, was very knowledgeable an","useful":0,"cool":0},"Ab6MaVMrZDlvNku8vEK4bA":{"text":"This was a fun experience. Got us out of the city - driving through the countryside. The h","useful":0,"cool":0},"6DHReYMYBatWl0oVEIjHdw":{"text":"Would highly recommend taking this City Tour as soon as you get to New Orleans!\n\nWe called","useful":1,"cool":0},"rf4-W1JaFmlGPiSGvTP_bw":{"text":"Great way to see another part of the region while visiting the area.  Fun for kids and adu","useful":0,"cool":0},"0-MUZiiS3E2TiKwsOHYP5g":{"text":"We did a city tour that included 9th Ward, FrenchQuarter, cemetery, etc.  Our guide, Derri","useful":0,"cool":0},"J8AkxctUpZs7FK3EcI1YKQ":{"text":"Cajun Encounters runs like a well oiled machine. Not being one to follow the herd, I was a","useful":0,"cool":0},"glODAXXOLScrSYJIa79iRQ":{"text":"We went to oak alley plantation with Emica as our driver out and back. She was very knowle","useful":0,"cool":0},"6WSNhs4QKpJIzh6yFmFutg":{"text":"We went for a tour on our honeymoon in January. Decent weather. If you can, pay a little e","useful":0,"cool":0},"TQhaIKFMIBIozpLD0Ecggw":{"text":"Dionne was a wonderful tour guide. Gave great tips for drinks at Oak Alley. She took good ","useful":0,"cool":0},"FUHQBE8JCpTWAoN6ie4OBg":{"text":"My husband & I really enjoyed the swamp tour. The tour guide was a comedian and kept us en","useful":1,"cool":0},"acwsWH3yaVxD-7lbmv_nTw":{"text":"We just got back from a fabulous Cajun Encounter Swamp Tour with Capt Mark. What a boatloa","useful":0,"cool":0},"ienibtO22Ca6BTbHahbF5A":{"text":"Wonderful tour! Shout out to Captain Bishop who was hilarious and made it an incredibly me","useful":0,"cool":0},"0Ye4PdE0zcmEgtp4GHRgSQ":{"text":"We took the Plantation Tour with Cajun Encounters. Our tour guide was excellent as she tol","useful":2,"cool":0},"1ajUJOchcjPOjyvXh8BOdg":{"text":"LOVED this tour. The bus driver, can not remember her name but she drove the big business ","useful":0,"cool":0},"JM7JekB_hgj6d8w4gdJqHQ":{"text":"I would book tours with Cajun Encounters again in a heartbeat. There are so many other tou","useful":0,"cool":0},"mI2yfcY1v_nNsPB7FIae9Q":{"text":"Butch our tour guide was awesome! He was funny, entertaining and very knowledgeable. Would","useful":0,"cool":0},"Oa-nUBCOCWh99voEt1wEqA":{"text":"Stayed 3 nights at this Algiers jewel.  It is clean, comfortable and in a great location i","useful":0,"cool":0},"HePG03T-4in0rYO64sbVnA":{"text":"We had a great experience. Bishop was our guide and probably the funniest out of all of th","useful":0,"cool":0},"mpJsDEwYwCbzA8qC2KhcHw":{"text":"Captain Judah was a blast! He was funny and we had a great time. Super close to alligators","useful":0,"cool":0},"74Ry4GENZAwx2Rzvd5w3jw":{"text":"Great experience! Took the night swamp tour and everyone in our group loved it! Tour guide","useful":0,"cool":0},"AGYYxQjZGQIBfyAjlqC5Tw":{"text":"The tour overall was ok, was really rushed , Between the driving to the plantation,by the ","useful":0,"cool":0},"9S5nnstLEwi0muAgBJeXmA":{"text":"We did the city bus tour with cemetery tour.  The tour guide was also the driver.  It woul","useful":0,"cool":0},"m4rY4FmGgi8m7quhNLW1Xg":{"text":"I want to start with the booking experience. R.C. Was the man and had all the answers rega","useful":0,"cool":0},"BWDugqsxXV9Il36qC624AA":{"text":"Great tour, highly recommend taking a trip to the swamp. Our bus driver was very knowledge","useful":0,"cool":0},"iXkHZ_N5xJRDJ3XLy6zcrg":{"text":"Tour was great! Got to see many alligators! Our captain Ryan knew exactly where to take us","useful":0,"cool":0},"kllUDqqHq8jGhmTuLB-V6w":{"text":"If I could give zero stars I would.  Our driver was horrible, absolutely horrible.  She ga","useful":0,"cool":0},"AHfyEPS-Swy4EUv63e8tnA":{"text":"Capt. Bishop is the best! We came the first weekend of Jan. (yes late on my review) It was","useful":0,"cool":0},"DtxOEdlTEVAqIr0p8iDW8Q":{"text":"We had such an amazing time on our tour. We rented the smaller air boat and saw the pretti","useful":0,"cool":0},"TZB_VtLhI13IKt1SMv7O5A":{"text":"The tour was great. Included a lot of great historical information on the city. Our guide ","useful":0,"cool":0},"l9g1IYzPtsGaPFws_F3neg":{"text":"Had a great experience, shuttle from hotel was comfortable and quick. Once on the boat our","useful":0,"cool":0},"jgfGzsfjNBQnyz7TORPwKw":{"text":"We had Anthony give us a tour of the Oak Alley home and he was great! Very knowledgeable. ","useful":0,"cool":0},"6JQYxIQQ5GRdJPt90u7T1Q":{"text":"Well, I have to say this staff is some of the nicest around. They really encompass what is","useful":0,"cool":0},"cX4Zr7iCiMhQpZAcmkUnXw":{"text":"I did the city tour with Karen. She was very knowledgeable and gave us a great tour of the","useful":0,"cool":0},"j7MxWu738_mSQxEa_PSROw":{"text":"Best tour we booked on our trip. our guide was Knowledgable of the area, trees, plants and","useful":0,"cool":0},"owsdYxT6pgEdCVFs3Abhow":{"text":"This is a great city tour that takes you to a lot of different sections of New Orleans. I ","useful":0,"cool":0},"tOYytdGI0jIn46WscPLTqw":{"text":"Great service. Picked me up at my hotel. Butch was very informative. Will use them again.","useful":0,"cool":0},"JhRNOY520toJ61zZIDWc5A":{"text":"Best gator tour I have been on! We did the 2:45 swamp tour and were picked up at a hotel. ","useful":0,"cool":0},"LNoTBv5LoTXXwlFJxxx3Pg":{"text":"This was our third time taking the Swamp Tour with Cajun Encounters (once, just my husband","useful":0,"cool":0},"ogNbfzgfMvmGLBnB4IMDWA":{"text":"Took the city tour with Derek. He was super nice. Very informative, learned so much about ","useful":0,"cool":0},"E8EJTrIPmAR6glpeSBAZIw":{"text":"Wonderful city tour. Our guide, Butch, was extremely knowledgable & funny. Even my 11 year","useful":0,"cool":0},"RRGqCXmQ5nOnIcyewJWoKw":{"text":"Captain Mike was great giving the Yanks on board a good hard time, letting us West Coaster","useful":0,"cool":0},"DYr0eDxFgjhEzM8uEvz0Rg":{"text":"I went with a bachelorette party this last weekend to the Cajun Encounters Tour and it was","useful":0,"cool":0},"RzqSXWszfxB3P2zWw4_I-Q":{"text":"We took the bus tour around the city. Great stops, very informative and a comfortable way ","useful":0,"cool":0},"IFrbNTP3ADrnmuGHdOfuiQ":{"text":"Fun tour with an awesome guide, Captain Chris. Gave great overview of the river and swamp ","useful":0,"cool":0},"pYAOnfB1-i6idxM75Nq9ug":{"text":"Amazing tour! Beautiful scenery including gators and wild boars. Captain Jacob was interes","useful":0,"cool":0},"w-4dUPsWxOrPKQHgEUOGFA":{"text":"Captain Al was amazing, he had a lot of information and really wanted us to have the best ","useful":0,"cool":0},"VHMX9wbH9IHAnELIScWaFw":{"text":"Went on the 9:30 AM swamp tour today and was very pleased with captain Emmitt. He was very","useful":0,"cool":0},"lIJLgQv5mWXgCrrytp8yFw":{"text":"We booked a City Tour and a Swamp Tour after reading the overall good reviews of Cajun Enc","useful":0,"cool":0},"wJYiM0leXnF2a8c5NsR2EA":{"text":"This place was awesome! We weren't sure what to except but were thrilled that we saw a ton","useful":0,"cool":0},"iAeAc4BnHDYBBcV1knC7vQ":{"text":"Absolutely incredible tour! Captain Ron was a fantastic tour guide and shared a lot of rea","useful":10,"cool":10},"gZD7WaXmkRwAnf-gGTbfYg":{"text":"The driver was hopeless and verged on dangerous by answering the phone whilst she was driv","useful":0,"cool":0},"1J-6-5W_84FMOqnt4CY9pg":{"text":"If I could give a 1/2 star I would. Our tour guide was terrible. Last year out tour guide ","useful":3,"cool":0},"J5OmEXAXBnPrMZFWUQzxBQ":{"text":"Our guide, Collin, was excellent! He spoke loudly (and clearly) enough so hearing / unders","useful":1,"cool":1},"VRwfYM5Z6129eY-7iilF4Q":{"text":"We LOVED this tour! I went with my daughter and three grandkids. One is just over a year o","useful":0,"cool":0},"7Y875L1mk5V7HnYjLS3KXg":{"text":"Me and my friend had such a great time on this tour! Our tour guide Emmett was informative","useful":0,"cool":0},"NTeDapoH44-IIBXf-vXJiA":{"text":"I did the Oak Alley Plantation Saturday 8:45am tour.  \n\n     The driver was AWESOME as a l","useful":0,"cool":0},"9zVxWe21gMB6gg1ZLJ8Bbg":{"text":"What a great day on the water!  As the other posts state, early April is still a bit early","useful":1,"cool":0},"TPdYo-JuaR7wyOhNYgs_QA":{"text":"Really great experience! Captain Emmett made the experience really great! The 5 o'clock to","useful":0,"cool":0},"q0FwrSRLlI_tOiQHqNOy8w":{"text":"This tour was everything I wanted it to be!\n\nA tour like this has a potential to be hokey,","useful":0,"cool":0},"XMHDTQivqwWZySAczoS8_A":{"text":"Our captain Jacob was great. Really nice patient and fielded all types of questions. Took ","useful":0,"cool":0},"wg4BRhJZaM3ezYY2tF12Ug":{"text":"Absolutely fabulous! We were picked up from our hotel. The van that transported us to the ","useful":0,"cool":1},"FYsYr8dx3vgWz3L2ObvpMg":{"text":"The tour was great. Our guide, Rene was very knowledgeable about the area and entertaining","useful":0,"cool":0},"8QrlmN8EOD-a0af2I6bZ9w":{"text":"Very friendly staff, the ranch was very interesting and would recommend anyone to have jus","useful":0,"cool":0},"oGhh4Qq-cWuE2isHNRY-fQ":{"text":"Love my girl Dionne. She was super nice and helpful. We went to the Lara and Oak Alley Pla","useful":0,"cool":0},"YGWnxJUrd-WXuxifr_kHkg":{"text":"We took the city tour. The woman who drove and gave the tour clearly loves her city and kn","useful":0,"cool":0},"LpAFXywrpAUpYlEgjXXRBA":{"text":"Paid $200 not worth it. The bus driver Dewayne, was great! Probably what earned them 2 sta","useful":0,"cool":0},"XYC4SQ4_2yvEymHsNLQZkw":{"text":"Overall fantastic experience. Our guide was Captain Bailey. He was super friendly and funn","useful":0,"cool":0},"IfSj95pe5hGVkmvWVC08Ow":{"text":"The swamp tour was so much better than I expected. Emmitt our boat captain was amazing and","useful":0,"cool":0},"JzFXrMjdOfnPmwNzDUyGAw":{"text":"We were picked up at a meeting spot in the French Quarter and driven to a large bus that t","useful":1,"cool":0},"K4TjyqFCLs9JR-WHRugiaw":{"text":"My husband and I booked a plantation tour being that we're both history buffs. The tour gu","useful":0,"cool":0},"NNH67E9_3A8L2TDNJI3nzQ":{"text":"Cajun Encounter's swamp tour surpassed my expectations. In addition to alligators, we saw ","useful":0,"cool":0},"PxlNIfsytaoCnQp6gh40NA":{"text":"The swamp tour was, by far, my favorite part of my New Orleans trip! Captain Jacob was the","useful":0,"cool":0},"YJXg0ky6GNlI_3nC73_xAg":{"text":"We came with a group of 9 for our first swamp/bayou tour.  Bishop was our tour guide and h","useful":0,"cool":0},"LfSeCccR2eEpF1nVIABD8g":{"text":"I went with a group of 13 guys as part of a bachelor party through New Orleans, and as muc","useful":5,"cool":1},"KlgfL_lPguV3MP87s2yYug":{"text":"They say they are the number 1 company in Nola but clearly they do not CARE about the peop","useful":2,"cool":0},"4Yt2Kc7GHHQ2654JF7aAJg":{"text":"It was the most expensive and least interesting because you could not hear the tour guide ","useful":0,"cool":0},"Vppon874qPyaFRtbupBCyw":{"text":"Tour guide was awesome, van was nice. Took you to all the good spots in the city. bus was ","useful":0,"cool":0},"M7WwRxRV_rIEvRlQuY1mjQ":{"text":"We booked a Plantation Tour through the concierge at our hotel. We listened to her book th","useful":1,"cool":0},"YVT_ECq-66f5zL0i1O24MQ":{"text":"My family and I had a good time on the swamp tour. Seeing the animals in their natural hab","useful":0,"cool":0},"3Pwwa30gPO0SkIveIFkRYQ":{"text":"We went on the City and Cemetery tour with Rene. The bus was clean and air conditioned (th","useful":0,"cool":0},"l3WyPjMECt_Dly9cb_hnIA":{"text":"Such a great thing to do if you're visiting NOLA and have a chunk of a day to spend out in","useful":0,"cool":0},"Y_PegdUgnxH6e6yGq0vMwA":{"text":"This was my second swamp tour and my husband's first. This was far superior to the first! ","useful":0,"cool":0},"c5P-hpxr1Wn4_VRbKxyoeg":{"text":"One of the best memories I have of Louisiana happened on this swamp tour. It was an amazin","useful":2,"cool":0},"FXKr2xA0OOMG69ZlZo_AYw":{"text":"We made a reservation for the small boat tour (10-person limit) during the day. It was ver","useful":0,"cool":0},"XKIdzu-HUrTsbB0UPs5qIw":{"text":"Had a great time with Butch during the city/cemetery tour. He was full of entertaining tid","useful":0,"cool":0},"X-byN-IdqyssYZPMAbNZyg":{"text":"We enjoyed our tour guide Karen who kept up a lively commentary as we traveled through the","useful":0,"cool":0},"pQvQQy4ihPD0HBmPvVaA2g":{"text":"Tours go out rain or shine, so make sure you get a good weather report before you book.  W","useful":1,"cool":0},"OT26aqZawgfzV-pJwtrySw":{"text":"My friend and I went on the Swamp Tour. Captain Henry was our tour guide. He was outstandi","useful":0,"cool":0},"lxPOZMYHktonek_yGyqCgA":{"text":"Capt. Bishop was so entertaining and taught us come great things along the way. We were so","useful":0,"cool":0},"Ezv7WwpDcc4kf3m0pwFu_Q":{"text":"Captain Chris was so fun and the tour was amazing and beautiful! We had a great time! One ","useful":0,"cool":0},"lapoibS5PgnAkk513xrkkA":{"text":"Captain Al was amazing and so knowledgeable of the area and it's wild inhabitants. We had ","useful":0,"cool":0},"wWHMvmuvSfH4G9anNZWlcA":{"text":"YAY! Loved it! Debbie was awesome and very knowledgable!","useful":0,"cool":0},"zswiOPI7MikbSM3XlzSRgw":{"text":"Great tour guide! Derrick has full historical knowledge. The tour takes you from one side ","useful":0,"cool":0},"kCSa_w0LJD1r9aNab5pT4Q":{"text":"EXCELLENT tour!! Our tour guide, Wade, was enthusiastic, knowledgeable and clearly cared a","useful":0,"cool":0},"vQLPpmKODSAjpvVIkhC5pQ":{"text":"Took the city and cemetery tour and it was great! Karen, our tour guide, was super friendl","useful":0,"cool":0},"w0Wwnt9_Y2B5B8lqG-kJLw":{"text":"If you are doing the swamp tour I recommend just driving yourself if you can. \n\nI didn't s","useful":1,"cool":0},"aUa-Nc--5CqimFpDPdijfg":{"text":"Captain Jacob was an awesome guide; very knowable about the swamp history and what lives i","useful":0,"cool":0},"bo4AKiPmQxHHo0W7wbrGoQ":{"text":"Should've written this review sooner because now I can't remember the name of our captain.","useful":2,"cool":0},"Lf3atACthiGE8do8et-bgA":{"text":"It was very convenient because they also provide transportation from New Orleans. Our guid","useful":0,"cool":0},"uJs2FSxeVrNbZfauJjCqGg":{"text":"We had the best swamp tour with Captain Wade! He was fun, relaxed, and very knowledgable a","useful":0,"cool":0},"4gulejqD-HR5H2CCFd78nA":{"text":"THIS TOUR WAS AMAZING!  Ryan, our Captain had so much knowledge of the area, history, and ","useful":0,"cool":0},"t-DJmkdni6sVEFv0yrwSNw":{"text":"The swamp tour was a solid 5. We saw alligators, wild boars, and raccoons. The tour guide ","useful":0,"cool":0},"TNOSCEer8j270BnhVeiZ0A":{"text":"Prior to visit: had to call customer service line multiple times to question what the pick","useful":0,"cool":0},"9QydkOaJvZnwE4_hZHEsGg":{"text":"Our bus driver Alan was TOP NOTCH!  He was VERY informative and provided superior service.","useful":1,"cool":1},"OAT28K_lVNGQlN029pPTuA":{"text":"Cajun country tour is awesome a must try if your in new Orleans however we did not see any","useful":0,"cool":0},"ajbwwgO_5SKMr-7bLSPayw":{"text":"Emit was our Captain! He was very knowledgeable and funny which made the experience that m","useful":0,"cool":0},"X3PWFOkejVCFpsKxkGsYdA":{"text":"Highly recommend this tour! WELL worth it! We saw many alligators, turtles, osprey, and pi","useful":0,"cool":0},"yp60t2VdL15PVxz4JkH4oA":{"text":"We booked last minute on our last full day in New Orleans, and we're all so glad we did! T","useful":4,"cool":1},"Ee3Y-dIqFE1NTkFxVd45dw":{"text":"Did the swamp tour and although we didn't see any gators due to the cold weather, it was s","useful":0,"cool":0},"l9zK8L9dwd-a6d1LGdk35g":{"text":"What a great tour. We have been on one elsewhere and it was good, but this one was really ","useful":1,"cool":0},"LHkYPSyJ9j1pXxOYUze4ww":{"text":"Butch was our tour guide/driver for our city tour. He was professional, funny and highly k","useful":0,"cool":0},"0tSi075QWgb3466IjvXZcQ":{"text":"First off, definitely pay the extra for the shuttle service. The driver was very knowledge","useful":0,"cool":0},"Y-3wALOQxhuKm4tc8nEFyA":{"text":"We booked a tour with Cajun Encounters on the recommendation that we not do a swamp tour o","useful":0,"cool":0},"NmjMBIjJR6pGnX1C2AWJvg":{"text":"It was a 30 min drive from New Orleans but worth the drive! Loved it! I had a blast. My to","useful":0,"cool":0},"gBBTzIi4cyZVWiuiDfATDw":{"text":"Unfortunately my experience with Cajun Encounters isn't a good one so far. I called to req","useful":1,"cool":0},"heXpEiR5hHsa5MD81OeyjQ":{"text":"I had a difficult time on the tour because I was seated directly behind the driver and I r","useful":0,"cool":0},"uxRsBaDclUKbCWGLIAnr9A":{"text":"Big Fan! I will definitely do this again if I am in Nu O'leans! \n\nI had the pleasure of be","useful":14,"cool":13},"GQ4lRXG1pjgC-LMsGPYw0w":{"text":"My husband and I booked a Plantation tour through Cajun Encounters during our visit to New","useful":1,"cool":0},"52Y357_To1saZNtEbpsGeg":{"text":"I went to Louisiana jays last week and chose this company for the swamp tour.  I had such ","useful":0,"cool":0},"buMWyGI6XWf_It3Fo77NoA":{"text":"Booked our Steamboat Natchez cruise a day in advance and was unaware of their cancellation","useful":1,"cool":0},"lOU8HHEYBIb7Yo5kqN1qdg":{"text":"Haven't had so much fun on a tour in a long time. Probably the most interactive tour I've ","useful":1,"cool":0},"fapiMh_sx9nViQO8J4rBLw":{"text":"An interesting tour of New Orleans with a great guide. We did the afternoon tour of four n","useful":5,"cool":4},"Z6neGBWcLBaBoF59G2k_QQ":{"text":"Expect alligators eating marshmallows and hot dogs. \n\nWe chose the hotel pick-up option. T","useful":1,"cool":1},"rpKZGCy6gJvOYvcedkoSPQ":{"text":"We booked a swamp tour through Cajun Encounters which included hotel pick up for $49. The ","useful":2,"cool":0},"aAv1bfzAyeTcEuqag_6qvQ":{"text":"Nothing \"ghostly\" about this tour. The tour was still nice because it gave some neat histo","useful":0,"cool":0},"oEahQTQZ7OY-Wx8-NUFCkg":{"text":"Butch our driver and guide was excellent! Very approachable and extremely knowledgeable. F","useful":0,"cool":0},"edXg_pHImMBPNGSdbvFSNA":{"text":"If it wasn't so cold and if there wasn't a child crying during 90% of the tour, I would ha","useful":0,"cool":0},"BE5t-mVrNCf-5kNZoSc-tg":{"text":"Best set up ever: the price is reasonable and they can pick you up from a location in the ","useful":0,"cool":0},"9ANORM2Pau0eUA8Giz2hSQ":{"text":"It would be more exciting to watch paint dry than to have to listen to Tom, our tour guide","useful":0,"cool":0},"jU4dcz8QlmBUB6fxRKu5bw":{"text":"I've made several trips to New Orleans, but this was my first experience with Cajun Encoun","useful":0,"cool":0},"IyYoBg7vVtfH-Ag0ej2lDg":{"text":"they picked us up a couple of blocks from our apartment and drove us out to the swamp whil","useful":1,"cool":0},"_9Uw1zfZhuDnd81QelM7_g":{"text":"This is probably one of the biggest highway robberies you can possibly get schemed into. B","useful":1,"cool":0},"xBXsO9s3tB-WWVSwS5Yc_g":{"text":"We had a great time! Didn't see any alligators as they were hibernating but wow it was so ","useful":0,"cool":0},"bSHGKvkj36RGQzD2SeRR3A":{"text":"This is only for the Oak Alley + Laura (including Transportation) tour last Wednesday 3/13","useful":0,"cool":0},"-TzrXZGirCT6h-hrC1kYVw":{"text":"We rented a car and took a leisurely drive about an hour out of New Orleans to have an unf","useful":0,"cool":0},"ZQJtGEmL8TkwHcSZrfwilg":{"text":"It was such a great tour. Really informative and entertaining. \nHad a blast, would come ba","useful":0,"cool":0},"JxMIsdOsgR6M1R5sXpOb_g":{"text":"Amazing adventure. We had so much fun. Captain Tom was very informative about the wildlife","useful":0,"cool":0},"hhBMEEh2BVcB2VhpdgJvKg":{"text":"A good way to see some people f the highlights of the city of you have limited time.  A li","useful":0,"cool":0},"QrJ1pqZ_N3lO6HuEGgLWyQ":{"text":"This is an ok tour. The city tour is in an enclosed bus and has very limited stops (only a","useful":0,"cool":0},"jR5vFrtM6htFXUQ4FkJJZg":{"text":"We didnt get to take the swamp tour. We booked online and instructions told us to wait at ","useful":0,"cool":0},"YiKZUncrCAvq--xtjOHY8A":{"text":"My wife and I did the swamp tour. It was an amazing experience. The Captain was absolutely","useful":0,"cool":0},"EYIMqvVkS51lnSCJigalpQ":{"text":"Great tour. Not too long and not too short. You don't have to be a big nature fan, or an a","useful":0,"cool":0},"39W0VHeRz5fraR1XdYnXEQ":{"text":"Went on the Ghost Tour with Kristen. Was really disappointed. We could hardly hear her and","useful":0,"cool":0},"dNk5NhhBxRdG2yNO9Cny2A":{"text":"Not pleasurable. They canceled the first trip due to not enough demand for that trip. Sche","useful":0,"cool":0},"dpygtXEir1-Qt-9KMxHqZg":{"text":"Hotel Concierge recommended this 2 us while we were in town for a couple of days. The tour","useful":0,"cool":0},"z-G8smggYDu6zVzQs7BD2Q":{"text":"Captain Dan killed it for my bachelor party this past weekend. We had a private boat for o","useful":0,"cool":0},"p1iWRIoP_pa8cNkeODRxMw":{"text":"1:15 scheduled pick up time\n1:40 bus leaves, narration. \n2:40 bus arrives at boat site\n   ","useful":9,"cool":0},"FBoGtKONNeQihIaqvhBLZA":{"text":"May seem a little expensive but the swamp tour is DEFINITELY worth the money. The swamp is","useful":0,"cool":0},"2fg4d-DgRDm-nazu7TNBiA":{"text":"We visited New Orleans and went on the gator tour in early April. Our tour guide was great","useful":0,"cool":0},"mJr4Jvl92e9q3DCeKgH_WQ":{"text":"Tour was ok. Then I received the recipe was charged for a child. The child is only 2 years","useful":0,"cool":0},"vKY95fUfovKBG2rRE2Whtw":{"text":"After researching a few tours in the area, we chose this provider.  Online and advance boo","useful":0,"cool":0},"kV_FD97ncYl7CM4OsdkR4g":{"text":"The city tour was a nice, quick way to see all the different neighborhoods and get some cu","useful":0,"cool":0},"e2nOZh7DjZAbI_vq9gZv2Q":{"text":"Great experience! We had captain Tom.  Super informative and hilarious tour guide! We were","useful":0,"cool":0},"iTl2nrJbgu4IiDMWCW9VBw":{"text":"We did the Cajun Encounters tour of New Orleans, including St. Louis Cemetery #3 and the S","useful":0,"cool":0},"9682k3yB6HENxbJ7_NVlNg":{"text":"Tour was ok. They made sure we saw alligators.      We also saw wild pigs.  Nathan, our gu","useful":0,"cool":0},"XVoeBWuz33DW5vuqXS7L6Q":{"text":"The swamp tour was fun! We were picked up in a convenient downtown location; Fran the driv","useful":0,"cool":0},"kNuQ-Jasc7ih_YBpF7hycw":{"text":"Wonderful city tour taken mid-day with tour guide Butch. Very good tour with many sights f","useful":0,"cool":0},"OwnPQdzpGlkx6YWPMyFZIw":{"text":"Tour bus broke down. Got back 2 1/2 hours late\nPoor coordination with tour guides at plant","useful":1,"cool":0},"_tls-tqRf5WMVPFM1iUBpA":{"text":"Great swamp tour with Capt Jules. Saw gators and huge huge wild boar! After a nice bus rid","useful":0,"cool":0},"YWHGM9fQeOxSVcNFP4haww":{"text":"Waiting for an hour outside my hotel for the tour bus to show up. I called the office and ","useful":0,"cool":0},"Z0bbMmzBTbyKlkTsxCGVfA":{"text":"The Laura Plantation tour was excellent. The Oak Alley was not. Tour group was too large f","useful":0,"cool":0},"FIHusvv3FKRNe5QSOTym8Q":{"text":"We booked a city tour the day before we wanted to take the tour. The Web site indicated th","useful":0,"cool":0},"ZAsRBsvw9QEQ6xGt98b1oA":{"text":"We were lucky to have Butch as our Cajun Encounters tour operator. The City Tour was an A+","useful":0,"cool":0},"mAz3lTn9mglbXWH4bBogRw":{"text":"Awesome Experience! Captain Emmet was a blast to tour with! Lots of info and history and r","useful":0,"cool":0},"MAE6V1tG0fUv40sKegFcOg":{"text":"I did both the Swamp tour and the City tour. Both tours were great! The hotel pick up was ","useful":0,"cool":0},"UIS2_mo_L8EFO4fNy1LivQ":{"text":"An amazing experience. It was so great to see these animals up close. Many of the myths an","useful":0,"cool":0},"ywmP4WEA--fghfmsh0tD9w":{"text":"We really enjoyed our swamp tour! The company provides prompt and reliable service directl","useful":1,"cool":0},"zcpn8L_0bb9cZnDVGv-kOQ":{"text":"I have to say I am very happy with Cajun Encounters response to my complaint. They reached","useful":0,"cool":0},"t8gMzCyrv3k1yZm5-GkUuA":{"text":"This tour was great, HOT but great! Our captain was Captain Jason! He was very knowledgeab","useful":1,"cool":1},"7LZInraTLfauvlLtCkeUDQ":{"text":"The employees were nice but it was annoying that no one told us that the alligators hibern","useful":0,"cool":0},"81VJ7Vn-xJJf9EV75rBgxA":{"text":"I loved the tour!! I was so excited to see all the critters. WOW!!!\nOut tour guide was inc","useful":0,"cool":0},"fPeNF7iA7Np51N_gTkWqMQ":{"text":"Expectations exceeded by far!!! Cajon Encounters had just re-opened. How fortunate we were","useful":0,"cool":0},"oPwdWUS5cs_D1iETj2_jiw":{"text":"Came down to New Orleans so had to do a swamp tour to clear my bucket list. \n\nThis company","useful":0,"cool":0},"qdH01_xze3TncIBgH2o4TA":{"text":"Captain Gary is the best!! He was knowledgeable, entertaining, and a great boater. He also","useful":0,"cool":0},"PSSKEHp84ug07n7CasX7NA":{"text":"I had such s great time on this tour. Captain Anthony was fantastic and gave us a great ex","useful":0,"cool":0},"7qqBzSmZILHv8taPfUmeGg":{"text":"GO HERE!! They were the cheaper option for the swamp tour, and I'm sure the best! Our swam","useful":0,"cool":0},"ZTv2ZCJZOVRXY_qcC8a11A":{"text":"Had a great time on our swamp tour! Our guide was very knowledgeable and explained things ","useful":0,"cool":1},"qxCzt8fjym9YbTtE-8wH4w":{"text":"Glad we stumbled upon this tour company. Chris did a great job and was very professional. ","useful":0,"cool":0},"y5tmG1drEDm5ISkMALxhBA":{"text":"I took my first ever trip to New Orleans and decided to do the tourist stuff, and I cannot","useful":0,"cool":0},"mIOVElque2vGU0tyMVeBlw":{"text":"Drove about 36 miles to Slidell, LA because we heard this is the best place to experience ","useful":6,"cool":3},"Fr87Pg4QNVn6ESpVHpzUbQ":{"text":"Amazing experience! We did the swamp tour and had Emmett as our guide. He was very knowled","useful":0,"cool":0},"JTA11JDkUOdyZ44YH9sV8Q":{"text":"This is a review of the day swamp tour, night swamp tour, and New Orleans bus tour. Schedu","useful":0,"cool":0},"-zCpTXN7eKxUx9V3jakrQQ":{"text":"Captain Wade was fantastic! He was incredibly knowledgable about the wildlife and knew the","useful":1,"cool":1},"e5Jm0R087wdSI0Cu-Mh8Mw":{"text":"The tour was great and all. But our captain was quite a douche. His named escaped my head,","useful":0,"cool":0},"4FB4LUiwK3K4PMkrnFpXmw":{"text":"The tour guide was very nice and informative. With the price that we paid, We had a good t","useful":0,"cool":0},"v_Ovrc7Z3OMKjrmVuNVWqQ":{"text":"We had a BLAST! Emmett ( our tour guide ) was great.  Funny and informative... couldn't as","useful":0,"cool":0},"5FcOaRDQfijK0knhrt5VYA":{"text":"The 1 star on this review refer to the city tour. We took the city tour yesterday hoping t","useful":0,"cool":0},"7mKmyXXgSOP4S1nGrGdPwA":{"text":"My Mother and I took the Cajun Encounter Tour with Captain Emmit. It was a blast. He was v","useful":0,"cool":0},"UmN1wEF2F0-5O_5z8mzZyQ":{"text":"It was a good way to get away from downtown New Orleans and see other parts of Nola. Swamp","useful":0,"cool":0},"2ylTKjptdDeCUhxUioGWfQ":{"text":"You have to do their swamp tours when you visit New Orleans. It was very convenient (we bo","useful":0,"cool":0},"j65-QjnxW2nDBQLJRNF6Mw":{"text":"This was incredible and such a great value, especially compared to the other tour companie","useful":0,"cool":0},"HrLZqtJcVmo-S_BJfoVjzg":{"text":"Easy drive from New Orleans to the swamp tour. Our group of 8 had an amazing time and Jaco","useful":0,"cool":0},"n9qeY1caSK-sLpFyaPulew":{"text":"Highlight of my trip to New Orleans!  We saw so many alligators, big and small and learned","useful":0,"cool":0},"HlCGy_iWT9RoSAWtHrAGZQ":{"text":"Tour guest-centered. Request to ride with Dan! Great personality, including several \"gator","useful":1,"cool":1},"dNXzmoydbMI3ShaaJnJXHw":{"text":"Beware terrible customer relations. I booked a night swamp tour with them and had to go to","useful":0,"cool":0},"OKM_1FHUUiAryMIzKyKEqg":{"text":"My mother and I took a ghost tour with Melody one night. Melody was so awesome! Such a gre","useful":0,"cool":0},"jeX7YhjjYtVtT5P0zw7cSw":{"text":"Had a fantastic time! It was about a 45 minute bus ride out to the swamp from our pickup s","useful":0,"cool":0},"oi0AschzlNECYnkGpN9pWA":{"text":"We had a great experience with Cajun Encounters.We called the night before to make the res","useful":1,"cool":2},"xhynF2Ux_kW3WEVgLwzS3A":{"text":"As a reaident New Yorker, the closest I've been to encountering a gator was one of the fab","useful":2,"cool":2},"tOeDbFhJTptZ6jDhurlFKw":{"text":"This was my fav part visiting Nola. My captain jack was very informative and knew everythi","useful":0,"cool":0},"2sTQ1PsLEeJFKZRzXNuNjQ":{"text":"Did the city tour with Butch. He was very knowledgeable and hilarious. Everyone on the bus","useful":0,"cool":0},"PvPnjH8H1u6lI7NVu2qj5Q":{"text":"Cajun Encounters has all the signs of a tourist trap, because it is one, a really good one","useful":1,"cool":1},"cBE6VuvZ26m-LOTIMhh4kw":{"text":"We had a fabulous tour with Tom! So much wildlife and beautiful scenery! Tom was funny and","useful":0,"cool":0},"HpSMiglUG2vLGZMZUu4tfA":{"text":"We thought the city bus tour was outstanding and Jeff, our tour guide, was 5 stars!!! Info","useful":0,"cool":0},"TA0cfbgyTSfoBxlS5Gp7IQ":{"text":"I took this same city tour about 12-15 yrs ago and learned a lot more history than this ti","useful":0,"cool":0},"myoleGsxe_Ix8zCtWgMUlg":{"text":"Awesome guide (Bishop), awesome tour, awesome scenery.  I felt my money was well spent her","useful":0,"cool":0},"JEw8Vn8lvmJC1F3jkB47Tg":{"text":"We took the swamp tour with Captain Jacob and could not be more pleased. We could have con","useful":0,"cool":0},"iM_DzAaI0wkWkc6z-2sqCQ":{"text":"This tour company is the worst. Uncoordinated, late, rude, and incompetent. I would never ","useful":0,"cool":0},"jgXWcIufIewy4kcC5RYIqA":{"text":"Our tour guide name was Luca and he was amazing. We came all the way from California to Lo","useful":0,"cool":0},"6mQHyCm_dV1cKIwM-9GFkQ":{"text":"We read about a couple of swamp tours and decided to go with Cajun Encounters due to the o","useful":0,"cool":1},"kaW7MJhYlxiWE_LYvmCjpQ":{"text":"Loved it!!!! We did the night swamp tour and it  was so fun.  We did see alligators and a ","useful":0,"cool":0},"_XTdN2QmrKzYnx13mlb-9w":{"text":"We recently took a Cajun Encounters tour, and had Captain Eddie as our guide. The experien","useful":0,"cool":0},"B-pvk4irH2suQqYnYcuI8Q":{"text":"We were just in town for a couple of days and this was a great choice that our concierge s","useful":0,"cool":0},"PO2XKTzEEVM74s963i0nvw":{"text":"Great tour great guide! Go early before the swamp gets you! So much knowledge in the guide","useful":0,"cool":0},"fhqTKNwcupZac06p1_ln9A":{"text":"The swamp tour was the absolute highlight of our trip to NOLA!\n\nWe opted for the bus ride ","useful":0,"cool":0},"XG27qEMwDncFbpquvCbAew":{"text":"Excellent option for a tour of New Orleans famous swamps. Our tour guide, Captain Ryan, ma","useful":0,"cool":0},"ybpO8K3DqYIkBvndPzjf7Q":{"text":"Took the swamp and city tours. Both were excellent. The guides Butch (city) and Ryan (swam","useful":0,"cool":0},"0ZGpe-krGUxyqvFJFcRKEQ":{"text":"I had a great time on the swamp tour. Captain Emmett was a great tour guide providing tons","useful":0,"cool":0},"55Flw0PAhXqSkGZU3oRhng":{"text":"Our first time in NOLA! Which means our first time here. They had a cute little souvenir s","useful":0,"cool":0},"HkPLkPRbqi-dGoalKOsxZg":{"text":"Butch was an amazing tour guide.  He was friendly and informative.  His knowledge of NOLA ","useful":0,"cool":0},"SjJHmEYTG7BEahI4ZsGRwg":{"text":"Great informational and enjoyable tour. Derek did an awesome job keeping us entertained wh","useful":0,"cool":0},"lw_ZH-joYOKB76b9S0um0A":{"text":"I was hesitant because I had read mixed reviews on trip advisor, but this swamp tour was G","useful":0,"cool":0},"W87dtD6yWLW1KAhMTLiR8A":{"text":"Great tour. Bus was clean and comfortable. Rene was personable and kept our attention well","useful":0,"cool":0},"Jp0NIEWWD9lgVD71TuaZgw":{"text":"Miss Lorraine was great!  Super sweet and knowledgable.  We took the Oak Alley Plantation ","useful":0,"cool":0},"pmIOJM54gz6uo7NkiQDAyA":{"text":"While my husband was in New Orleans for work, my sons (ages 12 & 8) and I took the City & ","useful":1,"cool":0},"nRD-cciZ2GdNAEcCeTvZLw":{"text":"We booked a private tour through Cajun Encounters as a group of 12 girls  traveling from C","useful":1,"cool":0},"GlpCflQLUxOfzbYTC6WvwQ":{"text":"Disappointing! Scheduled a two plantation tour and was quoted a price. Due to a company mi","useful":0,"cool":0},"O8uyI2huBaRqDsYZuv83Dw":{"text":"Amazing tour. Our guide, J.D., made the best of a bad situation (heavy fog plus guests who","useful":0,"cool":0},"SK32oTAnWuahFwL9KrnfWA":{"text":"My friends and I did the swamp tour yesterday with Captain Jules and he was amazing! We go","useful":0,"cool":0},"5k-Ntyw0BXQqx38YEyWenw":{"text":"I spent 4 days in New Orleans and going on this tour was by far my favorite thing I did. C","useful":0,"cool":0},"VbptKhcmDJDklKSfdklgvQ":{"text":"The  cajun encounter tour was very  educational and enjoyable, but I would recommend that ","useful":0,"cool":0},"oxaBWK4Fce2Vlxb96HPPfQ":{"text":"I did the city/cemetery tour.  Greg, who sold me on the tour, said that we stop at St Loui","useful":1,"cool":0},"XJpnMQ4r7C84YDBE-ECkbw":{"text":"Really fun tour. Captain Ron was very knowledgeable and fun. Enjoyed the corny swamp jokes","useful":0,"cool":0},"D7m9GcoWTNbsa3zSB2zN9w":{"text":"Want a PRIVATE TOUR? DO NOT BOOK WITH CAJUN ENCOUNTERS! I probably should've gone with my ","useful":0,"cool":0},"w42HIVfpKZofPVRxCzuENg":{"text":"Our tour guide Luka was just as incredible as the tour itself. This was our first day in N","useful":3,"cool":4},"aC-2PoDOw6dUM9yBMF0cEw":{"text":"Bush was are Driver. We learned a lot, great host, \nSuper nice and friendly. Glad we had a","useful":0,"cool":1},"lr67ykTfR32nS0iPdSfTNA":{"text":"I'm torn about this review because there were a couple of things about our swamp tour with","useful":4,"cool":2},"2mEoPSZnbvQrZTAmON7dCA":{"text":"My family and I had such a great experience. The first gator I saw I blurted out: OMG is t","useful":0,"cool":0},"d-cPxbDbLIjXB4U80g1jzg":{"text":"We were picked up from our hotel by a van then we were transferred to a bus to go to the i","useful":0,"cool":0},"N-plMjtRBXFmNyfxPIs8iw":{"text":"If I could give it 0 stars I would. The bus had no A/C, and it's May. Jesus, get your sh*t","useful":3,"cool":1},"0_XOCYG0_6i7pbZR6oCJZA":{"text":"I like this tour company. I took the city and cemetery tour and plantation tours. They pic","useful":2,"cool":0},"dHokH4L-PUttoBbsF2Yt7w":{"text":"Writing this on the Cajun Encounters Tour Company bus! We booked 2 days worth of tours. Ou","useful":0,"cool":0},"9BrLDbxH37138WHxRzwF9A":{"text":"I took the New Orleans city tour and had a great experience. Our tour guide was hilarious,","useful":0,"cool":0},"QBKS1qq4kSourbBHa4Aquw":{"text":"We thought this company did a very good job from start to finish. The price for the West P","useful":0,"cool":0},"onCnXpS6qtVEqcFEBcrgRw":{"text":"This was one of our favorite things we did during our girls' week in New Orleans. We booke","useful":3,"cool":2},"Ff_-2IyFIn3tJoJ8agVQ7A":{"text":"Great swamp tour. Worth the money. You get to see gators, hogs, raccoons, birds, turtles, ","useful":0,"cool":0},"6vkl8OZhcilbm65KYQn1yA":{"text":"CAPTAIN AL IS THE MAN. I can't recommend this enough. Came with a bachelor party and expec","useful":0,"cool":0},"NpotyqlwCe3qFosSMwIX7g":{"text":"We saw alligators and a few wild pigs. The nature was great! What wasn't so great was our ","useful":1,"cool":0},"yUhsIZTdVv29uQvYs1aWOw":{"text":"Came here for a VIP swamp tour during Mardi Gras. Our captain was Desi and he was very inf","useful":1,"cool":0},"EXxt5FTydcDhvh_41zMKFg":{"text":"Great swamp tour, encountered lots of alligators and other wild life.  Beautiful and relax","useful":1,"cool":0},"3puye3SeiFqtE381FVA_Qg":{"text":"This originally was something my fiancée wanted to do, but ended up being one of the best ","useful":0,"cool":0},"gkV1Lr9upyLcXwhY__SILQ":{"text":"Captain Ron, our tour guide, was so great!!! He made this experience one to remember, he w","useful":0,"cool":0},"4SBCq4hZEw_zUr9TxYrTwA":{"text":"First time in New Orleans and took this tour...cannot day enough great thing about the tou","useful":0,"cool":0},"p6f80t8mFiRsjuDykYP49A":{"text":"We took an evening swap tour in the heat of the summer with pick-up in the French Quarter.","useful":0,"cool":0},"cyOXPWQRtaQetlSeyC2CPA":{"text":"Emeika, was our driver to Trinity @ Oaks Tours booked by Heather also a nice lady. \n\nEmeik","useful":0,"cool":0},"k3qnZ8ekwehUd4m2YUwcyA":{"text":"Please stay away. Not trustworthy at all. They are not the same as they were before. The w","useful":0,"cool":0},"Gu8NJqHuKnQOHQARoErdWw":{"text":"Captain Emmitt (sp?) was our guide on the swamp tour. He was very knowledgable about the a","useful":0,"cool":0},"tIWVLi05Qjq6du-W5nRv3A":{"text":"We did a swamp tour with Captain AL, he was very informative and funny. He made the tour f","useful":1,"cool":1},"F6SuH6KqHWCmkPJtmY_FGA":{"text":"Really informative, fun tour! Only reason I gave 4 stars was because the check in process ","useful":0,"cool":0},"adF92Hv96lOHlssZOojQrA":{"text":"Booked our tour the day before & got lucky enough to have Captain John as a tour guide. He","useful":0,"cool":0},"gr0JgiFui2JpwpliuEIjwg":{"text":"Emmett did an awesome job explaining this diverse ecosystem. He showed us wild gators, hog","useful":0,"cool":0},"GU9qJ4PpewVzkbXJLwLmHA":{"text":"I really enjoyed this tour. We didn't see any gators :( but the boat driver and bus driver","useful":0,"cool":0},"Llo7ZYPyKBlgG6Q5tIIN2Q":{"text":"This was my favorite part of our trip this past week! We really wanted to do a swamp tour ","useful":1,"cool":0},"_mG-M7TBaLtihGHMHgqVKw":{"text":"Had a great time with captain Emmmett ! \nHe is funny , informative and the best hands down","useful":0,"cool":0},"b-1sctaROY1_GOEiKzPLlw":{"text":"Great half day tour to the Laura and Oak Alley plantations. The woman who drove us gave us","useful":0,"cool":0},"HLu9peAWnYnPlXC_y6A5oA":{"text":"The best part of our entire trip! We did the afternoon swamp tour and it was a total blast","useful":0,"cool":0},"GK6abxK8gVXWCFH6fLbYMw":{"text":"The swamp tour was amazing. My wife and I took an early morning tour. Capt. Chris took us ","useful":0,"cool":0},"1KF8ovW74rjTQfIs1LvKFQ":{"text":"Wonderful tour of the Louisiana swamp. Our guides were fun and accommodating. This tour wa","useful":0,"cool":0},"Ck2P82b9ZilFh5rwQk3xvQ":{"text":"Great tour! We loved Emmett our boat captain. He was so knowledgeable, funny and really ca","useful":0,"cool":1},"__w2NyrMu-EkmtkVqfGMXg":{"text":"Did the Night Swamp with pick up tour. SO MUCH FUN! Captain Bishop mixes facts with corny ","useful":0,"cool":0},"IbxjT5oqcuwWPORicqJXtQ":{"text":"Tour guide was great and the process was very streamlined and well run. HOwever, the tour ","useful":0,"cool":0},"-vraoRWSYbQ1L-VqRkEPtw":{"text":"What a great tour! We did the swamp tour this past weekend with Captain Eddie and we had a","useful":0,"cool":0},"Tg8erb23zGy8KI1FAdVkhA":{"text":"I was a little nervous about going and taking 4 kids, Age 8-16. We did the regular boat sw","useful":2,"cool":0},"mSNiNo73sHQeSHxet1nf-w":{"text":"Swamp Tour! Great driver that picked us up on-time from our hotel. Then drove us around to","useful":3,"cool":0},"YfwuiCm9O1VM5UoGi7QS6A":{"text":"Beyond AMAZING. So glad we chose this tour, Captain Dan was AMAZING and gave us the best t","useful":1,"cool":0},"wKfhjet0tg8eULe7ap0xSQ":{"text":"A very enjoyable tour.  Captain Jacob was very knowledgeable and engaging.  The bus that w","useful":0,"cool":0},"pEu1Vlee80c0hdhlvAc2Vw":{"text":"Our tour guide Butch is awesome. He was very knowledgeable of the city and covered very de","useful":0,"cool":0},"5KUvmdM0af61og3LvC2D6w":{"text":"Dana, our bus driver picked us up right in front of our hotel. She was prompt, and full of","useful":0,"cool":0},"M75Ol4oCz6mVZNxJ9DMjcQ":{"text":"We had such a great experience on the boat tour!!! We had Steph as a guide. He was very kn","useful":0,"cool":0},"AskXXaWzyq6MKQc-o4sMVQ":{"text":"I'll keep it simple. Air boats are awesome! Our guide, I believe his name was Brad, was aw","useful":0,"cool":0},"C8udzA1bKd4xzArDGZ5SrQ":{"text":"Worth every penny! Definitely one of the highlights of our visit to New Orleans.","useful":0,"cool":0},"n35ti_SxNbNtrKbdwGcjkg":{"text":"Being a city girl, I wanted to go on the tour, but my nerves were shot lol. I don't do bug","useful":0,"cool":0},"-KYkAvL8INRUjtWUmBLCHQ":{"text":"I'll start by saying our guide was very knowledgeable about the cemetery and garden distri","useful":0,"cool":0},"At_ip9AJk8uaovNlHr1WKw":{"text":"I was a bit weary going into my swamp tour, as I thought it would be a little \"touristy,\" ","useful":5,"cool":3},"vc8Ga3WJffYShfEfahMGWQ":{"text":"Captain Stephen was funny and very knowledgeable! We found a huge gator and 2 pigs. Great ","useful":0,"cool":0},"qhYXDZnNkpx0jcq2KUntKg":{"text":"I set this up through my resort and it was well worth it!!! I've frequented New Orleans a ","useful":0,"cool":0},"KBS3thxNPyxVjoYKoRpwPw":{"text":"Captain Eddie/ed/eddy sorry don't know exact spelling but was a great tour guide for up cl","useful":0,"cool":0},"Op4rzuq5vo0jiHlWtVYIkA":{"text":"Don't waste your money. We literally saw one gator and boars that's it. They changed the l","useful":0,"cool":0},"tFTliNOlGHTb1GfbJiBnxg":{"text":"Had soo much fun on this tour! We went on a girls trip and couldnt stop talking about it! ","useful":0,"cool":0},"0jTG9qsSIDH-t4nUe1g49Q":{"text":"Great tour.  Our tour guide was Nathan, he was so knowledgeable,  he really made the trip ","useful":0,"cool":0},"5waXxMs8J0KehMdPD02HOA":{"text":"NONE OF THE GUIDES WEAR A MASK!   With two boats full of paying customers, the guides had ","useful":1,"cool":0},"r3dzqsWjpXfpdS3CM3SfjQ":{"text":"We had an absolute blast on this tour! It's a definite must while visiting New Orleans. Th","useful":3,"cool":3},"TFvs-FoNDZKSkXm7u-YMzw":{"text":"Had a great time at the swamp tour today! The bus ride over was incredibly convenient and ","useful":0,"cool":0},"3at9V0-Q_vKUijYPgDPCvA":{"text":"This was a great experience, the tour guide was amazing. We saw lots of alligators, hogs, ","useful":1,"cool":0},"zyMgre1l1RAaNfBIJwq-vg":{"text":"Had a really fun time on this tour! Company is well organized as far as pick ups,  drop of","useful":0,"cool":0},"I6Rq5DRsxtj61kxLP1aIyQ":{"text":"We had an amazing tour. Luca was so great with the kids and customized the trip to everyon","useful":0,"cool":0},"y0KUFstaEDJgpVqXogz5lA":{"text":"My best friend and I went on a tour with Wade... and let me tell you we LOVED Wade! He sha","useful":2,"cool":0},"1yIqtoZtEdEuGC7Yj31iBg":{"text":"We took their Oak Alley Plantation tour. It was so much fun. Our driver Dionne (like the s","useful":0,"cool":0},"56qBu2H5zJQ9ASPbWr6FUg":{"text":"We had a great experience with Cajun Encounters' swamp tours. Captain JD was our guide. He","useful":0,"cool":0},"zKte1455_1en5KvbkqDosg":{"text":"Great experience considering the gators were hibernating. Our tour guide was Capt Al and h","useful":0,"cool":0},"oIm2sgWYYQG3XBiyyPHPUw":{"text":"Capt Ron was great. A little too many jokes at times, but funny and informative.  Driving ","useful":0,"cool":0},"799CFnipJ89rhh_rYu6KGA":{"text":"This swamp tour is no joke!  We saw more alligators than we could count.  They come right ","useful":0,"cool":0},"EHr87mxqkHBYoF8K7PZRMw":{"text":"Used Groupon to purchase ticket. Super happy it came with hotel pick up and drop off. Tour","useful":0,"cool":0},"7G56XdRNvZ_4MNFJITJx_Q":{"text":"Last weak, I was in New Orleans for my annual Birthdaycation. I had the pleasure of taking","useful":0,"cool":0},"nH1D1ZTQo1ePsBMCaXZEzA":{"text":"Colin was awesome- informative and fun. We could not believe that 2 hours had passed. He k","useful":1,"cool":1},"pE1ZxgqmeBnDpaCXuj-Avg":{"text":"I've gone on this tour twice. It's super affordable compared to the other tours I've looke","useful":0,"cool":1},"7GuD9btOevPLZoVaCWbzeQ":{"text":"Amazing!!! Captain Bishop was not only knowledgeable but hilarious! We saw alligators, wil","useful":0,"cool":0},"Kq_7h4ZFmLjQTYFp3EKoGQ":{"text":"The guide was funny and nice but he fed the animals, although not the alligators, to lure ","useful":0,"cool":0},"f2LXvlYoCYZpRzET2B36NQ":{"text":"I'm from Montana and am deeply skeptical of any wildlife tours or promises to see nature f","useful":1,"cool":1},"5ivKW1RP2k4u4F5gsEzEGA":{"text":"We took the family on a gator tour. Bishop was our guide, he was awesome he taught us so m","useful":0,"cool":0},"yT50P5O4_udyiN_7f86d2A":{"text":"Took the tour today with Captain Luca. He was GREAT! He was funny, informative, interestin","useful":0,"cool":0},"_YbDTAWhr6XfPzz517hkMw":{"text":"We had a great time on the small boat with Captain Ron! He knew so much about the area and","useful":1,"cool":1},"SYCE6kZPKzXSFdV7s8uk1g":{"text":"We were told to be waiting for our tour bus at 8am for the 830 pickup, we waited nearly an","useful":0,"cool":0},"DMEwdd30gK--m9oM4m9L5w":{"text":"If you're looking for a well run swamp tour in New Orleans, book the Honey Island Swamp To","useful":6,"cool":3},"k97Cxj7yaWVKecEN2pk73g":{"text":"Captain Gary is the bomb! The bus arrived to pick us up from the FQ right around 820 or so","useful":0,"cool":0},"2L93eWdbKdUbvjrlP4knug":{"text":"Just left the tour and it exceeded our expectations.  Very entertaining.  Tour guide, Ryan","useful":0,"cool":0},"vCun04tuB3rs2bKpBlSPrw":{"text":"Great tour and Jules was amazing! Super informative and great sense of humor. He explained","useful":0,"cool":0},"2Lg3FKVCDgLeLNlHiygIww":{"text":"Captain Jacob was awesome! He was very informative and showed us various different species","useful":0,"cool":0},"1-yorJjnfbBT9QfPeoMTEw":{"text":"We did the Cajun Encounters swamp tour with the kids and it was awesome.  The alligators w","useful":3,"cool":0},"cigntN0nHsMHvzmkMMWs2Q":{"text":"We took the City Tour of New Orleans with Butch.   He and the tour were excellent.   He wa","useful":0,"cool":0},"HOAgON004Dl-Nrm-8Gv3-Q":{"text":"Enjoyed my tour. Adele was the tour guide. She's very enthusiastic and knowledgeable. Most","useful":0,"cool":0},"bMHT3KEkALq4TfW7IQSqcg":{"text":"I can't rave enough about our awesome captain/tour guide Luka and this super fun and uniqu","useful":0,"cool":0},"O9bvw8S-bNvf6pSB5Qtl0g":{"text":"The visit to The swamp today was terrific. I took the small 10 seater boat along with 5 fr","useful":0,"cool":0},"Dj39s3LW504HHqqNhCuY4Q":{"text":"Went to New Orleans with my lady and she really wanted to do a swamp tour. This really isn","useful":0,"cool":0},"Q7zQywA9yrdsOtOqcm0RJg":{"text":"Wanted to give a shout out to CAPTAIN JUDY and our bus driver Dwayne THE ROCK. Dwayne made","useful":0,"cool":0},"7WubLyufrJQCQbNXnbwbug":{"text":"Great company!  We took the swamp and plantation tours on separate days.  The bus was on t","useful":0,"cool":0},"T4R_QDvDjLVxZ18skV_PfQ":{"text":"AMAZING tour, our guide Jason AKA captain Clutch was hilarious and knowledgeable, and a ma","useful":0,"cool":0},"cwdYQJtJZRjY-SxYb2NtoA":{"text":"This tour was so much fun! We saw alligators big and small, birds, spiders, raccoons and b","useful":0,"cool":0},"CRo6w3SKxvKlT9hyW7NOEg":{"text":"Great tour.  I came with my husband.  The tour guide was funny and provided a lot of infor","useful":0,"cool":0},"QoOFqwKjbx1g0L8WAOFHUg":{"text":"Thank you SO much, Butch!! What a wonderful, informative tour! Such a great guide! Definit","useful":0,"cool":0},"4SV-HrteQZnZNDEZFAZEnQ":{"text":"On May 18th, 12 members of my family went on a Cajun Encounters Swamp Tour. Of those 12 me","useful":0,"cool":1},"Gmci1Ua91deWqVVdzckSYQ":{"text":"We took the small boat tour and it was SO worth it!! Captain Barry did a phenomenal job po","useful":0,"cool":0},"NoQRstSXnbKQhx_1N_cRXQ":{"text":"This was the best tour I've ever taken in a city before. We had an amazing tour guide-whos","useful":2,"cool":0},"wDyq4PuxCYKgjwpmj2Tviw":{"text":"Took the city bus tour they have. Pretty disappointed with the tour. It was nice, but so m","useful":1,"cool":0},"Fo2_kHSZSgvxUvRNfOwTbA":{"text":"Our first time in Louisiana and this made our trip. Captain Stephen was awesome and super ","useful":1,"cool":0},"SpI_qzRjEtlPH0Z1lPlamQ":{"text":"I'm disappointed that no one told us that all of the alligators would be hibernating. When","useful":2,"cool":0},"2vKYgN7YXNJqlk1dYr84pQ":{"text":"Our experience with Canjun Encounters was very positive.  We used them for the city tour, ","useful":0,"cool":0},"nAb4uNrpFpnjrMXfOIvy7A":{"text":"The tour was enjoyable.  The tour guide knew quite a bit about the flora and fauna in the ","useful":0,"cool":0},"WETorehz3vDZ03RjOkBPQw":{"text":"Worst company with no regard for a person's safety. Wouldn't offer even partial credit for","useful":0,"cool":0},"FnO-4E1eNKio3CW8KPccEQ":{"text":"We did the gator swamp tour with Luca, it was great! We saw lots of Gators, some xame righ","useful":0,"cool":0},"mRtDukmdOPyQbwgkkHtHLQ":{"text":"If you have the opportunity to take a tour while visiting New Orleans, the Swamp Tour and ","useful":7,"cool":0},"1eRT-Ucx-TOLl_Iivti6ow":{"text":"Great Tour!!! The Swamp Tour was great. Jason \"The Clutch\" was so funny had us all laughin","useful":0,"cool":0},"_KJNBx--ANpuNmUNlf8Nyw":{"text":"This was our first time doing a swamp tour and it was great. Captain Ron was very good and","useful":0,"cool":0},"af6TcMvwmrnCvTzEyiHX-Q":{"text":"Absolutely amazing experience. My only regret is that I didn't have my family with me as m","useful":0,"cool":0},"matrd1GoKZJmMPRq0IaLmg":{"text":"Was surprised by my BF (who proposed to me in NOLA) on a trip last minute!\n\nWell gave me j","useful":0,"cool":1},"uleMEfOfXmVDpxUF0eOTFg":{"text":"Went on their late afternoon Swamp Tour. Overall, I was very impressed with the tour guide","useful":0,"cool":0},"8WCzYgo4Sq67i8wiY2PATA":{"text":"My husband and I booked an 11 am tour from the Decatur street pick up. We checked in at 10","useful":1,"cool":0},"gADjLjGasueq91pzMacT9A":{"text":"Our guide was amazing. We got to see so much wildlife and experience the peace and beauty ","useful":0,"cool":0},"3V9SOyb0Fo2bEE3DO5854w":{"text":"Great tour. We chose the option with pickup from hotel. It didn't pick us up at the hotel ","useful":0,"cool":0},"Y4g2uFJcMuN3zeNtLTXG6A":{"text":"We had so much fun on this tour. Our tour guide Eddie was so knowledgeable and funny! We g","useful":0,"cool":0},"LB6UbMGSfvsZ-o80knJOEQ":{"text":"So much fun! The tour guide is like your favorite uncle, not too educational, and just exc","useful":0,"cool":0},"FfLn-TDWlmBQh7sR_T8cQg":{"text":"Friends recommended Cajun Encounters Swamp tour for our family trip to New Orleans. We had","useful":1,"cool":1},"jCyjt1lmNrN5UCPJK_XWJw":{"text":"Great great experiences. On-time pick up, clean car, and funny guide and driver. I had two","useful":0,"cool":0},"sKINDOyS8GyFZKKfakT-QQ":{"text":"My first day in New Orleans landed me in the French Quarter. I looked across the street an","useful":1,"cool":1},"jiy3bTyerCFUitV2ozlLHg":{"text":"We went today with Captain Troy and had a great time!  My son loved seeing the alligators ","useful":0,"cool":0},"rQe3vcLxi-c6pwQSnexVPg":{"text":"Thank you Brent!!  The French Quarter and Cemetery Tour we took with you was fantastic. We","useful":0,"cool":0},"NjM9tcAxASYWSvkHEBqcOg":{"text":"Tour offered encounters with small alligators, snakes, raccoons, and wild hogs. Tour guide","useful":0,"cool":0},"-_IJee_sOFuj6prBIKoO_g":{"text":"We took a city tour with Dereck this weekend. He was a great tour guide and showed us some","useful":0,"cool":0},"DY0CGqtpIzezshrtID5tLA":{"text":"Our first day and we wanted to really see New Orleans.  We wanted to see where we should s","useful":0,"cool":0},"lKmfL1qyMFF5Su0lF86ppA":{"text":"This was our second time on the tour.  Captain Henry was great.  Knowledgeable and enterta","useful":0,"cool":0},"IgKOiskl9upJcWyMaeE1Eg":{"text":"We thoroughly enjoyed the bus tour with Donna. She was knowledgeable and funny. She explai","useful":0,"cool":1},"QkIy_OtDtoZ5_qvh9qDUvQ":{"text":"We had a great time! The swamp was beautiful and our Captain Eddie was hilarious! We saw a","useful":0,"cool":0},"134zXosb3szo2tcxYmuLLQ":{"text":"This tour was our first stop while in the New Orleans area and it set the bar high for the","useful":0,"cool":0},"GccCqWK5RQ65ZLIQ87HKRA":{"text":"This tour company has their act together! We have done the swamp tour in the past. This vi","useful":0,"cool":0},"FMoPUt29vPqW4BxPXyX93Q":{"text":"We really enjoyed our swamp tour and plantation tours (Oak Alley and Laura). Our drivers (","useful":0,"cool":0},"ugkFlhT8Q2URUXAeQ9lkIg":{"text":"This review is for the Cajun Encounters Swamp and Bayou Tour\nat Honey Island.\n\n\nWe chose t","useful":0,"cool":0},"dnUEfNAw0LKUV--CE2pQcw":{"text":"This was my third swamp tour and by far my favorite.  I've been on a large pontoon as well","useful":0,"cool":0},"mzOEe2viz-RrQnpPsNMzow":{"text":"Our guide was Capt. John\n\n-Knowledgable and shared a lot of personal stories about his chi","useful":3,"cool":1},"TenGwxFvOU_lXDnWNQCSHA":{"text":"Had the BEST time on our tour! Everyone in the group agreed that we had the best tour guid","useful":0,"cool":0},"FiAa0A2hsapJucR3dVJ_eQ":{"text":"Absolutely amazing. Had a great guide who was super interesting and funny. They brought th","useful":0,"cool":0},"5SkZ6oSQzB2M69CZ2eyyPw":{"text":"This was my 3rd tour of the Honey Island Swamp and will say it was definitely the most enj","useful":0,"cool":0},"KVOEuSyhMKfAcC9KVudG2w":{"text":"I could not have been more pleased with Cajun Encounters. You are given the choice to eith","useful":0,"cool":0},"CLObKLoOT8dtNATLEpnw9Q":{"text":"Everything went well until we were on the boat and they told us that the alligators were h","useful":1,"cool":0},"PYfMnU-pFSa7Qsj84UdOQQ":{"text":"Had a great time! Feed some swamp pigs marshmellows. \nQuiet boats so it didn't scare off a","useful":0,"cool":0},"iW1mVKk3wbVPjAm4t4BU2Q":{"text":"Had a great time with Captain Jacob on our swamp tour. He had unreal knowledge of everythi","useful":0,"cool":0},"xajwaCLDAINBCT38A_gAlA":{"text":"Maybe my expectations were too high, but I thought there would be more to this tour. You e","useful":0,"cool":0},"AlsNHo10HWB6YxkaHMkGsg":{"text":"I rarely do this but due how horrible my tour went, I felt it was only right to save someo","useful":1,"cool":0},"dpCjejLUtmtJCOInpywMgA":{"text":"I booked the city/ cemetery tour as it was the main reason for our visit to New Orleans. I","useful":0,"cool":0},"wCMDWzxAuVCbgwGbPMHcEA":{"text":"It belongs to Pelican New Orleans, one of the largest travel and hospitality brands, local","useful":11,"cool":9},"WHhg7HJnmQqZr5s_-pyOYA":{"text":"This was SO MUCH FUN. On a recent visit to New Orleans, my amazing New Orleans tour guide/","useful":3,"cool":1},"j2kWsMYZ6JpmH4MS_Fhjtw":{"text":"Capt. Dan was great! We learn something new every time and it's always a great tour! We sa","useful":1,"cool":0},"FVERnsehqkd8JOZknsYGZg":{"text":"Thanks to our tour guide Jacob, we were able to see lots of wildlife on our swamp tour and","useful":0,"cool":0},"WRAOqRKmhPgEBjOihTXXMg":{"text":"We really enjoyed the tours of the Whitney and Oak Alley Plantations These two plantations","useful":0,"cool":0},"T0ymqOeJxSt3yuQ4fAc2LA":{"text":"Things started off a bit rocky. We booked the swamp tour  morning of, which rocked. On our","useful":1,"cool":0},"IRbRGdS34q9hdK2TMx_eww":{"text":"We did the Swamp Tour and it was very good. The  tour guid Bishop did a nice job of keepin","useful":0,"cool":0},"Q3_DtQ_0POcoNsvj8I2pGg":{"text":"Ya'll come back! And you all should because this is the funnest tour company around Nawlin","useful":4,"cool":3},"9YR2f9sxFAgXwbRW-uJQpA":{"text":"LOVED IT!! DESI our tour guide was sooo amazing! Learned sooo much! Our bus 50 also showed","useful":0,"cool":0},"9kXqGcZDj3eBdR_ILfA2QA":{"text":"Today was awesome! Captain Clutch was amazing! He told us a lot of interesting information","useful":0,"cool":0},"i4OkI9EIceRorcq9ORckeQ":{"text":"Aug 1st 2018. We came for 2 days to New Orleans,  and we decided to do a swamp tour. By th","useful":0,"cool":0},"mRVbDLVd5wS4YIWTNHzAfA":{"text":"Nia was very knowledgeable, and a bubbly personality that kept the ghost tour lively. Yes ","useful":0,"cool":1},"jRapInwY-d6Af2O2G5bKLQ":{"text":"Great tour! Captain Luka was great an very knowledgeable of the swamp area since he grew u","useful":0,"cool":0},"KChccqn9muevkxraUBXyHg":{"text":"Really a highlight of our trip to New Orleans. Took the swamp tour of Honey Island and on ","useful":0,"cool":1},"011N9Upj3La8L3Kv_fFSPw":{"text":"Awesome swamp tour & great price. Saw so many alligators and other wildlife. Sunny was our","useful":0,"cool":0},"0dBMPpR1aiZ5fCjDE4C1AA":{"text":"I've had so many people say New Orleans would be a fun trip with lots of great food and fu","useful":2,"cool":1},"DDqaTMH0rfxScuKoO4x0NQ":{"text":"This tour has thus far been our favorite part of our trip to New Orleans! Cajun Encounters","useful":0,"cool":0},"Xkyfqis2s9fDWkFMrLIQhg":{"text":"Our family really enjoyed the swamp tour.   Getting to see the alligators and other wildli","useful":0,"cool":0},"aBvFr3NrcuNy7w8WTDtWnw":{"text":"We took the small boat swamp tour with Capt. Ron, and it was one of the best things we did","useful":0,"cool":0},"KUMenwlECDktI_FhImlgYw":{"text":"great way to see more than just burton street and explore new orleans neighborhoods!!!\n\nBu","useful":1,"cool":1},"8v9YRBsE2bcV1zVVRx15EA":{"text":"Booked tour at last minute and so glad we did.  Jason picked up from hotel on time.  Picke","useful":0,"cool":0},"Lp8z_c8wSlfUbOG9-nAIUg":{"text":"We went on this tour in June 2019. The tours are run very efficiently. You receive a color","useful":0,"cool":0},"2aPAEvpjWzKBYIaYN3midQ":{"text":"I took the daytime swamp tour with Captain Greg on Sunday, May 18. What a great experience","useful":1,"cool":0},"nt9v8gLnHU9M9ufKCc-j1w":{"text":"We took the half day plantation tour, visiting Oak Alley and Laura plantations. I've been ","useful":2,"cool":1},"UtVIYr9xc24Ga5GipNxMlQ":{"text":"As an activist against animal exploitation in the tourism industry, I was very hesitant bo","useful":2,"cool":0},"jgBGAEFau_350dtvxU0IQQ":{"text":"BUTCH BUTCH BUTCH!!  He was a great tour guide.  Lots of fun and very knowledgeable!  \n\nI ","useful":0,"cool":0},"revaIIHIUk5r6uhu-o3Cog":{"text":"The good: the tour guide, capt Bishop, was INCREDIBLE! He was funny, knowledgeable, fun, a","useful":0,"cool":0},"cForZKqYDgEw6hCoYkQcBA":{"text":"My friend and I booked our swamp tour just two days in advance during August and had no tr","useful":2,"cool":0},"lSY4OhDUQ_wF_gj8uzy8_A":{"text":"Enjoyable tour with lots of facts, history, and sightings of wild boards, alligators, snak","useful":0,"cool":0},"wOM7izav2lXLOghoM5JnJg":{"text":"Cajun Encounters was easily the best experience since we arrived in the Big Easy. Captain ","useful":0,"cool":0},"FdoLaHOomHeLealqNRKF1Q":{"text":"Desi was an awesome tour guide!! We learned so much from him today. We will definitely be ","useful":0,"cool":0},"4Rd4BcZxiX2-Nwf99NpJMA":{"text":"Friends and I were walking to brunch and came across the reservations booth for Cajun enco","useful":1,"cool":0},"HHMlV6mZer4vFSdTJcjdKQ":{"text":"I have always wanted to do a tour in New Orleans as there is so much history but was afrai","useful":0,"cool":0},"tKqKWzulaaHTZa0FuefIAg":{"text":"Had an awesome tour experience here! John S was our tour guide and he was amazing- knowled","useful":1,"cool":1},"RkSC6STlpw5js4KtZVlhqg":{"text":"Took this bus tour fearing it would rain.  No rain but what a pleasant surprise this tour ","useful":0,"cool":0},"xzH1W_HYHjtSaIBHV1-LkA":{"text":"We had a fantastic Swamp Tour on Monday.  The company is reasonably priced, picks you up i","useful":0,"cool":0},"AHJsQbCC6nxG9Aq2e6mQVw":{"text":"We had a great time on the Cajun Encounters Tour. Captain Jacob made it a great day for ev","useful":0,"cool":0},"Y9l3uOR4yirlTlDsH818Yw":{"text":"When I was booking our trip at the Four Points by Sheraton the booking agent Mary told me ","useful":1,"cool":0},"ldDhwQ-ziR2HUIPg0y3ILQ":{"text":"Took a ride today with Bunsie (Derek) and had a fabulous experience. Hands down best bang ","useful":1,"cool":1},"8UxwPM0mssmf3RP1szoJ4A":{"text":"While on our visit to NOLA we weren't sure whether we should do a swamp tour or not. We de","useful":0,"cool":0},"Wylp3zTYp04_JtKQd2UhAg":{"text":"We had an amazing time! Saw so many alligators and loved our tour guide sunny! He was funn","useful":0,"cool":0},"mKFrCXrAwyDsh-ALZkhuLw":{"text":"Really, really glad I booked a plantation / bayou combo tour with this company.  \n\nThe swa","useful":1,"cool":0},"-EeQT-PHDOx7G5Zncy549Q":{"text":"loved it!\n\nsuper touristy, but super fun. we came on a great day and saw 6 or 8 *different","useful":0,"cool":0},"ZwUheRluPVGuUDxqGm9GNQ":{"text":"Booked a swamp tour with pickup from our hotel. The bus driver, Laura, was a new orleans l","useful":0,"cool":0},"XsD3h1aDfs2XtdYECZrkvg":{"text":"We took the Cajun Encounters Honey Island Swamp Tour and highly recommend it! Let me just ","useful":1,"cool":1},"fg0ddjgkUMiGGsgB0U_XnQ":{"text":"Did the Oak Alley and Laura plantation tour. The plantation tours are 4 if you don't have ","useful":0,"cool":0},"HoQbLW0gCXpQw1xK1ajuTw":{"text":"The tour had barely any stories about hautings; seemed to be more of a plug for other busi","useful":0,"cool":0},"JGWkJvqv3119JRjUETaZ-g":{"text":"This was by far one of my favorite tours! The guide was captain Ron and he not only made i","useful":0,"cool":0},"psGpmP2NVoQYiQk3nb6Tjg":{"text":"Butch gave us a great informative tour of the city.  Loved that he was a local who really ","useful":0,"cool":0},"9qSd24i3zObA0hLqId3lDQ":{"text":"Cajun Encounters is one for the books!\n\nWe had such an experience from the moment I booked","useful":4,"cool":0},"_zqm9drc5im14A6PfH9fDA":{"text":"Loved this company! We took two tours with them: the city bus tour and the Honey Island sw","useful":0,"cool":0},"piH6u-ATGWgfzQL_P9I16A":{"text":"We did swamp tour with Cajin Encounters, which we enjoyed very much!!! Kimberly , our bus ","useful":0,"cool":0},"FQQiKRMT3vNFn2dHLVitgQ":{"text":"People. If you are going to go out of your mind with fear over spiders, stay away from thi","useful":0,"cool":0},"C5DaNeqyTIH_XSq_jsRD3w":{"text":"We did the smaller boat without the canopy. We enjoyed our time but unfortunately due to t","useful":0,"cool":0},"U0MlNuHebG1NqCs-JRk7pA":{"text":"Really good tour with Nola native Butch! He gave an immersive world class tour. It was ver","useful":0,"cool":0},"443ugLENmYjnWn94cOxxAA":{"text":"I highly recommend this tour! We saw both plantations, but I just wish I had a little bit ","useful":0,"cool":0},"YieC7V3iU7L-G43-yRYpgQ":{"text":"Really enjoyed our trip. Our bus driver went over & beyond for us. My father is handicap w","useful":0,"cool":0},"EjjtHBNwnhgl8n7OC4Z65g":{"text":"Last minute vacation for two. Decided to take this swamp tour, ended up being a great choi","useful":0,"cool":0},"J2kfHFpp8-XZJFOdagXpKw":{"text":"Booked this excursion one month before my trip to NOLA. This was one of my most anticipate","useful":1,"cool":0},"tciFKbT-Vu7cnMVdiXDaKA":{"text":"Loved our swamp tour of Honey Island . Captain Bishop was great. It was a cool, cloudy day","useful":0,"cool":0},"kmYk4-TrAtgHyvpZE3Qhsg":{"text":"What a awesome place!!! People were friendly. Our captain Walker did a amazing job at navi","useful":0,"cool":0},"m2NaWQf-FOyhukqJlf0hWg":{"text":"My friends and I really enjoyed the swamp tour with Cajun Encounters. The bus picked us up","useful":0,"cool":0},"1oY4CEgyVmwV7wogKPF2jg":{"text":"Went on swamp tour today and it was excellent! Captain Chris did a great job. The tour exc","useful":0,"cool":0},"CZly8j5aQGwMgkN1V1EGgA":{"text":"One of the best experiences I've ever had in my entire life I'm gonna get straight to the ","useful":0,"cool":0},"UvbP6Fk3pvvt1ZXjkdqsFg":{"text":"Great entertaining tour. Sonny was an amazing captain, making us laugh and sharing insight","useful":0,"cool":0},"_1Z9ImAuTPFkTW4A3U2cNw":{"text":"Captain Troy was great! One of the best tours in New Orleans!","useful":0,"cool":0},"iMHIYXM1EZIgV-pZ1zinaQ":{"text":"Captain Henry was amazing!!!! He was very knowledgeable of the history and wildlife. He ma","useful":0,"cool":0},"Af7r7ELxLwAiUse1qdocwA":{"text":"This was the highlight of our trip to LA. Luca was an informative and funny guide. If you ","useful":0,"cool":0},"DL_EQUspv2IP7TNV0xLimQ":{"text":"Just finished the swamp tour and it was amazing! Captain Emmett was fantastic, I highly re","useful":0,"cool":0},"J4RjFkz92wuqXYUDq58oOQ":{"text":"We had great time and lots of laughing .  Thank you captain Gary...we learned a lot about ","useful":0,"cool":0},"P3h8JNiTdLScY1dKnxnA1g":{"text":"Tour guide was nice but lied about beignets being the best at the place he took all of us.","useful":0,"cool":0},"Cuqn_50Km2ibjUAECIhXgA":{"text":"Truly this swamp tour was the highlight of our trip to New Orleans. It beats all the cemet","useful":2,"cool":1},"l3ugPzgdlDFcBi5NNGhKAg":{"text":"Derick was great, so informative and enjoyable. Highly recommend! He has a ton of knowledg","useful":0,"cool":0},"EnmsIL2fkMGH-whK6Q70iA":{"text":"EXCELLENT!! I took both the swamp and plantation tours. I loved Captain Gary - very knowle","useful":0,"cool":0},"OoetdC0Klz9cs9rjJtuZgQ":{"text":"Had an absolutely great time on our small boat swamp tour. Captain Chris was terrific, kno","useful":0,"cool":0},"Cr1oeqerdDHe_CJLSobGvw":{"text":"Thoroughly enjoyed my time on the tour! The people/workers were very personable and funny!","useful":0,"cool":0},"dFF_0mMpVZvy7qJkSV0tPQ":{"text":"Just went on the swamp tour with Captain Emmett and it was FANTASTIC. Dayna drove us on th","useful":0,"cool":0},"NgdyjeJB084yk91w3Ifc4g":{"text":"I cannot say enough good things about this company! Alfred, the bus driver, was personable","useful":1,"cool":1},"_jzhVwWeBmfcWEZjBLi8NQ":{"text":"What a fun excursion! The tour itself is an hour and forty minutes. Although it was hibern","useful":2,"cool":1},"27jrPsDAYdsF6WbKeTpkAg":{"text":"I went on the swamp tour to Honey Island Swamp and it was amazing!! Captain Nathan had a l","useful":0,"cool":0},"ecAhxkVwa66YmAV-vqCLqg":{"text":"If your in the area you BETTER go to Cajun encounters! This was my favorite part of the en","useful":0,"cool":0},"CehzM8ooIKeFLYTtyT9BMw":{"text":"Your was ok guides was nice but don't sit in the back the bus was so hot I thought I was g","useful":0,"cool":0},"uj7YdUPuAEzbFtA1oMoUhA":{"text":"We had a great tour with CE tours.  It was November so there wasn't too much to see in the","useful":0,"cool":0},"tZS0LELHTBIlJBCh3GBGpg":{"text":"This was such an excellent tour! Way more fun than I expected. Visited New Orleans for a b","useful":0,"cool":0},"3tD0i0fkqnuLiYBAd_5lHw":{"text":"So much fun! Caught a mid-day tour and saw lots of wildlife. Gators, blue heron and other ","useful":0,"cool":0},"8NX9s5kWc7mrffOPOC-SDw":{"text":"John was great!! We wished we saw more creatures... but we did see Alligators, turtles and","useful":0,"cool":0},"vW96xdFq2fyFL7wuRIEQ7Q":{"text":"Henry was the greatest tour guide we could ask for. We brought our family of ten to Cajun ","useful":0,"cool":0},"fUDAmG4WF6iuxaqA8t3dtA":{"text":"This tour was very nice to Oak Alley Plantation. Josh was amazing and provided more histor","useful":0,"cool":0},"iqhwuqTe9xva0KSKG2Ckng":{"text":"I have to be honest, I was disappointed with this tour. The drivers microphone kept breaki","useful":0,"cool":0},"bBTsS3Gh7-_VyM1mzgXxdA":{"text":"Capt. Ron did an awesome job with our group as we toured the New Orleans Swamp! He was not","useful":0,"cool":0},"LWN5ZvmvcJ7bRnTdVCOtPA":{"text":"My sister and I took the city/cemetery and plantation tours over two days. Karen was great","useful":0,"cool":0},"Z_ec0pMBa-eK-PshNdrQGA":{"text":"This was a awesome experience Capt. Chris was very informative and. We had lots of fun , w","useful":0,"cool":0},"gFXdcvsyP8_0dNwpf1wujA":{"text":"Well worth the money! We took the City Tour with Rene and he was fantastic!!! Learned so m","useful":0,"cool":0},"0WiuEDR_D_FccNpZITWrMg":{"text":"Great trip this morning- Butch is great with local history and info. Probably a bit too mu","useful":0,"cool":0},"58X3bGTm6V9CGVN08exZ9w":{"text":"2 tours with this company in New Orleans this week.  The city bus tour was great and our d","useful":0,"cool":0},"PfBGw9bsFGluKL9MyCwCpQ":{"text":"Bus driver Dana and boat captain Ron gave excellent information and entertainment. My wife","useful":0,"cool":0},"Iz7t7YXuJ7L4sBi6dN08sA":{"text":"Amazing tour!!! Authentic, descriptive, informative, and gorgeous!!! We got to see all kin","useful":0,"cool":0},"y7YmvkhqnCVuBfOiQI1M1A":{"text":"We had a great time on this tour. Our process started with the booking. I was able to find","useful":6,"cool":2},"wYJOUgmoBIsOvulV5m5iVQ":{"text":"Our tour guide was Capt. John and he was so funny and engaging! Loved that he provided so ","useful":0,"cool":0},"EoksJHer6T--yhRpYPwwKQ":{"text":"Cajun Encounters did me a great service. They drove me around in a boat through miles of b","useful":7,"cool":6},"InnVlNpX3hY45uyFsh5k7Q":{"text":"Cajun Encounters is really well-run, and they really know what they're doing. Hassle-free ","useful":2,"cool":1},"8JuOxBl3q4ns12xqzXP9ow":{"text":"Tour was amazing! From the pick-up shuttle to the tour itself. Staff was very friendly. Ou","useful":1,"cool":1},"SamfqNvdSlp8QmV7hqC5Dg":{"text":"My wife and I took the swamp tour this afternoon and it turned out to be great!  Captain B","useful":1,"cool":0},"0XlDBwOGPBVX0Gdwh-WroA":{"text":"While visiting New Orleans, it's good to get away for part of the day to experience someth","useful":6,"cool":2},"v0_8M-YRU9_irf-57HGRRQ":{"text":"The tour guides were knowledgible and entertaining.  They offered a variety of interesting","useful":0,"cool":0},"_vzArFVqdLbEWctjC8wosA":{"text":"Great outdoor evening tour. Captain John was fun informative and did everything he could t","useful":0,"cool":0},"9z25v9gaJzfXiD8hRwAwXQ":{"text":"I have been on 3 swamp tours in New Orleans, twice with Cajun Encounters. Highly recommend","useful":0,"cool":0},"ebEsaTE4EPvJsyXU3V9ZVA":{"text":"We had an AMAZING TIME!!! We did the swamp tour, and Luca was our guide(10/10 would totall","useful":0,"cool":0},"llNoDtqo_bcwQ7Paj6qB9Q":{"text":"That was the most horrible experience on a tour ever!! I took my daughter on what I though","useful":1,"cool":0},"d5MHxt5ZZQrs0uB5hq66iQ":{"text":"We did the tour today .. was lots of fun . Even though we only saw 1 gator . But the educa","useful":0,"cool":0},"RYP98mtv2YNJvOCgJj3Ntg":{"text":"Visiting nola 2 days\nI bought ticket for this tour\nA nice guy pick up and  drop-off afther","useful":0,"cool":0},"cUb9n7p65wscC4peYWw6Ug":{"text":"This place was easy to get to, with plenty of parking. They have large, clean bathrooms, a","useful":0,"cool":0},"mb2tcu1EVN11VPHh6P0OkA":{"text":"Nice trip through the city - knowledgeable tour guide - comfortable bus.","useful":0,"cool":0},"AkrtkOnDyS1XyWpyyG-PeA":{"text":"Went on a Swap tour with Cajun Encounters, my Captain was Emmitt , he was a great tour gui","useful":0,"cool":0},"CYDMxEt2aak9kMmZHAAH6g":{"text":"We had an amazing time! Everytime we come to New Orleans it's a must do! We had Captain Lu","useful":0,"cool":0},"-q6SuLotR5WQBHSXtadi3Q":{"text":"We were looking for things to do while we were in town in July and got a recommendation fr","useful":3,"cool":2},"-ghhK_PpUHr5obZKZI5VmQ":{"text":"Review is for the Swamp Tour and Plantation Tour (2 separate tours). \nFirstly, swamp tour ","useful":1,"cool":1},"dqq-3pB59QOzB4zvoTfyNA":{"text":"We went on this swamp tour linked with the plantation tour to Laura Plantation and Oak All","useful":2,"cool":0},"gXBNnl3AF7wpHc_9pDz0yA":{"text":"Great service and wonderful nature!  Despite the rainy day, we saw alligator, raccoons and","useful":0,"cool":0},"xzVMl8POkKF5PGjxPDk0vw":{"text":"Must do swamp tour! Captain Greg was awesome and made the tour very interesting! We saw lo","useful":0,"cool":0},"tOQpC4FW1X5GyLy4avcqZQ":{"text":"Plantation tour taken December 14, 2018. The bus arrived promptly on time at our chosen pi","useful":0,"cool":0},"XZPWq64e8lUcYcO4DMt_QA":{"text":"My husband and I had a great time on the Cajun Encounters Honey Island Swamp Tour!\n\nFrom t","useful":7,"cool":10},"li2IOJv8z3OTQBNjlsFPVQ":{"text":"Can't visit New Orleans without doing a swamp tour! We visited during December so we knew ","useful":0,"cool":0},"VLeIievXZ2cs9TeYGJRA8A":{"text":"This was a pretty good swamp tour! Our guide Stephen was really engaging and funny. All of","useful":0,"cool":0},"jMSgNnuWnxvKVs-J0A-g7A":{"text":"Ok, this was one of the best things we did while in the New Orleans area! We were out in t","useful":0,"cool":0},"YkPEOZLm25ntxiEV1wdPGQ":{"text":"Came to NOLA for my moms birthday and a swamp tour was a must for me because I love animal","useful":0,"cool":0},"hZBnF-N5ZOnFh3afEjpCSw":{"text":"My wife, daughter and I went to Cajun Encountered on Sunday, March and 18th and went out w","useful":0,"cool":0},"F16j99opIrrYvRMGVMcJVg":{"text":"It's not every day that we city folk can see live gators, wild boars, and a bald eagle in ","useful":7,"cool":1},"rG66ATjCkRE20J9geqiICQ":{"text":"first time visiting new orleans and had the delight of having desi as my tour guide. gave ","useful":0,"cool":0},"NTtXYDKGediaCG9bk_-Weg":{"text":"Took a tour with Capt Sonny today and it was fantastic! I was hesitant to book this as I d","useful":0,"cool":0},"pjpPQpee5bvX2mjvE8Q7rQ":{"text":"We enjoyed CAPTAIN EDDIE and his informative banter while being educated about the river a","useful":0,"cool":0},"G0LQlZUSiHMUyGogLninsg":{"text":"Went on a swamp tour today and we had Captain Emmett. He was very knowledgeable and entert","useful":0,"cool":0},"SmkAiDE98MSGWeGAIuhj-Q":{"text":"I loved getting to see the different pieces of wildlife and types of swamp. One downside i","useful":0,"cool":0},"fPdap5TM7FPqu9HyxdqlBw":{"text":"The best two hours of my trip. Captain Luka you are rad. Thank you for a very informative ","useful":0,"cool":0},"ZnFQJ-qIfSJSBqmMjUZJRQ":{"text":"We had an awesome time. Captain Emmet is an excellent guide he was very funny and we learn","useful":0,"cool":0},"Gq8N0Oeq2UuCf3wvXNaBIQ":{"text":"Cajun Encounters was a great experience! It was so refreshing to get out of the French Qua","useful":1,"cool":1},"mYl01KPhpMwneEdwXM5UNg":{"text":"Our driver (Eemica) was wonderful and I enjoyed her repartee immensely.  The reason my rev","useful":0,"cool":0},"8SOHt42a2y8CS1nFG2zFdw":{"text":"We waited for the bus for almost an hour before they picked us up. The bus was comfortable","useful":0,"cool":0},"247KzdUJV9__zwXdFhMAxw":{"text":"I was only in LA  for a few days over the weekend and I wanted to do something I can't get","useful":1,"cool":0},"Pn0ZKIbfY0rEATYYTJ8UbQ":{"text":"My mom and I enjoyed this tour and did see a good amount of wildlife (including a gator, r","useful":0,"cool":0},"LhxSTFXZ_abyMJxL5jQyAw":{"text":"Today we had a great experience with Cajun Encounters Tours. Emicka led our tour to the Wh","useful":0,"cool":0},"9RQzAE-N-m0-mjotYZuerQ":{"text":"DO NOT DO THE GHOST TOUR!  If there were negative five stars for the ghost tour I would ra","useful":1,"cool":0},"AFKGe6qdmQ1fIAQlNYeyAA":{"text":"Great experience from start to finish!! The shuttle picked us up at our hotel promptly. Th","useful":0,"cool":0},"AQQvNRTotQlHX6QNZqEWrw":{"text":"I had an amazing time on my swamp tour with Gary as our guide. I did the VIP experience me","useful":0,"cool":0},"aVleXRibgLaNwxQo9ruyZQ":{"text":"Cajun encounters did fine.  I called the same morning of my tour and they were right on ti","useful":0,"cool":0},"JFe9yIYQw5BY6-8ib9d4uA":{"text":"I made reservations for my daughter and her friend and thought I had purchased their ticke","useful":0,"cool":0},"e_LFziiyrSKs477QbHpGlA":{"text":"Pros: \n- Offered convenient pick up from hotels\n- Boat guide did a good job of navigating ","useful":0,"cool":0},"2zKt2YGsoS1c2BYMUuGRtA":{"text":"We just finished our 1st tour with them today for the city and cemetery bus tour. Although","useful":0,"cool":0},"rvHWWhm4UCMziiYSBDwwXQ":{"text":"The company offers a bus ride from New Orleans to the site, but we opted to drive ourselve","useful":0,"cool":0},"_dntw8YqHCmAknAB0DkFHA":{"text":"While my wife was not impressed at the size of the alligators we thought this place was sl","useful":0,"cool":0},"FeatUOhRzXpA1DZta4bnQQ":{"text":"We visited about a week ago, and took one of the smaller boats with captain Luka. Coming f","useful":0,"cool":0},"0vfWeEHuoGsmjqFIcv8Ayg":{"text":"I was in New Orleans with my family for 9 days in early February, and our swamp tour with ","useful":0,"cool":0},"r34iJh_ldudL7UQ4MaHYAQ":{"text":"We took a plantation tour to Oak Alley and Laura and had the most amazing experience thank","useful":0,"cool":0},"qQhI63PMZ4kwC8ClnEGgog":{"text":"Sonny, the tour guide, and Kimberly, our bus driver, were informative and fun. We really e","useful":0,"cool":0},"iLute4PkdeiYoaIFqszz3A":{"text":"The Challenge:\n\nAs part of my best man duties, I was responsible for bachelor party planni","useful":9,"cool":4},"Nztcc6AvuXX9-QHRMf51Ig":{"text":"This review is for the swamp tour by Cajun Encounters.  We saw swampy area but no alligato","useful":0,"cool":0},"vmKvxTkDKeceQySGL2iTGw":{"text":"My family and I had a great time on this tour. Our guide was super entertaining and kept i","useful":0,"cool":0},"aMMo4240cM40CIhBZlvhAg":{"text":"The Cajun Encounters swamp tour is one of those things that may seem \"touristy\" to you - d","useful":0,"cool":0},"byplJ4752mYW6So0ym2zyw":{"text":"Didn't think doing a swamp tour for a bachelorette party would be so much fun. Request Cap","useful":0,"cool":0},"EshJeqXlSPvqHxgwf9MjSQ":{"text":"Great tours! Very entertaining and informative. I will be sure to book another tour next t","useful":0,"cool":0},"u-QLLwTzjvSHy-uynU1cFQ":{"text":"SWAMP TOUR REVIEW\n\nAlthough it was cool to get out of the quarter and see/ experience some","useful":1,"cool":0},"8Uyb6t7mgxHDSWMny6XDFw":{"text":"Just wanted to say I barely write reviews unless is was beyond measures. First off let me ","useful":0,"cool":0},"n5uhoSInrnxZav8IeRrQ2g":{"text":"We did the 'Cajun Bayou & Swamp' and 'Oak Alley Plantation' with Cajun Encounters and both","useful":0,"cool":0},"iR2RCA07uaQeNPQK6ZwMjg":{"text":"Cajun Encounters was an amazing tour. Saw more gators than we were expecting and saw plent","useful":0,"cool":0},"CnaMYUAOOmKude1t1bG6xQ":{"text":"If I could give them a ten star reviews I would! It was an incredible once in a lifetime e","useful":0,"cool":0},"piQkV5zJV3d4B68zRZVpNA":{"text":"Captain John was so incredible!! He kept us all entertained and educated.  Made our tour g","useful":1,"cool":0},"FmS17Tys3WOj42Hj4HsL6A":{"text":"Tour guide Dan is definitely the man. LOL He was very knowledgeable of the wildlife/enviro","useful":0,"cool":0},"hV7_XWdgwjMqEwdZqrFPUg":{"text":"What an awesome time we had with Captain Eddie! He is truly a comedian that happened to be","useful":1,"cool":1},"oLJP8Ob5964J0eRV3yLytw":{"text":"We took the 8:30am City Tour today with Derek as our guide. Derek is fantastic, funny and ","useful":0,"cool":0},"nbOpb71Sxm0XvRhjB03SNw":{"text":"I was really looking forward to this tour and wasn't disappointed. My tour guide John R wa","useful":0,"cool":0},"2W92qtvch7Ovlv1qWh9-tA":{"text":"Went here in the springtime on a road trip to NOLA. It was one of the least expensive comp","useful":4,"cool":2},"1I3J9f-0nzVZUBR_G6Fw4A":{"text":"I had 2 tours today, Oak Alley Plantation & Ghost Tour at night. S/O to Dwayne our driver,","useful":0,"cool":0},"yR9dGLK8OgdmviNZTIPWfg":{"text":"Thank you Tom C Conrao for hooking me up with info on the best way to get to a landmark I ","useful":0,"cool":0},"jePif13_0vbNP4uKNGS5dA":{"text":"This was an amazing tour. Dana our bus driver was professional and kind. She did not talk ","useful":0,"cool":0},"Q-l61eMjljEoKYuiI06mSQ":{"text":"What a fantastic tour! Captain Stephen Black was very informative and funny! He made sure ","useful":0,"cool":0},"fd5CB_qJTDwiaORHqLd33Q":{"text":"What a great experience. I had really been wanting to see and learn about the swamps aroun","useful":0,"cool":0},"LSyMCDHCXwFEENVpnOqYJQ":{"text":"Best swamp tour in New Orleans. \nI recommend you checking out this place for a great exper","useful":4,"cool":4},"taS0dqgVB6aUnd4C4DzOOg":{"text":"We had Luca as our tour guide and he was incredible!! Highly recommend asking for him spec","useful":0,"cool":0},"o3FYshr2J_IwW2mCXJGChw":{"text":"TC is a good tour guide. Added enough kitch to the serious side of the tour. Knowledgable ","useful":0,"cool":1},"7tcVv9T0e0lVNVZ233zOzA":{"text":"An experience to write home about! I was a little apprehensive about going on a swamp tour","useful":0,"cool":0},"qqZsZY7wK_Dq3VSnoh3qAQ":{"text":"Had a great tour with this company . Jerry and Ms. Karen were great. Definitely recommend ","useful":0,"cool":0},"dYlbaGBqQJNKLYTJGZulfg":{"text":"Cajun Encounters was absolutely amazing and Captain John was superb! We got to see at leas","useful":0,"cool":0},"I7pvgNq6MBiotlImmWvJZw":{"text":"This tour had to be one of the highlights of our whole US roadtrip so far! I chose this co","useful":2,"cool":0},"ZP2KlboemHT0daLe2jaEVQ":{"text":"We did the Bayou Tour with Wade. He was great! He always made sure each side if the boat g","useful":0,"cool":0},"detqkbZr6ChcqZ50gLvYtQ":{"text":"For me it was a long , boring tour. We stayed in the same section of the swap and it bored","useful":1,"cool":0},"Pcjfu0vDEk4szy1Lmdf6RA":{"text":"This review pertains to the Cajun Encounters City Bus Tour with Cemetery Tour. I felt it w","useful":0,"cool":0},"GbzrBmFvB5kFve5hep6f4w":{"text":"Captain Troy was very knowledgeable about the swamp and answered all of our questions. Pri","useful":0,"cool":0},"ETRBXKjtpcXH3TiAYgevEw":{"text":"We had a great time! We chose the pick-up option and it made much more sense than taking a","useful":0,"cool":0},"k-OjeWWkczNzeJF1qTMfHg":{"text":"This was a nice experience. we did the swamp tour.My guy Stephan will give you the tour of","useful":0,"cool":0},"Qdfkigqaa-earuXz0zbkWw":{"text":"Wonderful trip in a bus with A/C. Renee was very well versed on NOLA and a local with grea","useful":0,"cool":0},"s-1UdQDkTMSxRu7bqU3lWQ":{"text":"The Swamp Tour was such a fun adventure! We got to see a lot of alligators, wild pigs, rac","useful":3,"cool":2},"rQJ-as8mWXR70b9MQIggCQ":{"text":"My family and I took a bus tour of the city and one of the many cemeteries in New Orleans.","useful":0,"cool":0},"rwMWyfEYlM0ciStCUV5KYQ":{"text":"I had a miserable Cajun Encounter. First off, don't call to add additional people to your ","useful":2,"cool":0},"OWKQBpq1Z6N9vappJ1eSRg":{"text":"We had an amazing experience! \n\nThe registration process was straight forward and easy. Al","useful":0,"cool":0},"KsQP3kbChmiMcCDw1sTGeA":{"text":"Had a really fun trip from beginning to end with Cajun Encounters! We're picked up and dro","useful":0,"cool":0},"e05GnoRfe_lRsras47n6RA":{"text":"Deeply disappointed in the tour.  Bus was great, but the guide spent more time telling bad","useful":0,"cool":0},"V4sE8_lDljUKsoqjX9yWaw":{"text":"It was our first time going and we will definitely come back!!! Had a lot of fun and our t","useful":0,"cool":0},"wK8UwX3B6Qs933LOS3srEw":{"text":"Capt Jason AKA Capt Clutch was a fantastic tour guide. Loved his enthusiasm! He gave us an","useful":0,"cool":0},"-cOhY1u6NF9t6w7FguKTfw":{"text":"I really enjoyed the tour once we got to the swamp.  Getting there was not enjoyable...we ","useful":0,"cool":0},"7J-EySSWjoOHFYMWAPxaFw":{"text":"We were in NOLA this past weekend and started our trip off with Cajun Encounters. From all","useful":6,"cool":0},"U7s2pTOaxwyIagG3atgRtw":{"text":"The Cajun Encounters Honey Island Swamp tour was even better than I imagined. Captain Al t","useful":0,"cool":0},"NBroeLHo3uO61P2WOzf0Qw":{"text":"I unfortunately got food poisoning and inquired for a refund.  I was refused the refund. N","useful":0,"cool":0},"1RSUv-utYxlYXKdHlI7ldQ":{"text":"This tour was spectacular! Comfortable boat seating.. 2 hours of cruising and learning all","useful":0,"cool":0},"NGc9aQXoYJCzd52TyU1YvQ":{"text":"Visiting New Orleans from California with our 4 kids + grandparents. No one in our group h","useful":0,"cool":0},"he1TGmQqhGNHMdyy4E1c7A":{"text":"Captain Jacob was awesome on the Honey Island Swamp tour. Very knowledgeable. We saw allig","useful":1,"cool":0},"umMoPJv_HnvUA4Zmufm1_Q":{"text":"We took the Swamp tour out of New Orleans.  We were picked up at our hotel in the French Q","useful":0,"cool":0},"NmZZUbpWGypasADrzmmbCQ":{"text":"I did a tour of the Garden District with this company. Not the best experience. For one th","useful":0,"cool":0},"xSKI5z591_q6pp3TVd82gw":{"text":"Capt Wade was knowledgeable on our swamp tour! We were up close and personal with alligato","useful":0,"cool":0},"yCGMHxJdN8Wjd_ZRjAC30A":{"text":"Tour Bus broke down. Was picked up late, sat on the side on the side of the road waiting f","useful":2,"cool":0},"uskBaZie0VfbnVp8rfgnFw":{"text":"Enjoyed the tour. Right mix of scenery, adventure, and education. Guide ( boat captain) wa","useful":0,"cool":0},"CMzpzgTfBOlptd0tF99H3g":{"text":"We had a blast!  The bus ride was enjoyable with Dwane \"the rock\" who pointed out landmark","useful":0,"cool":1},"A6pjMv9ct_8RPamYaOwHlA":{"text":"So, Cajun Encounters has many different tours to choose from. We went with the Whitney & O","useful":0,"cool":0},"n7LgcNw1LgJfHl8nGr4fWg":{"text":"Booked a last minute swamp tour to check out the Bayou & I can honestly say that it was th","useful":0,"cool":0},"wIW1mV2urWf3jlQtQgFw7g":{"text":"Loved our tour. Ray Glass is the bomb! He even gave us good recommendations for dinner.","useful":0,"cool":0},"z1K2DonaJmX7xDnuk1eRMg":{"text":"During our pre-COVID visit to NOLA, my daughter and I were encouraged to book a swamp tour","useful":3,"cool":1},"fQ8tSZSlHcIE2dLonM5T_w":{"text":"This is a review for the swamp tour. We were picked up in front of our French Quarter hote","useful":0,"cool":0},"fd8B8plt6yqQwBzJ4mdFEA":{"text":"We did the oak alley plantation tour and this was a waste of our day. The plantation itsel","useful":0,"cool":0},"7_GEjGenwnugQo7vX5h8TQ":{"text":"Great way to get a little NOLA culture.\n\nSo I went on this tour expecting to see alligator","useful":1,"cool":0},"k8PGB629TmjHUtJ2MyBOlQ":{"text":"We took this tour Feb. 1, 2020. It was cold and the animals don't like to come out and sho","useful":0,"cool":0},"tDegENORQ5tl6EiblhRBLg":{"text":"We had a great time! Our tour guide gave us lots of info and we also got to see a wild pig","useful":0,"cool":0},"7ulwOfwn-xchiBu2Zg_D2w":{"text":"What an amazing adventure through the swamp and bayou. My husband and i loved how J.D. lea","useful":1,"cool":0},"0fplO5D4rJf6zgD4XUulxQ":{"text":"Good tour but the bus to take us us was 45 minutes late. The company said they would leave","useful":0,"cool":0},"k29AO16X3JmV4Lx118p2uA":{"text":"We enjoyed the tour of Whitney plantation, Ali was our guide, he was very informative and ","useful":0,"cool":0},"1ELw81-nuDKuNSDbyqeLqg":{"text":"From the last time I visited, they definitely have improved their facilities and have a ve","useful":0,"cool":0},"YQ2HXCcQAn4YrGN1hmZaZw":{"text":"This adventure tour was awesome. Butch was an awesome guide who gave us so much informatio","useful":0,"cool":0},"snq2zDUnSRou6tOaCGZXog":{"text":"Tour was good, especially the first plantation, Laura. Guide, named Rose, was informative ","useful":0,"cool":0},"6PbhFKTvPwBodhaJl0mhmg":{"text":"Took the swamp tour. Everything was top notch - from the friendly bus driver who drove us ","useful":0,"cool":0},"tZw_0E3SMJzMZ5VotRKsyA":{"text":"I lovedddddd this swamp tour. Our tour guide was Luca and he was amazing. He knew all the ","useful":0,"cool":0},"hn6TnCsQCWTQxNeRv-Q2Vg":{"text":"Alan the driver for our double plantation tour was EXCELLENT.  Hospitable, funny,  informa","useful":0,"cool":0},"-Y-O_gtSal4tuCY1w1WSnw":{"text":"What a blast! I was on the fence with a swamp tour. Did one once in FL, saw some alligator","useful":0,"cool":0},"hZAquvr_J20NXPMr9NmdVg":{"text":"Decided to schedule a swamp tour on a January trip in New Orleans because of online review","useful":0,"cool":0},"cm8nrW8xAZ1an_p2fjklSw":{"text":"If you have some time while visiting the NOLA area, definitely make a stop at this establi","useful":0,"cool":0},"226WZWhN7koYoEpCq72SLA":{"text":"We recently did an airboat tour near Orlando and this tour here in Slidell near New Orlean","useful":0,"cool":0},"cv5lgePUaqiR3Wq8gYxNMQ":{"text":"Cajun Encounters Tour Company offers a variety of tours. Make sure to check out the compan","useful":5,"cool":5},"HYJpnQ-3ttMpWHMLO7j9lQ":{"text":"The tour was fun. Butch was the best!! Learned a lot about this beautiful city! Definitely","useful":0,"cool":0},"N_A2Rpb77EYGg0EjmytHmg":{"text":"The driver missed the mark. She wasn't engaging. Her awareness of her group seemed lacking","useful":0,"cool":0},"2mmEbUjZt4o4VmzYCT802Q":{"text":"I am a 62 year old woman from NYC, who has made three trips to New Orleans.  On my first t","useful":0,"cool":0},"SR79b1clXtf-qmfcL9gBrg":{"text":"The swamp tour itself was great. If that was the entire experience we would give 5 stars. ","useful":0,"cool":0},"S0PHpD2SkdncSFCoVu186g":{"text":"TAKE the CITY TOUR of New Orleans and if you can get JEFF, please ride with Jeff!\n\nThis ma","useful":2,"cool":1},"zlYK217SMFxlHSw2Xm41-g":{"text":"When KP said \"girl, we are going to the bayou, the swamp, to see the  alligators!!\" I said","useful":2,"cool":1},"juvxwmK0MzNoAuRS3FN1EQ":{"text":"Our group had a great experience! Jason was our tour guide. We were able to see a great de","useful":0,"cool":0},"v7LMB69E8T2mUdxhY7DIWA":{"text":"Airboat swap tour is one of the most fun things to do in NOLA. My kids and I loved it.","useful":0,"cool":0},"KecjSgki046xv_xk-ri1fw":{"text":"This was a great tour! We had captain Wade and he was very knowledgeable and knew all the ","useful":0,"cool":0},"OPxxAw7vCT70INIg39s9OQ":{"text":"Had a fantastic time on our Ghost Tour with Melissa!  She is very knowledgeable about New ","useful":0,"cool":0},"qjo0P_5sBhujrFuc89G-Sw":{"text":"We took a tour of the swamp and loved every bit of it. The one we signed up for came with ","useful":0,"cool":0},"85bWV_lKBZmSiQM_QPWnuA":{"text":"Butch was our guide, he was fun, polite and very knowledgeable, at the end of the tour he ","useful":0,"cool":0},"msAEI45xsP4QE9lo1dbHvg":{"text":"Great experience with the swamp tour. Absolutely fantastic. We got to see gators,  raccoon","useful":0,"cool":0},"tGllxFHOeBQwOlv0PkSrvQ":{"text":"A group of us girls went to New Orleans for a bachelorette party and we wanted something f","useful":2,"cool":2},"BlGoAFu17Q26FhdxRzM7ZQ":{"text":"We had an amazing time on the swamp tour. Our Captain was Luka and he was amazing. Not onl","useful":0,"cool":0},"AN_bXjhi2bfs5qBe5hsQVw":{"text":"Okay they gave P and I a window for pick-up time and they were on-time, except one couple ","useful":0,"cool":0},"ZiTZDS_1DdrxAFNhdI-6yA":{"text":"Had an amazing time and saw so many cool animals! Our tour guide (forgot his name I'm sorr","useful":0,"cool":0},"yUVf96bJF4khiYuQZo120w":{"text":"This is a review of Cajun Encounters City Tour.  It covered the whole city, gave lots of a","useful":3,"cool":0},"7yhhbqOHV1KEPIi_yR_5MQ":{"text":"We did 2 tours with them, Haunted walking tour with Nia last night. She's amazing, huge pe","useful":0,"cool":0},"9YYZc8zkUZFHpxdjY6GtXw":{"text":"I'm torn about Cajun Encounters. The older front desk man on Decatur was cranky and rude t","useful":4,"cool":0},"pzenivqeQSQfVAGgnSRYHQ":{"text":"We went on a cold day in February, so we only saw a couple of resting gators barely visibl","useful":0,"cool":0},"DOW02o7_0fF5GTWPRjaGew":{"text":"The tour was amazing! Thank you to our tour guy Capt. Dan!","useful":0,"cool":0},"hLJ1JIW2M4yPmOpsGV1WSQ":{"text":"Amazing experience!!!! I learned so much about New Orleans on the Ghost Tour. It was utter","useful":0,"cool":0},"gDvymaauEDsbxVn_C67IHg":{"text":"We had the best time with Captain John Katz on this tour. Its our first time in NOLA and c","useful":0,"cool":0},"3YCnhWjKRKWzmUBYpZKg6Q":{"text":"I really enjoyed this tour. Our tour guide was very informative, cracked some corny jokes,","useful":3,"cool":2},"duJ25i3XHMJIHk24eJls7A":{"text":"We had a fantastic tour with our guide, John R, who was enthusiastic, funny and very knowl","useful":0,"cool":0},"3nQH3KnYVsfnj7efx6KHJQ":{"text":"I'll start with the positive.......Captain Eddie was great. He made sure we saw lots of ga","useful":0,"cool":0},"V8gFkzX44iYhshkQxtfX0g":{"text":"Butch was a great tour guide! My husband and I are visiting for our anniversary and thorou","useful":0,"cool":0},"CtDjX2fuHi9LvUypeziMMQ":{"text":"I arranged the swamp tour through the hotel I was staying at. Though it cost more to be pi","useful":1,"cool":0},"w-zkBYIXk0psBiCPgxUYFA":{"text":"We were on the VIP Honey Island Swamp Tour and it was fantastic.   One of the best tours o","useful":0,"cool":0},"5s_URc_Am3N7roLA-FAHyQ":{"text":"We found out about this tour company through the New Orleans visitor center.  Its a good c","useful":6,"cool":3},"JsqVbJN1AA6OgE1TP4S6eQ":{"text":"Cajun Encounters is an absolute MUST when visiting The Big Easy! Our girls' vacation would","useful":0,"cool":0},"1v-KkWB5rWbEeCNhJqLDvA":{"text":"Made a last minute reservation to take a swamp tour. Our tour guide Emmett was funny and k","useful":0,"cool":0},"Dv-K65_6GEJCkh35d4hISg":{"text":"Great tour! Got to see all kinds of plants and animals including alligators and raccoons. ","useful":0,"cool":0},"YQwdmeEk9f9KRQY_maGuRg":{"text":"Captain Walker gave us a great tour! He educated us on wildlife and made it entertaining. ","useful":0,"cool":0},"4UE5pAX4Dkv69YL_vIXW-Q":{"text":"100% recommend!! We opted for a VIP tour and we absolutely enjoyed it. Captain John R was ","useful":1,"cool":0},"ZG5_HFKS2eKKx9OaScKQ2Q":{"text":"Highlight of our trip. Our captain was Robert and he had soooo much knowledge and stories.","useful":0,"cool":0},"LPpXErVeqdqhxGQdz6h_5Q":{"text":"Went on the city and  cemetery tour. Butch was our driver and guide very knowledgable and ","useful":0,"cool":0},"HYO7ChBDmN64Z4ytr3KXlQ":{"text":"Captain John was our boat tour guide. He was Amazing,  Knowledgable, and very Hilarious. I","useful":1,"cool":0},"xqnlS9yE5Jrl6pH5EsqxIQ":{"text":"i was really looking forward to this tour. we were thinking of doing the private tour but ","useful":1,"cool":0},"tOykyt_Wt1aC_n7uWrDiRw":{"text":"Had a great experience with my family. Very buggy but as soon as the boat starts moving yo","useful":1,"cool":0},"tytvh0SnmB1PU7o13Q--Ug":{"text":"Loved the staff that checked us in for our tour- they were hilarious and super friendly (Y","useful":0,"cool":0},"s_2LK_qRxOfJd8qxi6WBLw":{"text":"We had a great tour with our amazing tour guide Lukas! He was exceptional and made the tou","useful":0,"cool":0},"jej74Ks5DIZAqNYgcLTvTw":{"text":"Thanks to Luca, we enjoyed a beautiful tour through the swamps. We met some gorgeous allig","useful":0,"cool":0},"HtCGWenM_KKYcXt0hj44Ug":{"text":"It's worth paying the extra money for the VIP tour! The boat we were on was was smaller, s","useful":0,"cool":0},"9tbEbT38hEPmWwQ7MFnvvQ":{"text":"Our captain, Luka, was amazing! He was funny, very informational, and made the whole exper","useful":0,"cool":0},"i_IwL9RCs8Ocl6-AR6cJEw":{"text":"DO NOT USE CAJUN ENCOUNTERS!!! This was for the plantation tour of Laura and oak alley. Ou","useful":0,"cool":0},"idyB84MwwOXDzg3Lgvv4_w":{"text":"The tour itself was amazing. Our captain luka was very knowledgeable and friendly. Super f","useful":1,"cool":0},"7zsBqWM1qjyUzyEPHqk49w":{"text":"We did the swamp tour at 1 PM or so, and thankfully it was an overcast and cooler day and ","useful":0,"cool":0},"YHYezUaE-dIRWeEaZUR82w":{"text":"Just returned from our \"Swap Tour\" that my wife wanted to do AGAIN after 5 years.... We bo","useful":0,"cool":0},"9Y1WO_wKF1vNOumy6Bpvyg":{"text":"Such an amazing experience!  Desi was our private tour guide and was fantastic!  I'd highl","useful":0,"cool":0},"cC4EgNURAVRVXFQIKV31yA":{"text":"We took the city tour the first day we arrived. We had never been to NOLA and we were tryi","useful":0,"cool":0},"iQwz6VrIS0AMcONNmy2qhA":{"text":"What an amazing experience! Our tour guide was witty and very informational when it came t","useful":1,"cool":1},"dlNuL-web5PtHOule3d2iw":{"text":"Swamp tour is not as exciting in the winter, but we did still enjoy the boat ride and pigs","useful":1,"cool":0},"c2qpSEYwXUQun4W3KxKhmA":{"text":"I cannot explain how great of an experience this was. This was my first time to Louisiana ","useful":0,"cool":0},"IggpuQfumPMuahXuQOFuOQ":{"text":"Cajun Encounters Swamp tour is amazing. It was very fun and informative and my boys enjoye","useful":0,"cool":0},"udh1-DRnbZ39_JLIZjRx0Q":{"text":"I realize this is a long review.  The skinny is that my girlfriends and I enjoyed a sunny ","useful":0,"cool":0},"vcScxL9-1taHQhdJTw2SoA":{"text":"This was a really fun tour, definitely one of the highlights of traveling to New Orleans.","useful":0,"cool":0},"GZzWxCzIqy-U8Sq3lQmc4Q":{"text":"This tour company was amazing!  I want to specifically shout out Dwayne, our bus driver to","useful":0,"cool":0},"UOqNrxzOIpd-YYR2rnW8iw":{"text":"We booked a tour for the Laura and the Oak Alley plantations with Cajun Encounters.  The L","useful":0,"cool":0},"x3yn9bQ7A1LqmO5Gu3AXow":{"text":"Such a great tour. We did ours with Captain John and he was so knowledgeable. We saw lots ","useful":0,"cool":1},"3UN2c25uBZnUdgwOsG1HZw":{"text":"Overall a solid 4 star experience. We had traveled to New Orleans without much planning an","useful":1,"cool":0},"jde1-mfolkm7CDz02MQirA":{"text":"Capt Jacob was excellent. He knew the history of Plant life, water levels and all of the a","useful":0,"cool":0},"hiqAiU75SISfB38TkVL7oA":{"text":"Today was so much fun! We got to see gators, wild hogs, snakes, turtles, and raccoons! Cap","useful":0,"cool":0},"TjJ-puDTdMocnAdkq_eBNg":{"text":"We absolutely loved the experience. We had Luka as our captain and I cannot recommend requ","useful":0,"cool":0},"0zuNIlW-tcoyF-MM0_uzVw":{"text":"We booked the GHOST TOUR with them and it really wasn't the best. He did know where to tak","useful":1,"cool":0},"jPCziPhy0TrjwHqmXxajUw":{"text":"Ms Loraine was our bus driver who picked us up from the Fairchild BnB and she was THE BOMB","useful":0,"cool":0},"yJbjaKUPPptXlDeim3Jhhg":{"text":"Most of our vacation in New Orleans this summer was rainy for some part of every day. But ","useful":13,"cool":11},"Thhna1FnagDGfiaNZpg0ww":{"text":"And few friends and I took a tour with Cajun Encounters and it was an awesome experience. ","useful":0,"cool":0},"pFIxipQD_q1Je_cW6ZiP_Q":{"text":"I was really disappointed by how this company is handling COVID. The confirmation email cl","useful":7,"cool":0},"3Z4nfhEvyKvaZxZJuAQoEQ":{"text":"I first went on a Cajun encounters swamp tour in Aug. 2016 with my husband and we loved it","useful":11,"cool":0},"4-XV66IsUiyf-MqmzUiF7Q":{"text":"Really really enjoyed our tour got to see a lot of alligators turtles wild hogs got to go ","useful":0,"cool":1},"bvWO3gnvnACaQZXj5JP3vg":{"text":"12/7/18 tour pickup was scheduled for 8:45a, the driver was almost 45 minutes late.  The w","useful":0,"cool":0},"UIkrUcLslLU1T1hUL98r2A":{"text":"General disrespect for the animals on this tour that was disturbing. Our boat captain taun","useful":0,"cool":0},"ma01ROZ6SCgy5-B6GnT1pw":{"text":"Captain John R is a very knowledgeable expert on this massive swamp. Swamp raccoons and bo","useful":0,"cool":0},"j6axRTZbwMtrYyloGOCdEA":{"text":"We were highly recommended to do the Swamp Tour.\n\nUnfortunately, the day we went it was co","useful":1,"cool":1},"1WZfN5pmnFE1xrTo_RQHdg":{"text":"My friend and I had so much fun on the ghost tour! It was informative and entertaining at ","useful":0,"cool":0},"sbF_kxf0La8-4uZkeQ03lQ":{"text":"This was a great tour! Stephen was our Captain and he was great!  He told us a lot of hist","useful":0,"cool":0},"tyc6siVQFrD6jsaRSnkzSA":{"text":"Great tour company!! Our guide (Dezzy/Drezzy) was so knowledgeable about the local land an","useful":0,"cool":0},"irFw7L5uI_x3O66eDQdyKg":{"text":"The ghost bus tour was amazing!!!!!! Malika was sooo knowledgeable, she's a fast talker bu","useful":0,"cool":0},"Ir-AmxHBMx_LfusA2stSbg":{"text":"My friends and I really enjoyed the Legendary Walking Tour.  Our guide was very knowledgea","useful":0,"cool":0},"T8G813NEjZ74E1PPM2K4pA":{"text":"Amazing experience! Would definitely recommend this tour. Captain was very nice. We got to","useful":0,"cool":0},"OF7LwcDLnHrN8Fs3jJYUwA":{"text":"My boyfriend and I wanted to do something super touristy, so we decided to go with this sw","useful":3,"cool":0},"iq-Y_UO3QweO7XbO5QrKYA":{"text":"I had such an awesome time today at Cajun Encounters Tour Co. First off the tour bus ride ","useful":0,"cool":0},"tL4-TFtYyRxYlq3qQ6xGtA":{"text":"We took a shuttle bus tour of New Orleans and St. Louis Cemetery #3. Karen was our tour gu","useful":1,"cool":1},"d6nOZHHTkTRLqRYIJ4wbJQ":{"text":"We really enjoyed our swamp tour. Bus driver, Scott, kept us entertained on the bus drive ","useful":0,"cool":0},"enVGksQAYwmEAK7qIHUIxg":{"text":"I'm a senior who went to NOLA with my 18 year old granddaughter for 6 nights.  (Just so yo","useful":0,"cool":0},"DtpWmdNXK7lMTT0sGw-eaA":{"text":"Stephan was our tour guide and he was fantastic. Our family has a wonderful time and we le","useful":0,"cool":0},"-zahu2kYueaIY3jhzNJqVg":{"text":"Such an amazing tour! Our tour guide Captain John, was absolutely amazing, hilarious, and ","useful":1,"cool":0},"5BO3KwWlA1JzArE1z5VJQQ":{"text":"It was an awesome tour. We had Captain Judah, he was excellent. The boat seems pretty safe","useful":0,"cool":0},"Yd6LOLhcSj8zZTs-aICSfA":{"text":"First I was skeptical because I couldn't figure out what I would enjoy about riding around","useful":0,"cool":0},"qwE0djY5ECh8zj8pok-5Ig":{"text":"I can't remember the name of the Captain but he was a cool dude, cracking jokes and knowle","useful":0,"cool":0},"mFvG42ssOKRCpUOPhbcKpg":{"text":"SWAMP TOUR REVIEW - Ride arrived at my hotel 45 minutes late, after calling twice to find ","useful":0,"cool":0},"4rF5ha6AyKXXP8z51cX53w":{"text":"Swamp tour was fantastic. Alligators, snakes and raccoons.. on my! Wish we had had the ple","useful":0,"cool":0},"s51OMlg7EQUooiY6Q1mExg":{"text":"CAPTAIN WADE! Thank you sooo much for an amazing tour! Highly recommended!","useful":0,"cool":0},"Gq_umyqq7hKcLd1JqVq6pA":{"text":"We booked the Oak Alley + Laura plantation tour, Swamp Boat tour, Ghost Tour and crossed o","useful":0,"cool":0},"Vz4pXi-SsomGHqn8dZjMZg":{"text":"Our tour was fine but it was supposed to be a tour of the \"Garden District\" and we spent o","useful":0,"cool":0},"-d1x8Vx_0X3ZJw5qonbz_g":{"text":"We thoroughly enjoyed our tour. The pickup was easy and efficient and our driver Dwayne \"T","useful":0,"cool":0},"EYNIag4BgLK4_ZUXpTTceQ":{"text":"This tour is amazing! My partner's sister and young nephew came to visit Nola, and we were","useful":5,"cool":1},"rygx1bgsP7xAN4JMt6ekrw":{"text":"TC and Peaches were our guides on a ghost tour.  Great information and very entertaining. ","useful":0,"cool":0},"NLr21aJ0lj6uDRUl9WOTww":{"text":"We went on our tour this past Saturday and had Capt. Ron as our guide. First of all, booki","useful":0,"cool":0},"ztcWSsiIWnk-rcRXuf0jRw":{"text":"Great time out on the water!! If going I would recommend getting the ticket with transport","useful":0,"cool":0},"WRdwTx4KaqVFuM2S7KbLNA":{"text":"Thank you Captain JD for an amazing experience at the swamp and bayou! We enjoyed seeing t","useful":1,"cool":0},"afzAtM3D8IOt9JtYVjGagg":{"text":"Great company, awesome staff.. We purchased the swamp tour with Cajun Encounters and it wa","useful":0,"cool":0},"XFV3FU6RJxI-NiDtbM67gw":{"text":"Had an awesome time on the swamp tour with my wife. We had Captain Everett as our guide. H","useful":0,"cool":0},"pKBD0sxpx8PSD_CbymV_Ig":{"text":"It's not everyday you find yourself in New Orleans on a bayou tour. But when you do, make ","useful":7,"cool":10},"jj8uw-sYNE5_FCTN3OeUIw":{"text":"We decided to do a Swamp Tour at the last minute and fell into this tour company. I never ","useful":1,"cool":0},"3OKulnxIlyeZsP9FrDSacQ":{"text":"The tour was ok and the guide knowledgeable and kind. But he encouraged to a lot of talk a","useful":0,"cool":0},"NjPM3ki3vxZPogihIfFcDw":{"text":"Came out on a beautiful day in the off season for seeing alligators it seems like. But sti","useful":0,"cool":0},"rY6ajK7WBvIhIeSwD9CwiQ":{"text":"Plantation tour was good. Not great. Do it once if you want to learn about the history of ","useful":0,"cool":0},"dhf44MPgK8iJFuU0jPT_Tw":{"text":"Awesome swamp tour even with pouring rain for the 2nd half of it. Captain Emmett was aweso","useful":1,"cool":0},"IPmExPWHjpltz__lHzDCuA":{"text":"Went on the swamp tour awesome experience , Capt Jason was super informative and made it a","useful":0,"cool":0},"h99gxR2oY26qwiygSCEr4A":{"text":"Woohoo! Anyone wondering whether to take the day or night tour? Lucky for you, we took bot","useful":9,"cool":1},"yWWf0lbsu-LdaeADq38omQ":{"text":"Honestly I could give 0 stars if I could. The tour guide (Kristen) started our 2 hour long","useful":3,"cool":0},"Y9zG9_bKD_mSY8jQhvUDjA":{"text":"Nate was a fantastic bus driver/tour guide and Captain Everett made our swamp tour a blast","useful":0,"cool":0},"ONJ8gQuRFLLyzmAKJjgEQw":{"text":"Amazing tour. I was skeptical. But my husband wanted to go, and since we are in our honeym","useful":2,"cool":2},"Mt6cugHy0t4h2QMhIBifhQ":{"text":"I booked a tour of the Garden District two months ago and got an email confirming my reser","useful":1,"cool":0},"qxbIk6DCCrGt-Z99kdGnyg":{"text":"Renee was an outstanding tour guide. He had all the answers and tons of information on the","useful":0,"cool":0},"SWztOlpVB-QK80kqYPT6mA":{"text":"Before visiting NOLA I read a lot of reviews between the different swamp tour companies. T","useful":0,"cool":0},"BdxxSKsvwQgUGfqJNxMcFQ":{"text":"I absolutely loved the tour. Jennifer was our tour guide (for ghosts and vampires) and she","useful":0,"cool":0},"v7Qh2ezENd62wpDsRSwHIQ":{"text":"Captain Bary is amazing. Please give this man the cooler !! \n\nHe was extremely knowledgeab","useful":0,"cool":0},"eU9RRiKfgSTeladxhDwy6g":{"text":"Loved the small boat tour with Walker!  So knowledgeable- respects the environment! Steve ","useful":0,"cool":0},"KzGPneAfNH7ImRqJjODAGw":{"text":"Best Tour, Capt. Luka = Awesome Sauce!\nOne of the best tours my family has ever been one. ","useful":0,"cool":0},"cSG2gLYqBJoXpIDyNbxaXA":{"text":"We did the 330pm swamp tour in August and it was an absolute blast!\n\nWhat we expected:\nSee","useful":1,"cool":0},"ODVui2yT41YpKH9s6gl12g":{"text":"SWAMP TOUR REVIEW\n\nAlthough it was cool to get out of the quarter and see/ experience some","useful":3,"cool":0},"LQ_Dxide1YCJQcpnM_3CEA":{"text":"Great experience we loved captain Luca! He was wonderful! so engaging and kind!!! We had t","useful":0,"cool":0},"9cMBmvrrt3tMBrBboE4n5g":{"text":"My fiancé and I took the city tour with Rene. This was one of the most enjoyable experienc","useful":0,"cool":0},"G-7Yc0NO_BkNHdqXTAv6tg":{"text":"Took the swamp tour with Captain Rob, and had such an awesome experience. He's very knowle","useful":0,"cool":0},"3I3if__o3TYv5gZbhRhQmg":{"text":"Rene'(not sure how he spells his name:) did an amazing job of giving a bit of history alon","useful":0,"cool":0},"slGnF_uX7eyAEbEvRvUldQ":{"text":"Great!!! Absolutely great.\nDon't look no further.\nIt hard to see how they should improve t","useful":0,"cool":0},"S4lR0wiAAmvczzxvzvm2Qg":{"text":"They offer all kinds of tours - swamp, haunted, plantation, etc.  We went with the swamp t","useful":0,"cool":1},"WaNJyROjvAQ8B_1VIGXuYw":{"text":"So one of my favorite movies growing up was Waterboy starring Adam Sandler and I was alway","useful":9,"cool":9},"BoYHBWxwg77BoapIK7ztDA":{"text":"We're not ones to take tours but we sure are glad we took the City Bus Tour of New Orleans","useful":0,"cool":0},"StJZHe6tes2WmdBLGfU00w":{"text":"Super organized and educational.  Great guide, real in-depth your and worth the time and m","useful":0,"cool":0},"FwU777NLssc0uXqlYeWXkg":{"text":"Capt. John was our guide when I went and it was awesome! Took us to great spots while shar","useful":0,"cool":0},"CslAWaG7in7jiWJ1X-FHCw":{"text":"Stephen was an awesome guide! He made the tour fun and informational! I have wanted to do ","useful":0,"cool":0},"bmWutJ-mYuNoXc7jSM5ENQ":{"text":"We did the swamp tour. So happy they were able to pick us up and drop us to our hotel. Cap","useful":0,"cool":0},"A333b26GSLt4Eq-gu1CPSg":{"text":"Today was the second tour I've experienced with Cajun Encounters. The first time was 5 yea","useful":0,"cool":0},"KZDoVy6NOHyLkjo71c6PMA":{"text":"I guess I'm not a tour person.  We thought the city bus tour was a bit long.  The st Charl","useful":0,"cool":0},"nHOse-T2yF7n85_rAIHojw":{"text":"This tour was excellent! Our guide, Luka, was wonderful! He was so knowledgeable and so ma","useful":1,"cool":1},"S7vN6LFXITRl_LrQMahsjA":{"text":"So glad we took this tour ! Our guide was educational as well as entertaining! We learned ","useful":0,"cool":0},"n5pxNIcUogdaCDl02Lir8Q":{"text":"I wish I can put Zero stars . We booked a trip the the Bayou . Our tour was supposed to st","useful":1,"cool":0},"1HyS5mJqN2lG0yvMx2D6Og":{"text":"The tour starts at a shuttle in New Orleans that roughly takes an hour to the actual tour.","useful":0,"cool":0},"bS9GdnmVM5MtnFnGGG49iw":{"text":"Today I went on a tour of the city that was hosted by a wonderful guide.  The problem is, ","useful":0,"cool":0},"2zSpsS4phkwT16PtnZpEcA":{"text":"Great tour today with Butch in New Orleans. Saw lots of New Orleans and he was very inform","useful":0,"cool":0},"4pGZ0n4yIZELxvNUEtgRnA":{"text":"Swamp tour \nBring BUG spray! These native guides have been running these waters all their ","useful":2,"cool":1},"kGi2Dvylv1ubfew6Ey7hgA":{"text":"Nice tour, staff are friendly, guide did a great job. We saw a couple small gators, wild p","useful":2,"cool":1},"CdjoagcPQwQLXQ5jUBOM9w":{"text":"We were picked up by bus close to our hotel in the French Quarter, and taken to Slidell. T","useful":0,"cool":0},"g6g8151HQG5qNJRrGLAiuQ":{"text":"We did the swamp tour. Captain Greg was awesome. We saw gators, wild pigs, birds, turtles.","useful":0,"cool":0},"j9jKlBkjVCh6SLOW3RFuKA":{"text":"Pictures do it justice! Great family fun and a thrill for anyone in the area, fun local st","useful":0,"cool":0},"on21d1D1x2pWL9FT--hrmg":{"text":"Want a PRIVATE TOUR? DO NOT BOOK WITH CAJUN ENCOUNTERS! I probably should've gone with my ","useful":0,"cool":0},"_xiAvUvz47fv-M2Vm-SCeA":{"text":"I liked this tour a whole lot. The guide was cool, and quick with information. I gave 3 st","useful":1,"cool":0},"mEKwweXk7LvNbBW5ns8yng":{"text":"LOVED IT!!!  CAPT NOLAN IS THE BEST!\n\nNow that I am done shouting, let me begin by saying ","useful":1,"cool":0},"m2VmGzMsQqBDAbrk9OARUw":{"text":"So we did the tour, driver and guide named Butch was very affable and informed. He was ent","useful":0,"cool":0},"fTpmQiAclzpQBXpArKCIXw":{"text":"Very frustrated! They overbooked the bus and I can't even sit with my mother. They put us ","useful":1,"cool":0},"wj6C7jEnV-LQYCZI1_q8-A":{"text":"Our tour guide was nice, but lacked the charm to make the experience notable. Do not take ","useful":0,"cool":0},"Ba4RoL1jyFyrO5osJqktRg":{"text":"It was a last minute decision and Cajun Tours were very efficient in handling our tickets ","useful":0,"cool":0},"sdK6ZV6i72MiKG0KoplvSg":{"text":"We had a blast on today's tour! Captain Sunny was great; very knowledgeable and very funny","useful":0,"cool":0},"ovId4oKatRCMfGXkzmlpUw":{"text":"Great tour! We had Captain Al. Even though the wasn't gator season we were still able to s","useful":0,"cool":0},"ii9Uh7JAySAhUVSkcbfJEQ":{"text":"Our trip guide was TC Elliot, and he was fantastic.  He really wound the history of the ar","useful":0,"cool":0},"29PJ24vF5twDSL9OwouAcg":{"text":"I would for sure chose this company if you're looking for a great, reputable swamp tour. \n","useful":0,"cool":0},"s0vHS29SS4-kjrCQzR69GA":{"text":"I just took the swamp tour yesterday- such a great experience! Our bus driver and boat cap","useful":0,"cool":0},"nVy6FPk61eYe9RX5WcwTQg":{"text":"Had a fantastic time on our swamp tour. The swamp is incredibly beautiful and our guide,  ","useful":0,"cool":0},"-gq9rjD3_LE8rZjsk_Wj0w":{"text":"This place was a lot of fun. I did not actually book our tour. We were on a bachelorette t","useful":0,"cool":0},"h08xu-GO1V6bzeuR1t8Tag":{"text":"Came as a group of 6 and we loved it! Captain Chris was our guide and was energetic, humor","useful":0,"cool":0},"Zq9UI1JscHmZXoJlItalKg":{"text":"We went to NOLA for my friend's bachelorette party and this was one of the activities she ","useful":3,"cool":0},"jy9HGAhbsJItvuXp7h89sA":{"text":"We took a swamp tour through this company and I highly recommend choosing them. Everything","useful":0,"cool":0},"8F2uC-Hkr06eO1oXJNmHAw":{"text":"We did the city tour that took us to the distillery and the cemetery and of course drive t","useful":0,"cool":0},"z-9ucsqYoVk-fBMArVJDyg":{"text":"Darius is his name! He was fabulous. Very very knowledgeable about pretty much everything.","useful":1,"cool":1},"XwEqF9Bds5nnNAILfoROoQ":{"text":"It pains me to give this two star review because I had overall a great time at Cajun Encou","useful":15,"cool":0},"_JWCLL3iLNbGmFZrnPrHvQ":{"text":"We booked the Honey Island swamp tour for a sunny October afternoon. The booking process w","useful":0,"cool":0},"uaz9T5jh00tuPmLq1CqIkA":{"text":"At the very top of the list of most enjoyable excursions we experienced while spending Sis","useful":0,"cool":0},"2D3ODtf6wiinWbnnjqzuyQ":{"text":"Great tour! Didn't see any alligators but learned a lot of history! Highly recommend, enjo","useful":0,"cool":0},"0P__QVUCRocjK67Og9yIhQ":{"text":"Great tour! Knowledgeable and snarky boat captain who was hilarious and fun! Got to see wi","useful":0,"cool":0},"rGaC-Q6ixD-YfDyaIPtXSQ":{"text":"We went on the French Quarter and cemetery tour and the Swamp tour. Our French Quarter gui","useful":0,"cool":0},"Y6R5P961f5kdQ__vzQx6Ww":{"text":"The bus was so hot air conditioner didn't work very uncomfortable","useful":0,"cool":0},"SauxAMaiKmTheZXkLXX4uQ":{"text":"Make sure to ask for Captain Everett! Very entertaining and informative. We saw alligators","useful":0,"cool":0},"VSGcos88PxeM_DU_Oo2N6w":{"text":"Decided to do an ailigator tour in the bayou. Can't get anymore New Orleans than that. It ","useful":2,"cool":2}}