{"tA-yBv5FwcXx_8xuaBdarg":{"text":"Love you Ruth! Love your \"southern\" hospitality. Thank you so much!!! Totally recommend th","useful":1,"cool":0},"9xJB5ZEfanEqdn4qLqrChQ":{"text":"Eli was great!  He's very engaging and knows his way around very well. We called and withi","useful":0,"cool":0},"YHqVf44er7QkTuF49X848w":{"text":"So it's 3am, your feet are sore, you barely have a voice, still have a drink in hand and p","useful":1,"cool":0},"ZS-YzmEOYUti6iule57Rrw":{"text":"I was trying to get a pedicab home tonite to the CBD from the French Quarter when I approa","useful":0,"cool":0},"6Nj6XF_zLr2Uolyap1ojtw":{"text":"Why take a regular a regular can when you have pedicabs?! The answer is: No reason!!! Our ","useful":3,"cool":5},"1xNol0EASQIkw7ZePr0gKg":{"text":"Great way to get around NOLA and the french quarter. I had a friend recommend them when he","useful":4,"cool":2},"HLFW1GYHXpK2pjML0TKaqw":{"text":"We had the best experience! We enjoyed getting to know Meg (smart cookie) as she pedaled u","useful":0,"cool":0},"WoLbA1Lf0h8tHi-oZtAYgw":{"text":"We have used this service the whole time we were in New Orleans and every rider was excell","useful":0,"cool":0},"PuD8XXwgZNjjgR9_fpeVlg":{"text":"Great ride! Super fun way to get around NOLA. We called and made arrangements since there ","useful":0,"cool":0},"C_6_rf-0E-rEXCW4PRZRbA":{"text":"We have used this service the whole time we were in New Orleans and every rider was excell","useful":0,"cool":0},"yPAOYuMZ5qju7YxOKqhYig":{"text":"If you want to see the city, I mean the real city, not just the French Quarter then you ne","useful":1,"cool":1},"fBqqQk2gYptrNEtxOGrfog":{"text":"Awesome, friendly, fast, knowledgable peeps. Worth the money.  They can give pointers abou","useful":1,"cool":1},"mAzBmb-jtQlFzKE50DUx8A":{"text":"first time for me in a bike taxi! will absolutely do it again! Jessie took us for two awes","useful":2,"cool":1},"TV5gQRw1qer8eAN8qt_Nmg":{"text":"There aren't many times I would think to yelp a pedicab driver but this trip was made extr","useful":5,"cool":4},"TEOk7kT_0y6enDewE9xElA":{"text":"Bike Taxi saves the day!  We stayed in the quarter and pretty much walked wherever we want","useful":2,"cool":0},"sonCTG2CkltXpMa-F4hw-A":{"text":"We got a ride from Lindy during our anniversary trip to NOLA. She was friendly, profession","useful":0,"cool":0},"9pbQpIQfcfz-c2T_P7Oshg":{"text":"My first pedicab ride was awesome! My best friend Jenny and I had Christian take us from R","useful":3,"cool":4},"yFDOZwd0HKudPBpd93vBUg":{"text":"The pedicab was a great experience, made more memorable by our driver, Russell! He was rel","useful":3,"cool":3},"cLl61G75pIy5KbZkkypFcg":{"text":"Avoid.  Hail a cab if you can't walk.  It's faster, cheaper, and the local drivers will gi","useful":2,"cool":1},"PMqg79jJzg70y7d80YLccQ":{"text":"Katie hauled our big butts around.  She was wonderful.  Very accomodating and knowledable.","useful":3,"cool":2},"iIY6NFpo_3LDJWR0PQSu1w":{"text":"Although we had a super fun time in New Orleans, by our 2nd day our feet were KILLING US! ","useful":1,"cool":1},"iDKGCtMwqyy49BwYUI4uQg":{"text":"This terrific company is working Voodoo Fest, shuttling people from the entrance to City P","useful":5,"cool":5},"1304m0M7mZbdISZDKQ0M0Q":{"text":"My wife Kim and I spent three days in New Orleans after attending my daughters High School","useful":1,"cool":1},"FIDz6wuEP77fYXaG2krcEw":{"text":"I hired Bike Taxi Unlimited to provide transportation for a corporate event.  The logistic","useful":3,"cool":3},"yIagpFaKokMg-h0xVfyalQ":{"text":"The driver was great, service was fast but the cost is extremely high. Took cab home from ","useful":1,"cool":0},"WfHMkhwuFYspiclzxevL9g":{"text":"Ever tried to get a ride to Marigny on Mardi Gras weekend?  The city is practically shut d","useful":4,"cool":3},"dn3cM4Px6TkCcKub5BZH7A":{"text":"Easy way to get sore feet back to the hotel through the French Quarter. Ruth was great!!","useful":0,"cool":0},"_GjrSXAu_oiDl2D23lDobQ":{"text":"DO NOT PAY WITH YOUR CARD!!!\ndude charged me $24 then doubled it after I signed. I didn't ","useful":1,"cool":0},"JUr76lPtGCshiTGOOqCaCQ":{"text":"Classic bike taxi. Super convenient from Jackson Square back to the hotel. Very friendly &","useful":3,"cool":1},"Hpxv3n7DtQRUoy4h5OBKQA":{"text":"Christian was awesome and even for someone who isnt a tourist, it was a really cool experi","useful":0,"cool":0},"XPgH6oHnmZ6MLYu5qk5EKA":{"text":"My wife and I used the pediatric while waiting for the trolley.   Trolley was taking too l","useful":1,"cool":1},"iNwJg7dfgK_wDq-6UMunBw":{"text":"Long overdue review, called and asked for a taxi for two hours to tour NO. Asked about cos","useful":0,"cool":0},"PIRGCUx7iXqwxUy1uAktoA":{"text":"A great alternative to walking.  We decided to pick up a pedicab to get from the French Qu","useful":4,"cool":1},"tRcsWl3DrQp4aNTv-nwQqA":{"text":"I wanted to see the sights all around the French Quarter but didn't want to walk it!!  I s","useful":1,"cool":1},"bV4Lqv76v_p_xLaYC68hmw":{"text":"We had a fantastic experience with our pedicab. We used one during Krewe du Vieux, and wer","useful":2,"cool":3},"qXKM296rKIV9GWss9KWK6w":{"text":"We had such a great experience with this pedicab service.  I had previously had a bad expe","useful":0,"cool":0},"BMZv8BAptvIf9nymsEUdlg":{"text":"What do you do on a day in New Orleans with no plans?  You sit in Lafayette Square until a","useful":7,"cool":7},"JEXIS97EScxCyxxmKQHbxA":{"text":"We absolutely loved our bike driver! She saved our feet from aching with our heels on. Wen","useful":0,"cool":0},"CpzhHqYwjT0JH_69flHOKw":{"text":"I had the absolute BEST experience this evening. I had never had a Pedi-cab ride before.  ","useful":1,"cool":0},"cBkOdRksiYOmSieg5bCmLA":{"text":"I had a driver named Brett (McInnis, is his last name) was awesome. I highly recommend him","useful":0,"cool":0},"N3WhVsKAKaTrPdwT9mKz4w":{"text":"Our cab driver \"drake\" was awesome. He was very resourceful and knowledgeable and kept up ","useful":1,"cool":1},"k7Nh6mCoJwn8PdRxPA_ILw":{"text":"Stanley was awesome! Great experience all around. We took an extra long tour because I'm i","useful":0,"cool":0},"hpJPXpuxlv3DTS1vxoKmIQ":{"text":"sustainable transportation + friendly service = great way to get around the fq\n\nI took the","useful":4,"cool":4},"aNhpJLyhC2lKhiKRFVs9Cg":{"text":"11/13 after the Saints vs Broncos game we decided to bar hop and we use this company frequ","useful":3,"cool":1},"HUoJc2E5bWghRSQMAADNog":{"text":"Best way to travel in New Orleans!!! The drivers were great!!!!","useful":0,"cool":0},"mLwnErIjMgWXCr3HjfI3Pw":{"text":"My friend and I rode with the most incredible driver tonight named Christo! We had been wa","useful":0,"cool":0},"2FA7OIBEJFWfP8M7IUT2YQ":{"text":"Tony was awesome! We jumped on and asked for him to take us to the best steak place he kne","useful":0,"cool":0},"tFWjJ4c8tMuTSJOa8iuBSA":{"text":"Fun, easy, and personable way to get around New Orleans! I wish we had figured this out ea","useful":7,"cool":6},"0iRX8Z5MpLVX8T-FineW6g":{"text":"Brooke was so nice to us while driving us around the French Quarter. She also gave us the ","useful":0,"cool":0},"D44xG3djKQuttUUxUcUWxw":{"text":"Bike Taxi Unlimited is great! We needed to book transportation for our elderly guests to f","useful":4,"cool":5},"_SvO-dcCLXMDtBi4xN-BFg":{"text":"After dining at Muriel's, we decided to try a pedicab to test them out. That was a very go","useful":6,"cool":4},"aKTkDNxdg7_Ci1SIvWb0vA":{"text":"I came to New Orleans for a conference,but was unable to go sightseeing due to an injury. ","useful":0,"cool":0},"6zkIQl8tsIzNwnFCFWNdXw":{"text":"This was the most surprisingly awesome part of my trip to New Orleans, and that is saying ","useful":0,"cool":0},"OiA0dY4R697yT1lR8qMJCg":{"text":"The best way to get around Nawlins'.  Forget cabs, taxis, uber, lyft, etc.  If you've scor","useful":3,"cool":1},"hrXgmr9yehA5nHm5npb7Eg":{"text":"We had a mixed experience with this company.  \n\nPros: Call answered quickly, driver came t","useful":0,"cool":0},"CPpN0jCgZWZ304iE7i7igA":{"text":"One of the great memories of my first visit to NOLA was the trip with Brooke. This lady ha","useful":1,"cool":1},"0S5U2QRIULUvZh-umSmHSA":{"text":"This was my second time in New Orleans & I was determined to get down and dirty with some ","useful":3,"cool":3},"zuS8bbl3SV5VaFqyeC2_AQ":{"text":"Loved our experience using the pedicab service yesterday!!!\n\nMy friend and I decided to ta","useful":8,"cool":7},"P8Zx8Vaeqwpd84T5jrRj-g":{"text":"Caught a ride from The Deutsches Haus parking lot on the way to Jazz Fest.  $8 to ride to ","useful":5,"cool":3},"A1Y6urKzXUcxo9-Q8uiknA":{"text":"These guys are awesome! They don't take a longer route than necessary and they are friendl","useful":0,"cool":0}}