{"HKKsMphbI2-JztAfmb1fcg":{"text":"3/5 standard\n\nso the fact that this stays open til 10 will make it a solid option for \"hea","useful":1,"cool":2},"y80aDTm1mrw3hzxdAQT4ow":{"text":"The food was horrible. No taste at all ! The only taste was pepper to much pepper. It was ","useful":0,"cool":0},"3fUeVcNuy0cWuEi1ufeT6A":{"text":"I am here daily delivering for doordash and most employees are extremely helpful.  Today i","useful":0,"cool":0},"Ba2ZBJFDgpCK1uCtK8oD3g":{"text":"It's always a choice to make when deciding whether or not to order food from restaurants d","useful":0,"cool":0},"e1zkwNqaA2vSa7L8UeyH_w":{"text":"Great burrito bowls, but was shorted on chips with my delivery. Got one order, instead of ","useful":0,"cool":0},"3EJrnKXCqF3veh1oF15new":{"text":"This is a new location on magazine street where all of the cute boutiques and restaurants ","useful":0,"cool":0},"LtjqhnEfxEdGh3NQIOtdNA":{"text":"EVERYTHING IS UNDER $10\nEven a carne assda burrito loaded. I had the taco with refillable ","useful":2,"cool":2},"cw_b-s6tQHYD774NClYsOg":{"text":"This place basically gives you half a bowl.  Don't bother. \n\nYou'd think lettuce and chees","useful":0,"cool":0},"8TAeKy1YBqleIeezyaIr0g":{"text":"Ordered a burrito bowl and asked for fajita peppers. Onions and peppers were raw! Normally","useful":0,"cool":0},"cQAeoHEWh_0rARGBr-10qw":{"text":"Visited this location on Monday evening Nov. 30th. Unfortunately the female working the se","useful":0,"cool":0},"G28mZsBWjMKIKKogjC_Wwg":{"text":"We were served the sloppiest, wet burritos that were so soggy you had to use a fork to eat","useful":0,"cool":0},"hkD9905WEsxE-a6L0R9QHA":{"text":"CHIPOTLE CAVEATS \n1. Queso: You can add cheese to any item free but Queso costs $1.25 more","useful":2,"cool":0},"IiPO6Kcvs_M0tD2JMTp0_A":{"text":"Glad to have a Chipotle in the neighborhood.  Staff is friendly.  But, writing this post t","useful":0,"cool":0},"jHgEWJKhFqcx2CQfOm3k2A":{"text":"What's there to say. Chipotle always hits the spot. Food is quick, typically warm and fres","useful":1,"cool":0},"DW03n3ilod9kvABH-RxuTA":{"text":"They have incredible customer service here! Absolutely delicious and the people who work h","useful":1,"cool":1},"mLmSeaDThXEdh9M73V_l2A":{"text":"The staff here is amazingly friendly. They want to be sure you enjoy your meal. I come oft","useful":0,"cool":0},"IFj6RoVo6kD3rScvNzpXlA":{"text":"I've been a loyal Chipotle fan for 15 years but my order always gets screwed up here. Toni","useful":0,"cool":0},"fwJJ9-GJHc0-WPAaEHpEFQ":{"text":"Used to love chipotle, however these last few times I've been very disappointed!!!!!! Rice","useful":0,"cool":0},"D_qFl1bRrRHYqxpD9M1Qew":{"text":"Chipotle is pretty consistent. If you want Mexican food on the go Chipotle is the place to","useful":1,"cool":2},"1Em3b4AOJgzoKolmkW8swg":{"text":"Worst Chipotle I've ever had. Delivered on time..and thats where it started to go south. O","useful":0,"cool":0},"_ylKgpvjJ5tgDnHEhZEO_A":{"text":"worst chipotle i have ever ordered from. they always get something wrong and leave out ite","useful":0,"cool":0},"86U9wgqYmOHG4l9Pt4WREg":{"text":"This Mexican Grill is still my all time favorite. The new location is no exception. Enjoy ","useful":0,"cool":0},"o-Pts4h9UFfFeWA1g2GRGg":{"text":"Please stop cooking the chicken until it's black, it really does not taste good and you ca","useful":0,"cool":0},"QwkHwMQl2n9pzyodq5AvLw":{"text":"I have enjoyed eating only three items from chipotle's menu. However, nothing has brought ","useful":0,"cool":0},"q4E1EAsy2qdsqTeung065w":{"text":"Ordered just a large chips and queso on the app and said it would be ready by 6:00pm. Show","useful":1,"cool":0},"z4PbScTh90Po6uFj-GwuHQ":{"text":"This is by far my least favorite Chipotle location I've visited. Usually my experience is ","useful":1,"cool":0},"McnVD2AkzXDkkLfYL_rhMg":{"text":"Went there on Halloween night to get a veggie bowl, they had a promo going on for Hallowee","useful":0,"cool":0},"Hb6w03BsKng1soDKWZvTYg":{"text":"I can't deny that I love Chipotle. I ordered through the app and set up a pickup time. You","useful":1,"cool":0},"dOfjTXdbdHfgMpDAGEnK0Q":{"text":"Always good, good service good food. This location is sometimes crowded so you might want ","useful":0,"cool":0},"49VUYMl1SVplrp3KhNmJLg":{"text":"Do you like Chipotle? If your answer is yes, then don't order from this location. This sin","useful":0,"cool":0},"SBc55RP-0DRRWn8sYhODFw":{"text":"This Chipotle has always been a disappointment compared to non-NOLA locations, but man, it","useful":1,"cool":0},"ZfFn8GOlZCE3Bfv_ojco5A":{"text":"Food was good but staff was not welcoming or friendly. Not much outside seating was availa","useful":0,"cool":0},"WdrQ2aGDE6vXMQEdn_rgwA":{"text":"DONT EAT HERE!!!\n\nThis was by far the most disgusting food I have ordered in years.\nI orde","useful":0,"cool":0},"3nqP537RUGotIC5B2O0Pcg":{"text":"First of all,they made us order online with a 45 min wait...on top of that,they gave us ch","useful":0,"cool":0},"gdAO8IHeS0qV1yBmpyd2zw":{"text":"Just tried to get food and couldn't even get served. With no customers and several people ","useful":0,"cool":0},"aNMsdWIobbao3sPWUWwL2A":{"text":"Very disappointed. I'm a regular at the Harahan location and the food and service is alway","useful":0,"cool":0},"SU4JpGLfe_JFkbSHzvpEBw":{"text":"First Chipotle I go they barely throw you couple piece of meat when I say couple, tbh  4 p","useful":0,"cool":0},"w99tUUjdyybCiMcuGFbwuQ":{"text":"We ordered our food online and had to wait 30 minutes to get our food after showing up at ","useful":0,"cool":0}}