{"AMfBq0IjkjlpA0dZiMNPoA":{"text":"Delicious sauces on boiled seafood. Combinations are unusual and don't sound good but are ","useful":1,"cool":0},"OKf1yPuwRMECVjzm0cpNSQ":{"text":"Awesome place. Good food and great service! Check out their Caribbean flavored crawfish...","useful":0,"cool":0},"f_fNcW51fmHfzSXIGDIF4A":{"text":"My first time there and loved the custom service and ambiance! I took mine  to go but the ","useful":0,"cool":0},"ubM7yZwh88Vy2ybcACYwyQ":{"text":"Delicious sauces on boiled seafood. Combinations are unusual and don't sound good but are ","useful":0,"cool":0},"mmINS8M9NDr5bPJs2oHciA":{"text":"The most bland food I've ever tasted; Especially in New Orleans. Way too expensive for no ","useful":2,"cool":1},"VYBiXEXknb4ytDCoawt-Kw":{"text":"This place is absolutely amazing. We showed up late when they were closing and they went a","useful":0,"cool":0},"LPq9JxWhujNy_nQm5IybeA":{"text":"The servers are great, they quickly get anything you need and are friendly! Customer servi","useful":1,"cool":0},"4iWW_J-tx_riI7OMRIO1yw":{"text":"My friends and I decided to go to the BOIL Seafood House since we were craving crab legs! ","useful":0,"cool":0},"inZQZLUwxjtHKmWM0wIhEA":{"text":"I feel like I should start with the fact that despite their name, they don't boil their se","useful":3,"cool":1},"qr_JerV89g9Thhvlk06S6g":{"text":"Grrreat flavor to the crawfish and beautiful restaurant. Friendly service. Will definitely","useful":0,"cool":0},"JmdZ95HjB2G8nyDz9WtsJw":{"text":"Very nice server and decor, however that was the only good thing about this place. It smel","useful":1,"cool":0},"zc2gWEWvkTtGXEou1nSEHw":{"text":"Food was wonderful. Atmosphere was awesome. Great service. Got to meet owner, he was great","useful":0,"cool":0},"-VST0YlzKXKam7OU8HZ8iQ":{"text":"This is not a local type seafood joint.   No blue crabs at all, only dungeness.   Wait sta","useful":2,"cool":0},"xfkGuU289ZuAOcX6NcyZ9w":{"text":"Great Pricey yes but great, you can customize them which is also a plus and the butter is ","useful":0,"cool":0},"km91crJtUqOsDfnPuVwTLA":{"text":"This is my second time in as many weeks. This is the best crawfish place hands down!!!! I ","useful":0,"cool":0},"Zny9nHj1N2AQULWyNurEEw":{"text":"Went to this restaurant after jazz fest hoping for some genuine good crawfish\nWe got the c","useful":0,"cool":1},"9gY2gLbdig3Jj4YULoSL_Q":{"text":"Worst service I've ever experienced and they did nothing to compensate for us or apologize","useful":3,"cool":0},"LFkTMkKZR9v9rKl3ygr64A":{"text":"This place is bomb dot com! Came here before the saints game and it was super packed. Howe","useful":0,"cool":0},"NeAnd-bbCHbL367Cc5qtiQ":{"text":"Ok so I went to Boil seafood house based on a recommendation from a friend that recently w","useful":0,"cool":0},"ZquUQyaIYpIpFPC3AdXGRw":{"text":"Food was really good but service was beyond lacking. I must have gotten up at least three ","useful":1,"cool":0},"ftUmlI5If6HXjUD9DevmMA":{"text":"So good we ate here twice during our 3 day vacation. We had the shrimp poboy. The waiter r","useful":0,"cool":0},"m5l4Soq9QytrMG-9KfSwtQ":{"text":"Soooooooo yummy! We ordered so much food! My favorite was the oyster caviar  but everythin","useful":0,"cool":0},"hRBtWz9HZ9OlSFs0NGW0rw":{"text":"Wow nice seafood restaurant!!! Just ate there for lunch and let me tell you had a donzn ch","useful":0,"cool":0},"1q0hvC9X75GGOzmWNWcYmQ":{"text":"Amazing food. Amazing service. Tonya really took care of us! We had so much fun and highly","useful":0,"cool":0},"18e1VPBJYV75oK-bnrSH4Q":{"text":"This is a great way to experience a Louisiana boil if you don't have a the opportunity to ","useful":0,"cool":0},"R7IIkELvlqjyqIQxq0H17Q":{"text":"THE CRAWFISH HERE IS SOOOO GOOD!! such a lovely bartender, she prepared us drinks and they","useful":0,"cool":0},"v3oGIrbU--b_N5rJdMNkqw":{"text":"We're visiting the area and found this great place that finally satisfied our seafood crav","useful":0,"cool":0},"lOoHR0el0ThdaLvoAcNJEQ":{"text":"Shrimp poboy and fries was a solid choice fresh ingredients and we will be back again!","useful":0,"cool":0},"ZO15geokL4wjG10T-1dZ7Q":{"text":"What a fun place and great way to experience southern food! I enjoyed every moment there a","useful":0,"cool":0},"Uwbbzf91ShEEtjt25NH8dA":{"text":"The seafood pots are well made but that's about it. The bread is extra. There are no sides","useful":1,"cool":0},"JvnVsDoflMZIWKpNFdF8Bg":{"text":"Great oysters and gator here courtesy of my man JJ. Place is under stupendous management!","useful":0,"cool":0},"BBgb3_Oiey3uCv8gMaBi_g":{"text":"This place is Sooo worth the money!! I had crawfish beignets, snow crab legs, cajun wings,","useful":0,"cool":0},"4DSjHdmQ9wiRYJh3hzdlhQ":{"text":"Had a wonderful experience JJ is the best will be back. Great food, expert service and kno","useful":0,"cool":0},"q2nI6juDdwlwYKfWC7_LSw":{"text":"Loved BOIL! Fun eating experience (get ready to get messy) and fantastic food. Seasoning w","useful":0,"cool":0},"7tmHT9pKZd_qp5Ez777NNw":{"text":"Was in town for a few days celebrating my birthday so i went on a quest to find some of No","useful":0,"cool":0},"PHkbNqDb3wyYy5KMu1hvjA":{"text":"These people do not cook cajun they cook vietnamese 99.00 seafood platter? Wow they are me","useful":0,"cool":0},"hhIbrxzHgoV2DwoJARxJXg":{"text":"Two words... WORTH IT!! Great service, funny waiter, and great food! Good prices for a gre","useful":0,"cool":0},"TtMZZVxWx6kDu6YIj8hT3A":{"text":"Went uptown during a weekend visit to New Orleans. Everything was delicious. We got the ch","useful":1,"cool":0},"dvVr2SvQfw_BZeMdRHVy5w":{"text":"Absolutely amazing staff. Great food and service. The food was fantastic. Been there twice","useful":0,"cool":0},"QyUCvMTqWO6cGlBAeRWvWg":{"text":"Loved this place! Great atmosphere, great food, great cocktails. Much more reasonable and ","useful":1,"cool":0},"SCwSSbwNSWsA7-PWH80Ajg":{"text":"My husband and I went here twice during our one week trip to New Orleans, it was so good a","useful":1,"cool":0},"e0OnELUCkgLbpTAnJpZZjQ":{"text":"Loved this place. Service was slow to start, but we were warned that they were understaffe","useful":0,"cool":0},"uYQOVu02yLWyCsOU3y0eNg":{"text":"This is second time come here in 4 days. Great oysters and great food . Love it .  The sno","useful":0,"cool":0},"71939HrSmFL-0j-PMx071w":{"text":"Look, I am born and raised here.  Not usually a fan of this style of crawfish with the sau","useful":0,"cool":0},"P5I7HnVGMA6VeK2zMQXIpQ":{"text":"Fun, little place. Large crowds and noisy. Good food. Wasn't in love with the house spice ","useful":0,"cool":0},"kSUrP8Z2moj_vtbYIsT8TA":{"text":"Really really good. They had fresh crawfish so I went that way. Ate 4 pounds of it. I woul","useful":0,"cool":0},"YN33c_nCreMsfYstQJoXXw":{"text":"We had so many delicious meals in New Orleans, but this one topped the charts as our absol","useful":0,"cool":0},"PBFeoaDaqlgAe6STUuT9lA":{"text":"We ate here on our last night in New Orleans. We had been having trouble finding Crawfish ","useful":0,"cool":0},"9_u_cX2mHzIthwime4u59g":{"text":"The Taste of New Orleans boil is to die for. Crab, crawfish, shrimp, sausage, and potato i","useful":0,"cool":0},"Qu0OkzLDYLGO9-uwjbSkig":{"text":"Would have given a 5 star for great food and pricing but the service was subpar.. It was a","useful":0,"cool":0},"LoPdPjIULFdVc47_STYQgw":{"text":"I was really excited when I saw this restaurant on an Eater article. I have been waiting f","useful":2,"cool":0},"engPTO5bUCe62J1vY1M3xQ":{"text":"If I could give it no stars, I would. I don't normally feel the need to write a negative r","useful":4,"cool":0},"rQjdQ_cbpRR3yt1xDewx-Q":{"text":"The food was very delicious being that I'm a local I would recommend the service was great","useful":0,"cool":0},"AYqPbjYvhYsAhXB-q1Tm6w":{"text":"Probably the best VietCajun I've ever had.  I got a pound of crawfish with the Boil-House ","useful":0,"cool":0},"m7z6Vj5OypX2IKB4818lAA":{"text":"After a week of exploring different restaurants at the French quarter, we were looking for","useful":0,"cool":0},"WJFR0Chkd_MOid10H8UnYA":{"text":"The food was the best we tried in New Orleans. Would definitely come back. The flavor and ","useful":0,"cool":0},"yYGXpo6UKLm8A8N2KCO7Sw":{"text":"Food was good but the service was awful. Our waiter was Pierre and we ordered a combo plat","useful":0,"cool":0},"xdyT5NJx00I9iOux7n11cA":{"text":"Sen-freaking-sational! Whoa, amazing food, seasoned perfectly, warm and lively atmosphere ","useful":0,"cool":0},"eNxSzQZgXg8rIX5hMD99Tg":{"text":"I had the snow crabs with the mild boil seafood house sauce and added corn. The sauce was ","useful":0,"cool":0},"3loyQ5vTRCvHEtyzTsO4AA":{"text":"I'm pretty half and half about this place from the first impression. Service was great. Th","useful":1,"cool":0},"rpFvKidPmlHflPAbN7sPOA":{"text":"Loved this place. Best crawfish ever. You can pick your sauce and your heat and add whatev","useful":0,"cool":0},"RvyXqF6LsSB6MYyGHMuvUg":{"text":"First time, from out of town with our group of 10. Can't compare to anything as i've never","useful":0,"cool":0},"i8EKWn9ijyk4L8fu8bqp-g":{"text":"This restaurant has a nice vibe and is generally pleasant.  We came because we were lookin","useful":0,"cool":0},"sijWcnRLQPkB47MOg-8djw":{"text":"My mom add I stopped by for dinner and we were pleasantly surprised! We got boiled shrimp,","useful":0,"cool":0},"2jvZ6cNrpwS9DzMlohoFQg":{"text":"Food was amazing. Booked our reservation on open table and thankful we did because there i","useful":0,"cool":0},"qaIkegSInwL_sv6ojJMEfg":{"text":"Save your time/and go elsewhere. I was open to this different type off boil and was eager ","useful":5,"cool":1},"ua7kDye0IQuotzZ_QsqRJA":{"text":"Came here with the family & the food was great. The servers were nice & prompt as well. I ","useful":0,"cool":0},"TSMOoKo3eV7Drv3WVY2Rfg":{"text":"I'm giving this restaurant 3 stars because the food was delicious and we were seated promp","useful":0,"cool":0},"UBdT31_tFsJWo6BNAjdthw":{"text":"If this place survives I'll be amazed.  Ice tea was watery, shrimp were so overcooked they","useful":3,"cool":0},"lZ-Bem3K8Tf9HcXBtMNgrw":{"text":"The food was good - it was a bit salty but still okay.\nGiving 3 stars because our waitress","useful":0,"cool":0},"FLzFocnJXg3B1FGvEYKDqw":{"text":"This place is amazing! The atmosphere is great and kids friendly. The food was great also.","useful":0,"cool":0},"1yv7s2gO2spHho4F2yNUSw":{"text":"I really enjoyed the seafood  but the place is small so seating is limited but you can eat","useful":0,"cool":0},"WAR2AVuEnC7JpUhOU3LmMQ":{"text":"The Crawfish Beignets are a MUST! They're sooo fluffy and fresh, you have to try these. I ","useful":0,"cool":0},"1AtV-cSBEZxmJ8Hnc8z4sg":{"text":"Great atmosphere. Great food. Great service. These are only a few pictures that I took bef","useful":0,"cool":0},"1p5gIQC-_Hvw90aeYpPvKQ":{"text":"Take out order. Tried the House, Caribbean, and Garlic butter seasoning. All delicious and","useful":0,"cool":0},"6P5MYE7Q_0NEu0NHzcYlYw":{"text":"Had the gumbo- unique touch but I enjoyed it. Good ambiance and vibe with a small space so","useful":0,"cool":0},"8pGbOVe2VW0p7ZlmSkgd4w":{"text":"The Good: The service. Everyone was very friendly and helpful. \nThe Bad: The Food. This wa","useful":10,"cool":3},"ek2he3nAy0O36RTif0IoNQ":{"text":"This boil house off the beaten path is a great stop for live crawfish and boil pots of oth","useful":1,"cool":0},"HMBp0ucS4MEqViCcXmQo_A":{"text":"I must say that the food was absolutely delicious. The service was unacceptable. We were w","useful":4,"cool":1},"1HlHkW63XIqjoNgPKOaiNw":{"text":"Super yummy food. The New Orleans chargrilled oysters are DELICIOUS! the Bayou rolls are a","useful":0,"cool":0},"MtASsUhnYgwntiGyyj366w":{"text":"If you're in New Orleans, BOIL Seafood is an absolute MUST! Ask for Jessica, as our servic","useful":0,"cool":0},"ZDcK47OU03l2ZvQOBx9B1g":{"text":"A  very disappointing experience overall, went thinking about having some boiled crawfish,","useful":3,"cool":0},"QcGwFmlVNJtaFMhhiPCQrw":{"text":"Their OG boil sauce is really good. We got the medium and it was the perfect mixture of sp","useful":0,"cool":0},"XS047XykpGP_5Va3KZ7XYQ":{"text":"Good flavor, the seafood was good, potatoes and corn also tasty. The salad with seared tun","useful":0,"cool":0},"VxGXVIQzkGfq1QTm-3UDuQ":{"text":"The place gets packed quick so show up early the the drinks are pretty good the seafood is","useful":0,"cool":0},"dvdmxaxNYGEZhOTjifMK2Q":{"text":"When you need crawfish but it's not crawfish season, come here. According to their staff t","useful":1,"cool":0},"M4js5eD5jPINIFCD8Fo2Ag":{"text":"The place is busy so make a reservation or expect to wait.  The crawfish were amazing. Big","useful":0,"cool":0},"4FOYcjitWd3nVmCnNUwzpw":{"text":"Tried early season crawfish.  Size was small with some large in the mix.  Medium and spicy","useful":0,"cool":0},"x8aISVf3lvL99kXuuu3OKg":{"text":"The yelp reviews did me a service and I went to this place. Amazing service, delicious sea","useful":2,"cool":0},"2gWsAkwcSKGHx-HHbROhKg":{"text":"Great atmosphere and GREAT food! Staff was so nice and accommodating! The food was outstan","useful":0,"cool":0},"bAjdsLZY6O38Ib9UWnNBvQ":{"text":"Just spent $400 for a family of six. I'm glad they renovated that old building. But in New","useful":1,"cool":0},"wdMit7DzunVzVDUfV2eWpw":{"text":"I am a local. My daughter saw this place and thought due to the location is was going to b","useful":1,"cool":0},"XPEaz8ZjaRn5crLPwWQDlg":{"text":"This is not a fancy place but this is where the locals go eat seafood boils which you know","useful":0,"cool":1},"tD4ZJppCyOgLO6vZV3lQ5w":{"text":"Went with a group of 8, we ordered the feast with boil house flavor and high heat. It was ","useful":0,"cool":0},"VV04G1zZgFbykl5ZxnN-YQ":{"text":"Lots of two words to describe this place:\n\nSooo good\nNo regrets \nMy crawdaddy\nJUST GO\n\nAll","useful":0,"cool":0},"x3BEAsmFkSddOgv3FOOhKA":{"text":"Horrible, the food was not at all what was described. For $135 for a boiled seafood platte","useful":2,"cool":0},"2WyAtkhM9aRV0Wpa2i_PLA":{"text":"This was the best meal we had in New Orleans. Wonderful location and ambiance. Highly reco","useful":0,"cool":0},"_GFtyRMv7ODn7QqIWZCZTw":{"text":"Just Don't! This was a very busy place and, for the life of me, I do not know why. All \"Bo","useful":1,"cool":0},"amlepFbx9EIOSwzbif8JAw":{"text":"Disappointed! So we're from Houston & wanted to try some Viet-Cajun style crawfish in New ","useful":4,"cool":0},"zrXtO5er_HM5JLoKeN5J5Q":{"text":"We decided to go in for a quick bite because the owner was outside last weekend handing ou","useful":0,"cool":0},"KJ5pS49TmFz_8hZmeLgTlA":{"text":"Let me start of with the positives ..the food is so good! Everything was satisfying. I lef","useful":0,"cool":0},"-BozBj79788ablOhuwl9WQ":{"text":"I wish I could leave 2.5 stars, so I'll round up to 3. This is one of those spots tourists","useful":4,"cool":1},"VbA9r2kSF1TmLRIRRDNIuA":{"text":"Lived in La for 3 years while stationed at Polk... back in NOLA with wife and son and look","useful":0,"cool":0},"9VMSjAzXYJwyJpZV7EOe6g":{"text":"This place is amazing! Best boil I have ever had! Every time I come to New Orleans now, th","useful":0,"cool":0},"W4OZZhurZEdptUJbxZ5eQg":{"text":"Not good, have eaten in several viet-Cajun places before , shrimp were good, rest was low ","useful":3,"cool":0},"H1LNfhZEBypr6wLSO2cNIw":{"text":"Made reservations for 8:30 and was immediately seated when I arrived! Loved that!!!!!  If ","useful":0,"cool":0},"sY33RbBotephGW1PRC0kIg":{"text":"Wow!  What can I say. The service was top notch. The bartender made great mojitos and was ","useful":0,"cool":0},"GjDwuDtLPhW3or76q7g-lw":{"text":"Idk where to even start. I called initially to try and make some special arrangements for ","useful":3,"cool":0},"Hp-Zw7ht-zMFa4xazDUDLQ":{"text":"In NOLA for 1 day and on a no carb diet. Decided to try BOIL. It was amazing. The food was","useful":0,"cool":0},"R_nfvxVowuMA8maAgvjilA":{"text":"Highly recommended for boiled crawfish and shrimp. The server was very nice and extremely ","useful":0,"cool":0},"bxucRIacieFMmYUTs3dagg":{"text":"Crawfish and shrimp were full of flavor. I decided to go with the boil house flavor which ","useful":0,"cool":0},"0kU-qgL_DyoEwXHN6dZnDA":{"text":"Surprisingly amazing. I'm only saying that because I don't typically do seafood boil. Comi","useful":0,"cool":0},"7BmEKOu-a_sN1Ck_wDGs0Q":{"text":"Don't do it !! Tourist trap!! I got better seafood in Oakland! I let the waitress know tha","useful":1,"cool":0},"Wnvl0K-ik02aS_Gu5RlhVA":{"text":"We had spent hours walking down Magazine St. and the Garden District when we came upon Boi","useful":1,"cool":0},"dmRaB6gpQ0QJftwDRXQdXQ":{"text":"Excellent service, good food, but the drinks were so strong I couldn't get them down! Lol,","useful":1,"cool":0},"OltMOf27r07UYqi1irbZrw":{"text":"Our go to for a boil when we are at magazine street. Service and food is always great. I l","useful":0,"cool":0},"TqNAbpLfa3okWFsrl_THgg":{"text":"This place is amazing!!!!!!!! I came here expecting average or decent but this is the best","useful":2,"cool":2},"4yoB9iV4n3qOsbfxIYG_JA":{"text":"I will definitely return! I've been to New Orleans several times but first time with the k","useful":0,"cool":0},"zoz9CBdm9T0fhfY5pWQmzw":{"text":"The worst seafood boil I've ever had. \n\nWe called to make sure they had blue crab and the ","useful":5,"cool":0},"CB11BoGqwUxrD3pVYLMAgA":{"text":"Excellent place to grab some of the best seafood in New Orleans! I took a large group here","useful":0,"cool":0},"X6Ek2EHyqbARfW297_1ZhQ":{"text":"Picked this place on a whim for a nice lunch on Magazine St. My mother is partial to seafo","useful":0,"cool":1},"iPpjvFQ2B7S8M0I2iwtbRA":{"text":"As local New Orleanians, we have our favorite seafood spots, but a friend drove our group ","useful":3,"cool":0},"7SCWVhgCxweAVmrOC4RJJg":{"text":"Went by and compared to last year they've really made the food better. Three stars for the","useful":0,"cool":0},"SgHzh530BaFzlRNZkgHMew":{"text":"Boil is a great place to eat boiled seafood. Boil also tosses their seafood in either a Ca","useful":0,"cool":0},"2jqTj-LnsE73lnS2Jd7sWw":{"text":"Horrible service. Today I ate at BOIL Seafood House, the food was great the problem was th","useful":0,"cool":0},"qcYiAz0Ydks8KOnMLH3ieA":{"text":"Make a reservation! Although we went before the dinner crowd, we could not get a table wit","useful":4,"cool":4},"lzxoGam_3cnXtIAYhFqWwQ":{"text":"I LOVED THIS PLACE. This was our last stop during our trip and I wouldn't have ended it an","useful":1,"cool":0},"BwMeo0dsInIJrP6z4m0WzA":{"text":"Pros-\nDelicious Delicious Delicious!\nGreat flavor\nDecent portions\nGood location, 12 minute","useful":0,"cool":0},"M4PZb9uVdPF_35hboU8OdQ":{"text":"Food was excellent, however we sat on the balcony and our server was extremely un attentiv","useful":1,"cool":0},"Djy49zwMSsNfziNbfvl-HQ":{"text":"So good and fun! Had the shrimp and crawfish boil with medium heat and it was perfection! ","useful":0,"cool":0},"JTsM9yIVU5RA_zhBP-kKng":{"text":"Tastes like a mid-western restaurant trying to make Louisiana food. The crawfish were soak","useful":1,"cool":0},"L-Y-gI2P81YsaV8BOJ3f7Q":{"text":"I gave this restaurant another shot while visiting New Orleans. The service is still excel","useful":0,"cool":0},"4lIdyaxHHkIbsdTXElluVg":{"text":"We made an impromptu stop for a bite to eat and were sure glad we did! Bartender Sammy mad","useful":0,"cool":0},"IQW6deiopVTvTkyEiz1-KA":{"text":"Boil was great.  Service was  nice.   Atmosphere is casual, not too loud.  Perfect dinner ","useful":0,"cool":0},"lkJeC1wR2iGFcuGBfcBsFw":{"text":"I visited during a busy time of year during Essence Fest. A lot of the other restaurants h","useful":1,"cool":0},"HwJloGU_udc21QD5bhhbIw":{"text":"Solid 4 stars. This restaurant is located just a few blocks from my house, we went on a Su","useful":0,"cool":1},"ccbOk1gluhRcXpSXI5BxvQ":{"text":"The food was good. I enjoyed the food, good amount and the taste is good. My drink was rea","useful":1,"cool":1},"OI5m_4ZxE9xSsLFpeOMUZw":{"text":"I have been looking forward to Boil Seafood House opening.  We pickup from across the stre","useful":5,"cool":1},"Bb14HM8tIDGdv5M3Cwm3Ew":{"text":"My daughter wanted to eat here and I was reluctant because there were so many restaurants ","useful":0,"cool":0},"cbQ1-DAJgmGcoXg7ZaOPRg":{"text":"Great place, great atmosphere, food and service.  I had the cajun bowl and my daughters ha","useful":0,"cool":0},"CoTCELyQP385DoN0-3XseA":{"text":"First off, will say I'm not a local this seafood is on the pricey side compared to what yo","useful":0,"cool":0},"R21RDMLF5FWgTQooZnQFLA":{"text":"We had a really good experience! It looks really cool inside and everything was clean. We ","useful":0,"cool":0},"ledT6eHm2g297sijl1Bd-g":{"text":"Holy smokes. I loved it. The crawfish were cooked perfectly, then coated in butter and mor","useful":0,"cool":0},"qaMDB6RPJBjHWOsrkl-I4Q":{"text":"We were in the mood for a seafood boil dinner and stumbled across BOIL Seafood House on Ye","useful":1,"cool":1},"oftYFLdsHRmQWkkd5B1kbg":{"text":"Before Boil, my only experience with Cajun-style seafood boils in Louisiana have been larg","useful":0,"cool":0},"uA01tAYXluI50sTRfw1zng":{"text":"Pretty cool spot located on magazine. This place was packed but we was seated in the matte","useful":0,"cool":0},"7_WPSpsw5qm3lAJ6lm88dw":{"text":"I'd like to say the food was good, but we barely got to try it. They changed our pickup or","useful":0,"cool":0},"28nZtvR59yxroate-D4b9w":{"text":"Food was really good. A regular boil was enough for 3 people. A bit expensive but it is to","useful":0,"cool":0},"7iIzsegH7rR1bo6RKUVOqQ":{"text":"Hieu D, Owner, \n\nPlease book 4 round trip flights from PBI to compensate for your blunder,","useful":0,"cool":0},"0i6QmrGuC4BW6faGk0TXng":{"text":"We had a great time at BOIL Seafood House and the staff were exceptionally friendly and sh","useful":0,"cool":0},"TZg0h3RN9dRVo-TmiioghA":{"text":"My fristers( sister/friend) and I went to Nola to celebrate Fay's 40th birthday we wanted ","useful":0,"cool":0},"nreMsCnb0UOic6BWRjZRiQ":{"text":"What a disaster. Waited over an hour when we were told wait was 20 minutes. Absolutely no ","useful":1,"cool":0},"WrNeS3ldVi0vcpf4JL201Q":{"text":"This place is amazing the crab is phenomenal. Definitely suggest the house seasoning. Will","useful":0,"cool":0},"yYBVGjOhZvL7NiWJV0agVQ":{"text":"The ambiance of the restaurant is beautiful ! Crawfish have very unique flavors! Great add","useful":0,"cool":0},"_R8Sd0jFubmhAYEvMeTSQw":{"text":"Went Mardi Gras night (8:15).  We had reservations and were seated promptly.  Service a li","useful":1,"cool":0},"3-YBm50CrsOTBSxOYyzaoA":{"text":"When we got there the place was pretty much empty. Our server immediately brought out wate","useful":4,"cool":0},"c-ZyN1zXycDvNBvikOOE1Q":{"text":"What a delightful find.   My wife and I dropped in tonight without reservations and were g","useful":0,"cool":0},"vmKcPjI2sM51i5DJtTHGrQ":{"text":"I came here for the first time on Sunday and was not disappointed. I made reservations for","useful":8,"cool":5},"tYVggzf0JsO8zS9dM-JRLg":{"text":"Our Overall experience was amazing from the service to the food loved how accommodating an","useful":0,"cool":0},"QXsihsX9jouNBVCptWxOzQ":{"text":"Really not impressed. \n\nCame for boiled shrimp. They only have combo seafood boiled plates","useful":4,"cool":0},"dah9pFK8GfxdTrT6Xbrqgw":{"text":"Amazing staff! The only thing that I did not like at this establishment were the portions ","useful":1,"cool":0},"_XzLonXhM1PoAFpbrHfUBg":{"text":"EEEEVVVVEERYYY thing on their menu is amazing! And worth every penny! The chargrilled crab","useful":0,"cool":0},"wKqvzEMBKtPXmzWsZvyNQA":{"text":"Such good reviews led to stellar disappoint. Shrimp was cooked poorly so that shell did no","useful":1,"cool":0},"gLXspeCf_v2F5F_p3xhsNg":{"text":"Hands down the best boil I've ever had. Friendly staff, great service and AMAZING food. Fi","useful":0,"cool":0},"MwPiXhWmnLd44oOnIaDc1g":{"text":"While the atmosphere was great, flavor of the shack boil we got (Cajun mixed with Garlic B","useful":0,"cool":0},"HXDmN_EagEI2d7paHqA61A":{"text":"It's okay. Feel like it's one of the few restaurants in New Orleans that sells crawfish ye","useful":1,"cool":0},"Di5_a4U8iwyFqNhU3GrRew":{"text":"I am a regular at this restaurant. First they lost my to-go order then I reorder and waite","useful":0,"cool":0},"3OBVulQwcD-8g6R2SltZ_w":{"text":"So much food!! I loved my shrimp platter. It was perfectly breaded and the fries were grea","useful":0,"cool":0},"xQtUbHdjkpDhEJerNHNUtw":{"text":"I'm not sure why this place had 5 stars it's terrible one thing that was good was the drin","useful":2,"cool":1},"EeBVFPKjkmr180XBT4o6cQ":{"text":"My boyfriend and I stopped in this week looking for a different take on crawfish. We both ","useful":1,"cool":0},"G1dCW1XPqC7swgE9UKoCOg":{"text":"I would say this place hands down has the best season snow crab legs I have ever ate. It m","useful":0,"cool":1},"TQhhPvTZniofEJEbFAJsOQ":{"text":"This place is great! There was a bit of a wait but the seafood was fresh even at the late ","useful":0,"cool":0},"eAIC3CFqrK1onhx1Sq_vzg":{"text":"We've been waiting for a Viet-cajun seafood place like this to open. Seafood tossed in you","useful":10,"cool":5},"CqIzFuCTuKejS09kOoplJQ":{"text":"Amazing customer service ! My server Brent was so polite and had great recommendations. Wo","useful":1,"cool":0},"cFZ2eU8dO6INISSjQp4rNg":{"text":"Was so excited to come here u til being racislly profiled. Asked for a deposit becuse we d","useful":0,"cool":0},"LYvP0BENGito8SmVHtwF0Q":{"text":"I came here with high expectations as a tourist. I read the 4 star reviews and was really ","useful":0,"cool":0},"IdJg3ZxG57kgCrMlKF_d2A":{"text":"I came to New Orleans lookin' for some good seafood and I honestly cannot complain about t","useful":0,"cool":0},"beW54C73r25bQg1WUtkdpw":{"text":"Eff yes.\nOn our wedding day we went in formal clothes straight from our wedding ceremony, ","useful":0,"cool":0},"Kzn1LB-jW0UIeAuGD18LLg":{"text":"Fantastic shrimp and crawfish boil!  Very spicy and delicious!  Will definitely visit agai","useful":0,"cool":0},"RfuGdCx1g66Xit4PBtFP_g":{"text":"This place was horrible. I don't mean to sound negative, but I love an establishment with ","useful":0,"cool":0},"1qs8xaPxSur4myhDQGWyOA":{"text":"I ordered the Cajun classic bucket! The food was very good! I like that the order was just","useful":0,"cool":0},"yRFwnMlytzpUUaaudGAWcg":{"text":"Bad organization on wait staff and hostess if as far as seating customers and table turnov","useful":0,"cool":0},"KAhLQ8D_UqFXGa1x2YDR_A":{"text":"Gumbo was good flavor was amazing just not enough seafood in it! The sound was spicy but n","useful":1,"cool":0},"esQri-ESsKtDWoSz_eu1ig":{"text":"Best seafood boil in New Orleans, hands down. Super great option if you want some real dea","useful":0,"cool":0},"BwABKIL332JuPPGVlrC9wQ":{"text":"It was great food, great atmosphere but my waitress literally sniffed our sauces when we a","useful":0,"cool":0},"PKclMQH9JDZbYa44DmTT5A":{"text":"Food was great! Seasoned very well, there were a couple over cooked shrimp but overall rea","useful":0,"cool":0},"whRKDiDmRhy-bCit5PyJOw":{"text":"I heard a lot of good things about this place but my experience here was not soo good me a","useful":1,"cool":0},"DCwYpF5hPcX5-u_AQArqUw":{"text":"A must visit when you are in New Orleans.\nWe were promptly greeted and seated when we walk","useful":0,"cool":0},"z_3xblp7fwLqtRq8Doac-Q":{"text":"We waited a little long for service, but it was worth it! I got a pound of crawfish and Fr","useful":0,"cool":0},"BgUUbvJwgqLoy06a_BQ9Ow":{"text":"New to New Orleans and had tried seafood at several places and was disappointed every time","useful":0,"cool":0},"ciIT8svG5MdVMZ_kDY3YhQ":{"text":"Awful awful service sat at the bar the bartender said he will be right with me fifteen min","useful":0,"cool":0},"hGz_pCX1GhGUh8-dYSsQSg":{"text":"Will come back time and again!  \n\nShowed up unannounced with a group of 16 including 4 kid","useful":0,"cool":0},"TKXWXTL9OpwvbHItL711lQ":{"text":"The wait wasn't long but once we were seated nobody  greeted us. I had to ask the other se","useful":0,"cool":0},"v00b_wogTRfEDNIjTvf-6w":{"text":"We didn't know what to expect because the atmosphere was casual but I must say that we tru","useful":0,"cool":0},"s3JKSgyeupmmokYDYS8DOA":{"text":"Crabs were over cooked with no flavor.  The crabs did not snap to crack.  They were like r","useful":1,"cool":0},"cSJtYXm8_Urh_ERYP9HCBg":{"text":"We have been excited about this new Boil house opening close to our house and were eager t","useful":1,"cool":0},"czKAeLCBVVn1YZtCthRw9w":{"text":"This place have some of the best charbroil oysters in town ..Their raw oysters with their ","useful":0,"cool":0},"_y2sp8Oxu9Fkz5cECidCxA":{"text":"It was my first time doing a boil, and the experience was phenomenal. The seafood was fres","useful":0,"cool":0},"xTzoLlVWFkLecaEG8kVGWw":{"text":"A true NOLA boil experience that we were looking for!! I mean, just look at the picture an","useful":0,"cool":0},"2XJ1fBASCHz3_eg033wzIg":{"text":"First off if you don't get anything else of this review MAKE A RESERVATION!!!! We rolled i","useful":0,"cool":0},"V44AfBaSvSIJJKrauZpKGw":{"text":"Hands down the best crawfish/blue crabs/oysters I ever had! Super juicy and full of flavor","useful":0,"cool":0},"1KEkctT4qA-zpX59De_94Q":{"text":"Nothing more than some freaking bomb dope food in NOLA! I recommend going to this spot!","useful":0,"cool":0},"5UK9tv_nYvz9aycDqji1DQ":{"text":"Awesome place and great prices. Loved the Taste of New Orleans because it had crawfish and","useful":0,"cool":0},"7Yx1c8ShTRxqqgu1GDw3wA":{"text":"This is not authentic Louisiana Crawfish!\nMultiple options on flavor and heat because it i","useful":2,"cool":0},"WVARaxFo_YTu6iEco4xnig":{"text":"TL:DR - Save your dough and go to one of the more dressed down boiled seafood places. \n\nI ","useful":6,"cool":0},"BNTRTNKxB-EUTVlWjIYLkQ":{"text":"The only reason I'm giving 4 stars is bc they forgot to give us our appetizer. The boiled ","useful":0,"cool":0},"sIjseneiEQ1lpmlKniRCmA":{"text":"So this was my first crawfish boil experience and I hands down fell in love. Must go to sp","useful":0,"cool":0},"8XDhcaBj7p9lwXMQ1EMD7Q":{"text":"Delicious food. Great service. We had crawfish and dungeness crab. Both were cooked perfec","useful":0,"cool":0},"i5bSCyPpHRGtlSNlOgxBtQ":{"text":"The atmosphere was so inviting. We were welcomed and told to have a seat anywhere we would","useful":0,"cool":0},"OZBqDUkTrgP_-5QjCqa1JA":{"text":"Delicious Cajun seafood from the Gulf, our first time eating crawfish. Tasted exactly like","useful":0,"cool":0},"YSFuiPXnz2TF3HeACjqdow":{"text":"I don't know if we came at a bad time but I was disappointed in everything but the chargri","useful":0,"cool":0},"ROuNsBNUO8u08zDXdsC1gw":{"text":"It's as if someone said \"Hey, I've got a great idea.  Let's prepare crawfish a different w","useful":0,"cool":0},"p3zMbeo8zfHLx2q87Av-SQ":{"text":"Ervice could have been better.. Our waitress brought water for one of us but didn't fill t","useful":0,"cool":0},"a8R4oNq6TQEwexHyb0JXxA":{"text":"Great spot to eat They have the best shrimp I ever had. First place I been to that all my ","useful":0,"cool":0},"Hxv0pF1RHFxbDcEdVOb20A":{"text":"Last night NoLA and grabbed some crawfish to go. Delicious boil with plenty of options. Th","useful":0,"cool":0},"_2uzzVqOQ0ONZ7Z3_iBJwg":{"text":"Great food and wonderful service from JJ! We had the Cajun bucket, a dozen raw oysters and","useful":0,"cool":0},"A81SRmUHBvcHnnGHTGPypw":{"text":"Amazing food, company and first experience in nola during the craziness of Mardi Gras. Gre","useful":0,"cool":0},"YBgw-6TwNfiNw-vtQeTxhw":{"text":"Looking for a boiling crab type restaurant- this did the job. Their booths are great- slid","useful":0,"cool":0},"AweksswtGswAs_6BIs37ig":{"text":"Boiled seafood made to your liking of flavor and level of spice. The food is always amazin","useful":0,"cool":0},"VlEzqQnBVy335JcJfbVIkw":{"text":"I'll start off on the positive things. The seafood was fresh for the most part, the servic","useful":2,"cool":0},"N9BaScIydUBhfUQoHQy_Kw":{"text":"Yep 5 STARS is what I will give Bartender AL & the Gang they were very nice professional e","useful":1,"cool":0},"ukEQALGJ6OCGKhMHBNzOaQ":{"text":"Ignore the bad reviews. This was a great spot to watch the Saints game and eat good boiled","useful":0,"cool":0},"XOJV7ZKR_k1IksXt5LlVPA":{"text":"This place was amazing. First time here and our server Lisa L. was absolutely a sweetheart","useful":0,"cool":0},"ydY_sNxUuqOUlvxLwZqQLw":{"text":"My favorite seafood restaurant when visiting the BIG EASY .Great atmosphere and servers at","useful":0,"cool":0},"SVvINYlvzbkJ4Xbj6m4R-Q":{"text":"Boil Seafood presents a style of boiling that is popular outside of New Orleans. Plainly b","useful":6,"cool":2},"He1gKLM-JCR5mVi2ZAsZ8w":{"text":"just left 30 minutes ago and i must say definitely a place i would like to go to again! we","useful":0,"cool":0},"0PDlqszMDswOO7hag20jNg":{"text":"I called and was instructed to join the waitlist via OpenTable. I joined and was taken off","useful":0,"cool":0},"4YnYXlph4cSmnSZRdmbIcA":{"text":"I'm always super hesitant about ordering crawfish from a restaurant but my friend insisted","useful":2,"cool":0},"bunUIrQOe7BjcHFiMgb4vw":{"text":"I had the garlic butter boiled crawfish. I've had many crawfish boils in my 28 years in No","useful":1,"cool":1},"0Kw4VXqSuKVaV9-OALpY5g":{"text":"I feel for the restaurants that are suffering during the pandemic to stay afloat and I hav","useful":0,"cool":0},"quNoVNOOVyJbSEsBccRSwQ":{"text":"One of the best highlights while visiting NOLA.  Seafood is my love and I had an awesome e","useful":0,"cool":1},"hHmsAXCQBYChUXA1sUMsxg":{"text":"BOIL is a really quaint place with a cool vibe. I recommend making reservations since it i","useful":1,"cool":0},"eGlmnFjXZlU3fDIhYTOXfA":{"text":"We had really good service - it's why this review is 3 stars. The food was sooooooo meh. C","useful":0,"cool":0},"qPPyMKgzEtiPd2PuszOFxg":{"text":"This is the first boil house I went to in New Orleans. We were actually on our way to anot","useful":2,"cool":1},"_Mq6-qFPKD5AxAZfV8lyaQ":{"text":"I love crawfish! I had high hopes for this place and was expecting super delicious flavors","useful":2,"cool":0},"3Rt-9D5vhpfPd9lgRikYEA":{"text":"A++++++++++++++++++++++ flavor. We ordered the Cajun Classic bucket with BOIL House flavor","useful":6,"cool":6},"hRlBwwXgg6AbGzvZkpSdfw":{"text":"I love BOIL. I live around the corner and come here almost weekly. The bartender Jessica a","useful":0,"cool":0},"SPWy5QI2qijBoMreJa3bAg":{"text":"Very nice atmosphere,  great service, amazing food, the cajun seafood was of the hook! Hig","useful":0,"cool":0},"YkVkgDB8H1JjxMvNt6LFWA":{"text":"Favorite place in NOLA that I've tried. The flavor was amazing! Got the Shack Boil with Ca","useful":0,"cool":0},"LycwVdlfNPj-ssH5UBOMDw":{"text":"The food was very good! The Charbroiled Oysters were the best. The Crawfish ettouffee  was","useful":0,"cool":1},"CU8T8ojTc94EVHT0OZx9bA":{"text":"This is has got to be my favorite seafood restaurant in New Orleans. If i could give 10 st","useful":0,"cool":0},"F6rwV-jgOFkqR-rOMGO8dQ":{"text":"I have eaten the oysters and crawfish and I love it! The place looks awesome! Give it a tr","useful":0,"cool":0},"kujVXd2ykCYC9caPVggd0Q":{"text":"My sever was great! Food came faster than expected however i am from texas and with that b","useful":0,"cool":0},"1TJoxf0_nEBnzqc92Uh0Og":{"text":"Came here on a Saturday evening at 6:15pm with 3 others. I'd made a reservation a few days","useful":0,"cool":0},"o6dVK5iMffcbNpm_P3SS-A":{"text":"The crawfish looks like a tourist trap. \nIt wasn't boiled in anything, just boiled plain a","useful":1,"cool":0},"Z59nVtZmDdCMHDdfbtcnhQ":{"text":"This place is called Boil and it puts out a good one!\nWe brought my daughter here for her ","useful":0,"cool":0},"6Q5juGZiV0t-vqZWW419xg":{"text":"I'll start by saying that the food was fantastic! However I have to take 3 stars off becau","useful":1,"cool":0},"QaqrLBQ33xMY8E3xr2jiVg":{"text":"Great date night spot! My husband is a big seafood lover and was not disappointed ! Great ","useful":0,"cool":0},"HvQkugWBuXDEtO4dhddVuw":{"text":"My boyfriend and I were stopping at New Orleans for an evening before continuing on our ro","useful":0,"cool":0},"rRWZYyaghpdkCGccmeas0A":{"text":"Food was great service was great \nThey are right across the street from a seafood market t","useful":0,"cool":0},"jODfCVzaZ3PDxeSdx9_2BQ":{"text":"Had the chargrilled Dungeness crab, charbroiled oysters, and pasta. Food was good. Oysters","useful":0,"cool":0},"BfGL1P67zw7GjLI-ab-cIw":{"text":"Just had lunch.  Great crawfish, shrimp, raw oysters...etc.  I live local, but was my firs","useful":0,"cool":0},"QXFiLVw3q4tER9PO9-it-A":{"text":"This was exactly what I wanted-fresh shrimp, crawfish, crab, oysters in one spicy messy me","useful":1,"cool":0},"oOsklW6XF3XvY1F4hOzkPg":{"text":"The bang bang shrimps were amazing. Overall, I'm a local and I would prefer my boil seafoo","useful":0,"cool":0},"z9C-YDTmvsdY8xZnZ5mPSw":{"text":"Service was a hot mess, but the delicious meal made up for it! Mango margarita blended was","useful":0,"cool":0},"Q_wz-ocGcuBghe0YgFQICQ":{"text":"Boil House was a great experience. The service was Great. Tim was excellent. Food was fair","useful":0,"cool":0},"KydtGctKH68uU9CD8wW-vQ":{"text":"Absolutely amazing food! My husband and I had the feast and the gumbo.... totally worth th","useful":0,"cool":0},"NFJPYETpljZKhJYVxqOJ5Q":{"text":"I've been to a lot of finger seafood places but this place was some of the best cooked sea","useful":0,"cool":0},"oRuo4Wn_eQFRYP6mL8xlJA":{"text":"This place was good. We made reservations and we were seated pretty quick. The service was","useful":2,"cool":2},"qkbrLBkxi1NrWcDFxIOoeg":{"text":"This place is awesome!  The boil and seasoning is off the chain. Great little spot out Fre","useful":0,"cool":0},"K1whQ-bVdBYUADEMJu4ftw":{"text":"Service is slow, food was cold & nobody seems to know what they're doing... super cute pla","useful":0,"cool":0},"_boGERl6P4v5YgRTrtp_xA":{"text":"The seafood is good, but the sauce they use for the seafood platters is really good and re","useful":0,"cool":0},"iDU4PnccjSShH25NMakPxQ":{"text":"The seafood at Boil is really good!  We were able to make reservations online and got to s","useful":1,"cool":1},"dLo_IaQmIKZEgqwK3jmnyg":{"text":"I'm giving them a four star for various reasons.\n\nFirst: Hostess-she was nonchalant and ru","useful":0,"cool":0},"6rTicAsHO-h7VA_ync_q4A":{"text":"First trip to New Orleans. Had to try some crawfish. 4 of us were in town for a wedding th","useful":0,"cool":0},"1vUAM-gPxQ_eehX5vK8Eaw":{"text":"This was our first stop on our food tour and it did not disappoint! I've been to Nola befo","useful":0,"cool":0},"Sq0pYjNqzS1qdu1Bcj1bCA":{"text":"We were in New Orleans for one night so of course we wanted to indulge in a crawfish boil!","useful":0,"cool":0},"y-roToy9nHyHiSk4D9gUFA":{"text":"Atmosphere is really cool. The food was ok. Not your traditional NOLO crawfish boil. They ","useful":1,"cool":0},"snMDQ1cGXYBU6EFClEMfAA":{"text":"The service was HORRIBLE. I would NOT recommend this place at all !!!!! I came all the way","useful":0,"cool":0},"j8H2m4aK3O6KIuldYbf3aQ":{"text":"Don't be fooled by the cheesy decor, the food is actually very good! We came on a Saturday","useful":0,"cool":1},"O5d35n1fdBKqoGRFbHAwPQ":{"text":"I chose Boil for my birthday dinner a couple of days ago, and I'm so glad I did! The food ","useful":0,"cool":0},"ygeQm9CsR-ncypy6zAHsUQ":{"text":"Split the cajun classic seafood bucket and ooooh was it good. The place is a bit small, so","useful":0,"cool":0},"QR-QeHH_Qe44pNDPiifc9Q":{"text":"I came here on a trip from the west coast and a friend who lives in New Orleans recommende","useful":0,"cool":0},"qrTMsl4cA8E5Sb0Di1wwRw":{"text":"Keep walking past this place because of the lower rating but finally went this weekend and","useful":0,"cool":0},"Cd4jUaQGA0TxcRbgycpQJw":{"text":"This place is AMAZING and do not forget to ask for Pat!!!!! She is a 10/10 rock star serve","useful":1,"cool":1},"Im37NOeCuYWs5qu5mQK83w":{"text":"I remember I came here in 2018 when it first opened with family from New Mexico and this p","useful":2,"cool":0},"NesGvmdzFGa-qS9eOR5wVQ":{"text":"So we went in for crawfish after reading they served it and as we were sat we saw on their","useful":1,"cool":0},"8sub5HOZuSpjbCGerPbwog":{"text":"Service was not that great forgot to bring us our wine and the broth was way too salty whe","useful":1,"cool":0},"RHKQSpV8qt_iTiDSXPWYzw":{"text":"Great boils with choices of spice levels.  Had muscles with lemon butter sauce with medium","useful":0,"cool":1},"GEPxj5B_YPAcFU5ulKl2qw":{"text":"Located in uptown on Magazine street it's one of our favorite to get crawfish and shrimp a","useful":0,"cool":0},"961rIn0s-_Qu7tXUZfQ5ww":{"text":"This place is absolutely incredible - especially if you can get a table for a large group ","useful":1,"cool":0},"lbCvZDhl-RHCzJI5E68qRw":{"text":"Ratings\nFood - 10/10\nStaff/Service - 10/10 (Shout out to John Brown!)\n\nMy wife and I came ","useful":0,"cool":0},"K58h72EfBntYZSz7seOdwA":{"text":"I was so excited for this meal but it was overly salty and the seafood was soggy.  The wor","useful":1,"cool":0},"LoDE0Qbj2Mzx09vHCe-CLQ":{"text":"This is a darn good spot for a seafood boil. My friend and I shared the snow crab and muss","useful":2,"cool":3},"D07JJb5JgkjVor0fObhuLQ":{"text":"Found this place while traveling with friends. Incredible! This is a 'don't miss' spot. No","useful":0,"cool":0},"ChwgchXDi-vEFnJx83nkeA":{"text":"We made reservation for our Saturday night dinner and we're served promptly which I apprec","useful":0,"cool":0},"8osL9spUKA3Gky7lb_M2hA":{"text":"Was recommended for our first time visit to New Orleans. Did not disappoint. Our server Ju","useful":0,"cool":0},"z4OQTXjdhpC0LBH4lkSNYQ":{"text":"On our birthday trip we stopped here. The food was good but I think it's overpriced. I ord","useful":0,"cool":0},"cTh2Ussl3YH2761czbxxjQ":{"text":"This place is AMAZING! This is a MUST if you're in the NOLA area! The service was awesome ","useful":0,"cool":0},"RMt1_PIhDI60fEACclMshA":{"text":"We got the house sauce (which is a mixture of Caribbean, Garlic & Butter, and Cajun) with ","useful":1,"cool":0},"CegTkYdEXOjdeqG22k7W0Q":{"text":"Wow, where do I begin? We decided to check out the place since we live around the corner b","useful":0,"cool":0},"3yoMOnEKGmZqMjMnmgzJ-g":{"text":"Let me tell you , I love this place ! It has a nice chill atmosphere. And the food was was","useful":0,"cool":0},"69UUKtFlfeC7K6ttyeMuFQ":{"text":"Cute fun small restaurant. Came without reservations but had great service for four at the","useful":0,"cool":0},"rwX1HlN0NFMP0g52z-d5Wg":{"text":"The food was alright but it was a bit salty and everything kind of had a dirty salt water ","useful":1,"cool":0},"rLfusFSUE-cdU_Kao4AESw":{"text":"This place is beyond unprofessional. As a Maryland native I thought the seafood would be g","useful":0,"cool":0},"Eu-VLHqQJUUNzRJxjpXCFw":{"text":"Wow what an experience! Having never been to a Seafood Boil before, we had planned to find","useful":3,"cool":1},"XaQYNbwbSfH8X_Kz5JRuAw":{"text":"Definitely the most bland crawfish I've ever had!! The \"Taste of New Orleans\" bucket was a","useful":2,"cool":0},"EFLbTb76b5xxJPb5DJsGsw":{"text":"Probably the best tasting seafood I have ever had. The service was amazing the atmosphere ","useful":0,"cool":0},"Yqr2SmmjiMRhPSDKJBZ0BA":{"text":"This place was amazing! A nice clean establishment during the pandemic with delicious fres","useful":0,"cool":0},"HvPJfa3H17tDNyGDFThr0g":{"text":"Very good. Might be a long wait so I recommend making a reservation (we went for a late lu","useful":0,"cool":0},"57oMQQss2LpWscBfz05mzg":{"text":"When in New Orleans, seafood should always be top priority. Came here for dinner and I'm s","useful":2,"cool":1},"ECu2NMSvWgWh0UMutX8Kfg":{"text":"Ordered the Taste of New Orleans: 1lb of Blue Crab, 1lb of shrimp, 1lb of crawfish, corn, ","useful":1,"cool":0},"KrEdoYijfiHnV7I7ky3L8w":{"text":"Terrible food and service. Do not go here. I love crawfish and I didn't even eat my meal h","useful":0,"cool":0},"LvsVs6VTBmTfswBszDtdVA":{"text":"Fresh seafood with your option of flavor profiles ...great service.  If you go during Happ","useful":0,"cool":0},"1Opw5Gf70LSd46fJzSw6Jw":{"text":"My sisters are lovers of seafood boils and they were very excited to try this place. One s","useful":2,"cool":0},"IbSgZCIBSWcln0zOZBFtGQ":{"text":"I had a good time here. Lisa, our server was very friendly and helpful. Me and my friend g","useful":3,"cool":3},"6-4Vv5JAqx6ChekOXLbF_w":{"text":"When a place gets it right they get it right. The seafood here is so amazingly delicious. ","useful":1,"cool":1},"9IxEZT2WoJwSJ1KDIcxAJw":{"text":"Oh mah gawwd it was so freakin good! We wanted to try an authentic seafood boil while we w","useful":0,"cool":0},"O-hqogBduLXVS982BZLrrw":{"text":"Really simple, straight to the point ordering. Sauces were DELICIOUS. Catches were robust ","useful":2,"cool":0},"Dr--T1yICV39nzC9TQ4PhA":{"text":"Good food. Service was very subpar and then the waitress failed to let us know that tip wa","useful":2,"cool":0},"qgdd4s1Z5rZuUesfLxXZ0A":{"text":"Coronavirus and a cancelled cruise? Make the most of it! A well laid plan...did turn into ","useful":0,"cool":0},"3fo8ajfrcove8OM2TESMjg":{"text":"We enjoyed the foods here! Their spicy is actually pretty spicy - I got medium and it had ","useful":2,"cool":1},"dnL77k9peNucLPGYdZIyIw":{"text":"Amazing!!! Omg. So flavorful & not as greasy as you would think! Polite waitress and great","useful":0,"cool":0},"gPacI8lCAbDMQbH9pmftZg":{"text":"We started our day on St Charles and, while beautiful and something you must do in NOLA, n","useful":4,"cool":1},"eoibzq7qQhJcGvV1kc9k4A":{"text":"I'm from Bayarea, CA and I have always wanted to try seafood boil from Louisiana. After do","useful":2,"cool":1},"S7vvQ98vaUxouuqN882xTQ":{"text":"I can't comment on the food because I never even got to try it! We had put our name and nu","useful":0,"cool":0},"PBAfU2gA5P2P94gsAeHiHw":{"text":"Great seafood stop. Dustin was awesome, recommending some great crawfish. Good oysters and","useful":0,"cool":0},"CLUrSr3-yMXEZkWuMRdl7w":{"text":"Delicious! Seasoning was perfect, setting was comfortable and casual. Justin, our server, ","useful":0,"cool":0},"6kVz6Vib3kg05ey_CvqT8w":{"text":"Ate here Monday and everything was great! Brandy was attentive and patient. There was a $2","useful":1,"cool":1},"3VVfqYBbdMJk0_xSSdOIoA":{"text":"Visited from California and dined here twice.  Food is amazing and the service is great.  ","useful":0,"cool":0},"hkhCIc1ItyW-d58wtzL9qg":{"text":"We ordered the House bucket ($59). It comes with 1 pound of crawfish, shrimp, snow crab, c","useful":0,"cool":0},"zvXw-Tq_HoD2VSuiNs4Wkg":{"text":"This was my favorite food stop during my weekend trip to New Orleans. Yes, the food was gr","useful":2,"cool":1},"Jje0BXZ7qZBJcZLf4lL_ZA":{"text":"We read the bad reviews, but really just wanted something close and easy. We're good we di","useful":0,"cool":0},"PDaOetPHpYhwPVsBcoGmNA":{"text":"Tried this new spot out when I came in from out of state to visit some friends and let me ","useful":0,"cool":0},"2lNdgA2m6jwG3CMWboe4mg":{"text":"Looked around for places off the beaten path. This place is down to earth New Orleans. The","useful":0,"cool":1},"sR6IvU6Ken4qohpj63dxMA":{"text":"Excellent spot to come to for a good seafood boil. The meat tastes great and the garlic bu","useful":0,"cool":0},"1NADR5P-4HSiDc3XwbtnXQ":{"text":"The perfect place to try a boil. We were visiting this past weekend and had people with us","useful":0,"cool":0},"zh0LxxHOVCUqKNbGHHUwbQ":{"text":"Stumbled in here by blind luck.  Really good food and service with a menu that even the pi","useful":0,"cool":0},"P6TzUl9XAJ9XV6Lpxk9OnQ":{"text":"Loved this place! A little pricy but do-able for good food! Don't you leave this place wit","useful":0,"cool":0},"6SWLtBkwGCdFjAUFCRu9EQ":{"text":"We went on the hunt looking for seafood for dinner and came up with the Boil House.  We ca","useful":1,"cool":0},"2G9ls_e4mt17cpqQxMeM7Q":{"text":"I loved this place. The food is delicious seasoned to perfection. We tried other places wh","useful":0,"cool":0},"kHjWYujWqow3ZZOaKhwFQA":{"text":"Great crawfish boil and drinks! Amazing service and Fried alligator! Highly recommend goin","useful":0,"cool":1},"Fu9hnd7mTI3BGy0HaKO0eg":{"text":"The food was awesome best sea food boil I've had. The garlic butter sauce was amazing! If ","useful":0,"cool":0},"ube5NyKYS3HyFRiB-kWT5g":{"text":"Ok so the flavor was good although the medium was more like mild so if you like spice get ","useful":2,"cool":0},"gbrTLbO45FqT6T2gZNzkvw":{"text":"Sadly this experience went about as poorly as possible. From the bartender being agitated ","useful":0,"cool":0},"csuJd0C27npU_eNkp2aVLQ":{"text":"Came here for my birthday tonight and had a delicious messy cajun seafood feast. We ordere","useful":5,"cool":2},"x647w228_wK3Vd_r6kcEpg":{"text":"First of all I'm born and raised in New Orleans. My family and myself thought we'd try thi","useful":2,"cool":0},"wBMrB8k72IiYSkFtGC8KoA":{"text":"Amazing food! Amazing service by Kishor! He always kept our drinks full! Came during happy","useful":0,"cool":0},"zM4SyqYvI3Uo2MPccYxQEg":{"text":"Terrible experience. We stopped here tonight as our first dining place on our NOLA trip. I","useful":0,"cool":0},"SiFXLtJA6y6DxRXu83A7TQ":{"text":"This place was great. I wanted some crawfish and where else to get it than New Orleans. Yo","useful":1,"cool":0},"OEgZ75ajgsK6LMUR-MaBMQ":{"text":"We stopped here on a Tuesday after spotting the fifty cent raw oyster special. They were d","useful":0,"cool":0},"N3lR9A8P4DghIN8Ew9IlBg":{"text":"This place was great!!!! The only thing I would suggest is to make sure you are getting as","useful":1,"cool":0},"mRQDnYEj1E6A9Z-boD4wFg":{"text":"Amazing flavor! So worth the 30 minute drive for pick-up.  Choose the house sauce.., it's ","useful":0,"cool":0},"OyrtACZRrpaEpZzDoIX_Ww":{"text":"Definitely a great seafood spot. My friend and I split the Classic Cajun bucket, Carribean","useful":0,"cool":0},"HcuEv1z-emJJi0on6eLb3g":{"text":"It was an ok place to eat! Nothing special! Shrimp was good, crab was just ok! The flavor ","useful":0,"cool":0},"p-PmVVDGrfU7Zjhh0Cp5VA":{"text":"Made a reservation. Confirmed. They confirmed 2 hours before dining. Got there, they were ","useful":0,"cool":0},"B8rH9GGWmDq_dlHB_tq-Pw":{"text":"When in NOLA you gotta try cajun seafood. Food was good and price is reasonable. Hot in wi","useful":2,"cool":1},"R5dDES6YKJrJNZQyWCI0XQ":{"text":"This is the best seafood place I have had in New Orleans. The seafood is fresh and the fla","useful":0,"cool":0},"QaGD7jrlZw_oaQi0L-NMsw":{"text":"I know this is a seafood boil restaurant however, i order Chicken wings and fried shrimp h","useful":0,"cool":0},"uumES9PesOtHC1dpWDw5qQ":{"text":"So HAPPY we stopped here for some Snow Crab and Crawfish Boil during our Visit to New Orle","useful":1,"cool":1},"ATi6UkbGaq1SvMcCW2VOcA":{"text":"All of the staff members were super attentive. There's a giant chalkboard wall of the per ","useful":0,"cool":0},"mon6aZ0mBz_Z7jon7T49CQ":{"text":"My boyfriend & i were in town from Austin & went to boil seafood house and got exactly wha","useful":0,"cool":0},"iu1EqDGohyu1bPjTa1a3UA":{"text":"Place is pretty good! I would come back. Great prices! Our server Jennifer was amazing! Se","useful":1,"cool":0},"LkHHj-nrNHxTmCH7gUHurA":{"text":"We are from Pittsburgh and visited New Orleans for 5 days... we came to this place TWICE i","useful":0,"cool":0},"KxkQN06qgc7vuzY19d9k3Q":{"text":"Great food, good service! I came for my first crawfish boil and I left SATIATED.","useful":0,"cool":0},"R1U0ifQIgI4Yfu9vzUO-MQ":{"text":"Really loved this place! The seafood was great and our server was really sweet and attenti","useful":0,"cool":0},"TSj_YSioS2wXp_6ZP6QDPQ":{"text":"First time in the area and I am glad I walked into this gem. The employees were very helpf","useful":0,"cool":0},"u5zCIQ_e37ph9x5uY3Hm6Q":{"text":"Looks like a great place, but I've only done delivery - and I don't expect to be dining in","useful":1,"cool":0},"g9oIBcXtmE2MYWnoVeaxAg":{"text":"After a bit of resistance, I allowed the bf to persuade me into going here. Im very partic","useful":3,"cool":1},"26cDHkGAbNp3qiXo3di48A":{"text":"Crabs was good season just Iike you like them. I recommend. However just like most places ","useful":0,"cool":0},"NaSZA9BuAB3NMm2YKE4tfQ":{"text":"Stopped here for lunch after going to the zoo as a recommendation from our Lyft driver. Th","useful":0,"cool":0},"w9o9KvX3cNongySLnVPyOA":{"text":"Place is pretty busy and nice atmosphere. However for the food, the seafood is really lack","useful":1,"cool":0},"MW1BIJqtvlybiy02eGXEEg":{"text":"Get the house boil. Best seasoning! I could've sopped it up with bread! It was delicious! ","useful":0,"cool":0},"gO4rRpP0RE_GQcAmRwPrRA":{"text":"Amazing flavor!! Great prices they have a great seating arrangement for larger family styl","useful":1,"cool":0},"078VF8O35n9Jg3Q_jme2ng":{"text":"Horrible experience!! We made a reservation and included in note that we had a puppy with ","useful":0,"cool":0},"FAIwXojobGImApMzkpXXDA":{"text":"There was a lot of hype about the crawfish at BOIL so we had to check it out. Drove an hou","useful":0,"cool":0},"jWI9d_4rblcvSFuRCNEq8w":{"text":"No questiin that the food was good...Fresh, well spiced and balanced. The rest of the plac","useful":0,"cool":0},"pTrUoPY1vfwUanqN0iQVDQ":{"text":"I'm currently in love with Viet-cajun seafood. I enjoyed the food (I got the cheapest plat","useful":1,"cool":0},"pUPugyn7EYqyyY3CI3toCA":{"text":"Seafood was just okay. Ordered the $56 taste of Nola basket, which they said would feed fo","useful":6,"cool":1},"Pn4guHJQGb18LGFo5RUm9w":{"text":"Great atmosphere and definitely filling. We shared the Shack Seafood Bucket and it was ple","useful":0,"cool":0},"DPyceQqI0JXBztnLK7rGIA":{"text":"Went on Monday afternoon for a late lunch to end a week long seafood craving. We started w","useful":0,"cool":0},"P7Auc19uYwBs1c7hO19WYA":{"text":"Didn't have the boil food but the appetizers are AMAZING! I could write a glowing review o","useful":1,"cool":0},"es0O6uki0OoOLf-ahX5a4Q":{"text":"I was craving boil seafood particularly crawfish. My boyfriend and I stopped here on a Sat","useful":1,"cool":0},"nAVFo-Yh4aVU9J7BP2GfJQ":{"text":"Maybe because it was talked up so much, maybe because the food wasn't seasoned that well..","useful":1,"cool":0},"WW8gxMwj4oKxcniKwqqd_A":{"text":"We went on a Wednesday night & the place was still pretty packed. It is very small on the ","useful":0,"cool":0},"T95H_I82xgdBy4mhRiok-A":{"text":"Cajun, Cajun and more Cajun is all I can say!  This place delivered a powerful flavor punc","useful":0,"cool":0},"s5th6DpkJ9tfo5IcY5nihg":{"text":"I hit up all the recommended crawfish places in 2 weeks and this is the best one.  Probabl","useful":0,"cool":0},"i_aH12IL6S-7GrWDVa0FdA":{"text":"Food is super overpriced for the Tourist!! Food was decent not the best but overall Pretty","useful":0,"cool":0},"Im3Qvh0FuuP4vA3tXIaz3A":{"text":"50 cent Oysters (on Tuesday) Say what? The seafood was fresh tasting. The customer service","useful":0,"cool":0},"eVtnyVXBG9C7FxsAe_e0Qg":{"text":"We arrived and didn't have to wait too long, it's decoration of a swamp scene highlighted ","useful":2,"cool":0},"YcoJzJTMZJ-Axv0TPSDPcg":{"text":"Pretty good. Although I was looking for a buffet with unlimited crab legs this place remin","useful":0,"cool":0},"_Ajo3-qvlbZGPXAs5cSZag":{"text":"While visiting New Orleans my friends and I were craving crab legs. Boil Seafood House was","useful":0,"cool":0},"_NjCsV6zULWUHJGBJTJxpA":{"text":"So our original eating plans were canceled so we didn't know where to go. We got to Magazi","useful":0,"cool":0},"v6ICCeLVaf8NH3Ysl8uVCQ":{"text":"My friend and I made a reservation at BOIL Seafood House for 8:15pm, we were seated right ","useful":0,"cool":0},"yHrsy6cCeXdtsG-S7tkXOQ":{"text":"This was one of the best spots that we visited. If you are in a rush. This is not the spot","useful":0,"cool":0},"7FKdzdxRv32mRN2cbpnyoA":{"text":"Good crawfish is not easy to find in NOLA, and this place blows it out!!! Ahhhhh.....mazin","useful":1,"cool":0},"Kz_7simdDYzbKAz7oD0x4Q":{"text":"I have to preface this with the fact that we didn't actually get to eat here as the servic","useful":1,"cool":0},"MamfZBSNMHyE4eQ-zpr1mw":{"text":"Good place first time there,, they were super kind and sweet especially after all the city","useful":0,"cool":0},"jBZmFLcVYqySf5sgOipJpg":{"text":"Seafood is good. The crabcakes were OK, not fantastic.\nPlace is small. The ambience is nic","useful":0,"cool":0},"lKiu8C6IUpAvbiCe_iptcg":{"text":"Had a wonderful lunch with crabs and shrimp!! Our server Ms. Pat was amazing. She not only","useful":0,"cool":0},"QwK_DZRxaifjqusYgTCiUw":{"text":"ALL THIS FOOD FOR 47$!!! Sooo good! The flavor literally tasted like the ocean w a little ","useful":1,"cool":0},"1m7V_3S73l23baxeQvhDjQ":{"text":"My dad was visiting from out of state in May and we ate here.  They had the blue crab on s","useful":0,"cool":0},"QXfWnV_HpaBtN5CSDncOXA":{"text":"Great food and staff. Came back the next day as well because it was so good. Priced reason","useful":0,"cool":0},"ruJY7pEkC2VAlZoJMvF9dQ":{"text":"Felix kept the glasses full and the water cold as we went for the hot Taste of New Orleans","useful":0,"cool":0},"_h2SZ8Rb7YBAlUEu-jWYFA":{"text":"MAN THIS PLACE IS A MUST! We ate the entire boil and all of the oysters! I love raw oyster","useful":3,"cool":3},"Mbp9BWMJi5eyhW857n9JbQ":{"text":"Greetings,\n I am writing this letter following my dissatisfying experience at your restaur","useful":0,"cool":0},"1iwHsIzyceYigzEDNsbW8w":{"text":"Came here on a Monday night around 8pm and the wait is about 45 minutes. When I was back h","useful":1,"cool":0},"g_8GO-e_UMUIg4vBWT_8oQ":{"text":"This place gets busy so I def suggest getting a reservation. \n\nI got the boiled shrimp and","useful":0,"cool":1},"xspfF-7SOwpw8PZe99jOWg":{"text":"Service was phenomenal, food came out super quick, music is pop culture related, atmospher","useful":1,"cool":0},"Rv6sfXYwuyPVTvsx-t6t3w":{"text":"This restaurant has a nice vibe and is generally pleasant.  We came because we were lookin","useful":1,"cool":0},"ubTwcOnnF2ad_LOGdnjjhg":{"text":"I AM OBSESSED. 1st time trying oysters so Sammie recommended the Charbroiled oysters. BEST","useful":1,"cool":0},"qPFG8n3Qddgn_Hcehj4x6g":{"text":"The food & the service were phenomenal. Of all the seafood restaurants we went to in NOLA,","useful":0,"cool":0},"uy5dJ2hg2fph4IJ--BYMpw":{"text":"This was our last stop before leaving NOLA after visiting for 3 days. Our experiences were","useful":1,"cool":0},"05XbBRM4-2YP4mUcCeIvGg":{"text":"Seafood is a stable in New Orleans & you can't go wrong with Boil Seafood House. They have","useful":1,"cool":1},"-z8-ekC7H0QXqIY3wlPyjA":{"text":"If there's something you'd want in a seafood boil, this place has got it.  Those chargrill","useful":1,"cool":1},"grSIf-MBzSPMJXjQRtGjFg":{"text":"The one of the best food hunting experiences I've had in NOLA. Great spot with a in-house ","useful":0,"cool":0},"PEqgcm5HDE-bwlY9G1ENoA":{"text":"Visited New Orleans a few months ago as a preview to moving down this June. When we were v","useful":0,"cool":0},"N0MogxSQEt3vCS6C2GJXFw":{"text":"Thanks to this place, for the first time in my life, I wish there were Razzie awards for r","useful":10,"cool":1},"fO2BzaCLUlJXS9p6ka9mhg":{"text":"Looking for Oyster Po Boys in Nola. 1st stop was out of Oysters for the day. Quick Google ","useful":0,"cool":0},"uRUfBe2qPTzedfHJf5mxQA":{"text":"New Orleans was a great visit! The crab boil I had from BOIL Seafood house has set the sta","useful":2,"cool":1},"YxPZpEQqft0lLuqpswdO1Q":{"text":"The food was absolutely amazing and the flavor was phenomenal. \n\nI recommend my coworker t","useful":0,"cool":0},"6unqYpDH3gC-yMVuvwIwzA":{"text":"Fresh and very flavorful seafood boil! My family and I came here for lunch and were very s","useful":16,"cool":15},"sSrRQHvKT7XF2qZPeKSMlA":{"text":"I had a family member visiting in town and she wanted to eat some seafood and sit outdoors","useful":1,"cool":0},"oapINqvCaUZC1_TV1q3VxQ":{"text":"Ça c'est bon!!! \n\nI almost don't want to review this amazing place as it is clearly alread","useful":0,"cool":0},"KxccnZFLJUyTkNfhC5lYBQ":{"text":"Justin was AMAZING.. Food was GREAT!!\n\nCrawfish Beignet.. Seafood Gumbo.. Fried Potsticker","useful":1,"cool":0},"GFWxrQBUUIPfeL-TtuiPSg":{"text":"The food was tasty. They weren't busy but the service was still slow. Decent prices too. M","useful":1,"cool":0},"RDLsWGjhC-Lyl-LOyiKqgA":{"text":"Wait time was crazy but the crawfish was worth it. Highly recommended the Cajun classic","useful":0,"cool":0},"oSJmxIF1CQomp3mb7APThw":{"text":"Simply amazing!!! If you've never been to Louisiana this day place sets the bar for good f","useful":0,"cool":0},"BQcNdubz1tOfYzSxZsQWag":{"text":"Food is fantastic! My wife and I visited during a conference (only a ten minute Uber ride ","useful":0,"cool":0},"d45schMFZBvoGJtUNxWTpw":{"text":"So during my homecoming back to New Orleans (I came once before and fell in love) I was cr","useful":0,"cool":1},"ceB8IFADuAjV-bacjMy9oA":{"text":"We got a winner! If you are visiting, love crawfish and love oysters, take the cable car a","useful":1,"cool":1},"rDXkIr9mGAYkw_Kl571bOw":{"text":"Went for lunch on Saturday and the hostess was amazingly accommodating with our family of ","useful":0,"cool":0},"XdbUASadltu6gKHZbRgPRg":{"text":"Lots of fresh seafood to pick from! This time I went with shrimp, crawfish, Dungeness crab","useful":0,"cool":0},"H26gMBcoM7zHsCvqnbfuww":{"text":"Me and my girlfriend came here for dinner and it was amazing ! We made reservations in adv","useful":0,"cool":0},"NStJ9B9IfNJOjuUsP9T2iA":{"text":"We went right at 3 for happy hour didn't need a reservation since they had just opened. (3","useful":0,"cool":0},"UXKCpdp075EbZIjAba6UMQ":{"text":"A little bit of a wait but WELL worth it, and expected on a Saturday night. Food is fantas","useful":0,"cool":0},"-cnp-9YVlga44q9lGJqSEg":{"text":"FOR SURE THE BEST BOILED SEAFOOD IN NOLA!! Location is amazing. Perfect New Orleans atmosp","useful":0,"cool":0},"_6Rb5iCryDRRHYTWpjk-HA":{"text":"I told my friends all that I wanted was some seafood when we were here. We got the recomme","useful":0,"cool":0},"0o7idqwU7L20CpXVMulmJA":{"text":"The food was good. I was having a great time until the waiter put all of our meals on one ","useful":0,"cool":0},"uamGMyC7gRtH4qyMQgPAdQ":{"text":"The food was great the line was really long and we were told it was going to be 45 minutes","useful":0,"cool":0},"jpIqBG44MGczgc0SjlfewA":{"text":"The shrimp Po boy and The feast were cooked to perfection!!! The service was fanastic. The","useful":0,"cool":0},"zuy3pKsD2352kUek2m9omA":{"text":"We're out of towners visiting from The DC area and staying in the Irish Channel section of","useful":1,"cool":0},"YeTvo_GE6Hl0LGqHTCD0CA":{"text":"The restaurant is pricey, but for a reason, you'll have the best \"seasoned\" seafood platte","useful":0,"cool":0},"f174I_JC__j4InYIqQxtkQ":{"text":"Started with drinks and it seemed the bartender was having a hard time making the drinks a","useful":4,"cool":1},"LTMHm5wwQ5kIw3XKylts6g":{"text":"We asked some locals where the best crawfish and seafood was in New Orleans and Boil was t","useful":0,"cool":0},"VD-pSNG3hD8w9FYHO3-Z5Q":{"text":"Amazing food, but terrible service. I feel if we had a different server, it would have had","useful":0,"cool":0},"iPakQ_rpKc4La0YOjFFknQ":{"text":"Boil Seafood was our second stop on our own NOLA food tour. I desperately wanted to try Ca","useful":5,"cool":0},"SwLhUYV1zVZYxCBQwU4VGA":{"text":"Great food & service for my Mom's birthday. Waitress accommodated all of our needs, includ","useful":0,"cool":0},"FAHNYD7lB5cSSxPGA6mCUA":{"text":"The food is great...I highly recommend eating here...When I return to LA I'll be back.","useful":0,"cool":1},"_1Cl3f32eYZEvmhTGzSY8w":{"text":"The food is amazing here. Better than any Boiling Crab. Must get the Boil House flavor. Se","useful":0,"cool":0},"Z-dv7zLpbkvD3d2QF7Lucg":{"text":"The food was good - it was a bit salty but still okay.\nGiving 3 stars because our waitress","useful":1,"cool":0},"RRaShhJlgFQ1pDj7y3Vy9g":{"text":"Came here to try so seafood and it was pretty good to say the least. \n\nWe placed our order","useful":1,"cool":0},"CXU-6jN-9GCB9-0pvuRbuA":{"text":"This place is amazing it's a must go if your looking for truly delicious seafood. The drin","useful":0,"cool":0},"cLq_p6U7AOk-aQvFNfgu5Q":{"text":"We had an excellent waiter what was nice.  Make a reservation if you go on Friday or Satur","useful":0,"cool":0},"QOxZOLnRyr8sqPRCjZjDEg":{"text":"Decided to come here with my family and everything was amazing! Their service was fast, th","useful":0,"cool":0},"_t1S6-TSuPfvEb8SCA4YPw":{"text":"Great customer service amazing food chargrilled snow crab is so good I've been here twice ","useful":0,"cool":0},"xXXIpOhLAIpRz--gwckDlQ":{"text":"I really enjoyed the garlic sauce on my seafood. The service was great I did not think the","useful":0,"cool":1},"_r3DNylTD-nOTT1L1PYSVA":{"text":"This was a great random find while my friend and I were exploring the garden district and ","useful":0,"cool":0},"QtGeV15gculWtvbvNyApBA":{"text":"Great seafood, friendly and efficient service.  Definitely one of the best spots in New Or","useful":0,"cool":0},"8syXU2pJIhzszdhNV30K1g":{"text":"This is a true hidden gem!  Only about a year old but this place knows what they're doing ","useful":1,"cool":0},"XxX55s8NcjCUp5tw2fXIJQ":{"text":"I really wanted to like this place. I always like to have recommendations for friends and ","useful":0,"cool":0},"SotZLvWWTQJ0SsfTzvrl3w":{"text":"I was looking forward to this place opening but was also convinced I was going to be disap","useful":1,"cool":1},"ndH2Y16u5JhowkvJyKURbg":{"text":"I made a reservation and these people told me 20mins, I called and get and update as I nev","useful":0,"cool":0},"mtNBH7v_8kK0kMt5yQOfOw":{"text":"My son is excited to try seafood boil while we are in New Orleans; I picked this restauran","useful":0,"cool":0},"zQQX4RT6kO7eMFoYLyPIRw":{"text":"Great atmosphere and interior. The staff and the owner were very friendly. The crawfish is","useful":0,"cool":0},"zRDd4cNNFTgzRAcyPwwHRA":{"text":"So I was a little scared to try this place as I'm not used to this kind of style and I'm a","useful":1,"cool":0},"Rd8_hGUBZJJaHnEouE45yQ":{"text":"I love seafood boils and Thai one was good. The flavor was great and the service was excel","useful":1,"cool":0},"9ZKZD-LeaTcmj1u14iHGCQ":{"text":"The food was good, but..the customer service was not accommodating at all. 2 members of my","useful":0,"cool":0},"frjb9mbQ9ITDoXztNWyAew":{"text":"AMAZING AMAZING AMAZING FOOD! The wait was long but after trying the food definitely worth","useful":0,"cool":0},"WZhpgXPPhTZzeesNqiIK4g":{"text":"Totally disappointing. This place was completely dead. Still, the service was a struggle. ","useful":1,"cool":0},"8nbXIb2627frUbe5l10gwA":{"text":"The crawfish was so tasteful and order high heat because it's worth it!! Will be back! The","useful":0,"cool":0},"ia9giMuNKB4zmqVgUR5l7Q":{"text":"One of the best food experiences I've ever had. Our waiter was so attentive and the servic","useful":0,"cool":1},"ouxTo607OByUyXMKtSFTAQ":{"text":"their crawfish & crabs are soo good. they have weak drinks tho the margarita was a lil too","useful":0,"cool":0},"lMsh8rSwSjixlWM7CntRNw":{"text":"King crab legs only come w four little legs and doesn't even come with any potato's or cor","useful":1,"cool":0},"gC51M5ibaZI1X9HTJWlW2A":{"text":"The food was good, but misleading. I assumed the food was boiled in water, but it's boiled","useful":2,"cool":1},"3O8dBKnl8LFqXXJPkXpXOQ":{"text":"Food very dry and over cooked. People everywhere, no social distancing. A big disappointme","useful":0,"cool":0},"6jVZPhvPtam9TFpdAmP1yQ":{"text":"Charbroiled oysters were on point. Staff super friendly and boiled seafood seasoned with g","useful":0,"cool":0},"4rZmQ2YySzfmRPNC_ZoMoA":{"text":"The food was excellent! The wings were very seasoned and hot 5/5! The waiter was very kind","useful":0,"cool":0},"vx5Qe1o88Siz8lOVx-1WIg":{"text":"This place was just plain bad. It has the word boil in the name for goodness sakes and yet","useful":3,"cool":0},"HmxNZqxf27pTgOMCrFWP8Q":{"text":"Do yourself a favor and GO HERE!! It was absolutely delicious and the service was on point","useful":0,"cool":0},"BlWzWqxzJn7hDI3n8bZo7A":{"text":"Sickening management who doesn't put client first. As out of town travelers, we were beyon","useful":0,"cool":0},"3l-VIshCdwqI3w_WEDAFRg":{"text":"I went during their first week of service, which...ok...they're still working out the kink","useful":5,"cool":0},"j2Q_8Evb6OLTyQpdUUuqhw":{"text":"Was good .... but no REAL butter is being used \nThe boil is seasoned well and to your heat","useful":0,"cool":0},"O7UYed7ZaUAxo6k4Edj_IQ":{"text":"I found this gem through an instagram tag & oh how happy I am that I found it! The food wa","useful":0,"cool":0},"UiuNThgJ2xD2aGDHJvNbsw":{"text":"They're OK at best. If you're from New Orleans, you're not paying $40-$50 and more, for a ","useful":1,"cool":0},"vj87SAtDoUDVICh19HYuDg":{"text":"My guy and I love boils! We eat them regularly. This was by far the BEST. We will probably","useful":0,"cool":0},"3ZEqU2C0Dry3uAWE31ejhA":{"text":"Crawfish were excellent. If you are not accustomed to the heat, get the low boil. Still sp","useful":0,"cool":0},"m9pmzp-ufeSB3Fm1F5CASA":{"text":"Our waiter Felix was amazing from the beginning., it was our first time visiting the Boil ","useful":0,"cool":0},"whLEZwVr9Eu89--6fZxh6w":{"text":"Came with the kids (1 & 2 yo) and the staff was very accommodating! Stopped by a few times","useful":0,"cool":0},"NSuBWsCZCnR0eXZZXnuZzQ":{"text":"The only reason this place is even getting ONE star is because I can't give negative stars","useful":1,"cool":0},"G6EN6Jt0lFXJLamKtyy_DA":{"text":"Wow! This place was delicious!!! It fulfilled our goal of having some oysters, sausage and","useful":0,"cool":0},"1mrrRYImLQD9wRKAD6JRNQ":{"text":"This place was really good. Friendly atmosphere and wait staff. Excellent prices! \n\nA bit ","useful":0,"cool":0},"VIPv01MSLDS7JW1-duklSg":{"text":"The House\n1 lb of Crawfish, 1 lb of Shrimp, 1 lb of Snow Crab Legs, 1 Andouille Sausage, 2","useful":0,"cool":0},"Kt7LGqnDFCKwmNZcZjheQA":{"text":"Brent was amazing!! It was our first time here and he was very helpful and informative whe","useful":0,"cool":0},"h2a3sGOwi1RlPuN6qa28UQ":{"text":"More than exceeded our expectations. Probably some of the best shrimp ever. I think I had ","useful":1,"cool":1},"7XfURC7GTres3jVOgpAJrQ":{"text":"Very tasty seafood boil.  Casual atmosphere  $10 Uber ride from the quarter (thru the gard","useful":0,"cool":0},"D0m4aojS2N9LAYBNF-G5zQ":{"text":"Definitely a great spot for seafood. Serving sizes aren't really for sharing (unless you o","useful":0,"cool":0},"9uoEB3SUwh48TL749PcxvQ":{"text":"So many choices and the review weren't too good but we took a chance. Once in the restaura","useful":0,"cool":1},"hhoPDes4BZC2WOd-7eoegA":{"text":"This place is fantastic! Tried a pound of each flavor of crawfish and it was a great choic","useful":0,"cool":0},"2gd2aGCu-hAyR2CSMQkGmg":{"text":"The food and service here was so great I had to come twice during my New Orleans trip. Jes","useful":1,"cool":0},"6SXQiM7BJXU6cTvmy9N-oQ":{"text":"This weekend I got an order to go. I had ordered several pounds of crawfish and took them ","useful":0,"cool":0},"4iNKfN7IAI4suv7zRYB50A":{"text":"Gave them a try tonight, walked in with no reservations and found seats at the bar. It's a","useful":0,"cool":1},"7c3S4I_FtadyJHemgzvBkw":{"text":"Always delicious and consistent with great service and food.  The charbroiled crab legs ar","useful":0,"cool":0},"q5tt0Byq2wwq-SLMIWz6XQ":{"text":"We ended up stopping in here on a whim after walking down magazine street....we are so gla","useful":1,"cool":0},"B42a5KYjTPq1AKJEJS4HIg":{"text":"Location, location !!!  My biggest pet peeve's is cold food served to quickly.  Makes you ","useful":0,"cool":0},"8sTmJi43EQV2VrSuYQnF4w":{"text":"After reading other reviews and being recommended by Uber driver we changed plans and went","useful":1,"cool":0},"XoyCpOBy1yR4Oj6BxtO8gA":{"text":"Meh-- the staff is the best part about this place. Our server was okay. The bartender seem","useful":0,"cool":0},"zuOp0xfz9n-QtXLBARa-PQ":{"text":"Starting with a drink I had the Blue Hawaiian. Tasted great but could have used just a lit","useful":0,"cool":0},"tJwY8TUFh3Qtd5zNppO7yw":{"text":"From seattle visiting Louisiana . Our waiter was awesome he was a Asian guy he's the only ","useful":0,"cool":0},"NrmGiEH_fZ36KGNWGvcQPg":{"text":"The best seafood out here not going to lie I had a awesome service and everyone that works","useful":0,"cool":0},"tNTsEXhor2BvhepBzlfvhg":{"text":"Decided to check out a place to try crawfish and came upon this place. Started off rocky a","useful":1,"cool":0},"Yg8a7yhGS7dFoFU1W3ny5w":{"text":"So amazing!!!!! Lots of different choices. I had the Cajun spicy snow crab legs! \n\nDecor w","useful":0,"cool":0},"ZU8yF_wJvx-WqvFO3z1zAw":{"text":"The service was okay, but this was $55 on the menu and the waiter said it would be two clu","useful":1,"cool":0},"dXqkMJSL-QC0pzWa2HG_aw":{"text":"AMAZING! This  Please came highly suggested as it is more of a spot for locals than touris","useful":0,"cool":0},"bkhOtUSezPq7eKOAWvQaqQ":{"text":"John Brown was excellent! Shrimp was so good :) sidecar was also excellent. Fast service. ","useful":0,"cool":0},"9A5_PtFUqW3nMGY-c634Tw":{"text":"First time there and everything was perfect! Abi was our server and she provided outstandi","useful":0,"cool":0},"DyNMxd0pp48foEw4as7DLQ":{"text":"Yes, yes, yes.  We were wandering around New Orleans drinking beer and we knew we wanted s","useful":12,"cool":6},"e3fA8AHRkMma2qrviBL_0A":{"text":"If you're expecting to come here on the weekend I would recommend making a reservation. To","useful":1,"cool":0},"Xdy1zUWgtITx7opQJUo8mA":{"text":"Since we were here, we knew we had to get some fresh seafood. We ordered a bucket that cam","useful":2,"cool":0},"MqOXX7PZMibt27uEms5nVQ":{"text":"My first time at Boil house I realized that the prices are a bit steep for a small amount ","useful":2,"cool":1},"SUW3LNjzyBuk5VxlV5rjXg":{"text":"Tried the House Boil with medium heat. It was incredibly flavorful. The spice really soake","useful":0,"cool":0},"qRN0K1vPEDPzkCUJWoZbNg":{"text":"Okay last day in New Orleans and we wanted a Seafood Boil with Crawfish.\n\nWe came to BOIL ","useful":1,"cool":0},"6N25w2D65MW_DFRHtbBbnQ":{"text":"When you first opened on Tulane we eagerly made reservations from our home in Hawaii. Our ","useful":0,"cool":0},"f4jXXVPEK9U_77yRgh0q5g":{"text":"I visited here with my family due to the high reviews. We even came an hour early to get o","useful":2,"cool":0},"f3H9eM6KKw_LR67LDcfhhQ":{"text":"Girls trip to New Orleans so of course food was on top of our list.\nWhere do I start?? We ","useful":1,"cool":1},"9-OIXU_OUK5ayD4WaniazA":{"text":"For a city with strong traditions and who prides itself in its traditional Creole food. Th","useful":1,"cool":0},"wHQhAvLyQSx0T1FM8gScCw":{"text":"I will say. We went on a Saturday night with no reservations and we waited almost 2 hours.","useful":0,"cool":1},"kCYscQnXPX98L7GcvyYKQg":{"text":"Amazing! Service was 10/10, large portions would recommended splitting with another person","useful":0,"cool":0},"luLKT5h_-PYIZsR7N1rlCw":{"text":"My king crab was cold and very very small! It was the same size as my boyfriends snow crab","useful":0,"cool":0},"gEOyfz4sMSWs2ZVJ9bFf8w":{"text":"Really enjoyed the this place sort of wait but not as long. The food tasted great flavor w","useful":2,"cool":2},"DJqYKldPjMxoEbrexdlpTA":{"text":"I'm going to start this review by first saying what an AWESOME experience this was for my ","useful":1,"cool":0},"y43fgUgSDKDqqn_0pW407Q":{"text":"Good eat out of the center of French Quarter.\nGreat service, easy street parking.\nNo crawf","useful":0,"cool":1},"0eJvv6tfrdyDMYB9UKhz8Q":{"text":"Henry is a very attentive and professional server. He tended to our every need and made ou","useful":2,"cool":1},"WaOVQDelhbeNce3R-g6SlA":{"text":"Unexpected find walking down Magazine Street. So many choices and the review weren't too g","useful":0,"cool":0},"hTz8ZljdDC9FIGKxyXm93A":{"text":"Yes just do it!! I saw this place in a YouTube video when doing my research for my trip to","useful":1,"cool":1},"Ey7QDjGvx8rJBoanVPRNjw":{"text":"Unreal time here! The food was amazing and it was such a fun experience. John Brown was ou","useful":0,"cool":0},"X-GDZY8TVWabbNBnqGn1wQ":{"text":"Visiting New Orleans and stopped at Boil Seafood House twice. The classic, house and taste","useful":0,"cool":0},"iMaE1jwJrbbzpAMpcVXHOA":{"text":"Right on Magazine is Boil Seafood House. We come early Saturdays to enjoy this delightful ","useful":4,"cool":3},"o1C9123o5BborCGF4DU-lw":{"text":"After watching Dave Chang's 'Ugly Delicious' and eating my way through Viet-Cajun crawfish","useful":3,"cool":1},"n7sK0um939BJXIuKQvi5Bg":{"text":"Our last meal in NOLA was a success!  We all loved this meal.  Boil does their seafood jus","useful":4,"cool":3},"WYVlGOCSUsf8Rpzr4C2mDw":{"text":"First of all, this place redeemed my visit for seafood boil in New Orleans because the nig","useful":0,"cool":0},"zau36R7Xc3YRtq-8QIkXAg":{"text":"Came here because we wanted to sit outside with my little dog and mainly because they had ","useful":0,"cool":0},"qHDzbV9z0-UDrFZLMqUtgw":{"text":"Eh... not the best boil I've had. The restaurant was a bit dirty to the naked eye. A/c ven","useful":2,"cool":0},"dCvyPkQiyDpIvSAEbzmdnw":{"text":"Viet-style flavor. I highly recommend Boil House sauce. Service was great both times we vi","useful":0,"cool":0},"0bffz4QR13_u8pRxHMPA9w":{"text":"The food here was amazing! My friends and I sat with Vickie and she was truly accommodatin","useful":0,"cool":0},"2xdbsp66ONCU_iX4NDUL-w":{"text":"I originally ordered a half dozen of charbroiled oysters and ended up ordering a second ha","useful":0,"cool":0},"wgrg0Gs8SFnGz_3ib10djw":{"text":"The food was good but ordering online was a giant pain.  I ordered and 20 minutes later, h","useful":0,"cool":0},"HZBCB3yy0DPFmu6TDmOt-A":{"text":"Sunday noon, we were craving for some crawfish. We found this place thru a friend who reco","useful":2,"cool":0},"drk_AV1GukKbgOGBPMxayA":{"text":"Fantastic!!!!  Can't say anything else it was phenomenal!!  Service was a little slow but ","useful":0,"cool":0},"7HwDp1Og-nr89l76dSz_Ew":{"text":"Food was great. We ordered the taste of New Orleans. One of the best cajun extra spicy boi","useful":0,"cool":0},"DH5yJvGO7QvQEXfn8eXmHg":{"text":"The customer service was terrible and racist . Was told to sit outside under the sun with ","useful":0,"cool":0},"6ie1fOg02fA3yvu51xC1TA":{"text":"Amazing seafood. We had one of the big kettles and with an extra side of potatoes and corn","useful":0,"cool":0},"VNgL8OxrMfOJeiU4JQpAtA":{"text":"Expect to wait and prices are a bit high and crabs a bit small but flavor of the boils are","useful":0,"cool":0},"607m7xUSY8kFHRZxquNgBw":{"text":"The seafood here is good but I think this place is overpriced. If your willing to spend th","useful":0,"cool":0},"-iy_b6qDZFcj3iJ87r6psQ":{"text":"We went to NOLA from California for my sisters 30th birthday and we went to Boil in a LARG","useful":0,"cool":0},"en71G_bemQ2wEuXoeO16mg":{"text":"First off our server Kasey was Amazing!\n\nMy favorite was the shrimp,\nWe got the low spice ","useful":0,"cool":0},"C8lvsq0BUUTdCOhH42NO0Q":{"text":"The food smelled awesome.  We all understand the COVID has made everyone short staffed.  I","useful":0,"cool":0},"j7FCDeeiPGh3q2cSUHrP5g":{"text":"Ordered online, waited an 1 1/2 hours before picking up my food got there and the manager ","useful":1,"cool":0},"JtoFR8Wu4upVtM3kpytG1w":{"text":"Boil is in a beautiful neighborhood and in theory it sounds like a wonderful place. All th","useful":0,"cool":0},"iCUZcJJL9aovq7j0RhT67Q":{"text":"We made a reservation for this restaurant (recommend) . All the staff were super nice. Joh","useful":1,"cool":0},"jq9sLOKfSPEnniGFq5rmNw":{"text":"We may or may not have planned to come back to NOLA just to visit our favorite spot and th","useful":0,"cool":0},"W9xOEd_znb0fJXJaHKX5wA":{"text":"Fabulous dinner serves boil style--messy but yummy.   We were seated on time for our reser","useful":0,"cool":0},"mqKFtglPgTrbKu98p4z0ag":{"text":"I made reservations for Saturday on open table for a party of two. My meal was tasty I ord","useful":2,"cool":1},"ht2CkXfDzTd2dMnc62Chpw":{"text":"Not your traditional New Orleans boiled seafood where the seafood is boiled in seafood sea","useful":0,"cool":0},"3FuPUXK63bUN2QcpFF5VpA":{"text":"Pros: Reservations accepted & we were seated immediately once parties attendance confirmed","useful":3,"cool":1},"JEUDoL9Lyuj5xbn5dM-B1Q":{"text":"Best place for seafood in New Orleans!  We went to a place in the French Quarter that had ","useful":0,"cool":0},"CZMrakGFEjhKyFqDCG9cUw":{"text":"Doesn't look like much from the outside but the food and the flavor was outstanding. A lit","useful":0,"cool":0},"-hlp1zDrE1kMF9TMTj0tLw":{"text":"Great experience. We showed up 10mins before last seating and still received great service","useful":0,"cool":0},"UrnlIZku4uy4XgqQ-eoegg":{"text":"My first time here in about 4 years. I ordered \"1lb\" of king crab and the crab meat was sm","useful":0,"cool":0},"blkABzzJlS8tYbFJl7-xFg":{"text":"2nd time eating here. Besides not having sausage I was not disappointed. Service was slow ","useful":0,"cool":0},"EJypLwNmHT5pP33ZtHc9cw":{"text":"The Po Boy here was amazing ! So rich and full of flavor ! The shrimp boil house blend was","useful":1,"cool":0},"DsnLhumeHnmx3akqZz3qZg":{"text":"Do yourself a favor and come here! \nThis place is amazing. We did a Seafood Boil Bucket an","useful":0,"cool":0},"Dq27VzIxNk3m-LW5mIVxuw":{"text":"10 out of 10. This food was amazing. We went for the feast which was too much food for jus","useful":0,"cool":0},"pSWp1ndBUChTDo3sVMYEjw":{"text":"This experience was not a good one.  The crab legs were extremely small, they didn't have ","useful":0,"cool":0},"vlLSkUJAB2bGxQt8EdQBng":{"text":"This small restaurant on the corner may not look like much, but it was one of the best mea","useful":2,"cool":0},"m-Sxi8S1x1WDysH6vPdqhw":{"text":"This place was AWESOME! If you're visiting New Orleans head down to the Garden District to","useful":0,"cool":0},"LYhOvx-pNx7oaz6rL1UD0A":{"text":"Not sure where to start with this review but here goes. To start, DO NOT make a reservatio","useful":1,"cool":1},"0WBxowztfYKAxxHzSsTdVw":{"text":"A must try when in New Orleans is some good old seafood boil.Boil seafood serves some lip ","useful":0,"cool":0},"VRYGW3_lMH_gTwELSciLVg":{"text":"Nawlin' grubbing. We were vacationing/ roadtripping  back to Las Vegas, NV from Florida an","useful":1,"cool":0},"WjGuzopQZfV3ZPUkvNLX_Q":{"text":"I ordered my food to go! While i waited i enjoyed a hurricane drink from the bar ! Excelle","useful":0,"cool":0},"xFst8-v1fUwGPVyYF7xmyA":{"text":"Almost a 2 hour wait time. We killed it by walking the garden district to find the house f","useful":0,"cool":0},"VbAYodGLsWttufUHR-YLRw":{"text":"The whole staff is horrible from the manager to the e\nWaitresses (especially the girl with","useful":0,"cool":0},"KNiB0aevyid-3TtEGg66ug":{"text":"Pretty damn tasty! Ordered the House bucket since they were out of blue crab and we could ","useful":0,"cool":1},"LuSssAWaAH1Bzs0664eTlQ":{"text":"We tried to find the boil seafood in Nola while visiting here, and we decided to try this ","useful":0,"cool":0},"ZprQy6vnOQXJatChiAxPLg":{"text":"This place was awesome! The service was great. We went at the perfect time and got seated ","useful":1,"cool":1},"91Hdq_dBczLIQ2an0jRvrA":{"text":"This place was beyond delicious!!! I try to come to New Orleans every year or two and only","useful":0,"cool":0},"17v7fPwD3vQXSJXdNTy5Fw":{"text":"My bf and I were very excited to try this place when we visited NOLA for our vacation. Thr","useful":0,"cool":0},"GaKpvvJNbY8p3UC3cOKUXA":{"text":"My boyfriend and I stopped here for a traditional NOLA seafood boil and it was awesome!\n\nT","useful":1,"cool":0},"knXpTuze92UQYl5jRJ6tDg":{"text":"I recently came here for a family members birthday. I unlike the rest of my family don't e","useful":0,"cool":1},"qx28X3NoWdZqU_FZcOlN5g":{"text":"Everytime i come to New Orleans i have to stop in the garden district and hit this locatio","useful":0,"cool":0},"roPpzEMJrY6rceXS7P1AMQ":{"text":"Great seafood really good, a lil pricy but it's worth it I always get the hot which is gre","useful":0,"cool":0},"XHFiJLcp_ZXOQQjnGaHd_A":{"text":"We love the boil seafood house and have visited twice now when in the area. The food just ","useful":0,"cool":0},"jF6sT8GESNQhOwEkeeMFGw":{"text":"Great food and great times! Local tip; order the Amelia- it's a refreshing off menu drink ","useful":0,"cool":0},"HUds8C72v5UM-8kHDdHWKg":{"text":"I honestly didn't expect much from a sit down boiled seafood spot. My favorite places for ","useful":0,"cool":0},"GjPhrgaDsPGjxilnPduOuA":{"text":"speedy quick service! our food came out HOT. i came here on a wednesday night with my frie","useful":0,"cool":1},"LPXBGXMVDJKdbsYh0ni3yg":{"text":"OMG this place was absolutely amazing the food was great and so was the service must make ","useful":0,"cool":1},"gepLKfub2ZVH5b9BLnzROA":{"text":"This spot was the Gem of our last day great service get there early and make sure ur full","useful":0,"cool":0},"HYxNU_bZPMoGedFbqWXpXA":{"text":"Not impressed! Food was overpriced and extremely COLD!! I complained to my waitress that t","useful":0,"cool":0},"r9X_Zhwm4mVjhiDk4s2dSw":{"text":"I would give it a lower rating if I could.  One of the worst restaurants in NOLA.  Take yo","useful":0,"cool":0},"cX7kW1dsJ_cT5-pOFoeeAQ":{"text":"This is a fresh seafood spot.  The flavors were great and cooked well.  However, the road ","useful":1,"cool":1},"fF6QiapMkLO4bnQwoODRBw":{"text":"I'm here visiting N.O. and wanted to try chargrilled oysters for the first time so came he","useful":1,"cool":0},"7WVrfhOuzpIahtYsWjAOpg":{"text":"Both the food and the service was incredible!!! There were five of us and we all ordered d","useful":0,"cool":0},"UQkjmDYxTSoez-MajxGRew":{"text":"I gotta give this restaurant 5 stars (Magazine St). Try the grilled oysters. I had the New","useful":1,"cool":0},"rdX1v8qOR1j8i954fI2H_A":{"text":"The food was really good. The sauce on my shrimp & crab legs were perfect. It wasn't too s","useful":0,"cool":0},"_SR5_YMu7MqrAf1Vl1gWRw":{"text":"I hate to give it 4 stars instead of 5 because the food was so DELICIOUS!!! \n\nThe food was","useful":0,"cool":0},"g0YgDw0iTLckICeXsvtKyQ":{"text":"I couldn't decide on which to order so I ordered both! A cup of each. I read a review prev","useful":2,"cool":1},"vP2tCvUzS_qHE2zOOTp6Ww":{"text":"During the storm my wife and I said let's enjoy some of the great shellfish that New Orlea","useful":2,"cool":1},"h0u3mod6TCkTCUCmiEiX3w":{"text":"Lunch yesterday at Boil was magnificent.  The food and the service were first class. \n\nOut","useful":1,"cool":0},"U5DL0qlQJ_ya2ysFqFrTLA":{"text":"Amazing food, friendly service and great price. Definitely the best of all we've had durio","useful":0,"cool":0},"OncnbByyTpenkUXewFxsvQ":{"text":"Amaaaazing! Took a $27 Lyft ride here from bourbon street but was well worth it! Had about","useful":2,"cool":2},"F5jFIhgoNfouG8t-S9g5mg":{"text":"If ya'll visiting the great city of NOLA. Please try this place out. Amazing food and serv","useful":0,"cool":0},"QrKpTSNJYFV5FlG4Sxi_xQ":{"text":"Seafood boil!! We got the shrimp & crawfish mix that came with potatoes, sausage, and corn","useful":0,"cool":0},"NXdQZmpVU-vGpPAo8FES4g":{"text":"Sitting here, currently, writing this review. \n\nLocal here, locals, stay away! Horrible se","useful":1,"cool":0},"1nxvLr2QTwTsIggWl7CnUQ":{"text":"This is my 3rd time ordering from Boil Seafood House, but my 1 time dining in. As a New Or","useful":0,"cool":0},"PJ3-ntMUZeQwldK02DHYGg":{"text":"I've read a few bad reviews and I kinda see where they're coming from. But really I mostly","useful":3,"cool":2},"XZadW3RX3iWO0uvP5vs2rg":{"text":"I was in town and needed my crawfish fix. This place was good but not your traditional typ","useful":0,"cool":0},"MDffGaA37eubIJ9pWk1y_g":{"text":"THE BEST SEAFOOD IN TOWN!!! I love boils and this was so fresh! I had ordered the mango ma","useful":3,"cool":2},"ilm5cO_1XGswtgoL--OeVA":{"text":"SO DAMN GOOD! So many different options for food and FLAVORS!!!! Do yourself the favor and","useful":0,"cool":0},"KRLqo_R0MEYfPYD64w6S9Q":{"text":"Great experience. We did the \"taste of New Orleans\" and loved it. The Po boys were overstu","useful":0,"cool":0},"abprM1lTIoQAQLTozCIhFg":{"text":"This was the best seafood boil I have ever had. We were only in town for a short trip and ","useful":0,"cool":0},"RaJvk94Q2T2u3flizlF1DA":{"text":"I made a reservation for 8 for my friend's bachelorette & they seated us quickly in a semi","useful":0,"cool":1},"wKp-w7xXF9pE46is-IE5dw":{"text":"Not the best but not the worst. I'd like less oils in the crawfish and the mushroom servin","useful":0,"cool":0},"lOJeJl1p3BEZtRc-szA4Pw":{"text":"**Tourist from southern California review**\n\nLiving and growing up in SoCal has allowed me","useful":0,"cool":0},"ZKGih_rKwX4IfrkUx4YZ1g":{"text":"The food is good and so are the prices! The portions are very generous. The spice levels w","useful":0,"cool":0},"R-fw8D6XLMolj2s2dKcZiw":{"text":"We got a dozen oysters, fries, and crawfish/shrimp.\nThis was my first time having crawfish","useful":0,"cool":0},"pzqlPIYiMM9AtqCsrGmr0g":{"text":"Seafood boil house is one of THE best restaurants in Nola. I tried it once and was hooked ","useful":0,"cool":0},"4FcSpDcH3OqpDeqxkqELDA":{"text":"Enjoyed the Shack boil. And the boil salad. \nDrinks were good and was service and experien","useful":0,"cool":0},"bM2fP7E8WcxPVunKVv2lzQ":{"text":"The 4 star has to do solely on the service from the waitress. I would go lower but the foo","useful":0,"cool":0},"IdN0YEkkWEAnipO2rSFpzA":{"text":"I'm not satisfied or pleased with the seafood pan I ordered tonight its obvious Boil Seafo","useful":0,"cool":0},"eZ9FiViwAjDlAUoLmjMYEw":{"text":"Terrible experience. If I could rate lower I would. First off the hostess staff were incre","useful":1,"cool":0},"hUAArSasTNsChl5sq3vvHQ":{"text":"Sooooo delicious. I had snow crab Cajun style, corn, and potatoes. The perfect amount of s","useful":0,"cool":0},"SNCJZslfQ8eD-KsZ1FN8tA":{"text":"Great service and good food. Normally in the Bay Area boils are just greasy and no flavor,","useful":0,"cool":0},"1-TF-FyaXLd3pKbHGNFBSw":{"text":"Ok. \"Be nice or leave\", says YOUR sign on the door. First of all, what a crap & insulting ","useful":1,"cool":0},"Tpxyb8Q3V_6GhFvMDZBZrg":{"text":"My friends sea food boil was cold. I ordered a sample combo and the food tasted like it wa","useful":1,"cool":0},"_0tgxi3jfsmtMkjb1gqe9A":{"text":"Great crawfish. Went in February and may. Crawfish were soft and well cooked. I found a cr","useful":0,"cool":0},"_7pbnPQKMgwbU0q-wEcK9w":{"text":"Delicious food! Fun experience. The music inside was so loud we couldn't hear each other t","useful":0,"cool":0},"n1CgcnRiiT9Mb1V8c2DYDQ":{"text":"Really good seafood boil restaurant! 5 stars for the food, 4 because of the price.\n\nI thin","useful":3,"cool":2},"eJa0wVulMQYdUieOwTEuwg":{"text":"Love love love this place! It was my first time going after one of my friends kept talking","useful":0,"cool":0},"IjxdyAUMYiibi5Zaz6TpQg":{"text":"I tend to find myself coming here when I have friends and family wanting to try a boil but","useful":12,"cool":12},"XU56kUBp0gB5MXoS8uHLXQ":{"text":"Great environment & great food! Shoutout to John Brown for the excellent service ! Definit","useful":0,"cool":0},"Bhd5N82dly4oDtN4m_2tkQ":{"text":"Place is yummy and busy! I personally think the combo deals get you more than just orderin","useful":0,"cool":0},"HWhBqptBRvF7nTNNsbYjYw":{"text":"Omg soooo damn good !!!.... Tonight I learned from our server how to crack open crawfish, ","useful":1,"cool":0},"Zp--K0L0sJxqInpnNjg6Ig":{"text":"So I  read some reviews on yelp and my expectations were high due to all the 5 stars. Well","useful":0,"cool":0},"HmlwaVklz0xyc-flZl2H4Q":{"text":"Amazing restaurant, great workers all around.. Brought my fiancé last night.. amazing back","useful":0,"cool":0},"IBMX5A7QDUGdXr1YIfPnlA":{"text":"We stayed nearby on vacation and drove by this place and decided to stop by. It did not di","useful":0,"cool":0},"eggynCq0G6H7tD4FdONC8Q":{"text":"My husband and I decided to try the boil house for date night at the recommendation of my ","useful":0,"cool":0},"RyWmpqjxra35KaGJMh8hdQ":{"text":"I was craving for some seafood and placed an order for 1lb shrimp, snowcrab, potatoes and ","useful":2,"cool":1},"gdUmSV8FeVF9ldqqd5N6UA":{"text":"Flavors, cravings, and all were satisfied this night! Everything was cooked so great! I co","useful":4,"cool":2},"x4E8KBwjVuqJMCamdfLkpQ":{"text":"Extremely disappointed. I've noticed over time this place has slowly gone downhill with th","useful":0,"cool":0},"irzArrFB4rRnl_SOyNQ_bQ":{"text":"This seafood house is BRAND NEW and I'm super excited to review while it's still so new. S","useful":1,"cool":0},"rVjRAb03FkZuca1Yg8ABBQ":{"text":"Went here for dinner. Made a reservation ahead of time. The food was great. I definitely s","useful":0,"cool":0},"jBh8Y4gff9weJ7eYVYZ1_g":{"text":"This place closes at 9pm on weekends, which is considered early considering it's Mardi Gra","useful":2,"cool":1},"X3KrCoJKQvdeZ5mMkOpEhg":{"text":"I visited the Boil Seafood House on my visit to New Orleans because I had a taste for crab","useful":13,"cool":6},"LSWRzD7-XRJ66Tah4-o5Cg":{"text":"On vacation in New Orleans my fiancé and I were recommended this place by our Uber driver ","useful":0,"cool":0},"fTiyYJR7JixMSg4v5l53hw":{"text":"The food was good enough but getting the attention of our server was not easy. \nI would on","useful":2,"cool":0},"YEhi_wx6uIHTKIz9N5LzRg":{"text":"This place. Is. The. Best. Seriously.\n\nI was on New Orleans on a quick three day trip, and","useful":0,"cool":0},"gQzF7_6MQykAcD5-WBAYnQ":{"text":"A group of my fruends came here from out of town for the love of god i don't know why you ","useful":1,"cool":0},"dQX3RDhClskAjpDPj0no2Q":{"text":"Wished they would've provided my family and I with some wet wipes or foam sanitizer after ","useful":0,"cool":0},"2AnsDBlT1MAiUSF8tTfUyA":{"text":"It was my first time in NOLA and I loved it. This meal was soo good. Our waiter was so nic","useful":0,"cool":0},"sKeP0cYWZIRXBrYpv-dOQw":{"text":"Great taste, lousy tourist prices. Crawfish should be about $3lb but these people are gett","useful":1,"cool":0},"-rm5RFtRgISsHvSJXls6sQ":{"text":"WASTE OF MONEY! I was born and raised in south Louisiana. I have never experienced a seafo","useful":1,"cool":0},"wgWYbFa6_GjvwbQZSI4kkg":{"text":"On a trip to New Orleans, my friend and I came to Boil's THREE times. The 1st time, we ord","useful":0,"cool":0},"hm04ci2itWiqS79QoAulyA":{"text":"Amazing happy hour deals! Friendly, warm and welcoming staff. Clean, stylish, hip atmosphe","useful":1,"cool":1},"bqni1soq65aKac3DpYc36Q":{"text":"During our winter holiday trip my daughters and I had a great experience at Boil on our la","useful":0,"cool":0},"MpjXKye89uPnNQwDl1r2UQ":{"text":"Late review: Date of actual visit September 14, 2019. Food and service where great! I orde","useful":0,"cool":0},"NrxF8XPotI5iRRmHGj7bGg":{"text":"This place has very very  good crawfish, snow crab.  I like they have the option to order ","useful":0,"cool":0},"Lxhma9Hy_CsW0CbCl82hBg":{"text":"I've always had a good experience here (thanks Jojo and Ben ) and I think this is a seafoo","useful":0,"cool":0},"iEFUTOVV_iXbZ5ZJtDXGaQ":{"text":"Second time eating here and we are addicted! Love this place so much. The seafood is HUGE!","useful":1,"cool":1},"leSBIQ9_1o_NbHGjEczwpg":{"text":"Got the pick your catch 2 lb crawfish and hubs got the taste of New Orleans platter (crawf","useful":0,"cool":0},"x6ENjGjGGKWS5uf57Gdwlg":{"text":"First time Boil-er's! What a fun and yummy experience! Jake was our Waiter and he was so p","useful":0,"cool":0},"ZlRTKU2PA26rcbPYCiFRUg":{"text":"We have been here twice. The first time it was take out only because we were in a hurry an","useful":0,"cool":0},"v5v26RA3azc7VZANuJrL4w":{"text":"Wow!!!! What a fantastic experience!!! This new restaurant uptown is so AWESOME!!! The foo","useful":0,"cool":0},"ubvJvRvlhkN855yKMKnpEA":{"text":"Great service , went for a happy hour really good drinks and appetizers. Great seafood boi","useful":0,"cool":0},"OvwX7r3ngoK2EtcNh4sZGg":{"text":"I've had my fair share of seafood boils and this one was amazing. We made a reservation to","useful":2,"cool":1}}