{"1JyfuCPw0RVFzSJYZvLM1Q":{"text":"I always try a new flavor each time I go in. My friend Terri tried the Lemonade Parade thi","useful":0,"cool":0},"8_6j3l2VQj_KP7kvwcijSQ":{"text":"Somewhat a skeptic about smoothies cuz I find Smoothie King offensive.....I finally tried ","useful":0,"cool":1},"-cP-ETntLjNbue5ek0t55Q":{"text":"The food is ok but the snoballs are seriously lacking compared to the New Orleans standard","useful":1,"cool":0},"pXz_t1PoX2LFKhirKsr4nQ":{"text":"I got the blueberry sno ball with sweetened condensed milk topping, mmm. I highly recommen","useful":0,"cool":0},"kzI3oBTUKvrUXnBmcT_5fA":{"text":"I love Lemonade Parade! It's in an ultra convenient location on S. Carrolton Ave. As a stu","useful":2,"cool":2},"fFQskqn7bscgwbLeH9QAeg":{"text":"Luv this place! I always get a grilled cheese with cheddar and bacon on wheat and a prickl","useful":3,"cool":1},"Rw5A81-QGyGCiccklB0uoA":{"text":"You'll miss this place if you're not looking for it, I certainly had no idea they'd been t","useful":4,"cool":3},"VR77zncrDXWx3j3sK3hWOA":{"text":"A little pricy but the hangout for Jesuit guys.... get the strawberry smoothie yogurt... I","useful":2,"cool":2},"rRUeinS3V1aW6Xnx3HFqrg":{"text":"I love this place, its so close to the house and I just recently started coming for lunch ","useful":2,"cool":1},"xwMPvQUxm9Qrbybn26VRgg":{"text":"They have substitute tamales, not quite as good as Manuels, but they fill you up fast.","useful":0,"cool":0},"MzMbUkA5sEMhQvJ94dN9Wg":{"text":"Who doesn't love a good lemonade stand?! These have the tastiest lemonade in the city. Mmm","useful":2,"cool":2},"ASiKerbsGN37RkLAdCraVg":{"text":"Snowballs:\n\n1.They take forever to make snowballs\n2. The ice is HARD..Like i have had to s","useful":0,"cool":0},"WLWHwPS74vas-WykW1BFgQ":{"text":"Friendly service, and really good chicken and andouille gumbo!!  \n\nI haven't tried the smo","useful":4,"cool":2},"X-ks31EvuW1KM9N6frZURw":{"text":"They've got a great smoothie for five bucks, and they also have really weird specials that","useful":0,"cool":0},"oMFuP60YzRy6Wac1jwJQiQ":{"text":"For a place called lemonade Parade, they sure do have some bomb ass hot tamales!  Go get s","useful":3,"cool":2},"_NFGNFojNZw0aRMuNv6fGg":{"text":"I highly recommend getting their smoothies and I've become addicted to the grilled cheese.","useful":1,"cool":1},"tO_SK6_zEGPWzhWDQIjksw":{"text":"I love Lemonade Parade! What's better than a cool, freshly squeezed beverage on a hot day ","useful":2,"cool":2},"2rmGic7vob7cqbG7RuGB-g":{"text":"I have only had the snowballs but I was impressed.  Its hard to go wrong with ice and syru","useful":2,"cool":2}}