{"5wUBzTR0l9v0Sw9h8JMwzA":{"text":"Peche was better than I expected. The crawfish croquettes and the drum entree were absolut","useful":0,"cool":0},"r7TgEwVqJlW4bl2Tt4sK8Q":{"text":"The atmosphere was warm and inviting, with its greying weathered brick walls and wood beam","useful":0,"cool":0},"WABnzFs_vRD-u__6m4_Ryw":{"text":"I've probably been here 15 times, and it's always been amazing. I highly suggest just spli","useful":0,"cool":0},"DGYGZgbu4dhkL0tgOOgliA":{"text":"Really neat atmosphere. We had dinner at the bar and the service was great! We were always","useful":0,"cool":0},"CWNk_ST99BOAAu_LJ312kw":{"text":"Excellent food, service was good, environment is nice. Stopped for late lunch with family ","useful":0,"cool":0},"XNRrGjqF3MKVF-kqjQ3elA":{"text":"I wanted to like this restaurant...If you like spicy hot food, this place is for you.  I'm","useful":0,"cool":0},"Xf-BJ71GE9Wrd-utEx55UQ":{"text":"Peche is the best restaurant in the world. After my third time there, I am finally writing","useful":0,"cool":0},"0QA0-6GwFxjk9hSG6tVW8A":{"text":"I couldn't have been more impressed in the first five trips here. Truly an amazing place, ","useful":0,"cool":0},"_NeUzyYAn6IHHK36fy79kg":{"text":"Really great food, presentation and service. Decently priced and overall beautiful restaur","useful":0,"cool":0},"mfOo95KUc8W3tIIpeWtbBA":{"text":"Very disappointing.  Unless you want to eat whole fish (I don't), the menu is pretty odd (","useful":0,"cool":0},"zDOz2pykF2dTuUI23DuGgg":{"text":"great variety of seafood prepared in a modern southern tilt. their fried bread is a must h","useful":0,"cool":0},"HB3TdEgQITkDCtxdFLUSjQ":{"text":"First time here but it won't be the last. We had a lot of the dishes that our server recom","useful":0,"cool":0},"RZ2bjHtIwZJnVFwDahyHcw":{"text":"Service was good, food was alright. Nice ambiance, stayed for appetizers and took off for ","useful":0,"cool":0},"s0TbH_WUIAX5nSJeWQtzoQ":{"text":"Great staff and great service. The wait staff was very attentive to our large number. The ","useful":0,"cool":0},"xFvj5XqsvRcwgCozy5liGg":{"text":"Loved this restaurant.  Had a fantastic lunch that included the fish collars, a red shrimp","useful":1,"cool":0},"Uk8bOurZ5NhlvG1cnZDfdg":{"text":"The food was amazing. We got a lot of small plates for the table and they were all great. ","useful":0,"cool":0},"aqsPXuztCZTxG9HIxgs1jA":{"text":"Great atmosphere. Whole fish is what I am costumed to so I had higher expectations of it. ","useful":0,"cool":0},"-SdH3oXRiF5JNal_MMoPKw":{"text":"This has to be the hottest restaurant in New Orleans right now. The food is memorable!","useful":0,"cool":0},"11sNzWoxsfUxSWo-1aIOkA":{"text":"Stumbled on this place trying to escape parade crowds. We had oysters, a raw tuna appetize","useful":1,"cool":0},"tfRWcmLl7usKuP0KABNm-A":{"text":"Not impressed. Gumbo was way too Smokey. The shrimp toast tasted as though the grease it w","useful":0,"cool":0},"cZUnYV7eG3xdZpgspE9mKw":{"text":"I have been here for lunch on each of two visits in the last 18 months.  It has been subli","useful":0,"cool":0},"b2AGHTrSm5l4sRn59lBI7A":{"text":"So so good! Was recommended here by a friend who told us to try the fried bread. Decided t","useful":0,"cool":0},"WjDp8VEwTZi9GXYgRz8Fsg":{"text":"I felt like the menu was kind of oddly put together.  I was definitely skeptical but the o","useful":0,"cool":0},"RxvnvyZvKmRPBWZFQAIVog":{"text":"Every single dish I tried in this restaurant was amazing. This is the best food in New Orl","useful":0,"cool":0},"RB_nKjKHIyRuGA1IjN17Lw":{"text":"Just do not understand the rave reviews here. Our party of four out-of-towner visitors  we","useful":0,"cool":0},"J6MdGW1Dw2_G1QGW7S0jRg":{"text":"5 stars for the food and 1 star for the service. The bus boys were very helpful and quick ","useful":1,"cool":0},"YmTfICV-_NZD4hBT_d6u4w":{"text":"Wow,  all of the food was amazing, you missy get the drum fish, it was the best meal we ha","useful":1,"cool":1},"yp7WbR22DJ5TNQ5H5FMOSw":{"text":"We stopped by Peche while visiting New Orleans based on the fact that it was recommended b","useful":0,"cool":0},"z2qQE9PaAieeQC4Otv3pZA":{"text":"I have eaten here numerous times.  It is perfect.  Period.","useful":0,"cool":0},"UkCCcdTwM2SDtObGHF14eg":{"text":"Beautiful rehabilitation of an historic building. Wonderful interior, ambiance and service","useful":0,"cool":0},"t6mIfSwPqsj3PcLBNMvqEw":{"text":"I was in town for a conference this week, and dropped the ball on checking out local flavo","useful":1,"cool":0},"jFgyXTraONPnpIzn9P1xng":{"text":"Great service and nice banter with the wait staff compliment some spectacular New Orleans ","useful":0,"cool":0},"14CctZhTPJHXXMOUWAUWsA":{"text":"I'm really torn on this review, I had a great time here but all 8 of us agreed that all of","useful":0,"cool":0},"mZ55TYZmEm25VMaVI6KZ3Q":{"text":"The drum entree was amazing and worth visiting for!  Shrimp appetizer not as much a fan as","useful":0,"cool":0},"_XYNWkQ36CBIgltZsR0l5Q":{"text":"Ok, so the food here is very good although the menu is very limited.  The bar makes a soun","useful":0,"cool":0},"8YkMAVEFDnBV_l-eA6odZA":{"text":"Peche has pretty much been my favorite spot for the last 3 years. Never disappointed & the","useful":0,"cool":0},"0nppbZpJ87-RcmeQaJ-jEQ":{"text":"Loved peche, but I wouldn't expect anything less from the team that brought us Cochon. We ","useful":0,"cool":0},"akvKti08rd1Ttw9ObmNJ-Q":{"text":"We were looking forward to our meal here after making reservations more than a month out. ","useful":2,"cool":2},"f7g_i5bWOGf0Onq2aFUZlg":{"text":"Sat at the bar for a late lunch.  Spectacular food.  Great staff.  Tuna on the raw bar men","useful":0,"cool":0},"KCYiAFLC8ysg3i8jD02zVg":{"text":"The highest possible score to Peche. The one restaurant in New Orleans that wowed us beyon","useful":8,"cool":4},"jmStIXXDKcsOC1H8l9-xHQ":{"text":"Possibly the best food I've ever had. Shrimp bisque was full of depth and complex flavors,","useful":0,"cool":0},"uy7TdvS4M_n58iWC8igynw":{"text":"This place was divine. Being gluten and dairy free, it's hard to find places that are acco","useful":0,"cool":0},"Qobbz-Yap8zEDVf7_T47EA":{"text":"Some of the best oysters in the city. Seafood platter is huge. Pasta dishes were great and","useful":0,"cool":0},"2LSW8LU745LgpGw0ZNIeyw":{"text":"Extremely unfriendly to group parties. They took our reservation for 11 without any hassle","useful":0,"cool":0},"3S16NkcxOrwrThqVDEKXEQ":{"text":"On a four day trip to NO and we have had 3 meals a day each from a different local establi","useful":1,"cool":0},"7pshK21WLbwkAvaRM9jNyA":{"text":"Energetic atmosphere.  Unique and eclectic menu with new twists on old New Orleans style f","useful":1,"cool":0},"7EUwZHbPswa9LFnuMzJ3Jg":{"text":"I only had drinks here, so I can't tell you much about the menu, but the drinks were good.","useful":0,"cool":0},"T3at-hFLx5NEay_Voz_Kxw":{"text":"Came here during a conference, so was incredibly Busy and crowded. Make reservations. \n\nEN","useful":0,"cool":0},"NTK7yiYAbEiyiCbj9zNQ9w":{"text":"I really loved our meal here after all the heavy food on our trip but I have to say nothin","useful":1,"cool":1},"VJKVuE0v6s_f5pAnEExuaQ":{"text":"Really nice place and the food was top notch. My wife had the ground shrimp and noodles an","useful":0,"cool":0},"g4l0ocPPAGqxJINjC3gl4A":{"text":"Updates:  ground shrimp pasta dish was super spicy 2nd time ordered.  Still amazing but fo","useful":0,"cool":0},"VGloOVj3vIs9XB25sbgzVA":{"text":"Awesome meal. Not sure I'd give it best new restaurant in the US but we thoroughly enjoyed","useful":2,"cool":0},"QMDgIaZpwR9bbq0YFTQzmQ":{"text":"The concierge at Grenoble House recommended this place our first night in New Orleans and ","useful":0,"cool":0},"CAncD2ygU-dvvOKI35wnkQ":{"text":"I just love this place.  The staff is first rate, and the food is so innovative, fresh, an","useful":0,"cool":0},"4VpSIYUHD2A2DDBl_p1h9A":{"text":"Excellent meal. From snacks to entree. We started with the smokes tuna and shrimp croquett","useful":0,"cool":0},"Zn-DVLgF229pwvTEKl7ESA":{"text":"Unbelievable!\nFrom the fun. Cocktails( the Hemingway to the Buffalo Louie) to the AMAZEBAL","useful":0,"cool":0},"fSlCZP091XgADSH0tenimQ":{"text":"Excellent and attentive service. Convenient location on Magazine with ample street parking","useful":0,"cool":0},"uYCDyt50V60ExDrq5oi_aw":{"text":"Odd place. Country atmosphere. Waiters compete for the most tattoos and piercings. Big pri","useful":0,"cool":0},"LsWaw4rY79YUVJJ-VcK_og":{"text":"This is our third time here and It's one of our favorite places for seafood in NOLA. As yo","useful":3,"cool":2},"LYlsz_Y7IMvXRllNlUu-Fg":{"text":"We went there Friday night.  They didn't take phone reservation and told us walk in only. ","useful":0,"cool":0},"je3Ci6L5pqTmZQxKajnTBQ":{"text":"Best meal I've had in New Orleans in a very long time. Eat here. Don't ask questions. Just","useful":1,"cool":0},"IWGr0xUgLA7cTFevwgKmwQ":{"text":"This place is delicious. Beyond what I expected. We sat at the raw bar anzd the cooks were","useful":0,"cool":0},"mMp7D5idTA8lKER--darGA":{"text":"Fantastic!  They gave us a hard time about being late for our reservation (even though we ","useful":1,"cool":2},"uGU9RK_P9JJ1soqKum2VMA":{"text":"We had the chicken diablo.  It was fabulous!  One of the best meals we had in a long time!","useful":0,"cool":0},"KRUB4SN7DPGHHQTONMSQIQ":{"text":"Over priced food that was mediocre. Paying for atmosphere which is beautiful and great loc","useful":0,"cool":0},"R_K4F4Ot4J4sEurEydaOqw":{"text":"Over 1000 reviews and a good rating score show that you should try this restaurant. We ord","useful":1,"cool":0},"vtqPL53cdc61bc8c0edTUA":{"text":"My first visit to Pêche Seafood Grill was the same time last year, and it was just as I re","useful":1,"cool":1},"lNceod9JSxiI9Y-IrhB-rQ":{"text":"Srsly tho. Y'all ARE great. Good Night!!!\n\nWe went to Pêche on a whim when another seafood","useful":0,"cool":0},"xp8mr7HTZPRpeRtTSNxvvg":{"text":"Food was incredible. Everything we ate was rich and delicious. The staff was very knowledg","useful":0,"cool":0},"8GRGlrrBkFtdw0D_U91vFw":{"text":"Delicious and fun. Get the whole fish and any specials they have. Ryan Prewitt is a genius","useful":0,"cool":0},"mUQUTLvmbbZWjSPLcDeKdQ":{"text":"Within wali g distance of the main drag - Canal and Bourbon.  The open space and exposed b","useful":0,"cool":0},"kREPvjlE3xt6EK-9mDLotw":{"text":"We ordered the whole red snapper. It was really quite bad. It tasted extremely fishy, like","useful":0,"cool":0},"Z2no5tThXjhwg0-fy0OIkQ":{"text":"I go in for lunch at least once a week. Usually have either the steak tartare or the raw b","useful":0,"cool":0},"YwttMqX43OA1xBxxtvLmXQ":{"text":"Awesome place. Best seafood ever eaten by me. Very well prepared and the service is out of","useful":0,"cool":0},"oLgKf0WQvMXyWn45CbD_ow":{"text":"This was a fabulous meal. We especially enjoyed the oysters, the tuna crude special, the b","useful":0,"cool":0},"DmLk1X0w3sxGxLo8Tmd5ZQ":{"text":"This is the best restaurant for seafood in New Orleans! It is somewhere between dressy and","useful":0,"cool":0},"W-ODOPcMRnpvB1HQUtPNnQ":{"text":"DELICIOUS! Crawfish, jalapeño capellini was a bomb! Hush puppies, fried Brussels sprouts w","useful":0,"cool":0},"R5tJvRha9Ym6HhtmnXitIQ":{"text":"Excellent seafood, about a 10-min walk from Bourbon Street.  The Alabama oysters are divin","useful":1,"cool":0},"AA-DsQ318a9DqXUooJpTIw":{"text":"This restaurant is amazing! The service is top notch, especially Tommy the manager who got","useful":0,"cool":0},"nFSwq2ekDdIgGfvOMP_Cvw":{"text":"My partner and i came here for dinner on a Wednesday with another couple. We have heard no","useful":5,"cool":1},"cAmT1mU7bFrcu3wlTOqSAg":{"text":"Tonight I enjoyed a landmark birthday at this fabulous dining establishment!  We \"hovered\"","useful":0,"cool":0},"xeEfxYIEI1ceRnoSrsNeKg":{"text":"This place was amazing.. the oysters were definitely one of the best we have ever tasted..","useful":0,"cool":0},"1e_TacSKoD2OzZ2n39FjKw":{"text":"I was so excited to eat here, but tremendously disappointed. We got the whole fish and it ","useful":0,"cool":0},"BAACsoqLoVwlgc-xldRQJA":{"text":"Everything was delicious from start to finish. We ordered several things and split them. C","useful":1,"cool":0},"xFCJ8Q6WBEYT-rAbJjbpjg":{"text":"Peche is always outstanding. The service is always incredible, the food is amazing. The wi","useful":0,"cool":0},"QB00RUF2xeo7oW9c-fZLkQ":{"text":"had dinner here for our last evening in NOLA this trip. ambience was a bit more relaxed th","useful":0,"cool":0},"D4DQ_WT9zvtXg_yXa-v1aQ":{"text":"Food was great. Had the baked drum which was delicious.  We had a large group. Not they wi","useful":0,"cool":0},"BNcLB13AwaB2AYluySm8Tg":{"text":"This restaurant just keeps getting better and better.  The fish, oysters and sashimi is so","useful":0,"cool":0},"ST6OUFt4htbVAcpfCoxtxA":{"text":"What a truly masterful culinary experience. Mix of simple pleasures with complex flavor. E","useful":0,"cool":0},"LI5d4qnz1F6uU1NgO35KMw":{"text":"So I read lots of reviews before we went & lots of them had valid points.  The restaurant ","useful":1,"cool":0},"lALjf3ZL8qWj9xjO1D5XDQ":{"text":"I only stopped for a drink, but they treated me as if I had ordered a meal.  The ample sta","useful":0,"cool":0},"z4QXD44L-tmU5BVeoODVRA":{"text":"Just popped in for a drink and ended up ordering the steak tartare. Wow! If a seafood join","useful":1,"cool":1},"ajKn4ANbk1-XgzH6c2chnA":{"text":"Just stopped by Peche and had some raw oysters that were good but had some boiled shrimp t","useful":2,"cool":0},"K2wsu64pYm4JJrmPtpQz6g":{"text":"Where to start.. First off all the staff had attitude.They want you to think you are doing","useful":1,"cool":0},"KbXjA12NBKC-dzLBA-BdZA":{"text":"Absolutely delicious! One of my favorite restaurants hands down. Impeccable service. Great","useful":0,"cool":0},"mklgODXIJIwn47fyFv9PVw":{"text":"***Don't Go Here!!!***\nEverything you eat after coming here will be a sad excuse for food.","useful":0,"cool":1},"DMkgHmmqEWxKNJI1G4zQlg":{"text":"This rating is NOT FOR THE FOOD- the food is 5 STARS, everything we had on the menu was am","useful":0,"cool":0},"mgSGpgdAHNeeBL1lIpeCiw":{"text":"Reservations only though you can sit at the oyster bar and enjoy the full menu. Everyone w","useful":0,"cool":0},"jxW1pN9AVbSk2qVW1oiFBQ":{"text":"Well after seeing this was the number one new Restaurant in the city and reading such grea","useful":1,"cool":0},"hDj_FjvI87zTImXNNUH_cw":{"text":"The beauty of this place is the quality and flavor of the plates coming out of the wood fi","useful":2,"cool":1},"wUCSCXCk85m_MHelee23wg":{"text":"I dined here once before their James Beard win and once after. The quality went down treme","useful":0,"cool":0},"7GeQiE1yTP0Zet_9MiO5yQ":{"text":"If you're remotely interested in raw oysters... GET THEM. This was my first time trying ra","useful":0,"cool":0},"SOFJxvrwRQ3QWXkcj0koqw":{"text":"If really really fresh seafood is what you are after then this is hands down the place to ","useful":2,"cool":0},"1VvA56QqJJrmhGnuAkHKIA":{"text":"Food was very tasty - we had the whole fish and shrimp croquettes with several sides. What","useful":0,"cool":0},"o5aajKFxmU3nRIk5uWKX5A":{"text":"We had an outstanding meal at this James Beard award winning restaurant. The overall vibe ","useful":0,"cool":0},"3pwBUacgHhOb7q7Idf-KLg":{"text":"Everything was pretty good! The oysters are REALLY fresh and super clean! The isle dauphin","useful":0,"cool":0},"_Tuc0oaoNfoF1yfFEyDXMA":{"text":"Everything we ordered was delicious. Seriously everything. \n\n\nWe took the bartenders recom","useful":1,"cool":1},"vBYtQiFO6Kr7N9BDe4HoBQ":{"text":"Food was very good but...the ambient noise was ridiculous, no bread or small snack to begi","useful":1,"cool":0},"-koOPsFGnLJeay9B1XtOhQ":{"text":"This was definitely one of my favorite places to eat in New Orleans, and I'm looking forwa","useful":1,"cool":1},"ZVFB0NVLS1wZp1PmHLB8Jw":{"text":"This was another bookmark we were able to mark off of our Yelp to try list.   We had some ","useful":1,"cool":0},"bqJlbSoj0rnS_3Z05Iy61g":{"text":"Yes, their whole fishes are stars. That's the way fish should always be eaten. \n\nHowever, ","useful":0,"cool":0},"cEiL2wiW8XDI10WDyWTMeQ":{"text":"Visiting from So Cal, on our walk to the WWII museum, we needed to stop for a cold beer an","useful":0,"cool":0},"5sfVkFmBVZ4P1RiJxUnRTg":{"text":"We had a wonderful meal here with outstanding service. One of the owners sat us and was ch","useful":1,"cool":0},"XyBdbT2dyFCPDYlpZ3w0fw":{"text":"Had the whole red drum, tuna belly, fish stick, collard greens, smoked tuna dip, marinated","useful":0,"cool":0},"gSRImSh6X5uRU_CGdVmGJQ":{"text":"Great service and seafood. Order the huge Louisiana oysters on the half-shell and enjoy th","useful":0,"cool":0},"OwFAuPBE-cvs-9KDQz2R8w":{"text":"A nice seafood restaurant with a spacious, modern, clean, and relaxing atmosphere. Ordered","useful":0,"cool":0},"7d0vS2SWMfaFgAWFUTgWrQ":{"text":"Awesome awesome seafood.  Get the whole grilled fish, the crab pasta, the Brussel sprouts,","useful":0,"cool":0},"AKzjsRa7BqbqPGFY1rHN0A":{"text":"Wait staff is amazing but steak was medium rare to rare when I asked for medium. Unfortuna","useful":0,"cool":0},"JE-gxMkX1Ft5kniXQwfoHw":{"text":"We had an amazing lunch at Peche and two outstanding wait people that made it worth eating","useful":0,"cool":0},"WL6ssHD3pCT1YcKc5M2gBg":{"text":"I liked the ambience. Floor length glass windows so you felt you were a beachside seafood ","useful":5,"cool":5},"lFVIhRPJSSwxstlQayj78A":{"text":"Had a piece of grilled cobia for lunch.  The fish was served over cooked and dried out.  F","useful":0,"cool":0},"tXSarI30NUQ5QpKHFka1Gg":{"text":"Simply superb dining in New Orleans. Curried mussels amazing, as well as the tuna. I found","useful":0,"cool":0},"6iJ2fQ7rRT1Kik_GjlJkhA":{"text":"This place is incredible! I came here with my family for my sister's graduation weekend ba","useful":0,"cool":0},"SwUTSb14iAv2jRhUwQzrzA":{"text":"Wife and I stopped in for dinner on a Friday night in February. We were at Herbsaint the n","useful":0,"cool":0},"S9xJBN9z5Fwn55KJvuGN3w":{"text":"My oh my what a great place to eat and drink! My mom and I was visiting New Orleans and th","useful":2,"cool":1},"ivziP5IKq-lTZIgDEmtQxg":{"text":"I'd put this on my \"Best Restaurants In New Orleans\" list for sure. At a John Besh place y","useful":0,"cool":0},"GJCVWnygE6wG62Dn83aipw":{"text":"The milieu is as cool as the raw bar.  Excellent fish and drink options as well.  Staff ar","useful":0,"cool":0},"chygmNH563WUIl5RnDimvg":{"text":"Some may say Peche is overrated, but I disagree. This was my first stop in New Orleans and","useful":1,"cool":1},"eritRapPiNQ1ei-2kmLqGA":{"text":"Excellent in every way. We got oysters, catfish, salad, pineapple rum cake, and shrimp bis","useful":0,"cool":0},"P9koIuR597qoIQ5m8Qialw":{"text":"Excellent, fresh gulf seafood in a very cool atmosphere.  Great service as well.  The rest","useful":0,"cool":0},"EY3A9gdSW1-eqngZ5cdR9A":{"text":"Delicious crab and jalapeno capellini pasta, raw oysters, seafood salad!!!  Awesome!  Grea","useful":0,"cool":0},"pYhqIOdmfYEpW94xR8Inag":{"text":"As locals, we have eaten here numerous times. The food is always on point. However, the se","useful":0,"cool":0},"r3r1Js-Vw5Dy1a_BX3sybA":{"text":"This is a 3 1/2 star review.  First the positives... This place is gorgeous-- the decor an","useful":0,"cool":0},"1STQMk2tZN6PAVlJYZKmOA":{"text":"Stopped in for dinner with the bride and daughter for a 6pm reservation. Very disappointin","useful":0,"cool":0},"z_1FYdOR5OC1QcQJ_tBOdQ":{"text":"Really wanted to like this place.  Great oysters to start and a decent Manhattan.  We orde","useful":1,"cool":0},"ck2Rx_ZiJRD1WB69u9ARkQ":{"text":"We were in New Orleans for a conference and were told by multiple people that Peche was th","useful":2,"cool":1},"qoT4dA-iBm2bqibuFK16hQ":{"text":"Great time at Peche!  We arrived on a Sunday at 8pm and there was a crowd! What was I thin","useful":1,"cool":0},"PRJE9oAHz4aFjH2c27Bb3g":{"text":"We were seeing this restaurant pop up in every search which makes me believe that stuff is","useful":0,"cool":0},"wmGvNtwkS4iLniy5Ob6UVw":{"text":"My husband and I LOVE to use anniversaries as an excuse to spend a lot of $$ on good food.","useful":3,"cool":0},"RRoJLTunp6_CgnYK6CsGWg":{"text":"I was so looking forward to eating here. And then I actually did. Blah. First, I was so fr","useful":0,"cool":0},"T7ptIcKl635qACcO89HYYg":{"text":"The setting was airy and relaxed. Their oysters were fresh, but at $2.65-2.75 a piece they","useful":0,"cool":0},"NMMoTXadOP6IcKFo4tZP-Q":{"text":"wow.  this time round we picked a restaurant on type of food, and got a complete surprize.","useful":4,"cool":0},"yVF6IRXAASLS6EGJyymC8g":{"text":"This place is a liitle out of the way but definitely worth it. It has a rustic vibe with a","useful":0,"cool":0},"NmUDBZoURdfU0II-Tqu0IQ":{"text":"I'm in love - fried bread!  It was beyond - we ordered 2 orders for my companion & myself.","useful":0,"cool":0},"PwceIk6yqZzeP-6u3YOxPg":{"text":"Peche is definitely the best new seafood restaurant in New Orleans. I went a few weeks ago","useful":0,"cool":0},"2cWyyPJJUgmYzXh872ysAg":{"text":"Had the Crab + jalapeño capellini and was very satisfied. Was nice portion but if you are ","useful":0,"cool":0},"lTHUKLfrKAWWiiFeIXj2Og":{"text":"I've never been to Peche and have always wanted to try so it was a pleasant surprise when ","useful":1,"cool":1},"RNDDU0-L3InExFNyaKUh9A":{"text":"Perfect decision for a delicious dinner after touring the WWII museum.  Great food.  Beaut","useful":0,"cool":0},"lynb-wonw06E0VKSs0t0jg":{"text":"In the Warehouse district, Pêche is a perfect stop after gallery watching.  All fish dishe","useful":0,"cool":0},"VAV7DTBbNhTifXuC0IE57Q":{"text":"Excellent food and friendly staff. Only 4 stars because they forgot my side order. Still a","useful":0,"cool":0},"iR49-RwYNDeWD0S7YOV_3g":{"text":"Finally! Another great seafood restaurant in New Orleans, beautiful interior. \n\n*Highlight","useful":2,"cool":0},"uqMovnNy8vpib2pIZNfDzQ":{"text":"We splurged on the whole fish and it was extremely bland so we made the (difficult) decisi","useful":1,"cool":0},"Zkf34M66SglVbx79g_Vc9A":{"text":"We love Peche for both lunch and dinner. We made 9p reservations and we arrived around 9:0","useful":2,"cool":0},"z77GDSmV7qfvIMUFAxXVwQ":{"text":"The food was good and the service was okay, but my card was *triple* charged in comparison","useful":0,"cool":0},"XdlYESd7ndMgmMpRifnEPQ":{"text":"Spent the day at the WWII museum followed up by a short walk to Peche.  The Tuna appetizer","useful":0,"cool":0},"sVO0rEtbVcqOaF-kCftYLQ":{"text":"Peche was highly recommended and did not disappoint. They have some amazingly fresh seafoo","useful":1,"cool":1},"-gphl0rMpqCDqTfhjHypEQ":{"text":"Peche has a special place in my heart. When someone asks where they must eat in NOLA I alw","useful":2,"cool":3},"TI4NZsBog5VHfDlzYYxDbw":{"text":"Make a reservation. \n\nThis place is popular. We arrived around 6pm on a Saturday not knowi","useful":0,"cool":0},"ms7Exc-isloTbhhaMDr7Ng":{"text":"I wish I could give this place more than five stars! Food and service are both fantastic. ","useful":1,"cool":1},"bR9rDaT2QTBzoD1UYSpmkg":{"text":"Amazing food. Grumpy service. They refused to do separate checks or allow more than 4 cred","useful":0,"cool":0},"by8sEiNBcii9PaKQJTFhEg":{"text":"Love sitting at the bar for oysters and cocktails. Gentilly shakedowns are our favorite an","useful":0,"cool":0},"LtgY_g57dmKIcrRuzy5y8A":{"text":"Great service.  Waitress were very helpful and kind.  Food was okay.  Ambiance excellent. ","useful":0,"cool":0},"vvNpIVyjoCIXDVAbRFg-OQ":{"text":"Our 5F (Fourth Friday for Foodies and Fun) group went recently. Luckily we made reservatio","useful":0,"cool":0},"kStsQjkR7i_NCqXXCDbiSw":{"text":"Exceptional ingredients, terrific execution and great service. It all adds up to a wonderf","useful":1,"cool":0},"egdlSAGpLW-2lxa7lkinCw":{"text":"A must for local seafood!\n\nI was in town for the weekend and heard from multiple sources t","useful":1,"cool":0},"3IBB0hWDx-ECkfhlkQbfcw":{"text":"Peche was amazing! The decor was beautiful and our server was great. She told us that the ","useful":1,"cool":0},"cSBrNCjeLsg_oNPnH1VT6A":{"text":"Hands down, eat here when in NOLA. It's amazing. This was by far our best meal. Recommende","useful":0,"cool":0},"9qvQRhdQjSxm1Bpqsfz-kA":{"text":"Recommended to us by a local in an art gallery, this was an amazing lunch. Incredible qual","useful":0,"cool":0},"Hxbm1vNhJ8NltxIO06OFAg":{"text":"Great vibe at the oyster bar, highly recommend ordering the baked drum, and their dessert ","useful":0,"cool":0},"kOhypPnsIWWyg6ICEbmWPg":{"text":"Really delicious meal and amazing service. Everything about this place is 5/5, we got the ","useful":1,"cool":0},"6VUzsQrOjASludMVfNvZaw":{"text":"Absolutely the best, hands down \nTheir whole fish is amazing \nYou do need to make reservat","useful":0,"cool":0},"SrtQJbBibyY1Rfu38UoVrg":{"text":"I heard great things about this place, so I decided to try it for lunch.  For starters, I ","useful":1,"cool":1},"dMPu1SSwICCDaYRIcKhLxA":{"text":"My friend that i was visiting in NOLA recommended this new restaurant because he had heard","useful":2,"cool":2},"q-3eEDUXuK9DRMq6x6c0RA":{"text":"Yes, hello, Peche. I love you. Everyone already raves about the specifics so I'll just lay","useful":0,"cool":0},"GRUX51Oc9Xl6Pe93eI3VSQ":{"text":"Excellent atmosphere (we sat at the bar), quality food and friendly bartender. For two peo","useful":0,"cool":0},"SPuJ3e4lS5M__BiSi-jHuQ":{"text":"The host staff was great at explaining our seating options, helping us to get seated at th","useful":0,"cool":0},"VrtMuDF8z0DBk8isNEKD0A":{"text":"The food was superb and the setting is quite lovely. Though seafood is their specialty we ","useful":0,"cool":0},"iHXAiRQt6HiYFikgPC_jiQ":{"text":"I finally was able to make it to Peche and I was very excited.  I have been trying to eat ","useful":0,"cool":0},"fNhtex7qfBULPcUBj7iq2Q":{"text":"Perfection.\n\nThis is my second time here in a month, and I can't wait for the excuse to ta","useful":2,"cool":1},"mq8BY-jnTWKFAfpW58eETQ":{"text":"Best dinner we had our entire time in New Orleans.  We went with a group of 7, and my boyf","useful":0,"cool":0},"gLEDcXNqBrwfBrkCCzNFbA":{"text":"Made an email reservation, it was confirmed for a Saturday lunch ( you need to make a rese","useful":2,"cool":0},"Trlq_tqSyjRFOXD5ak4BgA":{"text":"Peche's menu tends towards the spicy of which I am aware.  Went to lunch with a friend and","useful":0,"cool":0},"NX5d9NiW4mYIhz7gs7YolA":{"text":"Excellent dining experience. Try the crab claws for sure but really you can't go wrong. Ha","useful":0,"cool":0},"zXFU8jhhQjh0aakeznJptQ":{"text":"This place was amazing. The decor was simple and comfortable and the food was to die for! ","useful":0,"cool":0},"i8lvOpxrW5CgJ5WUE0uzMg":{"text":"made reservations for 9pm. we were seated at 9:45. \n\nwere we seated at a table? no. were w","useful":3,"cool":1},"pyJ3cHJagw1A8KnVS7SzAg":{"text":"Just finished having dinner and everything we had was terrific.  Started with oysters and ","useful":0,"cool":0},"AG8QfGHnsS4J3Att18G8Fg":{"text":"Made reservations a month in advance. Called to let them know that we were in cab stuck in","useful":0,"cool":0},"jnbAk3R3ET7m1ci3juOUuw":{"text":"Actually I never ate here...The hostesses are terrible. They didn't take our name and just","useful":0,"cool":0},"_gkGDFvs-2QSZvO49BnG3A":{"text":"Enjoyed our lunch at the bar with raw oysters, ground shrimp & noodles and the crawfish cr","useful":0,"cool":0},"NR34TOQUzdgvtZp2HZLoqg":{"text":"Hands down the best food I had in New Orleans! It's pricey but WELL worth it.\n\nI went with","useful":0,"cool":0},"ZU7YWSAA2rPOwGT4ZxD_iw":{"text":"Our favorite eats from start to finish during our New Orleans trip...","useful":0,"cool":0},"LHywFpxDw8jMJZvuP3_m0A":{"text":"The service is wonderful. The oysters are tasty.  \n\nWe found many of the dishes too salty ","useful":1,"cool":0},"z7t3y1-FGcHRNvAhNGBpgg":{"text":"This place is a bomb! We ordered gumbo (best ever), tuba dip, Brussels sprouts and red sna","useful":0,"cool":0},"Ezon-SeE2pbxiBD5D9VSLw":{"text":"No need for a review, you'll just have to come to the restaurant and experience it for you","useful":0,"cool":0},"jIDeXIglhrfQmkXwQRbOHA":{"text":"Guess I'll add my review for the Newest James Beard Award Winning Restaurant. My friends w","useful":4,"cool":1},"ssfgXNFYhILWYbgIk12yDw":{"text":"The food is 5 stars but our experience was 2 stars so I will settle on an overall 3 star r","useful":0,"cool":0},"VgbKfJ4ExUOFpN8P7Up-JQ":{"text":"Our favorite meal of the trip! Everything was so incredible...the ambiance, the service, t","useful":26,"cool":23},"Xm7vQFGUghcju3Ixmv1gYA":{"text":"Very much overrated.  No idea why this is on so many \"best of NOLA\" lists.  It feels like ","useful":0,"cool":0},"84kABmPkjBrMlN-uyfWRXg":{"text":"One of my favorite restaurants in New Orleans. Fantastic atmosphere with a lively, modern ","useful":0,"cool":0},"ltoQWidqmawAbk7K5u5uTw":{"text":"Our server, Chad, was wonderful, helpful and professional. However, I was so very disappoi","useful":0,"cool":0},"SFa21oIPYgmcQIBhyU9Fwg":{"text":"Good food and cocktails, excellent service and great vibe all around. 4 star worthy but no","useful":0,"cool":0},"fG5bACnH51ivFGUj1m7Cvg":{"text":"Amazing as always. Oysters were wonderful. Plump and full of flavor. I love that they serv","useful":0,"cool":0},"qv1wKN_p4z4fc9FfdM2T2A":{"text":"I've only been in New Orleans for about a year and I think this might be my favorite resta","useful":2,"cool":1},"OIPAYfvTGd9472YWPId3dA":{"text":"Went there mid afternoon for an early supper and it was not too busy but definitely was pa","useful":0,"cool":0},"P5tJ6xiKvNkOHLBva7WCcA":{"text":"Delicious food in a beautiful atmosphere.  We shared oysters, several appetizers and 4 ent","useful":0,"cool":0},"nOtG7_K4PAXAh9hJVjxzIg":{"text":"Pêche was one of the best restaurants I dined at while in NOLA. Our concierge recommended ","useful":0,"cool":0},"f_4zBhftB-7-Pcv0Fkem7Q":{"text":"Loved this place. I always tell people to come here when they are headed to New Orleans. T","useful":0,"cool":0},"apfaKLP2QZmD_uOkfG-bOQ":{"text":"Excellent in every way. Finding a place that would accommodate our party of 14 during Jazz","useful":0,"cool":0},"jf4alipzPM9ELW02cBMyDA":{"text":"I never have actually eaten here... however considering the staff interactions I have had ","useful":1,"cool":0},"8qCMi5Zq9KFCtLCE9tMNQQ":{"text":"One of the better meals I've had in a while, the whole red snapper was beautiful and the r","useful":0,"cool":0},"1mthSR0UijV_Qy0N36SdOQ":{"text":"Loved the seafood bar!  I had a dozen local oysters, an amazing curry shrimp soup and the ","useful":0,"cool":0},"zrNIXANilnRCjM-rePdJig":{"text":"It's too often there is a wait because it's damn worth it, the service is quick and food a","useful":0,"cool":0},"QQX-KGrcmNwJielv8c8L6Q":{"text":"Finally we were able to make our way to Peche. \n\nWe got seated at the oyster bar and loved","useful":2,"cool":0},"G_MDt_gK8ea5xEBQKsz7aQ":{"text":"So disappointed!!! Let me start by saying that I absolutely LOVE herbsaint and have been n","useful":1,"cool":0},"u_Znd2WWbiqKJ08ALJaiqw":{"text":"Delicious appetizers for reasonable prices, amazing drinks and super friendly service. Eve","useful":1,"cool":0},"0NNM5zJr9Td2q2tbdt91Cg":{"text":"We found this place from doing a search close to the Hyatt regency on yelp.  It was about ","useful":1,"cool":0},"GhhdMWme4Ij0kZ35czv55w":{"text":"One word to sum up my dinner experience at Peche. AMAZING!!! We planned an 830pm reservati","useful":1,"cool":1},"TGLab4Da4bNVTyhR9r-g1A":{"text":"I stopped in for oysters and a martini with a friend. The oysters were good. I'd stick wit","useful":0,"cool":0},"JTMNKExbIjMFR03BEuuNbQ":{"text":"This spot is a couple of minutes' walk from the downtown hotels and is absolutely delectab","useful":1,"cool":0},"WBM5_jbBOD5tnS4ck9BvBw":{"text":"I was recommended this restaurant by two different friends and I do not regret taking the ","useful":0,"cool":0},"i0y3si2k6v3P4LcQIqK5fA":{"text":"I have visited Peche three times now, and leave each time more delighted than the last. Co","useful":0,"cool":0},"fIuVxj_4h0b7thPE1DQuuQ":{"text":"Excellent meal. Even though I was just recovering from being sick, the flavors in these di","useful":1,"cool":0},"8RFz4ZNldezb93qToMHF8w":{"text":"OMG Peche - luckily it is right outside my cousins' apartment in the warehouse district, s","useful":0,"cool":0},"bpHw6LLcPSNPuwdGcczgFQ":{"text":"Great atmosphere. Food was exquisite and the service was above par. Couldn't be happier wi","useful":0,"cool":0},"DM76hedYMIZ_IK4ZKu6q1A":{"text":"This is a culinary must while in Nola. I went for the first time by myself and sat at the ","useful":0,"cool":0},"A2QHu9p-AvnEpug5VppRPw":{"text":"Pretty average in a city of great food. The oysters are excellent and the variety is a nic","useful":0,"cool":0},"49-qn_-NLXKTwgNanSfjJQ":{"text":"Great ambiance! We loved it - especially that our 2 under 5 were welcome for an early dinn","useful":0,"cool":0},"oFQtDnYwMV62lfwIsG8l7w":{"text":"So the food was good, real good but my reservation about this place is the same I have wit","useful":0,"cool":0},"pj9xRESTohcprUCPJ1IINg":{"text":"Really nice restaurant.  Well decorated and it feels just the right amount of pretentious.","useful":0,"cool":0},"lZpbWGo-KFZsvohkV7Rm_Q":{"text":"Wonderful restaurant! I'll say all dishes we tried here are sooo tasty... Grilled whole fi","useful":0,"cool":0},"xsuNdP2tIy8ia9jkwtBiXw":{"text":"Food: 3.5/5.0\nService: 3.5/5.0\nValue: 3.0/5.0\nDecor: 3.0/5.0\nOverall: 3.5/5.0 \n\nSolid seaf","useful":0,"cool":0},"35j9Eaj1szHcgrEaVN8c1A":{"text":"This restaurant was suggested by one of our drivers who was originally from Portland. Let ","useful":1,"cool":0},"WBtcNzD1q0-xpMyjKDVurw":{"text":"The food was delicious but the staff was very pushy. Two bites into our desert the bill wa","useful":0,"cool":0},"T3oH5NOitc8pW6HdFVo66g":{"text":"Really fantastic. \n\nNot easy to get a reservation-- we had to eat dinner on a friday night","useful":1,"cool":0},"GwwQV-h6BZ6_RYgV_K7auw":{"text":"Another outstanding Donald Link creation. Every dish was delicious. The catfish with pickl","useful":0,"cool":0},"XLimX90mW2aD8PJE27k8JA":{"text":"Recently came here with a fairly large group.  Service here is impeccable.  Our waitress w","useful":0,"cool":0},"1MVcRJejkPyBleD2rw3jIw":{"text":"I've driven by and walked by this place as it was coming together.  Couldn't wait to check","useful":1,"cool":0},"R8IKi8KNip7v4UzgtY-BXA":{"text":"Y'all this place is legit! The seafood bar is amazing. We sat at the bar for a late light ","useful":0,"cool":2},"y0QsBtljWqZ4ovl_MaNytQ":{"text":"Great place. Great food. \n\nSmoked tuna dip wasn't too smoky, which was perfect, actually. ","useful":0,"cool":0},"yfF2wpOQC7sTH2e9XjnxIQ":{"text":"First meal of NOLA for me which was last Tuesday. We had 10 PM reservations and we had a f","useful":0,"cool":0},"aOTBdlsjzld5wKQv3QO5FQ":{"text":"I had the Hanging steak with the salsa verde. with cubed season fries. Very good! Well don","useful":0,"cool":0},"yLNQCDmikb8PBQDLgeXJ4A":{"text":"Not that anyone needs yet another review of Peche, but here goes anyhow: this is currently","useful":0,"cool":0},"9pXt-LI4rJYhhk9nn6r0bg":{"text":"Nice looking place but very expensive for small portions and I got canned green beans and ","useful":0,"cool":0},"FfBWXxGKK-unEEbfZ8E9Yg":{"text":"This is one of those occasions where a dining experience gets negatively impacted by one u","useful":0,"cool":0},"nYjJwJS-Sgxn7eExbD0CKA":{"text":"This was my favorite overall meal in New Orleans, which is high praise.  This is part of t","useful":2,"cool":1},"xp3VmpAwxi9TsJyYeyqc5w":{"text":"Fabulous meal and impeccable service! Would highly recommend to anyone visiting the city!","useful":0,"cool":0},"QidjiKLSZPaQ1MhQK2hg7Q":{"text":"Dauphin island oysters were perfect. Service  was good and setting enjoyable. Great spot f","useful":0,"cool":0},"iYxL1XM7kpmLxi_9QzLTgw":{"text":"Lunch at Peche was amazing. Beautiful meaty oysters, perfectly cooked catfish and a key li","useful":0,"cool":0},"npiajoNobecYj0aUzDTjLQ":{"text":"One of my favorite restaurants in nola. Every time I have been its been amazing food. A bi","useful":0,"cool":0},"Hg-_28AZZ84Xr0JFaeiveg":{"text":"Delicious! I'm so glad I finally tried this place. The best hush puppies I've ever had...m","useful":0,"cool":0},"eZCDqLE2OzAzPWJnaf4UCA":{"text":"Amazing food and staff! Came here on a recommendation from a chef friend and we absolutely","useful":0,"cool":0},"zWLJMG7-JjMKcemBt2uytA":{"text":"This place rocks! Amazing menu, service, and atmosphere, \nThis place is busy for a reason.","useful":0,"cool":1},"oEg4ksMPbazth5pMeYLP3w":{"text":"Okay so if we could give this place 6 stars we would! The atmosphere was business casual, ","useful":1,"cool":0},"PrwAkT_br1DUyGVBLdPlMg":{"text":"Delicious food, great atmosphere, and awesome drinks. Perfect place for happy hour or full","useful":0,"cool":0},"M_iGufjRMGlcc7tZPuwpFA":{"text":"Had called and made reservations and still had to wait 25 minutes for a terrible seat.  Th","useful":1,"cool":0},"CmCc7yjuBD9xoyI8HenEgw":{"text":"Amazing. Another NOLA gem. 4/5 stars due to inferior service and appetizers. The entrees (","useful":0,"cool":0},"QvstptbprAAUNL2QXH9QvA":{"text":"I came here with coworkers last month, when we were in town for a work conference. As we w","useful":0,"cool":0},"Li7nzB2RE0InPVLJXTsdSA":{"text":"Spent a month in New Orleans and this was our BEST meal. Don't miss out on the smoked tuna","useful":0,"cool":0},"hNszNvV-ePbnVboDdXztBQ":{"text":"This was our favorite restaurant in New Orleans! The place was huge, the staff were attent","useful":1,"cool":0},"O7wGb77AGnG7lf3Fs1wHlw":{"text":"Laura was incredible! We are not used to southern hospitality in California but she went a","useful":1,"cool":0},"j6hSXK9EQ0TkLyExLJ-KAA":{"text":"This has became our goto place for lunch while in town. The food has never failed in quali","useful":0,"cool":0},"uZFaT9VoPgfoG0Sbq2W6ew":{"text":"We went this restaurant on the way to World War Two museum and it turned out being the bes","useful":0,"cool":0},"eU9K88AoptMw5snfopddGA":{"text":"Wow! This place was amazing. The atmosphere was beautiful as well. Not too fancy, but also","useful":0,"cool":0},"__QvY9BaQYtS6VTJaW230g":{"text":"Went here for oysters. Great decision. The oysters were fresh and amazing. I would also re","useful":1,"cool":0},"xC-u1345Ie_uwvBlTX55DQ":{"text":"Totally enjoyed my experience tonight.  First time.  Servers were very friendly and offere","useful":0,"cool":0},"Zbyn3KtmRLBFR5WNvcZfhg":{"text":"Really good restatement. The place is neat, waiters are very nice and humorous, and most o","useful":2,"cool":1},"qjL1IW8NPeIYdYzJagLkaQ":{"text":"Found this spot courtesy of Tanya the owner of Rock n Sake Sushi.  Tanya sold me NBA playo","useful":0,"cool":0},"rXDe4-ad8Mm7gnHFczNZGg":{"text":"Fantastic. I ate solo at the raw bar for dinner. Having come to NOLA all my life I think I","useful":1,"cool":0},"X2iBvXDVAzZGIQ1satsmiA":{"text":"-eaten there many times\n-high price but taste is always on point\n-ordered oysters/pickled ","useful":0,"cool":0},"nHswsuyUh1fgnWRQUc7Ahg":{"text":"Hanger steak was like rubber! Atmosphere was cool and unique. Drinks were great. I may hav","useful":0,"cool":0},"j7pRoRNrg1AodmnWcFkk6g":{"text":"Based on reviews we decided to make a reservation at Peche for our last night in New Orlea","useful":0,"cool":0},"5CXI2ATa-m3n55QD7vZgsg":{"text":"From the friendly bartenders to the helpful hostess, the staff at Peche was awesome! Our s","useful":0,"cool":0},"_5mPaN6HWFDrapeElDznvw":{"text":"Great restaurant!! Loved the ambience (exposed brick, beams, etc) and the food was delicio","useful":0,"cool":0},"GUoeT029hEEpuSoCOo71DQ":{"text":"Must get the fried bread with sea salt....Amazing! The atmosphere was very neat. The place","useful":0,"cool":0},"TSR3ip31W9cuI1bZWjO59g":{"text":"I agree with some of the other reviews about the service at peche. Used to be one of my\nfa","useful":0,"cool":0},"RPaHLfN3TdhNtJ8MAXz1Mw":{"text":"We came here for a late Sunday lunch. The decor and atmosphere of Peche was perfect. Open,","useful":0,"cool":0},"O7nqOKJag73_eLFR3J4gxA":{"text":"Simply the best food and service in New Orleans. Our server Jonathan showed us what Southe","useful":0,"cool":0},"PkkoUfbeHMuXH30YS6Kv-g":{"text":"Wow!  This is the place to go in New Orleans!  The atmosphere along with the menu are very","useful":0,"cool":0},"tusg1kcRgZTIQC8lANVqHg":{"text":"...although I had to ask for a severe modification to the dish (allergic to onion), the Co","useful":0,"cool":0},"euVQKw19lJYatzbJ0ILwmg":{"text":"I had been here before and the atmosphere was fun, the food was delicious, and the service","useful":0,"cool":0},"_chi4gvyjJpQ4ee_f8dO_g":{"text":"I was at Peche restaurant last week while visiting New Orleans for the first time. I was w","useful":2,"cool":0},"f8op1kE5c2yt8nIudLxDdQ":{"text":"This place is incredible and the vibe is as well. We had the carrots and the oysters and b","useful":0,"cool":0},"8q53xy8IEE2-Jky5Cuxy-w":{"text":"Cabot express enough my delight!  I had marked this when I was visiting NOLA a year ago an","useful":0,"cool":0},"W9RLdhXkg2JOt0_1LeszcQ":{"text":"Our favorite dining experience in New Orleans. A very cool and hip restaurant. Food was ab","useful":0,"cool":0},"3TbTHTr7oY0tKNXv7LWhsg":{"text":"The whole meal was delicious.  The entire experience from appetizers to entree.  Get the f","useful":1,"cool":1},"dcg2UHe1I9rUjI2Jj5NdPA":{"text":"Wow I was so pleased to discover what a foodie town this is. And even though the conventio","useful":1,"cool":0},"x6VicCU8IXlCbq1vk6U__A":{"text":"Had dinner with stuffed chicken, fish sticks and crab capellini. Thoroughly enjoyed it. Am","useful":0,"cool":0},"zlNLVLbqFl62QK15R97jaA":{"text":"It's very loud but the service is impeccable. Until the after dinner drinks when they trie","useful":0,"cool":0},"p8E7PQIN0wx17vmArOlltQ":{"text":"Shrimp roll was absolutely the best I've ever had, the fried brussel sprouts were simply p","useful":0,"cool":0},"MgiAslyPPFp8gQyaK6okFQ":{"text":"This is my first trip to Pêche. I was a little disappointed that they ran out of Snapper a","useful":0,"cool":0},"Iy8W-vcymBso4qr7rrEzLg":{"text":"I just left the restaurant nearly an hour ago and since I am beyond angry still, I needed ","useful":0,"cool":0},"RqCAV9AvvMq_NdSdFZ18bw":{"text":"I don't even know why it took me so long to get here. I can't wait to go again. Yes, it's ","useful":0,"cool":0},"j5Yx2H7KIvLT-G5y9cWdjg":{"text":"Stopped for lunch on a recommendation of a friend who lives in NO.  Hubs had the cobia wit","useful":0,"cool":0},"nTSlRPCiDeC8vyz3Kx1KUw":{"text":"I give Peche a solid 4 stars.  I think my expectations were really high and not all of the","useful":1,"cool":0},"DgFIxzzbnq1aymJXVjNbtw":{"text":"We ordered two whole fishes one was the red fish and there was a snapper and the marinades","useful":0,"cool":0},"9Bb-NBI0K4ERPIQoBX0YNg":{"text":"I just left. We had a variety of small plates including oysters, smoked fish, fish fingers","useful":0,"cool":0},"6OBNtm_ORdJRfZMwTWr1ag":{"text":"Had an excellent dinner here with the hubby. In town for a work conference. Hubby started ","useful":0,"cool":0},"327TJ58cGqo1IawhoqVH-g":{"text":"This place looks popular. To popular. They said 30 minute wait. It had been 1 hour  and th","useful":0,"cool":0},"MamzkASjEEv2DtqYrgefmw":{"text":"Was visiting from out of town for a friend's bachelor weekend. Peche came recommended by a","useful":1,"cool":0},"1JtCgGn6KTCeUC_w3x_7eA":{"text":"I read many of the reviews here.  So many raved...I wanted to feel wowed with the whole ex","useful":1,"cool":0},"crnd3iv7VADnVxncw80uEQ":{"text":"Probably the most \"worth it\" meal I've ever eaten. The cocktails, dinner, and dessert were","useful":0,"cool":0},"npc-9rUI8ifuC8-znQxD1A":{"text":"We ate at Peche on a Sunday night in December.  It was quite busy and we were seated near ","useful":0,"cool":0},"S9VMMsUoavHCYUY0izh84Q":{"text":"So disappointed. Was ready for incredible food from the reviews! It was subpar.  Food ok s","useful":0,"cool":0},"FMnPuAe382zJaic_oSUczQ":{"text":"Expected so much more... Smoked tuna dip was really good, but the steak tartare was terrib","useful":0,"cool":0},"W62Aw_TB52aevzKpvrJpcQ":{"text":"The crawfish with pasta was unreal!!!\nSO GOOD\n\nService was also excellent, and it busy.\n\nI","useful":0,"cool":0},"0zgLP7UzJ3Jxqb0AKqmPkw":{"text":"The seafood gumbo was lacking. It should have been called rice gumbo, as there was only 1 ","useful":0,"cool":0},"9QsznxPa-YKSl276m23e3Q":{"text":"Recently spent an anniversary weekend downtown adding more chapters to our culinary experi","useful":2,"cool":3},"dIGWysFTpfV_upfKdDiAzA":{"text":"Highly recommended restaurant. So happy we came here after WW2 museum; 5 minute walk. Food","useful":0,"cool":0},"Ekl1RRsEgHFs04ryh5g34g":{"text":"Pesche Seafood Grill\nTruly great Food and worth the trip to the Warehouse / Art District. ","useful":0,"cool":0},"7X6_nP4Y0ylzxILqLMjzgw":{"text":"I have not had food this good in a very long time.\nWe ordered everything ! We really wante","useful":0,"cool":0},"wvwDubz_rsbKPBc1OH_M3w":{"text":"Nice small menu of excellent appetizers, small plates, and entries. Servers are attentive ","useful":1,"cool":0},"VKbf6JvLt7QhZ9rubKh6_w":{"text":"This was a wonderful experience. It is one of those top notch restaurants that check every","useful":0,"cool":0},"Pm-Qav5-yXKeTSQzbWcplQ":{"text":"One of the best restaurants in New Orleans, great sharing menu.  We have had the whole fis","useful":0,"cool":0},"lPXJSh_RhExKl9tzDZODHg":{"text":"Oysters - some of the best! Crab claws appetizer is a must when dining here. We've dined h","useful":1,"cool":0},"lcmtYScDjnMuySAfWpVnsA":{"text":"This place is awesome. We got the whole fish,  and a whole bunch of this, and ate them all","useful":0,"cool":0},"4zX9r6vS2psw_EtSqAz_eg":{"text":"Went for lunch with some friends.   This is the place for seafood.  Great presentations,  ","useful":0,"cool":0},"SWdLgVq3usMabaYCxGGmYg":{"text":"Que opinas de este restaurante ?? \nme gusto la atención, ni la actitud de los trabajadores","useful":0,"cool":0},"QXQ6X4odxKM5d1zITna6XA":{"text":"Oh my GOSH! \nMy first time here they had royal red shrimp as a special....and yes they wer","useful":19,"cool":15},"p6psHG9Yf9mgRTPVfqmazA":{"text":"In NOLA on a business trip and had difficulty getting a reservation 2 weeks ahead of Valen","useful":0,"cool":0},"jxRTc_-gPdj5v1JE6ZeFWg":{"text":"The absolute rudest host I've even encountered in all my life at a restaurant.   I will ne","useful":1,"cool":0},"aF4tw8NLZ9nNF4bBYbNE8Q":{"text":"A truly WOW meal. Sit at the bar if you can't get a table. Fried bread is delicious, as is","useful":0,"cool":0},"KUWl0EPr4qX1LP_sbD929g":{"text":"Snooty ass waiters and pretentious as hell. Menu is overrated and if you're not a local yo","useful":0,"cool":0},"rVmC5WcJvij9eJ3RLKkzsA":{"text":"What a disappointing night.  The food was delicious, but our server was terrible.  We are ","useful":1,"cool":0},"d4GqJ5z11GwR0nePBTUBaQ":{"text":"Food was ok. But that is not the issue!\nIf a restaurant invite customers to sit by the raw","useful":0,"cool":0},"N-p32kVF8SUiAm20ZGm7JA":{"text":"This place is beyond. Like its sister Cochon it prides itself on amazing food, cocktails a","useful":2,"cool":1},"E7ekn5j1nITiDqQWj5o8PQ":{"text":"Excellent food, service and priced. First trip to NOLA after ten years, will go back the n","useful":0,"cool":0},"zteINDDvCDWoOgdX_4tJnw":{"text":"If y'all in Nola and need some respite from the ridiculousness of the over fried and over ","useful":1,"cool":0},"yJEYrDjMawNyZQRONZ0HhA":{"text":"This was our first dinner in New Orleans, and I was impressed, although not blown away. Ou","useful":0,"cool":0},"YLlIERrZUfgy_uLuNdvTVg":{"text":"I'm about as much of an adventurous eater as I am a cool person. Meaning that in my head I","useful":4,"cool":1},"f1sG7aAiBfuzaVqbf8e1JA":{"text":"Quite expensive, but amazing service and drinks!! Our waiter Heather was the sweetest woma","useful":0,"cool":0},"pN-L0l_mhIotKKmW070Ljw":{"text":"I loved this place! And it seems that everybody else does too! I tried to book a reservati","useful":0,"cool":0},"YUTjk1IzBa4jKHZ84hhqdQ":{"text":"Loved it so much came  twice within 3 days. Once during a bustling night (sat at the bar w","useful":0,"cool":0},"o9NsCFMTTrQvaBXHKQbBDg":{"text":"I visited New Orleans and ate dinner here a few years ago. Honestly, it's one of the main ","useful":1,"cool":0},"zSHz31xIH9wOv-kiGTfobg":{"text":"This is our first time to NOLA and frankly our restaurant selections mostly had been so so","useful":0,"cool":0},"Boy6kJIMAD6bxWZ8H3tKmw":{"text":"Nice restaurant and I would definitely come back for another try. Area 3 Oysters were very","useful":0,"cool":0},"JkgPfrgTz1oUrxxcaii9sw":{"text":"KenScale: 8.5/10\n\nNew Orleans has been well-known for its fresh seafood. Unfortunately, th","useful":0,"cool":0},"HTdoOz5BNctFHe2a1K0Vkg":{"text":"Coming into New Orleans, I expected a lot from the seafood. However, this restaurant disap","useful":1,"cool":0},"ByJZ12dIClrk_PGMUYMduA":{"text":"Everything was delicious. I had Smothered Catfish and the portion was generous and the dis","useful":0,"cool":0},"O_AzESjtAIl0MkJkgvOx3w":{"text":"I'm torn a bit as I write this. It was good, don't get me wrong, I guess I just expected a","useful":2,"cool":1},"7O_mXQXe9kw3uRxwCqTQyQ":{"text":"The seafood salad and red fish are amazing! They have you filet an entire red fish on your","useful":0,"cool":0},"x86YUXy5q1uwNsr8I6RTng":{"text":"I went to Peche for dinner with a friend the week it opened and all I can say is WOW.\n\nHer","useful":2,"cool":0},"mD7CaTdJLqaIgkd3RuMalA":{"text":"This was the only reservation I cared about before heading to New Orleans for Jazzfest, th","useful":1,"cool":0},"hK1PtZW0H6FgIjIFzf79AQ":{"text":"Enjoyed a wonderful meal with outstanding service, food, and drinks. The server, I believe","useful":0,"cool":0},"KxxdaWk9V4YRsLMjKI62Eg":{"text":"Excellent seafood, service, and atmosphere!  We tend toward multiple small plates for vari","useful":0,"cool":0},"2TfTrwYmFWO5Iw79geCGSw":{"text":"Went to Peche to celebrate a birthday dinner. My overall experience was great and my serve","useful":0,"cool":0},"bE80L6MQtRNSK1y1MR_QIw":{"text":"Hands down a very professional establishment from the hostess greeting to the two gentleme","useful":0,"cool":0},"WDYtqbPgtIkOsoMw-lphNg":{"text":"GO...HERE!!!  It's better than anything you'll find on or around Bourbon Street.....screw ","useful":0,"cool":0},"pFI-mfUuzlDUIbgoBZcrfA":{"text":"Had lunch. Food was good but host and server were rude and obnoxious. Similar restaurant L","useful":0,"cool":0},"E9Q3RDnPcono_5a8sA3qAg":{"text":"To the 'gentleman' working the host desk yesterday- Please remember \"It's not what you say","useful":0,"cool":0},"R9UDu_92JICDMb7QtmqU5Q":{"text":"Could have been five stars but...\nWe went to sit at the bar, there was an incredibly rude ","useful":0,"cool":0},"ZXsDj5R5tCJZPKqpZEx2gw":{"text":"Went here for a family lunch. The food was some of the best I had on this trip to Nola. \n\n","useful":0,"cool":1},"czoTLffTtL0OWLpNSYUaIg":{"text":"Peche was great!  We had some raw oysters, the raw tuna with corn and chile.  4 of us got ","useful":0,"cool":0},"7cw7OYRErXIvwrhgz5r6-Q":{"text":"The food is good quality, fresh and delicious. The clear standouts were the red snapper (w","useful":0,"cool":0},"uhBBYYSc1fGDRoReJQw_Yw":{"text":"What a treat...like New Orleans needs another great place to dine!  The Seafood Salad migh","useful":0,"cool":0},"dLordfQp1ZrFl6bK59CMcA":{"text":"Yum! This place is great. The atmosphere is casual but nice and the food is spot on. The o","useful":0,"cool":0},"iilZXy9EDADfHto_iFIwCg":{"text":"Nice place and very delicious food. A lot of people went there. Can't believe it needed to","useful":2,"cool":1},"QynEILFAH9i8xZfjGjWGWw":{"text":"Great seafood, awesome raw bar and well prepared dishes packed with flavor. Tried them for","useful":0,"cool":0},"wxFZ3FmAPjQ_8gv5h9jWjQ":{"text":"Sitting at the raw bar was such a great experience. I came in late afternoon as they were ","useful":0,"cool":0},"DO4KyqlToSTtfYSbi-auZA":{"text":"Amazing!! One of the best dinners I've had in NOLA. Ambiance is pretty cool-- loud, fun, l","useful":0,"cool":0},"bqg8vyUNAq3YVNccWJsB9w":{"text":"Came here for Valentine's Day weekend and forgot to write my review! Service was great and","useful":0,"cool":0},"ON_v09B_ouhNGxDI-qo1GQ":{"text":"Was recommended to us by the bartender at Bar Tonique.  Did not disappoint.  Ridiculous fr","useful":0,"cool":0},"U5wuboQID5AAfXrCTx1pnQ":{"text":"I visited Peche as a suggestion by the concierge at the hotel where I was staying. Overall","useful":0,"cool":0},"piLKWKXt6MvB1NCOmlDRVg":{"text":"Definitely one of the best seafood restaurants in NOLA. Everything is delicious, but my pe","useful":0,"cool":0},"W5TJ0LXCH1nTXLJmtigS_A":{"text":"Let me start by saying I have had nothing less than stellar experiences at all of Links re","useful":4,"cool":0},"-u50v0jajuUk4qlRbijbhQ":{"text":"We just had a wonderful evening where everything was close to perfection. From the cocktai","useful":0,"cool":0},"B5-isuM2GXZGkwMfrFPvVw":{"text":"Well, again the locals were on the money and I again sat at the oyster bar. Had the steak ","useful":1,"cool":0},"jY84K5os4WbVhvO71qyXyg":{"text":"Good, not great. Oysters were quite good. I thought the baked drum and Brussel sprouts wer","useful":0,"cool":0},"o9NjH5wrBDfNWXFc-cPyeA":{"text":"OK.\n\nReally a 2.5. Dwelled on a 2 but decided to be nice and safe.\n\nHad dinner there last ","useful":2,"cool":1},"6p8G_E8m12GfnpvjXjodkw":{"text":"Highly recommend.  We were in town for a long couples weekend and had an epic dining exper","useful":1,"cool":1},"zYI6ZJOW2iW73rIaUKty4Q":{"text":"We had a reservation on a random Tuesday, it was very busy. The food is amazing - smoked t","useful":0,"cool":0},"LRqrEfHO0SPCzICjmjY4GA":{"text":"By far the best oysters I've had in NOLA. The food and service was absolutely stellar. Enj","useful":0,"cool":0},"4B5Bip-Xj-kit8NLEkGIZw":{"text":"The food was pretty good. The fried bread and the capellini were awesome. The sprouts were","useful":1,"cool":0},"JdQHvAwZILchbJphpF6vkg":{"text":"Back in town and back to Peche for lunch.  This time had the green salad with lemon feta l","useful":1,"cool":0},"5sNEhVrW3mgjeXKn51SWSA":{"text":"I've been here once before and had a good meal but wanted to try it again. My co-worker/fr","useful":0,"cool":1},"rohG3IJoxolsiMBdNWlHjA":{"text":"Great place for lunch or casual dinner. Fresh seafood. We had oysters, fish sticks, and gr","useful":0,"cool":0},"94D7SgzBO90hNzoswBcnCw":{"text":"Everything about our dining experience was phenomenal! From the atmosphere to our server a","useful":0,"cool":0},"6PxwVMSw58l5YfdsipDk2A":{"text":"I was with a large group and this restaurant handled us with ease. We ordered food for eac","useful":0,"cool":0},"vUefO8kuhSxscYjQLO46YQ":{"text":"Fresh and delicious. I wish they would add a few more top notch fish entrees that don't re","useful":0,"cool":0},"NJ4moEvMteTsqK62_jVnOQ":{"text":"Amazing meal in a relaxed and casual setting. \nWonderful meal. Oysters, Brussel sprouts an","useful":0,"cool":0},"3e3haD-4JbRnKKvahKzbUQ":{"text":"Really excellent. The grilled tuna was so delicious: chipped olives, a light vinegar eye..","useful":0,"cool":0},"Gzji6vCHVQm3a6C0xYY6Vw":{"text":"EVERYTHING was delicious!! Even the kids' meals were fresh, homemade and tasty. The staff ","useful":0,"cool":0},"O3qXRR5EJEao1Exl0OirmQ":{"text":"Peche Seafood Grill is a neighborhood gem. They specialize in seafood, but have very good ","useful":0,"cool":0},"lx1P2wC7Rbn7QEKgU5m_pA":{"text":"Great food and vibe. Had lunch but want to come back for dinner and a few of their drinks.","useful":0,"cool":0},"4Jk-VVMngeCWzcKomX3syw":{"text":"If you're looking for fish New Orleans style this is the place to go great ambience and ab","useful":0,"cool":0},"0uLuSl2NUyfPPKRd6l77vg":{"text":"We were a party of 8 - my husband and I, our two Children and both sets of grandparents. T","useful":0,"cool":0},"Ji7cFvzDEZEyVm8GJSDZAg":{"text":"Julia Street  - mildly sweet with a bitter punch. 4/5 - less bitter,little sweeter. \n\nCab/","useful":1,"cool":0},"rKErJAVlpQyhBt1yYAjKoQ":{"text":"A friend of a friend works at Peche and was able to secure a dinner reservation for me and","useful":2,"cool":0},"N5QkX-VrkRClE11lt70crA":{"text":"Would give the whole grilled fish a 5. \n\nBut the rest of the meal was disappointing. I did","useful":0,"cool":0},"Umiy6pDV8rHf4z_P0YZ6vA":{"text":"It takes 5 seconds to assess a restaurant. This place is stuck-up with uninspired food. Th","useful":0,"cool":0},"lsDEE2AJf55UBWQd73mROA":{"text":"We are from Baton Rouge, LA and we go there for lunch every chance we get. Walk right to t","useful":0,"cool":0},"50QJy4j4vQmTvU3yvKXAMg":{"text":"This restaurant has everything going for it: excellent food, superb service, ambience and ","useful":0,"cool":0},"p5Fl2p8kRO1FKKa18xhirw":{"text":"Outstanding lunch here. Our group had oysters,  skirt steak, and drum. Everything was fant","useful":0,"cool":0},"9F4OpdFqP9-v37lul9wBaA":{"text":"Ate at the bar while in NOLA on business. Had 2 dishes from the Raw Bar. Both were excelle","useful":1,"cool":0},"ZJY9QMSaURC_SokNFvbUxw":{"text":"This restaurant recently won a James Beard award, and I can see why. They deliver excellen","useful":3,"cool":1},"DkMJ8oeopAAdrIXXWjHG0g":{"text":"My husband and I visited Peche yesterday for our Valentine's Day dinner. While normally no","useful":0,"cool":0},"vmzRlsxyzWiqFv7bdZaIVA":{"text":"Have to have the fried bread and the drum!!!!  So delicious.  Best food in New Orleans!","useful":0,"cool":0},"NCbbDQ7Ld_XJzGr-kFqEBQ":{"text":"What a great meal!!!  I'm glad I stayed as I was ready to walk out because of the loud obn","useful":2,"cool":0},"0wOJLpddUdUCj55t-BU46A":{"text":"I really loved this place!  What I really liked about the food was that the flavors were r","useful":0,"cool":0},"cMHfx8fKe3EZ8fQayBsl7Q":{"text":"Surprisingly, this was my least favorite meal in New Orleans. I thought it would be one of","useful":0,"cool":0},"8qMChk7-I_KvFSlgAj8luA":{"text":"This place is amazing ! Friends found it while sun tanning and we did not regret it We had","useful":1,"cool":0},"qnFEuLny5-t_26UPWKAOqw":{"text":"I had to average the stars for our experience. The food was five stars easy. Our food took","useful":1,"cool":0},"O1isu92nn1GduSdPvppMnw":{"text":"Pinnapple Rum Cake.. Do it.  The smoked tuna is excellent.  No matter what order a whole f","useful":0,"cool":0},"sfnRlq_j0szpJbTuHDXwmw":{"text":"Favorite restaurant in NOLA, been here many times, never disappointed, every dish has been","useful":0,"cool":0},"0XB_EVJtAmih_iZ_VfMLjQ":{"text":"Alison,  the bartender is a GEM! She always greats me with a lovely \"down to earth\" smile ","useful":1,"cool":0},"3FNwOKgWy1gzrdTe9eMtLA":{"text":"I love it when I get to give a 5 star review with no reservations :)  I met someone who re","useful":2,"cool":0},"MDdPwIpdbI8BQNOGUyzUnA":{"text":"Peche was a yummy treat! We had reservations for 3 on  saturday night and we were seated p","useful":1,"cool":0},"4e_yZf3o-AcyaqSRje_69Q":{"text":"My 19th anniversary dining experience at Peche was extremely enjoyable,  food and service ","useful":0,"cool":0},"vE-OAdRc0tK3QNsVdhw55Q":{"text":"We started with half a dozen oysters from Louisiana and Alabama. While they were definitel","useful":0,"cool":0},"wr8OOoWWiEh7Ct_k8Q8X9Q":{"text":"All of this food was delicious. Great atmosphere and place to hang out with friends for di","useful":0,"cool":0},"hZSHhLqeEx9TU63_piz78Q":{"text":"WOW. We went to the World War II Museum which it was a long and emotional day. Afterwards ","useful":0,"cool":0},"RxIdIIhVmiIXQeHVKHwICw":{"text":"This is definitely one of the best restaurants in New Orleans.  And that's saying somethin","useful":0,"cool":0},"FHZ88TuQKSgLz1aQxcwpKg":{"text":"Pêche is one of my favorite restaurants in New Orleans. The oysters are always fresh and o","useful":2,"cool":0},"f91eD14CGvCATGurH5GV-w":{"text":"We stumbled upon this place after seeing some art galleries in the neighbourhood and we we","useful":0,"cool":0},"GwnnyWNcPQNRWg2teDJefw":{"text":"Man, this place was delicious! Worth the hype, in my opinion. My boyfriend and I split a b","useful":0,"cool":0},"1x3UJy-mweZvs6CLTS-s1Q":{"text":"Really creative and delicious seafood. My friends and I shared about 7 different items, an","useful":0,"cool":0},"pKGzMTbwSfGkoR3CrUt6vg":{"text":"Where do I begin? Our food was amazing!  We started with the shrimp toast, and I had the c","useful":0,"cool":0},"cW8Rxkbj2okh7QkU8kjyvw":{"text":"Been twice and both times exceeded expectations. They have a whole fish special with a cil","useful":0,"cool":0},"-ONx-cc73qqEczaTgksXnA":{"text":"A favorite place to go for stellar seafood.  Wouldn't categorize it as creole, but love it","useful":0,"cool":0},"G1cyrX1ZVxDfbc4MZtcSoQ":{"text":"Ate here the other night and it was just as good as everyone says! I got the ahi -so great","useful":0,"cool":0},"2aiplWY_drTjo480fWVxzg":{"text":"Food and drinks are excellent, but the noise level--and this was on a Monday night--was in","useful":0,"cool":0},"JTzwL6nAHMvpeR99dFuc6w":{"text":"This is my second visit here over the past year. I can't rave about this place enough. Eve","useful":0,"cool":0},"-8i9laOoeNNFmriH515R0A":{"text":"Amazing food, service and drinks...do not expect happy hour pricing.  Cool music and nice ","useful":0,"cool":0},"HJzWfu_p-fbwELn2ISE5PQ":{"text":"(oh dear this got long, brace yourself)\nWas in the Big Easy for a conference for 4 nights,","useful":1,"cool":0},"lYnntoE506CozqK4W17VsQ":{"text":"Meh.   Expensive, small portions, limited menu.  Should get four dollar signs.  Servers tr","useful":2,"cool":0},"FI6TMHMdRVT_22tCJ6RE3g":{"text":"Amazing is the word that comes to mind with every dish. The food is fresh and delicious, t","useful":0,"cool":0},"evCFjp9O9EnhKUpV_kl3cA":{"text":"We had to wait 15 or 20 minutes for our reserved table. The host dealt with us impeccably.","useful":1,"cool":1},"FZmBsH16UO7-n0bv2bq6vA":{"text":"Great if you're on a diet. $15 for 6 1\" teeny medallions of fish. Not a roll, slice of bre","useful":3,"cool":0},"H5FRZSBfyboa9ysz-uImqQ":{"text":"As Peche was recommended to me by several people, I was anxious to try Donald Link's newes","useful":2,"cool":1},"emzVt0TK_pByaSQxwVVW8Q":{"text":"Nice atmosphere in this trendy cool restaurant. Really keen friendly service and delicious","useful":0,"cool":0},"uqVjueapZi9EdFSV24MwvQ":{"text":"Food was excellent.  But was this New Orleans? Even in Chicago or New York you don't get t","useful":0,"cool":0},"0lmgLEGWVadlksYibvi4fA":{"text":"Pêche was a very happy and tasty experience. Though we only had two appetizers, they were ","useful":0,"cool":0},"YYtg3xHpn1v_88ux_sZqSQ":{"text":"Our group was collectively disappointed in the overall experience - my expectations were m","useful":0,"cool":0},"AtLnYplvj8u0M6XtYe77SA":{"text":"We had lunch here yesterday and loved the menu and ambiance so much we are going back ther","useful":0,"cool":0},"2FxNlb_uCxskAB3yyK0HbQ":{"text":"UH-MAZING!  I am a big fan of anything Donald Link does and I've been dying to give Peche ","useful":1,"cool":1},"3g0Dl_thY77UHk4vBORpEA":{"text":"This place had some very good cocktails, and  a delightful red fish whole with salsa verde","useful":0,"cool":0},"wauHzcJNdC7G4SwIdDOQTA":{"text":"We were able to switch our reservations to an hour earlier, with no issue. Heather was our","useful":0,"cool":0},"XBFa8NAUrTqi_iea1moyiw":{"text":"A Donald Link restaurant that specializes in wait for it... Seafood. An excellent choice f","useful":0,"cool":0},"Fm9vxN8UvKiLO6nPP1u-3g":{"text":"Best food and incredible service. The steak tartare blew me away. A fresh take on a classi","useful":0,"cool":0},"XAAWTBfXJkbPg92UJdUVYg":{"text":"Excellent ambiance. Excellent bartenders. The food was some of the best I've had in the ci","useful":0,"cool":0},"A2KAUzKMilD-9RMpbtdtvw":{"text":"Great trendy place recommended to us by a cab driver. All the food was good. The table rav","useful":0,"cool":0},"EQHtDzTVZvnn_eYrizIHqA":{"text":"What an awesome dining experience. I was with a group of 7 and we decided to order a bunch","useful":0,"cool":0},"20sYUKMnb0PhBZbwtk3i8Q":{"text":"Perfect food. Great scene. The service was great and the food was amazing. Unreal beef tar","useful":0,"cool":0},"xgjxCKveahLRlGP75DfMGA":{"text":"I may be biased (my roommate works at Link Restaurant Group) but Peche is by far the best ","useful":0,"cool":0},"cEs4xVveZMFml0rlys5CSw":{"text":"What a gem with great service to boot.  Hip but unpretentious. \nWe had four adults and two","useful":2,"cool":1},"r1m0RYHf58IJlz-nk7P9UQ":{"text":"This resturant is abseloutley delicous. Every item we ordered was fantastic. The whole fis","useful":0,"cool":0},"cMlSl1QQrVRrecOGMwjCfw":{"text":"Lives up to all the hype! First, we had a large party and the staff went out of their way ","useful":0,"cool":0},"PH8i3enME3OagBERTfbIVQ":{"text":"Best Brussel sprouts around. Great atmosphere, bar and food. Can't go wrong at Peche!","useful":0,"cool":0},"_-MTzzIaO3k0Vo58fZA8nQ":{"text":"Just amazing! Food, service and the whole experience!  Do not miss, you'll regret it!!!","useful":0,"cool":0},"JRXbnLgIM5aOvDo0-QEgaQ":{"text":"Seafood Platter. Brussel Sprouts. Hush Puppies. \n\nI really liked this place. Especially wi","useful":0,"cool":0},"GEzQTRlaltkiJUT9Y4ZABQ":{"text":"This place was the best!\nHeather was our server and she was without a doubt the perfect an","useful":1,"cool":0},"nGvXc92yIkD9i8xrPVFBoQ":{"text":"Recommendations:  raw tuna w/ watermelon\n\nRaw tuna w/ watermelon, fennel vinaigrette + gre","useful":1,"cool":0},"z7VUuTF5MorsASqkjzUeDg":{"text":"Fantastic. I had the best seafood salad of my life here. Seafood salad doesn't even sound ","useful":0,"cool":0},"DQPp0eS986gMu0Ynmwdu4w":{"text":"We got lucky to get a late reservation on a Friday night. I was just happy that we got in.","useful":1,"cool":1},"nnT4eTT7wKYEuzd7UhXMsg":{"text":"Perhaps the star rating is harsh, but we had very high expectations based on the James Bea","useful":1,"cool":1},"UvmoSOIwiakb0ikiSnphUg":{"text":"we went for dinner and had the curried mussels and oysters to start, and the whole redfish","useful":0,"cool":0},"CZ2A2A_u8nonj_rNLjUhSw":{"text":"I was only here for oysters but I enjoyed them very much. This is a pricey spot, but it's ","useful":4,"cool":1},"zxu2nLNKIUjSwIyuw2re-A":{"text":"Sooooooo good! Walked right in and were able to be seated for a Saturday lunch. The smoked","useful":0,"cool":0},"jSoLrmpBth1iK4_s2HJQgA":{"text":"Make a reservation. This is a more upscale resturant. Food was Phenomenal, different, and ","useful":0,"cool":0},"JM6woaXeHbzPtUfeap0G4g":{"text":"I never write reviews. I've worked in the restaurant industry for years and was a manager ","useful":2,"cool":2},"BpaGEQo40WeJM6-2kfsEdg":{"text":"not in love with this place. tried the fried bread, the rock shrimp, the crawfish au grati","useful":1,"cool":1},"Tb92x2SCChRP2P8ZOqBJhg":{"text":"Loved the food and the atmosphere. As well as watching the waiters at the oyster bar. It d","useful":0,"cool":0},"vPvB3yLx9AaxZ4bfYFXoqA":{"text":"We tried Peche for the first time last night.   The service and recommendations were excel","useful":0,"cool":0},"H6w1D4HcYRYY7i6Nd77X1g":{"text":"I picked out Peche for an early evening dinner with my parents and a friend because I had ","useful":3,"cool":0},"OCg4K1Shi1vmyWUf82VWHw":{"text":"My best friend and I decided to have a girls night out and picked this James Beard restaur","useful":1,"cool":0},"iFUAOpW9XsaGuEmsuMDf9A":{"text":"Outstanding experience! Favorites included royal red shrimp (ate them shell + all!), snapp","useful":0,"cool":0},"KFVCKzJB9cf8exH-xs2B0w":{"text":"Fish compliment to Cochon - deep water red shrimp was particularly delicious. All the dish","useful":0,"cool":0},"H06BJMeCNxWIvxgPjjOBcg":{"text":"Loved this restaurant! Made reservations and were seated immediately when we arrived. Trie","useful":0,"cool":0},"QSgj5kv-GJqCagVoufqgew":{"text":"BAM!!!  Had an AMAZING meal here!! We came here on a Saturday night on our honeymoon. My B","useful":0,"cool":1},"8Yn1KKd66MEchet7cb2Tcg":{"text":"Love Love Love. Not only was the oysters YUMMY but the service was excellent :)","useful":0,"cool":0},"1shxYKvImi0xWRxJ7HQodw":{"text":"The rudeness of the three clueless and disjointed hostesses was unbelievable on our last v","useful":1,"cool":0},"SEb8WC1wBQk6Z3syd2BGEw":{"text":"This place is BEYOND delicious! Run! Don't walk here! Prepare yourself to enjoy a creative","useful":0,"cool":0},"MwRWJpauvy50LvoUCKXUhA":{"text":"Absolutely amazing food. I got the Crab Jalapeño Capellini and Fried Bread. One of the mos","useful":0,"cool":0},"ridNdYzGsItfGmZthO8nUw":{"text":"A group of us went here for dinner last night. Reservation was at 9:30 pm but we lucked ou","useful":0,"cool":0},"Sd2AQV7F5wixxo1sxvltPw":{"text":"It lives up to the hype. Delicious food, friendly staff, unpretentious atmosphere. Everyth","useful":0,"cool":0},"LluARdnf3_S3Kxy0wEhvXQ":{"text":"Amazing restaurant.\nThe oyster were very good along with the tuna appetizer but the fish i","useful":0,"cool":0},"eKKjKw1LVCx0fP46YWZ3yQ":{"text":"Seafood gumbo is delicious. Order it. Thank me later. I did notice that you may need to pr","useful":0,"cool":0},"OBu7KLg2VJMCaA0JZY99DA":{"text":"Excellent! We loved the fried bread, crab claws, and smoked tuna dip for appetizers. Grill","useful":0,"cool":0},"iZ1U3NZlRy9ARHNh8m9qTA":{"text":"I went here tonight with a colleague at the advice of our concierge. OMG. WOW.\n\nWe're here","useful":0,"cool":0},"UeJuliNoOZRQSRXRl7-vcQ":{"text":"My meal at Peche was the best meal I've had during my five days in New Orleans.  My only r","useful":0,"cool":0},"KIWU8GE_OcnHF9tmEgqErQ":{"text":"Great place to have a meal. Had lunch after visit to WWII museum. Definitely need a reserv","useful":0,"cool":0},"T04Ot7KP3IaGrlruHhYn7Q":{"text":"4.5 \nI came to NOLA for vacation and my sister recommended this spot and it did not disapp","useful":2,"cool":0},"6xlzM8YAyPFocydTH1FWLg":{"text":"Food and service was very good. But, the noise was a major drawback. The ceiling in the di","useful":0,"cool":0},"U6cvLK1z5MR8p6vhIN4wLg":{"text":"I went to this place last night and the decor was really beautiful. Christmas lights up an","useful":0,"cool":2},"bXAT7sQwujYFmSDhljYs1w":{"text":"My husband, mom, dad and I came here on our first night of our very first visit to NOLA. I","useful":1,"cool":0},"MdVGn2aTDBHOKZgEzteZ8Q":{"text":"One of the best seafood establishments I've been to. We actually went multiple times on ou","useful":0,"cool":0},"3wbHOnZFPvIPmW-5BJo4eQ":{"text":"The raw oysters were massive and served with a nice red wine vinegar sauce, great ambiance","useful":0,"cool":0},"opwi1YNfaFqnKoSWK-QEUg":{"text":"The food was OK, not outstanding. \nThe waiter was very rude. \nThe management/ owner, well,","useful":1,"cool":0},"GcksxYB_Mjcsrlu68IjISg":{"text":"The food was great! Great atmosphere and the service was friendly, helpful and quick. Our ","useful":0,"cool":0},"f-vjx9Zkx2N8zmzLgtZ7KQ":{"text":"Get the whole fish, it's amazing. The raw oysters are great especially with the 3 sauces y","useful":0,"cool":0},"mlqPLlfutp0WkYj7kAVCXQ":{"text":"Had a nice dinner but did what I always make fun of others for, ordered the skirt steak at","useful":0,"cool":0},"B4be8DRhUpjyaQ-LaHNouw":{"text":"We were in town with a large group of family celebrating two birthdays and an engagement. ","useful":1,"cool":0},"Vfg2fmfas3l5NAT96iXIUQ":{"text":"LOVED our dinner here this weekend. Service was great, and it was worth the 10:00 pm reser","useful":0,"cool":0},"4FPsE4TzILjlL2KkHcLglg":{"text":"We went to peche after tour the world war 2 museum which by the way is a must see. We were","useful":0,"cool":0},"i72ya0iEnCi2w4ATV-3oDg":{"text":"When I come back to visit NOLA, this will definitely be on my list of to do.  Our meal was","useful":0,"cool":0},"aJgL5LqY6DsUhjJKWojMXw":{"text":"This is my third time here.  A very consistent high quality dining choice in New Orleans. ","useful":0,"cool":0},"YYThCldLz3-RbMCk8MG2bg":{"text":"This place is very suitable for business lunch. The seafood platter was marvelous and the ","useful":0,"cool":0},"nieRnepoqE9zIi0ki-FBcw":{"text":"Just ok. Oysters were nice. We ordered while red fish and the skin was gummy. Overall a di","useful":0,"cool":0},"whRhh1Xki7jC31Z7jDEHwg":{"text":"Buttery, flaky, yummy whole fish. \nIf you can stand looking at it, it's worth it. \n(See ac","useful":3,"cool":0},"heaEoGwyzomC53-JjIeaPA":{"text":"The food was absolutely amazing. We had the smoked tuna dip appetizer which was fabulous s","useful":1,"cool":0},"Wu4zk7qhBQBGC3C7PQC9Tg":{"text":"Fantastic dinner. \n\nWe had two servers working as a team, so we were taken care of very we","useful":0,"cool":0},"cFmxrL7nguqp-phcm0jrrA":{"text":"Headed over last Friday for our second visit with two out-of-towners looking for some good","useful":0,"cool":0},"xIkshyWsQL7m7iZbPk-iyA":{"text":"Very competitive to get in almost like a NY restaurant but experience was well worth the w","useful":0,"cool":0},"0PxNxWc_Slg26J_RKsH-1g":{"text":"Our friend Amy planned a \"Sunday Funday\" on our last day in NOLA a couple of weeks ago, an","useful":0,"cool":0},"lqi56_8OFAU0EMzACZhVLQ":{"text":"Had so much fun at Peche with my girlfriends visiting from out of town! The atmosphere is ","useful":1,"cool":0},"Sluw9KO8YSfUrdOiLVqRNg":{"text":"We were recommended this restaurant by the hotel concierge. When walking up to the establi","useful":0,"cool":0},"3yEJkIq8PRaa1fwmXP8NwA":{"text":"This is now our favorite restaurant in NOLA.  The food was amazing....fresh...fresh...fres","useful":0,"cool":0},"hgHS3F6oIIssI6Z2Bb1sUA":{"text":"Friend and I were in NO for three days and we came here twice! That's how AMAAAAAZING the ","useful":0,"cool":0},"_WuRmchrrnXVil-GTaMW0A":{"text":"Meh. This place is not as good as the hype. We went with a group of 6 do we got to taste q","useful":0,"cool":0},"_1e0dBE-qTXGfzahRP-owQ":{"text":"I was glad the restaurant is not some stuffy upper lip establishment. The food was not bad","useful":0,"cool":0},"h2sOpzZiWg4UvWrqdxMX3g":{"text":"So delicious! I sat at the raw bar, which made ordering more and more oysters so  easy. We","useful":0,"cool":0},"ohkyOu2sUQQaZqRTVTrS5w":{"text":"Great meal at Peche.  I have long been a fan of the Link Restaurants and Peche fits right ","useful":1,"cool":0},"S4lVjVhPVuDpfhfzeMGkSA":{"text":"Was there anything I didn't like? NOPE!\n\nWe tried Smoked tuna dip, Baked Drum (first time ","useful":0,"cool":0},"xJzk1B9qyN3RXW3o2TknOw":{"text":"Drum fish was amazing. Mushroom reduction sauce was some of the best I've ever had.  Servi","useful":0,"cool":0},"iNZt3s8FbVU7Wm5TvRCcNA":{"text":"This was probably my favorite meal in new orleans. I was at the convention center for a co","useful":1,"cool":0},"xzDJNZ6subqG9l8Lwo3qGg":{"text":"Great service staff and a management team that can handle the unexpected.  Way to step up ","useful":0,"cool":0},"UqDkDM56CK5Ch7t2SkY8qA":{"text":"What's with the raves? Our Peche experience was utterly ordinary. After a convivial evenin","useful":0,"cool":0},"fgN6JKswTbATMdcZNHmanw":{"text":"Amazing!! If you like grilled bone-in fish this is the place to be. Order the local red fi","useful":0,"cool":0},"H-oi7dRQBVGP7Wbhmozzdg":{"text":"A fabulous dinner!  Service was 4.5 star, but food was 5 star plus!  The crab claws, Bruss","useful":0,"cool":0},"lhv5a80wu7TXQAUX9AQ9LQ":{"text":"You hardly can call this a restaurant, this is a place that wants you to leave as soon as ","useful":0,"cool":0},"HyYzCwAlcOlULcnHmdJVqA":{"text":"Okay, so I've never had a whole fish before. I'm not sure why more restaurants don't offer","useful":1,"cool":1},"6BpEvAwaGYciz9w3SDz6CQ":{"text":"My friend and I ordered whole fish, raw oysters, and potatoes. \nRaw oysters were average, ","useful":0,"cool":0},"hOqzKIk3cDEi6chhxU1JaQ":{"text":"Such a great spot! We had the Whole Snapper with what seemed to be a chimichurri on top an","useful":0,"cool":0},"gyJQ-gdPFRx1kWQ2EaX14g":{"text":"One of my favorite seafood places in NOLA. Recently just went for my cousins birthday and ","useful":1,"cool":0},"ZK5eenE8bOc0AZKsZXSzbg":{"text":"Our reservation was at 6:30 and we arrived at 6pm and had a drink. Our table was ready bef","useful":0,"cool":0},"-3YuqWPVD31OsX07v5nLBA":{"text":"Amazing wine list!  Wonderful food! Great atmosphere!  So impressive!  We had the oysters,","useful":0,"cool":0},"qNoj3h4cPhpCToEblj6Xmw":{"text":"A stressful day ended with of course a wonderful meal  last night..the tar-tar being all t","useful":0,"cool":0},"3rYGmnkNfAeom4uETAbzqQ":{"text":"My friend and I stopped in for an impromptu lunch at the bar. DELICIOUS! Started with a gr","useful":0,"cool":0},"QU5M4bMMyWWhHrPQtgX5fw":{"text":"Friendly and attentive service. Delicious and fresh raw oysters. We also ordered the baked","useful":0,"cool":0},"yLmu10BJcPjkOooJIbv7Sw":{"text":"Best oysters in NOLA.  Great wine by glass and beer list.  Steak tartare and spicy ground ","useful":0,"cool":0},"E31PefLSKh-5YvXj12ZwRw":{"text":"For food and service I give Peche 5 stars. I found the interior and atmosphere to be sever","useful":0,"cool":0},"YNT5YKD8ggri0MRXVFlyvA":{"text":"Food was soooo good. Heard about their whole fish entrees, but couldn't try it for lunch. ","useful":0,"cool":0},"h7YYvHO9TWcm-iRo9OcHaA":{"text":"My wife and I were in town for business and she found this gem.  We did not have a reserva","useful":0,"cool":0},"8qlbt18aElJqdnokdI-A1A":{"text":"My wife and I chose this for our anniversary dinner. So we had high expectations. Unfortun","useful":0,"cool":0},"jndf05-GBERK2uXzADacjQ":{"text":"I went to Peche this week for a friend's birthday, and everything was terrific.  The roast","useful":1,"cool":0},"xfrZIfeSpuJ0nsgjgt9UHQ":{"text":"Best meal I had in New Orleans...and that's saying something for a city with AWESOME food.","useful":1,"cool":0},"5XYUdab9cIAlzy0PYE4Nsw":{"text":"The food at this place was excellent. It's a bit pricey, but you get what you pay for. The","useful":1,"cool":0},"tWSGyudf4DDTQUHe2QV-zw":{"text":"I have been here a couple of times, and wasn't too impressed.  Apparently I was just order","useful":0,"cool":0},"zJ7s4-4izRItszPJGyjJ5Q":{"text":"Stopped at the raw bar for lunch. I had a sampling of three types of raw oysters along​ wi","useful":0,"cool":0},"KsXsOb7ojSH_V-Zd__XSIA":{"text":"The food is good, at times very good (3.5 star), but the waiter we had was so clueless tha","useful":0,"cool":0},"3bfRSzH5kt3iA2mYxBp4Kw":{"text":"As fresh as it comes. There are seafood restaurants New Orleans style - where everything i","useful":0,"cool":0},"_vHmWGeu_yuVTRp-WRJ1NA":{"text":"We had a 9pm reservation. Food took over a 1.5hr to arrive. I live in Chicago and have bee","useful":0,"cool":0},"FQi7AilN4IoUW5QKsY3LIA":{"text":"A generous 3 stars. Why? Well, the good- superb oysters, the best I've ever had. I'll forg","useful":0,"cool":0},"J8i0zOhWXfEsXHR7oztX7g":{"text":"This place was highly recommended to us from a local bartender. I ordered the grilled skir","useful":0,"cool":0},"Q2fwqke6im1axu2K-k097g":{"text":"We had a fabulous lunch here last month.  Peche has great service and great food.  We had ","useful":0,"cool":0},"ZAGtsU9IUF9Hp2CaAE4CJA":{"text":"I've only eaten here one time but everything was fantastic!  Although they were very busy,","useful":0,"cool":0},"elJMwpk2J7hrbv9ipG8Gng":{"text":"Peche must be one of the greatest restaurants I ever been to. Everything by Donald Link is","useful":0,"cool":0},"ZZKyZ_QaTm1ojqHVsFGE8A":{"text":"A great find in the warehouse district area of New Orleans. Oysters were great, our server","useful":2,"cool":1},"mLzs5w93LtLlSXNg-HkgAA":{"text":"Excellent food.  Oysters really fresh.  Service attentive and friendly.  The crawfish cape","useful":0,"cool":0},"H5BRmvHxjV_0trB6bO3PBg":{"text":"Dining room way too loud; to many people per square foot. Profit margin maximized ambience","useful":2,"cool":0},"RlDgsF0F9fs_WdNBp1vPmg":{"text":"My favorite New Orleans restaurant.  Fresh clean innovated","useful":0,"cool":0},"tZ-8fUqxxk54FWg7khxmOw":{"text":"Outstanding seafood, excellent environment, and a fun take on local specialties, Peche has","useful":0,"cool":0},"fxQZrQTuxn0eR8scwBMWyQ":{"text":"Really enjoyed this place! I know it was probably odd for me to stop here as I'm not a big","useful":0,"cool":0},"U0sRqCpCeLEJQmVLQpmY-A":{"text":"We had heard rave reviews about Peche and made it our nice dinner out while visiting NOLA.","useful":0,"cool":0},"6VvIAwHmb5qKlUyAF9j06w":{"text":"Talk about Southern Hospitality!  Heather was our server on a Wednesday evening and she wa","useful":1,"cool":2},"AtK9ip78lixtIBu70RTp3A":{"text":"The small plates for lunch is the way to go. Every dish was unique, full of flavor, origin","useful":0,"cool":0},"dFyrOYRWSa2xaTzTfIDO-Q":{"text":"We loved it. We literally tried everything. This was the biggest lunch I've ever had. Star","useful":0,"cool":0},"6Wf3rsqTkZoSRC8AkzAoSw":{"text":"Oh man that smothered catfish was incredible.  I'm not a huge seafood fan but of course if","useful":1,"cool":0},"FNtpJgkgJUkAEUmCWWMslA":{"text":"On my recent business trip to New Orleans I discovered this terrific neighborhood spot in ","useful":0,"cool":0},"g5c_EEMw7TNVpYRsNN8NWQ":{"text":"Top notch food\nThe potatoes were great- crispy outside and soft inside with a nice sauce.","useful":0,"cool":0},"_p2Bycohl_bmiKjrKDCNxA":{"text":"Perfection from start to finish. Impeccable service, every dish was thoughtful and fun, th","useful":0,"cool":0},"2KDyDKy4qGa2asUf341PfA":{"text":"Great food, exceptional service. Waitress was friendly, helpful with recommendations and s","useful":0,"cool":0},"c_UVgLBFnuwCtyvm576I4w":{"text":"amazing dinner and Heather was outstanding.  Her suggestions were spot on with steak tarta","useful":0,"cool":0},"Bfnk8lQbTsPqN9oc-JOfIQ":{"text":"If you believe in heaven, they absolutely serve the curried mussels there! These were the ","useful":0,"cool":0},"1StFWaDMQio1TIFxG_x9-g":{"text":"Really like the ambience. We got the whole red drum fish and it was great but the rest of ","useful":0,"cool":0},"2ETt_mgZw3-WYLbJTjGYfg":{"text":"This place was packed with a 90-minute wait on a Monday night. We must have had good karma","useful":0,"cool":0},"dytVlV-dtAojF-0anpjFNg":{"text":"Perfect. \n\nOther than the fact that it is so unbelievably good that you wont be able to ge","useful":3,"cool":4},"HbLGmhANYg7cGHKfOY0LIw":{"text":"I wish I could give them -stars. The food is good but not worth the horrible service! Save","useful":7,"cool":0},"wsbCZ16ALGg6vPGttSbNCg":{"text":"I very rarely write yelp reviews unless I'm particularly moved in either a positive or neg","useful":0,"cool":0},"oHqjbLXlOTFAJolZHt9v7Q":{"text":"We went to Peche twice this week to enjoy some local food while in New Orleans. The food r","useful":0,"cool":0},"dEBQKkDaDz1ot6YT1MsnFw":{"text":"Nom nom. Their raw bar is seriously amazing. Great spot to go in New Orleans. Worth the pr","useful":0,"cool":0},"ZMN5ULUXvG8HmQIYqAAnxw":{"text":"Wonderful sitting at their oyster bar. Fun shuckers to talk with. Oysters and service were","useful":1,"cool":0},"qnsa5YkvNpJpg0xttcwZjQ":{"text":"Absolutely excellent service and wonderful food! A must go in New Orleans!!!  We sat at th","useful":0,"cool":0},"tPN-6D66vwM90wVyC1s5uQ":{"text":"Amazing seafood restaurant. Baked drum and craw claws are both one to try. Service was gre","useful":0,"cool":0},"HDv330B9RzMjnIvKgrDJoQ":{"text":"I'm originally from the west coast, so I've had (what I thought was) good seafood before, ","useful":1,"cool":0},"PZ3twalUbTZwJ9B0GdSZKA":{"text":"Please don't overlook. Don't be fooled by the menu, I was at first reluctant after seeing ","useful":1,"cool":0},"YKUw2-vt8KcbTltvXzrD4Q":{"text":"Just had a great dinner here. Very nice, fun space. Service was great.  Food was excellent","useful":0,"cool":0},"n9ngcHQ4xsnEYGlwKQvAvQ":{"text":"This place is really, really good. Scratch that- GREAT! The food is awesome and lacks the ","useful":0,"cool":0},"sumCWoDypWJOZNHJNQ7PtA":{"text":"A good sign that a restaurant is basically amazing is when I leave already planning my nex","useful":3,"cool":2},"f4F7UCh5otnvQ2ZkMkxsEA":{"text":"Our new favorite fish house. So fresh and creative!!! Loved the Redfish with salsa verde! ","useful":1,"cool":0},"xfM7jeJDkzUv-no0RLtBRQ":{"text":"My wife and I came to New Orleans for our honeymoon. We had already eaten lunch earlier in","useful":1,"cool":0},"wJEXt3OlWcTb5gxAJN-sZQ":{"text":"Excellent experience.  Bartender created a drink especially for us.  All appetizers were e","useful":0,"cool":0},"IRGL4KnEo9z-RWy7X6oAvw":{"text":"Little noisy but another good selection from Chief Donald Link. The redfish is something s","useful":0,"cool":0},"M5bWPyULwFws5U4vSj3DIQ":{"text":"Pêche was absolutely amazing! We couldn't get a reservation until 10 but they told us we c","useful":1,"cool":0},"m4Z3iXYlE02E1Q9UAtfIcg":{"text":"This is one of my favorites and I visit at least once or twice a month or fear going into ","useful":0,"cool":0},"szLf9ziYSflUsMzaOHrq9g":{"text":"I love Peche! Every time I leave I day dream about going back. The atmosphere is fun and i","useful":3,"cool":0},"5ZV-_OBLk7Yie_ysSR3QgQ":{"text":"Amazing food and service!!! The seafood platter was so delicious. The oysters were delicio","useful":0,"cool":0},"aLPRrzAX_7_kowjz1NtO7g":{"text":"This place is great! Food and service were top notch, as was the atmosphere/decor when we ","useful":0,"cool":0},"9rZFVCe0mrq5kPjr87PvkA":{"text":"We dropped in here just for oysters, drinks and dessert.\n\nSeriously, these were the BEST o","useful":1,"cool":1},"PNshi5IdnEwIkTl5S7ry3g":{"text":"Yum!  The place was packed on a Tuesday.  We ate at the bar and the bartender knew his men","useful":0,"cool":0},"KOxw5vxpqKzvK_9aFMXxgg":{"text":"Was in town for Essence Festival over the 4th of July Holiday, and this was the last place","useful":0,"cool":0},"1p520k4_ynMkaP-uJrtzEw":{"text":"This place was probably the best quality seafood that we had in New Orleans. The fish was ","useful":1,"cool":0},"QilxbIBRiYjTScBEabzz-Q":{"text":"Loved it. Cool bar setup and that's where I had dinner. Great food. Great and helpful staf","useful":0,"cool":0},"NcJznpKLpz2NDqnoztT1Bw":{"text":"This place makes me sad... that there isn't more room in my stomach. I never even made it ","useful":0,"cool":0},"vBKadQEgzuX2UhUDsFzxyw":{"text":"This is an excellent restaurant. The service was top notched and the food was extremely we","useful":0,"cool":0},"KJTHnapXfFxWLXD-ab6haA":{"text":"Excellent food and ambiance. \nSmoked tuna dip - excellent\nDuck pappardelle - exquisite\nGri","useful":0,"cool":1},"3qy7gkKrs4hOJJvNhw4k4Q":{"text":"An absolutely spectacular dining experience  accompanied by consummate service. Shared a b","useful":0,"cool":0},"woUnYe3Gw1hXoWM5Asswrg":{"text":"My husband and I have been here twice now when visiting New Orleans, the first time was be","useful":0,"cool":0},"zABip_AtfdRuC9yL-h2htg":{"text":"Beautiful, clean, bright dishes! Stopped by because it is right next to the WWII museum on","useful":1,"cool":0},"HmYmHqy6UHPV0jPgC7znWg":{"text":"I was in Nola on business and found this restaurant. I was blown away! The atmosphere was ","useful":0,"cool":0},"NU2nu_-vC0pJd-fH5wzwyg":{"text":"Let me preface this by saying I went to Peche Tuesday evening with four other diners.  For","useful":1,"cool":0},"PizhORSLc40xx_wIeP2jWg":{"text":"Thank you Peche. Most of my meals in NOLA were a bit underwhelming- it seems that many res","useful":0,"cool":0},"hwhnU47julAYzXN_c7C6Fw":{"text":"well, we finally ended at peche, no reservation, no problem, wasn t full, it s january,  i","useful":0,"cool":0},"2EqbqmNr1nWDX_WodXA5IQ":{"text":"This was the first dinner me and my friend had on our first night in NOLA and we had a fan","useful":0,"cool":0},"ZNZwpw8FUQ97EPVvUgQcTg":{"text":"I'm shocked this place has only 4 stars.  It's a definite 5!!!\n \nThe place is super chill,","useful":0,"cool":0},"QMT4x41hh2hMzykwSuczJQ":{"text":"Absolutely fantastic.\n\nWe had the oysters, fish spread and smothered catfish! We will be b","useful":0,"cool":0},"Q5MMSPIu8MtJerhU3iK6HA":{"text":"Down from CT had an awesome dinner.  \nDef recommend this spot.  \n\nOysters were excellent!!","useful":0,"cool":0},"XwgEQyZtUHpiwz0EnYRPbQ":{"text":"Delicious. We visited early on a Tuesday evening. I emailed in the late morning to try to ","useful":2,"cool":1},"GTYG5mv6VbfqZCnK8LuOpQ":{"text":"What a wonderful dinner at Peche. Our server was very helpful in offering suggestions for ","useful":0,"cool":0},"bV9HLB6OTp9esYSFwrqg_w":{"text":"Food and drink were perfect. Curried mussels and marinated beets are excellent. I encourag","useful":0,"cool":0},"YMJhLbsQtL5s5F2uLxnExw":{"text":"Reservations at 930pm and got seated at 10pm. Well worth the wait.  GM gave us a round of ","useful":0,"cool":0},"JkO8hXVFjDXOgwFk8AO_nA":{"text":"We tried this place opening night, as well, and were most favorably impressed. The chefs a","useful":3,"cool":1},"pXpQGBknROxUkBG1e2imlg":{"text":"I sent this email to the management at Peche after a recent visit, and never got a respons","useful":0,"cool":0},"L23BZqQdxXOmMzbYZ4hfAA":{"text":"Fantastic service from a waitress who bears an uncanny resemblance to Amy Poehler, in look","useful":0,"cool":0},"lMQn5NvTOEvkrmnC-GYRwQ":{"text":"Good restaurant but a little overated and its hot spot now.\n\nRun down on meal.  Had the ra","useful":0,"cool":0},"zhCDDqSE7g8PUSo6uMSZEA":{"text":"We sat at the oyster bar in the back of the restaurant, which I personally thought was the","useful":1,"cool":0},"cBrlRvdZINaMzQGhTImh5w":{"text":"We tried Peche for lunch on its third day in business. It was one of the best meals I've e","useful":1,"cool":0},"n_Rbr6ObDOsy0pOUVjCtJw":{"text":"This is one of my favorite restaurants in New Orleans. Boyfriend and I had the grilled fis","useful":0,"cool":0},"e849utgvYcV9jXjoLorJnA":{"text":"Excellent vibe, service and absolutely vibrant and fresh raw bar choices. Highly recommend","useful":0,"cool":0},"jJGbBrkUwqEeCd3xHpVfOg":{"text":"This place was packed, and for good reason.  The large menu seemed to have just about anyt","useful":1,"cool":0},"kVHJGUPImQOKVCa3vQFfVw":{"text":"I am turning ten in June, and I came to New Orleans for jazz fest for my early birthday pr","useful":0,"cool":0},"li14Y1k29znfNxX-vFwfSg":{"text":"yeah baby.... just go eat there!!!","useful":0,"cool":0},"RVyO-bTJj2o2WId57lHtGA":{"text":"First: the people who are writing bad enough reviews about this place giving it 3.5 stars ","useful":4,"cool":1},"N_Qmg9bfvznCXsd4lRPd7Q":{"text":"We stopped in her for brunch last Sunday. The cocktails are amazing and perfectly seasoned","useful":1,"cool":1},"3ZGivdq2ghY7a4AcUU8zIg":{"text":"Amazing amazing amazing food!! Wow! If I ever went to Louisiana it would be for this resta","useful":0,"cool":0},"qGsZoySpHC8YW92S3ve8SQ":{"text":"Most of the food was fantastic. (I didn't love the shrimp toast. Thought it was a little c","useful":0,"cool":0},"HyE6U7Ub8LPItUy9gEEKFg":{"text":"Had a reservation for the Saturday after the 4th. It was super packed and very noisy. All ","useful":0,"cool":1},"rOBCOqz4ACKU8yy-aCgLXw":{"text":"This was our first time coming here on a girls weekend.  We pretty much ordered a buffet f","useful":1,"cool":0},"D7BnMfBHlTC3FXbmVUYcCQ":{"text":"Peche was awesome! We went for dinner for my birthday with my Dad and we had a great exper","useful":0,"cool":0},"pUA-lPR0RaJ8bOYk-AtMCQ":{"text":"Energetic, loud, fun, and great food. Oysters are so fresh and the cocktails are strong.","useful":0,"cool":0},"ic0HljqGceAv2PUx-ywdag":{"text":"Best place to eat in New Orleans one of my friends recommended me this place and it was th","useful":1,"cool":0},"4k0lP_fkqnkHaak53Z8W9g":{"text":"The place is very beautiful but  I had higher expectations. The food was flavorless. Prese","useful":0,"cool":0},"vYRJpUzezSCFSEToxt1FuA":{"text":"I think i'm moving to NewOrleans just becos i'm in love w GUMBO \n..OMG - Seafood Gumbo ric","useful":0,"cool":0},"Bzr1JxwoiqNcNR7tt4GI7Q":{"text":"My husband got the smothered catfish and it was amazing. Our friend got the shrimp and tha","useful":0,"cool":0},"CBHfAnQXuOvw6NAnzesdkA":{"text":"We had one of our best meals here during our visit to New Orleans with our daughter. The o","useful":0,"cool":0},"vANdtwyDZKqZ43efko9hpA":{"text":"Went there for my friends bachelor party dinner. Food was cold and the staff was rude to u","useful":0,"cool":0},"EC2sOGwY2TyW1VsNTb2QnQ":{"text":"Mr. Link has done it again!  The decor is Southern chic.  Nice big bar that's well attende","useful":10,"cool":8},"9OhwPIfQdmLSWtNNuT5Bfg":{"text":"Great atmosphere with even better food. My personal favorite is the catfish. Don't forget ","useful":0,"cool":0},"vJx6NMuue8iv8PaiVzVeRA":{"text":"The food is fresh and delicious. Everytime I visit NOLA, I make sure I make a visit to Pec","useful":0,"cool":0},"Kpf5EG9KOP50U7Y4vlnwXg":{"text":"Don't miss this place if you are visiting The Big Easy...Fresh seafood...Shrimp Capellini ","useful":0,"cool":0},"cZ0TWG44i8V9Npe115Ym0Q":{"text":"First night in NO, came on the recommendation of a friend.  Arrived and greeted warmly.  D","useful":0,"cool":0},"_o3_ATbfsuwLnIq5I2pFFQ":{"text":"Very nice restaurant, the menu is wonderful, with something for every taste and appetite, ","useful":0,"cool":0},"ToS_GU8NZD_CRQNKwD7_DQ":{"text":"Great food great atmosphere very nicely designed and clean will be back to explore,  parki","useful":0,"cool":0},"ZqWWSw7ZyIJGyybzxQvp3g":{"text":"Had lunch here with family. Great open atmosphere. Seafood was very fresh. Really loved th","useful":0,"cool":0},"_Tc5wDjG4lbRFTgxUdWBxg":{"text":"By far, some of the best key lime pie I have ever had - not too sweet, not too tart, just ","useful":0,"cool":0},"p5EgeDf-eltpMkH34Wck9w":{"text":"Heather and Alex are an awesome team. Ask for them!  Food is fresh and contemporary. Great","useful":0,"cool":0},"gpQtc12Mep_zLHpqbcZDWg":{"text":"We were a party of four, and some of our food was excellent, but the service was disappoin","useful":0,"cool":0},"HhA1wPBofvsRjCvn1LVJxA":{"text":"My friends and I stopped by for a light lunch, and it was pretty good. \n\n- Snapper w/ coco","useful":1,"cool":0},"cMEPHpT4z3DMPPAjp888mg":{"text":"Delicious food!  Had the shrimp roll!  Cocktails were delicious too! The atmosphere was vi","useful":0,"cool":0},"W0cz3LNc1vVgU6X66NGk1Q":{"text":"How do I begin? Let's just say I never leave unsatisfied and I'm always wanting to bring p","useful":1,"cool":1},"lK2PgHg1qnU_NNaSsjtJKw":{"text":"Peche is a MUST if you're traveling to New Orleans or if you live there. I was traveling t","useful":0,"cool":0},"VRitlKoPn4hl7qMF5yMERw":{"text":"What an amazing joint. Great staff upon entering without a reservation! After squeezing in","useful":0,"cool":0},"x7d3HlhWMiivJPUTpSXNVw":{"text":"The only complaint I have for this place is that they refused to split our bill. We came h","useful":1,"cool":1},"e5znc1HtIGQ_qrMB8rFL2w":{"text":"After seeing their James Bears award, I was pretty excited to try Peche. However, upon arr","useful":0,"cool":0},"-tOrKYrZ9QKLsH3VOLMrWA":{"text":"let me just say that I dined there on Monday evening and I was back for a quick lunch befo","useful":0,"cool":0},"VUomKUJtoUF-bmmUg3-ZCg":{"text":"Awesome food. Chicken was great . Ate at the bar and it was fun. The salad and veggies wer","useful":1,"cool":1},"Fnhg442Tb4pSkUrOWJrIhQ":{"text":"I don't want to start the review off on a negative note, so the following is more like jus","useful":0,"cool":0},"249SdogwVN-AU1E5fotIqw":{"text":"I want to love this place, but experience garners 3 stars. Definitely more of tourist attr","useful":2,"cool":0},"PoYf0Gh1PVsV2YAcUMe1bg":{"text":"Unbelievable. James Beard winner, but still comfortable and reasonable. We came for lunch ","useful":2,"cool":4},"JBoxzAb5C4-iWIx9taexbw":{"text":"Food is excellent but very slow coming out of the kitchen. \nParty of 3-shrimp toast, pickl","useful":0,"cool":0},"ZymqmSuuwXjqvrN6WrlzNg":{"text":"...makes me regret living in a landlocked state.  This was some of the best seafood I've e","useful":6,"cool":5},"duLulIp4vtDSNMbcvLAlYg":{"text":"In all honesty - I'm not a Foodie. I like good food but generally ''Meeh!\" to the whole sc","useful":1,"cool":0},"eaBGyLvTqk37wtWvkMuqvA":{"text":"Chicken Damon good. Flank steak amazing. Oysters awesome.  Tuna dip fantastic! Brussels ar","useful":1,"cool":1},"keDInrPYNLQyVGmxzLeuBQ":{"text":"I stopped in here for a quick meal and had the Shrimp Fontina Croquettes and   what turned","useful":0,"cool":0},"xv8nH4115c8cVX9Wkqz3hQ":{"text":"I would first like to say that service at a  raw bar for full menu can be tricky and in th","useful":0,"cool":0},"y87HTkU6M2DOWdZyv-qokg":{"text":"Best meal!!! Oysters were great. Tried three fish dishes: grilled cobia, baked drum and gr","useful":0,"cool":0},"ZXdeimdjF8TEb3UV-sxeFw":{"text":"This has to be one of my favorite places to eat in the entire city because every experienc","useful":2,"cool":0},"Qq0LJoeNivPwcC99mVTeWw":{"text":"The local dish with Drum is one of the best of the best fish dishes I've had in a long tim","useful":0,"cool":0},"G_RdMD34mmCGkRsYl7O5Mg":{"text":"Absolutely awesome. For a light lunch I ordered spicy Brussels sprouts and crab jalapeño c","useful":0,"cool":0},"RgXnF-n2KkVIbOH_DTsh1w":{"text":"Amazing food, friendly and helpful service, I would recommend this to anyone looking for a","useful":0,"cool":0},"_WaVIXgv-kzFhj4a3ZSnBg":{"text":"We got in 30 minutes before closing time on a recent Thursday night and had an amazing lig","useful":0,"cool":0},"sPp2tlHJHIiMSu_yg2ZENg":{"text":"Fantastic restaurant. Split the seafood platter & not disappointed other than I want more ","useful":2,"cool":2},"ExD6xqnV5FRi0rsuoEdYNQ":{"text":"Maybe this was an off night - or maybe 'twas a normal night. Whatever it was, tonight's ki","useful":0,"cool":1},"opVMHcTfAszlDJKCC6Pqpw":{"text":"Visiting NOLA for the first time, Peche was not on my radar. Thankfully, a local who works","useful":14,"cool":12},"1ILwgcAjjjSA8ubxEr6n8A":{"text":"I was thoroughly impressed with my experience this evening. Every bit of food was great fr","useful":0,"cool":1},"tMxrUG52csmB82ohD7W4qw":{"text":"Wow! The best meal we had in New Orleans. Service was exceptional, drinks were fantastic, ","useful":0,"cool":0},"CaYbhtHRA4NLaXNwzzGXDQ":{"text":"Great Place! I would love to try everything on the menu! Great seafood dishes and a nice c","useful":0,"cool":0},"QMXXdX8fuUx5TpNIO0ApBQ":{"text":"Fried Bread.  Nuff said!   Imagine Rhodes dinner rolls the size of a hush puppy that's dee","useful":2,"cool":1},"TMdWmdLyMiVeE_T_cQ1BSQ":{"text":"I ate like a mermaid for my birthday at Peche. I have wanted to go here since I saw them p","useful":13,"cool":10},"zsmvETdoep1Dz2FnvqYSRQ":{"text":"This is the best new seafood restaurant awarded via the James Beard awards for a reason.  ","useful":0,"cool":0},"lDbGa6m26qTdT2jHYerJxw":{"text":"The food was imagination and thought provoking. Freshly prepared and served by friendly an","useful":0,"cool":0},"thdA0_bZ1w4zkLueaS122Q":{"text":"I heard about the hype, first of all NEVER listen to people with money from out of state w","useful":1,"cool":0},"gC-GQygv_Ef9-p05r-4gBQ":{"text":"Made an unintentional quick pit stop here and I was not disappointed. Ordered some bubbly ","useful":0,"cool":0},"keKXABNGI25zLg1EI4HPdw":{"text":"Peche is a solid, quality restaurant. \n\n5 stars: the service. Very friendly and efficient.","useful":0,"cool":0},"WUODJSz1oEFfE-do4YmZLQ":{"text":"Just stopped for a lite lunch after touring the WWII Museum and the gumbo and seafood bisq","useful":1,"cool":1},"5xJV5r8ZE0Cn4y5csMu14w":{"text":"Fabulous food in a fresh rustic setting. Loved it and if I am back in town a definite must","useful":0,"cool":0},"5ICqrql3pX7VZZUjxxO1Rg":{"text":"Loved the idea of Peche - fresh seafood, raw bar, location and interior design all suggest","useful":0,"cool":0},"Ya1eQUE9n5t-9zbn9PXpJA":{"text":"We found this hide out from a friend, and what a great recommendation. The vibe was alive ","useful":2,"cool":1},"6odep3tEIvnWaDOVQPvYmA":{"text":"Great appetizers and the entree was fantastic.  We had to have desert (although we normall","useful":0,"cool":0},"WjbeDp1hmZzsCcvkr6I9bw":{"text":"First time visitor to NOLA, wanted something away from the tourist traps. Made it for a Tu","useful":0,"cool":0},"zsXLQMAncI4ZLCN1_r4n0w":{"text":"This place is phenomenal!  I have an allergy to celery and the chef uses celery in their s","useful":0,"cool":0},"JpYkhZMqnPww00sm8h0QUQ":{"text":"Came to Peche on a Wednesday night with reservations for 9. 45 minutes later we still were","useful":1,"cool":0},"VC7-MuTZo518s14N-OpslQ":{"text":"We had dinner Thursday night with our little girl. The served her great food and she ate e","useful":0,"cool":1},"lSJBpRw9k8PBo5pcUSQyFg":{"text":"This place is exceptional.  Great customer service, fresh and unique take on gulf seafood ","useful":0,"cool":0},"wc2FTQkni3xe9c6oiH1jtw":{"text":"Love the rustic farmhouse feel  and the food was outstanding! Brussel sprouts, hush puppie","useful":0,"cool":0},"k8p-Jgwt4xVVfyrr27suJA":{"text":"Nothing negative to say about this one! It was fabulous - didn't even mind waiting a littl","useful":0,"cool":0},"Nr-ssPN1wIu39R2-Lik03g":{"text":"Went here first night in N.O. was great time. We got the seafood platter appetizer,  crab ","useful":0,"cool":0},"lGgmx_VJ-tKe87zjn1aB4w":{"text":"Was excited to eat here, however my excitement faded away. The menu was a bit lighter than","useful":0,"cool":0},"PsDOHKssVEqF4DiEiF3rgg":{"text":"One of my all time favorite meals. Oysters, fried bread, shrimp toast dipped in gumbo and ","useful":0,"cool":0},"OQ7mkt_qNuhT57iQNfJpMQ":{"text":"This is arguably my favorite restaurant I've visited in New Orleans. Gorgeous space that h","useful":1,"cool":1},"Hx-a-OhIyGZKW12XsPtHeQ":{"text":"Service Review\n- Came by on a Thursday night and asked for a table for 2. Hostess said it ","useful":0,"cool":0},"WEjGHQP4sePrMrKmc4mmww":{"text":"Ate at the bar and had smoked tuna and Mahi. Wow!  Comfortable environment and the food an","useful":0,"cool":0},"CwK5npplEEz8mVSCQvAIKg":{"text":"Food is outstanding. The service is as well. Two visits. Great drink/wine pairings and des","useful":0,"cool":0},"qvsgbc18JqQu9YmVnykhlg":{"text":"Best meal I've had in New Orleans. I had seafood gumbo and a half dozen oysters and all of","useful":0,"cool":0},"vCHb2-nCtz6FKKYj7QaXOw":{"text":"Ok Peche, your shrimp roll was beyond amazing, but I'm giving the low stars for this reaso","useful":0,"cool":0},"Pz1FGPK4Ta3oesyH-VG52g":{"text":"The food, atmosphere and location was very good. They need to improve on the NOISE level.\n","useful":0,"cool":0},"R3-SfEV25j1ywSG0PkJIrQ":{"text":"Absolutley incredible. We had the whole red fish, brussel sprouts, cauliflower gratin and ","useful":0,"cool":0},"g_UXn6UPnmo1Sj72ZolReg":{"text":"Delicious impeccable meal. The scratch kitchen and creativity shined. Our favorite meal of","useful":0,"cool":0},"Yysq7gOrZvoUB4IOP_asDQ":{"text":"Excellent spot. Friendly staff, bartender makes proper martinis, knowledgeable and accommo","useful":0,"cool":0},"ZWDNBOEF4WWOUg7W1E9BSg":{"text":"Great food, terrible service, noisy space.  It took almost a half hour for raw oysters to ","useful":0,"cool":0},"svmmhCOgO8iwgtYxrnfFFw":{"text":"Monkey bread dessert is phenomenal\nSkip the grilled tuna, fish sticks, Brussels sprouts, p","useful":0,"cool":0},"RsZyewvEJKp1pjUiRvMs8w":{"text":"My husband and I went here for a late lunch after spending a few hours at the WWII museum.","useful":0,"cool":0},"KVXJeUbXaEoEGWxZLyo74Q":{"text":"The food is phenomenal. The service is alright. Our sever seemed super annoyed the entire ","useful":1,"cool":0},"oHuNXYh8KzRe_PXUsV8mbw":{"text":"I heard this restaurant was good and won awards so I just had to try it for myself. Wow! E","useful":0,"cool":0},"gKuLgAb0wBCwk6xbIIeulw":{"text":"Best seafood we have had in the south. Will come to this place again whenever in the area.","useful":0,"cool":0},"JVXFoyoLRYhWKjO8BpXRcg":{"text":"Really enjoyed this place for dinner! Everything we ordered, food and drink, was excellent","useful":0,"cool":0},"amckQ0b--eh-Lx98EEaxBg":{"text":"I had dinner here the night of the Kentucky Derby so the ambience couldn't have been bette","useful":0,"cool":0},"FavU5cieXLreByjqfQIdBw":{"text":"This place is a must in New Orleans. I haven't been here before (actually I haven't been i","useful":0,"cool":0},"M-roGqmxwZP5d2cPynbxLg":{"text":"Unimpressed.  I did enjoy the cocktails but the food was mediocre.  Catfish dinner was ver","useful":1,"cool":0},"Ij7bcK0x8ceCZ4sThdr3Kw":{"text":"The food sounded good on the menu but was so bland we forgot we were in New Orleans. No sp","useful":0,"cool":0},"ECBP9xBCURHyAgpz8QTTrg":{"text":"Julia street is a great place to go to get a break from the French Quarter.  Even better, ","useful":0,"cool":0},"qEroWfraI4akhA6CQzRvHw":{"text":"In town and stopped here for lunch after the WWII museum.  Awesome food and service.  The ","useful":0,"cool":0},"gmZ6Q9cdfEZg8yg7l5Pr5g":{"text":"Just outstanding.  6 of us visiting from Houston.  Reso at 6. Jonathan was our waiter; rea","useful":0,"cool":0},"2hbKUpyVw60Czn-GeL4gtg":{"text":"Excellent food, service, staff in a modern, comfortable atmosphere.  Try the smoked tuna d","useful":1,"cool":1},"WKM3F05IRs2_-Xw8ShPU_w":{"text":"Fantastic food from appetizers to entrees to dessert. The restaurant decor is great and th","useful":0,"cool":0},"UH4tniR4dL0nlBplJKMhAw":{"text":"Located in the Warehouse District, Peche serves excellent coastal seafood with a modern ap","useful":0,"cool":0},"dmodxvOILeHQwSKUlDgmgA":{"text":"Chef Link hits another home run with this one.  We had cocktails, raw oysters, and the cev","useful":0,"cool":0},"rA8feTQ6FqsvaM52Jz9K_w":{"text":"Wonderful service. Cool location. Smoked tuna dip was fantastic. I had the Shrimp Roll. It","useful":0,"cool":0},"zOKy7HIMefgujzGZ9HWweA":{"text":"Came here with my real estate agent to celebrate putting an offer on a house.  Nice enviro","useful":1,"cool":1},"CxFlck_FTDeTq6-Fn9YoQA":{"text":"How can a restaurant have such great food and such horrible service? Best grilled Fish I e","useful":0,"cool":0},"W0cFWSx2PhCO-A9sAe5T1w":{"text":"New Orleans. How much I love you..... the culture, the cocktails, the food!!!! But, I have","useful":0,"cool":3},"0XeW0MGbKSTcR2uFPRhhaA":{"text":"One week after visiting NOLA, and I am dreaming of my two dinners I had at Peche. It was s","useful":0,"cool":0},"aI27xx30do6kkX0Q1I_HWQ":{"text":"The food was delicious, but the menu was very limited and they did not allow for any subst","useful":0,"cool":0},"aBH_-DyY2QRFeTuDvZXSRQ":{"text":"This is the best place for lunch and dinner. I have been there 4 times since we heard abou","useful":0,"cool":0},"sLjF3b7J9zMBnQ-bY33bKg":{"text":"I don't like throwing around terms like \"life-changing\" that often, but... Peche was prett","useful":3,"cool":3},"NkXAwpwGmLJUzQqU-206ug":{"text":"Loooooove this restaurant and especially our waitress, Heather! It was such a great dining","useful":0,"cool":0},"c9d8OvLQZuWl4ovv_z2drw":{"text":"Hands down my favorite spot in New Orleans. Every time I think I found my favorite dish I ","useful":0,"cool":0},"0ZExsrPdOj7Ylnmqm_EXdg":{"text":"Great good, but super poor service and the staff did their best to make us feel unwelcome ","useful":0,"cool":0},"SaMVudwAmRk59Erlx80ufA":{"text":"This place has serious problems with customer service. To start, the hostess was rude. She","useful":2,"cool":0},"tOqq-uGNeEeEW4aDl-36Eg":{"text":"The smoked tuna dip, the crawfish gratinee, and the shrimp roll were phenomenal. Tuna dip ","useful":1,"cool":0},"56F5ZzQSxLOHJZ_0ZziKKw":{"text":"If you're looking for seafood, this is the place. With a contemporary theme, and urban fee","useful":0,"cool":0},"H76BXw5n-ITVSaR0Yuqg2Q":{"text":"Great service, despite the fact that our table came late, excellent food & desert, & hones","useful":2,"cool":1},"jIK8U9Wl7E59J4voFB8WAg":{"text":"The food was ok, but the service was pretentious and unaccommodating. I would recommend go","useful":0,"cool":0},"fj3X5PbOQGgaC1RK1_CpYA":{"text":"Second time visiting New Orleans and this was a must visit on our list.  Came in for a lat","useful":0,"cool":0},"AGZVlN52wottJ0Y4x81FUw":{"text":"My first time here the food was only fair. This time it was much better but when I ordered","useful":0,"cool":0},"7Ux8Mu5Jda5K8R29Hrt4og":{"text":"Went here Friday for lunch with my Dad.  Bit of a line to get seated we decided to sit at ","useful":4,"cool":5},"aIvj8GM5cI8vC0HMQ6U0rg":{"text":"Some of the best oysters and shrimp I have had are here at Pêche. The atmosphere is clean ","useful":0,"cool":0},"C2M4ZiwT9x4d_XphqQ_sUQ":{"text":"I happened to lunch at this restaurant yesterday and it was the best meal I've had in ages","useful":0,"cool":0},"Cyft8_5xyqKfRmH9hS8g0g":{"text":"So delicious and in such a beautiful space. We shared the gumbo, fried bread, and jumbo pr","useful":0,"cool":0},"ArU3F6ZXOnOlUxvRYnUSIQ":{"text":"2 stars for delicious, creative menu and attentive waitstaff. HOWEVER, zeroes because of r","useful":1,"cool":0},"JtEFzeFjf4EnGppIWlCRCA":{"text":"I was so excited to eat at this place. We arrived without reservations and got to sit imme","useful":0,"cool":1},"jUjFb83lz8b37p-SHVVzfg":{"text":"We started with great raw oysters. Louisiana greats!  The small imported overpriced ones: ","useful":0,"cool":0},"LourlVMlTXzsyHullhue2Q":{"text":"The decor was gorgeous, the ceviche was phenomenal and the best I have ever had.  Wine sel","useful":0,"cool":0},"zHmQhTgG1WDWO4-7pQBnRw":{"text":"While New Orleans is famous for its seafood most places focus on oysters or fried fish.  P","useful":0,"cool":0},"TZoc99tIdz5IFSg7ax3LCQ":{"text":"This could be five stars but the incessant, uptempo beat pounding in the background at the","useful":0,"cool":0},"abqGRj2hApeA65Hlhak6AA":{"text":"Having been to Peche twice in the first 2 weeks after opening, and a couple times since th","useful":3,"cool":1},"BeWpsBk7Qq_AbMFC-HB26A":{"text":"We went with a large group and everyone thoroughly enjoyed their meal.  We arrived ahead o","useful":1,"cool":1},"F_Zhw8Ciux7y2Sn27o5gMA":{"text":"Specialty drinks - awesome\nWine list - great\nFood - awesome\nService - perfect\n\nI will be b","useful":0,"cool":0},"UVM64UdmyGBbm69aOE8fag":{"text":"I have lived and still work in the area and am very familiar with all of Link's places. I'","useful":3,"cool":0},"w5u4cnnwOXmfRR-0dVKK0w":{"text":"Steak Tartare!! Seriously I could eat this everyday! I love majority of their small plate ","useful":0,"cool":0},"tYPYy5oTwlF2LM95ptTuFA":{"text":"I thoroughly enjoyed our group's lunch at Peche.  I went with friends who had gone before ","useful":2,"cool":0},"hPzFVeKf_GPydQkcJnomfg":{"text":"Waiter recommended all of our items and they were fantastic. It was very crowded, so reser","useful":0,"cool":0},"lziZmRMRfLB3Jf-VyTGyWg":{"text":"A trendy place in the warehouse district w really cool decor.  I like the set up and you c","useful":0,"cool":0},"352RD5WWNIMFXdCDwWpcQQ":{"text":"Drum, smoked tuna, steak tartar were deelish!  DO NOT pass up the hush puppies!  Magic cak","useful":2,"cool":2},"N0OyrAUnWArfowHL3G4A9w":{"text":"A recommendation from the concierge at Marriott - great choice! It was a good thing we mad","useful":1,"cool":0},"GrEIEiSl3WRzsup0E1lDjg":{"text":"We were walking back to our Hotel from the World War II Museum and decided to stop for som","useful":0,"cool":0},"v5JbJm-ype3X6P66bqsrtw":{"text":"Great atmosphere/decor but extremely loud! Service was okay, waitress was not that attenti","useful":0,"cool":0},"ntlFslQksmiNRn_rjq84Gw":{"text":"I would eat here every week if I could! We ordered everything from the smothered catfish, ","useful":0,"cool":0},"IRTbOfFcEK_WmA0BLa0G7Q":{"text":"Off the regular haunts this place is amazing. We had crab claws - fantastic. Fried bread -","useful":1,"cool":0},"-_VeTJliJE02MH5w4k93VQ":{"text":"My first day writing reviews and I started with a bad one, now I want to write a good one.","useful":0,"cool":0},"Ll9asnOn6nkOf8yQSVlE6Q":{"text":"The food here was absolutely delicious. Although the service was a little slow in getting ","useful":0,"cool":0},"D0ZjuphKkXwDW6EkCuoCcQ":{"text":"Best meal of life. Hands down. Get the drum fish. And get the crab cucumber salad. You'll ","useful":0,"cool":0},"83yJT2fIHpytLeNE5yZBrw":{"text":"I had one of the most enjoyable dining experiences at Peche when I was recently in New Orl","useful":2,"cool":0},"Vw1wvZdxvlyYkmAO1Ldvrw":{"text":"Great great great food\n\nA local brought us to this place when we were in town for a few da","useful":0,"cool":0},"J18xGfkb3KRWD2eaobeO_w":{"text":"Amazing food, attentive service & great atmosphere! We came as a party of 3 for lunch & lo","useful":0,"cool":0},"F9Ups_iLcAbYwVdaQyZuOA":{"text":"I had the ground shrimp and noodles and cleaned my plate! The  flavors are middle eastern ","useful":0,"cool":0},"DkeJTP-ZdIE3t_V0x6t9hA":{"text":"We popped in and sat at the bar to share a slice of key lime pie; it was served with a but","useful":1,"cool":0},"6VfcSYWiNMnISU0iYIr0EA":{"text":"Never had a chance to taste any food but will never come back.Why? Sitting at the bar we o","useful":0,"cool":0},"Yc48gwuDUAM4guuI8OFrIg":{"text":"Dinner with 4 friends. Gumbo was excellent, but fish sticks were awful. Servers could have","useful":1,"cool":0},"RlAwnskOID5b5vr98Biw7w":{"text":"TL:DR Summary: Good seafood, great raw bar.\n\nWe went here for our engagement dinner. Food ","useful":0,"cool":0},"ciVNGbY8baaIVuyOlFZdFA":{"text":"The food and the service were divine. My friend and I had a very memorable time and deligh","useful":0,"cool":0},"MlvW9ErDwb2_MoDgXna8jg":{"text":"Visiting for the first time, must try smoked salmon and fried bread for appetizers. If you","useful":0,"cool":0},"Ba9iLwGoafATOTTNjynEqw":{"text":"I can't even with this restaurant!!!!! I am from New Orleans and I have been to all of the","useful":0,"cool":0},"ryljKTMVFLs6IiJUYTyTOQ":{"text":"Peche is consistently packed and reservations often appear to be difficult to secure at pe","useful":0,"cool":0},"bgJjRIVhZE6kUwzAOv1tww":{"text":"Pêche is amazing. I had the baked drum, one of their signature dishes, and it was incredib","useful":1,"cool":0},"ltUF3G1A-vDRO5KZMab0cA":{"text":"The food was just absolutely delicious. Got the redfish which was flawless. Dessert was am","useful":0,"cool":0},"q0MghRh_M_Shkqcq9qoYgA":{"text":"My mom and I stumbled upon this place while visiting New Orleans for the weekend and to sa","useful":0,"cool":0},"Wjrq1fTR2lFXY6-REErhtg":{"text":"Had an outstanding meal here.  My friend and I started with the gulf shrimp, marinated cra","useful":0,"cool":0},"4FE7B-2q0ykN87CW56OJtA":{"text":"Outstanding meal and wonderful service. \n\nWe ate at Peche on our weekend trip to New Orlea","useful":0,"cool":0},"1mtArv17DXvT441FJLeyzQ":{"text":"Peche has been on my wishlist for over a year.  Finally, last week I was in Nola for a con","useful":0,"cool":0},"6WiTn_O9X1QvgV0Jx7a4cA":{"text":"I sadly had such a bad experience at Peche.  It came highly recommended by my cousin who l","useful":0,"cool":0},"GwSQjVMCTPiaFdZLY9yV1g":{"text":"This is an awesome place. I went in expecting good food but nothing this good. I had the T","useful":0,"cool":0},"mL63uVrGy38ZfG4G2xw78Q":{"text":"Deserves all their accolades.  The food is made with fresh ingredients.  The seafood gumbo","useful":2,"cool":0},"bwwwDRmFFtKfiqJArjGLwQ":{"text":"The seafood was very fresh, and the ambiance was fun and trendy. The group I was with, and","useful":0,"cool":0},"BDKsx3iZ3qjLoMelzDM3XA":{"text":"I'll start by saying that seafood isn't my go-to, but I was excited to try something new a","useful":1,"cool":0},"FCe5ojiiaVdEuh5Wi084Uw":{"text":"People who complain about this restaurant aren't reputable. Everything was fantastic. This","useful":1,"cool":0},"lS2rXGElU9sDgD2LpUc4dw":{"text":"Had lunch during last visit. The oysters are delicious.  The shrimp sandwich was perfectly","useful":0,"cool":0},"M9Aj04ZiWOwzv0gfRpWdLA":{"text":"Living in Maui I'm dubious about eating fish outside my Hawaiian islands. So I stuck to th","useful":1,"cool":1},"we09e0VUdto44Caw4-wb1Q":{"text":"I've eaten there many times.  Each time I ask for HOT (temp) shrimp bisque.  I've never go","useful":1,"cool":0},"93AU_AMamTzPy1zPZaDx_A":{"text":"Peche has become a place to go every time I visit New Orleans and this trip was no differe","useful":0,"cool":0},"7RdyzFPhlvHtoB0M27gKYw":{"text":"DON'T EAT HERE\nThe menu has weird pairings that don't go together. There are about a 1000 ","useful":1,"cool":0},"meNRrxKa9fxkB8WNGBAgTw":{"text":"Walked up to the bar at about 5 o'clock on Sunday evening looking forward to a nice meal. ","useful":0,"cool":0},"TYDyfrMVT2vxUBbvpumdiw":{"text":"Wow. If you are a seafood fan - eat here. This is some of the best food I've had. And the ","useful":1,"cool":0},"8alF5jX7Lpf6QojVojP2JA":{"text":"Walked over for lunch after a day at the WWII museum. It was a Friday afternoon and it was","useful":2,"cool":2},"Q0IbcM_EFwDDZ_ae552UaA":{"text":"Wow for me. Late evening dinner and this was recommended as a \"do not miss\" restaurant. Ve","useful":0,"cool":0},"cXlBFcvPbDK_ujAdNOWVkg":{"text":"been here several times.\n\nsmoked tuna dip - sometimes great, sometimes not...\ngrilled red ","useful":0,"cool":0},"fosxGcS65xllJ39BNPOigA":{"text":"Keep up the good work. I had a great experience at Peche. When I come back to NOLA, this e","useful":0,"cool":0},"PNtzL0fER6Bpia01Bhpo4w":{"text":"OMG...the best meal ever. I am so sorry we do not live in New Orleans, because we probably","useful":1,"cool":0},"PzrK5q4HRJUXKB2zAhg5Og":{"text":"One of my favorites in New Orleans.  The staff is always very friendly and knowledgeable o","useful":1,"cool":0},"kniERnTsC340RQcvAWgHIA":{"text":"W.O.W. This place was spectacular. Went for dinner with some friends and seemed like we or","useful":0,"cool":0},"mijzd-XSfI6qomhnKgaYiQ":{"text":"We knew Peche was difficult to get into, so we made a reservation about 3 weeks before our","useful":0,"cool":0},"Lu0sY3HwekwRzqXkRKkv1A":{"text":"Smoked tuna dip is wonderful.  The gumbo is roux is heavy and couldn't really taste much e","useful":0,"cool":0},"Uyglqi8PCAP0BN6vqwzjig":{"text":"Pec he was delicious! We had a dozen raw oysters, the swordfish special, grilled tuna, and","useful":0,"cool":0},"Jgpuwu9ScnN_U1lrLmONNA":{"text":"Our first night in New Orleans and we had dinner at Peche. Casual.\n\nWe had reservations an","useful":0,"cool":0},"R4EY3uNJq_pzA8BvR7grag":{"text":"Fantastic service in a comfortable and relaxing environment. Great location for a dinner o","useful":1,"cool":0},"umGO_F9axXOuRY4a2GTSYA":{"text":"The food at this restaurant is sub par. For seafood, New Orleans has many better options. ","useful":1,"cool":0},"jMFHCBhhVI5xZBbKIi4Hyg":{"text":"Worst experience during our New Orleans visit. Arrived precisely on time for our reservati","useful":1,"cool":0},"pjVyY5FsNPuE-3pO04-LUA":{"text":"Great meal.  Whole red fish with salsa verde was outstanding and delicious.  Mussels were ","useful":0,"cool":0},"3NQcxKMPw58RM43xnHqI3w":{"text":"Very Disappointed in the service...Went for lunch and thought the entree prices were too p","useful":0,"cool":0},"GwGoPobSyu7BkWCnoxUhaw":{"text":"Service was excellent from the hostess to the food runner! Food was superb!! We had the sm","useful":0,"cool":0},"p9nm_qrUZF2gdhzVu6vI3Q":{"text":"We dined at Peche on a busy Friday night about two weeks ago. I was with my parents (both ","useful":0,"cool":0},"bUEHUdX7KJDVCMyPzWP2Sw":{"text":"We loved this place. The ambience was so lively and was awesome. For our appetizers I got ","useful":0,"cool":0},"v_2UUSCluD1yXruxfrKCMA":{"text":"Food was great, service was a little off. Oysters were fantastic. I'd definitely go back. ","useful":0,"cool":0},"VsRtWLBOLYuuPYZpq6mnqw":{"text":"One of the best seafood meals I've had. I ate the seafood sampler platter as my entrée. Am","useful":0,"cool":0},"mz7RhQ5JKNWsWJGNS-EEqw":{"text":"I will seperate the food from the dining experience. The smoked red fish with salsa verde ","useful":0,"cool":0},"yccZdrMd4dL1OCya4lMjhg":{"text":"Went for lunch before Saints Monday night game and had a really good meal. Service was pat","useful":0,"cool":0},"aZIBnrbvIOFDIe6udjc-oA":{"text":"We dined here a year ago and had a fabulous meal, even though I ended up eating my dinner ","useful":0,"cool":0},"tlmViCW2FXWQGfGYmzk2cQ":{"text":"Loved this find. Everything I had was very good, but the Fried Bread kept making my eyes r","useful":0,"cool":0},"UT85j7KsxG85e3gawLgdwA":{"text":"I had dinner recently at this restaurant on a recent visit to New Orleans. The atmosphere ","useful":0,"cool":0},"FE8B2aLFJ_rPIDkSkAM_Pg":{"text":"Not sure why so highly rated and James Beard winner. Its much more casual than we expected","useful":1,"cool":0},"szjKtiY7F2FPvKOVabEDfA":{"text":"I went with my girlfriend the other night and actually found myself saying to her, \"I thin","useful":1,"cool":1},"G1wiS4DHotKpG00y6iu7DA":{"text":"Food is absolutely amazing. Definitely one of TOP picks when visiting NOLA. A must visit a","useful":0,"cool":0},"DbIc5cKd3InJY4zd9O8VmA":{"text":"AHHHH Maze! We tried this opening day for lunch (3rd group of customers) We had been anxio","useful":0,"cool":0},"NkCDiBLgkuGg7ZV6OopFgw":{"text":"Fantastic!  I had the steak tartare, which is Cajun style tartare.  It has a bit of a bite","useful":1,"cool":0},"xD73kZtMvP1z6HP8Te_DbA":{"text":"Wonderful!! Wonderful!! The drink selection was unique, yet delicious. But the food was ab","useful":0,"cool":0},"xF1m8T7QkBZ_QsnrED38Ng":{"text":"Our new favorite seafood spot when we are in NOLA.  Every app and entree we had was great,","useful":0,"cool":2},"HACIvFu1d2GrmVo6qycXlg":{"text":"Great food and fish, servers were all very nice. Best restaurant I've been in new orleans.","useful":0,"cool":0},"7gPdNJKHrM_kNHgssy1lNQ":{"text":"Service was good. I wanted something light to eat, end up getting the grilled chicken skew","useful":0,"cool":0},"Z8KPdalZs6aLXV8wp_G_lA":{"text":"A friend and I went for lunch and I ordered the smoked tuna appetizer and then we both ord","useful":2,"cool":0},"K7yDB_o085GMg8GHiwcTMw":{"text":"I was interested to try Donald Link's foray into the seafood world. I enjoyed the more lai","useful":6,"cool":2},"b-LzPe_z_rkQ8AT0JJG4Cg":{"text":"BLUF:  Got 6 small plates (1 being a dessert) and all were amazing (except the dessert).  ","useful":0,"cool":2},"1A6lcahvMguiJ4Xpbbr0UQ":{"text":"Service is excellent! Everything is amazing! The oysters are so fresh! Must visit in Nola!","useful":1,"cool":1},"likoLhPNdNue1XANCqiuVQ":{"text":"Went here on a recommendation from a seasoned Uber driver and we were not disappointed. We","useful":0,"cool":0},"DyeLoAzofv_VxvgUb6RTTQ":{"text":"Now in my top 5 in Nola --- And that means a lot! \n\nHow someone was able to give Peche any","useful":2,"cool":4},"pqB_Ox4gNSOrZ31pHLLXEA":{"text":"I will always take friends and family here from out of town because I know it will be a sl","useful":0,"cool":0},"S-HdlYXTpj64EAokbgBUzA":{"text":"Amazing!! Went three times in a week and I don't usually repeat when in Nola. But GO THERE","useful":0,"cool":0},"f2jbuoECrKj4f300kfcnXQ":{"text":"Everything was fresh and delicious. We ordered just about everything on the menu. Some of ","useful":0,"cool":0},"ClKh1Lux6apSLRf2lrHqLQ":{"text":"AMAZZINNGGG. Wow. Took a big group here, each of us had something different, and they were","useful":0,"cool":0},"_kJT1U-mZdxhNnCP2UNbkQ":{"text":"One of may all time favorites for oysters in NOLA. Was very impressed with the menu, atmos","useful":1,"cool":1},"-WJTdxFMPuePH7v560SWSg":{"text":"Came here for a snack one day with my wife to see what all the hype is about! We sat at th","useful":2,"cool":1},"AKX65SDFOTWY2GkLhFlzjQ":{"text":"I just had dinner there. I was by myself looking for a fresh juicy seafood meal. The oyste","useful":0,"cool":0},"akCUnq-teMeXR4O8MNeUDg":{"text":"If you want to meet the biggest snobs in NOLA, eat here. Very rude, slow service, small ov","useful":0,"cool":0},"Hf4OEy-cwwQyrbAVQVq2SQ":{"text":"Why eat anywhere else in New Orleans.... Why? The oysters are the best, the croquettes don","useful":0,"cool":0},"EHFdtuZp_a9aPIW9sSwgdQ":{"text":"Atmosphere is great. Started with steak tartar and smoked tuna dip and both were excellent","useful":0,"cool":0},"J97yiiiO9UfZVKHE9fnPQA":{"text":"Great drinks, really good food and cool vibe. We really enjoyed it! \n\nWe had the grilled c","useful":2,"cool":0},"7kstw_YIlKnkM6kmvjTkjA":{"text":"have to say, after the build up from friends and reviews, it was going to be hard for this","useful":0,"cool":0},"gUSgs_dQMyh7TKtWoFtcYw":{"text":"If I lived in New Orleans I would eat here every week. In fact, I may just fly back soon t","useful":1,"cool":0},"i1yyHChSkrON8m822rq1qA":{"text":"I'm a meat and potatoes dude, but these dang fried brussel sprouts were GOOD.  Highly reco","useful":0,"cool":0},"_JVLRwxqzVbpWu5koI_hzA":{"text":"Absolutely amazing place. Being from NYC which has a ton of top notch , superb spots, it i","useful":0,"cool":0},"LW7kt2XJGNlhOTzaD5K4VQ":{"text":"One of the most unique seafood restaurants in New Orleans. It isn't going for a Cajun or c","useful":0,"cool":0},"7fUWGSSd-SaEPOskceu68g":{"text":"5 stars. \n\nI came with a table of 10, we ate a lot of food. We got the seafood platter. Th","useful":0,"cool":0},"-j_DmBzlqQzp7X4mXAHUwQ":{"text":"Our party of 5 enjoyed all the of food that we ordered; however, we all agreed that it was","useful":0,"cool":0},"_QHjnSFB3rJRFRnkzSzCtw":{"text":"Chef Pruitts menu is superb!   We had one of the most memorable meals ever!   The whole Re","useful":0,"cool":0},"Ekqpg_J7xx8TCO2VidpFcQ":{"text":"Dined at the raw bar area Thursday, Dec 4\nStarted with the specialty cocktail old fashion-","useful":0,"cool":0},"JE_8P_oMLq07B5UE_taz8g":{"text":"Great food. The gumbo was some of the best I've had, flavorful, dark rich roux, and okra -","useful":3,"cool":1},"GxR92krMPIZ0CZgA1jL3MQ":{"text":"I stumbled across this restaurant by chance. It's amazing. Very personal service from the ","useful":2,"cool":0},"Dwglw6U6gUPi1_vWaUt6bw":{"text":"Three of us enjoyed a very tasty meal there this evening. Tuna, drum and skirt steak were ","useful":0,"cool":0},"waoraILWJxRs31RgXZTVpQ":{"text":"Flat out amazed. Staff is as good, chill and on top of it like I have ever seen in a non-a","useful":0,"cool":0},"6lPwzgWpps1sc1laQscDyw":{"text":"We've had two amazing experiences here.  The last time, we enjoyed the whole roasted pompa","useful":0,"cool":0},"oO1i_7zqIBrECUXsR7jmJw":{"text":"Best seafood. Loved the smothered greens with chili, fried bread, gulf shrimp and oysters.","useful":0,"cool":0},"uvdLQDVa14IH65KwRdGMmw":{"text":"The best restaurant I went to in New Orleans. THE END. \n\nThe drinks are divine, the oyster","useful":3,"cool":1},"2asn8i_H47yqgldj2pabvQ":{"text":"Crawfish Cappellini was amazing. Gumbo was good. Fried Brussel sprouts were delicious. Rum","useful":0,"cool":0},"gUi7Jqa1q5mpFo4hx1mZ9A":{"text":"The Red Snapper, Tuna Tartar, Beef Tartar, wine list, service, atmosphere were all awesome","useful":0,"cool":0},"hy4Qa5FRMGe_nUq2tW-dtA":{"text":"Great atmosphere, best beer selection I've seen in the downtown area, but I would recommen","useful":0,"cool":0},"dBEe2gfvWkKsm2y-Y1ZKtg":{"text":"Absolutely wonderful food. Ate there twice while in New Orleans!","useful":0,"cool":0},"LSTdTrF7rup67HekE-rS0w":{"text":"I was pretty excited to try this place, but I left with a \"just ok\" impression. I loved th","useful":1,"cool":1},"2ACBK-tXXL0f6gjZs_RG8g":{"text":"Fantastic choice for travelers looking for a taste of Nola! Peche is my favorite place in ","useful":0,"cool":0},"MVRQzcnr0IIIezambm0jgw":{"text":"My husband and I had dinner at Peche and highly recommend it to those that love seafood.  ","useful":0,"cool":0},"KUnJHnh3NyCVJk3Zj2keNg":{"text":"Ah-maz-ing. Gorgeous/trendy ambiance, relaxing atmosphere, delicious food. We had the raw ","useful":0,"cool":0},"SEYFSuwksXADKMuOAWCsBA":{"text":"Nom nom nom.... i'd say hands down the best oysters I've had. Everything else's was good t","useful":1,"cool":0},"meb4V3DWd8g0BeRkvGRoRQ":{"text":"I grew up in Nola and still currently living here. Hands down the best restaurant I have b","useful":0,"cool":0},"Gjvalp2MEi9D0Pnh_LF9Cg":{"text":"We just happened up in this restaurant while visiting NO.  We had decided on a late lunch ","useful":0,"cool":0},"VQAJyuUe_NsoKdrU0HC49w":{"text":"Excellent food.... Great service....Definitely giving g.w.finns a run for there money","useful":0,"cool":0},"eQjNhYL5TpL7wGFmTfMuYw":{"text":"Just go. Amazing. Everything. No words can describe this food. Sublime and clean bursting ","useful":0,"cool":0},"qccgSgVZRltMpuY-r0fEWg":{"text":"Having travelled to NOLA twice in three weeks and having eaten at some great places, Peche","useful":1,"cool":1},"re53asxJZSXhk7AKsFBvUw":{"text":"Always go for the raw bar, small plates, and gumbo. All fresh and well seasoned. Love the ","useful":0,"cool":0},"T7_koI-Zw3iMUQfc47Kd-w":{"text":"Pretty good food, but expensive. Service was average and I don't think our waiter wanted u","useful":0,"cool":0},"Px6_g7WcM_bwGxFHs42mJw":{"text":"We came in on a Saturday evening with a 530 reservation for a party of five. The waitress ","useful":4,"cool":0},"iLe6HX5rUS6ieLtaHwSV7g":{"text":"Definitely a highlight of the trip, if not THE highlight of our trip. I wasn't sure what t","useful":0,"cool":0},"qpwHHseq5qMrx2gCm6en-g":{"text":"Was in New Orleans with some colleagues for the 2014 NADA convention.  The entire city was","useful":0,"cool":0},"LtweQhXDyOKGnewI2VkTvQ":{"text":"Amazing food - loved the shrimp toast with sweet pickle chip, smoked tuna spread on saltin","useful":0,"cool":0},"hV-nbKrbByq9YcGJbH8Lfg":{"text":"Wow is all I can say. Went with a group of friends, did small plates and shared. Would lov","useful":0,"cool":0},"NtIM-ofU6FanvK8o0ksBTw":{"text":"Ate many small plates including the oyster sampler, Brussels sprouts, capellini and fried ","useful":0,"cool":0},"d8Fpcgox970kdfRYW9WXhw":{"text":"Delicious food, excellent service, and a great place to dine at if you want to spend that ","useful":0,"cool":0},"9qmlLPbtiuVgarykefqQsQ":{"text":"Incredible food, great drinks, amazing service. So flavorful! We tried half the menu, and ","useful":1,"cool":0},"6vRgtbIteZV0c44oUF5NQA":{"text":"I went here for Memorial Day and was, frankly, underwhelmed.  The best thing I had was the","useful":0,"cool":0},"OUmZTHm-WaKiqXwbYntsLg":{"text":"Had an amazing meal at Peche the week after they won the James Beard award for best new re","useful":0,"cool":0},"zfuNAKkG4pKesL0XAb098A":{"text":"Came to this place today for my birthday weekend and couldn't even get through the door be","useful":0,"cool":0},"EhxO3603IntrjCKR_--_zw":{"text":"Don't let the casual atmosphere in the restaurant fool you, the food is everything you wou","useful":0,"cool":0},"Fgr9yctyFNQmuRCSI54yQg":{"text":"Great oysters, baked whole fish, ground shrimp on fresh pasta  - all around excellent food","useful":0,"cool":0},"FPF6IEvNrjlBIlgEvomZeg":{"text":"I went for a work dinner. The restaurant is very cute and has a nice friendly, classy ambi","useful":1,"cool":1},"QN5Ufn3q23Tfj6FF44Ie8g":{"text":"Cochon is better.  Peche is the seafood version of his restaurant group and while it's goo","useful":2,"cool":1},"jA5ihveGX0nkYLkchzzTXQ":{"text":"Excellent gumbo.  Fresh Oysters.   Stopped in with friends after a long day of walking.  S","useful":0,"cool":0},"DnARA6p0BBwJOLbrJPyVfg":{"text":"Absolutely unbelievable. The best food I've ever had. Service is great too. You will recon","useful":0,"cool":0},"Bu76LG_cY4Oote0We81XZg":{"text":"Philippe thought the Louisiana oysters were big and flavorful without too much brininess. ","useful":0,"cool":0},"Hsq5i7VfAN5RUVtTQApRig":{"text":"Good food but based on our experience, don't expect a leisurely dinner. We were so rushed ","useful":0,"cool":0},"NofMKHl4Tf5MNyKKabtkFQ":{"text":"Yelp does not allow me, but I would actually rate the food 3.5. There were some definite h","useful":1,"cool":0},"T8v0vPZmSwPIS3UrSdMadA":{"text":"We really enjoyed the food, we had the ground shrimp and noodles, one of the raw bar start","useful":0,"cool":0},"H5_sUjKUSHq_4Zwwts6Ayg":{"text":"Stumbled upon this late afternoon and just had a drink and quick appetizer-----can't wait ","useful":0,"cool":0},"IhtvNdvZ1tCQltN4PL9afQ":{"text":"Date night with the BF...we came here on a Saturday in June and arrived around 7pm and the","useful":0,"cool":0},"qciUw_R-UCMkY50dap_eAA":{"text":"If you want the best hushpuppies of your life....stop in here.  There is an oyster bar plu","useful":0,"cool":0},"ecqBFCBIkCGKQK8dMpzMZg":{"text":"I had seen that Peche was opening when I would be in New Orleans, but I made reservations ","useful":1,"cool":0},"5XGvn06Ur8Jzd7FYy9d7dA":{"text":"Not just your typical Tilapia and Salmon joint!\n\nThis place is a bit out of the way from y","useful":0,"cool":0},"E6PuCMd8sIL19yBkHrohCA":{"text":"I was at The National WWII Museum and was walking by thinking- this place may be great wal","useful":0,"cool":0},"JjqH75CAs9ElqutLj9EyRQ":{"text":"I decided to have a solo business lunch at Peche because it sounded so good from other Yel","useful":2,"cool":0},"klJFrrxwoKCFDDAnRM_VcA":{"text":"Most excellently prepared fish I have had in my 43 years. Order the whole fish. Great serv","useful":0,"cool":0},"W2NUmzSDlc9_qWvWdeHFwA":{"text":"Wow! My kind of place. Everything was about as good as it gets.\nNice open atmosphere, very","useful":0,"cool":0},"YI6Nodc0TNOEsHRcpI5ChA":{"text":"Everything was extremely good!  The rib eye steak was amazing, perfect seasoning, and perf","useful":0,"cool":0},"egd9d0zbaM7drVOsXZc3ag":{"text":"Thanks. Slipped a little over the years as it's become more popular- not so much in the qu","useful":0,"cool":0},"JGS4B2PLouDoIgc7QVEhwA":{"text":"I recently went here and I can honestly say the service was excellent,   thanks to Ms Heat","useful":0,"cool":0},"4-iDbcC5hGNEKb0lRxcMTg":{"text":"I wish we found out about this place sooner! \n\nI was in New Orleans and this is the last r","useful":1,"cool":2},"PzvoYIvUUISYnS2UiYq_iA":{"text":"Nothing short of awesome. Sure it is busy but it is busy because it is so good!\n\nThe food ","useful":0,"cool":0},"wz4zYUW0RFM5RmqZ-YcLVw":{"text":"I am not a person that likes fish so I was hesitant when my friend insisted on going. We f","useful":0,"cool":0},"cKEC4w6gIOBvfah2mHPlFg":{"text":"This place has really good seafood. They have three different levels of oysters (from the ","useful":1,"cool":1},"TSn0axmqCB1r9zUGSpuvSA":{"text":"Just had the most wonderful dinner at Peche.  My friend and I are visiting my daughter in ","useful":1,"cool":0},"7C1W2KAhyQ7BHlPnGqDKVg":{"text":"My family took me here to celebrate my birthday. It was a great time- the food was delicio","useful":0,"cool":0},"GTbaA1xPFNCZej60FtNPEQ":{"text":"YOU MUST REALLY ENJOY SEAFOOD TO DINE HERE, OTHERWISE PASS!!! there is literally nothing e","useful":0,"cool":0},"Ej2ziPRiRXE_SZGKpF3Sew":{"text":"The service and the quality of food here was fantastic. The menu had everything that a foo","useful":0,"cool":0},"VSNj1X9ev7B0dvLRdwHoew":{"text":"Believe the hype! The rave reviews, awards and accolades - all well-deserved! My mouth is ","useful":4,"cool":3},"aOsHDPtwzrrB-0zVmbE1Lw":{"text":"The beets were delicious. The service was ok. The whole redfish with salsa verde was also ","useful":1,"cool":0},"8YlfwGP1TsSKYpLBTQJGNg":{"text":"Where to begin?!?! I cannot sing enough praises about my experience here tonight.  I calle","useful":2,"cool":2},"R8K5ENb7RHBI5-jmysajeA":{"text":"Wowwwwwww, just WOW. We left this place for last on our one week trip to NOLA and I'm so g","useful":0,"cool":0},"ffmnud-1zFZXQ35hR7poCQ":{"text":"Visited Peche back in February and it was awesome! Definitely make a reservation in advanc","useful":1,"cool":0},"Btf06yAIIKvNaAOt5TdypQ":{"text":"We were looking forward to trying this restaurant as we heard such great things!!  So very","useful":0,"cool":0},"rqcg3zMaSM9ZiyQG4UpQlA":{"text":"This was ahhh-mazing! I would highly recommend. The oysters melted in your mouth. And the ","useful":0,"cool":0},"kxAUE0p2wr9VP2Kfnyv9hA":{"text":"One of my favorite dining experiences in Nola. What might lack in service at times,(it was","useful":0,"cool":0},"3hvmt4x6CCv5fhXJuR_3pw":{"text":"5 stars for food and ambience. What I loved about this spot was that they put just as much","useful":0,"cool":0},"s0nSHmBIpdCZ7K0kuKIchw":{"text":"My mouth waters when I think back on this meal! \nI've had whole fish before, but Peche has","useful":0,"cool":0},"KDquBZaeYz92Xst40BLB9Q":{"text":"The fish here is super great I was not happy they didn't have oysters but that changed onc","useful":1,"cool":0},"n4IVrSuBOzzmNpCnOvW1KA":{"text":"Loved this place. The interior is beautiful and loved the area. Not far off the St. Charle","useful":0,"cool":0},"KFr9MaeB90T9svAnZvDd_A":{"text":"Food is great - !! For desert , magic cake matched w/the desert cocktail is the best -","useful":0,"cool":0},"Kud1wKnYV2p_czP80NxEmQ":{"text":"Wow, what a great meal!  Recommended by several friends who have visited before, this clas","useful":0,"cool":0},"h4Ro6qFBhbUbtu1mcG3qjw":{"text":"Get the BEEF TARTARE. \nIt's beefy, tart, buttery, mushy, and crunchy... everything good! I","useful":4,"cool":1},"oy9kBKOnRqm9kaZQbaPLQw":{"text":"This was my second time in peche and it won't be my last time. I love this place. Some of ","useful":0,"cool":0},"PdIVEEdv5MPtOcEqUAVjKw":{"text":"Absolutely coolest atmosphere. Excellent service and the food was devine. Definitely one o","useful":0,"cool":0},"3jIu-XCCwPgfU-vj2pERew":{"text":"Do not try to make a reservation through the Peche website!  \n\nMid-day on Monday 12/29 we ","useful":1,"cool":0},"NIvt0NqxDBq2WKgPwRO4Qg":{"text":"Amazing food, excellent service (sitting at the bar) and good cocktails, absolutely loved ","useful":0,"cool":0},"siQhjJShin_wrUwosuIhpw":{"text":"Normally this could've easily been a 3, the oysters were fresh, cocktail unbelievable (Mor","useful":0,"cool":1},"h4glK8LC1-I-8LyxkoshkA":{"text":"We had dinner here and were disappointed. First, the noise level makes conversation imposs","useful":2,"cool":0},"KoH5MQGW1hiH9wwLZFcSBA":{"text":"\"The most awesome place ever\" was the description my hubby gave it after gushing that it w","useful":0,"cool":0},"Z_5mxpKuPhfWMzJRrFzlHQ":{"text":"Excellent food. Been twice during visits to New Orleans and have not been disappointed. Th","useful":0,"cool":0},"zfuEMLWBb9WRhTQLOJbwww":{"text":"Hello, I see you've found Peche by searching \"restaurants/food/seafood\" or similar while y","useful":1,"cool":1},"7LcRg4jLcjvtD3a_TMEWOw":{"text":"Excellent place for seafood. I had the whole trout - it was fried yum! I was dining solo s","useful":0,"cool":0},"k0S9qjY9osj8cdpn3HGl2Q":{"text":"It's hot as blazes outside in the summer NoLa sun, but the food here is fresh and deliciou","useful":0,"cool":0},"4BGIHLC0D7mpnEvnXVW3Og":{"text":"Went for lunch and devoured the Louisiana Shrimp Roll. Tasted fresh with an abundance of s","useful":0,"cool":0},"6zBQUjQsGVwwk8JM35a2yA":{"text":"Tried this place after it was recommended by a local. Oh my god, it was good. We had the s","useful":0,"cool":0},"cf0R5S4Ri0jt8KSEMMmveA":{"text":"If your looking for fresh seafood, great drinks and a casual atmosphere, this is the place","useful":1,"cool":0},"lFKw1QGO7gfqFFJKgbyLbw":{"text":"I'm usually not big on seafood but this place was great. We had a party of 8 and all enjoy","useful":1,"cool":0},"BtzyiPtm_1iyYMOM9KZ2oA":{"text":"One of the best dinners my husband and I have had. The staff was super helpful, patient an","useful":0,"cool":0},"TmEzIIrWnULOqiyERHcMFA":{"text":"Word was out in Memphis that Peche was a must eat.  Thirty-minutes after arriving in NOLA ","useful":0,"cool":0},"85pXkU5ZUHYA1sB5tHo9XA":{"text":"The guy served us was miserable, we asked a question about Oyster and he just shakes his h","useful":0,"cool":0},"SE8hMq8y4ubK_Xqhngddhw":{"text":"Oh my goodness!  I don't know where to start.  With all of the incredible food in this cit","useful":1,"cool":2},"zz5j0apnCSJWaCCHBIUh1g":{"text":"The food is delicious! The oyster were fresh and very clean. And great ambiance.","useful":0,"cool":0},"QA0g03aPNdDM4hjvZ8MtAg":{"text":"My food review is 5/5 but my service review is 1/5. The food was phenomenal and the best r","useful":0,"cool":0},"DMD3_GlYvCr8Y6sT8pScZw":{"text":"We came away disappointed. We like the ownership's other places, Herbsaint and Cochon, but","useful":0,"cool":0},"POMZPE0Wal-De0LHsWiuqg":{"text":"Went here with a group of 7. Atmosphere was loud but perfect for large groups. The decor w","useful":0,"cool":0},"GWx0-NTZe2LdHJxoVu-LpA":{"text":"Not exciting at all. I don't understand why anyone would take a delicate fish and slather ","useful":1,"cool":0},"xe0KBf2Mw-4coJ3iB8zeKQ":{"text":"I wouldn't go back. The service wasn't good. The menu was small. The food wasn't great. Th","useful":0,"cool":0},"UFiesXsJOF1KfW6wYYXccw":{"text":"Great meal, esp if you're into wine pairings! Rare and special wines, uniquely suited to t","useful":0,"cool":0},"bA10UmnukxodtdSU5NmEGg":{"text":"Say at raw bar, enjoyed watching the dance and craftsmanship of the guys behind the bar, a","useful":0,"cool":0},"8nZJ_u3ouDArabHUxqcyqg":{"text":"A casual, more higher end, but not snooty delicious and fresh place to eat. Loved the catf","useful":1,"cool":1},"6ollMVuyWdllT5Zd4S6U6A":{"text":"Awesome ambiance with exposed wooden columns and beams. We got the grilled tuna, oysters, ","useful":0,"cool":0},"-7VEw3zEqJ-iymq-0ScZIA":{"text":"Amazing, local food. So glad I decided to get out of the French quarter and trying somethi","useful":0,"cool":0},"tvEiBLoppGZBLSKVXkdxnQ":{"text":"Had a great time here, only because we befriended a customer seated next to us.  The servi","useful":0,"cool":0},"hmPhF2ntgUl78A-8GPpfsg":{"text":"Loved this place.  Started with fried salty bread and raw tuna appetizer.  I believe this ","useful":0,"cool":0},"9Vrc1do6an4fdxY3hi9lmQ":{"text":"Fresh and tasty food. Our server was very informative and checked on us all the time. The ","useful":0,"cool":0},"9WG544xjC87mB3lbRgACWQ":{"text":"My friend and I went here for a special occasion. We were extremely disappointed. We felt ","useful":2,"cool":1},"WR7RcNbueBTY2nDekpU6Og":{"text":"Wow I really liked this place we were on the way to Cocheron when I saw the menu was all m","useful":2,"cool":3},"DZ1i2SjwBcMijyoz0r-07w":{"text":"I was vacationing in Rosemary Beach, FL when I ran into another foodie from Atlanta. He's ","useful":1,"cool":0},"XK9ODlCbyRWfM654_H8aOw":{"text":"Nope! So loud u can't here the person next to u let alone across. Our waitress Ari had an ","useful":0,"cool":0},"Pohib1pDAEy3OMGcZZuCRw":{"text":"This place was excellent from start to finish!  I decided to come here at the last minute ","useful":0,"cool":0},"ddObCxo8nhBaOaeagKh8ag":{"text":"Love Peche.  The tuna was grilled to perfection.  Oysters are top notch, from different ar","useful":0,"cool":0},"5zU4HIoxWe8INeMXS0n84w":{"text":"Pêche is the only place we dine upon ever visit to town!  We try a couple new places each ","useful":0,"cool":0},"NHPYqdSb7nHLwmZFcLarAA":{"text":"Do not leave NOLA without a visit to Pêche! The food is fantastic. Probably one of the bes","useful":1,"cool":0},"MqlyotSVaYWDOUbMtu839Q":{"text":"Service was great and the interior was beautiful and open. Hubby and I shared the seafood ","useful":0,"cool":0},"pygjuP_0sEG9o3j_QZVTng":{"text":"We went to Peche two days (lunch and dinner) in a roll during our trip. I strongly recomme","useful":0,"cool":0},"KUN9_vFXxslK3ZI1wttLBg":{"text":"Not too happy with Peche. Made a reservation for 11 a week ago and they sat us at separate","useful":0,"cool":0},"iZjepw9tbkAHP2lNQOhMgg":{"text":"Unbelievable experience since I live in here for so long. It's Monday dinner time and I wa","useful":0,"cool":0},"lDsnhXE8EvEjPQN8tJ3wSw":{"text":"This is one of my favorite restaurants and I just love the food.  My only complaint this t","useful":0,"cool":0},"VZuak7o-PUuumjU5mD05Mw":{"text":"Best food, best atmosphere, best service, best value ever!  This place makes you feel like","useful":0,"cool":1},"0YXtoMX01XyJIb4TY0bm3g":{"text":"Went here while on vacation in New Orleans,  and we were all beyond pleased with our meal.","useful":0,"cool":0},"c5uFJig9qGBm8mVbtLQ_UQ":{"text":"another great dining event in NOLA. Once again we asked our server for his recommendation ","useful":0,"cool":0},"oxGMizCW_pw8p38j63BD_Q":{"text":"We had a great time at Peche.  They helped us avoid disaster by accommodating us even thou","useful":0,"cool":0},"rD7G0IX8LIYfAJIu-ZztTw":{"text":"This was our best meal in New Orlean which is no faint praise. Food beautifully prepared, ","useful":0,"cool":0},"7rStpsGH90hFvJVb_sYFXw":{"text":"Food:  OUTSTANDING!!!!!   Not to be missed.  Just get there.  \n\nAtmosphere:  Very chic.\n\nV","useful":0,"cool":0},"6EI_pw5DpVl4L6Qcb5mzhw":{"text":"We got the mixture of Alabama and Louisiana oysters which were amazing! We got brussel spr","useful":0,"cool":0},"b6YLrclcH1e0aiVUqWFCOQ":{"text":"We went here and tried everything- and were not disappointed. All of the fish was fresh an","useful":1,"cool":0},"yjxohPHYh7gK_ihXJl0TnQ":{"text":"Loved the decor and vibe.  Found the service to be very good.  We had someone in the party","useful":0,"cool":0},"rAmxRQfDWvYGaFik-mpEBw":{"text":"really great dining experience. we had the special fish of the day - I think the snapper w","useful":2,"cool":1},"eRp_ah1LtOZmFq0gnZQXCA":{"text":"Food was good, however, the service attitude ruined this experience. Waiter was unfriendly","useful":0,"cool":0},"2QKjedbXvdomEVX1oXYIrw":{"text":"Dined last night (Wednesday) a little after 8:00.  \n\nService was good.  \n\nNoise level was ","useful":0,"cool":0},"OnTiam6eMaTtWtyMlrYpgQ":{"text":"Went to Peche on a Saturday evening and was pleasantly surprised that our table was ready ","useful":0,"cool":0},"qC6XSWf87K15bY9kPN_HHg":{"text":"Wasn't impressed at all. Split 6 dishes and only 1 item that I was impressed with was the ","useful":1,"cool":0},"IpSFzDLUH3GELl7tJ96wOQ":{"text":"I got this recommendation from my hotel nearby. They mentioned that Peche was the best new","useful":0,"cool":0},"CGLnwBeMalMFY9pukOenjw":{"text":"Went to Peche the other night and sat at the bar! Received great service and food. We trie","useful":0,"cool":0},"sZYU69Q8WP5oe1IM0uKO6Q":{"text":"Incredible meal at Peche! The fried bread is savory buttery salty goodness. The Royal Red ","useful":1,"cool":1},"VhjYwxNKjesHAdJg4wJeaQ":{"text":"Peche was a great experience.  The raw tuna was to die for and the mixing of the flavors o","useful":0,"cool":0},"lxEpGuK-3yjfiFz_Jswt9Q":{"text":"Peche thoroughly impressed me during my first dining experience there this weekend. I was ","useful":0,"cool":0},"Dp7-Jrdp5T8HfbPQawcl5Q":{"text":"New place in town and near the CBD - and it is a a Donald Link place which means it always","useful":3,"cool":0},"BzAzxyGjxpxvYKTBmiyo6A":{"text":"I was brought here by some friends who know one of the restaurant's suppliers and it could","useful":0,"cool":0},"uF9oDf7LjQH0e_rYbsruHw":{"text":"Best meal I've had in NOLA... absolute must try! \n\nThankfully, we came with a group of fou","useful":1,"cool":0},"7JaJYWz0oPzMOdSN1L1vXA":{"text":"Great oysters, cold beer and awesome hushpuppies. The gumbo is good, but definitely has a ","useful":0,"cool":0},"A9vc2rAqw83nfm_eUvBHwQ":{"text":"Course after course I was impressed by the delicious food and excellent presentation here.","useful":0,"cool":0},"U52lqjiJKf5hb_70lrAA3A":{"text":"I am from NEW YORK and live in LOS ANGELES and am an avid restaurant goer. Here's why I gi","useful":0,"cool":0},"tbBeF67KY_Qeq8wnOd0Y1w":{"text":"I visited Peche Seafood a couple of months ago for my b-day celebration, and it was AMAZIN","useful":6,"cool":2},"orcr9JpBRjZDvmeQje4TDQ":{"text":"This was my most favorite meal in NOLA, despite the 1.5 hour wait.  I will suggest hanging","useful":2,"cool":1},"AcQjmC55PmkrbHsLnD7aMg":{"text":"We came here with 14 people. Everyone got something different and every dish was delicious","useful":0,"cool":0},"qbyuON_lU90XO9AiJQRgXw":{"text":"Food was phenomenally good.\nI ordered som some special of the day,\n\nThe bill really hurt t","useful":1,"cool":1},"B4NH8okE_uTqqhNRF7QzbQ":{"text":"A little disappointed with our new year's dinner. \nOrdered whole fish but it was underdone","useful":0,"cool":0},"C6BOGLfBd9gYpflI6lHucw":{"text":"Came to NO with some friends and we all like sea food. Worst experience so far. The servic","useful":0,"cool":0},"KRgzHLHvR1ednzYhPcDFkA":{"text":"Fishing time!\n\nNo crab traps, shrimp boats, farms or fishing poles needed.. just bring you","useful":15,"cool":13},"HHmKQiTViQ1J1H2WdC-Bhg":{"text":"Excellent memorable flavors for both cocktails and food. They put different textures in th","useful":1,"cool":0},"CcfIeANQcvNhTzPWD2OcMw":{"text":"Delicious!  My new favorite spot in NOLA! No where have I been so excited or had so many c","useful":1,"cool":1},"Xmo3xAE9CE81UoaU6ZCqgg":{"text":"As a born and bred Midwesterner, I have not had much seafood in my life, especially GOOD s","useful":2,"cool":1},"b8QNfyZDpMS3hQAlqiwfiw":{"text":"Can't fault any of the food here: the best oysters, the most flavorful prawns, every item ","useful":0,"cool":0},"P70KLhmRgnDYcFHwd9iznQ":{"text":"First time at this new Donald Link restaurant. While it was quite loud and tough to have a","useful":0,"cool":0},"4I4Ojy3p1Una81T6PKPN7w":{"text":"The food is exquisite but the service is worse than terrible. We waited two hours between ","useful":1,"cool":1},"0Mr5AAY9HO_uoDvOfdyf7A":{"text":"Great service. Great job with a cheap fish.  Compliments to the chef.  Tuna appetizer=amaz","useful":0,"cool":0},"PfFooGVtaPnVCa9NlJQL7A":{"text":"Great experience all around. Service was top notch, my mint julep was amazing, and the foo","useful":0,"cool":0},"jwADoYDx9vDNUp4sc8kE4Q":{"text":"In New Orleans on a quick vacation and Peche was highly recommended. Over exceeded all exp","useful":0,"cool":0},"w0i6vFkia9HDXhjSh98zqQ":{"text":"So impressed with this restaurant! Came to New Orleans for my birthday and we absolutely l","useful":0,"cool":0},"BUk9258Mv4vG4m69eYJOCA":{"text":"Surprise surprise, a seafood restaurant did not have good vegetarian food. I went last nig","useful":1,"cool":0},"87WrQ5nEwqXxnhEVQ0mvLQ":{"text":"A restaurant that can beat out Philly's Laurel and Serpico for James Beard's Best New Rest","useful":3,"cool":0},"aIS-LgIb2EVGb4lG3MXXsA":{"text":"I finally made it over to Peche!\n\nIt was kind of a last minute decision, so we arrived san","useful":16,"cool":9},"457nznnDz-TAS_5Y5Q7OVQ":{"text":"Great recommendation by a friend.  Tried the seafood salad, perfect size.  Had the crawfis","useful":0,"cool":0},"EdscW2PpBrqPTktoVcUiHA":{"text":"Came here with my group of friends, there were a dozen of us, so I apologize to our waiter","useful":0,"cool":0},"4Znrjc3RWr5EAhz5dtvA8Q":{"text":"Ok, WOW. One of my favorite meals. We started with crudo and the shrimp bisque- both were ","useful":0,"cool":0},"IUqZnRQSonyfHnIH5qH2CA":{"text":"Definitely does not disappoint.\nI went here last year around February and had dinner with ","useful":0,"cool":0},"x97UGkktcGoTZXqDmmfIKA":{"text":"FUN Atmosphere! LOUD environment, APPARENTLY When You Ask the Server if the Restaurant has","useful":0,"cool":0},"w5brpSoTs0JV-DGZ0beGnA":{"text":"Really good seafood!  We came with a big party, and they did mess up our reservation,  eve","useful":0,"cool":0},"4yAxIGVYAz69Blm906ivag":{"text":"The service is abysmal. Part of the charm of eating in New Orleans is character of the ser","useful":0,"cool":0},"nD0IeXWA8SoLtVH7J8e6wA":{"text":"What an experience! Every single bite of every single dish we tried was absolute heaven. S","useful":0,"cool":0},"iriOE9y3p2jmImuxq_8DEQ":{"text":"I strongly believe that any dining experience, regardless of the quality of the food, serv","useful":2,"cool":0},"B3mZbNb_KIODMUzg2ehgvw":{"text":"Good food and great service. We had the steak tartare which is my favorite dish there. We ","useful":0,"cool":0},"W-GOkUI1EBq3NqXk1KYc2w":{"text":"Had a very good meal at Peche- Fried bread balls were delicious. We loved the seasonal cra","useful":0,"cool":0},"BEEJshDnVfAVOlMxLGQekA":{"text":"Everything at Peche was just peachy. My friend stated that this was his favorite restauran","useful":0,"cool":0},"6U3Jvkh5rLP38XqUCmU3AA":{"text":"Have eaten here on 2 different occasions with our neighbors. The restaurant was highly tou","useful":1,"cool":0},"mCzKxVUz9jyd84w_rxbrOw":{"text":"I had heard all the hype about this place and so I had high expectations and Peche did not","useful":0,"cool":0},"231ZU2BmgVPWEP11ntr6qA":{"text":"Loved loved loved!!  We went Tuesday night for a 7pm res and were seated right away.  Serv","useful":0,"cool":0},"j4s2fytlG8mLkseEaPKr4A":{"text":"Fave spot!! Very chill vibe. Fun & friendly staff. Big marble bar with an island in the ce","useful":0,"cool":0},"Od8zqU9gVIYiAkSEOooy0g":{"text":"Peche is fine dining, good location, nice service, friendly staff!","useful":0,"cool":0},"gH-m_xMnjYOGyDAfsZPrrA":{"text":"Great vibe and amazing food! The waiter suggested the steak tartare and said it was the be","useful":1,"cool":0},"uiiSE-La2VMxuspqgLBX1w":{"text":"I found my way to Peche via Yelp.  I arrived one hour early and was seated in about 10 min","useful":1,"cool":0},"75dU5BYAZdiHbPrUCqH8NQ":{"text":"Came here with a bridal party to run in for some quick oysters. We sat at the oyster bar w","useful":1,"cool":0},"60nflTAaAXcZ8KR-Muforw":{"text":"Absolutely blew my expectations!!! \nI saw all the raving yelp reviews and we decided we ha","useful":2,"cool":1},"42GFo8Y94zz2IORllVtyrg":{"text":"We were so excited about this place. We had booked our reservation a month in advance. We ","useful":0,"cool":0},"xXrtn9-KHuTMSoAVGuCiJg":{"text":"My friend and I had a terrific experience.  The staff was very kind and attentive, and eve","useful":0,"cool":0},"9EOGUTyE5k8-gEgE0lcQCQ":{"text":"The oysters, lemon butter drum, and ahi tuna were all great. Cocktails and beer selection ","useful":0,"cool":0},"18rEiBSA9_H8g_v7pJo0HA":{"text":"Mind you, I posted a fabulous review for Peche three years ago...\n\nWe are huge fans of Don","useful":0,"cool":0},"hHnKyOSTMDhj_uU9n1zm5A":{"text":"Well-balanced cocktails, great food and really nice staff. We had the steak tartare - it w","useful":0,"cool":0},"6XvGRIGXHBqEmED6Jnh-hQ":{"text":"Had a reservation for 8:30. Asked about status at 8:40. We were told the table was being c","useful":0,"cool":0},"jJ6sd_zE5ftVTzaloO3Xqg":{"text":"I am sadly disappointed....I had made reservations for my favorite restaurant in New Orlea","useful":0,"cool":0},"xrSnIAWdHbezYf4NbEdKMg":{"text":"Do you like delicious food? If you answered yes, then this is the place for you! I have on","useful":0,"cool":0},"Cgqvg2jh-uG9c-4V74WW5A":{"text":"Good fortune that I was able to walk in and get a seat at the oyster bar right away. The s","useful":1,"cool":2},"6CSgdOxz-glU1LfyPLK1yg":{"text":"The food is too salty here! We order baked drum,  smothered catfish, and capellini. Both c","useful":0,"cool":0},"hgL-xJI_NeZ6BIkMS_Nlvw":{"text":"Four of us went on a busy Saturday night with no reservation.  The place was PACKED, but w","useful":0,"cool":0},"PZcZ32r6jdJ2o95coyNEtg":{"text":"3.5     First I liked the bar staff and their excellent service.  Food - in my humble opin","useful":1,"cool":1},"GDhLJDWNN8YQlKZ6S_WzLw":{"text":"The food was amazing. Sadly I didn't take any pics. We were able to sit right away. It did","useful":0,"cool":0},"jzC6mTqnh-QfQ5pvbb98Mg":{"text":"OMG!  First night in New Orleans and we came here. Amazing!  The steak tartare is the best","useful":0,"cool":0},"UxGaCZp_MULTpwE8y3iSmw":{"text":"totally over rated. came here the other night after making a reservation through open tabl","useful":1,"cool":0},"t6tgHq4LkZ53oDVoW0sjCQ":{"text":"I've been coming to New Orleans since 1968. The Old Line restaurants have always been my f","useful":1,"cool":1},"5S-dqXu4UopvsCwoKgBGCQ":{"text":"Omg delicious. Tried two specialities at risk of over-eating: baked drum and vinegar roast","useful":0,"cool":0},"0RYACl4BjQYbFHySgkNrhA":{"text":"This restaurant serves up some incredible seafood. I ordered a fish special: the swordfish","useful":0,"cool":0},"JhZ4SG0uSWtU9Hafzn1Dfg":{"text":"Had a late lunch/early dinner here today after touring the incredible WWII museum up the s","useful":0,"cool":0},"in1l8ow5B5URiT6zc6vn4w":{"text":"This is definitely the see and be seen restaurant at the moment in New Orleans. So much be","useful":0,"cool":0},"E_CIksA-3HGbDwkamDO2PQ":{"text":"Get the smoked tuna dip. So good! Oysters were super fresh! All the fish was amazing. Pine","useful":0,"cool":0},"9bY2S_K-iqr_ISMa4qGoIw":{"text":"Not a huge fish guy but really well done. It is a little loud and busy, the food though wa","useful":0,"cool":0},"NfUblrJdxz7rmUQQ_ea_sw":{"text":"Truly an amazing dinner experience, and I am so glad that we were able to make this stop d","useful":2,"cool":0},"Q6YUlCWW4H7hmbkJdq9IZQ":{"text":"My favorite items here were the Grilled Tuna w/greens and olive relish and the Fried Bread","useful":6,"cool":3},"efaReXozpeJ9DKgW60oTvQ":{"text":"One of the best meals I've ever had. I had the fresh fish if the day and it was phenomenal","useful":0,"cool":0},"7vL68LcQOd1WUcftBILjDw":{"text":"Finally made it to this restaurant and I loved it!  I had been hearing and reading some go","useful":1,"cool":1},"scc0cSqRLmn2Qrio3mCJTg":{"text":"This is a not messing around seafood house. Oysters are fresh, you can watch them shuck th","useful":0,"cool":0},"KiyR9jXVRI8NJPso5kAt4A":{"text":"Peche I've sat at your tables twice before, third time was a charm!\n\nNow you're still to c","useful":8,"cool":0},"4usksU6jIrM5Ze6XqjQFKA":{"text":"The seafood here is excellent, and would cost twice as much in any other city.\n\nThe crab +","useful":1,"cool":0},"d5MAIlhqXsf2yvwoYwHltg":{"text":"Incredibly diverse fish offerings...try something new!  Crab salad had great texture with ","useful":0,"cool":0},"E7eeKBWqiyyWS3l4IxbeHg":{"text":"The seafood platter has some of the best cold dishes I've ever eaten. The baked drum is ph","useful":0,"cool":0},"C0Mbm1_ad8jz5ZF_brD_fg":{"text":"I have had a beautiful lunch here today with my girlfriend! It was unbelievable!! We order","useful":0,"cool":0},"x5nzlQFDGZT1ntdhllS0nA":{"text":"This was a nice experience.  Comfortable atmosphere and excellent service. The food was pe","useful":0,"cool":0},"-P2U6lWpHTtroAiVX4pPHw":{"text":"I was torn on 3/4 stars on this one.  It's probably 3.5.  Massive extra credit points (pun","useful":1,"cool":1},"xCZsCcHhenhg3VPFDCV2Zw":{"text":"This is an excellent restaurant. What a find!\n\nThe ambiance is very open, airy, with a rus","useful":1,"cool":1},"TPYx08sN1ZPPc2ILYXO6Yg":{"text":"Amazing dinner! Drinks at the bar is a must. Ordered an Old Fashioned before dinner and we","useful":0,"cool":0},"U0Er3FHGh4pH6VZwj8nteQ":{"text":"While I generally appreciate a restaurant wanting to differentiate itself from others in c","useful":0,"cool":0},"QwWEeyczzWiIV08v-58x-w":{"text":"Loved it. Had the tuna w/ oranges and criollo chiles which was really tasty. The crab-arti","useful":0,"cool":0},"HT_HEvjjQlcHySPMR2Zsvw":{"text":"This has become one of my favorite restaurants.  The wait staff is professional yet relaxe","useful":1,"cool":1},"ybGOWWJzluYuwS9kXLZXhg":{"text":"After this place won best New Restaurant and their chef won Best Chef in the South at the ","useful":0,"cool":0},"B64AIu1PBCr07biwGT7SWw":{"text":"Came here two days in a row for dinner, that's how much I loved it! The dauphine oysters a","useful":0,"cool":0},"tgBQXeVog9xAtIFD1vDo9g":{"text":"Would give it 6 stars if possible. \nDidnt have time but several people around me were drin","useful":0,"cool":0},"Q5HCDSUJP6sXLETKf63rJA":{"text":"Love this place!! We are people who don't always eat a restaurant more than once unless it","useful":0,"cool":0},"tUeOvznNrVKKoPjDknYAZg":{"text":"This is what happens when someone who loves pork tries to open a seafood restaurant. \n\nWe ","useful":7,"cool":2},"QvC0RLtkQKKCGqRwsDMSzQ":{"text":"Oysters were fresh and delicious. Coupled with fresh tuna and a sizable portion of Gulf sh","useful":0,"cool":0},"bpkVPO_dc8dkqwoFpbZmhg":{"text":"Our waitress Heather was great! So sweet and pleasant. My husband's red fish was amazing a","useful":0,"cool":0},"_0dgjmwtPjpJAHaZ614yhg":{"text":"I went here a few weeks back on a trip for Mardi Gras. I already had lunch reservations at","useful":4,"cool":1},"E7r83lmRShWoynjZhPIEYw":{"text":"The food and the ambience are absolutely incredible. My cousin took us here for lunch and ","useful":1,"cool":0},"6vvnItc2TmjfwsorLaF9lA":{"text":"Absolutely spectacular med and Orleanese fusion. Loved it.\n\nWe had the fried chicken hummu","useful":1,"cool":1},"IdGiz6G52a9tmzYV50PEeg":{"text":"Great restaurant but a little pricey. We ordered raw oysters, shrimp toast, shrimp roll an","useful":0,"cool":0},"aaovYYtofsRhx6S9zPUnKQ":{"text":"This was our 4th visit to this Donald Link seafood restaurant, which is in our opinion the","useful":0,"cool":0},"imPD4CYOPSIHEcaIpw9nDQ":{"text":"It's pretty.  The food I got was delicious.  However, to not be able to get the food the w","useful":0,"cool":0},"F7JwUJjhl5GO_bm4s6knNA":{"text":"Pêche is everything you'd hope it would be in ambiance, service and food presentation. For","useful":1,"cool":0},"GXvWbiBQ_ysvPDDkouNTuw":{"text":"Great lunch! Had the speckled trout, was incredibly fresh. Hubby had gumbo and oysters. Lo","useful":0,"cool":0},"OdpADC5t0UOCoNDarmm0Nw":{"text":"Usually when in NOLA we like to dine at our decade long standards. Meanwhile, our local fr","useful":1,"cool":0},"G4hb6R0A1EYWTBySY9yzSg":{"text":"Food here is really good with an interesting menu. I ordered the shrimp bisque which was g","useful":0,"cool":0},"IVbfRC5wx1gDnOfRPeQzDw":{"text":"This place was recommended by a friend, but can't tell how disappointed I felt! 2 stars is","useful":0,"cool":0},"dfYFgB9WBtxigeNzMlu6Dw":{"text":"We celebrated my daughter's 19th birthday and the food was excellent just like I remembere","useful":1,"cool":0},"zEGiUiH2Ges9wE71JQBLjA":{"text":"Went there a few weeks ago.  Full disclosure, Donald Links's Cochon is one of my all time ","useful":1,"cool":1},"V1DwnkbbbEN_LFOB8FTYdA":{"text":"Had a great experience coming here for a birthday dinner. They established a pre-fixe menu","useful":0,"cool":0},"rDJdUwiFPGoh6Vpw8HFgMA":{"text":"Came here on a date and was very impressed. The fried bread starter was like eating a more","useful":0,"cool":0},"jb2gLulpVZuK7rwyeBpxxg":{"text":"Been meaning to write this review for 11/18/18. The hostess skipped our party. Not sure wh","useful":0,"cool":0},"B4dwJYkKBD99zO7XA2_LGw":{"text":"Unbelievable food & service. I'm already dreaming of coming back here soon for another mea","useful":0,"cool":0},"VRxov3zYm2kjpLZVgtgKjg":{"text":"We stopped at this place walking from our hotel on magazine street to the world war museum","useful":0,"cool":0},"30eM4VPdPjrg9sxZ-mz4Jw":{"text":"Went for lunch, nice little place with great staff. Got a bloody marry(good not great) smo","useful":0,"cool":0},"YjUGlj9vROD8_MR_HoNHcw":{"text":"I am writing on behalf of a neighbor who just ate dinner this week at Peche. Though the fo","useful":0,"cool":0},"0Lj29d3R79pKjMWBc3Ib5w":{"text":"Best seafood around. The atmosphere and service were great and the selections were super c","useful":0,"cool":0},"7JnxAdy4SeMzZhIMytoKUQ":{"text":"Heard about this James Beard Award-winning restaurant while in NOLA so, naturally I had to","useful":1,"cool":2},"_AeOJwQb9x3IZKeQN3H5og":{"text":"We went here last week for dinner.  It was early so we weren't starving but we had a cockt","useful":0,"cool":0},"fRLQ7xSt2v74IAvhnX-LIA":{"text":"The food was good my favorite was the smoked tuna dip I believe it was. The food in my opi","useful":0,"cool":0},"LcxZ0zOBqsHvykA1hQaMxg":{"text":"Well... it wasn't what I expected. Probably because I had such high expectations, I was pr","useful":0,"cool":0},"0phGF1iK-kmHXqz9Hst2-g":{"text":"I want to thank the wonderful staff of Peche for finding my diamond earring last night! Gr","useful":0,"cool":0},"7LUeA2WhHxd1PME7jmObHw":{"text":"I don't know where to start. Experience was wonderful for a group of us for my friends 40t","useful":0,"cool":1},"zK_WQr-mReYrN8TMqXP9cw":{"text":"The staff were not as knowledgeable about the menu as we would like. However, their effort","useful":0,"cool":0},"8zCvIvHBTuAnhwbZUEh2Uw":{"text":"The Best!\nI hail from NYC and my 2 guests from Seattle and San Francisco -- all 3 of us us","useful":0,"cool":0},"nEOFNLov2UwT_KjqEJ6_aA":{"text":"This place is excellent.  El Dorado rum cocktails, whole grilled red snapper with kimchi s","useful":0,"cool":0},"VgSWfBTOdy6TfZrk0PGmDA":{"text":"Amazing!! Food and service were top-notch! Pêche's menu lends itself well to sharing or in","useful":0,"cool":0},"V1z8TPiTdie42iXF-XEb3Q":{"text":"Updated review: \n\nEXCELLENT!   Delicious food and awesome waiter, Mark from CA.  YOU ROCK!","useful":0,"cool":0},"uomL-m0tNGFMqQ2mhihI7w":{"text":"Great food and service. Employees smiling and trying to be helpful with suggestions. I def","useful":0,"cool":0},"4UQOEMCSz8p8ZiFsg0YNvg":{"text":"We had to wait a while for our table, but that's what you pay for getting in to a very pop","useful":0,"cool":0},"U0XmkdnvS1uBipeELdEx0g":{"text":"What a treat!  Delightful drum fish dish served in a savory and light tomato sauce in a ho","useful":0,"cool":0},"yfHJNLTmj9vKvF9owAqbSA":{"text":"This was the BEST meal we had in NOLA!!!!  Heather was our server, she was AWESOME!  She t","useful":0,"cool":0},"2JADFzeVyXJ70AsSobEZWw":{"text":"One of the best meals I've had in a long time.  The baked drum with saffron and artichoke ","useful":0,"cool":0},"XGTRM6DRQtIZlDLIcywH3A":{"text":"Exquisite! We ordered alot of small plates to share and all were beautifully presented, de","useful":0,"cool":0},"j4-Jc1zvVmitelmMOpWi5w":{"text":"One of the best restaurants in New Orleans. It's just a couple blocks from the World War I","useful":0,"cool":0},"UasDNoC18sM3nVjwBp5v-Q":{"text":"Peche is pretty damn amazing. From the friendly staff, to the ambience, to the wine, food ","useful":0,"cool":0},"cB_TolpBr1lHeyNC0PZErw":{"text":"Peche is located very close to the Cambria Hotel where we were staying - a real plus since","useful":0,"cool":0},"Gd2nJg1QjXBeSkVt6KZP9A":{"text":"I love love love this place. Must try if you're in the New Orleans area. There is somethin","useful":1,"cool":1},"FXutpWiWVLvL831NMzlgzQ":{"text":"The first few times I came here, I thought this place was the best new restaurant in New O","useful":0,"cool":0},"zgmzK3tG_M1_meOly571zw":{"text":"Peche is one of my favorite New Orleans restaurants.  Looking at the over 1000 reviews, mo","useful":4,"cool":2},"9KUfOXMtVD6r96UAjMHtAw":{"text":"Great food, great service! Get the bacon beans they are too good to pass up. Sat near the ","useful":0,"cool":0},"b905LtF8ztYVVLZmkBoX3g":{"text":"Came here with a small group of friends for cocktails and a late lunch so it wasn't too cr","useful":1,"cool":0},"QamSqucEEzCCqRp2P_BGkw":{"text":"Found this restaurant on yelp. \nService: fantastic \nPrice: $$$$\nFood: Good not excellent \n","useful":0,"cool":0},"u9CT8g_vzNpjb2jCTlyNpA":{"text":"We came here for a special birthday dinner, and the food was delicious and flavorful.  The","useful":0,"cool":0},"bY9BhpkgpJGRNi9NMTAhLw":{"text":"I am frankly greatly disappointed with Peche. It is overpriced and underwhelming in the qu","useful":0,"cool":0},"WdAMx887_HKw7KZDtOS_Ig":{"text":"We walked in at 5:30pm knowing it'd be crowded, which they encourage you to do if you don'","useful":0,"cool":0},"Q-Tyv9XwYfqY2Q23wHB_RQ":{"text":"Loved the ambiance and food presentation! Service at HerbSaint is better, but I'm a bit of","useful":0,"cool":0},"2sr_XdthyS8HlF0QrcLskg":{"text":"Wow!  My wife and I were both very impressed with the food, service, and the atmosphere.  ","useful":0,"cool":0},"c53x7uUiwoQ4bSRN2Kn3rw":{"text":"I am currently extremely disappointed in Peche. I will be making my third trip to New Orle","useful":2,"cool":0},"fEXsIr_XfGMyeMwZ0MSNLA":{"text":"I walked in on a Friday night and tried to grab a seat at the bar for dinner. The friendly","useful":0,"cool":0},"YjTlLFY-kOvT-PZ_8I8oIQ":{"text":"A terrible dining experience. The waiter had no awareness. Took 30 minutes to get a beer. ","useful":0,"cool":0},"eOmk4HylkLeE3Y1gnnugQg":{"text":"Underwhelming for the price. Some of the food is really good: shrimp bisque and raw tuna w","useful":0,"cool":0},"ck4yAkhDns2VJ9y6Mo28Hg":{"text":"This was my first time eating here and couldn't be happier with the service. You can get a","useful":0,"cool":1},"U7aO6tiBzaTPorVcQTaFoA":{"text":"With so many great choices in New Orleans, it's easy to find fine cuisine. The food and am","useful":1,"cool":0},"DV-MQU_kS-CkwiqjFkGzwQ":{"text":"This place was amazing. We ordered the whole red fish. The salsa verde was soooo good. We ","useful":1,"cool":1},"tsR3bQdvt8A9Wfs-01e5Jg":{"text":"First. Did not like it that the waiter said, \"the kitchen wants the full order\" instead of","useful":2,"cool":0},"TR7DeKvfDla0ziNyJcVSpg":{"text":"I haven't been this excited about a restaurant in years, and haven't written a Yelp review","useful":2,"cool":0},"dFO3JG0l10gTJlfWOtiUoA":{"text":"Great oysters and crab salad is outstanding. Service great and they pour great cocktails. ","useful":0,"cool":0},"0DhdxXH-vlezS0-ZnkAzEg":{"text":"Been meaning to try Peche for a while because I had heard such great things, and wow! it s","useful":0,"cool":0},"vx4eKj9d_aTvKZpBWS0Edw":{"text":"Incredible food! \nSmoked salmon dip: amazing\nWent w small plates:\nCrab n jalapeño capellin","useful":0,"cool":0},"unMIMxrl7fxL-mvf6ycqsQ":{"text":"came here on the recommendation of our friend, mark.  we initially had booked a res with l","useful":4,"cool":4},"Gy00Qd422LbZ56chokNLCQ":{"text":"PER-FEC-TION. We wanted to go after learning of their TWO 2014 James Beard Awards and our ","useful":0,"cool":0},"PPDybUMT4Jw4sfsJdMCXBQ":{"text":"Absolutely delicious!! We loved every single thing we ordered, the lamb skewers, seafood g","useful":1,"cool":0},"CeIod7Un20CUXuMSPjvBgw":{"text":"This is a \"don't miss\" place.  The food is a marvelous combination of textures and flavors","useful":1,"cool":0},"mT24lYGsslHf3rso7iOcLA":{"text":"Traveled to NOLA to celebrate my daughter's 30th Birthday.  We are food snobs and do a lot","useful":0,"cool":0},"wJEpIhXcyU4WABGue_MFGg":{"text":"Best restaurant in New Orleans. Innovative food and great service. I highly recommend this","useful":0,"cool":0},"rc4SZl7cLVwJMoGG_z94XQ":{"text":"Amazing...not sure what else i can say. Im a foodie and ive luved in 4 different countries","useful":0,"cool":0},"zeOw6dAvyY51-ee8Wg4MHA":{"text":"Really good food but so cold it's unbearable to stay. The management is oblivious\n\nWe trie","useful":0,"cool":0},"ukmgdyHZ2L1Rgln_QHXcgQ":{"text":"I was going to have lunch at Cochon, but they had some kind of fire. So I decided to head ","useful":2,"cool":1},"66t5czVv0BhqBy4LSFCu7w":{"text":"Amazing food! Amazing staff ! The drinks are strong and well priced . Cute atmospheres and","useful":0,"cool":0},"uNfbOFMy1g9jsINhXrCDWA":{"text":"Loved Peche. Service was excellent, and the seafood was fresh and absolutely delicious. My","useful":0,"cool":0},"rtQcWlqLMoh3yxZiXIxkRw":{"text":"Great looking restaurant, beautiful kitchen and some really tasty vittles. Good cocktails ","useful":0,"cool":0},"CxPfc98m1Lhex7NwN1Pvmg":{"text":"FAN-freakin-TASTIC experience. Everything from the phenomenal food to the service left us ","useful":0,"cool":0},"OKUK56B9Uc4P36olpqV6Gg":{"text":"Oh my god!! I just found a dish that I will dream of for ever. It's the shrimp roll. Do bo","useful":0,"cool":0},"08NiMrNdkPp3dAkUVIZLoA":{"text":"Really good food.The Shrimp roll was awesome. Our server was very knowledgeable and perky ","useful":0,"cool":0},"6aXFjRD2AGy6RZ4ZvR8uAQ":{"text":"This place is definitely one those trendy New Orleans restaurants that everyone loves but ","useful":2,"cool":2},"sWZeP4svGkr87kfD2aUa_Q":{"text":"I visited this place with a couple friends and already miss it. \n\nIf you're coming here yo","useful":3,"cool":0},"ZYotxkZdLTu5oPxawDTRLw":{"text":"First restaurant in New Orleans and we're off to a great start.  First, let's start with t","useful":1,"cool":1},"c-mZyEJm_1f5UJp85C0HxQ":{"text":"This place makes really good fresh seafood. Whole grileld fish was incredible.  Best seafo","useful":0,"cool":0},"x6KyuM1-cwkZ0iyxI4vhtg":{"text":"We've been twice and both times, it was absolutely delicious.  I don't know what goes on i","useful":0,"cool":0},"GyV2i5LBL5EJkubzPYvtQw":{"text":"Tasty food, but spotty service.  I wavered between giving this three stars or four stars. ","useful":0,"cool":0},"mpzR7vuJ4w_XWmriEhanxg":{"text":"This is my new favorite place to eat in New Orleans. This was my second visit. I do not re","useful":1,"cool":0},"MMhtSNgB04cYcY5k_UINrQ":{"text":"The BOSS must not be there anymore.  \n\nI use to love this place meaning my favorite restau","useful":0,"cool":0},"oio9TgEyOH8-L9m5RR1tdA":{"text":"The service was outstanding if not overbearing. I'm not used to that level of manners from","useful":1,"cool":1},"VNTgtfHtXGSkvHypVESMHA":{"text":"Great meal! My husband and I enjoyed our visit here during a trip to New Orleans. The serv","useful":0,"cool":0},"61wLPKc3HTlTLnmr3Lv8HA":{"text":"Food was good, however, the service attitude ruined this experience. Waiter was unfriendly","useful":0,"cool":0},"V5kScyMcZBqgSlfBytX0aQ":{"text":"Our first stop in NOLA and we were not disappointed! We were seated at the oyster bar and ","useful":2,"cool":0},"eCWpDv6BM1kguQaex4grmg":{"text":"We ate lunch here Friday afternoon and it was wonderful!  We arrived and decided to sit at","useful":0,"cool":0},"xifPCaiSbpa6qwZ2yersUQ":{"text":"When James Beard meets NoLa, you get Peche!\n\nA group of 10 of us made reservations for Lun","useful":0,"cool":0},"rJumMs0SJ3oVqPGmXmDwIw":{"text":"Fair. Were there 10/6/18 weekend one of our guides recommended & we were a little disappoi","useful":0,"cool":0},"UVsyKifiRUxOB3zeNhxvgg":{"text":"First, service was amazing! They should teach a clinic on how servers should be. Unfortuna","useful":1,"cool":0},"k5vOoCRbeBJ-7SGj5jemRg":{"text":"Freshest oysters ever! Pants on Fire cocktail delicious as was crawfish angelhair pasta, g","useful":0,"cool":0},"gAtqaMO-XWK0TesnReKMdw":{"text":"It's hard to decide which meal we enjoyed the best in NOLA, but this was at the very top o","useful":0,"cool":0},"kB0AY2Vh9Y0Gi04CXSfFgg":{"text":"Amazing culmination of ambience, food, and service. Started with perfectly prepared and ga","useful":0,"cool":0},"VDFe6XAcF3gek-GIeqSrFQ":{"text":"This is a really fantastic upscale local New Orleans eatery which features seafood local t","useful":0,"cool":0},"P-5VKPtJYdQ42CkHnNMuTA":{"text":"Absolutely amazing! We didn't have reservations so we were seated at the raw bar and did s","useful":0,"cool":0},"o0YQR6SsnqW5TLccLtkBVw":{"text":"So so so good! Sit at the oyster bar for the full on experience. I started with the lamb s","useful":2,"cool":0},"kMd6Z2H6znuU1C1BMjY8Fg":{"text":"We were in town with a small group of friends from college who are all foodies, so of cour","useful":0,"cool":0},"Tg_KScZaAG7hzWZSGwYWsg":{"text":"Stumbled upon this restaurant when walking to the WW2 museum and made sure to stop back fo","useful":0,"cool":1},"ihhQHKYK6HBJk8KZy49now":{"text":"The food and table service deserves 5 stars, the young lady answering the phone however...","useful":2,"cool":3},"n_EC2_GyRHlBWP5Kpkvp8Q":{"text":"My first Donald Link experience was a great one!  Been meaning to check out one of his pla","useful":4,"cool":0},"ztkb9FlE4t1mdJ45lf-8IA":{"text":"We went to Peche with a group of 10 on a weekday for a birthday. We made the reservation a","useful":0,"cool":0},"Cq8UWnZ1IOqPDVX5TY6vjw":{"text":"Poor service, food quality was below average. Server was rude and unfriendly. Restaurant i","useful":0,"cool":0},"PgK1OAyBA02sB6sZxWPc8A":{"text":"I don't get it.  This place wins awards left and right.  I know it's Donald Link.....so wh","useful":3,"cool":3},"thEGoxjF-BINN5HWalli_Q":{"text":"Service was beyond excellent.  The food was fantastic.  I wish the menu had a Few more opt","useful":0,"cool":0},"skwctgcpQSGx3TW-kLqB7g":{"text":"Fried bread is soooo yummy!!\n\nDefinitely worth a stop - Brussels sprouts are a terrible, l","useful":0,"cool":0},"XYX_pEp2FZ7OIiOyaoKOXQ":{"text":"On Wednesday night, I had a very nice dinner date at Peche.  The seafood salad, the roaste","useful":1,"cool":2},"tJ0rj1VcG5Bf_WRSFvNoUA":{"text":"Very very good food ! Service was beyond excellent. \nFood is served fast, and the staff is","useful":0,"cool":0},"dsnrmd47E0-lwx7hWh4s2g":{"text":"We had a reservation at Peche that happily coincided with our first Mardi Gras parade.  We","useful":0,"cool":0},"Vhc6XY5VahdHkFO25IOtYQ":{"text":"This place is Incredible - NOT once but TWICE i went there with a reservation and after a ","useful":2,"cool":0},"DGmTpFoNr49NKDLwJn9b-A":{"text":"My boyfriend and I went here around 6 on a Friday  afternoon. We were seated immediately a","useful":1,"cool":0},"JPNRSa9BR6Usvz9Jcu8XTw":{"text":"On a previous visit, the food and service was outstanding.  Tonight, it was a train wreck.","useful":0,"cool":0},"mWQgTX-wwqKCVgutzEvx7w":{"text":"I have seen advertisements and show segments for Peche, which spoke very highly of it. I w","useful":1,"cool":1},"KSkitfvhZzQz3J-X4t7YYQ":{"text":"We went here just for dessert and cocktails. The key lime and salted peanut pies were outs","useful":0,"cool":0},"6gMIFkL7JzMbdc91DO8XOg":{"text":"Once again, the Link Restaurant Group has a winner.  Peche doesn't feel like \"another one ","useful":0,"cool":0},"4OfUOW888LIgWSkf16qOKw":{"text":"Another amazing New Orleans food experience recommended by yelp. Whenever I come to NOLA I","useful":1,"cool":0},"RTSbp3oLYQaegFP2d73mOg":{"text":"Great Food in a comfortable laid back atmosphere.  Service is very competent and well trai","useful":0,"cool":0},"kmXM2CBrSuJcrmOSVAkbpQ":{"text":"This place is a must go in NOLA. I won't say it was a surprise since it is such an awarded","useful":1,"cool":1},"MIBW273HmaaCQwqWAqrMzQ":{"text":"We did not have reservations but were sat at the oyster bar. We had a wonderful unrushed e","useful":0,"cool":0},"OVBRfqF6sHxlR2lDb0l_Zg":{"text":"Fried brussels sprouts w/ chili vinegar - amazing. My better half loves them so much after","useful":1,"cool":0},"uebskFk-3oWfou3fIE6kww":{"text":"I had high hopes for Peche and was disappointed. There were so many promising reviews but ","useful":0,"cool":0},"YaRLt4UgaKH0fAQdf0T8NQ":{"text":"Great small plates! We stopped in to cool off from the summer heat in the city. Cheap beer","useful":0,"cool":0},"_qCmikbWKWC7YOejs1z5ZA":{"text":"First night in New Orleans and came here for dinner. We had reservations which made for no","useful":0,"cool":0},"TjlVS-c9cbXwEaf_aFnMDw":{"text":"Waited 15 min for spots at the bar during Jazzfest and had an amazing meal of small shared","useful":0,"cool":0},"Fh_xcx6KqzVqCNduSfGJvQ":{"text":"Disappointed.. Kinda snobby service.. Went and had various small plates today. Was so exci","useful":0,"cool":0},"q_sfhsGGvSRo6MrfG5ZSlQ":{"text":"Peche is amazing! It is gorgeous inside .. A rustic elegance with open air beams & pure be","useful":1,"cool":0},"tzSO0aQ-gdivw6tBEdUzog":{"text":"Man they just did everything right from start to finish. Service was on point too. Had the","useful":1,"cool":2},"49fySbNpg4zcqjc785WuRw":{"text":"We decided to try Peche for our Mother's Day dinner after reading reviews on Yelp. We were","useful":0,"cool":0},"cvsiPEly-23UYTeMR4h-sA":{"text":"Came here for dinner. Big wait on weekend but we were seated after 1.5hrs. nice relaxed vi","useful":2,"cool":0},"LXVks2kq0tI3mK3HCDTiig":{"text":"Nice spot aesthetically! I enjoyed the skirt steak, potatoes and Brussels. Everything was ","useful":0,"cool":0},"00PM4Ob5sDIhVeLiGtDy6Q":{"text":"We recently visited New Orleans for the weekend, and our Saturday lunch at Pêche was easil","useful":2,"cool":1},"DeA-vavIssmprTWgOoTF9Q":{"text":"I was expecting more from this restaurant... This is a typical seafood restaurant . Overpr","useful":0,"cool":0},"nM6ki9AFedR5A7ujoxRd3g":{"text":"I was a regular. Great service, drinks, and food. I've had dinner maybe 2 or 3 times and i","useful":2,"cool":0},"bj0SYrN59waZ0UWb_m6WrQ":{"text":"Disappointing experience. Started off poorly; our server was like a used car salesman and ","useful":0,"cool":0},"cYbM4Ge19I3NyKcYculkYg":{"text":"Terrific lunch before the St. Paddy's Day parade in the Irish Channel.  A really fun, enga","useful":0,"cool":0},"M_vTlhG7Px2R5kpMbH3ThQ":{"text":"Great atmosphere, great staff and great food. \n\nThe Macarel app and the steak tartare were","useful":0,"cool":0},"h0I0B5RC9Z76bZ-nGJHznQ":{"text":"This place has a nice ambiance, couple James beard awards, nice staff  and much more. My s","useful":5,"cool":5},"xHy-SFhRuTIAsuuam_7_vw":{"text":"Came here for seafood. Everything was fresh and very good. It's 4 stars because of the jum","useful":0,"cool":0},"LxR_qJN3ljCSLluSi3JTxA":{"text":"The fried fish sticks and fried bread are amazing.  I can make an entire meal on that.  Th","useful":0,"cool":0},"czsYEGs7q1lpI8zXX9z38w":{"text":"Every bite at this restaurant was superb!  We started with raw oysters that tasted like bu","useful":1,"cool":0},"KZIgYR_nzuyCY0VyZVf0XA":{"text":"Pêche has been on my bookmarks for some time now and I'm happy I got to finally try it out","useful":5,"cool":2},"t7MCskzNs8mnVWpVXAwMoQ":{"text":"This would have received one star if it hadn't been for a completely random employee (NOT ","useful":0,"cool":0},"jWRA5Dl67fsRP3JCbOYIhw":{"text":"Peche was recommended by our cab driver on our way from the airport and was walking distan","useful":2,"cool":1},"A3okp1vfWsPKBJH33UbSgg":{"text":"Walked-in and sat at the bar. Really good and fresh food. Loved the flavors in the food, t","useful":0,"cool":0},"g_soaRMpx0XSwMgjYjDxQg":{"text":"Two words...Scott Bakula!  If it's good enough for Scott Bakula, it's good enough for me! ","useful":2,"cool":1},"GTopp4JUvH-GoS0-MkcmfA":{"text":"My friend made it her personal mission to eat at the best spots NOLA had to offer. After a","useful":4,"cool":1},"FM_c0mUVNseoFNlAX_rGyg":{"text":"I was visiting New Orleans with a group of friends for a casual Bachelorette weekend. I ma","useful":0,"cool":0},"MkpaWOzLtbqMunkrFCfIsg":{"text":"One of the best restaurants in the city. Wonderful experience every single time. This plac","useful":0,"cool":0},"KK928KFcoYJ-hA06FsVA0A":{"text":"I visited in the summer of 2019. The service alone earns this restaurant a lot of recognit","useful":0,"cool":0},"Br1l9EyjZMAEF7_dZA3r7w":{"text":"Everything I had here tasted amazing!! I was a bit surprised of how busy it was for a Sund","useful":0,"cool":0},"yT8668UVnOzQhYdI-BzWqA":{"text":"I completely understand why Peche is so H.O.T., this meal was perfect!\n\nOur first meal in ","useful":2,"cool":1},"7gpjvfNh4TaqrLBZTUK-8A":{"text":"A very good fish restaurant...  Limited menu but they concentrate on preparation and it is","useful":0,"cool":0},"Dtj8c1Oh3uom0IVXCMHVfw":{"text":"Fresh fish with the New Orleans fair!  We were a group of 12 for lunch so we had a chance ","useful":1,"cool":0},"1g_AyEgpQXSxCTkvezEKSQ":{"text":"The Gumbo was burnt. Hush puppies was burnt to a crisp.. we waited 1hr before we got our f","useful":0,"cool":0},"Z-rqCw43z8ZRn7uzu8uG8Q":{"text":"My husband and I work in the restaurant industry, we got a late start tonight and trying t","useful":0,"cool":0},"rQ4_a3WNT1H11UG7OHsz2A":{"text":"Elle and Heather killed it tonight! Amazing service by the two of them. We just got home f","useful":0,"cool":0},"oQIO6WT9I-xZunV39KYd_A":{"text":"It's a must if you enjoy amazing meals. The beef tartare is quite untraditional but even b","useful":1,"cool":1},"ou2DYUs9j_8xZC2TNh54UA":{"text":"Not terrible but....meh. \n\nHad 2 crudo/raw fish appetizers, one of which was an absolute h","useful":2,"cool":0},"McDhTCgXtOZ3W3DHgp1uzQ":{"text":"Amazing meal. The drum fish was unbelievable. Everything we ate was great. Great atmospher","useful":0,"cool":0},"MrG0UBXRcX4pI39c_aUpEQ":{"text":"This place completely exceeded my expectations! Started with the spicey, ground shrimp in ","useful":0,"cool":0},"C48_NO-Lxo8txc5Y2KuTdA":{"text":"ate a big fuckin fish hot mm Mmm MMMM. calibration, baby! \n\n\nand just a five minute walk f","useful":0,"cool":0},"TPm8S80WkBj5zptuF0MJ7Q":{"text":"Visited Peche on Tuesday evening July 22nd. Enjoyed a Mexican Coke, grilled Shashitos, Chi","useful":0,"cool":0},"61ggn38J79EYKHfuP5hHaQ":{"text":"AWESOME.....The food was absolutely divine...The service was spot on, and the overall expe","useful":0,"cool":0},"Jug36-y5U3NNqHrKP92avQ":{"text":"We had a great experience at this amazing restaurant last night! First, service could not ","useful":1,"cool":0},"rAHMhWhmvhwbuJ_wwpcw4Q":{"text":"BEST SEAFOOD place in New Orleans! Not touristy, excellent flavorful dishes. We went 3 tim","useful":0,"cool":0},"EE8rhmylghkxy-ps4bX07Q":{"text":"Love the oysters and drinks. \nService was awesome. The beer battered fish was delish.","useful":0,"cool":0},"f8TgC-FfWReHW2cmDWMwYQ":{"text":"Ambiance is a 10' Amazing food. Great customer service. Nothing negative to say about this","useful":0,"cool":0},"SsLhnWw6wiVLZgWZbZZIIQ":{"text":"So Paige had two birthday dinners. Peche was pretty cool. Very cool ambiance. Nice locatio","useful":0,"cool":0},"h-173SHrvxe8A4yEqmSxgw":{"text":"Wow. Where to begin?! \n\nAmbience is great, perhaps a little noisy. But they decorated so n","useful":3,"cool":2},"iir9uM8OI53U0LlESvmnkw":{"text":"Service was outstanding. Bar was hopping but everyone was personally attended to. Gotta ha","useful":0,"cool":0},"VViaQZPL4oIfdfKvCfwZUg":{"text":"I've only been here once and that was a few years back during my first trip to New Orleans","useful":2,"cool":1},"9M2bJyWU5N9JLVjGOxqVKg":{"text":"Pêche was simply divine! I was blown away by the flavor of every dish! Highly recommend th","useful":0,"cool":0},"1oyt0iP2FrkEVEi1Ply4Ug":{"text":"Peche, how I love you. Let me count the ways.\nYour wonderful friendly staff made us feel w","useful":0,"cool":0},"5tuiqc9inasVPBy4ndY1oQ":{"text":"The greens salad, chicken Diablo, and  potato side dishes were absolutely incredible. Beau","useful":0,"cool":0},"C5Ed7-NB2i7DIoZKoYoe3A":{"text":"Bad food\nBad service\nThe chef's only claim to fame is that he knows how to use a salt shak","useful":2,"cool":0},"79zPh7p0m5HTqGI6QWnIGA":{"text":"Outstanding! One of the best meals I have had in a while. I love the interior. Great wood ","useful":1,"cool":0},"ssCQ0CuIpnbVNnjHCAa_mA":{"text":"Very helpful staff. Very nice decor and cool\nVibes. Food is good but doesn't live up to th","useful":0,"cool":0},"1bkCsEGJlrnyMxTlcFmGYw":{"text":"4.5 \nFour of us girlfriends chose this spot for our pre-Beyoncé concert meal. We were quit","useful":0,"cool":0},"6_ggx2uwuF2PtH6dMp-djQ":{"text":"This was the best meal I have ever had! We came for my birthday and everything was perfect","useful":2,"cool":1},"myo9PW9Z8U730IiLt519UQ":{"text":"74 dollars for a grilled fish that is not deboned at the table by staff?  And when I appea","useful":1,"cool":0},"ySzuD8hiYlGQ5VQ9CGTPUw":{"text":"Ok this place is crowded all the time for a reason!! Such a delicious menu. I got the spec","useful":0,"cool":0},"5Htjgj-eLe1SMQHqIDWfvw":{"text":"Pêche was our first meal the minute we landed. We had reservations for 8:30, we got there ","useful":1,"cool":1},"nC3z4bYlGd7yiCToI1jQKg":{"text":"Fire ! Smoked tuna dip is da truth ! Also recommend the swordfish or smothered Catfish","useful":0,"cool":0},"ypdRM_DGofo1sXftYtuqAw":{"text":"My wife and I popped in for a cocktail and an appetizer. We ended up ordering several oyst","useful":1,"cool":0},"3GMJC8B7Ty_fOriuuhlHuQ":{"text":"Fantastic food and cocktails.  I got the large shrimp dish with a cabbage-grapefruit side ","useful":0,"cool":0},"-yBhXGHGhqZCIxJSQoSknw":{"text":"My fiance and I were super excited to eat here, and have been looking forward to it all da","useful":1,"cool":0},"MCqSJ-SQM2f0gMaulHwRMg":{"text":"4 stars. Ran out of a cocktail on the menu.  Small portions. Nice spot. But everything is ","useful":0,"cool":0},"T-21DRq30zWUUGtXgQEyNA":{"text":"A solid seafood place, though the price point felt a little higher than the quality. For a","useful":0,"cool":0},"cAlx1uUj_dmKaL-jYCYkPw":{"text":"We went here for my husband's birthday last Saturday, portions are good for a couple but i","useful":0,"cool":0},"PJo4GUdi-k-ZTQD-C7qD-Q":{"text":"My first meal in New Orleans was a total success thanks to Pêche. The seafood gumbo was ab","useful":1,"cool":0},"FHPkSH3B2PgTy_DgEz5FYA":{"text":"This was the number one recommended restaurant when my family got to New Orleans.  And it ","useful":0,"cool":0},"B4gHq6ardczFSzO4Lxex1w":{"text":"My husband, mom, sister, her boyfriend and I all ate here for dinner. It was amazing. I lo","useful":0,"cool":0},"kN21NkVgwmSRBaEQVgHKoQ":{"text":"Amazing food, one of the best experiences of culinary New Orleans. One of the few restaura","useful":2,"cool":1},"faEqk6ZUaoyT2cxaqqjsZQ":{"text":"I gave this restaurant a few months to work out any kinks they may have had.   It seems th","useful":1,"cool":1},"3DX-zYww75QUhzggdb6ciw":{"text":"The chef whipped up a delicious vegan meal of curried vegetables that was not on the menu!","useful":0,"cool":0},"4yRJwrtFuyz_U87Kax-Alg":{"text":"Items Selected:\nShrimp Toast with Bread and Butter Pickles\nSeafood Gumbo - Dirty Rice, Dar","useful":2,"cool":5},"uF0ZaseghmwZMNxj7NdUWg":{"text":"I pored over so many fine dining restaurants' menu before deciding that this would be the ","useful":4,"cool":2},"y_WB3Je4A6j-wM0VGZTKTA":{"text":"Love the vibe by the bar area. We went for a glass of wine and enjoyed the Nebbiolo. The b","useful":0,"cool":0},"cCk37M0Ep0M3K8AppO9eZw":{"text":"I went to Peche earlier this week for a business lunch. The food was absolutely delicious.","useful":0,"cool":0},"l_mdONiVCwTOeudh3vYdmg":{"text":"Not impressed at all. Hostess was very rude and unfriendly. Seafood was ok. Cooked food wa","useful":0,"cool":0},"m0mnJbNzXTYg1Kf4jrFtMg":{"text":"1. Nice, open, clean space, fairly friendly staff albeit only 65% attentive. Was served a ","useful":6,"cool":3},"V8Fizyllo2AiGZ6uMgemYA":{"text":"Terrible customer service when it comes to parties of 6+. We had reservations. Tried to pa","useful":0,"cool":0},"3QCvsCTSjhog3tXCJ6mjRQ":{"text":"Seriously the food highlight of our trip. \n\nService - Professional, attentive. They treat ","useful":0,"cool":0},"M7YfoH6qIrM2M38YqVmp7Q":{"text":"Fresh oysters, very limited seating. Recommend making reservation even weekdays at 5:30 is","useful":0,"cool":0},"UmQ_fshd4K_J9L4nGgld4g":{"text":"The only reason I'm giving Peche, my favorite, 4 stars is because when we arrived and the ","useful":0,"cool":0},"4a3OjFVSYjB2E72mxv5JOg":{"text":"We sat at the bar which is what we prefer. The bartenders were friendly and knowledgeable.","useful":1,"cool":0},"pokzfai9ZjSSTA5tNJ_4nw":{"text":"I had a fantastic meal here for my birthday. Everything was delicious. The service was att","useful":0,"cool":0},"3u3HP8_jwU-zPBECc8we8g":{"text":"We were looking forward to an excellent meal based on reviews we had seen.  Boy were we di","useful":0,"cool":0},"RLA0xG0PrCm7yHCpP4wiRQ":{"text":"Peche is consistently a great choice. Last night I picked Peche to catch up with foodie fr","useful":0,"cool":0},"FIglb8htnP9htTgxrbFilg":{"text":"Loved this place.  Stopped at the bar and had fresh oysters and the grilled shrimp.  Both ","useful":0,"cool":0},"QH4RRogr4qPV2vfXdlvn0Q":{"text":"This place ruined my birthday: negative attitudes from the hosts when we arrived, erratic ","useful":0,"cool":0},"QZzRMgM9i7fZ8E1V7kSd8A":{"text":"Fabulous.  The crab claws were amazing.  The apple cake and sour cream ice cream my new fa","useful":0,"cool":0},"D_9eR1N2aE_Vc3aBqH1ScQ":{"text":"Cannot say enough great things about Peche! Our waiter was friendly and made great recomme","useful":1,"cool":1},"IajTV4YKPj5zkQ96mv2zXQ":{"text":"The redfish with salsa verde (chimichurri sauce made of cilantro) was super delicious. App","useful":1,"cool":2},"dJ7COqyISy0FeAuzU6UgFw":{"text":"This place is rated one of New Orleans best restaurants for a reason.  Wow, their food is ","useful":0,"cool":0},"J-H0GRhAUdoYQCeglNu4FA":{"text":"Amazing food! One of my favorite dinners in Nola and the oysters were soo good! The drinks","useful":1,"cool":0},"bp6NNMc3z4wFLEkRNomhEg":{"text":"This is my favorite spot for an early dinner at the  bar. Oysters, Fried Bread, and some g","useful":0,"cool":0},"X7gJEdIMa2GiDT0f2wvETw":{"text":"Very good quality food but not what I'd consider one of the best seafood restaurants in th","useful":0,"cool":0},"klurQZvrJv4fYTpO9NcluQ":{"text":"The best description of Peche I've heard so far is Donald Link's seafood version of Cochon","useful":3,"cool":1},"zF7PJKDEJcJJaoeIhGdIsw":{"text":"Food is great but the attitude of the hostess warrants my rating. The restaurant has a rid","useful":0,"cool":0},"P3GYDBpjIJ7bXh4gIU-oBg":{"text":"Alas!  I was really looking forward to dinner here after reading reviews.  The evening sta","useful":0,"cool":0},"bDsFtFzR9rlu7LokXKWRrw":{"text":"Peche is the best seafood place in the city!  Food is creative, delicious, and the service","useful":0,"cool":0},"cjXucrYZkXQtwwvWWX4-Jw":{"text":"Absolutely fabulous meal! Being presented with a whole fish with head and all is a bit out","useful":0,"cool":0},"5eAHRY8XIuJuK7QOWciypA":{"text":"My husband and I went with two friends for dinner while we were in town last weekend. We h","useful":0,"cool":0},"xJ25zekAI9RtEVjiqi-rTA":{"text":"Every time I come to peche it never disappoints! Whenever family or someone comes to visit","useful":2,"cool":1},"Dn1fOIxBFmCuacCBsYdjeA":{"text":"I can't speak highly enough of this restaurant! Everything I've had has been excellent. If","useful":0,"cool":0},"OiRnpHBB8SR3ilRSUWMhkw":{"text":"One of my top 1o dinning experiences, ever!  We sat at oyster bar.  Very nice, tasty raw s","useful":0,"cool":0},"HSesI-xJkVM51kIyiZ5pmw":{"text":"Absolutely DELICIOUS. \n\nEverything you order will be delicious. The raw bar was my favorit","useful":0,"cool":0},"alV8C-aeQU07jQkCrMKNZQ":{"text":"The restaurant is beautiful with lots of charm. Our server was a sweetheart. Too bad the f","useful":0,"cool":1},"Yce_VbfpqfUT6v-cPJEs6A":{"text":"One word...fantastic!  Loved everything about it.  The bar was great and sat close to the ","useful":0,"cool":0},"Po5ZoqqOYL--zx9a_vmxzQ":{"text":"The best whole grilled fish I've ever had. Definitely worth going here multiple times.","useful":0,"cool":0},"0ll8-jSXJ_xeYOtZ_gYTvw":{"text":"Nice place, highly recommended. I went for a lighter lunch on a Sunday and sat at the bar.","useful":0,"cool":0},"FFZF9DcJIyg-srgrnHcJVg":{"text":"The staff were very friendly. Food arrived in a timely manner. The crab bisque was very fl","useful":1,"cool":0},"hpmcn3LXqna0wEKxltepWQ":{"text":"We loved this place. Great service and great food. All appetizers were great but do try th","useful":0,"cool":0},"v4gKLUjgb23QlwgAIokDyw":{"text":"Great spot. Unique menu. The tomato & goat cheese salad was excellent. The presentation al","useful":0,"cool":0},"6-bFH_xfk8orLLdYczxk8w":{"text":"Do not miss out on an opportunity to eat at Pêche. This experience, staff, food, and prese","useful":1,"cool":1},"MoDfscr3vtOvpemwBOVyTg":{"text":"Very tasty and not overly expensive. If you don't eat fish then there aren't really many o","useful":0,"cool":0},"1Dzq7i9LHh0Q9KEvON3kMg":{"text":"Tasty, but waaaay over-priced for the portion size.  We spent $120 and left hungry.","useful":0,"cool":0},"W_QckCk00hD7y28j8bOw4A":{"text":"There are seafood restaurants, and then there are restaurants like Pêche that make you rea","useful":0,"cool":0},"K_MO-8UaCfzLi4HrEekvDA":{"text":"The fact that this place isn't a FIVE OUT OF FIVE makes me question the meaning of life. H","useful":2,"cool":1},"BARG4YaVD12DpT-S0BxVDA":{"text":"Food was AMAZING! The Brussel sprouts and squash soup were TO DIE FOR! I got the drum fish","useful":1,"cool":0},"NIaT1rp8n8J9JU-m8Wu0rQ":{"text":"Great seafood restaurant. Grilled fish and frieD fish. Definitely one of n m y favorites","useful":0,"cool":0},"YjQ56af3cQ5XOjqAWDEkAw":{"text":"Absolutely fabulous dinner! Hands down the best gourmet fish sticks ever with homemade tar","useful":2,"cool":4},"YgbEvXvXLPmyu2LxYdJ7XQ":{"text":"Been in town 5 days - been to Peche 3 times. Why?  Because every time, I describe it someo","useful":0,"cool":0},"g5nyeOJ7qVl2_g7a0ICjFw":{"text":"This place is amazing. We sat at the raw bar which was a great experience. We got to watch","useful":0,"cool":0},"l7_tB0gYcYMiWVozcOp-7g":{"text":"Solid food- friendly bartenders!\n\nThe baked drum was ordered on a recommendation and was e","useful":0,"cool":0},"sgUHkMCjeOrdeW1fQaSURg":{"text":"Liked my shrimp roll. The sauce was vibrant and stacked with celery flavor. My appetizer o","useful":0,"cool":0},"7h6IT78Yb6wxCGq9RfjVxw":{"text":"I have been coming to NOLA for over a decade, and this is one of my top 5 restaurant exper","useful":2,"cool":0},"EZsie3mfX304tBuMtpg1hQ":{"text":"This was an outstanding restaurant. As out-of-towners we cannot wait for another trip back","useful":0,"cool":0},"RR_ldAlVnu78UtPG2C1ABA":{"text":"Server: David. The steak tartare. Oh em geeeeeeee. Freaking melts in your mouth freaking g","useful":1,"cool":2},"t4pJZrqaAljJqmgA1QLLnA":{"text":"The food was delicious! I had catfish w/pickled greens (I normally don't eat catfish but i","useful":0,"cool":0},"Qs0Zgp_Mbum_B-KVQTd_bg":{"text":"This is currently a very popular restaurant - so make reservations. We went this past Satu","useful":0,"cool":1},"-8nae638bYHymlSk14oPZw":{"text":"Too many overbearing flavors in the dishes that didn't mix well. Wasn't horrible but wasn'","useful":0,"cool":0},"PIBUxf0o0d-bHFUGG-bw0A":{"text":"Found this spot courtesy of Tanya the owner of Rock n Sake Sushi.  Tanya sold me NBA playo","useful":1,"cool":0},"IXOwV5YkaobmB0450VE6jg":{"text":"We enjoyed our repast at peches' fish restaurant..,Lunch was casual..friendly atmosphere..","useful":0,"cool":0},"PSwGeNWfNXfxyAZhfEcOHg":{"text":"We had a whole fish with salsa verde and it was way too salty. The appetizer was heavy on ","useful":0,"cool":0},"vMiaIj3hoTcl1Bk1ldf1lw":{"text":"Pretty nice spot overall but food was too heavily salted and did not stand out compared to","useful":0,"cool":0},"WK__R31Mt6lWzjHt6fNquw":{"text":"I've been twice and had a phenomenal meal and service each time! Fun, upbeat atmosphere! G","useful":0,"cool":0},"ZxwPELxArHKxaCo3qYpNUg":{"text":"Friendly staff.  Have no clue about restaurant management.  Service was horrible.  Food th","useful":0,"cool":0},"JapQfzYah6Pp3G3Ltl3uDg":{"text":"I absolutely loved my experience at this restaurant. The atmosphere is clean and beautiful","useful":2,"cool":0},"z1jtx6xBoq_cYxta0myS0g":{"text":"Came here for a birthday celebration and the service was great. Steak tartare was really g","useful":0,"cool":0},"SIUaMaf5XWxqRvp65vw79w":{"text":"Simply put, a crazy derricious lunch filled to the brim with shellfish and damn tasty gulf","useful":3,"cool":1},"AHpeeO1oW_xUD5eTFCreIA":{"text":"Beautiful restaurant.  Very close to WW 2 museum. Had a very enjoyable lunch.\nPumpkin and ","useful":0,"cool":0},"jT703U__NUi5nz2hG-cY4A":{"text":"My favorite new eatery in NOLA! Located within a short walk of the WWII Museum and the Hig","useful":0,"cool":0},"CG9hNb9JmJuwC3l031SymA":{"text":"So I get that in NOLA, tourists and locals overlap in restaurants way more than in other c","useful":0,"cool":0},"vjoB6Zh8XChGAs3VyBK_aQ":{"text":"I highly recommend.  The setting is hip and active.  We started with a mixture of Alabama ","useful":0,"cool":0},"DsrkrSRrSTfC5qKgrltgsw":{"text":"My second visit here and still delicious. Great atmosphere, cocktails and the fish of the ","useful":0,"cool":0},"_5H2cFT2s6S8IefKxWY32w":{"text":"Service blew it out of the water, no pun in tended. Glasses of water with ice from top to ","useful":4,"cool":2},"ZTB2ONTq6M7CZQaQIGsexA":{"text":"If you're Black, you probably want to stay away from this place. Forty empty seats and the","useful":2,"cool":1},"oVv8kVR_CE2UUZXHb9oacA":{"text":"I was so impressed with every dish that I ordered here, and every bite was better than the","useful":0,"cool":0},"Gk71xPxFE1ker6EPT-3LOA":{"text":"Last year we stayed in the CBD and passed this place several times on our walks back to th","useful":0,"cool":0},"iNopszi1RN3-NtRTOrbfgA":{"text":"Great place and very nice environment .. we got the whole fish, shrimp salad and Brussels ","useful":0,"cool":0},"HycN7DIn7fcqLRc_7UCNGA":{"text":"My husband and I stumbled upon this restaurant and I'm so glad we did! We didn't have a re","useful":0,"cool":0},"Q-t0tdh48aa_y1W-C9cutw":{"text":"I walked in and was told that we can get seated at 8 pm. Spoke with an unprofessional look","useful":0,"cool":0},"lc1jG7m6rwP2uduSxssAuA":{"text":"This is the worst dining experience in the last year.  The space reminds me of a crowded s","useful":0,"cool":0},"S4Cl-2oaALA7wjpgff9iIg":{"text":"Okay so I wrote an EXTREMELY long review and I couldn't post it. So here's a dumb down ver","useful":2,"cool":1},"snNFdepVcX4fx1OUu-CxLQ":{"text":"Great lunch visit. We ordered several small plates and were not disappointed at all.  Fres","useful":0,"cool":0},"iYCUaovZX_I2-ix0-229Kw":{"text":"Wow and wow the best seafood in town,had a assortment of the small plates and they are del","useful":0,"cool":0},"Gzn5Tp9wNT4FXCFwT9-7SQ":{"text":"We made reservations a month in advance to celebrate my daughter's graduation from Loyola.","useful":3,"cool":1},"CCsllCeJl4JKB6ybbj2eTQ":{"text":"What a good find!!! Definitely the best meal I had this trip and I sent 3 other groups her","useful":1,"cool":0},"cgEc2EfFo6KF6xh0GBXzXA":{"text":"Possibly the best meal I've had in the city and hands down the best fish I've had here, wh","useful":3,"cool":0},"SNcn6KdHZbB3ZFDsz9dhEA":{"text":"Best seafood we had in NOLA. Red snapper collars were absolutely perfect. Brabant potatoes","useful":0,"cool":0},"FEA9n1YkvmnSy7D5Eusbew":{"text":"Ordered two different things and both tasted terrible. One of them was a plain green salad","useful":0,"cool":0},"IDk_iimDByZiW9L6YbJ9Yw":{"text":"One of the better restaurants in NOLA. Peche is up there with G.W. Fins. You must also mak","useful":1,"cool":1},"tSvYsuTtePZFPC1Ba_P4QQ":{"text":"Very cool place. Excellent drink menu and the food was phenomenal. Highly recommended","useful":0,"cool":1},"yXLbPQ0_cFoVlIkG9gzphQ":{"text":"At a place such as this, you'd really expect professionalism. Unfortunately this wasn't th","useful":3,"cool":0},"ZdmNboo52UvXhQSKRnCrrg":{"text":"I want to thank the amazing host, Jaques, for being so accommodating. When hosting friends","useful":1,"cool":0},"MS0dXbPAUPLHq-EqEEkdkg":{"text":"I came in with a party of 16 for my daughter's graduation. They were helpful when I made t","useful":0,"cool":0},"cPMPtKCjcBJYuC4QoH1nTg":{"text":"When I visited Peche for dinner it was my first meal in NOLA on my latest trip and it was ","useful":4,"cool":2},"gcpLCs_Cwci06pkuo6cbSA":{"text":"Wow great stuff. My husband tried the oysters both Louisiana and Dauphin, he said both wer","useful":0,"cool":0},"K_fLo4-5mmGvh6upI1ZuUA":{"text":"The best meal we had in New Orleans! Everything about this restaurant was just outstanding","useful":2,"cool":2},"mi7VKUWFOdk9CI6UavTnSA":{"text":"My wife and I lived in NOLA for two years before moving to CT in 2013.  We sampled many of","useful":0,"cool":0},"VUMnZHM40F_q8nHcxMMmQA":{"text":"One things I have to say for this place was I couldn't get a reservation!!!!\nLast time whe","useful":1,"cool":1},"jhwcxd2rlQZJgDqVv5RPJA":{"text":"We had the fish sticks, shrimp soup, potatoes and chicken bites. All were phenominal excep","useful":0,"cool":0},"ZtsSZ273kzOUkbXSF5F7dA":{"text":"Recommended by a local- sooo glad he told us to check this place out. Seafood Platter was ","useful":0,"cool":0},"aSzb8lNG7Cx8lgNQl4CZsQ":{"text":"Excellent gumbo, great service and cool atmosphere. Ingredients were fresh and oysters wer","useful":0,"cool":0},"y_15Iu2yyw8vZJIK0x_d6Q":{"text":"Most people who read this will not care or have any concern about my experience and that's","useful":0,"cool":0},"ral2ylB87bkKE2T7-7sw4Q":{"text":"AMAZING! Sat at the bar with two friends (first come, first serve so make friends with tho","useful":0,"cool":0},"QYrq1__CCdouHnRohm7d_Q":{"text":"On many lists, and should be on yours. \n\nCreative and delicious on levels that are 5+ star","useful":2,"cool":2},"UccZka_UdjHfHzKI0vl5CA":{"text":"A rustic, trendy spot in the Warehouse District where you can enjoy some good seafood and ","useful":0,"cool":0},"J8cXCNug5SzswaS0i5twPQ":{"text":"Nice dinner!  Recommend the pasta and seafood croquettes.  Both were a filling meal.  The ","useful":0,"cool":0},"jpjDkYEgeUDIaM6J2W4SMw":{"text":"I was very disappointed with my visit to Pêche this evening.   The food was mediocre. My d","useful":0,"cool":0},"fBY1iDbcXS1_BFXk3N0Itw":{"text":"My friend sporadically got married on a Tuesday.  We came here for lunch afterwards comple","useful":0,"cool":0},"aFiqdeuF8IrzyyjI4GBKWw":{"text":"We walked in and found ourselves a spot right at the bar. Perfect because there was a huge","useful":0,"cool":0},"dZPMz_XZPlda7ByoQNe4wg":{"text":"Peche Seafood Grill is an absolutely beautiful, well-planned concept but some of the dishe","useful":10,"cool":6},"VdnD58vxhlRj0z5miPnTxw":{"text":"Went for dinner on a Monday night with a group of 7. We had a reservation for 7.30 and the","useful":0,"cool":0},"zT7N3tFzSnjFIMGGkQ0ccA":{"text":"This place is killer. And Heather sets the bar for waitstaff. \n\nTwo lunches there this wee","useful":0,"cool":0},"BsQt-MW49xn98gYsPDCLfA":{"text":"Fantastic food, courteous servers, great lunch spot. We passed by the restaurant the previ","useful":1,"cool":0},"cZCgUKLdmxhPd_hNQsBIUg":{"text":"Great experience! Food was great, service was great! Fish sticks covered in beer batter ar","useful":1,"cool":1},"25A_y6t8oPHBzNbCEk3Fow":{"text":"As the sun pours in through floor to ceiling windows, we sipped our spring cocktails and s","useful":1,"cool":1},"hJrGoehRpDrpwScstbsXLw":{"text":"I was engaged after dining at this restaurant in 2014 and I have visited numerous times wh","useful":1,"cool":0},"8Jh4h3BdiE2rfSL5U-w9xw":{"text":"I'm still dreaming about the tuna from the raw bar & the steak tartare toast...drool! Afte","useful":1,"cool":1},"yP9Af_4aTZszZ82j_SfeAQ":{"text":"Went for a late lunch after a morning at the WWII Museum nearby. Started with a platter of","useful":0,"cool":0},"1lpbwy_iazFQCBlgAB1jdg":{"text":"Unbelievably good seafood...We started with oysters, 3 types- all delish....the smoked tun","useful":0,"cool":1},"mgdqCmQVG_eJ6xHegdz4Ng":{"text":"Lots of table availability when I walked in..., since I was dining alone (in town for work","useful":0,"cool":0},"TUQFlgHp0z_btd6CO_jhug":{"text":"Food was good and would have been better if we could have gotten everything we ordered.  S","useful":0,"cool":0},"mTZV2TZYjqOnA_b5YMdR7g":{"text":"Walked into this restaurant after going to the WWII museum. Five star staff are very atten","useful":0,"cool":0},"Ru9-2DAy0YCFq7XMvgQfhQ":{"text":"I really really hate giving bad reviews. In fact I've never given a bad review. And it's c","useful":3,"cool":1},"c39ZzCpiCxdAJLkVw7wIQw":{"text":"Peche  is amazing! I read reviews before going and ordered the Seafood Gumbo and the whole","useful":0,"cool":0},"TqIZvYA6cRI01DQCF0WBtQ":{"text":"The food here is amazing!! Literally enjoyed every single thing we ate, and we ordered a l","useful":0,"cool":1},"hNAg30tOM0eL-ZnPt7UIkA":{"text":"It was a delicious food experience! Only complaint is that they were sold out of most dish","useful":0,"cool":0},"3DRJ2TCv7sKCej4g-Iw22A":{"text":"Casual atmosphere with nice service. We started out with the Lousianna raw oysters. Very f","useful":1,"cool":1},"W0yxE6zzAOfvD17d7MksRQ":{"text":"Great oysters and key lime pie. Stuffed myself silly and loved every minute of it. The atm","useful":0,"cool":0},"rlJGV__HW0sYwqKEcZTmOg":{"text":"Beautiful.  We came on a whim when most of the restaurants in the area were closed because","useful":2,"cool":0},"73y-8lUxXT-p7S0XG7c2yw":{"text":"Very poor service. They let us know when we were seats that needed to turn the table so we","useful":0,"cool":0},"hYyS-pdWfjIWr4JrwYTPbg":{"text":"I was recently visiting NOLA and we just had to try this place. After our first visit we w","useful":0,"cool":0},"wI03ZLsWW1eY9CbIwwOIHg":{"text":"Peche was awarded the James Beard 2014 best new restaurant award in the United States, so ","useful":0,"cool":0},"vasJM9kMKayzm2QEMXrgNg":{"text":"After my flight was delayed for over an hour and a half in La I finally made it to New Orl","useful":0,"cool":0},"coTfXi5l00EuurMWFZKOtw":{"text":"Peche restored my faith in the New Orleans scene. After two days of pretty good food we we","useful":1,"cool":2},"3xl7SF3wKFMYy1ANROmq-w":{"text":"This place is very very good. The wait was fairly long, and that was on a Wednesday night ","useful":1,"cool":1},"3nanT6b5Pb0dpo04RIVYrA":{"text":"The food was horrible we ordered chicken on skewers.   It was under cooked and raw meat. \n","useful":0,"cool":0},"c-TpN7lRcKLdDZ2TLN6f5Q":{"text":"We sat at the raw oyster bar and it was fantastic! The men who were doing the oysters were","useful":1,"cool":1},"GIq-S_4S_MhyxEMmDFZTKA":{"text":"We really loved our meal at Peche.  I'm so happy to see New Orleans restaurants back to no","useful":0,"cool":0},"xWLynLhrf9hxdhIY29vgWw":{"text":"Peche is definitely one of the best seafood restaurants in New Orleans. You can't beat the","useful":0,"cool":0},"nrCZ0zEeqhZHBfDTfOMApA":{"text":"Everything here was simply incredible. Steak tartare, drum fish, whole grilled fish, snapp","useful":1,"cool":0},"gnJx-AlMcXelsuZQaoYLZQ":{"text":"A friend had recommended Peche before our trip - so when I spied it on one of our leisurel","useful":28,"cool":28},"OnJk7Va-nY_85E3k9pyl5A":{"text":"We showed up on Saturday around lunch... got seated and even ordered food... then noticed ","useful":0,"cool":0},"XjPPMoGzxzy_SunfhrtrEQ":{"text":"When in NOLA, I make time to go here. My absolute favourite places to eat. The food is spe","useful":0,"cool":0},"oIPLwQ9Me1BGlvuMryHnlw":{"text":"Delicious! the Hemingway cocktail was so refreshing. I got the smothered catfish and fried","useful":0,"cool":0},"ypvP0Ak7qNxGGIPKY5IaqQ":{"text":"Mediocre overpriced food and rude staff! Food tasted ok. Staff arrogant! Definitely not cu","useful":0,"cool":0},"i39bNwUhqSjomABYTKgxPw":{"text":"It's amazingly delicious . Taste and flavors was just right. Also amazing fresh oysters. I","useful":0,"cool":1},"OUxtOd0zEtQAWXDd2eWIfg":{"text":"Service was not great wasn't to friendly The restaurant was a major disappointment the ser","useful":1,"cool":0},"xvd1WSw4g9G_ycDVf_lFtw":{"text":"I'm NOLA with a group of 7 and decided to take our chances without a reservation and we go","useful":1,"cool":1},"7IxxMcs49HO35PCn5gxyGw":{"text":"Oh my goodness the seafood here is outstanding!  My husband and I came here for dinner on ","useful":0,"cool":0},"MnlBWaL2XaRdMDXjAP-NcQ":{"text":"The food here was FANTASTIC! I have a habit of asking waiters for recommendations and neve","useful":5,"cool":5},"rojXkHM8KGC0OQdaDZ-Jug":{"text":"At any restaurant I would expect used plates to be picked up between courses,fresh silverw","useful":0,"cool":0},"Tq9OA-RG2Uahu8ZvF11I2w":{"text":"I was not impressed at all. I guess you could call this place a yuppy place. At the time o","useful":2,"cool":0},"efpME-6R0baRZjulKB5jZw":{"text":"Perfect service and food on our visit week 3.18.19. It was nice to eat a really great meal","useful":0,"cool":1},"NcHvNX0Sm14kYKrWlavyRg":{"text":"Made easy reservations and were seated on time. Ordered several different items at our tab","useful":0,"cool":0},"MWeh9kKHmSkc31McHyFhZQ":{"text":"We were really looking forward to eating here. The decor is nice, very chic but like other","useful":0,"cool":0},"NzwXKm9LC0CpcybswiGXEA":{"text":"My new favorite NOLA restaurant. It was our first time there so we tried a few of the appe","useful":2,"cool":1},"gM6q6JBATgHMASgje1f7XA":{"text":"Phenomenal restaurant recommended to me by physician friend. Environment and dressy is ele","useful":1,"cool":0},"yMJufTx5TRraqTvLevWavA":{"text":"Spicy Shrimp and Noodles was my favorite. But the chicken skewers were good too! \n\nBe sure","useful":3,"cool":3},"yoWQmuY08VH9pOJrhPLXaA":{"text":"First time visitor! 4.5 stars. We basically went with everything that our server recommend","useful":0,"cool":0},"qqmwthejiCvd9ZS8emV8LA":{"text":"My friend recommended that we make a visit to Peche during our trip to NOLA and I am so gl","useful":2,"cool":2},"MdHHXACsBE0-DCw4svzLgg":{"text":"Innovatively prepared fresh fish (go ahi), deliciously delectable cocktails, and don't ski","useful":0,"cool":0},"gJa7fvnT8kcjyFzVvFu1EA":{"text":"One of my highlights from New Orleans! I enjoyed their oyster and beer selection!!\nI would","useful":0,"cool":0},"0O-3eA7Rzf-dfiaDPOa3CA":{"text":"Good oysters, good Brussels- cool spot. \nGood location- good to finally see New Orleans re","useful":0,"cool":0},"1YJYlJa0GXgOnfvdpHbzjQ":{"text":"Amazing restaurant with great food! Without a reservation there is typically a wait but yo","useful":2,"cool":1},"MChPwK_vGC8aBxdBDI5y1A":{"text":"What absolute delight!!! During the pandemic i have learned to lower my standards for serv","useful":3,"cool":0},"CcAtnHKgFVgNkO6YaL_3pA":{"text":"I was in New Orleans for a conference and my plan was to stick to more traditional  New Or","useful":2,"cool":0},"CrBEcTpMzH4FBWvPUSdCqg":{"text":"Guests of a trusted business partner.  Dinner, drinks - good company.  \n\nService - 5 stars","useful":0,"cool":0},"8BeIG-MDGv8VP5qyGhSHaw":{"text":"You MUST go here: the food, the staff, the drinks, the atmosphere, THE FOOD!!! Bryan at th","useful":0,"cool":0},"nOkrOSzF2ZyRsblNaqnpWA":{"text":"In planning my bachelorette party, the one request I had was that we go to Peche for dinne","useful":1,"cool":1},"WyDWBvoXwxRwBZcUtME7ig":{"text":"This place is the real deal. Easily one of the best restaurants in the entire city. Great ","useful":0,"cool":0},"NqVnKIA56hOQ4l86mgDnJw":{"text":"Best fried fish stick I've ever tried. So crunchy, fresh, and tasty. The oysters are amazi","useful":1,"cool":1},"MlLZBZLgVZkRueyISPaESg":{"text":"Ate at the bar and it was wonderful.  Tim (the Enchanter) served and guided us skillfu8 th","useful":0,"cool":0},"sbFqYWF9Q8jZLSH-ftwrXw":{"text":"I've always enjoyed Peche. I've been here for family lunches and grown up dinners. I've be","useful":18,"cool":13},"cjXF6qji1JTuanOBAVU67g":{"text":"The Food was amazing!!! Our waitress Shimika was so wonderful and made us feel right at ho","useful":0,"cool":0},"SaIC3j5TiGKsSPitnkU-NA":{"text":"Awesome food!! Everything that we tried was awesome... all the food was well prepared tast","useful":0,"cool":0},"sJ8kpJZ1DzdCwXIptxqd9Q":{"text":"It took us 3 months to get a reservation for 4 people for 8:30pm and have all looked forwa","useful":2,"cool":1},"tsR3gElY9se8zkYyo7iWzw":{"text":"Amazing! Every time, everything we order is fresh, well seasoned and far exceeds expectati","useful":0,"cool":0},"Z7IgOizDQ-C9nGeC38QVYA":{"text":"It's been a week since I went to Peche.  And I have thought about this meal almost everyda","useful":6,"cool":1},"LeeLjpuG_o6laboqGOaSAQ":{"text":"This is a nice place. They have enough space to separate tables for social distancing, has","useful":1,"cool":0},"7naQBzX7p3agAkNBVeCRkw":{"text":"My go to seafood place in Nola!  We didn't have reservations but they were able to have us","useful":1,"cool":0},"71-9ORveYastnSoPzLe24A":{"text":"Lovely atmosphere with fresh and tasty raw bar. The BEST Bloody Mary I have ever had by fa","useful":0,"cool":0},"9tPu4eYxPB-YYt-vuHhIqg":{"text":"I was delighted to finally try Peche yesterday, and VERY glad we made a reservation becaus","useful":0,"cool":1},"ul8pN0Z26imlXhrlAUfORA":{"text":"All though I hate to write a bad review but we may have been that one lucky table to get t","useful":2,"cool":0},"pqtWEgAV6T0jJtSlWwhK5g":{"text":"Yes-yes-yes. Eat here. Now. Go. Finish reading after you're back.\n\nThis place is amazing. ","useful":4,"cool":2},"7dUkoexXToG9G-wC_S4Q0w":{"text":"Came back for 2nd times. Food, Cocktails, and Desserts were excellent. Fully satisfied, my","useful":0,"cool":1},"4qahiX7enJhbS4uymnCoUg":{"text":"IN LOVE. First off, this place is beautiful and is in the art district with so much close-","useful":2,"cool":0},"0EYmfbiZxyh1njfk195XXQ":{"text":"Fantastic place! We had a really nice lunch for two during the weekend.  Very nice interio","useful":0,"cool":0},"fTHag2lL5SpmJE7IoDij7w":{"text":"We were turned away at the door cause they didn't have enough seating... they only had two","useful":0,"cool":0},"7SBe-iRAd_Br4OK-sIX1qA":{"text":"This place is bustling on a Friday night. I am so glad I made reservations two weeks befor","useful":2,"cool":2},"J7KmquKTDjBzbupPmUBB-A":{"text":"Great area. Appetizer was great. Food was great. Local beer was great. Was a place in New ","useful":1,"cool":0},"mncrdKoV_Fd9tTgIaZMKvQ":{"text":"Went here for a business dinner. I am not a fan of any \"raw\" bars, and oysters are not an ","useful":0,"cool":0},"LhfFQ9p6vfLUn1ffdbBlNA":{"text":"Delicious. Pricey but delicious. Definitely has your taste buds dancing though it didn't g","useful":0,"cool":0},"sxQFSjTf9ztdTdyRwminiA":{"text":"The smoked fish dip was delicious.\nGood vibes at the restaurant. I wish they had the pompa","useful":0,"cool":0},"qs5SO6SejdMA3U2gs2VluA":{"text":"Just got back from its New Year's Eve fixed price menu and all five of us agree we'd never","useful":0,"cool":0},"P6iHC--r3UwvLBhrTrqo2g":{"text":"Needs help!  Well reviewed and acclaimed restaurant does not meet expectations.  On a Mond","useful":1,"cool":0},"How4aMifvFbXcS2DqVmflg":{"text":"What a gorgeous bar and restaurant. I happened upon this place during a quick NOLA trip an","useful":1,"cool":1},"tSkMHz12Ut2Z66_eInQJxQ":{"text":"Tonight was my first time at Pêche and I was disappointed. Their grilled whole pompano was","useful":0,"cool":0},"a6U7g3RdieWS7cXJOdnRmQ":{"text":"If you are visiting and staying in the French Quarter, admittedly this will be a small dri","useful":1,"cool":0},"qnBZe5aKb-Cuxk3qjTXXTw":{"text":"We stopped here on a whim walking to our hotel from the WW2 museum. And may have stubbled ","useful":0,"cool":0},"H8xMd816eqZLAWHhatV3ug":{"text":"I wanted to like this place more. We had reservations for an early Saturday dinner. I gues","useful":2,"cool":0},"ble3KhPg3JgKgs2Z-DBpqg":{"text":"Wonderful experience, wonderful food. Ian and Gigi were excellent servers and answered all","useful":0,"cool":0},"CnN0YBRcjOoANhVbhrVTXw":{"text":"Great ambience, service, and food! Per the recs of other Yelpers, I made a reservation a w","useful":3,"cool":3},"URYNMCXn6lN_Qtg63SZQOg":{"text":"Pêche was great! Food was wonderful and the service was great, even if she had to deal wit","useful":1,"cool":0},"6YugC8wN7Fq3_ojQpUhOsg":{"text":"For anyone who does a walk-in on a busy Saturday night, you will be asked to put your name","useful":0,"cool":0},"e0LzzffqvGSEotDSZAuMkw":{"text":"This place is Oyster heaven! Too bad I don't eat oysters. My husband thoroughly enjoyed hi","useful":1,"cool":1},"4oMDiDHPxeQ39Zrx9uanbw":{"text":"I loved it. I love Cochon and now I love Peche. We got a whole five pound triple tail and ","useful":1,"cool":2},"2GQhRtzkZwF9Al7XmBAfgQ":{"text":"We ate here twice on our recent trip to New Orleans. Reservations definitely recommended. ","useful":0,"cool":0},"IZOrI_OdkAiYUYJAni579g":{"text":"Overpriced and not enough portions... Service was really slow ... Hit or miss depending on","useful":0,"cool":0},"Y4hZu4CIXFMO6tLfpRflGQ":{"text":"Love this little gem! Definitely try the shrimp roll super tasty. All dishes were very fre","useful":0,"cool":0},"jv7KZaqU2FnxbakTsV-8tg":{"text":"Excellent food and service. Waitress very pleasant and patient while we asked about items ","useful":0,"cool":0},"nLci060M1zDdI6wgVa8z9g":{"text":"Loved Peche and visited twice during my short visit to New Orleans. I especially recommend","useful":1,"cool":0},"1Rj2g4oni2Nnvg1o697slg":{"text":"Love this place. I always get the baked drum and I go infrequently enough that the sauce i","useful":3,"cool":1},"kElTaqubBhUlah1kM7IMSQ":{"text":"Came here on a whim as we were staying pretty close and it had such good reviews.  \n\nI rec","useful":7,"cool":6},"OxLdxvS2n-9WOgTn5qfhKg":{"text":"The service was well,the food was good,however, salt is not the only s seasoning. I probab","useful":0,"cool":0},"5lvtrWppPpJl-fabCu9CLQ":{"text":"What a great, well run, anticipate the patrons needs, with food that is mind boggling plac","useful":0,"cool":0},"rpXvcIHRa5PMs7ReCUXkOw":{"text":"This restaurant is what I call urban chic with a little edge yet super trendy. Our group o","useful":7,"cool":6},"lwLm66o-Yn_g-YfhXovkWw":{"text":"Delicious, fresh seafood. Oysters, shrimp, even the bread is amazing. A great variety of f","useful":1,"cool":1},"d8e77jZvYMclvIw7bko6Ew":{"text":"Ordered the seafood platter on a lunch date to share. It was all delicious.  Tuna smoked d","useful":0,"cool":0},"GH_DPB8DwDU7911z8JONig":{"text":"Wow!  Just truly great, in a city that truly knows food.  The seafood platter was wonderfu","useful":0,"cool":0},"nbtt0zRlmIm1Z_oeg5P3dg":{"text":"Absolutely disappointing! The servers had a snobby attitude. Samica and Alex treated us li","useful":1,"cool":0},"bymmqkkIt9qYREVFz18Bug":{"text":"First time we dine here as my friend recommended this place. Place is nice and in a good l","useful":1,"cool":0},"7ZOytqdiYBqxgYSARioeIg":{"text":"One of the best restaurants in New Orleans. Staff was incredibly friendly and the food was","useful":0,"cool":0},"yr8nA-UpuTsjdXQEOr1Vrw":{"text":"Perhaps a bit over rated. Oysters were good. Loved the field pea side. The whole fish entr","useful":0,"cool":0},"rj8MlpN1ow0ztmCFRA0wUw":{"text":"Fantastic lunch at Peche. The food was great, but sitting in the back and getting extra se","useful":0,"cool":0},"feewS-H1xMjFjOgCq2nUGQ":{"text":"Everything I ate was just amazing...the servers were really nice and professional...the on","useful":0,"cool":0},"Dg-zubIgacvFFJw6JFF11g":{"text":"Their roast duck with kumquat pasta was amazing. Also the fried bread with sea salt was su","useful":1,"cool":0},"YuzvQ3Hcr2sIxr7NRVyqKQ":{"text":"The food was amazing but the restaurant did not respect our reservation which was at 9pm a","useful":0,"cool":0},"5wrOP-GiaGb35orBdigtsw":{"text":"Love love love this place and everything that the Link Group does!  Very cool for a travel","useful":1,"cool":0},"vvdEkNlv47NwA5E0ch6n6Q":{"text":"Very high quality cocktails and seafood.  Highly recommend (especially if you want to be i","useful":0,"cool":0},"Hols5uGtRCSGrzVCkUAh3w":{"text":"Food was exceptional, drinks were inventive and well crafted. While in town for business I","useful":0,"cool":0},"qETHD7GN5ChMV0Ay6tQaNw":{"text":"We had the raw oysters, the mackerel, hush puppies, the tuna with olives to share, and the","useful":0,"cool":0},"XJKdT3g0AaQscO1K4lMjqQ":{"text":"Human memory--what's preserved and what isn't, and how--is a mystery.  But on at least one","useful":1,"cool":1},"t1yr0wByMmztw7qeqgxJ9g":{"text":"Delicious! Fresh fish, new twists on old favorites. Great place to take your family. They ","useful":1,"cool":0},"zqWZjTJh5ANrUeenTrKzfg":{"text":"Wow, this place is doing wonderful things with seafood! So anytime I read about a new awes","useful":4,"cool":3},"tZC_z6qJW1Qn8xKOfA_TUg":{"text":"The food was absolutely delicious We had a dozen oysters for starters then shared catfish ","useful":0,"cool":0},"7hQhK-pVk6rBlOLsxdHKeg":{"text":"It was good, but not memorable.  I would come here again.  \n\nI had wine, the Ameztoi recom","useful":1,"cool":1},"qsUZ5wzokOHEBQbDGGJaSA":{"text":"A delightful respite from the omnipresence of familiar local flavors, Pêche is a thoughtfu","useful":0,"cool":0},"HkrR50HcmiRVpC_dqWPuhg":{"text":"Absolutely phenomenal. Everything is good, no really, everything. Every time I go I order ","useful":0,"cool":0},"U356ap_qlKWtkGVy3GqQFg":{"text":"This place is amazing and ridiculously Good !!!\nWe sat at the bar and had drinks and small","useful":0,"cool":0},"SdZRlkg8UQ7BU8FBQw4vcQ":{"text":"Although we didn't order the whole fish like everyone I know recommended, we still very mu","useful":0,"cool":0},"6c9REuANtbhyBiRbEP-P3w":{"text":"With one day notice, we booked a table for two which was pretty surprising​ that in a shor","useful":1,"cool":0},"8Ois4rCFtOKcEkCZjfDkRQ":{"text":"One of our first post-Covid meals when restaurant was at 50% capacity.  Food was delicious","useful":1,"cool":0},"nqJmEzKEvQV-MHjQ9rXHkg":{"text":"The dishes that we ordered were very delicious, creative, and full of flavor. Also ordered","useful":0,"cool":0},"nWhQbdjn7_yz7YWDIGGQVA":{"text":"Went to Pèche to celebrate a birthday last night. The atmosphere was pretty casual not ove","useful":1,"cool":2},"L2mFqkqiD1JCSz7CQczk6w":{"text":"Lunch at Peche, then later that night... dessert at Peche. \n\nOnly wish I could have had a ","useful":1,"cool":1},"mwXTS3AGmOF85qc4f-91tQ":{"text":"I wish I could give 5.5 stars because this restaurant is superior! Fish was fresh FRESH. S","useful":0,"cool":0},"m1cZO6lBitskk0a6Me41tA":{"text":"Always an amazing meal.  Never any unpleasant surprises. Wonderful, inspired, fresh cuisin","useful":0,"cool":0},"pqXoOvTlEJLZBTKzKmg9aQ":{"text":"Came here for my birthday and was impressed by the food, drink, and atmosphere!! We ordere","useful":0,"cool":0},"Q0Y-Hz1p8TMDm1U83MidhA":{"text":"We showed up on Saturday around lunch... got seated and even ordered food... then noticed ","useful":0,"cool":0},"0x0gt6gY7PXe2bPQniXJ3A":{"text":"This place was just fantastic!  I would highly recommend if you're a visitor to the City o","useful":3,"cool":2},"EilSnRG1zY-ZJf8B1BYeww":{"text":"Yes Indeed!\n\nThe only drawback about this place is if its crowded; be prepared for it to b","useful":4,"cool":1},"lmwUpAN15Hl59aX3EyL9OQ":{"text":"My mouth waters when I think about all the fabulous food I had at Peche, wow! I wish I did","useful":1,"cool":0},"TOrM25E7rKxl0WWz0vwGjA":{"text":"My wife and I had 6:30 dinner reservations on Monday March 11th. We're foodies and were re","useful":1,"cool":0},"I_BxrvqOm_F1w9br4W7Xig":{"text":"Always blown away by this establishment. 3 of us dined at the bar and split some signature","useful":2,"cool":1},"uQ9ZtEcLhBhMXld9tGUqEQ":{"text":"The raw bar seafood platter was amazing.  I enjoyed their coconut fish dish as well.  Grea","useful":0,"cool":0},"rCCD7x0v-Izgg53mPNWvgA":{"text":"IF I COULD GIVE THIS 100 STARS I WOULD!! We booked a verry last minute reservation and act","useful":2,"cool":0},"brpoFYqp9LHThdXanHuQqA":{"text":"The food, setting, cocktails, and service were all perfect. I had the grilled tuna which w","useful":0,"cool":0},"cNH0_F0v6ZtvjrcT3_d2lQ":{"text":"Everything at pêche was good but nothing was great. We came for lunch with friends. Easy t","useful":0,"cool":1},"wfKM0gqlHlnykOsjUutpng":{"text":"OMG that steak tartare . I know this is a seafood spot, but you MUST order this appetizer,","useful":0,"cool":0},"MyQVGT4CRekGr2hvRMEt6A":{"text":"Just left Pêche. I started with the gumbo and oysters and was thinking of getting an entre","useful":0,"cool":0},"xdgAmscfB9X8nsmWJGFevw":{"text":"Peche is so so sooooooooo delicious!!! I recommend getting the whole fish, crab claws, and","useful":0,"cool":0},"eAS80o6AS9eOAAMYfIcK0g":{"text":"4.5 stars.This was my favorite place for lunch by far. Everything was so good and the serv","useful":1,"cool":1},"kpZgWO1KqW_jiqK8bO5cjA":{"text":"We had reservations for 8. Got there at 7:55 ish. They said they had to get the table read","useful":0,"cool":0},"Pk97m05jgi-ZunJOGIO0PQ":{"text":"Amazing! Food and Ambience. The Brussel sprouts are to die for! Great location right in th","useful":0,"cool":0},"-x6UxJYVFq5zIwvB04qI4Q":{"text":"In the interest of getting straight to the point, here's what I had and loved, and wouldn'","useful":4,"cool":5},"IqDtEO8SHgo8uptb5pJwWg":{"text":"Atmosphere great.  We had sheepshead fisherman style with curry sauce - was great!  We als","useful":0,"cool":1},"DDOcqJv16CQO6js5pUQFEg":{"text":"We stopped in for a snack and drink. Everything was amazing!  We ended up hanging out for ","useful":0,"cool":0},"L4Okdxj97vXlNCU0GQVNUA":{"text":"Inside had a great vibe and food was tasty. I was a little disappointed in the size of my ","useful":0,"cool":0},"5Mr_NFbszyb0aK8pDttyAA":{"text":"Very crowded place but very worth it... Traveling on business I grab a seat at the bar and","useful":0,"cool":0},"RCoHJtIgbwhNUUAkJXHnkw":{"text":"For my 5 day trip to the big easy, this restaurant was by far my favorite. We were turned ","useful":3,"cool":1},"p41jnr_LaKsdICbUP3lrrw":{"text":"I went here last night for my oldest sister's graduation. We ordered the greens with chili","useful":1,"cool":1},"RZVwRPyuIS0k7fHG69y0ig":{"text":"Discovered this place by accident on the way to the WWII Museum. so glad we did. We arrive","useful":2,"cool":0},"akBPAq9L2NILcYFN8QFVaw":{"text":"Where do I start with this review? I love this place, but this is a long, rather mixed rev","useful":1,"cool":1},"oTtJ6g-9C2yrFBmRZxgphg":{"text":"This is our very favorite spot to have a little fancier meal in NOLA. The food here is lig","useful":1,"cool":0},"odmlADQrS1f9lXpLZMDhJw":{"text":"Absolutely delicious. We've gone twice now and both times we made a reservation, were seat","useful":0,"cool":0},"fpf6Zym8sDkbYDT11GRTNA":{"text":"Travelled to New Orleans a few years ago and this was probably my favorite food experience","useful":0,"cool":1},"o-Hju11Yt4L6Z8iS4lzy-Q":{"text":"I've heard a lot of positive things about Peche so I decided to take my dad here for Fathe","useful":2,"cool":2},"VxaCa7V57H_8VW1T0vfBZw":{"text":"The food has great flavor and the wine list is impressive.  The service on the other hand ","useful":0,"cool":0},"v_LsSdy8PeHHNmLM1-ec1g":{"text":"Delicious restaurant in New Orleans. We all loved our cocktails and appetizers we ordered ","useful":1,"cool":0},"IRJ-aFUmBeDj01DRpqSNVw":{"text":"Just amazing, great food- we had the bacon jumbo shrimp and the drum fish, for appetizers ","useful":1,"cool":0},"E3oxvwsdJa8TvoxOjUEcsQ":{"text":"Things I ordered :\n\nDrinks-\n\nLittle Red Corvette - One of kinda drink 4.9/5\nPants on Fire-","useful":1,"cool":1},"ji5M-urcvuJil3BFCzlGiA":{"text":"The atmosphere of this place was super clean and pretty. We sat at a table that had plenty","useful":0,"cool":0},"FR15uljpffYv3ZuyzMUTNw":{"text":"Ordered this soup don't remember the name but it was not good...however everything else we","useful":0,"cool":0},"dkGIyKUAm2aO_0W0ClYhjg":{"text":"Walked in and got lucky with two seats at the oyster bar. This place is in top three resta","useful":1,"cool":0},"Qbc5U9vSO-J6kmuCrnKFcg":{"text":"We came to Pêche at the recommendation of a friend. I was immediately excited because I ha","useful":1,"cool":2},"ZpdPmDBVFG1FPrKJBDedhg":{"text":"I LOVE PECHE! One of my favorite places in New Orleans.","useful":0,"cool":0},"nEpcmoUoTdvlUTaU-AtcIg":{"text":"Great  place, amazing decoration and people, nice bar unforgettable food! Service good, ju","useful":0,"cool":0},"ausCO0UIH60AaBIR4p-rIA":{"text":"Stars are for food alone. Lobster roll was excellent. However, beware, this place is UNBEA","useful":2,"cool":1},"TWgRyVBUi0gRceyZwLNjCA":{"text":"*pre covid review*\n\nThese are old pictures that I happen to have from the first time we ca","useful":1,"cool":1},"NYGdcHDSM7-NOPG74nmFkw":{"text":"Slightly over-rated, but okay food nonetheless.  The seafood platter is not worth ordering","useful":0,"cool":0},"9s7_-sirkaMqXg7NrnEETg":{"text":"I almost didn't come to Peche after finding out they did not have the crab claws on the me","useful":3,"cool":1},"rZu7G9LNunNZE0XveFN11g":{"text":"No one wants to dis any establishment that has weathered this ugly Covid storm, and my les","useful":1,"cool":0},"peGhHgKcwEo_NzHS0dcqVA":{"text":"The best meal we had in NOLA!  Eat your raw oysters here but save room for the redfish. Si","useful":0,"cool":0},"QHQuJG7NyS24cVsUNp2WPg":{"text":"3 stars for food + 1 star for amazing service. \n\nEvery time I travel, I tell myself that I","useful":1,"cool":0},"HvFsTlFSkdXyIj_3ud8vpA":{"text":"Honestly my favorite thing I got from here was the fried bread because it was such a big s","useful":2,"cool":0},"W6S-J-ephgNQszZGsDU1Jw":{"text":"BEST FOOD IN NEW ORLEANS!   \nMy trip ended on the highest note with dinner from here :)","useful":0,"cool":0},"7tlDUVp3E865U4KBImtJGQ":{"text":"Although, we were off to a rocky start, it quickly escalated into an amazing meal. We arri","useful":2,"cool":2},"52HU-AxzsCIuP-E74Nizdw":{"text":"Second time here and so happy I returned. The oysters are fresh and fabulous. The tuna dip","useful":0,"cool":0},"YlgS-gx-U1cMrEKCCQ9Xfw":{"text":"The food was good but only 3 stars for the service. We were misguided in all of the select","useful":0,"cool":0},"Y_ZAQOrWfhGTcUZWn7RxAA":{"text":"Always great with a nice twist on sea food. Well prepared and presented and the waiting st","useful":1,"cool":0},"Z0WEr06CEjm3oa1EqXqsGQ":{"text":"Fire ! Smoked tuna dip is da truth ! Also recommend the swordfish or smothered Catfish","useful":0,"cool":0},"oz7MWdT9xcQmgbv4fThdkQ":{"text":"WHOLE FISH WHOLE FISH WHOLE FISH. I love this place. It's a really nice place, it's atmosp","useful":0,"cool":0},"GVy9LWS_7LrJyPR9ns3jJg":{"text":"Went by myself on a business trip. Service was friendly and warm. The mussels were the bes","useful":0,"cool":0},"-GK4p0pyAjt0CTdHP-PLwQ":{"text":"Had just two appetizers. Oysters in Louisiana are so good big and meaty and Peche definite","useful":0,"cool":0},"k0Zqb0Uw3HaEqMkB6JNw5A":{"text":"Truly bummed to write this review, considering that this was our favorite spot during Jazz","useful":2,"cool":1},"MY1BfZn6Fse9T52F1ZDn_g":{"text":"We walked in 15 girls deep for a bachelorette and were placed at 2 separate round tables. ","useful":1,"cool":0},"Zyn1rjkR63gSkPgPM1kuXQ":{"text":"One of my favorite restaurants and one of my go-tos whenever my Family or Friends comes in","useful":0,"cool":0},"uGAwDiyKDxJFN_zqv6Vt_Q":{"text":"GOOD: so many things I wanted to order on the menu. Everyone at my table of six said their","useful":0,"cool":0},"O-6PDnibwVWp3dmvVXvAzQ":{"text":"I believe Pêche is overrated. On a good note, the shrimp bisque was tasty, and the atmosph","useful":1,"cool":0},"Bug3YkZKAa2mTb9S8f1XqQ":{"text":"Incredible. Friendly waiter, phenomenal/fresh food, clean, well-decorated establishment.\n\n","useful":3,"cool":0},"2Hx0TdBYcaUS9o3bg2Y_Ig":{"text":"Peche has recently been honored with the James Beard Award and it's all thanks to Chef Rya","useful":2,"cool":0},"aEwGg4TjAXnYsaRHf0r14g":{"text":"Peche was absolutely amazing. We were a rather large group (9 people) and everyone was ver","useful":2,"cool":0},"6LhqmSdjBZYc14i5XBLcaA":{"text":"Another 5 star review for Chef Donald Link and Co. We made a dinner reservation (highly re","useful":3,"cool":2},"XVa9HW5yyo2UCXw1Z8G-1Q":{"text":"Ok so we came here kind of on a whim because we were starving. GET THE FISH STICKS. Idk wh","useful":0,"cool":0},"lrMTsk8ToB23sOfeqC5tgw":{"text":"Incredible food, great atmosphere!   Loved the baked salted bread rolls, I left a few and ","useful":2,"cool":0},"GhZuJMxhQMlIDkd_of7c7g":{"text":"The one star is for the prepared food. The raw oysters and service were a solid 3 - 4.\n\nTh","useful":0,"cool":0},"Kd6A9izO4hDSslHrW-6GGQ":{"text":"The baked drum is my favorite fish in the city right now.\n\nPass on the steak and save that","useful":5,"cool":3},"NTWW3AQMfNXxE0318oaAYA":{"text":"Very nice modern twist on the seafood category and an awesome raw bar if you like that kin","useful":0,"cool":1},"Rs-NHiQGIotSOTWZIiiCeA":{"text":"I'd been once before and think I enjoyed the architecture and didn't pay as much attention","useful":0,"cool":0},"0S3ltKRLtVA3zXRIAzeg_A":{"text":"simplicity at it's best. one of the best meals i had in the US for years (and we live in N","useful":0,"cool":0},"BoStsa4fRQ4eh1gIW4_gtw":{"text":"Amazing food, wine, and service.  Can't recall her name, but our waitress who was a Connec","useful":0,"cool":0},"Y5r91myMXliNoQ9ABArdPQ":{"text":"By far one of the best/most enjoyable/service and food experiences in years. Tim Pacillas ","useful":1,"cool":0},"Ev9kfa-v_nt6t1AwgCYTcw":{"text":"We went here for NYE, as we are from Ohio. I know the sales team was soo annoyed with us, ","useful":0,"cool":0},"1vvxklyKU9Bw0uj-vmVDng":{"text":"I had heard many good things about Peche and decided to try it out for lunch.  I had the b","useful":0,"cool":2},"99lilx-HwEDNfa6di80MGQ":{"text":"We had two raw bar items and a grilled wahoo special along with beets and fried bread. Wow","useful":0,"cool":0},"YxjMMUVOLSwDRzoXaZcjew":{"text":"Really good. Great cocktails and if whole fish is your thing it's excellent. I loved the s","useful":1,"cool":0},"EWOED8TFe41nqC-aPrHywQ":{"text":"F: antastic\nR: ich in flavor\nI: dream about the fried bread\nE: dible\nD: elish\nB: all of se","useful":2,"cool":0},"yg1McTbhDgH177TpPcaIgA":{"text":"You can tell a good restaurant by a full parking lot, and it would be full if Pêche had a ","useful":0,"cool":0},"0-rD-eAfDqbtKY9KWbJbpg":{"text":"This place is cute and located on a corner. You walk in and you can feel the seafood vibe.","useful":3,"cool":0},"bqgWNtJuSpCNIr8Jptoz9Q":{"text":"This was easily one of our favorite meals in New Orleans. If you find yourself nearby, pla","useful":1,"cool":0},"1RAIQuz3dfpEcwghFgFJag":{"text":"There are few restaurants where in a casual setting the waiter can guide you through an ex","useful":1,"cool":0},"QjZP6R7X1LoeIwvoUr91_g":{"text":"Went last week.  Had the off-menu special again.  Cobia head.  Giant and delicious.  The c","useful":3,"cool":1},"n62zbntrr2TONcB7Ll-u1w":{"text":"Oysters were big. Got the kids order wrong after an awful long wait. Good cocktails. Great","useful":1,"cool":0},"pBDBEiJAt2QwVk0qrCELtg":{"text":"I always heard good things about this place so when we snagged a last min 7:30 reservation","useful":0,"cool":0},"E-CNdIl7-lqb7UbsYyzL7w":{"text":"PROS:\n- Delicious fresh menu\n- Wide variety of options\n- Affordable\n\nCONS:\n- A little loud","useful":1,"cool":1},"_BDW_du4PVpqvcRZR5f3ZQ":{"text":"Outstanding food and service period!  Eat here if you can or you'll miss out on a great di","useful":0,"cool":0},"eUsGPupmG3qCLAWuGhbIdQ":{"text":"noisy,lively and fun. great food\nonly problem, wanted a whole fish , but they wouldn't rem","useful":0,"cool":0},"Bbyl_cZWfaXvvvBFDApy4g":{"text":"One of the best restaurants in New Orleans. \n\nMy wife and I went for a lunch midweek and i","useful":4,"cool":1},"12q29oHbrzdx8NGeEvFYWg":{"text":"Wow 10000x yes!! This is one of the top places to eat in New Orleans. Anything you can ord","useful":0,"cool":0},"iyFCI0K1W4X3KX0aLEFNng":{"text":"Best meal in NOLA. Sat at the bar for four hours!! My friend and I had a lot of different ","useful":0,"cool":0},"3VeWaBzAdlOTfjurmRLzpA":{"text":"We spent a week in New Orleans, and went off the beaten track to hit up Peche on a recomme","useful":0,"cool":0},"1ttCbu5VxPlrZUM9z5FPCA":{"text":"Really enjoyed my meal at Peche! My partner and I ordered the seafood platter and I loved ","useful":0,"cool":0},"l0eCWMkrkkWD_6KPlOLJ_Q":{"text":"If I could give this place more than 5 stars I would!!!! The oysters a must!! The drinks w","useful":0,"cool":0},"MwqaoMdi1nwnyO5QEX7rWw":{"text":"Quick afternoon stop, but the pasta and key lime pie were sooo good. My waiter was very kn","useful":0,"cool":0},"km0sYlrBPPk39AzclStz1w":{"text":"My friend and I came here Saturday at 9pm with no reservation. The wait was an hour for a ","useful":4,"cool":2},"C4AESzQe9mUmFcDYN_tR-A":{"text":"Great food and service. Appreciated Dan and Chris' special attention for our birthday cele","useful":0,"cool":0},"BewrVxUTendor3uN_6ACZg":{"text":"Well - my first dinner in New Orleans for many years!  This place was OVER THE TOP!   We h","useful":3,"cool":0},"q5R7SMg3mgjo2yit0U9wSQ":{"text":"We went during lunch hour, and it was a mad house, but fortunately we had reservations. We","useful":0,"cool":0},"B0PKylnJpOgdy_srfkJuWw":{"text":"The food is amazing, I definitely recommend going with a couple friends and sharing a bunc","useful":2,"cool":1},"yLAa1m_dfjbWeBVZLkkdRQ":{"text":"The absolute best raw oysters that have ever graced these lips and taste buds. The gumbo w","useful":1,"cool":1},"2V-NDZj3xNwmYoVVuBQfsQ":{"text":"In NOLA on visit and my friends who are local recommended this for seafood.  Definitely be","useful":1,"cool":0},"grbKebL1GXLPs0c0FQaU3w":{"text":"My only complaint about this place is that I cannot eat hear every day because it would be","useful":2,"cool":0},"5g-rCaVjLCNrGCwd6vmxVg":{"text":"My friend took me here for my birthday. The interior is nice, looks newly renovated and a ","useful":1,"cool":0},"pCLSr8kz2AF6xFtGtw01dQ":{"text":"Had the best meal here! It has been a while since I've been back probably pre-covid but I ","useful":3,"cool":1},"wdGNFZjI68fBWjEcQaD8IA":{"text":"One of the best of NOLA.  I didn't have a reservation but was able to sit at the bar and g","useful":0,"cool":0},"QEcfMO_7gqFvX-jUi9SaTA":{"text":"Everything we ordered was so good! This is not one of the many French quarter tourist trap","useful":0,"cool":0},"Ll5rjWn4wX4hUAE1Xgq5Aw":{"text":"This was easily my favorite place that I ate in New Orleans. After hearing all of the accl","useful":2,"cool":0},"agN9KhXox4B1nYNFs2yWVA":{"text":"Absolutely delicious, wonderful service. One of the best lunch spots in New Orleans. There","useful":0,"cool":1},"EnXih6eRtUWKW_ab0_aXrg":{"text":"This was the absolute best meal I had in New Orleans (this trip).  A lot of my go to spots","useful":1,"cool":1},"rHZWA-4OukmHuGfX-RSR_g":{"text":"Our Uber driver was a foodie and suggested we go here and we're glad we did. Great vibe ph","useful":1,"cool":0},"sOCVC4BAQTYI7aa64W7FvQ":{"text":"Service was excellent. They were crowded, and loud, but they seated us around 10 minutes a","useful":0,"cool":0},"Q5ed_iCUE60oYR1ntwGFsA":{"text":"Food was very good! Service was super slow, items missed, left to wait...\n\nHate it when th","useful":0,"cool":0},"R5h28NSrlXYRxAllfZetbQ":{"text":"After previewing my brother in law's art on display at the nearby Callan Gallery, we decid","useful":2,"cool":2},"1Z4T8pPsmaqCS2qm2rDzVA":{"text":"Now, this is a review of one single dish. First of all the place is spacious and contempor","useful":0,"cool":0},"Y2eTsSay8DQJiQpWTZSVPg":{"text":"This place was good! I can't say the food was bad. I will say i give it one less star for ","useful":0,"cool":0},"QQixtP1fDRMh3NsQ7J6tYw":{"text":"Love love love it!  Can't wait until we return to New Orleans so we can go again.  Not onl","useful":0,"cool":0},"-ZhrmKfBvyTnR-hMN2u_Kg":{"text":"I'm sad to say that our experience at Peche was just so-so. \nWe had high hopes of a great ","useful":1,"cool":0},"lSaqc9SS-0WLPQ_nurFfHg":{"text":"This is the second time that I have had dinner at Peche. The food is totally amazing. But ","useful":0,"cool":0},"HcnTFNhurUeBPtLghEcM1g":{"text":"We probably won't be back.  Food was ok- but took way too long, was not hot and our waitre","useful":0,"cool":0},"J5N1kwHNGgZFeOe_FhEJRw":{"text":"Impecable Dining Experience, Perfectly Cooked Food and Amazing Service.  Wait was excessiv","useful":0,"cool":0},"rZmqjxa1dC0B6P54DjWIRQ":{"text":"I'd like to take a moment to recognize how freaking good the steak tartare is here. :: mom","useful":6,"cool":5},"T74cbCPgWSGeEKnBPFqHVQ":{"text":"We had five people for dinner tonight. We ordered a bunch of apps for the table.- Hush pup","useful":0,"cool":0},"1Z4b3-Ce3LOg8lisDiEoQA":{"text":"The restaurant is eclectic and bright. The drinks were amazing. The food was excellent. We","useful":1,"cool":0},"4bC8JhYUOcwWELrObIpEyA":{"text":"It's been weeks since I've been back from New Orleans, but still thinking about our meal a","useful":1,"cool":1},"raJcafx0XY2Z2-JiOUdkBQ":{"text":"Wanted to KO my NOLA trip with a bang at Peche! We had a Wed night dinner res at 8pm, and ","useful":6,"cool":0},"y0tmGDJH8x6ZDE8Nt8MjlA":{"text":"Food is ok. But this place is resting on it's laurels. Service is indifferent. Interior se","useful":0,"cool":0},"oZ_cK9rcdO7Awct__eRD9Q":{"text":"Great food with help with a bad attitude!!!!!!\nThe staff thinks it's too good for the cust","useful":1,"cool":0},"mD10A0QRIOOD992A5jEjvg":{"text":"I finally had a chance to go to Peche for dinner. I had the sample of all of the raw oyste","useful":0,"cool":0},"OIs9fpZB3TcWQeyfCONWsw":{"text":"Been dying to get back to Pêche for their Whole Grilled fish normally I get the whole redf","useful":1,"cool":1},"umU2qhNq2RlqxnCp5FMuDA":{"text":"Amazing. So fresh. Food was fantastic. Super friendly staff.\n\nWas really impressed with ev","useful":0,"cool":0},"zdZY6PSpMIXng3snr2wQiw":{"text":"would have loved to have eaten at peche this trip home, but the hostess dropped the ball. ","useful":0,"cool":0},"yS1RRZ82cATS5unLBYEvmw":{"text":"Great, flavorful New Orleans food. The steak tartar is to DIE for, the shrimp roll was the","useful":0,"cool":0},"BDmwp2qZVvzbCU-ACPq0wA":{"text":"In a city of incredible meals, this was such a disappointment. We saved this for our final","useful":0,"cool":0},"aMnuJy9v2y0wP842-7OG1Q":{"text":"I have been anxiously awaiting this visit.  I love Herbsaint, I like Cochon and similarly ","useful":2,"cool":1},"jiD8fRJLnnPNOsFOPhLtsw":{"text":"IS IT TIME FOR MY MEDS NURSE RATCHED?  There's a foggy, bland vibe here...\nTEMPURA FRIED F","useful":9,"cool":4},"pSXV89CVlg3PDl3HyMlLnQ":{"text":"My first adventure actually eating in a restaurant since March.  Masks required, place was","useful":9,"cool":7},"461ooM4kdgU9up7ACcNjgQ":{"text":"A MUST TRY. \n\nThis place was so, so good! I came into town with my mom and we wanted somet","useful":0,"cool":0},"314p3fYURmoF3-9O-__CLQ":{"text":"Great restaurant! Went for a business lunch and came away very pleased. The service was gr","useful":3,"cool":2},"RD4CcaJCozlRHHlTjam5fw":{"text":"Great food. My best restaurant in the city. The collection of foods are diverse in taste a","useful":0,"cool":0},"jhNeNywVg-w9PUjoIvbQ3Q":{"text":"We were planning to be in NOLA for Jazz Fest and when I saw that Peche was scheduled to be","useful":5,"cool":0},"pLaxySeTEgEhKgBVSiWjpA":{"text":"I had heard a lot about this place from friends, and having been on Julia Street a few tim","useful":0,"cool":0},"tq3SNu1txQ6V_DkeqjmpHg":{"text":"Really enjoyed Peche whist visiting NOLA. Great menu- I wanted everything! Started with th","useful":0,"cool":0},"s2kukcQggzfsuTpdqAlfAQ":{"text":"If you want great seafood in New Orleans this is your spot. Go with a group and order ever","useful":0,"cool":0},"8QML7yZQeasXCBMSF2ephA":{"text":"Had the smothered catfish, it was good but serving size was a little small. The caramel ca","useful":0,"cool":0},"zIWp_FTqhoaLh5oCa0OPRg":{"text":"Fantastic!!\n\nCame here with the wifey for our Good Friday meal and picking Peche was a gre","useful":3,"cool":2},"0tNSheYyvmpKFYykDtIpbA":{"text":"Off the charts amazing!  We went to Peche on Wednesday, February 13, with our children and","useful":2,"cool":0},"hhyV2JjN-WmToDHRsqF4OA":{"text":"Wow. What an incredible restaurant. The food here was amazing. We tried the shrimp toast, ","useful":0,"cool":0},"zat4Fw6o60yUAAYKZI3llQ":{"text":"There is simply NOTHING on the menu that fails to satisfy. Ordered whole grilled fish, oys","useful":0,"cool":0},"6PjU8wMhF35RXXEgeLRvtQ":{"text":"Our lunch was absolutely incredible! The raw tuna appetizer was out of this world. I could","useful":1,"cool":1},"a6lMWLKpqQjCI-QPZDuiuw":{"text":"Pêche is hands down my favorite place to dine when I'm in New Orleans. I've been here a nu","useful":0,"cool":0},"m1pZJAeB_bQFo__LO37eQg":{"text":"What an amazing meal! This place is popular (read: packed) and I can see why. Definitely g","useful":1,"cool":1},"ATT5TL6zE5IIoeWADF21Eg":{"text":"The host/maitre d was rude, haughty and unhelpful. In his defense, we were told the regula","useful":0,"cool":0},"azhXjYWH1navXrJIN1--RA":{"text":"I searched the depths of Yelp to find the perfect spot to celebrate my 30th with my honey ","useful":8,"cool":5},"MYKZjnvQ-e0fuTKsG0mung":{"text":"We've gone to plenty of the top rated fine-dining places here in NOLA, but this simple rus","useful":1,"cool":1},"YmrnfNIH6JD04FkQRkBgJg":{"text":"Restaurant was super busy, lots of staff and service perfectly on point. Expect to spend a","useful":1,"cool":0},"FwCEKE33dyxsb7ZDYcW8Dg":{"text":"I don't usually leave reviews but this place was Epic! Portions were normal sized not huge","useful":0,"cool":0},"LKucxeXQmOuooJdSPpAFFg":{"text":"The best meal of the weekend... and we ate out a lot!  Peche is awesome.  We had a reserva","useful":3,"cool":2},"JMwzGXepXaNr4Pz8vqgUNA":{"text":"Came here Mardi Gras weekend for the first time. The restaurant is quaint, clean and prett","useful":1,"cool":0},"7LYRS9u78F6lobs2DjSIlg":{"text":"This review is for 4.5 stars. \n\nFantastic food, service a bit less than that. Had the drum","useful":2,"cool":1},"p3hUCdveTnyrcZqLeg54hQ":{"text":"What a horrible experience. The waiter was nonexistent after he took our order. One fish d","useful":0,"cool":0},"lQFRd3GBhYWwsKiox6mhPg":{"text":"I wish I could give 6 stars to peche. That meal will never be forgotten. The oysters were ","useful":0,"cool":0},"Uw-dr0-v1VVxVLsidXLGvQ":{"text":"I've been wanting to go here for years. I've visited New Orleans 5 times and have often wa","useful":1,"cool":1},"jwZoaeEQY65l8PViFkgE1Q":{"text":"Back for my fourth meal. Last visit i watched a talented chef at raw bar making ceviche an","useful":0,"cool":0},"YHlFVlFIcP4HrVaGhj6_3w":{"text":"Insanely fresh. Incredibly flavorful. I would eat this again and again! Ian and thinh were","useful":0,"cool":0},"PJLtIVgY0MOIqYeRMF5law":{"text":"Got the Drum fish collar and it was perfectly cooked. Chimichurri sauce on it was deliciou","useful":0,"cool":0},"onciku7ZErRk4Jd6OzWO9g":{"text":"The restaurant is trying too hard to please the foodie crowd and sacrifices flavor as a re","useful":0,"cool":0},"ZVq9EwsHQkc4y-Nzhcd-cA":{"text":"This place was truly top notch. They get really busy so its best to make a reservation. Th","useful":0,"cool":0},"_J6cCcObMSMIBRoK6J3A9Q":{"text":"My girlfriend and I stopped by here on our way to an appointment in New Orleans. There's n","useful":1,"cool":0},"McZeyhSkOfdO-QEpdppUKg":{"text":"I'm not sure why I waited so long to try this place.  It exceeded my expectations.\n\n- The ","useful":1,"cool":0},"GDY3KEIrLd8xPQUrIphFSw":{"text":"First night in NOLA on our first VACA since quarantine. First off; Peche was GREAT! The wi","useful":2,"cool":0},"sS0xCFPs0EQXRceWx8mU-g":{"text":"Oh my gosh so good! Came highly recommended by a total foodie friend, and I'm so glad I we","useful":2,"cool":0},"DIGnSqI-J7KD7R74QloKSA":{"text":"We recently dined at Peche. They were very accommodating, especially during corona. I love","useful":2,"cool":1},"P9-fEtvk8ma3m0R0Ok0xlw":{"text":"The food was quite good (4 stars, we loved the whole fish) but the place is just downright","useful":0,"cool":0},"HxxurVEX2tQotbzt31509g":{"text":"I came here with some gfs that wanted to do dinner here. I have a seafood allergy so I had","useful":4,"cool":1},"5WlPXlreZBBLs6Io73ZgYQ":{"text":"The restaurant scene in New Orleans is unlike no other city. When you think of New Orleans","useful":0,"cool":0},"U0t5TZ2qIcCdfVm09kzhVA":{"text":"A lively, jam packed dining spot with consistently amazing food, well versed & rehearsed s","useful":0,"cool":0},"L8tO0Me8g5lIitfstxe8KA":{"text":"Kinda good but not quite there yet.\nI ordered a seafood salad and the smoked drum.\nThe dru","useful":0,"cool":0},"RDhSILx2cNHGILsLrvE33w":{"text":"Elegance with a hint of hipster!\nA perfect beginning to my NO trip. Our driver from the ai","useful":19,"cool":13},"20HFNg2_uQc18OSXD7nJDA":{"text":"I went to Pêche thinking it was Meril (one of those situations where two words/places get ","useful":1,"cool":0},"36FrIreE_2S0O9HYApSd6w":{"text":"Sit back and grab a snack, because this is gonna be a long one.\n\nI've heard about Pêche fo","useful":10,"cool":7},"Jbhjqp9sL4OjyELMmi5XiQ":{"text":"Food was good, but a little underwhelming, although I may have just ordered the wrong thin","useful":0,"cool":0},"_SNp_fUamMlyVogmc3YkLg":{"text":"This restaurant is crazy good! Our reservation was honored immediately, the service was to","useful":2,"cool":1},"ybx7SuSoWZco0VPsCa8sNA":{"text":"We had excellent drinks and dinner.  The whiskey selection was very good.  I enjoyed the o","useful":0,"cool":0},"xLT9z1WRAyc7iZM_nMw_vw":{"text":"Just about the best oysters I've ever had! We were referred to this place by our driver wh","useful":2,"cool":0},"a36t8pmc7o4XfxntZQYizg":{"text":"My boyfriend loves this place so we end up visiting here every time we are here. I think t","useful":1,"cool":0},"p4xhTpbrj4H5krnTmnDxvA":{"text":"Can't get better than this for a seafood-phile.  \n\nFirst, bright, airy, and welcoming vibe","useful":2,"cool":0},"f4g3jO3hG_Td8aYGUX3Iqg":{"text":"Probably one of the best restaurants in New Orleans. The tuna Crudo was complex and delici","useful":0,"cool":0},"fNNASW4LOSplOFgknKiMKQ":{"text":"We showed up at 830 for are 830 reservation slot and had to wait.  They suggested we wait,","useful":0,"cool":1},"fwXsgp2kmhPt3nHnkoEvhw":{"text":"Peche has been on my radar for a while, but I'm not a HUGE seafood person. It took a birth","useful":8,"cool":8},"lDCXjtD0YydtMcORxRpbaA":{"text":"I did a lot of research before committing to this place to get oysters in New Orleans. I w","useful":2,"cool":1},"Siv_Eaj2P0MH8uCYyMWkeA":{"text":"If leaving the WWII Museum great place to relax and enjoy good eats at this special place.","useful":0,"cool":0},"8HpxVudtGrT3s_A4rtZ0Xg":{"text":"In town on business and my client took me here for dinner.  The location was busy for a ra","useful":2,"cool":0},"UzDQTnp9rhy7wT7-M2otig":{"text":"A friend told us to come here when we get to NOLA and this place didn't disappoint. This w","useful":3,"cool":0},"1Rg0x8tXen4i9wv1aksHGA":{"text":"I guess there's a reason that this is a seafood restaurant. I split the ribeye with my dar","useful":7,"cool":5},"xP5TI6XZxiEjXiR9Up-gFw":{"text":"Best dining experience in NOLA, interesting entrees, great flavors and service was flawles","useful":1,"cool":1},"RLyPjE6cBfri0PEAIGAUtg":{"text":"Yall, I'm serious this resturant is truly does make me say \"Woohoo! As good as it gets!\" ;","useful":2,"cool":1},"7vhAg3YLo1QguwhKa1XT7Q":{"text":"Deserves the high ratings. Great service. Yes, somewhat noisy... but had a great time with","useful":0,"cool":0},"98ILlXk7gTFvUYUHHAA8xg":{"text":"I would recommend this restaurant if you ever visit NOLA!  It is definitely a popular plac","useful":4,"cool":6},"I1kFK2V3gzn3OyefFUQeEg":{"text":"I was reading some of the other reviews and once again thought, \"did I go to the same plac","useful":5,"cool":0},"Ij5l6y_R0v4Xp_zt6Ni1LA":{"text":"Pêche produced phenomenal marine offerings. The oysters were some of the best I've ever ha","useful":7,"cool":1},"nvXxBCHiXWwVQurTKyZY6Q":{"text":"Culinary genius! My husband and I are visiting New Orleans and asked a young man on the st","useful":1,"cool":0},"Zt6Cfx-p-dn4E1N6EIjb6Q":{"text":"Outstanding food and service period!  Eat here if you can or you'll miss out on a great di","useful":1,"cool":1},"Xzl71btks6mLu6Zso0yttQ":{"text":"Excellent and fast service. Good and original menu and drinks. This Restaurant deserves th","useful":0,"cool":0},"vIffvlV_XVRU1dVaFUBOoA":{"text":"Amazing!! Best Oysters on the half shell we've ever had!! Staff is friendly and service wa","useful":0,"cool":0},"pSLQdgDU7xRgHyHwKz-Z_w":{"text":"Peche finally accepts reservations for Jazz Fest so we were able to stop in here for dinne","useful":1,"cool":1},"vmn2-E_fbd9iYbk1TNE45A":{"text":"Update: Someone wrote back to me saying that I was berating the server in Spanish. Just wa","useful":0,"cool":1},"AnUQ3JCGG269kmI0YSjKcw":{"text":"The jalapeño out flavored the shrimp dish... the chili broth was sour on the catfish. SO m","useful":1,"cool":0},"CmSw3hPU-TDlr9qycGL0JQ":{"text":"Ate here about a week ago, one of the best restaurants in the city as of now, be sure to b","useful":0,"cool":0},"KVxqQ8b9y_6FExhBX7RXPg":{"text":"Top 25 meals of all time. Started with gintilly beverage and ended with peanut pie-all so ","useful":0,"cool":0},"q0CSZER3WtEZiYnRjRPgJw":{"text":"Peche never disappoints. Whenever I am in town, I make it a point to get reservations. Dop","useful":0,"cool":0},"ekDunGBmU3teRlXW7My5AQ":{"text":"Fantastic, fresh seafood. We had tuna dip, raw oysters, Brussels sprouts and picked bean s","useful":1,"cool":1},"Kx9XOHvxKeWyFPWvUMoP3Q":{"text":"The food is actually three to four stars, but a particular instance is driving me to write","useful":0,"cool":0},"KeHHL5z_m5xiiAROoxLUzg":{"text":"Peche is one of the best places we go to in New Orleans. Each time we are in town, everyon","useful":0,"cool":0},"TstNP3H1wYsHZmMCyGB5rA":{"text":"If your in the Big easy, I would suggest you hit this place up. Very hip, nice atmosphere.","useful":1,"cool":1},"OQRHIIMuIrezOTwTw1GC5Q":{"text":"Phenom.  So.  Been here for a minute and 5 and this local and responsibly sourced seafood ","useful":29,"cool":27},"wnLFErR6wF_T-stBRFt5Kg":{"text":"Cool vibe. BUT I am so disappointed in this place. My husband and I were in town for one n","useful":4,"cool":0},"t19rEml1XtTY35Qeq4TXfg":{"text":"Wow! Fish was definitely fresh and tasty! But don't expect to be full unless you're ready ","useful":0,"cool":0},"W8SsfPHgAWFdMYSZMD9GNw":{"text":"Wow...just...wow. From the atmosphere to the service to the food honestly 10/10. First of ","useful":1,"cool":0},"BRjRdJ9k_A8ySoJN6quxtg":{"text":"Me and my date went here for a later lunch. We were able to walk in and get a table, proba","useful":1,"cool":0},"rC8kDRxIVq5wmFIdSmKKJA":{"text":"Outstanding!!!! Absolutely flavorful dishes with flair. Worth stopping more than once. Han","useful":0,"cool":0},"pr329oTv7P0Hdak6pSxwVA":{"text":"Had one of the best dine in service here, server recommended a great wine to go with the w","useful":0,"cool":0},"BYwzVNwTj7o9AfJ-COyzDg":{"text":"A Top 10 NOLA Restaurant that 100% deserves this rating. I am honestly not a fan of cooked","useful":4,"cool":1},"ERMsR9xsPxQUZ_TmDV8Pag":{"text":"Peche does not disappoint!  This was my third time at this restaurant and over the years i","useful":0,"cool":0},"p1FE6gNOUm6HFLv_FUJVDQ":{"text":"This is the first restaurant we stopped in when we arrived to New Orleans. It was AMAZING!","useful":4,"cool":5},"jG4Gn7_zibcpk0cgUozpDg":{"text":"This is one of the most delicious, reasonably priced seafood culinary delights in the Ware","useful":7,"cool":7},"JbcglrSFc95pqGh5EClWXA":{"text":"Excellent food and service!!! Would highly recommend this restaurant.  Every dish was prep","useful":0,"cool":0},"PcLROUSxK2tSptnjZj9hAg":{"text":"Omg omg omg. Yum yum yum. So I'm a fattie I admit it. And there are times I over order and","useful":1,"cool":1},"NZkKJopqP2AX5hl01q8CwA":{"text":"Traveling to New Orleans and asked some friends who live here for dinner recommendations b","useful":4,"cool":0},"CGGNWA6C6ytpuBmlg2DKXg":{"text":"Hands down the best food we had in New Orleans so far. The seafood platter app is enormous","useful":1,"cool":1},"azso1lj-2BzGxzKNuZ91aw":{"text":"MORE THAN SUBSTANCE\n\nAlong Julia Street in the Warehouse District are a plethora of excell","useful":11,"cool":11},"bAKmqwu5_dcwS9NSfOp6oQ":{"text":"I write this review as I sit here. Waiting. \n\nI can honestly say that this is the worst se","useful":1,"cool":0},"kekAdXXWk2bE-pf9d_ev8g":{"text":"Amazing seafood and steak - everything was absolutely incredible, and I can rarely say tha","useful":2,"cool":1},"Z6sufJE_bc_dorZASpqLlA":{"text":"GO AT NIGHT\nI went back recently with an open mind but this time for dinner...and most imp","useful":8,"cool":3},"1Tx7r4PU_XLq0mJxsS3uIA":{"text":"I started my foodie journey with a Satsuma old fashion . It was smooth and it packed a dec","useful":5,"cool":0},"l5VT-ATkhwLYIwgxYi0CRQ":{"text":"This is not a good restaurant in my opinion.  Served us BURNT food and they even acknowled","useful":1,"cool":0},"8tu-wrTJ3C-ZdXd9vth9Hg":{"text":"One of the best places to eat in the city!  Do yourself a favor and go.  We are locals and","useful":0,"cool":0},"6afeNlSVuM5sMbOX4ft-iw":{"text":"Arrived at the restaurant without reservations at 6:30 PM on a Tuesday. \nMy companion and ","useful":0,"cool":0},"y_tSkcuG2trdGkQQE_qpnA":{"text":"One of the best sea food.\nThe seafood platter and the trout was what we had \nGood price go","useful":0,"cool":1},"ATd-R_bDBhI1flWLS-LzTw":{"text":"Start with oysters, raw and crystal hot sauce was delicious and the oysters were big and I","useful":0,"cool":0},"xXSTj35ZLFW04c6oziStBQ":{"text":"Great atmosphere and food is pricey. Food taste good not great. Would I come back? Probabl","useful":1,"cool":0},"I8Bx7v4qGuMZMaZ0L4Sc7A":{"text":"Great cocktails and beer options.   Knowledgeable staff concerning gluten issues.   Wonder","useful":0,"cool":0},"qoyw-uLSrD8UqH4DegUtyg":{"text":"Outstanding! Thank you to Houston's Chris Shepherd for the recommendation! I forgot to tak","useful":0,"cool":0},"epubpCRh02A8mTcUDhsKsA":{"text":"The customer service is in need of an overhaul starting with the female black hostess. Pec","useful":0,"cool":0},"I6Tpgp99doDrGL2UExLdEw":{"text":"Had a very mediocre experience at Peche. We had the fried bread, half a dozen oysters, dru","useful":0,"cool":0},"HRi-4mTW0TMgd-fHSit-7w":{"text":"Very nice atmosphere, relaxed and upscale. We came here for our anniversary dinner and it ","useful":0,"cool":0},"OdZtSBM2DECyWkEGjchp0A":{"text":"Oysters were big. Got the kids order wrong after an awful long wait. Good cocktails. Great","useful":1,"cool":0},"dRf3b_Jo9xd_wzkvp7Q_vw":{"text":"Stopped in walking back to my hotel from the WW2 museum and had a really great lunch. The ","useful":0,"cool":0},"g9Boxg4HpLDuxbsjbn_Vgg":{"text":"Absolutely delicious! My husband and I ordered every small plate on the menu to share. He ","useful":0,"cool":0},"xett2MonDBsH7b5aU6J41Q":{"text":"New Orleans is a city that I would live in for the food alone.  I WANT to move here, excep","useful":6,"cool":6},"iwcs2vIv6NCRH92frvOuJA":{"text":"Nice looking bar and great friendly staff. We sat by the bar and I tried the 3 different s","useful":0,"cool":0},"uP29dHrhLYb7Y4XQ9YwFHg":{"text":"Whole fish , fried bread what's not to love. Peche does not disappoint, It can get very bu","useful":0,"cool":0},"4fOwgIh5S0Ca12C09wNqag":{"text":"Dinner for 4 here on December 11. Food was above expectations. Servers did a very good job","useful":0,"cool":0},"FK0miGSvyTqQ5Hyj-gql5g":{"text":"Great meal and atmosphere!  The waiter was very knowledgeable about the menu and was willi","useful":0,"cool":0},"QmwBQgqU6aoTTmnz0F4ykw":{"text":"O.M.G. This was seriously the best place on my short trip to New Orleans that I've been to","useful":0,"cool":0},"E14uOccy9v_jzy9SZAk8hA":{"text":"The whole fish is the best entree on the menu.  I get it every time I come here.  The oyst","useful":1,"cool":1},"UY2PUT5kbkG_esuoGQa_-A":{"text":"Everywhere I go my service is horrible because I'm black as heck with a beard I'm automati","useful":0,"cool":0},"ztmdfnbrRnlm7MLl3qY4EQ":{"text":"An absolute must if you're in NoLa. \n\nService: server was friendly with a sense of humor a","useful":0,"cool":0},"a99wUlaBcC4Kk6MmnUkBQg":{"text":"The food was great the service was meh. We were there to celebrate a birthday on a Monday ","useful":1,"cool":1},"icq8JhJ4VYoQArwUPCQ9Qw":{"text":"I ate here in 2019, and this place will always be memorable to me for not only the phenome","useful":2,"cool":0},"iOSydeorHzHCU3AOqpLEsQ":{"text":"Food was amazing. Waitress on her game. Bartender seemed like he didn't want to be there b","useful":0,"cool":0},"7EonRyP-J822sqFzC62GRg":{"text":"Like most places, the restaurant required that all parties be present before being seated.","useful":0,"cool":0},"7ZOeHR5qLXU9oCZW0NW-cQ":{"text":"Hands down, the best meal I had in NOLA. I ended up getting the coconut shrimp. The shrimp","useful":4,"cool":1},"NsK7d5hpBRzSq06cMm-ExA":{"text":"Great food and service. Ari and Harley were our servers and took great care of us. Place p","useful":0,"cool":0},"QH0STZHY-YJUTnRIVkWjug":{"text":"Two of my friends and I went to Peche for lunch on Monday, 12/20/2021.  The place was full","useful":0,"cool":0},"gTWN7AbK0023Xk40F1lx1w":{"text":"Great restaurant! Good staff, a little dark and reverb in the space makes it a little loud","useful":3,"cool":1},"Avz8Q2Bnl9vaS0NAehvo9A":{"text":"Really enjoyed this meal on recent trip to New Orleans. Oysters were really delicious. Bak","useful":0,"cool":0},"Xj1_iV0rzoKLjuN25r0bLQ":{"text":"Went last new night with friends, the fish sticks were to die for, oysters were immaculate","useful":1,"cool":1},"U_fyO6OHPJaFgf-f4Rh0zg":{"text":"We actually stumbled on Peche while heading to another restaurant. I had read about Peche ","useful":2,"cool":2},"C51WC17mjewyxM6ZqVtvpw":{"text":"Hardly needs more Yelp stars.  Peche lives up to its lofty reputation whether for lunch or","useful":0,"cool":0},"EcXIVgh8LZ2f6V2YvzDSAQ":{"text":"Stopped in for a dozen oysters with my wife and were not disappointed. This place was very","useful":8,"cool":8},"5hnheSyyQGPAHSN_s6izcA":{"text":"It was a beautiful weather to drive to New Orleans for a Meeting. Love creole cooking of N","useful":2,"cool":2},"mzceOxTVUXDjNACmYOxgyA":{"text":"Peche always lives up to its reputation and is always worth whatever pricetag you end up p","useful":2,"cool":2},"V1tkGp-9aczrsrRVHe0S4w":{"text":"Peche has been one of our favorite restaurants for several years. We have enjoyed a couple","useful":0,"cool":0},"t80kj2La7OS2Sl2o0QSuHw":{"text":"WOW. I received a gift card and, after struggling with the Toast Tab online ordering, real","useful":3,"cool":1},"o_4pOOIg_6gFixaCaQz-lQ":{"text":"A MUST place to go to if you're in New Orleans. Our uber driver recommended this place to ","useful":2,"cool":2},"l1RuOFbtkidFekdGkE0Cxw":{"text":"This.place.is.amazingggggggg. Everything we ate, I died and went to heaven. The menu doesn","useful":1,"cool":0},"19QuGNxqkWZ4ivQYM87E-A":{"text":"Peche was recommended to us by friends as a great place and even a favorite place to get f","useful":0,"cool":0},"EXj8Qq3xK3vm-RIS72uQXQ":{"text":"Food was delicious, drinks were great. Fast service at the bar. We had the Hanger Steak an","useful":0,"cool":0},"q4OL3NUWE-F_9sCMLShziA":{"text":"Giving Pêche a 4 only because the bar is extremely high in New Orleans. Pêche is a part of","useful":1,"cool":0},"0MGLPVRE4iQcOPG-blBZmg":{"text":"from the reviews and online, looks like a wonderful place. Came here for a business lunch.","useful":0,"cool":0},"4Vi5UNkD6NXKp1_QBPbPpw":{"text":"Absolutely amazing! We walked into Pêche and it was slammed so went had a drink somewhere ","useful":0,"cool":0},"24TrZOvEjDBcTmxNQfcnnQ":{"text":"Some of the best seafood in New Orleans. If you're looking for a splurge meal, this is it.","useful":1,"cool":1},"SiiPT7EDn2-6nitF4NkHUw":{"text":"Overrated all around. The food is okay but nothing out of this world. The service was tryi","useful":0,"cool":0},"aLRgyH6HcwcORaVF83V4xg":{"text":"I wish I could give Peche 5 stars, because the food and cocktail I got were outstanding. T","useful":0,"cool":0},"Z7RTcBi27tBiqgLYtPMVDA":{"text":"What was the occasion: Bachelorette party weekend trip to NOLA (party of 9, and the restau","useful":7,"cool":4},"nqBq0paKOXwkqelWXzcptA":{"text":"Pêche has undeniably been the most disappointing service of the year. As much as my friend","useful":0,"cool":0},"93FCRC8Sz4RVJwYEPpOs5g":{"text":"The best Redfish in Town.\nHush Puppies were the best we ever had.\nAnd you will not regret ","useful":0,"cool":0},"VluQZNLXE5-HmUtkalcaUg":{"text":"This place is exquisitely furnished with well thought out safety precaution stations. The ","useful":0,"cool":0},"qrz6eBWFTNP-45YMvriG7Q":{"text":"I loveeeee this place. \n\nSmoked tuna dip - I get this every time I come. Not bc I really e","useful":1,"cool":1},"wPS2s9nwlpQbIDGl0RpZvQ":{"text":"We had a group of seven people and received excellent service. We have been to Pêche sever","useful":0,"cool":0},"3zs3BKKby-A_k4Y4H7-Afg":{"text":"Delicious seafood and they cook fish that is not commonly seen on other menus. Great frien","useful":0,"cool":0},"jxViYH_RPvETaZHoivOVBw":{"text":"We didn't have a reservation but thankfully they were able to fit us in without a wait. Th","useful":1,"cool":0},"xk9n01RSp_FsFDAGQAF7Gg":{"text":"5 stars for the food! The food here is fantastic. I ordered the Louisiana oysters and the ","useful":1,"cool":2},"OUmeOk2nUYwMeCFmMefyxg":{"text":"Great place with an easygoing atmosphere. My husband had the crawfish and jalapeño capelli","useful":1,"cool":0},"LS2TmnqteZAm2QER-krzJw":{"text":"This restaurant was highly recommended on social media, and locals and did not disappoint!","useful":3,"cool":2},"eXWSFj0QBwPuU5xD1Fr2Kw":{"text":"Hello everyone its your friendly neighbor again lets get to the run down.\n\nFood: B -\nServi","useful":0,"cool":0},"_xEnicACZCzF_aYb5YL92g":{"text":"Just drove from Florida to Washington state and this was the best meal I had along the way","useful":0,"cool":0},"dMq0JqvsjPYzvJlY0vOJPQ":{"text":"I went for Saturday lunch with my sister and mother and none of us were happy with the res","useful":10,"cool":4},"yez1KDZyBT0d0o3Izi9RIA":{"text":"I visited Peche during a busy Sunday brunch.  Alabama was playing Clemson at the Dome so e","useful":3,"cool":1},"3m2153FdYjxXYi5SK52_fQ":{"text":"The atmosphere is very upbeat. Waiter was super sweet and polite. We enjoyed the small pla","useful":1,"cool":1},"hgPTD7Nm7_rFs4C_6IVh7A":{"text":"This place is simple awesome!\nEverything we had and I mean everything was fabulous.\nIt's n","useful":1,"cool":1},"-vp-YdMZs91y--_N9FFZbg":{"text":"One of our favorite dinners in New Orleans. The whole fish was amazing. It could have fed ","useful":0,"cool":0},"Baiwcm54TPtTc6mzDJm6OA":{"text":"Good ambience. A bit too salty on all the dishes I tried. The oxtail, grilled red snapper,","useful":0,"cool":0},"X1hSOj1ELXY5Hds-o0_qdQ":{"text":"Innovative, unique, welcoming and AMAZING! Granted, I had only lunch at the bar, but the s","useful":1,"cool":2},"fjMZrWemSdwepp3LsymbRw":{"text":"From a Yankee: You guys. This place is f*cking phenomenal. I have never had such a wonderf","useful":0,"cool":0},"dZpasOJYkdVJyHd3Zn0QJw":{"text":"Came here for a girls night out and it was perfect! Every single item we ordered was hands","useful":0,"cool":0},"6nUg8FhgYBLwb7QhVC4YNg":{"text":"Food was very good.  Service @ bar & male host's customer service truly the worst we've ha","useful":0,"cool":0},"YpV7w0Y3QMiVQr89G58YCw":{"text":"The food was absolutely fantastic.  Each diner (there were 4 of us) raved about the food. ","useful":0,"cool":0},"ojIL0ClS11viL43cEibNcw":{"text":"Affordable, excellent seafood to be found here. Fried brussels sprouts were quite excellen","useful":0,"cool":0},"egqQQ2B-Y2xgppYBkCrgIQ":{"text":"Over the years of traveling to NOLA for work I've developed a list of places I truly enjoy","useful":0,"cool":0},"UDe1TDeXOrl57ktni5t6cg":{"text":"OMG!  I can not express how much I love this place. This was my first visit to New Orleans","useful":0,"cool":0},"h3ojBNvZfRwGnYd_12ko2g":{"text":"This place was amazing. Very much worth the trip. If you're interested notice all the woma","useful":0,"cool":0},"WXWlGAJf-a2spMIhzGjQ2w":{"text":"I'm like really drunk right now but why am I thinking about the redfish and crab claws i h","useful":2,"cool":0},"-l_ai_cAArHc0CdgCM3PmQ":{"text":"My husband and I love Peche. It's one of our go to NOLA restaurants. My top tip, GET THE B","useful":0,"cool":0},"F-lpjXqLa8GDbsdryWt8vw":{"text":"LOVEEEEE THIS PLACE! I went last night! The shrimp roll was delicious and so was the hange","useful":0,"cool":0},"ZSl1Tgyto3BIkBCpFHubLQ":{"text":"Came in for dinner during EMF.  \n\nReally dig the restaurant group this site belongs to and","useful":0,"cool":0},"d7N3eT2GyAoOYcJ_C_zlZQ":{"text":"We decided to try Peche for our Mother's Day dinner after reading reviews on Yelp. We were","useful":1,"cool":0},"d1tj_LzLyXEoBi3rb9PjIQ":{"text":"First of all, the food was excellent. The Redfish was delicious and sooo fresh. The Salsa ","useful":0,"cool":0},"1LfTjJgH9Bx_-QR9_N2QJw":{"text":"Definitely a great restaurant, but can get chaotic. I would recommend reservations, otherw","useful":0,"cool":0},"G5HfQm71FxQWtN97rPBOqQ":{"text":"Service was a little slow for not being that busy but the baked drum and oysters made up f","useful":0,"cool":0},"0d4injfSfSuE2Vh_chFjHw":{"text":"Bottom line: Pretty good food, nice ambiance, decent service at expected prices.\n\nFood: Ha","useful":2,"cool":3},"rR2C3QDcQwWkqoeoM7B0-Q":{"text":"Always good times here. We arrived late without reservation so we ate at the bar which was","useful":1,"cool":1},"Qk1eG9gkJxhyVd9BXCUY0w":{"text":"This place is freaking fantastic!!!! The food was AMAZING!  Staff was friendly and the amb","useful":0,"cool":0},"FosrWbmqkewUxFGx7FXlzA":{"text":"I have come here twice and love their local selection of raw oysters! Very fresh and reaso","useful":1,"cool":1},"0JMtgyrXnamcBUxXnbykHg":{"text":"Found!\nAll I am looking for in a restaurant is good vibes, nice service and innovative foo","useful":0,"cool":1},"cLY8dBo1R_e84Byo0aJtUQ":{"text":"Stopped in here on a whim this past Saturday for a late afternoon snack. We were able to s","useful":5,"cool":2},"AVKRGuyVtZ8am3i5m3USTg":{"text":"Cochon is one of our faves in NOLA, so when we heard that the same people had opened a sea","useful":0,"cool":0},"mQ8-ziuY95JMYp6F2vM7KQ":{"text":"The food is absolutely delicious it's just a little expensive. This was extreme fine dinin","useful":0,"cool":0},"3XKm3JTlzg_JAQyA2YDR3A":{"text":"The food was very good but this is the first and only restaurant in New Orleans that's eve","useful":0,"cool":0},"wCQNdhGn0_U9bJnR07RTdQ":{"text":"Excellent addition to our normal restaurant line-up in NOLA.  Super cool spot on Magazine ","useful":2,"cool":2},"hHu-HOqJEyoVzzrNBy86bg":{"text":"So delicious!! I came here with a large group so we had picked dishes beforehand and did e","useful":1,"cool":1},"iBp_xnO6sICSpLYIv7dCXQ":{"text":"Went to dinner with a bunch of girlfriends celebrating our friends birthday. Food was dece","useful":1,"cool":0},"3m-gCMh_jXeTCzQrFTWvKg":{"text":"Once again a fantastic meal. Best seafood in NOL.  Had the whole fish - flounder today. Si","useful":0,"cool":0},"rehbQQEggWXFEhH3LFaUng":{"text":"Phenomenal meal post-COVID. Incredible oysters (plump and shucked clean), whole fish verde","useful":1,"cool":0},"pp98mIsdNTQ0cm4JmYSVGg":{"text":"Third time in and third time I planned to visit again after my visit.\n\nSat at a table this","useful":2,"cool":0},"yS3dH8_ZvosRjWEodywwNw":{"text":"Elizabeth's Star Rating System\n1 star = Terrible, would not recommend, will tell family an","useful":5,"cool":3},"up3EfhoTIGLs0oZciPqmxQ":{"text":"The place was packed on a Monday night so we sat at the bar. The staff was super friendly ","useful":0,"cool":0},"P_od-KxWrltxJTOmMhcdzQ":{"text":"Excellent and affordable oysters, great management, and nice decor. Shrimp sandwich was ve","useful":1,"cool":0},"QCsQ3lB3Sb8ThRxiIaolBQ":{"text":"Peche. \nMy new favorite seafood restaurant in the USA. \n\nIt's also a 2014 James Beard awar","useful":15,"cool":14},"sslFpPC-PD1kbkTXiJARcA":{"text":"What a beautiful and fantastic hostess! Jennifer Kelleris a doll!\n\nThis restaurant has suc","useful":2,"cool":1},"RO-9E83lIv51XeBjPQLXIA":{"text":"Had a reservation here for brunch. Got there about 20 minutes early before the restaurant ","useful":2,"cool":0},"sGznSLNMYMFEdgqYR5E8zA":{"text":"You gotta go try this place... it is a must for locals and visitors. I would say that they","useful":3,"cool":2},"iOt2lB_AkxqEe_dVSE-yyQ":{"text":"We were seated 20 minutes late without an apology.  We waited to order and then a signific","useful":0,"cool":0},"iKt8Rclo3MgG0754Ya1A5Q":{"text":"We had time to grab a quick brunch before heading back to the airport, and since my wife h","useful":5,"cool":2},"0MyR4DScGmkwYIIjR9xcaQ":{"text":"Pêche has a fun vibe and innovative food. The hostess that sat us first was a bit hard to ","useful":1,"cool":1},"ztfRisUy5nPguYi0zkeulw":{"text":"Amazing food, great atmosphere, and great service! Pricey but worth a splurge. Would defin","useful":0,"cool":0},"YraLbFuPEwM1yhleZrheNA":{"text":"BELIEVE THE HYPE. Peche is just amazing!  We were able to walk in on a Thursday evening fo","useful":0,"cool":0},"JT5Xr6PzJhRsuzjT212bxw":{"text":"Definitely one of the best restaurants in New Orleans! The food is fresh and delicious wit","useful":0,"cool":0},"Kb-ml6RYtxD-l5zIoePxjg":{"text":"We love fresh fish and this place delivers.  We had the smoked tuna dip and seafood salad ","useful":0,"cool":0},"SFrU1Hr9q72I2KAkc5KdTw":{"text":"My roommate and I have been here twice in the last month because we really like this place","useful":1,"cool":1},"l4ovAPlePXB14b0Q8NZNjQ":{"text":"So glad I chose this place. Been traveling all day and needed to stop somewhere near my ho","useful":0,"cool":0},"8ZCf1OPvnTJnyPeF3p5dhg":{"text":"Peche! I love seafood and could not wait to come back here.\nThey were not busy when we arr","useful":2,"cool":0},"B7cMZKoFFu6GskUqhZQbiA":{"text":"In a city for a college tour, my daughter and I wanted to share an enjoyable evening aroun","useful":1,"cool":0},"otDfZbnhkcMLKHmfDl3Eeg":{"text":"Nawlins is one of my fave food meccas in this great US of A.  Yep.  Who woulda thunk I wou","useful":7,"cool":8},"g4icgKE6d_fDumuMe2sPcA":{"text":"Had the seafood platter, the crab claws and copious amounts of wine.  The oysters were gre","useful":0,"cool":0},"piC2xPonOk37L-KjuzhfdQ":{"text":"Love this area of the lower Garden District. Pêche is a good choice from happy hour on. We","useful":2,"cool":2},"ztmLufYshQZkTuqiEd7AxA":{"text":"I had only been to Peche for drinks prior to yesterday, when I finally had a meal there wi","useful":7,"cool":4},"hJJ-QMKOOKmFoDVV9kHT7Q":{"text":"I love seafood, so Peche is definitely my ideal place for lunch or dinner! \n\nI love the de","useful":1,"cool":1},"WZo2tKW2a7vGs0xP_GA6-w":{"text":"Seafood lovers rejoice! Some of the best oysters I had in New Orleans, and the seafood gum","useful":4,"cool":3},"lpO9xJ7uRAVdFIx4w8p96Q":{"text":"Had reservations after the WW2 museum. Lots of people are coming from the museum as you ca","useful":3,"cool":1},"sxerPdzM6pGFpTPx4bcbOg":{"text":"Just incredible, from the oysters to the fish special with literally the most amazing swee","useful":0,"cool":0},"-lqkRnnrlS2kGPoc6mJbuA":{"text":"Delicious freshly shucked oysters! Just what i needed Sunday afternoon! Quick service but ","useful":0,"cool":0},"G69pcHKOaL2Wddhww-eagA":{"text":"Unbelievable experience. Really cool dining area. Sat directly accords from the kitchen an","useful":0,"cool":0},"qESXaZwdYDtv5_lZcEq7cQ":{"text":"On my recent trip to New Orleans I discovered this restaurant and it was amazing! Fresh fo","useful":1,"cool":1},"aMyDgb4pJums1CF3CRAmBA":{"text":"This place is awesome! Their beef tartar is scrumptious. The ambiance is elegant yet laid ","useful":0,"cool":0},"obS-0oBT9f471HePA6cz7w":{"text":"Ummmmmm...\n\nDisappointed. \nThis place is expensive and I really don't see the hype. \n\nWhat","useful":2,"cool":0},"0gT3-_FdPDWEsXuebCFMVw":{"text":"To be honest.... I was highly recommended to try this restaurant.   I went with one friend","useful":0,"cool":0},"Wsw9ewVojzxZYZcon9Js_w":{"text":"Do you want to enjoy friendly staff, beautiful atmosphere, strong drinks and some of the b","useful":0,"cool":0},"9DjEFk3yYPT5WhabvvhXoA":{"text":"I had a very good lunch at the Peche bar after visiting the nearby World War II Museum. Th","useful":0,"cool":0},"4LzWqAJB0j2JNXmmKLSExw":{"text":"Got a recommendation to come here from a nola local. Super happy we did because we loved i","useful":3,"cool":0},"qkvNt0CnfaMP3TBm76RN0w":{"text":"Fantastic dinner. yes Loud!! But ignore that and the stupid wine list and concentrate on t","useful":0,"cool":0},"WS_E6YehYLzXWYZyeILKDg":{"text":"As a whole experience, the night we went here was definitely one of the best nights while ","useful":0,"cool":0},"RD-5_8eI6Ca6KKjqOXKWGg":{"text":"An update for my friends and followers.  I had to change my 4-star rating based on my last","useful":3,"cool":0},"gYI-2XKd4EAlVj4wH8rA6Q":{"text":"This was my favorite restaurant in NOLA on my four day trip. We ate at some of the most fa","useful":2,"cool":2},"67TpEWpBaLhSUE-xrfXNKA":{"text":"DON'T WAIST YOUR TIME waiting for unsatisfying food. Restaurant was 50% occupied, but WAIT","useful":1,"cool":0},"f2BIteYReQ0bq8w7doOlXQ":{"text":"Excellent food. Brussels sprouts were extra special. Attentive service. Noisy. Key lime pi","useful":0,"cool":0},"HlzYPnlGLFrJWYiyyNxtrg":{"text":"Donald Link does it again! Excellent food and service with a nod as always to his roots an","useful":0,"cool":0},"M2qe9s6Hky4NpgSLtoru2Q":{"text":"It's not often I give 5 stars, but this was very good. It's the (much better) sister resta","useful":2,"cool":1},"P8icOE-QgCvxgnCfeeoibQ":{"text":"Easily my favorite meal during my 7-day, food-based stay in New Orleans. \n\nThe excellent:\n","useful":5,"cool":1},"i3n4T3jMBm3TiQ6eLPhjbw":{"text":"I found this remarkable little place on a corner in the Warehouse District. When you walk ","useful":2,"cool":1},"2_606_VVszZmNZbDcqmb-g":{"text":"One of my favorite restaurants in town. The oyster bar is great and they clean the oysters","useful":0,"cool":0},"91ALKCqPLW351ODhwc1YXQ":{"text":"UHmazing!!!! Lived up to the hype! You must get the crab claws and fried Brussels sprouts.","useful":1,"cool":1},"AAV9sHON8Dy_cLDNewz_yw":{"text":"So many people recommended I come here when visiting Nola. We'll, nobody lied to me becaus","useful":1,"cool":1},"RvH26AW3qnAfGNLHmvHEjg":{"text":"Gumbo: 3 stars\nNothing too special. \n\nPecan salad: 3.5 stars\n\nOysters: 4.5 stars\nSuper fre","useful":2,"cool":0},"495b_A8VMZuuz-hHS3dheQ":{"text":"Hey, this is TakeFlightFoodie! Follow my Instagram page for more pictures!\n\nPeche is a mus","useful":1,"cool":1},"H_upNSfHfUN757oQYfTj2w":{"text":"What a divine time we had here. Top notch food and drinks. Oh my, just divine!!! \n\nI love ","useful":20,"cool":12},"9zuuimfoCDz42638wbS2Kw":{"text":"The menu is small, but they have good appetizers and small plate selections. I adored the ","useful":1,"cool":0},"5fcaAcp_E3gE-KCtEfJIsw":{"text":"J ohhh would've given this place 5 stars, but our waitress was kind of rude so I deducted ","useful":1,"cool":1},"07m_jucsZmWgweL5Pv30dQ":{"text":"It was ok.  I must say the Smoked Tuna is AmAZING! But presentation is awful. U would thin","useful":1,"cool":0},"RgZUS8WQE253Gf-cyNhc7g":{"text":"Friend of a friend claimed, \"BEST SEAFOOD IN ALL OF NOLA!\" I rolled my eyes and immediatel","useful":1,"cool":0},"uw0E9OSuwJ29PNbQpzL7BQ":{"text":"My favorite Seafood place to go to in the city, always fresh and always full of surprises ","useful":0,"cool":0},"z_Mv3dM16DBKz5LNVoeRoA":{"text":"One of the best seafood restaurants in town.  Peche offers some of the best gulf fish in N","useful":2,"cool":1},"UXe2NtevZH2eEm7ubuT2dg":{"text":"Great reviews. They were right. We began with Louisiana raw oysters. OMG. They are big and","useful":0,"cool":0},"nkkNzZ9D1GiOhwhywnThlQ":{"text":"Everything we tried was delicious! The smoked tuna dip (with plain saltines) was a great w","useful":0,"cool":0},"ANs3VqK0BtfsTD-SLbp18A":{"text":"Great place! We came here for an early dinner on a Saturday. They were booked but were abl","useful":4,"cool":4},"zwT1DONEn5phzZN8nm5Cbw":{"text":"Came here on Saturday night and immediately grabbed a seat at the bar. Bartenders were ver","useful":1,"cool":0},"jlIQ6BO3vWPdHb0QtG2iQQ":{"text":"Soooo my friend and I just left this restaurant after ordering a Whole Red Snapper only fo","useful":0,"cool":0},"8HszHCF6x37GX5HAxFPcxg":{"text":"I wish that I could give 10 stars to Pêche! Decided to stop at Pêche for lunch, after not ","useful":1,"cool":0},"7bAkqi1S4VBjjnM0II3lcQ":{"text":"This is the perfect place for oysters! They do it right,, \nI took my staff here and  we ki","useful":1,"cool":0},"uYinOg7CbuLGX2dplsg6QQ":{"text":"During my last day in Nola, I stopped by the hotel concierge and asked, \"it's my last day ","useful":6,"cool":6},"6OD0Fd1jVION6cOziF5-zQ":{"text":"I had the swordfish and my wife had the baked grouper. For appetizers we had the gulf shri","useful":0,"cool":0},"c3iRKq68I5o_Wi0OkWgs2A":{"text":"Truly amazing. My wife and I were in town for our anniversary. This place was by far the b","useful":1,"cool":0},"qwxWwwPtIo2m4sgxhyHl0g":{"text":"Don't get me wrong, I love all the gumbo, chargrilled oysters, red beans and rice that the","useful":0,"cool":0},"kEmIas5-N5YDy2taKAQNEg":{"text":"Peche\nAfter a nice day of self-care and pampering, a good lunch will make your day so much","useful":0,"cool":0},"L4RM6N8t6GyP7_E1DVGcdQ":{"text":"Wife and I were in NOLA for a short stay and decided on Pêche for a Monday night dinner. W","useful":1,"cool":0},"wcyf8pBcmPfr8HUYiwdkpg":{"text":"This is such an amazing place. Sit at the bar and make a friend. You won't regret it. Chad","useful":2,"cool":3},"cd6v0tMHjwyUU1rUXJamug":{"text":"Peche definitely understood the assignment! We started off with THE biggest oysters I've s","useful":0,"cool":0}}