{"j2IBNlRS8fVUkdvrVDUpqg":{"text":"Needed a limo for out-of-town guests attending my event on short notice.  After a few emai","useful":0,"cool":0},"hvyA59J2iwmfNus3Epax1w":{"text":"Best limo service in the city. I've booked night outs with them and trips to the airport w","useful":1,"cool":0},"uLgdp4ckaTDlRMb5Iw89_A":{"text":"I booked Livery Limousine to surprise my girlfriends with luxury transfer to our hotel on ","useful":2,"cool":1},"uExrHhIAFSsSZpSyULVVfQ":{"text":"We used the trolley car for our bridal party for our wedding last weekend, and they did a ","useful":0,"cool":0},"8M1HpCk1O8cP1gmyqSOiYQ":{"text":"Someone from Limousine Livery contacted me for more information after reading this review,","useful":4,"cool":1},"hNwgfCUOLw2InalJXueycA":{"text":"I was facing a conundrum...New Orleans does not have public transportation (don't argue wi","useful":2,"cool":0},"mPiK763f8g4niMCWwv2cTQ":{"text":"We had a fantastic experience with the Limousine Livery. Our driver, Byron, met us promptl","useful":0,"cool":0},"Nr6g7-m-CZyLY_q3deCjkg":{"text":"Staff from behind the scenes to the drivers were amazing. They really went above and beyon","useful":4,"cool":0},"YanEmc-eJe98-bw9f6h1EA":{"text":"Ya I'm a fan.  My driver Derrick R was nice. He was early and waiting for me at baggage cl","useful":2,"cool":0},"-fh23ueWccGwePyc20zAJg":{"text":"Great to between the airport and hotel.   We rebooked for the return as well.  Friendly an","useful":0,"cool":0},"8MDD1TLAkTQwvYWJZ1LGtw":{"text":"I honestly think that someone working for this company used my credit card to purchase tic","useful":0,"cool":0},"aWmCh8AJjgNGnGAfXh5V-Q":{"text":"We used them again this past month and the service was great again! the only reason I gave","useful":2,"cool":1},"xJoA8WH9cuTGBXcCvU5awQ":{"text":"Chandra helped me book the reservation and Jimmy was our driver. He was actually very earl","useful":2,"cool":1},"sONypuV9ucFWiG6tweKa_w":{"text":"We booked this service for transportation to and from the airport for our trip to New Orle","useful":2,"cool":0},"UwNgPIrbrDoua96Fx0XS_w":{"text":"I really can not say enough about how great our driver, Corey B. was. He was SO great that","useful":1,"cool":1},"z625MIIfTm9XZFgHbWUACg":{"text":"I booked an airport pick up via email and it was incredibly easy.  The pricing and communi","useful":0,"cool":0},"cvj3JdNzA2L3ou67D-DX3w":{"text":"This company single-handedly ruined my wedding day. I wish there was a way to give them ze","useful":1,"cool":0},"EZegOCeutSOUDalJB4wfBg":{"text":"Administrative staff was polite and efficient and sent out emails confirming the logistics","useful":0,"cool":0},"W74FHjY5CoJFNwnlo1tPdw":{"text":"They were great.  They brought my mother to the airport for me since my family was on vaca","useful":2,"cool":1},"TuLS_rr018W5aovVuGzSJA":{"text":"I worked with Constance to book a limo to/from an event for my C-level executive team in N","useful":4,"cool":2},"PB-_kPi2KsWKgfXi7teZ5w":{"text":"We tried to give them our business, but they didn't seem to want it.  After leaving no les","useful":3,"cool":2},"Q3NG7UGFIbPdsH2YtUxSMA":{"text":"Tony was a great driver (chauffeur). He's nice, friendly and we had a really nice conversa","useful":1,"cool":1}}