{"PF4iMXhwckQcipyM37Et2w":{"text":"I love that everything is grouped by colors! What isn't good about getting a matching purs","useful":21,"cool":19},"CUBsJT9laGS24rXNLC8kKQ":{"text":"Always a fan of Charming Charlie, this location just opened on November 1st. Super clean a","useful":5,"cool":2},"o-60RQaZEXc1Qb4UAqqfAw":{"text":"I went to the store on a Monday and this store only had one person working. That poor empl","useful":1,"cool":1},"JSBph_3SB9EH-d5HWEUcMA":{"text":"I simply just LOVE this department store.  All of the beautiful jewelry and their colors. ","useful":0,"cool":0},"ZW2KYPBp5-t21bmxkC9F7Q":{"text":"If you are looking for accessory heaven, then look no further! It is a huge store filled w","useful":3,"cool":2},"NrcSN-CmjufVW3Tg2dYEcA":{"text":"What can'T i say about charming charlie, except, give me 1 of these and 1 of these and 1 o","useful":3,"cool":3},"teG_7yKXX90N8MCSsew6Iw":{"text":"I dont normally yelp but being a manager myself I know what it means to go above and beyon","useful":1,"cool":1},"IgtefG7n999frWd9jvYELg":{"text":"Charming Charlie is an accessories mecca. I can't imagine that there is something that you","useful":3,"cool":2},"ftbTWwgKS4YamwSIlAgqAA":{"text":"Who doesn't love a little bling?\n\nThis place is heaven for anyone who loves something shin","useful":7,"cool":7},"1swQ60qpEwDrSjplklpw-A":{"text":"I was really interested in going here to look for jewelry and a bag for the holidays, but ","useful":1,"cool":1},"yWN_uV9ulEEKKxGIjwFphQ":{"text":"When I walked into this store, I felt like I died and went to heaven. As a self-proclaimed","useful":2,"cool":2},"4pBe3Uq6GeXkDXC32KIe9Q":{"text":"This store is a gal's dream come true! Everything is organized by color which is a big hel","useful":2,"cool":1},"vVpCVhwcEY-ziFOTjRdTOQ":{"text":"I love this store because everything is organized by color. If you need clothes or accesso","useful":2,"cool":3},"isdcE4AC44fS2pFTcelYng":{"text":"OCD-ivas, unite! \nIf you color code your closet...This is your happy place. Purses, neckla","useful":9,"cool":6},"ul2Xk_rTqQEMYtZJUU-71Q":{"text":"Definitely my happy place!! They have an overwhelmingly large selection of jewelry and oth","useful":1,"cool":1}}