{"xJtudf0YwD31z0VcJogZIQ":{"text":"Live music was meant to be played at a venue like this. No thrills and even slighted views","useful":1,"cool":1},"NVkzLXbdQerYvoMTOSrnrw":{"text":"Definitely one of the better quality venues in the city.  Been here several times. Ended u","useful":2,"cool":0},"pPSadfKokW4yXnZlf47r2g":{"text":"Great out of the way venue for tourists! We received free tickets from our airbnb host  so","useful":1,"cool":1},"BsYrOCTTRb2_qYPjC-tp-g":{"text":"Had fun dancing here late at night on a Wednesday. It wasn't very crowded, but my friend a","useful":0,"cool":0},"_sbntfJvX2tZ5vTfa4KfOQ":{"text":"TIP'S! It is world famous, and it has a great reputation that it really does deserve. This","useful":2,"cool":1},"7VQM4cZ9zjzSGSsw-g5XtQ":{"text":"I still have a soft spot for Tips being the first place I saw live music in New Orleans - ","useful":1,"cool":2},"V9a0Ehz6YsV4h0jjdBbEHg":{"text":"This place is great for music and hanging out with a big group of people.  Always enjoy Fr","useful":0,"cool":0},"CXKMqtrQJUDBy8ZGCJrVPA":{"text":"I miss this place. Being in LA now I'm amazed how most of the major venues are so tiny. Th","useful":1,"cool":1},"a50rceqFL383X6OOcXAk2Q":{"text":"Best live music venue in New Orleans!  Top notch soundmen, and sound system.  Amazing loca","useful":0,"cool":0},"xFscVvfFlnVIaVyQbdZh5A":{"text":"Tip's is a legendary institution (and if you need a quick lesson why, just look at all the","useful":1,"cool":0},"39AbBFdO2SpoBxxkPrwxgw":{"text":"I love this club. It's way better than the House of Blues! They have the best bands that p","useful":0,"cool":0},"vwI8IaJt8sksTR5nXFoRDQ":{"text":"Not like the old days. The bartenders are great, but the snotty, rude, disrespectful littl","useful":3,"cool":0},"9pKOhO1XmLT2rNcAvVJ3NA":{"text":"Awesome local venue. Great acts come through this place all the time. Local regulars like ","useful":0,"cool":0},"RlToKiAf5k1uHgNMQCeFBw":{"text":"Tips is awesome for many reasons: you get to see famous and soon-to-be-famous musicians fo","useful":0,"cool":1},"ZZWOs22wTKIiaKjGHJrSbA":{"text":"Their Sunday Fais Do Do is fabulous for a dancer like me! \n\nFriendly regulars, great staff","useful":0,"cool":0},"eLxOS01KG9iby1LlbKW6kA":{"text":"This place is oone of the best dive bars, and places to catch big shows","useful":1,"cool":1},"kUxr2GNviuZNNSgysH1y2g":{"text":"YAYYY for no smoking!!!!! I can actually breathe and enjoy my experience!","useful":0,"cool":0},"7k9JsfRm9HL6Nv9Elmdh8w":{"text":"Oh Tips, I can say I definitely miss you!  You have quite the reputation of being a bit of","useful":0,"cool":0},"wE5JUDPj_P8eBMK3iCc2Eg":{"text":"Well, they really like donuts, THAT'S FOR SURE!","useful":0,"cool":0},"7USxXTVhm98PWRn3FS-c7A":{"text":"One of the most important places in NOLA. Support the foundation and Longhair's legacy. Gr","useful":0,"cool":0},"J3fs9Rc42cLFAoaeK4__zg":{"text":"I like this venue. I've been to several shows. Sometimes it can get a bit crowded, but I g","useful":2,"cool":3},"LDbqtntm1AnOJyYLgGISlg":{"text":"Very cool spot for a concert \nThe drinks were affordable \nThe bartenders were very friendl","useful":0,"cool":0},"_UXBJjrxGasBLLJSKIEuvw":{"text":"One of the best nights I have ever had was going to Tips to see Rebirth Brass Band.  It is","useful":1,"cool":0},"wgM-osI3m4oB_WK1r8nHVg":{"text":"Had a great experience at this NOLA gem. Went to a concert on the recommendation of a frie","useful":1,"cool":1},"UZsYoM_Fi2Btttqc8nvwRg":{"text":"THE place to see and hear music.\n\nI can't begin to remember how many excellent performers ","useful":3,"cool":1},"0B_-UFgJwwkBIaqmc59Crw":{"text":"Solid would be an apt word to describe Tipitina's.  From the $2 high lifes (why not live i","useful":0,"cool":0},"TpcsSlPbG85TtJ34FwCGiA":{"text":"As an actual venue, this place is the best in New Orleans. Sadly, their selection of artis","useful":0,"cool":0},"GZe3KlMbNQHZ9lnb9n-EEg":{"text":"Tipitina's has always been one of my favorite music venues - and after not visting it for ","useful":5,"cool":2},"MGu9jWIv9tCzbqOq2fq0jw":{"text":"Only been here once, but there was awesome FREE music on a Friday night! It's big enough t","useful":2,"cool":1},"aFNkLaEWb7eZRcOliGtpCw":{"text":"Myself and 7 other guys came during a bachelor party and Tipitina's was everything I could","useful":0,"cool":0},"PEcA9sAD20uLj3OIazfzPQ":{"text":"One of the most versatile venues EVER! Some of the coolest people hang out here that I wou","useful":0,"cool":0},"tN7wCCO_5Px0nPuz_7Sonw":{"text":"Would probably give it 3.5, but I knocked it up to 4 because I had so much fun. We went up","useful":0,"cool":0},"92hY-ntRgYGnG6YO4RYiIg":{"text":"Tipitina's is a New Orleans institution. That goes without saying. However, did you know t","useful":16,"cool":5},"UiuzKvLclf4Aw3Jvc4YzWg":{"text":"Everything about this music venue is great. Saw Dr. John , the site lines , the sound wher","useful":0,"cool":0},"ZoUxpsWGEkDehdIXpDxV6w":{"text":"Hands down the best Uptown music venue I've seen.  The drinks are a little more expensive,","useful":0,"cool":0},"hTPg42KzagBg6lyHcTMLSQ":{"text":"Big space, cool decor, good music, good bartenders. The only problem I have with it is how","useful":1,"cool":1},"bQxAp2i0taBpBwNcuUbxqg":{"text":"I wish there were more music venues like Tipitina's in San Francisco. It's a small venue w","useful":0,"cool":0},"Mh_nKQyQUNy6xhDHAJaWUA":{"text":"The best music venue in the city.  I can't remember which Mardi Gras that I saw Better Tha","useful":0,"cool":0},"UWmYvxsTHSh7tkugtYb6pA":{"text":"Simply an amazing venue to see a show in, and one of the BEST small venues I've ever seen ","useful":1,"cool":0},"7O4VLl3nN-3VdwSs845kKg":{"text":"I brought some friends visiting from NYC to Tip's to see the Dirty Dozen Brass Band not re","useful":1,"cool":1},"MDHFiDBX8vZGANxuTCMoug":{"text":"I think it can easily be said New Orleans would not be the same without Tipitina's, and no","useful":1,"cool":1},"_cgVJYOm9rONKVvJM_XGUQ":{"text":"We rented out the mezzanine for a private event (the night before our wedding) and then pa","useful":0,"cool":0},"diwpJiR3rXvJRhk3_21FfQ":{"text":"It is completely unacceptable that it has taken me this long review this New Orleans music","useful":4,"cool":4},"tZzcMWUyNwEnChY5AK52Gg":{"text":"Being the music snob and audiophile that I am, I'm a bit sad it took me over a year and a ","useful":1,"cool":1},"SIyXW7eFQIz5Hh1CH8li_w":{"text":"Talk to anyone that lives in NOLA and they all tell you that Tips is one of THE places to ","useful":3,"cool":0},"xSpizQs2sRIMZVVFvu8ohQ":{"text":"This might be the best venue in America\nWe dance with Australians until 3 am\nAnd took grea","useful":0,"cool":0},"IDy-0R5foxx6fQyb8p6b3A":{"text":"Great place to see live music and an absolute must for any live music fan.  A Nola traditi","useful":4,"cool":2},"xd4oq65Luz96OYyzJ3xSNw":{"text":"Tipitina's is one of the most iconic places to catch live music in New Orleans. Check thei","useful":3,"cool":0},"w7P9B4zi3pfUyThkBVA8WA":{"text":"I had a lot of good times here at Tipitina's They got live bands and of course Thursday ni","useful":1,"cool":1},"fezS8iKql2l-DYAGdesLCQ":{"text":"A Classic New Orleans Locale\nI was happy to go here 16 months after the storm and see that","useful":0,"cool":0},"jim2WqSWj9RIykMJ2oZeRA":{"text":"This is the best place for a true New Orleans experience. Absolutely amazing music places ","useful":0,"cool":1},"2nwS_LqFzQtZc842rP2OxQ":{"text":"Tipitina's is truly an institution. No trip to NOLA would be complete without a visit to T","useful":0,"cool":1},"u9luKHfU4mPmKXMdJKSMcg":{"text":"If you visit NOLA you must visit here!  My husband and I visited Tipitina's to see Robert ","useful":3,"cool":0},"iY_sMlNxR6cgWUVFuucijQ":{"text":"I went to Tipitina's with a tugboat operator my friend Abby met on her flight in from New ","useful":1,"cool":0},"FQr_nhugmFsf6hwsOOS6JA":{"text":"Great venue. Professionally run. I went to see/hear Mia Borders and Dumpstafunk here. Grea","useful":3,"cool":1},"X6W9u37gvSpXQwvO3k4pkw":{"text":"Dr John tonite, the right place & right time.\nI've been to this venue many times over the ","useful":0,"cool":0},"ezEWYClqCVFD66swLvWS2w":{"text":"Was there on Lundi Gras... Karl Denson and Galactic was performing... great show.\n\nThe who","useful":0,"cool":0},"YMgLew_g3Fcjhytt_5SEFQ":{"text":"What a great place for live music!  Some Big Chief and War Chief were playing music, and i","useful":0,"cool":0},"-XcZOtt16Fy2YIhmP8oWjg":{"text":"Great divey concert venue.  We saw two very good bands play, had a few drinks, a little ni","useful":0,"cool":0},"kamZV7FNPnTuwfn09YqQ5A":{"text":"For aficionados of music from the New Orleans area, the intersection of Tchoupitoulas and ","useful":1,"cool":0},"fvKLmhbMl79N6ciRGaxTjQ":{"text":"There's so many reviews of Tip's that it's hard to just not repeat the same things over an","useful":0,"cool":0},"Eyj4z_KH6ueTle1sAskjRQ":{"text":"Came here on my vacation to see Kermit Ruffins and the show was amazing! The opening act w","useful":2,"cool":0},"epi5RAOlGzQafJeaaoB12g":{"text":"Had an absolute party watching Dumpstaphunk, and Shannon our bartender was amazing. Thanks","useful":1,"cool":0},"bI7NdA8hLA4vY0wbmHIFEA":{"text":"This is a phenomenal place to watch live music. Was able to get tickets to see Trombone Sh","useful":2,"cool":1},"WQWuIOXl3E1nFl0LflErxg":{"text":"I've been going to Tips since I was a teenager. I think they check IDs a little more close","useful":8,"cool":5},"HEMB5zHkvsWxfl9bRxpH_w":{"text":"Great music venue.  Went for the first time last night and it was fantastic.  You can feel","useful":0,"cool":1},"zLqREsJCx2hoGQUKSn-p3g":{"text":"One of the coolest places in the Universe.\n\nI saw a kick-ass brass band here.  Although I ","useful":2,"cool":3},"rPebwofSNvXdpD8aOgcqqg":{"text":"This place might have a higher rating if id gone as a spectator but my band played and the","useful":0,"cool":0},"uXKpYjdQ_GaO8RpvIhmz5Q":{"text":"Legendärer Live Musik Club in New Orleans, gespielt wird hier fast alles an amerikanischer","useful":0,"cool":0},"eI9T74YyGKV_F7mnOM42XQ":{"text":"\"Tip's\" is what House of Blues wishes it was. You can see the big-names like Bootsy Collin","useful":7,"cool":4},"JL1Dm30-KuyunLxCNf0VzQ":{"text":"\"WELCOME TO WORLD FAMOUS TIPITINA'S!\"\n\nQuoted from Galactic's album We Love 'Em Tonight.  ","useful":0,"cool":0},"vXXXnIfX_8H8T4CLCn7M7Q":{"text":"Tipitina's Uptown is a New Orleans classic which has seen a lot of great musicians over th","useful":1,"cool":0},"BPLmgw4RFQBGOktqssdG5A":{"text":"Great venue. Recently saw soul rebels.  Plenty of space with an intimate feel.  Upstairs a","useful":0,"cool":0},"kFJ1zPJ7Xx8Pt63rKXO-zw":{"text":"Remember Tipitinas is a NON PROFIT organization (tax deduction).....which means you need t","useful":0,"cool":0},"bu6fvQjgKmlkyMcOsJKGtA":{"text":"I have been to most of the legendary concert venues in the US. the Fillmore, Radio City, R","useful":0,"cool":0},"6Yh-j8UmPaJK3NuXWc-dUA":{"text":"Great place!  Away from the French Quarter, and great music.  We had a great time there.  ","useful":1,"cool":0},"lrydxEt3vcePezQBMtFbTw":{"text":"I've been going to Tips for many years and I've seen many shows.  I've had friends in band","useful":0,"cool":0},"YsUpNsldsrNbVBKkPx7dtg":{"text":"I've never been to a bad show at Tip's, and a trip to NOLA wouldn't be complete without on","useful":1,"cool":0},"9CL6OO1NN-kvOgN6U7YRUA":{"text":"The musical culture and special talent that is so unique to New Orleans doesn't just happe","useful":5,"cool":4},"dVTzbdsfLbku1d9Tj7ovtg":{"text":"Great\nLayout\nAnd sound\nWith dual bars\nAnd upstairs spots. Its worth the Uptown trek.","useful":0,"cool":0},"kLAWOhHB1aekbCbqfGRJIQ":{"text":"I recently had the privilege of seeing Galactic at Tipitina's. Everything about this venue","useful":0,"cool":1},"qVxVgEj_QOj28Ye0Vsohgw":{"text":"Went to Tip's with my girlfriend, roommate, and his girlfriend to see John Gros.  Drinks w","useful":0,"cool":0},"mReEPkSY7dje6hY32FQ8_g":{"text":"Oh how I missed this place.  Finally got back there last night.  Good music, good crowd, g","useful":0,"cool":0},"nTVZrpZEhep8r2QpLBR42A":{"text":"I saw Kermit Ruffin here and had a ball. You can just feel the history in this place and i","useful":0,"cool":0},"H9ZM_6VCABoTpbMH73w9BQ":{"text":"The modern incarnation of the typical New Orleans live music venue. This place fills the h","useful":0,"cool":0},"75tZum3TTqilBhHs0AIVQg":{"text":"No way to beat Tipitina's...and we were there for the \"last\" Radiators show, Saturday the ","useful":0,"cool":0},"_DCLv_d0W6OnYTIqa3R5sg":{"text":"LOVE me some Tipitina's action. What a great place, forevermore. Keep the Zydeco dance nig","useful":0,"cool":0},"eKPB1vQvfzr2572-2I9CsA":{"text":"First of all if you drive park at your own risk in the \"Rouse's\" supermarket parking lot t","useful":2,"cool":0},"vYT-0xAFAuR6oAGPEn53Zg":{"text":"Two weeks ago we made our annual trip to New Orleans. Saw that Fess Fest was going on at T","useful":0,"cool":1},"F4idNU-vXRh8kW11OTdH6w":{"text":"I've seen a few shows here. Great venue. Not really a bad spot in the place. \n\nKnocking a ","useful":0,"cool":0},"yaDjEK0YL6_ecNe8p7XMAg":{"text":"This is a pretty good venue with a good mix of local and visiting acts. I've seen this pla","useful":1,"cool":0},"2M4CLCPctq9l5LI0lU8y4w":{"text":"As far as music venues go, this is my favorite I have ever been to. It is so historic and ","useful":0,"cool":0},"jTGUvzTf85WuwQEv4IPMXQ":{"text":"it all depends on who's playing but this really is a great place.  The covers can be price","useful":0,"cool":0},"3qTYgn3SOqDszfgatN0Ukg":{"text":"Saw George Porter Jr here and was one of the best shows I have ever seen!  This place rage","useful":2,"cool":0},"a_qn42XNpmB2m0YopA8hDg":{"text":"Did some serious yelp research for a new years weekend NOLA trip and bought tickets to see","useful":2,"cool":3},"t1mUi4AOHVMtyGwi5h_e0Q":{"text":"Great divey concert venue.  We saw two very good bands play, had a few drinks, a little ni","useful":0,"cool":0},"5_vLYfP_GyolH2Av_dxv1Q":{"text":"Before the HoB this was the place to see live music.  Unfortunately HoB hired away their b","useful":1,"cool":2},"saNrw1-7B_Gu-y3w2O4uEw":{"text":"The very first live music venue I visited in NOLA.  Now some years later, the place is jus","useful":0,"cool":1},"_EpT8UHlQU40Gtc7xuF7EA":{"text":"I went to watch the John Clery plays. It is a fun venue, does not get started until 11 ral","useful":0,"cool":0},"N7wwPBHVwIqVasBpzo-bBw":{"text":"I have only been to Tipitina's a couple times, but it is definitely one of my favorite ven","useful":2,"cool":2},"90S3Deo0XSAvG2unYgyJjQ":{"text":"i love this venue. its unbelievable that this one stage is grand enough for the most famou","useful":1,"cool":0},"PnVP75UvS8WxB2fF73XfBA":{"text":"Dear Tips,\n\nRaising the price of Abita Amber to $5 and the for real imports to $6 is just ","useful":8,"cool":4},"HOwg6elHHtmx6s-O6_WgVg":{"text":"WTF is up with clearing the house at midnight during Jazz Fesf? Not cool. Two hours to set","useful":1,"cool":0},"TUltpZ6vzVPvTXygUika5g":{"text":"You can't go wrong with live music, great atmosphere and even greater people!","useful":0,"cool":0},"bb5KAEvVFn45MlqAvzfsyw":{"text":"Great bar with great live music. Came on a Friday with no cover and the band was amazing. ","useful":0,"cool":0},"yqYjrCPTL5CGBQ6Xjw2lcA":{"text":"Dear Tips,\n\nRaising the price of Abita Amber to $5 and the for real imports to $6 is just ","useful":11,"cool":4},"Um8vpESCYQaM6gh9SgCt_A":{"text":"Definitely stop here for the local music, no place else compares (even the FQ Tips). Also,","useful":0,"cool":0},"6iY_IdjQgjVmcfnLQpyJbw":{"text":"I had a great time a Tipitina's. I came here with my sister on a Saturday night and I was ","useful":4,"cool":1},"rdnu89GF-nbcAxZok-HTNQ":{"text":"St. Joseph's night started out with a group of us riding around Uptown New Orleans looking","useful":4,"cool":3},"TabjHHcjmEJc2n7--5nyCA":{"text":"Tips is bad ass... Period. Had a great time by myself last night and it didn't matter beca","useful":2,"cool":1},"2Eilz1IjhSVbNYo2WQj87Q":{"text":"Vintage.  Classic.  Awesome place to see live music in New Orleans...\n\nNot a bad seat in t","useful":0,"cool":0},"dmmPAdyW7eEn2xH9GC3MGA":{"text":"Great atmosphere, great music, but the staff is pretty unfriendly and they charge a dollar","useful":2,"cool":0},"H01cIJ7jlUqFntv9QRygIA":{"text":"If you like great music, especially LIVE, then a visit to New Orleans is incomplete withou","useful":1,"cool":1},"cbSHuoJ53vSqjxPinox3Lg":{"text":"Great venue with multiple bars, staff is friendly....the stairs had me in check after drin","useful":11,"cool":10},"P61csTnsp60cZnWxENWCAg":{"text":"This is my favorite music joint in NOLA. The bars can gets pretty packed, but it's managea","useful":4,"cool":2},"RpduaBoxqhMP1NPHFEbSPg":{"text":"Awful! We came here to see Kermit Ruffins. We paid for that. We spent 2 hours crowded up a","useful":0,"cool":0},"DxLC45LPDI4Sk1xL5JetsQ":{"text":"It seemed to me anyway that my arrival in New Orleans became official only upon entering t","useful":5,"cool":2},"c2uODBTxjgHL3mPa_BnfFQ":{"text":"a great venue with consistently good music of all genres, strong drinks, and moderate-to-p","useful":3,"cool":1},"0AHwNcb_ThwrLXGKTPq4Ug":{"text":"Get Tipsy at Tips!\n\nIf you know jazz then you know 'Tips' if you don't know jazz yet then ","useful":0,"cool":0},"z2zWSywnQB9W4Ar17aTAKQ":{"text":"The atmosphere of this place was super cool, vibey, and fun! However, the staff at the ent","useful":1,"cool":0},"0-9kc3Ti2wXdIqDu1m9UXQ":{"text":"This is THE classic institution of the New Orleans music scene. I have been to so many sho","useful":2,"cool":2},"Fo1jjq4o2YboOqwdeIIEFQ":{"text":"WTF is up with clearing the house at midnight during Jazz Fesf?  Not cool. Two hours to se","useful":0,"cool":0},"J8Tv2Wv-ZAb5650DuCqGDw":{"text":"I've lived here for 11 years and have been to Tipitina's many times and it's undoubtedly a","useful":0,"cool":0},"M3mBEmtFYyaRFSiHbBkovg":{"text":"It was late afternoon when I jumped a cab from my hotel on Bourbon Street, wanting to expa","useful":1,"cool":1},"ROy2PPU9CkD8nx5JJg3Ciw":{"text":"As far as music venues go, this one is fine. Large, loud, drinks flowing. The one star rat","useful":5,"cool":1},"ADjLSf-Hvnswwx5m2bx4aw":{"text":"I can't disagree with any of the raves in the other reviews, save one, and for me it's a d","useful":2,"cool":0},"bN0Tskj-VhetLyqYty4zdQ":{"text":"This place was okay... the music is EXTREMELY loud..the place is smokey..and the bathrooms","useful":1,"cool":0},"2kDT0WgEoQMgMGN_lHUE3Q":{"text":"Tipitina's is just the kind of place you want to hear your favorite band(s):  quaint, inti","useful":1,"cool":0},"aWigL9RUzN9TiTMmyIOSOA":{"text":"Tipitina's is a wondefful and important establishment, but I did just have a fairly negati","useful":1,"cool":0},"81latUDsF8woTuNehG0OZg":{"text":"Tip's is the sh!t!\n\nBesides the fact that it's one of the only venues I can actually walk ","useful":15,"cool":9},"rGUU55DgTWB-1QnnvWIMXQ":{"text":"Not much else to say but come out here and enjoy the world class music in a world class ve","useful":1,"cool":0},"fu3lVwKtKVX2hA6zrxmZTg":{"text":"Another great stop and awesome live music in New Orleans! The music scene in New Orleans i","useful":3,"cool":1},"D-p_c4PaPWB4WYia_7KPpQ":{"text":"Great legendary music venue. Bartenders were friendly, sound was great, and everywhere see","useful":1,"cool":0},"K7uD9FhPBDywyQ7IkzLi1A":{"text":"This. This is what all music venues should be like. It seems so simple, but most venues ge","useful":8,"cool":7},"qGDEjyH79eqtPq6UAlts6w":{"text":"Saw Dr.John tribute here. Positives are good quality live music, friendly crowd, easy to l","useful":0,"cool":0},"ZxmCzgrupmuuk7H5GS14uA":{"text":"I've never been to a bad show at Tips.\n\nIt's my favorite music venue in the city for a cou","useful":6,"cool":5},"5S5zIOYW-1G3ZP3-f0j8QQ":{"text":"Tip's is THE place to catch music, Uptown. Tourist, local, alien...you need to catch a sho","useful":4,"cool":2},"17tVbm6c1kCrczdT2l94Ow":{"text":"Classic venue that if you are a music officinado you need to check out but be aware that s","useful":0,"cool":0},"RhyBUvlaXh6syjmo1gXFyA":{"text":"I havent been there since 1992, but I used to live a few blocks away on valence st. I was ","useful":0,"cool":0},"pJqs-VcZta1hEPfbCpwf9Q":{"text":"What a surprise.  On free fridays the place is full of women under 25. They outnumber men ","useful":0,"cool":0},"VQRUIZaKMIWSB1qd3wr8fg":{"text":"Entertainment was well done and the emcee was funny. We went to the burlesque show and it ","useful":0,"cool":0},"Ml1EgejC5T5_Hy3F8AcHJw":{"text":"My friend was denied entry with her real, government issued ID and the bouncers were incre","useful":2,"cool":0},"l1wb_KSzHTtenRcxwLKpDg":{"text":"Music is good, but $18 each for cover and drinks that cost $16 each? Not to mention no sea","useful":0,"cool":0},"ubiBDUaLYXIvIwvbSmGHmQ":{"text":"Great spot for live music! Saw Benny and the Late Bloomers here and they were outstanding.","useful":1,"cool":0},"wxa2CwgJheig1ytuwIB4BA":{"text":"It's the best music venue in the city, and has only gotten better since Galactic took over","useful":0,"cool":0},"8u6_VK56c6LtVP-dZ3ZEkA":{"text":"such a fun place. great bar, great music, great space. 'nuff said.","useful":0,"cool":0},"Wyvu0aE0aW5PAQvs6y_wdg":{"text":"Intimidate venue with great beer choices and fair bar prices. Top that off with a fun, pos","useful":2,"cool":1},"zBX77Fv-S9CSTZaK1e3jsg":{"text":"Deserves more than 5 stars\nA perfect legendary special nola spot\nSo many great shows here ","useful":3,"cool":0},"BJtFmF5ElHrxSyvQXTsKTA":{"text":"Tchoupitoulas Stage\nBig Chief Longhair Pounds\nJaunty Beats on Keyboard Teeth\n#NOLA_Haiku","useful":1,"cool":0},"zUdf-ZYM9BXFYAKCe4xnVw":{"text":"Really enjoyed a small concert here this weekend! Tickets were easy to buy online (though ","useful":0,"cool":1},"XdEm7_bqpsrpEA0AlcnQdA":{"text":"Tip's is a fantastic little venue. Small, two levels. Several easy to get to bars both ups","useful":1,"cool":0},"cv2sf061l92LYaAZYb_lqg":{"text":"The kind of experience that brings you back to your college years, rocking on rock band, h","useful":6,"cool":3},"vSimeYyeJGHdE1wTZURcBQ":{"text":"At one point during my trip there was a chance I was going to see three separate shows her","useful":9,"cool":6},"dFApXMXPJ1M_aNfMHA7MfA":{"text":"Great shows here all the time. Worth checking out. Drinks are not too expensive either.","useful":0,"cool":0},"V5a8JdZxxOkNBsp7cIWVfA":{"text":"Came here to watch Rebirth perform.  Tickets were $27.  \n\nBartenders were quick and friend","useful":11,"cool":6},"7wK813MZilS_Y23DG-1Gtg":{"text":"Pretty cool music venue, reminded me of some of my favorite spots back home in Glasgow, Sc","useful":11,"cool":8},"bheyYZR3B_VkYVXhawhVbw":{"text":"I think this is my favorite bar in the city. Great music, not expensive, friendly staff. P","useful":1,"cool":0}}