{"7aU6I6OjbYBEEWc-TgCUEg":{"text":"We really enjoy camp Bow Wow and so do our dogs! The staff is very courteous and the dogs ","useful":3,"cool":0},"acdIUFMwLYcVecvaEmvErg":{"text":"I like this place and so does my dog. I have a very energetic Catahoula and he comes home ","useful":2,"cool":0},"qVJ7eQSZNc9uOBreODFhRw":{"text":"I LOVE Camp Bow Wow... rather, my pooches LOVE it... aww hell what can I say we all love i","useful":9,"cool":6},"M7UhXwOdLQVCljJdmCxVzQ":{"text":"I love Camp Bow Wow!  They always have fun stuff going on; my pup seems to come home happy","useful":0,"cool":0},"SbKj5x_qsznwNkBgbNKFHw":{"text":"Camp bow wow is absolutely incredible! The prices are pretty reasonable and the staff is a","useful":0,"cool":0},"W8KGJp8E1z_pWYEq8yixKA":{"text":"Camp Bow Wow on Tchoupitoulas is the BEST!  Everyone is so friendly and they love my baby!","useful":2,"cool":0},"q9tmyrAk7wo1TofbVQxBPg":{"text":"My dog loves camp. He was very shy when we adopted him and unfortunately I don't always ha","useful":0,"cool":0},"scNoxjCYaUr60Fw6W3p2oA":{"text":"My dog just got back from her first boarding here and I couldn't be more happy with the ex","useful":2,"cool":0},"bcblCyuINf7B8-Ew0d0nuw":{"text":"Everyone is so friendly and they seem to really love their jobs. I feel like my Siberian H","useful":1,"cool":0},"OyRk5HfZCsYj_szk6kfGQA":{"text":"We spen a couple of days in New Orleans and arranged day care for our dog to spend the day","useful":1,"cool":0},"yjNaIsbdKVvsHhp8maU0Bg":{"text":"I love the friendly and efficient staff. They are very attentive to the dogs and their own","useful":1,"cool":0},"d6-YeOQLNTBXGcTsUEZyTA":{"text":"Sigh. I really like Camp Bow Wow for a number of reasons. They have great hours, the staff","useful":11,"cool":2},"uZE3aZH0c3A1S88WX2cqAQ":{"text":"Camp bow wow is absolutely incredible! The prices are pretty reasonable and the staff is a","useful":1,"cool":0},"gq4YqseAQCFMO0NrAp8-Tg":{"text":"Love this camp so much. I am a first time dog mama, and therefor fairly hesitant about lea","useful":3,"cool":0},"zJxejkNS60BpNA7OQywGtg":{"text":"Got home buddies through camp bow wow and it was a wonderful experience. The pricing is gr","useful":5,"cool":0},"Q1SqqiGVVt1Xy1tIyX-vUg":{"text":"The place was beautiful and every staff member I came in contact with was super friendly a","useful":2,"cool":0},"-qLUxna35H-P6s3FWgJJ4w":{"text":"I was so impressed, when we visited the city recently we left my dog here for a couple of ","useful":0,"cool":0},"fcdCWnpR50IUZmxMELlxSA":{"text":"Its more expensive than say a vets office boarding service but the piece of mind if worth ","useful":5,"cool":1},"sqzNeR02Kofcoyv79XK3Cw":{"text":"Our kids went.there every day that we were in nola and they were happy and tired at the en","useful":2,"cool":0},"c-wxajl-lrCD7wo_nQO6wg":{"text":"I had to evacuate Florida and bring my doggy.  I love the service and treatment that they ","useful":0,"cool":0},"Mqd6TzxHpRFS_CcQYYLhqg":{"text":"My dog, Hayley rose, loves camp bow wow!!!! I have taken her here for boarding and day car","useful":0,"cool":0},"FlN3DILxL6p60KppP9TcPw":{"text":"We have used other day care services out of town  and my dog always ended up over stimulat","useful":3,"cool":0},"gki3LW2FjvOwhQ96nFyWWw":{"text":"My child LOVES LOVES LOVES this place! We try to go at least 2x a week. Best part? Well i ","useful":2,"cool":1},"NRyG2RFL8bLMyCCt6XEqJQ":{"text":"Beau Jacques, my 60 lbs poodle mix, loves his time at Camp. Whether it's daycare or overni","useful":1,"cool":1},"2dpJHBfinsUAcy_Ey0uUtQ":{"text":"This establishment and staff are absolutely Fantastic. My Baby Buddy stayed here on 3/20/1","useful":0,"cool":0},"DkVFT1b-RkOeqjJF9VD-SA":{"text":"We love Camp Bow Wow. We have used them for years in both Baton Rouge and New Orleans. \n\nT","useful":1,"cool":1},"8JlP-4irJw2JpMvUXUnIxQ":{"text":"My dog loves Camp Bow Wow, and I do too.  The people on staff are friendly and seem to enj","useful":3,"cool":1},"mukBQYskYg6tXAx0GHX13A":{"text":"That I feel comfortable letting my dog go here. I'm a helicopter mom and love being able t","useful":2,"cool":0},"k23hGJHGjG0by6n42L-8ug":{"text":"Deb and her team are the best! We've had the best experience taking our chihuahua/dachshun","useful":0,"cool":0},"ZbWREeUL8VqApLFkE1t5pw":{"text":"We use camp bow wow all the time. Great staff,great areas for dogs to play.most importantl","useful":2,"cool":0},"S5sPIbTF1W9xzMJ9vRLIcQ":{"text":"I brought my two babies to Camp Bow Wow while attending a family reunion in Hammond. I ret","useful":9,"cool":0},"C0lC_OWf6MX9108vKBVy_w":{"text":"I love Camp Bow Wow!  The staff is friendly and knowledgeable.  My recent experience with ","useful":0,"cool":0},"_HIFWQcM3UH044C3e5nHlA":{"text":"The staff is friendly and I am very pleased with the baths.  I think it is over-priced for","useful":3,"cool":0},"I86-DobW7q7Dk3BH42vuXA":{"text":"We were just in New Orleans for a couple of days I was really nervous about leaving our li","useful":0,"cool":0},"AeTjEl4vdC7aQpCDRr5tuQ":{"text":"I took my puppy here so she could spend the day with other dogs while I went to the French","useful":5,"cool":1},"ZXyL7C57SoCpJcNm0_VfhA":{"text":"I am so happy I discovered Camp Bow Wow - Mid-City New Orleans! My 4 year old boxer hasn't","useful":0,"cool":0},"si-fi9-DRamzP4VWlIwORw":{"text":"We (my wife, me, and our dog) LOVED this place! The staff is absolutely super. They knew w","useful":1,"cool":1},"bsnmc25idnjgncbGvnyqcw":{"text":"This Camp Bow Wow, as much as I wanted it to be a great place for my dog is poorly run. Ex","useful":16,"cool":1},"WA5nwB9AjGD6MANCw9lr4Q":{"text":"We left our 5.5 chihuahua, Atticus Finch, at Camp Bow Wow for 3-4 days when we were in tow","useful":5,"cool":0},"yDunTQxHk-yWiOKVCD6V8g":{"text":"I love Camp Bow Wow!  They always have fun stuff going on; my pup seems to come home happy","useful":0,"cool":1},"unjZY6zRUUFUwakRvVXakA":{"text":"Terrible service.  Front end is very rude and management is non existant. You will be bett","useful":2,"cool":0},"9TeILSF-58s-yxk0iub8BQ":{"text":"The staff is very friendly and my dog was hesitant at first but was happy when he left but","useful":4,"cool":0},"Ng4heVHfwv6AxErvRihZrQ":{"text":"Horrible experience!  Don't take your dog here if you love them. Our 9 year old mild manne","useful":9,"cool":0},"dZdjAVggTSd6QGXoJ-zEIQ":{"text":"I think the people at Camp Bow Wow are friendly and have good intentions, but the services","useful":9,"cool":0},"d5XS3OUZHWvGGTMbpMSE1Q":{"text":"When boarding my dog at this location, he was not put in the play area with other dogs unt","useful":0,"cool":0},"QSgogvTNhVWgH_uXmPSyZw":{"text":"Extremely disappointed. The last 2 times I have sent my dog to camp bow wow she has come h","useful":4,"cool":0},"MX4rX6QjIOyrRZKRzDwoOA":{"text":"I've sent many messages about training for my puppy that went unanswered. I will look some","useful":3,"cool":0},"FLZYStHzsCqBU08MDkMnTw":{"text":"This is a wonderful place for dogs, and their families. I have a rescue who had a difficul","useful":2,"cool":0},"PCw21DcSfRKFfVOGFEKMzw":{"text":"We continue to be very impressed with Camp Bow Wow. My dog Mary has been going here for ye","useful":2,"cool":0},"m2hR-cW_mzUR1mzCT6TxwA":{"text":"This place is the best!  My dog is always super excited once we turn down Tcoup and  the s","useful":0,"cool":0},"pyndCWbFP2Z7ZD-y4ayWAQ":{"text":"Great knowledgeable staff + doggie fun + going above and beyond for animals = the place my","useful":2,"cool":1},"5IV07IcvceZ7J1sTZ8XTjA":{"text":"I cannot say enough about how amazed I am by camp bow wow wow and this staff! I'm a comple","useful":0,"cool":0},"vu4NtLLyGLpeyK0z1qZcXg":{"text":"I took my border collie/terrier mix to Camp Bow Wow's grooming and bathing service. I can'","useful":2,"cool":0},"WqgEQPsMXqJAxu0DmgSEsQ":{"text":"Poo on the floor, workers are inconsiderate. My dog isn't a golden retriever so they didn'","useful":0,"cool":0},"s0sDDrtNIFw-KUAhGskQCA":{"text":"We were planning a trip to New Orleans, and wanted to take our dogs with us as we found a ","useful":10,"cool":0},"xVLg2srAYrI9ye2OQt0yfA":{"text":"Let me preface this by saying we didn't make it past the 'interview.' Called to schedule i","useful":16,"cool":1},"VYG1m0JJKhAYmr1oA78YVw":{"text":"My first stay with CBW was really positive! My dog, a boxer-pitbull mix, did well doing he","useful":14,"cool":1},"b7w6xrQ3EqfHwjhqJxBEEw":{"text":"Absolute garbage. The people at the desk are completely incompetent and it seems like the ","useful":2,"cool":0},"4b_beg4CL-Q-KaFJXRrzCg":{"text":"The staff is great!  You can tell they enjoy what they are doing.  My dog loves going ther","useful":0,"cool":0},"ksg8fZCVTnatduif_rZOPg":{"text":"Would never recommend this place to anyone. I am from ATL and my dog enjoys a daycare here","useful":13,"cool":5},"nndpcBu9p7SepYNfsHx6Nw":{"text":"Zuzu made a ton of friends and you can web cam your pooch all day.  Staff was exceptional.","useful":2,"cool":1},"h2Rj29zyDs3Suz5mdGHHPQ":{"text":"If our dog was writing this review, he would certainly give them 5 stars.  He absolutely l","useful":0,"cool":0},"ZYqy631VZsG_yEVZS1Nsjg":{"text":"Don't take your pet to this place. I brought my fur baby to this place for interview and d","useful":4,"cool":1},"RuzQnHEG54CgljVJNRnDuw":{"text":"I am horribly disappointed with this location. I am originally from the Chicagoland area, ","useful":13,"cool":0},"_-IdZ11LnRC5dincNObRLg":{"text":"I wanted to let everybody know what happened to my dog. After returning from the Covid pan","useful":2,"cool":0},"BU52tVpEPp5jmKds4RRaWg":{"text":"Bring my puppies here whenever we are out of town. They love the community and Caine home ","useful":1,"cool":1},"cBritXLjr1_MaeZpgI02FA":{"text":"I have been bringing my dog to camp Bow wow since they opened. It has always been a fantas","useful":0,"cool":1},"TjBysr8HwMnJ-hWSde37qw":{"text":"My husband and I left our very energetic 11 month old puppy here for five days when we wen","useful":14,"cool":0},"kOP-0TqrV3c5UR2IsAwgnA":{"text":"Would absolutely NOT recommend. Brought my 8 month old boy to camp for his initial intervi","useful":3,"cool":1}}