{"7-LzL1m99QJXgdM_cPfOxg":{"text":"Only been here once but it was good.\n\nIt's an upscale restaurant tucked away on Fulton nex","useful":0,"cool":1},"a9hECCbqf_Z-OoyCeTFCTA":{"text":"So I came here twice in the same day, apparently 90% of restaurants are closed on Mardi Gr","useful":2,"cool":0},"XQzdAa-N8LThuxcGQPhP1g":{"text":"Jambalaya was not spicy but maybe it's not supposed to be? I haven't had it in New Orleans","useful":0,"cool":0},"FvN1cErcEIfTOtLIUwOgLQ":{"text":"After reading the reviews we decided to go with the benefit of the doubt and try it out an","useful":0,"cool":0},"Tz640DPCUtmtZ89RWGQ83A":{"text":"I only went here because I showed up to the yelp block party 15 minutes early. I didn't st","useful":6,"cool":2},"Mr_7ZXUE6zD2tG0IT31QFg":{"text":"Surprised to find hardly anyone in the dining room, even though our reso was for 9p.  The ","useful":0,"cool":0},"es3Uj0jMtHstkvwNNhihNQ":{"text":"We were the only diners on Easter evening and it was wonderful. Leon was a fantastic serve","useful":0,"cool":0},"srdAoIo_6KzeEMzO20WaOg":{"text":"I had a Groupon and was in town for the Essence Music Festival this year.  This restaurant","useful":0,"cool":0},"aEf7qnopwWqo_KYjK0Kc-A":{"text":"I had read good things about this restaurant written by a local food critic whom I trust, ","useful":0,"cool":0},"Z7QTUtLUZr6Naxh7I2ew4w":{"text":"This was the worst food I've ever had to pay for, and we paid dearly! No wonder the restau","useful":0,"cool":1},"Zxe-2BltiPGW2MrwqtyMLA":{"text":"The food was good, especially the BBQ shrimp. The service was poor and even downright weir","useful":0,"cool":0},"Q7XBa-lPwvq1qgybSbH-Ig":{"text":"Our Woman's Club of Thibdaux today had lunch at 7 on Fulton . It was wonderful! We had eig","useful":0,"cool":0},"PkJkUZL_vFLE92A4QLRZDA":{"text":"*sigh*  i think our server wasn't really a waiter, but an actor, auditioning for Les Miz. ","useful":0,"cool":0},"fkMMveo1nna1_CTHb_k5hA":{"text":"had read good things about this place and the menu looked great. i made a reservation thro","useful":0,"cool":0},"sNUeVpNxa-fGQ98LP65JZg":{"text":"Decor was very lame.  It looked like a typical hotel restaurant.  Food wasn't terrible, bu","useful":0,"cool":0},"aIk21t3mKXUylGDSlVPFPg":{"text":"Allergy sufferers and vegetarians beware.\n\nI had a subpar to horrible experience at this r","useful":6,"cool":0},"AIrlRLo6dk4ImBSJCC41dQ":{"text":"I may be biased because I frequently stop in at this as-yet undiscovered jewel in the ware","useful":7,"cool":4},"siPgPHTiSKOt4pmsQ49hVA":{"text":"Service and kitchen both were indifferent and barely competent, even though there were onl","useful":0,"cool":0},"4h7ROjjdsWhl8r8GOhv1JA":{"text":"7 on Fulton is located inside the Omni Hotel (formerly the Wyndham ... which we found out ","useful":1,"cool":1},"vQmloL3MKKtI8IcvBAuJ-Q":{"text":"Dinner was good but not great. Service was the worst. The waiter took FOREVER to get to us","useful":0,"cool":0},"4C-7WSTkJ30sqZwC-2PoUg":{"text":"In the interest of full disclosure, I'd just like to preface this review with the acknowle","useful":11,"cool":7},"eO34t5zhrD-KT5eoJ7C8Fw":{"text":"This place is connected to the Wyndham hotel. We made a reservation for 7:45 thinking we w","useful":0,"cool":0},"gJ_HWVD2dHvgSAuIMAoWuA":{"text":"The conference arranged lunch for us at this restaurant....it was closed for general busin","useful":4,"cool":6},"VkcYY8JA-3emXLktBzkRiA":{"text":"Wonderful Christmas buffet. Will go back during a normal day and check out the food and, m","useful":0,"cool":0},"yZjpS1ila3xxtZEBOHXrjA":{"text":"Sad to say, I wasted a meal in New Orleans.  Friday night at 7:30 and my wife and I were t","useful":5,"cool":1}}