{"rYU8MSrJZqfaBs-xXhanbg":{"text":"The food was not very good.  They had plenty of chairs in the back but yet didn't even bot","useful":0,"cool":0},"vV3AJSvTodkLpyARbhwmkA":{"text":"Green Goddess is a small restaurant, but has both indoor and outdoor seating. It wasn't th","useful":0,"cool":0},"jq0m-JLpUZrvEvXomP6G3g":{"text":"This place is hidden in an alley way, but I'm glad I tried it. I had the Indian pancake an","useful":0,"cool":0},"NoCJSh2I9NMtCEqvf7IMsA":{"text":"Holy shit! this place is good! And that is saying something when the restaurant is in NOLA","useful":0,"cool":0},"0aKWAf7Dlwm23ItAc5WACQ":{"text":"Service was terrible! Waitress made a really snarky comment and was not even efficient!!! ","useful":0,"cool":0},"t9PazeCCuNRnJ9I2r2YCoA":{"text":"Came here in July. 90f at midnight. Amazing. Seats about 8 people inside, I reckon a dozen","useful":3,"cool":2},"1f6tVrXGpV__nYgqg5K-XQ":{"text":"Went here for Valentine's. Small portions and not impressionable food. I really wanted to ","useful":0,"cool":0},"WVJnth0SqzARXHBKrJfI_A":{"text":"So I was looking for something less traditional, light, yet somewhat filling and savory...","useful":0,"cool":0},"2Mst3ryoORrjBf2k1saCZA":{"text":"Awesome food--great for vegetarians.  A little pricey for those on a budget but it was my ","useful":0,"cool":0},"c1TZz1FmYxHm89_2Bo6WtQ":{"text":"I recently stayed in NOLA for three days, and this was the only restaurant I ate at that s","useful":0,"cool":0},"kDRzQMNcpNyLZtbTJ81Nww":{"text":"What a wonderful evening!! I had heard great things about Green Goddess, but when I previe","useful":1,"cool":0},"TtlouMSOlPgKT7AsuKqPWA":{"text":"Green Goddess has a pretty fantastic menu, and is well-located on Exchange Street. It's a ","useful":0,"cool":0},"my6NocKOYEL7HyZMREtz7Q":{"text":"I was a little worried about finding a great place for a late breakfast (ok, maybe it was ","useful":1,"cool":1},"OHyF9XKTokHypPICyboYGg":{"text":"I had two separate experiences at Green Goddess- one that was a review worthy of a 4 or 5 ","useful":0,"cool":0},"KSF6vIoHE7QXRpGgW9FgCw":{"text":"Tonight was my sixth time eating at the Green Goddess.  If you can't tell, I love this pla","useful":2,"cool":1},"br6s1tQBHq2zg2_3kboWdA":{"text":"Summary based on 1 lunch:\n--pleasant, somewhat out of the way venue on pedestrian mall\n--v","useful":0,"cool":1},"84GCUhKbJm0HSGftVfGZFA":{"text":"Definitely one of my top 3 meals on this trip to New Orleans. As a vegetarian, New Orleans","useful":1,"cool":0},"Rmi2OV6UNfRul_746Vo77Q":{"text":"2 distinct things I remember about New Orleans: 1) supposed lil wayne's cousin giving us a","useful":3,"cool":2},"swr9i9_cIwxhjkURTDNTwg":{"text":"Service: Excellent. Smiling and pleasant wait staff. Prompt and not overbearing. \n\nFood: I","useful":0,"cool":0},"oKJBG09CccWuUW2KSOFCZA":{"text":"My wife and I did some research online before our trip to NOLA over New Year's, and found ","useful":1,"cool":1},"ERojzMzDi9Va5rvxKlGb_A":{"text":"After reading many positive reviews of Green Goddess, I admit I was skeptical when I first","useful":3,"cool":0},"cT_dfo1ttlYh6x72oSLZCg":{"text":"Green Goddess is the most remarkable restaurant anyone in our group has ever been to in th","useful":3,"cool":1},"B541EdvtG_d781ZyCZRyGw":{"text":"When to NOLA for a birthday getaway. Let me tell you it's delicious! It was 3 of us and we","useful":1,"cool":0},"IsIlFG8PSWXrFOqhD2Pdfg":{"text":"Spent time researching this place. Show up to a tiny dirty little dive . Not sure where th","useful":0,"cool":0},"YbKkxhkWiKJc_9-XY_ZKAw":{"text":"This is a very unique restaurant. Not fine dining, which is fine with me. I was travelling","useful":0,"cool":0},"s9enow6_ZfthCUJ3tmWI5g":{"text":"My night with Chef Chris and Co. at Green Goddess was a culinary highlight in my foodie-fi","useful":1,"cool":1},"S7aUheZhpdmwdgz5tIaExQ":{"text":"Let me start off by saying I loved the utensils. They were so different!\n \nI went here for","useful":0,"cool":0},"ziMGsGPgccVHa1fCbBASFg":{"text":"Absolutely amazing! The aesthetics and atmosphere feels like you are in Paris. Great selec","useful":0,"cool":0},"q05dC5DWm2wN7GYSoLYhlQ":{"text":"ok this place has some serious staff issues.  they would completely overshadow the joy i h","useful":2,"cool":1},"ccYYPvyBFtrIr3wDAn26GQ":{"text":"We had a delicious lunch here, though the prices were kind of high, I guess it cannot be a","useful":0,"cool":0},"zM5rFqv8xj8GBf8pL3PB4w":{"text":"It was fine. Obviously they have many options for vegetarians. But the restaurant seemed v","useful":0,"cool":0},"F8H4dQ6514HJNyd0zU2MPQ":{"text":"This was ok, I am not a vegetarian. I did eat at Carmo a few times before trying this and ","useful":0,"cool":0},"ChY1Alpjx6vEJ7yPLCJOFw":{"text":"Really enjoyed his place. Really nice outdoor seating with a breeze (I suppose they didn't","useful":0,"cool":0},"Ei1ZV9KRKtTA3Qhng8Wenw":{"text":"The grilled cheese with pear butter might be the apex of the grilled cheese art form, espe","useful":0,"cool":0},"_Joui4scMiGOQyTNcIC4BQ":{"text":"A refuge for vegetarians in a city with dismally few options; creative menu! Even hip!","useful":1,"cool":0},"CVCZO5GQcVIvR6-xrQxqLA":{"text":"We dined at Amano, Green Goddess, Root, Peche while in Nola for a few days. My favorite wa","useful":2,"cool":1},"JPk4P3EM3ohw1ancmnCLRA":{"text":"Green Goddess is tucked away in Exchange Place and offers nice al fresco dining if the wea","useful":2,"cool":1},"NIfCnDN0z0vgL7rWMBgfEg":{"text":"SO glad to find Green Goddess open on a Sunday night. I was looking for a cool place to ch","useful":0,"cool":0},"2ia8WE7_lJeu6LTYj0-dOg":{"text":"I can't... I've tried... I just, I just can't put into words how much I love this place. C","useful":1,"cool":1},"B0urmD5T1cDMzX-hS9yAgw":{"text":"Wedge salad for starters, snails, tails and tasso as the main, followed by the most decade","useful":0,"cool":0},"B_fq-xlrkup3YU8W0-CBeQ":{"text":"Four words.....Kale, Burrata, Beet, Salad. I can't say enough about how fantastic this dis","useful":0,"cool":0},"fMVmJ_vY0_7oC2P0-LCVYA":{"text":"Get the grilled cheese.  The chef and owner came out to talk to all the guests.  All the d","useful":0,"cool":0},"uA9C7QxXqGcM7EHckG-dNw":{"text":"Awesome place and excellent service . Staff is very friendly and helpful to guide thru men","useful":0,"cool":1},"-By6ZIlhrFI6P6puV70-zQ":{"text":"Would have liked to try the food and drinks here based on the reviews.  But, as we walked ","useful":0,"cool":0},"oRMlk2D5NKuZhqp0tt4Q5g":{"text":"Great food & service. WiFi was down. Loved the collard greens Cuban sandwich with cold wat","useful":0,"cool":0},"3d0xngGlrLtIx0Wef7iM9A":{"text":"As vegetarians finding food in NOLA is a challenge. The food at Green Goddess was amazing ","useful":0,"cool":0},"0W5HkaP9AjS1xFICBn5mjg":{"text":"A former local told us we had to try it. \nAWESOME meal. \nSo good we went back again the ne","useful":0,"cool":0},"oiIc0oB1hWR4743FvMa1SQ":{"text":"I was desperate for a salad in NewOrleans and was tickled pink to find this place.  I need","useful":0,"cool":1},"I5IdQgkR7AwKBIDMGwQY4g":{"text":"Top 10 meals I've ever had! Amazing! So fresh and delicious! Everything was seasoned perfe","useful":0,"cool":0},"P7SpO6oUfpZvpzeBh6Jmeg":{"text":"NOT EASY to find vegetarian food when staying near the French Quarter. This place is IT! D","useful":0,"cool":0},"-moEPRNNJ8Mb1-7P3j3dEQ":{"text":"If you are looking for a array of flavors with interesting combinations then you are in fo","useful":0,"cool":0},"jFTrVgigsdLoNQFUos0eaw":{"text":"FANTASTIC \nWe had lunched and liked it so much we came back for dinner\nI forgot to take a ","useful":0,"cool":0},"mLPoQUBRv3uWEY-g2AuCkg":{"text":"Obviously this place is awesome.\n\nCool little outdoor spot, in an alley near The Montelion","useful":1,"cool":0},"qin2oXMXX4TwqUcUiuiX9w":{"text":"Recvomended by a Lady we met at stage door manor in upstate NY. We saw a few old looking s","useful":0,"cool":0},"pCjLNirEvvTrQkSvqo2txQ":{"text":"SO Delicious! A little hard to find....(I'm from out of town) but worth the hunt! \n\nOne of","useful":1,"cool":0},"iL5IxOi4xeOm8n2HQG7ilQ":{"text":"My wife and I had dinner at Green Goddess on their third night in business. Overall, we th","useful":1,"cool":1},"qIq0qDMg_Rz4FXW71jKTbw":{"text":"Duck confit is bull***t! Skip the salad..seriously. the dressing was awful and the duck ta","useful":0,"cool":0},"rFy0m-d5G3HWdYapgqJH2w":{"text":"Mixed review.\n\nFood:\nMojo pork was amazing. One of the best dishes I had in New Orleans. W","useful":0,"cool":0},"S35vTJjtAuzmOSRwpqMJ8w":{"text":"Interesting- Some things were just ok, but some things were AMAZING. The cocktails are ove","useful":1,"cool":0},"JZ35RLQIayXF0IKZB15qfg":{"text":"If you order well here, this might be one of the great meals of your life. Yes, you'll hav","useful":1,"cool":0},"8ItNb85W-LKg_344D41Dbw":{"text":"I went here for lunch twice with my husband.  The first time we were happy with our meal. ","useful":0,"cool":0},"DP17_HtBYJh6rFxrYLsdfw":{"text":"Hands down my favorite spot in Nola.  For an epic one of a kind experience order the tasti","useful":1,"cool":0},"_87F3t2WglNH-Q5CrC284w":{"text":"I will never forget the watermelon basil gazpacho topped with fresh crab that was perfect ","useful":0,"cool":0},"uLbCYp76XLZNccn01WdxKw":{"text":"Went back for my 'last meal' in the city during my second trip to nola, and I just can't s","useful":1,"cool":0},"6B7If3ktubxqhMjmlodMug":{"text":"Great Place. Food was very good and the cocktails imaginative. Even the guy with the nose ","useful":2,"cool":1},"eN_lThxfNWIKUGDed18eiw":{"text":"Fabulous! Creative food and drink and wonderful service. I was dining in a party with both","useful":1,"cool":1},"S-HzEPlWvoQ8lvDsTNzyRA":{"text":"Had the meatloaf sandwich and it was one of the best sandwiches I've ever had!!! Would def","useful":0,"cool":0},"gyGIWtXmk8sMNBoa8itrCg":{"text":"Delicious food, great service, and perfect location!  We hit Bourbon street for a little b","useful":0,"cool":0},"spkaevWlybmG0zkc0SAUTw":{"text":"awesome and different.  outside seating, in a quiet alleyway, not trashy.  Wait staff was ","useful":0,"cool":0},"lGtUR1Y9xGOIksq_0C_0rw":{"text":"One of the best meals I've ever had in New Orleans.\n\nWe started off with cocktails, they w","useful":0,"cool":0},"2MvFR5Pi6zSrFXUzF5uY0A":{"text":"I stopped by Green Goddess after I already had lunch, so I only tried their bacon sundae f","useful":0,"cool":0},"6IQYsCYqDT90p-2goWTzQA":{"text":"Brunch.  One of the best meals of my life.  Even now, sitting in my office thinking about ","useful":5,"cool":1},"zLjGRgjLO7vLXekKW_5_mg":{"text":"Overpriced, and the food is flavorless and nothing special. The wait staff is also incredi","useful":0,"cool":0},"BVaYb40zZq-jn3aW0QhFdA":{"text":"This place looks super cute from the outside. Too bad the seating inside doesn't match up.","useful":0,"cool":0},"kADMs5wwV_xuquG-HLmYZA":{"text":"The best place around! We ate here for lunch and dinner and tried most vegan and vegetaria","useful":1,"cool":1},"Rmi9tWItOmu9UyfcXOTf_Q":{"text":"I'm giving this place 5 stars because I've been searching for some quality, non-touristy a","useful":2,"cool":1},"Awi3-uqlYlB4MHKrXrsAew":{"text":"They have one of the best wedge salads I have ever had.  Also the sweet potato biscuits ar","useful":0,"cool":0},"JLL0ugZmyonR1g4nT4E71w":{"text":"Great vegetarian heaven that's heath-conscious!\nIt's in an alley and you dine outdoors. Th","useful":2,"cool":0},"L0q1_cPVM24rYNMV0gYHBQ":{"text":"The food was nice... a bit pricey. There was som lack of good vibes at the place. ... mayb","useful":0,"cool":0},"6ZtwEUdQ0Ga0ikclrN2UhA":{"text":"After days of fried food my husband & I were craving some leafy greens, not easy to come b","useful":0,"cool":0},"wKLfUOc9aPwIXV2evVmlKA":{"text":"Another gem. At first the menu seemed a bit distracted. Having decided on the Himalayan sa","useful":0,"cool":0},"WKizWUZmPmsEgYza8RSH5A":{"text":"Green Goddess was a fun place to eat!  The location was excellent and very unexpected.  Us","useful":4,"cool":2},"Wp0Qi1JhinuiHYJOgnoyPA":{"text":"I had my best vegan meal here! Citrus hongo and the bananas foster are shake in my boots g","useful":0,"cool":0},"YfEa3-WNbSMQKihU8DxYeg":{"text":"Wonderful place.  I had the apple French toast as lunch and it was perfect.  Savory and sw","useful":1,"cool":1},"MC1OUuyOP6eIb27ZLr7M7g":{"text":"In a word.......brilliant.\n\nAs far as I can tell, there are two guys working the kitchen a","useful":0,"cool":3},"axYU7gAWugPuRAe9DZgZ4Q":{"text":"The restaurant is on a cute little street, and has reasonable number of options for a vege","useful":0,"cool":0},"nlu1t4E0wB4DvBY9aVXP1g":{"text":"Delicious and healthy option (hard to find that combo in Nola). Also like the location. Hi","useful":0,"cool":0},"C70EEVdZgC-hPEnuFtvJvQ":{"text":"Just happened across this place down a pedestrian alley in the French Quarter.  The menu l","useful":0,"cool":0},"8bVFn5kxlD-HDepcZFHEDw":{"text":"Service wasn't great but the food was AMAZING! beet hummus is a must also had a salad w th","useful":0,"cool":0},"5cSCjmmpYYq4lzUIxjiRgg":{"text":"Great vegetarian options!  Interesting menu and nice location with outdoor seating. A litt","useful":0,"cool":0},"p0z315AMkTujIzt-pUlSug":{"text":"Perfect, absolute LOVE! 12 seats indoors, casual, most intimate as you can get!  Obviously","useful":0,"cool":0},"xEO3f_i2me7ZirLIcd3Nqg":{"text":"Loved, loved, loved the food!!!\n\nI was so glad we got to eat here before we left. Definite","useful":1,"cool":2},"rHtMxCekhe4JaM2_spiROw":{"text":"Great food, service could be better. I had the Raclette and a glass of wine. The food was ","useful":0,"cool":0},"yw9kvw1ad4s44R3YanbsDg":{"text":"I think the place is overhyped and overpriced. It is a good concept restaurant, but you ha","useful":0,"cool":0},"wnQ1oeCa9t70cFXdyOrIOw":{"text":"A cute little out of the way charmer. We had some wine and cheese which was delicious and ","useful":0,"cool":0},"o5FL8rvtqcbXmzCGQ8YAtQ":{"text":"Was in the area for business and travelling with a vegetarian so we decided to give Green ","useful":0,"cool":0},"DSkv8Usj5SfZpnn0ZFnuoA":{"text":"Friend and both thought food tasted very good. \n\nBoth cocktails were straight nasty.\n\nThe ","useful":2,"cool":0},"B5Lu4UzFvPh4fwTe5BC2mg":{"text":"Best meal I've had in New Orleans. \n\nI got the sweet potato biscuits with mushroom gravy a","useful":0,"cool":0},"eyZYnARgSl3-uS-goygh_w":{"text":"We are visitors to New Orleans and chose Green Goddess based on yelp reviews, vicinity to ","useful":1,"cool":0},"lpZYLz2k3THPTctQVP3yvA":{"text":"Highly recommended.\n\nThose with a culinary taste for adventure will be greatly rewarded. R","useful":0,"cool":0},"_owUPqhXpkRYllkraNMZsA":{"text":"Agree with many of the other reviews: great spot, great food but the service really needs ","useful":0,"cool":0},"AwDjiUcgQua2f3jpQGa2YA":{"text":"I was staying at the InterContinental with 2 coworkers for a conference and we asked the c","useful":0,"cool":0},"BlEjLa2xmf2hv-yvmILdvQ":{"text":"In short: tasty food, lackluster service, and ridiculous wait time for food. \n\nThis review","useful":1,"cool":0},"GPPhs_unrd68oiYc6znQHA":{"text":"Disappointing salads, mediocre entrees, tiny portions. \n\nI was excited to try a vegetarian","useful":0,"cool":0},"LkR2LognTgGNKQpeSEyKkg":{"text":"It was a bit confusing when I walked up but one of the servers noticed me looking lost and","useful":1,"cool":0},"Bo3wLQeosw_tOmC55v2Jdw":{"text":"Every time I go to New Orleans, I stop by Green Goddess. This place does vegetarian and ve","useful":1,"cool":2},"10ahbPNUdulVHZJqZS8iwA":{"text":"We had the lemon grass tofu and it was so good we had to come back the next day to have it","useful":0,"cool":0},"OKGt04Uew8cc0NdUUUNRIg":{"text":"Pretty much the best meal of my life.  It didn't hurt that we were VERY hungry, and happy ","useful":4,"cool":2},"RugCtE7Kgx2cdVLWDCHc_Q":{"text":"Truly amazing!  Had the utthappam. Want to come back now every night I'm here! Cozy ambian","useful":0,"cool":0},"-v-3UUSKRL7-xXWqdcfYDA":{"text":"Such a savior for a vegetarian in the world of jambalaya and po boys. Highly recommend ver","useful":1,"cool":0},"rDSuDMXp2L4q6yxabxTdNg":{"text":"Great to see a restaurant like this in the new orleans area. Very good food.  Very good se","useful":0,"cool":0},"DSfvuWkDG5yb4edwz4uuiw":{"text":"What a wonderful surprise! We had dinner last night at Emeril's, which was superb, but thi","useful":0,"cool":0},"wFRvM1ij2pKHre9VKBxujQ":{"text":"Unexpectedly good - the flavor combos were inventive but worked. The boyfriend's pulled po","useful":0,"cool":0},"OFy-hHe_Qy4JpEfA04EMkw":{"text":"I have mixed feelings about Green Goddess. I had a duck sausage po-boy which was pretty go","useful":0,"cool":0},"JHSM4N-4bTToL4bphohK2w":{"text":"This was one of the best vegetarian meals we had in NOLA. The sweet potato biscuits with m","useful":1,"cool":0},"6ra9I_IR61UvifGlye0i_g":{"text":"Years ago, while visiting NOLA, I patronized the Green Goddess and sought this place out o","useful":0,"cool":0},"j5naq_6flcg2_BZEjFEP6g":{"text":"Love this place. The pork belly is a great dish, and their alcoholic drinks have the crazi","useful":0,"cool":0},"3JIQ1Ve1ZlvX-42TLgkkOw":{"text":"The food was old. The kitchen staff was more worried about leaving than providing service.","useful":0,"cool":0},"cep3UELg0xePGqiYgxn_yg":{"text":"Great food with great service, NOLA style (by which I mean, they check in with you but do ","useful":0,"cool":0},"pWF_McfsYUDCZ3cp7H0eBQ":{"text":"A must-see in New Orleans! It came recommended to me by a friend who grew up in the area, ","useful":3,"cool":2},"eor9Stq_47uLXS2sh-KIcQ":{"text":"I had heard about Green Goddess very early on in my New Orleans journey, but I only just m","useful":3,"cool":3},"Vnnv1PvjD5f1WYWMyq6Fng":{"text":"The soup was AMAZING! Parsnip, carrot soup, who knew? Rich and hearty and very flavorful. ","useful":0,"cool":0},"0CVxomvrE76roj2o_gvggw":{"text":"I recently had the pleasure of experiencing Green Goddess and it was one of the most wonde","useful":1,"cool":1},"zFCOMzxBIhoAQTbhlWVtJQ":{"text":"I would describe my meal at Green Goddess as a gastronomic adventure! The staff was kind e","useful":2,"cool":0},"EzyVOkpLyXB_HsgKVcBEOw":{"text":"My spouse is a very healthy eater and wanted a nice salad for lunch.  The hotel concierge ","useful":0,"cool":0},"l4S-f02HMCPtinTNRXhK0Q":{"text":"Seems like all the reviews of this place are either really good or really bad.  My experie","useful":1,"cool":0},"PazS_nW8jcTQY7iqAfhVmw":{"text":"Best \"hole in the wall\" restaurant in the French Quarter. My girlfriend and I started with","useful":4,"cool":3},"5y2R2XkVR3uZMJ1ebFvJsw":{"text":"My partner and I really enjoyed the green goddess. Tucked away, but definitely not worth m","useful":1,"cool":0},"5ZyAx8RVh3qbwwAgRwzr-Q":{"text":"The Bottom Line: This cramped hole in the wall is home to tasty, clever cuisine.\n\nTry:\nCit","useful":0,"cool":0},"MBWPWe9o9GOYkMcV2ubv5w":{"text":"Yes, this place was amazing.  I was a little skeptical of the pomegranate beet hummus and ","useful":2,"cool":0},"NFzX3mqvTmNE5PxWhG4wSQ":{"text":"Ugh somehow ended up back in Green Goddess when wandering around the quarter...\n\nOrdered a","useful":0,"cool":0},"o1Oihxs_YqejuX9Lft4uWw":{"text":"Very small restaurants and one of the most memorable of our meals during out big easy visi","useful":2,"cool":0},"c6P3xdV1y4Gza4-vXOH9fg":{"text":"Absolutely amazing. Vegetarian or not. My friend ordered the uttapom and it was to die for","useful":1,"cool":0},"uMm9wxAMb10_LF7JHSaE3w":{"text":"Great hidden gem! This little cafe is great if you want to find something that has differe","useful":0,"cool":0},"1UtiYltfU2sDkkcOiZcGMA":{"text":"This place was super awesome... \n\nI wanted to Literally try everything here.. After a LOT ","useful":2,"cool":1},"Mtv_1F5VgUWwL29ejhy01g":{"text":"Dinner at Green Goddess was one of my favorite gustatory experiences in New Orleans. As a ","useful":0,"cool":0},"cpZuzHk4yJRYX3EjZvOIwA":{"text":"Due to a misunderstanding for table reservation, the evening did not start great at the Gr","useful":1,"cool":0},"kC1Yl6t5Q6_Yndtv2_o7Ww":{"text":"The Louisiana Strawberry Creme Brule made it into my top three desserts ever and I have be","useful":1,"cool":0},"OLm7HUf-fD3DDcabNrPZ-A":{"text":"It can be tough to find a healthy option for a meal in New Orleans. While on a recent trip","useful":0,"cool":0},"npmJ8BAPfoPEPwq6dT7u8w":{"text":"We tried to get a table for three days. This place is desired by many and indeed totally c","useful":0,"cool":0},"UqZZ6wjgl0T1S3hOn4PpdA":{"text":"This is a place that I keep going back to, bring out of town guests to, and basically have","useful":0,"cool":0},"ix2M8Z_pX2GNioJyDyYs0Q":{"text":"Yelp, I'm afraid you've let me down. I was expecting stellar, and what I got was \"meh.\" My","useful":0,"cool":0},"nfni1SS6aHYuhmHWm4z_Iw":{"text":"What an experience! First, we tried to go for lunch yesteday and the restaurant CLOSED bec","useful":0,"cool":0},"CalaFKIF7WAIlOnE8teqvw":{"text":"With a name like \"Green Goddess,\" I'd really expect all dishes to be vegan or at least veg","useful":1,"cool":1},"1x7vq5kod_qtfDmC8aVqCQ":{"text":"Delicious with wonderful vegetarian options for my veggie friend (they have non-veg option","useful":0,"cool":0},"miuD9xXjC0AjQSOjb8lBnA":{"text":"be prepared to wait for a table but you will be thankful you did.\nThe food is great the se","useful":0,"cool":0},"lMucOAtenHvYvdOMtWq5Kg":{"text":"When we finally found our way here for lunch on a pleasant day in the French Quarter, the ","useful":5,"cool":4},"tIu_9eGOO2xG1zga6FgCJQ":{"text":"I *really* wanted to like this place and had such high hopes - whenever I tell anyone I'm ","useful":1,"cool":1},"kFsBBDkqMQnHRBSTgjpUTw":{"text":"Not as many vegetarian options as I was hoping for. Service was crazy slow and they messed","useful":0,"cool":0},"OIyn_-tM63Hi_K_6lfKAhg":{"text":"After searching New Orleans for places that were even slightly veggie-friendly, we really ","useful":0,"cool":0},"t_hPUSOzEsyR7B6YVaPEiQ":{"text":"I visited here during my trip to New Orleans and the food was grrrrreeeaaaaaat. You may no","useful":0,"cool":1},"tasgYgu5_BPIKbvtdkeB6A":{"text":"New Orleans is one of the richest culinary cities in the nation.  It has a long tradition ","useful":0,"cool":0},"7eKNih-IyTjNQjZtj2fvmg":{"text":"When you walk up to this place for the first time, you may be a little confused. With a he","useful":0,"cool":0},"GMDDqkL65gxJgED9r2YytQ":{"text":"Really great service. The relaxed setting is off of the beaten path and allows casual conv","useful":0,"cool":0},"y4dl9_hHewICV0WgcPBWVg":{"text":"Really wanted to love this place based on reviews. Got the burata beet kale salad with shr","useful":0,"cool":0},"WEPup1oXeGUCpTJm0O5sLg":{"text":"This is an amazing Vegetarian restaurant with Vegan options!  In a city known for its meat","useful":1,"cool":0},"0hOR8eNrrxCB4WIlz_sbrg":{"text":"Stopped in here for lunch with some girlfriends and was not so impressed. We had a group o","useful":0,"cool":0},"zXnxRrQ4kGiXc8ACQBp_dA":{"text":"Great local food served with soul.  This food will give your internal organs a break betwe","useful":0,"cool":0},"h0ILkk8B57wP09SuC7foRQ":{"text":"Cute spot for vegetarians and omnivores alike. I got the poppy cocktail and it was great -","useful":0,"cool":0},"nrHamTzW5j9XAeXkwM9RaA":{"text":"Finally made it to Exchange Place, a small street tucked away truly represents what this c","useful":2,"cool":0},"C9eIFEoBVsOQruDhot-v7A":{"text":"Absolutely amazing!!! I had a watermelon sangria, which was so refreshing, and started off","useful":1,"cool":0},"ed4YSLIxQllAXR9NXlh5Tw":{"text":"Small place. Good prices for the area. Fresh food that is light and healthy. Good cocktail","useful":0,"cool":0},"ZF0Oad8KKS1CYPohiuqErA":{"text":"We had a spectacular meal at Green Goddess. I think appropriate expectations are the key t","useful":2,"cool":0},"XateMUC9T3tO7zbwN8b4Rg":{"text":"This place is like a circus for food! Everything was really good and unexpected. I felt li","useful":0,"cool":0},"lBZ22n6DPqxRWP9s43uUrA":{"text":"I'm not a fan of this place. We came here for lunch and there was a ten-minute wait, so we","useful":0,"cool":0},"0yipzFlVRC7jcQvWinzxoQ":{"text":"Where to start? The atmosphere- amazing. The menu- so diverse. There are so many different","useful":1,"cool":1},"Nh7AtZ938hjpagi2uVDU9w":{"text":"Will start by saying that the food was good! I started with the patatas bravos which was a","useful":0,"cool":0},"U_Ku0zhJ82RtcjzrVC1G3A":{"text":"Good variety of vegan and gluten free options. They also have a handful of dishes that inc","useful":1,"cool":0},"9jTbNufRLIrY3rTILaaUUQ":{"text":"Really different cuisine for the French Quarter, what a blessin.  I had a Wild Mushroom Br","useful":2,"cool":0},"S1NMzqpynbOhcuV_mrpkig":{"text":"A magical experience.  Service impeccable... knowledgeable, insightful and fun. Sets the s","useful":0,"cool":0},"zOl5R7PHfvGOi6XBnT0GjA":{"text":"We had so much expectations about this place but we were disappointed.We ordered potato br","useful":0,"cool":0},"DqJT3fHt039V2KUJ_6is_A":{"text":"Service was okay. Waited an awful long time for salads but the servers were nice. One serv","useful":0,"cool":0},"cYqcRMpZTlxT9qDSv1x-bQ":{"text":"I recently relocated from Brooklyn where I lived for almost five years and have been prett","useful":1,"cool":1},"GyPlFp3ELbBcI34BwvRD6w":{"text":"Vegan and carnivores dine together at this delic and laid back resto!  My favorite is the ","useful":1,"cool":0},"IiD-V8NBVyhBjGvuxF40xQ":{"text":"Beautiful day with tables and chairs on the sidewalk/pavement, what more could one ask for","useful":2,"cool":1},"uCKYtdZP1gB_QcWIP0MV3Q":{"text":"Amazing!  These Colorado hippies felt right at home. :)  lemongrass tofu sandwich and fren","useful":0,"cool":0},"KTzqMtzBRP1JwGsOY_Lz0w":{"text":"Being a vegan visiting NOLA is very difficult. Finding this place was a dream come true. I","useful":2,"cool":1},"TBSrECFxS8bB00ZHujaZhA":{"text":"Incredible. Decisions decisions .....pork sugar cane lollipops. Sweet.tender al fresca din","useful":0,"cool":0},"M4JldLthm8fLShYuk33GJg":{"text":"I don't travel to NOLA often, but when I do .. I always stop here! This is one of the best","useful":0,"cool":1},"AhAdk4LxsSZPOg9Yl1pGwA":{"text":"I was really excited to go here based upon the other Yelp reviews, but I was disappointed.","useful":0,"cool":0},"-ycQGQleihhakLSDAerTXg":{"text":"Awful, awful, awful. I sometimes feel as though being a vegan is an annoyance; to waiters ","useful":2,"cool":0},"-vT_e8nxXZydwQurq_ZQ2g":{"text":"Why is this place getting good reviews?  I am in NO several times a year and enjoy finding","useful":3,"cool":2},"VylapPzTr-_JURTuhYcvqw":{"text":"The best thing about this restaurant may very well be its setting. You're basically eating","useful":8,"cool":1},"Ac6Qx1PYsBqv1aDhoxpWsw":{"text":"New favorite restaurant. Sweet potato biscuits with honey butter and red pepper jelly.....","useful":0,"cool":0},"j4cCipc2yk77ZetpOJoI5Q":{"text":"Courtyard dining with handcrafted cocktails and creative dishes. I had the tofu po boy and","useful":0,"cool":0},"Lb8IbB__LGEE9smw9h3myg":{"text":"I went for the ice cream and it was worth the wait (which I heard could be up to 2 hours).","useful":0,"cool":1},"AWTsJLOnc8upPcfsbM9qOw":{"text":"Awesome place burrowed away off bourbon. 4 stars bc it takes a while to eat but worth the ","useful":1,"cool":0},"KgsonillC5qWMioWFqOm6A":{"text":"New Orleans dining for health conscious (or not) foodies! Amaze balls. Love this place ;) ","useful":2,"cool":0},"aKEN_FMZt8kljJd1P2R5pw":{"text":"Very nice, staff very nice, food superb,  local ambiance rounded out the experience five s","useful":0,"cool":0},"4nz9hMYVkaWsLX8btlVo2g":{"text":"Yum, yum, yum!!! I had dinner here last week with a group of friends that included vegetar","useful":0,"cool":0},"4KuL0fGy7bkVgc8hlHmBhw":{"text":"Great breakfast!  Delicious!  we tried the Duck Sausage PoBoy and Bananas Foster Waffles a","useful":0,"cool":0},"JwTLJQ-Eay40dSrzvZh0aw":{"text":"Nice hole in the wall for vegetarian food. Wife got chimmichanga and I just got the banana","useful":0,"cool":0},"5_-BLRhDJ7Q0eL3lXb3ssw":{"text":"The price to food ratio was fair for this kind of food in my opinion. The service was OK b","useful":0,"cool":0},"QafQ5kcu7aXug8lxC2Zuxg":{"text":"After walking through Bourbon Street and passing burger and pizza places, I was in the moo","useful":1,"cool":1},"B3RUzUI-ebXSAFllE3tYsw":{"text":"- Do you enjoy trying completely new & off-the-wall culinary creations?\n- Do you like dini","useful":3,"cool":2},"ZGmpLmJ5xs9ax9uaGN_DuA":{"text":"I ordered the crab panini, as it was the special of the day. It wasn't overwhelmingly fant","useful":0,"cool":0},"iLvs0QqSowpWuLmoWgn2mw":{"text":"Amazing food! Who knew beet hummus would taste so good! A lot of great options for vegetar","useful":0,"cool":0},"_JLwKakScNRWqBsCimYThA":{"text":"Great eclectic fare. Came for lunch and the vegetarian Cuban sandwich with collard greens ","useful":0,"cool":0},"YHw3nUfLZTtdsdku_fEVpw":{"text":"Loved this place! Creative, delicious food. Vegetarian-friendly. \n\nI loved the watermelon ","useful":0,"cool":0},"g5PYxZzOfBKShhtsvwnJFw":{"text":"Oooooooooookay. Don't get me wrong, I LOVE Green Goddess. I love that they are so vegetari","useful":1,"cool":1},"RWVS0_Bp2ZPK7We7GsOZJQ":{"text":"No indoor wearing, but very tasty and interesting food combinations. The first day we went","useful":0,"cool":0},"UBVp_XCGXzueODYHyRHhMA":{"text":"This was one of my best meals in the city! I got the Tofu Po Boy and it was phenomenal. Gr","useful":0,"cool":0},"uRBm8KRK7328fRNutdbwMA":{"text":"Well this place used to be 5 stars but now I think is only 4. But that is only because the","useful":0,"cool":0},"sXun5gFb8WrgxGPNg6Qx-Q":{"text":"An unexpected delight! Judging from the looks of the place, we weren't sure what to expect","useful":0,"cool":0},"8ADRAcBWBGczoAM-6vlANQ":{"text":"Visited Green Goddess while visiting New Orleans from Chicago. \n\nThe food was very tasty.a","useful":0,"cool":0},"w0DO2f8QmVVxMWxQO2GOIQ":{"text":"Sweet potato biscuits & mushroom gravy served with manchego truffle grits. Doesn't every w","useful":0,"cool":0},"UG2uFC1kOvX5gA7tNtf3PQ":{"text":"I had the citrus salad with goat cheese and my husband had a potato cheese appetizer. The ","useful":0,"cool":0},"j2McNuxLuDrFWH3FfZ8PpQ":{"text":"This place is legit. So good I ate there twice in two days (not something I'm accustomed t","useful":0,"cool":0},"fxRP5HpKcIOuX0hf7g72ZQ":{"text":"Jesus, he's tiny...\n\nThe Green Goddess is super tiny--four tables on the inside, with a fe","useful":4,"cool":3},"Z9Bvby36JYNw5ZvAkrlTAw":{"text":"You can eat really well in NOLA, obvs.  Food and floods, it's what they do best, right?  G","useful":5,"cool":2},"77UteQelsAeYi5jDdwoXmw":{"text":"I ordered the simple citrus salad to go so I could eat it at the airport.  It was overpric","useful":0,"cool":0},"v6B0fz6KZ-7WhUTIybWcCg":{"text":"A vegan in New Orleans town trying to find healthy food on a road trip is hard but we did ","useful":1,"cool":0},"IaLb6UD8RN9nwAA8Ox2RcQ":{"text":"If you're looking for a clean, pristine experience, this isn't exactly it. I like this pla","useful":3,"cool":1},"Xpi0dzWkOTxmmSC7RaR1Ig":{"text":"The meal we have just finished eating was awesome! We are sitting in a charming little ped","useful":0,"cool":0},"OwEhpt2MPINpntAndLqXdA":{"text":"Way overpriced, especially the drinks. Very limited menu!! Much better places to go.","useful":2,"cool":0},"kLoyPqxiIX2RYEJ-gbr7vw":{"text":"The Green Goddess is located on one of the most beautiful streets I've discovered in the F","useful":0,"cool":0},"kxgDsfyVLY6LSZr_HYYUdA":{"text":"Lousiana Bangers & Mash hits the spot! Plus we get to sit at the Chef's special table :D\n\n","useful":0,"cool":1},"0bkGpUiLx1md5AYD7hcV9w":{"text":"My mother and I ate at Green Goddess in May and it was so good. I had the \"crab duet\" and,","useful":0,"cool":1},"D5F8AbIRDB3MB4i3884A6A":{"text":"We had the Moroccan stew which was fantabulous. They offer gluten free, vegetarian and veg","useful":0,"cool":0},"BgQkshbAHgrqlhvVmY9l9A":{"text":"Delicious food. This is The Gem of the French quarter. I came here over 6yrs ago and came ","useful":0,"cool":0},"RcPnFSNnCUTAxxnurrPzqg":{"text":"I found this place from other yelp reviews, but wish I hadn't!  First off, the service suc","useful":3,"cool":4},"yyACV1hIYwy1AmHAmZIG3w":{"text":"I really enjoyed this place. I went here my first night in NOLA w/ some friends I was vaca","useful":0,"cool":0},"VUZKnfcEN-nZkNKqHIluMQ":{"text":"Absolutely delicious! Fantastic veggie and vegan choices. Local ingredients. Cool atmosphe","useful":0,"cool":0},"vZQ4UgjiOVXf6Flp4QE46A":{"text":"This restaurant really should have three dollars signs instead of two. The food IS priced ","useful":0,"cool":0},"jHpEkBWEOlfh-pfYhjrqeg":{"text":"My son picked this place out for us from the plethora of choices here in New Orleans. I wa","useful":0,"cool":0},"flDV4UBsixvuSrjU2iolWw":{"text":"As usual our first stop in new Orleans was green godess....chef Chris debarr is an amazing","useful":1,"cool":1},"4SW1W8NMpxmD_tjtypBSEA":{"text":"Amazing food! Not so great service, but not lacking effort on that front. \nThe restaurant ","useful":1,"cool":0},"iOAEeP-nVMMaB3Ub0TITbg":{"text":"I am a vegetarian, and while I like visiting New Orleans, I almost never eat well there.  ","useful":3,"cool":0},"jt8D-SboK2X3ZnFqmqGtpg":{"text":"First of all, props to any place pumping Daft Punk (Homework album) through the boom box. ","useful":0,"cool":0},"j279tQ4Wthlw1LTPfdoYgg":{"text":"We came here for dinner after reading the good reviews on yelp but we were not as impresse","useful":0,"cool":0},"lf2cFokXFVeaKKchugipXQ":{"text":"Delicious. Great selection of eats that are vegetarian and gluten free friendly. The beet ","useful":0,"cool":0},"D0t7G7FmH0X7xENIbTmgng":{"text":"Extremely grateful for the Green Goddess! Ate here multiple times over a long weekend visi","useful":1,"cool":1},"6j_r6VDN0E3YkwKPVCFQEA":{"text":"Okay place for brunch, but really not up to some of the other reviews that I have read.  T","useful":0,"cool":0},"rX1UV-nTtJvmFJZz2H7e-g":{"text":"What? Healthy food in the French Quarter? Love it!\n\nAs much as I LOVE cajun cooking, a wee","useful":0,"cool":0},"EU-TuDq2WHpFkGKxlfkpEA":{"text":"yay! veggies! i know, i know, not my usual exclamation, but after a coupla days in nola, e","useful":2,"cool":2},"y5ZLyOcWdtTymsl9RDbOVg":{"text":"This place is excellent and both veggie and other entrees were amazingly creative!  We ord","useful":1,"cool":0},"xV4Cfv0nQZk5BPc9X4bD-g":{"text":"Took a stroll down to Green Goddess after checking into my hotel.  Hungout outside while I","useful":0,"cool":0},"A8QV9FgZ2KYMWL0AIWxIoQ":{"text":"The vegetarian special was delicious! Very happy to find a vegetarian-friendly restaurant ","useful":0,"cool":0},"FOHSnCgGdaJIPRd7-Uw7MQ":{"text":"We made our way to 307 Exchange Place, which is really a pedestrian street, to have dinner","useful":0,"cool":0},"8WX6Wh74Fsmdp5DYSKBvwg":{"text":"What a great little gem of a place this is! Thanks to yelp reviews, I decided to check it ","useful":0,"cool":0},"5Hc_bzO0T2950Zfcj4WUaA":{"text":"I didn't know what to expect from this place but it was absolutely delicious! We had the t","useful":0,"cool":0},"TN34W6UFN3heeYyJmMS7AQ":{"text":"Acadian breakfast! Effing crazy amazing man cheng grits, sweet potato biscuits, cane syrup","useful":0,"cool":0},"Jge4xtK6v_PBNx8HAX0MhQ":{"text":"This place was amazing. A friend and I had dinner and then lunch there and loved it. Order","useful":0,"cool":0},"ISqDoxUa4Yys_b4j8RZLMw":{"text":"This place is amazing. I've eaten both breakfast and dinner here. It doesn't look like muc","useful":0,"cool":0},"9As2GLhmxBjR-RLmDHYTQA":{"text":"Love love love this place. We ate here everyday while we were in New Orleans. They have gr","useful":0,"cool":0},"OZeFz7vKhQ0LIlAMzq8dyA":{"text":"This is a hidden jewel in a cute valley. Downside is the seating is very small (50 people ","useful":5,"cool":2},"3OsfmcZbcZsIH_8wTiGSRQ":{"text":"The menu was different from what was listed online, probably because of the seasonal veget","useful":0,"cool":0},"OXV9J3qIRo3GtA-DaG5Pwg":{"text":"Awedome bacon sundae - great atmosphere and perfect place if you are in the mood for non-t","useful":0,"cool":0},"vNJxhGi2LJZixUQKDst9Kw":{"text":"No no no no No to the food. I had the pork belly; it was awful, i could not cut through th","useful":0,"cool":0},"EBTCXxjW8BFzICDcWNIu1Q":{"text":"We ended up here because friends told us it is gluten free aware and it seems to be. My co","useful":0,"cool":0},"wP2G_gcW1ZMZhNECkdNC-A":{"text":"The Green Goddess was a mixed bag for us. There is no indoor seating, and we went during a","useful":0,"cool":0},"w4Zb953sSv48jTA5dv9n5Q":{"text":"I brought a friend here on a Friday night; it had been raining all day, but we decided to ","useful":1,"cool":1},"xmyJkxweTvZ3kvliAxEooA":{"text":"Best grill cheese EVER: made with Cahill's Porter Cheddar with Guiness and Pear Butter.","useful":0,"cool":0},"aOfslYlDRfTRysBqPpE7Dg":{"text":"The food was interesting, some in our party of 5 loved theirs, others thought it was nothi","useful":0,"cool":0},"CDPzTYeJvQdhpFM3hDcEcw":{"text":"I almost hate to review this restaurant because it's so small, and I want to be able to fi","useful":4,"cool":1},"uRCzXJ6fX8BZRQsAlKfLhg":{"text":"Unfortunately this city is not very vegetarian friendly so when I was told about Green God","useful":1,"cool":1},"yj5Fgd2RRLR8Xh1oPldMsg":{"text":"Okay friends. So I think I found my next new favorite restaurant. Too bad it's like millio","useful":0,"cool":0},"NvGu67AgHY62tTadjyg8UQ":{"text":"This place was awesome! It was recommended by a friend of a friend.  We weren't going to g","useful":0,"cool":0},"jaKDbnZ4Q1XkDJ7x12P7VQ":{"text":"As a vegetarian visiting New Orleans I was jazzed to find this place. The building is uniq","useful":2,"cool":1},"VH3dPRcwJxPa1qHqufNXLw":{"text":"This fun little, full service cafe is tucked in a romantic alley full of boutiques and lin","useful":0,"cool":0},"OK0bIwmgTKbVvbns3NbmXQ":{"text":"Really wasn't impressed. This is a pretty expensive place, with very little room to sit, s","useful":0,"cool":0},"Tyf10efNAQ_Hv4etttWU-A":{"text":"On an unseasonably cool Saturday evening in late March my daughter and I, seeking semi-hea","useful":1,"cool":0},"NouMDnyyHmtVnfsNh24ekg":{"text":"Located in an small hidden alley off Bienville St! Be careful not to miss it! A very cozy ","useful":0,"cool":0},"ia90px-yTeBDk1I7sNMhKA":{"text":"Food was nice, waitress messed up half of our orders(only had 4 dishes to get correct) -bu","useful":0,"cool":0},"OKQudV7ZGzkWFRlN5xoiHw":{"text":"This place was def a dike, when u get there u dont want to stay because it looks like SHIT","useful":0,"cool":0},"KxbkJL3lDeUEr9J2RGVjng":{"text":"My first and only night out in NOLA I enjoyed great service and a very nice meal at the Gr","useful":0,"cool":1},"zsh47O40zl3jOLEvF98S-w":{"text":"You know, I was pretty excited about this place after reading all of the reviews and learn","useful":2,"cool":0},"hd3_vm9ZjuZ2KRN_b0-GfQ":{"text":"Good place to have lunch, especially if you like vegetarian food & are visiting the french","useful":0,"cool":0},"TJ2VU3hyhOXBP4O6ok2XZA":{"text":"you must try the Father Pat's Grilled Cheese. Actually, don't... It's so good you'll never","useful":0,"cool":0},"oFq6Fc4D8Em2CvfxANokig":{"text":"Absolutely delicious! I loved the lemongrass tofu po boy and my boyfriend loved his meatlo","useful":0,"cool":0},"_KY4f_knfJ6gPp8sXPelag":{"text":"The food was delicious (like the first time I'd been there), but just enough problems on t","useful":0,"cool":0},"zXs3vx-guEs7ad83CKlKDg":{"text":"One of the best meals I had when I was in New Orleans! \n\nMy friend who lives in New Orlean","useful":1,"cool":1},"dZLh4wHV3U_dQ0TdzaNS-Q":{"text":"Best food I have ever had in my LIFE. This is such a hole in the wall and there were only ","useful":1,"cool":0},"vjx7EXAc11JOC7_7tO6dCA":{"text":"You may get scared when they walk you through various corridors to seat you in a small enc","useful":0,"cool":0},"I-MPIPTFVqtUJescPHE1Qg":{"text":"This is fun and quirky and you get lots of love.  Chris, the very casual chef, comes to ro","useful":0,"cool":0},"lzVJmfvGcg8HeKgWwChzKQ":{"text":"Awesome.  Awesome concept and ambiance with outdoor tables down a nice quiet alley.  What ","useful":0,"cool":0},"pOk5KyQAjdgcb4YE_PcKRQ":{"text":"I guess the name kind of gives this away, but don't go unless you're looking to eat suspic","useful":0,"cool":0},"EQs8-roQ1DK257z_v_wbCQ":{"text":"OK, so yeah the waitress was a little distracted, but since it was 475 degrees Kelvin outs","useful":0,"cool":0},"NvrAgvYgeCJvZEuuGKhz0g":{"text":"Yum. A great casual alternative to other nearby restaurants. Great good. Healthy options. ","useful":0,"cool":0},"J_Ikk-XdyDRPaKT_6f_TYQ":{"text":"All I have to say is YUM. Very few tables available... But the food is very creative and d","useful":0,"cool":0},"XYEaQM2gxlz7wUKX9tuRxw":{"text":"The food is adventurous and usually pretty good. I've had one mediocre meal there out of m","useful":3,"cool":1},"_cnjNZQHKwnnNMvKUp1KGA":{"text":"This might have been the worst dining experience I have ever had. \nDo not waste your time.","useful":7,"cool":3},"xuL765-04nslsgtv6oahZw":{"text":"This establishment is just another tourist trap in the french quarter, do not be fooled by","useful":3,"cool":1},"1MV_uRKD_rsTUPxKckxxPg":{"text":"This place man, amazing experience! The restaurant itself might look too local and at firs","useful":1,"cool":0},"Mnh7FPUntF23GWh2ch8yYA":{"text":"Came for lunch on a weekday with a few people. I got the duck salad which was simple but d","useful":0,"cool":0},"ba472IyPrNT3f-1njM-sMw":{"text":"This place was quite frankly amazing.  I went accidentally on one of the nights they were ","useful":0,"cool":0},"vxVtavi58PGucwmRYq-YUw":{"text":"I was very surprised how much i liked this restaurant. There is alot of good vegetarian op","useful":0,"cool":0},"bC8ciLuKN3E31NRvOOCO7A":{"text":"Great dining experience! We got the 5 course menu and a cheese plate for desert. Everythin","useful":0,"cool":0},"XYVpACjhfC1caJQW8Xx8Wg":{"text":"Love this place. Beautiful, layered flavors of fresh ingredients. Very small and intimate.","useful":0,"cool":0},"HE50lc5vADuP5AKYuJbpHg":{"text":"I had to drag my boyfriend to the green goddess for a Friday night dinner(jazz fest weeken","useful":0,"cool":0},"1exRWb325ldc73BMcmH0KQ":{"text":"The food is so yummy and the atmosphere so charming that I would like to live at Green God","useful":1,"cool":1},"Kt0S2EE1Dt5Y58fzML2sMA":{"text":"I ordered the Freekah salad. It was so tasty. I came in with a to go order and the staff w","useful":1,"cool":0},"LYBNcxRZtz_MjyBHjEUjxw":{"text":"Hands down the best food we had in New Orleans.\n\nEVERYTHING was good. Scratch that - EXCEL","useful":1,"cool":0},"CiS7r3PV6qnNJylArD6bEA":{"text":"They were gracious to seat us after they had closed. I hesitate writing this, since I don'","useful":2,"cool":1},"fU4Ea7RTR1NApjtcTNIlYQ":{"text":"Great staff, awesome beer and cheese selection. 10/10!! It's very cozy and the ambiance is","useful":0,"cool":0},"5GXHVgjsszgOK00MeW4Kmw":{"text":"Exceptional food. The chef is NOLA native but has travelled all over and that is evident i","useful":0,"cool":0},"ZbHITeusWoFMhfItYIvxgA":{"text":"Not too bad of a restaurant. Actually great. \n\nthe food was fresh and tasted great. I had ","useful":0,"cool":0},"xAySX0EZzglr-7y9A1oWKg":{"text":"If you like Bloody Mary's, you MUST order one here 'cause they're among the best I've ever","useful":1,"cool":0},"pJWR-7Op1XKE8TOFovmbiw":{"text":"We went here to split the 'Bacon Sundae' Saturday night August 8th. (quite possibly the ho","useful":0,"cool":0},"5m2HWVGxzp7Po-VGgb_2HQ":{"text":"I had a good sandwich but feel you just don't really get what you pay for here.  Not the m","useful":1,"cool":0},"d1spjUFhtJDdlTuh9dC3xQ":{"text":"Awesome food! This is a hole in the wall in many ways, but the food is amazing!  Vegetaria","useful":0,"cool":0},"U2U56SANZBKhS4LSb4CXTQ":{"text":"So glad we had the chance to experience this amazing find! I highly recommend it! We had t","useful":1,"cool":0},"vqSn9AUsq_0siX2dojbZyQ":{"text":"This restaurant is an amazingly cute place with seating only outside. The food is fresh an","useful":0,"cool":0},"-_4hGd-guz5grcGYCckbyw":{"text":"I've been meaning to go here forever and was so excited on Saturday to finally do just tha","useful":2,"cool":1},"6GkJ0l0eiKyiIVyGyMQdwg":{"text":"This place is great for vegetarians with plenty of meat options that are different - a mem","useful":0,"cool":0},"h0wgER7Q6EgLknWUfxaVkw":{"text":"Coming from Vietnam, a country when there are a tons of way to make Salads healthy and del","useful":0,"cool":0},"dbTYC0BmeCvopUfXysd22A":{"text":"Great find for local fresh food.  The most amazing salad with a light vegan dressing.  Gre","useful":0,"cool":0},"NfzapEp5Pc6wxGY3_mVB4w":{"text":"I had really been looking forward to trying the Green Goddess, but was sort of disappointe","useful":5,"cool":3},"wRS7O0Mo4txBv88vloWSkg":{"text":"This place blew my mind. Amazing, creative menu. Portions were on the small side w the app","useful":2,"cool":1},"k1kXQyemEyNm9VHtlty6Ig":{"text":"The food here is so fresh and so amazingly good that you and your belly will be so so happ","useful":0,"cool":0},"xKq4VDj6Sk5goasuh93jSQ":{"text":"After eating so much rich food in NOLA I asked our concierge for a healthy alternative and","useful":0,"cool":0},"tEO4ZY7iL4-Fbab494Mc_Q":{"text":"Fabulous food, eclectic menu, but terrible service.  They told us they could seat a party ","useful":0,"cool":0},"Dy-P0yjX5LGGQGOe2dbFfw":{"text":"Was e expecting a lot from yelp reviews..  Bit this place was ok..  Not great.  \nEggs were","useful":0,"cool":0},"GDK64O_jfkx9qpWvxh7aAA":{"text":"I have loved Green Goddess for years. Every time I have come into town I have brought peop","useful":1,"cool":0},"IOZVnf71MoyD9YssFL8CZw":{"text":"Back home in Europe the atmosphere in Greed Goddess would be described as \"bohemian\". We c","useful":0,"cool":0},"0eYEDnFMvTlYdXfGCxF3Yw":{"text":"Our expectations were high, after several friends recommended Green Goddess to us, so mayb","useful":0,"cool":0},"4WyvhdNClscvFuxY3NVw4A":{"text":"Thank you Green Goddess for having a great gluten free menu and delicious food. The patata","useful":2,"cool":0},"YIyb4xzsF64Konf7tT_SUA":{"text":"Green Goddess definitely exceeded my expectations! Tucked away between the bustling neighb","useful":0,"cool":0},"YpFXJEhDTPnMnuNt4GreNA":{"text":"TERRIBLE service. The hostess taking down names was incredibly rude and treated my elderly","useful":2,"cool":0},"a-ehVrKpY72CnpLqyL8B3w":{"text":"I had the tofu poboy, which was really tasty. It had pickled onions and capers, which adde","useful":0,"cool":0},"EWpgHAhSVRmLt3KnVcybUQ":{"text":"One of the few spots in New Orleans where you can find really delicious vegan and vegetari","useful":1,"cool":1},"2vgaf6g9ttvCcgvteQJ0wA":{"text":"In the beginning, I must admit I think I was skeptical. Picture this: 3 20-30 something, r","useful":4,"cool":1},"XLQKvT9zTWf_dkePOLQvvw":{"text":"Delicious food, especially great vegetarian fare. I split a plate of figs with drizzled ba","useful":1,"cool":1},"vhlHdwUo7FMZiKIVo7nprw":{"text":"Three words: coconut seafood salad. Three more words: bacon praline sundae.\n\nDo I have you","useful":1,"cool":0},"ryoPtxvkAW-Mot3HamP11Q":{"text":"We stumbled on Green Goddess after checking out about 6 other menus on our walk about - it","useful":5,"cool":4},"vmsRaSNrThFzP7dJwVv_6g":{"text":"Who knew that arugula, sweet mango, and toasted pumpkin seeds in a pico de gallo dressing ","useful":1,"cool":0},"b_KN5IasV3sOmTogMZHkCQ":{"text":"I really enjoyed this place! I went with a large group and they were very accommodating wi","useful":0,"cool":0},"yiIxN6_fo1qKnA7j_Ac9uQ":{"text":"Ehhhh. Ordered Mushroom Pate, it was ehh. Our entrees (Brisket and Pork) were confused too","useful":0,"cool":0},"yMBj-YJntRPsJyCbO0pRig":{"text":"Well done vegetarian cuisine.  We have only been once because other attempts to have lunch","useful":0,"cool":0},"dY6qd2PemjrKLNMivIeqDw":{"text":"I thought I'd jump on this review bandwagon, and I will begin this new addiction by talkin","useful":3,"cool":2},"hbyRfdR_QGAzNzBW-oHReA":{"text":"Ok so I know everyone seems to love this place but I wasn't a big fan at all. First off we","useful":0,"cool":0},"FhN0B06nUzpzqSO7J5txrg":{"text":"This place was cozy, laid back, and incredibly friendly! We had a particularly welcoming b","useful":0,"cool":0},"ZIws4qnKB8ANvEuVCbL5ig":{"text":"The Green Goddess wedge salad was a gastronomic work of art: perhaps one of the best salad","useful":1,"cool":1},"oXbhUBe66L4Xe_v63UwBYQ":{"text":"Came here because it's one of the few vegetarian options in New Orleans. The salad portion","useful":2,"cool":0},"GcwjWrmUw7rM-zegVvKfxw":{"text":"I wanted to try this place out because they been getting a lot of good reviews.  The food ","useful":0,"cool":0},"J5L6wxONuwge9ZDKfaidIg":{"text":"I would have given this place a 5th-star, but the woman at the front table had an attitude","useful":0,"cool":0},"PDUWbyiYmkM2BYcvAjuPlQ":{"text":"With two vegetarians in our group, we were excited to find a veggie friendly place, but wo","useful":0,"cool":0},"D6F9NyvGgraJSAeET8oANw":{"text":"Melted manchego\nLuscious beef steak tomatoes\nPistacio ice cream","useful":0,"cool":0},"5q4IWmJ52wQq4zmpZcom0Q":{"text":"So, does Green Goddess really need review #237? Yes. Yes it does.\n\nAfter a 4-day French Qu","useful":3,"cool":2},"c-BkOFAbYl0oI19CIY-QqA":{"text":"I went there 4 nights out of 7 on my trip.  Beet Burrata Kale Salad is genius.  Better tha","useful":0,"cool":0},"6l1YMwUwcFAJCav5FJjkfA":{"text":"message to the owner: you should fire the bearded server wearing a bandana that was our wa","useful":1,"cool":1},"o5aYjFPmMklEhydwpVEBxg":{"text":"SOOOO GOOOD! The Bloody Mary, with fresh tomato juice, was so so crisp and delicious. We s","useful":0,"cool":0},"obL5_fy6-vh60o75dIEHNg":{"text":"We went three times, and it wasn't until finally the last time we were able to get a table","useful":0,"cool":0},"Ww5FWR6xPHA3TvOvlpEDvg":{"text":"We just had a fantastic birthday dinner. Every course was perfect. My favorite was the red","useful":0,"cool":0},"CNE7Ra_7uuOpMZGlEDzyUQ":{"text":"Cutest little hidden spot in the French Quarter. Super friendly staff, great drinks, and d","useful":0,"cool":0},"UTI8duk7kTyp39rQd2ylgA":{"text":"My husband and I had this restaurant on our list of places to try during our visit to New ","useful":1,"cool":0},"JM4g1_pjP8g4CXHARZgDYQ":{"text":"our first time here on a recommendation from a bartender.  its located in an alleyway and ","useful":0,"cool":1},"GuGVRunI2TUZrHx84ZP53Q":{"text":"So yummy. Only place around with good veggie and vegan options! Very nice outside courtyar","useful":0,"cool":0},"AGL6rSlUp2a6sZK0hl_sRQ":{"text":"Really crummy service. Waited about 20 mins. to get a table, another 15 mins. for a waitre","useful":3,"cool":0},"ZemzlUdbchoBdt1-Vj0F0g":{"text":"I would give five stars for the food, which was creative and not your usual New Orleans fa","useful":0,"cool":0},"G2Po-jBKE_RWjKTDB-mTOw":{"text":"Just left the place. Nice location and nice staff except the guy name randy as far as I re","useful":0,"cool":0},"pQyLEJsFmgsPNdzARQPP3A":{"text":"Super creative menu, outstanding food and delicious drinks. We particularly enjoyed the Ba","useful":1,"cool":0},"5a32rxBPynPjOaxdC6Fc9w":{"text":"The guy on the street welcoming people is very friendly, and was able to tell me they had ","useful":1,"cool":1},"LAPeIbBbZRziDt6iMQQB-Q":{"text":"Weve been in New Orleans for some days now and stumbled upon this cute side street by chan","useful":0,"cool":0},"FswHJAut2ILmFL6-nbojlg":{"text":"Wonderful, funky place.  Extremely well priced, considering the excellent quality of the f","useful":0,"cool":0},"Z291wVc2cUpkW-ho8i02Zw":{"text":"Can't quite understand why this place has so many 5 star ratings. I may have been in on an","useful":1,"cool":0},"ps8U7Aofp0a1-9SMHZX9wg":{"text":"I am visiting from out of town, and was super excited to try a vegan dish from here. Unfor","useful":3,"cool":1},"Mdhdbo5ptq1oVzTswey1Tg":{"text":"The restaurant is located in a pedestrian only ally shared by a few other shops (happy acc","useful":0,"cool":0},"OIQbWO2qALLtq-rRxgLk2w":{"text":"Hands down the worst service experience in New Orleans.  Requested a table, got seated aft","useful":2,"cool":0},"SHwWvriYv79kOEnbnjuLBA":{"text":"I absolutely love this place, but I have only been for breakfast / brunch. I could sit the","useful":1,"cool":0},"lbEpRGH-wABFztRMh9bBMQ":{"text":"An absolute gem for vegetarians.  The service was so-so, and it is basically in an alley n","useful":2,"cool":0},"Sg_JRJ0hJUD9oeOLHTrfzQ":{"text":"i've never been here for dinner but i see here (and hear from friends) that the brunch is ","useful":1,"cool":0},"SS9TvoQaULl7n4fYJ51gyw":{"text":"Loved this little place! Was a little tricky to find, being in a little side alley off the","useful":0,"cool":0},"_KThu0-PAxq24xoCl6FB2g":{"text":"A nice alternative for the area. The service is great, and the menu items are definitely i","useful":0,"cool":0},"9P5ZUvFZw08JGNJpwwzppw":{"text":"Had lunch & ordered the satsuma shrimp salad. The salad was very good and had a nice prese","useful":0,"cool":0},"aL6KZkAeOBIxR4KIBewBgg":{"text":"Perfect!! I have been looking for a healthy option in the quarter for some time now! In ad","useful":1,"cool":1},"tYDIwsB7BlfK05E56aKmOg":{"text":"Wow. What an awesome place.  \n\nFirst off... I truly don't understand the \"bland food\" revi","useful":2,"cool":0},"CObzbb3vlZrWY-2PmwH9Sg":{"text":"With a name like Green Goddess, you'd expect a vegetarian restaurant. But in New Orleans, ","useful":1,"cool":0},"DDdBPSfS8BZEV66LmcX-0w":{"text":"SO good! After a few days of fried seafood and meat, it seemed almost impossible to find a","useful":0,"cool":0},"f0JzJRdjBJJSHiapYlaA1w":{"text":"Found this alleyway gem while strutting New Orleans with my favorite gals. The atmosphere ","useful":0,"cool":0},"AbgJXASRU9vHSFQVK-5H5w":{"text":"(I would give this place 2.5 stars, because my gf gave her food 3 stars. My food rated 2 s","useful":1,"cool":0},"w1xCCf8mINz6iKN6jzKHAg":{"text":"Ok, I must give credit where credit is due.\nI went to Green Goddess last night for my book","useful":4,"cool":3},"GP_slxPAKYGF2cvZKrLY3w":{"text":"\"It's good for me to know that food can be this good\" - my wife. \nWe saw Green Goddess sev","useful":1,"cool":1},"jaIkfRji9GTo9oEEQNnR6g":{"text":"After reviewing the menu I didn't have very high expectations.  I was wrong.  Everything w","useful":0,"cool":0},"NUpCCrgfF7unxQlUTusdog":{"text":"The kale salad is a contender for the best salad I've ever had. Toasted kale on greens wit","useful":0,"cool":0},"pVUijcJxOInr5ckDKwfdeg":{"text":"Very friendly staff.  Good food.  Cute comfortable environment   Would eat here again.  Un","useful":0,"cool":0},"MAH0oDEFfv4Ar_QzplqnLg":{"text":"Typically, in New Orleans, \"vegetarian-friendly\" means \"has something vegetarian\", and eve","useful":7,"cool":3},"PggzzPPLGxgUo50BeFvS6w":{"text":"Such a great location. Off the beaten path, with a wonderful atmosphere. The wedge salad w","useful":0,"cool":0},"V2a1VSEuCeOlowIUY07owQ":{"text":"We stopped here after a jog, for a cup of coffee and a bowl of soup. We were still full fr","useful":0,"cool":0},"YJE-H8-Uhu8XkxOlHNam6Q":{"text":"For the size of a meal, it was rather expensive (around 20$) and unfortunately the tofu wa","useful":0,"cool":0},"xgP1t0ftLJEmnemSgiSDGA":{"text":"Wow!  Talk about vegan heaven!  We had the pomegranate beet hummus which was served with i","useful":0,"cool":0},"gjEOu70DHdnRzVZ7hTPF6g":{"text":"We went here for dinner on Saturday night based on a recommendation from a friend. Went a ","useful":0,"cool":0},"QyyCQb7i4YHZeHLPeLfYLQ":{"text":"Had to do some hunting to find this little out of the way hole in the wall, but it was wel","useful":1,"cool":0},"IhNSfZ9XoRRKXuZMOzZjaw":{"text":"Two stars for the location and passable fare. Could have rated higher were it not for the ","useful":1,"cool":0},"whrs5OCagK_F7oFWe_UuyQ":{"text":"A happy place for meat eaters and vegetarians alike. \n\nThe food at Green Goddess was so gr","useful":1,"cool":1},"F70BA6Ue7ibAepl-ieXuDg":{"text":"This place is a little off the beaten path and the food is the best I had during my entire","useful":0,"cool":0},"v0JupQMIr0GkhWazPxAI8w":{"text":"we followed the yelpers to the green goddess for dinner.  it is small with limited seating","useful":0,"cool":0},"YRjrsB8uFypn1vlVxGMGMg":{"text":"tries a little too hard...\nthings I ate:\nsweet potato biscuits - AMAZING\ntruffled cheese g","useful":0,"cool":0},"BFt4xRoa6uAs5ODLqpksqg":{"text":"Best meal(s) EVER!  I want to marry the chef, seriously, I asked him. Paul, I LOVE YOU!\n\nT","useful":2,"cool":0},"Fiib3kjMptrsuJzqXMYwBQ":{"text":"These overall reviews can be very deceiving. I went because their reviews as a whole seeme","useful":0,"cool":0},"N-rD-ByAxkkgnxz7lmSLwA":{"text":"My lady and I ate lunch there today for the first and it was great. We can recommend the d","useful":1,"cool":1},"cwfLoiLz8p_aVHSPV_A8TQ":{"text":"wait a sec im in NOLA? for a minute i thought I was in SF, but then the humidity kicked in","useful":0,"cool":0},"SsR7T5AfiESx8tj1lSj3nw":{"text":"Good. Different. Fresh. \n\nBloody Marys were different than your typical. Not spicy but I a","useful":0,"cool":0},"x1YzIpsfLhcumJoBg7rMHw":{"text":"I give 5 stars mainly because they HAVE quite a few items for us poor vegetarians especial","useful":1,"cool":0},"a_cLDA4ZIYfX3sLzO2iaqQ":{"text":"We walked about a mile and a half to eat here on a Wednesday night arrived at around 8ish ","useful":0,"cool":0},"u05lBRmXFTolU96EJqEA0Q":{"text":"Unassuming tiny hole in the wall (the majority of seating is outside in the alley, so if i","useful":2,"cool":2},"ojmzPnca3HQZ-z9gIhcvDw":{"text":"Taste of food was outstanding. Serving size was just right! Service was quick and polite. ","useful":1,"cool":1},"dq-wiWLvU4N7Sdwk0QfowA":{"text":"Nice change of pace place from all the fried season and spicy cajun stuff in the area.  Go","useful":0,"cool":1},"dezcmSfILBLfDkwv7wDBvg":{"text":"Small joint, down an alley, evoking some of the best of the New Orleans cultural cliches. ","useful":0,"cool":1},"pSedS4cMjyx328y7sIa8hQ":{"text":"Yuuuuum!  On a hot night my daughter snd i shared patatas bravas and salads. Yummy greek r","useful":0,"cool":0},"d0Qix-2tTv3ttygccM8-Ow":{"text":"Loved this place! We sat outside and enjoyed a beautiful breeze and super good food. Varie","useful":0,"cool":0},"eMrQ5tRRBfVmEJeyPLQu1g":{"text":"High on presentation, low on value.  Good food, weird menu (1 page of food, 3 pages of dri","useful":8,"cool":1},"Jzi8D5veURhDO4RY2omlVw":{"text":"Always nice finding gourmet vegetarian food. So many flavors in each dish and every meat s","useful":1,"cool":0},"eSpgoVMVVrw5-v3daTniyA":{"text":"Was so pleasantly surprised to find a vegetarian restaurant in NOLA, much less an authenti","useful":0,"cool":0},"DsQ0yJAE0KoSUHV5jc8wOg":{"text":"Food was great, bit pricey for what it is and the portion size. Drinks are ok as well. I w","useful":0,"cool":0},"sTOm64oRbLtMmrcNQoXQ5g":{"text":"Wonderful food. Small place, but if you're expecting seating for a million people everywhe","useful":1,"cool":2},"PTobNur5ZJYTxHEzSih_Iw":{"text":"Food was good, a bit over priced. But reason for my review is...... I was there on April 1","useful":0,"cool":0},"4WCE2GE87fuoPDwQENxa1g":{"text":"Green Goddess is a teensy bit hard to find, as it's tucked away in a quiet alley in the Fr","useful":0,"cool":0},"MiU6Iql9E3jsrY3ghI8Ylg":{"text":"While the menu was full of impressive recipe concoctions with complexity and originality, ","useful":0,"cool":0},"zssSNlOg4COZ_wUOJsKSuw":{"text":"Really really wanted to check this place out. We came on a Monday and they were closed. Ho","useful":0,"cool":1},"WqgDpMpkqnF7f2li-nTYRQ":{"text":"Moroccan soup was superb!  Great to find a restaurant that caters to vegetarians/ vegans.","useful":2,"cool":1},"VTZxGusmybcC3OAutuWFUw":{"text":"Vegan food in New Orleans is rare, so to find a place that didn't just have something that","useful":0,"cool":0},"aL15OA9CXHAb_r7zvM4w2Q":{"text":"Atmosphere at this place is great, especially the outdoor seating. Heard great things abou","useful":1,"cool":1},"4_mu5Ak2ZdXCPE6epC7Yxw":{"text":"You must try their sweet potato biscuits. Delicious with maple syrup and pepper jelly. The","useful":0,"cool":0},"3ttI-LjUlvJU0tpCHkhs7Q":{"text":"We found Green Goddess with search for Vegan restaurants  thru Yelp and enjoyed the Mushro","useful":0,"cool":0},"WbJVK4q9eOCZfPPJOHKcZg":{"text":"I'm not but vegan, not at all. but the vegan dish I had blew me away.  not even sure what ","useful":0,"cool":0},"jyU_DqugAgmk3wssEAz07Q":{"text":"This review is ONLY for the food. The service was really LACKING. Only 1 server for the en","useful":0,"cool":0},"cEsvXG_PZBeM5SlmZaIDbw":{"text":"After a week of po' boys and fried everything, the Green Goddess was a delight. Nice to ea","useful":0,"cool":0},"SktO1qUmLblfk0WIQ35GbA":{"text":"I wish I found this place sooner on my visit to New Orleans. I'm not used to the heavy mea","useful":1,"cool":0},"p9jTBpiibVv05DsB8-qg4A":{"text":"Ok, this place was highly recommended.  So we got there, it was a bit wet outside and cold","useful":0,"cool":0},"Hj2WjO2omHBQXSEINbnZrA":{"text":"As a pretty strict vegetarian, as well as someone who is deathly allergic to shellfish, I ","useful":1,"cool":0},"zzPooQ9zoWmuhJ9KXh3aGg":{"text":"This is one of my all-time favorite spots in New Orleans.  I found it when I was still veg","useful":0,"cool":0},"qyJaX9n3rzEGEvDdVYkxow":{"text":"I have never had better food for these prices, and have certainly paid way, WAY more for m","useful":0,"cool":0},"9NOnVq_o5DbbuTRN3uy2vg":{"text":"During my most recent trip to New Orleans, me and ten other friends were celebrating our c","useful":1,"cool":1},"cvBho-h4yX92EOCafULojQ":{"text":"I had no idea what to order when I saw the menu, everything looked interesting and unique.","useful":0,"cool":0},"PSuvWyviDvQmmAIYIjbaoQ":{"text":"Yum!!!\nUnique menu with lots of fresh wonderful choices. I had the specials: crab, mango,w","useful":0,"cool":0},"xfyB7XxcGG6-Q3gt9niavw":{"text":"We went to the Green Goddess for a late breakfast on Saturday Nov 9th. We had heard good t","useful":0,"cool":0},"t6CuV2FZh0tR3t74os9ZiQ":{"text":"This place was THE BEST.  We had a fabulous time.  There were 6 of us and we took over hal","useful":0,"cool":0},"Og4b58262eyl7QUrV2VXTg":{"text":"2nd time in NOLA and 2nd time at the goddess. Had a beautiful time sitting outside and enj","useful":0,"cool":0},"G1r1KbiO3Ha-FU0Vfp9FFw":{"text":"We found the Green Goddess through a friend. The food was not only delicious, but also ver","useful":0,"cool":0},"jJ7UBKv5HmdcRmwqc8HZVg":{"text":"After following Chef Chris's blog my partner and I were very excited about eating at the G","useful":3,"cool":1},"S3Q-oCHPiUiA2OvJOcr59A":{"text":"As a New Orleans native, I wanted to like this place and to be honest, the food was fairly","useful":1,"cool":0},"rZ-qSkfpp21ZjMqPKo-8nQ":{"text":"Wow.  I was in town for a conference, and visited the Green Goddess twice.  The food was i","useful":0,"cool":0},"7EuFIOosCrI5sHTZH5A2aA":{"text":"Reminiscent of England at a recent World Cup - the odd moment of interest but ultimately b","useful":0,"cool":0},"KI7o5iZ97z3TTB3qd1O8bQ":{"text":"Fabulous healthy & local options with plenty of vegan, vegetarian & gluten free options. P","useful":1,"cool":1},"BbupD4bEb52D0r4FaLQ15A":{"text":"Delicious food and great atmosphere! I got the vegan po boy and it was filled with so much","useful":1,"cool":0},"iM9S8AnW7X2UvA-wjRkDsw":{"text":"My friends from Chicago visited for the weekend and they are veggie lovers.  I've never be","useful":1,"cool":1},"70USajBHYhHkV0NiD4I5OA":{"text":"Very slow. Food was sub-par.  It felt like a menu you could make at home, but if you didn'","useful":0,"cool":0},"5aUtgBuUm1Z_VtqXW22M1A":{"text":"I rated them high for the tofu sandwich and grits. Negative 1 star because there was no AC","useful":0,"cool":0},"xqCGMBOe6TJWxcYAAkYI3g":{"text":"Very odd service...as in I'm going to come to your table and not say a thing. That was OK,","useful":0,"cool":0},"LHFdJGIsbYVeZLcs-Hyyng":{"text":"The brisket dish was a. Maze. Ing. Brisket you can cut with barely the touch of a folk and","useful":0,"cool":1},"CpGXVU6xq7Sts2w1tgZMlA":{"text":"This place is absolutely filthy. There is only one restroom smeared in dirt, filth, and hu","useful":0,"cool":0},"3qWvirkzxYv99DoByCNxlQ":{"text":"Excellent little restaurant in the French Quarter- good anecdotes to creole and some good ","useful":0,"cool":0},"coiZBIDtvZvEuO19b54h4Q":{"text":"The food deserves five stars. The cocktails deserve five stars. The customer service deser","useful":0,"cool":0},"4T8jTPdGdyWWk6NBsXueGQ":{"text":"A Very neat and delicious unexpected find! I Wish we found it sooner on our vacation, so w","useful":0,"cool":1},"7bp2pTulPivio_Lx2FBdDw":{"text":"A little bit of a Vegan offering in NOLA.  Worth a stop!","useful":2,"cool":1},"xo0lewbRo9T2lMDGn2HXKg":{"text":"Honestly,  wasn't that impressed with my food choice and my brother didn't like his either","useful":1,"cool":0},"LNLMErkYngAQ61CGsMgWbw":{"text":"The food is amazing. That said, the billing is absolutely ridiculous. We had a party of 8 ","useful":0,"cool":0},"aKypQiartLvYt238glDneA":{"text":"I was all set to write up Green Goddess a few weeks back, after my second visit for lunch.","useful":10,"cool":8},"82zCjfbJ78AGjEy4cdWuxQ":{"text":"Fresh & delicious food.  Vegan, no problem.  Omni, no problem.  Owners are friendly.\nBeet ","useful":0,"cool":0},"tObtRQ8m3edsptix0XJxOA":{"text":"Really delicious fusion meets traditional New Orleans cooking.  We had the intriguing lent","useful":0,"cool":0},"9d2L6Kr4xhudtxA78HVIuw":{"text":"This has to be one of the best restaurants I have eaten at in a long time, on par with som","useful":1,"cool":0},"epWfc6uuSiuCxtyT4QfE8w":{"text":"We came here in search of vegetarian food with a New Orleans twist and green goddess offer","useful":0,"cool":0},"vjlq0b6haweqw_qA3QE4Nw":{"text":"Waited about two hours and the entire dinning experience was about three and half hours. G","useful":1,"cool":0},"BBOsdxFL2rIv7UuYdFqVMA":{"text":"This off-the-beaten path place is a must-try. Food here is made from a mixture of eclectic","useful":0,"cool":0},"sbBG8g2KxTo1kTyuAQ8UYg":{"text":"Excellent, vegetarian friendly cuisine for those in the French Quarter who don't feel like","useful":1,"cool":0},"k0gSL_aIWOAaxAFqsydShw":{"text":"The Green Goddess is a farm-to-table kind of place with great vegetables and locally sourc","useful":0,"cool":0},"tDfglq-fBlG3O6BMOoIz9A":{"text":"really great atmosphere, outdoors with beautiful architecture. the food was also really gr","useful":0,"cool":0},"93ad1zStBTiZZVZjQHYJyw":{"text":"This place is my favorite in NOLA.. The beer selection and the unique entrees are amazing ","useful":1,"cool":1},"cSDp2NjWCzAcVTJF_eLVYA":{"text":"If it wasn't for the slow service, Green Goddess would have easily received five stars fro","useful":0,"cool":0},"TEIq9mmLmsrfyeqbtbM6KA":{"text":"My daughter and I selected Green Goddess because the reviews were great and because she's ","useful":1,"cool":0},"Z4I2VscWiOM6rc2BvHhwGQ":{"text":"I'm from Philadelphia and came to NOLA for jazz fest. This place was not \"traditional\" New","useful":1,"cool":0},"izCpAnBqJBJ1a1Uqu4gBJw":{"text":"First, my apologies for a review 8 weeks after visiting.  New Orleans was fun and all, but","useful":2,"cool":0},"GIB7JoepWJn24L5pyCljqg":{"text":"Well, I came two days in a row and got the tofu bahn mi to go and ate them in about 5 seco","useful":0,"cool":0},"M1inXYRIE7rs6gNjcZtf9g":{"text":"We found the Green Goddess to be in an alley with very tight quarters. You don't come here","useful":0,"cool":1},"x579E9M6FIQNkEN_izVcSw":{"text":"Found this restaurant on yelp because we needed a vegetarian friendly place to eat. First ","useful":0,"cool":0},"ebssUOwln_CNu-frdq8dog":{"text":"Very disappointing!  We went here because of the vegetarian options.  Although it had seve","useful":2,"cool":0},"vWOJUKRPFAgf7APpOojgxw":{"text":"We tried this place because it was close to our AirBNB and it had good reviews on Yelp. We","useful":0,"cool":0},"Zy_1Osht_Zi48bEEIIIr9A":{"text":"I was looking for vegan friendly meals for my friends and stumbled across Green Goddess. I","useful":2,"cool":1},"albV4TRtcoFJZW8WfXEfvg":{"text":"Great place for breakfast or lunch.  Get there early for lunch because the it's pretty pop","useful":0,"cool":0},"Y7mWC8PS1WKgZY00TQ5wYw":{"text":"Such a fun place to brunch! Everything is so healthy and delicious, trying to decide on wh","useful":0,"cool":0},"yw3Q7FBWgv5xTFW85jNoLQ":{"text":"I had the Acadian country breakfast (I think that was what it was called), which was one o","useful":1,"cool":0},"Y0IoLlulA3VMfcYJ3YB0iA":{"text":"This is easily one of my favorite secret spots in New Orleans.  It has a great, trendy amb","useful":0,"cool":0},"GmLelLC_vKKS_6_JFhLoLQ":{"text":"It's a good place to have some vegetarian options and more healthy fare after eating your ","useful":0,"cool":0},"SOWKa3a5amMbNrRdYkBwNw":{"text":"Finally we found Vegetarian food, that was not fish related, in New Orleans. Not a big sel","useful":1,"cool":0},"YTH6GOYcAQRhdvqhnaCSog":{"text":"I enjoyed a wonderful meal at your establishment during a bachelorette celebration. I cann","useful":1,"cool":1},"-zS_1-hfCjUWf2nfFkp1dg":{"text":"So tasty! Came here for brunch and back for dessert. Very small place with inventive but a","useful":1,"cool":0},"H3138MahM3b1W6rN9DPzxg":{"text":"Yum.yum, yum, yum. Sweet potato bisque was amazing. Great service. Light, flavorful, tasty","useful":1,"cool":1},"qJnBJoAivoWPM5XTDx6FKw":{"text":"Wow.  Green Goddess defies categories-it is not fully vegetarian, Mediterranean, Southern,","useful":1,"cool":0},"UBFh9pEvWNhs4h52nWkyKg":{"text":"So glad we came upon this place for lunch! Recommended by a friend in our group of 4 based","useful":2,"cool":1},"gPrpHYBKfKSwJROnlZy_UA":{"text":"Great food, cute setting and lovely staff. Food felt healthy and wasn't heavy like other l","useful":0,"cool":0},"89FgZPADC1ayEqDGC-aFDA":{"text":"One of my favorite places in New Orleans. Great drinks, my favorite is the Aviation. The w","useful":0,"cool":0},"LpaRMV-BcgcNA3hUjnjyyQ":{"text":"We were on the hunt for a nice, cold salad. This popped up as a place that seemed to offer","useful":2,"cool":0},"qelsJ75VfDDPVPu7-jzRig":{"text":"Wow, this was quite an experience - really long wait for dinner (over an hour) and almost ","useful":0,"cool":0},"s9rfM78lTmTU1bUjoGaNIw":{"text":"I almost hate to write this review as I feel I'm letting the cat out of the bag on this on","useful":2,"cool":0},"Yv7GUMR3W58EnHB--jkg1g":{"text":"Awesome food and service. Hubby says I can be vegan if I learn to cook like this place.","useful":0,"cool":0},"gVZVV8c_NA6hWnyUwvQXIw":{"text":"Yes! This place is a haven for vegetarians in the land of NOLA. Delicious bites and the mo","useful":3,"cool":1},"b2Atwm1xahHvXJZpa4KbpQ":{"text":"The food here is fantastic!  We had the \"Hulu Shrimp\" (known at the Green Goddess as Shrim","useful":0,"cool":0},"JiDGJPKEsOAuVhPv5S69LA":{"text":"holy cow. whenever i eat at a Veggie or Fusion type restaurant I'm always worried I'll wal","useful":0,"cool":0},"AljUEastOMluk_xyJO89qQ":{"text":"Green Goddess is my new fave Go To place in this city of \"you can never find anything heal","useful":5,"cool":3},"ZkXnElFbQU3wWjvQKoGqfQ":{"text":"Lovely little restaurant in on of the alleys in the Quarter. \nAll food is homemade with lo","useful":2,"cool":1},"rTp5Kz8Qmn1oWD-T7ukQaQ":{"text":"We were looking for new spot to enjoy veggies with flavor and this is the place. Excellent","useful":0,"cool":0},"J4UEBSkpNr2CkVUZN_f97A":{"text":"Great vegetarian / vegan selection, quick. Not a sit down place, but's that's fine for lun","useful":2,"cool":0},"1yOPi3O92hE14h4ed9ZT9g":{"text":"This very tiny restaurant's menu is pure cutting-edge gourmet deliciousness. We arrived ea","useful":1,"cool":0},"ScsjF6sXErDPge3TkbNyYg":{"text":"First, the food was excellent. Really. But every other detail was not. We got lucky and go","useful":0,"cool":0},"AXsE9Wqi-3hhnwX9qPhoIQ":{"text":"I love eating at small restaurants where you get to talk to the owners/chefs.\n\nGreen godde","useful":0,"cool":0},"1YkY3DQOr9_SRDuBY6czqA":{"text":"This dining experience was hands down the highlight of the trip for my girlfriend & I.  Ma","useful":1,"cool":1},"aEw8NZ5qSfMuoQcfJv8MGQ":{"text":"Hands down the best restaurant I've ever eaten at. Not the best in New Orleans, not the be","useful":10,"cool":7},"pNLGrOwbC--TchdJRWiL_Q":{"text":"We came here during a recent trip to JazzFest based on Yelp reviews and it was SO good!  \n","useful":1,"cool":0},"5L9Vjf6tOa-ccBEiOf9qmQ":{"text":"I will not be able to write about this restaurant without seeming like I'm resorting to hy","useful":3,"cool":2},"A2JtuX8Aa9TqDeyE9l8FkQ":{"text":"Quirky little restaurant with vegan options, worth checking out before heading down to Bou","useful":1,"cool":0},"FH3v_VxeQddlrTWJzpqj9A":{"text":"Interesting and excellent foods that I've never heard of any other place serving.  The mos","useful":0,"cool":0},"eydegjAeks9Fc8PYp7DurQ":{"text":"Only go when it's cool enough to sit outside in the alley.  Food is very flavorful- in fac","useful":1,"cool":1},"pjuQqxMFCufnQRucp7ffrw":{"text":"Had the green goddess wedge salad and South Indian pancake. Salad was quality and goat che","useful":2,"cool":0},"b49x_Q8Hho7o6wh_vHdfVw":{"text":"The Bloody Marys are still great, and the lamb meatloaf sandwich I had this time was wonde","useful":0,"cool":0},"4o-PBFdcn3NSzg0GMVnccg":{"text":"Thank goodness for Green Goddess! After a few days visiting New Orleans, my boyfriend and ","useful":3,"cool":1},"gXR4XzJI_rNrTDyQySMdbQ":{"text":"I was torn between the meatloaf sandwich and the shrimp & grits, but when our waitress men","useful":0,"cool":0},"cpceNknyD93HBIYdFzhd9Q":{"text":"Wow. I had been avoiding this place because most of my vegetarian friends said it wasn't w","useful":3,"cool":1},"L6XzzPxjs-WhqfpEz_h62w":{"text":"I like to eat outside.  \nUnfortunately, I live somewhere (New England) that really doesn't","useful":5,"cool":4},"DvE9EFCmsxEECmpKG3VhZw":{"text":"Service un peu lent, mais les plats vegan sont tres bons, le vin également. Cuisine fusion","useful":0,"cool":0},"IHoS9HtUtmct1wW5I1ry_Q":{"text":"After too many consecutive weeks of business travel, I really needed some veggies. This is","useful":1,"cool":0},"WdZbhX2lWmFFwCPfO9_BUA":{"text":"Good place to try vegan food. We tried the tofu dish, but the portion size for the bucks d","useful":1,"cool":0},"oZPw6MT_AswfsFbj8vjBVQ":{"text":"IMPRESSED!!! If you're looking for non-fried food in NOLA (and boy is that hard to find) t","useful":0,"cool":0},"oOxJ6rlwYPt_Wvj1xucV8A":{"text":"We had the caramelized heirloom tomato salad, a shrimp and portobello, and a pepper tomato","useful":1,"cool":0},"rV7IAuAzmxtxrYGLZlkVDA":{"text":"Ok I went there off a Yelp review and was excited thinking this place was going to AWESOME","useful":0,"cool":0},"90d4tpHHWdBgU3TcgoDtLQ":{"text":"The food is amazing.  We couldn't decide on just 1 item each so we just ordered a slew of ","useful":1,"cool":0},"zk0ucWlUI9LcwHMHKH6kFw":{"text":"The smoked duck breast and shrimp bahn mi was the best meal I had in New Orleans.  Flavorf","useful":1,"cool":0},"8yHSzRsBf0rChi9NsTdeHw":{"text":"I so wanted to love this place.  It seemed from yelp reviews that this place had lots of v","useful":0,"cool":0},"I5FAkdWCy43LqAeo8ZFxRA":{"text":"I really, really wanted to like this place.  Between the small number of tables in an alle","useful":2,"cool":0},"lfxbGwQNYGzjlsiljaMd6g":{"text":"We had dinner at this great restaurant two night's ago.  We chose this place based on othe","useful":0,"cool":0},"NvSebfabpeFYT8bYxijhTg":{"text":"lovely location in a pedestrian alley. Sit outside. Duck confit salad was excellent. The p","useful":0,"cool":0},"AzJoad0O9AwDttnkWxXOtg":{"text":"No. No. No.  I am a vegetarian, but I was extremely upset with the price and the portion s","useful":3,"cool":0},"FmFwpZGImQfF-8d3WFe1EQ":{"text":"This place is great. Awesome vegetarian options. Staff is friendly and service is solid. I","useful":0,"cool":0},"SiizfLxKuEcz-YX_n2ugsQ":{"text":"So we went with the monchego grits, sweet potato biscuits, and the Cuban luau sandwich. To","useful":0,"cool":0},"GQEqgp0_m7KyWxE3ioGIoA":{"text":"Not a lot of vegan options and the food is just okay. They are fairly flexible and knowled","useful":0,"cool":0},"omuyFejgWbJO27kp_zKELQ":{"text":"This was a very nice place to eat, my sister took me here and I was very pleased with the ","useful":1,"cool":0},"_Edw2MjKPW5lyeXU0uxyPA":{"text":"Spent $86 and 90min on the worst lunch. Soggy bread on a lame sandwich. Salad poorly slapp","useful":0,"cool":0},"lpHg_unVvOmK7TsMutiusg":{"text":"This place is great .. mainly because it has some really good veggie options. We came here","useful":0,"cool":0},"Mx04K3CxzpE0AvrZf2e_GQ":{"text":"This place gets a serious 5 star for the food which is what this review is based upon.   I","useful":0,"cool":1},"P9z99sVYuNgrhFcByCm15Q":{"text":"10 stars for the creativity of the drinks and menu.  EXCELLENT place to eat if you have so","useful":0,"cool":0},"hk5E-M52bOWclQlbw8mVjw":{"text":"This place is amazing! I got the Beef and it was delicious. A must try place if in the Fre","useful":0,"cool":0},"C6KwH-iLNYQfZ_yQEcw3GQ":{"text":"Happy Mardi Gras!\n\nThis place, located in Exchange Alley is top notch for organic and uniq","useful":0,"cool":0},"AN9sneEqSUo5HXFuPNzRPA":{"text":"Not to denigrate the great food I've been having, but I finally located some vegetables (n","useful":1,"cool":1},"RPvYZIIwVO4mM4-C9yY7Bw":{"text":"The truffle grits with biscuits and mushroom gravy are a rare and welcome imaginative alte","useful":0,"cool":0},"djOamyFSMZ6b1BN5hd_gDQ":{"text":"Excellent healthy menu with lots of really creative dishes. Loved the sweet potato biscuit","useful":0,"cool":0},"zCPNqa-pMRvKZMDyq5Baig":{"text":"Only in New Orleans would a restaurant named the Green Goddess serve a bacon sundae. Don't","useful":2,"cool":3},"B-0biaI7TZOa7_IfRP2mqg":{"text":"This place doesn't look like much when you see it. Just a couple of tables in a small spac","useful":2,"cool":1},"2fWmmoTT2QlCMrlpmZEqOA":{"text":"Green Goddess should be synonymus with New Orleans. They have an amazing alcohol selection","useful":0,"cool":0},"2tzIbadHEtSRkoVHKGp7Og":{"text":"Fabulous.   Kudos to katie.  Ryan.  Spooky.   Pork belly?  Whoa.  Charcuterie...  pomegran","useful":1,"cool":0},"YflSsHVsJ_bmKh3dgwGffA":{"text":"We stopped for a bite before flying out.  Only had the charcuterie, a couple drinks, and b","useful":1,"cool":0},"By23Vl3gNoVrpZOKgb7xfA":{"text":"My daughter and her boyfriend are vegetarian and I am not.  Finding a restaurant that is g","useful":0,"cool":0},"eHegvlTp32zpe8FDZ2GX-A":{"text":"Hands down, the best restaurant in New Orleans.  But please don't tell anyone, we like the","useful":0,"cool":0},"zJ23HymiGCpUW6wu_6rB4g":{"text":"Small chill place in really cool alley\nMany options, but we had beet salad, shrimp escabec","useful":0,"cool":0},"CDdsECDMoXtp_D65ALkIgA":{"text":"I visited here a month or so ago and all of a sudden, I am having Green Goddess cravings. ","useful":0,"cool":0},"d8CzxJDxR2Iye1fXMHqmOw":{"text":"Green Goddess is an amazing find- unique as they come. Great staff, but above all their fo","useful":0,"cool":0},"ufpnrgL3lRI1aNiqWTBQaQ":{"text":"Food here was pretty good, I think you do get what you paid for though...the prices weren'","useful":0,"cool":0},"jO7588QyY6gEEm7Wx0EaDw":{"text":"Oh thank you Robin Hood, Queen of the Servers, from saving me from the meal I wanted to en","useful":9,"cool":4},"Awp1t1JVe5zC2WPKfJiu_A":{"text":"Not impressed.  I was expecting great things and was very disappointed.  My boyfriend had ","useful":3,"cool":1},"Qz02srf3scayZ2FyNpzx_g":{"text":"Great lunch spot as long as it's not too hot.   Cocktails are good but pricey.  Try the cu","useful":0,"cool":0},"J6ENw-N3SD7FPhWVLJ4zFQ":{"text":"Cuban luau sandwich was interesting and good. Not much room inside.  Good beer/wine select","useful":0,"cool":0},"A9luvISRZ53-uRJVnFR1UA":{"text":"If you've spent more than 30seconds w me, you've probably gathered that most of my meals c","useful":3,"cool":2},"g-ITq7bVYL4oU1WkiD1Ekg":{"text":"Green Goddess is an amazing little spot with great food and drinks. Their location is a bi","useful":0,"cool":0},"DBZYxqnxMDwxOZ1M9bIM1Q":{"text":"I left this place with a sad feeling, really was expecting more! We started with Potatoes ","useful":0,"cool":0},"ej8d7gVkSW5zuOTdhMT08Q":{"text":"Another meal in which the belt has to be loosened after the intake....\n\nYou would think, d","useful":0,"cool":0},"dCWcyzxgaIB4ZZJ9AKQhVQ":{"text":"I absolutely love Green Goddess. Everything I've ever eaten there has been incredibly deli","useful":1,"cool":1},"_s7k7I1gnsLzxUNO4RXBgQ":{"text":"Although the wait was about 45 minutes, we finally got a table and from start to finish, t","useful":1,"cool":0},"l-1plKswGlLkVvwf9fvJWQ":{"text":"Wow, wrote a polite email to Chef Paul about his having foie gras on the menu, and got som","useful":2,"cool":1},"jgX9ZxR6xw_jL33mAyySoA":{"text":"We were looking for a restaurant in Nola with some vegetarian options and the green goddes","useful":0,"cool":0},"iLBMjpOM7fGhuJU23if-Dw":{"text":"If I were to encompass everything that San Diego is to me in one little store, I would cre","useful":0,"cool":0},"Q-CffMhatAuR__NafhmHLQ":{"text":"I was looking forward to eating here. It is in a pleasant alley and the food is good for a","useful":0,"cool":0},"Nx1daNvNhItOzXCDcqSc1Q":{"text":"Delicious, comforting and inventive food. You can't go wrong here. Try the sweet potato bi","useful":1,"cool":0},"loTFIOZ__uqTCdXaRFuUCQ":{"text":"This little \"hole in the wall\" joint has a fresh and interesting menu. They feature items ","useful":6,"cool":7},"soRVh2MBAXMpDDjxYsBt4A":{"text":"Very creative and delicious food. Great for vegans, plenty of healthy veggie options. Ever","useful":0,"cool":0},"HtI85MN91cuBNJl8A9Dreg":{"text":"It's location in a side alley makes it a pretty hassle free experience to get in and get a","useful":0,"cool":0},"neaREBl49vvCySOiIg1RbQ":{"text":"*Mobile Review*\n\nCame here with fellow ADEA colleague\n\nDecor: 2.5/5\n-3 to 4 tables for out","useful":1,"cool":1},"5Hjh10tNptkh8Y4EV-iEdg":{"text":"Excellent vegetarian fare. The hummus with the beet and pomegranate infused was fantastic.","useful":1,"cool":0},"Yp4b0OQT8s2TUmW6_cZspw":{"text":"Good food. No indoor seating...so eating hot food might burn u on summer days. No complain","useful":0,"cool":0},"xJJ8La11fOmS7lh-eCLzlw":{"text":"I've gotta thank the Nola yelpers for steering me toward this place. What a cute little ca","useful":1,"cool":2},"hjtZpbhZYJCHPbpe4JKN6g":{"text":"Such an amazing little place for vegans and vegetarians. We ordered soup of the day which ","useful":0,"cool":0},"M0avm1W20EyD3ZG2M7GS8g":{"text":"two visits so far, one for dinner and one for brunch. \n\ndinner was an absolute win. Chef C","useful":0,"cool":0},"OVz7VIktTVz1AawkS_Ll1A":{"text":"A vegan in NOLA in a bachelor party is no easy feat. This restaurant gave me a great south","useful":2,"cool":2},"_ajOZbFmqd81eYZLKpMyyA":{"text":"The walk here was extremely sketchy and uncomfortable. This is me speaking as a tourist bt","useful":0,"cool":0},"KqEbYzMz7vIFfScG82sRQw":{"text":"Awesome. We got there right when they opened on a Saturday morning (after deciding we didn","useful":1,"cool":0},"N_LrIcTPhLwJ0GWQGlT7ZA":{"text":"I think it is odd that so many reviews criticize the service here.  I went for dinner one ","useful":0,"cool":0},"_DajAYEtJrf7HRwGH2iBpg":{"text":"Simply amazing!!!! Food was not what I expected. My friend is vegan n it was hard to accom","useful":0,"cool":0},"KQQj9vc1lseev7zJXwhclg":{"text":"Pooh and I wanted to try this place for lunch and waited patiently for it to open - it's o","useful":0,"cool":0},"qcx2TDczhX_orDgM1LszQg":{"text":"Crab with watermelon and mango. Yum. This place was highly recommended by some local frien","useful":0,"cool":0},"aspVxkDGFeA8dRyfhstnZA":{"text":"Would love to say I ate something here, but this hungry lady never got to eat. The place i","useful":0,"cool":0},"p58kYB78WO12TzwDE0aZbQ":{"text":"Great food and more vegetables than I got in any other meal in New Orleans - Thank you! Gr","useful":0,"cool":0},"pXoVqo68UByGEf_njfvifA":{"text":"Wonderful flavors and taste... The special green sauce I pour it over everything.","useful":1,"cool":0},"nKzSOtEcyflNT3ir1Ja6fw":{"text":"Green goddess never disappoints this fruit and veggie lover. Again, everything was amazing","useful":0,"cool":1},"35MTJWq0CE7_vcAtj8qwXA":{"text":"Filthy. This place is really quite disgusting in terms of cleanliness. So much so that it ","useful":3,"cool":0},"9rILaVHHj7x07sf5hZSsXQ":{"text":"Went out of our way to visit the Green Goddess for its veggie options - NOT an easy thing ","useful":0,"cool":0},"P_Ha0eCWpZ5u7iVAeC8snw":{"text":"Tiny little venue that serves a whole lot of love in their dishes.  We visited on a Sunday","useful":0,"cool":0},"oU8WLKpgUB5Xc8lgQXacqQ":{"text":"I can't believe I forgot to review this, because I've definitely recommended this restaura","useful":0,"cool":0},"lyEJqxassqcnyuXjkLbtiQ":{"text":"The four star review is reflective only of the food. We had an amazing meal here while on ","useful":0,"cool":0},"te3t-9SiuerSSOquo5guhg":{"text":"We went to New Orleans for a couple days only and the first morning we were there we decid","useful":1,"cool":1},"YnB_iwhFdHnIfW4cps_qCg":{"text":"Holy Moly, the food was delicious!\n\nIt's a small-ish place, with seating at the counter an","useful":0,"cool":0},"fstk6SHRW1eqnrlguXCs9Q":{"text":"We ate there friday night and it's my new favorite restaurant.  A truly amazing place with","useful":2,"cool":2},"0bFKcfUpuVpCEecnXqJsfA":{"text":"Okay, my three foodie friends and I agree that this place was absolutely fantastic. On my ","useful":2,"cool":2},"qAvcwVGjqr7ZDKsmR8E1DA":{"text":"I've only tried the beet salad with shrimp, but man is it delicious.  In a city of amazing","useful":0,"cool":0},"AkhGBMydqGvnTGKKvxE5TA":{"text":"Food: Excellent, imaginative, unusual and very enjoyable.\nAtmosphere: A bit casual, dirty ","useful":1,"cool":0},"RyT7TGGviaLffKA0cLJW6w":{"text":"One of the best meals I've ever had. Everything just tasted wonderful! I had the sticky to","useful":1,"cool":0},"DqRSVyfJbqTqymw6ZVk20g":{"text":"My newest discovery in the French Quarter! A most innovative menu, including vegetarian di","useful":1,"cool":0},"iN66i9jrnRnLKI6yxsC3EA":{"text":"We tried this place because we were intrigued by the creative menu.  Amy had the lentil pa","useful":0,"cool":0},"C49FGofhvMItiemdk-d9cw":{"text":"An eclectic spot and an essential enabler for anyone seeking to eat vegetarian or vegan in","useful":4,"cool":4},"YDIQnj3lgwMb6dI2-D5p4w":{"text":"If you are a vegan or vegetarian this small restaurant located in New Orleans is a delight","useful":0,"cool":0},"2EB1eWEdhZ8ONo3kh32diw":{"text":"Absolutely brilliant food. If you're a vegetarian and in NOLA this place is a must visit. ","useful":0,"cool":0},"23dz3eZx5XFA32hJ27wwKQ":{"text":"By rights this is more of a 2.5 star review, but I'm taking off the other half for sheer d","useful":4,"cool":1},"olP0DIsP4SumoFopRRcYkQ":{"text":"Green Goddess is a cute little intimate restaurant tucked away on Exchange Alley in the Fr","useful":2,"cool":1},"YFeoArjFvB8XwQVt9j33vA":{"text":"Wow. The caramelized heirloom tomato was AMAZING.","useful":0,"cool":0},"Q85mmIELG0vBNRlnjV0POQ":{"text":"Lundi Gras about 1 PM.  After parking at the edge of the city, we were pretty hungry by th","useful":1,"cool":1},"CKwRSiVPjERlmp64MEc_eA":{"text":"Probably my favorite meal in Nola. Dazzling fresh green veggies, great seafood, every plat","useful":0,"cool":1},"MP3f4nB5qGhLKBqanRMRvQ":{"text":"Not just vegitarian food.  Very creative.  Very good.  I would go back.  Very original nol","useful":0,"cool":0},"Efa-b6NA5kHhGeZREuklPw":{"text":"This is my favorite spot in NOLA. Amazing. Innovators.","useful":1,"cool":0},"cTVbkkm2CjzKBeEhlLO5nw":{"text":"Great and unique food and amazing cocktails made by a chef and a bartender, respectively, ","useful":0,"cool":0},"nzHAXz4KRuLWvigPjqGvYA":{"text":"Agreed - this place deserves nothing short of 5 stars. It's was the clear star of NOLA for","useful":0,"cool":0},"JM9HfjqTMOl_FRo7tSdCZw":{"text":"While not a place I will go frequently, eating at Green Goddess was perhaps the most enjoy","useful":5,"cool":3},"kyfdSC26AaW9uiept4Ainw":{"text":"Loved the handcrafted cocktails here!  I can't comment on the food, but I did notice they ","useful":1,"cool":2},"LhoF9LG_MJ_qhEBsPEH54A":{"text":"The Green Goddess presented exactly what I pictured hip new Orleans cuisine should be: Fre","useful":1,"cool":1},"bJQMd6EAIbIOEqkM-_lThg":{"text":"A great spot for vegetarians in NOLA who want to have flavorful food. It's such a cute lit","useful":2,"cool":0},"OfhFHzpuJKw6lWb7GO49YA":{"text":"We were in New Orleans for Mardi Gras weekend, and I was thrilled to find a place in the F","useful":0,"cool":0},"wmPGePRu9BJpGYNDNUN1EQ":{"text":"I had wanted to eat here for so long. I can't even tell you how excited I was to finally b","useful":1,"cool":0},"XoV5PnQRYHsh0xv_imNgYA":{"text":"Stumbled upon this adorable place in this quaint ally. It was PERFECT- something healthy a","useful":0,"cool":0},"O86NKY7OOa5-kxjivu2auQ":{"text":"This place was AMAZING. Best vegetarian options in NOLA, hands down. Definitely get the be","useful":1,"cool":0},"97UIFKDJOCQNUEXBJtwvdA":{"text":"I had an excellent lunch here while attending a conference in New Orleans.  The food is do","useful":1,"cool":0},"5oJy-ytE62VEJ6h4pk5lYQ":{"text":"came here for lunch on a monday afternoon, the place still has a decent crowd for that tim","useful":1,"cool":0},"j0hk1jJW3X4juvonQYMQRw":{"text":"what a terrific option for vegetarians. I'm not, but loved the food. sitting outside in th","useful":0,"cool":0},"dQ6YXvR-OFBVrLeQBQ3RPQ":{"text":"Truly fantastic. Loved the food & the location in a French Quarter alley. We went back twi","useful":0,"cool":0},"ygs0K4Vvtnl4aLsI_koaXQ":{"text":"Nice quiet little place to grab a bite and sit outside although it is quite pricey. I coul","useful":2,"cool":1},"i_AZ4ZB509JylR1JpIz9iw":{"text":"For the last few years friends have urged us to stop by The Green Goddess for lunch, and w","useful":0,"cool":0},"acxyzMp2dapg6Uw8QOjVLA":{"text":"If I could make this zero stars I would. This place is so disgusting I'm writing my review","useful":1,"cool":0},"CCWBwVyaZEsp2OWpNyXzKA":{"text":"The best meal I've had in New Orleans was not a greasy po-boy or a heartburn-inducing etou","useful":0,"cool":0},"ejvVlXTtiBo5rvNbxEpzmg":{"text":"Cool funky spot with interesting food\nvery small and not totally clean but funky with view","useful":0,"cool":0},"T3XyAM9U3ITN6rgYWvGBaA":{"text":"Super goat cheese cheesecake with sugared mushroom top, interesting pear and turnip soup a","useful":0,"cool":0},"krXycWuySHOjneZjSbYB_Q":{"text":"Meh. Never got to food. Lacks proper restaurant management and organization especially aro","useful":0,"cool":0},"ZrWJFSVAEczX_buN9IW1UA":{"text":"As a meat lover, I was very skeptical about this restaurant. Especially considering my fir","useful":1,"cool":1},"ZqpLyI8zP90cPHm361dxAQ":{"text":"Healthy food in NoLa?  Yes, it can happen.\n\nI'm a spooled brat when it comes to healthy fo","useful":2,"cool":0},"J4_wF3XMezzgY1QoOJ2W7Q":{"text":"A Very neat and delicious unexpected find! I Wish we found it sooner on our vacation, so w","useful":0,"cool":0},"qNW8NLBAKQ_XnesqoZ46JQ":{"text":"I spent 5 days eating my way through new Orleans.  And I think I can safely say that this ","useful":1,"cool":0},"c9lTx7gfoGcbmA0LxLrQEQ":{"text":"Stumbled on this restaurant during my first trip to New Orleans walking through the French","useful":0,"cool":0},"C5RhaQtUCP3Wd42QhzMQLw":{"text":"I'm vegetarian and it was hard to find a lunch spot that had non-seafood and meat options.","useful":0,"cool":1},"dqtU55GbVSYZNHllkgzBCQ":{"text":"Inspired menu! Makes me want to move to NOLA! Cheddar apple French toast ...duck fat fried","useful":0,"cool":0},"zI833pJmFZ66zW6XwFomyw":{"text":"Fabulous food! I was a bit hesitant at first, only because I cannot have gluten (Celiac's)","useful":3,"cool":1},"kdjb1ncQqD7n8U67650GGg":{"text":"I loved this place\nOk, so i looked it up while walking around New Orleans with old friends","useful":1,"cool":0},"Lp0NQM5f3rrYPdJ8TKBsFw":{"text":"Amazing brunch options in the French quarter. We arrived at 11.30, right before the rush. ","useful":3,"cool":0},"_XEY8T3q3EUYyyUAOWk4Uw":{"text":"I love this place.  The food is delicious and artfully crafted.  The waitstaff, bartender ","useful":1,"cool":1},"9IRVxA6NoiOJseJjLcge-A":{"text":"Delicious food on a quaint pedestrian-only street. Acadian country breakfast was very very","useful":0,"cool":0},"tiZS5VEUc5s1sBjO4GKECg":{"text":"This was our go-to brunch place during Mardi Gras. It's one of the best places for vegetar","useful":2,"cool":0},"jJREm41ZuPnOmQW8FqQGqA":{"text":"When traveling finding vegetarian, let alone vegan, options can be difficult.  Green Godde","useful":1,"cool":0},"Vf-SmkuG_LJCYfGBPWRRtA":{"text":"Came here, enduring rude service, having heard that this \"vegetarian\" restaurant could sat","useful":3,"cool":3},"K4z2WW4hUocjFAGRVFC5oQ":{"text":"I went to New Orleans to eat Gumbo and Jambalaya, and all that other southern food. But af","useful":2,"cool":0},"9G9dbaAS5BgpBMfZFW_ucA":{"text":"This is probably one of the most unique and different dining options in NOLA.  It has a me","useful":5,"cool":1},"2MPZLncrxZAoMkv_tHj-pA":{"text":"A hidden gem in the heart of the french quarter.They have pomegranate hummus, this was hea","useful":1,"cool":0},"zNo8oMisgW4LIqWBwxbY0g":{"text":"My FAVORITE spot in New Orleans?  It could be.\n\nYes, it's pricier than the casual atmosphe","useful":2,"cool":1},"fZrE__HCbU56HYJhW4ITKA":{"text":"Before you freak out at the three star rating and start sending accusations of blasphemy, ","useful":12,"cool":7},"devzjRfzZl7EY2odLR5u9Q":{"text":"The alley is a beautiful place to sit on a sunny day.  My waitress Sam, a perky little Aud","useful":0,"cool":0},"As2_HlZYEMUzYCA_clUb9Q":{"text":"A refreshing meal in New Orleans. Very creative and unique menu. Vegetarians and meat eate","useful":0,"cool":0},"fOTD4WPMubqt5Jz1w-W2vA":{"text":"This place is a slice of Foodie Heaven on a plate, located on Exchange Place in the Quarte","useful":2,"cool":2},"bB9JNBtmYqc-yv2NjMfltg":{"text":"Green Goddess, I bequeath to you the title of Best Cheese Grits Ever.  This is not a title","useful":0,"cool":0},"v2X1-Cx_v5nCjaQNkoZZjA":{"text":"Great menu and service, was hard to decide what to order as everything sounded good.  Food","useful":0,"cool":0},"kD9DlzIxL1Oedzz3tggM-g":{"text":"GO THERE NOW! We went there a couple of weeks ago when we were in town and I have been cra","useful":1,"cool":0},"HnWjSoodydlz1wxCQLt7qA":{"text":"I had this place on my radar because it appeared to be a gem buried within a lot of more t","useful":2,"cool":3},"I8klAqYt7ysPVmVyVsC8iQ":{"text":"Service and food could be better. Not what we thought it would be.\n\nCheese plate was medio","useful":0,"cool":0},"NKVi3XM3lTpe3hns7ik-Ew":{"text":"I had an absolutely awesome sandwich here. The location is the really special part of gree","useful":0,"cool":0},"IZpkdhrvT6fk1Q2mb0pV5Q":{"text":"Love this place for a casual dinner with creative and fresh food choices! I went a couple ","useful":1,"cool":1},"Y1Ag5qKM_e6xQSyAXHjtRA":{"text":"The Green Goddess flopped on their creative foods.  Foods were expensive and the foods wer","useful":0,"cool":0},"JLZGg7hka6OBfrSG_ftUDg":{"text":"A great surprise! I'm a little embarassed to say this, but I was hesitant to come here bec","useful":0,"cool":0},"vbkzEo7DT4QX3xx8ID1C6w":{"text":"Green Goddess - probably the most interesting menu I've ever seen. I will go back. Go here","useful":0,"cool":0},"Vomv39aA8kbEkuY0TWmMxQ":{"text":"What a shame! Restaurant with good food but with horrible service. It begin with just tryi","useful":0,"cool":0},"0LrXzymR0lwh8nKoaSMCaQ":{"text":"Good vegan option near Bourbon Street. I ordered their beet hummus and a salad after a nig","useful":3,"cool":2},"qRZVvSSOANFXyDGZf0uoog":{"text":"If Green Goddess were in any other metropolitan city, it would get three stars. But, it pl","useful":3,"cool":0},"9Fo6VgEyZPctvJzSgdgchA":{"text":"( really 4.5)  \nso good; everything I hoped it would be. Had the tasting menu and cheese p","useful":1,"cool":0},"RAiNdotg8-vay2Ht-nheyw":{"text":"One of a kind. Felt like, I had time travelled to an era where people cared about serving ","useful":0,"cool":0},"P3Os9dSJdMqM6TkPFIQ1NA":{"text":"Fresh salads and healthy eats in a charming small pedestrian street in the French Quarter.","useful":0,"cool":0},"Q_EirlpnL-9Ensbq4jlBkA":{"text":"Eeek. \nWe tried this restaurant because one girl in our group is a vegetarian.  An online ","useful":2,"cool":0},"-9qjKM9rc6g3gHFKPyfWnA":{"text":"Portions are small and the environment is kind of odd and grungy, but the service is great","useful":0,"cool":0},"lCi5EVdIC0LuF5zXMgWfVA":{"text":"Before heading to Nola for a conference, I made my map of vegetarian friendly places for f","useful":0,"cool":0},"BSdQbJr7YAuruOMcaoUEpg":{"text":"Great vegetarian options in a city that isn't terribly veg-friendly. We ate here on two oc","useful":0,"cool":0},"fmE-yhXpkbdGIhcJkgykDw":{"text":"If you like authentic dives then you will be thrilled with this place. Adventurous bold cu","useful":0,"cool":0},"NDOYoVvPAhFWkSbH_RhG7A":{"text":"One of the few vegetarian places in NOLA. Great drink menu, HUGE bowls of soup. Very hippi","useful":0,"cool":0},"0DpF_UeSHpIsU29-2p2yWA":{"text":"A little pricey, but this was overall a nice, hole-in-the-wall type of place right off of ","useful":1,"cool":0},"sTTbYsJoUVYv2rR443-BZA":{"text":"Although food was described in a mouth-watering way on the menu, it did not live up to the","useful":0,"cool":0},"LphWrYmibU8KHk-ZBAC2Xw":{"text":"This place is so adorable! On a quiet alley right outside of all the commotion. It's great","useful":0,"cool":0},"U0Svq_dYjnmp9cFs6zlwfw":{"text":"This place was recommended to our group, but unfortunately they missed the mark. We found ","useful":0,"cool":0},"XQVjpbNXy9mbpDwylgdTkA":{"text":"Awesome food! Very tasty. Friendly service. The meatloaf is awesome, although I wish there","useful":1,"cool":0},"nQTsrlcXwyfe6aexBDOFcA":{"text":"I totally forgot to update my GG review after my marvelous meal here last month.  \n\n\n\nWarm","useful":3,"cool":4},"j48IopY74wyhvgeWycR79g":{"text":"Gotta give credit where credit's due.......& I offer a huge thanks to Alexandra S for maki","useful":7,"cool":7},"Psmuow-uMcAUsOr2DL2_ww":{"text":"I was so excited initially to go here because they had such good reviews. First, I got the","useful":0,"cool":0},"H-HYPcUdrwPebXy363u6LA":{"text":"I had a terrible experience here.  First, I do not think this place is all that \"vegan-fri","useful":1,"cool":0},"Rh-S-J1Ptw2GkytRYDCxjw":{"text":"Five stars is not enough!!!! If you find yourself in NOLA you must go there. No matter if ","useful":1,"cool":1},"H5HMXaxu5cHNuAVY_xEP1A":{"text":"I thank all the raving yelp reviews while I was in NOLA for a professional conference the ","useful":0,"cool":0},"M0MefIMb2p4-VNBdjIDqww":{"text":"Definitely a cool dinner spot when you cant afford the Pelican Club. I loved the outdoor s","useful":1,"cool":0},"Y85HfMiCxupIwcBFD5Ag9Q":{"text":"Truly a disaster.  The hostess could not have been more rude.  While the Chef and waitress","useful":0,"cool":0},"F3bc2voyB6xMgAFVSQkfWA":{"text":"My boyfriend and I stumbled upon this restaurant the Sunday morning after Halloween. It wa","useful":0,"cool":0},"K_tbcTZ1wMkhhMWKk2obkw":{"text":"I had no idea what to expect from Green Goddess when a friend told me that we had to try t","useful":3,"cool":2},"y9c-HaUAhg2NAY6xGyZhfw":{"text":"Delicious, fresh food that provided a nice break to all the richness of most of the other ","useful":2,"cool":1},"G1Jc3VsfVFbUH-4ySXuwyw":{"text":"Not that fresh. Not that good. Deceptively named. look elsewhere for green and healthy. Th","useful":0,"cool":0},"Y0G6KGfpzQcVloJhjtwgDA":{"text":"Hidden gem of NOLA! On a side street off the beaten path. If you're looking for natural, d","useful":0,"cool":0},"5orlA2QT6FCr-TVMTZne3w":{"text":"We came at 5 pm and were quickly seated fed and watered. Beets and sweet potatoes were hea","useful":0,"cool":0},"O8uSiPuoeCn77A_yXpXW_Q":{"text":"We received some of the worst service ever at this restaurant. When we arrived, there were","useful":0,"cool":0},"BUwzkaFcEGGU5U7H2cHHYw":{"text":"Everything I've ever eaten and drank here has been a delight. The staff are very friendly,","useful":0,"cool":0},"S_6wzavY7gTBXMN2YQXOMQ":{"text":"I paid $38 for three courses and still left hungry. Small portions, not impressed with fla","useful":0,"cool":0},"gUCi2XLdxOlab4_o4NbhuA":{"text":"The Shrimp Curry was fantastic, and the service was very good.  I will be going back the n","useful":0,"cool":0},"aPj_tQ9hT3eiDvJAZrc0Kw":{"text":"I have a favorite restaurant in NOLA now: the Green Goddess. The meatloaf is the best I've","useful":0,"cool":0},"ECnoaE560NGVWOjlDvpegw":{"text":"Forget every single review that rates this hidden gem less than four stars. We ordered the","useful":0,"cool":1},"u4EQj1hrDpzxafdoE7DpgQ":{"text":"I was a bit skeptical about this place when I first went in. it's a small dining area, wit","useful":1,"cool":0},"xbkdHPL8bqm2H07vFsABuw":{"text":"The outside patio is an absolute dream location for a quite romantic dinner or a quaint me","useful":0,"cool":0},"1lYDpmA1GowlzoKjp19BdA":{"text":"Listen folks.  I just finished the brisket.  I had a plate of pate, bread and crab cake.  ","useful":0,"cool":0},"xXL-Jewvxm69L4d_rP2uUA":{"text":"It's Bohemian atmosphere had intrigue but little structure on getting menus or the check. ","useful":0,"cool":0},"TZzIzVSOQiViGIiSjH0s1A":{"text":"PHENOMENAL FOOD - unique dishes with interesting flavor combinations!  It is obviously coo","useful":0,"cool":0},"TKlPLogEzL2px5T9lTPh2A":{"text":"I went here with my vegetarian cousins and it was definitely not disappointing. We ordered","useful":2,"cool":2},"K1iEUugRp1oEVCcX1ZqV6w":{"text":"Hippie vibe, outdoor seating but food is strictly alright. I think I got caught up in the ","useful":0,"cool":0},"SvAjCymUnBZDeattXR930w":{"text":"We ended up going to Green Goddess, which turned out to be a good choice. The restaurant u","useful":1,"cool":1},"ah3cLrtuW9nEGTjpvQnpAw":{"text":"We arrived @ 11am to only to be told that that restaurant is closed !!!!\n\nPoor customer se","useful":3,"cool":0},"a-rdIy5KTcHhQKSpnt_NJg":{"text":"Great food, service and selection of drinks!  They even gave me shopping advice that I hop","useful":0,"cool":0},"0aQpVGM5AeQeTSsNFckg3A":{"text":"Honesty is my policy on yelp so I need to start off this review by letting you know that I","useful":1,"cool":1},"xV-cWg4G5RBvQfoYC1lE0g":{"text":"Good variety of vegan and gluten free options. They also have a handful of dishes that inc","useful":2,"cool":0},"ealnJeBnxnFfMSkKLhy7ZA":{"text":"My family has food allergies and is very, very limited on where we can eat. Green Goddess ","useful":0,"cool":0},"UPuWy2aNxMnIHHBNjYQulw":{"text":"Funky food and drinks in a cute garden cafe? Yes please. Drunk/high waiter who omits speci","useful":0,"cool":0},"iT1T7nCgA5RkDfvkATs3Ag":{"text":"Green Goddess wins major points because we walked in right at closing time (we thought it ","useful":0,"cool":1},"_uDPjPHQTghkUmk5H2a4QA":{"text":"Good food in a really nice location - tucked away down a side street. We were greeted righ","useful":0,"cool":0},"Ld_NQWnZLy2R4ak-zfIvzg":{"text":"Full disclosure.  There aren't many vegetarian places in New Orleans and this had a lot of","useful":1,"cool":0},"S4lIsV3QsG1Khxa65RYUUw":{"text":"Overwhelmingly and wonderfully delicious and unique. What a find. \n\nI might as well have b","useful":1,"cool":1},"MFVCTaBIapOr6tgkbefCxQ":{"text":"After searching through dozens of menus to find a vegetarian option for lunch I finally ca","useful":0,"cool":0},"F6KLA4yLy_rtA6Gp-BWUBA":{"text":"I would certainly think twice before going to Green Goddess. On my recent trip to New Orle","useful":4,"cool":0},"zK8VRE9fW_PhnvOiQZTfkQ":{"text":"I am craving this food as we speak.  We had brunch here and it was delicious.  The food is","useful":0,"cool":0},"Xej3RvHEtxbqp6__3pofdw":{"text":"I want to love this place, because it's such a safe haven from the Quarter madness and it'","useful":0,"cool":0},"LfNcAaS4aUn1vUefDXuS0Q":{"text":"I literally moaned with every bite. Had the fresh catch and chocolate biscuit... Sooooo go","useful":0,"cool":0},"yZt4y0z5SYHLkBQm5r17-w":{"text":"This place is so amazing! It's in a great location, right across the street from an art ga","useful":1,"cool":1},"yW_Bn4XDc9DryGHtZAclMw":{"text":"The food at the Green Goddess is fantastic. I had the duck with drunken noodles. It was th","useful":0,"cool":0},"1PlGbvSl2r6BlC87_eD84w":{"text":"I love this place!! I came here for my birthday in early November and the food was amazing","useful":1,"cool":0},"pUg3hcmKthfZeUeALnkp_g":{"text":"In good weather, the outdoor ambience was just what I needed to unwind from a stressful co","useful":0,"cool":0},"Dce85gkpym4so7mBhDZODQ":{"text":"They have many vegetarian/vegan options on there menu and my friends said the were excelle","useful":0,"cool":0},"RmvTfHEHj8a9BoQRBrJIWw":{"text":"Our first full meal in New Orleans and we decide to go Green... and I left feeling the hea","useful":6,"cool":1},"FW9C54zsEtHn9a3skl2p4w":{"text":"Very cute little off-the-beaten-path restaurant.  I had a lovely salad with fruit and blue","useful":1,"cool":0},"1VYy8HboLF5DpRYzfqV7kg":{"text":"Lunch here was so good. I was pleasantly surprised to find a veg restaurant in NOLA--espec","useful":0,"cool":0},"rSyllTPfsw_cv5rwdOnGaw":{"text":"Assholes. Grumpy. Mean. We walked out before we ordered after the jackass waiter gave my h","useful":0,"cool":0},"vbmVRzut11Sl4VJUx2_J7w":{"text":"Great food and a much needed break from the standard Creole cuisine. Great salads loaded w","useful":0,"cool":0},"OkHzRBOceCbR-VEkGNgC0Q":{"text":"Went there for lunch twice with my wife during our wedding anniversary trip to new orleans","useful":0,"cool":0},"o1v-o2ap9cAtwxcCNMUn4w":{"text":"I went to this restaurant as a last minute decision after GW finz was too busy. My stomach","useful":0,"cool":0},"RePgzSeexRQ73YH3hob5Yg":{"text":"Great place for vegetarians. We had the patatas bravas, which were not the usual format bu","useful":2,"cool":1},"VNUEQiz21eT3g7wZ1vEjxQ":{"text":"If I could rate this place a zero I would. For starters, this isn't a place for those with","useful":1,"cool":0},"HCR4WnNOXj2yTAZb8safDw":{"text":"There is always a fine line.. Between thinking out of the box and being downright insolent","useful":11,"cool":5},"-uZGnMXMZbd0hujgCouiFA":{"text":"I went to the Green Goddess just looking for some semi-healthy food after a day of eating ","useful":0,"cool":0},"zyZYjQUYlxcEar5n06vKAg":{"text":"What  a refreshing change from the overpriced touristy food of the rest of the French Quar","useful":2,"cool":1},"WpdY0P26fxnavu1fohN8HA":{"text":"Decided to come here for lunch after reading all the great reviews.  There was a little bi","useful":0,"cool":0},"kr4fT7c9svqQ6xC2l2VvhA":{"text":"We chanced upon this small gem while searching for a close by vegetarian restaurant near w","useful":0,"cool":0},"0FetcHV4fLY3L1TuZ5345A":{"text":"Great to find a vegan friendly restaurant in the French quarter. Portions are small for th","useful":0,"cool":0},"ftxn7L_o8r1dDrZNrxfw7g":{"text":"We have been traveling for over 2,500 miles (from CA). The food on the trip has ranged fro","useful":0,"cool":0},"kMKoDpVXo9in5P_aBrw3nA":{"text":"We loved our dinner so much that we booked New Years at the goddess. Perfectly funky resta","useful":0,"cool":1},"U-s959eBcfMk_7GGKse_yg":{"text":"If you don't take the time to eat at Green Goddess while you're in New Orleans, you're let","useful":4,"cool":2},"ukwWkybYEMMQyxD4gYu5BQ":{"text":"Well Paul, \nI finally made it down there.  Was not disappointed, had to fight for the bill","useful":1,"cool":0},"hNsdnKDH6o3CPxGYW23jgg":{"text":"Super slow service. Bland food. Will not return.  I know this place was great at one time,","useful":0,"cool":0},"rtF18hs8l6PfjE31yZ_VxA":{"text":"Everything was super delicious. Best meal we had in NoLa.\nGarlic toast was excellent, the ","useful":0,"cool":1},"-FHYEn7RGt1-6UygwJHJCg":{"text":"I had the Cuban Luau with kale salad. It exceeded my expectations and then some. Followed ","useful":0,"cool":1},"3P-rw45a80hvzo233PQ-eQ":{"text":"Delicious food and very creative use of ingredients from the standpoint of combinations as","useful":0,"cool":0},"TkRHgRx3EwzngKS3BxYcWg":{"text":"The food is good and well done. One of the few places in New Orleans where you can expect ","useful":0,"cool":0},"KlKC-8exd2iD9xACj4gOlw":{"text":"Good food, good service BUT NO &\"$@/ COFFEE IF YOU'RE VEGAN!!!!  There is nothing that irr","useful":0,"cool":0},"4HhbMFy-UYxXJGsjyaTRAQ":{"text":"LOVE this place! We've taken two sets of out-of-town guests here because we were looking f","useful":1,"cool":1},"TT5Aue-khObMeEmpX1ZtZQ":{"text":"This is a hidden gem in French Quarter.  The menu is vegetarian friendly, but for carnivor","useful":0,"cool":0},"8ylI_KEsfXJFC5IuNIxzwg":{"text":"Had the tofu hash recommended by my server and the falafel sandwich! It was the most amazi","useful":0,"cool":0},"tPhrZCjRC0nnlpHTmE_iIA":{"text":"I should've known to run from this place as soon as we showed up and the waitress rolled h","useful":1,"cool":0},"tnMIyFGoSp1A3Hi7DWOBTw":{"text":"Menu yesterday The food and seafood specials are amazing!! Some pics are from my view al f","useful":2,"cool":3},"HfZRlnCyhravGNSUVpXLiw":{"text":"HHHHHOOOMMMy god. I ate everyday.\nLicked the plate clean. \nSuper dope location and the own","useful":1,"cool":1},"6Kq97R6dYzRFHDzlQ9mcSw":{"text":"As a vegetarian living in New Orleans, I was excited to try this restaurant for dinner one","useful":1,"cool":0},"g8esdVd_iQRXtTXab99HFw":{"text":"NOMS. Sweet potato biscuits so delicious (as an aside I do not recommend carrying one in y","useful":0,"cool":0},"PQWe7os9IG1-yoc9xxeKnA":{"text":"Great little restaurant with outdoor seating and healthy menu selections, an hospitable is","useful":1,"cool":1},"JdwCHW6qahtbrMFAsQzUXw":{"text":"Yum yum yum! The reviews are real guys, this place really is incredible! It was my favorit","useful":0,"cool":0},"5t4krHpnHnAj3KHCarP-nA":{"text":"I had the daily special (crawfish cakes) for dinner and while it tasted fine, I got food p","useful":0,"cool":0},"tYLCoyWM4HHXTSPRYU3A8Q":{"text":"I am sort of a foodie... and a healthy foodie at that.  On our trip to the French Quarter ","useful":0,"cool":0},"QoO2Ymb-4MTksnEHyayfLw":{"text":"I've experienced better, and at this restaurant. We eat here often. And I love the food. B","useful":0,"cool":0},"EoJ1dOuD7uAins6B5XB6MQ":{"text":"Quirky vegetarian-friendly hole-in-the-wall with great food. Located on an alley in the Fr","useful":2,"cool":0},"CDqtzEcD5zJUMkToXALVfQ":{"text":"I took my Mom to Green Goddess in September when she came to New Orleans for a visit. We b","useful":2,"cool":2},"k2xaQDRiKwJWyWpXwVkbCA":{"text":"We were really happy to find good vegetarian food in the area. There are plenty of veggie ","useful":0,"cool":0},"FlYwbl1Yh413aDEDcg756A":{"text":"Good ambience with an outdoor seating. One of the few restaurants which has a lot of vegan","useful":0,"cool":0},"4t0J8Q8rZZd5_kXTZZ8WDg":{"text":"Absolutely delicous, fresh, high quality meals in the French Quarter. The Green Goddess is","useful":0,"cool":0},"TnGpDgVmVw9nrMcM6MGDjw":{"text":"Green Goddess is an absolutely delight! I loved sitting in an alley on a warm spring night","useful":1,"cool":0},"eh-JdDVY0m8d-sTe06au3w":{"text":"This is not a vegetarian or vegan restaurant but it has some great options for those glute","useful":0,"cool":0},"nDhANOR0OU4NxuuRPMMveQ":{"text":"I just tried calling Green Goddess to offer them an incredible opportunity. A man answered","useful":0,"cool":0},"sVUCHDLJWA5sDSrtHZr0Xw":{"text":"A food oasis in the French Quarter, healthy and tasty food and nice outdoor seating. Chef ","useful":0,"cool":0},"87GzFuArIWdAURLSmP1EmQ":{"text":"The Green Goddess is a tiny place that was recommended to us by our local friends. It's in","useful":0,"cool":0},"NB_oY6cJO9c0-FXq-Y9Qhw":{"text":"My favorite restaurant in New Orleans. The menu is delicious from top to bottom and has ma","useful":0,"cool":0},"N8KChTkuIw49tbQFeRzMvw":{"text":"Totally unclean. The food was cold and there was no way these guys could stay clean with t","useful":1,"cool":0},"BCB9DfqnEy8TfhjZ0pQpXw":{"text":"Not bad, not great.\n\nTake a look at all the reviews. While it has a good number of 5 star ","useful":9,"cool":3},"RtMkIjQH2w5kLT_5RCnimQ":{"text":"Great place!  Good food, good service, & cute atmosphere. 100% al fresco dining off the be","useful":0,"cool":0},"99qsqIlyKFjxof-J_P3org":{"text":"Phenomenal - fantastic vegetarian/vegan options, super adventurous drink creations, and a ","useful":1,"cool":0},"Hx3WW9zHd0jSwOlyEGqT9Q":{"text":"We had to wait awhile (Friday night, only one side of the alley street is Green Goddess ta","useful":2,"cool":0},"a2JYp4ti5CENsIXIGMIr6A":{"text":"Good food, decent prices for gourmet tapas style food and just a good good time. Also thei","useful":0,"cool":1},"3TGaYW3C5G5O8g9dW2ny7w":{"text":"We ate here during our Christmas visit to NOLA as an accommodation to my vegetarian daught","useful":0,"cool":0},"26EA4qoJmEyX1kS8Z8tOrA":{"text":"Such a great option for people with friends of vegans who would like their friends to eat ","useful":1,"cool":0},"S-YFgZJCNBspxZsHF9-H0g":{"text":"THIS IS REVIEW IS ABOUT CUSTOMER SERVICE \n\nI am walking away from this establishment as I ","useful":3,"cool":0},"lB2S9KUKdIQrF1PfcNZr_A":{"text":"One of my favorite places for lunch. Their menu is great with lot of healthy options. \nI l","useful":0,"cool":0},"vNUMQAAaoyKN_0J142f6vw":{"text":"We stopped by this place for lunch and had no wait time. The food was okay not the best bu","useful":0,"cool":0},"p0CYvMgmfSqZXJGYpFC_1Q":{"text":"I used to come here several years ago and I remember it being good but not THIS good. I wa","useful":0,"cool":0},"IxQu0ZgDao79D_WsPNrtuA":{"text":"So flipping hot in there! Too much dressing for my taste but had good veggies in it. Cute ","useful":2,"cool":1},"div-vxu9Xwp24Nke2-ox8Q":{"text":"I came here in September 2019 with my two non-vegan eating friends. The restaurant was clo","useful":0,"cool":0},"M55GylTu3Ty04KS25LMd8A":{"text":"Excellent food at Green Goddess! Vegetarian friendly comfort food. The sweet potato biscui","useful":0,"cool":0},"kam3MBl0IHmW-8sR-dzE1Q":{"text":"The Green Goddess was a lovely little brunch place I found whiles visiting NOLA. Loved the","useful":0,"cool":0},"6NNgvA8Q1gY7TL2r3MNFpw":{"text":"The cutest hole in the wall. I was visiting NoLa for the weekend and just could not do ano","useful":1,"cool":1},"tUtVhITH2inbM99klhQ3vQ":{"text":"Nifty menu + quiet street in the French Quarter + outdoor seating + best cocktails I had i","useful":1,"cool":0},"9jx_2FQ6ZpCP2wQ8t0QwoA":{"text":"Wow... if you are vegan, vegetarian, or gluten free AF, this is your New Orleans. My wife ","useful":3,"cool":3},"nNt30uYHgiALPkAvm4ftEA":{"text":"It was okay but not great. I got the Beet Burrata Kale salad and the only good part of the","useful":1,"cool":0},"7nzJ1N20PglPuHD5RcTfMQ":{"text":"We were pretty tired of the usual creole restaurants that we needed something out of the o","useful":1,"cool":1},"4wJ1mg-EA4NesMv46RUTjQ":{"text":"Best food i had in New Orleans. Great location, staff, and drinks.\n On my vacation i actua","useful":0,"cool":2},"TKerX6XpCLfwjMefG0q6Ew":{"text":"This is my second time here... First time was several years back for breakfast....\n\nMost r","useful":1,"cool":1},"7hzYYp5apzskEsi0zDle1g":{"text":"In a word, AMAZING. One of the best meals that either of us has ever had. This is what foo","useful":1,"cool":0},"fY4NXPE36xyXa8lrHFRQQQ":{"text":"Dishes served different than menu...\nGreen Goddess wedge salad came w/o heart of palm as w","useful":0,"cool":0},"uAgqDo118qZh3uhL684u6Q":{"text":"Went here for lunch.  They have a few vegetarian options, certainly more than other places","useful":1,"cool":1},"DALRrHnNtB3RWsfB2p9Z9g":{"text":"OhMyGodOhMyGodOhMyGod \nThis is my new favorite place in New Orleans. \nWe were hoping for g","useful":2,"cool":1},"GzCrCTIXWWjA32QphKXjmQ":{"text":"Here's a tip: if you enjoy pretty good food, nice craft cocktails & REALLY bad service, st","useful":1,"cool":0},"C8ATbykDaA3JvrS18rT9cg":{"text":"any restaurant that has a liquor menu more extensive than the food menu is a-ok in my book","useful":0,"cool":0},"12CKK2XpKKZ58y_sM05Jww":{"text":"I love the atmosphere here and the food is always amazing and creative. Cone here if you w","useful":1,"cool":1},"FaMVw6WHVPJybY9g2vwWuQ":{"text":"The food was fine but the service was horrific. Both the waiter and waitress were awful to","useful":0,"cool":0},"AMHpGqcRPRhGTaUwZPwFfQ":{"text":"So let me just disclaim, that this review reflects a dining experience I had at Green Godd","useful":1,"cool":0},"QRwWVvcqThbry6o0EK6dKA":{"text":"Vegans and GF diners this is IT.  Finding food in NOLA is definitely a struggle if you don","useful":0,"cool":0},"b03nQ-BGH356TRWC1nOtIA":{"text":"This is a hole in the wall, but it is AMAZING.  It's not the fanciest, the biggest, or res","useful":1,"cool":1},"czHoJ44EzRNtapN84FhvbQ":{"text":"This turned out to be a very pleasant surprise. We were in the mood for some soup so I did","useful":0,"cool":0},"CWuQs8zy1RJG3b7uT5LQIA":{"text":"I'm so frustrated that I can't rate them higher!\n\nI've eaten here a few times and enjoyed ","useful":1,"cool":0},"6_Vwh6Mu0Ers_kyxgQ8eDA":{"text":"I am a poor student and a foodie, and as a poor student I was pretty reluctant to go to a ","useful":1,"cool":0},"jEv6aV5OJv8RPaRSQTcZ8Q":{"text":"As a vegetarian, I was thrilled to simply happen upon the Green Goddess when visiting New ","useful":0,"cool":0},"DOzc5LO2B4IWIyeGfXrfPw":{"text":"Always a treat. Service can be obnoxiously negligent at times, but the food is always grea","useful":1,"cool":0},"-57PbCfvWUj3uX-dEqLYwg":{"text":"Well with New Orleans being in a place of seafood,  for fried food and things smothered in","useful":0,"cool":0},"otFUkchtu3C2SQaJKw-1Iw":{"text":"This place is awesome! I am plant based (think vegan) and have eaten dinner and lunch ther","useful":0,"cool":0},"LUfpD4r9EuicKuAtEgAdhg":{"text":"I loved that this place is in a kind of hidden street. We chose this place for dinner base","useful":2,"cool":1},"BwNGJj93-AuW0AirOTwekQ":{"text":"The chefs might be hangover when preparing for our food. We got the watermelon, beets & ka","useful":0,"cool":0},"ZtTZ4uhKkHo0akHTz9T4fg":{"text":"Very nice location on a charming street.  Our server didn't seem to like being there. It w","useful":1,"cool":0},"DX8JqghaToEqprGPZpvPgg":{"text":"Many people told me to check out Green Goddess as a veggie friendly healthy option in the ","useful":3,"cool":3},"fsbQvHVT_fsO4t-7o_pbpw":{"text":"Excellent for omnivores and their vegan or vegetarian friends. My husband had the Cuban po","useful":0,"cool":0},"x-nPSrsCsMsAUDkMp2R22A":{"text":"Food is definitely not 4 star. I come from Bay Area and vegan/ vegetarian food is so much ","useful":1,"cool":0},"JXlEFgTvZyJxKZNHRzJAuA":{"text":"Wow, ok so we stopped in New Orleans for a night and my awesome wife found this place just","useful":2,"cool":0},"MWlbaBcMNttpAt1UQqF6rQ":{"text":"Different selection of vegetarian and gluten free food with.an interesting eclectic food s","useful":0,"cool":0},"7Hl92d7TlA76TE0PwrZRtg":{"text":"It was New Year's Day, and after a night of listening to some wonderful Jazz on Frenchmen ","useful":3,"cool":2},"NwU343shdk-yLdfDadKqvA":{"text":"We're plant-based (vegan) so we had the beet hummus, soup of the day (garlic soup) and mus","useful":0,"cool":0},"3P5n_T3pEa19oKn3KOwyfw":{"text":"This little place has some food options that are different from much of the French Quarter","useful":0,"cool":0},"MId8eO-1Xjzhtz_PZHmp8Q":{"text":"We ate outside which was very pleasant and the food tasted good so I'm giving two stars.  ","useful":0,"cool":0},"TQ_kzN9JqelTtwCHnExhMQ":{"text":"There are few places in the French Quarter where you can get delicious vegetarian options.","useful":0,"cool":1},"BR5TvKV5-nL44MFTDeAXlg":{"text":"I heard about the Green Goddess before going on vacation to New Orleans when I yelped veg ","useful":0,"cool":0},"amGmKHTXiLW1Vo7WiuSEsg":{"text":"I really wanted to like this place. With the amount of times we have walked past and not v","useful":2,"cool":0},"i8Fl1-MJgm0zTq8p2seTaw":{"text":"Terrible service. We sat for nearly an hour after ordering. After asking about the status ","useful":0,"cool":0},"0n3ZeBSSAg36HU5sTJOWtQ":{"text":"Kind of slow service, but it was definitely well worth the wait (place was crowded-and for","useful":0,"cool":0},"dIlshwcdgqJNBr5epsiInQ":{"text":"The French toast stuffed with fig and chevre is delicious. I'm vegetarian and can't eat th","useful":1,"cool":0},"zuGuBKa-6UfcS-PtszTEyA":{"text":"Awesomest place.. good food and friendly staff.. service was really very fast.. i liked th","useful":2,"cool":0},"JfXrWKJHV2mvC7qpjB5pTw":{"text":"This review is based on customer service. \nPoor poor poor. Downright rude.\nHad to beg for ","useful":1,"cool":0},"TnYcYlj1UrAdE-hFc19wsw":{"text":"Charming outdoor cafe with healthy options.  Table service provided which was a plus and t","useful":0,"cool":0},"u2UyRxyBxsvFycfsKZ5WDw":{"text":"A lovely little spot if the weather is right. Service is spotty, food is great ideas imper","useful":0,"cool":0},"kmcE_-xZmZpTWOdVMusC-Q":{"text":"Wonderful food! Creative and fun to look at as well as eat. The wait staff was friendly an","useful":0,"cool":0},"bzJSu33vBR8nJ7ThY9b_xw":{"text":"I would come back to New Orleans just to eat here.  Food was incredible!  Cozy ambience (i","useful":0,"cool":0},"dsKl46DKBZEYhzW9Bq6yfg":{"text":"The Green Goddess is a farm-to-table kind of place with great vegetables and locally sourc","useful":0,"cool":0},"P8r7LPiIh7Ach5nFbLLG7w":{"text":"Me and my husband are vegetarian and found this as one of the few restaurants in the area ","useful":1,"cool":0},"0bhhJiiuc8FerQa_Zs1WmQ":{"text":"This was our very favorite lunch spot, we ate here every single day, for a week. We never ","useful":0,"cool":0},"NTTwUvoVUpkK0vOSpEy9RA":{"text":"We were seated by an employee and then another employee told us to get up cus there was a ","useful":0,"cool":0},"9GsprW7ujVH7Gg3Q1UsKUw":{"text":"The cure from all fried food but a New Orleans experience none the less. Chef Paul and com","useful":0,"cool":0},"h7mmdSaNcjRaYqUcx-5IXA":{"text":"Before we made our recent trip to New Orleans for a long weekend, I checked Yelp for vegan","useful":3,"cool":4},"3y6SlzIub97l0aqCyLV-iQ":{"text":"Last night, I had an excellent dinner at the Green Goddess. Our party of six sat at a smal","useful":2,"cool":2},"jx2ldht6RjOSIxHauLP2jw":{"text":"Tomas is awesome.... Oh and the food was excellent! What's good food with terrible service","useful":0,"cool":0},"9pvB5z_bEthj3DUIRHsYAQ":{"text":"Love this place. Great service and great food. Nice place to sit and relax.  I love the be","useful":0,"cool":0},"Kj-4GMaq79oAOCqE2OaE1w":{"text":"For now, I'm leaving my rating as is BUT that's subject to change because I want to try it","useful":0,"cool":0},"jzEpMSr_LFtterOM7L2aIw":{"text":"OMFG Cajun Bloody Mary and their French toast- A winning combination! Great menu!","useful":1,"cool":1},"U2wLw2IYpihM0XBjKlWUbg":{"text":"Some of the best vegan food in New Orleans! My boyfriend and I tried vegan food from at le","useful":0,"cool":0},"FoQDsVrD0UVODyVrIwWjXg":{"text":"Friendly servers and staff, good food and good cocktails! If you're looking for a \"healthi","useful":1,"cool":0},"g4exMz1frrOYLP0GjI-zOg":{"text":"All outdoor seating in a beautiful alley with lovely twinkling lights and candles. Ambienc","useful":0,"cool":0},"RhWf067_7bYXUHHaWSeyvA":{"text":"Food was good. But, customer service was bad.  Not greeted well.  Also was told that credi","useful":0,"cool":0},"4mQd7bALoWcBcck4cPIGXw":{"text":"GROSS. I have never written a review for a restaurant before but this restaurant is worthy","useful":0,"cool":0},"HdceZZYLnCsehZu44BZeQA":{"text":"This place is set on a quaint little side street that reminded me so much of a typical squ","useful":0,"cool":0},"kCkW446Zf3KGdRgChfCYnQ":{"text":"Came here for dinner because we wanted to try something different and healthy in New Orlea","useful":0,"cool":0},"8ReUyeaqVsOWfORq86DjLg":{"text":"My only complaint is the hours, and I'm only complaining because we found it on Sunday nig","useful":0,"cool":1},"sxRTjhCyHOPxyVIIlGKtJw":{"text":"Food quality has gone down significantly in the past few years. I ordered the beet hummus ","useful":0,"cool":0},"HKiYsVxISHu-h870PRdI4g":{"text":"Not a fan, slow service, food is mediocre at best, even though it was cold by the time I g","useful":0,"cool":0},"3hgDAyveZC3XztBkcox5Pw":{"text":"If you wish to dine on food that pushes the outside of the envelope and is not typical New","useful":1,"cool":1},"YfJO3vCPtyd6W-SgHruflA":{"text":"We agree with one of the other reviews here - once you eat a grilled cheese at the Green G","useful":0,"cool":1},"kgFye8nPUYnjY1FqaaKzVA":{"text":"If you had to pick one restaurant in all of New Orleans that will make your whole trip wor","useful":2,"cool":1},"vp9kagzL-muM8CRLxQqUtA":{"text":"Stop looking and just eat here!!!! Great for vegetarian and vegans. \nOnly in new orleans t","useful":0,"cool":1},"QNkksUtcHlHeXuIjdzJidA":{"text":"I had the rolled uttapam and my friend had the red-eye grits and gravy. We were looking fo","useful":0,"cool":0},"Fnb7dGEvefuAM7Rt7IuRRg":{"text":"This place is a hidden gem!! It is a short menu but very well balanced.  It has Gf/Vegan/V","useful":1,"cool":0},"_TPKsq4sLTh_yiWrKJ3e8w":{"text":"Roasted garlic soup and an excellent glass of rose' on a gray November afternoon.","useful":0,"cool":0},"FNd5WJX4uNy9it2bfzkokA":{"text":"We were looking for a place with vegetarian options and this came up. It's in a beautiful ","useful":1,"cool":0},"Hsezprp_tT9KLVp6Va18bg":{"text":"A definitely valuable French Quarter find! Tucked in the inner alleyways of NoLA, this eat","useful":1,"cool":0},"0tjb4dGkzSFiVYTpdPpVsQ":{"text":"If it weren't for the server, this place would get 5 stars. The food choices are extremely","useful":0,"cool":0},"PXOPpLlD4NxQXX9E4Me5tA":{"text":"After looking at the menu online, I had to check this place out. The name makes it sound l","useful":1,"cool":0},"8CnFJlErwaXkLIVKx0P2Sg":{"text":"Yummy.  Outside.  The outside traffic coming by serves as great entertainment.   Great loc","useful":0,"cool":0},"_MQSyJdRbQ-HtPgU3AsVEQ":{"text":"So, a couple of months ago some friends of mine came into town to visit me, and one of the","useful":0,"cool":0},"5fiD5bi12yV1VlSVYn1RPw":{"text":"Great atmosphere and fresh flavorful food. Off the road in a little pedestrian street so i","useful":0,"cool":0},"cKzk_zhXwiU9s73RDWtIDw":{"text":"Starter salad: Buratta Watermelon Salad and a white wine for a late lunch on a warm August","useful":1,"cool":1},"FmcwCjHnhPO75yZDKMjyYg":{"text":"When people think of New Orleans cuisine, they typically envision hearty, Cajun dishes - g","useful":1,"cool":3},"KdbG3-R9fQpJCZ46oVYsbw":{"text":"So, I really liked my tofu poboy, and my friend enjoyed her Green Goddess half salad. The ","useful":2,"cool":1},"rBdayhfvCYPRN06q7ArG9w":{"text":"I go to New Orleans quite regularly and when this establishment first opened it was quite ","useful":0,"cool":0},"SgkWlt3VhVYV_0t_FAWwXw":{"text":"Excellent salad and duck sausage. Stumbled upon looking for something healthy to start my ","useful":0,"cool":0},"_-JpeiW101hddVafSrA5sg":{"text":"Arguably the worst service I've ever had. The waitress couldn't have been more rude if she","useful":1,"cool":0},"s5jVKPRQZezPD0TRNentDA":{"text":"The restaurant is located in an alley with a faded street sign that won't tell you where y","useful":1,"cool":2},"FJbkuTN-Y6BrFG61dkU1OA":{"text":"The food was awesome. Fresh and flavorful with lots of vegetarian options. The service was","useful":1,"cool":0},"EPNK8kIJwWNuctaM82ajjw":{"text":"This place was really yummy! There is inside and outside seating. Good vegetarian options ","useful":1,"cool":0},"Xaz9IR5s2Xl5b4JjCXHqjQ":{"text":"I went to this restaurant with Shirley F., and being a fan of sour food, I actually liked ","useful":2,"cool":1},"jm68Kr7KTOkCQVvHTXyj1w":{"text":"Very tasty vegan options. I had the Thai Tofu and vegan pate. Outside seating only so just","useful":0,"cool":0},"QBPh8e4omkWb5NhhhXJoAA":{"text":"i would have given this place 5 stars because the food is fabulous and the outdoor seating","useful":0,"cool":0},"r8q1GgyTMEf0niNYHJug4g":{"text":"This is hands down the best restaurant in its price range in the city.  I come here often ","useful":0,"cool":0},"TgDr2unbYJfN-p9nExeGaw":{"text":"I went to Green Goddess based on recommendations of Yelp. Was very displeased with the ser","useful":1,"cool":0},"C-v1TdEOcC54IXZJTzku9Q":{"text":"Apple and cheddar French toast was amazing. Fresh green apple cooked to perfection,  this ","useful":0,"cool":0},"CNHQE8qgJztO1YFElFlWkg":{"text":"Drinks were great but the food was nothing I would come back for.  We went because of the ","useful":0,"cool":0},"RmfW-Jg06fbydWJTKq8nJA":{"text":"If you get a seat outside, consider yourself lucky. \n\nI had a very unenjoyable meal inside","useful":2,"cool":0},"vv4aqacyjaBu6LUop3G8OA":{"text":"Great dinner experience. The area is charming, staff is fun and food is creative and delic","useful":0,"cool":0},"Xc9LvU1Hr4FUDIa11rG7_w":{"text":"The best breakfast of our trip! Everything was well thought out. I had the biscuits & grit","useful":0,"cool":0},"e1F-zs0lxNlec4YLNY9VzQ":{"text":"Great vegan options! A little pricey for the amount served. But we did enjoy what we order","useful":0,"cool":0},"4l_oWbZqUkAxB1ysJcTnWA":{"text":"I poked around Yelp for a place that was rated high for dinner, yet also something that wo","useful":0,"cool":0},"rbiZ-3l0G9S0mi6eXQz4rg":{"text":"Went here earlier this week on a trip to NOLA. Tiny place with an indoor-outdoor setup and","useful":0,"cool":0},"LV6I-6itBEVSUuhI-SZv3A":{"text":"A large group of friends and I went here for lunch - service was great even though they we","useful":1,"cool":0},"v-g5Ding-cBAfCgjDhZTlg":{"text":"One of my favorite meals in NOLA. Just delicious, hearty, hits-the-spot-good kind of food.","useful":2,"cool":1},"79bJja5myJDtIk5xtafLkQ":{"text":"Menu selection was not upto par with the online menu. We had drinks and and appetizer. It ","useful":0,"cool":0},"yH9ACiSWIuZ-OjRkljc_7Q":{"text":"Ahhhmmmaaaazzziinnngggg!!! Ordered a bunch of items to share and not a single bad thing! C","useful":0,"cool":0},"XJLtvr367b6uGXO_-LC9BA":{"text":"For everyone that has written reviews of this place and calls it \"Creative\" I would really","useful":5,"cool":0},"GUTQB9VenyOC0lyVNS_iIw":{"text":"We ate a lot of great food in New Orleans and enjoyed all the classic dishes. Then we came","useful":0,"cool":0},"0HPtkf3ndT1LXI5RWS_LnQ":{"text":"One of the best meals of my life was had here. Sweet Potato Biscuit & Wild Mushroom Gravy,","useful":1,"cool":1},"ewcFcIOyY2_GHX4jmg4f6A":{"text":"Excellent variety of meat, vegetarian, and vegan options.  I've been here twice and all of","useful":0,"cool":0},"QdN8Ae_qkRN7PnNTaRVj6w":{"text":"A Very neat and delicious unexpected find! I Wish we found it sooner on our vacation, so w","useful":0,"cool":0},"KRuuhOmFkOAai4A8DeAvaA":{"text":"Wonderful outdoor setting, away from traffic and noise.  The service was great and the qua","useful":0,"cool":0},"dztTjIxsbJ4_YUbU2-30bA":{"text":"Of all the places we ate in New Orleans a few weeks back this was by far the best one.  In","useful":1,"cool":1},"j7HiLthW_DgyRyaqkIa68w":{"text":"Worst customer service I've EVER received. After finding a hair in our food, receiving no ","useful":0,"cool":0},"XYtuDzSJqGfPawwiil31Zg":{"text":"A lot of good things have already been said about this place so I will keep this simple --","useful":0,"cool":1},"7VD-F00zhiIG3PH93CeGUA":{"text":"Creative menu, drinks.  Tiny but cozy space.  In the middle of the French Quarter, but in ","useful":0,"cool":0},"ZmGGEMKqPhBdvBmE7iUKjw":{"text":"In a city jam packed with great culinary experiences, it takes something special to stand ","useful":1,"cool":0},"-ObvV5B1GkwNFrR4QrEfOg":{"text":"I really love this place! The place was absolutely delicious and had a ton of vegetarian o","useful":0,"cool":0},"aX-ikRArfvmG6lfIYQ8NTA":{"text":"The Green Goddess definitely is \"as good as it gets\"!\n\nA wonderfully creative menu, talent","useful":0,"cool":0},"_muKNBKCXcLy35Dzk3_4VQ":{"text":"Every time I come to the big easy I stop by here for a least once, usually once for breakf","useful":0,"cool":0},"6zr-gUEHEQfwTbfI_IGrWw":{"text":"Major props to Green Goddess for offering veggie options in the ever-anti-veggie NOLA.\n\nCa","useful":17,"cool":15},"Ep2xhT3D4F0VeJ2QKWt0Cw":{"text":"I would give 6 stars if I could, simply because the food was outstanding. Wonderfully tast","useful":0,"cool":0},"dB2SjtkgcE7_5Nhph7Txug":{"text":"Cute little place, food was just okay, nothing out of the ordinary, especially for NOLA.  ","useful":0,"cool":0},"8KFHpUiIVwQ8rdx8rBRK6w":{"text":"I got the green goddess salad and i believe south indian pancake.\n\nI stopped by around 2 t","useful":2,"cool":2},"jTZNJAuqa4q8ci5bLzUggg":{"text":"Green Goddess deserves a thumbs up! The wait staff was friendly and prompt, the food was d","useful":0,"cool":0},"J5pknszKD0OTziYR71c7Jg":{"text":"Having found the place by searching for veg options, we were a bit concerned when initiall","useful":0,"cool":0},"gULQ8nceR1Wplg1vXRRvnw":{"text":"Love their food. It was a hot day so I get an apricot beer which I loved! \nI went here wit","useful":0,"cool":0},"wHz_yxtYV-WW2pgCh6bNRA":{"text":"Sweet potato biscuits are on point.  Vegi cuban luau was pretty good but it seemed like th","useful":0,"cool":0},"uxQZP0T6dugwCABUL-IlDA":{"text":"This was our first stop in NOLA, and my husband and I loved it so much we went back anothe","useful":2,"cool":0},"D17sogdbW5CenH_OXYafsQ":{"text":"I wouldn't go out of my way for it, but it was a perfectly tasty spot to stop at if you're","useful":0,"cool":0},"pPkBA1vnrqwKSVx-rRsyWA":{"text":"Hmph. I just don't understand the hype around this place. A recommendation from a friend l","useful":9,"cool":5},"qYSfAi9VmCf-fyRXaR6RTw":{"text":"Stopped in New Orleans on a road trip and found Green Goddess while looking for something ","useful":0,"cool":0},"Y-if46an4PTICG7-8SdtEQ":{"text":"Finally caught this little restaurant when it was open last night. The seating is all outs","useful":0,"cool":0},"lQ_su8CtpcT4HnOKatNaTg":{"text":"Much fewer vegetarian dishes than I expected but what I had was really good - savory lenti","useful":0,"cool":0},"Y3QnYMx2ypm-U-Yh-gzjIg":{"text":"This is a great restaurant! I do not think they market themselves as solely a vegetarian r","useful":0,"cool":0},"oyrY5u8qo4WXxadByDPJ8w":{"text":"Very cute little outdoor cafe with colorful wicker seating in an alleyway courtyard type a","useful":0,"cool":1},"p0YWavjIJyWqw5olV_d2xQ":{"text":"It was day three of a five day work trip in the Big Easy when we finally stumbled across t","useful":1,"cool":0},"CtJV_MrC4panhov_J6oBNA":{"text":"Amazing, hands down one of the best restaurants in New Orleans. I'm impressed every time I","useful":1,"cool":1},"zGNSWEVCrY_slZjurRGosQ":{"text":"If you are vegetarian and staying near the French quarter, this is the place. Delicious fo","useful":0,"cool":0},"IakQsj9l8c1n2o3f3cn5zg":{"text":"They were nice enough to accommodate us having a to go order.  \nBut. The guy with the ring","useful":0,"cool":0},"AfyFqDcM1SsWE_GfbDl26Q":{"text":"Best Meal I've had maybe ever! It's atmosphere is eclectic and indoor seating was limited,","useful":1,"cool":0},"Ua5PGdo2LBNCrCRooKac_Q":{"text":"Attempted to go here twice.  Once, they shut down early. The second time we arrived and we","useful":1,"cool":1},"rgA5FkB1Vd4JlSN-RhKuzw":{"text":"My faaaaaavorite New Orleans brunch spot. The food is always incredible, fresh, and season","useful":0,"cool":0},"qzWTv7uvzAQdWjxmrJM_rw":{"text":"Every time I'm in New Orleans I try to make it to this spot. It's consistently great every","useful":0,"cool":0},"CymRRNssl5ycp3okoB7DKA":{"text":"Amazing. Amazing. Amazing. \nSeriously. Go here. Now.\n\nThese people care about food. They c","useful":0,"cool":0},"NxDBIZf7bHAfbfzRIRCcVQ":{"text":"NOLA is not very vegetarian friendly! I have tried so many places in the past week that I'","useful":0,"cool":0},"iY_B_eal1l_orbeepnMfRg":{"text":"If you want healthier fare in NOLA, this is the place for you.  We came here twice for lun","useful":0,"cool":0},"DJ13scN5xomeYA73nGZRXA":{"text":"What a wonderful dinner. \n\nFirst off, the staff is wonderful. Chef Chris DeBarr was very a","useful":0,"cool":0},"52v-uH-62fv3k4TEKvuiXQ":{"text":"Fun outdoor seating spot in an alley off Bienville St on one end and Conti St on the other","useful":3,"cool":1},"kD23VNBImw2ml8VYtMfKWw":{"text":"This place is an absolute god-send in a city in which there are no fresh fruits and vegeta","useful":3,"cool":2},"VNYGzIOzvD3exs8iRlDHbQ":{"text":"Green Goddess for the win!\n\nOnce you've sampled all the po' boys, oysters, and bread puddi","useful":5,"cool":1},"MKSOkeioTWrj3645v9Ltzg":{"text":"Could not wait to write this place up. As rude as this sounds, I'm still picking at what's","useful":0,"cool":0},"InnAIqMqZOT75NmIUzqNaw":{"text":"Went to dinner there with some colleagues an what a terrific find. While the place isn't f","useful":2,"cool":1},"bFqjQO2qOpbBzzc7sRet1A":{"text":"Probably the best meal I had in New Orleans (and we went to Commander's Palace, Bayona, Na","useful":3,"cool":0},"1_rJKL7S2aJHGBuBRP2yzQ":{"text":"Found it on yelp and so glad we went. Sweet potato biscuits is all I have to say. They wer","useful":1,"cool":1},"qmX-3FIhYRxx5TNGkCCnqQ":{"text":"Awesome food. \nLoved the cheese grits, biscuits and mushroom gravy. And patata bravas were","useful":0,"cool":0},"gweoerFCFl_KLnueMR0ahw":{"text":"Warning: This review is pretty one-sided.\n\nI touched down in NOLA and I was starving. I wa","useful":3,"cool":3},"c5zhlaJj33Xkusq93B3KAA":{"text":"We were pretty tired of the usual creole restaurants that we needed something out of the o","useful":0,"cool":0},"y0BDWXU9R9_OuXetK7pdAQ":{"text":"Unbelievably creative. Every dish had personality.  Seating is limited but worth the wait.","useful":0,"cool":0},"jykdgDx_ZDhXW0DIuz0FxQ":{"text":"Having come to New Orleans on business and not having taken the time to do research on whe","useful":0,"cool":0},"wOYm5MmtmB12HSaONXyuag":{"text":"We got the oyster-absinthe chowder...and WOW! It was awesome.\n\nWhile this is only about a ","useful":1,"cool":1},"einCZeWXlsyT_anRy6_vsQ":{"text":"Great little quiet spot! A few blocks away from busy bourbon street. \nIt is definitely not","useful":0,"cool":1},"4efhK9V11LwfD1NJ2RQaZA":{"text":"My favorite nola restaurant. Everything is so delicious and the atmosphere is perfect.","useful":0,"cool":0},"MBOPfLaex0etr0eZpzzXmA":{"text":"The service was good. But then again, we were the only ones there when we arrived. The men","useful":2,"cool":0},"UZVvopjJaGWu_LiteejQaw":{"text":"Vegan find!! I had the lemongrass tofu po boy and it was delicious and so filling! As a ve","useful":0,"cool":0},"DR751Ofcd-oC-D12DyZw2Q":{"text":"Vegetarian.  That's funny. We went here because my daughter is allergic to seafood and fig","useful":1,"cool":0},"xlABc6GSN5BOWgvVJkHYXQ":{"text":"Disappointing salads, according to my companion who was looking for a good vegetarian dish","useful":0,"cool":0},"9WelBxaidAsg9_UXIKEqiQ":{"text":"The food is delicious and inventive. Service was good. Sitting inside would be unbearable,","useful":0,"cool":0},"chcPEXq4EEcTujnVE4CBoA":{"text":"I ate here last July, but still have fond memories. We couldn't get a seat inside this clo","useful":0,"cool":0},"mbFJLOFk1xzvW01USnH7TA":{"text":"Located in an alley (a charming alley) this little place champions a veg heavy menu while ","useful":1,"cool":1},"XyPErHrBtNM9PQOTNlKzRw":{"text":"The host was awesome. The waiter on the other hand, actually looked like he was scowling a","useful":0,"cool":0},"CFL_8qc3_n1tGV_BDHAjBw":{"text":"Not actually a green goddess of any sort.  The name was like a beacon in the night for thi","useful":3,"cool":1},"mikU_zT0VMlJHthIe1avRw":{"text":"I love to eat. I love new things to try. I love an atmosphere that is unpretentious and ma","useful":2,"cool":1},"wXIAumSPn3XOd2nYxOfIRw":{"text":"The service here is awesome and the food options available for vegans exceptional. Very qu","useful":0,"cool":0},"AkYIpP4vZfzKO7lOzNgGiw":{"text":"Dinner here before parades on Canal St in NOLA. Got here just before closing. Seated in ba","useful":0,"cool":0},"8dSldCMMJt8ySru4iK7hig":{"text":"Tasty, and a good spot for vegetarians.  Meat dishes are a bit lacking.","useful":0,"cool":0},"RHyjWV4hP7djRxLLNsAmCw":{"text":"Green Goddess is such a hidden gem.  We visited from Dallas and it was so refreshing to ea","useful":1,"cool":2},"3aTq3rBRPYC3OzLent-7Bw":{"text":"Such a great find tucked away in an alley street. The service was friendly and attentive. ","useful":0,"cool":0},"hjsm3AUgdywj4ccEFIbeXg":{"text":"the food and service was good and there are good vegan options as well as non vegan option","useful":0,"cool":0},"QHvgoPhI6Yvbw7fdl5DVtQ":{"text":"We almost licked the plates. This place has a very nice menu, vegetarian, gluten-free, mea","useful":0,"cool":0},"S_cYcDVxToWIldA9RtuPcg":{"text":"Loved this place! Try the parish pour. Amazing veg options, but plenty for carnivores too.","useful":0,"cool":0},"4Pd7_gXutzdL9AwcjrARyA":{"text":"The food here was so so so amazing. It's a small cafe run by locals and if you want to hav","useful":0,"cool":0},"qdJ5bWiUHHeLZvXGIjWKVg":{"text":"This place was located down a really cute alley. It looks like all the seating is outdoors","useful":1,"cool":0},"rWOmckQqHpQDKkJw_dB_ug":{"text":"Funny how one thing can inform an entire experience.\n\nWe went on a Friday night.  Obviousl","useful":2,"cool":0},"BdwwgNIgF1Gd-gaLA_J50A":{"text":"Such a chill little spot! The folks who work here were very down to earth and they have a ","useful":3,"cool":2},"CEbgjvnukx5r2RLc0hrCvg":{"text":"Restaurant is not entirely vegan but has many great vegan and vegetarian options.  We real","useful":1,"cool":1},"xdSQIgDJnIhNz9nY-jqThQ":{"text":"Such a treat to find an excellent vegetarian and vegan restaurant in the French quarter. C","useful":1,"cool":1},"g2r15BeRDSmgiR7jc6DqMA":{"text":"Great spot with cute outdoor seating. There were a lot of food options for the vegans and ","useful":0,"cool":0},"KyqqL65uS-9Xb4LG7CAWMQ":{"text":"Small, gritty, friendly, healthy.  Did I mention small?  It's quite small.  I ducked in he","useful":2,"cool":1},"yuaWJs6QtLDDSPmtfYestQ":{"text":"Great little casual outdoor lunch spot on the cutest pedestrian-only street in the French ","useful":0,"cool":0},"QM79Eb3Y4GNQE4UhhxhzXg":{"text":"I had some delicious vegan dish (forget the name) that literally I've been thinking about ","useful":2,"cool":2},"6TAgArHJwopvLtvfxQppWA":{"text":"Visiting my friend for a free days. I was referred to the Green  Goddess. I had the falafe","useful":0,"cool":0},"vo6yJVE-YIlZ11rxGie_8Q":{"text":"A vegan and vegetarian friendly sanctuary in the French Quarter that is hidden back from m","useful":0,"cool":2},"qXjw82GJAqwP2RI3wGeY3Q":{"text":"Tofu scramble was boring. Tofu had good flavor but was hoping for some avo, tomatoes onion","useful":0,"cool":0},"GuzIbVacX9x_Xru0-dw-bg":{"text":"Really happy with our brunch at Green Goddess on our last day in NOLA. Though we did have ","useful":1,"cool":0},"Fh7R-QXiGeVP9ah7WcjBYg":{"text":"I didn't even eat at this restaurant because I waited at my table for 20 minutes and no on","useful":0,"cool":0},"3sgfElGcueiUeiP3DF27ZQ":{"text":"Great food and wonderful service.  The owner suggested a French wine and it was excellent.","useful":1,"cool":1},"RUOASb8lE1rTYgCO4PgxaA":{"text":"Situated in an adorable alleyway, I never would've discovered this gem if it weren't for Y","useful":1,"cool":1},"YfMnepzpP7EuZ9AtesY_1Q":{"text":"It's a bit on the pricier side but worth a visit. Especially for vegetarians/vegans. Their","useful":0,"cool":0},"pdyUItJTQSwHi3F6INskqg":{"text":"We happened to be walking by when we saw the sign and a lovely member of the staff asked i","useful":0,"cool":0},"p6CWra_zv5cZsDKH10Hg4g":{"text":"Happened upon this restaurant, decided to give it a try. We sat outside bc it was a beauti","useful":3,"cool":0},"TKD17IwGXWqe9E4PRvJYmA":{"text":"Love this trendy funky Asian fusion joint in a land of gumbo! What a welcome sight for me.","useful":2,"cool":0},"GSg7hIjxKoc7rhO_49F4aw":{"text":"I came in to Green Goddess with a group of my family members and was so pleased with the s","useful":0,"cool":0},"Jfc9gfg6eQGtQaYLqlfNnw":{"text":"Went here with my friends for brunch. BEST PLACE EVER!! Since we were visiting New Orleans","useful":1,"cool":0},"4w7uvc9rVPfySyDqOtIhlg":{"text":"We were worried.  So many places in the quarter just want to turn a tourist upside down, s","useful":0,"cool":0},"muDJDFoPibkvCEAaBYmL_A":{"text":"This place came highly recommended by both Yelpers and a fellow foodie friend who knows he","useful":1,"cool":2},"tFEi_GkK1X_-mR9gz5GC0Q":{"text":"What an amazing place! My twin sister and I adored the outdoor patio seating, the tasty wi","useful":0,"cool":0},"YT0J82gwndfZabAc8lwhcA":{"text":"Great food and great service. We went here for lunch and sat outside, and even though it w","useful":1,"cool":2},"QfId9RaEmOUy9-rKSABxqA":{"text":"Similar to other reviews, my experience was not terrible, but it was not great.\n\nWe knew t","useful":2,"cool":0},"9ddmSl0laXv2bdVNDsheTQ":{"text":"First night in New Orleans, wanted to find a quiet place not too far from Bourbon street t","useful":0,"cool":0},"shvF7PkjgKFCDN0gXR26rA":{"text":"Best meal I've had in NOLA... by far. Should definitely stop in for the Brunch Biscuits.","useful":0,"cool":0},"tym03m-NsBHBy3k4LxOWtw":{"text":"Straight up: I've eaten at Green Goddess and the food is great.\n\nHOWEVER, this place can a","useful":0,"cool":0},"pOStwvXsihpVR2cJYkmHEQ":{"text":"Green Goddess has a great reputation in New Orleans, and for good reason. The food is grea","useful":3,"cool":3},"PzJYW8kxc94uy4dxm_rRQg":{"text":"Don't have much to say except after eating \"traditional\" Louisiana food at every meal for ","useful":2,"cool":2},"hFc7MyYUOeKsSz-wcnWkhQ":{"text":"This restaurant was exactly what our bodies needed after consuming lots of fried foods and","useful":0,"cool":0},"JTqUr_L7CPmFdspkA7MpfQ":{"text":"This place was perfect! You sit at a quaint table on exchange place. Their menu invites om","useful":6,"cool":4},"MbrDz8x0RBe-ZCJiLo9rAQ":{"text":"One day I'd actually like to try their food. The service was so horrible that we left. It'","useful":2,"cool":1},"WIaTNw85cqF9uMYwjxjdxA":{"text":"No, no, no.\n\nBy far the best part about the experience at Green Goddess was sitting outsid","useful":4,"cool":5},"dMvFrEd3eT8DxYAgjyhfWA":{"text":"Kind employees, fast service. It's our first restaurant stop in Nola so far. The atmospher","useful":0,"cool":0},"FA-_HhhGfifaKw-G74CviQ":{"text":"Found this restaurant by chance and it was amazing.  The food was delicious and service wa","useful":0,"cool":0},"Fr91Zm1f1MAMMCfS4oTTiw":{"text":"Happened to find this restaurant by chance and had one of the most memorable meal in my li","useful":0,"cool":0},"zTV__MfYpkHtbbyMG9w73w":{"text":"Ate here for lunch first thing after arriving to New Orleans. It was all outdoor seating. ","useful":6,"cool":3},"veIHyt_D6w0r1nh84fGp1A":{"text":"If I ever told anyone I went to a vegan/vegetarian restaurant when I was on vacation in NO","useful":3,"cool":0},"dxupQST1tWNYH17P8ko0NA":{"text":"The sweet potato biscuits with mushroom gravy were delicious! I am so glad I ordered this ","useful":2,"cool":1},"1hZOnVvhey5Whxio5BGMMg":{"text":"It's not often that I eat somewhere in New Orleans and feel ¯\\_(ツ)_/¯. But so it was at Gr","useful":10,"cool":9},"peMPQ5RYoPbtnVsQKhGk6g":{"text":"I'm so happy we stopped here for dinner while visiting New Orleans! Food was so delicious,","useful":1,"cool":0},"2p-Xs7EwdVhEfJWdJBrTRA":{"text":"You know a place is gonna be good when you start looking at the menu at dinner the night b","useful":1,"cool":0},"bYTM6GrA2ZFBZxqqYavy6w":{"text":"The food was great, it's too bad the servers were the most rude people we came across in N","useful":0,"cool":0},"3Vd5jvom3PYevFvk-1RnGA":{"text":"Menu is very eclectic and large. It was hard to make selection with so much to choose from","useful":0,"cool":0},"h8iWsXqH0KnX9TWSccEslQ":{"text":"Some describe it as a hole in the wall on an alley... well then it's the darned cutest hol","useful":0,"cool":0},"qT9GFn4CtvLNlRBDdkvW1Q":{"text":"No. That answers the question, \"So Suzanne, would you like to go back to Green Goddess?\" N","useful":9,"cool":6},"VvVqEHwqBt3QcnwSllcJLg":{"text":"I'm writing this review at 2am because I'm awake with nausea, presumably from eating this ","useful":1,"cool":0},"PNxzOY5aqwNV4VDut1Mtsg":{"text":"If you're looking for Southern/Louisianan/NOLA food, with a new-age take, you must try thi","useful":2,"cool":2},"fXJvozBHma3eniBAmBj-RQ":{"text":"Hidden gem! 15-20 minutes to get in anywhere for lunch and happened to take a walk through","useful":0,"cool":0},"qBp__jyMU3xhokXjqomyrA":{"text":"This was one of my favorite restaurants we tried in New Orleans.  I had the sweet potato b","useful":1,"cool":1},"fD0L0y3GK1u0Q31hiW6ALw":{"text":"We stopped in to Green Goddess as pescatarians looking for a break from seafood. I ordered","useful":2,"cool":2},"d3FIcH_uPDN7Te3fmbJKBA":{"text":"Food was really good. Watermelon. Burrata, and kale salad was delicious. But service bad. ","useful":0,"cool":0},"_TWDHkuSTC0ygY6ZxFL-Kw":{"text":"The ambiance was perfect at night with the alley lit up with lights. The servers where rea","useful":0,"cool":0},"Gy3YP10Ity66R4eI6UEhzg":{"text":"This place is amazing!!! I was visiting NOLA for the weekend and it was difficult to find ","useful":1,"cool":1},"OFz0M5IjD3qByREvyqnZDw":{"text":"I have never seen a restaurant be so polarizing.   I guess like everyone else, I can only ","useful":2,"cool":1},"ee3_97vC0LmdCdallpq63w":{"text":"In case you were wondering (and I'm sure you weren't), Green Goddess isn't the name of a C","useful":2,"cool":1},"kZqLDId_3nXNCVUDFdzN8g":{"text":"My boyfriend and I went here because we were craving something healthy after all the fried","useful":3,"cool":1},"UnzpSMJttGIZo5cuM-0b8w":{"text":"Unfortunately, I never got to eat at this restaurant although I tried twice. Both times th","useful":1,"cool":0},"IDJO651JNddayy8HH1hR4w":{"text":"It was nice knowing there was an easy option for vegetarians as we travelled to the french","useful":1,"cool":0},"i5rRXH60BxR9RZgw9NO-XA":{"text":"We were given a table on the patio which was cute. We ordered a lemongrass tofu po' boy!! ","useful":1,"cool":1},"HhaC9IDSObpoRfHuEeBF2w":{"text":"This was the best restaurant we picked during our stay in New Orleans. At first glance the","useful":2,"cool":1},"jQnqm1fQJ-YMHeulbBxdgA":{"text":"Great meal in the courtyard. Fresh and perfectly prepared creative dishes and well made dr","useful":2,"cool":1},"Zq-CJUVgj8fJT6IWGCXEIQ":{"text":"Despite much trepidation, we ordered the beet hummus for an appetizer. Unlike most other n","useful":3,"cool":0},"vrvYjO-D3WpivKZ8oESpVg":{"text":"Small place with outdoor seating. Very unique food. Hubs had a Cuban with pineapple, Cajun","useful":1,"cool":0},"D3Dg65nlzl6PBGc4K00ORQ":{"text":"I was very excited to find a healthy place to eat in the French Quarter. The ambiance is s","useful":0,"cool":0},"uPP6SUdTO921qdkkI2L8Yw":{"text":"A gem in the New Orleans foodie scene! We had a variety of things and all were excellent. ","useful":1,"cool":0},"LU4yLkCZrOsglUdz_ZYzCA":{"text":"One of the few vegan options right in the French quarter, this is a cute sit down restaura","useful":0,"cool":0},"miMfywzV0idhO-bgl0nI5Q":{"text":"Food here is very eclectic and vegan/vegetarian friendly. Frankly was surprised at how muc","useful":5,"cool":1},"JMf0fbjBFdLWHvjYTH8JNg":{"text":"The tiniest restaurant I've ever been in. Servers are awkward and it would be appreciated ","useful":1,"cool":0},"oed4l3Vr720WehDD3Ise4A":{"text":"I had the pleasure of having brunch here the other day. This cafe is located in an alleywa","useful":2,"cool":2},"V6REK3bNOtg5i5mqrdTdSg":{"text":"Located in the French Quarter, the Green Goddess is tucked away in a quiet, I'd even say r","useful":0,"cool":0},"j2cENOkHQ3Y_PtZPJHoj4g":{"text":"Highly recommend 110%.\nThe food was fantastic. 5 of us all got different plates, and every","useful":1,"cool":1},"8moTKmH3Ug6ARzdgXO2xAA":{"text":"Awesome little place. Everything we ordered was delicious and service was friendly and hel","useful":0,"cool":0},"afu6LR8-pR1JFC0Kyr7bnw":{"text":"The location is charming and perfect for nice weather in the French Quarter. The menu soun","useful":0,"cool":0},"FtEjOXUKXzcb6YLixBw5Yw":{"text":"Happened to find this restaurant by chance and had one of the most memorable meal in my li","useful":0,"cool":0},"xxhzcJ9tTSPeKXxE0J0qZg":{"text":"Oh my Goddess!!\n\nLame, I know. Still, it changes nothing about the fact that I probably ha","useful":3,"cool":1},"eTz6vN_j9ioN39IXEnhCEA":{"text":"What a wonderful spot for diets that include both plant based and not. It was the perfect ","useful":7,"cool":7},"qJ4Vja4SDD4k1kktz-9ntA":{"text":"DINE AMONG THE RATS ON EXCHANGE ALLEY: I'd hate to see the kitchen...\nOVER-THOUGHT & AMATE","useful":3,"cool":1},"UOFlUyb7yg-G3fb8DrbI0Q":{"text":"I love this place for lunch. They offer great salads, light and delicious. And you can sit","useful":0,"cool":0},"-fY0HRVYouER8aZUHmyJbw":{"text":"This place is wonderful!  Hands down one of my favorite spots on the trips.  We came here ","useful":2,"cool":0},"d5ekEz3yR0DSWc-E6QS7kQ":{"text":"Green Goddess is tucked away in between two sections of buildings--almost like in the midd","useful":3,"cool":2},"CD1LAqGxJ41qSOEp9iiFNg":{"text":"4 stars ONLY because I am upset you are not located in St. Pete.  FL\n\nOtherwise 9 stars!  ","useful":0,"cool":0},"6DZ-FuQPwBk-uP2GQ8B8Dw":{"text":"So the plates and the drinks are tiny but they're so good!!  This would be the place to br","useful":3,"cool":1},"q244iJ5Goq0O8IjQ6cyJtg":{"text":"Delicious food just as yummy as I remembered. We had a great dinner though it was a little","useful":0,"cool":0},"UqKldZ4tHPRppj7hafcGBQ":{"text":"This little street was adorable and perfect for a lunch (fyi it's not actually that hard t","useful":3,"cool":0},"D5pU9jES6a28qM0JJpiNgw":{"text":"Both my meat-eating husband and I loved this place. It has great options for vegans and GF","useful":2,"cool":0},"WQrEq8QuNEQC_QBYtm3PhQ":{"text":"Extremely rude people working here. Didn't even sit down to eat because the girl gave a re","useful":0,"cool":0},"7_npqChMO_p3NAvf7B-6Ow":{"text":"Green Goddess was my least favorite restaurant I ate at during my visit to New Orleans. I ","useful":5,"cool":1},"YNn3_ey4LXq2boLrhTUMGg":{"text":"Wow. Did this experience really happen? Did I really get talked into going to a healthy ve","useful":2,"cool":5},"J6mGIBUw7m8i9qK7BIR8nQ":{"text":"Popped in on a sunny Saturday for lunch, service was solid, nice spot. They need more umbr","useful":2,"cool":0},"2tmMyL2I6i-CtHrwwlS_rg":{"text":"What a gem this restaurant is for the Vegetarian and Vegan community. It's located in a ch","useful":8,"cool":9},"mMtuZ3bGj0LWmr8DaSgJ4w":{"text":"I had the beetroot, kale, and Burrata salad and it was the most dreamy (Can you call a sal","useful":0,"cool":1},"JY9Xx1K0cfIGks9Sa_Z1Eg":{"text":"Charming dining area in a little alley way. We started with the beet hummus and enjoyed th","useful":3,"cool":0},"c4G2TPaAzQpldfyYbCjYWg":{"text":"Probably one of the healthier food options you can find in NOLA. This establishment is in ","useful":1,"cool":0},"TKnTOJlUVBCufEsKf9pLmQ":{"text":"This place is amazing when we visited in November 2009. I was blown away by the calibre of","useful":1,"cool":1},"Wvd02z0VY-uAUKGMwB1xKA":{"text":"We literally walked around the French Quarter for an hour before stumbling across this pla","useful":1,"cool":1},"97gM0NzhET0evP1U3tSdRw":{"text":"I have to say, i wasn't particularly wowed by this place. I saw the good reviews and decid","useful":2,"cool":1},"giKjrH45Fvzgeo7FYoOfcw":{"text":"My trip to New Orleans did not rate high on the foodie scale, but this one establishment w","useful":1,"cool":0},"iWAVxpidHLFTdi0zvVdgQg":{"text":"Delicious. We ate a LOT of great food last week, and Green Goddess was in our top two, may","useful":0,"cool":1},"oSISxgCgvfOQGEm6V5MZlg":{"text":"Fast. Delicious. Well-priced.\n\nGot an amazing Indian buckwheat crepe and watermelon gazpac","useful":2,"cool":2},"ELbvdgQRKhXFA4tpCU9ogQ":{"text":"Umm.... W O W. That was our expression after tasting each of our dishes. I cannot wait to ","useful":10,"cool":10},"BprSisAchlHcAPu-ipR1Jw":{"text":"I had been trying to get us to eat here for a while. The problem is getting into the quart","useful":1,"cool":0},"dVBxkWvdSM6AGkTvc68vew":{"text":"I was super psyched to try this place and was told they have a bunch of vegan options. Whi","useful":1,"cool":0},"pP_cO5ZR6oCXpJiks-YN8g":{"text":"Best meal I had in NOLA. My friend got the Acadia dish for brunch, which was the standout ","useful":1,"cool":0},"NMp8GmD9BjDm7tiB4ddHxQ":{"text":"***3.5 stars***\n\nI generally wouldn't have come to Green Goddess to eat, but one of my rel","useful":3,"cool":1},"lDS4cyoIJhaRFDSCWo9d7Q":{"text":"3.5 stars\n\nGreen Goddess is probably the only vegetarian place in the French Quarter so I ","useful":4,"cool":2}}