{"c1HJHA-3eLFOy8CeVqbyxw":{"text":"Walked in for a gel manicure and couldn't have been more pleased with the experience and c","useful":0,"cool":0},"1cPLsTAik4IrIM-_vIOPVQ":{"text":"My best friend and I were in town for a girls' weekend and needed pedis. The service was i","useful":0,"cool":0},"R830Dwyksa_kGYjnku9Bow":{"text":"Excellent ladies beauty services! Clean studio. Employees work as a team to make YOUR EXPE","useful":0,"cool":0},"HlPSBdMiW8Lqa4Mb9dOq7g":{"text":"What a great experience. Alton took care of me, while I was here out of town and gave phen","useful":0,"cool":0},"frRWSr5q2rSkWBSSDN2L7A":{"text":"This place is definitely a more luxury experience. It is very charming inside and you will","useful":0,"cool":0},"MBVL1wgnTfXjaS35YaIYAg":{"text":"The salon is bright, clean and modern. The staff is very professional and friendly. Teyann","useful":0,"cool":0},"ttglmUu0R1jfaNKacJDBHA":{"text":"I heard about this salon around a year ago and i finally went in for a manicure.  There ar","useful":2,"cool":0},"-m6fi5RahK-yTnvTnS4w6w":{"text":"After reading the reviews, I decided to use Salon D Nola Too for my bridal party's nail se","useful":1,"cool":1},"QTYDryQfznEdps9sEuXibw":{"text":"Absolutely fantastic! This salon is an oasis in the French Quarter -- it's quiet, it's bea","useful":0,"cool":1},"FEXV05mekbYScDWNUZkVCQ":{"text":"Great place, they don't do acrylics which is my kind of spot cause it isn't filled with fu","useful":0,"cool":0},"yUElpS7iauR7LJrLn2idBg":{"text":"Fantastic experience here-gorgeous salon and super nice people. Eyebrows waxed to perfecti","useful":0,"cool":0},"q02cPIIlG8EWqoYBztQB8A":{"text":"The staff were amazing (helped give us ideal on how to get around town, and have some fun ","useful":0,"cool":0},"UT_nNWDctAQX1jy-QdbqoQ":{"text":"Fantastic pedicure experience at Salon D Too while on a friend's weekend in NOLA. Nail Tec","useful":0,"cool":0},"fTady-2T2mOKvPcZMT-bIA":{"text":"Ashley was great!! My husband and I came in to get pedicures before our cruise. As we were","useful":0,"cool":0},"d3TGRY3huDGR_wapBNribQ":{"text":"I'm staying at the Marriott in NOLA and wanted haircut/color because I knew I wanted a new","useful":3,"cool":0},"S7-8L6BwrJ2_2WvaHX6GIg":{"text":"Lovely place, very upscale, beautiful atmosphere friendly staff and you get champagne, win","useful":2,"cool":2},"cV4SSPh9j4C4r_d9XYTNpg":{"text":"I was in town for a company party, and chose Salon D NOLA for my makeup and hairstyle need","useful":0,"cool":0},"BtnWF_VUcDuL2-Sd63TXMQ":{"text":"Great service, great and talented staff.  I continue to fly into town to get my hair cut h","useful":0,"cool":0},"znD0LkkHqbO81LWtFvYrWg":{"text":"Very clean and classy salon. Super comfortable. Both Ashleys were amazing - my husband and","useful":0,"cool":0},"-UCFP8NmNjDXrPin5QQSag":{"text":"This place is ah-mazing!! The interior is very feminine without being overtly tacky. The a","useful":0,"cool":1},"Nhf5htirxq18FrnYwz7WVQ":{"text":"Received a cut and all-over color from Lara, and I couldn't be happier! The whole team is ","useful":0,"cool":0},"hzfXpcD3mnwhh3AW2aNZqw":{"text":"Don't go here if you want a professional environment and high-quality manicure by a licens","useful":2,"cool":0},"eNs9NeAnoXl0yOWNdl2_7w":{"text":"Loved Tianna! She really made me feel at home and my feet look amazing. She took her time ","useful":1,"cool":0},"h68m-94zyD_ZVjAb157_oA":{"text":"Was a walk in and treated so well!! My haircut was exactly what I wanted and turned out Gr","useful":0,"cool":0},"G58k9JB6NpgG55AI2i2ePg":{"text":"I was visiting friends and while they were at work I decided to walk the French Quarter. A","useful":0,"cool":0},"ANrtNULWwEHkTg2V4ZX7gQ":{"text":"Great service! Friendly staff. Styled my husband's hair in a way he'd never done before. I","useful":0,"cool":0},"UI_3JcJX8ziwkNlLd1XAvA":{"text":"Very clean and accommodating! Hotel guest at the Royal Sonesta and this place is just two ","useful":1,"cool":0},"0gPb7cwRGSWNzgrUrUcvgw":{"text":"Great service and friendly staff! Did a great job on my nails! Prices very reasonable! Wit","useful":0,"cool":0},"9kLNv7W3IbCLB6D2s5gmyg":{"text":"My friend and I forgot our hair tools for a wedding and so we panic searched for a place t","useful":0,"cool":0},"VzOtfbGlGLiKht7xvvn3nQ":{"text":"There are two best parts to going to Salon D. You are going to love what they do to the st","useful":0,"cool":0},"-fTjk7DKpt_Ptv0jns8MWQ":{"text":"I could NOT have found a better place to have a pedicure (of which, I was in dire need). T","useful":3,"cool":2},"PSleSjrtY5dwYuHP633lSA":{"text":"Dianna and her team did a fabulous job for my wedding. My mother, my mother-in-law, and my","useful":1,"cool":0},"FwK_-s67_8npIN4yAdMtMQ":{"text":"I was in NO for a quick visit. On a whim, I called Salon D and was booked for a haircut wi","useful":0,"cool":0},"hOq-B56OMf4OOR-R9H7Q8g":{"text":"Dianna got me in for a last minute manicure appointment with Amy, who was great! The Salon","useful":0,"cool":0},"2mA6o1E9VQk6sGBNqk7a8A":{"text":"My experience here was absolutely 5 stars, but my manicure sadly looked like this after 2 ","useful":3,"cool":0},"nul57qK4eGjuRtv8Soh8-Q":{"text":"I walked in from the pouring rain a mess, and was transformed! I am visiting from Denver a","useful":0,"cool":0},"Xe5yaMAiOCWjQPUUGzb7EQ":{"text":"Great hairstylists, easy access in the FQ, very inexpensive to comparable hair salons like","useful":1,"cool":2},"Y1vT1Ia5fwCNPg0CUdyX3A":{"text":"Went in looking the Wild Woman of Borneo came out looking like a real live human. Patrick ","useful":1,"cool":1},"acvcl7UENIOuxrTNFTRZPg":{"text":"This review is for a pedicure. The people who work here are indeed very kind and accommoda","useful":2,"cool":0},"tJ3kOkPqDIKXpk2WpWDt8Q":{"text":"Grace, thank you for your kindness, attention and quality of service. I got a blow out wit","useful":0,"cool":0},"PholmCWVyNddXRCDez2Tew":{"text":"I got a spray tan here while in town on vacation. The color was great, I got lots of compl","useful":0,"cool":0},"bjYD7g5h4t1G2-u_Ivunvg":{"text":"Nice and clean. American staff. Relaxing, Spa like atmosphere. Great products. Good locati","useful":2,"cool":1},"ZckqSGzfa2LpM_wCntJOSQ":{"text":"This place is awesome, I was in town for business and need a blow out. I called last minut","useful":0,"cool":0},"kD9vGog1iyLcZ6bVzXbCkA":{"text":"Dianna is amazing. I made an appointment for her to come to my hotel room and do bridal ha","useful":1,"cool":0},"b-azTp4ZrIFpbdweTA9pqQ":{"text":"I was searching for a good place to get a spray tan. I  found the BEST. SALON D NOLA on Bu","useful":0,"cool":0},"BVMPKiq_KtUH1d1TX6bOdQ":{"text":"Dianna is a life saver! We came to NOLA for a wedding and unfortunately ended up at a diff","useful":1,"cool":0},"wTlS0ggKgpZxB0F5X_dgjg":{"text":"Way overpriced and my nails began to chip the same night. Only reason I'm giving two stars","useful":3,"cool":0},"XwQofaYrx8_7i1Zi6b3f7g":{"text":"This place is tucked away from the hustle and bustle, and the salon is very clean and pret","useful":3,"cool":0},"4OlQFKavZJIhoRObdblXJg":{"text":"Best pedicure ever! Jana was amazing! Super thorough, nice, and really takes pride in her ","useful":0,"cool":0},"S5HIDn4npF2EheLuqJknxQ":{"text":"Salon D is new to Burgundy but not new to New Orleans. The salon is with walking distance ","useful":1,"cool":0},"imTNDvIPGF7gLEhEYRXo8Q":{"text":"Walked in with doubts because it was such a small salon and they were running a bit behind","useful":0,"cool":0},"jNeeJ7gZSq_i3wWp2AVkHQ":{"text":"I've had a pixie cut for a little over two years now and a long streak of bad haircuts eve","useful":1,"cool":0},"tVeHaSyyJtHXLrxeLE_rbQ":{"text":"Unfortunately, I would not recommend this place. I have a few issues with the subpar gel m","useful":2,"cool":0},"2BN2MC7B6dHrunstcKjpOw":{"text":"I have been a regular at this place for about a year.  They have been patient the couple o","useful":0,"cool":0},"_mXBJCr4FGIS_rrP2f84LA":{"text":"Really awesome service and setting !! \n\nVery relaxing space. Excellent staff ! Feel very a","useful":0,"cool":0},"U2zQea2mzL46SVTAUgde_A":{"text":"Salon D Nola is fantastic!   I was in town for a wedding and they fit me in on a Friday fo","useful":0,"cool":1},"id_a7zJ8Y12klrIH6wNUYg":{"text":"I'd say the best part of this salon was the staff. They don't really do walk-ins which is ","useful":0,"cool":0},"aQ7CvbDiMxNmQlDYXKk42w":{"text":"I was in town for business and desperately needed a pedicure.  Many of the reviews for oth","useful":3,"cool":1},"-fH-KQfnuiOh0fLbTJKf6Q":{"text":"Great customer service, music and spa feel! However the gel polish does not last and the c","useful":1,"cool":0},"zMq4_mqO7pDYOl5RTMaEQg":{"text":"In NOLA for a family wedding and had my hair & makeup done by Daisy. She did and amazing j","useful":0,"cool":0},"Jz7f-uilU_fQlPacApXVmw":{"text":"Liz was EXCELLENT & did a meticulous mani-pedi on my poor pathetic hands & feet which were","useful":0,"cool":0},"0F5s0pgmJT9NLo4l4YZvsg":{"text":"We were from out of town. Tiffany took care of me. Excellent job. Very friendly staff!  I ","useful":1,"cool":0},"pB3-2c45wX6Typok9orfXA":{"text":"This has become my go to salon! It's been a long struggle finding someone who actually lis","useful":0,"cool":0},"fKEOnMvEVoVnx1o6SwyQyg":{"text":"So good! Love my nails. And so friendly and nice people working here. So professional and ","useful":1,"cool":0},"eGzfaklAz6bn9HzhAFJj6Q":{"text":"I love this salon! I was in New Orleans for an event and came in twice for a blow dry duri","useful":0,"cool":0},"GmtVqlfHzwejYhGCYhjq7A":{"text":"I've had my eyebrows waxed and tinted, and my nails done at Salon D Nola the last two time","useful":0,"cool":0},"yUa1gRKXEj8xYPRPbcSOYQ":{"text":"New in town or just visiting? This is the place to get your color, cut, blowout and your n","useful":1,"cool":0},"olSYSaQHHc_LVK7EJ25TcA":{"text":"I love Dianna and team!  They are able to cover all of the bases and make the full custome","useful":0,"cool":0},"jD2O8oPvdobpmstv4qMMPA":{"text":"Salon D has the most welcoming staff. I cannot say enough good things. I am in town for th","useful":0,"cool":1},"NZzNmye_YJKESAM6nrV0Pw":{"text":"Was scrambling a week out from my wedding to find someone to do my hair after some last mi","useful":0,"cool":0},"OAzXrGler-RlzkFYxbc1Mg":{"text":"I had the best make up and an up-do look courtesy of this salon.  I looked better than I d","useful":0,"cool":0},"IfGRYx75pO9AGTN-zQjD0A":{"text":"First visit ever to New Orleans to attend a friend's wedding, got a same day appointment f","useful":0,"cool":0},"NEqkKcH0OJ6hXeKGrIFNhA":{"text":"Great salon! I was in town and needed a last minute hair appointment ...luckily they were ","useful":0,"cool":0},"kM696Iotr13WKUvo1k1vbA":{"text":"I used Salon D for hair and make up for myself, flower girl and mother for my destination ","useful":0,"cool":0},"GcElgJnLOUqwMNkdj-UN2Q":{"text":"This is the perfect salon! Quiet and experienced and professional technicians.  I can walk","useful":0,"cool":0},"i-RILojCp6rZ8JG5tPoxgw":{"text":"My husband and I were in town and he surprised me with a vow renewal ceremony. He actually","useful":1,"cool":0},"CIvtgfeE_Upwrc906zGZJg":{"text":"My first visit today and I called to ask if they had any wax openings.  Needed the usual: ","useful":3,"cool":2},"P9jFlD6TpNRjKS6CnNvLZA":{"text":"I love this salon! I have been going here since I moved to NOLA almost 3 years ago, and co","useful":0,"cool":0},"sinkSfjaWyaM125VUCyQ1w":{"text":"My sister was getting married at the chapel next door so when her hairdresser fell through","useful":0,"cool":0},"1aK4SZ6X1OkyoK2Tk72dtg":{"text":"I am new to New Orleans and the thought of finding a new hair dresser is also a nightmare.","useful":3,"cool":1},"-PPXzCk2xq2zHNlJ4jAleA":{"text":"Ok...  I'm one of \"those girls\" who usually HATES salons!   But this family run, local, co","useful":1,"cool":1},"Lk5w8ZT2R65XkFyFqwur_g":{"text":"This salon has great charm. Amy is an absolute peach, she was gentle and fun to chat with.","useful":1,"cool":1},"Gtj4YSmSEbPWezvijjbdUg":{"text":"After having a totally high end celebrity salon in Los Angeles ruin my hair color by putti","useful":1,"cool":0},"xycn3--TUIPJE4EitF5cKA":{"text":"I went to Salon D for a blowout upon arriving in sunny New Orleans without any hair equipm","useful":0,"cool":0},"mJ1fQZ-uU_mYe_3opvtdxw":{"text":"I stopped in today and had the most amazing experience with Teyanna. I'm newly engaged, an","useful":0,"cool":0},"SNCCg6jyvxFHCAB6hslWKg":{"text":"I had a really good experience here while visiting New Orleans. My manicurist was Chelsea ","useful":0,"cool":0}}