{"krP6fy3aJ4AwdoyOb1YlwQ":{"text":"I love love this place! Fresh squeezed orange juice, the BEST rye bread ever and shall I m","useful":0,"cool":0},"tT9NmEbeWdjUT1VsUAsphA":{"text":"Love this place! Juice was amazing- got the Iron Chick and Refuel. Chia pudding and grits ","useful":0,"cool":0},"jKet3tn25GlkMfdsI5v1FA":{"text":"We ate here twice when we were visiting New Orleans because we liked it so much. \n\nIt's a ","useful":3,"cool":2},"G-1kDx7ZDivbBsfq9Ed47Q":{"text":"By far the best French toast I've ever had.  The service was great too.  Not very crowded ","useful":0,"cool":0},"_t9f-2GbU0hOEymYZx4Atw":{"text":"I'll admit, this wasn't my first choice.  When I travel work or pleasure, I frequently rel","useful":0,"cool":0},"dNCxjADGm1grsIC0XRBg1Q":{"text":"4.5 solid stars.  Really great breakfast spot in the CBD.  Had the basic breakfast with eg","useful":0,"cool":0},"qBAexiq8P-U6KQnl5s64dQ":{"text":"Food was delicious and quick ! Creamy grits were amazing !! Service was great. Definitely ","useful":0,"cool":0},"E7gbHhp38eUPH2fV9FGhKw":{"text":"All of the waitstaff and owners were very welcoming!! Their menu is super affordable ,heal","useful":0,"cool":0},"Lvjykk9VC9nMqu-kppdzMg":{"text":"Had a smoothie (which was very good), created my own omelet, fruit, and coffee. It was all","useful":0,"cool":0},"egWX749Oep0zX69OHmbe4A":{"text":"Two Chicks is a cozy spot with great food. They don't take reservations but we didn't have","useful":0,"cool":0},"amQUXUIN2fH6HpFNVDbgjg":{"text":"This place was so good! The shrimp were and grits were so good and big portion! The grits ","useful":0,"cool":0},"tQZYu7-cvYVQs4d6QIsNzg":{"text":"Delicious!  $30 for two breakfasts with coffees and a side of savory andouille sausage - w","useful":1,"cool":0},"t5Dk1pmUTrmiYdO0nt6ayw":{"text":"Great place for wholesome fresh food. Nice to have fresh juiced veggies and fruit with a l","useful":0,"cool":0},"er_MClJ5RRelG3cLVMk1Qw":{"text":"Super adorable spot with friendly staff and good food. Getting fresh orange juice is a rea","useful":0,"cool":0},"iw5b8AxJa2JrvrtngOjDIQ":{"text":"Very cozy place.delicious food and very nice staff will be back soon! Recommend for everyo","useful":0,"cool":0},"XiwJS4uKxmLQdc9MP8T11w":{"text":"The food was really filling and good! We got a chicken panini and a hatcherie sandwich and","useful":2,"cool":0},"O0Zo0klZnNUJGfUV9R6dSA":{"text":"Yum, yum, yum! This cafe is outstanding! We stumbled across it on our first day in town an","useful":0,"cool":0},"6jiQTQQfLw-EfuLacwp3rA":{"text":"This is an amazing little place. The under the sea omelette was packed with a great amount","useful":0,"cool":0},"lhucxfCBNjFPA59ndC7msg":{"text":"I came in looking for gluten-free options and unfortunately not a lot to be found - omelet","useful":0,"cool":0},"GJcYaaRA2O8Cwx03SHpvgg":{"text":"Wonderful, fresh food and juice for breakfast. Delightful decor. Friendly staff. Will abso","useful":0,"cool":0},"ebrtggsVXYNcq7XpCtTETA":{"text":"My husband and I enjoyed a delicious  and hearty breakfast while visiting  New Orleans  th","useful":0,"cool":0},"_B94X7aBgPGE1hctX_nPvQ":{"text":"Great spot for Breakfast around the corner from the NOPSI Hotel. French toast was excellen","useful":0,"cool":0},"IJEELvWDSNxFsmJwGwCAmw":{"text":"In town for a visit, this place was right behind our hotel, so convenient to walk in\n\nI pr","useful":1,"cool":1},"b-uou7lHyKku7w2qI2NtoA":{"text":"They are out of cream at a breakfast place.  Then I asked if they had whipping cream; said","useful":0,"cool":0},"zXp6GLQX5dFM1K9y3k2lbQ":{"text":"This is an adorable little cafe with a great menu!  I had the crab cake Benedict and my fr","useful":0,"cool":0},"XxJvbnOKoxtaXQYi89K4eA":{"text":"Great breakfast!! Seafood Omelette was delicious. Fluffy eggs, fresh plump shrimp, crab an","useful":0,"cool":0},"V-DONj7xOgI4yFphwDqM2w":{"text":"Great prices & simple, comfortable dining in an era of faux-sleek bloated brunch spots pos","useful":1,"cool":0},"L0SIE0vI-USAlQkI_CDMVQ":{"text":"Went here this morning and had the Kickin' Chicken Omelet. It was probably the best omelet","useful":0,"cool":0},"1c0rzUSjQK6Wc0Rv5kgZlg":{"text":"Breakfast is not the most important meal to me but Two Chicks was the best.  Wish they wer","useful":0,"cool":0},"KfZvsnn0naZwHvYLA9KJEQ":{"text":"No idea where the 5 stars come from, all 4 of us were so disappointed in our meals and out","useful":0,"cool":0},"9Z-USC0NCmUq7ts6v1Pr0A":{"text":"Cutest place for breakfast! We are there about 4 times during out stay in NOLA. Very frien","useful":0,"cool":0},"qGGrYP8Zdj6LyO6L1eyzrw":{"text":"Stopped in for breakfast/lunch on a Saturday. Place was busy but we only waited about 2-3 ","useful":0,"cool":0},"Ph60eq_KAf67EXWWHFbYuA":{"text":"I had the crab cake benedict on my first visit. The poached eggs were good, the roasted po","useful":0,"cool":0},"NJmqpG_U7q44U8C0oiBl0Q":{"text":"The food is not anything you've never had before but it was very good!! I had the cafe bre","useful":0,"cool":0},"ctIQqLku2Dk6KsrTeAsDNw":{"text":"Such a cute little cafe in the business district! Perfect for breakfast, brunch or lunch! ","useful":0,"cool":0},"5q41BIt1_50Spv863ukzzA":{"text":"The place has a bit of a wait time and the service is good. The Barnyard Eggwich is a deli","useful":0,"cool":0},"5JEEw0ak9i4A8HnYiMNwkw":{"text":"Cute cafe with healthy breakfast alternatives.  Had a strawberry smoothie (pictured)- it w","useful":0,"cool":0},"dB6mUJlas6uZww9aQh27Iw":{"text":"Came in for brunch and wow!! Great service, great food and the ambience is amazing! They h","useful":0,"cool":0},"ekDj_K0zJccHpyoBtJERIw":{"text":"Found this gem while staying for the 2020 College Football National Championship Weekend. ","useful":0,"cool":0},"3p7Uvv6awjY444axe9O42g":{"text":"CoZy little spot. Great staff and great food! So far i've come back every morning to have ","useful":0,"cool":0},"dsX7NhuVBxFA51jwwdOSEQ":{"text":"Went here twice while in New Orleans (Gravier Location) great food and service. Yummy juic","useful":0,"cool":0},"i8gTdpOy2axOE1oCo6qXOw":{"text":"This place is by far a gem you need to go to. I'm sure during busy hours you might have to","useful":2,"cool":1},"dF7V0KiTIp3uWEhoanBjYA":{"text":"If I could give no stars I would. We visited this morning (6/9/19). The wait was super sho","useful":0,"cool":0},"5-2I8ZBrkE8U2-rxtawElA":{"text":"My food was so good, that I'm still sitting at the table to leave this review while my wif","useful":0,"cool":0},"OlDZ13ghahqTXD3u7ewGqw":{"text":"Awesome place to eat. Very relaxing environment. We will be back next time we are in New O","useful":0,"cool":0},"I5e4UhP1MmBC0zxJP5my8A":{"text":"Stopped in here for a quick breakfast and was greeted by a very attentive hostess and wait","useful":0,"cool":0},"AcLgLtHzpu7diNpsWcaSmQ":{"text":"Great service but the food was soso. I ordered the crab cake Benedict and the crab cakes w","useful":0,"cool":0},"qU3vQR0X3zpwkFRP2DlEog":{"text":"How refreshing to find a great breakfast place with incredible choices that didn't cost an","useful":0,"cool":0},"ayTyMaU4fJkDW2LDtonnrg":{"text":"This has got to be the BEST place to get breakfast/brunch in NOLA! It's clean, crafty, and","useful":0,"cool":0},"4x2UTB_4-_IZL7n0w_ydzA":{"text":"Nice atmosphere with quick and friendly service. We tried all three benedicts and really e","useful":1,"cool":1},"tU3NvaTmfqfmZywvJER2wQ":{"text":"Amazing food selections and perfect presentation! Really helpful ladies when I asked about","useful":0,"cool":0},"8TK6-A6aoajn10uGMZbqGQ":{"text":"This place is so good! Came in on a Sunday morning, only had about a 10minite wait. The in","useful":0,"cool":0},"lYMDRwhAZ11FxVPDYhrd-w":{"text":"Wow - what a nice surprise. Came in with little expectations for breakfast but was blown o","useful":0,"cool":0},"88lNnfWpCrzpMsuhHC5S-A":{"text":"I came to this cozy little cafe for weekday lunch with a group of about 11 coworkers. We h","useful":6,"cool":0},"W3wMNLKnpEwgU3jREz6lLA":{"text":"We ate breakfast at two chicks cafe and enjoyed it so much we came back for lunch the same","useful":0,"cool":0},"t8eOhjtCGJ0qh-ucxmsE2g":{"text":"Quite possibly the best breakfast I've ever had in New Orleans! Iona knocked it out of the","useful":0,"cool":0},"iCc1HJUO96kZlllLw4VCWg":{"text":"The sunny side up eggs, wheat toast, bacon, potatoes, strawberries, shot of espresso, and ","useful":1,"cool":0},"lpBrdlVSTDGCLXB_xvmDqQ":{"text":"My group stayed a few blocks away and this was our go to for a late breakfast. Friendly se","useful":0,"cool":0},"poyQ90AyBc3iz_qjzS2PpA":{"text":"Great food great service. We are from Cincinnati and decided to take a walk until we found","useful":0,"cool":0},"P1bQiuHmhpAzf-2A7dyZEw":{"text":"Had an amazing relaxing breakfast! The whole staff was so nice. Our hostess Ashley was ama","useful":0,"cool":0},"7wdtaVZJuRetPbT-pHje9A":{"text":"We love NoLa specially their gastronomy, since most of the Cajun food here is fried (but d","useful":0,"cool":0},"x3HxJmqgLuwJHyygOAzgCw":{"text":"Had breakfast here this morning. Great place and so cute. Food was ridiculously good and o","useful":0,"cool":0},"4dnJJ3Gb6ahjajc8YJeDNg":{"text":"BBQ Shrimp and grits were on the sweet side. Not really how I like my grits. But plenty of","useful":0,"cool":0},"wC66B9SVDoZ-fK_ZiYIMew":{"text":"I love this sweet little cafe. Breakfast and lunch only. Food is fresh, clean and deliciou","useful":0,"cool":0},"rkkBjtaMio02XkoqDO-mqg":{"text":"I recently visited New Orleans & Two Chicks Café over Memorial Day Weekend. I ordered a fr","useful":0,"cool":0},"2QTv8tRC6JNdwSRE-4n6Iw":{"text":"I was in New Orleans for the first time and found this spot by my hotel we went to check i","useful":0,"cool":0},"3T6oyV_MbS60h4BxiBcNKA":{"text":"Easy to fond great place. The food is very good service is perfect. Thank you Ionna to ser","useful":0,"cool":0},"HJocy1rxLg38oDLKM4GAcg":{"text":"Two Chicks Cafe is one of my favourite breakfast spots in the city and now they opened one","useful":0,"cool":0},"KTv5EGgbcChryT5Ly3668g":{"text":"The service was excellent! Your asked if you wanted crispy or soft bacon. Are you kidding ","useful":0,"cool":0},"wgy-cQuSa4gMNTphTkuw0Q":{"text":"I have the crab cake Benedict and ginger sun juice. A good healthy meal to start my day.","useful":1,"cool":1},"C0Y1Lhk6cRn1l5hEMr-20w":{"text":"I went to this cafe on my last morning in New Orleans. Wow I really missed a treat on my o","useful":0,"cool":0},"qHFTxZF5kXic8GfRe8PGLQ":{"text":"My wife and I stopped at this place which was recommended by our hotel near by, we were pl","useful":0,"cool":0},"fJt85BHMFVcVkPG08lyCAg":{"text":"This little restaurant was perfect for breakfast.  We came here twice during our stay and ","useful":0,"cool":0},"WXnYriY2sJUxFZO0JaWwWA":{"text":"We are here twice while staying across the street at Aloft.  Great food!  French toast was","useful":0,"cool":0},"UKIpW2hPnQUunWYhumm4XA":{"text":"This cafe was right around the corner from our hotel, and very convenient, so we decided t","useful":0,"cool":0},"QM0kqLu08VTYc66lMB66xg":{"text":"Awesome food. The chicken club is my favorite.","useful":0,"cool":0},"VvVYi2eRCyG17B2QVGqF3w":{"text":"Two Chicks NEVER disappoints! From the service to the food it is a 20/20 must go to it and","useful":0,"cool":0},"IgG4V-bypJucYwK8U0x4_w":{"text":"Here from out of town. Ordered the make your own omlette with crab and brie. It was AMAZIN","useful":0,"cool":0},"bFzEnq3E9Xlnw4TwfbSomA":{"text":"Shrimp po boy with a Thai sauce was yummy. Great dining room, friendly and laid back staff","useful":1,"cool":0},"PyXIbFbcsltXt2gL8e0HCg":{"text":"Stopped through on our way to Florida. Absolutely loved this place! The food was amazing, ","useful":0,"cool":0},"3jFD_29mYC758VEaOamobg":{"text":"Awesome breakfast spot in CBD! Very low key spot and the food came out quick. The french t","useful":0,"cool":0},"W4MGGz3V17m8zQiFsDB6fA":{"text":"Having lunch here for the first time. I ordered the Under The Sea Omelette. Besides all of","useful":0,"cool":0},"TbHtNKp3xOju4bTYkfH1EQ":{"text":"Came here after wandering for a while. Great sandwiches, salads, and smoothies. Nice littl","useful":0,"cool":0},"k3ZNDjzP_e4ACHB-CBNVNw":{"text":"This place is great. My wife ordered the grits bowl, I ordered the breakfast po boy, both ","useful":1,"cool":0},"34KITq4RjEEt-k5V4e0CPw":{"text":"Delicious breakfast. Tried tHe Under the Sea Omelette, just really good. Hit the spot afte","useful":0,"cool":0},"GnepwdTkZpMSr3xYPYzr9g":{"text":"Two Chicks Café is a cute place with fantastic staff. We enjoyed our meals and the 60's-70","useful":0,"cool":0},"OCXJ8HKNvutyr03Cauv8Xw":{"text":"Very nice breakfast. The food is tasty and prices are good. Service was good with friendly","useful":0,"cool":0},"PlG-Zjf8bATlWz7W6e2T-Q":{"text":"Beautifully decorated, warm and cozy!! And the food was delicious!! Goat cheese and veggie","useful":0,"cool":0},"ValiScyilbRzCfyfVRwTqQ":{"text":"So I came twice here for breakfast during my three day to New Orleans and it wasn't three ","useful":0,"cool":0},"PvBah-bNcN7sjF4gtcZ5CQ":{"text":"Food was amazing and service was great! There specialty drinks were fresh and delicious. G","useful":0,"cool":0},"ucUN8EmwEc6thFiKAuT9gg":{"text":"It's my first time in NOLA and I came here to have breakfast and I cannot say enough, this","useful":0,"cool":0},"kP9pFMhvtZDdCDmEaSkMrQ":{"text":"Cozy; that's the best way to describe this place. It's decorated with bright colors and pi","useful":3,"cool":0},"6HuEcWk89TQF3Jl23AeCyA":{"text":"This brunch spot was suggested by a friend and I was not disappointed. It was not a large ","useful":0,"cool":0},"f-q81-82qRjbdRZUx4rqqw":{"text":"Amazing food that was right near my hotel! Great healthy options at a reasonable price. I ","useful":0,"cool":0},"bAmDxxIuMX8EgKMiHupigA":{"text":"The best breakfast we had since a long time. The place was very cute, the food was incredi","useful":0,"cool":0},"vCaHysZ0BBIUuCGPU0DF-g":{"text":"Simply amazing. We had a great time. Bit only is the location cute, and in the middle of t","useful":0,"cool":0},"Es-RLHlPzxyIwGSoTDULfQ":{"text":"I absolutely love this cafe. They have two locations and both are amazing! If you are ever","useful":0,"cool":0},"FjcfIvDAFaj95-ygJkoO7A":{"text":"Iron Chick drink, Thai Shrimp PoBoy with a vinaigrette salad, everything was so good. My m","useful":1,"cool":1},"epcATgEp_PdgnzCZQ0aYjQ":{"text":"Great breakfast omelette and coffee. Ashley is very sweet and attentive as a server. I vis","useful":1,"cool":1},"7OAATvDeQyQOTtU-PXyY2Q":{"text":"AMAZING food! Outstanding service by Ashley. Great vibe in the restaurant. The shrimp and ","useful":0,"cool":0},"OoG7cYtW93x7xKVvaYAp6w":{"text":"I was looking for a place for breakfast in the downtown area. Two Chicks Cafe was near by ","useful":0,"cool":0},"UmmVc4pJiHGRRWwx4NcxUw":{"text":"This restaurant is a good place to go for a simple breakfast. Not welcoming (rude actually","useful":0,"cool":0},"n8_p0AXPSIX_TW_JcqngNw":{"text":"Good Papa's French toast breakfast. Friendly staff and cool inside vibe. Worth checking ou","useful":0,"cool":0},"Vv2pAIwt_oXh_k0Dyqj4MA":{"text":"Tish, our server, was amazing! The food was delicious and so fresh! You could really tell ","useful":0,"cool":0},"UuncZ-SA0KDSgyvgGoLTVA":{"text":"Tish R was our server and she was amazing. The food was great, as always. We will be back ","useful":0,"cool":0},"ypdYzWB9HR5ovBPgQM0R3A":{"text":"Warm, relaxed vibe for breakfast a couple blocks from French Quarter. Excellent menu optio","useful":0,"cool":0},"NmZHhB3gCY3YWo2K8hsB4Q":{"text":"I love this cafe! I had the crab melt with Brie and it was hands down the best thing I've ","useful":0,"cool":0},"KxmHCnk2xKvKM82f3Bmdqw":{"text":"This place is a hidden gem! The food was amazing, drinks amazing, I would definitely come ","useful":0,"cool":0},"8-vNmY8zKWDUF4wWJhaPeg":{"text":"Hello All, this place is awesome. Good service, nice smiles, and very good food. Not once ","useful":1,"cool":0},"RoEqQPr5Oz9Eh4XK23kWsQ":{"text":"Fantastic breakfast stop. The staff is bright and friendly. The under the sea omelette was","useful":0,"cool":0},"YQayBhvAJ_vbfoQuMTiCUw":{"text":"The fun and quirky style of this place was surprisingly homey as much as it was an adventu","useful":0,"cool":0},"mMPVgJ7ML9KAvYaUXBGu_w":{"text":"I loved the food in this cute charming place. Hubby and I got the crab cake Benny & the Fr","useful":2,"cool":1},"JctKnr__AUI5zTCi1FU-Wg":{"text":"Beyond amazing! The servers go over the top to make sure you have a great experience. The ","useful":0,"cool":0},"_aEChGbsn0AYzLWQcXiQRA":{"text":"Amazing breakfast and smoothie!! Love the vibes of the space and energy of the staff. Will","useful":0,"cool":0},"8iyMIZ2arlUzPiuIUXD8wg":{"text":"My husband and I flew into NOLO yesterday and immediately went looking for a good breakfas","useful":0,"cool":0},"_tOz5F98zM_mcJ3WyEfUAA":{"text":"This place is amazing. Great food and very friendly. We've eaten here twice on vacation an","useful":0,"cool":0},"U0emsCSASkDGI7txaQaihg":{"text":"Food was fine -- pretty typical diner food. The waitress kept calling my spouse and I \"bab","useful":0,"cool":0},"1CkOol4SWKlpK92XNgStZA":{"text":"The best shrimp and grits I've had!  The crab cake eggs Benedict wasn't really good but th","useful":0,"cool":0},"_MJr5nCZM8DjRT_c8JOPUQ":{"text":"Solid spot in NO.  Breakfast was outstanding.  Very high quality and large portions.  Real","useful":1,"cool":0},"l4ntSge9Hyx-mDlyrhd8dA":{"text":"Staff were kind, food was ok. My husband had an omelet he really enjoyed but my crab cake ","useful":1,"cool":0},"kwnlN6xp0Ce_uMghpM2tkQ":{"text":"This place so good we at there 2 mornings in a row while in town for the National Champion","useful":2,"cool":1},"ksqiZHqH4VdYr4fw6CC-bA":{"text":"Great omelet! Perfectly cooked all the fruit was very fresh and the pancake was fluffy and","useful":0,"cool":0},"gxsWAR0aziF0nsVe7fFGZg":{"text":"What whaaaaat! Two  off da hook. Get you some juice and breakfast ! If staying within walk","useful":0,"cool":0},"wO8qZPj15x2vP_qPrgbciA":{"text":"Loved the fresh options, the chia pudding did not disappoint. They also have gluten free c","useful":0,"cool":0},"HEsbJBU2U_hWDhV8oVK4jg":{"text":"THIS PLACE IS AMAZING. They have real maple syrup with there incredibly light and fluffy p","useful":0,"cool":0},"INCfyDeQaSd6EwQ-aWqLBQ":{"text":"This awesome brunch spot is in the Central Business District, where we stayed this trip. N","useful":0,"cool":0},"qU5rZcuPZabIROrwKbMY9g":{"text":"Came here twice on our week long visit. Food was tasty and service was great both times!! ","useful":0,"cool":0},"R4abRCXHNGCpY-fKzqjpqw":{"text":"The food here is amazing. I came with a group of friends from Atlanta on vacation for the ","useful":0,"cool":0},"vph7fyEnc5zSHxiEoaJrcQ":{"text":"This great little cafe was right near our hotel, but I didn't know it until the day before","useful":1,"cool":1},"CoOUddtE1Rybn2F35Ndf-w":{"text":"While visiting NOLA we walked here from our hotel. The place is small, eclectic and GOOD! ","useful":4,"cool":5},"KTwejiPpSs1YraX_BHwSiw":{"text":"I'm shocked I didn't know about this spot. One of my family members made me aware of this ","useful":1,"cool":0},"vnkJuGc3xWY7F3O2VY782w":{"text":"Great menu which includes breakfast all day. A friendly place for breakfast or lunch.","useful":0,"cool":0},"Q8F4jMUfjAsm584YwAU-iQ":{"text":"The food was so good we went twice! The French toast is amazing and when I said I wanted E","useful":0,"cool":0},"zCHrAxIiO_BXzteDYxiCpA":{"text":"Super cute restaurant with very nice employees! We were served quickly and our waitress wa","useful":0,"cool":0},"HiskR0DFFO91gKyrIMfKIQ":{"text":"Great experience! This cafe was close to our hotel in the CBD and we came in for breakfast","useful":0,"cool":0},"xY3YsiX-O7wovO0tLawlFQ":{"text":"We go there by recommendation... the food was great, the 2 girls working there was very po","useful":0,"cool":0},"-sFgLarOE3I1UNWEaeHwxA":{"text":"This place was Great! I went out of my comfort zone And tried the crab meat and shrimp\nOme","useful":0,"cool":0},"6YwGAWtxrBL3DQlv7NWqtw":{"text":"We ordered in for Sunday brunch this past weekend and for the most part, it hit the spot. ","useful":1,"cool":1},"vKUuyQhlY8m2y2pBjk3vmQ":{"text":"Outstanding food and fast friendly service\n\nI tried their Cafe Breakfast which includes tw","useful":0,"cool":1},"5tfklELbhSGpV1zVxscBcw":{"text":"Really great food staff were amazing and friendly. \nFood was amazing. Prices were average ","useful":1,"cool":0},"YHb3PZcayzIvnzw9r4F9_g":{"text":"I had an interview in New Orleans, this place was across the street. I went in not knowing","useful":1,"cool":1},"D7Ei_7asg03lxDu1xoId7Q":{"text":"Soooo good!\nHad the crab  Benedict. It was perfection. \nStaff was very nice and attentive.","useful":3,"cool":1},"Pj3n3G2VwAzSbAOnFz31uQ":{"text":"We loved it! We waited less than 10 mins at prime brunch time on a Sunday. The server was ","useful":1,"cool":1},"ZZ2wvIVvsC1w8kB34LVKaA":{"text":"Best bfast IN TOWN hands down!!! Staff are all amazing and work hard to make a great atmos","useful":0,"cool":0},"vnZdXl0VZiJDhGOW6BabHw":{"text":"Got a recommendation and the place was crowded, seemed like the right move. It wasn't. 10 ","useful":1,"cool":2},"h6N_4k_wDf6ijsuo_k3wcA":{"text":"We stopped here while visiting for a quick breakfast and it was great. We got the Cafe bre","useful":0,"cool":0},"hn8EXaE9eKWyaScMfRNbIQ":{"text":"Absolutely fabulous!!! Great presentation, flavor, and service. Our server Michelle was ve","useful":0,"cool":0},"eb0AldHvm5xUwKG_mY-v7Q":{"text":"Decided to eat here and had a late start to the day. Got to the restaurant around 10, and ","useful":1,"cool":1},"gcpFHoDbYdO0JjuHiOatPg":{"text":"Wish I could leave no stars. Unfortunate we came on a Monday morning when they had 6 table","useful":0,"cool":0},"GLGMPLkuf-rKc4n1DWVNbA":{"text":"Everything was great, they put a little different spin on almost every dish, prices were r","useful":0,"cool":0},"gu0AO1i8__I2RfpWdq0MHg":{"text":"On a recent trip to New Orleans we actually walked past this eatery on our way to another ","useful":1,"cool":0},"6ST-POBUlKhJXio6U3jyiQ":{"text":"We were visiting from Florida and decided to give this place a try and did NOT regret it. ","useful":0,"cool":0},"zITwmM4O_Rdf15MppxphsQ":{"text":"Breakfast was different but very good. Service provided by server (Young black girl\nWith a","useful":1,"cool":0},"gPheunQrDZKIukhb3vI4_Q":{"text":"This is a great breakfast place. Absolutely great (very fresh) food and service was amazin","useful":0,"cool":1},"Qjw5ZxLm_85yg7su99FrCA":{"text":"Great breakfast In CBD right near where we were staying. It's a second location and newer ","useful":0,"cool":0},"vc0iDO45LDN_ozjItQQeOA":{"text":"Showed up with a big party.  They got us situated and seated right away.\n\nCoffee was good.","useful":0,"cool":0},"eJ_10-kUCGEK2okC2P7Jyg":{"text":"One of the best restaurants for breakfast and lunch in New Orleans. The drinks are made fr","useful":0,"cool":0},"rlF8FmLG8_rrWeu--HcoBw":{"text":"Fantastic food, atmosphere, and service. Came here several times while in town on business","useful":0,"cool":0},"rycENV1gGSIn1PDu_H0JKQ":{"text":"I visited Two Chicks Cafe in December 2020. I received prompt service and the food was exc","useful":0,"cool":0},"pVkJPs_pPSmYp3AVnWWp6Q":{"text":"We went here with my girlfriends, the ladies were great, service was friendly and candid. ","useful":0,"cool":0},"iIH5NmRAeKqK9TzM74Z-Ag":{"text":"The breakfast tasted excellent and the portions were good. The service was also very frien","useful":1,"cool":0},"nwiGnEYsBvQAta6HzIGQsQ":{"text":"Great food, service could be better. Seemed like a pretty big tourist spot as it is very c","useful":0,"cool":0},"WPVLcGM7NTYmEwZ0svlF8w":{"text":"Excellent, clean, creative food and cocktails.  The service is genuinely friendly.  Even t","useful":0,"cool":0},"gXQpjk0fsmQ2tIq8UBUx6A":{"text":"Simpley the best in quality and value in the downtown area. Great staff too!\nGrits were be","useful":0,"cool":0},"rP-58AjMnex7tq4LRC-hYQ":{"text":"The food was excellent. I had tried it twice while in NOLA, once via UberEats and then I w","useful":0,"cool":0},"RsXhDukz9P9M72fCsRyK1A":{"text":"A great little breakfast joint with friendly service. Awesome grits & French toast. Would ","useful":0,"cool":0},"cgLtC3gRSS9vsUB9Oh6lzQ":{"text":"The restaurant was within walking distance from our hotel. The waitstaff was kind and wore","useful":0,"cool":0},"ifwlmuALRTJkG_-hEMKgRg":{"text":"great service, laid-back atmosphere, incredible food! Will return!","useful":0,"cool":1},"0SCHEcut7_JnQqZ-2r3ksg":{"text":"Welcoming and warm diner-like service. Their breakfasts are simple and so tasty- exactly w","useful":0,"cool":0},"R1OyhIXVM03llbagEXgq9Q":{"text":"The ladies on staff run this place so well!! You could see they work as a team to make sur","useful":0,"cool":0},"1EyMthBCwRhsfnBwUDH4JA":{"text":"It was recommended we attended here for breakfast. The server was great and helped guide d","useful":0,"cool":1},"Lvu3DHzCaLBwL5jcmq-hww":{"text":"I do not want to exaggerate when I say this might be the best breakfast I have ever had. W","useful":2,"cool":1},"mAxMIdtcK6IRQcP3PSfafQ":{"text":"Woah! The food here is amazing!! My egg sandwich was on a fresh made croissant. It had egg","useful":0,"cool":0},"o0mv6AT4FIT1mhF_kLrpig":{"text":"Service and atmosphere here was awesome!! Ulga was very attentive, kept my fresh coffee fu","useful":1,"cool":0},"6W6ZhNeKYbkMdjo-brYt8w":{"text":"Great spot for breakfast short walk from hotel. Everything was amazing! Friendly service, ","useful":0,"cool":0},"27sALy9jj3opzrmSmpsGMw":{"text":"I actually really hate giving this place such a bad score because the staff was so friendl","useful":1,"cool":1},"QLF1YwZqdDOnsGTUj79WWw":{"text":"This is the cutest, best brunch place I've ever been to! Service was quick, staff was so f","useful":0,"cool":0},"9IqY9QgtQhNvjyWEFeUkQQ":{"text":"The restaurant was around the corner from my hotel so I decided to give them a try. Overal","useful":0,"cool":0},"smQ7_j8B8ORLdZn8PHGdrg":{"text":"The one star is about the Covid 19 protocol not about the food.\n\nWalking in trying to get ","useful":0,"cool":0},"E9N0ChPC8MXLkpedu8nrlw":{"text":"Loved it! Had the crab cake Benedict and fresh juice which were both delicious. Very warm ","useful":0,"cool":1},"RhDSgm59sILNCWAIoK7Mhg":{"text":"Enjoyed our breakfast here when visiting New Orleans. Lovely cafe and great service! They ","useful":0,"cool":0},"K2ZU1ElckGiyTUe2sxE2mQ":{"text":"Food was amazing!!! Service was amazing!!! 10/10 \nWe went on a Saturday around 11:30am & t","useful":1,"cool":1},"af6ffYbbx7hClVzs-pL52A":{"text":"This place is a must try! Love the eclectic decor and the wait staff is great. The food is","useful":0,"cool":0},"jGRhg5VUdaDW2Tb6qAsjpQ":{"text":"I wanted to try the Convention Center Blvd. location, but something would always deter me ","useful":0,"cool":2},"FqG6XYig_eFSf3y08Eh8yg":{"text":"UPDATE: 8:53 AM Turns out it was the manager I spoke with earlier, and I now know that it ","useful":0,"cool":0},"41okZC7JT0Bg4_tEre8G9w":{"text":"I had the French toast & potatoes! The French toast was by far my faveeee!!!!! The waitres","useful":0,"cool":0},"ruhcB2zpY6syp0B8366BAg":{"text":"One of my absolute favorite spots for breakfast in the CBD! Have never had a disappointing","useful":0,"cool":0},"mNZxf3XM3_QAybSgIquMFA":{"text":"My first time coming to this location (I've been by the convention center one a couple of ","useful":2,"cool":0},"bKaZTwcceuZttk4025tcBw":{"text":"This place is a small gem on west side of Canal St. We had crab cake Benedict with cheesy ","useful":0,"cool":0},"R0cDgT0H3NJ1HU5c8yWZig":{"text":"Walked to an amazing location and boom...a blue wall!!! Lol, \n\nActually, this location is ","useful":2,"cool":4},"fez-JaxfzgrYB-hY8RcqzA":{"text":"Cute and quaint spot with yummy food! Service is great. Hostess truly pleasant. A little w","useful":0,"cool":0},"6p3DRRTMLMLJFFEJzLeLxg":{"text":"Fresh delicious food   Fresh smoothies and unique items to try. Staff very attentive.","useful":0,"cool":0},"SFdyWD_2DOB94IapFoYn-w":{"text":"Great breakfast.  I ended up coming here two days in a row.  The first day I had a MYO ome","useful":0,"cool":0},"-sN4KFQtz-axlUfAT5A9vQ":{"text":"Our hotel recommended this place for breakfast bc it was around the corner. We almost went","useful":0,"cool":0},"AQa7vCPuMdE_jPDqTPbqvw":{"text":"I was on a Girl's trip to celebrate my best friend's birthday. The six of us had brunch at","useful":0,"cool":0},"xPsFWxyBiuK0uQqD9A9xMg":{"text":"Living across the street, we frequently eat breakfast or lunch at Two Chicks, and every--a","useful":0,"cool":0},"U8DaGzl_CIqjeogi2lJrIQ":{"text":"Wonderful food! We had the Hatchery sandwich with added bacon,  the seafood omelet and fre","useful":0,"cool":0},"lVfdFJzQxZTgPwTQGWrwdw":{"text":"Love this place .. quaint shabby chic... I had just a classic  breakfast but it was excell","useful":0,"cool":0},"eDq_s9qar7hd4xfj1d9COw":{"text":"I decided to pay this place a visit because the name/sign was so cute! Opens at 8am and ar","useful":1,"cool":0},"k6UmX3Zv2_6Gk_iBAlj7Jg":{"text":"The location was very convenient for me. It was nice to take a short walk out fo the quart","useful":3,"cool":0},"8jr4l_iUeJOAuJPOtpRCDg":{"text":"We were there on a late Saturday morning.  They were busy, but we waited less than 5 min f","useful":0,"cool":0},"iVXqBnfTLXL9aPjIJGPLCQ":{"text":"French toast was amazing!!! Egg white omelette with turkey and mushroom also delicious. I ","useful":0,"cool":0},"xv06FhH6rYtvkr3ZszMWEQ":{"text":"Really good breakfast!! I was visiting for the Labor Day holiday and I had a blast this re","useful":0,"cool":0},"keXri7XAfqJkZTQyZb9ecQ":{"text":"Looking for a breakfast/lunch place and some locals recommended this place.  We had to wai","useful":0,"cool":1},"j3_kmavH-VAHco1syKFGyg":{"text":"Do yourself a favor and try this place.\n\nTwo Chicks is just all the way around awesome. I ","useful":0,"cool":1},"Et723PUDJDwM44vvH9NCoA":{"text":"Lovely staff, amazing food. Can't ask for much more! Got the chicken omelet and must have ","useful":1,"cool":1},"908JLCqgyg4xrz0BuhCK3Q":{"text":"Kind of a yelp let down. \nPretty basic diner type breakfast. \nNot at all bad but don't und","useful":0,"cool":0},"JODKfgVawwj_l1_2m55-Rw":{"text":"Came based off of all the good reviews via yelp. Unfortunately, I cannot repeat the trend.","useful":0,"cool":0},"DIttd7DuDvHCjv-7CoZvKQ":{"text":"Loved this place. Food was obviously fresh and house made. We went for breakfast twice. \nB","useful":3,"cool":0},"xGrZ0V_xG6YZxTG6FLo-7g":{"text":"The French Toast...WOW!!  Great food, great service, very friendly environment.  Will defi","useful":0,"cool":0},"RApwuTk5NGkQPgMH97qdhg":{"text":"I found this little hidden gem thanks to a friend.  My normal breakfast place was very bus","useful":0,"cool":0},"NEtZ8fMgHAW241LRqzvLnA":{"text":"Amazing!!! The food is delicious. The service is amazing, helpful, and extremely nice, the","useful":0,"cool":0},"MNzKohvij5Qi45MuuPKYOg":{"text":"Portions were big so well worth the prices but I found the food to be a little bland(chick","useful":0,"cool":0},"f9szbeLQxgi71ICBxoGPMA":{"text":"Fantastic food if you like low quality service. Really loved their Benedict, grits and gre","useful":0,"cool":0},"22t4l-35q59EzEm7Al9onQ":{"text":"Best cheesy grits in town--which says a lot because you can get grits almost every where i","useful":0,"cool":0},"z3W-rkrDRI82ea6H7L134Q":{"text":"We were staying at the Aloft Hotel and was recommended this place by the concierge. Nice o","useful":1,"cool":0},"xwTCboVny-DUYqHTElMm9Q":{"text":"Very good breakfast. \nNice waitress too, what more could you ask for. \nHad shrimp and grit","useful":0,"cool":0},"wxnz8BBwXfoJJ-NWyr5-fg":{"text":"Everything we tried here was delicious. We got hatchery, croissants sandwich, Nutella bana","useful":0,"cool":0},"I3rzuSASfSs97axAOcnQkQ":{"text":"Living across the street, we frequently eat breakfast or lunch at Two Chicks, and every--a","useful":0,"cool":0},"qnmNiq_BEiJ6JfSqnI4TuA":{"text":"Always like going to smaller businesses when travelling to new cities.  The cafe was a rec","useful":1,"cool":1},"A6nYlK7XIu11zJhIgobd7A":{"text":"Been here in New Orleans two days and this is the second time I've eaten here.  The place ","useful":0,"cool":0},"lpfqkXDlSsyKpPBc_hn12Q":{"text":"Wait time was short. Food was good. And our waitress was very nice and friendly. The OJ wa","useful":0,"cool":0},"GZMcmjsDMQ3AyVKiZrj7zA":{"text":"We went here because this cafe was very close to the hotel we stayed at, and it was a big ","useful":0,"cool":0},"3O1bkO3FtvxS1egRGLkhvA":{"text":"We went for brunch here because it was across the street from our AirBnB. The customer ser","useful":0,"cool":0},"izHbsd3B2Kx9Yb0po4E_zQ":{"text":"Dined here for brunch. Nice quaint, airy atmosphere. Food came out quickly, but was hot an","useful":0,"cool":0},"DrATwy9T6M1CSWI6UL6CNg":{"text":"Not only is the food excellent, bcuz that's a plus, but the southern hospitality is on the","useful":0,"cool":0},"2sZu1sdyJYBtvdZRC4d2Ig":{"text":"This cafe was right around the corner from our hotel. Perfect breakfast option if you're l","useful":0,"cool":0},"uAA-aAZoD2wMkwwn5lxYoA":{"text":"Great breakfast, awesome service - fantastic variety on the menu.   Highly recommend.","useful":0,"cool":0},"lfVSmKHe8Ps2yhLjvAJHjQ":{"text":"I am in visiting for the weekend and I am coming back tomorrow to try the French Toast!","useful":0,"cool":0},"CB9IGHwOnqfpgM0ltmubow":{"text":"Yummy yumm! This was one of my first places to have brunch at when I moved here. I usually","useful":6,"cool":2},"FIo8phLspUijQXXGJxTcLw":{"text":"The food and service here is amazing! From the start of our visit, we were greeted by such","useful":0,"cool":0},"dsKa_lZ1bVNPj5xilAcZgg":{"text":"Tried the Ritual app ( first timer) and ordered an egg sandwich for $1.00. I expected a ve","useful":0,"cool":0},"xG_KGo2bSUB6yxc1umPBig":{"text":"Staff incredibly nice, food is great and the orange juice is the best in the entire countr","useful":0,"cool":0},"9CYKEXf-3E18VpDOH5P_kg":{"text":"Upon arriving early in NOLA and unable to get our hotel room, the porter at our hotel prom","useful":0,"cool":0},"R56Zmw0JSZMFzh7gRutYYA":{"text":"Read the reviews to this place and thought we would try it out since it was right around t","useful":1,"cool":0},"hMbjnc--RHkpODv7FN1ORQ":{"text":"The food and service was great, friendly staff and our food looked so good the chef took a","useful":0,"cool":0},"QSczIWbTNuoMlEpHmmcgLw":{"text":"The French toast was amazing ! Staff was super friendly and wait time was less than 5 minu","useful":0,"cool":0},"LhZ8K1cUhh0KDXHBnCOzRg":{"text":"The food and service was absolutely amazing. I tried this place for breakfast as a last re","useful":0,"cool":0},"uJGOU-xf4Lbe4qkhLin7PA":{"text":"Breakfast was delicious! Scrambled eggs w/Gouda, ham and although I was disappointed the b","useful":0,"cool":0},"IEZstzxO5mg0AXYBkp3Muw":{"text":"This place was a walking distance from my hotel- The Troubadour and I have to say, it was ","useful":0,"cool":0},"YF82xOOfB5mFOJdDLGkOJA":{"text":"Had brunch here on my stay in New Orleans and it was fantastic.  This is definitely a hidd","useful":0,"cool":0},"qPqavX88g1z4ub1b7t8uQA":{"text":"So so good. Best orange juice I've ever had. Amazing service. Delicious food. Fresh juices","useful":0,"cool":0},"qCUpULT_L2NNKJYT8ZRiRQ":{"text":"My girlfriend picked this place. When we walked up to it I was like \"Why are we eating at ","useful":1,"cool":0},"Q5IC3z5dV5b26VWUAb_cnA":{"text":"One of the most raciest restaurants we have ever experienced, we are a diverse group and t","useful":0,"cool":0},"DF30CKTOvLjbCPrp0wXcKg":{"text":"This place does not disappoint! The lemonade is a must! The French toast with bananas and ","useful":1,"cool":1},"evsdQoRaP6knKnw8Hk8AQA":{"text":"Located on a side street in a not-very-retail-centric area.  They don't take reservations,","useful":0,"cool":0},"m5hWXtPGp6Idco7cIAF2SA":{"text":"I'm not usually a breakfast person but the food at this place made me do a little happy da","useful":1,"cool":2},"Lfz6CLqG8Z6dYGe0DZX_-w":{"text":"Best service ever!! As another Yelper noted, Ashley is one of the best servers...ever. So ","useful":2,"cool":1},"0kJCV4kEsf5Z9i-uiHknjg":{"text":"We checked this place out after trying a couple other more expensive breakfast spots and w","useful":0,"cool":1},"NtRRB-rRORruxRyykdwfsw":{"text":"Eating out with 3 little kids is challenging at best, especially when you have to wait unt","useful":1,"cool":0},"KjXXcYfs7WBnZ9XpA0D15Q":{"text":"I've never had such fluffy eggs! I built my own and it came with toasts and a side of seas","useful":0,"cool":1},"vDpu7bBgriq_bkW95f69Kg":{"text":"Excepcional! Totally recommend this place. Best breakfast ever in downtown Nola, I was sta","useful":0,"cool":0},"r7xb_P1GfqSzS-SZQDtgvA":{"text":"Really enjoyed this place for breakfast. Husband and I both ordered an omelet (different t","useful":0,"cool":1},"4g1Te6meKYHvnKPYwIxKwA":{"text":"This meal was one of the first proper ones I had when in New Orleans and man oh man was it","useful":1,"cool":1},"dn1LGsf5nlpy3fWc5jMYpw":{"text":"A fantastic small bustling cafe made special not only by the great menu/food, but by the s","useful":0,"cool":0},"g1MSyMoMyOpdL-los48dvA":{"text":"What a lovely breakfast spot! Everything and I mean everything we was was absolutely delic","useful":1,"cool":1},"nm2ux2t6pMVZKp1Wk62QdA":{"text":"Great, friendly service. Loved our waitress. Food was amazing. Had the seafood omelette an","useful":0,"cool":0},"0ieBhUuXI08oX5FPrmkYGw":{"text":"The best shrimp and grits I've ever had!!! The service was phenomenal and the cafe super c","useful":0,"cool":1},"7Lk-2ksqkHMK55GG98gImg":{"text":"Second day in Nola and decided to try this place for lunch. There was a bit of wait but th","useful":1,"cool":0},"taisWIKtBdzKXr6rzBBnTg":{"text":"We arrived around 9:40am on a Friday. Service was great and the food was delicious. It was","useful":0,"cool":0},"Ozy-KmiBClm0mXRTZQP2hQ":{"text":"Loved it. Very popular and busy. Worth the wait. Food came out hot and fresh. Will be back","useful":0,"cool":0},"6fMS_u0CmJn5ecuvBnh2eg":{"text":"My first visit left me unsatisfied, even though I really liked the feel of the place and t","useful":0,"cool":0},"7OQUKBDpXnfp5yDY3qi5Rg":{"text":"Big things come in small packages. We were looking for a good place to grab some brunch on","useful":0,"cool":0},"9qXAaUcB2r36exWkL6J2tQ":{"text":"The food was just okay per the rest of my party, I could not chew through the chicken brea","useful":0,"cool":0},"IHeLPb8wmljgq5v4xP_JKQ":{"text":"Best brunch we had in New Orleans! It was our mission to find some of the best food in the","useful":0,"cool":0},"I4HRXICCetFUAtCqDjLs0g":{"text":"The food is amazing had the breakfast bowl with Gouda with the best pancake I have ever ha","useful":0,"cool":0},"rTariNqpwE8XBfgU1zyarA":{"text":"Nice little place with excellent service and good food!  I had never had Eggs Benedict bef","useful":0,"cool":0},"FEET7bAdWdAkKu8k1RKpjg":{"text":"This is an amazing breakfast, I built my own omelette with veggies and goat cheese... SO g","useful":0,"cool":0},"7QrsxWN7KFHDXgdgRg2gEQ":{"text":"We had an amazing breakfast here twice on our recent vacation. We tried the French toast, ","useful":1,"cool":0},"6ncy04s3aye6f_2Yele7hg":{"text":"Love love this place . Yummy food and well organized and managed restaurant. Not too long ","useful":0,"cool":0},"tC3-6Bx4kXuaSUJe2SMs7A":{"text":"Right around the corner from our hotel. Pretty good ambiance. \n\nPoBoy is was good, husband","useful":0,"cool":0},"qvprs9U7C29Skh7jaCdVHA":{"text":"The best omelette ever!!! Head to New Orleans and make this your first stop. You can add s","useful":0,"cool":0},"YKDnYYFbpZDPYIobdfThRQ":{"text":"I must say NOLA has some of the best food I've eaten since traveling around the states. I ","useful":3,"cool":2},"s3HRnXUTWdh4RQRw5tqhwg":{"text":"Great service. Fresh squeezed orange juice. And definitely different things to choose from","useful":0,"cool":0},"xRqbkGjLFAMK6qvfIaPm5g":{"text":"Great food, staff was friendly and professional, and fantastic service. Highly recommend","useful":0,"cool":0},"O_ytnZb06jvoOOjJ-Ml0OA":{"text":"This restaurant was a short walk from our hotel and made for a nice brunch spot. Great foo","useful":0,"cool":0},"keqEJWNRmj_pm2nFY-urkQ":{"text":"Wow! Me and my daughter ate here for brunch today. It's a must if you are nearby. In the p","useful":2,"cool":1},"16t7MChXf1QKNq42lwpicA":{"text":"Unbelievably great breakfast! Little spot away from tourists, but worth the walk. Coffee w","useful":0,"cool":0},"iIcrq6D9s8HoIf3pI8s7QA":{"text":"WOW ! what a great find the food is amazing here I will be back every time I come to NLOA ","useful":0,"cool":0},"MqCT0LvzCMAUrVGXzHRang":{"text":"I enjoy the breakfast omelets. First time was a veggie omelet-excellent like it so much we","useful":0,"cool":0},"iVfGPvxcn8xL5pMkg_7Qpg":{"text":"Nothing fancy but it's great food. The service was attentive and friendly and our meals we","useful":2,"cool":1},"_Y35GFU4Dpm74Rxu4zjBJw":{"text":"My husband and I were here for vacation and stopped in to this little cafe for breakfast..","useful":0,"cool":0},"e-ctiYPEGSSAA5AMnrzTmg":{"text":"Very nice cafe in the New Orleans.\nHad breakfast back to back and really enjoyed the atmos","useful":0,"cool":0},"rkaBE_CJqgPidvmRFsbXvQ":{"text":"French toast was amazing!!! Very nice wait staff. Green smoothie was delicious as well.","useful":0,"cool":0},"I3uuIIJg1v08-sjLnluO0A":{"text":"Great place for breakfast. We had an omelette, pancakes and crab cake eggs benedict. All o","useful":1,"cool":0},"StTf_Sy8WUyXX5jH6rek-g":{"text":"We are here several times for breakfast when we stayed just kept coming back! So delicious","useful":0,"cool":0},"JtEkaay4IiMhtGGYxgIAsQ":{"text":"My review is based solely on the service as I didn't eat,  I sat there for like an hour, n","useful":0,"cool":0},"jjX0ew4AxXGMstQcdfH79Q":{"text":"So good! Perfect little place to get breakfast. They have smoothies and juices! The strawb","useful":0,"cool":0},"M3uOEFFIKAufoGx06D9drg":{"text":"Great food and great service. Don't miss the cocktail menu. The Bloody Mary had a sweet st","useful":0,"cool":0},"N_ey2pIQgBSWPAsdO9zfwQ":{"text":"Great service, excellent food, and a charming and inviting staff. What more can one ask fo","useful":0,"cool":0},"xUtAZsqQrY9XTxdJgM2iUA":{"text":"Pretty good. Our table had the egg & cheese croissants, grits, fruit, the french toast and","useful":4,"cool":3},"e7mHqtuqwoyBcCYqcCxz1g":{"text":"Tried this place for the first time and it was delicious!Such a cute place with a casual, ","useful":0,"cool":0},"bZxv2OMU3oicalabHI3-mw":{"text":"OMG! You don't want to miss this one! We had an incredible breakfast and awesome service i","useful":0,"cool":1},"UPjbHEks_C4Yel_X6HaWuA":{"text":"Stayed in hotel around the corner and had breakfast twice. Both times service and food wer","useful":0,"cool":1},"9cN3u6CCGfxpsZZVkZcfCQ":{"text":"Great atmosphere and very tasty food. I'd recommend the BELT breakfast sandwich, good port","useful":0,"cool":0},"aTBWYVduWkCMDrW2sYz2Jw":{"text":"Living across the street, we frequently eat breakfast or lunch at Two Chicks, and every--a","useful":0,"cool":0},"TyvSOP89vJeLc1mRXOohXQ":{"text":"Breakfast Poboy was Delicious! Bread was fresh and the portions were plentiful! Would defi","useful":0,"cool":0},"flcDLxaIJy4JPhJ9xBwCAg":{"text":"After searching what felt like a hundred breakfast places on Yelp, we landed on Two Chicks","useful":2,"cool":2},"1try42mvPBfXLUqYOZYTcQ":{"text":"Excellent eggs Benedict with crab cake with a spicy  hollandaise sauce and the coffee was ","useful":1,"cool":0},"vgsbxNjIi3rpkHl-LpLmjw":{"text":"Great place for breakfast. We had the grits breakfast bowl & the Under The Sea Omelet w/ p","useful":0,"cool":0},"eRyesG462ufybUeWnPeAlQ":{"text":"Super friendly staff - very vibrant atmosphere and the food was outstanding.   We had panc","useful":0,"cool":0},"sX0wYkl5cYQ9vVtJFCIurQ":{"text":"ABSOLUTELY FREAKING AMAZING!!! I wish I could give more . When you visit, you have a pleth","useful":1,"cool":0},"cjzysCM6qQJSg52RVVKSVQ":{"text":"Great breakfast and lunch menu with great service (thanks, Nayomi!). I had the yogurt parf","useful":0,"cool":0},"taNh53g39p330UlJ5iCHvg":{"text":"I never post reviews and I am sorry for the length of this post.  But, if I can save just ","useful":1,"cool":0},"_q9trxvju-30y_KJXynPjA":{"text":"Beyond amazing food and excellent customer service.  \nI really don't know where to start a","useful":1,"cool":0},"JidKPMbWfmY6Qau-s9Ut3A":{"text":"Cozy breakfast place near bourbon street. \n\nThere will be a wait bc the food is so good. H","useful":2,"cool":1},"v2QWr8CMszayUQm7px6PkQ":{"text":"On a recent trip to the Big Easy we found this gem of a diner/restaurant near our hotel! I","useful":3,"cool":2},"p6M3P5mq8vBJWCuGPt_mjQ":{"text":"Great food and amazing service! I would highly recommend it. Had fresh orange juice which ","useful":0,"cool":0},"Wn451NuxNO_qHOXITFwVbg":{"text":"food is good!!!\nThe service awesome!!\nDuring the COVID -19 I will say for sure that's plac","useful":1,"cool":0},"D9Yo8i0xe6_THFJc8IvFmQ":{"text":"This place is super chill. I like the atmosphere of it. The food was good. It didn't blow ","useful":1,"cool":1},"6hl0L9Zl6IVDid87RidqBA":{"text":"This place is the real deal!! Incredible food meets incredible service. I had the BBQ shri","useful":0,"cool":0},"H8cpOgshtZjFscG_04VPJg":{"text":"We had the shrimp and grits and the thai shrimp po boy.  Everything was fantastic! The gri","useful":0,"cool":0},"M7cfWJzqKx8I33ssnJTtXA":{"text":"Hidden Gem! \nWe ordered the Crabcake Benedict on croissant, the grit bowl with bacon, and ","useful":1,"cool":0},"cRmXTwAwMSmCFly5ibD8Vg":{"text":"Breakfast is the most important meal of day and always the best one for me! \n\nBeing that I","useful":3,"cool":1},"9xzxP5NlM0mapZlAZdhuhQ":{"text":"Food: Good presentation, tasted fine, coffee bland\n\nService: very poor\n\nThe waitress (Ashl","useful":2,"cool":0},"LEHvR8KxpgD-Tuq-OIxK5A":{"text":"This is my family's new favorite breakfast spot. Everything was delicious! The waitstaff a","useful":1,"cool":0},"_uQnUyuffIVU0AIG4k-60Q":{"text":"Starting off my long week in New Orleans, my group stopped by this family-style diner in t","useful":2,"cool":1},"MWHUnB8-gnJEPxL2UynMCw":{"text":"Excellent place.  Great atmosphere. Attentive staff.  Glad we came.  A definite must visit","useful":0,"cool":0},"WQ2ZMigOr8sf6baCetFkOA":{"text":"Delicious breakfast. Spot on. Farmhouse omelette and veggie Benedict are amazing! Highly r","useful":0,"cool":0},"hl5kqIxlErRyV0FjvbvRlw":{"text":"Reading the reviews on this restaurant is very deceiving the food is horrible, I'm confuse","useful":0,"cool":0},"5B7O-tzqYmeDi-tD9MN9MA":{"text":"Great little place. Everyone is so sweet and helpful. Food is delicious and portions were ","useful":0,"cool":0},"BmnjUe1AnNqbghp4H179UQ":{"text":"Amazing service. Our waiter was so nice and the food is delicious and reasonably priced.","useful":0,"cool":0},"dQe6WyjIRsR431ptseyWCw":{"text":"Pleasantly surprised, limited menu but good food and good service.  I wasn't too hungry so","useful":0,"cool":0},"-1b1S6Z8edp3wLvKKF1DAw":{"text":"Excellent place to grab a bite. I was wondering around and stumbled onto this place. Nice ","useful":0,"cool":0},"igoIoudtUbu2Azikv6Snfw":{"text":"Had breakfast there this morning. All I can say is wow. The eggs were delicious and the hu","useful":0,"cool":0},"3wma-RunFSwbyyoNSm6lew":{"text":"Great service the orange juice is phenomenal the breakfast was fast and quick it won't I l","useful":0,"cool":0},"pB_00-GTdmC2TSXbx_QQlw":{"text":"First time there with Lawrence on our weekend in New Orleans.. the breakfast was amazing..","useful":0,"cool":0},"w1lRy8PC8x8uSf_yApebzA":{"text":"Came here in the AM on Fat Tuesday trying to get a good, hearty breakfast... Overall the f","useful":1,"cool":0},"XN5i95qPtf91IPu9xACVYw":{"text":"My hubby and I really enjoyed our visit here during Bayou Classic weekend. You can't go wr","useful":0,"cool":0},"TEl7APJX_a7oXvtDkl_HRw":{"text":"First clean and welcoming restaurant in New Orleans. Came in about 9:30 after the morning ","useful":0,"cool":0}}