{"oUY7e3ioUQ2eBAWvnbrCMA":{"text":"Something happened to this place. It used to be good, but it's gone really downhill. My re","useful":0,"cool":0},"aqgW4Ma1YDZ8PB_Ekf1Nqw":{"text":"The food was good. The mesclun salad was full of pecan bits and great scratch dressing. Se","useful":0,"cool":0},"RSVG4qV8Oylew9zZ0CQpkA":{"text":"Nice that the restaurant was only a block from our hotel.  Stopped by during happy hour an","useful":0,"cool":0},"9jz9qID_xnMcCRFoXYZotg":{"text":"OMG I could live off this .... the BBQ shrimp perfection.... the boudin......  great food ","useful":0,"cool":0},"HtJGeo0CXtWGYDV9vWqJdg":{"text":"Moving up!  Now at 4 stars from my original 2.  This place is really starting to rock it o","useful":0,"cool":0},"b-g414fDUXjZ_OsHhih_kg":{"text":"Very good service and good food. Had a pizza with half pepperoni and half mushroom that wa","useful":0,"cool":0},"Uf-s0LCkMlOCj6BAvUBEYw":{"text":"I was starving during Mardi Gras (came here on 2/9) and made this quick stop. This slice o","useful":0,"cool":0},"wFzQvig5nZ3DWZp--Z3cFQ":{"text":"Great service. Server was right on. Pizza - bacon, basil & garlic - medium crust - wasn't ","useful":0,"cool":0},"URgDRm0UNtJObIRsKefvcw":{"text":"Slice has great, heaping, dripping, melty slices of cheesy goodness, topped with whatever ","useful":1,"cool":1},"b9ihvL3OJtaxKYtftJ8uVw":{"text":"We stayed just a few blocks from Slice.  My hubby likes to try different pizzas wherever w","useful":0,"cool":0},"Q3Ue4_lb0yAiyahkrvyiBA":{"text":"Super casual, fun atmosphere with great pizza and friendly service. The prices are fantast","useful":1,"cool":0},"jcgeM5ohDZc5ESHurQVMrg":{"text":"When we arrived at our bed and breakfast just around the corner, we were given suggestions","useful":1,"cool":0},"kOF4z86vDB7zxwcSxFDaFA":{"text":"Good salad, generously topped pizza (ok tasting) and friendly service.","useful":1,"cool":1},"fL-xvSbgHTRNlS6Z_Nloeg":{"text":"Slow...\n\n...as...\n\n...hell.\n\nSeriously, I just called on my way home from work and ordered","useful":0,"cool":0},"i2rg_OCAlC8dvAWSDn5NJA":{"text":"This is such a perfect pizza dive. The pies are spectacular, with high quality toppings an","useful":1,"cool":0},"bej608PUI1NZjh2Fb7Og0Q":{"text":"This place is amazing. It's a local place near the hotel I was staying in. The staff at sl","useful":7,"cool":4},"ntPWBVwBxsX7uXkm3HBsDQ":{"text":"We were the only ones in the restaurant and the temperature was near-arctic. We kindly ask","useful":2,"cool":0},"SKYnM_rdUpZQdq-mKFWbYA":{"text":"Great pie, the size is very generous and the taste well its outstanding.  The delivery was","useful":0,"cool":0},"XR87S3mSQec4bbot5nnQGA":{"text":"So great we went here twice in one day.  The food was tops and so was the service.  Always","useful":1,"cool":0},"oG3xRvFXfSaN4jgdKPyVmQ":{"text":"Food was pretty good. Do yourself a favor and try one of their Popsicles. I tried the chee","useful":0,"cool":0},"hHF74-hsgvvp1pk7_6cgfQ":{"text":"There was nothing wrong with this place. I think it was a nice place to grab lunch on Sund","useful":0,"cool":0},"TNA-pfQFUtAKISMNJqLghg":{"text":"This weekend I went to Slice on St. Charles and it was absolute chaos. I called in a to go","useful":3,"cool":2},"MA7kQ-z-f8Shp2F-8x1yNw":{"text":"Great pizza!  I love that you can order a single slice of any pizza and try some different","useful":1,"cool":0},"RKvIlYE_wQO2ztjskHVrug":{"text":"We enjoy Slice, it's a neighborhood standby for Pizza. Very disappointed with the recent c","useful":1,"cool":0},"jbya3ZG5v97rvy8vKxQk1A":{"text":"Ugh! That's what I get for not reading Yelp before going to a restaurant. Came here tonigh","useful":3,"cool":2},"yS-UItUWRjVweav4fnTlJQ":{"text":"Excellent food, and Isabella really took care of us.  Excellent service.  We ate there a f","useful":0,"cool":0},"wHOGlkM-Df1u3760kmibAg":{"text":"So satisfying. EVERY. TIME. This is one of my favorite spots to hit whenever I'm in town. ","useful":0,"cool":0},"jxqShedyyU_wjuQD9KvPuQ":{"text":"This location of Slice Pizzeria is smaller than the one on Magazine Street. It feels prett","useful":9,"cool":9},"y2WWJAQD9hMv4bay_Xi-nA":{"text":"I've been here before and been very satisfied but this was absolutely the worst experience","useful":0,"cool":0},"jJncHuUO5E8u1ozxf9UuJg":{"text":"Being so picky with pizza, it was a huge relief to find this place! Best pizza around!","useful":0,"cool":0},"GhoRrs8Car0m4CXT1pUxhg":{"text":"Not impressed. It took 1.5 hours to get our pizza delivered and when it finally came we we","useful":0,"cool":0},"xnF2Jvrh3JdiXh4oyDbbow":{"text":"Service was fast and friendly. \nArugula salad was good.\nG's pasta dish was too oily and ok","useful":0,"cool":0},"K4t0Rg-6AH4R_IppwkC73w":{"text":"The happy hour beer special (M-F, 4-7) is amazing. For 5 bucks you get a pitcher of NOLA B","useful":1,"cool":0},"BApga9Kfp84rBKps8W3nJw":{"text":"i'd like to give slice a bad review because i really can't stand listening to an entire mo","useful":2,"cool":4},"kIV0BE4UomtD3ZaVTgJ2Yw":{"text":"Holy Moly!\nBest pizza in the Garden District!\nWas in NOLA for our honeymoon in Jan and new","useful":1,"cool":1},"5Mh3JdEqDlET6HSKWqp-lw":{"text":"Very happy we came here.  Our first night visiting New Orleans, we passed so many scummy-l","useful":0,"cool":0},"NusUuJ7pVnKw1o-46wsbnQ":{"text":"If I was just rating on the food, I would give it above a 3.5 maybe 4. The pizza tastes go","useful":2,"cool":0},"OVeSA7no8KpyVwiO_QBXhQ":{"text":"Love this place!  The chicken enchilada pizza is AMAZING! Our server, Anna was great!!!!","useful":1,"cool":1},"ADvMLFhudTwHl1npCPqVpg":{"text":"Nice staff, great food, cheap eats, no wait (if you don't hit it up at peak hours). I'm de","useful":1,"cool":1},"8QXz4l4hEx2KlHCxyatNng":{"text":"My friends and I ordered delivery here, we thought the pizzas were going to be normal size","useful":0,"cool":0},"hUzk0pXbCRqGgXtaQaHq2Q":{"text":"Damn good pizza. Come to NOLA for the seafood but stop here for the pizza. Worth the walk.","useful":1,"cool":0},"bRxV0f1jvuZolswO4eSGzg":{"text":"This is my favorite pizza joint in all of New Orleans. My friend doesn't like pizza, but o","useful":0,"cool":0},"9G2V0c3MUCWT0kkkA3XxEw":{"text":"Me encantó la pizza. Muy buena la atención y agradable. La pizza que pedí fue la veggie, 2","useful":0,"cool":0},"e9Zom_4u0JxjqQR4Y1AKlA":{"text":"This was my second visit to Slice. I must say I was disappointed in my experience this pas","useful":0,"cool":0},"08KLXbqIJ8ilyxN2J5X36Q":{"text":"Atmosphere of the restaurant was inviting, but the pizza was okay. My wife and I waited ov","useful":0,"cool":0},"T_SihZZ8ufMvOC0seB5FCw":{"text":"I went to Slice on St Charles. It was great! The atmosphere is very laid back and intimate","useful":1,"cool":0},"sV17UHpi6O5XM0BpbPvbQw":{"text":"Sportsman pizza was incredible. \nPepperoni pizza with andouille sausage - wow.  \nWaiter wa","useful":0,"cool":0},"Xuiayv6P6Ot1CQDlJasqpw":{"text":"Came here twice for lunch during my 15 day boondoggle in NOLA. 11:45 on a weekday it was h","useful":1,"cool":0},"c5bCy_goBG5BIPAoaS3OFA":{"text":"I was soooo disappointed. Called at 6:50pm for a pepperoni pizza. Was told and hour and ha","useful":0,"cool":0},"Vra6EqacQvwjehQ876FiKw":{"text":"This is a very good pizza place but they can be very very slow.  Service is very friendly ","useful":1,"cool":0},"md_7Ag_jGwCBvZFr_VZX9A":{"text":"It seems rumours of Slice's decline are true. I was informed by the stoned-sounding person","useful":2,"cool":0},"QL5RIrIugMRfivdzzkQuEA":{"text":"Delish pizza and Salads. Ate here twice and could have eaten here again. So yummy, and pre","useful":1,"cool":1},"8ZahStwMeCRpLg4RN5nuvA":{"text":"UberEats completely messed up our order. Our food literally disappeared. We called Slice d","useful":0,"cool":0},"uYL3MocZ3TQpQJe3V29Iew":{"text":"So I'm in New Orleans staying exactly 7 blocks away from this pizzeria . I usually don't o","useful":0,"cool":0},"Eq7Y05hVJ9wnVXEiMvQr1Q":{"text":"The manager is the most rude individual i have ever met.\n\nSelf interested and mocked me in","useful":3,"cool":1},"DhhlZOETbZUN-uWw6hD2mw":{"text":"Food is good.  They are very slow at getting your food out!  I am sitting at the bar now s","useful":0,"cool":0},"Yjz1_6qorRiwVb-KNZPj9g":{"text":"It's as good as I remember it back in college. Hot and crispy crust.   Solid supreme pizza","useful":0,"cool":1},"wDGpj3JOIf9ag1CKmvokBQ":{"text":"Yay no thick crust. Had tossed I believe. They have lots of varieties. Order it by the sli","useful":0,"cool":0},"_7jgWm3iQlBOO7SQRZdZKw":{"text":"Visiting from Miami. Ordered delivery.. pizza sucked. Just wasn't good pizza. Super soggy ","useful":0,"cool":0},"1ZDDW4j6s9eolUBYxfjsMw":{"text":"Amazing pizza and you have to try the BBQ Shrimp Poboy.  It's a hidden treasure in a menu ","useful":0,"cool":0},"65tldBqOXcDFgFkhWxRbzA":{"text":"They were out of the two starters I ordered (boudin and gumbo) and 3 of 9 beers on tap wer","useful":0,"cool":0},"t6DASEXgLDX5HiiF9oa9AA":{"text":"Lots of pizza joints in the city, but this place does a great job melding the different fl","useful":1,"cool":1},"T1yRWNusJaVPGCpWk8BmTQ":{"text":"Great pizzeria!  Seemed to be full of locals, which is always a plus. My husband had the m","useful":0,"cool":0},"qYq3MbSj2932RpjB5CQLeQ":{"text":"Excellent pizza a bit pricey but worth it bring back the old specials :) @@@ bring it to t","useful":2,"cool":1},"r3WNviQRnv8HWCuuNo0GeQ":{"text":"Great I love the pizza here .. parking is a lil rough but other then that everything is gr","useful":0,"cool":0},"tXKoz7vpNE6OvQRVqEAEEQ":{"text":"Good location, cozy, excellent food worth the wait","useful":0,"cool":0},"JqCHi8iidGIlxQbBz2EoWA":{"text":"This place satisfied my late night munchies. Anna and the boys were awesome--super welcomi","useful":4,"cool":1},"gRu6m2FBjbpqy37_ZJfcrA":{"text":"Love the fact that you can have a fresh slice of pizza made to order. Had the meat lovers ","useful":0,"cool":0},"Lc3uXun1ye6vCDfcHx0sDA":{"text":"Great pizza, and helpful service. Two slices and I was stuffed! I would go back again.","useful":1,"cool":0},"Q7JQWxQElcl5dK0JIzcHrA":{"text":"Great pizza by the slice location with some really good pizza combinations.  I recommend t","useful":0,"cool":0},"0JSMshKPsDcXc6Z8zMHWrQ":{"text":"The first time we ordered delivery, no problem at all. \n\nThe most recent time: \nquoted del","useful":2,"cool":0},"dw9b2x2falj8dcFhZLdHnQ":{"text":"Stopped in for a late dinner last night...had the Caesar salad, the Fresh slice, and the h","useful":0,"cool":0},"R2luULu6j4T5n8O4T4y-VQ":{"text":"We love the thin crust pizza!! We have never had anything but absolutely positive experien","useful":0,"cool":0},"lZ86pm-4b03SQZ3ivCvYcA":{"text":"I'm not 100% sure whether the name \"Slice\" refers to the pizza or to the long, narrow shap","useful":1,"cool":2},"tvpVWbxtRy8CCLdLCwd5yQ":{"text":"Love this place.  Where else can you try speciality pizzas by the slice.  The prices are v","useful":1,"cool":0},"l1D3ZPC7mEZFtv0rXtppyw":{"text":"Slice is fighting to overtake Reginelli's for my favorite Pizza in the metro area. The Piz","useful":2,"cool":2},"VRmxHcmgmd8jN0q-vXRtKw":{"text":"Soooo good. It was nice to have the option of just a slice of pizza, and a wide selection ","useful":2,"cool":1},"dkC4MDaKDknYOV6uiYX_OA":{"text":"I have such a crush on Slice! Wine Wednesdays hooked me in, distinctive toppings and toast","useful":1,"cool":1},"ABUTfIE4-fIOdio6ABgeHw":{"text":"love to eat here they r solo good even the salads are great\naparreb apparently our view is","useful":0,"cool":0},"lCWBWnVfdIYBv0nZS0gf7w":{"text":"Payed a visit to Slice while staying at a B&B on Prytania St. The white pizza was awesome;","useful":0,"cool":0},"cZD1uxwniWfRALFn75_72Q":{"text":"Amazing food and it's priced well.  Service was great and the waiter was honest about how ","useful":0,"cool":0},"PrlszbiBzYiP5M_4VqOQ8w":{"text":"The service puts this one over the top. Everyone was very friendly and the place had a 're","useful":1,"cool":0},"BNq_k-YkkzhbxoCb5bW5sQ":{"text":"They deliver now! God be praised! Hence the four stars. As for the pizza, it's better than","useful":0,"cool":0},"PtzBpDun6MleHRkbFHfhpg":{"text":"FINALLY, I find a place in New Orleans that seems not to be teeming with tourists ... toug","useful":0,"cool":0},"iZvPXp2GiaCYewcAZHCU2A":{"text":"Decent place overall, the margherita pizza is decent at best. IDK if it was to much sauce ","useful":0,"cool":0},"6_ZqMIJl-b9oTjF4JuYAyw":{"text":"How can this place be only 4 stars! UNDESERVED! We had the \"D-Luxe\" pizza delivered via Ub","useful":0,"cool":0},"E2X-uwi7tj7Jfn8U0KxARw":{"text":"I was surprised when I first entered this establishment.  The waitress reminded me of the ","useful":3,"cool":2},"fdPwDUfN67BfxHX9leTNEA":{"text":"Stopped here on Tuesday afternoon for a late lunch: one of their specialty slices and an A","useful":2,"cool":1},"gTgBVXiZU_e7VD4WyJg7MQ":{"text":"I visited Slice wanting some good pizza while in NOLA for a conference.  The service was f","useful":1,"cool":0},"hSjZ0pUtHe4RqK-sVA_k7A":{"text":"Exceptional pizza! I particularly like the special with everything on it. The pies are lar","useful":0,"cool":0},"J8VSy1jlFEH3yffybg2Wmg":{"text":"All pizza in New Orleans must be compared to the greatness that is Pizza Delicious and thi","useful":2,"cool":1},"2eEEHCI5QbT_dZyFH92nqQ":{"text":"I like to keep my pizza simple and the Slice pepperoni calzone is as good as it gets. Abso","useful":1,"cool":0},"fNErV8lhMygt8hVStWu_IA":{"text":"The food here was pretty good and the portions huge.  The only thing that dissappointed me","useful":1,"cool":0},"wXBX-0Bn0ouwjoFg0uY36g":{"text":"The service was great! The bartender had a full conversation with us...we felt very welcom","useful":0,"cool":0},"RqTkfgNqAblnbyC4OWLNUg":{"text":"super tasty pizza and I am from Philly so I know pizza lol","useful":0,"cool":0},"I2PggoA955nAWmiAyELeRg":{"text":"As someone from Chicago, I would consider myself a pizza snob. I usually eat deep-dish piz","useful":6,"cool":7},"-tvVC0B5kYBOdSqWFJh9PA":{"text":"I was with a group of people and we ordered cheesy garlic bread, BBQ shrimp, Ceasars Salad","useful":2,"cool":1},"RuM04m1R5YWor4TFhPss7w":{"text":"Awesome service. Polite staff. A fun atmosphere. We had the Margarita pizza and it was del","useful":0,"cool":0},"Sd-qKb_HhWs4EW_DdDjfMA":{"text":"I love this place. The calzones are the best I ever had, the pizza is very good and everyt","useful":0,"cool":0},"fUH59ADVHFfqrnM7Y8nVQg":{"text":"Pizza was great, gumbo even better! And right next door to the inn we stayed at!!!! Awesom","useful":0,"cool":0},"NUkmS2Q-LMNth33LiOKZMg":{"text":"We came back here 2x in 16 days while we were here in New Orleans!\n\nI know pizza's not wha","useful":0,"cool":0},"ghI2iTrbRPWxmvOWmv9azQ":{"text":"I came to Slice on the recommendation of a friend and I'm not a pizza aficionado by any me","useful":2,"cool":0},"OUUZEBwAFiwzGl9vAfNfdw":{"text":"OMG I could live off this .... the BBQ shrimp perfection.... the boudin......  great food ","useful":0,"cool":0},"Guru8Fx7CdcEVhYrrhzIOg":{"text":"Great pizza, love that you can order by the slice to experiment.  They have some creative ","useful":2,"cool":2},"IYNLNNNAok8wO9uCz-NfGg":{"text":"Extremely disappointed during this visit. We are regulars at Juans and frequent the slice ","useful":0,"cool":0},"SzNWZmp2WXYU5E8Tc0zA7Q":{"text":"Sooo good. Sooo sooo good. Try the alligator sausage. Yum!! We also had the spinach, sundr","useful":0,"cool":0},"PWZVIcIugZanS1MBXZqQ4Q":{"text":"Great pizza - just as good as other reviewers say. Good service. Good salads. Decent price","useful":1,"cool":0},"KEXIDfFq8U4to8TkWb0v3Q":{"text":"The pizza was OK. I've had a lot better. The place smelled like a moldy basement and messe","useful":0,"cool":0},"VO1OFIcqe9RfiRitGcBJvg":{"text":"Chianti happy hour $3.  Good pizza, with unusual options.  If you want to break out of a p","useful":0,"cool":0},"c9yuNy6obJy2T43JwfQAcw":{"text":"Great pizza!! Had the Hawaiian pizza--delicious! Arugula salad very tasty. And Bloody Mary","useful":1,"cool":0},"QhoiqdwbPzBwXfKD2IK6eQ":{"text":"I couldn't face one more conversation re: dinner. After a long day of work & school, stand","useful":6,"cool":2},"h4e9VNSaT1MIGTFLfcyCUw":{"text":"Let me start this review by saying that my \"par\" for pizza is Star in Houston - the best I","useful":0,"cool":0},"lJldSIkBXfL1MzHzsOxwOw":{"text":"I had actually never eaten here when my boyfriend brought me to this place a few months ba","useful":2,"cool":2},"EZ2ddo0lomazXLHbuFYAxg":{"text":"A great dive pizzeria. Twice I got the Sportsman, once as a slice and again as a calzone. ","useful":0,"cool":0},"7eaGelTgA4iY1X7RkhPBsw":{"text":"This place was FANTASTIC!!! I started with a caesar salad and then had the BBG calzone wit","useful":0,"cool":0},"MuXbnfPNlzPpJNMl-WXQwQ":{"text":"Love it. They had a macaroni and bacon pizza my son loved. \n\nThe food was good and fresh. ","useful":2,"cool":0},"ur00cARpKJery36ZGV1Jgg":{"text":"Above average pizza. I used to stop here after work fairly frequently, as it's right by my","useful":2,"cool":0},"g6vSRnUQ-4PfQI78jbhFVA":{"text":"I keep trying to get into Slice, but every time I go, I keep getting another reason to not","useful":0,"cool":0},"jhGmMIMjfL-JxRmGXRbegA":{"text":"Wow, a good tasting pizza in NOLA. I would have gave it five but they don't deliver and th","useful":0,"cool":0},"S_xkYkv-qhy9r8sVb9ppNA":{"text":"By the 2 stars you know I didn't enjoy this place. The pizza took more than 30 minutes and","useful":1,"cool":0},"xtC3MACAfDozmIhiiyf8-Q":{"text":"I visit here every time I am in New Orleans. they sell pizza by the slice or whole pizza. ","useful":0,"cool":0},"gKxkG1kfdcYWuqfLhnAtPQ":{"text":"Arrived in NOLA for my 40th and we were staying at the Avenue garden Hotel next door. 5 of","useful":3,"cool":2},"SwLiI_9gXcdhpU2L-jyvyA":{"text":"Probably my favorite pizza in New Orleans. I love that you can get any of their pizzas by ","useful":0,"cool":0},"QlDQItFGpUDOq7wZoVjI4g":{"text":"This is the original location of Slice which has started to expand to other locations.  Th","useful":4,"cool":3},"qpOt3pr-frgUi3iPjzmDGA":{"text":"Great fresh pizza but not good for reheat!  Got the meatlovers and enjoyed it when it was ","useful":0,"cool":0},"K93P93MzKPhQkk1D8ahlQA":{"text":"I have lived many places, and one thing is for sure - NOLA doesn't really \"do\" pizza.  How","useful":3,"cool":4},"yiQWxcytjJSirNnmMbnzag":{"text":"Nice concept. ASk for Wanda at St. Charles. Good pizza. Nice size slices to share. The Ita","useful":0,"cool":0},"m5JEeHArcC9xVB97vk-1EQ":{"text":"Great little place!  We stopped in on a rainy Friday and the place was packed.  After wait","useful":0,"cool":0},"J_ApDdkRQIaJUWrzwQsn2A":{"text":"A great place to chill out, have a great slice of pizza (or several) and a few beers. This","useful":0,"cool":0},"AWtqLOOp9bAvkXcVPvanTQ":{"text":"We have been going to slice since it opened.I had never been disappointed until now. The l","useful":1,"cool":2},"urIUhWovw3lCsnS3JGYNdQ":{"text":"I can't believe we had such amazing pizza! We came from Boston and have had NY and New Hav","useful":0,"cool":0},"qYowF3tJ28csV0e2F-n5hA":{"text":"Found this place after looking at Yelp reviews and were not disappointed. We ate here whil","useful":0,"cool":0},"2jTF7rzJ43WE351jKB_Zeg":{"text":"Great food, great atmosphere, great service. Would definitely come back again! \n\nWe got th","useful":1,"cool":0},"WFcrigLBMFfskH3FXhFxSA":{"text":"It was alright. We weren't very hungry so we each just decided to come in for a single sli","useful":0,"cool":0},"p1n4fVUhGZfjQ14ePukmGw":{"text":"I didn't try their pizza, but their calzone was just ok.  I won't be going back for the ca","useful":0,"cool":0},"C0v2PnzZDjrThJsiDpTdHg":{"text":"We went to Slice after a long drive from South Carolina. The craft beer selection was very","useful":0,"cool":0},"y6p92NMriAuvtkaUkY1xDQ":{"text":"Enjoyed tasty petite salad and two slices on my lucky night tonight. Not only was all wine","useful":1,"cool":0},"1Pq1HC1J_mMWJ933FDIW-Q":{"text":"My recent experience at Slice actually prompted me to join Yelp to post a review. \n\nThe se","useful":0,"cool":0},"IZloir_YOBGiYulpdKJJiQ":{"text":"I came here while on vacation, and while the pizza alone was delicious enough for a return","useful":0,"cool":0},"88PawZAzKNrhobFQ2VSlZA":{"text":"Decent pizza, lots of great topping combos. You can get it by the slice which is nice espe","useful":0,"cool":0},"I9L4g6bPA8SY-NhrhZsUsA":{"text":"My GO-TO pizza place in NOLA.  You can't get pizza any better than this.  It's impressive ","useful":2,"cool":2},"_dwtHZ2tO0w2VMCsNL1BJA":{"text":"Went in around 8. Ordered a meat-lovers pie. Girlfriend ordered a Strongbow. Strongbow cam","useful":2,"cool":0},"H6cjtArVz55U1kQ18IS43Q":{"text":"What can I say that hasn't already been said of this place. It's exceptional. The concept,","useful":1,"cool":1},"_28a17CllmeCHWL6Plm3TQ":{"text":"We wandered in here accidental while strolling through the Garden District and boy are we ","useful":2,"cool":0},"Lq2SYu-775ziur2rKlZm-A":{"text":"On subsequent visits Slice has made up for its first-time awkwardness. And, truthfully, no","useful":3,"cool":3},"1GOU-4NUVrLseqzdey9qsA":{"text":"This is my favorite local pizza chain. Hands down. Their pizzas aren't too crunchy too sof","useful":0,"cool":0},"pTFcXMcWxCoVTNLSCXii6w":{"text":"Really good pizza - thin crust and perfect. I tried a cheese free piece with arugula and o","useful":0,"cool":0},"llmnogII9eAMKxyxdb5Uxw":{"text":"Was the pizza great? Yes\nCrust crispy and thin? Yes\nServer nice and attentive? Yes (also c","useful":1,"cool":0},"Bkze4v0y6MtJh8j4iJ8cdA":{"text":"Gotta love the pitcher special- paired with their generally good pricing, and the quality ","useful":0,"cool":0},"vq2-6Dmd1Z914IZ4PdSR7A":{"text":"Eclectic customers, and good food at reasonable prices.  What more do you want?","useful":2,"cool":1},"2HkUEkItxi_6xIdMhfhBmQ":{"text":"The slices here are really good (and fresh).  We got one slice each and shared a bread pud","useful":0,"cool":1},"9w-XjL6u8Af75r0Qe__DBQ":{"text":"Growing up in New Jersey, I have fond memories of getting slices of pizza for a dollars fr","useful":1,"cool":2},"UTn5JrnmSKoOPmp09cMskA":{"text":"Slice is awesome for kids and such a deal.  a \"slice\" is only $3-4 and they are HUGE plent","useful":1,"cool":1},"Att0r3ewzCxB4LqvyY8BxA":{"text":"I often find myself driving by slice but never had the urge to go inside.  After reading a","useful":0,"cool":0},"N_i9QBL7Gh6e3pcFK9uZFg":{"text":"Awesome! I'd definitely recommend this to anyone who likes fresh ingredients and great piz","useful":2,"cool":1},"Ka6by2BlLV9QmmobHZCR7g":{"text":"I go here fairly often during the week, and I'd suggest this is definitely the time to go.","useful":1,"cool":0},"VSLEWeW-maShfq-6jF7KDA":{"text":"The food, prices, and atmosphere are good.  We like it because my daughter can get a plain","useful":1,"cool":0},"44sAT1meFW6fQYt3TFxeZg":{"text":"So, like every fucking restaurant in garden/uptown that's not bar food closes at 9 on Sund","useful":0,"cool":0},"-Lds_OwQliz7ruKAwLYv6Q":{"text":"Great staff, very friendly.  Great pizza.  I like that they sell by the slice.  Lots of to","useful":0,"cool":0},"z46X6UgtiMjScvt1aA9shw":{"text":"Their pizza is the best thin crust pizza in town! Salads are great as well. Hope off of th","useful":0,"cool":0},"2z-S3dGt4Y1vmr3KCxjkiQ":{"text":"Yummy lunch for $3.50!  (Greek pizza slice was delicious, good music-- though loud, and ve","useful":1,"cool":1},"6Uy__5tCSopn3DEhdsMdhQ":{"text":"We decided to duck in here for a quick bite during one of the Mardi Gras parades because w","useful":0,"cool":0},"A-AMamPDENSprkcMzBcY_A":{"text":"Went there twice on a recent trip down to New Orleans.  This place serves thin crust speci","useful":1,"cool":1},"HHEy5sRL-OEo-sGlugjUjw":{"text":"Soo delicious!!!!calzone was gargantuan and the gorgonzola pizza had the right balance of ","useful":1,"cool":1},"evOrIsSnD3FdyMmJ6CS9KA":{"text":"I'm from Nevada/California so the South is new for me. The vibe of this place is off the h","useful":0,"cool":0},"Q8bVGabFAYCHA9gi2q2YUA":{"text":"Talk about an unassuming place, Slice is it. Located near Lee circle, this place is easy t","useful":0,"cool":0},"RRPYgKYe7SdDCEKf2JdALw":{"text":"One word. Amazing! Had a Spinach salad and the pesto ravioli w/ chicken and bacon. The foo","useful":0,"cool":0},"l_NQgzialFr321NWHec8Gg":{"text":"My first taste of New Orleans was Slice. Pizza, hmm... Now what I wouldve thought of, but ","useful":0,"cool":2},"v_Fz827SHvJm04PE4tZovQ":{"text":"I had the special slice (which was loaded with baked potato, garlic, cheese, chives and op","useful":0,"cool":0},"FdRUID4reT84BG6oShOI6g":{"text":"Yum!!! Nice, casual and great pizza.","useful":0,"cool":0},"rviT7vGp9Sc-xU5aeBn1hw":{"text":"Awesome place for vegans. All their dough is vegan so order any pizza without cheese and y","useful":3,"cool":1},"WLxC_YnxSzo34mosEb7csw":{"text":"Quality pizza joint in NO.  I don't say this lightly being originally from NY and love NY ","useful":0,"cool":0},"3UJ-uYKjh6Ur09r2a__kqA":{"text":"Pros:\n-good portions\n-amazing pizza, pasta and salad \n-free refills\n-super friendly waiter","useful":1,"cool":0},"WFVJLKfXWLViAMZOKmcjlA":{"text":"Slice rocks!  I go there for their gluten-free personal pan pizzas... The deluxes are unde","useful":2,"cool":1},"8NFJFoQSltNggnUyfaUPyg":{"text":"Slice is pretty good, and one of the better pizza places in the city, if not the best. The","useful":1,"cool":1},"x1UKjkARE8pKttpRQHwPUQ":{"text":"We split a half salad and a medium Siciliana Marinara pizza and it was too much food. The ","useful":1,"cool":0},"04PDBAve7PBpna-_TWv4Mg":{"text":"After being on the road for 4 hours, the BF and I we were in the mood for some good thin c","useful":5,"cool":1},"EH2t_GmHJDopibiJChgL7A":{"text":"Pizza by the slice, or whole pies, in a pleasant setting served by engaging, friendly serv","useful":9,"cool":9},"eJGIIcvKQl04Um_djbXSIg":{"text":"The pizza is really great but the staff has problems with things like taking orders and br","useful":1,"cool":1},"t5B3ca8H8CFwJmniqQ1-Cw":{"text":"Loved it. I typically prefer thicker crust but this crust is awesome. Great, low jet atmos","useful":0,"cool":0},"mFDBvp8tya62a63M1bzNHg":{"text":"I love this location because it is three blocks from my house. Hell yeah!\nWent here with m","useful":1,"cool":0},"a9jPU9MfrBuX7LakiQdjDA":{"text":"The place is a little small but the food was good. I only have it 3 stars because of the t","useful":0,"cool":0},"q3bxu2Tpmzd6K2XhZsGGxQ":{"text":"Go home, Slice. you're drunk. \n\nLast night was the absolute last time I will ever go to th","useful":9,"cool":6},"xTSNN3XfWHoDjZYVHjlsUw":{"text":"While visiting NOLA I went here three times.  It was that good, and this is from a Chicago","useful":2,"cool":1},"7ExJBeWdx3_P52CcV4WUkg":{"text":"Definitely go for the slices - their whole pies are delicious, but the crust on the slices","useful":1,"cool":1},"QRnHmRvnRuBjCY1fH-spUQ":{"text":"WOW!  This meal was awesome.  Our waitress, Jessika, was friendly, helpful,  i ordered the","useful":1,"cool":0},"V7B4tCA27M87ceTwgzesrA":{"text":"Pizza is fantastic. I got two pies to go after we walked in and my kids started to melt do","useful":0,"cool":0},"K_Eq7MMCcB1vUnkNMXz0YA":{"text":"Enjoyable pizza joint with good choices. Interesting crust, can't quite putt finger on its","useful":0,"cool":0},"yxUa18M51aJtcR-esPKzKQ":{"text":"Friends and acquaintances, I would like to express my outrage. Most of you know me enough ","useful":0,"cool":0},"VBT2TJNdUO-kuhn1rP9brA":{"text":"Being from Chicago, I'm a total pizza snob, but this place was really good and damn cheap.","useful":0,"cool":0},"rig0oR32CFwf9P51PYT3pQ":{"text":"I can't seem to stay away from this place. After all the Yelp talk about favorite pizza I ","useful":1,"cool":0},"cAUt5KyZm8m39DZNbbTk2g":{"text":"Holy heck, best strawberry bread pudding ever,! Interesting pizza options for the kids. Ve","useful":0,"cool":0},"xfjp0ivvBz2KJJP2f1HLgQ":{"text":"Sat at the bar and was served right away. The staff seems like they get along well and the","useful":0,"cool":0},"q9FQfFTFSb05S9HJL8sWeg":{"text":"When it's on, it's SPOT on!!. Great slice yesterday. They can be really inconsistent with ","useful":0,"cool":0},"BhWwHWD0KxC3atbZUPvBGA":{"text":"Had a slice of the BBG and a glass of their in-house lemonade. It was delicious! This was ","useful":1,"cool":0},"dwci2mrSIU1aDond1SB4yQ":{"text":"This place is so good. Their special pizzas are great. I thoroughly enjoyed the muffuletta","useful":0,"cool":0},"8fyEwTjhmeoRK66YZN2rCA":{"text":"Ordered two large pizzas on a Friday night. Came in a timely manner and delivery guy was n","useful":1,"cool":1},"tf-asz_wypGclLedgjYGMw":{"text":"Every chance I get to take someone here for lunch, I seem to make it happen now.  This is ","useful":7,"cool":4},"r21tV_MtYps7f8hukXuWyA":{"text":"This place is the best food we have eaten in New Orleans.  They clearly care about the qua","useful":0,"cool":0},"L5D5W4bIt2LtQ48guJMObg":{"text":"Yummy New Orleans style pizza.  We ordered a full pie we did 1/2and 1/2- Meat lovers and F","useful":1,"cool":0},"MFQyiz_9_-G9gF_YmZI-nQ":{"text":"This is pretty much my favorite pizza joint in the city of NOLa. For the price, it is all ","useful":3,"cool":0},"_os3Mk-QmGcLk1PNzkTu_w":{"text":"I walked into SLICE on a recommendation from a local when I inquired about good local eats","useful":1,"cool":1},"FhKHjYKM5G9FV1xWrfxYPQ":{"text":"We went to Slice after a long drive from South Carolina. The craft beer selection was very","useful":0,"cool":0},"q9GfpiQwxnr-dJccNVRi4w":{"text":"Amazing salads, pizza and ravioli are also excellent. I went during the boil water advisor","useful":1,"cool":1},"nHMmydIYjasi3moUHKB8uQ":{"text":"Eenvoudig restaurantje. Met Belgisch bier Stella artois. Prima pizza s. Geen mega porties ","useful":1,"cool":0},"XLg0sdVWHB3W1kp5cQ5fwA":{"text":"Really awesome, had the lasagna and the spinach salad. I usually get things togo...but I w","useful":0,"cool":0},"fMAY9if79NiZ2PUFTylCVA":{"text":"First, I must stipulate that I am an Italophilic pizza fan, so a place like Slice is start","useful":0,"cool":0},"28nPXO92WaC4QPSVIn6mWA":{"text":"You come to New Orleans intent on killing yourself on seafood and creole. When the wall co","useful":3,"cool":1},"ewvEh2Iuw3oOwJUnQCok4g":{"text":"I love, love, love Slice, especially the St. Charles location.  The food is always delicio","useful":0,"cool":0},"4xUsx0L2HeM9VGCdEjEYzA":{"text":"Slice never disappoints. The place needs a little touch-up paint and it's a little cramped","useful":3,"cool":2},"Lhcj2Yhah-9qphCidkiUEw":{"text":"Chose this place for dinner since it's close to where I was staying. Ordered shrimp bisque","useful":0,"cool":0},"Tu0ES_CaabPnqwc-tKQFgQ":{"text":"Best New York style pizza in town, hands down. I grew up there. I know. Corn meal on the b","useful":0,"cool":0},"CKIcx7Zq7eqit0OuKgzXBQ":{"text":"Simply awesome!!!! I would of gave 5 stars but the Sangria was bitter. (You know alcohol i","useful":0,"cool":0},"Gn4-BkwIBkxSiNasLjzyNg":{"text":"This place is awesome!! Anna was great fun and had us laughing the whole time. Gluten Free","useful":0,"cool":0},"0AOPODEVRyCyRNduGRBq5A":{"text":"(I have only eaten at the Magazine Street location)\n\nFor years, my favorite pizza in New O","useful":3,"cool":0},"ogywshsKQa9-hAPuEn6nmQ":{"text":"OMG OMG they made their bbq shrimp appetizer and put it over pasta in a light cream sauce.","useful":1,"cool":1},"SAc2BwkYiKi6QAo9TLocAA":{"text":"The Trucker Calzone was very good and probably deserves to be 4 stars. However when we ord","useful":0,"cool":0},"H9DhbA0YSeLmgGn9wr-Zww":{"text":"Anna was such an amazing host! She is as sweet as honey, and made a wonderful pizza recomm","useful":2,"cool":1},"ryxySIzLVOAxHxDCC2QfQg":{"text":"Some of the better pizza in New Orleans. \n\nIt gets an extra star from me because they sell","useful":0,"cool":0},"vRowH2scMXGOok2jEutBNA":{"text":"We loved this place! \n\nNeeded to grab a bite in a hurry, and let the server know ahead of ","useful":2,"cool":1},"1g0xByj2Td3d-5QviTEuiQ":{"text":"Good food good prices. Wether you want a whole pizza or just a slice anything can be made.","useful":0,"cool":0},"w_gID2v6gPT2ST84Epqd0Q":{"text":"Our first time here, sat outside on st. Charles avenue. Spaghetti and meatballs were delic","useful":0,"cool":0},"YhiJ-6UJal4sAa2vdlycRQ":{"text":"I've had better pizza in one other place - a New York hole in the wall called Sal's. Other","useful":0,"cool":0},"VObMM1Pe9vwqdM4jDqTivA":{"text":"As a very loyal patron of the uptown Slice for years I cannot begin to tell you how bad of","useful":0,"cool":0},"loHV_iovUR1LOn3sIXi1EQ":{"text":"I ordered the Margherita from Slice on a Sunday afternoon.  The delivery time was great, i","useful":1,"cool":2},"VZjzefpNdKNCrO1hDzvqhw":{"text":"Great pizza, fabulous calzones, a fun, cheap laid back atmosphere!\n\nI loved this place dur","useful":0,"cool":0},"J5NEwm6y-X7rUbMsN6Rw4g":{"text":"My quest for the best pizza in NOLA didn't take long!  What's not to love about the perfec","useful":0,"cool":0},"l5NwxHbdVSso8VzQ4DL4ww":{"text":"F-A-Bulous!  Slice has a great variety of pizzas and they are ALWAYS fresh.  Sizeable port","useful":0,"cool":0},"UwHlwYqVd0bJ6w40LUdcyg":{"text":"A good salad, tasty slice and reasonable price. Had the bacon, basil and garlic pizza (gra","useful":0,"cool":1},"o8Vgq4cY1zhm8i4gWfjf2A":{"text":"My wife and I walked a mile from our hotel to try this place out. She order lasagna and I ","useful":0,"cool":0},"F-pviHUqSRPgIUVVbKzW2w":{"text":"The pizza is fantastic. The delivery service needs major work. I am accustomed to waiting ","useful":0,"cool":0},"Rj5SaWkdATIDVxKGlA_k7w":{"text":"Devastated. We eat Slice all the time as we live just down the road, but tonight it tasted","useful":0,"cool":0},"5-y0DYqOJFW-RPVV-oWgGQ":{"text":"Pizza has been one of my favorite foods since I  was a wee tot, so I'm always looking for ","useful":0,"cool":0},"-QpKy4TdcE9jh8RH6BXvpA":{"text":"Attention parents, Slice may just be your salvation, too.  If your kids are like mine and ","useful":1,"cool":1},"K3sC504fQAnGiQ1T-bmMRQ":{"text":"I love that you can order pizza by the slice. I usually get 2 completely different slices,","useful":0,"cool":0},"7oQG33fUP2dRd5jqHfOaVw":{"text":"We went to Slice twice during our honeymoon because it was really good pizza and it was ve","useful":1,"cool":0},"ffLcXj1fCbYMfzrJxw_LDg":{"text":"Me and the kids stop by here whenever we are in the area it's small but it's very family f","useful":0,"cool":0},"rk9jGhAFozdl_E-QsontOg":{"text":"The first thing I've got to say about the crew at Slice is that at 10:59 pm on a weekday t","useful":0,"cool":0},"RgXFr_eEC94lOyaJyU3Xfw":{"text":"Went for pizza here a day ago. Ordered a couple of large pizzas. They are truly large. Som","useful":0,"cool":0},"OaZF-ZiuyD0fyp-TcsdH7w":{"text":"Excellent and friendly service. Fair pricing and a lot of food for the price. The outdoor ","useful":0,"cool":0},"NJYHbs-EcEpuDBvUAhADwg":{"text":"I ordered delivery (charge pending on credit card), was told 60 minutes, food never showed","useful":1,"cool":0},"-66Z9zuSJ1BgBJ2owpwfmg":{"text":"Ah, Slice Pizzeria :) Slice will probably always be one of my favorite pizza places in New","useful":0,"cool":0},"gkck23CLV2G2yoGejKYknQ":{"text":"WOW!  This meal was awesome.  Our waitress, Jessika, was friendly, helpful,  i ordered the","useful":2,"cool":0},"-pZjb_s2_LzbsIBjDrNCoA":{"text":"Excellent pizza!  They probably have the best crust and sauce I have ever eaten.  I loved ","useful":0,"cool":0},"RcVS_SUV356Hi6VXOZxaVw":{"text":"The bbq shrimp and caprese salad were both really good. The pizza, however, didn't impress","useful":0,"cool":0},"ScGEfl7gbXfVkCHy4EeHxw":{"text":"Good pizza, good calzones, good ice coffee and pretty location. Server/bartender was hangi","useful":0,"cool":1},"BVE9ZGNx82J333Juc8eTPg":{"text":"Well it's been a year and I did go back, and honestly I was less impressed by this visit. ","useful":1,"cool":0},"83jzby1Qp5XZPLZeAsDktQ":{"text":"As an out-of-towner in search of Gluten-free pizza, I landed here, at Slice's St. Charles ","useful":0,"cool":0},"GwLmZ3Eg0uIlMVbUWRGW5A":{"text":"Really good pizza.  Nice casual ambience, good bar selections, friendly helpful service.  ","useful":2,"cool":0},"5kbTKRELmhSOa-ZBxVtkpg":{"text":"The ceaser salad was a good size to split and the pizza we chose was the Fresh Pizza which","useful":0,"cool":0},"qYbB0aQNFFZ8CVc3fTJ4Tw":{"text":"Oh man. Delicious. I'm going to miss this place when I go back to Virginia tomorrow. \n\nI'm","useful":0,"cool":0},"pneX6jWK0nTelIkIs4jAvw":{"text":"I love love love Slice.  Their Meat Lover's pizza with extra cheese is what I always get w","useful":0,"cool":0},"u4eKoYyDRfPfr5LbI7EMZg":{"text":"Cute restaurant. We sat outside and the pizza was very good as was the salad. Service was ","useful":0,"cool":0},"YuO87n8DSKtiEZODIxFutw":{"text":"i had some darn good pizza at the magazine street location last week....","useful":0,"cool":0},"RbakG_QO7uw1nEJeopKAIw":{"text":"It's a shame that this place has such mixed reviews.  Thankfully I had a great experience.","useful":1,"cool":0},"_2J_2iLgQhTVgVuC8z_sYQ":{"text":"Slice was one of those go-to places that was on my list when I first moved to New Orleans ","useful":4,"cool":2},"Pyo7LNci4xXEL3UuQiFUGg":{"text":"Honestly the best vegan pizza around and only $20 for a large (that is really a large). Th","useful":1,"cool":0},"FHDMxTHwgZKuYwgCSWv5Yw":{"text":"Less than $10 for a filling, tasty and unique lunch.  Winning!  Two slices of pizza was pl","useful":0,"cool":0},"Ws5G1ftPgX43ir3LfGFVPA":{"text":"Love Slice but sadly I discovered there's no more Happy Hour. What?! Please bring it back!","useful":2,"cool":2},"_flFR0Qjgh_2t6PUnRwH0g":{"text":"Not true Italian style pizza, but pretty good for American-variety pizza. Service is typic","useful":0,"cool":0},"po_5ASvgvhI0pMK_cXUzvg":{"text":"Just back form Slice and we are not sure if Yelp reviews take price into consideration or ","useful":0,"cool":0},"R-_F_JRa5b-NaOzzp1L0bw":{"text":"Our second time here this week while visiting NOLA. Very close to our hotel so made it eas","useful":1,"cool":1},"fPaF4X6z0gJxqp274BWbMw":{"text":"I was expecting some seriously great tasting pizza but was a little disappointed.\n\nI'm in ","useful":0,"cool":0},"wgurNp1JKvmNcamI0H8H7A":{"text":"I'm not sure if I just caught Slice on an off night, or it is has drastically gone down hi","useful":0,"cool":0},"DrRdoW7zy00yzy2s1tKPOQ":{"text":"ALways good pizza! Lots of good options for toppings. Similar to NYC style, but not 100%. ","useful":0,"cool":0},"ytn19cgGUCH7usTUthnMdg":{"text":"The two ladies at the table will have THE TRUCKER!  The trucker?  Oh yes, the trucker.  A ","useful":7,"cool":6},"YTFyZu11mHH1PgNKPYeo3w":{"text":"Very good pizza, served whole or by the slice, with a colorful decor and unique music mix.","useful":0,"cool":0},"AL6V6JKspWCmpfdjgjUPBQ":{"text":"Let me start off by saying I'm not including the pizza in my review. We went with your sta","useful":0,"cool":0},"EQDXHSra0m0plxu560vVxA":{"text":"Wow, it sure is difficult to find anything sour about this pizza haven.  It's located righ","useful":3,"cool":0},"7fD7laiv8z1qX2MCYiZA4A":{"text":"Came in for a drink Saturday afternoon. Will and Jess were great. They were very friendly ","useful":0,"cool":0},"WgwiBuPOooPUBO-fbGWKaw":{"text":"Nestled along st Charles Ave, this is my favorite spot to eat a pizza and my favorite pizz","useful":2,"cool":2},"C7CYOb2PrR0w1FaG-NYFSA":{"text":"They were delayed, was quite irritated, but they made it right! As usual the food was grea","useful":0,"cool":0},"WB6Bdv7zd840lYr1mOBV6g":{"text":"Just got home from my Honeymoon in New Orleans. We spent 5 days there. We went to Commande","useful":1,"cool":2},"0COmvRnRPuesW7TGLmevNQ":{"text":"I have to give Scottie props! I wasn't sure what to order and he suggested the margarita a","useful":1,"cool":0},"Y6a0WQAGQ6vfcLHjCqp_NQ":{"text":"I'm pretty pumped that I'll get a free glass of wine with my next check in. I wish it were","useful":1,"cool":1},"x_BX4LtKLu0O0TTwa22ocg":{"text":"Slice is everything you're looking for when it comes to satisfying that pizza craving. The","useful":0,"cool":0},"SSj6TqZW0cb-5N-IWEqoEw":{"text":"My preferred pizza spot in my neighborhood. \nSometimes I'll crave their bacon/basil/garlic","useful":2,"cool":1},"cZ6SHo_6ufqQKxdz5EWpzQ":{"text":"My boyfriend and I went there to share a pizza last week, we took a 4 cheese pizza and it ","useful":0,"cool":0},"W5sNJxneQF_mygweTO_abA":{"text":"Their food is great, but they stole my hat!  When I called they said they had it and would","useful":0,"cool":0},"OlR6Gfakudi6K5pjRfUD1A":{"text":"I really love this place and look forward to returning to eat here with my family once I v","useful":0,"cool":0},"zFtas41cGl1IYNbw1KZ7kA":{"text":"Never would've found this place if it wasn't for a friend.  This place was awesome.  The p","useful":1,"cool":0},"eIFVCgD6bQSfYvJ44EkMIQ":{"text":"Fantastic.  I love trying their daily specials, and the unique pizzas they offer are reall","useful":0,"cool":0},"noKYotYxqS1O5LQrtMoJzg":{"text":"Good pizza, excellent service on this Friday night.  Don't get the tiramisu.  It comes in ","useful":0,"cool":0},"WxxKqwB82H9Y6KwVaolaKg":{"text":"Glad I was staying nearby, because this was the BEST pizza I've EVER had. [not a case of h","useful":0,"cool":0},"EQRzzaIi3KQVQzont9r2jw":{"text":"This place was amazing. Fresh salads, amazing bruschetta, and the slice pizza was huge!! A","useful":0,"cool":0},"_XvpSR-OH3PWrPihCLAp1g":{"text":"They renovated the back room since my last visit. Less bar, more tables, very noisy.  Pizz","useful":0,"cool":0},"kHdS9l0M3oMeCfQvAwhmlQ":{"text":"The location is great and just what I needed after a long drive from Houston. With that sa","useful":0,"cool":0},"AOigA6FRJbr3-9tYhgxBpg":{"text":"Slice is just right. Great place for a nice intimate lunch or dinner with a friends or a s","useful":2,"cool":1},"Y5bLeSE4NBzTNvocUjMpDQ":{"text":"This seems to be the Uptown go-to for pizza, but I've never really understood what the fus","useful":1,"cool":1},"ETJW4P2BiDkuDnsbLyFOrQ":{"text":"You know pizza and especially the crust is going to be good when you see a guy tossing the","useful":0,"cool":0},"jIMhgAGTsbueDTiaKtSSlQ":{"text":"Absolutely the best pizza in New Orleans. The place is fast, casual, reasonably priced, an","useful":0,"cool":0},"_BdFrnpbY6NF3k8Csacbvw":{"text":"Underwhelmed. Underwhelmed to the point of annoyance. \n\nI sat at the bar. I asked, \"what k","useful":1,"cool":0},"IzPwrJFO4_2YA88eC34hWQ":{"text":"Food was delicious. Had meat lovers calzone and pineapple mjoito. Awesome! Wife had portif","useful":0,"cool":0},"-e4Vtn4uJPdEYSQP5LwWgg":{"text":"First time trying this place, and I really think this is in the top 3 best pizza experienc","useful":1,"cool":1},"3QBzZQuxZZYhnEu9apU__w":{"text":"This is a really good pizza restaurant.  My lady friend from chicago would say my assumpti","useful":2,"cool":1},"Vdu4wwFtQBRTXEeI-8LnkQ":{"text":"I am still in shock that we found such a gem hidden in plain sight on St. Charles St.  The","useful":0,"cool":0},"WcgB7x4q7Rq-M7IWEbJ9lw":{"text":"Aaahhh-mazing!! \nWe ordered pizza, salad and a cheese plate along with dessert... everythi","useful":0,"cool":0},"cy_XZK_TZHisrMHJtuC5QA":{"text":"Found this place when I was searching for a quick lunch spot. I had a lunch of pizza and s","useful":1,"cool":0},"yAeKjwF0Kem6GuZaGIY-2Q":{"text":"Best pizza in NOLA! Thin crispy crust, really fresh ingredients. Loved it!","useful":1,"cool":1},"UOz2Tqn2c2Nu-aWZkMM03w":{"text":"Loved the pizza!  Very good!  Hated the soundtrack.  Rap/hip hop.  I'll get it to go from ","useful":0,"cool":0},"w8w-AILALdkpQ7VkfLktzQ":{"text":"So is pizza without cheese still pizza?  Some people tell me NO!  Anyway, I've had cheesel","useful":1,"cool":0},"dlU_zTI8E8pCGs8IIv2IPw":{"text":"2 of us stopped by around 1:30 on Sunday afternoon. Staff was friendly and welcoming. I ha","useful":0,"cool":0},"TBwgVnxXfFyhl20bQwpIQQ":{"text":"Slightly upscale atmosphere with casual joint prices and one of my top go-to places.  Slic","useful":0,"cool":0},"h1aK2oh9iOu8a4G60pLt-g":{"text":"This place is the bomb! You can order any pizza by the slice (as the name suggests) and th","useful":2,"cool":0},"ilvN_yvUgCscOg3IT-qo3w":{"text":"Just a few blocks from our hotel. We were looking for something other than fish and gumbo ","useful":0,"cool":0},"besC2FSqlf9lD31YEoAOsA":{"text":"Slice is absolutely delicious. Kind of artisan pizzas. I love the location on St. Charles,","useful":0,"cool":0},"YAzC-Wb6wZj8KDzaygcPrg":{"text":"Honestly. Some of the better pizza in town. You have to make sure that you order a whole p","useful":0,"cool":0},"A6BrjCpsa30WUJAPwyoZfw":{"text":"Delicious Gluten Free Pizza\nIf I lived in the area, this would be my go-to pizza place. Ni","useful":0,"cool":0},"Gg77hu6xr2MfpCCe68jXuA":{"text":"Anna gave us the best service with a smile and split our check like a champ! And Corey mad","useful":1,"cool":1},"LZsBCIqMMefpxvonLtDPKg":{"text":"Friendly service! Good slice of pizza if you're looking for something late at night. Great","useful":0,"cool":0},"Cy2XwPtMcCi4FfUXlIVi4A":{"text":"The pizza was good and the marinara sauce was even better, unfortunately I had a sever all","useful":1,"cool":1},"qo523R6ZTuYrRODXXTXCHQ":{"text":"We went to New Orleans for a conference/vacation and ended up eating here 3 times.  We eat","useful":1,"cool":0},"8Ggie3629Ik-30XaKaq8kg":{"text":"When I lived in NOLA I would come here often. I LOVE the Fresh pizza!! This is one of the ","useful":1,"cool":1},"Asbvp1ZdzPdezqK9rJoTDA":{"text":"YUMMMM!!!  \n\nI love that you can order by the \"slice\" and choose anyyyy toppings you want!","useful":2,"cool":1},"Rxy16rVYkMRSpBIMpjNY4A":{"text":"Located on St. Charles in the Garden District, Slice is a decent place to find pizza and o","useful":1,"cool":1},"jNQpmbKDUafxav0yXj9zmQ":{"text":"Reasonably priced but the pizza didn't have much flavor, very plain, needs more seasonings","useful":0,"cool":0},"0d3zd7OLyaBzGfeqOksDXw":{"text":"First time I've tried slice ill absolutely be coming back again. Kill pizza, killer meatba","useful":0,"cool":0},"ZsAgyQrmCrvODV4-wcvHtg":{"text":"Ordered a medium special deluxe and a pitcher of Abita. What an excellent combo. \nWell the","useful":0,"cool":0},"4AjSxYn8l9O3gpPMWGDgag":{"text":"The food at slice is consistently good. However, the customer service skills of some of th","useful":0,"cool":0},"lFwqVOEh-iRPBCSVSUD0Og":{"text":"It is my hypothesis that people who speak well of this place are either desperate or have ","useful":1,"cool":0},"Z72LTQSet9S2Tj0WQHRdog":{"text":"The pizza here is delicious, thin, crispy and flavorful, some of the best I've had. I also","useful":0,"cool":0},"oAm2tLqR6KaCCh9src1tuA":{"text":"My coworkers and I used to eat lunch here sometimes when I worked downtown.  The pizza was","useful":0,"cool":0},"f3adK0N6YIQNJIJ19qtskQ":{"text":"The service and ambiance was great, the menu options were also very good, but when the piz","useful":1,"cool":1},"onfUShl63FlFAHmPj9GUog":{"text":"I ordered enough food for 3 people, but I figured I'm only in town for a few days and I wa","useful":0,"cool":0},"smKbUirGBPyDqFQW8MfZKg":{"text":"This was my first time here, and I have to say I'm a fan.\n\nThe food is good and affordable","useful":1,"cool":0},"ViRiCMyARBnC5CJuNcJ5CA":{"text":"I'm a New Yorker, and this is the best pizza I have had in New Orleans. Hands Down!! Capre","useful":0,"cool":0},"mfCcpjJtfch5LANqixVucg":{"text":"Ive been to this place a couple of times but only the last time that I was there did I fin","useful":0,"cool":0},"Zo7i-22GsAqJc9Qu7JCu4A":{"text":"We wanted a little something for dinner and I ALWAYS want pizza so we checked Slice out an","useful":1,"cool":1},"27S2uRAyHtPsbd_pbkREHQ":{"text":"The pizzas are nothing to rave about.  They're just...okay? They have good specials every ","useful":0,"cool":0},"pWYWt_mszzZw3zMpdfrqJw":{"text":"earlier today my first 5 out of 5, now my second.  this is by far the best pizza i have ea","useful":1,"cool":1},"LleLz1tP_YUQ9Bqq58d8fg":{"text":"Probably my favorite pizza of all time - good thin crust, just right amount of sauce, serv","useful":0,"cool":0},"XuLdo4rACHd7H4dMEnMLCQ":{"text":"One of the last places I dined at while visiting New Orleans. I love thin crust pizza so I","useful":2,"cool":0},"gGLzG_d35YEgw8ZkHJ4jDA":{"text":"Really good pizza. Had the 4 cheese Margherite pizza. Cheeses were perfect an crust was gr","useful":1,"cool":1},"a8jEJYJr5gK569soyV0OlQ":{"text":"This place was really, really good. Not as good as  New York slice but still really awesom","useful":1,"cool":1},"rHqtY_mycaGoWxs9Gh8T-g":{"text":"It was a rainy day in NOLA and a good pizza and drink sounded really good.  We were not di","useful":1,"cool":0},"QFhDapynPY_tVjZOy4Ftnw":{"text":"I used to be a regular. That is until a week ago when i called in an order for the classic","useful":0,"cool":0},"SdZnK-Pw_NK3RA5iLW6rvg":{"text":"We went in as a group of 11. The price turned out really good like 80+ and we got to try m","useful":0,"cool":0},"2MtLwGczN__NEzwYovrRNQ":{"text":"We are NOT New York or Chicago, those places are known for their pizza.  I've personally e","useful":1,"cool":1},"Wh2TyeADFElmRpZvLvFW9w":{"text":"I ordered a pizza to go and it was DELISH! It was quick and ready to go when I picked it u","useful":0,"cool":0},"2V0Um2N4Q8K3Tf3ST7jUpQ":{"text":"Go to place for pizza.  Good pasta & salads too.  The only place that I know of in NOLA th","useful":3,"cool":3},"Zsutb_KD2Mop7Q_zYHrcmg":{"text":"This place was good, but not awesome.  The appetizers are expensive and small, and the ser","useful":0,"cool":0},"9-EAHLibZ9_rhThXGNPOtQ":{"text":"Pizza was ok. Way too thin to eat without toppings falling off. Went on Friday around 8pm.","useful":0,"cool":0},"Z1BEchzobXszohrjM4cBJg":{"text":"Wonderful. Great prices, great service. The Flying Hawaiian was so good that I got a secon","useful":0,"cool":0},"3jOsoQx7UpUAhOR7hnImXQ":{"text":"Found our way to SLICE on St. Charles!  Great food and staff!!! We really enjoyed it!!! Wa","useful":0,"cool":0},"BSSn_vjW9Gu5p0U3_x7sbw":{"text":"After looking for a good restaurant literally ALL over new orleans we stumbled on this pla","useful":0,"cool":0},"-6uXEPPBZvGCTV85V183yg":{"text":"After a long day of walking around NOLA with my wife and our 3 kids under the age of 8, we","useful":0,"cool":0},"mA7kMeBV6Ai_dEafxk_Tig":{"text":"I frequent here quite often...possibly two to three times a month. And I love it. The staf","useful":0,"cool":0},"rpJsD2N7MSvTb4mbTFJEFw":{"text":"Slice used to be one of my favorite quick meals in NOLA, but I've found that the quality o","useful":2,"cool":0},"PENRji_OlDWEaz8XSlDC5Q":{"text":"NOLA's Finest Piz joint","useful":0,"cool":0},"JuS6YjryZH3TZJOhLQ60qQ":{"text":"Love it! \n\nGot the bacon, basil, and garlic slice and that topped my NOLA food trip.\nThis ","useful":2,"cool":2},"T7ZNd9ok_fb3lWmOitm3iQ":{"text":"So far in New Orleans I would say this is top line pizza. Also the bartender (I think his ","useful":1,"cool":0},"RSeY1TmkUhfDl3kBpBwZ3w":{"text":"My caprese salad was barely edible, Moz and tomatoes were hard, the balsamic vinaigrette w","useful":1,"cool":2},"3CPSQJb_M56lhkytpuKiTg":{"text":"Pizza is delicious, awesome place for families or friends that have different interests be","useful":0,"cool":0},"1_zKln2j3bLCpTl_vKXk6g":{"text":"Just had this wonderful pizza delivered. This one had shrimp and sausage. Asked for light ","useful":0,"cool":0},"YPIHEGboUNOxnRWL1Rx8Pw":{"text":"I was in New Orleans for business and didn't want to deal with the craziness of the French","useful":2,"cool":0},"QV5eJy7h0CTkuvah-PX2hg":{"text":"Purchased a Groupon for Slice Pizzeria prior to our trip to NOLA. We ordered over the phon","useful":0,"cool":0},"RuctGWnmCwS_-IiWI4cdcQ":{"text":"Wouldn't recommend getting pasta to go. Such small portions and it looks like they just do","useful":1,"cool":0},"tX5xewELd1DUuWH60TeXcQ":{"text":"Used to be the best pizza place in town but the last two times we've been there, the food ","useful":0,"cool":0},"UfP43-a7i1Imcn1o7yGBAA":{"text":"Slice has pizza pies the size of planet Jupiter.  True to its name, you only need a slice.","useful":1,"cool":1},"tkpdxe_wuaRhJ1ClslIPQw":{"text":"Bad experience.   2 hours for delivery, cold pizza and didn't get the order correct.  Call","useful":1,"cool":0},"Aem-yTTT4pIOmw222eTfeQ":{"text":"My oh my, this place was soo delicious!! And definitely took me by suprise. I did NOT want","useful":2,"cool":4},"V6FlwoLXaG1u4Y8jEbH1ng":{"text":"I wish I could give 4 1/2 stars....the pizza was awesome! Bacon, Basil & Garlic + Mushroom","useful":0,"cool":0},"5-PWS2vh94EKRk8_2EzEtg":{"text":"The pizza was not good.  The crust was weirdly flat like a tortilla; it didn't taste like ","useful":0,"cool":0},"yGeAvyaeUHGIoNt4DNb5jg":{"text":"Very cute, delicious, cheap, AND they were playing awesome music! Couldn't ask for more. :","useful":0,"cool":0},"vWGgPN_1B2oDCtnRCDVLiA":{"text":"Everything I've had here is REALLY good...time tested and grown up approved...BBQ shrimp i","useful":0,"cool":0},"CyCaMI5BD6OxnNT3QrUl_g":{"text":"One of the lone voices of dissent, owing almost exclusively to personal taste. Friends, I ","useful":5,"cool":3},"qJkanyYxzPpUds_jbUUgGQ":{"text":"It's awesome being able to buy one slice of pizza instead of an entire pie.  My faves are ","useful":0,"cool":0},"PerSf6FnLzALk50fe35Q1w":{"text":"Excellent pizza, good atmosphere and good pricing.  The meat lovers slice was piled high w","useful":0,"cool":0},"KSzrwr9gqkqS_fUmAaOzfg":{"text":"BEST. PIZZA. EVER! I love that you can make your own slice and it's really hard to have a ","useful":0,"cool":0},"ySK1hnfjEwnYO5RdpkTtKg":{"text":"We had a short visit in New Orleans. Yet, out of three nights, we dined twice here. I cann","useful":1,"cool":0},"H5cuw0S1mUgu4PuAy2pb3g":{"text":"This was delicious. \nStaff friendly. \nVibe chill. \nHappened upon half price wine ....\nSlic","useful":1,"cool":1},"XSlIfVB3YNEejCvkcukeFQ":{"text":"This place is so much better than the one on Magazine Street - service wise. I can't tell ","useful":5,"cool":3},"kABaIQOq9182N8N4yu7IoA":{"text":"Their Greek pizza with artichoke hearts is awesome. Not too pricy and way better than Domi","useful":0,"cool":0},"D9zDKmVNC6KPy-FIeeU6xQ":{"text":"Great Food.\nGreat Waitress. \nI have no complaints...\n..wait.. I did mind seeing her carry ","useful":1,"cool":0},"f_jgvwPrrcpRsbnKgnOBog":{"text":"This is surprising, but this is the best pizza place I've tried thus far in NOLA (out of a","useful":0,"cool":0},"4iCCwJMlMSFjO-wumQsM-w":{"text":"Slice, is simply good pizza!! \nListen I love me some pizza, I mean I have a deep appreciat","useful":0,"cool":0},"dkQOE89e9hAiuq9Im86ElA":{"text":"Rico friends make him come here.  Pizza New Orleans is big dispoint for Rico pero I go any","useful":2,"cool":0},"S-FR7aim5qzM0C1quQv_AQ":{"text":"Went there with some friends not too long ago, and I enjoyed it a lot. The pizzas are huge","useful":0,"cool":0},"UXPy6W7odAQOZt6oa6aMyQ":{"text":"Slice does both standard and eccentric pizza offerings by the pie or slice. I had 2 slices","useful":1,"cool":1},"mc4SN2kl7iAtaVoCQWH45Q":{"text":"Decent slice and only place with quality pizza on Bourbon street. Their green tomato slice","useful":0,"cool":0},"oMhueyigcYW0zPcPhi0w8A":{"text":"When people get hurt and end up in the hospital, they should be fed intravenously using Sl","useful":0,"cool":0},"S60XacMLR8omsScBP-5V0A":{"text":"I love slice.  I love slice for their white pizza with basil.  I love slice for their gian","useful":4,"cool":4},"RmSpvi2IPqtDB33UFwzhVw":{"text":"If you are looking for confirmation to order the shrimp poboy look no further! I have eate","useful":0,"cool":0},"EZSt5bhtcjSlWkA3MRWimA":{"text":"Reliable and reasonably priced except for the time I ordered tomato soup and you charged m","useful":0,"cool":0},"cR6t7LnmPD2__yfs4js6JA":{"text":"My fav pizza spot. You can taste how fresh all the ingredients are on the pie. The barbecu","useful":0,"cool":0},"AmYSyor57whIxUmepgbY3Q":{"text":"Our last night in NOLA, my husband and I decided to grab a few slices here and then go els","useful":0,"cool":0},"hTSEH4paoevWBkslIUM_Wg":{"text":"This place was great !! They even have a vegan pizza which made me very happy. My family o","useful":0,"cool":0},"pCtm7P9KWrPK1OskGBLF4g":{"text":"It's pretty good. We got two slices of  'The Fresh' and a whole cheese pie. We also got th","useful":0,"cool":0},"VdhB_V2rJxEGjOmQealtGA":{"text":"Really good pizza place with a great menu, very very reasonable prices and great food. A p","useful":1,"cool":0},"qD_fpeQwLbUtZ8AaAAVV-g":{"text":"We stopped by here to grab a few whole pies after the first night of the bachelor party fo","useful":0,"cool":0},"Sj5oGe4ICrL4naUlnJ9GWg":{"text":"The pizza is fabulous. The shrimp/andouille is incredible. I've never had a bad food exper","useful":1,"cool":0},"IseN-o6VE8G2HDpIJ303-Q":{"text":"Had a great meat calzone called the trucker. Also a good slice of meat pizza. The service ","useful":1,"cool":0},"1XOHyNj5eVhS_zGxQ8p6yQ":{"text":"At first, our experience was very lackluster. We had a server who forgot about us for 20mi","useful":0,"cool":0},"5smim2hJPcJX2VAaSKyWiw":{"text":"I went here over the Halloween weekend, and it was a great experience. I thought this plac","useful":4,"cool":3},"B4RB6YhLoPDZ9a5-Rybmvw":{"text":"Itching for some pizza, my friends recommended this place. On a nice warm sunny day we cam","useful":0,"cool":0},"Vi2A5rIQpj1rQ2l2SXjwdQ":{"text":"After moving here and having a night of drinking some NOLA beer at Avenue Pub we found our","useful":1,"cool":0},"a330F0_qs7QDbHMpEu0t2Q":{"text":"Just had this wonderful pizza delivered. This one had shrimp and sausage. Asked for light ","useful":0,"cool":0},"wkIhKqo4DagLhw6Gr9DJnw":{"text":"The gluten free pizza is so freaking good! Crispy and delicious! My husband loved the spag","useful":0,"cool":0},"EYEzTIKXpkxJ02-jCcIJdA":{"text":"They have the best pizza. However the bartender was really friendly and got aggervated eve","useful":0,"cool":0},"482gDXtpSrroxUKvvhOv9A":{"text":"I was pretty hungry one night so popped in to see what the fuss was all about. I ordered a","useful":0,"cool":0},"aPWhYv9CYdLYfKRNvvnTcQ":{"text":"The owner has decided to change their design. No more individual slices (except for the da","useful":0,"cool":0},"AN89sV4BNSvxsLJL5owJNw":{"text":"The pizza was greaaaaat!! It's a great spot to chill & eat on you're day off from work lol","useful":0,"cool":0},"pbyqeJ-xkrj-qSlYtGqJRg":{"text":"Had a great meal here!  Bf and I were waiting to watch the Krewe of Druids on St. Charles ","useful":1,"cool":1},"2IrPgjfAD0RatU3BJV29GA":{"text":"The pizza is incredible! Cool that you can just get a slice because let's be real, who lik","useful":3,"cool":3},"M-x5ey_a5eQhxt6M2lKR0w":{"text":"About 3 weeks ago slice would have gotten 5 stars from me.  Ive been here for 3 years and ","useful":0,"cool":0},"mGoBUVfcsAAZB4w0574Clw":{"text":"Unfortunately,  I had a bad experience at the St. Charles location.  The bartender was not","useful":2,"cool":0},"_zs6vDZUId_7OvjuN9sWVg":{"text":"Great place. Fast and friendly service. Although the place looks a little shabby it's clea","useful":0,"cool":0},"jqiCIxTGDlUBFRkNeE0jog":{"text":"Good pizza with great toppings, not sure the real name but i call it a slice of white. Pre","useful":1,"cool":1},"3YaY2y4XvTZ1jdKUetJoEA":{"text":"I love this place because the concept is just so simple.  As a single woman, I don't want ","useful":17,"cool":11},"PyvRh9SxOu39grt6sAqgvA":{"text":"Me and my friends tried Slice for the first time last night after hearing such positive th","useful":0,"cool":0},"z2uGP2aPtxOjACSy0ppJtQ":{"text":"I highly recommend this place if you love pizza not just any kind of pizza out the box if ","useful":0,"cool":0},"MGQGL2ryKAZXtgUAWTUvTg":{"text":"My review of this Slice will be remarkably similar to my review of the Magazine location. ","useful":4,"cool":4},"cw9JKc-FXThMAlVVvWVn4g":{"text":"I work around the corner from here and from being in New York and New Jersey all my life, ","useful":0,"cool":0},"oSK5R9XKNiX8H_ZV0JcXIQ":{"text":"It's been a hour no food. No waiter. Been here before and had great service. Ordered a sli","useful":0,"cool":0},"XhGnWotwZZwcG0IOrKbCMQ":{"text":"A nice chill pizza joint with tasty vegetarian options and...good drinks - a winning combi","useful":1,"cool":0},"GT1UAEve_Aoffla36CTe5w":{"text":"After seeing the reviews we wanted to give it a try, very disappointed. After 30 minutes W","useful":0,"cool":0},"zip_BJSV7bx0pPwPn-XrRg":{"text":"The last time we came here the patio was a mess so I got a message from Jack the manager s","useful":0,"cool":0},"p86ml9Ue2ogIFV6aBDQBRQ":{"text":"Love that their pizzas are hand tossed and are close to NY style. This is one of the very ","useful":0,"cool":0},"s_PBPep4m5DHuSg0BlKBvQ":{"text":"This is my favorite pizza place in town.  I love the crust - not too thick, not too thin. ","useful":1,"cool":0},"NDhrhOzEWiNupY_T5tyBqA":{"text":"ORDINARY PIZZAS - Have had better! \n\n(A) ambience - not very amicable, dim lit regular piz","useful":6,"cool":5},"RgXi8PhtMODPk7imsgQr-A":{"text":"I'm still a fan! my \"go to\" place for a night out with my daughter.  I can feel like a gro","useful":2,"cool":0},"P67oHd4g75wAWKdWs2GoRw":{"text":"I had high hopes for this place but was disappointed by my lunch here. I got a slice of th","useful":3,"cool":2},"nTc8ODRo9boBtS8Vu55m4Q":{"text":"Dear Gluten Free Friends.... \nGet ready to embrace your love and lust for thin crust pizza","useful":1,"cool":1},"cVrEwZUAHpXOTiBGg0owhg":{"text":"Always on point with service. Great bar (even for non drinkers) to sit, socialize and eat.","useful":0,"cool":0},"rAeCZY6BcEukOq7MdWi5pg":{"text":"Very good pizza and po boy.  Service was excellent.  The pizza had a nice thin,  crispy cr","useful":0,"cool":0},"2M8HjSYblp61LsVPbwZLEw":{"text":"I have lived in New Orleans over a year and Slice is by far my favorite pizza place. I lov","useful":0,"cool":0},"nOrm-da_TcBhJUYbUnlv9Q":{"text":"This is my go-to restaurant for anytime I want to eat out. I'm pretty sure my wife gets ti","useful":3,"cool":3},"0DG0g5vlqZBwBv1hSuHx2g":{"text":"Update. I have been back 3 times in the last 8 months and its been horrible each time. I d","useful":1,"cool":0},"cCcAszz-qYKpBE5bMlfUcw":{"text":"Pizza was average. However, service was absolutely terrible. Wait staff was intoxicated to","useful":0,"cool":0},"xb8eGVw-p3l4mcMJoFHE3g":{"text":"How could you take the meatballs off the menu?!  I heard 5 people ask and complain about i","useful":2,"cool":0},"DRTEnmdEid4MqrX3m2c81g":{"text":"We were staying at the hotel that is located pretty much right next door and since we arri","useful":0,"cool":0},"XdzQlsC0h5Xm7AlODCqQdA":{"text":"Waitress was too busy talking about vitamins and prescription pills with an apparent frien","useful":0,"cool":0},"0STRmiyR6xjN2bQJZreizg":{"text":"Good food but poor customer service. Disappointed by the way my friends and family were tr","useful":0,"cool":0},"agFUjQxFMqHwDb4OFlKNzg":{"text":"Grab a slice or the whole dang pie! Always a good spot to either grab a quick slice or sit","useful":0,"cool":0},"Jb_Ya653k4pgusvXDZW0ng":{"text":"Excellent neighborhood pizza joint on St Charles avenue right by our hotel, the Avenue Pla","useful":4,"cool":3},"JdoHItIZVVXFmapXtEQDOw":{"text":"Fantastic pizza!!! I have tried pizza from all over the USA and Slice is definitely on my ","useful":1,"cool":1},"obijcdHrVX1yXBXtL5WAhA":{"text":"Pretty decent pizza and really enjoyed their salad. They have different drink specials eve","useful":1,"cool":0},"fLecO_HxrBXFRK3pFfd34g":{"text":"We flew in on Wednesday and found this welcoming pizza shop.  It was so amazing we had to ","useful":0,"cool":1},"FsFbdk0XI-0bGHY32fK8aA":{"text":"Being a northern I need a slice on occasion. I'm so thankful to have tired slice. It reall","useful":1,"cool":1},"l55gIbKJWU818Vf-cIOyEg":{"text":"Went with co workers for lunch.  Split the whole Greek salad.  So fresh and delicious.  Go","useful":3,"cool":0},"FIQNok6Nsg-Vt1R9t8SpGg":{"text":"Way over rated!  Went at lunch and waited nearly an hour for 2 slices of soggy, nasty pizz","useful":0,"cool":0},"bdqoCyZjeZInbG4rqcyVMg":{"text":"15 mins after we were seated before they came by to take our order..40 mins total before r","useful":0,"cool":0},"I_P1gawLrz7NjkSE7KCBIQ":{"text":"I visited twice before I posted this review. I am a pizza snob of sorts. I seek pizza join","useful":1,"cool":0},"hc41OjhVC1QPzrVkHjX5gg":{"text":"The bar looked fully stocked, so pizza and wine it is! \n\nI ordered the veggie pizza, and i","useful":3,"cool":1},"kdAhzM884PloK3qwYYUTTQ":{"text":"Got their pizza delivered via Uber Eats last night and I will say it was warm and super fr","useful":0,"cool":0},"kSsU37_As-_7CXxXtnjgwg":{"text":"I ordered a pizza on Friday night for 6PM and it was delivered about 15 minutes early and ","useful":3,"cool":0},"7diHU3CQ6z2MPJ4cYqwmCQ":{"text":"You wouldn't think it, but this pizzeria has the best BBQ shrimp po boy I've ever had. It ","useful":1,"cool":0},"82sE6oxq8XMF2PiMmoWDWA":{"text":"Good, local, hole in the wall style pizzeria with good prices and great food. Cozy, diner ","useful":0,"cool":1},"tmcAkYFADjGYHl6jfzJgsA":{"text":"I don't rate places often they must either really bad or really good. Slice Pizzeria is on","useful":0,"cool":0},"IoGyHjRab6QSiqmX3FbRBQ":{"text":"Stopped in here yesterday before checking into our Airbnb which was right next door and I ","useful":0,"cool":0},"Tslfz3yaZeaVP2uTOlG3LQ":{"text":"Right in the middle of Garden District this was a 7 min walk from our timeshare.  My wife ","useful":6,"cool":5},"fPN4VgJeV1ws7RcxGuGjPA":{"text":"This place is a gem. A great warm and friendly neighborhood hangout \"where everyone knows ","useful":1,"cool":0},"ejIxMCh3qDXySgTJ6PhOsQ":{"text":"Already been there twice for an afterwork with a friend. The first time I enjoyed 3 differ","useful":1,"cool":1},"rWx_x0mHm-eVbfva-saysA":{"text":"I've always enjoyed this little pizza place. Most recently, we ordered a half wicked garde","useful":2,"cool":0},"8-UP8uMTPBLx1fGxSLDD-w":{"text":"This was the BEST pizza! Absolutely delicious! Perfect at the end of a long drive. Great s","useful":0,"cool":0},"4Gw3v3_9i1jWPFWwF35LGQ":{"text":"Great!  Had the Wicked Pizza and the BBQ Chicken, Spinach Dip and Meatballs app... delish!","useful":0,"cool":0},"VjpM2dIkdOUCu5hJIN1zuw":{"text":"Slice Rocks! I recommend the PGA.  Best pizza in town.","useful":0,"cool":0},"8nUXLR5kIJA_66Nb1u3FUg":{"text":"Don't try to order take out by calling them.  They don't pick up the phone.  \n\nI would hav","useful":1,"cool":1},"mMVwHFzbKswCZ6v2g1KaMw":{"text":"A rarity in my food travels- 5 stars! I have never heard these words from my wife, \"don't ","useful":1,"cool":1},"j2AYofjsplwCEnwXseeBPQ":{"text":"A great experience dining at Slice.  We were exuberantly greeted when we arrived and recei","useful":0,"cool":0},"uzK9y353JAAGkPbIyh2jLw":{"text":"Nothing makes the drinks and food taste the best it could be more than when the moment you","useful":0,"cool":0},"fZLuDWB-pBLdCPLb5SpvOw":{"text":"I used to love Slice but don't like the changes they have made.  Order at the bar and ther","useful":0,"cool":0},"I0_x5Qo7_GVoF_6DWUuh_A":{"text":"First time here and I had an amazing experience! Bartender was so lovely and personable, I","useful":3,"cool":0},"fVK-f7SvAJy2HNoCQykIQQ":{"text":"How is a placed called slice not sell pizza for a slice?  You now have to buy the whole pi","useful":0,"cool":0},"uLWq_iGulRVnzs--88_xPw":{"text":"One of my favorite all time Pizza places in the city (New Orleans).It's not a flashy place","useful":0,"cool":0},"rBv2edZMhvFon8hLopVrXA":{"text":"Slice Pizzeria was one of my top five restaurants. Every time I come into the city I have ","useful":1,"cool":0},"0PbCwF669a7BusWlOduQdQ":{"text":"Ordered rhe 4 cheese Margherita pizza large and the spinach and artichoke dip. The pizza w","useful":0,"cool":0},"3Y23_JesERPfPkwU1WC-cQ":{"text":"I grew up in New York and had my fair share of pizza (I'm not a small man) and this is sti","useful":0,"cool":0},"1zSisOseu8FnUukLNOEXiw":{"text":"I've ordered twice in the past month or so and both pizzas have been disappointing compare","useful":0,"cool":0},"Zlr0uYDtj_lCKWv91_w4cQ":{"text":"Spent the day flying to New Orleans and after getting settled in decided it was time for a","useful":2,"cool":0},"zQ7p5etYcHqcfcokclOtUA":{"text":"Still have mad love for this place. Went in on Saturday night, about 10, grabbed a table e","useful":2,"cool":2},"rghIT_1mtnDj4DPFQobhiQ":{"text":"The pizza's pretty good, but we were disappointed the last time we came and found the bar ","useful":1,"cool":0},"wGc0x9yTYI56yy9qeLhreA":{"text":"WOW! I was a little worried at first because my history with thin crust pizza is usually i","useful":0,"cool":1},"owC8dQ0LeNGafPmM1on6-Q":{"text":"This small pizzeria on St. Charles was a satisfying place for a night out with friends or ","useful":0,"cool":0},"F7qtAIt2SHvc828KEyan9Q":{"text":"I am a Pizza Lover. Yep, admittedly so. I could possibly eat Pizza everyday and not be ash","useful":4,"cool":1},"76Qlw2i1S2Pd93KHgNpkeQ":{"text":"OMG this pizza is amazing. The crust is super light and crispy, the cheese is a good mix a","useful":0,"cool":0},"6cwhh-HRTKs3t23THUM2cw":{"text":"Went there recently and was not good at all and used to go there a lot.\nIt changed hands. ","useful":0,"cool":0},"IOYSJAy7UO1sU_hPlEHhYQ":{"text":"What a friendly bunch of folks. Ordered some take-out and got there too early - so I did l","useful":0,"cool":0},"7BYy7mmZhgRhcskfo76RoQ":{"text":"OMG this pizza is amazing. The crust is super light and crispy, the cheese is a good mix a","useful":1,"cool":1},"GObbhmPR5suttOMQFyahlQ":{"text":"Very friendly staff, great pizza and yummy Italian soda and decent beer selection. Richard","useful":0,"cool":0},"2UJwA2F_fafBCRnbbLPfCA":{"text":"For gluten-free delivery, it's spot on. No skimping on the toppings and it was still warm ","useful":0,"cool":0},"NiCbCin6ZmAvQAjvR2-AMA":{"text":"I'm normally in town several times a year, and Slice is very convenient to my place. The p","useful":0,"cool":0},"5_LwQbxzTLpZckOgw4PumQ":{"text":"Phenomenal pizza! The crust was tender snd not chewy and the toppings were served fresh. \n","useful":2,"cool":0},"FEC-vHSkw_dPfhVUHO1cxA":{"text":"I love this pizza restaurant. I order from here at least obese a week. An order was delive","useful":0,"cool":0},"LsCFuVrClvsP-hdkBXl65g":{"text":"Their pizza is delicious, and the staff is nice. When I arrived, they said they hadn't rec","useful":0,"cool":0},"268ft0PW1Krv2wG2QqBb_g":{"text":"Shame on you Slice. We arrived at 10:52am. Because the door was wide open and the sign was","useful":2,"cool":0},"pYk8_SwCVu7VUMpuuB2Dng":{"text":"it may have gotten the zagat in 2013 n best in town in nola 2012, but the slice was very s","useful":2,"cool":0},"3W8eMebyBiWxdYFmLMq0gw":{"text":"BRUISER OF A BBQ SHRIMP PO'BOY: yes, \"Angie T\", thank you for the heads up this really is ","useful":5,"cool":2},"JpfOTGGBZ-9rBQfPE4DHkA":{"text":"Ordered through door dash tonight. Received my order with a whole item missing (Caesar sal","useful":1,"cool":0},"16um6RA60u5nzv3JSuFtew":{"text":"Pizza looks nothing like the pics they up now. Service is amazing but the quality of pic v","useful":0,"cool":0},"Sileihg1pvJXJnlP08uF1Q":{"text":"It's hard to classify what type of pizza this is for it is almost in a genre of its own. B","useful":0,"cool":0},"Zz1DO8rBxQo7s2aS-Gjcqg":{"text":"I'm so heartbroken! My favorite place to get the best authentic BBQ SHRIMP POBOY in the ci","useful":0,"cool":1},"t2cN0KYI6Krlt7EhQr20Zw":{"text":"About a month ago this place changed for the bad.  You now order at the bar and they bring","useful":0,"cool":0},"NZwTt_cMaqtiGKChwZ5BeQ":{"text":"I didn't feel like walking anywhere for dinner and just wanted to stay and call in for din","useful":3,"cool":2},"m02o7ENpLbi8DSJC19RTFg":{"text":"Sad to say that Slice has lost a regular customer. Raw dough in our calzone and attitude w","useful":0,"cool":0},"7QF1LBp0EmvGJSpuNDz2pg":{"text":"I came here today at 11:25am and the doors were locked and the stools were on top of the t","useful":1,"cool":1},"y8b7jMkAA5fqROd3btfMXA":{"text":"Here on vacation and ordered pizza and a calzone for our last night. The wicked garden cal","useful":0,"cool":0},"6iJp2f1HyF2Lhs72rD-60w":{"text":"Good pizza, but not as amazing as other reviewers say. I really liked the fact that you ca","useful":0,"cool":0},"gi4n5WIwxyyBcOS69I6-DQ":{"text":"The Pizza here is ok. I felt like I was eating a premium version of Dominos Pizza. The rea","useful":1,"cool":0},"SO70mf8dSLDi9rS9zwMX4A":{"text":"This needs to be named a slice of hell! We waited over two hours for simple dinner. It too","useful":0,"cool":0},"fzpPSqkjHn7ya17eLoLQVg":{"text":"Whats going on with my used to favorite night pizza joint? A regular customer that would e","useful":1,"cool":0},"X_2y_Mvt4wtiFH-ejfxoQg":{"text":"This review isn't about the food, it's about the waitress and her poor service.  Came in S","useful":0,"cool":0},"byHqTDpiHv9hRPxZyu8EQA":{"text":"came here recently to try their food for the first time and really enjoyed their pizza. th","useful":0,"cool":0},"E-i_1N_N5ZTZyD4lCVMFtw":{"text":"I ordered spaghetti/meatballs and a white pizza. The pizza was Delicious and was hot and f","useful":0,"cool":0},"srJ1qLUE1xICaXmgWEucOw":{"text":"If I could give zero stars I would. Ordered a calzone to go and first bite was of raw doug","useful":2,"cool":0},"KYn4Pz6teNYEIPgnR2XlTg":{"text":"No idea where all these five star reviews are coming from. Crust is...not good. Like vague","useful":0,"cool":0},"-nfYVjqKDeFAO4b6KByOOw":{"text":"Had this location bookmarked and figured since had the kids with me in NOLA we'd give it a","useful":10,"cool":8},"oGjGVSr-VRYoyI92P4vhGg":{"text":"Love this place! Consistently goods pizza, big slices with a great crust. Love that they o","useful":1,"cool":0},"SYEIl_7ZzJoUBff4gSmaYg":{"text":"This is the worst restaurant in New Orleans, of any type of cuisine. First impression walk","useful":3,"cool":0},"5El3p6MNW9UiU5_arYAiRQ":{"text":"I have yet to have a SLICE that I do not like if \"Slice's\" pizza. No matter what toppings ","useful":1,"cool":0},"AfuKsSVZQLzChg-RbmPutg":{"text":"We had a takeout Hawaiian pizza. We added anchovies which is a staple item for us when we ","useful":0,"cool":0},"_Ix00PD7Zf1qLxGNs6Q7fg":{"text":"I went to Slice recently on a tip from a friend that the pizza was the best in the city.  ","useful":0,"cool":0},"tzlisDW4pJ139fmY1hOaBw":{"text":"What rock have you been living under if you haven't had a slice? It was love at first bite","useful":6,"cool":5},"vyAQ0KWWpM6LR3XmX6o5Iw":{"text":"I know this is going to seem unlikely but believe it or not, Slice is probably one of my f","useful":2,"cool":4},"6q84YcVOsh5vw4qfEs65lg":{"text":"This is my first time using yelp. It was the first time in a while that my entire family w","useful":0,"cool":0},"1G_JHHhs-kf_5sovluqbMg":{"text":"The pizza and bread pudding were both excellent. No dine in right now but we were able to ","useful":0,"cool":0},"1U-ejUZC9gQ2NldM37OPNQ":{"text":"The menu is never updated trying to place a simple order to pick up turns into a cattle au","useful":0,"cool":0},"Fe_4HomKK52N__Un-Ibf6g":{"text":"A great little pizza spot.  Out front they will have a few tables set up outside.  Some ta","useful":2,"cool":1},"DqJQMAwNMYnNKO4H6pSNBQ":{"text":"Grabbed a couple of slices from this little gem during Mardi Gras. They were a great for a","useful":0,"cool":1},"RB4ht4u3Y3PisPync6cxDw":{"text":"Great service and the pizza was really good. The boys split a cheese and pepperoni- great ","useful":0,"cool":0},"aPvPlreCoUGq5gi1MLcZ7A":{"text":"OMG, had the best service and pizza ...this time I tried the cheeseburger pizza with sangr","useful":0,"cool":0},"MCx7CyZcHKZgAZP1DYDvtQ":{"text":"We hopped off the street car and walked right into SLICE pizzeria to a great eating experi","useful":0,"cool":0},"ovu7nGluQSoWfflIPJvf_A":{"text":"Stopped in while waiting for our B&B room to be ready. Friendly service and they asked for","useful":0,"cool":0},"nh29pEVFJ3EbPAFJ3I_lig":{"text":"Slices after a late night in the warehouse district- I was sooo excited to see this place ","useful":2,"cool":1},"wiSukef0NMFu5IiOkseL9w":{"text":"I LOVE SLICE.  The thin crust is not too crispy, but the crusty crust outside is so great.","useful":2,"cool":1},"FYnaPIezGi6WfImejs2Nng":{"text":"Lots of pizza bang for your buck!\n\nI'm the sort who, when faced with all kinds of options,","useful":11,"cool":10},"trX_LpTAAX93WLWvTvpLFQ":{"text":"This is the perfect crust, perfect fresh toppings, perfect drink specials pizza joint in a","useful":2,"cool":1},"D70yn-_RY2t7A-me7pgBzA":{"text":"I sat at the bar and ordered a slice of Wicked Garden a White Pizza and the Pineapple Moji","useful":10,"cool":9},"yB9qsRs9o_7uTD-_EqYiaQ":{"text":"I was in NOLA for one night only 12/16 and was starving. My hotel's restaurant wasn't open","useful":1,"cool":0},"OTxY3tkRWHi4GfRUdu9FzQ":{"text":"Six years without an update on Slice? That's just not right.\n\nI was a longtime fan of thei","useful":21,"cool":16},"FW67hDKn1S5Hk4Q6AOGmoA":{"text":"So when i visited NOLA last, my friend wanted me to try Slice and see how it compared to P","useful":1,"cool":1},"Re5O_Q86zPqwaIMTO2sQhA":{"text":"I am not a big pizza person   !! But times have changed...  this pizza was amazing , had t","useful":0,"cool":0},"G6eXDIIjBsc3PWNOlPAGJg":{"text":"My husband and I have come in several times and we did not feel welcome. We felt thick rac","useful":2,"cool":0},"3BuznRx_LuKUfk59K15A8g":{"text":"Atmosphere and vibe were great. However, I got a couple slices of pizza to go, and the sau","useful":0,"cool":0},"QT190typ2PE3lwGF9FKxZA":{"text":"Pizza is very good.  \n\nHowever, if you're picking up and it's not ready when you get there","useful":0,"cool":0},"Pm7677cFMWpBRAfNgrMViQ":{"text":"Slice on St. Charles is a fantastic spot for a quick bite or a late night snack. The old s","useful":3,"cool":0},"euZat8QbQJMTM9L7_6s83w":{"text":"This place is awesome with a capital A! The calzone was superb. Way to big to eat in one s","useful":0,"cool":0},"wTFg0fVWByWVNco0c_wSbg":{"text":"I LOVE LOVE LOVE pizza and this had awesome tasty yummy pizza and a great bar. My favorite","useful":1,"cool":0},"H9YXArdOlDhyPAd3gCMZWw":{"text":"If Iron Maiden is on when you walk through the door you are going really mess up the food ","useful":1,"cool":0},"Kt_xCsCG8z__N_ad0bwOGQ":{"text":"A quick and really tasty pizza place! Being from Chicago I haven't really found \"the place","useful":1,"cool":0},"MFIbW2TOKNVHoWZYiONVdA":{"text":"My partner and I went eat around mid afternoon. A girl sat us; as she was walking away she","useful":0,"cool":0},"N_53BrNERmLJfqbOr3hhwg":{"text":"Funny how I can destroy most pizzas on my own... parked in my truck... away from prying ey","useful":4,"cool":0},"-Zbep5q8PkfSEvaeOy1YpA":{"text":"The staff is very rude and unprofessional. The pizza is mediocre at best. The women that w","useful":0,"cool":0},"OpWkYYResHDxnAxigQWveA":{"text":"Ordinarily only hit the Cajun/creole hot spots on a vacation in NOLA, but after discoverin","useful":2,"cool":1},"A7JYp3WDvJIJGUIOV3L-Wg":{"text":"My boyfriend and I ordered a Supreme Pizza last night that we were SO looking forward to..","useful":0,"cool":0},"bHNxU_pd2hGgaMtInsfCfQ":{"text":"Stopped here for lunch when we visited NOLA in July. Delicious pizza at a great price! I o","useful":0,"cool":0},"AKSjkQfRMy8tfE7EBCOUew":{"text":"I'm going to start by saying do yourself a favor and get it to go. The ventilation inside ","useful":2,"cool":1},"9iG4CWb1qjVJF82juaSIFg":{"text":"This place had mediocre pizza AT BEST but their absolute worst downside is their staff. Th","useful":1,"cool":0},"wTE2Gk9PqNrxQFXN1bS6zw":{"text":"Excellent pizza and fast service!  We got 4 different smalls and all were great!  I had th","useful":0,"cool":0},"RWOQMXgfmEMjxXpp6sVtcA":{"text":"We got a specialty pizza, which was recommended to us by a cook taking his break outside. ","useful":1,"cool":0},"nwwM7R8lBesXzCUFwtD7Lg":{"text":"We weren't super hungry, but needed a little something. We walked to Slice to fund out the","useful":1,"cool":0}}