{"mcNy-Xafa6L6Um-9iEYFGw":{"text":"Absolutely great selection, and while I found Don Lencion..or whatever it was called, to b","useful":0,"cool":0},"cMkF5uDJeYXpVtP5Sijo9Q":{"text":"Small local lounge. Friendly staff. Good choice of stogies. Enjoyed my smoke in a nice sur","useful":0,"cool":0},"UpBX0tPurMcjpnuduwgurQ":{"text":"Great hospitality! Very knowledgeable!                            We got a coffee and choc","useful":0,"cool":0},"WTwVYAY7_7fB4ZYRycAIvg":{"text":"Popped in for a quick smoke and a nice chat with the fellow in a fedora. Great selection s","useful":0,"cool":0},"rx6zIGZxc7N3rBT32XWVQw":{"text":"Have a wide selection of cigars and the staff was able to help me pick out cigars that are","useful":0,"cool":0},"aoqCDhQLezEsK24TUeA8NA":{"text":"This is a true lounge.  Very relaxing and the best selection of cigars I have seen in New ","useful":0,"cool":0},"wbLgzzyobctgwkciXg-FFg":{"text":"I was in town for a company event and stopped by Smoke on the Water a few times. The cigar","useful":0,"cool":0},"H9CtlLxPR4Oj04e9jYGXgA":{"text":"Not only were their Dominican cigars delicious, but it's also a wonderful spot to sit.  \n\n","useful":2,"cool":3},"R6B3j61mQ3Q8uT8Yk5Ia6A":{"text":"Good little spot with a good variety of well priced brand cigars. It was the perfect place","useful":0,"cool":0},"eBuVECcSqJLFj4dtToR-fQ":{"text":"It was a long day on the road and I was looking for a great cigar lounge to chill out at a","useful":1,"cool":0},"qlGbPPtp_oWztLePmlLETw":{"text":"This is my 1st time visiting this particular shop. My friend and I were out on the parade ","useful":1,"cool":0},"qql0i364CX57nSEjZCut3A":{"text":"Awesome cigar bar!! Great selection and even better service! A must visit if you are looki","useful":0,"cool":0},"lcDJUegmudEo7vxvJpiNog":{"text":"This place was amazing and its all thanks to Marco!\nYou want to get away from the hustle a","useful":1,"cool":1},"l9Zl9O955JKs0NWK98v0PA":{"text":"Awesome service, huge selection, and knowledgeable staff. I recommend this spot to anyone,","useful":0,"cool":0},"i_03I-n3MWw8OUXq1gdPDA":{"text":"Five stars for Marco. It's always a great atmosphere when he's working and he pays attenti","useful":0,"cool":0},"M9c0WRjgiP1B9RsCP2kiTw":{"text":"OMG!!!!!! The NICEST employees. Was visiting with my bf & we went in on our first night in","useful":0,"cool":0},"Ya2sUTH2GWDpqDM9LqJm8A":{"text":"Great selection but way to expensive. Def would Not recommend this cigar shop. Nice staff ","useful":5,"cool":3},"-iZj_32BcUIzytkCZk_wIQ":{"text":"Stumbled across here after leaving dinner last night. \n\nThe cigar selection is quite exten","useful":0,"cool":0},"ITzkm9fWHuNVV_ccxFyYCw":{"text":"Awesome environment. Staff friendly and knowledgeable. Locals and friendly and nice select","useful":0,"cool":0},"w5kqE6NXjycBCffcXvkqZg":{"text":"This is one of those smoke shops that tailors to tourists only. When I saw the prices of t","useful":2,"cool":0},"pwuHpII88xQDLU7tWWDcDQ":{"text":"Very very nice place to buy cigars huge selection great sampler packs a really nice find I","useful":0,"cool":0},"asEvoxMxv2Alz548UMrQjw":{"text":"Great little spot! Guy behind the counter was very knowledgeable and helpful! Large, great","useful":0,"cool":1},"aTf2DG6822e_fcUf03IfYQ":{"text":"Great selection and Catered food for the big game. Very helpful helped me choose a great v","useful":0,"cool":0},"qOMaiEHmGZd41As-b5PGyg":{"text":"Best selection I have seen in the area.  Prices are good and the atmosphere is great.  Mus","useful":0,"cool":0},"iDdFnutprsgwSUq5cFMVCA":{"text":"Found this place while I was there helping with hurricane Ida!! The staff was amazing and ","useful":0,"cool":0},"TNnHwlkVerMPK4Z3uAbi4w":{"text":"Great cigar selection, knowledgeable staff, relaxing atmosphere with big screen TVs. Defin","useful":0,"cool":0},"fLbqR1RG6NMRvMjzp31vMw":{"text":"Me and my two best buds spent a couple of afternoons here out of the summer heat, and lite","useful":1,"cool":0},"IIMnXJDWcUL9LGOT6HGypw":{"text":"Very cool place about 2 blocks from Bourbon street. You can buy hand rolled cigars all ove","useful":0,"cool":0},"adPFhrxp2d2uAhnoOJqEaA":{"text":"Great to be back at my favorite cigar spot in NOLA. The sticks are awesome, the atmosphere","useful":0,"cool":0}}