{"YZOYDuMmwSbfrb1BYtGBzg":{"text":"It pains me to write this review. Such a waste of excellent ingredients. So here it goes a","useful":0,"cool":0},"UvrfxA2DHR-fiChkM4x-mg":{"text":"Came here for some pizza and was not disappointed by the spicy lamb meatball pizza. The am","useful":0,"cool":0},"LZ9jeVfmA11ckfMGrXbJpA":{"text":"We ended up at Domenica because we tried to get fried chicken at Willie Mae's Scotch House","useful":1,"cool":0},"MbUvNAp8SDBqr5IcCF07ag":{"text":"This place was great for a group. Lots of things to share and enjoy. Waitress was nice and","useful":0,"cool":0},"LwMKhYY3ibMXlq2HQ1zuyQ":{"text":"Atmosphere: Chain-like contemporary. All hard surfaces. Paper placemats with menus printed","useful":2,"cool":0},"ROFZ7ouPTjpKSdkUB7rFwA":{"text":"So delicious. We came here because they were one of the restaurants listed on tabbed out (","useful":0,"cool":0},"dANzUW08-RfFjA5y121znQ":{"text":"We walked in on Sunday with no reservation and were told 15 mins wait but we saw empty tab","useful":0,"cool":0},"MRfM1e-uuaOp-oJuFwnB3w":{"text":"Loooooveed Domenica! We came right from the airport and started our trip in NOLA with thei","useful":0,"cool":0},"wlhkmIuGfgmNyUqdlDVQ0g":{"text":"Two Words. Roasted Cauliflower. Absolutely amazing, simple, vegetarian. Dessert wasn't ama","useful":0,"cool":0},"tmlbTzg1YtE0wX3aFf4taQ":{"text":"Went to Domenica for our first meal because of the rave reviews and proximity of the place","useful":1,"cool":0},"9kGLeI3H3MrJgpPVBfDfkw":{"text":"My husband and I had Saturday dinner reservations during the second week of Jazz Fest and ","useful":0,"cool":0},"XvvXmOXODTEw9CPZyYzGpg":{"text":"Good food, especially the cauliflower dish with the whipped feta - NOMS! The pizzas were s","useful":1,"cool":0},"hoiB2yUGcRv4m7l9QQtQZQ":{"text":"Me and my Fiancé came here for dinner the night we got engaged. They were wonderful as the","useful":0,"cool":0},"Iw3qPRfJppvPvcl64UPvKw":{"text":"Went to a birthday dinner with a group of girls. We all ordered a different pizza and ende","useful":0,"cool":0},"pcn-ZM1dtxWXLKMdNFkFSw":{"text":"Had dinner at Domenica the other night after seeing a post the previous night on Instagram","useful":2,"cool":2},"2ObS44VxyikF1cmUnNVoLQ":{"text":"I had dinner here a few weeks after its grand opening, so I'm going to try to describe it ","useful":1,"cool":1},"D1D4DMKm27xNWbr-J2tgpg":{"text":"We enjoy Dominica on Baronne whenever in NOLA. GREAT Happy Hour value. Roast Cauliflower, ","useful":0,"cool":0},"WUg-Zp6FfK6m3iBan_WLPQ":{"text":"The prosciutto pizza along with our rigatoni was phenomenal. The service at the bar was ex","useful":0,"cool":0},"hyo2-2Del5Q7OKIvXagpGA":{"text":"Let me start by saying the food was 5-star worthy all the way. The service is where this r","useful":0,"cool":0},"4ZRhUfJ5zcm0rkExA9rymA":{"text":"Bread was good.\nSalad was good.\nWild mushroom pizza was extremely salty.\nLasagna was great","useful":0,"cool":0},"OrJBjmcOTdvc5zE8xU7mHg":{"text":"We went there for dinner at peak dinner time on a Wednesday without a reservation and sat ","useful":0,"cool":0},"PpO6NjgfcXcejRai4nQu1w":{"text":"I have only had pizza or the roasted cauliflower.\nBoth are good and dependable and correct","useful":1,"cool":0},"32NQrxed6q6WUqACI5bRFA":{"text":"BEST. PIZZA. EVER! try the mushroom pizzza. yumm. I coudl eat my fingers.","useful":0,"cool":0},"VA9rQOy3MpbbPLFCoQytwg":{"text":"The food - so good, its one of my absolute favorite places to eat dinner. It's hard not to","useful":1,"cool":0},"zlsRVM_rT5G6S04wBw3XGA":{"text":"Goodness. Where do I start? I came here with my co-workers celebrating one of their birthd","useful":0,"cool":0},"rEwp-RQtr68X2tqSrX1FzA":{"text":"FANTASTIC!!!!\n\nService was not rushed, but always there when it was needed, and suggested ","useful":0,"cool":0},"MRW3ipiyasqn0sVPQfqMDw":{"text":"Domenica is a very nice and appealing restaurant to get your Italian cravings satisfied! T","useful":2,"cool":1},"DRYXy7A3dRtwP9GdIhMwzw":{"text":"I've eaten here so many times.  LOVE this place, one of my go to restarants for good food.","useful":2,"cool":2},"DRJSIlIhvCComBeoGY7_Ew":{"text":"Wow! This placed is extremely overpriced for the quality and amount of food you get. Our b","useful":3,"cool":0},"rLrTCsQo8bNyT9K5tgZamQ":{"text":"Definitely put this on your list of must dos when you are in NOLA. Make sure to make a res","useful":0,"cool":0},"AzDzs2Ot7yBLLzhCFi1wXw":{"text":"Food is fine and prices during happy hour are great but the staff is outrageously rude. No","useful":1,"cool":0},"jA6IZOTUNew_hxNVIC7z9g":{"text":"Been here several times. Happy hour is a ridiculous deal. My favorites are the Calabrese &","useful":0,"cool":0},"YpKSzpV0PQBb8DcUG2tWNA":{"text":"Great service. Great food. Great drinks. True southern hospitality. Thanks Ashley for ente","useful":0,"cool":0},"uE9wN8K4jRm0jMoKgOaXCw":{"text":"The best time to try this is when they have happy hour 1/2 priced pizzas and drink special","useful":0,"cool":0},"BkjpCAX_Cx27fxQTQiHntA":{"text":"The pizza was extremely delicious. One of the BEST ones I've eaten my entire life.\nI am no","useful":0,"cool":0},"CNC5EnYgfyjVIrVhSKIt-Q":{"text":"I think this might be my favorite restaurant. Although on the pricey side, they have one o","useful":1,"cool":0},"Zq_d978OlVa25oYXnvh0XQ":{"text":"Had the opportunity to try this restaurant while in New Orleans on business and was blown ","useful":0,"cool":0},"GCD8bUcEtzcKbaFEf1YGjw":{"text":"We had a late lunch and so most of our bill was on the happy hour special which is a fanta","useful":0,"cool":0},"9yNKg_5nFyT9n2Tb2zOeiQ":{"text":"Wonderful food! The rabbit pasta was a great dish with lots of flavor.  We got a half pros","useful":0,"cool":0},"O_3XpZ3_sd9D0BdpuF-wOg":{"text":"Truly disappointed. We ordered the tagliatelle with the rabbit and the wild mushroom pizza","useful":0,"cool":0},"PkaCFJdE-TVjP_CxcGMY7w":{"text":"Pizzas were great. Atmosphere great but a bit overpriced. I would recommend the prosciutto","useful":0,"cool":0},"DSJhgZ7Vs7o-Zlh5KCDWPw":{"text":"Great food served with good sized portions.  The service is top notch.  Giving it a four s","useful":0,"cool":0},"Q4exK3JTzW-mOGVJ0cP6CQ":{"text":"Four of us showed up at Domenica around 9pm on a Sunday night. Despite there being no one ","useful":0,"cool":0},"UsAQC2OUBZ0tRnpQJAUMBQ":{"text":"If there is a better deal in town than the half-price pizza and drinks happy hour at Domen","useful":0,"cool":0},"EFei2klini1qqVr9N8tWJw":{"text":"Best. Pizza. In. NOLA!!! Fiancé and I are planning a trip back just so we can go back to D","useful":2,"cool":1},"UCibOfVjA6nmTypKmfZDng":{"text":"After going to John Besh's Luke(and loving it), my wife and I saw that Domenica is also a ","useful":1,"cool":0},"JvyAofOH47zc3PukaQmtDw":{"text":"We celebrated our 30th wedding anniversary last week, with an overnight stay at The Roosev","useful":4,"cool":1},"nOADWtLn9GCvZSeVQxIvmQ":{"text":"Another amazing restaurant in New Orleans.  I went here off of a coworker's recommendation","useful":0,"cool":0},"gHlvRiieYktsF5xkEMnIBw":{"text":"Excellent food and friendly staff. A friend and I decided to order the lasagna and a pizza","useful":0,"cool":0},"kbdICohHbKy_7ATUm5yQZA":{"text":"Having lived in Italy for two years we were REALLY impressed with the pasta and sauces her","useful":0,"cool":0},"Xy4TwwJ5RDlUyU52EIAleA":{"text":"Squid ink pasta was tasty, but price was a bit steep for the portion size.","useful":0,"cool":0},"W6-MrntQN1iwK-3nfI_eCw":{"text":"Yummmmy! \n\nWe walked by Domenica's on our way to grab some burgers down the street. I saw ","useful":0,"cool":0},"CJP8wTpjZL8bdKxJ7yjw9Q":{"text":"I came to this establishment because it was close to my hotel. However, We were basically ","useful":0,"cool":0},"L74zmAF-p2lxDUPMc7i4sg":{"text":"Hmm where to start with this one.  During a recent trip my husband and I took to New Orlea","useful":0,"cool":0},"ky_4H0waehe4ezxqT4nqRg":{"text":"New Orleans has a lot of good food to offer.  When you want to take a break from creole an","useful":1,"cool":0},"BvCuhIpgPeNn2NtJim69lw":{"text":"This place was great. The happy hour prices were awesome. It was very convenient for us be","useful":1,"cool":0},"qpqSVdaGHM-3dttktO7tlg":{"text":"Great Italian with a twist. The happy hour is a 5 star keeper. Definitely would come back.","useful":0,"cool":0},"AVVEbz448SDPC6JS02pPYQ":{"text":"We are locals and went to dinner last night after the theatre. The greeting from the waite","useful":1,"cool":0},"Dz3vhEVlYjmA1yRXmSz8AA":{"text":"I have had many fine meals here. Pretty much everything I have had has been 5 star. Sit at","useful":1,"cool":1},"MLdQnXTTP1yq23dEtn63-w":{"text":"Go for happy hour (7 days a week!), you won't regret it.  At the 50% price, the pizzas don","useful":0,"cool":0},"DMlfnzZL2HZrlbt9_2rt6g":{"text":"The good: the food itself was excellent.  the meat and cheese plate was perfect and then w","useful":2,"cool":0},"APDDDLtK3juN19WzFU8YLw":{"text":"Arrived without a reservation in the evening during Jazz Fest......informed the front desk","useful":0,"cool":0},"Z5ZuOLfwGRuiteKhxyESkw":{"text":"3rd Time here! Always an amazing experience. Food is exquisite. Had the charcuterie plate,","useful":0,"cool":0},"Ck8sYXjmJVR5Jo0zObcK0w":{"text":"Food and service were amazing. Very busy. When you order a meal you only get the meal - la","useful":0,"cool":0},"7s0Wz77pW0Ayu2a1dw_Dqg":{"text":"Being a visitor to New Orleans, I knew after trying Luke that I needed to try another John","useful":0,"cool":0},"L1GDUbTTVQ-o1slf56eGDQ":{"text":"I went based on reviews. I LOVE pizza, all kinds...even frozen but I did not like this one","useful":0,"cool":0},"PXH1jj56jNai0LeFUe34CQ":{"text":"This restaurant gets 4 and a half stars. The menu is exciting, I liked this place so,much ","useful":0,"cool":0},"nWJtxJ5nskXezqhh-VzL1w":{"text":"My friends and I went here during a conference \nI have been to all of the chefs restos and","useful":0,"cool":0},"jb2JzkqxBQIPM5wO9p59wA":{"text":"After traveling over an hour to see the beautiful lobby of the Roosevelt Hotel, the restau","useful":0,"cool":0},"zFBI2JrHMLXrDmGBwxYgZQ":{"text":"Always delicious, but better make a reservation, especially if you hope to catch their hap","useful":0,"cool":0},"YRoXhLYvXurSoDcxqGh7fQ":{"text":"First time here and love it so far! Half price on practically the whole menu from 2 to 5. ","useful":0,"cool":0},"ep_0WPYgvekX23ce-Xqf0g":{"text":"Exquisite cuisine. Pricy but is worth it. Smoked pork and wild mushroom pizza was out of t","useful":1,"cool":0},"xkkPNHIrheiry4t4vsARVw":{"text":"Great John Besh restaurant in the Roosevelt Hotel. The space itself is a little sparse and","useful":0,"cool":0},"WZO0sJCD4nLm2SbLii32aA":{"text":"Fairly disappointed since my last John Besh restaurant experience (Restaurant August) was ","useful":2,"cool":0},"TiwTBr3YSb_0B9RakO6p4Q":{"text":"I would start this by saying the restaurant management is awesome, they do treat their cus","useful":0,"cool":0},"-gWvHDj7axLE6EiDkFrAvA":{"text":"Best food I've had this trip to New Orleans.  Outstanding octopus, Tuscan kale, pizza.  Ju","useful":0,"cool":0},"vJYBdPTOfoiuEededwxRLA":{"text":"Tasty food but you would expect bigger portions for apps and main courses, the pizzas are ","useful":0,"cool":0},"LBSrgrZENFvloqzRtJtAzw":{"text":"$7.50 pizza during happy hour can't be beat.  Also, the seafood couscous is a must try whi","useful":0,"cool":0},"vsn2CuJq_3ntPAo8QuY_fA":{"text":"My friends and I showed up here without a reservation but were able to snag a table in the","useful":0,"cool":0},"coFUj1VtGjv9EBp3KAFnGA":{"text":"Roasted Beets, Roasted broccoli, and a Prosciutto pizza with asparagus!  All from the wood","useful":1,"cool":0},"mQyQVCK8cWSzvzN8PjszUQ":{"text":"Here right now.  Service VERY slow, no one asked if we wanted another drink, pasta overly ","useful":0,"cool":0},"UXlmwDlLlQaQQLhRz9thuw":{"text":"Domenica is awesome!!!The waiters are friendly and cheerful and the food is great!Even tho","useful":0,"cool":0},"kej_2kSBgEScTpRoBxQQww":{"text":"Came just in time for happy hour without knowing pizzas were half off! Saw an episode of m","useful":1,"cool":1},"WWHPkUz1g6VMlPIwVrL6Qg":{"text":"Last day in town and I needed something other than the southern food I'd been gorging on. ","useful":1,"cool":0},"UpkjYVc66_dVg8c71ddfKA":{"text":"Can always count on Waldorf hotel to have decent food. Went here unplanned after drinking ","useful":0,"cool":0},"iGC68v8nrlFuZxVXcZk5Cg":{"text":"Stopped in here the first night I was in NOLA.. loved the service, wine and pizza! Exactly","useful":0,"cool":0},"OOiT5SECe0QSG5DTnoBbyA":{"text":"I have been to Domenica both for lunch and dinner, many times. The food is outstanding, se","useful":0,"cool":0},"KoNouIoL5HKKYJXn2jXfew":{"text":"Wanted to try another John Besh Restaurant. Did not disappoint. We went there for happy ho","useful":0,"cool":0},"UZV8-tx95O76vyf8EO1kIg":{"text":"The service was fantastic. Our server was knowledgeable about the menu, food preparation a","useful":1,"cool":0},"Z88k6aHhjBT44-_4Q8O40w":{"text":"this restaurant is located in the roosevelt hotel and has a happy hour from 3-6 pm everyda","useful":1,"cool":1},"INufUsE0yA2dvZcFZotBnQ":{"text":"Go for happy hour! Half of pizza, wine & beer! We tried the Clam pizza, a pork one and one","useful":0,"cool":0},"rDso96hMEinnh-d0YNWi-g":{"text":"Went there tonight for my husband's birthday. I started with panzanella - the flavor combi","useful":1,"cool":0},"3yQOSnaTbmB_2dpIJ0NZmw":{"text":"We got our food to go by calling in and picking up our food at the bar. We had the quatro ","useful":0,"cool":0},"TlNw0j_5lh3fp3J7AOSBHQ":{"text":"Food was great! My favorite was the pesto pasta and kale salad and of course dessert the c","useful":0,"cool":0},"ny54ldJCTS3W0F1M6VLtGQ":{"text":"Happy hour with half price drinks and pizza from 2-5.   Not a happy hour item but the octo","useful":2,"cool":0},"MsU6VxyAZwLBBN-2k_mpUg":{"text":"Hit or miss. At times, great, at others, average. The standout is their squid ink pasta wi","useful":0,"cool":0},"MCQ55AKCQEr6kgvQ1TwFzg":{"text":"The fiance was kind enough to take me to Domenica for an early dinner last night. \n\nWe kep","useful":5,"cool":2},"oZRTlLQvGknnMzJwrIsULA":{"text":"Stopped in for the lunch time happy hour, and was very impressed. There was no wait time, ","useful":0,"cool":0},"mftFfPlLoWpIk9QJpgMDfg":{"text":"We were staying at the Roosevelt and were luckily able to get a table late on a Saturday n","useful":1,"cool":1},"eJbXIS_7q5A8fjSgOmGqjQ":{"text":"Incredible food, cocktails, service.  Couldn't say enough great things about this place! H","useful":0,"cool":0},"MWSEy5UInOka7r4QZDU38A":{"text":"I loved eating here. The staff was very courteous and the food was divine. I don't remembe","useful":0,"cool":0},"8AjRGijNd-GF4pEYR5kw4Q":{"text":"Delicious pizza's, creative, fresh ingredients.  I always stop in for happy hour (1/2 pric","useful":0,"cool":0},"pqWRn3D5DgTMaIYT9K3EgQ":{"text":"Happy Hour is awesome! We had pizza. I enjoyed the Margherita pizza and my husband had a s","useful":0,"cool":0},"jCSAvwN-mEMiNpBn_6uCqw":{"text":"Must stop when in the area. Lamb meatballs are incredible!!!\nPizza is cooked perfectly wit","useful":0,"cool":0},"Qi0zUAcz1oVT7lutKy7pGg":{"text":"Just ate there for Valentines Day. service was excellent, food was amazing and yummy, and ","useful":0,"cool":0},"8Q8fX2ZrDaflDwzOU6leUw":{"text":"Everyone's talking about the pizza and wine happy hour deal, so I feel the need to post a ","useful":0,"cool":0},"2zHOjh_IP6rJ3hQMrgYf8Q":{"text":"I love this place!!! From the food to the ambience, everything is amazing. You should try ","useful":0,"cool":0},"KYa98PqPqA2l8wVreTB0qA":{"text":"Have a nice time and place with lots of vegetable options that does not fit with that New ","useful":0,"cool":0},"_MloUk-f7ms_1r5qeKLZYQ":{"text":"Consistently good ! I love this Italian style, thin, coal oven pizza. The whole roasted ca","useful":0,"cool":0},"07wJ3q76tX4NV7CpcRKk5Q":{"text":"Me and my boyfriend went to Domenica for NYE and it was amazing. We were seated immediatel","useful":1,"cool":0},"Vj-DVGIHuH3mZuN9o9BTbg":{"text":"This place is beautiful. I loved the decor and the modern look. The place is also really b","useful":1,"cool":1},"RfqizINpIoRkzislx6ey9Q":{"text":"So the food gets three stars, but the \"tude\" associated with this place knocks off a star.","useful":3,"cool":1},"CPa6mr2yXLdUJUnnxjFw9w":{"text":"Great food, but unfortunately worst service ever in New Orleans. Our server never came by ","useful":1,"cool":0},"UQQhGaOz7SiPNQbaNjKHqQ":{"text":"Great happy hour!  We had planned to have a late lunch around 2 PM, but learned that we'd ","useful":0,"cool":0},"BDrcygT5XORKe2wlydjMFw":{"text":"In town on a business trip, Saturday night, table for one.  Seated right away -- under the","useful":0,"cool":0},"ql23JPqZg_p3T3D-3fMsHg":{"text":"Couldn't get a reservation over the weekend (holiday weekend), but this was just a few blo","useful":0,"cool":0},"AvPFMh3Hc5l0lkGYR4p7lw":{"text":"Domenica was one of our favorite meals in New Orleans!  They were, not surprising, very bu","useful":1,"cool":0},"83H9zJz2aPwyRfJeWd1OhQ":{"text":"We came for lunch on the Saturday before Mardi Gras and didn't even have to wait for a tab","useful":2,"cool":1},"nSjmJA-zcPGg7gZop98LBw":{"text":"I see that Domenica has many good reviews so maybe I was there on an off night for the bar","useful":1,"cool":0},"b1OIKCB2SXf-ziqd9kLR_g":{"text":"Nothing lasts forever. Gone, the ginormous, amazing, deep-fried cauliflower. Gone the ligh","useful":1,"cool":0},"6UItwv_zaVqYEc6gsSzHFQ":{"text":"It started out kind of rough with the reservation.  I needed a table for 6 to celebrate an","useful":1,"cool":0},"zmNSEOdNPiRTYVcJHEdQqQ":{"text":"I was looking for Gluten Free Pasta today and I found it here. As recommended by others we","useful":0,"cool":0},"QwZTxyxkREvrA8M4rxk_7Q":{"text":"So bad that we actually cancelled our dinner reservation at Chef John Besh other restauran","useful":0,"cool":0},"uF_HdJHmLo0wVtM7n4_HJA":{"text":"Fresh and unique ingredients in their dishes gives this place their 5 stars! \n\nYou have to","useful":2,"cool":0},"OfhV8P852TBAxU0DNsXbvg":{"text":"This place was good, don't get me wrong, but I had higher expectations based on the number","useful":0,"cool":0},"-mjY5NB2RtBoRc3hRUQNrw":{"text":"This was my first and last John Besh restaurant. His dishes are insane and flavorless. \nTh","useful":1,"cool":0},"W9ScqZZPLwQJ2Eq3j8aXNQ":{"text":"The service and portion sizes are lacking. The waiter was indifferent, the food was just o","useful":0,"cool":0},"Wil3XJuMPRTnYvLeU6_CnA":{"text":"Wow. Amazing. Desmond the waiter was knowledgable and very enthusiastic about the food and","useful":1,"cool":0},"ohoVkhVfmvE9wUkcxYxkzA":{"text":"Came in for a pizza for lunch because we wanted a break from the great food this city has ","useful":0,"cool":0},"WmiyDgvo238cdpglWvCQow":{"text":"We set up several large party dinners in advance of a conference in town. Domenica was our","useful":0,"cool":0},"Cko6SjMCg93pc1K6imUW7Q":{"text":"Nicely decorated place with fun items to try on the menu. Tried out their squid ink pasta ","useful":0,"cool":0},"GizIsD8rzCfVXhrSs0ZKSQ":{"text":"We had the tutto carne pizza and lamb meatballs for an appetizer. Would HIGHLY recommend b","useful":0,"cool":0},"kMX1UsM_iDEbI_DARHvUYg":{"text":"3 words, squid ink tagliotti!! Small portion is small, a little over priced but amazing.  ","useful":0,"cool":0},"bax3NWaPzJr-kflKad9-mA":{"text":"Dinner was at the bar. Bread and Butter app. Ceaser Salad. Rabbit pasta dish.\n\nThe red win","useful":0,"cool":0},"OiG20xXS70Vl-kfdbrk5WQ":{"text":"Came here with a group of ten on a Saturday for brunch during Mardi Gras. Food was excelle","useful":0,"cool":0},"d0o8Y9s_NABiNR8uM5kJmA":{"text":"All the dishes here are delicious!!! I love their hh!! I have been here multiple times and","useful":0,"cool":0},"G-3FA4N8cf3MGJjKWAXU2g":{"text":"On a trip to New Orleans a group of my friends wanted to eat here. They had been before an","useful":0,"cool":0},"9x9Lcb__cKvSABhbEfjULA":{"text":"I debated between 2 and 3 stars, but went with 2 bc the more I stew over our service, the ","useful":1,"cool":0},"pBYKR5T9n7teUBPqHZI1qQ":{"text":"WOW! I ate for the first time at Domenica for dinner this week with my family, and I was p","useful":0,"cool":0},"BmcOFU9Gg8HTSVAGbMbZZg":{"text":"The pizza... Incredible! Each one that my family ordered was fantastic! With salami, chees","useful":0,"cool":0},"F3r-InZnnOlMKUeHQG6i6Q":{"text":"Food- Great Italian food. Their squid ink pasta is amazing along with their lasagna! Went ","useful":1,"cool":0},"jADXlkrj18N4sINsaP5EJA":{"text":"My husband and I went on a rainy night (when the Saints were in town playing Monday night ","useful":0,"cool":0},"vKtlZujVROVYkea4Ygz4mA":{"text":"Some of the best, freshest neopolitan style pizza you will get anywhere. I was really real","useful":0,"cool":0},"1jPQRKs5cCQFEr2PS1aIvg":{"text":"Might be the best pizza this side of those I had in Naples last year at the places know fo","useful":0,"cool":0},"lLvDfQpx9t__ntfQzWvGOA":{"text":"This place deserves 10 stars! Our waitress was amazingly sweet and the food was perfect!  ","useful":1,"cool":1},"7i6q3IRXZuyHF0xf94VV-w":{"text":"4 stars for the best pizza in town especially at the 1/2 price rate from 3-6pm. Favorite p","useful":0,"cool":0},"7HyNcsF4ii8AUOrEpXOVQg":{"text":"This place feels like a chain to me. Their pizza crust was good, but the flavor of my pizz","useful":0,"cool":0},"M-4Dv-Regg-Ak-akORNKZw":{"text":"Bursts and roasted Broccolini was good. The margarita pizza and tiramisu weren't the best.","useful":0,"cool":0},"dv8jGJKwe3nB62mwHfSjtA":{"text":"We had a very nice dining experience here. The server was amazing. He went over the menu i","useful":0,"cool":0},"JHk7CemdLdAC__DtCchSgw":{"text":"Great oven fired pizza! We tried the Calabrese pizza, and it was perfect. It is definitely","useful":0,"cool":0},"C-FAiTIZVxhUYeFtQWnF8g":{"text":"We were party of 14 in the private dining room.  We are  a high maintenance bunch and this","useful":0,"cool":0},"iDO5PQxHpfZbcNRBQtN9FA":{"text":"Happy hour is where it's at! We got two pizzas, a beer, and a peach Bellini for about $25!","useful":0,"cool":0},"FO97cCLg7Q2W83VuOd6PyQ":{"text":"Incredible service and great food. Awesome atmosphere. Loved strolling through the Rooseve","useful":0,"cool":0},"ZHx_fjh2jT80YdZFLvAnyQ":{"text":"One of my favorite restaurants and quite possibly the.m best Italian restaurant I've ever ","useful":0,"cool":0},"dKATehLdko7omCOc7Qc6RA":{"text":"Awesome happy hour! 50% off pizzas, wines, beers, and well cocktails.  There isn't a happy","useful":0,"cool":0},"GwUcgs8fIyx-_K4Fv-R9bw":{"text":"Another great NOLA restaurant!  We had several pizzas in our group, all of which were amaz","useful":0,"cool":0},"8Y8bvSI-wMf_mOwxpiHb1g":{"text":"The wait was long, so we got our name in and went to the Carousel Bar. This place was tota","useful":0,"cool":0},"mak0xVgeOuXBmS5q9ZRrFw":{"text":"Loved both the pasta with oxtail and chicken livers as well as the plain tomato sauce past","useful":0,"cool":0},"3bWY3CTJm3tOd9ak8V0LxA":{"text":"The greatest lasagna that has ever graced my mouth! The staff was super helpful in getting","useful":0,"cool":0},"ckg7b-RX-dTA4y5lHPHYzg":{"text":"We have eaten at Domenica a few times and consistently had a solid meal.  We ate here a fe","useful":3,"cool":1},"NWs5c03XB3udk3dBBudOtg":{"text":"I really wanted to like this place. The rating would be much higher if not for a few thing","useful":1,"cool":0},"Bs__H783nLSAMaZGVcnCeg":{"text":"went here for lunch memorial day weekend. Was conveniently located near our hotel.  Had a ","useful":0,"cool":0},"k7VeDgYK33OiTZRgDIRcNw":{"text":"We did not eat the food but the service provided by the girls at the reception was so poor","useful":0,"cool":0},"9A8D4hAfldL9AdkF2rECBA":{"text":"The pizza that I tried was very good, it reminded me a lot of the pizza at Cane Rosso in D","useful":1,"cool":0},"9Zquq3l7Cl6Ch3kRsnbfuQ":{"text":"The word is out on Happy Hour here!  Half off pizza, beer, wine and cocktails at a really ","useful":2,"cool":1},"Y0-L3EVwmYW6hE5QqJtROw":{"text":"Food took over an hour to arrive and a special request for one of the meals was not follow","useful":0,"cool":0},"k-rMpiI9qZAFr4lwTgul6g":{"text":"I had lunch at Domenica this afternoon at the Roosevelt Hotel. The photos and reviews look","useful":0,"cool":0},"3jITP4vJHJAVTFGmJHN_fw":{"text":"After going here for my second time, I felt it necessary to leave a solid review. The firs","useful":0,"cool":0},"i2HCTTb1QGU8_qGH91nkfw":{"text":"Bar manager was a little unfriendly, but the food was so good that giving less than five s","useful":0,"cool":0},"Tzb5gRauE8XBE2L641XO0A":{"text":"I'm going to be straightforward from the get-go. I'm a pizza fanatic. One of my earliest m","useful":17,"cool":13},"KcX2MQeCNnkTrn8j18n4NQ":{"text":"This was a pleasant surprise. We went to New Orleans for some Southern food but the Neapol","useful":0,"cool":0},"1m77jhVhdJ2ZIm6KROLzkw":{"text":"This review is almost entirely based on the service level received at Dominica.\n\nMy wife a","useful":0,"cool":0},"Os9rUjlu6dCRGa75SBr7jw":{"text":"This was randomly suggested as a meetup location for a gathering of co workers and I actua","useful":2,"cool":1},"4PnTkd7A40G_-R4kb2AUFw":{"text":"Enjoyable take on gastro pub food. We had a salumi-formaggio selection (coppa, lardo, shee","useful":0,"cool":0},"cFbWl80hmWwyTnNKvULcPA":{"text":"Wow! I have heard for a while that this is the best pizza in New Orleans, and after trying","useful":0,"cool":0},"7sojCZCPw3RfhtOfAORLvQ":{"text":"Am a big fan of their pizza so decided to give the five-course dining experience a try. In","useful":1,"cool":0},"NdF9OwtyqBnjdQK8M8YRfA":{"text":"Yum!  Any place that makes me rhapsodize about cauliflower to recent acquaintances is extr","useful":0,"cool":0},"IP5_JmBdgCi9cNG-b5dD1w":{"text":"Bad quality and boring food for Italian cuisine. Didn't like the service and the interior.","useful":0,"cool":0},"HnhTITxq-Gb_h-vQtP7NHw":{"text":"After 3 nights in NOLA, I was craving Italian. Everything was booked on Saturday night inc","useful":0,"cool":0},"SViMehMPssMCSx0EjAvUow":{"text":"This place is awesome. The service was great. Ginny took the time to talk to us about the ","useful":0,"cool":0},"c1jQf9l44As_xEjl8S519Q":{"text":"Interesting menu--\nCauliflower! Octopus!\n...got the wrong pizza (?)","useful":0,"cool":0},"WFYmqNO-rGPZ8ILefeCKcw":{"text":"A lively and loud place in the Roosevelt Hotel (the men's room is hard to find as its on t","useful":5,"cool":5},"gmRTToY7PpbCcA4S9qqhbg":{"text":"Ate here last night, they were very accommodating changing our reservation from 7:30 to 8:","useful":0,"cool":0},"HV8Q74HxZ7FebTB4Lhqd9Q":{"text":"When we first arrived at 5:45 on a Sunday, there were quite a few people who seemed to be ","useful":0,"cool":0},"9ho3vaCe_Rf9rTqU7BUJqQ":{"text":"Conducted a high level business luncheon with our top execs. Not an especially easy find u","useful":0,"cool":0},"KoeAitdlNCmMJg-FZc77rw":{"text":"Wanted to take a break from heavy fare, and have a slice with a drink.  A definite departu","useful":0,"cool":0},"F_kw4c5_LoTdMvUyUiHSyQ":{"text":"Don't go to their happy hour with kids (actually teens).  No matter how well behaved and h","useful":2,"cool":0},"xJq7MbxA4GZBZZWV5zNreA":{"text":"This use to be our favorite place in Nola. It was awful tonight. They changed the black in","useful":0,"cool":0},"Q6CwM0BPcrfKOYwPZxz0kA":{"text":"Mr.Besh has done it right.Great service,ambiance and Food. Perfect for a date night.food a","useful":2,"cool":0},"j-DqupwhmKZQRNPudJL_3Q":{"text":"Introduced my parents to a few new gems. 1. burrata 2. Strawberry Abita. and I think 3. fr","useful":1,"cool":1},"KRFYXH_Pck0d0CWRtbX0BA":{"text":"Wow wow wow. Where do I start? John Besh does it again. Dominica is a great experience fro","useful":1,"cool":0},"wG-cDJqnLm4sZxBll-5ZDg":{"text":"Affettati misti impressed. That prosciutto isn't playing around, y'all. It's good. Could e","useful":1,"cool":1},"FZiNFSjWg6Yca-MVqGiWwQ":{"text":"Finally had a chance to sample some non-pizza items for lunch one Saturday. The noise leve","useful":6,"cool":4},"utJSTtLkQ-tpXadRcADtRw":{"text":"We were excited to try the Domenica happy hour again. Our first visit we got two pizzas, o","useful":0,"cool":0},"LqfbxCjLuq7QY-4d8U3dKA":{"text":"HAPPY HOUR!!\n\nSeriously, a must try for happy hour, between 3 and 6pm everyday. Half price","useful":2,"cool":0},"WdjMDaP6KBKjYa3hWmTDxA":{"text":"Went for the happy hour the pizzas were good, the Bellinis were great just the wait staff ","useful":0,"cool":0},"YqwVIn-7o_aRvPRirgfYDQ":{"text":"Had a wonderful experience at Domenica. Split the baby greens salad which had a great dres","useful":1,"cool":0},"vAw8dIp6zAAx2sOrRPqIiw":{"text":"After all my previous reviews, I had thought that I wouldn't need to review Domenica for a","useful":2,"cool":0},"dMFxMqY5azmE7I95r6mxaw":{"text":"I love this place. It is seriously amazing! The cauliflower and the dip it comes with... W","useful":0,"cool":0},"cUuHYUxQiO104lSrIOzW_w":{"text":"Great service!!!!!! Our waiter was very sweet and kept up with us even though being very b","useful":0,"cool":0},"a8KK0HXtSnY-yc3gJW7wvA":{"text":"Let me keep this short (HA) cause I could go on for days about the food, the atmosphere, t","useful":0,"cool":0},"QdgPhH0PqZVa5Wlm0u7aPw":{"text":"First of all, please come during happy hour. \n\nWe were pleasantly surprised to find out th","useful":5,"cool":5},"hzwuO7evoPkWXV1KxiXzbw":{"text":"Had a great experience at Domenica. Vivian was our server. She was very attentive knowledg","useful":0,"cool":0},"GgUNcBTvy_Mn0lR3_eUwFg":{"text":"We visited Domenica for lunch on a Monday afternoon. The dining room wasn't too crowded, y","useful":0,"cool":0},"QMheQ2KWLS-RHGYoFjPvdA":{"text":"Besh's name associated with any pizza restaurant definitely grabs your attention and being","useful":9,"cool":6},"BCUOLI0XqZo27caWZGGeNA":{"text":"This place is attached to the Roosevelt Hotel, the restaurant is beautiful and simple. I s","useful":1,"cool":1},"osrw0lR3XVSKw-Unf_ZTBQ":{"text":"Sorry my family nor I will any longer dine here!!!!!! And I'm encouraging my business asso","useful":0,"cool":0},"n785NKTPM8_fc-lwSLsXXw":{"text":"I have celiac, so I usually avoid Italian restaurants.  However, I can't get enough of the","useful":1,"cool":0},"bo6AcB2W8dXRb0M0x2jJdA":{"text":"I'm a picky eater, and I judge by the looks, but here I ate everything , it was amazing! T","useful":0,"cool":0},"s_B8MXl5Eu1hCSgTIs2ktQ":{"text":"Great service until the end of our meal. I think our waitress got pretty busy. I highly re","useful":2,"cool":1},"dDqF0sGXwGE0SvL7PMLisA":{"text":"I have been several times for dinner and/or happy hour and my recent trip was so good it i","useful":8,"cool":2},"-ckrQ6wFMJAGA9gg0GYOkA":{"text":"We had reservations and were seated after a 5 minute wait. No big deal, people watching in","useful":2,"cool":2},"-d9MJbsXHcmsJv4M_LK41Q":{"text":"Holy!! Incredible food, attentive service, beautiful restaurant, such fresh, sharp flavors","useful":1,"cool":0},"M47BVA_UWP1bpaXoBFz-9g":{"text":"Calling this a 'pizza place' is like calling New Orleans 'a city'.  We fell in love on our","useful":0,"cool":0},"oL9-rGx9S7sCVPUlJ2u9rQ":{"text":"So this gets a very low rating because every time I've gotten the pizza, it's been complet","useful":0,"cool":0},"9lBOWWvLE5Br7N6mA7-Cfg":{"text":"We ended up here when the menu and Mila left something to be desired and had a religious e","useful":1,"cool":1},"XRYmHf9TGBBmdaAvUk3kpg":{"text":"I'd like to rate the food, but unfortunately, I didn't get an opportunity to put in an ord","useful":1,"cool":0},"5D5BbrxOlhQT92Jt1A90Kw":{"text":"Gorgonzola pizza\nWild mushroom\n\nHealthy wine pours\n\nAfter being at Luke two happy hours in","useful":1,"cool":0},"9EzDViIMb-mLW2p6-Pi2tQ":{"text":"We were craving something other than Cajun or creole on our 5th night in NoLa, and this fi","useful":0,"cool":0},"1QSPdsolo_AuM3-PqE1O-w":{"text":"The one thing giving this place 4 stars is the \"King cake\" dessert. The filling was amazin","useful":0,"cool":0},"22TBsMZV5wenu-LlaB0ywA":{"text":"Let me start by saying the Calabrese Pizza (hold the olives please) was outstanding.  The ","useful":0,"cool":0},"DgVQ081vgpdPkqV8X6INlw":{"text":"Outstanding restaurant. One of the best in New Orleans. Do not be fooled. It is NOT a pizz","useful":1,"cool":1},"Ylz3Z33tvUohqvfgYTrO7A":{"text":"Came for lunch on a Tuesday. Reservation did not seem to be necessary for lunch but we mad","useful":2,"cool":1},"JQQ7QH-eyHt0KkGRvlMLbQ":{"text":"Amazing meal again!  Chef made off the menu lemon dill risotto with asparagus.. amazing","useful":0,"cool":1},"Ba3G58mMeXgOx2S92d1Ptg":{"text":"The roasted cauliflower, served with a whipped goat feta cheese dip, was exquisite in its ","useful":0,"cool":0},"BhxuvRwbYyS8FffAIW4O9A":{"text":"Went here a few weeks ago for Happy Hour. Not really a great experience. There were about ","useful":0,"cool":0},"zy_GaiZNSxwbEiTqcA6_yQ":{"text":"Food was good here and service was OK (ate at bar counter). We started with the Wild mushr","useful":0,"cool":0},"zASeE4_qhr9VztRrCkxsZg":{"text":"Five star food. Light, crusty, pizza with the finest ingredients .octopus carpaccio with f","useful":0,"cool":0},"BNRHwlFitLmBKogLNtyZKw":{"text":"The food was great. As a pescatarian ordering is usually a process of elimination. There w","useful":0,"cool":0},"OsQ_e8fBD0ez4HoRNiE5LA":{"text":"Not sure what everyone else was eating when they reviewed this place. It's loud to start. ","useful":0,"cool":0},"FNWz3rEIlBAyqMeKhTbcog":{"text":"Pulled pork pizza was excellent. Try it.\n\nAte in the bar to avoid the wait. Better view of","useful":0,"cool":1},"rCY6OCGYEufJcWAKMp_ydg":{"text":"Great pizza - thin crust was a big hit. I had clam pizza-very good - the banana dessert pu","useful":0,"cool":0},"9HbotI90OCL_1tx7cpkNYg":{"text":"Quite possibly the single greatest meal I have ever eaten. Besh is a genius and one of my ","useful":1,"cool":0},"n30qfEZI-B3ShbVDF5O87Q":{"text":"We went to Domenica to celebrate a family b-day and had a group of about 16 people. First ","useful":0,"cool":0},"fHil_Rqlix6dGT0afDomiA":{"text":"Wow, what can we aY about Domenica.  Let's clear tkh about the staff.\n\nDiana was the hosts","useful":0,"cool":0},"aJUn-JYandV_e92b-C1lxA":{"text":"I must admit, we were ready to try a different cuisine other than the CajunlCreole, so we ","useful":1,"cool":0},"0_M-iV7ERh8Ma2uDUkgr_g":{"text":"So i visited the other night with several friends.  I loved the mushroom soup we tried as ","useful":0,"cool":0},"M5yGJODgq2xgrZFdH6tOmQ":{"text":"So I was hungry, but tired of eating po boys, beans and rice and all of the other Lousiana","useful":1,"cool":1},"3Nnduq7gUyN0S1Wyhq0WTQ":{"text":"I tried this place out the other week and I was impressed. The food is delicious, somewhat","useful":0,"cool":0},"xIAGYWq64K_HpOngA6Yvog":{"text":"I'd heard good things about Domenica before coming, and the food wasn't bad, but a little ","useful":0,"cool":0},"HOHNQ-ChEHDrBkUENtJYJg":{"text":"Pasta was very undercooked and oily. The bread and oil was incredibly salty. The rabbit pa","useful":0,"cool":0},"mOcLGy1EqcmL6PUoCZH2Cw":{"text":"One of the best restaurant experiences I've ever had in my life. The first time we were he","useful":0,"cool":0},"QeI-H6DnYtq0OiS4TYadkQ":{"text":"The food was amazing! We got the appetizer with three meats and two cheeses, rigatoni, and","useful":0,"cool":0},"9pFwn1ynQkpT-yoTsnT7qQ":{"text":"Fell into happy hour.  Half off drinks and pizzas 3-6 daily!  Octopus carpacio was great!","useful":0,"cool":0},"zVku4pUGjrDNO_N6-P1kbw":{"text":"Food was excellent!  As an Italian, I can say this is as close as it gets to Italy in Nola","useful":0,"cool":0},"NESXVjfdCJm8aWvzYbK4Qw":{"text":"VERY AVERAGE\n\nThis was my first trip to NOLA and I really wanted some good cooking.  We ha","useful":1,"cool":0},"gT7cSNRBLsms4_6xnACx1g":{"text":"Great atmosphere and friendly service. The salumi and formaggi was excellent, especially t","useful":0,"cool":0},"O-KHiNBc1D2nU2spdPBRdw":{"text":"The food was incredible, would highly recommend going. We got the margherita pizza and rig","useful":0,"cool":0},"sA-cPBFNBe7JGgOWArjByA":{"text":"One of our favorite meals of the week. Busy, fast paced restaurant but we never felt rushe","useful":0,"cool":0},"keEs7QSVGAWddcAfBq33jQ":{"text":"The pizzas were amazing. \nWe happened to come here during their happy hour and their price","useful":0,"cool":0},"dcyGC-FGohEEju4CXtQn1g":{"text":"Ate here on my recent buisness trip to New Orleans. It was excellent we started with an as","useful":1,"cool":0},"Fv6sB-9gxiS66N9D5I9MVA":{"text":"I wasn't sure what to expect but it is very good. The mustard green salad is excellent. Th","useful":1,"cool":0},"7nMr6beWfnF1wPU7RkrgVw":{"text":"Once again Yelp led us to an excellent restaurant. Last night we enjoyed a very good dinne","useful":0,"cool":0},"afwmMuqAJVqxKq8oljRO2g":{"text":"Came here last night with the hubby.  It has great ambiance, however it was especially lou","useful":2,"cool":3},"Xpql-kcGNpmKI-qNaTduRw":{"text":"Great italian restaurant at the Roosevelt, featuring great appetizers and delicious pizzas","useful":0,"cool":0},"IUqc7K6aPq-8jU872-jzFA":{"text":"Hard to believe this place is only rated four stars, and that the MIchelin crew hasn't at ","useful":5,"cool":0},"3OTzPgIDNvMbkkazKL3oCQ":{"text":"Gorgeous decor is what I want to start my review.The food was pretty good and the service ","useful":0,"cool":0},"MDEjnabwTzHJqalsOr-lUw":{"text":"My husband and I went here before the National Championship game.  It was very crowded but","useful":1,"cool":0},"yR2-Lz-6tJctve4aWhaG6Q":{"text":"Domenica is a fantastic restaurant in a beautiful hotel.  Great service and great food in ","useful":1,"cool":0},"AcXnW5lHL1n3pAQqSJ0xCQ":{"text":"The pizza is delicious. Server Peggy is am absolute doll. Definitely pay a visit.","useful":3,"cool":1},"l--I6vujB0-_6sHf26J9Dg":{"text":"Was in NOLA with the family and didn't spend a huge amount of time trying to find a place.","useful":0,"cool":0},"oxg3CdWpdAeTRClMVzv2tA":{"text":"Happy hour -- half off pizza and some alcohol (not sure of the specifics). \n\nThat was more","useful":0,"cool":0},"jMhyI_Lv8Si7jgJ6hVWCYg":{"text":"This restaurant is located inside the Roosevelt Hotel. I went there for lunch and had the ","useful":3,"cool":1},"TUM7k7swWi3ryh0gn5NyWw":{"text":"Dining at Domenica was the MOST disappointing aspect of my recent trip to New Orleans. I'm","useful":0,"cool":0},"ZHVIR0YW--g1qUZ-18fwjg":{"text":"Being that I'm such a John Besh groupie, I never thought I would have to write such a revi","useful":7,"cool":1},"JYjPmBe_Ki8YskaeDsYgiQ":{"text":"This was the best meal I had in NOLA, and that's saying something.  We ordered the clam pi","useful":1,"cool":0},"kRziwLZskUKi6_np9kC2jw":{"text":"Food is enjoyable. Pizza is delicious. Buuuuuuttttt not worth the price if it's not happy ","useful":0,"cool":0},"Rag1ndIaiirBOaHcmoj4Sw":{"text":"5 Stars for the quality of the food, service, and value. Truly incredible flavors in all t","useful":0,"cool":0},"-xtoQzg51EE9wfuRdgz-6w":{"text":"We went down for a quick dinner, service was good, fast and friendly.  Food was good, noth","useful":0,"cool":0},"HX8CalfBXOxdkLBxH7FIbQ":{"text":"Once again my tastebuds are delighted. I feel as though I have been to heaven and back. Ou","useful":0,"cool":0},"EKXHujugPXUhv39PHRbqgA":{"text":"Food is amazing. Especially happy our pizza. However the only reason it isn't getting 5 st","useful":0,"cool":0},"juUPPEGCP8Nal7NFRAXfbQ":{"text":"Down for a bachelor party and knew I had to hit this place; so glad I did. \n\n*Happy hour i","useful":2,"cool":1},"-f3Qv-eC3yeBNKchNBcPGg":{"text":"Don't even think about hesitating..just go, and enjoy one of the best meals in NOLA!\nYes..","useful":0,"cool":0},"0PrHwg7Z-iPojNCBKtbE-A":{"text":"I can see that this would be great for happy hour, but for anything else I would not recom","useful":1,"cool":0},"K4RwsgWHoqAJb_Xfem1YMA":{"text":"This is actually the only restaurant I returned to twice while in NOLA for 10 days. I woul","useful":0,"cool":0},"teFTYxL4xmDT6ctlChawSw":{"text":"I really like this place. It's my 4th time here over a few trips to NOLA. If you want a la","useful":0,"cool":0},"2Kr_5QbudY2LIJmh9TX1mQ":{"text":"Food was tasty service was APPALLING. I would avoid this restaurant even if the meal was c","useful":0,"cool":0},"TwW2-EIkcYQmow8O3YxBWQ":{"text":"Great wine, great pizza , great pasta and the best roasted cauliflower. I highly recommend","useful":0,"cool":0},"1EpwLe5lboXZfSgL1PnkgA":{"text":"- Menu with wide selection\n- Amazing food and services (Our waiter, Jo was exceptional).\n-","useful":1,"cool":0},"Snyz6jnHGKI431op1Zbrog":{"text":"Super scrumptious!! The octopus carpaccio and tagliatelle were both fantastic! We also ord","useful":0,"cool":0},"3xOEH1bvpmNqBPv-QDmltQ":{"text":"The group I was with wanted to try this place so we decided to go. Its a more contemporary","useful":0,"cool":0},"hToEd3N2ZCwJxGFp2mO5gA":{"text":"The food is good but lacks on the presentation side. The cauliflower plate was interesting","useful":1,"cool":0},"Xq3LC4IdynLC5HkBJYFaBw":{"text":"One of my absolute favorite dining experiences in the French Quarter. Amazing happy hour s","useful":0,"cool":0},"tYSkjtsJANS20PHB9dmclw":{"text":"This Chef John Besh Group recommendation came from a foodie friend (Dir of Food and Bevera","useful":1,"cool":0},"_7MAMucWUaHVxC_qnaZgrg":{"text":"Lovely!! We lived in Sicily and this is the best and freshest pasta we've had since!!!","useful":0,"cool":0},"Y_3bZqpvAbga8QCZafepdA":{"text":"I rarely write reviews and when I do it's either due to fantastic food/service or because ","useful":2,"cool":0},"Sb4aEahYVCrsbSQVOdW0Pw":{"text":"So glad my nephew wanted pizza because we ended up here. It's inside the Roosevelt Hotel, ","useful":4,"cool":3},"LMA2YKl4vzy0mEGXM0g4sQ":{"text":"My boyfriend and I just had a wonderful date night at Domenica. Food was awesome, atmosphe","useful":0,"cool":0},"xo6gsuJG8djm3PUP94GgGQ":{"text":"I had heard great things about this restaurant and it lived up to them all. Had a pork & f","useful":0,"cool":0},"nxglVwi0SizXn3WVgfiVJw":{"text":"Single ladies gotta eat in this town too, ya know.  So...went for Happy Hour at Domenica. ","useful":0,"cool":1},"XqkuEy3HEmG071MUd4AO3w":{"text":"The happy hour from 2-5 is a must. Half price beers and pizza. Would have gladly paid full","useful":0,"cool":0},"wCE4oYotJ1kx1nCbfJOhdg":{"text":"The best pizza I've had in New Orleans. It's in the luxurious Roosevelt hotel across the s","useful":0,"cool":0},"YkyjhrhiZKbg9UzRkAridA":{"text":"Great place, the happy hour special is to die for and our waiter was very knowledgable abo","useful":0,"cool":0},"-4nTcaMynsAcX05sIjQBbg":{"text":"Great pizza and good cocktails, who could ask for more. Set inside the Roosevelt (a Waldor","useful":1,"cool":0},"CFGRPrevwPE8bp8bAG_xDA":{"text":"Great pizza. We ordered the margherita pizza, accompanied by the arugula and beet salad. I","useful":1,"cool":0},"sgJChkToX-yRZI6aG3hLlQ":{"text":"This is a beautiful restaurant. The food was solid. The waiters were OK.\n\nWild Mushroom Pi","useful":0,"cool":0},"v1NpPmlEaSupgZorydLRww":{"text":"Food was amazing! Service was absolutely terrible.  Literally waited for over 1.5 hours fo","useful":0,"cool":0},"eQaMETQZMxgVNIZYBPyJZg":{"text":"We were those terrible people who come in 45min before closing and got nothing but a big w","useful":0,"cool":0},"1APQhcFdW63Co2Tp6NQYxA":{"text":"I ordered the squid ink pasta, recommended by our server, and it was okay tasting but I go","useful":0,"cool":0},"mbZ6gbfu-DI48CHs4sImrQ":{"text":"This place is seriously in the cut, not on a Main Street but definitely a great find. I'm ","useful":0,"cool":0},"pyPgVEa6u2bSOBmvLAcw7g":{"text":"This is a great choice when in town with a large group!  I was here in May while on a busi","useful":0,"cool":0},"pQrRGQZ_U8UQ0uG8Td_dKw":{"text":"A must try nice menu great small plates fresh ingredients pizza excellent and home made pa","useful":0,"cool":0},"AWo47EPwQD8CksW1m72l8A":{"text":"I bring friends here every time they visit the city. We always start with a meat and chees","useful":0,"cool":0},"LmNElApggikmSDe1s6sXfA":{"text":"What is the best part of Domenica? The incredible happy hour they host 7 days a week! My b","useful":1,"cool":0},"U7n5L9Dc67456bceeZyOYQ":{"text":"Absolutely loved this place. The charcuterie platter was the best I've had. A must visit C","useful":0,"cool":0},"CYizW-wcePfzIR36i2_q8Q":{"text":"Our service was less than stellar. My husband told him to make sure to keep an eye on his ","useful":0,"cool":0},"U1X2dacIUS-hO6sMmxdGDw":{"text":"Every meal I've ever had at Domenica has been outstanding, but this time they truly went a","useful":1,"cool":0},"kRaXWKSr6yQIfTpfulXbcQ":{"text":"Great pizza, if you like bacon make sure you get it on your pizza. The bacon was smokey an","useful":1,"cool":0},"7oO7iBf1WYRXms70MDKsyw":{"text":"This place is located inside Roosevelt hotel. It's a very nice elegant Italian restaurant.","useful":2,"cool":1},"-3S_Z75iOq-jdy6BFxSvzQ":{"text":"After arriving in New Orleans, we settled on having dinner at Domenica.  The atmosphere is","useful":1,"cool":1},"4s1mkJDnEi8m7fK5YRC1nA":{"text":"All I can say is OMG delish and adventurous.  Not your standard spaghetti Italian place.  ","useful":0,"cool":0},"05_x0T_-E-1a5oqwMUAUnA":{"text":"Still one of my favorite Happy Hour spots in the city, though I think they may have upped ","useful":2,"cool":1},"kRuBmFOjhWHg3TbPp-cmAw":{"text":"small plates done well, good service, good drinks, classy and not as loud as other places ","useful":0,"cool":0},"kwxLr3XYdVxHge7aiuO_cw":{"text":"Excellent food.  We had the antipasti misti and the tagliatelle with rabbit.  Both were ex","useful":0,"cool":0},"fNtTC7k_soXk4TViMc2fbw":{"text":"We had a lovely dinner here on our last trip to New Orleans.  They offer small plates, so ","useful":0,"cool":0},"hpVwZBYPPLh27XsrSJ59WA":{"text":"I feel stupid reviewing this place.  Maybe I will write a story arguing the sun coming up ","useful":0,"cool":0},"fgtq20B01tw68EzU7gWv7g":{"text":"Nice oasis on Cajun / Creole land. Excellent Italian place. The lasagna is the best. The p","useful":0,"cool":0},"zugIUvFOD9KYBzWZdca3IA":{"text":"Their claim to fame is homemade pasta and dough for their pizzas. The pizza was fabulous t","useful":0,"cool":0},"ref3hE792dgObGwqCS6RNg":{"text":"Good pizza and excellent service. Based on the reviews, we expected a better pizza with a ","useful":0,"cool":0},"_-0PorOOJAlzE8WLlCcHCw":{"text":"Squid Ink Pasta is 100% incredible. Hands down the best pasta I've had; best dish I've had","useful":0,"cool":0},"DlxDqGTD2gB-DMthiqbcpg":{"text":"Salami pizza was very good.  We shared a pizza and a lasagna, very very good lasagna but v","useful":0,"cool":0},"_jYnncbU39tHwtqn8bDRNQ":{"text":"Domenica is great!  John Besh's pizza is right at home in New Orleans with a lot of pork p","useful":0,"cool":0},"KG6P_FlDCj8v9e9wHBZfWg":{"text":"I came here solely off of yelp reviews and I wasn't disappointed. Their happy hour is amaz","useful":1,"cool":0},"CpNnA8Tj4zUPT9r-DljOmg":{"text":"Very chic restaurant located in the Roosevelt Hotel with a fabulous Italian menu. So many ","useful":0,"cool":0},"P0PcbhroDsWkKcwziS9rwg":{"text":"So this is John Besh's pizza restaurant in the Roosevelt Hotel. The other day I was watchi","useful":0,"cool":0},"AE1N5YVOV7PuOEuiskuY_A":{"text":"We LOVED this restaurant!!! A friend recommended it to us, she said it was a little noisy ","useful":0,"cool":0},"4PNgOu1mbTPBglzU6aDllA":{"text":"My wife and I went to NOLA for a little weekend getaway and we really did not have any pla","useful":0,"cool":0},"STmsO9IKGbRUfH9IFjgGLg":{"text":"Domenica has my absolute favorite meat and cheese plates. They also have one of my favorit","useful":5,"cool":4},"chfqxFz9A5Kz6nkz-WJhjw":{"text":"This is one of my favorite places in downtown New Orleans.  Now, if you want to have some ","useful":0,"cool":0},"aLyy1IbltRFt2wESArprag":{"text":"I had some incredible food here right before Christmas. The lamb meatball pizza was amazin","useful":2,"cool":2},"K9spdHFTt7rRu81VustAsA":{"text":"Once in a long while, a person can have a high expectation that actually being met, and mo","useful":2,"cool":3},"mTs18_6DNnehusXnfobNOQ":{"text":"My review is for 3.5 stars.\n\nFour of us had reservations for 5:45 so that we'd have plenty","useful":5,"cool":4},"h-Df8frlLwoC45MsAuk0xg":{"text":"Went here for a business lunch and it was perfect.  The roasted cauliflower was delightful","useful":0,"cool":0},"g_YAG0mRIjY8p6EsT66cSA":{"text":"It really is true what they say about the pizza here,  it is one of the best I've ever had","useful":1,"cool":0},"mEJ6MWehzU8WeNZsUF2WWA":{"text":"Amazing restaurant. Wonderful food and staff. Would give 6 stars if they allowed. Atmosphe","useful":0,"cool":0},"B4DTmPKlM4i1-F16s4BmkA":{"text":"Dear John Besh,\n\nOur first foray into your dining establishments was last year on our fami","useful":4,"cool":0},"oPsqo6OM_4ZijSepghTp4g":{"text":"Excellent food and service.  I had an amazing wood-fired goat dish.  Unbelievably deliciou","useful":0,"cool":0},"yXa4rvbr985fFog1uLA4yg":{"text":"Great atmosphere, wonderful service, amazing food!! The meat and cheese plate to start Ver","useful":0,"cool":0},"Lc1DoeEIiQNUKHXuX2kx2g":{"text":"Before my trip out to NOLA, I coincidentally received a Destinations Magazine highlighting","useful":1,"cool":1},"bpPOX96E-rV2ppjHfhIklA":{"text":"Really amazing creative food...the whole roasted head of cauliflower with whipped feta dip","useful":0,"cool":0},"a3jeaSYnYSBIjPHhQRVzSQ":{"text":"Food is great.. I eat there two nights I had the pasta and the Margarita Pizza... As for a","useful":0,"cool":0},"7fWJZRmApxoWx9T3iiXzCQ":{"text":"I came here with my girlfriend and her parents for her 22nd birthday. We came right after ","useful":0,"cool":0},"GPEY40OXs0gIFbgUYwPBpg":{"text":"I went for lunch yesterday & it was great, I'd made a reservation on opentable.com.  I had","useful":0,"cool":0},"XTgo-xeZT76LRNmqaANd0A":{"text":"Chef John Besh has another winner on his hands here with Domenica.  The restaurant is beau","useful":0,"cool":1},"FswxQG5jqrywJKzukCGD_A":{"text":"Classy. Great Food. Amazing Ambiance. Wonderful Service. I would recommend all their pizza","useful":0,"cool":0},"XvKDsKX8Va6rG9h74jmhug":{"text":"This is a nice Italian restaurant, slightly upmarket and definitely over hyped. They have ","useful":0,"cool":1},"s9UaqGMjm3MGUdz1vMtwrg":{"text":"Love the food great pizza & drinks are so yummy!! I was starving after flight was looking ","useful":1,"cool":0},"OLsDi3xKOGGPNwQ-IVp2tw":{"text":"4 stars for the squid ink pasta!!!! The other yelpers were right!   Buttery inky and the m","useful":0,"cool":0},"esyUg0CqF9MvAL0bJh8E9g":{"text":"First time here,will come back! Ordered the Margherita pizza very satisfied big portions..","useful":0,"cool":0},"_Mvk9sHjY9ebFaCDI_O3qg":{"text":"YES!!\nNow that was some good Italian!!\nProb the best meal we had in NOLA.\n\n-Fried Tuscan k","useful":0,"cool":0},"VQAYQfeEYu4DxJavCekoLA":{"text":"The greatest meal in New Orleans for under $40. The happy hour here is insane. Half price ","useful":3,"cool":0},"f5Cr_Iss20dOcO1ZO-MDKA":{"text":"We LOVE John Besh and try to eat at one of his restaurants every time we visit New Orleans","useful":0,"cool":0},"x8d60J5Yu2BEGBwEL6jkdw":{"text":"Came here on a recent Sunday afternoon for a John Besh happy hour: every day from 3-6pm, p","useful":0,"cool":0},"9u5HdIdysbdrHUKydzTEXw":{"text":"So I've been back a few times and found out the service is much better in the bar area. Th","useful":0,"cool":0},"wdWBTOuSgNTRbY26MdGbqg":{"text":"Good starters, slightly above average mains, good desserts. Service is terrible, waiters p","useful":0,"cool":0},"COF-LcEOSmlAnDf6O4-V7g":{"text":"I ended up at domenica because a close by caujin place was closed for the week.  Im so gla","useful":1,"cool":0},"xos8kKVdw-KV3LPHEqi8_A":{"text":"First night in town and my husbands colleague recommended. Very popular and busy, so make ","useful":0,"cool":0},"jDUip01Nlygc-Dk5cIyDXg":{"text":"On a Tuesday night, management has not figured out how to seat people, with a crowd  at th","useful":1,"cool":0},"vy7sMm-jnGJEXEYmdJy5fg":{"text":"Amazing. Roasted cauliflower a must. Beautiful atmosphere. Great pizza. Wonderful desserts","useful":0,"cool":0},"vuVZZVJW2ekYhSTENIvZUA":{"text":"Would I go back? No. Why? Hostess and food. Let me start with the hostess. It was Christma","useful":0,"cool":0},"opFQp055OJQP8wc9HUq90A":{"text":"Out of this world!! Best pizza I've had in Louisiana. Will 100% be back, they have a cauli","useful":0,"cool":0},"3ZghaSy0KEmutS_pmGnZkw":{"text":"We went to Domenica for lunch as soon as we got to NOLA. We had great cocktails and a fabu","useful":0,"cool":0},"LRYS3LZZxpAhakkX9R8_bA":{"text":"Had my birthday dinner at Domenicas last night and it was an amazing experience. The locat","useful":0,"cool":0},"hRpQmwGtdi2D0UeRTX2tbA":{"text":"A for taste\nC for service\nC for wait for a table (~40 min @ 4PM)\n\nI went during happy hour","useful":0,"cool":0},"q1sRZ8ENDCzKgIjdaWE4Mg":{"text":"Truly best pizza we have tasted. Unfortunately, we were not served the special beignets th","useful":0,"cool":0},"Q0EoUeBx1G_elggiHkCMPg":{"text":"Go for happy hour and have half off pizza and drinks. The pizza is worth paying full price","useful":4,"cool":2},"xkIVIAFTrtZIXVQBjhPgqA":{"text":"-love octopus carpaccio\n-love meat plate-speck/breasola/blue cheese\n-love squid ink pasta ","useful":0,"cool":0},"nu1quEWir-4SFvPjey3zjg":{"text":"I came here about a week ago and was very pleased with the duck and clam pizza. In additio","useful":2,"cool":3},"bSkj0rwu8W2EFeDl7mFN8w":{"text":"Love their happy hour with half price pizza and wine. Service has always been efficient an","useful":0,"cool":0},"xNAsmM_u3pXoc4BLJUGDJg":{"text":"A friend with knowledge of the area suggested a different restaurant but we decided to try","useful":0,"cool":0},"vE8OQ82lwnXK4wr9FSkuGg":{"text":"First time visit. Was not disappointed. Started with the Chef's Choice Salumi and Fromage ","useful":1,"cool":1},"_J603hPFpXhSFe159UcMBg":{"text":"New Orleans, home of cheap fried chicken, hurricanes and private rooms behind the kitchen.","useful":0,"cool":0},"BIJCW2IcM3sXis19HqpTBA":{"text":"Domenica was AWESOME AWESOME AWESOME!!  Only downside is that its in a hotel... but ...\nFo","useful":1,"cool":0},"Zr2Zvr0PCMjk72l6kOjVFg":{"text":"This is one of my absolute favorite restaurants in all of New Orleans, which is definitely","useful":1,"cool":0},"yvazqbJ4pGyZzpf9vplpqw":{"text":"Possibly in my top 3 Italian places nationwide. Great ambiance crossing the line between f","useful":0,"cool":0},"2cDbskCOK5m_g8CgcQswFQ":{"text":"Food was pretty good. NOthing special, felt liek more generic italian food. I prefer my pa","useful":0,"cool":0},"8NWi5d9wCEb_9jHKKg94IA":{"text":"Not sure what to expect. I was a lone diner staying in the Hotel Roosevelt. The experience","useful":1,"cool":0},"1SULaikDtlfIIqnvWs6BqQ":{"text":"good pasta and pizza.  Be sure to make reservations, as tables go quickly.","useful":0,"cool":0},"LUqen48a_GAg4iW9Oweu1g":{"text":"This is some of the finest pizza in New Orleans.  Wanted to get something weird and chose ","useful":0,"cool":0},"HxMk-qDQohOpLbICx8TFyQ":{"text":"Have you ever started eating something and realized you simply cannot stop?  The fried kal","useful":0,"cool":0},"j6kqcJcezQ_x3HkY5P97Vw":{"text":"Enjoyed this place a lot !\n\nI had the fried kale and mushroom pizza, both were great but t","useful":0,"cool":0},"FU1qxeCFLJ6fjfJc4r3NfQ":{"text":"Omg this place is amazing the food service everything was great literally my top five plac","useful":0,"cool":0},"80EmxJubuHHDMwLLxM4Y4w":{"text":"This place is super cool.. It's casual but I'd dress a little nicer than just flip flops a","useful":0,"cool":0},"MkHPkxXngPj2hzy1k723Zg":{"text":"Pros:\n-Food tastes great\n-Excellent atmosphere\n-Very well dressed customers\n-Free Brownie-","useful":0,"cool":0},"wVh2PiMdgP2GRj1sJ_07xg":{"text":"Met some friends on 7/31 for a quick bite before going on a ghost tour.  Only had one sala","useful":1,"cool":0},"dWEBW8Z-4nvKRTaCDHTHlg":{"text":"I really like this place!  We went for the happy hour and had awesome pizza and a very tas","useful":0,"cool":0},"AOPlQ8WBg2cbFtgRvMLUHQ":{"text":"My favorite place in New Orleans. Really inventive New American, and a bit refreshing to g","useful":0,"cool":0},"1BsHtlsGaSq002ImsvirKw":{"text":"Probably one of the best meals I had. I had rabbit and cramini mushroom pasta. The waiter ","useful":0,"cool":0},"Vr1d-o-tm59Cev7C7TtZAA":{"text":"Delicious restaurant in the base of the Roosevelt hotel. We stopped by here for 2 happy ho","useful":0,"cool":0},"bTKkNn9tczhwD4iZvrx-Cw":{"text":"I just really like this place.  I feel fancy when I come here and don't really have to try","useful":0,"cool":0},"dZ9h7OSH46jyWbxZrt00ow":{"text":"I visit NOLA 3 or 4 times a year and this is one (if not the only) restaurant I make sure ","useful":0,"cool":0},"klxSTCyAPLHtOeo5SW71Fg":{"text":"Roasted Cauliflower was absolutely delicious. You can taste the flavors so well and for a ","useful":0,"cool":0},"wvfbz18Nsjmu4kseefLL3A":{"text":"Had high hopes for this meal the last night of our trip, but left questioning what we had ","useful":0,"cool":0},"KiTJELDgz7_pQ_wxvkQp2A":{"text":"Pizzas here are to die for. The crust alone is amazing- so fresh and flavorful! Last time ","useful":0,"cool":0},"0b4iHioW0cipBkd6bgmX3Q":{"text":"I was searching for a place that has great food and especially good pizzas.  This place is","useful":0,"cool":0},"4adkpyTc-R5Vs29xOIvUxQ":{"text":"Been here once but have eaten take out multiple times. Seems pretty consistent in taste. I","useful":0,"cool":0},"xO_3lig0Py_HvkuroN-J8w":{"text":"Absolutely love love the prosciutto pizza at this place ($13,  - 8 slices). As good as the","useful":1,"cool":0},"p3uFoQYYW5q9sLKj5Nu-oA":{"text":"Spectacular experience!  My wife and I came for happy hour and were very impressed. Roaste","useful":0,"cool":0},"mrv1zPu4IoJulnvy6N1wyw":{"text":"I live and work Uptown, so getting downtown for happy hour is rare for me, but I finally g","useful":1,"cool":1},"zVfqSMAqYk0T1kk1BFw55g":{"text":"Great happy hour deals. I had sparkling wine and pizza. I had two different pizzas. I had ","useful":0,"cool":0},"_K36bBIp0v6PxUjk7v9e6A":{"text":"Definitely my favorite restaurant from our entire trip to New Orleans! I'm a huge fan of I","useful":0,"cool":0},"1yJyv8MWM6D3d6IvdA_YsA":{"text":"I know what you are thinking, 5 stars, really?  Hear me out, it isn't as ridiculous as it ","useful":2,"cool":2},"wTfIzuhS5FHsHNNdU1a0Zg":{"text":"Service was perfect; food even better. Started with the fried kale and would be happy to m","useful":0,"cool":0},"HitBK63uOR_VsEtG_huFcg":{"text":"OLGA, RYAN & NICOLE WERE FANTASTIC!!!! Great mix of personalities who complement each othe","useful":1,"cool":0},"SppgqOfoKfBsmJSk8Rylfg":{"text":"Still the best pizza in town! Chef Alon is a master at what he does, and they just opened ","useful":0,"cool":0},"pcjktOieJ9dXXSmbISV9mQ":{"text":"Some of the best food we had in town and our visit included Commander's Palace & Muriel's.","useful":0,"cool":0},"kuwKhY1DkKuJQEWFDT4xqQ":{"text":"This place is awesome. I visited New Orleans for 5 days, and ended up going here twice bec","useful":0,"cool":0},"VDhgRO3CGKmzhVx3SCeR1Q":{"text":"Now they've added small plates to their happy hour special, and they are delicious! Try th","useful":1,"cool":1},"3GCWubxHPnOZzeWgEdTU-Q":{"text":"Eh, as far as pizza places go, this is okay. \n\nI find it highly overpriced, sure that come","useful":0,"cool":0},"wlwyFciXBvCv2-8aH9vitQ":{"text":"This was my last Restaurant Week visit. I went on Sunday, September 18th. Not alone, this ","useful":0,"cool":0},"b04H8lx5j4zwOsEe3e-x4g":{"text":"I've now dined at Domenica on three different occasions when in NOLA for business and been","useful":1,"cool":2},"TJ0IRA0nQec9kVSJAIHdVw":{"text":"Half off pizza for happy hour!!! I made my own. Mozz, Arugula, anchovies, prosciutto, and ","useful":1,"cool":0},"ci8HEIRy-_8Kk5bDnTsFxA":{"text":"I always go during happy hour. Highly recommended\nSeven nights a week,  half-off pizzas.\nA","useful":1,"cool":0},"Pr_tPLNeXlV8z4zGNm07gA":{"text":"as we were walking by, i peaked inside as this place was Poppin.  decided we needed to eat","useful":0,"cool":0},"e93xVEWdQNGGuN0FCfrTiQ":{"text":"The atmosphere was excellent along with edit staff. The rigatoni dish was very small, I wa","useful":0,"cool":0},"d7PcpnTOFX58tFcddftXkA":{"text":"We went during happy hour which was great because they have half priced pizzas from 2-5. W","useful":0,"cool":0},"kT4gpInxRBm-CSYmcQFP5g":{"text":"Oh my goodness this was good!  We had the clam pizza and it was awesome!  To the folks tha","useful":0,"cool":0},"2rpRFtuJjb4cxHsRzoNc_Q":{"text":"Great food! \n\nWe ordered the Margherita pizza, arugula salad, and the crispy squash blosso","useful":0,"cool":0},"MYXQQ2pDOt8j_c2ptXMwpw":{"text":"This is on my top five favorite New Orleans spots. Get the whole roasted Cauliflower with ","useful":0,"cool":0},"C7fKeEfaGyBZ9nbjkgmFng":{"text":"Had a very tasty tagliatelle with ox tail and deep-fried chicken liver. Also, the half pri","useful":0,"cool":0},"64H6gzzkrgJ5pL3THO5dDw":{"text":"The atmosphere is classic at the hotel restaurant. It doesn't feel very Italian or romanti","useful":2,"cool":0},"XSQxjG18FQUZVi18vgTQkg":{"text":"I stumbled onto this place thanks to Yelp, and I'm so so glad that I did. \n\nThe food was t","useful":0,"cool":0},"pRfytt3Yn193sBacSyzW7A":{"text":"Great charcuterie board, excellent entree and very nice atmosphere. Worth the splurge!","useful":0,"cool":0},"yEtOO1r0sGDTASDrH8U89g":{"text":"If it were not for troubling service, we would rate Domenica five stars for food.  After b","useful":0,"cool":0},"Q61nV1mNSqJLmbbIdSGWlA":{"text":"I couldn't believe that Nola could have a such nice pizzeria like Domenica.\nNice decor wit","useful":2,"cool":0},"6Ab0PYH5qLLWSvjN6wD6bQ":{"text":"We just had a great happy hour experience at Domenica last Sunday.  It was my Mom's 60th b","useful":0,"cool":0},"DO7mdhXjwmS8KayzhwRK2Q":{"text":"Went here for dinner last night.  It was pretty good!  We had the burrata, peaches and bre","useful":2,"cool":1},"LbpvPcHU3VTb6O8K2CeGTA":{"text":"Half priced pizzas and beer between 2-5pm daily? Fantastic.  We tried the Proscuitto and A","useful":0,"cool":0},"b_3nyqgBjKUbhzsKTeWelw":{"text":"The pizza is all right (though $13 for the margherita was a bit much, considering the qual","useful":2,"cool":1},"hIOm8awkPth5mKFDCH-0jQ":{"text":"This is our second time to Domenica. I really lime their pizza and pasta. We ordered clams","useful":0,"cool":0},"p83WeLsDC1QLDe2xqqiQFg":{"text":"Had the best lunch all by myself! They sat me at a window so I could people watch. My wait","useful":0,"cool":0},"c1oE1HIUN47K-nclicndSw":{"text":"In 2013 the wife and I took our anniversary trip to New Orleans. We saw this restaurant on","useful":0,"cool":0},"SxgNgOBmbTudFWMxvcwfLQ":{"text":"Amazing dinner here. Roasted cauliflower, lasagna, pizza.  Best meal while in New Orleans.","useful":0,"cool":0},"hMiUGp2s_bei0ivOm2-mbg":{"text":"Place was clean which was refreshing. Happy hour was awesome! Half of pizza! Pizza was pre","useful":0,"cool":0},"nqA33HkmaVwppPEwFwN-pg":{"text":"Another great John Besh restaurant. The service was outstanding and the food was equally g","useful":0,"cool":0},"etxJP8JEFhzd5ILVmv09nw":{"text":"Lunch here was super ! Joebie , our waiter was great! We enjoyed some Spinach Stracci with","useful":1,"cool":0},"YQzVC-IQkAORXnYrwa5mZg":{"text":"Be prepared to wait! It's worth it. We ate here on a Thursday evening around 8 o' clock, a","useful":0,"cool":0},"xyL24KN-ut4Ew9GdMkKigA":{"text":"Saw a picture of the squid ink pasta and wanted to try this place. The pizza here was good","useful":0,"cool":0},"nKtUBtdFraOpuRfbLGlR7w":{"text":"great! we were visiting New Orleans on New Year's and were able to score a table early new","useful":0,"cool":0},"0pGrHT8ZbD_3VbHtJMfKUg":{"text":"If you're in the mood for a fancy meal in New Orleans this is the spot. Roasted cauliflowe","useful":1,"cool":0},"mWGvH-qQn9-kkr32wiBgbA":{"text":"I would surely go again, when visiting Nola.    It's a lovely trendy Italian restaurant. T","useful":0,"cool":0},"lRy6tibzrjtTy37FSqOQpw":{"text":"It is a paradise of pizza-lovers. There is so many kinds of Pizza which you can barely fin","useful":0,"cool":0},"QAGCJurW4px404KMkJMkTw":{"text":"My husband and I stayed at the Waldorf Astoria and went to Domenica for a late night snack","useful":1,"cool":0},"JE4q1N67vuOAhbRE9tqE-Q":{"text":"We had the pizza and it was fabulous! Great place to eat. Waitress  was friendly and promp","useful":0,"cool":0},"p58oo2w0cK8CJnned7Ybqg":{"text":"We wanted to like this place. We even gave it a second chance but no avail. This is a bad ","useful":0,"cool":0},"lmCVVCCIlLtDf-hUHKFqIQ":{"text":"Half-priced pizzas during happy hour (2-5pm - every day of the week) can't be beat. Our fa","useful":0,"cool":0},"IWJbxAKhP2Rv8AkPUwz1bw":{"text":"Simply amazing - 100% worth it. I would highly recommend trying this place, it is not chea","useful":1,"cool":0},"DTD_v1Avh4x3FqX5cTa6kQ":{"text":"We had a great meal, the fried kale was excellent, excellent drinks, and the pasta was jus","useful":0,"cool":0},"PJ3hzT6KlmT_xebMZm2WNA":{"text":"Should have skipped this place. Came here on the recommendation of a friend and wanted to ","useful":0,"cool":0},"2zq-fCOGWJKFxmARc2T9vg":{"text":"Discovered Pizza Domenica on Magazine St. over a year ago during their Pizza Happy Hour wh","useful":0,"cool":0},"gyVj10K0MnA4cHyBeN0sxg":{"text":"Fabulous meal at Domenica. Great service and truly enjoyable food. The decor is chic and m","useful":1,"cool":0},"qyrty_7GEQpacMQcIGt-qA":{"text":"Oh sad day. I won't alter my rating but my last trip to Domenica revealed a change to thei","useful":2,"cool":1},"GQAHNaxGPThSRA14KZWxwA":{"text":"the pizza's are very good. The stracci was excellent, the wood smoked goat was okay, a lit","useful":0,"cool":0},"-JWp9Ul-7ejIj0nETvPQDQ":{"text":"My husband and I visited on the final night of our honeymoon, and this was dinner was the ","useful":3,"cool":1},"i__3_zUXfuV9Cxvp1JBi6g":{"text":"This place is spot on. Another John Besh must-visit restaurant. The cauliflower is worth c","useful":0,"cool":0},"Tl5PhktQg2EqEdqFQyVSCQ":{"text":"This restaurant is close to my home, so we walked there and had a dinner. The best food is","useful":0,"cool":0},"TOUZMUia3v6i8Bfm6NPn5A":{"text":"Great atmosphere, clean and comfortable. The staff is very helpful and knowledgable.\nLoved","useful":0,"cool":0},"GcAXbWLTsaVJo55gOlM6kg":{"text":"Domenica sat us with no reservations in 30 minutes on a Friday night. Just enough time to ","useful":0,"cool":0},"LWlLu5VWgKYyqGI16snYnw":{"text":"Came here for a birthday celebration on a Monday night. We came in early and there was hap","useful":0,"cool":0},"ky-OwQwlpsRqtPyOnC1BYQ":{"text":"yum! they do take out! \n\ni got the roasted broccoli and campanelle white bolongnese with b","useful":0,"cool":0},"rnosxLT_YiSEZPWEDRNXYA":{"text":"Been here 4 times and this place never disappoints. The squid ink pasta is my favorite dis","useful":0,"cool":0},"id2u2sIbh90kIjFsYIJz9Q":{"text":"This place is so delicious that we came here twice during our long weekend trip to NOLA.\nM","useful":0,"cool":0},"wkyw0i49-kxak4d4uSrEtw":{"text":"Had the octopus carpaccio and burrata appetizers both of which were fantastic. Service was","useful":0,"cool":0},"nMIJh1Ty9o0VtLjWHxezeg":{"text":"My wife heard so much about Domenica,so we gave it a try for lunch on Friday 2/7. We were ","useful":0,"cool":0},"G-8OkLHQdn0ZYi--dydSbg":{"text":"Food was amazing! Can't go wrong with the pizza, tastes great and can't beat the price. La","useful":0,"cool":0},"YR_S-vzXBXHLkUoDbidjPg":{"text":"good food, reasonable prices, excellent location and ambience.  four stars!\n\ni came here f","useful":0,"cool":0},"oAvXh6vbCYvS_W8-f5lI9A":{"text":"Only giving one star because I'm forced to.\n\nPositives: Survives the meal?\n\nNegatives: It ","useful":2,"cool":0},"fV1gIRIaFPpqAlfAFF8nww":{"text":"When I Yelped for \"pizza\" in the Big Easy, this place comes up with 1225 reviews - almost ","useful":0,"cool":1},"HQgwtmdjsujw2PEPZ_tGyg":{"text":"We had a great time at Domenica.  We didn't have a reservation so we called to see what th","useful":0,"cool":0},"6oZyYBNafmT5ex4UYHbsLQ":{"text":"I managed to get a last minute booking on New Years Day after hearing about all the hype. ","useful":0,"cool":0},"HEXmZOUWQ_1QmoT70pmwZQ":{"text":"So we got a call from Domenica offering an apology and asking us to return for a do-over, ","useful":5,"cool":4},"95WXQBOnzRTuYU-NV8T4-Q":{"text":"Don't get me wrong, it was delicious but just not a favorite in NOLA. There are some aweso","useful":1,"cool":0},"jeFI2gbu_UF57ldL_Bcelw":{"text":"I don't see the need to gild John Besh's already renowned lily by writing a gushing review","useful":3,"cool":0},"6UcSrCO1jt1TLDEA0QWbGQ":{"text":"Without question, the best spaghetti carbonara I've ever had. Go for the larger portion. Y","useful":0,"cool":0},"ratrHkIdEyQTHD-t7oBp-w":{"text":"Perfect in every way! Decor, ambience, and music were warm and inviting. The staff was als","useful":0,"cool":0},"fTGVLrrmCmBsoVysPvfPBA":{"text":"I'm a fan of this restaurant because of its proximity to the Sazerac bar. I love the atmos","useful":0,"cool":0},"SuL_Fq1ln1oNCMT92bjnNg":{"text":"Came in on Friday the 11th for dinner with my wife at about 10pm. She had the squid ink an","useful":0,"cool":0},"yzGFXK6tAlKswKrvO0ZzvA":{"text":"This was one of the better Italian places I have eaten. I had the Tagaletelli pasta and my","useful":0,"cool":0},"uQ4lmm0NnFzVBh9eu00z6A":{"text":"2 words...spec pizza! Fabulous atmosphere, great service, inventive menu with Italian touc","useful":0,"cool":0},"BBeYbiDLJw80VmJ0rL6OvQ":{"text":"One of the best happy hours in NOLA! Love coming here with my friends from school. Been ma","useful":1,"cool":0},"k-yB6CXAdEUVvD1dl4MVzQ":{"text":"Awesome place if you're looking to get away from fried Cajun/creole. Apparently their pizz","useful":0,"cool":0},"1X61yHc92JDkaJOwcYDjsg":{"text":"Cauliflower was awesome! Pizzas are decent too. Service was TERRIBLE! Andrea could not hav","useful":0,"cool":0},"p-6rcJsE5_7QDWvnE9GggQ":{"text":"My wife and I were in the area, looking for something to eat while we waited to see a seco","useful":0,"cool":0},"8vKCbsTehaq0XTR_gXoqww":{"text":"My husband and I celebrated our 5th wedding anniversary here.  The food, wait staff, atmos","useful":0,"cool":0},"b2wZKY_6xmRZc0MNn0habg":{"text":"Literally had one of the best meals of my life at this restaurant. Granted me and my girlf","useful":0,"cool":0},"qIel-knUAvhfX2385e1tpQ":{"text":"Ate here just before the Saints game. Awesome pizza. We had the Cotechino ,Bolzano,  and T","useful":0,"cool":0},"XUq6CJfDJiQqmQfZfVJn0Q":{"text":"It's located in the Roosevelt hotel. Gets pretty crowded. But worth the wait!","useful":1,"cool":0},"wBYFNIjJ1S7KjSPVc4dGVw":{"text":"So this review is for happy hour specifically. And BTW, it's every day! Not just Monday th","useful":0,"cool":0},"G-jFLUf62XliV6UQJmnfOg":{"text":"We walked in on a busy Friday night (party of 2) and were seated without issue or comment.","useful":3,"cool":0},"1qICzmVn-3YwouEvyZ6mnA":{"text":"GREAT atmosphere. Love the wood grain decor. Made me feel like I was back in NYC. Plenty o","useful":0,"cool":0},"OuOTjuBX4iqBcCMyDeZ9EQ":{"text":"How on earth does this place not have a 5 star rating? The food is absolutely delicious an","useful":0,"cool":0},"RZPdPAd8rRCy8edZbzvLiw":{"text":"We ate at Domenica last week on our first visit to New Orleans sharing several dishes incl","useful":0,"cool":0},"zZvvDV5l8O3CGr3iQNKT3A":{"text":"Bolzano Pork shoulder pizza made me see God. Ribollita was also great.\n\nDecor is really co","useful":0,"cool":0},"Wa3KksF0ZhlyMMJYyWwyrw":{"text":"I promised my girlfriend we could go somewhere nice for New Year's Eve and she was thinkin","useful":0,"cool":2},"m3FQEbM8RUXQv1mnCgE4CA":{"text":"Hands down, the best lasagne I've had in my 47 years of life.  \n\nMy wife and I travel quit","useful":0,"cool":0},"wEsVypEkYARYRw9l8MfpRg":{"text":"The food is good. Cauliflower with feta is to die for. It's a bit noisy. And the wait betw","useful":0,"cool":0},"bdeFwAYOu-OqrD6bqJoFWg":{"text":"Great spot. Located in the Roosevelt hotel. \nHad a terrific pizza and cold beer at the bar","useful":0,"cool":0},"Kx2kttQO0L8Me2rDoMVSaw":{"text":"Everyone's meal looked great, but with celiac disease I had to order the GF pasta. It was ","useful":0,"cool":0},"IT_hsPoQvggaTY1ZWPR9Xw":{"text":"The restaurant was AWESOME..food was delicious & inexpensive for Lunch..I chose the Restau","useful":0,"cool":0},"bgE0MuEcEHuoS-8WwuOgwQ":{"text":"We found this restaurant by chance. It's a really good Italian style place to have lunch o","useful":0,"cool":0},"q2OHBle4hKzul3wYVrj7Xg":{"text":"Wow was this an experience. My cousin had a cocktail hour here for his wedding the next da","useful":3,"cool":0},"bFm5ziSOvCgHMFKc_ZWknQ":{"text":"If you can do a half star or a zero star I would have rated that. Extremely disappointed t","useful":0,"cool":0},"oGwusNxiGz-t36Zj6fR9Sg":{"text":"Authentic Italian, good wine selection, pizza for the children.  Service was prompt and fr","useful":0,"cool":0},"J4YadW8HnCpZ4IYoj0e-2Q":{"text":"Best Pizza that I have ever eaten!! Hands Down!!\n\nWe started with the GOAT CHEESE AL FORNO","useful":0,"cool":0},"S-neqQKs84QxmV37V343PA":{"text":"Glad I finally was able to try a John Besh institution! This was definitely a great first ","useful":1,"cool":0},"bAZNF1uvu9d1CCV3ue9t2g":{"text":"Very good, contemporary Italian with a couple problems. Ordered a couple pizza and pasta d","useful":1,"cool":0},"q_9yBcEO1-H1x15vu-pkFg":{"text":"As a native New Yorker but New Orleans transplant, I can say that this is some of the best","useful":0,"cool":0},"nkPL8tszJd_FgTJ2fnOwIg":{"text":"This is an excellent restaurant. John Besh nails it!\n\nThey are open until 11 with full bar","useful":0,"cool":0},"AIfGUw8Ig4e3Db_pLyDpWQ":{"text":"First time eating at a Domenica and it did not disappoint! They have a nice drink selectio","useful":0,"cool":0},"jV9u0QQ39Jbi0IXjIqncnA":{"text":"I was staying at the Roosevelt hotel so it was conveniently located for dinner on a rainy ","useful":0,"cool":0},"X5aDtg6B3bmYVNJIeJDYsg":{"text":"Stopped in midday Saturday to try a pizza and found fried squash blossoms on the menu! We ","useful":0,"cool":0},"geL8CgEyYAohutUPf0ECJQ":{"text":"This is one of my go to spots in New Orleans. The spicy olive oil and french bread are alw","useful":0,"cool":0},"zw3ytnUujs6IL0AdUu8S9Q":{"text":"Okay I'm spoiled as I'm blessed to live in a wonderful city with great expansive restauran","useful":1,"cool":1},"qZMeq6xAsEwTAlLkOwS76A":{"text":"Heaven in yo' mouf! \n\nHubby and I kicked off our wedding anniversary trip by being fatties","useful":2,"cool":2},"U7ceSwWl0SGQdiBJlYbtCg":{"text":"The best Italian food I had in New Orleans hands down. \nThe hostesses was snobby at the en","useful":0,"cool":0},"Jo9zCE8yMJMVUnHVCf6A3A":{"text":"I have never been a big fan of lettuce. Although according to my boss, if I get picky abou","useful":1,"cool":0},"Qg57B9wRo-CTql5k3DtsQA":{"text":"Great meal and great service at Domenica restaurant. We had Tutti Carne Pizza and endive s","useful":0,"cool":0},"csZDaf_FO2OleahD0FnHgw":{"text":"I enjoyed my meal here. It's a cool looking place, a little loud, but well appointed. The ","useful":0,"cool":0},"ZrsNY59Re0hkb8_I9CaCjg":{"text":"Wow, now this is a place that cares about their customers. \n\nWe had 6:15 reservations, as ","useful":0,"cool":0},"x1TED43W3g3zTUq1-5n-Bg":{"text":"We had octopus carpaccio and pizza. Carpaccio was slightly thick cut and was drowned in ol","useful":0,"cool":0},"pIM4Opz-KouMkuQ-EmA4vw":{"text":"Domenica has seen better days.  Went to celebrate a co-workers anniversary.  As requested ","useful":0,"cool":0},"XOpL699_ySQ9ziz7eD3DUg":{"text":"Simply delicious, everything was so flavorful, and the service was excellent. We ate there","useful":0,"cool":0},"DcRyn8ukvnzJIJQ_0eSH_w":{"text":"I've been to Domenica before and have had good experiences, so I was quite disappointed wh","useful":3,"cool":1},"KlqrZ6jNTyRGN0_I7eR6Gg":{"text":"NOT large party friendly. Had I had a better experience with the young man that waited on ","useful":1,"cool":1},"CSCFO39S0nab4G2TAnJELg":{"text":"Their happy hour (3-6 pm) is uh-maz-ing and includes half price pizza, beer & wine, and se","useful":0,"cool":0},"wO_rFe3KaSF7Ck8pnwzvYg":{"text":"Just drop what you're doing and go eat one of their pizzas - order some fried Kale (holy c","useful":0,"cool":0},"4dcMWxDrKMhl_HxQQCYBMg":{"text":"Before traveling to New Orleans for the first time, the name that kept popping up was John","useful":0,"cool":0},"bHzF4CPiTwgJJkdOlSU0zg":{"text":"Great happy hour! Half price pizzas that are delicious and big enough to split with someon","useful":1,"cool":1},"y-LGQl2TXSmBwjqT92El9A":{"text":"Especially during Christmas, make sure you hit Domenica. Great charcuterie program, awesom","useful":0,"cool":0},"trWCEYFCJkeRYekD-c2B2Q":{"text":"Located adjacent to the Roosevelt Hotel. \nThe martinis are excellent \nThe pizza with fig a","useful":0,"cool":0},"O234ajTV26TAfETGbuODbQ":{"text":"I'll have to come back for happy hour at half the price and twice the liquor the pizza mig","useful":0,"cool":0},"lkVZQNzvLp3IgZ0wT-T7nw":{"text":"Smeck pizza (mascarpone, prosciutto, dates) was to die for. Arancini app also great. Trend","useful":1,"cool":0},"JXZyV3f_V_6OadH5cyAvFA":{"text":"Love a place that tastes so good and the flavor exceeds the price!  Awesome food and in pa","useful":0,"cool":0},"tFJ0KZyH5V7Og12ERxKFvQ":{"text":"It is a 3 or 4 star depending how you slice it. We arrived at a shift change so service mi","useful":0,"cool":0},"phRbv--PeM9IguDHl4hR0A":{"text":"OMG!! Their prosciutto pizza is so dang good!   It was perfect in every way.  I doubt thin","useful":0,"cool":1},"qqFgTS7K2fLqNfAM1nba9Q":{"text":"Went for a late lunch & discovered it was happy hour!!  Exquisite flavor combinations on p","useful":0,"cool":0},"fmNLe32sQWJed2v4j4Wo-g":{"text":"A great Italian restaurant!   \nWe ordered a modified charcuterie board with just the chees","useful":0,"cool":0},"7Z19mhEhXvQwfCDlJ9QrZw":{"text":"This restaurant would have 4 stars if our waiter wasn't so blah. He had no personality and","useful":0,"cool":0},"mvaU4kmIw8X8jN3D-x6mQA":{"text":"Food very good but staff very impatient but slow. They were quite busy but I felt as if my","useful":0,"cool":0},"9tM6Xgh9VbjK_bw5JDBTRw":{"text":"Tonight, I did something I never do; I agreed to pick a restaurant without first doing ext","useful":0,"cool":0},"h6ezwFGDyaS82aok4EUBZQ":{"text":"I went here during a family trip for a quiet dinner. By this time, I was in dire need of a","useful":1,"cool":0},"DUXXKCoRD61JoYgDHws-eQ":{"text":"I ate at Domenica recently.  It was good, but not exceptional.  This restaurant has a beau","useful":0,"cool":0},"MBIsZNGzY7t3PqXpbPjz_Q":{"text":"Went for happy hour and had the half price pizza. Delicious! Great service as well. Can't ","useful":0,"cool":0},"Iu3HtwZx8n_yTnFrpAYZ8g":{"text":"This place is amazing! I can't speak for anything except the pizzas and salads, but if the","useful":0,"cool":0},"TqUVH7Ox_3qEkCxCCS_l3Q":{"text":"This is a great restaurant to go to if you are tired of Southern cooking (or if you don't ","useful":2,"cool":1},"Qgsgb4zXYBhBHTvkOSaeuQ":{"text":"Domenica was great! The only thing was that they could not serve any pizzas when we went, ","useful":0,"cool":0},"fWUNaYLc0qT0G96soHyUkw":{"text":"We were seated right away which was nice. We just wanted something small before our dinner","useful":0,"cool":0},"vnksuTlx1i3TEDIbaPU91A":{"text":"I love New Orleans. The food, the music and the whole mysterious vibe of the town. That be","useful":0,"cool":0},"5LIfvP7LD56Al1qx8gMWuA":{"text":"Delicious is in the details and everything brought to the table is special right down to t","useful":0,"cool":0},"iJshqtYX_yzwdDwneqqkUQ":{"text":"This review has nothing to do with the food! I am one of John Besh's biggest fans, and all","useful":0,"cool":0},"WrTDnbFoqgK2T0ix7VMC7w":{"text":"I want to rate 3.5/5 would be better. The actual food is really good. I had the buratta an","useful":0,"cool":0},"FN9LUiOuEZNRW7jW_GyiZA":{"text":"Loved the ambiance, the repurposed glasses from wine bottles, and the food was excellent!","useful":0,"cool":0},"dQ6yQwYl_Z-J00wOiB37hw":{"text":"The food and drinks were delicious, just as expected. The only bad thing was that we had t","useful":0,"cool":0},"lF9wXvPneoFPGXGYtMFB5g":{"text":"My team loves to come here whenever we are in NOLA for a tournament, which is every year! ","useful":0,"cool":0},"Nfp13KRhL-GuKKy9FDhBIQ":{"text":"Slowly but surely I'm trying to make my way to every John Besh restaurant in New Orleans. ","useful":3,"cool":3},"Dn2mPvCmJ9CfhTjb9wukyw":{"text":"AMAZING HAPPY HOUR! My review is based on that.\n\nI got a full size pizza and a drink and p","useful":1,"cool":0},"lWq-PtchO4tl8ugo3QuYmw":{"text":"We had a delicious meal here while in town for a conference and to sight see - it was very","useful":0,"cool":0},"yP5cEKXc24FcpF2cYbjsJw":{"text":"Service was downright awful. Had to beg for the check and even then was forgotten again, w","useful":0,"cool":0},"Dj9x5_ivW3b4NzeP3etTzA":{"text":"I am never disappointed at Domenica.  I try to enjoy the happy hour menu with great pizzas","useful":0,"cool":0},"dCagKIXwIQXOJ2zRrSualA":{"text":"my cousins who are lifetime nola locals and experts recommended this place and i know why.","useful":1,"cool":1},"CCv4twq5TbU9AhqmNpXlgw":{"text":"Love their pizza, you can tell that they use wood burn. Octopus dish is delicious. I could","useful":5,"cool":4},"pdzKzsKHL5H-Uy49ge34_Q":{"text":"The food was very good but a bit salty . But We enjoyed the food very much and the service","useful":0,"cool":0},"ZR0rhkTbPBAjPLVXrZ9T3w":{"text":"Excellent service, nice friendly waitresses and waiters. Food was everything as expected a","useful":0,"cool":0},"DOTfMZxcbepO89fnKd4bwA":{"text":"The food is good BUT... it's overpriced, service is slow (kitchen specifically) and the po","useful":0,"cool":0},"8-sdjWn3sOtPwn9usO6hPA":{"text":"What a deal!  Go for happy hour and half price pizzas and wine. Even the Brunella was incl","useful":1,"cool":1},"dgaWILApapq7Wfjwu9ucHA":{"text":"Can't believe this is associated with the Waldorf Astoria hotel.  Hostess greeted us witho","useful":0,"cool":0},"o-YLdm2jE_O87Y5-PaIgUQ":{"text":"What a great fine.  New Orleans is overwhelmed with good food and this is definitely one o","useful":0,"cool":0},"ozSa1XLkItaiSz05vfi1Kg":{"text":"I just moved here from NYC and this is the first pizza place I've been to that comes close","useful":0,"cool":0},"e_fVQxRxolEwIVSHW1bdLg":{"text":"More of a sparkle. I had lasagna and a glass of single malt Scotch... Food was fair and he","useful":0,"cool":0},"MHPCCA9rEnmzZtbcpf19ZA":{"text":"Used to be a regular here but my visit the other night was disappointing and I don't know ","useful":0,"cool":0},"L1WRoSdFDP3AsxTQ37iuEg":{"text":"This use to be one of my favorite restaurants to visit in New Orleans. But I'm sad to say ","useful":1,"cool":0},"u8BpYVwEvs9uEZS7RLKXOg":{"text":"The spicy olive oil and bread was a nice free start.  So many choices.  I decided to go st","useful":1,"cool":1},"BY6eQcVEo30_uOf7al8azQ":{"text":"Visiting NOLA for a Tulane graduation this past weekend and Domenica was a block away from","useful":1,"cool":0},"_dLPqTG4Z038dditk4NIkg":{"text":"Had a great time here during mardi gras weekend with my date! The hostess , server were re","useful":0,"cool":0},"g_21VT4f9ibvwAeqrbJk4g":{"text":"This is a great little place to have under your belt to take guests. The atmosphere is sex","useful":0,"cool":0},"FwCOWeOoGujvorYJd9wfwA":{"text":"The experience at this restaurant was top rate. The staff amazingly attentive, food out of","useful":0,"cool":0},"NyVcSN5FgDuJPDIVyRYh5Q":{"text":"Domenica the latest expansion of John Besh's growing culinary empire, which now includes A","useful":1,"cool":1},"CnI_vXPql444hSXtNhrIZg":{"text":"Nice place with quality food and kid friendly. We all had different pastas...chicken fettu","useful":0,"cool":0},"qWJFVQYTxbCky04853ac3g":{"text":"This is a great Italian restaurant, located very centrally within the French quarter. \nI r","useful":1,"cool":0},"kE-DFgpiaRLrMD54MPVMZg":{"text":"I first became aware of Domenica whilst visiting a friend who was in town and staying at t","useful":12,"cool":7},"Yy5f1-SJokeRVUa8KfiRhQ":{"text":"Went in for happy hour (listed here as being until 7) and was met by a snotty hostess who ","useful":1,"cool":1},"64km324ytkyNzdvcqgCoGA":{"text":"Perfect for large parties (had the best table in the middle of the restaurant).\nEverything","useful":1,"cool":0},"g-sF5OJ7Cx_jDrnppo_-uA":{"text":"Great atmosphere for friends or a date.  We went on a weeknight and the place was packed s","useful":3,"cool":0},"Fv1vzZYddAUHAMji6yqgQQ":{"text":"Excellent service, excellent food, wonderful atmosphere. The octopus carpaccio is beyond a","useful":0,"cool":0},"j3bq_yw4Zwkjs4KtUPrBzw":{"text":"After you sit and then in the process of ordering your drinks, they slip in this question,","useful":2,"cool":0},"29YOEVI_QENGqz0qopdQmA":{"text":"Great happy hour starting at 2 l.  Half off pizza, beer, wine and well drinks.  Service fa","useful":0,"cool":0},"1oTW5drkx4l22GGIJoapzg":{"text":"This was our very fist stop after checking in, and I was happy to see that even the hotel ","useful":0,"cool":0},"j5gmtJTn-rMOpNv1CZXE2A":{"text":"The cheese board was heavenly!!! I highly recommend the chicken liver pate!! Service was p","useful":0,"cool":0},"RKfpcTnkPkt7OTxq43RDtA":{"text":"Went for lunch, had the coolinary menu. Ceasar salad, a pasta dish and  the margarita pizz","useful":3,"cool":1},"dOlOqbxASfNhffmN8g22Yg":{"text":"Octopus carpaccio was out of this world delicious, very tasteful and uniquely prepared. A ","useful":0,"cool":0},"7rkpxLxe2_TDFWMDLY4rUQ":{"text":"Alone in new orleans, decide to come and try the thanksgiving three course it was a very t","useful":0,"cool":0},"WQNggDKlS6Zdm9F_yPA_gQ":{"text":"The service was sub par, slow, inattentive waitress. My dish was great while others in my ","useful":0,"cool":0},"ljlkPF31ZwGu6Mfi0IAA4g":{"text":"Otutstanding food and service.  We had the crispy veal tongue, dirty risotto and carbonara","useful":0,"cool":0},"fDvqFJGsMoqvN46mTfQY1A":{"text":"Awesome place and food! You have to get the roasted cauliflower appetizer to start out. It","useful":0,"cool":0},"y1qGEHYMJiYNrh2bsw89sg":{"text":"The meat and cheese plate was everything I dreamed it would be and more.  We came here as ","useful":0,"cool":0},"k-VN-WBC3P2DOm9ulUVcWg":{"text":"Great food! Knowledgeable, friendly staff.  Can't wait til my next visit!","useful":0,"cool":0},"SN-eLhiYjvG_w7DsIfZ4jA":{"text":"Excellent service. Delicious Passover menu.\nThe chef came to talk to customer, which I con","useful":0,"cool":0},"HY-bLAe1OXIe9dO4nX8NBw":{"text":"We always enjoy Domenica. We decided to have a late lunch yesterday to take advantage of t","useful":1,"cool":0},"JaMuKjR7zKnPam2qD3w-VQ":{"text":"So we revisited Domenica again this year.  I must say this restaurant has all the ingredie","useful":0,"cool":0},"kGZQwEmQKBEes-zcabGL7Q":{"text":"Happened upon this gem of a  restrauant just by chance.  It was wwf weekend and the wrestl","useful":0,"cool":0},"bYWedjweOOs5yLRneHBQWQ":{"text":"Great for happy hour. But, if you're starving and wanting a fulfilling meal, I would sugge","useful":0,"cool":0},"ikLbH9Y_3WJOiyhmhEYLqg":{"text":"What happens when you crossbreed Little Caesar's prices with newfangled gastro-fashion bet","useful":4,"cool":2},"eciPwoN4lSNFbQkQQBFTyg":{"text":"I have to say this is probably one of the most satisfying meals I've ever had.\n\nAmazing! T","useful":0,"cool":0},"q1vKC5TW6xI-RiQL4MZ9NA":{"text":"The food here was okay. We didn't order pizza and maybe that was our mistake. I ordered ch","useful":1,"cool":0},"eDYt-qdJG1jneIXq55PTRA":{"text":"I tried unsuccessfully to go twice during happy hour, but that just didn't pan out. Howeve","useful":0,"cool":0},"dY6FB1GrJCUHe3tGIxN-0A":{"text":"Dined with a group of 10. Took a minute for service to arrive at the table. We ordered a b","useful":1,"cool":0},"fHrSyGYsx2-Io5xd5wKVpA":{"text":"The food was good, perfect for when youre in nola and just not craving the cajun creole st","useful":0,"cool":0},"JxWlu68zOQSacVCuxaEjqQ":{"text":"Excellent Lasagna! Wow! Almost as good as my mothers!! Pizza very good. Sauce just a bit s","useful":0,"cool":1},"OA38T3XXipXwh9ljScfjVQ":{"text":"My last trip to NOLA, I had an opportunity to get super classy with one of my meals. Acade","useful":3,"cool":3},"P5IB8SJNPFED-aTraVLTqQ":{"text":"This restaurant is great, and I'm not even a huge fan of Italian food.\n\nMy team came here ","useful":2,"cool":0},"Nkpf7XowqUapp70-1f67aQ":{"text":"Blue Crab and Squid Ink Pasta is fantastic, everything looks great, highly recommend!","useful":0,"cool":0},"ZVJa6hg6ekCIQYsr5HvMVw":{"text":"Ah. Maze. Ing. \nSeriously. \nThe food was incredible. We had the pork app- divine, the sauc","useful":0,"cool":0},"btfye2STOsE1MhB5s76pkA":{"text":"We went a couple of months ago about 5PM for the 1/2 price pizza special.  Despite the pri","useful":0,"cool":0},"l0awGYAwUSfBYsbCoi7DWA":{"text":"Came here for brunch on a Sunday and my girlfriends loved it. The squid ink tagliolini wit","useful":0,"cool":0},"FCdvcbSePAaaBVh18SsfTw":{"text":"Domenica was the overall winner on my last visit to NOLA (dinner). Commander's still wins ","useful":0,"cool":0},"XSgVAHW1pmTfWcFAXP-iBg":{"text":"This place is great! It was my first experience at a John Besh restaurant and I now believ","useful":0,"cool":0},"oacBx1manJRcO0Qm3UkvkA":{"text":"We went recently for the first time in 2 years, & although it was \"good\", it wasn't great ","useful":0,"cool":0},"NflkGZ21kkPiA5_T6m2jZw":{"text":"So we got the roasted cauliflower dish with whipped goat cheese that is all the rage right","useful":0,"cool":1},"_xn5cPobhL4mdr97SCZIcg":{"text":"I enjoyed the food, especially the spinach gnocchi appetizer, the roast chicken and the ch","useful":0,"cool":0},"_V62roQCtjXyPreXRqsxzg":{"text":"Delicious albeit all the dishes are on the saltier side, earning them four stars. Would ab","useful":1,"cool":0},"W2ER0NfDiTE77iflqjY03Q":{"text":"Can't really comment on the food.  Been here for an hour and still no food.  I expect more","useful":0,"cool":0},"RXEduV-ZjqVxoXf9Mq6ZQA":{"text":"Went there on Friday night and was able to get a table without reservations.  Lasagna and ","useful":0,"cool":0},"KsyMtcyF_Cyw6nzPIK3NIA":{"text":"I've been here a few times for happy hour and it is in a great location in the Roosevelt H","useful":4,"cool":1},"Wx_cQwKjPlqfmjyifokHtw":{"text":"We decided to have our Thanksgiving meal here. We went for an early reservation and the pl","useful":1,"cool":0},"pWQCcIkQ4gh8Fyjx_LnbtQ":{"text":"An amazing dinner/evening at Domenica.\n\nFirst thing is to request for Gerard as your serve","useful":0,"cool":1},"TdQVJrOBGpnFi8ZMOKRMNQ":{"text":"While on a trip to New Orleans last week, we visited this restaurant twice. Both times wer","useful":0,"cool":0},"nM2QT2xgPBQ82Rxllw6jKQ":{"text":"We stopped in for a quick lunch and we were glad we did. I ordered classic fare starting w","useful":0,"cool":0},"lFWZBHydRQej1OBCwmyzoA":{"text":"After reading the reviews and hearing about the fabulous happy hour...we had to come check","useful":1,"cool":0},"PD81rcYmHopt7iIzIT5m5g":{"text":"Who goes to New Orleans to eat Italian food?  Me. \n\nDomenica is fabulous.  We had the char","useful":1,"cool":0},"DGK94or1h6sUlOuNzZXHeA":{"text":"I am sorry to say but this restaurant was a disappointment. Mostly because of the service.","useful":0,"cool":0},"qgApH-35m2eitrNXPga55w":{"text":"We were staying at The Roosevelt and I wasn't feeling great with a headache so we decided ","useful":4,"cool":3},"bvlXRZ4Tiwok4MGdeysIEQ":{"text":"Definitely try the cauliflower with whipped goat cheese! From 2-5pm pizzas are 1/2 off! Ni","useful":0,"cool":0},"M-IG3vd2yB9uNf2gydDgNA":{"text":"Great service & ambiance. The pizzas are good, but not exceptional, like Una Pizza Napolet","useful":0,"cool":0},"sfTq434MVPpoeEZvZfJTqQ":{"text":"I need to include a caveat, that I've only tried a few things on the menu since we were ju","useful":0,"cool":1},"k0KJ5hDke2_LMv5wb8YIFg":{"text":"As soon as we walked in we were greeted an seated, then were given a plate of bread, and s","useful":0,"cool":0},"32Q8jdF2joLY7jJFULgRBg":{"text":"We were so into our meal that I didn't take any pictures. While the items may seem on the ","useful":2,"cool":1},"FeOjcndhHk3yKDE10wLEow":{"text":"-Loved the ambience/feel of the dining room\n-Hated the service.. Took an unreasonably long","useful":1,"cool":0},"0kKqlLTt2kn3FngUVcw9RA":{"text":"Cerveza local buenísima! La pizza crujiente y deliciosa. De aperitivo probamos las albóndi","useful":0,"cool":0},"HLP_MNBy9lF0cWSR_P7P-A":{"text":"I'm a HUGE fan of Alon Shaya and John Besh.  I visit Domenica frequently and always enjoy ","useful":2,"cool":1},"9GA2dSMEGvAlJQ5MhoVqdw":{"text":"Very good but not great. Server said the pizza was enough for one, would have been more th","useful":0,"cool":0},"YmgGya74suN5KRGsnue1rw":{"text":"This restaurant is everything I love. Prices are reasonable, ambience is extraordinary and","useful":1,"cool":0},"sLOQ6-uMqhKoXMedE1eEyw":{"text":"We went here for happy hour for some pizza.  It was delicious!  Another bonus is that it i","useful":1,"cool":1},"ewlSfGhyqHu0EXGWhwZqgA":{"text":"Great atmosphere, chic with awesome food. It is authentic Italian. We had pizza with half ","useful":0,"cool":0},"dyu_AF5tLBmtbjMqi0yXUg":{"text":"I was slightly skeptical because of the \"celebrity\" chef connection, but we wanted to try ","useful":1,"cool":0},"bltmnIDCmCcDQP3ULT7e0Q":{"text":"Overpriced, fake high dining. Looks the part and has appropriate menu items, but both of o","useful":1,"cool":0},"b2iwDTacv8w81FvSAjymfg":{"text":"We stopped in at the bar for lunch and split a pizza margherita.  (We discovered it was ha","useful":2,"cool":1},"vY794hGtiOlnFOp0PjDjfQ":{"text":"Came here after work with 2 friends/coworkers. It's a great feel after a long day of work,","useful":0,"cool":0},"AmNNxT4cDr7Q9F3bZP_3bQ":{"text":"Great service but unfortunately the food is just not good! \nWe went there on our first nig","useful":0,"cool":0},"J7DThWD-q8ikTz8UZcJa_g":{"text":"This restaurant is absolutely phenomenal, from the service all the way to the food. A word","useful":1,"cool":1},"qBz7xdeZYGUPtNVXLvO2oA":{"text":"We loved this place!  We were a group of 8 and came straight from the airport so this was ","useful":0,"cool":1},"-ingXo6xeouotuZds4n3Tg":{"text":"Late night Tuesday in New Orleans after an event we attended. Craved pizza but didn't feel","useful":0,"cool":0},"FABZWP80N9nPZKYuEIGt-g":{"text":"Our server, Brandon, took very good care of us. We had white pizza and espresso chocolate ","useful":0,"cool":0},"R4zNR2BjF-jFJ-vC2CembA":{"text":"Found this place by accident and a little help from yelp. The pizza was such a good bold f","useful":0,"cool":0},"2bPg7coRuFeldyHOVJ-oUw":{"text":"Took my daughter for Mothers Day dinner. The food was delicious!  Found the service a bit ","useful":0,"cool":0},"SdfLWi_jIB0PV2I00x9duQ":{"text":"Spent 2 nights in New Orleans, went all over the city for food and drinks...this place was","useful":1,"cool":0},"S3D-ynobDK1DJ8SxbdbnKg":{"text":"Upon walking in, we were greeted very nicely with the hostess who pleasantly welcomed us. ","useful":0,"cool":0},"eXv9STR0uypaGB94OPmKeQ":{"text":"Well, I found my favorite restaurant in New Orleans. The reviews below were so amazing we ","useful":2,"cool":2},"vK_yGduRYNqkrTpqM7YfMw":{"text":"Food was fantastic and our server Jobie was great.  He made our experience a memorable one","useful":0,"cool":0},"t2VRiq4F3mENMu3oXEgw-w":{"text":"Varied menu from sandwiches to pizza. Solid cooking. The Brussels sprout salad was delicio","useful":0,"cool":0},"9mQ-oucJEscP3wI05122uQ":{"text":"What a great find! I was looking for a good pizza in New Orleans for the longest time, and","useful":3,"cool":2},"_MTjbQveTou-CyGex_nQ0Q":{"text":"My actual rating would be 3 1/2 stars......Came for a late lunch on Christmas Day....had n","useful":0,"cool":0},"rZyvbjkuN0j8JoUiOuzfCA":{"text":"The atmosphere is casual modern and very inviting. Our waitress was extremely attentive. W","useful":0,"cool":0},"yfF_brh_A43pLYy2F1ykfQ":{"text":"A superb restaurant. Very unusual to offer both really interesting and exotic ethnic food ","useful":2,"cool":0},"ysEF55NNhPn-cXHfUImEDQ":{"text":"I sow the restaurant on a T.V. show so decided to go and give it a try, it is worth evrey ","useful":0,"cool":0},"WGXk3_VxgNfsDiX8FzZFNA":{"text":"This is a solid 4 star place. Another great John Besh restaurant. We tried the Squid Ink T","useful":0,"cool":0},"ACXIS6t_MLUeK-QLsD6_WA":{"text":"Wow. Nothing went wrong here. Fried kale, octopus carpaccio, LAMB MEATBALLS, rabbit pasta,","useful":2,"cool":1},"wZ_7FQ6QNgL_udmIzw1MOg":{"text":"Super delish Italian in the CBD Nola. Lasagna and cauliflower appetizer is what has us com","useful":1,"cool":0},"IogSsw9oPi-2OfuFIfd1rQ":{"text":"Very good. Came in late was still served well. I had the wood fired eggplant. Was very goo","useful":0,"cool":0},"Lg8eL1OXROdfpBplCT_DGg":{"text":"Wanted to try happy hour. Check this out.  $7 for 1/2 a deviled egg. I pray this place shu","useful":0,"cool":0},"yyLsT73-mv4PZqcangwUBQ":{"text":"Happy Hour is AWESOME with half-priced pizzas and beers! Very tasty flatbreads though the ","useful":0,"cool":0},"1UBAtueEUEc1yO0ca0o99A":{"text":"After a bumpy flight on Christmas day, The Man and I were cranky, hungry, and thirsty.  We","useful":9,"cool":7},"Snb13ykvZ2tTDxlPWzERhQ":{"text":"The atmosphere is wonderful. The wait staff kind and prompt. That's it. That's the 2 stars","useful":0,"cool":0},"xjQSy1kntv_rTcm7Ga9Tmg":{"text":"I was sceptical about going to New Orleans and having pizza. That being said, the Clam Piz","useful":1,"cool":0},"S8tZBQ7M3lzzwHaXS0H0qw":{"text":"I have been here a few times, and it has been pretty good as an over all experience. Howev","useful":0,"cool":0},"wdw3kgax5Hp1XFjWsSIz1A":{"text":"Had dinner in here for our last night in Nola. The pizza was amazing. Definatly recommend ","useful":0,"cool":0},"5tnJ0-g_hIioBHu4Odxd4w":{"text":"You must do happy hour here! Great pizza options--we had a hard time. Def gourmet selectio","useful":0,"cool":0},"EHeE_aJf1jSEsnkhYSPLaA":{"text":"Great meal for a last night of a three day weekend in New Orleans. The stuffed squash blos","useful":1,"cool":0},"iZNjTLsYaxL9Uqbxn3hMGA":{"text":"This is a very happening gastropub. They had amazing procuitto flatbread and louisiana shr","useful":0,"cool":0},"x4ig6w0k6dh4zPFjidJCBQ":{"text":"I really like this restaurant a lot, but I just can't give it five stars.  While it's quit","useful":4,"cool":2},"LHbPF-A6n7pta5L6HgJLAg":{"text":"This restaurant is both lovely, warm and wonderful. The wines by the glass are well select","useful":0,"cool":0},"2np7uT9oTLCaH0BrEl7xog":{"text":"Afettati Misti, Two glasses of Pinot Noir, and a smoked pork pizza to go. Lavish meets mod","useful":0,"cool":0},"ofCeyU0bBM0XQ4_ZUZZpzQ":{"text":"Came here on a random Sunday around 3pm. Turns out they have a happy hour on their pizzas ","useful":0,"cool":0},"oSEszh3zbrqC270EleslAQ":{"text":"Food was great. Service was great. Don't get the $30 meat and cheese plate, not worth it..","useful":0,"cool":0},"GWW8Jv1Y0s9G9CvmugkjGw":{"text":"While I give the food a 5 star rating, the service was mediocre which is simply a shame be","useful":0,"cool":0},"-Ouplzh08A5e8S4h9StyiA":{"text":"Not only was Domenica, located in the Roosevelt Hotel, a fantastic dining experience in Ne","useful":1,"cool":2},"OSzm4wLID9GH3Dy9r0U0Hg":{"text":"Once you get past he service, the food is actually 6 stars!!!  I hade the Oxtail Ragu with","useful":0,"cool":0},"DdD5Xq-CaOMxUHYh66kBiA":{"text":"Superior pizza in New Orleans. I think it would be my Top restaurant choice for pizza and ","useful":0,"cool":0},"sDjsM43t34k8YaJxh0SBHA":{"text":"Getting there: It doesn't have its own parking lot, so that kinda sucks. \n\nEnvironment: Do","useful":0,"cool":0},"8_vDBFYfEIxFxJ2kfpk2Tg":{"text":"My husband and I decided to go to Happy Hour at Domenica on a Wednesday afternoon. They ha","useful":2,"cool":1},"JYjmPJMtFYlcJd2e2IcgXA":{"text":"Came here the day before the marathon and it was packed!\n\nWe got the beets, lamb meatballs","useful":0,"cool":0},"mbO8ZdvXmoJayuSogCsbmQ":{"text":"Great dinner here, the place was fool and noisy but it was worth it, amazing lasagna(1 for","useful":0,"cool":0},"a2EibybX1uvgUdIYlsePHQ":{"text":"We visited Domenica on a Sunday at 5pm for Happy Hour. (Half price pizza, beer, wine by-th","useful":2,"cool":0},"ZKmNw3-eKzKagfHKLnHOTg":{"text":"Happy hour here is pretty simple: 1/2 pizzas, specialty cocktails, beer, and wine from 3PM","useful":2,"cool":3},"0lBaa1gwaw6VWjwg3OVo5Q":{"text":"Loved the margarette pizza. Salads were pricy for the size.\nSat in the bar. Service was sl","useful":0,"cool":0},"uJP2rRIhL7D9947S6ARsdg":{"text":"Had a great evening at Domenica with friends from San Francisco.  Our favorite course was ","useful":0,"cool":0},"9U2CLtfp96SHqprYxwcErA":{"text":"Pleasantly surprised by Domenica as it is a restaurant attached to a hotel, which I expect","useful":5,"cool":8},"yCznhLGkRT8STjvSL-b3eQ":{"text":"I gotta say...I was a little Ehhh about this place. I was so excited to go and I am a big ","useful":0,"cool":0},"_COCuRqYRhzr0q_mF3NyTw":{"text":"Smoked pork pizza is really good. Great place for happy hour. Half off wine and pizza!","useful":0,"cool":0},"BGAAEcFbbLUmxF6YWr_z8Q":{"text":"Having had great meals at John Besh's other restaurants prior to this, it was disappointin","useful":2,"cool":0},"y3FFGpxoKJHFDVt6BzC_lQ":{"text":"I've been here several times! The pizza is delicious and I always leave with a belly full!","useful":1,"cool":0},"5xzAivFLxfkS7ZSeF8h6NQ":{"text":"Would be hard pressed to imagine a better happy hour anywhere, it's really very generous o","useful":1,"cool":1},"1_KpNsgV-IeBiH0trpsJxg":{"text":"Fantastic food. Ordered the Roasted Cauliflower with Whipped Feta. You had me at Whipped F","useful":0,"cool":0},"98EYmjBtOomUh1dwwjNHHA":{"text":"A great place for tasty, good pizza paired with a nice glass of wine.  I stopped in a rece","useful":0,"cool":0},"gWKsibiw5NBnDZUN-MgyGA":{"text":"Yum!  Since we didn't have reservations, we were seated in the bar area and our table was.","useful":6,"cool":5},"LzZ_Pt_1bPehPENdmvTYvw":{"text":"A nice casual place for a snack before my night out. Greeted by a lovely hostess that dire","useful":2,"cool":0},"JLogmW_hp2qNIFPmTnEWsQ":{"text":"Recommend making a reservation before going in. Otherwise, the wait time for a walk in was","useful":0,"cool":0},"0UEWsqzaG_p7ya_WkQcpJQ":{"text":"Fantastic!! It hit the spot!! The table bread and the lasagna bolognese was the best. Good","useful":1,"cool":0},"V3GeVbyOdcRBFdedpl4o7g":{"text":"Wonderful.  The happy hour is great with choice of many really good wines and fantastic pi","useful":0,"cool":0},"nC-zcP9Y0zaP3QumA43YgQ":{"text":"Ok, so maybe this place could throw the Mimosas in for free on Sundays? It's pricey, and p","useful":1,"cool":0},"YhAlxeoBWNCXnkr3wA7tzQ":{"text":"If you visit New Orleans, you got to have a meal here. Great food, great service, great am","useful":0,"cool":0},"ri0QvA8qlf3EdHohEC3KtA":{"text":"Just stopped by for lunch and was very surprised by the excellent service and food! I had ","useful":0,"cool":0},"1eAi5Ep2Nft76S6EV2tMsA":{"text":"Food was really good. Loved the bread(!!) and the cauliflower and prosciutto pizza were am","useful":0,"cool":0},"F86wXCvNVNQmA9k5UPCoYQ":{"text":"I have heard John Besh's name mentioned all over town since I moved here, even sat next to","useful":1,"cool":1},"xQ7xK760znk0ktRpxvHUUA":{"text":"Haven't tried anything I didn't like.  Staff friendly and atmosphere is nice.","useful":1,"cool":1},"h36HUTgbpBj3vkAJi7JotQ":{"text":"Great space in the Roosevelt Hotel. The pizza was delicious  (unfortunately, we missed the","useful":0,"cool":0},"2rNphoaLQsfj5ek9EU2pBw":{"text":"We happened to be staying at the Roosevelt Hotel and would walk by this establishment and ","useful":0,"cool":0},"yTAneJYOerZmT1ex2KIRMw":{"text":"I waited so long to try this place, heard so many amazing things - I wondered if my expect","useful":0,"cool":0},"BM_LrlF3HhjFTXzBky6y-Q":{"text":"Absolute worst service of my life. We sat in the bar area hoping that we could quickly ord","useful":1,"cool":0},"yic5ZRHb65twqfESXhHdrA":{"text":"Started with the fried Tuscan then had calebrese with the the jump off for the drink. It w","useful":0,"cool":0},"fnKkJPfljvwMr2QQEVDtGw":{"text":"Great Italian, solid food and fantastic service. Reservations are pretty much required if ","useful":0,"cool":0},"gMy5bQuK31Fz3dtZ-PZUag":{"text":"Really good pasta: Squid Ink Tagliolini w blue crab and HERBS. Boy do I love herbs.... And","useful":2,"cool":1},"in8uUsjTz4SUXSU6UXIJ_A":{"text":"Domenica is such a great treat! Kick off your girls' night out here with a roasted caulifl","useful":1,"cool":0},"0YQoA00dKEZv4eCy0r1rRQ":{"text":"Outstanding food and atmosphere.  Service was incredible.  We started with the meat and ch","useful":0,"cool":1},"ygBBkDkNdHgp4vqsQ15MSw":{"text":"Stopped in for dinner on a recommendation from the bellhop at our hotel down the street. D","useful":1,"cool":0},"RLOxPgBLMy3ZXLxzK5PZ1g":{"text":"We got our order to go. We ordered the cauliflower which was so simple yet so delicious. W","useful":0,"cool":0},"G6msfGnuB5DHsUt3c8weRw":{"text":"From Scotland, last stop on our Fly/Dry in New Orleans. Last minute choice and was a great","useful":0,"cool":0},"_xY3uFcCDnQderqd8apsEA":{"text":"Seated quickly on a Friday night with no reservation.  The roasted cauliflower and prosciu","useful":0,"cool":0},"PcJnAYTcdHJx7fuf9_4SKA":{"text":"Both chef Besh and Shaya stopped by my table to check on my satisfaction. No, I am not a c","useful":0,"cool":0},"t-njvJkrqoUHJbXYNa7DMg":{"text":"During my first visit to Domenica, I went for lunch and had a veggie panini type sandwich.","useful":0,"cool":0},"nPrfpeBQCjPiq5UtPEOeJA":{"text":"The new \"Happy Hour\" times are terrible!!!!! thus the low review. Isn't Happy hour suppose","useful":0,"cool":0},"HsxBxGSFMeyJxMijpCy9Ag":{"text":"I'm almost positive the angels in heaven are jealous that I got to eat the cauliflower and","useful":0,"cool":0},"yc8SbTand946L0qvBIJ_CA":{"text":"Best Italian food I've ever had and wonderful atmosphere! My boyfriend and I had a great e","useful":0,"cool":0},"4KPYWi6B_k0-WBmQwSce1Q":{"text":"Service great. We had bucatini with chanterelles. Awesome! Spicy rigatoni excellent. Wante","useful":0,"cool":0},"RrPDdCvZ93aKJRVSDGWS3A":{"text":"This was the best restaurant I ate at while in New Orleans, and will be back soon. Great f","useful":0,"cool":0},"rlG7zv8OG787OTxbqRg2zw":{"text":"This restaurant was somewhere that was close to the hotel I was staying at. The smells ent","useful":1,"cool":0},"LSk_3g7G4m4mF0hRgzFPgg":{"text":"Big fan of Italian food, went to this place expecting a lot -- it delivered.\n\nArugula Sala","useful":3,"cool":0},"Xopt7gRSFi3iOvG0jNRAWw":{"text":"Roasted cauliflower and pizza. \n\nThat's all you need to know. \n\n(I'm not a fan of cauliflo","useful":1,"cool":2},"FWtWQzZkQu8edhBp6aBfbw":{"text":"Beautiful Italian restaurant by famed John Besh  and Alon Shaya. Killer happy hour with ha","useful":2,"cool":3},"e9CZirhAP1TJ5D6wA-TW1A":{"text":"Started with the roasted cauliflower blossom with whipped feta and goat cheese sauce; octo","useful":0,"cool":0},"7zEEKCDTm1GLIMYyDeA1XA":{"text":"The other reviews are so great that I expected better... we came here because of a recomme","useful":0,"cool":0},"wXQSZ3SiCbqizU85PT6GQw":{"text":"The menu is diverse and celebrates authentic Italian fare. We had a group of 6 which provi","useful":1,"cool":0},"iwHSRvZLP4Ey9LEQXqX5Ig":{"text":"Visitor to NO with a family worn out in the hotel room. What to do? Get Domenica pizza tak","useful":0,"cool":0},"VFXPCN6ed62Tc9k00jTwtg":{"text":"When we were in NOLA, we went twice. Once for their awesome happy hour from 2-5, and later","useful":0,"cool":0},"HxxsjkxZUb4bONB8iWr3YA":{"text":"Another John Besh success. Also one of the best happy hours in NOLA. Atmosphere and servic","useful":0,"cool":0},"Uegz9HbpbbjfQzqMVoNvVg":{"text":"We had the most amazing happy hour and dining experience at this restaurant last month, al","useful":0,"cool":0},"rPcgLISNQ8zw8NSjhQVMyQ":{"text":"Great food, good service. the Tutto Carne pizza was great and so were the drinks. The atmo","useful":0,"cool":0},"1AiQzx__WIyPxoUdAltRUg":{"text":"The food here was okay. We didn't order pizza and maybe that was our mistake. I ordered ch","useful":0,"cool":0},"zv6wusH1fTM3Pzdd2ItIUg":{"text":"Beautiful restaurant, great unique food for anyone, great service, decent prices...what el","useful":1,"cool":0},"a-SbybnFkbkv7wTg2r4Wkg":{"text":"This was one of the best meals we had in NOLA!  My friends and I got several small plates ","useful":0,"cool":0},"b2XuE3yE6gXGjV6aC8ZL_g":{"text":"We shared the pizza which was delicious. Also had a great wine selection. The atmosphere c","useful":0,"cool":0},"dx2s6y8-c2-eW4cSl9N6Uw":{"text":"Very mediocre experience. The hostess was dismissive and bordering on rude. She curtly tol","useful":0,"cool":0},"fNjGDUwGy4zECvcNKpQ4GA":{"text":"Excellent food and service. This was probably the best lasagna that I have EVER eaten. Eve","useful":1,"cool":0},"__dClzgTBgdV9nUBzn-CIA":{"text":"Amazing food. Really unique flavors. Great location. \n\nBest balsamic vinegar I've ever tas","useful":1,"cool":1},"GLrUvqbblQhJnOFJP7ynRA":{"text":"Dinner at Domenica was memorable, despite being the last in a long week of great food in N","useful":0,"cool":1},"QD0pYS90Yi_9mYL65KBRIQ":{"text":"One of the best restaurants I went to in New Orleans. My dad still says 3 yrs later it was","useful":0,"cool":0},"DOm6yuoQk0F0DTB9_TujDA":{"text":"Ordered up!!! Cablabrese Pizza, Fried Tuscan Kale, Rigatoni with shrimp, Fettuccine Alfred","useful":2,"cool":0},"waphWSHW9Ja0dMyimKH1dg":{"text":"We ate here last night and every dish was absolutely delicious. The slow cooked lamb was o","useful":1,"cool":0},"qgq6eSskCOVbWFX0V_boPw":{"text":"Fantastic food and service. The pizza reminded me of Pizzeria Mozza from LA...fantastic! B","useful":0,"cool":0},"G5K5XK3n2ZNgO3B_Y5s2CA":{"text":"I'm a great fan of John Besh and this is a lovely environment. The servers are exceptional","useful":0,"cool":0},"LFKEMFi5_VvLL3ykPpF9Qw":{"text":"My girlfriends and I landed in Domenica through Yelp, we were on vacation and had no clue ","useful":0,"cool":0},"dKahYfhlqjYD9TN8M7hexg":{"text":"I really need to try more here than just the pizza and drinks.  I returned this weekend an","useful":1,"cool":1},"qOTqMxUBoTLFfJ8yiqrV1w":{"text":"The location is well designed, creating an upbeat stylish atmosphere...the King Cake is an","useful":0,"cool":0},"oTn_9VHWSLGJZ_h5Pnicgw":{"text":"Went to domenicas yesterday to try out their happy hour. Sat at the bar and had Peggy as o","useful":1,"cool":0},"h__LdCTCbwuBxMoTdhVcEA":{"text":"Wow just went for lunch and it was amazing! The pasta was fresh and al dente, the lasagna ","useful":0,"cool":0},"b0rEYKY5PYpJ8b7iFlQi6Q":{"text":"I hate to rate this place two stars but to say I felt letdown by them would be an understa","useful":0,"cool":0},"vEF2eRt1-qleyU5LOV35Fg":{"text":"Summary: Really great restaurant for either a team dinner or grabbing a bite by yourself. ","useful":2,"cool":2},"liG9pC28kLaxJfe60uDfFg":{"text":"Superb...  Nice antipasti, then an excellent arugula salad, but the crescendo was the bloo","useful":0,"cool":0},"u9wsbx0rZXHvRNK_1jCKSQ":{"text":"My family and I had a great experience at Pizza Domenica!  Loved the atmosphere only to be","useful":0,"cool":0},"dO9ZDiOvtOo7yGdAADWXvA":{"text":"Even with the new Pizza Domenica being closer to my house, I still prefer the original.  T","useful":0,"cool":0},"BtCShi1T58nKHAPUJsWrbg":{"text":"Nice atmosphere with good service , trendy drinks, unusual menu, very loud atmosphere! Bot","useful":0,"cool":0},"s9LQdqRUPrGnSBAZPRGx1w":{"text":"- Great service.  Knowledgeable, funny, and clever\n- Pretty good charcuterie board.  The b","useful":0,"cool":0},"0nOmllHYsF6-HSJIjEYBsw":{"text":"Since where I work is so close to this place and a lot of people like some of their dishes","useful":0,"cool":0},"PYha8zidFtz2n6xqK8I0aA":{"text":"We are staying at the Roosevelt and wandered down to the restaurant hoping for a lovely me","useful":2,"cool":0},"pjv8q38y26j_PYjHRcAtdA":{"text":"Food was five star. The roasted carrot pizza was delicious as was the kale and cauliflower","useful":3,"cool":0},"KjJGX1gyPxiiQAO-sHMyEQ":{"text":"Delicious flavors, love the appetizers, they are of good portion and very yummy. I like to","useful":0,"cool":0},"e5mEq7qKWSp5hkJR3iOn0A":{"text":"This is the best Italian food I've ever had. I cant remember the name of my dish but it ha","useful":0,"cool":0},"4f45fe9iTY3W7-DQQhoO_g":{"text":"A...wait for it...mazing!!!!!\nThe squid ink pasta is such a surprise. \nAnd the Pizza, u ha","useful":0,"cool":0},"xbF1mGSTV3pJ5-wUSb1-tw":{"text":"The only good thing at this place is their wine list. \n\nPizza was undercooked and had an u","useful":0,"cool":0},"68TlMf29dxkHn_TO1llh9A":{"text":"We visited New Orleans in February 2017. Our first visit. We were referred to Domenica res","useful":0,"cool":0},"1JyfEUA6hLyJ_CmCgt4JWw":{"text":"Streetfront at the Roosevelt/Waldorf with Great Italian fare!\n\nDomenica is popular with lo","useful":2,"cool":0},"wDI_woU1_ztUCNaav4lXxA":{"text":"Fabulous experience here! The atmosphere was absolutely amazing, the restaurant is located","useful":1,"cool":0},"ukjWtbvc5cUFfxawd3WhUA":{"text":"Located inside the gorgeous Roosevelt Hotel, this restaurant is just as delectable as the ","useful":7,"cool":6},"itQVFHhC1VNXGoGDX1u8Mg":{"text":"Go for happy hour from 3-6 when pizzas and drinks are half off! You won't be disappointed.","useful":0,"cool":0},"Ba6eFMx-3WzJ3DXwRsaphQ":{"text":"White pizza was great. Lots of salt though. Make sure you drink some water.\n\nThe coffee fl","useful":0,"cool":0},"vnZOzzWJabkUkKNZmC9kOg":{"text":"One word.. heavenly. Hands down best pizza I've ever had in my life! Margherita is the way","useful":0,"cool":0},"5mbj8M1jHZa_jhfFkNcglg":{"text":"Amazing!  This place is the bomb for happy hour, which is 3-6. There's half-price pizza, s","useful":1,"cool":1},"HSVEyqXhqb9X_yvejTsJBQ":{"text":"I came here with a group on Super Bowl Weekend. The town is understandably crazy and fortu","useful":1,"cool":0},"W0xJJ6-XT54flAnKPmxrmw":{"text":"Their water was my favorite part of the meal.  Pizza was burned, service was fine.  Way ov","useful":0,"cool":0},"NZiy5eoOmKKgGmk3wXkLrg":{"text":"We tried to come here on a Sunday and were told the wait was an hour. We made a reservatio","useful":1,"cool":0},"kJsrJQz3YoQVzcjwYPzI8w":{"text":"Great pizza w/mortadella I like b/c it's authentic way when I studied in Italy, they make.","useful":0,"cool":0},"eqoquOjrNKS16sW452XnMg":{"text":"Wow this place is awesome. We just stopped in for happy hour half priced pizza and drinks.","useful":0,"cool":0},"Mr3tZhY1OREjmskxTliS6A":{"text":"Okay -- so this is no August or Luke for that matter.  The food was average and the servic","useful":0,"cool":0},"rOADR16iK9a8SsXQ4Cm2qw":{"text":"Had the Calabrese pizza, with spicy salami, mozz, and capers, awesome brick oven pizza!!!","useful":0,"cool":0},"icDHeYZRxTpfLOi_rXGqjw":{"text":"The takeout experience is just as nice. We ordered calabresa and Tutta carne Pizza along w","useful":0,"cool":0},"ERz1XCQne0-1-2AgN30xJg":{"text":"I'm always amazed at how great Domenica is. I travel to NOLA a few times a year for work, ","useful":0,"cool":1},"BqS0yCcuZgIkSLrfWcVusw":{"text":"After hearing such good things about Dominica, I really wanted to like the place.  As a hi","useful":0,"cool":0},"HqAM493fZ5brxC2qjVUqVw":{"text":"Best iteration of roasted cauliflower thus far. What a genius idea to soft/slow cook the w","useful":0,"cool":0},"4gI1iSJ76siwMCQFwwq3aQ":{"text":"Went here for Happy Hour earlier this week! 1/2 price: all beers, well cocktails, wines by","useful":1,"cool":0},"9IBRCITdiHigVU92TuSDfg":{"text":"Been to New Orleans twice in my life and have been to this place six times.  I am addicted","useful":0,"cool":0},"cxas-mODd8NHufv7rMkPhw":{"text":"I visit this restaurant every time I am in NOLA. Fresh modern Italian. For lunch or dinner","useful":1,"cool":0},"t7oUNlhgqHHNcQn7pLvcIg":{"text":"No NOLA trip is complete without happy hour (3-6pm) at Domenica! \nLuckily we were able to ","useful":0,"cool":1},"AHVMcCoiAFLbqnF4JGL2zA":{"text":"Came here recently for a nice dinner.  Vegetarian friendly.  The cauliflower that they hav","useful":0,"cool":0},"ddl28MD32MAPN0zR3FYZkQ":{"text":"All I can say is YUM and thank a friend for this recommendation when we visited New Orlean","useful":0,"cool":0},"xhQo5f92DUeo_YanZhuP8g":{"text":"Went here on our first night in NOLA. Chose it based on the closeness to our hotel and the","useful":0,"cool":0},"e2cKxfGf5inLu8Txw-_fdw":{"text":"I've become somewhat of a regular at Domenica's happy hour special (half price pizza, wine","useful":1,"cool":1},"GtJg09E-buryfSI1COIDcg":{"text":"Went here last night for daughters 20th birthday party. It was amazing! We had pizza, and ","useful":0,"cool":0},"dwr_zzOm_WsofEuc3L17cA":{"text":"A friend had recommended this place to us. We were not disappointed. The restaurant is a l","useful":2,"cool":2},"a0c4O52dDNJhNzPt35m46Q":{"text":"I have to start by saying that I really, really wanted to love this restaurant.  We had se","useful":1,"cool":0},"Vmv3SDLEcXPMP9du5WkKeA":{"text":"Good pizza. If you like pizza hut or dominos, order from there. This pizza is in a class o","useful":1,"cool":1},"kc_C1zuaTGxibFv38-TKsQ":{"text":"For a restaurant that is trying to give you the experience of an authentic Italian restaur","useful":1,"cool":0},"lM2slQqysrN0AFTd7HXHCQ":{"text":"This place is wonderful. It's inside the Roosevelt Hotel, but anyone can walk in. Now, the","useful":0,"cool":0},"JhwmNb-J0l0zw_gEmPRNUA":{"text":"Every dish we had including dessert made us \"mmmm\" with delight. The octopus carpaccio mel","useful":0,"cool":0},"8fKz9qlbBaqrSnkLIkqXxw":{"text":"HOLY MOLY! I think this will be one of the meals I'll still crave when I get back home to ","useful":0,"cool":0},"ebXJrgf0N_nXAiZbc_gRww":{"text":"A NOLA mainstay for us.  Start with, burrata, specialty meats and cheeses, and cauliflower","useful":0,"cool":0},"NtzVb4qSiFCwO60CpqYmyA":{"text":"Absolutely amazing food. The pizza is much bigger than it looks in the pictures and the sq","useful":0,"cool":0},"Tvvt7fX0qmHnVKDEdljOaw":{"text":"We did happy hour here on Friday. We were a party of 6. We walked in and it wasn't a probl","useful":1,"cool":1},"6Y_7sukfMXXlU3sk_d0Nzg":{"text":"Incredibly unique pasta creations and intriguing \"Happy Hour\" specials.  Food was excellen","useful":0,"cool":0},"tfRbJIsI2OrxgHN3o3DIyg":{"text":"\"Awesome. Loved the spicy calabrese pizza. Great service and atmosphere. Can't wait to go ","useful":0,"cool":0},"NUH_hhXjax1ETQGVCIOchw":{"text":"Stayed at nearby hotel, so was a good choice after a long travel day. We had high hopes af","useful":0,"cool":0},"ou5YCADMrHGmK5_varmMew":{"text":"Wonderful location, food, and service. I highly recommend this place as an ideal dining or","useful":2,"cool":1},"7J3VLvgcREGymIlnWOxHew":{"text":"This place is awesome.  John Besh does it again.  Great cocktails too.  Yum, yum, and more","useful":0,"cool":0},"czSFj5M-ckRtOEKhyDebiA":{"text":"Had a very nice meal here on a Wednesday night. It was still very crowded for a week night","useful":1,"cool":0},"EVKewiVBdjbVn-NqFGD1xg":{"text":"Great meal for good price. I had the margarita pizza with the octopus carpaccio appetizer.","useful":1,"cool":0},"VVbvOY88VT9JKckvF8inmg":{"text":"We came here from out of town. We loved the atmosphere and everything down to the furnitur","useful":0,"cool":0},"AyRYZcC1pNkAfCby3HPSgQ":{"text":"While the food at Dominca was amazing, we had the worst service. We waited for over an hou","useful":0,"cool":0},"A4cF4bpFhHkV9N7_koD7ew":{"text":"OK so we did some amazing things this time in New Orleans but this is the first review I h","useful":0,"cool":0},"j5CAUz21ZOoD4a2xRIZnRg":{"text":"Great pizzas at reasonable prices.  Meat/cheese boards are money well spent.  Waitress was","useful":2,"cool":0},"BKqK-MtD-hJokQVSIEhLpA":{"text":"My first visit to Domenica was right after they opened. I took my mom and she loved every ","useful":4,"cool":0},"sz7IaOOJTHIDz9kcxaBBLA":{"text":"I came with a group of girlfriends and the place was simple, modern and beautiful. The ser","useful":1,"cool":0},"UhB27wgRYjpq4sEYF6Z_jg":{"text":"This restaurant is inside the Roosevelt Hotel. The food was great and service is very frie","useful":0,"cool":0},"E4hYj-ChA8wxHxVsDUDPXA":{"text":"What a fantastic place to go to when you're visiting New Orleans. I had a fantastic time e","useful":1,"cool":1},"8URaSHnqaRPZTt5RwQl2Lw":{"text":"Was so looking forward to eating there, but was so disappointed!  We took an early reserva","useful":1,"cool":0},"plJCRVAHEjhRJgv6R0kPUg":{"text":"Just a great break from endless bowls of jumbo!  Everything was above the fold... food, fl","useful":0,"cool":0},"7_GpfbnpAWO5mpev7_AMDw":{"text":"Went for pizza happy hour, gem salad was very good. Ordered the prosciutto pizza and calab","useful":0,"cool":0},"Dyp3v10Fy9kJk44FHYRQSg":{"text":"This is a must stop if ever in NOLA! I make it a point to stop every time I'm in the area.","useful":0,"cool":0},"XG94-LH2VMSB3Jr01El7Cw":{"text":"I always am a bit hesitant making a reservation with 2 kids in tow.  Fortunately not that ","useful":0,"cool":0},"9IPqMiyBbRT6lvf_-H6wAw":{"text":"As many have said, the happy hour from 3-6 is one of the yelpiest deals around.  You absol","useful":0,"cool":0},"REZsaCmHYeV0M5nLVMUDZw":{"text":"Delicious pasta and pizza. Great ambiance and decor. Service a little slow but still good.","useful":0,"cool":0},"wNdb-6noT22Cw8Psa0h24Q":{"text":"stayed at the roosevelt while visiting nola for my bachelorette party :) my girls and i (t","useful":0,"cool":0},"uFlvCB4q-7ZY9P9BSGF-BA":{"text":"I will be forever indebted to this place for introducing me to the beautiful world of clam","useful":0,"cool":0},"L-BIcuXmZpfP2ukmuZZ88Q":{"text":"Before my most recent meal it had been a while since I had dined at Dominica and have to s","useful":5,"cool":4},"toNW5ATqWSh-HGVUqQtlPQ":{"text":"Visiting New Orleans, this was just a few blocks from our hotel. Stopped in and had a chee","useful":1,"cool":1},"hM7P2hekZ5QU4rwUMQRqhw":{"text":"This was my favorite meal in New Orleans. My friends and I shared the cauliflower, rigaton","useful":0,"cool":0},"kL0WS7vBLRz2kzcP3nWNZw":{"text":"Great happy hour and great service!  Enjoyed a couple of peronis and a tutto carne pizza. ","useful":0,"cool":0},"cgxcDiqDiVq46lSSdLz8SA":{"text":"Exceptional service. Beautiful environment. And the food is fresh and delish. Margarita pi","useful":0,"cool":0},"7OQVqByr6RfikGRYLSeqKg":{"text":"John Besh's restaurant failed to impress me. A mostly italian themed menu, I would say thi","useful":1,"cool":1},"qN-wve94wNNxwWwhEKxXzg":{"text":"Probably the best pizza i have ever had. Do you self a favor and try the roasted carrot an","useful":0,"cool":0},"qxHGi0gLFpu-7y-O4MziLw":{"text":"Nothing was bad, but everything was just OK.  Considering the previous reviews and menu pr","useful":0,"cool":0},"mcf3TKfme6FQGz3T6rRjXA":{"text":"this place is amazing. I loved it. In the vicinity of one of the nicest hotels in NOLA, wi","useful":0,"cool":0},"T7eZufQZHr-mpXJaeOHtXA":{"text":"Such a fan of Domenica's Happy Hour Special!  A friend told me about their half off pizzas","useful":1,"cool":1},"DmtgoktJFTOOA9puD2KhIg":{"text":"Hmm... 3.5 stars maybe?  This place is a little fancy for my tastes, but on the flip side ","useful":0,"cool":0},"1cXm1W74hW3gTBYd9YNeaQ":{"text":"John Besh strikes again, this time along with Alon Shaya (his Executive Chef for Domenica)","useful":3,"cool":1},"Lu7nyBhYBEb6nx-MIgx3qg":{"text":"Genuinely some of the best food I've ever had. My husband had the squid ink crab pasta dis","useful":1,"cool":0},"2SWKABZgJs64f4henIr5RA":{"text":"On our third night in New Orleans, my friends and I had reached our cap on Creole cuisine.","useful":1,"cool":1},"WdM8mgreWChlhK3pwMj_0w":{"text":"This place was packed to the brim on Christmas Eve when I and two friends stepped in for a","useful":0,"cool":0},"tG_i68pL5AzfPAUHVt58-w":{"text":"The  ambiance  was nice! We ordered Clam and the Margharita pizza. We were shocked to be e","useful":0,"cool":0},"Viy2AQyhYlld1xmU-7taHg":{"text":"This was a major because it is such a well known reseturaunt. The hostess told us it would","useful":0,"cool":0},"w-vrYtAzTHmnM77YlNw0Fg":{"text":"We showed up 30 minutes before they opened and the manager let us grab a drink at the bar.","useful":1,"cool":0},"_N9aPHnpWJYMDfy54voMCQ":{"text":"Way overpriced. Service was sloooow. Took almost 2 hours. Ordered the spicy lamb pizza, ca","useful":1,"cool":0},"sRxxe3TDEcOp_lxbCNRbqg":{"text":"We came here after reading the raves about happy hour. When I saw the sign that the restau","useful":0,"cool":0},"oMw3ckrT5JZAMRe3Phu70Q":{"text":"Our party of four was anxious to try this place after hearing good things for friends. I h","useful":0,"cool":0},"1TVoKSg3gPTioknS2xmshA":{"text":"The carrot pizza it outstanding! It reminded me of a slight Indian cuisine flavor given th","useful":0,"cool":0},"jEIe5UJA0j3XnJ1jCrGT5Q":{"text":"After reading many reviews of this restaurant, including the one written by Yasmin R., I s","useful":2,"cool":2},"MreM5-OyFKtQE7yJMvy8fA":{"text":"We ordered the Margherita pizza and squid ink pasta TO GO yesterday just before getting on","useful":0,"cool":0},"dV2pgM8uUtC37-wO81uRww":{"text":"WOW! We were so fortunate to have stumbled upon Domenica! We were looking for a late lunch","useful":3,"cool":2},"VrZFk4MIYjxJ7h30QR_REw":{"text":"We stayed at the Waldorf Astoria Roosevelt Hotel where Domenica resides.  We arrived mid-a","useful":0,"cool":0},"UnYVU6I4ikL4DQomreYenw":{"text":"The meal started well with wild mushroom soup. The pasta was al dente but over-spiced. My ","useful":0,"cool":0},"ATXRFMeRuSJ4hY2IYKD6cQ":{"text":"Amazing food! Rigatoni is spicy awesome! Pizza crust is literally the best ever!! Pizza is","useful":0,"cool":0},"2aVb8EdwJQB02BwUYM0d5A":{"text":"Best pizza in town (neck to neck with slice). Happy hour is awesome and very typical of Jo","useful":1,"cool":1},"p_489bBA-IftV8BY6jK4eg":{"text":"Happy hour between 3-6pm is awesome! Half off pizza, apps AND wine! The food is OK but a g","useful":0,"cool":0},"gaNu8eqd4RVSEsRAK3Lhuw":{"text":"Loved the app. selection. Sat at the bar and had a few drinks and some apps. The service w","useful":0,"cool":0},"WhqzwTKT5wEEWvKbQI1YBA":{"text":"Delicious! We stopped in late on a Sunday as they were open until 11pm. The place was stil","useful":0,"cool":0},"enMahcF6K0nsAbVjHderHQ":{"text":"After a tired day of walking New Orleans I wandered over to the restaurant to pick up a pi","useful":0,"cool":0},"IHnVOPuEHetQrCh0f3VImw":{"text":"Perhaps my favorite restaurant in New Orleans, definitely on my top ten list.  I've never ","useful":1,"cool":0},"Cm8aWQC3q3Wt7lvA71hshw":{"text":"We went here on a recommendation from a friend who used to live in New Orleans.  This was ","useful":0,"cool":0},"D8ObGbW76CXWcZ7QqnTk2g":{"text":"If you get tired on New Orleans cuisine, try Domenica for some great Italian flare. Food w","useful":0,"cool":0},"S5aiZzrzwMxd1vjlaR184w":{"text":"The rigatoni dish was delicious. Also, we very much enjoyed the brussel sprout salad. The ","useful":0,"cool":0},"Dy2KNgj0mkjGEya7U-GOlQ":{"text":"Another great Besh spot headed up by emerging celebrity chief  Alon Shaya. I love eating t","useful":1,"cool":0},"IJD8vFxHR8mooExqfM2Lkg":{"text":"Had lunch there yesterday.\n\nWill always go and always enjoy it.  Yesterday though, the Str","useful":0,"cool":0},"acEGDfSwZGfhJmUMmZV0qg":{"text":"The service was delightful and the food was delicious. I had sweet potato torteloni and th","useful":0,"cool":0},"WeOStV5I0E5cSqPez1xdQQ":{"text":"We stopped in for their daily happy hour which is half off beer, wine, pizza, and well dri","useful":0,"cool":0},"xkAYbKb6DELNBhFL7YXgZw":{"text":"When eating at restaurants at hotels it can often be hard to find something to eat. Right ","useful":0,"cool":0},"-W0IO-dUhTObcLzYP8FRhA":{"text":"We almost didn't go here because we had already done a few Besh Group restaurants but now ","useful":0,"cool":0},"k2Ywm8LnfdDXp6KDP9WEig":{"text":"Pretty darn good Italian food! Fresh ingredients you can taste here! Had the cauliflower a","useful":1,"cool":1},"spBN9J5WQ2gPObhXMzisTQ":{"text":"I know I'm in the minority here but I don't see the hype with Domenica. The first time I w","useful":6,"cool":2},"NxVKEWtoTK1WOGb7ZRg3CA":{"text":"Matthew was amazing at the door.  Strawberry martini was great.  Four cheese pizza was not","useful":0,"cool":0},"r8498Pa1gFFQelfJCD54Ew":{"text":"Very fancy and up scale.... you can go dressed casual, but you will feel a bit under dress","useful":0,"cool":0},"d5z75Rmf9ktLvQoRf1VllA":{"text":"Because I'm gluten-free, I couldn't enjoy the delectable looking pizzas... All the ones th","useful":0,"cool":0},"2mCNU1WL2_QC8HUmT5YG1w":{"text":"One of my all-time favorites! I first came here for my boyfriend's birthday dinner and it ","useful":1,"cool":1},"ZELt9r21uWHGDZbHtSzUOQ":{"text":"I am so conflicted when it comes to Domenica! The pizzas are wonderful with their thin, bu","useful":3,"cool":1},"AZxzwEcFeFJuuKJlfQRf3Q":{"text":"First time here & I must say, food is delicious. Our waitress Christina was wonderful & ve","useful":0,"cool":0},"W26kocpkpOqTZXyc91iM3g":{"text":"I had the most satisfying meal here.\nBeing from Italy I'm usually disappointed in typical ","useful":2,"cool":1},"yTxu3umdsFVnb4LlnSvRbA":{"text":"Best happy hour specials! We were so pleased to come across this place. Half priced pizza,","useful":0,"cool":0},"_7aTfSyffDthCvdHac66qQ":{"text":"So, i have tried this place and was satisfied but not entirely. Here is why.\nDomenica is a","useful":1,"cool":0},"zS0WrqTAhT6zuQAlv9xiAw":{"text":"Had my first Domenica experience in August before an Incubus concert. Great atmosphere, go","useful":2,"cool":1},"K2JfBxahmK-FHkvQEbxgdg":{"text":"Truly amazing food. And something for everyone from pasta to pizza it's all great!  If you","useful":0,"cool":0},"Vfkv4dbDwo2v6HpjeTaBQQ":{"text":"Well I must have missed the memo people.  I have been here countless times and I just alwa","useful":4,"cool":2},"iDa2oT3H8oloYLez149jhA":{"text":"DOMENICA~\nI don't even know where to start with this review. This was truly a culinary exp","useful":1,"cool":0},"5bF9PmOKOznewJSpJRlK9g":{"text":"Great pizza and casual, non-intimidating atmosphere in a luxury hotel (Roosevelt); the sta","useful":0,"cool":0},"rbwDv3_IBftyTijOysZXsw":{"text":"One of my favorites in NOLA. Terrific wines and delicious food. The roasted cauliflower is","useful":1,"cool":1},"Wb3JuGRD8ocVy9c16Ud6aA":{"text":"Oh, Domenica! How I love you so. \n\nI took my second trip to Domenica because quite frankly","useful":1,"cool":0},"SgGjBQOEYKgI_KjDNHtjfg":{"text":"This pizza is the worst i have ever eaten in my life. Its super salty and the bottom is bl","useful":0,"cool":0},"GRMEqjbof5Wbq1yHpJKxSw":{"text":"Great beer selection but avoid the Roasted Carrot Pizza. We ordered it based on other Yelp","useful":0,"cool":0},"383hjt44OL9GBcsPTGrDwA":{"text":"I loved the food, vibe and customer service here!  I loved it so much, in fact, that durin","useful":0,"cool":0},"KLy_xPbZXo7NFCvfkoBeSw":{"text":"Wow, just wow! I had one of the best meals of my life here. I had the fried kale to start ","useful":0,"cool":0},"6rtk4dRXUsqHH6fHMEWzqw":{"text":"I would give this place between 3.5-4.  Ever since i came here I've been craving their wat","useful":0,"cool":0},"t8krD8focRT9rMmnyNo1Tw":{"text":"I absolutely love Domenica. I come here often. But tonight our service was below average. ","useful":0,"cool":0},"XkU1LtIDAK1vmPM6Ddj-ow":{"text":"Full disclosure: I worked here for a few months so if you think that is a conflict of inte","useful":3,"cool":2},"fFhMCUmFYuQVvdX0I6wWZA":{"text":"Pizza, Pasta, and Panini's, oh my!\n\nWhen the concept was described to me as an \"Italian sm","useful":3,"cool":2},"J1k7T19RJsmFXYnLDXfTAQ":{"text":"Hands down the best restaurant in New Orleans that I have tried (15+, including Cochon, Co","useful":1,"cool":1},"RrMbThLgTg8WhroJ9Fs4Qw":{"text":"So glad I made hubby go outside of French Quarter and venture place on the other side of C","useful":4,"cool":2},"KLQYPupXwE6XFPL5VPctWw":{"text":"Domenica was a wonderful dining experience in regard to both food and service. Our server ","useful":1,"cool":1},"fjRndymL2wZhkK-WiZ3Zdw":{"text":"The four of us ate here for dinner our last night in New Orleans and it was delicious! We ","useful":0,"cool":0},"4hmsYusKtmmgXaLNUsfrIg":{"text":"I stop in every chance I get as the food is delicious and the staff is great. \n\n7day a wee","useful":1,"cool":0},"IB3adUg66jyMigHQP0XrLw":{"text":"Decided to check this place out finally and it didn't disappoint. Disclaimer, I'm not a pi","useful":2,"cool":1},"7xK8xfVkvIJijybsHSSx9A":{"text":"This place is FANTASTIC!!! I have been here several times and I've never had a bad experie","useful":0,"cool":0},"Wk2lqt3U9dZXmMlxNsGyeg":{"text":"Exceptionally tasty food and great service! Mallory was super kind, knowledgeable, and fun","useful":1,"cool":1},"pzGOi1apPkpulSqgFGaRAw":{"text":"Yay. Another great experience at Domenica. My office went here for a holiday lunch today.\n","useful":1,"cool":1},"o3smbCBgL5Bmh_L4Mj6sMQ":{"text":"This place was excellent. The food was tasty, and one of the best Italian places I've been","useful":0,"cool":1},"av5mhOSX7r2hxFB639q5Qw":{"text":"Came here a couple of weeks ago with a friend. We had only planned on coming here once dur","useful":0,"cool":0},"TXwR8Rj7zRT6Jm1EczRglQ":{"text":"OMB!  Oh my Buddha, for those of you who are not in the know.  I can't believe I haven't w","useful":0,"cool":0},"tkv4J0eKSKmRACHy_63TyA":{"text":"Absolutely horrible service! Every single waitress there had an attitude problem, and nobo","useful":1,"cool":0},"Ctjq1gkMq1qDmfkWAM4BpQ":{"text":"Amazing. So so so good and my favorite meal in NOLA. I got the fusilli with shrimp. The pa","useful":0,"cool":0},"h8--CMgxDx-FIhUyVRN7lw":{"text":"My coworkers and I recently had lunch at Domenica.  Every now and then a group of us will ","useful":1,"cool":0},"AUOcRRHz1u2L2MdMUylxgw":{"text":"So I was given the unenviable task of picking a restaurant for my co-workers for a work di","useful":9,"cool":6},"pipoTXOi-HUH12N1DD41cg":{"text":"LOVIN' HAPPY HOUR!!!  I don't think there is a better happy hour deal than half off pizza ","useful":0,"cool":0},"TM86xhETrhip-af2239iXw":{"text":"tried the pizza, nice thin wooden oven pizza.\nsquid ink pasta was really good\nred snapper ","useful":0,"cool":0},"fiIv4x4oEEHq6FlbgHkGDw":{"text":"Mozza in LA by Nancy Silverton and Mario Batali, Delfina SF, and Chris Bianco's Bianco in ","useful":1,"cool":0},"waA-GrB2b3BT9T2FrRRk-g":{"text":"A friend had recommended this spot for us to try.  Italian was not on my list for a trip t","useful":0,"cool":0},"zsStfGYdzuY9Nlk0V_4JMw":{"text":"Nice, sophisticated, and great ambiance. This is a great place for a first date, but make ","useful":0,"cool":0},"Rve25sfMxZCju9zcDx2Wzg":{"text":"Ordered pizza for delivery - a 4 cheese and a pepperoni. Though they arrived a bit cold-is","useful":0,"cool":0},"HekkRgEPyjFH99m-oww1wA":{"text":"Eats: 1/2 Smoked Pork & 1/2 Calabrese ($15) and Clams & Speck ($24)\n\nOn just about every v","useful":2,"cool":1},"kt_QBTRDCDVdUr5M9zMHfg":{"text":"Happen to be in New Orleans for the first time on a Business convention and wanted to try ","useful":2,"cool":1},"bXwmtVz7eERzZ_qa8LrkcQ":{"text":"This place crushes other dining experiences in Nola by a long shot. Wow! By far this is th","useful":0,"cool":0},"v4WAEpe7l0WVtWBA0yc8MA":{"text":"Love the atmosphere here -- it's very spacious and comfortable. I had the Tuscan fried kal","useful":0,"cool":0},"Fs8ZWoyDyQOlzF5AFqgOFA":{"text":"AWESOME place. Had three meals here over a week stay at the Roosevelt and enjoyed every se","useful":1,"cool":1},"ykPmEzc_2OaJE9BDeQAFTA":{"text":"I only experienced happy hour there, not a full dining experience but I was pretty pleased","useful":1,"cool":1},"CTaXTtCbVQvdOBkUVWxlmQ":{"text":"I've come here twice so far and both times have been excellent. The first time I came here","useful":0,"cool":0},"EfpZ_E8qAV6jpmyFqyXSnQ":{"text":"As if the Waldorf hotel wasn't enough class! This restaurant is way up in the high grass y","useful":2,"cool":0},"aVgl3QLfHrbEdqz7Y_SDWA":{"text":"I love Domenica. \nNeednt say, bomb Happy Hour. Great wine list, killer Lemon Cello, and th","useful":1,"cool":0},"AvbHEUPdVKIghI8wZZxTLg":{"text":"My friend and I came here for dinner one night during our vacation in New Orleans. We pick","useful":2,"cool":0},"8lV8WMWOTA0DQZam-qYo5w":{"text":"One of my favorite restaurants in the city. Reasonably priced for a delicious meal with ex","useful":0,"cool":0},"8OueZHvULy8nzJBxVw8cdg":{"text":"This review is not about the food or the ambiance, just about their happy hour. So you kno","useful":7,"cool":5},"SjVyGX5cllBjDQ7Y4apAeA":{"text":"Excellent! The menu is very diverse and not something you may be use to.  Ask your serve f","useful":0,"cool":0},"TjpX67gp8faoCyE4trXdMQ":{"text":"The food was simply amazing!  The cool hip decor made it an \"in\" spot that you wanted to b","useful":1,"cool":0},"-2qWlrP4FAVeLsAkIi_1lQ":{"text":"This was a very pleasant suprise.  Sitting dow to dinner I wasn't quite sure what to expec","useful":0,"cool":0},"DEawbWSpzUws4xxsJq6UcQ":{"text":"Domenica is a beautiful Italian restaurant with equally beautiful food. We got the campani","useful":0,"cool":0},"7-R1pBkzXxmXneXPPPkYGQ":{"text":"This is one of my favorite restaurants in New Orleans. My husband and I eat here every yea","useful":0,"cool":0},"oYt2olHVkA1wvkC9lYi3tw":{"text":"The lasagna is either the best I've ever had... or equals the best I had in Milan, Italy. ","useful":0,"cool":0},"mt3LquxRzoYYZtoDk4LT1g":{"text":"Best happy hour around. Half priced pizza and drinks. I liked the smoked pork pizza. The c","useful":0,"cool":0},"tHoUHhTNHNbQRadLIO5h_Q":{"text":"Had the margherita pizza at Dominica sat night. Really looking forward to a good pizza. Un","useful":2,"cool":0},"UqPdYOsSLf1CCBs2c_7iYg":{"text":"A gem in New Orleans that I didn't discover until I left! So incredibly sad. This restaura","useful":0,"cool":0},"zz9Op1cK4NQDDdb4ennzBQ":{"text":"Good service and great cocktails but a bit on the small side compared to the Sazerac.  Sta","useful":0,"cool":0},"36xazXvZcrBkrnI0EZo-BA":{"text":"Happy hour specials are fantastic. My husband and I split a pizza, had 2 beers, dessert an","useful":0,"cool":0},"yqaOoYKtvOIKnUgC2LMJVg":{"text":"I'll start with the objective food evaluation and I will say it was really good.  Lamb mea","useful":0,"cool":0},"nUDcSf9aCzHMIzykwAaSJQ":{"text":"Yesssss! If you're thinking about dropping in, you should without hesitation. Good service","useful":0,"cool":0},"rTcxW9wuB-Xk9Zlw5fD6MA":{"text":"Easy choice when you come to New Orleans for work or play.  John Besh and Alon Shaya prese","useful":0,"cool":0},"OEb3NxF_gzP-qTZgU5yJiA":{"text":"While our waiter was unmemorable and borderline dick-ish, the food spoke volumes. As we wa","useful":0,"cool":0},"dVv_GX_jLzh9FoL2CrBIng":{"text":"While the food is outrageously satisfying, the way the staff handles situations is not. My","useful":1,"cool":0},"8TspqNQJbSUJliJWMPQ3fg":{"text":"Great Meal and Experience\n\nWent with friends for dinner on Thursday night.  Had a wonderfu","useful":1,"cool":0},"AeqZ0HtIx9hyHQblOYiHIg":{"text":"Impressive, innovative, trendy.  A special treat!\n\nReview is based on 1 visit, weekday, ea","useful":3,"cool":1},"D7kx4b32RwArtMrbGAEbWA":{"text":"Happy hour is incredible here! Definitely make a reservation. You will not be disappointed","useful":0,"cool":0},"rGBUORwqhdbhtiv_0N97Kw":{"text":"The pizza is great. However they do not validate parking and other restaurants in the Roos","useful":0,"cool":0},"d0sEIZyyMdfNLLeL3tK9Cg":{"text":"The thin crust pizza was tasty. It was perfectly cooked so the dough was soft and the crus","useful":0,"cool":0},"Wnqdr590fRnO2OgmPeJAXg":{"text":"Dropped in for lunch and left full. Had the Marg pizza. I love how fresh everything is. De","useful":0,"cool":0},"qMo2C8UvBALJjrQA2fckPQ":{"text":"Beautiful interior with modern vibe, located in Roosevelt Hotel, very friendly staff, pizz","useful":0,"cool":0},"0nCxLtrWAzkKmATlof2fpQ":{"text":"Delicious. Everything is fantastic. Cocktail menu favorite would be \"salt bae\". Love the c","useful":1,"cool":1},"Mr9TVxr4xkbv9soedzzJPQ":{"text":"There is nothing to complain about here, except., they ran out of the Vino de Sardegna but","useful":0,"cool":0},"_5SQvwo4N5qcqZ1q9nKosw":{"text":"Great food and even better service. Been here a few times from out of town and I've never ","useful":1,"cool":1},"hWC0YCJE4_X0W6ucM_viwA":{"text":"Absolutely loved the food here.  We had the roasted cauliflower with whipped feta- A-MAZ-I","useful":0,"cool":0},"cfgwDwJ9QZkJinUIklXYng":{"text":"Dominica was recommended to us by the concierge at our hotel when we mentioned were lookin","useful":0,"cool":0},"qqqfidjYcp0L16x7C81Wdw":{"text":"Nom nom nom! Seriously delicious, and rather authentic, Italian food. This place is defini","useful":1,"cool":2},"2E6z-5Ke3p0y9Q1j_sDLRw":{"text":"My favorite happy hour in the city. Come in from 3-6, get half price pizzas, wine, beer, a","useful":0,"cool":0},"5f8jelkS6qE83SMdCf_KtA":{"text":"Great place in NOLA. Even though it is certainly pricey, the food and the service are top ","useful":0,"cool":0},"saVry2H3nP4o_dBrLN0cug":{"text":"This is not your mama mia's pizza!  I had been wanting to try Domenica for a while now.  I","useful":1,"cool":1},"d4geGfT2lLWsigyXVguWSw":{"text":"The food was great, but I'm taking two stars off for service. We ordered within ten minute","useful":0,"cool":0},"Eq6jMuiSb_po7Y4e6mrVTg":{"text":"This is my favorite dining spot in New Orleans. It's very close to home, and the happy hou","useful":0,"cool":0},"O9QDj5M7UZPX1Eqrc4qB9w":{"text":"Dominica is one of my favorite New Orleans restaurants.  The food is great, things are not","useful":0,"cool":0},"XxwO7EZoE5zIPeYpA8Htvg":{"text":"RIPOFF warning.  Happy hour description posted by management is wrong - they charged full-","useful":0,"cool":0},"9Kz8tpgLBqQJ7KhnlhBD4w":{"text":"We found Domenica's during our 2015 Trip to Jazz Fest. The food is FABULOUS, authentic Ita","useful":0,"cool":0},"Sa8i9GBB0lI2cNpGzg2sQQ":{"text":"Very conflicting feelings. This was one of the best examples of this kind of pizza etc tha","useful":2,"cool":0},"abJqsA_QPXdQZGlF9toVuQ":{"text":"Best lasagna in the world? Definitely a contender. It was delicious. I would recommend it ","useful":0,"cool":0},"9bY-BjCue-mprmym4qBrfg":{"text":"My husband celebrated his 35th birthday here last night. We had a delicious meal! I had th","useful":0,"cool":0},"vdWPmMr7effT53X8jZXxiw":{"text":"After an in-and-out drink at the bar and a wonderful experience at Luke, I decided to make","useful":0,"cool":0},"0NKPUJ6718lQ6zu7nwIhzw":{"text":"Visiting New Orleans and just had the most incredible meal at Domenica at the Roosevelt Ho","useful":0,"cool":0},"EHQ9PW8ERP5EZEp3TK4_Gg":{"text":"\"We stopped by and ordered two late night pizzas while on the way to our hotel after leavi","useful":0,"cool":0},"KaE66v5WatKtfAjHBNBdOA":{"text":"High-end Italian restaurant.  Very simple, authentic Italian menu.  We had the roasted cau","useful":0,"cool":0},"OpIxnKfQqHkZp6uiZLcqVw":{"text":"I would like to recommend, Domenica's for dinner. I had an enjoyable experience and a grea","useful":0,"cool":0},"YPBSYziNGbOMmBXFZhKchA":{"text":"a wait staff with flair and style, presented tasteless pizza under cooked, roasted caulifl","useful":0,"cool":0},"l5jiDAgAs0JexGDEjwmZ_w":{"text":"Great Food and wonderful friendly service! The Rib eye Bruschetta is to dye for! Perfect p","useful":0,"cool":0},"tHRmDbgGkVFoz9mvpMh-RQ":{"text":"This place is very tasty! Our waiter, Justin, was fantastic and very helpful. The service ","useful":0,"cool":0},"gmBOOkOHovjVSIPeLI-pPA":{"text":"I love this place simply because of the pizza and the cauliflower, which is a full head co","useful":1,"cool":0},"FRc5j2GHZhisZIH1sRLjhg":{"text":"Great happy hour.\nAmazing pizzas!\nTerrific ambience...lots of people...chatter buzzing abo","useful":0,"cool":0},"aeK7r1QHGGUVcExIeU7COw":{"text":"I personally did not partake in dining, but did have a bite of my boyfriend's meat lovers ","useful":0,"cool":0},"vglCYK00Uzl0GTV-6gsJmw":{"text":"My wife and I went here for our 40th anniversary celebration .  This place is very casual.","useful":0,"cool":0},"2vi7kJRiAvfr58sPGJ4pNQ":{"text":"I'm not sure what all the fuss is about, I suspect that like Emerils restaurants, which ar","useful":0,"cool":0},"iiKBUbG0XZ2nrTdBA9K9qA":{"text":"While in New Orleans, I had to try a John Besh restaurant.  Being one of those weirdos who","useful":1,"cool":1},"4KjDSILtdhsx8GnE4jffwQ":{"text":"Food was delicious, wonderful and light. For three of us, we split a salad and two pizzas ","useful":0,"cool":0},"QEdMB-9c-0oKbMsjFrkNPQ":{"text":"Came in for lunch with colleagues. We ordered the mixed anitpasto which came with a blue c","useful":1,"cool":1},"tUSALB5p2hy6nFOcZ75Hqg":{"text":"Being from New York this place is a joke. I paid 17.00 for a handful of pasta smh. Everyth","useful":0,"cool":0},"4Ne22kyTh1KCQIyCwIclmA":{"text":"I wanted to say that Chef Alon Shaya is an amazing guy! It has taken me a while to respond","useful":0,"cool":1},"-VYYfo6DtJgk7xFjRwiBiw":{"text":"Excellent pizza, atmosphere is totally inviting and the service was the best part. Totally","useful":0,"cool":1},"oPgC1AlmkTUjxsgYMGpcQQ":{"text":"Great inventive pizzas.  I tried both the prosciutto tomato, bufala mozzarella & arugula a","useful":0,"cool":0},"tIc0AhB2nn6VtAMGdjhIgg":{"text":"Although we love this restaurant and come here often, we're pretty thrown off by their rec","useful":1,"cool":0},"A_QHTMea4lB4opG1Ihf0tw":{"text":"Pooh had the lasagna and I had the Eggplant pizza. Both were amazing!\n\nFor starters we had","useful":0,"cool":0},"Hn7ADPhuMIbUIxAhdtrryQ":{"text":"I am in the culinary industry and I was very disappointed by my experience at Domenica. 1s","useful":0,"cool":0},"unHGdm9HB3y582TCLSx8cg":{"text":"Started with the roasted Cauliflower with the whipped feta.. One of the best appetizers I'","useful":1,"cool":0},"llBuI5ULvSyCvRgEQbYTVw":{"text":"Too late did I find this gem of a restaurant...right in the hotel I was staying.  All six ","useful":1,"cool":0},"5v-ZdBWJNNeKdkVA8g-Nfg":{"text":"Service was definitely on point, however, I wasn't that impressed with the food. We tried ","useful":1,"cool":0},"QfanCGwHoyQICTOhT5d0hQ":{"text":"After looking at reviews we decided to try this place. We both are very happy we did. This","useful":0,"cool":0},"9mhthgLtS2lCOLYdi5Legw":{"text":"The happy hour is great. Half price for the best pizza I've ever had. Don't remember the n","useful":1,"cool":0},"_oprLl5X24hRDtpXJlzJ7g":{"text":"This place is really really good. It is crowded so keep that in mind. We had the roasted c","useful":1,"cool":0},"gmrqCUG217CJZBCnHwSyVw":{"text":"5+++ stars for our server, Desmond.  He made the whole dinner excellent!  :)  Here's what ","useful":1,"cool":1},"UAoM8jk9B9aQM6IZOffvzw":{"text":"Make reservations and it'll be worth it!  We had a wait ahead of us, but the delicious coc","useful":0,"cool":0},"Tauuo4OCs7_YFK2ZQWNULg":{"text":"My wife and I ate here recently before attending a performance of \"Lion King\" at the Mahal","useful":0,"cool":0},"rAQZeLpTqxV2PJIrLnzknQ":{"text":"After a few days in NOLA I was over-rouxed and ready for something different. Was ECSTATIC","useful":0,"cool":0},"_Io5TEbj0GtLr77kxeXXMQ":{"text":"Well...after a recommendation and reading these reviews, I took a small group (6 total) to","useful":0,"cool":0},"c48ITkK_9cHtRZcC0WSBsw":{"text":"One of the best meals I've had in a loonnnngggg time!\n\nWe ordered:\nOctopus carpaccio\nClam ","useful":2,"cool":0},"IH5COL4MPSvrJ9Q6mhZpCw":{"text":"Every bite was a pleasure. We started with the arugula and beet salad (me) and duck broth ","useful":0,"cool":0},"f7EGBqaMku56GfmANghByA":{"text":"Yum. \n\nWhen you enter the restaurant, the high ceilings and dark colors and mirrors on the","useful":0,"cool":0},"EVx9ay8yH_xJgBkXlvQm4Q":{"text":"Atmosphere and staff were great. Husband liked his order better than I did mine. He had th","useful":0,"cool":0},"ku9P7SRVcY8yuJSQCpwMfA":{"text":"AMAZINGLY delicious!! Everything was perfect, right from the cocktails to the main course!","useful":0,"cool":0},"uWkbTbanITd4plueKR3BNA":{"text":"I have nothing negative to say about this place. \n\nFirst of all, every time I've been ther","useful":2,"cool":2},"1Tl-gYCW4fQN1r8r--reaA":{"text":"I came to New Orleans for a day with a girlfriend and we stopped in and had a pizza and dr","useful":0,"cool":0},"G_PkcIkVbySviGgD_PeXaw":{"text":"We came in late after a movie and ordered a proscuitto/arugula pizza, a salad, cocktails a","useful":0,"cool":0},"40BY5--YKnuJtY1086Q3Iw":{"text":"Food is not good. I tried the tagliatelle (pasta with rabbit and mushrooms) and another pa","useful":0,"cool":0},"oq6ar23Sbt5Ilr0Cl8Hn7Q":{"text":"HAPPY HOUR!\n\nHalf off wine / beer / pizza.  To make things better, the pizza is arguably t","useful":0,"cool":0},"YxKoR9W-zqePxMltcOYHng":{"text":"Brought my wife here for a lunch date. Ordered the Tutto Carne and Clam pizza. Our waitres","useful":0,"cool":0},"w_bxh4jOEvbLOsHhsN_fpw":{"text":"Being a lover of August and Luke, I couldn't wait to try Chef John Besh's new eatery, Dome","useful":4,"cool":3},"nGh-8wSyIB_fb7-ccecMnQ":{"text":"I sat in one of the bar tables during their pretty fabulous happy hour, which they do 7 da","useful":0,"cool":0},"wyji-XNv2BXUMTCwsvm3aw":{"text":"I ordered the lamb shank for $30 and my companion the red snapper.  We waited 20 mins to o","useful":0,"cool":0},"WjYvPVW_5fisy2oeTgZIyQ":{"text":"What can i say but the food was terrible.  I went here because it was in my hotel and I sa","useful":0,"cool":0},"M7ONIsbto_vHUamRWYoAWw":{"text":"Amazing spot. Visiting from LA and had to go to a John Besh spot.  Food was amazing. White","useful":0,"cool":0},"VCsHbMZz5zgHdxxHUkxTvQ":{"text":"Love the prosciutto pizza! Fantastic artisan thin crust. Even have pizza happy hour specia","useful":0,"cool":0},"_5_ZPNpz5t8g7gUqEUeaoQ":{"text":"The review is for Domenica's happy hour (3-6 pm everyday), which is such a steal! Half off","useful":0,"cool":0},"ANO3Alo6JtSE2YtZ5tAs2g":{"text":"Pretty much can't get better than this! \n\nWe started off with a salad each - Watermelon sa","useful":0,"cool":0},"niTk5Uu5liJ7twgXn7uaHg":{"text":"As good as it gets.  What a delightful restaurant situated in the Roosevelt Hotel and just","useful":0,"cool":0},"dEaJA1nf7zdkB-9AFHZweg":{"text":"We loved the rabbit tagliatelle - soft,moist rabbit with delicate tagliatelle in a perfect","useful":1,"cool":0},"8ms0EPgrCx6G_Oa5m9_KkQ":{"text":"So amazing, I went there twice in one week! I first went for lunch, and grabbed the delici","useful":4,"cool":2},"K47dNsfLnJwHRCLNzgXVWQ":{"text":"We started off with the chanterelle mushrooms, which was served on a toasted ciabatta with","useful":0,"cool":0},"jC7OR2FdsW_gT3lq-0qJoA":{"text":"The service was impeccable. Great Caesar salad.  The lasagna was really good. The drinks w","useful":1,"cool":0},"Af5tnEOvIEf7O9iiPKufwQ":{"text":"My husband and I live in New Orleans, and are in our late 60's and 70's.  We rarely eat ou","useful":2,"cool":0},"ZR6vvFu7SmPO1td17hiUKg":{"text":"I love this place! This is our go-to restaurant when out of town guests are visiting. Ther","useful":2,"cool":0},"3N6zsw1sndnIjZaKMK8Wiw":{"text":"While they do have gluten free pasta, I got so sick about 30 minutes after I left with a m","useful":0,"cool":0},"w6mDaiU4hhjSTqx_d24XpQ":{"text":"Two words: HAPPY HOUR!  Domenica has an amazing happy hour offering half off of pizza, bee","useful":4,"cool":3},"wbJzGPO33D3gEoIfOmENMQ":{"text":"Eh. It was just okay. My margherita pizza wasn't very hot. None of the pizzas at our table","useful":0,"cool":0},"kgEB3SrokZd3GGzh84wNqw":{"text":"This restaurant is simply the best of the best. Must try the fried Tuscan kale,delicious. ","useful":0,"cool":0},"BRjAm1laD4kHt2v04txfNw":{"text":"Great service, even though we came in half hour before close no one rushed us and our wait","useful":1,"cool":0},"apYikYCUtq4fuM_8ui3bjQ":{"text":"Went here for lunch. Place was fairly empty and they just had to sit a large rowdy family ","useful":0,"cool":0},"oU6r2ZNMzcJJ8jeMvmDODg":{"text":"So yummy!!\nWas in NOLA for 3 months, and this restaurant far surpassed my expectations. Fr","useful":0,"cool":0},"-gKaWox7Rl1V69jjqiuLwA":{"text":"Soo good!! One of my favorite places to eat at in the city. Staff is always very nice. Gre","useful":0,"cool":0},"ECFt0TvxAUhMWAx8h3CMFQ":{"text":"I ordered the roasted carrot and brussels sprout pizza, thinking that it would be a pizza ","useful":0,"cool":0},"AB5EaqEWYaC3XSTlo7UMcQ":{"text":"Pizzas are good and we'll priced. Blu del moncenisio good cheese choice. Desserts small bu","useful":0,"cool":0},"jBNX6wYu4xkOuHGGbFqY9Q":{"text":"We stumbled upon this gem on a Saturday night. The wait was 45mins for the table but so wo","useful":0,"cool":0},"GMLDRfIXwoTDfpHtr55tcg":{"text":"We had a great dinner here! Thanks to the fresh food, creative menu, and prompt service.  ","useful":0,"cool":0},"4__PQbfD8_sQxYIjXL5v3A":{"text":"Chef John Besh's pizza restaurant. The oven is imported from Italy. Amazing wine selection","useful":0,"cool":0},"EoGB3RzmXbHh_GVbpg7R8A":{"text":"Excellent food. We had the roasted cauliflower head with whipped goat and feta cheese: div","useful":0,"cool":0},"8aITCtVsLs0sim70vNGb9g":{"text":"Fabulous find in New Orleans! I can't say enough great things about this place! The servic","useful":0,"cool":0},"AfpCSf60CMdHhPFwCwbUuQ":{"text":"Excellent food. Oysters Rockefeller were great. Had soft shell shrimp for the first time, ","useful":0,"cool":0},"FTtxogRpUAMxui04GufK5A":{"text":"We decided for pizza and found this place- not sorry.  There are several other items on th","useful":0,"cool":0},"Tysr0OLaw6s3V-FFnh35AA":{"text":"My boyfriend and I decided to go there at random while in town. We had no reservation and ","useful":0,"cool":0},"BxBPD4lz5zOD9zL_5xd7Kw":{"text":"Was in N'awlins for 3 nights - besides the meal at the convention center, I've dined here ","useful":0,"cool":0},"Pha3XUEe8Em0x_ueQvQf-A":{"text":"Great atmosphere and the service caused the 4 stars.\n\nGroup dinner sat on time with a few ","useful":1,"cool":0},"sg1HklEXy8JPZsjzwkzvwg":{"text":"While in New Orleans, Louisiana for a trade show with some work colleagues, I searched onl","useful":1,"cool":0},"BOQRpn2favu-gX2GjswQnQ":{"text":"Ladies and gentlemen, I have finally found a true Italian restaurant in New Orleans. Thoug","useful":1,"cool":0},"RvxXxlpczTFwkmXpon1Mgw":{"text":"Great happy hour. Great staff. Friendly and informative. Sat at the bar and had a margheri","useful":0,"cool":0},"d36acsokfVATElPYhuRqWg":{"text":"Best food/ drink combo happy hour in the city - hands down! There is a wonderful and excit","useful":0,"cool":0},"nLIYR6jE7RqU1Ocej1T3GQ":{"text":"Fantastic dining experience, the food and cocktails were terrific. Almost as impressive as","useful":0,"cool":0},"yz1svI4F_EQk4kirYqhP1g":{"text":"This is the best happy hour in the city! If you've never been, make sure that you head ove","useful":0,"cool":0},"RFy0QfqBQQrF77KdmZRS9A":{"text":"This is one on a huge list I wanted to scratc off on this visit. We went in thinking maybe","useful":0,"cool":0},"LN1yU2vx_zo1GAQAG9DK-Q":{"text":"Overall this is a wonderful restaurant! I've had two experiences here very recently, but t","useful":17,"cool":14},"7xH6d2HUi6IcTzwrTHLYSA":{"text":"Saw 4 star reviews and had to go. Disappointed with most of the food. Either needed salt o","useful":0,"cool":0},"PUsnYqxtHBNiQqqzUcu4YQ":{"text":"WOW. Great meal. My friends and I came here (after leaving another restaurant because of b","useful":0,"cool":0},"dX5nwSSO30JZB-HuVsSXZw":{"text":"Servers were fantastic\n\nWine list very good, but really only featured italian wines...but ","useful":0,"cool":0},"_MgaLvy0jlJQEhaGDf6fcQ":{"text":"Food was great. Service was better. Sam did it right.","useful":0,"cool":0},"PK-6s4xpSl5PC84E89uF-w":{"text":"Great experience at Domenica. I highly suggest the Roasted Cauliflower and the Kale as app","useful":0,"cool":1},"2Wndz35x9Pv3Vx3Dz1TUmA":{"text":"Okay how can you go wrong with their happy hour? Half off wine, beer, and bellinis, and th","useful":0,"cool":0},"FBtNFEXtF8wuYrKxbdDp7A":{"text":"Given all the other amazing restaurants in New Orleans, I can't describe this one as anyth","useful":1,"cool":1},"KHTmWZchs7dM4FZXbcTeyQ":{"text":"Awesome happy hour! Half off wine and beers, and they have a few $5-7 small plates to choo","useful":0,"cool":0},"uAD4M_sBnXZP8yjzuECcaw":{"text":"Domenica is another great, beautiful restaurant by John Besh. \n\nI've only visited for lunc","useful":0,"cool":0},"XHl4JVEXIzznf1V4_Gt4Qg":{"text":"We made a reservation for dinner while staying at The Roosevelt. \n\nThe place is stylish bu","useful":0,"cool":0},"Hd2RUL2gmFTihgA-qVUu9A":{"text":"By far the best happy hour in town! You cannot go wrong with the daily happy hour of half ","useful":0,"cool":0},"-YtJ4G4RBRsNepSxcg2VYg":{"text":"Luckily we made reservations because this place was packed. Graduation season plus Mother'","useful":2,"cool":1},"1t7rVSYTHkCzutFxkNcs4w":{"text":"The place is really good and the waitresses are extremely nice. But the best is the food. ","useful":0,"cool":0},"yuRO8pKT9Tp5UCFPDnFRgQ":{"text":"This place was perfect.  I read about it as one of the top 5 pizza places (by Thrillist.co","useful":0,"cool":0},"kuHke7wYYJlEe0zLHpWR1Q":{"text":"I have to say, we had lunch here yesterday and the food was very very good. The service wa","useful":0,"cool":0},"afatBsxQ1s3m1zIM9W1Ogw":{"text":"Very delicious pizza! Had a margherita and a margherita with sausage. Good deal during hap","useful":0,"cool":0},"p_fhlMKaEhjcK3_c_RAhlw":{"text":"Any time you get an opportunity to dine at a restaurant whose Executive Chef is a James Be","useful":2,"cool":0},"B8NK_JS4QhW7lWE35TpxbA":{"text":"Feels like a swanky restaurant in Manhattan.  Dim light, metal, glass, black walls. Defini","useful":6,"cool":2},"k-oTzh37Iq_oiWFujcLvEw":{"text":"This place is the epitome of a tasty home-made pizza joint .\n\nThe food was some of the bes","useful":1,"cool":0},"X0NG0xyzAP0oXpbzCxLCMA":{"text":"Our group had a fantastic evening at Domenica, located in the beautiful Roosevelt Hotel (v","useful":0,"cool":0},"unSTYVvfTWvPD1yGO67H2g":{"text":"Domenica's happy hour alone stands to receive 5 stars. Located in the Roosevelt Hotel with","useful":2,"cool":0},"ZWv2gl8ilLNoCJ36w7tZgQ":{"text":"As a season ticket holder for the Saenger Theatre across the street, this is my go-to plac","useful":0,"cool":0},"EVzyOa2iZFbmuJeYRVpupw":{"text":"Somehow I've never reviewed Domenica despite eating there many, many times.  All the food ","useful":5,"cool":1},"9JHTGPl6zJLJsVn8uwfb7A":{"text":"Amazing!!!! The lasagna was to die for! Also, the service was really goood!! Also, the bel","useful":0,"cool":0},"5tGhloMu3ohfL41T5rkvXg":{"text":"Expensive and lame italian food.  Service was terrible with the waitress knowing little to","useful":0,"cool":0},"s2Xt1YX9dyEt3hLYdCAQmQ":{"text":"Four of us dropped in for happy hour after marching in a parade so we were hungry and thir","useful":1,"cool":0},"uKXJPB34-sPaIjZuJ-3Vcg":{"text":"If you are planning on going to Domenica's ? \n\nMake sure Gerard is waiting on you ! \nThe m","useful":0,"cool":0},"xURV2FEvIWEt4FOHJANxZQ":{"text":"Squid ink pasta and crab was sensational.  So was the dirty rissoto.  Even the seasoned ol","useful":0,"cool":0},"0E1yTVTmpLOb3ZlYjJAzDA":{"text":"Tremendous pizza. Crust is the best I've ever had--crispy exterior yet supple and soft int","useful":0,"cool":0},"mIR3MttPrhu4s2G5FhEeCA":{"text":"My only complaint was that we arrived early and the hostess asked us if we wanted to have ","useful":0,"cool":0},"Q6NCqZN3RLDT0bdbwjbGAw":{"text":"Everything is delicious! We recommend the Octopus Carpaccio, the Roasted cauliflower and t","useful":0,"cool":0},"tkOT9vlCAJwnS4_89Be-Zw":{"text":"I read about Domenica on a list of best happy hour deals in the city and decided to try it","useful":0,"cool":0},"mdeha5jdKy9a2UTy2HPtGg":{"text":"Awsome pizza.  Awsome squid ink pasta.  Awsome roasted cauliflower.  The cauliflower was s","useful":0,"cool":0},"HoqtHzK8kQJV9PFmEG3JvA":{"text":"Ok, the location is pretty cool being in the historic Roosevelt Hotel.  The atmosphere is ","useful":0,"cool":0},"PFde7zhdMaJ72TSyLNw8CQ":{"text":"Past 3 visits have been horrible. \n\nTerrible service:\nI waited over 15 minutes with no ack","useful":3,"cool":0},"g3punkAoZnYkF9ZdBmiDLw":{"text":"Almost 5 stars. \n\nYou wont find \"red gravy\" at this Italian restaurant. The menu is beauti","useful":1,"cool":0},"KiyoaUE3KSgkcjpFhdC_RQ":{"text":"Stopped for the happy hour special on Saturday during Southern Decadence. Ordered two pizz","useful":0,"cool":0},"JSrQq2lAuluGWLV3vYdrdA":{"text":"We are locals but were staying for a few days at The Roosevelt Hotel.  Domenica was the fi","useful":0,"cool":0},"Xn7vUXF5ms45EdIhQkLlwg":{"text":"My favorite thing here, along with many others, was the roasted cauliflower. It's roasted ","useful":1,"cool":1},"hLMKkPaUndr3jDSP9SmRlA":{"text":"Stir clear very over priced absolutely terrible service. A 1 star is being generous.  Mana","useful":0,"cool":0},"TmVtwRVgdVqRAVocpGQ8HA":{"text":"Went to this place finally after hearing about it from lots of friends.  Was a dinner date","useful":2,"cool":2},"4N8FginD0k7GKy-56t2lWw":{"text":"Went for pizza, never going any where else. OMG! simply the most amazing pizza ever! And I","useful":1,"cool":1},"o9ROORf3BNJah6IehoMhTQ":{"text":"The lunch happy hour is always legit! $5 buffalo trace old fashioned and half off any wine","useful":0,"cool":0},"m2bjQGEab7v7zKzOOfdShw":{"text":"Had the prosciutto pizza for 15 with my wife. Just a light bite to eat.  Could of spent a ","useful":0,"cool":0},"hyJo_srIG4bGObbLMV2h-w":{"text":"Great food, love the industrial designs of the restaurant.  Good host, she was friendly an","useful":0,"cool":0},"DQWbsJsC5xqRRV3pnQumaQ":{"text":"Our first experience there and it was a hit. Nice setting, Good ambiance.\n\n The Menu is as","useful":1,"cool":1},"n8RIYas1GANHFPEcxDzdCA":{"text":"Went to Dominica on Christmas Day. They were absolutely terrific at handling my severe Cel","useful":0,"cool":0},"XRlB5Rp9bWKtPPr08Q7MrQ":{"text":"One of the best places to eat in the city!  Highly recommend the pizzas and squid ink past","useful":0,"cool":0},"4fdbdOKZfm7DA04iUoMA-w":{"text":"We went here to celebrate our last night in town with our daughter who had just graduated.","useful":0,"cool":0},"3ewrrCSv54vNsVyRUk_Xsw":{"text":"This was our second time at Domenica in one month so that speaks for itself.  Once again e","useful":1,"cool":0},"7K57t_-54O-_C5XLc-sPdQ":{"text":"Excellent blending of food types and culture. However, inattentive table service and long ","useful":0,"cool":0},"tQOGxHtdA_BAjMCeR11_LA":{"text":"This is the best restaurant I have ever been to.  I had heard that the pizza was fabulous ","useful":0,"cool":0},"tfj8DzNqX1wZE4bRWE3hlA":{"text":"John Besh and his amazing team of Executive Chef's have been pushing the NOLA food seem fo","useful":2,"cool":0},"btJeYWHhUsyBcV9VH3LzgA":{"text":"NO brings out my highest expectations- not sure I could give anything a 5.  We had a great","useful":0,"cool":0},"fTyHl-9KHFTsAMyjsxA_9g":{"text":"Still good pizza, but we arrived and were shocked to see the place empty and only a few ta","useful":1,"cool":0},"qsLYqYEBIRcPQD-MUkiRHw":{"text":"I came to Domenica's for my birthday and glad I did. I love Italian food so I wanted to se","useful":2,"cool":1},"sPy5hebTgp5ilkwx_3Yljg":{"text":"Service was beyond fabulous and our waiter Jobi was so attentive.  The place was packed an","useful":0,"cool":0},"fvvCNRMIJH26oS90iiCErg":{"text":"Roasted cauliflower with a feta cream sauce, yes please! And I used the bread on the table","useful":2,"cool":0},"C9ML2KjE6TdUxM6NxUtdRQ":{"text":"We live next door. We eat at this restaurant regularly and it's always amazing! Any of the","useful":0,"cool":1},"oSqTugaSriMveiYP8p_uQw":{"text":"Really?  A restaurant owned by one of the signature chefs from New Orleans and the food wa","useful":0,"cool":0},"wOAHuUvlk5tKjTihKl-ntw":{"text":"First visit and it didn't disappoint! We had the cauliflower (yes it's a whole head) and i","useful":0,"cool":0},"ODkb3UcCRXJ6OSDdaIoIEQ":{"text":"Damn yummy.   Go for the happy hour - daily from 2-5.  Half off pizzas and half off beer, ","useful":1,"cool":0},"202EwNyeKk2dT0hSS4qjZg":{"text":"AMAZING! I had my rehearsal dinner here, and it was an amazing experience. The private din","useful":0,"cool":0},"AqiDQJiHOVg4RZvY0qMgiw":{"text":"When my friend told me about a happy hour for pizza I was like, \"Okay, I'm in\" but I wasn'","useful":0,"cool":0},"-kCA1Rzh3WFb7PdhjPxZgA":{"text":"Oh my goodness! Domenica is awesome. Super great service (very friendly, prompt, and infor","useful":3,"cool":1},"8M25T0W6O_8NFGZcHEsypA":{"text":"I have ate at Domenica for dinner maybe twice. I can't complain, the food is top notch. Ho","useful":0,"cool":1},"bs3Igp-qfJz-PtgXlxk98g":{"text":"We had a wonderful meal last night at Domenica. The restaurant was packed when we arrived ","useful":6,"cool":2},"pZDvRkAqoAmpsGbGESpmTQ":{"text":"I think I will be one of the minorities here but  oh well! I went to Domenica during All-S","useful":3,"cool":0},"CrNwa5LCLhJuhWJ_lNIWmA":{"text":"Found Domenica's on yelp and since it was close to the hotel decided to try it out. Walked","useful":0,"cool":0},"HVlwMoVVfivm6LjM2SLcPA":{"text":"Come here! NO, RUN HERE! But make a reservation first on open table. They are amazing!! I ","useful":0,"cool":0},"5YiBizlBgDUqzv6Gc_HhQQ":{"text":"Those aware of my entrenched, borderline  pedantic Italophilia will understand that I am g","useful":1,"cool":0},"g0ildrpHsJM05M7-NZQ44A":{"text":"The focaccia bread and olive oil was a great start! I'm a bread fanatic and this was about","useful":0,"cool":0},"75-06Hc9jGBR7hDZRC4-Eg":{"text":"Once again Yelp led us to an excellent restaurant. Last night we enjoyed a very good dinne","useful":0,"cool":0},"7l8lQE8ruuCtcgKjTmj0Vw":{"text":"Domenica has been a favorite of ours for several years but was a major let down tonight. L","useful":1,"cool":0},"VTJVJxy59L1cSmM3sMui8Q":{"text":"Ordered chicken confit to go...it was way over priced, looked like crap and didn't taste v","useful":0,"cool":0},"D2Jcjz442pQa7op6he7Tzw":{"text":"The food was good, but the service was horrendous! Dropped a squash blossom on the floor, ","useful":0,"cool":0},"zIDKLGfqi6iMAt-o0YIynQ":{"text":"Well known, upscale restaurant in the French Quarter.  Adjacent to the Roosevelt Hotel, wh","useful":0,"cool":0},"3mGazu_4lAoTsnFxytF5zQ":{"text":"The lasagna is awful..do not waste your time.  My husband had the rabbit dish and it was s","useful":0,"cool":0},"IkS3G_6Ox4eg_6Mv2xBK3g":{"text":"Gotta Love the BESH happy hour!!!!   3-6p\n\nThe pizza is great and always impresses!!!!!!!!","useful":5,"cool":1},"1AK5APiUJjdzHNaymNFcrg":{"text":"Made a reservation, and was seated immediately. The service was good, but the food was jus","useful":0,"cool":0},"8wwroe9LdpDbJG4JWhnGIA":{"text":"When we researched this place, it came up as a great place for pizza. It is a fancy restau","useful":0,"cool":0},"LVixLg_yxRGl13Itgzwdkw":{"text":"Pretty good crowd.  The environment is good. Service is great!  Food came out pretty fast.","useful":1,"cool":0},"aEcGGIuH5va7gRcLUfLniw":{"text":"This place had good pizza and a great wine selection for happy hour!  It's near the French","useful":0,"cool":0},"mMWIuIBNWCBDyEHfojE1Ag":{"text":"Though we missed the happy hour, our dinner at Domenica was one of the better ones of our ","useful":0,"cool":0},"2Ao0-s4wnTU03ZunHqfClw":{"text":"Our second food stop on our New Orleans visit and the beginning of our John Besh stalking ","useful":0,"cool":0},"_mcaQgetndDWGCnWgHP_og":{"text":"i love it here!!never disappoints!! chefs are very accommodating to food restrictions! i a","useful":0,"cool":0},"9nikp3F0xPnxckHL6rslEA":{"text":"My husband and I had a delicious meal here! We ordered an appetizer and a pizza as an appe","useful":1,"cool":0},"TxBExhJwBn512K94QgkZHQ":{"text":"Food was fantastic, great looking restaurant. Service on the other hand... Let's just say ","useful":0,"cool":0},"Tz1T-MOudO7A1U1Tz1f8eA":{"text":"They get five stars for the Happy Hour. As others have noted, you may never come across be","useful":2,"cool":0},"OLnlJmc1HmSz18B-ioY_Xg":{"text":"Loved the atmosphere and decor,  amazing service and friendly staff.  Great delicious food","useful":0,"cool":0},"yUnEBm5E9AxQjlMTmCHJng":{"text":"Picked this place because it was attached to the Roosevelt Hotel where we were staying, an","useful":0,"cool":0},"LEO39JUd2661Cee5wQc2TA":{"text":"Overall I found Domenica to be a dissapointment....although I'm willing to offer it a seco","useful":1,"cool":0},"BE9INLGNPnXrerMDuGS-tA":{"text":"I didn't even know who John Besh was before I went to New Orleans--then I fell madly in lo","useful":1,"cool":0},"LZWyd4tTBaIOw2FW7N8w0A":{"text":"The restaurant is in a nice location. The service was great from the time we walked in unt","useful":0,"cool":0},"nV80MHl54n98R9U-4Pc04Q":{"text":"If I would have known how cute this place was I would have made a dinner reservation here,","useful":0,"cool":0},"POg7Rws_kV3_H1I7EGu9sQ":{"text":"Ridiculously good Happy Hour 3-6pm every day\n\nJohn Besh restaurant\nNice location in the Ro","useful":0,"cool":0},"JZKhklN0Ycivgm-P-12v0A":{"text":"Great dinner for a last night in Nola. Speedy service and good food; had tried every south","useful":0,"cool":0},"HqKoHDru3_bdpMReMZs9ew":{"text":"Happy Hour=Amazing\n\nAwesome Pizza (even by NY standards) Great value for $$. Great service","useful":1,"cool":0},"-6AjXJIUlbGSUohUzg9-iA":{"text":"I love this place! They have pizza take out that's delivered by bicycle! Pizza only though","useful":0,"cool":0},"M9rS9NIwzhfoB0Ti696lLQ":{"text":"I had the pasta with shrimp, crab butter, sea urchin, and lemon. It was one of the best th","useful":1,"cool":1},"zOR3HxkYVxoRqQ_-xh60Sw":{"text":"I had been planning to visit Domenica for months, so I was extremely underwhelmed as I beg","useful":0,"cool":0},"gJ7dWOA5IROtjMo-3MkNOQ":{"text":"It is definitely a loud restaurant, but the ambiance is great.  We weren't starving, so we","useful":0,"cool":0},"_L0W4aV6_CJZ-JEacFbWyQ":{"text":"I can't speak much to Domenica, since I ordered a pizza to go, and ate it in my room. The ","useful":0,"cool":0},"c6OgONW8GXtMObzHuUBFnw":{"text":"seeing Chef John Besh's face splattered all over Nola, it's nearly impossible not to go to","useful":1,"cool":1},"pVGwHIuiboOFmHJ_i58GtA":{"text":"Had another good meal here recently with a friend as dined at Domenica last Sunday. \n\nWhat","useful":2,"cool":3},"s-vesgnpguKQw8qfwz1RKg":{"text":"We went here on a recommendation. Really well-done, simple Italian dishes. We had the oyst","useful":0,"cool":0},"uu2bpgwYmmHMC6MayUK8aw":{"text":"Our party of six had reservations at 11:45am on Christmas Day.  Overall the quality of the","useful":0,"cool":0},"sVChxRvfHZtirGW1XCf6xA":{"text":"One of the top pizzas in town. Half off pizza and beer/wine until 5pm Thin crispy crust, f","useful":2,"cool":0},"4Jq2P7CO7fP1fXMii97FVg":{"text":"With Domenica being located in the historic Roosevelt Hotel, before even stepping foot ins","useful":0,"cool":0},"cJgv79G_NNbv5qQgbSFcTQ":{"text":"I was surprised given the great reviews to have had a not so great experience. They were b","useful":0,"cool":0},"SiI5Q7ncXdpbiuhs_WY9lA":{"text":"Great pizza and meatballs. Sorry but it was so good it was GONE before I could post it!! \n","useful":0,"cool":0},"nPbhb6gkt9gxeJpTKB-vug":{"text":"First, I want to say the rating should not reflect the food, but the staff and environment","useful":0,"cool":0},"QE_NWi6lyuaj1UY7Z0ONZg":{"text":"Can't speak for entire menu, but if pizza during Happy Hour is any indication, this place ","useful":0,"cool":0},"ACHfie9CMqyksh3ClHDGnA":{"text":"This place was pretty good. Got the Bucatini and it was super good! My friends got some ki","useful":0,"cool":0},"jvf_gU6aoWtpseSu3_SF8w":{"text":"The cauliflower appetizer is awesome! Everything we ate was actually delicious! We all ord","useful":0,"cool":0},"A9op6h4azLuUrKqHn1r1Hg":{"text":"My husband and I came here for their Reveillon dinner for Xmas day. Very lively scene.  Hi","useful":0,"cool":0},"7cOiIdH8vBsL0SAe7x4jUg":{"text":"I ordered a pizza online the other night.  The online order feature is really convenient. ","useful":1,"cool":1},"iw8D50jW2E8NFcnk5NSdsg":{"text":"Our group really liked tha clam pizza and the roasted cauliflower appetizer. Less successf","useful":0,"cool":0},"l0uORgz2pbOoFhTmToZ-AA":{"text":"Honestly, I'm not a fan of John Besh's restaurants, but I've never had less than a four st","useful":1,"cool":0},"rtvdq_Mmeln0kDfYtwdfIA":{"text":"Overall, I am very disappointed. \n\nMy husband and I went to Domenica on a Sunday evening a","useful":1,"cool":1},"SwpiBzkQj1osnay1f6tIDg":{"text":"Beautiful restaurant with fantastic Italian food.  Tried a little bit of everything and di","useful":0,"cool":0},"iXik68Z0wOGM-wJqNomS6A":{"text":"I am in love with Domenica. I've only been a few times, but I've never been disappointed. ","useful":2,"cool":0},"AeTF_rTk9v-wTHeHAH1CDQ":{"text":"Wow. Domenica had been on my list of places to try for years and I am so excited I finally","useful":10,"cool":8},"WuzVE21-KjZrbzi7wXuj8g":{"text":"Terrific upscale Italian just off Canal Street. Excellent food and great service. Would de","useful":0,"cool":0},"gqp6ISd77NghtRd82R-LHA":{"text":"Check your credit card statement!!!\n\nWent in this past weekend and split the bill equally ","useful":0,"cool":0},"cs471v1THBNAL1tN5ppGqA":{"text":"my first yelp review ever: domenica blew us away. squid ink pasta with crab, goat with tom","useful":0,"cool":0},"6ufncCQajZoj-VTic6viBA":{"text":"Got the kale, rigatoni, cauliflower and the hazelnut pudding. Everything was amazing. The ","useful":0,"cool":1},"8FhoTV1f5MkXk22hoQbnvw":{"text":"This John Besh restaurant is all about the Pizza.  We tried several tapas size dishes incl","useful":0,"cool":0},"W7llpoiOvCHMEJ1hVEOcWQ":{"text":"I had truly a wonderful experience at Domenica. After our NYE dinner plans fell through I ","useful":0,"cool":1},"1CT3-2N7RwDP2s_asvhENw":{"text":"Celebrated my birthday here this evening with my mother and sister and had a fabulous expe","useful":0,"cool":0},"Nm_UCuJcTtTu6UBwY6NSfw":{"text":"Arugala with beets and pistachios was great. Octupus carpaccio was yummy. Lasagna was tast","useful":0,"cool":0},"1F3HZOiKmwtk-J-DXo2vLA":{"text":"We LOVED this place. It is located in the Roosevelt Hotel and can be entered from the hote","useful":0,"cool":0},"bqiiyrdq5TFThgRrtj8GYQ":{"text":"Mushroom pizza. Dude so good. The mushrooms weren't those unsubstantial baby white/brown o","useful":0,"cool":0},"lYZoAKoHmIPyhUPfYBh9wQ":{"text":"After spending 5 nights of wonderful dining in Nola this was our only disappointment  the ","useful":0,"cool":0},"8cfiz909_4S_rKSD6HEVbg":{"text":"The pizza is awesome, delivery in the CBD is so clutch. I'd recommend the garlic and clams","useful":0,"cool":1},"B_eG9ABNuAq7yT5_Vrph5w":{"text":"We came here last night for dinner - our food came out not super hot and we told our waite","useful":0,"cool":0},"8W2YkWEUKGDl93M7T4DB7Q":{"text":"Came here the other day for lunch.\n\nNo complaints.  Had wine (Pinot Grigio, or however you","useful":2,"cool":2},"VbS0CcJ1WYje19lpr719BQ":{"text":"This was a great dining experience.  In fact, we ate there twice at our last stay in NOLA.","useful":0,"cool":0},"53bgUEt-JymVBMYzZF-VRw":{"text":"Domenica is one of those places where what you order is going to determine what kind of ex","useful":3,"cool":4},"i1Y67-froyofEYaGA085mw":{"text":"I hate to be a debbie downer, but...\n\nIt's way too loud in here. I could barely hear the p","useful":2,"cool":0},"YWSX8olvo0Om2pJdgjNOgw":{"text":"Every time I've visited Domenica (3 times so far), I've said \"that was the best ___ I've e","useful":0,"cool":0},"fHsKyCkVOjVzqbW_IVF8fg":{"text":"\"OH MY GOD.\" I think I said that at least hundred times while dining at Domenica. The pizz","useful":0,"cool":0},"DxAahVxyZ5YgnxaOV2U-rQ":{"text":"Out of every place we went to while visiting NOLA this place was the inexpensive most hosp","useful":0,"cool":1},"8-qv2Yi0FkzpuA_BdU8k9g":{"text":"I love Domenica. The pizza with a fried egg on it sounds weird but is soo good. The small ","useful":0,"cool":0},"3S6fFSJc0FyjZEjSjHkPDg":{"text":"Great place to stop by during happy hour, when basic drinks and their pizzas are half pric","useful":1,"cool":0},"0h4BcD6EV2eEBeT7xOA1uA":{"text":"Wow, what a disappointing experience. While the space is beautiful with high ceilings and ","useful":2,"cool":1},"VlCxzmENQbcULGKHbxObcQ":{"text":"Such a delightful lunch! We each ordered a pasta (squid ink, tagliatelle, and bucatini), a","useful":0,"cool":0},"-e4RDr-eZIMKEahV2RHsZg":{"text":"Half price beer, wine, wells, and pizza during happy hour!\n\nIt gets crowded though. We had","useful":1,"cool":0},"iH8xJFtnEIIuGbEk0YEC7w":{"text":"When you say no to excellent Italian food you say no to life!  Crazy Bernie and Tammy The ","useful":0,"cool":0},"m3udb4Y4Y4nY5fX-0O_bew":{"text":"What's the best way to describe how good this place is?  I think the fact that I spent thr","useful":1,"cool":1},"EgAUIq6A5gWfpAaM4cu_Rw":{"text":"My wife and I shared the Affettati Misti for an early dinner, which was excellent and left","useful":0,"cool":0},"gkj7v7UatgnNwpzoo9rNSw":{"text":"PIZZA!!! This New Yorker does not eat pizza outside of the city (normally).  However, Dome","useful":0,"cool":0},"8ROFqg-PRSxet-Z_gb4EBQ":{"text":"LOVE this restaurant. While the food in New Orleans is the unhealthiest I've seen, if I'm ","useful":0,"cool":0},"tzXJG4vitgxFIt5G5s8M6w":{"text":"GORGEOUS place, awesome happy hour deals, and the bellinis.... Definitely will be back!!","useful":0,"cool":0},"jHuBwIDsXmFX99XnHK8DoQ":{"text":"I wanted a quick dinner at a restaurant close to my hotel. When I saw Domenica, I worried ","useful":1,"cool":0},"6LHbkffbBX63InV62rdQfw":{"text":"Awesome spot in the beautiful Roosevelt Hotel. The roasted cauliflower is a thing to behol","useful":1,"cool":0},"ILHeiHFvZjIHEGZNEsZEEQ":{"text":"Squid ink tagliolini and wild mush room pizza were both amazing.","useful":0,"cool":0},"HHKFlaCzx6O2vrHUEPTbCQ":{"text":"Had a great date with the beau here. The wild mushroom pizza with farm  egg rivals Antico'","useful":0,"cool":0},"abTEstQ62AbPqgHDD3lZ0g":{"text":"I think the is a fine restaurant, but I would hesitate to call it awesome. The food was go","useful":0,"cool":0},"T4bqmTtvWZ0joSbSsVQR5w":{"text":"Excellent food.  Service overall was great, but our specific server was not that well vers","useful":0,"cool":0},"7o_Dl1485RV1DawxnrwQ6g":{"text":"Holy crap. I came here for a bachelorette party so we had the back room reserved. This pla","useful":0,"cool":0},"DSMWy85ZxKrCSdcaEFOpNg":{"text":"Located in the lovely Roosevelt Hotel, Domenica has the BEST happy hour special. Everyday ","useful":0,"cool":0},"FGWz5H6kNIVFTQxu5_oX8Q":{"text":"Awesome pizza and service!  We ordered 3 different pizzas and loved them all.  Very fresh,","useful":0,"cool":0},"Rdd2lwZlSGZsZt7wfC2Jug":{"text":"Service was great and friendly; recommended cocktail was very yummy, but cost as much as t","useful":0,"cool":0},"PWJMo-LO5-1GSU6qoHsnwQ":{"text":"Myself and a coworker went to lunch at Domenica today, and it was phenomenal. We couldn't ","useful":0,"cool":0},"DLJQGkGXKh2bFe6NEtaBOg":{"text":"After months in NOLA I finally tried this place. The food is amazing but a little over pri","useful":1,"cool":1},"J3lJHtC59A88MpnZz3gdkw":{"text":"Wow. Crispy kale, whipped feta, authentic oven fired pizza, roasted cauliflower, fish, des","useful":1,"cool":0},"5Ogcd-K-eQ5646mflS1QPw":{"text":"I hate this update and giving it a 3-star.  I had gone to Domenica last year and loved eve","useful":0,"cool":0},"0O4IjOHJCZLAcWsDKCa0qA":{"text":"The dinner began with one of my favorite items, a plate of sweetbreads. They were deliciou","useful":1,"cool":0},"kW_sibq-BhMN6-CDmRus2A":{"text":"Alon Shaya, nominee for best chef in the south, for 2012 James Beard Foundation Awards, is","useful":1,"cool":1},"fTSySs4N39XE2QNAKko52Q":{"text":"Amazing food and great wine list. The roasted cauliflower was incredible and we got three ","useful":0,"cool":0},"14TSdvf4UQJqyWuriG7gwQ":{"text":"My go-to pizza and happy hour spot.\nNever disappoints! \nFabulous service every single time","useful":1,"cool":0},"udViOCUoVwJD82EwtGHrKg":{"text":"This spot is hands down my new fave pizza spot! Since my first visit during Mardi Gras thi","useful":4,"cool":4},"4ifhociMj7NRNSm1LsAanQ":{"text":"Really good and spicy Olive oil with the bread started the experience off well. Pizza came","useful":0,"cool":0},"STrTyer07EOVb9Uu-VX_Dg":{"text":"This place was located not far from where we were staying. So craving Italian on a Thursda","useful":0,"cool":0},"8NzxjAZiXHkdnP8wcuPHww":{"text":"We went here for dinner one night in New Orleans when we wanted something other than cajun","useful":0,"cool":0},"0q4G3A7j8e-DkjkL-eVk9w":{"text":"I was quite pleased with the decoder and greeting. I loved our hostess, but our server was","useful":0,"cool":0},"sWcbfvjc3buyavvS_-Wmmg":{"text":"Great food, but for the price, very disappointed in the service. Slow, hands in face, clea","useful":0,"cool":0},"sqGCbhsXqo4ZVoN9fKgEHw":{"text":"Domenica is a very nice and appealing restaurant to get your Italian cravings satisfied! T","useful":1,"cool":3},"klU0Me3E3ztBWzkhOoGdHw":{"text":"I've been here several times and have not once been dissatisfied.  From amazing pizza to s","useful":0,"cool":0},"Mlhb7NVgQEccatN7OiX-iA":{"text":"I actually just came here to take a pizza to go ;-)  The pizza was tasty.  I got a tutto c","useful":1,"cool":0},"53HTu5YtO-WcUkBEPSmK8g":{"text":"I'm conflicted.\n\nThe food was phenomenal but the staff was not the best and it was insanel","useful":1,"cool":0},"YffgUlFKiul7hal5d11EcA":{"text":"The best pizza in a while!! The Margherita was gooood!! And the prosciutto was also pretty","useful":0,"cool":0},"IPj6spPB-wt46IIwPVxqwg":{"text":"The Affettati Misti (assorted meats and cheeses) was outstanding! The Basil pesto pizza wa","useful":0,"cool":0},"aDobQ9xaL6Rb49qTZ4K7jg":{"text":"4.5 stars out of 5 simply cause it's hard to be perfect but they come very close.  I came ","useful":0,"cool":0},"nMh2pk9sYdJyF64UElbgUg":{"text":"The best lasagna I've ever had so far! The serving was big for me so i had to bring the re","useful":0,"cool":0},"kvYIXmV1258InMv9r6D51w":{"text":"Fantastic restaurant by John Besh. The restaurant is beautiful located inside/next to an o","useful":2,"cool":1},"aRFsm46f8CZlksAS8W6ZyQ":{"text":"Fabulous food. Great atmosphere. Phenomenal staff. Only downside was restaurant showed no ","useful":0,"cool":0},"k4vqabuyrgNCdHUiUKpe4g":{"text":"So we wandered in during happy hour for a quick bite and a drink. First off, great happy h","useful":0,"cool":0},"PBghwvgl-kZvjxiw0AzkkQ":{"text":"The best fudge crinkles in town.","useful":0,"cool":0},"4RB77EI9IFx9nuL2an1kMA":{"text":"The flash-fried kale salad was out of this world! We shared a pizza -- half Calabrese, hal","useful":0,"cool":1},"HBbggUgGjgD9MwEAZmeoZw":{"text":"This is definitely my favorite go to spot for great Italian! The Lasagna Bolognese is like","useful":0,"cool":0},"EZ_QcqhkM5zq3SNHHqgQXg":{"text":"I am still full two days later.  Wonderful service, excellent food, excellent ambiance.  M","useful":1,"cool":1},"eLUAthnR6b0JJ9-O479GUQ":{"text":"The pizza is delicious and probably closer to authentic Italian pizza than most places in ","useful":0,"cool":0},"-LRLzS3aP-nQkuNjcqdOcA":{"text":"I was in New Orleans for a wedding and came to Domenica for lunch.  Not only is the restau","useful":0,"cool":0},"jlnwNyI0Hu5ZibHGqzLa3A":{"text":"Great atomsphere! Awesome food and service.  John Besh NEVER disappoionts! The pork should","useful":0,"cool":0},"KR_9_vCAI3ISbGzSc0X6dg":{"text":"Finally made it to the Happy Hour after months of saying that I wanted to go.\n\nFirst of al","useful":2,"cool":1},"YkxTckmptZwqZ9G7Oahohg":{"text":"Wow, if I had to describe this place with one word it would be Fantabulous! We started out","useful":2,"cool":1},"rvresJyQ-9qzm6DKwKS4Rg":{"text":"Pretty awesome restaurant and I would have given it 5 stars if it wasn't for the menu bein","useful":0,"cool":0},"Y4tUaGhsIaIaQB5MUm7D_w":{"text":"A few years ago I was supposed to get together with a friend of mine that lives in New Orl","useful":4,"cool":3},"XXWjCDxeSuoWiP2ufBgx4g":{"text":"Domenica was recently listed as #24 in someone's Best pizzas in the US list, which I disco","useful":1,"cool":0},"BGu9dvIpbNcDgdSJc7fWnA":{"text":"Cute ambience. Nice place to take on a date or special occasion. However I wasn't super im","useful":0,"cool":0},"t-T63vVdrtTl15w5W7iXlg":{"text":"Declious menu and great service. The grilled cauliflower with goat cheese is a must! If ge","useful":0,"cool":0},"Zdx64FJmBjoEnktGMLYp7Q":{"text":"New Orleans is a city full of amazing food.  From muffalettas, to po-boys, to gumbo, the b","useful":1,"cool":1},"pPwkhm--ozViCtVjStNKYA":{"text":"Horrible experience, we were staying at the adjacent Roosevelt hotel and tried to grab som","useful":0,"cool":0},"umZ_sozAT9xWwJF5v9wt_Q":{"text":"Being from NY and getting a margarita pie, my husband was a little skeptical but he said  ","useful":0,"cool":0},"zRwQbEqcYbawrCSZu8SEXA":{"text":"Dinner with a group of eight...\nThe food was generally excellent.  Fried squash blossoms w","useful":0,"cool":0},"BMz3zZs-2CDg9Iw95BO-hA":{"text":"Wesley was so awesome! She so enthusiastic in explaining the menu and helping us navigate ","useful":1,"cool":0},"JCjuBMvAz8jqWP8LGyBzRQ":{"text":"I've only been here one time. Their pizza crust is really good. \n\nFor you drinkers, go hav","useful":0,"cool":0},"ab-Z3he6t51DrCNZWzcr2A":{"text":"I'm in the restaurant now, I asked for a window seat and the hostess said it was reserved.","useful":0,"cool":0},"Ccz_iuYbYHZdKGJX29SSeg":{"text":"Pizza was excellent. Thin crust. Reasonable wine list. The roasted cauliflower appetizer s","useful":0,"cool":0},"c1JS-Iux4Ap7n314zOcLCA":{"text":"Great happy hour offerings- pizzas & drinks are half off. We had the prosciutto pizza and ","useful":0,"cool":0},"GPS9xbuPbTbYyFA7qfcMIw":{"text":"Sadly, we were just not impressed. Dined here for dinner and for HH the following day. Giv","useful":3,"cool":4},"H8Nzq1PKmUOMu3TLL0WSMg":{"text":"I went here after the game to get a pizza and some pasta with my husband. We were waiting ","useful":0,"cool":0},"x2-c8gVX1nX1V5zQI1YQHQ":{"text":"By far Domenica has the best Pizza in New Orleans. \n\nNew Orleans is not a pizza town but i","useful":0,"cool":0},"EjDt3k_kNUUjZjo0nZyC8A":{"text":"Had a terrific lunch at Domenica today. I started with the salad of baby greens peaches go","useful":0,"cool":0},"2vOtgX1ejxQ5FA0Ts003_A":{"text":"Domenica is fantastic for lunch or dinner and has one of the best happy hours in the CBD. ","useful":0,"cool":0},"zqjwed8A1ogTqNkSlH-qGw":{"text":"This place was pretty good.Worth it to add to your to try list. Especially if you are tire","useful":0,"cool":0},"Y1xZkHxgDt4WQ_oP6qG5RQ":{"text":"Good wood fired pizza selections.  All varieties we've tried have been good.   I really li","useful":0,"cool":0},"6zLktkeUYYRaHwMjJFIiPg":{"text":"Dinner last night here was amazing! The pizza and pasta was flavourful and the perfect por","useful":0,"cool":0},"zQUDkAbphGD9X4YDdIudKA":{"text":"The shaved octopus appetizer was fantastic. The server was extremely friendly and attentiv","useful":1,"cool":0},"_1Ip7332HP4kdIt7igFAsA":{"text":"This place was so good.  I had lunch here and had the pork pizza as well as the clam pizza","useful":0,"cool":0},"YUOwdIOzVHc2-DN3mtrpbg":{"text":"Is the food excellent? Yes.\n\nDoes the atmosphere ruin it? YES.\n\nIf you don't want to talk ","useful":1,"cool":0},"mjPTMIlNzTuaem1v9pkkPQ":{"text":"Love the food here. Had the smoked pork pizza and the pork tortelloni most recently, and b","useful":0,"cool":0},"gpvNtff_lTsgpm_jnIXQGw":{"text":"Items Selected:\nWheat Bread, Chili Pepper Olive Oil \nSoppresatta di Toscana, Biroldo, Duck","useful":5,"cool":4},"gmzbUYQWfJLmYPeHr2yIxw":{"text":"Love at First Bite\n\n\"OMG, this is where Bella met J. Jenks in the Twilight Saga Breaking D","useful":2,"cool":2},"ky0vVNVB7JXx1V-jcKfsjA":{"text":"Our first night in NOLA and we weren't ready to jump into Creole/Cajun cuisine, so we came","useful":0,"cool":0},"sFSlkhR24gRpXLHAVZ2FJg":{"text":"Excellent Italian meal in New Orleans! Had the roast pork pizza and the crispy kale which ","useful":0,"cool":0},"vYWFzZynObO0hEEMd9tTXA":{"text":"The family and I stopped at 3:00 PM for happy hour on a Saturday.\nThe atmosphere is fun, t","useful":0,"cool":0},"W911tHxcLJ9CINtaOLQJYg":{"text":"Best happy hour ever. The pasta and pizzas are to die for. The salads and apps are great t","useful":0,"cool":0},"HnlLAhsjk3tbbqJXUaa2vQ":{"text":"This restaurant has a beautiful atmosphere.  It is located in the iconic Roosevelt hotel. ","useful":0,"cool":0},"U50J_qQn3Xo2TxMVbO4x1g":{"text":"Had pizza and drinks. Was amazing food and a beautiful restaurant!! Great waiter, took his","useful":0,"cool":0},"dEDc3ol3bhPsNHbYZe9uUQ":{"text":"Just WOW. This reminds me of NYC, my home! Every dish, they nailed it. Their pizza is so l","useful":1,"cool":0},"ZPXrv9lHdb_aORfioYVrYg":{"text":"Guess I need to add to the ever growing list or reviews praising Domenica! \n\nLocated insid","useful":10,"cool":6},"yiHf92ucnCskSj-YK4NxHA":{"text":"Great food, happy hour deal, and service! The tagliatelle was delicious and I loved the fl","useful":1,"cool":0},"2xa8MlVtD-xQPHuuzOPjpA":{"text":"One of the best Italian restaurants I have ever been to. You have to go here for yourself ","useful":0,"cool":0},"2EHJFQT_G31bQiN_hq4jHg":{"text":"The sexy atmosphere is very alluring but not enough for me.  There are plenty of Italian r","useful":1,"cool":1},"r_0jeRhD_L34BwdJD_weUg":{"text":"Wonderful pizzas at a fare price.  We had the Gorgonzola with prosciutto and pecans.  \n\nOu","useful":0,"cool":0},"jzSDn_2kkQQ8WcHjHKMX5g":{"text":"Great pizza and happy hour. 3-6 everyday (even Sunday) I make it by as often as I can. The","useful":0,"cool":0},"tse7c0hl1lO_KfzumoxBgg":{"text":"I can not rave about the clam pizza enough! Absolutely one of the most amazing taste sensa","useful":0,"cool":0},"Aeh8Hnl1r28DpfiBBOeK1Q":{"text":"Get the fried kale and cauliflower: they prove that good food can be simple. The service w","useful":0,"cool":0},"8PQhErg6frXWrl68TjFMqw":{"text":"Good ambience and nice staff. The pizza was a little burnt, the broccoli pasta nothing spe","useful":0,"cool":0},"CEXEOeCg0WfwYi1VxiVBtw":{"text":"In town for Jazz Fest. Visited as a group of ten. We ate and drank our way through the men","useful":0,"cool":0},"UmsP6-RZ62hmTRkAWxWh9w":{"text":"I stumbled upon Domenica while checking out the Hotel Roosevelt and we were not disappoint","useful":0,"cool":0},"KbxF8xxK5cATBux84ZaB7A":{"text":"Dinning in progress.  Ten people waiter brought 4 slices if bread. Feeling rushed. Nice ol","useful":0,"cool":0},"9B6oBjOCurGQ-kvuDEsypw":{"text":"Noise level is high! Another business dinner of six people. We waited 20 minutes past our ","useful":0,"cool":0},"_C1EdUjzyLzgrKjfGQtUgw":{"text":"So delicious!!! This was a pretty close second to Pêche. We had the fried risotto balls, c","useful":0,"cool":0},"qKZHUH8MH19Tjy4ZonSWmw":{"text":"After a late night, I decide to order a prosciutto and arugula pizza to go. The pizza crus","useful":0,"cool":0},"rLjxdWGnFUOXJRL3UzLCKg":{"text":"This is a must try in New Orleans. Food and hospitality were top notch. We had a nice visi","useful":0,"cool":0},"Xg6aqJMXfduDI30CziSTXA":{"text":"Called beforehand. Drove downtown to find out they decided that they were only taking rese","useful":0,"cool":0},"PQJEiIN7l2PLs8QFS-9XBA":{"text":"They did not have gluten free pizza which they ranked #1 on yelp for. Certainly an issue.","useful":0,"cool":0},"3lME9QAXnizK87rG7TBcKg":{"text":"The food was unbelievable. My wife is vegan and they accommodated her without any hesitati","useful":0,"cool":0},"LFKE1ooKHv9cB05mXUD3qg":{"text":"We had a fabulous dinner for 14 on Saturday! Walking through the hotel was gorgeous and be","useful":1,"cool":1},"A5XCTqX2hOj7XvYrN4Za7A":{"text":"I almost left because the hostess was horribly incompetent, so won't waste time discussing","useful":0,"cool":0},"DpwSGyRftQFEQdZf0F-h1w":{"text":"We only sampled the Charcuterie plate here, so I can't give it a full review, but will say","useful":0,"cool":0},"jOOEnI0-x8qK4jiO8IV0qQ":{"text":"The tutto carne pizza and espresso cookies are everything . Our bartender Natasha was so s","useful":0,"cool":0},"oDhz7HX6umbSK0wnNqWOPg":{"text":"This place was amazing! Everything from the apps to dessert was so tasty. The only thing I","useful":0,"cool":0},"5RVO_cW-krXfsx8CIYfkJg":{"text":"Great modern feeling environment. Not many choices but the choices are good ones. The roas","useful":0,"cool":0},"63U0wgRpvJ63hrFaF3da9w":{"text":"Love this place--fried kale is incredible and pizzas we so good we ate here twice in 3 day","useful":0,"cool":0},"ASqSfk9Sq0XzTiZGI_fY4w":{"text":"What a great experience!  After an 18-hour train trip from Chicago, we walked over to Dome","useful":0,"cool":0},"U1RtpsIgnhsHEH3sK6ZTbQ":{"text":"I loved everything about this place . We ordered roast pork pizza and mimosas which were m","useful":1,"cool":1},"-1Bdvp1RnqHSfy7Sl5FKiw":{"text":"I've been to Dominica many, many times. Never had a bad meal. Today was no exception with ","useful":0,"cool":0},"0Nq0O-xD3EOL9Be9zDyF1g":{"text":"There were many good reviews on Yelp and my friends took my girlfriend and I here for dinn","useful":1,"cool":0},"epxmPgQxAQ_ubZ8lyZwOjw":{"text":"Went on a very busy Wednesday evening. Nice ambiance and crowd--although noise level was d","useful":0,"cool":0},"gVACZHiGWl8P4UGtKfNPow":{"text":"Split a whole bunch of the appetizers..really great..\nThe goat cheese w tomato, the procui","useful":0,"cool":0},"9YOiLoTLIiaHyIgLpojTTg":{"text":"I was torn as to what rating to give this place because the experience started off extreme","useful":1,"cool":1},"dCyU0EbGK0-Ii-VidJuYpA":{"text":"After waiting for one hour, they finally brought the cauliflower appetizer. They should ha","useful":0,"cool":0},"Zk24Gr5TJMBQWvgKu6tCyA":{"text":"Had a wonderful meal here. Also, did not know that they were doing Happy Hour when I went ","useful":1,"cool":0},"LcKsIpwWljtoDXndsw4OOw":{"text":"Best Italian pasta I've had. I like going to restaurants and eating meals I can't prepare.","useful":0,"cool":0},"g6yGNmObBuWwVxFEoBt5Bg":{"text":"Awesome Pizza happy hour during the week. Got a great deal on a few different types of piz","useful":0,"cool":0},"f03mEpI4gZc4ns-V7t4tlg":{"text":"We ate here on our last day in NOLA and I wish we could have stayed longer to enjoy anothe","useful":0,"cool":0},"nl1pmvHZ2ZGMp11MUoFa8A":{"text":"First-timer here, I was SO pleased! The meatballs are a must. I love that they have a half","useful":0,"cool":0},"JdlEDsoxCz_DgoiQ8yGNLA":{"text":"Revisited on our second visit to NOLA, about year later, and still great food, very person","useful":0,"cool":0},"DA6LG48oZP-8vqhX899GMg":{"text":"Pizza Margaretta was perfect the buratta was delicious.  Besh and his partner have put tog","useful":0,"cool":0},"ebFwBH8kIFbxnEBkKc8a3w":{"text":"Probably the best deal for food in New Orleans.  Happy hour has the pizzas for $6.50.  Tha","useful":2,"cool":3},"XLhcYausJelwcv3H_fsGgA":{"text":"This place never lets me down. Great pizza great wine great happy hour. \n\nNot on the happy","useful":3,"cool":2},"-3twHFS8yJf4i_tk9Xbs3g":{"text":"If you need food that will last you the day and help you power thru Mardi Gras festivities","useful":0,"cool":0},"v086GuH5i72wIV9xI79skg":{"text":"Great place for a date with my LOVE and sharing the holiday spirits.  It was delicious and","useful":0,"cool":0},"O8JtVgWX69NRkxINPvCR2g":{"text":"I couldnt thank myself enough for having chosen to stay at the Roosevelt! A big reason was","useful":0,"cool":1},"riZK-flIIDJu46l8cwURQQ":{"text":"Stayed at the Roosevelt during my last visit to NOLA and was happy that I didn't have to g","useful":3,"cool":4},"VwWLpmxjk2aqQGFHFdYSLA":{"text":"And it's down the best pizza that I have ever put in my mouth. Do yourself a favor and che","useful":0,"cool":0},"LT-DCcOgQJK47tMapCxgTw":{"text":"Italian in New Orleans.  Interesting concept works with their pizza but not really with ot","useful":0,"cool":0},"EaCVhSYCFA6f3a6g8kWMkg":{"text":"Wonderful dining experience!  In fact, we ate there twice during our stay.  Everything we ","useful":0,"cool":0},"oCZcCbo6lmVBQl-u-JJIAg":{"text":"Food absolutely amazing great price. Happy hour includes drinks and half off pizza!!!","useful":0,"cool":0},"Y-EVT7ZWCngcGDwaTPLvIQ":{"text":"The food was very good, service great but a little pricey.  The fritto misto was excellent","useful":0,"cool":0},"-nvgRAQtdWPnGlvBHX6g5w":{"text":"Terrible service. Walk in and was asked to stand aside while the hostess looked for availa","useful":0,"cool":0},"cpLc-Io4yrKBFl6Zi3U1Dg":{"text":"When eating at restaurants at hotels it can often be hard to find something to eat. Right ","useful":3,"cool":0},"yhyNDdjg6qK1O-_R_vakyA":{"text":"This is a great foodie restaurant in NOLA.   You MUST order the roasted cauliflower with w","useful":0,"cool":0},"UFM-XJTI7u8w2EvAcpebuw":{"text":"This is the best Italian food I can ever remember having. WOW\nThe Campanelle white bologne","useful":0,"cool":0},"13sZb0LQ5EIp8_qLl0So2g":{"text":"This place has the worst pizza I have every eaten! What a waste of $$$! My wife and I had ","useful":1,"cool":1},"la-wojNVd55cQpI70IimJQ":{"text":"Oh wow. Told good Italian did not happen in New Orleans....here you have great food, great","useful":1,"cool":0},"EQZau89akuIetGFxhzeoWA":{"text":"Portions are small which I prefer. The flavors are big, rich and wonderful. Very attentive","useful":1,"cool":0},"tLsFJHnJ6soUuHxrBdomkA":{"text":"Sadly this restaurant is not as great as it used to be. Not sure what's happened....lack o","useful":0,"cool":0},"-7XHe-zhM-7lNk85GZLiug":{"text":"This has the best pizza and bread in New Orleans...great service and great food great atmo","useful":0,"cool":0},"o_kqxhdfvawmRcTpDcw1cw":{"text":"Pretty chill spot. Service is odd. Not a lot of personality, especially the chick bartendi","useful":0,"cool":0},"hUzF67NvNt8BUP2vSAlNTA":{"text":"The food is good and the wait staff was attentive and friendly. However management and hos","useful":0,"cool":0},"2bO7BCTaFuSf-6xoJcECVQ":{"text":"Been a while but had a great lunch today. Started with the Blue Crab Polenta with Paddlefi","useful":1,"cool":0},"FwVsFzXUpGt4Ab2ot-KO4A":{"text":"my 4-star rating applies strictly to their happy hour, which, due to a lack of robust comp","useful":1,"cool":1},"6u9DWtiqHLvhDQXm3PCJ9g":{"text":"This restaurant was my favorite Pizza, Pasta and Charcuterie in the city but the last thre","useful":0,"cool":0},"GkGgUlEfZ1llyLWtemF0RQ":{"text":"So late on my review of Domenica. John Besh, I love you.\n\nWe were staying at the Roosevelt","useful":1,"cool":0},"03z34OiunB7RzZbD3o7RFw":{"text":"We dined at Domenica a couple of weeks ago on our trip to Nola. The Roosevelt Hotel (where","useful":0,"cool":0},"GVpp8jvAWFxR0an-scbjWw":{"text":"I was quite disappointed by this place. Bad service and overpriced.","useful":0,"cool":0},"w8FfQ-RnjFRnYGQwzZzz7Q":{"text":"Going on a Wednesday was 5 stars...\n\nSunday's service was 2 stars at best. Waiting 15 minu","useful":0,"cool":0},"8hAwUr87Ik7DE6d7B_Vy3w":{"text":"Takeout should be efficient and it's just not here, or least it wasn't tonight. I called i","useful":1,"cool":0},"LgVp8LRdmyVnscXYOE3YiA":{"text":"Whatever you do, don't come here without a reservation!!\n\nSeriously.\n\nSo after traveling t","useful":1,"cool":2},"mindgQoPiKUUD2NAyhxx_Q":{"text":"This is a really solid place and if I worked near here it'd be hard not to snag a white pi","useful":0,"cool":0},"HXNH7u8woMwcKa31fDycvQ":{"text":"Dinning in progress.  Ten people waiter brought 4 slices if bread. Feeling rushed. Nice ol","useful":0,"cool":0},"v-dsytUus6O2VVY1YFdaxA":{"text":"What a wonderful way to kick off my first trip to NOLA. Domenica did not disappoint. The m","useful":1,"cool":0},"OT99YkjWwtvjPkf5zgPX0A":{"text":"I walked into Dominica expecting the typical Italian fare, pastas, pizzas and the like. I ","useful":1,"cool":0},"jtXSz9GaNU1bJ-dNNCgm2w":{"text":"Stopped in here for a solo lunch around 2pm on a Wednesday, sat at the bar and received gr","useful":0,"cool":0},"v31skrfX8p_Lz5NyZswBpQ":{"text":"Went there tonight after a lovely evening seeing Hamilton. We were so happy until we walke","useful":0,"cool":0},"pTMNhx_mtXmxYlJR1qwd3w":{"text":"Another excellent Besh restaurant featuring fresh, local ingredients and open Sundays for ","useful":1,"cool":0},"rEeCsaMpeE_koizc4_PvQQ":{"text":"So many things I wanted to try here but we are in New Orleans so we only got to eat here o","useful":0,"cool":0},"8NyYxS0WFhYZqs1Zmmwd_g":{"text":"We were seated around 530 and stayed for a good 15 minutes and were never served. We sat a","useful":0,"cool":0},"0_-kvjzuaHSoQDyNyLN8iA":{"text":"Great happy hour specials everyday from 3-6!","useful":1,"cool":0},"7iMVr0lKF3T09ZxdlEyq4Q":{"text":"HAPPY HOUR\n\nEvery day 3-6 (not sure about Sunday)\n\nHalf price 13inch delicious fancy pizza","useful":0,"cool":0},"Z2iwn_ZOqv1xSr_MnFcGVQ":{"text":"This place was recommended by a few people and it did not disappoint. They don't have thei","useful":0,"cool":0},"dSGTza0bB-IgjE_vXsuvDQ":{"text":"The happy hour special is amaazinggg. The pizzas are a nice size and beer and wine selecti","useful":1,"cool":1},"8YzxZGOm5bu3TjiQeJFSkA":{"text":"Very nice restaurant, excellent service, good food, moderate prices. I'd come here again i","useful":0,"cool":1},"fibHPI1nyVpwLJx3yp9JBg":{"text":"oh.em.gee.\n\nThis place made me feel excited about food, AND like I need a raise!  Very exp","useful":4,"cool":1},"gQ04tF3JJA4bMSZky0OVQQ":{"text":"My son and I were lucky enough to find Domenica's during a brief stay in New Orleans. The ","useful":0,"cool":1},"k42nx9Q7MRoDOZf7ZO1J1Q":{"text":"Really good food!  The pizzas took me back to Italy.  Great service.  Beautiful decor.","useful":0,"cool":0},"82OgWRpuOYLr1wWQwdiA6A":{"text":"Very beautiful interior decor in here. The crystal chandeliers and the brown curtains add ","useful":0,"cool":0},"pf7SY02z0XGdhVE5bwgKQA":{"text":"I am giving this restaurant two stars, not because the food was bad--in fact the food was ","useful":0,"cool":0},"iICk8ks0La7XOAnhtARFsQ":{"text":"Highly recommend this place as a tourist spot or local gourmet pizza spot. The service was","useful":0,"cool":0},"Twp_TgnNoQrbK7EWHxoAoQ":{"text":"My husband and I ate here for our Christmas dinner, we had reservations months in advance.","useful":0,"cool":0},"90hwio5GRvfIy-6aAiNAlA":{"text":"Had reservations on Friday during a Christmas visit to NOLA to bring the grandkids to see ","useful":0,"cool":0},"f_dTBgiJxHnFUugRs3hmSw":{"text":"I went to Domenica with a group of friends for lunch on Sunday. The service was terrible i","useful":1,"cool":0},"xkFrJIHqQXOtKu7PRLETbw":{"text":"Food was delish. Rigatoni was amazing, as were the pizzas. Yum as. Definitely recommend. L","useful":0,"cool":0},"3nFl4U7J6Dg6RQHLsUmXLA":{"text":"Well, well well... Holy carb load!  Not only is the daily happy hour from 3-6 about the pe","useful":1,"cool":2},"KLaC6Gl3QRSTQD9jeX9kDA":{"text":"I can't judge their food because we never made it in - the hostess didn't give us a chance","useful":0,"cool":0},"f-3H27_2-cQAhqCmb5_SEQ":{"text":"Amazing place and the service is incredible we are glad the hubby and I came in they have ","useful":0,"cool":0},"X7fmNymiW4Rx0q3ii8xddw":{"text":"Was just amazing.  Authentic Italian food.  Had cauliflower and split a pizza-- dough was ","useful":0,"cool":0},"0ni4uZMHZqMwLPtWATehUg":{"text":"Made my first visit on a Wednesday night. Ate at the bar and the service was surprisingly ","useful":0,"cool":0},"yB84WaEnpIteUp-bry5vjA":{"text":"Good Morning everyone!!! \n\nSO... today I wanted to share a post about the AMAZING dinner I","useful":2,"cool":0},"l6KcVS3sVv_8jc_iVh54kw":{"text":"I've been here several times over the years specifically for the amazing happy hour deals ","useful":1,"cool":1},"b3uBF91XkXEGh8D5Ad961g":{"text":"This place is crazy cool!  Excellent and enthusiastic service.  Spicy olive oil on the tab","useful":0,"cool":0},"OneI5y3CyZtLfMRl6QyrKA":{"text":"I joked with my partner about who would go to Italian in NOLA, while in the same breath sa","useful":0,"cool":0},"BdpExSXjuZ0hlJBioOpjgw":{"text":"Here I am in New Orleans and getting Italian. Well, do not feel bad the pasta come in 1/2 ","useful":1,"cool":1},"MzcFoQVj-oA0HkYxapnzbQ":{"text":"The food was amazing!\n\nThe lady treated me to a delightful dinner before we were set to go","useful":0,"cool":0},"uJXPq8s2v1Knet9haZQVYQ":{"text":"I'm sorry for what I am about to do, but THIS PLACE IS AMAZING AND MAKES ME WANT TO TYPE I","useful":2,"cool":1},"ufW2rsE5NlhNtA45N80Xlg":{"text":"The two times I've been here, the service and food was exceptional. Bonus for me is they c","useful":1,"cool":1},"THelmzbkdrYm9BodMZvU_A":{"text":"Stopped in for a late lunch and it just happened to be happy hour where all of the pizzas ","useful":0,"cool":0},"Go4CUVJYiSngAiSviidOVA":{"text":"The food is italian and pizza. The antipasti of cauliflower and ricotta was the best thing","useful":0,"cool":0},"7REKpVNMg15BIJ07YyrFFA":{"text":"Domenica was our answer to the question of what John Besh restaurant to eat at in NoLa (..","useful":1,"cool":1},"dFW9jWLq8FpWYFt0PLRfoA":{"text":"Nearly universally delicious food, inconsistent service.\n\nStarting with the good: The spar","useful":0,"cool":0},"h4zKpA55zpfEUPjR9qiiMw":{"text":"Don't worry if u are not into pasta into pizza . Mushroom soup is delicious and appetizers","useful":0,"cool":0},"qjSq98yygRzKVVRxqoCMkQ":{"text":"My first John Besh restaurant was a great experience!\n\nWe came for lunch and were seated r","useful":1,"cool":1},"op_1SBP6cSpe1SRo628CnQ":{"text":"There has to be two separate reviews of this restaurant for this rating to make sense.\n\nFi","useful":2,"cool":0},"OWV7KjiRa2iU7d0U_UQ-dA":{"text":"Very elegant place, good service, and food was great.\n\nThe food seemed pricey at first but","useful":0,"cool":1},"QBUAEdbNZl5VaRSrtwQnNA":{"text":"Another happy hour (2-6 pm) home run. Pizza with some yummy beers--all for half price--in ","useful":0,"cool":0},"ZZomfgP9h1UG3bfigF-cqQ":{"text":"Amazing pizza in a hip and trendy atmosphere.\n\nAll of the food we tried here was amazing, ","useful":8,"cool":5},"PNdIz2xTVKAFNz8IkIya1Q":{"text":"The best meal we had in New Orleans! Domenica is in the Roosevelt Hotel (beautiful old gra","useful":0,"cool":0},"dVEuU9sSkieiUBJ_coj8rg":{"text":"Excellent service, drinks, and food. You must order the cauliflower with whipped feta. It'","useful":0,"cool":0},"uMB0xr1nqpVMTN2z0tTPqg":{"text":"I was fortunate to be staying at the Roosevelt Hotel so I luckily didn't miss this italian","useful":1,"cool":0},"LG7BFFrnBf2M4vZPLv_joQ":{"text":"Ate here over Xmas holiday during stay at Roosevelt Hotel, for which Domenica, remarkably,","useful":0,"cool":0},"LX0F8ZNJkj_cBDI8cAwoWQ":{"text":"Sooooo, we had the cheese app (1 kind), fried kale salad, margarita pizza (added mushrooms","useful":2,"cool":0},"EZg1MLjwUS_Ez1ILnqW8Eg":{"text":"Very very friendly and knowledgeable staff, our waiter checked on us frequently and gave e","useful":0,"cool":0},"79agykMt_DMII3LwC01jnw":{"text":"Everything was delicious! If you are in New Orleans come and visit, you won't be disappoin","useful":0,"cool":0},"QsUQGq06dYPzPQCeoyoimw":{"text":"Ordered the wood fired eggplant and margherita pizza. Both dishes were delicious. Good amb","useful":0,"cool":0},"AiuQZuAWQ8Hdj5uMR-4Ylg":{"text":"I was in NOLA for a conference, and Domenica was recommended by a local. My two colleagues","useful":0,"cool":0},"FtxDktQtKTfkCer6xqsvEQ":{"text":"Came here last night for dinner, saw it on Yelp and it had some decent reviews.  Very nice","useful":0,"cool":0},"sXRAMCnRpCWfgovmOf1wbQ":{"text":"I came here for happy hour, but I didn't order any pizza, which is half hour during this t","useful":0,"cool":1},"MuE9aZjRZElkrhJX-nIyrw":{"text":"This place is beautiful, but the lovely atmosphere was unfortunately not staffed with a ad","useful":0,"cool":0},"_TLM_QKsyWFo-Mi9sSQhHg":{"text":"We dined at Domenica for a birthday dinner while visiting New Orleans. The cocktail menu w","useful":4,"cool":4},"oQS9WbuaYS18bm2UQI0aow":{"text":"Why doesn't Yelp do half stats? This is more a 3 and a half star review.. Made reservation","useful":1,"cool":0},"v0H8ApMTW7C1KGTAipwNtQ":{"text":"Let me come out and say that I do not normally leave yelp reviews. I guess I should though","useful":0,"cool":0},"XZ_zIzdU_HQ7YrPaeMoXnA":{"text":"Our entree's haven't even arrived yet and I'm already giving it five stars folks ---- late","useful":0,"cool":0},"L18CVSxhiaPV7OLNrVKTpA":{"text":"Best In town! Great staff. Great food. Great ambiance. Pâté. Salad. Linguini. Wine. Beigne","useful":0,"cool":0},"4aIIelvEjVRsslRUFtREOg":{"text":"I was glad I made a lunch reservation, because those that didn't seemed to have to wait. \n","useful":0,"cool":0},"0SM_bNvyvc_sXx9bgy9vyg":{"text":"Domenica was my favorite meal on my honeymoon. The restaurant itself is a little odd.. I t","useful":0,"cool":0},"yNN_zr66bZWsmg3ZgEyiIg":{"text":"This is hands down my favorite restaurant in New Orleans, thus far. The ambience is classy","useful":0,"cool":0},"VSN0IajjEz6R-vCJ66NLAw":{"text":"Fabulous! Was in the area for a meeting and needed somewhere quick to get lunch. Sat by th","useful":1,"cool":0},"R74w1BN64psbgjCN4PWoHQ":{"text":"One of the best places to snag a great single person, thin sliced pizza, beer, cocktail an","useful":0,"cool":0},"42_x_UQnkpGvU6o7-JrceQ":{"text":"Food I would rate 3.8\nService I would rate 2.5\n\nThis place was super busy on a Sunday nigh","useful":1,"cool":0},"JvZphjS4GeR-feQ3DH2qiQ":{"text":"What a surprise. We ended up not making an earlier reservation elsewhere and this place ha","useful":0,"cool":0},"V2rUlJyMJ9pmip89nxSrvA":{"text":"Service was very slow but probably because they were training someone new.  Appetizer was ","useful":0,"cool":0},"RwXHoqiDm1Q593fVBRJlvg":{"text":"My eating whirlwind through New Orleans continued and I really tied one on (can you do tha","useful":12,"cool":12},"OoRg0zAS4NEKCMavNJzYxw":{"text":"Great for:\nVegans who love pasta\nAll kinds of pizza lovers\nCarnivores who love -obviously-","useful":0,"cool":0},"dKI0iS8ByKHcV2ONK2kk7Q":{"text":"One of the best pizza places in New Orleans, hands down I would recommend this place to ev","useful":0,"cool":0},"7EWG5l3sxe0SvQgWa5i73g":{"text":"This wasn't initially on my list of places to eat for my first time in New Orleans but I'm","useful":0,"cool":0},"tuPGABWwxP0F6476K5Jscw":{"text":"Domenica restaurant sits inside the beautiful Roosevelt hotel. Being from out-of-town, my ","useful":3,"cool":1},"0ofpBhteAq_u8Rmx1A_bYQ":{"text":"Friday night we had date night and after much back and forth (\"No, what do you want?\" \"I a","useful":9,"cool":6},"A1l0Yj4HlR7M3kDPpXflZg":{"text":"Our food was fantastic! Everything was tasty and the kitchen was able to accommodate for o","useful":0,"cool":0},"vwkDSHvPdNa8o3CUnIyjBQ":{"text":"Having eaten here twice in three days, once for lunch and once for dinner, I got a good fe","useful":0,"cool":0},"kT26G9549di9NWi1Dhqirg":{"text":"I really wanted this to be a good experience since we had just arrived to NOLA.  My 13 yea","useful":0,"cool":0},"NPxv6c0UrhoDfCpDjnKuWQ":{"text":"Great atmosphere, good food. In NOLA for a conference & this restaurant was near my hotel.","useful":1,"cool":0},"m_dJC3wvScEog0CDfckimw":{"text":"Solid 4 stars although I would have given a perfect 5 but our waiter was very odd and kind","useful":3,"cool":0},"c7TjOc6C8_qDxT_LHFunpA":{"text":"We just arrived in New Orleans from driving in from Orlando FL and didn't feel like going ","useful":0,"cool":0},"DqqpCe-pX_Ww_kPElsbqFQ":{"text":"The wild mushroom soup. WOW.  Possibly the best soup I've ever had. Was hard not to lick t","useful":0,"cool":0},"cnIlvyjW5ihDp3V5h1GTcQ":{"text":"Lauren: What a superstar bartender. She had the best drink and menu recommendations. \n\nBES","useful":0,"cool":0},"mO1rQ5lsKQ3d2oP56DD2Kw":{"text":"After the allegations of sexual misdeeds brought against John Besh, I had planned to avoid","useful":7,"cool":4},"Tyn8RGWhmPmuNoCkpOaVcw":{"text":"Crowded, could not make a reservation, and a 1 1/2 hour wait for a table. Wonder why? Drin","useful":1,"cool":1},"Dsg56Ri86R3tTFLNZyFlWA":{"text":"One of the best happy hour spots in the city.  Half off pizzas!!!  Pizzas are definitely b","useful":0,"cool":0},"MzIvXrnC-LefTSRkumiUng":{"text":"Words and pictures cannot begin describe how fantastic the squid ink tagliolini with blue ","useful":0,"cool":0},"YoXUUyUczVzXijFlbftuOg":{"text":"This high end restaurant has squid tagliarini, which we love.  Although everything about t","useful":0,"cool":0},"LvElEy8zKVJZTbswZvWo3w":{"text":"Love the atmosphere. We were seated and greeted promptly. Great waitress.  1/2 off pizza a","useful":2,"cool":1},"0MZy82ZcXyC3Z169L8QplA":{"text":"We had a marvelous Christmas Eve dinner at Domenica.  The staff was so friendly and helpfu","useful":0,"cool":0},"aYRhVYV2rLaJ_JhgzopCJA":{"text":"Service was horrible. Food was awful. \n\nI definitely feel like we were being racially prof","useful":7,"cool":0},"z9ocyqn6wTqk4MOi4aFh9g":{"text":"The best pizza in the crescent city. \n\nDomenica is more than just the pizza. Great locatio","useful":4,"cool":0},"aBwoV3A8Ac1mJoM6N92Tdg":{"text":"Ce restaurant situé à côté d'un hôtel plutôt chic pourrait en effrayé plus d'un. Cependant","useful":0,"cool":0},"RW7OkSq8yuN7q9fH9PrQtw":{"text":"This place is amazing!!! The food, the service and OH MY...get the roasted cauliflower! Th","useful":0,"cool":0},"4JMdLNyIrsrOmdI4V2JZ_g":{"text":"Almost paper thin crust pizza with perfect amount of toppings. Squid ink pasta was delicio","useful":0,"cool":0},"1WGJOlxgg0y_IkOMN_Hb2A":{"text":"Unfortunately our experience was quite disappointing.  We dined there on the evening of Fe","useful":3,"cool":0},"s5Vjl_mUoAZI_iCOAOl59w":{"text":"Sorry but this place has gone way down. Used to be a great go to place. We asked the waitr","useful":0,"cool":0},"tbdU8_t1b-hFsY4ejtNoLg":{"text":"Being an Italian food lover, I decided to try this place out. It's a beautiful restaurant ","useful":1,"cool":0},"lmxOQP_mqaRvlM3WFVGC6Q":{"text":"Truly enjoyable lunch dining experience. From ambience to staff to the food, Domenica deli","useful":1,"cool":0},"GLVohVQPpE2opM8UhZFxPA":{"text":"Lovely Italian food at busy Downtown NOLA\n\n1 - Impeccable Service.  My wife is new to wine","useful":0,"cool":0},"Zucfb1ThwUPSThpzm1sQbQ":{"text":"Molly was waitress, peppy, sweet, and knowledgable.   We ordered roasted cauliflower was g","useful":0,"cool":0},"a_8xbHLpBQjKRqk_lqUAsQ":{"text":"Have you ever gone out to eat on a whim, ordered something that you thought would be prett","useful":1,"cool":0},"uop_v9N6dlooiWa0q-2NbQ":{"text":"I am giving this place four stars for happy hour only. Ordered spicy lamb meatball pizza, ","useful":1,"cool":1},"9nTStFzdN3wNkZ65atFjfQ":{"text":"One of my favorite things about eating out of town is a lazy lunch. With nowhere to be, yo","useful":0,"cool":0},"Zd5p2cGbFn4iMuIvu0tyyw":{"text":"Absolutely love this place. Out of 10 visits, I've yet to be disappointed. The Wild Mushro","useful":2,"cool":1},"A81c2v82NwNqf5kLUdLz7g":{"text":"never never never take me for pizza just before dinner because I have BIG EYES and love to","useful":3,"cool":4},"_4HTa57zTx_Z7Naql5CZZg":{"text":"Hands down, one of the best meals of my life. \n\nI was excited to try a John Besh restauran","useful":3,"cool":1},"6cUc_T-BvpZLTWZ-4TS2fg":{"text":"Great food and atmosphere. Came in hungry. No reservations. Lucked out with a table at bar","useful":0,"cool":0},"mvo1i-L8Kj59Lw10jH1G8A":{"text":"Domenica was my first stop in my week  long visit to New Orleans. One bite I into  their h","useful":1,"cool":0},"A4kK_JA3G1KAyfGf4_AI7Q":{"text":"Came here last Friday night after reading the highly rated Yelp reviews.  On the waiter's ","useful":0,"cool":0},"nLWsoLgcmf-hscK0qh-bag":{"text":"My husband an I took our out of town guest to dinner at Domenica.  The service was awful! ","useful":0,"cool":0},"-LyA2OIoBYqF6nefl4Bx5Q":{"text":"There wasn't a single dish that missed. \nWe had the mushroom soup, the cauliflower starter","useful":0,"cool":0},"AHlBSV4E3kxkBoW_LFAdGQ":{"text":"Located in the trendy Roosevelt Hotel we decided to take a walk over. We went for happy ho","useful":1,"cool":0},"ts-DRQ5lWZNiUcqqUlnlFg":{"text":"This restaurant is so good! We were there with a large group. Excellent service from start","useful":0,"cool":0},"7JZhOLZyT06zKuzNJQa6aQ":{"text":"Great restaurant, especially great waiter last night. The kale was amazing. It is convenie","useful":0,"cool":0},"K0c3gJu3aoGIK4qW3F1ewg":{"text":"Deliciousness. I somehow manage to never come here during happy hour, which is silly becau","useful":2,"cool":1},"0IQurDAq8h5_Up6Is4YacA":{"text":"Great service, great ambiance, delicious gourmet Italian food with a fresh twist.  And rea","useful":0,"cool":0},"WNuO8DB0kGq5hY9LOnJKbA":{"text":"Alright.... so found this place on a whim and so glad that we did ..... \n\nUmm.... cauliflo","useful":1,"cool":0},"zSjB42g1ID2Mp1Azxc260g":{"text":"After a long day of walking in the blazing heat, we made it to Domenica, it's inside the R","useful":0,"cool":0},"Jf7AYZminyo-5IL4yMTqvg":{"text":"Had high expectations for a John Besh restaurant - Luke is one of our favorites.  We were ","useful":0,"cool":0},"0e6nJE1L4VVwvS3tUs9qhQ":{"text":"This was my second visit (the first one was in 2009 before the rebranding) and the restaur","useful":1,"cool":0},"1P_GYjONWSozHkf5aTvPVA":{"text":"We had Easter lunch at Domenica and loved it! The pizza was SUPERB, with a crust to die fo","useful":0,"cool":0},"hRhyAsCsRUcUsloihEFZ8w":{"text":"What if I told you that there was an amazing, top-of-the line Italian pizza place right in","useful":0,"cool":0},"14Pm472C7ZZ8jfWeiLADGQ":{"text":"Great happy hour prices.  Simple cheese plate took too long.  45 min later I received afte","useful":0,"cool":0},"TIbc8-jDfuCoRXjqmkw_AA":{"text":"My wife and I went to Domenica as our first restaurant in New Orleans. The food, atmospher","useful":1,"cool":0},"Iso2FDVP15ABLhU7PnCouw":{"text":"Food was good! Nothing remarkable but definitely tasty. My real issue was with the service","useful":0,"cool":0},"cHvabOIc6MDizzkQUX46yA":{"text":"To die for! Who knew that the most amazing Italian food I had would be found in NOLA?! We ","useful":1,"cool":0},"FD_CrKUQ7ERQV7A12lKiqg":{"text":"Would've liked to have tried it but nearly 25 minutes later and after 4 servers stopping b","useful":0,"cool":0},"0mJE-UbHUSLKwPox6zQ8Gw":{"text":"Absolutely fantastic!  Roasted/smoked beets are to die for.  They have a smoky flavor offs","useful":1,"cool":0},"l7BPCvmg_YnAWAGhDTJVPw":{"text":"So so so good. Came here on New Years day and as expected it was hectic, but the food was ","useful":0,"cool":0},"Pn2oyU60b7pven4XB29OoA":{"text":"We used to love Domenica. It was our favorite place for casually elegant nights out on the","useful":0,"cool":0},"2QBFLalAFezZJlKctW4pnA":{"text":"Now this is a restaurant.  Perfect service, a unique menu and a fine wine list.  You can g","useful":0,"cool":0},"z6YfJKjWsY8qsw7QVOjZWA":{"text":"Valerie DeSalvatore, the General Manager and her staff did an amazing job hosting wineries","useful":0,"cool":0},"9nd7QdDR4Z-PpKXQcnBM7Q":{"text":"First time having pasta in New Orleans. We were not disappointed. The serving sizes were l","useful":1,"cool":0},"G5PZn1-SHYIYe7XP_X-4dg":{"text":"Loud, crowded, and staff is walking a fine line between leaving you to enjoy your meal and","useful":0,"cool":0},"flo3yJVDwsU_1zpThEnBxQ":{"text":"I really like this place with its happy hour pricing. Between 3-6 pm, all pizzas and wine ","useful":4,"cool":2},"wVcOFpRaf3ZzIh4NQEBeBA":{"text":"Feasting NOLA: UNO Behind the Scenes\n\nWelcome to my very first New Orleans culture article","useful":0,"cool":0},"P2SxLjGQ9R03Ijn1o38oMA":{"text":"If you are craving for Italian food this is not a bad choice. We ordered roasted cauliflow","useful":0,"cool":0},"ktU_ZfKBgxbcU7G4VTDOSA":{"text":"Excellent pizza here, especially for happy hour. Had the squid ink pasta and the shrimp ri","useful":0,"cool":0},"vItis4Z05qCFA___uqlf4g":{"text":"Great food great prices great atmosphere just go! Read my other reviews I usually trash pl","useful":0,"cool":0},"CJQGLi10kp40TexDc_WV0g":{"text":"i think that this is the closest thing to a true italian pizza you'll get in new orleans. ","useful":1,"cool":1},"YUBOvMq6-o8WBV5rBov0Mg":{"text":"Great food, excellent service! (Selena? Serena? was our incredible server!)  We had a larg","useful":0,"cool":0},"wFTJd5dJ8RzVoRg8G_Ql5w":{"text":"4.5 stars. The food was great and our server was a doll, but the servings were just not en","useful":1,"cool":1},"zSWWNV_a-kVNqMye2R4j4A":{"text":"Well, I'm a fan. \n\nI've been to Domenica a few times and have been happy with the food and","useful":12,"cool":11},"Ohr1W34rZPJXIR77zU7e8g":{"text":"Great service by the waiters and even better food. The resturant itself is tucked between ","useful":0,"cool":0},"rXdt4vLbkITHITmajM4v3Q":{"text":"Yo Yo Yo: Grade B\nOverall the food is good and really rich. I had rabbit and pasta -  not ","useful":1,"cool":0},"dldhoFsB4I3wRnpMqAFkoA":{"text":"Good!  I liked the Lasagne....Pizza was decent. Friendly service at the bar/lounge seating","useful":0,"cool":0},"PjDwnORvZQqcsPzw-c4rXg":{"text":"Damn it John Besh you did it again!!!! Straight up orgasm in my taste buds!!\n\nAfter my las","useful":1,"cool":1},"QpeK5fYVQxTSx0W2eJ-4Nw":{"text":"We had a short trip to New Orleans, and someone suggested this place.  We had an excellent","useful":0,"cool":0},"UUuD9SkMJi1V5DZPn7MwrQ":{"text":"The food and waitstaff were great! That said, the hostess with the long, blond hair wearin","useful":1,"cool":0},"rmE9x0SgOrqO4JwMZqQf3w":{"text":"Domenica seemed as promising as could be and I was excited to take my parents there while ","useful":1,"cool":0},"v8ghUzQH7TVN53YU3AyS1Q":{"text":"DROOL.\n\nMake Happy Hour. $10 pizzas, and half off wine. Do yourself a favor, and venture i","useful":1,"cool":1},"SJwguTsobKtkQ8QdPuYSKQ":{"text":"Love love love this place! Great ambiance! Best happy hour in the city! 2-6 everyday they ","useful":0,"cool":0},"nmPK_y6wPPmdAxWI_-4xFA":{"text":"Not a great experience.     Was a 9:15 reservation and the staff had mailed it in.     The","useful":0,"cool":0},"mTkI9IkBKWQGcjbsOjwiMg":{"text":"This place has an amazing happy hour from 3-6 everyday. Half off pizza and a lot of the dr","useful":0,"cool":0},"_TgC9qQaNYpkPjBsd5mn7g":{"text":"Dear John - \n\nItalian food and John Besh are two of my favorite things in the world. So ti","useful":10,"cool":6},"lhdr_sAGflA57R5bnwB6oA":{"text":"Going with 5 stars here. Was here for happy hour, which has a variety of good deals on dri","useful":0,"cool":0},"SZhOMc-f9qnOClfqc7iazQ":{"text":"Domenica was a shot in the dark. I was not aware we were going to go here, but I am glad w","useful":1,"cool":0},"QJA2gaz4Y9QLHBomqy4IfQ":{"text":"Loved this restaurant!  We ate here on a recent Saturday evening while staying at the Roos","useful":0,"cool":0},"KFtXQeUWlNUAELjBN1qaPA":{"text":"I REALLY wanted to love this restaurant but I simply didn't. :( I was there for a special ","useful":0,"cool":0},"eKSByOipPmR4jKdrW5dTxg":{"text":"We came, we ate, we died and went to Heaven!\n\nFirst time here for Happy Hour and damn was ","useful":6,"cool":6},"m_uVMNMVoOJ2K0Hxm2Veew":{"text":"Delicious appetizers! Great pizza! Good service! Good cocktails! Nice vibe! We loved it.","useful":0,"cool":0},"0s4Mw36-YMDhW4qiMrTrmA":{"text":"Saw this place on an episode of munchies and my boyfriend and I decided to check it out. \n","useful":2,"cool":0},"aCkZCOuN2q1GzXcQOk_Shg":{"text":"My favorite restaurant in the country! The fried kale and clam pizza are two of the yummie","useful":0,"cool":0},"8X4Pu2q8vD_naOq5AQE7Ig":{"text":"All I have to say is wild mushroom pizza and Squid ink tagliolini. U must try both!","useful":1,"cool":1},"OCKTDKyk_4S95oaS081WTQ":{"text":"I need to start this review by saying how much I already love Pizza Domenica!!  I was out ","useful":1,"cool":2},"_usWFufqrAlkGwnOw_kHrA":{"text":"Fantastic experience and food that couldn't be better. I got soup and salad in an effort t","useful":0,"cool":0},"e7fhXdQadrMdVSvbpzJYDg":{"text":"Pasta was good but portions were way too small for the price. Maybe I'm just used to Texas","useful":0,"cool":0},"RgiMgVgO-9S_Q4fCHhk-nQ":{"text":"Excellent food. Everything we ordered had a different flavor and was absolutely delicious.","useful":1,"cool":1},"_eFzOD32etbS-2pg8Nxa6g":{"text":"I went here with a group of 6 guys as part of a bachelor party my friend was having in New","useful":0,"cool":0},"ZQGwEW1d36zvQbg1vQvaXQ":{"text":"We love to go to Domenica. Good food,  Good service (Sarah) and reasonably priced. It was ","useful":0,"cool":0},"oSI6KawvYI8RGWHWeG_OxQ":{"text":"Excellent lunch today ,went in for Pizza that is always good but decided to go over the me","useful":1,"cool":1},"Koj7DjfgtyhyC6VVsdVecQ":{"text":"My first real New Orleans meal was at Domenica's Restaurant at the suggestion of a good fr","useful":2,"cool":1},"IPOsd-uKmHBnOQje4gK1kQ":{"text":"Beautiful restaurant, casually elegant.....I tried the Rabbit pasta dish (it was different","useful":1,"cool":0},"_qsxKkegFPiSkWv2gj9NAw":{"text":"Great place.  Amazing White Clam Pizza, Local craft beer, great service.  Our server \"John","useful":0,"cool":0},"QZ65ZVF2Z4BQoruJkZSdCA":{"text":"Loud.  Crowded. Small.  And their lasagne is to real italian food as cheese fries are to a","useful":1,"cool":0},"FRHAUv1n6EhC3-X80-QN7Q":{"text":"Whoa. This place is amazing!!!!!! The polenta was out of this world particularly with the ","useful":0,"cool":1},"6e7jdLpc_Qj7mk2Km_teow":{"text":"Another fun happy hour (2-6 pm) at Dominica. The Old Fashion was great as were the three p","useful":1,"cool":1},"QJSagNrVuh8BeiPpnHvqDA":{"text":"Im the perfect Happy Hour customer...bean counters drool over my weak will. The conversati","useful":3,"cool":3},"3dUjBUG2yewClhvVjwDhYw":{"text":"I came  here for a friend's birthday dinner during happy hour. All pzzas, wine, and cockta","useful":8,"cool":5},"QuNEsvkkPXD5r2umPSBvLA":{"text":"I'm high on food right now. Could not have had a better experience. The cheese board was s","useful":0,"cool":0},"7YTf92a7hchocsqJX1CnQw":{"text":"The Dominica is beautiful. We went on New Year's Day and were able to walk through the Roo","useful":0,"cool":0},"4KOnn-i_entODufrtXk-hQ":{"text":"It's our 5th time here and we've never been disappointed. It's one of our favorite eats.","useful":0,"cool":0},"IuUOLuE6H_ELU_PWMmLsJQ":{"text":"Amazing. I got the grilled cauliflower for an appetizer and the lemon asparagus pizza. Inc","useful":0,"cool":0},"M26KhcxBiv6x9b_C54fMtQ":{"text":"The pizza was better than average, but what will keep me coming back was one of the best l","useful":0,"cool":0},"aA88QncxjUKHM_9aJKh4CA":{"text":"This is one of the best pizzas ever! The salami platter was very good and so was the peppe","useful":0,"cool":0},"yu7mnoWtjf49Z0b8nPVr8Q":{"text":"We adore Domenica; we eat here *every* time we're in NOLA.\n\nHaven't had a bad morsel yet. ","useful":2,"cool":0},"9e0WEg9pqgycUfFpvnzcnQ":{"text":"THE BEST Italian food I've EVER had!!!!! \nAnd jasmine is an INCREDIBLE server!!!!! She was","useful":0,"cool":0},"itHTkeVgTDNyBAdnCEQcUw":{"text":"We loved Domenica! Everything we ordered was so delicious. Service was great too. The squi","useful":0,"cool":0},"aBCEAbajnxsWvuAz4rTOGQ":{"text":"This was absolutely some of the best pasta I have ever had! It was to die for. I ordered t","useful":0,"cool":0},"KaF_jsMBnVhtUSDzCnFc0w":{"text":"One of my favorite must eat places in NOLA. Love the atmosphere. The roasted cauliflower i","useful":0,"cool":0},"uJXoL7X_YUf_qAm0OC9mJA":{"text":"Been a while since I tried dinner and was impressed with the new menu but decided to do th","useful":5,"cool":4},"rkxK3IOVkhmveTQ-sIpHQA":{"text":"Domenica is absolutely awesome. If you're looking to pay maybe a little more than what you","useful":2,"cool":2},"4-eSeeIkc13IQf9pCUKn2w":{"text":"We just moved into the building behind the Roosevelt. A lot of people had been raving abou","useful":1,"cool":1},"KId_-ucVvw7bgf4ixCPXeA":{"text":"fabulous time with our waiter Todd! every recommendation met our expectations.","useful":0,"cool":0},"XuBUCrMHfHVhgyRlfv55fQ":{"text":"LOVED it! I'm still thinking about the fried kale I ordered!  Gosh it was so awesome!  I t","useful":2,"cool":2},"IXFdag81juP3S06qYQTK3w":{"text":"Seriously BEST ITALIAN FOOD I've had in years!!! Like literally, my mouth is watering as I","useful":0,"cool":1},"nF-wGP-nYjA4XXTNEtdjiA":{"text":"Delicious!! This place was pretty good, we got the Margherita pizza which was so nicely th","useful":0,"cool":0},"C6MHAnJNz-z06p3OIKM9UQ":{"text":"A great secret place to go for a wonderful happy hour!  It's from 2:00 p.m. to 6:00 p.m.  ","useful":0,"cool":0},"ffrAsII0HrXbjvc3pbBkFw":{"text":"Great food..Great people..Great drinks..and most importantly great service. Maria, Roslyn ","useful":0,"cool":0},"RS24M2MIwssMagpdkLxYRA":{"text":"My absolute favorite restaurant in New Orleans (sorry Cajun food). For more casual atmosph","useful":0,"cool":0},"ad22frad7POYt2hEAJmcHQ":{"text":"4 stars because I have a chef crush on John Besh. Why? The guy knows how to combine ingred","useful":3,"cool":1},"s5vIxLG9JZqMeVLwCpQyeg":{"text":"Again, another amazing experience. This is my second time here and it did not disappoint. ","useful":1,"cool":1},"PA4uy_TDBvNK8xHPH7yBEQ":{"text":"A watered down version of Macheronic Republic and Colori of LA. The food here is forgetful","useful":4,"cool":0},"pds9phJU-8zPPyXhF4XLlg":{"text":"Very mediocre experience. The hostess was bordering on rude, told us to wait though restau","useful":0,"cool":0},"YbyuHzJ5VzMLvB7bnBKeOA":{"text":"What an incredible night!  The ambiance, food and cocktails were out shined only by the se","useful":1,"cool":0},"0UCV64clQ1A-aBrJfDFf8w":{"text":"This was our favorite meal during our NOLA trip, and the best dish was also the most surpr","useful":0,"cool":0},"r21pEQ4VDUduUsOH271epw":{"text":"Just overall really underwhelmed. The pasta is homemade, but the food really lacked flavor","useful":0,"cool":0},"TSL1LybzMokYFp83HXkU_g":{"text":"Classy atmosphere in a beautiful hotel.  Great food and drink.  1/2 price pizza and beer/w","useful":1,"cool":0},"xjQmajEY6OtXBNUWlOXwOQ":{"text":"A little more intimate spot for Italian food in a hotel, but it is still family friendly. ","useful":0,"cool":1},"_wtJyWnxFtHDVqt2dtmaZw":{"text":"Wo. This place is damn good. No I mean really really good. Like I want to come back to New","useful":2,"cool":1},"r_VXgxVLW5tGa13YjZkllA":{"text":"Absolutely amazing food!  Definitely need to come back here. You need to have a reservatio","useful":0,"cool":0},"8J3A03Coizpbe7xdHahFGg":{"text":"Our experience at Domenica was the greatest during our time in NOLA! the ambiance is great","useful":0,"cool":0},"O77nZk1w-98Mqkd5tcOkeA":{"text":"Great dinner overall when taking service, food and ambiance into account! I highly recomme","useful":0,"cool":0},"ZI0MHbeD0b-LKSdn9NuDdA":{"text":"The best deal going in town. Happy hour with half priced pizza, beer, wine and most drinks","useful":0,"cool":0},"xkOrYmYpgFowMBQUPRe8LA":{"text":"We eat here fairly often.  I especially love the Roasted Cauliflower with hummus!  All of ","useful":0,"cool":0},"J1CtkbbHnTZeEqnCDHQ9ww":{"text":"Such amazing service and ambience. Ordered the chilled asparagus soup, artichoke pizza and","useful":0,"cool":0},"ZSj96cTkzNWZxpTVgSZoiA":{"text":"Nice to go in after crazy times , Christmas New Years insanity,  because everything is rel","useful":2,"cool":1},"JB8oltTkhFWw-ThWotSAjw":{"text":"Isn't it sad how poor service can ruin a restaurant?? Anyway this restaurant was recommend","useful":3,"cool":1},"zILRQLcaDzVKtjNMgdQZxg":{"text":"My boyfriend and I stayed at the Roosevelt over Halloween weekend and although I had reser","useful":0,"cool":0},"CqQ-sqP0apyxm9NpfYHKMQ":{"text":"Whatever you're planning -- PLAN TO STOP HERE!!! Happy hour daily from 2-6. The most incre","useful":0,"cool":0},"DFDoBIN6zigKX_c6d9Xjyw":{"text":"Not good for kids.  Everything is spicy even the olive oil!!! and \"plain\" rigatoni.  No ki","useful":1,"cool":0},"5WvSjggjYYaJck-iXx_CSA":{"text":"My husband usually eats whatever is put in front of him and appreciates it with fairly con","useful":0,"cool":0},"khwImjjqVbEQjRx9eNI37Q":{"text":"I love this restaurant , the food they serve and the people here are great. \n\nThis time, E","useful":0,"cool":1},"uc8bRjFFKKNXxjak5jwrEA":{"text":"The Food Channel  had a segment rating this as the best lasagna in America.  Had to try an","useful":4,"cool":0},"msWedq22ojhnnlUwUwTJeA":{"text":"Awesome customer service from Cory. You made our visit in New Orleans memorable. And of co","useful":1,"cool":0},"qK3Ddsj2MueFy_KMjcHVHw":{"text":"Love this place! Right next door to the Roosevelt for a bite and their happy hour is insan","useful":1,"cool":0},"X_B2kYbGRXREcr3phlBxzA":{"text":"3 star due to the rude hostess we encountered 12/23 during the 2:00 hour. We put our name ","useful":0,"cool":0},"q1rjcfXxrR9KniT94sPMPA":{"text":"Had early dinner that fell during happy hour when pizzas and drinks were discounted. Tried","useful":0,"cool":0},"z4jNG7D8EHKJUKRP5rhJZQ":{"text":"Domenica was indeed a pleasant experience for our party of five, including my 88yr old fat","useful":0,"cool":0},"Rls7IDxWZ_6_HhJYpR0vLw":{"text":"Part of the John Besh restaurant group.  Food was alright, nothing to write home about.  M","useful":0,"cool":0},"Ko662XPuRjkmF1bZUQUVRg":{"text":"I've got to say that this is one of the Top 5 pizzas I've ever had - when it's done right.","useful":0,"cool":0},"36rKTPStKL9EQtYD18yu6A":{"text":"I had seen pictures of Domenica on friends instagram accounts and it quickly found itself ","useful":1,"cool":1},"CIS9ZK1EKT2mYLTaqx4LvA":{"text":"We had a pizza with very (too) spicy salami and the lasagna. Atmosphere was upscale trendy","useful":1,"cool":0},"ujKTKq82FgYXRqWiqwFYYA":{"text":"Great italian fare, a gem in NOLA","useful":0,"cool":0},"k64p51UNAmU_qBNeiKU1rg":{"text":"Walked in without reservations and was seated in one minute.\nWater and very friendly serve","useful":1,"cool":1},"UjO_eZ93zxxUMXtzR0KGPQ":{"text":"My favorite thing on the menu was the rabbit tagliatelle ... my god it was soooo good. Ten","useful":1,"cool":1},"wLpzsxhJsDPUwmaT_DWzrA":{"text":"As a local I have to say I have always been very happy with the many dinners and lunches I","useful":0,"cool":0},"8GE3fs2ny4MkofDxzk-UsA":{"text":"Jasmine is a great waitress and made wonderful recommendations.  Truly enjoyed our dining ","useful":0,"cool":0},"ScLAD2cr1ogf-_5bj32qeQ":{"text":"Eh. Food wasn't bad but the service wasn't good. Took forever to get our order placed and ","useful":0,"cool":0},"OAVPte598yjhvItJTj3CUA":{"text":"I came here because this is John freaking Besh's restaurant, and it was conveniently locat","useful":2,"cool":2},"3Vjosyj2OgDQg0HxR8BgKg":{"text":"family style for 6 adults\n\ntartufo (my absolute favorite...creamy and light and perfect sa","useful":1,"cool":0},"af6O51uzYAF6zE3VwdjvMA":{"text":"We had a WONDERFUL dinner here tonight.  We were visiting from Detroit and of course not m","useful":1,"cool":0},"5U6Bp2wkjpQsyt6vL3w5mQ":{"text":"OMG, probably the best pizza I have had.  And for the price WOW, what a deal.  3 pizzas, r","useful":0,"cool":0},"HWjRlLr5VxM0b_P76PqCiw":{"text":"Great place. We're new to town, saw this restaurant and tried it. Food was delicious, staf","useful":0,"cool":0},"CeoBVu4d6ybTEj8KOnLUMw":{"text":"This was my second time visiting this hidden gem in the crescent city. You are able to ord","useful":1,"cool":0},"kudrfSjNfRR1mP55_zjwlQ":{"text":"In a quick trip to New Orleans we stumbled upon Domenica's looking for late night real ita","useful":0,"cool":1},"6EKoyd0-iKEI1tcUAROCfw":{"text":"Wuuaaa!! Super delicious  the food, the atención  % good in my visité to New Orleans, I co","useful":0,"cool":0},"KxLqsBtL2uHcAx_oNsHwJQ":{"text":"Easily my best meal in NOLA and it was just for happy hour. A friend had mentioned that pi","useful":1,"cool":1},"VdRmoWT1NYOoGq0N_4c9ng":{"text":"Unpopular opinion: pizzas are nothing special. The eggplant pizza was so soggy I needed a ","useful":2,"cool":0},"R4PrPdMZx3ApKPSmqHY21A":{"text":"Worst restaurant in NOLA in my humble opinion. Pasta was hard (crispy!), overly salty or g","useful":0,"cool":0},"9tIsjvYLHnT_OPBq5vm7og":{"text":"I was very impressed with this place!!  We are from LA in town for four days and we could ","useful":0,"cool":0},"rTbPuMogUhk9UH_12HtWkw":{"text":"I generally don't know what to expect in hotel bars.  Someone on the airport recommended D","useful":0,"cool":0},"u1Zs0SydXE8JnoYH5OJL7g":{"text":"Unfortunately very poor service and unprofessional.  Food is good, cheese plate is definit","useful":0,"cool":0},"dlb4YsYjiLcPS9WssR4iIg":{"text":"The roasted cauliflower was incredible as was pretty much everything else we ate at Domeni","useful":2,"cool":0},"Fv3IswGc8QypIjsAFZdR3g":{"text":"We were staying in the Roosevelt hotel over Valentine's Day weekend. This place is attache","useful":2,"cool":2},"q4t1VZyNqo-Aofur7tw30g":{"text":"First off parking is a bich! It is so hard to find parking around here. You will have to s","useful":1,"cool":2},"v-zqxAY-7hfvmiyy5OlBsg":{"text":"I went for thanksgiving lunch and the food was on point! The staff was also very nice and ","useful":0,"cool":0},"aoklaxMOSRdbgIB7u1cZsw":{"text":"As a local and a chef I have been very pleased the 4-5 times I have gone to Domencia. The ","useful":1,"cool":0},"uQsih2LcfwxpHxFqFvy_hA":{"text":"THE BEST HAPPY HOUR!! Draft beers, cocktails, and pizzas were all half off. The place is v","useful":0,"cool":0},"Xyw7VkZlQ6pwqGcPMiw7tw":{"text":"Happy Hour Pefection! All my other favorites now get bumped down the list because Domenica","useful":2,"cool":2},"sLerXBm_L80RMFPThnRyMQ":{"text":"This place serves best italian in town. This restaurant is inside the hotel and a little d","useful":0,"cool":0},"8seAT_GisJU642xpfk5yhg":{"text":"We went to Domenica on 11/02/15 for dinner.  We made reservations and arrived a few minute","useful":0,"cool":0},"6LT7Ti7T2UaApAdNJSda5Q":{"text":"Excellent lunch today started with the smoked veal pizza with just the correct proportions","useful":0,"cool":0},"_rsUuUp-Lu6f9AtKExWMdg":{"text":"Located inside the Roosevelt hotel, a historic place to visit and enjoy the lobby especial","useful":1,"cool":1},"UBrzptoV77KGSE1-VCT_gg":{"text":"This should be 5 stars. Easily. Went to Domenica a few weeks ago for happy hour. Sat at th","useful":4,"cool":1},"isW6FFiFco4ub2X0_KknHQ":{"text":"Wife and I ordered food and the server brought me something I didn't order and she gave me","useful":0,"cool":0},"5YBpBfagJYmj55iXdLCSTA":{"text":"All I can say is wow.  There is nothing wrong here.  The best staff ever.  The food to die","useful":0,"cool":0},"CiGcTOMfKNGMG8jXz5igZw":{"text":"Man, New Orleans has a killer restaurant scene in its hotels.\n\nDomenica offers up some exc","useful":2,"cool":1},"rg2lVhlnefJnq1gYQG6qcw":{"text":"Went for happy hour- it was awesome! Half price pizzas and beer. We had the white pizza an","useful":0,"cool":0},"qxzZYiVOeKPjvSnsi7zEEA":{"text":"I ordered takeout while staying at the Waldorf. The food was ready on time, although it wa","useful":0,"cool":0},"7M4UrbYUO4cz22C8SnVKPg":{"text":"This place was absolutely amazing. 5 stars all around. From the second we walked in, the h","useful":3,"cool":1},"dTPF95jeeJlQPafIlt_ltw":{"text":"Waiting til flesh falls off my bones for service here.  That would be fine if they were ac","useful":0,"cool":0},"JSpEbcXffl_T3rNuYm7u5Q":{"text":"I have never in my life done a YELP review and I have eaten in thousands of restaurants of","useful":0,"cool":0},"rtW-AymqUXLAg08n7zO2Ug":{"text":"Sexy atmosphere with a laid back, less formal vibe for dinner than expected with great foo","useful":15,"cool":11},"rLE7f2PxIx729lUN3X9Hlg":{"text":"2nd time here- I sat in the bar and a colleague met me here for dinner.  She wanted the la","useful":0,"cool":0},"uFCt4ogoBWBrsKdQu94t_A":{"text":"Dinner was superb; service was not.\n\nTo not bore you with the details. Here's what happene","useful":1,"cool":0},"OEtkOeU_AUtpC84r2CD1Pg":{"text":"The best Italian pizza ya can get in New Orleans. Great happy hour, great service, great w","useful":0,"cool":0},"iCxIYebp1Jyimn5-UhNSHA":{"text":"Do not order delivery through Yelp or Grubhub. There is no partnership per restaurant. Piz","useful":0,"cool":0},"kESu-LhCbGiVM_L5wEAa2Q":{"text":"I've eaten here three times and gotten take out from them countless times. The food is gre","useful":0,"cool":0},"Abihxz_xAlVBKPzfJ8kG4g":{"text":"I had lunch here and definitely would return.  The fried goat cheese stuffed squash blosso","useful":0,"cool":0},"wqZ5nsElXA2TZV7C90vvvQ":{"text":"THE LASAGNA IS BIG ENOUGH FOR THREE PEOPLE! Plan to SPLIT PLATES! Please, for the love of ","useful":0,"cool":0},"GmF0353GFlbcT9ecvmyGJw":{"text":"Very disappointed last night for dinner, although food was good, instead of a dinner menu ","useful":0,"cool":0},"CNFGs93DDjc-H7tUBY6fhg":{"text":"I had been wanting to try this place for a while and it did not disappoint! \n\nTo start we ","useful":1,"cool":1},"FZFzvdFvohMIHCA7VkjZ9w":{"text":"Had dinner with friends while visiting New Orleans.  The restaurant is on the loud side.  ","useful":1,"cool":0},"G06Ol5hZbSNQ74_etJkngw":{"text":"Great restaurant in the CBD! While I have only been for happy hour, I keep coming back for","useful":3,"cool":0},"bHHMxvRQozkCsd8F2pkiGg":{"text":"I was told they do a half price pizza during happy hour which would be a good choice. Pizz","useful":2,"cool":5},"_IhL6ArWsInl_sUGtnxY_g":{"text":"This restaurant is amazing. A-MAZE-ING!!!!! This was one of my favorite meals of my entire","useful":2,"cool":3},"nYqUR5Cq36kud5000cpG1A":{"text":"A good place to go if you like interesting pizza, very thin crust with different toppings ","useful":1,"cool":1},"PYHjka-awP31C_yCq11mMw":{"text":"The service was terrible. \nWe had a great sit down dinner and wanted to take a pizza to go","useful":1,"cool":0},"JCcHc0gdWlMDReirJvRMiQ":{"text":"Great lunch crispy Veal Tongue with peach salad then warm peach cake with blueberries and ","useful":0,"cool":0},"nOhcvXf5D8ZZzFK3VgQCJg":{"text":"My God, I am a John Besh believer. Having been to August before, when a co-worker picked D","useful":2,"cool":1},"fFsGXLchu5yudiqj3U9hnw":{"text":"Loved the roasted cauliflower and I'm not a fan of Roasted Cauliflower.  The goat cheese m","useful":4,"cool":4},"0wnVboNkgWkZcGoFc2sbXw":{"text":"Delicious food and excellent service! We really enjoyed the Blueberry Torta for dessert!","useful":1,"cool":0},"ZkXlFiPH0pouLcW5FVGlKA":{"text":"Went here with my wife looking for a break from the Creole/Cajun food we had eaten all wee","useful":2,"cool":0},"Gd5Vzz4cjdBXDJ_MmQa5oA":{"text":"On my first trip to New Orleans, we chose this restaurant because of its excellent reviews","useful":0,"cool":0},"G16TCJiug4O7NOuKhIJHjg":{"text":"LOVE this restaurant! This time we had Crispy Sweetbreads with Bagna Cauda and great risot","useful":1,"cool":1},"iMWXECx4-hyN5d4hbMbupw":{"text":"Have been to this establishment multiple times and I will definitely be returning. Happy h","useful":1,"cool":0},"5mRvp7OtJ4olnEyPOuwyRQ":{"text":"Can't complain much!!! Haven't been in a while but it was a busy sat night & we came in fo","useful":0,"cool":1},"3Bl5rK48a7rVS3vt9DKU3Q":{"text":"We stopped by Domenica during happy hour and enjoyed their pizzas immensely! We sat in the","useful":0,"cool":0},"qnoynNQJVzGb64WCtF4fZQ":{"text":"Came here for a nice dinner with the in laws and we couldn't be happier with how delicious","useful":1,"cool":1},"A7pyEhj2wexrzon34GkC1w":{"text":"On a whim we decided to go to the Roosevelt for date night. We didn't have a reservation a","useful":3,"cool":1},"On_fEhO2FekkWy41p3CPRg":{"text":"Like everyone else, we LOVE the happy hour deals here! 3-6pm EVERYday!\n1/2 priced wine, 1/","useful":4,"cool":3},"jYHbl-SS7LDUbhZBdLRSyQ":{"text":"We went after the St Patrick's parade, as soon as we walked in we were given dirty looks b","useful":0,"cool":0},"xCEAUvvdlTjkzQTCrt4fHQ":{"text":"Domenica is one of my favorite places for pizza/flatbreads in the city. Oh, and FRIED KALE","useful":1,"cool":0},"RMj1bV3ymknuM4IFeOuQqw":{"text":"We make a habit of coming to Dominica every trip we make to New Orleans and it is always w","useful":0,"cool":0},"VqlhtaZakxR_m23Nr0JY6w":{"text":"Guess we were the lucky ones on a New Year's Day to be placed in a corner, wait 15 min for","useful":1,"cool":0},"xr8GniuyBmTff8gJdTqQsg":{"text":"I went here for lunch on a weekday and was able to order off their happy hour menu. They h","useful":1,"cool":0},"h5y8uWZBM6ZbfYUxs6QF_A":{"text":"Unreal meal for lunch - the Roosevelt has to be seen during Christmas, and this meal was t","useful":0,"cool":0},"6XjTS9CHwIz7ayme7yMDyA":{"text":"Updating my review: this place has great management, and strives to make the customer expe","useful":3,"cool":2},"YlaDGlGsTXV_yhLyC2pAjQ":{"text":"Always heard great things about Domenica and I've to say, they definitely lived up its rep","useful":0,"cool":1},"jOYcWAWHBLm_b0k4tnr1Tw":{"text":"This place is amazing! The squid ink spaghetti is a must try!!! It was topped with crab me","useful":1,"cool":1},"8_rlsR2IRFfRmq0GjLa07A":{"text":"Awesome appetizers, lasagna and risotto. We were served limoncello after dinner and a deli","useful":0,"cool":0},"JGsOg2431elo2UctheXUvg":{"text":"Domenica was attached to my hotel, so I went there the first night because it was close.  ","useful":0,"cool":0},"XxSlJw3_q6-e4hgRILJ3TA":{"text":"Was in town for the after Christmas break with my family, including two 10yr olds.  Domeni","useful":1,"cool":2},"-YZhdYZWdHOr5dm9suC9Tw":{"text":"Food was really good. The two female bartenders were the most depressing, sad and unfriend","useful":0,"cool":0},"HtWCDNsUpZdqdyedTZ2mqw":{"text":"Even on a Wednesday at 4:30, we received polite and attentive service. We all felt very ac","useful":0,"cool":0},"7gEFSva2qjg6ZziN6nIe_Q":{"text":"Though we want to give this place a try after having too many Cajun and southern foods. Th","useful":0,"cool":0},"eH_e6lcRtmL46I7BsRR4iw":{"text":"Was unsure about the price point and the quality considering it's so close to Bourbon St a","useful":0,"cool":0},"leyYUrRPgGNux0lEUDy-8Q":{"text":"Yelp made this happen for us!\n\nMy friends and I decided to go here for 2 reasons. 1. It ha","useful":2,"cool":2},"4lj2GAHpOrSc23GBISNo_g":{"text":"I have visited Domenica twice and I have had a great experience both times. The first time","useful":0,"cool":1},"00ITcHtOYuGqKKhbFYOuIw":{"text":"Awful customer service by front of the house staff. Rude and short with an attitude when r","useful":0,"cool":0},"Iki4hEZXdtwllZhXkPKtGw":{"text":"I don't miss this spot when I am in New Orleans.  It is beautiful and clean and simply del","useful":0,"cool":0},"dSUFzWdHSmgfNVK_hCVo5A":{"text":"Been a while but went for lunch yesterday afternoon and was very happy I did. Service was ","useful":1,"cool":0},"2KSkXBkmmrwYg_phayGlEg":{"text":"Great spot! Lasagna was to die for, service was spectacular and atmosphere was perfect!","useful":0,"cool":0},"j2fs9tlAZGJVAm00IyXhzA":{"text":"Honestly, this is a must visit restaurant.  Everything we ate was divine.  Handmade rigato","useful":0,"cool":0},"DPKO3KaX5yXH4fBUHZuD5Q":{"text":"I can't say I was impressed with this place. It shares walls with a upscale Hotel which pr","useful":0,"cool":0},"-4rwBxPLM5E96B3wJ8DdzQ":{"text":"Weekend Brunch is new, about 3 weeks, and worth checking out.  Most of the menu stayed wit","useful":5,"cool":3},"Lc0LyBalnKarRoE57lbNcw":{"text":"Dinner at Domenica was wonderful! As a group of five we ordered a few different dishes and","useful":0,"cool":0},"81p1GtSa6fth4opkTmrdcA":{"text":"Nice italian restaurant. Fast service. Good food. Nice decoration. Close french quarter. W","useful":0,"cool":0},"sH3TnTW7mQ93ytt-RUmlRg":{"text":"Located in the Roosevelt hotel this Italian eatery is blocks away from the hustle of the F","useful":3,"cool":1},"3S-Nj4zNk8RKP2Jtms6ZHQ":{"text":"Paid for an Uber to go from The Ritz to Domenica last night.  Saturday 12/19. We were very","useful":0,"cool":0},"CR-QYpvUWunr1ZfCMlGgtw":{"text":"Initial Encounter was a 5 star experience take out experience.\n\n2nd encounter was strange,","useful":0,"cool":0},"b6W_Wfun6tnAOIdIhicE3g":{"text":"happy hour everyday from 2-6 PM!!! that's perfect time for lunch or an early dinner. it's ","useful":1,"cool":2},"sViw85iFtSNyM0q8zrk97w":{"text":"Roasted pork pizza amazing! And squid ink tagilolino Loved it.  Service was great!.  I wou","useful":1,"cool":1},"ZZkThKuLlMzzf9k2Bkb8JQ":{"text":"New Orleans has many great restaurants and Domenica is another to add to the list. A large","useful":0,"cool":1},"hG1qT-Rn9ItYXQLfk0eX0w":{"text":"One star is for service. Food is really good do we went back for second time.  We were gre","useful":2,"cool":0},"aAEnA69Fyl1WVZof-XK_YQ":{"text":"Haven't has time in a while but last Wednesday again had dinner, and again wasn't disappoi","useful":0,"cool":0},"zfcNoyeqlGv-UA9C4JSv5g":{"text":"Overall: not a great experience due to long wait, disappointing taste of food; service was","useful":1,"cool":0},"QKKwCCNnbuKPlRKHiOdR3A":{"text":"I can't speak for anything but their pizzas which I've had twice.  They are so stingy with","useful":1,"cool":0},"UnYb0VT0r1sw0gjtoX19Hg":{"text":"The staff was friendly and the restaurant was beautiful. Fun chandeliers, a beautiful lobb","useful":2,"cool":1},"bMw_9BHPTG_3aqX5fOknVw":{"text":"Very good lunch special today that hope they put on menu.  Started with Compastella farm g","useful":1,"cool":1},"mZk7lgu2O0NNvNzyRQICbQ":{"text":"Dear classy-but-not-pretentious visitor of New Orleans,\n\nHere's my recipe for a fantastic ","useful":0,"cool":0},"NqeU1IFVV8zuAxwsu84-gw":{"text":"We will definitely be returning to Domenica!  Service was above and beyond and the food wa","useful":0,"cool":0},"oAJmFTMK0F--a1myjmB0yQ":{"text":"Yum. Pizza and lambrusco! And just down from the Sazerac Bar. And in our hotel. Yes, thank","useful":1,"cool":1},"2W9z_qkwlhDAC7a7hJ_Sgw":{"text":"My husband raves about this place because he frequents NOLA for work. It seemed dark, priv","useful":3,"cool":3},"jNrEdCMwQi3f-iBy0lmSLA":{"text":"Great place for pizza and veggies! First visit - staff was friendly and food was good. Rec","useful":0,"cool":1},"Sry_GOqnZ7vUrNla4y9fdw":{"text":"My favorite restaurant in the city. \n\nHighlights:\n\nItalian wine selection. \n\nPizza Happy H","useful":2,"cool":0},"wdjp0c3PlLrztV-opggK2Q":{"text":"I've always enjoyed coming to Domenica for a bite and have had a few different experiences","useful":21,"cool":12},"5T-6jxMEZPzQ_V8Tj0swOg":{"text":"My son and I were lucky enough to find Domenica's during a brief stay in New Orleans. The ","useful":1,"cool":0},"j5zDmx0OB91HxifYzKScVw":{"text":"We were staying at the Roosevelt hotel and decided to come here for dinner. We were sat at","useful":0,"cool":0},"YEK-AsD-2OeC8ZajvJK1sw":{"text":"My husband and I were walking around and looking for something nice to share and happened ","useful":0,"cool":0},"ZWRgLShNpeNinarE1LmYhQ":{"text":"Great Neapolitan Italian food, fresh vibrant environment and personally charming and carin","useful":1,"cool":1},"t6pUwakmhcyrcJCUiQP0dw":{"text":"My favorite restaurant while visiting New Orleans. My friends and I ate here 4 out of 5 da","useful":0,"cool":0},"d_S-sCvsT5yq11veLDNSmw":{"text":"Pretty good!! We came in on a whim and were overall pleased with the experience. Their hap","useful":0,"cool":0},"qu7UFIcMnNHKkAH5RC-dlA":{"text":"When my move from New York to New Orleans was impending, I was terrified of missing the pi","useful":5,"cool":4},"dJvq_b_GfDCEPSbUOEntQg":{"text":"5 stars well deserved for this spot! This restaurant is located in a hotel and had a reall","useful":0,"cool":0},"iU5oXfb6MOUlxgR19JwmkQ":{"text":"We were craving pizza and this place was excellent! The waitress was attentive and helped ","useful":0,"cool":0},"NN48mL4cK5_hWu9u_1Fo_Q":{"text":"This is an outstanding and charming restaurant.  Our waiter had the lasagna split for us p","useful":0,"cool":0},"CCXeCi0F9nTJmGyHzJMOzQ":{"text":"Domencia is a really cute Italian restaurant inside of the Roosevelt Hotel. The design is ","useful":16,"cool":14},"kHFgOxAinxqdzymEXIvZAQ":{"text":"Awesome restaurant! We went so that we could see the lobby of the Roosevelt since it is so","useful":3,"cool":2},"RVLlGqxBtlGyYqXLoF3CEQ":{"text":"Came here to celebrate my birthday with my boyfriend and sister on a Friday night and we w","useful":0,"cool":1},"U3oW6fWlPg1-fl89bHLDKg":{"text":"I travel to New Orleans quite often and this is one of my favorite places to dine while he","useful":0,"cool":0},"fHzfecrBmx35fuhu7kLUcg":{"text":"Okay, so we are in Phase 1, I get it, but being in the absolute back of the house with a r","useful":0,"cool":0},"fG-ic8d7XBXfn-e6kpZcnA":{"text":"Delicious!!  New Orleans is known for amazing food but would you think of Italian in New O","useful":0,"cool":1},"YdMGe8h9EOM67NQpX1euiQ":{"text":"The place is pleasant and the food excellent and at reasonable prices. The service we rece","useful":2,"cool":2},"PTdady34XfIrx55giD2DpQ":{"text":"This place was a perfect mix of fine dining and casual. The only complaint that I had was ","useful":0,"cool":0},"2eZavmlyto7Krr_KeUIrsw":{"text":"If you go anywhere for happy hour in New Orleans go to Dominica!! All their pizzas, glass ","useful":3,"cool":4},"Wh_L7by-bgtdZPHqajVbpg":{"text":"Domenica has decent pizza in the city when you are looking for a change from the usual New","useful":0,"cool":0},"PTzjzUSfw_mC_WrKD106_g":{"text":"Was judged from the get, was told they had a table and it'll only be a few minutes then 30","useful":0,"cool":0},"912f2WkO32rIvSgivQTELw":{"text":"I've never felt so honored to be part of the \"chef club\" as I did tonight at Domenica! Che","useful":0,"cool":2},"m5iUFOPiUf_azGJOEH1ZKg":{"text":"4.5 Stars.\n\nHell yes!  This was some great pizza!  I was going to venture out to get some ","useful":4,"cool":4},"UgHfsOZALORovCOdvYhyMg":{"text":"Fabulous food and service. I came with a friend tonight. I had the lasagna which was satis","useful":1,"cool":1},"9-yATabNwHT9JOB5QCUadw":{"text":"My girlfriend and I had a great dinner here.  We shared shrimp risotto and a meatball pizz","useful":0,"cool":0},"VLA_vIr5EwnHEYLobShg4Q":{"text":"We love this place for a date night. The lasagna & truffle agnolotti tasted so good. A lot","useful":0,"cool":0},"zTVitrx_cR-ZN0oI6LS2DA":{"text":"Decided to try based on Yelp reviews. What a great dining experience server! Gerard, our s","useful":0,"cool":0},"O0IHcG_qhVOCW7Sl1U_9bQ":{"text":"Love it here.. Such a nice atmosphere.. Our service was awesome!  Mushroom pizza was my fa","useful":0,"cool":0},"qnIe0voVm3xJ7Vm7qiRwFw":{"text":"Excellent service. Knowledgeable and accommodating staff - especially for a kid who wanted","useful":0,"cool":0},"dREyy3E6oGqR7lFu2vs-fA":{"text":"Absolutely wonderful! I had the wild mushroom pizza and nearly ate the whole thing! The eg","useful":1,"cool":0},"-w8KTQpn8HNCSe0HrA9Orw":{"text":"The restaurant itself was very pleasant, but the food seemed to be hit or miss depending o","useful":0,"cool":0},"Sahd2R-frsKKEgpcK_uDcg":{"text":"Must try if you're in the mood for Italian! Our friends ordered the meatballs and they wer","useful":1,"cool":2},"MpEh2ovRYHZF53LKpl5BwQ":{"text":"We love stopping by Domenica for an early dinner / Happy Hour. We love sitting at the bar ","useful":0,"cool":0},"SIiWZlHYtWvxSOTjCrm8aA":{"text":"After running through New Orleans in pouring rain, we were finally arrived at Domenica. Wa","useful":0,"cool":0},"GrUI5zzasZbtJXlj6QCwdg":{"text":"Stumbled upon this place while searching for good places to eat...what an awesome accident","useful":0,"cool":0},"hJgWDiQMAVLhgb21wEqr0Q":{"text":"Domenica is a good place to come to during happy hour. It is good time when their pizzas a","useful":7,"cool":4},"Ljull5fGtfKxlcpJtHx20w":{"text":"Basically the clam pizza deserves 10stars. I have never had such a unique pizza. However t","useful":0,"cool":0},"SpMivNnyaHGXpBLIwx4nEg":{"text":"I went to lunch on Saturday, May 13, with a group of 7.  Our waiter was mostly unattentive","useful":0,"cool":0},"BuXI3UJSFPpraHYu3eRYXw":{"text":"We walked in, no reservations, and they were very helpful in getting us a table.  We had t","useful":0,"cool":0},"fYDghM-Pr_8ZJPK2dWT5qA":{"text":"Me and BAE enjoyed a nice dinner at Domenica. It was the first time for both of us. We wer","useful":11,"cool":7},"jyPWWBOwL9cXDiYtG7Psxg":{"text":"First time last night. Really enjoyed the food and experience. Friendly and knowledgable s","useful":1,"cool":1},"D7jt4Q0EvhhKDiTSM_wOyQ":{"text":"Terrible food, terrible service.  Our waiter brought us burned bread.  When I asked for so","useful":0,"cool":0},"KA_Qfwl2j-JjL4nv3hvr6w":{"text":"People..I'm old and been to many countries including Italy.. this pizza here is the best I","useful":0,"cool":0},"oKZCrsF9tIKixw4200887w":{"text":"The best meal we had in New Orleans. The chef David Taylor, the Manager Vivian, and our se","useful":0,"cool":0},"s_Kg1kFspQ_vPLIO9RGOwA":{"text":"Amazing.  Food, service and bar are all phenomenal.  I had the roasted delicata squash and","useful":0,"cool":0},"-bnerxGhp5kS8tvujNglXA":{"text":"Domenica has slipped a few notches since the days in which it was run under Besh Group man","useful":4,"cool":0},"igo2RIWv-BBncEzxZX2EAg":{"text":"we had domenica on our radar but were on the fence about coming here because we had so man","useful":6,"cool":6},"SU4EFVdmwwlERH8X8GR9Kw":{"text":"We were staying in The Roosevelt for the weekend so we decided to give Dominca a try. \n\nWe","useful":2,"cool":0},"cbDtrdEK99ngVI1qFkKgeQ":{"text":"Eat here! This restaurant was such a pleasant surprise for us! We had a difficult time fin","useful":0,"cool":0},"qMOtOc5RSSs4lxeav0YSgw":{"text":"We happened to show up at happy hour from 2-6 (lucky us)! The pizza was yummy, and half-of","useful":0,"cool":1},"KUUmRa32P0mhTq_U8rBZIQ":{"text":"I was happy to find Domenica, after an evening of strikeouts with other restaurants that w","useful":1,"cool":1},"F2369zusGlSknhPDAuawIA":{"text":"The moment you walk in it is absolutely packed. The wait was 40 minutes but once we were s","useful":1,"cool":0},"J_pPQpqal6cVrV-erjfh_w":{"text":"One of my favourite spots for Italian fare in the city!! This place has served me well for","useful":1,"cool":1},"4GkXu4rROl6nvesPH51-YA":{"text":"Had one of my best food experiences here! \nI was in town for business, but hate eating alo","useful":2,"cool":1},"4FCUo4wQ9F4vtaU-OzFD_w":{"text":"My husband and I had our anniversary luncheon at this restaurant today. I ordered rigatoni","useful":0,"cool":0},"Evhn28eQtyGEoCKLWIA6vQ":{"text":"Domenica is a breath of fresh air in a city where every menu tends to have the same zillio","useful":1,"cool":0},"vdfNt_squ472x_YRXotq7w":{"text":"Literally walked from bourbon to have dinner here. Yes. Yes we did. Haha. My girlfriend an","useful":1,"cool":0},"ozkB_Cg_m_F5TLUW4wQX7g":{"text":"LOVED our time here. I HIGHLY suggest you get a bottle of wine, I absolutely loved ours (l","useful":0,"cool":0},"Hm__r0muHHONkjgEotc48w":{"text":"First of all, the location is in a very nice hotel. Which certainly made me feel like a sc","useful":5,"cool":6},"QzkLvlKWNz0EOB5QwnPg2A":{"text":"Very good and caters well to a gluten free diet. Great service too. Highly recommended!","useful":0,"cool":0},"9JWMwBEHZZaVvwr7BIxYAg":{"text":"This place is a must for happy hour. Half off pizzas and select drinks - you really can't ","useful":1,"cool":0},"sKdljIqEMc62ekC-RZCnlw":{"text":"Domenica stands the test of time.  Ten years, and dozens of visits later, it's still as se","useful":18,"cool":18},"Ykd2EKVfmA22ngTBMdHc4A":{"text":"Stopped into Domenica at 4:10 for happy hour that runs till 5pm. I noted 8-10 tables at th","useful":1,"cool":0},"Y-6psQRam2ttGOXntV_XcQ":{"text":"Food was DELICIOUS!! So many great vegetarian options too!! The cauliflower was cooked to ","useful":0,"cool":0},"QIhnP1NSEP3MBuf1QocBWg":{"text":"Best pizza place with a sort of formal environment - formal, at least as far as service - ","useful":5,"cool":2},"Zw8KcmZxyN1VcKq_XcvT4Q":{"text":"We started with the cauliflower as an appetizer. Yummy! Nice wine selection by the glass. ","useful":0,"cool":0},"kOHhTM5fQ-WsFWfH4inBHQ":{"text":"It has a nice decor, the waitress was knowledgeable of the menu and very attentive. The Me","useful":0,"cool":0},"mLgdvXezdFipAYZAKpFaWg":{"text":"When was the last time you had a meal so good you had to keep closing your eyes to savor t","useful":0,"cool":0},"BeWYKI5RoTYNpqWjC6EwVA":{"text":"Located near Bourbon Street, parking was easy to locate and available partly due to most p","useful":1,"cool":0},"4O4UhGoEvJRyNBTpNooAMw":{"text":"We really enjoyed the pizza more than the entrees. We had Squid ink pasta with blue crab, ","useful":2,"cool":3},"sPgPNOlJxlykJBGCLHDy4A":{"text":"TLDR; NO.  \nGroup of 5 greatly disappointed by the service and the food.  Domenica came re","useful":1,"cool":0},"w93f3Qtwv4VFZaPg6-O8LA":{"text":"There is something totally sacreligious about what I'm going to say here buuuutttttt...\n\nD","useful":1,"cool":0},"79zofY2kjTsfpjcYJY0slw":{"text":"SEVEN REASONS WHY THE DAILY 3-6 PM HAPPY HOUR IS SO POPULAR AT DOMENICA:\n\n1)  The pizzas a","useful":13,"cool":10},"spXeT7h0dW9S0jF5IN2z2Q":{"text":"Coming to eat at Domenica is super convenient when staying at The Roosevelt. Our first vis","useful":0,"cool":0},"Kyd697XPz_y5tyr4eO8dNg":{"text":"Love the look, drinks were great, appetizers were amazing, but I wasn't very impressed by ","useful":4,"cool":5},"V2OAgObiA-0B4YF-zNO_wA":{"text":"I was looking forward to coming here after reading so many positive yelp reviews. I called","useful":2,"cool":0},"gxuzsmTRac92YNdA8IH8vA":{"text":"Small portions for the price.  The marinara sauce was lacking flavor.  Had to ask for grat","useful":1,"cool":0},"YuW7nGYmGrcfO5YQ5SQGcA":{"text":"The waiter was very helpful in recommending wine the food was delicious and the small port","useful":0,"cool":0},"lJn-Dzv58fnhqy_HAXMcLg":{"text":"HAPPY HOUR is king here. Wine and amazing pizza! What more could your want? The male barte","useful":0,"cool":0},"acpEJ3OE2bIKho8twc9OoA":{"text":"A few weeks back my friend and I decided to eat at Domenica. He recommended this place due","useful":2,"cool":0},"zo4melzlXF7i4PrPfM7amg":{"text":"I want to say Domenica is one of my favorite places to go - and I have done so many times.","useful":1,"cool":0},"dbumy3FTuWyPB3PnnRSFDg":{"text":"So someone tells you about another neighborhood pizza place/Italian restaurant. You think,","useful":3,"cool":4},"jEtdoJTPJwzvtodvn4om3A":{"text":"One of the most incredible Italian restaurants EVER!\nAs many of you know already I kind of","useful":1,"cool":1},"VdMEz2qzMHyKLfmBEU1Z0Q":{"text":"We've been regular guests to Domenica for years! And it's always been consistently great p","useful":0,"cool":0},"cT0np9iq7-POsl3O_jbksg":{"text":"We chose this restaurant for a Christmas lunch based on good reviews and an interesting me","useful":0,"cool":0},"N9ppiZdMxhmsIKxrCtr9sQ":{"text":"My husband and I both enjoyed our meal here. The order got mixed up with our main dishes a","useful":0,"cool":0},"h7_vIqB-0UxFh4QsQCfOdw":{"text":"I highly suggest going to Domenica. \nThe service is amazing and they also wear mask and so","useful":1,"cool":1},"y8xSu7PvR4br3F_jw9pqqQ":{"text":"Domenica is a place I have been more times than I can count, yet have somehow never review","useful":2,"cool":1},"RW17hX18PkxxciYWvPpUPA":{"text":"Well where do I start! It was our first night in New Orleans and we went to Domenica becau","useful":1,"cool":0},"ockaJ4BPaSnP7-oHhlUt3w":{"text":"Domenica serves up a fantastic happy hour, that's for sure. My friend and I decided to att","useful":2,"cool":1},"wrrqn73JpAthgI5q43UY-g":{"text":"Never actually had a chance to try it because the racist and condescending host that did n","useful":0,"cool":0},"d3bwN_j1q7wm8sEGBDAiEA":{"text":"I LOVE DOMENICA! Such a great Italian restaurant with delicious combos. The pizza is light","useful":1,"cool":1},"UFToqBgxdi7dHb_3JV8_UA":{"text":"I got the bucatini, and it was amazing!!! The pasta is house made and cooked to al dente. ","useful":0,"cool":0},"AgJchxtGsiDWyPKEv62xcQ":{"text":"Squash blossoms were amazing. I didn't want to share. Pizza was tasty. Seafood risotto was","useful":0,"cool":0},"eKW7XO6Qnb-UOIznL1thsw":{"text":"The pizza. The bubbly crust, chewy center, fresh tomato sauce pizza. Wow.\nBut before I rav","useful":0,"cool":1},"pJ6pYoBk_BFqBoQ0PLJYxg":{"text":"The place we delicious! It's a super ritzy looking restaurant and when I looked at the men","useful":0,"cool":0},"3tsZo3achq1BP404U5pvZA":{"text":"We are currently staying at The Roosevelt hotel and we came to this restaurant because we ","useful":0,"cool":0},"5HmR42ymiHcewiQIlngLoQ":{"text":"Great food and fantastic service! We ducked in here for lunch when it started raining and ","useful":2,"cool":1},"mPrZbuGS-0mGW8hdNJb3rw":{"text":"It was great! I don't eat seafood so it was nice to find a great place to eat that offers ","useful":0,"cool":0},"VPWonawTDrx4fiXflPfXBA":{"text":"Still great, but down a star for cutting back on what was one of the best Happy Hour deals","useful":2,"cool":1},"-iAuIzBXb-4gz38u_zHiPA":{"text":"Love that this place is in the Roosevelt-seeing the lobby all lit up for Christmas time is","useful":0,"cool":0},"6fBa691ZFkfbX_j8jrjHAQ":{"text":"Welcoming environment. Friendly staff. The fried kale chips and truffle agnolotti were hig","useful":0,"cool":0},"nxyAZtVE-Kh9Ozte0im7hQ":{"text":"Hands down the best meal we had all week.  The pizza, hanger steak, and lasagna were all e","useful":0,"cool":0},"5G_yRSYmCLkesnN27Od0eQ":{"text":"I have now been to this restaurant easily 10 times and each time has been a pleasant exper","useful":1,"cool":1},"CochyqtlM2Fpcm07XgrPrw":{"text":"The food here was good. I especially liked the salumi and formaggi tray. We selected salam","useful":1,"cool":0},"IP5HmxsTEB_JkVqqScj0Mg":{"text":"I'll start by stating that my review is for the overall impression/lack of courtesy than f","useful":0,"cool":0},"bvRrwRXehC1bSqESE6MpcA":{"text":"His place is located inside the Roosevelt hotel which was a block away from the hotel we s","useful":1,"cool":0},"UPuahbkPkMqyRrx6LhnWrg":{"text":"Great happy hour!  Pizza and cocktails are half off!  The bellinis are my favorite as ther","useful":2,"cool":1},"Z56bSKi2gSh6v-FgAxma-Q":{"text":"Manager came and made it all better by bringing us a fresh pizza. Good and hot. Not soggy ","useful":0,"cool":0},"QJLHnzIPmH7m6l1_pVn8Pg":{"text":"Man, Their menu is so good...we had lots of people recommend us here and they did not disa","useful":0,"cool":1},"A038o3n8I1YkQe6FZjBSXw":{"text":"This place is SOOOO good!!\nThe squid ink is bomb! And the eggplant and the chocolate mouss","useful":0,"cool":0},"9vCIqxZ8cYp0jIShvaryGg":{"text":"Glad to hear they are still doing happy hour specials \n\ntried the pepperoni pizza\n-crust h","useful":0,"cool":0},"eKxfvbxOldxXVctjBflOqw":{"text":"Came here around 6 PM with my husband. When we arrived at the counter they told me that th","useful":2,"cool":0},"pHrQye-lbA-nIPQc10iu3w":{"text":"Food was phenomenal and the Affogato dessert dolce is a plus. To top it off the chocolate ","useful":0,"cool":0},"ZLzmxaEkSlQdGfXwXMnlog":{"text":"Shameful to say this was my first time dining here! Went out for dinner with two friends a","useful":3,"cool":1},"gqOW9AkTxmJzAKhK7hFpsw":{"text":"Love coming to this place can't. Relieve I never left a review. I love the pasta with rabb","useful":1,"cool":1},"AyB0GSrqn2MS1L5qRU9Njw":{"text":"Not much to add to the list of rave reviews but just wanted to give a little happy-houring","useful":3,"cool":2},"Udz-gGxIUAy9TboKoDosaw":{"text":"Sat at the bar. Bartender was nice, great flavorful TRUFFLE AGNOLOTTI. It was undercooked ","useful":1,"cool":0},"P-pt5522WSOHTR7CXDQnBw":{"text":"Cory is the absolute best!! Top 5 servers I've ever had. The food was good but the service","useful":0,"cool":0},"EWcrNF5tQoYk0vyW_TvsbA":{"text":"Great Italian place. The food was all delicious and portions were a good size.  Focaccia a","useful":0,"cool":1},"nCNrnJuSkeLT_fx33Q53EA":{"text":"What we got to eat was the fried Tuscan kale with tomatoes, pine nuts, and aged balsamic, ","useful":5,"cool":7},"D3ikxP-MHq5aTxWGNblQ_Q":{"text":"We landed in New Orleans and had some time before checking in to our air bnb. This place w","useful":3,"cool":1},"zOaqfuajS5deGbV7Jl1yGg":{"text":"good food, but is it technically called good if you come out of the restaurant with a feel","useful":1,"cool":0},"PLOi8m-mUGxfsBYI9dEu6g":{"text":"This is the place! The rabbit sugo, smoked beet salad, the aged cured beef carpaccio, and ","useful":0,"cool":0},"_2kdHqv7vBchozFpgKereA":{"text":"Had a fantastic dinner here during Happy Hour on a Monday night.  During happy hour, they ","useful":5,"cool":3},"OKy_YShJmGCxrvQDbtKXFg":{"text":"Best dining experience we had during our entire trip! The waiter was extremely knowledgeab","useful":0,"cool":0},"ZB5o-Dsk6GKH2siE7le58w":{"text":"Unfortunately not recommended.  We stayed at the Roosevelt for an anniversary weekend and ","useful":0,"cool":0},"Kuk7NBlPPYmwLNnGNkfmTw":{"text":"4/2021 Very disappointed w the food.  Ordered GF pasta w Alfredo sauce & chicken but got p","useful":1,"cool":0},"dNua7kW5mK4nlN_sGnY2ww":{"text":"Despite the upscale decor that suggests that this is a place for suits, the pizza is prett","useful":0,"cool":0},"XKAOazCBrFTdyTjpB4FLMQ":{"text":"Food (4/5): We ordered squid ink pasta, margherita pizza, tagliatelle, and truffle angolot","useful":3,"cool":2},"hLEdk0OpYRTTV8QbX-hLzA":{"text":"Favorite pizza: prosciutto; least favorite pizza: asparago (asparagus); other pizzas: they","useful":0,"cool":0},"mJb_v6JDOodBa9WJBUOd9Q":{"text":"The only reason my family and I stay in New Orleans, because of Domenica pizza!\n\nMy review","useful":1,"cool":0},"GbTtDf7UL3VcSHkHZKyXdw":{"text":"So... I've been to Domenica twice and had one good visit and one poor visit.  Well, to be ","useful":0,"cool":0},"lN8y1SR2NMuHoVSk80ULRg":{"text":"We came for lunch on a Friday (just after opening) and the place was filling up. Between t","useful":0,"cool":0},"C3BpABh4CiwLm3gwqA5Xsw":{"text":"Domenica is not your typical hotel restaurant. This place is dope (that's what the young f","useful":1,"cool":1},"sTvdjUEkfthpqyqYngu60A":{"text":"We came to Domenica to celebrate birthday. The food was delicious and the wine we got was ","useful":0,"cool":0},"mo5gManbxpZgw--UFlNurQ":{"text":"~~~Happy Hour, Happy Hour~~~\n~~~John Besh's Restaurant~~~\n~~~~3.75 stars~~~~\n\nWhenever I'm","useful":16,"cool":18},"N4JFvzs3otLsSgq2dL5N7g":{"text":"This place was amazinggg!! They were super quick getting my order out. My friend and I sha","useful":0,"cool":0},"pfnsIjn4q0oIvVEWIPDjJw":{"text":"Our meal at Domenica was phenomenal from beginning to end. Truly one of the best meals of ","useful":1,"cool":0},"x7CGEj9k4BIQQ7mk3OQ3Ug":{"text":"If you're in NOLA, stop by this place for lunch or a nice dinner. The restaurant is conven","useful":4,"cool":2},"W4s6lcWYsd5vir3JZeVJiA":{"text":"My friends and I were in a mood for Italian. After a quick Yelp search this place popped u","useful":2,"cool":0},"09u8QtlCWxOSmLCYBMLSNA":{"text":"SOOOO good. I got the pasta with truffle and ricotta and it was amazing. I love how they a","useful":0,"cool":0},"UTJZD_IurLHXluS0ymsT2Q":{"text":"A group of 5 of us came here for lunch today. The place was packed, but we had a reservati","useful":4,"cool":1},"Qb-rE44Yn4aLN5DAqrMAOw":{"text":"Nice ambience but food not so great. Lesson learned try local cuisine when visiting.  Ital","useful":0,"cool":0},"dzYgwqq6VUorUXsNu5tJ9A":{"text":"We were in New Orleans for a long weekend and had 2 dinner reservations made for us by our","useful":0,"cool":0},"XPHD4TDZrPrrd_UkRzHWVw":{"text":"I wanted to be more impressed with this place than I actually was. Hubby and I had our ann","useful":3,"cool":2},"ElSSNaNirMYz93xc8MGtPg":{"text":"È la pizza che più si avvicina a quella italiana rispetto a tutti i ristoranti in cui ho m","useful":1,"cool":1},"qOzYYjL_P2t1VS6ZOgm8ew":{"text":"This is a great restaurant in the Roosevelt Hotel.  I would definitely rate the food as 5 ","useful":9,"cool":9},"xqrFxKOYJ3HmGM1nCWl0kQ":{"text":"I was happy to finally have an opportunity to check out Domenica.  Another excellent New O","useful":1,"cool":0},"j8lddoJVFo6IHT33Ib_E8Q":{"text":"Really nothing special at all. We arrived a few minutes early for our reservation and desp","useful":4,"cool":1},"fHbJVxJpkFoubZts9MiWFg":{"text":"Fantastic Italian place in the Roosevelt Hotel. It's a Besch place so you know it'll be go","useful":0,"cool":1},"koTfQxxUDH4xrJYA81tZYQ":{"text":"-Spaghetti and meatballs was pretty good. The pasta was the perfect texture and the meatba","useful":0,"cool":0},"N9akDtxDBZ-NNMqQ9yHdEw":{"text":"Okay, after several bad places, and mediocre meals, I had to find some good Italian food. ","useful":1,"cool":0},"SllJC7BXY_lqDuuS7V8qfg":{"text":"I really wanted to give this place a higher review. But i was served a mediocre pizza by a","useful":0,"cool":0},"-Rd_LhZ-TCSuU3oKTlmUfw":{"text":"Food was excellent, 5/5.\nEstablishment was decorated perfectly. Wait was about five minute","useful":0,"cool":0},"qWqcb5kktKCGmD_y4wuP6w":{"text":"This was a great stop! Yummy pizza and a great happy hour (half off pizzas and I think the","useful":0,"cool":0},"aVwAZTiRlTgKmrhcsPwKRw":{"text":"After leaving NOLA, I couldn't wait to visit one day to eat here again. So for my friend's","useful":1,"cool":0},"OiEAthciCYYHBxdGKuq3yw":{"text":"Can you say delicious. OMG. We were in New Orleans for 4 days and managed to eat at this p","useful":4,"cool":4},"jYduMgyxnYTizYq5knJP1g":{"text":"Your taste buds will thank you. \n\nI love when you randomly stumble upon a place like this.","useful":0,"cool":0},"m4x4tmxTS3lElmoh5y8aOQ":{"text":"Saturday at  ~5 PM.\n\nThis was my first visit.  It was on my list of places I wanted to try","useful":0,"cool":0},"r55V8SWlBtGgcNSFHsV4VA":{"text":"Our server was very attentive and courteous, the food was very reasonably priced, and the ","useful":0,"cool":0},"tYF47EYBmOE9fajlXUurIA":{"text":"Love this place! Always come back to eat here when I am in town.\n\nSome advice: Get the cau","useful":1,"cool":1},"cjKD1DSUprjtGcPpSWpSmg":{"text":"I felt a bit guilty partaking in something other than Cajun/Creole/Oysters in NOLA. But af","useful":4,"cool":4},"5z-vrfjy7l-ZR0uLSYVyHQ":{"text":"After a tiring day, I stopped by Domenica with a couple of friends for their happy hour (3","useful":1,"cool":0},"CLXvm4dMBUvPE8w0wnBhhQ":{"text":"I gave it 2 stars because I take part of the blame for the worst Thanksgiving dinner in me","useful":0,"cool":0},"6w8KSrUQauh34NSYu-4bYQ":{"text":"Derin was an amazing server and the food tasted amazing. Had the lasagna and the margherit","useful":0,"cool":0},"iiSLek9Ol76fcq8QctxPuA":{"text":"Serially impressive restaurant. I've been many times and have always been wowed by Chef Al","useful":2,"cool":2},"HqpoC0HlOJnOfvf03j1CvA":{"text":"Terrible. Flat, lifeless, actually tasteless. I don't get the hype. Hardly any toppings an","useful":0,"cool":0},"Ky73sF1JW6bWrESfB70rcg":{"text":"You might find yourself walking in the Roosevelt hotel to find a bathroom or to admire the","useful":0,"cool":0},"zzyIq8fEaoGtosqTTvPrcg":{"text":"I had heard incredible things about Dominica. Sadly, I was mostly disappointed. The taglia","useful":0,"cool":0},"qQ7p4jPgkdT4CLYgvLMbkQ":{"text":"My husband and I tried this for the first time on Friday night, and it was exceptional. To","useful":1,"cool":0},"c57JCXeOgj5US_bb-iEGwg":{"text":"I have eaten here when I hunger for pizza. Now I am almost 50 and this place is definitely","useful":0,"cool":0},"K8PLrD0e8k-jOrTlbCI3ag":{"text":"Was invited to a birthday dinner being held at Domenica; I figured since it was located wi","useful":0,"cool":0},"B39rULRBR_Rlw-8iVzuW-w":{"text":"Half off pizza and drinks for happy hour (3pm-5pm)! Try the prosciutto pizza and golden al","useful":1,"cool":1},"ujURuCZGT-YQcpw--kGQ_A":{"text":"Delicious!!! We tried pizza, lasagna, pasta & wine. All exceeded our expectations! Cory wa","useful":0,"cool":0},"3I27PXBJ9wPIYITFdPw5jQ":{"text":"So their pizzas are most excellent, however their salads are very small which I find irrit","useful":0,"cool":0},"5Ykx-jv2nrzjh63-P4kmbA":{"text":"While a little pricey, I really think it's so good it's worth it, and the happy hour can't","useful":1,"cool":0},"kHhwFEneb2SdtPwoJk8vgA":{"text":"Wonderful Italian food. They did a great job with my lasagna. My friend said that the squi","useful":3,"cool":1},"8l5cP64l6HrFJ40pcrcl5A":{"text":"3.75/5 great wild mushroom pizza\n\ncame here for a going-away dinner and ate ourselves sill","useful":3,"cool":1},"j4ErvxUliWbHu1sZe5Yf3w":{"text":"Very nice restaurant in a very nice hotel. The roasted cauliflower appetizer with whipped ","useful":0,"cool":0},"HRSyAHW28NElui4sze_6Eg":{"text":"Absolutely the best pizza this side of Naples, not to mention, exceptional service, chill ","useful":2,"cool":0},"gcgluQiFpGGP6FpzPcOL-w":{"text":"I would give this place more stars but the service was not great. I can't remember the guy","useful":2,"cool":0},"vOAHTxX_Tdei2O_iUfg_ag":{"text":"OK - let me start by saying that this was one of the best meals I've had in a long time.  ","useful":1,"cool":0},"j24RVTuum4rugmQrZSSXQQ":{"text":"Domenica, located inside of the Roosevelt hotel, is a modernized Italian eatery that fires","useful":0,"cool":1},"uh9INhNjKXR2nZ0_zc6FgA":{"text":"Had to make last minute reservations which they accepted.  Thankfully \n\nService was great!","useful":3,"cool":1},"r5iKBj6tMnJ5VTQC7Z2vjA":{"text":"This is probably my favorite Italian restaurant. The food is delicious and the service is ","useful":0,"cool":0},"aKcOTQ8d_2UhMLQ8655EXw":{"text":"Had dinner at the bar with a friend and the service was amazing .  The fried kale was to d","useful":0,"cool":0},"X-dzZasY6MAb0sHmJm47Aw":{"text":"Always a good place, been there many times, service, food, decor, greetings at the door ev","useful":0,"cool":0},"aSAywn3HnUMaQ0SBe0nLTg":{"text":"If you go you have to try their Margarita pizza! For appetizers you definitely need to try","useful":0,"cool":0},"OcQVDG0mw2swHgs2jLS-5w":{"text":"The food is pretty tasty but the pasta dishes are really small (especially the tortellini)","useful":0,"cool":0},"N5eIva037Vih-Vob9SKfwA":{"text":"Post-Covid, still a lovely experience! And they brought back the daily happy hour that inc","useful":4,"cool":4},"IsyO2AY0qnU06NAOC8dNiQ":{"text":"Very busy but we were there on Lundi Gras. Happy hour is wine by the glass, beer and pizza","useful":0,"cool":0},"nsdVkqspufV4cvTXJO6uPQ":{"text":"You ever seen that SNL skit about a fake restaurant called \"Domenico's\" that was supposed ","useful":2,"cool":0},"kvQnBT4L-PoReGzNgUv4lw":{"text":"Service was great. Food needs more attention. Our clam pizza was burnt and tasted like ash","useful":0,"cool":0},"wxFiPByQ3ktdz1JpcWmEfA":{"text":"Went here on our last night and had a great dinner! There are a lot of restaurants closed ","useful":3,"cool":2},"p0QI2MXLv3wOMogRn_br8A":{"text":"I would not have considered an Italian meal in the Crescent City.  With a large group, you","useful":5,"cool":3},"9cFi8uY-tqfoWw456mqCDg":{"text":"Everything and I mean everything here was amazing. The service a 5, the food a 5, and the ","useful":1,"cool":1},"ChTDB09UZQxRebr2fKznkA":{"text":"Really great pizza & drinks.  We loved the food overall,  but the pizza for sure was extra","useful":0,"cool":0},"drJMgAq5yToAlG8cNjsotg":{"text":"If you're a fan of true Neapolitan pizza, this is the spot in NOLA. The crust is paper thi","useful":0,"cool":0},"ozgP6ZJgseJZ-NdOZLdXkQ":{"text":"I loved the decor and ambiance here. Definitely expect this place to be crowded though, ev","useful":2,"cool":2},"y2HJLd-0AhzwqYS-wgwJYA":{"text":"I had a very 50/50 experience during my visit to Domenica so please take this with a grain","useful":13,"cool":11},"3pcYxgH1eHe6eeiqxVsXrw":{"text":"The server, blonde, was on her phone and not very attentive. We called and knocked on the ","useful":0,"cool":0},"6qENsa6oZAID6j3zzbXydg":{"text":"This place is soooo gorgeous that it made me feel sexy and gorgeous.  Although normally no","useful":7,"cool":5},"iArnaAl84TjNZsMZ4ln9sQ":{"text":"We had tickets for the Crosby, Stills, and Nash concert that night so we drove into the ci","useful":3,"cool":2},"ZK9i6hymeZ1qIJZizoxJvA":{"text":"What a joke. Called ahead a week out to make reservations for my mother's birthday. We wer","useful":0,"cool":0},"u4w2MyfLOF_fmVxwskDGCA":{"text":"Why does this place get hyped? Food was mediocre at best, felt like a tourist trap. Focacc","useful":1,"cool":0},"hMpJ9SVP2isXoyAqedpJig":{"text":"Hands down, the best pizza in NOLA. Be sure to hit the happy hour for half price pizza.","useful":0,"cool":0},"__4CCTGsdGzS8802jH1GwQ":{"text":"Wow. Just wow. Heard a lot about this place from friends. It lived up to the expectations.","useful":0,"cool":0},"Hth2tFiGDkBp6ZDVLJ3WLA":{"text":"This place is SOOOO good!!\nThe squid ink is bomb! And the eggplant and the chocolate mouss","useful":1,"cool":0},"s8A9sTVtRGeEaqFJoKjPLQ":{"text":"I would give it a zero if it was an option. This restaurant is terrible. Aside from the ph","useful":0,"cool":0},"OxH8tFOgrv1R0uNzXKCUyA":{"text":"We wanted a break from standard New Orleans food while visiting the city on vacation. With","useful":1,"cool":0},"ZapKcKWaEhwSd2OWVtbJPg":{"text":"Great place ~ stopped in for Happy Hour, everyone was smiling, friendly and welcoming.  Or","useful":0,"cool":0},"Lw1zVgRs9pjEleosQzaMFQ":{"text":"Amazing!! Shared the the squid pasta and the braised rabbit pasta with my wife. Both were ","useful":0,"cool":0},"1NNqTQFAvY8aMpjirOp2BQ":{"text":"Arugula strawberry pistachios lemon vin starter salad. #chickenliverpatêeverytime #lifecha","useful":1,"cool":2},"w9vX3zMdLMIlX1at7mXIJg":{"text":"Well this place was not on the list to try on this trip.  A friend whom we met at the Coch","useful":6,"cool":4},"o82CdnQXKjv2eucn7LlcVA":{"text":"We had Domenica pizza delivered to our hotel in New Orleans. Both were delivered cold and ","useful":1,"cool":0},"JotBcQlYAXdAuk7UXCnwxg":{"text":"Wow wow wow. This amazing restaurant has a half price happy hour every day 2 to 5.excellen","useful":0,"cool":1},"fZmuv51dqwiYiJVtNy78bg":{"text":"Recommend by our cab driver as we were coming back to our hotel. He told us that it was a ","useful":1,"cool":0},"w7vmlerKLYaI3nWgb752aw":{"text":"Great food! Great atmosphere! And squid pasta is amazing! The location is great too whenev","useful":1,"cool":0},"5OG0_Ua0iuvHj7Iiy57_hQ":{"text":"Domenica was a surprise that I stumbled upon. I would have have never guessed that I'd be ","useful":2,"cool":2},"hH-z3d6TRfMmtdYbiqg57w":{"text":"This spot is an example of the old adage that first impressions truly are everything...\n\nW","useful":1,"cool":0},"21l6ssJSKtppIsymHyZpRQ":{"text":"The BEST happy hour ever.  Who doesn't like getting drunk on half priced cosmo's and then ","useful":1,"cool":1},"YyUTDCkyvqWHLpb9h2itPg":{"text":"Love love this place-swanky and chic with amazing food and somehow even better service. \n\n","useful":1,"cool":2},"UoG_OB8-3H44phy7z3SyLA":{"text":"We accidentally wound up in a much fancier restaurant than we were really dressed for but ","useful":0,"cool":0},"_PfoRK_iicwsqwPy98hm5A":{"text":"The food was amazing and our server was very nice. We ordered Margarita and White pizza pl","useful":0,"cool":0},"lSi1RLgyfUg899qxe3zBZA":{"text":"A cute, quaint Italian restaurant in Downtown. Service was spectacular. A side note, the s","useful":2,"cool":3},"zIZUEgfWlrdV9cHh9UiQDQ":{"text":"Squid Ink Tagliolini\n\nThe ambiance is fantastic, this is the second Italian restaurant I h","useful":1,"cool":1},"29YYGeSYQAbrYoA5OF9Zhw":{"text":"One of the BEST Pizza places in NOLA! At least that what nearly everyone says about this p","useful":2,"cool":1},"0wQoCeVZyP6839sAZ4xtCQ":{"text":"I want to give a huge thank you to Gerard for making a very stressful situation much more ","useful":0,"cool":0},"8-y982kHdWmy1Hbp9-50Zg":{"text":"The blank ink linguini with chunks of crab meet was so delicious. The sauce was savory wit","useful":1,"cool":0},"W813an8ac9stWB6wM4SOrQ":{"text":"Beautiful ambiance. Limited menu but everything was delicious and cooked well.  The pizza ","useful":0,"cool":0},"uqF4bQDc4l5VDpa8WAvAdA":{"text":"Nothing warms my heart like coming to see the Roosevelt at Christmas time. For the last fe","useful":1,"cool":1},"Dnleo64Z2Gwt-u0Q9NHGxA":{"text":"Beware of the spicy olive oil. It is good if you like spicy but very intense. The waiters ","useful":1,"cool":0},"d0Lmuyd05aqI1s7H6OlIkw":{"text":"Domenica was a great restaurant. The food was good. I had short ribs with Polenta. Really ","useful":2,"cool":1},"-Z-_E7bHqAc3bZh98zeVdQ":{"text":"A friend recommended that I come here for the CHICKEN LIVER PÂTÉ, which I enjoyed.  The cr","useful":3,"cool":3},"f2fa2po-PHL_f7fvLWqauQ":{"text":"We went to Domenica for my birthday, arriving early on a Saturday morning. We had made a r","useful":1,"cool":1},"mIihwBBALgmqzQV9txpICA":{"text":"Love this place!  Fun, lively, great food!  \n\nHave been here 1/2 dozen times in last few m","useful":2,"cool":1},"Ao1dHQOfspdXlcdUReV7Ew":{"text":"Located on the first floor of the Roosevelt hotel. We made it in time for happy hour, the ","useful":1,"cool":1},"uhjbW5ATqFxA2ZPElyRKsQ":{"text":"We came here during happy hour when pizzas and drinks are half off. I ordered Margherita p","useful":1,"cool":0},"Bzn2jV2BrhndHURnTt9Uqw":{"text":"The ambience was nice but the service was not. The food was salty. We were disappointed by","useful":0,"cool":0},"p9r_nYUTyghEZcKGE8xdYQ":{"text":"I have to give another five star review to Domenica! They're very busy around the holidays","useful":7,"cool":7},"thaUhndoW1s5yp5Z36nqug":{"text":"Party of 4. Started with complimentary focaccia which was delicious but when asked for mor","useful":0,"cool":0},"Bxm-tStSaxpqGqq-_ZRTQA":{"text":"The front hostess provided excellent service, but the waitress was slow to take our order.","useful":0,"cool":0},"fncWBN-R-9pzEN0RJzA-vA":{"text":"Burned pizza. No cheese only tomato sauce and a few pathetic leaves of basil. Small pizza ","useful":1,"cool":0},"KUfaWx2OQxdGT6eNaiJMbQ":{"text":"It is not often that I go to a celebrity chef restaurant with the hopes of ordering a pizz","useful":1,"cool":0},"JEYd3PAOLbE6bH7fUYufIg":{"text":"Came with a group of 20. We were seated promptly but we did have reservations.  The Roosev","useful":2,"cool":1}}