{"oX5gTeDaetatuaX5dmPJRg":{"text":"Dr. Stephen Hales and his team are efficient, kind and committed. The Doctors actual offic","useful":0,"cool":0},"llQSSFS_esz4eDiy63bXHg":{"text":"This is the Uptown Pediatrics for the Uptown crowd.  They aren't all bad, and they aren't ","useful":2,"cool":0},"xTyUYUBxhrWodhERt67cmg":{"text":"Our Pediatrician Dr. Oates is GREAT. However, the rest of the staff : nursing assistants ,","useful":0,"cool":0},"Pb4Kn3t_X4Jq2oi9WzzuTA":{"text":"Got an apt right away and was seen on time. They have several private 'sick kid' waiting r","useful":0,"cool":0},"1Fa4iUPr-6NPod8u1UJOUQ":{"text":"As far as doctors go, I wish this could be my doctors office. As far a pediatricians go, I","useful":1,"cool":1},"-rJVRjsVVKWqj_uas2Mc1g":{"text":"The good news: good docs and they will honor appointments. Not so good: if you have a sick","useful":0,"cool":0},"7o_wPeh9gPHkNmDHPMTYkw":{"text":"Dr. Hales is the best pediatrician in this city! He is knowledgeable and wise, listens and","useful":0,"cool":0},"7bS3kbI2-0bsCcvZSXDn8Q":{"text":"As a former patient of Dr. Stephen Hales, from early childhood through my college years, I","useful":2,"cool":0},"qzYLwxlzWFtjSchB0B5R0w":{"text":"If you are an expectant parent in New Orleans and are looking for recommendations on pedia","useful":4,"cool":0},"Oep0rbjEr08kitqIbbRd6g":{"text":"Hales Pediatrics came highly recommended to me by many families when we moved to NOLA from","useful":3,"cool":1},"Q2OA8GaYGgau68Se4yTfUg":{"text":"Wow.  The disparity of the non-filtered reviews on this practice forced me to write this r","useful":11,"cool":2},"V8p90QnjnJeneCu4thLY-g":{"text":"This is an updated review after talking with the spouse:  My four kids have been patients ","useful":10,"cool":3},"lR4taIzkdtrQCNGUVKms-A":{"text":"The doctors and staff at Hales Pediatrics have seen to our children's medical needs for ne","useful":0,"cool":0},"IaMY4aKoETjJ1DkR8i3vsA":{"text":"My children have been seeing the Hales team for the past 13 years - girl & boy.  I came fr","useful":0,"cool":0},"f-PWPd6KbZabEWr1bKW3PQ":{"text":"We moved from New Orleans a few years ago, but every time cold and flu season hits out her","useful":0,"cool":0},"CvNZAMMi0XR-PhQ3WmglBQ":{"text":"I was having my first child, and like any over-joyed parent, I was preparing myself and se","useful":3,"cool":0}}