{"kCJLgMEhQG8RCUzEl6f4sg":{"text":"I would never recommend anyone to get food from this establishment. I once ordered a mocha","useful":2,"cool":1},"YwmWo6mwImHtkX33JhOLkw":{"text":"First of all, lady got my order wrong. Which didn't bother me as much until I found a roac","useful":1,"cool":0},"akrW8M86Nw1H3Vc_YYyOBA":{"text":"This is probably the worst Burger King in NOLA I would not recommend to eat here. The serv","useful":0,"cool":0},"x4IBaRLeukWSRwTbd5psdg":{"text":"For a place that is supposed to be a quick grab-n-go, they sure are slow!!! I also feel li","useful":1,"cool":0},"lhtL_j2Fh8cEcRtpeehj8Q":{"text":"Life is all about getting things faster, better and cheaper! Who has time to always sit do","useful":1,"cool":2},"1rzUlrW4BGN3th44FZLlsQ":{"text":"Your average BK... The worker over the intercom in the drive thru was rude, and had a hard","useful":0,"cool":0},"nhYgWRCO5HOJJAO-uvRElw":{"text":"Absolutely the worst service ever! The workers suck and they don't even make the burgers r","useful":0,"cool":0},"v1q5TD_TBn3uRqM_t0DGnw":{"text":"Worst BK ever!  They will let you wait forever at the intercom and when they do answer the","useful":0,"cool":0},"004EF2IJtt6TAUMDiSSB6Q":{"text":"We stopped by after school because my daughter wanted a kid's meal and guess what? They ra","useful":0,"cool":0},"cXAEYMDQOWCWpi3U-ayaYQ":{"text":"I love the impossible whopper and wish I could get it more often, but this is the nearest ","useful":0,"cool":0},"2-9eFtArHq4FJRkIVgn7cA":{"text":"IF I could give less stars I would, very trash customer service, out of EVERYTHING, then I","useful":0,"cool":0},"tG1T7JUfEheLznDujqmosg":{"text":"Always a disappointment and it seems like it's never gonna change! Slow service even when ","useful":0,"cool":0},"wp8i1Jhby2Fp6LasvquyZw":{"text":"Worst BK in the New Orleans area. Wish I could give 0 stars. Even before the the pandemic.","useful":0,"cool":0},"ZP-W1mmPLxNUg4HvtwL1Hg":{"text":"really nice staff. fast friendly service. clean establishment. my coffee was good and fres","useful":0,"cool":0},"2tiFMzVBrQh4pc5u3Zyrfw":{"text":"I work for an automotive group nearby and being in the East we do not have many \"quick\" br","useful":1,"cool":0},"hVqNj0Yjc6oAMyFEFg0kpg":{"text":"I came to Burger King today at 8:15-8:20am. I tried to order 2 whoopers burger. I did not ","useful":0,"cool":0},"XkDHFJhGI0xtYU2fOJz3xA":{"text":"IF I could give less stars I would, very trash customer service, they were out of EVERYTHI","useful":1,"cool":0},"_Y7pg5yN76hCEY57AOZB5Q":{"text":"This location will get your order wrong every time.  No matter if its the drive threw or i","useful":0,"cool":0},"vIwLtShcE6G_XFXIhkB4mQ":{"text":"I waited in line for 20 minutes before reaching the speaker to place my order. There was N","useful":0,"cool":0},"foduWFTMlJTpg3yVeZ286A":{"text":"This location is always messing up my order. And it's not like I'm asking for a lot. There","useful":0,"cool":0}}