{"K7H1ixvJotXF_LwouP23NQ":{"text":"The food is amazing! It's hard to find Tonkatsu in NOLA, near my house.  Their Tonkatsu is","useful":0,"cool":0},"k-KjWdDeZRW6-tWANQdajg":{"text":"This place reminds me of the ramen shops/restaurants in japan. Very much styles like homel","useful":1,"cool":0},"6ccOoA-Yp44gX4vVN7qkYg":{"text":"I ordered food from WaitR from this restaurant after reviewing all of the positive reviews","useful":0,"cool":0},"k00TrifWr4Y057uvkvVVoA":{"text":"Just found out this place changed from Little Tokyo to Masterp1ece, so I decided to give i","useful":1,"cool":0},"797cxoprzIfbdPAWH3y6tw":{"text":"I almost don't want to write this review so that it can be a little hidden gem but I want ","useful":1,"cool":0},"nZDKHThxWCw5BJIadtxfFw":{"text":"Dark and dingy is what I think of when I go to this place.  They retained a lot of the dec","useful":0,"cool":0},"XHjsiyeNgOStF5hMJAKk_g":{"text":"There is barely a wait time. They cook fast but everything is well cooked. The sushi is fr","useful":1,"cool":0},"wn92fyWBrGCIrzuhdeIRMg":{"text":"Restaurant was empty and myself and other regulars wanted to karaoke in the empty restaura","useful":0,"cool":0},"m8m1mFtLc5-fkyPBQvQANg":{"text":"Came here for dinner and here are the results:\n\nPROS: didn't see a parking garage but it a","useful":0,"cool":0},"46c0Del_kJj27Ju-xfP6yQ":{"text":"Visited for the first time last night. The serve was very friendly and the sushi was decen","useful":0,"cool":0},"ZrbnawfaLmM361U3-4ADyA":{"text":"The sushi here was so good that I have to go back for more. The Girl on fire roll and the ","useful":1,"cool":0},"mgrferljC3PzNgJfurcRqQ":{"text":"This place was brought back to life again. Interesting food - not boring Japanese sushi or","useful":0,"cool":1},"j7QuhByeg46EAqpo87cUAA":{"text":"Thank god this place is under new management! \nFirst the waitress is very nice . She deliv","useful":3,"cool":2},"tDHcw9wIVbMLSCA-RPpCRw":{"text":"This place used to be the old little Tokyo on south Carrollton, but it is now this new pla","useful":0,"cool":0},"s6ELXJGlHbS6NmAzvQz-QA":{"text":"This place has the best Sushi and Ownership in New Orleans bar none! I can't wait to come ","useful":0,"cool":0},"A4DloyXKsfOI_aEcpn3EZQ":{"text":"Very disappointing. I ordered via Postmates and it was my first time trying Masterp1ece. T","useful":0,"cool":0},"oOiyR7Y1vHq6JvyG5nTD4Q":{"text":"This was my first time here. We ordered a tower appetizer with wontons, crab salad and cho","useful":1,"cool":0},"2amLEjnpMHg7jEDKk1btJA":{"text":"Eric the bartender is AMAZING!! Food is fresh, service was quick, servers are friendly. Ha","useful":0,"cool":0},"QAWh3T9vDyDqO8djWI_iJA":{"text":"Love this place! The sushi is just ok, but the bubble teas and cooked food... specially th","useful":0,"cool":0},"T9UXwDtBsrDbljtXVQiCgw":{"text":"This is arguably the best sushi in New Orleans and surrounding areas. The Sushi Chef is am","useful":0,"cool":0},"mG1ZyiRqXNJieX1bVs_ETQ":{"text":"My boyfriend and I stopped in here one night thinking it was still Little Tokyo... we were","useful":1,"cool":1},"VZRbMN1l4Kyy0_Sci8a8Mw":{"text":"This place was AWESOME when they first opened! But sadly we won't be going back. We ordere","useful":0,"cool":0},"dsjseidPmfqqyO3OQ5PrWA":{"text":"If I could give 6 stars, I would. Picture this. It's a Sunday, about 4pm, you're 6 months ","useful":1,"cool":2},"9VGAsl3WKc0HtvMLu4MMuQ":{"text":"One of my favorite Ramen spots in the city ! If you like spicy try the Laksa ramen, the fl","useful":0,"cool":0},"2gqu0rRg7SznAGp_J6ugtw":{"text":"I've been to this place a few times since it's become Masterp1ece. I've had the bento box ","useful":1,"cool":0},"-PsEWFBl9P7ZunOpM1GgYg":{"text":"Great sushi place in Carrollton! This was our first time trying it and we will be back. Th","useful":1,"cool":0},"n-cCNiNGIGcDa2V-S_cBuA":{"text":"So this is a spot I love to go to! It's great for birthdays because of the karaoke. But be","useful":0,"cool":0},"chLBlz_Kx04guHS4E9rzgg":{"text":"Laksa ramen was soooo good!  Good quality. Good service.  Reasonable price.  Can't wait to","useful":0,"cool":0},"XehwZUrbq_6DF8729y_Jww":{"text":"The ramen is fantastic and if you're looking for a good boba smoothie... this is THE place","useful":0,"cool":0},"4HqAvA9vS9RcZrQFy_D3aw":{"text":"I ordered from this place on Postmates. They gave my food to the wrong delivery driver. I ","useful":0,"cool":0},"LKTC41-ieafBywzXr62uyA":{"text":"The worst sushi restaurant experience I've had in New Orleans. For starters, I was given \"","useful":0,"cool":0},"7HG_4WGV9bGVx12VxvME1w":{"text":"Fresh sushi and ramen, serves til 2am. Huge menu, generous portions, reasonable prices, ex","useful":1,"cool":0},"0G9bUhVB28cCTzv71WJ-Yw":{"text":"so good! i loved their dessert sushi i got  used to come to little tokyo with my friends e","useful":1,"cool":1},"L1wDfGnlyIKhfIMqwfjiPA":{"text":"The ramen is so good!!!!!!!!! I got the spicy bang bang ramen special, which had a sesame ","useful":0,"cool":0},"WRlcekP4vu1-viULTj1kpw":{"text":"It was so good I had to come back for seconds the next day. All the fish were really fresh","useful":0,"cool":0},"OY4JxjDzr8pCiiqYMSF5YA":{"text":"If your looking for a dining experience that will surprise and delight you then look no fu","useful":1,"cool":3},"xKIYMT3omQpmG3S1si_ZAQ":{"text":"Masterp1ece has a nice big menu and everything I've tried has been great! My personal favo","useful":0,"cool":1},"lFqwm1QSLc5Erv3zkCiM-w":{"text":"I've been to this place a few times since it's become Masterp1ece. I've had the bento box ","useful":1,"cool":1},"UQiRNdbE1CJXzQp244jj1w":{"text":"This is my favorite sushi spot in New Orleans.  I recommend the filet mignon roll.  \n\nOMG.","useful":1,"cool":1},"avk-Cxk1uDHSvf4FZaMLdA":{"text":"Great food. Awesome seevice.\nTry the dunken rice. This was my first time here and no regre","useful":0,"cool":0},"z_BY3qjvoqHYRjCSY4WGyw":{"text":"I got the pagoda tower and had no idea how to eat it until I smashed it with my chopsticks","useful":3,"cool":2},"Ne8GmMksRl8QOXwtEBp9-Q":{"text":"This replaced the old Little Tokyo. It's now well lit, and has an extremely varied menu in","useful":1,"cool":1},"PuF4xZydiFbil7aRXPmvCw":{"text":"Love the food here! My late night go-to. The chef(s) take great pride in the prep, taste, ","useful":0,"cool":0},"Kk9vf-m81w6plm__E3dMZw":{"text":"The food is very good. The Tom Yum Udon has a nice kick to the broth , Super Dragon Roll i","useful":2,"cool":0},"llzYOXNAxW5LhHOrJuuqUQ":{"text":"The customer service is amazing they come and check everything is okay and if you liked th","useful":0,"cool":0},"QDyTBTpQ4HWx3s1Th6COBQ":{"text":"Literally sitting here eating as I type. First time here most deff not the last. Ordered t","useful":0,"cool":0},"eun6u2_PVqDrdadxZ3EKzw":{"text":"Really good!!! My friends and I used to come to little Tokyo every Tuesday and were sad th","useful":3,"cool":1},"m278uthVP-XXVLdhiEFxow":{"text":"The sushi is well made, the owner is kind and personal, and the bubble tea is fresh and ph","useful":0,"cool":0},"Gp3obasujVqg0TLEGPdI7g":{"text":"So glad this place replaced the old Little Tokyo! Food was great, service was fast and eve","useful":0,"cool":1},"W2y769tsnAOlEillNUS8lg":{"text":"This place is a really solid option! We had two different options and had the gyoza as wel","useful":0,"cool":0},"fMaHR61TcrqKjAUrwm2Yew":{"text":"Food is good and well priced here but PLEASE UPDATE YOUR HOURS ON YOUR DOOR!!! This is the","useful":0,"cool":0},"K82mo6j0ArpDCe_gVm-eFQ":{"text":"Absolutely fantastic. From ramen to sushi and everything else we've tried, ingredients are","useful":1,"cool":0},"ocYQlKaqXco2EoTjEhaGWw":{"text":"Finally had a chance to try after having seen the new signs go up a while ago. Very friend","useful":0,"cool":0},"yZZrG8pJA3PM3y81yuKK7w":{"text":"After a few tries, I finally got to try Masterp1ece. Ive enjoyed every restaurant in this ","useful":14,"cool":4},"D9hQENPuLFZ_T5SYPoLwSw":{"text":"The food here is generally quite mediocre and there are so many other more flavorful optio","useful":4,"cool":1},"5XAPpVQyOs66xFBsD9UTKQ":{"text":"This place was amazing. It was a Saturday night around 1am and a friend and I were looking","useful":0,"cool":0},"H9F2vfzmwHA1-C-I0XNAgA":{"text":"My go-to sushi restaurant was closed for a staff holiday, so I ordered a few rolls from Ma","useful":0,"cool":0},"aSuDQtpFX2U3rC1EelYEFw":{"text":"I am writing this while eating left over ramen and it is still incredible. Probably the be","useful":0,"cool":0},"ECzdAmjYRiHxgS8OdH1aNg":{"text":"Gave them another chance for the first time since they opened. A mistake. Nice people and ","useful":0,"cool":0},"l7oheqvWpBQdo70Jbbd0Yw":{"text":"Daaaaamn. I wish I had discovered this place sooner. I got the chicken katsu ramen, drunke","useful":0,"cool":0},"-yD8NYKsZtYwIUGa7BZxpg":{"text":"Masterp1ece is great. I have always only ordered sushi, the rock n roll and crunchy rolls ","useful":0,"cool":0},"v4X0_s5fU0sm6bDWIRd8Dg":{"text":"Just a sublime meal. That's all i can say. From the service to the food, everything was pe","useful":2,"cool":1},"YAH8rSmTO4nYWgJjz1SMYg":{"text":"LOOOOOOOVE. Never short of amazing !!!! Food always fresh an hot !!!! Can't wait for seati","useful":0,"cool":0},"Xr5FWP4YfqZ8BPptHNi8vg":{"text":"I'd like to start by saying that had my wife and I skipped the appetizer and dessert, this","useful":1,"cool":0},"eT5qC_wOQqmSSsc0Ih-BYg":{"text":"Where did the business go? I'm literally heartbroken that this restaurant is no longer wit","useful":1,"cool":0},"pP_F4pfvU7Cd0A-G0XcIaA":{"text":"The ramen looked great but tasted really boring. I ordered the chicken katsu ramen, and th","useful":1,"cool":0},"y6z66vzHzXtMmbXGw7xhJA":{"text":"Just a sublime meal. That's all i can say. From the service to the food, everything was pe","useful":1,"cool":0},"_KaF697FKiuBKhLoKG5Q1g":{"text":"My FAVORITE resturant in New Orleans, by far. I've literally tried over half the menu (qui","useful":3,"cool":1},"BFzu8njzNMsiHiZ_dmWfKw":{"text":"Masterp1ece used to be Little Tokyo up until recently. It's advertised as Japanese street ","useful":2,"cool":0},"xOFXHKqV_B8JigZ6iZCPzw":{"text":"(More so 3.5 stars for now but rounded up!)\n\nHad the chance to grab a lite bite and some d","useful":14,"cool":5},"pLVqU9V8xb7RRLoQxf9Zgg":{"text":"This place is good for quick Asian food. Service is quick and friendly, and the food is pr","useful":4,"cool":2},"ECmMaiZMaHTTZwHQjykzJw":{"text":"Been here twice now in just a week! Loveeeee the laksa and tonkotsu Ramen, keep saying to ","useful":2,"cool":0},"_hLH2Z2ZnQ78m3T8qn9W7g":{"text":"Only the best always from Masterp1ece. Fresh sashimi and great customer service! Highly re","useful":1,"cool":1}}