{"HBiucxO-rjJbJVRVyacmQQ":{"text":"Let me start by saying I come every year to The Jazz Festival and I always always stop at ","useful":0,"cool":0},"NnPGZbyCXjDjE8-bKxxtCQ":{"text":"Stopped by for a quick breakfast before our tour one morning! Ordered the croque madame wi","useful":0,"cool":0},"nmZ_Cg3WcRAJRW5E0duixw":{"text":"Average to good breakfast, BUT definitely not great... semi fooled by previous posts. Only","useful":0,"cool":0},"dmA6Wl8PTBr_NYM43hHd_w":{"text":"We had the eggs Benedict of the day and the French toast. The food is fantastic! Very rela","useful":0,"cool":0},"Pyou9I4vz_2AUytuZFPR5g":{"text":"We thoroughly enjoyed the crepes. I had the mixed berry and my husband had the bacon  one ","useful":0,"cool":0},"EmwmAnR-GjjkInjIshptMw":{"text":"This location was recommended to us by our Ghost Adventures tour guide. This quaint cafe i","useful":0,"cool":1},"JYuONETFebbdzjOtI7-e3Q":{"text":"This place is very quiet and quaint. It is well decorated with a classic French feel to it","useful":0,"cool":0},"tqKFpvYzGRd1QHjhOGOT1w":{"text":"Small little spot...but Food here is delicious!!\nThe iced coffee was great too! All of us ","useful":1,"cool":0},"GDKJZkN_EV6bgYMEYyWtAA":{"text":"Somewhat limited menu, basically egg dishes, a couple sides and several crepe options. Got","useful":3,"cool":1},"lcNZDTJzdqCjQDdk8jM4jQ":{"text":"So I can see where you could have a fantastic meal here...but I didn't have one.   We came","useful":0,"cool":0},"A4KHl65R2GeSCOe06I22xQ":{"text":"Absolutely amazing breakfast! I was dealing with a slight hangover and knew I needed somet","useful":0,"cool":0},"kRXLOw8rEQxI3yH115si7Q":{"text":"Had shrimp and grits for breakfast and it was super buttery, which was both a good thing a","useful":0,"cool":0},"Vmf4JsrGd8Ym0XywI9mPSQ":{"text":"Wonderful little cafe. It's small maybe 10 table max, so get there early. Honestly everyth","useful":1,"cool":0},"ICWZ-P8gjm4erhfUBWuSjA":{"text":"Enjoyed a bagel and lox. Great amount of all needed to make it delicious....capers, thinly","useful":0,"cool":0},"YhErXOfSY_IT1-Rcia6m1Q":{"text":"Good crepe breakfast. We got a savory ham crepe, and a berries and cream sweet crepe. Both","useful":0,"cool":0},"GnuGNUFfYJetu0_VUcGtFw":{"text":"What a wonderful little breakfast cafe!\n\nI had a baguette with smoked salmon which was abs","useful":1,"cool":1},"FxTGidfaIlk5XiBDaug19g":{"text":"1/18/16:  update. Since reviewing all the photos it seems to me there are inconsistencies ","useful":2,"cool":0},"KRB5lusK967f8D6oF3Fu6A":{"text":"The crepes are light and perfect. We visited twice for breakfast and ordered takeout for l","useful":0,"cool":0},"5ByJ1CyjVv1wNhzav6goKQ":{"text":"Great experience! The service was great! The portions were quite large. We had the Benedic","useful":0,"cool":0},"lqFRMNpjV90SL17IMgnsjw":{"text":"This place was awesome. Recommend by the staff at our hotel for a late breakfast. Had the ","useful":0,"cool":0},"riURwuqjdhHxfvkMcnsd6Q":{"text":"Location was very convenient since we were staying at the Prince Conti hotel. Our waiter S","useful":0,"cool":0},"pGRcDfEHvRxK6vVP-lj7uA":{"text":"I absolutely loved this place!!!! I had the Antipasto Benedict on Gritcakes! These are to ","useful":0,"cool":0},"vqdBpWupgJ-tZN0bbOWynQ":{"text":"Worst service ever.  Our waitress seemed to have woken up on the wrong side of the bed.  S","useful":0,"cool":0},"rpfciOKnBvDx-SVzXPow-w":{"text":"My experience at Café Conti was superb! I had the Shrimp and Grits for lunch and the flavo","useful":0,"cool":0},"5ase453ip41L_kyDaTYg_g":{"text":"Loved this little place!! Off the main streets, the food was amazing with great service al","useful":0,"cool":0},"uJ9g4ibORon5DAmoeYpn7w":{"text":"B r u h !\n\nService impeccable,\nPresentation priceless,\nFood fantastically flavorful,\nAmbia","useful":0,"cool":0},"2gOKD5H8koSJmFoeGht6dA":{"text":"Good food, slow service.\n\nDidn't want to eat at a chain for breakfast  this morning and fo","useful":0,"cool":0},"O58jfaxI3zpZoe6MkUy6Uw":{"text":"Nom! Ate my bacon, scallion, brie, and apricot crepe like it was going out of style! \n\nOur","useful":0,"cool":0},"3VSbkFu_GkHGt2zJTKMS2A":{"text":"Great, cute little place! They had really good service and the menu has some very interest","useful":0,"cool":0},"f3nBZp-XnYhfpqsNZ9KZyw":{"text":"Breakfast here is very good, i had a savory crepe and a delicious chai latte!","useful":0,"cool":0},"0KyId48pGzJF2sd_A4XhEA":{"text":"The crepes are really good. Creative recipes with good variety to choose from. The staff i","useful":0,"cool":0},"PfYuYuXV_QQN1vrP9-pK1g":{"text":"Food was average, service was poor. Unfriendly staff. Also, felt rushed at the end of our ","useful":0,"cool":0},"PHLxWc5nIocm1TBnlfIzoQ":{"text":"The food was delicious! Had the special of the day-ham, caramelized onion and apple eggs b","useful":0,"cool":0},"nQrQr4MRSyEFwHe8PnbRfw":{"text":"Great place! The crepes were delicious! The vrits are buttery and creamy! Espresso shot wi","useful":0,"cool":0},"mGa9gD-MZCLVVYt2mW-jYg":{"text":"Good, not great. My croque Madame was really good, my friends chicken hash was also yummy.","useful":0,"cool":0},"aVmtTYxAdTOaO1ap_AbsXw":{"text":"Perfect benedicts!  Their crepes are awesome!  Exceptional service!  Highly recommended!","useful":0,"cool":0},"_idDPDwX2jcPlq9vPdoD2Q":{"text":"Delicious, honest food- reasonably priced too. Great cup of coffee! Get the Grits Bowl... ","useful":0,"cool":0},"46a8oGRwZ2czL1KWHyVrBg":{"text":"This was by far the very best breakfast I have ever had in Nola.  From the staff to the sp","useful":0,"cool":0},"pfH1fYV_URRfkY_rQoc3cg":{"text":"Not all the hype!...  I had the Benedict of the day, which was pretty good. my wife had th","useful":0,"cool":0},"Pvxy1Y4e9RQPZrDKNmI09g":{"text":"Quiet and cute creperie. good sweet crepes but it's hard to find a bad crepe anywhere","useful":0,"cool":0},"KlTHEj4zpXBjHMl1L2T1zg":{"text":"We came to this place for Sunday brunch to end our short New Orleans stay. It is a small, ","useful":0,"cool":0},"lPMXUAgWm0MuaeOKZ18DqQ":{"text":"Absolutely excellent breakfast. So many spots in the French Quarter are over priced or und","useful":0,"cool":0},"rNwUgmdenW5fXdVgPr1WjQ":{"text":"This place is small but wonderful. Went for late brunch Sunday. The special was an eggs be","useful":0,"cool":0},"OqrPNjnfTTVxQyQojGa-PA":{"text":"The mixed berry crepes is good. The chicken and mushroom is ok. The crab with Brie is not ","useful":0,"cool":0},"a6bWnuvp89EhsSqEkGv4Kw":{"text":"By NOLA standards this place doesn't measure up. It is completely self service which is fi","useful":0,"cool":0},"_7FDkI8fzUAqdpF-Bvwqwg":{"text":"Excellent food and didn't have to wait to be seated for late breakfast (increasingly key i","useful":0,"cool":0},"2cLytjb4OD6eMcYQZlgzlQ":{"text":"It was really a great experience for breakfast here. we had wide variety of items. everyon","useful":0,"cool":0},"DufyT7I9GWAnShlabOc1uQ":{"text":"Best breakfast we had in New Orleans. Opens early and offers great service. My husband had","useful":0,"cool":0},"5BcLQeZBT2LiDKt-J2fCkg":{"text":"Crepes are really good. Smooth and subtle. Not too sweet. \n\n\nLittle shop that I love \n\nA b","useful":0,"cool":0},"KwrUouKqMVogLiOQpGTMlg":{"text":"I picked this because of the good reviews and it was on our way to our next activity. The ","useful":0,"cool":0},"H0pSVeiGNjt8r-RzsZ9_NQ":{"text":"AMAZINGGGGG! They had \"specials\" which I decided to try one for breakfast. I got eggs Bene","useful":0,"cool":0},"91LDMEYzJBFxscJQulnieQ":{"text":"Cutest cafe ever! This cafe is very small but amazing!! Definitely worth the wait if there","useful":1,"cool":1},"yL6skReQ9vhnrWCy3b8Atg":{"text":"We tried the Nutella/bacon crepes, crab crepes, bacon, and toasted baguette. Everything wa","useful":0,"cool":0},"Vt-ZRawNYo-D8b-k08PjQA":{"text":"Split the breakfast po boy and the mixed berries crepe and both were amazing. Definitely c","useful":0,"cool":0},"5pHsQSlSpD66FU_ZxlAthw":{"text":"Conveniently located by our hotel, I decided to stop in for breakfast today and damn they ","useful":0,"cool":1},"Ocyjn8Zd0hY4P5VICJYZhA":{"text":"Breakfast was good, but the service sucked! Luckily I had my own water in my bag or I woul","useful":0,"cool":0},"uNZAX_Jj6nqROhTnVuqlIg":{"text":"Stopped in for breakfast with gf and her parents. I had grits bowl and absolutely loved it","useful":0,"cool":0},"hsrjlitupn0vF6Nen-osUQ":{"text":"Excellent coffee, really nice young staff and a perfect quick breakfast before starting on","useful":2,"cool":0},"ixsU1iftQ50SoMv_QZ98sQ":{"text":"Wonderful breakfast that is truly one of the best in the area. The waitstaff are awesome a","useful":0,"cool":0},"tUmLQWLrC4wrcg6m9RAsWg":{"text":"I m back to finish this draft after one year, as it is a really good tiny place impressed ","useful":0,"cool":0},"vPna9pGhvlKUGcIfN7IwpQ":{"text":"This is the place to go if you want to avoid the popular tourist assembly line restaurants","useful":0,"cool":0},"TNkgmJ0vQDx9Raxa4dkE_Q":{"text":"Cute, clean atmosphere with very pleasant customer service. I had the bacon, scallion, Bri","useful":0,"cool":1},"MKOckf-5K881lRclLmUPmQ":{"text":"Well disappointed \nAnd three stars is being generous \nWe had the cappuccino- weak\nAnd the ","useful":0,"cool":0},"19lrKaajNWCTHJGAplySTg":{"text":"Popped in for a quick breakfast and was not disappointed. We had crepes (banana Nutella an","useful":0,"cool":0},"Bgzw3ksgjbDGk-92jn-vMw":{"text":"This little spot is incredibly charming. We were seated promptly at the corner table under","useful":0,"cool":0},"uPARR1XtH3BzLPmWG9kw0w":{"text":"Excellent breakfast place! Great coffee, and we had the Croque Madame and Benedict of the ","useful":0,"cool":0},"adZkpo0PrIA7XM4KNTgX0g":{"text":"Fantastic service, cute interior, & great food.\nWe ordered a Croissant Breakfast Sandwich(","useful":0,"cool":0},"jWkwOz-eX8Hco-zN2HrKwQ":{"text":"Delicious breakfast! Pretty good for being next to a hotel. Pretty place, calm music and g","useful":0,"cool":0},"hGZyNRwtBpWjDolCQcS8kQ":{"text":"Had special eggs Benedict- with brie / tomato- soooo good & crape with berry - not to swee","useful":1,"cool":1},"rUZkubcyAFSB3e9WYaTlXA":{"text":"The service and food here was great! It is tucked just underneath the entrance to the Prin","useful":1,"cool":1},"7b99awcSD6yxyzhHGYHI8g":{"text":"Awesome food. Went back a second time and Had croque madame and it was awesome. Just what ","useful":0,"cool":0},"GeiJgAk_x_6v3k68a7biUg":{"text":"The grits at Cafe Conti are better than any ever made by my grandmothers, grandfathers, mo","useful":1,"cool":1},"Duf3PTkrnXXEYRRsBaCnIA":{"text":"I had the Ham & Brie on baguette w a side of grits, yum! Grits were exceptionally good! Fr","useful":0,"cool":0},"dBT0Te47DvyLVIpiJPJKEg":{"text":"This place is adorable!  You totally feel like your somewhere in Europe when you arrive...","useful":0,"cool":0},"Q58hkQZPut53FV5fuAdR5A":{"text":"The food and service was great.  We were in a rush to catch a voodoo tour. We informed our","useful":0,"cool":0},"JROaknBXN1IyDARQWBJHyw":{"text":"Came in for a late breakfast and ordered coffee and the Croque Madame with potatoes. Absol","useful":0,"cool":0},"7uoIALmXyahJbK2SsFwa9A":{"text":"The croque Madame was HUGE! Very tasty and quick friendly service! The atmosphere made you","useful":1,"cool":1},"jEy6CipYRBKDQcRwWfsT_Q":{"text":"The hollandaise sauce is amazing! The influx of Seahawks fans may have caught them flat fo","useful":0,"cool":0},"UbCeMu2UhJk2A-YV-Z57OA":{"text":"Found this little place tucked inside a hotel on Conti Street.  Loved it so much we ended ","useful":0,"cool":0},"ds-y8XMACda3_H-_lyTtcg":{"text":"I tried Cafe Conti over Labor Day weekend.\nIt is an out of the way place that both tourist","useful":2,"cool":0},"2-9QO9xmaFnixZ3Gr31cZQ":{"text":"Delicious bread pudding french toast and the benedict of the day as to die for.","useful":0,"cool":0},"ZKBmArMGYDnW5khPRE8oqw":{"text":"Super cute French inspired cafe. LOVED their crepes for breakfast or lunch. They are also ","useful":1,"cool":0},"Y4V8Yw6VzPMcUqPRhrv_vQ":{"text":"Great breakfast cafe with egg dishes and crepes dominating the menu. Had omelet cooked my ","useful":0,"cool":0},"MrAdKdq8uJhnkfugwpmYVA":{"text":"My husband and I just had the most incredible meal at Cafe Conti. The food and customer se","useful":0,"cool":0},"LsisRffBh7NtFSUeRja8AQ":{"text":"Great little quiet cafe nestled right off bourbon st. It was our favorite breakfast spot w","useful":0,"cool":0},"hSRCArQ0KgHAHL2GL_3rTA":{"text":"Absolutely amazing! I had a killer hangover and this place gave me my life back. The waite","useful":0,"cool":0},"_UOu-Qo4VepIUDbg_eK-oQ":{"text":"This place has got fantastic food. I was so pleasantly surprised by how good it was. Porti","useful":1,"cool":1},"mocLIYsiD7bElwbHY5_kxA":{"text":"One of the best breakfast crepes I have ever had. The crepe was so fluffy and there was so","useful":0,"cool":0},"5HHRdwO4KM7LM8EhbiQX6g":{"text":"I don't know how this place has great reviews for their Benedict of the day! It was the mu","useful":0,"cool":0},"2zgk3Z6o6UTifFVrE1ICRQ":{"text":"It was a good breakfast !!!\n\nAtmosphere    70  It was a coffee shop\nService           75  ","useful":1,"cool":0},"JyLvhwvgqhXh_8ci5yvqTA":{"text":"3.5 stars.  Was an interesting experience. Cappuccino was awesome and the Benedict was goo","useful":0,"cool":0},"qnPZGvBpS-uw6LMbQTmZ5A":{"text":"This was a great place for a quick breakfast or brunch. It was pretty casual, but the food","useful":0,"cool":0},"Xf82VjWZRBuDgXbhKYcfMA":{"text":"I ate here twice.  Great service, quaint, quiet - it introduced me to what a great muesli ","useful":1,"cool":0},"KizZSf-UbwsG8wfdOjNIGw":{"text":"Amazing food! Probably the best breakfast in the city. I got the eggs Benedict - bacon tom","useful":0,"cool":0},"DC-9tvlXL04yF_jMbS9vxg":{"text":"I had a crepe and it was amazing!  The cafe is in this really old well maintained building","useful":0,"cool":0},"9rMgjxhrAikdH1Nwagwsuw":{"text":"This place was delish. I got the peaches and cream crepes. So much food! I ate about half ","useful":0,"cool":0},"RGNldnYwbK8FKTeZZyaB6w":{"text":"Great spot for a taste of new Orleans! Cute, quaint and great variety on the menu. Staff w","useful":1,"cool":1},"v2oiSzX1ZK8RC1pnjRT06g":{"text":"Amazing food, ordered the crab and Brie crepe and it's absolutely one of the best crepe I'","useful":0,"cool":0},"v-q6vdiGEC16NDmG48kGBg":{"text":"Small place but don't let that send you away. Wonderful cafe mocha and had the spinach egg","useful":0,"cool":0},"St70riZzSw8-FjhOl_1zwA":{"text":"I had a lunch with my bf on our first day in New Orealns. It was nice introduction to shri","useful":0,"cool":0},"8bJ-LO6-J1L3h_niWyIgnA":{"text":"This intimate breakfast/brunch spot is located inside the Prince Conti hotel.   So they ob","useful":0,"cool":0},"6qSKYSjXBQJVVMKJuvbE0A":{"text":"I have a lot of dietary restrictions, so unfortunately there wasn't much on the menu that ","useful":2,"cool":0},"ntvIWTbNn7MlXxqlaeaHTw":{"text":"The food was pretty good.  Out of all the restaurants in New Orleans this one is sub par i","useful":0,"cool":0},"nkE5ZKa1Nrz_f0nNPg-ccA":{"text":"First timer in town...Food was great, chill quiet atmosphere... presentation on point, cof","useful":0,"cool":0},"s4K6kLSG-T5F2K1-FDv3Qg":{"text":"I didn't like crepes or grits until I came here. Orgasmic chocolate and strawberry crepe a","useful":0,"cool":0},"Z8YfEPynzlkO_UNOH5R68A":{"text":"Tiny tiny cafe inside Conti Hotel. We walked here from the Ruby Slipper after seeing the l","useful":1,"cool":0},"0RrbRb3mZVwcFq0vKlY6AQ":{"text":"Amazing fresh food and a staff who cares!  Last night, I stayed at the connecting hotel an","useful":1,"cool":0},"hNYjrVxQFGZFJlpkNsshHQ":{"text":"Cute little cafe. My mom and I stopped in for breakfast on a Saturday morning. We were one","useful":0,"cool":0},"R0KcYZqMqliSyGb7hpQKOA":{"text":"It's a quaint little restaurant. Everyone including myself enjoyed their food. I had plain","useful":0,"cool":0},"Cfg40BzkqOAxH4duIYwNXg":{"text":"Quick, easy, delicious. I loved this place. There was plenty of open seating when we arriv","useful":0,"cool":0},"FyvxgomEh67t17q96JzDtw":{"text":"Enjoyed breakfast at the Cafe Conti, part of the Prince Conti Hotel. This is a real, south","useful":0,"cool":0},"Fj0UoVCG29C0DqCstczzfw":{"text":"Good food, laid back staff & atmosphere, overall very good restaurant. Nutella & banana cr","useful":0,"cool":0},"BhjYviJIIJy5v-VLhELT3Q":{"text":"High quality French breakfast right off Bourbon St.  The coffee was smooth and flavorful a","useful":0,"cool":0},"g0vkQo5i2b-G4lAUx9rcBw":{"text":"Cafe Conti is located within a hotel in the French Quarter.  The food is okay, but the ser","useful":0,"cool":0},"g_ldmqveSJi1NpylzyMFqg":{"text":"My crepe was raw in the middle and the cheese was cold. The crepe was cold too, pre made a","useful":0,"cool":0},"wb_K3jfQ1BdREOSzyc5wTw":{"text":"Service is terrible. Run by rude wannabe hipsters who don't acknowledge their customers. N","useful":3,"cool":1},"q9Nxcso8IBnpXha1ukaH_w":{"text":"The service was very poor, the hostess/waitress was rude. On top of all that there was a m","useful":0,"cool":0},"8IiYasphZ_lKIOQ3_ORPSw":{"text":"Great food with excellent service.  Coffee has a nice bold flavor.  Aztec mocha has a nice","useful":1,"cool":1},"aKSl0MOl0avptONSfqRc7A":{"text":"Nice cute brunch spot across from the hotel. Food is excellent!!! Severs are super sweet a","useful":0,"cool":0},"1UGjhNxgTGEhz_VwTIJv_w":{"text":"I don't know how this place has such great reviews!  To start, the atmosphere is bland at ","useful":0,"cool":0},"mGrm2e8JJOLXLeAuf9k2IQ":{"text":"Very delicious.\nBest meal in new orleance!\nThe only reason i am giving 4 star is waiter wa","useful":1,"cool":0},"wjEYKuhHclNjZuk3NBDfqw":{"text":"This place is phenomenal. I love the French vintage charm and the small, cozy space with l","useful":0,"cool":0},"KV8uDDy5SYNgfmYr0rG09g":{"text":"This was easily the best food find in New Orleans if you want great quality ingredients an","useful":0,"cool":0},"dCZpsTkhPjzB1H_Z7YTIhQ":{"text":"I had an American breakfast of bacon and Sunnyside eggs with cut roasted potatoes and a si","useful":0,"cool":0},"HQuOlud4TwauyzsnPmqRdA":{"text":"This place was absolutely delightful! I loved the French inspired decor. It's simple, but ","useful":0,"cool":0},"AlQlfseOVNgnLnsboQ3Elw":{"text":"Stopped here for a quick breakfast on the way out of New Orleans. Prompt service & delicio","useful":2,"cool":1},"UQgCZW6TY9zls3_O7-PRJg":{"text":"Very quaint place for a nice, quiet brunch. Very impressed. I like how hidden away it is, ","useful":0,"cool":0},"LzPMP53PBoWkbrVPcvAFpA":{"text":"I ordered the grits bowl, the grits were very creamy which is a plus because everyone does","useful":0,"cool":0},"qSnCpw9O8KUQZ6VOZrpiEw":{"text":"Amazing!!!! 10 stars!!! I had a party going on in my mouth!! I had the Egg Benedict and gr","useful":0,"cool":0},"3lq5rSwxdi8Y40-ZkMzRmg":{"text":"Delicious!! My sister and I came here for breakfast on a Sunday morning around 9am. This c","useful":0,"cool":0},"ScKetF2MdHHhsNsiiNdBhA":{"text":"Great place. Didn't have much options for my restricted dietary, but staff was amazing, fo","useful":0,"cool":0},"oaujpCbxS7u_aAibD391ug":{"text":"To eat: croissant of any kind.\n\nThe lowdown:\nGreat little place just off bourbon. Lots of ","useful":0,"cool":0},"UOSkkB_fh0HhWJucupODXw":{"text":"This is a small cafe right outside the Prince Conti Hotel. I went here for breakfast. The ","useful":2,"cool":1},"AniEs3Y3lYkXOIuT4EXjCw":{"text":"First time here and it was nothing less than amazing. I had the spinach and bacon crepe wi","useful":0,"cool":0},"461zinWJEZah6N8e3IcCbg":{"text":"Awesome staff. I ordered the apple cinnamon crepe. Delish. Grits was creamy and phenomenal","useful":0,"cool":0},"PQtI1vcPYIf8DCJ70cW32g":{"text":"In one word FANTASTIC! \nI am glad I read the reviews, and we decided  to come over.  Our f","useful":0,"cool":0},"S5nZcQhFsBk9CWveb25mcw":{"text":"NOLA has SO much more to offer\nNothing to expect from place like this. Try Rubi Slippers o","useful":0,"cool":0},"Ra074sOkiYxqMiYnFNOBAw":{"text":"The best little cafe to eat in the French Quarter, and the only one I returned to every da","useful":1,"cool":1},"uMLcLDC5ahD9Y0INT7b8SA":{"text":"Look, most hotel breakfast spots are underwhelming, or overpriced if they're quality. Cafe","useful":0,"cool":0},"SY9w2wlfEN_iPxyX_f_Tkg":{"text":"I wasn't blown away. Simple menu and simple food. Would prefer some bread options other th","useful":0,"cool":0},"e8DmiuUO5pqd11Je9eO_GQ":{"text":"Came here for brunch with some of my girlfriends on a trip to New Orleans and my first imp","useful":0,"cool":0},"L6A4NcZnayFFwxZtsR0T4A":{"text":"The waitor was a little rude, but the service was fast and the food was really good! The c","useful":0,"cool":0},"6_iZEXdJS104TwJswPBbNA":{"text":"Very impressed! Took me awhile to find this place because it shares a building with the ho","useful":0,"cool":0},"THMPMgd-WdABW2sntswCTQ":{"text":"Amazing location with a French atmosphere. It is a small restaurant and there were only 2 ","useful":2,"cool":0},"6syYaAUFIpVpvKYrGAhBag":{"text":"Service was superb. It is a very small place that favors groups of 2-4. We waited for 10 m","useful":1,"cool":1},"bayXu2JGKH9NR0bSsQl9uQ":{"text":"First of all, get the Café Americano.  That will kickstart your morning.  Crepes are delic","useful":0,"cool":1},"w9YzCknz30NAfhvdqMO-Cw":{"text":"$3 for a huuuuge cafe au lait which was delicious. I got the Benedict du jour which had br","useful":0,"cool":0},"Yl4MiCXjE8UJit9c5PmIGw":{"text":"Stopped by here for brunch before flight out and was surprised by the selection. Enjoyed t","useful":0,"cool":0},"ojFXEWbYl2yY-8HZIb4Y7w":{"text":"We visited for breakfast because of the ratings and the food did not disappoint. Unfortuna","useful":0,"cool":0},"wzqlsz70IFk3Cxg-LxiSGQ":{"text":"This is for sure the best brunch place in the area, once I find them, I come back every mo","useful":0,"cool":0},"ty4pMAEILuKzqMeegAnOew":{"text":"Great breakfast/brunch cafe not far off of bourbon street. We all got something different,","useful":0,"cool":0},"NsPR4C4n8dvUr6IO2sEyQQ":{"text":"Very quaint and cute. Awesome food with great service. I had the crab crepes and they did ","useful":0,"cool":0},"sOpuOfZsJXsrerm9eCce8w":{"text":"It's been a very long time since I've had such a good breakfast (caveat: I do consulting, ","useful":0,"cool":0},"4Zr5Z0Qh7KyAdTDjtuJnvQ":{"text":"A hidden gem of a breakfast spot that we randomly stumbled across it while looking for a p","useful":0,"cool":0},"FH7ZH4ejnfJR6Z6_GjUIpg":{"text":"Went to Cafe Conti for breakfast, I thought it was a sit down and get served place but it ","useful":0,"cool":0},"yU7Y9Ud7vR0WgM3za2VUAA":{"text":"I was staying at the Prince Conti Hotel with my mom and her friends. Cafe Conti is located","useful":1,"cool":1},"ij2AW_ZP8wnD1C_g4wK_TQ":{"text":"Wonderful food.  Wonderful staff.  Fun customers.  No line.  What more could you ask.  How","useful":0,"cool":0},"So56xK7bkkquKyosO0Z0-w":{"text":"Omelette was cooked perfectly and wife loved her dried fruit and honey French toast. No su","useful":0,"cool":1},"RjlqmqQWAyDVp2Ys1NUHkw":{"text":"Delish! Visiting the French quarter for the second part of our honeymoon and soooo many br","useful":0,"cool":0},"YBFsxGjaRjHb_x9knBDuww":{"text":"Holy crap this food was great. The best we had in new orleans during the quick stay we had","useful":0,"cool":0},"jnpkuJyJRdgpRlHQWxW-aQ":{"text":"It's a little place tucked in by a hotel and the food was ok. The crepes tasted pre made a","useful":0,"cool":0},"k30DElJvr4bcVFr9th7r2A":{"text":"Cute little hipster type place. My wife had the grit bowl and I had a po boy breakfast san","useful":0,"cool":0},"5CvXfJ7koEFDWqoklCH0sw":{"text":"A small restaurant at the corner of a hotel, and as worth of the brunch crown as anywhere ","useful":1,"cool":0},"V1V8PZmVBcurc13A7o-2Tw":{"text":"this doesn't have to be long....if you are thinking of getting in a forty five minute line","useful":0,"cool":0},"weHdQMUok3GOVhU8bT5ISg":{"text":"Comfortable and bright space. \nGreat, friendly and helpful service. \nQuick, hot and well p","useful":0,"cool":0},"alFf24yi2tqVPnbl9urzKQ":{"text":"So good. I don't like grits at almost all places I goto but just by the look I knew they w","useful":0,"cool":0},"4S7Y7Ol4hr_NHPCJ-ZNAfw":{"text":"Not many places wee open for breakfast in a Christmas Day. We are lucky to find this place","useful":0,"cool":2},"8GT8stQ0aaXAkZGF-HhDvQ":{"text":"Delightful, intimate cafe with excellent service. Had the Special of the day, eggs Benedic","useful":0,"cool":1},"ZYtnoC60-6ac6iCETZilwQ":{"text":"Nice server...benedict of the day tasteless...wife's crepe OK...not recommended...not a lo","useful":0,"cool":0},"47FYCdv-aRyvf6JYpdQcFg":{"text":"If you're looking for a place to eat Cheese Grits, I highly recommend to eat at CAFE CONTI","useful":0,"cool":0},"oRZSupURUyMF6qPLiajfrw":{"text":"Can't say enough good things about this place. The staff is very pleasant and accommodatin","useful":0,"cool":0},"9cKzGQ8ewGILunXAcIIZNQ":{"text":"The food was amazing. I had the crab and brie crepes and my wife ate the bacon basil bened","useful":0,"cool":0},"wwgoQU8KMXwhqcyVoz14pQ":{"text":"Don't miss a stop at this quaint cafe next time you are in New Orleans!  I ordered the cra","useful":0,"cool":0},"FBMIW012tz2a6t00y08OYA":{"text":"Best breakfast/brunch in New Orleans, hands down.\n\nThe Grits Bowl will make you wonder why","useful":0,"cool":0},"5bmwb0ijnyozruhXb3N7Lw":{"text":"Really liked this place for breakfast. Quiet, not over priced. Cute little place. Would de","useful":0,"cool":0},"b-UJUJN8gtGrOQJz_NwwPw":{"text":"We had an excellent brunch here on vacation! I had bacon, scallion, brie, and apricot crep","useful":0,"cool":0},"ELH5GrSvytLNXtHseE4O9Q":{"text":"Empty restaurant and I couldn't even sit at the table I wanted. Aztec mocha way too sweet ","useful":0,"cool":0},"wFq11fC2bR5g9tezAwIVlQ":{"text":"This place is so cute and delicious. We came on halloween morning and the music they were ","useful":0,"cool":0},"nLAYnovHtv9ukxqIJidXxA":{"text":"Great spot for a quick breakfast bite! Friendly servers (though that was the norm througho","useful":0,"cool":1},"SWyxA4cq7G3rCIV69TRY_w":{"text":"Didn't even wait to get seated. The personnel behind the counter were rude, dismissive, un","useful":1,"cool":1},"AvAQOXPtPm0m-9Qbnk4E9w":{"text":"Delicious, creative and less heavy than neighboring cafés. They offer an omelette, Benedic","useful":0,"cool":0},"erhDnqPSCJvftvJMZlaM4w":{"text":"Excellent breakfast next to the Prince Conti Hotel.  I loved the omelet with bacon and che","useful":0,"cool":0},"1g4lfsasfO8dvJm1CGRjvA":{"text":"Delicious, cute little eatery. Fast and friendly service, beautiful presentation for dishe","useful":0,"cool":0},"YWJ_ZV1MK6i3cSJ6anbAbQ":{"text":"We had the Crab and Brie crepe (crab in every bit) and Croque Madame (perfect). Cute cafe ","useful":0,"cool":0},"bbvapVac3SiPJ0bQCk3R9g":{"text":"This place was amazing! Small little cafe in downtown. The servers were so nice. And the s","useful":0,"cool":0},"RG1L-nex1l9nmtanCiknXw":{"text":"We had a delightful breakfast here. Service was friendly and explained the details on some","useful":0,"cool":0},"7BHHZt1ZL_bHTFpNIv5BkA":{"text":"The food here was great.  Tucked away location.  Good service.  All 3 of us loved our dish","useful":0,"cool":0},"0l8iZ0jCyknLiBPneiH9QQ":{"text":"Had the Corque Madame..... Best meal I've ever eaten!!!! Cute quiet little spot. Service w","useful":0,"cool":0},"-38itWSmzDxKQIKU5cRvHw":{"text":"Trying to get away of fry in NOLA found Cafe Conti. Great antipasto salad for me and lox a","useful":0,"cool":1},"scn093B7wmO9zDxbUbMnfA":{"text":"Excellent crab & pepper benedict and delicious crepes...though they are under staffed. Wou","useful":1,"cool":0},"LkUiKAJozTX8Bqd3oH5vyQ":{"text":"Go for the spinach crepe!  It was amazing, satisfying, oozing with melted cheese and price","useful":0,"cool":1},"fhW22KBsv7zswDymnn29cw":{"text":"Excellent, low budget kitchen with a no-waste menu mentality. Great kitchen to support the","useful":0,"cool":0},"14H5LhYh8Gxk8GUqRcVt2Q":{"text":"Great service wasn't a huge fan of the food but that may have been do to what I ordered. T","useful":0,"cool":0},"jX13D9WqxY4wI_W3SMBWyQ":{"text":"Amazing!!! By far our favorite breakfast of our trip! I have the Brie sandwich and my husb","useful":0,"cool":0},"dj9LTaqDDf9cuMN7V4ETSw":{"text":"My Special Benedict of the day was fantastic. Cute intimate cafe just off the street insid","useful":0,"cool":0},"nHJ-xZoaq8cvKY_GFlkeDA":{"text":"The food was great and the service was fast and friendly.  My wife had the crab and Brie c","useful":0,"cool":1},"LXD4Ehn-awVLu_3kqCt_ag":{"text":"Statt is pretty rude and the food is ok.  Nothing to brag about considering the service.  ","useful":0,"cool":0},"85sAOU2NUGgl8hSBmhk-Gw":{"text":"So so so good!!!!!  Can't say it enough!!!!  I had the bacon artichoke Benedict.  It was t","useful":0,"cool":0},"xCtd4SyJxtmKSdX34Uy9dA":{"text":"So on my last morning in New Orleans I decided I would try out Cafe Conti for brunch becau","useful":1,"cool":0},"oqcJgfwWbmN5GsjWzYZGow":{"text":"Favorite breakfast in the quarter! Spinach, bacon, gruyere cheese, onions, topped with a f","useful":0,"cool":0},"iPb7u7RKWCNIUBeu2WBJ2w":{"text":"This cute little cafe has my heart! On a morning stroll, we stumbled upon this cafe and de","useful":0,"cool":1},"Xanme1K88Bl074b3qy_spA":{"text":"Delish!  Croque Madame is rich and fabulous. Quaint little cafe. Visit this place on your ","useful":0,"cool":0},"H8xtSLJqaT45iLC4LYBtuw":{"text":"Unsuspecting place, quiet, small, but wow the food is yummy! We got the chicken hash and t","useful":0,"cool":0},"NEOE1jX6uyddpZGb6-Qr4A":{"text":"This was a beautiful little cafe find! I had the spinach crepe and my friend had the beet ","useful":1,"cool":0},"SsFpjqTO19L79P4cejrXQg":{"text":"A very good breakfast choice. Nice location in the French Quarter with a small but interes","useful":0,"cool":0},"q1GvxLv0Hh8CxEjjRvNPWQ":{"text":"I just wanted a quick bite of breakfast and decided to walk over here since it was close b","useful":0,"cool":0},"gO7nOtq9G3lXKAQAaJWPlw":{"text":"Was a let down we wanted to try a cafe au lait or latte but the waitress informed us the a","useful":0,"cool":0},"QGv60gJPNNSgACQhz5FlGA":{"text":"the breakfast poboy was a gift from heaven sent to soak up all the bad from last night... ","useful":0,"cool":0},"gc1R6uCXatfL041houVL5w":{"text":"Great food . Great service. Everything fresh. Crepes very French and big.  We had the ham ","useful":0,"cool":0},"B4_25315YdWNiLb5tl3u-Q":{"text":"Definitely worth a visit if you come! Everything looked so good that it took my friend awh","useful":0,"cool":0},"F6cbFrrKzEnOU9mvOe0qjw":{"text":"Great little breakfast place.  Light to heavy,  pleasant service,  tasty food.  Good value","useful":0,"cool":0},"l59IiVL1JHgUowRkJDee7A":{"text":"This is not exactly a hidden gem, being a block off Bourbon it sees plenty of traffic. We ","useful":0,"cool":0},"aHFniIZ5W69vSLu9hE1v4Q":{"text":"Went here as a last minute breakfast option before heading to the airport. I got the cream","useful":0,"cool":0},"EdQIhkeZMlePqlWOGVJE_w":{"text":"Very good Croque Madame, and a good sized portion too. Cafe Conti had a variety of great c","useful":0,"cool":0},"uNx0CqtanM-3F0pfaFTPyA":{"text":"I had a crab and Brie crepe and it was pretty good. It had a good amount of crab inside, a","useful":0,"cool":0},"LxAvQMINeLHryybARQ3A0Q":{"text":"The food is amazing and even though the service wasn't great I will still give 5 stars for","useful":0,"cool":0},"zVnbOQOl2hsEDKAAL_UHMg":{"text":"Great atmosphere. Unique breakfast offerings and the wait staff was friendly and helpful. ","useful":0,"cool":0},"NEAdgmjsGpQ9p4-OlF2DxQ":{"text":"Amazed, seriously amazed! I stumbled on Cafe Conti, as I walked by and looked in the windo","useful":0,"cool":0},"iFzJ6VGnAIcJ2PmcWTYz-g":{"text":"Low key, small venue with great coffee and really good tasting food.  I'm not really a cre","useful":0,"cool":0},"j6h_SuZxLBPQ3V_LlIY5-w":{"text":"While in New Orleans for our last day, my sister and I were in search for breakfast food. ","useful":0,"cool":0},"vrK6etPLREeXvJZgB5cMsw":{"text":"Ordered two cafe au laits today -- the barista handed me two empty cups and pointed to the","useful":0,"cool":0},"vN1kivgej3z8yLy6lfPjxw":{"text":"This small cafe is amazing! Delicious food. Great atmosphere! Meeting and talking to rando","useful":0,"cool":0},"llK3Z01wzqLCoSbQloFZzg":{"text":"So glad we stopped by for this place! Cute and quaint little restaurant with friendly serv","useful":0,"cool":0},"bVG3vGRGDYq_m4cQ5Gk7tA":{"text":"We stopped in for breakfast and were pleasantly surprised! Fresh squeezed orange juice was","useful":0,"cool":0},"tnhLCGCp3O5S8ozX0MruFA":{"text":"Does not look like much from the outside, but both the food and service are excellent!\n\nTr","useful":0,"cool":0},"ZPPfIP7pjzE0heWPv7ly8w":{"text":"We came here for breakfast our second day in NOLA. The two ladies who took care of us ther","useful":3,"cool":3},"VUYsNxnlXMRU8oHamL1VEw":{"text":"We enjoyed our brunch enough to return another day. Great service. Yummy food. Nice atmosp","useful":0,"cool":0},"1c_U7729xRfRysPlZYBBMA":{"text":"The food and people here are outstanding! My husband and I have been underwhelmed by the f","useful":0,"cool":0},"I7liQB8_WUHv1FemH8fANw":{"text":"Another awesome joint! Though the place is small, it was totally worth it. Lucky for us, w","useful":0,"cool":0},"B-U8vE14DBRY5XkNYdDX-Q":{"text":"We came here because of the reviews and with the intention of ordering the crab brie crepe","useful":0,"cool":0},"tbl0GfRMspuj54hUG1-wmQ":{"text":"Great food and super friendly staff.\n\nNothing fancy for ambience, just good food and large","useful":2,"cool":0},"2IkA7ElS30mEprFJ_SwPvw":{"text":"We came to Cafe Conti on a weekday morning, so we had no problem finding a seat. Our serve","useful":0,"cool":0},"biXGXtYtYIkPl-Yoj1w1Qw":{"text":"Loved this place. Found it on Yelp, stopped in for brunch. Sat right down. Waitress wasn't","useful":0,"cool":0},"57UF68VXfAt2GgNqBcv2ew":{"text":"Excellent breakfast spot. Staying at the Prince Conti hotel, it was so convenient. The foo","useful":0,"cool":0},"FelbhpeYBWl_m25H4pwgZA":{"text":"Excellent croissant benedict. Service was great. People were friendly. No waiting unlike m","useful":0,"cool":0},"79KHz9BbMvPo04lxcKoGBA":{"text":"Very good food, fast and friendly service. One of the few decent breakfast places in the F","useful":0,"cool":0},"bCI90opVfPV0vAdatKvEag":{"text":"A very cute little place to have brunch. The staff was very nice and we had a good time. N","useful":1,"cool":1},"ZhJEL7vsVOCWGqCLuMyz7g":{"text":"Cute little hotel cafe. Very small and well spaced so you aren't on top of each other as y","useful":0,"cool":0},"NhStx4OHZ8pqutKc_bUTCg":{"text":"Breakfast was wonderful. Nutella and bacon in a crepe is a wonderful mix of sweet and savo","useful":0,"cool":0},"P_EBxk68XbJCxaUsFMT-dA":{"text":"Nice little cafe. Great service, menu and food. Could not decide what to order! I hope to ","useful":0,"cool":0},"S9RjSwsAMBU9JHTh4zq-XA":{"text":"Delicious crepes! Amazing White Chocolate Mocha!!!!! Great little spot for brunch in NOLA!","useful":0,"cool":0},"tCcqJIeW2FIhEvV4XyWNXA":{"text":"Good food and good service. We had breakfast and we absolutely loved it. The coffee was ex","useful":0,"cool":0},"FhIXSPwU3JmkDg4a_uW_Xw":{"text":"Today was my second visit here for breakfast and I was very disappointed. The staff seemed","useful":0,"cool":0},"E9ubiZRxRBmnnbyb-Lc8zw":{"text":"Stayed at the Conti so I ordered breakfast from here. It was amazing!! The banana Nutella ","useful":0,"cool":1},"L3y6Is1IhFAdVnSjn7vT6Q":{"text":"The service was excellent. Coffee was delicious and food looked amazing. Great breakfast s","useful":0,"cool":0},"DuRSAw3fSGzhTZRM-JoBLA":{"text":"Don't look for a better breakfast place other than Cafe Conti. It is a small place but bel","useful":0,"cool":0},"y2b5XJFVFEJcaTJ3zaIMSQ":{"text":"Super cute little cafe! It's a great place to rejuvenate after a night in New Orleans!","useful":0,"cool":0},"L34K73OYXvesaHXnGMUPwQ":{"text":"Breakfast this morning was incredible. We split the cinnamon applesauce and toasted almond","useful":0,"cool":0},"BqCX1AjAZr3kPwcSIjFnhA":{"text":"On our recent visit to New Orleans, we enjoyed a leisurely weekday brunch at the Cafe Cont","useful":1,"cool":0},"t0N2NGs8BlPlxqJCzQV7tw":{"text":"RUDE! We had Cafe Conti recommended to us. We waited a few minutes since all tables were b","useful":0,"cool":0},"dDE9x9Y7ELvFhV5jzCamNA":{"text":"Dropped in to Cafe Conti after seeing some of the other reviews. We arrived a little befor","useful":0,"cool":1},"3bDYlFHnBgRZo531NdNXoQ":{"text":"Nice menu selection. Great crepes, rightly matched with a well made espresso. Very courteo","useful":0,"cool":0},"sPmt0ZpaSxmPHDR4fyZEOg":{"text":"As soon as my boyfriend and I walked I to this place we were treated poorly.  We had coffe","useful":0,"cool":0},"MAAfOEUuact1JxiJimfvGQ":{"text":"HORRIBLE SERVICE! Rude and impolite! they need to learn manners and be polite! Sat people ","useful":3,"cool":0},"t4PXBoRGGvv-koiCda8YtQ":{"text":"This place is great! Well priced, clean, comfortable, and tasty food. They have great opti","useful":0,"cool":1},"uz0jq9omia-bCHjfDm5LsA":{"text":"Really liked this place for breakfast. Quiet, not over priced. Cute little place. Would de","useful":0,"cool":0},"VAjWrN-7wtDBfCC2zm1rSQ":{"text":"Great little breakfast spot!!! I had the salmon bagels & they were great!!! My only issue ","useful":0,"cool":0},"YUNwbFKE2qfXOFFzVJiYYA":{"text":"This spot is a little hidden and I almost passed it up and am glad I found it! The breakfa","useful":0,"cool":0},"hI8FhIwS5MpDm-BDIdQd7g":{"text":"We stopped in for brunch around 2:00 on a Wednesday. There was one other couple in the caf","useful":0,"cool":0},"aXqc1CVRUwq3Lf3pLMXksg":{"text":"Stopped in for a late breakfast with five friends on vacation. The food was delectable and","useful":0,"cool":0},"r9rTvKDlm3562EqLsf4XEg":{"text":"We came here as a second choice for brunch since our first pick was a 45 min wait. \n\nThe r","useful":1,"cool":1},"xOn3ruaQBudmhFbnkAoqJg":{"text":"OMG.  The crepes!! What???   Nutella and Banana for me, Peaches and Cream for her.  So goo","useful":0,"cool":0},"QaKyiVo2fJIdYkvE9RvzDQ":{"text":"Conti's Cafe is perfect. Sweet room, great coffee, beautifully prepared breakfast dishes.","useful":0,"cool":0},"3d_8Y3oTJz752Dea5zEB3Q":{"text":"Excellent service, great food. Had the Egg Benedict of the day which was bacon, cream of s","useful":0,"cool":0},"5hWg9tVKLuIu3zjguno6zQ":{"text":"Good food. Service could have been better. We requested sauce and never got it. We ordered","useful":0,"cool":0},"GNPtiwH3XKtV0DGZRSF8wg":{"text":"Had a wonderful server and great atmosphere . Very cute and quaint place to get brunch . T","useful":0,"cool":0},"CqlDdsTfReRukK8s7Zk9xw":{"text":"This looks like a normal 'café inside a hotel' coffee shop, but one look at the menu taped","useful":1,"cool":0},"8sJLEgyU2y2S8UnGILdbLQ":{"text":"Excellent coffee, food and service. Bacon, basil and mushroom Benedict on everything bagel","useful":0,"cool":0},"Zl6xuNOTxwZSzdljPjmZqg":{"text":"Great little breakfast spot located a couple of blocks from Bourbon St. The Chef is incred","useful":1,"cool":1},"--jt9aciwTBdGJqp76cYTQ":{"text":"Simple little cafe, but excellent food, cute setting, and great staff.","useful":0,"cool":0},"1ZvEzTVyXivwBJvs-t_pww":{"text":"So when you're in NOLA...Yelp can often lead you a stray. So many people come to town with","useful":3,"cool":1},"tcHjeIYP6w8zTWqfYuf29Q":{"text":"While visiting NOLA, I used Yelp to assist me with places to dine with my family. This res","useful":1,"cool":0},"lzdbSC7trHwP1hcUjYpopA":{"text":"Awful service!!! We got asked to wait outside because it's a tight space inside in which h","useful":0,"cool":0},"dnvPOudCkOfGZc09_frqCQ":{"text":"Great meal! Excellent service! Nutella crepes and the american were the hit! Everybody lef","useful":0,"cool":0},"lMY1leTOgz-M_SwjUXgGGA":{"text":"Last minute breakfast on Sunday was great. Clean cafe with good food. Service was friendly","useful":0,"cool":0},"uOpbuyLlu69vjE-LZ-hCPA":{"text":"what a great surprize this place is.  I was directed over here by sydney who works at vach","useful":2,"cool":2},"i1JpnTDHAEx6gpjLXu7k7g":{"text":"Very cute, petite cafe. The food was really good! The ham and cheese crepe with garlic sau","useful":0,"cool":0},"F_PBeWrl4d5T3N4ApDHFyA":{"text":"Yum!!!! Cafe Mocha smooth & delicious. Benedict of the Day - full flavored & savory.  Thes","useful":0,"cool":0},"C-TDCyeT3nlm9YpqGiecpQ":{"text":"My two experiences at Cafe Conti were both delightful. The first morning I ordered the MIX","useful":0,"cool":0},"l_j2uowX2HxUiVyYN8d9pw":{"text":"Strawberry chocolate crepes and the banana nutella crepes were absolutely AMAZING! I would","useful":0,"cool":0},"f9B-9LeXZInU8sLxtJH_Sg":{"text":"This is my favorite Café in Nola! Perfect brunch, low prices, elegant and cute decoration.","useful":0,"cool":0},"ckAcXhFmxAiEVLOjtBXcEw":{"text":"Quick solo breakfast. The espresso machine was broken, so I got a regular coffee with milk","useful":0,"cool":0},"KWC1dBJeTSLB0phdO5m0Fw":{"text":"Service was great and I don't know how! There's one server for about 8 tables, all orderin","useful":0,"cool":0},"WjDqaFPy6md_isx8t7rIPA":{"text":"Think twice if you don't want to be treated as a \"less than\"\n\nI would like to have said th","useful":0,"cool":0},"YSXi1X4eU-vIywhuKavWZQ":{"text":"Owner was a complete Asshole. Wouldn't allow any changes to food even at my own expense. G","useful":0,"cool":0},"hzuSEWbOM9N2PZvt7U6JNg":{"text":"Quaint little cafe . Quickly sat and great service. I had the omelette special which was a","useful":0,"cool":0},"Y1FYlw5dQZDXXiuYWZlouA":{"text":"Cute little place with amazing food and nice, attentive staff. Definitely a must when visi","useful":0,"cool":0},"X4UW-fHmKz955SPk1f-1fw":{"text":"Crapes are less than average not impressed, IHOP is better.. Do not pick this place if you","useful":0,"cool":0},"KCtPL-MH5vyfGfcxjyvANA":{"text":"Gorgeous interior, absolutely delicious food, and good service. A welcome quiet spot off o","useful":0,"cool":0},"Fk0L7Jc-ZOQXzjYuZlkLXQ":{"text":"Our breakfast spot twice this trip! Eggs benedict and savory crepes with spinach and Gruer","useful":0,"cool":0},"_TCn8c27tdrHxFQjFUyltg":{"text":"The sweetest staff who do their best to accommodate you. I ordered the lox bagel and it wa","useful":1,"cool":1},"3kza4mt05wnEF5FHCgOz9w":{"text":"I stayed at the Prince Conti Hotel when I was in New Orleans.  This little cafe is a great","useful":0,"cool":0},"drx88dnWR-9j3Zxa6SQS8w":{"text":"I thought my husband ordered too much food.  I just wanted a quality latte and fruit.  I'm","useful":0,"cool":0},"u0nEXyw6Z7zD157y7SAR7A":{"text":"I only give it a 4 star because I only tried 1 thing from here...which was absolutely amaz","useful":4,"cool":2},"gQgElR-h5l94qQV9xZLRpQ":{"text":"Small 30 seat place, which excellent crepes and Croque Madame.  We didn't try them, but th","useful":0,"cool":0},"8GRqprPVO3xAHO2Ch4pKMQ":{"text":"This little place in the French Quarter has a great menu for breakfast and brunch. The ser","useful":0,"cool":0},"FvgluKvXeqV9KsUM-UO-9Q":{"text":"Cafe Conti offered quality breakfast in the heart of New Orleans. Everything was fresh and","useful":0,"cool":0},"rJgpyKlBfW50SsmGgxlUgQ":{"text":"My brother and I were searching for a breakfast/brunch dive and we could not have found a ","useful":0,"cool":0},"8Oz1HEnqKYGCnZwuavNimw":{"text":"This place is a gem. \n\nSunday morning 09:30 only about 2/3s full. GREAT Benedict, good, st","useful":2,"cool":0},"9LEosHL73buSHXTaPnBfdg":{"text":"It seems that a good time to come is at 1pm on a weekday. The place was dead. Totally not ","useful":1,"cool":0},"lDn8goIA6M8AN2dc2AMUDA":{"text":"Awesome food! Grits buttery tasteful perfect! I loved the Benedict-I got it without meat a","useful":2,"cool":2},"rAY9vgvkXsuvJzb5rEJW5Q":{"text":"This is a small restaurant with great air conditioning. The service was excellent and the ","useful":0,"cool":0},"6xvOdFfHgml5-wsacbjiDQ":{"text":"Cute cafe at the conti hotel.\nThe cafe at lait was great, the fruit parfait was good too b","useful":0,"cool":0},"8zPzrdsbZnrqiIAx6obhKQ":{"text":"You have to try the bacon, apricot, scallions and brie crepe. We stayed at the Prince Cont","useful":0,"cool":0},"ywk5F_j_CJLj8gYT2nEqqw":{"text":"Had a really nice breakfast here today. The wait staff were pleasant and attentive, the re","useful":0,"cool":0},"uG34D_K-BY2LzCMRk7-s1w":{"text":"Had the breakfast Po' Boy and it was SO GOOD. This place is a much welcomed oasis on the b","useful":0,"cool":1},"wf5_N88d4o6ln93B-YCl7w":{"text":"The Benedict was really good! Also got the chicken hash and it was decent.. I rate this a ","useful":0,"cool":1},"b9BdgONfB6LyWQ_agrTVaA":{"text":"What appeared to be a beautiful meal on the outside was a disgusting concoction of 10 laye","useful":1,"cool":1},"LdFpwXXXOR9ggQkNPnqfuQ":{"text":"Went for breakfast during our vacation at this quint little spot. First of all my cappucci","useful":0,"cool":0},"arWGCfS0L36dG92G3GR4IA":{"text":"Wow! Herbed mushroom and roasted garlic Benedict. The BEST breakfast I've had in NOLA.","useful":0,"cool":1},"FHnu1ELqFAaEj4iGjtOYzA":{"text":"We were pleasantly suprised with this place for breakfast. \nWoke up looking for a place to","useful":0,"cool":0},"2j-qFWLgmPP2-4kvmGs9rg":{"text":"I will give this 5 stars because it seems consistently good. I think everyone will enjoy t","useful":0,"cool":1},"HDEKH-e_GXBP-Y8kcnattg":{"text":"I can't express how amazing this place and the food is! We went here because yelp recommen","useful":1,"cool":0},"7GLbGeflYhBvthFhUCWbHQ":{"text":"Coffee was wonderful and since it was so early got to talk to the cashier/ coffee maker sh","useful":0,"cool":0},"zsyEqifaHIGUE2NnxkLwrw":{"text":"The food was really tasty, but needs attention.  The food lacked enough moisture-- bread p","useful":0,"cool":0},"SJn4ZM5x2sbVRaAw4C-rTQ":{"text":"This little place is definitely a gem! The specialty coffee drinks are AMAZING!  I tried t","useful":0,"cool":1},"BNI1UuSC53vt6TsKrUAEdw":{"text":"Excellent service and food ! \nIt's a small cozy cafe - you will step into time to a small ","useful":1,"cool":0},"_Pz65_Q2UZ6ruh34uwrxCw":{"text":"We had hope to try Cafe Conti since it had so many great reviews but that idea quickly dis","useful":0,"cool":0},"PVbfBZsb4DZkcQHn9wAAaQ":{"text":"Just awesome. Perfect brunch on Sunday morning.  Service was super and the omelet was perf","useful":0,"cool":0},"iCFnQozd2guvkVjMQEjP2g":{"text":"Party of 6 seated rather quickly, friendly staff\n\nEggs Benedict with sausage and peppers w","useful":0,"cool":0},"5ItGQycvdi7_6bFWjB_yDg":{"text":"Omg all I can say is best food in town fresh !!! And not expensive I absolutely recommend ","useful":1,"cool":0},"7kgO6tcAfpPLtxCDvENINg":{"text":"Great.  Had the Benedict of the day.   Wife had bacon, creamed spinach crepe.   The 5 star","useful":0,"cool":0},"Hi1GPnLMgE7JfmJJrZHSRg":{"text":"Benedict and crepes are very good.  Great location and ambience as well.  Recommended.","useful":0,"cool":0},"8WmdBV7jP9vZY9NwwXhy6w":{"text":"While the food was pretty tasty, our server was so rude and that is why they're receiving ","useful":1,"cool":0},"VDjGRUT2VXE-77RDD85wUg":{"text":"We had this place for breakfast on our second day in town. It was really good and fast and","useful":0,"cool":0},"YvRjVsEnBYWRFMXESfJI2g":{"text":"There's an unfortunate dearth of reliably decent breakfast spots in the Quarter so this pl","useful":1,"cool":0},"VR-ZlYPIW20BdKf_mkoB-g":{"text":"Our hotel suggested this place for breakfast.  We got there early and the staff was lovely","useful":0,"cool":0},"bvQvKzItlPDnoC2Tg-RAqw":{"text":"Tucked away right inside the left front windows of the Prince Conti Hotel in the French Qu","useful":1,"cool":0},"toyNOF2Erw2-rwqSiC3FnA":{"text":"Very cute, yummy breakfast/brunch! Feels very French, good omelette, lots of crepe options","useful":0,"cool":0},"tI-XmxyWYJWwASGGDEuPWA":{"text":"Walked into this cafe and were seated immediately. That's were our good service ended. We ","useful":0,"cool":0},"Mw0fk-u-4QnaI9VL2koKbA":{"text":"Unassuming cafe inside the hotel, but we loved the breakfast as others around were raving ","useful":0,"cool":0},"LjBS3W8Ycbq-ltHAlNKjTQ":{"text":"Second day here in the city and I had my eye on this place. So glad I followed my intuitio","useful":0,"cool":0},"I4rGKWTMuiG_WdcooQwsQA":{"text":"Showed up at 2:45 guy was very rude and said they were closed.  We ubered across town to c","useful":0,"cool":0},"_MZJFM-MswwriQ6zQ6NKDA":{"text":"Love the decorations, love their crepes and coffee! All at a reasonable price! \nBeen there","useful":0,"cool":0},"4kfQX-9Koe0QoYkEzuZB_Q":{"text":"We stayed at the Prince Continue hotel and this restaurant is next door. The food was awes","useful":1,"cool":1},"v3j6qtYm9yY-2thhYheHaA":{"text":"A great place to find breakfast in the French Quarter. Be warned - the breakfast will be h","useful":0,"cool":0},"0NunD_hc3ciLlKLkHWjbow":{"text":"Delish! We went for Sunday brunch and were able to sit immediately. I ordered the crepe wi","useful":0,"cool":0},"QA7nLo5jqF_4tpynSVdBUw":{"text":"Live downtown and decided to give this place a try based on reviews.....was not impressed.","useful":0,"cool":0},"x8dskORpywRhRXWkghHo0A":{"text":"Got breakfast to go. Food was good. Slightly better than what you expect from most breakfa","useful":0,"cool":0},"kn8XO-NDG4VMpMIFVL5dpQ":{"text":"Holy schmoly, the shrimp & grits here are SO GOOD!! It's made with magic, I believe. It's ","useful":0,"cool":0},"LhgbCaEYNh07MW-Lvmwb6w":{"text":"My friend and I visited New Orleans last week and were eager to get a hearty breakfast bef","useful":0,"cool":0},"j6lqQo4qP9iPZvnEqdrlmQ":{"text":"Cute little spot in the French Quarter. Great food and service. The crepe with cream spina","useful":0,"cool":0},"9xwfH7T_aj3AhYNJ8VVu7A":{"text":"Delicious. We came here just after we landed.  Highly recommend the grits bowl.  Creamy gr","useful":0,"cool":0},"4BrLeG9WsTdp3gBwxC9Fxg":{"text":"The worst host ever. We left due to bad hosting. The host was not friendly at all. He trie","useful":0,"cool":0},"36RuQ98u8SdJv9emTDQbkg":{"text":"Another Yelp win! After crashing and burning at about 3 other brunch spots (wait time of 4","useful":1,"cool":4},"XJNCbCDfFisEDDvVhSBW6A":{"text":"Great location!!! Good breakfast, average prices, fast and friendly service!!! Had the cra","useful":0,"cool":0},"1CUnACnjlV4DZ2Y6TqyMQQ":{"text":"Not bad. Not bad at all. I had a Croque Madame. It was tasty. The staff also makes for an ","useful":0,"cool":0},"98RjXnCk74TNQTV1SCf5mg":{"text":"Food was good- nothing amazing but def good. Atmosphere a bit strange with no music and wa","useful":0,"cool":0},"IjZRrsTSkZEroqubW5edwg":{"text":"Terrific service and breakfast at Cafe Conti! The grits are to die for and the coffee was ","useful":0,"cool":0},"yWrxpGfAm6M-Q2WBbbjRrQ":{"text":"AMAZING! My favorite brunch place in new Orleans. Order the savory crepes! Very cute place","useful":1,"cool":1},"AVVLI88AZ0ffdnL8P_1S6g":{"text":"Great food! Only removed one star bc my water cup was a little dirty and the waiter seemed","useful":0,"cool":0},"PxZRqRaC7LWz2OEw2mBl3g":{"text":"Very puzzled by the high number of ppositive reviews of this place. The crêpe was quite ba","useful":0,"cool":0},"9uc0JTq8GbAt6CigxWVy4g":{"text":"What an amazing little find for breakfast!  Delish for both food and drinks!  Was crowded ","useful":0,"cool":0},"cR3kNR77-lVnBKXVLlalbw":{"text":"The croissant might be the greatest thing you ever put in your mouth....\n\n10% off if you s","useful":0,"cool":0},"pCuz_ga-XC8QrbfCvdhsug":{"text":"My family is picky and after doing a little research found this hidden gem . Our server (D","useful":0,"cool":0},"Gzz3IjQ3RqtKAi7ehCz9sA":{"text":"Excellent off the beaten track location for a great breakfast.  It's in one of the boutiqu","useful":0,"cool":0},"9dBy4Hl4cUT3MedKKUKB6g":{"text":"A profound breakfast experience. We had the savory spinach and bacon crepes and the grits ","useful":1,"cool":1},"L_ZWq5AkMpXA7Anf7foD5A":{"text":"The only thing about this place that I would change is that they don't take reservations. ","useful":2,"cool":2},"OCG5O4MulFSJqQwyqFP5bQ":{"text":"We had a great Sunday breakfast here.   Small and quaint with good food. The croissant bre","useful":0,"cool":0},"xx9nMOFFr0vx9g2jFZx8Ag":{"text":"The hostess was very unprofessional and racist. We had a party of 7. I suggested to have u","useful":0,"cool":0},"Z0pS3imGJpoQnI50E0U3-w":{"text":"Brkfst at Cafe Conti was a delightful experience after all the noisy, hectic meals we have","useful":0,"cool":0},"PKVCyCeZ6njVXByOK9t-bA":{"text":"I would've given more stars if it not were for the fact that my dish was necessarily \"hot\"","useful":1,"cool":0},"x20Ii--fKVxQ01u_GqTjFQ":{"text":"Excellent little cafe that servers up some real good brunch.  Had the breakfast poorboy an","useful":1,"cool":1},"si1HDx3SHpZKQSSRFADOPQ":{"text":"Based on the ratings and photos we were very excited to try Cafe Conti for brunch.  Based ","useful":0,"cool":0},"IEu4V4nE9eeXdn5y6NXNNw":{"text":"Dude, seriously.  You have to eat here for breakfast.   The benedict of the day was amazin","useful":0,"cool":0},"uKByJrO7BIGVEBout_fM5w":{"text":"Came here with my family of 5 and we were all very pleased. The atmosphere was great for f","useful":0,"cool":0},"7WlYqT-dg6Kz9vVZtj9BqA":{"text":"This place is a hidden gem that we would have never found without yelp!!  Best breakfast i","useful":1,"cool":0},"JQirPoR7KXF7gtSiOiIcCw":{"text":"Loved the ambience of this place and the breakfast was delicious. We had the salmon with c","useful":0,"cool":0},"hBgYyC9Lunjlz7FlTZ6eqA":{"text":"Wonderful staff, great coffee, and the most excellent food. This place is tucked away just","useful":1,"cool":0},"bHB4WMNY_GBY6eycAABRAQ":{"text":"This little hidden gem is without doubt my favorite breakfast spot in the quarter.\nIt remi","useful":4,"cool":5},"BJ9dvebAkp6qrGdS55QO_Q":{"text":"Amazing little cafe tucked in right off Bourbon Street. Quiet and cozy with incredible foo","useful":0,"cool":0},"YVyURWBkiXHahB4_EszJzQ":{"text":"Great little spot! There was quite a wait because the place is tiny so we went to Erin Ros","useful":0,"cool":0},"bwiwMUHh6NaKOrDB6jH9Nw":{"text":"After reading reviews, I was excited to check this place out. \n\nI ordered the apple, cinna","useful":0,"cool":0},"EIt6CEW-xzCOdyaBaBkEvg":{"text":"Excellent service - staff serves all tables in this one room 20 person max restaurant. Par","useful":0,"cool":0},"D2w7QsuuthZEAzKw6Rn7YQ":{"text":"What a great place for breakfast! Small restaurant nest inside a hotel. I found it though ","useful":7,"cool":5},"mNb9XlWkqKsqJJsMMuL0kg":{"text":"Hands down, one of the favorite meals I've had in NOLA. It is located within a hotel and i","useful":0,"cool":0},"A4y6UndEl2vADPmtHx1Mng":{"text":"Wonderful food. I had the crab,Brie crepes.Absolutely awesome. Small and personal. Highly ","useful":0,"cool":0},"QAECQ7gE-7CKN868zNnN2A":{"text":"We went to N.O. two weeks ago and before we went I searched for a good breakfast place & C","useful":0,"cool":0},"YMsdZBFMuKDLb6YBLOUmXQ":{"text":"Great little place. Great coffee. Fantastic service. I have the crepe with the Brie and th","useful":1,"cool":0},"8ML3iKQL6pcFHvkGXDLrGg":{"text":"Great cafe, food was delicious and the cold brew coffee was seriously AMAZING. I wish we c","useful":1,"cool":1},"4fYkar7SfKzH_nzQBuVWFA":{"text":"Amazing spinach crepe along with the French toast Benedict.  Great space and helpful staff","useful":0,"cool":0},"_O0cusWMcmOKEa5zJiMjlA":{"text":"Very yummy food. The servers were friendly. I came here twice for breakfast while on our t","useful":0,"cool":0},"uwrl3HyGGVXjWZAicb5bDw":{"text":"Very lovely atmosphere and an impressive array of dishes. If you're looking for a casual y","useful":0,"cool":0},"CMsdmLD55pe0JmbaWMmpjQ":{"text":"Such a poor experience here, the only saving grace was the food.\n\nWe ordered the Creamed S","useful":2,"cool":0},"ib4QrXlfYpurXhFbDeq5mQ":{"text":"Wow, what a pleasant surprise! . This is the second time I stayed at the Prince Conti hote","useful":0,"cool":0},"8mjUd10t1KyRRytPQdEzpw":{"text":"Great little nook in a quite hotel French Quarter.  The service is friendly, great coffee,","useful":0,"cool":0},"NWPWsHN7Pfwx1-1Jt8Ohtw":{"text":"This place is super cute! We ordered the crab and brie crepes and the spinach with egg cre","useful":0,"cool":0},"WAvNd8nPM6DbIhKPEPXdzg":{"text":"Stingy.\n\nWe came here for breakfast and were disappointed by the lack of southern hospital","useful":0,"cool":0},"EriyEs8bkQsw2ivHv2kgAQ":{"text":"delicious food and coffee!\nWe kind of stumble upon this place by luck and thought about go","useful":1,"cool":0},"RnAq3x4u8xiiQvmm1xp4mA":{"text":"What an amazing find - love the food. Didn't know what to eat -  got a recommendation from","useful":0,"cool":0},"M1b5IAiY4BcinDKOdk6_9g":{"text":"Super rude staff!! The employee guy fired us from the restaurant and said we have to wait ","useful":0,"cool":0},"z9Vez1GyyLU9RT-o9MKKEg":{"text":"Very, very delicious! The shrimp and grits were amazing! The cafe mocha was the BEST I've ","useful":0,"cool":0},"C1AS9EsQV0eYxPPtm9dLyA":{"text":"I went for brunch and had the American. Although the portion size was too large for me, wi","useful":1,"cool":0},"jQzmJNpVdepFNL6lOugkrA":{"text":"Rude servers .... Didn't greet our party of six .. would cut us short while we were trying","useful":0,"cool":0},"evGDzJ-eoeTOH9-RVWsz8w":{"text":"Highly recommend this place! It was so delicious! I recommend the crab crepe it was so del","useful":0,"cool":0},"mvNBHjNCAHwRdXuyi2lfZg":{"text":"Cute place, lovely breakfast options, including variety in their omelettes and dish of the","useful":1,"cool":1},"Li92AUECYvBJcIn-75hIKA":{"text":"This is a smallish cafe inside a hotel. The decor is very French cafe like and clean. The ","useful":0,"cool":0},"9MWjCLzjRP5oLxrwkZtaVQ":{"text":"We had the Creamed Spinach, Sunny Egg, Bacon, and Gruyère Crêpe. Nice.","useful":1,"cool":1},"cSQBkWMGkyTHwol4zqPRTw":{"text":"We went here based on reviews and were disappointed. The service staff was wonderful, but ","useful":0,"cool":0},"xam4vpIcvpz8a9RhWKYrkw":{"text":"Got the croque and crabmeat crepe, excellent. Aztec mocha was also great. It wasn't very b","useful":0,"cool":0},"5fUbSOw638dohf8GJrv21w":{"text":"We were starving, and this place definitely worked for that.   That being said, the food i","useful":0,"cool":0},"HxYOZbzWjdJbcwJCZu17PQ":{"text":"Came here in the morning prior to our tour for a quick breakfast. The restaurant wasn't pa","useful":0,"cool":0},"k1UzmUr6wRUI6JC7B-bDSA":{"text":"In one word FANTASTIC! \nI am glad I read the reviews, and we decided  to come over.  Our f","useful":0,"cool":0},"caPCq0Kt3jv-D3p-1ULTmg":{"text":"My wife and I tried out cafe conti and we were not disappointed. She had a ham crepe and I","useful":0,"cool":0},"qtxRsgXjZrg_NNlt8sn52Q":{"text":"The food here is so good. I had the ham and cheese panini, my bf had the French toast. Bot","useful":0,"cool":0},"tjMwWarjJqFRa2sezMqpMA":{"text":"An excellent breakfast menu including eggs benedict. Service could have been better but I ","useful":0,"cool":0},"OCppdI2f8JEcLtYpdJhW1A":{"text":"I had the shrimp and grits and my friend had the crepes. Both were great! Portion sizes ap","useful":0,"cool":0},"T29u9kh18Ciq2mTCwo76zw":{"text":"Great food, fast and prompt service. What more can you ask for? I had the Benedict of the ","useful":0,"cool":0},"jFK9T1lXyOQDAGq5KCKRKA":{"text":"Fantastic intimate cafe environment, friendly staff & great service. Amazing brunch/breakf","useful":0,"cool":0},"fjWwmmqMhbPdEUo4AnVMow":{"text":"Out of town and wanted breakfast and they didn't disappoint! Enjoyed it with my wife and o","useful":0,"cool":0},"3ibq_l7xL7MSteSHpjGr0Q":{"text":"Tiny space with great service and wonderful breakfast/ brunch choices.  We had a crab cake","useful":0,"cool":0},"oMLLqKgpPZJDq6RWqEim4Q":{"text":"The food here was so good we came back a couple times while in New Orleans. My favorite wa","useful":0,"cool":0},"29nCrVGMhpWqrhKmzWntDA":{"text":"This place has one of the best breakfast/brunch in town! I highly recommend it and their s","useful":0,"cool":0},"9XjmMVevOfccm4H4huWThQ":{"text":"Such a cute hidden gem, The breakfast was amazing and the staff was very pleasant, I'll be","useful":0,"cool":1},"IAqg1RAZ6lKCPTk1ueObFg":{"text":"My wife suggested we eat here and I love her because she knows how to pick em! Seating is ","useful":0,"cool":1},"dST9qnHlxrdsA-nBCLNUQw":{"text":"I was a little surprised to be the only people in the place in a Sunday morning. A few fol","useful":0,"cool":0},"DWA5TpvDz_K5jiU_2iNjMg":{"text":"Truly the best Cafe Mocha that I've ever had!  Grits to die for! They're pretty busy so do","useful":0,"cool":0},"qfQc9zE8C2BcJ6vQO0ki-Q":{"text":"Although the place is small with limited number of tables, the ambience is very quite and ","useful":1,"cool":0},"dNwJBxWnwe9y_uU06jKAuQ":{"text":"Awful service!!! We got asked to wait outside because it's a tight space inside in which h","useful":1,"cool":0},"1_XtuoK-FSYCnVK7jw0ecg":{"text":"Great food amazing coffee and nice workers lots of New Orleans charm. Great location and a","useful":0,"cool":1},"qMMW3wYCBNt2QKzrFIFEEg":{"text":"Excellent crepes friendly staff and only a small wait even in the busy season it's small a","useful":0,"cool":0},"VL1DFvayYwVDaEH930Wzjg":{"text":"The tiny little cafe felt like a piece of Paris stuck in the Crescent City. Even the floor","useful":0,"cool":0},"a0jN2Si_W9YSphnhlLCz_w":{"text":"We have breakfast twice this trip to NOLA and will probably have it for our last breakfast","useful":0,"cool":0},"Qz45NQaxn7OB0Vs6yiZIfA":{"text":"A hidden gem with amazing crepes! This place is hidden from the street and we would have w","useful":0,"cool":0},"SVYbUhW6C8lPplbE3_5uRQ":{"text":"Very cute breakfast place. The food is very delicious. I recommend the egg Benedict with c","useful":0,"cool":0},"gSxpIXQX2vgOJdiElkYO0g":{"text":"This was actually one of our favorite places to get breakfast while visiting NOLA. I got t","useful":0,"cool":0},"64yyaxUQNh1-5nzxvEUm0g":{"text":"Delicious crepes full of real crab. Friendly and prompt service. Very clean and beautiful ","useful":0,"cool":0},"D0Y3CEkD1LpvSdrCaNtyGQ":{"text":"We put our name down and were waiting for a while right outside the restaurant where we we","useful":0,"cool":0},"duxG5aIzyEkVFXkzJjqwQg":{"text":"It is a wonderful place to have an brunch. The food is delicious and their service is good","useful":0,"cool":1},"y0WW7ukBpQSRwFxsw4QYAQ":{"text":"Small little cafe with friendly staff, reasonable prices and BIG PORTIONS. No wait unlike ","useful":0,"cool":0},"JXrFmASdBJYvsI-51hwdLg":{"text":"This place was something else. We went a few weeks ago. There was a female and male server","useful":0,"cool":0},"l6Tkx6A0o2-L0pxRQc_fhQ":{"text":"Delicious crepes! Lots of breakfast options for vegetarians and omnivores alike. \n\nWe had ","useful":1,"cool":1},"LQCRmNnZnMZ4QYjlPJ1XEQ":{"text":"It's a nice little intimate place. We were greeted and seated immediately upon entering. S","useful":0,"cool":0},"xbm8nhVc3aeLiQlXF3RMng":{"text":"The place is small and even though we were the only patrons the service was not good. The ","useful":0,"cool":0},"Jr6ixzy-UD2PVsFRneDpAA":{"text":"Hidden little gem of a cafe. Ordered berry crepes and American breakfast; eggs, potatoes, ","useful":2,"cool":0},"HxuMSQGD8wVMEwJmbRmc5g":{"text":"The food and service were great! The location is very small and you can probably find a bi","useful":0,"cool":0},"TsY_r4c9UJUAS-GxbI-A2w":{"text":"We had a very nice breakfast here. The bacon, egg, spinach crepe was wonderful.The crepe w","useful":0,"cool":0},"mf4Ph7YyZJ8mJ0IPZ2gFFw":{"text":"Wonderful breakfast! I had the grits bowl, and husband had the special, dried fruit and su","useful":0,"cool":0},"7M-S5ep-cEb3WrGPS5Vrww":{"text":"Really nice diamond in the rough for a delightful breakfast! Do not be fooled by the sensa","useful":0,"cool":0},"sYGlTz5TZLMfYJwbej0rtA":{"text":"Thanks to yelpers, I had my breakfast at Cafe Conti. After hearing the waitress couldn't e","useful":0,"cool":0},"H2YjcKu4p0bljOE-KFW5bQ":{"text":"Had the Benedict of the day, it was delicious.  Good prompt service.  Their coffee was gre","useful":0,"cool":0},"6ePdTGEbJ6DUm01VaSyVPg":{"text":"My friend and I were here for a vacation. We decided to check this place out based on the ","useful":0,"cool":0},"egzriro4HSARdqZup1Am2A":{"text":"Service was spotty. Food was OK. Out of milk so no cafe au lait. Don't do basted eggs (whi","useful":0,"cool":0},"6FMjo-elBuTkXTsb8AvoUA":{"text":"Excellent place to have breakfast until 3pm.  \nThe food is fresh and well prepared. It is ","useful":0,"cool":0},"fcXrvCQenXskGAU-X2NLUA":{"text":"Lovely place, french style and lovely. The food is really great and the price is good, too","useful":0,"cool":0},"_WW5vv6ooPtb6z49nocZ0w":{"text":"Brilliant! The crepes are to die for and the service has always been on point. A must to v","useful":0,"cool":0},"uUHxCjiyc4tQ1TqTSrY7bg":{"text":"Spinach crepe is just as good as it looks! I substituted the bacon for grilled veggies and","useful":1,"cool":0},"OTWXxz_CdDI3pANofVMLrw":{"text":"Great food!! Terrible service!! Server never checked on us after delivery of the food. Was","useful":0,"cool":0},"zuBp1Kno1IOQxBDvsZv7Eg":{"text":"Food here is amazing, I had the grit bowl and my wife had the savory crepes with Brie, bac","useful":1,"cool":0},"CG9K67EfPVJF7oeWU4iQHQ":{"text":"Yes yes yes these place is a must stop for a wonderful breakfast, discover these place bec","useful":0,"cool":0},"qTMyaGB07N-bfrJG90dr3g":{"text":"This is a lovely little gem hidden away beneath a hotel in NOLA.  My girlfriend heard it w","useful":0,"cool":0},"tGKJHk81j3MUGPxWxpYPGg":{"text":"Best breakfast of my life!!! Get the creamed spinach crepe!!! We also split the fruit sala","useful":0,"cool":0},"LZw3MD6y_QgEoL-UpQ03Rw":{"text":"I found this little jewel on Yelp. So glad we came here . The Shrimp & Grits's was very de","useful":0,"cool":0},"cYNXvWf_Ct2LE3VzLHoQpg":{"text":"Meh. Do you like chewy microwaved croissant? How about the worst coffee in NO. This is you","useful":0,"cool":0},"Myk3xjqsMUac7qeUnehnBQ":{"text":"Grossly overpriced! Mediocre food, small portions, not what I remembered from about a year","useful":0,"cool":0},"FDPbfPJTC4HbASZ75TjLlg":{"text":"Had the crab crepe--omg it was so good! Coffee was excellent as well. Nice atmosphere. Onl","useful":0,"cool":0},"ZdWIz1HZuvP5aa8H75v4ew":{"text":"The restaurant was cute and in a great location in the French Quarter. Food was average at","useful":0,"cool":0},"mz0cub0DTJdbD_ftV7_RHg":{"text":"I can keep this short.\n\n*Excellent service\n*Pricing is reasonable \n*Food is delicious\n*Goo","useful":0,"cool":0},"wHgsQKFNskRcziCQQksFlg":{"text":"Small, intimate cafe located in a hotel of the same name in the French Quarter.  I had the","useful":1,"cool":1},"-inNoTwoqsn6B4d8PLbbAQ":{"text":"Cafe is a gem that's tucked away under a hotel. We were looking for it and missed it! \n\nTh","useful":4,"cool":4},"mSI99IYSTUVoBeX7QN-K8w":{"text":"The breakfast we had was delicious. My wife had an omelet and potatoes, I had the Benedict","useful":0,"cool":0},"JJlXgXrCFmvQow0kSccTVA":{"text":"We were looking for a brunch place away from the crowds. This place is located in a hotel ","useful":0,"cool":0},"xkGwPe2M_fxckp1JRvknog":{"text":"Food was great. I split a chicken and mushroom crepe with my wife. To my surprise it was e","useful":0,"cool":0},"dN59_sKRNN9_XD65UDob0w":{"text":"Great little bistro for breakfast , brunch or lunch.  I just wanted something simple. The ","useful":0,"cool":0},"d4aIi7MO3lokV0lTHC10Ug":{"text":"Eventually gave me a wrong check!!!!!!\n\nWaited so long for the food is really not worth. N","useful":0,"cool":0},"cLcHy1gpCmjw-f57EubhdQ":{"text":"My experience was good but I'm not sure I would go back anytime soon. My eggs were ordered","useful":0,"cool":0},"46mBTPaygWYlZGtKzBF-wQ":{"text":"Eggcellent all around. Even opened early for me yesterday! This place is a hidden gem.\n\nWe","useful":0,"cool":0},"jFXrfJxeDsYS3zkCjT4rhw":{"text":"I'm still kicking myself for paying for this breakfast. This was by far the worst food-- a","useful":0,"cool":0},"2PM_gMDhaAnGzOSHgvEL5w":{"text":"There is something so great about a restaurant that doesn't try to over-complicate their m","useful":2,"cool":0},"ZjmEj1_5i3amNOiWa_OpxA":{"text":"came here on a whim and will come back anytime!!! get anything because it was actually all","useful":0,"cool":0},"U3rN4xGKaPvhi4ZaJrj9fQ":{"text":"Highly recommend ham and Swiss crepe with bechemel sauce. Not skimpy on the ham at all and","useful":0,"cool":0},"p_qx7da-Au4JNg-pcWpPrw":{"text":"Love the atmosphere of this little room ... so charming!  Just like being in Europe, so re","useful":0,"cool":0},"bZK8fMzVWW3dcCeCAUMRcg":{"text":"We shared the Benedict du Jour (Sausage, Shallots and Mushrooms), Crab and Brie Crepe, and","useful":5,"cool":4},"hwKGRyligiO4dJPjLfvNRQ":{"text":"REALLY delicious food! I don't know what else to say. The breakfast was great and the port","useful":0,"cool":0},"5n22x9nbInjMTojS7VJQ9A":{"text":"Delicious coffee and crepes. Relaxing and bright place to start your day! They have to-go ","useful":0,"cool":0},"C83uRpbLpwtENEMYiUJCtQ":{"text":"Cafe Conti was an amazing find! Warm, homey and most importantly, the food is frickin' AWE","useful":0,"cool":0},"vDIJxTa4FJtgZxitRn4TyA":{"text":"Had Crêpe,parfaits here. Coffee au lait is a must try for Mew Orleans. My friends had omel","useful":0,"cool":0},"VLUyTr3ijnIuhI-L_phXow":{"text":"I went to New Orleans on vacation this past August and we went to Cafe Conti every morning","useful":1,"cool":0},"HbNiTzDl2o6SLCtJ0bmAzA":{"text":"I ordered the mixed berry crepes and didn't feel like it was anything special. However, my","useful":0,"cool":1},"sZ37PyhP0qUYepIUKt8rHA":{"text":"Food was good, but nothing to write home about. It was a little more than I wanted to pay ","useful":0,"cool":0},"QlwpbSBC3cBe2NxHsSvylQ":{"text":"It was okay. Nothing special. Very nice staff. Very attentive. Room was cute. Wouldn't go ","useful":0,"cool":0},"GjCqC6wmsUB9OosswRPh0w":{"text":"We had brunch heat at 11am on a Sunday.  It was packed.   I think we were seated at the ve","useful":0,"cool":0},"vx76T4uz7tn_dgAviZoojw":{"text":"Don't be fooled...good things come in small packages.  We were a party of 6 and had a bit ","useful":0,"cool":0},"fjHgcylMn0vNzaJF3H1SOw":{"text":"Oh Babé!!! This place is the truth!!! When they say well kept secret, it was. Don't pass o","useful":0,"cool":0},"YRKiAve2EdGK37_ia9ucPA":{"text":"Space: Victorian French feel, plenty of seating, airy. \nStaff: nice, just the right amount","useful":1,"cool":1},"gNtHIKOT5qDbChOB8_n5WQ":{"text":"Espresso was awesome at this place!  They actually knew what a Espresso Con Panna is.\n\nThe","useful":0,"cool":0},"evT3C6cjFD9hK_y_A1Vg2g":{"text":"Honestly after reading all the reviews, I really thought it would be awesome to try this p","useful":2,"cool":0},"1DgRw5yxPbkb1fvAe16mhA":{"text":"We had the Eggs Benedict of the day with Shrimp, tomatoes, artichokes, arugula & hollandai","useful":0,"cool":0},"4nlYgzjQP7lbVDe5bM8ZPw":{"text":"Very disappointing. Just took a tour of cemetery no. 1 and decided to pop in for a cup of ","useful":0,"cool":0},"KwtMNcp_F0hOBBIkbP-PXQ":{"text":"Fabulous breakfast!  Best grits I have ever had - they are made with heavy cream and rosem","useful":0,"cool":0},"FfJ9VmgWxcKuVGExoXyjdg":{"text":"We ate here on New Years Day, the staff was a bit overwhelmed with trying to share all dut","useful":0,"cool":0},"7hxzAtVIP_aKv-nGfRqC7A":{"text":"Just right outside from Prince Conti Hotel. The meals here are good and reasonably priced.","useful":0,"cool":2},"rnH9I5AXJxYUZ7KKdgYmgw":{"text":"Ideally I would like to give 4.5 starts but as there are no option like that and I never g","useful":0,"cool":0},"wZLWTJ37XwidcYqPB42_SA":{"text":"Such a nice little spot tucked away. Don't let the exterior fool you, the food is bomb. I ","useful":0,"cool":0},"-Hyv82fY57MaL2uaa92gHA":{"text":"It's a small café with a very nice interior! The ladies working there are all so sweet. I ","useful":1,"cool":0},"yz-MmHNoPgMFqkm3t2TRlw":{"text":"The chicken and mushroom crepes were great! I arrived an hour before they close that day, ","useful":0,"cool":0},"3D_tMJJY50iYe35Wo9Z3dA":{"text":"Super cute space. Good coffee. Great menu of savory and sweet crepes. I got the chicken ha","useful":0,"cool":0},"9mR4TXzyfu5iq0l_vNB8WQ":{"text":"Food: food was good, a bit bland, but a bit of salt and pepper spruces it up a bit. \n\nAtmo","useful":0,"cool":0},"STwcD9CK3GQZhM-ad3on7A":{"text":"My wife and I had a great meal here. She had the nutella and banana crepe and I had the so","useful":0,"cool":0},"ei9QNV6JYjpfEIG2-wiQnA":{"text":"We ate here for brunch and it was extremely disappointing. We started with the monte crist","useful":0,"cool":0},"oUGUsiPG6FNuJUf_vlxB0Q":{"text":"Peaceful hidden gem in the middle of the French Quarter. Had the vegetarian crepe and it w","useful":0,"cool":0},"SlFtiM8uk26AE9KkRUB48Q":{"text":"Stopped for breakfast at this little cafe and it is such a cute hidden gem. It's on the sm","useful":0,"cool":0},"A8Hp5r1GHC_URXKp9-LW7Q":{"text":"The cafe mocha was exquisite. Presentation was beautiful. Service was great. Prices midran","useful":0,"cool":0},"9pbhq5zxgI24qvM84rY2XA":{"text":"I had the benedict of the day - bacon and carmelized onion over grit cake.  Full of flavor","useful":0,"cool":0},"GrQIEMzlP1OE3fLFrw2t2g":{"text":"Perfect place for breakfast, food came out fast and it tasted delicious! Staff was nice","useful":0,"cool":0},"fZOmGI3XpJanTrT7vzX9hg":{"text":"Stopped in for breakfast on a Saturday morning and had a very pleasant meal. I had the spe","useful":2,"cool":0},"MW8yeGe2uYvhYWoG7mDRYQ":{"text":"Great little gem on our morning walk! Stooped in for breakfast. The place is small and not","useful":0,"cool":0},"flXEiTPe0d4q8qpGmat0xg":{"text":"Cafe Conti is a cute little out of the way breakfast spot / coffee shop just a block from ","useful":0,"cool":0},"xM7kMP1OpTIPaRUeZD9Rlw":{"text":"We stopped in at 1pm for some coffee. Cafe Conti was completely empty, which was a nice sa","useful":2,"cool":1},"gCK0klaIawIDyJ7KCtADgw":{"text":"This little cafe will make you feel like your in Paris while your enjoying your Cappuccino","useful":0,"cool":0},"E8YMWgvLEHt8CNF1j6fMjg":{"text":"Went for breakfast and was fairly impressed. Large portions and food was well cooked. Smal","useful":0,"cool":0},"qQKO_vnAtLnEG4I3w1-3Tg":{"text":"Can you say YUM!! This adorable little building has some delicious food. The service was q","useful":1,"cool":0},"GXZcu1gACZLKsQKrTbBHkQ":{"text":"Called ahead to ensure that the cafe would be open. Lady said that they are open until 1pm","useful":0,"cool":0},"26PfqrHCcHtLEsUeMyt74A":{"text":"Lousy service. Radio station music too loud. Tasty food. Conveniently located on the way t","useful":0,"cool":0},"l6LNws-pQVDzlKK1QgWJ-w":{"text":"Love the omelettes, coffee, & French toast! The service and ambiance are wonderful too!","useful":0,"cool":0},"2ldfswh8qa5dtVURqxtFRw":{"text":"What a great find in the French Quarter! Delicious savory crepes that work for breakfast o","useful":0,"cool":0},"3JVwKQB5ktYE90ch4u6ULg":{"text":"Delicious, affordable, and filling. The place is a quaint little cafe, cute architecture. ","useful":0,"cool":1},"01WKUvXKGmeZwK9FbnQh3w":{"text":"This is absolutely fabulous place for breakfast and coffee! It's rich and flavorful at the","useful":1,"cool":0},"VwDAPRba2JSV-GEBuRZv8A":{"text":"Great food! Decent atmosphere.\n\nI went to cafe conti and ordered a breakfast poboy and a t","useful":0,"cool":0},"rczJt8VmGTrn_wJHYX4C3Q":{"text":"Great food, awesome service. Highly recommended, if you want to have a quick breakfast and","useful":0,"cool":0},"g3LX_gdV5_x9YfyNCgN5TQ":{"text":"Crazy Bernie and Tammy The Tornado ate one of our 3 breakfasts here with some regrets. She","useful":0,"cool":0},"t3L1aMiihTWS2ZDFnFKyYw":{"text":"This really is a hole in the wall. We walked right by it and missed it, it's part of the h","useful":0,"cool":0},"OAvV7JbBlWThHGrBGHa2Jg":{"text":"I highly recommend this cafe if you are looking for the best shrimp and grits. I had the b","useful":0,"cool":0},"QReAuI2dogCjWDQ135L3Ng":{"text":"OMFG this place salvaged my trip to the Big Easy. Stuffed ourselves with 2 of the best cre","useful":2,"cool":2},"Yv9VdFvpLZo9NlBp7pD9Tg":{"text":"This quaint French inspired brunch place just off the hustle and bustle of Bourbon street ","useful":1,"cool":2},"MojpVEamIuiG0QpMfuM_wA":{"text":"This was a great little place. Coffee Americano was delicious and the savory crepe was out","useful":0,"cool":0},"wWP3lNOIDNz3J93JMUbbxA":{"text":"Tight space but friendly service. Daughter had croque madame and loved it. I had the eggs ","useful":0,"cool":0},"TzeXJQVYf8OV0zwCZ92lJw":{"text":"This Cafe is across from the Prince Conti Hotel using the same driveway.  The morning we l","useful":20,"cool":18},"oL0yVlWo0tCRsbkKCrkFXA":{"text":"RUDEST COOK!  She came out of the kitchen and accused clienteles of not waiting.  Place is","useful":0,"cool":0},"Ax4Not3JJ7YAgLnEMTl5Xg":{"text":"3.5 stars if I could...\n\nCafé Conti is a little restaurant inside of the Prince Conti hote","useful":4,"cool":4},"0nUfde-lkdGq_zQIlbSNLg":{"text":"The only thing worse than the service here, was the food. Not trying to be mean but goodne","useful":0,"cool":0},"lrJt1SdoMWa4F4lRuTBCUg":{"text":"Great staff. Classic NOLA feel. Intimate. Had the cream spinach crepe and loved it. Excell","useful":0,"cool":0},"DmPBNsgGt_Qq4Sbg-hwETw":{"text":"Went for brunch with party of 7, including a 2 year old. Called ahead to check, they said ","useful":1,"cool":0},"Hk0whcHsbVUnVqjjEayLug":{"text":"Amazing brunch place right in the heart of the city. We had cafe au lair, cafe mocha, mush","useful":0,"cool":0},"h1d-qzsTi5P5Bu_gsj_HOA":{"text":"We stayed at the Prince Conti Hotel and decided to give this place a try for breakfast mai","useful":0,"cool":2},"aKuu4xPhzPKZQjWqFkD0uw":{"text":"Outstanding eggs Benedict.  Artichokes, bacon and shrimp.  The grits were perfection - cre","useful":1,"cool":0},"zBcUmd2v-MNbYwGRcK4Raw":{"text":"I had my eyes on Cafe Conti the first day I arrived at NOLA. It just looked like an around","useful":3,"cool":1},"HVaZmSm62CMRKlhF1lFZ8Q":{"text":"Yelp was a big help today! So many restaurants in the Quarter, how could I decide?! The ph","useful":1,"cool":1},"cr8oX78gGcwkJdPMpIfQsg":{"text":"FAIRLY UNDISCOVERED BREAKFAST SPOT\n20 months later and this quaint cafe nestled inside the","useful":5,"cool":2},"HppKQfq7Vh9PNj1WckZGCg":{"text":"Crepes.  Go for the crepes.  There were two of us and we ordered a savory (salmon) and a d","useful":0,"cool":0},"_yMgLd2xJI5uWvgaPlUzFw":{"text":"So very disappointing. Especially because of all the great reviews. \n\nThe waitress was in ","useful":4,"cool":2},"hgnwxjDG7IoEjjMd5CRD-w":{"text":"Extremely poor service. I'm so irritated by their attitude that's I'm in line writing this","useful":1,"cool":0},"0bXLB-lEtuYwvt2c8POlGg":{"text":"We went here for breakfast this past week. This small spot is across from its attached hot","useful":2,"cool":1},"nlJKMsbGtjNvBLGYuylRAg":{"text":"I needed something simple. Nothing fancy, touristy or over priced. All I wanted was a sand","useful":1,"cool":2},"x-z8yhMuCfT8gJUKonysRg":{"text":"A cute but quiet spot for brunch in Nola. We went on a Saturday afternoon and were surpris","useful":0,"cool":0},"caBW3RFfEsCYYvMlnVOvsQ":{"text":"This is definitely the best breakfast place in the quarter! The service here is always ama","useful":0,"cool":0},"mohHeeFIpSkW6vBqEKo3yg":{"text":"My NOLA food cravings culminated in full-flavored festivity during my last morning visitin","useful":4,"cool":0},"bEy8ZLk2WLmNxYdgZSiOxw":{"text":"Cafe Conti is connected to the Conti Hotel in the French Quarter. We spent Memorial Day we","useful":0,"cool":0},"OeKJ6_YJPSBx0-QecPBXug":{"text":"A small little breakfast nook within a nice hotel. Great food! Good service and a very cut","useful":0,"cool":0},"msksB3SiiKWs7xnBKOJTew":{"text":"The best breakfast and dare I say meal in NOLA! We come here every morning we are in town.","useful":0,"cool":0},"YiHpdLTYTxYElkz0zPEzUw":{"text":"This cafe has decently priced food, albeit a smaller selection so check out their menu bef","useful":0,"cool":0},"guEZP1A1m4Dd0K9eiQfTOA":{"text":"Fantastic little breakfast place. We go there every time in Nola. Great atmosphere. Eggs b","useful":0,"cool":0},"vO67waOPt2m1NhmoXXgN5g":{"text":"Food was good, but not great. Glad we didn't wait the previous day for an hour. I think th","useful":0,"cool":0},"9T7SdJIVeSoQcAXrOuQlsw":{"text":"Ordered the bacon, apricot, brie crepe..delicious. Atmosphere fit previous reviews: small,","useful":0,"cool":0},"Ej78zD2IVrGsZafC2_jsAA":{"text":"Cafe Conti was a convenient breakfast spot to grab something to go before our early Monday","useful":3,"cool":3},"-2wX3Asj3Sl07pCIBrqCcw":{"text":"Great service, the best French Toast I've had in a long time. Their grits are amazing!!","useful":0,"cool":0},"6FcqjIxQdNFOUUQhEk0hKA":{"text":"A small no frills cafe connected to the Conti Hotel that you might miss if not looking for","useful":0,"cool":1},"ZuZe0olWdh8KqZZRBSrdbg":{"text":"Amazing. A small place tucked away in the french quarter. Next to Hotel Conti. Service was","useful":0,"cool":0},"vQ-YvrhFU7ByGAIDiiZKhw":{"text":"Their coffees are delicious! Berries and creme anglaise crepe was good, didnt expect to ta","useful":1,"cool":0},"gx443yzUxQRIPLXlj5hgjA":{"text":"Went here this morning to grab breakfast. I like the way it looks and everything was prett","useful":1,"cool":1},"-b6x4j47HxV0bFGTdiLB4g":{"text":"Sooooooooo delicious\n\nFrom the Benedict special to the service.\n\nWould recommended to anyo","useful":0,"cool":0},"n15_mbmbiJmeB77PdXZChw":{"text":"Please look at the picture of my banana nutella crepes and let me know if its darker/burnt","useful":0,"cool":0},"NukXqjpAb17kI2kKdbtHBQ":{"text":"Our second time here.  Service was a bit slow, but it was packed and we were not on a hurr","useful":0,"cool":0},"djT_u6NrICJT3lvXwhcDQA":{"text":"What a pleasant surprise this place was! Great little breakfast restaurant tucked undernea","useful":1,"cool":0},"k9yhx-57jTy40ovCywXBtw":{"text":"This is our go-to breakfast restraurant in the quarter. You will get excellent service, a ","useful":0,"cool":0},"7B9DlbRLfpiYIh_Nhca8dA":{"text":"We stayed at the Prince Conti Hotel and dined at Cafe Conti for breakfast ALL three days w","useful":1,"cool":2},"8H7IKJiZYECSjNbSUZp5IQ":{"text":"Great little cafe.  Breakfast for four was pleasant and the food and coffee were great. Th","useful":0,"cool":0},"fPwlyyMhqqssOb8Oi4qY2g":{"text":"I came to visit this wonderful cafe while many restaurants were shut down. I must say that","useful":1,"cool":0},"cKwjtQ0x_kyZJ3Z_oZe1qw":{"text":"Our waitress was so horribly rude and aggressive that I made sure to get her name off the ","useful":0,"cool":1},"CdkZWPJsFc43evQk7Brw9Q":{"text":"Food was good but the customer service was horrible. I'm not sure if the two waiters were ","useful":0,"cool":0},"T3b60gmErrlZGTnyJzLRVA":{"text":"This restaurant is attached to the Prince Conti hotel and when you stay there you get a co","useful":2,"cool":0},"V70xcz41q1kg8snEvLJYew":{"text":"Cafe Conti you were wonderful to me! I snagged the last available table and luckily avoide","useful":3,"cool":2},"2yvzNLb0n0fl79YzoqMaWw":{"text":"REVIEWS PHOTOS\nHere are the reviews you've posted publicly. You'll need the Google Maps ap","useful":0,"cool":0},"EMjYsp3V5dsgLCFFHalAHQ":{"text":"BECHAMEL was prepared perfectly, as well as the savory ham & cheese crepes!\nSUNNY counter ","useful":2,"cool":1},"QzL6JF9URIa3AIvph5QgDg":{"text":"You may not notice \" Cafe Conti \"on the outside but if you see it definitely you should st","useful":0,"cool":1},"aE3Xnh9qgJFXJtKlqsA_bw":{"text":"This cafe is in the same building as our hotel, Prince Conti. We have our favorite breakfa","useful":0,"cool":0},"u7eLfy9N8Uw4RL46j6OZ8Q":{"text":"I ordered the crab crepes, and the wait was long and not worth it for what seemed to be ca","useful":0,"cool":1},"jDHQoYVbf1aJA-cRXSC53w":{"text":"The best breakfast and dare I say meal in NOLA! We come here every morning we are in town.","useful":0,"cool":0},"P7RgeaFWD-yXBdKxCNIgrg":{"text":"Portions are HUGE! Totally shareable dishes. My fav: the cheese & scallion omelet (special","useful":0,"cool":2},"dHit8JlaNfUhMVe9tOJj3Q":{"text":"When I took a trip to New Orleans last year in June I was excited to eat real southern foo","useful":4,"cool":0},"B7emEHv5rW-3WBWrGL40Yw":{"text":"Literally the only one here with a food order and it took over 20 minutes for a grilled ch","useful":0,"cool":0},"UN-dPpI29uU5Ip-7Lbx20g":{"text":"Upon sitting down to place our order, the server asked what we would like to drink. I aske","useful":1,"cool":1},"6zt-DOFJm-4K5Tdyj0ZK-A":{"text":"Overall pretty good. I like my Benedict with fruit cup.  Coffee is too bitter, even with t","useful":1,"cool":1},"YnlgtmKxUIelp3yUrknWsA":{"text":"Had delicious breakfast here during Jazz Fest weekend. It was super convenient since we we","useful":0,"cool":1},"s1Y0knhoz9tUk_ISBMTPww":{"text":"New Orleans has great breakfast places and Cafe Conti is another perfect example.\nThe plac","useful":1,"cool":1},"es9PmtCmHLS0GsDi02QzPQ":{"text":"Charming cozy interior and spectacular brunch fare - there's so much to love about Cafe Co","useful":4,"cool":3},"rgPzL9hduK2vD3KH4kB-ow":{"text":"Talk about a cute, warm and cozy restaurant. From the moment we walked in we were greeted ","useful":1,"cool":1},"ujJQF37QzrgheNCavowMsg":{"text":"We had an amazing breakfast here and we'll be going back tomorrow, they were a bit underst","useful":0,"cool":0},"u72a3-N_v61hd4yYsSZEFw":{"text":"What a great quaint French style cafe ,Claude was great host we had the eggs Benedict , om","useful":1,"cool":0},"bayBVAVZJa3kZkyibkqlLQ":{"text":"Great food, great coffee, great service an excellent stop. In fact we have gone there mult","useful":0,"cool":0},"acK0M2ucGn1LZHeX4TEn0Q":{"text":"GALETTE SOOOOOO GOOD ham, creamed spinach with guyere cheese, fried egg! So worth it!","useful":0,"cool":0},"7GjHwXdUrToLmNTpivh-ng":{"text":"This place is closed! April 3, 2021 looks like they maybe renovating? I was looking for so","useful":4,"cool":0},"u4B3ib_I8bhVEiqKBlUpMg":{"text":"If you are a guest at Hotel Prince Conti you might have ended up here for breakfast or bru","useful":2,"cool":3},"GwiYSullEVE9Rd8w9Ml_7Q":{"text":"Cute little cafe with superb shrimp and grits.  I never liked grits but I felt like I had ","useful":2,"cool":0}}