{"AJp2D8rwUC9rIi4kmAO1GA":{"text":"The best thing about this location is that it's around a large array of other businesses a","useful":2,"cool":1},"NH5G1Hk5DRlIW_4XJUOY7w":{"text":"I like that this location is attached to the Felipe's nextdoor. Have lunch, drinks,  and d","useful":1,"cool":0},"jysRii9DvP8GlRg4ggBl4g":{"text":"Pinkberry is nowhere near as good as Yogurtland. Pinkberry doesn't have the choices nor th","useful":1,"cool":0},"7qR42WyLhQaaqv_ARwX-Cg":{"text":"Great location. \n\nWith the family, we do Felipe's, then Pinkberry. \n\nI'm not a huge froyo ","useful":0,"cool":1},"yCLu1sLQSBT5nZwnwn7T6g":{"text":"It was a hot summer day, and I was trying to find something to cool me off. Because all th","useful":0,"cool":0},"atXRZx4o_adUBN1En9BMuQ":{"text":"Haven't had frozen yogurt in quite a while and have never been to a pink berry, had the va","useful":2,"cool":1},"_FcvHiLKla9j3Sq30Q7KWA":{"text":"This is just fine yogurt.  Nothing wrong with it.  Like the McDonald's of yogurt.  There a","useful":0,"cool":0},"FFkBslxz90pAWOr-4S6m6w":{"text":"I love Pinkberry! We're adding more dairy free flavors now. (I work here) We have a Coconu","useful":2,"cool":0},"tICAYfuHpElSrDPDK6LUEQ":{"text":"Outstanding service!! I love all the workers there! Always helpful and willing to give you","useful":1,"cool":1},"ZHG9vHFVZumFBmU__h8fDA":{"text":"Very disappointing- not even ONE flavor that's \"no sugar added\" and in this day and age, r","useful":2,"cool":0},"6zxrbNJF7ol_R7cddO9K0w":{"text":"I love this sweet little escape. There is something addictive about the original flavor wi","useful":0,"cool":0},"ynH64o-RsUZQqLFHh19MMg":{"text":"Dear Pinkberry in Mid City,\n\nThank you so much for being there. After a long flight, after","useful":0,"cool":0},"3V06rXwYuKvtbY--2ieetg":{"text":"We received the best customer service at Pinkberry yesterday. The whole staff was so sweet","useful":0,"cool":0},"jVZUEEKytPDGYKyFYFcvUw":{"text":"So we didn't actually buy anything here.  We were in Felipe's next door (they're connected","useful":3,"cool":2},"NlSR7-YRHtDlKlmOt0AFHg":{"text":"This is the best PINKBERRY LOCATION \nI loveeee how smooth their frozen yogurt is.\nIt is al","useful":1,"cool":0},"xbP5RKaHRFmM9BHX5mgGqQ":{"text":"This is based on customer service.There is a guy he says he is a manager well my friend an","useful":2,"cool":1},"Jo8tg5GupXeZDtRWrBQ5qA":{"text":"Husband and kids wanted smoothies so we decided to try Pinkberry for a change.\n\nOrder 3 sm","useful":0,"cool":0},"SoLDOVm7M6IXnR5tv0Bzqw":{"text":"I had not been to a Pinkberry before, but I was reasonably impressed with them on a macro ","useful":1,"cool":0},"V5g-jrg04xC9sklHvv_UZw":{"text":"Me and my best friend decided to go to Pinkberry for dessert on Galentines day, and we wer","useful":2,"cool":0},"dCpKjd7S45lDZlh7suMGAw":{"text":"SO I'm not a huge ice cream nor froyo person, but sometimes it's nice to go grab a scoop o","useful":5,"cool":5},"0hViyloD9f-dE02odLw-BQ":{"text":"Terrible service. I walked in with my husband with no other custom in the building. We wal","useful":0,"cool":0},"9Eks3lcmUp5ARz4bLJwVFA":{"text":"WOW!  Wow, wow, wow!  I had no idea what I've been missing!  Hell yeah I'm going to order ","useful":0,"cool":0},"xaY-QAbgLUjtlrd0Xds7wQ":{"text":"I literally down loaded yelp just to leave this review. The girl with the nose ring behind","useful":0,"cool":0},"bOQA_BAD6Nn7XsB5ddCgTg":{"text":"I am disappointed with this Pinkberry because the owner changed the inside of the store to","useful":1,"cool":0},"NuEmWZB4rybiukytE7rJfg":{"text":"I love so much about this Pinkberry. First of all the location is perfect. It's in the mid","useful":4,"cool":4},"sky0zYL_NLg2dm_rxBwbMA":{"text":"I never really get frozen yogurt anymore, but I'm so glad I decided to stop in for some Pi","useful":0,"cool":0},"Jco00kQI_tiBYTGDBznVeA":{"text":"It's a bit different from other Froyo places, but this is probably for the better with the","useful":0,"cool":0},"JWELPSqB3SSsJ40AlpbmPQ":{"text":"I've never been to Pinkberry so we decided to swing by there when my sweet tooth struck. I","useful":1,"cool":0},"7qUA2CyGkA2cB7a74o5ujA":{"text":"Ok, I took off one star because Pinkberry is the priciest of froyo joints. Plus I'm a litt","useful":5,"cool":2},"Y5kucX6H3mQJR8UCqKcPZw":{"text":"Hi Yelpers,   \nAs you may know, I love a good late night snack. So, I just had to step in ","useful":0,"cool":0},"-4XSpqpP9F_OH2XrhuuQHA":{"text":"Pinkberry is such a good treat!!! I'm usually into the chocolate hazelnut but just tried t","useful":29,"cool":25},"cAWCy2gy3hpAj4PLDNobQQ":{"text":"While gallivanting around NOLA last week, I got hot.  It was like 80 degrees out, but than","useful":4,"cool":3}}