{"ZyyZOpRvFYPkjw2S3dsrbg":{"text":"The service was wonderful by Phillip. The food was to die for by Chef Marcus. This is the ","useful":0,"cool":0},"_w4ZZCmBqkJrqISYLooFpQ":{"text":"Where do I start....\n\n1. Service: Slow. I felt like I was in Europe with the time it took ","useful":1,"cool":0},"i0Z9IPa8RNfqAXd9yRbSCw":{"text":"We chose this place because it wasn't far from our hotel and our guide from the carriage r","useful":2,"cool":1},"2nfBBmj9B9qysBoTuyrQLA":{"text":"Well we should have known when we were able to get reservations last minute on a Saturday ","useful":0,"cool":0},"6ca9mfEPAxKg0f304JmjPw":{"text":"Great private room for our group of 20. Our server Victor was awesome - shared the history","useful":0,"cool":0},"KbMCT1CR0GmhU1ig8VL5Kw":{"text":"I would like to thank the folks at Tujagues bar for making our Saturday night great. This ","useful":0,"cool":0},"dh9KmsMFSAOJAJMFJgEkRQ":{"text":"Celebrated my 50th birthday at Tujague's back in mid-February.  The staff at Tujague's did","useful":1,"cool":0},"XBjYK3NabZMCANY-K1xwZA":{"text":"So, the place I really wanted to go to that night had a 2 hour wait.\nInstead of jumping on","useful":1,"cool":0},"5A84zfV94EbRakNhXNjfNQ":{"text":"My husband, daughter and I visited Tujaque's Restaurant for lunch on Sunday.  We were abso","useful":0,"cool":0},"97Q5rbk9eI4pnwcQ_oxzwg":{"text":"I booked a private room several weeks in advance for our wedding reception dinner. The sal","useful":3,"cool":0},"UHo0gLTu_aWNxkkZbpyJBw":{"text":"You know, I've been meaning to try this place for a while. I went to a party there, and I ","useful":2,"cool":0},"09sXT3FBlTTpezhCWqkwXg":{"text":"I don't get what the bad reviews are all about - I thought this place was great!  Food & s","useful":0,"cool":0},"WpAIirhn8RAuiMs_9GK02Q":{"text":"Stopped in for a drink - bartender kept a $3 tip without giving me my change - beware!","useful":0,"cool":0},"6AYqJk_p8jKVeVAF79jzkg":{"text":"Friend and I split the shrimp creole, the crab cake and crab and mushroom gnocchi. It was ","useful":0,"cool":0},"b6OVICkRqZlkoqtsrJuj-w":{"text":"Great place for lunch! Excellent service, comfy, and delicious food. Had a po boy and it w","useful":0,"cool":0},"62zDceBmDTBZh1Yf2nBMjA":{"text":"It was good for a large group and the waiter was nice and attentive. They had some classic","useful":0,"cool":0},"jQfUXXDQVVkQUI9y7ODrlQ":{"text":"One of my go to restaurants in Nola. Was told about it from someone that actually lived th","useful":0,"cool":0},"VoLzJKo-GYBAhH0eRKOGEg":{"text":"After several hours at the swamp tour, I was hungry. The shuttle dropped me off in the Fre","useful":0,"cool":0},"pM5Hlon95bBUpXlEQSIvfQ":{"text":"Ordered gulf fish.  We were one of the first ones in for lunch.  Placed our order early.  ","useful":0,"cool":0},"70lDI0_hfJ3TAxNG_uimPg":{"text":"Don't expect cutting edge modern cuisine here.  You get to choose your entree.  Otherwise ","useful":0,"cool":0},"V52VjWReXSTaUCGQQJworQ":{"text":"This unique spot located just near Jackson Square and Cafe du Monde has my mouth watering ","useful":0,"cool":1},"VR9kFW6fFHOe8GpKIHwThw":{"text":"I love Tujague's.  I've never had a bad meal here and I'm a sucker for the early 20th cent","useful":3,"cool":3},"URCzNvBtuxzUICSMb-XuMA":{"text":"My husband and I waited here before the NOLA beer tour and grabbed a couple cocktails and ","useful":0,"cool":0},"ynCrAmMaHfcgAKyQ3upOfA":{"text":"We were a table of 13, the staff were wonderful.  The place is a little run down.  The roa","useful":0,"cool":0},"TdRzPxqZKcOgFvKuff5maw":{"text":"Absolutely perfect!\nWe held our wedding dinner here, 10 attendees, 2 hours.\nWe were seated","useful":0,"cool":0},"ETRmmi6HPfmDs6gBadMgmQ":{"text":"We were only in NOLA for one night but this choice was a good one. It is better to go for ","useful":0,"cool":0},"0xt8QLfuaPGvbPZ_urQJOg":{"text":"Fucking Yummy with a capital Y!\n\nTujague's is interesting. You enter through a small bar t","useful":1,"cool":2},"S2SlwaYn4tcTUs63T8_RSQ":{"text":"Recommend: their bread. Shrimp and grits.\nNOLA restaurants tend to serve this thick crust ","useful":0,"cool":0},"m6c3DL1JIAVNNNTq_kNfZQ":{"text":"This was the worst doing experience in large city with all available reviews. The front if","useful":0,"cool":0},"mpncDA_hUPM550kgaiokvg":{"text":"This is an authentic and unique old school New Orleans restaurant & bar. It doesn't look l","useful":0,"cool":0},"pYSfTX5zs3NVjEuO8j1m-g":{"text":"Forget the haters this place rules. By far the best food we have had on our visit. I had a","useful":0,"cool":0},"Tzz8Jwywy9rbp4BUiZgEaA":{"text":"Only had one night in New Orleans, and this was where we ended up for dinner.  Big disappo","useful":0,"cool":0},"pDyIdP7SR9U8ehQa3UZ0Xw":{"text":"We went in with a group, wasn't a lot of room, bar tenders were mildly friendly.  Drinks a","useful":0,"cool":0},"-Y0ZwXQmzy1yRSkl1xIUEg":{"text":"DO NOT COME HERE. Unless you like eating expensive, mediocre food.  This restaurant was re","useful":0,"cool":0},"bsDfT_rJz8mVRdP9YQwQCQ":{"text":"The building has a lot of history. It was really cool. Well actually it was really hot ins","useful":0,"cool":0},"qTLW6tTRl7mn8qjkwktXFg":{"text":"Just an OK meal...nothing special.  Touristy crap.  We went here for the Thanksgiving spec","useful":0,"cool":0},"eZAeu4Grk_EoLBxUKVrzcg":{"text":"We eat in New Orleans often.   This meal was a special occasion, and thought this could be","useful":1,"cool":0},"Dc9S5EabCblfQMZM7zE6hg":{"text":"I usually think of Tujague's more as a tourist destination than a place locals visit, whic","useful":2,"cool":1},"79W4oR7y93lhbzleZie5VQ":{"text":"I can't believe this place was raining bad I was really surprised at how good everything w","useful":2,"cool":1},"ciPlqYiMMk68UmO1Z-8Jgg":{"text":"I was very disappointed in both the quality of the food and the service. Our waiter was di","useful":0,"cool":0},"nRUnlL_WsF27JW9_BMwS8w":{"text":"First, our waiter was great and is exactly how I expect wait staff to be at a restaurant l","useful":0,"cool":0},"AsgntPzZAA7yOTPLwRpyyg":{"text":"Stopped in with some friends who are New Orleans natives. Dropped by for a drink or two du","useful":0,"cool":0},"kxbW6ff23zTi7etU5ySNGg":{"text":"We didn't have reservations but were welcomed and waited less than 30 minutes. This place ","useful":0,"cool":0},"q5gyT0zEWjqDUojzaH7GSQ":{"text":"We were visiting NOLA for a couple of days in May, and on our last evening we hit the jack","useful":0,"cool":0},"zH_ADZnEgZVpBILYVKMV_w":{"text":"Ate lunch here and the soft shelled crab BLT poor boy sandwich was incredibly good...espec","useful":0,"cool":0},"lcgqrQquTULiniXGiTsXow":{"text":"Oldest Bar-restaurant in NOLA.  Shrimp salad was delicious, Good fast service.","useful":1,"cool":0},"VRU1FKYgZtqrSkcu4R4oMA":{"text":"Service and willingness to fix issues was completely unacceptable. A large group of us rec","useful":0,"cool":0},"3tYzb1oGl2vXyoFgZgWeoA":{"text":"Came here with a party of 6. \nWaitress messed up drink order.\nReceived our food. 3 gumbo's","useful":0,"cool":0},"M6bB_AzUypZvFYCEZnV3BQ":{"text":"I mostly came because of the grasshopper. Everything was ok just not fantastic. It is famo","useful":0,"cool":0},"vgJ8fLwONwJrCJZVf9oizg":{"text":"love this old fashioned multi course, fixed price restaurant. Best gumbo in town, old tyme","useful":2,"cool":0},"34O8KIYB61NOks6GUQ_fhA":{"text":"Took a stroll  through the French Quarter today and after checking a few menus around town","useful":0,"cool":0},"pr7NykE017aNWuDcdf28eA":{"text":"This review is for the bar, not the restaurant. The bartender working there mid-week is on","useful":0,"cool":0},"PqSS3AKLyHqfLSIAmWXhlQ":{"text":"We went in to Tujague's as part of a food tour. I wished we had found this place sooner. I","useful":1,"cool":0},"2jJwes9fmlqojt2zfpFH-w":{"text":"Old, zero maintenance. Nothing extraordinary on the food, expensive. Nice thing they waite","useful":0,"cool":0},"Nj1ka3XowTsycqWlRis__Q":{"text":"We ate here on New Year's Day (had the good sense to OpenTable a reservation on the walk o","useful":0,"cool":0},"zel7ExxvubV2nF2xiYiqSQ":{"text":"We went here for lunch. My friend and I split the Cobb salad and the beef brisket po' boy.","useful":1,"cool":1},"lnSp8UNtJ7J5948jJBpeIA":{"text":"Truly a disgrace.\n\nI've been going to Tujaque's with my wife for over 15 years and have wi","useful":3,"cool":4},"ShuzxYpRZonEu4P7mNaM_w":{"text":"Nice spot to stop by and have a cocktail. Drinks were strong and bartender was nice. Great","useful":0,"cool":0},"gzk3-kNdDktv-ci_Eee_Yg":{"text":"We ordered  2 Pacemaker Po Boys, Shrimp and Grits, and a Strawberry Salad. The Shrimp and ","useful":0,"cool":0},"E2VVdXme7orps4Jw6kL1-A":{"text":"Oh look it's 5 years later  and it's time for an update. The owner has transitioned from f","useful":5,"cool":4},"iNsy4Kt0Ynlx3XB30NEzkQ":{"text":"We are moving to California and one of our cross country stops was New Orleans. We are tra","useful":0,"cool":0},"KQkPL1RfwSMppRWk654pnQ":{"text":"I recently had a great lunch here with my family in town.  (My guests were two adults, a 1","useful":0,"cool":0},"L6k1muVnKBnN4F_SPzFAtA":{"text":"Visited this establishment for dinner with my husband. The atmosphere is very nice... clas","useful":0,"cool":0},"kGwD4lX8BdVuGUhrPbdvOA":{"text":"The chicken was amazing. The white wine sauce with capers and artichokes was tantalizing. ","useful":0,"cool":0},"IhpOtd8uuVPo4QTADzzBJQ":{"text":"Possibly the worst food I have ever tasted. The lump crab meat appetizer was at room temp.","useful":0,"cool":0},"OlDkC3-li13lzXTwUkTBCQ":{"text":"This place has the best roast beef po boy I have ever tasted.  It was moist and the bread ","useful":0,"cool":0},"TT8GLDQDSQBbe-5xrW5Dqw":{"text":"Always know that you are in trouble when menus do not include prices, however, the food is","useful":0,"cool":0},"fcLDmaRH6lb_UrhzZB7d7w":{"text":"There are two aspects to Tujague's--the bar and the adjoining restaurant. The bar makes a ","useful":0,"cool":0},"61wNlwXOIDtVKg1GdXwG4g":{"text":"My hubby and I went here on Christmas Day to enjoy their special menu. First of all, I app","useful":0,"cool":0},"-Re9oYmnFYDS6YBm1m-_QQ":{"text":"Eric took great care of us in bar. Spinach salad c fried oysters was perfect. The blackene","useful":2,"cool":0},"40MhgejIs5Gh84ngQhJ1RQ":{"text":"Went to this restaurant on recommendation of one of the carriage drivers touted as a true ","useful":0,"cool":0},"ZkH2y8oQVoLL3eOr_EJb9g":{"text":"Holy expensive! I have no problem paying $139 ( which is what my tab was) for a 5 course m","useful":0,"cool":0},"hA5b5hq686h5DSoEs9b3Ag":{"text":"Hugely disappointed with the food (although the bar was great - get the grasshopper which ","useful":0,"cool":0},"gOp0-yMN16dGltBHlHJUcQ":{"text":"The grasshopper was invented at Tujagues so we had to stop by and grab an original. The ba","useful":0,"cool":0},"ABenryinnQ-wvg-GuFlx9w":{"text":"The place definitely needs an update, however the food, drinks, and staff were amazing!\n\nW","useful":0,"cool":1},"STxjWHSHMam6IdG9J87qaw":{"text":"Worth a stop in to check out this historic spot. Seemed very popular for dinner, so perhap","useful":0,"cool":0},"6RLBrmzV6r8TdsTLHdJV2g":{"text":"Entered through the bar, went to check in and no one there nor any indication of reception","useful":0,"cool":0},"8sLDrK8F2yVCvW1-60wMew":{"text":"The advantage of a food tour is that you get a small taste of what's to come, if you retur","useful":4,"cool":1},"rxEesRlEtFDclaUMyJ8Grg":{"text":"The waiter was the best part. Food ok, nothing great.  People running the place were extre","useful":0,"cool":0},"ZlP-p8ecwsuc3cy5mllTqw":{"text":"Very cool, old school bar with a fair pour and good bartenders. I cannot speak for the res","useful":0,"cool":0},"GySsNeC09BwZXIMXZfUGdQ":{"text":"I came to the bar during a walking tour. As soon as we all came in (9 of us) it seemed lik","useful":0,"cool":0},"zw_zT3gO9UVQohskOMp8zg":{"text":"It's been eight years since my last visit to Tujague's.  The menu has more selections now.","useful":2,"cool":0},"2lDrDQbTeA9X-vjqbj-V7Q":{"text":"Walked in after seeing a beautiful and full dining room.  The menu has a touch of steakhou","useful":0,"cool":0},"1wFz06xOr1U8kiQnYKJlVw":{"text":"We had a wonderful experience here.  We came to celebrate my parents 50th anniversary.  Gr","useful":2,"cool":0},"LjjcDPB4CBWDRq4uekhi2Q":{"text":"Went here with a group for Sunday brunch. Tujague's is a nice place in a cool location. Th","useful":0,"cool":0},"ejE3SzW_GtLer0G1kdkokQ":{"text":"They accommodated my birthday dinner group of 14 without issue, and seated us in a nice pr","useful":0,"cool":0},"9PpCvj1IvcSZRQjbrvXRpg":{"text":"Dear New Orleanian: If it's been a century since you've visited Tujague's, please consider","useful":1,"cool":0},"DZLoKh4qwpB2hjSL1blcrw":{"text":"Horrible experience!! I had reservations to eat here on Mother's Day and I was looking for","useful":0,"cool":0},"GsT2SN1qixi7_Cl5SDC8Kg":{"text":"SO Disappointed!\nI made a rez here because I wanted my first meal in NOLA to be authentic ","useful":0,"cool":0},"wIZhQ4r_ihbWxKSIrhk0Lw":{"text":"I normally don't post reviews but on account of how wonderful our visit was here I have to","useful":0,"cool":0},"3yifNXCxhYnStJhfaaPhNg":{"text":"Ha... funny story actually:\n\nSo I came here on a date probably about 2 1/2 years ago. It w","useful":0,"cool":0},"zRusJbuYrOORsuZS3KVf9w":{"text":"Mudbugs, crawdads, crayfish, call em what you like, jus don't call me late for dinner! Gre","useful":0,"cool":0},"f1EDBPYcvUaIV8arG6Qskw":{"text":"Classic old New Orleans restaurant and bar. Great vibe and delicious creole food.","useful":0,"cool":0},"HHTES72Ywa8scwuXZfNg5A":{"text":"Came here on a tour, and got a sampling of what was good. Loved the atmosphere, and sat ne","useful":0,"cool":0},"LtKsmtZJD5JaykJ-62cItg":{"text":"I'm only giving it a three star rating based on I only had a couple drinks at the bar. I w","useful":0,"cool":0},"R_dxzTC2JWE4peXtEQMfyQ":{"text":"The people who have written recent reviews about Tujague's restaurant must eat at McDonald","useful":2,"cool":1},"CB0oj9pXnwgtyl3ZNQQI8w":{"text":"Tujague's has an awesome wait staff and we enjoyed our dinner here because of it. It was o","useful":0,"cool":0},"now5O_-AnyQonRhRJDglkw":{"text":"This was by far the best food I had the pleasure of consuming during my trip to NOLA. The ","useful":0,"cool":0},"CAqxlEqF5zcbYSR5tYST1g":{"text":"Their grasshopper is just amazing. Supposedly it was created here so stop in and get it fr","useful":1,"cool":1},"ApD_uBjIPKm6pZFWVBnATQ":{"text":"Went here for Saturday brunch. My fiancé and I both had Eggs Decatur. Delicious! It was on","useful":0,"cool":0},"q8e1QmjjeE0J5MjiPzcw3A":{"text":"Awesome place, super old school vibe with great cocktails. Look out for for Brett, he's th","useful":0,"cool":0},"TkJ64K_jUmjGpnxRt-MqeQ":{"text":"Popped into the bar at Tujague's for a second to grab a drink for my Aunt who was visiting","useful":0,"cool":0},"oHJpRSFOKEOtKw5mbgxWvg":{"text":"You like this?  WTF is wrong with you?  Old, old, old...  and the food is bad.  Maybe I;m ","useful":1,"cool":0},"k7wOZzDOSO-DacyRWtCU0w":{"text":"Beautiful dinner of filet and fried oysters with a beautiful brown/red reduction that went","useful":0,"cool":0},"_Eww-55yY5s4w5tTDfGqrg":{"text":"This is a gem of a restaurant. It's got wonderful history and is a local favorite. If you ","useful":0,"cool":0},"GJ1OTFvepb6qXNa3ljrcIw":{"text":"Fabulous food, wonderful service. Michelle was a wonderful server! Oh my goodness!!! Heave","useful":0,"cool":0},"YAADzeCU8rgQzLuiREs0Yw":{"text":"We went to Tujague's Restaurant with some local friends while visiting New Orleans.  The s","useful":1,"cool":0},"_LcXlSbA8nk4ScLlstKkLg":{"text":"while the reasons for meeting here were top notch, and the people who work here are as wel","useful":1,"cool":1},"M5FOghjRN_SRWm_KOEAb_g":{"text":"Classic New Orleans grub. This was a good lunch choice for us because it is located in a b","useful":0,"cool":0},"SCjpH_Yfoq_UKs0sz3XAjA":{"text":"Grumpy employees, who look bored. Decrepit and decaying bar in need of repair, ceiling fan","useful":1,"cool":1},"4Sz0RzW9nCUNb82L0P_DtQ":{"text":"one reason there are 3 stars is because my shrimp linguine entree looked, smelled, and tas","useful":2,"cool":1},"ilu9KeXs1ytCEYuRWTmp9g":{"text":"Perhaps my review is a bit tainted because I ate at Commander's Palace the night before. T","useful":4,"cool":2},"B07beVXKqBRTIqqU1gjqVA":{"text":"An unusual dining experience, worthy of New Orleans.  Kind of a throw-back, with a  set me","useful":0,"cool":0},"eKJKhR6Tx1Mebz9-FqN3Mw":{"text":"Overpriced for the quality of food served. The soft shell crab po boy was ok, the turtle s","useful":0,"cool":0},"f_y0wlUALp8O95b3sKk7mQ":{"text":"I could cook better than this place any day of the week! I had chicken which was dry and d","useful":0,"cool":0},"bUU8iHw4_dbxPObkF4JPuw":{"text":"Not good for large groups. Service took 20 mins to give us drinks, 30 mins to order food, ","useful":0,"cool":0},"-BnJh-t-gCKx_swP6Jr0xA":{"text":"We've been here plenty of times on our trips to NOLA.  Our daughters were craving pasta li","useful":0,"cool":0},"ARS7S8hpAD571YIdj6m1sA":{"text":"This restaurant is over 150 years old.  That should tell you something!\n\nI like this place","useful":2,"cool":0},"O7G2SOQH0n6j36tWLK3yPw":{"text":"The bar smelled terrible and you have to walk through the bar to get to the restaurant. \n\n","useful":0,"cool":0},"wTehzcxQg0F8AogPI2l0dA":{"text":"Barkeep seemed a bit bothered to be serving us and when asked if there were any drink spec","useful":0,"cool":0},"vuyyWgtArA_z5bRuu_swIg":{"text":"Quick review here,  we stopped by to try the hurricane and grasshopper.  While here we dec","useful":0,"cool":0},"NRSEz-jUs_XcjZc5ooLczg":{"text":"Don't get hooked in to having dinner here. It is the biggest rip off! As soon as they said","useful":5,"cool":0},"l1BPzidqE-QBfqDxZ5BcAg":{"text":"Went on thanksgiving night.  The decor was in extreme need of repair and the chairs were a","useful":3,"cool":0},"9tBXKrGzzJlPG6hrx87zag":{"text":"The last time I ate here I was disappointed, but after hearing they had a new Chef I decid","useful":1,"cool":0},"oIKUF-VTGcsViWpPSZABiw":{"text":"Excellent food. Beautiful dining area. They were extremely accommodating. Phenomenal servi","useful":0,"cool":0},"H-1YYn2wTMtF2mD_p22n_w":{"text":"Opinion still stands: Tujague's glory days may be behind it, but the food and service are ","useful":0,"cool":0},"ejA9Y7lglQ359p8qL9rMow":{"text":"If they had an email address on their website I wouldn't be writing it here.  So if you're","useful":8,"cool":3},"D7bIpgqn0KvCJ6XPBnG7Yg":{"text":"Terrible.  Service was fine.  Food was exactly as you would expect if you went to your gra","useful":0,"cool":0},"lKJWMUuE4vJj4ERg9pvEuA":{"text":"The food here is very simple, old school, perfectly prepared. We had perhaps the best serv","useful":0,"cool":0},"Tn7MYdc8S8Oecec0gMybhg":{"text":"An amazing meal and dining experience! Vincent (owner or manager) was very pleasant and ev","useful":0,"cool":0},"AR_iM3dLldKzX4Tidg_bUA":{"text":"For some reason, I always assumed this place was a tourist trap, and more or less avoided ","useful":11,"cool":4},"bTPwenW081cMnmT7hX9gOA":{"text":"We were on a Road Scholar trip with a few days in NOLA, then the American Queen and dined ","useful":0,"cool":0},"3penpkWfpPsm4Gb39B2F7g":{"text":"Ever hear of the drink called the Grasshopper?  No?  Neither did I before visiting the Big","useful":2,"cool":1},"YUAqLfz_J1b9SMoXph5cnw":{"text":"I had a bad meal here tonight with good attentive service by John C. I came into town toni","useful":0,"cool":0},"n9i4B9j8mTF5OJ1wXcP5sw":{"text":"Their brunch was amazing! I'm not much of a fish person though, so the lobster bisque was ","useful":0,"cool":0},"Wne7WennCRe1b589h70yBA":{"text":"We were looking for a nice restaurant, not too noisy, good food and close to but not in th","useful":0,"cool":0},"pyJH8lQ1Bt2Xf7tXVRULjg":{"text":"Tujague's has a nice menu of vintage cocktails, if you can get the bartender's attention. ","useful":0,"cool":0},"4vtjn7oUvpXcbahI_taRgA":{"text":"Worst Christmas dinner ever! No choice, just $45. Over dressed limp shrimp appetizer, tast","useful":0,"cool":0},"ij4YUmaA0L4kLzaQkIDX9Q":{"text":"This place was cool! Old style décor. Good service, good food, good value.  Everything was","useful":0,"cool":0},"RCjxyvrNZRkbjSyg76Pe_w":{"text":"Didn't try the food here but came for the New Orleans staple: the grasshopper. It was crea","useful":0,"cool":0},"hkrdkUG2eb0TJzl5LNruXg":{"text":"Roasted and raw oysters, Sazeracs!  Very very good service!  Worth the walk from the Conve","useful":0,"cool":0},"Q-zgtnQ-AG8PEMKt_JVkLg":{"text":"Excellent!!! Make a reservation! Don't be turned off by entering through the bar, it is wo","useful":0,"cool":1},"-flxmqdFZ2MKFoPIMD_Qgg":{"text":"The very best!!! It's been here since the 1800's right in the middle of the French Quarter","useful":0,"cool":0},"uR_JZ_x9cQjfKsOMwU2s_Q":{"text":"Just finished the most disappointing Christmas Eve dinner out that I have had in many year","useful":1,"cool":0},"IuQrmOZGv8ntnM1TaLfF-A":{"text":"The gnocchi and the bread pudding were amazing! Quite possibly the best I've ever had. Tru","useful":0,"cool":0},"M74w9IDQcwed7kMFI7ectQ":{"text":"Great Sazerac's. ..make sure to ask about the picture of the man on the wall.   Also try t","useful":0,"cool":0},"CHXmi0j4M84z-mLIemFPJg":{"text":"You have to try the grilled oysters!  The physical plant is old New Orleans but the food i","useful":0,"cool":0},"6Z-BRptaeJdIo0tRsWiEuw":{"text":"I went here for a company group dinner, so my experience may not be the same as eating in ","useful":3,"cool":0},"TtRxWNvQFbfngkErvztzoA":{"text":"Was brought here on a culinary tour of New Orleans and tried a brisket po boy. Loved it! S","useful":1,"cool":0},"QCDS2l9sJ2_PxjRtUxTGXA":{"text":"We visited New Orleans over Christmas break and were told that many restaurants would like","useful":3,"cool":0},"cs4HsZOH6jwFxgAL60KOEA":{"text":"Went here with some friends in town for the marathon.  Seated pretty quickly.  We ordered ","useful":4,"cool":1},"gREmG5aE2bLAATF9XRWG2g":{"text":"Eating at Tujague's is as much a lesson of New Orleans history as it is about the food.  A","useful":0,"cool":0},"kcWdY_i3Y87iQzM3iVi_-g":{"text":"The food was just ok and we didn't see our server for almost 20 minutes. I had the airline","useful":1,"cool":0},"XJE04YMreGfFGznXpU1KIQ":{"text":"So, a little back story: I usually never go out to eat on Christmas day, but I am currentl","useful":11,"cool":9},"vNFwtiW0LLUUHdtej3hykg":{"text":"Tujague's was a highlight of my visit to NOLA.  My sister and I bumped into the the restau","useful":3,"cool":3},"JzMuDjmQ6GFMD2IF6uWRFg":{"text":"A piece of history in the French Quarter with such a beautiful, old restaurant. Sat in one","useful":2,"cool":2},"mJH6jVJckpj1IbRxpnxrdQ":{"text":"This place is a great experience where you'll never have the same meal twice, but what eve","useful":2,"cool":2},"MI4vqOWYO_UVhikgdHGthA":{"text":"The food was rather bland, the service was mediocre as well. I wouldn't recommend anyone c","useful":1,"cool":0},"1zEDx4u4rRXDcamjkO4E8A":{"text":"My friend and I had heard about Tujague's during a Culinary Walking tour and absolutely lo","useful":2,"cool":0},"4HcRQ1066aL4SiOdBJBYqg":{"text":"My friends and I came across this establishment only by chance. We were actually looking t","useful":0,"cool":0},"ZEQziZSJ-Cg6tx5yigSLGQ":{"text":"This review is for the bar. Of all the things that were on our list to try, this was the f","useful":1,"cool":0},"v4bktuXxLJTt7MveRdI4Aw":{"text":"A NOLA jewel. Great food, service and prices. Weekend brunch fare is great, with fair pric","useful":0,"cool":0},"GG2uAycDT6a0FAGaZClBxQ":{"text":"I didn't actually eat or drink here, but my friends had  pimms cups (which they said was a","useful":0,"cool":0},"tyeS175P1AeREz9eFV_srw":{"text":"A true NOLA dining experience! So many places in the Quarter are god awful tourist traps m","useful":1,"cool":1},"57tDjWDRJnDJNREkBR1XzA":{"text":"Order the Shrimp Creole!!\nWe went to tujog on Sunday brunch. I had the shrimp remoulade a ","useful":0,"cool":0},"r-yPdPsD0lGRln8_zKQmBA":{"text":"Ordered a little after 7pm, couldn't  leave restaurant until after 9m due to a cooking mis","useful":0,"cool":0},"psSrxS6XQBMyTt6_Yov3CA":{"text":"LESS KNOWN, BUT GREAT FOOD\nTujague's is not as well known as some other old New Orleans re","useful":0,"cool":0},"Jpc5n5D1Nx2xTuo9kt_WSQ":{"text":"My server was on top of everything! I just wanted a great meal before I left for home and ","useful":0,"cool":0},"-ny0BaYP4iksHCW6gQT3lQ":{"text":"Excellent Prix Fix menu, good food, nice rational portions, laid back elegance and waitsta","useful":1,"cool":1},"0RquRCqA51mlsUEsRYaKig":{"text":"Some believe this restaurant has the reputation of being a tourist trap - as I spoke to th","useful":2,"cool":0},"5uUu9qOvZfXr2Ypf1UklEA":{"text":"This place was the absolute worst restaurant I have ever tried. There was a huge line acro","useful":2,"cool":1},"kSQ-tVvrwqBAjN1PJFLe_w":{"text":"I had Grouper sautéed with crawfish over Yukon mashed and asparagus. I wanted to drink the","useful":1,"cool":0},"XigDLzYR-kNFS8_BNuqWgw":{"text":"This review is only for the bar.\n\nWe ventured into Tujague's bar on the way back from dinn","useful":2,"cool":0},"HlgrYvQ29lG40tuk2vPFsA":{"text":"I saw so many pictures of the food and was so excited to come here. I was so disappointed.","useful":1,"cool":0},"LpyqonHJKcA0VXvVa5mrCA":{"text":"Friendly staff set the tone in this small establishment. Bar in the front leads to a seati","useful":0,"cool":0},"RIkKsWP0hGzQyHiYqXTb6w":{"text":"Great tasting classic New Orleans food with great service and attractive rooms and archite","useful":0,"cool":0},"0GvfjdYGwFu9mN1Yl8fVgg":{"text":"Can I review this if all I did was have a drink, or if I had two drinks? Well, I'm gonna. ","useful":0,"cool":0},"d6bIQ-sh4AOucFiGGUNJFg":{"text":"Best (& most refreshing) Pimm's Cup in New Orleans. The bartender was very knowledgable. S","useful":0,"cool":0},"LGH1rjQqJ-8A6vwPOhoncg":{"text":"Went for a dinner for 2 and it happened to be the Coolinary menu (like restaurant week for","useful":0,"cool":0},"INFyub7Ry7X-xepJOTFNyg":{"text":"Not good.  Worst meal we had in New Orleans.  Slow service, loud cramped dining room.  som","useful":0,"cool":0},"NLRf2Syv3yxD-Bcw-je9yA":{"text":"Old school New Orleans place in a touristy location which recently changed ownership and a","useful":1,"cool":0},"AyTTbec-IYIDjIQALcvQpA":{"text":"Christmas dinner:  Fixed price menu:  4 course for $60/person.\n\nFirst thing I noticed was ","useful":3,"cool":0},"SaoRhGFxpXF8HskGimbnCg":{"text":"My wife and I were married in New Orleans a few weeks ago, and we had our post-ceremony di","useful":0,"cool":0},"jVpHvvyzDaEqufmJzf0NUQ":{"text":"This is a Great Restaurant with tons of History. It's 156 years Old for goodness sake, est","useful":0,"cool":1},"zY-oOM66xFztNM8J2OJxdA":{"text":"I had dinner here with a friend before heading out to the U2 concert. It was during restau","useful":0,"cool":0},"UcPaCxK6_4st7sWy4sGvMg":{"text":"Terrible. I actually wanted to spit out the shrimp remoulade after I took a bite. Like ser","useful":0,"cool":0},"nOlEVlautNpcMXkOg8WYHg":{"text":"Was more than a little disappointed - we made a reservation for Christmas Eve, after havin","useful":0,"cool":0},"0Ax1gevUQeAWLhgme3TgFQ":{"text":"My mother took me here for my 50th birthday so was afraid to be critical of the food. Than","useful":0,"cool":0},"2m_hDmvBwq50l2ZCwLzoyQ":{"text":"This being my first time in New Orleans, I went here after reading all of the rave reviews","useful":0,"cool":0},"gL2YCUwEpBmx9H0Ni7ewCQ":{"text":"The food was fantastic!! We went there during the Coolinary restaurant month. I ordered Ro","useful":0,"cool":0},"4XEqYspee6Bk7FALQasqCA":{"text":"We came here spontaneously on New Year's Eve at about 9PM.  We had no clue what to expect,","useful":2,"cool":3},"1R9y6yJxs5gl87gOn6d9tA":{"text":"A Saturday night staple. Set menu is the best here. Shrimp remoulade, brisket that was lik","useful":1,"cool":0},"bUyK1CYEjX5jInczcfov2Q":{"text":"Let me start this review off by saying I'm not a huge fan of seafood- I'm open to it and w","useful":0,"cool":0},"WfAsdYIh5nxpeG7W7WQ9bg":{"text":"I visited recently and ate here just because we were walking past the place and was gettin","useful":0,"cool":0},"SN9QU0uVBzwlkDaNrN0KrQ":{"text":"Steak made with extra love. Soooooo good!!! Amazing atmosphere---good people!! Definitely ","useful":0,"cool":0},"LcMsLL-EqZk6ynucaIfR9w":{"text":"Phenomenal brunch! Bloody Mary's are amazing and poached eggs will make you come back! Hig","useful":0,"cool":0},"nE1jW0gvXtK_2KaOVgd_hQ":{"text":"We came with a group of 17 people.  The environment and service was good.  A parade came b","useful":0,"cool":0},"13E499CfLLHWshXc6rxCFg":{"text":"Tujague's is one of this City's great restaurants.  The décor is the same as when my Dad t","useful":3,"cool":0},"9xZ4ScxsHOAAw2vl6uftWQ":{"text":"Brunch was a disappointment. The fish over cooked, the P.O. boy under seasoned. \nTo the Ch","useful":1,"cool":0},"WbDNp5k58mstYkDNhS_FmQ":{"text":"Walked in without reservations. Politely and attentively treated while date and I were sea","useful":1,"cool":0},"mBGvc2EKa0_-6VEXcWo7-g":{"text":"Had a horrible experience here with my girlfriend and my parents.  The service was horribl","useful":1,"cool":0},"D7prenc6_sPLyKFRX43sqA":{"text":"Now this is what I thought of when I thought of New Orleans. Old school establishment, awe","useful":3,"cool":0},"RWYgkhpBWp78OZH58BoTgg":{"text":"We ended 2014 on a high note - great food and fantastic service!\n\nFrom beginning to end, t","useful":0,"cool":0},"mOpcUxqyFSQcEeMPI4ILSw":{"text":"I actually went to the bar instead of the restaurant. My husband's drink was pretty medioc","useful":0,"cool":0},"yhfIh3fJwdn9xhxeQFT5uA":{"text":"We took our family here for lunch and had a very nice meal. My wife and I had come here ab","useful":1,"cool":0},"rVDSLnz-Am4fZ1yDI_MUZQ":{"text":"This restaurant I think is crippled by its own success. While the food tastes delicious th","useful":2,"cool":0},"zwWKcd9MFCi-zp6r-vlNvA":{"text":"I made a big mistake when, even after hearing of the compulsory prix fixe five course menu","useful":1,"cool":1},"cA997A9_fBMGeNAP9xgjcQ":{"text":"After reading other reviews it must be a love or hate relationship with the dining at Tuja","useful":0,"cool":0},"qBpfWgj6NMqewjJ-yqo-xQ":{"text":"The beef brisket Po'boy may be the best po'boy I've had- be prepared for the horseradish k","useful":0,"cool":0},"LOgfxAJhm_KoimMvNGUFKA":{"text":"My husband brought me to NewOrleans for our   Anniversary and was excited about eating at ","useful":0,"cool":0},"WOB5xRjwiGxFKNdOnNgh1w":{"text":"A true classic in the French Quarter - \n\nYou probably have already read from my fellow Yel","useful":3,"cool":1},"TVZJNb1bdO7ZyiNrWHCcig":{"text":"The thanksgiving four course meal was incredibly delicious! The salad was okay, but not my","useful":0,"cool":0},"4ZQ1vEOIrxbrbvZKqsFzHQ":{"text":"We went for a large private party upstairs because we are all fancy, sophisticated people.","useful":0,"cool":0},"T8aN0PnEKqYdZr1756Dlag":{"text":"This place is an institution in NOLA and as such has a amazing offering of Cajun & Creole ","useful":0,"cool":0},"2fcqCcXeVv28kgqfrtYTag":{"text":"Tujagues\nThis restaurant used to be one of our favorites in New Orleans.  It was run by Ba","useful":1,"cool":0},"dMypScLv7MNcLXkqoNX4-Q":{"text":"The best filet mignon I have ever had. Melt in your mouth perfection. Every bite of every ","useful":0,"cool":0},"zuWiaA4mu-bmEF9wQ7lL5A":{"text":"Stoped by for brunch during Mardi Gras weekend. Staff was extremely accommodating in getti","useful":0,"cool":0},"sS8uxz6mbZdCQ2ppPa2NrQ":{"text":"Go here and get the brisket.  Staff is wonderful, polished and professional.  Food is exce","useful":0,"cool":0},"JRW_Nk4MAr9ue6ssd_bqSg":{"text":"Went in for lunch, and me and the wife both ordered the beef brisket po boy. This was prob","useful":1,"cool":0},"KdzdzxcOGZYdWcG1yYqI-g":{"text":"Food was so-so. Great place for sitting at the bar; however, there are plenty of better op","useful":0,"cool":0},"DTrijOzgNy-qdigRwDu3PQ":{"text":"You will see a wide variation in the ratings on yelp for this restaurant.  This alone shou","useful":6,"cool":2},"1mX-VIHxZLujLZ_-09gpSA":{"text":"The food here was okay, very yummy bread and Caesar salad. I am vegetarian so they made me","useful":0,"cool":0},"qBfbaciNZYe_hetxRa8aUA":{"text":"Atmosphere was not great. Expected my socks to be knocked off, they were not. Food was ok.","useful":0,"cool":1},"Wa1PcW3ujHLTtlpAXfONEA":{"text":"Oh Tujague's, I had so much hope. My boyfriend and I visited New Orleans this weekend for ","useful":0,"cool":0},"rlkxCWz7xfWcQhkwfJZ57Q":{"text":"The bread is really good, but this restaurant  needs to be put out of its misery. The serv","useful":0,"cool":0},"iMYbUeuFwxIshLSYRYiHpg":{"text":"Charming atmosphere which is quintessential New Orleans.  Food was excellent and I do reco","useful":0,"cool":0},"KIdDMdRrxzoIOz-Y8Xe5Iw":{"text":"Here as part of a foodie tour. Brisket poboy sandwich is really good. They didn't provide ","useful":0,"cool":0},"-22yhSb4vRDesWbbvp5QZg":{"text":"This was an absolute horrible experience. We went with a group of 16 and about half of us ","useful":1,"cool":0},"sqbBQYaFnF6DSQTwT29MpQ":{"text":"Great service! The husband wanted to eat creole/Cajun and was not disappointed. Our waiter","useful":0,"cool":0},"oBFwI3_2L6xPyhMkxs0OuA":{"text":"I don't know what happened on the day we visited recently, but everything was really bad. ","useful":0,"cool":0},"Aj15cKv4icOMxfVhmzeTTw":{"text":"I came here tonight on the Nola Beer Tour and ate some of their famous brisket - it was de","useful":0,"cool":0},"akpuUDMFMWT1uqZgbsY0tA":{"text":"Tujague's is an oft-overlooked classic New Orleans eatery / bar, over 125 years old.\nHavin","useful":12,"cool":7},"SHUsrrVci4Ata6S2XOznfA":{"text":"The first time I experienced Tujague's was 30 years ago, and kept going back every time I ","useful":0,"cool":0},"3bDS00UyOapGTse7x9K7fg":{"text":"Perfect! Just perfect! I worked with Marc to have our reception for our destination weddin","useful":0,"cool":0},"kEKROvcO8jwQEGWgHf3a_w":{"text":"Worst meal I've had in New Orleans in years. Terrible service and food. Took them forever ","useful":0,"cool":0},"FyyyeWybGb1cz1fUjwVKSw":{"text":"Basically old and tired.  Tujague's has a great history, but not much else to offer.  The ","useful":0,"cool":0},"510cCoJDQG5LhO-hMuJKmg":{"text":"Terrible. This place survives on its name not it's food. The meat was overdone and veggies","useful":0,"cool":0},"5uWcWtCnWF1kS-hjiXsdyQ":{"text":"All I've had here are cocktails and they are my ultimate favorite. Ramos gin fizz, English","useful":0,"cool":0},"P9gZCWb65PzZXgRdjKvIHA":{"text":"This place used to be great. The old chefs menu was amazing, and the price for a four cour","useful":1,"cool":0},"Zrbd4Urfx-3WEaOppWK6oA":{"text":"Tujaques was the perfect start of our pleasant beer tour with NOLA Beer Tours.  We sampled","useful":1,"cool":0},"IFZjYlWenzfiEymHcAV0oQ":{"text":"If I could rate this place zero stars, then I would.  This is not authentic creole cuisine","useful":1,"cool":0},"FkBXetPTlg9IGiCE4z9G8A":{"text":"I was looking forward to eating at Tujague's and what a disappointment.  I made reservatio","useful":2,"cool":0},"DXZtd4HVizFfj8FVZw11qA":{"text":"Really interesting old bar with fun/funny bartenders. \nThis was the start of our haunted p","useful":0,"cool":0},"aLkxLO9y_lWjiXtN2WdZRQ":{"text":"Tujagues was kind of a let down. Would have given 2 stars for food value alone but service","useful":0,"cool":0},"vQ4PsFmoX3PjKMitbWsEBQ":{"text":"For the last dozen years we have enjoyed their annual set menu Xmas meal. This year both t","useful":1,"cool":0},"_za_-QcwOriY8JgJceeEtg":{"text":"First time and day in New Orleans. We walked in and didn't have a reservation but the mana","useful":0,"cool":0},"sOj8_24pfqlPix1q71APdg":{"text":"I went here for Christmas dinner in 2009. The meal was absolutely terrible and the service","useful":5,"cool":1},"qjpD0vnO-xnBn_YLogBuMQ":{"text":"Not sure about those bad reviews - not from me... great service, food was awesome and of c","useful":0,"cool":0},"b7YccM7iY7XZAoCierPqaw":{"text":"Was actually here before Katrina during spring break, I had the brisket which was pretty d","useful":1,"cool":1},"o06nkmGkbqre8iTp6x_mWw":{"text":"We waited all week to try this place because we heard so many good things and we were exci","useful":0,"cool":0},"0BsZk9YTyw7itr0xltr3Xg":{"text":"Excellent place for lunch. The three course lunch was an exceptional value, and delicious ","useful":1,"cool":0},"ywnTp8Dll-3mv9HHvT8-Jg":{"text":"Taxi drivers seem to make recommendations based upon kick-backs.  That is the only way thi","useful":1,"cool":0},"JWSp1x8SSejn0R69t7W0FA":{"text":"On a recent trip to New Orleans I checked out this restaurant based on its history and the","useful":1,"cool":0},"88W0Ap5qLPQ_XtygN_MYvA":{"text":"When you only get one night in NOLA for a work trip, you want to make your meals count, an","useful":2,"cool":0},"MtVcjNI6hEU-ksmwBmaXoA":{"text":"This is my favorite restaurant in the entire world.  I've never had anything like the meal","useful":1,"cool":0},"KjiMCMsS8q5PqNzLZL6RcA":{"text":"A \"must do\" in New Orleans.  Unique place with great food and service.  Been here forever.","useful":0,"cool":0},"QlriMkG1KJBCSiLJ-oUYDQ":{"text":"I came here with my travel group, and it was really disappointed.\nStained cup, Epitizer gu","useful":2,"cool":0},"55Yth4EkPIoqrW00xSkziw":{"text":"Don't go here. We did the ghost tour and called ahead to make sure we would get seating on","useful":0,"cool":0},"Agz-0_cF_gW4c9MclikPMQ":{"text":"Very good service! Our waiter was very attentive. I loved the crabmeat and mushroom gnocch","useful":0,"cool":0},"zRR3SVJ7DAMxJJDvCHcSBw":{"text":"So, I enjoyed my meal okay... At least I thought I did.\n\nI did the COOLinary menu and had ","useful":3,"cool":1},"_ka6i51Hjugjvbi1mIW5SA":{"text":"while i haven't been to tujague's in a while, i feel so strongly bitter about this place, ","useful":4,"cool":1},"glIek6pg2LJh5d9eBjM2rg":{"text":"It was alright. Mushroom gnocchi was truffle - ish, I didn't like it but others enjoyed it","useful":0,"cool":0},"janhrMwyJ7wHFKnxqKDGBg":{"text":"Ducked in to try the \"famous\" sazerac drink from the bar area. What a bummer. The bartende","useful":1,"cool":0},"d5X7RBkd84keByZSz9M-7Q":{"text":"Great meal!!! The gumbo is the best I've had!  Also had the brisket which was good and shr","useful":0,"cool":0},"6Xu3RgeibDlsE7F5Qx0hAg":{"text":"We stuck our heads in here, not sure what to expect, except that we saw it had good review","useful":0,"cool":0},"9RVPtl8advLjzOR28KGpcA":{"text":"Fantastic food and service.  I had the gnocchi, and it was delicious.  My husband had bbq ","useful":0,"cool":0},"_YUOSWGFQXNshl_2U2YLWg":{"text":"The cocktails here are 5-star out of this world, and that is honestly where the score come","useful":1,"cool":1},"8Kv1NrObQRCfSU21Ko4PKw":{"text":"Had dinner this evening (May 7) with a tour group. We ordered from the menu. I elected the","useful":0,"cool":0},"XtigM629v0vvB4-cRamzww":{"text":"Came here for Thanksgiving dinner with a reservation. Another NOLA historical restaurants ","useful":6,"cool":2},"HjAd8TTSkwNO8DnedBgEaw":{"text":"An institution in New Orleans.  Food is always superb.  Ate here for the 2016 Reveillon di","useful":0,"cool":0},"fsOO6RNwxKHaOCHcjLpFQw":{"text":"Only stopped for a quick drink at the bar here - a Sazarac, and my companion had a Ramos G","useful":1,"cool":0},"Yu4IfaB40lwk3z_1uLPVnQ":{"text":"Review is for the bar area only.\n\nin an area inundated with touristy souvenir shops,and ta","useful":2,"cool":2},"8P18wWzadkukrbKrJeBUiA":{"text":"Although good, the portions are laughably small!\nFor $29, you'd think the airline chicken ","useful":2,"cool":0},"1cQZON8l87swNouXbn7fCg":{"text":"We stopped in after a horse drawn carriage ride around 7:30 PM on Tuesday, April 2nd. No m","useful":0,"cool":0},"m-LlV2GqCGVeDCsFdsGL5Q":{"text":"This is the dining room at Tujague's Resurant | 2nd Oldest Restaurant In New Orleans. \n\nFa","useful":0,"cool":0},"9p9t8pRuFB7RkPQEMpsNGQ":{"text":"During a recent visit to New Orleans, we dined at Tujaque's with a group of friends. Our e","useful":0,"cool":0},"P4IdhmC-zJfOb00p7SE2Bw":{"text":"David. Ask for david and the rest is history. Coolest stand up bar I've been to. Incredibl","useful":0,"cool":0},"PK8cAiQhCOWTDTDExQ1erw":{"text":"Food: great.  \nService: great\n\nShrimp & grits, sausage, bread, drinks, everyone was delici","useful":2,"cool":0},"t8XWktkWOlPhNyDSQ87POQ":{"text":"Brutal. It's tough to recommend this place to anyone. Can not handle a large party? Food i","useful":1,"cool":0},"oj9vkQlCbMQ54dpXca4tog":{"text":"Down by the mint. Classically good. White apron waiters cater to your eating needs. We had","useful":1,"cool":1},"vkxrQk6OSflu2AV1C9nyGQ":{"text":"Service was slow and not very attentive. We ordered the rib eye and filet. Both were cooke","useful":0,"cool":0},"H4IiQLVW47jGPCCmcJaLCQ":{"text":"Let's just say...it sufficed.\n\nBooked a Sunday brunch for a party of 13 ladies in town for","useful":0,"cool":0},"3NGBpjVi3tWDXXP8N2CkEQ":{"text":"Classic, New Orleans, French Quarter tradition. Old school Creole deliciousness. Both shri","useful":0,"cool":0},"w7fQWUwWiu_Eqw2khjVd5w":{"text":"Another amazing place in New Orleans. The fried oysters were great. Also, the duck was ama","useful":0,"cool":0},"4boDvR_A-2FYyPlr5IqKdQ":{"text":"Might be my favorite NOLA place. Very old and distinguished among its type. Serious food h","useful":0,"cool":0},"MZ9f0KWI-ob4Xb69QvxJIg":{"text":"This was our second time at Tujague's and we were disappointed unfortunately. We did have ","useful":0,"cool":0},"fv2Mv_3m91IJM3ru4ATZqw":{"text":"We went here for lunch. We walked through the bar area and into back to find dining room w","useful":0,"cool":0},"q-VoskHHXLpP9icArirKdg":{"text":"Impressed by the menu selections but not with the results. The decor had an old Italian mo","useful":2,"cool":0},"vOf2hd_g6n_zjPeikHZy5A":{"text":"Our party of 10 ate here for dinner during a birthday weekend celebration. We had reservat","useful":0,"cool":0},"XvJKRZv_3F5_VawSPbjkGg":{"text":"Stumbled upon this establishment after walking through the French Market. We were immediat","useful":0,"cool":0},"YG2ZWNesLzyxkWkbU8Zc4g":{"text":"A true taste of old New Orleans.  The decor is what older New Orleans restaurants look lik","useful":0,"cool":0},"7ayOrQjrj9DKH3P0ubnByA":{"text":"I suggest ordering off menu and getting the Vampire(garlic) chicken. Used to be off-menu, ","useful":0,"cool":0},"IHfnkTx9WuvWS7KpwHdfJw":{"text":"Avoid this venue!  The food was mediocre.  The French Onion soap was tasteless, did not re","useful":0,"cool":0},"WaRA8HPuOp2KX0RsZcCjjw":{"text":"Here's an idea that it seems never dawns on a lot of people:  do some research before you ","useful":4,"cool":1},"MBaeznlHvMWcn7YN3WtVEQ":{"text":"Superb dining experience!\nAfter a horrible and failed at every level birthday dinner the n","useful":0,"cool":0},"FVBiOrJm-RxrFTY4-7ZupQ":{"text":"Food poisoning. \n\nNeed I say more? I will, though:\n\n1) I just recovered from two days of a","useful":5,"cool":1},"nXlhEPqIa0p0YnDpowKPFA":{"text":"My friends and I came in to grab a bite to eat before heading out to explore the rest of t","useful":0,"cool":0},"ucWlqYlGYHWP_hmiKSpAPw":{"text":"I went to Tujague's on Fat Tuesday with a friend who had a gift certificate, and, like the","useful":2,"cool":1},"Fy0mX9tsaDLGdVPgsPgNuA":{"text":"Beautifully haunted, authentic bar and restaurant in NOLA (one of the oldest) Best service","useful":0,"cool":0},"98rvL93VEX3pfSJ7V3wqMg":{"text":"Came here for the Revellion Christmas menu. Quick and efficient service and delicious food","useful":0,"cool":0},"l5ffEtdXLsGQOIohu7BWLw":{"text":"We went for a fixed price Reveillon dinner on Christmas Eve. The service was mediocre; our","useful":0,"cool":0},"w7RgSF1bPFnBKPbRIOj10A":{"text":"Stopped here on the haunted pub tour.  I don't usually give bad reviews for one particular","useful":0,"cool":0},"ZG0fNUnrk5htuonV-_R6sA":{"text":"We went last night for dinner and were very happy we did. Everything on the menu looked fa","useful":1,"cool":0},"X0yrlSW5YRmoG2wnjWD0iA":{"text":"Wow. Food, wine and service were excellent! It was the perfect setting for a nice bday cel","useful":0,"cool":0},"1-4FZgYQPbxzU1UsecMsmg":{"text":"Totally loved the food. The service the experience. Thank you so much for going above and ","useful":0,"cool":1},"EgMcK_rba8JXZ8-V4iDnqQ":{"text":"Loved this place! In fairness, we didn't eat here but we did notice one of the NOLA food t","useful":0,"cool":0},"lwABg-wJKk41SCBXYSugxQ":{"text":"I visited this restaurant in January 2018 right before Mardi Gras. The food was tasty and ","useful":0,"cool":0},"Vsgw-Gcqls8Z4nwtcGUXcg":{"text":"My very first dining experience in New Orleans was at this restaurant, which was recommend","useful":0,"cool":0},"d4QY0CUMAzDPdyivHMHWEw":{"text":"Very good food and excellent service. Robert our waiter was great with choosing the wine f","useful":0,"cool":0},"rYYKjTR9-J_o0n0NxuQDsA":{"text":"Tujague's is great. A pillar of dining in the NOLA community, with delicious food and grea","useful":0,"cool":0},"uU52B9G8eoj6erlGLyE00w":{"text":"This established eatery should be much better than it is, because it has a lot going for i","useful":0,"cool":0},"KmoyglhVkJx83-CKbZrMfA":{"text":"NEVER sit-down and eat in the main restaurant. If they have not changed practices since 20","useful":3,"cool":3},"sWVL24FpHO3JtFM-WvotZQ":{"text":"Best eggs decantur I've ever had and they make a hell of a caucasian. Tijangues is a must ","useful":1,"cool":0},"7ne52n36HIpd6At3mZWe7A":{"text":"First night in NOLA we had dinner here. I had the duck breast with sweet potato and omg it","useful":0,"cool":0},"YZm0QaWXCIPjLBnJjm7lvQ":{"text":"The food is delicious. The table bread is hilariously a basket of sub rolls and i don't th","useful":0,"cool":1},"_oEZDNOk7kATafIXi-yZfA":{"text":"I love this place! It's a pre-fixed five course menu, you choose the entree, for about $40","useful":0,"cool":0},"EamM8WpCLBKoDetxl8Ox4A":{"text":"We made reservations for Christmas Dinner based on the Reveillon dinner menu we saw posted","useful":2,"cool":0},"HojYvD6uyiz90d8a_YJK4g":{"text":"Happened upon this place walking down Decatur St looking for lunch.  The food was very goo","useful":0,"cool":0},"dHnc8JC5omX8OgG02RaMaw":{"text":"Great brunch! We had the BBBQ shrimp and grits and the oysters Benedict. Both were excelle","useful":0,"cool":0},"olEmfkhTRZYqdrTCGKWqog":{"text":"Dinner was nothing special. Shrimp remoulade was a spicy shrimp cocktail. There are lots o","useful":3,"cool":0},"orCWFQU1FabGcp5xM2167w":{"text":"So disappointed this evening to not be acknowledged by a waiter after sitting for 15 minut","useful":0,"cool":0},"TlAat0ACYhXoNZnlAiumPg":{"text":"Classic cocktails in a great location. I had always thought that places near the French Ma","useful":1,"cool":1},"D8sldKwMZut5VsDudga_kQ":{"text":"Went there during French Quarter Fest, since they decided not to put the brisket at their ","useful":0,"cool":0},"ovAfFuHDdJvoi-1xAX8Bdw":{"text":"A Tujague's bar review only. \nWent here to get a Grasshopper cocktail. It is alleged to ha","useful":0,"cool":0},"n0RtvM3wrxmH-sEqjyHgSQ":{"text":"Very expensive cafeteria food served in a dark museum. I guess some people really like tha","useful":2,"cool":0},"SjHp_b5VhvRybLmaGOtkzw":{"text":"Tres bon! Party of 7 at dinner rush during parades the week before MG, seated immediately ","useful":1,"cool":0},"iuIGIMBDfuBK5GFS2DWK1Q":{"text":"You get a good solid taste of NO for a good price. They have a set menu so be ready for th","useful":1,"cool":0},"GrtawdxdWSpSXcDDWzLncw":{"text":"We ate brunch here today. The service was great, very friendly staff. My French Toast sele","useful":1,"cool":0},"rkIAu0jwVI1T2yCtOKT68g":{"text":"We got a table immediately...now I know why. Having tasted the house specialty: brisket in","useful":0,"cool":0},"3eT21Uyg7VV-UHFXojI17g":{"text":"Enjoyed my ice cold beer  on tap\nSad to hear will be moving, but glad to hear not closing ","useful":0,"cool":0},"aSJtgxYwBapoPWsTHDHWdw":{"text":"This place was such a delight to go to. My husband and I came here for our nice dinner out","useful":0,"cool":0},"m_aCQ9JFjLT7jqyGKmzAzA":{"text":"Loved it. Was searching for a great steak restaurant that was quiet in the French quarters","useful":0,"cool":0},"CCa76bKh85hJuwmvFbmkKA":{"text":"Went here for the brisket, which is their house specialty. It was good.\n\nUnfortunately the","useful":0,"cool":0},"kBT2qdmJYH3_qwaqiR3w0A":{"text":"The food was okay, I only wished they would have served us in less than 2 hours. We had a ","useful":1,"cool":0},"n8G1cylb_eCCA_obNojJ1w":{"text":"Went here as part of a food tour. We were served appetizers: fried eggplant, some spiced c","useful":0,"cool":0},"p02NFYJhwmzL6kVXsJl5RQ":{"text":"Like many others we came because of the history which we learned from the tour guide.  Ver","useful":0,"cool":0},"9di-yHflEzsTcwJ6U7wYzA":{"text":"Took my adukt daughter to her first Revellion experience on Sunday evening (12/23/2018). S","useful":0,"cool":0},"6k4D2RLrE7mnZpdp6-sPbQ":{"text":"Brett is quite possibly the best bartender I've ever encountered! His service was the best","useful":0,"cool":0},"kaiiP0wl3ZwlcLcm9rpuWA":{"text":"Great overall. Salad, brisket appetizer with really righteous horseradish, Menuire sauce o","useful":0,"cool":1},"gn6-YZZxrTiiQtO-vg6CHw":{"text":"2ND oldest Restaurant in NoLa, French Quarter. est.1856    Tujague's\nOnly Prix Fix\nOnly 4 ","useful":3,"cool":0},"uoF9bwslc91X6FldClwAtg":{"text":"Really good!  Nice staff.  Try the Grasshopper!","useful":0,"cool":0},"JE16xY3st06CmdZzmQ4hgA":{"text":"I came here for dinner with 2 friends as we were in town for the week and our tour guide f","useful":0,"cool":0},"GHpAb36AeDBafCItYQ-jkA":{"text":"I've never EVER sent anything back. My boyfriend and I ordered the same filet mignon dish,","useful":0,"cool":1},"KmQ40bnMyXFrAJ-A8EaRgA":{"text":"This is the dining room at Tujague's Resurant  is 2nd Oldest Restaurant In New Orleans. Th","useful":0,"cool":0},"jezL55hdwcavSAkBcM2HMA":{"text":"We only came here for one thing...the Grasshoppers that they're known for...a nice green m","useful":0,"cool":0},"tJd4rdU1teJt5dqzLso4mQ":{"text":"This review is for march 17 2019 :  the whole experience was ehh nothing special I think i","useful":0,"cool":0},"603ZB1T6VAUAWRSyjSlR1Q":{"text":"I feel like this is a hidden gem.  From the outside you wouldn't think of walking in but o","useful":0,"cool":0},"dL6ZjCdPD03nKTbsY_cp-w":{"text":"We came here for a group dinner for one of my best friend's bachelor parties, it was prett","useful":5,"cool":6},"D_aqSOePwjqC-L9scQBoBA":{"text":"What an excellent escape from the steaming chaos of Jackson Square: cold air, white linens","useful":0,"cool":0},"CQ3G368RVG81J9IwY2Ps6w":{"text":"I don't know about the restaurant because we were in the bar escaping the heat and drinkin","useful":1,"cool":1},"H5mEqYkdGUyGhJpvJKVq9w":{"text":"Spent the last 3 days in NOLA and this was by far my favorite restaurant... friendly envir","useful":2,"cool":0},"tXyhDv5viVQgkS0e7sTf-g":{"text":"on our recent trip to new orleans, I was on a culinary mission. I wanted to try some of th","useful":0,"cool":0},"ye7mWREIoe5EEI3Th5RQcw":{"text":"New to NE.  Came in here for a warm meal.  Fast and outstanding service.  Clarence was gre","useful":0,"cool":0},"arAwizOhYDVCc_LS9SFgGg":{"text":"Wait and bar staff excellent or there would be NO stars! Worst meal - and this is not hype","useful":0,"cool":0},"cbFjvala8ggGUWIej7wL_g":{"text":"My friends and I visited this stand-up bar with our tour guide friend for an afternoon pic","useful":3,"cool":1},"Zl1qmw0kWtCsWZmSzrxrRw":{"text":"We came for drinks in the bar and encountered the rudest barmaid ever. We were planning to","useful":2,"cool":0},"1_KtKqUAZ6iCs2sYxCq_6A":{"text":"Very disappointing - the waiter is rude - took my wife's meal away before she finished it.","useful":0,"cool":0},"me5TKFOPWVYW-lkrJje-rg":{"text":"My Gumbo appetizer was average with an ok sauce flavor aside from the sausage.  There were","useful":0,"cool":0},"KeVnDTL3KjeFjtrMWJN4uQ":{"text":"Ordered:\nCharbroiled oysters \nGumbo\nRed beans and rice \nGrasshopper \n\nFood: \nCharbroiled o","useful":0,"cool":0},"Z5remKJb-cg9ZaJbesBNdw":{"text":"This place was wonderful. We had a private room upstairs for a large party, and the servic","useful":0,"cool":0},"kMvky8-P5wbgkvjZMXBLCA":{"text":"I feel like I have to defend Tujague's! But I'm only going to defend the bar, as I didn't ","useful":1,"cool":1},"IGxrD_vTl8A7xIjgoDxgew":{"text":"Excellent food & phenomenal service. We had the Abita shrimp & grits, gumbo, & asparagus. ","useful":1,"cool":0},"Y8AG9SmKaxCTZhV9VF-96A":{"text":"We went to Tujague's when in NOLA over New Years and were quite disappointed after our exc","useful":0,"cool":0},"EkEYNqoAJ36sT_8WaoZQqg":{"text":"We ate at Tujague's for a final lunch in NO yesterday. I had the soft shelled crab poboy, ","useful":1,"cool":1},"EhN53bQxVy03d3wCVxAz5g":{"text":"Horrible service! A) they couldn't the reservation even though I had confirmed via phone e","useful":0,"cool":0},"f8yuRLaq6AVYBAvYhRRftQ":{"text":"Very charming, wait staff is very attentive. French bread was nice.Food was edible. We had","useful":0,"cool":0},"JpXhumYtmLGB5KWsRXm7Sw":{"text":"We went there Christmas Day for what we hoped was going to be a beautiful and delicious ex","useful":0,"cool":0},"Ryag8j-haEPv_NIoiU9Q5Q":{"text":"Great service, mediocre and overpriced food. Shrimp and grits were just okay. It was loud ","useful":0,"cool":0},"WRRM1gw_WSCr451H3LJ3hw":{"text":"SO MUCH FOOD. They are solely a pre-fix restaurant. I guess big-wigs and local politicians","useful":0,"cool":0},"fW_I6pVaFM12cMBHUPxKOQ":{"text":"Saveur recommended this place along with a few other elderly venerable New Orleans eaterie","useful":2,"cool":0},"L1or-hYFyGFZofeJAXm9jA":{"text":"Hand down best food we've had in NOLA this week. Fried oyster starter was incredible which","useful":0,"cool":0},"m3zbL-GW8-V9fg7pJ2HEOA":{"text":"This is probably the oldest restaurant I've ever eaten at (around since mid 1800s).  I rec","useful":0,"cool":0},"gXrH4_kdEnUKjkOjeJElfw":{"text":"The char grilled oysters were just ok. They were not as \"meaty\" as others we have had. A f","useful":0,"cool":0},"KEOwBExI7ox9yh66m6wDgA":{"text":"Vastly over rated. Poor service, only 2 other tables occupied.  Food was mediocre and the ","useful":0,"cool":0},"gxBfjIZmXoEYM3GlOIl86g":{"text":"We stopped in to try a grasshopper at the place where they were invented and we were not d","useful":0,"cool":0},"ZYA8U7-tW3lqedEAXTnTuA":{"text":"In our short stay here, I must have had a good 6 Bloody Marys from this place.  I am a hug","useful":2,"cool":2},"vxBkVBcyfXogDYqgAoBU8w":{"text":"Omg what a fantastic little spot to pop in and have a yummy snack. Again I trusted the fir","useful":1,"cool":0},"wZtlpo4OoArE2BQLssFkmA":{"text":"Tujaque's is one of the New Orleans restaurants that separates this city from others in th","useful":3,"cool":2},"My-vF7Drzr6yy2K1_YDpDQ":{"text":"Just finished a Christmas day seating and I'm gonna say it...the food was less than stella","useful":4,"cool":0},"HiSrioS3Y0g0v9L0Asp-zQ":{"text":"My review is based solely on my experience at the bar. I came here with a tour group and r","useful":2,"cool":0},"OraNGjjsNMxXaHZ4NfUj_A":{"text":"Last week was my first return to New Orleans since before Katrina.  I didn't have the hear","useful":1,"cool":2},"jExXXmC7JvBCvKsZzyWIgg":{"text":"Came here to celebrate our 10 year Delta anniversary with my sorority sisters and we had a","useful":0,"cool":0},"Rz5DyYMHrgChLVlKX8GjSQ":{"text":"Deeply disappointing Easter brunch experience- they escorted us to a silent, windowless ba","useful":0,"cool":0},"FSlLGEhZYPx-Pu_wGdmyuA":{"text":"Though I thought the food was good, I was turned off by the luke warm bowl Gumbo that I go","useful":0,"cool":0},"iRv_iY-bHnw3d670RV2Z4w":{"text":"Outstanding service from Chris.  The brisket with trademark sauce was to die for!   Don't ","useful":0,"cool":0},"Z_uhBcRcb5IVLFDvEFo9SA":{"text":"I came to Tujague's (just the bar!) for a drink as a part of my challenge to hit up all of","useful":2,"cool":1},"r-3CiAmYTStWY3qOlRqFXg":{"text":"Wowowowowow omgah. This place is totally delish.  Got the shrimp remoulade salad, it was j","useful":1,"cool":0},"KtUALyuLH7VWHJK62-ELCQ":{"text":"Great old-school New Orleans establishment.\n\nLove the bar, the fixed menu and the price is","useful":1,"cool":2},"S508uz7AR3HcLRq1Zrprfw":{"text":"The food was absolutely amazing, as was the service, and the sommelier is brilliant! If an","useful":0,"cool":0},"-Q4_pSHrMgdsBYMsKTlhRQ":{"text":"We stopped here for a quick dinner of gumbo, brisket and salad. The atmosphere was authent","useful":0,"cool":0},"JnvxC2lEORx4gJD0cDmWug":{"text":"I'm not sure if we went to the original location or the new one this past Sunday (I'm hopi","useful":0,"cool":0},"qYxTOYiIB1HYds-ZhiYOfA":{"text":"Food was great! Enjoyed the salad with oysters. Definitely a \"go to\" place!","useful":0,"cool":0},"OyCwWPnKmC90y_ahCOQwkw":{"text":"We did a food tour the first day we were in town and this was the first stop. We had red b","useful":0,"cool":0},"uH6LGsdc6veXqrmeRn6Seg":{"text":"Anniversary dinner was disappointing.  My soup was cold and had to be sent back.  My husba","useful":0,"cool":0},"NZuxF7u0iELOoqmBXOradw":{"text":"Food was mediocre, particularly for the $50 prix fixe price. It's got the historic feel to","useful":1,"cool":0},"WKWiF8xG-EQ97h1ExuniZQ":{"text":"You need to go here for classic NOLA cocktails!!!\n\nThe bartender made us mind-blowingly de","useful":0,"cool":0},"TKuPgTXS2HSorhPZRaFp6A":{"text":"Only experienced the bar area. Girlfriend and I went to have a grasshopper in the bar wher","useful":0,"cool":0},"GPnuTswNe2tzICnSsNI9sQ":{"text":"It's hard to impress me in NOLA anymore. We had a Christmas dinner here. History of place ","useful":0,"cool":0},"52-Nfv5aex9v4hSxmjR3Ig":{"text":"Unfortunately, we did not enjoy Tujague's. We were looking forward to dining at the second","useful":1,"cool":0},"vm_v05Anz8OLwuBz7167lQ":{"text":"Best Irish coffee on the planet, ask for Brent to make it! Awesome food too. Cool building","useful":0,"cool":0},"XT24dbOMaDn4xNnKHCGeyw":{"text":"Ok, so...the brisket is amazing (no smoke flavor), but wow so tender.  The mashed Yukon go","useful":0,"cool":0},"6odsrqpNCOZUc39XlvgZqA":{"text":"I really liked the look of this bar and their cocktails are excellent! Try the gin fizz!!","useful":0,"cool":1},"mpynmBCV0WNzsnm3o3SdUA":{"text":"This place was fantastic. I had a 8:30pm reservation, we showed up a little early yet our ","useful":0,"cool":0},"1zBDrnyHR1A0iYnMc_nZqQ":{"text":"Great food and service. They had $3 mimosas and bloody Mary's during our lunch stop in. My","useful":1,"cool":0},"uQCkQYUgyXvDaLodiZOGNg":{"text":"Forst the good. An old and interesting place to learn about... the home of a lovely drink ","useful":0,"cool":0},"E6bGPns-jAmOSY-wkfCI2g":{"text":"We went here because of the 150+ year history. I read the reviews here and they were mixed","useful":0,"cool":0},"TaPfLwHq0Fb8Zz4Ahv0liA":{"text":"This is a 4.5 star review which has been rounded up for history, atmosphere, and value.\n\nI","useful":11,"cool":5},"N7ZBgCYprKna7IzWrlRmFQ":{"text":"Being a past patron of this establishment, on July 9, 2018, we treated  a full table of ou","useful":1,"cool":0},"yTb_8tFa3bRZCYjphNuY9g":{"text":"Eat anywhere but here. From the get go it was a disaster. Came with 10 friends. While wait","useful":2,"cool":0},"zg1SkA8brtBptQgVmBsWeA":{"text":"Iconic New Orleans restaurant that I had to go to before it moved and so glad I did. The b","useful":0,"cool":0},"WaNlwD10i7_qXWJu8pRgBQ":{"text":"Brunch was excellent. You will get a true Nola experience anytime you visit. We have dinne","useful":1,"cool":0},"KHs0ml57YG2n4c7XxcQBCA":{"text":"No No No this place was the pits I was born here and came home to visit and went out with ","useful":1,"cool":0},"-F143XFKuS4ovYq4nOybbA":{"text":"Our group reserved the back room of the restaurant. It's a fairly large room. We had four,","useful":0,"cool":0},"Wa1LElMiWWYVlkcPCnzFnA":{"text":"Nice Meal but more expensive than quality warrants. For us appropriate menu prices are a b","useful":1,"cool":0},"3NOmD4R2aSaHYpwjEZBdPQ":{"text":"We had dinner here. Food was good. My wife had Wild Mushroom Gnocchi and I had fish. It ha","useful":0,"cool":0},"TOlSvTY7VVraLpgSAUt5Qg":{"text":"A MUST STOP FOR FIRST TIMERS IN NEW ORLEANS!\n\nthis historic restaurant has been here for w","useful":0,"cool":0},"ipaya_AGOTxAtrkACgHwrQ":{"text":"The noise and craziness of the street turned into a hushed whisper when I entered the dini","useful":1,"cool":1},"FFBJNd1lkpwMh1N8Nr1wUQ":{"text":"Great food for a good price and amazing service!! Waiters are very kind and restaurant is ","useful":0,"cool":0},"5kBQPLwO2kYoVrMBtfoFAQ":{"text":"Not sure if we hit Tujague's on a bad night, but this was not a good showing.  The service","useful":0,"cool":0},"_I22DMP9-jYo75XVfw7WEg":{"text":"What a disappointment, my wife and I suffered the worst meal combined with crappy service ","useful":0,"cool":0},"GkMjM4kViG5oSQjDkUmq9A":{"text":"Bar review only: They make their own bitters amd syrups here. Try a drink with the IPA syr","useful":1,"cool":0},"myXPNGuj9NTfISVs6W1AIg":{"text":"Had my first cocktail of my NOLA trip here.  A wet windy afternoon, stumbled across this o","useful":3,"cool":2},"6NzBgLbWd9FOFDS-NgkabQ":{"text":"Wow, what a disappointment.  Let me say up front, it was Christmas Eve, so their regular m","useful":3,"cool":2},"pJiBBUDHLgGn1d2QHJxkeQ":{"text":"We came by for dinner on our last night in NOLA, and the food here is delicious. I had the","useful":5,"cool":4},"P-ukn6usaYw-N_Ele5Ozvw":{"text":"This was the first stop on a long & boozy afternoon, so you'll forgive me if my recollecti","useful":2,"cool":0},"8APoFqioqmskuyGN_mfVDw":{"text":"2nd oldest restaurant in New Orleans.\n\nI made a reservation through yelp, which was very c","useful":3,"cool":1},"vHbWKUhUF8Omuv_LeCvcEw":{"text":"I went there to meet a lady of the evening I met on Craigslist. I was nervous and excited,","useful":0,"cool":0},"Ne47Olo8dkkauQt6bLaKsQ":{"text":"Have you ever wondered where the home of the Grasshopper (cocktail) is?  Me neither, but w","useful":5,"cool":4},"uJP2ALEVR9Ua7VBiYPSe1Q":{"text":"Deeeeeelish! Perfect for large groups if you don't mind the grand acoustics or the overly ","useful":1,"cool":0},"fE4dpvyVaBe56FSN2r45bQ":{"text":"I did not eat here!\nOur tour guide started our pub crawl here on Friday night with a hurri","useful":0,"cool":0},"o_tHLRzt118D8DDa5iT9ug":{"text":"Worst restaurant I have been to so far in New Orleans. The bread was stale. The charbroile","useful":0,"cool":0},"j7SmLzihcR97GcYGvsO0aA":{"text":"Arrived with no reservation, party of 4. Hostess was very helpful and gracious. Patty, our","useful":0,"cool":0},"SbeWu2zsCWQeEcYEmsUMlQ":{"text":"I can only speak for the stand up bar but its a must hit. We stopped in during a tour to t","useful":0,"cool":0},"20HMN1NZ82yw-cXn_FlfQA":{"text":"I came here to order Ramos Gin Fizz and was very disappointed because she used baking soda","useful":1,"cool":0},"IhkR-kcBSjkLzD70iGAaaQ":{"text":"My friend and I went to Tujague's to try out the place that invented the Grasshopper drink","useful":1,"cool":0},"9GodAUfYVOUHqHY320G5zw":{"text":"Couldn't get out of this place soon enough ! I have absolutely nothing positive to say it ","useful":0,"cool":0},"aA9Pxd4JRr1fRT1RwcFWEQ":{"text":"WARNING: the BBQ shrimp and gumbo are not keto friendly, but who cares! This place is hand","useful":0,"cool":0},"91WoFTPLZYantHtW6qaeIQ":{"text":"Ordered 3 appetizers because we weren't very hungry. Duck crepes, charbroiled oysters and ","useful":0,"cool":0},"cDSpBMYhEUXCQzVy1TVrlg":{"text":"New Orleans has always been special to my family. My great-grandparents immigrated from Fr","useful":2,"cool":0},"U8D4dX7yBuQov6pS8nXo_A":{"text":"Tonight, the seven of us had a fabulous meal in an upstairs' room at 5:00. The brisket was","useful":1,"cool":0},"4u_--x7zlA_uqqK7oYSRoA":{"text":"Tujague's PIMMS is the ish. It is literally the best Pimms drink in New Orleans. Not all a","useful":1,"cool":1},"bwWzqeRXK8zvGyXsdgY_5w":{"text":"BEST meal in NOLA! Robert fitzmaurice o'maoilriain was our server- friendly, and extremely","useful":0,"cool":0},"gW5xTLtBNyATIx6BJEV51w":{"text":"Gumbo was really flavorful. Chargrilled oysters were just okay. Service was good and in th","useful":0,"cool":0},"lfIrsQtlmDRaKS1qaUdEYg":{"text":"This place was recommended to us by locals, so we decided to check it out. Located across ","useful":2,"cool":0},"xXUV-HUcPh-p4y6PcVNFXw":{"text":"When touring a city that is new to us, we typically drop ourselves into a historic distric","useful":0,"cool":0},"lpsCCiuIF7sGeWczaI0g1A":{"text":"I think getting a drink and soaking up the historical vibe in the bar is a must! The food ","useful":2,"cool":0},"H5ULHQv8iF-4B9p8QEC_WQ":{"text":"Amazingly great Shrimp Po Boy! So pleased that the French roll was super soft and not toas","useful":1,"cool":0},"pLBWHuVBdaXC-nX85l29JQ":{"text":"Food: 5; Service: 2; Rounding up to 4 on average.\n\nFirst, the food. We did the 5 course me","useful":2,"cool":1},"0bN1_myqDegM_won42UMPw":{"text":"We didn't eat here but we stopped at the bar and had some drinks. It's a historical bar an","useful":3,"cool":3},"4r9B9ycMtAezNcnDDRQigA":{"text":"We took a chance and tried Tujague's - great choice! The red beans and rice, very good; th","useful":1,"cool":1},"jJVVJgVS8u4vItPCWtss_Q":{"text":"We had brunch here today because we wanted to make sure we visited this building one last ","useful":0,"cool":0},"iv-DkL5IsPwjJ--8c6NK-g":{"text":"I went there with a couple of my friends because we had done a ghost tour the previous nig","useful":0,"cool":0},"3FQhJ7aG-J203JyiBGTL0w":{"text":"So, our tour guide told us that we had to come here because the recipe for the beef briske","useful":1,"cool":0},"QKghPYxawma0X_w6zprMLA":{"text":"Tujague's is NOLA's second oldest restaurant. \n\nHome of the Grasshopper cocktail. \n\nI've h","useful":5,"cool":6},"W94GMdARLvzvdGas5Lhy5g":{"text":"I picked this place due to the awesome history behind it. It has been around for a long ti","useful":3,"cool":0},"GPSqTvRX2BZ7NCvUGRmrLg":{"text":"The charbroiled oysters were more raw than cooked.  The chicken gumbo soup didn't have any","useful":0,"cool":0},"VhSoW-Lqo9_RAy2St6frbw":{"text":"Not great  we had been to Tujague's about 10 years ago for Christmas and really enjoyed it","useful":2,"cool":0},"PSXGKjTvL_A57ZB9lWAEig":{"text":"This is a classic dive, the oldest bar in the city. It has the look of an historical bar, ","useful":1,"cool":2},"vCdpmiNCtVNJZ6X5ZyqgqA":{"text":"For lunch, I had brisket po-boy and partner had the famous brisket- both OUTSTANDING! Yumm","useful":0,"cool":0},"ln1xcq7DcayOgsMowz6FTw":{"text":"After endless searching for a bar to host my post-wedding cocktail hour, Nancy at Tujague'","useful":0,"cool":0},"6NMba1HXMU_DlDFznWJhsw":{"text":"Walking from the hotel to find a good place for steaks, we asked a local horse & carriage ","useful":12,"cool":11},"taq2PpHVGIo3s9PGH4uh7w":{"text":"Went here on a recomendation from our tour guide. The Brisket was amazing along with the b","useful":0,"cool":0},"2-HmnnMIYHqf6LpzZSxT1A":{"text":"This place is great.  From the very attentive and friendly wait staff to the unbelievable ","useful":0,"cool":0},"6E2tP77Ronwy0yTIJMP-7Q":{"text":"In my 52 years of life I have never had a more flavorful and moist lettuce salad. Sounds s","useful":0,"cool":0},"dZ6RNG-ykEpsTawwTSEwNw":{"text":"This place is historical and the food is amazing depending on what you order. \nThe soup du","useful":1,"cool":0},"8bApeyFexWqyAv1C1hTyyA":{"text":"Second oldest restaurant in New Orleans. Had a wonderful dinner there. Others really liked","useful":0,"cool":0},"iQw6lm1UE9EzMZeLtRPTPg":{"text":"2nd Oldest Restaurant in New Orleans.\nClean establishment.\nFriendly service.\nSimple and So","useful":1,"cool":0},"jZT9CURBURJyGUEHYRsh3Q":{"text":"Christmas dinner.  Cold veggies and potatoes, steak underdone, med rare was rare, etc.  sa","useful":0,"cool":0},"AZQIAprgcD34TE46CML6pA":{"text":"Honestly we had the coolest experience ever... We had a party of 11. Alex was our server. ","useful":0,"cool":0},"8o1xXiLNdZbIYO5Lyx2GbQ":{"text":"The bar is just not the same without Paul Gustings. Very disappointing. Drinks were medioc","useful":0,"cool":0},"3duX2V-jG0LFLFP7AvOzCQ":{"text":"Awesome place with great food. Met the owner and he couldn't be nicer. We love eating here","useful":0,"cool":0},"ZWns6R93NPnKckkcBVPgBw":{"text":"We came for Thanksgiving.  It was a set menu. The salad was small but good dressing. It wa","useful":0,"cool":0},"l8R7WnWP1uzeN_tsUAAnFQ":{"text":"Went for just a drink and absolutely loved it! Delishhhhhh Pims! Also tasted the corpse 2 ","useful":1,"cool":1},"sezqU0bdNCrIf4wzIzxTpg":{"text":"If there is one thing you must not leave without trying, it is the grasshopper drink. They","useful":1,"cool":0},"8PbyAA7VGLpEIomd0o3c2Q":{"text":"This is my husband's favorite restaurant in the City. We have been several times over the ","useful":5,"cool":0},"ynwWs4tIFsJnPbzLeq2VyQ":{"text":"This classic New Orleans staple has been around over a century and for a good reason. I to","useful":2,"cool":2},"xaX8NddMrJmYyMy3dRfgsw":{"text":"Stopped by for a quick lunch.   Ordered the Lettuce Wedge with Fried Oysters and Gumbo.  B","useful":0,"cool":0},"XzBdgYlEB_dVS51Ka8NyQQ":{"text":"Tujague's is an institution in the French Quarter and though the food might not be the bes","useful":3,"cool":1},"wFZNJkQ-DrKY8SjjBM2Iyw":{"text":"Really solid regional comfort food.  Gumbo, redfish almondine with crab, and creme brulee ","useful":0,"cool":0},"TY52uQToq7BTasSyZfpaQQ":{"text":"Very disappointing.  Tomato-shrimp bisque was like canned tomato soup with a few bits of s","useful":0,"cool":0},"g29F6HSF6HaIU3IAwLwGqA":{"text":"I was worried I wouldn't be able to find a nice place for dinner on Christmas Day given Ne","useful":0,"cool":0},"NrpPjUVGFAszzGgByh3-cA":{"text":"Tujague's was an amazing dining experience for the brunch that I had today. The gumbo, cre","useful":0,"cool":0},"J7wYsfrr6MHLomg12fx5uA":{"text":"We tried a couple of appetizers, as we had just gotten off of the plane and a curried butt","useful":0,"cool":0},"xBa6ZGCPD00DDzz0_dnksw":{"text":"Heard that the Grasshopper drink was worth a try so we stopped in to check out out the hyp","useful":1,"cool":1},"ohWnWICIHA92t3dR1OgXsw":{"text":"We stopped in for cocktails before our walking tour.  I'd intended to ask for it to go, bu","useful":4,"cool":4},"0bsLenzJBSMlVelTlHWQlg":{"text":"Tujague's is a fabulous place to get a drink. Their bartenders are true mixologists. I had","useful":1,"cool":1},"sIJqPzcS8uWQYqKnLRLPpA":{"text":"This is a 2.5 * review, rounded up to 3 for history.\n\nThe Hubs and I went there with a  to","useful":0,"cool":0},"pS8nnwoVSxqFRdvK2jNNRg":{"text":"Disappointed. I had been here years ago when this was one of NOLA's good restaurants so i ","useful":0,"cool":0},"d_8FtH_5fpI7xFt1gTPuuQ":{"text":"A great piece of New Orleans history.  It is the Crescent City's second oldest restaurant ","useful":0,"cool":0},"l8adPoHOKFJU2yfIJ2R36w":{"text":"The cocktails were excellent! The Sazerac and Grasshopper are fantastic. The 5 course meal","useful":1,"cool":1},"UI84aWkDf3k47JvcIvFN1w":{"text":"So it took 3 hours just to get our appetizers. The food was just ok. The brisket was cold.","useful":0,"cool":0},"bm8Pz-gTSTblHSUOhPy5FA":{"text":"So I first tasted the roast beef po boy on the taste bud tours. We went back the next day ","useful":0,"cool":0},"4-tWWO-IxDH9EtD-tzm5Gg":{"text":"After a stop for happy hour a few weeks back and seeing the shiny new location, I put a pi","useful":17,"cool":8},"nXEterTHgxdjQeixkCEtBw":{"text":"Looking for a place to eat lunch before the Sugar Bowl parade New years Eve. The place was","useful":2,"cool":1},"asljJ8RNV5F4GnlHGUpkaQ":{"text":"The family and I had a WONDERFUL dinner here. They recently switched locations and it is g","useful":1,"cool":2},"gOptU-4Kn_lSnx4-FQr4Dg":{"text":"This jewel is soon to move from its  historic location.   Thankfully, I attended a \"Last H","useful":3,"cool":2},"G252GteEewGH2--3EfYOUA":{"text":"Traditional New Orleans atmosphere. I'm told one of the oldest establishments in the city.","useful":2,"cool":0},"TfARl7HtdD8MJ5IVkBiJ3g":{"text":"Isabel was amazing. She answered every question that we had about the menu and made sure t","useful":0,"cool":0},"Nx5Y3PVI8s5GlND7XLWEew":{"text":"Good local flavors. Bread is the lightest ever - crunchy on the outside and use air on the","useful":0,"cool":0},"iWUm-bKHV67rixpKAYoUfQ":{"text":"This restaurant should be on your 'must visit ' list if you are in NOLA. Delicious food, l","useful":1,"cool":2},"JaIRh3IjD9L5n8xvi8tDhA":{"text":"Despite being a local New Orleanian, I had never visited Tujaques at the old location. I h","useful":1,"cool":0},"Bq92iXVXtaaWgrAlIwNpEA":{"text":"Came in a half HR before closing, waiter Chris could not be more welcoming and accommodati","useful":0,"cool":0},"C5HBiTAzXhTFNscvTpTlyA":{"text":"Heaven is a table up the rickety ancient stairs set with a never-ending bowl of turtle sou","useful":1,"cool":2},"XsvId0V6xcKmBywU9l50fg":{"text":"New location is great. Not sure but seems larger. Miss the outside signs but they seem to ","useful":1,"cool":1},"JNNjoGOkZT6lWgZfSQkL_A":{"text":"The French toast was great, not too sweet and served with a proportional amount of fruit t","useful":0,"cool":0},"jON0KHRYqMajoseVXrYQgA":{"text":"Haven't yet eaten here, but I am reviewing because of how helpful the manager Jeremy was (","useful":1,"cool":1},"HZXhJ1TWu_HWbkNkp6J4DQ":{"text":"Sorry to say this is no longer a must-visit. The new chef's signature dish, the gulf fish ","useful":5,"cool":1},"l0s2MPV7dHsrBhOvtTiDrg":{"text":"Disorganized and terrible service! They canceled my reservation 1 hour before we were sche","useful":0,"cool":1},"wEmoboWQeDFg_rV-CmoWBw":{"text":"One of the best and oldest restaurants in NOLA. great spot for a datenight. The food and s","useful":3,"cool":2},"Lrc0g-F3FzHfY0PD9tmA6g":{"text":"Clarence was amazing. \n\nThe food was good, I had the brisket, it was perfectly cooked and ","useful":1,"cool":0},"AYayTYs8FmQ51HWAKVtmRw":{"text":"We came for the coolinary menu. Service was fantastic! The food was inedible. It seemed as","useful":3,"cool":0},"fj6ZZA5vBaiVQbCLDlGrkg":{"text":"It has been several years since I last ate lunch here and my recent experience left me ext","useful":3,"cool":1},"Rbi0ziCiTX3_H1mbCKY-6w":{"text":"I've eaten in New Orleans many times over many years and this was the worst meal I have ha","useful":0,"cool":0},"CSSAFwNdEXqXwGDjRDXJag":{"text":"The legendary Tujague's Restaurant has been around since 1856! I think the building was bu","useful":0,"cool":0},"SMYiJYaMP8Xb1K_3dSE4JA":{"text":"The new Tujaque's is a vast improvement over its older version.  The new building has 3 st","useful":1,"cool":1},"czkCUXiXxhg_vbHJid1hog":{"text":"Old school, dive bar atmosphere type place....exactly what you want to make sure to experi","useful":4,"cool":2},"lxVQxfncmSq7H42y9nMinA":{"text":"We were seated at 11:15, the first service. Food was coming from the kitchen very slowly. ","useful":2,"cool":1},"3beVrEZbWTxL36otdJeQPQ":{"text":"I wanted to try the new Tujagues so I stopped in for lunch this past Friday. They made me ","useful":2,"cool":1},"AAJKH25B6cROMcJKaPvomQ":{"text":"Finally had a chance to try Tujague's at their new location, during the summer Coolinary e","useful":24,"cool":22},"Nurp0zbRX_sPgWfzpy4cDQ":{"text":"Wonderful in every way! I have been to Tujaques many times years ago when it was still at ","useful":0,"cool":0},"6NlURSQXoka_Cwi5K5hIug":{"text":"I live in Birmingham, AL but will be in New Orleans for Thanksgiving.  At the end of Septe","useful":1,"cool":1},"7uf-iSesDRaQ82kndDjtwg":{"text":"New Building. Same amazing charm, class, and service. Brittany C was an absolute dream of ","useful":2,"cool":1},"Y7kypD0v-2fM1IcyxwNt_A":{"text":"Positives first: the restaurant is beautiful, the wait staff was very nice. We sat in the ","useful":0,"cool":0},"1Oc536898sCBgWmcdCMD3g":{"text":"Didn't have food but bar service and drinks were amazing. Definitely a must stop for a out","useful":0,"cool":0},"-9auIoqmLIfQsgJeo6PJMQ":{"text":"The staff for the most part is fantastic. The food is great. The space is beautiful. There","useful":0,"cool":0},"a3KfPWP402A8tY44ln4Zzg":{"text":"The fried chicken and chips is not on the menu, see photo below, excellent!\n\nNow, why the ","useful":2,"cool":2},"mQU5WhcCVFLjLB43EYtjtw":{"text":"Sometimes when you walk into a bar or restaurant for the first time, you get that feeling ","useful":2,"cool":3},"qtShdJEOCD9GPBoqp3iLNQ":{"text":"Wonderful little snack/drink date with my husband here last weekend! We sat outside in the","useful":2,"cool":1},"YIANK059BzyDzGh7C3vJIA":{"text":"The restaurant was extremely behind on everything tonight (2.5hrs for a two person meal). ","useful":0,"cool":0},"4FV0OjTBLDznr1lIGIRUDA":{"text":"Great atmosphere! Delicious food! My husband raved about the soup du jour: Cream of Brocco","useful":1,"cool":1},"KEbwdppTquZcoDGQeBaDSQ":{"text":"This is an old school restaurant in a very touristy area. We normally wouldn't eat in such","useful":0,"cool":0},"C6Mt0kf5xJ-1KNCYXbq25w":{"text":"Fantastic restaurant in the French Quarter! Was walking down Decatur street and noticed th","useful":2,"cool":2},"9VyaxuZsAwRQkivyaXuImw":{"text":"We had our Christmas Day lunch here and it was fabulous. The place is a very nice typical ","useful":0,"cool":0},"jO1scuv9KEd4uqq8qbm42Q":{"text":"Made reservations as a group of 10 to celebrate and enjoy New Orleans, we had an amazing d","useful":19,"cool":13},"Okz6QZx67mUdwm8RvjmVoA":{"text":"Lovely NOLA experience! This place was established in 1856 and until 2013 they used to onl","useful":0,"cool":0},"YKB4m5tGs4s-80lymavtKQ":{"text":"Tujagues is one of the top 3 MUST eat New Orleans classic restaurants.  It is old school n","useful":7,"cool":4},"yhYf4qz4ScZL6x4afN2MVQ":{"text":"First let's talk DÉCOR, OMG! This restaurant is so beautiful w it's olive green walls, flo","useful":1,"cool":1},"uGPIRNonqJsYGG7ZY-gMQg":{"text":"We made thanksgiving reservations weeks in advance. Had 8pm reservations didnt sit til 9:3","useful":2,"cool":0},"unV1OoHCxmI2nPfYdNX1Bw":{"text":"Brunch was a real disappointment. As a NOLA native, I just wanted to try the place for its","useful":1,"cool":0},"Acyi2kp1_EauQih7FYCywA":{"text":"When you first walking in it's too charming with the glass chandeliers and printed floral ","useful":3,"cool":3},"jY1AGN2D_9cC5ijRTBkW5g":{"text":"The food was extremely good all around. Boudin balls, trio of soups were excellent plus al","useful":1,"cool":0},"kNip73ldtxqgKIlp488MFA":{"text":"Waitress was asking everyone else it was a little stressed out because of all the business","useful":0,"cool":0},"vdWAq3DcLPK4as6QgB6cAA":{"text":"Our experience was not so great.  We were sat in a small room along with a table of about ","useful":0,"cool":0},"bRXe3-ucWj9gzvFUBOoGMw":{"text":"We had an outstanding Sunday Brunch today. The Gumbo, and Oysters En Brochette were excell","useful":0,"cool":0},"Je0SFKeS5DUTF8yO4tsBWg":{"text":"Loved taking advantage of the Coolinary New Orleans deal that they had! Tujague's is an in","useful":3,"cool":2},"SYgvJuJJApZB9c_0e8iT7g":{"text":"This was our best dining experience in New Orleans and Didier and Anthony  made a great ex","useful":2,"cool":0},"SINr9frJhQR9zT3dQvgM4g":{"text":"This place is the bomb! Amazing food, amazing service and their bottomless mimosa deal is ","useful":1,"cool":0},"2uxl5N5Gny4RCsvhLgJ6ww":{"text":"Did you know that Tujagues is the third oldest restaurant in the United States and the sec","useful":6,"cool":2},"wJeDw1ZgJ1e-t5egW0STYQ":{"text":"Tujague's and Sazeracs Saturday night! The new restaurant looks GREAT! I always feel at ho","useful":3,"cool":1},"0szwBIvTzCAZbkDTWmoaDA":{"text":"So glad I got the chance to dine here! Gorgeous restaurant, great service and delicious fo","useful":0,"cool":0},"V-ei2EAcCpa6FPF3H16-jw":{"text":"Fantastic food. The drinks are well made, the sommelier very friendly. Bartender and wait ","useful":0,"cool":0},"KF57b1jb4fFvYgqZarAAqw":{"text":"Was referred to this place by a local and it was excellent. The Prix Fix menu was great. T","useful":1,"cool":0},"IDEURf2IeTKkn20qnlqAAA":{"text":"If you come here, make sure you save yourself about 3 hours because that's how long it's g","useful":0,"cool":0},"Xkg6Yu8Cyd7Iu6u9rqm0ZA":{"text":"After passing by Tujague's hundreds of times, we finally decided to give them a try for an","useful":1,"cool":0},"XSUDuxBq030e7t9_ujqUJA":{"text":"We had our Thanksgiving dinner here with our family. Although we had reservations we were ","useful":2,"cool":0},"6grSYFf77Ca1HdPrnFzMow":{"text":"Came here on the Tastebuds food tour.  Ate red beans and rice here and it was really good.","useful":1,"cool":0},"zhXctGoIbOmv9Tf_xWYFmg":{"text":"Went for brunch with the wife.  Cool old building we sat on second floor which was very hi","useful":0,"cool":0},"wMSn0bDJyXE7mJZ0VWIKtA":{"text":"Had a very nice meal with a party of 7 tonight.  Service was very good, prompt and friendl","useful":0,"cool":0},"PcmXWQIGak0ev25NaODFPw":{"text":"My wife and I ate at Tujague's this February and it was the highlight of our trip. All the","useful":0,"cool":0},"Gm8FIuHfQ5PgXZIdADPGCA":{"text":"My husband and I just returned from New Orleans. We went to Tujague's for dinner.  \nPros: ","useful":0,"cool":0},"NvbZ-0uhdBR51IX1G_F4UQ":{"text":"Went in for drinks in the afternoon. We've eaten here before and never disappointed. The d","useful":1,"cool":0},"OMLJXVz4WUh4Zte1-JiO-w":{"text":"Staff and managers were very friendly but not very efficient. We waited about 10 minutes a","useful":0,"cool":0},"EdOggYMyKM8sqlCiKybGhw":{"text":"OK walking down the street looking for a good brunch place, we happened upon this quaint l","useful":1,"cool":0},"GRwXkgYurKoWr6Rw5M1b8A":{"text":"Overdue review. We just randomly stopped in on our annual vacation, not realizing they are","useful":1,"cool":1},"HKvdBUIjmx-YouEUucfvQg":{"text":"This restaurant was highly recommended but it was really disappointing. The crepes had som","useful":0,"cool":0},"TAE666-5qBjJSJZxZv2L3Q":{"text":"Absolutely awful Christmas Eve experience. We were there 30 minutes before anyone took our","useful":1,"cool":0},"Ta6a7hC0ASHgjm4pCxwd1w":{"text":"This was our first time dining in the new location and we met some friends for brunch. To ","useful":3,"cool":1},"uLIjbG3p6di1xfceyvFbvQ":{"text":"Tujague's is an institution in the French Quarter and though the food might not be the bes","useful":5,"cool":3},"1S_8t-txz-DFWyQAxKF7Lg":{"text":"To be fair it was christmas eve. \n\nEvery course we had was overly salty so when our soup w","useful":1,"cool":0},"d0pVjbscWOc55lLWsVNdtQ":{"text":"Thanksgiving At Tujague's\n\nI went into this adventure expecting to experience a New Orlean","useful":1,"cool":0},"DAkbeOcAEohdJAmcKl_afA":{"text":"Skip it. Decent food. LOUSY service. And over-prized.  We had a party of four adults, two ","useful":0,"cool":0},"DQ7aKki_XyO4GS8v-76eCw":{"text":"Great little restaurant open for lunch in Jackson Square. Looked at various menus in the S","useful":2,"cool":1},"dDV180nR8vtuGnn8IOT-vA":{"text":"Got a recommendation from a local during our stay in New Orleans to come here and try a sp","useful":23,"cool":20},"VCYr8KiK1DSe8p2bp17xBg":{"text":"I don't even know where to begin with this review .\nThis could have possibly been the wors","useful":2,"cool":0},"ZkCSmO075KqwNonegSjoqg":{"text":"We came in from the west coast and knowing it was a holiday, made dinner reservations more","useful":2,"cool":0},"Trdya8bIXrOwNCssFvpXHg":{"text":"Shoutout to our waitress Dess. She was amazing and fixed any problems with the food. She w","useful":0,"cool":0},"nUvEQVxODBtGwLiE99wtdg":{"text":"As others are saying, Tujague's Thanksgiving Day meal was a complete and utter fiasco. The","useful":3,"cool":0},"DzBHdp8VxClegStoGECtVg":{"text":"I'll admit, I have my favorite spots that I always hit up when I'm in NOLA. Now, I'm commi","useful":46,"cool":42},"CN1tHy1FXGB0djV7MJ32Lg":{"text":"We went to Tujague's as a large group tonight. The service was amazing and the food was gr","useful":0,"cool":0},"k2NFoOKLfnuiMfbOiqOtcw":{"text":"I can not even begin to describe the exceptional service we received from Russell (GM) and","useful":1,"cool":1},"lQJYRiklofRcQbx_0Lvlyw":{"text":"We were in the Quarter on Lundi Gras and wanted to have dinner. Steve says this place has ","useful":1,"cool":0},"NsIaA1olO76IxCrppzrVmg":{"text":"I had a pretty solid experience at Tujaque's in regards to the food, but service was sub p","useful":0,"cool":0},"8tCJgQl-nhGUm4vavXJDLQ":{"text":"Great  server, he was welcoming and friendly. He recommended the brisket  which was really","useful":0,"cool":1},"MGUzR56g9jBkVzfh2JiERQ":{"text":"I first learned about Tujaques when the food tour I was participating in took us here. The","useful":0,"cool":0},"VGFqCS8nY-rWpfJS9KaXHQ":{"text":"So this is NOLA, there is lots of great food, stiff competition, and tons of history.  So ","useful":0,"cool":0},"nug_UKSzsp8ljj4_xWYhPQ":{"text":"My favorite restaurant in New Orleans. It is the second oldest restaurant in New Orleans. ","useful":1,"cool":1},"GiWMiWP2Wbg85PCLhXlFng":{"text":"The beef po boy with the horseradish- let me tell ya. After trying a slice during a food t","useful":0,"cool":0},"EEHzvzGHT3-_-_srj5AUrA":{"text":"The cocktails are fabulous, the new space is lovely, but, what stood out, is the outstandi","useful":0,"cool":0},"xgJLBifMDbDhW-f0hyuoqg":{"text":"I wanted to love Tujague's, but maybe I ate there on an off night. The location is great, ","useful":1,"cool":0},"7jO8BwdiN1EwUvFA0cXSNA":{"text":"The food was delicious! The drinks were great and the staff was so friendly and accommodat","useful":0,"cool":0},"O9frB3MeofplW5nQSemU5Q":{"text":"I was a bit worried when I came here.  I mean when you come to a restaurant that is over 1","useful":11,"cool":8},"egAolh1pzawrVoWL-f5Siw":{"text":"A pretty standard New Orleans kind of fancy place with normal New Orleans fair. They had a","useful":1,"cool":1},"sbtHF-Q8BIUpN7EuXdrGRA":{"text":"My husband and I went for Their Revillon dinner. It was delicious. Every course was delici","useful":0,"cool":0},"RNEOEJS9-UAksQZjas_h9g":{"text":"Bravo and kudos to the wine director of this fine establishment! Wine list was quite impre","useful":0,"cool":0},"WQiBLIpSF_6hGpfbKOmsQQ":{"text":"Had dinner at the new location and I love that they were able to bring the feeling of the ","useful":0,"cool":1},"mgD3W2kNX7o8FJ5H9sMZ9Q":{"text":"Absolutely awful experience for my birthday dinner. (I had my birthday at the old location","useful":3,"cool":0},"-ujsVQXIL9N3L8-ayQfjoA":{"text":"11/24/17\n\nLook, I am sure that people have eaten unseasoned meat thousands of times more t","useful":48,"cool":37},"yAhQbYxJcDWf4eIOJin82w":{"text":"I know this place has a history, but it honestly served up my least favorite meal during m","useful":2,"cool":0},"bbQsh441HJQkkUn-4aLT4w":{"text":"Hidden gem in the French Quarter! We went for the Friday brunch and OMG it was so deliciou","useful":1,"cool":1}}