{"clxqehodxqAKkvTzaKjZTg":{"text":"For my first time going to this brow bar I was quite impressed. The first thing you notice","useful":0,"cool":0},"-Pt9pUD-nVwl0emrC7OpYA":{"text":"Absolutely love my results!! Got my brows threaded; decided to come here because my usual ","useful":1,"cool":1},"vfQr1VuCCRa6XYRBT5WC7A":{"text":"Came in the morning, drove all the way from Metairie place was packed and only 2 people wo","useful":0,"cool":0},"rg42ygNt7-ELOGXmYryRQA":{"text":"This place is a hidden gem in the Gentilly area. It is probably one of the nicest brow sal","useful":3,"cool":2},"7_IV65DXeGbW9ZyVWbrQhg":{"text":"I loved brow rituals at a point. Everyone is nice and welcoming, and the decor is very cut","useful":1,"cool":0},"tRAkrW1mUEWJma3w2T0HWQ":{"text":"Just called in asking for a really niche service (hair henna application, which they did a","useful":2,"cool":2},"vVTJwuxBGyA9ovO-7GdEAA":{"text":"Soma I paid for threading which is shaping and a tint I never bypassed the test so you dro","useful":0,"cool":0},"MpkgFJiVYW8L1-FcpXtzhw":{"text":"Don't go here \nI went here whilst I was travelling around the states for a couple of month","useful":2,"cool":0},"IPInO3hsjmwxXpMcPlGXQg":{"text":"For my first time going to this brow bar I was quite impressed. The first thing you notice","useful":3,"cool":0},"aqI_Ip3JjTGLha3J00UjFA":{"text":"They did amazing on my sister's eyebrows. Kept them thick while cleaning them up. Ask for ","useful":0,"cool":0},"fd5u-oX0nPsyEpSH-4f6cA":{"text":"Honestly everything was straight to the point. Not much conversation between myself and th","useful":0,"cool":0},"D8RXL6VOcTHHGbRAyscLRg":{"text":"This was the second appoint that I booked where I was not serviced by the person I request","useful":0,"cool":0},"BNMgTXtvf55PUJALwcfhqQ":{"text":"I was in desperate need of an eyebrow wax and short on time. Couldn't go see bae with an u","useful":3,"cool":0},"vdi60q24_FnmErpaQNYMMg":{"text":"They fucked my eyebrows up period . The lady did exactly what I told her not to do ! Made ","useful":2,"cool":0},"6LD-ZrwHeOEgnPNOifjcmA":{"text":"First and foremost, BLACK OWNED! \n\nThe place is very nice. It's tucked away in a strip off","useful":2,"cool":0},"tbVqnuuy_Ybqo7Zf5OeiOg":{"text":"Decided to try out this spot it was clean and inviting. I was a little disappointed after ","useful":5,"cool":0},"BEBApY09UTWlh0OUZnuD_w":{"text":"My second appointment went okay I guess. Wasn't busy when I went in . I was seen by Meenak","useful":0,"cool":0},"DgzK9laxXuUPNzTa7Q06QQ":{"text":"Was looking for a nice brow place, so I tried this one. Sonam made my brows look the best ","useful":0,"cool":0},"2519ofig-EldD2JBv9FosA":{"text":"Loved this place. My brows were perfect and of course I was skeptical because it was a new","useful":0,"cool":0},"5o1ERhfkoboVpomKmB1CTw":{"text":"I decided to try Brow Rituals after following them on Instagram for months...and I was sor","useful":8,"cool":1},"zEMMO_3KrnNhI32mLEhbMg":{"text":"Late, unapologetic, unprofessional and attitude sucks! Started my brows 49 minutes late wi","useful":2,"cool":0},"XdtN8cXrtypZplhTzjxguA":{"text":"I love my brows! It's a cool lil spot and they offer a lot of services. The prices are ver","useful":0,"cool":0},"nNaG47DoqhSWIQ4GpgOVxQ":{"text":"They just dont give good attention or service! I went there few days ago asking for waxing","useful":0,"cool":0},"nCYiL5Ua79bt_CAjNE9jTQ":{"text":"I scheduled an appointment for dermaplaning with Ms. Kelli. She was awesome and very detai","useful":0,"cool":0},"m-TbufFIlHJdaqrAgxfSww":{"text":"It is extremely hard to find an esthetician that consistently gives you exactly what you a","useful":0,"cool":0},"4DGQweq-LLEBFJu7ZNAMMg":{"text":"They just dont give good attention or service! I went there few days ago asking for waxing","useful":3,"cool":0},"mMKTZsAxdy6EtvoA1Ihkfg":{"text":"First time here and the ladies were hospitable. They helped me quickly and did an amazing ","useful":0,"cool":0},"COMS2mY2Y50USpoD0TIHSQ":{"text":"I went in to get my eyebrows threaded by Sonam and she really hurt me. I had red blood spo","useful":4,"cool":0},"4GrIW-ZHz6TTSoknAKk-TQ":{"text":"There is a such thing as a \"Level 1\" threader and a \"Level 2\" threader and wow... there is","useful":5,"cool":0},"G1YikI1uVBq6fRs-MQpHMA":{"text":"I started going to this place from the first week it open.  The shop is inviting and beaut","useful":0,"cool":0},"_iiaZuitEJLuZipbmFbEUQ":{"text":"I have been going to Brow Ritual now for almost a year. I have no complaints. I always get","useful":0,"cool":0},"0HM-gfvf-WtsC4j6BgGOJw":{"text":"I've been to this place twice and regretted it both times. The first time I made an appoin","useful":0,"cool":0}}