{"Hp_It_-L8mjhrx8biUco5A":{"text":"NOLA does it agin with delicious food and charm! My palate was once again satisfied. If yo","useful":0,"cool":0},"57mT21LklR70Zt2Es33KnQ":{"text":"I found this restaurant within easy walking distance of the hotel I stayed at on a recent ","useful":1,"cool":0},"xYtKpM6QZ2vin7lvz6Y0kA":{"text":"Looking for something close to my hotel. This was on the corner. Very good quality. Lamb k","useful":1,"cool":0},"CWMgNXwTy-yTpkEgVdHX8g":{"text":"This place is good and innovative!  The hummus was so delicious and I love how they put bl","useful":4,"cool":2},"Mw1t5oC7KRSoXD9zYZJnAQ":{"text":"Solid Egyptian spot in a liquor store. Had the gyro/chicken shawarma plate with salad and ","useful":2,"cool":1},"y7dpcADmZ4U5ZFSJuO2r1A":{"text":"I would like to give a personal thanks to Caroline and the staff the night of my visit. It","useful":0,"cool":0},"ZYZKaosOoV0SEaPU6D3HFQ":{"text":"Thank you Sam and Ashra for an amazing lunch. Shoutout to Sean (waiter in training)... Kee","useful":1,"cool":0},"KR1RDCO4AXSXVmsA6v5lAg":{"text":"I LOVE that this place is open 24 hours. Why? Because after I drink I get hungry and I don","useful":2,"cool":1},"jrpUc18bsNsPxB-kJzJ7zA":{"text":"Never judge from the appearance. Cleo's shares quarters with a convenience store, it's not","useful":0,"cool":0},"K--Snl8pFjcyVBDWTIjB9Q":{"text":"We came in for Tulane graduation and needed a quick bite.  A passing professor suggested C","useful":0,"cool":0},"Zvlxlb1pjnWOU6dwZtUWcw":{"text":"Exactly what you would expect from a 24/7 middle eastern kitchen/market.  The tabuli and h","useful":0,"cool":0},"NMOh2q8X93J2Zm6kxkr5TQ":{"text":"This has probably the best Mediterranean food I've ever has.  Loved the Fava bean dip and ","useful":0,"cool":0},"-TdtGdan7NvK2KlcS_p13g":{"text":"Such a rare find. Great rack of lamb seasoned perfectly and cooked to temperature in this ","useful":0,"cool":0},"a2ez2jpcbLqCVK7t4tIOCQ":{"text":"Delicious food and good Mediterranean flavors.\nHowever, the place is more like a fast dine","useful":0,"cool":0},"3ztd0vdelfY33vz4P4tUeA":{"text":"This is the kind of mom and pop operation that I love to find. All of the food is made fre","useful":0,"cool":0},"AyIHajNhKRvZLxF4QNMZDQ":{"text":"I'm from the Middle East and I've been around the US and had middle eastern food at variou","useful":2,"cool":0},"1D3IAdm-Vm03onfLsQMW2Q":{"text":"Delicious Mediterranean food, reasonable prices, & excellent service. Spicy hummus was exc","useful":1,"cool":0},"MafjVmEhpV7LnXTNnrupqg":{"text":"This place is fantastic! The food was delicious, the service fast. We got the grilled Haol","useful":2,"cool":0},"yWTjE2j86EWNak7e6_J_4w":{"text":"Don't waste your money \nThe worst place ever the most disgusting fake middle eastern food ","useful":0,"cool":0},"QhhsGpwA4uBu_v8LsQz4Tg":{"text":"Exceptional food, unique twist to Mediterranean cuisine. Hummus and vegetarian platter wer","useful":0,"cool":0},"YpHb2B33unzTAlsT8Pt-_Q":{"text":"We were looking for food in the middle of the night after a family member gave birth and w","useful":0,"cool":0},"Z8-8U6sNtS44FjWs8W0xaw":{"text":"Really good food and they're open 24/7! My SO and I came here around 2am Saturday night fo","useful":6,"cool":6},"WsVb2wzWkXG7MdVoIPMYwg":{"text":"Last night was our second time visiting Cleo's, and it was just as excellent as the first!","useful":1,"cool":0},"wWR19zVFItovarNiQPh4tw":{"text":"Updated 2016 / 6 \n\nFood is still awesome and the service is great \n\nbut the prices for the","useful":1,"cool":0},"W9S9RsAygUC6A2BAW-sz7A":{"text":"Take note people; this is how hummus is supposed to taste!\n\nBest hummus I've ever had...\n\n","useful":1,"cool":0},"bCmiKA5oq3eVsXH--88hQg":{"text":"This place is a diamond in the (very) rough. Good example of \"Don't judge a book by its co","useful":1,"cool":0},"muA9XZkhqs5Lr_kcZ0ckbA":{"text":"Fantastic food! The hummus is delicious and the presentation of the food is beautiful. Wel","useful":1,"cool":0},"xqiuEf2vX_FYiF0MfXJcxw":{"text":"Glad we found this place. It has great food and great and honest service. They had somethi","useful":0,"cool":0},"qnGnguZn3SziY1oOpnNxVA":{"text":"What a wonderful surprise. It's attached to a market so you might miss this one, but don't","useful":0,"cool":0},"W67oVWcVGLZsKRpgrLdQjg":{"text":"The food was amazing! Falafel, hummus,  grape leafs, babaganus. Everything was delicious!","useful":0,"cool":0},"8naYoUq-MDgC2OmXIPmQ9g":{"text":"A very cool fine with yummy food that is responsible price. Worth a visit. Will definitely","useful":2,"cool":0},"33zDTE_iKeGa739twKlb3g":{"text":"My friends who've visited NOLA in the past raved about Cleo's. Our über drive even comment","useful":2,"cool":2},"0H4MUErH7ghZXWo4jxNRYQ":{"text":"Great place for convenience.   They had fun drinks from all over the place.   The gyros we","useful":0,"cool":0},"9g4p7OqoYVBVnmj94jBZRQ":{"text":"Fantastic food in a grocery store. Best thing is that they are open 24 hours a day. I'm a ","useful":0,"cool":0},"XpeaMf70p8Rha6OnscyxRw":{"text":"Looking for an alternative to the the Hyatr's resturant on a long business trip, we found ","useful":1,"cool":0},"stUpgB1zNNlFanlwUcJ8xA":{"text":"Walking by it looks like a convenience store from the street, and half of the business act","useful":1,"cool":1},"ruttgKEJJGkydMscg1Vn2w":{"text":"Went in with a very large party. Everything we ordered was really good. Food came out pret","useful":0,"cool":0},"hcbaKhBZ42z3QFyKRLzX7Q":{"text":"it is not even mediterranean food , this restaurant is overrated and so pricey for not del","useful":0,"cool":0},"QNNqEum2M-pY3RtkkoOgTA":{"text":"What a great surprise! Staying at the Roosevelt and wanted something other than Southern (","useful":0,"cool":0},"_RbPtBA2X6c5SER11jVNpw":{"text":"I hadn't planned to leave a review at all for this place. The food is fine but I generally","useful":0,"cool":0},"ftme1XyP8H_ZonuS1dpvwA":{"text":"Found the restaurant by accident. At first look, it looked like a convenient mart, but we ","useful":0,"cool":0},"DjJBWwjUtFP10VE7xY9lzA":{"text":"I have been going here since it opened.  While it doesn't have the decor of a 5 star resta","useful":0,"cool":0},"u0vVOWptJERxGP3fID7YBg":{"text":"15 bucks for a plate of chicken shawarma. Not bad right? Food was made on the spot. Was ex","useful":0,"cool":0},"ugyTn1Htgt-q87ifte2WwQ":{"text":"Wow! Would you have expected beautifully prepared and seasoned Mediterranean cuisine in NO","useful":1,"cool":0},"zFy0_pxUVyhOIv7a79ZOeg":{"text":"Amazing food. Our waitress was fun and really helpful guiding us to the house specials. Ve","useful":1,"cool":0},"EfJ5QilSmEjFt-yErOJ8eg":{"text":"Was a fantastic goto (on a budget) this time around in the Big Easy. The Lamb & Hummus pla","useful":0,"cool":0},"80BGwqgJVLTnmCQ4nwmxfg":{"text":"I was here for a conference we tried other places but found Cleo's and enjoyed my meal for","useful":2,"cool":0},"kYXKifddqOKAvnsad5MCXg":{"text":"By far the best restaurant I've visited on my trip to New Orleans. I found this place than","useful":0,"cool":0},"lTXrT85ckbie5HmW8Asb-A":{"text":"Damn that was good. Spinach pie and falafel app. Employees are nice.","useful":1,"cool":0},"jqZMfTTAs3d3MzF-1TdOsw":{"text":"This is a joke. $7 for a gyro, .50¢ to add raw onions, and $1 to add a sprinkle of feta. A","useful":0,"cool":0},"U3JAXO2V8p845-x_AnIaSw":{"text":"Went there for a quick bite. Ordered beef lula kebab. It was very tasty. Stuffs are really","useful":0,"cool":0},"rOKrYPxr9GxVhmGa0jQLMw":{"text":"I'm so grateful for this place. There's not much in the way of diversity when it comes to ","useful":0,"cool":0},"cZt3Yei7b53AEhmJHsYCmg":{"text":"Nola cuisine is amazing but if you want something different you must come here!! We had th","useful":1,"cool":0},"tZZMMA3lKRGxJB3iaJGWyg":{"text":"A surprise find late at night and couldn't be happier!  The food was fantastic and a very ","useful":0,"cool":0},"NMoOvdVNSArJi23VwdYV2g":{"text":"Stopped here for supper It was quite late and I was happy to see the place was still open.","useful":0,"cool":0},"bds0i7XkZyVyZD98OnA4jw":{"text":"Don't let the convenience store vibes discourage you.  The food here is excellent.  Prices","useful":2,"cool":0},"iUnt7FH4XK-ovkIEqtcb4g":{"text":"I love this place. The set-up Is weird as hell but the food is great and all the staff are","useful":4,"cool":3},"zemtrE6l_Qfm9JvcT8R7BA":{"text":"Delicious authentic food. Large menu to choose from. Reasonable price.  Service is fast an","useful":0,"cool":0},"X9X4899mrgPwfFuOWtj1nw":{"text":"So good! Yes, it's a little weird that the restaurant is in a convenience store but this i","useful":1,"cool":0},"edloeqLcs0cmeQ_QiaOkCA":{"text":"If you are looking for tasty fare available day or night, this is a great place. It is per","useful":0,"cool":0},"qYAAOuYxDPZIjqQ7Zn976g":{"text":"I used to love this place because it's open 24/7. Some of their items I've had better, but","useful":0,"cool":0},"Jt9A-BJpgbuWXJysNzHo0Q":{"text":"What happened to my gf and I is almost unbelievable. While we were waiting for our food a ","useful":1,"cool":0},"BdL12P6gX0E8IZKPNFQH3g":{"text":"Great little dive. Decent prices, decent portions and excellent beverage selection. I reco","useful":0,"cool":0},"kcAn9HdGtogPll3noDYXxA":{"text":"Don't miss this little secret.  Beautiful food. Good service. No frills but who needs fril","useful":1,"cool":0},"kY8Z3xPQL-My1c6PO4dlxg":{"text":"My wife and I had the hummus (superb), falafel (on par with the best I've had), gyro wrap ","useful":0,"cool":0},"Q2eMUMJCf2BuH1801sy6Bw":{"text":"Best Mediterranean food I ever tasted!! We got the fried eggplant (not fried with breading","useful":1,"cool":0},"IbZPA2liN0YaAc8Fp1UuJw":{"text":"I really want to like Cleo's. Middle Eastern food is rare in New Orleans and they get majo","useful":0,"cool":0},"NJPqvOn03mNIcgGzRGr2Aw":{"text":"I came here with a group of 7 and they arranged the tables for us and gave us menus. We al","useful":0,"cool":0},"UhXBwAUgK7OO0P8KIio27Q":{"text":"The place was packed with what seemed to be regulars, drawn by the reasonable prices (can ","useful":3,"cool":0},"NBU7jLAQsK32WKXIY940Yw":{"text":"Phenomenal meal before a show at the Saenger. My husband had the chicken wrap and said it ","useful":0,"cool":0},"-mU3Uov5Az8Ja9PfAb5qYQ":{"text":"This spot is really unusual.  Amazing food in an odd spot.  A local suggested this restaur","useful":2,"cool":0},"psSxB_XgNYYXvZhF3wlVBw":{"text":"Nice cook and owner. We talked to both for quite a while, which made for a very friendly s","useful":0,"cool":0},"GVLEdZUCJOYnPDvFlGl90Q":{"text":"Back again this month.  Still loving this place!  I'm surprised by the variety in the litt","useful":1,"cool":0},"IH6RQcqvsXzqEGqxc3tDWA":{"text":"Staying at the Jung hotel and this place was right down the street. The food is fresh and ","useful":0,"cool":0},"S9SIdyVB70XWy2h52gKxQg":{"text":"This place moved a block away to the riverside/uptown corner on Canal St. Still also a gro","useful":0,"cool":0},"3RJVRoIhxW2_qi6dJG7zqw":{"text":"Hidden Gem! Incredible food, great staff and truly authentic Mediterranean cuisine! We wil","useful":0,"cool":0},"ZuxXq5JCDSKyzulWQ_vgVw":{"text":"After reading good reviews here on yelp, i decided to check this place out. I have eaten m","useful":0,"cool":0},"P0hASftSc7lwS-dR5slKXg":{"text":"Great food, good vegetarian options. Highly recommended! Right on canal street. I'll come ","useful":0,"cool":0},"WOGj1TE4rY3pGthCzE6WrQ":{"text":"Had the grilled shrimp plate and it was delicious! Ashraf the chef is phenomenal... loved ","useful":0,"cool":0},"HV4gnfPuqK8zW4yaUeQkKg":{"text":"Earned top rating due to fresh tasting high quality dishes. Do not let the convenient stor","useful":1,"cool":0},"7_DD-aiqYLSLJqNPbqTV8w":{"text":"Amazing little place. Best food that I've had in New Orleans. Fresh and inexpensive- I wil","useful":0,"cool":0},"jbwuuOls1uvAfvPflGDfsQ":{"text":"One word: Authentic.\n\nHere are a few more words: quick, tasty, friendly, comforting, filli","useful":3,"cool":1},"IEv9YTDC-375gUOrYMK7xA":{"text":"Terrible service, I came here to have a quite meal, instead my conversation with my compan","useful":1,"cool":0},"XO-fG4KC3e8z65JOpIqZXQ":{"text":"Been there in December 2013. Awesome food available 24/7 * 365. What else do you need? In ","useful":1,"cool":0},"p19zqAkmG0XPMeajduPXtw":{"text":"Sucks actually. Staffers pretend they don't know what you are here for and ask questions p","useful":0,"cool":0},"Lu7kRsu_vXX0sVS-HoYdQQ":{"text":"This place is so fun! There is every kind of snack food and beverage and chocolate bar you","useful":0,"cool":0},"6ntcBQ_bZvFjCazYDkz8Gg":{"text":"Quick, flavorful, and a boatload of food for the money.  Definitely worth a stop.","useful":0,"cool":0},"b45Nse8Oakb1IOrNXyT9Dg":{"text":"Great little restaurant within a corner store. I stopped by here for a quick lunch and was","useful":2,"cool":0},"-RhBODN7J_mxxpx4FMtnsg":{"text":"The only reason I didn't give this place 5 stars is because the wait is longer than I expe","useful":0,"cool":1},"D1LM8OR-OowMj-u2QymIEA":{"text":"We were visiting from out of town and looking for a good late night delivery spot. Cleos n","useful":0,"cool":0},"jjps8A4R_8k5ObdEKCLAhg":{"text":"My husband and I arrived in new Orleans en route to Mexico, we happened on Cleo's by pure ","useful":1,"cool":0},"q-3atM70l2fDjLtuHsj6oQ":{"text":"Excellent food! Price is fair and the quality is excellent. Get the Rack of Lamb. Very goo","useful":0,"cool":0},"Jc6hcZ-4me2-DnEAQnRiOw":{"text":"Recommended from coworkers. The magic phase was, \"it looks sketchy on the outside but the ","useful":1,"cool":0},"Gd2uhErlj8CzVAlOM4752w":{"text":"We are visiting New Orleans from L.A. and have had our fair share of good Mediterranean fo","useful":1,"cool":0},"UeGAeXQOuyPnbGGJfDhAKw":{"text":"Everything is great except for the poor ventilation of the kitchen. Definitely order ahead","useful":0,"cool":0},"xVwZa6HGqxwYngJgS7F50g":{"text":"Probably best Middle Eastern in New Orleans. The falafel and Schwarma are awesome.","useful":2,"cool":0},"i94HXhStrqJges2eP7NhhQ":{"text":"Surprisingly excellent food hiding in this little convenience store. Try the chicken schwa","useful":1,"cool":0},"83g9lKPMmXU5PD8BNJoD5g":{"text":"I seldom write reviews, but this is really really really good!! We had the shrimp plate, l","useful":1,"cool":0},"LE88RxYC-TSodaKDiVMKrg":{"text":"Cleo's was our choice for home away from home (California natives, in need of something fa","useful":1,"cool":0},"gsr1A1hb-NCOCCkTlZcdXw":{"text":"Great food! Very vegetarian friendly. The fried eggplant dish was great. The people going ","useful":0,"cool":0},"bplVZ4wXknpzTZrbOewdMA":{"text":"We arrived pretty late into town and surprisingly, there aren't too many restaurants opene","useful":2,"cool":1},"jJaiQ3Q3XlZSSH2oFt67kQ":{"text":"Yo I'm from manhattan & can admit I do love my drunken halal guys, but this is on a whole ","useful":1,"cool":2},"b46DI2LarSOg85pFel4rZQ":{"text":"Their menu is nice, chicken kabab sandy is great, but grocery and snack items are way over","useful":0,"cool":0},"qkEz8RlfCT20C5LnQr5mIg":{"text":"This little cafe is clean has excellent service. It is open late, and has excellent option","useful":3,"cool":0},"dQjQGPYaAmKtkFtlmxSyaQ":{"text":"Had the shrimp plate with veggies. Not an abundant serving but the food was very good. The","useful":0,"cool":0},"xoA7wnmotXYMEQuKi2wMwQ":{"text":"Searching for something fresh and green, Cleo's was just what we needed!  Brandon was so v","useful":0,"cool":0},"9rCf7uAW3sYXMIvaljZdrg":{"text":"If you walk into unassuming convenience store one block off of Canal St. you will be pleas","useful":0,"cool":0},"xRXZEk5JofxGtsUCZ5sfCg":{"text":"Hummus was delicious greek salad not so much.The salad dressing was so watery I'm thinking","useful":0,"cool":0},"SSgZ-dpctAc-gsth_fIqgA":{"text":"EXCELLENT FOOD! Highly recommended. We ordered the vegetarian plate and two of us split it","useful":0,"cool":0},"7m43qE4AAJYTpCo_Zk-08A":{"text":"In so glad we came here for lunch on our trip. We enjoyed our meals and the meat was cooke","useful":0,"cool":0},"LE96nNYOVBhgsXzlWTlhWw":{"text":"Wow! Absolutely terrific Mediterranean food. Beef shwarma, gyro and falafel players were a","useful":0,"cool":0},"1AaWVWiDY9mj5GgRxJFzEQ":{"text":"The restaurant has a convenient store attached to it so it can be a little weird experienc","useful":0,"cool":0},"Hn0mCRns-j6u-3GIJ5GOzA":{"text":"This was my first time trying Mediterranean food and it was delicious. I had the chicken s","useful":0,"cool":0},"MGakML6j9LZ7A4Eqqw8QnA":{"text":"I really love Mediterranean food. So, when I landed at New Orleans airport, the first thin","useful":0,"cool":0},"YbpUv8Wog1lfYkXdUoAoBw":{"text":"Exactly as promised!!  Great Mediterranean food in a convenience store!\n\nIt was extremely ","useful":0,"cool":0},"jURhNW5UIyV3S9Fz-0JOrg":{"text":"I think this is one of the best Mediterranian food I had in New Orleans. The food is delic","useful":0,"cool":0},"orMerycwJjXfqsqyJxSxVQ":{"text":"Considering it's the highest rated 24 hour place in the French Quarter, it's definitely a ","useful":0,"cool":0},"z9h1q-B2S9-3mLr-pRRTFg":{"text":"they have the flake!! the candy bar!\nthe gyro plate with rice was incredible\n\nThis is a gr","useful":0,"cool":0},"ptcOVBNNhBDkIgNJHLpKEw":{"text":"This is hands down the best middle eastern food I have had anywhere in the USA. I have tri","useful":2,"cool":0},"l8eUXFeUBACkMh84Q5yOTw":{"text":"for a Mediterranean and Middle Eastern take-out they are 4 star.\nthe food is delicious and","useful":0,"cool":0},"TiGNkAO8Ktc-FmBl6wTLEQ":{"text":"Just a note for folks on the Mediterranean Diet, or Always Hungry Diet, you'll have yummy ","useful":2,"cool":2},"e88kVSN5Pxhvt9ifvICfYQ":{"text":"This place is an awesome surprise.  Was in town solo for work and had some apprehension ba","useful":0,"cool":0},"EqqkgCrgZKCgqEgXGjrOFg":{"text":"Come here now and then, and it's like Cheers (where everyone knows your name), only with M","useful":1,"cool":0},"chGZiBmp6jesGKf2uUhEOQ":{"text":"Good food. Nice staff.  Away from the chaos that is Bourbon, which is good.","useful":1,"cool":0},"fjDmgJqlEDX7QTLbhTQsYA":{"text":"Went there at like 4am. Got the mezze platter appetizer, falafel platter and gyro salad. I","useful":0,"cool":0},"w73yNFuPUefF_I6Bx1rs3A":{"text":"Omg. This place is amazing and a great deal. I ate here 3 times in the span of 2 days. I r","useful":0,"cool":0},"e2WYteQ1Skbv8gAM9_tLKQ":{"text":"Quality for the food was very good. I had the gyro which was pretty filling for its size. ","useful":0,"cool":0},"xDxXHT-ggqsiux78ZYy_Hw":{"text":"This place is well worth it. The falafel was amazing! And something that I needed when sur","useful":0,"cool":0},"rRzvd_sFMV54CG3wsp74HQ":{"text":"One of the best falafel, hummus, and tabbouleh salad I've had! Everything was served quick","useful":0,"cool":0},"V8T0WSoAa_xnHPoAUzjIwA":{"text":"Loved this hole in the wall or should I say ... in the bodega. This small restaurant is a ","useful":0,"cool":0},"JDqp7owOWIpniA-EIL0YOQ":{"text":"A friend and I went here off of her recommendation after work. The city was busy and I was","useful":1,"cool":0},"kQZ0B3KiFMFe7IdUHpEbKg":{"text":"I stumbled across this place just as I'd been craving a good kabob and it did not disappoi","useful":0,"cool":0},"9cVC7gr_S2yiqqGpAF-oZQ":{"text":"Amazing place and open 24 hours for those who are traveling and tired of eating tons of sa","useful":0,"cool":0},"s9AtipF9XvFFXFFuLQEi5g":{"text":"Delicious food, spicy hummus, great service, and it's 24/7- what more could you ask for? T","useful":0,"cool":0},"UkhJF9i5ZQM2OZgw4G5j1w":{"text":"open 24 hours! i ate here about 8 times over a 2 week period on a work trip. the beef shis","useful":2,"cool":0},"_hEbNFiaXQNM8Sm_l-IU-A":{"text":"In for a conference, glad I wandered down to find this hole in the wall restaurant with wh","useful":1,"cool":0},"tGbb--TWCLZwJBzMWHT2Lw":{"text":"Don't believe the hype. Mona's is so much better. Food was overlooked and greasy and we we","useful":2,"cool":1},"KR3U0M9SwUStrhD0aB3J7g":{"text":"This place is located in a convenience store, but do not let that be deceiving. The food i","useful":0,"cool":0},"WBtsT9t69dU7tfmrR9t3Dw":{"text":"Expensive food with very little protein. Even their soft drinks are priced to hurt. I am o","useful":0,"cool":0},"4gUy0K44wxgOgYtf04dSQA":{"text":"I thought this place was average, especially for the price and atmosphere. I live in FL an","useful":0,"cool":0},"Utk9JjQUbVU1DaYWRNmpGg":{"text":"In town for vacation.\n\nWe ordered a Chicken Kabob plate with salad and hummus with pita br","useful":0,"cool":0},"uhFlgbIZOo4bMHDEzWVpqA":{"text":"Wow, excellent middle eastern food. Fresh and delicious. We shared the Mezze Platter. The ","useful":0,"cool":0},"GnYr_63546LgtzuuZQkXKg":{"text":"The nice owners of this place asked me to write a review - I was like \"everyone already th","useful":2,"cool":0},"ss-YKtWgipq_NNP-vviNJw":{"text":"Food was uncooked. It was served cold. The Shawarma was probably rotten. Highly advise to ","useful":0,"cool":0},"VDsofPIqEEg3U3qfJ7FDOg":{"text":"My experience here was amazing! Everyone here was very friendly and helpful!! Sam was more","useful":0,"cool":0},"jErQyPKU1z9H422rc7_VOw":{"text":"Ok my friend and I went to the Orpheum Theater and found this little gem next door. EVERYT","useful":2,"cool":1},"Sy7x7p62yYTOiiQDGBZbDw":{"text":"I crave this place.  Their lentil soup is the best I've had.  The salad isn't cheap icebur","useful":7,"cool":2},"iws6qyUwTc38lZXGmZclJw":{"text":"Best meal we've have had since we got to NOLA! Sooooooo yummy! Everything was cooked to or","useful":1,"cool":1},"29lLOJzNKUqpie1LxxEJjw":{"text":"OMG!!!!! This place is the best!!!! Fresh vegetables, rich flavor and good service. LOVE L","useful":0,"cool":0},"P13jiprKp5aqvdmWk8c4tQ":{"text":"Food was delicious. I took off one star because the service was bad. Man who took our orde","useful":0,"cool":0},"lUOp0ky4YJ_4Vp2Ahz9qKg":{"text":"After a few days of seeing the same food on every menu, this place was a refreshing break ","useful":1,"cool":0},"OtN2TU78Gec2OEUkB3toVg":{"text":"Quick service, although the \"waiter\" seemed a bit impatient, but it seems like that is jus","useful":0,"cool":0},"sa-D-mziPS0wbYX6h00kqA":{"text":"Not gonna win any awards for ambiance, but the staff was nice and the food was good, much ","useful":1,"cool":1},"tNlJzO9mVyTrSmOehpxcgA":{"text":"This place is a gem. The food is so good that it makes you literally want to cry tears of ","useful":1,"cool":1},"5AxQv5KKgnND_-dtk1GWcg":{"text":"Simply the best in NOLA:)\nThe rack of lamb was scrumptious, the salad fresh, and the hummu","useful":0,"cool":0},"VP_Xi6X0OM1Hx67IBYA6YQ":{"text":"It's inside a convenience store so a lil easy to miss. I hate leaving So So reviews but th","useful":0,"cool":0},"IUTgV3eX4oCb3ThiHcrqxQ":{"text":"Yelp let me down on this one!  I had chicken teeka, and my hubby had a different chicken d","useful":0,"cool":0},"IT7LFtGQoXanbtM-3P73fA":{"text":"Great full menu of Mediterranean options.  The waiter, Sam, is always really attentive.","useful":1,"cool":0},"p6qxgw34Vfy_KIR0nEtftg":{"text":"Awesome Mediterranean food, good pace for vegan n options and they're open super late. The","useful":1,"cool":0},"zTxB0J1kTJUs1o7My6-ATw":{"text":"I cannot say enough about this place. It is a Mediteranean cafe inside of a convenience st","useful":2,"cool":1},"42xbYAu1WE6GIiTDOMSLiw":{"text":"Stumbled upon this restaurant about two months ago and I now refer to it as \"my spot\" as I","useful":1,"cool":0},"H11uVfW9ps_wgpzZMMHMEA":{"text":"This is hands down the best Mediterranean restaurant in New Orleans outside of Shaya (and ","useful":1,"cool":0},"OSwZnvgWbVgrJUMBta-JbA":{"text":"Awesome dinner here! Had the shawarma combo, with hummus and pita. Hummus was outstanding-","useful":0,"cool":0},"-IlgkompSiyGspLeQVEy_A":{"text":"Freshest tabbouleh, delicious falafel, great hummus and tazticki.  Super friendly. Definit","useful":0,"cool":0},"fMpW7ypB2nex6ZJZ7vij5A":{"text":"Though the tabbouleh was a little tough for my taste, the foul madamas more than made up f","useful":0,"cool":0},"M_hMNTwMhAOi-f5AsLYbbg":{"text":"AMAZING!!!!!!  Just loved eating here.  Yes, it is in a convenient store but the dining ar","useful":1,"cool":0},"wHcuenijySNKQWo_5yBjHQ":{"text":"Best greek food I've ever had!  Any visit to New Orleans is incomplete without coming here","useful":3,"cool":0},"OKLJVIpq1c_zm02ElAgMPA":{"text":"Went with a friend some staff nice except the gentlman running the joint with the glass no","useful":0,"cool":0},"jiLQsFkm6bbWT1MW_64Ssw":{"text":"I've sure been trying to find a decent Mediterranean restaurant (let's just say \"Middle Ea","useful":2,"cool":1},"nqkV_yWadrms62pMY7k4Ig":{"text":"Decent food. What really rocks is that they are open 24h. Even though Nola is a 24-hour ci","useful":1,"cool":0},"j5Y8mv9-zEQgkgeJ12EZ0Q":{"text":"This place is awesome! The staff is INCREDIBLY friendly and helpful, and the food is beaut","useful":0,"cool":0},"uU2yB-z9oyBqY5A047GkXA":{"text":"Needed a quick bite and this had great reviews. The exterior threw me off because it looke","useful":1,"cool":0},"SWFcEXt5ADvjdHkDIQUi_g":{"text":"Cleo's is the blade! I eat here at least once a week. The guys there are real cool people.","useful":0,"cool":0},"2hvjG3Aj4VHmrv-n8RnFMA":{"text":"Only restaurant we went to twice during our week in New Orleans. The mashed Fava beans and","useful":0,"cool":0},"kg0QCCNUPHi6yrL-Itg-dA":{"text":"Was visiting NOLA from California and we needed something low on the grease. We stopped in","useful":1,"cool":0},"gNCvrc7EUtTrF6IpYk619g":{"text":"This is some of the most incredible Mediterranean cuisine I've ever had. It's in totally u","useful":0,"cool":0},"PnqXUL67FOR2IcC_lmqDfg":{"text":"Food is tasty.  I got grilled shrimp and veggies and lamb chop over rice. Lamb chop is goo","useful":0,"cool":0},"VHucQ7x8lUFwwzTef3RRoQ":{"text":"This place is living on former glory, On a recent visit it was obvious from the first bite","useful":0,"cool":0},"vlulNr73Vk6yc7nN1R3r2g":{"text":"Nice little market/restaurant. Food was tasty and the guy who runs it is extremely warm an","useful":0,"cool":0},"KKklJ6a2dweUjUI4Xkz--w":{"text":"A \"Foodie Gem of a Place\"! \n\nRead other posts before trying lunch at this location.  It is","useful":2,"cool":0},"y__kBslYroP13c3U-sDMwQ":{"text":"Food was very good , but it is more of a sandwich type restaurant. I would go again but wa","useful":0,"cool":0},"1cE_1O097vgttJGW8y_h9w":{"text":"In the typical New Orleans tradition of great things being found in unlikely places, this ","useful":1,"cool":0},"JKg713UxEowgsuicKWF_vA":{"text":"This place is in a convenience store, but don't let that fool you. The food is really good","useful":0,"cool":0},"kJVYW5Ixp8ARbQGvoGFNDw":{"text":"Excellent food, excellent service, and they bring the true culture of the Mediterranean to","useful":0,"cool":0},"gm7JxRGDWxjkcpVt18iJjA":{"text":"Food is delecious and 3 stars are for food.\n\nthey have bad customer service. The person wh","useful":1,"cool":0},"RF7ma45Dsbpyrv_WUe3C8g":{"text":"tarek,thanks for healthy fresh food,I will most definitely become a familiar face & eat he","useful":0,"cool":0},"uoT7uEOdlzKRyG5liTMu_Q":{"text":"The food was awful and they refused to provide me with water even after I paid full price ","useful":0,"cool":0},"yROS3-AnH7IdllDse7ak9w":{"text":"Hands down the best hummus I've ever had.  Salad dressing as well, it is light, yet full o","useful":1,"cool":0},"uScUCSCU0864vzDXFThKCA":{"text":"I really enjoyed my food good service the produce was fresh. I felt like licking my plate ","useful":0,"cool":0},"fbx5CNq0NwmYfgVRFCDfMQ":{"text":"Decided to try this place because of the high reviews. The dining area is in a convenient ","useful":0,"cool":0},"qhahfY1d8MZZOUguWGKzKw":{"text":"I've been coming to Cleo's on and off for a few years.  While I was initially very excited","useful":1,"cool":1},"iVq9_vmf-Mts8ZaFnxEe-w":{"text":"Literally the best falafel I've ever had in my entire life. The staff is sooooo nice and h","useful":2,"cool":0},"EUoVCgHzzyTJj5A0KNS6WQ":{"text":"Loved the food, but not the people. \n\nWent here a couple times in a single weekend because","useful":0,"cool":0},"L5zaqcEaJTxPXjaqD30pGg":{"text":"Reasonable pricing. Vegetarian friendly. Personable staff. Tasty falafel!! Open late and c","useful":0,"cool":0},"Hjx6XkxWfnQG-GHkiEqCKg":{"text":"Phone is busy, cannot place a takeout order. Poor customer service. Wouldn't recommended g","useful":0,"cool":0},"5Qrv7rVrOJncjXwITgxQrQ":{"text":"Stopped in upon recommendation of our Uber driver at 3am. GET THE FALAFEL! Don't get me wr","useful":1,"cool":0},"4BglpOvPRJtlgHv1UG7a6Q":{"text":"Visiting from St. Louis and found this gem on Yelp. Just going to second what most people ","useful":0,"cool":0},"upUcwPkQlcf9htP1HVPWOw":{"text":"Hummus was great.Best i have ever had. Gyros were good and friendly service.Sam was our se","useful":0,"cool":0},"FDt9GSWkROHEmKQjosE84g":{"text":"Went in here to kill time and grab a bite before a concert at the Orpheum and was pleasant","useful":0,"cool":0},"oP371Inzn1QDdsmRW2koAQ":{"text":"Very nice, fresh meal.  Don't let the convenience store facade fool you.  \nThis is now a s","useful":0,"cool":0},"0kTsg9Hx04e1ftlESMQMhg":{"text":"A little pricy for Mediterranean but it's hard to find some vegetables around NOLA. Good p","useful":0,"cool":0},"gjHKxEyDMnmFMTGCryJPHQ":{"text":"First night in NOLA and decided to stop in for a late night dinner. The waiter was so frie","useful":0,"cool":0},"OMAlVRzXbLhd2TNHvgOI4Q":{"text":"Awesome food \nGreat service\nClean\n24/7 \nWhat more can i ask ??\n\nYeah almost forgot order t","useful":0,"cool":0},"GMMJzSmQuApbfkmftrggfg":{"text":"Best falafel in NOLA. Shwarma is pretty good too. Open 24/7.","useful":1,"cool":0},"0GcAcjsJhYmqBKBrW1Ag-Q":{"text":"I got the chicken schwarma and gyro combo plate. Everything was delicious. The humus was s","useful":0,"cool":0},"QbzFjf_r7iGvD3Y3JjEvAg":{"text":"Don't judge a book by its cover. Looks like a corner store but this is some of the best Gy","useful":0,"cool":0},"bTycP0NAuKWMA3FMAa71KQ":{"text":"I tried the Kudsia during my first visit at Cleo's (when I wasn't even hungry because I ha","useful":3,"cool":1},"rUy6OoOEIlX6xOfxrZSIzA":{"text":"I love local dives, and Cleo's hits the mark. This little gem in the heart of Creole count","useful":0,"cool":0},"_zS3yO-FJlJ0b3_vYLX3DQ":{"text":"I crave this place.  Their lentil soup is the best I've had.  The salad isn't cheap icebur","useful":3,"cool":1},"_3aVyOoADQgCpSelm8FSJw":{"text":"Absolutely a hidden gem! First  all the reviews where right so I have to say it as well. A","useful":2,"cool":0},"vvBY-YYO_4VDp4Wb0KT48w":{"text":"After 2 days of rich southern  food, we were looking for something simple, light, friendly","useful":0,"cool":0},"r0LWJpFP9ofsotJUgX1U3A":{"text":"It is a really good place to buy from their grocery or to eat from their restaurant. I tri","useful":1,"cool":0},"UuTh70oeDHe91I7UKUhbPw":{"text":"I ordered take out from Cleo tonight because of it's proximity to my hotel. The eclectic s","useful":3,"cool":0},"f3eWXETf13daG7L9uwrOYA":{"text":"Food was very good, Mediterranean eggplant was amazing, lamb shawarma was good, wish hummu","useful":1,"cool":0},"LXB2b-12yKn0j90J4Keo0g":{"text":"I have been a few time and never disappointing, I really love everything I have had there,","useful":0,"cool":0},"eTyAVehQPkBNjaZJYZfLFA":{"text":"it's great that it's open 24 hours... food is pretty good! the mezze platter is delicious ","useful":0,"cool":0},"REZOK7HVk9gt-7kSm-7TFw":{"text":"The manager was rude. I bought coffee to wait for a cab. This Ass tells me that if you don","useful":1,"cool":0},"uj-G_Flmr7KOCd88Uu69Yw":{"text":"Was here today and although this place has moved to a new location down the same street an","useful":0,"cool":0},"t5pVEgal8pDmDz8SBvsJhg":{"text":"I've never given a bad review in my life...however I feel obligated to give one here in ho","useful":0,"cool":0},"22UQm7MhZPC3vA-Og_eovw":{"text":"We came here as a tourist from AZ, got the best Mediterranean food in NOLA! Highly recomme","useful":0,"cool":0},"79ggG16p-U2OqKqGW5Qt-A":{"text":"Absolutely LOVE the food here. I don't even like hummus but the hummus here is amazing alo","useful":0,"cool":0},"Iv_hJMwH5Ccphjqv-Ay3KA":{"text":"It is a good thing this restaurant is in a neighborhood that I do not have the chance to v","useful":14,"cool":13},"MS-M82X60JYWQP2NQmIp3Q":{"text":"Went here yesterday for a quick lunch and was blown away. Every great thing that has ever ","useful":2,"cool":1},"u42p9-kM5bG5af5iVSpE0Q":{"text":"I am happy to report, fellow yelpers, 5 stars. I'm getting tired of wasting money on bland","useful":0,"cool":0},"_52eUl84pRU0wrz55A-qPg":{"text":"I love middle eastern cuisine and while the decor is very utilitarian the food is ecellent","useful":0,"cool":0},"w7bsh1c5FHLC2yja4frE2g":{"text":"GREAT Healthy food, great service, amazing prices!  The perfect place to eat for my month ","useful":0,"cool":0},"szE9GBDsxLGbRfxLKNj2sQ":{"text":"My girlfriend and I were looking for a spot which was open late and saw the amazing review","useful":0,"cool":0},"KwRwziTyKg7Tp45oD6lYBA":{"text":"Amazing kebabs, had the combination chicken, beef, and lamb.  Hummus was delicious, especi","useful":0,"cool":0},"Zg9BHe2UOr5SPYbFPPUxOw":{"text":"Very good food in the most unconventional of all places!  It is located on the corner of  ","useful":1,"cool":0},"Ze_jtfiQIX0uZB06VIkxCQ":{"text":"I know I'm supposed to be eating Cajun/Creole food while in New Orleans but I just wanted ","useful":0,"cool":0},"yNT3ISfbKY1XCGbYNVdn_A":{"text":"On a recent business trip to New Orleans, I worked an erratic schedule that meant I rarely","useful":0,"cool":0},"drpy5PNFlEjHdoiEL8LREA":{"text":"Solid 4 stars! Get the hummus it's awesome! One of the best to me. Got combo kabobs and ch","useful":1,"cool":1},"Pgao8uWWQc_Tc9biymXctQ":{"text":"Absolutely amazing little dive. A couple of friends and I were slaughtered after a night o","useful":1,"cool":0},"PxtMXU1z5zLuQ5BcVy_8ow":{"text":"Great, awesome, has everything, open all night. They were there for us when we needed them","useful":1,"cool":0},"KukN82sG_FcTxVdpyCjnow":{"text":"Chicken shawarma , but kind of pricey for the atmosphere of Cleo's. I understand it that t","useful":0,"cool":0},"CNApC1WmWUrsfXaRJGf7oA":{"text":"The food is amazing. Tons of flavor and portion size isn't too bad; however both times I w","useful":0,"cool":0},"aPFgs4FvHEF4SD81txmrxg":{"text":"The restaurant is part of a grocery shop and it looks like just a fast food or for takeawa","useful":1,"cool":0},"I7tP31hlQeB79EOw1yPNJw":{"text":"Good service, great food, friendly staff. I eat here twice or thrice a week. Highly recomm","useful":2,"cool":0},"mEg3vAS342qYo0RmOvTZPQ":{"text":"Was recommended by a friend to come here to meet my Mediterranean cravings... \nWas kind of","useful":1,"cool":0},"R1ylUlq15DN-zRZyCoBMBg":{"text":"Just had lunch here and it was outstanding. I got the chicken shwarma with the rice and hu","useful":0,"cool":0},"lhs0PzpV4OFpgrSdA_hTCQ":{"text":"Rancid oil used to fry the falafels. Had to throw out my sandwich after one bite and get l","useful":1,"cool":0},"_Rsau0B-5MX-iW-Mbkn5-w":{"text":"Wow, terrific. I love Mediterranean and this place was very good. Not a formal dining plac","useful":1,"cool":0},"SRqySgRx8w6VYa1iWUIsLg":{"text":"We ate here last night for the first time. As noted before, this is an eat-in restaurant l","useful":0,"cool":0},"YYAgJqIqmkVxai8l03lsNA":{"text":"Everything here is made to order and FRESH! Mediterranean cuisine is getting easier to com","useful":1,"cool":0},"zdVBBXUUT4kCtACjXXuP9A":{"text":"Yummy! Enjoyed the grilled veggies & rice as well as gyro plate.  Everything was done to p","useful":0,"cool":0},"ZcsbYd_X6o7gdU37oPHTgQ":{"text":"Delicious!  Came here because of the Yelp rating and was not disappointed.  Great food, pe","useful":0,"cool":0},"63CniJuSVaktPB2moIXTgg":{"text":"Great mediterranean option not far from the main scene. Vegetarian platter was delicious. ","useful":0,"cool":0},"sHJSn9JiqnBFeJcppINg7A":{"text":"Five years later and a new location and I am pretty sure this the best food in the city of","useful":19,"cool":13},"8ctoXKefuEjuJ_fTLJzZeQ":{"text":"This place is very good. I had the best baba ganoush and humus I ever had. The place doesn","useful":0,"cool":0},"t77w220l9p4ELXpHyoJObw":{"text":"Nice lunch spot in the CBD.  Reasonable prices and good service. \nThe beef swarma wrap is ","useful":0,"cool":0},"Xzs-ztcU2WQ3qgQ6N6fxFg":{"text":"Hands down the best Mediterranean food I've had the pleasure of eating. The restaurant is ","useful":0,"cool":0},"-AuFXP7XotXatJyVRWIzvw":{"text":"Super good Mediterranean food! Lots of choices on the menu but chicken schwarma is my favo","useful":0,"cool":0},"3uh7KFSp_YFB3hCJME5v-w":{"text":"After days of eating fried everything here in NOLA, I was longing for something that remin","useful":2,"cool":0},"9df0uXm8OGVbLwmECNdrxw":{"text":"This is a hole in the wall. A store masquerading as a cafe. They still don't have a liquor","useful":0,"cool":0},"j1d8Os2iEcyCjl3uxXbABw":{"text":"Fantastic little place with truly authentic cuisine!  I had the beef shawarma platter with","useful":0,"cool":0},"9fCaoniSBiFSpxcEx-UH5g":{"text":"A little cautious going in at 12am and being from out of town, but THE BEST CHICKEN SHAWAR","useful":0,"cool":0},"Km3kd6uxkL3Hfikn8M78JQ":{"text":"We had the labneh for appetizer,  chicken shawarmas for entree and baklava for dessert. It","useful":0,"cool":0},"IKnAzKgy-Oyt_acjm9Ax0g":{"text":"Tasty food, nice place! Looks like they use only  high quality ingredients. Super healthy","useful":1,"cool":0},"29TmXol5Lb23uvnmHTMoMw":{"text":"Cleo's is EXCELLENT! the food was incredible and the staff there was amazing. Highly recom","useful":0,"cool":0},"5PPji2pnixGyD78ePUbFng":{"text":"They gave me double rice instead of telling me i had 2 sides to pick from and they didn't ","useful":0,"cool":0},"O3ZuTzjT0o1ENKaFLsLhHw":{"text":"Wonderful dinner in a somewhat unusual setting - part restaurant, part convenience store. ","useful":0,"cool":0},"hw3qkknnbGkC-Z2aSAaDrQ":{"text":"Jackasses were closed. After finally finding a parking spot, I got to the door and it was ","useful":1,"cool":0},"av7FWBI1ch71WwXuq9VLOg":{"text":"The only good thing about this place is that it is open all night. Other than that it is p","useful":0,"cool":0},"4vrnZlUh-gVDxctkabN8wg":{"text":"Last night looking for something to eat late midnight and the taxi driver recommended it. ","useful":1,"cool":1},"2-xawBeI1rrSrn5zVbpIOg":{"text":"I've received great service every time I've walked in here. The place is divided into a ca","useful":2,"cool":0},"Worbhidj6YW39coYipgL5w":{"text":"The food here is Really Good, but the Prices are to High & the amount of food you get is a","useful":0,"cool":0},"2LIT7b8ffCoV-AYFJhtjvA":{"text":"Worst experience ever. They said \"our filter is not working, so go ahead and get the bottl","useful":0,"cool":0},"o4kLTqDXDL846j9hhRHQag":{"text":"Check your total and receipt, overcharged n add on price!! They need to upgrade their cash","useful":0,"cool":0},"5ZsMRxv2OKlYdyGYUQQRpA":{"text":"I got the chicken shawarma the first time I came and I fell in love with it! I had to come","useful":0,"cool":0},"z_-zcPyqLgVCyAHIEGEGFQ":{"text":"The hamouli fried cheese was like an explosion of flavor! And the plating was beautiful. T","useful":0,"cool":0},"77-dGQjiSFzetOodhh7Psg":{"text":"The food here is really good and inexpensive. I love their baba ganoush. They also carry s","useful":0,"cool":0},"rKx022moWLwUuiBfljHupg":{"text":"DO NOT BE THROWN OFF BY THE OUTSIDE! It doesn't have a lot of exterior charm and half of t","useful":0,"cool":0},"Ec67xn2FkYLMZmg-SauHKw":{"text":"The food... amazing. The place is super clean and the atmosphere is pleasant. My server Ca","useful":0,"cool":0},"VQbQFUvZU8tMZtXIU08jjQ":{"text":"Let down.  No problems with the people here or the interior.  It was the food that didn't ","useful":2,"cool":2},"rn6TLAWIBPGBN_PedyXyUQ":{"text":"Excellent food in a casual grocery setting. The hummus was some of the best I've ever had.","useful":0,"cool":0},"neEgsqOOpcOmXEe7IY1n4g":{"text":"After several days of typical New Orleans fare, we needed a change. Walked to this place f","useful":0,"cool":0},"vcyrzqCSMxb48akecaKNlg":{"text":"Dare I say it? This might be my favorite Greek place in town (sorry Lebanon's). The gyro p","useful":8,"cool":7},"dnn5zqG8yZ_RntNcaUHbGg":{"text":"Yum! Very good hummus and tabbouleh. I'd recommend taking it to go as it smells like food ","useful":0,"cool":0},"qmSS_qcggsGTTDEL8qPdyg":{"text":"Food and service is great! The portions of the size is enough for my tummy. I really liked","useful":0,"cool":0},"GhHnh9V1gexWhGghPyz5fQ":{"text":"Just scarfed down the falafel for lunch. It was DELISH! The falafel were crispy and not so","useful":1,"cool":1},"R7Xud9k46gVb6IW-T4IgVg":{"text":"Love this place! Sort of a weird feel inside but don't let that freak you out. Best hummus","useful":0,"cool":0},"kU-kOD523LMVA2T9B_a5iQ":{"text":"The food is always fresh! The food is made with love!!! Had a great time! 24 hrs the peopl","useful":0,"cool":0},"YCvsZATjk3KnOfMXXRV7eg":{"text":"I read the reviews & decided to give it a try and so glad i did!! Fantastic! The restauran","useful":0,"cool":0},"wcEebvPpWgX7dfvkYLNf_g":{"text":"Don't judge a book by its cover. Cleo's is one of the best tasting restaurants in downtown","useful":0,"cool":0},"sUPUrj0Y4ccjEoSCVRmVDA":{"text":"It's hard to find clean, good food in this area. I had the chicken shawarma with a salad a","useful":0,"cool":0},"MK9zhqw7I3rKKnLQSCmPWA":{"text":"Definitely some good Mediterranean food. Don't go by the looks, it is located inside a con","useful":0,"cool":0},"QYmnUxn5NBK4a-IyP0SajA":{"text":"Not the best Mediterranean food I've had but will do in a pinch. They are open 24/7 and th","useful":3,"cool":3},"ZV9PeiNbOBtR0NoKKZ4FRA":{"text":"I ate here last night and I couldn't wait to write a review! Don't be fooled by the fact t","useful":8,"cool":5},"_k-HBA78holKq10y7q7GBg":{"text":"I love Cleo's. Love the food, the eccentric owners and staff, the fact that they're open 2","useful":1,"cool":1},"j_ua1H6UxRDIS4f0PiD4vQ":{"text":"Good food.. very good food.. Only reason I didn't give 5 stars is the wait.. it wasn't bus","useful":0,"cool":0},"OmJEVSEvqyUHeBKOaKeZSw":{"text":"Was interested to find out how this place was, since they're open 24 hrs and right down th","useful":0,"cool":0},"Qcd-i0VVhjBJBVTj0Hp9eg":{"text":"Great yummy food, it is price of a restaurant. It tastes really good and we loved all we o","useful":1,"cool":0},"zBZhEd1YWjqEoRCTsmR0Kg":{"text":"Service was great. Price was right. Food was delicious.\n\nFalafel was top notch.\nHummus was","useful":0,"cool":0},"4bSpfv3ZBSgUyCZ9TO9yOg":{"text":"I wanted some good food but didn't want all the Mardi Gras People so i found Cleo's. Such ","useful":0,"cool":0},"DVikFOxxDHpbqhBrMuJVFw":{"text":"Hard to not think you made a mistake walking in. Looks like a convenience store. But keep ","useful":0,"cool":0},"1djH_vafs1TFwLovRq96Vg":{"text":"amazing food great staff. honestly one of the only quick and cheap places in the CBD. The ","useful":0,"cool":0},"DPfOfBASi8wKbu3CBgtpKg":{"text":"Was craving Mediterranean food during my trip to New Orleans and Cleo's delivered! At firs","useful":1,"cool":0},"_XlHMPDGRcLEAT_NOzUe1g":{"text":"I have never in my life had a place over charge me for food and think they can get away wi","useful":1,"cool":0},"TJyeoPeYQ25_z1xYH1oUEA":{"text":"Hands down the best place we ate at on our vacation to NOLA!  All the food was so flavorfu","useful":1,"cool":0},"3z3wMXn9fgpK0UQoaFA5Pw":{"text":"Literally the best place I've ever eaten. I travel all over the world and I find myself, o","useful":1,"cool":2},"9rrsin_RM5Mif9xhqozQHw":{"text":"Love the food here!!! So much to choose from and very convenient! Friendly staff and food ","useful":0,"cool":0},"BTATjzwIVos78gWv9KcizQ":{"text":"Don't normally post reviews but this one definitely deserves it! Cleo's was AMAZING!! I ha","useful":0,"cool":0},"gyIcAEZXOyAg4cp1vQct4g":{"text":"So average I don't know where to begin. In only get the lamb. The meat is good but the ric","useful":0,"cool":0},"tmFHHJPO6pxQFzBC9pFMUA":{"text":"In my hometown, Mediterranean cuisine is everywhere. So you'd think the last thing I'd wan","useful":1,"cool":1},"K_LTA1x-fWhcOATGHt2A2Q":{"text":"THIS PLACE IS SO GOOD! Looking for a change from the typical tourist New Orleans fare, we ","useful":1,"cool":0},"DGEB1TqWhkr-GOb_tRb5Nw":{"text":"This place has some great food but most of it seems very overpriced.  On top of that they ","useful":0,"cool":0},"JKUGgr-3pJvi9cEld9bMfQ":{"text":"You may see from my profile that I don't write many reviews, and if I'm perfectly honest- ","useful":0,"cool":0},"JK2I5yXxqj8bYTqgybUkyQ":{"text":"Cleo's: How does one begin? In the outrageously overpriced, overblown, tourist-scorning ye","useful":3,"cool":1},"zbAAtUtFdIGwaDRIc0D3bA":{"text":"Possibly the best Mediterranean/Middle Eastern food I've ever had. And I'm born and raised","useful":1,"cool":0},"fZyjuhfhG17fg7iQ9VkUGg":{"text":"The inadequate and inefficient staff ever. They didn't know how much to charge me for a bo","useful":0,"cool":0},"RwI-tgo1bv9IveOadLhSXw":{"text":"Seriously NOLA, you are killing it. Even your bodegas serve delicious cuisine. Can someone","useful":2,"cool":0},"T_1v8hE4DMfZoyW7_s2XpA":{"text":"Very good! Thus far I've only had the chicken gyro wrap...but in this area of town this is","useful":1,"cool":0},"fOKbobNnF4IJb52vhCxeMg":{"text":"Having eaten lunch at their old location I was pleased to try the new location on Canal St","useful":0,"cool":0},"yZhGP76iG-fC8ToWmB3Vjw":{"text":"As soon as you walk in you can smell it's gonna be good. Grab your own drinks and service ","useful":0,"cool":0},"7jQKp1saBYGPg9XoE722fQ":{"text":"Excellent dishes!!! I don't care if it's in a store. Service is great and fast! I wish the","useful":0,"cool":0},"XwdgDyw90ABqKbPi6EdJ1Q":{"text":"Great food.  Open 24 hours!  Lots of vegetarian options.  I highly suggest.","useful":1,"cool":0},"y2h4qER-eQ-gc820ijOl2A":{"text":"Good food. delivery took almost twice as long than estimated and I didn't get the call whe","useful":0,"cool":1},"J1h8tOZM8lu9WA8XD27NPg":{"text":"When I was on Waze I saw a Yelp tab, and pressed it to see \"review of the day\" with Cleo's","useful":0,"cool":0},"1A5jxhXZ3OmZ9VOAANY3Ig":{"text":"This food is delicious!!! My flight into NOLA was delayed a couple hours so I missed my co","useful":1,"cool":0},"jxQkQT2jzUuPg0GClYopfQ":{"text":"This is a really awesome joint, the food is delicious and the staff is super friendly.  Th","useful":0,"cool":0},"rMaMByrXKbpbkNQmr3xb9w":{"text":"Amazing food every time I come, and that's often. Everything is so fresh and tasty. Open l","useful":1,"cool":0},"JbttIb4aCLXJiHK3x513wg":{"text":"Great little eclectic diner, the food is wonderful. I will be coming again. They are also ","useful":0,"cool":0},"XFIqSwplVBSfENqidigftw":{"text":"Impeccable Mediterranean food. Had the veggie platter and everything was on point! A must ","useful":1,"cool":0},"lnNdxzeRYDCeW68lib049w":{"text":"Do you want well flavoured, incredible Mediterranean food? Go here. \n\nThere's no real fram","useful":1,"cool":0},"WnhVbV9Fdsb9l7BdMyKzFQ":{"text":"Mmmmmmm..... YUM!!! \n\nTotal hidden gem!! This was a short walk from our hotel on Canal St-","useful":1,"cool":0},"-X9h2vO44DnSeBoux4BCFw":{"text":"I wish it were possible to give negative stars. No matter what time I call they are never ","useful":2,"cool":1},"QNWh9SKkVxwtTMwN-gkVGQ":{"text":"Came here for an after midnight snack and was blown away by the flavor and freshness of th","useful":1,"cool":0},"rZ8YFXrWnGtevWu3NUFdXw":{"text":"The hummus is good and falafel but the tabbouleh salad is more like a parsley salad. Very ","useful":0,"cool":0},"OezQy3pWzIlpEi9UyyZVWw":{"text":"The food was excellent. My only suggestion is that there be more direction near the front ","useful":0,"cool":0},"jjeylYYemeTJEEkI_QTjhQ":{"text":"I eat a lot of Mediterranean food, considering my wife is vegetarian. This includes Israel","useful":1,"cool":0},"VADRTxlxvsFEYr0cgz6LzA":{"text":"Great food in the CBD at a very reasonable price. Tried lots of standard fare & all was go","useful":0,"cool":0},"YV1_ohvOKOHSt796FOfBUg":{"text":"Our group had a bit of trouble deciding where to go.  We looked up restaurants with a good","useful":0,"cool":0},"5sFXPYqt2EhxTFb2vMZXuQ":{"text":"There are a bit of inconsistencies in the servings depending on whoever is making it, i se","useful":1,"cool":0},"PjMvqO4EMfOKKcRDy482CA":{"text":"The food is authentic and fresh! Very clean and service great! Enjoyed the Kibbeh and Shwa","useful":0,"cool":0},"9uGrbVUAfEKeJcS25i8QvQ":{"text":"One doesn't come here for the ambiance, but strictly for the food. Warm, hospitable servic","useful":1,"cool":1},"NlX7ayNQN6pdqa4q3oDdDA":{"text":"Place rules!\nOwner(s) strive to be the best!\nFood, even in takeout containers, is gorgeous","useful":1,"cool":0},"KWzgkm4mh1qPEP_uQgyXcw":{"text":"The best Mediterranean food I've ever had! Our server was super nice and honest. I had the","useful":0,"cool":0},"j0FCjWEGgbJUeOqut0lKyA":{"text":"I love Mediterranean food and was looking for one nearby where I stay by intercontinental ","useful":0,"cool":0},"5_avdWhVHMzXSzIPFHFREw":{"text":"Great food! We got the platter for lunch and loved it.\n\nThe place is extremely simple (if ","useful":0,"cool":0},"paCV9P9Y5WQ_qw9nSrX0vQ":{"text":"Yelp came through for us yet again!  We stumbled into Cleo's not knowing what to expect.  ","useful":0,"cool":0},"kn4keheqMU6cEV7uprL91Q":{"text":"Drop everything you're doing and come eat here! Seriously. Don't get discouraged by its lo","useful":2,"cool":0},"fMM8ORWwpdFPmxFXmirTlA":{"text":"Food was great! Shrimp plate was amazing and best hummus ever. I didn't know what to expec","useful":0,"cool":0},"-GYWHgwRYMlfAApvF2n4iA":{"text":"I called this place 4 days in a row trying to get them to deliver and they had a different","useful":1,"cool":0},"m2HBCJf6ALhuc6pWClxghg":{"text":"Great falafel and hummus. Shrimp sandwich was good as well. As other reviewers noted this ","useful":0,"cool":0},"7gJ8L_xidNhqyKCEj04MCA":{"text":"We were on way to Florida and wanted something halal. Called them 15 mins before and when ","useful":0,"cool":0},"eryhRyLJpH_tm2xcTe109g":{"text":"I can't say enough about Cleo's.  Open 24 hours, food is always delicious, the service gra","useful":1,"cool":0},"Po76-Cw1KIv-zBPt4ht5zw":{"text":"Delicious, real, healthy, vegetarian food in the middle of the night after a travel day. F","useful":0,"cool":0},"lT5YfR4T-w0K54YLUuxIZQ":{"text":"This place has some of the best middle eastern food you will eat anywhere!!!  Period!!! Th","useful":0,"cool":0},"w9M1nZSO1BZt9tKSjT2DkQ":{"text":"Had read all the reviews and intended to eat here when last in New Orleans a few months ag","useful":0,"cool":0},"VWufhAxAHjhgLuCSgpMnsQ":{"text":"Spectacular hummus! Lamb, beef and gyro beef wraps and Lebanese tea- a rose/mint/ somethin","useful":1,"cool":0},"u9TQehdPjDj2_2TMBHqgDA":{"text":"I absolutely love this place. I've tried many things on their menu and have been a frequen","useful":2,"cool":0},"XVIJTs1CiwCCeP-Qr9t0DA":{"text":"This restaurant have very good food but the people who run this restaurant are Very nasty ","useful":0,"cool":0},"WG8BpcYUzqH5pPfJ_gkrYg":{"text":"Saw reviews and wanted some local cuisine that wasn't as fancy as our normal routine. This","useful":1,"cool":0},"7awopLxVEJx-6AOZ9pd43A":{"text":"So after a week in New Orleans we were tired of the deep fried food and poor boys. We were","useful":0,"cool":0},"uNtxr81aEF-utp_hyr_e8A":{"text":"The food here is not bad. It's actually pretty good. I'm no expert in middle eastern cuisi","useful":2,"cool":1},"pxi9x0V1QAqESz4RcMl84w":{"text":"Nothing more to say. Great prices for AMAZING and authentic Mediterranean cuisine. The own","useful":0,"cool":0},"CGnrREMkLHaMrKJb8KxgYQ":{"text":"Monday, 7:00 PM.\n*Paid at the register.\n\nQuickie:\n+ Food quality\n+ Friendly staff\n-- Slow ","useful":1,"cool":1},"Zx8BCceMEEzUyJ02_6UERQ":{"text":"I went here with 3 friends at around 5pm and was surprised to see no customers. The restau","useful":1,"cool":0},"AB4WQ-fgQoDcjIbb8DcR3Q":{"text":"Love it!!! Everything we've ever had has been delicious. Have been going for years and wil","useful":0,"cool":0},"CKZxn3m-Ktn1iXyrT9hEEg":{"text":"Amazing falafel!! Best food I had while in New Orleans ! Really authentic and the staff we","useful":0,"cool":0},"qcR_cKILpeLKdVuBXVRsMQ":{"text":"Was looking for a late night dinner that was gluten free and this place was perfect! It's ","useful":1,"cool":0},"PySyJNh3AqComC3wcYXsxQ":{"text":"Fresh ingredients, made with care, 24/7.  We found this place on zabihah.com and on yelp. ","useful":4,"cool":0},"hpB0Gn82B0BaWQ6034uXXw":{"text":"This place is the best food place in New Orleans. It's the food you want to eat. It is ope","useful":0,"cool":0},"vAbWj8wDyZfCd3nmwFUi2g":{"text":"So happy this place was a short walk from my hotel. Friendly staff, a few tables if you wa","useful":1,"cool":0},"iISxQn_BV4qPcd5S9_R-oA":{"text":"Delicious Mediterranean food. Always on point. Love that it's in the little market store t","useful":1,"cool":0},"Mfmg5J1NbtwO7qbxAeqv9w":{"text":"Walking in the door here I didn't have high expectations.  The front of the business is a ","useful":1,"cool":0},"48tbpBX4z4HU_mJI2ncyMw":{"text":"Granted, they delivered at 9:30 on a rainy evening. That was much appreciated! Food was ok","useful":1,"cool":2},"ESvvaqXldEvKdXIAC7Y4Uw":{"text":"There's a reason for the 5 star average.  Everything we had was fresh and legit,  all home","useful":1,"cool":0},"eC1Amfr6qujDedr6g41vZA":{"text":"In town on business and this place was near  my hotel so stopped in for lunch.  I had the ","useful":0,"cool":0},"JPhsqj3A3cTw82QirARZkA":{"text":"Searching for something fresh and green, Cleo's was just what we needed!  Brandon was so v","useful":3,"cool":0},"3v6pqbgbknLCB0128pKwqQ":{"text":"Great food in a very casual environment.  Our waitress was very friendly and attentive.  A","useful":0,"cool":0},"SUA8a4rYY1M3FqptJ6hdAQ":{"text":"OMG \nThis is SOOO amazing..the Lamb & Humus  is a MUST TRY!!  Plus the grocery stock is so","useful":0,"cool":0},"p9uEk6G_9e4nn93WdpYQyg":{"text":"Everything was bad.  At first you have to take line to order. Then we were waiting a long ","useful":1,"cool":0},"kAmenqTitMlrK5QCtBLXLQ":{"text":"I really like their Hummus with Peter Bread... \nI ordered combo- chicken & beef..u should ","useful":0,"cool":0},"MYbnF_e_utsjJdESvbVVcg":{"text":"The food's great. The dishes are consistently delicious and well seasoned. My favorites ar","useful":3,"cool":1},"tf9JFIVnlhyOGx4ebMbb8Q":{"text":"Simple seating within a convenience store, but fantastic and freshly prepared food. I had ","useful":0,"cool":0},"qad9B25lf0i_a2ysO1xUWQ":{"text":"Very unassuming place that ended up being my favorite place to eat in NoLA!! The meat was ","useful":1,"cool":0},"Marip1gmX1TC2v_YG6S07Q":{"text":"This place is seriously the best. One of the owners has been bugging me for a while for a ","useful":1,"cool":0},"l0vRjsJe1PUtMK1Rr53uSw":{"text":"Amazing food at any hour and a cool store attached. Why in the world would you go to an al","useful":2,"cool":0},"aoc7jIc6Xpq0FhFrxq49Hg":{"text":"We swung by here for a quick dinner before seeing a concert at Joy. We were looking for so","useful":1,"cool":1},"J78snfwROxNKUDSm2MeHLA":{"text":"I love this place! It an essential for vegetarians. I had the Vegetarian Platter, the Fala","useful":0,"cool":0},"MEbe-FJBn5zt3YbEL6fqtA":{"text":"Food was good. The owner on the other hand was a mad man and the service was awful. He acc","useful":0,"cool":0},"TdnOeJR-4XtD6FzZbTN-vg":{"text":"Having lived in the Middle-East, I am very familiar with Mediterranean cuisine and I would","useful":0,"cool":0},"OZLX6ZDT4XEHlNAd2h-QDA":{"text":"I've been using Yelp for years, but this is my first review ever! Was in New Orleans from ","useful":0,"cool":0},"G0bsDkDiLbARP1SoAbXn5A":{"text":"Very convenient prices, especially so close to many hotels! Great food! I had the grilled ","useful":0,"cool":0},"RnQzJ-wAEk5CiAoRZxZX4Q":{"text":"I went for my birthday on 1/6/16 and was very impressed for such a small cornerstone like ","useful":1,"cool":0},"iKZd1drT1oTICWoxaCPKbg":{"text":"In town for a conference. Found Cleo's on Yelp and so glad I did. The best Greek food I ha","useful":1,"cool":0},"CU0leNumPfMsiVfOIJO7xQ":{"text":"This place has great food!  Stayed at Wyndham, needed a place to eat at 1:30am.  The chick","useful":1,"cool":0},"nIILDGT6AWwojQO5fmjKcw":{"text":"This was a great find! Thanks Yelpers :)\n\nI wanted a quick take-out meal my first dinner i","useful":4,"cool":0},"JltB7b1wwxBMpjWJWgH_eQ":{"text":"We were staying at The Roosevelt Hotel.  Based on the yelp reviews we decided to walk out ","useful":0,"cool":0},"aZmxuBGzZZlPE9wrK12Uiw":{"text":"If you love Greek or Mediterranean food, this is the best place in the city to get it!  Th","useful":0,"cool":0},"w2VLdC7ELkgeb0-9sj6BYg":{"text":"All I can say is: Go here and get ready to have the best baba ghanoush. Ever. I also had t","useful":1,"cool":0},"USjFVnbCmrvblmJH8NS7Kw":{"text":"Woah. My boyfriend recently moved into an apartment down the street and Cleo's has been an","useful":3,"cool":0},"LJ6R1atYC79CP6WxIyKI3Q":{"text":"Amazing falafel - I will be back next time I'm in town.  Big thanks to Elham and Sam for t","useful":0,"cool":0},"kPg7vTTFW5CKX9HMetzzpg":{"text":"Very pleasantly surprised by this Mediterranean restaurant. It's on a busy corner of downt","useful":0,"cool":0},"gpc09kSBnowSLa5r10yGQw":{"text":"Cleo's is opened 24/7. So they are one of the best places to go for after hours. I've been","useful":3,"cool":0},"EdaWUxH8wT2bwoa-8KNXPQ":{"text":"Not open 24 hours and the reviews about the \"very friendly staff\" failed on both expectati","useful":3,"cool":1},"fqe0ZK7dcqD1oNgP32fx7w":{"text":"I was pleasantly surprised by Cleo's.  I had a craving for some tabbouleh and Cleo's was a","useful":0,"cool":0},"XUdGBSdLhLb05HME2n7Spw":{"text":"After indulging in a few days worth of gumbo and seafood, the hubs and I were craving rice","useful":0,"cool":0},"30zcmlnYJ0eWSMUy0o8MYw":{"text":"I've been here a few times and never had anything bad on the menu. Every visit has been fa","useful":0,"cool":0},"ssNMj_cBHucIEhajlkh94w":{"text":"Excellent food; kibbeh is the real deal. Staff is very nice. Can be a little slow, but the","useful":1,"cool":0},"0Ojvrg1-lOTkdikBIRFigg":{"text":"I was at this restaurant with my family of 12 and the staff was incredible accommodating t","useful":1,"cool":0},"y20k5mnJpyXcOSsG0_ZGoA":{"text":"Vegetarian Platter was amazingly flavorful! After 5 days of eating all over the city this ","useful":0,"cool":0},"Ce5IETvst_4FnmgXmIlhmQ":{"text":"Great food, but sign says they are open 24/7! They are not, tried to go in at 10am and the","useful":0,"cool":0},"wI_sYUv7PYR_Nf-Aj39TrA":{"text":"Weird atmosphere but the food is very authentic and reasonably priced. This is my new favo","useful":0,"cool":0},"undRQy5VWgQX9QTx8OnVnA":{"text":"Great food and solid service! Elham and Ashlaf(sp?), cooking in the back as well as Sam's ","useful":1,"cool":0},"MsiWt60EjjiVUsMHoe80SQ":{"text":"Alright, where to start... \n\nIt being my first time in New Orleans, I really thought my fa","useful":0,"cool":0},"Ng3EJCUtj7TwNQpiUuAvmg":{"text":"I want to sayI love the food and the fact that I can get a vegan meal in New Orleans 24/7.","useful":0,"cool":0},"ZSLRWeHgB0tV7Dfk8bd1dg":{"text":"Way overpriced. Would not recommend. \nThe portions are TINY. My friends and I got a few ta","useful":1,"cool":0},"GiwPnJ1cfa0ylk_MMiWg-g":{"text":"Great little hole-in-the-wall spot. The prices are not overwhelming, and the Mediterranean","useful":1,"cool":0},"zEWzgI6qJtYYWwsN6l3p7Q":{"text":"Such delicious food and attentive service! Loved the hummus as well as the falafel salad w","useful":1,"cool":1},"SNW3MK6EvFhBxbkdq1Xl8g":{"text":"I went to New Orleans on vacation with a friend, and we made the excellent decision to eat","useful":1,"cool":1},"JmrdyspFticCAS1oU2jDNg":{"text":"Amazing food and great service!! Everything was so delicious and the presentation was simp","useful":0,"cool":0},"g6BYKa3wVj1iuyl-eKmWyQ":{"text":"Definitely the best Mediterrenean food around! Everything is so flavorful and cooked to pe","useful":1,"cool":0},"PXV2tBTYxBWwgjeHx9SZBg":{"text":"I am visiting from out of town and wish I could eat every meal here while in town.  I had ","useful":1,"cool":0},"DJnZfhcdgD3b0Q5ow8M4JQ":{"text":"Best falafel & gyro in NOLA, great baba ganoush, amazing value, super friendly!","useful":1,"cool":0},"CX0-6owhNA4k8o6OoaMd9A":{"text":"There isn't decent food late at night in New Orleans. Came here not knowing what to expect","useful":0,"cool":0},"FN8S3KeqKkKmha_fzTZFIA":{"text":"fantastic food but the service can use some improvements...its like going to the soup Nazi","useful":0,"cool":0},"gU2aPebaoIM9UdzjRaVS0A":{"text":"I don't even know why this place has so good reviews.  If you are looking for really authe","useful":1,"cool":1},"HBXD-E25zaPbVAQ6I-PhvA":{"text":"Great meal in a hole in the wall... strange atmosphere but its great food. Hummus and gyro","useful":0,"cool":0},"6PImTybdPmJB9MO04f06WQ":{"text":"Greek food... in a convenience store... in New Orleans?  It seems totally random but ya kn","useful":0,"cool":0},"SPwjH5MGR2KH7dnmcs8JNw":{"text":"Omg do order food here.  We had the spinach pie to start so flakey and flavorful.  Next we","useful":0,"cool":0},"bLqJoeSReA1Uh0FxSTyveQ":{"text":"If you need a break from the regional food, go to Cleo's! It's easy to pass by as it is qu","useful":0,"cool":0},"TxWsJYnFT1wmkn_DT7TFAA":{"text":"The food is awesome, no matter what time of day or night! Favorites are the falafel, veget","useful":0,"cool":0},"_nJOG7oCEKhUvUIGU_bSpg":{"text":"What a great meal I had there - the gyro plate. \nIt's a small hole in the wall as others h","useful":2,"cool":0},"FHWGXbm6mFTjTkD_qKwuzg":{"text":"It was all delicious. Everything was fresh, and tasted homemade. If this was in my town we","useful":0,"cool":0},"M4It8sXqnWNPwB_isCt0vw":{"text":"Tasty and affordable option on the north end of the CBD. I love having a new place for lun","useful":1,"cool":0},"2SK6WxVqkVrFwG_CtST-Ig":{"text":"Great food and great service. The best Mediterranean food in town for down!! I highly reco","useful":0,"cool":0},"59Acjm5qYg906Obz-x_NmQ":{"text":"Incredible food at this place we happened to stumble upon before catching a show at the JO","useful":1,"cool":0},"4-68KyFKnNJUQMXkqtL8iQ":{"text":"I see that most of the reviews for this place are 5 stars so please allow me to pile-on. I","useful":2,"cool":0},"SSlA5xK5-ffUMm7wEdgXkg":{"text":"The food here is amazing. You will not regret it. I had the sautéed vegetable dish with ch","useful":1,"cool":0},"txiNKUTITgWcE40qnv2TdA":{"text":"Was soo disappointed in the food, gyro was blah! The falafel was burnt, the lentil soup ha","useful":0,"cool":0},"CzjohIDZe2_U0OdIHT7o1w":{"text":"This place is awesome! It's tucked away in a convenience store, but don't let that fool yo","useful":1,"cool":0},"o14wpXV7P4UPVNmfI2wp-w":{"text":"I ate here for the first time yesterday, and I think I will be going back to Lebanon's Caf","useful":1,"cool":1},"IQGCqBdymX5eRTYUW-m54w":{"text":"Our Uber driver recommended Cleos.  We have eaten there 2x\n as its close by to where we ar","useful":0,"cool":0},"fwsEcRUAuNbDlg18I1SOEA":{"text":"I truly hope and pray this place never becomes so popular and overrun with tourists becaus","useful":1,"cool":0},"6iMEvDUZc4TsnIi1lv9reg":{"text":"I must confess, I've lived across the street from Cleo's for 6 months, and just tried thei","useful":1,"cool":0},"khyi4YvBLwQTLuXqsisc6g":{"text":"Looking for something healthy, raw and fresh?  This place rules!  I know, it's not the atm","useful":0,"cool":0},"8Hz4Ukk2fhzhSPj86bVwEA":{"text":"Ordered Cleo's from my CBD hotel and it was great! I had the chicken kabob wrap, coworkers","useful":0,"cool":0},"Te2K1wQ9j8lDDsEOstsO4g":{"text":"I have been dying to find a Mediterranean food place since I moved here, since I used to w","useful":0,"cool":0},"QUjFTj39iHrViTwdPgBi2Q":{"text":"I had the vegetarian plate and it was very good. I loved the baba ganoush (so much better ","useful":2,"cool":2},"KqWBcKDG8X2zJ3c0_pdDlA":{"text":"This is indeed as good as it gets.  Amazing food for a great price.  Deliciious!","useful":0,"cool":0},"3dge7rXik1BHoOntxXOC3w":{"text":"This place is excellent! Food is authentic and yummy. I was in town for a conference and e","useful":0,"cool":0},"aaUrPcDRfSrp_ilB4iYb6A":{"text":"Being veg I've eaten my share of Mediterranean food all over the US and in the middle east","useful":0,"cool":0},"L6M2XG0kq-7XGmrCXHhhFQ":{"text":"This place was a recommendation by some other guests of the hotel we were staying at (righ","useful":0,"cool":0},"yYjquF8IuoYMaZHpUlBSPQ":{"text":"Way over priced for the amount you get. I've had way better chicken shawarma. If your look","useful":0,"cool":0},"FC3dHmn_wN5hp54TBb6PKA":{"text":"We stumbled upon this place and almost walked by because it looked like a convenience stor","useful":0,"cool":0},"vlgAkfPqR4-Ydg_VbEXlBg":{"text":"Ate here 3 times this weekend. The food is killer. Try the lentil soup. So amazing. The on","useful":1,"cool":0},"rzgidin5wZDjEJHGtSlbRQ":{"text":"Coming from a city where you can get any type of food imaginable, I've been pretty disappo","useful":2,"cool":2},"ugg-DF_7ir6YH42ApjQR2g":{"text":"I'm not certain how this place has so many great reviews. Yes, the service was quick and f","useful":0,"cool":0},"sl1WshZyJegl9ymmOxwvxg":{"text":"Finding this place after two long flights and totally starving was a blessing! Quick and y","useful":0,"cool":0},"cw6ugjk_cw91sDgQfmVs6Q":{"text":"Food was awesome and so was the service !! If you are tired of southern food be sure to gi","useful":1,"cool":0},"I7ZGmY12hETp5yV9Xs2p9w":{"text":"Wow! Just WOW! Best Baba Ganouj and best falafel in NOLA. Everything was absolutely delici","useful":0,"cool":0},"5lAo1O_rkmdo1O6UMK94ww":{"text":"Love the beef schwarma and the falafel, but the guy at the counter is CREEPY. He cannot st","useful":2,"cool":0},"SIGieUfp3TGI_G-Yc_kyVA":{"text":"Great place to stumble into , grocery store / resturant . The Vegetarian platter might be ","useful":1,"cool":0},"3W8BrAlBb0orDM6nGzt-wA":{"text":"Nice fresh food. Pleasant servers. Seems a bit pricy but very convenient.","useful":0,"cool":0},"9maqjNfm9tHblnL0gwtA_w":{"text":"I moved buildings so don't get here as much as I wish I could, but after a fine lunch toda","useful":1,"cool":0},"1VDXFwGBhNNHGtoX68F46g":{"text":"We went here two nights in a row. The food is delicious, fresh and authentic. I could eat ","useful":0,"cool":0},"gpCaEvp2eY0EPaiLMCQ8yg":{"text":"Spectacular Mediterranean food. \n\nSo if a Mediterranean place can't make great hummus, ple","useful":1,"cool":2},"EG-Bul1TqQuPMb-nbhVpvw":{"text":"We took a Togo from here and the pita breads were cold and not good to eat.  It got hard w","useful":0,"cool":0},"mShFWztKSWmNQNpeDsdUBw":{"text":"At first I was taken back by the ambience.  The restaurant is in a deli.  But I followed t","useful":0,"cool":0},"uxN6NYLJzhgMDP3kbEIyuw":{"text":"The night before, 3 of us had descended ravenously upon The Halal Guys.  The last time we'","useful":13,"cool":11},"eWIB_zrmMpvNZAmOqda9Ow":{"text":"Funny story about this review. I came in to Cleo's to pick up dinner for my boyfriend and ","useful":5,"cool":3},"Vbv2cG8yWGDZJbX8vGAhTw":{"text":"I'm a regular at Cleo's, and I love the food. We don't have great Mediterranean options in","useful":2,"cool":1},"ubt5zbWKm4YITJDx1ewDHQ":{"text":"Good food, this restaurant shares space with the neighborhood convenience store. You selec","useful":0,"cool":0},"ote49br75HI-h53Mgvi8XQ":{"text":"The kebobs and musabaha (think hummus on steroids) are out of this world. The chicken was ","useful":0,"cool":0},"N1gbcLAsJHjNhJFEBZRbog":{"text":"My family and I were wandering around Nola looking for something tasty to eat on Christmas","useful":0,"cool":0},"k4BGQKPMsC1wOxoUQO3eXA":{"text":"My coworkers and I love Cleo's. Always tasty food beautifully presented. Dino is a very fr","useful":0,"cool":0},"agtHCXjGlx1MCIm99-L0Ng":{"text":"Staff's friendly enough and the food was pretty good.  The hummus was probably the best I'","useful":1,"cool":0},"5_2RBbbMyFCoX10fP4chlg":{"text":"I lived in Palestine as a white American for over a year in my adolescence in the late 197","useful":1,"cool":0},"LRrZ4Gvj-J4x8BUN3hJVxg":{"text":"Honestly every time I come to New Orleans this is my favorite place I eat at. Best hummus ","useful":0,"cool":0},"K9llD9bGfBuHnLmTo5sg8A":{"text":"A very  dependable place for me to go to when all else is closed. Open 24/7. Most elaborat","useful":0,"cool":0},"zn3QnNT8bNOzsHk0WFqPYg":{"text":"Great inexpensive alternative When you are tired of fried seafood and superior service! I ","useful":2,"cool":0},"zU34HJz4Rp9TTEn6xlBVSQ":{"text":"Cleo's is a terrific addition to a quickly revitalizing corner of the CBD.  The menu offer","useful":0,"cool":0},"HDbGIBUFHF2Cmdfm1Dk3vw":{"text":"Whenever I go to Cleo's I always get the Hummus and the Falafel. They are the best I've ev","useful":0,"cool":0},"ZXU9DGf4_df45SD5yPMpdA":{"text":"The only way this place deserves four-plus stars is if you are rating it as a convenience ","useful":2,"cool":0},"jqMeMI-fEv4zG50argjktQ":{"text":"Been to many middle eastern restaurants, this one by far was the best in New Orleans. Food","useful":1,"cool":0},"1gIAcQ8CaYgkEAW_69EAiA":{"text":"At first you think, WTF! it's a corner store, but the food is great. Don't judge at first ","useful":0,"cool":0},"upPMSvrLq_vHVurXLXNbgQ":{"text":"Maybe I'm biased because this is now one of my favorite neighborhood restaurants, but seri","useful":0,"cool":0},"HXrfPROwzf4QPdqsDf1agw":{"text":"It's actually been a couple years since we've visited Cleo's. I guess I forgot to do a rev","useful":1,"cool":1},"x4xeGhuf0L-5px_1B0F3Aw":{"text":"Dank Mediterranean food! amazing and friendly staff! 5 stars all the way around!","useful":0,"cool":0},"MM9ekVHpPh5htb_NrmOESA":{"text":"Food here was very good with some great flavors but the drink selection is incredible! The","useful":0,"cool":0},"BtK3czl9HMy8gQotz4JPeg":{"text":"My girl friend and I went there for late nite food because nowhere else was open. The conc","useful":1,"cool":0},"Xrz9_3tH1Ea3breCNpDF4g":{"text":"Well, once again a big thank you to yelp.   This delightful Mediterranean restaurant did n","useful":0,"cool":0},"nSiyjekGXzwS-DstVIdvow":{"text":"Most of the food was awesome. The stuffed grape leaves platter wasn't that great, but ever","useful":0,"cool":0},"Q4npD2saCuuWjvnqnrTcGQ":{"text":"Perhaps the best tasty Mediterranean food in all of NOLA.  Visit after visit, the place co","useful":1,"cool":0},"t7KxzsekGHqDvuBiz-rc7A":{"text":"We were 10 of us and looking for a late night grab. Turned out to be s great find. Tasty f","useful":0,"cool":0},"qk8yu_vxjW2PsHWiXqUu7Q":{"text":"that's right back again eating the best\nfood ever,fresh,healthy & absolutely a mouth full ","useful":2,"cool":1},"sRZIqJAFrtog4-E9zjxszg":{"text":"Awesome food  we ended up at Cleo's thinking it was a Mediterranean restaurant but its a s","useful":0,"cool":0},"fsDmwdqCuuunK4xpzejp7w":{"text":"Fabulous lamb shwarma and basmati rice, washed down with ginger ale. Been here twice when ","useful":0,"cool":0},"FxjLMPVO_WkbxJPHzp4Q9A":{"text":"I went there on my first day on our New Orleans vacation and I was so happy that I did. Th","useful":0,"cool":0},"Vt53A7YAMSr9ZCq6T3qH5Q":{"text":"Really quiet hole in the wall with high quality food\n\nDefinitely recommend getting hummus ","useful":0,"cool":0},"JruokEYoXfdg0rHcGvj-gA":{"text":"Had lamb shish kebab wrap and musabaha. Loved both! The staff was also very friendly!","useful":1,"cool":0},"yp3OkLHWHqpS3zPVuPBlkg":{"text":"Really good food in a convenience store. Shwarma, hummus, falafel and all your middle east","useful":2,"cool":0},"I5h99FuPb_fVSs23PRxSBw":{"text":"Second visit was awesome again!\n\nI tried the Kofta lamb wrap this time; asked to add eggpl","useful":2,"cool":0},"dXrP4j3bz3lOxTZEoOcOSg":{"text":"My friend and I were a bit skeptical because it's a restaurant in a convenience store. We ","useful":0,"cool":0},"ydFOLmbCqUqR1ssE0FkIpg":{"text":"Not very impressed . Took over 40 min for 2 dishes and 2 appetizers . Flavors were ok noth","useful":0,"cool":0},"bEgD4t67vdT-obO7fi6H-g":{"text":"I'm not sure why this place is such a hidden gem but the world needs to know about it!!! O","useful":1,"cool":0},"YEOw504TiXqHgolV54V8sA":{"text":"OMG!!! Was visiting in town for Essence fest and everything on Bourbon of course was packe","useful":0,"cool":0},"OqFLnUb-cUWLv_Q0G9zR4A":{"text":"A very  dependable place for me to go to when all else is closed. Open 24/7. Most elaborat","useful":0,"cool":0},"6rUmNeCQem1KXE_eKmm8cg":{"text":"I am not accustomed to write reviews but this place, unassuming as it is, definitely deser","useful":0,"cool":0},"0dcvO5KHQEMcQli5nmdxxw":{"text":"Decided to try this place again for lunch during a latest trip to NOLA and we had some mix","useful":1,"cool":1},"MrAIWnCSnIDHtLd4S-3zyg":{"text":"After coming highly recommended from my friends I was excited to eat here. Super close to ","useful":0,"cool":0},"Kaj3JOkvjzOZSlZsaV2FoQ":{"text":"In from St. Louis and have been looking for a place that has chicken Shawarma as good as m","useful":0,"cool":0},"DAeaQuVD2B8lB_AkJAuE-A":{"text":"We arrived, no one was present to greet us. So my friends and I sat down and looked over t","useful":0,"cool":0},"_lNBtiBjyPf7IwKOK1LXTw":{"text":"This is by far the worst falafel that I've ever had. I was super excited to try this place","useful":1,"cool":0},"_iH7g8GUGEoP8m-pSds3Pw":{"text":"You may look across the street, see this store and second guess if the reviews are correct","useful":0,"cool":0},"QR2lp6k4VYNzGSYfooM2KQ":{"text":"I can't stop thinking about the hummus and baba ganooj from this place. Found the place on","useful":1,"cool":0},"VLihycAEyagXHk5jnYL42w":{"text":"The staff is incredible and incredibly friendly. The food is awesome. I got the baba ganou","useful":1,"cool":0},"ovO6Y7RYkzniR7oJgPYISA":{"text":"This place really is in a convenience store. That didn't bother me. The real problem was t","useful":0,"cool":0},"ELpW85py68zefqL-xpvMkQ":{"text":"Don't be fooled by outside appearances. Great Mediterranean food awaits inside. We loved e","useful":0,"cool":0},"nm2q-gOg7yqNQWE7t3yxvA":{"text":"So I've been seeing all of these tremendous 5 star reviews on Yelp....\n\nWhat is all of the","useful":2,"cool":1},"mvMwLjm8lkqiyqytQj3OTQ":{"text":"This place was right around the corner from our AirBnB and we became regulars during our w","useful":3,"cool":2},"xrD0kfxsHA_LRlLH7J_K6Q":{"text":"Food was great! Sam is awesome and has an amazing story. Ashrhf can cook a yummy meal! Veg","useful":0,"cool":0},"Zhi4Jb8q9gfkBIhKweoaKg":{"text":"To get food this good at any hour in NOLA is amazing. \nThe eggplant is 10/10, spicy and pe","useful":0,"cool":0},"rBX32Y7Yj7T6WR15DFyQkg":{"text":"Another amazing lunch served to us by Cleo's using the Uber eats. \n\nAgain guys, this place","useful":1,"cool":1},"DXFkCPJtvDIZhLU4gBPUPQ":{"text":"Fabulous food, great experience! Jeremy was so personable and completely on top of the ser","useful":0,"cool":0},"EamdEkpbJhmtloTFmnkmjA":{"text":"An interesting shop. A mix of a liquor store and a sit down restaurant. Convenient if you'","useful":0,"cool":0},"JNSoZ8KuM4PhYn35W-LSGA":{"text":"Who would have thought you could find great Mediterranean food in a 24 hour convenience st","useful":0,"cool":0},"2zfyzG6D4k7EQYFDTY6-ew":{"text":"Awesome place! Super flexible with my order, as I wanted a little of this and that. Great ","useful":0,"cool":0},"pnXsi-CnddDuZUDuTKYWiA":{"text":"Been coming here as a regular for probably a year.  I usually order their hummus appetizer","useful":0,"cool":0},"Cu6gJjYEScNeOAC86b_dnw":{"text":"Tried this place with a skeptical friend on a business trip. This place should be famous! ","useful":0,"cool":0},"fwziMF_U3YgxH8IVXBuJwQ":{"text":"Very cute little restaurant located in a convenience store if you're looking for a quick m","useful":0,"cool":0},"_JjAF-ANNY7wf2qk2aDDxw":{"text":"Cleo's has the best Mediterranean food in the French quarter.  They are open 24 hours and ","useful":0,"cool":0},"umjxyTQPL7k50E7sCRfPcQ":{"text":"Don't mind the setting as most hole-in-the-wall places in NOLA have the best food and Cleo","useful":2,"cool":1},"0rB6LIbpiOkJhr0kBUYy6A":{"text":"I found this place soon after moving from NYC and feeling incredibly homesick for good Mid","useful":1,"cool":0},"-Ov2cPsH94wzx5cN8cnI6Q":{"text":"I'll start by saying the food was mostly very tasty -- great mezze platter, good side sala","useful":0,"cool":0},"TdhtGyJsG3PAyWROEMQceA":{"text":"In case you have trouble finding it, it's inside of the convenience store. Nice atmosphere","useful":0,"cool":0},"O6C0huZ39JDAHxywRZjXOA":{"text":"Terrible place, in a clumsy and shabby setting with bad and unhygienic food. In terms of p","useful":0,"cool":0},"FC5IeC3PRqAqE2nfPRQ0Ow":{"text":"Nice store good customer service \nFood was fresh & delicious everything \nBut the rice it w","useful":0,"cool":0},"w4wHzPcMD_O_RY3zasVX3w":{"text":"It was good food if they can get your order right, gave them a second chances messed up on","useful":1,"cool":1},"o2FIhA0x7o6hU_9QFSWJgA":{"text":"Tried Cleo's on Decatur for the first time tonight. The atmosphere was delightful and the ","useful":0,"cool":0},"EjGGYO7J9xsSCzQLjY1Q8w":{"text":"I'm always looking for great, late night food, and Cleo's DEFinitely fit the bill! The pla","useful":1,"cool":0},"viz9AdfksVr-SaH9-hGqZQ":{"text":"My relationship is difficult to explain but here goes. \nIf I wanted Mediterranean food bef","useful":2,"cool":1},"L5kThb5o-51jDpDUHvU2BA":{"text":"Let me start with the bad stuff this time. The vine leaves weren't my favorite, but I that","useful":0,"cool":0},"Rzbj6yYEUHO0oO7onQK0hg":{"text":"Solid food. A good, reasonably priced, healthier selection for the neighborhood. For you l","useful":0,"cool":0},"HVBZ5I3cfLwoNszIUXYjTQ":{"text":"Great little 24 hour spot with flavorful eggplant and crispy falafel. Fresh, fast, yummy. ","useful":1,"cool":0},"9bXQ4jzXjlA39-cdmedKsQ":{"text":"Service is pretty terrible.\nForgot order, long wait, while others are called on before the","useful":6,"cool":3},"bUMYk53qU67P6HtuG8tdrg":{"text":"Ordered a $19 fried eggplant platter, got 4 tiny strips of eggplant that should have cost ","useful":0,"cool":0},"JjCXTWokY3PXpk5zZN_YBg":{"text":"We stopped in here spur of the moment. When I sat down I immediately noticed the table was","useful":1,"cool":1},"l273zIQ6MG4BPMn8UKeAIQ":{"text":"Great food. We had veg platter, falafel and lentil soup. Lentil soup - simple, delicious c","useful":0,"cool":0},"cXuyDYG-6Mq2kJXNurfRHw":{"text":"Super friendly service and quick, satisfying Mediterranean food. My favorite thing was the","useful":3,"cool":0},"gXbJ1o9KTu_EewhVC6ssqw":{"text":"The food and service is incredibly good. Very authentic Mediterranean food, and a great va","useful":1,"cool":0},"O5FC7RH_MD6ZlqYxYeZjGg":{"text":"Ok...from the outside, no go.  But with all the glowing yelp reviews and proximity to my h","useful":0,"cool":0},"LAE-kNjtCT4VDwnouMfY8Q":{"text":"The food was decently priced and came out quick.\n\nI had the stuffed grape leaves and spina","useful":0,"cool":0},"xq4b_PY6cKOmBJI2si3irA":{"text":"This was an amazing food experience. We were tired of eating cajun creole food for 4 days ","useful":0,"cool":0},"u5izqmI-S3zkYzof5GDrjg":{"text":"The food is great, not like a traditional restaurant but well worth it. Will definitely vi","useful":0,"cool":0},"9VCU2WaSdE0LFUV431vrxQ":{"text":"Stopped here late last night and just wanted some fries & baklava. Their baklava is really","useful":0,"cool":0},"Oi4OH2r-aJolxezt51YeJA":{"text":"Great food and best of all open all night. I really enjoyed the hummus and chicken kabob","useful":1,"cool":0},"2Fa3r5dIBx1zQa-c_Sk6Fg":{"text":"The food was amazing, and the presentation was beautiful!!!  The place and food presentati","useful":0,"cool":0},"NawuSJAlj62UnpDydBiIDg":{"text":"Staying at a nearby hotel on business, needed a quick bite and this more than did the tric","useful":0,"cool":0},"YXqMMB38d6-3OJXkgpU0ZA":{"text":"Doesn't look like much from the outside, but I'm glad I gave it a chance! Food is excellen","useful":0,"cool":0},"aaI_RKASgFcAkX345468qg":{"text":"My review may be somewhat biased because I live in the neighborhood and was absolutely thr","useful":5,"cool":1},"Jn5IpKsQ4mDFau6uY-H_SA":{"text":"Amazing spot, the food on another level, try the falafel, hummus, shawerma and baba ganous","useful":0,"cool":0},"yRSFZ2juTmgvv0cWEutjyQ":{"text":"I heard good reviews of this establishment from friends. We walked over the Orpheus Theate","useful":2,"cool":1},"UBqHJEouT8yEJtXMA4ykCg":{"text":"For real this place is tits. All the sodas you could imagine. Great staff behind the count","useful":1,"cool":0},"jyfXiZHLZVp8GYI_cUHr9Q":{"text":"The food is absolutely delicious, but the service was terrible. If you're gonna eat here g","useful":1,"cool":0},"5jnYm98B74Xo-pB3FVkc1Q":{"text":"Cleo's was delicious! You can tell it's authentic and the fact that it's attached to a gro","useful":1,"cool":0},"W_bBf6aK5j1GLDjfwWGVkQ":{"text":"Fantastic Lamb Shank for next to nothing with the best presentation i have seen. Not to be","useful":0,"cool":0},"mdbOcdjSA28toJ3CtCYwSg":{"text":"Just like everyone, we just read the reviews and hopped in to this place. The good reviews","useful":0,"cool":0},"ToRYYJaLhr3SUAYYNeV5Sw":{"text":"The food was very good; cooked by Ashraf. The red lentil soup was especially good.  Sam, t","useful":1,"cool":0},"z0ANjcUzo34oj1PemaHY0g":{"text":"Kind of weirded out by all the good reviews. I can't believe they call the tiny thing I wa","useful":1,"cool":1},"WV0AjdU04mFgyQCZQhzt8w":{"text":"The chicken shwarma was in point! Also, the Baba Ghanoush is a must try! I have gone and e","useful":2,"cool":0},"YfrE4HFX07XEfYGaQcBFpQ":{"text":"Service was very good\nGyro plate /salad/hummus presentation very vibrant and tasted fresh.","useful":1,"cool":1},"frqTc4dwTuaBQ2Op2Y037w":{"text":"This is an interesting spot is a little restaurant inside a convenience store. Awesome ser","useful":0,"cool":0},"8UmOR7D4HwhAovLSutalaA":{"text":"I read the reviews and decided to get something to eat at that place. While I was waiting ","useful":0,"cool":0},"AcvYAC0UPju9iV5r1gi_Kg":{"text":"Tried this place for the first time pre-symphony last Thursday and was more than pleasantl","useful":0,"cool":0},"hl8b3tOL1ZGeuvH-kN16fQ":{"text":"I absolutely love this place. Order at least once a week Everything from the fried Libby, ","useful":0,"cool":1},"ciUu1YgHAsxK5YBVF_IicA":{"text":"Fantastic. Recommend the Gyro wrap. Really tasty gyro meat, made in-house. Nice service. A","useful":0,"cool":0},"PkqLLVO6Oz1XDgf_ekT7CA":{"text":"Excellent meal served by kind staff. We had the vegetarian plate and grilled haloumi. High","useful":0,"cool":0},"KkhnLVXkEjjiIrS3r0EgXw":{"text":"After the workout I had a couple hours earlier, it left me, unusually, wanting something l","useful":0,"cool":0},"8k0jjz7ltWE33dWZgIgaWA":{"text":"A hidden gem on Canal!  If you are looking for really good food at 4 am, then Cleo's is yo","useful":0,"cool":0},"Z6SFVpXU4EgPplvbT8Gbrg":{"text":"Unbelievable! ! you might be threatening from the owner if you complain or leave a bad rev","useful":6,"cool":0},"u5MRDQb2tizLpNNevZQZEw":{"text":"When I come to NOLA, this is where o like to go. I get the sautéed vegetable platter with ","useful":1,"cool":0},"RPFwEGtlzd3WC3WXdlbSSw":{"text":"Cleo's is part kitchen and part convenience store. This was my favorite spot to snack at d","useful":0,"cool":0},"qx5uD8hnexGkgNhJsDrD-g":{"text":"This place was a let down. The food was OK, and maybe even 3-stars worthy. However, portio","useful":1,"cool":1},"aPfRHwaW0kow8d1SwOHq1Q":{"text":"Absolutely one of my favorite places to eat here in New Orleans! The staff are absolutely ","useful":0,"cool":0},"-Ds3eGZFZuvSPJPCjYmUUQ":{"text":"This place is a rip off. I was overcharged and swindled. $48 at a quick serve restaurant f","useful":0,"cool":0},"hIRvI7kL7m8QP5mNe7NLFg":{"text":"I placed a to go order and went to pick it up 40 minutes later and they hadn't even starte","useful":1,"cool":0},"VcWOlmEVamSh11nz4G5Maw":{"text":"One of the best eateries we have found in the area. The food is amazing, the owner was hel","useful":1,"cool":0},"hb39L8ZUQCjdEO9UwisRqQ":{"text":"First of all, the food at this place is phenomenal. What was not up to par was the service","useful":0,"cool":0},"SMpzt3iSFb-iu2EBlYTOVw":{"text":"No idea how they have so many stars. They were rude to us when we walked into the place, r","useful":3,"cool":0},"1zv4B2fobV42FMSo5kYM7Q":{"text":"Great Mediterranean food! \nI never expected to find delicious/authentic Mediterranean food","useful":0,"cool":0},"qaywT3-xuZ-fEqd5AaOmbA":{"text":"Love this place and the staff! So delicious and so friendly and so accommodating! Thank yo","useful":1,"cool":0},"OP0DjVXueHwaO6DX7nJe1Q":{"text":"Here is my story:  I live in Wisconsin, and I visited NOLA for the first time about two ye","useful":1,"cool":0},"nlbpkluU1ilzcXvqF6o_KA":{"text":"Food was ok but they forgot the tezikki sauce and wouldn't delivery so I had to go get it.","useful":1,"cool":0},"CHouIqvnxFPz6HzNNyRi7Q":{"text":"So wonderful! Where I live we don't have any dine-out Mediterranean options so I was reall","useful":1,"cool":0},"wEMga76JmnajWUJiSNFLoA":{"text":"Really good! I got the beef kebab with rice and hummus! Everything was fresh and welll fla","useful":0,"cool":0},"9G7_u832pOIGSIO8RZFuaQ":{"text":"So fantastic. Don't let the curb appeal fool you, its one of the best restaurants I've bee","useful":1,"cool":0},"B1RpskR3WTrIn1uUrfS8lg":{"text":"Best things about this place is that it is open 24 hours, has ample seating, and they whip","useful":0,"cool":0},"uvbVZiVoTkMfIFZ_FZe8PQ":{"text":"Was in NOLA for one night with family and found this place off of Yelp.  Was surprised to ","useful":0,"cool":0},"GgH-vGjdThQevVYXpIjhmQ":{"text":"I'm going to call this a hidden gem hiding in plain sight.\n\nI'd driven by here a 100 times","useful":2,"cool":0},"Ub_929FVpWXNuWAIDf4p3A":{"text":"What a find.  It looks like a whatever convenience store from the outside, but when you wa","useful":1,"cool":0},"1VX41_xEWoUYi9MXIsUuYA":{"text":"This food was incredible. We ordered the combo kebob and veggie platter. The gentleman tha","useful":1,"cool":0},"rg9YO8dEqC95mmmLAFTMfA":{"text":"Amazing Mediterranean cuisine! The hummus is the best I have had, and I have tried ALOT! T","useful":3,"cool":1},"EuBLrDSxy3a3L1SpUy5cMQ":{"text":"Local place, cheaper prices with great presentation. Spinach pie is great! Stuffed grape l","useful":0,"cool":0},"j-RzkuSFfFyV43_-WEtgqA":{"text":"I was visiting NOLA for my family reunion weekend.  My family and I grew tired of the trad","useful":0,"cool":0},"BVdBHGhJ8g48D81aBE5Ljw":{"text":"Came in for lunch today with a friend.  I'd been curious for a while because I'd heard and","useful":14,"cool":9},"0bRUs5a7daK_UVfNQThS5Q":{"text":"I really should have reviewed this place sooner. I have lived in the CBD since 2013 and th","useful":1,"cool":0},"OQ4ER4XVpOF-U4wP7j6N1A":{"text":"I actually hate people that Yelp but I had to come here and say something...When I tell yo","useful":1,"cool":0},"e4U48d767zOkLmOMdasztg":{"text":"Just ordered a chicken salad but the menu looks great. Salad was super yummy and they guys","useful":0,"cool":0},"oGf0IVw9kYvMLiS74Ek2kw":{"text":"This was BY FAR THE BEST food in New Orleans!!! Everyone talks about eating Creole this an","useful":0,"cool":0},"G1AHKNkp0-H6Qzg3S7sK3Q":{"text":"Food is mediocre yet reviews will make you think it's better than it is. Staff is incredib","useful":0,"cool":0},"6Dy-Zo1Kf2uu-53OaFULRg":{"text":"Best Middle Eastern food in the city! These guys know what they're doing with wonderful in","useful":0,"cool":0},"iHcN-gV6nQ_Qp5InynsfTA":{"text":"Good presentation, Incrediblefood at this place. It's across the street from Roosevelt hot","useful":0,"cool":0},"F0WOQi5nvJnkSYc0xiLx5w":{"text":"Good Middle Eastern... Being from Detroit (the Metro Detroit area has the largest Middle E","useful":1,"cool":0},"9oCHt5eMCWMGn4KNUwK9uw":{"text":"The best Lamb shawarma I ever had!!!  The 2 men cooking it are so friendly!! I'm visiting ","useful":0,"cool":0},"C3lYtUsOYNo2Zyxx6J88sw":{"text":"Fantastic meal!! Good food presentation, plentiful and food full of flavor. Staff is very ","useful":1,"cool":0},"jOoTkYn1PuSgv1fIH-cdSw":{"text":"Tried this place for the first time pre-symphony last Thursday and was more than pleasantl","useful":1,"cool":1},"1dPcmc47XaUNewXOe2loUQ":{"text":"I've never had better falafel! Beautifully fried on the outside, and moist on the inside--","useful":0,"cool":0},"luWbrUuoByyWMazSFWUQ-Q":{"text":"This place is great. If you like Mediterranean food then you absolutely need to try this p","useful":0,"cool":0},"gyOvV8sD0k3vU9HKR5Sxbw":{"text":"Hands down the best Mediterranean food I've ever had. Fast, clean and fair prices. Service","useful":0,"cool":0},"VjrvnI88wHE1usHF5l4-Xw":{"text":"When looking for a late night snack late in New Orleans, this is a great stop. We stopped ","useful":1,"cool":0},"uy_AWnNfaVdUHuVdLFc-Sw":{"text":"It really is in a little corner store! My friends ordered lamb and gyros plates. I wasn't ","useful":0,"cool":0},"TeNVqxkawsj6FmS7x2gAzw":{"text":"Delicious, beautifully prepared, great vegetarian options!! I got the vegetarian platter a","useful":0,"cool":0},"mPlf_gHP5bEW7o3dUdh_QQ":{"text":"Hands down the best Middle Eastern food in the CBD and Quarter. Place is clean but still h","useful":1,"cool":1},"uWtGbmcJhbmGoiwAsmxidA":{"text":"in love with all this food. all the falafel all the time. excellent service","useful":2,"cool":0},"VR704cCjBvlYSmdmZKzK1A":{"text":"This is not your average corner store...it's also an amazing Mediterranean restaurant! I l","useful":2,"cool":2},"KDt-Q0k8xuprQxkzS4DzMQ":{"text":"The food here was good, but, like most of NOLA, overpriced. I had a gyros sandwich and dri","useful":0,"cool":0},"euHDPHfpty-RR4ZrlYjLIQ":{"text":"The best Mediterranean in New Orleans. The food is absolutely yummy and also of high quali","useful":0,"cool":0},"IKy8iqMu_V5P4olewiPvSg":{"text":"The best boss I ever worked with . He was a boss a friend a brother I'll never forget this","useful":0,"cool":0},"pf28yQmk9TiKpTkXjELaUA":{"text":"This is a wonderful place. Prices are low. Quality of the food is very good. The Bhaba Gha","useful":0,"cool":0},"CJrF4RUR6BdekFv4glDbjg":{"text":"Live in the quarter... walk past this place often and finally decided to give it a try. To","useful":0,"cool":0},"qjYaoe6C15AHLcfbvFiA7g":{"text":"Prices are reasonable, food is good, service is fast & friendly, place is clean, & locatio","useful":0,"cool":0},"49LMLr_H6OxKDEbREAon3w":{"text":"Dirty but decent. Everything is fresh. Got the veggie platter, which was good but nothing ","useful":1,"cool":0},"KQYzWfPhBncF4MeS9cEoTQ":{"text":"I'm so picky with Mediterranean food and this place was definitely a hidden gem.  Would wa","useful":0,"cool":0},"R2TiRdekCjGdmyDU1Hex7A":{"text":"I woke up in the middle of the night hungry so I left my hotel room for a smoke and a bite","useful":1,"cool":4},"fFKIsc6CEYgm8wBX6-Byzw":{"text":"A must try. Open 24 hours and the food is amazing for being right in the thick of the city","useful":0,"cool":0},"VylzNFgGTO09kX7Nhfc3Rg":{"text":"We heard about this place as a recommendation from a bartender up the street, and i though","useful":0,"cool":0},"ZtC3_iIbPftzSf-lINoc9w":{"text":"Unassuming storefront since it's located at the back of a convenience store, but don't mis","useful":0,"cool":0},"UP7jUqZhI7zWjlODeG1KjA":{"text":"Five years later and a new location and I am pretty sure this the best food in the city of","useful":8,"cool":3},"91oD5fBq8hXgq-k-nJH2vg":{"text":"Cleo's is definitely the spot!  I really enjoy gyro schwarama and this place really delive","useful":1,"cool":1},"RD-S6nwt9D2s_5ujndgI1A":{"text":"Cleo's, oh Cleo's. How do I love thee...let me count the ways. This is my go-to place for ","useful":2,"cool":0},"2N1-HzjfTmDxyKwQ0kSlWw":{"text":"After coming highly recommended from my friends I was excited to eat here. Super close to ","useful":1,"cool":2},"WtgCDk2zoLHlva_Dq0jelA":{"text":"I came here for a late night dinner and was so excited to eat some mediterranean food!\n\nTh","useful":0,"cool":0},"NFBw2rkptxN87xrgpkUBeQ":{"text":"Let's see, great food, open 24/7, extensive menu, good prices, it's right across the stree","useful":4,"cool":2},"Jxmqg44TAY8MpfhfMVn69w":{"text":"As are many Middle Eastern restaurants, this is a great place for vegetarians. We had the ","useful":1,"cool":2},"t1LG-b-OD0ZaQrveFncGJA":{"text":"Looking for a restaurant that would cater to my vegetarian diet and husband's desire for s","useful":0,"cool":0},"PB9aqJt9VhhMmFEhqvK3ew":{"text":"I am so conflicted writing this review. Why you ask? Because the food is soooo good. Ridic","useful":0,"cool":0},"yKBK_gwNHCXP-_0TDt0BCQ":{"text":"Good place for late night food. Open 24 hours except the occasional time they close to cle","useful":1,"cool":0},"DJ7wrav0kLC1ovQotyOY-w":{"text":"Where are vegan and visiting New Orleans so we decided to try this place out the food was ","useful":0,"cool":0},"R_AYe7yJlzhRQcLN-YIumw":{"text":"Wow! This place was great. We were a little hesitant when we walked up bc this is also a c","useful":0,"cool":0},"X8aVg3aKNfZtjR7sxGhuuA":{"text":"Absolutely amazing!!!! Def was skeptical of eating here HOWEVER the food is AMAZING! The o","useful":0,"cool":0},"C0oiDqpkldXvtp8k3Iy-Mg":{"text":"Very much enjoyed my meal here! I ordered the sautéed veggies with basmati rice and added ","useful":0,"cool":0},"DVhbf4JkQiMgPBXnubY4FQ":{"text":"Weird space and vibe here. It's a convenient store mixed with a restaurant. Our server (th","useful":0,"cool":0},"K2ZSMlPEas3hAjXJ3wJ1mw":{"text":"Pretty decent Mediterranean food (i.e. really good for New Orleans).  Dishes are a little ","useful":0,"cool":0},"9xTebPiwLaL5AF5mz36Q5A":{"text":"What a gem! Service was great but the star is the food. Get the chicken teeka. Moist and f","useful":0,"cool":0},"i0wi1GuyQyDMMndkWhHZlA":{"text":"I went to Cleo's for a late night bite and I was very impressed. Great food, great service","useful":0,"cool":0},"Cj8McL-mCVB7vYx5pxLuUg":{"text":"Wow this place. Open 24 hours, and the food is LEGIT. A healthy alternative to the crap av","useful":5,"cool":2},"R2SWCGusP20TlcdKn1UuxA":{"text":"Amazing. Healthy, indulgent, delicious. Absolutely amazing. Every time we come to\nNOLA, th","useful":0,"cool":0},"Sfjt9OI9evTBhyikSeeCNA":{"text":"Delicious food with great flavors.  Clearly made with passion and love.\n\nCame in for a lig","useful":0,"cool":0},"ZopPjz1FApvlg1VRPtMeOQ":{"text":"I been to Cleo's a few times. It is my favorite Mediterian place. Reasonable price great f","useful":0,"cool":0},"5HGoz2ERVOfD5adJNDPfrQ":{"text":"Okay, I mentioned before that I am always looking for the best falafel. The falafel at Cle","useful":3,"cool":0},"cag9Y5zUc9yfg-axIZqnhw":{"text":"Food is very good, but sitting in a convenient store was a little different for me. I real","useful":0,"cool":0},"7DECiMvmYc7aYAh-nceaAg":{"text":"This is a market with a food place inside. The hummus was really good. The Gyro was made f","useful":1,"cool":0},"c7ixK_dxzt1hjJIWVrc4yw":{"text":"We were trying to find something different to eat near the French Quarter and passed by th","useful":0,"cool":0},"10Ns8yyjt9VI8c0dYMJTzA":{"text":"We went here reading the raving reviews of the place. Its an unassuming place merged with ","useful":1,"cool":0},"xLVP5scs71QullD3mxcPwA":{"text":"This is a GEM tucked slightly far away from the regular 'spots' where patrons would go for","useful":2,"cool":2},"W6BVdJC3MMDSpdN1MDGjLw":{"text":"Some of the best Mediterranean food I've ever had in an unassuming convince store on canal","useful":0,"cool":0},"KUkD3fmFEgWFwbGSV_0yPw":{"text":"Word! It's good Mediterranean food served at all hours of the day and night. The lamb and ","useful":0,"cool":1},"F3W_CmyDd-Xcy_5AwssKHg":{"text":"Walking in, this looks like just an afterthought for the convenience store...nothing could","useful":0,"cool":0},"vudyMXnKGWqVP6m1ilp9NQ":{"text":"what an amazing place, pleasant environment, welcoming staff, great middle eastern food, f","useful":2,"cool":4},"aakfAvk7FnQMZ-TsXdEMvQ":{"text":"Great food, fantastic service & all in a little  corner store. I'm not sure people realize","useful":0,"cool":0},"uwUA44H50ooOMgiQ3Se3zA":{"text":"I will give this place five stars for the food; but I would give it one star for cleanline","useful":2,"cool":0},"c2Jrbuoq3CStobYqW72Brw":{"text":"Stopped in for a quick bite! Glad I did, baba G was out of\nThis world and the grape leaves","useful":0,"cool":0},"eOUcchM_hgv5Zb0q4qgvSg":{"text":"I seriously created an account simply to express my disappointment with this place, it was","useful":1,"cool":0},"ouBJs7v4S8HImIoJEjyVQA":{"text":"This place is the ONLY international snack-joint that not only includes dope Asian candy, ","useful":1,"cool":0},"Z2qdI_Wsi7aV8ZZBcoOm4g":{"text":"Never fancy always super solid and open when you crave great food. Service is perfect for ","useful":0,"cool":0},"DRdp8_3AEB9G3TikEJREWw":{"text":"Food was outstanding and service is great!! We did combination platter and it didn't disap","useful":0,"cool":0},"0kSVs7p7SCplm6gmj772VA":{"text":"I just ate here and i'm still hungry after paying 17$ for food. Never going back. I ordere","useful":2,"cool":0},"WdUDbl6xe4wyQB8ijGenGw":{"text":"This place is a short walk from Loyola Ave, and is a cross between a grocery store and a r","useful":2,"cool":0},"Qy3_LmmyWWHC0jnkyDxJAQ":{"text":"Solid Mediterranean food, moderately priced made efficiently. And the hours are great for ","useful":0,"cool":0},"OL5C-ryMZTL0w7Wa334Z6w":{"text":"Small restaurant located inside a convince store. 24/7 option for any night owls. The rest","useful":1,"cool":1},"OuxcOJfZRrqndOHrneDD8Q":{"text":"In light of the response below, I think it's fair to drop this to one star.  They're still","useful":0,"cool":0},"p3yPcQFxYFTWzYJ2cqED7Q":{"text":"This place already has great reviews, but I just wanted to mention a few things:\n\nThe humm","useful":0,"cool":0},"yTK-WrFRnxnA_j-bgq8eEQ":{"text":"Two brothers from Egypt by way of NYC have created a great 24/7 Mediterranean haunt with a","useful":4,"cool":1},"oQzzUJ4D4dj8T0ZLMvvTyA":{"text":"Went here for the first time last night- friendly service and great food!  It's so nice to","useful":0,"cool":0},"ImJs6IlIvyR6J8NYkQZmMw":{"text":"Good food at reasonable prices, this little place tucked inside a convenience store is a s","useful":0,"cool":0},"4hkFQ0HYaYgwc_vBtm_deQ":{"text":"Now let me say... when you walk in it is a little shocking to see a convenience store in f","useful":0,"cool":0},"KQ1vDsuzsaJfQyfkUVNjEw":{"text":"Simple salad, spicy dressing.  Missed the pickled vegetables, but good pickles. Order was ","useful":0,"cool":0},"7U_2fiQhQRf96axTHBXopQ":{"text":"Good service, and a huge variety to choose from on the menu. My favorite were the meat gra","useful":0,"cool":0},"yBkDYcspQrOhjN2IE07GKg":{"text":"We ordered chicken and lamb shawarma, Tabouleh and hummus from them. The manager went out ","useful":0,"cool":1},"CrNPnet_voOHu33WVuPBUw":{"text":"I know since you're in NOLA you want to eat gumbo and crayfish, but if you disregard this ","useful":1,"cool":1},"07BGpT0E30Nd2Y8fumKFtQ":{"text":"Doesn't look like a restaurant when you pass by . It's a connivence store with a restauran","useful":0,"cool":0},"aGTKgwKPQ2-yI0Um4KrQ0Q":{"text":"The dude behind the register had an attitude when I told him my order i was there to pick ","useful":0,"cool":0},"bSKQNGAqYkoPgss2-5nv8w":{"text":"this is a little restaurant inside of a convenience store. you can sit and eat or grab it ","useful":2,"cool":0},"FCwfNKSHV1etZpkz_h9OWw":{"text":"When we arrived just realized its take out order only. Due to covid. Its 24 hours.\nRestaur","useful":0,"cool":0},"gYWJB_H62U0E8Nl3cDtftA":{"text":"Late night to-go order and after walking back to hotel to enjoy sautéed veggies in rice di","useful":0,"cool":0},"kALz7BelxNfK2kJLs3KLuQ":{"text":"This place was really good. The baba ganoush was excellent. We had shwarma, very good. Pla","useful":0,"cool":0},"Y79_lwA1IbMOJwXkC9fsqg":{"text":"We were just wandering around and happened on this place. It was the best meal we had in N","useful":0,"cool":0},"TGlOPMH1jYoWtlbLfUW7Cw":{"text":"I hesitate to post such a negative review, but we had an awful experience. I ordered onlin","useful":1,"cool":0},"CZmwtUXRC7tWQvOllbsuWA":{"text":"Nice server ! Attentive and laid back. \nThe food was very good. I got lamb kabobs, pita br","useful":1,"cool":0},"_xbrI6jWvjYNPWYnyYczNA":{"text":"Late night bite after work and it pretty decent! A small little convenience store on canal","useful":1,"cool":1},"ed_347RpCu6mAxr2yXuiNQ":{"text":"Horrible service every time I order over the phone and go to pick up my food my order is m","useful":0,"cool":0},"SfnEY5diP3ZBI084gFNyTQ":{"text":"The food is excellent! I got the lamb shank, which was fall off the bone tender and flavor","useful":2,"cool":0},"T1rBqWEW0plvhrzFh5ONrA":{"text":"Cleo's is my go-to for middle eastern food. It's always fresh, always delivered fast as he","useful":0,"cool":0},"wB7nA-gtqyKL3xUiCNCI_Q":{"text":"Ordered through door dash while staying at a nearby hotel and while decent, didn't find th","useful":2,"cool":0},"fa0RTL0oQWcNQrST1Li1RQ":{"text":"The food is excellent! I got the lamb shank, which was fall off the bone tender and flavor","useful":0,"cool":0},"2AHkgusphzY-_jtqy-yhng":{"text":"Excellent place for great Middle Eastern food in NOLA, right on Canal street. Fresh items ","useful":0,"cool":0},"34djYaNkx31_FuVfATU8Ag":{"text":"Best Mediterranean food in town! I had ordered at the hospital a bunch of times (thank god","useful":3,"cool":1},"wESMKA1g6eBv9-dR5GfXPQ":{"text":"I was pleasantly surprised because it looks like a regular corner store. With the wonderfu","useful":0,"cool":0},"YbDx_YcaCQth-jIGDcqvEg":{"text":"Lovely meal! Pickup was super quick and the staff is friendly. My three kids and I demolis","useful":0,"cool":0},"FibSbB17y_CdqNxdObTM5A":{"text":"Convenience store that also serves food. Food is good, though somewhat over salted, but th","useful":0,"cool":0},"JOoteFJzEto3RhEV86mKmw":{"text":"We ordered a couple items off the menu: falafel platter and grilled vegetable platter with","useful":0,"cool":0},"25vmYYRzQMDgXs1DpGELNQ":{"text":"I honestly love the setup of this place. Front half has drinks and snacks like a convenien","useful":0,"cool":0},"jl_v9DQGFwvuEBOnLoCHNg":{"text":"Came across this on our last day in new orleans since it was close to our hotel. I ordered","useful":0,"cool":0},"NFt5AW6uSpnicTGfVFj9-Q":{"text":"So so so good\n\nHad the avocado salad + mixed vegetables + spiced fava beans + cucumbers\n\nS","useful":1,"cool":0},"bkbMXtsvkP2E2HM8Fcgzvg":{"text":"If I were rating Cleo's on it's food alone, I would give them 5 stars. Great presentation,","useful":1,"cool":0},"NNcuydccqKF-X_-Cuk-vxg":{"text":"I was in New Orleans for a total of 4 days and 3 nights & I found myself coming here for 2","useful":4,"cool":0},"Ryx8HsCKokASV8eH2aIqDQ":{"text":"No joke: this convenient store/Mediterranean cafe is legit. We had just flown into town an","useful":1,"cool":1},"NZEwxTqjN93WqaQzUDT1Lw":{"text":"I love cleos! I've been going here for years. The gyro & chicken shawarma plate is my go t","useful":0,"cool":0},"pWFPUrj_xuLRnWeQqiVp7w":{"text":"EDIT #2 (and final, I mean really, could you be more childish?): The one smart thing you'v","useful":3,"cool":2},"Vj-9xvvAgK3aPkki06i57w":{"text":"Okay food but not enough employees to accommodate guests. The employees in the open kitche","useful":0,"cool":0},"RXk_lRFALL_EEYkOwEIxkw":{"text":"We had the chicken shawarma on a night of adventure around the city of New Orleans. It's n","useful":1,"cool":0},"V4qGqZwUjgPASzjpv835OQ":{"text":"People who came in after us got there food first & we waited over an hour for our Togo foo","useful":0,"cool":0},"2Au7LsaT3ZgDOZQ5HQUXgw":{"text":"Best Falafel in New Orleans for less than four dollers. Holler.","useful":2,"cool":0},"7sK7tLdQTXUqrDZurBC3ZQ":{"text":"I was visiting New Orleans and searching for a restaurant that served vegetarian food that","useful":0,"cool":0},"Vb4X_GU4prf6Mrg0XdmYnw":{"text":"The food was amazing I had the chicken shawarma multiple times and it was very good. Howev","useful":0,"cool":0},"iL_RLjD8WUijwGOctMf2qw":{"text":"i had the four lamb chops lunch. it was delicious and a bargain. \n\nthe store atmosphere; n","useful":0,"cool":0},"bh4BzaSK5UrzeBD0pUkjAw":{"text":"Cleo's has progressively gotten worse since Covid. I recently ordered a chicken shawarma a","useful":1,"cool":2},"Bx3ST2NBmLXN__FUtiX3ww":{"text":"THAT FALAFEL WILL SET YOU FREE CHILD: yes it's just a fried chickpea ball, but their house","useful":7,"cool":2},"a9fq3Jbjy8NC5KOLdNnLLA":{"text":"Last day at NOLA :( \nAnd we decided to try something else. \n\nI had always been a huge fan ","useful":3,"cool":3},"aTAO1edPWvlYozwDoNSfqw":{"text":"Still the best Mediterranean food in NOLA! If you're tired of Cajun/Creole (if that physic","useful":0,"cool":0},"Bq4tAzvkFAuffDn7gOc2tQ":{"text":"Nice spot! Corner convenience store.!! Great place to grab a good meal or snacksChicken Ka","useful":0,"cool":0},"8qTImsn7Gs0Lh-6NmF1EOw":{"text":"We were visiting New Orleans for the weekend and after reading several reviews on Yelp dec","useful":1,"cool":0},"_dvpfFqvhxEzHnW06adUMA":{"text":"This is my ideal kind of restaurant. Probably would get me pushed in a locker by most fine","useful":1,"cool":1},"lH9pN3FkSPNgOqGue67T8A":{"text":"What an interesting lifesaver. \n\nWhen in NOLA, it's almost a requirement to eat and drink ","useful":2,"cool":1},"pSTJ-0HL4P78wy8rpLsPNw":{"text":"Disappointed! This is the 2nd time I ordered lamb chops and they gave me some nasty lookin","useful":0,"cool":0},"iAiMdmbNAZJzaHbbJMveFA":{"text":"24/7 YASS!\n\nThe food deserved way more stars, but our experience says otherwise. It's a in","useful":6,"cool":1},"40y1HoU6_eP7GvyV9uekRg":{"text":"The chicken and beef shawarma wraps are life. I love this place plus it's 24 hrs so whenev","useful":0,"cool":0},"l207cNq9bGY3z-GKP3afYw":{"text":"We just wanted a place where we could have a quick meal.  When we walked in, we didn't rea","useful":0,"cool":0},"JDP2pSF6iUZWjKqfiMsQ1w":{"text":"When I've been out in the downtown/FQ area, Cleo's is my no.1 go-to for late night food. I","useful":0,"cool":1},"ivylI1qhaH2d3zA6tRGALw":{"text":"What a joke. Come on this is New Orleans! So disappointing that was advertised as nice $20","useful":0,"cool":0},"7w7vuugB1IiFKtdg7fIDVA":{"text":"The salad I purchased was just okay. It cost me $4 to add not even half of an avocado. Not","useful":0,"cool":0},"2GUIeWR79JTGhw-F_ehJSw":{"text":"Yummmmm lol I just got this delivered to my home at 2 am and it's pretty good ! Hahaha \nGo","useful":0,"cool":0},"Yo4d17OBif3wsMn6a6CfkQ":{"text":"I thought my 3 star rating was FAIR, service is not great, setting is a poor design.\nLiked","useful":6,"cool":2},"ApZc7jsaNZdPjaIcb3mYmg":{"text":"Outstanding mezzo. Warm service. Slightly spicy relish added to tahini, baba ganoush and L","useful":0,"cool":0},"FznvaXzaDO66gXusi8Y9Zg":{"text":"My review isn't about the food or the taste.  It isn't about the service, as I ordered thr","useful":1,"cool":0},"iKY2W6OctSzxdL4iIruHRQ":{"text":"Never had a worse experience with a man behind a counter. He was so rude and flat out lied","useful":0,"cool":0},"GzebwXAOngvaT69b3rGo4w":{"text":"Got into New Orleans late at night and this was the only place open by the Moxy Hotel wher","useful":1,"cool":0},"x4VQZDsRY88exyv6iEtScw":{"text":"Great option for Mediterranean food at all hours. \n\nThey deliver to most of the CBD and wa","useful":2,"cool":1},"6AzudsjntADlgxpyIrEm4Q":{"text":"Pretty good middle eastern restaurant in the CBD! The chicken schwarma plate was very tast","useful":2,"cool":1},"URSH01XUNDNHpsuBtAW18g":{"text":"My absolute favorite place to order take out from. The chicken Kebabs taste like they have","useful":0,"cool":0},"dX2n-jVDUKpaUR-0jKsxyw":{"text":"The food was mediocre and did not receive what I ordered. Might be good outside of the pan","useful":0,"cool":0},"Ra5WRKQdBJFdo8EgBckWOQ":{"text":"My friends and I agree that this was some of the BEST food in New Orleans!  We went back a","useful":4,"cool":3},"obs5lybAs9je7r5W_t9Yeg":{"text":"The food is good, but the service was unacceptably rude. \n\nWe ordered two sandwiches, but ","useful":5,"cool":1},"CWKZhCuuYnyeOm9eAZRepg":{"text":"This is a great place to eat and the pricing is perfect.  Jessica is a great server.  This","useful":0,"cool":0},"bBJ8FAB71mQplA7PDLR39A":{"text":"Some of the best Mediterranean food ever only place I'd eat at with this type of food very","useful":1,"cool":0},"WJkmd4gb3PvEivTrIAUDDg":{"text":"Found this gem via Yelp. Very close to my hotel. Ordered baba ganoush, haloumi and chicken","useful":1,"cool":0},"5cgvqU_L3v1uz6ge4i5qEA":{"text":"Okay so this place is exactly what you want from a convenience store shawarma place. We ca","useful":0,"cool":1},"kl5GPo6Qz37JINi-pkXgow":{"text":"After my past experience this weekend, I'll have to deduct a star. I called and placed an ","useful":2,"cool":1},"LvU0rs82hmh8xTMh1qTR7g":{"text":"Delicious falafel, great and fast service.  One entree can easily feed two people or one p","useful":0,"cool":0},"DikcX1QKUoOqemCo7mkfIA":{"text":"We had the hummus, baba ganouj, tabouli, falafel and dolma. The baba was the best I've had","useful":5,"cool":1},"uD9rKLXHtD4j-0ET7HM4kQ":{"text":"So glad we found this place. Great food. I had the veggie platter and my friend had the fa","useful":0,"cool":0},"lWeJJaaZEZ0B0tn_BwVJkQ":{"text":"Go here for lunch pretty often. Even though its kinda far its still worth the walk. Repeat","useful":1,"cool":0},"bvfs4-lInxRXEmHcPCSeZw":{"text":"Very surprised and impressed by this eatery! You walk into what looks like a convenience s","useful":0,"cool":0},"cGqGdj5IZdsONM4QP_alkQ":{"text":"Food was excellent. Hummus was very tasty and smooth with several pickled treats and olive","useful":0,"cool":0},"0ZaHWsEJyqcXBBFtwx7gIA":{"text":"Top notch Mediterranean food in the CBD with some of the best falafel I've ever had in the","useful":5,"cool":3},"twtVQCUODJoRRccO7shQsA":{"text":"I ordered this 4x within a 2 day span! Number 1 the hummus has got to have crack in it, th","useful":0,"cool":1},"i0yXvFnGAO3ZaZDcC37cZg":{"text":"So, I'm in NOLA with the family for a wedding. Our flight landed after midnight so it was ","useful":1,"cool":0},"1SmN-6W4et-CAJwyA1zL4Q":{"text":"The meat was not good. I ordered the lemon garlic chicken thighs (not the shawarma). It wa","useful":0,"cool":0},"UADoZdyun7UzZRTRwdm4VA":{"text":"Stopped into the new Cleo's location on Canal Street and the food is better than ever. I h","useful":4,"cool":4},"lKxv0S_crDcsaHcWAQyNfg":{"text":"This is a nice 24/7 convenience store/Middle Eastern restaurant.  Most of the food takes a","useful":3,"cool":2},"yq7mLYH7p_Bg0WIbCjEeXA":{"text":"I ordered through Uber Eats, and had I actually been in the restaurant, I would have sent ","useful":0,"cool":0},"C0RSXNXwHp0lC8_uSTapCg":{"text":"Don't let the outside of this place fool you. They stay open pretty late and the food is d","useful":2,"cool":2},"GLCKK1uRexsyVA62yKSYWA":{"text":"This place relocated to canal! Congrats to the owners for the new location. It is clean w ","useful":1,"cool":1},"5LQ9XPAWKQxhpNh8jxFelQ":{"text":"So, this place would be 5 stars if a full meal had not been left out of our order (not sur","useful":1,"cool":1},"iWm5EG2MqstaCz-LHGn6Gw":{"text":"YASSSSS TO CLEO'S!!!! I love this place and cannot wait to return. Although, I don't belie","useful":3,"cool":1},"f-MU_xloPK6OwSJFntwN-w":{"text":"This place is kind of a trip - it's a good convenience store with a large selection of int","useful":0,"cool":0},"k-Zc1VEqFiM1vGmYhR2NGQ":{"text":"Wow.  I had a good meal at Cleo's.  Some good ole Mediterranean food. Every recommendation","useful":0,"cool":0},"Evofm1KCDJHfzuOq0UQicQ":{"text":"This place is a total hidden gem. Don't let the appearance fool you. It looks like a corne","useful":0,"cool":1},"O_FYip0dGz90jSMUWEnrQg":{"text":"Late night bite and made to order.  After a day of drinking you need a place like Cleo's t","useful":2,"cool":0},"Wq6MLqUxPHRcIQCNY64a-g":{"text":"The eggplant wrap was really good (spicier than I expected, but that's fine). It's just a ","useful":1,"cool":0},"gds0mqT8ipVORgofFNEN0A":{"text":"We came here after a slightly drunken night. Yelp was not to the rescue this time. I have ","useful":1,"cool":0},"gCbSTFCNqqGx6mJhxTpKEA":{"text":"Came here back on yelp reviews for vegetarian food since the last few days I've eaten side","useful":2,"cool":2}}