{"FrUnB3FV3eICKiwbo9h75Q":{"text":"This was the worst experience. Not only was the lady unhelpful on the phone, she didn't no","useful":1,"cool":0},"VCusqC_KznfhbzhzQVcLog":{"text":"There's nothing like walking into a real flower shop.  That second or two when you close y","useful":4,"cool":3},"BUEXW38N7KRUss5HOwIrnw":{"text":"Our son's rehearsal party was Friday night at Rock N Bowl on Carrollton Avenue.  We embrac","useful":0,"cool":0},"NvQ9CHP8aIxluX_sh3b84g":{"text":"Adrian's Florist made three of the most gorgeous centerpieces I've ever seen for our Chris","useful":0,"cool":0},"SVcLZcuTb_d3NGeL8e5KFw":{"text":"I had a really good experience with using Adrian's for my wedding flowers.  I only needed ","useful":1,"cool":1},"O7XXpRi1GUMjFQnTmDSx3g":{"text":"So the store was easy to find and bonus the parking wasn't too bad. You will need to paral","useful":1,"cool":0},"SOQYXBYSgVTyoyeOkV-bdQ":{"text":"We've been out of the country for two weeks and arrived home to find out that a dear frien","useful":1,"cool":0},"6BBO9532t3h2mWcIg8SLzg":{"text":"I ordered a spring bouquet (see image) and got a completely different order ( see second i","useful":2,"cool":0},"YbQ8ClbFkTeiQsahDKEVQA":{"text":"My husband ordered me flowers from this shop online today. I am upset with him so this was","useful":1,"cool":0},"tTCfv17BJV73GUSs6Bzi4Q":{"text":"My sweet husband bought me flowers for my birthday and we're actually here on my business ","useful":1,"cool":0},"qacYU8KwnpusPOC7dpJhkg":{"text":"Very attentive, very nice people...Roses were gorgeous and fairly priced and the bonus is ","useful":1,"cool":0},"O6j8_0nIcLvkaEzWN9RHzw":{"text":"After a recent surgery, my parents ordered a floral arrangement from here for me. I'm not ","useful":19,"cool":17},"T_WaFG56Kg5uV3HKHbcqlQ":{"text":"I had a really bad experience with an on line flower delivery company but Adrian's cane th","useful":1,"cool":0},"ntQRVmoT0PXLtNAVFnmvow":{"text":"If you're looking for a professional florist that honors and respects your wishes with sen","useful":0,"cool":0},"nDzDAk0cUm_UXTb02fNeAg":{"text":"To was the worst experience dealing with them today. .... first off they didnt have or wan","useful":4,"cool":1},"jWnoKStdXNgSm9XASC_vGA":{"text":"I ordered 3 arrangements for my father in law's funeral, I was in charge of the flowers.  ","useful":1,"cool":0},"yKpV7lg4ZGzFowgmS3omQQ":{"text":"This is the worst experience ever!  I will not be ordering from this florist ever again.  ","useful":3,"cool":0},"h9bq_1eukNTUDukcO53ZnA":{"text":"The arrangement I received looked nothing like the one I ordered. Of the 9 flowers listed ","useful":0,"cool":0},"DB2NyxJF4e35kTcFBO_-eA":{"text":"Two weeks ago, I got married in New Orleans and we hired Lisa to do my flowers. When we fi","useful":1,"cool":0},"KUrLjFstZOpqybWpctLR1g":{"text":"I have ordered flowers from this company on several occasions. Today was definitely the wo","useful":1,"cool":0},"c-aQfTIRoB7Zb9Pc_nLxJw":{"text":"Adrian's Christian Flowers were the best! We had them do our wedding flowers. Their prices","useful":0,"cool":0},"MswBBwjgJJVBQr_aJrZNIA":{"text":"I'll never give Adrian's my business again. \n\nI placed an order via the website for my Gra","useful":2,"cool":0},"4BTFznvCd8IAV-476ZTmCw":{"text":"I will always use Adrian's now. My sister got sick and I wanted to send her a knockout arr","useful":0,"cool":0},"I8F7Jmjk13JownN0adSbFQ":{"text":"The arrangement sent to my neice today is AMAZING!  I've never seen one so beautiful and f","useful":0,"cool":0},"gQddgDwMr53bcflnPh8JXg":{"text":"Adrian's is hands down the BEST ! They handled my grandmothers funeral flowers and to say ","useful":2,"cool":1}}