{"9-dbGMG4w3uncW5vAwsiSg":{"text":"My husband and I came here once and we have been wanting to go back ever since lol !!  It'","useful":1,"cool":1},"JfvJjmzTV7e_ICXXtLrdIw":{"text":"It's good chicken but the line was kinda long which is no fun. But definitely worth the wa","useful":0,"cool":0},"9aK8oKfwsphUDaFDNMS2FQ":{"text":"These crawfish fries made our night. Stopped by on way to Pelican game and chef jeff out d","useful":0,"cool":0},"HZ_Jyn0fjrt_IHrLGvBu-g":{"text":"Gourmet in the ghetto. 5 stars for the food. I can not wait to go back. So I'll be going b","useful":2,"cool":0},"DCPJ8gumNOHPMEdjorwwhQ":{"text":"Second time visiting New Orleans and this is THE BEST meal I have eaten yet. The service w","useful":0,"cool":0},"SpMJU3X-FJGBtakP5ko24w":{"text":"Hole in the wall-- one table inside and two tables outside. But fantastic food! The super ","useful":1,"cool":0},"qIPNwT7P4YvFrjfCmJdkVQ":{"text":"OMGosh, the review is hella late but worth my time to go in and approve of their 5 star ra","useful":0,"cool":0},"xM1jxa-qLEABVT5bv9jF5w":{"text":"This review is overdue, but better late than never.\n\nMy girlfriends and I visited Heard Da","useful":0,"cool":0},"lWhctTMTWfC1XOjCy2iy_Q":{"text":"I am still drooling. His daughter took our order. She knew exactly what I wanted, even bef","useful":0,"cool":0},"AiJtj5nba8sR8txetE6zSQ":{"text":"We had and absolutely amazing lunch a Heard Dat Kitchen! We had Bassa fish with Crawdat Sa","useful":0,"cool":0},"Uwz7eNjcnxywDvaR1AHZXw":{"text":"First day in NOLA & this is our first meal here  and it did not disappoint! We got the Bou","useful":0,"cool":0},"BN8bEHftNM9zj4QdgcDc5A":{"text":"I finally made it! After months of wanting to try this place I swung by and grabbed the Su","useful":2,"cool":1},"jS4frRJU60zsC18D3MHqtQ":{"text":"Visited this place just because of a list that was going around about food spots in New Or","useful":0,"cool":0},"4ZVhIlVqSiW6neLoo8wTFg":{"text":"Superdome and Dat Shyt. This place was delicious. I thought I didn't like lobster, but now","useful":0,"cool":0},"BGcxv5BMwSWVqLV78wM-Kw":{"text":"This is a super late review, I came across the photos in my phone and have to share how wo","useful":0,"cool":0},"wMzqcvdF8O6xLlUyJlD8ZQ":{"text":"We were visiting NOLA and of all the meals we had during our visit, this one was our favor","useful":0,"cool":0},"xscm3QzArFBJdL1-Ny2NpQ":{"text":"Hands down the best soul food restaurant that you could ask for. Should be a bucket list f","useful":0,"cool":0},"NjFEeWNA37I-2N7xNrGGCA":{"text":"The best meal I had in New Orleans! This place is a gem and the folks that run the place a","useful":1,"cool":0},"uUchEW5I0MabNJ7LOWbckw":{"text":"This family owned and operated hole in the wall serves up some explosive flavors and world","useful":0,"cool":0},"ArdeGyEJ01mKTRnuonfg-g":{"text":"Try the fried chicken. Definitely the best I've ever had. The menu only has a few things, ","useful":1,"cool":1},"JDz9YxnmM_M_XRju3EqDQg":{"text":"So good glad to have eaten at this place the food was to die for . The family run restaura","useful":0,"cool":0},"SkHa45LPYizEUSTquuSukQ":{"text":"The people that work and eat here are as great as the food. Had the crab and fish special,","useful":0,"cool":0},"0C9E_MHybyIwNMcSd14EGQ":{"text":"I can not tell you all how many times I have been driving down Felicity and tried to figur","useful":24,"cool":19},"KXkB3DBCHBT4zTY-xda1WQ":{"text":"Okay so I heard a lot of hype about this place and how fantastic the food is. So I set out","useful":0,"cool":0},"KalUGICbdXbyyseLwBK1_w":{"text":"I usually don't give 5 stars. The food is delicious! Don't let the exterior turn you away.","useful":0,"cool":0},"2rAWpqzsQrnJNqZU3s4E-Q":{"text":"This just became my favorite place in New Orleans! And I've been around this city multiple","useful":1,"cool":1},"C2mwziKMGpaxe4OzZh0Cug":{"text":"This is our new favorite spot in New Orleans! We definitely passed it up while driving and","useful":1,"cool":0},"Pv9PcG8Lch-TwKpXMV3WQg":{"text":"Worth the trip. Chef Heard and his family put out an excellent menu with a lot of skill an","useful":0,"cool":0},"S7SINZFtow6ZUtvhyLp8QQ":{"text":"Food was A+.....its in the hood but dont let it scare you off...food is worth the trip...a","useful":1,"cool":0},"Zneg1GYmKajf_wY0_EEvrQ":{"text":"The food was unreal! Absolutely delicious! The service was also amazing! Love this restaur","useful":0,"cool":1},"jflnUBJswobYRO4nQoswlA":{"text":"I understand WHY they have five stars.  I felt like I was having a meal at my family's hom","useful":0,"cool":0},"uJ62cjIPm_NY1igb23Y0Cg":{"text":"The best priced Cajun food I've ever bought! I had the amazing red beans and rice with bla","useful":3,"cool":1},"rpYh-ccLzGda1MT3yYVBtA":{"text":"If you want phenomenal food and true southern hospitality, get to Heard Dat Kitchen. We go","useful":0,"cool":0},"Mq3stVPrHY7fLUy17beUVA":{"text":"went there a second time and it was as good as I remember it.  My daughter rated it as the","useful":0,"cool":0},"hhrlhMhV-iQgBqcBvEefOA":{"text":"Food was delicious and the people at the counter were very friendly! We got the surf n tur","useful":1,"cool":2},"wmG9vf_hLjBrGFkPOlhHJg":{"text":"If you come to new orleans looking for good food and you miss this place then, congrats, y","useful":0,"cool":0},"8dU18aL3CUO0MRRhc69Tyg":{"text":"Upon arrival, we were met by the chef and instantly introduced to the specials of the day.","useful":1,"cool":1},"BYcCi6JThYOPexs5-W0dcg":{"text":"Found this place on Yelp. Was visiting out of town and looking for something gooooood to e","useful":1,"cool":0},"KGPlaSzEWq-b89iBSCZ7fw":{"text":"I had the super done entree and WOW! This was easily my best meal on my most recent visit ","useful":1,"cool":0},"tVrlOQqAzE9hQS8pf7WrWw":{"text":"Came to this amazing place on a very rainy day.. walked up and ordered our food. The girl ","useful":1,"cool":0},"2lVGyg5id4HwGU2ZrfLADg":{"text":"Where do I start. The food was absolutely delicious. I had the fried chicken plate and it ","useful":0,"cool":0},"tdKl7ysXR5pG7O8nhlskvA":{"text":"Food is Fabolous comforting and most importantly it taste great!The seafood extravaganza i","useful":0,"cool":0},"oE1g3NYzyYdbYUr823lMvA":{"text":"We were driving through the area and saw this nearby. The food was AMAZING. I got the Seaf","useful":0,"cool":0},"JQ7fLFddS4wl5ZOzu1R0qA":{"text":"So driving up to this place my boyfriend and I were questioning wether this place was a re","useful":0,"cool":0},"MJsIITnV9vojuyg84dvPuA":{"text":"First time in New Orleans, and it didn't disappoint. Nyce was our waitress and she was exc","useful":0,"cool":0},"6uCd7WBsfHaSN7nOEFvDmw":{"text":"Good New Orleans neighborhood eating. It's in the hood but this is like ya grandmas Cookin","useful":0,"cool":0},"zALkhfvBnwJ6bLDSZ9M6rQ":{"text":"Since me and my girlfriend been here, this restaurant is by far, the BEST restaurant we be","useful":0,"cool":0},"WOfOHlP1TtE3ecNkRgLnLQ":{"text":"The food was delicious and very well prepared. Nyce was the cashier/greeter and she was pl","useful":0,"cool":0},"DWAZDHlIYU3NMIZkI1TrqA":{"text":"Easy to understand why they have five stars! I had the \"bourbon street love\" which was som","useful":0,"cool":0},"NDUsLzqajw8EwcMcvWtenQ":{"text":"The food here beats Commander's Palace, IMO.  Full of flavor, fresh and the best meal we'v","useful":1,"cool":0},"cvE-Teom_p8WDBMd5qNvQw":{"text":"By far the best spot we hit up while we stayed in New Orleans. I had the bourbon st plate ","useful":0,"cool":0},"LSAdOqx7x0uYbq45KtLvXg":{"text":"So good. I mean .... SO. GOOD!! A must go! Order \"dat fries\" for SURE! Take a lyft/uber/ta","useful":0,"cool":0},"papEmPlnCTE-zDZLYniGWQ":{"text":"This review is on the food and service only.  The shrimp & grits were amazing, and the bre","useful":0,"cool":0},"bf8ArRHVg68B04UrJZjf1Q":{"text":"This is a hole in the wall restaurant with little seating and great food. It would be doub","useful":0,"cool":0},"JBGNof2xXJ2CBbNS3mLr2Q":{"text":"Please try the blackened fish! What a treat this was. My fiancé found recommended we try i","useful":0,"cool":0},"EH4pc6Fy-pjr-DPbO9UIsw":{"text":"Was exploring and got hungry. Saw this place on Yelp and thought the pictures looked so go","useful":0,"cool":0},"8g941yqfJG07J-uUKJL9Tg":{"text":"Mac & cheese was good not great, but the serving I was given was way too small for the ove","useful":0,"cool":0},"RFOr_T8vYu5uU79sEiAipw":{"text":"Great food, great quality..Had the Superdome, crawdat fries, crawfish cornbread and skeesh","useful":0,"cool":0},"p7Yfab2jBf3Z5y84v9J6Lw":{"text":"U$er Eats order:\n\nO!\nM!\nGoodness!!!!\n\nPhenomenal food!! \n\nTrue New Orleans cuisine. Many t","useful":1,"cool":0},"bdGFaRDCa3YGmfKlSvoWlw":{"text":"Food was absolutely outstanding!!!!!!!! The waitress was very polite and kind and chef mad","useful":0,"cool":0},"nJbhTKea6QLpKkkHF-Eotw":{"text":"Great service, family environment, and awesome food. I like the fact that they serve the e","useful":3,"cool":1},"3-Dc72jaVhD8EjogxTWGrg":{"text":"Shrimp and grits were good and had a bit of a kick; however, the superdome, crawdat fries,","useful":0,"cool":0},"h1cVlUvh7zfoJ3dOnThnYA":{"text":"The crawdat fries was amazing. Better than expected tbh. Well seasoned and fresh and they ","useful":2,"cool":0},"mnHN4poCSh1dDibExWo1dA":{"text":"So glad we found this place on yelp and reviews where right on.  The chicken was so freaki","useful":0,"cool":0},"vvCQaGwsPZKeEhQzxuV7dw":{"text":"We vacationed in NOLA back in August 2018 so I purchased some Groupons for this restaurant","useful":0,"cool":0},"OpATcccRZUFQ-wify4XorA":{"text":"Visited this restaurant to get a real New Orleans taste. The outside look of the restauran","useful":0,"cool":0},"QJMJ6vWbixJ2nphgDdFdNg":{"text":"Just had the BEST meal ever in New Orleans. I had the Superdome. Very well seasoned, great","useful":0,"cool":0},"ilX_-cpSn4DSNgtxNSjZxw":{"text":"This is hands down the best restaurant in New Orleans.  You want real, scrumptiously delic","useful":0,"cool":0},"7aPrLIxPKpifBztvEstzow":{"text":"Found this place on yelp and it's a diamond in the rough for real. We arrived at about 6is","useful":1,"cool":1},"qkw7zSHihIMs2gciMiQf_w":{"text":"I went here with a group of friends for lunch. I ordered Superdome and it was soooo good! ","useful":0,"cool":0},"2mS8lHANeiI4Is0IEZQksA":{"text":"This is my 4th time in New Orleans, and I have to say this is one of the best spots here. ","useful":0,"cool":0},"ILjiuTehQqIAnRGhD2vDZg":{"text":"Came to Heard Dat Kitchen due to Yelp reviews and had an amazing meal. The place is nondes","useful":0,"cool":0},"b6tc7EVZxp8UwbRD-nK58Q":{"text":"Wow! The food was exactly as stated in previous reviews! Simply superb, I had the crab spe","useful":0,"cool":0},"-IDubmUXkucJo39EJvdDoQ":{"text":"I'm in love with this food. My husband and I were in town for the Raiders game. I found th","useful":2,"cool":0},"wFUuL480jiTHFyJ0K8wD3A":{"text":"A must whenever I'm in New Orleans! The food is made with love and you can taste it! Chef ","useful":0,"cool":0},"GCFHWBRH_GZRRkx-vdMgoA":{"text":"No need to look any further! You HAVE TO GO HERE! \n\nThis has to be the some of the best fo","useful":0,"cool":0},"MNJula3upOY9kFuM3-7P7w":{"text":"Wow - we come to NOLA for the food. We found this place on Yelp and it did not disappoint.","useful":0,"cool":0},"3f2QDQMo2Kvm-yk5L6s0Qg":{"text":"The food was excellent- fish with crab was as good as it can get. The bourbon street chick","useful":0,"cool":0},"xkQnu6ZBujgf3uwzr_pXZg":{"text":"We tried to go to Willie Mae's but there was a 2 hour wait so we came here. Sometimes the ","useful":0,"cool":0},"ueUfufDbW5jd_ToekK510Q":{"text":"Really good food, fast service and I suggest you guys to try the super dome its finger lic","useful":0,"cool":0},"PvZ3H35K4D7dB_hC5vakUQ":{"text":"Oh my oh my.  I've seen this spot on social media and was excited about eating here and I ","useful":2,"cool":3},"wegL7TP4k7gdfsOFP1k_sQ":{"text":"I love this place ..If you haven't eaten here you must be sleeping under a rock..#Staywoke","useful":0,"cool":0},"RbTHa97lE9pspoxp72uNqg":{"text":"Walked a mile and a half to get to this place from the French quarter. Well worth every st","useful":0,"cool":0},"mA1N8G5nDNATE3eh2_pEPQ":{"text":"Omg!!! The food is amazing!!! It's is a must when visiting New Orleans!! Everything was fr","useful":0,"cool":0},"iMiV19y9MgjgPW69de7YBQ":{"text":"When I tell you I am a picky eater and strictly don't dig in on the swine, this can be ver","useful":1,"cool":1},"42B0jPsa1rfCe0QixwYwnw":{"text":"Awesome awesome awesome food!!! Ordered the super dome and the bourbon street plates. Both","useful":0,"cool":0},"9J6LKeN5EeZh44U1gTJMlA":{"text":"Baaaaaby! Let me tell you! I nearly hurt myself eating the Bourbon Street Love and those C","useful":3,"cool":0},"IAhgRPyBCQiO7iPptONBxQ":{"text":"Lawd lawd lawd EVERYTHING we ordered was AMAZING!!!!!!  The statement never judge a book b","useful":0,"cool":0},"zhCKBLv08VwAjSxGHt8-Cw":{"text":"A gem in the middle of no mans land. Had the bourbon special: fried chicken filet, crawfis","useful":1,"cool":0},"hlme1Zzx2aZOCoYx0Tonwg":{"text":"The food here is absolutely spectacular!  Do not be put off by the location.  The food is ","useful":0,"cool":0},"D1KQLrQcKaAmgOeHJ6la6g":{"text":"The food here beats Commander's Palace, IMO.  Full of flavor, fresh and the best meal we'v","useful":0,"cool":1},"f2meT5RK5UPlBSQ5FPeGAA":{"text":"The food is phenomenal and the waitress Tia is great!!! Don't let the location and outer a","useful":0,"cool":0},"JTYdM3BXUrIRSH0nv2p_TQ":{"text":"A hidden gem with some bomb ass food! The people were so nice and welcoming. Will definite","useful":0,"cool":0},"gLW5d6H8vB1QA5Z2uzZ4cw":{"text":"In our search for authentic New Orleans cuisine from Black Owned restaurants, we stumbled ","useful":1,"cool":0},"pXbCGdR-inGRe28H_5qEUQ":{"text":"We decided to try Heard Dat based on the yelp reviews and oh, man we will never be the sam","useful":0,"cool":0},"MO9Jq49G6mvWPkEo9KeyOg":{"text":"I've been here twice. I had the super dome both times. It was exceptional. Chef Jeff is ta","useful":0,"cool":0},"bxvxgzE-L0cIeLVrfh0LOA":{"text":"Was here for Essence festival & in NOLA for the first time so I had to attempt to fit ever","useful":0,"cool":0},"srxz-1K49uamP-iI-Sa0bg":{"text":"Food was actually on another level. Had the superdome and it was delicious. Ordered their ","useful":0,"cool":0},"5l_fHQM1FJkf1D_1Y--J1Q":{"text":"Excellent food and excellent service!! I can't believe I didn't know about this spot until","useful":0,"cool":0},"vbvKS9OAhwCvEmVasSk8Vg":{"text":"The food and the service was a A1. one of the best restaurants in the New Orleans I tried ","useful":0,"cool":0},"vd0wET7AIkRhcIzp9ANkjw":{"text":"The food was magnificent!! The waitress and cook were friendly and hospitable. The food wa","useful":0,"cool":0},"tVrCCsid79_zASPHNXwYhg":{"text":"I would've given this place five stars if the bbq  chicken would have been grilled , over ","useful":0,"cool":0},"2OhQZeiFrFZYOOxbsIKLWQ":{"text":"Best meal in New Orleans, no question. Don't come to town without eating here.","useful":0,"cool":0},"iLwxQEatzXD5vKTiD7tWeA":{"text":"All I can say is this food came out and was PERFECTION. I ordered the super dome and my gi","useful":0,"cool":0},"1tZdfq4mrOmTThEC5ufq0Q":{"text":"My boyfriend & I have been visiting from New York & were really trying to capture the NOLA","useful":0,"cool":0},"xGtz-itkDDxOSlIeIvSWmg":{"text":"Truly and honestly the best meal I've ever eaten. \nMy boyfriend and I visited this past we","useful":1,"cool":1},"r54sI8HrLiBS9p9qmUsZEw":{"text":"A tiny piece of heavenly cajun/creole food. The Superdome Blackened fish will melt in your","useful":0,"cool":0},"Q2wSsHDkB8jpPFSnE37TDA":{"text":"I happen to be researching black owned businesses and this was one of the restaurants that","useful":0,"cool":0},"oIvrKbqwJNT6wPBm6M-BZw":{"text":"Food absolutely amazing, you can't go wrong with anything you select from the menu! Con is","useful":0,"cool":0},"fHjoLPh_bJaUG0uqWL6Bkg":{"text":"This is a special place. The food is innovative, artfully presented, and delicious. The pr","useful":1,"cool":0},"Bggegf0JGY8w7ZnJ06S-EQ":{"text":"I thought I knew good fried chicken. This place set the bar. I ordered the red beans and r","useful":0,"cool":0},"lGMa-Gp-J4MzHG0rSVWm3Q":{"text":"Don't let the small size of the dining room fool you... Very friendly atmosphere and their","useful":0,"cool":0},"P4ekTKZEOCXfgfpCQpJVQw":{"text":"Omg so good the food 10/10 omg heard dat kitchen is amazing. So good my goddess I love the","useful":0,"cool":0},"6Ks5X4Xw_uduIenYTm6-pw":{"text":"EVERYTHING is absolutely amazing!!! I can't even begin to write a review well enough to co","useful":0,"cool":0},"7ouCVaXOg31dES0qzJF7VQ":{"text":"Oh my god so good tiny little place you never expect to find kind of a hole in the wall ne","useful":0,"cool":0},"5ps4CY6nKEQEs7AewVIP2g":{"text":"Finally, a plate worth talking about! Not much seating at all but honey, the food is SO go","useful":0,"cool":0},"yXVJ4qF_t22ulKytLMwOPg":{"text":"I had the Blackened shrimp plate w mac,peas & potato salad for only $10. Excellent flavor ","useful":0,"cool":0},"jRp9o-LxwsFJoJd6SOmdJg":{"text":"I was staying a few blocks away from Heard Dat and walked over for lunch today. We were 10","useful":1,"cool":1},"jG67MBEuAsz-O46AFBNAhg":{"text":"This is one of the best meals my boyfriend and I have ever had in New Orleans, and you kno","useful":0,"cool":0},"302I6ReZcG6Y3KiDPYDYCw":{"text":"If you do not visit this place while in town you are missing out! It is so good the combin","useful":0,"cool":0},"rn_cTUOE62DqguI8rVzFtg":{"text":"I salivated over the Yelp pictures of this place for days before arriving in the foodie he","useful":1,"cool":1},"Okdk46JWXYjwQq_YuPK5Qw":{"text":"Chef Jeff catered a football gathering for the men in my church and was kind enough to sen","useful":3,"cool":1},"hgxE6Cnk_MH_F431ZbCgqw":{"text":"Superdome is the most dang delicious meal I've eaten in this town. Super nice people, came","useful":1,"cool":1},"zFMHBSa930paoZv8fZnVJg":{"text":"This place is off-the-charts good.  We went for lunch, and had the Bourbon Street Love (fr","useful":0,"cool":0},"XmxTJZzrB8IeDSpXosJrSw":{"text":"I've never been to NOLA before today, and after being in this city for 37 minutes I found ","useful":2,"cool":1},"3twCm_WGpEkKd1gcOhboiA":{"text":"Fantastic food and service. Perhaps the best hidden gem in New Orleans! Also, to clarify..","useful":0,"cool":0},"wVUbvVdGULxXJdGhvUClNQ":{"text":"We came all the way from St.Louis to eat here. And we didn't waste one second at a time. T","useful":0,"cool":0},"N_gDkcitFwOEZ6yl2zX7AA":{"text":"This is a hidden gem! My family and I were visiting New Orleans and found this place on Ye","useful":0,"cool":0},"yZxhiiU2MutS93_v_A_uuA":{"text":"Listen, if you're hungry for SOUL food you need to get over to Heard Dat, stat. My friends","useful":2,"cool":2},"ajP040lq3mqmvsgRiHeoqw":{"text":"Sooooo good...and ask for Tia, amazing service!! We've had the super dome, stuffed bell pe","useful":0,"cool":0},"ditk5TH6NTGDGdS3K14Bjw":{"text":"The best meal I've had in awhile. Service was great too! The surrounding area isn't the be","useful":1,"cool":2},"8EXRzoySve1jfbT6YyLOog":{"text":"The good is fantastic! Five for sure\nThe owners daughters are personable and know what the","useful":0,"cool":0},"j0tEZsBsBcyNvAQkYumFpg":{"text":"The food is really good. The staff is accommodating and friendly. This is a hidden jewel.","useful":2,"cool":0},"Ig1Zy2G6cWzSw_U5dx_XcA":{"text":"Came from Houston to try this spot. I'm doing Keto diet so I asked what green vegetables t","useful":1,"cool":0},"gxISakxSWeDyHcD31KDkVg":{"text":"The food was absolutely amazing. I had the Superdome and my husband had the Bourbon plate.","useful":2,"cool":0},"BCxOFV8vHGPq3-FFnJN0_A":{"text":"The food was delicious. We dined in and we had a great experience. The server Tia was grea","useful":0,"cool":0},"b__RjmAF1Wqh7N_FFud7bw":{"text":"Man this place was great! Great service and the food was smack ya mama worthy  I will defi","useful":0,"cool":0},"5A3aTnV4SKshIkzdVxCwKA":{"text":"Cannot lie, the building was a little off putting when I first saw it, but we went in anyw","useful":0,"cool":0},"mlJ5vJQU-K1LsLqrheHrGg":{"text":"One of the best Cajun food I have ever had. The place might look run down and dirty, but t","useful":1,"cool":1},"JGCV7m_2Ku0IsDL70xCenQ":{"text":"I am not kidding this is the best damn food.  Took a while to locate but man am I glad we ","useful":0,"cool":0},"14xFAT4cgxD0GPvUA6bItg":{"text":"WOW! This food was amazing! Hands down it was the best place we visited in New Orleans. Th","useful":1,"cool":0},"Iu4un_74ttH7_QEOBQfBZA":{"text":"What a great experience! This place is in a little bit sketchy part of town, but worth the","useful":1,"cool":1},"hpVWx4RF4OkJwDchlKcKZQ":{"text":"Staff here are super friendly. The server was always checking in on me to see how things w","useful":0,"cool":0},"Vq4QRcCMjl-hTnped0OaMQ":{"text":"Delicious food!! I had the superdome and it was out of this world, and that bread pudding ","useful":0,"cool":0},"OcZFHEf5VnuOGpgo-2qTcg":{"text":"Don't let this place's modest appearance fool you. The food and the service are both top-n","useful":0,"cool":0},"84nbTg4iB6n_lABrtapLuw":{"text":"This place is as good as others have said and definitely the best meal we had in NoLa allo","useful":0,"cool":0},"so4yfCviVPXIsaPrdqBVgw":{"text":"1st timer wasn't super hungry but wanted something tasty. I tried the crawfish fries. They","useful":0,"cool":0},"42IXLYA6XS9Ey2ukulBuiQ":{"text":"I ordered delivery here using Uber Eats.  I ordered the craw dat fries and the Superdome. ","useful":1,"cool":1},"iP3DNvfsHnM4SfCkagfZkg":{"text":"Heard about \"Heard Dat Kitchen\" from a co-worker and on WBOK radio station.  A few of us o","useful":3,"cool":1},"6wpXSGx6K7uwaWnMCBBRcQ":{"text":"This is a tiny whole in the wall restaurant with AMAZING soul food or southern home cooked","useful":4,"cool":2},"K12XmgkAq3TDr0nCWYfTGg":{"text":"Heard Dat Kitchen is where you go for the \nproverbial \"bang for your buck\" but it has less","useful":7,"cool":0},"ffmDqbBqiDuIyE3J3298PA":{"text":"My husband and I went to New Orleans for my birthday trip all with the goal to find great ","useful":0,"cool":0},"yNHRWUvmvDmiS0vBfuBBXg":{"text":"I would definitely have to say this spot is a hole in the wall! We of course, found this r","useful":2,"cool":0},"oBdNEGBe9ntcqpu1gKyEHw":{"text":"Best place EVER!!! Service was superb and quick. Well let's start off with the waiter, she","useful":0,"cool":0},"TRBFThcLGQu93xn3svgeEw":{"text":"Came here w/ my girl for lunch and we were over the moon. This was delicious soul food wit","useful":0,"cool":0},"qmQCMA8jvV3-mBhFWp6aDA":{"text":"Amazing! If your visiting new orleans this will give you a great experience! Lobster mac a","useful":0,"cool":0},"mG2e2nxf30JrYdCY45eQ2Q":{"text":"Found this place on Groupon and liked the menu.  Had the Superbowl and it was the best foo","useful":1,"cool":0},"lFlZEWpV9B6iDD91i59TxQ":{"text":"Please don't let this hole in the wall joint fool you! This was by far and Hands down the ","useful":0,"cool":0},"rb1jkIfp3xW47nNJ6vS66g":{"text":"This was hands down the best meal I had in New Orleans. Ordered the SuperDome and dat frie","useful":0,"cool":0},"1ma2A7IFgm7jiCWz267Gyw":{"text":"Best food in Nola by far... Its like that saying don't judge a book by it's cover, the app","useful":0,"cool":0},"21krpZ3hi3AdYqeEZ7Ooow":{"text":"Fantastic food. I had the blackened fish and red beans. Both delicious. I also got the gum","useful":0,"cool":0},"rTjHZUQ9nhXKS3H-aPpE9Q":{"text":"Aftermath of what was a Superdome so good u need every utensil the knife to cut the flakey","useful":2,"cool":1},"mON4SDZAhytexjK3-VxzGQ":{"text":"Superdome was best plate I've had in a long time. All love to the heard family who run thi","useful":0,"cool":0},"fcYiK1HpqvJjzWWCZCn6MA":{"text":"My husband and I just dined in today. We had the wings and dat fries as an appetizer-- SO ","useful":0,"cool":0},"aowlqnMupp0rneN7prsSWw":{"text":"This place is AMAZING. Not that much seating on the inside but well worth the wait. I came","useful":0,"cool":0},"Zw9k2mXxQFDtdCW4v6T08A":{"text":"Finally made it here to get a long overdue taste of Chef Jeff's cuisine. Absolutely amazin","useful":1,"cool":0},"PKuovW-GAqqwmVJW1DY24g":{"text":"OMG! This food is awesome. The staff were helpful and friendly. The best food in New Orlea","useful":0,"cool":0},"R0BN9Rf8IKO4cmSJ5ndpKw":{"text":"Omg, hood as ever but food was 5 stars. It's BYOB and there's a convenience store in the s","useful":1,"cool":1},"xGm21qaYY-lcqkllrxl0YQ":{"text":"Soul, comfort food at its best! The crawfish cream sauce is to die for. These are very hea","useful":0,"cool":0},"ivcl_LFBAU3L8_evZtwNSg":{"text":"The good is fantastic! Five for sure\nThe owners daughters are personable and know what the","useful":0,"cool":0},"imhk4JY6X8rQWky9prv8Kg":{"text":"Delish real creole New Orleans food! Wonderful owners and chef. Take out with a few outsid","useful":0,"cool":1},"u3-TH4f8bHlHbgyDwDha6A":{"text":"The food here is so unbelievably tasty. What an amazing dinner. I had the fried chicken an","useful":0,"cool":0},"867nd4LhJNt0QY4bFw5FdQ":{"text":"Hidden Gem for sure. I came here after the place we originally wanted for lunch was closed","useful":0,"cool":0},"HXL7VkwJiB8Wy918WfAvsg":{"text":"Warning Warning Warning!!! If you are not comfortable being in da HOOD, take your food to ","useful":0,"cool":0},"zmO0S6n_gukp-SifPv0lCw":{"text":"This place is off the beaten track and can be a little hard to find but it is well worth t","useful":0,"cool":0},"OSupwuzIpzPJihtFkEoW6w":{"text":"My husbad and I went to New Orleans on ly birthday trip all with the goal to find great NO","useful":0,"cool":0},"_eXOz2sCjITzoVxQsaIaGw":{"text":"Just ate lunch here.  I have to say it was AMAZING.  Blackened fish with lobster mash!!!  ","useful":0,"cool":0},"VbiaU73yG93SftGqj9v0rg":{"text":"I drove by here one night, as I had it bookmarked in yelp.  After driving by and taking a ","useful":4,"cool":6},"JgGqiOXjEIJaxqGtosW1kQ":{"text":"My friend recommended me to come try this spot. Service was phenomenal. It's a very small ","useful":0,"cool":0},"LZJjjzJDkl575y0DFuF3wQ":{"text":"Wow!  This is their first weekend opening up the indoor dining room and the service was so","useful":0,"cool":0},"wjdAG5AipIm8CvMNItftmw":{"text":"DE....LIC....IOUS! 5 STAR RESTAURANT Gourmet food in a white styrofoam take out tray! Rich","useful":0,"cool":0},"9ahEnSwW3rkH9a7w7-Emcg":{"text":"Delicious food and awesome customer service! Let's not forget \"dat shit\" drink! Dat shit w","useful":0,"cool":0},"ktL0W0H8e40Ck9H9sjrxog":{"text":"Ok would do five stars cause it's all about the food...it's amazing the chef is gifted!! I","useful":0,"cool":0},"jZVUz0HlpUH3vpXaukDa7w":{"text":"Loved it. PERIOD! The food is amazing, and so are the folks who work there. I found out ab","useful":0,"cool":0},"SVKQDiB5McFwCnteJLqN_w":{"text":"This was our fourth time eating here, and Chef Jeff did not disappoint. The \"Superdome\" se","useful":0,"cool":0},"eUMSTkefTioDzNefa1n_OQ":{"text":"Best comfort food in New Orleans. The chef and owner's last name is \"Heard.\"  Favs are the","useful":0,"cool":0},"iMGwRDn7RdO2DYDIUwIvig":{"text":"Dont let the location fool you. The food is authentic New Orleans family flavors.  When we","useful":0,"cool":0},"jhQAVLC9zPmpmDrgw37yIw":{"text":"Waited till the end of our 10 day visit to New Orleans before I posted a review, the reaso","useful":0,"cool":0},"bpB85yd13YbdK6zaIoye8g":{"text":"Long story short I ordered the Bourbon plate and I've been trying to get back ever since! ","useful":0,"cool":0},"pFluq37_a91M9KSXgsNrnQ":{"text":"We drank \"Dat Shyt\", we ate \"Dat food\", then I took \"Dat Shyt\" to go! Had a great meal, sp","useful":2,"cool":1},"JH47gMa0BMCWfM0DNP0Lvw":{"text":"Hole in the wall (seriously, we entered through the back door of a \"grocery store\") but ma","useful":0,"cool":0},"qChSXvtJknITe1JlKjwkjw":{"text":"Wow! I have a buddy that is from New Orleans and said I HAVE to eat here! Thank Josh!!! Th","useful":0,"cool":0},"H99skkbK-FX3LX85lVJSvg":{"text":"The food here is delicious, served fresh and piping hot. The family that owns the place is","useful":0,"cool":0},"oQQdu4e6ggF887zFh_sbmQ":{"text":"The reviews had me excited, but this place is highly OVERRATED.   The flies were vicious. ","useful":0,"cool":0},"Z1vHJLpm3tTZhDg1VB90VQ":{"text":"This is my second time in New Orleans and I just seemed to have a hard time finding good f","useful":0,"cool":0},"sQULmNsYA-RzG1W58GXCUA":{"text":"PLEASE DON'T SLEEP ON THIS PLACE!!!! The food is exceptionally amazing. This is food that ","useful":0,"cool":0},"1jL8K2rGJgYJHA9bbD0Egw":{"text":"Really high quality food from this little hole in the wall place. Will definitely go back ","useful":0,"cool":0},"7ZliJ-kVrqV-nUBcs5zEYQ":{"text":"Be prepared to wait a bit for your food because it's cooked fresh and served steaming, won","useful":0,"cool":0},"MotfFyAk0mn3yGfREr9OBw":{"text":"Came here to eat on our road trip to New Orleans from California. Loved it!!! The food is ","useful":0,"cool":0},"Z4cQDYtTql9MTVB_KHfM8g":{"text":"Food AND service is simply exquisite. You can bypass this little unassuming spot if you wa","useful":4,"cool":3},"ZbLV757j91wEDAblc7glnA":{"text":"My friend and I split the Superdome and the shrimp and grits and we both agree that this i","useful":0,"cool":0},"RfwB9FNDq6SgzYGGWM7O5g":{"text":"The delivery was on point and the food was out of this world! It was rainy so I decided to","useful":0,"cool":0},"iccm9kk-uFmIH8YwpdH61A":{"text":"This \"hole in the wall\" is not in the best neighborhood but the food is worth it. My favor","useful":0,"cool":0},"7VXLzkllz2rgg9bY-NuhUA":{"text":"Heard Dat has great food and super friendly service!! We ordered the seafood gumbo combo (","useful":1,"cool":0},"v32NfIu_9TCJ-_Ng2nW9rg":{"text":"Okay when you drive up it may seem a little shady but it is SO WORTH IT!!! The food is ama","useful":0,"cool":0},"tIx6RDs5EQ8TvX7CZI6XAw":{"text":"The food is DELICIOUS!!!! Found this place through Groupon; my daughter and I were visitin","useful":0,"cool":0},"MieaK3O_xdIiN_P9EXh66A":{"text":"I initially was excited about trying this place after reading the reviews and seeing them ","useful":0,"cool":0},"AxLJLZV-wvBIxebXBvc28w":{"text":"The food was awesome, and if you use the Groupon it's a good deal. Goes to show that you s","useful":0,"cool":0},"3Xg2UWtGbVZqHo8kRw8LGQ":{"text":"It was a sweltering 103 degrees out, which substantially reduced our appetite,  while we w","useful":0,"cool":0},"jhUHgtq5M_HxTAgaTwV8uw":{"text":"Great food and a very friendly staff. We went for dinner thinking that we'd be able to din","useful":0,"cool":0},"flPeV0UNJMiqDK-hi0r01A":{"text":"This place isn't much to look at from the outside. The takeout window is about the same. B","useful":0,"cool":0},"XJBqcY9f-ZStNEMzyvwcow":{"text":"Legendary! I had the Bourbon St Plate and a side of Dat Fries. Everything was SO delicious","useful":1,"cool":1},"a9jfX_uRYpSjgeTJPA421g":{"text":"Although I've eaten here several times before, the best dish prepared was for Diner En Bla","useful":1,"cool":0},"opa32TDzuAUrI8AFGcX7kQ":{"text":"The food is incredible and you can tell it is made with love. The flavors are hard to beat","useful":0,"cool":0},"iBAI0f5sny6Fi2BAw6Aw9A":{"text":"This place was soo good, food and drinks were good, service was excellent. The prices were","useful":0,"cool":0},"gx3rUM3APb8lf-kzH9Q3zg":{"text":"Very OVERRATED and OVERPRICED. Dont catch UBER/LYFT to be dropped off. You will be vene mo","useful":0,"cool":0},"oN8GLr0vIA-hl3F7_CzCiw":{"text":"This was my family's first time trying this place out and it was beyond amazing and the fo","useful":0,"cool":0},"X5Gp3mSjMa4EPjRPtrEu4w":{"text":"First of all: there is only ONE (small) table inside. Also a few picnic tables outside but","useful":0,"cool":0},"H81s4A0qWx2jFN3cxxpvdg":{"text":"OMG Amaze, tasty, delicious creole, soul food goodness.\nOwner came out an introduced himse","useful":0,"cool":0},"6mRX269CLEFNQbJwK0FCAQ":{"text":"We were lucky to eat Heard Dat's catering recently so wanted to try the rest of the menu, ","useful":0,"cool":0},"JjF3_Fp9txvoSBJqS8UX_w":{"text":"This is tough I'd have to try again almost wanted to give 3 stars. It was super salty like","useful":0,"cool":0},"NssBf5QVqA43qBfKhAVMyA":{"text":"Amazing family restaurant. Me and my girlfriend were in New Orleans for about a week and w","useful":0,"cool":0},"8iWxVKqX3f8PJsiJwBMZEw":{"text":"We read some very positive reviews and decided to give it a try. Wow - we weren't disappoi","useful":0,"cool":1},"uBqcXvFiDlt2k9Hky84FZA":{"text":"The best fish and grits in New Orleans!!! Thank you number one for your customer service a","useful":0,"cool":0},"dTBpnpd6ydxDydN6cAK5sg":{"text":"Holy crap this food is amazing! Had the super dome signature dish which was blackened fish","useful":0,"cool":0},"v4XCyBOqTqe7uGkmteHxsQ":{"text":"Lawwwwd. This place owes me nottthhhiinnnggg. The red beans, corn bread,  and fried fish a","useful":4,"cool":3},"h23ZQhHlZPWVvgSGg1ottg":{"text":"I thought I had left this review, and realized I didn't.  I definitely wanted to make sure","useful":4,"cool":2},"vtj76SAXYwKOSVBOB4qM3Q":{"text":"OMG!!! Best meal I had in NOLA!! I had the Superdome and my BF had the seafood extravaganz","useful":1,"cool":0},"RiFEk-7f7pIG0rJ772jUkA":{"text":"This place is the real thing! Delicious, FRESH seafood! I had the Mardi Gras Mambo dish - ","useful":0,"cool":0},"b5XFM-qi6VA1_iWT0_uedg":{"text":"Wow, it's our second night in New Orleans and we tried about 4 different high reviewed sea","useful":0,"cool":0},"GET6lNdt-j2yc3opPgfz4A":{"text":"Food was sooo delicious, I decided to take a short  10 min walk from my hotel after readin","useful":0,"cool":1},"-_MqjdqeYhM7RNRJgXe-eg":{"text":"This is probably one of the best food I've ever had in this state. I was most pleased with","useful":1,"cool":1},"mcFxw-jnmrslM9TlNAJCRg":{"text":"This place is legit...We got the seafood extravaganza,  Dat Chicken Plate, and the Bourbon","useful":1,"cool":2},"N-3tbt5-rmnqwosUsZPZXA":{"text":"By far the BEST food I've ever had in New Orleans! I grew up in Lafayette and have been sp","useful":0,"cool":0},"AE8hp6QwOI_N4iXCT29X4w":{"text":"The best meal we had was here, and luckily very close to where we were staying.  Regardles","useful":0,"cool":0},"EnuMoe_AJ7EbyhYUVfpsyQ":{"text":"Another Great visit to Heard Dat Kitchen!! Each time I eat here Chef Jeff out does himself","useful":1,"cool":0},"hY0tKeC0922DV1hu6HKZvw":{"text":"OMFG!!!!! This was my second time ever going here and I swear I'm going over & over again.","useful":2,"cool":0},"WMafO_jJ39QYXlq5nueXPg":{"text":"I came Home to New Orleans and went straight to Heard Dat Kitchen. I order the Bourbon Str","useful":0,"cool":0},"NdSNJwl8gcsPTfzntdwbGQ":{"text":"Great food and great family who love cooking and serving people. Had just about everything","useful":0,"cool":0},"0OkvEDyE25f3V9bYCgQskw":{"text":"Stubbled across this little place with my hubby. the area surrounding is quite \"local New ","useful":1,"cool":1},"4qSOTs3e4gpQ_N851zIjNQ":{"text":"First know that the area is sketchy and we were caught off guard. Your Uber driver will pr","useful":3,"cool":1},"An4anxYXh058gJEn6kJfWw":{"text":"This is my third time in NOLA and second time at Heard Dat Kitchen and lawdddddd this plac","useful":1,"cool":1},"2weR0L8MiWu8XbBWDfj7Mg":{"text":"Seriously some of the best food in the city, don't be alarmed by the semi shady atmosphere","useful":0,"cool":0},"unOHAUBMLX3ZJIMMJBzoxg":{"text":"Yep, it's as good as everyone says. Get the shrimp and grits. Get the red beans and rice. ","useful":0,"cool":0},"c0ON8Dg3QYVx0N0u_39Wkw":{"text":"I would give 6 stars if I could! The food at Heard Dat was absolutely delicious. I arrived","useful":0,"cool":0},"sdjFMkMnr8-tj5Uf3nnPWA":{"text":"Great food, great people.  The finest example of a great hole in the wall place.\nThe only ","useful":0,"cool":0},"lvtnS2EJNC0SHKqOcMIW_g":{"text":"When we gave the lyft driver the address and the name of the place he looked @ us like we'","useful":1,"cool":1},"ma0BvRDjw32ehh_XL0cklQ":{"text":"YALL. When I say this is the absolute BEST New Orleanian food I've had. My colleague comes","useful":0,"cool":0},"Mni6oKAn79kXibL3iODMjg":{"text":"Holy crap this food is amazing! Had the super dome signature dish which was blackened fish","useful":1,"cool":0},"gDbOpIEalMONpyWLyGw4FA":{"text":"I have got to say, after eating at Heard Dat, it is one of the finest meals I've had latel","useful":1,"cool":0},"-Sa-56CkFwyiIDOkcAXXlA":{"text":"All of the reviews are completely accurate. This hole in the wall restaurant makes some of","useful":1,"cool":0},"A4c8vtVX7iE1CpXK3Gm3Bw":{"text":"What can I say? It's a diamond in the rough. Love the food and the hospitality. They are a","useful":0,"cool":0},"aEo4MnFUIBdY_v-5X9T3YQ":{"text":"Super addictive, this is the best way to describe the food at Heard Dat Kitchen. My wife a","useful":4,"cool":4},"BYZKzImC7PrC7rKex1aqmA":{"text":"This is no joke, hands down, THE best southern food I have ever had. Everything I have tri","useful":0,"cool":0},"zT-4VpxaHvMM-nm9To9LMA":{"text":"We came and walked in and they said there was seating in the back. It's a hole in the wall","useful":1,"cool":0},"YadDWl3mLGfXSByw0qundw":{"text":"The perfect hidden gem.  This place combines amazing food with the best customer service y","useful":3,"cool":3},"LqIH1BYCgMsQFr_ZXuoNdg":{"text":"I was beyond ready to write home about this place. I was so disappointed with everything o","useful":0,"cool":0},"peDtZru7kTzidFXiTo8ldg":{"text":"This is a relatively new place, with the goal of bringing fine New Orleans cuisine to inne","useful":4,"cool":2},"jx93A21AuJkAJ4POZFG84A":{"text":"This restaurant has certainly made a name for itself in the year or so that it's been open","useful":9,"cool":5},"XtUdo-S-LHnHdPfctqaBog":{"text":"Delicious food. Excellent customer service. The tea is the truth! Currently working my way","useful":0,"cool":0},"A77wCml5KA1wIem7N4eecQ":{"text":"This is a hole in the wall that is off the beaten path. Specifically a run down place in a","useful":0,"cool":1},"qnL0XZuRjn8absgpP75whg":{"text":"This place was not too far from where I was working. Went 2 days in a row. Food is really ","useful":0,"cool":0},"C46mGfqHOaQaWD3rqtUKDw":{"text":"Heard Dat is the place I ALWAYS pick whenever I need my fix. On cold days like today, the ","useful":0,"cool":0},"Z-lNEk3dC8iPO2cgUFzuzg":{"text":"Don't let the appearance of this place fool you. Everything was excellent. Tia is an aweso","useful":0,"cool":0},"h-O3tG5jtFbhJPUSRS4SKg":{"text":"Wow, this place is incredible. So glad Yelp led us to this little place off the beaten pat","useful":15,"cool":15},"n4_0TqZWLXLOefxKt-br2g":{"text":"The Superdome dish was amazing. The lobster sauce is so delicious. All food was great. Def","useful":0,"cool":0},"vl44qo38MnlN_doat_AlUw":{"text":"Outstanding. Nothing to look at from the outside.  But off the charts food.  Beans & Rice ","useful":0,"cool":0},"vb-CjWfKoxR47a-aII9GBg":{"text":"This place is a gem in a sea of tourist driven destinations! Off the beaten path, but only","useful":0,"cool":0},"zfOJw7PJ6ycfp4IcdimzXw":{"text":"YALL. When I say this is the absolute BEST New Orleanian food I've had. My colleague comes","useful":0,"cool":0},"pei85DarFVAVM3bIzIgQzQ":{"text":"OMG.... I had to put everything in on the table for this one babyyyyyyyyy u ain't had noth","useful":0,"cool":0},"rdCExcQfz0z8HJwpJusJFQ":{"text":"A couple of colleagues and I were in town for a conference and wanted to eat some local cu","useful":0,"cool":0},"f9d2HijTZmM6PqyVB64-mg":{"text":"Service is wonderful, very peppy and patient. Food is absolutely delicious. 10/10 would co","useful":0,"cool":0},"G5ETnQTjK78qJVVXkocEGg":{"text":"I came here on a whim with my family. Very much a hole in the wall but the food is ridicul","useful":0,"cool":0},"PGbITgfIPeFT83n36xgdZw":{"text":"It's a definite must while in New Orleans! I ordered through Uber Eats and got the Bourbon","useful":0,"cool":1},"bs1aRL8VCR3zjKFnkabCoQ":{"text":"The Crawfish pie topped with lobster sauce and crab was absolutely heaven in your mouth.  ","useful":0,"cool":0},"HgR4pCOrhg-xTpOowFZP1Q":{"text":"Definitely happy and worth the short ride from the downtown/french quarter area. I had the","useful":0,"cool":0},"tYFpiTuORFuz-UurnM-GxA":{"text":"The neighborhood of the restaurant is on the outskirts of downtown. Don't expect the ambia","useful":0,"cool":0},"GcHsyFGd5A__GdJZUln3Pg":{"text":"There's no real \"good\" way to explain the level of \"Damn! This is GOOD!\" Except to try it ","useful":0,"cool":0},"ZIv_k-zZg3iE99VIGcoWag":{"text":"Had take out food here.  The place has really good cajun soul food. The portions are a lit","useful":0,"cool":0},"2Coihka6Vx6Mpb24sUe69g":{"text":"Found this on Yelp and boy what a find!! Hubby got the Bourbon Street Love...fried chicken","useful":0,"cool":0},"NE67-0e4ujGGorNiAtwJYg":{"text":"best local spot in new orleans, la! blackened fish, red beans and rice is amazing!! bread ","useful":0,"cool":0},"Fqeq87uknas4EQedb0lyTw":{"text":"Wow! Seriously the best food I've ever eaten. There was 3 of us, we all got something diff","useful":1,"cool":0},"612obsZGCegorL_GVd85YA":{"text":"Best blackened shrimp I've ever had! This family owned restaurant also provided me with su","useful":0,"cool":0},"FDCUZj8kIPXw1r-5wm3JRg":{"text":"Walk-up ordering window with inside counter seating or sit outside at one of the tables. S","useful":0,"cool":0},"jYyujbUGoQ8TA5xoIpt82A":{"text":"Just finished and I want to drive back across town for seconds.  This was absolutely the b","useful":0,"cool":0},"CYSZuLe0p0DS5jKRNOdBvQ":{"text":"Great great great place. Super nice people. We need more money going here. Entertaining ar","useful":1,"cool":1},"FfeswgSNzbsQUjINwU8cIA":{"text":"This place was amazing!! Ángel (the owner's daughter) had amazing customer service and was","useful":0,"cool":0},"tYarbJlPALb7917rCA6aKw":{"text":"The Bourbon street was the bomb!!!! Will definitely return to this spot anytime in on NOLA","useful":1,"cool":1},"U_joLsCswj5k4W62s3Wj4g":{"text":"It's understood by the other reviews that the food is amazing, but, the tea!!! The tea is ","useful":1,"cool":0},"CPDkBRoBKG87LnYtV5II8w":{"text":"If I could give it no stars I would. Not from out here and seen this place ! Very ghetto a","useful":0,"cool":0},"4WGw0H0R_mVeFBNJut7sGw":{"text":"Amazing!!!! This is in a non touristy area, and everything about this place is AMAZING! Th","useful":1,"cool":0},"zBiZh0AhCWJuLsSrikqm0A":{"text":"Wow, awesome place! Tia was very inviting and nice, the food was really good... 10/10 woul","useful":0,"cool":0},"z7cKZ5GJ-6WiKkNljrxKYQ":{"text":"What can I say? This place really is dat amazing. We came here on our last day in New Orle","useful":0,"cool":0},"7hQbo1BI6rZY-wkw8Q2caw":{"text":"This is quintessential New Orleans!  Reminds me of old New Orleans were you would find the","useful":0,"cool":0},"o_vKI9kXI-OFzS4QHBAeHQ":{"text":"Food was amazing!! Absolutely recommend this place. Not the fanciest atmosphere but I'm te","useful":0,"cool":0},"ruCO4NLQqF4Vc-vRBcKZpw":{"text":"Everything looks shitty except for the food. And the food itself worth 5 Stars. OMG babe I","useful":0,"cool":1},"xTM_SzM5HLHOhLvToMluLg":{"text":"When you come to New Orleans go eat at the Mecca of food.  There is not another place wher","useful":4,"cool":0},"lhpTRsFf-6x0s-ihBw92Ng":{"text":"Words just cannot express. As everyone else has said, it's not about the locale. It's abou","useful":1,"cool":0},"W-ZzXKB82JeO3zFRTguk3g":{"text":"This was my first meal on my NOLA trip and it did not disappoint. Had to have it one more ","useful":0,"cool":0},"rh7a9ui68xJNwUEE4hdS1g":{"text":"It was CLOSED,,,no warning, website showed it to be open. The building looked really old, ","useful":0,"cool":0},"CxWt6OjY-ob-hw54luvUOg":{"text":"Thanks yelp, that's how I found this place. Best gumbo I had while visiting NOLA and will ","useful":0,"cool":0},"0ChqP8gQGZQd9WtAvYZ87Q":{"text":"Delicious hidden treasure. Our party had amazing dishes and were for sure not disappointed","useful":0,"cool":0},"E0j-Cr0mbu6-la8Q0wC9lg":{"text":"This was my first time visiting. I really enjoyed the food. If you have never been finding","useful":0,"cool":0},"kHSK3_Hs6izPZEyyIFJT8Q":{"text":"Easy 5 stars.  I found this place on yelp and made the executive decision that this is whe","useful":4,"cool":2},"td0vSd72BGlmvpy-F3Uhjg":{"text":"Literally I heard dat kitchen as a yelp recommendation and it was amazing! It does look gh","useful":2,"cool":1},"d7Fm5IUMWLeiYAMa_JySiw":{"text":"Friendliest staff I have EVER encountered. One of the best meals I've ever had and definit","useful":0,"cool":0},"jyVJCFmwMgMvcosKWDOXYQ":{"text":"Always impressed with the food and service. Support black family owned business and get an","useful":1,"cool":1},"nVa_NIy2wd23j10XhJYxTg":{"text":"AWESOME FOOD!! I had the fried fish, red beans & rice, salad & onion rings. The onion ring","useful":0,"cool":1},"5a9IvkDwIMkd9eg_ktXbUw":{"text":"Tasted so nice that we had to have it twice. Literally. Twice in one day. My boyfriend and","useful":1,"cool":1},"PDTTGNzufBJmysxo1Jkmaw":{"text":"Wow, the food here is excellent!. We had a couple items here and both were great. Also had","useful":0,"cool":1},"I0D89Lj5y56aQDsdTLss7w":{"text":"Amazing food, one of the best meals we've had in NOLA--- in general tbh. We got the Superd","useful":1,"cool":1},"ECd1cInk77JtJolJnewACA":{"text":"Taste- *****\nAmbiance- *\nParking- **\nService- *****\n\nHave you heard about dat-kitchen? \n\nS","useful":7,"cool":6},"l-YaNvPOHAXfrvWeDs01_g":{"text":"This hoe is fye! I got the off menu crab fish thang and I was like damn, I want this again","useful":0,"cool":0},"vMFbvmislp6Jl8UZrGm1Nw":{"text":"Service was good , the lady was attentive and made sure we were taken care of . The food w","useful":0,"cool":0},"ELocD8SjH4ExrOLpnRg6mw":{"text":"This place is everything I wanted it to be. It is a dive. No question. But this place is e","useful":0,"cool":0},"xkX9kv9EORkzONWzAMro1Q":{"text":"MUST COME HERE!! It was so good we ate here twice during our 3 day stay. Amazing service a","useful":2,"cool":0},"4F2nq2d7CZFrh1mZSxxJAg":{"text":"The food is fantastic!  I can't wait to come back and try something else from the phenomen","useful":0,"cool":0},"mBX2DSh7RxzkGatG_KtymA":{"text":"Decided to check this place out after driving by and good lawd am I glad I did. I got the ","useful":0,"cool":0},"wLRJy-lMGIscs_QYv3u3Tg":{"text":"We ordered to go on Postmates since we were from out of town, and got the bourbon street c","useful":0,"cool":0},"ObWFziVz5weKxADnZ9k-4w":{"text":"Earlier this month my husband and I were in NOLA taking in some of the best the city has t","useful":4,"cool":1},"k7AFoXgH98K_eivtjeLrlQ":{"text":"\"SUPERb\"! The Superdome \"SUPER\"ceded our already high expectations. Seriously everything w","useful":0,"cool":0},"bTF4PO32lZdRCW_B_FD4Sw":{"text":"Family owned. Black owned.\n\nCame here for a girls trip and my friends and I ordered one of","useful":0,"cool":0},"dkHPEwfOhjJiTs8tES6Ywg":{"text":"This is a small place but the food is incredible. The flavor in the chicken, shrimp, potat","useful":0,"cool":0},"Gfh2SQIYO215OYBW-VzMsg":{"text":"I used a Groupon and ordered 4 items on the specialty menu. Bourbon Street Love, Super Dom","useful":0,"cool":0},"75MMg947epb5UVG74CljGA":{"text":"Wow! Wow! You will not be disappointed. Everything on the menu is amazing and that chicken","useful":0,"cool":0},"PIxnLe7gLgsQuN_EE_5vlA":{"text":"Best place in town! While\nVisiting NOLA I had to eat here a few times. So worth the drive.","useful":1,"cool":1},"UbtJQJw3hCYHuRcGh33OhA":{"text":"Hubby, Son and I got food to go . It was so good . The young lady was very kind at the cou","useful":0,"cool":0},"3hqICFAvANXKx3YLsDJkeA":{"text":"We arrived at about 7:30 and website says they are open till 9:00. When we tried to go in ","useful":0,"cool":0},"Wc85nOU16RFSndt4KBzWkg":{"text":"If you are looking for some true New Orleans Cajun/Southern flavor stop what you are doing","useful":2,"cool":1},"Ai96chQ0AwuXkQQ7zFbgAA":{"text":"Jeff the chef and owner knows what he is doing. The food is amazing. Crowdat fries are out","useful":0,"cool":0},"6rxHub6mANBiD7x7dXVW3A":{"text":"Dropped in for dinner on this place after reading the reviews on several sites. The menu i","useful":3,"cool":1},"dsF48XNR3RBpTbovaL4kQw":{"text":"This place reminds me of when you come home and mom has the whole house smelling like heav","useful":0,"cool":0},"dkctiNPRnPdHlegy2zuUyQ":{"text":"Amazing! Must try the bread pudding. Well actually try it all, everything's freaking amazi","useful":0,"cool":0},"YCnkp7RIan-Fs4Hdo8lsPg":{"text":"Wow!!!\nBest Ever!!!\nI've lived in New Orleans for two years now and me and my wife each we","useful":1,"cool":0},"JeBT5MGudNFJlgMr-GvGsA":{"text":"Hot spot alert!!!! This hole in the wall was exactly what I was looking for. Uptown has a ","useful":1,"cool":1},"U9L_fgpFUGZAvClk-sOKYw":{"text":"This is definitely a hidden gem. I've passed this place so many times and if it weren't fo","useful":3,"cool":2},"v48zrB8-zaD_BQUhe70t5g":{"text":"The food here is typical of out of the way New Orleans eateries.  Sysco vegetables from a ","useful":1,"cool":1},"JnhztclJKmPLWN8lj7X-GA":{"text":"\"Don't judge a book by its cover\" applies perfectly here. I was hesitant at first when I a","useful":0,"cool":0},"QSTc7ut8RhnU3gncCIR9mQ":{"text":"We have been 3 times, ordered something different each time. Amazing best describes their ","useful":0,"cool":0},"Wvj3CAnxRdmEfx2SOR78kw":{"text":"Where to begin!!! Tia was an amazing hostess/server. Her father can truly throw down! The ","useful":0,"cool":0},"9aWDrT73C7j0oDkcVN9QHQ":{"text":"Ok, if you know New Orleans you know this isn't the greatest neighborhood. But if you let ","useful":1,"cool":0},"9q6S3TzmQ-bqvn3nZJBcxw":{"text":"Absolutely amazing food! Don't miss the Super Dome or the Bourbon Street. The crawdad crea","useful":1,"cool":0},"YnRrHpjcTDvmXo0X_YT8Rw":{"text":"Listen... pictures don't lie.  These reviewers didn't lie either.  Arriving, you may be a ","useful":0,"cool":0},"inDnsoaNrETAZ2vjoBZc3Q":{"text":"When you pull up,  your thinking this isn't the right place,  how do I get in? Then you wa","useful":0,"cool":0},"8lQR64vryLgj8U-K0yi0uQ":{"text":"First time and it was sooooo good. Everything had so much flavor with the right amount of ","useful":0,"cool":0},"jwWktk1NluascUDAd6Wfjw":{"text":"Amazing as always this place is absolutely perfect as always...the food is just so so good","useful":0,"cool":0},"2aU94wGLvou2k5IJVDJSbA":{"text":"Please visit this place! I called in to order the Superdome, which is   grilled fish on to","useful":0,"cool":0},"0tqdAy2dXWmapkv9Zhnqkw":{"text":"The best southern cooking I've had in a long time! It's worth the trek away from the touri","useful":0,"cool":0},"uQAEnFqSUUUihq6WcaYq7g":{"text":"The food is Delicious! Ya heard!! Try everything it will warm your tummy and taste buds al","useful":1,"cool":1},"V9NuZWZKites42gDDg-5Aw":{"text":"First time in NOLA and spent about 20min searching for a local place to get great food. He","useful":0,"cool":0},"4JPU9i8WhCB9nyjOWYehQQ":{"text":"Amazing food and friendly staff! This is a must try place when in New Orleans. Don't let t","useful":0,"cool":0},"H9Zd0Q1r9_4xDZylWagIyQ":{"text":"This place was DAT and more! If your not use to urban area mom and pop shop and think your","useful":0,"cool":0},"CU0_yej6GsyHZSrbi2yJ-A":{"text":"Threw all my food away. I ordered the red beans with fried chicken. It came with two piece","useful":0,"cool":0},"L4orab6JxbhzNA3L_XHgOA":{"text":"If i could give more stars I would. Food was absolutely amazing. I am looking forward to c","useful":0,"cool":0},"Zw38_xgCVIAQuzSEWAHgsw":{"text":"It may be wonderful and this was our spot we picked to try on our one night in NOLA based ","useful":0,"cool":0},"66gaFNfx47MEgXOFMkPRUQ":{"text":"Do not let the neighborhood fool you. I was very hesitant and skeptical to get our the car","useful":0,"cool":0},"HtGfO5xh_3foP8gTbPRmSw":{"text":"This food is SO DAMN GOOD !! The portion size was just right. Everything was seasoned to p","useful":0,"cool":0},"8V_FsCLS5Up0QWMTH2P79g":{"text":"Great little place off the beated path. I would have never thought to stop in, but then ag","useful":2,"cool":0},"9Ig0ehkxLRAg3t3H-1Vwaw":{"text":"Sorry not any food before pictures it was too delicious looking to wait for pics. We had g","useful":1,"cool":0},"TuLY06wU17z9QEWXcdvIdg":{"text":"Dear Jeffery Jr.,\nYour sister is amazing and deserves the utmost praise. She made our New ","useful":0,"cool":0},"iO3Lb6gcYl3bUtxXYXK7DQ":{"text":"The food here is amazing. Best food we had while in NOLA for 5 days. We ate here on our la","useful":0,"cool":0},"dUjGYTQGLC_9SceYy0x0Rw":{"text":"The food is superb. The problem I have is with the time it takes to cook. They say be read","useful":3,"cool":0},"7cklVlfImKe27dlfQ_ZaLg":{"text":"It was very good . I came after reading a few reviews and looking at the pictures . Everyt","useful":0,"cool":0},"eBiLwE-pKumVTIqMBX_osQ":{"text":"Coming from the Bay Area, we wanted to try ALL the food in New Orleans. We hit world famou","useful":3,"cool":0},"DqzwjSruhc9IRNBbGCwTgg":{"text":"This is by far the best fried chicken I've ever had! Service was awesome and the food was ","useful":0,"cool":0},"P4BaEKj07oYUV_5nv-nffQ":{"text":"I absolutely hated it. I hated the spot and the area.Not the safest part of town. The food","useful":1,"cool":0},"jSc7y2PVcii1rNmm787_3Q":{"text":"This place is all dat! Not even sure how we found it. Googling restaurants led me to a yel","useful":1,"cool":2},"lea4GVMt-W3Bfij5h-Gymg":{"text":"One of the BEST meals I had while in NOLA! \n\nGet any of the specialty dishes and you will ","useful":8,"cool":2},"PVjWmAgZ-tNBj8HcVzVxyA":{"text":"OMG AMAZING. We ordered through WAITR not knowing we were about to be ruined for life. I d","useful":0,"cool":1},"ElS1-d7GnPJtPCBe_OJfuA":{"text":"This family run restaurant is everything that you could ask for. Fantastic food (and I mea","useful":0,"cool":0},"8lFDaY93YEbyfB235u1SUA":{"text":"No inside dining currently. But the food is delicious! I got the Superdome and the Bourbon","useful":0,"cool":0},"Y7ebHnhZu72hBXxMAojd8g":{"text":"Amazingly delicious southern food. Excellent prices. It's more of a take your food to go s","useful":0,"cool":0},"34d1k4TjIaAuKdglgM0lsg":{"text":"Man, this place was fantastic! When we first arrived to NOLA we were starving! While we dr","useful":1,"cool":2},"M-yunE3Nnj9QgQQTR58fgg":{"text":"I ate the Superdome. It was the best food I've had in NOLA so far. It was worth the price.","useful":0,"cool":0},"w5rSDAzFeOYW4uzrXmb5QQ":{"text":"Everything about this place is amazing. Service, food, social distancing, everything! I ha","useful":0,"cool":0},"P2MUrQsnNvBkrR_oWJC07g":{"text":"Amazing food. Bourbon Street, and the Superdome where our go to's and we did not regret it","useful":0,"cool":0},"ioAU3xLYRJHyUcboQFuTqg":{"text":"It is hard to get over the exterior as the neighborhood seemed really shady. But once the ","useful":0,"cool":0},"X07zoVg8-MS70d9DqJZxbA":{"text":"Excellent excellent food! Amazing and the flavors danced on EVERY part of your taste buds,","useful":0,"cool":0},"4S9qPoFWiAqAOHI2Bkg1Ug":{"text":"I heard Dat the cornbread was dry AF..... other then that the rest of the food was fire.","useful":0,"cool":0},"Xv-_GEC5iCxClx-V9LUdCg":{"text":"I've been hearing about this place for awhile and finally got a chance to check it out. Fi","useful":0,"cool":0},"p_CbJThLigUdAA9vlo9o4Q":{"text":"Worth the ride from the French Quarter. \n\nGet anything dish has the 'crawdat' sauce and yo","useful":0,"cool":0},"cexJrDi8wTi5Zlu7XeHJ4Q":{"text":"NOLA's FINEST\n\nJust finished visiting Heard Dat Kitchen as the last thing to do before we ","useful":0,"cool":0},"PsFtPH2OOWOTzIyRddoVug":{"text":"I just ordered the ranch fries with a side of shrimp and let me tell you the shrimp must h","useful":1,"cool":0},"WrTC4DN-9ZxsX2SNfkfYog":{"text":"We heard about this place before going to NOLA and were so excited for their food that we ","useful":0,"cool":0},"wYU-r_eiYDotfD2rwazlDQ":{"text":"I left New Orleans a week ago, and I'm still thinking about the lunch I had at Heard Dat! ","useful":0,"cool":0},"jRlucbavJtQ4mpK9PvW46g":{"text":"I had the Skeesh (spelling) salad, red beans, and blackened chicken. The server, who also ","useful":0,"cool":0},"8_gDOiEemYSr2fY0n2GsEA":{"text":"Had the crab special. It was truly amazing. The blackened fish was wonderful and perfectly","useful":0,"cool":0},"3bmX6L0GZneiGEqJr70eUA":{"text":"This place is AMAZING! Yes, it's smack dab in the heart of the hood, but aren't most of th","useful":0,"cool":0},"3JmQOj7I5zV6ldz5oR6-Ow":{"text":"This place is great. It is a place to go if you want some true down home food.  It is a ho","useful":0,"cool":0},"LZcBKy6NoAnvbWbbZ_SZ8A":{"text":"Friendly and family owned. Let's get some real N'awlins food! First time eating shrimp and","useful":2,"cool":0},"3lU9Wzi9AMqHHVYz52w-uQ":{"text":"Hidden Gem.  When you first arrive the location looks suspect, but when you are escort to ","useful":0,"cool":0},"gbdji__WQOyuosQ8Lvq09Q":{"text":"Yall... this was really good! It's fried chicken (boneless chicken thigh perhaps?? ‍) over","useful":1,"cool":1},"FnBQ3cvPjcfEwkJN6dFN8w":{"text":"Great food...sketch neighborhood...Take Uber and get some incredible food!!\nGot the seafoo","useful":1,"cool":0},"jZNNzLx_JhcIBThrSB4Ggg":{"text":"Everything in the reviews is true! The restaurant has only four outside tables and it is l","useful":1,"cool":0},"EKlrHXwwAHFzzVE6RfdrUw":{"text":"Told about this wonderful place recently by an uber driver... it was a bit out of the way ","useful":0,"cool":0},"SEg5NX-evXSV3X__bYWzIQ":{"text":"The good is fantastic! Five for sure\nThe owners daughters are personable and know what the","useful":1,"cool":1},"7PMtSg10zkOFc_XBarBFRg":{"text":"This place is a bit off the beaten path in NOLA but well worth the visit for cajun soul fo","useful":0,"cool":0},"0kLFPmHa-BidssRKH7a-1Q":{"text":"I had an early dinner here on my way to the airport. It was amazing. You should eat here, ","useful":0,"cool":0},"wjgpF7b2xEDoRacBM72AQA":{"text":"I loved the food I got here! I got the dat fries and two types of wings - skeesh wings and","useful":3,"cool":0},"vpTAZKWhKOOznaMsnFvQPg":{"text":"Omg! I am not a sweets person but this was mouthwatering, finger lickin good!!! The bread ","useful":1,"cool":0},"E-GWBbABZ7Lon33kK_vZEw":{"text":"We didn't want to get dressed up to go eat when we visited.  I stumbled upon this little g","useful":1,"cool":1},"yPizsN7ZrzKRRs8mX1VCng":{"text":"Can I leave it at this? The best catfish I've had in my life!!!!!!! Apparently not. If you","useful":0,"cool":0},"jDjRZ8b0zX9O31zDnEQJ8Q":{"text":"I guess it was good for bourbon street, but pretty average overall. Fish was overcooked an","useful":0,"cool":0},"MW0r5k8uKa82j06mo6kC5Q":{"text":"If you want to try a place that's kind of off the grid, come here. We had trouble finding ","useful":1,"cool":1},"h-ax-RQp3gPgJNyBSMPrnA":{"text":"Now, I've had some pretty good bread pudding, but nobody does it like Heard Dat! Their bre","useful":0,"cool":0},"ur89s8gys-2vule7T_iBlg":{"text":"Oh my lord. First time here, definitely not the last! Tia was such a friendly host and ser","useful":0,"cool":1},"SfLcfEgskBar81eYVLCeNg":{"text":"This food is sooooo damn delicious..... i mean treat yourself every once in awhile with He","useful":0,"cool":0},"98_66fLjQe0gob0Gd-UA2A":{"text":"Nestled in the heart of NOLA, with rally easy access. Don't let its humble exterior distra","useful":2,"cool":0},"yBKnO2yj4R0pXX5D5LaIrw":{"text":"Baby, I got my entire lifeeeee from Heard Dat Kitchen, you heard dat?!?! This restaurant e","useful":0,"cool":0},"PXvsok3pKMOyykfOT2HtNA":{"text":"Amazinnnnng! At first I was skeptical since it is a lil hole in the wall, but the food was","useful":0,"cool":0},"rjkMK0DPcRpBPOFQPTR65g":{"text":"EAT HERE NOW. We were in from out of town and looking for good local food and decided to g","useful":2,"cool":0},"rW_qp5pdrkbXUMber6H52w":{"text":"Came here for some good ole southern home cooked hole in the wall goodness! And that's exa","useful":3,"cool":2},"c0y2xn0oCJNvK949t1TvnA":{"text":"Excellent customer service. This was the best food I've had in awhile. Everything was deli","useful":0,"cool":0},"zP3VdOplpdY1ntiVYAsYPA":{"text":"Places like this is where the real food is at in New Orleans! Best Fried Chicken and Mac N","useful":0,"cool":0},"h2nyyZsayuBa-HONLZJGSQ":{"text":"Dat shyt is bomb! Pun intended. Literally I'm lost for words. Chicken! Do the chicken! Bou","useful":0,"cool":0},"p-IdEfMmlyIGSjYKBIOoJg":{"text":"Absolutely the best fried chicken, Mac and cheese and miracle sauce I have EVER had!!! B E","useful":2,"cool":0},"H7h8ZvECX20goiDSKBSpig":{"text":"Food was delicious. The crawfish sauce really makes the dish. I even liked the green peas.","useful":0,"cool":0},"BfTvlhcKvf482XlV8M06jg":{"text":"I can't even take how great this place is. I had the bourbon street love it was absolutely","useful":0,"cool":0},"DlNN5lyko_LI1QAHlPKX5Q":{"text":"Highly recommend!!  Thank you Chef Jeffery for an amazing meal!  Your food is so yummy and","useful":0,"cool":0},"56MPoYWq7TnN4UXnL3ldXg":{"text":"When in New Orleans, don't sleep on this spot. Awesome food. Definitely returning to check","useful":0,"cool":0},"tjKMTydm7lS9DmFQQiIkBA":{"text":"can't wait to come back!  amazing food with explosive flavors!","useful":0,"cool":0},"NAsiKwJqiCR1vNIGaCt0UQ":{"text":"Well I have mixed emotions regarding Heard Dat Kitchen. Ordering delivery was easy, delive","useful":0,"cool":0},"_rSfEJ49eYXyJ3FcglAcVA":{"text":"I love this place. The food, the customer service, and the family who owns/operates this b","useful":0,"cool":0},"jUYdznVisnLxe4eJVhbaSg":{"text":"Heard Dat Kitchen is one of the BEST examples of an excellent \"hole in the wall\" kind of p","useful":4,"cool":3},"icGFzvf-kTPVacD3nkt_5Q":{"text":"I had the super dome and it was just average. Didn't stand out much. It wasn't something I","useful":0,"cool":0},"Zj-Ux8lGv0DlmXIkHonlfg":{"text":"For the price, I was fairly unimpressed with the \"Super Dome\". The dish is entirely unbala","useful":2,"cool":1},"9kixugsFOySVxdrqxX-pSw":{"text":"So good. Perfect southern comfort food. Would be perfect in a better location. Best family","useful":0,"cool":0},"NJ51gIFIzGFHA6mBSIjJ3A":{"text":"Went here with my fiancé and the food was amazing! I send people here all the time and rar","useful":0,"cool":1},"5iqcQhDGFVgp3UTFhknqaA":{"text":"The Bourbon Street with crawfish sauce is SO DELICIOUSLY GOOD. I know I shouldn't finish t","useful":1,"cool":0},"boYQK_Cyut2oNQFHwZRtPQ":{"text":"Visiting from out of town. We wanted to support black-owned businesses with authentic cuis","useful":0,"cool":1},"Mzm9OZRN7bTdSyC9ksPgbA":{"text":"This is one of the best places for New Orleans cuisine at affordable pricing. I'm here onc","useful":0,"cool":0},"Z_vED4z-XCvh6KY7SS_udA":{"text":"The best food in New Orleans. Great staff. It's off the beaten/tourist path but if you don","useful":0,"cool":0},"AMpmNmkqyUVGLozhDLi0SA":{"text":"First off I'm from Houston,TX and this was only my second trip to New Orleans (I get consi","useful":0,"cool":0},"myz72eFykM9YITSB0C9xzg":{"text":"I really love the food here, and I still do. When I first visited this place, I was greete","useful":2,"cool":0},"uOjvXv-41uDWdY955noBsg":{"text":"Enjoyed the food and Dat Shyt drink. Will make sure to always come back. Great Flavorful f","useful":0,"cool":0},"V5YndcTkAcd0snViyZ7SqA":{"text":"Ordered \"dat plate\" for lunch through Uber Eats. I chose the stuffed bell pepper as the pr","useful":1,"cool":0},"jVkHG5r4rZFphh8AEERv0Q":{"text":"Wow we loved this place. We had the blackened fish and fried chicken on Mac and cheese (I ","useful":1,"cool":0},"qmFYQ7dZfxcxybWZLFIQkg":{"text":"BEST GUMBO IN THE CITY! If you're visiting New Orleans and you don't know someone's grandm","useful":0,"cool":0},"yPrXGla6r3G9myCLwrjSXA":{"text":"NOLA's FINEST EATERY\n\nHeard Dat Kitchen was literally the last place my family went to bef","useful":1,"cool":1},"wq_zkgbZoOwYd8cbB2KiJg":{"text":"Amazing flavor and super affordable prices. Would come here every time I'm in town. The ar","useful":0,"cool":0},"g9jIy0gtnrahVMR8G-jV6g":{"text":"Wow... just wow. Hands down my favorite meal in New Orleans and I would travel back just f","useful":6,"cool":5},"bORhc5Qbd-wp1_5omDSh8w":{"text":"The food was seasoned to perfection  and the plating was top notch. Don't be discouraged b","useful":0,"cool":0},"TeTMH3JUA-BCNw3obaXk-g":{"text":"This place is amazing! It is all good and you have to have the bread pudding...better than","useful":0,"cool":0},"Y5LkABAthBNSMsk58R2sMQ":{"text":"If you are visiting, you have to stop here before you leave! If your from around here and ","useful":1,"cool":0},"KIKRL3oK6O2mIjf-UaGdjQ":{"text":"Diamond in the rough!\n\nSo we drive past this building a million times trying to figure it ","useful":10,"cool":3},"vcsfvWolZ5zIZVM0vY-AZw":{"text":"This restaurant was AMAZING! From the food to the customer service. Angel especially(whom ","useful":0,"cool":0},"65k8qk46yD5XBtYPw4nwBg":{"text":"Very humble inside and out. So what, it ain't super fancy but don't let any of that fool y","useful":0,"cool":0},"kKsNhx3RimECWpnaT_snog":{"text":"This food is soooo good! Everything is delicious! A little spicy, great flavor!!!!Dont be ","useful":0,"cool":0},"c_RpgBrtRFC3EH5cVzkhGQ":{"text":"This is a must for if you're visiting New Orleans, don't leave without trying it! I have g","useful":0,"cool":0},"wPCNUwkemh-okSfl05ITdA":{"text":"This place was amazing! Looks a little sketchy from the outside but man was the food on po","useful":0,"cool":0},"f-C3dXf6jw-jGlLhlohowA":{"text":"Bourbon Street Love was phenomenal! Waiting area, both inside and outside was a bit sketch","useful":0,"cool":0},"vU6TuPTOtFT78g8r-B2utg":{"text":"I got take out from here recently and it was fantastic!! The Mac and cheese was oh so flav","useful":3,"cool":2},"-Kx8UH0KtUlgCFSads1vyw":{"text":"Pretty solid local place serving no frills southern foods. Small building where you order ","useful":0,"cool":0},"jGRgSKBfahwHDWOkJnDBcA":{"text":"Oh my goodness, I have to thank God for guiding me to this fine place. The food is AMAZING","useful":0,"cool":0},"Kieti87lc-oLRtPPX2O8XA":{"text":"Mistakes can be made but what I had today at a friends house was simply awful!! I'm so sor","useful":0,"cool":0},"0R7SUNhb_Nk1kwBvK3igAA":{"text":"Crawfish fries were AMAZING!!! Very friendly service, and quality food. Definitely going b","useful":0,"cool":0},"_oqbLvLncJ9CPkozAUofeg":{"text":"We thought this was one of those hidden gems that would be true New Orleans fare, but it w","useful":0,"cool":0},"-Q-ktxn1ujFCkk5O94nIbg":{"text":"This will be the only review that I will ever leave on Yelp, only because I want to partic","useful":0,"cool":0},"BoSLAmWULrDv05LUgRbfGw":{"text":"Food was AMAZING!! Definitely worth the trip. Would definitely recommend if you interested","useful":0,"cool":0},"C8Knw6CgP3GX3iEvp5vVCg":{"text":"Food was AMAZING!! Definitely worth the trip. Would definitely recommend if you interested","useful":0,"cool":0},"5fxKPQTqRKSWfS5y-tZVsg":{"text":"Love the seafood extravaganza. Highly recommend ordering takeout and going pickup. The wor","useful":0,"cool":0},"dgXZe4DovdXFRjigC16gWQ":{"text":"Definitely a hole in the wall but OMG the food is soooooo good. And you get a large quanti","useful":1,"cool":0},"PjuVCVwZ12vhZT2rIGQR_w":{"text":"Did you heard about Dat Kitchen? I went here when I was in the NOLA area for Mardi Gras we","useful":4,"cool":3},"pXvYtrhArqPC-cao3Iza5w":{"text":"Don't judge this place by its cover! The food was amazing!!!! I absolutely loved everythin","useful":1,"cool":0},"FcRjDnwZRd_7EPLoAT7sbA":{"text":"Amazing , flavorful food! The Superdome is a must have!\nThe service was excellent! The own","useful":0,"cool":0},"G592ez5-PXKVh3_WrSkHww":{"text":"Cheffy food out of a Styrofoam container? Don't knock it til you've tried it! Heard Dat is","useful":11,"cool":4},"xaWHSwbYJTHTBIipB1QNTA":{"text":"I'm a New Orleans native and I've eaten at tons of soul food restaurants over the years bu","useful":0,"cool":0},"l7pTswkTXsQJCa5t5EkzHg":{"text":"A MUST FOR VISITORS! The food is so good! The Mardi Gras Mambo! Bread pudding is yummy too","useful":0,"cool":0},"km2tyW3eAVfoDAe4AXmgng":{"text":"I used my paid value for the Groupon offer and still had to order the Signature dishes.  T","useful":4,"cool":2},"1Jd10Gw8NRhIB4oPUlgpJw":{"text":"All the reviews are right, this place is a gem! Reasonable prices for top-quality food. We","useful":2,"cool":2},"_MlT0qRbmdb5Kv-1q0Xpdw":{"text":"Visited New Orleans last weekend and was excited to try this restaurant after reading all ","useful":0,"cool":0},"Nbo6b3GDoQOSzWTjiLaccg":{"text":"Went to this place back when they had zero seating (wonder if that's still the case?) Sooo","useful":0,"cool":0},"KPM0VVVS6eWoHzynmc6pbg":{"text":"Crawdat fries are SO GOOD!! They drop a lot of black pepper in the sauce, but if you like ","useful":0,"cool":0},"lQprWSyr1dqzm7EB3ia8hg":{"text":"This lil sketchy hole in the wall is worth the risk!  Lol.  The food from this place is to","useful":1,"cool":0},"fm3GTOu6SuPcObpkN0ZEcA":{"text":"Wowww - so glad we found this little spot. What a gem ! Love supporting family owned busin","useful":0,"cool":0},"gRrNGh4e0mLtPYNLxBp-gw":{"text":"I visited here last weekend. The spot is a take out window so you order your food and take","useful":0,"cool":0},"PujjOnIyoM9-3pUPcNYgoA":{"text":"After 5 days in Louisiana and having wonderful meals, Heard Dat Kitchen stood at the top o","useful":0,"cool":0},"W6WlcNsiom-CfGZXu4oACA":{"text":"Had the \"SuperDome\" at Heard Dat Kitchen. Met the owners very humble. Food came out quickl","useful":0,"cool":0},"TqUYAJgjhh4oIt-jCwTW4Q":{"text":"We didn't get to try everything, which is what I really wanted to do. I'll have to go back","useful":0,"cool":0},"Q29w1fKtN25eV1V9DGxPeA":{"text":"On vacation in New Orleans and searching Yelp reviews for the best southern comfort food a","useful":0,"cool":0},"XcTXsKDPOM43X5MZReEtzQ":{"text":"This was our first visit to New Orleans. We heard about this place and was so eager to exp","useful":0,"cool":0},"7kNhRHqkdada3ixEjZgRBw":{"text":"Hole in the wall that will absolutely delight your tastebuds! Next time I go, all I want i","useful":1,"cool":0},"ZTecn7nB2JAoAE3OL--gWg":{"text":"Service pretty rude except to locals, food was not as flavorful as i expected. Shrimp n gr","useful":0,"cool":1},"aNuIE6ghGEIFfMEmXH0Ejg":{"text":"When we arrived, I honestly thought the UBER driver had dropped us off at the wrong place,","useful":2,"cool":0},"1HO4mnROGpREHCC6aqfzig":{"text":"Love love love! \n\nMy best friend turned me out to this place she would\nCome every day for ","useful":3,"cool":1},"GSu-7am9d5Lp32EklyhmwQ":{"text":"My favorite place for a quick and authentic 5-star meal. Definitely a life-long customer.","useful":0,"cool":0},"CSDW07xf2-Wlkma5fToC6g":{"text":"Great spot to try the local cuisine. I had the seafood extravaganza (fried), and it was de","useful":0,"cool":0},"c7ubwLHOY9rEo_LBslwDlQ":{"text":"One of my absolute favorite spots uptown! Everything is great. I usually don't eat gumbo f","useful":0,"cool":1},"b_94M0OQplbRPNAI2uJN7Q":{"text":"This was the first stop we visited on our trip to New Orleans and quite honestly, maybe th","useful":11,"cool":7},"f_0QIBerrnmDgRp_6OBcUA":{"text":"The food was AMAZING and so filling! I got the Bourbon Street love and it was great. The n","useful":1,"cool":1},"GrBqzdK9OyKmTcUF8SB06g":{"text":"Brought some out of town \"foodie\" friends here for lunch last week.  I had never been myse","useful":3,"cool":2},"V3wBImVGq4wUNXEtjL6OkA":{"text":"Mi familia me envió por medio de domicilio tres platos diferentes como parte de mi cumplea","useful":0,"cool":0},"ZJZJCJTMk0DwrBDhPZCvDg":{"text":"Stumbled on this place via Yelp when I was picked up from the airport. Let me tell ya it's","useful":0,"cool":0},"Myg3Ucy2mIXE1fP6w-tyiA":{"text":"I got the Superdome and it was absolutely wonderful.  The 4 of the party all got something","useful":0,"cool":0},"JS21zi6VrISrR_W2IbWsUw":{"text":"The restaurant is located in a run down neighborhood in disrepair with worn out picnic tab","useful":9,"cool":8},"i_hvWQ_CxnfCHa9paXh4jA":{"text":"NOLA.NAWLIN. NEW ORLEANS what ever way  you say it... this CHICKEN ROCKS! Hot and deliciou","useful":0,"cool":0},"wKzcavLUjtjaVpymO8oBbQ":{"text":"I have been to this place plenty of times. The food is spot on. However, I attended today ","useful":0,"cool":0},"eWsUhgJ7YSYCLvp4PhYmQw":{"text":"If you want crappy food on a pretty plate don't come here. If it's all about the food and ","useful":0,"cool":0},"EsO0gie390vj2hM-UK4nWA":{"text":"First time here and definitely would be returning. Hole in the wall with amazing food and ","useful":1,"cool":0},"plz3hU25EeP1vB6IO3ClRg":{"text":"I was in New Orleans with friends for Mardi Gras and we had some good food. However, I tol","useful":2,"cool":2},"qzxzii1ikIy9uZaT-6kwGg":{"text":"Best food I've ever had. The staff was so welcoming warm and friendly. Got the food to go ","useful":0,"cool":1},"1_CSgiUeRoZavOVdHGv4_Q":{"text":"This place is amazing. The capture the New Orleans creole food experience with everything ","useful":0,"cool":0},"Kc-Hk_RAzGJdbk_Q8bETug":{"text":"I looooovve Heard Dat! Ive been following them on social media for years before I tried it","useful":1,"cool":0},"wiwmC01OkTuZwHOSdKrqsA":{"text":"Hmm, maybe the saying to \"never judge a book by its cover is true\". This little gem defini","useful":2,"cool":1},"dFUSqvqJUP7aRT-kbJMHZw":{"text":"I'll give Heard Dat a 5 must eat only because there making 4 start food out of a 1 star sh","useful":0,"cool":0},"RaZfddUTg_JUWBwgyqrIww":{"text":"Visiting New Orleans for the week. Heard Dat was by far our best dining experience. If you","useful":1,"cool":0},"dUKxmczJgh-XzSOuff8AiQ":{"text":"Mmm mmm mmm that Bourbon Street Love meal was delicious! Chicken was amazing, potato salad","useful":1,"cool":1},"w36TDdq_2Xgr3O7q1_z7Nw":{"text":"I visited HeArd Dat Kitchen And lets just say don't judge a book by its covers. The dining","useful":0,"cool":1},"48uGyD9xbRXkKR9uV9TIRA":{"text":"Heard dat has some of the best soul food! I love their Superdome special the most, but if ","useful":1,"cool":1},"9ln8TDPcKB8W1H27zMEAmw":{"text":"Fish was gooey and shrimp were super fishy smelling. Macaroni was subpar, didn't really en","useful":1,"cool":0},"TDFCA-ayinl6fDxIauc6fQ":{"text":"Amazing! Don't bother going anywhere else!\nSuperdome & Bourbon street plates were amazing.","useful":0,"cool":0},"AukKxmq9zLstJ3d6kCHppw":{"text":"I am so glad we checked this place out. It was our last meal in New Orleans. Dine in remai","useful":1,"cool":0},"20xoPxw9R4K1LKGHZC_ERg":{"text":"A lotta bang for your buck at this joint. My boy is from the 3rd Ward and he took us there","useful":2,"cool":1},"fhngrguQ_CHTG6trNk1OuQ":{"text":"Incredible! Our best meal during our week in NOLA, better than Jacques Imo's and Luke. \n\nR","useful":7,"cool":6},"478cREdlE03qyWM2nReTkg":{"text":"I recently traveled to New Orleans with a couple of friends for a project. One day we were","useful":4,"cool":1},"1YuNCjWdJH0OIxUMiLVZ_w":{"text":"We visited New Orleans for a week. We went to all the \"great/fancy\" eats. My sister insist","useful":0,"cool":0},"AdVOtdrAMDSWByIQRn-qeQ":{"text":"Tried it for the first time last night and was not disappointed!! The Superdome was so del","useful":10,"cool":8},"uIUpCx6xYnxP8TONSpUzaQ":{"text":"So I saw this resturant on Yelp with 5 stars which is rare and I had to try it. I ordered ","useful":0,"cool":0},"3zJ0SzrRqRDzV7DT2xDHfw":{"text":"If I could give this place 10 stars based solely on the food, I WOULD. This place had the ","useful":3,"cool":3},"aPVTACUI2p5qyntU5Hllaw":{"text":"I'm vegan, and the chef went out of his way to make me a beet salad. Besides the fact that","useful":1,"cool":0},"RunzZnb6_CFWlG0TKW5nKw":{"text":"I ordered the special of the day - cajun pasta topped with fried crawfish. I also ordered ","useful":2,"cool":0},"PrrYNG6Y9ChWTZTs3ldyWg":{"text":"After meeting the owner Chef Jeff and sampling his food at Black Restaurant week sneak pee","useful":3,"cool":3},"KCS3_6BWyn9eChFLM3EW-Q":{"text":"All I have to say is WOW. I had the \"Dat Plate\" with fish and it was amazing. Please pleas","useful":0,"cool":0},"ZDOscAz5UXBKffsgCf6Q2Q":{"text":"During this goofy world situation Heard Dat and the fastidiousness to their takeout fare s","useful":0,"cool":0},"7b80Y20peVWaWIC_b6F4pg":{"text":"I came to New Orleans just for Heard Dat.  It is still good over a year later. Ordered Sup","useful":0,"cool":0},"t4CIwM2nzQ905gKpAZbZvw":{"text":"Everything was amazing! A friend recommended Heard Dat Kitchen, so glad we had dinner here","useful":0,"cool":0},"eLyuKD3T9a4koc26sLgSWg":{"text":"By far, my favorite spot in New Orleans. My go to orders are the Superdome and Bourbon Str","useful":0,"cool":0},"VIqMpoLN3X_HWnjem_tXCw":{"text":"Funky little place off the beaten path that is well worth visiting.\n\nGot the following:\n\nB","useful":1,"cool":1},"wug8H9dHoF7qkQDhQJi6Jg":{"text":"Okay so this is a grungy little place in the hood and your order is taken by a lady behind","useful":8,"cool":3},"I111lq2tA3gJOIKAZLFqyQ":{"text":"OMGAWSH . . .talk about an pleasant surprise!!!! We went here based off yelp reviews, plus","useful":1,"cool":0},"dvq3BjT1NS5yRDE0eAFGyA":{"text":"Chicken w Mac n cheese and shrimp and grits. I was looking for a place to eat and I am bey","useful":1,"cool":1},"P-UCTh5M5bUYH8lz9R7org":{"text":"This is hands down my favorite place to get creole food in NOLA. Their \"crawdat sauce\" is ","useful":1,"cool":1},"jQ5rF7-f0LwFRqIIMMuk0Q":{"text":"Got some food delivered from this place via Postmates for a picnic lunch. Was it cheap? No","useful":0,"cool":0},"pUP9nn1pIXLZ1Kx1-RoaYA":{"text":"This is a little hike from the French quarter in Mid City. We took the trolley car, then w","useful":2,"cool":0},"dIjc9Nv2uFXkfz99u1cfXw":{"text":"When I tell y'all this chef has it, he has it! So we are hungry, in search of something go","useful":2,"cool":0},"WWpGk0h2Mt6nlvDnrY8ypA":{"text":"My husband went to NO last week for a conference. I made him promise to bring me the Bourb","useful":0,"cool":0},"67zagks_jwCHFtKegojXSQ":{"text":"Not much to add to all the rave reviews here. I loved the Superdome. Hubby's Bourbon Stree","useful":2,"cool":2},"eKF8vhKNPcLjlykmI_Naww":{"text":"I never been a fan of grits. To me, they're tasteless. But when I got the recommended Shri","useful":1,"cool":1},"YgGMxzUVvUA8wD51kIL97Q":{"text":"Let me tell you something about a hole in the wall. It's a spot for some of the best grub ","useful":9,"cool":4},"5UOZ_kzo3SH9_l2d-bq9kQ":{"text":"THREE TIMES! Yes, it was three times I came to this eatery during my five day stay in NOLA","useful":6,"cool":5},"2PDW2QtMbeu6irwLgkE0oA":{"text":"This was the best meal I've had in quarantine so far! It was delicious, reasonably priced,","useful":9,"cool":6},"9sP9AedX7sI0-hfGklMYKQ":{"text":"Heard Dat has some amazing food across the board. The prices are reasonable and the parkin","useful":0,"cool":0},"qDjdiScofOeEpqCLy-TOpQ":{"text":"Explosive flavor in every bite! I ordered the bourbon street for delivery through the Yelp","useful":0,"cool":0},"BZkg8AQFIJu78doEQ13UwA":{"text":"Loved this place! The fried chicken was so juicy and the Mac n cheese was one of the best ","useful":0,"cool":0},"jAcCMqbOOdRNzEeC5YE6hg":{"text":"Absolutely delicious food and probably the best \"New Orleans cooking\" currently available ","useful":2,"cool":1},"CWO7gaxzDYRELyEoB_BIBQ":{"text":"This has been on my list of places to try for a longgg time! I got the Superdome, which is","useful":0,"cool":0},"AW7mKUOsVRRMcDNQhCjANw":{"text":"Our modified lunch group caught this one as a recommendation. On arrival this place didn't","useful":2,"cool":2},"QRkEj7V0d6kUK2TKH8z06Q":{"text":"I decided to check this spot out at the end of my trip to New Orleans! I actually saw this","useful":2,"cool":1},"5CtRyXIXdIFX2S5Xivct8w":{"text":"Run do not walk to this place. I went here a year ago and I still can't stop talking about","useful":1,"cool":0},"e0T_Cp1gLbsS6q3FmZGEfA":{"text":"My friend found this place on Yelp w/ good reviews so we decided to make this a lunch spot","useful":1,"cool":1},"NgsgXE_aXkupBnfm-IH0Hw":{"text":"Really wanted to try this spot.  Was visiting from out of town.  Walked in and asked the l","useful":0,"cool":0},"SfTIOAJdU4v3KPsEKqx82g":{"text":"Great food and even better people.  Exceptional, focused menu with daily specials.  Etouff","useful":0,"cool":0},"7KNOvytjWkOr3o4VJjtO3w":{"text":"came here in person and the seating was closed so only to go orders. All the food was abso","useful":1,"cool":0},"yAO8mYUzZgDsnG6DmMEZhw":{"text":"Walked half an hour to get here through some shady areas  just for it to be closed even th","useful":0,"cool":0},"iEnQFhXNYDK2Y27rUsdhuQ":{"text":"This is EXACTLY the kind of food you want to try when you come to NOLA. Nothing fancy, a t","useful":2,"cool":2},"q5WvFELdZj0HmPs2PrUPFw":{"text":"I got the Superdome and The Bread pudding.   It was awesome. It is on my list to eat at on","useful":0,"cool":0},"7BsGYBe2BbnbSxD2WDS61w":{"text":"The Bourbon is one of the best things I've eaten in a long, long time. It is a perfectly f","useful":0,"cool":0},"6-Y7oKFed0c6TMy4C5sTMw":{"text":"The food here was next level. My mouth was so happy! Those fries with candied bacon ... wh","useful":0,"cool":0},"z0t1WGFeFxrzHnzT6hJXog":{"text":"Heard Dat Kitchen is in an excellent location, within walking distance of the Superdome. P","useful":2,"cool":2},"SUcvDS26Qe8aKp5PO2cmqQ":{"text":"Simply put this place is a hidden gem of soul food,  if you want a place that is all about","useful":4,"cool":4},"klnFvRy-wdEoFFZmele7xA":{"text":"the superdome is likely one of the best dishes I've ever had. can't wait to get back to Ne","useful":0,"cool":0},"SnLeKdFAQ8hk3x6JN6f5Ew":{"text":"This place was amazing! We had an off the menu shrimp appetizer with a pepper jelly sauce ","useful":1,"cool":1},"KjcSh07iKAwqRKm5KfAzAg":{"text":"My family and I were visiting from Boston and were hoping to get some good southern food. ","useful":4,"cool":0},"aYYgW6F2Y83MWmjPNFH_DA":{"text":"The skeesh shrimp salad is soooo good!! I recommend it! Unless the weather is nice you hav","useful":1,"cool":0},"QO5d2lG4NBYIE1jN13BoAQ":{"text":"Visited NOLA for a night. \nSaw this place with 5 stars on Yelp. \nGot dropped off by an Ube","useful":4,"cool":0},"8DtoEYiPlVMoCZ_4n35JeQ":{"text":"Delicious, soulful New Orleans style comfort food. The chef here has some chops and execut","useful":13,"cool":8},"ORWKvt0HO_ISPZKxvD1y8A":{"text":"Don't sleep on Heard Dat!\n\nMind the neighborhood, embrace the culture. Love the food and t","useful":2,"cool":0},"OU6ZgEufFBLSA9mBa3Jt9Q":{"text":"I came here a total of 3 times so far. This place is pretty small with only 2 small tables","useful":4,"cool":3},"BvtGL3j9yZPLi8LYWbIFBw":{"text":"New Orleans is know for those small mom and pop shops that produce some of the best food y","useful":1,"cool":0},"fjsH8x77_eEeWLz83_pfrQ":{"text":"First, the food! Everything was amazing, and chef Jeff absolutely rocks! The fried chicken","useful":2,"cool":2},"ZvfgFRy2dFGmq4LRU3KR5Q":{"text":"Absolutely a five star event.   The owner and his kids do a beyond great job serving fine ","useful":0,"cool":1},"gVfIOEOq1MqOxNK6NxSXRQ":{"text":"Superdome is a must!!! Dat Tea is to die for and I hate tea. Skeesh Wings are the best fla","useful":0,"cool":0},"AwBQTtATd2jycVYJlrotEQ":{"text":"The food here was beyond delicious! And worth every penny. We got the Super dome & Bourdon","useful":0,"cool":0},"zfAxEAWFG84kCsTnBxZuXg":{"text":"Overrated. I really don't understand these 5-star reviews. Let me give you the real deal. ","useful":4,"cool":0},"fDqffmX5E_tcYdl5So1F4A":{"text":"Absolutely great experience! I've ordered here before for pickup and had a great experienc","useful":10,"cool":7},"_7l7kE7A526EgmZ05gHC_w":{"text":"DAT FIRE.\n\nThat's really all I have to say about Heard Dat Kitchen.\n\nFor a while, I indulg","useful":3,"cool":3},"yoHgGjkfWxqZwgDRRLmNNA":{"text":"Never judge a book by its cover. Yes, it's a sketchy area. Yes, the one table entrance is ","useful":5,"cool":3},"koX5I7NN6L0UQTRe3oYFSw":{"text":"So dont let the outside nor the inside fool you! The food is to die for!! Let me start by ","useful":1,"cool":1},"MXulF1eFhmRPWIYT21uxzQ":{"text":"The first thing I need to say is that if you are a pretentious person who judges restauran","useful":4,"cool":2}}