{"ilUx2aufpOvE1LWKuMqjHg":{"text":"Cane and Table represents a trend in bars that has run its course. It may be newish to New","useful":0,"cool":0},"mHEpIOQ8XQjFJc5AV5dXRQ":{"text":"If you're looking for a great place for cocktails where you can sit and enjoy their great ","useful":1,"cool":1},"snyRckQf2SRa2-ykme9fKQ":{"text":"Been wanting to come here for a good while now, no regrets whatsoever. Awesome selection w","useful":1,"cool":2},"ci5Xw41MchbQXs3-TiYZlw":{"text":"Great little hidden gem with no street sign on Decatur st. Nice change of pace from the us","useful":0,"cool":0},"1184Bs4-L0Rp8UZ4UoYVnw":{"text":"We were in NO a few days and tried gin fizzes along the way. Cane and Table makes the best","useful":0,"cool":0},"hFZqpR0P3nwh5V9l5BB5Mw":{"text":"When I asked the master of drinks behind the counter what he'd call his place, he said \"ea","useful":0,"cool":0},"vd0bhiKngL_sotu_Aa5F4A":{"text":"We came here twice, first time they were closed for Ash Wednesday, which was legit.  But I","useful":1,"cool":0},"T_NFKEVydx0UYGbsT0WsIA":{"text":"Could I give zero stars? Rude and bitchy staff from the host to the bartenders. Slow servi","useful":0,"cool":0},"UWtwif5qLdec-L-ulfQ2Rg":{"text":"Stopped in for a drink, had to wait for a spot at the bar, but not for long. Drinks were g","useful":0,"cool":0},"QqpCSA03c-CS2XEjPovWcQ":{"text":"This just place blew me away. \nI knew by reputation that the drinks would be top-notch but","useful":0,"cool":2},"cYg24uVs9Lm_0nf26-yRkg":{"text":"What an amazing hidden gem. We walked past a number of times and never knew it was there. ","useful":0,"cool":0},"mQ2JGrHMXr_CqZWnA-SPww":{"text":"A local recommended this place in hopes I would get a true feel of Nola and not just touri","useful":0,"cool":0},"ftzSbeu9d9Ei1vrkgBTJ9A":{"text":"The drinks were great but the food selection was slim. Make a reservation if you're going ","useful":0,"cool":0},"F9HsGiVp18aCR-9Ry_Ga8A":{"text":"Visited this bar while in New Orleans in late-February.  In mid-afternoon the place was qu","useful":0,"cool":0},"UqnkC-8pvWq_gQTQPy1AKQ":{"text":"i'm so glad we stopped in this bar.  it was a respite from a very cold day last month.  th","useful":0,"cool":0},"auQGj8GwvWR9gQK5rHEA6w":{"text":"So this is a 3 star review and I reviewed Cane & Table previously and gave it 4. I think t","useful":0,"cool":0},"qdxdQ5k14NngdIcUVShpDQ":{"text":"Huge disappointment. I was really looking forward to this meal but almost everything was o","useful":0,"cool":0},"SU-Vjkg2E6NsJq2XB-06wg":{"text":"Interesting Latin fusion, but more like Latin confusion. Fried yucca chips and hummus, not","useful":0,"cool":0},"DvO_t-P1iW5ZdKKp3fRD8A":{"text":"Sal the bartender was the best, turned us on to the ribs and best venue for music of Frenc","useful":0,"cool":0},"bV58k1dbxHzv2OpiIzkxvQ":{"text":"Ambiance was a 10. For sure. Service; crap. We waited for a table at the bar where it took","useful":1,"cool":0},"enOPjyyctb6mdKGppCUDlg":{"text":"Boss colada and crispy rum ribs=heaven. Chef Ean and Nick the bartender know there stuff. ","useful":0,"cool":0},"reDBQaKz5VSbxy37GsQRuA":{"text":"One of my favorite places in the quarter. Upscale, chic, and awesome craft cocktails.  My ","useful":7,"cool":5},"-rB3DXDLILG0k05utH34HQ":{"text":"At first when we arrived we were a little overwhelmed, it was raining outside and inside t","useful":1,"cool":0},"SN6KKaP0XowtGnsk2Vnu3A":{"text":"YES! I happen to love tiki bars and tiki cocktails, so I was so excited to see this place ","useful":0,"cool":0},"Qkk6Ju1rRgqjhwFGB227Fw":{"text":"This is a great bar that's a bit hidden. The cocktails are amazing but a bit pricey for th","useful":0,"cool":0},"5uUvPJ23eQTKfhS2mZbSWQ":{"text":"Best cocktails in Nola! I had read about this place before making my visit and I was so gl","useful":1,"cool":1},"6PuIbZjEO4DqAmH5HBxOBg":{"text":"The cuisine is described as \"rustic colonial\" and the decor does reflect a bit of a rustic","useful":0,"cool":0},"yZ6ULzASMfOeunMm-QpUGg":{"text":"The ambiance is decent and apparently they have a nice courtyard, but if you're in for dri","useful":0,"cool":0},"GLj7JIGzasEGLPJsBUp7Cw":{"text":"Stunning raw space, charming waitstaff, excellent creative cocktails and delicious dinner.","useful":3,"cool":1},"-ITTCqKZYffNkLyqpJg1Ng":{"text":"Lovely cocktail bar with tasty food. We got the Crispy Rum Ribs and Fresh Puffed Pork (I.e","useful":0,"cool":0},"6Dq0dUydfpGLekAGCrzoYg":{"text":"Wow. Probably the best meal and cocktail I had in New Orleans.  Great patio outside in the","useful":0,"cool":0},"NYewpJSKXGthCUecKMUbYA":{"text":"Rum Ribs!!!!!!!! This place has a great vibe, friendly staff and amazing food and cocktail","useful":0,"cool":0},"mG7g38oE_ryVp5os_XnUng":{"text":"This place is so adorable and the bartender was excellent. Didn't try their food yet. The ","useful":0,"cool":0},"NPPa6m34pY4JT-IxD_5U-Q":{"text":"I came here with some friends  for the Sunday bottomless drinks brunch. Delicious drinks a","useful":0,"cool":0},"l20lyu-5OEUiSTqcQzeZaA":{"text":"My fiance and I LOVE this Cane and Table! It truly is a hidden gem in a very busy part of ","useful":0,"cool":0},"qu1xkg3LuBQjqveYNNAmZg":{"text":"Really wanted to try Cane and Table since I've heard good things. However, they refused to","useful":3,"cool":0},"y-xSLemHkzvMTYPcNjWKAg":{"text":"I had seen this place featured on the Food Network for it's special Duroc pork rib appetiz","useful":0,"cool":0},"QTBbzyMDY9ha8KWGwZ_UBg":{"text":"Food and drinks were excellent but will get into more detail about why I gave this place o","useful":0,"cool":0},"zw9A7wV_V2-4dWuBUDjFBw":{"text":"LOVED this place! Great cocktails, GREAT FOOD. Went with a large group and everyone left f","useful":0,"cool":0},"E35j2R3pZO_u2xFDvaryyA":{"text":"Yummers!!!\nWe got three small plates to split between two people and neither of us left hu","useful":0,"cool":0},"0-vd7A0cuQrTgVff6ynwRQ":{"text":"Well I know that it is hot and humid and Nola is full of bugs during this weather but a ro","useful":2,"cool":1},"sAnNjS3ZT4ER17Unahfi0A":{"text":"We went on the late side, only for the drinks.\nLike our previous night at Bellocq, we were","useful":1,"cool":1},"iJXCML3C_w5WGR-Cb59VaA":{"text":"After a bit of wondering (looking for a decent drink), we stopped in on a Sunday afternoon","useful":1,"cool":0},"Gk9VfKge0U3qtgn7X95RMA":{"text":"I love this place. The drinks, service and ambience is EXACTLY what you want from a FQ est","useful":0,"cool":0},"dj9C5EBvxnWeGhwm7cJicg":{"text":"I love this place. Hands down one of the best cocktail bars and restaurants in the city. I","useful":0,"cool":0},"-Yy0nja2rjdnGec3OsQLRw":{"text":"Waitress seems annoyed to be here. Short rib is super dry and fatty, but nice presentation","useful":1,"cool":1},"iNCuyRonrZXvOrfZNUEHng":{"text":"I would highly recommend Cane and Table.  The food was outstanding and the drinks and atmo","useful":0,"cool":0},"bvr2E2pUpiFkePHRw73MAw":{"text":"The restaurant is hard to find with no apparent signage in sight. I suppose this can creat","useful":0,"cool":0},"aJCRwdvkFhuCGLA11Eh5Gw":{"text":"I would easily rate this a five star cocktail bar.  The under 35 vibe combined with classi","useful":0,"cool":0},"16l03G1bLqwhgTMI6IRpAg":{"text":"I really liked this place! I will admit, the pictures of the interior on yelp are a little","useful":0,"cool":0},"cJlW2eU4NQXxKVHDQpGvIw":{"text":"Cane and Table serves up some amazing drinks and have quite an extensive menu of signature","useful":0,"cool":0},"ZNAKUvm0bnzwBYgKR24SHQ":{"text":"Amazing bar-restaurant so different than any French Quarter place\nAmazing cocktails (had f","useful":0,"cool":0},"ZWFU37eRIqwa4eclqQd_uQ":{"text":"Recommended to me by a friend of mine who frequents the city. After an awful breakfast at ","useful":1,"cool":0},"dfakpgkjhdQWJniB0T3TKA":{"text":"I almost hesitate to give sterling reviews, especially in N'orleans, because all the drunk","useful":1,"cool":0},"mQJOa1xTqqdqLudZ_zYDqw":{"text":"Disappointed. Beer was hot and food was just okay. Waiter seemed he'd rather be somewhere ","useful":0,"cool":0},"Le6Y-2tniu2G4DyeeoNYaw":{"text":"We popped in on a whim after visiting the French market, I had this place bookmarked but w","useful":5,"cool":3},"MSVOicS8f12d8yOfCwmb9A":{"text":"Had our company party here, and they made our night memorable. Excellent service, friendly","useful":0,"cool":0},"ekurXYtUiTUbVyeYdX0oqA":{"text":"Came here based on a recommendation from our walking tour guide and was not disappointed.\n","useful":0,"cool":0},"4sj-U1w5MZjjud6RV044bw":{"text":"Wow!  This place came as a recommendation from friends and we owe them a thank you drink. ","useful":0,"cool":0},"0QkyTWwIyumLjXXm5-266g":{"text":"Their Coolinary menu got my attention with watermelon salad, pork entree and pan perdu des","useful":1,"cool":1},"4Kmm3R1NmcpvBK6b9_CrJA":{"text":"Review update: had another excellent meal here today. It was my first time experiencing th","useful":2,"cool":1},"VFVZODZYD13ioHEBtS-jQw":{"text":"The deep fried ribs are one of the best dishes I've ever had. Great drinks and food all ar","useful":0,"cool":0},"v3R3lOwYfinHrM8M1Gtszg":{"text":"The cocktails and bar were amazing! We had 3 apps that were good but not great. Worth goin","useful":0,"cool":0},"EYLOVTzjM9ccDXlXTnDv2g":{"text":"I honestly didn't know how many stars to put because they would not serve us a normal dinn","useful":0,"cool":0},"NOhGr0ZlI2VY-eZ6FALaHA":{"text":"The atmosphere was out of this world . The service was exceptional. The food was absolutel","useful":1,"cool":0},"1mSbqj9dHjt65KPeayQpIA":{"text":"I was very disappointed by this place. We walked in and the service was pretty slow. We or","useful":0,"cool":0},"D4w9FmgqeUISV0O_lO_hCA":{"text":"This was the first my fiancé and I dined at upon arriving to New Orleans. The service was ","useful":0,"cool":0},"8EFVvUfXvvZpAeugGNoxHQ":{"text":"The steak frites and avocado salad were delicious, the cocktails doubly so. A local recomm","useful":0,"cool":0},"KOQbmK1kmwjDm_OLD_wIrw":{"text":"We made reservations, but it was a rainy Monday night, and there were plenty of available ","useful":4,"cool":4},"n-VZqnIEiksDLxc2MrVCHA":{"text":"A must when you're in New Orleans. Great drinks, and even better food. Also, the service i","useful":0,"cool":0},"1O8hIzrii0apikQC4Bzu1g":{"text":"Fantastic spot away from the chaos of Bourbon Street. I asked the bartender at Sylvain whe","useful":0,"cool":0},"a0GaUIlG6rr9sv1mEENYsw":{"text":"The ambiance is stunning and the small size of the restaurant manages to stay cozy rather ","useful":0,"cool":1},"in_1JoaS8TK_dKmRLhzOfQ":{"text":"Happily stumbled on this place. The atmosphere was awesome. The service was great. The foo","useful":1,"cool":0},"R8Fd6CMpwtZk_Nc_WKBijw":{"text":"My husband and I honeymooned in New Orleans last week. Of all the places we ate, which was","useful":0,"cool":0},"_Ei-TVysW5v7tlmE8hfqvA":{"text":"Note:  This review is only based on the service, ambiance and cocktails. We had already ea","useful":2,"cool":0},"dz-jziZC-BitK5T6GOff9A":{"text":"Let me start by saying my interest in Cane was their James Beard nomination for their bar ","useful":0,"cool":0},"IVPLpCTwhvANEQlvT3czCA":{"text":"While we were mostly looking to nosh on Creole and Cajun cuisine here in New Orleans all t","useful":1,"cool":1},"EmRjk2rNb0PnFuK6oKlJYw":{"text":"I was expecting great things after reading all of the reviews on here and Eater, but i was","useful":0,"cool":0},"iJjf79oT5EziOYqss0IKDw":{"text":"Take a walk on the wild side. Try the puff pork skins, the fried pickles, and beef skirt s","useful":0,"cool":0},"FktMKncjnbcUNdQeEF9cKA":{"text":"What a great place! We went at the height of the dinner hour and people were waiting in li","useful":0,"cool":0},"MzebDUQFbCYEwfqTQOyidA":{"text":"We had very high expectations after numerous compliments from a close friend.\nUnfortunatel","useful":2,"cool":0},"nXoSdIMxShdB1-rJaNo6qw":{"text":"The four of us out of towners agreed that our meal at Cane and Table across the board was ","useful":0,"cool":0},"fKxKC_9v2o8zQgu2tKxxng":{"text":"We had the good sense to have our wedding reception at C&T's beautiful space on a Sunday n","useful":2,"cool":1},"eUpkRhTx-V5q5UqZ3Rz-Qw":{"text":"So we decided to eat at Cane and Table on a Friday when they seem to open early that day f","useful":0,"cool":0},"fVePRdKXy35qCOL0FkIMrQ":{"text":"Do not miss the food at Cane and Table! It seems like a lot of people just stop in for dri","useful":1,"cool":1},"N0pa8mkhMCPvtXcmSEZDhA":{"text":"I am posting this review just to rave about how great the Yardbird is. I think you can tel","useful":0,"cool":0},"0ixtoNSppzqqSZQRzfw_GQ":{"text":"From the ashes of Pravda, Cane and Table emerges as a new and exciting alternative to the ","useful":12,"cool":9},"yo2PZ0-rzjIDuB5WusJ2Uw":{"text":"Fabs (fabulous Abby) and I came here for some after work happy hour madness as a pre game ","useful":0,"cool":0},"xlkuvuKLhnBmcm7VaASeCw":{"text":"Slipped through the door off busy Decatur\nStreet and experienced the charming ambiance of ","useful":1,"cool":0},"T73aXEFBeGjrAdIvFS042Q":{"text":"After an unsuccessful attempt to get into Sylvain on a Friday night (chuckle chuckle), our","useful":9,"cool":0},"QaLsEgSvTIx71Q3fQfOvzQ":{"text":"Currently sitting in the restaurant writing this review... let's start with- amazeballs. \n","useful":0,"cool":0},"NO2UfgAQEFPso47CNzcwzg":{"text":"Cane and Table is a tasty addition that breaks the mold of the French Quarter food scene. ","useful":0,"cool":1},"dgy7N9BgYlapjdXEE2-qNQ":{"text":"Love this place! Affable, smiling owner. Long roomy bar w/comfortable chairs. Beautiful dr","useful":0,"cool":0},"PCijl0ukp9xs0vFQc6tdRA":{"text":"Matt Young is the sexiest bartender in the whole goddamn world. Nobody daiq-attacks me lik","useful":0,"cool":0},"hfuD4cKQ2oIyuZXnWV-nPw":{"text":"This place is low key and very cool. It reminds me of New Orleans in the 1800s. The old fa","useful":0,"cool":0},"DtnL7dp1yJYb4JjeEkKKGw":{"text":"Amazing creative drinks. Ask the bartender for suggestions because some drinks may not be ","useful":1,"cool":0},"51faCDxILnyBQEDQNsmH-g":{"text":"we came here during an awkward time... well after lunch and too early for dinner.  so they","useful":3,"cool":3},"xJWTukwi56O6WaY_9sQyLg":{"text":"The place is really cool inside and I thought it would be a great brunch spot.  Their drin","useful":0,"cool":0},"hLh4_XNB90-owtiOz_T2SQ":{"text":"What a bummer. Came here alone on a quiet night, quiet except for a super loud and sexist ","useful":3,"cool":0},"NJ4QRuo_ZIBHT5IPZwk2fQ":{"text":"The Crispy Rum Ribs are freakin' awesome! ! Skins crispy and meat so juicy mmmmm and then ","useful":0,"cool":0},"I8P7EQo68i8GAFBtYvSwqg":{"text":"Fantastic food. The ribs were to die for. Very unique. Also had a bunch of sides and every","useful":0,"cool":0},"oOqjPJtvWEtRJvw5Phv1ew":{"text":"Compared to the reviews in magazines, the food wasn't as good as expected. It was authenti","useful":1,"cool":0},"6rY7xOvKr-FKXpRdcpdFAg":{"text":"I sure wish that we had been able to spend more time here, but the first time we tried to ","useful":2,"cool":3},"10K2-K2sZW-dYX5PnFkyjQ":{"text":"Popped in for a cocktail and a snack and had my mind blown. After taking a glance at the c","useful":0,"cool":0},"Uo9FTueiKCnxAmL9wvk5Rg":{"text":"Oh, cocktails. \nThey do some of their own spiced rums here. \nWe worked through a number of","useful":0,"cool":0},"Z56itZbTtnDIBt-Ku_ud2A":{"text":"Amazing drinks and fantastic food, but rude and snobby servers and bartenders that left th","useful":0,"cool":0},"PxPg_ez2YuERxe377p7oaQ":{"text":"Really good drinks at very reasonable prices!\nIt wasn't super crowded which I really like.","useful":1,"cool":0},"W2Zs55h-eqMuYyJMS6tzjQ":{"text":"Great space, interesting takes on classic cocktails","useful":1,"cool":0},"r1y5Lny30vJkcZ9fKZQRwA":{"text":"We received a nice Twitter recommendation while looking for great cocktails in the city an","useful":1,"cool":1},"tW9WJEau4hpEtR8gYoCNfA":{"text":"Super disappointing dinner there tonight. Made a 7pm reservation for two. Not necessary - ","useful":1,"cool":1},"lNAVdfOakPawQXg_1O_QRQ":{"text":"The cocktails are good, the food menu is limited but good, decor is nice, and it's usually","useful":5,"cool":3},"P5OPaZHK2Yl0AwJjbRq5jA":{"text":"Enjoyed a great dinner at Cane & Table last night.  The interior is beautiful with its mar","useful":0,"cool":0},"yF7901wtn-rrkQ-401g2Qw":{"text":"YUM.\n\nEnded up here almost by accident, following the cocktail recommendations in a Southw","useful":0,"cool":0},"HblmEI5bGr_iuqUICbc6dw":{"text":"Love this place. The bartenders are awesome (Matt is the best), the food is different and ","useful":0,"cool":0},"jirRz5h9QZ9XfusX4vDPBQ":{"text":"Pretty good place.  The vibe inside is soft lighting, vintage walls, marble bar tops.  The","useful":0,"cool":0},"IVJTUNfjp60brU47yS-9AQ":{"text":"Not that good! Jerked chicken had zero jerked flavor and the crispy potatoes were not cris","useful":0,"cool":0},"QwCgstlTB0GVXXGIe58kAA":{"text":"This restaurant is easily overlooked due to it's location but it's honestly one of the clo","useful":3,"cool":2},"yE5nkrv_UceUBeYAIWNmYw":{"text":"We happened upon this place following a recommendation from a vendor in the French Market.","useful":0,"cool":0},"jr6WSDPCET4W10poZBPW_g":{"text":"This place is awesome, you should try it asap. I went to their sister spot bellocq a coupl","useful":1,"cool":1},"lcd4xHrDnCX6PASR7RtJqw":{"text":"Went here for my fiance's birthday at his request. The drinks were great the service was n","useful":2,"cool":0},"Xn3Ih__WXi9eWbtB5xJ68Q":{"text":"Hands down.  my favorite place in NOLA. I'm a vegan, was able to eat incredible food along","useful":0,"cool":0},"sHMgt6uc6uH8lBVI0nTlGw":{"text":"We stopped in on our last day in NOLA for a drink. We had heard about this place form our ","useful":1,"cool":0},"Mc7fG8xhxuB0qrkO5Af__w":{"text":"Great cocktail spot. Go here to be thoroughly impressed by their mixologists. After a few ","useful":0,"cool":0},"MfPWQPcsbRtl6MxWO3GX9w":{"text":"A beautiful classic style restaurant with a Caribbean vibe capturing the old school feel o","useful":0,"cool":1},"zLjTQl3BEBd4RRpGGhyXmQ":{"text":"We booked the private upstairs room for our anniversary party and worked with C&T's Leila ","useful":0,"cool":0},"BSCwalkqczbe9qQz9JhNqg":{"text":"Came here with a large group while visiting Nola. We ordered the kale salad, crispy ribs, ","useful":0,"cool":0},"nl_MlaiaTP3syJ7m83EorA":{"text":"Had been looking forward to checking it out, but clearly I hadn't been missing much.\n\nCame","useful":2,"cool":0},"UNo8ULR1habXSlDVi_bROw":{"text":"Some of the best food and cocktails in New orleans. So classy and beautiful inside. Perfec","useful":0,"cool":0},"QfIfQ49KtlhgHyyCyPAFjQ":{"text":"Came here for lunch. The service was wonderful. I had a small cup of gumbo with a side sal","useful":0,"cool":0},"jnsmcnOykEjZMFRZncrKjQ":{"text":"I want their recipe to recreate their Daily Punch with 151 Rum. That drink was so good. It","useful":0,"cool":0},"b91pO-WRFdaGGVPoLdc04A":{"text":"From the cure company.  On point craft cocktails.  Really good Mexican food.  Date night p","useful":1,"cool":1},"ypYCnKqhaS5K9f1jHOXg-A":{"text":"As good as my first visit was to Cane and Table, I guess I was disappointed when I returne","useful":4,"cool":0},"T6hv--hm5vFZ6fUEYWTNyA":{"text":"rioja wine and rum ribs, they're pricey but its a big serving a well worth it...how can yo","useful":0,"cool":0},"JpZf3FlvVHb8ba14jWAtYw":{"text":"My husband has been wanting to come here for a while. Worth the \"search\". No sign to keep ","useful":0,"cool":0},"nnqfeihnM9LB_UdI9JU07Q":{"text":"Walked in around 11:30am on Sunday and easily grabbed seats at the bar. I ordered the hous","useful":0,"cool":0},"TtuoYWV7phCUcn_1Xdo2RA":{"text":"Delightful little spot. Perfectly appropriate staff knew when to stop by and when to let u","useful":0,"cool":0},"ox5rM6U6ogcANH9GdlUkDg":{"text":"We lucked out and came in early for a drink and a bite, and even though it was raining out","useful":0,"cool":0},"r3F2rpAlFQWpy0JlS9HjKg":{"text":"When I'm feeling really bourgeoisie, I like to get myself a beer and a shot while being gl","useful":0,"cool":0},"XJKt8wwZvIajQ32wg3xmVA":{"text":"This is one spot I was thrilled to visit during my trip to NOLA. Elegant ambience sets a r","useful":4,"cool":0},"B3uta3M79ypZFGkE3cWzoQ":{"text":"I asked for something sparkling, floral, with citrus and ginger and not too sweet. The bar","useful":1,"cool":1},"qoMv0efcqK_RQOw5EAkyUQ":{"text":"What outstanding restaurant! Molly our server was out standing!   Craft cocktails with a p","useful":1,"cool":0},"5aBXvhZgREbTo3lyYCHjmA":{"text":"Such an amazing meal! The yucca chips with the hummus Dip were a wonderful way to start. T","useful":1,"cool":0},"xd7_nt8oSilyEMaYYtCXvA":{"text":"**This review is solely for the drinks. We did not eat here.\n\nMy friend and I were searchi","useful":0,"cool":0},"oFxqqrU44D8Ol75Mc1cyiw":{"text":"Nice, tucked away hipster spot. Great cocktails very unique to the area...very new York fe","useful":0,"cool":0},"UsFqQtIXXH7sLcg2UUPi8Q":{"text":"The best! The food,  the drinks, the prices, the decor... Ioved everything about this plac","useful":1,"cool":1},"buXH0E8o0tpUzXz-o95fBQ":{"text":"My mouth was so happy. The crispy ribs and corn were to die for and they served fantastic ","useful":1,"cool":0},"BeN20wc0N2z2InYKpPQlrA":{"text":"The ribs and Ropa Vieja were great. The only issue I had was they were out of a signature ","useful":0,"cool":0},"rXOn3QpCmmFJL1muGNa0_A":{"text":"We made a quick stop here on our tour of the tiki bars. This is a lovely setting. The cris","useful":0,"cool":0},"Cs-9T5f0EcS0HbEhuqBGlA":{"text":"We went later on a Wednesday night... very chic/sophisticated French/Cubian feel to the dé","useful":0,"cool":0},"yeoukYeVTxEWj3FuSYjZYw":{"text":"Was really looking forward to trying out this place.  Had heard good things and I knew tha","useful":0,"cool":0},"Jgx9RASP6VZ3gUstdgwaFA":{"text":"Four of us ordered 4 separate dishes and all of us raved about our choices. Since I'm writ","useful":0,"cool":0},"BNZcBkOet7vfgemoCfi44Q":{"text":"Order the ribs. Strip them clean. Suck the marrow of life outta them. Then gulp down magic","useful":1,"cool":0},"dhC7pSOUvdGbv9Q4--9Eag":{"text":"Great bar with inventive cocktails, fine service and a gorgeous patio.  Small plates are f","useful":0,"cool":0},"c39CsMWa5w5F0fzeZ2v7RA":{"text":"The Crispy Rib App was amazing - the rest was good (except for the scallops).  Drink conco","useful":0,"cool":0},"L-YbFFzVTQU3fJ1uL2mpMQ":{"text":"Food was interesting and generally good. The watermelon salad was over priced for 4 tiny c","useful":0,"cool":0},"x1IxAu3dcc9Qm01EGvhahw":{"text":"Our bartender was an expert in the craft of the cocktail. I drink in every city I attend a","useful":0,"cool":0},"HxlG2Ipp2tCBH27nt5Zt8g":{"text":"Came here Saturday night during the parade.   The restaurant is beautiful.    Even the coc","useful":0,"cool":0},"nsdMyEc_uaXKuvvvUXb8TQ":{"text":"We nearly passed this place walking by because the door is unobtrusive. I actually went he","useful":0,"cool":0},"AD4ELX4A4RbUiqp8C1YNcA":{"text":"Family style pre set menu type of place. I usually don't like places like this cuz I want ","useful":2,"cool":1},"3xJ-17u0Qg19eDPfK5AmOQ":{"text":"I had a memorable time at Cane & Table, which is saying a lot considering how much I drank","useful":0,"cool":0},"C3Lz61QRY2FtYkq3Wiqzpg":{"text":"The Pork ribs were great! Succulent filled with a perfect balance of flavors. Loved the sa","useful":0,"cool":0},"SJiENRRCq-MLwiNhAbFi-Q":{"text":"I wish I could remember the name of the bar tender we had, he was so awesome!!! We had som","useful":1,"cool":0},"Hl_4IX8fuwtBYFyjzaTMdw":{"text":"we were so excited to try Cain and table after seeing Andrew Zimmer here, but left so disa","useful":0,"cool":0},"5isPe9kWFXUSdSOIVWojeA":{"text":"Food's great and the drinks are better. And it feels less stuffy than its sister Cure.","useful":0,"cool":0},"nlFQlmPLf_YqVhtViHfHow":{"text":"Great service and atmosphere! Loved the Mexican Firing Squad and the Hummus and Yuca Platt","useful":0,"cool":0},"8OcLR6NxCxn7DNS4qwM30Q":{"text":"My sister and I went to this bar over the Easter weekend and had a great time. So much tha","useful":0,"cool":0},"Q7MnACawKHZ84NESDsKdDQ":{"text":"Couzy atmosphere with nice outdoor area. Chose a planteur's punch - among the best I ever ","useful":0,"cool":0},"j76mzwi9-9PHmGJ_XJZliA":{"text":"This is one of my favorite bars in the city. When I die, if you could scatter my ashes und","useful":1,"cool":0},"i9LIJXQfdMB0yHEnP85GXw":{"text":"Went here twice. We know one of the bartenders, so we originally went there for drinks. \n\n","useful":4,"cool":2},"k9yNPwC47mBHVi2IxZod5g":{"text":"This is hands down the best place for drinks in New Orleans! The hand crafted cocktails we","useful":0,"cool":0},"Og4zxNmOy_tz6k_WaOtLGg":{"text":"First impression - loved the atmosphere. A little noisy in the front dining room/bar, so w","useful":0,"cool":0},"dhex7nzoL1rjtzHPYHqtvg":{"text":"My husband and I were visiting NOLA for our 30th Anniversary, visiting some family and tak","useful":0,"cool":0},"HSC2rGMB8-8AOqDBcURLng":{"text":"As quoted by our waitress... \"You must order the ribs.... they are stupid good\" and they w","useful":0,"cool":0},"JtmPUSUyar1DaspL9Z1gtQ":{"text":"Great food! We had the fried chicken, the put limon potato chips in the batter. Good heave","useful":0,"cool":0},"BVBpaqQM2-9UCEp0jhNxRQ":{"text":"We heard about this place and tried it. Wow, it was great. We had lots of the small plates","useful":0,"cool":0},"x1k0lqr-CzLeEdtFPqiOCQ":{"text":"French Quarter's hidden treasure - this place has been open since 2013, and is still very ","useful":2,"cool":0},"vwBfQcRqBWjQoGoTNtjL2A":{"text":"Came here for brunch with a small group and was pretty disappointed with the service. The ","useful":0,"cool":0},"OQf_ur37SJmIieXqw9kNRQ":{"text":"The ribs the ribs the ribs the ribs. The drinks. The atmosphere. The courtyard. The sheer ","useful":0,"cool":0},"taCtWs-wGBNECFwa6erM7w":{"text":"Food was awesome and the bottomless drinks were perfect for a large group looking for a bo","useful":0,"cool":0},"jWXEsIkmajJAmZqANKLaFA":{"text":"Extremely disappointed in visit to C&T. Had very high expectations after visiting Cure Bar","useful":0,"cool":0},"7nGx22UIuC8uPo_BfGV-7g":{"text":"This is my new favorite place. The cocktails are incredible.. never get rid of the scotch ","useful":0,"cool":0},"PhPkOAvW0MCmEKcOwZblzw":{"text":"How is a restaurant out of so many things on a Monday night? You'd think the service would","useful":0,"cool":0},"uKiHxJHoriptXTwCqyHedw":{"text":"Dropped by for a quick round during happy hour and the drinks were very well made.  The ch","useful":3,"cool":1},"XHSO8Stx5-klFujOkX6zIA":{"text":"The decor and ambience is really nice but this has been the worst service I have ever had.","useful":0,"cool":0},"q4aUjt33IA4xYSN5f3QA5Q":{"text":"Visited Cane and Table to enjoy a cocktail before a show. The atmosphere is welcoming and ","useful":0,"cool":0},"40x3icxweWBafx7WRj76Hg":{"text":"I had the blue Hawaii, which was a bit like midori sour. It was pretty good! My friends go","useful":0,"cool":0},"rk6B_99U9TH4IVwe7Cwpyw":{"text":"After reading all of the other reviews we were excited to try the cocktails. We arrived at","useful":1,"cool":1},"RFgNJvGp5oerqSuGgwntTA":{"text":"The atmosphere here is perfect, it's very authentic appearing inside.  The crowd is great,","useful":0,"cool":0},"MXWDZB1lbYbPAugek4vKZQ":{"text":"Some of the best cocktails in town. Nick is a superb cocktail chef!  Ambience is quintesse","useful":0,"cool":0},"b7RYXz_nIo1acmsYNUi-tA":{"text":"Let me start by saying that if this review were based solely on food, there'd be two more ","useful":3,"cool":0},"gQt9m9wXt-fgFjSGregF2g":{"text":"So good. Every time. \n\nI've been here four or five times and it just keeps getting better.","useful":1,"cool":0},"B83x_l64DCK4lS5ipMpESw":{"text":"This place stands out from the rest of the spots in the area because it doesn't, i.e.,  it","useful":0,"cool":0},"dISKiISCxMvzS3TMt2iY_A":{"text":"I'm a rum enthusiast and I really wanted to love this place.  I've been a few times and I ","useful":2,"cool":0},"hvZID81zqa7wx13B7VTvSw":{"text":"Cane and Table is upscale and sophisticated, but it's not pretentious. They focus on well-","useful":3,"cool":2},"lsyd5HuFKbJy65BAkrHIKg":{"text":"Get the ribs.  You won't be disappointed!  It's a \"small plate\" item on the menu but I cou","useful":0,"cool":0},"hieqao-aVzk1Iaionpu5nQ":{"text":"Really fun place for a bottomless brunch. It's a little pricey, but if you are looking to ","useful":0,"cool":0},"Dcs-U3z1KjKENlgszDZXCA":{"text":"I was in town with 6 girlfriends for a girls trip.. We sat outside and took advantage of t","useful":0,"cool":0},"S35EYurmCpzgs8rpE3HIfA":{"text":"My former roommate showed me this trendy mixology/appetizer bar when his family visited no","useful":0,"cool":0},"w0Dgp2N4vjrrfKzKl_Gd9Q":{"text":"Good cocktails but poor service. Our food took forever, in a half full restaurant, and whe","useful":0,"cool":0},"2ngmPICNRC3UYKsKH03Nxw":{"text":"Wow.  Fantastic cocktails.  And the cauliflower paella was great.   Good vibe and not too ","useful":0,"cool":0},"ifSCXp2euls7mJmmK6LkpQ":{"text":"Everything was great - food, drinks, service, atmosphere... We had a great evening at Cane","useful":0,"cool":0},"X2Isn_n9mKmg1HWiOFmr0Q":{"text":"Decided to come back from my hiatus and review this restaurant. It was recommend to us by ","useful":2,"cool":0},"Hq5r8nbzkKIFJWDwXYb55w":{"text":"Cool! A neat new cocktail bar in the downtown area.\n\nWe were walking down Decatur when I s","useful":5,"cool":2},"4KTk0UgSzNWzJL9x9JexoQ":{"text":"I visited Cane and Table several times during my stay and was never disappointed. My go-to","useful":1,"cool":0},"4N5eNSSocVOBuSpmX5-BaQ":{"text":"Snacks were decent.  Service was lackluster at best.  Willing to try it again.","useful":0,"cool":0},"eyesG0tXEn-fk74eZzQ7qw":{"text":"Drinks are good, but the food is super expensive.\n\nThe cocktails we got range from $10-13,","useful":0,"cool":0},"GjjJMIvRee4I22nVPsMFdw":{"text":"This is one of those places you've got to get to while you're in New Orleans. The place is","useful":1,"cool":0},"UwUA7U4tY8HC5AvNH8GBKA":{"text":"This place was so good, we came twice during our three-day stay (and considered going back","useful":1,"cool":0},"RIgaGyziketMvm6wrVRDjw":{"text":"Cane and table is always a great experience! My friend has celiac disease and Cane and Tab","useful":1,"cool":1},"SJL69LEI4FSxDkzqndkfWg":{"text":"We went here for some dinner on a Friday night.  The place is small, and it was a bit nois","useful":3,"cool":2},"x_q6UeZSzT0ZCmM5gKRHTg":{"text":"Had the Todo Bien cocktail ---Mezcal + caperitif (South African aperitif) + passion fruit ","useful":1,"cool":0},"3N_SU_nsG3vH0Y9NqEXzZg":{"text":"pure awesomeness, from the tucked away back garden (with visuals) to the family style tabl","useful":0,"cool":0},"O65ZFA5wpRO6-Xb3bPUblg":{"text":"I'm giving these guys 5 stars for introducing me to an original (non frozen or fruity) dai","useful":1,"cool":0},"Ba4fZdafgf12G8YZ-HOK7Q":{"text":"Great location and beautiful interior.  The menu is absurdly tiny--with less items even th","useful":0,"cool":0},"Uy2LwuviOGf2sxdgb_WQOg":{"text":"The ribs are a must have. They are unlike anything I've ever tasted before. The tostones w","useful":0,"cool":0},"GcBMTUIPZGvmI_M89JXj3A":{"text":"Good find in the Quarter. Personable staff and great chicharones, can't wait to to go back","useful":0,"cool":0},"NGcvs5Epg6hn8mdM4gYYyQ":{"text":"This place was extremely busy last Saturday night but we wandered in on a whim. It is such","useful":0,"cool":0},"Gl3nM-dgJJ5-nBl1dqL5KA":{"text":"So good. Amazing food and drinks. Interesting without being pretentious. Staff is on it an","useful":0,"cool":0},"6gemk_6hxB7dgLRX-7Xacw":{"text":"Went last night for Krewe du Vieux. Website says \"reservations accepted for parties of 8 o","useful":3,"cool":1},"0rlna4vwYvKJAoeH9Q5wfg":{"text":"Excellent food & drinks. Our waiter was attentive and very helpful assisting my group of f","useful":1,"cool":1},"Pn6mtuQdNiNJRqRClNVNPA":{"text":"The Drinks and Truebridge Duroc Pork Ribs are well worth every penny.  Really enjoyed my v","useful":0,"cool":0},"PrBk5UQIULXn605cthCYmg":{"text":"We enjoyed an amazing bottomless drink brunch. The drinks were magnificent (and you could ","useful":0,"cool":0},"HLOHRgky7gx9-YhpIfnC2w":{"text":"Braden made us the best drinks of the evening. He was able to make us rum drinks based on ","useful":0,"cool":0},"En8IkSA0tmOLHelF2BAIoA":{"text":"We ate here while in town for the night and it was delicious. We were trying to eat at Coo","useful":0,"cool":0},"6i8x3BU_F-vlp4G4AeYppQ":{"text":"A beautiful spot that is easily one of the best cocktail spots in New Orleans. The food is","useful":1,"cool":1},"lCeEGvExO8DUhMnVhjqnwA":{"text":"Go for drinks because the bar service is amazing, but eat the food, too. The venison boudi","useful":1,"cool":0},"F_3cprRM9tZ9hkFEqJJMxQ":{"text":"Decided to check this place out at last minute and was pleasantly surprised on the ability","useful":0,"cool":0},"qFk6IEMIn7RO0RcB19acAQ":{"text":"Still one of my favorite places in New Orleans! \n\nMenu has changed a lot, gone are the Bru","useful":2,"cool":0},"Xm5mLO19_STwMS2HvWHapQ":{"text":"Wow! Really? What is all the hype about? Gave one star for ambiance, cute bartender, and a","useful":0,"cool":0},"PnTz3la-WizcR9P9TohHOg":{"text":"Thru the front door of 1113 Decatur street you can find awesome hand crafted custom drinks","useful":2,"cool":0},"HQWz5q1UB16M-ehd-oBA4w":{"text":"Extremely old and featureful building, updated with somewhat unusual tiki decorations. The","useful":1,"cool":1},"60DbgvxMYGDvYX7azo3o2Q":{"text":"Delicious! Cozy! Quiet! Great service! There's no sign outside, so you feel like you're an","useful":0,"cool":0},"y4sC2Z0EmOxEJwseKdloyw":{"text":"Sat outside on a Saturday night. Service was great, as was the huge selection of craft coc","useful":0,"cool":0},"eiuDV_F7KTAuhrSlX_78Dw":{"text":"Food was soooo delicious... Can't wait to take visitors there for some special drinks and ","useful":0,"cool":0},"hpqw9X9_nXpkdqHO3VhaRQ":{"text":"The cocktail selection is fantastic. The bar has a great old feel with candles and exposed","useful":0,"cool":0},"08mSOzZoyNAqtxDIqSPXKg":{"text":"I can sum this place up in 3 words:  bland, pretentious and overpriced. While the drinks w","useful":1,"cool":0},"c6UMAiZ8dmoWOUWyJiR89Q":{"text":"What a lovely afternoon experience.. After a disappointing lunch experience at cafe amelie","useful":0,"cool":0},"4NQlZb-7_PMW9mKN7ekJ9g":{"text":"Had my first trip to NOLA last week and in preparation, I watched as many travel shows abo","useful":2,"cool":0},"xr7vS4uvBg-W5Da50AduXg":{"text":"We went to cane and table on a Friday night after jazz fest last weekend. We had a reserva","useful":1,"cool":1},"I8kee3VqQ6p5WV-Ugk6ZLA":{"text":"We went here for brunch after seeing that it had bottomless drinks. The atmosphere was gre","useful":0,"cool":0},"MkOnznY0pxrxVvv0vXfwgg":{"text":"Great place nice bar friendly atmosphere  !! Stopped  to get a cocktail !!! Got the rum ol","useful":0,"cool":0},"7W4uL4pr_B4ktYDPYS4Ieg":{"text":"Great and unique cocktails.  My party sat at the bar waiting for our table and we were sad","useful":0,"cool":0},"BV3uE6KtXSYpziCUsBJCig":{"text":"We visited Cane & Table after a recommendation from a local - the service was amazing and ","useful":0,"cool":0},"JfpvPY28bIVcDD7QHBlPVQ":{"text":"This place is more like $$$. We came for brunch and it ran us around $135 for two people w","useful":3,"cool":0},"sG3JwNTd9svD3IC1Gtf5tw":{"text":"Get out of the French Quarter and try this wonderful gem.  Molly, our server, was fantasti","useful":0,"cool":0},"hSa6-VZU18wGLgLlDLDJkw":{"text":"The best restaurant we went to during our week long stay in New Orleans. Order the ribs, y","useful":0,"cool":0},"aD2NLwzWHubeVa-mgGyjOg":{"text":"OMG! All the food that we had was bomb! Gem salad nice portion - shared with four people. ","useful":0,"cool":0},"i0LWJdbYSmyR5nUU2XtDhA":{"text":"Outstanding cocktails and even better ribs! Great atmosphere too. We had an incredible mea","useful":1,"cool":0},"ZRsvKYM36xMFKemsHh4L7g":{"text":"The cocktails are great, original and inventive. The courtyard was a neat place to eat esp","useful":0,"cool":0},"nLWd5c90_WpEkxrsqubn5Q":{"text":"Beautiful restaurant, delicious cocktails, and a friendly bartender. I'll definitely be ba","useful":0,"cool":0},"aVcOctJAdg3bIZchlJz_4w":{"text":"Went here based on a locals recommendation and we were not disappointed! Only waited for a","useful":0,"cool":0},"BfPmyGgwydwNWc1zJUO_Jw":{"text":"Although bar has nice atmosphere, Food is awful. very little portion. Everything is salty.","useful":1,"cool":0},"RMjos0hiV0RCVW9V3PQP6A":{"text":"My dad said he wanted something NEW in New Orleans, at first bite he said WOW! The crispy ","useful":0,"cool":0},"dP1f5GtVQyGbdPGErBut8Q":{"text":"The girlfriend and I are New Orleans residents and decided to check this place out for an ","useful":3,"cool":0},"tyVwe2G4xUh7cUIVkAbM9w":{"text":"Ate here tonight and had to post. The whole meal was amazing. The place is awesome and the","useful":0,"cool":0},"LRm4LZo_aeShG0HqlNVNIQ":{"text":"This place is pretty awesome.  Food is unique & tasty,  the service was really friendly & ","useful":0,"cool":0},"5NZsAFmHtF5BCPs1tr-ATA":{"text":"Really excellent spot for cocktails, truly a world class modern bar program.  Just grab a ","useful":0,"cool":0},"zujZgLQn_BVghQkqq7uSug":{"text":"Fun, funky place. Truly a craft cocktail bar. Deliberate, imaginative and professional \nTh","useful":1,"cool":1},"AjPMIJzqoC1JRSR73gvUUQ":{"text":"We stopped in here for a snack and some drinks while we were roaming around before the Sai","useful":0,"cool":0},"Tka9gs_RdLJ-8WBFDzq6SA":{"text":"This spot is one of my happy-place haunts in the middle of a city that is but a larger pie","useful":0,"cool":0},"2fGH0O7-mqqVJaxiXNK-uw":{"text":"I had been to this bar on Decatur about three years ago when it was a much different dive ","useful":1,"cool":0},"vXFvyajih8zO0y5aWFtmAg":{"text":"Spent a week in NOLA primarily as a food tourist (we wedged some other things in between, ","useful":0,"cool":0},"4YpelU80Ybd5A9RJF9oXWA":{"text":"Stopped in here late night with some friends for drinks and sat out in the courtyard, very","useful":0,"cool":0},"qp5KZKyx_gFQRQOM8o0E8w":{"text":"I just realized how much I love Cane and Table - we live in New Orleans and had friends co","useful":0,"cool":0},"SWQIH9kzUqd2V8eHALMkag":{"text":"Best place to grab before dinner, after dinner or just anytime drinks! I love the knowledg","useful":1,"cool":0},"gJXoGhzPOMtgFKytmnzbdg":{"text":"After much hype we left this restaurant feeling very disappointed and depressed. Not how y","useful":1,"cool":0},"t3LQtbHKByeFCLesmHupkA":{"text":"I went here expecting really good food. It turned out that the  food was freaking amazing!","useful":0,"cool":0},"3-uDowZiFV1sztamADTnNw":{"text":"The only reason it doesn't get 5 is because that is very rare.\nMusic playing is great. Fis","useful":1,"cool":0},"ax3NFEMTr-w2CvcZAEL7Zg":{"text":"If you're in the search for a thoughtful meal and perfect ambience look no further! We wer","useful":0,"cool":0},"l0wWz8hqcLhyCuLITvfBLQ":{"text":"Ooooooh... I never like writing less than stellar reviews.... I am not one of those negati","useful":1,"cool":1},"GAgjFClk1GwjWzAi2-tRRw":{"text":"Look. This place is a three dimensional non-sequitur. Albeit dark. It reminded Philippe of","useful":0,"cool":0},"RhqA-covnN1Ev3K5Oqfwog":{"text":"Everything about this place is 10/10.\n\nDrinks... oh the drinks. The Colada is perfection.\n","useful":0,"cool":0},"6qN_kGzwydNOl3MebkQxwQ":{"text":"Unique cocktails, delicious food, and a relaxed environment with a cute courtyard- what mo","useful":0,"cool":0},"QEMeAa7rPUEfcuRm7h37ng":{"text":"Loved loved loved it! Had beef ribs and pork ribs with brusslesprouts, cucumber, and potat","useful":0,"cool":0},"xQ284wujs-fKoHRl85xkTg":{"text":"We stopped in here for a Sunday brunch after reading previous reviews. The food and drinks","useful":0,"cool":0},"J7aRrMCLxUF9eeMiTvTSdg":{"text":"Thank goodness we got caught in the rain and dashed into the nearest highly rated bar on Y","useful":1,"cool":1},"ch9s1u18wOI-D2nPady2vg":{"text":"We celebrated our daughter's birthday here and it was a great choice!\nLocated in the Frenc","useful":1,"cool":1},"20tNk7o3gOhOUSlXpbszqw":{"text":"The food was excellent.  My best meal in New Orleans.   The Bartender out crafted the bart","useful":1,"cool":0},"O8RdpxUKZOgQlAb0kXlShQ":{"text":"Great cocktails, not too crowded. Don't be deterred by the line. It's for Coops Place next","useful":0,"cool":0},"Jd4TYPmbzvdIlwrzUe1Okw":{"text":"Our mission to avoid White Linen.  Solution, to try Cane and Table because we knew everyon","useful":2,"cool":2},"bwh3yWZ8JwtyGqyv237DFg":{"text":"Very good! Menu rotates, which is great, but we were looking forward to the food pictured ","useful":3,"cool":1},"or-59BIkqI3MX_YN2c-eJQ":{"text":"This is the perfect antidote to the French Quarter bar scene. Classy, fun and the food was","useful":0,"cool":0},"CyV8XeeY0C6JxXBAWf8_Ww":{"text":"Went with a few girlfriends for brunch on a Saturday morning and the food and drinks were ","useful":0,"cool":0},"_aPIR4w5cvPAckGdqwxjKA":{"text":"This place was excellent from the start. A few local friends told us about this place whil","useful":0,"cool":0},"B7j21nQ9TYQ6lVxGt8TftA":{"text":"Great place with good ambience, if you like the rusty look.. The ribs!! My oh my the best ","useful":0,"cool":0},"7NluoboIRR5Ldz37vpb2Yg":{"text":"One of the best bars in the French quarter, and possibly all of New Orleans. My partner an","useful":1,"cool":1},"HxH0y_QiLg-2KUVXkYKQag":{"text":"Get the coconut water/Scotch /Bourbon/something else to drink. It's insanely good.\n\n\nSure ","useful":1,"cool":1},"SbyF2m-IhUsivjo8L15j_w":{"text":"Probably one of the most attractive bars/restaurants in the French Quarter.  Great atmosph","useful":1,"cool":0},"Bjcsf6lCUivop6w8VvV68g":{"text":"Stumbled on this place one night after being intrigued by the rustic, semi-mysterious exte","useful":0,"cool":0},"ty644l0fOC-fTxHUbQvusQ":{"text":"I really loved the feel of this place. It was very chill and laid back also quite trendy. ","useful":5,"cool":3},"w5wzVIsnKEl8EZjcZFE0Sw":{"text":"The best fucking flan I've ever had in my life. Beautiful and relaxing environment with am","useful":0,"cool":0},"2_8ip-QG8dvtDpYvJwE8Yg":{"text":"Stumbled upon this place while strolling around and decided to stop in for a drink. The co","useful":0,"cool":0},"2zxQs9iNlsPq0NPvvrP1Zg":{"text":"This place is a must eat  in the French quarter, The food is amazing, the crispy ribs are ","useful":1,"cool":0},"wxuZHU2We9wx7oCteDufzQ":{"text":"We began with pork skins, crispy duroc ribs, and crispy brussels sprouts,  each item is 2 ","useful":1,"cool":1},"hvCFwnxIiuj0TO6DOVEI0w":{"text":"Perfect for brunch, especially with their unlimited cocktail situation and rustic New Orle","useful":0,"cool":0},"_Hw6_WF5VugRWTSl140h0w":{"text":"Had reservations for several weeks for their bottomless cocktails brunch.  Was really disa","useful":0,"cool":0},"WC-r-JoIUeqZwKBHetljsA":{"text":"came on a monday night and got a table immediately. great drinks with a decidedly rum bent","useful":1,"cool":0},"f2ynBuXkbPQebntX5jD48w":{"text":"Wow. Just... go.\n\nFood: A+. The only criticism: Pork Shoulder dish could use a little work","useful":1,"cool":0},"J2SwsGya5bJ_IN7BTmFhOQ":{"text":"Out of every bar and restaurant in New Orleans, Cane and Table clearly does NOT need your ","useful":16,"cool":1},"dHU1Rhdq45vO-1yMB0HxmA":{"text":"My friends and I had brunch here on a Sunday. They were the only place that had a reservat","useful":0,"cool":0},"kY3hfG2xVreif622yuZsJQ":{"text":"We wandered in on a Monday, after a late dinner, for a night cap. Came and Table is in a b","useful":6,"cool":2},"53hQvuJon9xpz-I5M6gnFA":{"text":"Cane and Table has always been one of my husband and I's favorite cocktail bars. So when i","useful":2,"cool":0},"3A8UXNa6ilzYNn4ejI99tg":{"text":"Great courtyard and bar atmosphere. We did get 2 drinks made inside a pineapple, which did","useful":0,"cool":0},"i2ZV40wS56h9rhv8s46vww":{"text":"Mmmehhh. It was good but not great. The drink selection was different than most places but","useful":0,"cool":0},"wpyEYweaYZeG_Bc5F4fIdw":{"text":"Yes, go here! We came here (with two toddlers, no high chairs, but we felt welcome and had","useful":0,"cool":0},"Y4k7gC5rvoPdWeiZYPG1Sg":{"text":"My boyfriend and I came here for a drink to start our Friday evening in New Orleans. We di","useful":0,"cool":0},"nOFfYMxaiYQ3XAH97PLlgg":{"text":"This place was memorable - the space is nice colonial feel with the courtyard in back. But","useful":0,"cool":0},"wK_9Wjf5X9IYrE39h-Pj7Q":{"text":"I was originally quite sad to learn that one of my favorite bars in the French Quarter (Pr","useful":0,"cool":0},"fjgKBKvvE7F2SgqBxXXq_A":{"text":"My first time here was pretty  chilled. It's  a beautiful  and intimate low light ambiance","useful":5,"cool":2},"lw4SEzxE7ilbV4D24tI8vw":{"text":"WAIT HOW HAVE I NOT REVIEWED THIS PLACE!? Are you lying to me yelp? This is possibly and u","useful":0,"cool":0},"Hu618EBn0XkwGvXneq9oMQ":{"text":"OMG, food is simply amazing. Very flavorful and reasonable. Drinks are great, atmosphere i","useful":0,"cool":0},"vmWDoMuTPqudfN4xl6KCtA":{"text":"Wow! Very rude. Gal came outside, I thought I was in line for her restaurant but was onlin","useful":1,"cool":0},"LpE6GDsrdf29pm5naCpW8w":{"text":"One of our very favorite spots in New Orleans. Such a beautiful restaurant, great staff, a","useful":0,"cool":0},"A5KQ5bYvCJ8IO1gnlxlA7w":{"text":"My husband and I came for brunch today. We didn't do the unlimited drinks brunch and inste","useful":0,"cool":0},"_V2Ahl98WkkyWPhH65LIXg":{"text":"Very good drinks and nice bar atmosphere. The bartenders are friendly and knowledgeable. W","useful":0,"cool":0},"hN-cR_v9pkEcOFEFNbEY7w":{"text":"This is an excellent restaurant with fantastic drinks and dishes with Caribbean flare. Try","useful":0,"cool":0},"PBGzADTWyxmiQVBzFN4TbA":{"text":"Thank you so much. You have now been my respite and rescue operation for two years in a ro","useful":0,"cool":1},"Az4gIMOLEb5RbUn32XHr8w":{"text":"Cane and Table is a very cool bar with an old world charm and amazing drinks. I started wi","useful":0,"cool":0},"9Y19N9lbIYtcSeE71bSDCw":{"text":"This place is one of our favorites in Nola. Great cocktails, very good food, relaxed atmos","useful":0,"cool":0},"HCPB1fE3lLgfDzJGTvTJAg":{"text":"This place offers a much needed touch of decorum on Decatur. Yes, it's trendy--and most of","useful":0,"cool":0},"gztcEZqA_CRCDv92il8Zww":{"text":"Its a small and classy rum-based bar. The drink I had must have had chunks of pineapple in","useful":0,"cool":0},"p2oY-Z45whE0mZhC5uyJpA":{"text":"I think I found Cane & Table via Eater. We did our due diligence, passed car accidents in ","useful":1,"cool":0},"RFLmpUaflqy759kv2FSg1w":{"text":"The drinks are fine and the food is good if a little overpriced. But the place doesn't rea","useful":0,"cool":0},"qA2JUN_IkeK6S3e9zRtmeQ":{"text":"Perfect drinks, awesome interesting food and a patio in January?! You can't go wrong! \n\nTh","useful":2,"cool":1},"y8S_xj1UHEbE0kWNrdKgvA":{"text":"We celebrated my husband's birthday here. Everyone in the party complimented me on the cho","useful":0,"cool":0},"ibkxl1cMd4OBiKNM3Lz8UQ":{"text":"My boyfriend and I were excited to make this our first stop in New Orleans (1st timers) as","useful":2,"cool":0},"9HXHtsc3RhogjKl_pANkIw":{"text":"The crispy ribs were amazing. I got the cocktail with the coconut ice ball, forgot the nam","useful":0,"cool":0},"TiaY8J7XEqLlo_u-t70nNQ":{"text":"They had great staff. The wine selection was amazing and they make a bowl of punch daily a","useful":0,"cool":0},"4s7okWTvXRx74kAQ1t58GA":{"text":"Loved this spot. We had our rehearsal dinner here. The courtyard was beautiful and romanti","useful":0,"cool":0},"im9ANn_0lALg476RNk2yEA":{"text":"Wonderful restaurant: charming setting, friendly and attentive staff, delicious food and r","useful":0,"cool":0},"PTd2YLHmYwtdg71mgvNZKg":{"text":"Wasn't terribly impressed by C&T brunch. Carribean menu is  nice and intriguing. Expect sw","useful":0,"cool":0},"Ugb9GQuO0fnVzADgpCrrbg":{"text":"A beautiful room, a beautiful (albeit sparsely furnished) courtyard, a beautiful server (t","useful":4,"cool":0},"DHta3IaAQUsDR4fqlQPKQQ":{"text":"The food was somewhat inventive and generally well-executed. The menu online does not repr","useful":1,"cool":0},"LxupSaMhMhJu6mW56vgYMA":{"text":"I got into NOLA and had been eating most of the day. A foodie friend suggested stopping at","useful":2,"cool":0},"6Seg5n-B_hQJbQPrhuszjg":{"text":"My husband and I are visiting from out of town and came here based on a recommendation. I ","useful":1,"cool":0},"ReRLsfkV8oDePADxg8yjIw":{"text":"I've got a thing for spots you have to go on a scavenger hunt to find, and this definitely","useful":0,"cool":0},"Z1jxxjVuStYcUZCi8lCiVQ":{"text":"The staff was very accommodating. We had some special orders that were no problem. The Blo","useful":0,"cool":0},"ccQHHzDGDqUaLiou1-Of7g":{"text":"So here's what we had and what I thought of it:\n\nThree Pea Hummus - tastes more like bean ","useful":1,"cool":0},"O4ehyg9QqHuAb8qtNTWFGg":{"text":"This was our first real drink of this most recent trip to NOLA and think this place may ha","useful":0,"cool":0},"XM6rCxhCpp7JrA_46D6MmA":{"text":"I found this gem through Airbnb as one of the top rated places in the French Quarter. It h","useful":4,"cool":2},"Ae2X3FGpCPoKk5W3oZxdfQ":{"text":"There is a metamorphosis happening...I'm beginning to put myself out there instead of orde","useful":4,"cool":3},"EHnyoBeAK9LJV2RMcW7plw":{"text":"I haven't been to Cane & Table since my 2013 review, and we ended up popping in there post","useful":15,"cool":12},"6cQG5v-utKjJAxEuoqe2lw":{"text":"Went here for cocktails and was not disappointed. Love the patio ambiance. Highly recommen","useful":0,"cool":1},"LSN03Nj8C2MkJx_-Fr-cow":{"text":"Great speakeasy type bar in the Marigny.  It's owned by the same people as Cure in uptown,","useful":2,"cool":0},"xC0VsqsFlGvf5b1aq4ThgQ":{"text":"I would have listed this place as a Latin/New Orleans fusion restaurant (maybe a bit more ","useful":0,"cool":0},"JqEGMTCbPcWoVTvaFs7GUA":{"text":"This was probably the best dinner we had in NOLA.  I know that sounds unbelievable, consid","useful":0,"cool":0},"pW7UqPfCbpx1jtF3uvMVaw":{"text":"Y'all, make a reservation here because you will not get a table if you don't. They serve b","useful":2,"cool":1},"JOMFgA4xFf-D9VuCM1WkrQ":{"text":"Stop wasting your money on Bourbon Street and get onto Decatur for Cane and Table! I never","useful":0,"cool":0},"6w0uZEGXuOMIa1yW0gXbkA":{"text":"Fabulous rum bar. Bartenders here are very talented. We came in for happy hour. $6.50 for ","useful":1,"cool":2},"jeV-TolAP0KgqEBuf0u0nw":{"text":"It's hard to find a bad meal in nola. This was the exception.  Im a local and this was one","useful":0,"cool":0},"gKCPFsDC8r9i2c7A2zuoPw":{"text":"It's our 3rd day in New Orleans.  We went to all \"4 or more stars\" places. Cane  & Table h","useful":0,"cool":0},"v27KeNjZy6tdVuQuuFPGyQ":{"text":"I came in a group. Personal preference.\n\nFavorite:\nArroz negro\n\nAmazing : \navocado salad, ","useful":0,"cool":0},"fYYlJXsHipAIgtI-f_yzJQ":{"text":"You guys.. I can't even tell you how delicious everything we have had is! Non descript ent","useful":1,"cool":0},"KUaGGEhBrp-PWDiXhshyig":{"text":"I worked with Justin to arrange a large cocktail style reception for over 30 guest. He was","useful":0,"cool":0},"-8u4Ka7kerYj2dtuo7Qlfg":{"text":"Came for bottomless brunch during Mardi Gras, and had the best experience. The service was","useful":0,"cool":0},"1NSRnmU0vWXqdf4P0kF8vw":{"text":"Just had dinner here on a weeknight around 9pm. No reservations but we were still lucky en","useful":4,"cool":1},"MVFtjcCSIFPFecLUK3Hn3w":{"text":"Awesome restaurant with delicious cocktails and amazing food! We ordered a bunch of the sm","useful":1,"cool":0},"S-m4PHdtGrxByLBPp9jRLA":{"text":"Great little spot! Fantastic concoctions that are sure to please even the most discerning ","useful":0,"cool":0},"bJ7mYIR7m6ZYw1BZagaAZQ":{"text":"The cocktails are amazing. I was with 6 other people and 4 were very happy with their food","useful":0,"cool":0},"lmEs3ocsuJzNqWlpKUX4Fg":{"text":"Outstanding food and service. Not a thing bad to say. Brunch menu is small but everything ","useful":0,"cool":0},"L2z1w-6WhHJb07w9fcKjVw":{"text":"I would give 0 stars if I could. I was sober and they denied me service even as a repeat c","useful":2,"cool":1},"LacrkY7tDCbrcn9QlyyOGA":{"text":"Specialty drinks really good! Highly recommend the Brazilian drink. A clone Rum drink to t","useful":0,"cool":0},"8nzIlWEDZbntvnaDqEHerA":{"text":"Drinks were solid enough though I've certainly had better... The people working the bar ig","useful":0,"cool":0},"MN0rUc6AFxpyLzkuRhj1iA":{"text":"Stopped in for a quick drink, ended up staying for hours. Way to make us feel like part of","useful":0,"cool":0},"dp2azIQvbYKUaT2iAgGX4A":{"text":"Went there for dinner with my wife during our wedding anniversary trip to new orleans. Foo","useful":0,"cool":0},"nOUVUwzYhsOwufhfYZNHeg":{"text":"Great place to grab a  drink. Love the atmosphere and the drink was tasty as well. The dri","useful":2,"cool":1},"8AXisDzSeIUyjMlrYmGgVg":{"text":"Had my birthday party here and it was perfect. Food and drinks are amazing and every staff","useful":0,"cool":0},"Fqf07u_oRH8g-nSpdihVgQ":{"text":"Dear Cane and Table, thank you for carrying quality products and making respectable cockta","useful":0,"cool":0},"qClqJ9eNt6OSfe6uGkfc3A":{"text":"I have to say. I was so excited to check this spot out for happy hour and the female manag","useful":0,"cool":0},"m4WBFLBPgPYl-QRx7BO_1g":{"text":"Cane and Table has the best cocktails and Cracklin's in town. Best courtyard and amazing s","useful":0,"cool":0},"ataT4-oDiqaBXQNJVJ0aPw":{"text":"Fantastic food and spectacular drinks. Knowledgeable bartenders, creative cocktails, and u","useful":0,"cool":0},"OfyNiroMWevNkUUkltWB8A":{"text":"Pretty good food, great drinks. Service was warm and friendly. Will recommend to others!","useful":0,"cool":0},"wo-EAkr6bzOkpkMx9eawpQ":{"text":"Very cool experience... tried the pina colada cocktail and it was delicious and served in ","useful":0,"cool":0},"MfaAswdQEeB9KOOOFQfFtg":{"text":"Cane and Table was a classy joint. It's dark and moody with cute fashionable kids as our h","useful":1,"cool":0},"qV5F8hcvrezr0NC2QhQMdw":{"text":"This place should be called Cold and Sassy. The host is very curt and has a major attitude","useful":0,"cool":0},"MloBhrlSc6F68iHYroYFUg":{"text":"I stumbled upon this place last summer. So glad they are able to still be open. The staff ","useful":0,"cool":0},"5bHlQKera39BQ4OVbCe88g":{"text":"The beef empanadas are pretty good, but the avocado salad is terrible. It's extremely salt","useful":2,"cool":0},"52D1fWTvl5YZSb790S37Sg":{"text":"Best happy hour in NOLA! Come during happy hour and you'll find a pleasantly uncrowded bar","useful":1,"cool":1},"q-awLzotG-Xu-Kne2w3sNQ":{"text":"Very much a hipster bar.  I personally thought that the bartenders could be a little less ","useful":0,"cool":0},"IMxzDJj05XZaBSQHN228Hg":{"text":"Think Rustic Colonial Cuisine. Sort of Pan-Latin but with a Cuban flare :) \nThe ambience i","useful":0,"cool":0},"EN5Lq5isCYv6dhmzl_pnZQ":{"text":"I love it when I can throw out some of my favorite ingredients and the bartender has no pr","useful":0,"cool":0},"-wGz9lW5gpCR01-P0ifYHw":{"text":"First time visiting after hearing so much about it. The portion sizes were extremely small","useful":1,"cool":0},"u9CbWUw19AAPvMwbr1QLRQ":{"text":"Came here back in August. On an off season Thursday around 10 or 11, it was neither crowde","useful":0,"cool":0},"lyc-9G1-mZ1lnqPDLv8DlQ":{"text":"Amazing outdoor patio : great vibe nestled between two buildings with comfortable shade an","useful":0,"cool":0},"xi1G9AUMtZtXpocTHGj9zQ":{"text":"We had such high hopes for this place but left feeling 'meh'. We walked in on a Sunday eve","useful":0,"cool":0},"ROFf_w353NJ_6ecPlaKsaA":{"text":"Bad and basic food plus FRAUD. The food and people in New Orleans is so amazing that nobod","useful":3,"cool":0},"Egm_61FrOY7YBz23xV64vA":{"text":"So my family and I wanted to try this place out. The service was nice and our waiter was p","useful":0,"cool":0},"D8qphGZ3GbidCRmQsLMu4g":{"text":"Very solid food and cocktails to match. Consider this food Caribbean more than Cajun.  Had","useful":0,"cool":0},"4uZNAB938ANR_XzZ8v9KbA":{"text":"I've been trying to hit as many new cocktail bars in New Orleans to diversify my go-to lis","useful":1,"cool":0},"t9IIajOOD3m8N0j0GNaCWA":{"text":"Came here for dinner with the fiancée and was pleasantly surprised by the ambience and set","useful":0,"cool":0},"TCVZLANCfRrrnOnEV-WxWQ":{"text":"Great atmosphere and wonderful  drinks.  Loved the scene and you coUld tell it wasn't a \"t","useful":0,"cool":0},"BdJ2Ps-QyGIU3eue3sIzPQ":{"text":"When you have a mariscos that must have been doused in crack, bc it was that good, and fin","useful":0,"cool":0},"G4USYvfmZwBpJq9Bxf3WpQ":{"text":"Ordered two daily special foods bacalo fritters and avocado frites. Fritters were way to s","useful":1,"cool":0},"1fj5Jl-IynAmQCzoz0Xdjw":{"text":"Interesting place.  Food was good, not great.  A little on the pricey side, but I guess yo","useful":0,"cool":0},"eISWqJ_Bhu7CM9DCF1MoSA":{"text":"At least 3 people recommended this place to us, and I can see why. \nEven though I was only","useful":7,"cool":4},"hpFDfSZxta5BU1EwsZk5LA":{"text":"This review purely speaks to Cane & Table cocktails - I have not yet had the opportunity t","useful":1,"cool":1},"CbmxdxpHLomrx6jt4-mZwA":{"text":"Oh my deliciousness!! Stopped in with a party of five for some small plates to rise us ove","useful":1,"cool":0},"UGWEYtjz-CwpBVf_w12Ang":{"text":"Friends and I came into this place upon a recommendation from a friend of a friend. The ba","useful":0,"cool":0},"7GRdE7iBKG9u7YihLec7Hg":{"text":"A 5-star Yelp review means a business is \"as good as it gets!\" - this is true for Cane and","useful":1,"cool":0},"ab08_leCmEXAayAdnKgeMQ":{"text":"Such a hidden gem! My husband and I had the fritters, the coctel de mariscos and the bruss","useful":0,"cool":0},"KcQOnCHWhuHGym2yyjFl7Q":{"text":"Great service, amazing happy hour. I loved that the daiquiri wasn't too sweet and you real","useful":0,"cool":0},"aKZnFuBWz9sIdRJWxw2qYA":{"text":"This easy-to-miss spot is all charm that you should not miss. Absolutely gorgeous with all","useful":3,"cool":2},"6Dd4twZ3gN8a2LWV6vVIAw":{"text":"My son searched for some unique restaurants to try in New Orleans and this was at the top ","useful":0,"cool":0},"v0lSfPWv7TjsXTzlbSXL3w":{"text":"Disclaimer: this review is based solely on drinks although the food menu looked great. \n\nS","useful":7,"cool":4},"SHYPNYQHM6Il6i-jtEK14Q":{"text":"Chris was our server.  F****** bad ass! Best meal we ate all week hands down.  You feel at","useful":0,"cool":0},"1oWqxqaNaN4XRjzbcQ4zpA":{"text":"I love this place.  In town from California and was trying to find a nice, low key place t","useful":0,"cool":0},"Jiq33CpGWaNbEUznAGPhlQ":{"text":"My first time at Cane and table was much enjoyed. It's tucked back off of a busy street. T","useful":0,"cool":1},"kfjAPT7HO92ZqqpwmT6SSA":{"text":"The beef empanadas are pretty good, but the avocado salad is terrible. It's extremely salt","useful":1,"cool":0},"hJhuBwrdOU2VldrbDLATvA":{"text":"I want to like this place because I do like Cure, the flagship of all the Cure cocktail ba","useful":4,"cool":1},"OArCJbM3nFWNslkxNZeD7w":{"text":"I honestly thought I was pretty well versed in what NOLA had to offer until I stepped into","useful":1,"cool":1},"rMyYdFtQO8QRsC_u3Cs4zg":{"text":"OVERPRICED & OVERRATED! I was thrilled to try this place when I saw it featured on \"Burger","useful":8,"cool":2},"foa2qnbL7acI_9HB4VBvbg":{"text":"We didn't eat here, but had some really good cocktails. Paradise Lost and Cast Away.  Whil","useful":0,"cool":0},"5koZPj7sKBQydi0JdZxC6A":{"text":"It's a 4.5, shy of the 5 star only because the food is overpriced. The restaurant has a co","useful":1,"cool":1},"-g_IwJIVh-opBlPTyZSLbg":{"text":"This was by far the best food we had in New Orleans. The staff was exceptionally friendly ","useful":0,"cool":0},"-6fh10MiqQ2eumKdV2A78w":{"text":"The staff and food was just spectacular for our wedding guests. We dined outdoors in the c","useful":0,"cool":0},"_4uOEex5R7WUo8_3xXTtDQ":{"text":"Don't miss out on that chili.\n\nHad been trying to find an excuse to visit this restaurant ","useful":1,"cool":0},"M220x9N_h7JHFeI4Kkg00Q":{"text":"We came upon here at the end of a walking food tour. \nWe sampled there assorted snacks app","useful":0,"cool":0},"J8lHOTBlqEqZToLz1vQCfQ":{"text":"This is a hipster place. The crab bites did not impress, the beef empanadas were cool, but","useful":0,"cool":0},"auRKg3Dl39uX3O1bkJWb1Q":{"text":"Hidden gem discovered after a disaster at BB King's across the street. Amazingly crafted c","useful":0,"cool":0},"FHBb9XhZHMV7z55lxYuSKA":{"text":"Came here a few weeks ago with a group for a bachelorette party weekend brunch and left ex","useful":0,"cool":0},"RBBjkw9zNdERi8OS1CuIkg":{"text":"Cane and Table is very reminiscent of what you would come to find somewhere in the trendy ","useful":2,"cool":2},"IoOuI-3ZNcpLsr2nLTmmLA":{"text":"This was our first meal while in New Orleans, and what a spectacular experience it was. Se","useful":0,"cool":0},"aBSdnigo7ll1gxWgrBz11g":{"text":"This was the best restaurant we found in New Orleans. Sadly, we found it on the last day o","useful":0,"cool":0},"q1pUtU7o1sjk-ppPLjgMsA":{"text":"Amazing food , amazing atmosphere. A must try. Don't miss this beautiful little gem while ","useful":0,"cool":0},"H3_s2jF4xtDevHXydvblLw":{"text":"One of my favorite food places! We had the tuna tostada, the pork skin and the cóctel de m","useful":0,"cool":0},"py49Ek4eJ9TsrCRQP_EBWw":{"text":"1 star for location, 1 star for cocktails. Everything else about this place was meh. It lo","useful":2,"cool":0},"6WnituI0F4CXTV7Nh_HM-Q":{"text":"Wonderful early evening, courtyard dining, complimented by superior service and beautifull","useful":0,"cool":0},"Pdg55bpGvhLxMgnhFL_Sxg":{"text":"I have been wanting to try this place for such a long time! I loved the reviews on the cri","useful":2,"cool":1},"HAl5WAD0MntilaDJPOvcbg":{"text":"Hard to find place on Decatur. There is no sign above the business , not sure if that is i","useful":0,"cool":1},"_63c4PQLvOGyGP2GydsE7g":{"text":"I was pretty sure that I reviewed Cane & Table a couple of years ago after having dinner t","useful":4,"cool":3},"ape4IDo3CgUbXPdJLsve4w":{"text":"Went last night with 6 friends. Everything was excellent. Very unique and tasteful cocktai","useful":0,"cool":0},"-c-Hz80UdKxdjU10abieJg":{"text":"Absolutely Fabulous in all the ways. Our server, Jazzy, made our dinner so memorable and f","useful":0,"cool":0},"aqf7OTml2SlLwGk1Auyrjg":{"text":"Came in to Cane and Table while waiting for a seat at another restauarant and boy was it w","useful":4,"cool":3},"psejLu5NYDIFQGVn5b7ztQ":{"text":"Visited Nola for work  and had a dinner at Cane and Table. This place was super good! Serv","useful":0,"cool":0},"XpskpI9gEnzIUEjDRpn1Bw":{"text":"Our second stop from our food tour with DK tours included a delicious classic daiquiri and","useful":0,"cool":0},"kvUFQZtCHpnEvsK6zumCDA":{"text":"I worked with Justin to arrange a large cocktail style reception for over 30 guests. He wa","useful":1,"cool":2},"Ba_ErVhNsb7UBet8w3bzTA":{"text":"I got the chance to scope out Cane and Table on a Tuesday night. I had somewhat high expec","useful":3,"cool":2},"I6D5iHYqbpyUUFSSUGVLUw":{"text":"Came here for happy hour and to step out of the crowds. Very unassuming entrance when you ","useful":1,"cool":1},"9EVN5SmyAFgnvGMlQauuOg":{"text":"This was my third trip to this restaurant in as many years. Got reservations for New Years","useful":0,"cool":0},"maBn3kvfUV512Y6aMjd0vQ":{"text":"The food and drinks here are always delicious. The wait staff and bartenders are also very","useful":0,"cool":1},"ZPhQrisWJ9wLH6pB_MXMLQ":{"text":"Came here on a google search and reserved a table. The Cuban sandwich, Brussels sprouts & ","useful":0,"cool":0},"wE6JvzRbN-edQInvdAEG1g":{"text":"Really great cocktails and fabulous small plates. Used to enjoy sitting at the bar and dis","useful":0,"cool":0},"RtCJKDpKz2v_7bH_vRnRog":{"text":"This place is really neat and has fantastic hibiscus tea and alcoholic beverages. We also ","useful":0,"cool":0},"ylNYULPpd76kImU8AZ4SLQ":{"text":"Amazing cocktails, our small plates were delicious and the waiter was the sweetest. They h","useful":0,"cool":0},"nix9mc0mMa62lWz1Ek4QXg":{"text":"What a find!!!So we actually tried to go to Coops but were turned away as they don't accep","useful":1,"cool":0},"_Y_iFkWaBCa0Qpn-MfhT0g":{"text":"Delicious small spot had a few appetizers at thanks to our local guide. \n\nFood: 4, Atmosph","useful":1,"cool":0},"cA4U3KTOxdtdSOZo6kZ_JQ":{"text":"This is the best bar we visited in New Orleans. A couple of other bartenders also told us ","useful":2,"cool":1},"NmI8ZX4-dSjMo07Zc4p_sg":{"text":"This place was WEIRD. We were the only people in there and the service was so slow. The ho","useful":0,"cool":0},"QUGke3zziANWtOYphPLjTQ":{"text":"My girlfriend and I had a fantastic experience at Cane and Table. They took every precauti","useful":0,"cool":0},"x5xS_CLqq9BZE2elAhiBtg":{"text":"wait staff Jazzie.......best of the best, patio fun...drinks amazing and food fun, shareab","useful":0,"cool":0},"DawUslaYikf265nQg-ts6Q":{"text":"While in NOLA, I was on the hunt for a good Ramos Gin Fizz.  My first trip there, I was sp","useful":7,"cool":8},"K0tMN1HmV4VD1HzE6R3aQw":{"text":"Get the coconut water/Scotch /Bourbon/something else to drink. It's insanely good.\n\n\nSure ","useful":0,"cool":0},"Ekl1rcxTw0yQFjdOFviPJw":{"text":"Came here for happy hour one day. Not the best happy hour I have been too but still pretty","useful":0,"cool":0},"RMlT0bgknAhEPDccj-k68Q":{"text":"Great restaurant with a very cool, rundown (in a good way that you would expect from old b","useful":3,"cool":3},"n2LdG4B_RFFwkRPWPvPOjA":{"text":"10/10.. From start to finish this place did not disappoint! We were in town for a birthday","useful":0,"cool":0},"eyU-Cbv7eSDgHHsmcLa0Pg":{"text":"Not bad...\n\nAfter landing in NOLA for our long weekend, my friend picked us up from the ai","useful":1,"cool":1},"vIaq_odqL8l53PfWb7ANsA":{"text":"Cane and table is our go to celebration spot. Food is incredible and the atmosphere is per","useful":2,"cool":0},"8qrKrVmgXvlAMKbAALmdbg":{"text":"Went there based on the recommendation of a waiter at another restaurant. Food and drinks ","useful":0,"cool":0},"I3JW-eFnNvmP167p_8d5jw":{"text":"My last day out before the COVID shutdown included a trip here. It was wonderful! The cock","useful":0,"cool":1},"6R6z-K8-fuDzdgZL9cz9aA":{"text":"Beautiful space, great food & drinks and amazing service - always first pick for casual di","useful":0,"cool":0},"CCuCMtekrUkAkGkjUKNpSQ":{"text":"Big flavors and spice here. The shrimp cocktail w fried saltines w an extra side of pickli","useful":2,"cool":2},"b81lXRIhw4kEv6aHMDKpTw":{"text":"Probably the best restaurant we ate at on this trip to Nola, great staff, beautiful ambian","useful":0,"cool":0},"p4loHNYIQRLjZGd8IQkT7A":{"text":"Went here for my birthday dinner and they accommodated to all of our dietary restrictions ","useful":0,"cool":0},"nEhEuNyTkISXZRKYNbBX6Q":{"text":"OMG!!!! Everything about this place is unbelievable!!! First, while I love a bottomless mi","useful":1,"cool":0},"I-iYIkOfr0_BkPyh2MiQLQ":{"text":"COVID-19 Vaccinated Review:\n\nWe found this bar mentioned on a few \"best of\" lists regardin","useful":3,"cool":1},"cuWvaYwSCKU6AhBdHodjCw":{"text":"I stopped in after finishing my meal at Coop's Place a few doors down.\n\nCane and Table was","useful":3,"cool":1},"bMrkkH2JmCM7HqH7pMu8Uw":{"text":"I tried this place for the first time just last week. Not a smart move considering hurrica","useful":0,"cool":0},"TSXU01pzjp2EUOJR5A4WmQ":{"text":"Gayest, sexiest restaurant ever.\n\nI loved our C&T experience so much, omg. The staff was a","useful":0,"cool":2},"KIq87Yt500RbW7I4ik7rmw":{"text":"We sat on the lovely patio last night for the loveliest dinner.  Dishes are meant to be sh","useful":0,"cool":0},"DB7n9tQ67b8TaUpz_-7OfA":{"text":"Let me tell you story ... \n\nI went to New Orleans during a cold freeze, and was not prepar","useful":3,"cool":1},"Nm5OAaj7s_r_SGK630PiqQ":{"text":"We tucked in here off the craziness of the French Quarter on a weekday afternoon and sat o","useful":4,"cool":4},"I0l0QqwiE84bZEaEFPSmdw":{"text":"We only stopped in for a drink after dinner and were soon seated in the courtyard. It was ","useful":0,"cool":0},"Gyuh3sk6xeZF3Qcu0ur5Mg":{"text":"I have been wanting to try the place for months and it did not disappoint. While the drink","useful":0,"cool":0},"fJ-bGBQ2IkTGVqJ7mInAaw":{"text":"The food was great, but the quantity was small for the price.\n\nMy drink?  A nine dollar bl","useful":0,"cool":0},"ZxxuVXKFIMWAocokaqpldQ":{"text":"This may have started as an amazing Polynesian inspired restaurant but it's tired and the ","useful":0,"cool":0},"OqG_RmlmXY_JqunFx6qe6Q":{"text":"This place was so spot on delicious-we were searching for Caribbean fare and this popped u","useful":0,"cool":0},"z-mffRrGxCTxvXO_47uXjA":{"text":"Stopped by because the place we wanted to go wasn't serving food today... We beyond lucked","useful":0,"cool":0},"YXu1GUvfZk6J3slxEz4qSA":{"text":"Total cocktail bar experience. Unique, tiki-inspired drinks, friendly bartender. Easy to o","useful":0,"cool":0},"YkcMcNiqKGaaWANmmRL06A":{"text":"Solid rustic atmosphere to go along with very interesting but well done food and cocktails","useful":0,"cool":0},"anSkFilWr6UQ5dtLY5x2cw":{"text":"I'm really happy that Cane and Table has claimed its identity: upscale Havana chic  + uniq","useful":13,"cool":7},"UdvwmINzimxFHKwt8h6oKA":{"text":"Fresh and tasty food, delicious cocktails. We went here with a large group and everyone en","useful":0,"cool":1},"_E4goswKhBlEX5iZvCu0Zg":{"text":"I fear that in writing this review I'll be somehow tipping off the Bourbon Street Hoards t","useful":2,"cool":1},"a9gcxaSpCENwB87EGKsL8w":{"text":"THE $18, 3-COURSE STEAK LUNCH IS A GREAT DEAL!\nA generously portioned juicy top sirloin; p","useful":9,"cool":3},"sEL_Zd1V5iPQPl0v4cRGLw":{"text":"Got takeout this evening. Food is Better than Ever. Ribs, plantains, crawfish croquettes,s","useful":0,"cool":1},"zKoDOm9MndEIFkl5zHOOkQ":{"text":"I don't know what was better... our server Jassy or the food! And then there was the drink","useful":0,"cool":0},"ZeN8AOdPT9h2W9TnWn66uA":{"text":"Cane and Table provided an excellent ambiance and menu for a nice evening out. Though in t","useful":0,"cool":1},"K_5lTpCnPholjULbd1NPgg":{"text":"Ended the night here on a bday trip to New Orleans, and couldn't have been happier. My fri","useful":0,"cool":0},"cDnjRMZBo57CT9yWwATcfw":{"text":"Wonderful brunch menu! They are currently not serving the coolinary menu that is advertise","useful":2,"cool":1},"oIAdVT0tnYhmJh7WKApH1g":{"text":"This was the most obnoxious dining experience. Though the food was at least acceptable, th","useful":0,"cool":0},"KudQgi0zGEUpSFUR75suqQ":{"text":"Excellent. Creative and delicious food, great cocktails. Reasonably priced, too! Really en","useful":0,"cool":0},"weR1lvt0jq9SEbrfrP2VJg":{"text":"This place.... Is amazing! Drinks are fabulous! The food was amazing. They made a mean old","useful":0,"cool":0},"pHpdZJebPDC6yrIrqLd7MA":{"text":"Found this spot while roaming towards Frenchman Street..  Very nice and cozy atmosphere.  ","useful":0,"cool":0},"tIbq8xXtz0bp4ZM15Sx0Sg":{"text":"This is a neighborhood bar worth checking out. \nMe and a few friends had just finished chi","useful":2,"cool":1},"W0wq3ih7bcFxP4t6UEYnAg":{"text":"Really lovely gem in what can be super touristy and not super amazing dining area.  Also, ","useful":1,"cool":0},"pmgQpPs-KeOxmuKNej_RLA":{"text":"Terrific place for a craft Cocktail! My friends and I had a great time at the bar. The ser","useful":0,"cool":0},"N-Ma5EXc-3wzOoTTHmmAaQ":{"text":"What a disappointment. Not very creative - mediocre food at very expensive prices ($26 for","useful":0,"cool":0},"NbG3WGvMxP0ifHjGaH-bgg":{"text":"This is so far my favorite brunch in New Orleans-- $45 for your choice of bottomless mimos","useful":2,"cool":1},"fFI_7x5ertCDnr9CrpSjWw":{"text":"Okay now-this place was just beyond. We were looking for a delicious place to celebrate my","useful":1,"cool":0},"kHJppNGR8FqZ9i9VG29WLg":{"text":"WEAK. Calling this Cuban or Latin-Caribbean food would be like calling Domino's Italian fo","useful":0,"cool":0},"pF8wtaUGF-aHdKNT3ToZGQ":{"text":"Have you ever had a drink so good it inspires you to recreate it at home?  Well that happe","useful":1,"cool":1},"ZGmou9sLpDHPK3OFLunsCQ":{"text":"Look, I'm going to level with you. I don't remember everything that happened at Cane & Tab","useful":12,"cool":10},"qcmLdlzmjG2HCXJ3_JJshQ":{"text":"Pork skin (chicharones) with maple syrup? (Sweet glaze) and plantains are delicious, we st","useful":1,"cool":1},"oCSqVHdPVFh0gAmnOOhacg":{"text":"Anyplace that serves a tiki drink in a ceramic Shamu mug or a hallowed out pineapple is mo","useful":10,"cool":9},"w0nbFFeWiAi_oBSXxvndGA":{"text":"Cane and Table gets a lot of press and a lot of hype, and you know what? They're all right","useful":5,"cool":3},"ONYJpSnP2W1RHMRAoWjPXw":{"text":"Recommended by a local and it did not disappoint! The decor is amazing- feels like you are","useful":0,"cool":0},"uXG_e-53vWLaBWz8fE7jpw":{"text":"Our party of 7 had an awesome time eating dinner tonight at Cane and Table. The food and d","useful":0,"cool":0},"PACzwxVCzJYr65Ne6mDRXA":{"text":"Great food, great location, and great service! I went here during the pandemic and they ar","useful":1,"cool":2},"4W7UN9nGCpX7b2I-Tn7sHg":{"text":"Cocktails? Yes. Yes especially to the happy hour menu cocktails. Food was very heavy, very","useful":1,"cool":0},"DkdOtMAHTJfGrWsWvxkLqA":{"text":"Everything was good in this place.  The food was savory and delicious, we had the ribs and","useful":0,"cool":0},"40VKRlTBvliEMGndNoYU_A":{"text":"I don't know why it's taken me so long to get here after living here for a few years. I've","useful":1,"cool":0},"-YfTya3w3FhWo7Nf_lmgXA":{"text":"Get the coconut water/Scotch/Bourbon/something else....  to drink. It's insanely good.","useful":0,"cool":0},"QWh13E8GemHvEtutxyDCQQ":{"text":"This is THE place to eat. The atmosphere was amazing, the food was incredible- not to ment","useful":0,"cool":0},"QT0I-jAoKt45z-9piotLEA":{"text":"Came in with a tour group. Had the cracklings, plantains and a couple of daiquiris. Amazin","useful":0,"cool":0},"QnnY8xMA1K7XcbR5kp_VwQ":{"text":"Hands down my favorite new restaurant in New Orleans!\n\nOur bartender recommended this spot","useful":1,"cool":0},"pajYKsxfo9Aj5dTE6Zpb9w":{"text":"Had brunch here and the cocktails, the shrimp and grits, and the fried chicken sandwich we","useful":0,"cool":0},"sR0BHeMn2WeLdMN8YIETzw":{"text":"This is a review entirely of their happy hour drinks menu - I only had so much room for fo","useful":4,"cool":4},"UZMX0TprRaTaBEXHlVsHeg":{"text":"It was just ok. It wasn't a place I'll be running back to and recommending to friends who ","useful":3,"cool":3},"L3tB56JgR8r7ojDlQ_4oRA":{"text":"5 star cocktail bar right on Decatur in the Quarter. I've probably walked by it 20 times a","useful":1,"cool":0},"F9hld635Ch_xBqhjmfmZ-g":{"text":"Like most people who live in and visit this area, I've walked by Cane and Table many times","useful":15,"cool":17},"q6uNLS979c1c3RQ_Vl40_g":{"text":"My partner and I stopped by this bar after a long night seeing the sights in the French Qu","useful":0,"cool":0},"LkiZ3svdwmfO9XxOLf_cbw":{"text":"I've been wanting to explore more French Quarter eats lately so my SO and I decided to che","useful":0,"cool":0},"t1QCCP3WVhYUajJGwUi2yw":{"text":"One of my favorite things about traveling for work is being able to go to a local spot, re","useful":2,"cool":2},"AvHw3jmgHs4kRfK6KHNazg":{"text":"The cocktails at Cane and Table are unworldly good. I'll be dreaming for months to come ab","useful":2,"cool":1},"hQkM904nvdt2xYlQhBZ0gw":{"text":"Happy Hour review! They've got a nice little happy hour in the French Quarter! 3-6pm Mon-F","useful":1,"cool":0},"fR6zYIvZhGCo-Ic4KqzdGw":{"text":"We had the crawfish croquettas, crispy Brussels sprouts, mushroom dumplings and the crispy","useful":0,"cool":0},"McpL2p6rCRzTrK6g1VO96g":{"text":"We came here Saturday morning for brunch with our group of 5. We had reservations and were","useful":2,"cool":1},"WcVJh9uQla532lGGvkxA7A":{"text":"What a great little bar!!  It was a little hard to find but it's right next to Coop's plac","useful":5,"cool":5},"6OCCUjcu-aqaB9Z50E0EKg":{"text":"Really interesting menu caught our eye.  Stopped in for a lunch and got a few different th","useful":0,"cool":0},"owjpuHqBFbL6727pEyWscw":{"text":"Cane and Table was everything we wanted, needed and more. To celebrate a bachelorette week","useful":16,"cool":11}}