{"fshOi5vq5UiPWVJ6QQ_WAQ":{"text":"Went specifically for the oyster happy hour mentioned in Nola eater.  We have been a few t","useful":0,"cool":0},"pXUiu5lYtn25s3AgH8_JNQ":{"text":"For divine dining, try Sac-a-Lait! Not only is the restaurant space beautifully designed a","useful":1,"cool":3},"us44M466R8p-a22k3EUqWQ":{"text":"Excellent but a bit overpriced food. Each dish (except a few) is tapas /entree size so you","useful":0,"cool":0},"qR_5RqWsMSokSGTYRARLfg":{"text":"over priced for the portions.  Do not get the duck.  giving it 3 instead of 2 stars becaus","useful":1,"cool":0},"jb1mw2nHNe-59-HmurxHaw":{"text":"I haven't reviewed a restaurant on yelp in over two years but dinner last night at Sac-a-L","useful":0,"cool":0},"C4klUbAJpDdnKeqmOWjvxg":{"text":"Are you or a loved one vegetarian? Do you Hate condescending and pretentious staff? THIS I","useful":2,"cool":0},"28OlU7bc66mk-Dmefwia5A":{"text":"Amazing meal!!! We love farm to table, locally sourced ingredient restaurants and this one","useful":0,"cool":0},"oR66Ao1vvzc1ziykePN9Kg":{"text":"Slow, hot, confusing menu, and I just ordered the wrong things. I thought I got turtle sou","useful":1,"cool":0},"sPnwpoVpWKeaP72DPyJsyQ":{"text":"A friend and I went to have a late dinner at Sac-a-Lait on a Saturday night. We had a rese","useful":0,"cool":0},"PHCUgi23fZadPxb6wY2QQQ":{"text":"Staff was great! They knew their stuff and explained the menu items thoroughly. The restau","useful":0,"cool":0},"eZM_z719ZvunMNHFKXP28g":{"text":"Everything was excellent. Our party had Raw Oysters, Alligator, Rabbit, Octopus Poboy and ","useful":0,"cool":0},"ggcnirvgw3V5npddVRVWbA":{"text":"TWICE!! we've hit a home run with this place. Diverse drinks and menu to suit all. Atmosph","useful":0,"cool":0},"zhqdjC-2G79qC6JwpFjxlg":{"text":"If I could give this place 10 stars I would. The atmosphere was great, the menu was PHENOM","useful":1,"cool":1},"wY4QJTAV-k9y1nP8SnLusg":{"text":"The full creole experience! Oysters, gator, venison oh my. Great authentic spot, from the ","useful":0,"cool":0},"HpC_Kjvw63vryqHLvG9Brw":{"text":"Sac-A-Lait is awesome!  From the industrial look to the service, from the kitchen to the v","useful":0,"cool":0},"iNlKxfFd6pnHhTJ1iuaSDQ":{"text":"I don't even know what to write, it's SO good.  We were visiting NOLA, saw reviews, tried ","useful":0,"cool":0},"KCbJHZSsQD2e_2LCbKPoqA":{"text":"Delicious dinner once again. Three of us tried several dishes. Started with amazing chargr","useful":0,"cool":0},"6Cy3u-yMjGzH3kTbG6mRqQ":{"text":"If you have any dietary restrictions, this restaurant will not accommodate you.  They allo","useful":1,"cool":0},"gq7-ddS_f-wOoJT3bJZ6oQ":{"text":"Char grilled oysters were amazing.  The rest of the menu was a little intimidating. Very h","useful":0,"cool":0},"btamZwjfMafwsiXZ7SG8Og":{"text":"Went here after doing an OpenTable search for reservations in the neighborhood and had nev","useful":2,"cool":0},"tlAH6n4e1KByOFKn0mKBDw":{"text":"What a perfect Jewel tucked away in the lower Garden District . I am a Chef in the Minneap","useful":0,"cool":1},"e1oWNAns_QdEMMkJv_0NuQ":{"text":"Excellent dining experience. Had a medium size group and the service was fantastic. True f","useful":0,"cool":0},"sCJ89RA8W4nNPiPt0wMMOQ":{"text":"Best restaurant in New Orleans. The chargrilled oysters is too die for! The truffle fries ","useful":1,"cool":0},"ntkIu9ICC0M3xaGgtiFiXQ":{"text":"Modern atmosphere, beautiful esthetic, cool location and wonderful staff. We decided to si","useful":1,"cool":0},"QPlM3vv3Bg7e9aHnQHqZHg":{"text":"What began as a reluctant dinner ended as an extraordinary food journey. For weeks I viewe","useful":0,"cool":0},"Mcc8wN1E6ItvKrIZvJR6yg":{"text":"Went here for one item on the menu, fried venison backstrap and it didn't let down at all.","useful":1,"cool":0},"oa-sxNkzZClPDMrwtu78yA":{"text":"Absolutely awesome. We had a full course meal, oysters followed by appetizers(I recommend ","useful":0,"cool":0},"J-U7edmvJXcaMf9ZEfBpCg":{"text":"Nice restaurant. Very large, not many guests inside, not a problem getting a table. Food w","useful":0,"cool":0},"Ht1ky_H9dbfJBHqHveIbtA":{"text":"Absolutely outstanding experience. Inventive and very tasty cocktails. One spicy cocktail ","useful":0,"cool":0},"5GiopASyPjUzII-eCD4-LQ":{"text":"Our first night in New Orleans, we chose well. We began with the chargrilled oysters and a","useful":0,"cool":0},"eBXXIoHH5gyNg632OmVfdg":{"text":"So we came here for my best friends 21st and next time I'm in New Orleans we will definite","useful":0,"cool":0},"qB-4xljEagga4arlZPHNtg":{"text":"Great meal, great service but amazing night atmosphere- all done by owners' families!!!! \n","useful":0,"cool":0},"GVGyJLQ-j-emjWvppD9AHg":{"text":"Return visit to Sac-a-lait. Most of the food was wonderful (amazing beet pie), but the Hen","useful":1,"cool":0},"ZbPkgfnDHXaSr4pStXdKPQ":{"text":"Great food - but the rest of the house needs LOTS of work. \n\nWe live in the neighborhood a","useful":3,"cool":0},"CJxNDu68f8Oa93I3XB7dyg":{"text":"In a word, SPECTACULAR!  With a long list of NOLA restaurant suggestions from friends and ","useful":0,"cool":0},"nljVdUAHzb5oRthk9r8SxQ":{"text":"Great service and good food come hand in hand at Sac-a-Lait. We tried several of there dis","useful":1,"cool":1},"jpMeb1GECGtQzK_aSH6oHw":{"text":"We are in New Orleans and have rented an apt at The Cotton Mill. As we were walking the ot","useful":0,"cool":1},"aI5VEJzN5yTSLiRvUhyzrQ":{"text":"This place is a cool, and it is a nice concept - they use local ingredients and game.  How","useful":4,"cool":0},"XTeTYgCOdQUslPibZ0Y_XA":{"text":"Hard to find. Cab had to circle the block twice as there is no sign. Took nearly 30 minute","useful":0,"cool":0},"RQFepiBdedNCkaOoXxNwyw":{"text":"Excellent atmosphere!  Great staff!  Had the Bone-in Venison prime rib and was excellent. ","useful":2,"cool":1},"GAbaiELkz78EXvAO3lHp4g":{"text":"A lovely fine dining experience with a variety extremely different. I'd like to visit this","useful":0,"cool":0},"omnCAQQDySzP88EohJ-nwA":{"text":"Sac-a-lait is an extremely unique experience. From the cocktail options, to the wine selec","useful":1,"cool":1},"HhNydd0y1DC9sqN1GHEtjw":{"text":"I'm a local and have been here 4 times since it's opened. Everything has always been great","useful":1,"cool":0},"mmQKdJTKNyTBhalBsQy6eQ":{"text":"Wonderful food , unparalleled hospitality and cool ambience- this place has it all. Had to","useful":0,"cool":0},"YjmDM7hz1q0lC4Dmom9Nkw":{"text":"Waiter was very kind, and explained the oddities of the menu.  No dish provided for bones ","useful":5,"cool":1},"KcAU6i-Apb3iyNLf8RNBLA":{"text":"Outstanding!  there is nothing more to be said. This food will bring you back to when your","useful":0,"cool":0},"alT6AiEm9CCh74Vy6YkeIw":{"text":"Food was beyond delicious! All 4 of us were pleased. Our server, Maurice, was extremely kn","useful":0,"cool":0},"RNnWYmd_pLU_0btZ7P7REQ":{"text":"Front house manager, Shannon, is AWFUL!!!! In a not-full, but open/loud dining area, with ","useful":2,"cool":0},"stYP63-tuoNRgjJBWXqW-w":{"text":"This is the most innovative menu you will find in New Orleans with the most well informed ","useful":0,"cool":0},"U3OAnKBXtIRUFXwlDGRodw":{"text":"Amazing and delicious food. If you are open and willing to try an eclectic cuisine this is","useful":0,"cool":0},"k3rCqZwHaeMypZJLFtgGhA":{"text":"I'm a pretty tough critic, I come from a big city where we have literally any type of food","useful":3,"cool":0},"4ZF-q_WvePth9Bc0poz0ug":{"text":"Fantastic meal from start to finish.  Deviled crab, turtle boudin, stuffed peppers, redfis","useful":0,"cool":0},"fB6cCL27Xjh3JDc_doo62g":{"text":"I read the YELP reviews before dining at this restaurant so my expectations were high as m","useful":2,"cool":0},"qMaQx9eKdaY1V-Y6qjQvBw":{"text":"Sac-a-lait offers a sophisticated touch on southern family recipes. Plus, they change the ","useful":1,"cool":1},"xvAuWSmx2ET1VQfBljtyfw":{"text":"Once they seated us, the waiter was kind to our group, however, it took him a considerable","useful":1,"cool":0},"RRlIJdkGmo7uJpelb0uyuA":{"text":"Outstanding!  there is nothing more to be said. This food will bring you back to when your","useful":0,"cool":0},"RB5-NqlNVIfyHkDp1gLJPg":{"text":"Revisited a few times over the last few months. Menu continues to offer solid fish and gam","useful":0,"cool":0},"JyITJzwEH_FIDETzIbDE3w":{"text":"It was a gamble. No one could tell me anything about the place. What a payout!! Words can'","useful":0,"cool":0},"NX0zsb9oqD1OOJ1nDuY4JA":{"text":"Best meal and cocktails hands down anywhere in NOLA.... this was our last meal and was def","useful":0,"cool":0},"vLiwMqNDPUSp_E0KURj-2A":{"text":"I have no idea who would write such awful reviews about this place, I guess they can't han","useful":0,"cool":0},"kdkQcTzgYiYf7qAhCXs-3Q":{"text":"I wish I lived in New Orleans so I could come to this restaurant on a regular basis.  The ","useful":1,"cool":0},"TuLW9s2Ylx6M-1WIzGWlzw":{"text":"Everything was just marvelous. Do go! Just order everything. My favorite dish was the craw","useful":0,"cool":0},"DBRurCN-TNB52syxOJwccw":{"text":"I chose this restaurant from yelp, not knowing much about it and I must say it was the hig","useful":0,"cool":0},"OQAsX5oF_9fjeZmF3YiyOg":{"text":"Blow the doors off good!\n\nThe menu is a clever Louisiana infusion with mostly influences o","useful":0,"cool":0},"YNegj98nmdKQaNxHl3XwUw":{"text":"Top notch drinks and food. The biggest oysters I have ever seen. Take the bartenders advic","useful":0,"cool":0},"96KaH3Bn1mP-td5QbY2u1w":{"text":"If you like unique, adventuresome, delicious, beautifully plated, every-dish-a-winner rest","useful":1,"cool":0},"hsFjpUAfxm4ngbnVy2tXNg":{"text":"Interesting menu and the service was good. Chargrilled oysters were delicious. . However, ","useful":0,"cool":0},"DyeWYqC4yplxC5p-augQZQ":{"text":"Came to this restaurants with reservations but this establishment refused to make accommod","useful":2,"cool":0},"egYmRJcga39ofAZZKxc7lA":{"text":"We ate here last night before going to a party. Waiter was great and fully explained the m","useful":0,"cool":0},"hZF-n10iVdlZpJVakRiVzA":{"text":"This place is nothing but exceptional. From the little details  of service to the beautifu","useful":3,"cool":0},"3Jb4Sex0Ngcw7A9rHxQ6JQ":{"text":"Four stars for service, no stars for food--too bad they don't have minus stars for kitchen","useful":2,"cool":1},"hcJeCGVhyNP2wvHop5WAjQ":{"text":"I went for lunch and had a fabulous experience. The server, Christopher, was personable an","useful":0,"cool":0},"b_bNkMNDhlZMDlsvyHgbvw":{"text":"Never disappointed always the Best Quality Cuisine . Total attention that is committed to ","useful":0,"cool":0},"BiGQtamw8dLqkJ9GN-urCA":{"text":"The best meal we had in New Orleans. Starting with the cocktails - delicious and balanced.","useful":0,"cool":0},"9uekK0e0PK2CWQV8jyv0Ow":{"text":"I've been here a couple times now since the restaurant has opened. My god, it is my new fa","useful":2,"cool":1},"j6VH5YryVe4tZsliWP3PZQ":{"text":"Enjoyed every bite of every dish we ordered. \n\nHubby and I were so excited to have our ann","useful":2,"cool":0},"FpF1Kf4r6EzeoJgfH6tbzQ":{"text":"Wonderful service, perfect (and affordable coffee), delicious turtle boudin and an inventi","useful":0,"cool":1},"NRgmscPjMlQIMdhxiodQiQ":{"text":"Great bartenders.... creative menu with some solid dishes.  Truffle-honey fries are amazin","useful":3,"cool":0},"neo3Yvt-mQ5hXn52qaJh_g":{"text":"Had lunch here last week.  It was phenomenal - can't say enough about it.  We had a lot of","useful":0,"cool":0},"SJOfKh8sxYxECfpnyK-JXA":{"text":"I had an amazing time here at sac a lait. The ambiance of the restaurant was sweet with a ","useful":1,"cool":1},"fjF7Rg8xVFPXPj8Qj1aOtA":{"text":"I showed up for an early reservation, 15 minutes prior to the restaurant opening, assuming","useful":2,"cool":0},"NsnTC3qSV1Y2mhSenqjmng":{"text":"We thought it was a casual restaurant at first but it was a bit more fancy than we thought","useful":0,"cool":0},"rQtfdIEGisEs9ewu0khpxw":{"text":"This was our second time here and it was even better than the first. Very creative Louisia","useful":0,"cool":0},"7_xqRbTSO4pReCT9cuTRMg":{"text":"Everything was delish here!!! The lagniappe was a welcome surprise. The alligator app and ","useful":2,"cool":1},"UEl3D--dtlNcNtN3pFoDdA":{"text":"Don't let it scare you.. I was frightened to death when I saw the weird menu.  Definitely ","useful":0,"cool":0},"3Yc_Bzvv_eltlnzkzQi3iQ":{"text":"Enjoyed 2 meals the first week open. Went to dinner and brunch. Delicious food . I have tr","useful":0,"cool":0},"lW_bqX2FOwOGc6ZNsGjprw":{"text":"The GF and I went here recently and had quite a nice time.\n\nI had the frog leg & alligator","useful":1,"cool":1},"VsE9dUsZvcOcJD4Hut8wsg":{"text":"Cool ambiance in the warehouse district - a little quiet for a Saturday night, but great a","useful":0,"cool":0},"X6VrcoYcHj2dEKBhArWIUw":{"text":"Beautifully renovated warehouse. Great cocktails and a menu of plates to share. Exquisite ","useful":1,"cool":1},"4ObGKvFrhfXQqBof9hIL6Q":{"text":"After one look at this menu we realized we were in for a real treat. Starter after entree ","useful":1,"cool":1},"ml683-JoKSwVh-IFNIwxcA":{"text":"Decent but not exceptional. You can find better in NOLA\n\nGumbo had good flavor but the all","useful":2,"cool":0},"q6MFYEvaBtSUNl8b6WpPUA":{"text":"Let's level set: this is definitely not a 2 dollar sign restaurant. After tip and tax, thi","useful":3,"cool":1},"3yeZo6Eun4MSwuWrv-5cDw":{"text":"Just had one of the best meals of my life at Sac-a-Lait.....and I have had a LOT of meals.","useful":0,"cool":0},"nLpp-QExd1H3xFGexx6yvQ":{"text":"A lot of creative dishes and great service. My partner in crime L and I ate 6 animals on o","useful":2,"cool":1},"vVUtAlrvI5MlGUbrnj9E-g":{"text":"In two days my wife and I ate at both of their restaurants Sac-Lait and \"Hot Tails\" (100 m","useful":0,"cool":0},"YO0kp5lKo13qpj0r5_U2IA":{"text":"My original review of Sac A Lait was pretty dismal, mostly because of the horrendous serve","useful":0,"cool":1},"J_r4VPKSORL51Cpm7yaPNg":{"text":"We have a condo in the cotton mill and were very excited for this new restaurant.   We tri","useful":2,"cool":0},"68A_Mipjqn-87oEGtLkKnQ":{"text":"My family and I went out to Sac-a-Lait after a heavy lunch, as we had read reviews beforeh","useful":0,"cool":0},"eyN0UlCH2whurwa_4Ra09w":{"text":"We had a great meal that was nearly ruined by a rude waiter. There was no apology from the","useful":0,"cool":0},"biw3JaCZr1KUduKeEGeSlg":{"text":"My coworkers and I (total of 6 of us) were here for a trade show and we like to treat ours","useful":0,"cool":0},"2ow-2JT1PvzHzsKkcKVwkw":{"text":"Was so optimistic considering the innovative menu and strong reviews.  But it was an unfor","useful":1,"cool":0},"SLnmXMk73V6TfafOpqc-FQ":{"text":"Overpriced food completely ruined by terrible and rude staff. They were slow and arrogant.","useful":1,"cool":0},"HsVp2c16-eWYRiN0wJwStA":{"text":"The food! The service! The beautiful space! This place is on point. It's a fine dining exp","useful":0,"cool":0},"fxVys4Zlh32rRvo-tsXIvw":{"text":"Fantastic food, ambiance, experience, and service. This is a real treat and jewel of a pla","useful":0,"cool":0},"Pr_RGSVRm-e-xuZjDH_gGw":{"text":"Amazing drinks, chargrilled oysters, appetizers and desserts. BUT the entrees were just OK","useful":2,"cool":2},"lnDgABmWtIbatx9DQ9yzaA":{"text":"We had heard good things about this place and the menu on the website looked awesome, unfo","useful":1,"cool":0},"PY9p7cvAPqkTTRlaSuKwJQ":{"text":"Touchdown! If the food here was a football team. It would have just won the superbowl! Wit","useful":2,"cool":0},"aJI3X0veyfaxpYbPtE2Iow":{"text":"Make sure and try the alligator, the black garlic scrimp and look to be surprised by somet","useful":0,"cool":0},"zkZEXbE1GsPHD_gG5pnCKA":{"text":"This place is awesome. \nThe food was incredible.\nWe had pig ears, pheasant their Brussels ","useful":0,"cool":0},"4JqhSiQmzZlg1DndZvwhjA":{"text":"Came in last night for a group dinner. Party of 11 and they had to split our table into 2.","useful":0,"cool":0},"co7f8LkI0gkYox1yFfauGA":{"text":"I should be a food critic. Less than 1 year after my review this place got #1 restaurant o","useful":0,"cool":0},"pGFCenHUU6gL9A8wpGWsQg":{"text":"The food was very good.  The service was exceptional (but, coming from NJ, I found all New","useful":1,"cool":0},"o2s-TnA2al8eW29iaxVcIg":{"text":"I'm a big fan of Hot Tails in New Roads, so I was really looking forward to trying this pl","useful":0,"cool":0},"m-hdvPANZedMCjNftMGkwA":{"text":"If you're looking for Farm Fresh to Table with a Taste of the Wild in a unique setting the","useful":0,"cool":0},"LOYVOjfF1TdQuFp4krTKcQ":{"text":"Had a wonderful evening with my sister, cousin and 89 year old aunt. All of us were extrem","useful":1,"cool":0},"ZZ4VlfQSK_g4lqimlkr52w":{"text":"This is my second time here, and again it did not disappoint.  We walked in which is unusu","useful":0,"cool":0},"mDTdF0vLUCJGPoEPaAb4hg":{"text":"Oh hello there you amazing restaurant! Wish I would've met you earlier in my life! In all ","useful":0,"cool":0},"gB3ElPDt9KH2OWDix3b10w":{"text":"After reading the reviews, the bar was set high. Easily, the best restaurant in NO that we","useful":0,"cool":0},"d2eY9c9nmO9TlalLk_xucg":{"text":"We stumbled upon this gem after a visit to WWII museum. So glad we had the chance to do so","useful":0,"cool":0},"RSuoWNYRX61e4C5GAlm3lQ":{"text":"The food is delicious, but pricey. Great service though! Our server explained all about th","useful":0,"cool":0},"YQyRLJSd4P6hYIhj5v0FzQ":{"text":"I was so looking forward  to  coming to Sac a Lait. Many of my friends had been here and l","useful":7,"cool":6},"0R9NP1PzLo3u9I7me02h_Q":{"text":"I'm so glad that we added this to our list of must enjoy restaurants while we were visitin","useful":0,"cool":0},"pH7buR3_9hGQYDEyOy_TNA":{"text":"I love this place. Ambiance is modern and relaxed, the bartenders are really friendly. The","useful":0,"cool":0},"1DX-ppAGdknL753BmXZysA":{"text":"Great menu, awesome drinks and knowledgeable staff. This place was standout for venue and ","useful":0,"cool":0},"PAhQGnj9AstGpygjVFZlHw":{"text":"One of our best meals in New Orleans among many great dining experiences. Interesting take","useful":0,"cool":0},"B5Se7okmjUU23a_Zg69x3w":{"text":"This was the highlight of our trip this year.  Outstanding service and food was creative a","useful":0,"cool":0},"_h_vRElxsWs51BVWIp6prQ":{"text":"The most delicious meal I have ever had. My favorite dishes were the tuna tartare on top o","useful":1,"cool":1},"uh9KrRnfiX4YlQQVujLmuQ":{"text":"The food here was really yummy. We split the gumbo and it was delicious. The waiter and se","useful":0,"cool":0},"NnIac2fz5QZ_NVgO4NSOrw":{"text":"We reserved a table on Open Table. When we arrived at our set time the restaurant was clos","useful":0,"cool":0},"I73zNBwHAZv728wAo-Aweg":{"text":"Great atmosphere, amazing food...don't let the ingredients scare you! Service was awesome ","useful":0,"cool":0},"1hdf5ZPvI3835uWyoo7RXg":{"text":"Great first trip here. Service was impeccable, friendly and courteous staff. Food was flav","useful":0,"cool":0},"Yrrf9Knhgehmt75LzgB9FA":{"text":"Hanging out in New Orleans for the weekend with my girlfriend, we wanted to go check out s","useful":4,"cool":0},"pyCkbwRTu4O7jB8oc0kZVQ":{"text":"One of the most awesome meals I have ever had! Everything from the service to the ambiance","useful":0,"cool":0},"wl7jXr2PV1BFNPTqwpbdIQ":{"text":"Four stars for the service, five stars for the food. \n\nI came here for dinner on a Saturda","useful":2,"cool":0},"wpgCGPNR8fLrxp9Jbt36Xw":{"text":"Wow, do they get it!  Stylish space in a refurbed factory floor in the Warehouse District,","useful":0,"cool":0},"19Rtgvnai3-d1WnequN9_g":{"text":"This restaurant serves average portions and is fairly priced for it's location and type of","useful":4,"cool":0},"_Z9oM39l4o10bXNih2TIlw":{"text":"******Eagle rating*****Great experience. \nFinally we made it here; the WE is my wife Liza ","useful":1,"cool":0},"mza657N1pNwxihFsi1iKZA":{"text":"Strike Two!  After two tries here, I can only say that I will NEVER return!  I wanted to l","useful":14,"cool":4},"J-xwrcp9hNTT8JtYAImowg":{"text":"Lovely restaurant and great food, reasonable prices.  Great experience all round","useful":0,"cool":0},"5HrvYIP4CsaF8PoEMinGMw":{"text":"So this is the worst review ever.  I ate a Sac-a-Lait months ago and I totally forgot what","useful":4,"cool":1},"ebL3RaRqUy7VoDJqPlNm7A":{"text":"Went here on my own at the tail end of conference in NOLA. Food was amazing. I got the dev","useful":2,"cool":0},"vpGbGx6gG098NvQXxM7QAQ":{"text":"Hands down the best meal I've ever had. We ordered six different dishes to share and none ","useful":0,"cool":0},"Pe3okf_tQ7Nxh1IbnNJYQg":{"text":"Right up there with Dragos for the best Chargrilled oysters I've ever eaten! The alligator","useful":2,"cool":1},"AhmoyWwgljIyvRVjc9od3w":{"text":"I am the former owner of the restaurant that operated at this property for the last thirte","useful":2,"cool":2},"u4pT7liDv6sJdsmW0Hkn8A":{"text":"Sac-A-Lait has to be one of my top 5 restaurants in the city right now. I've been here a c","useful":7,"cool":2},"TCyyW6rTYDfmvzeU-r9zAQ":{"text":"Started with delicious chargrilled oysters, smoked cobia and alligator w merlitons. Fantas","useful":2,"cool":1},"0bMyIKKYIPYRzVEuObzSnQ":{"text":"What is happening to one of my favorite restaurants? Closed on a Friday night? A recording","useful":0,"cool":0},"XftW0J32wz5XOusWFcl3ow":{"text":"I made a reservation here through Open Table because it boosted \"fit for foodies\" and coul","useful":0,"cool":1},"Jw0Rc0W9JoWa2lUMKxGfTA":{"text":"Outstanding experience!  Bench seating at the bar and an attentive staff member.  Innovati","useful":0,"cool":0},"m9GrtCqDZ1KX3bV6B8z6lA":{"text":"Amazing venue and great food! Highly recommend this place! The owners are mostly always in","useful":0,"cool":0},"mMo9LwehJ8_EgRv9vkaq7A":{"text":"Food- Sublime\nService.... ridiculously bad. No eye contact and the bizarre behaviour of a ","useful":3,"cool":0},"etgRZC1-pRpSg7yNg7OGzQ":{"text":"Amazing......the things they do with food here will blow you away. The fish is incredible,","useful":0,"cool":0},"T6elTAxfIOuTE3K6bVsRyQ":{"text":"Adventurous creole food. Great ambiance. Great service. Good cocktails as well. Off the be","useful":0,"cool":0},"Xoz_3SCzB0Y-9MYBIhQ-Ig":{"text":"So sad this closed. The tastiest, most creative cuisine we found during our 6 months that ","useful":0,"cool":0},"FG88_puRXSyGSy2M8V8XtQ":{"text":"This restaurant has a very eclectic menu, all based on Louisiana country food sources.  It","useful":0,"cool":0},"jy52ATnaWKPgnwbx24pRXQ":{"text":"2nd time we visited Sac-a-Lait. The food here is innovative and very tasty. Definitely wor","useful":0,"cool":0},"dn_j_ch3hAjx55Y47REweg":{"text":"OMG... I can't wait to write about the STELLAR experience I had here.\nMy recent dinner on ","useful":0,"cool":0},"16wYNh73aPluuSVuSx0AeQ":{"text":"Food was amazing. Seriously good. It's a little adventurous, so don't expect the normal hi","useful":0,"cool":0},"v980ao3ljQYS3tTLgN6Lug":{"text":"This was our wildcard restaurant on our recent trip - I picked it because it was one of th","useful":1,"cool":1},"rh5Cood9SRbpLPijNjjTrQ":{"text":"Fantastic service + a delicious menu. \nThis was a last minute decision to dine out on a Tu","useful":2,"cool":1},"0qO-b95u8JhUGh9T1XZGlQ":{"text":"This restaurant was a welcome surprise. What I thought was a very ambitious menu was deliv","useful":1,"cool":0},"9BSjWiYIh9Rjlba4EWdv0A":{"text":"Went here with my son & a business associate of his for his birthday, looking at the menu ","useful":1,"cool":0},"lumfltmVJtuNtocBG5fcdw":{"text":"This place is an excellent addition to the warehouse district! It is in the old sun ray gr","useful":1,"cool":0},"UqKXwiiRvn-PgcWXpv2ubg":{"text":"Creux-Creux (16$)// whole fried bullfrogs served with a green goddess sauce. Okay, I've ha","useful":5,"cool":4},"K1Pau7_5P2uqeULW6F2jDQ":{"text":"Tried this place as a last minute, new restaurant experiment by 2 people who enjoy NOLA di","useful":1,"cool":0},"Nsi-OdD__dof37tJbzvGRw":{"text":"Very creative menu, one of the best restaurants I have ever eaten at. The restaurant itsel","useful":0,"cool":0},"EzViSgePWwfm4c46nJcFVA":{"text":"This place is fantastic. Food was delicious, especially the snapper with courtbouillon. Lo","useful":0,"cool":0},"VbKjwN3YnqJFilI81Ekfxg":{"text":"This was one of the two best meals I had in New Orleans, if not the best. The food and dri","useful":0,"cool":0},"w3wPutPe1yssM4LhI4mRJw":{"text":"Went in with some friends early one evening. I can't say that we were treated friendly. On","useful":0,"cool":0},"xaMOp2VNhVHr04ZeT32TvA":{"text":"Here's the good: Sac-a-lait is one of the most beautiful, locally-focused restaurants in t","useful":6,"cool":2},"WPr8osmumC32tFypgTvyGw":{"text":"This was a taste sensation!  Scott made some terrific recommendations that we went with: g","useful":0,"cool":0},"D-1xC_0qKlWqBEHYdFatSw":{"text":"Took an hour for our food.\nPlace was super nice on the inside but I think they were trying","useful":2,"cool":0},"d5vJLDOgbN2n8vFIM6qibg":{"text":"An absolute MUST-try!  The food, cocktails, service and concept makes this place one of th","useful":1,"cool":0},"vPXouPEC_5UTl9Qm9iPnXA":{"text":"I was more than happy to see this building get rid of SunRay grill and bring in a new rest","useful":5,"cool":1},"E0zsbxwqXsraTzKTtSB8lA":{"text":"There's a daily happy hour, but YOU MUST SIT AT THE BAR to get the happy hour specials. Th","useful":4,"cool":1},"vh9_GMJl2EfZ3FPR05RsEQ":{"text":"More like 3.5 as an opening score for me.\n\nWe have had this one on our \"list\" for a while ","useful":3,"cool":1},"jJC8h3Fsk__AFXYFgJDrxw":{"text":"My husband and I came here for dinner on a Saturday night with another couple, so we got t","useful":2,"cool":0},"97cSE9PcE952Fe7w0QAyhA":{"text":"Hot Quail.....delicious! It was very tasty breaded and cooked to perfection. I asked for t","useful":2,"cool":2},"Qv0HusK5ZW-KXoS58sznbw":{"text":"They are trying really hard. food took over an hour to come out. I wouldn't eat here again","useful":4,"cool":1},"O6AfqIix70te73dBPRN7gg":{"text":"Dear Yelpers,\nIf I could give this restaurant a lower than 1 star, I would.   Here's the d","useful":13,"cool":5},"U--W2mAxZfLdD5JD6phr7w":{"text":"Try Everything...and if you are not super adventurous, maybe just try the alligator.  Tast","useful":1,"cool":1}}