{"y9rFmK8IsvQJPmVyKfFgBg":{"text":"WHAT HAPPENED.  Loved coming here to get phenomenal  cocktails.  Just had two drinks that ","useful":2,"cool":0},"xk5eR6ycTybXGNs4DpDSwg":{"text":"Huge fan.  We had gone to the qrtr for dinner and it was packed cuz of oyster fest.  Big m","useful":0,"cool":0},"scx71eRjBq4xbhPmgtPG2w":{"text":"Cocktail bar was superb.  Then drink selections are unreal.  To sit and drink our way thro","useful":1,"cool":0},"G26q-a4vEYR-PjXdLNcCmA":{"text":"Not the best serious cocktail bar in town. Below are my reasons:\n1) Asked the bartender fo","useful":1,"cool":0},"8HtjuvO7Oyt_mgka7McCWQ":{"text":"Had a whiskey kiss and vieux carre here last night. Both were excellent. Friends liked the","useful":0,"cool":0},"dtNmV-e8HHHFH0kNRc3Apw":{"text":"This was probably my favorite bar in New Orleans.  Sazerac bar has good cocktails but it's","useful":0,"cool":0},"D8vaSlVs4Puv9X11Qrafuw":{"text":"Cool little quaint bar with fantastic drinks and the prices are almost half wait most plac","useful":0,"cool":0},"_66m5l25Xt-n4nxyF6LMDw":{"text":"Great unassuming cocktail bar on the outskirts of the quarter. If you want properly made c","useful":0,"cool":0},"1Q63WNYo1Q6pw9s0zeAusg":{"text":"great place, great cocktails. I had a few pimms cups and Aviators. very speakeasy style an","useful":0,"cool":0},"JnBmpLTlCRvYMKIgIYwTcA":{"text":"I was super excited about Tonique and their famous bacon Bloody Mary. Unfortunately, the b","useful":2,"cool":0},"3SWOG0isluq1zzlM9dEleQ":{"text":"My favorite cocktail bar in New Orleans. Their Moscow mules are easily the best in town- m","useful":0,"cool":0},"-4t5osJAg4a1_m3EJlUCnw":{"text":"I wasnt in the market for drinks... it was getting late and the kitchen had just closed. H","useful":0,"cool":0},"um8DTJQ9hHbkZqGMW9RPYw":{"text":"Go here. You can stop reading now. Ok, don't, because there is one more thing you must kno","useful":1,"cool":2},"whKYeF4zHFQmJLbpAK7ceg":{"text":"The best- a cut above the rest. Never had a bad drink here. The bartenders don't make fast","useful":0,"cool":0},"XWYWQXnT1fsL35Ny9kjhwQ":{"text":"The third drink is always better than the first! Have three old fashions during happy hour","useful":0,"cool":0},"GlWLycuG5C67AYJjN9ZR7Q":{"text":"We tried a number of drinks here on a couple of occasions. Pimm's cup, Hot Buttered Rum(go","useful":2,"cool":1},"URipX_vjgN3WvfnbvfsfZg":{"text":"What a difference a year makes.  Went there twice this trip, the first time on Saturday wa","useful":0,"cool":0},"QpSI047P6Xv7XIHs7HALNg":{"text":"Great bar, best one in or around French quarter. Old school craft cocktails but not preten","useful":0,"cool":0},"RhEBkMS94Vh5ujKSovoYpA":{"text":"Off bourbon and a lot more intimate.   You might think you're in the lower east side of NY","useful":1,"cool":0},"Q2T2TB7srYorDUpz-RSScA":{"text":"One of the best bars I experienced in the city...\n\nDivey , unpretentious, seemingly locals","useful":0,"cool":0},"bFxHgV8MAhB5Xy-j3ilY8g":{"text":"I used to love going to Bar Tonique and always considered it one of the best cocktail bars","useful":0,"cool":0},"UHpcKS_DvtV0bbc_JlKHDw":{"text":"Affordable Coctology in a solid vintage atmosphere. Bring your patience, you will be waiti","useful":0,"cool":0},"ZyGHjIsE50tonqgQ6-2gEg":{"text":"Fantastic classic cocktails. I came here in a group of four and we all loved our cocktails","useful":0,"cool":1},"L8pC0O2NH6xuZ0t0Fvm7AA":{"text":"This place was recommended by our hosts  and I'm glad we visited. It's the sort of place w","useful":1,"cool":0},"_cjMLGPeNGWv-vi4-YXQCg":{"text":"This is the spot you want to get a drink at when you're over the slushies full of sugar an","useful":3,"cool":1},"FhIKMiQZPTZvYMCimjf4pg":{"text":"Awesome bar just outside the chaos of French quarter. Good vibe and service. Enjoyed the c","useful":0,"cool":0},"YeoKSVzGgBLx7T_nsREexw":{"text":"Great local bar with bartenders who savor their craft... they spend the time to muddle, sh","useful":1,"cool":0},"bOIPtvtqUoy_gD1o6BUVhg":{"text":"Being from Portland, a hipster's paradise, this place made me feel right at home.  The cro","useful":0,"cool":0},"SbX7ni2Xlim_wQ7H3FmurA":{"text":"Best Old Fashioned of my life! No Joke. My gf and I stopped in here to grab a quick drink ","useful":0,"cool":0},"o3-cJ9Po8RF6ZBJxZKnPZA":{"text":"This is a great bar that all the bartenders like to hang out after work. It's a great spot","useful":1,"cool":0},"ikR7CpLVx3ldZ-i3-TYIew":{"text":"An utterly unassuming bar for well-made cocktails on the northern border of the French Qua","useful":2,"cool":2},"XezJUM_h64voIJW8P1TV8Q":{"text":"A little too stuffy for a New Orleans bar located on Rampart. And when I say stuffy I do m","useful":0,"cool":0},"rkf581xZb38Hj89IGVZ6fA":{"text":"I went to New Orleans for New Years this year, and had an awesome time. but when my friend","useful":0,"cool":2},"bC19D5tteYm8cKpzNW4pJA":{"text":"Possibly the best and most artful drinks in town, certainly the best I have tasted in my y","useful":0,"cool":0},"9ZpKajm187CCx6l3pXQt4Q":{"text":"Was in NOLA for a few days with my Australian boyfriend and was suggested this bar by a lo","useful":0,"cool":0},"j396SsYjQaWsK_YsIMhcPw":{"text":"Real cool bar with a great vibe!\nWe ended up in this bar following a reco from a friend.\n\n","useful":0,"cool":0},"tPDgGAi5mwCj3pW3YrynAw":{"text":"Enjoyed a refreshing cocktail here on my first afternoon in NOLA (Aviation) Low key and co","useful":0,"cool":0},"iU446jVQb-gi2nRbV2pIeA":{"text":"On a Tuesday night my mom and I were looking for somewhere in the French Quarter near our ","useful":0,"cool":0},"Lc5bMZqoZHTYKfOjW1D2AA":{"text":"Awesome drinks here with an edgy yet chill bartender. We were told that they served hurric","useful":0,"cool":0},"5wGYA2aSTsby4bk0_spRCQ":{"text":"A downtown bar with an uptown feel.  I'm not giving it 5 stars, mainly because it IS downt","useful":9,"cool":7},"pcZ1_mGQAjSwM-S8H4G1bw":{"text":"Went in for a lovely after work drink this afternoon. Amazing selection, and I witnessed a","useful":0,"cool":0},"8W59Aekjd4T-b_UmNKoKNg":{"text":"best bar in New Orleans. frenchmans dark & stormy baby!  mint julep is a frosty snowcone!!","useful":0,"cool":1},"zK3-eNt_mFIa3eaKZioisw":{"text":"Some reviews refer to this as a dive. I think if you've ever actually been to a true dive ","useful":0,"cool":0},"incx7p2p38-wxz3IY1AVog":{"text":"If you want a cocktail with people who should all be your best friends, this is the place.","useful":2,"cool":0},"GJLZD_qli5qxaCsaTfPADQ":{"text":"I was told this is a great new mixology bar in NO, so we went ready to sit, drink and have","useful":0,"cool":0},"dS2h-6Pqjh_FqLZwgs4H_g":{"text":"Tonique is a very interesting bar. It lies at the crossroads of a local hole in the wall a","useful":1,"cool":2},"dXDGC-FM6zRQrlVT5Go4_A":{"text":"I love this bar. And when I say love....I mean it's my bar of choice after work. \n\nWith a ","useful":2,"cool":1},"zlUjAkwhtpMVB3kevE_Wew":{"text":"This place is perfect for cocktails ! The staff is sweet and everything is fresh! Highly r","useful":1,"cool":0},"EK4flsubw6sJJNkmOIAXig":{"text":"At bars, I am a sucker for excellent service and boy does this place live up to my expecta","useful":0,"cool":0},"PLqLlDvYdnj395Tbr_MOQA":{"text":"Simply put, well done cocktails and a tremendous, choice playlist from the bartender. My n","useful":0,"cool":0},"Lxww73jawIzJg7MrhhOrxg":{"text":"If your looking for a classic cocktail away from the hustle and bustle..... This is your p","useful":0,"cool":0},"_xM5Riy2Z5-N8-yP-TQUSQ":{"text":"There's a reason why Bar Tonique is the top-rated bar in New Orleans. Actually, there are ","useful":10,"cool":5},"LtxqETIBYuRThbiRwq8GJA":{"text":"Whiskey kiss! We miss Sonali!","useful":0,"cool":0},"ZvENod6-OwQKTaAgozlp2A":{"text":"Best Bar in NOLA. A bit on the outskirts so seemed to have a more local and quiet feel :) ","useful":0,"cool":0},"zJeuA-mdipAgCB7LjlBj8A":{"text":"I live in New York and as a consequence have really learned to love a good cocktail bar. S","useful":0,"cool":0},"OTFs2078nyfZyzCF8IseCQ":{"text":"When I go to a bar, this is the kind of bar I always want it to be. It's a place whose foc","useful":0,"cool":0},"3Ej_g0i415LfxFeRnhntpA":{"text":"Tonique on the Rampart edge of the FQ is simply one of the best bars in the city!\n\nSome wo","useful":5,"cool":1},"3QLMeHkU-1Ru22S7KyaT2A":{"text":"Just about perfect.  The weekend of August 17-19 marks the first weekend that I spent in N","useful":1,"cool":1},"xKHDL5TGncbQJbwMT51wZA":{"text":"Spent a nice relaxed Wednesday night here after work. Classy layout and lighting with frie","useful":0,"cool":0},"QEkIBSvHqgixjalCfgwXdw":{"text":"SMOKERS, SMOKERS, SMOKERS. If you don't mind walking out smelling like poverty and regret ","useful":1,"cool":1},"Jrn45NbuUTRmPdAkeVkk8g":{"text":"Decided to swing by from a recommendation from our bartender at 21st Amendment. His descri","useful":2,"cool":0},"afeItkn5H1w5aHyykM3Mng":{"text":"Loved this bar!  I am really into high-end cocktails and meant to check this place out on ","useful":1,"cool":1},"uGzbBlLEobjLfxbMfT_Iew":{"text":"5 star drinks, 2 star venue\n\nMy host brought me here and we sampled 3 different drinks, al","useful":0,"cool":0},"0npI-XSLxAfo2Pm0z2uTkA":{"text":"Best cocktails in New Orleans, but this bar only has one bar tender working at a time. If ","useful":2,"cool":0},"gPzqV4HCdS7aie-EEYlYYA":{"text":"I love this place. The drinks are cheap, strong and great quality. The mixologists are on ","useful":1,"cool":0},"rbT6Tlk1B6OhJG_9Lulk2Q":{"text":"I like that this is a dark and cozy little spot right off of N. Rampart--an underused area","useful":1,"cool":2},"Ef-OoSZGxzRj0NWpui_3aQ":{"text":"Really hip and cool bar. Not a huge space. Cocktails are fab.","useful":0,"cool":0},"EwQ3v8DKlLSACxGxKgpwDw":{"text":"THE perfect respite from the absolute madness and unpleasantness of Bourbon Street. \n\nMy f","useful":0,"cool":0},"p1-XNOJledUNl5wTwOZDZQ":{"text":"OK listen if you want one of the best Moscow Mule's in the city this is definitely the pla","useful":1,"cool":0},"VQfFurMdoKtg6NK_9bJCmg":{"text":"Small venue outside the French Quarter. Low lighting. No darts or other bar games. Great s","useful":0,"cool":0},"COLy2IanqkkotkOA1A-q2A":{"text":"Thieves!\nThis bar had a good atmosphere, but the service was awful. The bartender didn't k","useful":1,"cool":0},"6LXHCcbmwVS8MCtgpcSfKQ":{"text":"Good cocktail bar\nBad neighborhood","useful":0,"cool":1},"ABt5L83AxlvWfqiCZVNuDA":{"text":"this is the type of bar, and bartending that is ruining new orleans.    took 15 to 20 minu","useful":7,"cool":0},"McsPwRjCbBjD85ojGtDy1w":{"text":"One of my fav mixology bars in NOLA. Bartender was awesome, knows her stuff! Will def come","useful":1,"cool":0},"x3o5vwKHjClc4bB8QuRJ1w":{"text":"Went here twice during my recent stay. Went in late one night had a seat and was very insp","useful":0,"cool":0},"PRExORzrAnkaUNTig3Ecrw":{"text":"Beautiful craft cocktails. I don't think I will ever want to go to another 80s impersonato","useful":0,"cool":0},"Ab_rm489N_9O6Alp6BADrg":{"text":"The Gin Fizz was by far my favorite drink I've ever had. The bartender was so careful and ","useful":0,"cool":0},"uX1hDgX5YZUU2XNZzkmyxQ":{"text":"This bar was the best one I went to in New Orleans. The atmosphere was really relaxing and","useful":0,"cool":0},"7wGg9uwBh34gpsttcSrYlg":{"text":"After trying SEVERAL bars in the \"French Quarter\" this was a pleasant surprise and a great","useful":0,"cool":0},"Mb8b9zzeqk7C_ptsnY8VMQ":{"text":"Dark and stormy= exquisite. Very chill place. If ever there were a reason to bypass Bourbo","useful":1,"cool":1},"dWqMK6pwRC8dnXimcAqaMw":{"text":"First stop on my weekend tour of NOLA with one of my fave girlfriends. This place was pack","useful":0,"cool":0},"WOMaZ8UfBagwmW0pLEUcjg":{"text":"What an incredible place. To call them bartenders is an insult. They are wizards and alche","useful":1,"cool":0},"yyWETmX9BC-9gh0bDAbt-w":{"text":"The rudest bartenders in New Orleans. Being hipster is one thing but c'mon. Just bc you th","useful":5,"cool":0},"3Cw6sLJyiPugAeX_AwsPig":{"text":"This place is so comfortable to be inside and hang out with friends. They have a great hap","useful":2,"cool":0},"Gnykmkcsk_tMNzXYQI0g6Q":{"text":"Bartenders were friendly, knowledgeable, and made killer cocktails. Brought food from a ne","useful":0,"cool":0},"mUtqOdJ7-HmH0e7MntQ7Ew":{"text":"Fantastic crafted cocktails.  Friendly service.  Would definitely come back.  They make th","useful":0,"cool":0},"QLBWg7fyK4sg1FwE26tssQ":{"text":"During our whirlwind tour of NOLA, we decided to start night 2 a little bit more classy. I","useful":0,"cool":0},"QBAOdxbgE0NdArp1cM5mkw":{"text":"Great hipster off the beaten path bar. Hard to dislike. Our concierge who was a former bar","useful":0,"cool":0},"sIcSSFd_sOmLW3P9HvGUcQ":{"text":"Hipster meets 20's era cocktail bar. I am in love. By far the best hand crafted cocktails ","useful":0,"cool":0},"OOQF2lJNXsz7CeIzZ1gINQ":{"text":"Got the Ramos Gin Fizz. Amazing presentation and absolutely delicious. Cool, chill vibe in","useful":0,"cool":0},"rRXxANrM_9oh3tw64384eA":{"text":"Stopped by on a whim on a weekday afternoon during the FQF after a local highly recommende","useful":0,"cool":0},"RLZ0u2GzeYNwb5eDd04PvQ":{"text":"Great cocktails made Here! Nice atmosphere,  not too loud, very laid back. Big list of dri","useful":1,"cool":0},"PXcXVUhl2nigquxJoEifyA":{"text":"This place is great! Came on a Tuesday night, not crowded at all. The bar is small however","useful":2,"cool":2},"ofNORUEuHMVrtrF5Ht75tg":{"text":"Yeah, you can get booze almost anywhere in the French Quarter, but the craft cocktails at ","useful":0,"cool":0},"-Akg2qVgGDU6u9Bcp_XoPg":{"text":"Maybe my favourite cocktail bar anywhere. Basically perfect.\n\nReasonably priced, expertly ","useful":3,"cool":0},"M5dYx6ChmvmBKldWLzljDA":{"text":"I like this place. Its very unique... The location is a little odd Rampart is not the Safe","useful":1,"cool":0},"8gf9MlZ58Q7CWyhH82a3-g":{"text":"Enorm ruime kaart aan alle soorten sterke drank: rum, whisky,.. Gezellig ingericht. Ik had","useful":0,"cool":0},"XCfoiAfGGJ0bB_L0IWa1dA":{"text":"I had Bar Tonique in my bookmarks to try for over a year. And I finally get there and they","useful":6,"cool":4},"nv_jTpmzDKfAtXEt1p9PUA":{"text":"Great spot, especially while Justus and or Sonali is tending bar. Great handcrafted cockta","useful":1,"cool":0},"kKk1gSlhN_qAApFB2oPL8w":{"text":"It's hard to spend money in a place with poor service. It took over ten minutes for the ba","useful":3,"cool":0},"hmy44WgpovxlpOjiEwbqog":{"text":"I came on a Mon evening so I'm sure the crowd was a lot different from the usual weekend m","useful":0,"cool":0},"8wStK99BNcT6FaMa5TFAtw":{"text":"I love the drinks here. Unfortunately, my friends and I have had several extremely rude en","useful":0,"cool":0},"AQGBGUlQR76DDXhBrlmwtQ":{"text":"This is the place to come if you love cocktails!  I dont know if the bartenders know how t","useful":0,"cool":0},"TLcPbdQKbWlezebx-ZAs3g":{"text":"1 year ago, I would have given this bar 5 stars. It was my favorite bar in the city; I hav","useful":2,"cool":0},"OQTvbB4GYvCxbDxfZ-uqow":{"text":"I've been going to Tonique since 2010 and I was very happy to find it.  The cocktails here","useful":2,"cool":0},"Apy9mFQby-_YTt5iKEy_fQ":{"text":"The Spot\nAmidst the hustle, bustle and bright lights of Bourbon Street there are still sop","useful":1,"cool":0},"hOLs40zbkLp5hTn2ak5kfA":{"text":"Hip, relaxed, come as you are cocktail bar where the barkeeps know how to mix a mean drink","useful":0,"cool":1},"JhQj20BJcg8MzzhccEyCDA":{"text":"Words cannot describe how much I adore Bar Tonique. My boyfriend and I spent the weekend i","useful":2,"cool":4},"5LENas9HS4OvQJfvHhheSg":{"text":"love the drinks but the bartenders need major attitude adjustments!!! hate saying that con","useful":3,"cool":1},"OSISRkE6MEEOZ44QqeolKg":{"text":"First off, let me say that every experience I've had at this bar has been a positive one, ","useful":1,"cool":0},"q3UNTfwCOPF-HH2U592oMA":{"text":"A perfect combination of charming decor, great bartenders, and a dive-bar casualness. The ","useful":0,"cool":0},"3PNL8ymRYsw1tUOIRwp5gQ":{"text":"This is a great little, upscale-cocktail, down-home vibe, 2-drink place located a sane dis","useful":1,"cool":1},"EIwG2YeyzwfwYWzusyoarA":{"text":"Love it, love it, love it.\nMaybe it's just the indecisive person in me, but Tonique just h","useful":1,"cool":2},"X5ELHhHkoBsO7y9o_vjUvw":{"text":"I was brought here on a semi-blind first date while I was in town performing a wedding.\n\nW","useful":0,"cool":0},"1cPZ3FghD7_624U5lhDkCg":{"text":"Really chill laidback bar. Dark intimate vibe with great classic drinks. They have daily d","useful":0,"cool":0},"JWrKepnBgrL-RaeMpI65aQ":{"text":"Look I love this place. It's very \"grown and i enjoy drinking so either join or leave me b","useful":1,"cool":1},"iF65S31AlRQg-KQcVwc5_g":{"text":"Having just moved to the French Quarter I was in the hunts for a new regular spot to chill","useful":0,"cool":0},"3Kvk-AB8dX1MWL5vOtw2pg":{"text":"We found this spot as it appeared on a list summarizing NOLA's best Old Fashions and boy d","useful":0,"cool":0},"6wyhwCNl-o-T277qyWrqYw":{"text":"I adore this bar. This is my favorite new (to me) bar in New Orleans. Full disclosure, my ","useful":0,"cool":0},"yV0D7ggqYZv6DYYv_QR4OQ":{"text":"This is a fanciest hole in the wall I've ever been to. Scratch that, it's quite classy whe","useful":2,"cool":1},"4SueTOa5LG8Q4RhM2NGCGQ":{"text":"I am a local and have been to Tonique on many occasions and my friends frequent it often. ","useful":3,"cool":0},"dl1VkbPdeLAyoBbjKWM9EQ":{"text":"Truly some of the best cocktails I have ever had.  Fancy cocktails are very trendy right n","useful":0,"cool":0},"nM3PlmeTgVezXPpJEKC4Ig":{"text":"Went here for the first time after hearing good things about it. I was very excited: the d","useful":0,"cool":0},"wSm6C75D3zzyUSBDvt6bSA":{"text":"In search of a more \"authentic\" New Orleans experience, a group of friends wandered in her","useful":0,"cool":0},"agZSlR4ZeLbDPonsTqMT2w":{"text":"The menu is very impressive, the prices are reasonable, and this does not appear to be a t","useful":0,"cool":0},"gSAy8Bb4GOQFXod2ZtWVoA":{"text":"I asked the bartender at Galatoire's whether there was a martini lounge and he sent me her","useful":0,"cool":0},"6avzmR8ay2e3YUmCI-v6aw":{"text":"3.25/5 too hip for its size\n\nthe place is just too small. groups of folks will come in and","useful":2,"cool":0},"jE5nOnaDBLOSSJRXn7diRA":{"text":"Very cool atmosphere and vibe. Got a Moscow mule and dark and stormy and both were super g","useful":0,"cool":0},"U1BIK7ncw7LeGbbXSLqoDQ":{"text":"Love this bar!  Very unique and always a good vibe in there.  It's a little small.. which ","useful":2,"cool":0},"qE1gkwCQWZHUYHnomg-MKQ":{"text":"It's a cool place... seems touristy, though, despite its off-Bourbon location; for the pri","useful":2,"cool":0},"Th0hRm8tx5-4XqSDsVKJjQ":{"text":"Well thank you for noticing, these pants *are* fancy. I do feel kinda fancy pants here, th","useful":4,"cool":4},"sckFSp7_zBSUlVVc7FjpeA":{"text":"My 3 friends and I went in on Monday March 17th excited to escape the St Patricks day madn","useful":3,"cool":0},"0mOgxmoLcZxFSove3JmV5A":{"text":"This is definitely one of my favorite bars in the city.  Superior, inventive cocktails, co","useful":0,"cool":1},"gaKo5sLumXJuPWpmeL_H1g":{"text":"Stopped by for a good cocktail and found my favorite spot in New Orleans. Mark took good c","useful":1,"cool":0},"whdd2pkIbDxStx0zAgKiwA":{"text":"\"Where are we going?\"\n\nBar Tonique is quite a long walk from where I was staying during my","useful":1,"cool":2},"GdphIJaMZiRhZ_g8b-mXQA":{"text":"Awesome cocktails! After two different occasions spent at Bar Tonique with two different b","useful":0,"cool":1},"ONwdop9Mt2zdvwiqXTa4tA":{"text":"This bar came recommended by another local bartender. It was a welcome respite, just block","useful":0,"cool":0},"fpcD07bvcaKT2f_RgSReaQ":{"text":"Great place to grab a drink and chill.\n\nMy friend told us that Carousel was the after-rece","useful":3,"cool":1},"vfxdQ4CWGHHuXFEBR8rxaw":{"text":"My boyfriend has lived here for 8 years and has raved about bar tonique since-- I could no","useful":1,"cool":0},"mF3K7GX7E_eUxcxtXDyfrg":{"text":"Dark, smokey and lovely. A cozy little craft cocktail bar tucked away.  I loved the menu a","useful":3,"cool":3},"mmrgTQPrFWNc0-hWfBIVPA":{"text":"If you are looking for stronger and more creative custom craft cocktails this is as good a","useful":0,"cool":0},"HKZEG24MVNuXC37EqpH0bQ":{"text":"If you like dark - very dark - and slightly smoky bars with a menu organized around taste ","useful":4,"cool":4},"lZW4l_N5RQ94VxrKphzeZA":{"text":"I dont really review places that often, but i felt the need to log in and review this plac","useful":6,"cool":4},"zt6jT4HNKuBp6aBhVbfhnw":{"text":"A happy hour that starts at noon every weekday does not surprise me for NOLA, but lucky fo","useful":8,"cool":2},"ebvF6TFzUxYUgbaLAWLGkg":{"text":"There are lots of great cocktail bars in New Orleans, and this was my favorite, so that sa","useful":0,"cool":0},"CAfGDrSsVJ92fS81YcU7tg":{"text":"We stopped in to BT for a quick drink after work this evening. We are locals and have freq","useful":3,"cool":0},"42VhQi-lK_Xzrerjbzwi7g":{"text":"I enjoyed a drink here and was impressed by their selection of drinks and spirits. The atm","useful":0,"cool":0},"XBCFEpejBOf8aW4wtHLZaA":{"text":"Update : Still no card. I still like this place even though I had to cancel my card and ha","useful":0,"cool":0},"8U966-PXvSnIQy2CoobtKQ":{"text":"Great place for a happy hour with friends or to get away from the FQ but still be technica","useful":0,"cool":0},"Oq6EV_b8ixlfzqVO3aLdEw":{"text":"Great place to escape the madness of bourbon street and the French quarter in general with","useful":0,"cool":0},"XuP0EAwY1AQ7nWd16aXgyA":{"text":"I ended up coming here my first night in NOLA. I got 1 Moscow Mule, finished it, and immed","useful":1,"cool":1},"gLPXumzvEQf2_4fz5ladlA":{"text":"Between our two trips to NOLA this year, we visited Bar Tonique four times and were never ","useful":0,"cool":0},"DINExujGqmnyg1otpt_6Gw":{"text":"So, I have returned and I have tried SEVERAL more cocktails.  I went on a Thursday, caipar","useful":4,"cool":2},"lQNxzAZtoMKpDwx25bVjQg":{"text":"This has always been one of my favorite bars in New Orleans.  As has been said, the $5 dri","useful":0,"cool":2},"Fcvu3DxQu76dEMHwr_4XVw":{"text":"Incredible service. Will was the greatest bartender I have ever had , and I am a cocktail ","useful":0,"cool":0},"YLC1zxzS5GB-vrQmeDOcgw":{"text":"Nice, low key bar. We trekked her because they have a great selection of non-alcoholic dri","useful":0,"cool":0},"WDcbhpb0RFg0uGQsMxad6Q":{"text":"One of my three favorite bars on the North American continent.\n\nPerfect atmosphere, stella","useful":5,"cool":9},"hy33cvdsfTN1bQLvlpkFwg":{"text":"Bars are a tricky thing in New Orleans, particularly if you are no longer a local, but cer","useful":4,"cool":0},"keNgmHUtIut_8G8KixlqCA":{"text":"One of the newcomers in this North Rampart edge of the french quarter.  I have to say it w","useful":1,"cool":1},"fIER-pE7vdU2xDvpcW01Yw":{"text":"We were told this bar has great hand crafted drinks. They did not disappoint with the drin","useful":0,"cool":0},"KDiIpdsoWdaeDdJSeq2fww":{"text":"A laid back and down to earth atmosphere. The perfect noise level. The friendly bartender ","useful":0,"cool":0},"r8x4YIyMU9XTXDWgnW7K0w":{"text":"Delicious cocktails, sexy ambiance, not pretentious, and reasonable prices. I loved it and","useful":0,"cool":0},"OP6weih-DDpDY8zjXF6GsA":{"text":"Great hidden gem. Close to everything but doesn't have the Burbon street vibe! Seemed like","useful":0,"cool":0},"6reIa3HaIzmT2gGSTYEJsA":{"text":"Some of the best cocktails in the city. Think of the last perfectly made cocktail you had ","useful":1,"cool":0},"mgPAMHetpZwZt1FMoSrmng":{"text":"Fantastic little bar set a few blocks from Bourbon St, in a less touristy area. The expose","useful":3,"cool":1},"RlDPgP0UQkOWhKqKgzm5jA":{"text":"Great atmosphere and cocktails, but unfortunately my girlfriend and I had to leave without","useful":1,"cool":0},"Y2xz-PjzOb2EtnpJ-JXqow":{"text":"One of my favorite bars in New Orleans. Hands down. The well trained bartenders at Bar Ton","useful":1,"cool":1},"JrrnZ6lSE2d4kVj4NDqrDA":{"text":"This is my favorite place for a cocktail in the city. They make their own syrups and essen","useful":1,"cool":1},"tC68nPrfTDMj1TG-rZyazw":{"text":"I love Tonique and will continue to go there.\nThe cocktails are great, the ambiance is exc","useful":0,"cool":0},"i4fvbvhtTbgHA4_g1oI9-w":{"text":"Just a few hours before catching a flight home, and with some time to kill, we meandered o","useful":0,"cool":1},"dNdI_vdcrhykTPcng08ygg":{"text":"No shortage in this town for places to have a great cocktail, this is one of them. A littl","useful":0,"cool":0},"6oadhEhQjKWEMkQde0n80w":{"text":"Drinks are good. Bartenders are rude. Walked in on a Monday night at 930. I usually enjoy ","useful":1,"cool":0},"crmMWi2MUwBwuZ_-rolc_A":{"text":"Bar Tonique was a delightful stop on our New Orleans tour. We met as knowledgeable and pro","useful":1,"cool":1},"NfgkzAt97tmKSIDJ_n6bBA":{"text":"When you walk in it immediately looks like a dive. But think of it more like a hole-in-the","useful":1,"cool":0},"N6-zTSHiiN9rYFB8FqUbWQ":{"text":"My new favorite bar in NoLA.  Vieux Carre is perfect here.  I wish their happy hour was lo","useful":0,"cool":0},"KReU0NW3rNR5-H7XttsouA":{"text":"Some of the best drinks in town. Service is always great too. I am crazy for their Bloody ","useful":0,"cool":0},"nwzL5wiDutrfN9hFef4ccg":{"text":"Great vibe, gets hopping at about 4:00PM. Walked in and thought, am I in the right place. ","useful":0,"cool":0},"RK03Zz-jz110lISY1yx8NA":{"text":"I went on a weekend night, but it wasn't too crowded at the bar. Also, it was my birthday.","useful":3,"cool":0},"vjGkLEVTJbvdd0CTzha84w":{"text":"Went there due to the great reviews here and the close proximity from my hotel(Maison Dupu","useful":0,"cool":0},"STyIw24HkvdFMCuYH9AMQg":{"text":"This is a cocktail lounge very close to Congo Square. It is a comfortable space with high ","useful":1,"cool":1},"eR-rACGqbC3FN-pARglBIw":{"text":"Rampart is something of a hard street, broken buildings across from a dangerous park, wand","useful":4,"cool":22},"mi6517jhbB12QWRxaFiHTA":{"text":"There are bartenders, there are mixologists and then, there are alchemists like Jonathan a","useful":5,"cool":3},"DJv5pzJ1H2fhZYktfJM3Gw":{"text":"Great little local bar. Amazing cocktails. Do try the Moscow Mule. The ambience is great .","useful":0,"cool":0},"FMx5-9MSH5sYYgdhClr-fw":{"text":"Small, chill craft cocktail bar. One of the best gimlets we've ever had. Highly recommend ","useful":0,"cool":0},"Q3hxAymkgesosAm0u2IRVw":{"text":"The bar has a great ambiance and a great selection of cocktails. It is the perfect place t","useful":0,"cool":0},"9HgNfKtxI8uR02ZwrQnE8w":{"text":"One of the best memories on my last trip to New Orleans. This bar is not for snobby touris","useful":0,"cool":0},"a1iKpaD7mm_6WN8Vhw230g":{"text":"Fantastic place for an old style cocktail with a quieter atmosphere than most places.","useful":0,"cool":0},"4DE8XXGx8HfgA_sXf6atVQ":{"text":"I ordered a special, the Blanche Dubois! Yum! Bring a date here or gather with some friend","useful":1,"cool":1},"WfNnXhO-6WWpBOakw3Zi5A":{"text":"Are you looking for a well crafted cocktail?  A gin and tonic made with house made tonic, ","useful":3,"cool":2},"oI-kXFZWYLQs-iLZfbeiAg":{"text":"Housemade syrups and soda on tap. Fair prices for nicely mixed cocktails. Daily special $5","useful":0,"cool":0},"GeLnkms4p3bBxqIOFwwxzw":{"text":"enjoyed the atmosphere, the drink specials and the drinks themselves and the bartender was","useful":0,"cool":0},"E1BBZ212w8avmUyQPC-dKw":{"text":"Great dive bar with an attitude. They know what they're doing regarding drinks and style.","useful":0,"cool":0},"29GbeswHwmCiRJ_wXk_yNw":{"text":"I was in New Orleans to celebrate my birthday & we found this place on Pinterest. Brett, o","useful":0,"cool":0},"MGXtJ1RLSdCMXy78i0ekwQ":{"text":"My favorite cocktail bar in the city. The prices are a little high but the location can't ","useful":0,"cool":0},"S9rKPBTdoMQowAS1CVBBIw":{"text":"Nice cool out of the way craft cocktail bar. Super dark bar with outstanding affordable ta","useful":0,"cool":0},"gaOIY6eh0EzPzVe6irLyFw":{"text":"This was my favorite bar on my last trip to New Orleans. My boyfriend and I loved stopping","useful":1,"cool":1},"cIzomaplMu-yqkCLMeiTXg":{"text":"Love love love this place! I stumbled on this place in the summer and it has now become my","useful":0,"cool":0},"Li0mZFvWxS9QUZ2YiCBzBg":{"text":"Cure for a broken hearted Niners fan? Sonali, best bartender in New Orleans!","useful":1,"cool":1},"bjExAUYNVEnehlPDmUvShQ":{"text":"I went to this cool place for the second time last night. The first time I spent a lazty a","useful":0,"cool":0},"1K3sFkFFWjt_Ahawg8WI1Q":{"text":"I came in for a cocktail after lunch uptown and before meeting friends for the Krewe of Co","useful":1,"cool":1},"qlHb1ZdR-Y49iKQx445q9w":{"text":"Love this place. Were from out of town and a friend recommended it. Delicious cocktails wi","useful":0,"cool":0},"_eJKTdxoKkE34hL8ZSnSvw":{"text":"This was my favorite bar in New Orleans.  I was in town for my birthday weekend and was ha","useful":3,"cool":1},"Oyy3vO1yutRxSW7Mi2iC5A":{"text":"Nice spot across from the park, old look to it which was cool. Great drink specials althou","useful":0,"cool":0},"F7BzCDxeVuyV1NwiogxCfw":{"text":"Anthony Bourdain was right.\n\nThis place is awesome!\n\nAmazing cocktails, including the saze","useful":0,"cool":0},"nWpuuOshqneuUUaotiID8Q":{"text":"Beautiful craft cocktails. I don't think I will ever want to go to another 80s impersonato","useful":0,"cool":0},"QdbEsDngWKJXajVYH3b52g":{"text":"This was one of the highlights of my recent visit to NoLa. Thanks to this handy feature ca","useful":7,"cool":5},"OueNm0MOef4a_6GDuYFHJQ":{"text":"stopped in for drinks in the afternoon and had an excellent Sazerac and a vieux carre cock","useful":0,"cool":0},"QeNbnOOYb93Q2YmuC7I0tQ":{"text":"Needed a place to throw back a few drinks after the longest 8 hour drive into New Orleans ","useful":0,"cool":0},"gLJbMfZ19kQnN1JVnzHUBA":{"text":"Not impressed. I should have known when reading the scratched \"staff is rude at bar toniqu","useful":2,"cool":0},"6nvmd1RWOl6pEqd8X0me2Q":{"text":"I've only been here once, but based on that experience, I can say that this is keeper in t","useful":1,"cool":1},"JOzgF7kCY3bvFg-4v2qAvA":{"text":"If you haven't been to this spot in NO, RUN DON\"T WALK.  It is off the beaten path.  Direc","useful":1,"cool":0},"sY3nR7Tu3KeeYikCDyt06A":{"text":"Trip to NOLA is not all about Bourbon St or French Quarter; no one go to Paris just to see","useful":2,"cool":1},"RYNUMgEtZ5oySdIWSVXKuA":{"text":"For all you people looking to relive your animal house days and sip your giant hurricanes ","useful":0,"cool":0},"FDKV8Qc9f3R8su6_yx5sfQ":{"text":"After roaming around the Quarter, trying unsuccessfully to find our friends, we gave up an","useful":1,"cool":1},"cEkCFEVWRcEKGllxJFwr7w":{"text":"Mostly the music is fine. Happy hour is best. It's pretty small with no outdoor seating. S","useful":0,"cool":0},"1alMK47fF_8aLAReL2Vc3w":{"text":"Bar Tonique is Cure minus the pretense and house music. \n\nAt the edge of the French Quarte","useful":2,"cool":0},"r1N8ycW9ycdozjn4f-9t5g":{"text":"My husband and me strayed off the beaten path a bit and ended up at this dive last night. ","useful":0,"cool":0},"DFqUoHFP29YzsivgNFVb8w":{"text":"AMAZING cocktails. YUM, these cocktails were truly unique, incredibly tasty, and worth eve","useful":0,"cool":0},"3sX8OXnw-kokFpGduYFcjw":{"text":"Great bar. They take their drinks seriously. Noel is a great mixologist.  Great selection ","useful":0,"cool":0},"uYS11cv6vJJeYMAENt8RzA":{"text":"This little bar was a gem hidden across the street of Armstrong Park. The bartender Steve ","useful":0,"cool":0},"BoU1_DNUfeP3AratYp3AZA":{"text":"If you're looking for a hand crafted cocktail in a dive-esque atmosphere, look no further,","useful":2,"cool":1},"tTMU5qEnXRfKwSgkqagiYg":{"text":"Great bar in the French Quarter for getting delicious classic cocktails!\n\nThis bar has bas","useful":2,"cool":3},"c_FQUaVVa4CWjeFtuAvDaw":{"text":"Tonique has the best cocktails in the city.  They make their owns syrups and even their ic","useful":0,"cool":0},"Xm2rD8ui9Y3m8YoVSU2nAw":{"text":"1st bad experience at bar tonique as the bartender screwed me on my drink profiling me. I ","useful":3,"cool":0},"Xxxhy3o8h-3pPEzqbkEQMQ":{"text":"Very dark, very quiet out of the way spot.  If you are looking for a great tasting, crafte","useful":0,"cool":0},"C4MYwlG0gq8QCWJqluI5Sw":{"text":"Great bar with pretty cool drinks. \n\nI wandered in right when they opened and the bartende","useful":1,"cool":0},"0DDHg8fStfQL-WNAg7ijPw":{"text":"The cocktails are outstanding, but the staff needs a major attitude adjustment! On multipl","useful":2,"cool":2},"kQaGyj6AIoOt0MSP0P7Log":{"text":"ALERT: This is my new favorite bar. If I lived here I would be a regular fo' sho'.\n\nEqual ","useful":2,"cool":0},"I3HbSsnW3a_EZ6LFdq7LWw":{"text":"A little slice of NYC cocktail mixology with the inevitably relaxed atmosphere of NOLA.  R","useful":0,"cool":0},"389ucMhpaTZQd11r9dbQdA":{"text":"My Sazerac was absurdly good. It was obvious that the bartender knew what she was doing - ","useful":0,"cool":0},"k31bEuQYELCIi70e-RDTtQ":{"text":"This is where you step outside your usual cocktail comfort zone.  U shaped bar in the cent","useful":0,"cool":0},"Y3hp0RM3aWb0n4kiTLVkzw":{"text":"Checked this place out last night for the first time. It was so much fun! First of all its","useful":0,"cool":0},"vHXETrHcPbCJm7gSnzGD6g":{"text":"Overall, very relaxed atmosphere. Amazing drinks. I'm a giant chartreuse fan so I was quic","useful":0,"cool":0},"lfqfYsiiSb2KWxipH0z9-Q":{"text":"A hidden surprise....creative drink menu.  Nice ambiance.  Pretty ecclectic people who com","useful":0,"cool":0},"ofTTBRbCr-gnIZgIF1JbTw":{"text":"Probably one of my favorite bar experiences in New Orleans thus far. \n\nSince it's located ","useful":0,"cool":0},"g2z3mirTlWzBf80IDBNhMA":{"text":"Locals seemed to like this spot. My buddy and I seemed to be the minority tourists here. \n","useful":1,"cool":0},"UD3wQUxxgI1Myk2JxR7bvA":{"text":"This is one of my favorite cocktail bars in New Orleans, partly because it has the ambianc","useful":0,"cool":0},"abaE8ZW6mx2VkHNFOGRi5Q":{"text":"Love this bar! Happened upon it after needing a break from the Bourbon Street shuffle and ","useful":0,"cool":0},"HCOFJNxP00DO2utody2zww":{"text":"Bartenders were so attentive, Somali was the SHIZ!!! Drinks so fresh and made with flair. ","useful":0,"cool":0},"ux90PJFmMLLquTjFhnAcrA":{"text":"We ordered caipirinhas and they were really good. I love this place, in a touristic area b","useful":0,"cool":0},"C1fJLuR0UNQ_LlvLJprVHw":{"text":"A terrific bar that's changing the vibe of Rampart. They have a classic list of cocktails ","useful":0,"cool":0},"DZ4yFSyQnBF6rJBcCgG8zQ":{"text":"I want some hot buttered rum from Bar Tonique right now and it is the summer time.  Delici","useful":0,"cool":0},"8kJXtU57KWz9XItF8Mj7zA":{"text":"Cool, hip, with great, imaginative drinks. The birth of a New Orleans tradition. Both visi","useful":0,"cool":0},"bWPjoolc6YBAABrmgl12NA":{"text":"Our group of 8 ended the night here after a round of bar hopping. This place was a bit of ","useful":0,"cool":0},"GwpVGpqhaqLN2Qtf8d-Q1w":{"text":"Killer drinks.  Killer service.  All the classics.  If you appreciate the art of a good co","useful":0,"cool":0},"Pd-oJbNCmccCwsqdvqXmLQ":{"text":"Bestie and I had been in New Orleans for a couple of days and were feeling a bit overstimu","useful":0,"cool":2},"k65eO1uHYuzZvw7zjXpwRw":{"text":"I read about this place online and sounded too good to be true. But it met all of my expec","useful":2,"cool":0},"1WVgvT0Stoio6N2NV4jTkg":{"text":"Bar Tonique manages to balance between classy sexyness with low-key comfort and their mixo","useful":2,"cool":0},"VF3sqBbS-ilLBh7CU5Y4Bg":{"text":"Wow wow wow. Listen. Or read the words I write. Do you like gin? Do you like homemade syru","useful":3,"cool":0},"FZDNnU24FOTTB96CGIoHKA":{"text":"My husband and I came down to New Orleans for a weekend getaway from NYC.  We took a strol","useful":1,"cool":0},"OXTDdImwLbI4PfhkD3P9AQ":{"text":"Hell yes. Stumbled upon Bar Tonique and am so glad I did. It's an intimate cocktail lounge","useful":0,"cool":2},"QZBsYlmt7lbvTtnG0qhOrg":{"text":"I went to Bar Tonique for the first time this past Thursday night. I wasn't in a hard liqu","useful":1,"cool":0},"8Dj89Jle-dxN-LwkYuT7qg":{"text":"My absolute best New Orleans find yet.  Small but full of life.  Made some excellent frien","useful":1,"cool":0},"MoQbWCTQysnY7gDEB7Hs-Q":{"text":"Calling these \"drinks\" is an insult.  The cocktails here are amazing, the Ramos gin fizz b","useful":1,"cool":1},"x0BqhK0572fap0htUBwmJQ":{"text":"This bar is set up to deliver outstanding cocktails no matter what hits the door.  Unfortu","useful":0,"cool":1},"6LdbN6b1xVaX27xSldbGCQ":{"text":"Hands down the best bar in town. Leave your pretension at the door, these guys are experts","useful":0,"cool":0},"USENKCBWo-KOXjF-U6-E9g":{"text":"A spectacular bar, off the (over) beaten path further towards French Q/Frenchmen st. Beaut","useful":3,"cool":1},"oUellyigioIJcqe9nFiCfw":{"text":"Good place for a fancy cocktail or a clandestine meeting with a new lover. Dark and intima","useful":1,"cool":1},"fNIxS0yEZDRi4gFXW_pwpw":{"text":"We have visited this bar twice,on both occasions there was only one other couple in the ba","useful":4,"cool":0},"omcy2FZF5xiI5X_M_QCY6Q":{"text":"It was girl's night at the symphony, so we decided to meet up to pre game for some drinks ","useful":8,"cool":0},"aYjfJl5TEqBrBYhUge7XSg":{"text":"Off of Bourbon Street, great drinks, cool atmosphere. Pretty small place so I wouldn't tak","useful":0,"cool":0},"dxExxFyG4As_U55RiVAVQg":{"text":"New Orleans does not have any open container laws, so while in town, my friends and I deci","useful":7,"cool":1},"1g8dnv29p4AUYqAGXwI1AA":{"text":"Good drinks and cool ambiance! Had a delicious caipirinha and a side car. A nice speakeasy","useful":0,"cool":0},"BUq2C4E4a5WjO0HP_4V9Iw":{"text":"Jesus' tits! How did writing a review of this place escape me?\n\nMea culpa, baby. This dark","useful":3,"cool":3},"z9eKGITNY2dJustLb8JzAg":{"text":"This was an unexpected stop before heading to the airport and leaving (sadly) New Orleans,","useful":0,"cool":0},"-4hxmt9FDrv_lcEVlN-HSQ":{"text":"Decent drinks. HORRIBLE roach problem. Although this isn't abnormal for the area it should","useful":1,"cool":0},"1vJ1KmF_WijvFrCp4WTYFA":{"text":"A big regret of my NOLA trip is that I didn't get a chance to try Bar Tonique a second tim","useful":0,"cool":0},"gy60OtX_OqCaysGliYpYTg":{"text":"If your looking for a nice respite from Bourbon Street and a cozy place to hang out.  This","useful":1,"cool":1},"oorRLi3m_dD5zBrUR0IDKg":{"text":"GREAT drinks!!  GREAT bar!!  Definitely worth coming here!!  Mark, our bartender, is aweso","useful":0,"cool":0},"hYyXp1qK36vw94aEmfLtKA":{"text":"Holy crap!  This place mixes some awesome drinks.  I had a gin and tonic and it was the be","useful":0,"cool":0},"8jyH-z9G8XbwQUmnac7Cnw":{"text":"Have you been to my speakeasy? It's really great with plenty of seating at the bar, cozy c","useful":3,"cool":1},"r8zyNNnsfwdXWYGB8FDUfQ":{"text":"Seriously most amazing mixologist Noel, she was the best!! Knew every single drink we aske","useful":0,"cool":0},"1TD9_qv4jJeshsL6PxkSXA":{"text":"Blanche Dubois was here name, and she was tasty. I'll have another....but what the heck is","useful":0,"cool":0},"AMzQaUJpLHI2fv1mKOtHmQ":{"text":"4 stars for the atmosphere and being away from bourbon street....the drinks, although not ","useful":3,"cool":1},"8pg-hz3gq58VgM3HrSwp_g":{"text":"So, bar tonique has no \"tonic\". Sold out?? Out of the way and not particularly interesting","useful":2,"cool":0},"XmbfIxM3JvGPRFg331q1Ig":{"text":"My favorite bar in the city. Awesome (and cheap) cocktails, great atmosphere and service. ","useful":1,"cool":1},"4HvllRqeFbjTcESVohSPEA":{"text":"I once went to a bar that had a sign up that said \"Vodka is as tastless and devoid of char","useful":1,"cool":1},"pZrbYvs54aB4FhSsXilx1g":{"text":"The bartender was incredibly rude and served our cocktails in plastic cups. Her attitude t","useful":2,"cool":0},"FWnZwlyHRC6nkOJsnvWehw":{"text":"This place is nothing fancy and it's tucked in a small space on the outer edge of the Fren","useful":0,"cool":0},"dlWHEdOEEW00MVO1WI9SLw":{"text":"Would have walked by this one... Do not miss small nondescript bar N. Rampart. John the ba","useful":0,"cool":0},"Ab-NhuFY1MB-nQGOUqRF_Q":{"text":"Great. Everything about our experience at bar tonique is going to be a reason we return wh","useful":0,"cool":0},"u0RfIBKSpkLbhygGxK3Ycg":{"text":"Overpriced fancy crap.  They don't even make Bloody Marys.  And they're all stuck-up.  Chi","useful":5,"cool":4},"JVURPjL84lRpjKS-bS1dXg":{"text":"Looks sketchy on the outside but super cool on the inside. They have a decent beer list bu","useful":0,"cool":0},"_Qsn8rIsAZn-6IjcSuoiqA":{"text":"We came here twice during our stay in New Orleans. The first time we came here we had a fe","useful":0,"cool":0},"3z_FeyL_SOv9Dr8wF0K_dw":{"text":"Great bartenders who make delicious drinks with fresh ingredients.  Friendly patrons. Low ","useful":0,"cool":0},"rRbRnrOLJuz9rBxHoDxQrA":{"text":"The perfect dichotomy...a bar that looks like a comfortable dive but serves brilliant, exq","useful":1,"cool":0},"nliXhkKAoHcA8i-2lpofcw":{"text":"Bartender was rude about making the drink we wanted, which was on the menu. He said it wou","useful":0,"cool":0},"HrwvCXr03ISBpto3tizJmA":{"text":"This has been my favorite drink spot for about a year now.  I liked it way better when the","useful":1,"cool":0},"byCA-WSPs6ZPUhErDkxwAw":{"text":"Terrible bar!  Don't go to this place if you are a tourist.  There is a barn employee who ","useful":1,"cool":0},"eQ6bnlSefmH3dMc5BKYDJg":{"text":"Unassuming and low-key place to visit that is away from the hot mess that is Bourbon Stree","useful":0,"cool":0},"pSxnhcuOMRkD4LfsbA12FQ":{"text":"Love. This. Bar. \n\nFirst time we ventured out to Bar Tonique we were on a mission to try n","useful":3,"cool":2},"MumYQK5Qv9m5STzAQR9W4Q":{"text":"Great place, can't wait to go back to NO for a Dark and Stormy.  Very nicely made drinks, ","useful":1,"cool":0},"vVigvg08n1Odf6N_03V63Q":{"text":"I came to Tonique (the locals have shortened it!) yesterday afternoon with some out of tow","useful":0,"cool":0},"dtWUt_QOfiK8w3fdLlaSmA":{"text":"I want to give Bar Tonique both two stars and four stars.\n\nArgument for 2: Got there at 9p","useful":1,"cool":2},"XFLwnYAis7x8Tlj2pKB7Ig":{"text":"One of the tastiest Bloody Mary's I have ever had. It tasted like bacon, tomato based liqu","useful":0,"cool":0},"F76vG9OerDT5n0Hsw372MA":{"text":"Please please please come to Chicago.  You can charge 20% more and you'll be mobbed with p","useful":0,"cool":0},"34Mf9dY2kyrmfXFDU1XIMw":{"text":"I heard such great things about this place and my first experience was of utter disappoint","useful":4,"cool":1},"N7rYbL5A0mkzogxSMf0T7A":{"text":"Bar Tonique is my favorite cocktail bars in the city. The prices for the location are grea","useful":5,"cool":4},"_oWsDz_UCAOaY_cpGPi5IQ":{"text":"Nice little place and good bar service.\nTried a classic Pimms cup and Sazerac,\nboth of whi","useful":1,"cool":1},"Wnl8pJDHz_oMnNBPmlrrXQ":{"text":"Great place to wait out a rain storm. Excellent Happy Hour!\n\nA little off the beaten path ","useful":2,"cool":1},"5l72ph2iub4K-2EIwSLIIg":{"text":"Found this bar via yelp and loved it. Its a cozy little bar with an intimate atmosphere on","useful":0,"cool":0},"nGctfd5b79Pi7vzBingutg":{"text":"Colin seemed ok but didn't recommend as well as I would have expected. Avoid. Go anywhere ","useful":1,"cool":0},"kmKHeIpv-MlGas4ylTns-w":{"text":"When thinking of my 2 experiences here words that come to mind are : Pretentious.  Smug.  ","useful":1,"cool":0},"Z-RuujAUKl6tfCB2aFAI7A":{"text":"I've been to Bar Tonique several times for happy hour. It's a small, dark, intimate bar on","useful":2,"cool":2},"pYEAtoLLKgzW2EdKDy30LA":{"text":"What a horrible experience! First of all, I walk into 3 people smoking cigarettes inside t","useful":1,"cool":0},"RTqLtNuM77RrRmKWNRcbvg":{"text":"Great location right at the edge of the French quarter. Amazing selection and great cockta","useful":0,"cool":0},"heft2UWaBW0ZP1hNe0KOkw":{"text":"Great beer, spirit, and cocktails all the way. Very dark and speakeasy like bar on rampart","useful":0,"cool":1},"AGhZveVr1LuhOvLfnd5S2A":{"text":"Best drinks I have ever had! Truly special. Creative, delicious, truly special! Great atmo","useful":0,"cool":0},"vprp-ufkCWYHtNNDCV2AvQ":{"text":"I love this plaaaaaaaaaace!!!!!! Fire a** cocktails yo!\nGet em. Got em. Great!!!!!!!!!","useful":0,"cool":0},"8FCatVkf0nJZmzy92ZhqVA":{"text":"If you like bourbon, go here. If you like fastidiously-mixed drinks that are better than m","useful":0,"cool":0},"KpMRTK5VATTjvwloSUHxyA":{"text":"I have found my favorite drink. Maybe in life, I think! This is not a good thing because t","useful":4,"cool":3},"HlaOVjozJU2uvre5uINISQ":{"text":"10/10 amazing bartenders and drinks. The Ramos gin fizz is worth the wait! Walked in on a ","useful":0,"cool":0},"YFeqPbpiOAWlGRz563uXug":{"text":"Great bar with Pre Prohibition style drinks. All the cocktails are made from fresh ingredi","useful":0,"cool":1},"J0DTcKTnVupZT2jKtXqdvg":{"text":"Great cocktails - its where bartenders go for a drink. A little of path from the quarter b","useful":2,"cool":1},"3lfkW-ajwCvtOxgtRDHpvQ":{"text":"Small bar with quality service, although not fast. The barkeeps know what they are doing a","useful":1,"cool":0},"zKH50wt8Oy1SxzLyoYRg5A":{"text":"fantastic bartender (brendan), great happy hour, and wonderful music! highly recommend! th","useful":0,"cool":0},"PhmR1YQJRfFCiye7beotAQ":{"text":"Such a unique experience! Getting to watch the bartender create our drinks was awesome. I ","useful":1,"cool":1},"-3g3UNCiUjY4H2Zez9SftQ":{"text":"\"Cocktails are FANTASTIC. Definitely a must visit. Dark and stormy, corpse reviver, hot ap","useful":0,"cool":0},"3dYBawgkrBF0d53UouoYXg":{"text":"Definitely one of my favorite places to go to get a well crafted cocktail. I haven't had a","useful":3,"cool":1},"8dCgxiZP6JlP6nO1dShCTg":{"text":"Recommended to us by someone working at the cemetery tours, we headed here for a midday dr","useful":0,"cool":0},"bNlydRgMz_Nuz2PlPHz7Qw":{"text":"Ok this place probably has 4 or 5 star mixed drinks if you get a bartender that knows what","useful":2,"cool":2},"X-KSR8afCNStUb7i9CLAgA":{"text":"Jessie knows how to make everything under the sun. Drinks are beautiful AND awesome tastin","useful":0,"cool":0},"C7Z7cewHESMEiJiFe-ya6w":{"text":"*Unpopular opinion alert*  Not sure what went wrong here, but my buddy and I stopped in fo","useful":6,"cool":0},"Rjc7Tf3NkKFKmR_vCokpog":{"text":"A little off the beaten path but totally worth it! Intimate, friendly and totally laid bac","useful":1,"cool":0},"dbBuCbP2cEw1yGJk26nuWg":{"text":"You can't go anywhere else for a better drink. My wife and I travel quite a bit and this b","useful":0,"cool":1},"RKP7oBWLZ6bWkiU3cXZJ0w":{"text":"Ummm, total sh*thole. Bartender was hungover so not very talkative. Drinks weren't terribl","useful":1,"cool":0},"nW9Bt08ICvbMMh2kWoIHpA":{"text":"I used to love this place but it has definitely gone down hill. During my last few visits,","useful":0,"cool":0},"eiBlHf7iBrwflB7x_vCfFw":{"text":"I just visited New Orleans for the first time and this was my favorite of all bars.  The S","useful":0,"cool":0},"AAhKGvfjfqePEIPA2P1rsQ":{"text":"Small, eclectic, and a perfect spot for a less chaotic New Orleans afternoon drink. Spirit","useful":0,"cool":0},"JErgY5iPqQpOIBxuYI9y0A":{"text":"I enjoy good mixology, specially when the bartenders enjoy it themselves and treat it like","useful":2,"cool":2},"CuFY8s4ZogZNSFGT1GGDKg":{"text":"I absolutely love this bar, it's extremely laid back, the bartenders are phenomenal (espec","useful":0,"cool":0},"dHIg_JllrwqPQKRK_2qdZQ":{"text":"A really great cocktail bar on the fringes of the French Quarter. They have great prices f","useful":0,"cool":0},"C1ygZqK2mY87KMMBR1hH8Q":{"text":"If you're looking for a carefully crafter cocktail, here's your spot. A bartender's bar, t","useful":0,"cool":1},"rz63ZFqeCK1DWkUclYY0dA":{"text":"All the drinks are delicious, the bartenders know what they are doing. And it's a cool aes","useful":0,"cool":0},"tBHeZXuToDN2lEHDpHKRsw":{"text":"This bar was recommended by a local and let me tell you is great. Red the bartender is gre","useful":0,"cool":0},"h6QUMkKqKDfmcypt1TXgxg":{"text":"OMG.  You must visit this place. Even if you don't like gin you must order the gin fizz.  ","useful":0,"cool":0},"OQdoEPE7DPv2gUgn7Nz7ow":{"text":"One of the best cocktail bars in NOLA. Outside of the tourist trap and very sexy people. V","useful":0,"cool":1},"crweg0X6HlwPzDZUf8wwBg":{"text":"Bar Tonique is amazing. They have a large list of cocktails and every one I've had is deli","useful":1,"cool":0},"HiowUP7ZTeD9WzS6BM0beA":{"text":"Love the atmosphere! All of the staff are really friendly and knowledgeable about their dr","useful":0,"cool":0},"muMBIEJlipV7RoW1YoxKaQ":{"text":"If you want the New Orleans famous Ramos Gin Fizz go to the Roosevelt for history and then","useful":0,"cool":0},"5GaTzfSkxuDneEbzvye_xw":{"text":"I didn't go here for a long time because I assumed it would be too pretentious, but I fina","useful":0,"cool":0},"nnewOK55qw1si0tTGEPnlQ":{"text":"A criminally underrated group of bartenders with an excellent seasonal selection of cockta","useful":0,"cool":0},"C6kd_ZXyPjo55vi6bEs4gw":{"text":"Again, a review for a bar that does not need another, but since I am fairly self centered,","useful":9,"cool":7},"QBZOoWeRhN3NfoRRensxbQ":{"text":"Coldest ice in town. Water may be the wettest too. Bartenders are good looking, but not to","useful":0,"cool":0},"PcJz0-D0oxuaREUza6n7Og":{"text":"This bar is fantastic!  The bartenders treat their craft as an art, and each drink is thei","useful":0,"cool":0},"39HDYWzRBIbuPQSWoGcWTQ":{"text":"Bar Tonique looks like a dive, it smells like a dive, but oh baby, it ain't no dive. Well,","useful":4,"cool":4},"kehVN1VvwzWdZA_g7U8RCA":{"text":"Very inviting atmosphere! The cocktail menu was quite lovely and the drinks were reasonabl","useful":2,"cool":3},"LBus0NUovQTEY9Z73dKnnA":{"text":"My new favorite bar in New Orleans and one of my top overall.\n\nDrinks: 5, Atmosphere: 5, S","useful":0,"cool":0},"G_eCQuMqZGklwRvUIHSK5A":{"text":"Super cool hole-in-the-wall bar on Rampart that has great drink and cocktail specials. We ","useful":1,"cool":0},"66FUHodVRsUZufl59sTRhg":{"text":"So we went here the other night to celebrate the last night of a coworker of mine. This is","useful":2,"cool":0},"E5iF3RS8JXbND5-zUXY31w":{"text":"I visited NOLA and I was so lucky to have found this place. I went three times during my s","useful":0,"cool":0},"LOmCGtElOe4xVXyPJHGKFA":{"text":"This bar was amazing. The bartenders working were like scientists and took a great deal of","useful":0,"cool":0},"Q662ap7ohtrtaWxAX9K2lA":{"text":"Fantastic bar. Laid back, not too touristy at the edge of the FQ. Just a fun place to be, ","useful":1,"cool":0},"mZwbq3rMkrVU0Zboz7CkLQ":{"text":"The cocktails are top-notch. I went on a Sunday night and it was dead. A group of us sat i","useful":0,"cool":0},"XbeAszMlkjEBF960A6lkaQ":{"text":"Best drinks in NOLA.  Went in there late last night and they stayed open an extra hour jus","useful":0,"cool":0},"IXNtSGo-ptJFmMp9kQO2DQ":{"text":"Reason: Relaxed Mixology Bar with incredible drinks. \n\nDrink:   Literally order anything. ","useful":2,"cool":3},"ex0rIu7czPxKcT-EMrx20w":{"text":"This place is unexpectedly awesome. It's dark, small, and not fancily-decorated. You come ","useful":1,"cool":0},"Du21imvkpKGakv7RcHoP-w":{"text":"Went to Bar Tonique a few nights during Memorial weekend, visiting from Houston.  It was g","useful":0,"cool":0},"Xu9AynN50U2tJqvnwlUqsQ":{"text":"First time here today, Brook took great care of us and was quite pleasant to converse with","useful":0,"cool":0},"mujI7DRNVWOgZMjG3CBB-Q":{"text":"Really great cocktails.  No pretense bar.  Casual cool.  Friendly.  Small.","useful":0,"cool":0},"pEz1BSxsVSKWDdIt80hj6g":{"text":"My boyfriend and I got a recommendation to Bar Tonique and decided to check it out. It was","useful":1,"cool":0},"NZeFBqSCm4Cyj24UoTHbjg":{"text":"Good Moscow Mule and Pimm's Cup but overall, not impressed. How does a place named Bar Ton","useful":1,"cool":0},"78dFKhApTIy5gKOD6KpU3g":{"text":"This place is awful. They lost my credit card and were completely unapologetic and could h","useful":0,"cool":0},"em8ytmJbb4fcME_W7qQSGQ":{"text":"Mark the bartender is absolutely phenomenal. Best bar tender down here by far. The atmosph","useful":0,"cool":0},"ooUhggCimWs4jjukHDSPLw":{"text":"The WORST bar experience of my life. The service was awful. The bartender does not listen ","useful":2,"cool":0},"QVmEMyV1wCzv8GLeyqOw2w":{"text":"Literally the best drink I have ever had. And I mean literally in the sense it is supposed","useful":0,"cool":0},"GOkj36j_rJjePx-x9Gx8Fg":{"text":"Bartenders are phenomenal!!! Very friendly know their spirits and cocktails which are deli","useful":0,"cool":0},"t4GxM6bRUHGSpei9TCrmdw":{"text":"A must stop for any cocktail fan. We are here multiple times anytime we are in New Orleans","useful":0,"cool":0},"YZGDBVPDNGGWG_DX6Veolw":{"text":"There are times when you really need a good drink,  times when you can't leave the mixing ","useful":4,"cool":1},"pzvTJsznLiPpEW09ZhkNbg":{"text":"Love this place.  Fantastic cocktails.  Romantic low-light atmosphere.  Bartenders play go","useful":0,"cool":0},"NQASJJzArkdQaXCl6JKOpA":{"text":"One of the bartenders there, Ryan is a talented cocktail magician. \n\nThis confident, compe","useful":0,"cool":0},"_7FPJGzXrTaRoyQPiXnBuQ":{"text":"Love the $5 daily cocktail specials. The bar is very dark with lots of wood, almost on the","useful":0,"cool":0},"GtLBn-TR5t8sBOHvfEF4ZA":{"text":"I can see why this place is a locals favorite.  The drinks are made with expertise, stiff ","useful":0,"cool":0},"jdLK0XMe2zFR2VhL7NXhEg":{"text":"First impression: my! the bartenders are so dramatic in making these fancy schmancy drinks","useful":0,"cool":0},"K4Uvvm_ZwnRZolzYXYCYAw":{"text":"Checked this place out the other night and it literally got jammed pack like preserved ber","useful":2,"cool":2},"dtr7wQRmVJ5EVjascgd-nA":{"text":"I had a rough weekend and I'm just getting into the swing of drinking again but when a fri","useful":0,"cool":0},"c7KSEJ3qhf3Im_MfrXPdVQ":{"text":"Laid back atmosphere and non pretentious. Great character and atmosphere. Good drinks! Enj","useful":0,"cool":0},"mMfWxSSkjgDtkTPmmvjzRw":{"text":"Had many great experiences except for an inexcusable experience the other night. Ive never","useful":4,"cool":0},"wCN3j5_IYnJdx45BPHop5Q":{"text":"The girl bartender with the tats and bar rot was so incredibly rude. I guess we look like ","useful":1,"cool":0},"syiVAxl70Fjaf-P9ezEl0A":{"text":"Bar Tonique was a fantastic combination of dive bar and trendy cocktail bar.  The atmosphe","useful":0,"cool":0},"cGkNw1tJVjOoioX3sbj1tg":{"text":"Place was a bit disappointing, they ran out of tonic water and the drinks were at best \"ab","useful":2,"cool":0},"DDSk0h4v9p3KoHa3JvjD3A":{"text":"Of all the bars I went to whilst in New Orleans, Bar Tonique was hands down my favorite. W","useful":5,"cool":6},"qGqW4MTYBaXCaQrInSiawg":{"text":"This is one of my favorite bars in the city. Bar Tonique is a great spot to hang out when ","useful":1,"cool":0},"3nkDy7_nXK9-tWyDylnvtw":{"text":"Tonique is one of those spots favored by locals and cocktail lovers. There is no big sign ","useful":0,"cool":0},"U9aIp8W7pmoP1fjKFAk7UQ":{"text":"Mint Juliep. This is THE best one I have EVER had. The service is excellent and the atmosp","useful":0,"cool":0},"Uf1UUjdDvTr_3PcNjFzMYQ":{"text":"Birthday cocktails time! \n\nMy intention was to go to Patrick's Bar Vin, my favorite specia","useful":9,"cool":9},"DG-m_hARs9MPcDCcqUsfoQ":{"text":"Had great word of mouth reviews, place is basically a dive bar, barmaid appeared as though","useful":2,"cool":0},"FDzAWQtJDg4KtQXKwLP58w":{"text":"This was a spot that I've been wanting to visit since we booked our trip to New Orleans!  ","useful":0,"cool":1},"qdZCmE4OY5o9yKLODX8e7Q":{"text":"This place has such a great atmosphere.  Great music, cool mixologists and a nice diverse ","useful":0,"cool":0},"AsOloCRO3jqapyXaL3kRRw":{"text":"HOLY FUCKING RUDE BARTENDERS BATMAN!!!! Ordered four drinks, which already took forever on","useful":3,"cool":1},"NJUNCrSsBT2uTo8uldFCng":{"text":"Great drinks and great ambience!","useful":0,"cool":0},"_8CBP5RmavbVqoQKb4S6lw":{"text":"Bar Tonique is easily my favorite bar in the French Quarter. Even though elements of the d","useful":10,"cool":6},"R4I7jkXDXnYqZHH9Y6jzLw":{"text":"Best cocktails this visit. Very friendly bartender. We had Ramos fizz hubby can't stop tal","useful":0,"cool":0},"Wn96EAR0S2YgQSyI6MOt4g":{"text":"Loved Bar Tonique. I live in Portland and it was fab to have some classic cocktails with a","useful":0,"cool":1},"WWYQz1Ji4PYUXEPaGCAK8Q":{"text":"Tonique is one of the best cocktail bars in New Orleans. Every drink is a work of art and ","useful":1,"cool":0},"rVqwDty0yQ--peBjT1iV5Q":{"text":"Just fantastic!  This bar is the perfect mix of dive and cocktail bar.  Located on the nor","useful":2,"cool":0},"Xw7_tQ-3i-xSUUCGMcYJKA":{"text":"Great bartenders, moderate prices, amazing drinks.  Laid back and relaxed, with a great at","useful":1,"cool":1},"opseUbquHVZw-aRrmVinWQ":{"text":"Hands down best bar we went to while in NOLA. Bartender was a pro-and as an added bonus th","useful":1,"cool":1},"Af0sqroppW84edOqmUKfWg":{"text":"I came here wanted to order Ramos Gin Fizz but the bartender already was making like 12 of","useful":0,"cool":0},"Hka_dmmukz9X-c5cwSyZQQ":{"text":"This time I wanted to graduate:  be more mature and less pukey.  \n\nSo, I pulled out my han","useful":8,"cool":3},"Tce1oBDS8hlpaHx2vM5Rcw":{"text":"So, I went in on a Thursday afternoon and not a soul was in except the bartender with -0- ","useful":2,"cool":0},"8HdP4jTTf0tpSmsxzx07Ug":{"text":"I went to this bar in New Orleans for the Ramos Gin Fizz. The drink was worth the visit. V","useful":0,"cool":0},"UF94-1_jOeTG27a0pQQGnQ":{"text":"Reasonably priced classic cocktails, ranging $8-$10 for each cocktail. We got the Last Wor","useful":0,"cool":0},"hvUOW3-ge-TC8ngCpN8Phw":{"text":"Oh no!! Our favorite bar in town has gotten super mean. Not sure what the situation is but","useful":2,"cool":0},"R8pUbRbfW-l49sJ3amzELQ":{"text":"Wow, this place was only round the corner from where we were staying-we were very lucky! W","useful":4,"cool":3},"8a6sGVsPZZE__McmAJzgAw":{"text":"Bar Tonique is the perfect place to spend an evening with friends when you're in need of a","useful":0,"cool":0},"AwcWMp2pExWb8rfL8JFW9Q":{"text":"My favorite cocktail bar in the city. Located a decent way from all the other bar affair o","useful":1,"cool":0},"UJHQXcvbXpe5a-MVDyX36w":{"text":"This place was so hip! There was a crowd of groovy young people flocking about the place w","useful":0,"cool":0},"owhozgWGOZ8FJ4Xl7hkRhQ":{"text":"Visiting from Chicago and my husband and I were really impressed with the quality cocktail","useful":1,"cool":1},"lzwvJ8IEVWEhvQ3FFWsKew":{"text":"I read the Yelp reviews and put this place on my to-visit list while in New Orleans.  The ","useful":4,"cool":0},"NfCVfijb71v4qwShy1O7OQ":{"text":"Best Craft Cocktail in New Orleans! Forget the sugar overloaded drinks on Bourbon Street. ","useful":0,"cool":0},"qHebYX8F3Yx6CeyLZ6puUQ":{"text":"I am disappointed in this place. \n\nI literally ordered a drink off the cocktail list to be","useful":2,"cool":0},"EmanFNK8zVrZd7jdt5NWYQ":{"text":"Small cozy bar with a lot of specialty drinks. Nice and quiet nothing too special but just","useful":0,"cool":0},"lpk5yLy9kDBkCaZk0PBTbQ":{"text":"Your bartender is so rude. My friends and I were excited because we heard good things abou","useful":4,"cool":0},"Y1DtzOVQUQaESuGGvhVTWg":{"text":"The most rude bartender on Pride weekend. We come down every year and go to Bar Tonique fo","useful":2,"cool":0},"o_M2PvT99jxPQiYOPqdqWg":{"text":"After drinking for 2 hours here, we were told by the bartender \"You are being too loud...\"","useful":2,"cool":0},"PKQV_Mc4spKWs67xD5ds4Q":{"text":"Ashley the bartender was amazing. She was very knowledgeable of her alcohol and new what d","useful":0,"cool":0},"WLIKMLMdf6ngp91fe0WLMQ":{"text":"This is probably one of my husbands favorite bars in New Orleans. The vibe is kind of diff","useful":3,"cool":2},"djGvS6lKVYSvTOuVYIPOyQ":{"text":"When you need a break from the madness of Bourbon Street, Bar Tonique is a nice little oas","useful":3,"cool":1},"IXjyxmbSMgfoeWoS62HcVw":{"text":"I cant remember the last time I walked away from a cocktail and left it on the table...I h","useful":2,"cool":0},"1IAjVxlK4xlljfvyQFOCmw":{"text":"Deal!  Tonique is a unique combination of dive bar with highly skilled bartenders.  Their ","useful":1,"cool":1},"9qw8A1zjGucrgf4bhAqssg":{"text":"I want to love this place. My boyfriend and I have come here every year for 4 years.  Grea","useful":9,"cool":1},"NBLqpDrbgiN157moe48osw":{"text":"Rude and unhelpful bartender!! On August 27 I arrived to meet co-workers for an after work","useful":2,"cool":0},"BtyOW4_Us_wEVs0zjTgGWw":{"text":"great thing about this place is their $5 drink of the day!  the bacon bloody mary is a sat","useful":3,"cool":3},"fLqE1kGv_B2FtLDXkoxYNg":{"text":"One of my favorite places to have drinks in New Orleans.  They offer fantastic cocktails (","useful":0,"cool":1},"jW1JaI0YtIbs5sWyztnRkg":{"text":"We came in yesterday afternoon after walking over from the Gumbo festival in the afternoon","useful":0,"cool":0},"HUKnN0pyUmwVpMxhiObQLg":{"text":"Original soda, raspebbery, pineapple and ginger beer in a dark bar quite cool and well loc","useful":0,"cool":0},"aQKrUdmaluVRUmCUv12wOQ":{"text":"Very good drinks. Very rude customers. Asked someone to slide down a seat so my friends an","useful":0,"cool":0},"AjIOE8Hzv06FuiepS_dwiQ":{"text":"I've actually been to Bar Tonique in several occasions. It's always such a great experienc","useful":1,"cool":0},"rbwtkjm5YEEfhlzJW6ZrJA":{"text":"Wandered in, love the cool drink menu. Some good old classics.\nCool little bar..... really","useful":2,"cool":0},"-2TwKCsU3XV_JSLIVdgM8g":{"text":"Can we just first start this review with Ashli is the best bartender you could ask for, fr","useful":0,"cool":0},"q4WUzZnjGpCO3JDpyTe6eQ":{"text":"I stopped in tonight to grab a shot before my late night shenanigans and was very disappoi","useful":4,"cool":1},"j4nwMsbTBFghazU2oJ5zIQ":{"text":"I had been waiting to try this bar for a while and it definitely lived up to my expectatio","useful":1,"cool":1},"HbRz8vOEWwx5xf0gH2XVRQ":{"text":"A short and sweet review.  I normally don't leave review for bars, but thought I would thi","useful":0,"cool":1},"SwmZiOGLsDxPwdUYMlctVw":{"text":"Nice small intimate bar. Was known for daily happy hour. I'm glad to see them finally reop","useful":1,"cool":0},"DcxoTPGljZeRyYrKr2wUOA":{"text":"Cool atmosphere but small with limited seating. \nThe cocktail list is impressive, this is ","useful":1,"cool":0},"7imdxHGqLqyYz6pzs1sKZQ":{"text":"Good drinks, but the bartender drove us out of the bar for \"only\" tipping 27%. Which is to","useful":2,"cool":0},"J7k0tI6IwekkogxDPt3KWg":{"text":"Hands down favorite bar in New Orleans. I was introduced to this bar by a friend and I've ","useful":0,"cool":1},"IDYUI4wMTHjKJqUtHnTOQw":{"text":"Cathy went above and beyond during a very busy shift ALONE to craft the greatest Gin Fizz ","useful":0,"cool":1},"7GjHglTgFzy1pxcJiV24pQ":{"text":"We travel to New Orleans several times a year. I am always in the hunt for the best Ramos ","useful":0,"cool":0},"2vg9j2NKhJsazXg1N3KXeQ":{"text":"Reasonably priced cocktails in a pretty chill setting.  Since it's away from the scene in ","useful":0,"cool":0},"Cy-HMdocXaq8QyvjLE9U_w":{"text":"\"fernando\" was so rude. if he is on shift avoid this place at all costs. considering so ma","useful":0,"cool":0},"6Cze0SHoF0R21dgy2Mk5Fg":{"text":"Look folks, this place makes a damn fine cocktail, finner than damn. And their alcohol lis","useful":2,"cool":0},"bPZFWucAB8OGKFhcY6Z0hQ":{"text":"In the 10 months since my last review for Bar Tonique I've:\n\n-been here more times than my","useful":15,"cool":10},"UBn2uz7zxCRvFDouhfWjeQ":{"text":"Nobody wants a grumpy bartender! Being curt and indifferent made us feel very unwelcome an","useful":2,"cool":0},"iXX3P9M8LTcs_-xCMBiSFw":{"text":"I'm a New Orleans native. I've come here occasionally since it opened. I very rarely leave","useful":2,"cool":0},"UDyuzwM3VS3DyHc42g39GA":{"text":"This bar is a hole in a wall with very very limited seating! But they do have a solid happ","useful":1,"cool":0},"RK0d0nPUI10hoN1IgWRBRA":{"text":"Review #2600! \n\nWe were in the French Quarter walking around when a local told us about hi","useful":6,"cool":7},"UB02T3ss-yYUaa4nHaz1LQ":{"text":"This USED to be one of my fave spots for cocktails... no longer.  In the past year or more","useful":3,"cool":2},"4UAceqbzXLS6apkZ0sfbLA":{"text":"Cash me at dis neighborhood bar. How bow dah? \n*****\nYeah, baby. Blocks beyond the French ","useful":8,"cool":8},"QpdSsM4BdIdCgNz_ZECzBg":{"text":"Superb cocktails. Eclectic crowd. Great vibes. The bartender is talented -- tell him what ","useful":0,"cool":0},"zsEDCgd0FO2Tq3cRM2g_Qg":{"text":"I love cocktails and cocktail bars and came here just for the Ramos gin fizz for my birthd","useful":2,"cool":0},"EVXh-_kHPcV5Y2gXqGrfoQ":{"text":"While this bar may not look like much from the outside (and indeed may not look like much ","useful":5,"cool":4},"zAsuh3KCgtfJYPO33SM51g":{"text":"I have to first say that I love this place. Or used to.  I love the drinks and how differe","useful":6,"cool":0},"5GRNHgt_9Zf7-dwBj26s2g":{"text":"What a fabulous find! The bartender mixed excellent cocktails based on our typical drinkin","useful":0,"cool":0},"mfmX4IHgKXll5mCcSGs1JQ":{"text":"WARNING TOURIST & ANYONE DOING A HAUNTED BAR TOUR: my friends and I were visiting from out","useful":0,"cool":0},"BmFFmPCauiX1tYlgMzgQtQ":{"text":"Tonique is definitely a small, classy dive bar. I cannot think of any other way to describ","useful":9,"cool":6},"HPhObyeMrJemp3Gp5PvFMA":{"text":"Love. This. Bar. Their drink menu is extensive and creative. The bartenders are always rea","useful":5,"cool":3},"KbFL9V0d-PtmAa5Sl4tOiA":{"text":"Craft cocktails, nicely prepared.  Knowledgeable, detail-oriented bartenders. Good vibe, s","useful":1,"cool":1},"MQSZb8fnGCf621iRo3nGjQ":{"text":"The drinks are fabulous.  The location is great (on the \"fringe\" of the French Quarter).  ","useful":2,"cool":2},"39RkacOzXkyempE39_8AZA":{"text":"LOVE this place!  Went a few times last week while in town.  It's on the edge of the FQ fa","useful":1,"cool":1},"J67nvNL_iANtbOjqw8wH-w":{"text":"Though we wandered wet and weary\nThrough the Quarter one grey day\nThough the bar had not y","useful":1,"cool":5},"vYYYTXNYGePV1IDhfLlFLQ":{"text":"I was legitimately floored, nay- taken back, when I saw that this place only has a 4 star ","useful":5,"cool":4},"3CQmChJiKmuzEBTi3pjc9w":{"text":"I tried ordering an Aviation at another bar in the French Quarter, and they said they coul","useful":2,"cool":2},"YPuhAhx4GzWlFDufWnyUpA":{"text":"Sherri the bartender was fantastic, great setting and vibe. We thought we knew what a craf","useful":0,"cool":0},"2IJY42bmfVjtNFsoNEq_wQ":{"text":"My absolute favorite bar in New Orleans\n\nThe bartenders are like artists making delicious ","useful":2,"cool":0},"vSVvHHZQsL63eN9Uujc7FQ":{"text":"Great drinks for a decent price and a great atmosphere! I went here on a Friday night with","useful":1,"cool":1},"ThI5v_V0UM6D1kRb_zPqEg":{"text":"Fantastic atmosphere. As I was exploring the city, I stopped in for a drink here. I got my","useful":2,"cool":0},"cBgYJbndT-K4c_KJkDdYgQ":{"text":"Atmosphere. Drink menu! Music selection!! This bar is just what you need if you're in the ","useful":1,"cool":0},"Ld0M-AoyXR0fOGrAsJ8pRg":{"text":"My absolute favorite bar in New Orleans - and that's saying something in a city with this ","useful":0,"cool":1},"wYx8PEr0vJrXlPPz9XiGpA":{"text":"Sark and intimate cocktail lounge.  Nice list of specialty drinks also the bartenders are ","useful":0,"cool":1},"XBXSNN0Rrx9LtZcoYgTHmA":{"text":"What a shame. As a local, born and raised in New Orleans, I was so embarrassed to take som","useful":0,"cool":0},"BTYMAofW83UnTLvBzR1whg":{"text":"We loved craft cocktails and found this place via Yelp. It's located in a really old build","useful":5,"cool":7},"FKEW_Dz1NkGNwAhTtBQK4A":{"text":"I absolutely loved my trip to this cocktail bar! Having spent significantly larger amounts","useful":1,"cool":2}}