{"QuxY8q75e94c_z4AbICfyA":{"text":"What a great little place. We were in town for the marathon and needed a place to carbo-lo","useful":0,"cool":0},"lxom_cCOKZHJSsgo4QeUHQ":{"text":"The restaurant is well presented and cozy. Our server, Aurora, was informative and sweet. ","useful":0,"cool":0},"DISt6wC0VgoeMZj-PtEl_Q":{"text":"Great authentic Italian food.  Super fresh ingredients and nice simple dishes.  We had the","useful":0,"cool":0},"qVp3JTpqFbeakaHMpr-mlw":{"text":"I had heard about this place for months and had wanted to check it out. The owner FedEx's ","useful":1,"cool":0},"5063Ui_7dsyk_Qisb4CcyA":{"text":"My 2 favorite dishes are the Truffle ravioli and the pumpkin ravioli.  This place is bumpi","useful":0,"cool":0},"LG-uHaoUHoZpS34P-G5hdA":{"text":"Probably one of the best meals I've had while in New Orleans. My son and I split the filet","useful":0,"cool":0},"RzzXOrRW9DRQ2wpI4NyRcQ":{"text":"Great service, friendly staff, nice ambiance. Food a bit bland nothing, wow worthy. I was ","useful":0,"cool":0},"GOnSysAWC_JVdyaytxkFTw":{"text":"Good food - though we only got the excellent bruschetta served in the nearly two hours tha","useful":3,"cool":0},"eBz44n2iJDLPUXnHHKHPtQ":{"text":"The mushroom ravioli was delicious! Very nice ambiance. Check out the strange king throne ","useful":0,"cool":0},"zRZPuzhRbNMPUyQX7C72og":{"text":"I hate writing these kind of reviews, because I do not want to come off as a jerk, but I r","useful":10,"cool":3},"DrlFl9Dg7mq9X5OMBaVDzw":{"text":"What a find!    I was very hesitant to try Italian food in NOLA.  We started with a meat &","useful":1,"cool":1},"7CQY4yooM-iCOx1-7ifyNQ":{"text":"Like Italian?  True Italian experience!  You will love this one.  Just two of us. We split","useful":0,"cool":0},"LaY78J8cdSxwZn0KTXLv_g":{"text":"Good food- had the crabmeat pasta- but the service is lousy, at least during the day.  Get","useful":0,"cool":0},"_G0uJ7dALuioKPxYxdKWiA":{"text":"Holy S**t!  We LOVED this place.  We each ordered an entree and every single one was delic","useful":3,"cool":1},"WHPUsJmEHX5L9BunmVj67g":{"text":"Cute, little Italian restaurant in a sea of Cajun cookeries. We had dinner on a Saturday e","useful":0,"cool":0},"yV2qTnFBPpsOIix7si54oQ":{"text":"We hunted for an Italian restaurant and found this one.  With all of the great reviews, we","useful":0,"cool":0},"0bWg9R5Ca-DAGQgSzHUx8w":{"text":"I'm pretty amazed. I had never heard of this place when a friend suggested that we get din","useful":6,"cool":3},"lv5Q2dgfwPm3AP8eEX_p0g":{"text":"We recently had dinner here and thought the food (jumbo lump crabmeat salad and pappardell","useful":2,"cool":1},"Lu-ZOtFveggV9FeDW2QsmQ":{"text":"We probably wont want to visit here again. The food is okay and overpriced. The seasoning ","useful":0,"cool":0},"CX0Ms8-rRCFZuLXPd8Yrig":{"text":"For a night of authentic Italian dining this is your place. Although the tables are a litt","useful":0,"cool":0},"5AeLD7Epg3oh6SsWVFbO3Q":{"text":"Absolutely delicious with great service.  The food is very fresh and flown in from Europe ","useful":0,"cool":0},"Npx--8KlFfckquxRvcKraQ":{"text":"Excellent experience all around.  We had no idea where we were going to eat and stumbled o","useful":0,"cool":0},"rMs1x_J70SPInvZYx1NJyg":{"text":"My boyfriend and I had a delicious meal here over the weekend while visiting New Orleans. ","useful":0,"cool":0},"mvPoe2Ex2ELwnF7LF7Qg6A":{"text":"The food was amazing but the service is even better! Leann our server was incredible and I","useful":2,"cool":2},"PCwVJJM_X6nWDiVkGG-Ihg":{"text":"This was the second time we have eaten at the Italian Barrel. We found it on yelp and the ","useful":0,"cool":0},"kdLl-eCOF2iCa8pKxEReAQ":{"text":"Can't believe I have never been to this restaurant. It was fantastic! The cantaloupe wrapp","useful":0,"cool":0},"MObKO6vtKnbaVsfrfGRKhw":{"text":"Was here on Sunday for dinner... The food is very expensive and ordinary taste...\nThe penn","useful":0,"cool":0},"2vI2j721Ba94xJ9DCA03_Q":{"text":"Ohhhh boy. I hate to write this but we were so disappointed with this restaurant. I decide","useful":0,"cool":0},"_ofE8IzWbgyRg_1zymwnig":{"text":"My husband and I had an incredible dinner here.  The owner is from Verona in Northern Ital","useful":0,"cool":0},"d46WgX8PNul7n4AbVyAJPw":{"text":"Great and Cozy little restaurant. Took my girlfriend here on a date and it absolutely has ","useful":0,"cool":0},"x9kBM8oWDYt2ycfuaf8Xdg":{"text":"We went there this evening for an early dinner. I had the mixed green salad with blueberry","useful":1,"cool":1},"KYcCYS8WmcIwwT1yu1-dPQ":{"text":"Great quaint little restaurant with outdoor seating.  They recently did an expansion which","useful":0,"cool":0},"90zowCi4cAgsqrtDwv2obQ":{"text":"My boyfriend and I had been in New Orleans for 9 days and were ready for something differe","useful":1,"cool":0},"mXM439YWJ2TXwbiAOc4Q9w":{"text":"It was a very tiny restaurant by the corner of a place where the scenery was not very impr","useful":2,"cool":0},"UxMptUuNvy4R4NrizywPsg":{"text":"Must try the imported burrata! Its fantastic. The Chicken Parm was delish as well. Great d","useful":0,"cool":0},"zdxN1gFeOnx6Cguyq-WlUg":{"text":"Went here excited for some good Italian food and was sadly disappointed. Ordered the gnocc","useful":1,"cool":0},"gzBS0iY5DfMkFLTg0_kVpw":{"text":"We wanted to have dinner at a place that was not Bourbon Street \"crazy\" and that accommoda","useful":0,"cool":0},"6ealSr--DxEfRQbdUg-qRQ":{"text":"I have been to the Italian Barrel twice and both times I had waitresses that was personabl","useful":0,"cool":0},"meZmgaA9hHwpEk8TP99UeQ":{"text":"The food was very good, however they came out in small portions and was very over priced f","useful":0,"cool":0},"7xLA7P0nRBsKtOccQm6AgA":{"text":"My husband and I were given a gift  certificate to eat here last Christmas and Wow! It is ","useful":0,"cool":0},"4PzQJ9sr6brqGsqmiM_xGA":{"text":"Don't bother... made a reservation there and when we arrived we had a long wait and when w","useful":2,"cool":0},"9nmuoLddf2u3bPPVoXZh4w":{"text":"Finally made it to the Italian Barrel for lunch. I truly enjoyed everything that Nikki rec","useful":1,"cool":1},"xFPZKRMmt2yoQUZ8CcsZdQ":{"text":"This is a really cute little place. Definitely make a reservation, especially I'd it is a ","useful":1,"cool":1},"6vF-XT0vJiPUVAFQMV1-1Q":{"text":"Food was great and service was excellent! This is my first time to New Orleans from Chicag","useful":0,"cool":0},"79pY9nSIpaeHXvqQpVPGMw":{"text":"This place is highly overpriced and highly overrated. The food had no flavor and for the p","useful":0,"cool":0},"w9Bli1lDPoRS6hDrEyDjYw":{"text":"Nice ambiance.  Small bar with about 10 stools, but works well as an alternative to waitin","useful":0,"cool":0},"K_SXJi3hsMI1TJ7ocNzhPg":{"text":"Great food, staff and ambiance. Location convenient to shop. Don't pass this restaurant up","useful":0,"cool":0},"qRgu8qvoqI-lPypyYk7Vrw":{"text":"Good food, Weird waitress experience... After expending $250 for just two people, we could","useful":0,"cool":0},"Q_wZox-jt3wcvZ15rJjtWw":{"text":"LeeAnne was very friendly and attentive... Great salad of the day along with pasta... Also","useful":0,"cool":0},"KV8_GCtjd9umwzjzz7PFfQ":{"text":"Small place with some class along with Italian inspired deco and a nice Italian wine list.","useful":0,"cool":0},"YynR5oapb8ld5pg2M9Am0Q":{"text":"One of the best meals I had in Nola, came in with my lady on a night when I should of made","useful":0,"cool":0},"hJtFa6R8uafaiUIAPVwm_w":{"text":"This place has promise, but the wait staff needs some lessons in customer service.  We wer","useful":1,"cool":0},"jTe6gFhFYHHSl4L_LTVjbg":{"text":"Great Italian food! It's small ( 7 tables)...so a possible wait is understandable, even wi","useful":0,"cool":0},"iePDzui7nCFPXvWsJjYoIg":{"text":"If you love and know italian food then this is the place.  I could have just eaten the cla","useful":0,"cool":0},"WK8R9d6juSFnloEspC09hQ":{"text":"Had dinner here with my wife, it was absolutely outstanding.  Wonderful small independent ","useful":0,"cool":0},"KXk4FqSFNyKX0aLeh4rDog":{"text":"I enjoyed one of the best meals of my life here last night.  The restaurant was lovely, me","useful":1,"cool":1},"QJIAA9zraKG9Mh9g6DtV3w":{"text":"This restaurant is truly amazing. Tonight I had the veal chop topped with arugula with a 4","useful":0,"cool":0},"biCrg7Hi-sGuIDRWjZ8xdA":{"text":"We are brooklynite foodies who have eaten and danced our way through many new orleans jazz","useful":0,"cool":0},"E79LZ6Oco-z7o3DKzxjCdQ":{"text":"I eaten here many times over the past years and love the food.  Italian cuisine chef/propr","useful":0,"cool":0},"hzm3MRi-p57_Nb61G07UVQ":{"text":"Rude waitress. Wish I could fix the tip line to zero. She didn't deserve a dime for coming","useful":1,"cool":0},"63corF2L0748EplWiA82PQ":{"text":"I was here for a late night Italian dinner during my week long stay in New Orleans. I have","useful":0,"cool":0},"IAc50aUH2XEfmJpMGFOYQg":{"text":"Came back, with a huge group of friends for a birthday. The birthday girl really loves Ita","useful":3,"cool":3},"CBgKnn_WrRR3y89aT7iKew":{"text":"Having never been here before, my fiance decided that this was the place to take me to pro","useful":0,"cool":0},"2vtqtyonIOwXJE8UjBVLhQ":{"text":"I have to downgrade this place for bitter tasting olive oil dipping sauce and mass produce","useful":2,"cool":0},"UXkU1HJyBbFrrwvQVO6Jyw":{"text":"Good wine. Subpar food for the prices. In my opinion,  not worth the quality of food. Well","useful":0,"cool":0},"ET5andHGsMuUpvpCt93QUQ":{"text":"With all of the places to eat in New Orleans I am going here two nights in a row.  Absolut","useful":0,"cool":0},"xG5s078YGW016tZD_k8K-A":{"text":"We walked in at about 8:45 without a reservation. The host duo was obviously stressed sinc","useful":0,"cool":0},"EIT3CBCPY2VdGvad8mlOiw":{"text":"It was dinner for one.  I was given a lovely table near the sidewalk window.\nThe lemon pic","useful":0,"cool":0},"nqcMInboNSgIuQTwvnLoiw":{"text":"I called Italian Barrel the day before needing a reservation and they were so accommodatin","useful":3,"cool":2},"RsVMN7hvdOXK1aQBOocBNQ":{"text":"Excellent food & a wonderfully intimate atmosphere. NOLA is known for great cuisine, and d","useful":0,"cool":0},"tiAYhibfaBp7R5GCJT6lNQ":{"text":"This is indeed a quaint little restaurant.  Service is slow, but our 2 servers (the one as","useful":1,"cool":0},"pHQZZP_kK4QEyJdFe6xtfw":{"text":"Food:  Memorable considering I also recently had dinner at Lincoln Ristorante in Lincoln C","useful":0,"cool":0},"PsKKlFUR3zfjsKaLa-WdEQ":{"text":"Just a delight. We stopped here for a very late lunch around 4pm. The decor is upscale cas","useful":1,"cool":1},"izxICckQB1MgTpvh21HxTw":{"text":"Everything we had was tasty.   Lasgane was fabulous. The chefs special pasta was incredibl","useful":0,"cool":0},"64nsiW_4bO5HAtfTBXzndg":{"text":"My husband and I always eat at the Italian Barrel when we're in town, generally several ti","useful":0,"cool":0},"ktRBAUXXYr-tRHBVswjpMQ":{"text":"Excellent food and Chris did a wonderful job servicing our table. The atmosphere was wonde","useful":0,"cool":0},"yo3Ui8WvBP7qMBSMt-5NFg":{"text":"We liked this place, but found it to be a little cramped. The food was good, but not the b","useful":0,"cool":0},"BzLrigTZsLXr3V1xSBkw8Q":{"text":"Okay. The food was good BUT service and experience was abysmal tonight: We brought our fri","useful":0,"cool":0},"IUYtcGhX4R5K8H28Dqmf_Q":{"text":"Best sit down dinner I had in NOLA.\nJust yelped Italian and found the Italian Barrel.\nThey","useful":0,"cool":0},"Q7oS0hiUuhEKXKKIDXYjSg":{"text":"The second best veal chop that I ever had was here. Their truffle ravioli is probably the ","useful":0,"cool":0},"aDtf_H32DyRam0xeXAxvng":{"text":"We didn't have a reservation so they made us wait an hour even though there were empty tab","useful":0,"cool":0},"PKq9k1Z_9ntScAPfkZjiNw":{"text":"I love this place, and usually go every time I am in NOLA.  RESERVATIONS STRONGLY RECOMMEN","useful":0,"cool":0},"2CicewcPWRYoHehRde20zg":{"text":"We were recommended The Italian Barrel by the bartender at our hotel as we asked for a gre","useful":2,"cool":0},"rAxT6JXHQiAxVcSa6pioQQ":{"text":"Had our anniversary dinner there last Monday night.  Unbelievable!  Great staff and ambien","useful":0,"cool":0},"ZHwxTSYOmei6iesvCFmDVg":{"text":"New Orleans is full of great food, but also in a time full of imposters and corner cutting","useful":0,"cool":0},"R4cIFcgNtL1HkmhhXIgTXQ":{"text":"Service was poor.\n\nCharged us for the wrong bottle of wine. They always overbook so be pre","useful":1,"cool":0},"unfWG6ynFOgjQ2mgjgJLPg":{"text":"I've been here a few times, but one experience stands out -  Christmas Eve. I waited too l","useful":1,"cool":1},"ao2rNJTRSCt1y3yQSLV0DA":{"text":"Delicious-- everything from the salads-main course and to finish it off the dessert- Choco","useful":0,"cool":0},"3i_nm_BDmXm9EJKXYLrWfA":{"text":"Chose this place after wanting to try the best Italian the city had to offer. When we arri","useful":0,"cool":0},"IMxE8SpRgXVBHF8_QLi2hg":{"text":"This was my best meal in the French Quarter. It's a very small and cramped restaurant and ","useful":0,"cool":0},"PZqpd1iMuqp9Z7SltHWo9g":{"text":"I truly enjoyed my dining experience here while visiting NOLA. The restaurant is super qua","useful":2,"cool":2},"Z7CrS3wMOldwhjHZi5p0Iw":{"text":"the finest meat and cheese board in the city. just all around great food and wine.","useful":0,"cool":0},"iHRkWpqM2DCcZGjpN4utWw":{"text":"Every time we come to New Orleans, we go to the Italian Barrel. It is delicious! My husban","useful":0,"cool":1},"XgNZRkuBy1UkUkETlUBREQ":{"text":"If you are looking for a break in traditional New Orleans cuisine, you have to make a stop","useful":3,"cool":3},"Vrg1AM30L1P1gXk-UGW_6g":{"text":"Wonderful meal. We were a party of four and all ordered something different.  Everyone was","useful":0,"cool":0},"ap5FFNhrXMDbKCIHbK4TEA":{"text":"Years ago this was an adorable little place with exceptional food and wine. It is much lar","useful":0,"cool":0},"9SN_SjE8cS73rx_7C7aF8Q":{"text":"Ok, we have been going to Italian Barrel since they had only 6 tables in the whole restaur","useful":1,"cool":0},"w0YpHSLIfcwug7XGLhk0_g":{"text":"Had dinner last week.  We had a reservation so no wait.  Service was fine.  Food was very ","useful":0,"cool":0},"_ApGM1lNUtxpctu3bOwBOQ":{"text":"OMG! We walked 20 minutes and crossed the Mardi Gras parade (TWICE!!!) to find this place ","useful":0,"cool":0},"1-p8cZ3QEv9gaLlBeFhNjA":{"text":"Checked this place out because irene's was closed on Sunday's. We didn't make reservations","useful":1,"cool":0},"ehSfNWbyH72VlWkfCSOPYg":{"text":"Sweet spot, especially on a nice day when you can dine outside and people watch. Our serve","useful":0,"cool":0},"EM-WSK4sWl401tsiziLLHA":{"text":"Visiting NOLA from Chicago, the atmosphere and service were amazing. Everyone was attentiv","useful":0,"cool":0},"FWH32ikcQ0bH79snHk8OAw":{"text":"This was probably the most amazing meal I have ever eaten. You should not tell your friend","useful":1,"cool":0},"5H7oa1MUnzNwYEvYXKOdgA":{"text":"Don't let the name or the silly icon on the logo fool you into thinking this isn't a serio","useful":1,"cool":0},"e_bDG0pY_XjFlg4qQtYGaA":{"text":"Perhaps the best Italian meal I have ever had. Everything was superb from the pasta with t","useful":1,"cool":0},"tTO3U7J8MJGiJekcs51wDg":{"text":"The pasta was freshly made, and the tomato salad would feed a village.  The shrimp was the","useful":0,"cool":0},"n1Xv4k-uJdOiq4avPcKD7w":{"text":"This is one spot I always go to when visiting New Orleans. The atmosphere is quaint and co","useful":0,"cool":1},"iLpcuk5oOZ_JOyBrRKiinQ":{"text":"Maybe this isn't a fair review since I got it from Uber eats. Food showed up hot. But thou","useful":0,"cool":0},"wIqeVcEgyUjyi0S3_xKD9Q":{"text":"Fantastic meal. Favorite one was lump crabmeat salad and the dish that has their homemade ","useful":0,"cool":0},"YB69KGZqXCyI0ijN-0xHcg":{"text":"After going to a highly reviewed steakhouse the night before and finding it mediocre at be","useful":0,"cool":0},"Jje2VkzlrFZ4Id8ZK7oGdg":{"text":"Excellent Italian!! (Traditional and not American recipe at all). Pasta sauce was very goo","useful":0,"cool":0},"Mql02UBsi04rngQL5ZoQDw":{"text":"Such a great place! Nice ambience, service, and food of course. Shout out to Jason aka Chi","useful":0,"cool":0},"vtO1pCq1mA5MOii5Q_xs1Q":{"text":"Staff was friendly, knowledgeable and exceeded expectations.  The food was delicous.  Atmo","useful":0,"cool":0},"QSQNXMznRaFWW7zCnMqkzA":{"text":"Not sure why this place doesn't have higher reviews.  Small romantic place that doesn't re","useful":0,"cool":0},"lolhHV6uexMZ3cyvpw6GWA":{"text":"It was just okay. We were looking for something different after nearly a week of cajun and","useful":0,"cool":0},"t5vNRZ64LOyFf8WGN9hO9w":{"text":"Excellent experience.  When we arrived, they said they were behind on reservations and onl","useful":0,"cool":0},"zMchjqmb3P1PrfEzfVeiiQ":{"text":"This was the best meal that we had here in New Orleans.  When an Italian restaurant makes ","useful":0,"cool":0},"y8vHrH8veIINXywVihx1Nw":{"text":"Went here for Valentine's Day dinner on Friday night.   We made reservations earlier that ","useful":0,"cool":0},"_tICkesRyXan-9OO4JtNFw":{"text":"We did not have reservations and no problem.  Just the right amount of attention from Chri","useful":0,"cool":0},"5DKmWwyCIyzg8fBxyD68kQ":{"text":"This place was absolutely amazing the food was so authentic and fresh. I had lasagna and t","useful":0,"cool":0},"05__WfV5H8Yx6ZSLr_CkbQ":{"text":"We were in Jackson Square and the Gold Dude that stands on the streets in a pose was on a ","useful":2,"cool":0},"xNdmLM_65KcJx1Q-vxHAUw":{"text":"I wish I could give this place 10 stars. My fiancee and I ate here for Valentine's day and","useful":0,"cool":0},"kcY-Yy4o4nl29sWtlR3Piw":{"text":"This restaurant was by far the best place my girlfriend and I experienced while visiting N","useful":3,"cool":1},"8uf0TCki0erWU0UxS3_jNw":{"text":"I am a fairly tough Italian food judge and after ranting about a lack of honest to goodnes","useful":0,"cool":0},"FwvPJxNOzjBDDNQsNlPaQA":{"text":"I loved this meal.  wow\n\nof course we over ordered on the food, and the portions?  yeah  B","useful":2,"cool":0},"YFtrWOehGv0-_Tx0QrZg2w":{"text":"My wife and I strolled down to the Quarter for a date night and thoroughly enjoyed the exp","useful":2,"cool":1},"LimVc4ltQP0b-8GboHIoQw":{"text":"THE best traditional Italian in the city. The service is spot-on and extremely attentive f","useful":0,"cool":0},"tIqwtV36TH2aJJZpYVuwDA":{"text":"I was so excited to locate this Italian Restaurant in the Quarter. Not a typical fast food","useful":1,"cool":0},"oMHBkI8fFmy6Clz3puTwmw":{"text":"Great ambiance, authentic Italian dishes and great friendly staff. Ours was on visa from I","useful":1,"cool":0},"R_vSfiHwq9_d5fjhI-xERg":{"text":"Don't forget to get your reservations if you come on a busy night and it tends to be on th","useful":0,"cool":0},"9WFerPjsBGP86u-6MpIJoQ":{"text":"Delicious Italian food skimpy portions, not famiglia style, poor service (asked for my sal","useful":1,"cool":0},"5JWM-ODeFY7kiX7GyQsbdQ":{"text":"Possibly the worst restaurant experience I've ever had. The service was super slow, starti","useful":2,"cool":0},"0vBP3AuQ5ZnF3ssimybM5Q":{"text":"Delicious Italian food, maybe the best in New Orleans.  Pricey but portion sizes are so la","useful":0,"cool":0},"_t5T3l9w4Wrj6H4jwu3KmA":{"text":"My husband and I chose to eat at The Italian Barrel our last night in NOLA. It was right a","useful":0,"cool":0},"IR056kRjGonGsExjm2Y0Og":{"text":"Everything about our dinner was either irritating, annoying or disappointing.  Our appetiz","useful":0,"cool":0},"sQhbZ1wdH-E73qWLXM1C4g":{"text":"great little and I do mean little spot for pasta.  only a few tables in this little boite.","useful":1,"cool":0},"MwYHHHaloqibx9iRZrIelw":{"text":"Excellent service and food. Chino was a great server! The 14 ounce veal was a real hit!","useful":0,"cool":0},"1eSSQCv0eBVOqPCcXLBh7w":{"text":"Returned there this week. nice to see that the food is still great.  Fresh local and impor","useful":0,"cool":0},"37mNB7fckHiQ9v17P4i_6A":{"text":"Amazing ravioli! I was in town on business and heard Little Italy had some great restauran","useful":0,"cool":0},"LTpEXSU1onYQCCO-OMS_sA":{"text":"The ONLY reason I am giving one star is because the food is all around really good. \n\nShor","useful":3,"cool":0},"YeP-Ah-xchUDglmurx3Bmw":{"text":"Great foods and lovely services . But u should make a reservation before you came, and u s","useful":0,"cool":0},"AZb6scJ6P7LF-_3zTy0jTg":{"text":"The first time we dined at the Barrel back in March was phenomenal. Visited again last nig","useful":0,"cool":0},"AXns8KQjGcHT5tx6ER0BPg":{"text":"On a recent trip to NOLA we were looking for a good Italian restaurant. Our friends are se","useful":3,"cool":0},"85YxkghTs9ZdfUswv6JlEw":{"text":"Holy shit this is place good!  The mussels and brochette appetizers and Gorgonzola gnocchi","useful":0,"cool":0},"ejvFFEABmF6nlXqMe1PASg":{"text":"A friend and I stumbled into this place after wandering down Esplanade. It's a small, char","useful":1,"cool":0},"73XcPaXOSvnoFBQpVF_gJw":{"text":"If you want authentic Italian food and the ambience of feeling like you are dining in a lo","useful":1,"cool":0},"UBFj9bmsBf0W3bUrTfCK_Q":{"text":"Would give it 4.5 or 5 stars\nDesserts fabulous and appetizers great had unsalable with jum","useful":0,"cool":0},"NgwfFaXvyTC4RVULfJGb-A":{"text":"Went here the first night in Nola and judged all other restaurants based on it! Had the se","useful":0,"cool":0},"n93iUR17jlUJZ7aurOoqGQ":{"text":"Great food! Penne alla vodka was amazing and so was the sea bass special. Try the mussels ","useful":0,"cool":0},"ByYktY7Zczh3TkpzICisRA":{"text":"I was here a week ago for my cousins bachelor weekend and this was the first restaurant we","useful":0,"cool":0},"nfZJbiKJDomEVk3-pm56Og":{"text":"Everything about this restaurant was wonderful.  The chef/owner Samantha came out to greet","useful":0,"cool":0},"4XhMbOq7-Uxk-0D_G8JIQw":{"text":"We were looking for a dessert after our appetizer crawl.  The place we picked was closed d","useful":0,"cool":0},"pGeUC09O4qb4VEQzlTCjpQ":{"text":"What a great meal!!  We had the cheese plate for an appetizer and it was one of the best I","useful":0,"cool":0},"U--KNzqNfDnYhdyu8RphYg":{"text":"We were at a loss as to where to dine this evening\n  After much searching  on Yelp we chos","useful":0,"cool":0},"PQknRfU295HdyxirQLGQfg":{"text":"The veal parm was burned and too much sauce was used. The attitude of some of the servers ","useful":3,"cool":0},"8fsrZBpCiMXd6d5KefysrA":{"text":"Great meal. Cosy, atmospheric and warm. \nWelcoming service too. \nWe shared the anchovy fil","useful":0,"cool":0},"SsGSLA-tKRKqpj8wUMICwg":{"text":"This place is tucked away towards the outside of the French quarter but is totally worth t","useful":0,"cool":0},"pMmHg9bVwcTWXQ356Axvgw":{"text":"Benvenuti in Italia!\n\nPicture it: you're walking in the quarter, past bars and lovebirds t","useful":3,"cool":1},"AS9QPAlNmPIDrEP776y2kg":{"text":"I was in a party of three who ate there for the first time last week. I ordered the truffl","useful":0,"cool":0},"e6ecI8FmDg1Wry-O46DYGA":{"text":"A group of four adults went for dinner around the holidays and we had an exceptional dinne","useful":0,"cool":0},"CalTAe4hmKRS0BmHjEUKeA":{"text":"This place was really good. The service was outstanding. We had the cheese and meat platte","useful":3,"cool":0},"YhMk9kIW6A6OMHLDMIwtcg":{"text":"The Italian Barrel is a couple blocks from my house. I honestly feel guilty for not leavin","useful":0,"cool":0},"S68ZX6ogzLw3smdCKNtxvg":{"text":"So amazing! This is the best Italian food in New Orleans. Bruschetta is gigantic with matc","useful":0,"cool":0},"52S_FYdPf_sFOQEabXyy-w":{"text":"This was a wonderful little Italian joint hidden on the edge of the French Quarter! My boy","useful":1,"cool":0},"U3POuLso6d_e4DJSDoXoIA":{"text":"The food was amazing. Me and my friend shared the lasagna and the chicken parmigiana and w","useful":0,"cool":0},"_0-f1T1pmHkEO8ql64aBDw":{"text":"Horrid service.  Our server FORGOT our wine order and 5 minutes into our entree came over ","useful":0,"cool":0},"YAQgaQJZZ7YdS8R9MvbRAg":{"text":"Fantastic cozy place! Service was awesome. Food was soooo good. I got the pumpkin ravioli ","useful":0,"cool":0},"kD-QONMoR_31RQ161Ftk4Q":{"text":"Great little gem! Traveled to New Orleans from Los Angeles to meet family and booked a res","useful":0,"cool":0},"2JxYHMMxL79ef2SfRAP5_A":{"text":"I had the rigaton pasta with gorgonzola, marscapone, and walnuts. It was delicious and was","useful":0,"cool":0},"_DPRCeJcDf_oPHAkJzYvng":{"text":"While I am generally underwhelmed by most restaurants in the French Quarter (how does ever","useful":1,"cool":0},"GoeG6E209-DrW-a1TApveg":{"text":"In a city with so many great food options don't settle for this place.\n\nService was very p","useful":4,"cool":0},"FwZSbx78ZARh0bFmFamF7Q":{"text":"Slow service, wine tasted like it had been out all night , with two glasses of wine and a ","useful":0,"cool":0},"MyL55y_eY1-nkXAo71maZg":{"text":"First time we went, great service, the best bruschetta we've ever had and great pumpkin ra","useful":0,"cool":0},"XR8gG5yS4BGejEi22LZOHA":{"text":"Come hungry roll out happy. The food portions are large as expected and delicious. We were","useful":1,"cool":1},"NC1gTljheEqWQyztmds3jQ":{"text":"This is one of those places that is hard to review. My friends constantly rave about it, y","useful":0,"cool":0},"Rm6cvUithlnyFvCxu0KghQ":{"text":"Intimate setting, if no tables eat at the bar-that works well. Johnathan gave us excellent","useful":0,"cool":0},"Pc_GhYXw1r8x0-Gb-fW48w":{"text":"Excellent Italian classic Italian cuisine. Very nice cozy ambiance and atmosphere. Service","useful":0,"cool":0},"X9BgpJuE5s49shbheZU-dA":{"text":"Happened to walk past this place this afternoon and got a whiff of the basil on someone's ","useful":0,"cool":0},"5AXUA3DWbUNLRl61a7hNGQ":{"text":"The porcini truffle ravioli is the best dish I have ever had. Ever.  Start with a half mea","useful":0,"cool":0},"WJlCgRnnSjICOQ-8cJm67A":{"text":"Years ago I had the pumpkin ravioli here, and to this day I haven't found a better pasta d","useful":1,"cool":0},"eS7sU3plaEHuFwS4spGhgw":{"text":"Maybe the kitchen had a bad night, but the quality of food didn't deserve anything above 2","useful":1,"cool":0},"Mvbtl0FRIQH8sw9ZpPbQhw":{"text":"Coming back here after a few years , Italian Barrel did not disappoint! Great menu, great ","useful":0,"cool":0},"jnwPl-mRO7WaCWth-rRK9w":{"text":"It was raining cats & dogs the afternoon we stumbled in this restaurant. One of our friend","useful":2,"cool":0},"a4wteqhzUnzcbXibIh3KTg":{"text":"The location is nice. The staff is excellent. I ordered chicken Parmesan. It was pretty go","useful":1,"cool":0},"U261AmIcnuLAA0IWnTxXsg":{"text":"Excellent food and service. The penne alla vodka was done with a white sauce rather than t","useful":1,"cool":2},"t4509S74atW0BDjBEnb1hQ":{"text":"This restaurant was so lovely and one of my favorites when we visited NO. We started off w","useful":0,"cool":0},"3_jcLqf8IsLcprQMyCdnmQ":{"text":"Outstanding! As strange as it was to choose Italian food on a trip to New Orleans, I am so","useful":1,"cool":0},"8prNFo8JX2V6e_c5MEBJGw":{"text":"What a little gem!\n\nIt's just like we read on previous posts, the outside looks like a piz","useful":0,"cool":0},"a_Z5J0lFYmLtYFJKbknuvw":{"text":"This was our second time coming to this restaurant. We brought some friends along. The foo","useful":0,"cool":0},"HN9r_HFU6LYuRDNKkamTxw":{"text":"We're here in New Orleans visiting our son who is in the military.  Wanting something diff","useful":0,"cool":0},"t1eR9_6BhlDVFfhqMuxDiQ":{"text":"I like the location and atmosphere of this place.  I like how it seems very authentically ","useful":0,"cool":0},"f9_fwFb-GdtDR31SdgmB1g":{"text":"I had a great time at The Italian Barrel. The food was great.  The host was very nice. We ","useful":0,"cool":0},"XixX_V3A2TJu_ZerlpwT9w":{"text":"From the moment I walked in I was impressed by the smells of scratched cooking and the qua","useful":0,"cool":0},"pDSkTyET_0ImhmvjK_RIyQ":{"text":"After spending the previous night observing the madness that is Bourbon Street, my husband","useful":0,"cool":0},"ACNsymO5onBPvenD9xO1LQ":{"text":"This place is tiny -- in a good way.\n\nWe made reservations and were promptly seated when w","useful":3,"cool":0},"CM5IZg9Hq4EUgnUm0ufVaQ":{"text":"Quaint and gorgeous little place suggested by a friend that lives by there on Esplanade.  ","useful":2,"cool":1},"Jxg4ha1bojuknZWj-i0Lfw":{"text":"This place was absolutely amazing the food was so authentic and fresh. I had lasagna and t","useful":0,"cool":0},"QciDApkL6DtcoakgiHVOlQ":{"text":"A must go!  Don't be fooled by the cheesy sign!  This place is right down the street from ","useful":2,"cool":0},"TZYs85v8v57Di6AVG7XTwg":{"text":"The best Italian food in New Orleans, hands down.\nGet the porcini & truffle ravioli! You w","useful":0,"cool":0},"TrLsBPyVj6MdyhJiIoTs4A":{"text":"As good of an italian restaurant as you can find.  I don't think I've ever had Italian foo","useful":0,"cool":0},"vJIDaI5p4tdhfMCyrVg6Pw":{"text":"Wow!  Went for the wife's birthday weekend first meal, absolutely delicious.  The place is","useful":0,"cool":0},"MvdVMkGiQwbZQ5mMfbLyKA":{"text":"Great location but smaller than I usually liked. Felt more cramped than quaint. Had a rese","useful":0,"cool":0},"VxCHVhEUitWm_kWkmA70ug":{"text":"I had a very quaint and romantic dinner here with my boyfriend. The food and service were ","useful":1,"cool":1},"-bPf6ogJQjH9D1xOEsWDUQ":{"text":"A little spendy but I needed something drastically different than the southern food I had ","useful":3,"cool":0},"wIqoxOq-4HTzIgyKNGSk4A":{"text":"I can't say enough good things about this quaint little place. The food was incredible. We","useful":1,"cool":0},"yqSwcSqi5mFjJ95ltSkzJA":{"text":"I really enjoyed this place. The food was a little bland, but that's  ok because it tasted","useful":0,"cool":0},"QaAwzbMjswRBFmUIi0ITHg":{"text":"Fantastic, fantastic, fantastic ... did I mention it was REALLY good too!!!  We had a wond","useful":0,"cool":0},"RPwmw6QMZIvGZDRscpsKcQ":{"text":"This is wholeheartedly my favorite Italian restaurant in the city! No one else seems to ge","useful":1,"cool":0},"yjU7kVnmHi6P7XXxroNWdQ":{"text":"I remembered this place from three years ago ( before I had yelp) and it is as good now as","useful":1,"cool":0},"WVkOFyMgPEvbhnjPG2_xNg":{"text":"My mom and I had Christmas dinner here.  There was a set 6 course menu with a variety of c","useful":0,"cool":1},"-Op-qi3I9JI0DpzqCsKhjQ":{"text":"My husband and I live in the neighborhood and this is one of those spots that we go to reg","useful":1,"cool":1},"2Mra3bGg4rzLAghSFBWCCQ":{"text":"Went there escaping the Florida Hurricanes in 2017. Found this place randomly. Needless to","useful":0,"cool":0},"DntKOakts_xUKuz951yV6g":{"text":"We walked thru the French Quarter for this resturant? Wouldn't do it again. Service was go","useful":0,"cool":0},"AbvJd-0J5V1v8chm0ETzew":{"text":"This is without question my favorite restaurant in the quarter.  I have eaten here at leas","useful":0,"cool":0},"RFh4XFoqyCfQMLEtL951DQ":{"text":"Love, love, love it!!!  Never a bad meal in the past year!!  Awesome food, friendly staff,","useful":0,"cool":0},"wusvF9aAV1LAMPsTCnxipg":{"text":"BUYER BEWARE: there are thieves active at Italian Barrel. Our creditcard was blatantly sto","useful":1,"cool":0},"Y9njZRC9jyQAIYWTF6RPAA":{"text":"AMAZING FOOD & SERVICE! Ask for Jessie and tell him Miss Michael sent you! The owner IS fr","useful":0,"cool":0},"QdCkQ-E6xNx_1D4UM0Cbtw":{"text":"Really excellent Italian food at the east end of the French Quarter. We go there every tim","useful":0,"cool":0},"IsY5itQeaCtw0F6KDgiM3Q":{"text":"I came back as promised, and I should have left a good memory well enough alone. \nThey exp","useful":2,"cool":1},"s0I6f2gDYMtpPyY0JVUS9g":{"text":"This is my favorite FQ restaurant. The food is fantastic, all ingredients are super high q","useful":0,"cool":0},"2I-M7AosbxVhQXyXkrd5PQ":{"text":"Was a nice place with great staff! Went before catching a show and didn't feel rushed or w","useful":0,"cool":0},"wfcIUiI3d_cAPv9KnPfjnA":{"text":"Was there for dinner. We ate inside.  However, they are few tables outside. I would recomm","useful":1,"cool":0},"E2UlsL_M9h5UBFG0sPRKdw":{"text":"Everyone loved their meal! 6 girls met for lunch and it was a delightful experience! Effic","useful":0,"cool":0},"0l7reLa6tpEHPQdoREQfoA":{"text":"Excellent food, drink and atmosphere! The servers were so friendly and knowledgeable. I ha","useful":1,"cool":0},"iMXWkjX_n5XNnhLfTnpn6Q":{"text":"This is fabulous Italian restaurant in the French Quarter. \n\nThe food is amazing.  I had t","useful":0,"cool":0},"w929G1F7rRnXsxAmro2HRg":{"text":"I came to this little gem on Friday last weekend with three other friends. We were all in ","useful":1,"cool":1},"ApvxU7BNLVpSldlWEt5ERw":{"text":"The Italian Barrel imports their pastas via jet directly from Italy.  The ravioli are all ","useful":1,"cool":1},"T79T6SddQGXEZreVCXOZZA":{"text":"Very small and cramped with tables very close together.  Waited 30 minutes even though we ","useful":0,"cool":0},"4uKKJUdMrAnK3DxZJJqtSA":{"text":"A fabulous restaurant.  The food is great. There is a good selection of wines. The establi","useful":0,"cool":0},"3MrAIej4HFr1RkosATWnZw":{"text":"Amazing italian food!  My brother has raved about this place for a few months now and I've","useful":0,"cool":0},"ZRSprbfjrPQDT8pJS-eafw":{"text":"WE have only had lunch at this restaraunt.  The panninis are HUGE, so we share.  My husban","useful":0,"cool":0},"CzPPr02HqcYeDLYewuHn-A":{"text":"My taxi driver insisted I came here for lunch, it was very quiet being a Sunday morning, t","useful":1,"cool":0},"nPKvSJMh-HTSyDbhYxutZg":{"text":"Great food. Awesome service. Nelson and Michelle were very friendly and helpful. We will b","useful":0,"cool":0},"1QolAfYnR8gOv8fuVS5CSw":{"text":"The Italian barrel is heaven on earth. I am a local New Orleanian and come here frequently","useful":0,"cool":0},"19TKMlYYwErvVlDbaWTLXQ":{"text":"I'm only giving five stars because the average of everything combined was...perfect. They ","useful":0,"cool":0},"oa8a8AQNmPcj9GFeeNZL_Q":{"text":"HORRIBLE-HORRIBLE-HORRIBLE service.  Probably one of the worst experiences of my life.  I ","useful":1,"cool":0},"AXkK8BKPZ8wHeI4xWj0mug":{"text":"One of the best restaurants I've ever been to -- food and service was great.  From the mom","useful":2,"cool":0},"f7FJRHaIE5N7HsVoMYkEoA":{"text":"Expect great food with true Italian service.   The dining room is small, so I would recomm","useful":0,"cool":0},"HWyIhq9WDPGrKhWOP4kpmg":{"text":"I'm sad to say I need to update my review. We had originally an 8 pm reservation, and earl","useful":0,"cool":0},"UuPd6iySCY2KdAp4qlcJdA":{"text":"Food was delicious.  If you are looking for different Italian dishes, check this place out","useful":0,"cool":0},"c7L7-YKuXUVUGvVZ70uHEw":{"text":"A really classy find in the French Quarter. Pumpkin ravioli and penne arrabiatta just supe","useful":0,"cool":0},"UA34RDa5IqN5DxV4E8blkg":{"text":"You must have the seabass (the one with tomatoes)! Just do that and you'll be happy. We go","useful":0,"cool":0},"OPbHDMLjytEbRnK5abbzSQ":{"text":"This review is entirely based on my husband's report as I had food poisoning from another ","useful":2,"cool":0},"wEUwKFdlFQeJffNTWhXCkw":{"text":"This is a lovely, little restaurant at the far end of the French Quarter. I highly suggest","useful":0,"cool":0},"UtovQgqEKR1pp3DzheKmow":{"text":"This is one of my favorite places to eat in the French Quarter. I will admit, I liked it b","useful":0,"cool":0},"y5Iz17GkU2U0HnyNw2bxkQ":{"text":"Pretty good Italian restaurant. There were two waiters serving us and they were very atten","useful":0,"cool":0},"uhWEPAIsFE7GbrkJNsGnvQ":{"text":"Check your bill y'all! We were over charged for our dinner and when we called it out the m","useful":0,"cool":0},"E_mXXE92z6bDj2m-6rKVpw":{"text":"One of the best places for Italian cuisine..!! The staff is very friendly and the food is ","useful":1,"cool":0},"JHyG6TYQbw_8yijZl2aohg":{"text":"In a word, Christmas dinner. It is nothing short of spectacular.  It was a fixed-price men","useful":0,"cool":0},"29LD1XpYnwuQpN47_PjVCQ":{"text":"Service was great! Server was knowledgeable about the food and wine menu and offered sampl","useful":0,"cool":0},"DJ7RJYxpt4Wqdh4vwPGR1Q":{"text":"In our last two visits to New Orleans, we spent more than a week going to nine of the top ","useful":0,"cool":0},"wNWCQ1gCX3hruJPSgjL68w":{"text":"I just celebrated my anniversary at the Italian Barrel and it was lovely.  The food, servi","useful":1,"cool":0},"IfcO4hl7CJUjchhOtlZzeA":{"text":"What great atmosphere - elegant yet airy - and not crowded during late lunch today. Made a","useful":0,"cool":0},"0rg-35AjuN6B3cs175Gynw":{"text":"I know what your thinking.  Italian food in the French Quarter. We were a party of 4 on Ch","useful":0,"cool":0},"wFirlct4GFIa-0qjIZVdQA":{"text":"It is always worth the wait. I have to come here when I am in NO. The food is fresh, creat","useful":0,"cool":0},"pqnV0wLQFU9Uibzd84IpIA":{"text":"we tried this new northern italian place on Barracks & Decatur. sigh.\n\nas far as looks go,","useful":2,"cool":0},"XuEeO_MvqJTy1dJdDJy9AA":{"text":"Chicken Parm (original, I know) was delicious! Served with linguini that was tasty!! The s","useful":0,"cool":0},"R0SpOgNemhHqKo8jEWvY3w":{"text":"Worst  food  and the worst service ever!\nThey treated us so rudely and  we would never go ","useful":0,"cool":0},"MCWB09-skT92SSGHOwXL_w":{"text":"The food is great!  The service is ok.  The meat and cheese tray is outstanding.  The wine","useful":0,"cool":0},"nXxQKc846Y6uAwExP2vIgg":{"text":"We went here for dinner on Monday night and ate at the bar.  You definitely need reservati","useful":0,"cool":0},"eKS6tlknLsC5mFablSd4jg":{"text":"Food was okay. Biggest complaint was that it was a sauna in there!! Absolutely no air circ","useful":0,"cool":0},"1LJ8wNty9bhRVM3tDqXdHg":{"text":"It was a disaster! We went at 8:15 pm. They said we should come back at 9:00. We did, and ","useful":1,"cool":0},"P9JQf0gWFJpegMAqoIuJug":{"text":"Mussels sautéed in white wine, parsley, and garlic (19$). Nothing special, typical dish. I","useful":7,"cool":3},"xPr8vden_rcYaVUAmCs3mg":{"text":"Great spot for dinner just a two min stroll from Frenchmen st.\nHave to wait a little bit f","useful":0,"cool":0},"2wOT-RsGGeYr8du8OeIBwA":{"text":"Reserved a table for 2 on NYE. \nSmall and intimate atmosphere. \nAmazing experience. \nElite","useful":1,"cool":1},"qaAT0Qct69VlaAtjqk9jCA":{"text":"We had heard great things about the Italian barrel but we're very disappointed!  The vineg","useful":0,"cool":0},"m0SH4HKArRgQmhjtNKD8Ig":{"text":"I have been looking for \"real\" Italian food since I returned from Italy several years ago.","useful":0,"cool":0},"WWGxgL91UR6fnYW5GOZHiQ":{"text":"This was such a treat to find! The service was nice, and I loved the cozy and authentic fe","useful":0,"cool":0},"A5_z5ckJroKekAkwdklgjg":{"text":"this is a wonderful respite from the fun/eclectic new orleans streets.  the atmosphere and","useful":2,"cool":2},"9aGJFcPVXNF8lIuBb1mjgg":{"text":"I searched long and hard for a restaurant with good reviews, good food, good service, reas","useful":0,"cool":0},"MkeWoH3OoFrNCS16jrGKXw":{"text":"Great food and great atmosphere. My favorite Italian Restaraunt in New Orleans. Would reco","useful":0,"cool":0},"GCUmKrfXkQfsWOrKwuHr3w":{"text":"Had a good dinner here - the chicken parm comes with this linguini wrapped in some kind of","useful":0,"cool":0},"hxpMnLeF_CHTDpLjXIVEwg":{"text":"this place is the best.  My expectations were low being that it is steps from the French M","useful":0,"cool":0},"_2vOJi3b32Ijd-20ljqIsQ":{"text":"Ok. This will be the weirdest 5 star review I have ever given. My wife and I dined here fo","useful":13,"cool":4},"o3LyiKBzZhFzCFim3Rdvmw":{"text":"Authentic Italian food in the heart of New Orleans! This menu exudes the best of Italian c","useful":0,"cool":0},"jn03vlfHVOplHGPLJ4cVGQ":{"text":"Ill get the good out of the way first. The acorn squash soup was outstanding. Pretty much ","useful":1,"cool":0},"l6KBdHnITvnn4r5gYOJq0A":{"text":"To start the biggest and best cheese plates and charcuterie I have had in New Orleans.  Th","useful":0,"cool":0},"PZQ2eZjnis17-Z6Ly38YxA":{"text":"This place was amazing. Not to mention how great the espresso martini was. Thank y'all so ","useful":0,"cool":0},"Dfn9Nky2T_EespGh26iYxw":{"text":"I came here for my birthday dinner a few nights ago and it was amazing! Our waiter was ver","useful":1,"cool":0},"Sdt93P3dnxwGNXUbv6Zglg":{"text":"BEST Italian restaurant in New Orleans. Shared the jumbo lump crab salad with my friend, i","useful":0,"cool":0},"z0MdgLeITt4uJRc47qpuDw":{"text":"Update: Came last night for dinner and they've added a lot of space to the restaurant. It ","useful":0,"cool":0},"VJbREHwU_EZZZF-UrxArcg":{"text":"Lundi Gras, party of four for lunch.  \n\nWe parked off of Esplanade and planned to eat on t","useful":0,"cool":0},"qLH-EpTFU2248-jevlpu1Q":{"text":"Pleasantly surprised for the first time being there.  Nice and cozy with good service. My ","useful":0,"cool":0},"ssVfVICkyKuryyrnVW13bg":{"text":"Excellent experience at the Italian Barrel.  Walked around til pretty late trying to find ","useful":1,"cool":0},"jLzb7bXBiFOt2UlpuxgQgA":{"text":"The ahi tuna salad is one of the best I have ever had. You cannot go wrong with the brusch","useful":0,"cool":0},"8_hx5t5S6WP9LzUA5-Km2A":{"text":"When you consider the thought of Italian cuisine in New Orleans, you might scratch your he","useful":1,"cool":0},"IF4G4sLvrfgt6aalC-clhA":{"text":"Such a nice hidden gem. The decor is quaint and rustic with the exposed brick wall and Ita","useful":0,"cool":0},"yVF0If2KXxmeVUohAvlhhQ":{"text":"Every time we come to New Orleans, we make sure we come to the Italian Barrel.  From the m","useful":2,"cool":1},"TUa3Ez7ANo6qAA30Jio4jg":{"text":"I was a little skeptical with this restaurant being on decatur street, but it's truly auth","useful":0,"cool":0},"eHb4iHh2tHqb_1k8XWoa8Q":{"text":"Excellent  food nice outdoor seating, watching the world walk by","useful":0,"cool":0},"LQYjydcpL8DjlP2eB5saew":{"text":"Great and romantic dinner. Entrees were delicious, mushroom soup special was orgasmic, and","useful":0,"cool":0},"PZOybqfzHAaLGmf1VW1bQw":{"text":"I went to the Italian Barrel for the first time last night. It's an incredibly great place","useful":0,"cool":0},"Ba2crWnRS3JR8i_RJAeXEA":{"text":"While in New Orleans we wanted to have dinner somewhere nice. We were not disappointed by ","useful":0,"cool":0},"cvDEzEqwT41DbHYX3awn6g":{"text":"this place was absolutely amazing. I came from Ny to New Orleans and wanted good Italian. ","useful":0,"cool":1},"SI-zbPqTz3h3e2vm79oPgQ":{"text":"We celebrated Valentines Day here. The place was packed so we didn't expect the best servi","useful":0,"cool":0},"ZgRGsFc3MfcJhhLVslkwWw":{"text":"I came to the Italian Barrel on the recommendation of a friend that use to live in New Orl","useful":4,"cool":0},"xR5hEfzK94j52-zdHOFBQg":{"text":"The meat and cheese board here is an amazing appetizer. It's very generous in portion size","useful":0,"cool":0},"SbpXNKsMB_dQ4jLlyqwKyw":{"text":"Loves every bite from the amazing cheeses to the flaky, melt in your mouth sea bass. Make ","useful":1,"cool":0},"d0PAVHB0rxGS8wEJpyqmNw":{"text":"SAD!!! NOT what it used to be!!!!! I live in New Orleans. This was the best Italian restur","useful":3,"cool":1},"3RuEuTMp3015f-veJnxaBg":{"text":"From the cozy interior, to the friendly and knowledgeable staff, to the divine food and wi","useful":0,"cool":0},"oLRY-_dq5AW5dCm5exvfoQ":{"text":"If you're looking for a quiet romantic dinner this isn't the place.Arrived and seated next","useful":0,"cool":0},"a-AyaQH5JcFCcTzI8y8RmQ":{"text":"I came here after they expanded and now have about 16 tables. The ambience still feels sma","useful":0,"cool":1},"yr0MScDnjIuPAn4aSzqf9Q":{"text":"I was in town for the Bayou Classic and my boyfriend's employees made a reservation here f","useful":0,"cool":1},"L9Ip4a4Ojf-bpoouT5aUNw":{"text":"Every great thing people say about this place is true: the food, the service, the wine, th","useful":3,"cool":1},"hYZQwc5V-WeXz1v37aSTRw":{"text":"The food is excellent. We had a porcini pasta dish that was delicious and a veal chop that","useful":0,"cool":0},"nUQ4m0zp2xmMFn1rY9xWyg":{"text":"This is my favorite Italian place in NOLA but the customer service has plummeted. We were ","useful":0,"cool":0},"d6huAyKUvRjFSiIhHdXQPA":{"text":"This was a good spot for a romantic dinner. To be sure, the prices are pretty high, so din","useful":2,"cool":0},"lArjH_YUC0APBpWnT-Gxmg":{"text":"Occasionally, you have to write about something that's outside the standard criteria for r","useful":0,"cool":0},"8k6w9iz7j5DPj0kIoOUMNg":{"text":"I didn't know quite what to expect \nWas recommended by my driver.\nFrom the appetizers to d","useful":0,"cool":0},"c4_49LX3gQycEQ3DX3OLXQ":{"text":"Date night for two vegans - were are mostly vegan. The exceptions for us are fish and hard","useful":1,"cool":0},"wCCkHGgSAENreVNLMOshzw":{"text":"The service and the food here are top notch!  We made a reservations here Saturday night (","useful":1,"cool":0},"B7lpcLa-nDhihs7LHX1Peg":{"text":"The service was good.   The wine was lovely.  We ordered Prelius\" Cabernet Sauvignon.   \nI","useful":1,"cool":0},"Tl3wxwkrjGF8-Jq_TO8g2Q":{"text":"I don't write many reviews but I have to share what a lovely restaurant The Italian Barrel","useful":0,"cool":0},"2UBptwFppRoNilh_-QQJTA":{"text":"I recently had dinner here with 3 friends. We arrived on time for our reservation. The tab","useful":0,"cool":0},"IwHnUB31ze9hEPIPXsqzsA":{"text":"We loved the location and the attractive and quaint interior.  Everything is prepared and ","useful":0,"cool":0},"apgOAbWBRmUHMwPWzv0Drg":{"text":"A wonderful experience! This restaurant is a great little find. The jumbo lump crab salad ","useful":0,"cool":0},"HHL6ElXX-hnE4T6qJ-JEFg":{"text":"What the.... How had we never eaten here before?!?\nThis place is AMAZING. We dined al fres","useful":2,"cool":1},"8g-hZi0jWHTB4irqf1UtXw":{"text":"We got take out at this joint. Portions to me are a bit on the smaller side but not tiny, ","useful":0,"cool":0},"ptHksmvOld9ypmzeUo0QAw":{"text":"Fantastic place to eat! Wonderful staff! I had a special romance request and they lined ev","useful":0,"cool":0},"8VT2kb5VN22jlFoiLydzLA":{"text":"Chef Samantha has been blessed by the gods as far as her lasagna skills. I have never had ","useful":1,"cool":0},"65BUPiQxBzl2khbLCLovqQ":{"text":"This place was AMAZING!  Sam knows what she's is doing!  Best food, service,  and ambiance","useful":0,"cool":0},"cYSDkb74MuiWp8Ep0kSU1Q":{"text":"We had a very expensive dinner at the Italian Barrel that was six courses. The first cours","useful":0,"cool":0},"5kXEp0GmSxVsI5wmLQN4mw":{"text":"I want to start out by saying this was our second time at this restaurant . The first time","useful":0,"cool":0},"NGWdWJJLmpBMJlS6LHwpFg":{"text":"Loved this place! Found it walking by and 2 servers loved working there. Chef Samantha is ","useful":0,"cool":0},"eV3X2mcvlMroItikjEkOTw":{"text":"I can't rate the food, because we never ate.  I made reservations for 8, and by 9 we were ","useful":1,"cool":0},"foQ7h5FMCXeo1Jp_Hz05gw":{"text":"We were in New Orleans for French quarter fest and we decided we wanted to find a nice pla","useful":0,"cool":0},"kR4et5RL7wkofaSMkf5egg":{"text":"Well if there was a negative 2    I would have given that. I left a private message for th","useful":0,"cool":0},"6gfv015gjn8QPmk40uy3Lw":{"text":"The food is always great. The ambience is romantic.  Great date spot. Big wine selection. ","useful":0,"cool":1},"IiyK0amYSI1P5ZQYA97kNg":{"text":"Pasta was good overall, but the sauce was on the thicker side for all 3 dishes, which incl","useful":0,"cool":0},"c0K4OvWGdMhYSui28iWMPw":{"text":"What can I say? It was a lovely experience! We made reservations online via OpenTable, whe","useful":0,"cool":0},"iFesiqC-7STvpEPGwnxRNg":{"text":"What a great Italian restaurant. We went there twice during our week vacation in New Orlea","useful":0,"cool":0},"YN8Uqv36H8NFUcJgA5BDPA":{"text":"Very ordinary... Heard great things about it and was really looking forward to eating ther","useful":0,"cool":0},"VSEonyOfhvIRa-m12BwrcQ":{"text":"Which was worse?  The exorbitant prices or the horrendous service?  Not to mention the so ","useful":1,"cool":0},"A2c39x5VkPBz2kSn1sZTMg":{"text":"I like this restaurant, the owner is straight from Italy, so the food is delicious and tra","useful":0,"cool":0},"V16VcS6l6-8YuhNNXQn6tw":{"text":"I had a disturbing experience at one of my favorite restaurants in New Orleans, the Italia","useful":0,"cool":0},"_LRf6XGYgi4ly2K32_Dkkg":{"text":"We took a friend here for her birthday and had one of the best meals any of us could remem","useful":0,"cool":0},"aOzkuQ2cILIi-lta1LZTqg":{"text":"Food was ok at best. It is not worth the money, the service was ok but not great. Will not","useful":0,"cool":0},"Cy9YnrW5T8hPxtxWpoS0Wg":{"text":"We took a friend here for her birthday and had one of the best meals any of us could remem","useful":1,"cool":0},"LI4JCYJuxFZwgd_Og5USrA":{"text":"Quality of cocktails varied greatly. Main courses were not hot but were served at room tem","useful":0,"cool":0},"XRoh8cM3Q7eO97mCfJbFXg":{"text":"This is one of my favorite, if not my absolute favorite, restaurants in New Orleans. Wheth","useful":0,"cool":0},"gOaAa6lnluyxlyIiTZ8TiA":{"text":"Worst  food  and the worst service ever!\nThey treated us so rudely and  we would never go ","useful":0,"cool":0},"UuEv70SjOR6R6x8P6oIjEQ":{"text":"The dinner was ok Italian food. The service was lacking.  I asked our waitress how her day","useful":0,"cool":0},"RukRd_AJJoR3u3Xa25BY8w":{"text":"This place was a disaster. Seven of us went there for lunch on Mardis Gras day. Even thoug","useful":1,"cool":0},"4-L5veWy_4Ufp_6PO2rfBw":{"text":"Been there numerous times over the years and personally feel the restaurant was better pri","useful":0,"cool":0},"CfSF1GNlSpnWQaBuYK4rfw":{"text":"An hour and a half of the most awkward, spotty service and food. Started off by walking in","useful":0,"cool":0},"jSMQZ_6tVY5KspOdW9nFxw":{"text":"We have a condo in the French Quarter, and we took our son and his wife, along with anothe","useful":0,"cool":0},"QeF_khRUUd9jrAsVswHGlg":{"text":"Went there for Thanksgiving dinner and the whole experience was horrible. We showed up at ","useful":0,"cool":0},"0doViHxN-o5qiD203jRyFw":{"text":"I ate here regularly years ago and it was always exceptional but on the most recent visit,","useful":0,"cool":0},"A6rtBFIuwqSvCmGS1j8uBQ":{"text":"We were in the mood for Italian food while in New Orleans with friends.  We should have ke","useful":0,"cool":0},"QHiJoQA-SUq-K4DV-uAXcg":{"text":"I LOVED this restaurant.   Unfortunately, members of the service staff is ignoring rules r","useful":1,"cool":0},"quE6Knz92jKWkZH-znGPNQ":{"text":"I did not expect to find such a place in New Orleans where cultural fusion is often the ca","useful":2,"cool":2},"gSy0j3VplHDL93Dpdqy3HQ":{"text":"Our party of four gives it a unanimous 4 stars. Sat outside, weather and ambiance were per","useful":0,"cool":0},"XLcO7fU2R4m7CSVOLwxLVA":{"text":"Best Italian in New Orleans. Hands down. Had the truffle ravioli - so rich and so good. Al","useful":0,"cool":0},"ZHQFj3NaaLtfGZaF7Vb5tg":{"text":"My husband and I went for our anniversary this past weekend and if I could give it more th","useful":0,"cool":0},"7GaXZoqoM2xBBlfiNB7S6Q":{"text":"Amazing place! Staff was so kind and the food was great. We went for our anniversary and t","useful":0,"cool":0},"DikQKyibcAD_OtulT7ivJw":{"text":"Having had dinner here multiple times I read the following on an online New Orleans blog a","useful":3,"cool":0},"d-9nKHQludqw-Kr7pLEX_A":{"text":"This was overall a very disappointing experience. We sat outside and the noise and vagranc","useful":0,"cool":0},"4Yg19x0x4BCqBo2fLW4I-A":{"text":"This place was amazing!  Great little Northern Italian restaurant with a warm inviting atm","useful":0,"cool":0},"-OkSpooAeB_7ooLnYajYVA":{"text":"My wife and I were not going to let a lapse in service ruin our Christmas Eve dinner. And ","useful":1,"cool":0},"3uUhtFXsnNqgvRlOnKxf6w":{"text":"The Penne Allá Vodka is unreal. Would definitely recommend to a friend! Great and friendly","useful":0,"cool":0},"kCucALpXTn5oOqImJxy1yw":{"text":"Exquisite Italian. Warm and equally elevated service. Step out of the 1/4 and into an oasi","useful":1,"cool":0},"7q1bPoU1iMLnShzbGzhWTg":{"text":"Sigh.  I really feel like giving fewer stars, but this really is a great restaurant.  My d","useful":0,"cool":0},"HT_139rngZxOp6y1GBIaZg":{"text":"Too bad you can't give less than one star.  This is the biggest joke of a restaurant. We h","useful":1,"cool":0},"Hvbd40pdpOe5FSTqSSxAHQ":{"text":"The worst experience during our stay in New Orleans where reserved a table for 8:30 PM we ","useful":0,"cool":0},"Z0jw6v6CsOAx-Ew9TArdng":{"text":"Best Italian in the quarter. Small setting, small menu and excellent service. Been here wi","useful":0,"cool":0},"kuHssVi2mTS0k1rUgPWXPw":{"text":"Food authentic Italian - wine list somewhat limited to Italian wine only. They do not allo","useful":1,"cool":0},"Dp1K0biQUrIB1DRhknZMCw":{"text":"First- the food is amazing. 5 star. The service however was entirely unacceptable- the wor","useful":0,"cool":0},"ulj3IKoqYRJitKsoW4L1dw":{"text":"What a treat! Off the beaten path a bit, not taken over by the loud sounds of bourbon stre","useful":0,"cool":0},"az_xZcjDJhBqgP8Dx7Fb1Q":{"text":"Pretty average Italian restaurant. Decent wine menu. Service was good. Bruschetta was good","useful":0,"cool":0},"svl3e0KI71VDeIjSQfeB2A":{"text":"If I can rate this spot a zero I would. The manager does not have any customer service ski","useful":0,"cool":1},"kVPox5b3hro730DKwY8EYg":{"text":"Very Bland for true Italian.  Lasagna had no meat or cheese. Pasta and sauce in layers. Fr","useful":0,"cool":0},"DpjcAG3wj83VXJH8XQsg6Q":{"text":"The staff squeezed us in for a later reservation and we were happy they did! We had one of","useful":0,"cool":0},"GQ2Sm9oGV2ybi7BZkiSXBg":{"text":"I was pleasantly surprised at how good the Italian food was here! This was my first time t","useful":0,"cool":0},"sMfW6tg1lQOaJZVqX-iw4w":{"text":"You're in the mood for Italian. And you're in the mood for THIS Italian food\n\nThe food is ","useful":0,"cool":0},"B6TktQjF2xhm9I9uJnzuPQ":{"text":"Went on New Years Eve, had to wait 45 minutes outside past our reservation. The manager pr","useful":2,"cool":0},"hADjNzD8AGiIHk1DKgWVEQ":{"text":"We took a friend here for her birthday and had one of the best meals any of us could remem","useful":0,"cool":0},"GWpKr4sGZrXlwR-0CBvu4w":{"text":"The Lasagna was excellent! The spaghetti was decent but could have been better. Service wa","useful":0,"cool":0},"ssndjbacWc1pi6PoK2aPQA":{"text":"I love the lasagna and pumpkin ravioli almost as I love Nathan my favorite server!. I have","useful":0,"cool":0},"0-EmqXRwkrNkgAriv1XKfg":{"text":"Your can't order to go unless you do uber eats or go in and order but not over the phone. ","useful":0,"cool":0},"6HdgLi5_947H_puiSm0i4g":{"text":"Took my wife here for Valentine's Day and now I have a new favorite restaurant in the city","useful":1,"cool":0},"PVApTGb77Czp0uly_rngKw":{"text":"The restaurant is easy to miss as it's a little off the beaten path and is a little bit sm","useful":1,"cool":0},"CckBY6Ay6NPpr8Jhd0rUYA":{"text":"Good Italian for New Orleans. 3.5. Cute mom and pop place off the French market. The steak","useful":1,"cool":0},"PtEFRkVg4JEDMWRuRpVV2Q":{"text":"Mardi Gras day dining on the sidewalk - you can't get much better than that, but I had to ","useful":1,"cool":1},"5KA3zZrfQ7sKhZ4UfPYECA":{"text":"While Italian food isn't trendy right now, it's always been a favorite of mine.  I love pa","useful":1,"cool":1},"BWDoQ_beWFHXZa0Iqxj1sQ":{"text":"It's hard for me to repeat restaurants in a city with so many options, but when it comes t","useful":0,"cool":0},"UyARSuPLlBm4fkj52d33Vw":{"text":"I came here with one of my friends for a delicious night out and The Italian Barrel delive","useful":0,"cool":0},"ILgkVz8s1J4nawCosNrCZg":{"text":"I have been going to Italian Barrel for over 10 years. I'm not sure what has been going on","useful":0,"cool":0},"Q_xwgytopXwDTwO_i155Hg":{"text":"Oh my god. How did I live here my whole life and not know about this place? Amazing. Food,","useful":4,"cool":3},"gtcwU3h_JTVN5uHrrpRn4g":{"text":"We went for my husband's birthday.  I told them in advance that it was his birthday and th","useful":0,"cool":0},"fefCM-PMG2YqlIR5jWXerg":{"text":"Exceptional service. Beyond amazing food. Highly recommend. \n\nIn our evening, we started w","useful":0,"cool":0},"8_BVY-81J63ZgHlR_sgFOA":{"text":"We first saw this tiny gem after a wrong turn on the east side of the French Quarter.  The","useful":2,"cool":1},"aKv79MlwwVclEhN4TH27SQ":{"text":"The place/atmosphere very nice. Loved the wait staff. We did not like that they would not ","useful":0,"cool":0},"Y6_DFiDlPDZkYfgv4OjkNQ":{"text":"FOOD POISONING ALERT Had the seafood salad here and it destroyed my life for a week. Urgen","useful":1,"cool":0},"8jF-pYEJbaIXjIy20d_N-w":{"text":"Marvelous meal. We had the lasagna and it was quite possibly the best lasagna I've had sec","useful":1,"cool":0},"85JIkGEdiNSkqo1QdqNCEg":{"text":"Good but way over priced. They also made us buy bottled water, claiming it to be related t","useful":0,"cool":0},"eycUAmf-mKTHt9b0ptQISg":{"text":"I had to wait a day to post this because I was so angry about the poor service. Reservatio","useful":0,"cool":0},"tiT5Cg2_k8f4vNA8BjDEyA":{"text":"This is purely a service review.\n\nI would absolutely love to give this place five stars si","useful":7,"cool":0},"vPtEDLkKFeXGnGbGzXe0Xw":{"text":"Wow, the name of this place had me thinking it was going to be casual, but definitely more","useful":0,"cool":1},"LgAeXDZez7jVRVh5AcYHfA":{"text":"Definitely not the best Italian food I've ever had, but the service was great. I ordered t","useful":0,"cool":0},"Lxlf-Bzw24i-jnbDiQ1zCQ":{"text":"I stopped in for  a break during Mardi Gras.   There were empty tables outside, I really d","useful":5,"cool":2},"qfpbZd5LO9PbXqxkFdkDoA":{"text":"Terrible experience!! DON'T GO HERE!!! My bridesmaid & friend (who is a white woman) & I (","useful":3,"cool":0},"YdPsfXDlMwy8pViJ1z0J7Q":{"text":"Went there for Christmas Eve and it was a disaster\n\n-waited 30 min for our table, despite ","useful":1,"cool":0},"Dltrppz4mTKuG-u2mwz-qg":{"text":"Was excellent service, our waitress was unbelievable!   \n\nThe restaurant has a unique and ","useful":0,"cool":0},"OCU95yJJmdOWL8V0EHw2nQ":{"text":"My friends and I chose this place to carbo load before the RnR half marathon.  Apparently ","useful":3,"cool":3},"BB-2jJRxRJ6b7yNebiXmrw":{"text":"Dinner at The Italian Barrel did not disappoint! How on Earth have I never been here befor","useful":19,"cool":18},"P5Ou60hsV6FijgIBEuFTJw":{"text":"The server Blake and the food was good.  However, the manager and owner were completely un","useful":0,"cool":0},"HoD19DX9Ttqu1SG3p7v4pg":{"text":"We were very disappointed to have this as our last dinner in Nola. Terrible music (elevato","useful":0,"cool":1},"kmnTxEnIVharcT4P3MkOSg":{"text":"Not good. We ate here with a normal size group and the service was very mediocre.  The ser","useful":0,"cool":0},"ze8P7J7kGm0KBVqn_u_2uQ":{"text":"The ambiance and vibe is beautiful. The wine was also great. I really wish i listened to t","useful":0,"cool":0},"CWrSBdln6mDwiKfPaQ4bGg":{"text":"My husband and I traveled to New Orleans for just a short visit. After a long day of drivi","useful":0,"cool":0},"T6O6i63NzLaXQ0ocp7r7VQ":{"text":"Incredible. Absolutely incredible.\n\nThe creamy, amazing porcini and truffle ravioli is AMA","useful":0,"cool":0},"-Yu5AP5nXV_QIeSdxIOxcw":{"text":"Location: 3/5\nNormal downtown/French quarter parking \n\nAtmosphere: 4/5\nTables are tight, b","useful":1,"cool":0},"MkmWJw_tvWjsjQXXWZ428A":{"text":"So intimate and accommodating. Great food. Will be back. Great date spot. I had to call li","useful":3,"cool":0},"mX-6V0--oyMfkDhd6WwB-A":{"text":"We happen to arrive 15 minutes prior to our reservation. Another couple walked in with no ","useful":1,"cool":0},"ZCmT3k0sBwPjxTphDQ7vgA":{"text":"We saved this restaurant for our last dining experience in New Orleans . We were extremely","useful":1,"cool":0},"Q_bA2JaIAlRNhTCZ3qTqkQ":{"text":"Found this little gem by the French Market, stopped in for lunch. White linen table cloths","useful":0,"cool":0},"u26h0c6vP3x_-vI3hkpYTQ":{"text":"Great food.\nFriendly, knowledgeable staff.\nClean.\nWarm environment.\nEnjoyable dining exper","useful":0,"cool":0},"KRxD01QRauXp_bRe3v9B2Q":{"text":"Jonathan you're an amazing waiter. You didn't care that I was a picky eater out of the 3! ","useful":0,"cool":0},"zwm7qXzzwCBCmHDkrFcZSQ":{"text":"Don't waste your time of money going to this place. The long walk to the shady side of the","useful":0,"cool":0},"i34K9GDvGvssYC6KywY5WA":{"text":"Very underwhelmed with our experience. The appetizers were bland and overpriced.  Same for","useful":0,"cool":0},"04_CvFXeXqQLDeZ_gWlg5w":{"text":"I was skeptical when a friend said this is the best Italian Restaurant in the city but wha","useful":1,"cool":0},"0YHVVyyxLspDhMenAQusNg":{"text":"I really love this place. The pasta is the best! The Veal was a bit over cooked but everyt","useful":0,"cool":0},"8z5EPrxEwPX9NnhUiFxRNw":{"text":"We enjoyed our meal at The Italian Barrel. We both had the Nicoletta salad.  The dressing ","useful":0,"cool":0},"rxWpHU-ozu-BHwh6Q2qJqQ":{"text":"*I have never given a one star review in my life*\n\nSome pertinent back story. My significa","useful":4,"cool":0},"_vvWKzWuYsSujJFeXrFDxA":{"text":"This place was nice. I ordered the Gnocchi and my daughter had the ravioli. I loved mine. ","useful":0,"cool":0},"taakBqmYQ4Vvv2VNnHEUQg":{"text":"New Year's Eve!  Been last two years. Excellent service and delicious food. Need reservati","useful":1,"cool":0},"aChvNquYXND45-tNrUv54Q":{"text":"Ooooh each time I've gone here the food has been amazing and people have been so nice. Eve","useful":1,"cool":1},"v8PojsG9jOv_FhqVy7rLEg":{"text":"Honestly I'm shocked. I ordered the penne alla vodka with JUMBO crab meat and bruschetta.\n","useful":2,"cool":0},"cVRey1g2uvO903DOKPVyUw":{"text":"Charming. Intimate. Authentic. Delicious. \n\nMy husband and I were wandering looking for a ","useful":2,"cool":0},"CjUuZzMF2LejyT8lOmC_LQ":{"text":"Our waitress Maize was fantastic and the food was to die for. We got mussels for an app, y","useful":1,"cool":0},"XR2-Ruf0tj9wqiJVnuZ9Dg":{"text":"Disgusting !! Rip off!! So bad it's almost funny.\n\nMy family stopped in here before our fl","useful":0,"cool":0},"BlPj9wVtC0Pe_xcBc-kBQQ":{"text":"The mussels and clams were great. Dinner is highly recommended. The wine recommendation fr","useful":0,"cool":0},"ZTgWqLj2Gg91bSercPiDZQ":{"text":"Service was nice but overwhelmed.   Recommend not going here during busy times.  Besides s","useful":2,"cool":0},"UDl43PL2f1e_gJZDah8uyQ":{"text":"My husband and I went there for an early dinner at 5:30. I had the veal piccata with garli","useful":3,"cool":0},"QLTDkwz3Dft6C0u7a4UySQ":{"text":"I took my son to The Italian Barrel for his birthday and we were not disappointed! In the ","useful":0,"cool":0},"jKlqZtIAqXJLomf4aI9ikQ":{"text":"My husband surprised me with a Mother's Day weekend get away ! My all time favorite food i","useful":0,"cool":0},"nfCmYPqqqT8Fo9-lGiB6cA":{"text":"Absolutely disappointed... food was ok and service was mediocre. This place may look nice ","useful":1,"cool":0},"y1DPAFv86a-CwJ6hH8UGOg":{"text":"Even though the food is pricey it is worth every single penny. Very small restaurant but n","useful":0,"cool":1},"dRpjqaK_Mhfa18JGyiyMGQ":{"text":"I was in NOLA for 9 days, found this little gem after wandering around the market. The ser","useful":1,"cool":0},"N_jpXzlsDYuVZ1v0W91pzg":{"text":"A hidden little gem way off the beaten path. So glad we found it. (Bar tender at Molly's s","useful":0,"cool":0},"lxQIyUnl5Y3ACqzJNypb3w":{"text":"I've been here three times.  Casual dinner, intimate dinner and large gathering of family ","useful":1,"cool":0},"jD_tyc6rjQDgr_U5Zb6iRQ":{"text":"We happened upon this place yesterday while walking around. We had just planned on a glass","useful":2,"cool":0},"rQVwp3SUkIB0JjDOSh8r8Q":{"text":"This appears to be a simple spaghetti or pizza place from the outside but when you walk in","useful":5,"cool":1},"lZbvFtHj96VHGnCt38B6Ww":{"text":"I wish I could provide more pictures, but I guess once we started, we devoured everything ","useful":0,"cool":0},"AOYR_zwL8OsWrdhnoR71Jw":{"text":"You wouldn't think of an Italian joint in New Orleans for fine dining but this little rest","useful":4,"cool":2},"LU8gK6nzcgutrkkwcmzBRw":{"text":"Turned us away over 90 minutes before closing for no reason. Not very professional. We had","useful":0,"cool":0},"Z8lDADldsco6jDnR-vVpvg":{"text":"I just went to The Italian Barrel for Valentines Day brunch. I have been several times bef","useful":0,"cool":1},"plHXM_WIxpOF4mirroLTtw":{"text":"This maybe the most overpriced Italian food I have ever had!  32 dollars for chicken parm,","useful":1,"cool":0},"wz9x4oFib828tPwBVDj_hA":{"text":"Can I give negative stars? We were super stoked for a yummy Christmas dinner, and to say t","useful":1,"cool":0},"sjjio-Xif4TWKraodXF_dg":{"text":"Can't understand why anyone would braise veal and then grill it. What they do to meat shou","useful":0,"cool":0},"ZN8WO8H993W_SKoVaOfwfQ":{"text":"WOW! The Italian Barrel holds such a special place in my heart. It's where my fiancé and I","useful":0,"cool":1},"7f2Kb7q4N8XlH6GxQ1Dx5Q":{"text":"We tried this place on Christmas Day. Food was good but so slow to arrive. I call it a com","useful":0,"cool":0},"Rjd2d12fTMdUQLwrFM-HTQ":{"text":"Wow!  This place is amazing.  The polenta appetizer melts in your mouth. \nThe porcini mush","useful":1,"cool":0},"r-zr8paQmEatneQYbmYa8g":{"text":"The Italian spot we wanted to go to was too busy, so we came here. The worst thing about t","useful":1,"cool":0},"s4zsxyBFgWIMHjwLzPjKHg":{"text":"I had the rigaton pasta with gorgonzola, marscapone, and walnuts. It was delicious and was","useful":1,"cool":0},"PA5AJGPoxRCemcsWiFH9Kg":{"text":"Gave their place a second try and can conclude that it is just not good food! Way overpric","useful":2,"cool":0},"AwnmxKdquHNYcavoFQ5Pvg":{"text":"Outstanding service, food, and atmosphere!  Very quaint and personal dining experience and","useful":0,"cool":0},"_4jQ5exxyvFrcIhkTVC_hQ":{"text":"Had reservation. No hostess when we arrived. Owner seemed to have to \"do-it-all\". Seated, ","useful":0,"cool":0},"pPhkrBcdzfDI3sju78t-QQ":{"text":"Proof of vaccination is required. Out of most of the moment at 5pm. Make it hard for peopl","useful":1,"cool":0},"CKwXZ4zOXFe1SzWWe4OjMw":{"text":"We had a great waiter.  And the gentleman who brought us out bottle of wine.  \n\nBut an Ita","useful":0,"cool":0},"xgtsjhRYstmvELx3whHmbw":{"text":"Conflicted how to rate this one.  A couple of friends of mine who live in NOLA told me if ","useful":2,"cool":0},"FfxC2phc-Aj_i66-sTMD5A":{"text":"Sadly, this was a huge disappointment.  We'd heard fantastic things from friends and decid","useful":2,"cool":0},"B073yn4NXm5fy7YttstD1g":{"text":"As the first restaurant on our list to try during our trip...I went in with some high hope","useful":2,"cool":0},"qVFL5F-qVtUnrv3IkMhCVA":{"text":"Once heralded one of the best - if not THE best - Italian restaurant in New Orleans, The I","useful":1,"cool":0},"qk2ENSFsrC5mKnHuZ2s55A":{"text":"Had an odd experience here, to say the least. \n\nA server caused a huge scene, apparently q","useful":1,"cool":0},"VGDNptfafsn1dYUGynNhNg":{"text":"March 2021 - Romantic, pricey restaurant; great for a proposal. Have to wait outside in or","useful":0,"cool":0},"RNbg6fHMEE7tC__JK8FP_w":{"text":"We had the best experience! We are local and for some reason just never had this spot on o","useful":0,"cool":1},"Tz6GCKsNzLUv3cCsz7GaOA":{"text":"Came here for lunch and service was just terrible. the servers and hostesses were so rude.","useful":0,"cool":0},"_GEsIn_uAjNYiEo8jwl9Og":{"text":"We had a great experience on our first visit!  The service was fantastic, and the food was","useful":0,"cool":0},"aXRQryA7WUF379Y2EVbzVg":{"text":"I have been a cheerleader and patron of this restaurant since she opened it. I have sent h","useful":0,"cool":0},"YM7FYcqxiqzetstGWmpICQ":{"text":"We sat earlier outside at 11am.  Ordered $24 of champagne after walking inside 25 minutes ","useful":0,"cool":0},"KzUaGdSA6jZfX9ju65-G7g":{"text":"I don't leave reviews a lot, but I had to take a minute to brag on our server, Alice! Ther","useful":0,"cool":0},"yCqIJ0UyRq0xgtkdcJEtmQ":{"text":"We loved this intimate Italian restaurant with delicious food and fabulous service! We ski","useful":0,"cool":0},"QDf4GdxIfELfCZWzdHsrBw":{"text":"This place is amaizing! We came 15min till closing time and they still took us in. We are ","useful":1,"cool":0},"GwQoiYhAUX15WRlXfoircQ":{"text":"Very nice but place.  Went in for lunch. There was literally one couple in here and it loo","useful":1,"cool":0},"95Sg5f_ILw5-9otLtDcfeQ":{"text":"Quite literally the BEST Italian food in the city! I have been eating here for years! I'm ","useful":2,"cool":0},"xeuJyr3nm9ra1uf7TxFB5g":{"text":"My girlfriend & I went for our anniversary & when we made our reservation they only had ba","useful":2,"cool":1},"bg-POajNy9T0IzPUsQEiKw":{"text":"So let's start off withith why I decided to pick this place and why I am absolutely floore","useful":2,"cool":0},"Rftbzs9xjlPsEea05YzAuA":{"text":"Made reservations for  Christmas Eve, as they had an open menu (not a reveillon) and came ","useful":0,"cool":0},"LcYzWefriqc0PrqtHD71iQ":{"text":"I had what I felt to be an all around extraordinary experience here on my birthday, a nigh","useful":15,"cool":15},"Ed5Mwo3qAGPN5FQ95m-KJg":{"text":"Well here we go. After waiting 87 minutes for our entrees, 4/6 of them arrived soggy and L","useful":2,"cool":0},"trR5KQLG1XthbMgnDryciw":{"text":"After a handful of visits over the past 8-10 years, it's time to award this little gem of ","useful":14,"cool":17},"xmPzm8fIXEosJZ8GNWg-hQ":{"text":"We didn't even get a table. Not because it was busy because there were tables available. T","useful":0,"cool":0},"viqvUY-yERxSOrVadd9joQ":{"text":"The restaurant is so quaint and cozy. The hostess was very nice upon arrival. The server w","useful":2,"cool":0},"_MwHQat_NalOaAaPsS3PPg":{"text":"Great atmosphere and menu choices however the value for the money was not there.  $36 for ","useful":1,"cool":0},"zNQdDqs7m66zqeAJeQE0kg":{"text":"Great atmosphere as this is no stuffy Italian restaurant. The food, however, rivals any to","useful":2,"cool":2},"-zyh9dZb2F8Qy5CfySfihg":{"text":"Ordered a to go order and spent over $200 including a large tip. \n\n1 paid for two entrees ","useful":6,"cool":0},"Mw-wGHcAVPZftsC8V6il_A":{"text":"Always amazing.  We had the meat antipasto.   The best. The Chilean Sea Bass was excellent","useful":0,"cool":0},"HXJvKvzFs1_RLW8pwGoz_A":{"text":"I am on cloud nine after eating here! Usually Italian can make you feel heavy after eating","useful":0,"cool":0},"_rDhkUHke_GPGpu2jSsszA":{"text":"Delicious and romantic dining on the edge of the French Quarter. Wife and I have been dyin","useful":0,"cool":0},"gRsgQzJwv71R6KDOgH0JpA":{"text":"This is an absolute must for the best dining experience a person can have in the Quarter. ","useful":2,"cool":0},"wA-fUqkcaFEgPqKAvTSTtQ":{"text":"Always love this restaurant. The BEST part is the \"talking menu\" I don't even open the men","useful":1,"cool":1},"aYZFlWI8Rii4ex8-2wSBZw":{"text":"Our waiter is the only thing that made this restaurant earn this one star. I understand th","useful":0,"cool":0},"794WNWW9NkCDCcV-o812Cg":{"text":"We were in NOLA as an early Christmas trip but the hubs was tired of seafood (who gets tir","useful":1,"cool":0},"3iNWzY5pvqwNStUuuLAIfQ":{"text":"The worst dining experience ever. DO NOT DINE HERE.  READ ALL THE 1 star reviews as they a","useful":6,"cool":1},"D7ZC8pOd1J2_41g-WKrqMQ":{"text":"Fabulous!!! We sat at the bar- Kendall was awesome!  Best melon and prosciutto, excellent ","useful":2,"cool":0},"sOgMpDn5qCvgDBcw5C6X1g":{"text":"I had high hopes for this place, and the first 10 minutes were good-a nice intimate Italia","useful":0,"cool":0},"I0oHiIi1hOPiZIWy-Vk3Vw":{"text":"After a few days in NOLA we needed a break from the Cajun cuisine. As a final family meal ","useful":0,"cool":1},"WfkTe3DKg1vilqTxR9udCw":{"text":"I had a reservation for four on Christmas Day.  Around noon, on Christmas, we received not","useful":1,"cool":0},"mmgllhGE0v-TwE2MQEWgcA":{"text":"Romantic and charming, this restaurant stands out in a city with a heavy Italian American ","useful":3,"cool":0}}