{"70lOC6y7Yt8iNszwc7xgoQ":{"text":"Great place. Bartender was very knowledgable and friendly. They have das boot. I would def","useful":0,"cool":0},"O9u8nL988ytYHg9VZgI_EA":{"text":"This is a cool little boutique bar with a German beer garden theme.  I really like the bee","useful":6,"cool":1},"GAiriLxTL6SKVDZ3GRJ4Sw":{"text":"What a quaint little spot! This comfy corner nook of a bar is one of New Orleans best kept","useful":0,"cool":0},"_MAFPTQLjUyQianMTZSB_g":{"text":"This is not necessarily your typical NOLA bar but Dominic took such great care of us and t","useful":1,"cool":0},"1kMACnK-0BFfOeXvFWS7MQ":{"text":"Ehh. So \"beer garden\" is a buzzword for a cool place to sip on a frosty brew. The use of t","useful":0,"cool":0},"l1lI8K47h9gtAlH32j6AHA":{"text":"Love this place, it has a variety of imported beers that are awesome. I had the super brew","useful":0,"cool":0},"gBrsybwpbMInos6dJeu7ng":{"text":"Great little bar in our neighborhood. Love the staff and the regulars (like me) are all su","useful":0,"cool":0},"yKSiH6URreNdv2r_kRvs9g":{"text":"Awesome Thai food today from Sattah! I recommend you find their next pop-up, you can find ","useful":0,"cool":0},"q2txErw_Wpp5NZ_Hj_dmag":{"text":"This place is Prytania Bar's cooler, younger brother. At Aline Street you can expect a lar","useful":0,"cool":0},"wOA64y7X9vYOTiXByzATIw":{"text":"We've become reasonably regular regulars here over the last month or so. It's close to hom","useful":1,"cool":1},"64deuqU3IELM8TEBEbqjrA":{"text":"After wondering New Orleans on a hunt for St. Arnold, Clayton's favorite beer, we just so ","useful":0,"cool":0},"ZSluoBrPKONZ5_1SaW5LLg":{"text":"Went here for the stickball NOLA pop up they were hosting on Tuesday. Reasonably priced dr","useful":0,"cool":0},"_7grtWmql9RvMI8SjyHTEQ":{"text":"Ehhh... ok. I guess it's more of a mid week, happy hour place.  The staff was awesome, but","useful":0,"cool":0},"mIN8PzUSazF9_mdueOCFqQ":{"text":"Great selection of beer. Michael was our bartender and he was incredibly knowledgeable, he","useful":0,"cool":0},"ZGpHH6RAbMWNwJOpjNjYow":{"text":"Fast, efficient, friendly and cool atmosphere.   Love that most of store is on sidewalk wh","useful":0,"cool":0},"5BkMJFtscQ3KJVfGIC8jZA":{"text":"Stopped here to watch the NBA Finals with some friends. I like the beer selection especial","useful":4,"cool":4},"ESZhQcIvmhiPb50p42Rreg":{"text":"I really loved this bar. Considering that I couldn't drink when I visited, that is saying ","useful":9,"cool":5},"zb1xO71MKEAv1KVXXGcPIg":{"text":"Yeah buddy! I'm totally digging this place. The bar has a great selection of German beers ","useful":3,"cool":2},"q2d653fBEpq0MWULTrZCAw":{"text":"Nice, casual bar with really friendly bartenders. They're very sweet and attentive, althou","useful":1,"cool":1},"x8IkS1-fKIqDhaKRqsxSdw":{"text":"Where to start? This is place is an absolute gem.\n\nMy friends and I were in town over Labo","useful":2,"cool":1},"Q1hbyRlaMMkam6ZkmauVAQ":{"text":"Really loved this place. It's small and quirky with an odd layout that's skinny and wraps ","useful":2,"cool":0},"5Ejdwi6gxAHG9AG7KjSp3A":{"text":"BLUF:  Close to several bars so in a good location but small and quaint if you want to hav","useful":1,"cool":0},"E-_xUv28Q7Vi65r0abfnmg":{"text":"I just adored this place and I adore it enough to give it 5 stars.\n\nThey have a huge beer ","useful":6,"cool":3},"YTs0UYjFqgkUFA821dbsIA":{"text":"My new favorite bar. Awesome selection of beer, particularly Bavarian beer--Ayinger, Paula","useful":0,"cool":0},"WWzPOZdZVj3icgd_t7qcNA":{"text":"Love, love, love this bar!  Best kept secret in the Garden District/Uptown.\n\nThere is a fi","useful":8,"cool":10},"Y9sRIiikko5DUnP_3Kt4RA":{"text":"I was walking around the neighborhood looking for something nice and found this place. Del","useful":0,"cool":0},"s6aYu1u3mXrMXM0TAevMlg":{"text":"Honestly, I will NEVER go back. Stopped in after Sunday brunch...decided to tackle \"the bo","useful":1,"cool":0},"lY7k7AsEavCwVcRa_bwUyA":{"text":"Incredible selection of German beers!! Bartender was very knowledgable. Jukebox plays fun ","useful":0,"cool":0},"E3sgu_GWEAW0mup5nQ_GfA":{"text":"I can't say enough good things about this place. Just moved to town and I will probably ke","useful":1,"cool":0},"lowRhmIERIw83XAFaj7qfw":{"text":"What a strange/good (?) experience we had here. We were walking around the Garden District","useful":1,"cool":1}}