{"R5VifYVtVNpVt9Q9GBPjpw":{"text":"Nice hotel but so pricey.  Everything is overpriced and they nickel-and-dime you at every ","useful":4,"cool":1},"BOVTErr1OqAsT4uwgJSt9w":{"text":"Entrance and main lobby are gorgeous.  Room is large but bathroom is very small.  Location","useful":0,"cool":0},"CgBCSMqEElaiWiNvQNDVjw":{"text":"I went to the sign lighting at the Roosevelt (formerly the Fairmont and then before that t","useful":0,"cool":0},"YWauPM4VywaGgthgeiO3bQ":{"text":"For the price of rooms, I was expecting to have my mind blown by the incredibleness of thi","useful":3,"cool":0},"mULJ6Ts5JANkmj-zpBIBRg":{"text":"These are some more reasons you shouldn't stay here:\n\n1)reception was understaffed and unh","useful":3,"cool":0},"yj6_tXqkAzTgi_ypvCuKmQ":{"text":"This hotel is amazing, very well located, we stayed there for 3 nights during the Mardi gr","useful":0,"cool":0},"Qv2UWKRQZAdSqY6TutIxtw":{"text":"Weird mix of classic charm and tacky management - we needed to have some small boxes deliv","useful":1,"cool":0},"0_85wd43mPq-oRT1OpETWA":{"text":"Beautiful hotel! The staff was great! I only got coffee at Teddy's Cafe, so cannot say any","useful":0,"cool":0},"H5tE_MR3jwQMT6IR_pWdSg":{"text":"Looking to celebrate a special occasion and in possession of credit card points, I recentl","useful":10,"cool":6},"ADoDioNK8beTc6HR1fP9GA":{"text":"The hotel was well located, and the rooms were nice.  The only major issue is WE WERE ROBB","useful":3,"cool":1},"Tq6gkA1Uu1i9GPOuyjHnsQ":{"text":"This is a great hotel with great service. Our room was very large. I went with my mom so w","useful":1,"cool":0},"Tx-EOjtBKQNJxuIjWsYogw":{"text":"It doesn't get any better than this!  Stayed here for 5 days in March.  Did not want to le","useful":0,"cool":0},"shoZ-ZGKUIlDac3JGbVDtQ":{"text":"On January 2, 2015 your door guy helped us grab a cab.   It might not be super significant","useful":0,"cool":0},"kX4n4BuFXdrhsHEWUrAtrw":{"text":"Outstanding quick weekend trip, stellar service!\nThe Doorman offer outstanding dining advi","useful":0,"cool":0},"mzNwrCdAiycoHK9hRvBCtA":{"text":"I stayed at the Roosevelt during my recent business trip to New Orleans. Such a beautiful ","useful":1,"cool":0},"7oE1zRoNMyCyVJFNO3K8PA":{"text":"We got a good deal on our room from hotels.com. It's beautiful with its huge crystal chand","useful":0,"cool":0},"sS9AhD9YVn0ZTpz6EyuiZQ":{"text":"I want to start by saying it seemed like I stayed at the Roosevelt during a really busy we","useful":2,"cool":0},"al6sHz1E1fsmoCMTSDlAwg":{"text":"Great location, great service and wonderful amenities. It's hard not to like a place that ","useful":1,"cool":2},"4ujIfYOOshES1VK53kddfQ":{"text":"This is a lovely old hotel in a fairly central location. The concierge is the best in the ","useful":4,"cool":1},"zN7vyUVMsDwCM4CQbTrE4A":{"text":"Absolutely gorgeous hotel in the heart of New Orleans. Just a block away from Bourbon stre","useful":0,"cool":1},"bEYLPINoHu1nR9gzK74MiA":{"text":"I stayed here over the weekend of 01/21/12.  What a beautiful hotel.  This is what a hotel","useful":0,"cool":0},"PDsYmULis-k6tfFeaRkdRg":{"text":"We are owners of a small award winning inn located in Woodstock VT and when we travel we d","useful":2,"cool":2},"KU0XnC_iV4KizVn1yygUaQ":{"text":"Beautiful hotel, great staff, the absolute southern hospitality from waitresses at the bar","useful":2,"cool":3},"Onwdxij5KGLRn4QDH5W0BQ":{"text":"Stayed here for one night will passing through from Florida to Texas.\n\nWhat can I say.....","useful":0,"cool":0},"v4nJqkaHKI7xghxTycpLxA":{"text":"Truly a perfect place to spend a special occasion - we stayed in a suite to celebrate our ","useful":1,"cool":0},"GBkMPenMspltD1U7LTcINQ":{"text":"Made the trip as part of our 10 year anniversary celebration. There was much to celebrate ","useful":2,"cool":2},"3rEUoLejLu9iI62GkaHyAw":{"text":"I had a reservation problem with the restaurant here.  When the restaurant manager wouldn'","useful":1,"cool":0},"lPvcu0daAvfQMq3xdThTqQ":{"text":"How rude can one hotel be. \nActually they were very nice in person, but not accommodating ","useful":0,"cool":0},"_dLrYqS4_SI00uOMIeP80A":{"text":"Great service, very classic hotel and elegant rooms.  The hotel is at a perfect location, ","useful":2,"cool":0},"ypMwbxx6rdxGk4gDY5sqwQ":{"text":"I had a wonderful stay at The Roosevelt. It's everything you'd expect from a Waldorf Astor","useful":2,"cool":2},"NmIDxVZdM45UEUW3fI9mow":{"text":"Stayed here for 5 days during the course of a business conference.  Upon arrival, initial ","useful":1,"cool":0},"FGM5YWwP4zCHXQxYqph8DQ":{"text":"The Roosevelt is an elegant and grand old-school hotel.  As soon as you step through the r","useful":2,"cool":0},"FE0J7AEZOzMVdANCUcZN3g":{"text":"Great location, nice bed, friendly staff.  The room was small and a bit overdone, but othe","useful":0,"cool":0},"1qpB8nyVo6_RKKlsADfsBw":{"text":"First of all, I know it is only August, but Teddy Bar tea party for kids during Christmas ","useful":1,"cool":2},"6-qmI6UtVnd5Rs7jIL_STA":{"text":"Stayed here during a business trip:  AAO (American Academy of Ophthalmologists) 2013.  \n\nT","useful":0,"cool":0},"I_-wECmSyZ9a00OQPGduAA":{"text":"Beautiful hotel! My husband had a conference in New Orleans, and I came along with him. Th","useful":1,"cool":0},"dm9xiDNTVQ2Mz3xUfc2WJg":{"text":"Wow! What a nice hotel! From the main entrance to the lobby, it's gorgeous... My room is p","useful":6,"cool":3},"YF2aP9LxU90pplIRGtKRgQ":{"text":"Ok, so it's a little pricey. But it's really worth it. Centrally located near everything y","useful":0,"cool":0},"COcuJSfBIMiNKI-WtQvusA":{"text":"This hotel was great in every way.\n\nLobby is beautiful and exudes elegance and class witho","useful":0,"cool":0},"13lA54nOpEsGkNlaB5GsOA":{"text":"The Roosevelt Hotel deserves five stars for if nothing else, the history! From Sinatra, Ho","useful":1,"cool":0},"M0KXipj3AqUVJLZapFa78A":{"text":"This place is amazing during Christmas time! The decorations inside and out impressed me l","useful":0,"cool":0},"DcGsdZ7UM2xIO3BbUIlHAg":{"text":"The hotel is beautiful.  I spend 60% of the time on the road and always use Hilton propert","useful":2,"cool":0},"wuCEAqDunVcrhw8GNiymWQ":{"text":"I had the pleasure of spending many, many nights at the Roosevelt during my year-long comm","useful":1,"cool":0},"xXwCoaRNUyZVd29NLXG2Gw":{"text":"Definitely not worth $408 + tax per night! Should have stayed somewhere cheaper that proba","useful":0,"cool":0},"tpFJ0EoqzAqafVq1SQXaCA":{"text":"First, every staff member is friendly, professional, and helpful- yet not overbearing or j","useful":0,"cool":0},"f-7rTlSTajo0En-hdsWG1g":{"text":"Very nice place. Great food service for meetings, however, the meeting space is like a lab","useful":0,"cool":0},"bA94OcCouGWY99QDsSxNJA":{"text":"Fantastic, historic hotel in a great location.  But what stood out for me was the friendly","useful":0,"cool":0},"uS4sLAyAuNCq2ydTVctFqA":{"text":"I struggled with the reservations process. But the hotel is in an EXCELLENT location. Staf","useful":0,"cool":0},"9bpCgM4MurUqbIuYesU5RQ":{"text":"This hotel is beautiful and has excellent service.  I highly recommend checking out the Sa","useful":0,"cool":0},"w2iYTAfPiIuG6G2Ys46ejQ":{"text":"Great hotel, had a King suite for my wife and I.  I had forgotten some items in my room an","useful":2,"cool":0},"axOe624QBOU6KVn5JowBow":{"text":"Nice hotel with a friendly staff, lots of on-site options for food, drink, coffee...and a ","useful":0,"cool":0},"jLGEr3Z41_WzJDOX0jRjog":{"text":"Downside is you have to walk across Canal Street to get to the Quarter.   Last time we wal","useful":0,"cool":0},"gAC8cG28pjIsLVEH2OHH6A":{"text":"Beautiful holiday lights. It's just a short walk from Bourbon Street. Glad I caught a news","useful":0,"cool":0},"WiKpNHMSbFGOKW6ODbpw6w":{"text":"Gorgeous Hotel with very helpful staff! I went on my annual trip with my best friend to Ne","useful":0,"cool":0},"uOKCkNb2HdPcIY_IugBp8A":{"text":"Oh, Roosevelt. I have a feeling you are usually a pretty nice hotel. But you just dropped ","useful":7,"cool":2},"mKqVSk9PA3g-247ABMPaYQ":{"text":"Very nice accommodations!  The rooms were very nice, with comfortable beds, and an excelle","useful":0,"cool":0},"77CdOIHZHbxM9OM7RVV2Cw":{"text":"Randy, the doorman,  was really helpful to my wife. He made excellent suggestions whenever","useful":0,"cool":0},"tXwah55K6buiDDstLVBFbA":{"text":"Gorgeous, but since we did not stay as guests , we could not access hotel rooftop bar and ","useful":0,"cool":0},"CoYJ-GPyueDPnp91fmPu9A":{"text":"Stayed there for the first time this weekend. The rooms are a little small but very plush ","useful":0,"cool":0},"8LeHQarscG0WvDldohjptA":{"text":"We were traveling from Phoenix to New Orleans, staying at a Hilton Group Hotel every night","useful":0,"cool":0},"iKJd2VgyeXZtsK0A-oHmeA":{"text":"Nice hotel but terrible room service 1hr 30 minutes and chicken not done frozen hard could","useful":0,"cool":0},"7J75f79pKeoXrNNFuJw_7Q":{"text":"Clean. Great staff. Lovely rooms. Spacious bathrooms. Overall great hotel!!! Will stay her","useful":0,"cool":0},"BIfdksfAWC-PoX_Tq5cmZQ":{"text":"The hotel is beautiful and everyone there is very accommodating. However, I do not recomme","useful":2,"cool":0},"BOOSAelEaM0R84zbTwQ7JA":{"text":"Christmas lights are absolutely beautiful... see my photo!\n\nRoom was very nice and the ser","useful":0,"cool":1},"pqPF-m_4kABU0tDcRCBWBQ":{"text":"Such a gorgeous place! Had a wonderful experience and would return. Crowd was pretentious ","useful":0,"cool":0},"KAeQeDwTjHxcn-rXoFJ3vg":{"text":"As the coordinator for our annual staff meeting, and having been in charge of this task fo","useful":0,"cool":0},"K2CLu6gN6r8nJyviTMNTNg":{"text":"This is one of the best hotels in New Orleans and is home to fantastic pieces of NOLA hist","useful":2,"cool":2},"1_iHnqd5fVUDiyHSpfy4Wg":{"text":"We stayed here on a recent stay to NOLA and it was GREAT!!!  Very nice hotel and rooms. It","useful":0,"cool":0},"EdR2cMO2R39qaEdqdd4QWw":{"text":"Stayed here recently with the WIF........ very nice hotel...... very expensive...... was w","useful":1,"cool":0},"UfwU7Lc3RwnwUwzev3RfSA":{"text":"Excellent service great facilities \nPerfect location and not unreasonable prices\nIf you li","useful":0,"cool":0},"f00FzD84m4_-gBMdSvFCLQ":{"text":"Our hotel room smelled like raw sewage. We had to move rooms due to the smells. Everyone s","useful":0,"cool":0},"uU7FEPQyQZBCK8kASywmRg":{"text":"Wow! This is one of the nicest hotels I've ever stayed at and if was an incredible stay fr","useful":0,"cool":0},"xSD0bh1XW9h14Cvf_vM4dQ":{"text":"When I travel throughout the world, one of the hotel brands I have grown to trust for exce","useful":2,"cool":0},"srjkyQXq8ru_R4euE4ZufA":{"text":"The Roosevelt is awesome!! Everyone is very friendly and helpful from valet, front desk to","useful":0,"cool":0},"EW8r8rvDuU12fUeRrROutQ":{"text":"Our group of 6 women just spent a weekend here. First the location is excellent - close en","useful":0,"cool":0},"ynjGwJ1OIufoNamG_RzBwg":{"text":"Amazing architecture - check. \n\nImpeccable service - check. \n\nTurn down service - check. \n","useful":4,"cool":4},"nPUnaQALmc3ER1YZ7yn8sw":{"text":"-  Overprice for the value!!!\n- Stayed in a suite . . . Needs a \"refresh\"\n- Wasted room sp","useful":2,"cool":0},"-g77JnND1-y6CxDxXRry3g":{"text":"So, hotel is beautiful, rooms are clean, and the customer service desk is wonderful. Howev","useful":0,"cool":0},"NlMtncYlw9j_uLBot7ipcg":{"text":"I accompanied my husband to New Orleans for a 3 day convention.\n\nWe originally checked int","useful":3,"cool":0},"wALusWedmFAIATDemopyGQ":{"text":"Regal lobby, hospitable staff & underwhelming rooms.\n\nThe lobby was very \"old-New Orleans ","useful":0,"cool":0},"RGdrX4FPGxwRs7yV2l-Jdg":{"text":"I was lucky to get a room here a few months ago during a slower tourism period for NOLA. T","useful":0,"cool":0},"-YP2tHCOgrZJYKD5yGvEAw":{"text":"Stayed here as part of a group over Halloween and overall, was quite impressed by the hote","useful":1,"cool":1},"RaX005d_p4sRTOexADx6yQ":{"text":"A lovely stay... with a few glitches. \n\nGiven a suite with 1.5 bathrooms, which was defini","useful":3,"cool":2},"hiB01shfb2lLeRqGrTJ-Ag":{"text":"I have never stayed here - I probably couldn't afford it. But I work near here and during ","useful":0,"cool":0},"qZ7OkOMIZNABvxOfGGVlJA":{"text":"An old beautiful hotel in the heart of downtown New Orleans. Very close to the French Quar","useful":0,"cool":1},"Vle6ozfTtM_aIdvyDgNWFQ":{"text":"We stayed at The Roosevelt while it was very hot in New Orleans. The staff by the pool was","useful":0,"cool":0},"-RgNJ1OEfy4vmUt5y9JezQ":{"text":"Excellent service! Friendly staff, clean room, beautiful historical hotel! Will return and","useful":1,"cool":1},"KXOU4RAK840s3wlq0Uxz-A":{"text":"Pros: Beautiful and glamorous. Courteous staff. The room was clean and well stocked. The b","useful":1,"cool":0},"QIxD6atvyJCf2v0SziNHDw":{"text":"I love the history of this hotel.  The lobby and bar are stunning.  It's a good location w","useful":0,"cool":0},"PxYxS4l1liDLwVJHi1DP1w":{"text":"Prior to moving to New Orleans this summer, I stayed at most of the Hilton Family properti","useful":4,"cool":1},"FT2SrcNwRVOs9HB5fwkP5g":{"text":"Centrally located historic hotel within an easy walk to the French Quarter and St. Charles","useful":0,"cool":0},"KWvPPqpYbtoxZctxauuiYg":{"text":"I recently stayed at the Roosevelt (Waldorf Astoria) for four nights. My room was a suite ","useful":2,"cool":0},"qSX0T5bYP9c5nqD0R3oYaw":{"text":"This luxury hotel is a gem in the heart of New Orleans. The atmosphere, the decor & the se","useful":0,"cool":0},"l4UUMKqmfVvX_MtGfKeWnw":{"text":"Spent a Valentine's night at this cool historic hotel.  They upgraded us to a one bedroom ","useful":1,"cool":0},"RG0ZsRmh_vY-5mm1O0PuRw":{"text":"This was my first time staying at this hotel... I booked the king bedroom suite! It was ve","useful":0,"cool":0},"sOxANuVXgYFnkAUUlF2YXA":{"text":"What a beautiful hotel! First impression will leave you in the lobby taking pictures for y","useful":0,"cool":0},"3FaPyU9y8WtCoWMzHjlyxw":{"text":"Far below expectations. I had an issue with my room that I called the front desk about 3 t","useful":1,"cool":0},"TeeznuCvxKFw4tivWH6AHQ":{"text":"When it comes to first class with Hilton hotels, Waldorf Astoria is the name you think of.","useful":8,"cool":0},"BU1d-uNYeTsxsNC3KWyjaw":{"text":"My cousins and I were at the Sazerac Bar to celebrate my birthday and I was telling a stor","useful":1,"cool":1},"0_hbGpxf3YeiaoP59gbAXw":{"text":"Nice property for the holidays in terms of appearance but over and over I addressed issues","useful":1,"cool":0},"eG7eZhDwBCqtkW-1R2L28Q":{"text":"Even though I've never stayed here, the Roosevelt Hotel is truly exquisite in terms of dec","useful":0,"cool":0},"7NjrgPBY-ETJdZH6W1j5Jw":{"text":"If I could give it no stars that would be my choice. Customer service is terrible. They pu","useful":3,"cool":0},"uJy7T9Diid1-8hQHjS5yXw":{"text":"Ok, have not stayed yet, but will be here \nover Christmas! So far, the help by phone has b","useful":0,"cool":0},"ibkbSgmGbEDDUGzLjnXrLQ":{"text":"This is a hotel steeped in local history and now owned by Hilton, which has labeled it a W","useful":2,"cool":0},"3n5BpIAdJPgrOUDxoVsnMQ":{"text":"Not real happy  have heard so much about this hotel but when I asked for a fan, I need it ","useful":0,"cool":0},"7FWyotis035ToPSiVUsI_A":{"text":"READ THIS REVIEW!!!\n\nMy partner and I stayed at the Roosevelt from 2/21/13 through 2/24/13","useful":0,"cool":3},"ctDU1RTkR4nsSWnlkgh4aw":{"text":"Beautiful hotel and very friendly staff. Room was beautiful, clean, quiet with a very comf","useful":0,"cool":0},"aCILIUB2sM8XZLztM5qhxA":{"text":"In New Orleans on a business trip, I got to stay at this RIDICULOUSLY AMAZING hotel.  This","useful":3,"cool":2},"7o2pvsUP5Sqm2qvECZyoJA":{"text":"When you select a Waldorf Astoria property, you expect to find beautiful tile, tasteful an","useful":0,"cool":0},"bzB4wQiAfICojSJz35gKew":{"text":"The hotel was comfortable, clean, and conveniently located. I'm not sure how it compares t","useful":0,"cool":0},"EihFl5NdOyBqkAkRz4qv1g":{"text":"I want to like this place, I want to love it, but it misses in some pretty big areas... Th","useful":0,"cool":0},"7oM5qbUKsRJgytgF8FpB6w":{"text":"Beautiful hotel, but service was not up to par for a hotel of this standard. Our rental ca","useful":2,"cool":0},"AAT9PWnnpI8vtf-jGO63NQ":{"text":"So happy that we stayed at this hotel! I have nothing but great things to say. The staff w","useful":0,"cool":1},"qcGVr0ug3J2VRgng8kafeQ":{"text":"TV and phone in the restroom. . . Fancy. Huge and comfortable bed. Large shower and clean ","useful":0,"cool":0},"vjjS9I9im445nXOu2pXmbw":{"text":"Staff is fantastic from the bellman who greets you to the housekeeping team that keeps thi","useful":0,"cool":0},"AUuOgAHPR30h-o3C585W3g":{"text":"Nice hotel and antique decor. Rooms are on the smaller side. Very European flare which is ","useful":0,"cool":0},"0S4dSTbdzMN4NMU-VKQc-w":{"text":"I've waited a long time to review the Roosevelt. While I have never stayed here, I have be","useful":3,"cool":3},"AZCxAzXnsiUKNXf5kj434g":{"text":"This place is gorgeous and right at the beginning of the French quarter in downtown New Or","useful":0,"cool":0},"7jX0k7CMh6GIWJ7yfQv1NQ":{"text":"Really nice and renovated inside and they saved that luxury and old fashioned look inside.","useful":0,"cool":0},"QwPVhviFmibaoFxI0BZk8g":{"text":"I was recently in New Orleans for a conference which was taking place at this hotel. I rea","useful":0,"cool":0},"e1cPaLepJvuDuYK-I3kgmg":{"text":"I have stayed in a number of other high-end competitor hotels in the french quarter, but t","useful":0,"cool":0},"HlBIUVmTyZtuKV1Zg6HJ2Q":{"text":"Great location for mardi gras! Close to parade route and to bourbon street but not too clo","useful":0,"cool":0},"EY6vgWAe31iKixqAmfxTbA":{"text":"On June 18th, my now wife and I were married at the poolside of the Roosevelt Hotel.  We c","useful":2,"cool":2},"3Xtn153t7iQoGtWaGdGJmw":{"text":"CLASSIC NOLA MEETS CHIC!\n\nLove this property! One of my favorite hotels in New Orleans.  C","useful":0,"cool":0},"P-8KhvtBIyoAYVyIyCccww":{"text":"I have stayed at the Roosevelt twice now.  The pros definitely outweigh the few cons. \n\nPr","useful":1,"cool":0},"K9DirNo8WEBtCrLvDoJGrA":{"text":"Great people watching. Came here two days after Christmas on a Tuesday great champagne pri","useful":1,"cool":0},"KcMLa8JJon3g3B_UYjl-gg":{"text":"This place is the quintessential opulent southern hotel. The staff are courteous, helpful,","useful":0,"cool":0},"YXDMfSuHX9LdcMWKinDqdw":{"text":"A. W. E. S. O. M. E.\n\nZero complaints.  This hotel does good justice to the Waldorf Astori","useful":0,"cool":0},"ex8mVjFvzgqNNE60o-f5aw":{"text":"I was there for just 2 nights, and I have to say I was surprised with my experience.  For ","useful":3,"cool":0},"sQSrtsCX90Q7MBkS4aFB9Q":{"text":"A beautiful hotel in a great location to see all the sights. The lobby during the Christma","useful":3,"cool":1},"Ft6-Te45PNjas0afm9S7vQ":{"text":"Thanks for always making it personal, Roosevelt!\n\nThis place always wins my heart with eve","useful":1,"cool":1},"ML9IA6NphJLw30OwxAf09w":{"text":"Ok, so I only have two hotel experiences in NoLa: the Royal Sonesta and the Roosevelt. Let","useful":5,"cool":2},"Ai4rFERbC0shDZ3IdowShA":{"text":"This is a beautiful hotel with superb customer service.  Because we are diamond members we","useful":1,"cool":0},"otVevWNDTSpatFISjpcr-Q":{"text":"Very nice hotel, bed was comfy but to soft for my taste. Nice gym with free wts. Could imp","useful":0,"cool":0},"t_YmBcs0z_McNfsuzhia5A":{"text":"Loved staying here!  Beautiful lobby and very nice rooms.  Staff is friendly and welcoming","useful":0,"cool":0},"Y1trY89Tbqf1ZVozse0lNA":{"text":"Gorgeous hotel with tons of charming historic details.  VERY conveniently located in the F","useful":0,"cool":0},"DO9buzGrFFLfO4iqLyeGoQ":{"text":"This is a great place to stay in New Orleans if is just 2 minutes away from Bourbon street","useful":0,"cool":0},"sHNX7vshlPSnV2NwrpLWqg":{"text":"This hotel was awesome. I realize it is higher-end hotel, so you expect better, but even t","useful":0,"cool":0},"PwjbpqJwbl4nxEk8tW3xWw":{"text":"I love The Roosevelt. Everything about this place is incredible. The rooms are nice and sp","useful":0,"cool":0},"nwMb10B9wwcgG_BQLlOB1A":{"text":"We stopped in for a cocktail - loved the historic ambiance but disliked the crowd and the ","useful":1,"cool":0},"vhTRdvS1IKm6G6qmWr_Xkw":{"text":"The Roosevelt is a gorgeous hotel in a great location for visiting New Orleans.  Just a bl","useful":4,"cool":0},"J9TUg_1Ls6hK3W_XMccIHw":{"text":"Stayed here over jazzfest. \n\nThe property is beautiful with an old school grand lobby.  Ch","useful":0,"cool":0},"jpF4GLlPV5OGd3Z8FPlWIw":{"text":"\"I would have done 5 stars if it was not for paying $43 for parking. Other than that this ","useful":2,"cool":0},"UpHZvSY-By0tqmQP9i1jkg":{"text":"Luxurious hotel, and worth the price. Perfect location, comfortable rooms, clean, great se","useful":0,"cool":0},"ZGAdDhj7U2i8jJE44UU7FQ":{"text":"Beautiful hotel,wonderful service!! Very elegant. The drinks from the bar were awesome!! W","useful":0,"cool":1},"fkAjn9ILdcv9RSVyI6KG5w":{"text":"Thank you for the outstanding services provided by Marco front desk, Bellman, Elaine Direc","useful":0,"cool":0},"WtAp7v8eyFAyc4mOcULg3w":{"text":"At spa. Doesn't beat regular mani/pedis at Isle PediSpa Houston. But will do in a pinch.","useful":0,"cool":0},"nC4jiDbU4Tinys-bUAaFUw":{"text":"Pure excitement and enjoyment.  LA residence receive a local discount! Definitely recommen","useful":0,"cool":0},"KyfD0OU9MjwBVtK2Pbs_qQ":{"text":"This is one of my favorite hotels in New Orleans. It's beautiful! When you walk in the lob","useful":0,"cool":0},"1mMcmkX27Dt5wQrNI5gRbw":{"text":"We were honeymooning, so we got a luxury suite. My wife claims it was bigger than our hous","useful":1,"cool":0},"VOW7eK86wYoi1ONiIU2XZg":{"text":"Awesome hotel. Great location and a short walk to French Quarter. Two hours late leaving s","useful":0,"cool":0},"il79TIaAH8FtQW3DQNgLMA":{"text":"Stunning lobby with a 1920's feel. The rooms were beautiful and the bed super comfy! Enjoy","useful":0,"cool":0},"pPG57ianfufDxn9ikFpESQ":{"text":"Ok,\nSo my mom chose this hotel bc she said it was really nice . When we arrived we really ","useful":1,"cool":0},"esIgVGhtkawdi9gHdDoq0A":{"text":"Was there for a convention. The rooms are really comfy, the lobby is beautiful, and most o","useful":0,"cool":0},"FxTLRsliIVq_3JkCUTlX2Q":{"text":"First class all the way. Spacious, well maintained, comfortable rooms. Hotel staff are fri","useful":0,"cool":0},"rR5VIgwNATZSByuDQIb3ow":{"text":"Extremely helpful staff.\nTurndown service in the evening (nice!).\n4 shower-heads (wow!)\nRi","useful":0,"cool":0},"WmVgjaZQcna71OXoVRhnqA":{"text":"De-e-e-cent.  Dank place (for the age), great location, and roof top bar gives it the \"5th","useful":0,"cool":0},"UVOOk6P09gUn2kCa4WfEYQ":{"text":"Recommend. 4+ Stars. Lobby is elegant, front desk personnel are friendly and efficient. Ro","useful":0,"cool":0},"26zpFm275CLJeEDldhODCw":{"text":"We chose the Waldorf Astoria Roosevelt Hotel as part of our anniversary celebration. \n\nThe","useful":0,"cool":1},"Gs3gPiFaKsv2tCvPFQY2wg":{"text":"While I've been here a few times I've never spent the night, only for conferences and in t","useful":0,"cool":0},"pZAcvrmcGEFlyMOu8lTBSQ":{"text":"Beautiful hotel and very comfortable room.  We had a TINY room that should almost be too s","useful":2,"cool":0},"fW5CP10yPzXDtPXJ2PlN8w":{"text":"A grand, elegant historic hotel with all the bells and whistles of pampering and service. ","useful":0,"cool":0},"k7PZ4aLUiC8mrDZ7Wd2rIw":{"text":"Waldorf-Astoria, also known as the Roosevelt hotel is located in the heart of downtown New","useful":4,"cool":1},"EPytUWwxPUsivgRssDWgfQ":{"text":"Gorgeous renovation of the Fairmont!\n\nThe lobby, the huge crystal chandeliers, the graciou","useful":0,"cool":0},"1kjrpZRZ3PJRA0iNavxS6w":{"text":"Beautiful old and historic one or two blocks from the famed Bourbon street. Looks like it'","useful":1,"cool":1},"11n5QTWzlpopfX7DlK771g":{"text":"Truly a beautiful hotel, with unique rooms, friendly service, good restaurants, convenient","useful":1,"cool":0},"n1HDjqYXIJEV9wGixUojhw":{"text":"Okay, I didn't stay here, but we were told to come here just to see the Christmas decorati","useful":0,"cool":1},"H7Oap8UVZy9MfQvjC1ekuA":{"text":"So far, this has been the best overall hotel experience I've had in my many, many stays in","useful":4,"cool":5},"kRq52TVthnEW4R3GeXyXSg":{"text":"The beds are amazing for a hotel!  I have a bad back so I this is important to me.  The se","useful":0,"cool":0},"BfNyMsm8u5Cvsy5q4B_AHg":{"text":"This hotel is iconic! You will feel like you stepped back in time as soon as you enter the","useful":2,"cool":1},"85zIkpNCinH8wYQSrdRnTg":{"text":"Valet was complicated and backed up.   \n\nCheck in line was long.  \n\nWe are Hilton honors m","useful":1,"cool":1},"JocuJ8XXPgwEYWw47z1Srw":{"text":"I so my wife and I wanted to give this hotel a 5 star we really did. The service was frien","useful":0,"cool":0},"U3pEFD5uEoGEck5Ct-jHlg":{"text":"This is a beautiful hotel.  We used reward certificates for our stay so I can't really com","useful":0,"cool":0},"5xeAQ6Rw2lWwM7lv82Qnmw":{"text":"Stopped in here several times for a drink while staying at the hotel over the weekend.  Gr","useful":0,"cool":0},"6AJDvBHCllWer6MfvN_l3w":{"text":"Beautiful hotel with great service and ambiance.\nStop by the SaZerac bar.\nRooms on the sma","useful":0,"cool":0},"a6R0OZssK1CFxTC-c1YnNQ":{"text":"Amazing hotel, perfect location! It is across from the French quarter...which is a GOOD th","useful":0,"cool":0},"BdfnhDyVP8Nvif4bJFzNBg":{"text":"OMG your guys, THERE WAS BLOOD ON MY SHEETS!!!!! Ok, let me start at the beginning, BEAUTI","useful":2,"cool":0},"jQZnSdP7mzLxzlTUn5F3jg":{"text":"Average hotel. Don't be fooled by the Waldorf stamp; I believe the Ritz is better and beha","useful":5,"cool":0},"xvRUWEND7CM2N1SMD7907w":{"text":"The Roosevelt Hotel is a magical place. It's like being transported to another life, one w","useful":7,"cool":6},"ozwE4SiYmrZLOArpVZyMMQ":{"text":"The Roosevelt is a beautiful, historic hotel, one that I can't recommend more highly. My w","useful":0,"cool":0},"d9qo-uAsWVDQtFg-hPD74A":{"text":"How lucky am I to stay here this Mardi Gras season!?!?!\n\nThe hotel was so luxurious, so cl","useful":1,"cool":2},"MzvJIGqebfakSzT-o3xZ2g":{"text":"Beautiful hotel.  Very fancy.  The room was well-appointed and  comfortable.  Quiet.  Help","useful":0,"cool":0},"uzgcclX5gIU0C_mW5c6n8g":{"text":"While the Roosevelt Hotel New Orleans has a beautiful, charming old world ambience,  it's ","useful":1,"cool":0},"vAHtP2-9g69iA8QKxGjxog":{"text":"This is a really lovely hotel.  Totally renovated with modern luxury amenities.  Although ","useful":0,"cool":0},"ehYcNWqTr23jAZK_2eKTOg":{"text":"Beautiful property in a great location. The superior room was large and had a beautiful vi","useful":0,"cool":0},"u3z3sok9mDWVaj1ZKgNc1w":{"text":"Great hotel, very nice accommodations.  What do I mean?   I was in town for a work \"Achiev","useful":0,"cool":0},"DJhKmzOHmU7fNscHVt5r9Q":{"text":"I really want to give this hotel five stars. It should be five stars, but the only downsid","useful":1,"cool":0},"SBke2Ycfqtpw7fzd4vJw_Q":{"text":"We've stayed here before & it is a nice hotel but not really up to the Waldorf standards.\n","useful":4,"cool":1},"VU-LlIfU_OZkan6H0-EP_A":{"text":"This place is no joke. It felt like i was in a museum or on the set of a 20's gangster mov","useful":0,"cool":0},"rzEOA6XuXn4BbP86IelbEg":{"text":"This is my favorite hotel in New Orleans.\nThe service is top notch from the valet, to chec","useful":0,"cool":0},"vxT-t0-1FXRnkR7ar9t5Sw":{"text":"I've stayed here numerous times and it has become my second home. I love the weekend doorm","useful":0,"cool":0},"6s5dcrTqBWTfGBPwK-CPPg":{"text":"Favorite hotel in NOLA. We only stayed one night since the rest of our stay was at the Wes","useful":0,"cool":0},"iNWnMEIjWknIZStow81_0Q":{"text":"This was a fantastic hotel to stay at, it is very nice and clean but still has an old styl","useful":0,"cool":1},"qi8P3EgW3MH41mY6TyHLVA":{"text":"One of the best hotels I have stayed at in all aspects. \n\nLast time in we were upgraded to","useful":2,"cool":0},"69nN7Hzmsjeg4o7GdwfO5g":{"text":"Did a prior review, hotel is beautiful... especially when decorated for the holidays. Had ","useful":0,"cool":0},"T0_aHUGJ-6Co7znxleK3hQ":{"text":"Great old school rooms in a great location of the city for catching mardi gras parades on ","useful":2,"cool":1},"qeG3AGZJ2IMpi0M1FSIVkg":{"text":"Absolutely beautiful - but the sazerac bar just...I'm disappointed with it.\n\nThe Roosevelt","useful":1,"cool":0},"AfO_MTCjsludSFG7iXjzFg":{"text":"I have staid at the Roosevelt 2 times in the last month and a half. I find the accommodati","useful":0,"cool":0},"8VChkZLy-jPSqCdlHp8BSA":{"text":"A quick bit of background . . . usually Lynn and I stay at the International House.  Indee","useful":9,"cool":3},"X2Hl1A5Z3QGRqq07hPna6w":{"text":"Stayed for 3 days at the beginning of December. Walking into the hotel was like walking in","useful":0,"cool":0},"45bSwnMNQZZa2F-uayAyDg":{"text":"5 stars for a 5 star hotel indeed.  I expected nothing less from a Waldrof hotel Checked i","useful":1,"cool":1},"6DjdzLIGZkt2N137b-CscA":{"text":"Stayed two nights. Beautiful property. Attentive staff. Superb king size room with separat","useful":1,"cool":0},"iZwEV0VC9LlJSrmo_h6fQA":{"text":"I have to admit I am in love with hotel. The rooms are always clean the staff is  very nic","useful":0,"cool":0},"ohLfw35beJSM19e2M2pzCA":{"text":"I am enjoying my stay here. Turn down service each night is awesome. Rooms are clean and v","useful":0,"cool":0},"RcTmWjrLyzTLIrKpVmntVA":{"text":"Heaven. I'm in Art Deco Heaven! Stepping into the lobby is almost like stepping back in ti","useful":0,"cool":0},"8cBJ0xHVpBNcc3vXrQeVXA":{"text":"Hilton customer service once again disappoints royally a Diamond member.\n\nI booked 2 night","useful":4,"cool":0},"XILOxxJO8W7e7nLis4-BQQ":{"text":"Beautiful hotel, super clean, comfortable beds I love the sheets nice quality thread count","useful":1,"cool":0},"UFdBu5uxrVHIIR7wKd9coA":{"text":"Was lucky enough to stay at the Roosevelt during my last trip to New Orleans.  BEautiful g","useful":0,"cool":0},"rKHoBXxFe8qi1YKKtyF-2w":{"text":"This is a great hotel! Every thing that you would expect from WA! Pristine rooms, beautifu","useful":1,"cool":0},"eSabeB5IZlkWEiyYxY0YtQ":{"text":"I was happy to hear that Hilton bought this property and restored it - the classic charm o","useful":4,"cool":2},"srd4qPC7n_-9yB0cyS62Kw":{"text":"Oh yeah baby! This is a place to stay! Room service is incredible. Staff really cares abou","useful":0,"cool":0},"B22_wmyljEQvHs0KRmSRpg":{"text":"If I could give it 1/2 a star I would.   Hotel is ok in infrastructure, but the customer s","useful":2,"cool":0},"w3T-jxw6_xBoI2YTmUwfxQ":{"text":"The wife and I were here for the Essence Festival and I must say this hotel is 1st Class a","useful":0,"cool":0},"2_fAvAL66GaBQLDLGCG6Fw":{"text":"I want to give this place a 5-star review and look forward to giving it another opportunit","useful":6,"cool":1},"zSf6eOSstQTnY32ioAjjKQ":{"text":"I am thoroughly disappointed. My wife and I decided to splurge for our family vacation wit","useful":0,"cool":0},"zrbfAFhET2l9dlIgFU_5Gg":{"text":"I was so excited when I booked my stay at The Roosevelt for the beginning of February.  I'","useful":1,"cool":0},"6mvP51OswPkdkb1t1bJ1nA":{"text":"Stayed at the Roosevelt over x-mas week with my wife. The hotel has a lot to offer--old ch","useful":2,"cool":0},"EeEJA8aRZxr0WjEXxnbipA":{"text":"An amazing hotel with an amazing bar and a great restaurant. The Sazerac and Domimica (Joh","useful":1,"cool":0},"L_OoVWF-5lOTAtcD9O1NiQ":{"text":"The lobby is mesmerizing, This is an older style building but it has been given the Waldor","useful":1,"cool":1},"rspD73sRY3GR0Hi5jdA0rw":{"text":"The Roosevelt is a historic New Orleans hotel, and the Waldorf-Astoria brand has brought t","useful":0,"cool":0},"4lAxvQyLYlzhn1n1IY9OEA":{"text":"Good place for a conference. The hotel rooms were a little dark but the beds make up for i","useful":0,"cool":0},"hqxb9Sl4Wu6Kl9SQjgRkPA":{"text":"Great hotel in a great area. It's close to bourbon street close to the Mercedes Benz stadi","useful":0,"cool":0},"CvW4CJsyPRjB0q6nvDH4nQ":{"text":"The Roosevelt is a very nice classic hotel with a great historic vibe.  \n\nThe hotel remind","useful":0,"cool":0},"cciFEruIcVH1OpHMaWo8VA":{"text":"By far the best part of my trip to New Orleans was the Roosevelt Hotel. It starts with the","useful":0,"cool":0},"qBTRV2HHaAZHX6iC0Zr-Xg":{"text":"This place is amazing. I stayed here for a week and it was a really relaxing place. The ro","useful":1,"cool":0},"3Sn9gt2-zGWBL4y5FjSQKA":{"text":"Very nice for an older hotel in New Orleans. Rooms are small and shower was not functionin","useful":0,"cool":0},"w7a5QeZADPXjSp5xv6KOlw":{"text":"Beautiful hotel and very nice rooms. Everyone is very professional. Disappointed the room ","useful":1,"cool":1},"rMgU1vBrKdwmfwNoPx5kVw":{"text":"Excelent hotel, but the staff was not really 'close' and 'warm' as I expect from a Waldorf","useful":2,"cool":0},"T_d6Cj3clWfWPnHbb1u0Dw":{"text":"If the Waldorf Astoria and the DMV had a baby they could call it the Roosevelt Hotel. It i","useful":2,"cool":0},"J62KhkVqtDKGjtVRs0JgoQ":{"text":"Beautiful lobby decorations.  Great place for photos. The gingerbread house in front of Te","useful":0,"cool":0},"5SYD_iQ2K4Id1cgWA_lyCQ":{"text":"I love this hotel.  I love the history behind the hotel and everything in between.  The st","useful":0,"cool":0},"jRnl7WWiQ-t9xHXXvaFi0g":{"text":"I love this place. The architecture, the history, the decor, the bars, the 4th floor rooft","useful":0,"cool":0},"N8cVptaha7MxPAPiVGr4Jw":{"text":"My husband and I stayed here for our honeymoon. It's a gorgeous romantic hotel, and the ho","useful":1,"cool":0},"MOfx1DVhsnW6wX0IQRAi4w":{"text":"Since hotel is a Waldorf Astoria property, high expectations should be fulfilled across th","useful":0,"cool":0},"YueZo5rQrOEujA2Y33W9WQ":{"text":"Ate at the restaurant here (Domenico I think?) for a bachelorette party, and was very sati","useful":1,"cool":1},"RH2C4VVMBMdB2Kpi6apAnA":{"text":"As I, along with my growingly hungry stomach, wait for my boyfriend to groom himself (as w","useful":4,"cool":4},"IowDh1yVt6w1lwvkH1By1w":{"text":"This is a really beautiful hotel!  But like many hotels, it's sometimes the little things ","useful":0,"cool":0},"HUKPjh-0Hhu-vDtxaW2xCA":{"text":"Probably the worst hotel experience I've ever had. Definitely not worth the price, and wha","useful":3,"cool":0},"DEot44G8pE7J7iT9v0_eWQ":{"text":"Honestly did not love this hotel really at all. I hated the city itself but this hotel was","useful":2,"cool":0},"cTaOilG0CPtsdKJRLCP4Iw":{"text":"Would love to give 5 stars but the walls on the 12th floor are pretty thin and you can hea","useful":0,"cool":0},"c-AzqELIaORx5iD0d2ulZA":{"text":"We came here for the bar. Apparently the gin fizz and sazerac are their signature cocktail","useful":0,"cool":0},"gpGcQgIUWcw5K4d8Vor0sA":{"text":"This property is clean and inviting, its a rose among thorns... meaning the streets are ke","useful":0,"cool":0},"m5a-tpuxemrMrLk6BYVb5g":{"text":"The hotel is physically attractive as far as the architecture and decor but the pool was f","useful":1,"cool":1},"a1mO5NLR_pGl7WN7Kcs9Aw":{"text":"Low expectations because of reviews. Wow, what a delight! In town for a quick getaway with","useful":0,"cool":0},"rLclEIfybj97Pq3ZDJgkGw":{"text":"Now a Waldorf, they have done a beautiful job renovating and remodeling this historic hote","useful":1,"cool":0},"Cur1ZsOHhgSxoPu4rYMXxg":{"text":"An elegant hotel that seems iconic and must have some grand history in the city of New Orl","useful":0,"cool":0},"Pt1Lcazi6FlkKSTkZMJBaA":{"text":"The Roosevelt is a gorgeous hotel with a lot of history and old-fashioned New Orlean's cla","useful":0,"cool":0},"_XgJAXRX3Y7Xu2kA73IVqw":{"text":"I loved this hotel! The architecture is gorgeous inside! The front desk staff was fine. No","useful":0,"cool":0},"0l8wuzNx3zxIrVYR_NGqTA":{"text":"Walking through its grand lobby brought me back to the grand era of the old days. I love h","useful":3,"cool":1},"EsSI0bwGGERCQuOLuXflEg":{"text":"Roosevelt Hotel is a Waldorf Astoria property and is one of finest  restored properties in","useful":0,"cool":0},"GiSL8vUyUUXXCHjALFSAPA":{"text":"Most unique hotel I have stayed recently. Details of architecture and interior decors are ","useful":0,"cool":0},"rPlhKN3glSaxWpbHrj0mUQ":{"text":"First class all the way. Excellent service, comfortable beds, beautiful facility. Water pr","useful":0,"cool":0},"S1zDCIpd6Ao4CAgnR_Jm7A":{"text":"We came just to look at the lights and have a cocktail. It's so beautiful! We were very gr","useful":0,"cool":0},"0BQUmmAdH5lEhV2ZCpiPbA":{"text":"A wonderful hotel. Expensive, with full service and rooftop pool/pool bar. Dominica, a Bes","useful":0,"cool":0},"MQGpXSUh7j98FE5xs3e98g":{"text":"We always stay here..  My wife and I love the hotel.  One time we stayed there for a Saint","useful":1,"cool":0},"VgXdeCauXrBq9yTE4ris4w":{"text":"I wish I could say that I have stayed at the Roosevelt; instead I'm basing my update on my","useful":4,"cool":0},"HyJ0WbNT_D8hEDTrsz2JlA":{"text":"Arrived Christmas Day, 2019.  Previously stayed here about 7 yrs prior at Thanksgiving and","useful":1,"cool":0},"PZuP9U6q6-5vqR-tGuhXgQ":{"text":"After a lifetime of good memories of Christmas at the Roosevelt from childhood on, this ho","useful":0,"cool":0},"xNu9gOzQHqRvBFDDioVIrQ":{"text":"I didn't actually stay here, but we were waiting out front to be picked up by the Mardi Gr","useful":2,"cool":2},"Wykg6vkwgmKJ6DDVCzxrzA":{"text":"One of the best hotels in the city. If you are looking for an upscale hotel with a touch o","useful":4,"cool":1},"W4JMInXLRs6AgZnx2glIPA":{"text":"This is a Waldorf property and it lives up to the reputation! The hotel is beautiful and r","useful":0,"cool":1},"2R0cjC6w7NSDFz31fJSBpA":{"text":"The room was nice but kind of pricey. However, it was not clean. It didn't have enough tow","useful":0,"cool":0},"cLo8dbifji0tBbvYAu-gMA":{"text":"Stayed at The Roosevelt for my significant other's birthday. I expressed prior to my arriv","useful":2,"cool":3},"iB1QBWH1H19eQd9HTqDEmA":{"text":"Fine old fashion hotel service with a great staff. Location was great for walking..ok,,,,,","useful":0,"cool":0},"e28gMq0WRcq9geLW1Xj77w":{"text":"I'll preface this by saying I've lived in this magical city almost all my life & I've love","useful":0,"cool":0},"vpPXSjVPSwMTm1Qk_OP-jw":{"text":"My husband had traveled here for work in late October and surprised me with a short getawa","useful":0,"cool":0},"DV0NEjhNF74v5Nxjauq_pA":{"text":"What a great place! The staff there was nice and very warm welcoming! Room rate was reason","useful":0,"cool":0},"kTNl9lHIBggj9KzvpkAvYA":{"text":"This is a great hotel. The beds and pillows are comfy, the TV is big, and the rooms are qu","useful":1,"cool":0},"sxELlZP7udZV8Q-Y1m4urw":{"text":"Awful service. When we checked in, the room was still dirty from the previous guest. It th","useful":0,"cool":0},"u02AY9HHnGoxpV-N0B6qeQ":{"text":"I've only been at the hotel for two hours but it is not a good start. For $400+/night, the","useful":0,"cool":0},"7Sx57wT_C8XjECA1fqYRgg":{"text":"I ordered chocolate covered strawberries and a bottle of champagne to be delivered to my d","useful":3,"cool":1},"gasYWInpNZ-9iU1w9pi1zw":{"text":"Great for the money. Everything is new was a lot nicer than the W and it was the same pric","useful":0,"cool":0},"ZoyJMZwgX2HvikJbTbfGUw":{"text":"Been walking around with the family tasting different beignets and the ones here are by fa","useful":0,"cool":0},"smeHxgnU91IfHiukCvN5Ow":{"text":"Got to stay here last weekend on our girls trip to New Orleans.  The rooms were nice and t","useful":1,"cool":0},"E4kMZvMEOsPdT_UbJ8nrlA":{"text":"Stayed here for about a week.  The hotel is clean and safe, and the service is friendly.  ","useful":1,"cool":0},"466-jctNVt6aQsEhbkgMRg":{"text":"Great hotel....good service and big room.\nWe had one of the Waldorf suites for my two teen","useful":1,"cool":0},"n_EJTDF9C0ZIkAdeWsKu4Q":{"text":"This review is of the cocktail lounge. You'll take a step back in time when you visit this","useful":0,"cool":0},"c3cLBB3IMSmgHXcv-Oa58A":{"text":"Wow. Classic classy hotel in all of its fancy fanciness. It's wonderful to wander and ogle","useful":2,"cool":0},"wEGgOixk1oYCCDEznpvamg":{"text":"Poor. Poor. Poor. If your interested in staying at a five star hotel property, look elsewh","useful":0,"cool":0},"duA78Yqbj_hfApyNr64jeA":{"text":"Beautiful hotel! Wonderful service and very well maintained. Rooms are clean and beds are ","useful":1,"cool":0},"qUOiv9EdyanFf7_NQnFQ0g":{"text":"Many aspects to like here.  It is a historic hotel and you can feel it.  Some older hotels","useful":0,"cool":0},"kWXqR_59gxBScaRF9oRsow":{"text":"I stayed here with three friends last week for Mardi Gras.   It's conveniently located ste","useful":2,"cool":1},"SyP9NYub4yLyaqVCQxu0Og":{"text":"Truly a grand old dame of a hotel, that was updated back around 2006 and looks fantastic. ","useful":3,"cool":2},"gWael0SF9aO50dWq6VXw0A":{"text":"Top notch hotel with friendly, professional staff and excellent food. Jaida at the front d","useful":0,"cool":0},"4Iek4SzCo2KbMGwFQE2izQ":{"text":"We stayed at the Roosevelt for 2 nights in the Louis Armstrong presidential suite, room 14","useful":2,"cool":0},"BL-iJ_wYpDmKMkzC2vzMGg":{"text":"Friendly check-in, beautiful lobby, well appointed and spacious rooms, great bar - cannot ","useful":0,"cool":0},"ax-6aCNakJ_vX-5Kjy947A":{"text":"A beautiful hotel with crystal chandelers, mosaic tile, elegantly appointed upholstered fu","useful":3,"cool":2},"YGJs0yKdBjiS3scAO5lnrw":{"text":"Absolutely in love with the Roosevelt hotel in New Orleans. Having lived in New Orleans ma","useful":4,"cool":4},"S8_Sf2XWb3Q1fZ-euUn8kQ":{"text":"I have stayed here on multiple occasions. The location is wonderful. Easy enough to get tu","useful":0,"cool":0},"B_5u94zFpQpzZTp8_xpkfQ":{"text":"it can only get better from here -- arrived tired, dirty and cranky to be met by surly fro","useful":1,"cool":0},"DPTfmogEYGCWDD7gQqF-fA":{"text":"We just checked out the Roosevelt in New Orleans which is now our new favorite New Orleans","useful":2,"cool":0},"XUfC-TLYLoQVSGaJE5lhbg":{"text":"This hotel is nice, but certainly not luxurious as the management claims. Veronica Castro ","useful":1,"cool":0},"7fCXMNqvJZAz0TrZ1UX7qw":{"text":"Stayed here last week for a medical meeting. Rooms are very small. Bathroom is almost like","useful":3,"cool":0},"TubeeO85RO_Pd3N8x4S5dQ":{"text":"very hip in an old school sort of way. go to their italian restuarant for happy hour...hal","useful":0,"cool":0},"j1d2UpWti4HOGkp_TOtoBw":{"text":"The service for this level hotel is horrible - understaffed and painfully slow in restaura","useful":0,"cool":0},"o27oPC40kwbZrf4viPB75Q":{"text":"Incredible historic hotel with great staff and a fantastic location. This is what you expe","useful":0,"cool":0},"xwrJdiwbq8K2DcvVd42_nw":{"text":"Parmesan truffle fries.  \nOh, and the hotel experience was awesome too.\n\nImagine too weary","useful":0,"cool":0},"nwm8R_A7q-iq097BfDMapQ":{"text":"Beautiful rooms customer service spectacular. Food was very good. Hilton first class all w","useful":0,"cool":0},"3a5Ji_IERa6V1EBKy6hcqA":{"text":"The absolute worst hotel and horrendous customer service. I am currently staying at the ho","useful":0,"cool":0},"YrR44q-dtHAQH3ahFeWgpQ":{"text":"Beautiful hotel and decorate nicely for the holiday season. Very helpful serve. The only c","useful":0,"cool":0},"F2W2FcJWdkmoJESAhlm8zg":{"text":"Really nice hotel. The Christmas decorations were especially beautiful in the lobby and en","useful":0,"cool":0},"sSIZ1ZLihJP8jTLIY8vYFA":{"text":"I visited Friday for a conference. Absolutely wonderful hotel and great service. Staff is ","useful":3,"cool":0},"4G-fYIyVYQ_oL88Ng4VBjg":{"text":"Pretty good. It's on the 'other side' of Canal and this was the first time I had stayed on","useful":1,"cool":1},"aN0_EiVR01nJV2_aAgzs-Q":{"text":"Hat's off for superior customer service to Erica in the gift shop, Ken at the front desk, ","useful":0,"cool":0},"uryTinqP5AjfnUAUf7scqg":{"text":"I give it a three star\n1. The bathroom is not functional, it's very inconvenient spending ","useful":1,"cool":0},"xbn6JWTJye6T4VqC9jYTug":{"text":"Hands down, the nicest hotel in New Orleans.  My husband and I stayed here for 3 nights wh","useful":6,"cool":5},"ehx7iGN32zKv8o7KljEvHQ":{"text":"Old hotel, nice furnishings but rooms are small and be careful of location...we got stuck ","useful":0,"cool":0},"t69b6Q-Ao3sn3faPgUGZ_w":{"text":"A very nice hotel with super people working there.  The one thing we thought they could im","useful":0,"cool":0},"Psm7peIbOuTsm4ERjsZv_g":{"text":"The best hotel in New Orleans! Stayed here this past weekend for 3 nights. Upon check-in t","useful":0,"cool":0},"Y9cSXhRoqqkV60-Nk-b0QA":{"text":"Beautiful hotel within an easy walk of Bourbon Street & all the great things in the French","useful":0,"cool":0},"SvE5NOif8x3TwBT9H7gUQg":{"text":"I stayed here for three nights.  This is an older hotel that is very elegant in its appear","useful":5,"cool":0},"9rWTrP7y5UYWuWmZUnblPg":{"text":"Everything about The Roosevelt will take your breath away. Not only is the hotel stunning,","useful":0,"cool":0},"d-EM7e4BPERI24HghXPjYw":{"text":"This may be the worst service and employee attitude I have ever seen at a Hilton Hotel bra","useful":0,"cool":0},"Bp3pAcUEo52uaSSWXHUCcQ":{"text":"I love love love the spa especially Beryl.  She is incredible and the other staff in the s","useful":0,"cool":0},"tAbK4gSTe8NWCb6trM8J6Q":{"text":"This is a beautiful hotel but for $350 a night I really was expecting much better service\n","useful":12,"cool":3},"6tk86YvEg-kcsuQEezmUDg":{"text":"Fancy hotel with many connected bars in the same building. This place seems to get rented ","useful":0,"cool":1},"oJZcmkIF1P5u2RfOdzscFw":{"text":"A true 5 star, old luxury hotel. All staff - front desk, valet, Fountain Lounge, Teddy's, ","useful":0,"cool":0},"RAtxuUZswZj_YKHKaUxyDg":{"text":"It doesn't get any better than this. Worth every penny so spend the money. We were celebra","useful":0,"cool":0},"T6oLozIT-FGbY8LIMwc7Pg":{"text":"We love love love the Roosevelt hotel first class customer service and beautiful rooms. We","useful":0,"cool":0},"dcNyhFwAxVPSFUWbR0_YhA":{"text":"The Spa at The Roosevelt is amazing! My masseuse was Mariana. I went in feeling terrible w","useful":0,"cool":0},"kEjnhYbWEagiH5AgSQD66A":{"text":"Stunning! My only complaint is that there are no coffee makers in the rooms. My room was b","useful":0,"cool":0},"5Ob1_R_2G1kAp0VuyBPiVA":{"text":"Amazing place. The staff was fantastic. The room was grand, furnishings throughout were be","useful":1,"cool":0},"L9HfgaZVdVBL-HY0SnJHmg":{"text":"Beautiful old historic hotel. The rooms are quite large and the beds are super comfortable","useful":0,"cool":0},"gvwPKsnNlOHZ3PMXHWcFTg":{"text":"Beautiful hotel. My wife and I visited for a long weekend getaway. We had never been in to","useful":1,"cool":0},"jate4XavngoR0LVU1cxxOg":{"text":"DO NOT BOOK AS A WEDDING VENUE. NO BRIDE DESERVES WHAT I'VE BEEN SUBJECTED TO.  THEY ARE A","useful":2,"cool":1},"r-TERYBhtdAeRClEsqdOAA":{"text":"I was back in New Orleans on business and decided to extend our stay for a couple of days ","useful":5,"cool":1},"xgwk8M8e5LGA_3IlOnunIg":{"text":"Beautiful hotel when I first came in I thought it had too much of an old feel but it's bea","useful":0,"cool":0},"fVuMRmGifJT-SWfqZWvzPg":{"text":"Great place to stay went for our anniversary was given credit to use at the hotel. Great l","useful":0,"cool":0},"Jhwbsum7kKiYwPx0Z0gCnA":{"text":"This is place is undoubtedly overpriced, but what do you expect when you are booking a hot","useful":11,"cool":6},"E2K0vgG4MDbHVV0cdvMOSA":{"text":"My goodness.....so I like my hotels classy and gorgeous and Roosevelt Hotel, you are amazi","useful":9,"cool":4},"4g6wyNP0IzQTUrvViSBFcQ":{"text":"As a Hilton Diamond member, this is the place to stay if you want to feel like royalty.  T","useful":2,"cool":0},"TpaVl9dycx6npDcTDM1CKw":{"text":"We've stayed at The Roosevelt a few times now, and overall, it's a nice hotel if you want ","useful":0,"cool":0},"cpOBqkTNwPT_MHJyZDn81A":{"text":"Fantastic Experience from booking through checkout.  The concierge team--Norma & her team-","useful":0,"cool":0},"8hGyqrAM0pzOGp6Bqhb4XA":{"text":"Beautiful this time of year. Visiting The Roosevelt will put you in spirit of holidays. Ou","useful":1,"cool":1},"6B0HuJbYiuT-xXKAZ73ItQ":{"text":"It is one beautiful hotel - that's for sure. The Roosevelt has a *lot* going for itself be","useful":5,"cool":2},"0acpz8m1uCPgEUn-Nm136A":{"text":"Beautiful historic hotel close to everything and great for a first time visitor to New Orl","useful":1,"cool":0},"knSoiFYRJarXniWhyFufog":{"text":"Fountain Lounge cheese plate was the best. (Get the meat). Order their version of the Manh","useful":0,"cool":0},"1vF8JDBTd32pwEupDNz46Q":{"text":"Wonderful experience staying here while on vacation. The staff was phenominal. They were a","useful":0,"cool":0},"s92ourvIjEioX8JLbWljMQ":{"text":"Wow, this place is stunning!!!! I came here to visit the Sazerac bar during our trip to wa","useful":1,"cool":0},"v_WtFYAebt8BPJWSx5iNjQ":{"text":"This is one of the few times I can say that I have been to a hotel with absolutely no comp","useful":0,"cool":0},"gVbloXmT2Jrb3rXvDc2ikQ":{"text":"What a wonderful treat to visit the beautiful corridors of the Roosevelt Hotel during the ","useful":2,"cool":1},"HI2LbZJnwCfnLP6s1vHvRA":{"text":"The Roosevelt is my favorite place to stay in Nola. I've probably been a guest here at lea","useful":2,"cool":2},"Rjid-OSfOnjG78Oi8ljxtA":{"text":"So,  this past weekend I had the opportunity to stay at the Roosevelt with my Bride as we ","useful":4,"cool":1},"sJv2HHFb7ZAvXMvfuvtxng":{"text":"Sometimes I wonder why we keep coming back here. Decided to spend Christmas here since we ","useful":0,"cool":0},"GoC9H2hjQIOV7NmoPPQJLA":{"text":"What is the point of announcing a time for your \"Lobby Lighting Ceremony\" if you don't fol","useful":0,"cool":0},"Roff-kVvmM6-_KkyCSnzXA":{"text":"Huey Long likes to drink here. I can see why. They treat their guests like royalty. From t","useful":0,"cool":0},"QPPO7TsWwHa_I2cDg7pUkw":{"text":"Please excuse my language, but our stay here was an absolute S**t show. We arrived at the ","useful":0,"cool":0},"dNgb__fBW5c2mgtu2pm4oA":{"text":"I was so looking forward to staying at a 5 star hotel for Valentines weekend. Struggling w","useful":0,"cool":0},"CrQjrt-mlRkqf0hPaAb4vQ":{"text":"As a Hilton Diamond member and frequent traveler with Hilton, this was one of the worst ho","useful":3,"cool":0},"j3L2XejSwbGXyf3_ZEDL2Q":{"text":"This review is of the Roosevelt as a seminar spot, not as an overnight hotel as it as way ","useful":0,"cool":0},"rVCiPJ1wtwxOs6sMhmauuA":{"text":"I stayed there recently for my niece wedding and got bedbug bites!  I would never stay the","useful":1,"cool":0},"f6eCnjAuQdl5eeHHEuhEOA":{"text":"I have never been to a Waldorf Astoria Hotel, but this was definitely a lot of fun! We pur","useful":2,"cool":2},"NfgGaRGPbCSlfF2kR9n4vQ":{"text":"Expensive place... but it's worth it. The service is wonderful. However the property is on","useful":2,"cool":0},"Mnc5xUCkfmXYedm1r9E7kQ":{"text":"I always stay at the Roosevelt when in Hollywood and this was my first visit to the New Or","useful":0,"cool":0},"cTYWwFTow4QWWzhXneMWRw":{"text":"If you're looking for a pet friendly hotel in NOLA this place may be for you. If you prefe","useful":12,"cool":1},"vGM_vuJ-sBGY-0TFxwArjw":{"text":"A lovely hotel that stands in luxurious tribute to the historic Old South. You'll feel imp","useful":0,"cool":1},"hDvy0i7GGXm61Py4X-yL2A":{"text":"Top notch hotel. We always stay here when in the NO area.  Great food. Drinks. People. Wou","useful":1,"cool":1},"zvrYeSzeibhhp26jN2HXgA":{"text":"I stayed there recently for my niece wedding and got bedbug bites!  I would never stay the","useful":1,"cool":0},"0b77gDVdw2OjbT3RJDKXmg":{"text":"Stayed at the Roosevelt for a bachelorette party this summer.  The hotel was beautiful, ro","useful":0,"cool":0},"aRCiiu1b35OQPtKYQwmeWg":{"text":"expected a bit more here out of their customer service but was very disappointing on how t","useful":2,"cool":0},"-W6tMaywooeySNDw6xm44g":{"text":"LOVED THIS HOTEL! The staff were all very accommodating and very nice. Especially the bell","useful":0,"cool":0},"F-71XCSzxJGD_gbTgqrLSQ":{"text":"This is a beautiful classic hotel in a prime location in  New Orleans.  It was our first t","useful":0,"cool":0},"9wCYMYI3JgcyTTU-cOsxDg":{"text":"We stay at Hilton Hotels all over the country and are usually very happy with the accommod","useful":0,"cool":1},"u_AYmq0Sz8BIEgulw5U26g":{"text":"Conveniently located! With everything that goes on in NOLA, getting to a clean and comfort","useful":0,"cool":0},"zdbhLxEOmk_Q5bHib57vFA":{"text":"One of the oldest and best hotels in the city. Every time I come in here I get chills abou","useful":2,"cool":0},"KX0x8uBJ601MSrifY_ZBmA":{"text":"Absolutely gorgeous hotel. The restaurants in the hotel are all so good and the pool and h","useful":0,"cool":0},"YKY2dggjeRNjh2CGYcdyHg":{"text":"As a Hilton Honors member, it was really a no-brainer to stay at the Roosevelt New Orleans","useful":2,"cool":1},"E_VIa6OAfL8mrqd9JvAR-A":{"text":"I have to pile on the 4 star band wagon (see the very end where the fifth star went).  Jus","useful":0,"cool":0},"Oj0VnCYy9BM0O18ZZxvJZA":{"text":"Stay at many hotels and rarely post reviews but this experience motivated me...  Beautiful","useful":0,"cool":0},"ayngwPfC1p1aLwF77vT1Zw":{"text":"Just stayed here with three friends for Mardi Gras and we had an amazing time! Tien checke","useful":0,"cool":0},"Zkps7z_M5I0CpvGRlIGkkA":{"text":"If you're looking for a luxury hotel don't stay here. Rooms are ok, service and attitude i","useful":3,"cool":0},"5qmq9N02hi1h5_4QPMP7mQ":{"text":"I wanted to surprise my wife with a spur of the moment trip to New Orleans, and wanted a n","useful":0,"cool":0},"mp6OWt7MoKGovesGOWKfug":{"text":"Staff was AMAZING. LOVED my stay here. Ferragamo toiletries! Food was beyond great- from t","useful":0,"cool":0},"_erwkkbNTeeZ9nYLqhnH7g":{"text":"One of the best hotels we've stayed. The lobby for sure is as good as it gets. The room wa","useful":2,"cool":0},"cMfX6KYZZVm-TrcO2OFImQ":{"text":"At first, I was unimpressed with The Roosevelt. I was there for a conference and needed to","useful":1,"cool":0},"HPplmfDcc6U5L3fBSI9TUQ":{"text":"Stayed here April 1-3, 2018. I like the style of the hotel as well as the elegance and its","useful":0,"cool":0},"SrhVN-av3YgljuDKxkaYUA":{"text":"but skip the sunday jazz brunch unless you just want to see James Rivers - he was fantasti","useful":0,"cool":0},"ieIxBA6C8_HKDpMZsR7XIw":{"text":"We absolutely love the Roosevelt Hotel I'm the heart of the CBD/French Quarters.  The hote","useful":0,"cool":0},"iqgEUwxMF04rQ4_OuolKvg":{"text":"Historic building, small but nice room. No coffee machine though...\n Good service, very co","useful":0,"cool":1},"-s4Tm6-akJwv2Pihi_cgUw":{"text":"The first thing I saw when I entered this hotel was a stream of underdressed drunk people ","useful":1,"cool":0},"lwRm0HNuWZbXIg-cXEpeDg":{"text":"Visiting for my nephews wedding between Xmas and New Years 2018.  The place was a mad hous","useful":3,"cool":1},"Y2H_5zyNbSVeSTaXYG5vJQ":{"text":"I got a chance to stay here when I was in town for business. The first impression is this ","useful":1,"cool":0},"o43TM0KsXD_lahbZdTNfFQ":{"text":"Came to New Orleans for a first time visit.  Stayed at Nopsi the first night and then The ","useful":0,"cool":1},"sE_sl6-VWS_EI6bVEi9RAg":{"text":"This hotel could be so much more.  The grandeur of public areas and rooms are not matched ","useful":1,"cool":0},"GrJz_U7lbf5uwyZaWYWMOA":{"text":"This hotel and the staff are exactly what you expect from a Waldorf Astoria hotel - beauti","useful":0,"cool":0},"gdVtdHOFbKWi-NkT5Xie_g":{"text":"VINTAGE. That is the best word to describe this hotel. They take pride in preserving the h","useful":1,"cool":0},"o9CSvpKLKhRwVpC5o2MZ6A":{"text":"I wasn't super impressed with this hotel. Driving up it's very beautiful. Valet is $47 a d","useful":2,"cool":2},"YXGhsjvNMXvBfQnBu0ozAw":{"text":"Sazerac bar is amazing.  The bartenders are fun to watch.  It's a drink with a show.  I ha","useful":0,"cool":0},"V2z5gf51P0CO254PJscjwg":{"text":"Great stay especially during Christmas.   The lobby is the most decorated I've encountered","useful":0,"cool":0},"h75pYe35OX_0QuUkTAF2Vw":{"text":"As a special treat, I booked a room at The Roosevelt for my parents and 92 year old grandm","useful":0,"cool":0},"V0Pt_xQMs2wFmtGqNv7-oQ":{"text":"I went to The Roosevelt for the Mother's Day Brunch today. For the price we paid, I'll adm","useful":1,"cool":0},"_65oSTjzuK4V4SmwwV9bsQ":{"text":"Absolutely amazing! Digital check in gave me an upgrade to a suite. Love the body sprayers","useful":0,"cool":0},"GzBRXKmWzdMpoHH6JjjiDg":{"text":"Hotel (as in the building) is nice. Beautiful lobby, great location, quiet. \n\nStaff and se","useful":1,"cool":0},"6MGPLjUBZnF-LJ0u5O2CBQ":{"text":"I came into this hotel excited, just off of a lovely road trip down south. We stayed in a ","useful":0,"cool":0},"inONSDnNB7vIWpQuUg_lAQ":{"text":"This is my happy place!\nThis is a well maintained piece of history and class!\nI will be ba","useful":0,"cool":0},"GG9EyBfB2vjPPXgpIZ2aow":{"text":"Neat old architecture and beautiful classic, yet maybe a little old now, but nice decor.  ","useful":0,"cool":0},"DPAHElYnA95H1_mfnYxhtw":{"text":"I have never stayed in such an elegant hotel! This is so beautiful! And the entire staff w","useful":1,"cool":1},"h-VV3NXFapJx1_qiiHxNwg":{"text":"This hotel stands the test of time.  Great breakfast and fitness center and rooms are old ","useful":0,"cool":0},"jCBwxg32r7WUfMOidKWEYw":{"text":"The Roosevelt truly is a beautiful hotel. I honestly enjoyed staying here, felt so elegant","useful":2,"cool":1},"PNISvv2GOV3XUVlI3Z33yw":{"text":"I stayed here as a business guest and the experience was amazing. When I went back and sta","useful":0,"cool":0},"ryIcm3u36JwLefAJm7i64w":{"text":"Worst high end hotel experience ever. Was actually looking forward to our weekend stay her","useful":0,"cool":0},"rkC9SLcYNooCNU45QxCCUw":{"text":"Wow!!!  What a wonderful hotel. Full of old charm mixed with the most hospitable staff. Th","useful":0,"cool":0},"loS6bnzmVy9joA_Y-pK0EQ":{"text":"My review is only for a walk through I did to look at the beautiful Christmas decorations.","useful":4,"cool":4},"bwNtHrXp_4zll8ZqdEH16w":{"text":"The area is a little bit sketchy, but I felt completely safe right when I walked through t","useful":1,"cool":1},"hBAw6DXs8DDL2duOUGEQ8g":{"text":"Wow ...is all I can say. From the moment you arrive to the minute you leave the hotel staf","useful":0,"cool":0},"uy7YHkw6Znjo8JEr8RyDdA":{"text":"I brought my wife here for Valentine's Day weekend. We had a great time and the hotel staf","useful":5,"cool":6},"LT8ca-wu4S05JGrGC37hcw":{"text":"This was the most disappointing luxury hotel I've ever been in. It seems more like a hyped","useful":1,"cool":0},"EohhVtoPGp5qyuWdE0kRmQ":{"text":"We stayed here for our honey moon night and arrived around 9pm. The receptionist was very ","useful":0,"cool":0},"sW--0xug7H-P1-q02C0y2w":{"text":"I came to New Orleans on a business trip and decided to stay here. I must say that I was i","useful":3,"cool":0},"C7ECR4Ei-Vi43CbqZXUCIw":{"text":"This is a gorgeous historical hotel. It has many of the quirks you expect of an old buildi","useful":0,"cool":0},"wYMmfKBxNSyALLTMRqgjxg":{"text":"Horrible customer service. The woman I spoke with on the phone was rude and discourteous. ","useful":1,"cool":0},"33FuvHLGtfbNKSeilsjGFw":{"text":"The lobby of the Roosevelt is the best part of this hotel.  A few floors up, everything lo","useful":6,"cool":2},"BHlWHKMdwy28N8nVKhX7Ug":{"text":"Amazing hotel. Amazing stay. The hotel is beautiful. From the lobby to the room, everythin","useful":0,"cool":0},"wCWcyFii_pRsFl_PD-ZcjQ":{"text":"The Roosevelt is FANTASTIC!  Rooms, service, location, restaurants... everything is spot o","useful":0,"cool":0},"YxzlszXvJd_vDzKwqFNHIw":{"text":"It isn't every day I get to stay at a place as swanky as the Roosevelt.  But thanks to 2 c","useful":1,"cool":1},"Fd_RwaVmzlsUMBbbsHnLFA":{"text":"We stayed at The Roosevelt for 4 nights last weekend.  We were in town for a concert but i","useful":5,"cool":1},"2dxYBH2EivLRoaIKujGHeA":{"text":"Where do I start?  No one from the hotel management has reached out to me yet.  However th","useful":1,"cool":1},"tkzqdACCB65-8jTHvqyntw":{"text":"If you've loved the Roosevelt as long as I have, you're going to be disappointed to learn ","useful":0,"cool":0},"4RL3njTGzdLumOq0XFvuiQ":{"text":"I have been here mostly for the Christmas lights in the lobby.  Haven't had a chance to hi","useful":3,"cool":1},"_q-y2FmRTAAr4oL2fxmcpg":{"text":"Great stay at the Roosevelt!  And the spa..... Amazing!  Dana and Cassie were personable a","useful":0,"cool":0},"7QPLwRzYpVxJtixXNGn4xQ":{"text":"One of my favorite spots to stay in New Orleans. The Roosevelt (Waldorf Astoria - Hilton) ","useful":0,"cool":1},"eiHHr2fzgCX8DI3TiZXqvw":{"text":"This is our third stay at the Roosevelt. This stay was very different than previous stays.","useful":0,"cool":0},"7UBJmPYgbwhlDPMsA9dSjw":{"text":"High Society!  Oh yeah I kicked up my heels to be a high society queen at the Roosevelt.  ","useful":1,"cool":1},"Av50FJWUDfvcXxvNZOslmw":{"text":"One of the nicest hotels I've ever been to.\n\nCentrally located right by Canal Street, with","useful":5,"cool":4},"flVVbkiYTSavQpDx9aUG2g":{"text":"you think cafe du monde has the best beignets? nah... the little coffee shop here has amaz","useful":2,"cool":1},"QUqWVtnYRGPvoVuZqapZkw":{"text":"Just a few steps away from Canal Street, this hotel is beautiful and in a prime location. ","useful":1,"cool":0},"tGh4xzYyOI9jRJ6XwXMZQw":{"text":"While I have never had the pleasure of sleeping in a room here, I have been to the amazing","useful":3,"cool":2},"wy-2nYVMgb4twq2XXSSp9A":{"text":"Beautiful, beautiful, beautiful!!!  We happened to hit a decent rate, so our stay at this ","useful":1,"cool":2},"TtX-wOpwBlTC0Zn-VJHGmg":{"text":"I'm currently staying in this hotel. Excellent location near all activities. Hotel lobby h","useful":0,"cool":0},"HjmCXhNygzrTd-qXpd0zRA":{"text":"Absolutely gorgeous hotel. The room is comfortable and we had a great stay. The only reaso","useful":0,"cool":0},"86wz4y9xmEH9IGQpnHKJYw":{"text":"The Roosevelt was home base for my birthday weekend this past weekend.  I have been to New","useful":3,"cool":2},"dciTF3wyrxDpTTO9Fl4vRw":{"text":"Spectacular stay. From our room (King size Suite) to the service and food, our two day sta","useful":4,"cool":3},"vbP9b4y_WHAhKRM3816AkQ":{"text":"Highly recommended.  My wife and I stayed here for a weekend on our 18th anniversary.  The","useful":0,"cool":0},"87b8BcbMluYvlQR49cmbNw":{"text":"So this hotel is like...super fancy. They put caviar on the avocado toast. Really. \n\nExtra","useful":7,"cool":4},"xpWNjffxMWnlWQcUfCtZ0w":{"text":"So my husband and I are hilton honors members, I actually gold which is significant since ","useful":6,"cool":3},"Zd1wU2I7xk7FO0BffrfTfw":{"text":"The building that houses the hotel is an old one that has been refurbished. The lobby look","useful":0,"cool":0},"y20a0Ke9vh8SbbcV-9cgRA":{"text":"This hotel was amazing, from the first step into the entry way and seeing the crystal chan","useful":0,"cool":0},"EfunywE5wLsVXc7hvogWQg":{"text":"I am a Hilton diamond member and I was very disappointed. I've got bad allergies and when ","useful":1,"cool":0},"62h3PSv_6Afq7jKIa5Li7w":{"text":"Was disappointed with how dusty our room, end tables and tv stand were. Also, it was diffi","useful":0,"cool":0},"pJUaUenY5AJp8qz2TLeZRA":{"text":"Ok I always wanted to stay at this hotel. I won't be coming back. Microscopic room ok. Poo","useful":1,"cool":0},"qt-BNj1o5LIIDI70u5mQbA":{"text":"I have been to to this hotel during a few separate occasions, but my favorite time of the ","useful":14,"cool":10},"cRao7RtO83zRWc20UYNMpg":{"text":"close to five stars, but just not quite.\n\nthe roosevelt is conveniently located on a quiet","useful":0,"cool":0},"INjQBPLCjR1VWMJTBTbdwg":{"text":"In one of the lounges very disappointing service. Server was overwhelmed by many patrons a","useful":2,"cool":0},"fKYHUxfDFiNrMPZOjUkZtQ":{"text":"I was fortunate enough to stay here when I accompanied my husband to a convention in New O","useful":10,"cool":11},"j7aejmBRUfOfqgsO9R2Tqg":{"text":"Had a massage today, front desk  was warm and welcome.!\nMy service  was very mediocre  low","useful":0,"cool":0},"HQ5H2HyBNdUHBXyUnaWrnw":{"text":"It took many texts and several phone calls to finally get our room cleaned... that was not","useful":0,"cool":0},"jFoJMVOSbKR_zGwwE7Ku_g":{"text":"I just expected more from this hotel. Overall it was just okay.  1. Only one person workin","useful":0,"cool":0},"1YRbQAwHd4Z1hwhx_SzkMw":{"text":"We had a disastrous time in New Orleans so far, thanks to the Ritz.  I won't go into any m","useful":1,"cool":3},"OBjQmIyxFyhU-EPSLnqpCw":{"text":"Beautiful hotel. Very clean. It stays very busy and parking can drive up your vacation cos","useful":1,"cool":1},"2tNHtiRBHKHT6Q1xEoHB1w":{"text":"My partner got us a room (with points) for our anniversary and as a night of stay-cation. ","useful":4,"cool":1},"O32vw3dsb_oLdHzEr8gSPg":{"text":"These are trying times, but the Roosevelt's management could not care less about their gue","useful":0,"cool":0},"uwPYZ1ppDF8gOvmVTxDobg":{"text":"The rooms are beautiful and classy. Tall ceilings with large windows let natural light in.","useful":1,"cool":0},"6GcETew6t12M1y_nAZ6nsg":{"text":"WE STAYED HERE ON OUR WEDDING NIGHT AND HAD THE WORST CUSTOMER SERVICE.  \n\nThe people who ","useful":4,"cool":0},"OP8QWDovncwHbeoGNZC40Q":{"text":"This is a beautiful bar with really nice music on the night we went. We listened to Tom Ho","useful":2,"cool":2},"Dp6mzcJ0Zh0WGdWsN6p5yw":{"text":"I was very excited to come back to the Sazerac bar in the hotel. My first experience was g","useful":4,"cool":0},"kxBwVG_H2Hs8hfLIZG1Iag":{"text":"From the valet, to doorman to the bellhop, all were professional, friendly and gave excell","useful":0,"cool":0},"pIAlvnMLNurVpqUm6dZcUQ":{"text":"Upon arriving, we were very excited for our stay.  The lobby is gorgeous and the room was ","useful":0,"cool":0},"hfRKYnGcv1XGSbar3tD6mA":{"text":"The Roosevelt is one of many swanky hotels in NOLA that really pulls out all the stops whe","useful":19,"cool":16},"-edNJNw0Jk1AcW7HhUFPSA":{"text":"This has in my opinion the best beignets in Nw Orleans and a matter of fact the extra choc","useful":0,"cool":0},"nviewx0wYHIxGFAPKQp7rg":{"text":"The governor's suite was disappointing. We checked in late and the suite we reserved was b","useful":1,"cool":0},"eHA6nTbT0rkLxSiZlY_s5A":{"text":"Giving 3 stars & not 1 ONLY BECAUSE the service was exceptional & everything was solved in","useful":0,"cool":0},"20vxJBfqDOkj0uiBja5LtA":{"text":"The rooms are tiny and very dated.  Everything looks great downstairs and the service is g","useful":1,"cool":0},"cl_dNU7fp3ItTImvR57dgw":{"text":"We were expecting the Waldorf Astoria to live up to its name, but it did not. It was so di","useful":0,"cool":0},"oXe2jYEHtI_l4-5ZdYjmZA":{"text":"The Roosevelt hotel. Magnificent. Beautiful. Just walking in the lobby. Do it. It is a mag","useful":3,"cool":2},"y8NARNTdkvZzMOXL3NaiZQ":{"text":"Went there on an girl's trip for my friend's birthday in Aug of 2018 and it SUCKED! \n*** T","useful":3,"cool":0},"IklDkXNsoyYx8q3K_JZkkw":{"text":"I will give the Roosevelt five stars with two caveats.  This historic hotel is beautiful w","useful":0,"cool":0},"9te66tuJqtlvRMgE2A53jg":{"text":"My family and I ate at your Thanksgiving Brunch. From the moment I arrived on the mezzanin","useful":1,"cool":0},"IJrRyndJfTN-TPTUPOJN9g":{"text":"Check in is abominable.  For diamond level members, very little in the perks department.  ","useful":0,"cool":0},"S9IB7v-Xqashnu49YCmUOA":{"text":"We have been staying here for years and have always had perfect service and an excellent s","useful":0,"cool":0},"YAdtrgqKO_Tzn1LnYrrQ0A":{"text":"I went to the Roosevelt for brunch, during the Christmas holiday. The hotel was beautifull","useful":1,"cool":0},"HUlPiMCIk5j4jOpY_ujQOg":{"text":"I've been checked in for 1 day of 5 & am not impressed so far. The hotel is in a prime loc","useful":3,"cool":1},"s14RNVEFX848yXXuGQCxLQ":{"text":"It breaks my heart to actually give a Waldorf property only 2 stars as I arrived with brig","useful":5,"cool":0},"38cTf2jOlxoVcPX4zeeILA":{"text":"I loved this hotel from the minute we walked in. The entrance smell nice and had awesome p","useful":0,"cool":0},"VcQsqo6DJxbjQss_rrcHNw":{"text":"Had all the amenities. Super clean. Great staff. Super friendly and accommodating. \n\nSofte","useful":3,"cool":3},"m2RaO-QrBrf2Ta66YPpdkQ":{"text":"So beautifully decorated every year! Unfortunately I didn't get to try any of the TO-GO co","useful":10,"cool":8},"-WNnHr2uktphLBKh6k-axQ":{"text":"I've never stayed here but when people are in town for the holidays we always come to see ","useful":2,"cool":0},"-mE3OGAXSboNlCbCMLndwQ":{"text":"Great ambiance during the Christmas season.  Very friendly staff.   We stayed in a suite a","useful":1,"cool":0},"AuMIQfwN8b3L5RJ55Ivu3w":{"text":"We stayed on the 11th floor but every night at 3am there was music blasting for hours. We ","useful":0,"cool":0},"YH1VPOMfBYWhqknB4jgf7Q":{"text":"The property is well maintained and beautifully decorated during the holiday season.  The ","useful":1,"cool":1},"DMWNu9aNEO-Vdo_qzTQqWQ":{"text":"Very well maintained hotel. It is walking distance to most attractions in the french quart","useful":3,"cool":2},"wQ6pBw-87-iszkSW_8malQ":{"text":"This was a lovely stay for us. The hotel corridors and hallways are absolutely gorgeous. I","useful":0,"cool":0},"41-go3HT79USsqQzwf51ew":{"text":"It is not how you start, it is how you finish. At one time during my stay, this review wou","useful":1,"cool":0},"CC6FFSur8MF1hzfY8VNbeg":{"text":"Second day in our six day stay and so far the Waldorf as been sub par. I've stayed at mote","useful":0,"cool":0},"4BtX-v6zmkjQnApDbLLDJA":{"text":"The Roosevelt is Class. Professional and dedicated staff that care. I will be coming back ","useful":1,"cool":1},"ZeJjbXGlxbE6OMQ04ku_PQ":{"text":"We love the Waldorf Astoria.  It's truly our primary choice of hotels.  The location of th","useful":0,"cool":0},"LWfkO2U1M9wG9qtC-GH-3Q":{"text":"This is a nice hotel--we had a clean room and it's a very pretty place. The concierge was ","useful":0,"cool":0},"0FMFWida2I3JhyjBYwQ2Ng":{"text":"Fair Warning: I did not pay for my hotel room, my friend's company did.\n\nI spent the night","useful":5,"cool":1},"y-U61RQSayiIlFfPCL6Fzg":{"text":"Pre Covid stay. Mid February 2020, a great classic hotel with a grand lobby,  spacious roo","useful":1,"cool":1},"PumEIdGFw0ZSV0J9qQ7hiA":{"text":"The Roosevelt is an impressive hotel but it had a couple of minor issues that prevent me f","useful":3,"cool":3},"qvlxozV75Sq8-2n574NnjA":{"text":"Not worth the money, especially if you are a diamond member. The thing that bugged me the ","useful":5,"cool":0},"z-XowkMipL_0azuK4FVZrw":{"text":"We stayed at the Roosevelt Hotel again. Now, they set right  the way that the Diamonds per","useful":3,"cool":0},"XNd5bumbU2dHxRN_0B7_4g":{"text":"Love this place.  Great room size, fantastic service from all hotel staff member's and the","useful":2,"cool":0},"rCPiP88-gd6aoYvZ5XtVyw":{"text":"Awesome hotel with a great location.\nWe travelled here as a family with young children and","useful":0,"cool":0},"0wfRcElDv3x8c87sQWkNAw":{"text":"Love this hotel.  They treat you like royalty and the rooms are divine.  Price wise, it is","useful":3,"cool":0},"bUMqGBGQXSgQ7MsBaqgXVQ":{"text":"This is my favorite hotel in New Orleans. It's apart of the Hilton Honors program. \n\nThe h","useful":5,"cool":1},"e9fCwN1xSfPut3c0mX87FQ":{"text":"This is truly an amazing place to stay in New Orleans.  The amenities were wonderful, the ","useful":0,"cool":0},"9_L3LLBBWYkwtYjRuTmHpw":{"text":"This is an absolutely amazing hotel!! If you want to be wrapped in luxury and feel oh so c","useful":2,"cool":1},"p6jmRcGQqj64ugn1ZwGniw":{"text":"Very nice hotel that is great to visit during Christmas because of all of the nice decorat","useful":1,"cool":1},"W-iUBNBPmEYFABU3EcMFZA":{"text":"Subpar service. We stayed three nights at the Waldorf Hotel. Having stayed in other Waldor","useful":1,"cool":0},"m-eDLGG7DG5GKdjlMCZLEw":{"text":"Horrible customer service from a person called William, who refused to give the informatio","useful":0,"cool":0},"d3LjB4lj2rtIgmRuOLA9wg":{"text":"Tradition meets modern!\nThe Roosevelt hotel is located in a prime location within walking ","useful":17,"cool":10},"mbTAYYeDzv83kcdYXwO-pg":{"text":"The hotel exterior and lobby are amazing.  We were super excited to stay at this hotel as ","useful":1,"cool":0},"CJfpPVHNto0kiOJM3c5J3g":{"text":"My husband and I have stayed at some of the finest hotels in the world. The Roosevelt New ","useful":2,"cool":0},"1nB-OCrmtyaD4UYvWWR0cA":{"text":"As you approach the lobby, glamour rings true! This is an old time, hotel, where time is r","useful":0,"cool":0},"Pe3Wx2CGJQ-JQthIIjHTBQ":{"text":"This hotel was excellent. The shining star for me was Kermit-  the individual who shines s","useful":0,"cool":0},"l6RIfxaeL2wmz6x9XMvGnw":{"text":"Went there on an girl's trip for my friend's birthday in Aug of 2018 and it SUCKED! \n*** T","useful":2,"cool":0},"YV-3OrXiC0-ayRfQkHX9bA":{"text":"The room was not ready, no apology was given, no suggestions of where to wait. No mention ","useful":0,"cool":0},"B__XpZt-vp9monUkf9jJVg":{"text":"The Roosevelt was a fantastic place to attend a conference during the Christmas season.  T","useful":3,"cool":2},"77k3YLO5ZbNb38mB_hXRdQ":{"text":"My first time here -- I came for the lobby lights at around Christmas time and it was gorg","useful":1,"cool":0},"yB-aJTCBds0PqaZCC0PB8w":{"text":"I was fortunate enough to give this place a ritzy whirl right before the lockdown happened","useful":5,"cool":3},"RscI9VXWma84h7pCgvR76A":{"text":"I have to say that after a bad experience with the Hotel the General manager Tod Chambers ","useful":0,"cool":0},"Q7lqgyXDgvjMOkLBloTJnA":{"text":"At approx 1 p.m., we went to Teddy's and they had a few breakfast items on their menu and ","useful":4,"cool":0},"pQlX9VnahlEU8XPHhB6rDA":{"text":"Booked here on a very last minute trip to NOLA where at this point most places were booked","useful":3,"cool":1},"2cBFND5G5uXwbSfK0EX2Rw":{"text":"If you have a chance to stay at this gorgeous hotel I highly recommend it. My room was abs","useful":1,"cool":0},"X9Y-brtJzBUWFHMBNO2_iQ":{"text":"Location is convenient to many areas of the city.  Streetcar line on St. Charles is close.","useful":0,"cool":0},"2GEN0jRfG08Q4Um-n4oSjQ":{"text":"Good place with good service. The hotel is not too far from the french quarter, but it was","useful":1,"cool":1},"GfgUEzEk5OF8Yph6TJP3gg":{"text":"This may be the best hotel in New Orleans. I have been to the city many times and stayed a","useful":0,"cool":1},"NBVNwlxAEjJ0TIGZBim_8g":{"text":"This place is gorgeous!!\nOur bartender parles vous Francais?\nOur server (Stefi) deserves a","useful":0,"cool":1},"OI2fZOs9VVJCVC7n0MQOAA":{"text":"I'm a Hilton girl, so of course I looked for Hilton properties when we were planning on be","useful":4,"cool":2},"VYBe0s2j08QPiBwRnnN7fw":{"text":"Beautiful hotel and great service, as always. I've stayed here multiple times and each tim","useful":7,"cool":6},"QMHnQIoR72KbFyTxo1gF-Q":{"text":"Oh God, anyone who follows me or have seen my post know the Waldorf in New Orleans is the ","useful":0,"cool":0},"pDg5YY90XYYilTGUOQxSYg":{"text":"Stayed in this hotel for 2 nights. The hotel is located in downtown New Orleans so everyth","useful":2,"cool":1},"uekEtrxozk0vlV1xvVvU9w":{"text":"Ignored in the Sazerac bar in favor of other patrons who arrived after us, we took our bus","useful":2,"cool":1},"RauQ7RwLWYF45qhtbMj0IQ":{"text":"After a 2 hour wait for our room, we were stunned to find ourselves in a room approximatel","useful":0,"cool":0},"z5lbbMkcyBn2cTNb9IIM0w":{"text":"Nope. We had issues getting them to answer the phone after we made our online reservation.","useful":2,"cool":0},"I8qiGrVbRXW8Nsz4FAz4dQ":{"text":"This place saved my life from an AirBNB experience that left me exhausted and desperate. R","useful":3,"cool":0},"i7i9SVBxMNd0NNt7ZqTlrw":{"text":"Going to Domenica for their 1/2 off pizza, wine , beer, select cocktails happy hour has be","useful":3,"cool":4},"vLcwy410OjnekmUbgNVMlA":{"text":"This is a special hotel. Nicholas Previn, a fairly new staff member at the front desk real","useful":0,"cool":0},"vlfBrOdAcmeJlVir8KY1ww":{"text":"An absolute stellar, clean and gaudy hotel filled with impeccable and friendly service thr","useful":3,"cool":4},"29kNwehzxi40eTdLklux7g":{"text":"The Roosevelt is an elegant hotel close (15-20 minute walk) to Bourbon Street, French Quar","useful":3,"cool":2},"FQUoug_g0RVZ1BKbpjuM7A":{"text":"This is a brief review of the lobby as Christmas. This decoration were festive, fun and ch","useful":1,"cool":1}}