{"LhS1XWIELDB9ApEWrwd9dg":{"text":"Had a large pepperoni  and a large marghuerita pie.  They were good.  Very close to a new ","useful":1,"cool":0},"nobjlywl3FnLtUlfSLmb2g":{"text":"The best pizza  place I have ever been too. New York style pizza with thin crust & very fl","useful":0,"cool":0},"PUu51OQLpYPUY3DJbymLFg":{"text":"I'll admit that I was more than a little skeptical about trying this place.  Other holes-i","useful":1,"cool":1},"-7v_wfuy381-dC0ofSJv8g":{"text":"Boom.  There it is!  From beginnings as a humble speakeasy to a blown up Bywater legend, t","useful":0,"cool":0},"8aL3jOeqxk3K7W04vLERog":{"text":"Amazing! So excited that there is a place to eat now. The cauliflower rolls are to die for","useful":2,"cool":0},"bQ1v4_7ZnlY7C19ayxETDQ":{"text":"I went on a day where one of their specials was the Hawaiian.  It was great.  The pineappl","useful":3,"cool":1},"er919Ct5rUlUYnwoW7GPmg":{"text":"SO GOOD. I'm from NY and it's hard for me to find good pizza here, Pizza Delicious hit the","useful":0,"cool":0},"GeMRTgKWlkebH6qa7V9Sdg":{"text":"I found myself sitting in Bywater at 9:30pm on a Sunday in mid July. I kept asking myself ","useful":3,"cool":0},"soDauxQdl5FG9baTo9AvgQ":{"text":"The food is as it states, delicious. The staff great. I had the crab butternut squash riso","useful":0,"cool":0},"r2SlmZhT37I57ndxK0Vcrw":{"text":"How have I not told you that I love Pizza D? I used to do the takeout when they were cooki","useful":1,"cool":0},"SlQ3c-Tk3X4Xom4eqsXw1A":{"text":"Won't take credit cards for delivery.\nThe pepperoni rolls are awesome and very affordable.","useful":1,"cool":0},"L57RVmd4QILQ-to06UKrDw":{"text":"Really solid pizza place with a few craft beers on tap. We could tell this is the place th","useful":0,"cool":0},"qwX8Orc3JgvLHu-kK1nvyw":{"text":"Fairly Good. Love the crust (not too doughy) sauce isn't hard on the stomach, cheese had m","useful":0,"cool":0},"9EDHAaGzBrlyP3I3_V_Elg":{"text":"This is a shop that sells pizza pies. It is on Piety Street. It is called Pizza Delicious.","useful":0,"cool":0},"vqqJeZrhDh8RcsyqTaR_Lw":{"text":"It's been two years since my last review and now that I've had their vegan options, it's t","useful":12,"cool":8},"xmjadyHDiqMXA9ahkgc8XQ":{"text":"The pizza are good - and it's fun to watch the staff toss the dough in the air - but the  ","useful":1,"cool":0},"tF75b9bercitXF0hYXiRGA":{"text":"Let's face it: New Orleans hasn't exactly been a great pizza town. Sure, there are recent ","useful":0,"cool":0},"N9RKR3Jqm2JnmVIoY81C9g":{"text":"Like the name says, the pizza is delicious... and they have beer. I like beer. Also, they ","useful":0,"cool":0},"rtr_m_3Q0BR6PINf-C-1OQ":{"text":"Technically a 4.5 but this is yelp. Great thin crust pizza and delicious garlic knots. The","useful":0,"cool":0},"ShANtAWpI-b_rH_aP7-sLA":{"text":"Delicious pizza as a New Yorker this has been the closest to New York pizza I have found! ","useful":0,"cool":0},"8Jp8jDTMBuEVyj8LkUQCvg":{"text":"The gigantic pepperoni pizza was very good.  The sauce had a great flavor and the cheese a","useful":0,"cool":0},"RtSemXQXmfGCoxZCGK1-_Q":{"text":"Dude, this place actually trumps any New York slice I have ever had. Pepperoni with carame","useful":0,"cool":0},"t9egXWVLll-727o5jKoYhw":{"text":"I am generally very snobby about pizza, having grown up right outside New York. I liked th","useful":1,"cool":0},"Tb1H40A7oZ40nK__rqUWWA":{"text":"Amazeballs! Best pizza in New Orleans, hands down. Pizza so good that I'd trade my firstbo","useful":0,"cool":0},"OWovAkzzy1Dfeefhfk9HSg":{"text":"On my last day of a couple day trip to New Orleans, we followed the NY Times suggestion to","useful":0,"cool":0},"f5wt_ENLlFhZ3Ex3v4XHCw":{"text":"So this is the second review I've wrote in like three years.  This place deserves it.  I j","useful":1,"cool":1},"RpE2eqlPzBEQfL8F0rXJ6g":{"text":"I don't know if this is my favorite pizza place in the city but it's pretty good. The pizz","useful":1,"cool":0},"t7uecgqBRRTIdkPbnf21sg":{"text":"Finally the real deal NY pizza!  On a Friday night the place was a little crowded but well","useful":0,"cool":0},"_pjXI0SrY28rWFU2FaqC1A":{"text":"We ordered a vegan Spinach and Roasted Garlic pizza with an addition of cheese (I know, go","useful":0,"cool":0},"6tDHdXEIEH1Lx2uY3Q5law":{"text":"Pretty good slice ya know but man sometimes that crap undercooked n u fold it but it's sti","useful":0,"cool":0},"TVEH8TZozNBKqEiKNnGxHQ":{"text":"best pizza in new orleans.  the only reason i am giving it four stars is because the food ","useful":0,"cool":0},"5AP8QLEa2nqDud9f0T6LLA":{"text":"Great place with NY style giant slices and it seems like the toppings are local fresh as t","useful":1,"cool":0},"t60JFQF1ySWEScpzPRKRZQ":{"text":"I probably go to Pizza D at least once a week, usually after working out. Typical, right?!","useful":0,"cool":0},"k0rIKFA8j5RohTFXpiyQPQ":{"text":"Best Goddamn pizza in the whole city! Garlic knots, pizza beer what's not to like?","useful":0,"cool":1},"Hv3c9k4cWZanB7yEe1BsLQ":{"text":"The pizza here was very good. They could use a bit more structure around how they manage s","useful":0,"cool":0},"9MOmqeo81TI6HFX89CBogQ":{"text":"Some of the BEST pizza I've had outside of NYC.  Their pepperoni pizza has crispy, thin cr","useful":0,"cool":0},"6xjb0LkPwk87mTdkRI28kQ":{"text":"best place everrrrr! pizza is great, salad was amazing. even if you're not a salad person ","useful":0,"cool":0},"SK0LCecSaGcVjOYxbWhiGA":{"text":"Pizza is one of those foods you can get almost everywhere but at pizza delicious you can a","useful":1,"cool":0},"v0X9OQWfvPuCZP4h1K8Lkg":{"text":"Went the other day and got a pepperoni pizza and Caesar salad. I enjoyed the salad but the","useful":2,"cool":0},"BH_Ob9ay0F8ttEghwttzvQ":{"text":"Pizzas are huge - by the slice is a good alternative.\n\nYou order and pay at the counter an","useful":1,"cool":0},"4BNzCPP_IgGqGelen4RV9Q":{"text":"The best place in New Orleans for new York style pizza.  Location is a bit obscure and the","useful":1,"cool":1},"ifNeTDm088ZzbcV-a4iqEg":{"text":"In response to user Sam B.\n\nMy curiosity is really stirred about what you think is \"authen","useful":1,"cool":0},"sNMdRin4MhZ5s4WJQDCNaA":{"text":"Pizza delicious is my do to in the city.  This is mighty inconvenient since it is across t","useful":1,"cool":2},"qbY2YKbdR11ua3OJMGlKzQ":{"text":"great pizza. garlic knots were cold and chewy. wasn't sure if that's how they were suppose","useful":1,"cool":0},"oL1hYWLr51-sn7_hdUwbmA":{"text":"Let's keep it short and sweet here.\nQuality ingredients.\nPepperoni Pizza is AMAZE BALLS!!!","useful":3,"cool":2},"kNbqOje8_3JPYdeEqUgBPQ":{"text":"Honestly, all good and bad reviews aside, this place is the closest thing I've had to real","useful":1,"cool":0},"cHe8WGxWuzQ3NpRiiGX3Eg":{"text":"i went here after hearing their coverage on NPR's Planet Money, and it was only a few bloc","useful":0,"cool":0},"mt3dSRA5ofMJ96miqWIluA":{"text":"At first when I learned that PIzza Delicious only opened its doors for business on Thu and","useful":1,"cool":1},"NwNpc5gkP_QTN-rR7pm6wg":{"text":"If this is the shining exemplar of New Orleans pizza, New Orleans isn't doing too bad. It ","useful":2,"cool":1},"Hbu0z7owP5PoYgUU6JWacA":{"text":"The place is always busy, so get there super early. The food is good but overpriced. If yo","useful":0,"cool":0},"C6LHH9gpWB4VWc1jgLrGmw":{"text":"Thanks to Steve, I was finally able to try Pizza Delicious after hearing all of the raves ","useful":7,"cool":3},"Y9NjjrUTsRf7rMOmEQOXCg":{"text":"This is the best attempt at NY style pizza in New Orleans. Although I prefer slice, this i","useful":4,"cool":0},"41829G3DlN35WLevFKwspw":{"text":"Came here two more times with my family while staying in New Orleans over the course of a ","useful":0,"cool":0},"JcyNUny9YD-lQY8WZmRKSg":{"text":"Love their garlic knots; love the 'za, love love love their cookies.","useful":0,"cool":0},"52VKsoRcIIJ2JIJZrG0IVA":{"text":"Walked in the door at 10:51 and these sweethearts fixed me right up, without a smirk in si","useful":1,"cool":0},"ioS36BDPqZgVTUV56fj3Sg":{"text":"I'm allergic to wheat and dairy so a pizza place is never high on my go-to list. This one,","useful":1,"cool":1},"uUXFNeHVVszP33fxLJwYIg":{"text":"It's sooooo gooood. I love the atmosphere. Homey, neighborhood-y, and comforting. The newl","useful":0,"cool":1},"hUJbPBvax9p1DIu4A5O7Ig":{"text":"Dang, this pizza is damn delicious.  It's not so much the toppings, I just got a pepperoni","useful":0,"cool":0},"VmkHuC5aqC9V6aF4xzms0A":{"text":"Sweet baby divinity.  This is the spot where anger over no great NOLA pizza goes to die, r","useful":1,"cool":2},"_QBl3-a11i4MqxU6WuAQOw":{"text":"Good crust (crispy with some crunch), but I thought that the flavors were lacking on their","useful":3,"cool":1},"mZplVwaOPfZXvqf2-iCLKw":{"text":"Oh heyellllll yes.\n\nI have been looking for some good, sloppy, greasy, fold in half pizza ","useful":6,"cool":4},"FA1t6a8A3vs8fKNOqdxq7A":{"text":"Best pizza in New Orleans, hands down. I will usually try the special pizza and am never d","useful":1,"cool":0},"W3VlIt_K8KSkpzre9ycS-Q":{"text":"Definitely delicious / amazing and definitely expensive- expect to spend $20-$30 on an \"18","useful":0,"cool":0},"Px5sgkmuZQA5wAl6gq4wbg":{"text":"The pizza here is fricking amazing. Best pizza place I've ever been too.","useful":0,"cool":0},"esXLGOzehQSvsJ7IVGV1Tg":{"text":"I had a cesar salad and a plain cheese slice. Some of the best pizza I've had in a long ti","useful":0,"cool":0},"7Pj20tIb9iBlLn1-fpoHUw":{"text":"It's really unfortunate that you guys do not deliver the French Quarter being so close to ","useful":0,"cool":0},"eJqssP2DXwkqFWKX24kEIA":{"text":"The best New York style pizza in town, far and away better than anyone else is offering. M","useful":1,"cool":0},"gNXdL_0Apg1esNLIutLgFA":{"text":"Visiting from Los Angeles and was recommended this place!  It was so good, they delivered ","useful":0,"cool":0},"I8TKnd7Z_tkk68cYzpd2Kg":{"text":"This place really was delicious. I was only able to stop in once but I loved the vegan che","useful":0,"cool":0},"BFT2faNPsKsQ5crDf4_jrg":{"text":"Went in around lunch time on a weekday, wasn't too packed but was still half full. \n\nVery ","useful":0,"cool":0},"5KczBrqJgXirYbpYpi5dMg":{"text":"Depending on how you like your pizza, this may not be the best pizza in the city, but it's","useful":0,"cool":0},"CIqY_sKCKkQ2cQzoVLERtw":{"text":"Expensive....very very expensive and all the pasta dishes were terribly mediocre\nAre we th","useful":2,"cool":0},"XcfF4UERs_748NWwzTuf1A":{"text":"OMG!  Garlic knots=yum!  This is my go to place for quality food and reasonable prices.  A","useful":0,"cool":0},"JFNcxbnaz_XhdVm9_UDHxA":{"text":"Very busy cool little typical ByWater neighborhood restaurant. Popular, busy place with fr","useful":1,"cool":1},"_rAMWLa_x_79yAJuqcgghQ":{"text":"We ordered the vegan pasta and the salmon pasta. Both were quick, fresh and delish! Along ","useful":0,"cool":0},"JqntC11yWiW_jyMSmTKEhw":{"text":"Pizza as high culinary art! The folks at Pizza D. are always innovating, mixing unexpected","useful":0,"cool":0},"4hyWwVLBXKf1n3-XKYCdGA":{"text":"Loved it first time I tried them Pizza done just right thin crust and really good sauce an","useful":0,"cool":0},"F-jJat0A3yO6x3UQFkWnww":{"text":"well I finally made it here.   had a pretty simple meal, my man and I both got a slice and","useful":1,"cool":0},"CIlb73sNuISMXub2Yntvdw":{"text":"i love this place! i cant wait for the new restaurant to open - pizza every daaaaaaay!","useful":0,"cool":0},"_tGQbmGLNolquIKQ5U0Vow":{"text":"Everyone is always nice and helpful each time I've been here. Pizza really is delicious  I","useful":0,"cool":0},"LVoyNJecU-8qigphGPrwPw":{"text":"The pizza was good but the sauce could of been better and the garlic knots tasted a bit li","useful":0,"cool":0},"z5zTsKBn7Um7mBJFLJ4hdw":{"text":"I am a fortunate person to live in the delivery zone of Pizza Delicious. Today they had a ","useful":0,"cool":0},"A-mFKdG--Ldu7GizgJyEPw":{"text":"Different. Garlic knots and house salad were delicious. Friendly staff. Was shook by the b","useful":1,"cool":1},"EkrojntrnR0A-kaVvoxlIw":{"text":"Great Pizza and service. One of our favorite places to eat in or take out.","useful":0,"cool":0},"BMUjlG_7uysuJ8QEY8TmbA":{"text":"This place should be called \"Pizza Assholes\" instead. They advertised different slices of ","useful":0,"cool":0},"CQGn9Q7MnMe2NidJXicOCQ":{"text":"Our pizza was huge! Broccoli rolls were delish! So was the pizza. You get a lot for your m","useful":2,"cool":1},"ysJcK0M-5GtYQ8yJzKDW8Q":{"text":"Solid pizza and delivery is typically quite speedy. The cookies are not to be missed!","useful":2,"cool":1},"rcA1Pn8BqYjWowrxq3-0Nw":{"text":"I've never had a bad experience here -- even the vegan pizza is incredible! Their beer sel","useful":0,"cool":0},"fjnsvDs8A32s-S3tCHWi_g":{"text":"What can I say about this place that hasn't been said over and over again? \n\nIts freaking ","useful":6,"cool":3},"ej-F_LuvPH1PmkymEO5v1A":{"text":"Love this place. \n5 stars \nAlways s great place to just hang out and chill with friends an","useful":0,"cool":0},"u-dSqoxuJr48q03BzL8Xzw":{"text":"Bomb ass pizza (especially if you prefer thin and crispy crust). And get the garlic knots.","useful":0,"cool":0},"Fl4FJPAexm3ypxvYY1HlZg":{"text":"I think this might be the best pizza in the state. It's not super greasy and doesn't weigh","useful":1,"cool":0},"x4Mfn8hAnFEbUVS45G_wGw":{"text":"I F$cking love this place. I religiously love their daily slice or pie. Pasta is bangin' t","useful":0,"cool":0},"VwkHJoAFrb_R4vGBX2gLSA":{"text":"One of the best pizza spots in New Orleans. I live uptown and make the drive to piety stre","useful":1,"cool":0},"jNfqTGPVrCGr2my97e083w":{"text":"Cheese Louise this place rocked my world! Definitely the perfect lunch place for a casual ","useful":0,"cool":0},"wZQ1mhHH3UTFiBWPtDo27w":{"text":"Positives:\n-Atmosphere\n-Taste\n-Underground feel\n\nNegatives:\n-Long, long wait (they admit t","useful":1,"cool":1},"UntX6Zjx1DgYy-ezIN06zQ":{"text":"YAY!!!! So happy they finally moved into an actual restaurant! GREAT food... everything  o","useful":0,"cool":0},"W4nR3X6YNQW2TsZQ0vwczA":{"text":"The Pustanecca pizza, may be the best pizza, based on pure heavenly flavor, that I've ever","useful":2,"cool":1},"tl4zVLPyK9Q2iPf-01gsqw":{"text":"Ok I should say I'm from New York. I am reallll picky about pizza. This place is top notch","useful":1,"cool":0},"OFPvra4ISdU3y6l0wPBGqA":{"text":"You know it's typically a SMASH hit at Pizza Delisc, but today the pizza was a bit cold an","useful":0,"cool":0},"2ktRvRvBGCD8QpYHbKIb4Q":{"text":"The best pizza I've had in LA by far!!\nWish I lived here, they would be on my speed dialNY","useful":0,"cool":0},"DCXb4GX8YTLA9cTixL8Wjg":{"text":"This is the best pizza in NOLA. I come here again and again. The staff is friendly and the","useful":0,"cool":0},"x2lLSseLshaPrrCgs17mRA":{"text":"Expensive but worth every penny. Not a lot of places can survive in a neighborhood on its ","useful":2,"cool":2},"Kwz0We_bhBOtqjDl-YKBNQ":{"text":"We decided to spend a weekend in the Bywater just to enjoy a different part of New Orleans","useful":0,"cool":0},"0Tw1L_oZK-xYLRMcJzp7Ng":{"text":"Pizza D is great!  I tried a slice of pepperoni and two of their specialty pies, and I mus","useful":0,"cool":0},"I-_GAX883oqf4MlsvAAktQ":{"text":"Pizza Delicious comes well recommended, and for good reason. Arguably the best thin crust ","useful":0,"cool":0},"iw9__t3UflTKJhzzId3kTg":{"text":"Amended review. I gave them another shot and it was the regular folks I was used to in the","useful":0,"cool":1},"PpouknPOgZHwkW1g3AtRIA":{"text":"The best, Jerry! Don't forget to get a cauliflower or broccoli roll. I like mine with a si","useful":0,"cool":0},"uGbDTQcPioCA3cvB7J8Q-g":{"text":"Stop the presses.  I have definitely found my go to pizza joint.  And this place is defini","useful":8,"cool":4},"QVDI4YYg0SREM9FtimlaaQ":{"text":"Disappointed. Going back to Reginelli's or Theos. Not for me. Great building. Great people","useful":0,"cool":0},"FvqirkGaa7aIvGoW1CmgxA":{"text":"I've eaten at Pizza Delicious twice and I'm impressed. The specials are interesting (one t","useful":1,"cool":0},"kJF0Jhco83D2tTNX4lT3kQ":{"text":"Pizza Ordinary \n\nWife and I decided to try out this place due to the great reviews. We ord","useful":1,"cool":1},"8U9Cff3i8H6NiPWbn91Pmg":{"text":"Love the pizza - I just wish it was easier to get a seat! Outside seating helps in the fal","useful":0,"cool":0},"ctHQZZzkvfanu_Y9YJZCsQ":{"text":"Pizza D, Pizza D, Pizza D, what is all the fuss about?! The good things, staff is super fr","useful":2,"cool":0},"GII-dszU4g3eCM2CrUeDMw":{"text":"Let me first say, I was an obese Italian man in a previous life. Just kidding. However, I ","useful":0,"cool":0},"fHuAQxEA8k1cuS8GzmA_sQ":{"text":"When I heard there was an NYC style pizza place operating in New Orleans I was, to say the","useful":3,"cool":1},"fHo856nTARtrPg8mHNyakg":{"text":"This is definitely the best NY style pizza I've had outside of the city itself. I grew up ","useful":1,"cool":0},"5Xw-9hnlUTTWmNmXBKMZ_w":{"text":"I love this place!!! They keep it simple.  They have your standard pizzas available everyd","useful":0,"cool":0},"3IiU2jrnMzaIvW9tmdGI2Q":{"text":"Well, I'm not thoroughly disappointed... the pizza is good. I've only eaten here for the f","useful":0,"cool":0},"vURZS4KQYprdVaNVCYf98w":{"text":"I am still looking for the best pizza, but since I've had Pizza Delicious, I haven't been ","useful":1,"cool":0},"W7qnwQPlt9mDFQV55R6yAg":{"text":"Read about this place on yelp. We tried the eggplant parmesan with thin crust. The pizza p","useful":0,"cool":0},"ApCStm4m4RGlOnh0gwg6HQ":{"text":"I enjoyed most of the sides. I like the pepperoni roll which was different from anything e","useful":0,"cool":0},"k84OYs7HsqSBMlQLbsJP6A":{"text":"Amazing pizza, what can I say. The pepperoni roll and cauliflower roll was to die for and ","useful":0,"cool":0},"c8AKLN06TGDmuMBAqvrfGg":{"text":"2 slices of pepperoni, caramelized onions & fresh garlic (they were out of roasted garlic)","useful":0,"cool":0},"eSy-biU314vq2XV3fiElmA":{"text":"Docked two stars because we waited 20-30 minutes for four slices of pizza and an order of ","useful":4,"cool":0},"DpDpfPHvBJFnGgPUclJMYg":{"text":"The first time I went here I ordered a cauliflower roll with my slice. Gotta say, it was q","useful":1,"cool":0},"xmwP-dquOwtW2IYDwR5sdg":{"text":"The name says it all! I love that you can get pizza by the slice. The atmosphere is cool a","useful":0,"cool":0},"ojHy2JLGqHLpKfii1XZw7A":{"text":"I hate reviewing a business that has already been reviewed so many times but the pizza was","useful":4,"cool":2},"pF4bVcJcNx0FrmMbeog1yw":{"text":"Finding a solid pizza in New Orleans has never been on my list, however, a few years back ","useful":0,"cool":0},"JG6QE8gwWK98rIE5Ls_R6w":{"text":"Loved the pizza and atmosphere.  So excited that wine was served in a rocks glass - just l","useful":0,"cool":0},"Mf9rYxh2gCzjtDjGSxf7bA":{"text":"I pretty much exclusively worship at the church of Pizza Delicious because it is by far th","useful":0,"cool":0},"oq6srRst0-MTxhJqNMcRTA":{"text":"this place is great...but....\n\ni've found hair in my salad 2x in the past couple months.  ","useful":0,"cool":0},"AGoXzHTt2VjmuXRTGpYwug":{"text":"This is the best pizza I have ever had next to some pizza I had in Brooklyn NY. Every time","useful":0,"cool":0},"NspkFt_MYSnZSyKbSm_4Ow":{"text":"This place makes great pizza. It's as close to Philadelphia style pizza as I've had anywhe","useful":0,"cool":0},"ZdmJD7CIW5Y-X57gZcr70g":{"text":"The perfect pizza for me - thin/chewy crust, well balanced sauce, super cheesy, high quali","useful":0,"cool":0},"Q-gsX8u13AMFIqaPKBp0Gg":{"text":"Pizza is fantastic and the garlic knots are so great. I definitely would recommend the gar","useful":0,"cool":0},"BFSB2tQd1scKZgYXmmOlPg":{"text":"I first noticed this place when going to an event at the IronWorks across the street. I sa","useful":0,"cool":0},"6Snii33js18G_4WzAdtUIQ":{"text":"Ok My wife and I love Pizza Delicious, but I was very disrespected when the Blonde Cashier","useful":0,"cool":0},"iGbV0rewPq-ulCKucIvaQQ":{"text":"For about a year, there was a pizza-sized hole in my life. Having moved from Brooklyn to N","useful":2,"cool":1},"rSS09z9fm4geRUYX4SS43A":{"text":"Update: 6/6/13\n\nI JUST wrote my review of Pizza Delicious yesterday (see below.) It was my","useful":2,"cool":0},"YBR2eVfNWUjcw9NxSC13Eg":{"text":"This is the best pizza in the city, in fact, its the only pizza here that I love.  Huge, s","useful":1,"cool":1},"zaJ1GMIojN296tOy2XQxNg":{"text":"Had pepperoni and the white pie special and it was about as good as a pizza can get will f","useful":2,"cool":2},"_-qOU---VHoUvN2lIB-XeQ":{"text":"There's one pizza that I've tried here that I absolutely loved (the Hawaiian specialty) ..","useful":2,"cool":2},"5H_KqlENxZqmjVVLYIH3CA":{"text":"The new location is great and they now have beer  & wine! They have done a remarkable job ","useful":0,"cool":0},"cRb5WPWQZXcjldo9kQpYcw":{"text":"Pizza Delicious has brought great pizza to New Orleans. Not only does the pizza taste incr","useful":0,"cool":0},"iQTUf5x_PXVeIgdlNkflTQ":{"text":"This pizza is to be savored. I may have to start getting a weekly margherita pizza fix! Th","useful":0,"cool":0},"HJaZTaagOZkssw1RDOJTeg":{"text":"We visited last night and it was the best experience ever. We had an issue with our first ","useful":0,"cool":3},"3mOjQWNN9tRAVDZ7vBQ3tw":{"text":"I love this place! Fast service. Friendly staff. New York style thin crust pizza and I can","useful":0,"cool":0},"ZaF0217ev9rBedTWPDULnA":{"text":"Pizza Delicious is aptly named. The pizza is, in fact, delicious. So delicious it probably","useful":0,"cool":0},"bnehArz1h597aeMAmaJFaw":{"text":"Forreal, the most Delicious of the Delicious: the garlic knots. On a good day, they pull a","useful":1,"cool":1},"2ax8QmGD1A9jFLySk9irug":{"text":"I am a born and raised NYer. My family is from NOLA so I moved to NOLA last august to be c","useful":1,"cool":0},"SSWzzQmc_fgJbWWgumDb9Q":{"text":"There is a reason delicious is in the name !!! We went there one night before the Lion Kin","useful":1,"cool":1},"J61IC6cIp9id1uTCJEafag":{"text":"This is indeed the best NY style pizza in New Orleans. It's fun, too, because it fulfills ","useful":2,"cool":1},"NF5s9I3GpE99XeR3nWlJFw":{"text":"This is good pizza. It tastes yummy. Good stuff there. There is great service and the peop","useful":0,"cool":0},"wzvKYW4bB45j2XIO-o0g6Q":{"text":"Heaven on earth. Must eat for pizza fans. Had the white pizza with olives and garlic knots","useful":1,"cool":1},"2bqHmzYZYriugeqqnI5_OA":{"text":"This is one of my favorite places. It's a casual, cool environment. The kitchen is open fo","useful":0,"cool":0},"QcXmPWQVhukZ3LOdLHDBNQ":{"text":"This place has \"pizza\" down to an art form. Fresh ingredients, great atmosphere, friendly ","useful":1,"cool":0},"OpOIpV_9fObTkeob2cX82g":{"text":"My goodness, I love me some Pizza D. Great environment, stellar staff, and the best pizza ","useful":0,"cool":0},"b0quQPX9fOwZLkFNOW8LdQ":{"text":"You want REAL pizza? Come visit here. Also, treat yourself to the garlic knots with the ma","useful":1,"cool":1},"0R1BDZcbrEn8FEbJiPebEA":{"text":"The name says it all. REALLY!  With all of the great AND plentiful spots Nola has to offer","useful":0,"cool":0},"IbrQa4IRN0Tk6PJhbY2vxQ":{"text":"I've been here twice.  The pizza is huge!!  It's also really greasy like Italian Pie greas","useful":0,"cool":0},"3eQ2PWwxycGqvcgXYE3VxA":{"text":"The pizza is a decent reproduction of New York style pizza, nothing special. The service i","useful":3,"cool":1},"TzA64wyd4YeW0NxVh9S1fQ":{"text":"You know the pizza is good when your friends from New York request to go here when they ar","useful":1,"cool":1},"9dTw2brUqjb9fHlfOGiAYg":{"text":"This place has creative pizza and taste salads. I always enjoy it when I go. It has been a","useful":0,"cool":0},"MEbPDw7jh2K13ITU4xZqGA":{"text":"I've been here multiple times and pizza has been phenomenal. Unfortunately, this last visi","useful":1,"cool":0},"vDKLiT1OteJq497PcILyyA":{"text":"Pizza Delicious is the kind of place that has a story that is both interesting & compellin","useful":7,"cool":5},"UaivYdfuB6eHBzKJ614Mgg":{"text":"I will say the Pizza was pretty Delicious, by New Orleans standards. There aren't many spo","useful":0,"cool":0},"1k30D4hZBk63EWXa6hD4Lg":{"text":"Funky/fresh part of town - will definitely come back for the Saturday Piety street market ","useful":1,"cool":0},"Z-E_qR0944p15MqWfK7rMQ":{"text":"Pretty disappointed with this pizza. Our uber driver suggested trying it because it is sup","useful":1,"cool":0},"rRKQy83_IFteGA0I3w2Z8w":{"text":"Awesome place! Whenever I want a good pie I get takeout from Pizza Delicious. It's aptly n","useful":0,"cool":0},"t_Qab_vcrexqEMhHpYMqWQ":{"text":"This place is AWESOME. The Pizza and salads that we ordered were amazing.  Rating it a 4 b","useful":0,"cool":0},"Jx6ejGc1UNsC5cTm0Vj_-A":{"text":"So thankful to live near Pizza D. I come here almost daily for the pizza, but it's just as","useful":1,"cool":1},"aY-oXQXhFZsOgrm1GZlEAg":{"text":"The pizza here is hands down the best in town. The crust is so mouth-watering good and the","useful":0,"cool":0},"OYCuOEGS6e1m9iWGXl9XKw":{"text":"I am happy to drive all the way across New Orleans for this New York style pizza. The slic","useful":0,"cool":0},"TvMO7NPQIJneVRt7Bji89Q":{"text":"Pizza Delicious  = Delicious Pizza! This is definitely the base for New York style pizza i","useful":0,"cool":0},"h4C0Phy_Hlgm9jbxcZIMUw":{"text":"Nothing special, especially if your used to good pizza. Only had slices which were served ","useful":0,"cool":0},"0y9uHGsIzrG1hnpBCG1Wrg":{"text":"We visited from New York and loved loved the restaurant.  The pizza is great especially th","useful":1,"cool":0},"jJ3yZuv47xqqtgH1T-JObw":{"text":"Interesting out-of-the-way place but the pizza was a disappointment. The dough was tough. ","useful":0,"cool":0},"eCiOvoC85bMlEEr6RAPSkg":{"text":"Best pizza in NOLA hands down. Pizza in New Orleans is generally pretty meh. Nothing comes","useful":1,"cool":0},"WDCcBBd9gfJrhDyaAXrpGA":{"text":"My husband and I had pizza delivered to our hotel the night before we were married a few y","useful":0,"cool":0},"5Bm58l98LmiQMYDJC4Cdcw":{"text":"Okay, so first & foremost, it should be noted that i'm originally from Philly & surroundin","useful":3,"cool":2},"REbJHF3XGGptrCcmB-vLFA":{"text":"Pizza is freaking awesome here!! My new favorite pizza spot. Had it a few time. Loving the","useful":0,"cool":0},"2Cfzz_X1VpUl0Y-7uyhLAg":{"text":"Wasn't expecting top notch pizza out of New Orleans but this place blew my mind. Probably ","useful":1,"cool":0},"a1EPeyLoLo_6CKr35hg7Cw":{"text":"I went here because everyone I know raved about it being the best pizza in New Orleans but","useful":0,"cool":0},"haBFe1Brt9WeH0gn4CZCtw":{"text":"As a local and a New Yorker I approve. I have also tried pizza all over the city and have ","useful":0,"cool":0},"jK3XXwwYfCJrLxBHr4pGuA":{"text":"You know what's better than their pizza? Their garlic knots and pizza rolls!!!! (Broccoli ","useful":0,"cool":0},"b7TfYcCUsBeMuLG9mNad9Q":{"text":"I got a pie from Pizza D a little while ago that was just really, really salty. I mean it ","useful":3,"cool":0},"xh6WvACkVpkUatk_Dj_vHQ":{"text":"Pizza Delicious is not falsely advertising by taking on this monicker.\n\nIt's the best pizz","useful":0,"cool":0},"ufxEnadUzJWKgH3EYauESQ":{"text":"I stopped there to day for a slice of pizza I had two slices and my word don't know what I","useful":0,"cool":0},"WRqME0b_Dc9H3UL2jtfKRA":{"text":"Pizza D has gone downhill, I'm sad to say. Not sure who's making your pizzas anymore, but ","useful":0,"cool":0},"BV8DzZIaRfb5c8_FN_b7zA":{"text":"Slices are actually pretty small and they charge extra for vegan cheese on the vegan pizza","useful":1,"cool":0},"H8SwJnserNzmNfzsr0PXyA":{"text":"The carbonara pasta was delicious! The pancetta in it was nice and crispy! And the outdoor","useful":0,"cool":0},"Qinl2iZM3bcpeyMoWo7Dww":{"text":"No question this is the best pizza in NOLA. If you doubt me, have fun proving me wrong. On","useful":10,"cool":8},"XWjI_wVDTBvLE7KFcNInGw":{"text":"Awesome place that was recommend by a fellow local. What a name I thought when he told us.","useful":1,"cool":1},"gxzQ9lqmScU6e_7bTJuRiQ":{"text":"We ordered based on the recommendation of our air bnb host while visiting from the suburba","useful":0,"cool":0},"Nrsmk_27q_t50pi1YUVqwA":{"text":"The best vegan pizza I've ever had and such wonderful by-the-slice portions. Made my day a","useful":0,"cool":0},"yRV0Ro6AXWBqivvCZVnzHw":{"text":"Guys this pizza is just fine. It's definitely not the best pizza in town, but it's good. L","useful":0,"cool":0},"IzW9_TD1C7gJEiM8l12fqg":{"text":"eh, I have to update my earlier review when PD was on Rampart.  Now, I LOVE that they have","useful":4,"cool":1},"tzwAQxaUa541sM59JRwk_g":{"text":"I am getting backed up with reviews piling up, so I'm going to consolidate several visits ","useful":10,"cool":5},"Twkru_AOZFKpLQ9FdSofxw":{"text":"Although I can't have pizza, I went with my husband to try Pizza Delicious for his birthda","useful":5,"cool":0},"JgczctQC62vXEAMBYRuXdA":{"text":"Big pizza pies and quite delicious too!\n\nI am def going back for seconds!\n\n...Oh, I had a ","useful":1,"cool":0},"XK4663ocVq__o-TeiDmNEA":{"text":"SO happy Pizza D now has a permanent home on Piety. And that I have a gym membership to wo","useful":2,"cool":1},"r4iOJDN943_P9y4y-CJHXw":{"text":"I just moved here from Florida, and kept hearing about the amazing pizza at Pizza Deliciou","useful":0,"cool":0},"kK243xzwczp8gkr0UnsPTQ":{"text":"Pizza Delicious was pretty delicious but the service is not that great. We went for my sis","useful":2,"cool":0},"8Hk9_HtW_zC2itEU8Jsoig":{"text":"For all you New Yorkers who miss good pizza, you have to try Pizza delicious.  Its amazing","useful":0,"cool":0},"0CdbGHEBkC4pGQELTedHVQ":{"text":"Great little pizzeria.  The ordering and picking up are definitely part of the experience.","useful":2,"cool":1},"pqKPfTov122R40W8RCMUFA":{"text":"I would have to say this is the best pizza place in town. The dough is just too good. I gu","useful":0,"cool":0},"g9ROIXVVI_jAISAFAvAP3A":{"text":"This is the 2nd best NY style pizza in New Orleans. Most NY pizza here is woefully inadequ","useful":5,"cool":1},"jAAEhxiKCrlLOTVM6t3R9Q":{"text":"Pizza Delicious is an absolutely appropos name for a place that makes amazingly delicious ","useful":1,"cool":0},"skADjeLZfp3hXUmpnNK3Dg":{"text":"I eat here because it's probably the best pizza in town. But let's be honest, the bar is a","useful":1,"cool":0},"9-4O2mHYCzfSpI4TMDPPCQ":{"text":"Picked up a margherita pie and it was on point. The place looked inviting. If my family ha","useful":1,"cool":0},"607ca6gRz57WWT-lAmNMOg":{"text":"I may not know about authentic New York pizza but I do know about good food. Pizza Delicio","useful":1,"cool":0},"Be9pInoZ0_lY5IexqBwzQQ":{"text":"Pizza D is my favorite pizza place in all of NOLA. Seriously. It has a great atmosphere, f","useful":0,"cool":0},"IgaRS9ZeRctxSAJlXd4ffg":{"text":"I was visiting relatives in the Bywater area and was in the mood for pizza. I Yelped for t","useful":2,"cool":1},"8D0He5NwSPFCx8yro9l_bw":{"text":"How aptly named this place is! I read about this place online before I visited Nola and I ","useful":0,"cool":1},"_QXy56KQvc4V0IFI_DUrmg":{"text":"I came here Friday for dinner.  We ordered the marguerita  pizza.  It seemed like it was t","useful":3,"cool":1},"uzJ2iXyVfGP0Jw3SzmYbCA":{"text":"Two of the best places for pizza in New Orleans are here in Bywater- Pizza Delicious is on","useful":0,"cool":0},"33DFxoMsJDKQDXMNgfGFMg":{"text":"I have loved and supported this place and their project for years. Back in the day, you co","useful":6,"cool":3},"vo5PovpXtyGZI_AeLlRMyw":{"text":"Pizza Delicious' pizza is on par with, if not superior to, Vieux Carre's pizza as far as q","useful":0,"cool":0},"cnYKpVcZ_mu3wbe6Gh6q5g":{"text":"Summary based on one dinner:\n--decent food at reasonable prices\n--good service\n--remarkabl","useful":1,"cool":0},"0y0Ww6R051tjgZaW-X3klg":{"text":"Love this place! This is the kind of pizza that when I take it to the bar I feel compelled","useful":1,"cool":1},"nqmw2_lERNnmbtM8zdGjKA":{"text":"Love, love, love this place. The pepperoni rolls are my favorite thing on the menu. But th","useful":1,"cool":0},"JVNmff-q0hKwhuhLG6Sr_w":{"text":"Loved this place. Don't let the outside detour you. The Hawaiian is the best!! This pizza ","useful":2,"cool":1},"b4wn1Zx7nSacUCmGd0JMRQ":{"text":"This place is decent at best.  I guess I'm a pizza snob from new York but I am not blown a","useful":2,"cool":1},"RQtjVRsZH5yQltX3d1yQDA":{"text":"Like other reviewers have said, this is definitely the closest to East Coast pizza in NOLA","useful":1,"cool":1},"QmWOaCqzc4Ua9eulPM1KDA":{"text":"Great seafood. Ask for the hot chocolate cake dessert off the menu.","useful":0,"cool":0},"5j52NtPcdMZoyfex9SWXxg":{"text":"Ok so this is my third time at pizza delicious. I still don't get it. It's good pizza don'","useful":1,"cool":0},"Zms7ZuGCm0yfhQ9l8nKcYQ":{"text":"I've heard great things about Pizza Delicious, but it honestly wasn't amazingly delicious ","useful":0,"cool":0},"AqJbl87rt3xgIwCpzug7ZQ":{"text":"Best pizza in New Orleans by far.\nBut c'mon guys you need to deliver to more of the city!!","useful":2,"cool":0},"c5UvmUogtixffHErjzlbJw":{"text":"OMG! Pizza Delicious catered our daughter's vegan wedding reception. The food is amazing,\n","useful":1,"cool":0},"eRnxrLmU-foUrGfskZW8lQ":{"text":"I love this place: the best New York-style pizza in New Orleans, for sure. I've been sever","useful":0,"cool":0},"mVSW-dRS8FL3UYt_Yn48eA":{"text":"Super impressed on the first visit. We had the simple pepperoni pizza and it was fantastic","useful":1,"cool":0},"acH7XdVdZm0MfCHFQl4waA":{"text":"The place is fine, but nothing special.\n\nYou can get pizza and beer, and the price is fine","useful":1,"cool":0},"-6-xB_fSytc2xzW918tQsg":{"text":"Great food! Ordered a pineapple and pepperoni large pizza. Great service! Fixed any proble","useful":0,"cool":0},"3fmnX9SJ5P_qy5M5tAioJA":{"text":"Love, love, love. You know that you love a place when you smile seeing a text from Bywater","useful":6,"cool":4},"kdK8cA1sC4d7TV3iUdo6nA":{"text":"Perfect pizza. Best in town. Drive from uptown across town all of the time. For a big pie.","useful":0,"cool":0},"roEQk4t8uIM50-MdtPUrpA":{"text":"I stopped in because of all the whoop la, and I was mildly disappointed. I got two slices ","useful":1,"cool":1},"YbxrvyOPUMKC7fqm9Fb8cQ":{"text":"Solid thin crust pizza. I always appreciate a place that sells by the slice but we opted t","useful":0,"cool":0},"9wRy0InTgSXeQiFSzauCbQ":{"text":"Always packed. They served my beer through a window while we waited for our slices. Super ","useful":1,"cool":0},"AUgN3WLOSt0_U47gppxINQ":{"text":"Best pizza in New Orleans; take it from a New Yorker! The new location is comfortable and ","useful":0,"cool":0},"cUX3Et2TOJV5nGLYtt_yhQ":{"text":"Yummy! The vegan spinach and roasted garlic with daiya cheese was good. It had a bit of a ","useful":1,"cool":0},"wIo3IqnRUUnMVEOTMyyuWA":{"text":"I moved down from New York about three months ago and have been on a mission to find New Y","useful":2,"cool":0},"12h9Y7_yZ7M2sFxBcpEi1Q":{"text":"The smell from the street will immediately pull you in thin slice pizza with great flavors","useful":0,"cool":0},"-5kYE-RsuJSND8xgJZfL_w":{"text":"Very good pizza and salads the pizza is thin crust i recommend the restaurant and is also ","useful":0,"cool":0},"wn1MfwR9RxtEkbEVLS0y8A":{"text":"This is not my first time eating. Generally speaking the New York style pizza was one of t","useful":0,"cool":0},"JMQ6ZTSaZl44FsHN0Ln_9g":{"text":"This pizza is...yes, you guessed...delicious. They have big, New York style slices...and m","useful":0,"cool":0},"ocKQcdF8lgNVmAgW8PXIiA":{"text":"Finally stopped in at a time where there wasn't a crazy line and ordered two pizzas, chees","useful":0,"cool":0},"_l3UwgxRS12rsd4FjCBWOg":{"text":"Add far as I'm concerned it's the best pizza in New Orleans. The cauliflower rolls were a ","useful":1,"cool":0},"Xg2zy6CyHlx29SNhT--ioA":{"text":"Best pizza in all the city of New Orleans is conveniently located down the street from me.","useful":2,"cool":2},"_Zkdfkio7bzTyJGXfzQDXA":{"text":"Here's what I have to offer by way of high praise: If I were to live in New Orleans Pizza ","useful":4,"cool":2},"zLq4N7oQse4ysFJARfheLg":{"text":"New Orleans has a lot of amazing food but it lacks solid pizza. This place is great! It's ","useful":1,"cool":0},"vmPOw-a8seflmuYt2H0i6g":{"text":"Very good pizza! Reminds me of New York. Pizza and wine how can you go wrong? Wish the out","useful":1,"cool":0},"u5dy6PaURDJ1Nus8uF65Wg":{"text":"Artwork and decor is amazing. Employees are personable and pleasant..the pasta,turnip,pork","useful":1,"cool":1},"-2n0eO07I0keeWQ1lH2B5g":{"text":"Cheese pizza delicious. Herbal flavor sauce. It definitely was not plain dough or over sea","useful":1,"cool":0},"lS1cyopiNszvi5fIRshIew":{"text":"This came highly recommended from a NOLA local in the neighborhood. We ordered a large che","useful":0,"cool":0},"2HzfVIINmfTR6kRZS3YVQw":{"text":"Their pizza was pretty damn good, but the place is a little too well-lit & pretentious. I'","useful":0,"cool":0},"USwD8AfmC3pnIiqj71dxlg":{"text":"My girlfriend and I ate there for the first time this Saturday (June 21). Almost didn't bu","useful":0,"cool":0},"KD4pyW04rFY7H-cXt2o26Q":{"text":"I've been wanting to try this place for a while, and while driving my friends to NOLA to d","useful":3,"cool":0},"xbUaDIR-m9K8RqVhB3FL6w":{"text":"Fantastic pizza and especially salads and pasta. The pastas change but if one appeals to y","useful":0,"cool":0},"1yMRTdrGeuiDvVh4B89TzQ":{"text":"Oh......my........gawd!  They are open more than 2 days a week now........permanent locati","useful":0,"cool":0},"jkMTQKa2QEpiGjaDSPEAkA":{"text":"Great pizza! Cool place to hang out! Only thing is if you want another beer you have to le","useful":0,"cool":0},"fNJVM8R8ORh7stpb56MnYQ":{"text":"Awesome! That's the only word that can be used to describe the pizza at this hidden gem in","useful":0,"cool":0},"yvSIajWDgqUK462Kfvf4Dw":{"text":"In a word, fantastic!  Pizza D is a great place to eat if you're visiting or a local.  Be ","useful":0,"cool":0},"C8VP3BtcykRwmny8YxBSBQ":{"text":"It's great pizza!\n\nIt is, it's just whoa out of the way for me living in Mid city. If ther","useful":10,"cool":5},"5qJO1BNJCynz8mwaSu5UFg":{"text":"I'm really not a pizza person but given the hype I had to try Pizza D. So glad I did. Exce","useful":0,"cool":0},"gjJHre6-B6ngYGLvPtYRdw":{"text":"I love how they have vegan pizza and for just under 3 dollars, I can get a huge slice of v","useful":0,"cool":0},"xAQGEn0tilWdJSbXV2mp0Q":{"text":"I always welcome a new pizza joint in New Orleans and this one really hits the spot. For a","useful":0,"cool":0},"-5RojnXAxbtf76IHPEU9WQ":{"text":"Used to think they were the best but they really aren't friendly anymore. If you are burnt","useful":0,"cool":0},"oBb0dc6Dy9n77H68-7c93w":{"text":"Great, great lunch spot. Delicious Pizza and garlic knots! Always a quick lunch option if ","useful":0,"cool":0},"-Hod8MF9bGlZaVctNduXNA":{"text":"The barista at our hotel (Catahoula Hotel = awesome too) recommended we check this place o","useful":1,"cool":0},"tGy-sZge3Pd0JH7R-zUmkA":{"text":"Well, we've been visiting in New Orleans beautiful historical Bywater district for about a","useful":1,"cool":1},"Wkq1jeGhr1YSlRB2LbKAsg":{"text":"Really solid pizza. We took pies to go but the room was cool as hell with wonderful art in","useful":2,"cool":2},"2mWPKM6aHI5GAXeovaND6Q":{"text":"The name says it is, delicious NY style pizza! The plain pizza and margarita are both deli","useful":0,"cool":0},"a88eRp25nbeL5FWeB_asyg":{"text":"If you ask yourself if walking 45 minutes one way for pizza is worth it, and the answer is","useful":0,"cool":0},"oqQ2pISf1J5-MbEL1O2xDA":{"text":"Finally had the pleasure of going to Pizza Delicious while attending a wedding in NOLA.  O","useful":0,"cool":0},"8JCvBwFL6jX-2muzpa785Q":{"text":"I've been here three times now. At the first visit, I only had salad, so thought it would ","useful":3,"cool":0},"rw6p2zxVXGvjjxKLuDw2aA":{"text":"Pizza Delicious is just that, delicious pizza.  I feel like such an idiot when friends ask","useful":0,"cool":0},"qaD-djne7OR9jkPAWfvskQ":{"text":"I know it's called pizza delicious but what in LOVED was their rolls.  It's like little sl","useful":0,"cool":0},"cu3sXeVK8RRA4_ZPooj5qQ":{"text":"My husband grew up in Brooklyn, and this is the only pizza in nola he swears by. Last time","useful":1,"cool":0},"EjAXs7bkGfae-7dZvufnyw":{"text":"Really good pizza, nice folks, etc. Excited for them to open a storefront on Piety.","useful":1,"cool":0},"SNOG_vbHW_E7T9TlIOR8kw":{"text":"Pizza Delicious...wasn't. \n\nFirst off, put some kind of signage up to let people know how ","useful":12,"cool":6},"M-Syxbjf8-10r1OIYW5YBg":{"text":"pizza is amazingly good and service is very nice. our food doesn't take too long and they ","useful":1,"cool":0},"bPf-ebK2gIBgl9t_Ov2GpA":{"text":"Eat here all the time, and get delivery.  Everything is good, most is great.  Unless you c","useful":0,"cool":0},"b1cMKVyCl2evzZEhCWGt2A":{"text":"Good place to grab a quick piece of New York style pizza. The new renovations didn't make ","useful":2,"cool":0},"icq1xPNDX-n07T0LdCRBog":{"text":"Had a chance to order their margarita pizza and boy was is good. It was a pickup order so ","useful":0,"cool":0},"DBNmIE04xOS-DNRWJmV6Sg":{"text":"If you are looking for good vegan pizza in New Orleans, this is the place. There has only ","useful":1,"cool":0},"SwsDI8WTR2UY-R44w0t80A":{"text":"I mean one giant slice of NY pepperoni pie and a pint of beer for $5.25....killing it!! Ye","useful":1,"cool":0},"LOOvCGaTR2ZYfVYnlEXFdA":{"text":"I'm sorry, I don't get it. Maybe it was bc all my friends and coworkers are always raving ","useful":0,"cool":0},"BGQ1TjW1d-uSwZC6L1iFkw":{"text":"I have never written a yelp review before so this is a big deal for me! I moved to New Orl","useful":0,"cool":0},"QcFcLK3D5SGoR70vCW9cpQ":{"text":"Nothing Like the Real Thing, Baby\n\nI was in NY years ago when it struck me that I'd never ","useful":5,"cool":4},"wDsHu-kpHGKpG9rRyw4ytQ":{"text":"Definitely the best crust in the city!  Roll things and the goat cheese salad were just ok","useful":0,"cool":0},"L_SWuHm8j79_wmFRtU54aQ":{"text":"***PIZZA DELICIOUS WILL BE CLOSED FOR 3 WEEKS IN AUGUST!!!  CHECK THEIR WEBSITE...THEY NEE","useful":2,"cool":1},"Hl36QLlOnWxV92NgxjVuxQ":{"text":"Recommended by our AirBnB hosts nearby. We picked up to go, but the space is nice in a sli","useful":0,"cool":0},"15AcpiPN2kAqnZnKpLaBEQ":{"text":"If you've moved to New Orleans from anywhere in the NYC area, or have ever experienced rea","useful":0,"cool":0},"ZF_Rj2TemQF4UHGkCo0QMA":{"text":"If you have a Yankee friend who will not stop complaining about the pizza available in New","useful":1,"cool":1},"1s1UWAtpWqK9ncD7mTAIfQ":{"text":"This place had the best bowl of pasta I've had in years. The spinach rolls are fresh and d","useful":0,"cool":0},"Pt9k6HkER6ylHyWHXs3h8A":{"text":"We love this little place! The pizza is always great and the salads are good too. The sala","useful":1,"cool":2},"o53QNg9lk9HbrrNZMJhVPQ":{"text":"I just had the most perfect slice of pizza. Perfect cheese to sauce ratio, not slippery, p","useful":0,"cool":1},"0xC_N9fTk9tEgqP2R00TXQ":{"text":"Great pizza, pasta and salad!\n\nQuick and excellent customer service!","useful":1,"cool":0},"DQ178R9fCCo-XWDbNsrBcw":{"text":"Let's face it: New Orleans hasn't exactly been a great pizza town. Sure, there are recent ","useful":0,"cool":0},"ir4I2oW2AnKn0CXAwsaaSA":{"text":"I am in love with their garlic knots omg!! To die for !! I missing them so much right now ","useful":0,"cool":0},"NQuED6FzvV9mK5Fx6IXbog":{"text":"This place is soooo good! Easily the best pizza that I've had in New Orleans. The dough is","useful":0,"cool":0},"d_ZgF8rniFVe4azm-6Kq4w":{"text":"Here every week. Great NYC style pie made with great ingredients. Cool crowd, no seating. ","useful":1,"cool":1},"_QVsrmTBfENFLdxfEiIskw":{"text":"Really hoping that someday I'll be able to enjoy pizza from somewhere else ever again in m","useful":0,"cool":0},"AgZy_hoTSCcSsEm6da6uRw":{"text":"Line was out the door of this very popular pizza joint. We came on a Sunday night at 8p an","useful":0,"cool":0},"AowwyVUTLwyIWkRuGPvvPA":{"text":"Uneventful. The atmosphere is decent but not much about the pizza really stood out to me. ","useful":0,"cool":0},"rbtevOqWm2Ka-BoPHVLSUA":{"text":"Very good pizza! \n\nYou can get it for later by asking & they will undercook & not slice it","useful":0,"cool":0},"GJHHuAA2Qt8hWki_c2J9ug":{"text":"Their cheese pizza is not special. While thin, it is too thick and chewy to be good New Yo","useful":1,"cool":0},"P4fJ196UjeZacfg--QjUaA":{"text":"My weekend isn't complete without a trip to Pizza Delicious, and it's also great to have t","useful":3,"cool":3},"TEBiycLQAwFNz4sBEle6Yg":{"text":"4/3/2013 Pizza is Delicious!. I had been wanting to try this pizza since they were a pop u","useful":0,"cool":0},"5fMJR_xCu-Ca6OsZHq2e5A":{"text":"Lots of hype, and while the pizza wasn't bad, it did not match up to neither the hype nor ","useful":1,"cool":0},"B_VtMuGA_NFrO5hhc1e6Pg":{"text":"We have a new obsession. The pizza here is crave-worthy to be sure. It's thin and large, c","useful":0,"cool":0},"n62Kal2vE3w5-gm1OefwIQ":{"text":"We are frequent flyers at Pizza Delicious, the wonderful pop-up moving to a brick-and-mort","useful":0,"cool":0},"uGY4ap9w0cjfHJFarc4TQw":{"text":"Dare I say that is one of the best pizza places in the city?  Yeah, I think I will.\n\nThe w","useful":1,"cool":0},"7pzA5ceeGq5TSWa7sVwIrA":{"text":"Soooo I was gonna give this place 5 stars because I kinda liked the vibe it has and a frie","useful":0,"cool":0},"ndaPocD8Ey9QuSxh2KMiJA":{"text":"Best pizza in New Orleans. ALWAYS GOOD! \nEvery now and then they have Chicken Marsala with","useful":0,"cool":0},"FoT0AGog9s64R-lFZgGMfQ":{"text":"Pizza Delicious is such a great addition to my hood. The pizza's are outstanding for sever","useful":0,"cool":0},"TZ576MtiudNFAPk5SKeOGQ":{"text":"Damn. This is good. I can't wait to take my friend who owns two pizzerias in SF here.\n\nGre","useful":2,"cool":0},"DwOj2K8J0hArHSeGAEUNiQ":{"text":"Certainly one of the best pizzas in NOLA but I personally still prefer Domenica's Neapolit","useful":1,"cool":0},"I3nAyUclGlqYXie_4VTgLA":{"text":"We moved to NOLA from NYC. Thank goodness for Pizza Delicious!","useful":0,"cool":0},"-8pOxa_xu0ClcVAkh7Oj6A":{"text":"Best cesar salad of all time! Split one with your boo before you eat your pie:) This is th","useful":2,"cool":2},"0Jy5bDgGuTiWsR-7nYm4tg":{"text":"Awesome pizza spot in a cutty area of Nola... But man they're meatball pizza was damn good","useful":1,"cool":2},"VulyyNniUqhlfbYA72L3iw":{"text":"My friend and I trekked to the Bywater to pick up our order-- garlic mushroom pancetta piz","useful":4,"cool":4},"PNZ1L0LnwdRN6wTnu3MaNA":{"text":"BEST pizza ever literally, but SERIOUSLY get better service. I work in the service industr","useful":3,"cool":0},"R5AF3loyb1IZE8AaGK8-Bg":{"text":"Thin, crispy crust. Delicious toppings. Perfect amount of cheese. Do not skip on this pizz","useful":0,"cool":0},"rprMbMERo9P0wKKGxsXlkA":{"text":"Not your typical pizza joint. Creative and tasty slices and pies. slices are cheap too. be","useful":0,"cool":0},"2pBvwKI5Mniza-wrtjtlew":{"text":"I am in love with this place. I have been there three times in the past month and I do not","useful":0,"cool":0},"2AHqmMjYHISlPkA2bbZKag":{"text":"My wife and I made a special trip over to Pizza D because of all the love we had heard fro","useful":2,"cool":0},"CSzQYT7K1vT5WT2TIcQlrA":{"text":"I'm sure everyone has gotten the point by now by all the reviews, but I have to jump on th","useful":6,"cool":4},"HSfo5xzM8pxaDyDDd6WEiQ":{"text":"The pizza is delicious, obviously. But This is about the basic house salad, its so good! I","useful":0,"cool":0},"nl109hfC4t0qX0QoiZgUtA":{"text":"Closest place to actual New York pizza. Good on price and they serve beer. My only comment","useful":0,"cool":0},"rsDAZ-CsXeR5vMu72sGceg":{"text":"Yes yes y'all. Get yourself a pie and some garlic knots. The real deal.","useful":0,"cool":0},"du2rhRGwE_O1aVOOEyKiLg":{"text":"I would like to update my review after being contacted by Pizza Delicious. They explained ","useful":2,"cool":0},"GDr7KWo4F6mKxqStY5_i5w":{"text":"Oh how I love this place! Walking around the Bywater neighborhood mid balmy afternoon in J","useful":1,"cool":0},"DiuqegiaVirNksV1ts_Bvg":{"text":"Stopped in this place for the very first time for a couple slices of pepperoni to go. It h","useful":0,"cool":0},"B1Odiny7bf7K8vaSNFwUuA":{"text":"Cute place near Crescent park. Cheap but not that cheap for pizza. My friend and I got a 1","useful":0,"cool":0},"26SI_pXh5uXtfmURIuhy2A":{"text":"Who doesn't love Pizza D's?\nI used to live down the street and this was a weekly meal opti","useful":0,"cool":0},"pPmcTH7kwVloNjuzP0CHAg":{"text":"This place was first recommended to us by our Airbnb host... and then by about 10 other pe","useful":0,"cool":0},"m0GEMYLp1RnYYdw0fDA5Sw":{"text":"Cool and quirky pizza/pasta in Bywater.  A neighbor recommended this place and said it's t","useful":3,"cool":1},"eUc0YMfg5sdtsypqejLglw":{"text":"When I tell you I've wanted to try Pizza Delicious for about a year and a half now I am no","useful":22,"cool":21},"fPfWhGfyWRLpPy9ToW9qoA":{"text":"BEST pizza in New Orleans. I love the Margherita pizza and the garlic knots. I did not giv","useful":1,"cool":0},"KsUvaKjk47Qr3xc0_w8atQ":{"text":"Their pizza is delicious. Traditional topped, pepperoni cheese and margherita, are always ","useful":1,"cool":0},"38zvmCmxfU-g11D0RUxSyg":{"text":"Loved the caesar salad. Huge portion for $7.\n\nSpinach roll good, but not amazing.\n\nGreat p","useful":1,"cool":0},"Nr4rUA9-ftSZR360mdjqSQ":{"text":"Great food.  Steered here by a local.  Non-touristy.   Casual dining.  Very laid back.  Gr","useful":1,"cool":0},"0amHAF1UQ-QJO7ss-pQBDw":{"text":"It was the end of our trip. We had been walking for days and were tired. I don't think we ","useful":0,"cool":1},"BDTNXyHgfZB-rNPLAwbtCg":{"text":"The place itself is not fancy. The pizza is very thin, 18 inches, and very delicious. The ","useful":0,"cool":0},"a0weO_VC-mosOCHNo5_pfA":{"text":"So glad that these guys got their building and are doing well. I go here all the time! One","useful":0,"cool":0},"4H52aFnVnyiQQV3DWtvFCg":{"text":"the pizza was ok. the line was long and slice variety non-existent. I had hoped for better","useful":3,"cool":0},"sAhNkH2X9XoYtSMARsknLQ":{"text":"I recommended them to my guests and they were pleased. They said they consumed it all!\n\n(I","useful":1,"cool":0},"S6s3CToe3qtbg6Ly_R4ZnA":{"text":"Pizza, beer. Good. Huge pizza, good price.  Some will tell you it is the best in the city ","useful":0,"cool":0},"WGE-MKnkzECtb166asLpiA":{"text":"Absolutely worth the trip to bywater no matter where you are staying! The pizza is amazing","useful":0,"cool":0},"Ml5xolIs4eRSS7Co0aqUNw":{"text":"They make a very large and tasty pizza but they have very limited toppings and only offer ","useful":1,"cool":0},"xU8wxBuG9b5kUWHOyAGV8Q":{"text":"The best late night pizza in NOLA in the totally cute neighbourhood of the Bywater. The ca","useful":1,"cool":1},"Aqmn3eF7rp1rcFz_xIipPw":{"text":"Excellent pizza and I love the whole underground feel of it all!  Great for a Sunday drive","useful":2,"cool":2},"8Fn3TtDywPvEOLKPwTdyjA":{"text":"I have been to Pizza Delicious numerous times and find their pizza to be very good quality","useful":0,"cool":0},"D5G98VTG2DI7ok2FMJ2m7w":{"text":"I know it's crazy to say this place one of my faves in all of NOLA!  Awesome little patio ","useful":1,"cool":0},"kaSr-cbJ3FbXhRsQ2fb1sg":{"text":"First off, anyone who doesn't like Pizza Delicious or doesn't like the guys who run this r","useful":0,"cool":0},"XgXORTFFZMyBmJlB7EAXoA":{"text":"Favorite pizza in New Orleans - hard 5 out of 5. I had been looking for some northeastern ","useful":0,"cool":0},"6aU0ftRQ6Xu4TRvI9RvIkQ":{"text":"Pros: pizza crust is probably the best I've had...thin and crispy with a little chewiness.","useful":3,"cool":1},"tt1PC1SPrA8TplNCum7HGQ":{"text":"Ok, so I tried it for the first time last night - right before the vacation period - argh!","useful":0,"cool":0},"0F0QpnTcEOQD-LTt4VbyCg":{"text":"Pizza delicious, you are the apple of my eye, the answer to my prayers, the most fabulous ","useful":0,"cool":0},"4TdM_F1QqvJo7p6SJd4mkw":{"text":"Solid pizzas, sides, and salads in the Bywater.  I've never been disappointed by the food ","useful":1,"cool":1},"xMKfzp-_ueIliuFLbBzybw":{"text":"MY FAVORITE PIZZA PLACE IN NEW ORLEANS (and perhaps the world?) WITHOUT QUESTION.\n\nMy favo","useful":1,"cool":0},"DyyT0MC8CArF3esi53TMXg":{"text":"Oh my, where do I start? The mood is always somber and clinical never warm, friendly or in","useful":0,"cool":0},"vVWk8EsfqtG54ZkZ4UPpsw":{"text":"Decent place to stop In for a slice and a beer. If you come during dinner time, there will","useful":0,"cool":0},"i8u0akodLHl1gXh61doIFg":{"text":"Second time coming, I ordered a meat combo pizza but turned out to be a pepperoni. They we","useful":1,"cool":0},"-3m3MPGL7vxO76FTMpZ5jQ":{"text":"Pizza is good. Not great.  NY Style? Maybe for people that aren't really that familiar wit","useful":0,"cool":0},"pX8QuKeh8RoYsgU3oLfXfA":{"text":"The name speaks for itself! I only got to try their Margherita pizza, but it was amazing!\n","useful":12,"cool":10},"ppDhszA9C3NKg3lvrUjcqA":{"text":"First meal in New Orleans and it absolutely did not disappoint - FANTASTIC PIZZA! \n\nHuge p","useful":0,"cool":0},"BS_TWFc8zji0N-MJBeNrEQ":{"text":"Adequate but overpriced. Likely not a better slice joint in the neighborhood, but that spe","useful":0,"cool":0},"omvewzQwCX2YcMUgsYkGFg":{"text":"The pizza by the slice is affordable; the pepperoni pizza was heated up so that it was act","useful":1,"cool":0},"A_3PdezXiTxcn4aOhR79cw":{"text":"They are amazing! I tried the vodka sauce pizza and would highly recommend it. Also had th","useful":1,"cool":0},"po3I-59Jwo0aoNBSNxx8eA":{"text":"Best pizza I have had in Nola. Huge pies and the crust is perfect. Salads are fantastic if","useful":0,"cool":0},"pwnnKRAnLucGX7MSnHYBRw":{"text":"Well this is my first review on Yelp. I have heard so many good things about Pizza Delicio","useful":0,"cool":0},"LhgTj9u-hZIeZlYUTgSuCA":{"text":"The only reason they didn't get five stars is actually a good thing: their exclusivity mak","useful":2,"cool":0},"ytW88RkZWpOmXtUnjYt2Mg":{"text":"My absolute hands-down favorite pizza in New Orleans. PERFECT crust (thin but not too cris","useful":1,"cool":0},"__5nilBQuraH6kCY6dyE4g":{"text":"The BEST pizza I've ever had in New Orleans.  And the best pizza that I've had outside of ","useful":0,"cool":0},"g6xCP9COwB16aBWt_Qnzfg":{"text":"If you want a really good Brooklyn style pizza this is the place to go! We got the half an","useful":1,"cool":1},"agg9IKuf9OUjbcod-Aujsg":{"text":"This place has, hands down, the best pizza in the area. It's take out only Thursday and Su","useful":0,"cool":0},"LlJsKnnHD9GCbl-fBxP-Ug":{"text":"Stopped in for lunch today after a few friends recommended it. Also after seeing yelp revi","useful":1,"cool":0},"pO4YWWICjZ6H0-ZXi95_7A":{"text":"I loved this pizza. I was surprised because I'm pizza picky: I like all kinds, but each st","useful":0,"cool":0},"0iLKU-C3mxLOeIC0KOlMOg":{"text":"Great place all around. The name speaks for itself its simply delicious. The garlic knots ","useful":0,"cool":0},"CYqEagqfy1ZXGgyhlb0-2w":{"text":"So, I've eaten a lot of pizza in my lifetime... but this place is HANDS DOWN THE BEST in m","useful":8,"cool":7},"E_aiQxziNZ_j42hpCx4wpw":{"text":"Right in the middle of the neighborhood. Great location, good prices and good Delicious Pi","useful":0,"cool":0},"dN5Tmx7BHgw___FwhUDMZA":{"text":"ATTN: NEW YORKERS. This place is run by one of us, and not a 'Ray's pizza' one of us.\n\nThi","useful":4,"cool":2},"ITlfXXKgam6c4IPC8gRPPg":{"text":"Perfect crust!  We liked the pepperoni much better than the coppa, the latter being so sal","useful":1,"cool":0},"cvIY6nRhMk8AI-iJy4H_OQ":{"text":"The line was very long but it went by very quickly! We waited about 10 mins for the pizza ","useful":0,"cool":0},"-PWMGTnEDyUsdwaD2gwF7g":{"text":"Best pizza in New Orleans! They use only the freshest ingredients. The owner and staff are","useful":0,"cool":0},"0fljjkuU1U2cXUCVa3Rfjg":{"text":"Had the pepperoni pizza and got nostalgic - this pizza will make you remember how great pi","useful":0,"cool":0},"OEyVSVBJo49WkckFpZDt4A":{"text":"Bought two pizzas and some garlic knots (also Got a couple cookies ) it was the biggest fr","useful":0,"cool":0},"kspI-WnUApjqHSbA7jtsQQ":{"text":"It's pizza that's delicious!!! \n\nPerfect New York style pizza. Order at the counter. Simpl","useful":3,"cool":0},"nFTLyxrhtWorCFFIAGLOcA":{"text":"So our last night in New Orleans and totally exhausted, was supposed to go to Adolpho's bu","useful":0,"cool":0},"H0jVt2NW8r9HA1ynG-Bscg":{"text":"This was by far the best pizza I ever had in New Orleans! I'm in Florida right now and I j","useful":2,"cool":2},"OiFqIcGVtGpMfEF_GjadjQ":{"text":"The hype is SO REAL. Had a few slices while in the neighborhood at the Piety Market and oh","useful":2,"cool":2},"9zTxYrn8sdvsPIumMoUntQ":{"text":"Simple.  No frills.  Great tasting.  Affordable.  All of this comes to mind when I think o","useful":1,"cool":0},"gC0t35Iq3jpb6-K9GeS_Ug":{"text":"I'm from NY and so I'm kinda snobby when it comes to pizza and Italian food in general. Th","useful":3,"cool":1},"7nNzr_TY1pZ07kRtGDr41A":{"text":"Good thin crust pizza and cold beer on tap. Service is good and the atmosphere is fun. It ","useful":0,"cool":0},"RT6RZKSyHgl8DpI6rb1AQA":{"text":"Best New York style pizza in New Orleans!!\n\nI came here for lunch with a friend on Sunday.","useful":4,"cool":2},"ROh0gvU__v2Rtc9vTYAGwQ":{"text":"Best pizza I have ever eaten. Ever.\n\nDoesn't get soggy, super local ingredients, and every","useful":0,"cool":0},"LATrYQQup-32ORiyrlmnXw":{"text":"Good pizza, but the best is the little outdoor patio.  Perfect for kids, and the staff are","useful":0,"cool":0},"sTY436MqnNjTAgmrhB3oCQ":{"text":"The name literally describes what you get. However, it could also be called pasta deliciou","useful":0,"cool":0},"dyUAeuMmDKio2qGHo9sqlQ":{"text":"You cannot get a better deal on pizza. This place has the nicest workers that are always t","useful":0,"cool":0},"cXKR5PCTvK9qjqAlKiky4Q":{"text":"This place likely has the best pizza in New Orleans. The food taste excellent and the serv","useful":0,"cool":0},"i-yyMbey-N61LkqjJPikzA":{"text":"Great stuff went here with my brother and gf and it was awesome. We put doenntwo pizzas an","useful":1,"cool":0},"k8gaKPjIj6li9v5EvcNGgg":{"text":"Pizza delicious was delicious. I love thin crust pizza with good quality size slices . Ser","useful":0,"cool":0},"2ew1JbSTJez_R1br45-hTQ":{"text":"Yum yum yum! The best tasting carbs I had in a while- worth every bite too. \nYou may get s","useful":7,"cool":3},"jlJTE1uLcx38qHE1MOnxUg":{"text":"very good pizza place. they have vegan options as well. lots of inside seating as well as ","useful":0,"cool":0},"ACBloU6qHHZ8VGA0EmUuaw":{"text":"It was only a matter of time before we returned (the pizza is seriously delicious, after a","useful":0,"cool":0},"16BzQrzgt4Oiv4doau8ihw":{"text":"One of my favorite New Orleans establishments! I eat here once a week usually. This is rea","useful":0,"cool":0},"wn-cnWl83d6-VQWj4SFIwQ":{"text":"Holy Friggin' Hannah, this pizza fanatic has found her go-to pizzeria in NOLA. The Margher","useful":23,"cool":20},"NEOerbtSAPiDZxIFNzuFSg":{"text":"I fckin love Pizza Delicious. \n\nThey offer super simple complex pizzas! Does that make any","useful":4,"cool":3},"9T5oDk2LWVb9Z-wpRiWZCQ":{"text":"SO DISAPPOINTED  - Although a bit salty, the pizza was good.  \n\nMy disappointment is with ","useful":3,"cool":0},"7RMpnr97IMUaD6sTnVewJw":{"text":"Sometimes I NEED a good slice of pizza. Like NEED! And Pizza Delicious takes care of this ","useful":6,"cool":4},"BUO9jGVkdOZ8d-aMNu_gPQ":{"text":"Some of the best pizza I've had. Their margarita pizza is AMAZING. Honestly,before we go a","useful":0,"cool":0},"pvre5U6L8boQgaMZIWNSpA":{"text":"Pizza and garlic knots were delicious. Needed a good pizza place while we were down here f","useful":0,"cool":0},"czQ9iTNDRlyM7o0R9pxQvg":{"text":"Straight forward pizza place with salad options, wine and beer. I tried the cheese slices;","useful":0,"cool":0},"OaCh8pGqO-rP22hOya775Q":{"text":"Went today for lunch. We ordered a large pepperoni pizza and pepperoni rolls. The pizza wa","useful":0,"cool":0},"BZ6mm-ngmQVVr5BSHc6C5Q":{"text":"Y'all, I love this place...have since they were a \"hole in the wall\" opened only on Sunday","useful":0,"cool":0},"_1dLZPz7OK72nqCjio5jgg":{"text":"The pizza was great.  The front counter employee - lady with short cut- taking the orders ","useful":1,"cool":1},"5E1C9jEGNxjnl9_-_lFCPg":{"text":"Solid execution of the New York style pie.  Salads are beautiful.  Don't miss the garlic k","useful":0,"cool":0},"vMiVrZeVRlx1g0MLzUV_jQ":{"text":"I have had pizza from here and it is the best in New Orleans! Reminds me of what I'd eat i","useful":2,"cool":2},"w6WgaBlfVWyGMtuXIoLoVg":{"text":"i read reviews touting PD as the best in the GNO and was extremely skeptical.  They are a ","useful":1,"cool":0},"GJ5mC6-qU_oBdt6GQKeUwg":{"text":"The name says it all! If you are looking a cheap and delicious lunch in the Bywater, look ","useful":3,"cool":0},"6h05eBTh8nFDA1KwkC2sQA":{"text":"The pizza here is soo good you can taste the ingredients. I hardly ever eat the crust but ","useful":0,"cool":0},"5K31WnyfSRFdG_Z3hFYqhQ":{"text":"Just like the name suggests, the pizza is delicious! Fun atmosphere too in a part of town ","useful":0,"cool":0},"kzZxuFVz7vQJt_YSnbc40A":{"text":"Pizza Delicious was more like Pizza Disappointment for me.  I had heard a lot of positive ","useful":3,"cool":3},"j6fDbF5d_kidgPh6hldDcA":{"text":"Great crunchy pizza.  Right near the rusty rainbow where you can go for a walk.  Spaghetti","useful":1,"cool":0},"j1FdylhiUVJlleCQz3tyDg":{"text":"I live in DC and travel to New York and Philly often. Outside of Del Posto in NYC, which i","useful":1,"cool":0},"gKIBdZWOmoESD0bXnhcQUQ":{"text":"Good pizza (I just had a slice of cheese), fair prices. Good variety of food and drinks. I","useful":1,"cool":0},"m0tMh4zgNSQR7R1Z2DePMA":{"text":"gosh this pizza is good. i can't have enough of it. i am a die-hard fan of toppings on piz","useful":1,"cool":0},"NUbceJu6FvTC6V3LQ-zihw":{"text":"Solid pizza. I got a slice of pepperoni and a slice of the spicy sausage. My wife and I sp","useful":0,"cool":0},"92J943d0oRAyuWj2Vu7ShQ":{"text":"Pathetic pizza. Terrible service. Makes up wait times and when asked about extended wait t","useful":1,"cool":0},"dn4MG32I4PKQp-6MpaV-Cg":{"text":"I understand being a busy spot but a Margherita pizza is not with cheddar. I saw zero mozz","useful":1,"cool":0},"EN1KVjksGrtp-pVRAC7Dag":{"text":"Dear Pizza Delicious,\nAs a real pizza lover, pizza is basically the only thing I hold sacr","useful":7,"cool":2},"SIG2dBPXY4rJmadeNxyZBA":{"text":"I have been ordering from Pizza Delicious from Philadelphia for my son in New Orleans and ","useful":0,"cool":0},"JC8kdX_1zxufVShGbmedbA":{"text":"We needed a late night snack as we had an early dinner and really struggled to find a plac","useful":3,"cool":2},"xXkFSx1StqrQupf-xEWFiw":{"text":"Great pizza located at the end of a neighborhood. If you come by yourself just get it by t","useful":1,"cool":1},"27HjgL3v36nF2TS5MwrH0Q":{"text":"just wanted to make a post on here cause I called in an order for delivery. after placing ","useful":1,"cool":1},"-2SQEs0Kjzu1yHYHDACfAA":{"text":"Had a wonderful experience ordering catering for a party of 15 flawlessly delivered to our","useful":3,"cool":0},"fYGAkpIvLcvIXiECjlG0_w":{"text":"4.5/5 GO HERE RIGHT NOW. GO.\n\nit is 1. pizza. and 2. delicious. get it? good.\n\nthe menu ch","useful":3,"cool":4},"V7YrYlT5Pi-onn2woG8utQ":{"text":"Super yummy with a great crust - not too much bread but crispy and holds the toppings just","useful":1,"cool":0},"y8AeRgy8MFfTAQ8Iynzw1g":{"text":"Best pizza place on New Orleans. I love eating all there spectacular food and they have gr","useful":0,"cool":0},"QwXqe6KAuSMI6J3u8HcULg":{"text":"There name says it all, the pizza is delicious. Good sized slice, not drenched in grease m","useful":0,"cool":0},"zklqp3gQNJwvSU1_mUyRRQ":{"text":"As a New Yorker I make it a point to try pizza from other places when I travel, mainly to ","useful":1,"cool":0},"jY4KRQ_d4zsc8Dv0R9bJ7A":{"text":"Best pizza in NOLA. There is no argument. Very far from our Metairie home, but that doesn'","useful":0,"cool":0},"BPkTfuZIe4tvWA0vZQgzGQ":{"text":"Absolutely phenomenal! I am originally from the New York and New Jersey area and this plac","useful":0,"cool":0},"nKkBcDKhCwOUMTcIouX2Pg":{"text":"I was first introduced to Pizza Delicious by my older sister, who lived in the neighborhoo","useful":26,"cool":23},"CHs5jIiNWlNCQYBrQCnyuQ":{"text":"After walking from tourist destination to tourist destination, it was great to come to a r","useful":0,"cool":0},"1EkVu1_x1iK54oN9HPOV0Q":{"text":"Went in around lunch time on a weekday, wasn't too packed but was still half full. \n\nVery ","useful":0,"cool":0},"w0wgG5B_GsPrRw0e0mlOFw":{"text":"Best. Pizza. Ever!!! New to town and ordered delivery and it was fast and super delicious!","useful":0,"cool":0},"nuaKPgvPFmCdodvBvWiGmw":{"text":"I have to say it, I'm not impressed. Let's start with the garlic knots. Much like Bobby B.","useful":6,"cool":3},"PDZgCQssUEk-2pE4xALvCA":{"text":"Best pizza in town.  Awesome sauce, atmosphere,  and art on the walls.  The people are ver","useful":0,"cool":0},"wuRVYF0mo5ILRGSGEKGzFw":{"text":"Everyone sitting around me has black smut all over their hands to accompany their burnt cr","useful":4,"cool":1},"ugNDg54fa2idEjcNWeUR8A":{"text":"Short walk around from our VRBO, pepperoni pizza was awesome. Cucumber lime michelada was ","useful":0,"cool":0},"KfYpEhCcqPTmDSwbS2nkYA":{"text":"The pizza is okay. Definitely not the best in New Orleans. My rating would be better, but ","useful":1,"cool":1},"35H_IPIzc2tYZHqw6XdKhw":{"text":"The pizza is really bomb here, some of the best in the city no doubt. What I really live t","useful":0,"cool":0},"spLti1TpwYMfhVsgUTCDkg":{"text":"I just called Pizza Delicious to place an order for delivery. I was told that they do not ","useful":2,"cool":1},"6Y7pE-lr6VGXtofiGSsFog":{"text":"Maybe great for New Orleans but, New York it ain't. Fair if you're starving, or just have ","useful":1,"cool":1},"bbI6huubS9nbucSgwcc1IA":{"text":"Pizza Delicious gets the \"best pizza in New Orleans\" award. Their name says it all.  They ","useful":1,"cool":1},"gI598M0PSoefSD7WBQm--A":{"text":"Love the prices of a slice at $2.25 to $3.50 it's more than fair.  Pizza was average, but ","useful":0,"cool":0},"iaqH_b5MjsO0xEhBzKespw":{"text":"Pizza Delicious in my favorite pizza place in the city!! The thin crust and perfect balanc","useful":3,"cool":2},"Goi4zXNPTZuaUQsMpFUnUw":{"text":"Awesome ambiance, best pizza and garlic knots in the area!  Very good menu as well, encomp","useful":1,"cool":0},"Zah71TaWpZyiK0j26BOJRQ":{"text":"Late night review on a highly recommended pizza place. \n\nOn first glance it's a nice littl","useful":0,"cool":0},"jnPoeZyT8_xY1wvaIIxbVQ":{"text":"I'm so glad we came here. A friend mentioned it was supposed to be the best in NOLA and I ","useful":0,"cool":0},"C7kHNCKoLwCEX2U_QyV3pQ":{"text":"Came here twice in our short stay in Bywater. We just had the pizza, the pepperoni and the","useful":0,"cool":0},"Wu7rxhxCaAXIw3dXVhgA9Q":{"text":"Pizza delicious? Pizza ok. Service is better than the food.\n\nYelp won't let me post a revi","useful":1,"cool":0},"mqo5UGg7itQZNhvobEFkmw":{"text":"Pizza Delicious, once known for its friendly, local feel and humble beginnings in a commun","useful":2,"cool":0},"p84h_4R6WwrRPHZcwYMOpw":{"text":"After spending a summer in New York City, I became  accustomed to the magnificent $1 slice","useful":1,"cool":0},"V7B0utzsP7tcJ34xeoikfQ":{"text":"I *used* to love Pizza Delicious, aka ~the best pizza in New Orleans~.. until I went there","useful":2,"cool":0},"CmXfuxalsQrTNXZWOwaN0A":{"text":"My friends and I went in here the other day & ordered a couple slices of pizza each. The g","useful":2,"cool":0},"zEACLN5m3dqLlkJhFONJkw":{"text":"I love the pizzas here. The place is away from the touristic area, and you can tell the lo","useful":1,"cool":0},"3-fmn79iBOrv-llxNf0W9Q":{"text":"I consider myself a pizza aficionado and I am telling you this is the best in the south. P","useful":0,"cool":0},"gW_EMHf99-t61OUU96bYgw":{"text":"Your pizza is so fucking good, you have vegan shit too (I appreciate it). \n\nAll so great, ","useful":4,"cool":2},"syVqf_xApL0cXiH3BQZ27g":{"text":"You cannot have a 5th star Pizza Delicious!  You wanna know why?  Because you only give me","useful":2,"cool":2},"b7IksdaDyWGcDbXavJdcOg":{"text":"Huge pizza. Delicious pizza. It definitely lives up to its name (and the overall Yelp hype","useful":8,"cool":3},"9aBjAwnjXJE6SoUrJ0vGkA":{"text":"They recently participated in the local \"Pizza Wars,\" but we couldn't play... because we r","useful":0,"cool":0},"tJViHIkInEIbaD_goFfhQA":{"text":"I ordered the local cucumber and orzo salad.  For $10.52 (with tax) I expected more than t","useful":1,"cool":0},"g6d0EhTVCxj--A8uw38Obw":{"text":"I have visited this place plenty of times. The pizza Can be a bit greasy but overall very ","useful":0,"cool":0},"7Gvt_IsPGOAp7n1BNmF_yQ":{"text":"Stopped in on a whim- and wasn't let down. The service was great. Ordered pizza and salad ","useful":0,"cool":0},"jwF0QX3AH0fWJLw7fkGa3Q":{"text":"I have literally been hearing about Pizza Delicious since I moved here. After moving from ","useful":3,"cool":2},"mNmeBXIJLbsxVhxFy9kTNA":{"text":"The quality control is inconsistent. I don't like my pizza overcooked and black on the bot","useful":0,"cool":0},"1FJ7H0MV3mDpwxRJ0lgLNg":{"text":"I've been to Pizza D many times and most of the times I've liked it. The reasons I am givi","useful":2,"cool":0},"cxEHFJQUyPrSZKjNnMWYLA":{"text":"One of our absolute favorite meals while in town was had here. Their margherita pizza was ","useful":1,"cool":0},"fsAz4ceTNz-06eYoeGPfug":{"text":"Fantastic New York style pizza! The wait was well worth the pizza. Great service too. Defi","useful":0,"cool":0},"4t3UzTT7fOUJ_0tNiphEsQ":{"text":"I had been dying to get over here bc so many people have raved and raved about how great i","useful":4,"cool":0},"8i6KtxBkkJJTRmS3O8IkWw":{"text":"Pizza delicious is aptly named. That is the only good thing about the experience. As a New","useful":1,"cool":0},"mkPmHbjmD57Kkve_3kLnWQ":{"text":"I'm sorry, I don't get it. Maybe it was bc all my friends and coworkers are always raving ","useful":1,"cool":1},"8Q6Kdosi8Oku0_vP3fMw0w":{"text":"I need an intervention.  The pizza as amazing!!  The staff is fantastic! I blame Pizza Del","useful":0,"cool":0},"p-Id4yVp2AdN5FCexNOPuA":{"text":"After having a pizza from Pizza Delicious I have been spoiled for all other pizza in New O","useful":2,"cool":1},"GdgEVio_VKie1UsytlKwzA":{"text":"The name says it all. Choose anything, it will be wonderful. My wife says this place start","useful":0,"cool":0},"FrwEj7cqdYNWh35U5cg8YQ":{"text":"Since moving into their permanent location this place has really flourished and achieved c","useful":4,"cool":3},"Z0nrtdf-KLdUlhJ8Z2igiQ":{"text":"Come with me to a place of pizza imagination! \n\nI was introduced to this place about two y","useful":1,"cool":1},"fG6gq3A4F0aTduSQV-hgug":{"text":"Pizza Delicious.  Delicious pizza!  I love this place.  They use unique toppings and the d","useful":3,"cool":1},"DATyZlKkFlkVMO0HZI_Tjg":{"text":"After suffering with California pizza for three years I felt like I was back on the mean s","useful":1,"cool":1},"uRqBgQbrUnt8YgVW5qLLbQ":{"text":"Man I'm not sure what has happened here.  I don't know if it was a bad day or a pizza oven","useful":5,"cool":2},"jxXBYLXw6N2FVE0_85uOeA":{"text":"Great food and atmosphere. Right across the street from a snowball stand and the new Cresc","useful":0,"cool":0},"ULUAT-D0fRSlUVcbHQyvdA":{"text":"Couldn't ask anything more from a pizza joint. Inexpensive slices of cheese that my kid ad","useful":0,"cool":0},"gZToOcm11-sPUmXvAYdg3A":{"text":"My husband and I finished the pepperoni rolls on the walk home from picking up our dinner ","useful":3,"cool":2},"s3YEvBFQnzKGIHd0uV85Mg":{"text":"I love Pizza Delicious. Plain slice or specialty slice, you cannot go wrong. Will be a cus","useful":0,"cool":0},"5VSLkNdz2jxLeZJr-CGlSg":{"text":"The best pizza I have ever had!! New York style and great crust. I highly recommend going ","useful":1,"cool":0},"28g7ZPh99ZMFXaqtWZiz_A":{"text":"Really Good NY style pizza. Service can get kinda slow during the busy hours.  I highly re","useful":0,"cool":0},"nGWGVcGzEAUif5mEckarJA":{"text":"We were staying a few blocks away and found ourselves at Pizza Delicious twice during our ","useful":0,"cool":0},"V3Vt7eCQWnC2EMiTLQYHKA":{"text":"This is the best pizza in like a two hour radius of New Orleans by far!! I've been coming ","useful":0,"cool":0},"HdRG00lAbcjemZQ64h9xqw":{"text":"Probably the best pizza in all of New Orleans\nWonderfully fresh and unique ingredients\nDif","useful":1,"cool":0},"4JfvicIbLjVPx6ZlB7nRSw":{"text":"Oh Man what yummy pizza and other dishes were scrumptious. Great ice coffee , different ki","useful":1,"cool":1},"2fuvSy8P3t5XrxFRH_BSNw":{"text":"I love Pizza Delicious! Garlic knots are (appropriately) very garlic-y! So if you're not i","useful":3,"cool":2},"YKH_emjMv7MOsDlSFM5f4A":{"text":"Best pizza in New Olreans!!  I LOVE LOVE LOVE the broccoli rolls!!!\n\nWe order Pizza Delici","useful":4,"cool":3},"RG1COXAhqRWHO0KUMIomyg":{"text":"I am a self proclaimed east coast pizza snob, and as such have a general bad attitude towa","useful":3,"cool":1},"tMh_6OOhnrCiuWq5cK3ecQ":{"text":"This is some super dank neighborhood pizza. Crispy and hits the spot. Their specialty pizz","useful":1,"cool":1},"i9X2n0GNslwLj3KAnpSKKQ":{"text":"So these guys are adjacent to Bratz Y'all! And both have outdoor seatings where you can ge","useful":0,"cool":0},"F7PmGq3skxKwRJoSY6VjMw":{"text":"This is some top notch pizza. Being a suburbanite, it's a bit of a trek to the Bywater, bu","useful":2,"cool":3},"JgVUR2aUqJbkKW74aMdjIA":{"text":"This place is great. I'm vegetarian and they have great options for vegetarians and vegans","useful":4,"cool":1},"ki0N0qQFD84FwL3uYOXo3w":{"text":"I my opinion it's the best pizza in town.  Thin crust, but not too crispy or dry.  great s","useful":2,"cool":2},"6sFYLo5yzGdzswvmh3uy2A":{"text":"Probably much better when you order a whole pizza. They are definitely making\npizza by the","useful":2,"cool":0},"NTrZrvklTv20gh2DZiHvEA":{"text":"I go at least once a month with my NY pizza purist girlfriend. According to her this is NO","useful":1,"cool":0},"9FHXrIXYyWYGBCUtvalbFA":{"text":"Pizza D, I'm gonna miss you and I'm moving back to the pizza capital of the US. As part of","useful":22,"cool":16},"7yVNuWIgzbHl4iEdpaTx1w":{"text":"At first I said this place is decent but I definitely take it back. I had the vodka sauce ","useful":3,"cool":1},"vQvPxIJ02-k2Wi7quZ2yBw":{"text":"I attended an early group dinner at PD on a random Thursday. Thankfully we were able to si","useful":2,"cool":2},"TqeHHR809hOqiZ67WDDhrQ":{"text":"Pizza Delicious is the best pizza in New Orleans, in my opinion. I think it's the sauce, w","useful":0,"cool":0},"lau26OP7CBcTjAlsf05Dtg":{"text":"Hands down, the best pizza in NOLA.  They always use fresh ingredients.  Kinda annoying th","useful":1,"cool":1},"JJCtwWYBZJDjywRPBHQnVQ":{"text":"Best. Pizza. Ever. 2 slices are missing from the picture because we couldn't wait to try t","useful":0,"cool":0},"3KedDM2eWjlgM6OoTFk8mA":{"text":"Great pizza! Thin crust, tasty cheese. Very limited toping selections, possibly because th","useful":2,"cool":2},"eVUMM-OS1kDen0AJbOc79g":{"text":"Loved the speed and friendly service. You order before you sit. I had a slice of Hawaiian ","useful":0,"cool":0},"zadcmqHDpHNLrnLHWga0kQ":{"text":"During our stay in Nola we went to Pizza Delicious. When you enter the building you will b","useful":0,"cool":0},"mTXudPq3k5juOCRJ0TTHEw":{"text":"Excellent choice from a local!\n\nBunch of hipsters here but the pizza was authentic meaning","useful":1,"cool":0},"BRCzdPUwRKWWhDC2EJuaXw":{"text":"New Orleans hidden gem!  If you desire New York style pie and think you'll never find anyt","useful":1,"cool":0},"6yUhbW1uxNY78itJHr-5lQ":{"text":"Name is deceiving... mediocre pizza, cookies are alright, and salad... wish I would have s","useful":0,"cool":0},"VLEBuAUERqtUjurUDwSQPQ":{"text":"Loved the pizza here! Super cute outside area for eating; romantic space. The service was ","useful":0,"cool":0},"vU6UUYJRYZN6ZlMb_4Dajw":{"text":"They have really good pizzas but just wish they had more toppings! I would recommend half ","useful":3,"cool":1},"1gv74o-qPiEd-xFvu_cf-Q":{"text":"The pasta and pizza in this place are off the freaking chain. I love it. You cannot go wro","useful":1,"cool":0},"IL60s9IcBYjbtz5B-8iSnQ":{"text":"My friend just happened to be craving pizza & I used Yelp to find the highest rated place.","useful":1,"cool":1},"xu1MhQyx3KWh-1enyMqo4A":{"text":"My boyfriend and I come from a place where pizza is a way of life. Ever since moving to Lo","useful":1,"cool":0},"F2AsX4TQr5_pdDj5Kd8PcQ":{"text":"These folks have gotten entirely too cocky and rude since their Gambit review skyrocketed ","useful":1,"cool":0},"CVN0-pbsOEumZVoMEovL8A":{"text":"I am not a local, only in town visiting. But from ever Uber driver I have had, and my Airb","useful":0,"cool":0},"9iJb6MBw-1GiFRju2Zmy1g":{"text":"Pizza in authentic New Orleans neighborhood. Busy establishment but found seating easily. ","useful":0,"cool":0},"ZnRr12AkbXOXA0V130cX-w":{"text":"Love the Margarita Pizza and added pepperoni. My favorite pizza in the city.","useful":0,"cool":0},"GLa7zDvUGj6K_VHtOwU81w":{"text":"Having gone from trying a slice to ordering a whole pie, I must say I could hardly have ho","useful":4,"cool":2},"DtziAEi5J6pSUWKZvF9Pwg":{"text":"Pizza delicious is one of my favorite local pizza joints. They make a fantastic thin, cris","useful":2,"cool":2},"lrFpGBK2OaeOTbLz2UFBCw":{"text":"This stuff is good. REAL good. \n\nWhile visiting New Orleans, one of my friends recommended","useful":2,"cool":1},"iSF3OOdmhLjvGwlzX-0xyQ":{"text":"We found this place after watching the Krewe des Vieux parade, and we lucky to arrive with","useful":1,"cool":0},"2uyrG6ZX_W7RyH5ihHSwGQ":{"text":"Best pizza in NOLA area. (Probably better than actual NY pizza lol) I am a NY resident and","useful":0,"cool":0},"n_tb03_SGA3MxdTtHJ4r1Q":{"text":"Definitely the best pizza I have had in New Orleans. They are now open on Thursdays instea","useful":6,"cool":3},"wbsb-CMEH3yDllejnUlykA":{"text":"prices are the shizz. pizza is the shizz. bywater legend open a restaurant already!!! best","useful":1,"cool":0},"7_yEyqsh3VU0mQLfqMf_TA":{"text":"We ordered pizzas and salads for a work event, and it was ready on time, and delicious.  T","useful":1,"cool":0},"MikNyzEI5RVqIux4M84YHg":{"text":"They are only doing pickup and call ahead (I'm not sure about delivery), but we did pickup","useful":0,"cool":1},"0Dge_m_i0Xw2y56IHg2-lA":{"text":"Vegan pizza & Spaghetti was delightful... will be returning soon!! Went during the week, l","useful":0,"cool":0},"tHAUD5HgQD2JWoWgHb7bTQ":{"text":"One of two of my pizza places in nola. There crust and sauce is amazing but I'm vegan so I","useful":0,"cool":0},"bsa7YTjt-FVKPmak_S2Y7Q":{"text":"I honestly wasn't sure what to expect from Pizza Delicious being that I'm from NY and am a","useful":2,"cool":0},"ZqOSESFCgeG3PANv44r6JA":{"text":"Solid spot if you happen to be in the area and are wanting to grab a slice of pizza or a w","useful":11,"cool":5},"E0vkh8-kHVqXOMwoI1kUTg":{"text":"It's like crack, ok? That's all you need to know. First try I was like, this is pretty goo","useful":1,"cool":1},"TUkWi3YqorLFBeD_eYZIrQ":{"text":"I was very excited to see and hear about so many good recommendations from people on Yelp ","useful":3,"cool":0},"rwfZsbOpxLUTYV92hloxqQ":{"text":"This is a nice pizza place in the Bywater. The food was cooked fresh to order and the port","useful":0,"cool":0},"LvC3FkXnypn35JvKdujAgg":{"text":"I get it. You're a hipster pizza place trying to be cool. Fine, whatever. Hipster doesn't ","useful":3,"cool":0},"yYkXkJdcsQS2iL9UFwUEGQ":{"text":"Good pizza. Unique for the city. High quality ingredients and much of it is house made. I ","useful":1,"cool":0},"fpFxtNIx3LkJPps_CHRW4Q":{"text":"This is hands down the best pizza place in New Orleans. The classic pepperoni is a staple ","useful":0,"cool":0},"JxUB9IY-Yhuiwd8fcdKdxg":{"text":"Best pizza ever!! Just a simple pepperoni pizza is amazing! So much flavor & came within a","useful":0,"cool":0},"jPrI42yA0-VjALMPBD0fLg":{"text":"Ok pizza. Probably not the best I've had in the area. I ordered online through their websi","useful":0,"cool":0},"iqyF4mCrSgf7NZNnerV_zQ":{"text":"Pizza Delicious is my favorite place in the city for pizza...officially.  PD is a trek for","useful":3,"cool":1},"8u3Pd5CbAyLVamNMNbVWpg":{"text":"Phenomenal! Best pizza in the city. The crust has that bubbly yeasty crispy snappy goodnes","useful":0,"cool":0},"A1feBiM4NYe5185yN7ZBgw":{"text":"Since relocating to the Marigny, I've been averaging one trip a week. Their chewy, buttery","useful":0,"cool":0},"txjOW-uKivXz_mM4KLxNkw":{"text":"I mean it's Pizza D... Less than 5 stars shouldn't be an option. Everything is great. I'm ","useful":18,"cool":13},"Dey4JiFk2R6S1JaBpBq5aA":{"text":"This is the best pizza and pasta in New Orleans.  That's it, that's all you need to know.","useful":0,"cool":0},"ukyU5d8OER1Y43a734RtuQ":{"text":"The pizza is awesome. People who don't like it, don't like good pizza. That part is easy e","useful":6,"cool":5},"_9ny0DirEgpcHMwnljPygA":{"text":"Best pizza to date, besides my other favorite spot in the city! Reminds me of my old colle","useful":1,"cool":1},"KTNSRIaEIJKb3s2qIBvkdQ":{"text":"I absolutely love this place. Been in the city for 7 years, and this is my go to place. Yo","useful":0,"cool":0},"xUnb1OGHRiJndP5Ia-xu2A":{"text":"As someone originally from the northeast, I understand how passionate people are about the","useful":0,"cool":0},"FAXImb8fhoYv-VSyZZboLA":{"text":"I'm a woman who LOVES some good pizza, and there's a special place in my heart for NY-styl","useful":7,"cool":6},"ksynLb_puzVldwL1g7ehVw":{"text":"Tried to order a pizza for delivery utilizing their new ordering procedure had some issues","useful":0,"cool":0},"45NjsRlNc1dmbfL4Xu6c8w":{"text":"This place is really falling fast. As the consistency drops, the pretension from its worke","useful":0,"cool":0},"Ea_o9ilsQZk6BcyNWu23xQ":{"text":"Delicious. I drive from Midcity to pick up. It's a little pricy but it's a lot of pizza, t","useful":0,"cool":0},"Y09KBYeUCKEWuXtHR9B5-A":{"text":"Get a new thing on the menu each time and you will be pleasantly surprised each time. Grea","useful":0,"cool":0},"QjLFqKvebB7pRkpktmwxrw":{"text":"My girlfriend and I love going here. If you're going in with just two people I suggest ord","useful":0,"cool":1},"DdJ7RJGH5MpNIT1ol8ZQKw":{"text":"Went there based on a friends recommendation. I had the margherita pizza and cesar salad. ","useful":0,"cool":0},"N0EuwQefmYtCYpYR7bcFIQ":{"text":"You have to get the garlic knots!!!!!! So good. They have a ton of vegetarian options whic","useful":0,"cool":0},"A84qF4ntaYIOyl0zCUVLGQ":{"text":"If you enjoy an unpleasant atmosphere where unwelcoming employees greet you with a look of","useful":0,"cool":0},"AORi8kPZznQbFx4qGbH1sg":{"text":"What was I thinking? Please forgive me for my prior 4-star rating. This is like a top 3 re","useful":9,"cool":6},"bXvp2EpVqL6d-atax_PwUA":{"text":"There are many great things to say about Pizza D, but I strongly recommend their marinated","useful":0,"cool":0},"NyV4ajXGdcj9vFyj3rgtfQ":{"text":"Nice pizza if you can get it. \n\nSeriously, after a couple of years not ordering from them ","useful":1,"cool":0},"JjwxxDEUShnZ6CTkJNF9cg":{"text":"Really good food but the workers are young they where so busy dancing and singing they gav","useful":0,"cool":0},"t7Tz2-UT3Zb_huYJbGb0wg":{"text":"If y'all think Pizza Hut or Domino's is the best pizza you ever had, you BETTER BE RETHINK","useful":1,"cool":3},"UajL8JNVTFCBAekXZAFh-Q":{"text":"The pizzas are massive. The atmosphere is chill and the staff is friendly.\n\nTheir sauce an","useful":0,"cool":0},"koDdAtN8NHsOQlolrXE-KA":{"text":"One of three best pizza spots in New Orleans.  Hits high marks on all three ingredients: d","useful":0,"cool":0},"x_biWObZyCRP-x3MfTiCjQ":{"text":"Delicious indeed! Visited for the first time last night. On a Thursday, there was a crowd ","useful":1,"cool":1},"qnxA5rbb3uSHcC9yjXzmpQ":{"text":"I have absolutely no idea what the heLl the hype is about this place.  Sadly I was thiinki","useful":0,"cool":0},"6bicRnoaOqBrsH4M2M3pyA":{"text":"Since moving here 5 years ago from Brooklyn, this has been my place for pizza; it has been","useful":0,"cool":0},"P2y3q1-R88u3bqhOtyA5vA":{"text":"The white pie is my favorite pizza ... but I tried them all and don't forget to get cookie","useful":0,"cool":0},"rNfQw5K0q5AJT8sfrMKNJA":{"text":"As the their slogan implies, Pizza Delicious is simply \"delicious pizza.\" Located in the p","useful":1,"cool":0},"ScLKbbX8UclVFCoDyGcZSg":{"text":"I read all the bad reviews first. I agree with all the five star reviews! Pizza WAS delici","useful":4,"cool":2},"Ca8JOsOu-l6qx7sL_Enh4Q":{"text":"Around Mardi Gras my husband came home (he's a trucker) asking to try a new spot \"Pizza De","useful":0,"cool":0},"r4vC0XiqWQ2RMaqGCIeCLw":{"text":"Don't let the name fool you .   Terrible Pizza should be the name. Spent almost $30 throug","useful":0,"cool":0},"AC7VZXymdzSPaveb8AsCSA":{"text":"I keep trying more and more pizzas around the city, but Pizza Delicious continues to be th","useful":1,"cool":1},"AvHLqJxaN75wVkqKVa3mvA":{"text":"Flavors and textures are on PIONT! That sauce, that cheese! Every bite had me wanting more","useful":0,"cool":0},"v2pfcow376RzmgOFTExcBQ":{"text":"Fantastic pizza in the Bywater! I wanted to use the word Delicious but that's already take","useful":1,"cool":1},"QQPGOtODZU8kOyhC22GA2A":{"text":"The garlic knots are awesome.  Pizzas are large in size with a great super thin crust, whi","useful":2,"cool":0},"JCaF-Tm2g17N0c4YBl34fA":{"text":"I'm from Chicago; New Orleans doesn't have good pizza. It just doesn't. But Pizza Deliciou","useful":2,"cool":2},"kubLQMzoFDeTPacQToo1wQ":{"text":"The pizza was good but the service could definitely be better. Went to pick up my order an","useful":0,"cool":0},"1DkDjhyMsnQylnP6NsJ9fg":{"text":"VAPIDLY GLUM HIPSTER DINERS frolic together in maudlin detached silence. \n\nAFFORDABLE YET ","useful":10,"cool":5},"9tusy_ghTQzJ6UQk6MxeQg":{"text":"This is by far the best pizza in Nola. Thin crust, greasy, perfection. Only negative is th","useful":0,"cool":0},"BNOlqHvQy-B9J9OcDYr5GA":{"text":"If you want to wait an eternity to sit in a crowded restaurant where it is so loud you can","useful":0,"cool":0},"4tk-w0clooUcCAimS2SC7w":{"text":"The pizza, as the name suggests, is delicious!\n\nSimple menu, with great options. This join","useful":1,"cool":1},"bdu4QIKTsM2tLnbzurLDVg":{"text":"The restaurant looked & smelled good, but unfortunetely that is where it ended. I am vegan","useful":1,"cool":0},"H8ho8ptnpa0pJbn3YKzOhA":{"text":"Best crust I have had in Louisiana! Crispy and chewy and perfect. Got the Supreme. Even my","useful":0,"cool":0},"VtRZP6RtFIQ9aNR6uPP0Vg":{"text":"Huge fan of this place. Definitely need to come back. The pizza is a littttttle bit too gr","useful":2,"cool":1},"ykrt78MVnO7EpZlB570CbA":{"text":"Best pizza you will ever have. Not expensive for a really big pizza. Must get margarita pi","useful":0,"cool":0},"9U7T1Znp-afS2u_xqv8mXQ":{"text":"This place is SO close to my house. I wish it was better. Went in tonight. Got two slices ","useful":1,"cool":1},"DQdSZ971S2xi1j4YIHTJOw":{"text":"I think PD has got the best pizza in the city. The blend of spices in the sauces, the thin","useful":5,"cool":3},"grPaD76itHV3csztm9gq-g":{"text":"One of my favorite joints in the city has fallen to the surge of the AirBnB dwellers who h","useful":8,"cool":1},"Ykp5yDROobtazc_3v5uiOQ":{"text":"Really great crust on the pizza.  The kids loved the garlic knots!  The worker friendly an","useful":0,"cool":0},"ZfvjiYtM0gV1OXgHZuJ6tQ":{"text":"New Yorker here! When you are looking for some traditional, authentic, pizza without all t","useful":1,"cool":1},"68roqU_5XD0iswaMzvzshw":{"text":"Very basic pizza if you are in a rush and need something to eat quickly.   I like the walk","useful":0,"cool":0},"iLNpaLTm9aiJtRDlmzAWRg":{"text":"Let's get straight to the point. The pizza pie is a very huge serving!! It is a thin crust","useful":5,"cool":2},"Mz5i80IjAjbITl-LQ2kDPA":{"text":"Wowwww, this place is not good. Our table of 8 agreed on this. The pizza knots came out co","useful":1,"cool":0},"pbFLPyJV1DBwMU4pKVTS6w":{"text":"Fantastic! Bronx, NY woman...this Pizza is where its at!! A must go!! They make their own ","useful":2,"cool":1},"GhUvMZgy7SB91c0YIDqSPA":{"text":"does this place really need another 5 star review? nah, prob not, but I need 100 reviews u","useful":9,"cool":10},"giPK6AeLWatfn0YblfHM8w":{"text":"We love pizza delicious and we order it every Friday. Recently they messed up multiple tim","useful":0,"cool":1},"zV8HIO_YVaksCK-0MT9okA":{"text":"Being from out of town and a foodie, me and my boyfriend decided this almost 5 star pizza ","useful":0,"cool":0},"zwKO6Ce7V0ULy3rSS6Xsrw":{"text":"The prices are fair and the menu is constantly changing. Pizza slices are pretty large and","useful":2,"cool":1},"qpEXRadIZjkmA2mJ_LjDCA":{"text":"If you like crispy thin crust, there's no better place in Nola. \n\nHands down the best pizz","useful":0,"cool":0},"3UjTe4GLqEP0cinHSpXmBA":{"text":"This is about as close to NY pizza as you're going to get in NOLA.  I stopped in here on m","useful":0,"cool":0},"Rq78HzBsdHZyGmK0q9tsRQ":{"text":"I love Pizza Delicious. Very flavorful. Really good pizzas, and I highly recommend orderin","useful":0,"cool":1},"ar1zq-s7biZWJNhBTaaIFw":{"text":"The cauliflower rolls were SPOT ON!!!!!I had tried another place for dinner, it was really","useful":2,"cool":1},"DfJaBQ_RegxeK5kpZ5ZEFQ":{"text":"I was finally able to try this pizza last week.  I really liked it. It has a thin crust an","useful":0,"cool":0},"MjpBimi4z0JT9u3Bu-XSpg":{"text":"As a guy who lived in NYC for 10 years I can say this is better new York style pizza by th","useful":0,"cool":0},"HU4Cm35ZeC7soVwb6nSpQg":{"text":"It's OK. New York style pizza which, admittedly, is not my first choice. But it's a nice a","useful":0,"cool":0},"FcsRGVt0bv3LzlK22uDn9Q":{"text":"So sorry I forgot to review this place months ago when we were there but if you are in NOL","useful":1,"cool":1},"4sJM9H8i2oncOCZsVKSPsw":{"text":"Want to make a decent workout seem like a distant memory from a time long, long ago? Demol","useful":22,"cool":15},"_5dsrgh8k0rp3uHZqWVwZg":{"text":"Ok its time that I update my review because this place is special. What is special about i","useful":3,"cool":1},"33VnkbFrxwaxJ-JVuRnbLQ":{"text":"Growing up in New York (though I don't live there anymore), I can remember two things that","useful":10,"cool":0},"F4seZseCYYLu1FGDud8BTQ":{"text":"I'm coming back to update my review.  It has been consistently very good over the past few","useful":2,"cool":2},"RIrW5katX5DIK1PWw9gGWg":{"text":"I put in a order for delivery for 4:30 delivery. I was told that it was \"on the way\" come ","useful":0,"cool":0},"IaAh8O7pMS3cD8hn1bGBYA":{"text":"The garlic knots are just groovy! The pizzas are so big! Love the sauce! The atmosphere is","useful":1,"cool":1},"A6qPUXMYDyIX5_xR_E3Wdg":{"text":"Real New York pizza.  I tried a slice of pepperoni and supreme.  The pepperoni was excelle","useful":1,"cool":1},"xnrpV2VX0yWs_6MIo6UAyA":{"text":"I hope ya'll don't mind if I sloooooow jaaaam this review.  \n\nAwwwwww yeeeeeaaaaaaahhhhhh\n","useful":11,"cool":9},"FVhv_5G2CI9Qef7_BE6vkw":{"text":"Went there for lunch on a rainy New Orleans afternoon. What a treat , the very simple pepp","useful":0,"cool":0},"O2-UDGpX8Jzjze7PoMBNeQ":{"text":"Best pizza in New Orleans and it's not even close. Effusive praise to every pizza enthusia","useful":2,"cool":1},"nlZeTuEcQAiyZis6nq7-fQ":{"text":"8 months ago I gave Pizza Delicious 4 stars based on their old place that only served pizz","useful":3,"cool":2},"PTk4UnyyypQFnOoyy2VhAA":{"text":"I haven't been to Pizza Delicious in a year and a half. I remember it being so much better","useful":0,"cool":1},"2JFUJYexL7vjJB1GHETWlw":{"text":"Always a great inexpensive meal. Love the New York style thin pizza! My daughter didn't wa","useful":1,"cool":1},"35iSEVNGjiRd0uEBVc8FJQ":{"text":"By far not my favorite pizza but does the trick for cheap. Most slices are around 3$ and a","useful":1,"cool":0},"wvwfGIuyLVSQkC3-PiYEWQ":{"text":"I've lived for enough time in NYC to get some of the best slices and pies around. Pizza D ","useful":0,"cool":0},"7O2s8MExdeCBiwChsPeVtg":{"text":"Pizza Delicious has gotten a lot of attention as the best pizza in NOLA. I will acquiesce ","useful":5,"cool":1},"aOIpLll4vWjr9gkzLTlqgw":{"text":"We heard so many great things and were really looking forward to the pizza. We ordered onl","useful":0,"cool":0},"WcaBuIp2McKVmNAYRmlRFQ":{"text":"Simply the best example of true New York style pizza in the New Orleans area. Others like ","useful":2,"cool":1},"aY7BhUCdW47xwWDvZdz3sA":{"text":"The name says it all. This is the best pizza in the city, and some of the best pizza I've ","useful":0,"cool":0},"r5b1D08tSJ_FehAMRph0sQ":{"text":"Omg the best pizza I have had in such a long long time. Try the artichoke stuffed pizza if","useful":0,"cool":0},"5pcnNW1Mq8XlJibg0a8L0w":{"text":"THIS PLACE WILL ALWAYS HAVE A SPECIAL PLACE IN MY HEART!!! (Sorry but I really would screa","useful":2,"cool":1},"Cp-1qHsAfOjLavgbIzW8Tw":{"text":"Great crust, nice char, but the taste was just ok. After reading all the reviews I was exp","useful":1,"cool":0},"9I-HzV-IF5q6E70S0niTYg":{"text":"These hippies can make a good pie, just don't expect great service. \nWe order from here al","useful":0,"cool":0},"YRvdRenx5IvUzJ0QdU6LOQ":{"text":"om.nom.nom.\n\nJust ordered a cheese pizza and two orders of garlic knots for my roommates a","useful":6,"cool":4},"8jUi7fbfkE0pbPj20mwvJg":{"text":"Order from here all the time. Daily specials are always fantastic and $2 slices can't be b","useful":0,"cool":0},"VYcOrOqm94lHVzz7bDCzcQ":{"text":"Best pizza in town. Hands down. It's the thin crust New York style pizza. They make good p","useful":0,"cool":1},"oxF28rmSe9yzPK9HWtToZw":{"text":"Okay Pizza Delicious, I see you. Stepping up your game, adding vegan options, and expandin","useful":3,"cool":1},"tT1JrP9XBsvOssV8F6y9hg":{"text":"Best thing on the menu is definitely the margherita pizza. I've tried others before, plain","useful":0,"cool":0},"3h80vlqSDm33P3yaAkEWFw":{"text":"Maybe I didnt order the right pizza or New Orleans really doesnt have a clue about what go","useful":4,"cool":2},"DGYPE6R3U429dLOKpxPGjg":{"text":"After two visits, I think Pizza D is probably my favorite place for Italian food so far. T","useful":2,"cool":1},"dlKOA37eyObL_7SWHq4rqA":{"text":"Pizza was fair, prices were pretty good. Really enjoyed that I could order a single slice.","useful":1,"cool":0},"-6hOK6aY0aZl1DwvAzT0ng":{"text":"This place definitely lives up to its name, yall! \n\nLet's get the formalities out the way.","useful":14,"cool":10},"2e8eX31aW3nwg8ZmkzDN0Q":{"text":"Oh Pizza Delicious. How I love you. I am a Yankee. I like my pizza crust thin and sweet, m","useful":6,"cool":4},"K8bC301euRCrvpfyh6oVLQ":{"text":"Pizza was amazing love it. It tasted like my home town pizza in ny,  it held up to the fol","useful":0,"cool":0},"6ajff3IaZpMYCwQYe6RInA":{"text":"This place freaking rocks. Great customer service and their pizza/salad/pastas are ON POIN","useful":1,"cool":1},"lXMF7qU6DMRnEpGxQZQRow":{"text":"Always fresh, always delicious. Individual slices and the pie itself are huge. My go to pi","useful":0,"cool":0},"igDs-i17LNLlsSZKJbAaCA":{"text":"Our favorite pizza spot in the city ! I also LOVE their Caesar salad .....  To go orders a","useful":0,"cool":0},"Vsry1f2dREtytFGnEwiK7g":{"text":"Thank you God for the existence of Pizza Delicious. Amen. \n\nA good pizza place is exactly ","useful":2,"cool":1},"xW2aaz1nvr2lVSiYLeO2Qg":{"text":"1st time back since whole Covid thing.  Got sausage and pepperoni takeout.  Was just okay.","useful":0,"cool":0},"sUZOHu41_LaUpOxEqh2pyg":{"text":"The name says it all. By far the best New York style pizza in New Orleans. Crust is firm, ","useful":0,"cool":1},"5p9luZCiz61Qxzwu8XbdoQ":{"text":"Pretty good pizza! It's plenty cheesy and not dry at all, but surprisingly salty. I usuall","useful":1,"cool":0},"6TKrk4GyX2ba9MjDVKurxg":{"text":"It's all in the name, and the pizza is definitely delicious. It was more artisan than grea","useful":1,"cool":0},"4U30uKPoWJp0u9sAMRHZ8w":{"text":"Always great pizza! Consistent in every way.. fresh ingredients and crust is perfect. They","useful":1,"cool":0},"hmkGfIzMHKJzzXuydOl09g":{"text":"After seeing all the pictures on Yelp, I couldn't wait to get a slice. I ordered for pick ","useful":0,"cool":0},"3TfnAwJYtNu-lBBmMBPi5A":{"text":"Pizza Delicious? Yes, but \"pizza perfect\"? Umm, not so much. It's good, but I've had bette","useful":3,"cool":2},"r6Jw8oRCeumxu7Y1WRxT7A":{"text":"The first time i tried them i called in an order and they were missing half of their ingre","useful":0,"cool":0},"sZcSHCVoCHg3lWh2s3m2Bw":{"text":"This is a review I hate to write because I was really hoping to be wowed by Pizza Deliciou","useful":2,"cool":1},"rw7Py5-hpDwj2TNDxm6B2g":{"text":"Unfortunately we missed the \"secret off the menu\" knot-chos, but tried the garlic knots an","useful":2,"cool":2},"BdLZVvtaZoC3B2iP6ydKiw":{"text":"Consistent , right price and tasty pizza in Bywater. \nI always get just a slice - it is ea","useful":0,"cool":0},"HtqbZhwNmBK_w8jcTWkUWQ":{"text":"I love their specialty pizzas! The meatball one and spicy hawaiian/pinapple ones are delic","useful":4,"cool":1},"xOokSlKLlKqIdZ6te4wKlg":{"text":"All I can say is Pizza D is back. Not only are the pies great, the pasta specials are also","useful":1,"cool":1},"gG5JLuQB9pE9bMeTaRIdAA":{"text":"I went here to try the pizza because I've heard so many great reviews but I ended up getti","useful":2,"cool":1},"oSuzl7q0Muok8HE7HhgTZQ":{"text":"This was my first Pizza Delicious experience. We decided to get the Pizza D Supreme that h","useful":0,"cool":1},"zsc6-jGkHknwspQBa08y_g":{"text":"Pizza Delicious is an appropriate name. The pizza has great flavor and is thin crust under","useful":1,"cool":1},"xY91vvyiDTVEVFjw8ZTXfg":{"text":"How does a kitchen co-op keep their pizza so consistently delicious?  \n\nThe homemade meatb","useful":1,"cool":1},"y7YXqkLNnosRaBHl8KoxKQ":{"text":"Pizza Delicious is pizza delicious is pizza delicious.  \n\nOK, granted that assessment does","useful":1,"cool":2},"0IQY5vnaxtcDCwCAWX4U8Q":{"text":"I liked this place a lot. The pizzas are delicious and the vegetarian options are great. I","useful":2,"cool":1},"Ta1qhlB5OW9JC0XwgxG88A":{"text":"I AM POSTING THIS TO FOCUS ON MY FIRSTHAND EXPERIENCE AS A CUSTOMER OF THE BURI\n\nPIZZA MAL","useful":4,"cool":1},"WrPfySBTK-akOGt28D7cPQ":{"text":"Wow! We have pizza that good in Nola? Went there for late lunch on a Sunday, and man was I","useful":1,"cool":0},"pHCuS4Zj8rX6vQOOyZs7AQ":{"text":"It would have been five stars, if the service was just slightly better! I ran into two peo","useful":1,"cool":1},"niIZU5AFxLNG5pX8EtgJiw":{"text":"Great New York style pizza, and especially great for the price! I came and tried all three","useful":5,"cool":4},"pUaVO5ZteBkm8YqIeXa50g":{"text":"First time at this place to grab some quick pizza.  I liked the concept of being able to g","useful":3,"cool":1},"TkyhwDW12ykQsyic35GLiw":{"text":"I love hmm let me think about it.. Oh yeah everything thing about this place. I'm sitting ","useful":3,"cool":3},"eFVI5WR6dqj8R6XHYgajJw":{"text":"This review is based off of two important things... service and food. Let's start with the","useful":4,"cool":0},"C_HBbnuWNt_5SSi5xaRsCQ":{"text":"First time trying their pizza.  New York style pizza.  Great crust with just the right amo","useful":3,"cool":1},"Ht0h3PpxC_kguhO7FglUlQ":{"text":"Sundays in Nola are lazy and relaxing.  It's about recovering from the nights before and p","useful":4,"cool":5},"DKIjTDGfqeCEXKt5wsqdUA":{"text":"Really good pizza. Thursday 830 pm no line and tables available inside. Two slices + garli","useful":2,"cool":2},"YDBjRTTYVcGobODu1UXQvg":{"text":"We found this place via guidebook and it's entry was very accurate - thin pizza, NYC style","useful":0,"cool":0},"Sd_9v34Uk71gwbij6IZUhQ":{"text":"My friend and I took a spontaneous trip to this beautifully designed and conveniently loca","useful":2,"cool":1},"zP6gYTF3Hk6rjWt_94xG3g":{"text":"I was either a bit too critical six years ago, or they've improved, but either way Pizza D","useful":20,"cool":19},"7G_7tyKzv1ELggbNDag3CQ":{"text":"As a guest, I'm huge on \"experience\" and \"costs\" and how those two things merge and align ","useful":0,"cool":0},"nnx1xlruCtVPcK3GS1Sbtw":{"text":"Home of the best pizza in Nola, Pizzadelicious is only open on Sundays and has a different","useful":4,"cool":2},"03T9LN1UMvqW07izv6DQQA":{"text":"The pepperoni and broccoli rolls are simply amazing!   And the pizza dough is easily the b","useful":5,"cool":3},"L7eYfno2i___qbp0cuLD9w":{"text":"So I'm not a big fan of their reheated slices, the size is nice but the overall pizza is o","useful":0,"cool":0},"3CxR9StWIeyfWc9eI5AeHw":{"text":"If it were more consistent it could easily be a 4 star place.  They have great staff and a","useful":3,"cool":2},"mRJKaEi1AA70z03WWiiFkg":{"text":"I decided to have an impromptu birthday party. And the staff were awesome and accommodatin","useful":4,"cool":3},"5k-Xl8PttSm5qGIZgOmsSw":{"text":"Good pie with limited topping choices. They offer a really large 18 inch pizza and a few b","useful":1,"cool":1},"zX-7O25nJAylv3-3xb2bgQ":{"text":"I love this place and wish i had listened to friends and gone sooner. However, that was no","useful":3,"cool":3},"AnjMhIqyEDyNfJhkr5fgXw":{"text":"With a name like pizza delicious...well you expect it to be delicious. But I guess a name ","useful":3,"cool":2},"UlwcyYbdZaq7rbIu783hXQ":{"text":"The crust is to die for!\nQuick visit from SoCAL visiting my bf Cousin who are locals here.","useful":1,"cool":1},"FBVDNOPaMC4hO0SyqTgX5g":{"text":"Another awesome pizzadelicious this weekend!  Greg and Mike's Homemade Meatball pizza was ","useful":3,"cool":2},"HoYYff0d8cK9MQsl_dVg5Q":{"text":"I talk a lot about pizza, I love to know what places and types of pies people enjoy.  When","useful":1,"cool":0},"neAWC72-4_4kAgzxkAeSBw":{"text":"Evidently they do not believe In science. They make you wear a mask when ordering and the ","useful":0,"cool":0},"GWui8ICsMNrv6hiPUsdyNw":{"text":"The pizza here has got to be the best pizza I have ever had in Nola. Pick the Supreme, add","useful":1,"cool":1},"t5g-NpfmW_C7ZB-mph8rcQ":{"text":"Awesome pizza\nGreat People\nYes Yes Yes\nWin Win","useful":0,"cool":1},"U0x-YpMFCzajdLt-cn43Sw":{"text":"Color me surprised when we stumbled upon one of the best pizza places I've ever visited du","useful":4,"cool":2}}