{"36CPv80GrsKvawPPIr0PSQ":{"text":"Raspberry Mojito was strong and good.  Calypso beef tacos were excellent.  The location is","useful":1,"cool":1},"iAcENdDI5JlMeX8ARlPPmQ":{"text":"I come here every time I'm on magazine! Which is quite often! The flaked fish and the chop","useful":1,"cool":1},"YEYaULrjJEmchRRVfOdrMg":{"text":"I have never been disappointed here. To be fair, I have only ever ordered the tacos, but I","useful":0,"cool":2},"Fxv3EqYn_nrJLfenvuhbwg":{"text":"Really yummy quesadillas, appetizers, and has a variety of tacos with different toppings. ","useful":0,"cool":0},"vGIRXs07kNsCVOek9fVohg":{"text":"The lines are long for a reason. One particular Tuesday I ordered four tacos and two coron","useful":1,"cool":0},"NjLnyCgTQnPoSE__QFzL9w":{"text":"Taco Tuesday!  $2 per taco = amazing!\n\nService was fantastic! Our waitress was so kind and","useful":0,"cool":0},"CMxlDosxdXBKHYZcbIg1NQ":{"text":"Rum House is a Carribean inspired taqueria in uptown New Orleans. This place is worth the ","useful":1,"cool":1},"2SKXcxRxP5fE89mg7kO2ig":{"text":"So yummy! The taco options are vast and amazing. We had the nachos with brisket instead of","useful":0,"cool":0},"Lh6x7T8hYt3QK2p-RQ_m6A":{"text":"Try the mango avocado dip it was ridiculously delicious. The damn good nachos are really f","useful":0,"cool":0},"btW5lSAIq9Msyy3G9mjysg":{"text":"I came here earlier today to have lunch with my friend and we had the Queso and chips, Gua","useful":0,"cool":0},"bviCJTKGWk-LFODMIso5ag":{"text":"This place deserves a full 5 Stars. Delicious tacos, so many unique varieties. Drinks grea","useful":0,"cool":0},"PEH2Pl8-zmMb9SWjKz4IJw":{"text":"Any time I'm looking for a place to go to for Taco Tuesday I know that I can count on Rum ","useful":0,"cool":0},"FYzd_fDXYLLUk3EYvJf74Q":{"text":"We ate here on Oct. 31, 2014.  This is a GREAT find on Magazine Street in Uptown.  It bill","useful":0,"cool":0},"u_nYKlNFyOJxmXNXoUswTA":{"text":"Where do I begin? Delicious food, awesome drinks or the friendliest server on the earth? W","useful":0,"cool":0},"AqFFwPnuXCHfELgofHfn9Q":{"text":"This is my all time favorite restaurant. I went to college in New Orleans and The Rum Hous","useful":2,"cool":1},"pC0sX2cnq8S-e7t70OP--g":{"text":"What a nice restaurant! Many young people. Good food and service! The Pollo Asado is prett","useful":0,"cool":0},"blq18o7bAdbZCmhbVxtZFA":{"text":"My man and I decided to switch things up and try The Rum House.  We went for lunch on a Fr","useful":2,"cool":2},"dMQSsjFUfpxIk5Nn7JNP-w":{"text":"The food here was great! A fun menu with choices sure to please everyone. The taco variety","useful":0,"cool":0},"ts8uVzxTrm1bVtGpJHAriQ":{"text":"Great restaurants always have a long wait rum house is no different . Put your name on the","useful":0,"cool":0},"W1shn_2Z_Qo5Cd-unb6Maw":{"text":"Awesome food. Worth the one hour wait.  We loved all the starters, the queso was definitel","useful":0,"cool":1},"l7Wsj5DRctHSENybTr6_NQ":{"text":"Terrific tacos.  Great drinks. Lots of places to sit (inside and out). Good for kids (desp","useful":0,"cool":0},"Syuk-c-fkgMKNQZzIBFEJg":{"text":"So bomb! Our favorite place! We were visiting NOLA from Los Angeles and went to this place","useful":0,"cool":0},"ZFnsv1YU0jjI9xYeAFKifA":{"text":"This place is not good. There were 6 of us so we got to try a variety of unsatisfying dish","useful":2,"cool":0},"q5wrbZ8onpDgTrHFRARALQ":{"text":"What a fun restaurant! We made our way through for lunch and it was so delicious. Their sp","useful":3,"cool":1},"vHJUgJSTdHo0oYIkfM0_fg":{"text":"It has a great happy hour. Probably one of the best on Magazine St. I was disappointed to ","useful":0,"cool":0},"lDOdw_zG1hyqTNcomT0bZg":{"text":"This place never disappoints me. Wonderful food, drinks and people. I love The Rum House!","useful":2,"cool":1},"nv1XYcJcm0DoxKq32N348Q":{"text":"Looking for a cool hang out with cool drinks? Rum House is your place :) We stopped here f","useful":0,"cool":1},"8balOs0BK9xlJLwK41A7ZQ":{"text":"We are from S.F. and had dinner here last night. Excellent service and food. What a great ","useful":0,"cool":0},"nddvzFYrhGXU9L1j5qOpCA":{"text":"Accommodated my football game. Great waiter. Queso was A+. Tacos were fresh. Drinks were g","useful":1,"cool":0},"1lk6dT2NgIgGdCKre2lO3w":{"text":"The Mahi fingers are easily in my top 5 apps ever.  Great drinks, fantastic food, and atte","useful":1,"cool":1},"mCr1fQjYQz3glPfLUEpVKA":{"text":"The drinks are REALLY good here, try the Painkiller! The food was very good, lots to choos","useful":0,"cool":0},"MIgDgiDkx-s2zpY06SYRcw":{"text":"My A-OK is a shout out to all of you that are going to The Rum House for Taco Tuesday. I w","useful":0,"cool":0},"qQycVfw7NWp_76hZJb2kew":{"text":"Dined in yesterday for \"taco Tuesday\" the food as always was phenomenal. I had the calypso","useful":0,"cool":0},"-3xZPvksJoyUEEwOuhrjZA":{"text":"Best taco menu ever. Great service. Good location. Very creative. Huge selection of rums.","useful":0,"cool":0},"y3_JzdGPaB9R9tGZWn2VkA":{"text":"My sister, a Tulane student, absolutely loves this place. She took us when we were visitin","useful":0,"cool":0},"p1HHErWMCTUN_28auEjrSQ":{"text":"Rum house is awesome and I go here all of the time, especially if I have friends visiting ","useful":0,"cool":0},"6NO7aJEi3teVmBAhkxRgrw":{"text":"Very good carribean cuisine..make great martinis, seafood curry was excellent. Will revist","useful":0,"cool":0},"a2Dk9fy9e1ekU-la80aV7g":{"text":"Remember remember the 5th of November? Ehh, I don't either.... But this place sucked.\n\nI l","useful":3,"cool":0},"fwFMtOPBAioERFXbZFK6TA":{"text":"I've been here tons of times and I swear I never get time of it. Definitely one of my favo","useful":0,"cool":0},"vF-ggbFdpWyr55W17AyfAw":{"text":"Guacamole = the best (and I'm a snob)\nHouse salad = perfectly dressed, just enough cheese,","useful":0,"cool":0},"vsHZewaHEaIW5WpHWSmS8w":{"text":"I'd not have gone to this place had I not read a reco by a local NOLA.  The name is a bit ","useful":0,"cool":0},"NDm1ZwBd3Y86-ocx_6fZlw":{"text":"Got recommended this place from someone who knew we were visiting from California. I guess","useful":8,"cool":5},"jYO3sgn1kAMfvUcMqQx11w":{"text":"Mighty food. Seafood pepper pot was simply magnificent. Thanks to Molly for her very perso","useful":0,"cool":0},"v78UqEEPpIkuGKrWwZ2YoQ":{"text":"I've lived in the LGD for almost three years, I've always enjoyed the environment at the R","useful":0,"cool":0},"7WBddi8cVS5iI8qcDzmGng":{"text":"Great Spot! My brother recently moved to New Orleans and I came along for the ride. I have","useful":1,"cool":0},"l4Ncy4R_kGt745MfPbNPzw":{"text":"Great location, nice decor, outdoor seating, sports on TV, large bar, friendly servers. \nI","useful":2,"cool":1},"yIRu6c_LbpGmcykY2eMCAw":{"text":"Great food and drink options. I would have given 5 stars but I was really disappointed wit","useful":1,"cool":1},"F6e65o2J_C3_rRtI2FoS2g":{"text":"Best seafood tacos ever! We will definitely be returning here every year for our annual NO","useful":0,"cool":0},"NC8Xgwzwo6HAjqYQxc3AOA":{"text":"The food was ok but small portions for the price. The drinks however were great and the at","useful":0,"cool":0},"fV6cYqQdTKUNpY4tg3M03w":{"text":"We started out with the avocado mango dip which was fresh guac with little pieces of mango","useful":4,"cool":2},"518A_wtyGisDtdBrto8HFw":{"text":"One of my favorite places to eat in NOLA!  I always get the frozen margaritas and the duck","useful":0,"cool":0},"9dUvl4miDDUAGNbcFirw_g":{"text":"Love this place. Gets a little crowded but that is cause it's good!I have eaten the Jerk C","useful":1,"cool":0},"hFwYQVGzsdpolSdYLQmQFw":{"text":"We came here based off many suggestions from locals. Let's just say they did not disappoin","useful":0,"cool":0},"x1ez5uxqpb3fbcwp269cbA":{"text":"The food is much better than expected. Had the beef as well as scallop tacos with sides of","useful":1,"cool":0},"0LJ5T6S9u-rCH-AzLUbHew":{"text":"This place came highly recommended and even though the wait was long it was worth it. We w","useful":0,"cool":0},"9OHXWa_EzSj484LKgIb51A":{"text":"This place is so fun! The atmosphere is great, very Caribbean. The food and drinks are fan","useful":1,"cool":0},"AnFMQiwbuTqCVmDf2a5rjw":{"text":"Started with NOLA 7th street wheat beer - awesome choice! Each of us had the \"Two Dat Comb","useful":0,"cool":0},"Mz4Jg2nDugr_pVR6h93KIQ":{"text":"This has to be one of my favorite restaurants in the Irish Channel.  Some very tasty menu ","useful":0,"cool":0},"xqKYjywYud41iEK5DDrixA":{"text":"Good food at a good price seemed authentic but it definitely doesn't feel authentic in the","useful":0,"cool":0},"WjPIHc0DeSVaAkK0Ld_l7A":{"text":"I aimed for, and thought we had asked for a table at the next door Red Dog Diner and only ","useful":1,"cool":1},"CmRV-eTFYCT3IelU5ULRgg":{"text":"Awesome!!!! Finally ate here and was knocked off my feet. Everyone must go and bring frien","useful":0,"cool":0},"05HJsGul5GpWmqf1K7orBA":{"text":"The kitchen needs better ventilation so I don't reek like a giant burrito after I leave.  ","useful":0,"cool":0},"t5eCvur-bM9evCks_x4Ibw":{"text":"Me and my friend went there close to closing time, since we didn't know at what time they ","useful":1,"cool":0},"o34qpgOdWYNsk892OOInmw":{"text":"One of my local favorite places! But be aware this is also many others favorite as well so","useful":0,"cool":0},"DDZWBl1HOSU5k4_9zK5xTA":{"text":"I am a fan of The Rum House. It's a neat fusion food idea, unpretentious and deliciously s","useful":1,"cool":0},"3XGvPpjtbBxZZUH25LnYlg":{"text":"When in New Orleans you must try this place. food was awesome, jerk chicken nachos..omg my","useful":0,"cool":0},"57g7FSOAD4WnWfkTnKr87g":{"text":"What I love about this place is that you can order one of every kind of taco if you wanted","useful":0,"cool":0},"n7cxpBqjuJcnnBosWZcPKA":{"text":"A group of us girls stopped at Rum House shortly after flying into New Orleans and it was ","useful":0,"cool":0},"d74GySjyK6x0piVerPGozw":{"text":"Awesome restaurant! Inside it's just absolutely beautiful. The way they designed the place","useful":0,"cool":0},"hHp9du7BmuBfsvVcHrYAyA":{"text":"We happened upon this little gem because our destination, Funrock'n, is across the street.","useful":1,"cool":0},"lotqKqDFmQCpUdjSgSrsOQ":{"text":"This will most definitely be on our rotation when we come to New Orleans! We loved everyth","useful":0,"cool":0},"foAoQHcPiwPdI_0Eh93SAw":{"text":"Like it's New Orleans location, The Rum House in Baton Rouge is committed to excellence.  ","useful":2,"cool":2},"weUhjZ5KcLbNHH7qP53-ZA":{"text":"I ordered the avocado and mango salsa first- amazing! The best guac I have ever had. The s","useful":0,"cool":0},"8r8Cw8GmbQyI0HWz3A0cww":{"text":"Fantastic and unique tacos! Has a great lunch with margaritas for taco Tuesday. Would defi","useful":0,"cool":0},"v9jT8dPsfIVP0rOZbT4HLA":{"text":"I liked this place a lot!! Service was excellent and atmosphere was cool. Had the tuna cev","useful":0,"cool":0},"6EHESmw1gYrvKJxr0u2wOA":{"text":"We took friends from the Netherlands on Taco Tuesday - of course it is busy but it was gre","useful":0,"cool":0},"sZbLquAYLZr19ZFxZX2KEA":{"text":"The food was fantastic.   I had a fantastic asparagus soup and bouliabase type entrée. Wil","useful":0,"cool":0},"WkbjZpBJtBgr5E7TDiU0og":{"text":"First time we came here and sat at the bar we had excellent food and service.  Tacos and c","useful":1,"cool":1},"Qmlg5iitZmK_u2Wi-YWeBQ":{"text":"What's better than a regular day at The Rum House?  \n\nTaco Tuesday!\n\nThis is probably one ","useful":1,"cool":1},"ll_vfRZn9dTSsDnw84Gu7Q":{"text":"The sweet potato chips are fantastic and I LOVE the veggie roti. It's so nice to be able g","useful":0,"cool":0},"PWUfZTeTfkrE2IHAvyzumQ":{"text":"The Rum House is pretty consistently good.  I LOVE the mango coconut rice and the Two Dat ","useful":2,"cool":0},"A9-ibOEX-rcIWfIogPKBNA":{"text":"Favorite place in New Orleans!! The fish of the day entree, jerk chicken salad, nachos, ba","useful":0,"cool":0},"EFDSZN7wx7rgK7c0WtJqAA":{"text":"If I was rating the Rum House on atmosphere and service- it would get 5 stars. We sat insi","useful":2,"cool":0},"vmkwkSgqNXFVdefYZgo93w":{"text":"Excellent queso blanco\nTall mason jars of soda & water\nCalypso beef taco is out of this wo","useful":1,"cool":0},"SSN98BuaydgPte1DT_0eSQ":{"text":"This place gets pack quick so make sure you get there early! Hands down, their tacos are o","useful":0,"cool":0},"K50dBo-5WAG6BkqHQAxwAw":{"text":"My fave thing on the menu is the lamb tacos, though I've never been disappointed with anyt","useful":0,"cool":0},"y3q6SuBMoZ9sAYJLwNiRzA":{"text":"I love the Rum House! I try and go every time I'm in New Orleans & I refer it to all my fr","useful":1,"cool":1},"Klj4gGHBtIjg_aKTGpopMQ":{"text":"We started with the salsa and chips very fresh and had a nice kick.  I had the Mahi Mahi s","useful":0,"cool":0},"p-my4_EfgtMtQ7bJDO5qjA":{"text":"Great drinks, huge selection. Hip younger crowd...late twenties, early thirties.  Every di","useful":3,"cool":3},"QPsrtTfjkJ9WrTrkblETZg":{"text":"One of our favorite restaurants in New Orleans, the fried plantains are a must!!","useful":0,"cool":0},"HJ4l-PM5miLifrFb1YE3bw":{"text":"Be forewarned -- all I did was drink.\n\nPost class it was necessity and considering it was ","useful":1,"cool":0},"MWnEEdJvHHcf07CnZteK_g":{"text":"This place was pretty good. We ordered the jerk chicken quesadillas, crab melt sandwich, a","useful":0,"cool":0},"Nv3SaLsU49o90fWUIllZnQ":{"text":"Wow, what an excellent meal. I had the Taco Trifecta with the Greens. Great service and re","useful":0,"cool":0},"TczkrrT8ZfKv_exxHZj5uw":{"text":"SPICY PUFFY TUNA CEVICHE TACOS, DAMN GOOD NACHOS, and COCONUT MANGO RICE are MUST-TRIES!  ","useful":1,"cool":0},"xqCBziBolDAAr2K2P5FWJA":{"text":"This is my SIL favorite places.  We were lucky enough to be seated outside, and even thoug","useful":0,"cool":0},"Wjl5xwH0dE9prrmHrkxlLQ":{"text":"Excellent tacos. All were flavorful and unique. Cole slaw was delicious. Will definitely b","useful":0,"cool":0},"ENWGoEt5_YlKSf-nTwzocg":{"text":"I really like The Rum House for an informal dinner with friends. It's got a great location","useful":1,"cool":1},"3t8BHJyFE-3uAtVKZz-hmw":{"text":"Excellent service. Had trio of tacos that were all very good (brisket,calypso,mahi). The B","useful":0,"cool":0},"r8W3FABaYsLhXZn-xiwkDA":{"text":"Visited the big easy on business. We wanted to try out something away from the Quarter. We","useful":0,"cool":0},"4pHSrQEs6afa1aHHctrhwg":{"text":"Wow, we really, REALLY like this place. Not only are every one of the tacos we've ever eat","useful":2,"cool":0},"IetJQOd9bkiXCX0gacRnEw":{"text":"What can I say? This place was amazing. I'm a big fan of Jamaican inspired tacos so to hav","useful":0,"cool":0},"imOqefACl_-oNiG7kDw42A":{"text":"Fast service and delicious food. We each had the 3 different tacos and they did not disapp","useful":0,"cool":0},"9DCcxBD6ZLCktNJ868sxPg":{"text":"Thanks to Garrett I had tremendous service if it weren't for him my experience would've be","useful":0,"cool":0},"UwfBqzcJ8cy1TGB-QpAnQw":{"text":"We are rum fans, so when this place showed up on Yelp with great ratings we weren't going ","useful":1,"cool":0},"b3GQKg4djZNOtjdxU3am0Q":{"text":"Pretty awesome place. Service was great, good choice of draft beers, food was excellent, e","useful":1,"cool":2},"13r2sab-dWVpZrGh4BfywQ":{"text":"Had the half chicken jerk with mango salsa and rice. Loved it. Hubby got a taco. $5!  What","useful":0,"cool":0},"iBllWmObeN7ovaAYXex1-w":{"text":"This place was recommended by our Chicago pediatrician (who was born and raised in New Olr","useful":0,"cool":0},"oB2JCzgCbfJLSE3NrYF6kQ":{"text":"Rum house was very good. Loved the atmosphere and food! Wish I could remember what tacos w","useful":0,"cool":0},"_4m_mthILydAc8Ui1JKyyA":{"text":"Our hotel concierge suggested we swing by since we were headed uptown on a Tuesday: $2 bee","useful":0,"cool":0},"Xc8bPVSCxCd9Zr9XhxpnLQ":{"text":"This was a wonderful place for dinner. Atmosphere was fun and upbeat. The food was so good","useful":0,"cool":0},"shQi-bPKvACfg15F3wa21w":{"text":"Everything we had was delicious.  Each taco tasted different and was delicious in its own ","useful":0,"cool":0},"g4PLOBUSxQ02aYEqotLa8A":{"text":"This place never disappoints! We are down every six months visiting family and we always s","useful":0,"cool":0},"kw7OpXaKDU8zmLsPxNmhlQ":{"text":"Totally 'meh' tacos in my opinion. You'll wait a while, too. I'd recommend just going to R","useful":0,"cool":0},"mEfR5pYtY30gXXaC4V05Gg":{"text":"The happy hour alone deserves a five star rating. Delicious drinks, even more scrumptious ","useful":0,"cool":0},"wk0H59Oj5lJHStdrCB9x4A":{"text":"My absolute favorite. I love the calypso beef, scallop, and chili glazed shrimp tacos. The","useful":0,"cool":0},"-a55yKccWrd5c1KIyvcxBg":{"text":"Absolutely awful..and what the fuck? The \"chips\" were soft and hardly even chips. Terrible","useful":0,"cool":0},"O5NwEmMF_f_-obXTK_Foeg":{"text":"There was a bit of a wait, but we grabbed drinks at the bar and time passed quickly. The b","useful":0,"cool":0},"8DaOm25qJtXxhUAtY9o95A":{"text":"First off, any place that serves their drinks in Mason Jars gets at least a few points goi","useful":1,"cool":0},"qx_xJW1V6RCZsriRuMODwQ":{"text":"This place is awesome. I had the red curry shrimp and it was amazing. The place is very fr","useful":0,"cool":0},"MRXAEWXr2Zgdkfe5MyWZsw":{"text":"Cant go wrong with this spot. Its known for a culture filled atmosphere and food to deligh","useful":0,"cool":0},"9ZQPYTK-PDELCaz7sWhTRg":{"text":"I think it's telling that the glowing reviews of this place come mostly from tourists.  I ","useful":3,"cool":1},"elNzQwtjEsqfAzTWjzSbmQ":{"text":"Love the tacos here. The drinks are also great. The flavored mojitos and the funky monkey ","useful":1,"cool":0},"e9pY0Wqn1FObwXjKVHjaiA":{"text":"First time in this nice place, the food is so good, came out very on time, Gina was really","useful":0,"cool":0},"7My3yhG9jKEy2zlUYOYYFg":{"text":"Went here for the first time while visiting for a bachelorette party. Best food! It was so","useful":0,"cool":0},"HmdWo29CvQNpxmgzmDqnYg":{"text":"I had the grilled fish of the day - Have. Fish was cooked to perfection but no taste. The ","useful":0,"cool":1},"gEAXHY7j81m11QMQEsDuNg":{"text":"I started with the fried plantains which can use a lot of improvement, they came in big ch","useful":1,"cool":1},"x2PVySW8EuGj6uAoJjaimg":{"text":"I have come to the Rum house since they opened. At first their Jerk chicken salad was beau","useful":0,"cool":0},"bY79XEAE6i9L2RFPfKm9hg":{"text":"Great wait staff, even if you are sitting at an outside table, which is always my preferen","useful":0,"cool":0},"T-evryqIVfGjhoS9Xhrzjw":{"text":"This is based on my visit in late April during a downpour on the first Jazzfest weekend. \n","useful":3,"cool":2},"0vCF7OfHwgUzkN38MzNOBg":{"text":"We were recommend this one by our Uber driver and left quite disappointed.  I ordered a ve","useful":3,"cool":1},"eYX_8RJ_wh6GKD-4HYNvrQ":{"text":"My group stopped here because we could get a table at Commander's place.The Rum House's li","useful":0,"cool":0},"yr9jKo0TtmlviUq9GKcbRA":{"text":"Before you read too much into this review, I want to say off the bat that the 3 star ratin","useful":0,"cool":0},"HJpLxHHEeVkkWKMdqrWkjg":{"text":"This place has a very rustic feel. The place is always busy, doesn't matter what day or ti","useful":0,"cool":0},"p58VIwZJScGCP05Qoyo32g":{"text":"First our waiter was Joe. Great job Joe! Loved this place. I had the island steak which wa","useful":2,"cool":0},"lnDyU1ME7tLkXXYIDui7fA":{"text":"Delicious!  This is my third time to NOLA and I was bound and determined to find some fres","useful":0,"cool":0},"FoPCSI-EC-JXmNtk0vcmIA":{"text":"We had some amazing tacos here! There's a reason why this place is packed with locals ever","useful":1,"cool":0},"YU0fMsxY2s7ZBwKeb86NXg":{"text":"There are already hundreds of reviews of this place.  I don't think one more is needed.  B","useful":0,"cool":0},"fHTsmcsS2gA8Vfor3vJEEw":{"text":"I came here on a monday afternoon, so no wait, no crowd, and probably too early for rum. I","useful":2,"cool":1},"ECoK765YPmkoNx9ThiSlLA":{"text":"My very favorite place in NOLA for drinks and dinner.  I love the feel of the place, the t","useful":0,"cool":0},"knpf_j8_I9klU_pdBFRhmA":{"text":"Ate here over final four weekend.  Great variety of authentic cusine.  Wonderful selection","useful":0,"cool":0},"Y9YElOrfD8iw0T17mL0CWA":{"text":"Good food, good service all at a reasonable price. A great neighborhood restaurant in a ve","useful":0,"cool":0},"SdOw7CnVqRyuEG_sS1e2Xg":{"text":"Always great food, good atmosphere (a little loud at times) and the best company. I have b","useful":0,"cool":0},"CchtAdsMhFg-QYR1tNT_8g":{"text":"- We go on Taco Tuesdays (POPULAR, LONG WAIT, CROWDED) and have tried most of the tacos on","useful":0,"cool":0},"UqJ7rrpKfcqnwH13W5j4qg":{"text":"My family and I absolutely LOVED The Rum House! We were in New Orleans for vacation, and w","useful":0,"cool":0},"cCiWB6b7W_C29BbVCoaMuQ":{"text":"Meh on the food. Not terrible, not great. The waitresses are cute at least and they work h","useful":0,"cool":0},"yCSfiGZaIWm11PXEhHFfng":{"text":"The servers were excellent! I lost count at how many chips they gave us and refills they p","useful":0,"cool":0},"NeGHTBBgF1jMQFJDdUBWjQ":{"text":"I love this place! Ive been 2 times and had a blast both! Such a fun atmosphere inside and","useful":1,"cool":1},"WV4R6EhUzwcrePd051IV0Q":{"text":"Great place for dinner and drinks. The atmosphere and service was great (my Husband and I ","useful":0,"cool":0},"UT36xhZxrrbOtTrSEXYOWQ":{"text":"$2 Taco Tuesday! Pretty good, jerk chicken was bomb. I love the GUAC. Vegetarian options a","useful":1,"cool":0},"-I9jo2U3LQkqbICwvl2HvQ":{"text":"Just order the nachos. The tacos were decent, but I wished I'd have just ordered the nacho","useful":0,"cool":0},"0Y82Dm7bqjE2DWVF5eMLbg":{"text":"Fun place for drinks - very strong and served in mason jars- cute - or to go cups (still c","useful":0,"cool":0},"omqYZqjJFGsM6JQIO8Oj5A":{"text":"This place was such a gem to stumble on to. The menu was incredible. I wanted to order one","useful":0,"cool":0},"WYx_OCsv05c9Xcc5MbOoLA":{"text":"My advise, get there before 6pm otherwise the place is PACKED and rightly so. The Food is ","useful":0,"cool":0},"7rusGPvIlTqeR42eCHcz2A":{"text":"Some absolutely incredible food. The conch and sweet potato fritters are killer. The bever","useful":0,"cool":0},"zf5Jk2DbNXRRAEbH7SzCrA":{"text":"I wanted to like this place because the location was great and it's always packed (tourist","useful":1,"cool":0},"Jfj2ZXZ20TTYHrfo7EEwDQ":{"text":"Every time I visit New Orleans, I have to stop at the Rum House. Great atmosphere and wond","useful":0,"cool":0},"JG9m5-3NSw4EifW2dEo9rQ":{"text":"Three of us made a day trip to N.O. today to shop at Saks and browse Magazine St.  We aske","useful":0,"cool":0},"TQF278B1Dt-vjDT702ueSw":{"text":"Get the nachos! My bf and I share a full order as a meal. So good! And great margs! We're ","useful":0,"cool":0},"qMZ-ShJQeKrUHKlO5Vq9oA":{"text":"They were packed at 2:00, but it was only a 20 minute wait. The food was interesting. The ","useful":0,"cool":0},"QVpzpe2__VaztZA_PmNx9g":{"text":"There's a salad here that I adore but aside from that....I'm just not that impressed.  It'","useful":1,"cool":0},"NnPR7ljJ0DhGH-Q6AcRFwg":{"text":"A good sign you're at a good place is when they're always crowded. There's usually a wait,","useful":0,"cool":0},"T3VAAFWMbf41G7SAuY74WA":{"text":"Needed to cool off with a cocktail after a hot afternoon shopping on Mag St and Rum House ","useful":0,"cool":0},"0gzmHveJPMknYfRKurGI6Q":{"text":"Tacos are great, asking with the choice of sides. The damn good nachos are just what they ","useful":0,"cool":0},"o_FpOeJdd-zyIScBjTnHfA":{"text":"I have been wanting to try this place for a long time and happened to get an outside table","useful":0,"cool":0},"8lh2RPRcKgNL0IYSGqkQxw":{"text":"Are you kidding me?! Holy amazing!! The brisket, lamb & jerk chicken tacos are to die for!","useful":0,"cool":0},"awt17TIxBzrTQ-cv4JsziQ":{"text":"You don't want to miss this treat on magazine street, in the garden district, a nice littl","useful":0,"cool":0},"cgAW7jfTVfzzGoAJTJsaKQ":{"text":"The food was yummy and the lunch specials are good-$11 for 2 tacos and 2 sides. The jerked","useful":0,"cool":0},"OqnpXAgdzQqjRY2wQyOTvw":{"text":"The first time I've had a pain killer since the british virgin islands that actually taste","useful":0,"cool":0},"ld8NlG1UX6WoeYJz7IUyvQ":{"text":"The bartenders (the guy with glasses an curly hair in particular) has always given the bes","useful":1,"cool":0},"CISH7fmIjKtBemdAwSF3Lg":{"text":"Los tacos más ricos en todo New Orleans. Man! I could not have enjoyed the tacos here any ","useful":1,"cool":0},"Felzd_IqOWkSmJSQ9mzOZA":{"text":"This was my first time in this place, I like the fact that you can park your car anywhere ","useful":0,"cool":0},"y6pvlfJ09UY-3ho37L_Yjw":{"text":"Holy shit the \"Damn Good Nachos\" are DAMN GOOD!   They dump pulled pork & a cheese sauce a","useful":0,"cool":0},"7Xf52B3HT2-KzQ1i9TNGcA":{"text":"Second time there today and had the 3 taco lunch both times.  The crispy fish taco and the","useful":0,"cool":0},"JbWDoXuRBHos-qlZ4ONbTA":{"text":"Excellent spot on Magazine St. for lunch and drinks in the Garden District. \nService is ex","useful":0,"cool":0},"eMj30HWHfDUn-2vHYVkwIg":{"text":"The drinks are fantastic but the nachos. Those nachos are the best I've ever had. Sadly we","useful":0,"cool":0},"K7BaA28LlRAT9tP-EyzUpw":{"text":"I'm specifically writing about the crab melt. Amazing! Super rich, looking back I should h","useful":0,"cool":0},"8me7vU00O2K6D7rjUsV_wA":{"text":"I've been here twice for taco Tuesday! There is always a long wait so beware. The prices y","useful":1,"cool":0},"ByXc7zOl0egHCtt5vbBE6w":{"text":"Tacos are pretty cheap, and for happy hour you can get their \"Painkiller\" cocktail for $5.","useful":2,"cool":0},"Adk8h5bJLcrfjKRZIs-4nQ":{"text":"So I recently came here for lunch one day and I have to say that I absolutely love this pl","useful":0,"cool":0},"OUnqrsvYuzs72N1qQOlEOw":{"text":"Fun atmosphere, but average (at best) food. I've been twice, but do not plan to return for","useful":0,"cool":0},"LfLB1qEVc3okGlTi7vdd5w":{"text":"Great fast food. Wonderful bar tender. We really enjoyed the tacos The finest rum drinks t","useful":0,"cool":0},"xZe6TTGQYAclRifEjZJzKw":{"text":"The Rum House has been my favorite restaurant in New Orleans for the last four years! I co","useful":2,"cool":1},"HxzaWC2q4x3DSfr0vmC0Gw":{"text":"I've been to The Rum House (3) times and I've never been disappointed.  It's a great place","useful":1,"cool":0},"UI029eL3RSuA4L8zr2IQMw":{"text":"Drink was just ok (house run punch), but the food was great. The nachos lived up to their ","useful":0,"cool":0},"v78KAqln-sub_S6k1AF32g":{"text":"I have mixed feelings about the Rum House. DELICIOUS margaritas - especially during happy ","useful":0,"cool":0},"XeYXTqthA5wk_rI_nPJp6A":{"text":"A personal favorite. Always good and always reasonably priced. Kid friendly though not an ","useful":0,"cool":0},"v1KfvNY40FMfrtdeJeIkHg":{"text":"This place has awesome decor and an awesome vibe. Christmas lights, big TVs and water in m","useful":0,"cool":0},"BhsmPb9a_k6vyhttuwmdLA":{"text":"I love fusion food and this place rocks it.\n\nBased on just the name, I never would have gu","useful":3,"cool":2},"D3ZJm6ig70qQOF0IA7qIzg":{"text":"So good! Had the jerk chicken, lamb vindaloo, fried oyster and they were all DELICIOUS. Th","useful":0,"cool":0},"JFHtHg3GNcfCabb8_LsTxA":{"text":"Sometimes you get the most pleasure from simple food. The Rum House excels in this. This i","useful":0,"cool":0},"roXrffjdM6P9qPyxMrSt8w":{"text":"Delicious tacos!  The husband and I both got the three taco meal.  Between the two of us w","useful":0,"cool":0},"821ixJUGTe1m_ge5xvpHCA":{"text":"I'm a semi-regular there and the food and service is always consistently good, I've never ","useful":0,"cool":0},"TC_Sf9DLEPjpwnqBKYcK9g":{"text":"While in New Orleans for New Years, my boyfriend and I made a trip to the Garden District.","useful":1,"cool":1},"cW01FzLSorzZ4gaRS4q9RA":{"text":"Rum house had great service and a fun twist on Jamaican style food. The fritters were the ","useful":0,"cool":0},"7opqKeWiByndbaEejHAdmg":{"text":"Mango Mojitos were terrific . Nachos sublime! All the Mojitos at Happy Hour were awesome.","useful":0,"cool":0},"CWdPsb-QrOihFmLmaahlqQ":{"text":"Second time here, love it!  Really good food at a good price-point! Polenta, tacos, nachos","useful":0,"cool":0},"wTouLw1Y3sr_2LjgCtDINg":{"text":"This was a great place for a quick bite and a drink.   They have $2 beers during happy hou","useful":0,"cool":0},"Ow-v3eV6Q9L6y8Jv3Kdsyw":{"text":"Every time we have eaten here it's been a positive experience! My favorite taco is the cal","useful":1,"cool":0},"LdPeRuRinSIeiG88ybr0FQ":{"text":"Tacos were amazing and worth the wait!! I had a taste of each protein, and it was marinate","useful":0,"cool":0},"Leq7O5rOIBWx19WBRLY4ng":{"text":"I absolutely love Rum House. I have had the best drinks here and crazy cool Caribbean food","useful":1,"cool":0},"iYOD8Dac4h0ndr3tLqiqFQ":{"text":"Very unique flavor profile tacos! We had the brisket, duck, beef and pulled pork tacos.  E","useful":0,"cool":0},"cu-L4RK152wUOrcIHXm87w":{"text":"Great place on Magazine Street to grab a few tropical drinks and Caribbean/Latin fare. The","useful":0,"cool":0},"ZAezdYECKdO4TmmU-3zRNw":{"text":"Amazing tacos, nachos,  atmosphere! Everything you could ask for, and a great location.  T","useful":0,"cool":0},"FNeIsmES0UILD5scExU1Rw":{"text":"Nice location, good service. Food was good, but nothing to go out of your way for. I was v","useful":0,"cool":0},"pVHgPwce4Xy-Ae3BCCayoQ":{"text":"Maannn.. The tacos at this place were so good, make you wanna smack somebody.\n\nI can't eve","useful":0,"cool":0},"y-p7PJuVZvBFZH336PzH0Q":{"text":"Had the Seared Scallops: Scotch Bonnet Onion Marmalade and fried Leeks and Jamaican Pattie","useful":1,"cool":1},"196Ii9kRsoHuY8UC-KqaJw":{"text":"First time at The Rum House this weekend.  In town for the weekend with our kids. Finding ","useful":0,"cool":0},"pIIqGobo5ycsDDhkZTHXeQ":{"text":"Pawpaw sauce was awesome! They have a huge selection and you can get 2-4 different tacos w","useful":1,"cool":0},"YEXSqvZef0QPi-z7f4SJzA":{"text":"This is a great restaurant, enjoy the atmosphere here. Great service and food. My wife and","useful":0,"cool":1},"nIXf7KLQsrAsYPIMLubJ-A":{"text":"My wife and I were looking super forward to checking this place out for months as we were ","useful":1,"cool":0},"OiVbs7WPfo4fshQlWMUwMA":{"text":"We going UP...on a TUESDAY. THEM TACOS GOT ME SO STUFFED IT'S A DOOZY!\n\nGo here on a Tuesd","useful":2,"cool":1},"FHJU2NtUwiAo5aHc-GTH2Q":{"text":"I've lived here for over a year and I am only now getting a chance to go to Rum House. It'","useful":0,"cool":0},"7jeMqiXt9nsmhkxzj1bjJA":{"text":"The Rum House was absolutely awesome! The food was like and exposition of flavor in your m","useful":0,"cool":1},"yq_m8cyX2TXTIUrxzeuZ5w":{"text":"You guys have the best tacos in New Orleans. Hands down.  I don't care how crowded you get","useful":0,"cool":0},"dOXfzhHwhGZAfq22RpKCRQ":{"text":"Rum House is located in one of my favorite sections in New Orleans - Magazine Street surro","useful":2,"cool":0},"Nqamcp0rN0DNo0FfbfiqTA":{"text":"Very happy with the quality of food and the attitude of the staff!  Had a great experience","useful":0,"cool":0},"KKCb-0SI2YRBVqMgzSLPgg":{"text":"A must-visit in New Orleans! have a pain killer for me, some guacamole, try an assortment ","useful":0,"cool":0},"xVva87duWAZf5lAwXnXpcA":{"text":"So I went to this establishment and a Roach fell on my neck from the ceiling. The food is ","useful":0,"cool":0},"YTnGOA4f0iAeBSRw2ZfJ5A":{"text":"The Rum House is amazing!  Fantastic fusion of Caribbean and Mexican food. Tried this plac","useful":0,"cool":0},"diZN9VIbsolYxKlQhVb78A":{"text":"I'd land somewhere between a three and a four on this one. After several attempts since St","useful":5,"cool":2},"ezr6FCtd7TF9aQrlDEJo6w":{"text":"Great food and excellent service. The cocktails were strong and the tacos were delicious (","useful":0,"cool":0},"GRHweVZzLTS8H7sBt0F4tg":{"text":"Our über driver, who is a local recommended this place and we're so glad we stopped by. I ","useful":0,"cool":0},"g40wEAMIn6j8WxgdMVIprQ":{"text":"Not only great for cocktails but the assortment of food is also great, they have rotis, ta","useful":0,"cool":0},"UUKsEIJtXu8wuXMBbUFbtA":{"text":"Really good stuff. The bartender was great even though the place was packed. She's one of ","useful":0,"cool":0},"Z-ro3YR50YU6Ful8msfMjg":{"text":"You want to get away from the French Quarters and have some great food and drinks,  this i","useful":1,"cool":0},"sZTKT_YctKbKs6pJpLxW4Q":{"text":"Best taco tuesday of all time. $2 per taco, even if you ordered one of each itd only be $3","useful":1,"cool":1},"27Y17ZAdhZNyKXKG9AA69A":{"text":"Tuesdays 2 dollar Tacos are the bomb.com!!!!!!!! Listen every time I come here i have no c","useful":1,"cool":0},"LoEEItfHaQZcDdb4sWp8lQ":{"text":"This place rocks! Fun atmosphere and mike the bartender gives great service! We ordered th","useful":2,"cool":1},"4ZFB4vUVwgFPpJb7Gzwx8g":{"text":"For being a Caribbean restaurant that had tacos, they were delicious!!! I was seriously im","useful":1,"cool":0},"kERtXSsegln4PaTyzqiTVw":{"text":"The jerk fish is wonderful.  The greens, cornbread dressing, and calypso  beef are good.","useful":0,"cool":0},"wA6jvlJe5X3IQ5iYKuWRgw":{"text":"One of the fun tour guides on the Hop On Hop Off City Sightseeing Tours recommended this p","useful":0,"cool":0},"0yFJkx8gAkClSTYmpSWmYg":{"text":"I go to the Rum House all of the time, would have put 5 stars back when I used to drive ac","useful":0,"cool":0},"IDQ_gjf0Wwybn5V-GZ7i3w":{"text":"taco tuesday! really great food for what feels like more of a chain type place. DEFINITELY","useful":0,"cool":0},"57LFFhHOVph4kHT_7dMm0g":{"text":"Great tacos and drinks! As others have said $2 Taco Tuesdays is a great deal. I usually ge","useful":0,"cool":0},"wKDGYd0ujGgT22QVyAxYAg":{"text":"I love that you can get a tasty, filling and relatively healthy meal here. That alone is w","useful":1,"cool":0},"glcwhtZT40IdSoGLWfpRHg":{"text":"I've been here numerous times and have never been disappointed. Great food, great drinks a","useful":0,"cool":1},"k_zAHSKVpAIxLrERYdasZg":{"text":"When you are here its island time! and who doesn't have time to be on an island? I like to","useful":1,"cool":1},"kBbLUd8tn4bDOgsje75uDQ":{"text":"Mango margarita!! Delish!!  This was the first stop before bar hopping with friends from F","useful":0,"cool":0},"gaa5rGFoorcCNJ1vBlvovQ":{"text":"Got the jerk chicken quesadilla.  Was good but had a touch too many beans in it.  Menu loo","useful":0,"cool":0},"AJL6a1vEKAlmw1ApnmNgGw":{"text":"The Rum House Salad is the BEST salad I ever had in my entire life! We did end up waiting ","useful":0,"cool":0},"33tW72N7lv_QNCO5AeHfCA":{"text":"I know I'm in the minority with this opinion, but I felt compelled to write this review.  ","useful":0,"cool":0},"7KuttGgdz7UsRe9b4Q0U4Q":{"text":"The Spot: \nA walking tour through New Orleans lovely Garden District will naturally requir","useful":1,"cool":0},"3PFzPERLckm1UOeuNoPNyQ":{"text":"Definitely worth the wait, especially on nights when the Saints are playing and you can ju","useful":2,"cool":0},"o3IDs-n5AZRcniHTKvdl3w":{"text":"This is absolutely one of my favorite places to eat. Happy hour has great drink specials a","useful":0,"cool":1},"Rs7_D_vhD7dQ5oeh3IwKhg":{"text":"The food is great and they have a huge selection of things to choose from. The service is ","useful":1,"cool":0},"Xw0vrNgI2Z5uMBokv8p8yQ":{"text":"Yummmmmmm.  My favorite restaurant to date.  Who doesn't love drinking out of huge mason j","useful":0,"cool":0},"vTK47Gx7Bo99fk3lUckwjw":{"text":"Decent food, but nothing special. Their salads and sandwiches are probably the best items ","useful":0,"cool":0},"en8-MCS2BZYJCj9Wu9ouyg":{"text":"Tacos were good. The slow roasted pork was my favorite. Polenta was all right. Chips and s","useful":0,"cool":0},"TD-Bf__errnrN0zlSgZjaw":{"text":"I really love this place even though it isn't your typical New Orleans food. Actually that","useful":0,"cool":0},"xdcbeghLt_Dbs1ciLjIvBA":{"text":"The fried shrimp tacos were amazing. The drinks were sooo good, we ended up getting anothe","useful":0,"cool":0},"ylPRt62LPxd4xnVy1CTyiQ":{"text":"One of my favorite finds in NOLA. We didn't plan on eating here but it was well past lunch","useful":1,"cool":0},"2CM-daK_gpUn_RAkizSiTA":{"text":"Super good!!! Their taco specials are great. Love the oyster taco and black bean/chorizo s","useful":1,"cool":0},"-gfjvY46vW212wc16kee0g":{"text":"This was one of the worst food experiences I've had in quite some time.  My son lives near","useful":0,"cool":0},"XA-69HUrNxdJbdv66eDLZQ":{"text":"Must try the island style Cuban steak! It was delicious! Would def go again. Try their moj","useful":0,"cool":1},"5lwLoyUJgvFvUuypaRMdGQ":{"text":"I went to Rum House last night with friends from work, we had beer and tacos.  The tacos w","useful":0,"cool":0},"aGIIk5T2vxiMXbERUtDIOg":{"text":"Just moved to the Irish channel and had heard great things about the rum house so my gf an","useful":1,"cool":0},"EC0tP-4rKtvQhUe2ZN9glQ":{"text":"Amazing tacos!!!!! Happy drinks were great too. Prices so much better than eating in the f","useful":0,"cool":0},"dnsI3JHowNUa3D3oGrtyrw":{"text":"***Let me preference this review by stating I am of Caribbean descent and have had the opp","useful":2,"cool":0},"gl9C9fM7Sc4jKt2lOMCkug":{"text":"Great service and amazing food! I tried the red curry lamb, chili glazed shrimp and h.c Mi","useful":0,"cool":0},"4wQDGesxLsUIEEKoL4o_zQ":{"text":"Great service and great food. We stopped in and were seated immediately even though it was","useful":0,"cool":0},"-56IvL8I6CLJhUkF_aPtZw":{"text":"$3 mojitos during happy hour?  check. \n\nI ordered the seafood pepperpot and it was pretty ","useful":4,"cool":2},"9-A90QJH9MvLVDiR1BXMwA":{"text":"I only get the nachos but they are definitely worth going back for. The drinks are amazing","useful":0,"cool":0},"Z-mw7pBamR3TpHmHqtckoA":{"text":"Best part of this place is the vibe. Great way to spend time with friends and have some de","useful":0,"cool":0},"5EI_3CO3uN_A-ZKBR6TdxQ":{"text":"Made it about 1.5 hours before closing, no wait to sit inside but all outside tables full ","useful":1,"cool":0},"oPBeikS_x6fEwbIql5dPVg":{"text":"Came across this place randomly, great spot. If your a serious rum fan they definitely hav","useful":0,"cool":0},"ysFj3HhY2hJ6XDwAlRjCkA":{"text":"Gluten-free win! I stopped in this week with a friend for lunch. She lives in NO and I was","useful":2,"cool":0},"sDnFshtUYLNkRL6M4jqV4w":{"text":"I just left here a few hours ago. It's Taco Tuesday where all the tacos are $2! They aren'","useful":1,"cool":0},"7rnxqAtquHbNI-bs5eZOJg":{"text":"Great location, good food and drinks specials and lots of Nola character with a street sid","useful":2,"cool":0},"2eTKIqkQNxlQZ6PsQxkmfg":{"text":"Painkillers are legit. Not fresh nutmeg but very close just needed a little extra. Right a","useful":2,"cool":2},"gn9chc4uJsq_huhW-Rlc3Q":{"text":"I went to the Rum House for the first time after hearing mad reviews about it. First thing","useful":1,"cool":1},"ng0ve-G4n5QcMa2Or9HqCg":{"text":"Super delicious food! I loved it so much & service was great! I am totally coming back her","useful":1,"cool":1},"8Nj586lXKiGNQnxpO4mPvw":{"text":"Taco Tuesday was awesome! Two dollar tacos, we tried almost all of them! The grilled shrim","useful":0,"cool":0},"tfqWz91KDbxxXZmam5UmMw":{"text":"Good food. Can't wait until the weather is nice again so that we can sit outside.","useful":0,"cool":0},"jSnMoUMyKk6-sZMcUSV-MA":{"text":"It's a good place if you like rum. Very few other cocktail choices except beer. Well, it i","useful":0,"cool":0},"O6x-vvXLGWU1uha93aARXA":{"text":"Delicious food and great service! The plantains I got as a side were some of the best I've","useful":0,"cool":0},"UUAJQqPZj9rb8gomizSiXQ":{"text":"Oh yea this is worth the bad service! But really the food is tasty, the servers on the oth","useful":0,"cool":0},"DJGIGrfNdlYzaDAIH4TRDw":{"text":"I have been to the rum house only one other time, and wasn't really impressed. However, to","useful":1,"cool":0},"3ImykcR4libqunJJO4iElg":{"text":"We just ate at Rum House, after months of urging by our Tulane student granddaughter.\n\nNic","useful":3,"cool":1},"HZb9-_nNvEf8_4ks2GuJBg":{"text":"Best food I had in NOLA! Two days after our first dinner there my boyfriend went back beca","useful":0,"cool":0},"j9xcoCw7rwMMy8mhYzMkRA":{"text":"Service was okay. Not rude, just not very friendly.\n\nAtmosphere kinda sucks. Really too lo","useful":0,"cool":0},"w45J5ztNRVXSrvwoioZoFA":{"text":"An hour long wait on Tuesday. I was in town for work. I found this little place and our gr","useful":0,"cool":0},"cHubQZpCbmlGm-1Q7tnQqg":{"text":"The food is different,  exotic, and sooooo good! The coconut mango rice is delicious!","useful":0,"cool":0},"1N346pkHAlLBd_Z6kXxOsA":{"text":"My friends and I went here to watch the Saints game. We got the nachos, which were everyth","useful":0,"cool":0},"zx3x2bi1OeiAxgBFOaLTuA":{"text":"I always enjoy my food immensely, but my visits are always slightly \"off\". Just treated hu","useful":0,"cool":0},"PzlHoYaBbLSrxuekTBgMDw":{"text":"An amazing place to grab a good bite to eat, at the end of the day. Staff is always friend","useful":0,"cool":0},"zpg4GNBilNbh2nw0qa8vRA":{"text":"Nachos!!! Taco Tuesday but expect the masses!!!\n\nDrinks are amazing!!! The girls love to m","useful":0,"cool":0},"5g2QhsjmPthfe8RZN8nMsw":{"text":"This place always seems to be buzzing with customers. It's got a great atmosphere,  and th","useful":1,"cool":0},"ta4fSvLjvXCrmT0DQYQLPw":{"text":"Great service from the hostess and waitress. The painkiller was good. The tacos were good ","useful":0,"cool":0},"13JzpCAfrBAl_sP0CwVhcQ":{"text":"Mmmmm........so yummy! I love this place so much, I came here twice in my three day getawa","useful":1,"cool":1},"CAgKy5K9akkcS5BlKF3FIQ":{"text":"Taco Tuesdays. Need I say more?  It's usually pretty busy, but if you can get there before","useful":2,"cool":1},"i_xfi6LEleJ2MuOtBj8vEA":{"text":"False. \nDon't believe the hype. \nI've spent the last 23 years being from the Caribbean so ","useful":4,"cool":2},"x6Vjst3_CFDYtzjE5R15ZA":{"text":"WARNING: FOOD POISONING!!!! I ate there last Friday at lunch and had the 3 taco special: s","useful":1,"cool":0},"k_WPwHzIF3eWj76QWmV3yg":{"text":"Went for Taco Tuesday.  This place gets packed! We had to wait an hour for a table which w","useful":0,"cool":0},"_6ey88iZ0MD0Gc9vF7MydA":{"text":"2 things stand out - their mojitos are insanely delicious, and their food is insanely good","useful":1,"cool":0},"mT0HCMgLDWUsNsA9C4khMA":{"text":"Awesome tacos and unique tasty sides!   ALL of the sides were so good:  sweet potato chips","useful":0,"cool":0},"qnT-z9sOajKzjDeqigDwWQ":{"text":"Swanky little spot to catch a bite of tacos Caribbean style.. Not very expensive and be mi","useful":2,"cool":0},"S8Cr50N0qjv7irbL-bQ2TA":{"text":"Really good tacos. Just my kind of place. Small servings of flavorful, exciting unique foo","useful":0,"cool":0},"ND18FGUdmbr25kdpB43ZhQ":{"text":"Mostly a local hangout, but a solid / not very expensive spot for visitors. The on/off tou","useful":0,"cool":0},"EwQnhJb6tDyjdEM9WOQYGw":{"text":"The Tacos here are delicious... I recommend the Calypso Beef an the Crispy Fish!!!\nLike my","useful":0,"cool":0},"dUp6if9slGEB85izI5rIeQ":{"text":"I've been here a few times now and while the food is fantastic, I'm not sure if the wait a","useful":0,"cool":0},"yXPhIw9tN1thS5Q86LhKhg":{"text":"Hands down the best nachos I've ever had in my life! Varied menu and helpful staff. Can be","useful":2,"cool":1},"Ege6r7e3kp2ShzUo8gW4xw":{"text":"This place has such a mellow atmosphere! Friendly staff and delicious drinks. I'd love to ","useful":1,"cool":0},"Q7OTkcOtqeDyCLs__20ncw":{"text":"Great tacos and drink specials. I went the other night and they added some new items to th","useful":0,"cool":0},"Gdi7Q2IEywHZOWb7e5NxdA":{"text":"we were looking for authentic caribbean but somehow our goal was tossed aside when we disc","useful":2,"cool":0},"xIemV_jmbCJEV5gKR4xoXw":{"text":"The tacos where amazing but my favorite thing to eat was the guacamole with the mango sals","useful":0,"cool":0},"bdAzktVk2ls4LejJIyZosw":{"text":"When I tell you my food was awesome it was lick your fingers and your plate awesome! It wa","useful":1,"cool":0},"t43EX42CYbfYGOQXMlauRA":{"text":"This is my first time here and this place looks cool!  Its very vibrant with heritage and ","useful":2,"cool":1},"yF71gt4YK4N4Ph4SifD0Jg":{"text":"I am not a picky eater when it comes to tacos.  If the tortilla is fresh, the ingredients ","useful":1,"cool":0},"8gMHNWfmAvOSHet5ikbnAA":{"text":"When I'm on vacation I rarely eat at the same place twice. Not only did I do that here, I ","useful":2,"cool":0},"GJjlj8DbDre3NGP7hIeD5Q":{"text":"Great atmosphere with a great menu.  I went with the tacos, and the only criticism is that","useful":0,"cool":0},"oIJyrchHIoWrM82HPEww7g":{"text":"I love the Rum House. Been here several times and have never been disappointed.  Over the ","useful":0,"cool":0},"D9JIDumjlc4QJkys2soUVg":{"text":"Honestly do not understand the fuss. The food is mediocre. The service is good but not out","useful":1,"cool":0},"B-D3R0FBd-zhAAAIPhgmOQ":{"text":"This place is awesome, one of my favorite restaurants that is always a hit.  Get the Taco ","useful":1,"cool":0},"76v1ryVIKsa8FlVBVN7mSA":{"text":"Rum house has been and always will be having a special place in my heart. How are you goin","useful":14,"cool":9},"x0UXgVezQLuh-JLgeDpv-A":{"text":"Awesome drinks, I recommend the Painkiller, awesome food and great service.  The Jerk fish","useful":0,"cool":1},"bQimO8FokRXlB0eWJsLt2A":{"text":"Best tacos in town!!!!  I go twice a month, I also love the beer and rum selection.  The N","useful":0,"cool":0},"mZmaxaYqH-Z56VrMQ_nAJg":{"text":"I really wanted to like the rum house. Really. I love rum. I love Mexican food. It is a bl","useful":2,"cool":0},"qhtXKHGIi5Kdprcpr_nKFA":{"text":"Rum House is a fun place to be. It gets really busy at certain times, like lunch on the we","useful":1,"cool":0},"40iwReNy1yZkzFI3aks8cQ":{"text":"This is my first review to get the 1000! Review on rum house!!!! Came in late towards clos","useful":0,"cool":0},"blyffUgHAdbgeOse79vLbQ":{"text":"Tacos are so good that I almost don't want to give them a good review, because that'll jus","useful":0,"cool":0},"EUHjJTeA76eEIl8HftPNxw":{"text":"We happened to be on Magazine to visit The Bulldog for a drink but since it wasn't open fo","useful":0,"cool":0},"2d9c-zdcn6Pjm7NJ7fmH7A":{"text":"Casual, friendly, fun and great food! Fed two men generously with one margarita and one te","useful":0,"cool":0},"8g71XO1cnY0dQePtLUr5Fw":{"text":"The food was good and the staff was friendly. We stumbled upon this after a day at the zoo","useful":0,"cool":0},"Hk179sVYbjubosF0Ytru_w":{"text":"Probably could be 4.5 stars.\n\nReally enjoyed the food here. We stopped in on impulse witho","useful":0,"cool":0},"xjMZu4NGtf4iJ5aW6DvLhg":{"text":"A must try for folks new (and old) to the area. Rum house has a delicious selection of fru","useful":0,"cool":0},"PuEoLe561WKppo_YpEkM2w":{"text":"Drinks were awesome, avacado mango dip was delicious. The jerk chicken and steak tacos wer","useful":0,"cool":0},"YyShJ7xiZXHgxSxWm8mhAQ":{"text":"We were there last week while visiting New Orleans and happened to just walk by this place","useful":0,"cool":0},"c1MFuMr7VkDHwUgNjxm6Lw":{"text":"Rum house is a definite must for lunch! My boyfriend and I went on a Saturday (when it was","useful":0,"cool":0},"CX5855xjbS8NmGn7S9FZtg":{"text":"Very, very tasty stuff. The chips and queso are delicious, the avocado mango dip is basica","useful":0,"cool":0},"aKfyY8g96YcFc9pVnVTLvA":{"text":"Wow. Great Drink. House rum punch. Great lunch with great bartender. Yelp is great when yo","useful":0,"cool":0},"0OCAFrlJiXcK-M-k7Bu4kA":{"text":"One of my favorite spots in New Orleans. It seems like they're always crowded, but the foo","useful":0,"cool":0},"7B3tJdlTGSr6_2LCfxgSNw":{"text":"Delicious nachos y tacos with a Caribbean flare! Sooooo good.","useful":0,"cool":0},"VMHIlGylp6Zpdd7Ug-Itww":{"text":"Best food so far on our first trip to NOLA. Curried mussels were great, mango avocado dip ","useful":0,"cool":0},"1_Tv7wjOs8b1Ie7xW9OZ2Q":{"text":"I read the Yelp reviews so that I could decide what to order. My sisters frequent the plac","useful":1,"cool":0},"PZj4Vv_Y7oyeBHlgG0bnxA":{"text":"The service is always good but the food...hit or miss. Bartenders are quick. Always a plus","useful":0,"cool":0},"9Vp6J6DR7pmx2o5Oe8THJg":{"text":"I don't get the hype surrounding this place. I live a couple blocks away and see that it i","useful":0,"cool":0},"nN-S1IqT1vBkxcGnadqKdw":{"text":"I love The Rum House!  It's the first place where I ate when I came here in November.\n\nI'm","useful":1,"cool":1},"s3sUpJmPPEgepz6SdR69Ew":{"text":"Great prices, great selection, great drinks, great service. Overall 5 out of 5 stars. \n\nI ","useful":3,"cool":1},"rDx5f48MoEyHxk3ewKpAfQ":{"text":"Best damn taco I had in a long time.  Server Krysta was extremely friendly.  Krysta made t","useful":2,"cool":0},"VoAJn9LNhW81G6u0FHyO3A":{"text":"We came here for the first time on a Friday afternoon and lucky enough got a table right a","useful":1,"cool":0},"aI5sTPkhbucf4eNa0MDKpQ":{"text":"I was just here on Tuesday and I am so glad that I decided to try it out. The tacos were v","useful":3,"cool":1},"LKBd9OH1vuymNLCp0bEYCg":{"text":"I was given the recommendation to come here by a local friend. Recommendations are the way","useful":1,"cool":1},"Sd9_2N31lq5-G0Y6o0z41w":{"text":"Atmosphere is whatever. Would be a good place to go to watch a game, and have some drinks,","useful":1,"cool":0},"sqQAxmkfr2Btz6pWlqFKOQ":{"text":"Oh my gosh!!!  This place is awesome!  Drinks, food, service, and overall atmosphere provi","useful":0,"cool":0},"JBxsoD5FGFQ2orAqcPebYg":{"text":"I'm updating my review from 2010. \n\nI've dined here three times in the last year and have ","useful":1,"cool":1},"UAJbgysui3v61_GR-umCFQ":{"text":"The location, the cocktails, the tacos, this place is awesome for lunch and dinner alike. ","useful":0,"cool":0},"xdHBYt4wKRCiXxnCAW9n6g":{"text":"Where should I start? I love EVERYTHING about this place, from the cocktails to the entree","useful":0,"cool":0},"ncMZBwnLdpvLOShcmfh2EQ":{"text":"Food and drinks were very good. Everything tasted fresh. Our only complaint was the lack o","useful":1,"cool":1},"436_JxFQ-sBm8Xuo-g52FQ":{"text":"Magazine Street in New Orleans is a fun place. They're either trying to get you to buy som","useful":1,"cool":0},"XQNWBSPKxNerCntUXXd31w":{"text":"I did really like the food but had an issue when leaving\n\nIt was around 11p during jazzfes","useful":0,"cool":0},"8vfoNoh3QSXYhGIE1dLOkQ":{"text":"First time here. I am a N.O. native but live in another state. Typically, come home for tr","useful":0,"cool":0},"OfA_uFc2oJODuTLL3IgqMg":{"text":"Definitely bypass everything else on the menu and go straight for the tacos!","useful":0,"cool":0},"j_SmSw7EGldpKyVT4suq4g":{"text":"Great vibe.. We went during happy hours so the place was alive and kicking .. Had The Lamb","useful":0,"cool":0},"FxvDLRrpnqJ_1-yASR5uLw":{"text":"I wish I could have lunch everyday.  Food is outstanding and the selection is vast. Defini","useful":0,"cool":0},"eyKUnjRu8N2aCFaTT0AW3g":{"text":"I must be on a Mexican kick today because I just reviewed the place down the street.  The ","useful":7,"cool":4},"YiANKpnNTCHB20TFREap3w":{"text":"Order the ceviche. The tuna along with mango and cilantro were to die for. I could eat it ","useful":0,"cool":0},"c_WC4FpV8fBNZrSmH3Obmw":{"text":"The Damn Good Nachos were better than Damn Good!! I love the outside seating option and th","useful":1,"cool":0},"uuXRjL17d1DBz52NXOdjUw":{"text":"Not sure how I feel about this place. We got the tacos, but they we just ok. I'm sure the ","useful":0,"cool":0},"O9THddmMv7_DNY81XU8kNA":{"text":"I was there with a party of 5, our server was very kind and knowledgeable. We ordered 3 pi","useful":0,"cool":0},"9btrVoWoi8nliArG4JmUNg":{"text":"So we had a large party of 14 and although they don't take reservations I called ahead and","useful":0,"cool":0},"HggXuY8hsA8QXiLqFb8U8Q":{"text":"Nachos nachos nachos. They are the perfect nachos and my boyfriend and I split them as a m","useful":1,"cool":0},"S9zPlrKJHAgsufF1wuBn6g":{"text":"Stumbled upon this gem by accident and boy were we glad! The food and drinks were so good ","useful":0,"cool":0},"v8tFh-WPKUx_YkhNPQR35A":{"text":"Been there twice now on visits to New Orleans will be there every chance and if you can ma","useful":0,"cool":0},"wCD5BdQp8mCIl3uy3Mn8jg":{"text":"This is a place for sugar addicts!  If sugar wasn't legal it would be illegal and the only","useful":3,"cool":1},"MVMNuFm6jF3vE3kipjs3_Q":{"text":"The food is okay not true carribbean, its a watered down version. The cocktails though are","useful":0,"cool":0},"wrjmOLZE9HNagYCGprzinQ":{"text":"The Rum House is a great place to grab some tacos and pitchers of rum drinks. I went mid-w","useful":0,"cool":0},"eRc-ujSIvM-8fTuZhgwjOQ":{"text":"Good tacos and Margaritas. Very electric when there's a crowd which there usually is. Grea","useful":1,"cool":1},"XDi8GgEZkrX4WNnlwg01kA":{"text":"We just ordered chips and fire roasted salsa, and Funkey Monkey Drink. It is good and defi","useful":0,"cool":0},"xQ260MkFwYxY1fH6cJEiTA":{"text":"There's often a terrible wait for a table here, but don't lose heart. Ease your way up to ","useful":0,"cool":0},"FpjORJ02n_Ae7A51uMb_fA":{"text":"The rum house is in the wild, cool extravagance of a Louisiana charm and it's boldly prese","useful":0,"cool":0},"_HwaRyF4UmImiVxhYlM6tA":{"text":"Enjoy going to this place.  The outdoor seating is our favorite-  the menu is not for pick","useful":0,"cool":0},"jRel9UY-kLZSartyDZug6g":{"text":"I had several types of tacos here and they seriously changed my life. So stinking deliciou","useful":0,"cool":0},"Z0-WBjmNNnZKNv7OMmbbtQ":{"text":"While shopping one day along Magazine, we noticed the Rum House which had a decent crowd w","useful":2,"cool":1},"Z_NwTDk7P8yHSiWakgI1PQ":{"text":"Recommended!\nWide selection of Caribbean-inspired selections.  Pied inCaribbean music.  Fo","useful":0,"cool":0},"LBA1umpVhQGGYbH7NITvqw":{"text":"This place is quickly becoming one of my favorite places to eat when I want \"mexican\" food","useful":0,"cool":0},"mpXr5KJ-dlCKwOrX2hyC7g":{"text":"Stumbled on \"The Rum House\" on my first full night in the city. We had an excellent dinner","useful":0,"cool":0},"5wTX8jLWLMuZHHgQZnZgOg":{"text":"Delicious food and dranks! The margaritas are muy delicioso. Their tacos are fantastic--th","useful":1,"cool":0},"lokndOThuU5BGQ22pSPlOQ":{"text":"Best salad I have had in months, ( jerk chopped chicken)  had lunch with 3 people, we were","useful":0,"cool":0},"grFK9jpgwGxhU8KYlcv08w":{"text":"Having lived in the Caribbean for 5 years, I was hesitant about trying this place. But one","useful":0,"cool":0},"eTb5FWfNgyqAjSUfPQTpKg":{"text":"The pulled pork nachos are rockin. They use shreaded Pork rib meat. This is called an app.","useful":2,"cool":1},"H--gj3vDg8m3WjQ-Vt8yxg":{"text":"Apparently they opened in 2009, now focusing on what they do best. From our Dec. visit I'd","useful":1,"cool":0},"YcXlll_NtDPh_kqNwcaogg":{"text":"What a delightful place to eat and get away from the typical cajun/creole food in the city","useful":1,"cool":0},"802s_vAuJwxnH3A5SHNGlg":{"text":"$2 TACOS, $2 BEERS EVERY TUESDAY!  \n\nSo my old study cafe, Puccino's has transformed into ","useful":1,"cool":1},"9EsJp5qIrzR9ntuJTEXkog":{"text":"Tacos were sooo good! We tried 6 different ones and they were all amazing! Would def go ba","useful":1,"cool":0},"Yn_1J4gwtm2MzQIU7yHJ8w":{"text":"Visiting from Oakland CA and some friends who live in New Orleans brought us. OMG we hurt ","useful":0,"cool":0},"guv4E3srdAAt0lYf5A8bOg":{"text":"Nice spot on the corner with great drinks, we had an early dinner ordered the grilled tuna","useful":0,"cool":0},"PwxCK0-2zFnSSP1e8t9seQ":{"text":"Delicious!  Very casual and laid back, which was nice.  Ordered the Key Lime Coconut Rum P","useful":0,"cool":0},"V3918OdRK6jK-DCOHVbRtQ":{"text":"Island time with queso and chips is the beat all around. I love there Rum Punch its my fav","useful":1,"cool":1},"AVn_XBQaHpg-f_t0T0VliA":{"text":"One of the place to go when in New Orleans atmosphere great, wait for long BECAUSE the dem","useful":0,"cool":0},"SMUKFhlnjnOLGWVQ7_TfQQ":{"text":"I find myself craving the food at Rum House a lot and I've made multiple trips to stave th","useful":1,"cool":1},"uEu0LVt8xdrxmaspK0yijw":{"text":"Dem tacos tho.\n\nI fiend for Rum House tacos at least twice a week since i've been going th","useful":1,"cool":1},"VQxzP-dR_o1qaVMCBCVSNQ":{"text":"Walked in on this place by accident.  Was on our way to another place to eat. First up was","useful":0,"cool":0},"ZcJQJhmYG6N4m-jSLwIEfQ":{"text":"I spent 4 days eating and drinking my way through New Orleans.  From dive joints to $100 a","useful":1,"cool":0},"2fVxyYmmOIO9oB6AtcSR3A":{"text":"Pleasantly surprised about the quality of the food. Get the tacos, the oyster taco and sca","useful":0,"cool":0},"VZD2kzFO2MQHyo_bX-uqxw":{"text":"This place is awesome, but come expecting a wait. \n\nThe drinks started our experience off ","useful":0,"cool":0},"bueXiJxxqGK4uhqudxTrXA":{"text":"They have some of the best foods I have tasted! I last ordered the grilled mahi mahi sandw","useful":0,"cool":0},"vqwsELiLxTWH3fi_7C1DIg":{"text":"best place for tacos in nola. and those nachos!!","useful":1,"cool":0},"riloWcTW1bSKEs-L8BzgnA":{"text":"LOVED this place. Fun, festive atmosphere, both inside and out. Sit on the outside to enjo","useful":1,"cool":0},"9QkPrcy9id7xifGnAL0qLQ":{"text":"I absolutely love The Rum House. I had great service and great food. The avocado mango dip","useful":1,"cool":0},"zIqGYg2UlG5e4oTpCg8mwA":{"text":"I returned back to Rum House to try a few different dishes. I went with the tacos, which I","useful":2,"cool":0},"ZvIVbUjkKSuIZFvDBYxVLA":{"text":"Taco is super awesome! Changed my perspective of taco. Definitely recommended! Service was","useful":0,"cool":0},"9TEW5BUIsjLj6IcoU4pD1g":{"text":"Joined some old friends for happy hour and sat outside (happy hour til 6:30) \n\nWe started ","useful":1,"cool":1},"PELaLaoSaQIw55ui-mia7w":{"text":"Love this place.. Great Food. Great Drinks. Period. Be wary of flies when you eat outside-","useful":0,"cool":0},"dyONMfSexZW1vXSVpvz_3Q":{"text":"Lamb vindaloo tacos are bomb! Friendly service, fun atmosphere, and great \"Island Time\" ha","useful":0,"cool":0},"_3-9VQuothTU96llxHycug":{"text":"Great location, service, and food. We loved everything about this place. Server, Joe, was ","useful":0,"cool":0},"obcUK7QNeNWTIU8_JZ2oow":{"text":"BEST QUESO DIP EVER!!! I love this place! Definitely one of the best restaurants I've been","useful":0,"cool":0},"AD5La89JA03NnRgJVRFZhA":{"text":"Our favorite meal while we were in New Orleans was at the Rum House! Delicious tacos! Deli","useful":0,"cool":0},"aVpEN_HWOT9JRHmymvfEJQ":{"text":"Great spot for our Saturday night out with the baby. Great drinks and great entrees. Gotta","useful":0,"cool":0},"X2alzrGCk6_Xdw8lBQiRcA":{"text":"Some of the best food by far! I've eaten dinner there every night I was in New Orleans and","useful":0,"cool":0},"ys3FQ1X8frt25ovQbvSuPg":{"text":"We've been here several times to eat as it is around the corner from our house.  I was a l","useful":5,"cool":4},"H5P3GWKOImzILXfK4BzNVA":{"text":"I have given this place quite a few chances since I live so close, and the menu is afforda","useful":0,"cool":0},"2L83P_JVXhyq92N_AxQKWA":{"text":"My wife and I got the name of this restaurant off a top 10 list for places to eat in New O","useful":0,"cool":0},"V5Ao98iskAgEfkE1QhO8rw":{"text":"I dined here last week with a large group (about 14 of us) and must say that both the meal","useful":0,"cool":0},"zMxAjG4qoEd1UPvkJPWu1w":{"text":"Get the seafood pepper pot. It's amazing!! I also love the tacos here.\n\n Great place to go","useful":0,"cool":0},"EN96wgbwj6Tc7if2qpxxRw":{"text":"I have to admit, I get Rum House and Salu confused.  Although their similar, I do like goi","useful":1,"cool":0},"15wIGj2rkFoNH38CWtJGCg":{"text":"Not tasty at all.  Jerk chicken was bland.  Taco flavors were weird.  Mac and cheese is ve","useful":1,"cool":0},"Nr58ADVTeBvaM_TiPglDEA":{"text":"Tasty , fresh food, with plenty of seats, which is a great combination in this part of New","useful":0,"cool":0},"ZTyrXve3zo49YJmxU1gzyQ":{"text":"Maybe you're jerkin my leg because on no planet should the jerk chicken here be so named. ","useful":4,"cool":0},"oBEx5iPRp7CySIrgoj7B8w":{"text":"Fun place. The tacos were yummy and the portions were big. It really felt like being in a ","useful":0,"cool":0},"37_0onO0ePszXwmN3qzGfw":{"text":"After waiting 45+ minutes for a table we were greeted by a very nice waitress who was more","useful":0,"cool":0},"mWN8R9qP_FN_uaiWUWMzrg":{"text":"You have to try the Cuban Sandwich!!  Their frozen Ritas are to die for!!\nWill definitely ","useful":1,"cool":0},"6G2-7zvK4Hdagsdf0yD5ZA":{"text":"BLUF:  This is an updated review.  Really good food and great service.  Fried plantains an","useful":2,"cool":0},"EpCMmGFTwy9nXNdy0P-2ZQ":{"text":"Good food. 20 min wait even at 3pm. Very loud! Took two taco special with macaroni and che","useful":0,"cool":0},"suwBNpqelnh0Iks4JoqWxQ":{"text":"Great food, great service! I always stop here when visiting New Orleans. I would recommend","useful":0,"cool":0},"MavjtgJeLCCm6IB8g7acAA":{"text":"I have never written a yelp review but I had to create one for this place . We Stumbled in","useful":1,"cool":0},"G5m-m42Izu6TuusUps_R4g":{"text":"We were sitting at the bar and the service was exceptional! We ordered the seafood pepper ","useful":0,"cool":0},"Du7uigRVJvpsrLJL_64l5w":{"text":"This place was a consequence to not having the proper attire for the Commander's Palace.  ","useful":0,"cool":0},"YUSVAjcF4m3iPNr6sGIvUw":{"text":"The nachos are out of control amazing. I suggest getting extra queso with the order too fo","useful":0,"cool":0},"QCKhZmBgufTWAIhved2_aA":{"text":"Not only was it a good sign that the restaurant was packed, but I was excited when I saw t","useful":1,"cool":0},"RnqfolvP88BuJitOmFqeEg":{"text":"If you happen to be in the neighborhood for the garden district mansion tour or just wanti","useful":0,"cool":1},"ckJbkx5vx235gCF-QjW0cQ":{"text":"Loved it!!! Lived the food, the service, the drinks, and the atmosphere. Traveling through","useful":0,"cool":0},"j41aX-pCMgZKljf21ruC2g":{"text":"Unbelievable tacos and guacamole/ queso! Will definitely make a point to come here when we","useful":0,"cool":0},"KUsoYAH69dqX_efUnDiS5A":{"text":"My experience of what a taco can be has been redefined. \nAn a la carte menu with several c","useful":0,"cool":0},"NpAmvMWceJGfesLaDxE1Rg":{"text":"What a nice find. Had the fish and the spicy shrimp tacos and both were wonderful. Well ex","useful":0,"cool":0},"9zwxAfT1kVXU_jBDbl1Xng":{"text":"I'd like for it to be known that these aren't real tacos.  Having spent considerable time ","useful":1,"cool":0},"F4G3uiM7W6ruq1j0bHtmdw":{"text":"I've never been to a restaurant where so much thought and attention to detail was put into","useful":0,"cool":0},"SH10ugq1V9dQRWmcGcF26w":{"text":"This place is amazing! I am visiting from Atlanta and I had lunch here as a recommendation","useful":0,"cool":0},"qp0fKK_K8ydVKe2puVByAA":{"text":"One of my favorite casual dinning spots in NOLA.   Always great food.   Good mix of Tacos.","useful":0,"cool":0},"-DizJs-XJpccHSPTbU_KCQ":{"text":"Have been several times in the past and usually I'm not disappointed. Great food but man o","useful":0,"cool":0},"azf-UzId2x9Mx0iwJ5Rf9w":{"text":"Average nothing special. Only Mexican food I found in New Orleans though. Still not that g","useful":0,"cool":0},"CZH2wqqj_emcpW4hSgYqMA":{"text":"Though I live nearby I have to admit that I was prepped not to like this place. It seems t","useful":0,"cool":0},"Drcackv-H945jr44y5tPkQ":{"text":"Fish tacos are delicious and one of my favorite places dirty outside on Magazine street","useful":0,"cool":0},"LpeqciN4ILvog3XbUxZSwA":{"text":"It was ok.  They had football on, the crowd was fun and the Michelada was decent.  We deci","useful":0,"cool":0},"Il7ZUoI0Jxis6alXsx98Uw":{"text":"This place is amazing! Taco Tuesday and Happy Hours are a must! Get there early since this","useful":1,"cool":0},"8Z0j93xuYOpU64NV4OULrQ":{"text":"New Orleans is a city of flavors and the Rum House doesn't disappoint.  I had the tacos he","useful":1,"cool":0},"Smyq_49tmf_YbIl1U2I_YA":{"text":"Love the food and the ambiance is different. Caribbean food fusion is great. The plantains","useful":0,"cool":0},"fs0N9Sqx66OquY1MTHgAxw":{"text":"I really enjoyed the food. The table beside us with 6 loud, drunks, hardly able to make it","useful":1,"cool":1},"wYNEQCURjbvfmpZIiRxerQ":{"text":"Food is AMAZING!!!!!! Drinks- AMAZING!! Had the Classic Caiprihina to drink, a Mango Avoca","useful":0,"cool":0},"0lKBJjYCEkEier-85AfOvw":{"text":"Alright, yall, I have seen the light. Fiance, fur child, and I stopped in here one evening","useful":4,"cool":3},"2JV8Crm5NPoXHdc-qPr0GA":{"text":"I haven't been so delighted with a new restaurant since I went to One earlier this year. I","useful":6,"cool":1},"RzLAUkctn0ZWnCrVFInOaA":{"text":"service was outstanding and food was good. pina colada was very good, best ive had. i will","useful":0,"cool":0},"6aXib9kLQMmYbjDIDJWUXA":{"text":"Stopped by for dinner on a Saturday night during the LSU game and loved the atmosphere. LS","useful":0,"cool":0},"CTUuD41_G2vOvVNO-PxDGg":{"text":"I love this place! I always enjoy myself when I come here. It's very fun, hip and upbeat.\n","useful":0,"cool":0},"rx7E00WQriNu1slP0_T67w":{"text":"I like this place for somewhere super casual to go with pretty good food.  Everything I ha","useful":0,"cool":0},"WQ0osb8PT4jvS49UJpFaag":{"text":"When I go to New Orleans I always plan on spending more money on food than anything else. ","useful":0,"cool":0},"mzR1NQJS-5xwtt7Qrk4Qpg":{"text":"The tacos here are absolutely amazing. Make sure you have some of their home made hot sauc","useful":0,"cool":0},"uvh2OEcCEOJVANa54EngXw":{"text":"Been here twice and love the salad with roasted sweet potatoes. One of the best salads I'v","useful":1,"cool":0},"TPASyihBM3GGe4ZWO-u5Ww":{"text":"I think I've tried everything on the menu and it is ALL delicious.  Starting with the drin","useful":0,"cool":0},"okwJySyDcr3ZD3TwMv_3gg":{"text":"Suggestion: Fish on a Half Shell\nPros: The fish was just ridiculously good, drinks were st","useful":0,"cool":0},"NTu7thq8kkwTpQ-SRzkVOw":{"text":"The appitizers were great, the tacos were just so so, and the cocktails were awesome. Our ","useful":0,"cool":0},"fOA-sQzFGH4YJKrYIQHQ_A":{"text":"Food and service outstanding!\n\nHad the taco combo with chili glazed shrimp taco (good, but","useful":0,"cool":0},"NUmN1H8IPWlovWYbKqdUEQ":{"text":"Originally intended to be a brief HH stop, my friend and I ended up going to town on some ","useful":5,"cool":2},"HFSUXNFPmJISBJYh-DIJWg":{"text":"Best food ever.... It's not Mexican as some has posted... They have a huge selection of ru","useful":0,"cool":0},"njJPztsfKFZOTx03tDzg1w":{"text":"BEST TACO PLACE. I am a huge fan of the rum house. My favorite tacos are 1) calypso beef 2","useful":0,"cool":0},"8IsrKAPIwDg0OGjlkaJmPw":{"text":"Great staffs first of all! A good hang out spots are great drinks and amazingggg appetizer","useful":1,"cool":0},"9LXAmp_HExjvcG80Z4b8ig":{"text":"This was my first visit & I must say I enjoyed this place. We did not have to wait to be s","useful":0,"cool":0},"1oGBPxiZ9Wn9GvbO5aKvbQ":{"text":"Finished off my day in New Orleans to the tune of a delicious crab sandwhich I could not f","useful":0,"cool":0},"5eKh8HqrXBnyp9DQnfNIPg":{"text":"MMMmmmmmm MMMMmm!   Thats all I can say!   I love this stuff !  It is rich though, if you ","useful":5,"cool":3},"YhkyHAzb6ftD3JpHxNgrQg":{"text":"First time in NOLA. Ventured to the garden district and found this gem. Everything from th","useful":0,"cool":0},"N8WZ3z6w8Me-Wt5VUFt30g":{"text":"Amazing food.  Killer tacos.  The nachos were huge and delicious.  A must have if you are ","useful":0,"cool":0},"WnQcOr3Mm9Uk3GOw4R5AIw":{"text":"Love the salad here with sweet potato and curry vinaigrette! My roommate and I walk here o","useful":0,"cool":1},"W_jp00LWMldjGB-sbahtsg":{"text":"I'm glad this place has blown up, seems like there's always people packing it in.  Great a","useful":2,"cool":2},"g11lUk7bNt79jY24SDJh_A":{"text":"Highly recommended!!! Please order the curried mussels as appetizer  and the fish of the d","useful":0,"cool":0},"aPgQgUApkF7LR1tAXh6Udw":{"text":"I LOVE the taco selection here!  Such a variety that I'll have to go back to try the other","useful":1,"cool":0},"Tz3-MKcZq-enm8TcksoS8Q":{"text":"I had a wonderful experience here. The food was absolutely delicious. The staff was very a","useful":0,"cool":0},"t_9M5I_F4otWlYNwpLH2-g":{"text":"Drop by this place for lunch and you will thank me later. The ambience was great, very fri","useful":2,"cool":1},"_ep_JCr_ELsj69ThLV6xjg":{"text":"The calypso and brisket tacos are the most savory, delicious tacos I have ever had!!! Hand","useful":0,"cool":0},"MDZ5a1WqK56eKv36X2DEdQ":{"text":"Dope tacos, variety of choices and none disappoint. Definitely go on taco Tuesday for 3 do","useful":0,"cool":0},"pzx4PzhgVGwWlhj6gqzZOw":{"text":"Went for lunch with my husband yesterday. Sat at the bar and had decent food but a weird e","useful":0,"cool":0},"znHqyLZ-qdA4frk7tph35Q":{"text":"I have been here at least 10 times and each time the service, food and atmosphere have bee","useful":0,"cool":0},"elUF85Zt2KMFRrP5kbkq7Q":{"text":"Delicious and fresh. A great place to eat outdoors on the sidewalk. Awesome, big salads. I","useful":0,"cool":0},"XubQ0ZsEPqKhMez6bdIZ3w":{"text":"Have been to the Rum House twice now. Wide selection of drinks and big menu of choices for","useful":0,"cool":0},"A6SkGrWrLwu0d8CQTmRzgA":{"text":"After a tour of the New Orleans Brewery, my friends were ready for munching. This was my s","useful":2,"cool":1},"7gKfJdPurzqK_OsTYbNDXQ":{"text":"Started off OK on Mother's Day, but then my fiancé found a twist tie in her sandwich on th","useful":2,"cool":0},"TlvzvnX-pCcmP1jSpnx0tg":{"text":"The best tacos fusion I ever had  in my life,  this place is a MUST is you go to NOLA","useful":0,"cool":0},"zCBSULRLwYQur7qIeABlzA":{"text":"Service was great. Nachos arent as good as they used to be. I understand table turns but t","useful":0,"cool":0},"7HC9KNV0T4zR3ZT-W-nFkA":{"text":"The Rum House is a fun place for an inexpensive dinner. The vibe is young and energetic an","useful":0,"cool":0},"-nbthOrvW_KlhyvNIF-heA":{"text":"Can't wait to come back for $2 taco Tuesdays. As of lately, I've become  a huge taco snob.","useful":0,"cool":0},"Fm-Un1Smzgm0LpfznoixVQ":{"text":"Finally got to this place and it was not disappointing. Atmosphere,  food, drinks, service","useful":0,"cool":0},"v5BE6nOIeZbRS3Ic0nhEAA":{"text":"Pretty good food.  The salads were excellent. The tacos had some cool combinations. I woul","useful":0,"cool":0},"U-THhjk4h9ghLJD6is1s7g":{"text":"My wife and I were looking super forward to checking this place out for months as we were ","useful":0,"cool":0},"_ePDXQUds8UQWm3DfUdsqg":{"text":"Awesome salads - server was on point and very knowledgable. Great recommendations and slig","useful":1,"cool":1},"qQsFwWWlqN41XkVD5tdIzQ":{"text":"The avocado mango dip was a delicious appetizer and probably my favorite part of my meal! ","useful":0,"cool":0},"ss_Hd9HBILvIStcVRKywqg":{"text":"Loved the menu!! Such a great mix of Caribbean with seafood. The service was good and thei","useful":0,"cool":0},"-ZXVPHTg1M5ZpLoQZuoa1A":{"text":"I went to Rum House this past weekend for my birthday with some family and friends. I read","useful":1,"cool":0},"0KA91rw_Z2qWMoRjM5hivg":{"text":"The rum house has such a great and fun atmosphere! However, inside does get quite cold (th","useful":0,"cool":0},"QB6I6KTQReqp-d2kGe6lOw":{"text":"Great food at a great price. I especially enjoyed the trifecta tacos. Oyster tacos were my","useful":0,"cool":0},"PENqPoQaJp_39eV6CX97HA":{"text":"I love this place, every time we come to New Orleans we try to stop here. Try the nachos! ","useful":0,"cool":0},"uVuem-E8Z_Y9diJ7jbf2fg":{"text":"A four star average for the Rum House? Let's maybe put things in perspective here.\n\nThe Ru","useful":7,"cool":1},"wTI_zdXR4ENnD_6XMZrGSg":{"text":"I am a fan of this place, the tacos are really good, but the coconut rice wrap contraption","useful":0,"cool":0},"NvwmI64mWWdxY8q0P0HRRQ":{"text":"So with all of the Cajun and southern inspired foods in NOLA we decide to stop at a Caribb","useful":2,"cool":0},"W5URPaTW9xNvTpScfR1aFA":{"text":"Great food and very friendly service. A nice dining experience. Lots of taco options. Ever","useful":0,"cool":0},"8oKAiR2sY6OGCpsI4Ru0Rg":{"text":"Very cool atmosphere. Especially for a late twenties crowd. They do some amazing things wi","useful":0,"cool":0},"M3YohG4fGQK-HiZG-PfQSw":{"text":"OMGosh! Amazing salad. Flank steak salad with chimichurri vinaigrette. I can't tell you ho","useful":1,"cool":0},"0gcT9JKI6qgFqItKguyHTw":{"text":"Wanted to break outta Cajun food and go for a little spice, picked the right place. We ord","useful":0,"cool":0},"KFnxONg9hnG1q4XexH_VfA":{"text":"i appreciate that rum house is about flavor, as it should be.  i recently had the jerk chi","useful":1,"cool":1},"XDJnicTmtenRgBUIFjLfTw":{"text":"Ate here today and everything was awesome! It was taco Tuesday so all tacos were 2$. We go","useful":1,"cool":0},"XuOVa0gJOTLt_7_dK1V7vA":{"text":"This place is awesome! It looks kind of small and not very impressive on the outside (some","useful":0,"cool":0},"Zwnwn_pOTm3gbBbrGRtvXQ":{"text":"Lauren is suoer friendly. Food is always good and the rum selection is ebmven better than ","useful":0,"cool":0},"GpCzzlaHfeozsXDJdgqg4g":{"text":"Amazing options on tacos and drinks. The vibe is casual and the location of the restaurant","useful":0,"cool":0},"LgRQCiS89JCb8LGsFycQHQ":{"text":"Good drinks, good eats. Fun trying their craft cocktails. Place is very lively and has hig","useful":0,"cool":0},"lRamnrkbiGiQh6aGSRPu3g":{"text":"Went here as a suggestion from a friend as a must when visiting NOLA  and now i understand","useful":0,"cool":0},"jbtvlJ2hdHau-LbEn1qunw":{"text":"Absolutely love this place!! I love the various flavors this restaurant has to offer, and ","useful":0,"cool":0},"wpn9RMery3YyWZ70UQo2NA":{"text":"I stumbled upon this restaurant while walking around the Garden District. It was busy so t","useful":0,"cool":0},"dOEAPJc_p8oev-Y-zn2FTg":{"text":"One of my favorite restaurants in the city!  I love their Caribbean food and I think it's ","useful":0,"cool":0},"j2C1u4DggmB72wQ7Dp6fTA":{"text":"LOVE THIS PLACE! Tacos are good, drinks are good, Damn Good Nachos are amazing.  An absolu","useful":0,"cool":0},"Rlzs7BmhdYd-KWiwpLkwtA":{"text":"I've taken friends here for drinks & atmosphere. The sauce for the calamari is awesome but","useful":0,"cool":0},"DxLrJ-reGAFCBhy9AGckOg":{"text":"Great service (loved our waitress) but left some things to be desired. Most of the food wa","useful":0,"cool":0},"_TTFtGGxunvBkheWM2ss8Q":{"text":"We are from out of town and wanted to find something to eat outside of the French Quarters","useful":0,"cool":0},"_G4mEbo2GPG031hxd4GRxg":{"text":"We absolutely loved this place. I highly recommend to anyone who drinks rum. They have rum","useful":1,"cool":0},"FaE_PhLo29m9HRDkguec5Q":{"text":"This place is further away from the madness of the French quarter but definitely worth the","useful":0,"cool":0},"K2kKwx_j3EtEdbD_q9zIyA":{"text":"Went on a Sunday and I can truly say they have one of the best beer and food selections on","useful":0,"cool":0},"OturAe6RRqM5DKxonBQcMA":{"text":"phenonemal service, incredbly good looking female's. tacos were good n so were the drink's","useful":0,"cool":0},"AKVL96la_1dXdjH5jmLRLQ":{"text":"In the Garden district a little bit away from the French Quarter, but worth the visit!\n\nTa","useful":0,"cool":0},"xkqmyZpgJ2NwXBfFs_iLyg":{"text":"Thank you so much to the manager and the server who provided our table with fresh cut cucu","useful":0,"cool":0},"gd299eiMv2_qFAA50fntsw":{"text":"If you haven't been here for taco Tuesday's your life is missing something. That being sai","useful":0,"cool":0},"5rjEFYF0MiD2t9NeaQQ-ww":{"text":"Fantastic meal!!!  7 of us ate and all loved the tacos, sandwiches, and sides. Best food w","useful":0,"cool":0},"gtsrfaNiL2weDjXOyGcp-w":{"text":"Visited on a Sunday afternoon , quite busy was about a 35 min wait. Some empty tables and ","useful":0,"cool":0},"xasKjObdruKDrTopTahFQw":{"text":"We had not planned on going here, but damn! After walking by and seeing people feasting on","useful":1,"cool":2},"DFKjfDAmhd5A4spMRxGaoQ":{"text":"Unfortunately, after my last couple of experiences, my five-star review of The Rum house h","useful":3,"cool":0},"HkhTX_8fm7hZgkuzfQV0OA":{"text":"This place is a must eat if you are visiting NewOrleans. There are variety of tacos served","useful":1,"cool":0},"j7CFfMVBACRhZrbneruEwA":{"text":"Delicious tacos, excellent vibe. One of the best restaraunts on Magazine, and the prices a","useful":0,"cool":0},"BYCuJsRZXN3fvpEBnjkGIg":{"text":"Eh...I don't get it.  After reading all the reviews, I was SO excited to try this place.  ","useful":1,"cool":1},"ogJmPLTGx-EouJYin92cIA":{"text":"Have you ever wanted to be driven to drink, but in a good way? There is an atmosphere in t","useful":9,"cool":5},"4f0_OYHeq1iOv3HMUoJD3A":{"text":"Great service, fun atmosphere, great food.  Nachos - Excellent!  Tacos (Carolina and Jerk ","useful":0,"cool":0},"DqzMfmNyv214wOShcM8gOg":{"text":"I usually love the place... I often eat at the bar but today the service was \"roll your ey","useful":0,"cool":0},"D-KEtTedCwhMzaru_TADpw":{"text":"Absolutely love this place.  Awesome tacos and appetizers like the damn good nachos and ma","useful":0,"cool":0},"wuIKFTmui8K3qyKh5nAaeg":{"text":"Probably one of the best lunches we had in the Garden district in New Orleans! We started ","useful":2,"cool":1},"R0PM6xT_27TqbCjl6NILww":{"text":"If you're looking for a casual fun place for a meal, perhaps you're also a big rum fan, an","useful":0,"cool":0},"-wWYebBMKF8N1TEsSuHVbQ":{"text":"Great food throughly enjoyed my meal. Great variety of tacos and food!! Location is also g","useful":0,"cool":0},"qY0r7KswZ67vSFhXBo0x3Q":{"text":"We just went to the bar for drinks. It was very crowded.  The bartender was very quick to ","useful":1,"cool":0},"m2ahFhTCTKw8lYizy3jn3g":{"text":"Great restaraunt on magazine street.  There were five of us and the wait was short and Aus","useful":2,"cool":1},"-N7XwGkAnrRcXExOol-cHg":{"text":"Fun atmosphere and great location. Caribbean food is pretty good here. Parking is hard to ","useful":0,"cool":0},"aLDXAXd74b6TlCNi5c0WIA":{"text":"Great food, good prices. SO LOUD. Installing noise dampening pads under the seats of this ","useful":1,"cool":0},"0d2irHFvnQnkRRlhpj64yQ":{"text":"If you know Caribbean food, you might not feel the food is authentic. But I would advise  ","useful":0,"cool":0},"iNnzHPIkEKbrfTVR8DNFGA":{"text":"Stopped here with a friend in the afternoon and each of us decided to order the three soft","useful":0,"cool":0},"1sERNk5Bm6C0Q8Ggw9XU-A":{"text":"Great place, great menu selection, food is wonderful. I recommend getting the \"damn good n","useful":0,"cool":0},"z_MDx_JDXUwKxtEVYnUEwg":{"text":"Everything was scrumptuous except for our server, he was dry and seemed a bit aggitated. I","useful":0,"cool":0},"RykVDKVnyHu1uwWzehb7Vw":{"text":"After eating so much fried seafood and all sorts of PO Boys in NOLA, needed something else","useful":0,"cool":0},"3PF5_GtNrX49BbTokAWuBQ":{"text":"I come to Rum House every Tuesday for the Nacho's, taco's and most important the frozen ho","useful":3,"cool":0},"etNJYKNaEritrGTvvOKGXA":{"text":"The food looks pretty yummy..We are having drinks..Happy hour is pretty good here. Yummy o","useful":0,"cool":0},"nLaVMl3NnHKIYpZ0LTknQA":{"text":"Food was mediocre and drinks were overpriced. Service was just ok, nothing to rant about. ","useful":1,"cool":0},"Nex9g8P2qZM-a_Vx4XfWZw":{"text":"Some of the best food in Nola. And given the caliber of Nola food, that's impressive.","useful":2,"cool":0},"0e7nkv3eXD7QoKf5n1nnPQ":{"text":"Curried lamb taco - nice flavor, wish it was little spicier; seared scallops- I love scall","useful":0,"cool":0},"fKOOggV_edIiSMb00XwchQ":{"text":"I got the choice of 3 tacos and tried to find the most Cajun/Creole sounding meat combinat","useful":0,"cool":0},"1O4zG7tyRFBAg1f4oXhrvA":{"text":"I work in the area so I always stop in during my breaks to get an order of mac and cheese ","useful":0,"cool":0},"P8Y08tD7rX2nSxTlEubUhg":{"text":"The food was very tasty, but it's just a little too loud for my taste. Also, when I had to","useful":0,"cool":0},"GFSK8dhzRM4wnTfTO7BfjQ":{"text":"We visit the Rum house on a Saturday evening and it was packed. It was a 30 minute wait th","useful":0,"cool":0},"B-Mkr3RitM0kqgy2bFTLsA":{"text":"Great food. The grilled shrimp tacos are excellent. The Mac and cheese is good, and the gr","useful":0,"cool":0},"odHUj8Vr8tF1-1jZOVJ9VQ":{"text":"Food was good.  Food is better at the Baton Rouge location. We came during happy hour and ","useful":0,"cool":0},"UrnNApBQCxag4krJYfK6QA":{"text":"The tacos are TO DIE FOR. The plantains are also amazing. Fav taco is def jerk chicken","useful":0,"cool":0},"6AxYbQ5Bwc8nKPWY0RUFbQ":{"text":"Taco Tuesday! Super good food, probably the best guacamole in town. $2 tacos and all beer ","useful":0,"cool":0},"-yu97b2NaWjbP_exyHkzZw":{"text":"Popped in here for several happy hour drinks. The drinks were a tad on the sweet side, but","useful":1,"cool":1},"RjWOGvrQti3F70WgwxT1Pw":{"text":"Drew Brees Taco!! Jamaica Me Crazy drink... and $3 Taco Tuesday... love this place!! Ohh a","useful":0,"cool":0},"7CBh0wa9Fse1TmISpSFu8g":{"text":"Been here a few times now since moving to the Irish Channel.  I must say that the crab mea","useful":0,"cool":0},"r8SsICxqM0lN7abUV5YLaA":{"text":"Probably one of my favorite restaurants in Nola! Excellent tacos - I've had almost every o","useful":0,"cool":0},"0GOE8Khr943Ni5gQwp9Zhg":{"text":"O. M. G. We kind of stumbled across this place while out walking. Needed to get an early d","useful":0,"cool":0},"RW06eqZXT0HYXBgA7e7-xw":{"text":"I love the rum house. This was my second time coming and I really appreciate the vegetaria","useful":0,"cool":0},"a96ZmgslaAzvFE7JprGh0g":{"text":"Friends of ours brought us here upon our arrival to New Orleans. Since I was exhausted fro","useful":0,"cool":0},"jWHcz97MDek1_fd7anyGlg":{"text":"This place hands down PERFECT. Had the \"true dat\" taco plate with plantains and mango rice","useful":1,"cool":0},"Ivl_H77RAm56vtb0GjVY2A":{"text":"Today my boyfriend & I decided to try Rum House as we have heard many good things about th","useful":1,"cool":1},"PGUHVuNgTEE0cK10uqfgZQ":{"text":"I came here because I was craving roti. I looked online and saw decent reviews, so I decid","useful":1,"cool":0},"6XdYWVla2W1dCx3crzZvTg":{"text":"We had the \"Damn Good Nachos\" it's enough for 3-4 ppl. The recommendation came from our wa","useful":0,"cool":0},"mNrhOCnsn48gCATOwLOUxQ":{"text":"The wait time for this restaurant chain can be long, but it is totally worth it to get you","useful":2,"cool":2},"6yHhqae6fAa8cx7IRpOSYA":{"text":"Why doesn't my review show up in Yelp? This is important!\n\nWARNING: FOOD POISONING!!!! I a","useful":0,"cool":0},"mvxGRD-_G-QYmxIzlIpnCA":{"text":"I had very high expectations from all of the stellar reviews. Unfortunately I had not such","useful":1,"cool":0},"4QvAXTVDgAhdaVWfR1eSZA":{"text":"Taco Tuesday! This is the place to go! 2$ tacos all day. My favorite is Calypso Beef. I al","useful":0,"cool":0},"xA51JRc2s6t-FBjCqRBYJg":{"text":"This is definitely an amazing place to try tacos of all sorts. I really liked the experien","useful":1,"cool":0},"SCyEw9sD2ay-85dOH9M_cg":{"text":"Unless you sit outside, please bring your outside voice.  It is very very LOUD.  \n\nFood is","useful":0,"cool":1},"e8L4y-KGf1cjjb6kllvO1Q":{"text":"My family hit the jackpot here. $2 tacos every Tuesday at lunch. And they were all great! ","useful":0,"cool":0},"RMBYZRKeQQVS1ZWmNfO5lQ":{"text":"Loved this place! Only qualm is my tacos were slightly cold, but other that, this was wort","useful":0,"cool":0},"Swvi_Ay7m_LJvI_ugx5lMg":{"text":"Oh my! This place was soooo good! This is a must go to place when you are in New Orleans! ","useful":0,"cool":0},"-Fm2qriLbn9kvrhprK-4AA":{"text":"Had the pain killer rum drink.  Super strong and yummy.  We had the tacos and the rib eye.","useful":0,"cool":0},"q4S0725EU8_tIjztrs0U2w":{"text":"Yummy yummy yummy food and drinks! You can't go wrong with the mojitos! They are so delici","useful":0,"cool":0},"Tk6fq-WUjySAcHWEQIPjRw":{"text":"We ended up here randomly, when we visited New Orleans!! It was our favorite restaurant of","useful":0,"cool":1},"Ou_Jtdje31hWmKWeHs568w":{"text":"Complete fail of a restaurant. NOLA has fantastic food but the rum house couldn't have bee","useful":5,"cool":0},"FWlpTCDjlaigWlH35m98EQ":{"text":"This was recommended to us from our host on airbnb and it did not disappoint! There are so","useful":0,"cool":0},"IdFQDnDTqiDZNd6box-Y6g":{"text":"I really wanted to try their creative specialty tacos, but as I planned to eat dinner *aft","useful":2,"cool":1},"jOsKhtIqGpadkN96WPkusA":{"text":"My husband and I came here for dinner. We were both pleased with our meals. Good portion s","useful":1,"cool":0},"LYSWetMnAfxmdW4i4BFKqg":{"text":"Me and my sis-in-law were starving and we couldn't figure out what to eat. I yelped places","useful":0,"cool":0},"y5e0EE50oivMx3Ru_Mv1Fw":{"text":"Took my parents here because they wanted to eat new things on this visit. Chick at work to","useful":1,"cool":1},"jpBsYRVwet_rW4jKRDj5nw":{"text":"Don't know how I forgot to review this place while living in New Orleans, but it was just ","useful":2,"cool":0},"U1_kXgfY-VkMUfJw4U0KRw":{"text":"First of all, skip everything else on the menu, and go straight to the tacos.  Our server,","useful":1,"cool":0},"9iZXvrFtJDsUEN-RewWwCA":{"text":"At the end of our Garden District tour, our guide suggested we go to Magazine Street and t","useful":0,"cool":0},"cQNtBEPhY4gwkehru0nkKQ":{"text":"My wife and I went to The Rum House after reading reviews on yelp. This place was off the ","useful":1,"cool":0},"Ra8-Oz1iVkc1UEGYihF60g":{"text":"Our first food stop in NOLA. Even though was pretty busy, we got seated right away. Brandi","useful":0,"cool":0},"7n_Cq-Gf5bYMj4N71q6Ohg":{"text":"I love painkillers! ....not that kind. The kind thats made with that oh so creamy coconut ","useful":6,"cool":4},"6c7jtUIXRAPkSTtKx1EcYg":{"text":"This place was packed and the reviews are great, however the jerk chicken lacked flavor. T","useful":0,"cool":0},"9wXBNXP-_I9XVl8799ERKA":{"text":"amazing house drinks, food is to die for, the ONLY  drawback is theyre constantly busy so ","useful":1,"cool":0},"RWm4c0_Cfu-d2qwk2e7Ftw":{"text":"Every taste bud fired up! Fantastic street tacos with a Jamaican flair! Our waitress Aimee","useful":0,"cool":0},"T4in_EgKromWg9Dci1bDEA":{"text":"The food was disgusting everything has the same flavor . The service was absolutely disapp","useful":0,"cool":0},"7DotJJ3CAxgV2b8fdpwK6g":{"text":"Great prices, atmosphere, location, waitresses, neighborhood\n\nFood was AMAZING!!!!\n\nI woul","useful":0,"cool":0},"wkdGZa_vLSqTL_WwZ7SSjg":{"text":"Worst Caribbean food I've ever had!  Peas and rice wasn't good! Rice was soggy and two swe","useful":1,"cool":0},"uGUbSuJc-uObbIpY6SskaA":{"text":"I went to the restaurant thinking Caribbean food,  this ought to be good.  Wrong.  I order","useful":0,"cool":0},"GSTqYsm4blcxbdA1yLUU9g":{"text":"The service was absolute shit, overpriced for what I got, the tacos were just too small an","useful":0,"cool":0},"zPYnxGGVACC__539zlSDBg":{"text":"Spent quality time with co-workers for a relaxing happy hour. And, relax we did. Great tac","useful":7,"cool":7},"A-zPnukyAz1W5dl4tyMe6w":{"text":"Amazing tacos (not ordinary) and mac n' cheese! Went on Taco Tuesday and all tacos and bee","useful":0,"cool":0},"OFT9QV16fUQOG7kjnIX__w":{"text":"The food was exceptional.  I ordered the damn good nachos, and damn were they good.  The p","useful":0,"cool":0},"tJri3wce1WgrNa4RHW6qXg":{"text":"Great food, great atmosphere and great rum selection.  Place is ALWAYS packed so expect to","useful":0,"cool":0},"DQRXyxPlCeFeKYVwog2Z0g":{"text":"This is my second time here and again the food and  mojito did not disappoint. The passion","useful":0,"cool":1},"wJPsqinfyg0qam1HoAJR_w":{"text":"Love love love this place. The restaurant was referred by a friend, and we had to walk ove","useful":0,"cool":0},"jMCFKjfOhOHNUBycrvLZcA":{"text":"This place is incredible. Not one bad thing on the menu. Highlights include tacos, seafood","useful":0,"cool":0},"lmQP27Qg0M5VyNvcjEXU2g":{"text":"Although I am a local, I have never been here before last Saturday. My fiance and I were o","useful":1,"cool":1},"9BgQHLPyHZAZ7AUSgudC3g":{"text":"Neighborhood bar and Caribbean Taqueria. Exactly!! \n\nCalamari and  Nachos for apps. Great ","useful":1,"cool":0},"F6n95A3duNYQ8pODzcpVVg":{"text":"Wow...just sat through the Super bowl halftime show here and watched no less than 8 server","useful":0,"cool":0},"VrD6YXby4XWUwXlYbPsJig":{"text":"wait time: horrendously long\nservice/staff: fast and friendly\nfood: impeccable!\n\navocado a","useful":0,"cool":0},"NvGvz-3yh7fmBUwR7FvmYw":{"text":"I'm leaning more to 3 1/2 but will round up to a 4 because my food was really good.  Had 2","useful":4,"cool":1},"uV31fkWNYNTTfzyD7p4ZOw":{"text":"What a fun place for lunch or drinks. Everything about it from the menu, food, and service","useful":0,"cool":0},"oLIImMkldpNLi7tO-PTFYw":{"text":"Food=plastic. It's worth the minimal effort in finding a Latina restaraunt that hasn't bac","useful":0,"cool":0},"1rdFTIxlfQyx8OovBXieqw":{"text":"We stopped by last Saturday evening. There was a 45 minute wait to get a table inside but ","useful":0,"cool":0},"ShqwVXfufeRINNGfHXtczA":{"text":"Traveled from Charleston, SC to Nola.  Amazing guacamole with mango! You can tell they use","useful":0,"cool":0},"7HedHTQNteJM3It9-HM4Sg":{"text":"on a recent lunch with friends, i ordered the rum house salad with a side of jerk-seasoned","useful":0,"cool":0},"rUw1LUOJeB9JNxCtyGHVdA":{"text":"This is one of my favorite spots.  You can eat and drink inside, or choose the picnic tabl","useful":0,"cool":0},"ExVzXNWHd61U_OxxHNQHOQ":{"text":"This is one of the two (out of like 10 in all) restaurants in nola that I would actually g","useful":2,"cool":1},"dMx01idanK28WT1mwJ8tIg":{"text":"Amazing. My hubby and I tracked this place down after speaking with a couple NOLA locals w","useful":0,"cool":0},"ua0STSkrvmEk7JLO221NDA":{"text":"Very nice restaurant, casual, friendly staff. The food is good and enough fair price, I th","useful":0,"cool":0},"VentDlO-x7wWeJ2cQUNSFQ":{"text":"Probably one of our favorite spots to stop on Magazine and grab a bite. I almost always ge","useful":1,"cool":1},"p_VUlV9m0qbQ56_kKj20Xg":{"text":"Came here at the recommendation of our Uber driver and was NOT disappointed. From the Jama","useful":0,"cool":0},"CBzpeIvzZird8rAxJwXgmw":{"text":"The Rum House had good food me and a friend tried the tacos and they were good. I really e","useful":0,"cool":0},"7mtgb9bAZbHE_NCPdxcXSw":{"text":"The biggest drawback to this place is that it's very busy all the time. They have drink sp","useful":0,"cool":0},"Fvhgje_if2fwCUoeo3aV3w":{"text":"I call myself a taco fanatic, and this definitely passed the test! I got the Calypso Beef,","useful":0,"cool":0},"zjA71J3xKMl7YAT2gxsCuw":{"text":"Yo....this place is amazing. From service to food I just love it here. Its perfect for a r","useful":0,"cool":0},"ZkIzDUjirCefN7gRpBVI7g":{"text":"Absolutely amazing!!! The curried mussels were awesome. The heat was balanced just right. ","useful":0,"cool":0},"8CZh46lMG8Dfr9W3-yc4mw":{"text":"The tacos were great, try the brisket! Yummy drinks. Casual fun atmosphere, good service.","useful":0,"cool":0},"l83N7VB52t7LssLajxC41A":{"text":"Chips and salsa and 3 jerk tacos and mashed potatoes. Great meal with lots of taste. I'll ","useful":0,"cool":0},"o24IVlVJR9SDLX0IvvCaug":{"text":"Stopped in for a drink and snack after walking magazine st. It's just your typical sports ","useful":0,"cool":0},"LmvgMNxvDfD264TrLAsmig":{"text":"A friend and I visited The Rum House for drinks and appetizers, and were pleasantly surpri","useful":1,"cool":0},"EuPNC3SLI3hs78T48y3w6g":{"text":"Cool atmosphere for Sunday football. Big screen. Lots of TVs. Good service, good drinks. I","useful":1,"cool":0},"_nhDbBNNNB6-YnMCsb9cFw":{"text":"This place was so busy.  There was a 15 minute wait which actually did not seem very long ","useful":0,"cool":0},"_uL1VKkx4LaU1PMpXS-xEA":{"text":"Every time my family from out of town comes, they want rum house! This place stays packed ","useful":1,"cool":0},"whS5ZB5S55GVJuVLoKmQig":{"text":"A friend recommended this restaurant during our stay in New Orleans. It has a great atmosp","useful":0,"cool":0},"BqYheiMTGMsPR7Rd7nORYA":{"text":"Started with the Nachos for an appetizer. Delicious and HUGE so be prepared to share. \n\nHO","useful":2,"cool":0},"_e20m-7uEgt2Ixjahnykrg":{"text":"Cold food. \nBad service.\nLeft - found a spot (Barrel Proof) that made our night!\n\nDudes co","useful":4,"cool":0},"hsnRaIfvQVPRff5qXlPbOQ":{"text":"Love Rum House. Great for any type of visit! Their tacos are incredible, but you really ca","useful":0,"cool":0},"hhqLPMpuVKJBzMAagewqNQ":{"text":"There was no wait for a table and we settled in, ready to enjoy a nice meal. The table was","useful":0,"cool":0},"TRCy69ev1ofs_NpLLuZC5w":{"text":"Star rating for:\n\nFood: 4\nService: 4\nVenue: 4\nPortions: 3\n\nMy family and I really enjoyed ","useful":0,"cool":0},"mr8vj76hv2Sb2814Sf3Jpw":{"text":"The food here was an interesting mix of Mexican, Caribbean, and New Orleans style food! Su","useful":0,"cool":0},"yiWOI4-UnW1XQ5Uh0FYIsA":{"text":"I ordered 3 or four tacos and it was more than enough I was so full. Can't remember which ","useful":2,"cool":2},"KXjKNFpqq1nrpMjKasfhWw":{"text":"Excellent food and drinks! Definitely recommend the Two Dat with the Caesar salad and the ","useful":0,"cool":0},"Pso90jaxcp7NF7Spyg-hGA":{"text":"Enjoyed the Caribbean tacos. Never had Gator before... Quite the experience! Sarah was a v","useful":0,"cool":0},"vezuVwMUlJ4qTI-J3iQBXQ":{"text":"Great food  and wonderful flavored mojitos. Even the margaritas are good .  Try the nachos","useful":0,"cool":1},"Zhnl5usS7pts2bqB-eF0Qg":{"text":"Loveeee the tacos! Extremely busy restaurant but the wait wasn't too long. Definitely wort","useful":0,"cool":0},"IdmBqsVXnKNOoYKWLu73LQ":{"text":"Easy, casual atmosphere with great sandwiches. The Cuban and the brisket melt were delicio","useful":0,"cool":0},"4Evzq8NJejgXJEYm4FQp4w":{"text":"Great service\nNice inexpensive drinks\nNoise is loud\n \nWorse nachos ever had.\n\nDrink here b","useful":0,"cool":0},"HRwZx4ZhKmNyZcMOhHsNMw":{"text":"The tacos are all amazing! The rum punch is pretty good to. You'll have to wait, but it's ","useful":0,"cool":0},"pQyTPgkjjWF89jUpsHqhnw":{"text":"We got here for happy hour and had delicious $3 tacos and margaritas! The duck duck goose ","useful":0,"cool":0},"0ShQKoZ9O040b96iy225dw":{"text":"I came here for lunch one day while I was in New Orleans and loved it!\n\nBefore I even get ","useful":1,"cool":1},"iJH_dCfp3h0bRQ2tMtV2Ew":{"text":"I can't wait to return to Nola so I can revisit this place. It's amazing. I had the crab &","useful":0,"cool":0},"vQxAHht9-AiBocthRJ5xXA":{"text":"This is a great spot to people watch and kick back.  We popped in last year during our vis","useful":0,"cool":0},"Adi3OT7nTJ5MXFHcWFQNJA":{"text":"The calamari, curried mussel and ceviche are so good!","useful":0,"cool":0},"c5W1q9V6aeHVMADdjxGsOg":{"text":"This might be my favorite restaurant in all of NOLA - I just can't get enough! \nAnd it see","useful":0,"cool":0},"_3TAcGu8AvGffrneqtBp_Q":{"text":"I went here a week ago with a friend on a Saturday afternoon.  They were busy but not so m","useful":0,"cool":0},"NXDrniGg6lzBGf6ph-BZBQ":{"text":"Gel rest food. Best nachos ever. Drinks were fantastic and reasonably priced. Do the Rum d","useful":0,"cool":0},"T-ZWWoYYGLmqNQFDjWvQoQ":{"text":"Came here twice on my 5 day trip to New Orleans, it was that good. The chelada was a littl","useful":0,"cool":0},"F0AXRR5rjy3SxEKxOrJKwA":{"text":"I tried for the first time last night and was really impressed with majority of my food.\nI","useful":0,"cool":0},"q7i5mgL8HOVRL3i3r_7SUQ":{"text":"Great food Professional Service. Love the guacamole as an appetizer and the sangria get it","useful":0,"cool":0},"YFEaWB2sndzAxalIYhjJVg":{"text":"The food here is fantastic! Expensive but we loved it all. Queso and nachos were incredibl","useful":0,"cool":0},"-B5Nnp2sLllPcXJQqyNdrA":{"text":"This is one of those places that get it right every time! The drinks are great and strong!","useful":0,"cool":0},"wfARvQ1NKGz5m_sv-YNTgQ":{"text":"Excellent food.  We tried the Shrimp Rundown and BBQ ribs and both were scrumptious.  Melt","useful":0,"cool":0},"jvlqYtVlzttzE0KRRe40Pg":{"text":"Fantastic food and friendly service. The queso Blanca is very good. I liked the brisket ta","useful":0,"cool":0},"EJThxhQtOH9Nt6dfkPRinQ":{"text":"Spicy Flakey Tuna Ceviche Tacos. You WILL ignore them because they are on the appetizer me","useful":4,"cool":2},"p55xgMz9MG2K1-fkb0MQZg":{"text":"The food was delicious- we had the conch fritters and shrimp rundown.\n\nBrian was behind th","useful":0,"cool":0},"DJbRg0iWRlanzWxRgmmKnA":{"text":"Great seating for 6 top tables. Caribbean flavors with a twist. A little more varied and c","useful":1,"cool":0},"yfkj5u6fxmcM4-NhknvvYQ":{"text":"Very popular, so prepare to wait for a table\nGreat margaritas\nNice outdoor seating\nLots of","useful":1,"cool":0},"uT_55vT08b-WwFaJaeUyEg":{"text":"Place has a good vibe and an abundance of oversized TV's. College kids seem to always keep","useful":2,"cool":1},"KJFgVwuNnDYbnEnj9F5tMg":{"text":"Never in my entire life will I ever love tacos. I just always have an aversion towards the","useful":0,"cool":0},"1dii6fRPlKV5sckflo18sg":{"text":"Omg greatest mojitos and tacos, pick three and get the plantains. Bring all your friends, ","useful":0,"cool":0},"rLE_dasO3sWw_a8mRERSkw":{"text":"Always great food and great drinks at the Rum House. The tacos here are simply delicious. ","useful":0,"cool":0},"HuPXWKIuozgW7L18d_ox6w":{"text":"This place is great for Happy Hour: $2 beers, $4 Margiritas & Sangrias, $5 Mojitos & Paink","useful":0,"cool":0},"P6lWoyMoI6uAIrK8mrcXqg":{"text":"Met up with some friends here. We didn't know it was Taco Tuesday... but it turned out to ","useful":0,"cool":0},"h2pf2Pu7hX579HmGaV_Ldw":{"text":"Great food in an excellent location. Expect a wait on gameday or weekends, but that says e","useful":0,"cool":0},"Dxkf3WHMrOtqXDEA3jspGw":{"text":"A typical Americanized Caribbean restaurant. Nice wait staff but the food wasn't good.\n\nI'","useful":1,"cool":1},"_QrquIHkDjG3IpxvpIdoKg":{"text":"Great deal on Tuesdays can't beat $2 for any taco. Plus beer is $2 all day as well. Gets c","useful":1,"cool":0},"Jk5Tt0WJEpruA6vVnkSVcw":{"text":"I love this place, the decor, the dog-friendly outdoor dining and seating, and THE MENU wh","useful":0,"cool":0},"eKMf4oHeiZtmVk6jRGKvvw":{"text":"If you want to venture outside the French Quarter there are fun areas along Magazine  such","useful":1,"cool":0},"DsIC-m3MyZT2wlWpt77KWg":{"text":"Easily the best place I have eaten in 2012!\n\nRandomly walking buy after buying albs of cra","useful":2,"cool":1},"z2cOOlUdhMEQ5LQr6RyvaQ":{"text":"Queso is delicious and they look to have great drink specials. I tried 3 different tacos a","useful":0,"cool":0},"hZmqI2Nfyj8FuxjmvJ_KXg":{"text":"The nachos here... well, I don't really have words for how amazing they were! Go and try t","useful":0,"cool":0},"s-pRK1D4MEGY4mmu2ovvoA":{"text":"Great food, great service!  Todd made wonderful recommendations and we enjoed every bite! ","useful":0,"cool":0},"E4jq_yuBrHB_G_e_jmBGNw":{"text":"Really good food. The tacos are awesome, and there's a lot of variety so definitely get a ","useful":0,"cool":0},"lgbfCQtu7wreNmMhNFxvOA":{"text":"My mouth is watering just thinking about writing this review. That's how good the food her","useful":1,"cool":1},"BBSRsBmSwRqYuGIIrgwHvw":{"text":"Cold beer! Good tacos! And their house salade is sooooooo good! Was not expecting this! Wh","useful":1,"cool":0},"yr_R9E_QDsIQ_-hmiYaJnw":{"text":"Amazzzzzing but they should start taking reservations. Nobody wants to plan on eating some","useful":0,"cool":0},"shQJDjDEMFebgrqaVSLRNA":{"text":"Aside from the fact we as a customer had to wait for the host to finish her lovely convers","useful":0,"cool":0},"mK4mMuFOon2d0cDTrDr8Pw":{"text":"5 stars?  More like 5 thousand!  Seriously, this falls into my top five favorite restauran","useful":0,"cool":1},"vwIu5GV6PA2XLMx4EiYV3w":{"text":"Amazing weekday happy hour deals (5-6:30 I believe), delicious rum punch and painkillers f","useful":1,"cool":0},"FLEYYFfqAsmw32dwlrwN_Q":{"text":"We ate here for dinner. It was easy to get to. The food was great, the wait staff was supe","useful":0,"cool":0},"wa68vMSC6bI9qR3gFRZT_g":{"text":"Fantastic corn tacos. Very reminiscent of our times in mexico with fresh flavors and good ","useful":0,"cool":0},"lw-ilF2NCyJTVV789EXZNg":{"text":"On our last night this so far has been the best food we had out here in Nola if you wonna ","useful":0,"cool":0},"6X80CoLfGTTXJrYqgotHbw":{"text":"Fantastic. Food was excellent, Margaritas were exceptional and this place has a very cool ","useful":0,"cool":0},"sZ55ZLPmjYc8JPah9eb0Xw":{"text":"I am from New Orleans, living in Austin, Tx at the moment...on my many trips back I have t","useful":0,"cool":0},"RnwQXSpon8xuGtlzB8rEwA":{"text":"Tacos, service, and Margaritas are amazing. My favorites are the oyster, and shrimp. You r","useful":0,"cool":0},"3ClNFFM9HfKGZqcfc9I-rA":{"text":"My first time listing this place and I thought it was great. I went at 3:30 on Friday they","useful":1,"cool":1},"qw0Zj7T-lvZQCNN1-10ulQ":{"text":"I had the nachos during this visit and I wasn't impressed. It looked delicious, presentati","useful":1,"cool":0},"pdvv1i1WC3gHI9JJA2bCuQ":{"text":"Amazing drinks and delicious food! Come here every time I'm in town and am never disappoin","useful":0,"cool":0},"BpitHbJ3mX9A7oky-I_Drg":{"text":"Awesome tacos.  Great run flights and house rum drinks.   One the have to go places in NOL","useful":1,"cool":0},"Cr-vtx3KRg0db2f4yFEwJQ":{"text":"Flipping delicious. I live I Texas and eat at Rum House whenever I visit NOLA. The calypso","useful":0,"cool":0},"vFJq8e7hv1vMCygZCPnRAA":{"text":"The tacos were fabulous, the service amazing, their outdoor sitting area is great for peop","useful":0,"cool":0},"i2yZyRRZHCE-0T0H6YHX9w":{"text":"Wow. Yum. Mason jars for your drinks! Need I say more?\n\nGreat experience here. My husband ","useful":0,"cool":0},"26ScKO8d1xqGQ5a15yWO_Q":{"text":"The Rum House is known for it's tacos. Surprisingly, they also have hundreds of different ","useful":1,"cool":0},"iQBk5SegdUfyidNEjUnNfQ":{"text":"hit up Magazine street to get away from all the touristy stuff and glad we did because we ","useful":0,"cool":0},"nI-4PpoegHK_KJQQfuMnsA":{"text":"The server was horrible, they gave us drinks and left us hanging for 10 mins. I got an att","useful":0,"cool":0},"Lpnb5c6i-2FuJ04MXBqogQ":{"text":"Let me start off by saying this is one of my favorite restaurants in the city. The only da","useful":0,"cool":0},"qRvxVRNvzk15kJRh6oHDUA":{"text":"Taco Tuesday here is insane. The dining room is full, there's a line out the door, people ","useful":0,"cool":0},"bKKuICyOGTfoLsOyKqQjww":{"text":"You can't go wrong with anything on the menu! We even ordered a second round of tacos afte","useful":2,"cool":0},"Nfjvn_LZyEPSpyg1b4cgPw":{"text":"Dear Seafood Pepper Pot, \n\nYou are one of the best things I've ever put in my mouth! Thank","useful":0,"cool":0},"CfD4rMq4KIX_EINJCLgR3g":{"text":"Been here twice and both time was a fantastic experience. Plus I actually heard then read ","useful":4,"cool":2},"in6By8xmsEhuc9vHkh05DA":{"text":"$2 Taco Tuesdays!!!!!!\n\nIf you can get past the giant crowd and the long wait times you wo","useful":0,"cool":0},"IOwEkF11lzum67UED3OUYQ":{"text":"I dined here twice in one day. My friend and I stumbled upon it at lunch.  It was packed, ","useful":0,"cool":0},"TF-3xryG6fi6z5lFs0JpJA":{"text":"After hearing all the hype about this place, my wife and I decided to come here on a rainy","useful":1,"cool":1},"PWwV-5p7n2sG5Cb2vtDQrw":{"text":"I love the Rum House.\n\nI've spent a lot of time in the Caribbean (six trips, most of them ","useful":0,"cool":0},"andO4hHuz5na2Dkjexfo3A":{"text":"I was a bit concerned by this restaurant's commercial vibe, but the food really delivers. ","useful":0,"cool":0},"eC6CpqpvQWzMy3AL8AQXHw":{"text":"Went on TACO TUESDAY during HAPPY HOUR! Yumm! \n\nWe were seated within 10 minutes for a tab","useful":0,"cool":0},"RmjVGIx6e1bhoOt3ly_IRg":{"text":"I know it seems like I give every restaurant a decent review, but what can I say? I know a","useful":1,"cool":0},"Rl71EQDWNK73LDQWyeHgQg":{"text":"On Friday, 9-27-2013, my to go order was given to someone else by accident. The manager on","useful":0,"cool":0},"lKu4TSr7sM2QTXMGIXRRsw":{"text":"My friend got the seared tuna salad and loved it.  The Mac and Chz was the worst I have ev","useful":0,"cool":0},"qlFKpv9-tZuLz6Pqb_4Dmw":{"text":"Great experience. Very friendly hosts and servers, great drinks and food. Speedy service (","useful":0,"cool":0},"z6UbSVfTXC8nNOPsTmbf7A":{"text":"KEY LIME RUM PUNCH!!!!. I had been wanting to try the Rum House since I had a chance to vi","useful":0,"cool":0},"GZEay-p6saSckJp4XGwQLw":{"text":"The Rum House was really amazing! I had a Pina Colada which was THE BOMB & my friend had t","useful":2,"cool":1},"TbOvxaHveWlikwyP9jijUA":{"text":"Drinks are delicious and happy hour is the best on town. Taco Tuesday was $2 tacos and bee","useful":0,"cool":0},"2RaySo3LAJBdpWf0DFkqvw":{"text":"First time here and loved it. Decent drinks but the food was great.  Avacado, calamari and","useful":0,"cool":0},"8EXXOxPlnjB4NTqOv5UmYw":{"text":"It's true, the tacos are great, but my favorite dish is definitely the Seafood Pepper Pot.","useful":4,"cool":0},"LoBgPuAIaKahi1qA0YkLUQ":{"text":"The atmosphere is always great as well as the service!! You have an option of sitting outs","useful":0,"cool":0},"1h7V0358fNyRWhbKMWZegw":{"text":"Um, all I can say is FRICKIN' AWESOME.  Amazingly good food, wonderful flavor.  You have e","useful":2,"cool":0},"J1D8DlpgJyceCSBCvuqMGg":{"text":"Great drinks, good Caribbean style tacos! The damn good nachos are what you want to start ","useful":0,"cool":0},"ga1ARi1URLUtRJLN0AzBZA":{"text":"I've been to The Rum House three times since I moved to New Orleans and it's absolutely on","useful":0,"cool":1},"e7eJzEAqwar4NmTVPJ5Agw":{"text":"I understand it's The Monday before Mardi Gras but waiting 45 minutes for cold food is una","useful":0,"cool":0},"mvM0Wa9dKnWUhWAexbgJvg":{"text":"I usually come here and order the Jerk Chicken (Damn Good) Nachos. Yes, all to myself beca","useful":0,"cool":0},"OyyVWX9u4dCFCxie5Hu00w":{"text":"Love this place we go all the time. Great Caribbean flare. Go on Tuesdays there is $3 taco","useful":0,"cool":0},"Xtz8Ybnp6uR2Nil7OS3RkQ":{"text":"I don't think I ever leave this place disappointed, or sober. This place is always packed ","useful":0,"cool":0},"9JT6l4cWLq0y8v_WOFiRNw":{"text":"A great stop off Magazine street!! We enjoyed sitting at the bar and started our lunch off","useful":0,"cool":0},"pdl1ehwNbeJuC39hzhMEfQ":{"text":"Our tour bus driver recommended this place and I am glad we gave it a try!  It was delicio","useful":0,"cool":0},"HmXA5ZxNadMXTM8diF6O4Q":{"text":"One of my favorite places in town!  Last time we went we had the jerk fish plate, it was s","useful":0,"cool":0},"FMqfmazKZ6dBnZZPmxYlTg":{"text":"Cool spot to go and hang out and people watch. Painkiller was delish, tacos were pretty mu","useful":3,"cool":1},"oFKXO_UCxnEoMF9AYuoXTQ":{"text":"This place was delicious!  My brother lives in NOLA & took us here. We had the damn good n","useful":0,"cool":0},"q4MDAOpJh921VOQzfllauw":{"text":"I've been to the Rum House on two seperate occastions, the first time i went it was preety","useful":0,"cool":0},"cEJ9lPx7SqjCj7NE2I6YJA":{"text":"A bit pricey, but the atmosphere and the food are amazing! We had the Lamb, Chili glazed s","useful":0,"cool":0},"zKGoDIR8Fw59uLmDfaf67A":{"text":"This will be brief:  so many items sounded appetizing on the menu, but I opted for the Cra","useful":0,"cool":0},"_TevxBOau4cm4bwGGhJNEg":{"text":"I haven't decided but I believe the only reason I visit Rum House is for Taco Tuesday. Sma","useful":1,"cool":1},"DpjHcYTf5QoePq-it6buyA":{"text":"Best mahi mahi salad in fact everything is good along with the tacos and service","useful":0,"cool":0},"VZMHuZoitTuGwQA34OGuSQ":{"text":"Oh, this place is a treat to go to. But it's not the kind of place you'll want to visit to","useful":0,"cool":0},"2BH-lVqeqxVQLU8_mqJ4ww":{"text":"Consistently delicious food. Service? Not so much. I think that's what happens when you hi","useful":0,"cool":0},"Dz9K6g-0i6IOjIA9oni6ng":{"text":"Flavor all over the plate.  Good location for people watching. $value? Excellent","useful":1,"cool":0},"N_q2YSbu4427T9HFtgQ2ww":{"text":"Taco Tuesdays at Rum House were hallmarks of my college experience.\n\nThe good is delicious","useful":0,"cool":0},"bxaY8PjpfdxNm4Yj1diykA":{"text":"This a great place for a variety of tacos. I had the calypso beef and was really good. The","useful":0,"cool":0},"rSqyqz-hSv8kWl8a6nJ83g":{"text":"This place never disappoints me. Wonderful food, drinks and people. I love The Rum House!","useful":0,"cool":0},"Q1DnAkbpDh9ds-TjvsoUgw":{"text":"Everything about this place is amazing! My favorites: Brisket Salad, 4 taco combo with pla","useful":0,"cool":0},"X8W4Hpl9h1dkwP9zEpe7Zg":{"text":"Stopped for drinks and grabbed a table outside and was told to leave. Very rude service!","useful":1,"cool":0},"u4oSptjZGJBaui5yX1vbFg":{"text":"You have to love the variety of taco's on the menu. The cocktails are a plus too. If you a","useful":0,"cool":0},"0CuiAXjUdPzTHJ_Avrx0qQ":{"text":"We looove The Rum House! It's one of two places we visit absolutely every time we come to ","useful":1,"cool":0},"UcKJvF0GaH2Qp493hSBb-Q":{"text":"I had the big taco plate, which came with 4 tacos of my choosing, a \"beef patty,\" and a si","useful":1,"cool":0},"C-utVkfn7jYGyg60ivlkhQ":{"text":"I took my parents here after leaving another restaurant b/c the menu didn't look appetizin","useful":1,"cool":0},"h-O-0kZnbUI9IN1xedbxPw":{"text":"Came here on a busy night and it was evident the place was popular. Got seated pretty quic","useful":0,"cool":0},"q7wfOvdDJ7tVzCtQrJMzIw":{"text":"My wife and I came for our first visit to New Orleans and this was our first stop. I'm so ","useful":0,"cool":0},"eguztSFSq62Ca8-EBNtX_w":{"text":"Great place for tacos (especially on Tuesday). I had four: brisket, lamb, jerk chicken, an","useful":0,"cool":0},"FoJ5B3yE-HCPbCu27ilmWQ":{"text":"Loud and casual - lots of flies, even inside. But the food was good - spicy but not too ho","useful":0,"cool":0},"iLIhie9CvBK9oiQsH9o5eA":{"text":"Most awesome tacos ever! They're two dollars on Tuesdays but be prepared to wait, it's bus","useful":1,"cool":0},"JJ0MrnCRIUTG12OUHNfDqg":{"text":"Highly recommend this establishment (ask for Sarah she is the best)! The tacos are great, ","useful":0,"cool":0},"uSTmOZ6lnQ9NMrfdPDoj-Q":{"text":"Hands down best tacos in NOLA. This place gets crazy busy during peak times seven days a w","useful":9,"cool":7},"-gTwL5mWyE1PNCwi34U27g":{"text":"Great food and rum selection. Enjoyable atmosphere and attentive staff...except there were","useful":0,"cool":0},"x01zLDjcRrJ8ne8A9KCUQA":{"text":"RUM HOUSE!!! This place is amazing. My husband and I are military and we have Lived in Nol","useful":0,"cool":0},"HnHFJMvHeSEBOMTJqCpwAw":{"text":"Very good food! Tacos and polenta were excellent and the painkillers were awesome too!","useful":0,"cool":0},"WMT3kLmCarjGv826n_DNvA":{"text":"I didn't know what to expect when I walked into the Rum House. A friend suggested we stop ","useful":0,"cool":0},"fnjRG4I7ropN69uwDjs9EQ":{"text":"Great variety of tacos, yummy queso, and tasty margaritas. What's not to like?\n\nCame in fo","useful":2,"cool":1},"jvkIpHQFGW-c5j9j-cESHA":{"text":"I visited for my first time on a Tuesday night.  I'd read about the $2 tacos and $2 beer w","useful":0,"cool":0},"AoPHN1XWr0nRtJLMJ0XWzA":{"text":"Awesome caribbean inspired Mexican food. I could live off the pork nachos! The gourmet tac","useful":1,"cool":1},"El2ja3YiSA08ThLkDD-4Ww":{"text":"Food was amazing!! The server was professional, But...very rushed, and definitely not, \"Ir","useful":0,"cool":0},"PPk2DKmTfSKPVDCCsLb1ow":{"text":"GREAT service and great food.  Was visiting New Orleans for the weekend and I think this s","useful":0,"cool":0},"fZvdpERi1ZC-xTTAoUTHkw":{"text":"Food was tacos - tried the rasta, fried oyster and lamb vindaloo and all three were great.","useful":0,"cool":0},"nkjQ-O3pSCf92MhVh_YNAA":{"text":"Amazing taste! Definitely get the avocado and mango guacamole. \n\nMargarita is awesome too.","useful":0,"cool":0},"LGF6aw2XkMzweiydkqcubw":{"text":"Ball jars are perfect for thirsty customers!\n\nTacos are good, but don't miss out on the Ch","useful":0,"cool":0},"31iHL2FJKXpUmCbYBolr7A":{"text":"A great place to stop for drinks! My first time there, my girlfriend and I got the fish bo","useful":0,"cool":0},"pCRcQH_BOl4XxYGJKQ90cw":{"text":"Food is mediocre at best but the pina colada was amazing!  Not sure why they're is always ","useful":1,"cool":1},"SVwPl4VuEbu6xYmtcx14hg":{"text":"Delicious tacos, strong drinks.\n\nThe word is obviously out about the place because it is a","useful":2,"cool":0},"owV6EDWThkvKzovTt8nSig":{"text":"The food was great and the service matched it. I came here last month with a group of frie","useful":0,"cool":0},"SO3nnU_tjpXGWGd6p-IrGw":{"text":"The restaurant has a good selection of food.  I had the flank steak salad with blue cheese","useful":0,"cool":0},"mkXd0xPjgM0jIApjD4jmjw":{"text":"I went here last week while visiting New Orleans. The food was incredible. The restaurant ","useful":1,"cool":0},"eZgo3MtIkrp9t_VZs2DTLQ":{"text":"I love this place. Great drinks and great food. It's good for big groups, or small. I try ","useful":0,"cool":0},"EQm6Xzmqs04iWV-KO_thwQ":{"text":"Super packed for taco tuesdays and happy hour so if you're going with a spouse you might j","useful":0,"cool":0},"8jd-RIITM8FrCGpBLSvmUw":{"text":"Sat outside and had delicious duck tacos and painkillers, this place is always packed.","useful":0,"cool":0},"NOlUbBq9MrZUWZqMnHWVxg":{"text":"This place was mad good.\n\nAll three of us had tacos of varying descriptions and tasty side","useful":0,"cool":0},"kFNinNfTKv110A0UpEnH7w":{"text":"Food and drinks were great. Loud but fun atmosphere!  Had a variety of food and all was ta","useful":0,"cool":0},"LmcopE8Kaz2mp1esTxUQIA":{"text":"Back again for my first meal of the new year. I was more so persuaded by my cousins becaus","useful":0,"cool":0},"zip80JVUaOJtZAwzL45zqQ":{"text":"Mmmmm. The tacos are super creative and tasty. I love the scallops with caramelized onions","useful":0,"cool":0},"2rcmg7GwQVmSD7DGV_LPFQ":{"text":"What a delicious place! We started with the mango guacamole, which was out of this world a","useful":0,"cool":0},"gKL01ktXRy_R5HxIJKLwfw":{"text":"Delicious food and the service was impeccable. This will be a regular outing for us. Outdo","useful":0,"cool":0},"quDKxRYGA_2a4fbio5_PNw":{"text":"Try the pork nachos they are freakin delicious. I get them every time we go. The ceviche t","useful":1,"cool":0},"M9_SHgibwNRItjqqdAIWzg":{"text":"4/5 worth the wait, and hits the spot\n\nso when i think of rum house, i actually think of t","useful":7,"cool":4},"F23tut59yLjoH3hG7Tzegg":{"text":"This place will change your life.  From the ambiance to the friendly staff to the AMAZING ","useful":1,"cool":1},"ieEMiy4epDHVfbiFn9cdtQ":{"text":"Had the Two Dat tacos paired with sweet potato chips and fried plantains. I chose the Creo","useful":0,"cool":0},"0-IkfFEP10I9FLDQ61Kysw":{"text":"My friends all seem to flock here for \"Taco Tuesday\" so my interest was peaked. I happened","useful":1,"cool":0},"Pe-a_V1SM0kC-4EpZ1v_gA":{"text":"I have been going to this restaurant since it's opening. And for the past year or so it ha","useful":0,"cool":0},"Arj0VXTedXcPJ9UC4b0mrQ":{"text":"Tacos, Tacos, Tacos! This is a very biased review because I love tacos and this place has ","useful":1,"cool":0},"6vRHoEgEda2nrkSefiUHHA":{"text":"Other than the terrible wait for a table, they have the best gluten free options I've ever","useful":1,"cool":0},"V9j6t1RBoRCJvT-PU3-tPQ":{"text":"Ok I seriously love the rum house. It can get busy and you may have to wait for a table bu","useful":0,"cool":0},"UfFNrfdy0jDxHq9PF8IttA":{"text":"Nothing could be nicer than sitting outside at the Rum House, sipping happy hour margarita","useful":0,"cool":0},"YDbIvpRNa2zBuhGsL0lrWw":{"text":"We are from out of town and came for taco Tuesday (all tacos $2 and some draft beers $2). ","useful":0,"cool":0},"AoNfJm-jBqemOZaFFa89vQ":{"text":"A friend who lived in New Orleans for a time, recommended The Rum House to me when I was h","useful":2,"cool":0},"XYGdRCcHDMrkyZCKyi0odQ":{"text":"Overpriced for the mediocrity that is the food. It is a great spot with a great atmosphere","useful":0,"cool":0},"C-l6St-mg0t0e6-e2rNzKw":{"text":"Everything we ordered was great. Nachos were incredible and large. Avocado mango appetizer","useful":1,"cool":0},"JteLtwUnWejtamBbyUVC_g":{"text":"OMG they have painkillers here!!!! Waited for over an hour which they said was unusual for","useful":4,"cool":5},"6kfTSUGfIvShJ28DYGMZxg":{"text":"First off, I would like to say that I have many friends who absolutely love this place. No","useful":2,"cool":0},"ahLw97P88lvgCtALSWMFug":{"text":"This place is pretty phenomenal. Everything is made from scratch and very fresh. I ordered","useful":0,"cool":0},"Gy0Gvlr_d7-MMQqzQVVJLg":{"text":"I really like the rum house, especially for taco Tuesdays. The roti is delish as is the ja","useful":0,"cool":0},"qhQteEpDBYvygqvhin_28A":{"text":"Great food, great atmosphere. I love just about all the tacos with my faves being the frie","useful":1,"cool":1},"0x4gglctzv9ExyAmn63v6g":{"text":"Best tacos I have ever had. The flavors are unreal. I don't know how they can pack so much","useful":0,"cool":0},"9tMQdSOi713OMyZEtXozzg":{"text":"Ambiance: nice because of the location, wall full of windows, option of outdoor seating an","useful":0,"cool":0},"BwYs0spP0G3-xpZBJvznVg":{"text":"- The melted crab and cheese sandwich is fantastic!\n- Rum and coke is great, mostly rum - ","useful":1,"cool":0},"EAQNbVXK_2Q1nyMkow6PLQ":{"text":"Lets just say it was super load! You couldn't even talk to the people you were with. It se","useful":0,"cool":0},"w1vHa1O5yZ494dzv03AdPg":{"text":"Jerk chicken tacos.  Mmm. Really like this place, dont get to Magazine Street often enough","useful":1,"cool":0},"VnE_2nxItJXuDf0cb4pdtA":{"text":"Delicious as always. Been here twice and a must try are the tacos,loaded nachos,and banana","useful":0,"cool":0},"sH69eFg0eZZ2G2DoKWEsJA":{"text":"Had a fantastic meal! Fresh spinach salad and delightfully breaded fried mahi mahi. Great ","useful":0,"cool":0},"H0hAY4-tNm9eY8ceMNQz-w":{"text":"I love this place.  I tried the oyster tacos which fantastic.  If you want real carribean ","useful":0,"cool":0},"T1WgK6kc6MMXh7lBYipuTg":{"text":"LOVE this place! The nachos & cocktails are the best!! However; Service is super slow!!! A","useful":0,"cool":0},"iAzHTizPMFTBe-6MeYd1JQ":{"text":"This place was crazy packed when we got there, but we were seated pretty quicky. My sis an","useful":0,"cool":0},"OAYeduitQSwq9175oBxFtA":{"text":"I've been to this place 3times, never blown away and never satisfied. I love the idea and ","useful":0,"cool":0},"avjY-yJFdT31y3HUduPyQA":{"text":"The best meal that we had while visiting New Orleans. The service was great and the food w","useful":0,"cool":0},"tD4Wq4QfFTET7oEqOCcyLQ":{"text":"Wow. AMAZE. The food here is incredible ... the menu has a full offering of appetizers, sa","useful":1,"cool":1},"03nSS5sg9eky-ulYjbgC9A":{"text":"Grab some blood marys to-go before you start shopping on Magazine Street! Happy hour price","useful":0,"cool":0},"1kUbZwhAgt4qD4AN-ck4wA":{"text":"Not too far from the main drag of Canal Street. We read plenty of positive reviews and dec","useful":0,"cool":0},"Y9t6rklFuan7ixdsoFg6wg":{"text":"Two words: taco holders. (taco stands?) What a genius idea. I'm sure these are not unique ","useful":1,"cool":0},"XDL-sNoc9Xjc8-ekudNk4g":{"text":"This is my new taco/caribbean food spot. The tacos are amazingly good. Sauces are great. T","useful":2,"cool":0},"WTshIVbfU4dVPERp7qRCCA":{"text":"Rum House is one of my go-to spots on Magazine Street. There is almost ALWAYS a wait but i","useful":1,"cool":1},"uY8eb7TrHiy_f0m2aLkXnw":{"text":"I guess my rating of this place would depend what day I'm eating here. On a Tuesday, defin","useful":2,"cool":1},"tFXA5OJ32FL9r3AHDPKCTQ":{"text":"Around the corner from our AirBnB and it was great! Robust drinks, decent prices and prett","useful":0,"cool":0},"JIQch-EwwheU_RqrOvhEvA":{"text":"My boyfriend and I went to this restaurant for dinner based off another friend's recommend","useful":1,"cool":1},"tDzTmfLqs_AbxG6dYSkwNQ":{"text":"A+ 100, all around great, two thumbs up from egret and Rupert! Everything is phenomenal he","useful":0,"cool":0},"H3Xyd7Xt8MixvP475LM-Ig":{"text":"Big Plates! If your looking for Spanish-Caribbean Cuisine, look no further! The nachos are","useful":1,"cool":0},"hby8fWAFH1aZLA7pyUCm_w":{"text":"Excellent service!! Our waitress was excellent and very attentive. Thanks Morgan :) The pl","useful":0,"cool":0},"RdVXt5YjFVU852kR8FIPFQ":{"text":"AMAZING!!! The food was out of this world! we got 6 different tacos and all 6 tasted diffe","useful":0,"cool":0},"jIwSZR5W33zBvf1_Rk4aoQ":{"text":"They weren't lying when they named them Damn Good Nachos! As my friends and I were standin","useful":2,"cool":1},"aHTohFVHmfHgHD9rKmi7sg":{"text":"Stopped in for some drinks and dessert. \n\nCoconut mojito was amazing! My family also enjoy","useful":1,"cool":0},"j4Wyh78gG8kGmK6aFtAbaQ":{"text":"Love the Rum House! Is it authentic...no. But that doesn't take away that the food is deli","useful":0,"cool":0},"BAVKFtZDXsp1sQlHEOcrQQ":{"text":"Pretty tasty food.  But this is sort of the Disney Land version of a Caribbean joint.","useful":0,"cool":0},"0U-LFw8uKfzlpci3dvt_CQ":{"text":"This place has an amazing happy hour from 3:00-6:30 $2 beers and drink prices ranging from","useful":0,"cool":0},"2hYr4EmOZXnYmsN1N5MXfA":{"text":"This is truly a inspired Caribbean & Latin American cuisine it is a must to order the taco","useful":1,"cool":3},"bBdSunmoddHZMUAdwCrPXA":{"text":"Lamb vindaloo tacos: I love they have a Goan-influenced dish on the menu, definitely try o","useful":0,"cool":0},"Gt2KtaoAh5e78PcG_DGhfw":{"text":"3.7. Great Pina Colada. A perfect mojito - my favorite drink. Fantastic tacos/fusion taco ","useful":0,"cool":0},"FKcZW4DkvAyCgQXiF5NjWA":{"text":"I ordered the pollo asado. Woooow! So delicious.  I eaten in many many Caribbean places an","useful":0,"cool":0},"B4Bn-zvCx2UGPz0l465RGA":{"text":"This place was a lot of fun!  Yes, \"fun\".  My sister, mother & I took a long weekend trip ","useful":1,"cool":0},"Lbel9qPzYSRPNxKGPMBFzg":{"text":"If you have never been here you gotta go. Went to New Orleans for a week during Halloween ","useful":0,"cool":1},"5PgYAU6VeXF6TlNDZ6s3uQ":{"text":"After seeing good reviews on yelp about the Rum House I looked forward to visiting to try ","useful":1,"cool":0},"DRNV4sNHfzJbCsPjGOmZPg":{"text":"A great find for food, a funky place to hang out. Definitely do again. We were looking for","useful":0,"cool":0},"1GSfE6pCoYn2WC_oYiu_Cg":{"text":"My most frequented restaurant in NOLA!! Rum House has brought a taste of the Caribbean to ","useful":0,"cool":0},"iaGkxPkbh5yCIlLUTL_h7g":{"text":"Great spot for a beer at the bar, but also for dinner!  We stopped here to fill up on nach","useful":0,"cool":0},"UVbuhF7AeX-MjlcpPEi1oQ":{"text":"allergic reaction because the mojito was muddled with something that had a berry in it, th","useful":1,"cool":0},"BpHN7faWHmK180XXu-yT1A":{"text":"Great time on Taco Tuesday. There was a minor problem that the server quickly corrected.","useful":0,"cool":0},"ERBoRIq63tXFO6Q2RFZ3cg":{"text":"The tacos were amazing. You definently should order the plantains.  If you've had actual m","useful":0,"cool":0},"neKe0SoxlX-XEqykTCKHJg":{"text":"I didn't know tacos could be so good until I had these Caribbean tacos. The skirt steak on","useful":0,"cool":0},"MwK81tPz7wQO6fR688hRwQ":{"text":"Unfortunately we now know more about the staff's private lives, current pending drug charg","useful":3,"cool":0},"HD-8W8ajIyNhDFAaDL2gjg":{"text":"The Rum House in NOLA is the spot my cousins (locals) chose to meet with me after a decade","useful":0,"cool":0},"jFENpb4aqrsdRJmn8t6I4g":{"text":"Margaritas, jerk shrimp tacos, great beer selection...Yezzur!\n\nAll the drinks here are del","useful":0,"cool":0},"fGWTnbfExdpsq4TUCbulFg":{"text":"Consistently awesome... I crave this place. Great drinks, and amazing tacos.  Indoor seati","useful":0,"cool":0},"WhZAfW1IgEfa8LU_yamlwg":{"text":"I was stating in the French Quarter for a few days. We were sick of the typical Bourbon St","useful":0,"cool":0},"ef73yJ_uwvCqCD4a4wVwRQ":{"text":"Mediocre food, terrible drinks, ok prices. This place is basically a hipper Caribbean Appl","useful":7,"cool":1},"fTklYb2jmuC4O4Bsav1Gtw":{"text":"Rum House has some unique and delicious tacos. If you get the Damn Good Nachos, you won't ","useful":0,"cool":0},"M0GWxCmS82FEbYzU7ZrqbQ":{"text":"I wish I could give half stars I rated 4 but it's more like a 3.5. This place is the good,","useful":0,"cool":1},"cSiwnA5xl-a_i7xxd8730Q":{"text":"Place was OK nothing special. Had the trifecta taco plate with the best one being the oyst","useful":0,"cool":0},"e5_yRrLN7oEh3bDSO19NPg":{"text":"Great grub for lunch.  We tried 8 different tacos (I think they have 12) and all were good","useful":0,"cool":0},"6tKAJCJSRmvFJfG4RASBTg":{"text":"Bread pudding and Tacos are the bomb!!!! Try the Lamb and Duck tacos. The staff was great ","useful":0,"cool":0},"-D4kenpb3Ogv8s0PeGJuXQ":{"text":"A very nice rum island themed restaurant with a menu to suit everyone from carnivore to ve","useful":1,"cool":0},"tQ_s4j6Bwa2gaeD1pW6AQQ":{"text":"The fried calamari is delicious and comes with a dipping sauce that is the best ever!  The","useful":0,"cool":0},"tg4LNwcuNt1wGMv8OV9UuQ":{"text":"My boyfriend loves tacos, and we decided to go after hearing from my friends all of the re","useful":0,"cool":0},"7-p0ShcPLPayAC-aPp_UXQ":{"text":"Great casual spot to grab a drink and/or food right on Magazine Street with options to sit","useful":0,"cool":0},"jkzwTeBMecIEo42FqVCOWA":{"text":"This place in awesome for Taco Tuesday!!! However, if you choose to dine-in on a Tuesday e","useful":3,"cool":0},"gBzF7Tp4sd1igrXFDlWhiA":{"text":"This place is super overrated. The Taco Tuesday situation isn't all bad though, but it's n","useful":1,"cool":0},"hKlxIt9ahNspZlyhz22V6g":{"text":"Yum! The avocado dip is really tasty and isn't your typical guacamole. I also had the Mahi","useful":0,"cool":0},"tDt-zpvoedTmSi8UQixFHw":{"text":"Not even kidding when I tell you that I eat here at least one a week. The wait can long bu","useful":1,"cool":0},"5e7ov4NqT7j0go7DuCjqTw":{"text":"Must try, tacos are delish. The french fry one and grilled pineapple over pork were our fa","useful":0,"cool":0},"Uf7L804oEGIA2M_DsztRRA":{"text":"They have good portions and strong drinks. Not touristy like French Quarter restaurants.","useful":0,"cool":0},"_hSfCcXanY2NlYI38McXHQ":{"text":"Had the shrimp chili, jerk chicken, and calypso beef tacos. As other reviewers have said t","useful":0,"cool":0},"Zuo1kEP-GjBl3mgd7WcCEA":{"text":"I was very excited to get a new restaurant in my area.  My boyfriend and I couldn't wait t","useful":1,"cool":0},"KYjrBMPecdBkb1-u6zbsKA":{"text":"One of my favorite places to grab a bite, and drink of course, on magazine street. Their m","useful":0,"cool":0},"jihJq7fOKzadRSwH_wYUhw":{"text":"The go-to place for millennials who want to be served Chili's food, cold,  by inattentive ","useful":3,"cool":1},"yxLeb8R6zz7FpUHt0NO7dQ":{"text":"Taco Tuesday - $2 tacos!  I really like the honey glazed shrimp taco.  \n\nThe Mango Guac is","useful":0,"cool":0},"9kNamFTKrGn4BJGfovCbyw":{"text":"Must eat somewhere that offers something home doesn't. That was what we wanted to do while","useful":1,"cool":0},"flmM-61BOC8OOrb8YYJZGQ":{"text":"I love this place. They have awesome food & the ambiance is amazing. The prices are really","useful":0,"cool":0},"O3-6D86g4RJf3R2lKX4s7Q":{"text":"My friend and I split the four taco combo - instead of the beef patty we asked for more pl","useful":0,"cool":0},"Vm1bV-PYlPMZPTfKtVNYIA":{"text":"Awesome tacos NOLA style. Had the trifecta - 3 tacos. I chose oyster, jerk chicken, and be","useful":0,"cool":0},"nTyYazn6x1MQ9qU4xGR09A":{"text":"Came here during mardi gras on a recommendation. Turned out staff was incredibly rude. Too","useful":0,"cool":0},"4Q71ats8sNVZdz77UQRu0Q":{"text":"Great Caribbean food with a NOLA vibe.  Try as many things as possible! Amazing drinks and","useful":0,"cool":0},"hfeVxJcSemhV6caO7JXUUQ":{"text":"High quality, fresh ingredients, a decent-sized but not overwhelming menu.  There is somet","useful":1,"cool":0},"7SkyuMdXeO5QyhHvGjgNQw":{"text":"This was one of my favorite spots when I went to the Essence festivals. We had the best ba","useful":0,"cool":0},"uXzRTQCsspyE4fFY2VjksQ":{"text":"The Rum House is a fun, casual spot on Magazine Street in the Garden District. They have a","useful":0,"cool":0},"8MLMCvAwNvBwmGBTdGf3YQ":{"text":"Tacos, Mahi Mahi Fingers, Queso and Margaritas are on point! Just so you know none of the ","useful":0,"cool":0},"tt-4vmyEIM6koTMlieYiMQ":{"text":"Stopped by for a drink and to grab a bite. Cheese dip is really good and had a fried oyste","useful":0,"cool":0},"K7JiwksOWkxBec5Z0Le_ng":{"text":"Love this place. The Mahi Mahi fingers are awesome. Great atmosphere. Many great choices o","useful":0,"cool":0},"qCJ_uR9Z8IiN_pNahqVhQA":{"text":"It's easy to become trapped in the French Quarter if its your first time in New Orleans. S","useful":0,"cool":0},"Qu_cewwJKrGmaZxFE_wRHg":{"text":"Great place for small and big plate Caribbean inspired tacos, etc.  Enjoyed the pitcher of","useful":0,"cool":0},"nxbYCUsAyUEUilR0dkPAVw":{"text":"My favorite ingredients are avocado, any kind of tomato, corn, you get the idea. I was ver","useful":1,"cool":0},"gT5uDPvKadM19BD4jFr7BQ":{"text":"This is a great spot to enjoy $3 tacos every Tuesdays. With over a dozen varieties to choo","useful":0,"cool":0},"LHWh0HaJKTQ-djZKVXAdPA":{"text":"I'm here trying the Lambsbread Taco which is Caribbean inspired. It's amazing. Great contr","useful":2,"cool":0},"7OaBA38uUNkzP6r7ZckIvA":{"text":"Everywhere I went in NOLA I had great food and this place was no different.  I got the jer","useful":3,"cool":1},"iSpCi41rKCmlX42y-Sh9MA":{"text":"These tacos ($2 each on Tuesday!) were actually the best tacos of my life...ever...of all ","useful":0,"cool":0},"Fhz5BzZ8bxpBzSN3Y5uOqA":{"text":"First time here and I loved it. Came in for taco Tuesday. Their two shrimp tacos were my f","useful":1,"cool":0},"H1FbOP7FblWTKSxiV-Mv4g":{"text":"The jerk fish is to die for!!! It was soooo good we don't know what else to say but \"soooo","useful":0,"cool":0},"Efu1itsAnZOub6erLDb76g":{"text":"The Mahi Mahi was sooo good but the dipping sauce MADE this dish. Ginger and honey. OH MY ","useful":1,"cool":2},"SPYbWb-HaxNHj___hGZfig":{"text":"I have by now set a routine of bringing all of my out-of-town visitors here for a meal. I ","useful":0,"cool":1},"nxv2C_JzGNXXZRqFz1gVyQ":{"text":"A different cuisine than your normal New Orleans Cajun flare, but delicious! We went with ","useful":0,"cool":0},"sZ30zZEegAKdZ17aNv0QPQ":{"text":"Service is good. Drinks are delicious get the painkiller.  Nachos were ridiculous.  We bar","useful":0,"cool":0},"FiOcA5KKvYiP657eukbkeQ":{"text":"My friends and I waited an hour and 40 minutes on a Tuesday night to have tacos here. The ","useful":0,"cool":0},"GIHya0Tonfq8siIbDvmnNw":{"text":"The Damn Good Nachos are big enough for about four people. To eat as an entire meal. They'","useful":0,"cool":0},"_o6LJJKsvRdscDZSltmgNg":{"text":"Came in on a weekday evening and was seated right away. I guess happy hour had just ended,","useful":0,"cool":0},"w46FK-Wj-o56GJvEunARZQ":{"text":"Taco Tuesday!  This is a fun place to hang out. The food is good, drinks are fine, and the","useful":2,"cool":1},"teB9c6QTZ6cg8lpKbJrOXA":{"text":"Went in on a Sunday late afternoon/early evening. There were 6 of us. Four of us had the t","useful":0,"cool":0},"r9vEjFv0f9NWKPrDRrABcQ":{"text":"I would to say that the best thing about this restaurant was the outstanding customer serv","useful":0,"cool":0},"NnRJXjM0X0S2q-zWxgYcCQ":{"text":"This place is always packed when I'm around this area. It's very lively with margaritas fl","useful":0,"cool":0},"6z9wym9Fn2nSnbDAYDBPkQ":{"text":"I am in love with the chili glazed shrimp tacos and mac and cheese!! And as always have de","useful":0,"cool":1},"i1Xg_ZsnBvjwIDTB0cAcrQ":{"text":"This place is a great example of how to run a restaurant/bar! Highly impressed with our ex","useful":1,"cool":0},"wG-xhDae75sBMZZdElmthA":{"text":"Long wait, super slow service for just ok drinks and food.  I have to admit those people i","useful":0,"cool":0},"okIVwF7BLLduqFYiH8yQjQ":{"text":"Came here for what amounts to a late night meal in New Orleans.  I had three tacos: lamb v","useful":0,"cool":1},"iZidMHq4qhJVB3NE18fGZQ":{"text":"We came on Taco Tuesday. $3 tacos! Filled with a nice amount of food. The key lime pie wit","useful":0,"cool":0},"czjPRl9P5MixJNFZVzDLjw":{"text":"We stopped for happy hour the other day and got a couple of drinks - the painkiller is str","useful":0,"cool":0},"Zw0kDEwzdGJ_w6H3TlfYRg":{"text":"The Rum House never disappoints as far as quality of food goes.  Their tacos are absolutel","useful":1,"cool":0},"vBJksu72aSemtV9ml0gL4Q":{"text":"Great beef and brisket tacos. Had a delicious raspberry mojito and house margarita. Had to","useful":0,"cool":0},"e28gPinnBS2nO_-ohdrDSw":{"text":"Awesome place,  always great food and good service.  Very casual with the outside picnic s","useful":0,"cool":0},"HCUgPa2oSEZtKHfaIfgReQ":{"text":"Loved this place that we found when passing through the area, whilst on holiday in New Orl","useful":1,"cool":1},"ap7u4zjovLVTtsQ6zzS5dQ":{"text":"Great food!! Loved the painkiller drink, also the nachos, flavorful and not too heavy. The","useful":1,"cool":0},"_tFx0wYObJgl2LhcIlxfJA":{"text":"Great place to have delicious, tasty, non-fried food in NOLA! Tacos are delicious! There's","useful":0,"cool":0},"4AQpreOUb-Gm3Md4nM4bBg":{"text":"I love the resturant. The red curry shrim \"rundown\" was awsomn. It was the best shrimp I'v","useful":0,"cool":0},"RCvmu0aIYhwiQbPFneIxxQ":{"text":"After daily argument about where to eat (neither of us can ever decide) we finally agreed ","useful":2,"cool":0},"G1bccxDHJsBJ7POdOJRvXQ":{"text":"Good food and good service.   I apologize for not writing a lengthy review but when I'm at","useful":0,"cool":0},"KW8rvtEKftc9_yl_UP4hfw":{"text":"I always love the Rum House!  This time around, I had a couple Painkillers (rum, pineapple","useful":1,"cool":1},"VUEinw3qPfcMtm8nzIIR5w":{"text":"As my wife & I walked up and spoke with the hostess about a table, I had what was left of ","useful":0,"cool":0},"91gpyPqeEwNOwCjBQ3NX2A":{"text":"Came one night to get some food out of the main tourist area and decided to try Rum House.","useful":2,"cool":3},"ZTlkx-beamBZ83LVtsxYtg":{"text":"Taco is great and I had crispy fish.\nI like the sweet potato in the salad.\nDamn good nacho","useful":1,"cool":0},"WqGMgJZkxIn0T2e-ZGUOXw":{"text":"This place is always insanely packed and waiting for a table involves spending mucho on pr","useful":0,"cool":0},"HkP-7IZN32-8-I0XcazwKg":{"text":"This is a pretty good restaurant. Their sandwiches are okay, but their tacos are GREAT. Th","useful":0,"cool":0},"COgRshKqwBhllqSQeduwmg":{"text":"Taco Tuesday: Two dollars a piece, man what a steal. They were awesome. Oh by the way plea","useful":0,"cool":0},"tQS36fxcHBryyufdq2djeA":{"text":"I am struggling to find something good to say about my recent meal at The Rum House before","useful":3,"cool":0},"2H8iz0ieUv3DoGauQhppMA":{"text":"Cool hipster type bar and taqueria.   A little price for a taco but tasty.   Inside smells","useful":0,"cool":0},"BccWnySczaabJ9dV5lc4xQ":{"text":"Hands down on of the best Caribbean places I have been to and only place I come for tacos.","useful":0,"cool":0},"Lz7lu7CQGCleEuquOOsbag":{"text":"Happy hour is the best around! Delicious margaritas for only $4 when they're normally $12.","useful":0,"cool":0},"XID7SkKXKjmyn3iSAuoZHQ":{"text":"One of my favorite restaurants in New Orleans . Gets pretty crowded at night and especiall","useful":1,"cool":0},"qHMcGo484Efoqpv16N5i5Q":{"text":"One sure sign that a restaurant is great is that it always has a lot of patrons. The rum h","useful":0,"cool":0},"Mq-UTqzdcPPFvFJuTeOzYg":{"text":"Everyone raves about The Rum House and rightly so because the food is pretty tasty. I've b","useful":0,"cool":0},"193rdQeDCtpgNUsq42NrvQ":{"text":"This place is located in an amazing place, so even if the wait is a little long, you can c","useful":0,"cool":0},"XJrwvHugJpOpq_onJpYoJQ":{"text":"The nachos are a must! They are delicious, and huge!  Highly recommend the Rum House.","useful":0,"cool":0},"Nr8a3t-RTQPsa9gHUVDdgw":{"text":"Very good bar and food joint for any occasion. Try the scallop tacos and get a painkiller ","useful":0,"cool":0},"_HcrEMMwN5fMpNhsy4RUVw":{"text":"Went down to the Magazine Street area for some late afternoon lunch and decided to give th","useful":0,"cool":0},"ieeMg2wpH6ikaaqc32f6Vw":{"text":"This was a hip Local spot. Great for tacos according to my friend and it seemed to be very","useful":0,"cool":0},"DT1m_EoO3Fnz9Agb1VbQgQ":{"text":"Get the painkiller! It was delicious! Tacos were really good, but the Cuban was off the ch","useful":0,"cool":0},"w9c1-U0KLlYwbWLoUXrpoA":{"text":"The nachos and rum punch were the perfect lunch after a garden tour.  Staff were very poli","useful":0,"cool":0},"HWe2RTHbCwn-WRkwxNy6lA":{"text":"All of the tacos are great, the scallops one is my personal favorite.  The cilantro lime s","useful":0,"cool":0},"iTaqcYASvW28tzy9j0hDGw":{"text":"If you are ever in New Orleans, you have to go here . . . EVERYTHING they serve is ah-mazi","useful":2,"cool":0},"teF_z_FJ9KnEEVOwa-C3Nw":{"text":"So I've been here many times and have never had an issue. However, I'm not sure if our wai","useful":1,"cool":0},"TlBlr8ovEh0DvUfZJdzc_Q":{"text":"Visited new Orleans last Tuesday and our first stop was Rum House! It was taco Tuesday $2 ","useful":0,"cool":0},"gboXC0wIFApRN82_F83lGg":{"text":"Great place for a group dinner - pitchers of house margaritas are always a good call! Have","useful":0,"cool":0},"lSUjGQMcht_mzv0czitWJw":{"text":"Taco Tuesday...great prices, great food. $2 tacos, Abitha draft $2 all day. Ate a couple t","useful":0,"cool":0},"tH64ugPsT6WG4opDLLb_Xw":{"text":"It seemed like one of the 'it' bars, young crowd. It like was Jamaican themed Irish pub lo","useful":2,"cool":0},"1pUyGc44g5R5GJckeHJG-Q":{"text":"This place is just so good. We have a restaurant back home just like this, except this one","useful":0,"cool":0},"ShwhXnANjFse1QvNgOIz6g":{"text":"Great place to go for cheap tacos and awesome drinks! My friends and I tried a lot of the ","useful":0,"cool":0},"EJfl3eH-UPaTyKGig_hqmg":{"text":"Didn't have any food but stopped in for a few drinks at the bar.  The bartender was great ","useful":0,"cool":0},"90IBDDCBYvil7fUjQsxXbg":{"text":"Fantastic place! Great tacos, amazing nachos, good drinks and drink specials! This place a","useful":0,"cool":0},"9rxx3Y424JJGg_3nAfRA6g":{"text":"They never disappoint.  Went for a solo lunch, was seated fairly quickly.  Wait staff is e","useful":1,"cool":1},"iPItw9qOeYwuOiDEezYRRA":{"text":"Interesting Caribbean fusion tacos in a kind of random island-y space.  I think the tacos ","useful":0,"cool":0},"6hUB06pnrl8AXy0SL2fknQ":{"text":"Solid place with delicious food and atmosphere away from the typical French Quarter destin","useful":0,"cool":0},"xIaWnt-jSgIuikh9JJp3-Q":{"text":"I've been here three times since transplanting to New Orleans a month ago, and have to say","useful":0,"cool":0},"_r_yEGiZiaop0W7NxmOf1Q":{"text":"The best restaurant off of Magazine street! My boyfriend and i went here twice on our shor","useful":0,"cool":0},"_T-xU2qRmHyQOnZGfVK5Sg":{"text":"Amazing street tacos, great appetizers, good desserts, and drinks as well. The restaurant ","useful":0,"cool":0},"x2gKiqur_nmR65ItyvJ57Q":{"text":"Much to pricey and very over rated. We ordered 3 tacos, soft drink and Funky Monkey and it","useful":0,"cool":0},"wU1sadHcNTR1xt1-6NnZrw":{"text":"i have been here a few times. the drinks are really good, and the food is always good and ","useful":2,"cool":1},"iTmzPeOxDU1pKXVqwa6MbQ":{"text":"Wow!  This place is amazing! Unbelievably kind and energetic hostess ‍. Amazingly awesome ","useful":0,"cool":0},"Hv0QGWQsa7wLaSPfSCCqkA":{"text":"My wife and I walked past this place on a late Sunday afternoon in April.  The place was p","useful":0,"cool":0},"VeV_jxAPnnjk-pJ8qujGTw":{"text":"Love Taco Tuesday! We plan our trips to NOLA to make sure we are in town on Tuesday night.","useful":0,"cool":0},"do9Qraf6586_DG-wHxe_Tg":{"text":"Unreal! I came here expecting decent Caribbean fair and was totally surprised. The quality","useful":0,"cool":0},"TAx9TuG7Plv5_EyqYMYmGQ":{"text":"I can't add much of anything to the 344 reviews here, but I had to add a \"two thumbs up\" f","useful":1,"cool":0},"7YjavOqulp7dnvjf5zWUhg":{"text":"Great place, friendly staff, GREAT FOOD! you definitely want to grab a bite to eat. For my","useful":0,"cool":0},"4padFyX0FQouSJKjcxIPGg":{"text":"This is by far my favorite place for tacos and cheese dip anywhere in new orleans. Its alw","useful":1,"cool":0},"uxl9umpLteBkMgmKCZaGdw":{"text":"I ate at the Rum house on Magazine Street last night, I enjoyed the Great Rum and beer sel","useful":0,"cool":0},"D8C0mXBQkmJnLMNwvsVFMA":{"text":"Came in for happy hour, thought I had read they had food specials, but I guess they don't ","useful":0,"cool":0},"sBHOaHM-LgT1aiyOPh8NQQ":{"text":"Definitely want to remember this place next time I'm in New Orleans. Despite the city's re","useful":0,"cool":0},"D83NOnS2vF0Tkhq6pHqhTQ":{"text":"The rum house is always great. I've been to the one in Baton Rouge and this one isn't much","useful":0,"cool":0},"vNAXz0QYCD7yKasm5wWb0g":{"text":"I love rum house. Typically when i come...its in a group and we already know what we want ","useful":3,"cool":1},"wPsnxV3s0EyYqQzN7WMdOw":{"text":"Great bar food and drinks. My friend suggested this place without any specific recommendat","useful":0,"cool":0},"ajNMBChQ_iEfsoIfPjwH2w":{"text":"You have to get the duck duck goose! My boyfriend and I don't even eat duck but today we d","useful":0,"cool":0},"X6SOFHYe2tKhtR6M6phQlQ":{"text":"Thought the menu looked great, and did not disappoint. Everything fresh, from the great av","useful":0,"cool":0},"kadg0sBNAsJGjCN3NNs2bQ":{"text":"Last night we waited over 1 1/2 hours and still no table! Looking around you see people oc","useful":1,"cool":0},"Wcu-3KAJeSNTQq3tsaNqqA":{"text":"Here at The Rum House, sitting outside on the patio and enjoying the breeze.  My friends a","useful":0,"cool":0},"-tP-3p8ZC7PWEXWNZfdQ5w":{"text":"Love their menu!  It was hard to decide what to order, but since they are definitely known","useful":0,"cool":0},"UqRprXcM9oBCiVFdWxdXbw":{"text":"Great tacos - especially the chopped shrimp, but leaves an impression with me is the fresh","useful":4,"cool":2},"izezM-IUtHj3LYagP-ZEEw":{"text":"Only reviewing the FISHBOWL... and if you're \"tourist-ing\", stop for a fishbowl and check ","useful":2,"cool":1},"uj2IgLU3iBTOSHakTuYICA":{"text":"Love that the extended their outdoor seating (which is usually stuffed), but can't say eno","useful":0,"cool":0},"Ssy1MtV6bgXZbhiOf5elKw":{"text":"Omg if you look at this restaurant on Yelp as did I before visiting you would think that t","useful":0,"cool":0},"vfVljhBLC8FT5594Td0iSA":{"text":"I came here with my wife, while in town for a couple days. We got a recommendation from a ","useful":0,"cool":0},"50qOsPXnLOI6-8YUhFR04g":{"text":"Excellent rum selection and live the Caribbean inspired tacos. Quality chips and guac too.","useful":0,"cool":0},"8mGjUfFBBbX2xAyKGZaXrQ":{"text":"Let's face it, eventually you get tired of fried seafood and debris poboys so it's nice to","useful":0,"cool":0},"pDk54Pn4o3GGDMJQLNWpCw":{"text":"We ate here Friday for the first time. We ordered a few tacos and had sides. the tacos wer","useful":0,"cool":0},"C68FEjrV81ci2PKIww1Ogg":{"text":"Location is fantastic -- very walk-able and surrounded by cool shops. Indoor/outdoor dinin","useful":0,"cool":0},"ViALnfVA5eThSSa8vYaFag":{"text":"I'm sorry. I wanted to like this place. The decor was nice, and service good and friendly,","useful":0,"cool":0},"LrsCzkvFSYWuvzfxe24b8Q":{"text":"Duck Tacos, EXCELLENT FOOD FOR YOUR FACE.\nJerk Chicken tacos, hot damn girl. SO GOOD. \n+Ma","useful":0,"cool":0},"gm7p79ZecdDyRFHVbNVdHw":{"text":"It was a little expensive from what I remember, but I really enjoyed the food! I got a veg","useful":1,"cool":2},"r_b9xx03np2ONBM4fbyjZQ":{"text":"This place was rocking busy with great prices on delicious rum drinks followed by amazingl","useful":0,"cool":0},"HfopvAg5re0OVzvL5JVdkA":{"text":"Great bar and good food. The salsa is so good and you get a decent size, the tacos where t","useful":0,"cool":0},"uAsMREoqgD3DayuFBOWfow":{"text":"The Rum House is BY FAR my favorite restaurant in New Orleans.  Their portions are generou","useful":0,"cool":0},"yA7HfddqIHY7dpCuAxeSHA":{"text":"We came in 5 minutes before the kitchen closed and they were so accommodating and friendly","useful":0,"cool":0},"2Gsso5mOcn_uCP17zea97Q":{"text":"A hopping place away from the French Quarter. I always look for local places when I travel","useful":0,"cool":0},"E_aJgLxkKghBG_ZLl0elFg":{"text":"The drinks here were delicious. I'm especially a fan of \"The Pain Killer.\" The atmosphere ","useful":0,"cool":0},"o2maZ1eWoJet-r_4X42u4A":{"text":"Good service, delish tacos, fun atmosphere, & yummy drinks!\n\nThe rum house was recommended","useful":1,"cool":0},"B6hilgFsvqKk8qAegUTeKA":{"text":"OMG, the food and drinks are awesome! The wait was only 15 min and the atmosphere is great","useful":0,"cool":0},"8rx5ITGHyitFV5zDi36qog":{"text":"Our tour guy Craig from the on off bus recommended the rum house, stating he eats there we","useful":0,"cool":0},"yAsQc0O81YV9-D8q3kzQHw":{"text":"We originally came here following our self-guided Frommers walking tour of the Garden Dist","useful":0,"cool":0},"F_Ix0CCWLGKfS0PDsfe4iA":{"text":"Really cool, unique restaurant! \n\nMy sister and I got the \"damn good nachos\" which were da","useful":3,"cool":2},"ScY-eFjoiNsqOUmb6bO3sQ":{"text":"I love this place always come with my friends. Fun atmosphere good and safe food that ever","useful":0,"cool":0},"6DZ0J-4050VgUJ6c0OZ8hQ":{"text":"Just do it! \nOMG the food!! Seafood pepper pot/ tuna ceviche tacos / Cuban sand/ shrimp cu","useful":0,"cool":0},"jrqChzBMVU9StKQYsc1HZQ":{"text":"Service was good.  Stopped in for an appetizer and had the ceviche tacos and chips and sal","useful":0,"cool":0},"rB9QP2FMTjTPpBbFZ7YTEQ":{"text":"It just so happened we came on Taco Tuesday! Wooooo $3 tacos!!! Normally they're about $5 ","useful":20,"cool":15},"kIk5cEu3JyXqQceqPcwhFA":{"text":"When I went the house was packed. We got the second to last table during Friday dinner rus","useful":9,"cool":11},"Offpc4hX8jjUXs0iT1CGfw":{"text":"This place was pretty good but the reason why I gave it a 3 is -1 star because all the sig","useful":0,"cool":0},"5ayZKpsHlrxp23gUacGILA":{"text":"This is my husband and I's favorite place to eat when we come to the city. We crave it! My","useful":0,"cool":0},"SnUuh5NiAk3K_dT2ggdsaQ":{"text":"I didn't really like the food. It's a \"Caribbean\" restaurant or their spin on Caribbean fo","useful":0,"cool":0},"PFmt7mVthxDf3HyRI3-GhA":{"text":"Went back again for Taco Tuesday, split a Damn Good Nachos (5 ways) and got for tacos for ","useful":1,"cool":0},"Q_UdTuBgADqBKRElcen6Ag":{"text":"This isn't my favorite place to get a taco (Velvet Cactus - Fried Chicken Taco) but the Ca","useful":1,"cool":0},"EGYTjx9gfk_r2DZYyqE5xg":{"text":"Food was amazing. Had the Jerked Chicken salad and nachos. The Painkiller in their signatu","useful":1,"cool":1},"oEYy5UTjkjM0iwhUsXBOKQ":{"text":"Pretty good! They're super busy and fast paced so the server doesn't/can't really pay much","useful":0,"cool":0},"k54Qe2tumGafsuMoKeMnfw":{"text":"Oh my tacos this place is awesome! We just so happened to come on national taco day and th","useful":0,"cool":0},"aZXduXrHs0-DLle5zboOUA":{"text":"I got the taco trifecta with the chipotle shrimp, calypso beef, and drew brees tacos. With","useful":0,"cool":0},"ungRuadVSM08yMEoQBvC7w":{"text":"Curious restaurant that is housed in the former Puccino's coffee shop.  The layout is okay","useful":0,"cool":0},"9niJeeESPMdX0wFCwwaVwg":{"text":"Who doesn't love The Rum House? I'm here at least 5 times a week. Warm and friendly with d","useful":0,"cool":0},"rGuheHt4wEHtytCAYzGpHQ":{"text":"I came again to this Caribbean place to have some happy hour and dinner if you like margar","useful":0,"cool":0},"r5vyseOq4HWvJD71DYOUlA":{"text":"It was my first time to the Rum House and  I wanted a different cuisine while in Nola.  I ","useful":1,"cool":0},"DHNTcCBJVics3PGVIG5ZVg":{"text":"I love this place and visit every time I am in New Orleans. I love the vibe of the restaur","useful":0,"cool":0},"9jaVnjrxmYAGQBEYQf0ZPQ":{"text":"Very good food! Had the pollo asado plate, OMG their mango rice is good! It's a bit differ","useful":0,"cool":0},"z2OLDbPxdiREzfUATOyr8w":{"text":"Great great tacos and drinks in the heart of magazine street. Attentive service and the fo","useful":0,"cool":0},"bt7vv01qy_RAc8E-F1I6iw":{"text":"I've been here three times now and always a pleasant experience. Food and service are both","useful":0,"cool":0},"I6l9TjSVR9ZDnfyeD6MDVA":{"text":"This was a great stop along Magazine Street amidst a few hours of shopping.  We stepped in","useful":0,"cool":0},"LKWLfE42wwAiPB7v9GXr0Q":{"text":"Ate here for the first time tonight. There are two bars one inside and one outside. The ou","useful":0,"cool":1},"ZwLmmrcd24-SExOw5LgW7g":{"text":"The guac was out-of-control. The chips- perfect. We had four different tacos and each was ","useful":1,"cool":1},"pXyiGEa5PEnp5agb897_Pw":{"text":"Have eaten here many times and have never been disappointed.  The nachos are a must and ve","useful":0,"cool":0},"PPra9yUIu6CzLx14mwCpyA":{"text":"I'm a big fan of this place. Located in one of my favorite neighborhoods in NOLA, the Rum ","useful":2,"cool":1},"978ky4dwlkNf6nDlotjm9A":{"text":"I. Just. Cried. My food was so good I could die now and be happy, Peyton has been a great ","useful":0,"cool":0},"ZtVhbBcBJQvBVMxIaIOwgw":{"text":"Rum House is the BOMB!!! Those DAMN GOOD NACHOS are DAMN GOOD so delicious. I had 3 differ","useful":0,"cool":0},"_eMyjzzyDhGXHZ2tH8B0UA":{"text":"I've been to Rum House so many times and I still don't know if I love it or hate it. The c","useful":0,"cool":0},"TatAAxKJ1jLE-ImOSwuYKQ":{"text":"Two words: Island Time!!!! One of the best happy hours I've been too. Drinks are strong an","useful":0,"cool":0},"rkt0yMjGIb2RgI5C_7DRCQ":{"text":"A local told us about this place. We walked four miles to get there, so I had high expecta","useful":0,"cool":1},"2zxOCmLH9tpYR-8QxosnHw":{"text":"Killer Killer drinks baby!!!! The food is aiight I would do the Brisket taco if anything a","useful":0,"cool":0},"jdo7RUiSvTVtqs0Zgp5AxQ":{"text":"Awesome happy hour! Best 'damn nachos'! Piled high with goodies! Loved the Painkillers too","useful":0,"cool":0},"ztrznlZ0sBuuq3G-25rcVQ":{"text":"Solid tacos (though the sauces were a little...eh) and generous drink portions. Seems like","useful":3,"cool":2},"A0-iUSHIuLyR_cX_fGB_ew":{"text":"We come here for the tasty jerk dishes and honest pours. Alway an easy \"chill mon\" vibe. L","useful":0,"cool":0},"FxXEepHKnQnwSlrTEhW-pg":{"text":"I used to love this place, used to be consistent and a great experience it seems that has ","useful":2,"cool":0},"XxadMNXJzAfcG_Q8K6koww":{"text":"Hubby and I stopped in for lunch while waiting for our bus. It was busy so we had to check","useful":0,"cool":0},"s0mwTjJqCZnTYDxOm1KQSg":{"text":"SUCH a cute and cool vibe  little place on Magazine St. Our server Jonathan was FABULOUS a","useful":0,"cool":0},"5iuVI4Eb6QznMM5RK_44mg":{"text":"For happy hour drinks? this is the perfect place to go.  I liked my classic mojito, very s","useful":0,"cool":0},"4kqKK-rlTbdY_ArEnwsi1g":{"text":"Awesome Tuesday taco deals. New one w collard greens was stuffed and delicious. Wentelsewh","useful":0,"cool":0},"zZaphYcMTECjJE4fTHnftg":{"text":"This place has become one of my regular spots to hit when visiting New Orleans. They have ","useful":0,"cool":0},"p39Rd-DQcrrEZODaMvqnAA":{"text":"I really enjoyed this place! We went on a Monday, which meant there were good deals appare","useful":0,"cool":0},"kCmtkf4YhmfFMBPAp_Qh5w":{"text":"I really, REALLY want to like Rum House, but, each time we go, I get a little more disappo","useful":1,"cool":0},"e1bwtg2HYDERNi4SMbOdIg":{"text":"I may have eaten the best taco of my life at The Rum House. The Drewbrees taco is 5 stars!","useful":0,"cool":0},"6oeOuYdUIDoQd4yB4XAAPQ":{"text":"We were in New Orleans for a wedding and came here one night for dinner.  It was an excell","useful":0,"cool":0},"TJX1rkm0Cxb_K2Bfd7I2mQ":{"text":"Great on taco tuesdays but be prepared for long, long, lines if you don't get there right ","useful":0,"cool":0},"8emsb5xlP7o3Yedoam-3Bg":{"text":"Really nice place. Good sangria, the tacos were a little on the sweet side for my taste bu","useful":0,"cool":0},"UhpKUsFDpvF1iy_hPd3c0A":{"text":"The ambiance is really nice and the staff are so friendly and accommodating. Maya the host","useful":0,"cool":0},"tRypDJO-tH8hrumv4p8cZQ":{"text":"I thought this was a taqaria. Wow! how disappointing! This place can really fuck up a taco","useful":0,"cool":0},"wGLePj70KTUtpRktSJd29A":{"text":"LOVE the strawberry Margarita and the tacos are good but in my opinion they could really u","useful":1,"cool":1},"v9WJf9Gc-aWmkBG_V7MpGg":{"text":"Pretty good I loved that they participated in Restaurant week, I had the awesome queso dip","useful":0,"cool":0},"G4tWAKvKi3aVRO5HSxTlRQ":{"text":"The food at this place is next level good, the mix and match tacos were amazing. On a trip","useful":0,"cool":0},"XUCezRY-sYA_eLJseDp42Q":{"text":"Very delicious! We take bus 11 at stop Harmony. Good service! We order fried fish, salad a","useful":0,"cool":0},"d9zxEwRJH-wHsL_3Jnjg2Q":{"text":"Got the. 4 taco combo: I ate chili shrimp and scallop taco while hubby had BBQ pork and oy","useful":0,"cool":0},"NkDrzBsrBSdtC6-1xNVH0A":{"text":"Oh my gosh. So much deliciousness. We got several different kinds of tacos and all were fa","useful":0,"cool":0},"Nw66qjbH-bsOtW2NV_ysxg":{"text":"Fresh, funky, all around fabulous. It's a must do in New Orleans. From the queso to the la","useful":0,"cool":0},"FxqFct2kTzcs7BeA5IqLtQ":{"text":"The BEEF PATTIES are EVERYTHING !! I was VERY skeptical eating at an island restaurant wit","useful":2,"cool":1},"r2PlZ5mrtmK6ppbsLSKpmA":{"text":"Went here on the strength of Yelp reviews, dragging our tired kids from the other side of ","useful":0,"cool":0},"PCkxGL0ZaSxn3bPrZyYIow":{"text":"The place was ok. It should be about 3.5 star.\nFood: fish of the day was too dry and a lit","useful":0,"cool":0},"UfAmOgdPIS1BXgOwBjXfJw":{"text":"Came with a huge group on a Sat night for an early dinner and were happily seated within a","useful":2,"cool":0},"i8Fk5UzU18cwHVItFvdB-Q":{"text":"This place is an excellent place to eat! Our food was delicious! There is a large variety ","useful":0,"cool":0},"-L8PPA6lUV1vZwyS12TLeg":{"text":"Words can't explain how much I love it here, this is the best place in the city to me!","useful":0,"cool":0},"bthAFPL6pCgW4zTgyl-9zw":{"text":"Of all the places my family ate at in New Orleans, this was our absolute favorite!  The ta","useful":0,"cool":0},"TNewLZOKzahLuWB6pYAdaQ":{"text":"A local told us about this place. We walked four miles to get there, so I had high expecta","useful":0,"cool":0},"_c_lBzisW1cgrat8_WFBDQ":{"text":"I love The Rum House! It's my husband's favorite place to go also! Calypso beef and Scallo","useful":1,"cool":0},"BjGY9bkEZcLamMV6TCbrvg":{"text":"Delicious food. The fully loaded nachos can be a meal for a couple. The wait staff are all","useful":21,"cool":18},"PLzIQ1H-nCXPmFfpneXZMw":{"text":"Everything in this place is amazing.\nThe best loaded nachos in town for sure! All the taco","useful":2,"cool":1},"mMzzj49aMZnzUj9eV9ay_w":{"text":"amazing tacos!  loved them.  was a great way to have a quick lunch with my son visiting ne","useful":0,"cool":0},"9fBlC1TDCgstZHNSv4_MTQ":{"text":"I thought that this would be a great experience but the wait was outrageous. The staff was","useful":0,"cool":0},"AfkFwH0KfaViHejT2OimuA":{"text":"Food is wonderful and delightfully diverse, a great take on carribean food and tacos!","useful":0,"cool":0},"XD83LY-WPcg_e-8J7TBgqQ":{"text":"Fun place on Magazine street. It's definitely on the list of places to visit when in NOLA.","useful":0,"cool":0},"RMmzToLwI0wKg311ehnsGA":{"text":"Just dont bother with this resturant in new orleans. There are a ton of really good places","useful":0,"cool":0},"LpJbu8uaJP1kOQfh8cERMw":{"text":"A local told us about this place. We walked four miles to get there, so I had high expecta","useful":0,"cool":0},"5MtNwInoVGwnSify_fgM4w":{"text":"My wife are in town for the Crescent City Classic 10K and decided to hit Magazine Street f","useful":0,"cool":0},"tIhOAMEqRPQrLhTS86nJeg":{"text":"Always so good ! Fresh and a pleasant atmosphere. The Rum House Salad is literally one of ","useful":0,"cool":0},"_0531lnFv5l8UFdsfqODyQ":{"text":"We ate our way through NOLA and the Rum House did not disappoint. Had three tacos and all ","useful":0,"cool":1},"MZaXyr0ahT2nwygE7nJTwg":{"text":"Everything was very good. The Ambiance is good. But food is excellent. The drinks are good","useful":2,"cool":1},"8jNk0HzLkQJVPDrNrhjfZw":{"text":"Used to be 5 stars. But they change their rules and want your whole party to there when th","useful":0,"cool":0},"ef_u0XXc4TSbP_cZNKF4Yg":{"text":"We from out of town and doing hop on hop off bus, as the restaurant is across the street f","useful":0,"cool":0},"gVQrCLv3xQSnOBduFS1JQw":{"text":"Great restaurant in a very nice neighborhood.\nWas there on a Saturday evening with two fri","useful":1,"cool":0},"HMaxZK_JdYZ2oKPfmPz8tg":{"text":"Very enjoyable experience. Great staff. Great location in a great American city. The walk ","useful":0,"cool":0},"-hZ22PoCP0Wt6mo52hNyKA":{"text":"Great place to grab a drink with friends and eat some amazing food. The jerk chicken tacos","useful":0,"cool":0},"vVXoZw3XD7gp6qcMEG8vqA":{"text":"Took the St. Charles streetcar from the french quarter and had an excellent dinner. I got ","useful":0,"cool":0},"8Muwtg0j9GuXf-jgS90_Cw":{"text":"Loved the food, server was on point although I don't remember his name. Mango margarita wa","useful":0,"cool":0},"9ZaDxBnat3LgLylLv_l0ag":{"text":"One of The most amazing meal we had in New Orleans! Tacos are a must! Their margarita was ","useful":0,"cool":0},"y_VbsDW4sbu2CxElg19r7Q":{"text":"Everyone comes to RH for tacos and I have no idea why. They're not good. However....have y","useful":3,"cool":1},"II_-w-6IQrGXbc9PXpfBqg":{"text":"Great service and great food! Had the Cuban with the sauce on the side. I definitely recom","useful":0,"cool":0},"Lx6-dhjeM0VOtXY2tdPfDg":{"text":"After a recent trip to New Orleans, I sat on the plane en route to So Cal and had a discus","useful":1,"cool":1},"hL__CQpaiinfQKLSSDgqWQ":{"text":"Stumbled upon this place the last day of our trip! We went on a Tuesday and all tacos were","useful":0,"cool":0},"_c8jXvhbK4reR4fACLgx5Q":{"text":"Very tasty food.  Nice atmosphere.  Located on Magazine Street with plenty of places to sh","useful":0,"cool":0},"rzCIqGg_3w0bhQZO-mxITw":{"text":"Sorry. Worst drunk food ever. Smelly. Food served cold. Weird tasting salsa. Over marinate","useful":0,"cool":0},"rfjTM-ri_eOP9szH_m0K4w":{"text":"Didn't think I was going to like this place but man oh man!!! \n\n- Drinks 5/5\n- Staff 5/5 \n","useful":0,"cool":0},"I-0vALWzuV6Mp5PbkeMaqA":{"text":"Rum House has the best nachos in the city, hands down. They have a great taco deal and hap","useful":1,"cool":0},"n-oFihbIUvTuME__Gjt2yA":{"text":"The Nachos!! We've been on a quest for the best nachos in New Orleans and this is top of t","useful":0,"cool":0},"gA3bbWiKC2ke3CObtPYDig":{"text":"The tacos here were great! The Rum House came highly recommend and I am glad we went. Ther","useful":0,"cool":1},"32hzwUr9XiFfUhz39iQz-Q":{"text":"If you've ever been to New Orleans and took that stroll down Magazine St. then you've hear","useful":2,"cool":0},"gFElDGLy-Pcmkw2_WJfvoA":{"text":"An interesting take on mexican fare, that's for sure.\n\nThe food is a sort of modern mexica","useful":0,"cool":1},"sntSRgWLuOw5SSC_9hOi5A":{"text":"This is a solid staple in my rotating restaurant list. It's close to home, has lots of out","useful":1,"cool":1},"lrt1d6Wv7zTlJ3SmCJtfUg":{"text":"As it's been said before, this is an all-around great restaurant. It's trendy and fun and ","useful":2,"cool":1},"RVw5_YSSuTAQoAgUBQWiBA":{"text":"Just about all of their tacos are delicious especially the oyster one! The rum drinks are ","useful":0,"cool":0},"Fa0iQLXDFHydz65LIGdE2A":{"text":"I live in Houma and sometimes I drive to New Orleans just to have lunch here, great food. ","useful":0,"cool":0},"gcva-VwfpGmpu3_870LJxg":{"text":"Nice, upscale Caribbean bar food. Decent prices , crab melt not much flavor the Nachos wer","useful":1,"cool":0},"qBiwWwZadiLFk9wvOfyH8w":{"text":"Mediocre tourist trap! Uninterested waiter, unsalted bagged chips, mealy tasting guacamole","useful":0,"cool":0},"kcBaYySnudwe4x8uhqtZ1Q":{"text":"This place gets extremely crowded on the weekends...our wait on a Saturday night was aroun","useful":1,"cool":0},"pHNXFzTfbbVqCuUwkHW_CA":{"text":"Popular for sure and now I know why.  They have a really cool menu with something for ever","useful":2,"cool":3},"edoXNiK-gYjzCO8CsB6Dxw":{"text":"My boyfriend and I came here around noon on a Saturday morning after seeing all the positi","useful":0,"cool":0},"WjYwkCC2rY--vsRq8EMVNA":{"text":"We came on taco Tuesday and it was packed we got there around 7pm and the wait was about 1","useful":0,"cool":0},"y4l7FcB7xE-8cZOwmcfIZA":{"text":"Every time I've come here I've had a great experience! They have a knack for hiring except","useful":0,"cool":0},"dmCJ2D6cmm7xLeJTjyupWw":{"text":"One of my all time favorites in NOLA! Great energy, great  staff, and amazing atmosphere. ","useful":0,"cool":0},"Y9paKk1zfI0O2EGdqO4H0Q":{"text":"This place is awesome! There may be a wait, but it's well worth it. The rum house salad is","useful":0,"cool":0},"EJqJZh-w25n1RAW2eOgI5Q":{"text":"What can I say. Other than wishing it was a little more quiet, I have no complaints about ","useful":0,"cool":0},"2I63ZNKZywuZr47RvJqP3Q":{"text":"The Key Lime Pie here... I don't want to say it changed my life because that sounds dramat","useful":0,"cool":0},"EPXLmi8nz5wWQrzr8LU2Aw":{"text":"The tacos are great and cheap, the drinks are over top and delicious. This is a fun place ","useful":0,"cool":0},"x8Lpq4olRRfc0eDMqrIunw":{"text":"I never leave reviews. I used to live in New Orleans, 10 years ago, and have never come he","useful":0,"cool":0},"pB44MgpIeOGoRN4i9Mn0mw":{"text":"The Rum House is located in the Garden District in New Orleans. It can be a little hard to","useful":8,"cool":6},"iBK_fgENKOZGb-h46Azfiw":{"text":"Had a buttload of tacos  and cocktails here and loved it. Shout out to the wonderful serve","useful":0,"cool":0},"a3nwETCqpZ_79AXA3t_fxg":{"text":"Kyle P. really showed up tonight in a MAJOR way. Best food and drink recs AND amazing tast","useful":1,"cool":1},"WzbepHCuKi70yjqtjP_hbA":{"text":"The food that I have had here has been great, the drinks are my fav!!! However, the sight ","useful":0,"cool":0},"g3ZTiLCVRbN72du1l_KTAg":{"text":"Went here for the first time months ago with ExBabe and holy moly, this place is all that ","useful":1,"cool":0},"UtOTlPVylMEPqRUi_HUeKA":{"text":"Loved the tacos and drinks at this place! This restaurant is located on Magazine street, a","useful":0,"cool":0},"RM8HXzS3eGedqXLuS2Mphw":{"text":"When the bf and I were down in NOLA last month, we made a point to come here, plus I wante","useful":0,"cool":1},"GgkC98M4Ey5zAijin3fsCQ":{"text":"Please come and enjoy the food, the drinks, and amazing service! Shelley recommended many ","useful":0,"cool":0},"E9nE0_sGXsOQBDcOa7sWDA":{"text":"Wow...this place was perfect. Our server Connor was the best and great. The happy hour spe","useful":0,"cool":0},"WA0ZtudlFC9bdO3lOqL9Cg":{"text":"The tacos here are AMAZING! A friend who frequents this part of NOLA recommended it and we","useful":0,"cool":0},"EqExygv1jXHgj-7jEFrz3Q":{"text":"Moving to New Orleans from California which is such a diverse state, I was nervous that I ","useful":0,"cool":0},"8C73m13R3ck8BrEM_YDf3g":{"text":"The best waiter is Kyle!  Friendly, knowledgeable and a great sense of humor!  On top of t","useful":0,"cool":0},"q7-PlfZuZ1aGrtFyknI3XA":{"text":"This place has the best Caribbean food. The tacos to the side orders have the best taste. ","useful":1,"cool":0},"MTB9cK8UODf56dpHmST1lw":{"text":"Great tacos. The service was good.  The only problem was the wait was a little long and it","useful":0,"cool":0},"qs6HvPyYj69hwyc4cjo28A":{"text":"A great little place to go on Magazine Street if looking to get away from standard N.O. fa","useful":0,"cool":0},"wH-c5Sa8jOS515AiyhAirQ":{"text":"Tacos are amazing!!! Had Carolina bbq and duck!!! Underestimated the strawberry margarita.","useful":1,"cool":0},"RKppp_nxmfg1bHAA1yGpEA":{"text":"The conch fritters and calamari are insanely delicious. The house rum punch is just danger","useful":0,"cool":0},"WL4CYLIkBbTHtGNJWtaDcw":{"text":"Great place to meet friends for drinks, have appetizers, lunch dinner whatever. Right on m","useful":0,"cool":1},"MtaLXTOC47jkrgrkTkkVKg":{"text":"The waitress is gonna lie to you and say that the duck is the best taco. It's fine; but th","useful":1,"cool":1},"YIZVPeicuRHDEg9qsLdefw":{"text":"I love this place! I think it's underrated and recently rediscovered it again with my cowo","useful":0,"cool":0},"n3y-h4Kq2e9k2JBV-K9abw":{"text":"First timers.  Greeted quickly. Fantastic service - wish we got her name. Took advantage o","useful":0,"cool":0},"HB2Kk70JF-RsWqBFGKpROQ":{"text":"Loved this place! My husband and I went for lunch on a Friday and it was great! There was ","useful":3,"cool":1},"J5g5vqBanudlEY2FohPgeA":{"text":"Had a good lunch here the other day & sat outside with kiddos. I like the little meat pies","useful":1,"cool":1},"V6gjAzP85W3uMHoe9pKZRA":{"text":"Had read slot of things about the Rum House and had an trip planned for New Orleans.  We m","useful":3,"cool":1},"1G3ibYkt9USRIdTPOcM5dA":{"text":"This had to be one of my very favorite places to eat. The food was delicious. I had the je","useful":2,"cool":1},"jc_Q0JWkqkoyxPWuQtLB_g":{"text":"Taco Tuesday- we ordered 10 different tacos, all of them fantastic! It was a little crowde","useful":0,"cool":0},"_legciCw5hW9ncXZJEx4rg":{"text":"We were starved but worth wait.\nGluten fee/ dairy free meal on Magazine St.\nHave the taco ","useful":0,"cool":0},"clRAKdzacY3mgoPJSTtftA":{"text":"By far, this is my favorite casual restaurant in NOLA. Great service, food, and atmosphere","useful":1,"cool":2},"nctBZtKF-ZurbYvqRbYS1Q":{"text":"Great food, great atmosphere!!!  We had the key lime pie punch, queso blanco, drewbreez ta","useful":0,"cool":0},"fAM7MO_EQz1FljzLWarhTQ":{"text":"We had drinks and appetizers. The queso was reallyyy good and they had great cocktails - t","useful":1,"cool":0},"1TgAgorev6upZQxGmvgDkQ":{"text":"Insanely delicious. The specialty cocktails could use a little work, but the food makes up","useful":1,"cool":0},"SeVh8Iur6Sidc4HCgM-iPQ":{"text":"I went here because my all time favorite drink is rum punch so a place called the rum hous","useful":0,"cool":1},"oseXpm38xT4ICM9rUXDUdw":{"text":"I absolutely love this place! I have visited twice and received exemplary service on both ","useful":0,"cool":0},"yFeJNWqaNlM9x2RxEjrBfQ":{"text":"The run de dum dum fishbowl was a well mix of runs and juices that even my friend who does","useful":0,"cool":0},"NRCOBXDWMNruQFewHJGDrg":{"text":"Another great meal at a great place. I absolutely love \"The Rum House\"! It never disappoin","useful":0,"cool":0},"Go04Ve79Sxt-rEDjFGZOvw":{"text":"Food was very good and the quality is what you expect for Caribbean food. The service at t","useful":1,"cool":1},"nyrdbWz0YhGE5Jy4GnkDwQ":{"text":"I love Rum House and we go there a lot since we live on the same block.  The Two-Dat is a ","useful":0,"cool":0},"lROJDDqcCCea8lrwmiStUQ":{"text":"translucent scallops-- that means they are not cooked. ok- stuff happens (ok- not fully co","useful":3,"cool":0},"rf33vWlrMGQ9trgIC4Jcmw":{"text":"These tacos are yummy! Walked over after day drinking and shooting pool. Laid back atmosph","useful":2,"cool":2},"SX9uiwDvkF02HjorGNzjJw":{"text":"Absolutely fantastic experience waitress was wonderful explained the whole menu to us and ","useful":0,"cool":0},"vmp9F7nf4OMi2PrqOiuXEA":{"text":"Food is so fire!!!! Really delicious crab cake sandwich and the painkiller is so yummy! My","useful":0,"cool":0},"Ehi2f5d55Z29pGtvJnFMNA":{"text":"Not really a fan of their tacos but my sangria was really good and the bartender was very ","useful":1,"cool":0},"fBixPTMZDd6Z8pEQZV87xQ":{"text":"Great food for cheap! Don't get the bloody mary, it's pretty wattered down. Mix up tacos a","useful":0,"cool":0},"PDGWJ3vLECO7aP_iE7KI0w":{"text":"Taco Tuesday is the night to go.  Of course, I didn't automatically associate tacos with a","useful":3,"cool":2},"OiCIyr4AServDBKfjiB3Dw":{"text":"This place is delicious the Caribbean/Latin and American Fusion is such a wonderful thing.","useful":0,"cool":0},"3dW6K3VP3PNcqAwD3LjQ8Q":{"text":"Found this Gem and stopped in for a bight and it happened to be Taco Tuesday, half off all","useful":2,"cool":0},"uhwpIZLfrroER9jfNLM61w":{"text":"Rum House!!!!!!!!!!\nOne of my favorite places to eat in New Orleans. My favorite day to ea","useful":0,"cool":0},"PbDeqyd7C9MQgMKAfDlJ5g":{"text":"I lived for the tacos we had on taco Tuesday. My bf and I got like 4 different ones. The m","useful":0,"cool":0},"HEVVJlXlPBAdtAjAi8ljNA":{"text":"Love this place!! Best fish tacos and I can't get enough of their avocado dip!! Delicious!","useful":0,"cool":0},"DxNpm_zPmjzWKYUSmbuOrg":{"text":"OMG this place is amazing! Their Taco Tuesday special is awesome.\n\nI have to put this disc","useful":0,"cool":0},"cbTlKi7xWc2tjFbRqlChMg":{"text":"Excellent. Great margaritas, the red curry shrimp rundown is my favorite. I haven't had a ","useful":0,"cool":0},"HCnVwb2WImQqMOwRB6X3EQ":{"text":"This has become one of my favorite spots to kick it for Taco Tuesdays. The bartenders mix ","useful":1,"cool":1},"16e524OhSGMFXpKy3jlFig":{"text":"You had me at hello oh Rum House\n\nBeer - Check\nTacos - Check\n\nI absolutely love their taco","useful":1,"cool":0},"_f1HXp4QY-83YD6BtuqX4Q":{"text":"We stumbled across this place while visiting the garden district, cause who wouldn't want ","useful":3,"cool":0},"StYVnXUuHBuV6sLeLOz2Tw":{"text":"The food was delicious, the wait wasn't long and the staff was great! We ordered the mango","useful":0,"cool":0},"-piw6JL11VQlO5hHqjmrVQ":{"text":"We were seated immediately. The food is good and flavorful. Service was pleasant and quick","useful":0,"cool":0},"AaGV9cs4jZyL5WnfEuSonw":{"text":"Best tacos I've ever had! Taco Tuesday's deal was worth the wait. My girl and I had a ball","useful":0,"cool":0},"umzANaE-nm66SZe95x4hlA":{"text":"We loved this place. The tacos were unreal in the depth of flavor, not even considering th","useful":0,"cool":0},"qr2M9DWTmYJD9twHdk5kmw":{"text":"Good deals on the happy hour drinks! Pretty good food for a tourist ridden city. \nAlso ver","useful":1,"cool":0},"jnnAfKKuEQ-YeeapcwiD6Q":{"text":"The Shrimp Rundown are unbelievably delicious. The damn good nachos are great for sharing.","useful":0,"cool":0},"egvHXtCwIKkuU8oFBk-RCg":{"text":"I total dig this place. We had the taco plate and added two more tacos. It was so good. Du","useful":0,"cool":0},"V29Wc44AeaCfTQzki0Mz0g":{"text":"LOVE this place for Tacooo tuesdayz! I usually get the fried oyster taco, crispy fish taco","useful":0,"cool":0},"33oiFzCHvr2-qpzx7c4hUQ":{"text":"I like the Rum House. It's a nice spot for a casual lunch or dinner.\n\nThe good:\n- great pe","useful":6,"cool":3},"B1n-FXKzgttN2c8TmijLDQ":{"text":"This is always a very very busy place but it has great Caribbean food & unique tacos! They","useful":5,"cool":2},"i4BrIsP9o258ojw-HV5JoA":{"text":"I live not far from here, and it's constantly packed - which is shocking to me. I have bee","useful":0,"cool":0},"X6i46VHjWk_k_yUkHTWNMA":{"text":"This was the 1st place we dined upon arriving to NOLA and we had a great time. \n\nJerk 1/2 ","useful":2,"cool":2},"HgBzGmuTJA3ypq4TkifQ4Q":{"text":"I've never had a bad meal here and since I always have family & friends visiting, I jump a","useful":1,"cool":1},"DBnxGmwenEN8oJGJfNprmQ":{"text":"Salsa has a great heat to it... The tuna cerviche tacos are fresh, light ,great... Light,h","useful":0,"cool":0},"JQDHUail-llJpRk_pm2CVQ":{"text":"We stumbled by this place while exploring Magazine street and they were having happy hour!","useful":1,"cool":0},"NL_62CwJfvlWbgxwCv6CSA":{"text":"I went here for dinner tonight and had a fantastic dinner. \nFood was amazing! Service was ","useful":1,"cool":0},"VuDYsx6P0SqAGcFNP8D6jA":{"text":"Great food and fun restaurant for groups. I love getting the two dat with the 2 tacos and ","useful":0,"cool":0},"Ybd272amkTHC-wFi67AIJQ":{"text":"If you like avocado....order the mango guacamole with chips! So damn good. We had two orde","useful":0,"cool":0},"uL07uZr35Fbv82F31ETFhQ":{"text":"I love The Rum House and have always enjoyed it every time that I've been there, but the o","useful":0,"cool":1},"4FqKtT072GGeCSYdg3kLIA":{"text":"Awesome food!!! I tried 6 different tacos they all were absolutely delicious, I will defin","useful":0,"cool":0},"TL3ekkvN0rLVFuoQrEWY0A":{"text":"Love this bar and restaurant. The nachos and tacos are so good. Fresh ingredients and good","useful":0,"cool":0},"pIya6VWwSwq0oW3VBfY6wg":{"text":"Incredible place to be on a warm day, stuffing your face with the jerk chicken salad and a","useful":2,"cool":1},"qd-17GZW0v9PEV985PgjeA":{"text":"I have mixed feelings about this place. The drinks are good, the food is decent but its al","useful":0,"cool":0},"PNCy9y6w7NQa6VOM-oSjkQ":{"text":"Every time I go to the Rum House I have an amazing experience! The staff and bartenders ar","useful":0,"cool":0},"YlhDLuRZiwAh3S3nAyxz2A":{"text":"Drove by and saw someone else's nachos and decided to eat here. The food is amazing and th","useful":0,"cool":0},"oM_JmqkhJ_sIxuOjdveo4Q":{"text":"The B'brisket melt was delicious and the sweet potato chips were to die for. I could have ","useful":0,"cool":0},"dXbMwzLI-1RR8T2xB-JjhQ":{"text":"Literally AMAZING FOOD!!!! Monica our waitress was phenomenal. She was patient and underst","useful":0,"cool":0},"-PiOyuVE55MPk1puyK6HuQ":{"text":"Really liked this place\n\nThe website explains that the owners' life goal of floating aroun","useful":0,"cool":0},"LMpj78wyppdV8e9HWBDIvg":{"text":"Food may be good but didn't get a chance to try. Waited two hours for a table while other ","useful":0,"cool":0},"aB6JOXJ9eRh5j197rz7V0Q":{"text":"Amazing service and delicious food! Kyle took great care of us and was super nice. Would r","useful":0,"cool":0},"TqvJD3yv3kkKXHjwkU6oRg":{"text":"My friends and I were in town for the weekend and stumbled across the Rum House while walk","useful":2,"cool":0},"n_i9X6-jv53tJnZL08PFkA":{"text":"Love this place! It has a nice laid back casual atmosphere. The Mahi Mahi sandwich is SO g","useful":0,"cool":0},"3pgtVmcqeE90Kk_bQdkXeA":{"text":"The taco trifecta is a win! You can get any three tacos your little heart desires, and a s","useful":0,"cool":0},"3_eO2dHHagSWe-T6RuUNQQ":{"text":"For years and years Rumhouse has been my favorite go to. Each time I go the food is great,","useful":0,"cool":0},"zfOrJzhe3GOck1VUoHx2jQ":{"text":"Love this place. I get full just off of two tacos but I always order three. Best day to co","useful":0,"cool":0},"0eRiZq5wc4ZVW7Nw1ZiQDA":{"text":"Amazing nachos and tacos! Found it on yelp and was pleasantly surprised. Would definitely ","useful":0,"cool":0},"VWVuA1sdy22KG1MgFpKL_Q":{"text":"The food here was the worst. It was absolutly disgusting. I told the waitress and her resp","useful":0,"cool":0},"6uMjKuJjhkwszQEt2ILw2w":{"text":"Ok - so I know it's Mardi Gras and all bets are off when it comes to service but my experi","useful":1,"cool":0},"a4s-gANvqlW4nE0_WGHXEw":{"text":"I definitely enjoy the food more than the drinks.  A real easy go to spot that everyone wi","useful":0,"cool":0},"zRgavhkGl1jJOVITAiKE6g":{"text":"Tacos! Tacos! I love tacos!\n\nMoving here after living in San Diego for 9 yrs, I know my ta","useful":0,"cool":0},"Yh0EsHtcYdoX8sXIBZC5HA":{"text":"Very good food (especially the salsa & fried fish and some awesome dipping sauce they make","useful":0,"cool":0},"1v-627Yc5Ci1shHeI5U-Cw":{"text":"Went on a walking tour of the Garden District and ended up at the Rum House on Magazine St","useful":0,"cool":0},"cSx3pbuAuIeON4KXXmFiQg":{"text":"Went out for a girls lunch and I was pleasantly surprised- a lot of places don't live up t","useful":0,"cool":0},"CLxneM83isTLeyA1MEcbqQ":{"text":"The only thing I like from this place is the drinks they're amazing but when it comes down","useful":0,"cool":0},"j9yAz3czhWzmyUiEwQp18g":{"text":"Awesome tacos! I got the duck and the pork belly, plus some plantains on the side. Real go","useful":1,"cool":0},"8jFfAT1q0uRVOdujqUGOMw":{"text":"Visiting from out of town, and we were recommended here by a local. Those are the recommen","useful":1,"cool":0},"N_40lhLCr2v_2hdVUhbFAg":{"text":"This place is great!\n\nI brought a group of 17 people for taco Tuesday at 6 PM. Although th","useful":0,"cool":1},"_GtK0-vUY1Tz_3vJ-72hCA":{"text":"Hello Nawlins!  \n\nI'm a California native and in town to visit my cousin and i do believe ","useful":1,"cool":1},"hrM45S84D4MGGi2_30JPXw":{"text":"Try the fried calamari just for the dipping sauce--incredible! I had the taco trifecta for","useful":0,"cool":0},"1xa748XUnSbtLX8Pc8QxaA":{"text":"So this is my third time here... Well kinda fourth. The first time I told my friend who's ","useful":5,"cool":2},"PSumVZg3luvwz7Kdr8yNnA":{"text":"This place hasn't disappointed me yet. You just can't go wrong with The Rum House. Every s","useful":0,"cool":0},"S0O3OJIm065ML5YK-n2dHA":{"text":"Great! The painkiller was just sweet enough to trick me into thinking I was all good and t","useful":2,"cool":1},"ZTCxoZkXsMeDTvPAyGbZVA":{"text":"We have eaten here many times. The food never fails. Great for bringing out-of-town guest.","useful":0,"cool":0},"qzZo4S3a9e0_4UMRkXYikQ":{"text":"Drinks were on point and did not hold back.\nTried 4 types of tacos. On the advise of the w","useful":0,"cool":0},"7ZbKmMSDPWbj1U0_-RpY1Q":{"text":"Many visits.  Excellent nachos.  Prefer the lamb or pork.  Not a huge fan of the shrimp ta","useful":0,"cool":0},"nBtCrQuBA0uXG8g6Koyiiw":{"text":"It's a nice casual restaurant with good food an drinks. We came for dinner and had to wait","useful":0,"cool":0},"ikXOiotkElMgCXSnhkGWBA":{"text":"Cool place and good margaritas. Starters were huge and our favourites among the dishes. Tr","useful":0,"cool":0},"EX8TIoMeGF3OhSu8-B_aFg":{"text":"We visited the Rum house at the suggestion from our tour guide. We thought a recommendatio","useful":0,"cool":0},"_DhGDub11aPUuRbYb34Wew":{"text":"For anyone reading in San Francisco, Rum House is the Tacolicious of NOLA.  \n\nPrimo locati","useful":2,"cool":1},"qH990dft1K-64FAizA7E4w":{"text":"I came to New Orleans for a business trip/for some fun, and I was recommended this place b","useful":0,"cool":0},"0ZsGzGjM8jsnlCRLiqts-g":{"text":"Always crowded and not sure worth it. Not bad. Don't make a special trip for it.","useful":0,"cool":0},"ObMRWDkBLt-F-lrFARa3rw":{"text":"Of all the restaurants/ food we tried when we went to New Orleans (and we tried all the lo","useful":0,"cool":0},"jiLBRVxMezHgKYEHOqQFNQ":{"text":"Great food, menu has a lot of variety and options. They do cater to food allergies as well","useful":0,"cool":0},"MKCjKQ33jKzNz8UUooIisg":{"text":"Great selection of cocktails (especially various mojitos) and delicious Carribean/Latin/Cr","useful":0,"cool":0},"FEHaZrFbCW_kL3VzA4D3nQ":{"text":"Food is great as always, service even better. Ordered the seafood pepper pot, very delicio","useful":0,"cool":0},"LqqxDtpk-RMd5-chxPTDWg":{"text":"This place is the PLACE TO BE for happy hour if you want the two best things in life...tac","useful":1,"cool":0},"nYbYgJ2VmW9QGt80eRuAkQ":{"text":"I'm a vegetarian and the Rum House Rasta tacos blew me away! Its hard to find delish veg t","useful":0,"cool":0},"I-1hcKQNTXFtHdn_RgcllQ":{"text":"Amazing food for a great price! Our server was enthusiastic and efficient! The nachos and ","useful":0,"cool":0},"csCPFoKpMjk6XN4vFxagzQ":{"text":"In town for a visit with a friend. She suggested this place. Good sangria and great tacos.","useful":0,"cool":0},"vhEWp927WpEM9MoAuHuBZw":{"text":"Get the Damn Good Nachos. I am about to say some that is going to blow your mind. I live i","useful":0,"cool":0},"M3VLCe2Y7NehqWNE4wyH5Q":{"text":"I used to really enjoy there food. It was my first time back to the rum house in a year . ","useful":1,"cool":0},"c3ITNAjOeTVO_dvk1Dhojg":{"text":"Went for lunch. Ordered the calimari and curry mussels for appetizer. I had the seafood pe","useful":0,"cool":0},"Un4dco0PGquC4MZmRt-Sgg":{"text":"Surprisingly delicious food! The looks of the place made it seem like a neighborhood bar a","useful":1,"cool":0},"oKpkc6aycbC5AUpyJIYZCw":{"text":"So flavorful , fresh, fantastic staff !! What a great place that we probably wouldn't have","useful":0,"cool":0},"90zBTNkL3oS-x0jZC7UvCg":{"text":"Had a few tacos, and they were nothing 2 write home about..... Im from Cali. There is a ta","useful":0,"cool":0},"8Q6GFRVXN6fRTTuYfJt6Ag":{"text":"I came across some good reviews about this place when I planned our recent NOLA visit but ","useful":0,"cool":0},"zNDHSv3JO8KLlqsfFSMATg":{"text":"This place absolutely sucks. After looking at the menu I was really looking forward to eat","useful":0,"cool":0},"GGwysz7VjTg6IflXFfgZMw":{"text":"First stop in New Orleans. We ordered the small Pulled Pork Nachos to start, easily for 2 ","useful":0,"cool":0},"CwIvjA7GbMm7ybOgr1-xBg":{"text":"This place used to be good in Tuesday's. Recently tacos went from $2 to $3 on tuesdays. Ne","useful":2,"cool":0},"xd23D-9GIX_numLFvEvEVQ":{"text":"Part of our graduation weekend celebration!  We ended up here in the early part of the din","useful":0,"cool":0},"mnlWLPgbwSlDY1XTc6JyMQ":{"text":"Great Jamaican vibe off the beaten path. Large selection of Rum drinks. We sampled a few w","useful":0,"cool":0},"cIDz0K-yeB0gLycU5PUl9g":{"text":"We saw someone eating this huge plate of nachos on the patio, and we immediately put our n","useful":1,"cool":2},"bLDV_82EuN1mj_372vi3zA":{"text":"Hot damn this place is good! Went there for lunch and split the damn good nachos for $10.9","useful":0,"cool":1},"s_aspXYolfq2rOok2X_pcQ":{"text":"Their Rum House Salad was great! Sweetness from sweat potato and warm spice from curry dre","useful":0,"cool":0},"6vBxbgDTtBiCfo1jzsSq3Q":{"text":"I love this place. The food the atmosphere. The nachos are damn good. Everything is good. ","useful":0,"cool":0},"bZ3J1OJeP7Bb2djeuDWvuw":{"text":"With so many options, all so fairly priced, I always have a dilemma. Do I go with the taco","useful":0,"cool":1},"qFpOgT-6F5GI9UyOvUJ1Dg":{"text":"Went in with a party of 16, they explained the wait would be no longer then 20 min, 90 min","useful":0,"cool":0},"Ie7gkpsW0ST4ezoetaXN1A":{"text":"Would happily invest to open one of these in Chicago! I dream of your nachos and drinks da","useful":0,"cool":0},"VUrqyUX8ar-FcuXkohZaqQ":{"text":"First off Nachos was the best nachos I've ever had. The Red Curry Shrimp filled my tummy u","useful":0,"cool":0},"COD5_l6FFrafW8a7eKDq3g":{"text":"Look, Rum House is a crowd pleaser, obviously. This past Saturday night, packed full, with","useful":1,"cool":1},"CqIZ-DfCOXm9IqicXc4P8w":{"text":"Wow great service. The rum jalapeño fused bloody Mary's off the hook. .Great. . The tacos ","useful":0,"cool":0},"8m2gFhkS3gVvKYPRGIYieQ":{"text":"Get the nachos!!!!! These are the best nachos I've ever had. The rest of heir menu is real","useful":0,"cool":0},"oQpkf3nyocMd_AL96OHmHA":{"text":"Came for an early 5pm dinner on Sunday and bf ordered 4 tacos, 1 side of veggies, and a ha","useful":1,"cool":0},"pZ8C0AV6HLZfSro201i4Gw":{"text":"OK..so an update for this place.  My wife and I went back (just the two of us) and had a m","useful":0,"cool":0},"pR4NHGZ_NGNXQIKirysKvA":{"text":"Food is amazing. It's located off of Magazine, so expect a crowd. The servers are prompt a","useful":0,"cool":0},"uikgfcWci0ERte4Udq1L1Q":{"text":"Delicious nachos!!!!  Great place to watch the Saints play on Sundays, if you can get a ta","useful":0,"cool":0},"7dklpmuNP_3V3jBKoDocPA":{"text":"Service was and is always amazing!! Food is out of this world. Great atmosphere. If you li","useful":1,"cool":1},"-uUTS9x4JcqBBvF2c8p48A":{"text":"A date with my youngest and a friend here on a Thursday night. The chips and salsa and que","useful":1,"cool":2},"6Q__ojmFQ5cKw5t4zfeaTA":{"text":"The Rum House is a relaxing place to grab a drink and enjoy some tasty offerings.  Decked ","useful":4,"cool":3},"Wwx4DKzJ2lnhwusiLPYeOw":{"text":"I had lunch here when I visited NOLA over the summer and the tacos were amazing.  I highly","useful":0,"cool":0},"QraozdYyoMwO0TzgIWP43A":{"text":"After realizing my addiction to their salad and nachos, I feel it's necessary to upgrade t","useful":0,"cool":0},"0-O5sam97wKB0KZURbD8Ug":{"text":"So unimpressed with this place. The food was sloppy, cold and mediocre. My tacos dissolved","useful":0,"cool":0},"_XCS8lFRz2fMB48RrcBhnA":{"text":"Definitely worth the ride out of the tourist-y section. Excellent mojito (and I am a self-","useful":0,"cool":0},"IJQ18YMnCsDUU0P4gpXiEA":{"text":"I'm Jamaican, and this place was a pleasant surprise. It is a fushion between Caribbean fo","useful":1,"cool":0},"nFFPw9pqQoWOTDz084j3yw":{"text":"Been here a couple of times and I can't get over the tacos. I love coming here around lunc","useful":0,"cool":0},"7ZfzqVGKIST-gjV5U5vXNA":{"text":"We were a little disappointed by The Rum House. Our service was fine, but the food was med","useful":0,"cool":0},"8HCqOvgjEKWYieL4zYeGgQ":{"text":"Absolutely the best uptown taco Tuesday around! Friendly wait staff and great deals for Tu","useful":0,"cool":0},"NXheD7TlQDJen1nLbQ5cZg":{"text":"Awesome! Taco Tuesday could never be better. Wish there was one in Arizona! We had our fav","useful":0,"cool":0},"yaaDa2Lf0eN-PmxJ0w92fQ":{"text":"Great Mexican brunch/lunch place in the garden district of New Orleans! I had the Carolina","useful":0,"cool":0},"SMEEbu0c0sU0aECagL6DBQ":{"text":"Just yum.  Tacos we loved: brisket,  calypso beef, the single double,  and the Carolina BB","useful":0,"cool":0},"6W_mO2qkYM8WY7DGXCTaMg":{"text":"Starting with this review, I'll become more demanding with restaurants.  We have to stop t","useful":1,"cool":0},"r2XcpaqB1rcO8jyyTzoj8Q":{"text":"LOVE!! I was in New Orleans for 6 nights and I ate here twice because I loved it so much. ","useful":0,"cool":0},"tp953s32ZmaMOVLSAaMFbw":{"text":"I read a lot of reviews about how good the tacos were at Rum House, and I'm a big fan of m","useful":2,"cool":1},"RrNBN4VKTYAy3aF_d_F9Ig":{"text":"Good taco place! Loved all the rasta dishes and style of restaurant. Tried guac with mango","useful":1,"cool":1},"eqlwr0mEJlqKn383HJ-BJA":{"text":"Service: 4 (She did her job, but she didn't go out of her way to do more) \n\nFood: 4 (Mostl","useful":1,"cool":1},"F0lpqB99tLUVH9WAVRO3nA":{"text":"Worth the wait !  Good unique dishes and drinks.  I have the jerk fish of the day. It was ","useful":0,"cool":0},"5f77Xojs7wbVSjWdJR3CgA":{"text":"Very nice experience with delicious food and good service.  Long island ice tea was perfec","useful":0,"cool":0},"dYhu8SATWG20TgnhElJs5w":{"text":"One word:  DELICIOUS\nFavorite dish:  the calamari.  Simply fantastic! And that green lime ","useful":0,"cool":0},"NGUG9JioU2w4EZFaRIfJ6g":{"text":"I've been here a couple of times and never had any kind of experience that warranted a rev","useful":5,"cool":1},"Jc28KUA4fG4taafrrox2fg":{"text":"This place is not Caribbean at all.  The tacos are not to die for and the taco with potato","useful":0,"cool":0},"YFvqFEwOmcTmKU_e4dd4XQ":{"text":"My friends have always R A V E D about this place for taco Tuesdays. I have always wanted ","useful":2,"cool":1},"7bcrxGUtT46Oe4K9QClVpA":{"text":"The rum punch was delicious. The service was okay, my waitress wasn't as attentive as much","useful":0,"cool":0},"RzdpMxlN_VIi9YBqWWe0pw":{"text":"My dear friend, Rum House. Thou has never forsaken me! All the Taco Tuesday's and lunch ou","useful":0,"cool":0},"eBjzwN7vv5iMdHtzDJ5oxg":{"text":"Great, great food!\n\nThis restaurant is located right on Magazine street in a very nice, up","useful":2,"cool":1},"0q5TOVMV3dM-E4vAY3FtSw":{"text":"As many other reviews are sure to mention, TACO TUESDAY! Every tuesday, all tacos and bott","useful":2,"cool":0},"u7oRMUjahMxnnO6G90C3qg":{"text":"The Rum House is such a happy place! All of the wait staff and bartenders are super friend","useful":0,"cool":0},"na_oDg37-6N5EgCHs8swSA":{"text":"With all the recent buzz,i had to check it out myself. Atmosphere has a whimsical Caribbea","useful":5,"cool":2},"zGIkqNBP6W85h5f84yRF-w":{"text":"Nachos were the best! I should've just ordered that as my entre because the crab melt and ","useful":1,"cool":1},"QyzLjnpboifhFqgm9mXG_g":{"text":"The food here is so unique, yet so good. I tried it for the first time and I'm obsessed!! ","useful":0,"cool":0},"OaNvPNMPET1q-3SUjRJyWg":{"text":"This food was soooooooo good and fresh. We had the damn good nachos- took it home to eat a","useful":1,"cool":1},"FcdkFODOJ60B-fysfr2a7w":{"text":"Delicious!! Tacos were bigger than I expected. I hear their Taco Tuesday special packs the","useful":0,"cool":0},"Si0pCiKFJ0nVZpdV7rNMWg":{"text":"Had a great lunch at Rum House! My wife and I split the conch fritters which were very tas","useful":0,"cool":0},"G0q8l7UujffPRLROEokFJQ":{"text":"Amazing as always! Come before 6:30 for happy hour magharitas and mijitos! The crab melt w","useful":1,"cool":0},"MjibY6GQTfMlm0m52CUTnA":{"text":"Service is GREAT. We just had the nachos. OMG they are HUGE and oh soooo very good!!! They","useful":0,"cool":0},"8ch3z-c3y-bIMyHc0bFsjA":{"text":"The food here was absolutely delicious! My tastebuds were sent to heaven. I've never been ","useful":0,"cool":0},"7Ab3sqB05lHwjFH3bdDLZA":{"text":"I am hesitant to give this place 5 stars, because I think there has to be that WOW INCREDI","useful":2,"cool":2},"zDyyol_t_F9QhiuB4OZsow":{"text":"Most likely best known for Taco Tuesday ($2 beers and tacos all day Tuesday) - let me high","useful":1,"cool":1},"dpYRwfjgCTLEzgfQXBWEdw":{"text":"We came in on a Tuesday for the infamous Taco Tuesday, but they weren't running the specia","useful":0,"cool":0},"WnEosgb4qacKg_jhUIAQtw":{"text":"Stumbled upon this place our first night in New Orleans. Staff was friendly, food and drin","useful":0,"cool":0},"dJHheVQGsA4WyvChazpwJA":{"text":"This place has become incredibly popular with tourists and locals alike and it's never cea","useful":2,"cool":1},"In0qJ6ivSJtKBw29pJNhaA":{"text":"TACO TUESDAYS!!!!!!! I accidentally stumbled on this spot on a trip back in february. It h","useful":1,"cool":0},"UD9ApdNak6MXSd19NQcPFQ":{"text":"I went here for the first time with my wife and absolutely loved it!! Only problem is Taco","useful":2,"cool":2},"FzU8j9SzcDpANCruED1wtw":{"text":"I love the rum house one of my go to spots when I visit NOLA.\n\nI am vegan and gluten free ","useful":1,"cool":0},"5rcIIulckLS8qgcKW6Ryrg":{"text":"Why do all the reviews go on and on about their tacos?? Nothing to write home about.  Just","useful":0,"cool":0},"zI8w5pMGuWI_cwMQdhgsUw":{"text":"Great service and great food. The plantains were so soft and yummy, drinks are refreshing,","useful":0,"cool":0},"0jghSrjH85YmdwBhnRXGtw":{"text":"Place is good the food is amazing if you like seafood and all that stuff. For me I go to p","useful":0,"cool":0},"AHRF9GBAJJLCzCjW6Xan4g":{"text":"Worth the wait!\n\nWe went for dinner, and when we checked in at the front, there were alrea","useful":3,"cool":3},"lxcgYtJ_6EkrWy6ZZt0E1A":{"text":"Three words...$2 Taco Tuesdays!!!! My favorite is the oyster taco.  They have a good happy","useful":1,"cool":0},"ig6mjjVpEaZbQnKWQYLYDw":{"text":"Although this trip's visit was about the drinks...please know their tacos do not disappoin","useful":0,"cool":0},"ttpiycpWvSoNF6FHbvtD9g":{"text":"As a taco 'purist,' I, initially, hesitated when I saw the Rum House menu. Lamb curry and ","useful":1,"cool":1},"KTjUfdo0E3El3LJdyOvOTw":{"text":"Awesome tacos. Visiting NOLA and came here after Garden District tour.  This place was on ","useful":0,"cool":0},"Rtoptl19QTInq4aQuFHkKw":{"text":"Very popular and worth the wait. Also, In the best neighborhood and a great value! Loved t","useful":0,"cool":0},"nCTBOpmWaVPzdy7V8Iin_A":{"text":"My fiance and I decided to come here after seeing an impressive crowd surrounding the rest","useful":1,"cool":0},"rmy8WA1S4I8ulUuUedqPbg":{"text":"This place is great. I ate a cauliflower taco and a jerk vegetable taco and they were the ","useful":0,"cool":0},"8oFcoDi-ROEaAQHwKgL-Fg":{"text":"The wait is long and the entire place was alive with 1/2 price taco Tuesday. I loved the p","useful":2,"cool":1},"guXwu7B8Am5BobNL2lsBVg":{"text":"This is by far the best restaurant I've been to in New Orleans. I come down from Houston a","useful":0,"cool":0},"VBswnh_2hS_MxMVSY-aMYA":{"text":"It's starting to seem like the Rum House is becoming one of my go to restaurants when I'm ","useful":0,"cool":0},"OvsFRf0CDzpdn9sO45vVYA":{"text":"In a city filled with fried fish, oysters, and andouille, the Rum House is a refreshing op","useful":0,"cool":0},"A_SxVNOV2ZxcaNYSfpJV8Q":{"text":"Rum House has a good location on Magazine Street and it is always packed (mostly with coll","useful":3,"cool":1},"dgHSD_Ojt_-SELAgfFKx2g":{"text":"The Rum House was delicious! I tried the nachos and the jerk chicken quesadilla! My girlfr","useful":0,"cool":0},"vweQSUFNLtEcZqyzPeJg1Q":{"text":"Love this place. The food is delicious and tacos are bomb. Drinks aren't very strong in my","useful":0,"cool":0},"hyqW8e28IUpTHbwcyfSiqQ":{"text":"I would only come here at times where they have reduced prices because i find it hard to b","useful":0,"cool":0},"bBI6-P6ZqdANZ7Djpz6UUA":{"text":"Always enjoy the tacos from this place. We like either dining in or taking food to go. Gre","useful":0,"cool":0},"Q6TgMj-7gLb4MQcHgzSTgw":{"text":"Great happy hour margaritas mohitos!!  Also the jerk chicken tacos and sides were yummy!!!","useful":0,"cool":0},"zLhCUU79Wxlkw_1nI2_-Ng":{"text":"I gotta say, I loveeee the rum house. Even though the wait can be long, it is well worth i","useful":2,"cool":1},"8aWJNUqwAUCDeKIBPD81gg":{"text":"Definitely a great spot to go to in New Orleans. The food is excellent! They do offer happ","useful":2,"cool":1},"bV3Zu2vgD6HQAkC5Clnd0A":{"text":"What an absolute dream . Love the low key vibe and I have never had better service in my e","useful":0,"cool":0},"xd4xwufZFmls_ZkeyX2Svw":{"text":"Big thanks to Jonathan and David for making my sisters bachelorette lunch such a fun event","useful":0,"cool":0},"RNj7x0GDZJ0vPnBgi-E_6g":{"text":"Love taco tuesday here - but even on off days, the taco trifecta is so worth it. With a si","useful":0,"cool":1},"yN9UiNNgDB7sOUbUs0wraQ":{"text":"Taco Tuesday delites...on tuesdays all they're tacos are listed at $3! And it's a true ban","useful":0,"cool":0},"bo3E3jdpSAzaPdWnTmPpVw":{"text":"This place was great! A little packed but the food is DEFINITELY worth the wait! The nacho","useful":0,"cool":0},"pk7YK-2ieq1wmK3iodjltg":{"text":"Probably my most favorite taco place in the city! I was introduced to Rum House as an upto","useful":0,"cool":0},"YmynOl87BItzraGy0NA2pQ":{"text":"If you know Caribbean food, this ain't it. Drinks are good though and decent enough for a ","useful":0,"cool":0},"iKvxANuPyYjpaua8cpDo_Q":{"text":"Rum house is actually pretty good. I would recommend it to someone. The mahi mahi tacos ar","useful":0,"cool":0},"A1HAYNxkVWxeLTD51Jez6g":{"text":"Come for the drinks! Best Pain Killer I've had! Mojitos were ON POINT! ....The food... med","useful":0,"cool":0},"OEGPAcNINeEIZHtJlVYnLQ":{"text":"This place was okay. Not great and not terrible. \nPros: handmade tortillas, rum punch, ove","useful":0,"cool":0},"oIg1rIyaLVWwb9pueY8Fxg":{"text":"Pork nachos.  Mango Guacamole.  Red Curry Shrimp.  Amazing.  Others got kids tacos, assort","useful":0,"cool":0},"q_BaA6twHefvJnFQQ7kxtg":{"text":"The food is amazing, great venue and the staff are very friendly. Always on my list for ei","useful":0,"cool":0},"o2JVEPpiQJAD7F4AwYBK-w":{"text":"If I could give more than 5 stars I totally would. The tacos are phenomenal. The drinks ar","useful":0,"cool":0},"bmqNOXwVptzpNDRb-2dzew":{"text":"Came here on the recommendation of one of our Uber drivers while visiting NOLA. It did not","useful":3,"cool":0},"qx1c0ZhrnS1HtDA2Bmz8Gw":{"text":"Some of the best fish tacos I've had- pork nachos were amazing as well. Didn't love the su","useful":0,"cool":0},"ceO1xP6r-Z9LXLttuYq-rA":{"text":"I usually have a great time here after I drive 7 hours from Atlanta. I went yesterday and ","useful":0,"cool":0},"E3GJCk7MpoLs8uV0gQ5bWA":{"text":"Fun and lively restaurant in the Garden district with great cocktails but just meh food. W","useful":10,"cool":6},"UHeF3jEPdWiRal5ugLonwA":{"text":"I've been to New Orleans many times and I can not believe I have never set foot in this re","useful":0,"cool":0},"TfzLhDtKqaT4-Sf-HEx0Xg":{"text":"Went here with a friend last night. I usually have been to rum house with my family and al","useful":0,"cool":0},"P7uut2WFOxKcvCxBDOsk2w":{"text":"I've come here several times. It is all about the Caribbean taco menu. Get a plate of thre","useful":3,"cool":0},"9noRzDzDFMb8XxUZy98rQw":{"text":"Tried this place on a recent visit to NOLA.  Their Bloody Mary made with Rum was delicious","useful":1,"cool":0},"P89RKbiw3zyPS90iXDsAxQ":{"text":"This place is jam packed with young hip people in their mid twenties and early to late thi","useful":2,"cool":0},"l6c9NaJ13P369HqWiZ7pUA":{"text":"Hello bandwidth killing website. -1 star just for that. Seriously people, abandon Flash li","useful":1,"cool":0},"6XZh7mGT9SFHciZn5zJfLg":{"text":"Been here twice since my recent move to New Orleans, and both times I left very happy.\nEve","useful":3,"cool":4},"3RcQXxGpUhnOcnnG-AmirQ":{"text":"I have eaten here for years. It's always best to go to their Taco Tuesday bc the tacos are","useful":0,"cool":0},"M_okJo7SqDVwL76IPEbJBA":{"text":"The Rum House on Magazine St. in the Garden District of New Orleans is exactly what it sou","useful":9,"cool":6},"Vy7LIwg9dnp8nHKEh_OU6w":{"text":"With a hankering for some fresh seafood and rum, we headed just down the street from our A","useful":8,"cool":12},"dqHmgNGaPSurVLqV2YffQg":{"text":"Their tacos and chiladas are my favorite! I like sitting at the outside tables when the we","useful":2,"cool":2},"0Pca6BdGMoCWxd8ZfSMdJA":{"text":"The queso is to-die-for!  I wish the steak were a little cheaper so I could enjoy it more ","useful":1,"cool":1},"x0W7-DWDHHnzekGKRGT-VQ":{"text":"The hostesses were friendly and accommodating. Our drinks were tasty, but our tacos were o","useful":0,"cool":0},"2UV5F0EHOgIQ8OtzvTjB3Q":{"text":"Went here during happy hour at about 3pm on a Friday afternoon. \nWe were very happy with t","useful":2,"cool":0},"tW41tig5MFQZbK60MqccJg":{"text":"I really like the vibe and the food in general here...\n\nI have a few small criticisms but ","useful":0,"cool":0},"NUttg3by0726CwvA8FieWg":{"text":"Love this place. Every time we go uptown this is the place to go. Such a wide variety of f","useful":0,"cool":0},"z-q7ZRCP5m65twoNWAFzVg":{"text":"I love, love, love this place! The tacos are creative. The atmosphere is fun. Grab a table","useful":3,"cool":2},"aWcrZvtJVYWmYo-TkB2nDw":{"text":"The nachos are absolutely epic. Chips are fresh, the pork is full of flavor and the nacho ","useful":0,"cool":0},"-iQCaCc5xWPa2OzKpr7oiA":{"text":"This place has become one of my regular spots to hit when visiting New Orleans. They have ","useful":1,"cool":0},"c9b1tkjddUpgzCbRb1VtCQ":{"text":"I haven't been to Rum House since 2009...you read that right.  I came a few times after th","useful":2,"cool":0},"wmRLKYWwchA-D2IRW5JqzQ":{"text":"The Rum House is an extremely popular restaurant in New Orleans and because of that is usu","useful":3,"cool":1},"9p0QcjEhKAadnL0X52WkZg":{"text":"Excellent food. We had the taco trio- I had the crispy fish, the flank steak, and the jerk","useful":0,"cool":0},"-bx0jrwCeD23FIuliBFwqw":{"text":"As a Jamaican Caribbean woman, not all Caribbean places are great and sometimes I find mys","useful":2,"cool":2},"zR27-3JYFOupDsKcDgimCw":{"text":"Come here on a Tuesday for cheap tacos and drinks! A great spot for a Bumble date or a cas","useful":0,"cool":0},"z39G0q3pLfjwOpMOzwHfLg":{"text":"Payton and Roosevelt were amazing! Wonderful men serving at rum house who were nothing but","useful":1,"cool":0},"XRrZytCguQLy-tMB7ElbyA":{"text":"Ample patio right on Magazine Street. Food that you would expect: we had nachos and beer. ","useful":1,"cool":1},"jXLwFGDv1gcMZ08UGiHvAQ":{"text":"We went for drinks so we don't have much to say about the food. The drinks were amazing an","useful":0,"cool":0},"xeExP4VGuGpVEP0KKUCcxw":{"text":"Long wait to be seated on a Saturday afternoon, but weather outside was lovely and the peo","useful":0,"cool":0},"ONgbRdX3ibmza7ekBpZ7NQ":{"text":"Some friends from Chicago we're dying to try some good food in the nola area. They were ea","useful":2,"cool":0},"PhYQLdvKiJKFeB-NnqunqA":{"text":"$2 Taco Tuesday = awesome gourmet tacos and $2 beers. That is all. . .","useful":1,"cool":1},"p8hUe_QLbi8zxY9Ki-_jHw":{"text":"This place was amazing!!! Such great flavor that our plates were empty at the end. The jer","useful":0,"cool":0},"AEdkEU8-BSSfy7SXI3_RfA":{"text":"This is one of their 2 locations in LA. I thought a place that specialized in rum wouldn't","useful":3,"cool":2},"HvITB0uKMIEXM-62zTrpHQ":{"text":"Taco Tuesday! Always good. Once the sun went down outside was was pretty nice. Everything ","useful":0,"cool":0},"33jk6YzapW87Phpq4IRwkg":{"text":"This was a wonderful place to eat and chill. The prices are really good and Jess was a won","useful":0,"cool":0},"4fq7bT39wmV6nDxKyZMGIA":{"text":"Everything was delicious. The cauliflower curry taco was the most amazing item we've had o","useful":1,"cool":1},"25ZDnHfHVnIc-yomOEd8rQ":{"text":"Rum House was DELICIOUS. There were a TON of gluten free options for me to try, that I had","useful":2,"cool":1},"ppddwTzzaQw2_F5upV-PwQ":{"text":"We came here for dinner and were just appreciative of the Caribbean and  Louisiana mix. We","useful":2,"cool":1},"owgycnBpe3FQLD4b5_xqiQ":{"text":"Came here for tacos and margs for taco Tuesday and my belly left very happy! \nFirst of all","useful":0,"cool":0},"RUHHTuzlWmCyr2LemsM3tg":{"text":"Love this place! Best nachos ever! The bartenders are amazing and Taco Tuesday is  the bes","useful":0,"cool":0},"v_guGCH2pjTEkPuWMjk9kQ":{"text":"Jerk chicken\nSimple green salad buttermilk dressing\nBrisket and jerk chicken tacos\nPlantai","useful":0,"cool":0},"014TiNxRKeC0JKP30L0SKA":{"text":"These margaritas are some of the best you can find around here! And the tacos are absolute","useful":0,"cool":0},"1UVg-626c3dvi_2l2i1NTg":{"text":"They took the polenta off the menu, not a huge deal, but they also took all of the gluten ","useful":0,"cool":0},"uOPQQCo3MgFJAxnnvKvUZw":{"text":"Great food and great staff. Wife had the avocado mango salsa, we shared a queso dip and I ","useful":0,"cool":0},"Cmj3M9m7-aWN-2IrmeAfOg":{"text":"This place has it's good and bad days, good on my most recent visit. Suppose it depends on","useful":0,"cool":0},"XHlGCmNakVkDbk-n-IUwXg":{"text":"The reason I really like the rum house is for their salads, great salad options and good s","useful":1,"cool":0},"-xGe2RBK_U9z5QJc7RqhFQ":{"text":"Cool spot. The nachos were \"damn good\"! We shared the nachos and still had a ton leftover.","useful":0,"cool":0},"GwyYb7lcAyAJdfipj6t5YQ":{"text":"This isn't really my kind of place, if Jimmy Buffet is your vibe it might be for you.  I p","useful":1,"cool":0},"HHJ2116FT3nE-8Ql-h9Wuw":{"text":"Came here for dinner \nIt was very crowded \nWe had to wait \nSo we went to the bar to get a ","useful":1,"cool":1},"98z06Iu2evfz72S_DcjrWw":{"text":"*3.5/4 stars, but I prefer to round up*\n\nDecent spot to grab a drink and some apps with th","useful":14,"cool":11},"VqlQ9B9x9TqQYjZ_8Vb4Hg":{"text":"A nice change from the usual choice of restaurants around town. The menu is Caribbean insp","useful":2,"cool":3},"l7FN1Y8z8WPU8ufzihDScA":{"text":"This place definitely screams Goodvibes. Wonderful Caribbean atmosphere and the service wa","useful":0,"cool":0},"EJxMUfHqjJh8RRBCXI0JbQ":{"text":"Tacos are a must. Great environment and worth the wait. Would reccomend getting a side alo","useful":0,"cool":0},"hJLnSfB-SFudN1YPJBImXw":{"text":"I rarely write bad reviews but my last experience at Rum House was not a good one. I dined","useful":0,"cool":0},"i2JyRSD8kS4uJt9sWrwVIQ":{"text":"4th stop on the food tour and the Fried Oyster Taco was delicious!  Highly recommend.  5-s","useful":0,"cool":0},"6DjGgxNEtZ6aq68nCWBQtw":{"text":"The guacamole and chips are incredible. I got the trio taco plate and it was so delicious,","useful":0,"cool":0},"4_VXPQLlIs0ttgner8eAGg":{"text":"yum! per the recommendations of our semi-professional tour guide, we ate here. I was very ","useful":3,"cool":3},"z7aXgsDyym3C32QstU4GCA":{"text":"New Orleans truly has some of the best food in America! We visited the Rum House off of re","useful":0,"cool":0},"yTViec97OSZMpR43pWsu-g":{"text":"No Taco Bell today or even traditional tacos. We decided to go out on the limb and try som","useful":0,"cool":0},"xVFLNiIhiDMZH9ooZhoyZA":{"text":"WOW. I had a really great experience here. It's not very often that people take my food al","useful":2,"cool":0},"HnJseea0-L4ca5ylKXB_iA":{"text":"It's gonna be a no from me, dawg. Came on Sunday night a little after normal dinner hours ","useful":0,"cool":0},"02Rsy1a2mtbSZ4HBAo8_rA":{"text":"The new hot cool spot that lives up to its rep. Weekends include a long wait time , but th","useful":0,"cool":0},"LlF2CnvkzrYsldFbgdSTAA":{"text":"Found this gem in the garden district. The fire roasted salsa was amazing & each of the ta","useful":0,"cool":0},"W14D_HQRm1K-TmLoXQYilw":{"text":"I went to this restaurant for Sunday brunch. There was maybe a ten minute wait. Staff was ","useful":0,"cool":0},"WPECHdCrxYxtOZ7xV2u4eA":{"text":"Love Rum House! The chili glazed tacos are my absolute favorite! The fried plantains are d","useful":0,"cool":1},"8654rev9txmfE0kJ1OFpEQ":{"text":"The Rum House has been on my list to try for what seems like forever.  I like tacos, they ","useful":10,"cool":6},"TslDL69SvaaW51wgal8qyw":{"text":"This place has the best salads I've had in the city. All the seafood is super fresh and yo","useful":0,"cool":0},"_pg2QQDi3oe7OJG4TXN26w":{"text":"Alright this place crazy busy we went on $2 Taco Tuesday which, by the way,  no matter wha","useful":0,"cool":1},"LkO7c1E_j-Pg1Y5TqKc18g":{"text":"The food is probably only a 3 star but the way the restaurant handled an incident with our","useful":5,"cool":2},"5W4EAg2OQ1naB5URfiwbrA":{"text":"This is my favorite spot in New Orleans. The device is quick and courteous. The staff is a","useful":1,"cool":1},"AAFXSc2LDuJNjie1QJj5fQ":{"text":"My family and I went on vacation to New Orleans last month. This restaurant was one of the","useful":0,"cool":0},"vYKTQykZlrFiIyC9e-UIJw":{"text":"The absolute best food I've had in New Orleans. Tacos are divine, all the toppings and fla","useful":0,"cool":0},"TaIX6OSJEdiDr-Dz08XEeQ":{"text":"The food is always good, comes out quickly, the beer is cold as it should be and the price","useful":0,"cool":0},"RLMGSVT0W9gDd45kiTWdCA":{"text":"We came here on a busy Saturday afternoon looking to switch up the Creole/Cajun food that ","useful":1,"cool":2},"mNRQvGU2EgRalEnKkllcfg":{"text":"The rum house is a super busy place all times of the day. I've always had consistent tacos","useful":2,"cool":1},"tttPBXBpf-4G6HjqDoowBw":{"text":"Rum house is a classic goto for tacos nachos and a good time. The staff is great as well n","useful":0,"cool":1},"S0S86bf3QJ4hZ0YR-1NVxQ":{"text":"After hearing rave reviews from friends I was excited to stop by, even if it was a crowded","useful":3,"cool":1},"xEnYjhvtib3jP-oNXwpXng":{"text":"Great tacos and drinks and friendly service!  Didn't have the nachos but they looked prett","useful":0,"cool":0},"G3K29XdJSYZGp0slgPf1yQ":{"text":"Customer service was exceptional. Their alcoholic beverages are  greeeeeat and pitchers ar","useful":0,"cool":0},"1txAn83EGGN-KkS6dG7P9w":{"text":"Absolutely the best place to get Tacos, especially on Tuesday's. They were all delicious, ","useful":1,"cool":0},"k14v6X5qWyQv7wwHXgQ8vA":{"text":"I can't believe it took me two years of living in Nola to finally eat here. I worked up th","useful":4,"cool":4},"TGRWIK_NY0RXfRCFuNgDuA":{"text":"GO OFF PEAK! Most negatives cite long waits & slow service (uh, get a clue schmos);\nCHEAPE","useful":6,"cool":2},"9kboOMbhRMZE2Ib758p4tA":{"text":"Sorry folks, The Rum House just didn't blow us away.  We waited 45-minutes for a table on ","useful":1,"cool":0},"ECGly5LIx3hkE5UnvuQahg":{"text":"So happy to have fabulous food just down the street from my airbnb. Spicy tacos that I did","useful":0,"cool":0},"-_SevLa41hdP_hwGR0mlVg":{"text":"We only had salads and some drinks but I really liked this place. \nA nice Caribbean twist ","useful":0,"cool":0},"7qkIFG14P9bkEs-x1xPT2g":{"text":"Excellent tacos, excellent cocktails - chunky monkey frozen drink was like dessert with al","useful":1,"cool":1},"LQGcRIeh7Py8TJoBfOIBUg":{"text":"Taco Tuesday! Always good. Once the sun went down outside was was pretty nice. Everything ","useful":0,"cool":0},"xFFBKIlUtH1Ay-xxXeAanQ":{"text":"Best tacos in NOLA hands down. If you're craving tacos (get your mind out of the gutter) a","useful":1,"cool":0},"PmzThQDpTgRh5_x9Kipobw":{"text":"Best tacos I've ever had. Nothing compared to the little taco stands in my hometown Fort S","useful":1,"cool":1},"Z5yeCSHsMbJF4p_U4O2LAw":{"text":"Alex (bartender) and Nick (server) were so nice and kept a safe distance while providing e","useful":0,"cool":0},"uO_QBGFinKUlKVJD6LOdbg":{"text":"I've been here many times but only to drink, this time I actually tried the food. OH MY OH","useful":3,"cool":1},"-KPf3h2lqaYZIU9qy_jw4g":{"text":"wished we had a chance to come back again during our trip bc this was one of the best plac","useful":0,"cool":0},"4jWzqSpofVHya2Jx-LMlwg":{"text":"Fun! friendly, nice atmosphere, this place rocks! \nA rum house kind of place, with outdoor","useful":2,"cool":2},"2Ibxf9C3X9hdWiowsYU0jQ":{"text":"If you want a mix of Caribbean and Mexican foods then this is the place to go! For Taco Tu","useful":0,"cool":1},"_Kz1j2tHwvIuqCUHPTysdA":{"text":"Sigh.....I am writing an update to one of my more favorite haunts in New Orleans, and it i","useful":1,"cool":0},"Yy12x6mdK9beIvvdWrussQ":{"text":"Casual dining on Magazine St. I have not tasted anything yet that I did not like. The taco","useful":0,"cool":1},"1Qwk4kDqC5VyW82N5txSfQ":{"text":"So, to start, the \"nachos\" were awful, which is a shame, because this is an easy dish to w","useful":0,"cool":0},"jHG56UPaQwboD77Oug9tRg":{"text":"Best food! Ever!! The chips are the best! Same with the damn good nachos!! I'm so coming b","useful":0,"cool":0},"FyPllPAETfSNs0rSuovYHg":{"text":"we love rum house - have never been disappointed. i'm a big fan of the shrimp and mahi mah","useful":0,"cool":0},"WZg6jUMLbdld44lKQukqkg":{"text":"Awesome tacos!  Ordered the trifecta taco meal; jerk chicken, chipotle shrimp, and duck du","useful":0,"cool":0},"gFR5dH-ZD-wykh-OYcxCaw":{"text":"Perfect spot for a great meal at a reasonable price. There's a reason why this place was s","useful":0,"cool":0},"UOA5JaCRqGP78osd81DJ7g":{"text":"Came here to dine and see the shops and sites.   Really enjoyed our dining experience here","useful":0,"cool":0},"yLOaRCm6LKVsJvzxlxwcMg":{"text":"After much eating in N'awlins. not all of it very good, Rum House was an amazing surprise.","useful":0,"cool":0},"uwKs5HQ23Xpwyi5yGWef-A":{"text":"Yum, yum, yum. The Damn Good Nachos lived up to their name. It's probably the best queso I","useful":0,"cool":0},"IihpQFp3McvbLDCb3iQgbw":{"text":"MOJITOS are a must if you visit here. The Chorizo Queso Blanco is a really good appetizer,","useful":0,"cool":1},"NgjxOd8qYJZlRDitTi2vTg":{"text":"Ok, so the rum house is old (-er) and it's been our favorite happy hour spot for a long ti","useful":1,"cool":0},"1mOynwgEbLJpW_ZeFYH2sA":{"text":"I know I know, in the minority here so I'll start with the positives:\n\n+Drinks are awesome","useful":2,"cool":0},"v-RE_e_cbP2wSkPnI3QdPA":{"text":"There's nothing like tacos and Sunday afternoon football! My friend and I were giving ours","useful":1,"cool":2},"nZ3lTZ7_8iVuv3Q9T_bb3g":{"text":"Best day to come is Tuesdays as they have discounted tacos. We got 4 tacos each that were ","useful":3,"cool":1},"GpL-OD0ctDfk5rzKlQbAhA":{"text":"Really terrific food! We had a couple of the tacos - the calypso beef and the Flaked Fish.","useful":0,"cool":0},"uPTDPtpjVq9NN3kjKo25Lg":{"text":"Amazing Caribbean tacos in this place. Definitely get the fried shrimp one! Their drinks a","useful":0,"cool":0},"rywKglkIFBkJ2jtP0WVDbw":{"text":"Great spot on Magazine. \n\nSat at the bar and had good service. Jess and Ace were friendly ","useful":0,"cool":0},"bsOPFYDEORSoVQ9mu5A69Q":{"text":"Food is always good and fresh.  Casual atmosphere.  Great combination of seasonings and fl","useful":0,"cool":0},"6cNAPXcXIhX4rhGINhtNQQ":{"text":"Tacossssss and margssssss and sangrias oh my! Gotta get to this spot early that way you ca","useful":0,"cool":0},"qTmPCLFCYn7p2D8zo1QcgQ":{"text":"Is an Ok place. Is more caribbean cuisine than mexican in my opinion. Was a 1 1/2 wait but","useful":0,"cool":0},"PhQQQ5cOZJM78avQYBJzNg":{"text":"My guilty pleasure in NOLA. I love Magazine St and all the businesses around here. Taco Tu","useful":2,"cool":2},"3SWWTOvaN5diw3lg9CC-EA":{"text":"We loved the variety of tacos here!  Especially the chili glazed shrimp.  So delicious.  P","useful":0,"cool":0},"fKJCxdjXCB4ptYQP77ZNeQ":{"text":"I've missed having a Baton Rouge location so of course when I had business to take care of","useful":2,"cool":2},"N_EU5-DKIxVn32CLeXcTyA":{"text":"We were walking pass Rum House and it looked so lovely that we decided to stop in. We took","useful":2,"cool":1},"4QXWDER9JPzu_i5tVUCYIQ":{"text":"Stopped here with a friend for some tacos and oh man it did not disappoint. We got the tac","useful":2,"cool":1},"qM64ZznJaDTfEG0aFGTlKA":{"text":"I've been here a few times now and it doesn't disappoint. If your looking for good margari","useful":0,"cool":0},"xnNmOxvFruuIppvzr2CuIw":{"text":"I come to the Rum House because I love the pain killer - a delicious fruity drink of rum, ","useful":5,"cool":2},"oul8NPl99QcTG25sw77oug":{"text":"The flavors served up here were really weird, but totally yummy. Watch your wallet if you ","useful":0,"cool":0},"lKpvPeMCxUcrueGEcxPS_Q":{"text":"BEST PINACOLADAS EVER! seriously I think I drank a strawberrycolada in one sip the first t","useful":2,"cool":2},"uOrQNHjQy1LqoGxOOYanRQ":{"text":"I always enjoy myself at The Rum House. It was a nice day out so I was able to enjoy my di","useful":2,"cool":1},"4qGnAmnoRsSXndolCx1Njg":{"text":"I must say, Louisiana has the BEST food. I was here on a trip and decided to walk the area","useful":1,"cool":0},"xUjgqWfQmu95n6UQOiOTNw":{"text":"It's hard to imagine leaving a bad review for Rum House, because I love It. I've been ther","useful":0,"cool":0},"A8wDdQTX3vv8qPCx8kbZcg":{"text":"The Rum House is currently operating out of Red Dog Diner.  Indoor seating is rather limit","useful":1,"cool":1},"ROWF8TLnEcRFegcgYQ92Ag":{"text":"There literally was a line out the door when we strolled by, (always a good sign if you're","useful":0,"cool":0},"GfI4m6AfXrsGyTSnNhT7Pg":{"text":"This place is so over hyped. I'm not sure what people actually enjoy about it besides it's","useful":0,"cool":0},"sLrJ0vOXn66hBJXwoSjBdw":{"text":"Our intended one-drink stop for happy hour turned into one of our best stops while visitin","useful":0,"cool":1},"7hZhzQWqZY4ok7jaGRuEbA":{"text":"The Rum House used to be great. I gotta say though, passed few times I've been the quality","useful":2,"cool":1},"dPcR1fyMWoFzhp_2HGsvfQ":{"text":"Went to rum house last week and this girl named Ally was our bartender. She was hot asf 10","useful":0,"cool":0},"bYF8lznpbx6fWriEjKJOew":{"text":"Went here for lunch while visiting NOLA. Stopped in this place because it was enough to se","useful":0,"cool":1},"TTz4zeFK7jW-jdhUI1C52w":{"text":"Decided to check out $2 tacos Tuesday and beer! We arrived at 8:30pm and the wait was abou","useful":1,"cool":0},"BPdwOcpPvEqr7dJ9wamMvA":{"text":"The atmosphere is fun and we had great service. The drinks are heaven. My adult daughter h","useful":0,"cool":0},"-DJh1vTUHHQReel0tNh28Q":{"text":"My friend and I came here for lunch, and it was absolutely delicious! I loved the tacos an","useful":1,"cool":1},"rlIkLQemAzFQ__rYAoxYmw":{"text":"This place is the bees knees. It came highly recommended by my parents after a visit to NO","useful":1,"cool":0},"lov3T1a8Xz-m78AKCWewwg":{"text":"Tried several Tacos here (jerk chicken, crispy fish, steak, shrimp) and while each was fin","useful":1,"cool":0},"c3d0djZy2Ra4bLai1upMOw":{"text":"Love this place. Taco Tuesday is ritual of mine. You can't beat the prices and the quality","useful":0,"cool":1},"D0p6Cv8tscqnG0UKTUmANA":{"text":"Food and atmosphere is always amazing  rasta veggies and fish tacos can't get any better.","useful":0,"cool":0},"1cm2oxALvHbIcima57WzYQ":{"text":"Husband and I went on a Thursday night. My first time having Caribbean food. It was a succ","useful":1,"cool":1},"bBNv2uQhgWnU2EKdgEh-cA":{"text":"This was our second visit to the Rum House, it's going on the regular list. \"An eclectic C","useful":1,"cool":0},"1n6WBzzeX0f89ktUJCW80Q":{"text":"Great little taco place on Magazine. Pretty gourmet tacos, so a little pricier, but they'r","useful":0,"cool":0},"7NnIdfpXUHHAqqQUx8FJ3g":{"text":"Get the Nachos! Comes jam packed like New Orleans traffic with a bunch of toppings! Very g","useful":2,"cool":0},"gjA5czjkVDPhzlFRz5hEvg":{"text":"Ok, I give five stars to the staff!  They are polite and always wear a smile.  Unfortunate","useful":0,"cool":0},"8Wdi0knKTuCyGzaeWMp1yw":{"text":"My mahi mahi sandwich was pretty good, and made for a nice shopping break. This place is s","useful":0,"cool":0},"TuQGoezY_nXjfd6vzMOKcQ":{"text":"Went to Rum House for their Taco Tuesday deals and it's as pretty good! My party and I got","useful":6,"cool":6},"otU0DSwdgs4wPfqcr2mlag":{"text":"If you like Latin food, this is the place for you! It is such a cute place right on Magazi","useful":1,"cool":1},"gQaGOaw6-rdmcQNd3OY4AA":{"text":"Tacos! First place I stopped by after landing in New Orleans. It was pouring and I was tir","useful":1,"cool":0},"s5IvIw7PuYU5Oj5WttIezQ":{"text":"The mango whatever way you order is to die for. The fried oysters taco was kickass! Fresh ","useful":0,"cool":0},"szMPxXEJhzTfBBVGqOXbUw":{"text":"Favorite spot my cousins and I love to go to! Taco tuesday is amazing and the painkillers ","useful":1,"cool":1},"Zt0Pwh623N-Ir6idByqMjg":{"text":"Love coming here on Taco Tuesdays for $3 tacos and $5 margaritas! There are so many delici","useful":1,"cool":0},"7leoS4fwQsk7ZUyQr2_UqQ":{"text":"My son and I ate lunch at The Rum House on Magazine Street and were served by Jessica.  Sh","useful":1,"cool":0},"GWoTqX9ChP7ldW-tpS2Dow":{"text":"A bit busy, but worth the wait on taco  tuesdays. The scallop tacos are not something you ","useful":0,"cool":0},"GQyyzAJsdzwMrJgDSfP_3A":{"text":"I went on a Taco Tuesday, there was a bit of a wait, but we were able to order drinks at t","useful":0,"cool":0},"DViEzRWejYoPtEOGn9H5hA":{"text":"I had been wanting to try Rum House for a while, and tonight I had the chance.\n\nWhen I wal","useful":15,"cool":8},"I5cCcVIedCKYTNXw4DSQRg":{"text":"Host was very welcoming as always. The waitress was named Jess, she made sure communicatio","useful":0,"cool":0},"4Cyi0ixcAo9hrYX1Rnl4-A":{"text":"Delicious!! Every item on the menu sounded so good that I had trouble choosing, but I ende","useful":2,"cool":1},"uk_7HcIm2-8nUeK2CSqjFw":{"text":"This place is amazing! Drinks are great! Food is indescribably amazing! Wish I could take ","useful":0,"cool":0},"3kLEAD39_FbVCLyQSaNFHA":{"text":"Nachos and tacos were good, but I ended up getting sick from the veggies. I should've know","useful":0,"cool":0},"HZIRXUb26XiBZosw50s44A":{"text":"Tried 5 flavors of tacos and they did not disappoint!! Give this place a try. Currently th","useful":0,"cool":0},"EjdN-mP6YeF0ymwwnum6Fg":{"text":"We went to Rum House last night for dinner and it was delicious. We had about a 30 minute ","useful":1,"cool":1},"Sr0R_tiFr4THcmsiL6DybA":{"text":"This was amazing! The food was great and so was the service. They have you wait in line to","useful":0,"cool":1},"Dqn4l4bk9WQsv_t3sFcV3g":{"text":"$2.00 tacos on Tuesday? How could you beat that! Great selection of tacos and side dishes.","useful":1,"cool":0},"oHfn0CC3XcwFmPbUCC67FQ":{"text":"Fun spot for rum drinks and Caribbean inspired bites right on Magazine street. We went on ","useful":2,"cool":1},"nnNuUyMinH1l4UBmnJ7R3g":{"text":"Had the avocado mango dip and a couple of tacos. It was good. The tacos were tiny but tast","useful":0,"cool":0},"IF-OpxXbNo2H1oh27idObw":{"text":"Poor excuse for a taco bar. Drinks were the best part of my meal. They had the audacity to","useful":0,"cool":0},"WZJO0QSbO26VUiGKPhvlxA":{"text":"**SO-SO HH DRINKS ON MAGAZINE**\n\nWent straight to the bar and skipped the tables.\n\nNOTE: H","useful":11,"cool":9},"GLjNH7mhSoltzE808H_Rzw":{"text":"We only came in for the Happy Hour Margaritas, which were very good at $4.\nThe atmosphere ","useful":2,"cool":1},"sbBu_2yLy5U4IuCtjidEUw":{"text":"On an adventure that took me to this place. It was a good find. From the outside this plac","useful":22,"cool":20},"ZX9ELd7JHZ_udyluqp5FIQ":{"text":"Perfect spot as my friends and one were roaming around the garden district. Luckily there ","useful":0,"cool":1},"wtvjdibwHouaV16rN4MsIA":{"text":"Rum punch, jerk chicken, and guacamole are just some of the few things I greatly enjoy whe","useful":1,"cool":1},"dQ_EX_1Wao3slqqy6cuJqw":{"text":"Rum House never disappoints. Always good. Favorite is always their Plantains. One thing I ","useful":0,"cool":0},"926_020x9_q4tnwtNzhDrg":{"text":"Sometimes you'll have to wait for a seat but it's always worth the wait. My favorite nacho","useful":0,"cool":0},"EIP7CvvQABQPI7S18tlojg":{"text":"What's not to like about Rum House?! \n\nI'll keep it short but sweet... Staff is friendly a","useful":2,"cool":0},"u9B8U1ByxZ_ez7MwXHdVXQ":{"text":"Rum House\n      Looking for more of a nontraditional Taco spot? Then you need to check out","useful":1,"cool":1},"higL3593Jjpv8W2LgCzT6A":{"text":"The tacos here are to die for! I usually get the duck tacos and a random pick. My other fa","useful":3,"cool":3},"HJckSfTwIm2G1VBASTvNdQ":{"text":"This place was pretty busy for a Sunday lunch, but we were seated right away. \nThe hostess","useful":5,"cool":3},"Rc1Ml9mn3QrMqyZ_wrWM_A":{"text":"Everything is good here. The tacos are so individually different as only be from different","useful":3,"cool":0},"hdT9zurgXHx_rPQkAfalOQ":{"text":"They have an impressive array of tacos which are unimpressive in flavor. I got the duck du","useful":0,"cool":0},"NGeHXkvVR_D62AnD-z8r3Q":{"text":"One of me & my husband's favorite place to eat when going to Magazine Street. Typically ha","useful":0,"cool":0},"5ub4AeOvaAzjBnBInfvu1Q":{"text":"If you are in need of a meal in the area of New Orleans that is not creole or Cajun, this ","useful":0,"cool":0},"EAep4n6uU-ZJ47RSB5iqLA":{"text":"Tiny tacos so don't worry about ordering several. Excellent queso and skinny margaritas (t","useful":0,"cool":0},"QhcPAemCX7u-bg1cx77r1A":{"text":"Such a fun spot, and with outside dining I can grab lunch with my dogs and people watch. A","useful":0,"cool":0},"vrqoorBhsWpcjnoPRH9Ofg":{"text":"I mean, who doesn't like The Rum House. The tacos are always delicious and the nachos are ","useful":0,"cool":2},"r-ArOh6A06nDhncVzQMJNw":{"text":"This is our go to spot for dinner! I've tried almost every dish on the menu and all are my","useful":0,"cool":0},"nX_UL2PGM-xmSZo9q_56Yw":{"text":"For my time here in New Orleans, this was a great stop. The mahi-mahi tacos and fried oyst","useful":1,"cool":0},"yV5auKYp3yHI9-vNrEVxUg":{"text":"The definition of my go to eat/drink/hang spot on Magazine st. With their delicious margar","useful":0,"cool":0},"Au1FQ4xWZ3pH3ir7lVWzWg":{"text":"This place was on Buzzfeed's \"Most popular tacos in Louisiana\" list, so why not try some?\n","useful":0,"cool":0},"yCXJwn3ogPD-hAsoRSBSNw":{"text":"The food was amazing & the prices are super affordable! The staff was friendly and the foo","useful":0,"cool":0},"J4Uo2MZWuOeOA-c_AfYFtA":{"text":"I've posted 3 pictures of the nachos from three different visits because they are that goo","useful":0,"cool":0},"aDzqL-YIkp1TYDQh2beDHg":{"text":"BEST nachos!!!! They are HUGEE though so definitely great for sharing haha!! Also the drin","useful":0,"cool":0},"nTQQ03lLpHVRPXeir9Cc3g":{"text":"Every time I'm in NOLA I have to go to rum house for the Rum House Salad, and don't forget","useful":0,"cool":0},"j6lxaIZovTxYTwowd8kcdw":{"text":"Calypso beef, fried oyster, and jerk chicken tacos were so good. On Tuesdays only $3 each ","useful":0,"cool":0},"H4erLwc4YGsHp6PloHIk7w":{"text":"I love this place food and drinks were delicious!!!!!! I love the atmosphere a must go to ","useful":0,"cool":0},"LsnrwswDc9NHcRlBcUXjvw":{"text":"The tacos were amazing and the Rum Punch was perfect. Great atmosphere and nice waiters!","useful":0,"cool":0},"WLfeGpTFd882FAkFFdo6mg":{"text":"Amazing tacos!! I highly recommend the chopped shrimp, calypso beef, and pork mole tacos. ","useful":0,"cool":0},"mVC1bAhRq-4o0FcORDnvjQ":{"text":"We enjoyed the tacos and the cocktails were very good as well. But most of all the service","useful":0,"cool":0},"XCD3xXqmYBIyGr8GeWwDxQ":{"text":"WHERE TO TAKE THE EUPHEMISMS\n- fatuous guests that don't eat fried food or fish?\n- a blind","useful":4,"cool":1},"BcVti3xbeVg0MgHxqTvgfw":{"text":"The Rum House is one of the few restaurants that I've eaten at multiple times. The food is","useful":1,"cool":2},"n5MWGXDoeyUMS_BLV6Debg":{"text":"So... Rum House.. My first time here.. ~\nMy BFF and I came here one Sunday evening for som","useful":6,"cool":3},"wT96_w9Nlf69hQVce7L9cQ":{"text":"The only thing good at the Rum House is their nachos. Never understood why they get so pac","useful":0,"cool":0},"Kz88BJLZOwFHQLWDIxNY6Q":{"text":"Wow! Friend told me to visit this place with my friends and I'm glad she did! Food service","useful":0,"cool":0},"0W3N9-sCWuH5O_sTC3Es5A":{"text":"This place is amazing! If you're ever in town and want to try some thing definitely stop a","useful":0,"cool":0},"GwEj1ttM74jZCmFrGQJ0jg":{"text":"We had an amazing first time experience! Went for late lunch and were served outside, wher","useful":0,"cool":0},"e7Le6JoLLzwR6F2iADsDeA":{"text":"I'm definitely a fan of the Rum house. I visit New Orleans often and have been to the Rum ","useful":6,"cool":1},"GmTNhBKLpRHDOqgq2SVLnw":{"text":"Amazing atmosphere from the minute you walk in. Bar tenders were great and got our drinks ","useful":0,"cool":0},"C_R-ak4ZGzCrFxoWE2ib0A":{"text":"I absolutely love The Rum House! During my last two trips to New Orleans, I drove to the o","useful":1,"cool":1},"jLlzsR7rgsDmg-LX3EpVPw":{"text":"Had a great salad and a good fish sandwich.   Thought the place was nice and the food was ","useful":0,"cool":0},"sG6PH7t-YSMO8PflMKSX5g":{"text":"Servers were nice and helpful. The nachos was bomb! The tacos were mediocre and the rum pu","useful":1,"cool":1},"HqhPFYXoUbeXmGeF63rYtg":{"text":"This place which is like a fusion was very good. I came late close to closing so it wasn't","useful":0,"cool":0},"lu-iawAcEpoqOlqRV_dVXg":{"text":"We had such a great meal here! My husband had a duck taco (he RAVED about it) and fish tac","useful":1,"cool":0},"xWcT00J8lfAcINn6J4YQQQ":{"text":"While in NO I'd been trying to eat Southern food every chance that I got, but I'm so glad ","useful":5,"cool":4},"5WAjOozK3uJ03D9wA9aCUQ":{"text":"BEST STRAWBERRY MAGARITA OF MY LIFE!\nI loved it so much, I hunted down the recipe. This pl","useful":0,"cool":0},"_lPQmx1YzFvNrTKQSFSc4Q":{"text":"This place is one of my Go-to's! Great everytime! Love the drinks, love the tacos & the cr","useful":0,"cool":0},"fWYM0BZxT71_Ew44zBBnaw":{"text":"Some of the best tacos in the city! I've been here many times and never get tired of it. T","useful":1,"cool":0},"u7RikKTuvPZdH12Bxtl0ww":{"text":"The Rum House had a variety of tacos. Surprisingly, all of them were tasty. The drinks wer","useful":0,"cool":0},"O8WNw-IS6YbrqqrKvFmrcQ":{"text":"If you're looking to dine on Magazine Street, you'll likely notice that this place is alwa","useful":6,"cool":6},"laDZHRNb0sap2mDdVuIbfg":{"text":"Stopped in for drinks and a snack on a Friday afternoon. We were lucky that we got it befo","useful":1,"cool":0},"AyZSWr4lmer9kX6XjMGAmg":{"text":"One of my favorite restaurants in New Orleans. They have  a big selection of tacos which a","useful":2,"cool":1},"JVw7q6qrN2y-OvgccEwl8w":{"text":"Very friendly and knowledgeable staff. The food was delicious and full of flavor. They gav","useful":0,"cool":0},"CVjM_tb7NrwLF61Wk9pFIA":{"text":"Amazeballs!!! Their taco menu is outstanding & the margaritas delicious. The curried tempu","useful":0,"cool":0},"lA7vwPsDEMGQv2a6Ua1kXQ":{"text":"I was over at The Rum House this afternoon and what an experience, a constant experience I","useful":2,"cool":1},"ls5BXBqqdTRLZQVJEgB8sw":{"text":"Caribbean inspired drinks and food. The pain killer is a delicious tropical rum blended dr","useful":0,"cool":0},"JE_ncUqllcv4ZSY-2lpHGg":{"text":"The food was not authentic at all. There are no people of color as staff and I highly doub","useful":0,"cool":0},"k4dtdF6rIPQd_GBXHwYlMg":{"text":"I like it, but not sure I can say love it.  I love the name, the menu is good, but the exe","useful":1,"cool":0},"kINPUMAFOLpEAVUduNJEJA":{"text":"So I was a little iffy about coming here for lunch one day. I was interested in trying the","useful":0,"cool":0},"7HuYC8njoStNodOFtpIUNw":{"text":"Love love love this place. Whenever I am in New Orleans I always make it a point to go to ","useful":1,"cool":0},"JfI5GZShAP03QzUmZ86Liw":{"text":"Mmm mmm yummy! The daiquiri wasn't watered down you could definitely taste the alcohol. Th","useful":1,"cool":1},"TUdRnDq0i3bjatD4YtTGFg":{"text":"I've been coming to The Rum House for years since I first moved to New Orleans. I absolute","useful":1,"cool":1},"qzH1QjRK1E5-323UNwFT8w":{"text":"Came here after a bad experience at BOIL. Run House never lets me down. While their tacos ","useful":1,"cool":0},"-tDJK3o2nQxBV73pnRlVaQ":{"text":"The Rum House is always a Fun place for drinks and tacos on the FUN popular Magazine Stree","useful":1,"cool":1},"cy4Nm6tF2g9VK8Oh_-MeZw":{"text":"This was a fun evening out with a gal pal! \n\nWe shared a mango guacamole appetizer - which","useful":1,"cool":0},"ymBcZGp5EZ_-6WR24yA_CQ":{"text":"I've eaten here about 200 times in the past 5 years. I've had a few less than great experi","useful":1,"cool":1},"p8pTn-ZPtdV1IBvqQVyjdA":{"text":"I'm happy to have this as one of my new neighborhood spots. I have a feeling I'll be going","useful":3,"cool":2},"pPQT_wDY6pONOcX7Lfb_cQ":{"text":"I always thought this restaurant was overhyped! However I thought hubby and I would give i","useful":1,"cool":1},"iwiQSRP6uNJdMNayY7RKxw":{"text":"The food is good......that's what I'd say if I was a dog who ate dog food everyday.\n\nI am ","useful":1,"cool":2},"oIo4GAUkmYRmv281j2i8zA":{"text":"My friends and I was just driving by and decided to stop in for dinner. It was pretty good","useful":2,"cool":0},"mL500aPSP3XAG4m8moi6EA":{"text":"I love this place.  Everything I ordered was yummy.  \n\nWe had nachos while there and they ","useful":17,"cool":7},"pU43uTGdcSzO5H2IGnB4zA":{"text":"We came in during lunch time and they were busy! It was an hour wait time for a table, but","useful":0,"cool":0},"qkTO6Yy9uIuRUzj2zNYTdA":{"text":"We were driving by this place on magazine street around 5:30 PM on a Tuesday and noticed t","useful":1,"cool":0},"dBqq_oeAEULKV1BaTRx7DA":{"text":"Service was great. Quick and friendly. We went on taco Tuesday to sample a bunch of $2 tac","useful":1,"cool":0},"wG-v2S87yv25Ap7nz-tIrw":{"text":"I loveeeeeee Rum House. The food is always so taste and the sides are great as well. I lov","useful":1,"cool":1},"CKk2R7jTZuHjFtFP5O-3hg":{"text":"As of January 1, 2022 they are closed and the recording suggest calling back in a couple o","useful":0,"cool":0},"SUSSiY68qWsY_Zv_wibFxg":{"text":"I LOVE this place, love the atmosphere and menu. Only downside is the service i experience","useful":1,"cool":1},"Wq9ppwnJMMdV-2kW3jvuCw":{"text":"I don't think I have ever been here when this place isn't packed. The most recent was a Sa","useful":3,"cool":2},"K4H6706HY4l4Wqefgk2yQQ":{"text":"Stopped in on Taco Tuesday while visiting New Orleans. Great experience. Sat at the bar wh","useful":0,"cool":0},"hSgTmGAiOdx8oJXmfi0T1Q":{"text":"I've been here twice and the food was decent. The first time I had some tacos and drinks. ","useful":1,"cool":0},"Iwh7O6wcdHSvqsN--XfDbg":{"text":"Nachos ever. I'd like to suggest some outdoor fans but other than that it was a good exper","useful":1,"cool":0},"4-FhossSeMYwdW1Pt9NNWg":{"text":"Wait was roughly 15-20 mins, not too shabby. They stay busy. Wasn't feelin' much food, so ","useful":2,"cool":1},"w7doYTPfWWDA27cNr3BA4Q":{"text":"The food was excellent and with huge portions too! If you want to finish your entrée don't","useful":1,"cool":0},"U4tzBkod88mNaaCw1asVFw":{"text":"This place has some good tacos and margaritas. Their tacos have some unique flavors, sort ","useful":2,"cool":0},"kaujKJ_UCPQJDFAlKzNqSA":{"text":"This place always looks so colorful and alive. I had to stop in. We had excellent seating ","useful":3,"cool":1},"r85j1h5J62LgdeRFiihpng":{"text":"This place is packed for a reason. We weren't able to eat here but we did walk over to the","useful":3,"cool":2},"q4b3nAZpZnntEXHQt5QrrA":{"text":"Lots of gluten free options! My favorites are the queso and the polenta. Good service.","useful":0,"cool":0},"GXPdETHEOt6ubJYbzFHTzw":{"text":"My first time at the Rum House... another post Katrina addition to Magazine Street. Its OK","useful":2,"cool":1},"OfiHfaXB7aNyY_1wYhxkHQ":{"text":"The Rum House is a large corner bar/restaurant on one of the busiest stretches of Magazine","useful":17,"cool":16},"TohJkEsbmhPOUaRwwEVq_Q":{"text":"ALL DAY TUESDAY $3 TACOS and $3 BEERS. The tacos are amazeballs. Gets mad packed at night ","useful":1,"cool":1},"GvnenThBZQiDj2q_xeXkaA":{"text":"Rum House is one of my favorite restaurants in NOLA. I love everything about this place. T","useful":1,"cool":1},"DQbm4bOvyVeohAe8xnyo4w":{"text":"The Best description of The Rum House is definitely, \"Irie Mon\"! If you're from out of tow","useful":19,"cool":11},"vNKMgb8_x93xx_WaTgSwvA":{"text":"Amazing food! I haven't had something here I didn't like. The location is great - in the h","useful":1,"cool":1},"hs7h1iZdnjG1W_hc2Mc4AA":{"text":"Great little spot!  My friend's sister-in-law lives in NOLA, so I ended up here with the g","useful":3,"cool":2},"bv8xjJDAaE3ecqjpi5GEVg":{"text":"Went here with some friends for lunch after walking around on Magazine street on a hot day","useful":4,"cool":3},"5ZCohs_lQ2P18WQoFvfiLA":{"text":"This place is the best! Great atmosphere, fantastic drinks, better food! The taco options ","useful":2,"cool":1},"jf3SCAYrMN8yob34GUaa0A":{"text":"Really good!  I can't believe it took me so long to try this place, especially since it's ","useful":3,"cool":2},"NTzczxxu9W9xBYzScwGQeQ":{"text":"I absolutely loved this place. The drinks & the food was amazing. I wanted to order everyt","useful":1,"cool":1}}