{"JpJe_Z8R3WIG8Ng6wdjLiQ":{"text":"Vegans avoid this restaurant\n\nWe decided to go to 10 Foot Pizza on North Rampart in New Or","useful":0,"cool":0},"4SXJDL7dz-3SU-r5Tsi5vA":{"text":"Meatzza was delicious!!!! The staff is very friendly. Cracklings on a pizza??? Wow! Will d","useful":0,"cool":0},"8S8DG6I0EfHSBemcK6FqVQ":{"text":"The flavor of the overall pizza was good...\nPizza was burnt the hell up!!! \nProbably won't","useful":0,"cool":0},"o63xuNYg0zOVZ8vtvpSC7w":{"text":"Great pizza, quirky atmosphere. A welcome addition to rampart!   Nice that you can order b","useful":0,"cool":0},"rZcSNAJiI9Pns5LzRg4enw":{"text":"Ok, so when plans change for the evening you have to adjust. Several people told us about ","useful":1,"cool":0},"j9YuMIQ6w59QGUW3t889TA":{"text":"Delicious pizza, good beer, a nice bar and amazing decor with a very friendly staff. The w","useful":3,"cool":1},"zaHCHvL1b5qnfOqurxGMdQ":{"text":"A huge pizza that's nice and thin crusted with scrumptious toppings including Margarita, P","useful":0,"cool":0},"Xw1kWCOKRTIx0QLBFRTHkA":{"text":"Vegans avoid this restaurant\n\nWe decided to go to 10 Foot Pizza on North Rampart in New Or","useful":0,"cool":0},"GY_m_v0VkLIJsH7duW3A2w":{"text":"10 foot pizza. Came here after reading Nola.com article. Really feel like I could hv gone ","useful":0,"cool":0},"zEtBvf8A1GFouW7CiYN5AA":{"text":"Vegan pizza! Lucked into this place. Awesome, large pizzas with vegan 'meat' and 'cheese' ","useful":0,"cool":0},"Qi8DNOjm2_oegY7B0nYtDg":{"text":"We stumbled upon this place earlier today and I'm so glad we did! It is the CUTEST bar. Th","useful":0,"cool":0},"qzOjXbebyVbaiSG62z5nZQ":{"text":"Great new pizza place on the outskirts of the FQ. My friends and I stumbled in after sever","useful":4,"cool":2},"zLCtJM_-ofPR4kkw_VO25Q":{"text":"We stumbled onto this place while on a tour, and the ambiance was what drew us in. Food wa","useful":0,"cool":0},"oL4iwRmSYJetvIXCmby32g":{"text":"Pizza was to die for at 11pm on a Friday night after strolling around Bourbon St.  Crunchy","useful":0,"cool":0},"pXSInr4zx-1yc-6LXqAzdg":{"text":"Red Truck Clubhouse is one of the raddest places in the French Quarter. The pizza is great","useful":0,"cool":0},"S8Kb9sL0jM8LERg3eL-_iA":{"text":"The pizza was delicious! Right off Louis Armstrong Park and it has a Ms. Pac-Man machine..","useful":2,"cool":2},"zaYengAADg7lCM9wNIEbtw":{"text":"This particular visit gets one star. Come here quite often and always had a great pizza. T","useful":0,"cool":0},"SMB7KVPulNSC6oePTBbw9A":{"text":"Stopped in for pizza but it looked like it had been sitting there for awhile. Confirmed wi","useful":0,"cool":0},"f61u5rWn-vYSvQZEE8WQtg":{"text":"Great deals, cool atmosphere, burned pizza, and broken chairs. \n\nLooked like a cool place ","useful":0,"cool":0},"6LohrJ8BmdNmn2Ob1U9t6A":{"text":"We love the vibe in this place! Not packed at all! The decor is amazing. The bathroom is l","useful":0,"cool":0},"ZvPiF1hVJSsmwPVEHCk3ag":{"text":"Love love love the atmosphere, wish I had one of these places back at home in Sacramento .","useful":1,"cool":0},"0SUnz_gWT5x5MZRNVwjHgQ":{"text":"Cool dive on rampart. Nice bar staff and solid late night slices. Cheap drinks also makes ","useful":0,"cool":0},"mSh_4DG0NnfLdBynDjsM8A":{"text":"Ordered a cheese pizza from here for delivery. Was pleasantly surprised. Good sauce, NY-st","useful":0,"cool":0},"fm1jzLvEuJUNpIxgJGcqpg":{"text":"We have really enjoyed getting to know (read: Eat....) Red Truck's pizza over the last mon","useful":0,"cool":0},"5qiuUEMUU-XUipzLC0vf6Q":{"text":"This place is a fucking blast and Alicia is the absolute best. Fabtastic bar, fantastic ba","useful":0,"cool":0},"bYZcEBqeiwXiw_zsoTybGA":{"text":"Well it seems 10 Foot Pizza is now Red Truck Clubhouse also a pizza spot. The Margarita pi","useful":0,"cool":0},"zwv8b7AWt4tcrF904-mgAA":{"text":"As you enter the Red Truck, you'll instantly feel welcomed by the beautiful art covering t","useful":1,"cool":0},"B5frP_IfPM371j67N4jmMQ":{"text":"This place has TERRIBLE customer service and are RACIST. A group of friends and I went to ","useful":2,"cool":0},"OATcXFPUm74moBH_HK3Rlg":{"text":"Stopped in because we noticed the awesome decor from the street, so glad we did! Awesome i","useful":0,"cool":0},"ypYPgBX0snW5zPXmFxe2xA":{"text":"This is likely the most amazing pizza joint I've been to. They play incredible music, freq","useful":0,"cool":0},"L_-ppW4XhWgsvQ7yq5eBbw":{"text":"The pizza was mediocre but I knocked it to two stars because the red head waitress/bar ten","useful":1,"cool":1},"StXNp1pi2KhnsdGZV1k6lA":{"text":"I really enjoy this pizza, but I work near by and every time I attempt to grab a slice on ","useful":0,"cool":0},"J-HWOLo-2tiddaAyFpOMJg":{"text":"This place has really awesome decor. I love everything from the tree branches the the cool","useful":5,"cool":5},"44AGM3ciE2lcVzu72vcJnA":{"text":"Worst pizza in the city , worse than gas station pizzas \nI ordered though uber \nWhen it ar","useful":0,"cool":0},"57zLe-JJEXQosLpI7tWm1Q":{"text":"My friends and I only came by for drinks and not the pizza, but the atmosphere was so cool","useful":1,"cool":0},"TNeaElQGOjhOrdo85XInGg":{"text":"This place caught my eye as I was driving home one day from work. The floral ceiling decor","useful":0,"cool":0},"iG5iSjLQOnA159OZW-AGOg":{"text":"Stopped in for pizza but it looked like it had been sitting there for awhile. Confirmed wi","useful":0,"cool":0},"Z662sZvzsCrggl2M4rzh1A":{"text":"This place looks totally awesome. It is unique and just fabulous. BUT, the service is terr","useful":0,"cool":0},"aW7EL8abopFSK6lbkq969A":{"text":"Solid hangout spot, the art and general vibe of the place suits where I'd wanna find mysel","useful":0,"cool":0},"8cNX2N-IQOgKtnlNtsodXA":{"text":"Great Pizza, Great Service, Open Late. What more could you want? The pizza here is thin cr","useful":1,"cool":1},"Ty_0Ix03sLY3DlCqMQNnAg":{"text":"Pizza is such a subjective topic so while the pizza was good, I'll be more inclined to sti","useful":4,"cool":3},"OKm0M_DY7WgH6FCEIhdHAQ":{"text":"The pizza 5 stars and fantastic.  \n\nThe service horrible.  One bartender tending to the pa","useful":2,"cool":0},"_g5kxENCUhelqykvARvVHw":{"text":"Stumbled upon this spot my first day in NOLA while trying to get away from the crazy peopl","useful":0,"cool":0},"vuRWIw0oGOxU-5ZwxGg70Q":{"text":"Great location right across from Armstrong Park! You can get pizza by the slice or persona","useful":1,"cool":0},"8OCSYRCNwOlycLnSZFST6A":{"text":"Hot circle of garbage. I can't imagine anything more pretentious than pretending to be hip","useful":0,"cool":0},"mj5B434UCXrmUaRc_fCYxA":{"text":"Ok, this is not NYC pizza. It's better. this shtuff right here is Jersey boardwalk pizza. ","useful":0,"cool":0},"tIyGd4lGYWPV16JCIgoy3Q":{"text":"Just adorbs.  Funky, chill.  Happy hour specials for the win. Bartender was friendly.  Bat","useful":0,"cool":0},"lLbBPgj3LuBFTV87eWJmIQ":{"text":"One of the better pizza by the slice places in the city conveniently located in the quarte","useful":1,"cool":1},"zCWE4uBjJ_nb7CfN4NPBhg":{"text":"My favorite find in New Orleans! It's so cool and eclectic. The attention to detail when i","useful":0,"cool":0},"N_eyKdr-J5qye5yU2NoZ_g":{"text":"Hubby and I were out doing things on a weeknight and wanted to grab a bite. In an attempt ","useful":2,"cool":1},"HoB7tMbKEkAyf1US_f0iUw":{"text":"Garbage pizza and overpriced. I can't imagine anything more pretentious than pretending to","useful":0,"cool":0},"73wHRWk8E0MqqhspUFCuqA":{"text":"Best bartender and best pizza in the city, hands down!\n\nOn a recent NOLA trip with a group","useful":0,"cool":0},"creO64kfkt8bWHOe6A1tww":{"text":"Wow, where to start. \n\nCame here for the first time on Tuesday with my boyfriend for a dat","useful":4,"cool":4},"8gUvy2OhCQ29_yUI6UwwwQ":{"text":"The most unique bar I've been to! And they have a good happy hour [$5.50 beer + shot]","useful":0,"cool":0},"Tijf8Hp-Sc1gK75i7XurEQ":{"text":"Such a solid spot!! Wonderful vegan pizza! Chill setting..love love love the decor!! Will ","useful":2,"cool":2},"n0M0P38hECzVwfiVp6787w":{"text":"Fantastic pizza!!  ... And great atmosphere! \n\nWe saw someone walking a few blocks away wi","useful":4,"cool":3},"HWhHXdS0oNulO2f85Ll3qw":{"text":"First visit was today for a pepperoni pizza, carry out! Amazing atmosphere, friendly staff","useful":0,"cool":0},"pbn6ycr921aUbNbEDcYOzA":{"text":"The pizza is amazing! The staff is very friendly, so if you find yourself near here its de","useful":0,"cool":0},"Iu6hYnxc20yeO48orGLMAA":{"text":"Charming staff! Gorgeous setting. I have never seen such a beautiful interior in any estab","useful":1,"cool":1},"dGNsPm6_wBnFkE51oiETrA":{"text":"it was available. which is great. but worst pizza i've eaten in a long long time. definite","useful":0,"cool":0},"9hYAk4J38BGE0uRAXPQEJA":{"text":"We stopped in here because my husband loves pizza and I wanted to see the decor.\nWe arrive","useful":3,"cool":0},"6yvQ98PgesYHc-SG95-EeA":{"text":"I DID NOT HAVE THE PIZZA SO STRICTLY BASED ON ENVIRONMENT AND DRINKS. (Still torn between ","useful":16,"cool":11}}