{"w5vs68tkHKRTuAtoLEyVjw":{"text":"Seriously. It has it all. Dive scene.  The two bartenders, Brad and Phillip, were life sav","useful":3,"cool":0},"rEhfzkmXpNvy_1ftko30Rw":{"text":"Was in Nawlins( I would Love to move here). Just like the city, this bar was great and And","useful":0,"cool":1},"DAT-g7uW1e-GbqYYezF_GQ":{"text":"This bar has very solid pours and really good happy hour prices. Interesting crowd, but I ","useful":1,"cool":1},"38Xm4tbelbnGdHhKhYMi_g":{"text":"This place was beyond interesting. It was like watching a reality tv show . At any given t","useful":1,"cool":0},"hHV2aX0Oj0UMZd7Oe0TjgA":{"text":"Decent priced drinks and even a jukebox! However, this bar seems to cater to a host of ver","useful":0,"cool":0},"nowe0K2Dyuw4LRgXyRS5NA":{"text":"Always a good time. Jukebox,strong drinks, and most interesting crowd in New Orleans:) Thi","useful":2,"cool":3},"tY77oViUT0m_22nyaDP7SQ":{"text":"Door man is the rudest person EVER!! He TRIED to ID me for walking past the place, then go","useful":0,"cool":0},"ZUwQpjSNMqPNNWseMsu8vQ":{"text":"Came here for my 21st and J.J. was uh-mazing!! He really made my boyfriend and I feel welc","useful":0,"cool":0},"oCgOj3mfkFdd9AwlDe2c6Q":{"text":"Stopped in this bar a few times during our stay in New Orleans, and Seth was our bartender","useful":0,"cool":0},"7qAK7P5TwkxAifKVDa6wxg":{"text":"Shout out to Alicia for making the BEST double bacon cheeseburger in town! Great vibes, go","useful":0,"cool":0},"GswIyK0N1pyzVMV3xbBK8Q":{"text":"Very cute and CLEAN  inside. Chris the bartender is super accommodating friendly and fun. ","useful":1,"cool":0},"CDABZ02sms5xFUYp2TQmVQ":{"text":"Love this bar.. and I'm not gay. The bartenders are fabulous. We were welcomed by the staf","useful":0,"cool":0},"q3A4dt_7g-ixjTq2WhYdeg":{"text":"Hands down my new favorite spot! Chris our bartender was amazing!! More than accommodating","useful":1,"cool":0},"JxfbU5nk9WPBOUN42oh1AA":{"text":"What a fun bar! it's very classy, clean, and comfortable, with a great vibe. My bartender ","useful":0,"cool":0},"PpUM_NJen_-6H003zh_zCg":{"text":"This is my favorite bar in the French Quarter, bar none. That being said, the Double Play ","useful":11,"cool":10},"hMK_chTPwWrHAYfVaU8rHw":{"text":"Super friendly, LGBTQ place. I was a solo traveler for 5days and they welcomed me with ope","useful":0,"cool":0},"T6l2urrTLjMMwd-iCQhVuw":{"text":"Very nice and clean bar. Friendly staff and good customer service. A getaway from the craz","useful":0,"cool":0},"e35LqR3eKtgTUdTxS2FS_A":{"text":"Seriously this is one of the drag queen capitals of the USA. I don't know how many times I","useful":6,"cool":5},"lQz7bpDayN2vtoSA8Y9bqw":{"text":"Oops. Didn't know when I walked in for a beer and a break from the heat (along with the bo","useful":1,"cool":0},"68xjvtGsSI2RT_jE1XW6dw":{"text":"I'm high on customer service and I'm a local/regular whom comes to the bar for Will (Willi","useful":0,"cool":0},"LrZBbiXhyFdFuKPdlF2QWQ":{"text":"This is, without a doubt, one of the cleanest bars in the Quarter.  Seriously, everything ","useful":3,"cool":2}}