{"SMTsDG8hjy2J0_nejetOrw":{"text":"I've never had pralines before but the one here was pretty good! I got one piece just to t","useful":1,"cool":1},"iaKHTlnE_SXoDNQ5gkl35A":{"text":"They have a big sign proclaiming theirs to be the \"Best Praline in the USA  According To [","useful":7,"cool":3},"hHVM9ntnt-8EYoTbkEFaWA":{"text":"Freaking amazing. Made in-house pralines, turtle candies, chocolates and sea salt caramels","useful":0,"cool":0},"oSQYQFLnRpHiimNGR6fASA":{"text":"I insisted on stopping here for the famous pralines based on yelp reviews and I wasnt disa","useful":0,"cool":0},"o523DPg1kPNqz5cqWyB1DQ":{"text":"Tour guide recommended this place for pralines,  and let me tell you it's absolutely top r","useful":0,"cool":0},"RzApUcoj91TfuzH6oBvQvw":{"text":"Clean shop. Very friendly staff. They also offered to shrink-wrap food in case we were tra","useful":0,"cool":0},"My7jhOiFBMaNeyTeMtZSRg":{"text":"We ducked in here to hide from the torrential rain. I'm glad we did, for the sweet candy s","useful":1,"cool":0},"quknyPVb5EzDTjoQ_Y_sAw":{"text":"Supposedly this place has won lots of awards for its candy, and while we did not try every","useful":0,"cool":0},"LBFyYq_Ei7Ib9L_Si_xFEA":{"text":"They claim to have the best pralines and I agree. End of review.","useful":0,"cool":0},"FRKcmg0EGHE9ObhMmdjKmw":{"text":"Awesome pralines! We tried several places and this is the best. Great location to be in th","useful":0,"cool":0},"40tAZ_UzuuHbM_5oLlYWVQ":{"text":"My friends and I searched high and low for the best pralines in New Orleans. We found a wi","useful":1,"cool":0},"n6W1i0Z-e3yLt3utk9gpAQ":{"text":"Visited this candy store while in NOLA for the Essence festival and the line was definitel","useful":1,"cool":0},"6m9G6hK2deolAZQE-j55GA":{"text":"I went in this establishment 2 days after Mardi Gras, and wondered if anything was going 2","useful":0,"cool":0},"D-NS9dIDe5cxScnjjot8Ng":{"text":"Southern Candymakers makes the best pralines in New Orleans, in my opinion. It does come a","useful":1,"cool":2},"C8yLiyOZ-VEW-hsCJpjxtA":{"text":"Every time I visit New Orleans, or every time my Dad visits, I always look forward to gett","useful":3,"cool":3},"42U3lHVz7lmwChzjdfPpJA":{"text":"The candy here was great! Best thing we tried was the white chocolate peanut butter cup. P","useful":1,"cool":1},"Mn1KMTJbtJNAONjJv7hUoQ":{"text":"AWESOME pralines!\n\nMust be because they're fresh.\n\nChocolate flavors was interesting but t","useful":4,"cool":4},"89mKdulHQYEe7WJt8U0u8A":{"text":"I yelped to find the best pralines in NOLA and it was Leah's that came up closest to me so","useful":1,"cool":1},"3Y6pBvIE_UYpMWZ6y0GN5Q":{"text":"I really like how you can see them make pralines here.  I think that's half the experience","useful":0,"cool":0},"yyTgwQ1tnSI_R3M2T_4gGg":{"text":"ahh yessss had to pass thru and bring some love home!!!!\nsum pralines reg & chocolate !!!!","useful":0,"cool":2},"GQUMnmMozGfMA8zHW75mVQ":{"text":"My fave candy shop in New Orleans!!! Freshly made right in front of you! Go there and get ","useful":0,"cool":0},"VBXIZrJfpohBSfrNws-3cA":{"text":"If there were more than 5 stars I would give the max..The owners and staff would get a ful","useful":4,"cool":2},"SQrhUCgQ_WpcvIxt57o1vQ":{"text":"Very fun candy shop. They sell pralines and salt water taffy. Great for gifts!","useful":0,"cool":0},"j_x55STqNET4mJDl8P9Jzg":{"text":"Very cool laid back place.  Workers were nice and at this place u can sample the goods. Ma","useful":1,"cool":1},"TgouR71YlKrqC96-OBN87g":{"text":"I bought a praline here and damn, it was delicious.\n\nPROS:\n1. Friendly staff behind the co","useful":1,"cool":1},"W9DrD-2I0jwVZ5yFqnP16A":{"text":"I have nothing else to say but AMAZING!  The pralines are to die for!  This is a must if y","useful":0,"cool":0},"49--nDXhVKO6cJnGOoLiYg":{"text":"I really enjoyed their pralines. I also tried a white chocolate turtle which wasn't bad ei","useful":1,"cool":1},"E9pdma74HBzf0Z2er8f1lg":{"text":"This is my go-to for pralines when we're in New Orleans.  I think they're fresher than oth","useful":0,"cool":0},"P55-75tASrSkrw3hdHJ78Q":{"text":"At long last, I have tasted a praline.\n\nIt took until the last day of my NOLA trip, but I ","useful":5,"cool":4},"Klq4a_8XbIEmdEgRqmoYiA":{"text":"What the eff are pralines?!  Cream, butter, sugar, pecans? I had no plan to purchase any o","useful":2,"cool":3},"5cojoQRPMFKxuxC6klnIVw":{"text":"The place to go for King Cakes. Great Pralines too. Ask for Kylee, she makes a mean chocol","useful":0,"cool":0},"-Q_JsQa56uFq35-a6QXZKw":{"text":"Stopped in here yesterday because one of the folks I was with told me this was the best fu","useful":1,"cool":0},"vEeyJw90dGD_55uCrmdylQ":{"text":"\" Yummy Candy Store \"\nMy wife and I went inside of the Southern Candymakers store in the F","useful":0,"cool":0},"X0HUO70WzfrDk9yQaNXQiA":{"text":"F'ing fantastic.\n\nJust get your pralines here, people.  Just do it.\n\nRegular, chocolate an","useful":3,"cool":4},"rR2WfhaZKdxa0OhPjWWFGA":{"text":"Hands down, best praline in New Orleans.  I've tried them from many other candy makers, an","useful":0,"cool":0},"y4x9oKWGcx8G7DSWsNriuA":{"text":"This store was pretty fun. Two guys were making candy/chocolate, which was fun to watch. T","useful":0,"cool":0},"P-mpOyBhqVAe2nXgoJWCqw":{"text":"Amazing Candy!   We recently visited New Orleans and stayed at the hotel next door to the ","useful":0,"cool":0},"OljEsz5e3RP8xJM4blD-4Q":{"text":"i agree with Keandra..10 stars!!! Candies and staff !!!\nAlways good always friendly...this","useful":1,"cool":1},"fCHIe2V35vnYZR8FxN9frQ":{"text":"Ok I figured pralines must be a NOLA thing so I should try them. My initial reaction was t","useful":0,"cool":0},"Z26WsK52ToHgPc-bZrK1bQ":{"text":"Milk chocolate almond toffee was amazing and the white chocolate wasn't that bad. I also r","useful":0,"cool":0},"PRHwdzujbFe_B8CP-hG_Tw":{"text":"I pretty much went to Souther Candymakers everyday when i was in NOLA. They give you free ","useful":1,"cool":1},"4Zc-1xxzF9sXQ2oAgHHsDg":{"text":"Right when you walk into the shop, the smell of sweetness hits you.  It smells so good, it","useful":0,"cool":0},"111Ajh5su8x1O7XhtsRd5g":{"text":"Delicious. Free praline samples. Spent about $15 and walked out with a pretty hefty bag of","useful":0,"cool":1},"V_DveF0TySEMqZh-PQ3P-Q":{"text":"Sweet potato pralines!  Sign me up!  Very fresh product, very friendly service.  Great sto","useful":1,"cool":1},"Rzziow88WQHkcdZjZfj-zw":{"text":"Holy pralines, Batman!!!  This place made my eyes roll back into my head! The main reason ","useful":1,"cool":1},"-gCWTWQPRL0DKtTLf-_sOw":{"text":"Great candy and is priced the same as you will find other shops, even outside of the touri","useful":0,"cool":0},"h5SFQo-JlPl_VuDxKT1VEg":{"text":"Every NOLA regular has their favorite candy maker, Southern Candymaker is mine). It's been","useful":0,"cool":0},"tQfkxW6pZJs-GcRzqg5bsA":{"text":"First Yelp Review - ONLY because the people are AMAZING!  My two daughter and I live close","useful":0,"cool":1},"NykL69KNovBfasJwqtpg3g":{"text":"Seriously the best pralines in the world. Every. Single. Time. I visit NOLA I pick up a ha","useful":1,"cool":1},"4JKEJirHkAMuOXgxJqN6GA":{"text":"I came in for their chocolate covered oreos and sea salt tortues. The employees are soo ni","useful":4,"cool":4},"msgSwTczeVIfeAFk2dIi1Q":{"text":"The BEST CANDY....EVER.  Forget best candy in New Orleans...this is the best candy Ever.  ","useful":0,"cool":0},"0AT_vzjGx6_a6-leO88nHA":{"text":"How I adore the smells in this store, every time I'm in the FQ I walk here just to smell i","useful":0,"cool":0},"TMgwE9wNiIA4LeRlCULBPA":{"text":"Want a sample? HELL YEA! This place has amazing pralines & other things for your sweet too","useful":0,"cool":0},"Xbncv95rWn5ma60T46B9UQ":{"text":"In the Praline-challenge, Southern Candymakers was on our list\n\nIncredibly slow moving lin","useful":4,"cool":4},"R6FvqLsW2MVd3YSy3VSuSA":{"text":"Can I put 6 stars? If you have a sweet tooth, this is the spot! Everything from chocolate ","useful":1,"cool":0},"4c3Wf_02vc66eIWnEo1kmQ":{"text":"If you are in New Orleans and are able to stop by Southern Candymakers, they have a very g","useful":0,"cool":0},"kDskwaOirmg5p_fmQY4XAQ":{"text":"Taste the freshness.  I was looking to buy some pralines to take home and tempted to  buy ","useful":0,"cool":0},"JoMywVXYRQVO2q5ttV3b8w":{"text":"So my sorority sister wanted some chocolate to take home with her so she found this place ","useful":1,"cool":1},"joVRm5SEDL6yCYRA3tEaiw":{"text":"I was walking around the French Quarter trying to figure out which praline shop I was goin","useful":0,"cool":0},"thy-FlEahrol9aG9xt1D-w":{"text":"Large variety and great tasting candies and chocolates. Nice location. Check it out if in ","useful":4,"cool":6},"hGtJThTaqg4sCLGXFvSrew":{"text":"Super friendly employees and in-house made pralines...what's not to like? Oh they have a n","useful":3,"cool":2},"x1Mmmu148WSrAHl2kNZIfw":{"text":"Get them fresh from the shop. The boxed and wrapped ones taste like they are 10 years old.","useful":0,"cool":0},"IXx6-h2uPzy1-sz_aD435g":{"text":"After a great lunch in the French Quarter, we were full, loving the day, and needed to run","useful":1,"cool":1},"3Bb6091aqup9BH3flDtWqQ":{"text":"On our last day in NOLA, we *had* to pick up some pralines! I had my heart set on the rum ","useful":0,"cool":0},"nEJit0WOULzuWBldYOoo_g":{"text":"What can be said of a place that offers wall to wall sugary goodness? I had already spent ","useful":0,"cool":1},"l8MGLhOgOJDmTajy-4z_ew":{"text":"I've never had pralines before until New Orleans. And the first time I tried it I actually","useful":0,"cool":0},"zcWsVzn25aMmhGFlozbbmQ":{"text":"Pretty good pralines, but I think my Aunts are better. We tried one original and one rum a","useful":0,"cool":0},"ET0f38ydmOElGE_stutlxA":{"text":"Can't say much about this little place but I know they're known for their pralines- some s","useful":0,"cool":0},"1VHyrmyBd6Vin02m8NdMJw":{"text":"Happened across this place while walking along Decatur.  The signs saying Bon Appetit name","useful":2,"cool":0},"0_n0tw6oyDGsZziv8tbZ1A":{"text":"So- I never knew praline's were a thing until I went to New Orleans about a week ago. And ","useful":0,"cool":0},"35TRqRqygiopSU6VYmz9Wg":{"text":"When you walk in you just smell fresh caramel candy.   I didnt order any praline candy bec","useful":3,"cool":6},"ndRiUop7vSpsGkN9y5Q87g":{"text":"Located a stone's throw away from the French Market, this sweet shop is hard to miss. This","useful":0,"cool":1},"2M7jlvtpLdNg4thdNZZykg":{"text":"Great pralines! The sweet potato is my favorite. They're kinda pricey, but really good. Th","useful":0,"cool":0},"wrwI0WvBvhS8pq8m9XYFgg":{"text":"I love this place!!! I make sure I stop by here every time I come to New Orleans. I always","useful":0,"cool":0},"lTuyJkC3d36mHoiZZiv56A":{"text":"Absolutely wonderful store. Went through NOLAs candy shops looking for ideas to bring back","useful":0,"cool":0},"FGIpGPvfmtEOXjGnrwcI8Q":{"text":"The pralines are amazing and because they have so many flavors to choose from they will le","useful":1,"cool":2},"Qy1SP-4btrwJy0oNLA_Img":{"text":"I never planned on getting Pralines while in New Orleans.  I'm not a sweets person unless ","useful":0,"cool":0},"t-MuK6NyY2uzJeO_uDfe-Q":{"text":"Rude help. If they hadn't already run my cc  I would have walked out.  They refused servic","useful":0,"cool":0},"Gagz5-DEtJkJNv3IeYqExg":{"text":"Incredibly polite staff, super friendly...went here on a recommendation from friends back ","useful":1,"cool":1},"nUqBpCnlwHzTlCiI-b6zpg":{"text":"11/24/17\n\nOkay, I admit it... I'm a newb at reviewing candy stores.  I mean, your typical ","useful":45,"cool":43},"dCaTweBUOKmYLwJNxJ6KuA":{"text":"The entire staff was very polite and welcoming. The chef was preparing the praline while I","useful":0,"cool":0},"4rjkMt4jdZ1Lkfc5aUZuPA":{"text":"My favorite place for Pralines when I visit New Orleans. I've even placed online orders wh","useful":1,"cool":1},"l6uPDaIHcQ57AjPDn0VTCA":{"text":"I'm not big on pralines but I would recommend this place. They were so warm and good!!! Th","useful":1,"cool":2},"mPk1ChKn1cuColBR_N1atw":{"text":"This is the best place to buy pralines in all of New Orleans! Everything mad fresh, great ","useful":0,"cool":1},"R1UWnSl42hTwHeBMnC-mKw":{"text":"omg those sea salt turtles are to die. for. I don't usually do sweets but I have a sweet s","useful":0,"cool":0},"HSz_ZvJ8KPOpUpxRDAbehA":{"text":"I was not impressed. I know they were voted the best pralines in New Orleans, but I didn't","useful":1,"cool":0}}