{"-hQo81GQ9yoCXPVG8jGGGQ":{"text":"These guys are the best, I've been putting off this filling for about 5 years and it final","useful":5,"cool":1},"wX7k5iKFOFZWMkYUmU6inA":{"text":"I've been in here a bunch recently due to getting some dental work. The office is pretty n","useful":5,"cool":1},"dvqfILz7fVhEqkQpr_e-VA":{"text":"Really great experience with this dentist! He knows his stuff and will not make you do any","useful":4,"cool":0},"FExoAuRo6Q7t4PwnONepqQ":{"text":"Came here based on the recommendation of Yelp and a few classmates. I had a great experien","useful":4,"cool":1},"FkXSkctTF9L42wGgVDbimA":{"text":"What an amazing dentist! I was so nervous going in today.  I have never had a cavity or ha","useful":6,"cool":3},"v5TCLyOLSKF7QNwiKxnGIQ":{"text":"prepare to break up with your current dentist! as the reviews speak for themselves - fast,","useful":6,"cool":2},"EaLJ-CcxZQ8wtnh2WPq-Yg":{"text":"I had a dental emergency after not being to a dentist for 7 years. I called Leggio Dental ","useful":3,"cool":0},"DHYKb6-RQeuiqIDTTWlPiQ":{"text":"Very disappointed by my experience here. I got hit in the head with the x-ray machine, spr","useful":1,"cool":0},"lVXD4D6BH3RLC3Hz37fXBA":{"text":"The best dentist I've ever been to. Dr. Leggio is a highly skilled dentist who always make","useful":4,"cool":2},"AlSC4yDQt1uBTLvxXTMZbw":{"text":"If you're looking for a good spot for dental work with a reasonable price, then come and s","useful":12,"cool":0},"JO8JEb72YlVxZowMqmHNBg":{"text":"Really nice staff! Kept my appointment on time and didn't take very long for an annual che","useful":5,"cool":2},"Hb7Z7J4WdAgA4xoSj8jdqg":{"text":"Great service and great dental outcomes. Also- the charges for regular check-ups, etc., do","useful":4,"cool":0},"nc4xKFx3c8X6mhVaFZwKQA":{"text":"I really wanted to love this dentist. I was not a fan of my previous one so I called the L","useful":6,"cool":0},"yYlircsbM8KtztPx01E2Kw":{"text":"Love them!!! They did a great job with my tricky wisdom tooth!!! So kind and gentle! Alway","useful":2,"cool":1},"J4uAc8qVZR8882hAxBfB8Q":{"text":"IF YOU HAVE A DENTAL EMERGENCY IN NEW ORLEANS..THERE IS SIMPLY NO OTHER PLACE TO GO THAN T","useful":10,"cool":7},"66aXKTLUh7im_x5LPouk5w":{"text":"Had a molar that has basically been falling apart for a long time, but put it off due to n","useful":11,"cool":0},"ARkIlKaYv6b8IkjWXWEgdw":{"text":"I went here based off yelp reviews. The dentist put his hands in my mouth without gloves o","useful":7,"cool":0},"iKbkoI_NgTSolw_qDRXzpg":{"text":"Being 100% financially independent without insurance, is the worst! A CBD dentist told me ","useful":12,"cool":2},"GYUTHT0Cr2MyT56sawq0KQ":{"text":"So just to update you all on the saga that is my cavity fillings, we actually broke the ca","useful":13,"cool":5},"gtplCdRekZ6vtUwS18slpQ":{"text":"I had a great experience at Leggios. The prices are very reasonable and the office is comf","useful":3,"cool":0},"bHl5le1xAuQKYid06QevfA":{"text":"I needed to visit the dentist but have big anxiety issues when it comes to the dentist, so","useful":5,"cool":0},"Seiu_uAe3x-BmPItPgHKkw":{"text":"This is now my new dental office. I'm normally a wreck of a dental-phobe and have terrible","useful":3,"cool":0},"AiYSa9Wyz85NDhdzks4tHQ":{"text":"Dun, dun, dun...Top fears...Drowning, snakes, and dentist visits. \n\nWhen I was in high sch","useful":13,"cool":8},"kE_53bqIQCf_PVtPGjbquA":{"text":"I have not been to a dentist in while because I dislike it so much! I have to say this pla","useful":0,"cool":0},"0Ss0k-IiavXSL4pgEQ-oTw":{"text":"Okay, Yelpers, these reviews reeally let me down.  Being from California and having the sa","useful":0,"cool":0},"gQk2WD1Yhg8yQ-czEVHvzQ":{"text":"I am new in town and had a venear pop off at a very bad moment. My job requires a \"Colgate","useful":9,"cool":2},"_It6RkChJgPAvs-Tc3EMAg":{"text":"I have been using The Leggio group for years.  Always affordable, even when I didn't have ","useful":15,"cool":2},"S-ZAosQtt3VzseW5p3s5Zw":{"text":"Dr. Leggio (and staff) are the reason I continue to come back. I've had my third extractio","useful":3,"cool":0},"GxN7QRuLrPauHE_DC5JalA":{"text":"I've been seeing this family group for 25+ years and have been completely satisfied.  This","useful":0,"cool":0},"C4SbHFMX5_L_94mmDbd3PQ":{"text":"I have been seeing members of the Leggio Dental Group for 25 years.  Ths is a second- and ","useful":11,"cool":1},"Ht0HvKDmZbur67afjV9v5Q":{"text":"This office has a friendly staff, and affordable prices. I don't have dental insurance but","useful":6,"cool":1},"TlaLxBwJlMVADympKVWo1g":{"text":"Summary: Leggio Dental Group mishandled a cavity filling, and I had severe tooth pain for ","useful":0,"cool":0},"4om5LVssHxSoumvokgVItA":{"text":"New to Nola, I chose this dentist office because they were in my insurance plan, near my h","useful":6,"cool":3},"z_H46Lciw69BtnAyCEE9fQ":{"text":"My mother had broken a tooth and needed to go to a dentist. She was avoiding going because","useful":8,"cool":0}}