{"bkQ_q_atDK2gedkwFynytg":{"text":"No one to seat you, although the sign says wait to be seated. Bartender told us to find a ","useful":0,"cool":0},"XvessmVfelzW8XswXU9n8w":{"text":"This place is just okay, but definitely overpriced! I have ordered from the twice. Both ti","useful":0,"cool":0},"R-LZfWNhGAhuPkNUerh-1g":{"text":"Not  impressed at all! I ordered the Uptown Shrimp & Drew Bries. I didn't like the Drew Br","useful":0,"cool":0},"78TkdfQl2x17ZCRn95U8gQ":{"text":"My wife and I stopped here for a quick lunch. I have to say that we both were pleasantly s","useful":2,"cool":0},"7JBIogWicNWwO2j633ZKag":{"text":"Menu is good but the service is a little slow. It is in a hotel lobby, doesn't make a diff","useful":0,"cool":0},"3MUE0XKNNPdz4BsHe8zFcw":{"text":"Walked by this place on our way to the Supernatural convention and figured you can't go wr","useful":0,"cool":0},"FkABQrzdjjKJDNBBHSn84A":{"text":"The food was solid. Nothing \"special\" just good. The service staff on the other hand was c","useful":0,"cool":0},"fdAgPHIPV2ue73jyNlWJpw":{"text":"Mediocre food. The standard (regular grilled cheese and soup) was not worth $13. The worst","useful":0,"cool":0},"tJAlU__BTALHJjtu4skeFA":{"text":"While the food is okay, the service was absolutely lacking. Our food was \"backed up\" when ","useful":0,"cool":0},"KAE_McKisi1l_PzOSxVB-g":{"text":"Waited 35 minutes not greeted by the restaurant folks.  Went to hotel desk to get someone ","useful":0,"cool":0},"JK8ehMV_tkrV7BsagHQMIw":{"text":"You don't really realize there is a restaurant separate  from the hotel here which takes a","useful":1,"cool":0},"-XunCa0fjusOj2fsYTjWyw":{"text":"A 10 year old could make a grilled cheese sandwich just like the ones we had from here. Ho","useful":0,"cool":0},"8WCuhQQPZgWeEOOJrjU4-A":{"text":"This place is the best!!! The food is A+ and the service was spectacular. Shaun, the barte","useful":0,"cool":0},"pURS0hLn79b3y9kCJT2F8A":{"text":"This place was amazing to eat, I have the grilled cheese with turkey, fig jam and bacon. I","useful":0,"cool":0},"Knmj_5QOTkZoId_7voVZbg":{"text":"Probably some of the worst service I have ever had. We came in to eat and the waiter audib","useful":0,"cool":0},"uC9GYx0F0utqAMf2l870sA":{"text":"I grabbed a quick meal to go while in town for a conference. I got the wedge salad and tom","useful":0,"cool":0},"1BzGiIq4BZxJklz7Te7yjQ":{"text":"Excellent food!  Fig sauce and turkey was amazing. Awkward space in the lobby of a hotel. ","useful":0,"cool":0},"pZwhB2_1wjKJZsAB91n0tQ":{"text":"Sandwich was just okay, but the tomato soup was fantastic. Service was terrible, unfortuna","useful":1,"cool":0},"Oao6G4xnGXwYkTlWIUYiOQ":{"text":"It was convenient and really good!  The fries were amazing, but mine were seasoned much le","useful":0,"cool":0},"JBATFWj-2faoWD3kMlNxVA":{"text":"Nondescript lobby restaurant in the Embassy Suites but don't let that stop you. Good beer ","useful":1,"cool":1},"uVyXWGpO63J-_ZBCbd00hg":{"text":"Pleasantly surprised by this place! I'm not usually excited about food inside hotels, and ","useful":0,"cool":0},"yycZFvKW3zlBabDvln6eiw":{"text":"The menu descriptions sounded amazing so went to get a stack and tomato bisque. When I got","useful":0,"cool":0},"0YOxrFeT1gXmlEC0ejli6A":{"text":"I enjoyed the Turkey with Fig Jam Grilled Cheese. I would go back #eatingwithchefsean","useful":0,"cool":0},"rreFX6ZERev_LLAKmRjqqQ":{"text":"I think my hopes for this place were a little too high. This restaurant is more like an ov","useful":0,"cool":0},"D11Ju6-zqoOXWxQi_V1IZA":{"text":"If you are staying at the hotel and it's raining out start here to eat. Food wasn't horrib","useful":0,"cool":0},"RLCPV52GSXRTxD7nJL9ScQ":{"text":"Hotel restaurant, decent location, staff is friendly, but not terribly attentive. We were ","useful":0,"cool":0},"kTMy_oPQI5IZ4yra0DB1dA":{"text":"Solid grilled cheese restaurant in the warehouse district! My 2 friends and I came in here","useful":1,"cool":0},"kzNX5S_ZkTThU--io26NZg":{"text":"There's a new craze hitting the New Orleans food scene: fancy grilled cheese sandwiches. N","useful":7,"cool":6},"iVuwVKHnOxKXDYkZrBSlkg":{"text":"I got the standard and my husband got the big bleu. The food was pretty good! I love me a ","useful":0,"cool":0},"9GGi4IeoQHnA4YD94yrmEQ":{"text":"One word: Mmmmmmmmm! Soooo good! With the cold weather now peeking through, this is a perf","useful":1,"cool":0},"w5El0NvsS5nyb7gbhNdUAw":{"text":"I came here during lunch hour on a Tuesday and you could hear a pin drop. The staff was fr","useful":0,"cool":0},"-B6KkvD7YjEl_tIbjhO4Og":{"text":"Ordered the Stacker Melt which is described as beef, onion rings, cheddar and havarti; the","useful":0,"cool":0},"JF_nLIueyZCu-zZje-v0Cg":{"text":"Went to Stacks for lunch before heading to the airport at the end of our trip.  It is in t","useful":0,"cool":0},"vwYbuM0zqmsHCxli2S9W1A":{"text":"$15 for a grilled cheese and fries? The menu looked great and fancy grilled cheeses are fu","useful":0,"cool":0},"HzeexJq_qkHbGLhYVnPhzQ":{"text":"If you're in New Orleans, set aside the beignets and seafood, and check this place out! It","useful":2,"cool":0},"d1p_PxaDS34afe7vOFn-0A":{"text":"Awesome! I love the concept of a grilled cheese place. The combos they offer are imaginati","useful":0,"cool":0},"f3dS3sEoOc5fwpcNUv9HXQ":{"text":"Stopped in with my family for a quick lunch. There were plenty of tvs (which was great b/c","useful":0,"cool":0},"yH2vzuhF3RVNojZipqx-4w":{"text":"The food is great. Really good soups and sandwiches. The only drawback is that it's more o","useful":0,"cool":0},"AaAl-aYADWBmIFgEIoVYQw":{"text":"Went splitskies on Turkey Fig and Chicken Bleu Stacks... Amazing! It was experience. Worth","useful":0,"cool":0},"qqNqrPeclBIgjyBliRr39A":{"text":"As we walked in I was quickly underwhelmed by the atmosphere. I expected it to be empty be","useful":0,"cool":0},"gf1sU_qGLwtd03LMuXUE9Q":{"text":"Worst salad I have ever had in my life..sooo over priced and very bland..my BF had the Ces","useful":0,"cool":0},"rMhYSxCCciEQFk07PFteiw":{"text":"What a MAJOR let down!\n\nWhen I was in NOLA last year this place wasn't opened and I was ex","useful":1,"cool":0},"JneK0kggkhnRlJahk8cqgQ":{"text":"Sloooooowwww Service.\n\nWaited at least 30 minutes for our food, then when it was brought o","useful":0,"cool":0},"d36AFCSaoktDRqYO56icpA":{"text":"We had the wedge salad with shrimp remoulade, and the standard grilled cheese sandwich wit","useful":0,"cool":0},"P4ao7HSfzlghSMeErJVcww":{"text":"Went for lunch. Bartender walked off for about 5 minutes without taking our order. When we","useful":0,"cool":0},"hi7ap6WLFTwOAxFK0BLV7Q":{"text":"Surprisingly really good food. Located inside the lobby of the Embassy Suites, so if you d","useful":1,"cool":0},"ZtJrUOAqWeaQ5M_jocdxpw":{"text":"Delicious!! Great food connected to the hotel, my son is a grilled cheese Conosouur and he","useful":0,"cool":0},"ZPugDOv8hy3gnkWYT2XRnw":{"text":"Nola Nachos: canned cheese with stale chips and spoiled crawfish. Couldn't leave fast enou","useful":1,"cool":0},"vmoT0F0AImSWtRmzty228g":{"text":"This was a nice little place for a quick bite.  The drinks were good (I had a hurricane), ","useful":0,"cool":0},"bC8-C1K4jcnUTDrhlUG9GA":{"text":"I asked the server if I could just get a grilled cheese sandwich, but he said it comes wit","useful":2,"cool":0},"1d2jg20iI2TvCC49JN-B7Q":{"text":"I came in here either Saturday or Sunday evening around 9:00pm.  There were 2 customers at","useful":1,"cool":0},"DQH_ilH8bhtoljOHxbZFaw":{"text":"Amazing food! We had the Big Bleu and it was one of the tastiest sandwiches I've ever had!","useful":1,"cool":0},"f_PeKvCuXMnpzckySNPyZw":{"text":"Service was bad. Did not get what was ordered. the five people at our table got our meals ","useful":0,"cool":0},"MURFGsUKBea9LMxo8UUMcg":{"text":"Great grilled cheese with shrimp! Worth a stop. No need to say more. Good service too.","useful":0,"cool":0},"XHvIJ2vcqSecl8BfqJhUfA":{"text":"Don't be fooled - this is just a hotel quick-eats spot that seems to be trying to capitali","useful":0,"cool":0},"U_7oC5hXpLnTMoenyepXoA":{"text":"Let me preface this with my deep regret for not having pictures to include with this revie","useful":17,"cool":6},"I7w2mbpEKEC873ga1dS67w":{"text":"Chef Menteur sandwich was extremely greasy to the point where I only took one bite. Bloody","useful":0,"cool":0},"k_8nYVjHMGsaCMUqNECqFg":{"text":"We saw this place driving in to NOLA from the airport and thought how wonderful it'd be!  ","useful":0,"cool":0},"msORoGvffUh9BxgTvOPQJg":{"text":"The sandwich was good. Had a chicken in buffalo sauce with Blue cheese.  Pretty good.  The","useful":0,"cool":0},"y3lf1F1vWGqXeSo9PLCKFg":{"text":"In the lobby of the Embassy Suites, cheese is on the bill of fare so let's eat.\n\nCurds or ","useful":2,"cool":2},"6AYEwTWqkjrsfB19QR-cTg":{"text":"Sitting at the bar with a few of my buddies in NOLA, we decided to order some grilled chee","useful":1,"cool":1},"BOKrsu-FnXtxDI_ByayPcg":{"text":"We walked past the sign and expected a nice grilled cheese, especially for the price. Howe","useful":0,"cool":0},"b5daVOp1yN-Ii4qexC5KUg":{"text":"Went to stacks for lunch. Food was service was awesome. We had the standard, boudin balls,","useful":0,"cool":0},"hgI71EdJi0l9Aw9PPtTw2g":{"text":"Despite some of the bad reviews, my visit was actually pretty pleasant. We sat ourselves d","useful":0,"cool":0},"4-3IIlST8OWgU06aiWCWow":{"text":"The logo of a sandwich in the front window of Stacks Grilled Cheese Bar tempted us inside.","useful":15,"cool":14},"i9D9zaMx5xVKeOp_QYtyTg":{"text":"Food was okay, but way overpriced for the portions and quality. I wouldn't bother eating h","useful":0,"cool":0},"FWlTgapIQZagtRDZmUfxCw":{"text":"We tried the gumbo, turkey n' figs stack as well as the club. Food not overly memorable bu","useful":0,"cool":0},"ZKzSgEwywO09TUjDHgHDEA":{"text":"Stacks grilled cheese sandwich was good but the service was bad. I do not understand how t","useful":0,"cool":0},"6KLyfJioO314cvDh9hmKfw":{"text":"This place top to bottom was the epitome of restaurant incompetence. I was hoping for a qu","useful":0,"cool":0}}