{"46LVW8e-KSklIE7GKydSJg":{"text":"Couldn't get in the door. I was greeted by a trainer who half-opened the locked front door","useful":0,"cool":0},"xYKmYNTOlcegbeWdNLNRuA":{"text":"This gym is clean, well managed, and very comfortable to work out in. All the equipment is","useful":4,"cool":2},"IcWp_TCciCP3GnwrKxljMg":{"text":"One word comes to mind every time I walk through the doors: CLEAN! The workout area, the b","useful":4,"cool":1},"__UFNx_YrxwfO9ssCi4ecQ":{"text":"Clean, bright, and well equipped with up-to-date and well-maintained equipment. The fact t","useful":2,"cool":0},"1JC-ByVuokz6hscgIvcl7Q":{"text":"Great looking gym and equipment is fresh and clean, people there were friendly, was visiti","useful":0,"cool":0},"155sZAto0SfB5-cBsAyg5g":{"text":"Small but was very clean and had nice bathrooms that were accommodating for changing cloth","useful":1,"cool":0},"pGwyJzvduvYTNlDpIv-8FQ":{"text":"Great gym. I would give 5 stars except I often have to wait to use some of the equipment. ","useful":0,"cool":0},"gy50kkR_xp7nVcI6KfFh9A":{"text":"Good gym. It's simple, quiet, very clean and everyone minds there own business and just wo","useful":3,"cool":2},"NK96wpoAsqbsbg_WjNmOEg":{"text":"This is an average Anytime Fitness. Nothing fancy. Parking is an issue and they recently r","useful":0,"cool":0},"6tLKYFoebdzx_iOQtJrwgQ":{"text":"I wanted to join this location because it was convenient. I decided not to join, I was gre","useful":1,"cool":1},"KcBYVEJOXDx24H0DyDrSBQ":{"text":"Literally the only option in the ByWater and Marigny areas. \nThankfully it is actually a g","useful":9,"cool":6},"nm1JXBYYLr4euZ1zSAq5Cg":{"text":"Terrible service, they not only make you jump\nThrough hoops just to get a membership they ","useful":0,"cool":0},"KD8RgMyR-iBGtgLFyReuVg":{"text":"Excellent Anytime Fitness franchise. I've been to several of them all over the country, an","useful":1,"cool":0},"9mAfs05-IlMCwZgoLplGFA":{"text":"The bar is set so low in \"poor communities\" and frankly, the cleanliness, machinery and ac","useful":1,"cool":0},"0A5yh_S9tj9DK9ZKhHELHg":{"text":"The one time I visited here with my membership I was not bothered. I also highly value tha","useful":0,"cool":0},"IG4L6TUQQglpb4ZclefESg":{"text":"I travel all across America. And go to many Anytime Fitness gyms. This is one of the clean","useful":1,"cool":1},"o9U3lX82SmzwI1iQYu0Pmw":{"text":"Great little gym in the Bywater. \n\nThey recently expanded, and it is a lot bigger! The bat","useful":7,"cool":2},"F9uMank_pBy4sBzLC7MLiQ":{"text":"This gym is everything I ever wanted in a gym and more. The facility is very well maintain","useful":3,"cool":2},"05ZzNDdu68n0-wlmo9IXZg":{"text":"The Bywater/Marigny section of NOLA always has that neighborhood feeling. This location de","useful":5,"cool":1}}