{"uvL7M_lTXxhtQ45yWIosEA":{"text":"Great car wash ! Love this place ! Employees so helpful & friendly. Every Monday get a car","useful":0,"cool":0},"8AAcje9RCUwy2RD0txqdbw":{"text":"I like the self serve bug area, pre-wash. The service was also great and you can purchase ","useful":1,"cool":0},"5AsFSL8mpAzARG91heDa-Q":{"text":"Great place for a quick car wash. Staff was very helpful and friendly even when I arrived ","useful":1,"cool":1},"RKAyrrCnEhYTvAEYb4l1QA":{"text":"You get a lot for what you pay for here, I got the basic $5 wash with added wax/buff dry f","useful":2,"cool":1},"uX4wDvN5JQjbWpH-7OJZvA":{"text":"Let me preface this review by stating that I do not have any complaints regarding staff on","useful":0,"cool":0},"fpzc8aPWmibS7KIYUDg2Sw":{"text":"Rut row, Soft Touch, i think y'all have just lost me because I've found a new crush. I've ","useful":4,"cool":3},"4eGe0IHsJ1nZMaO6fuO-uw":{"text":"Not the best also not the worst. Husband had to wash the windshield right after we came ou","useful":1,"cool":0},"oywduZkUdFCQaShN7MQ6rw":{"text":"Was not open yesterday. Add says \"hours every day 7am-7pm\"","useful":0,"cool":0},"AvkeJW1C04Un0rMfrG3YVw":{"text":"Wait, what?  This place is in New Orleans? It actually combines the city's winning persona","useful":1,"cool":0},"uLo6mcR57W2yAVAaQowLNA":{"text":"Great service, workers on site to assist you if you need anything and Monday Tuesday buy o","useful":0,"cool":0},"ly8_SgTq4LfHZPiDIVvlSQ":{"text":"As I was leaving City Hall on Saturday morning, I discovered this brand new car wash on Ea","useful":11,"cool":8},"mHCuTRrQVLd6JVHe8a7Yfw":{"text":"I dont know how anyone can leave a bad review for this place at all. To me, its hands down","useful":1,"cool":0},"63tBZYDDpXvYD8InUpz24w":{"text":"Best car wash in town!!  Prices are reasonable and customer service is great.  I had a lot","useful":2,"cool":1},"dLygC_JNo8GLj3dCTqg6hQ":{"text":"Convenient hours, convenient location, awesome & helpful staff.\n\nMy car has never been was","useful":5,"cool":3},"rWGWwJVS80YPv21GzD8iTw":{"text":"Quality service! Monday and tuesday biy one get one free deals is awesome. By far holds th","useful":0,"cool":0},"ZxFz2ILihfhioksnBggjKA":{"text":"I wish I could give them more stars! \nThe staff is by far the friendliest and most efficie","useful":1,"cool":0},"cjEsss54v7lYot2YR0AboA":{"text":"What is it about a car wash that leaves me thinking, \"I NEED TO TELL EVERYONE I KNOW ABOUT","useful":20,"cool":10},"H9t0nZ4H6Hnt4y2aali1Pw":{"text":"Best car wash I've ever been to.  Car looks awesome.  Strongest vacuums I've ever used.  G","useful":1,"cool":1},"-ZlxELcyr2K9JRnxcMAL6w":{"text":"Very nice car wash! Car was cleaned very well compared to a lot of express washes. Custome","useful":0,"cool":0},"D2bnpu3YttUjJm2ycDZ08g":{"text":"I was removing some leaves from my vehicle when I was approached by an employee. He explai","useful":0,"cool":0},"XNoApLwQGyob5cced5kMYQ":{"text":"Solid car wash. I like how they always have employees there to help you make your car wash","useful":10,"cool":2},"zEs1ngVIU9t_ZmfOPqCKwA":{"text":"If nothing else, come here for the vacuums. By far, these are the most powerful vacuums yo","useful":4,"cool":1},"QI_PfJUyb9ZVfsTfrpTIIQ":{"text":"They got me going with the free grand opening coupon. Now I go for the little things, powe","useful":1,"cool":3},"VeTEKO-VNvRFuVrJI_3iiQ":{"text":"I came here early in the morning around opening on Sunday because I was trying to beat the","useful":0,"cool":0},"nyORcPz_5vsCwgMd8FzuMg":{"text":"Great drive thru car wash close to my job. They provide many options at various price poin","useful":0,"cool":0},"yZsvR4UEQSFhorP7ZD6F-g":{"text":"Great car wash. I love the monthly plan. $30 gets you unlimited washes. They just opened u","useful":1,"cool":1},"AL1hASKm5uP4uQ5edFcTIw":{"text":"How can a white man Doug and kenny do so much wrong but keep there jobs drugs coming to wo","useful":0,"cool":0},"_cgX9w9wLsJe8BFxalH3cw":{"text":"One of my favorite places to wash off the old green machine. For it being a carwash, this ","useful":2,"cool":1},"mfUcwTJUGIJO0FoqN4_Ggg":{"text":"The worst $20 spent - didn't rise any soap off the back window. I told the guy i had soap ","useful":0,"cool":0},"UCL9aygGOOFFQKzqZCpVqg":{"text":"great wash,!!!!!! the best in louisiana  believe dat 2 1/2 from dirty to super clean outsi","useful":0,"cool":0},"9x1TtXJm0e8CjgEmUDyF_g":{"text":"STAY AWAY FROM THIS PLACE.  Their ramp damaged my splash guard,  and they didn't even give","useful":0,"cool":0},"QY_mRej93eTQrYcCN60Khg":{"text":"I don't leave many reviews, but this is a great car wash. Every single person who works th","useful":2,"cool":1},"MQ5wfwxjszBdrKJlGyP92A":{"text":"I've been coming here about twice a month since they opened. The employees have always bee","useful":5,"cool":0},"iCLB_iTc29HMMRBeOl8_Ug":{"text":"they always have some sort of daily deals and discounts which I love. They offer amazing c","useful":0,"cool":0},"u9xrIR-eKpawXEgiLBaFKQ":{"text":"The older I get the more I find chores to be calming. There is just something about detail","useful":14,"cool":8},"kA5FhFBDp2CYdx4jxxmvEw":{"text":"I went to Rich's wash dat on July 31st 2020 at 1pm and got the worst service ever. I have ","useful":2,"cool":0},"XG5WoByzq6TCHOVJiEWV2g":{"text":"Girlfriend just came back still in a rage that the attendant REACHED INTO THE CAR AND GRAB","useful":5,"cool":0},"A3MHQe6R3Q_2SxTlMstoRQ":{"text":"drove for lyft and uber and used this location exclusively. they were always very friendly","useful":0,"cool":1},"jJ2TXAPhC_aS3HnZML8-Nw":{"text":"Y'all, this place is awesome!! \n\nTo start, I pulled through their drive thru to be greeted","useful":4,"cool":2},"FSpJg38TRO3AIlRIAI9zdw":{"text":"Favorite auto car wash in the country.  They have really thought out their process, which ","useful":0,"cool":1},"hwSAgt6gHkTmvgdJVDRVJA":{"text":"Many thanks to my non-Yelping neighbors Ty & Carrie for turning me on to Rich's Wash Dat. ","useful":13,"cool":8},"DqJukEiT2xU04FpG8ivVPA":{"text":"Lol, at first I thought who reviews a carwash? Well, I do when they are clean, friendly an","useful":0,"cool":0},"bJ_VAz5-p-qAIadZM1VnaA":{"text":"As I have used this facility various times to get a quick car wash / the works in detail, ","useful":0,"cool":0},"GPqu1o0TF_1tD01xcloPNQ":{"text":"AFTER NOT HAVING DRIVEN IN 18 YEARS\nI bought a Jeep. And yes, like most middle-aged guppie","useful":14,"cool":12},"vAm9aRzstMiEcTiYo4rqbw":{"text":"Best car wash around! Vacuums are very powerful and the place is always clean. I actually ","useful":0,"cool":0},"jeyT22ZZp2dOv8xIoVrFIA":{"text":"Today I found out that is you text \"WASHDAT\" to 55678 you will receive a code for a free c","useful":7,"cool":4},"ML3dIVIN8RS8AxS2Jsnw9A":{"text":"I'm a lazy car washer, not gonna lie. I don't wanna get almost as wet as my car doing it m","useful":1,"cool":1},"VdA1OSoaBr3u7too8YGWug":{"text":"Best automated car wash I have ever been to. And yes of course every automated car wash is","useful":2,"cool":1},"RoMHeqr9MWv6re9Runj3XA":{"text":"They were running a special on the day i went so i got the deluxe wash for only $10! My ca","useful":0,"cool":0},"cIjS_JtzdFolOFxY3lVeqw":{"text":"This place is hit or miss I use to get rain x and wax but that area of wash does not appea","useful":1,"cool":0},"CesHdNyto-oKlzl6aWK7og":{"text":"Rich's Wash Dat is the best!!!! On Thursday they have their premium $20 wash for $10, of c","useful":1,"cool":1},"_4G-cDvlePE9_ggAsJynAw":{"text":"Eh, there are better car washes in the city.  \n\nThe business model here is like every othe","useful":4,"cool":0},"vYmJTC7wjvWmZ8c7rcsO0g":{"text":"They have weekly deals and memberships. The best and most convenient way to keep my car lo","useful":5,"cool":2}}