{"ga6de1xSlJRVn7eBDJjReQ":{"text":"Chris is a regular here at the Rook Cafe. We were having some trouble with our air conditi","useful":2,"cool":1},"EGmBbAAZODx2a68jlFHblA":{"text":"I called Christian about having a door fixed and he was able to send Reggie early the next","useful":0,"cool":0},"d3LwfFbGOR6RMwg9hE_8Dw":{"text":"Great Job!! Very professional and reasonably priced. Will definitely use again in the futu","useful":1,"cool":1},"R61fo5wf-8HMnLnxrN6DbQ":{"text":"Christian is the bomb.  He did a great job insulating my attic - on time and on budget!   ","useful":0,"cool":0},"8XvALpC3m2hBHG34imvuaQ":{"text":"I just had Christian and his team install a new faucet and garbage disposal.  I couldn't b","useful":0,"cool":1},"MaH10MPfqjHjaRP_ljuURA":{"text":"I found them on Yelp for a bathroom tile job. In comparison to other jobs he's done on his","useful":0,"cool":0},"Htt-1bQxvS496GHp1wDhQg":{"text":"Kind, knowledgable, trustworthy. Great company and crew. I plan on using for additional wo","useful":1,"cool":1},"YGYGR_OfhU_wZ_ZBiBeRIQ":{"text":"Christian did an awesome job on our bathroom renovation! We let his team work while we wer","useful":0,"cool":0},"gvRxmABhdRy9lkEIN8X6gw":{"text":"I had a couple of small projects, the sort that it is often hard to get anyone to bother w","useful":3,"cool":4},"t-ywr3U6F6lddZIyZlqGbg":{"text":"I talked to Christian Pokorn about a complete remodel for my house in Metairie. He was ver","useful":4,"cool":5},"aVz4aZcuHNEqLTHe1UUyNw":{"text":"So professional and polite.  Christian is a great guy to work with.  Very prompt, polite, ","useful":8,"cool":9},"JC6rYmtwIHtLFJLbgQlgAw":{"text":"KITCHEN FLOOR is now gorgeous and well supported. \n\nI was feeling \"soft spots\" in my kitch","useful":9,"cool":9},"mXQl4PFBfJfgxIdTTatPKA":{"text":"Having had some bad experiences with contractors in this past, i braced for this worst aga","useful":5,"cool":1},"SGFgWefoLKmyhQgQ5VO09g":{"text":"Very professional, hands-down the best contractor in town. Young, smart and very attentive","useful":1,"cool":1},"ghKMaKgmSIL2vQaVYZ7NUg":{"text":"yelp shows Pokorn as a roofer but when I called they said they do not do roofing.","useful":2,"cool":0},"ITefemFz-YjqMHpLv0HhlQ":{"text":"I've had Christian and his crew work on several small projects at my house and I will cont","useful":0,"cool":2},"klKLrRPnLMt0zSrvPiPV9Q":{"text":"I hired Pokorn Construction to help me build an addition to my place a few months ago. The","useful":4,"cool":1},"zXk0qAy1r6cOKoTWZXqWvQ":{"text":"Very professional, hands-down the best contractor in town. Young, smart and very attentive","useful":0,"cool":0},"5VvcWka2kWwNhI4drY7OEA":{"text":"I do not recommend Pokorn Construction Co. (Pokorn). We hired them to do a bathroom remode","useful":1,"cool":0},"pZpHu0weFj3R7a--jZ97Gw":{"text":"I decided to contact this company because of the many great reviews, however my experience","useful":2,"cool":1},"flSUI8OmH5b6urktW-vPSQ":{"text":"We were in the inspection period for a new home we were interested in buying and knew ther","useful":4,"cool":1},"oEH7nJJcR4k8hVeLpNBVFQ":{"text":"I sent a message to Pokorn to ask about their handyman services and if they would clean gu","useful":4,"cool":1},"_JWiK8u-V8bcjDnTL8xOAg":{"text":"I have had the pleasure to work as part of the Pokorn Construction group and know the ins ","useful":0,"cool":0},"AmqASIba8pjhIbI7UJJVoQ":{"text":"I don't like to write this negative review because I liked Christian (hence the two stars)","useful":12,"cool":0},"lM6qG31WRsmlDGNUlRQr-Q":{"text":"I got in touch with Christian, the owner of Pokorn Construction, because I had a long-dist","useful":2,"cool":2},"_TyCcPoAjbM2074C247l_w":{"text":"I do not recommend Pokorn Construction Co. (Pokorn). We hired them to do a bathroom remode","useful":14,"cool":0},"AO_MOte9uS5SWTcAZqQkFA":{"text":"This is a sad review to post. I've known Christian for 3 years and have used him on severa","useful":16,"cool":0},"GrKFHhLDDe7I_245UcjiFA":{"text":"Pokorn construction designed and built a walk-in closet in my converted double shotgun hou","useful":8,"cool":7},"b-3EIzeLPyJsXFJqi_-yvQ":{"text":"We hired Christian and his team to carpentry, woodwork and painting in our home - everythi","useful":3,"cool":0},"ytUCjAxubKWmIaaiMdHWDQ":{"text":"Pokorn Construction did a cabinet at our restaurant. He was fast, reliable, efficient and ","useful":2,"cool":1},"jALAraI7XLU_1AD8mEbH_g":{"text":"Made an appointment for them to come over to give us an estimate on repairing our kitchen ","useful":28,"cool":2},"7478ro8nwbMy7V_3Bkc_jA":{"text":"Mr. Pokorn was nice enough to send me a personal message and referred me to someone else w","useful":9,"cool":0},"bFOPO2eW4b2t8j3uwnQSjg":{"text":"Although the first impression of this company wasn't great they definitely redeemed themse","useful":0,"cool":1},"GTX1vfuUc1zLb2v2qZB3uQ":{"text":"I decided to contact this company because of the many great reviews, however my experience","useful":19,"cool":1},"85qtE19FG92z-TPhAH2zhA":{"text":"Where to begin.... I found Christian on yelp and decided to contact him regarding a major ","useful":4,"cool":0},"R8oh4m2HJD-Uq5AyX_TCEw":{"text":"Set an appointment for Reggie to come out and fix my window. He told me morning. At noon I","useful":19,"cool":0},"BnGhkE97vQfMhtZ_j2Jbyw":{"text":"I've waited seven years to remodel my home so I could save the cash to get all the upgrade","useful":1,"cool":0}}