{"AqnhKm43rCZJySFXEoUZ0w":{"text":"The loaded fries were delicious. The southern style chicken sandwich was a disappointment.","useful":0,"cool":0},"6HA_GmyXJEQRhd5HtghWig":{"text":"Less than one star. They answered their phone and left us on hold for over 20 minutes, for","useful":0,"cool":0},"SZ9d8DysvrT8GakeMieeJw":{"text":"This place is a bit hidden, as I thought google maps took me to the wrong spot. It's actua","useful":0,"cool":0},"SgsIyBT0G5b6l5FeVEuwow":{"text":"I love everything this place has Mac & cheese to the burgers & fries ... good atmosphere a","useful":0,"cool":0},"cz4-nSWhYz4YULEBYLKXTg":{"text":"Got delivery, order was correct and fast. Friendliest delivery person, too. Provided me wi","useful":0,"cool":0},"FnHlgxWFnbNfF36DLgnU-g":{"text":"Faubourg Bistro is quite literally a \"hole in the wall\", and those kind of places are usua","useful":1,"cool":1},"BsOpsJQo-ZP9hLa2Mii97Q":{"text":"It's a little kitchen window with a small 4 table bistro attached to the 700 Bar.\n\nFrom th","useful":4,"cool":0},"VoS7Pa-uX94BzRsBTkialQ":{"text":"Fun atmosphere and great bar food. \nLiterally something for everyone. If you like good com","useful":0,"cool":0},"60prAdKt2ic7qQhNgZLkfg":{"text":"Split the fried Mac n cheese, and chicken tenders. Anything deep fried in Panko is good, b","useful":0,"cool":0},"Q9pMSzsi5TH_FOgXTcyf9w":{"text":"Cute bistro located in the back of the 700 club. It has a separate space from the bar, if ","useful":3,"cool":3},"mopd5Cb6MHEH74WOuRUyyA":{"text":"OH MY GOSH! Best catfish sandwich I have ever had and I've had my share! Wow! Small window","useful":1,"cool":0},"hOjTyjFry5DHr_Ov34gaXg":{"text":"This place is no joke. It is legit delicious american foods. Located in the 700 lounge thi","useful":1,"cool":1},"jLnBYUHb45Zspnk8Wi_ExQ":{"text":"The food here is soooo good! It's a nice change from the creole cooking after being in New","useful":1,"cool":0},"2JaXWoALtxTyXz4VNmEPBg":{"text":"Food is definitely above the average for the area, not a typical tourist spot. If it were ","useful":0,"cool":0},"xYGpxiZImm0zJJq-dcHhtw":{"text":"Really hard to find and then once you find it, it is unclear where you're supposed to orde","useful":0,"cool":0},"0p69ybY7NgVtutcKeeFLZA":{"text":"Had the buffalo wings, bacon mac and cheese and the pulled pork fries. \nBuffalo wings were","useful":1,"cool":0},"ZHtauYv5tam8J51PEBok-w":{"text":"MUST EAT HERE!!!\n\nOh my gosh this was amazing. The burger was cooked perfectly and had so ","useful":1,"cool":1},"mGPJbUps-f20fgrHq2AbXA":{"text":"An interesting find, no doubt. Gay bar in front, delicious food in the back. Par for the c","useful":3,"cool":2},"jdK-UKiy8eZK7R7a5Z1NRg":{"text":"It's a nice bar/bistro off the beaten path of Bourbon Street. The food was good and so was","useful":1,"cool":0},"b5ejPg6tcpBBisq6B8EuXg":{"text":"Delivery service was quick and efficient, they delivered to the hotel in a jiffy. The food","useful":0,"cool":0},"yQddi2NmxSNS2C1mdTiuxg":{"text":"The best meal we had in New Orleans!  We shared the Piggyback Fries and the Pizza Mac & Ch","useful":1,"cool":0},"WnkkpPWUVU43vH8WK0Bajw":{"text":"Delicious and affordable. We got the pig fries, burger, chicken sand and mac n cheese all ","useful":0,"cool":0},"SMtoJgqBk2mxSMdxYgXhXQ":{"text":"The reviews are right! It's a little hard to find because is shares the space with a bar. ","useful":0,"cool":0},"36HzioZIrG7Ws2Wpmj3F5g":{"text":"This quickly became my favorite go to burger place in New Orleans. Unusual burgers with in","useful":0,"cool":0},"aEhAODAYCluilcNXRyxb6g":{"text":"I seriously love this place. Today I had the fish and chips. Oh boy it was a lot of food, ","useful":1,"cool":1},"cUPniORlYJg31iUOcsqQIQ":{"text":"The food here is uh-mazing! We had attempted to eat here once before but there was no plac","useful":0,"cool":0},"ZkT3jPMYc95SIqniqxLGYA":{"text":"This place was so good! The food was absolutely delicious! We got the Mac and Cheese, Pizz","useful":0,"cool":0},"QcaHTNqijgKneXaetXSpLw":{"text":"Ordered fish and chips. Probably the worst I've ever had. Be careful or you'll break your ","useful":0,"cool":0},"TyyaPd7rR-DtP5plgUvqRg":{"text":"What just happened!?! Omg!!! \nBest burger I've had in a LONG time!!!  The place is located","useful":1,"cool":0},"yIBYm-jQ5ZBvhJ1Aas8D6g":{"text":"Wow is all I can say my catfish sandwich was so good!! My husband got the southern chicken","useful":0,"cool":0},"qpJ1HPupIQESAkFP6DtbcA":{"text":"At 1:30 am was starving one of the few places open. Had chicken burger very delicious, tas","useful":0,"cool":0},"VPKEcsWX9NkcmQD2C-JDJw":{"text":"One of the best fried chicken sandwiches I've had. PB&J wings are good if you like peanut ","useful":1,"cool":0},"1QQq0w4qlpMGQPrDbF6pZw":{"text":"Stopped in for lunch based on others' Yelp reviews. I like that you walk to the back room ","useful":2,"cool":0},"OhBxAQbXRDjtTTNfrixqTg":{"text":"What a good find! We walked from our hotel and the 700 Bar was easy enough to find. I orde","useful":0,"cool":0},"u8HGjlX5xTg_dZNxOncSdw":{"text":"Would have loved to eat here, but after sitting at a table for 30 minutes without ANYONE s","useful":0,"cool":0},"4fZE7uGQloEYuKYQLwBsnQ":{"text":"Food was delicious and fast delivery in the French Quarter! Mac & Cheese bites were amazin","useful":1,"cool":1},"gBHcMcahQuHvaYVzH1zeHQ":{"text":"Great simple food! Very friendly and courteous staff. You could clearly tell that they put","useful":0,"cool":0},"HdnrfiY-5pH1hGMweYxb4w":{"text":"Really disappointed in this place. I was greatly looking forward to trying their red beans","useful":3,"cool":2},"QsmqD567Lp7DXGpLzlAkKA":{"text":"Solid pub food spot,  great for lunch if you ate in the area. The Mac skillet is more than","useful":1,"cool":1},"isldSkBRzb_wm_baeVHsSw":{"text":"I might be slightly tipsy from the drink and drown well special at the bar but the skillet","useful":0,"cool":0},"X_4GpPyQPa4ZpRFTPXH2Ng":{"text":"A little hole in the wall but it has such amazing burgers!! It was a 4 minute walk from ou","useful":0,"cool":0},"I57dN6zqDSzomqgDJpXd4Q":{"text":"Little place in the back of a bar but packs great food back there. We had the loaded fries","useful":0,"cool":0},"W-dtnsbIG8Axw69IflRgGQ":{"text":"Very good, love the ambience and the food is awesome. However, did not see cajun/creole on","useful":0,"cool":0},"S9wQPuT-1muUwajHpkrRNg":{"text":"Love the location and all but the fish and chips was too salty and over seasoned. I really","useful":0,"cool":0},"4A2-W_tzrHBwm4mQoWm2GQ":{"text":"Catfish sandwich! Had this 3x in my short stay. And the fries were the kind you just cant ","useful":0,"cool":0},"ID_6K12uqrE2iautMfAy4A":{"text":"Place was awesome. Found it on our last night in New Orleans and probably a good thing bec","useful":1,"cool":0},"qvtqhTrLSOhKqR4WQFKdaw":{"text":"Excellent bar food and super friendly employees. The veggie sliders are some of the best v","useful":1,"cool":0},"yEAEUYDpSD1UJIj6FpA_5Q":{"text":"Great flavorful food. Recommend the catfish platter. Lots of flavor in everything we tried","useful":0,"cool":0},"R4TMQq9ovnfGtOvG0u6lYA":{"text":"Second time coming here. They have such a great vibe here. From the servers, bartender, to","useful":0,"cool":0},"-46f9bM56fm4UwHi4VJnjw":{"text":"The bar on the street is actually 'The 700 club'. The review is for the attached popout ki","useful":0,"cool":0},"Dn9f3mdta9bRcF3xnfkVGg":{"text":"The food was crafted nicely and the menu was creative. I had the PB&J wings which were ver","useful":0,"cool":0},"eMXcaIsLqMrxtxAsYVHKKg":{"text":"I can't say how great this little hole in the wall was! We had the mac n cheese bites (awe","useful":0,"cool":1},"XXR44EWabj02_IX0KBUu2Q":{"text":"Outstanding burger! Great service. It honestly has to be one of the best burgers I've ever","useful":0,"cool":0},"7gV41UeCV1ydvRn33kaTKA":{"text":"Had the most amazing lunch today - Beef and Cheddar brussel sprouts and 1 chicken tender! ","useful":0,"cool":0},"ln8kgbvcmpa6tDSH3I5S5Q":{"text":"We came here in the middle of the night starving. There were literally no restaurants open","useful":1,"cool":1},"_yY8xW3n3TFFEh5fcazazQ":{"text":"The people are all awesome and the food is soooo good!!! It's bar food that's really yummy","useful":0,"cool":0},"Olg0hQRAdvizN58tTGKugA":{"text":"The mac & cheese bites were 'slap ya mama' delicious! And my cheeseburger was perfection. ","useful":0,"cool":0},"uojqaz53N9bDFm29eRyjIg":{"text":"Went for the Mac and cheese bites. They were amazing. This place is a hidden treasure. Not","useful":0,"cool":0},"GqPuA1qH4Dmm9OV6pG0R5A":{"text":"In the back of a bar...but man it was absolutely incredible. Servings are huge so definite","useful":1,"cool":0},"S2mqTeqFhuWkGpxBc049dw":{"text":"Literally the best chicken sandwich I've had in my life... well paired with the siracha sl","useful":0,"cool":0},"MHq2LgiM5_5OKXMjS7JWGQ":{"text":"Although a bit hard to find at first I am glad we found it, hidden behind the 700 bar you ","useful":0,"cool":1},"XkaJKguc8Xp3SNi6dQoY3A":{"text":"Food was yummy. It is in the back of the bar, you order there and take a number and someho","useful":0,"cool":0},"fNbckXPAjRMybKAXt0iiDQ":{"text":"Yes, I made him walk all the way over here because I saw a picture of what looked like an ","useful":1,"cool":0},"8tAi8gy1JT0_3ORN3Rmx8g":{"text":"All the credit goes to David for discovering this place through Instagram. After seeing al","useful":9,"cool":7},"FSgZdq0_CiwfxslxqLblrA":{"text":"We came here on a Monday night at 9pm and it was understandably empty in the restaurant se","useful":0,"cool":0},"9rPKHVCVTKxjBUaydA_2kQ":{"text":"WOW!!!! Go here. Order the Mac n cheese bites and the Mac and cheese skillet. Husband got ","useful":1,"cool":1},"dkQgEZeGOLUs6MebeOrLOA":{"text":"Just had a burger (with pepper-jack cheese) and fries delivered. The fries were amazingly ","useful":1,"cool":1},"fWvCAUfCMypdx1ZTJ1BYOw":{"text":"This place seemed very odd as it was inside a bar, but turned out to be very awesome! I'm ","useful":0,"cool":0},"7lRQ6ZYyjHLvEMScV6tkGQ":{"text":"Definitely not what I was expecting having to go through a bar to get to the back where th","useful":0,"cool":0},"hDhRJoQqw9GP2KlxCHJ2dw":{"text":"Was looking for good eats on a tight budget in NOLA and my damn the expectations were succ","useful":0,"cool":0},"1XToK77lnXB6RuwAs1_B_A":{"text":"I wasn't feeling well and didn't wanted to go out to eat. I order food from Faubourg Bistr","useful":0,"cool":0},"4P4d2IQdrMe3pkyuKe3bBA":{"text":"I had the wings with peanut sauce. Yum.\n Not to much fat and the jelly sauce was super.","useful":0,"cool":0},"mqjttxmgSjZnxsydqAIgPQ":{"text":"I went to this place on my day trip to New Orleans, the food was decent but the drink I or","useful":0,"cool":0},"kwnZwlXbmH4q0qE1Vjqeqw":{"text":"Les meilleures frites ever! Épicées, très bien assaisonnées, le burger Roasted beef and ch","useful":0,"cool":0},"dAR3gU7Vn5l0bP7ZicT4Fw":{"text":"Great burgers and fries flew in from Florida stop by this restaurant for lunch. Service wa","useful":0,"cool":0},"A68lXfGe7-LAiZYkRfwrAA":{"text":"Best food I've had near the French quarter that is reasonably priced. \n\nSandwiches here ar","useful":0,"cool":0},"U91uw9xouiICbd-VGUKZdw":{"text":"This is one of the best places we've eaten in the quarter. Food is reasonably priced. The ","useful":0,"cool":0},"1A0V_PNLpfJI0Gow57ScMg":{"text":"This place is amazing! The best southern chicken sandwich! The mac n cheese bits are aweso","useful":0,"cool":0},"xFb-zI-4DH_hwmDOoXDsJw":{"text":"Food was phenomenal. The simple things done well. Fries for days. Everybody is so nice too","useful":1,"cool":0},"zcIamMbweCnDiK1gpR5_NQ":{"text":"What a hidden gem!! Omg... I cannot really say enough about this place. Literally everythi","useful":2,"cool":1},"ZRMgNbD5UO61-C5LR8WuHA":{"text":"Best bar food I've had in the FQ. Detailed flavor profiles and excellent quality ingredien","useful":1,"cool":0},"u7OkyEmFqemOq1P6Ay6LNw":{"text":"Found this hidden gem on yelp. It's in a back corner of a bar in the French quarter. My bf","useful":0,"cool":0},"0ELuPX4Ic85D_bmKhrqg3A":{"text":"Good food, good service, fun atmosphere, cheap wine. Good place to drop in while visiting ","useful":0,"cool":0},"slEx0WO-mGVU8fUAuJmrmQ":{"text":"So glad we found this place in NO. Great food and a cool atmosphere. You order at a window","useful":0,"cool":0},"Vmh-g8VjCw1JITUO9R7qLA":{"text":"EXCELLENT food && service ! I ordered a fried chicken sandwich with cheese, onions rings, ","useful":0,"cool":0},"PC95is1OSx5gKWEvPWokIw":{"text":"That firecracker cauliflower sandwich--dynamite! A definite must try for vegetarian foodie","useful":1,"cool":0},"z9d5aTp3zKQQfGI2z1YwaQ":{"text":"What a hidden gem! I was looking for a fried chicken sandwich and I saw the option on yelp","useful":0,"cool":0},"YAc7JtMnYN0QuVo8ywcjBA":{"text":"I ordered the catfish sandwich. The catfish filet was hot and a big portion. The coleslaw ","useful":0,"cool":0},"5LJgwlwwP-b4stcimpmJYQ":{"text":"Sriracha slaw on fried fish was very tasty. I wish the hours were more consistent. We flew","useful":0,"cool":1},"i2VhxjOirlzDITish6Cczw":{"text":"WARNING THIS IS IN THE BACK OF A GAY BAR!!! You have to walk to THE BACK of the 700 Club t","useful":3,"cool":0},"Rs_s2ptILLcSjraP5QJHyw":{"text":"Fantastic food. Between three of us we had the peanut butter, bacon and jelly wings, mac a","useful":0,"cool":0},"mhvEpjJZrUwRO7y0hf1ahg":{"text":"I had the fried macaroni and cheese and fried chicken sandwich. It definitely hit the spot","useful":0,"cool":0},"gVP8mHa0cuUppeLgkqwZFg":{"text":"The best American based food in the quarter. Have not found better, just have to tell them","useful":0,"cool":0},"uZCm4wMFE4qrUU9Q18p9Vw":{"text":"Phenomenal hidden gem! Portions are HUGE but the food is so so good. One of our best meals","useful":0,"cool":0},"-MKqZ66O33cs72kmn9Wpag":{"text":"Delicious!!  We ordered delivery and got the chicken tenders and bacon Mac and cheese. It ","useful":0,"cool":0},"JbBcviDCPWOocxT63KrbNQ":{"text":"Girlfriend and I ordered the chicken sandwich and wings. I thought the food was amazing, r","useful":0,"cool":0},"JL6DMHOLfAlLun-o_X_S9A":{"text":"Walk past the bar and head to the back. Dont look at the menu. Order the beef and cheddar.","useful":0,"cool":0},"ycyiHF5tZUJPEhrGVgLmYw":{"text":"The best Chicken Sandwich I have had in my whole life. Brussel Sprouts without the Bacon..","useful":0,"cool":0},"19FrxkwEQc8ahmvH2azJ3w":{"text":"Less than zero. Guy forgot my order then said he almost died in the work area. WTf?  I liv","useful":2,"cool":0},"DqyRpZzYNM6r2ATiHTANMQ":{"text":"Found this late one night when I was craving some good food but all the restaurants I want","useful":0,"cool":0},"r1Gs2WCCaosA5NVK_Qy-Cw":{"text":"The name of the bistro is on the door of the bar. Go in. Walk towards the left through the","useful":1,"cool":0},"oqTBnm-UfJveKSx7JLFyQA":{"text":"Fried chicken sandwich was great until I found a piece of plastic in my food. Very gross, ","useful":1,"cool":0},"byMiF0VJ35SoweFFULabEg":{"text":"I got the cauliflower sandwich, the cheese did not go well with the vinegar in the cole sl","useful":0,"cool":0},"c7ISXeukfsd6KjqkG7ZBZQ":{"text":"If you like overly dressed up in mayo and so much cheese your arteries clog before you fin","useful":0,"cool":0},"CPmHh45vkPl_4pu5BFSFYg":{"text":"This is a super cute hole in the wall in the back of the 700 Club. We came here for a casu","useful":1,"cool":1},"sNVVZJIXNVVEANiD0N_vQA":{"text":"Perfectly reasonable and unobjectionable dive bar that has fun Mac and cheese skillets and","useful":1,"cool":0},"lbYRZLvV1i8WPotB-lD5VA":{"text":"The catfish sandwich is amazing. Big juicy piece of fish, fried to perfection, with a nice","useful":1,"cool":0},"sYJ2ECDIsRLylGpu7JbwRw":{"text":"One word!: awesome. The service is beyond great. Very friendly people. We came from Califo","useful":0,"cool":0},"uHiwfeX_njDKoKJcBhe3Gg":{"text":"Absolutely amazing red beans and rice veggie burger! I had never seen this before on a men","useful":0,"cool":0},"UAp3e0bCE80RWKFndcdjEg":{"text":"Thanks for waiting 38 minutes...you know longer than our delivery estimate to let us know ","useful":0,"cool":0},"nlEzbbOLFWsuVrscWXs0yg":{"text":"Just had the chicken sandwich which was decent. Also had the cheeseburger and that was rea","useful":0,"cool":0},"KDQfCMIbIToyeE4hwPVa4w":{"text":"Do yourself a favor and get some pb&j wings and a Mac and Cheese Skillet. This place is a ","useful":0,"cool":0},"UGO37q6l_-qbI_gNBs3KzQ":{"text":"The peanut butter and jelly chicken wings will give you a psychedelic experience. Burger i","useful":0,"cool":0},"myFv8Sq6JW5WjRB9nSYs7Q":{"text":"Awesome little place hidden inside the bar. Very cute. Cash only. Fresh and delicious. Ama","useful":1,"cool":0},"oNSTR6apwQrDnJoKbq2WdA":{"text":"Great people, excellent food and the highest quality of service. I recommend for all occas","useful":0,"cool":0},"hsTwHua4fy1HFMz3ra9Yzg":{"text":"Very pleasant surprise, needed a quick delicious dinner before going out. The convenience ","useful":1,"cool":0},"TcFUHz2aNh6ryNg7VdAcsA":{"text":"A great find!  After wonderful Nola fine dining for a couple of days, we were looking for ","useful":1,"cool":0},"s6d6Blx3xhZjtBw3uWCYFA":{"text":"I visited New Orleans in May.  I got takeout twice from this place.  The PB Jelly Bacon wi","useful":0,"cool":0},"GXoOpoVeNHFiTgn_YJ2Vyw":{"text":"Ordered delivery from them twice during my 3 day stay in NOLA.  I had the cauliflower pobo","useful":1,"cool":0},"vvFd0jFHZRHxlkdPrKLfkQ":{"text":"Good place for yummy junk food after a night of drinking!! Super cheap drinks! Bar tender ","useful":0,"cool":0},"SoZ-YSDsfdHc-yzx16JfRw":{"text":"This place is AMAZING! We were here visiting and went to all the \"popular\" places...but th","useful":1,"cool":0},"OLVM5KTGwO-uhxSygK_CXQ":{"text":"Not the easiest to find- push your way through the crowded bar to find 3 small tables in t","useful":0,"cool":0},"IWN_5HGW50bKu2bRit7yEg":{"text":"In the back of a dodgy bar, which is why we almost didn't go. The food however, was amazin","useful":0,"cool":0},"5xkuTHRN2U6tb8NIEy_kjg":{"text":"Great small place. Little hole in the wall. Burgers and Mac & Cheese Bites are awesome!","useful":0,"cool":0},"b0Ldg8rHFhDuv24vDc7Hxw":{"text":"We had the pizza mac n cheese, po boy, and Brussel sprouts and bacon. The mac n cheese and","useful":0,"cool":0},"dizrz-eQ97NShb0604ARkA":{"text":"Delicious southern chicken Sandwhich and phenomenal brisket and cheese Sandwhich. The mac ","useful":1,"cool":0},"oh_zrkg9HsUb0ER6rlNdaw":{"text":"This place was the food highlight of the trip.  It makes me sad because it's not tradition","useful":0,"cool":0},"O47YZfsC-JukI889w_schw":{"text":"Great food! I ordered a bistro burger and the Brussels sprouts. The burger is quite good. ","useful":0,"cool":0},"ouhfytliR_oIcuHwHu3rZw":{"text":"This is a really friendly bar with a restaurant tucked into the back. The food is probably","useful":0,"cool":0},"_TrOAFt4BS96Xi08akjEnQ":{"text":"Weird little off the beaten path joint. Food was nice, a bit of a wait. In the back of a c","useful":0,"cool":0},"g6OWvacxj96ETEiLXDB7Lg":{"text":"Came to this place when looking for a place open to eat at 11pm.  Of course, in New Orlean","useful":2,"cool":3},"W7L8vDAk7mRA6TvY4maMuw":{"text":"Was looking for a good place to eat for our first night in town and was glad we stumbled u","useful":0,"cool":0},"3W3LZWBwOqWgOgstBVcbdQ":{"text":"1 star for the food I received and the initial experience, but 4 stars for how the manager","useful":0,"cool":0},"xcSw6p-m0fhR2M_-GMbbQA":{"text":"Soooo good. We split a burger and the pulled pork fries and both were amazing. The fries w","useful":0,"cool":0},"YX1Eh4LP0AWlNuxyP_lFMw":{"text":"This place is unbelievable. So ridiculously good. I definitely recommend the loaded fries,","useful":2,"cool":1},"CYJo3wqMjlxqqRNawSYooQ":{"text":"I so enjoyed my Food I wanted to back but I left town.. this place is now on my list of gr","useful":0,"cool":0},"cCCSaOf-44Ifp33I8zPrVA":{"text":"Love the food and good service too. We had special chicken sandwich (not in the menu but w","useful":0,"cool":0},"9SWt8bbT4Br-yXqfOkwbyQ":{"text":"My friend and I stopped in for lunch on our first day in New Orleans! We both ordered burg","useful":1,"cool":1},"fVmles1e8LUWiJ9HrMT4yg":{"text":"Dude, this place has got to NOLA\"s best kept secret! Did a search for casual food while ru","useful":0,"cool":0},"x-jiNyZxtUYidx-MRlxCJA":{"text":"The food here was great! Huge portions, quick service & friendly staff. The we're busy so ","useful":0,"cool":0},"XqFVsxND6oVUx0s-e7P2pg":{"text":"great food, always hot when delivered. I love the burgers the most.","useful":0,"cool":0},"PZQ2EePnS2IJ0LyyjqExfg":{"text":"If I could leave more stars I would. Seriously, so freaking good. Highly recommend the cra","useful":0,"cool":0},"yZNipNlXMSckV8eNI-Sr4A":{"text":"I've had my eye on this bistro for a little minute... just waiting on the perfect moment t","useful":0,"cool":0},"YS-NsYvW0z5cK4wai1podA":{"text":"Burgers were small, but definitely fulfilling. My friend had the bistro burger and I the c","useful":0,"cool":0},"rTuinUBT3nN0Upl-stWriA":{"text":"The food I've eaten so far in Nola has been incredible, but I've been craving a simple bur","useful":0,"cool":0},"d6TkU6TCMQ-WgLIf0HzcEA":{"text":"Although it's hard to find because it's in the back of the 700 Club, this place is 100% wo","useful":0,"cool":0},"Jns8h0libTOVvJ-mZ253HA":{"text":"They weren't supposed to deliver to me because I was alittle out of the way but they did a","useful":0,"cool":0},"cJBrWGnjO-yxQfT76YB69A":{"text":"Went on a Thursday night. Nice neighborhood bar feel and the food was fresh and full of ex","useful":1,"cool":1},"XiV9q3b3g78MksuqIvrH5A":{"text":"Delicious spot 2 blocks off of Bourbon Street.  Definitely a hidden gem for tourists as it","useful":1,"cool":2},"FO0lPjZuvL3AiCW9cx4OSA":{"text":"Everything was delicious..Catfish sandwich was perfect..I just changed my condiments to th","useful":1,"cool":0},"nu3H9dTIRsj7mOx2qBpRHQ":{"text":"Found through Yelp!\nI loved this fantastic place.  It was walking distance from our hotel ","useful":2,"cool":1},"ynlg6auY3eCWA0V3wg_LLg":{"text":"Always the perfect addition to a fun night at the club.  It's not just that frozen stuff o","useful":0,"cool":1},"7C83gEYQ28zQ0gcuFAsGvg":{"text":"This eatery is a hidden gem... literally.  Located in the back of a bar on Burgundy St., t","useful":0,"cool":0},"Jx7isurdPib2wgNomDSx1A":{"text":"This spot is awesome! The food was made from scratch and it tasted great! If you looking f","useful":0,"cool":0},"4xu4GLw7tavCZZd9QdkwWA":{"text":"Tiny place in the back of a bar(700 Club). Worth the stop if you want something that feels","useful":0,"cool":0},"WBOmUVDlkNXM6EeKc0xSkg":{"text":"Amazing.  I was born and raised in New Orleans, worked in the French quarter, so you can t","useful":2,"cool":1},"s44eJEOl-aba3OV4Ub4a2g":{"text":"Look.  It has been a long day of driving followed by a rather short evening of drinking an","useful":3,"cool":0},"SVeZkK0PRs1Zh6HkAP2HUg":{"text":"We had the cat fish sandwich with siracha Cole slaw was out of this world.  We ate the Mac","useful":0,"cool":0},"YCYM382wu7rN5WaJX1KHaA":{"text":"I booked marked this restaurant as a if we have time to go, boy am I glad I made the time ","useful":0,"cool":0},"soC_QbGl8J4DaJ8xHL9gsw":{"text":"Really good and affordable! I will definitely be back. A guy mentioned he ate there 2 time","useful":0,"cool":0},"hp_j0ZudSsJMjPQQy4f71w":{"text":"This place is actually just a window in the back of a gay bar.  No sign outside.  Walk in ","useful":0,"cool":0},"Jo3xQ1zVtr0uo6NvCpooyg":{"text":"Visiting from the DC area and we were starving for late night food. This place was a godse","useful":0,"cool":0},"frmnEvsEYVQiKB_JFen2cA":{"text":"I'm so glad I stumbled upon this place on yelp!\n My friend and I more particularly lazy on","useful":0,"cool":1},"ljZkR5K1DJUeJx6aq6Pw8g":{"text":"I was anxious to try it. Got takeout. The Brussel sprouts were underwhelming. Not sure I'd","useful":0,"cool":0},"2oI5runJIEf-wyHTvvtgxg":{"text":"We ate the checked fingers with orings instead of fries and the pizza Mac and cheese. Ever","useful":1,"cool":0},"MkonJLFQ80PKRH7caEZNNw":{"text":"My boyfriend and I were in New Orleans for his birthday and wanted to find a nice burger s","useful":0,"cool":0},"cOyw1Wnsf0sZhqr2qSbILA":{"text":"We stumbled in here by accident and so glad we did. We Ordered chicken, fries, mac and che","useful":1,"cool":0},"40VgD5bg4PCjgDkRCj0IOA":{"text":"OMG the piggy back fries were the best loaded fries i have ever had!!!  And the mac and ch","useful":0,"cool":0},"rEJW2oHCRDR6-bdObztFAg":{"text":"Great Mac and cheese! And their bacon is some of the best bacon I've had! The burger was p","useful":0,"cool":0},"t1KuZFNfrfIW6fOZS4fUJA":{"text":"WOW!!!! Hole in the wall amazing restaurant. Don't let the order at the window put you off","useful":0,"cool":0},"OSgLrxN_3ycDxX3piWQFQw":{"text":"Ordered a burger through Postmates and it came pretty much raw. It was still cold in the c","useful":1,"cool":0},"NJoeejUWhCBZHhTxjuRiPw":{"text":"This place is a hidden gem. Me and a friend were in NOLA for a week and this was by far th","useful":0,"cool":0},"DN0Xm61AemSNcJF7m89kHA":{"text":"My catfish was a great, it was hot, seasoned perfectly and crispy! Chicken sandwich was th","useful":0,"cool":0},"Prd_rG4ohom9V5A36kgF1w":{"text":"This little secret will surprise you. Located in the back of a busy club, Faubourg Bistro ","useful":0,"cool":0},"Zrs9XttEgc2mkfahtqPVYg":{"text":"This is a bar that serves food. The food is amazing. 3 different sandwiches and they all w","useful":0,"cool":0},"OYiw_ZalJKfm7cm8wlHE-Q":{"text":"The mix of ambience and 5 star cuisine is fit for a prince but on a paupers budget. Truly ","useful":0,"cool":0},"lvQkg68cE8OjMSps8c9-0g":{"text":"Amazing food!!! Had the chicken sandwich with fries and ranch dip (I'm a ranch snob and th","useful":0,"cool":0},"4INjhcf__HhFix5E8Q4Agg":{"text":"Do not come to New Orleans without stopping by Faubourg! Happy hour is from 12-8. Deliciou","useful":0,"cool":1},"za9tusDtr_u-mj_vT4ifUA":{"text":"This place was slightly confusing since it's located in the back of The 700 Club but it wa","useful":0,"cool":0},"dN84d65gsFy1J3R-ez98AA":{"text":"My friends and I were looking for an inexpensive place to eat for our night out on the tow","useful":4,"cool":1},"tdqim9qHMroUMUYAQ9yp0Q":{"text":"Oh lawd this food is AMAZING! We thought we were going to a bistro and actually ended up i","useful":0,"cool":0},"twIW-NrmQUabmE47K8S13w":{"text":"Amazing chicken and catfish sandwich great onion rings and awesome pop music vids... away ","useful":1,"cool":1},"ZUNpks0cSoBPqu1NtSuuAg":{"text":"Amazing!!!!   One of the best burgers I have ever eaten.  My wife loved the fish and chips","useful":0,"cool":0},"uB8PUEyHzfBr571LmoWd6Q":{"text":"This place never disappoints, come in every weekend, we either get the wings or the Mac an","useful":0,"cool":0},"U4t_SNu-5HY5ncHBsDfXMw":{"text":"New to the NOLA, I ordered in from the Holiday Inn Downtown-Superdome. I ordered the south","useful":0,"cool":0},"aKMibzNFSoF3xKQPWcnevQ":{"text":"The food is great. Much better quality and price than what we saw on Bourbon street. \n\nThe","useful":0,"cool":0},"5v4KDXAayEcT2DjsjDwNag":{"text":"Amazing melt in your mouth!!!! Had the roast beef sandwich and it was delicious. My husban","useful":0,"cool":0},"aMRtB491-4yvA2fOPs30BQ":{"text":"Yum. This is a tiny spot in the back of a bar, but don't let that deter you. We stopped in","useful":0,"cool":0},"LSab7EjVGNB7-n0E9EsxBg":{"text":"Iiterally the only thing  wrong  with this place is one of the staff members. Was in here ","useful":0,"cool":0},"ZuaH2HRAmhTazgl5OX4jig":{"text":"We picked this place via yelp simply because the photos of the food looked so good! Not on","useful":0,"cool":0},"RsDlpnmUJKN84xBV0oG7Bg":{"text":"This is a little food window in the back of a dive bar. I don't say that in a mean way, ju","useful":0,"cool":0},"N8dSEOVRGGWplX7rZhjH1g":{"text":"Food was absolutely fantastic. Some of the best we had in NoLa. Service was excellent and ","useful":1,"cool":1},"z1sxXVzINjHjCCvX9chvnw":{"text":"Great double pork (pulled and bacon) fries.  Cold beer, good selection at great prices.  W","useful":0,"cool":0},"dhkocx44qT-nj_I9WPIjyg":{"text":"Had the chicken strips and thy were fantastic!  Tender, juicy & flavorful!\nDef the place t","useful":1,"cool":0},"uNDHhuQVr8tnGvjGIMT2dg":{"text":"Fried chicken sandwich may be the best I ever had. Like always, it's the hole in the wall ","useful":1,"cool":1},"ErB03Hv-TnPMAuzi2cJemw":{"text":"Faubourg. Shall I say more?? \n\nThe southern chicken sandwich was everything I didn't know ","useful":1,"cool":0},"d_yFZucF-oDq1zkRLeeplg":{"text":"Visiting from Houston and found this little place. Parking was the only downfall but the f","useful":0,"cool":0},"73WwWGIKw2xBeeZ0ZxPrgg":{"text":"After a long day flying into NOLA in the 30 gazillion temperatures, and not being able to ","useful":0,"cool":0},"PrbzoR9qPTewXxTWnyVrrg":{"text":"It's a little hard to spot, but the food is amazing and very reasonably priced for the Fre","useful":0,"cool":0},"WuawiAfu9iKP3DIu8gArjg":{"text":"Good value mostly fried food. The piggy back fries were really tasty and large portions.","useful":0,"cool":0},"9rB1ZIZHc2gkL4WgtZL1Sw":{"text":"Their veggie burger is really good for vegetarians. It's small but dense and filling (it's","useful":0,"cool":0},"otHhNbwdCprsj6KQIyE1SA":{"text":"First night in NOLA, wanted a great experience and The reviews do this amazing place justi","useful":1,"cool":0},"w_fqAeItYnx-iCVanpO-vw":{"text":"This is the SPOT!!!!! I slipped away from the bachelorette party and left Bourbon Street i","useful":3,"cool":0},"WQqRUboUidgbrxNnKD_Cew":{"text":"Food is very good and comes out HOT! I had the fish and chips and it was tasty and crunchy","useful":0,"cool":0},"o_MXUFKRyY6Poa72JM6Aig":{"text":"This place is a gem! It's located INSIDE a bar called the 700 Club at the back of the bar,","useful":0,"cool":0},"-gbHQwqo9KKFjxnNidV-HA":{"text":"The food was just ok..ordered the Mac and cheese it was too cheesy and not in a good way. ","useful":1,"cool":0},"ujaE7iUX1cfyBO1e8NxcxQ":{"text":"The place is hidden; it's actually inside a bar which I can't remember the name at this ti","useful":0,"cool":0},"o4nWbgmvfU92R2dTtLCL2Q":{"text":"Today was my wife and I first time here since we heard so much about this place; We were e","useful":0,"cool":0},"20yl_-zByZ0qK81Fkv04sQ":{"text":"A hidden gem behind the bar.  The catfish burger was delicious along with the brussel spro","useful":0,"cool":0},"pz0M2nvKdAYvWnO8TmNxTQ":{"text":"Delicious bar food and great service. Mac and cheese bites and loaded fries are the bomb.","useful":3,"cool":1},"MrmyJmGnbREJR3yW6YvFCg":{"text":"This hidden place a gem. Hidden in the back of a bar where you walk up, order and take a s","useful":1,"cool":0},"7vzAWeOdaY3WA90cbrx8sQ":{"text":"They always say, if you want good food eat where the locals eat. Surprisingly enough this ","useful":0,"cool":0},"H0y1vim66An-YlcR5o5HUQ":{"text":"It was a nice restaurant. At first when I walked in I thought it was a little sketchy. I t","useful":0,"cool":0},"9uM4FgNuMk4YdwNBqaSagA":{"text":"Damn that pizza Mac n cheese was phenomenal! It was delicious not too expensive with a lot","useful":0,"cool":0},"7s57TeXbCNEc0BoIcZL_pw":{"text":"Stopped in here on our first night in New Orleans for a bite to eat.   So glad we did.  \n\n","useful":4,"cool":2},"JP5YksOk5y38gJ16tQ8uHw":{"text":"The Catfish Sandwich and slaw are every bit as good as the rest of the reviews say. This p","useful":0,"cool":0},"GazJM38dVBkefTyG80C9iw":{"text":"Amazing bar food creations. Huge servings and so affordable. Must stop if you're in New Or","useful":1,"cool":0},"xXiq3ex5zOO81cUessgtyw":{"text":"Delicious little place at the back of a bar. The chicken sandwich was delicious as were th","useful":0,"cool":0},"mFrtkxnWS-0hZ2_37feaUA":{"text":"So when people say \"hole in the wall\" this is exactly the type of place they are talking a","useful":3,"cool":1},"J1y8i5FSU4zKQPHJqVicQQ":{"text":"The absolute best chicken sandwich I've ever had! And super fast (and cheap) delivery!  20","useful":0,"cool":0},"McC_u6RuI_aWA0d6k18h-w":{"text":"I LOVE this place. It's not easy for me to find a place in a new city and deem it \"my favo","useful":5,"cool":0},"njfRyjjukgDn9HXCGnZryg":{"text":"This restaurant is exactly why I use Yelp. Some of the best food we had in the French Quar","useful":0,"cool":0},"wWeCNHA-bAvge0Ii7HzkOw":{"text":"Place kinda looks like a hole in the wall but the burger was slamming! The bread was next ","useful":0,"cool":0},"8F3z4Wzw3eVd-Vqw6jqutw":{"text":"Best chicken sandwich I've ever had. Piggyback fries are amazing. My wife loved the catfis","useful":0,"cool":0},"a-5gOvJQxKMyCK4pQbP6_g":{"text":"Set up a tent outside, and don't eat anywhere else in New Orleans. Seriously the best chic","useful":0,"cool":0},"MQFiseazRGOEwPasF6GPFQ":{"text":"The food was amazing and quick. The restaurant was a little hard to find since it is in th","useful":0,"cool":0},"VguoQJS737SDZ2ql6_SxXA":{"text":"The food here is amazing. We came in and tried many different options to include the pizza","useful":0,"cool":0},"wJuylJVltWklsne8IHfc3w":{"text":"This place is awesome! We stopped in late night to grab some food after reading all the re","useful":0,"cool":0},"m96QNNF-wpoHNkuzXfeBuw":{"text":"Love this place. The chicken fingers are just what the doctor ordered after a night of dri","useful":0,"cool":0},"5POp0WSTBXcBnSMWq4TzpA":{"text":"This place is simply grubbin!! Catfish Sammich is the bomb!! Hidden in the back so don't s","useful":0,"cool":0},"JxdxyHl1J8Uh3MLyA2Mh6Q":{"text":"Great mac and cheese and sandwiches! I love that the burger comes on a pretzel bun and tha","useful":2,"cool":2},"o2qiUbtS5IyCyh5L4EliOw":{"text":"Hidden jewel...the food here is worth the walk...catfish sandwich and pizza Mac are unbeli","useful":0,"cool":0},"WWA5fcV7PraBfIyqDUZzsA":{"text":"Great chicken sandwich! I ordered online and it was ready for pick up right away. And it w","useful":0,"cool":0},"-U8TewCDhwvoH0mMp7qybw":{"text":"Awesome bar and chill restaurant. We got the loaded fries, chicken sandwich, and fish and ","useful":2,"cool":0},"a-ATp5AX6RmyKFkgcTElHw":{"text":"Excelent Food and Service from both the Bistro and 700 Club... Server and Bartender were s","useful":0,"cool":0},"qrR3bRTGB37bgEH53hgnhA":{"text":"Had late night burgers here. My friends said it's one of the best veg burger they had and ","useful":0,"cool":0},"0jm1OHdn0aI5n0JflihlXA":{"text":"One of the best Mac and cheese I have had in my life.  This place is inside a bar. But the","useful":1,"cool":0},"fO8NGr_KTPrOyCuXIK0n7Q":{"text":"The Faubourg Bistro sit in the rear of the 600 Club. Its a very popular bar on the north w","useful":1,"cool":0},"u3_ALyHrl3ZMXZ3_ewgDFA":{"text":"I just started on their mac n cheese bites. I'll update my review after I eat more but the","useful":0,"cool":0},"fw9ADWoP7IFQZqdjg-LezA":{"text":"It's always a plus when it's late and you can still get some amazing food. I found this pl","useful":2,"cool":0},"OEQGxlwxHNpgqMqvM02LOQ":{"text":"My boyfriend and I tried this place last night and loved it! We both order the Southern ch","useful":1,"cool":1},"P8SeYNkQKKwz1muE9Ks-ug":{"text":"Mac and cheese bites were amazing!!!!!!!!! So happy we found this place---the vibe is exce","useful":0,"cool":0},"nZ6tNVFblr-_XQcBpH5UIA":{"text":"For the first time ever, I've purposefully stopped eating so I can savor my meal later! Th","useful":3,"cool":1},"QT06d9n2wQUokD9w0sBfyw":{"text":"This place is really cool. Great cozy vibe, well decorated. It is a little off the beaten ","useful":0,"cool":0},"TtTSpRS9hyWWqBsATk_J_Q":{"text":"Best veggie burger and mac and cheese I have ever had! I'm a picky eater so this says a lo","useful":1,"cool":0},"pcVDqMODo9TlDBnF7jBheQ":{"text":"Absolutely great. The Piggyback fries are Hugeeee, way too much for even 6 people. but the","useful":0,"cool":0},"uv9L0yluMn0zywf8qynwZg":{"text":"It took over an hour for us to get a plate of mac n cheese. They completely confused all o","useful":1,"cool":0},"jfTz1vt-31OpgGfDmYh_vQ":{"text":"The staff was super friendly, atmosphere extremely mellow, and the food was both amazing a","useful":1,"cool":0},"pTBFb8wePAbnCn5NTbBd7g":{"text":"Absolutely terrible, I used to love this place ... did they get a new kitchen manager?... ","useful":0,"cool":0},"6cQUFUST0mHTjEIXp2_xkQ":{"text":"Catfish sand which is legit and no I'm not drunk. No one spoke of Brussels sprouts and now","useful":1,"cool":1},"Ti0OkR2WoN7IPHa0Qi-RhQ":{"text":"This is a hidden gem! Thank you, Yelpers, for helping us find this place for lunch. If my ","useful":1,"cool":1},"SwVXy2AKjMGRBV5pZK6Nxw":{"text":"The food was sooooo good. Ordered pickup. It was hard to find tho it's in the very back of","useful":0,"cool":0},"ZC87qoYu8QCr_vIv9SOdGA":{"text":"Dude this mac and cheese is the best we've had everrrrrr. We also had the mac and cheese b","useful":1,"cool":0},"-2oOkmufk0JtKINPlsJUIg":{"text":"Great for a quick bite when you are in a hurry and dont want to compromise on food quality","useful":0,"cool":0},"GCJm60FPkIMz24CoElgEkQ":{"text":"More like a 3-1/2, but I'm on vacation... Great little hole in the wall! I went solo, late","useful":0,"cool":0},"52HOOQ1kwmasH68HP0c17w":{"text":"It's okay but nothing to go out of your way for. The pulled pork fries were good but the c","useful":0,"cool":0},"BOl1tR_FjHQ5KAfOmG0DXg":{"text":"Came in here off of yelp reviews and was definitely not disappointed. The scene was unexpe","useful":1,"cool":0},"igCXV7eVjZuvovwUgA_iwA":{"text":"BOMB.COM. DELICIOUS FOOD !! \n\nVisited today after walking Bourbon St.  the chicken sandwic","useful":1,"cool":1},"of-pKZiTGQi8DOe_ANHZyg":{"text":"Pulled pork fries are amazing, southern chicken sandwich was bomb...shots were more like d","useful":1,"cool":0},"a8_4zaGTH8HEJraL2zIcUw":{"text":"It's a little shop tucked into the corner of a bar, you'd honestly walk past it if you did","useful":0,"cool":0},"1YeLIw7o-cqLeMm3fD4GyA":{"text":"Chicken sandwich and 5 cheese mac were delicious and definitely will be a place we'll visi","useful":1,"cool":0},"24UNkUxVL3WNxqKleQeRcQ":{"text":"Everything about this place was amazing. The food, atmosphere, and the staff. Ryan was awe","useful":0,"cool":0},"30C9dJ2WvfFWo07F6fkqOw":{"text":"Very good Bistrot/ restaurant. Good hospitality.\nI took : \n1 Bistrot Burger\nFries \nFor 15$","useful":0,"cool":0},"lYqhzUVya2PC2XnQEYVGwQ":{"text":"Just starting our vacation and searched for a cafe that served some vegetarian food for my","useful":1,"cool":0},"Tlp-kJYzjrE1KvWOrHU3gg":{"text":"I've always loved the food that Faubourg Bistro has done at 700 Club. It's always been inv","useful":1,"cool":0},"WrLa7sgtN96YZZNFZxm5VA":{"text":"Delicious surprise in the back of a rad gay bar that has killer happy hour drinks. The che","useful":0,"cool":0},"nXr4p4QyfOmmFZrKSOsetQ":{"text":"Wasn't expecting it to be good.... but it \nWAS!!! Give it a shot... next to the other clos","useful":0,"cool":0},"kaFmYhFtOakXxS8k_DppUg":{"text":"Came in because were staying across the street and this place is a gem. \n\nService was quic","useful":2,"cool":0},"X9DvHkK5q6Em9-_j3mheOg":{"text":"Faubourg Bistro is as unassuming a place as you'll ever find. First of all, the sign on th","useful":1,"cool":0},"bWQlUQus-jAwuYOAaxUlGg":{"text":"Have to say that I ordered the fried cauliflower sandwich and it was the best sandwich I'v","useful":0,"cool":0},"WAuOKgF4FKVofhLtSPVuIQ":{"text":"Recently during a visit to New Orleans, I decided to try Faubourg Bistro. I'm truly glad I","useful":1,"cool":0},"u9N2M576_782-LESXY9lZw":{"text":"Had a hard time finding it due to its location in the back of the 700 club, but overall gr","useful":0,"cool":0},"gJNInGFakVRYlEFVVJZsUg":{"text":"super cute spot. Order at the window while listening to awesome music. \n\nThere are about f","useful":0,"cool":0},"Gdep5ajEUWm_YjFY4mhbKg":{"text":"We visited on a very quiet Thursday afternoon. Walked past it since we didn't know what we","useful":1,"cool":0},"2CG7I05nFO6cNcefiLSxYA":{"text":"Piggyback fries were amazing !! More than enough for 4 people to share . Southern Chicken ","useful":0,"cool":0},"RBLDTbhRvGWiFY9geUmOgQ":{"text":"Massive and delicious! The piggyback fries are enough for a small hungry family of bears. ","useful":3,"cool":2},"D7G6DDnMo2R8gGx-4qvyrA":{"text":"Food was really amazing! Blew every other restaurant out of the water!cute little place in","useful":0,"cool":0},"CRFTGfD4nLJb6aDa4Vq_kg":{"text":"Lunch with friends yesterday was excellent. Basically ordered 1 of everything off the menu","useful":0,"cool":0},"7IhYB5BknqCVBYKuwTsBMw":{"text":"Like other reviewers noted, it's in the back of the 700 bar. Cooks were all very personabl","useful":0,"cool":0},"vVv_eA7vdZYFt36OJGwsFw":{"text":"Took one bite and found a surprise. Paper that separates the cheese and burnt bun. Called ","useful":0,"cool":0},"vhL7N_Lb7kAEag92qwJR3A":{"text":"woweeee!!! i cannot believe how reasonably this place is priced. all i really have to say ","useful":0,"cool":0},"NAMIVbLQzpWEw4Z2MnPgaQ":{"text":"The food was so good here!! My brother's chicken sandwich was cooked to perfection and my ","useful":0,"cool":0},"O0CKbsynCOaNzWet103gyQ":{"text":"Hidden gym. At first I was thrown off my location and they only have four tables but man..","useful":2,"cool":0},"GbcpX2yCw79MdKXGYqvVUw":{"text":"Omg the fried mac and cheese balls are amazing. Roast beef and cheddar was great!! I'm so ","useful":0,"cool":0},"xy8XFXmfzBTgCrUJ9130Yg":{"text":"Really good burgers! The restaurant is located in 700 Club an is kind of small. But the fo","useful":0,"cool":0},"QyZ510A4nvYCk0rptk0TJA":{"text":"Tried the southern chicken and firecracker chicken sandwiches with fries and onion rings. ","useful":1,"cool":1},"ZujUo5cYnPbh7rEWd8T-OQ":{"text":"Numbers Numbers Numbers,\n\n\n\nCustomer Service: 5 out of 10...\nThe reason I give it a 5 out ","useful":0,"cool":0},"0dvadEMpA9GgGSO6cyLD7w":{"text":"This hidden gem is located in the back of a bar and is a MUST while in NOLA. I only loved ","useful":4,"cool":0},"KZ31hQeiKEifUTcw9bRCJA":{"text":"Hidden Gem!  \nLate night fish sandwich was a nice treat and pleasant surprise!  Yum-o!! Co","useful":0,"cool":0},"892VBdlqOycHcj9gwMNsrw":{"text":"Stopped in based on the Yelp and Google reviews, and I wasn't disappointed. Fried Catfish ","useful":1,"cool":0},"14QfVyxQjYpGVLkTOWujBQ":{"text":"This place is a hidden gem! Got a burger with all the fixins of a firecracker sandwich and","useful":0,"cool":0},"dNnuSYtuRXwt7d3rx4VbJw":{"text":"This is place is \"hiding\" in the 700 club - it's on fact the same place, which is a bit co","useful":0,"cool":0},"kproY0olUmxQSsBHbuvSsw":{"text":"Great find. My husband and I stopped in for lunch on a Tuesday around 12. You order at the","useful":1,"cool":1},"kaOp_DGVZTv3_VqZfYkrRw":{"text":"Excelente service, delicious food.  You order in the back. You can sit at the tables in th","useful":0,"cool":0},"tg3L-MW8ZktJQxPHNFvWbg":{"text":"Highly recommend the Mac & Cheese Bites and the Southern Chicken Sandwich! Great atmospher","useful":0,"cool":0},"EEu71mW35jMUquMZ9xE0_w":{"text":"I had to come again before i leave to San diego, their chicken sandwich is to die for!!! I","useful":0,"cool":0},"_5rx1FHb3ht_0UTrNYu41Q":{"text":"So amazingly unexpected. I've had some good bae  food  but this isn't what I would call ba","useful":0,"cool":0},"zdVEc0ZRK-SN7uMs78HV3w":{"text":"Ordered delivery through grub hub to our hotel room on vacation. Food was hot and good, an","useful":0,"cool":0},"TTKrnIVNuRwJbEa4mHX_Lg":{"text":"Absolutely great bar food. Way above average. High quality food in a pub setting.  You ord","useful":1,"cool":0},"tZsNPyPc6-ySxl4YHQP3ug":{"text":"FRIED food galore. We came and we did it big. Loaded fries + fish & chips + fried Mac and ","useful":1,"cool":1},"OzJgLOK740dX41nPvuH6og":{"text":"We left a ghost tour that was a total snooze fest and decided we wanted to find a restaura","useful":0,"cool":0},"ZZmkk_sT0XNsufHa-bQEsw":{"text":"I saw other reviews on Yelp and decided to come check it out. The Piggyback fries stood ou","useful":0,"cool":0},"G64WRf2S38PjPOBJG6P2gA":{"text":"We used Yelp delivery to give it a try. Hot, delicious and large portions. We ordered Mac ","useful":1,"cool":0},"FstCF1q45s3vlmGhImBxow":{"text":"After a full morning and afternoon on Bourbon Street, we were ready for some delicious foo","useful":2,"cool":1},"8pUYJlqFPNtei79mxCExUA":{"text":"We ordered the PBB&J wings, buffalo wings & the burger. The PBB&J wings weren't my jam, bu","useful":0,"cool":0},"ycMUH0zt3OmoH3TosfuLcg":{"text":"First off, I had no idea this was in a back of a bar (I don't read too good) and that bein","useful":1,"cool":0},"HAibQdvvMP3lhyFGCWH9Pg":{"text":"Awesome hole-in-the-wall place inside club 700. The food was delicious and reasonably pric","useful":0,"cool":0},"W5UKV_ghU5a-qfrZbPPH9Q":{"text":"A bit difficult to spot as it is inside of a pride bar. Once you're in, head towards the b","useful":1,"cool":0},"KWmgnmadE5sm8Jp0tln8RA":{"text":"I give it four stars my parter gives it three. Probably because it made me sick to my stom","useful":0,"cool":0},"_ZR-3XKndtOm5qlioX2YYQ":{"text":"The chicken sandwich that I ordered was not very tasty, the fries were very well done, and","useful":0,"cool":0},"e6ZcHUaQHL9xidNS_J_ghg":{"text":"Whole in the wall place. So delicious. I had the piggyback fries. This was big enough for ","useful":0,"cool":0},"EIamIQ1PX11fA_r9imL1HQ":{"text":"This place was shockingly good. It's the epitome of a hole in the wall...literally it's a ","useful":0,"cool":0},"b7gEDitMB3gBmzg0nD-Rng":{"text":"As someone who lives in NOLA and is in the French Quarter SO frequently for both work and ","useful":0,"cool":0},"csw_4ag66sSE5ys3Li094w":{"text":"Mac n cheese is spectacular!\n\nWhole in the wall type of place. You'll be glad you went off","useful":0,"cool":0},"vt64mHfCHOq2q9bgnC4aOA":{"text":"I'm so glad Yelp exists for places like these. You would never know that delicious, fresh ","useful":1,"cool":0},"vrK62P8TSJ5nBM5juhJWTA":{"text":"My husband and I found this through other Yelp reviews, and I wanted to pay it forward!\n\nI","useful":0,"cool":0},"ICJHFSAispNfDqSSwBbPQg":{"text":"It is located inside a bar I ordered the catfish sandwich and loaded potato fries ... They","useful":1,"cool":0},"YxyjkOdymHEZyGU_HKu9Hg":{"text":"Food was phenomenal. The simple things done well. Fries for days. Everybody is so nice too","useful":0,"cool":0},"BKgSzpGjBHfXXBysijil9Q":{"text":"Must get mac and cheese bites and loaded fries!  Oh my goodness they are phenomenal. This ","useful":0,"cool":0},"0I9K-GCe6def3RmqFG3eag":{"text":"Arrgh!  Treasure hunters be aware!  This place is truly a treasure in the French Quarter. ","useful":3,"cool":2},"uW4b0-K9jHF-_zN_3Em19w":{"text":"Completely found this place by accident. If asking Yelp for a recommendation is an acciden","useful":5,"cool":3},"G7W_3ZoQVB-cbTHwLcU6bg":{"text":"In a bar, which is awesome, best mac and cheese ever, burger was big and delicious, will r","useful":0,"cool":0},"TsH4EviHkNifFMDRF4yUNw":{"text":"If your looking for a late night snack or got the munchies this is the place to visit. The","useful":0,"cool":0},"zrgM9HXjJxwxjpchgtBOaA":{"text":"Got in on a late flight and didn't want to go out and look for something to eat.  This was","useful":0,"cool":0},"lC8uTT6-mBhBa9iSeEZu6A":{"text":"Great burger and Mac cheese. Arrived hot and delicious. Asked to hold my order while\nI'm a","useful":0,"cool":0},"NtK1l0DdNfgq6xBs7tu9Uw":{"text":"I was starving after a night on Bourbon Street.  They deliver until 2 am.  The Piggyback f","useful":2,"cool":1},"P5qllr114xo12ekdYpUFxw":{"text":"Amazing food. Got the pizza Mac and cheese and the grilled chicken sandwich. Fresh, delici","useful":0,"cool":0},"Cv_mGI08d7CZkQ6-qwQLKg":{"text":"Great day to break Keto! Stop in for a beer and a side of Pizza Mac & Cheese! Amazing is a","useful":0,"cool":0},"cDqKV30jH5PvP6zO-0LpEw":{"text":"Best damn pizza-macaroni on the planet.  Don't be fooled by it's hole-in-the-wall, back of","useful":0,"cool":0},"c8WdG7jxASFLAWEsj439cA":{"text":"Never heard of this place until I hit up Google for restaurant suggestions. They're locate","useful":0,"cool":0},"o2xBiOD6TSmZuyzf17otaQ":{"text":"What an amazing hidden gem! This place is tucked in the back of a bar and worth looking fo","useful":0,"cool":0},"ktsG_SBH6r2LFBzwpkr3MQ":{"text":"My husband and myself was looking for something fast to eat and ran across this Bistro and","useful":0,"cool":0},"xxzgNDvMZzLyr0pxz6qehg":{"text":"We chose this place because it was close to our Airbnb. Their location is inside the 700 c","useful":0,"cool":0},"Gx9VY6iD7oPtYbI8eDgXXA":{"text":"I've had this place bookmarked for forever, finally tried it today! OMG this place is aaaa","useful":0,"cool":0},"1JdlffbXB2scZxWW0Lmwqw":{"text":"This little hole in the wall it's a GEM!\nTook the food to go and ate it in my car! It was ","useful":0,"cool":0},"vItI7itHEW3PzFB3DZOowA":{"text":"We were looking for an inexpensive casual sit down place for lunch on a Saturday and we hi","useful":0,"cool":0},"AwWkEmkB22wP17zaDcUQkQ":{"text":"Ok, so a total dive. I concede this point. It appears to be tucked neatly in the back of a","useful":1,"cool":1},"FBifW3TbcTo_KLsP01UDqw":{"text":"OH MY GOD. The absolute BEST food I've had in the longest time. Every single bit of my chi","useful":1,"cool":0},"rlbr7TB-wT9hzDKKxbwj-w":{"text":"Just ordered the burger from Postmates and omg it is huge !! The fried egg on top made it ","useful":0,"cool":0},"sMFGE_cxdKpDGdYuLEkyoQ":{"text":"Outstanding burger, nice people. In the back of a bar in a beautiful neighborhood. It was ","useful":0,"cool":0},"lzmCi8DLUTj6sPvUo1iP6g":{"text":"First time coming and definitely not the last. I had the piggyback fries! Literally enough","useful":0,"cool":0},"FpQmi-yKnewSUmBUNDxFLw":{"text":"Let me add to the multitudes who love this place. Tonight my lady and I traveled to New Or","useful":0,"cool":0},"YVTSNzlbA_PC7SD45p5q2g":{"text":"This place has the best pizza mac n Cheese. The dish looked exactly like the picture and t","useful":0,"cool":0},"31RezqIv1u38qSyzg3CG3Q":{"text":"Food here is so delicious. Vegetarian friendly too... I had the firecracker cauliflower sa","useful":0,"cool":0},"B85vtV-1HRltAVrW5faToA":{"text":"Weird little tucked away joint in the back of a bar! Super fun and feels like you stumbled","useful":0,"cool":0},"42qJdr-dFOvpI87HCLPKLg":{"text":"My girlfriend and I tried and failed to find this place one evening, but succeeded two day","useful":0,"cool":1},"pMYc5fooN1ymx4K7btNf-w":{"text":"I went to New Orleans a good.. maybe 2 years ago. This place is the only place I remember.","useful":1,"cool":0},"8lEPZ3pQe1NyiOqsfRWKPQ":{"text":"On recommendation from our concierge I ordered a burger for delivery, couldn't do the empl","useful":0,"cool":0},"UdE1awz7bXbGmez-Xk-1iw":{"text":"The food was amazing! Good place to grab a quick bite and reasonably priced. I got the chi","useful":0,"cool":0},"J7FXgbeyj71G06j2resfdQ":{"text":"First time here yesterday. The macaroni and cheese is awesome and so was the southern frie","useful":0,"cool":0},"mUw_9vOYor6rWJXun1vuRA":{"text":"Ordered for delivery and the food never showed up. Not so much a phone call or apology. Af","useful":0,"cool":0},"PjhiUUA2vp9zSH5odS5BPA":{"text":"Ordered food at 945 they said it would be an hour, its 1136 food just got here. Hope it's ","useful":0,"cool":0},"SQ_2Y3-888OABGY2-wwZOQ":{"text":"Attached to 700 club bar which is nice and has good options! The restaurant is a seat your","useful":0,"cool":0},"fh89ia-SE3E_dPDppUGqlw":{"text":"I randomly stumbled upon this place walking through the French quarter. Let me tell you, t","useful":1,"cool":0},"BjkMSmDVlpQsnyfnNge6Xg":{"text":"Meh..the roast beef sandwich was soaked with a bland sauce. They need Less bland sauce or ","useful":0,"cool":0},"5BlKXLi2r9o-swUKw8ck4Q":{"text":"Excellent burger and fried Mac & cheese!   Don't let walking thru the 700 club bar slow yo","useful":0,"cool":0},"ZJLykns1xYJG-OvgtZZaVQ":{"text":"Pleasantly surprised.  Wasn't expecting the flavors! Counter service in the back of the ba","useful":0,"cool":0},"z1gjWgblx07rsBUrhDX1Gg":{"text":"I heard the food is good and it was advertised to be opened late. However, when we got the","useful":0,"cool":0},"lNLA5KAMkuZZVcg5EQsK_A":{"text":"One of the best fried chicken sandwiches ever. The place is located inside the 700 club. S","useful":0,"cool":0},"EuFZPhHwF1xlslphqE5otA":{"text":"This place is pretty good the food is really nice. The best wings I ever had, the chili ch","useful":0,"cool":0},"nq-9pcxUW7i9Yn39Sm_fDA":{"text":"Do not skip this spot if you are in NOLA! The food was the best of our trip, hands down. T","useful":0,"cool":0},"ynwC9N8MY5l-HQkE83M2IQ":{"text":"Located in the back of the 700 club. We ordered the mac & cheese bites & the piggyback fri","useful":0,"cool":0},"dLw2cvwSvWux1ZD-rmTgNw":{"text":"This little bar is a must try when you're in the area! Staff was very fast with our orders","useful":1,"cool":0},"AAIKeLcOyfN8jQLxCGpalw":{"text":"Love this little hole in the wall!! The fried chicken sandwich is my absolute favorite! Yo","useful":1,"cool":1},"Y7o7DwRQgAUhopgbSbCR6w":{"text":"I came here after a night out with friends. We couldn't find the place at first because al","useful":0,"cool":0},"f9F5Dada2SEJIfsj-MMBAw":{"text":"My hubby and I ordered a catfish sandwich, fries and the Brussels sprouts with bacon. It w","useful":0,"cool":0},"hnjD3CDczRoPf9Jbjp-3vw":{"text":"Before arriving here on a holiday we had been to so many restaurants that were closing ear","useful":0,"cool":0},"cEJrlDZcokECMtBpRQWxYg":{"text":"It's a bit difficult to detail my experience at the Faubourg Bistro with just a number out","useful":0,"cool":0},"6EFG7STKsai2RNQ4Bo6G0g":{"text":"Small and hidden away! The food was delicious, fresh and made from scratch. The Mac and ch","useful":0,"cool":0},"RbQajfyIBMyS-ql2sHkGmQ":{"text":"This place was nothing short of amazing! My sister and I are in New Orleans for the first ","useful":1,"cool":1},"UkfFB_fPtgPdT2hNJNEQcg":{"text":"Okay, it was my first official meal on this trip to NOLA, and man it did not disappoint. A","useful":9,"cool":4},"Sa-BNiklf0u34PQes6WYFQ":{"text":"Pizza Mac and cheese was great! Super carby and unhealthy and exactly what you should be e","useful":0,"cool":0},"kt1zE-BQOqxBNwfCmQwByQ":{"text":"Food was so good!!! We ordered the southern fried chicken sandwich and bistro burger with ","useful":0,"cool":0},"ugeDGnZUm3HszgymuEhfIQ":{"text":"Great food!  We had the loaded fries, roast beef and Mac and cheese bites.  Fries were a p","useful":0,"cool":0},"mUD_fhqRpndNopgCB7ANHg":{"text":"Food Was Fantastic! Mac & Cheese Bites Are the Best!!! It's a Must Go!!! Customer Service ","useful":0,"cool":0},"LQX46QQTPWQQGi__chs1xw":{"text":"This little gem is hidden in the back of a bar. There are very few tables but it is worth ","useful":1,"cool":0},"YdI9yWPSHwVv6bqHOdJcjQ":{"text":"Loved my experience at Faubourg Bistro. Located in the back of a bar, it can be hard to sp","useful":0,"cool":0},"uk9Fv0qMVPJHgLuskM1H5A":{"text":"This place was great! You can find this place in the back of the 700 Club bar. I ate the c","useful":0,"cool":0},"rIEG59ibKMJTmTft06ogqg":{"text":"This is my favorite burger in the Quarter! The bun was toasted and buttery! The bacon was ","useful":0,"cool":0},"kuXbSKa4vmfCoiNl1RbNXA":{"text":"The hidden gem in the French quarter in the back of a cozy bar.... I highly recommend this","useful":0,"cool":0},"DwziAtIfeGwF9nhXK2CRww":{"text":"I ordered the southern chicken sandwich, and the pizza Mac. This place is in a cool locati","useful":0,"cool":0},"u_D8sz8p_OuMHkyBmCBqAw":{"text":"If your a bar that is 21 and over only SAY SO online!!\nDon't advertise as a bistro and mak","useful":3,"cool":2},"rPnz4HnEzfXywFQoiCYpbg":{"text":"Stupid ridiculous good food. I'm dying. I'm DEAD. if you need some cozy hangover food that","useful":3,"cool":3},"r67X2DKFWcOFjEo4Aph3Qw":{"text":"Holy crap, everything was so delish! I saw this place on Yelp and decided to check it out ","useful":0,"cool":0},"XY5Q_zNcRxuOyQdv7YCmrw":{"text":"We're from out of town and decide to order delivery based on reviews. We left very specifi","useful":0,"cool":0},"H2RLEouREbXJNzYElW-GPg":{"text":"- Nice staff \n- Bomb fries \n- Burger is probably the best I've had in New Orleans \n- Never","useful":0,"cool":0},"Y3cdGeKj9RXZRervedbjPw":{"text":"If you're hungry while out drinking this is the place! Pizza mac and cheese was amazing as","useful":0,"cool":0},"4ozSRl1WwZfizi0dqsX-Iw":{"text":"It's in the back of a bar, but the food is so damn good! The Mac and cheese is to die for ","useful":0,"cool":0},"tdwj5MZVHE_h4LtN9dThbQ":{"text":"Pizza Mac and cheese was to die for! This place has a fun ambiance and really great food, ","useful":0,"cool":0},"QUD6nc2hrHLgOKNlNKMSZQ":{"text":"We hit this place up twice while in New Orleans and tried a variety of dishes.   If you ar","useful":0,"cool":0},"uUsIuYGEQ_ktFHGTs18WuA":{"text":"Well, not sure what to say. My husband and I went today based on the Yelp reviews. Had the","useful":0,"cool":0},"lpE_I8X4_3lp1OObvxCoCA":{"text":"This is a cool lil dive bar! It's located in the back of an actual bar and you order at th","useful":0,"cool":0},"PqEmd1ulq-1mLoy6iN79BA":{"text":"OMG!!! This place was awesome! The moment you step inside you're greeted by friendly staff","useful":0,"cool":0},"r3juYCt93MWxy2YIyv62kw":{"text":"Came across this place after taking a cemetery tour. I yelped the nearest place with burge","useful":0,"cool":1},"uuaZDIyHa7idQoyx5pHVDA":{"text":"A super hole in the wall food joint in the back of a club. There's hardly any seating so b","useful":2,"cool":1},"EWUFhxm0YsDRtD5xNwsIDQ":{"text":"What an amazing find!!!! I got the Catfish sandwich and brussel sprouts. This was truly on","useful":0,"cool":0},"ipDrElhW3vXHQQ_O1_Dcqg":{"text":"Hard to find, but so awesome. INSIDE THE 700 club. Cauliflower dog was amazing. This is a ","useful":0,"cool":0},"RECmBvi8sqG6liCBYf3yVg":{"text":"Skip this little dive.  Our party of four waited a long time for our food and two of the d","useful":0,"cool":0},"6XiV5QeRVi5grAr3k3hg-w":{"text":"Amazing chicken sandwich, great burger and absolutely the very best BBQ wings.  It's a rea","useful":0,"cool":0},"DXI3mBuVwDVWkqxOFtaiIA":{"text":"I've never had a bad meal from here. It's fairly priced, and open late for when you're abo","useful":0,"cool":0},"HYqNPFRqWOoArMJ4x5paOw":{"text":"Amazing. Came here based on Yelp reviews and wanting something other than cajun. Cant say ","useful":1,"cool":1},"-7DzJt9_hVCUnYcPh9Ju2g":{"text":"Extremely delicious food!  I got the firecracker cauliflower sandwich with a side of mac a","useful":0,"cool":0},"Gezq8S-WgLiNJUWOI4a3Sg":{"text":"Food was amazing! Not to expensive and they have a bathroom and WIFI! \nDefinitely get Brus","useful":0,"cool":0},"0stdIG4Dv64pu_re-vKRmA":{"text":"Let me add to the multitudes who love this place. Tonight my lady and I traveled to New Or","useful":0,"cool":0},"DX6c-cZyjbbmpJmdx_qKZg":{"text":"Awesome food! Was in NOLA for a few days and our first night me and wifey we're looking fo","useful":0,"cool":0},"4tW3Bj5WDcfK4SJh4jskOw":{"text":"Faubourg Bistro has the best fries I have ever been blessed with devouring. They are crunc","useful":0,"cool":1},"pX9ZY_CYE-uZfzaeZ9p-QA":{"text":"Looking at the reviews of this place we really expected it to be excellent. It is in fact ","useful":1,"cool":0},"Og2vRph08GKfZrrtwfSidg":{"text":"The food was great, Bloody Mary was mediocre, and the dude taking our order at the window ","useful":0,"cool":0},"2xmbkG1ph-LiTSsJECmtgA":{"text":"Had the loaded fries, roast beef, and chicken sandwiches. Everything was off the chart!!! ","useful":0,"cool":0},"h7G7f_UOgzoVM-JWYJZ2eA":{"text":"My Wife and I are pretty picky eaters, and what I mean by that is neither one of us like a","useful":0,"cool":1},"NDbXHl8XxeEMSRRZPUQAzg":{"text":"A really cozy and laid back bar with a nice selection of beers on tap and full liquor awai","useful":0,"cool":0},"GvU42CpvzwRyEcgsIXYO5w":{"text":"The chicken sandwich and Mac n cheese was sooo delicious ! I forgot to take a picture ‍ th","useful":1,"cool":0},"Y02AHqket6k-5RzWlZhchg":{"text":"YAAAAASS. This place is a true gem tucked away in the back of a bar. It was one of our fav","useful":0,"cool":0},"g7p1duQLSPcyJYc2wHl1Bw":{"text":"I walked WAY out of my way to find this place because of the great reviews. I thought it w","useful":1,"cool":0},"WHpfe54DMMtEhO3IIQ9LuQ":{"text":"To access this restaurant, you need to walk through the 700 bar. Inside, you order through","useful":0,"cool":0},"9pIe1EQYcPmN4k5LAqRJVw":{"text":"If you're eating here make sure to bring your appetite or at least 4 friends! The piggybac","useful":0,"cool":0},"v-qucqarUnSerApBgmj3kA":{"text":"Probably my favorite meal so far in New Orleans! Hidden in the back of a bar, you would ex","useful":0,"cool":1},"UtvhKLxA0GCUnJv3-9Q2cw":{"text":"Our first night in NOLA we found Faubourg Bistro via yelp ad hand to check out their pizza","useful":4,"cool":2},"LHTRmuI0tNGiYui3SaspMQ":{"text":"This was amazing. Just loved Michael he was super knowledgable and attentive. The food was","useful":0,"cool":0},"oIbeC5FdcaNnNOmoA6VXVA":{"text":"The chicken sandwich and Mac n cheese was sooo delicious ! I forgot to take a picture ‍ th","useful":0,"cool":0},"O8e0TpdDc3ptrgb5A58X2g":{"text":"Food here was absolutely incredible! I got the 5 cheese Mac and skillet and it far exceede","useful":0,"cool":0},"pJZRC3z_EBbYNl7zb9Ht8w":{"text":"I loved it because it was a gay bar. The bartender clearly was tired of tourists, because ","useful":0,"cool":0},"baO_BPSc-mB6OZBOcnjs-w":{"text":"Mr & I came to Faubourg twice on this NOLA visit.  Firstly b/c they were tasty but also b/","useful":6,"cool":6},"4ylTo1xf0QO_Lcy54L2tHg":{"text":"Came in at 12:45ish and ordered food at the back by the time we found a table in the front","useful":1,"cool":0},"ZdTBgKI_YkqXe2t6c6Hf_A":{"text":"No tables. We stood for 20 minutes and nobody acknowleged our existance. Nobody cared. So ","useful":0,"cool":0},"oHKXt5slJKe6ShekI4Qrdw":{"text":"It was excellent food, just what the doctor ordered.... nothing like a little Nola fair! \n","useful":0,"cool":0},"1ckQbXqSp5DVx0MKT7KXzw":{"text":"Delicious   \n\nI got the Piggyback Fries  \nAnd the Cauliflower Sandwich\n\nBoth were incredib","useful":3,"cool":2},"n1Az_aPQoB9AZc38305mIQ":{"text":"Came across this looking through yelp, MUST TRY it's so good! it's INSIDE the 700 club! th","useful":0,"cool":0},"DpHFmtXuxrVUC_FB3vJ2Ng":{"text":"Terrible... they said they were closing for the season soon and only had a few items. Orde","useful":0,"cool":0},"FARxx3ljRAbYl58YeZAACA":{"text":"Love!!  So good, we had the PB&J wings and five cheese Mac and cheese with bacon. I can't ","useful":1,"cool":0},"aEq1V31rSz2JzayW1QvrRg":{"text":"The firecracker cauliflower sandwich was great, very generous portion and what a fun spot ","useful":0,"cool":1},"W04QwVwgQ2dGY7SDMGUS5A":{"text":"Their Firecracker Cauliflower was absolutely delicious and a must!!!! If you would like a ","useful":0,"cool":0},"NeJqDamOFwtL6em1F95ulA":{"text":"First this place is really hard to find. You go to where it says for the address and can't","useful":0,"cool":2},"T5eAIrhyDbiTRWLWUFW6kw":{"text":"Ordered through Grubhub and it was an hour late. The food arrived and it was mediocre at b","useful":0,"cool":0},"5Fibfh4jMVYvoLxrT3BNZw":{"text":"Nice local type environment. Only tried the piggyback fries.  They were great. Ton of them","useful":0,"cool":0},"UKgQbnGiPWH7lOe3kYytgA":{"text":"Out of Towner, soon to be Nola resident.  Came here during French Quarter Fest to take a g","useful":3,"cool":0},"3xOsmzvtZj7dQ62Ngav1bw":{"text":"Been here a few times, definitely thought I was lost the first time. You can't go wrong wi","useful":1,"cool":1},"AXAkti9C_gSvhp90QC1Idw":{"text":"The mac and cheese skillet here is to die for! It was a bit loud but we went around 9. Mak","useful":0,"cool":0},"1C-FyROpKkTuREez89Aveg":{"text":"Really cool venue, the \"restaurant\" is located in the back. You've got to walk through the","useful":0,"cool":0},"pqoy50QRagdI0-NHk5kexw":{"text":"OMG!!! Did I just go to heaven and back?!? The food was amazing. We got the firecracker ca","useful":1,"cool":0},"_22WNDDip7qIBaDXL9GsSw":{"text":"The food was AMAZING! The only reason they did not get 5 starts is because I did not like ","useful":0,"cool":0},"X-RIcF_j5wUFI4QLp7a5cQ":{"text":"Excellent late night spot! Went here for a late dinner after a concert! Chicken sandwiches","useful":0,"cool":0},"JhhyigzvdHcG9rD_LkgkTw":{"text":"This place was off the beaten path a bit, and once you get there, it's helpful to know tha","useful":0,"cool":0},"2ZALgwJoQpMcYwFwHcr8aw":{"text":"Amazing food and nice atmosphere. Had the pizza Mac n cheese and chicken sandwich, truly h","useful":0,"cool":0},"mkYR7_TYrepNI__9QypVIw":{"text":"We hopped in a LYFT and headed out of the quarter to this place. The French fries are awes","useful":0,"cool":0},"7JDt6jLZp4Fep51yLyGCTw":{"text":"I got the loaded fries, and they were absolutely awesome. This place is definitely a hole ","useful":0,"cool":0},"h8dXjS76Ctgxy5-fHmEsXA":{"text":"Expected Better But Was Good\n\nTwo of us went here and ordered a bistro cheese burger, roas","useful":2,"cool":0},"-o2iGf-Jsemmura-2EmAcg":{"text":"BOMB!!! Hidden gem!!! Ordered the catfish sandwich, so good! Also had the brusselsprouts, ","useful":0,"cool":0},"y-CIcrb1pmf0s6fUL8i5-w":{"text":"Garlic fries and Mac and cheese bites had the worst chemically taste. Not much flavor asid","useful":1,"cool":0},"SzWOf7fVTejoPxW4CF1qFA":{"text":"Definitely exceeded my expectations for cheap \"bar\" food. The catfish sandwich was my favo","useful":0,"cool":0},"L7qitVGPPDbMY_xSFUd-Rw":{"text":"the food was very good! the restaurant is tiny and in the back of a bar but that's fine ju","useful":0,"cool":0},"BNMXav0Z8ekSwYYtTTSJrA":{"text":"This is a small hole in the wall in the back of a bar. Seriously, you're literally walking","useful":0,"cool":0},"HD8bhUeHjMHPkqNx6oHxLg":{"text":"I had the catfish sandwich and it was delicious! But the wings were disappointing. I was e","useful":0,"cool":0},"JRGcIwnAkAIrBPhCtinnAA":{"text":"The best damm Mac an Cheese An loaded fries great place good food only thing is that the s","useful":0,"cool":0},"JJ2_yBQpdTknbkzj9nM_bQ":{"text":"Awesome food! I got the pizza Mac and cheese dish and the cat fish sandwich. I honestly th","useful":0,"cool":0},"Oxa6s7iEiNvnF9OZtngTVQ":{"text":"This was hands down one of the best places to eat in the Quarter! I had a simple burger wi","useful":0,"cool":0},"4rQqcvq5ciZWT4P9wmMmgg":{"text":"Let me start by saying this place basically serves bar food.  It's literally in the rear r","useful":1,"cool":0},"E-a5agoQpfCoPqN0BlfWQw":{"text":"Wonderful meal with my wife.  I found this restaurant through Yelp search and we chose thi","useful":0,"cool":1},"5e98c5-Fy4mz6G5ksCDGOQ":{"text":"Located at the back of the 700 club, this looks like a fast food joint misplaced. We got a","useful":1,"cool":1},"edIGkFGEewdDq4OXR2TgEA":{"text":"First time eating here. Ordered a southern chicken sandwich and a side of mac. Best fried ","useful":0,"cool":0},"dwFPci3WaBMIIYt3f93Pew":{"text":"MUST ORDER: \nCatfish sandwich w/mac & cheese as your side.\nI couldn't find where to order ","useful":1,"cool":0},"ToguWLunswQKgllpAyehLA":{"text":"This really is a hidden gem! We were walking and looking for the restaurant and the guy at","useful":1,"cool":1},"tSPmZrnMy4LQKMm3H_f-Ug":{"text":"Ordered on Postmates with some coworkers. I absolutely love this place everyone was super ","useful":0,"cool":0},"yJ16Hc1spQIVE4b-N7A3CA":{"text":"Came here after doing some day drinking and definitely needing a good meal to help us reco","useful":0,"cool":0},"XihnFPEp3fSjHKy5iVPPeQ":{"text":"4 words that will change your life. MAC AND CHEESE BALLS. Also did the loaded fries, didn'","useful":0,"cool":0},"slKTlxcRmVAlTrSbh-GXIw":{"text":"Faubourg Bistro is located inside the 700 Club. It's a very lively place with a large scre","useful":0,"cool":0},"G_ZFz02uX7TqR5hneds7hw":{"text":"I've had take out from here before and it was so needed after a long night. In the back of","useful":5,"cool":3},"jbY6D_oziL-50gxR-mZpNg":{"text":"We've eaten so much food in NOLA and this place was so incredible!!! It was definitely mor","useful":0,"cool":0},"tZFLFVxQd5VFFtPe8IR32g":{"text":"Wonderful atmosphere! I was nervous at first because it seemed to be a gay bar and I was w","useful":0,"cool":0},"ZEB66bJ0bhppOaAuOtNORQ":{"text":"This place was AMAZING!! \n\nI know Nola is all about Po-boys and Cajun seafood but this is ","useful":1,"cool":0},"ilf-9EYYypV45hMsn3_9bg":{"text":"Mac N Cheese bites were sooo good. Crispy on the outside and cheese on the inside. I also ","useful":1,"cool":0},"0yaXdy0BdBhQ3-S-CTy2Og":{"text":"Got a to go order on Easter Day as the location was way too packed. We ordered the pizza m","useful":1,"cool":0},"R0ayvgUeE-rBu7dwdlxTbg":{"text":"Great food!!  The window to order the food is in the back of the 700 Club Bar.  So a littl","useful":2,"cool":0},"RXwWYiimtNxvcQ5luE_L0Q":{"text":"Some stars shine so bright, they burn out before their time. Miss you.\n\nWill like to know ","useful":0,"cool":1},"mBwkNsMw0zHKHCcJHM-1aw":{"text":"I'm in town for a conference and wanted to get away from the busyness of New Orleans. I di","useful":0,"cool":0},"jhVB8kUj9X_49FFI4yOXiw":{"text":"One of the best chicken sandwiches I've ever had, hands down. My wife had the fried catfis","useful":1,"cool":0},"M2LvEgcwefn7LIYfOc-pWQ":{"text":"This place was our go to while in New Orleans for the week. The chicken sandwich is big en","useful":0,"cool":1},"jHFZb2GW9zNzOdytKxu8eQ":{"text":"This place has the BEST food! The service is amazing and they always smile! Love it! It's ","useful":0,"cool":0},"hZjW75zSjchCkt6MV5gTVQ":{"text":"Really impressed with this little back bar kitchen! Their three page menu highlights uniqu","useful":4,"cool":3},"o2YVQh7a1mUFQNLURZq6Bw":{"text":"Extremely friendly service and fantastic food.  First food were trodden in New Orleans and","useful":0,"cool":0},"iEVXUq3XAErg_7sV5W2c3g":{"text":"Foubourg Bistro is in the back of the 700 Club which is a bit of a dive bar. Don't let tha","useful":1,"cool":0},"B63ZhzYoNE88VjDdWYDQQg":{"text":"tl;dr Out of this world bar food. By far the best meal we ate during our five day stint in","useful":9,"cool":6},"r0g4Ov5vU3yGXr2a7T1Bqw":{"text":"OMG....this was an unexpected surprise.  The ambiance is fun, electric and welcoming.  The","useful":0,"cool":0},"NgZjAJX64ZABrbxAFtl1dw":{"text":"Sorry to ruin your overall rating but I was not happy with our experience today. We (mysel","useful":1,"cool":0},"ve5wW74QsFF5KixuhQ3E4Q":{"text":"This place is awesome.   In the back of 700 Club.  Quick food.  Delicious, late night food","useful":0,"cool":1},"UrgrDOaXyZgYwYCwcY6LYg":{"text":"This food joint is nestled in the back of a bar and quite the hidden gem. Open until 2am a","useful":4,"cool":2},"9tqdQP10htXg2QVoZk9iPA":{"text":"The food was very good but the service was terrible. The cashier lady was extremely rude n","useful":0,"cool":0},"0kGNQQeLeJJE_wIqc1JkEA":{"text":"Very good food. It is definitely a hole in the wall kind of place. The pizza Mac and chees","useful":0,"cool":0},"2MWTMBPlAgmWzV3iMhubLA":{"text":"True definition of a hidden gem. We had trouble finding this place because it's in the bac","useful":1,"cool":0},"NXMCx5OXLfQTSlwTV0CyNA":{"text":"Just ordered the burger from Postmates and omg it is huge !! The fried egg on top made it ","useful":1,"cool":0},"NO6UY2F1d6qyf_Ezj4IEaQ":{"text":"This hole in the wall is good they got those peanut butter jelly wings! Which for me was a","useful":1,"cool":1},"L3wKrFUxcfhtahJg_t0wsg":{"text":"First of all, this Bistro is at the back of a bar called \"700 Club\", may be tough to figur","useful":0,"cool":0},"UsbjbcGNioq6X3jL_eWUyA":{"text":"This was a great dive spot. Food was delicious and inexpensive. I would highly recommend t","useful":0,"cool":0},"6nmJRJaEvqByrgfCecRy4Q":{"text":"I can not believe I have walked by this place as many times as I have. I'm not one for rev","useful":0,"cool":0},"LVVG_gi_l7QJ1u-9_krpSg":{"text":"We had food from here twice when we were in New Orleans last winter and it was fantastic. ","useful":1,"cool":0},"FARMTzd5auRteJ3_qhLZDQ":{"text":"Faubourg was surprisingly really good. I say surprising because this place was located in ","useful":1,"cool":0},"SEUuJH_q0EhUm5FgtX_Mvw":{"text":"Chicken sandwich was tasty. Bid piece of meat. Really like the macaroni bites. Friendly st","useful":0,"cool":0},"x6xmno8KEOufKx2dqwd48g":{"text":"Absolutely loved the food if this place. \nWhen I told people I was traveling to New Orlean","useful":0,"cool":0},"sl988cZixwsGOj_5P3YNUQ":{"text":"Everything we ordered were delicious!!!\n1. Mac'n cheese bites. Our friends ordered them an","useful":0,"cool":0},"h01l1E5Cc3Qqdh-URH5wKA":{"text":"This is a little hidden gem located inside a bar. Had the words \"Faubourg\" not been writte","useful":0,"cool":0},"chg0rG5gjKC5YGoCsQRuBQ":{"text":"Great bar food. We weren't expecting the type of crowd, but that's unexpected since we are","useful":0,"cool":0},"R14OAvju6pDq6PVbw0TWQA":{"text":"My family and I found this place on here. We were mesmerized by the pictures of the food s","useful":0,"cool":0},"swG72Yck_oUIsODMy4DOwA":{"text":"Summary (so you get the gist, if you wanna stop now): Delicious food and amazing atmospher","useful":2,"cool":1},"kpUInW6Ll11orABo8d0r7w":{"text":"We were in town for a business trip and wanted to get dinner somewhere in the city. Saw th","useful":0,"cool":0},"aZIJKTlzDpg9C-eM3m8OYQ":{"text":"The cauliflower sandwich was delicious. Boyfriend got the pb&j wings, different but yummy.","useful":1,"cool":0},"pGEoElHtSr8h6rfSGAzWyQ":{"text":"Order the Cheeseburger here. It was REALLY great.  We had a group and had seen good review","useful":0,"cool":0},"ZusXOBgoJhUKlWZjPPJMxQ":{"text":"OMG! Soooooo good. I'd take a picture of my food but it's all gone. Firecracker cauliflowe","useful":0,"cool":1},"RK1Hmk26vNbaKbIji8VRnw":{"text":"Amazing food. It's in the back of 700 club. So Google that to get there. We loved it some ","useful":1,"cool":1},"7zOK2KC6ftHzOj7siPyM9g":{"text":"Hole in the wall place that didn't disappoint. The food was fantastic! Loved the loaded fr","useful":0,"cool":1},"2Uk6yrcoAUkouGt8BH9ANw":{"text":"Unexpectedly came in here while looking for food in the area.  My bf found it and I was su","useful":1,"cool":0},"k8-70Hho-0ps7hQY_d3jyQ":{"text":"It was late.\nI was hungry. \nOpens Yelp app. \nHails an Uber.\nArrives to what can only be de","useful":2,"cool":3},"3rl6_yEzp2K9hLs-YgFudQ":{"text":"This place was cool. A little off the beaten (Bourbon) path, but still close enough to wal","useful":0,"cool":0},"RXxyiJlYkrh3pfYGLwn8Wg":{"text":"We should have known when every menu in the place was covered with grease and food scraps.","useful":0,"cool":0},"6-37SaJXu4m9ZhTJqKGhRw":{"text":"We ordered DoorDash from our hotel and I got the pizza Mac and cheese and oh my god it was","useful":0,"cool":0},"Y_qtw_QLexHqyDs0qpEqpw":{"text":"Alright so I'll be honest and say that my order was placed for \"to-go\" but even after a Ly","useful":26,"cool":15},"Iet_hQjorXGtRdLkiJfgaw":{"text":"I found this place on yelp.  It was a little hard to find because it's in the back of a ba","useful":1,"cool":1},"lWD2RWNLehOyTW1D_khECQ":{"text":"This place is fabulous. A hidden gem! We are planning on going back. We were so pleasantly","useful":0,"cool":0},"wfPOa7otdzKN__g51SQkXQ":{"text":"Kept it simple...fried cat fish sandwich & fries. Was amazing...cat fish was really well c","useful":0,"cool":0},"MhpFeku7yG7tKOToQn_NhQ":{"text":"Amazing!!! Best fried chicken ever!!!! Loved the Mac b cheese balls cole slaw was ok but t","useful":0,"cool":0},"eN9J4aW281PFTvPec3lOTg":{"text":"Almost cried the pizza Mac n cheese was to die for. If you want to experience a life chang","useful":0,"cool":0},"sxxXDzoQ8c1Y2I7pg8vx0Q":{"text":"This place was really chill. Cool vibe. My girlfriend I enjoyed ourselves. We will definit","useful":0,"cool":0},"mFeLgtZJdMoxz5OlZdTh4A":{"text":"So this restaurant is actually just four, very small tables at the back of a bar which mad","useful":2,"cool":1},"LEBvGcU834RsnKC7KQSaFA":{"text":"I can't stop thinking about how good the loaded fries were.","useful":0,"cool":0},"TZgS7RYNRAvbW-iBfRlIuw":{"text":"Awesome ... truly as good as it gets\n\nWe were lost, we were drunk, and we were hungry AF. ","useful":5,"cool":2},"c95WWmccUOmsJP_jrKsM8A":{"text":"Our flight landed in New Orleans at 12:15am. I frantically looked for late night food opti","useful":0,"cool":0},"SJ6DEtwQVmNt3h_wbNBNKQ":{"text":"So much better than just your typical bar food! It's located in back of the 700 club, a ga","useful":3,"cool":2},"yJpjZZ3hEVSpRoJ2DSW8sw":{"text":"No No you must not go... I have no idea how in this world this place got the rating ... th","useful":0,"cool":0},"E7LZnXLq0cB-O09R0fIomw":{"text":"Holy cow! This unique place is a diamond in the rough. Its food ranks along side the best ","useful":0,"cool":1},"Bo4cBler95ro8dsHQNFmKQ":{"text":"Omg so much cheese!! :)\nMake sure to order the macaroni cheese bites they're good with ran","useful":0,"cool":0},"2s_oWMJC89vN6AO5EpfZAw":{"text":"Good place for a quick lunch. Burger and Chicken Sandwich were good. We had no wait and ou","useful":0,"cool":0},"DLAF9nTEOJvla6BiHwgnJA":{"text":"The PB&J wings are surprisingly good and the Mac and Cheese bites are out of this world. E","useful":0,"cool":0},"Djlr0cga9l70fLdBlmMm4g":{"text":"Amazing bar and great environment! Everyone is so friendly and nice and the food is just o","useful":0,"cool":0},"ddZxuUAQcxm4t-mhnHMeOA":{"text":"Bartender was very nice. We sat and shared  a burger and fried Mac and cheese. Everything ","useful":0,"cool":0},"ScEM-ABGp8855Z0P0PD74g":{"text":"Beef and cheddar was out of this world. Like London broil and cheese on a brioche bun so g","useful":0,"cool":0},"U2lAtuH7C1Ma_DSKVw9KYA":{"text":"The wings ended up being the fav, the service was friendly and food came out hot, timely a","useful":0,"cool":0},"fARQXeTt6ZlccrCBHcGGqA":{"text":"O.m.g. Was here for a weekend trip and needed to find dinner last minute and ended up here","useful":0,"cool":0},"buZ7lZ4tzvRlUNDpc-7m9g":{"text":"The food is good! Very reasonable prices, and it's one of my go to \"sober up\" food stops. ","useful":0,"cool":0},"IDveVRg2vL59EU2Ch9ndvw":{"text":"Food was kinda shitty unless you're drunk then it probably taste good. We got the cheese f","useful":0,"cool":0},"vc2M-yqwMZrnyZQ9adpFww":{"text":"Was here over the summer, loved it. Great little fins in the back. At first I thought I wa","useful":0,"cool":0},"rjPH4XXPpheVSuJYMkdnYw":{"text":"Love  coming to get some good eats here. It's referenced as serving creative American fare","useful":5,"cool":3},"kSfQ165OM_n3tC07cvkZig":{"text":"We stopped in for dinner after a day of drinking on our first day in town, and this was ea","useful":1,"cool":0},"owTt6SsQhH-qbtoQvYzMbg":{"text":"This is where New Orleans hides their best french fries! Seriously the best damn french fr","useful":30,"cool":30},"YfG8ZKz314LCN1l8uK6SNw":{"text":"The southern chicken sandwich was the best I have ever had and the Mac and cheese bites we","useful":0,"cool":1},"UJZOy22OS3ihimPXxhnxBA":{"text":"It took my family and I about 25 minutes to find this place since we we were on a tour bus","useful":0,"cool":0},"yLlgDPdjmOi8QFeOccOafQ":{"text":"My friends and I found this place while looking for something to eat before heading to bou","useful":0,"cool":0},"6nf_eePV0geSipDWEEK_Zw":{"text":"food was good but service was with a smile & attitude... it was close to closing so it may","useful":0,"cool":0},"L8-HHaagmUcNDa7_PwRQoQ":{"text":"Amazing food! Eat here, doesn't matter what you order! The sandwiches are incredible and t","useful":1,"cool":0},"L6ghqtvnaopEJot2ZE7uvQ":{"text":"My family and I decided to come here based on the good reviews. We ordered a couple of cat","useful":0,"cool":0},"ai90MXmne2gxXJ1uqi4S-A":{"text":"Ok food, medium vibe... worth a visit but not spectacular. The pulled pork fries were craz","useful":0,"cool":0},"9UO2q1IEvVoKUzolDhWoEw":{"text":"Tasty food . It's close to my salon in the CBD so my clients and I order often. My favorit","useful":0,"cool":0},"l7XNz5sEjb5g9Dtu_9F7Zg":{"text":"Do not be confused by the photographs you see here on yelp. Perhaps at one time this was t","useful":0,"cool":0},"HcIlrrwrCUGDAsdG08O5Ow":{"text":"Me and my sister shared a fried cauliflower po boy and a pizza mac and cheese skillet. Bot","useful":3,"cool":0},"Q9e9BZbamye_U-BBTEJ9Rw":{"text":"Once we realized this was in the back of the 700 club we were pleasantly surprised.  The b","useful":0,"cool":0},"ZLCdluCMxOgElWpXPfT4pA":{"text":"Went here for lunch and really enjoyed all of the mac and cheese dishes. The food comes ou","useful":0,"cool":0},"oPReb7GeNAv9IKjc-qHnDg":{"text":"There I was again. A very familiar scene. I was drinking in the French Quarter late at nig","useful":3,"cool":1},"M-p79H4ZYHRAU7OPU78c7Q":{"text":"Our plane got in late and we were looking for something to eat around 10pm! We were pleasa","useful":4,"cool":0},"9ih3ciMChQnQ4xA_klNyHg":{"text":"Great service and staff. The food is so good. All the dressing s and sauces are made homem","useful":0,"cool":0},"ntKgnjiyCWphVwBG0OmQcw":{"text":"Nice little place you have to go to the back to place your order for food. It's a very cas","useful":1,"cool":1},"Ke1xH0BQV3vtQG1f24UUVA":{"text":"Based on the yelp reviews we decided to try this place. My brother however was not old eno","useful":0,"cool":0},"iQXPM8YF4NusuD8Z8qEgrA":{"text":"Love this place. True hole in the wall. In the back of the 700 Club so don't do what we di","useful":0,"cool":0},"5tfnG4hGcInsD-S__O_emQ":{"text":"We walked inside and it was empty! It is connected to a bar and the restaurant was located","useful":0,"cool":0},"PJCE736juZL2gEPHgwhUCw":{"text":"My wife and I have been to this establishment on several occasions. \nIt is located in the ","useful":0,"cool":1},"FBhKHdKYk6iA8YOaIOTIdg":{"text":"What can I say best Fucking loaded fries in the maringy. deal with it and wings are too ..","useful":0,"cool":0},"Coe-uByCu5ICHHlxt39NYA":{"text":"This is a small neighborhood tavern in the French Quarter. It doesn't look like much but t","useful":0,"cool":0},"J3rrPn1KoPt4QeJFimS6uw":{"text":"Don't be thrown off that it's a back kitchen in the 700- the service and the food are amaz","useful":1,"cool":1},"ilDWnsZd_XL6_tVYbJJ6ZQ":{"text":"This is one of the best restaurants I have ever been to. The food is outstanding!!!!!\nIt m","useful":0,"cool":0},"cj2DKseIE-4v7qhqo1Uc2g":{"text":"I got the fried catfish and fries. It was so salty I couldn't eat it. The French fries wer","useful":0,"cool":1},"OqUgC_5TT_0an3EGK9SUyw":{"text":"Delivered an amazingly good fried chicken sandwich and onion rings to our hotel. One of th","useful":0,"cool":0},"OlZWU7v3FIwSLhM7y1NXAQ":{"text":"This review needs some major updates but please take a look at my original review to get t","useful":20,"cool":12},"LQrzFVUrXjzC8C8F7Ff6zA":{"text":"I can't even. You guys. Seriously go. This place was so frickin good. SO GOOD! \n\nSo, I am ","useful":0,"cool":0},"byY2YMw7OraqCti_XeqsCA":{"text":"I got the BBQ pork ranch fires which I liked and you could split it with 4-6 people no pro","useful":0,"cool":0},"EjRnEHglC0p6fifHVE9qLA":{"text":"The place is located behidethe bar area. So when you walk in the first thing you will see ","useful":0,"cool":0},"nSnAOyNaxpZWovg2q31apw":{"text":"Had to check this place out since it got so many good reviews. Hidden in the back of a bar","useful":0,"cool":1},"-RVJN8U6Fgf4pIqQUd40bg":{"text":"This bistro is located inside of a bar in the French quarter.  The bar itself is LBGT frie","useful":1,"cool":1},"duFo0R3Aizn6ZuLwjc2xYw":{"text":"WOW! Love this hidden jewel! Although at first, you'll get confused of the location, but i","useful":4,"cool":1},"DfVYAMm739x4twM7WyzNfQ":{"text":"Oh, I'm coming here every time I'm in NOLA now... Drinks were amazing food was shockingly ","useful":0,"cool":1},"px_JSaHLu1frEgMTBUuQgw":{"text":"Full disclosure: I was completely sober when we went. \n\nAs others have said it's in the ba","useful":1,"cool":0},"VxyXIM3v85K0gx8BKr6CoA":{"text":"Crazy little place in the back of a bar.  Would be nearly impossible to find if you did no","useful":1,"cool":0},"4EZH7tM9ZZI3hOh_l2yDnw":{"text":"Walked in and we were kinda ignored for a few minutes until they noticed we had two young ","useful":0,"cool":0},"cXSCBcAA-urt4AvuPdG_vA":{"text":"Ok, listen. AMAZING! The Pizza Mac & Cheese skillet is DELICIOUS! It really was one of my ","useful":1,"cool":1},"oonmspkUQcdSLUiKCqvogA":{"text":"I wish there was  a button for no review or a just a minus review. Never in my life I have","useful":0,"cool":0},"w48P8pwt-G7XDrDFmYs9PQ":{"text":"Friendly owner?  Check.\n\nHot, fresh food?  Double check.\n\nGood value?  Triple check.\n\nLook","useful":0,"cool":1},"3-pK3clNIstniQCupCPqvw":{"text":"Somehow my girlfriend and I ended up here on our first night in New Orleans. We saw the ex","useful":4,"cool":1},"kfwaDJMKKz62fBKaR75bFQ":{"text":"For a hole in the wall this place is great! Service is extremely quick. We stopped by here","useful":0,"cool":0},"WGnYwjpmVe6d_i7lnwPIKQ":{"text":"Happy we found this spot! So friendly! \nAnd the Pizza Mac N Cheese was everything! Only gr","useful":2,"cool":0},"z3BlJRABzGFvmNIIYbSFCA":{"text":"I was kind of thrown off by this place being inside of a bar, it was kind of hot in stuffy","useful":0,"cool":0},"zOQFLUVEF8X4mxb7YeBUyQ":{"text":"Yum! This is definitely not a typical tourist spot as when my friends dad came to join us ","useful":3,"cool":1},"Bh3dEEuqfzP0j3cU3MG1Ew":{"text":"One of the few places still serving great food after 1am, offer takeout and free bike deli","useful":3,"cool":0},"9KDWHWxrPLrSOaVy_T8BQA":{"text":"Found this late night spot on Yelp after using some filters, most of the restaurants on a ","useful":3,"cool":5},"A1diz2wCpCp-P9D_MCHr0A":{"text":"I wish I would have taken photos of our food, but as soon as we received our delicious pre","useful":2,"cool":1},"H0HItxt9GpQL64QJYIaQeA":{"text":"No frills, but a good burger. Beware this is not a standard alone place & is in the back o","useful":0,"cool":0},"o9VT8c4fbTS3470pEuS0ew":{"text":"A little ways from Bourbon but still close enough to all the fun. Like many yelpers we tri","useful":2,"cool":0},"eeSgFGMrQHFW9R7sbKEkRg":{"text":"After running around New Orleans all day and all night we needed something to satisfy our ","useful":16,"cool":16},"FhfyGtV26yptJmPLva2zMA":{"text":"Has some of the best bar food that I have ever eaten. Even the veggie sliders are deliciou","useful":1,"cool":0},"AM4EIew5ecLLwrV_VeekZw":{"text":"Delicious southern gastrofood. \n\nOur first meal in NOLA! This is a little kitchen at the b","useful":1,"cool":1},"bwECmIicg0YaCmrInqIMug":{"text":"Get the Mac N Cheese! I try Mac & cheese everywhere it's on the menu - this is the closest","useful":5,"cool":2},"44o3jlpviT6elximPrp9LQ":{"text":"I was looking for a local place inside of a tourist trap. This place is definitely that. I","useful":0,"cool":0},"TR2iEAqv5zaRAXJn7ejFiA":{"text":"I found the Faubourg Bistro on Yelp. My friends and I went here for lunch on a Sunday afte","useful":15,"cool":15},"ULLX-jzmb5TheSMU1RhaQw":{"text":"Stumbled upon this place via yelp, but when i say stumbled upon, i mean TRULY! In the back","useful":2,"cool":0},"BoDCHhdBxfSOYmKJt8cJxg":{"text":"The burger was pretty lame. It had chunks of cartilage in it. Fries where sold separately.","useful":0,"cool":0},"T5TDfslVdzWFvgieR5HCrA":{"text":"My partner and I we're looking to get something to eat outside of bourbon street. Like the","useful":0,"cool":0},"hY0oIqBa6OUMugIE7-phdg":{"text":"All I can say is, Piggyback fries are probably one of the most ridiculously delicious thin","useful":0,"cool":0},"UcRVomevXz7E3y_XxWPNhg":{"text":"This is a hidden gem. It is inside and at the back of a bar which made it a little confusi","useful":1,"cool":1},"IQPLBRXz0ZfZD5EIN2dXcA":{"text":"$20 LUNCH! ABOUT A 400% MARK-UP\nThat's way too expensive to include in my lunch rotation. ","useful":5,"cool":1},"ezdgw8u7KUlLnYcCBG4M0g":{"text":"This place does not have a sign outside, you have to enter through a bar and then you will","useful":1,"cool":0},"VxeMsJ5LeA5tUVVbRE3LvA":{"text":"Definitely above average bar food. \nWe ordered take out: bacon mac & cheese, piggy back fr","useful":1,"cool":0},"zeRvfi74UH1DMrxINHGb6g":{"text":"PBB&J Wings were everything I expected and more... Daughter loved Pizza Mac and Cheese...","useful":1,"cool":0},"_LtZPkQ4PnaabONfPyxg9g":{"text":"Don't walk by; it's in the back!!! Surprised us; never would have dreamed they could put t","useful":0,"cool":0},"N_6w3-PexXte27i67Y7UKA":{"text":"This was one of the best meals I've had in New Orleans. I don't eat meat or seafood which ","useful":1,"cool":1},"9zA_Nj68j0y9X-og4qd1Og":{"text":"Although burger was good my complete delivery order was wrong no American cheese not dress","useful":1,"cool":1},"SXals2kZB3qAXScCPSWvZA":{"text":"This place is worth seeking out. We bookmarked it back at the hotel because of the mouth w","useful":4,"cool":1},"x3g8wrwHmXwInY_EqN31Bw":{"text":"We came in 8/20/18 w/a service dog and no problem !!!\n\nWife had man n cheese skillet to di","useful":0,"cool":0},"V_ZvzyQkTkkzLLllytFCZw":{"text":"i was so confused upon entering this place. we had no idea it was inside the back of a bar","useful":2,"cool":0},"aNy5b191bsaOy3a5U-qerg":{"text":"Amazing food. Wonderful service. In a neighborhood filled with little hidden places that i","useful":0,"cool":0},"opJhjNxnpT8VE7Ts_XIYuw":{"text":"PBB&J Wings were everything I expected and more... Daughter loved Pizza Mac and Cheese...","useful":0,"cool":0},"15hj9O9IO9P7H3KaymCoEw":{"text":"If you're looking for LIFE ALTERING food, this is the place for you.\n\nTourists, this place","useful":3,"cool":1},"eeqNdv4hxkgXxhX_cz-bBw":{"text":"Best burger I've ever had and I'm a burger snob. The place qualifies as a hole in the wall","useful":0,"cool":0},"qi5_u6c1t8VmwXxgdLAlMw":{"text":"Three stars may be a bit low, but we were disappointed based on the other reviews and the ","useful":0,"cool":0},"P9uCse3jp8AirPP4_d3gew":{"text":"Wife and I tried the Pizza Mac and Cheese and were not disappointed.  The PBB&J wings are ","useful":0,"cool":0},"CLVyAaWUnr53BsHhMIKhUw":{"text":"I can not believe I have walked by this place as many times as I have. I'm not one for rev","useful":0,"cool":0},"7rxGeXlvzBmtCU3EVakDmA":{"text":"No kids allowed and it doesn't say this anywhere I could find. Walked for 30 min because t","useful":2,"cool":0},"S_apoFgHC83d1qYto3RhOw":{"text":"My friends and I went here for lunch one day. We ordered a lot of food, and everything was","useful":1,"cool":0},"Ts-RYBjylqhfVW1aBfjKZg":{"text":"Families, be aware that you need to pass through the -- 700 Club NOLA (must be at least 18","useful":1,"cool":0},"W1M1m_GhgZcF4ypSIHNuiw":{"text":"I found this place in 2017 and forgot to post my review. I returned to NOLA this year and ","useful":2,"cool":0},"rcszZio3CG8XXN_iKYdgZw":{"text":"Weekend Getaway: NOLA - dinner\n\nFirst night in was freezing. 34° and dropping. Before head","useful":2,"cool":2},"PtCODHSz3Kfjv4yErFYI5w":{"text":"This is a gem of a yelp find. Who would've known this existed without it? In the back of a","useful":1,"cool":1},"dpV3LNlqHMzQpzUVHNwXQw":{"text":"Still great\n\nWow...this.place was great\nThe fries were seasoned great, the Caso made them ","useful":1,"cool":0},"kH3AbmWP_GlGoUpgcC36tg":{"text":"This is a gem of a yelp find. Who would've known this existed without it? In the back of a","useful":1,"cool":0},"tdAN0Dbq1Sm1bkPZkgFexg":{"text":"I've had this place bookmarked for forever, finally tried it today! OMG this place is aaaa","useful":1,"cool":1},"jbLO9INfpNQK-YGENIcBhA":{"text":"I wanted a place I could get a good chicken sandwich. I have to say Faubourg, yet VERY sma","useful":2,"cool":0},"6sFtJJzO9APaZdRsYWhqVg":{"text":"I've had this place bookmarked for forever, finally tried it today! OMG this place is aaaa","useful":1,"cool":0},"eji5Tz7zbl07S8H0x4N80Q":{"text":"They had me at pretzel bun!  I was torn between the burger and the fried chicken sandwich.","useful":1,"cool":1},"Dl7RlkB97XolkHVQB7D3tA":{"text":"Tucked back behind a bar- lies a yee small room to dine... and a walk-up window.\nDon't let","useful":3,"cool":1},"bLj3Oh2LZg9aUy4uTgFIBQ":{"text":"This place is a hole in the wall in the back of a bar. My friends and I ordered a variety ","useful":1,"cool":0},"vLxxu38xMMVMvqgDw0BJ2A":{"text":"Okay, I have to be honest. We had our phones out like complete losers using Google Maps wh","useful":6,"cool":2},"VO2wT6W26Ya5TQWla1xhwQ":{"text":"Note - this place is in the back of a dive bar. Don't arrive confused like we did. \n\nSadly","useful":2,"cool":0},"IGZGkHf5SYGJBurDELuPcg":{"text":"Located in the back of the 700 Club. Faubourg Bistro sells a series of great bar food item","useful":1,"cool":0},"X3TirIzQaVQvaTv96gg8wg":{"text":"We came here every night we were staying in New Orleans - how could you not?! It's open fo","useful":12,"cool":5},"jmH3A0m_2SvpFgr92pwaIw":{"text":"Tried the Mac & Pepperoni Pizza Bake (I'm sure that's not the correct name) and it was qui","useful":0,"cool":1},"0ij5IVhEDR9H0rDnaWB3Ng":{"text":"This place was recommended to me by my friend. I liked it a lot because it was fast casual","useful":1,"cool":0},"mBt9hjLZmCMk20agmhxmEw":{"text":"Hidden gem when you're down in the French quarter. Food was amazing, staff was friendly in","useful":3,"cool":0},"iScPDH31bo0fWjYvzGtLbw":{"text":"Bar ran by some great people and some amazing food. My boyfriend and I were visiting for a","useful":1,"cool":0},"ptE6OlUx-hY2wzF76tiECQ":{"text":"This restaurant was tucked in the back of the 700 Club but it was quite the find!  They ta","useful":1,"cool":1},"bsxb0wdu-4qS3grI7SbNpA":{"text":"Wow...this.place was great\nThe fries were seasoned great, the Caso made them even better\nT","useful":1,"cool":0},"K7oxzn5RhnDFT0nZSmZDig":{"text":"It's the epitome of a hole in the wall...literally it's like 6 tables and an order window ","useful":5,"cool":2}}