{"XHv_bAQk35EkwnSoJ5FnWQ":{"text":"The aquarium is in walking distance and it is very nice! The parakette house was too cute.","useful":0,"cool":0},"xhu8Xuz37u0y98f_kHrCvQ":{"text":"We had fun here, they are very military friendly and offer great military discounts on pic","useful":0,"cool":0},"5HSqQeevtC_gx7r0P5jG-w":{"text":"I love aquariums but this one was fairly disappointing. It's normally $22.50 for adults bu","useful":2,"cool":0},"Hwi81-7oqGh-Km_yB48RaA":{"text":"I like aquariums a lot, and usually try to visit the local one when I'm in a city.  I had ","useful":0,"cool":0},"NiGROy8PZrjTEkztspw_mg":{"text":"This place was kind of cool. Nothing too crazy. Its fun for kids, but not the coolest aqua","useful":0,"cool":0},"fL31P3J4YUbPbXS6Q44KNA":{"text":"In general I always enjoy going to aquariums. Something about them is so peaceful, except ","useful":5,"cool":4},"QNH-m7SObXTlOFZZhgDH_g":{"text":"It was EXTREMELY busy when we went that it was difficult with a stroller at some parts. Bu","useful":0,"cool":1},"5SEyeNPsg5jAdPrYd1vvzw":{"text":"Not bad... you'll spend a lot of your time trying to find the aquatic life if they are sma","useful":2,"cool":2},"NxvDu9XneNbiXLibBD-Wbg":{"text":"Overall, a nice experience.  There were plenty of exhibits to see!! I loved that we were a","useful":1,"cool":1},"nJaOVHqeVoy2xVIiesRZGg":{"text":"This is an excellent natural history museum! Kids and adults will learn plenty from an aft","useful":1,"cool":1},"CYDmRBk0AbkhOJkYVZIdgw":{"text":"Overall a disappointing experience. Very small aquarium with little organization. The entr","useful":0,"cool":0},"E1az7foUA5jkRi-mKskbNw":{"text":"We came to New Orleans for the first time in October, 2017 and decided to go to the aquari","useful":0,"cool":0},"vPPcQemnPEOE0CK8nCqvMQ":{"text":"I havent been here in years. Im going off of what I recall. We had a great time looking at","useful":0,"cool":0},"ZCqJtFYKpVu079yKpGy2vw":{"text":"A cute aquarium and worth a visit, particularly if you're doing the Audubon experience pas","useful":1,"cool":0},"iBC7wzwxMsAkmmDeqHpaaA":{"text":"Great place for the kiddos. Took my 18 month and 3 year old and they were able to be apart","useful":0,"cool":0},"Sadaq-zH1XrJgwfMieysrg":{"text":"This was such a FUN experience. I really appreciated the linear layout of the aquarium, as","useful":0,"cool":0},"V0M10RvMYqJXnZ2V3cngCQ":{"text":"This is about as good as an aquarium can get.   They have lots of different types of anima","useful":2,"cool":0},"WcCPaOayUiHJjpLJR6hGNQ":{"text":"This aquarium is slightly smaller than, but definitely rivals, the Baltimore Aquarium. It ","useful":0,"cool":0},"mJ5KQFN4aQ8X0QMesMTgbw":{"text":"Depressing. Only one otter per cage, which is horrible for social creatures. Exhibit were ","useful":0,"cool":0},"wdLy7juDoZmYtl4oDPKJng":{"text":"For a $30 per adult entrance fee, I expected a to see a lot more! I enjoyed seeing what I ","useful":0,"cool":0},"xB3aaAn_3VCllKns__rJPg":{"text":"This attraction absolutely lives up to its name: you're cast into different environments f","useful":0,"cool":0},"FnRrowUod0ck1t6zFZUtjA":{"text":"This aquarium is not that great. It is small. If you are going to have an underwater tunne","useful":2,"cool":0},"Bcs8lZSSUHeMewGICYYBog":{"text":"Made for a nice excursion for the kiddos.  Lots of reviews complain about the price and I ","useful":0,"cool":0},"eFRctTMfSoFqlWsgXm0eTQ":{"text":"Had a great time strolling around here. The sea horses exhibit was amazing. So many prego ","useful":0,"cool":1},"dzgjhUePsCoajC9BZNUVNQ":{"text":"This is a great activity on hot days. Exhibits change fairly regularly and there's always ","useful":0,"cool":1},"YH0zWwBnA7i495OZVAe-rg":{"text":"My daughter kept telling me this aquarium was boring and I kept  brushing off her opinion ","useful":3,"cool":0},"8_63dBbJm2IShuA3r3nczA":{"text":"If you like fish and ocean animals, this is the place for you! If you time it right, you c","useful":1,"cool":1},"Wq_2nIXqyMnSj0W-aZ4QDw":{"text":"Right off the back. Let me tell you. If you and your family plan on coming here over two o","useful":2,"cool":1},"Odiu-1NtqTG1E5b1O4RJ2w":{"text":"Nice place for the kiddos. Tons of different  exhibits. The Amazon Rainforest exhibit is r","useful":0,"cool":0},"iEZmyLXXgSy20OSwBHpcUA":{"text":"Was nice but was smaller than I expected. The pass that includes the insectarium, aquarium","useful":0,"cool":0},"dPsPy9hRdTa0cuHtnfvtiQ":{"text":"Love it. I think it is better than the one in San Antonio. The hostess for the shark tank ","useful":0,"cool":0},"S1GyqTPGeyNKEc6D3eNyWA":{"text":"Haven't been to the Aquarium of the Americas since before Katrina.. so I don't know how it","useful":0,"cool":0},"ijj-5_5WEtFBsOIYilqZ2w":{"text":"While keeping in mind that this aquarium is in New Orleans and I have indeed been spoiled ","useful":2,"cool":1},"eMOMmsLrhqU01ncxPc-jdg":{"text":"It's true that this aquarium isn't as big as the ones in Chicago or San Francisco...it's i","useful":3,"cool":1},"O9tZ8MUAksmrhHidx4xTaw":{"text":"This aquarium provides a great learning experience for both adults and kids, and it was de","useful":1,"cool":1},"sDBEYgMOurKG0L9Wowwy9w":{"text":"While in New Orleans add on your to do list to snorkel in the Audubon AquariumIn. What a w","useful":1,"cool":0},"clNw-_cYpUVniBCnhmT3_Q":{"text":"I love the aquarium! (we're members). The exhibits are great. I love the fish, sea horses,","useful":0,"cool":0},"zpGjQeJcdLnFoDRLCIaJbg":{"text":"Get the Audubon Experience combo ticket if you plan to go to more than one of the followin","useful":1,"cool":0},"nM6MEENkuQoCr_Y2lgS55Q":{"text":"One of the best aquariums I've ever been too!  Try to go on an \"off day\" because it can ge","useful":0,"cool":0},"Xr-9olkJ2o77dA67GbtpzQ":{"text":"We drove from mobile to New Orleans to go to the zoo and aquarium.We loved going to the aq","useful":0,"cool":0},"cHYLKGWW2TJLqJ3AprD3Ew":{"text":"Kinda small but still packs a punch in terms of diverse fauna. Really enjoyed the walk thr","useful":0,"cool":0},"Hh1VXSISFZGGU-saxEq4Iw":{"text":"What a great aquarium. But heed this tip:  You can wait in line for aquarium tickets, whic","useful":0,"cool":0},"l2F_hdfH0meMwcW7vqPoHA":{"text":"Love the displays...the beautiful fish...the sharks...rays.  Some displays could use a lit","useful":0,"cool":0},"66Kh-dIgCb7gxS2sGjNsMQ":{"text":"Last minute trip for my husband and myself and we had a blast. We purchase the Audubon Exp","useful":0,"cool":0},"37WVa8bw99krY8XjxxY0Aw":{"text":"I went in with moderate expectations; they did not even meet that. \n\nIt is certainly meant","useful":3,"cool":0},"wkJEh8dNCh4rwRGwTne7dw":{"text":"Je dois dire que j'ai été déçue par cet aquarium.\nEn payant 30$ l'entrée, je m'attendais à","useful":2,"cool":0},"dAKzjpmqgTnKPI1kJpDDGQ":{"text":"I brought my grandkids ages two and three to the aquarium this past weekend.  I personally","useful":4,"cool":0},"QXzhOjBhNt5-PK-Zotoyeg":{"text":"Worth the money! If you're coming as part of a spring break group - call them ahead of tim","useful":1,"cool":0},"rRVxmXCo0TU2lMr5akLEgg":{"text":"The seahorses and photo booth made this very expensive visit worth it. It's not the best a","useful":2,"cool":0},"tvP5aXFztgukomj-g6neyQ":{"text":"The aquarium itself is amazing, with more exhibits than some other aquariums in the southe","useful":0,"cool":0},"TdWT-Zdnvhcy_XmPyHCD-w":{"text":"This is a Nice family oriented must go to aquarium in NOLA. The lines are long but move ra","useful":0,"cool":0},"ocb7vfNON4zf8DZjlLbuGg":{"text":"Nice aquarium with interesting exhibits. Very crowded and swarming with kids. It was fille","useful":0,"cool":0},"33kzrdX15iooFaptZMcTeA":{"text":"A good rainy day activity for travelers and locals alike. The aquarium offers the usual sc","useful":3,"cool":1},"qxV-2wi8fS_uZWE0vV7QQw":{"text":"I love aquariums.  The New Orleans Aquarium is not as big or as flashy as some other aquar","useful":1,"cool":1},"oc7o17Y-LN88KtpCxpaz8w":{"text":"We had high hopes for the aquarium...our 3 year old loves zoos and aquariums so we made th","useful":1,"cool":0},"edk1bQsi1kgShsgZmALvow":{"text":"We enjoyed be aquarium and it was a nice way to get out of the heat. It's smaller than exp","useful":1,"cool":0},"bMrrETee1pA8WZV7u-Kv1g":{"text":"I took my mother yesterday cause we didn't have anything better to do. I wish we had just ","useful":1,"cool":1},"Mp0tKh-kAAnEoBf83cb_RA":{"text":"This is a very nice aquarium.  It is sectioned off into about six different exhibits conce","useful":1,"cool":1},"VHMB57LsdvOxydyuwopz7w":{"text":"I absolutely love this aquarium. It was a unique treat to spend an afternoon watching seah","useful":0,"cool":0},"swnZoBszdgxt8tfU56BXtQ":{"text":"Had a great time with my family, awesome atmosphere and our favorite parts were walking th","useful":0,"cool":1},"NODXXB7k2htN-ntJxghUcw":{"text":"The parakeet enclosure was awesome once the birds got hungry; and I don't think anyone got","useful":1,"cool":0},"_Ib39GRx_DRR-SUYutwVkg":{"text":"I love the Aquarium! Now a Audubon member I decided to put my membership to use on a Sunda","useful":0,"cool":0},"JLwi4hglz7X8JvElkRex5w":{"text":"This is a fairly small aquarium, and although kind of interesting, very overpriced for an ","useful":0,"cool":0},"ftC8LKtOm9amKoYNmY80Nw":{"text":"I'm a saltwater tank enthusiast and try to hit up aquariums in city's that have them. This","useful":0,"cool":0},"whymmSWHDErX3LYQM6J3OA":{"text":"For someone who loves aquariums. This was nothing special. For military discount it was a ","useful":0,"cool":0},"rAYaeAHIFXMOlMyYBm9FCw":{"text":"Really cool aquarium. I have been to many, and this is one of my new favorites. They have ","useful":1,"cool":0},"fQIVZ30d7AYHfGQs8H5Vig":{"text":"Bought our tickets on our mobile phones, and they didn't even look at them to let us in, j","useful":2,"cool":1},"h3GrLU3OvSIqn4LfwrakXQ":{"text":"Feel like I am cheating on my 1st aquarium love in Monterey, Ca. I liked this place better","useful":0,"cool":1},"WEUR6CvFm-AEluCQFZNxDw":{"text":"Great aquarium.  It is expensive and gets really packed to the point of being difficult to","useful":0,"cool":0},"Oj9-h9vMrPZMUqOzhWsGXg":{"text":"Not one of the most memorable aquariums that I have been to.  It's kind of expensive, cons","useful":1,"cool":0},"bEPqOX99hmQ5XYy7MIaS-w":{"text":"For what you get, it's pricey.  Coming from the Pacific Northwest,  I have seen more than ","useful":0,"cool":0},"EQIBaCuEamgS3s6MUNgllw":{"text":"This is a nice aquarium but I found it to be really small. The little one liked it but we ","useful":0,"cool":0},"vdJc95xHsyr4HfUKX0zIgA":{"text":"Another enjoyable trip to the aquarium. Some things haven't changed since I was a kid. Lov","useful":0,"cool":0},"XLLNvIRxHqV8p3pKZZ5dQg":{"text":"It was freezing cold outside. And this was a great option for the kids. The most unique an","useful":1,"cool":0},"hoC3KyDhbaLdKpsX-4KVuA":{"text":"Very nice aquarium. Gulf of Mexico tank is huge with lots of sharks. Pet the stingrays. Lo","useful":0,"cool":0},"fuPwYzFNpVQlWnaT7Lh3_Q":{"text":"This aquarium must really be seen as part of the package deal they try to sell you. It's e","useful":0,"cool":0},"cwZM9AyxgzMVXiirCEpVtA":{"text":"This is only for the Behind the scene Penguin experience. It was the best thing ever. Supe","useful":2,"cool":1},"S1wHw_-4c-gy81nXVQnkiA":{"text":"It seem overpriced, but the exhibits were nice. I wouldn't go back ,nothing unique. They d","useful":0,"cool":0},"BYBM5wU9rYpIgSCAmJdnjw":{"text":"DONT WASTE YOUR MONEY. I have been to the aquarium in Atlanta, Baltimore and now here. It ","useful":0,"cool":0},"z7UfpvvvGqWoTQMOm8xaHw":{"text":"A good way to spend an afternoon, especially if you have visitors in town.\n\nHere's a tip t","useful":1,"cool":1},"wAS9a3pqUsllGpGZObP45A":{"text":"My fiancée and I decided to visit the aquarium after hearing about it from a passenger on ","useful":0,"cool":0},"nHwUoVZiqB_LyikiJ_331A":{"text":"The penguins were nice and the rain forest was lush and pretty .  Liked seeing the white a","useful":0,"cool":0},"vp7ttbNofDLjFxD-3jEQSg":{"text":"A very good attraction to take toddlers and kids to, the Aquarium has lots of good exhibit","useful":0,"cool":0},"Vt4UxbWOVQIs1vSkSG3k9A":{"text":"It's the aquarium. The reason my review is so low for this is because it's really disappoi","useful":0,"cool":0},"MWdmf6KfbJCu9CXzieJJjg":{"text":"A very nice place . Staff is friendly and helpful. Located in a nice part of town. Only th","useful":0,"cool":0},"lRr5YLyvStu7iSy2Q01DDQ":{"text":"When there is a sudden typhoon on the day you were planning all outdoor activities....what","useful":2,"cool":2},"y2qouB68utYf1tjY-6nkEQ":{"text":"I just wasn't impressed. But then again, I'm comparing to the Baltimore Aquarium which see","useful":0,"cool":0},"gAAn94pw-OIekeN-84kQmQ":{"text":"I will start by giving some overall advice (as I have on all the Audubon Nature Institutes","useful":4,"cool":0},"qL7uYaNqi4DkC35kH0fUBg":{"text":"I loved the aquarium. We did the pass for 4 events (zoo, aquarium, insectarium, Entergy th","useful":0,"cool":0},"yYuxNhh6-CxqRk5IGY0aBw":{"text":"When you walk into the Audubon Aquarium, you're hit with some pretty cool exhibits.  My to","useful":0,"cool":0},"l5eUbe-jp_OPRndB1hNA5Q":{"text":"Visited during a weekday afternoon, so there were loud packs of school kids romping throug","useful":0,"cool":0},"UVvFSw2P_vNJEBi0NgqlvQ":{"text":"Beautiful aquarium that has always put an emphasis of the local costal eco system. The aqu","useful":0,"cool":0},"g6Y2r7pBFvLlIVEIEqpO_g":{"text":"The New Orleans Aquarium is small but all the exhibits are well constructed and thought re","useful":2,"cool":1},"5f8CqaaqomAYedI-B2EtEw":{"text":"This aquarium was nice, but in my opinion, nothing special.  It is very small, but the exh","useful":3,"cool":3},"Za-FurjfzJh9hMpBriW66g":{"text":"Pretty good sized aquarium. Some of the attractions are pretty cool. Parking sucks because","useful":2,"cool":1},"6PRgm8C70WGxv25RgoXcIA":{"text":"The exhibits are nice, but for ~$30/adult & $22/child the aquarium is extremely overpriced","useful":1,"cool":0},"Mbk4f_ZGoAcMgmQmATvWBw":{"text":"Great place to go to escape the New Orleans heat and see something educational and fun. Al","useful":4,"cool":1},"uCJ6ERJ3yryZpPvnXT2dxQ":{"text":"It seem overpriced, 53.00 with a coupon .but the exhibits were nice. I wouldn't go back ,n","useful":0,"cool":0},"y4GyDuwBbuvB2rrnHeS70Q":{"text":"To be perfectly honest I came here only because I found out they had a behind the scene pe","useful":0,"cool":1},"iDKN_RTqW0YnA7iZ2ZIMqA":{"text":"Small but it has nice things for families with kids. The option to buy multi tickets for t","useful":0,"cool":0},"qeHFeMtQTUZrcqhXbRJNog":{"text":"It's alright.  My child likes to watch the fish swim but I think they need more interactiv","useful":1,"cool":1},"iAGbwUptmQOfZW7bKCxHMQ":{"text":"Although we got mixed reviews of this aquarium, I thought it was one of the best I've ever","useful":1,"cool":0},"ZEeglwUQXrfSj672VJe3aA":{"text":"AH-MAZING!!!! I was really doubtful that any aquarium would measure up to Monterey Bay but","useful":1,"cool":1},"AmV5uCkmDl1rw5-UhEAUrg":{"text":"I coaxed my husband into taking part of the Backstage Penguin Pass with me on our honeymoo","useful":0,"cool":1},"__8XxkcCDdicKRQzKDdoLQ":{"text":"Meh... Screaming babies and kind of small. The penguins were looking a little psychotic ra","useful":0,"cool":0},"dpA7BqBiysiAUC8OHN8dAA":{"text":"I love the Aquarium. If you are interested in seeing the zoo, aquarium and the insectarium","useful":0,"cool":1},"IABJyu0wjNfitSROKzdLtA":{"text":"We could spend all day here!\n\nGreat family spot and tons of aquatic wildlife to see. You a","useful":0,"cool":0},"luRkTd36YwyAVm8S2HmKag":{"text":"I've been here several times, and every time I enjoy it. All of the sections are really we","useful":0,"cool":0},"0n73lrJd26xCLspqpPV_Rw":{"text":"Very much overpriced for what it is. Even with the $3 off coupon on the tourist map of the","useful":0,"cool":0},"_bB7yIG3wZXRCjZP_uPY_Q":{"text":"Fun place for my 2 yo. Crowded weekend but he had a blast! Great area to spend a whole day","useful":0,"cool":0},"mosfPW8hI4kLUACH1zeRTw":{"text":"This has always  been one of my favorite Aquariums. I was lucky enough to go on a Thursday","useful":0,"cool":0},"ArWq4rOty3kh3r9dc01_-Q":{"text":"We loved this place. Whoever claimed it was too small must frequent some enormous aquarium","useful":1,"cool":1},"kYDdChjHEuwvAKhUkjrZyw":{"text":"Reasonable aquarium, albeit a bit on the expensive side. I guess we are a little spoiled, ","useful":2,"cool":0},"kChhrfPJQZSMCZ7ic8eDKg":{"text":"What made me rate 3 stars was the simple fact that I was in a aquarium in New Orleans, LA ","useful":0,"cool":1},"51WtRWgMt6QrHNQv8pWArg":{"text":"The Aquarium of the Americas is a wonderful place to be indoors on a warm day but here's a","useful":6,"cool":1},"ck8x9kfSJ4Okj2fz0_UDlQ":{"text":"I am a true lover of any aquatics so this was a great day for me and the kid. The huge vie","useful":0,"cool":0},"IGZ9xL0Tyu_joYh0X1dTYA":{"text":"Another New Orleans classic, I can remember when this place first opened.\n\nI went to the A","useful":3,"cool":1},"oHLPL5WiXKxf-HI1KTT5Hg":{"text":"Awesome aquarium - the penguins and otters were my favorite! Maybe it's just because I'm u","useful":0,"cool":0},"zTy--yAYmPVUA6vT3cC3Dg":{"text":"This place was great in the 1990s when I was hungover and with a bunch of rowdy college st","useful":0,"cool":0},"ClPuNgx5lVNa5bXxTN14hQ":{"text":"It's been 10 years or more since I've been to the Aquarium, and unfortunately I was extrem","useful":0,"cool":0},"mKYPa_VgNsB4Ss0C3KzHdQ":{"text":"Of all the Audubon attractions, the aquarium is by far my favs.  Partly because it manages","useful":0,"cool":0},"oZKWnpQbOHzTObAIrKV8Xw":{"text":"As far as I can tell, the Audubon Aquarium is pretty standard as far as aquariums go.  The","useful":6,"cool":2},"nDcWmkXHlP0noeL2MeWcVg":{"text":"What an awesome aquarium! Great exhibits. This is a gem. Way larger than you'd think and f","useful":0,"cool":0},"cDPwVj5T1I3iRrgs_r7K3Q":{"text":"Great way to spend a couple hours when you're looking for a family friendly air conditione","useful":0,"cool":0},"esNKCe9ncFp2V_mOu1ZpmQ":{"text":"It the best aquarium in the country but a nice one to visit. They have penguins, otters, s","useful":0,"cool":0},"CzmxBNYIHIFdjzM_OdPVdQ":{"text":"Extremely well done.   We spent several hours there and throughly enjoyed it.   The exhibi","useful":0,"cool":0},"HMVN_aLkUNTJAdZY7Trapw":{"text":"Someone once said that you will never get a second chance to make a first impression. Tick","useful":2,"cool":2},"gs14ja5B7eUrUnOd4iVVLA":{"text":"This was an ok experience. Way overpriced for what we paid. They have some nice displays, ","useful":0,"cool":0},"ZnA3HBSeReEyaBB4rCqiAA":{"text":"Located in downtown, small aquarium that can easily be seen within 1-2 hours. \n\nMy husband","useful":7,"cool":3},"-TKsp_RKjmyBNCnPW3UztA":{"text":"Right at the end of Canal street and along the water.. Next to a vast lawn area and water ","useful":3,"cool":1},"F5om92Zh26b6QrX8SKmqAg":{"text":"Small aquarium that is showing its age; Think 90's saved by the bell. Was a nice way to sp","useful":0,"cool":0},"XEj72PXv1K87uSk0JAyEKQ":{"text":"This is an amazing aquarium! We almost passed it up, but it was definitely worth the cost!","useful":0,"cool":0},"IERcVvmH9dywMwDKBlqKaw":{"text":"Clean, fun and family friendly aquarium right off of the Mississippi River. River view fro","useful":0,"cool":0},"nK5yfxki223FJQa2GnI-jA":{"text":"I can't believe that no one has reviewed this place yet!  It is just incredible.  You ente","useful":1,"cool":0},"uq2A7j3ZdcyhNHIpRKaU8w":{"text":"Plenty of variety of exhibits to see. The only problem was when I was looking at them, the","useful":0,"cool":0},"Hzt_4jYnaxLyitSkfR2AGA":{"text":"Great collection of exotic large fish and other sea animals. There us penguin, seahorses, ","useful":0,"cool":0},"zzOI_UqUfLaE1i_i21qV4Q":{"text":"It is an amazing place.  None quite like it in the world.  It's not vast, but you can see ","useful":0,"cool":0},"6_GV3xPj7m8S6HG8yKLbwg":{"text":"The aquarium is nice , it is a bit overpriced, for what they have. I really like the one i","useful":0,"cool":0},"zMw4y0MEUGZARnfx2dteYw":{"text":"Great place to visit lots of animals the penguin and sea turtle were my absolute favorite.","useful":0,"cool":0},"I5FkoacjTuI5btSvAOWJSQ":{"text":"At first I felt like the price of admission was way too high. However, it's something real","useful":0,"cool":0},"Vu3lefes7Dv9v7lN3xuX8g":{"text":"The Package including the theater worthed it. \nWe spent a nice moment while it was raining","useful":0,"cool":0},"GCNn8pTbUM4_uHkx8_K3mg":{"text":"What a waste of money....want to see the parakeet pay $1.50 extra...want to see the otter ","useful":0,"cool":0},"RY2Xw7uP32YyGj7nNi9zVw":{"text":"Wasn't impressed. It was rainy in NOLA so I thought I would check this place out. Admissio","useful":0,"cool":0},"lBhqRjIvmNcgyQAv2y6ogA":{"text":"My family and I took the time to come here finally. It was a rainy day in NOLA and my preg","useful":1,"cool":0},"WktRFSoSr0ON0cIkMencYA":{"text":"Let me explain my 5 stars~ I don't care that the aquarium had empty tanks or displays that","useful":0,"cool":0},"Q9wlOiW39woKPmuepmjRGw":{"text":"Yeah....\nI mean the aquarium was nice and all BUT it was literally just sad. If that makes","useful":0,"cool":0},"RmgLinBJ03vBOQLNLtQXig":{"text":"I must admit, when the suggestion was brought up to hit the New Orleans aquarium, I hesita","useful":12,"cool":11},"bbX82OfODnxqW5ltVeGbfQ":{"text":"This is a fun aquarium, though its a bit small. Even so I had a lot of fun and enjoyed fee","useful":0,"cool":0},"zjf5m03gsEJMXPP73ah-1Q":{"text":"It was so fun!!!!!! The gift shop was a little over priced but it was very worth it. The s","useful":0,"cool":0},"ZvKKYe8KgRujzm5kGYcBiA":{"text":"For a dank, miserable horribly cold and wet rainy day, this place was the perfect refuge.\n","useful":0,"cool":1},"TOaYDBoQtY-2MS4Ik18Mag":{"text":"I loved it. It was a great activity for a rainy day! The exhibits were beautiful and they ","useful":1,"cool":0},"z8EXwDyyanzPlCI2AZmOXw":{"text":"This is a great way to beat the heat. We spent a couple of hours getting our $20 worth. My","useful":3,"cool":1},"4PrUQrYHRFwfra9pDTinRA":{"text":"It isn't the best aquarium I have ever been to and for the price if you have time for your","useful":0,"cool":0},"WIpy5deZ70cK6nZ-Co7s-A":{"text":"We came here to check out the new Mayan exhibit. As a member I am so annoyed with how memb","useful":0,"cool":0},"Mpp7weuP0Pp9aNsN4khAMw":{"text":"This is a must in the city of New Orleans. Great location down on the dock. We enjoyed the","useful":0,"cool":0},"SfSGA5Fwh_V5BCbjc5uYhA":{"text":"I had to update my review and give the aquarium 5 stars because I recently visited and was","useful":4,"cool":4},"CKOcp5f_YlHHBywh86OGZQ":{"text":"Loved the exhibits and especially the penguins! Thought it was well laid out and very clea","useful":0,"cool":0},"Xw1BoZEcQmYDz9rgvC_BIA":{"text":"We decided to come here since we were strolling around by the Mississippi River. The price","useful":19,"cool":19},"6JSRKWUIy5UEgJ-s8YsIfA":{"text":"While in New Orleans add snorkeling in the Audubon AquariumIn. What a wonderful experience","useful":0,"cool":0},"a_ATHJvoum8FiqESgb6USw":{"text":"\"When's it my turn?\nWouldn't I love, love to explore that world up above?\nOut of the sea\nW","useful":2,"cool":3},"KAgPLVfa8yOdPWCEwOln1Q":{"text":"I was very disappointed in this Aquarium.  I used to line live in New Orleans and went her","useful":0,"cool":0},"Vggs8Zg-mWVyu5uhFLPs-Q":{"text":"Fabulous swamp exhibit and the penguins are back.  The jelly fish & seahorse exhibits are ","useful":1,"cool":1},"7wtDxeUdcI5YVLy6X2y6IQ":{"text":"I've done countless Aquariums with my kids. This place is a decent size and has a good var","useful":0,"cool":0},"wjvHoJuqrgkzIThVJN9nEw":{"text":"I visit them all. Zoos, aquariums, botanical gardens. I am going to make it a life goal to","useful":2,"cool":0},"u-ioGdrAIMkgO2adoEizRw":{"text":"I highly recommend doing the VIP Backstage pass with the Penguins! You can register for it","useful":1,"cool":2},"czTJl_mcnySLX4I4gkfDgg":{"text":"I was pleasantly surprised by my trip to the Audubon Aquarium of the Americas. I thought t","useful":0,"cool":1},"htgSkmu47GSAtUnTk3oK5g":{"text":"My wife and I recently relocated to New Orleans from NYC. This past week, my 12 year old d","useful":0,"cool":0},"QPvrYj_6YNUQkX4XqgBVOg":{"text":"I am a fan of fish, so last night I decided I was going to go see some fish.  So this afte","useful":0,"cool":0},"MNFLxwCodXDi9kZgEKlapA":{"text":"Nice exhibits but for the price to get in it is extremely small, less than an hour to go t","useful":0,"cool":0},"Btyk1skQ07hbM3ADLpV_cA":{"text":"My kids love this magical place. You can view from sharks to alligators. When you're hungr","useful":0,"cool":0},"jwW15Ml3rKaDDQp03EbPrA":{"text":"I love aquariums, especially as a way to escape the NOLA humidity for a few hours. Well wo","useful":0,"cool":0},"VD9ZYEayEE4HH5Ijz0BmHA":{"text":"Pretty good size, price is a bit for me to make it a all the time spot to visit. Loved the","useful":0,"cool":0},"Ip5SZy6CNrhVfLHt8PuNVA":{"text":"Take a break from drunken revelry and go look at fish. They have some very cool fish at th","useful":1,"cool":1},"KmaByB51xyXCXOHvSrs2gg":{"text":"While the aquarium itself is on the smaller side (it doesn't look like it from the outside","useful":1,"cool":1},"CYoy1-M5cEUlaTbYDa-fnQ":{"text":"As someone who has been to many of America's great zoos and aquariums I had high hopes for","useful":1,"cool":1},"yaz_ywPGWQjQOLV_QDksXg":{"text":"Pretty small, especially for what they're charging. The rainforest part was fun and very w","useful":0,"cool":0},"UvPo23auppWyh2vvn2owWg":{"text":"Loved this aquarium!!! The employees were so nice and interactive with the kids. It was we","useful":0,"cool":0},"QUVWd5-ODZBYtJF59qzahw":{"text":"This is a good local attraction and for those who haven't visited an aquarium in a while. ","useful":0,"cool":0},"SySS4ih-2tsl3Dlhd21itQ":{"text":"It was a very nice aquarium with many kinds of different aquatic animals to look at rangin","useful":0,"cool":0},"RX-Sb4jUj8euzu7MWpD2gg":{"text":"I enjoyed my visit here. There are amazing fish and penguins and jelly fish. If you've nev","useful":0,"cool":0},"MO42HAonMvVefIV-GMQcWw":{"text":"we really had a great time! its a fantastic place to take your kids. there was so much to ","useful":1,"cool":0},"3vgEY6Fso2QjaZ2iu9w3QA":{"text":"I LOVE THIS AQUARIUM!\n\nSeriously. I won't shut up about how awesome it is. I fell in love ","useful":0,"cool":1},"tA17LQoNX2vO5RS_3MYg5w":{"text":"I'm a supporter of the Audubon Nature Institue and that includes the Aquarium of the Ameri","useful":5,"cool":0},"RFuY18wLjzKWnFiKJTBIYg":{"text":"I loved the movie on The Coral Reef. That film was epic.","useful":0,"cool":0},"O9aCr4AK6Xjdeah874qGRQ":{"text":"Awesome aquarium! Kind of expensive admission, but worth it.  The sea otters are soooo ent","useful":0,"cool":0},"XK3fcMFt__EAUEk8ghJt0A":{"text":"Pretty good aquarium. I think we may be a little biased as we've visited both Shedd Aquari","useful":0,"cool":0},"XpTnZrtTaRjh83Vq5-LHPA":{"text":"I really love to go to this place on weekday afternoon when it's not busy and you can set ","useful":1,"cool":2},"PvZE9psMiozIFWd5m3xIAA":{"text":"Decent aquarium. I am usually very picky about aquariums but I did have a chance to apprec","useful":0,"cool":0},"7EyBL7HM9rTsQo4s1FMRsQ":{"text":"We loved this aquarium! Lots to do and learn for the kids. A bit pricey--bring a coupon. O","useful":0,"cool":0},"MvYCvfJhOnUvoATi1edPmQ":{"text":"We've been Audubon members for three years and its such a good deal to join/get the annual","useful":2,"cool":2},"rsKUI4QZGWEblbTOB-xo_w":{"text":"A very nice facility with something for all ages. My favorite exhibits were the penguins a","useful":0,"cool":0},"buPM6RixpuaatMIyryn0tA":{"text":"We bought the Audubon Experience, so I have to go see this aquarium.  We are members of th","useful":0,"cool":0},"R9b5OPwugh1DjUaktcDRag":{"text":"Pretty good. Nice layout. Good educational displays.\n\nHowever, the otters did not have eno","useful":0,"cool":0},"fX6isSFvQrjr4nhfX8AjYg":{"text":"I love aquarium's so was excited when my friend suggested we check it out. As other review","useful":0,"cool":0},"P_CP4RaFZhCk9kTe6fVyig":{"text":"One of my favorite places in NOLA!!! much better than the lame Houston aquarium. Jellyfish","useful":1,"cool":1},"9yohdASxD4jAHG62GytnOw":{"text":"A must visit when in beautiful New Orleans. Take the Cotton Blossom riverboat and visit th","useful":0,"cool":0},"maCXyByhTpjsX0dooLIxsg":{"text":"This is my first visit to an aquarium, so I can't compare, but what I experienced was impr","useful":0,"cool":0},"pVdYlbmqnfST8hXTT-gvLg":{"text":"CUTENESS OVERLOAD!  If you're looking to go through your weekly quota of \"awws\" in one day","useful":3,"cool":0},"gV9SnH3xxuX9TNQrHqbBpA":{"text":"We visited this aquarium on my brother's twelfth birthday and he loved it.  As far as aqua","useful":1,"cool":1},"UkMDLCoB1wiF70E4KRUaFw":{"text":"What a let down.  I've been hearing for years how great this aquarium is.  How it's so muc","useful":2,"cool":3},"XbXvK2c1G_n8GRzgsmt0Sw":{"text":"This place is awesome, everytime I have gone here I loved it. I loved how they made the di","useful":0,"cool":0},"M7oyVIS4bAUjZbd6OTT_hw":{"text":"A fun thing to do on a day when the weather is not cooperating. It is in doors. I would ha","useful":0,"cool":0},"Ah3yfSeQEFMmZK98oDL6qw":{"text":"This is an amazing aquarium.  Huge selection of sea life.  You can definitely spend a hot ","useful":0,"cool":0},"eleKZsTL6a5k_JGBsW3iCQ":{"text":"We were not planning on going to the aquarium on this trip to New Orleans but we were glad","useful":0,"cool":0},"_wigOpLRPWQEQg1wiqJGJQ":{"text":"For the price, it was bleh. A lot of money for VERY little return. The exhibits were short","useful":0,"cool":0},"uSMhlCa_7pmUhelJBWegWg":{"text":"One of the top 3 in the Country!! Did not know that this was here, and was pleasantly surp","useful":0,"cool":0},"oYEdz8YPkGcGXh8aZNwFHg":{"text":"A must go if you're into the sea and having amazing photograph opportunities! \n\nWhat's fun","useful":0,"cool":0},"TMWRFa30qFS4gOYy3SuJ1Q":{"text":"It was not as big as it seems from the outside. Not much special exhibits aside from the p","useful":0,"cool":0},"h6h19Ut5xDd2Z-iB1E3E_A":{"text":"Fun!\nMy favorite are the cuttlefish, seahorse exhibit, and I loved the string ray petting ","useful":0,"cool":0},"DYryIWW8wX_bzezEmUkqpw":{"text":"An aquarium is an aquarium. This one is no better than any of the others you have been to.","useful":1,"cool":0},"UyRJK0i-L4Ws0Cx9L2QSTg":{"text":"This is a great place to bring kids... and also for adults to enjoy. However, make sure yo","useful":0,"cool":0},"6Zo2XI63RNZ0nbPt3T8DHQ":{"text":"Great aquarium. \nNice layout, diverse fish. Staff are very friendly and informative. Could","useful":1,"cool":0},"CXlQtROahQIUhLul21NjBg":{"text":"For $30 a person this aquarium is absolutely not worth the price. I get why it's so high t","useful":1,"cool":0},"WM9BtbxatuPtJLJ_OEKSFA":{"text":"The aquarium is small only 2 large tanks and was expensive to get into with 4 kids.  I ord","useful":0,"cool":0},"FewoLtI4Th9vnDeLCyi2Gw":{"text":"Door attendants are very rude. One of them yelled at my family and I for exiting through t","useful":0,"cool":0},"yG4CB6lB-KxrOqlW3CmwiA":{"text":"Definitely worth a visit, but only if you already visited the Insectarium. If you have bee","useful":0,"cool":0},"b-OEBAqZ2H34-IXCAmg72w":{"text":"Kids EVERYWHERE, many with parents that were not paying attention. Many of the tanks were ","useful":1,"cool":0},"05QJirjoAZFRmSWhoTf0EA":{"text":"I visit the aquarium 2-3 times per year, and look forward to every next visit. They do a g","useful":2,"cool":1},"NYwju8HNASCavAh-K7sKyw":{"text":"If your an animal person of the water variety this might be your place. Kids loved the pla","useful":2,"cool":0},"VtC1JaGVqO7g8vp_UEvnGw":{"text":"Not worth the time or the money.......and I love aquariums! I was very disappointed with t","useful":0,"cool":0},"rSdEHtWKw8bW-5wc9JP4XQ":{"text":"This was the worst overpriced aquarium I've ever been to. Tickets were $25 and it was abou","useful":1,"cool":1},"YZgc6saQGlmmAUVH0oiF4w":{"text":"We came here, excited to learn of an aquarium since we're animal fans.  And what was parti","useful":1,"cool":1},"AQQLipPki7Kx-4nPz__8TQ":{"text":"The aquarium sits on the banks of the Mississippi River which dumps out into the Gulf of M","useful":0,"cool":0},"oEs5P_YM9MYBzQ1glYMoaw":{"text":"Well the last time I was here was on my first visit to NOLA and I was about 7 so needless ","useful":3,"cool":2},"DPODbjK4xbWk9nQNt9CM4w":{"text":"Penguins.  Otters.  Super cute.\n\nI liked the experience in general, though I did feel bad ","useful":1,"cool":0},"MJ_7zf9T3OuiroaBzCWRww":{"text":"This is a decent aquarium, but a bit pricey and it was chock full of summer camp kids when","useful":1,"cool":1},"u14I4rAHlgTXp8Eradt9-A":{"text":"A really fun place to go to if you have a couple hours to spare.  The scenery is very impr","useful":0,"cool":0},"jpxow3UhTwGcuteguwWx-w":{"text":"I have been to a lot of aquariums so that is why I rated this in the middle. It's a nice s","useful":0,"cool":0},"gNJoJPGbpIGsxXIXgIUyyQ":{"text":"BEST AQUARIUM EVER!  I have gone to the Monterey Bay Aquarium as well as the aquarium in M","useful":0,"cool":0},"XXbk3jt9zsEna_-GzpsiAw":{"text":"$$$$ for how small and little there is to see. I wouldn't pay for that again. A couple of ","useful":0,"cool":0},"rQdpz_0IWT7t5qJG2AZ9iA":{"text":"Today, we visited both the insectarium and the aquarium. Both were phenomenal. This aquari","useful":0,"cool":0},"OWXIziVk-_oI29LArcB02A":{"text":"I thought I had already reviewed this place years ago...\n\nWell the aquarium is a nice quic","useful":1,"cool":1},"b3X_f65ItUrOKNfJhjBZoQ":{"text":"Cool Place, you can walk to it almost anywhere from the business district, The insect thin","useful":0,"cool":0},"2kx5eDzo5UUjmGvLGfkIJA":{"text":"It's been awhile since I have been to this aquarium, but other than it being a little smal","useful":0,"cool":0},"PvBPb_rE63gOBfz2y6s48A":{"text":"My family and I visited the aquarium this past weekend. For $39 each there wasn't a whole ","useful":2,"cool":1},"CrCZLbMzF25HzBHA5fjYjw":{"text":"~3.5 stars. Went to this as part of the New Orleans Pass deal. I really don't think I woul","useful":0,"cool":0},"mhdyCQydBoN73wB5V1wLrA":{"text":"This aquarium was average. I'm from Long Beach and our aquarium makes this place look real","useful":0,"cool":0},"PjNxX-CgCQbM7gQO1A3Q2g":{"text":"It's a little expensive and filled with too many children running around and screaming. So","useful":0,"cool":0},"l8WG2iG_he_70fTgHP-Zvw":{"text":"This really is a nice summer activity. If you haven't been, it is worth a visit. They don'","useful":0,"cool":1},"XltB57948p7b8SaOeitPBA":{"text":"Le plus bel aquarium que j'aie visité (et j'en ai vu pas mal).\nPrevoyez le pull car la cli","useful":0,"cool":0},"hs_QGZX_SyJZm55P9VG1Bg":{"text":"I wanted to really enjoy this place but was disappointed during my visit. First the price ","useful":0,"cool":0},"jDUtIw5XEFnn2yDyB7KlDg":{"text":"This was my first visit to the Aquarium since Hurricane Katrina. I was shocked at the tran","useful":1,"cool":0},"WwFRwRYYBGuqp8Mn_AFucQ":{"text":"I loved this place! It came as a total shock that it was as great as it was. (I had just a","useful":1,"cool":1},"CgM43lwYvKXowyMY0Q1TIw":{"text":"Love love love it! Whenever my hubby and I take a trip we are always sure to visit the Zoo","useful":0,"cool":0},"df0VU1Oxl4VN0eBa7TQ1QA":{"text":"I was very impressed with the aquarium in new orleans. I did not know it was so big with s","useful":0,"cool":0},"kVUAYalEW_GnByF_LUJG9g":{"text":"When there for an after hours convention activity, and it was wonderful. The Aquarium was ","useful":0,"cool":0},"Fwfhm721HDnljBWNmFJQnA":{"text":"This aquarium houses an exhibit, sponsored by several oil companies, that whitewashes the ","useful":1,"cool":0},"yQSOzr1r3-stIOKIJ3TXqw":{"text":"Place was cool. Wasn't crazy about how they break up different attractions and then charge","useful":0,"cool":0},"QMuJ8A0uSUtOyi6Cuf8rGw":{"text":"What a ripoff!!!!! Every vacation my family goes on we like to see the zoos, aquariums, et","useful":2,"cool":0},"QWTWTCIlAGVld1TtWl4PvQ":{"text":"Maybe I am spoiled because I grew up with the Shedd in Chicago but this place was nothing ","useful":1,"cool":0},"MEoCbq3BW2obKUhzl225tg":{"text":"Our Aquarium is excellent.  I think I actually like it better than the one in Atlanta.  It","useful":1,"cool":0},"4ZhaUmqpX1ybz5BAm5ZF9g":{"text":"I will admit that after going to the Atlanta aquarium, all other aquariums struggle to com","useful":0,"cool":0},"aKtZfWdROjtjKiM8-C4Ugw":{"text":"We were done seeing everything in an hour. For the price, it's disappointing. The main rea","useful":0,"cool":0},"AzFnJ_6iXaW48RAj8Wdc6Q":{"text":"We purchased a family membership from the Zoo, giving us free admission to the aquarium. E","useful":0,"cool":0},"8N6h0xr1PH5BjHm04HqB3g":{"text":"A small aquarium, lots of cool exhibits.\n\nGetting there in a wheelchair is not easy, since","useful":2,"cool":0},"61LNGp9dm-WrLLAZ2z1Cug":{"text":"My son loves the place what can I say. I've been countless times so it's a bit repetitive ","useful":0,"cool":0},"xnvXQTCN2vO-EzY-7iXMxw":{"text":"The aquarium is a great attraction in New Orleans! You must see it!","useful":0,"cool":0},"ekQ0px4Uo9ZTA-pLhSwMSA":{"text":"It seem overpriced, 53.00 for 3 adults with a coupon .but the exhibits were nice. I wouldn","useful":0,"cool":0},"TsS2k65n4MvdGpx_sgZVAw":{"text":"We always visit the local aquariums when we travel. So much history about the marine life ","useful":1,"cool":0},"nmL2htzRpmgjGe3YkibM_A":{"text":"We loved our experience, we actually bought a family membership, which includes unlimited ","useful":1,"cool":0},"h_9KzeP93Qe26e6FaqJI6w":{"text":"Based on yelp reviews, I was expecting something much more amazing.  Please note: We trave","useful":0,"cool":0},"lZGHaRskWe7-rH7NPo1UdA":{"text":"Oregonians don't waste your precious vacation time here.  Go to the Oregon coast aquarium ","useful":0,"cool":0},"IAqSIUCn-9tSo_ZuGbl-8w":{"text":"I grew up in LA, at a time when there were two large sea parks (Sea World in San Diego and","useful":1,"cool":0},"nDfqiQqL-DPvlducF-cEHw":{"text":"Great place to take the family in New Orleans! \n\nWe had an awesome time here with our two ","useful":0,"cool":0},"GTBolJWw3ymR8t1gxqGPxQ":{"text":"Loved this aquarium, they had a nice selection of sea creatures. My only complaint is that","useful":0,"cool":0},"EtdvV_RhOgqpCbXBVspaKw":{"text":"We have been to a few aquariums that were really cool so for the price of this aquarium we","useful":0,"cool":0},"eKRwky2Z2cLWoza0NO37tA":{"text":"Great for adults and kids.  Well worth the admission price.  Loved it, it was awesome!","useful":0,"cool":0},"cBJxxvslqYDa2RiYC4MbJQ":{"text":"4/5 fun (but pricy!)\n\nfirst review of 2014! this place was super fun - i always like aquar","useful":4,"cool":2},"RYPVAFbD19-PPuEtiP3IIQ":{"text":"My husband and I visited the aquarium yesterday. We hadn't been in years. The Gulf of Mexi","useful":1,"cool":1},"ymWV85YEudMouSlZP1H_tQ":{"text":"Great aquarium!  Perfect way to cool off after being out in the hot summer sun all day and","useful":1,"cool":0},"E6YkwwzJK0Kr1IUimQXcVg":{"text":"This aquarium is not the biggest or the fanciest I've been to, but the staff is super frie","useful":0,"cool":0},"CmFbFwL-ihoQa8s1MhELyg":{"text":"The aquarium is a nice diversion and certainly worth a good 1.5-2 hours of your time. They","useful":1,"cool":0},"tqR88BVwvXekjT9NEWdbPA":{"text":"I have been to lots of aquariums. This ranks 4/5 on my list. It is a small yet pretty cool","useful":1,"cool":1},"aUiVPTQ8An7I0QO28Mj2pw":{"text":"It was extremely crowded when we went, but not the reason we are giving it 1 star. The ani","useful":0,"cool":0},"hlHm-LlCeHHTobn-cJ6PVw":{"text":"I like the structure of this aquarium -- the way the exhibits flow from one to another. $2","useful":4,"cool":2},"Ie1tSz2Dfg8MLzrqBnMP9A":{"text":"Maybe we're spoiled having Shedd Aquarium in Chicago but we were very unimpressed. It took","useful":0,"cool":0},"p1cxcuIWGcUvaX1HVUupiQ":{"text":"I would not go again.  I was expecting way more exhibits than what I saw.  I was highly di","useful":0,"cool":0},"rF0d_TG5foNhzWNo0cRDtg":{"text":"Nice but needs more reef aquariums and should have a flower banks exhibit.","useful":0,"cool":0},"22dIoP7Mmu8-vUDcKAEqDw":{"text":"Ein ganz tolles Aquarium mit unter anderem Seepferdchen, Quallen, die nicht viele Aquarien","useful":0,"cool":0},"v7zD8L3e4Bk3AESTXZqasQ":{"text":"It's a good way to beat the weather and spend an hour or so. But it's an ok aquarium at be","useful":0,"cool":0},"8Ci85vmLrA_l9ZnAabHvfA":{"text":"Awesome aquarium! This coming from the man who thinks if you've seen one good aquarium you","useful":0,"cool":0},"2iXcUO7shSyig7MHJGiM8g":{"text":"It is still very cool to go here, It was soo crowded and it was hard to stay and really en","useful":0,"cool":0},"7e7m7qMyCPb5M556kVKjyQ":{"text":"Now this is an aquarium!\n\nWe had the entire place to ourselves and it was rented out for a","useful":1,"cool":0},"PS7coY0Nufgrsddt0AmNbA":{"text":"Want to know what I think is super cool?  The ocean. A lake. The Gulf. Being near the wate","useful":7,"cool":6},"U4I7cDasME4DjtQhrVuxbA":{"text":"Saying I have an obsession with zoos and aquariums is putting it lightly. I'm very happy t","useful":5,"cool":4},"TwcCA7dVT5j8JEwLbsu8vA":{"text":"The aquarium was very beautiful. If you're not driving, I recommend taking the bus instead","useful":0,"cool":0},"O-jfV4x8N0ZJxjBJExGuBQ":{"text":"For an aquarium, I have seen better. Since the Audobon Zoo is so amazing, I would expect n","useful":3,"cool":0},"DB8CpZQPzhnOoGybxjyr0g":{"text":"fun museum, love the seal, the stingray petting and the jellyfish and seahorse exhibit. I ","useful":1,"cool":0},"7TKRLT7PalpDsfdg46zzug":{"text":"LOVED the penguin experience!! Such a treat! And we were the only two for that session so ","useful":4,"cool":2},"lZwPI_2cEp3UWLL5aVK_3g":{"text":"Meh... Place is small for the $30 entrance fee.  We went in there late in the day we were ","useful":3,"cool":0},"kVt_GpEy4WDDfdSvCvGOng":{"text":"Small aquarium. Has an albino alligator. \n\nThere were a lot of large empty spaces due to t","useful":2,"cool":2},"wfb4Hf1T-Bz9RhiGNlhHHA":{"text":"I absolutely love the aquarium. My two year old has a blast every time we go. The staff is","useful":0,"cool":0},"1PfID_v46AbyOH8dw2f1Sw":{"text":"This is one of the premier aquariums in the country. It is located right next to scenic Mi","useful":5,"cool":1},"dtckAlDmuR_N_N0LsI80-Q":{"text":"I went here to indulge my inner (and outer) geek several years ago-- pre-Katrina. I don't ","useful":0,"cool":1},"PLX_yOSsJII4QurGq_7_iw":{"text":"The Gulf of Mexico exhibit is the coolest!  Get the pass to all the Audubon attractions...","useful":0,"cool":0},"0sbmr6rb0HpXLAFMOmvmLA":{"text":"Always is nostalgic visiting here. Reminds me of my childhood, so anytime that I'm in the ","useful":0,"cool":0},"ADLfdqLhWvorqDoRBXInLg":{"text":"We were here for the Scales and Ales Annual event. \nThis event was Awesome!! We arrived ar","useful":6,"cool":7},"UzPwDnWmdxLQdx_6boNVRg":{"text":"Visited the Audubon Aquarium of the America's on a Friday afternoon and ended up spending ","useful":1,"cool":0},"Jv8_5IJlQIyLV-3dL_SgBg":{"text":"About 100 dollars for 3 adults and one child. What can I say? It was a waste of money. It ","useful":0,"cool":0},"DmAMHyQ-VF5XbuBJahWQSg":{"text":"Was recommended to visit the Aquarium by a friend, and we got a coupon online for half off","useful":0,"cool":0},"dKqK1vKYfmrLGwGx1KotnQ":{"text":"As a family we spent a very wet afternoon here and it was fantastic. And what a stting jus","useful":0,"cool":0},"8HIA1x11tzln66HhyWHsnw":{"text":"Of all the Audubon attractions, the aquarium is by far my favs.  Partly because it manages","useful":1,"cool":2},"91funDKJIF3WagnV_9VRig":{"text":"Had very nice time at the aquarium. My favriot exhibit was parakeet point I like birds but","useful":0,"cool":0},"OMRMLqaaStpL6e-iGRk5Ew":{"text":"I may be spoiled living in Baltimore, because I was pretty let down! We only did the Aquar","useful":0,"cool":0},"vh30RC8LhHSIOFC5E_AXag":{"text":"It was just OK for me. I did enjoy seeing the large fish in the tanks, but the 3 birds tha","useful":0,"cool":0},"LeWFv1PMxw8uxV7HJNlNIA":{"text":"Overall we had a good time. My wife and son especially loved the hands-on experience with ","useful":1,"cool":0},"v1tB-_n9fIDO-1dFcSHzvQ":{"text":"I was really excited for this aquarium but it was disappointing.  There were a couple of n","useful":2,"cool":2},"bxAv0sTXS8Yy8lgOGoTBtQ":{"text":"This is a great place to visit, if you have an extra hour or two when visiting the Crescen","useful":1,"cool":1},"Ex12DkVEY8T11nSXzPUv-Q":{"text":"The admission prices for a bit too high for my liking but it was so overcrowded with field","useful":0,"cool":0},"O-cKu1GJjQluhzclj_wbew":{"text":"I've been here several times over the years and this place never fails to disappoint.  Mos","useful":1,"cool":1},"Q5q5CwzWW910tr7sKuyyjA":{"text":"Prolly din't have to see this attraction and could have skipped out on this one but still ","useful":1,"cool":0},"XQPzhBG4oqvLuDSCWnwRww":{"text":"Favorite aquarium I have ever visited. Love the up close and personal parakeet exhibit, pe","useful":0,"cool":0},"VWDf-3Am9X6P1K-1b36i1Q":{"text":"WE GOT TO PET A STINGRAY! And we saw a whole tunnel full of fish. I am in my happy place n","useful":25,"cool":25},"mpqOUEYS-8MQAwZWl68uHg":{"text":"This is the best aquarium I've ever been to! I've been to a few and this tops Boston's aqu","useful":1,"cool":0},"_bjt1RUEeYNEMtXYxG_zaQ":{"text":"I really want to say that I loved the aquarium! \n\n\nFirst, I'll say what I liked. They had ","useful":0,"cool":0},"2wtICbo8cu-DSkJyCIvbfA":{"text":"As far as aquariums go, this one is...pretty basic. Some beautiful things and some not so ","useful":2,"cool":0},"4pEiHevfTHyEj71ozFOhyw":{"text":"The exhibits are nice and variety of animals are great. Unfortunately there's were too man","useful":2,"cool":2},"1F-O_AwCBFfTSPFdnV17MQ":{"text":"We loved this aquarium. It has so much more than tanks of fish. There was a Mississippi Ri","useful":0,"cool":0},"fAEqOKM0aOxuyMJbQ867xw":{"text":"Great aquarium! The traveling beach trash art show was cool (and sobering) to see, the foo","useful":0,"cool":0},"5YBv3u5emJxEMVQkG7glNw":{"text":"Let me start out with why I only gave 4 stars. Parking is ridiculous! I went today for les","useful":2,"cool":1},"CJawUSfAKW-EKS79OxrRuw":{"text":"Amazing experience for Papaw & Granddaughter. Staff could not have been nicer, more helpfu","useful":0,"cool":0},"dSi_quq0lkhjgeMN2bEqaw":{"text":"It's an aquarium, but not a particularly exciting one.  Maybe it was just the day we were ","useful":0,"cool":0},"VxsVSxLhECAcQ_LKTIcMDQ":{"text":"We did the Backstage Penguin Pass and it was worth every penny. \n\nWhen you arrive, go to t","useful":1,"cool":1},"HaIFWYgIvo7wfoxy5rWVAA":{"text":"Very cute place and i love the free movie with my ticket. Will be back with my sea creatur","useful":0,"cool":0},"DtBuPNFOV-52X8FUC01SkA":{"text":"This aquarium is cool, but it's not worth the price. 20 bucks to look at what seemed like ","useful":1,"cool":0},"z0HAxxd1S-GNEJUFYuEgiQ":{"text":"We ended up here due to torrential downpours which ruined my plans to visit a brewery - so","useful":0,"cool":0},"Ojcs5J4P-1vTwEmMeO4DSg":{"text":"First let me say that if you are visiting New Orleans with kids, this would be a must. But","useful":0,"cool":0},"a2Gu7Tlpvw-0V3hFE0fAyQ":{"text":"This is a good way to spend an afternoon for a $30 ticket.  The lines are long but they mo","useful":0,"cool":0},"RBuacDNGhB0NLXlT03RAaQ":{"text":"I had the pleasure of visiting all 3 Audobon animal places with my son on our recent trip ","useful":0,"cool":0},"ebvxuLn3oRKgeYP8ThJF8g":{"text":"What a fabulous little city aquarium! While it's small and limited in terms of sea creatur","useful":0,"cool":0},"tx8138mRiMKZvT57095hjA":{"text":"This place is amazing and we weren't even visiting with our kids. My husband and I conside","useful":0,"cool":0},"hPMBP_OsB0Upto8hU7FEDA":{"text":"This place is amazing!  In case you don't know, NOLA is not just a party town - it's also ","useful":1,"cool":1},"HRxZUxUObI5nGBqXsg9iQQ":{"text":"Expensive for what it is.  $30 for a ticket and I was done in 38 minutes. I went end of Ju","useful":1,"cool":0},"Y1jqCB1FdTBPaFuOsSleKg":{"text":"My husband and I visited the Audubon Aquarium last week. It rained cats and dogs the entir","useful":0,"cool":0},"CI-2rJMw8NP1XI3c7bUIGw":{"text":"The otters were adorable as well as the penguins! I really enjoyed the history of the Miss","useful":0,"cool":0},"WWESa7ShOpJhxiWI4BvLBg":{"text":"Who can resist adorable otters or playful penguins? Even the frogs are fascinating here! M","useful":0,"cool":0},"8KwTq4ilqyK3A4fd4aSIEA":{"text":"It has a few nice things and a desirable central location, but as aquaria go, it really wa","useful":2,"cool":1},"VMeeXylklNftPt40qspsPQ":{"text":"Not the largest of aquariums but has some good exhibits and the staff is nice. Not cheap b","useful":0,"cool":1},"RTuWiioIPcRcw9diGknzEA":{"text":"New Orleans doesn't have Ikea, but they have THIS!!!\n\n\n You walk down this path off cool a","useful":0,"cool":0},"O0UjJ00eWZBTGdbugu0OVQ":{"text":"When in New Orleans, we were mostly on foot so most of what we did needed to be within wal","useful":1,"cool":1},"uBBmA5fQk8JbG4x8KXMnkQ":{"text":"Such an amazing experience! Haven't been since i was a kid and really enjoyed it! All the ","useful":0,"cool":0},"DZhz-egT9og0kfe5ofsg5w":{"text":"Highlights are:\nStingray touch pool:  they are very approachable.  I won't ruin it for tho","useful":1,"cool":0},"8Kbzf9hwL-Qyfs6JwISi_Q":{"text":"My father, daughter, and I decided to take a field trip to the Great N.O., and while there","useful":0,"cool":0},"CYh1A2iWvPkWzyPrqRUxtQ":{"text":"A very good aquarium if not the best.   Loved the penguin feeding session.   Thought the g","useful":0,"cool":0},"Hk-zQgLjxMn-K8OQAHRK9w":{"text":"Im a huge fan of marine life, so going here was such a joy. I felt like a little kid in a ","useful":0,"cool":0},"fmQSVoIQyeRLFaMlBnXUlQ":{"text":"My kids love this Aquarium. I am kind of disappointed in their \"new\" mayan exhibit. It loo","useful":0,"cool":0},"LBSow6W2Rp-vTIKqI8RoaA":{"text":"This is a great place to cool off on a hot summer day. It compares with most big city aqua","useful":0,"cool":0},"xijpmyrOZoLxwJAD7zYCNQ":{"text":"Excellent all day fun for the family at the Aquarium in New Orleans.  Price is expensive b","useful":0,"cool":0},"Ygaw4NHwor0EHMs39Qyddw":{"text":"I was very excited to go to this aquarium and loved that it was an Audubon site. It was $3","useful":0,"cool":0},"QlncDnsbkPUcCysCUyfHEw":{"text":"My only complaint of this aquarium is that it was undergoing some construction at the time","useful":0,"cool":0},"A5oodl2pMR-CtSWNGyzmDQ":{"text":"Fantastic value when buying a combination ticket for the Audubon Zoo.\nChildren will absolu","useful":0,"cool":0},"2T30GaK3C2FZ9gHKRuOMcQ":{"text":"Pricey for what you get. The aquarium itself is rather small, for a 32 buck adult ticket i","useful":0,"cool":0},"kD3XGs60OW5CKUvoTnX09w":{"text":"Pretty disappointing. What an underwhelming experience this place is. There are few exhibi","useful":0,"cool":0},"AUXqZoI-fhCuCGs0HG1Kog":{"text":"::disclaimer::\nI used a groupon for admission so I only paid $9.\n\nThis was a really nice a","useful":4,"cool":0},"pYtiRPZLVPdvxhaLzQXynA":{"text":"Audubon Aquarium of the Americas is an amazing multi level aquarium located on the Mississ","useful":4,"cool":4},"5UcURAdeJ8HYY4ErSjexRg":{"text":"Great place to visit .  Lots of unique and interesting aquatic life to see. Friendly and h","useful":0,"cool":0},"Q7NgPlMSlh-FioiTX--m1A":{"text":"This is my 5th time visiting and I love it more every time.  I recommend to any and everyo","useful":0,"cool":0},"5tXnzyiDSUjHjhNWCYZSpw":{"text":"Just Keep Swimming! We visited the Audubon Aquarium of Americas in April while in NOLA. Wi","useful":2,"cool":0},"VoWyq7tpHwOHBA62Rt2HCQ":{"text":"I go as often as possible, get yourself an Audubon membership so you can enjoy this the zo","useful":13,"cool":9},"QmU0oNjnuZi7M3cAUedh6Q":{"text":"(Caveat: As a biologist who's worked in zoos as well as the commercial/retail fish trade, ","useful":17,"cool":1},"aUHQAxVYVCVVtFtmlzvSLA":{"text":"We decided to visit to get out of the heat during our trip early August. It's a nice aquar","useful":2,"cool":0},"W7a1gseBvEjWB9cqz2-arA":{"text":"Its a great aquarium. Be sure to check out one of the IMAX shows. Inside, the exhibits are","useful":0,"cool":0},"75y7HGgf1BjLOFUZKeMEdw":{"text":"Purchased Aquarium/ Insectarium tickets as part of a combo online. Drastically reduced the","useful":7,"cool":5},"XSW6YY0eLcrVytw7jxKt7Q":{"text":"Always a good choice for the kids. Best part was the bird feeding (u have to pay $1.50 for","useful":0,"cool":0},"qbNJI8UUOEgvYVlNY6LmVA":{"text":"A beautiful place-we wish had more time here!! We loved all the displays and got to enjoy ","useful":0,"cool":1},"mmybvdcIREmqyd6tLSJ_sw":{"text":"What a beautiful expansive aquarium!  We had soooo much fun and would highly recommend a t","useful":4,"cool":2},"t4euBfzVXsnjcjWrc5XRlA":{"text":"This place is awesome! We go once a year (for the last 9 years) every time we go to New Or","useful":0,"cool":0},"j0GxXFf5ZfZa2GS8NDrSKQ":{"text":"If you build it they will come..  nope just kidding.  No shark exhibit just a large portio","useful":0,"cool":0},"xv7kneVKHAljKz1-0IgPqA":{"text":"So much fun for the kiddos and the aquatic animal lovers alike. This aquarium was actually","useful":8,"cool":5},"WfglWrpwZIya3eQIJuuiTA":{"text":"Smaller aquarium and brief visit while a first time and out of town visiter ended with get","useful":0,"cool":0},"L-AtwPyWVvU24L9XTU_OEg":{"text":"I wanted to like this. (Especially for the cost of admission which was well over $100 for ","useful":0,"cool":0},"Esduvo_u-obKGqWkDReLNQ":{"text":"Great place to visit when in the Big Easy. The kids will love it. Grand displays of local ","useful":0,"cool":0},"8ZnzOQxvfad1bu0Ym6LhZQ":{"text":"There was a lot of construction near the entrance when I went that was a tad aggravating, ","useful":0,"cool":0},"4H4_vcjBpZS-fWsisBi_bQ":{"text":"Surprising family find in the French Quarter! Must see! similar to Boston Aquarium, large.","useful":0,"cool":0},"Odx2sQMN4ktguT9TLtqVTg":{"text":"I've been to this aquarium 3 times since 1995. This was my 3rd time in about 10 years and ","useful":0,"cool":0},"BLFZfpdH_DFj7u1p90GnVw":{"text":"Great place to visit! \n\nI only had 2 (minor)issues:\n1. On the website it gives you a list ","useful":4,"cool":1},"lkfpB9ZtqFYf36Lee-TPtg":{"text":"I visited the aquarium in October 2019. It was an enjoyable time, but I can't say it was v","useful":1,"cool":1},"vFyTdSID4iR1bp28xfujSQ":{"text":"Want to touch and play with the ray?\nWant to meet the African penguins?\nThose are some of ","useful":1,"cool":0},"rFoUpBgPTYSqf8vLnrrDTA":{"text":"An interesting aquarium - not quite on par with the Monterey Aquarium or the National Aqua","useful":3,"cool":2},"VB67R6LYx3Vif3YQ3W6Aqg":{"text":"Penguins!!!  Need I say more?!\n\nFor an extra fee, $125, you can interact with actual pengu","useful":1,"cool":0},"ESnRu81vjWhk_Z1BDItyyQ":{"text":"The aquarium was OK. But way overpriced for what it is. I was disappointed with the size o","useful":0,"cool":0},"_3yGpDdlnX40KQZk8IT1Kg":{"text":"OTTERS!!!!!!!!!!!!!!!\nI could sit there and watch them swim and play all day if I had the ","useful":2,"cool":1},"rKGYyTXClIYVKeOFjjXQlg":{"text":"This is a nice aquarium, but nothing really special.  It was very crowded on the recent Su","useful":1,"cool":1},"7odsEPjkCWhYOjLE3de6mA":{"text":"I expected a little more out of the Aquarium, especially since it was sooooo expensive. I'","useful":4,"cool":3},"UfQSQx5QEwySbqLTnaeNAQ":{"text":"Lets start with the price.  $30 a head.  Well lets see if it was worth it.\n\nFirst, right b","useful":0,"cool":0},"XzjceGFqvSUfrDgQdYWDiA":{"text":"This aquarium packs a punch. It is smaller but there is plenty to see and experience. Part","useful":0,"cool":0},"s4Vp1_cjp85yLcmFcJYpNQ":{"text":"Smaller than other aquariums I've been to, this aquarium provides a nice change of pace fr","useful":4,"cool":1},"SETa3nwoQcUDLFj7WEXoIg":{"text":"Extremely disappointed. We walked in at 1pm. At 145, while having a snack we were told tha","useful":1,"cool":0},"Ef5VMkvaZT2VnYggyWWEZQ":{"text":"Such a fun place! The aquarium offers a nice break from the New Orleans heat. There are se","useful":0,"cool":0},"pnxr82iC34N_TR6eme7Zvw":{"text":"I bought the Audubon Experience which allows you to visit the Audubon Zoo, Audubon Aquariu","useful":0,"cool":0},"TZzRpZZN6ORFK-EnEryg9A":{"text":"Who doesn't love aquariums? Yes, my husband and I go to different aquariums and zoos in di","useful":14,"cool":14},"MuFKXXbVqEqhfRbZlE5bQg":{"text":"Beautiful! The workers are very friendly and love to teach which is wonderful. The exhibit","useful":0,"cool":0},"aJahJ8vee4pRaUm_1I1r3w":{"text":"One of the smallest aquariums we've ever been in. We were in and out in just over an hour.","useful":1,"cool":0},"cEvs10Ibx6bKaHiMH69BUw":{"text":"After many recommendations, my husband and I ventured here with our kids and nephew. I hav","useful":0,"cool":0},"m7xy3K6-lhExqwlTmTOp1A":{"text":"I thought it was okay; I've been to a lot of aquariums and Audubon was mediocre. It was sm","useful":1,"cool":0},"GvimjTVAMpot2dJmo8baXQ":{"text":"It's June in Louisiana and it's HOT!  This place has A/C, woohoo! I was able to experience","useful":2,"cool":1},"y33Efg4wL2s4HX4R1DvBBg":{"text":"Considering it costs $22.50 for general admission I expected alot more. The place was so s","useful":2,"cool":1},"7Wc26ZlWs8QJaXimwn2kqw":{"text":"UPDATED - 9/28/2016\nI'm so disappointed. It had been a while since I've been here and when","useful":1,"cool":0},"-B_KtreRVWJYjCo2rDRrvw":{"text":"Great visit. Friendly staff. We must have hit it lucky wasn't that crowded. Cool exhibits.","useful":0,"cool":0},"M2NpB6kq-ZxXf6ALWVjPVw":{"text":"This was a nice great if you bring kids. It took about an hour and a half to see everythin","useful":0,"cool":0},"lQCbIw7X50HpW9sS5b1aqw":{"text":"Great aquarium. We had loads of fun only wished the shark exhibit was open. Loved the seal","useful":1,"cool":1},"6hyMA43KkpSFc4f5GCjNGw":{"text":"This aquarium is a good place to visit.\nIt is not too large but packs a large variety\nof d","useful":0,"cool":0},"FTRAuQRwR_XCm2R_SwUdlA":{"text":"Great aquarium, diverse sections representing a cross section of aquatic life and of cours","useful":0,"cool":0},"7DgaGKXa8G8qYR-aBvac9Q":{"text":"Wonderful experience at the aquarium. Smaller than most but good exhibits.  The parakeet e","useful":1,"cool":1},"IdeW-8aQ266vZn_6iCa2Ag":{"text":"This review is only for the movie theatre which is right adjacent to the aquarium with its","useful":1,"cool":0},"vQK4_kYEO7Fns0tHDi0RQg":{"text":"We arrived late and the girl at the desk told us they were only open for another 90 minute","useful":0,"cool":0},"JFApdUcDpAQ6Kz450EHjag":{"text":"Heartbroken and angry - I reported them to animal welfare. The penguin exhibit is SAD they","useful":0,"cool":0},"UjMcf1gUnoyoy48mo4hKgg":{"text":"Disappointing in comparison to the Chattanooga, TN Aquarium & the Atlanta, GA Aquarium. Th","useful":0,"cool":0},"ZfEoAlwyKazFIo0ijgvpBA":{"text":"So much fun! The aquarium is  divided into numerous parts all stocked with beautiful speci","useful":1,"cool":1},"FTguLR3hfWJ5DS-ZNGBRMw":{"text":"Came here last minute with only about an hour to see stuff. Honestly, I had a blast. The b","useful":0,"cool":0},"8copCYMEJVu3gaVQX8bPmA":{"text":"Perfect place to take baby on a hot & stormy summer day. Beautiful and interesting exhibit","useful":1,"cool":0},"jvDTPo9ADkiL3wVCTTF8HA":{"text":"Audubon Aquarium was GREAT!!! Bought tickets on line at a discount, had all kinds of diffe","useful":0,"cool":0},"im6O_QxGbYWOk9fVN49VNQ":{"text":"2 hours of fun.  Right on the bank of the Mississippi river.  \n\nIt has themed sections in ","useful":0,"cool":0},"7f31_rp0YYjrq5jywvIhpg":{"text":"After visiting their Insectarium we were expecting more from this stop. My husband and son","useful":0,"cool":0},"VGupJXaZgVHWp2cjJHHUAA":{"text":"I've been to this aquarium over 30 times and I absolutely love this place!! By far one of ","useful":0,"cool":0},"4rlHBs0CMe8sAddeevpY-Q":{"text":"HOW IN THE HELL DO I GET TO THE EXITS?\nSince recent terrorist attacks I have become much m","useful":3,"cool":1},"CMD8ThLlK2NgTkTD83wWzg":{"text":"This place is kinda sad. The penguins are smooshed in and show signs of captivity anxiety.","useful":0,"cool":0},"mkD1Tsr1qDgKdiyLkycO-g":{"text":"Could of been better. Sparse exhibits. Very sad penguin exhibit. Lots of 'pardon our mess'","useful":0,"cool":0},"cvHUlPHSBmjPcON5QlFFLg":{"text":"Took my elderly parents and it was so packed with kids and so loud, there was no way to en","useful":0,"cool":0},"5nT8BfolR7nv148Q2Fe3Dw":{"text":"When compared to the New England Aquarium or similar, Audubon shouldn't even be called an ","useful":0,"cool":0},"HsU4Rg3v6hyTdqsbIUyi7w":{"text":"My kids and I love Audubon! The Aquarium is always neat. We expect crowds because it is to","useful":7,"cool":6},"otcHaiw06UPznkGx7jZ3mA":{"text":"A short walk from our hotel in the warehouse district is the Audubon Aquarium.  Very respe","useful":8,"cool":6},"JDa7TnUbLWgOyv3IIc3UHg":{"text":"Fish.\nReptiles.\nBirds.\nEscalators. \nCoral.\nPlants. \nFunny Smells.\nShellfish.\nOver priced t","useful":5,"cool":0},"J4_zA4DTh5iJnjsZTbwbEQ":{"text":"Thinking back to our trip here, what a great date place for a rainy afternoon! \n\nWe parked","useful":8,"cool":3},"mLBrHxcd8OYtR2NOPV3jyA":{"text":"If your from the upper east coast and have been to Philadelphia or Baltimore aquarium don'","useful":0,"cool":0},"4Gu73Ht5HfIjdL-d7YwlCA":{"text":"We love the aquarium! We actually bought a membership for here and the Audubon Zoo since w","useful":2,"cool":1},"hqIgbU7b0Ub2ZUrGkb8myA":{"text":"Long lines to get in. Kids loved the sharks. Food court expensive. If u have the energy to","useful":0,"cool":0},"3uedgJiIBaJBHKP_O-zOhw":{"text":"Nice aquarium that has a diverse selection of aquatic wildlife. In addition to saltwater, ","useful":1,"cool":2},"14Ueyf77B689bV1CQXlRbQ":{"text":"Great family outing in NOLA. Fun time in the bird cage, one got in my daughters purse, foo","useful":0,"cool":0},"-ODe1iRzfqicS2OtbJQ_Mw":{"text":"One of the best aquariums I have ever visited. We went in 2004, before Katrina, and were s","useful":0,"cool":0},"BoxzyOYVBLMsv5-SYhmWIA":{"text":"This was a decent experience. We came because my 4 year old really wanted to see the fish ","useful":1,"cool":0},"CkrOXF0h6mVelGgdViHW-A":{"text":"The Audubon Aquarium exceeded even the aquarium in my Hometown of Brooklyn.  Although the ","useful":2,"cool":1},"iWZobOqSPw095cXs28Hqcg":{"text":"What a terrible experience. Some of the tanks were empty. Others only had one specimen. Th","useful":3,"cool":1},"Xd0Vbuq71aw8QpjaG-VXbw":{"text":"Very nice place, although it can use more for the admission price. The food court is very ","useful":2,"cool":0},"sUypbgXBlTrz5MUpJIwtPw":{"text":"We spent much ore time there than we thought we would- it was just so wonderful.  Petting ","useful":0,"cool":0},"e3Arb3OmnQCCjki1Axbfeg":{"text":"Phenomenal aquarium!\n\n-small, but packed with marine life, activities, birds, information,","useful":0,"cool":0},"hrVWTrhnX0dIWHh-Jr9gXw":{"text":"The Aquarium is another wonderful attraction for kids and adults. \n\nLocated on the riverfr","useful":4,"cool":3},"QfMjgk1310iGZpgVMxQTAA":{"text":"NYC does not have any good aquariums so I made it a point to come here and was not disappo","useful":0,"cool":0},"lMfH2DNfjJPLIwgXEKILXg":{"text":"We got the Individual Plus One Audubon membership (kids under 2 are free anyway!)\n\nIt's su","useful":3,"cool":2},"b-HK5_nCXlS8MppfFrUSKw":{"text":"I had extremely high hopes for this place. It delivered nothing aside from an Albino Allig","useful":1,"cool":0},"T-PSSWyvy23VgNd1r6KyAw":{"text":"Hubby and I made this one of our last stops before we headed to the airport. It's a bit on","useful":0,"cool":0},"whws2BgV-q7mC7kC49O9VA":{"text":"Whenever I visit a city for the first time and it has an aquarium, it is highly probable t","useful":3,"cool":2},"uySHjTjLAFNDxfdSRXKBww":{"text":"I have been to a ton of aquariums. This one was nice but a little underwhelming. Still wor","useful":0,"cool":0},"5LeD4dAcnXTLgDyHgheiGw":{"text":"This aquarium is cool for the young and old (er!) \n\nThere is your typical aquariums with b","useful":1,"cool":1},"HuMGMZjpPbVRWcwIYa_stA":{"text":"This was a really great aquarium. I had a really good time. The tanks were all clean and t","useful":7,"cool":5},"3b98S9CRkPIrCSmu37qoJw":{"text":"The aquarium is kinda small and general admission is a little high. I would probably give ","useful":4,"cool":3},"1t52QWGQ-386GTGXttYP_g":{"text":"Note, you can only enter 15 minutes prior to your ticket time. They will not let you in ev","useful":3,"cool":4},"dupAUnQd20N9m5B3XVXmIw":{"text":"Fishes... sharkies... octopi... (yeah you're not gonna have me flagged)\n\nAnywho, great add","useful":10,"cool":10},"7EC1Iv_SNfkXPSCQUrHGgw":{"text":"This aquarium is very small and parts of it are wholly empty. Compared to other aquariums ","useful":1,"cool":0},"hBL0WwkqWgxLda4wn9wL6Q":{"text":"I liked the good variety of sea life exhibited, including penguins, sharks, jellyfish, sea","useful":8,"cool":7},"C70JXvuyO4szew6uZckmug":{"text":"How did I forget to write my review about this place?!?  Oh well...let's rectify this situ","useful":10,"cool":8},"J-gJVQT89h6SKDTF9juQKw":{"text":"I would give this a solid 3.5 stars, and we'll round up! This may be the smallest aquarium","useful":1,"cool":1},"0Yidymw1ZteyZGyg1XKdRw":{"text":"Extremely disappointed this year! They took out 75% of the Children's play area where they","useful":0,"cool":0},"zdicLEO46Bk6-P9noBS-1g":{"text":"I love aquariums ! This one was small yes, but overall it wasn't bad. The only thing I tho","useful":0,"cool":0},"_PFA6yFYbivDL2oegmCVKg":{"text":"I've been to several other aquariums and was very under-impressed with this one. While the","useful":4,"cool":2},"-s2LY3eEFWe7rgAr3wuFQg":{"text":"This is a fun aquarium if you have small children.  The aquarium has an albino alligator a","useful":2,"cool":1},"bp5B6ZZFyzSS559QWrXsqA":{"text":"New Orleans in the spring/summer is hot as hell. Anything that would get us out the heat w","useful":3,"cool":4},"3xWm21u6q2alotXG_1YS6g":{"text":"I just loved this aquarium. It's designed very well for a good walking flow. I felt like I","useful":3,"cool":2},"JeVHWJ1Is_LZVbYT2Xh8ig":{"text":"Great place to come with families on a hot, humid, or rainy day. Well that's just about ev","useful":0,"cool":0},"vI6MeKxU6d7qOhpETu4Unw":{"text":"It's a cool aquarium but I think it's insanely overpriced. If you plan on going more than ","useful":0,"cool":0},"vWfiWu2Td6yXEVpy0k7UDQ":{"text":"Had to go here while in New Orleans because everyone told me to. Glad I went. $35 a ticket","useful":0,"cool":0},"4ucuDmccxP7rlUBoxrSwIQ":{"text":"Went 4/18 and I understand that there were weather issues that caused most of the cities b","useful":0,"cool":0},"C5Yy8beNg40Dp0P8p5M7ug":{"text":"Pleasantly surprised by our experience here! There was so much to see. Every time I though","useful":1,"cool":0},"hVJZmzbv9wAM8nTfUUiUrA":{"text":"Severely lacking in information on the species, which in my opinion education is one of th","useful":0,"cool":0},"iB3E6VsSNqsEj9BXcecxTA":{"text":"The kids had a wonderful time today. They saw everything they wanted to see except whales.","useful":1,"cool":1},"t6b8OCnZefaWGhhNQvjeVQ":{"text":"I made it a most to see the Audubon Aquarium of the Americas when I came to visit new Orle","useful":1,"cool":0},"kiWRdJ-SlQglmSY-2zfabw":{"text":"This is a nice aquarium but for me, the WOW factor was parakeet pointe. Sooooo cool! You c","useful":0,"cool":0},"LXihr3XxnnNa8AUhso9gAg":{"text":"I felt cheated today at a cost of $85 for 2 adults & 1 child. Some of the exhibits at the ","useful":1,"cool":0},"HRznUBGbOTwtioO2C6GNvg":{"text":"Happy 25th birthday Audubon Aquarium! I've been coming here since I was a kid and it remai","useful":4,"cool":3},"RD4rATvYMu2NbAbwnvQ0oQ":{"text":"Not as grand as I remember as a child. But it looks like they're putting some more work in","useful":1,"cool":0},"t_TMWmOUxqx7UlFX4tfRGA":{"text":"We walked in right as the stingrays the other fish were being fed.  Then we petted stingra","useful":0,"cool":0},"o_WzhsbVYQaOHXXDFOsSdQ":{"text":"Before our most recently visit I had not been to this aquarium in about 14 years. I was ex","useful":1,"cool":1},"brMD1jzHqipIk-t9JwIUPw":{"text":"Although I've been to many aquariums over Europe and the US (my sister is a huge fan of al","useful":0,"cool":0},"bbL-6ZYvIwCoby3e-i_cyQ":{"text":"Beautiful aquarium- the tanks are really well maintained and fish are healthy! I have visi","useful":0,"cool":0},"xnfl_uoNDOf-cM3wDvnE3A":{"text":"My husband and I were here on vacation and visited Monday July 8th in the afternoon. The a","useful":0,"cool":0},"nKNezwtFtelA8w_76yrpPQ":{"text":"I read it was supposed to be one of the top 5 Aquariums in the states. I did go on a cloud","useful":0,"cool":0},"p87eO-bJD8QUgsBq-q7iBA":{"text":"It's smaller than I expected. Not much by was of interactive exhibits. I'm usually into th","useful":0,"cool":0},"CUzP8Cif4JtU8LwT7sHSVw":{"text":"This aquarium was lovely! They had tons of different fish, from the local to the exotic. T","useful":0,"cool":0},"6RWr5vg8J3bbirOmm4EwIw":{"text":"We visited the Audubon Aquarium of the Americas in New Orleans in January 2017.  I've been","useful":0,"cool":2},"7hAKvUFE2LkwVZyuA6z_-Q":{"text":"The aquarium itself was nice.  All of the exhibits seemed well maintained.\nMy only complai","useful":0,"cool":0},"1KWDp5gOuZMpDHWqkx6Kog":{"text":"This was a little disappointing.. some exhibits were under construction. Unfortunately we ","useful":0,"cool":0},"mIo5SVzhbk7ains9wPxlGw":{"text":"Long Line Long Line.... Even if you bought the membership and made reservation, you still ","useful":0,"cool":0},"CT_0NOZpKPywUJ94mz9P9Q":{"text":"Loved it and I am a grown behind woman \n\nEnjoyed the bird exhibit where you can feed and h","useful":1,"cool":2},"7Dcqk6eIbQuAh-ImwYOZZw":{"text":"My husband and I love aquariums and we go to one on every trip possible. This aquarium is ","useful":0,"cool":0},"Qs05bLd3NkF4T6L3XBh8lw":{"text":"We came here on Monday, the day of Lundi Gras.  On Yelp it, said it was closed on Mondays.","useful":16,"cool":16},"N7ChlR2rSaoRd6Yf4ucYxg":{"text":"Just heard on the news that Hitler's alligator died at the age of 84 in the Moscow Zoo, wh","useful":42,"cool":36},"yWequ2CDjqJ9PTVv6E31lA":{"text":"My husband and I stopped in to check the place out. They do not offer a military discount ","useful":7,"cool":5},"jt9FcuOY7x9nm3mrgCrU8A":{"text":"Small aquarium but VERY CLEAN. It was kind of empty when we went on a Tuesday. I purchased","useful":0,"cool":0},"hpglfnrz4hItxlCh3yVTdA":{"text":"This is kind of a lame aquarium.  You can blow through the whole thing in under an hour.  ","useful":3,"cool":0},"wCdf8q1IXG8XkXFsjJw4SQ":{"text":"One of the best aquariums I have visited - and I am from Florida, so that says a lot! This","useful":2,"cool":2},"PP2X5EzjGeqYTups-ss3UA":{"text":"Very nice and lots to do! My kids didn't want to leave! Very friendly staff and good food ","useful":2,"cool":3},"CFCT3bf3jkxIXKTRMq_f8w":{"text":"My husband and I thoroughly enjoyed our visit. The staff were friendly and helpful. The ex","useful":0,"cool":0},"HfqnDN3lbumNOu0XzjfSiA":{"text":"I haven't been back to the Aquarium ever since I was a little girl growing up in NOLA and ","useful":5,"cool":3},"vJylca0TuH2dd17nfjS0qw":{"text":"Love coming to the aquarium! My 7 year old is fascinated by seeing all the sea creatures!!","useful":0,"cool":0},"DZEJKr8JCAq79Z0jMnv8hA":{"text":"This is a great place to visit. A bit on the pricy side, but definitely worth a visit. Whe","useful":1,"cool":1},"Sb5VjfLqssuNAmc5UDDEfA":{"text":"Looking for a rainy day activity that's fun, head for the Aquarium! Having been many years","useful":3,"cool":2},"6Z39XlJkIZwHxAlSgf6weQ":{"text":"Nice exhibits but overall I feel the cost needs to be slightly lower.  The expense to mana","useful":1,"cool":0},"enIstoeyOSqE5HnNkM6K7A":{"text":"Visiting New Orleans I took my daughter as a good inside outing due to the rain. You have ","useful":0,"cool":0},"Ns76fo6ZwfeDck585q6ewg":{"text":"I was visiting New Orleans from Baltimore, Maryland.  The weather was a bit chilly for the","useful":1,"cool":0},"jisqP9j9MJyNjggU_cGYLg":{"text":"Some of the exhibits still seem to be closed off. I only spent about an hour here looking ","useful":0,"cool":0},"IiMLChkqsION5VEtUfIv_Q":{"text":"This place is great.\nIt's small so it will be about 2 hours of fun plus any shows you see.","useful":0,"cool":0},"83Y6KCjyVok7fnsxg1ziig":{"text":"Dive into the depths of the ocean and you'll see some amazing sea life.  If you prefer dry","useful":52,"cool":52},"5vgNlxVfze7OoUrRB1MmKg":{"text":"The aquarium overall was very informative and it had nice displays, I just found them to b","useful":0,"cool":0},"vCkdkMu9Sl-l8pWKBL9Byg":{"text":"I grew up visiting the Audubon Aquarium of the Americas many times as a kid. Now that we a","useful":3,"cool":2},"19c8a8lfBag48Nn6kKvi-g":{"text":"We had a city pass and needed to use one more activity before we left New Orleans so we de","useful":0,"cool":0},"iRYdYjX1vOg1rGX7AFKS-w":{"text":"Good crowd\nVariety of fish and activities \nAmazon rainforest themepark was excellent \nShar","useful":1,"cool":1},"rEClsoh8IJMFjJalbwf1mw":{"text":"Lackluster at best. The otter feeding was cool. The rest of the aquatic life can be found ","useful":0,"cool":0},"J_EOo81KBJuOw0lUn3YGdQ":{"text":"Fish are fish! My husband is a New Orleans native who always love coming to the Aquarium. ","useful":1,"cool":1},"xh8uSvpz_jZdB23SH7ZzUw":{"text":"The layout of this aquarium was navigable and interactive. The wait was a little long in c","useful":1,"cool":0},"YGEiBFWPI5UVuiEEqyAvwQ":{"text":"I love exploring aquariums in different cities... my husband and I were in New Orleans for","useful":3,"cool":2},"WBDTEmclhAjS7kwAYJ3rtQ":{"text":"I'm writing this review from a bit of a specialized view. I took my cousin to the Aquarium","useful":6,"cool":7},"d8ZUOMgF1iUxRltmNPv_vg":{"text":"Pretty expensive for such a small aquarium and many empty exhibits. Almost 100 dollars for","useful":0,"cool":0},"3Ii4w-6V-dBOnjrNj6UjWg":{"text":"Coming from Chicago, this Aquarium has nothing spectacular. I like the layout and the desi","useful":0,"cool":0},"_VvbkYNJalXrXpRR64DmZQ":{"text":"Very nice Aquarium. My kids enjoyed it. It was definitely worth the price. It took us abou","useful":0,"cool":0},"q8f8F_0hOYlyRwLarNb-vg":{"text":"Beautiful Aquarium, Parakeet Point was probably my favorite part, it was fun interacting w","useful":0,"cool":0},"-yZGwoFdRxRcP3nuiQXDjQ":{"text":"Nice little aquarium! Better than the one we have in SLC,  but not as good as San Francisc","useful":1,"cool":0},"tJYy3c86FCc82nz0pn3Cag":{"text":"Came here about 8 yrs ago.  I can't remember but I thought I liked it back then. But for s","useful":5,"cool":3},"3cAHgJXalN2Vw_hJtB4xMA":{"text":"It's amazing to think that they basically had to restock this entire Aquarium after the tr","useful":7,"cool":5},"RCzihxHu_G14qE_Vm7schQ":{"text":"The best part of the Audubon Aquarium is the local wildlife section that shows the fish an","useful":1,"cool":0},"-4Ll-Mg9BtwKKNkWLcS83g":{"text":"The Penguins were the highlight of the aquarium, they are very friendly and active. It was","useful":0,"cool":0},"UMSCyOdAk6ZsI60EA7Dy_w":{"text":"This museum is very tiny. There are nice exhibits of the otters and sting rays. I wish the","useful":0,"cool":1},"XMW5CB_Tv6EzPF-fsGEqFQ":{"text":"Had a very fun time in the H.A.R.T. Escape room, Robert was very kind and worked very well","useful":0,"cool":0},"8dQPp7cDqRtON3fPctHxIw":{"text":"So much more than just an aquarium. On a short vacation to New Orleans, this placed turned","useful":3,"cool":4},"gOm_jv5fMC_k6Gz1UxFsBg":{"text":"We ventured over to the Audubon Aquarium of the Americas because we were staying nearby. L","useful":6,"cool":3},"vYVFqUVXxStxRmVZZJQRSQ":{"text":"The sea otters, Buck & Emma, alone make this aquarium worth the price of admission.\n\nOne o","useful":2,"cool":3},"f2uo-bD8LcRxDmfdGw-btA":{"text":"If you compare this to the Shedd aquarium in Chicago you will not like it. Much different ","useful":1,"cool":0},"NLu3p0YuJc9AGSMDvSix1Q":{"text":"Does not compare to our aquarium in Chicago or San Francisco\n\nSmall cramped and overpriced","useful":2,"cool":0},"8VfnC6w4gaXzXN6UZ91E-g":{"text":"When I mention that I visited the aquarium while in NOLA, they will indubitably ask my tho","useful":0,"cool":0}}