{"XtukK3sBhZ-T6EDJVDiEow":{"text":"If you really want to learn  some history and interesting facts book here!! Dennis is amaz","useful":0,"cool":0},"jCR1yO6RBU7f7pC6hHGnKA":{"text":"Went to New Orleans for short vacation.  My son in law found there card and was the best t","useful":0,"cool":0},"1L6YVvZfiKtJcuwb9FebPQ":{"text":"Dennis was awesome! Thank you for the great tour last night! I learned so much about the h","useful":2,"cool":2},"wflRANwNpq7IKqrUDtN25w":{"text":"This was an excellent tour!!!! I can't express how much my brother and I learned from this","useful":0,"cool":0},"QUDu0bGYHZccL-Q9LhNfqA":{"text":"Dennis was an excellent tour guide. He shared so much history and culture with us. He took","useful":0,"cool":0},"2a6rcd14Dhg3CS2mNcltZg":{"text":"The best tour experience I have ever had. It was immersive, and very educational. This tou","useful":0,"cool":0},"YNOvrWVEu6Yd_fbiMsKBbQ":{"text":"I was super excited to go on this tour. Even though it was pricey, the pamphlet promised l","useful":0,"cool":0},"prpv7s8lsQbB5jRMHyy_Qg":{"text":"J A Y held it down !! If you a real one looking for a real good, genuine, and authentic to","useful":0,"cool":0},"HOBhqsHpAOsdhumNnMt_BA":{"text":"J A Y held it down !! If you a real one looking for a real good, genuine, and authentic to","useful":0,"cool":0},"LpnKgqF4AWG-4KwsxGqV6Q":{"text":"I recently had the opportunity to do the Spirits and Spirits (Ghost) Tour led by Dennis. F","useful":0,"cool":0},"l_bA3TkoI6dX9Bh68zti1Q":{"text":"This review is for the Spirits Tour. As other guests described, they are not great at comm","useful":0,"cool":0},"kQ2psGqhl2K-j11enk2LiQ":{"text":"Let me tell you, if you enjoy FUN, book this tour NOW! We booked and took the culture tour","useful":1,"cool":1},"gg7wozxwpXxCVrAyeonxlw":{"text":"My family and I throughly enjoyed our tour! An hour or so before the tour began, we got a ","useful":0,"cool":0},"X_NWBdwJ5WYskfuAg9ePeQ":{"text":"The tour with Dennis was top notch and he made it extremely special, allowing us to partic","useful":0,"cool":0},"Pkq5GnCU6-P0uve_BmBb_A":{"text":"Dennis gave an excellent in depth tour of the authentic New Orleans Black experience. He g","useful":0,"cool":0},"gxuthuQ1Dx3lpXPKleidjw":{"text":"My husband and I did the Celebrity and Culture combo tour. Dennis is so informative of the","useful":1,"cool":0},"3lTmMxT7T9C4HqJUGSSWEg":{"text":"Me and a group of 7 just completed the Urban Culture tour with Dennis! It was such a great","useful":0,"cool":0},"OzR4fM6hQ3JN0JMhbdDc_g":{"text":"This was a wonderful and cultural touring experience!! It's Black owned. When you visit Ne","useful":0,"cool":0},"z7npJrKYo_BaOT_iw-vz6g":{"text":"This tour was AMAZING!! Truly grateful for this tour! We learned so much & he took us ever","useful":0,"cool":0},"PuLoVuph3VxgcOHlqKP5iw":{"text":"Came to New Orleans for a birthday trip and booked 2 tours for a group of 7. We went on th","useful":0,"cool":0},"uXUFhjTnOGH64HQOD8Vx2Q":{"text":"Went on the  spirits-n- spirits tour \n The bus was super clean and the driver very friendl","useful":3,"cool":1},"ZFCTwfmRKMJhew7mNQVo9g":{"text":"I absolutely LOVED this tour, it was the highlight of my trip! I've been visiting New Orle","useful":0,"cool":0},"RGfUPEb4YUVNNh568OMdlA":{"text":"We booked the Celebrity/Culture tour and the Whitney Plantation/Swap tour through 2nd Line","useful":0,"cool":0},"R3HetJ5nCtDaEjM-fW_itA":{"text":"This tour was excellent! I found them on Instagram and wanted to try them once I was able ","useful":0,"cool":0},"itXb_r1Fd4kzdx8Q9uAQhQ":{"text":"With this being my first time in New Orleans this tour was everything!!! We did the celebr","useful":0,"cool":0},"US6RhyuIqAD8vT7vzTlUmA":{"text":"Our man Jay took care of us our entire trip. He was knowledgeable on the history of all of","useful":0,"cool":0},"_9H5uXiPOAN10N_oGvTcKw":{"text":"Best. Tour. Ever. Very in depth and true experience based tour. Dennis was on point with a","useful":0,"cool":0},"_7_0RrdTXZMrR0U57jZhMA":{"text":"Did the celebrity tour with my two girlfriends. Dennis did not disappoint!\n-Very personabl","useful":1,"cool":1},"fXIaI40nl5yd7wF-MkZyIw":{"text":"We did a combination celebrity & culture tour. Dennis was beyond amazing! He is now Uncle ","useful":2,"cool":3}}