{"lpAVl88Qt_sJiEkwG9nLkA":{"text":"We ordered to go at this restaurant bc it was just across the street from the hotel our fa","useful":0,"cool":0},"EFi5dkzEK1Mrf6gHRld3vg":{"text":"Food was bland and expensive.  Service was awful.  \n\nOur server acted like waiting on us w","useful":0,"cool":0},"ZLOKtJS-5qpk4BC08-YY1w":{"text":"The hubby and I had a pretty good dinner... decent service.  I always get irritated when I","useful":1,"cool":0},"XRKw2rzlrG497xGGEnLkyQ":{"text":"The lobster and scallops Mac & cheese was amazing! Their homebrew root beer was the best s","useful":0,"cool":0},"9sJUfBjbycntpcjs9EWhMQ":{"text":"I like the Marzen beer.  I came for a business function so the food was served buffet styl","useful":0,"cool":0},"_XXLz76BSgyt7SIw7stYdw":{"text":"This place was delicious! Spent a good amount of time here cause of the rain. First starte","useful":2,"cool":2},"vqSGIYId2fdkbAe3XU-A6A":{"text":"Really liked this place. We were there for drinks on a Friday night and the atmosphere was","useful":0,"cool":0},"-XhQBGI5gNTYLYgmE7sZjg":{"text":"Honestly for a brewery the beer was Ok and the food was great. We went there twice so I tr","useful":0,"cool":0},"sFaGpo8aR9CJ9ObM57rx7w":{"text":"I always enjoy a Gordon Biersch beer! Cool waitresses but they freak out and ignore you th","useful":0,"cool":0},"wam9FrtlwQ-VRmlPsjZ9xQ":{"text":"Came here after the Saints/Packers game. One would think that a brewery/sport bar would ex","useful":0,"cool":0},"BKXnuonIDPcz_1vjxAUovQ":{"text":"I had the fish n chips, it was a huge portion! The breading was nice and crisp, not greasy","useful":0,"cool":0},"eWD_ZCg4sbvcS6R96Wh-Yw":{"text":"The dish I ordered was bland. Bruschetta chicken with Jasmine rice. The rice was overcoook","useful":0,"cool":0},"8kB8xle1Y5NWu-JMB3bSpQ":{"text":"We're from LA and just looking for a quick snack and drink. Atmosphere is fun food is grea","useful":0,"cool":0},"049FtQyZ0CJntftu5dDYWQ":{"text":"Absolutely horrendous service. Servers staring at the TV. Our party of five waited over 40","useful":2,"cool":0},"0RTvcsrS9Q6nGRaZdRLfTA":{"text":"A sports Gameday favorite to visit with my friends.  Great cocktails and their known lager","useful":0,"cool":0},"Cwq33Ey-SGffIRylindVAA":{"text":"We had some good beer here, but the food left a bit to be desired.  I got the calamari app","useful":0,"cool":0},"C6AoNg-7hvq3F0cexlIw9Q":{"text":"Chain style food.  Friendly but rather slow service.  Requested substitutions on sides wer","useful":0,"cool":0},"MbNL_mNlPeCTRdRIjSiQtA":{"text":"Awesome place , great food, incredible view, the people are awesome, I need to come back. ","useful":0,"cool":0},"gBj4pFm9EWSqlO8yav8GHw":{"text":"The food was delicious, but the service was even better. Marlon was awesome....There was n","useful":0,"cool":0},"eeLejChX9j0KyjPsHCt1Og":{"text":"Went twice while visiting New Orleans for moose conference. Best foods. Fish and chips wer","useful":0,"cool":0},"kufsyzZRreZ7Djpvg-ZRYQ":{"text":"The Garlic Fries are awesome.\nThe chicken gumbo is pretty good.\nThe Burgers and Pizza are ","useful":1,"cool":0},"ofBR2Z8NObSXHDw9lCU82A":{"text":"Went for a late lunch. The place was pretty empty. We waited for someone to seat us for at","useful":1,"cool":0},"C92AXTe_OQlYFh3y7pO6PQ":{"text":"I dined here quite a few times the last time I was in New Orleans (either 2009 or 2010, do","useful":0,"cool":0},"cSh4DwijovlYjv6uGVFB-g":{"text":"Oh my goodness. We come to new Orleans often  the food was awesome here. The bartender was","useful":0,"cool":0},"KoxjTNyLHSLdFwJVjcZSbw":{"text":"Mediocre food, terrible management. Place runs about as smooth as sandpaper. If you come t","useful":0,"cool":0},"Tz6RGJUNF5geFmUUz5HBnw":{"text":"Quack!\nI have to say, all in all we were fairly impressed. Looking for a bite to eat later","useful":0,"cool":0},"Gl1aEbkwW1adO5l6xrtDGg":{"text":"We stopped in for a light meal and a drink. We sat at a table in the bar area. Service was","useful":1,"cool":1},"W60oKknTMa45ZlHvbIDp0g":{"text":"We came in on st pattys day. They run out of \"green\" beer and new orleans uncommon.\nAlso d","useful":0,"cool":0},"i12XfU7f3ut54bkucNDZsg":{"text":"Only get 3 stars cause of their handcrafted beers. Their food is sub par. They couldn't pr","useful":0,"cool":0},"3ZIK7AC-kHTtx56Zi6v5vg":{"text":"To my fellow Yelpers, just stay away.  Talk about awful service, awful food and beer fligh","useful":2,"cool":1},"DUc3usiNAC6TOHpF3xJFwA":{"text":"Nice choice of beers and good people watching in the outdoor seating!","useful":0,"cool":0},"3jWVFZn_xZTdamBhWiqOfw":{"text":"Great atmosphere and drinks, the food however needs a serious revamping. Medium steaks bro","useful":1,"cool":0},"oFrm4pfsKI1sPhZTdYJ5Qw":{"text":"Stopped in for a late night bite since this was close to my hotel and had to order from th","useful":0,"cool":0},"-_Jc8HhQxujO8RUgzKaREw":{"text":"Visited tonight and was very impressed.  Everything we ordered was excellent and the servi","useful":0,"cool":0},"F-eHTi_TyRSHYAu81vW_oA":{"text":"Here for Amerivespa. Got back to room late and was looking for a place to eat around 10pm.","useful":0,"cool":0},"vdw-iUUGvNT1hXgBaUkJdw":{"text":"The elderflower cocktail\nThe cob flatbread\nBad ass Mai Tai s\nNuff said\nThis is a cool plac","useful":0,"cool":0},"vsUaUvmSIwVdF0r3ENphMA":{"text":"So, I actually didn't high hopes for this place, especially from checking out the reviews ","useful":1,"cool":0},"io5smjudmDKiY-dQzIUZhA":{"text":"Really good beer.... German style backbone and have added IPA and Belgian.   Delicious bur","useful":0,"cool":0},"3BOT3zKMUt3OfvEo_fZgWA":{"text":"We went in last night after spending some time & money @ Harrahs. We had eaten earlier but","useful":0,"cool":0},"G5v6xqVMCSOg4_wzngYxGg":{"text":"Very good food and perfect if you eat late! Open til midnight with a full menu available, ","useful":0,"cool":0},"PBxyr-rVHwN8wsc79vttlA":{"text":"Had the worst ever lunch from there today. Co- worker had to go downtown today and offered","useful":0,"cool":0},"7Kbobh0a38ghLJEJZEN9gw":{"text":"Very difficult place for me to ever go back to. The facility is awesome. However, the bar ","useful":0,"cool":0},"NYqUcTfagaM5aeB2sNfD2Q":{"text":"Great atmosphere and of course the Beer is AWESOME!!!\n\nWe only stopped in for a couple of ","useful":0,"cool":0},"q6NiPUTgyRcHtYW4iIc0Sw":{"text":"Food was a BIG disappointment !! To say the least. I feel sorry for tourists that get suck","useful":0,"cool":0},"y27mJ8owtPpXbeR2BslR6Q":{"text":"I enjoyed this brewery. I learned that it can be found in several cities but this was my f","useful":0,"cool":0},"hL9NvtUrbNWDJ2JKyVwT0w":{"text":"I came here for lunch with my coworker, and I had the grilled chicken sandwich with the ga","useful":0,"cool":0},"2iV3OcNDWvHFX3kp-yqDzA":{"text":"During the visit to NOLA we visited Gordon Biersch several times. The outdoor seating and ","useful":0,"cool":0},"Pxv9rjT3FLGrX_KVntkMDA":{"text":"It was alright. Nothing special. Wish we would have went somewhere else. I had the chicken","useful":1,"cool":0},"UPSAgDCPNYGLWblVKFM61g":{"text":"went on a sunday.  bleh.  it was like I was doing THEM a favor by eating there.  \nhad a sh","useful":0,"cool":0},"-WGj9yda0IVTPzzEY4XLVw":{"text":"Great service, beautiful restaurant, food was mediocre at best. Great place for drinks, sp","useful":0,"cool":0},"JemkHJ6kCkN8W-xiTPSmpA":{"text":"Horrible. Sat down at a dirty table. Been here now for 20 mins and haven't had any wait st","useful":0,"cool":0},"pVj_6CXJXFoP5ouVzF4lFA":{"text":"I wanted to like this place but it was just ok. I had a grilled cheese with bacon that was","useful":0,"cool":0},"Dhc2jLaH5kX82J_7ddADRQ":{"text":"I've got this place figured out.  Seriously.  If you like steak and you like beer, just fo","useful":9,"cool":5},"96KXckbJjNSDw9m6GeFYrA":{"text":"Steak was burned, potatoes were cold. Not impressed","useful":0,"cool":0},"C_66FsCFA1NVYZlecGgllA":{"text":"Finally, a place I am comfortable recommending. \n\nAtmosphere      80      Hip, up to date ","useful":0,"cool":0},"PaSSsM_HXgoVapgEmkRxJw":{"text":"Beers are really good (if you can get served) and the restaurant is a nice escape on a hot","useful":0,"cool":0},"hboJdWIrL7G8uVUAiBUlPA":{"text":"My boyfriend and I went out for a late dinner after work. I'd been to the restaurant befor","useful":0,"cool":0},"lWEuIBU3BN95tFD_3gBsQg":{"text":"Went in for a late night snack and drink. Hit the spot. I love the garlic fries and Hefewe","useful":0,"cool":0},"GzwYRkJ_NCBFphknZp9emA":{"text":"The outside in Canal St looks very appealing, sadly the service inside in appaling. We had","useful":0,"cool":0},"mEs4kNUacaTvUz_Bzzv6fQ":{"text":"Very good for enjoying a beer in a terrace.  They brew their own beers which all won medal","useful":0,"cool":0},"yYTIizC4AUYq6IzZaqSM0A":{"text":"We stopped here for some beers and it was fine. The atmosphere is like a sports bar, which","useful":0,"cool":0},"Yhi08NwICgztIFWtJsi9Kg":{"text":"A HUGE THANK YOU to the entire staff at Gordon Biersch Brewery Restaurant in NOLA!!    My ","useful":0,"cool":0},"a7ebRuMC8UDcKsAOAnmBlw":{"text":"Our appetizer came out at the same time as the entree. I wouldn't have minded if the serve","useful":1,"cool":0},"7D2LwbyUV0CnttzFn6xttw":{"text":"Delicious food! I recommend the Lobster and Shrimp Mac-and-cheese,  which can be split bet","useful":0,"cool":0},"uEBFMNFL3W0PQFRnfFV1uA":{"text":"I don't typically eat at chain restaurants when I'm out of town but was in a hurry. Our se","useful":0,"cool":0},"134wlc2M3RE0FksDlN8IIw":{"text":"It is a chain restauraunt, buit they make beer so i'm conflicted. The garlic fries were go","useful":0,"cool":0},"d8WLbN8Mb3ZTQglnx8nj0Q":{"text":"Ate here a few years back and LOVED this place. Raved about it to all our friends. Had som","useful":0,"cool":0},"qqlG5-qP9grVKusC33uwgA":{"text":"Great food and beer. Trevor was a prompt and accommodating waiter. The craft brews were pl","useful":0,"cool":0},"tIpE9GFC8ufpiPfSQpcqEA":{"text":"Meh. Ate here with a group of 20. They seated us right away on a Tuesday evening so they g","useful":2,"cool":0},"9mCBnfCUQFUo6wVCgjhajg":{"text":"I love this place! Lots of food options, so it's good for large groups that need to please","useful":0,"cool":0},"aaNztSAQPudtR72SAL_LeQ":{"text":"A very unremarkable, bland chain restaurant. They offer free garlic fries as a yelp app ch","useful":2,"cool":2},"SzTPRlPBo6rG2ghITOSrkA":{"text":"Um yeah. I have now eaten here and I can say with full certainty that this place sucks. We","useful":8,"cool":3},"xivpFWJDIE2kMJVGlcOdjA":{"text":"We had lunch here yesterday and we came back today.\nThere is a nice selection of beers at ","useful":0,"cool":0},"We8LNo2NBavlgpCksEVkFw":{"text":"We came here because we are lazy and we were staying at the hotel right across the block. ","useful":0,"cool":0},"326M5wj4edly9mLu6JD1KA":{"text":"Excellent as usual.  The Maibock never disapoints, always one of their strongest seasonal.","useful":0,"cool":0},"iU3ZkYBqFdIx_rQ05Nychg":{"text":"This location is definitely tops on my fav list.  Never disappoints even during events. Am","useful":0,"cool":0},"BA4v0pzzp87jDay3lHhdHA":{"text":"Excellent lite microbrew beer, cool place to watch the game and have a beverage with frien","useful":0,"cool":0},"QWhFQSXqD6YQN8Uabtl5QQ":{"text":"Friends, food and football. And beer. That was the on the menu for last night. Bunch of gu","useful":2,"cool":2},"Wn9A1HYAewQQ8PS8DL73mw":{"text":"There is a reason why it has three stars on Yelp. Below average food and below average ser","useful":1,"cool":0},"iPhsjqhirmiQPUa-YXyHIg":{"text":"Meal was okay. My issue was the cocktail. Ordered a long Island with cranberry and first o","useful":0,"cool":0},"PrKSBqcYOHm8SWYEVstUeg":{"text":"Food was great. No long wait time. Servers were extremely pleasant. Would definitely recom","useful":0,"cool":0},"uyXON5NBr7yZdAQJ-mhwJQ":{"text":"Service is great food has a great deal of work !!! I live close !!! Sad !!'","useful":0,"cool":0},"Qog2i758qtagp-o4aw0r2Q":{"text":"This is one of the Best Restaurants in New Orleans.My friends say i have stock in this pla","useful":1,"cool":0},"TDLRDPTDXccwV1bjoqE-dg":{"text":"I went back to Gordon Biersch for a pre-birthday dinner since I enjoyed myself the previou","useful":3,"cool":1},"kDk5_eupO-q4IWAUxSEcWA":{"text":"I ordered the bbq marzipan chicken sandwich w/ garlic fries. I love their fries ! Nice loc","useful":0,"cool":0},"ITYYK2mnv-J4Po9nkbsghw":{"text":"This place will barely do when options are very limited. I stayed at a hotel nearby so my ","useful":1,"cool":0},"NXSTIy9mjXqS--svxRTekg":{"text":"I stopped in to watch a Sunday night Saints game and try some of their beer.  This place w","useful":0,"cool":0},"Oay62zi7ypL626TBLtkAQQ":{"text":"If you've ever been to BJ's Brewhouse or any other chain microbrew restaurant, you know ex","useful":0,"cool":0},"VZx94M2taVKifHbnibzeTg":{"text":"I had the chicken sandwich and it was delicious. \nI should have gotten the sweet potato fr","useful":0,"cool":0},"qpl9PB4WU-x9UzQO0JYdQw":{"text":"I got a great salad here, very reasonably priced and a good size.  This place is within wa","useful":1,"cool":0},"QIWhvICZAAjmH2VeFtkeqw":{"text":"We came here during Mardi Gras so they only had a limited menu, but it was still pretty go","useful":0,"cool":0},"hvRwl8XWUoJl046dpBxAGw":{"text":"I went with 3 other people. Two of them had been there the day before and said their bar f","useful":1,"cool":1},"kVhcLz8ttCdem78QiesmjQ":{"text":"It was a hot day waiting for the hop-on hop-off bus, and the thought of a glorious refresh","useful":0,"cool":0},"WLx9N5ndzDBtAbFQa9b46g":{"text":"Nice restaurant with a good beer selection. We received a free garlic fries for the checki","useful":1,"cool":1},"UTOa8DNUeLfxxLqphficyg":{"text":"From start to finish we had a fantastic experience.\nOur server Cora greeted us promptly wi","useful":0,"cool":0},"jF_XeLT8aHgOiP3HGtc8uA":{"text":"7/29/11 - To drink I ordered the \"Reposado Tequila\" Margarita and it was great.  There are","useful":0,"cool":0},"zpRqF-_95hWrKN3vDCmWYQ":{"text":"We had a reservation and were seated as soon as we arrived. They had a large happy hour cr","useful":0,"cool":0},"GJophWqvLVzfHfxij03FsQ":{"text":"Great burger!  Blue crab and artichoke dip was yummy!  Turkey garden burger was good.  Tur","useful":0,"cool":0},"0_H34rjksehN-YiJ-LuV3g":{"text":"Ate dinner with my 14 yr old son. Enjoyed the steak tips. He had the bbq burger. We told t","useful":0,"cool":0},"79XuB8SM9BaXYygPV7Bu3w":{"text":"I make it a point to go to Gordon Biersch once wvery time I am in New Orleans amd staying ","useful":0,"cool":0},"MpJgssDmOX-8udociiNYaw":{"text":"Horrible! Just went there this Saturday 0n Jan. 30,2016 and I don't know how this place is","useful":0,"cool":0},"dlv_npkAhGkhZKpz3btQfg":{"text":"Good Selection of Gordon Biersch, parking maybe a hassle, but the environment is good. The","useful":0,"cool":0},"hhDG-U2Mtx8o4IsqiXFACw":{"text":"Went last night for dinner, service was great (we were a group of 9) and our waiter got ev","useful":2,"cool":0},"sP5fp9FMjKVzj4XVyWuHDw":{"text":"This was undoubtedly our worst experience in NOLA, there was mold on the appetizer bread, ","useful":1,"cool":0},"4A7VAEZsTZiyy0QJ_H0PVQ":{"text":"This is the fourth GB I've eaten at and I hope it isn't a company trend.  The location is ","useful":0,"cool":0},"HByG1_YofL-hiGS6Siv96Q":{"text":"My husband and I were visiting New Orleans with a group of friends for Jazz Fest last week","useful":1,"cool":0},"X0_3X_n_hLDXrp6Mtf8ECw":{"text":"Was here over the weekend in New Orleans. \n\nThe good- wait staff was friendly and prompt. ","useful":0,"cool":0},"8PZC8cK77zjG3eUAR_eV8A":{"text":"Good as expected! Enjoyed my winter bock beer and the server was also sure to tell us abou","useful":1,"cool":0},"MepPVX4BRGfU5jK4jpmZxQ":{"text":"Had the steak frites with garlic spinach - thought it was just okay. Microbrews are decent","useful":0,"cool":0},"WeY3egzIJSyJqekR2PRYrQ":{"text":"My husband and I came to watch the FSU vs OKST game. Our waitress (Rachel) was awesome, th","useful":0,"cool":0},"fQyTDAXQEA3gcZcfAGoFrQ":{"text":"So you think brewing their own beer isn't a gimmick, a palatable artifice to make the stal","useful":4,"cool":2},"Bcvp0YSU6mSj-Q8U2hYm5A":{"text":"Don't bother coming here.  Looks like a good place to eat but food was horrible.  Unless t","useful":0,"cool":0},"9YOOxNEk4SDUDu8DPeFVLw":{"text":"I'm surprised to see such low reviews but of course I was skeptical to go to GB in the fir","useful":0,"cool":0},"Yfyn-NjIVQvxWBLo7fmzdQ":{"text":"Love the shrimp Alfredo. New Orleans has a bunch of different place to eat shrimp but this","useful":0,"cool":0},"wcksSN4NFVLHX0f8azRa3g":{"text":"Not a fan of this place. Service wasn't great and the food was not good at all.\n\nOnly perk","useful":0,"cool":0},"4flKRny-OoJnLnNm4h89fA":{"text":"I usually avoid chains but this place is perfectly located with a nice outdoor patio area ","useful":1,"cool":0},"t7d0fFkQAXat5YdSLg177g":{"text":"I was in town for a convention and there a 30 minut wait at the hotel dining, so I walked ","useful":1,"cool":0},"Xpba2TmzL4yPm3504ShuOg":{"text":"Came out of Jazz fest starving. Hosts very friendly but waiters service extremely poor. Ha","useful":1,"cool":0},"z4pbZL461eJorhKWW4xh4g":{"text":"Crap food, can't believe it's a la carte and that dang expensive..Fleming's or Ruth Chris ","useful":0,"cool":0},"l6suAsgrpHhc_OaMbpjvGA":{"text":"Stopped in for lunch and it was pretty good. Service was slow and our waitress was profess","useful":0,"cool":0},"oE-yfdWXunMOp4Pd9PKvOA":{"text":"Got there late with a very large party.  Had no idea it was close to closing.  The very ru","useful":0,"cool":0},"9IdMRvABmv-2sn2DE8EcpQ":{"text":"This place is the absolute worse. Two star rating is generous. Ordered  an overpriced burg","useful":2,"cool":0},"50E4ukPksabhaqYarc9woQ":{"text":"Waited forever for our food and when it came it was still wrong. No one cared and no one a","useful":0,"cool":0},"8DIqVDq8VPzmYv0mCCd-sg":{"text":"Couldn't even chew the steak and it was a ribeye, which should have been tender. Not impre","useful":0,"cool":0},"rAuy3SDcd-l2gvIGPIIXwA":{"text":"This restaurant was on the way back from my hotel after a volleyball tournament at the con","useful":0,"cool":0},"JADjDUAOlC05lx7_mZrSlg":{"text":"Was a solid place. We needed a place to watch the Saints-Falcons game and also to kick bac","useful":0,"cool":0},"Lzw_GBpWPaH3lA48L5Hzfg":{"text":"Went to this place last night after a flight in from Nashville. Wow! Will be going back be","useful":0,"cool":0},"SyuwqnXBbhztl0KfrVQ3vw":{"text":"Kandice, was a very good server. Alway on point. The turkey burger was delicious, the new ","useful":1,"cool":0},"v2HNwFIHy9aolWs95ZfjpQ":{"text":"Horrible service and they ran out of Ahi Tuna so 3 of us had to change our orders midway t","useful":0,"cool":0},"6lTRQeKqMi4ItM_wZVvxAA":{"text":"My family and I came here to escape the madness of the french quarter, and it was deliciou","useful":0,"cool":0},"t-utNjq-9mPdKfSU32B6Wg":{"text":"Ehhhh...\n\nWe didn't know this before we ate here...but this is your typical brewery chain ","useful":1,"cool":0},"YDZFGnIRjblUN-znveA7Dg":{"text":"Delicious food, cold beers and Scott tending the bar made for a delightful experience.  Ev","useful":0,"cool":0},"rohsJw5IKfoPgAFPDhTIMA":{"text":"Garlic fries are great but service was terrible. Don't try to joke with Ronnie the server ","useful":0,"cool":0},"BINfMnPj6_NaI7m5y51wmA":{"text":"This is a pretty good restaurant! It doesn't feel like a chain restaurant, even though it ","useful":0,"cool":0},"cWmSecm9CwNQS99Ty93E4w":{"text":"Wonderful place to have lunch or dinner while watching a sporting event. The food and serv","useful":3,"cool":0},"UJAHMoMfIxGXmGzR9sEvnw":{"text":"We stumbled on this place. Cute atmosphere, but kind of dark inside. The food was good. I ","useful":0,"cool":0},"eJSH6VnfmVE22MNYQMOUxQ":{"text":"Terrible. The cheeseburger took 50 minutes and was barely warm. Wrong kind of fries. Didn'","useful":0,"cool":0},"0ZWVwjb8VJOutIVL69jDWg":{"text":"Great and Tasty Beer Selection nice Bar! Would come back.\n\nThey having owned brewed Beer w","useful":0,"cool":0},"uYaXKGyGsT6C92xFAiCcjA":{"text":"We had to stop at the brewery while in town.  We enjoyed the beers, but my allergies were ","useful":0,"cool":1},"ucND17myRlT0LOol1D202g":{"text":"I've been to a few of these places that had just the bar and a limited menu but last night","useful":1,"cool":0},"n89Ak4lhJb9ua0NGymPqFw":{"text":"Gordon Biersch Restaurant and Brewery next to Harrah's is awesome, the wings have a this s","useful":1,"cool":1},"eqK6b9DyE_Yrqbkdyf5CpQ":{"text":"Agree with Yvonne P. Never been to this chain and went in for a quick bite after flying in","useful":0,"cool":0},"axquAF3WdV2gAQl8z_DHug":{"text":"Ate here for lunch yesterday.  Nothing too exciting.  With all the wonderful local cuisine","useful":0,"cool":0},"FpbKHPRPNUQVls7iVAbQMA":{"text":"Food here is excellent as is the in house brewed beer.  The seared Ahi tuna is amazing.  I","useful":0,"cool":0},"tYF65iXPvL3tKHCHzhivRQ":{"text":"Servers are excellent here.  We returned twice with both servers providing top notched ser","useful":0,"cool":0},"9RequlqTM9xCh11cSxdo3A":{"text":"Horrible hostess--simple not interested in helping people or being there period! Four star","useful":2,"cool":0},"dECbOmG6EdtPkP-A-Cyt1Q":{"text":"Terrible service. Bad food. Anything is better than what they serve here. \nI ordered a spi","useful":0,"cool":0},"KZKaOLsvpxRktT2RU2K9OA":{"text":"The garlic fries were garlicky. Wow. Good burger.  The atmosphere was good and our server ","useful":0,"cool":0},"-sg9p0daSuVWdgl0Sg_svg":{"text":"A few friends and I stopped by for a few drinks while in the area.  I used my free garlic ","useful":1,"cool":0},"6VAZ_SfjOZUfjSzEAjfB2A":{"text":"I am a native to New Orleans. My fiancee' and I frequent the place. The fresh Ahi  tuna an","useful":0,"cool":0},"IbQS6O8aJkqiL2DtSJezng":{"text":"Never been a huge fan of this chain, but this one wasn't too bad. I was in during a slow t","useful":0,"cool":0},"YlOL9DSyc63w7M6Qkd6x7g":{"text":"This used to be a great place to go.  They had a great beer selection and the food was goo","useful":0,"cool":0},"fg8i8YrsLChaD_TWpq9Kpw":{"text":"We go here quite often.  My man loves his beer, what can I say?    It is really kind of hi","useful":0,"cool":0},"PxWMgMJBWyXWz81CTAeVGA":{"text":"I'm a regular love this place I always ask for Janis , Jeff , or Cora as servers love them","useful":0,"cool":0},"nCZtElfW-rwFupn1qKqW-g":{"text":"The house salads are SO good, nothing fancy but really hit the spot. Also the check in bon","useful":0,"cool":0},"xYID2PyoKLxJLnuRpSF2dw":{"text":"OK for an amplified burger and beer joit.  Beer was good.  Brewed on the premises.  My bur","useful":0,"cool":0},"y3NKmHx3m4chcEgWm2zLEg":{"text":"Good service and the portions were huge.  Lots of beer to choose from and many options on ","useful":0,"cool":0},"ckgR9GxRdqm-LWwTa8RKlg":{"text":"I knew this was a train wreck the minute we walked in. The hostess refused to even acknowl","useful":2,"cool":0},"Ag5fzAMK5w4-iSHeyQnAyg":{"text":"Across the street from Harrah's casino. Walking distance so decided to stop in for dinner.","useful":0,"cool":0},"_zvoi23GQGnSuTRLCgkeSA":{"text":"We were a party of 6 dining before the SugarBowl. We were seated immediately and hosts wer","useful":0,"cool":0},"MBmEw39HwsBPmSsEKfqdWw":{"text":"I have been to other Gordon Biersch and went to this one because it was close to my hotel ","useful":0,"cool":0},"BE0FJgmdWXIz5AkXw43RGw":{"text":"3 stars is solely based on the burger, it was great. Everything else left a lot to be desi","useful":0,"cool":0},"Y_E9YuXLCTwH1kHcQ0xfLQ":{"text":"Came for dinner around 7:30 & seated with no wait. Received garlic fries as a complimentar","useful":0,"cool":0},"SfKOjZKYpfSJqtu6ovUYnQ":{"text":"I'll make this simple I like the food and the in-house brewed beer but the service at the ","useful":0,"cool":0},"Kdh1Z2BoKXbZ1fST8oMtlQ":{"text":"Mindy is awesome.  I normally sit at the bar because I am needy---but Mindy was all over i","useful":0,"cool":1},"NAhO-w9SoZqheIAFvru-WQ":{"text":"I understand it was the superbowl and they weren't as prepared as they should have been, b","useful":1,"cool":1},"igkIHUVOpil3vUcUdHuIMA":{"text":"Horrible service and they ran out of Ahi Tuna so 3 of us had to change our orders midway t","useful":1,"cool":0},"hhCdglA68LwT1HU40kJn_A":{"text":"Ate here a couple days ago. Solid performance if u stay away from the higher priced entree","useful":1,"cool":1},"1Mlag62AedILw24Ft65C3Q":{"text":"Food is usually better from past experiences. Not impressed at all this visit. Waitress wa","useful":0,"cool":0},"sDDDp4LtMphwO8KcSqbhUw":{"text":"Horrible management experience.  The manager on duty was inept and not hospitable. The ser","useful":0,"cool":0},"ZQKlSqSMQbW2CDMZeXZQCA":{"text":"Quick and friendly service. The Cajun Fish Tacos and Sirloin Tips were expertly prepared a","useful":0,"cool":0},"pZIIoXjDryF4xDSIuam7hA":{"text":"Typical brewery food.  Nothing bad to say but nothing special either.  Adequate lunch spot","useful":0,"cool":0},"ZXaTrj3-vKJy6Fuc2BE0rA":{"text":"We stopped in for lunch and had their chicken blt sandwich. It was really good but the fri","useful":0,"cool":0},"g1d6MFFqKP2ovaB8WxoOOQ":{"text":"Came a few weeks ago with my Mom for a quick lunch before flying home. The menu was so goo","useful":0,"cool":0},"2UTxI-71PHbU-loSTyyu5w":{"text":"I tried the jambalaya with orzo..very spicy! I really should of come here for their beers ","useful":0,"cool":0},"B2r48bQ9-9b_-SYOYFMIWg":{"text":"Wait was a little long considering it wasn't busy. Food was pretty good, wish my toast wit","useful":0,"cool":0},"d7BMBSToB2CDEDXwNKMpdg":{"text":"Terrible yet expensive food. The seafood Cobb salad I had was topped with thawed frozen pr","useful":2,"cool":0},"1SsXgHibilY6YUwNVRSjtA":{"text":"So I understand that this is one of the big dog restaurants that you have to come visit if","useful":0,"cool":0},"5TJCw3iP4WwfFHEjpGuWgA":{"text":"Great service sitting at the bar! We ordered shareable menu items- bbq chicken sliders and","useful":0,"cool":0},"qBYlejonItvQBNgc4v9xIg":{"text":"Terrible experience.  One dish sent back and I should have sent my burger back.   It was l","useful":0,"cool":0},"dnLFc3Qf3A-xKPOJ3yny6g":{"text":"I've been to Gordon Biersch once in the past and I don't remember it being bad on that vis","useful":1,"cool":0},"H4Ijg8YQUcxrYQjge7-m5w":{"text":"Stopped in here  for an appetizer and beer. \nMy server, Raelyn, was SUPER friendly and che","useful":0,"cool":0},"13ISAOrCesaOhZBXWjmzyg":{"text":"The food was bad but luckily the service was terrible.  :(\nWe had fish tacos, cajun pasta,","useful":0,"cool":0},"QzBsKedrKQKK9NJtXbdIXg":{"text":"We will come back for lunch tomorrow . This restaurant is Close to our hotel lowes new Orl","useful":0,"cool":0},"u3YKqwUK_bLtkQqwJpStYQ":{"text":"Save your money and go somewhere else.  Food was okay.  Service was slow and unfriendly.","useful":0,"cool":0},"Yat2eI4gg7_oh5kcgQAiLA":{"text":"I ate here once after the Hornets watching crowds had left, so the staff was probably tire","useful":0,"cool":0},"cPMP42oQpK570HlatfPn-A":{"text":"Food was pretty good. Calamari appetizer wasn't very flavorful, however the chicken wings ","useful":1,"cool":0},"wZh9YvRL_T74pn9O3A2JFA":{"text":"For good all-around food, come here. I came here for my 21st birthday a couple of years ag","useful":0,"cool":0},"nJ_B-FWETQNitwPsUyc59g":{"text":"Let me start by saying I'm very sad to give this bad review because I used to love this pl","useful":0,"cool":0},"bGUcWRukOFZ1qml_I-dx-g":{"text":"I enjoyed my avocado chicken sandwich. It was a little messy to eat as a take out item. (I","useful":0,"cool":0},"Z7yFz6j4CwgodRPZVwMXvg":{"text":"I was really was taken back by how good the food was here. I was really expecting somethin","useful":0,"cool":0},"w39uz4bJjyRd5KUgqYRR5w":{"text":"I ate at the bar. The bartender recommended the fish tacos. Which were a really good choic","useful":0,"cool":0},"mMcauy4bWB9K3P0LL4H2Og":{"text":"I had the opportunity to eat at Gordon Biersch for first time on 7/17/2015 for my brother'","useful":4,"cool":4},"RgKmQf40aNN5orUPGP4TuQ":{"text":"I had the gastro pub burger and it was awesome!   Cooked the way I like (medium rare) and ","useful":0,"cool":0},"hid23ofDKFDAQp6-pOZE1A":{"text":"A group of 4 of us went here on Sunday to find a place to watch a football game. In terms ","useful":0,"cool":0},"2OpTAMPt1VTCv-Wt8qcEiw":{"text":"Great! The waitress acted like they committed a crime by having my beer out like 2 min lat","useful":0,"cool":0},"ErbQDw82D86rKk_J2A2Ljw":{"text":"So let me start by saying that the service tonight was wonderful. Janice did a terrific an","useful":0,"cool":0},"_wUr4vk3tYJ6d2VvQR6HIg":{"text":"Prices are reasonable. Service was good and kitchen was timely.\n\nI had the Mediterranean p","useful":1,"cool":0},"L7Y8Who1rRu5zXyfA6NLVQ":{"text":"Ate at Gordon Biersch  near the Hilton first night in town.  The fish & chips I had were m","useful":0,"cool":0},"dUYp3cQwqXakmkLMSOQ7OQ":{"text":"Great service but the main courses were Ok at best. We started with a free appetizer court","useful":0,"cool":0},"jNMxd5PnpwXlyK5GFACZKg":{"text":"Stopped for dinner on a Friday night. We are a party of 6.\nService was slow, not very atte","useful":0,"cool":0},"aFi0XEdWNFbyYY1NK1aI6Q":{"text":"Went here after walking the \"riverwalk\" (it's just a mall). Was not impressed at all!  Foo","useful":0,"cool":0},"3Y8TGjQH35kppGJB8Ge-FQ":{"text":"Was visiting from out of town and stopped in here for their happy hour specials.  Service ","useful":1,"cool":1},"ns6kEhq25JB2SaYZQS-5tw":{"text":"Awesome atmosphere and service!!! Theeee best fish and chips around!!!! Great ambience eve","useful":0,"cool":0},"EKorDtRLK6Oje9T-DIcdHQ":{"text":"Too many good restaurants in NOLA to waste money and a meal at this place. Went to watch t","useful":0,"cool":0},"9dTYOO-GaFHMKpVHpAAA_g":{"text":"Some thing has gone BAD wrong! Walked right In for our reservation and sat down. Then we w","useful":1,"cool":0},"tHYLhH9SoA-_GurgSx9ucA":{"text":"The outdoor seating was a nice touch. The food was just ok though...there are so many othe","useful":0,"cool":0},"-2fj6ENI5-0ueGFeyiH9FQ":{"text":"Went on a Thursday night, no overly packed. Still waited for 30 minutes due to a very conf","useful":0,"cool":0},"xEErHjwZR5OBDZjbHV8asg":{"text":"Lots of chiefs few employees who seemed properly trained in right place right time .\n\nPast","useful":0,"cool":0},"97TZovodHi13ws6P4WzSrg":{"text":"First of all, its loud. its loud in the restaurant and its loud in the bar so just be awar","useful":0,"cool":0},"SbD70-c_Lc-EePmd1Y1kNg":{"text":"This is a great place for a drink. Scott is the best bar tender. If you go ask for him! Th","useful":1,"cool":0},"ard5OGLyz8pZ6N6P-nL0dg":{"text":"Staying at the Hilton we stumbled into this place ..they had a great beer selection and th","useful":0,"cool":0},"1L9oK9aROAAdRsCZXZLLVw":{"text":"Oh, how I love you garlic fries and beer of course..... The service was awesome and very h","useful":0,"cool":0},"Dcz_EdT8vfiPnN0xrw-VLg":{"text":"Came in for lunch during Mardi Gras. The service from our waiter was not the greatest, but","useful":0,"cool":0},"DZ3qtnycLvz6gvCk8K8J8Q":{"text":"Were out of almost everything but it was good food. They had good bratwurst. Definitely re","useful":0,"cool":0},"k8fkFXRXcTbN9M6Zzjo9-g":{"text":"I've been here a total of three times and three times something has been wrong with my ord","useful":0,"cool":0},"0Ber-V7UFvVf_Y6UagvE4g":{"text":"Wish I was able to talk to a manager but Jocelyn wouldn't transfer me when I called right ","useful":0,"cool":1},"B__23VaC8IkmXgQ39QoIGg":{"text":"Went to this place last night after a flight in from Nashville. Wow! Will be going back be","useful":0,"cool":0},"HPTBib-YWY8q-uxBU04x4g":{"text":"I'm so torn on this place.  They are NOT BAD.  The food is good, but unimaginative, standa","useful":0,"cool":1},"rXvdrqmgpBQ9FhrJCoLCdw":{"text":"Always solid American fare. Great selection of their own beers, and garlic fries, wow!\n\nNi","useful":0,"cool":0},"tArYc0UyLFim3uAjxPACAQ":{"text":"Unimpressive. Has a week night dinner here. Went for the curry shrimp off the specials men","useful":0,"cool":0},"TajhGWcIneAenhHPP5XubA":{"text":"Even with all the amazing places to eat in New Orleans, we ABSOLUTLEY have to visit for th","useful":0,"cool":0},"LvUHiznU07X5TXcbqXV1pA":{"text":"I have been underwhelmed by the poor service at this restaurant and New Orleans as a whole","useful":1,"cool":0},"QdqFvPEzJ-0WcalqYKXbIA":{"text":"Had a coupon for buy one get one so a friend and I got the ribeye Gorgonzola. Well cooked ","useful":1,"cool":1},"ArG9g1e4fzPPZVL1Z-QmWQ":{"text":"Excelente comida , cerveza excelente un buen sitio compartir en familia o entre amigos","useful":0,"cool":0},"d1qtYreHWt5ZGTQN21w7wg":{"text":"We had a decent meal here after checking out the casino.  The waitress recommended some sh","useful":0,"cool":0},"B_PHNXnKDQs1tNN1NsFvfw":{"text":"Wife and I were hungry after walking the FQ. My wife had the Lobster/Shrimp mac and Cheese","useful":0,"cool":0},"cLT7g__DpUL4P3o1z1r6Lg":{"text":"It had to happen. We finally had our first bad meal in NOLA.   The worst fried calamari we","useful":1,"cool":0},"cwuN_D4vZNsPE2obGrYNfQ":{"text":"Was in N.O. for a bachelor party group of 12 looking for no wait and no dress code on a Fr","useful":0,"cool":0},"3Vxw88ZY1idzUYYfkclrxg":{"text":"We have been to Gordon Biersch Brewery Restaurants in Myrtle Beach and Las Vegas and liked","useful":0,"cool":0},"HuSL_0hEyon1dEWJFNkC3Q":{"text":"We have visited other Gordon Biersch locations while traveling so we decided to check this","useful":2,"cool":0},"XmHLfn5KjfMEzYMMcdThmQ":{"text":"The gumbo and pulled pork sandwich were both good. The only drawback was that the soup app","useful":0,"cool":0},"y_ApuUh8wolu_88_pjDK8g":{"text":"Food and drinks are excellent. I typically try to say away from chain restaurants, but the","useful":1,"cool":0},"tv1taqDDyXaqmWj9uRT1jw":{"text":"Food was pretty good. The garlic fries are very strong so if you don't like garlic, don't ","useful":0,"cool":0},"6NIY80ChKN5n3du3d9tIGQ":{"text":"If you like good food, this is the place for you.  They have some of the best steaks in th","useful":0,"cool":0},"P86j56FmbmsWmFtz1os4NA":{"text":"Based on previous reviews we were hesitant, but decided to hive it a try. We had the crab ","useful":0,"cool":0},"RBJmyvEFpqPdjoVA8I3J6A":{"text":"I went here for my first dinner in  New Orleand. Upon arrival, the hostess stated that the","useful":0,"cool":0},"sHxiJl6MSiER7Mj9A_H3ng":{"text":"WARNING: THIS REVIEW CONTAINS GRAPHIC DETAILS THAT ARE NOT SUITABLE FOR CHILDREN OR ADULTS","useful":7,"cool":1},"Dxo4E-qg5KkA55JQC-_NUg":{"text":"45 minutes after seating to come take drink orders. 2 tables sat after us served prior and","useful":0,"cool":0},"bKcpnZwWfgo16lwzOXVSXw":{"text":"Stopped in here for lunch and sat in the seats that are outside but still open to the bar ","useful":0,"cool":0},"zaUSbIgeuvkNOKHd6CoGdA":{"text":"Stopped here after losing a quick $100 at blackjack.  Great table on patio.  Hostess was a","useful":0,"cool":0},"gaiHjuMxinxdyh6rSHAe-g":{"text":"This was my second time at Gordon Biersch. I love that it is a close walk to pretty much a","useful":0,"cool":0},"AsYhOD0iK1J3qezm_mWHFw":{"text":"Great place for a quick meal in N.O. Staff are pleasant. Prices are okay. Food is tasty. L","useful":0,"cool":0},"0IRpVF1W-t9p6hN41gYZEg":{"text":"Horrible service was only the start of my evening here. My order was wrong two times, serv","useful":1,"cool":0},"tn9vuvlXD_gprvF5frfe0w":{"text":"Food was uninspiring, they really need some quality control. Prices are high and on this o","useful":0,"cool":0},"GT_MJjSJKdLYloPWpHWt5w":{"text":"The food was just so so.  I had stayed next door at Harrahs for a meeting and actually are","useful":0,"cool":0},"ezX9yHgiwUkaw1kPfiGWxw":{"text":"Me and my family of 10 came to celebrate, we had a 10-15 minute wait then were seated. Ver","useful":0,"cool":0},"32sEC2A6YkYBQoPaFFsixw":{"text":"I've never eaten here, but I did go here with friends to watch a Saints game and we had a ","useful":4,"cool":2},"yuwl-ljBbOoPezaP26XDtw":{"text":"Good beer, great service, delicious fries, pretzel was a a little cold on the middle. Over","useful":0,"cool":0},"OUCsZc_qpVtqTb5OI3dEGA":{"text":"i dined here back in early december with a group of about 12. we stopped in for a bite aft","useful":0,"cool":1},"d6y_EwshFh7WxnVefRIdLg":{"text":"Out of Ahi and Kobe. Slow service. Gumbo: meh. Fish and Chips sucked.  I kind of knew they","useful":0,"cool":0},"5rnQgzJXo3VuX0PtAJ9TEQ":{"text":"Delicious post-marathon dinner! My mom and I got a steak (mine was a bit over cooked but h","useful":0,"cool":0},"sCuYzSw6H1-RQONXnsZbZA":{"text":"I don't even know how to start! We were a party of 6 with 2 (well behaved, well traveled) ","useful":0,"cool":0},"FSdP3TayLYyZ07FSglmQyA":{"text":"While it's a chain restaurant, it's one of the better chain restaurants out there. I've al","useful":0,"cool":0},"cIHE1X4RCQnxCZ5UjnHj2w":{"text":"Not really vegan friendly, more touristy than local feel. However that's not why I rated t","useful":0,"cool":0},"img3qiGrA4nM-dNmC_u7ng":{"text":"Slow service. Smaller portion sizes, but great food. Enjoyed the beer too :)\n\nI had the Ca","useful":0,"cool":0},"1EQrctSpe0e3u_2UVNA_Fw":{"text":"Stopped in for a beer, they don't have IPA's, (my favorite) but the Czech Pils was awesome","useful":0,"cool":0},"KumPfXKVa-lDYFM5yWbe1Q":{"text":"I like coming here to get my parking validated.  Lot's of beer on tap and the wait staff i","useful":0,"cool":0},"HrQ4Bt4azhZJ4eqMsc8FRw":{"text":"Menu on Yelp has not been updated in at least one year or longer? They no longer serve fla","useful":0,"cool":0},"pE8-lWTwrzuqWY4BFnw_7Q":{"text":"Better than I thought, and I am not so easy to please.  They had a great happy hour from 4","useful":0,"cool":0},"iZ3BW-xokZ2-l84x32mN9A":{"text":"After 3 days of oysters & other seafood, this was so yummy.  The kiddo wanted pizza, it wa","useful":0,"cool":0},"iOKuUbaqxcpXmq3tecG_bA":{"text":"What a disappointment. The mussel appetizer (large size) is NOT large enough for a meal, r","useful":0,"cool":0},"7eCNtact97KWiHUxvwYsLQ":{"text":"Great selection of beers and some excellent apps. Great atmosphere, for a game or just a h","useful":0,"cool":0},"D6-aD5k7xtoXDWzRbxJZNw":{"text":"I'm the kind of person that licks her plate clean. After a long busy day, I was in the are","useful":0,"cool":0},"u4G6Fa9tDE0bWRxrzeSvjg":{"text":"Food was okay and the service was so so. We went here because it was easy access for my in","useful":0,"cool":0},"qUMxSVhwMPAZWZmtQBonDw":{"text":"Loved the cajun fish tacos!!! I've never had them with a hard shell inside and then wrappe","useful":1,"cool":0},"S_snd3l6x2m5btPyWhzrdw":{"text":"FOOD: \n\nWoodford Reserve Bourbon Chicken with Rice Pilaf & Salad...\nVery tasty & flavorful","useful":0,"cool":0},"2I1Nj3j6Omi27rLGUSaAQQ":{"text":"I love this joint. Great craft beer (the blonde every time) and the food is fantastic. Add","useful":0,"cool":0},"qNtqTvG2ZBRp5M9ns_i_-w":{"text":"Very disappointing experience - Came here at about 9:30 pm with a party of 11.  We were se","useful":0,"cool":0},"Fmje0pTS4hRdXAY33uozew":{"text":"Meh...not so good. We went here a couple days ago for a work luncheon. About 14 of us arri","useful":8,"cool":3},"Sso-05ciNy1JQiCzfS-N4A":{"text":"Gordon Biersch, we really want to like you, but we officially give up. \n\nThis is our third","useful":0,"cool":0},"-jZZAmA0b1VVcJeOQH5rxg":{"text":"It was ok. Had salmon. Server was decent. I wasn't bowled over impressed, but not disappoi","useful":0,"cool":0},"wzXgRkMdhojMRX1vMyHdFQ":{"text":"This location seems to not be concerned with the retention of the return customer. My serv","useful":1,"cool":1},"Lx5CXZYcgdqH2QD67NDkFw":{"text":"4 stars due to the fact they offer 2.50 craft beers on Tuesday. The food is generic pretty","useful":0,"cool":0},"eCwjSlm3EQk1E5X9q-cdKQ":{"text":"We ordered the crab fritters. However, after we ordered we were informed they ran out. Ins","useful":0,"cool":0},"AzwXR6kwHy9ykgd_hxnsQg":{"text":"Even though this place is a chain, and I'm soooo against chains, I have to say it was very","useful":0,"cool":0},"rx55Hw5Yyjl7YX8d1B3lfw":{"text":"Was on vaca in NOLA and walked into this place for lunch. Coming from MA and a man that lo","useful":0,"cool":0},"N526qLdqnw4iJVG1V3g8Kg":{"text":"Well we went back again and we had a lovely time so changed to 5 stars.\nGreat food and ser","useful":0,"cool":0},"ttm_A5Y9kn5OZvlQFV6pCA":{"text":"Came here on a football Sunday- good atmosphere for saints football. Ordered the tapas app","useful":0,"cool":0},"iIJl7fTiGJoBLvf7DU0U_w":{"text":"Good drinks, great atmosphere, tasteful food. Love the ambience. Would go back if we are i","useful":0,"cool":1},"bkzdiOxH7EhsfY4z675CsQ":{"text":"While the food and drink shined, the staff did not. The only glint of a personality came f","useful":0,"cool":0},"Ldz_O4ihWNhMwHdjr624-Q":{"text":"Slow service and served us the wrong pizza after waiting 30 minutes! Ran out of beer glass","useful":0,"cool":0},"FFfmnmfPQffuv2p782KdMA":{"text":"Enjoyed a relaxing afternoon lunch prior to Bayou Country Super Fest. Lots of TVs in the b","useful":0,"cool":0},"H4UihYe5UTB7bXunmhiBwA":{"text":"We found a table for 5 at the bar. The service was excellent. Our waitress was nice and at","useful":0,"cool":0},"n-_gGIGVx-SV5SGM7CEPxQ":{"text":"I came here hungry and had whiskey before eating, so keep that in mind....wings were sweet","useful":0,"cool":0},"L5BrAFBVQa3VRG6dibNOhg":{"text":"Food was great, service was terrible.\nBe prepared for that and you'll be fine. Our waiter ","useful":0,"cool":0},"YgvZg6uTpl8CDODIt6qsqw":{"text":"Great atmosphere, great German beer selection, and amazing crab artichoke dip. :) We came ","useful":1,"cool":0},"ZzBQykKK5Vn50QPtWfVdDQ":{"text":"Awesome service and the best sweet potato fries! Great drink menu and a variety of differe","useful":0,"cool":0},"IH2_Mfz8j5eZRBHdPyOoFQ":{"text":"We used a Groupon tonight and it was good. But I really think it greatly matters what you ","useful":0,"cool":0},"rqQzqiMsG17DMcFwGCRHxA":{"text":"Great and friendly service. ... Very good food and the beer was amazing. ... Had the \"pair","useful":0,"cool":0},"1dL0hQsapf_U9zmol80DPQ":{"text":"Had dinner here with a friend on a recent trip to NOLA. This provided a much needed break ","useful":0,"cool":0},"FJN_tABcOOxpJ5dSIXjLwQ":{"text":"Umm our waitress could care less..Catherine... cute but not attentive.. Food was great","useful":0,"cool":0},"N01689MLFYTBtkAzpVz8wQ":{"text":"The story you are about to read is true.\n\n7:08 pm. My partner and I have had a rough day m","useful":2,"cool":2},"15JDZjFAY3oBBIDKTNkiUQ":{"text":"Unfortunately we went there for dessert. No dessert on the late night menu and their regul","useful":0,"cool":0},"_rJca3uegpNyiaGsoyR84Q":{"text":"Stopped in for lunch and really enjoyed a good bratwurst sandwich. The location is good as","useful":0,"cool":0},"5sYHhU71DK_Ayer9ZJ55wQ":{"text":"What a surprise! My boyfriend and I stopped in while weary from walking during our vacatio","useful":1,"cool":0},"GXQhybZqVL2nkZVGjJbLTA":{"text":"Great experience here, Came in for dinner. The Service was great and food was even Better!","useful":1,"cool":0},"jwLwOnKPWaG8L963CJHxMg":{"text":"I came here on a business trip and had a decent experience.  I checked in with yelp and go","useful":0,"cool":0},"7U1NjSZSB2Q_C7h2lY1HvA":{"text":"I was extremely disappointed with my recent trip. I've been to the South Carolina location","useful":0,"cool":0},"Oq07GO1vTKkLZuhFkxvS9g":{"text":"Had a coupon for buy one get one so a friend and I got the ribeye Gorgonzola. Well cooked ","useful":1,"cool":1},"l71fnZhY6sMvxQx6nUvFTg":{"text":"I chose to take my family here for dinner because they offered a bit more variety than jus","useful":1,"cool":0},"KQJEdEIbzHGAMIYD1M4gIQ":{"text":"I've always enjoyed every visit to GB.  It's loud and usually crowded, but it's a comforta","useful":2,"cool":0},"0pN_bl_ZjZv7WbBQ5aGn-A":{"text":"Great garlic fries..(thanks yelp!), good lobster mac&cheese, great beef medallions.","useful":0,"cool":0},"Kr1mMv7XSOk7TP-k5lGeGg":{"text":"Good stuff. We went for lunch because it is near my sister's office and offers outdoor sea","useful":0,"cool":0},"uIZKL5oD_0FY2qGeGxJEEQ":{"text":"Let me tell you the folks working here are absolutely the best.  They made me feel welcome","useful":0,"cool":0},"FEZ-VwwiWc9d2SsDvkAxYw":{"text":"First of all the waiting area ha an alarm that beeps, staff tries turning it off and it co","useful":0,"cool":0},"ASdNFYILyfI8GrFzGKXZxg":{"text":"Visited this location during the Superbowl. Got here 2 hours before so we could secure a t","useful":0,"cool":0},"BL8k6vqUCjDUQvvjor8QOw":{"text":"The service was so great. We got the blue crab dip and didn't like it.  The waitress took ","useful":0,"cool":0},"wY9Vf2KZSXHrupE7B31sqg":{"text":"Their beer is good. Food is usually pretty good too. Yes, it's a chain, and there are SO m","useful":0,"cool":0},"W8-wjS4ZV_t_9uWj7qYjDQ":{"text":"Ordered a rare NY strip with portabellow mushrooms and some kinda glaze.  Each of the thre","useful":2,"cool":1},"dCwkq8c7F7JhI34DLtOlCA":{"text":"Lets sum up this place with one word: decent. I've been here a few times now and I've neve","useful":0,"cool":0},"0qVaSrTNobed3ie5ZT3ZLQ":{"text":"Good beer.  I've been to the one in Vegas many times and like the food and craft beer (Mar","useful":0,"cool":0},"gnxHSCzWjgu70AZgCO08SQ":{"text":"We ordered to go at this restaurant bc it was just across the street from the hotel our fa","useful":0,"cool":0},"5lC37bfkx_LUQCH-2UIjmg":{"text":"Great atmosphere ! Love the location, it is really pretty inside.. \nGreat service, bartend","useful":2,"cool":0},"_7NJbAfBZRFear4xtpccWw":{"text":"Step in on my way to the Riverwalk and found a great place fir lunch with a great beer. Wi","useful":0,"cool":0},"-r0gTdejqOQsQEHabGq0qQ":{"text":"I would give this place no stars!!! They are their own brewery and have an above average b","useful":1,"cool":0},"aOCtft7HireXYxu5gNbiOg":{"text":"Really good food for the price and the portions were generous. The wait staff was courteou","useful":0,"cool":0},"Ja9848B3AyR91Ks2sougXg":{"text":"Steak salad was delicious but the crab artichoke dip was oily and drive of the chips were ","useful":0,"cool":0},"OFZRzqz8sk46RVwP2jkL0w":{"text":"First time to visit, this past Sunday. Had the steak with kale salad and green beans. Deli","useful":0,"cool":0},"W26oNYl73RP63HJTbt8V-A":{"text":"Good beers and food was ok. Our service was pretty bad. We did sit in the bar so maybe tha","useful":0,"cool":0},"n6NT24CX97y5aC0GNvi-Yw":{"text":"Enjoyed the small plates of muscles, sliders and fish tacos. The free garlic fries we real","useful":0,"cool":0},"gYy6DlRQ9tSIy6llhWl3Gg":{"text":"Nice. Beer is great, we even met with the brewmaster. Interestingly enough even the food i","useful":0,"cool":0},"ONvdBJ8K-SCB6v_f3nyhPQ":{"text":"There is a reason why it has three stars on Yelp. Below average food and below average ser","useful":2,"cool":0},"-pR8h5Mjs4rn4HWw7smpIw":{"text":"Would get a 5 star rating from me if it weren't for the small portion sizes. The waiter I ","useful":1,"cool":0},"dinJy9miiFxPukaplXOctg":{"text":"My sister recommended GB because I was looking for a venue to have a birthday dinner. A we","useful":0,"cool":0},"E3v-Mh6ysxmSWEh7AoR-gA":{"text":"Service was good...pricy for what it was but food pretty good. I have been here several ti","useful":0,"cool":0},"VXMQuptIByexTnI_zqVJLg":{"text":"Had dinner here last night. We were wanting simple food, nothing to rich. Arrived @5 and h","useful":0,"cool":0},"tRWbZx_tbKgJbqqDrvp3kw":{"text":"Phenomenal! If you come in See Michael A. He was our server, and a phenomenal one at that!","useful":0,"cool":0},"o7M4utTiS9DUrdeJt1ZLrA":{"text":"Good, clean, AIR CONDITIONED place that appears to be a chain but serves as an independent","useful":1,"cool":0},"lZQ6-wMtqXDngY6tdsUd2A":{"text":"Great happy hour for both food and drinks. Good place to sit out on a patio and watch some","useful":1,"cool":1},"nUdDpfqsK9WpEhYE1zHhmg":{"text":"This is my first night in New Orleans and we got a late start to dinner so found Gordon be","useful":0,"cool":0},"5s6kl1avFrCQAYWVJmnm9A":{"text":"My server, Christian, was excellent. It was a dead spot in the day so I let him know I was","useful":0,"cool":0},"6skfWD6qUvRgBUgXL3kc3w":{"text":"We were welcomed warmly at the door and met with smiles at every turn (we showed up right ","useful":0,"cool":0},"yTOg8cUlFHpdntWoX_KKcA":{"text":"Need to bring back the cedar plank salmon. It is the reason why I eat there. Live the atmo","useful":0,"cool":0},"sg27bJjfU9n915s9XW2ggg":{"text":"I have food allergies and the waiter didn't seem to care. He didn't write my allergies dow","useful":0,"cool":0},"0ZS9pFl8vpbugMHtq6Pw4g":{"text":"Phenomenal! If you come in See Michael A. He was our server, and a phenomenal one at that!","useful":0,"cool":0},"vFCDxseC65perVZtPDx8oA":{"text":"I like this place...I've been at least three times.  The first time I went was the best.  ","useful":1,"cool":0},"g9ImsrawkWjYooi80w7MLA":{"text":"Food was good, but service was slow and some folks in my group had their orders come out w","useful":0,"cool":0},"MCWRo0x6H_9U_PTB_EkaTg":{"text":"One of the nice places in NOLA\n\nPros:\n-Food was pretty decent. I ordered the Goat Cheese a","useful":0,"cool":0},"FJqGMuGHQwrdDzX52Qnu3A":{"text":"In almost any other city, Gordon Biersch would be more in the 4 or 5 star line, but in a c","useful":5,"cool":1},"7UMt4kf8UR15C6jKdpaV2w":{"text":"After walking around the New Orleans area, we finally found a place to eat outside with a ","useful":0,"cool":0},"cpq4FqY6PmVobc3c9T7Qfw":{"text":"I was with a party of 10, the hostess was very pleasant and asked multiple times if we wan","useful":0,"cool":0},"1O00Jt2UqB2MfquX-_d9OQ":{"text":"My good friends and I decided to stop in here after a day of holiday fun. We had just enjo","useful":3,"cool":2},"78nYCO-fohaacFeEKnzgvw":{"text":"During our visit to Louisiana, New Orleans we came across this restaurant and had a great ","useful":0,"cool":1},"8_2m6_jpxv77PSvI8s32Tg":{"text":"I can't even imagine how much money was lost on 4th of july night due to the rude hostess.","useful":1,"cool":0},"Cidwyz_fKWY9wzFZN8ZzgA":{"text":"My friend and I went here for dinner last night.  Our food was great and our server was fa","useful":0,"cool":1},"dd2Qa3tkdOOGL9TbPNWzeg":{"text":"Microbrew and good food. What more can you ask for? Hmmmm a bit larger portion would be ni","useful":2,"cool":2},"VORT5u9RVy7t0Pete09sAA":{"text":"I have to second the 9/24 review who says he's surprised by the negative reviews. My fianc","useful":0,"cool":0},"jQABRNmg4VmR6TRLCTJYDw":{"text":"This was one of my favorite meals in NO LA! The kobe meatballs were delicious, moist and w","useful":0,"cool":0},"8b6SEc3Bw4Lk9PGuZBacRg":{"text":"Great service, great food, loved the yelp offer! Loved the sampler and I especially enjoye","useful":0,"cool":0},"UO0nzBl6bdQ0lnwJn_qD9Q":{"text":"I normally don't review chain restaurants as much as local places but my wife and I have b","useful":0,"cool":0},"3AJclntWtDYrbnbCKYz7IA":{"text":"If you are a saints fan and in the area, this is a good place to catch the game. Lots of T","useful":0,"cool":0},"REvC4Ch7aP1NIvJHVBVpNQ":{"text":"My hubby gave their kobe burger a 9 out of 10.  They cooked their meat to the proper tempe","useful":0,"cool":0},"ZAWzQCSoDrdszzgp5g_UBA":{"text":"Food was ok - our group was big and service slow but accurate.  The lobster mac and cheese","useful":0,"cool":0},"cx8UFE42ilndWBezR66t_w":{"text":"Loved this place! Got the veggie nachos, veggie tacos, and the mushroom pasta. Wasn't a bi","useful":1,"cool":2},"3gwRid6GQHLGmzDXYlzX4A":{"text":"Love the Southwest egg rolls! Great bar area to watch sports or just chat with friends! Fa","useful":1,"cool":0},"bOvhAEuGMswlNpsGzabsrw":{"text":"In town for a conference and stopped in for lunch because it was conveniently placed betwe","useful":0,"cool":0},"sqXBs682ZdRoxHKlS4BSOw":{"text":"Me and mom with a 15 & 10 yr old. Had a great meal. Seafood carbonara, yum! Small bites mu","useful":0,"cool":0},"ojsOg5No2dwmAJcdWU4A0g":{"text":"Food and service by our waitress was great! \n\nOne issue I had. -- came in on Memorial Day ","useful":0,"cool":0},"rQH7q5PlFyKOdAUYww2cVQ":{"text":"I would do no stars if that was an option!!  I had the worst experience ever!!!\nI went the","useful":3,"cool":0},"oF1_m2T68cyRdRwTQrarqg":{"text":"Not a fan of chain brew pubs....and this screamed chain brew pub.  The prices were a littl","useful":0,"cool":0},"TcKsAeUqGG4rMLN-KY1TFg":{"text":"They had a check-in offer here for free Garlic Fries so it drew us in. The fries are amazi","useful":1,"cool":0},"dLCRuV4KQEopqHfrEuGxpw":{"text":"Not bad for a chain. After waiting entirely too long to get our drink/food orders in, we w","useful":0,"cool":0},"PWCJrT9mhCC_R-E7Qhhrig":{"text":"Great atmosphere, above average service and inventive tasty German inspired food.  The App","useful":0,"cool":0},"RAqOVD8Okn-BrLeGeCA_hA":{"text":"Gordon Biersch is exactly what it looks like: a chain restaurant attached to a casino. It ","useful":1,"cool":2},"KDRJMI98v9HcorZUk1KpQQ":{"text":"I wouldn't even give this place one star.... service is terrible we sat down at 8:50pm and","useful":0,"cool":0},"GigiLWVIknRJw9dPGWOWww":{"text":"Lousy steaks but great beers\nThe chefs don't know how to cook, seriously. This place needs","useful":0,"cool":0},"ykQRjjjGTDVxUb92mq-CIw":{"text":"First time diner at this location and we were pleasantly surprised. Our server, Catherine,","useful":0,"cool":0},"jxOZKWvwI8oqfyLtJaEHWA":{"text":"Open and airy, the brewery offers decent beers and a variety of typical pub food. I got th","useful":1,"cool":1},"5dKbDP8H5DqJFMj51lUC_g":{"text":"Surprisingly good beer and tacos. Not overpriced either as many restaurants in the area ar","useful":0,"cool":0},"HplO3usHLJozGkbY9tSmLA":{"text":"I always sit at the bar or bar area. I like the service better there. This last time I was","useful":0,"cool":0},"hKSgfVQr1x8ZX1lKhbTskA":{"text":"Went here for lunch, it's a beautiful restaurant and the service was great.\n\nI had the lob","useful":0,"cool":0},"p9V0LVO2bgaT601-Ie0aJg":{"text":"Not sure if this is a restaurant or GrubHub issue, but had a few issues.  I wasn't allowed","useful":0,"cool":0},"qdWBsEOOyCGF47BeD9fCEg":{"text":"At first glance this place seems like just touristy restaurant, as it's location is primed","useful":0,"cool":0},"RVPXqJ0Vk2ZTR_sdK7hbrg":{"text":"Good fish tacos, fair service. It's a chain, what else would you expect.  Garlic fries app","useful":0,"cool":0},"v5asgZAXhav0jS8nywdT4A":{"text":"I stumbled upon this brewery while looking for some good food to eat. The setting is big a","useful":0,"cool":0},"nAG8J4PdVpveO9R428xTOQ":{"text":"Word to describe this restaurant: WOW.\n\nAfter having my heart set on eating somewhere else","useful":0,"cool":0},"GI2y6lCUXi5AU2V1Vwcv4A":{"text":"Short version: \nUsually no wait or short wait in comparison to other restaurants in the ar","useful":1,"cool":0},"yfjCWHfT8D5E0QNB4NlNBQ":{"text":"Your standard chain GB. Service is slightly below par. Mainly because the waiter seemed an","useful":0,"cool":0},"xOpzUAqQ59PzIsKa5PWlRw":{"text":"Joseph was our server for  tonight and he was really good.  My husband and I got each a be","useful":0,"cool":0},"JJJc-TVDuFfwLmLlK_XY9g":{"text":"Gordon Biersch is a great option when you're in a sea of chain restaurants. They offer a m","useful":1,"cool":0},"EV-nD268wnTAk5bMJMvfIg":{"text":"Pretty subpar at best- appetizer was cold-  after being sent back-  burger - okay-  wilted","useful":0,"cool":0},"tPgRdtp0NJkFpkF9iBGiRA":{"text":"Go for the drinks, skip the food. \n\nYelp couldnt even come to my rescue for this place. Be","useful":5,"cool":2},"9lxVHGpqfOflIb9JLIjZsw":{"text":"Wow im surprised about all the negative reviews. Me and my wife  have\nbeen here twice and ","useful":0,"cool":0},"MrU_ldkx5KfxcFuIFvutaQ":{"text":"Chains start out at 3 stars for me and quickly lose stars for any slip ups. Consequently, ","useful":1,"cool":1},"k7PEl51lI_I2cd7Fz9bpsQ":{"text":"So, I've eaten here in the past and it has been great! Tonight was not so. We ordered the ","useful":0,"cool":0},"TmzbQdskd8fNYhqh0P5t1Q":{"text":"Blah.  It's a chain that's about its beer, which is average.  For a chain, it's upscale co","useful":1,"cool":0},"wEGqIC_So0rycnw5Yy8w4g":{"text":"Custoner service is horrific.  It took 35minutes to get my food. plus the server didnt bri","useful":1,"cool":0},"GTanZr1cWOue19IDlqT_IA":{"text":"We ate at this brewery twice during our stay.  The shrimp tacos were really good and I wou","useful":0,"cool":0},"tFjMUfZzgq9w4O0PrpiSrA":{"text":"IXNAY THE FOIE GRAS: just like Hard Rock, Margaritaville, etc. stick to the basics;\nNEW CA","useful":2,"cool":0},"7LIOv-Cue5k0vy-OEhpm8A":{"text":"We were completely shocked by the level of service from a chain restaurant!  Our server, J","useful":0,"cool":1},"6jSsMD0CT-rA4Y5LANDcNQ":{"text":"I had high expectations walking into this restaurant. From the classy décor, upbeat music ","useful":0,"cool":0},"Kq8byfJ4msv0eI8mZJk8mA":{"text":"Fun atmosphere with a comp buffet and $2.50 draft beers. Bartender even offered samples to","useful":0,"cool":0},"LWPyKZGohVtCcYMynFmKpA":{"text":"Their fish tacos are consistently some of the best and the sangria makes me happy. (Pass o","useful":1,"cool":0},"jVJBn2yPjanvietiRJxCRg":{"text":"ok so asked for my tacos plain and dry and bruh brings me normal tacos like ... \nbut then ","useful":0,"cool":0},"vrl6E3Q-I0lw6ju-hPWt-A":{"text":"Just stored by for a quick drink and appetizer to hold us over u.til dinner.  Ordered the ","useful":0,"cool":0},"JRb6ng8_1GDOuweZB7qyhg":{"text":"In NOLA for Mardi Gras and needed a bite to eat before hitting the parades.  We were seate","useful":0,"cool":0},"U73JgfHeiaMEbxtCcenUmw":{"text":"Not fair to give it 4 stars since I didn't try their food and only had drinks. \n\nFirstly, ","useful":1,"cool":1},"2VwGMohlwzL9rnSZAikikQ":{"text":"As chains go I usually really like GB but this location leaves much to be desired. Sat at ","useful":0,"cool":0},"KSigONCppCTOfk3Ipc-8DQ":{"text":"I'd usually give this restaurant 5 stars but the service tonight was horrible. It was a lo","useful":0,"cool":0},"2jTTwXyB2kkAn1n32Vk7BA":{"text":"Service was ok. Food was to be expected and prices were very reasonable for being in the t","useful":0,"cool":0},"2xY8YB4faB3f9kJ-fHAnSA":{"text":"It was very good!  My sons both love to go here every time they come to New Orleans. It wi","useful":0,"cool":0},"ellN4ti-cH4qtx0M7HkFwA":{"text":"Delicious food! Great taste! Best sweet potatoes I have ever had! Best restaurant thus far","useful":0,"cool":0},"4ECkyrm16UQp4CmNO7P_0Q":{"text":"Tuna was over cooked. They offered to recook it but i was almost full from the sides I did","useful":0,"cool":0},"9Z_OZhmGOxeXJ0egrksD0g":{"text":"Got food to go. I asked if everything was in there so I wouldn't have to go back. The host","useful":0,"cool":0},"jcInHZIH3kpuirGEb5i3Xg":{"text":"Hit this spot after getting killed at the casino across the street. Nice happy hour at 9:1","useful":0,"cool":0},"Wh1yUjGKQbXncjJfwlGjJA":{"text":"Enjoyed the beer, especially the Czech Lager. Service was great, we ordered the mahi mahi ","useful":1,"cool":1},"EzXRBNv1BSYv0ORbHeCYzQ":{"text":"As other reviews have stated, this is a chain restaurant and it certainly feels like one (","useful":0,"cool":1},"_2yc-42GCXIMdSsTTmU8-g":{"text":"We got the Garlic fries and they are great if you like garlic, a lot of garlic.  Well, we ","useful":1,"cool":1},"QcXaIoY3SGxOlS6HAtrQ0g":{"text":"Had take out because we are staying at a nearby hotel. Wanted pizza, but should've gone th","useful":0,"cool":0},"Y_LsPf1KtIOAliT7cayP3A":{"text":"Today is November 24th, 2014 I brought my to this place to have a good time and the servic","useful":0,"cool":0},"-MR6bBs1PbR4PW-v7qxyGA":{"text":"Hubby and I were staying at Harrah's and met up with some peeps for a drink before heading","useful":0,"cool":0},"wdLHqJ8nLwCa9el1-njZXA":{"text":"I ended up here after the Krewe of Halloween because my niece and her friends wanted to ca","useful":1,"cool":0},"_UVAUe_gpcmLs84maTOcpg":{"text":"Hand crafted beers and Garlic fries.  What else do you need to come here?","useful":0,"cool":0},"ljBnS0ESbManvwXZLaFqWA":{"text":"Always good service and good food! I went in before the evening rush and ordered the fish ","useful":0,"cool":0},"bqHyVuetLKMRKfdLQgxyAA":{"text":"Fun atmosphere, this place is huge!  But, It took an hour and half for dinner to arrive & ","useful":0,"cool":0},"5sA5zw24wTAJ64DQRGlfWw":{"text":"Ok we stayed at the Hilton and wanted some good food. Thought we would try this joint. Fas","useful":0,"cool":0},"_E_D9ZbNNXBFkmQsXkW-bA":{"text":"Came here for a drink or two while exploring New Orleans and decided to order the ahi nach","useful":0,"cool":0},"fhivv2Ipb6oE9i8gXaD1KA":{"text":"The garlic fries alone are a great reason to go! One of my favorite restaurants in NOLA!","useful":0,"cool":0},"n5_OhIk_V8y_rP2c1VWh7w":{"text":"They were just ok, I didn't enjoy it like I thought I would. It's also very dark, we neede","useful":0,"cool":0},"oulSOcH_uCl_FfrrK3vggw":{"text":"If I could give this restaurant a -10 stars I would.  This is the worst place to eat.  Ser","useful":0,"cool":0},"evg7i1xrDrXUIay4pi0kvA":{"text":"I was completely disappointed in our dinner this evening.  I would have sent it back had I","useful":0,"cool":0},"KR1nQsZK065-UekoRdlftw":{"text":"I know this place gets a lot of flack for its food but if you stick to bar fare and watch ","useful":0,"cool":0},"SNfn2GXIdzt7a0GkqZ_fnw":{"text":"The stand outs for me are the drinks and the appetizers. Every time I have gotten an entre","useful":3,"cool":2},"qOmyYRn0stfYpDQ7pOyvkA":{"text":"Really disappointed...while the service was great and the food came out quickly, the taste","useful":0,"cool":0},"mZLgLMjLhhri4BhfaCMRSw":{"text":"We went here with our 7 and 9 year old boys 9/14/19.   The boys picked a table that was FI","useful":0,"cool":0},"8NzM8wnaDxz9dG6SWPQH9w":{"text":"This was a nice little find. Cool ambience, decent food, nice bar/patio area. Would defini","useful":1,"cool":0},"omYBrXt4iQZiyrqwWTscyA":{"text":"Went there for dinner but only stayed for an appetizer. Ordered some beers which were pret","useful":0,"cool":0},"NQxemGecgjhbBBPIxHvFYQ":{"text":"My coworkers and I ordered take-out for lunch. Arrived at the restaurant and was greeted b","useful":1,"cool":0},"4FvPVvarzF7HUx67biNJPg":{"text":"The food isn't going to blow you away but it isn't that bad either just average. Great atm","useful":0,"cool":0},"zqh8kwaYqQr5MsfmSR8__w":{"text":"Busy place. Friendly service. Good food. Bit pricey. Great place to hangout and have a bee","useful":2,"cool":0},"JAia4itc9aIk9ah4ovEUVw":{"text":"We ate here on the late night on the way to Harrahs. The waiter was nice. The food took wa","useful":2,"cool":1},"yZQPsDqUK8J5kLCMIEy4yQ":{"text":"It was good. The asiago fries were delicious. The crab dip was really tasty as well. And t","useful":0,"cool":0},"FOLcLkaujZ67Q8F0K2BXPA":{"text":"Nice little flight of beers. Diverse menu. Convenient to the French Quarter hotels. Had to","useful":1,"cool":1},"stBaG9s5rm1bHB1oswCbrg":{"text":"Just had my first meal at Gordon Biersch. It was AWESOME!! Fantastic food, and amazing ser","useful":2,"cool":1},"mmdjVWamY9CK3j79bgckbQ":{"text":"I have come here a few times and it's already pretty decent. They have a menu with a lot i","useful":0,"cool":0},"wmzMhQALRH5pblOlKXTZGQ":{"text":"This place needs some serious help. We waited 30 mins to be seated with about 20 tables op","useful":0,"cool":0},"n5QmXd1fVBUnunXu4DAWBA":{"text":"ok so asked for my tacos plain and dry and bruh brings me normal tacos like ... \nbut then ","useful":0,"cool":0},"erQl6dxvAj3TKxWV6qODgw":{"text":"Service was great, but the food wasn't very good. We had the wings, cheeseburger and free ","useful":0,"cool":0},"gy899Fp7ZQ71O9YGMyrpXA":{"text":"Decent prices for the CBD. Decent food. Pretty good home made beers. Had many good experie","useful":0,"cool":0},"0O5pn6lrhH1eODMO6Vk6tA":{"text":"Located in the Hard Rock not a bad place for appetizers and drinks. Fair prices with good ","useful":0,"cool":0},"sxhUcQjPjI7gWCGL7SBj3Q":{"text":"5 stars for outside dinning, fantastic service from Earl, excellent fare. Not real pricy f","useful":0,"cool":0},"aEmj4OZZIJNzn8PbB0qSBg":{"text":"I ordered the seared tuna appetizer expecting it to be freshly seared and not sometime eit","useful":0,"cool":0},"Y5lTqDKoy3KN0Ro6PXqlKw":{"text":"Nothing fancy but the food was very good. It also came out quickly and was reasonable pric","useful":0,"cool":1},"SARb7hPlITsrR_T42PZKHg":{"text":"Being New in town, this establishment provide very poor service, while prolong my day by a","useful":0,"cool":0},"SebuP7E3wVUr3bKgOw9o1Q":{"text":"We went for happy hour after the Creole Queen River Cruise. This is a large restaurant and","useful":1,"cool":0},"la4kRl3SIrPaNcDKf54U9w":{"text":"Our service and food we had for dinner was great.  Our Southwest chicken nachos were delic","useful":0,"cool":0},"DbMtiWq4UElZqotkt3xT_A":{"text":"It's been over an hour and finally got a rootbeer, for Pete's sake you can't keep making e","useful":0,"cool":0},"zqXF7Bl7eBU9iF0RuJ_G3Q":{"text":"Opened promptly on time at 11:00. We sat at the bar and received  quick good service! The ","useful":0,"cool":0},"PQuiHT6-ljUHhApc1ygtCQ":{"text":"Great Caesar Salad with blackened salmon (and chicken).  If you want to squeeze in a healt","useful":0,"cool":0},"A8ezs3cO1Ub17I8tTrEYcA":{"text":"Amazing food and really good prices too. Make sure your get in for happy hour, the drinks ","useful":0,"cool":0},"hVbKwzJ9x7dRDDXrtdCrkw":{"text":"Awful awful service... Good food they sent us the wrong sides with Postmates delivery and ","useful":0,"cool":0},"mJNkE3owGTGOPqWGfPwPgA":{"text":"We were on our anniversary long weekend, and we found Gordon Biersch restaurant and were s","useful":0,"cool":0},"6hwQQNzmQfXqwl4w4MhpeQ":{"text":"Never saw a chicken wing the size of a pack of Splenda  see photo: don't order the wings","useful":1,"cool":0},"IEOxWhfK6vwmpm3DZZIumw":{"text":"Very disappointing trip. Party of 6. Took too long to get server to wait on us. Drinks cam","useful":0,"cool":0},"VTGd5cHWjo5zvu8GTTN8rQ":{"text":"Tried a flight of beers and had the shrimp and mango tacos. Both were good. Our waitress w","useful":0,"cool":0},"0mb8SfQpn_-mhIeRBqEx8g":{"text":"From prior feedback I was anticipating food to be OK but was pleasantly surprised with the","useful":0,"cool":0},"EEIDeTQklJxoqymrahM_GQ":{"text":"I assume this is for Gordon Biersch Brewery, based on the other two reviews.  It's a typic","useful":0,"cool":0},"-Ys8EExPBHH3LaD4Pagrmg":{"text":"Half way through my 8 day trip in New Orleans my stomach just couldn't handle another frie","useful":1,"cool":2},"rGuStRJAOv-4OTORLZgn1g":{"text":"Food was okay and the drinks was horrible I had the waiter take my drink back and she brou","useful":4,"cool":3},"tVVF4o6byREnM9P4VhTi0Q":{"text":"I ate at this brewery for dinner, and the whole experience was great. Our server, Johnny, ","useful":0,"cool":0},"mL7guVscg15QnF751S4dCg":{"text":"We ate lunch and ordered off the appetizer menu. Great variety of bears and ales and some ","useful":1,"cool":1},"4MqFI9J0BL4Mq267hxhXLA":{"text":"Terrible. We called ahead because it was New Year's Eve and thought it would be packed. Th","useful":0,"cool":0},"CkdQ0nNtsJd9zFFNCcNQKw":{"text":"A great change of pace after eating tons of seafood and Cajun this was a great choice and ","useful":0,"cool":0},"JlImNbB6Qllv4GFKkD-phQ":{"text":"5 stars for outside dinning, fantastic service from Earl, excellent fare. Not real pricy f","useful":0,"cool":0},"nlTnBtNf6rcaEeeUbzCB3A":{"text":"I decided to revisit this place! My sister and I went here during essence fest and I was o","useful":0,"cool":0},"kzOeNUHUGtqRRrkbiVj9Rg":{"text":"A great place for convention groups to head, a fun way to check out the local twists on a ","useful":1,"cool":1},"7AvIr0knNbF8AmNLRXs_pA":{"text":"My date and I went in relatively close to closing time, so the place was in a moderate das","useful":0,"cool":0},"xGYm23RVcktZpZghVtYn-A":{"text":"Food was presented very nicely.  Burger cooked perfectly.  My chicken was delicious but a ","useful":0,"cool":0},"P90eFHyLVVltS6uB1FeplQ":{"text":"Decided to go here for dinner and of course for the beer. The beers were average, and the ","useful":0,"cool":0},"7_Tcf5v8vJ7PyzH6aW2gmQ":{"text":"Great service, the food came out quick. It's a very nice and cozy area. Would like more be","useful":2,"cool":2},"Ni6_Q9sfWFU_fv1Rls0aGw":{"text":"The \"A-OK\" rating is perfect for here.  Totally fine, middle of the pack...a-ok.\n\nCame in ","useful":1,"cool":0},"kOisZUZZe0vVZUe_Zkmo_w":{"text":"I think the salt and pepper has been removed form the kitchen or hidden from the chef.  I ","useful":1,"cool":0},"2Yy9DXTVLVM04t9mCS-BkQ":{"text":"Ordered a Sunday night splurge of nachos and fries and they were perfect! The garlic fries","useful":0,"cool":0},"bv9zRbpY7MzVOlhUpO23SA":{"text":"Honestly, this was not my favorite place, or even our first choice of the night. We wanted","useful":0,"cool":0},"wOCbySuwbJzDdwYY7A6REg":{"text":"The concept is the same regardless of location:\n\nYou want some bland, fried, over-priced f","useful":4,"cool":0},"sOYgHM54sITjdxZzjwwcZA":{"text":"Beer was pretty good. Food was good. Service was awesome. I like the dim lighting and deco","useful":0,"cool":0},"Gqw9K5ZBaDWfxZ2od9aEtA":{"text":"Awesome spot! Coconut shrimp, sweet potato fries, and cajun pasta were delicious. Beer was","useful":0,"cool":0},"Xpjs1oN3_-4BTcPHXDrzAw":{"text":"Slow service but friendly service.  The food was great and the beer was pretty good as wel","useful":0,"cool":0},"7h6LkUEqgfmQbBfNAtXa2Q":{"text":"Wow!\n\nService was awesome! We even had a trainee and yet he was going above and beyond!\n\nW","useful":2,"cool":0},"8raGENkSkapDE55-yvhXGg":{"text":"Food was above average overall. Service was poor and the kitchen seemed confused. The serv","useful":0,"cool":0},"HhqcbynlgbWAjqlSbErzoQ":{"text":"I had the shrimp mango tacos. It was a little spicy. Other members of our party had pepper","useful":0,"cool":0},"pAOqHry1390DiGW2_J9WtA":{"text":"I'm 50/50 on this place. Love it for the atmosphere and the drinks, especially for watchin","useful":0,"cool":0},"YU--yHKvBvkxeGzhHvr_Lg":{"text":"This place was definitely a great spot to enjoy some burgers, the IPA's on tap.  Kobe Chee","useful":0,"cool":0},"Z397O30DBWHCQTCL1jwOSA":{"text":"This brewery was our favorite out of the two we tried.  The appetizer we had was fantastic","useful":0,"cool":0},"HDZbfZgOZy1hmNA7aWwIeQ":{"text":"I have gone to this place no less than 5 times, and I keep hoping for something better to ","useful":2,"cool":1},"OY4BcB94nr8aq1GjyydNEw":{"text":"The food was great. Our waiter knew the food and the beers. He was very enthusiastic and e","useful":0,"cool":0},"bm93FOHKDpfw3PJKv6mR5Q":{"text":"I am going to go ahead and get my last 2 star restaurant review out of the way. So I also ","useful":0,"cool":0},"oqXDo6RRKuMEGU6H6_yKOw":{"text":"I grabbed some take out for my first dinner in town, I stayed at Harrah's,  so this place ","useful":0,"cool":0},"WWknHbILBnRzZsmYMedFZA":{"text":"Visited the restaurant after hours about 10 p.m. on a weekday \nI only ordered appetizers a","useful":1,"cool":0},"kSuWKMyciaelY-SWDoYNHA":{"text":"I'd give 4 stars cause the food was consistent. But they don't make the garlic fries \"garl","useful":0,"cool":0},"f6bszY6DZemHJEIn4x8ynQ":{"text":"This was by far the worst experience in New Orleans. The food was cold but overcooked. The","useful":0,"cool":0},"iBVJaf6lsb4QY9nx7DcjFQ":{"text":"This was my first time dining at this restaurant.  My husband and I were looking for somet","useful":0,"cool":0},"W9xYiy1KSW8xKf3wsNzHpw":{"text":"Ran in here for a quick dinner before a show at The Fillmore. It wasn't crazy busy but the","useful":0,"cool":0},"TVJ-l0KfxqmWZ39gAiIbUg":{"text":"This place used to have a great salad with hummus but apparently is doesn't have it any  m","useful":0,"cool":0},"GevJMGkVb3-pQxi9PvHK-Q":{"text":"We have waited forever. Server didnt know any of the specials and didnt try help us. We ha","useful":0,"cool":0},"7gan3ZcjEzjPFZlLOPIS7g":{"text":"I'm kinda wishy washy about this place. We came because I love beer. So the first beer I t","useful":2,"cool":1},"SlNPxMR_w0oyWI1BXCtg6g":{"text":"Had the Traditional & Cajun wings, crab and artichoke dip and garlic fries. They were good","useful":1,"cool":0},"1dXO1K8_JbgtWsjkwK67TA":{"text":"Service was great but I wish I could say the same about the food. They have a big menu and","useful":0,"cool":0},"mBXPytjZAYwsZBx_NYE8uA":{"text":"Cheese curds were phenom. They set the standard high with the candied bacon so when the bu","useful":0,"cool":0},"ZO5UcDhMjDa7ZQQKMXn8fA":{"text":"Gordon Biersch is a Harrah's Casino partner restaurant and are located on the Fulton Stree","useful":4,"cool":5},"dry8cJYfKk3HI2M7baTcBA":{"text":"Okay - Full disclosure - it's a brewery restaurant and I SHOULD have tried the beer. \n\nAnd","useful":0,"cool":0},"1QY1W5n0tuDXNWzvgFdmwQ":{"text":"I was actually shocked to see this place only has 3 stars! Went with 3 adults, 2 kids. We ","useful":2,"cool":2},"43GG22hbGopv6w2wjqZemg":{"text":"The French dip could've had more meat and flavor. Thank goodness for the au jus. The bacon","useful":0,"cool":0},"gFI1XFimJq2jyFOIMvUXdQ":{"text":"Perfect game time lunch or dinner spot, so many tv's with different games all over the res","useful":0,"cool":1},"sF9lukb38nXIFNIuq7AIfQ":{"text":"Food was great had grass fed slider and Cajun pasta. Savannah was awesome and smiley.","useful":0,"cool":0},"NRkUFl2shARF9w-PIF1Iow":{"text":"Food is fresh, beautifully plated, and tasty!\nWe ate here twice during our stay, and found","useful":0,"cool":0},"lAtImjb8mzk7_uiphB-wWw":{"text":"I ordered the caprese pizza. I didn't enjoy the pizza. The swerved wasn't wearing a mask. ","useful":0,"cool":0},"dJRy4BfO2vPpsgQMC480cQ":{"text":"A group of about 15 of us came here for a co-workers last day before he transferred.  GB s","useful":1,"cool":1},"MFULWIRI3VM24E1pSQ5epQ":{"text":"Had a late night \"snack\" last night (Tuesday). The pizza was delicious! We were excited th","useful":0,"cool":0},"gKsyzssI9qx0ZWBtDNjAgQ":{"text":"Terrible management. Lack of professionalism across management, the entire restaurant will","useful":0,"cool":0},"j_mNp3HTlbd4tg0ANyiCOQ":{"text":"Haven't been to a GB in such a long time. Today's visit was phenomenal. Service was outsta","useful":0,"cool":0},"xUewstB64YAsPkN_u6Ui4A":{"text":"All I can say is this was the worst part of our experience while in New Orleans. The servi","useful":0,"cool":0},"_-VMrPBdy8jbAFhgBBF6vg":{"text":"Delicious food, relaxed style and great craft beers. This place is a \"must visit\" when in ","useful":0,"cool":0},"7TA_7IuL3nhRTnXBaQj3og":{"text":"The food here was decent, or probably would have been had we been able to eat it while it ","useful":0,"cool":0},"alRCVpErLsL5d4QPUSL34Q":{"text":"Good food service was a little slow but they were busy.   Wood grilled pizza very good, ca","useful":0,"cool":0},"34NTZORnR-3vh5C2yQm46Q":{"text":"Sat at the bar for dinner.  Scott was nice and professional.  The new menu was a little bi","useful":0,"cool":0},"nSignc8Y35nZeSxi7cVcnA":{"text":"We tried Gordon Biersch Brewery last night. We were a large party of 10 and everyone had s","useful":0,"cool":0},"YYzG0G87VtBloxKyPGliGA":{"text":"I just realized I had started this but never submitted.  \nFalse advertisement and poor cus","useful":0,"cool":0},"3tC5FEp-5bpqJ5KlkZeDug":{"text":"Soooooo, met some friends for dinner there tonight, very hard to get any kind of service w","useful":2,"cool":0},"h8E8cLphA32fWSBgaMuPjg":{"text":"I was starving and was looking for something filling (and, of course, a Bloody Mary as per","useful":4,"cool":0},"SL92yGG-qy_4jomCiIj-IQ":{"text":"My meal, the Weiner Schnitzel, was yummy, but the Fish and Chips were absolute mush. The s","useful":0,"cool":0},"u2VYLtElQpLf4ioLVrbrdA":{"text":"We started off our evening w the lobster & jumbo crab cake..fr $15.50 u expect to get more","useful":0,"cool":0},"kQglji0OG4kogp305jhecQ":{"text":"Truly enjoyed the food and service (thx Taylor) a nice break from the French Quarter cuisi","useful":0,"cool":0},"Cx4YCr1WC71R_a2MwcHaqw":{"text":"The staff here is very nice and deliver quick service. The hamburgers and fish tacos are d","useful":0,"cool":0},"rVf8WvYEnURcrXsGUk3YbA":{"text":"The food is not bland as they aren't afraid of seasoning. Fish tacos were above average an","useful":0,"cool":0},"OWGdyoElm4Qd0m7wkhBy4Q":{"text":"This is a chain. You know what you'll get. Beer, drinks, and decently good food. Lots of d","useful":0,"cool":0},"kbHXv8HMXwd3Aeim2cig7Q":{"text":"I had a great experience here from beginning to end. The beers were amazing as well as the","useful":0,"cool":0},"8yUJoExCCE1aVbxBpbdwag":{"text":"Went to GB tonight for dinner.  Upon entering there was no line yet we were told it would ","useful":1,"cool":0},"ScESA-z0uhoanwBhchosKA":{"text":"My daughter celebrated her 14th birthday with a juicy ribeye and garlic fries. The steak w","useful":0,"cool":0},"nHhuyDGlKAGDvPNmbC7ViQ":{"text":"Table 10 people! Service was great. Drinks delicious! We started with pretzel!! It was yum","useful":0,"cool":0},"UfF1gZngcU0jFFd1vNatqw":{"text":"Good food but service is a little slow. Went on a wed evening and the place was not too bu","useful":0,"cool":0},"bjLzcsNw0p6zSaufx61_Fg":{"text":"Scott was very pleasant and attentive to my needs. The food was de-li-cious! Thanks Gordon","useful":0,"cool":0},"1tlJ7vc0s60398htMajhbg":{"text":"Just a very disappointing experience. I felt like I just wasted my time and money. I will ","useful":0,"cool":0},"njgwfTleXVzlIMD4cJymoA":{"text":"Love this place! The service was great, we enjoyed our cocktails and the food was tasty. I","useful":0,"cool":0},"XO6C7CKZu4XLLoJxIFz8jQ":{"text":"Two words: raw chicken. I hate to do it because I really like this place and it is conveni","useful":7,"cool":2},"CfMr-bgGbG5DiMvk7_QtuA":{"text":"Very good burgers and the Cajun pasta was so good. I received free garlic fries with my ch","useful":0,"cool":0},"czw5w4wP-QIUuuQzREfoEQ":{"text":"Ate here out of location at first... being there was a weather front running through NO th","useful":0,"cool":0},"1g6hKzEs_rQ4C5yQ30hvpQ":{"text":"We stopped on a beautiful day to have drinks outside on Fulton Street.  My DH and I were t","useful":2,"cool":3},"UfgmCVfHvn5zM7_b-waJ9w":{"text":"Had dinner here during the EMS Expo - large party. Server was so funny and efficient. The ","useful":0,"cool":0},"9hFGou8eBXDkoaR9m4Y6VQ":{"text":"Had a variety of beer, all were great! The Cream & coffee stout was amazing! Our bartender","useful":0,"cool":0},"fqDLB3w6_bWBMF7yJN8E9w":{"text":"I always enjoyed my visits at Gordon Biersch Brewery's in other cities and decided to try ","useful":0,"cool":0},"VWYQmmiy2uxdsl6ULFmXSg":{"text":"The only thing that is decent about this place are the reasonable prices. Everything else ","useful":0,"cool":0},"DbPavDgX7jJlCCkisecjBw":{"text":"Fast service, great food! Friendly server. I shared a ribeye and they split it in two diff","useful":3,"cool":3},"nSKpjMRdKs6B5w6jHzhgiA":{"text":"Eh. Not as great as everyone thinks it is. It's just like TGI Fridays or Applebee's. Good ","useful":2,"cool":0},"Gh_KEsn0Y5EovkJJRw_FvQ":{"text":"The only reason I'm giving this establishment a one star is Yelp will not allow zero. The ","useful":4,"cool":0},"ZV_k5eZnjqZTHbizePvmxA":{"text":"This was just mediocre. The service was average, but no personal attention or real definin","useful":0,"cool":0},"hsGM9sM9treGDnvlHvZTyw":{"text":"Came here for a friend's surprise birthday dinner. The spinach dip was heavy, but good. I ","useful":2,"cool":1},"mQGtIHQozrQo6DppS8zh1Q":{"text":"Very good food! I love the sliders there awesome!\nThe service was great I always eat here ","useful":0,"cool":0},"fBVTDe3lwIlKbdLMeXR0cg":{"text":"This place is right across the street from some of the major hotels in the area so easy to","useful":0,"cool":0},"Tlvr-98L-nvDaE_civSiOg":{"text":"I got takeout from here via doordash last night. The food was ready about one minute after","useful":0,"cool":0},"hRP1V8jt4cgMwuFR56tFBg":{"text":"This restaurant is in complete compliance of covid  social distancing. So it was understan","useful":0,"cool":0},"l4wrEAOeXB5hd9fRdsGw5g":{"text":"Hands down the worst dining experience I've had in years. We sat down at 5:30 and ordered ","useful":2,"cool":0},"oEQzsWJ5wmADFQyLY5H3pQ":{"text":"We were a small party of 3 and walked in 11:35 on Saturday night, mind you they close at m","useful":0,"cool":1},"CE9OUCQXcaS0p0C1L1WlNg":{"text":"I have been here three times in the last year.  I would only recommend coming here for the","useful":0,"cool":0},"yNIbsgfEWyHrlAZx2S0boA":{"text":"Hooray for Gordon Biersch's atmosphere (especially the well-lit outdoor dining area) and p","useful":18,"cool":20},"1MKdbrACfPi-LR27-sGLYw":{"text":"Service was terrible.  None of the staff was friendly or attentive to us!!! Bartender wasn","useful":0,"cool":0},"kch9mRiYqr5SCc2yfKcvDw":{"text":"Very good food. Fries were very good, wouldn't say legendary but I'm hard to impress. Fish","useful":0,"cool":0},"MJX-Jrhwg8e67hw-noBCsQ":{"text":"Good food but very rude waitress.  Didn't like to answer any questions.   Asked about rewa","useful":0,"cool":0},"hZLDelG6fUVecQf9QHXXww":{"text":"I've been to this restaurant a few times and have enjoyed the experience East time. I most","useful":0,"cool":1},"VW5CueMTL85edJEt11iFAw":{"text":"Terrible. We called ahead because it was New Year's Eve and thought it would be packed. Th","useful":0,"cool":0},"AgcIcjzm8sqjlD1QDYHsmQ":{"text":"We visited this Gordon restaurant on Saturday night before our Marathon. We were in a larg","useful":1,"cool":0},"8z6MvgEYdswWWASLBqH5Yg":{"text":"ThE opening to the dining room was simple but nicely designed. The menu had many items to ","useful":0,"cool":0},"cxnMrHqYwl32m083N6f2xQ":{"text":"This restaurant used to be part of our ritual when we checked into Harrahs hotel.  Walk ov","useful":0,"cool":0},"_q1I0ucAjcVXmge-h_7D0g":{"text":"So far this has got to be one of my favsies!!! Everything I try is good here. The southwes","useful":1,"cool":0},"gLnH7x_H5OV4Y1-ZraW5LA":{"text":"No handicapped accessible seating available, not even sure if that's legal. Menu has been ","useful":0,"cool":0},"0FVM-AsM20usHxcdk9sL2A":{"text":"The food was delicious and the service was so great! Honestly, I would put this on the top","useful":1,"cool":2},"M6RTxIE0wEJPmoe9hjYkKw":{"text":"We went they say they reopened. Didn't have full menu, but food and service were both very","useful":0,"cool":0},"dGJlnQfEl_QZNvG54XFtMw":{"text":"Are you kidding me? We walked in and there was an hour and 15 minute wait. Keep in mind we","useful":1,"cool":0},"y0bh_TzFRr6_ty5-Qa-Hyg":{"text":"Worst experience ever!!!! Went there last night with a group of 6 people. Took the waitres","useful":1,"cool":0},"JrPSysNYfzelzuulMXH5DA":{"text":"My husband and I went as he used to always go to the one in DC before we moved to NOLA for","useful":0,"cool":0},"YYg281Qb090NnpXtVJUAQQ":{"text":"I always read others reviews before I go into a place of business. Poor reviews don't alwa","useful":0,"cool":0},"6JXV7DHe3PFTHXbeEOhsGQ":{"text":"I confess: currently my food has not arrived. That being said, a colleague of mine observe","useful":0,"cool":0},"-efmWDWj0WvmBL-8yTxVNQ":{"text":"Went during essence fest weekend so I knew there would be a wait. Our waiter was very nice","useful":0,"cool":0},"xLbVSrCFlu0noHQrlU9fOQ":{"text":"Food was mediocre at best with the exception of the 23oz Gorgonzola steak. Perfect texture","useful":1,"cool":0},"fzEcCTAGSGsOcpnUt35oxA":{"text":"Food wasn't bad. Not the best but fairly good. Soup was cold, though, which took away from","useful":0,"cool":0},"QcLQSgmHUpiS9ahp4QhK9Q":{"text":"They have a really good selection of craft beers. I recommend going for lunch because some","useful":2,"cool":1},"17VluBZv4qCUCz3v7Ew_2w":{"text":"Came here back to back, mainly because it's open late night. I like it here because you ha","useful":4,"cool":1},"YLVTi5MrCJV0-N-YniVeYw":{"text":"We got here pretty early around 5:00 and it was steady. The crew was just getting ready fo","useful":1,"cool":0},"I7pLSAL6soW1o3pU1fGkOA":{"text":"Don't come here if you want to experience good New Orleans's food. This is like going to a","useful":1,"cool":0},"GoksOVatJBRAY-1lbfsMeA":{"text":"Service was horrible. Out of many items on the menu. Only one entree served. The rest of t","useful":0,"cool":0},"u0i6Zf_JEbnk0xCLiq-aiA":{"text":"Great food. No drink refills. Horrible service.","useful":0,"cool":0},"hcTlNfEq39WB0HI8u6k0Wg":{"text":"I'm so glad we decided to eat here while staying at Harrahs.  The staff was very friendly ","useful":0,"cool":0},"9PwIcCfy7PicByWaCsa5yA":{"text":"For me the Gordon Biersch Brewery can be described as a solid \"good\" restaurant. Everythin","useful":53,"cool":50},"A85gcTiIxBJZIJ-8SwMinA":{"text":"Hands down the worst dining experience I have ever had.  Sat outside to watch the Saints g","useful":0,"cool":0},"JOELcho_A_FYPlmwor-e_g":{"text":"Visited New Orleans with my husband for my birthday weekend 9/18/14 thru 9/20/14. Discover","useful":0,"cool":0},"0hRPO0M7L4Mip1ZECwylAg":{"text":"Loved the food, but service was a little slow.\n\n1. Husband ordered the ahi tuna steak, and","useful":0,"cool":1},"yia82lpSJ4_ZXnd-oYxgRQ":{"text":"Staff are awesome considering the short staffing. They are doing their best and staying po","useful":0,"cool":0},"gfHnxuMAzsQQtwvD1NRu5w":{"text":"Well we tried for three days to get into this place for s as beer. Each day they was an is","useful":0,"cool":0},"vi7N-BCe9N84cQb9rS-StA":{"text":"I searched online to find a place close to my Hotel since the Hotel restaurant were all cl","useful":0,"cool":0},"bl6IAdwKNgtasgYEOcv3Uw":{"text":"Service was good with the waitress but the food took 1 hr and half be served .. ribeye ste","useful":0,"cool":0},"K8PVtqiXO7dZihreHmxQng":{"text":"This place ran out of food and was rude about it. The server was pretty much like oh well ","useful":0,"cool":0},"nlGgRgMrtbTUza4KAJ7nsA":{"text":"Gordon Biersch - standard brewery and restaurant chain. It isn't gonna knock your socks of","useful":3,"cool":2},"TnZDvAn26mtrX0yIs6NzNg":{"text":"Probably my least favorite spot in New Orleans.  Really generic and bland on all counts.  ","useful":2,"cool":1},"vJZQ2goSt6zalNKXAaDr8A":{"text":"I've been to other Gordon Biersch locations and this one was just OK. Bartender was friend","useful":2,"cool":1},"VB378HyJ5zXofM_L56sfGQ":{"text":"Walked in from the patio, several tables unseated but all dirty, walked to the host stand.","useful":1,"cool":1},"b3qOPE9tM6f64wyo1AkvRA":{"text":"Today was my husband and I's first time at this restaurant and we LOVED it! We had a short","useful":0,"cool":0},"6g6F2NDBqjYVy7e0T0v68Q":{"text":"I've experienced a lot better elsewhere and at Gordo n Biersch!  Party of 8 adults, 2 enjo","useful":0,"cool":0},"rGavbUhXsILqL7h4W9MsUQ":{"text":"Stay at Harrahs a couple times a year.  Had eaten here before and was looking forward to b","useful":0,"cool":0},"yR3_M5P8bjmVDEaLXx8fuA":{"text":"I have been to several Gordon Biersch Brewing Company restaurants in the past in several S","useful":14,"cool":11},"qTAA08-QtrWhTyACN2YiKg":{"text":"I loved dinner here. Made a reservation for New Year's Eve dinner and was seated immediate","useful":4,"cool":7},"BGFaSRnEENPYf-TrsB4cjA":{"text":"Worst GB I've been too ever!  Garlic fries were not the normal quality at other GB's, our ","useful":0,"cool":0},"LkcmSnd2XaxoMhml-BlUHQ":{"text":"Only had the craft brew so reviewing from that standpoint only.\n\nSuggest doing the flight ","useful":1,"cool":0},"peNa_9eYb3BOlyjw1q3Wxg":{"text":"I first came to this place on New Years Eve. As soon as I saw Czech Pilsner I knew I wante","useful":1,"cool":0},"jpKf4rhqZkCZkDm9EPJpJg":{"text":"We were PLEASANTLY surprised with our great experience at Gordon Biersch. I was hesitant w","useful":0,"cool":0},"pywkvYxldiLGvOGuK_wEig":{"text":"Decided to check it out being that it was next door to our hotel.  Let's me start of by sa","useful":0,"cool":0},"sa9JGPTASdFApm-UQn7JiA":{"text":"Thanks to the manager, this rating went from two stars, to four!\n\nI'm not much of a chain ","useful":0,"cool":1},"hoBJU-SjsmenjjXVkitVDA":{"text":"My family and I walked in at 2:03p today, hostesses had their backs towards the doors and ","useful":0,"cool":0},"G_q7Dp3F9wP51vzbzsCSZA":{"text":"Usually just a great chain to eat at (and get free comped parking for 4 hours downtown), b","useful":2,"cool":0},"LJ5VU61YFCEanJHM-pM1IA":{"text":"How strange I used to have a review for this establishment but yet AGAIN somehow YELP has ","useful":4,"cool":3},"2mX-bPhkmXKZGIqimNJ57Q":{"text":"going, going, gone!  used to be good when they first opened, my visit today was my last.  ","useful":0,"cool":0},"Z9PtAOkasQEp4gEJr6twYw":{"text":"Came in dressed very casual and the hostess was very nice and accommodating. Sat me immedi","useful":1,"cool":0},"1DH6LeB12W9F3HtNJ-STyg":{"text":"This is right across from the casino and a lot of gamblers come over to get a bite. We wer","useful":1,"cool":1},"mgXGocG1sXL78avF-D2lqw":{"text":"It's a chain restaurant so I don't know that they can make any improvements on the quality","useful":1,"cool":0},"uwMZ5H7NVhTF-FrXQKY_4Q":{"text":"Only gave it 4 stars because of the staff food is definitely 5 stars! We tried to eat here","useful":0,"cool":0},"_HDgNxH4Sb8VLVKDy1a5EQ":{"text":"This places used to be my favorite!! LOVE the garlic fries! Went last night for a later di","useful":1,"cool":0},"XGDGpjgUlsUxheHucy_h9w":{"text":"What a nice place to dine - it's bar/pub food in a classy - upscale atmosphere.  It doesn'","useful":4,"cool":3},"RycrN-wdgZRG885E-9xhOw":{"text":"It has svg rear atmosphere and friendly staff. I don't believe they had a big enough table","useful":2,"cool":3},"NBEPT6F-e2zd4kOQdDEGLw":{"text":"We had a friend who has a shellfish allergy so we really couldn't eat anywhere else except","useful":2,"cool":0},"AAGTRIp8k89_nOHa-jtL1w":{"text":"Garlic fries were good.  Wish they had cheese chili fries!  Ordered it to go, did not wait","useful":0,"cool":0},"SUC9f1TgXEBcs5h0YGGIgA":{"text":"Visited 9/17/2020.  Not sure if it was Covid or just bad staff but this place is a dead zo","useful":0,"cool":0},"8HOgIkC2T8Ko-Mo9wEkFuA":{"text":"Terrible service - walked in and was avoided for 10 minutes - don't suggest this place if ","useful":0,"cool":0},"FYUSv6iI1glc0HEBP-pbdg":{"text":"Food is fantastic. The pineapple mango margarita was watery. But the service was the worst","useful":0,"cool":0},"crsCJ0wuggyn8M3p6QDAkg":{"text":"Authentic german beer.  I love every one of GB's beers (except the blonde, it's just a nod","useful":2,"cool":0},"kQAUvbYq7hVjhCu0IcNOqA":{"text":"Food was great, our waitress was very nice. I had lobster and shrimp tacos and my daughter","useful":0,"cool":0}}