{"8cfgxFJVQZL2pQBvaVNmkw":{"text":"I love to shop locally. So on this breezy Saturday morning I decided to drop in for my fav","useful":0,"cool":0},"s3RUb7x-Ht7_Q-0H6pbWFg":{"text":"What a little gem!  We found a coupon for this place while at Cake Cafe and basically ran ","useful":1,"cool":1},"S4kGCXSZ_g61151xsz1sZA":{"text":"People have one bad experience and it's all over. I get it, stuff happens. We are humans a","useful":5,"cool":2},"Wc0BWgS7td4iqJPyMuiMwA":{"text":"It's a much-needed resource in an area without a lot of access to fresh produce. I found t","useful":2,"cool":0},"N7T9IjkbPXxKLUokLhQTCg":{"text":"The Food Co-op offers hummus cheaper than Wal-Mart (Lillys vs. Sabre by ounce).  The 5-sta","useful":9,"cool":3},"16Hu-rtB_GpM6BOSNfg-Kg":{"text":"Great place. Selection is very good, including gluten free foods. Had to go to Whole Foods","useful":2,"cool":1},"qBpRDI8-Nl3EEtVEJO4xsg":{"text":"First off people need to realize that good quality, healthy food costs more than low quali","useful":6,"cool":3},"rdqxf5NBVXgzkdJxfq8HNQ":{"text":"I've been here a few times (as it is the closest full-service grocery store to my house), ","useful":0,"cool":0},"0OX5Ur841h9ShlcMJBFCVQ":{"text":"\"It's a little ahead of it's time for the area which is a good thing.\" This says it all. T","useful":7,"cool":5},"9hIxM2pvJ7z2YaU7anOjuQ":{"text":"Some of the food costs a little more than at a Walmart, but if you look around you can fin","useful":0,"cool":0},"gucF6arjOu2KUvuJDFgH-Q":{"text":"I rarely shop here anymore, too many bad marks. I'm dissatisfied with the selection. For a","useful":7,"cool":0},"Jr9v00P6WNf4duSZFik8mA":{"text":"I'm so saddened and let down.\n\nThis store needs resourceful management.  This is a tough b","useful":6,"cool":3},"j4mvtP3qM6s7A5k8CCND2w":{"text":"Located inside an indoor mall that is across from St. Roch Market.\n\nI came by here with my","useful":4,"cool":1},"vCAWv5C7rdjY62FxXUrUYA":{"text":"I had some of their veggie salads for lunch at $3 a container and it was tasty and healthf","useful":0,"cool":0},"4DuqZf0Rj82aNFNMDoOe9g":{"text":"I couldn't get heard down at the New Orleans Food Co-op so I'm posting here. Fair warning,","useful":11,"cool":0},"_5hS9CaELdGlfFZ4O_allw":{"text":"This place is just absurd. The prices are beyond what any sane person would pay for any fo","useful":13,"cool":9},"Z3q2cHSsEe62BOKeCqfchA":{"text":"I am so so soooo Happy The new Orleans Food Coop now exists!\nThey carry High Country Kombu","useful":5,"cool":3},"ulQlTzp3MFh9hdELkQOS8A":{"text":"This co-op just gets better and bette. They have everything I need from amazing produce, s","useful":0,"cool":0},"kfIjqDSbAmYnJl9IuVv8hw":{"text":"I can't say I know much about co-op's because this is the only one I've ever had the pleas","useful":1,"cool":0},"fqI_Aq-VngwwAL7uUnWMpQ":{"text":"One concern I had when planning the move to New Orleans was the availability of quality, o","useful":0,"cool":0},"0AsAkImOBERPDTzPMmf1eA":{"text":"I wrote a whole diatribe on what my problems are with this place, but I'm not going to pub","useful":16,"cool":7},"VI7jhBisQamSBFakiYKMqQ":{"text":"I really really REALLY wanted to like this place. But I just don't.\n\nI have pondered wheth","useful":8,"cool":4},"bWecFsxVc9Lozs4M4wL0aA":{"text":"OK, so perhaps I was a little hasty in my eager anticipation of the opening of NOFC.  Don'","useful":12,"cool":8},"u8SI1-9xy4pXm1pQepfSxQ":{"text":"I can keep my supermarket phobia under control here, therefore I find the Co-Op to be AOK.","useful":14,"cool":4},"pjuo8SPUPWKGjwe5dlaNwQ":{"text":"they have reusable bags! they're in a funky indoor mall-type place with its own police sta","useful":2,"cool":2},"5ULXcXBB87CAziqIdiGk5g":{"text":"Having moved to NOLA last July from California.. I miss Trader Joe's terribly. They have t","useful":7,"cool":3},"lwLETrNPMMtYFknAC7rNtA":{"text":"It just opened yesterday and I've been twice so far.  Produce is ultra fresh and all local","useful":3,"cool":2},"kKwnJOAy5g6_g16T58VKJA":{"text":"What a great place. I can't really comment on parking which other reviews mentioned, as I ","useful":0,"cool":1},"zFzMfFZGZEJ4EslBGS25RA":{"text":"I go here literally every day. The samples are fun and the selection is excellent. There a","useful":0,"cool":0},"2rQKPb2J_BqjJfK8liNLyA":{"text":"Ignore everything but the yummy produce and dry bulk. (The rest is super expensive)\n\nHowev","useful":6,"cool":1},"mK3jMaQ8vGIpxdFnkOn9cg":{"text":"I am a member and support the idea of the co-op. They could do a lot better, but they do g","useful":0,"cool":0},"CpBo7J4K7xQ6HsiG5y0plQ":{"text":"This co-op is just getting started but is already a fine, modern, healthy grocery store...","useful":1,"cool":0},"wWIGYbetBGYA70zj9hImUQ":{"text":"At the opening I gave this place four stars, because I thought it deserved as much simply ","useful":6,"cool":1},"MYSDxy3pdPD4vjPQz912MA":{"text":"It is an ok little market with some good local and organic produce.  They have an interest","useful":2,"cool":1},"k6VEUkxmdZBH2OxCiSEf-g":{"text":"I am hoping that this place does better, especially because I am a member-owner. I love th","useful":14,"cool":6},"8W4ZaIEr1kG8pp0VCUkD8g":{"text":"OK, I went into this place with an open heart & an open mind. I knew it was going to be pr","useful":13,"cool":4},"lsTlxTvydy4SS7OlqJ_Vyg":{"text":"Ok so I've really, really been trying to give it the benefit of the doubt.\n\nI bought into ","useful":24,"cool":12},"pLKzO93a1kdHaWbbMVnneQ":{"text":"NOFC is an excellent asset for New Orleans. I'm very pleased with the selection, prices, a","useful":5,"cool":2},"bEYomZeCEFSgZxONKZTGQA":{"text":"Came here twoce to grab groceries during my stay. There were not that many places we could","useful":0,"cool":0},"R1FULbY-VwbJL9fbOCnIxg":{"text":"Ok, there are some bitter realities that need to be addressed.  Produce and bulk is great,","useful":7,"cool":3},"CMStFHKLD88Qh_ADRmIVFw":{"text":"The salad bar is a great deal. I often put together a decent-sized salad with mixed greens","useful":3,"cool":0},"KvXpbtGaZ0Ri87jVweNgjw":{"text":"They have all your health food needs for a trip in New Orleans. Kombucha, vegan chocolates","useful":0,"cool":0},"-rwLbgAof2y8kWRqfLL6Ug":{"text":"This place is soooo cool I love the way they make you feel; the hole feel of the place is ","useful":0,"cool":0},"t4xYgELwPO_jMZTc14MaZQ":{"text":"look for the sales, cha-ching, the savings!!!","useful":1,"cool":1},"LJOt0izpkMhTiVNA_RZAKw":{"text":"This place literally isn't even a co-op. they just call it that.\nI've talked to a bunch of","useful":7,"cool":2},"cDhD-66hD7UyoNUsNaYhhg":{"text":"I shop here regularly the 1-2 times a year I'm in New Orleans for vacation. It generally h","useful":2,"cool":0},"VJO14xRK5oAD6f9QuOqqeg":{"text":"I was visiting NO this weekend. We wanted a nice salad and some meat to throw on the grill","useful":8,"cool":5},"PaTbhucSsjgQJuU39kx3nw":{"text":"YES This business is a little pricey, but it has an incredible mission to support local bu","useful":2,"cool":2},"MpGXY7mv9BzYq-4HinBAvQ":{"text":"By far the most amazing place on ROBERTSON BEAUTY ROW ......\nLove love love the service , ","useful":0,"cool":0},"AJBU28XxmKBcVUkx7UVOOA":{"text":"I've been coming here for over two years now. I even became a member. I like to support lo","useful":3,"cool":1},"PY7wwAKA-V3dja_8_QcjZQ":{"text":"I like the idea of the co-op in principle, and it's not a bad store. It's smaller than a b","useful":1,"cool":1},"3_aKZoqbaaKky1rlEDKnLg":{"text":"I really want to love this place because we sure need a viable food store in our neighborh","useful":4,"cool":0},"6S1kp9Z2ToVWFzAX-fgMsg":{"text":"Great, but small selection. Has some ready-to-eat vegan options. The cashew curry tofu wra","useful":0,"cool":0},"I0hIEwndvWIncDBuE2Gb6Q":{"text":"I really like to co-op. Eating a meat-free diet in NOLA usually means getting greens cooke","useful":1,"cool":1},"yC7wigHMTnOCoRUFpv1mZg":{"text":"I feel like I can keep this short because other reviewers have already touched base on my ","useful":4,"cool":0},"XRUyiD7fUA4Ex3OO722Awg":{"text":"I would love to share my amazing experience with Dashka at Beverly Hills Microblading , sh","useful":0,"cool":0},"2O0ArJtF9kwc5Z4Hn3TGow":{"text":"Billed as much needed affordable, healthy grocery in an underserved area of town, the Coop","useful":6,"cool":2},"Yh1MJ-IPlhWRLE1WugX1Aw":{"text":"Cute co-ops are my fav places to shop. This is a good choice in what feels like a market a","useful":4,"cool":3},"wGEje40vQHdNpX1GzWxC5g":{"text":"Great to visit for quick grabs or a full dinner! It's connected to a local community cente","useful":0,"cool":0},"5I3R-G1N_xvxX_UzgY-lgg":{"text":"Perfectly nice co-op with lots of selection.  I was surprised at our bill - higher than ex","useful":0,"cool":0},"EIDlq-6d57g-rNoAlqzxug":{"text":"I hold this place very dear to my heart. They have both organic/conventional produce but t","useful":1,"cool":0},"Mt7--6wWC4PpVk7aglveqA":{"text":"Highly recommend Beverly Hills permanent makeup to my friends and family.  Dashka is very ","useful":0,"cool":0},"43Xw7Ra0q3-f75wuOcVRrA":{"text":"The co-op has been SO EXCELLENT lately with tons of local produce and meats along with nat","useful":1,"cool":1},"Nh87I_gInNuhC_THVAt4kA":{"text":"New Orleans was in dire need of a cooperative, however, this is lacking. The produce is de","useful":3,"cool":1},"XagNc6yS6gefewWn6CMBFg":{"text":"Finally a healthy foods grocery in the downtown neighborhood.  If you live in New Orleans ","useful":3,"cool":2},"ZGhCg2NzM6Q3uLsLpV2zJA":{"text":"I love it here. The staff is friendly & helpful, the place is always clean & they are defi","useful":0,"cool":0},"XPJ0Y8188lhKK_jVHi-XuQ":{"text":"I'm an out-of-towner, and was thrilled to find the NOFC within a short walk of where I was","useful":1,"cool":1},"jzEKIVL4lNyX29r7JRxnfA":{"text":"The Co-op is a great grocery option in the food desert of the Quarter / Marigny / Bywater.","useful":2,"cool":0},"NKKIxT0596ws1GVffDSxOQ":{"text":"Decided to make a salad and grab some of their ready made salads from here and my girlfrie","useful":0,"cool":1},"q4NBLhWM2VHRRDnvR8NYEQ":{"text":"Staff is fantastic and helpful! Store itself is kinda small. Was hoping for more options.","useful":0,"cool":0},"W9NMRpxgbTf83s7-Zal01g":{"text":"I'm new to the area and this was my first visit to Robert's.  It was disappointing to open","useful":0,"cool":0},"g4IMiqdkxG8tfsyd9ipoGQ":{"text":"As far as co-ops go, this is probably the worst one that I have been to in 5 states. The s","useful":0,"cool":0},"RAN8Zvqlj1dbM28sto8SJg":{"text":"I loved this little co-op. They had all the usual local, organic, bulk, eco-friendly, and ","useful":2,"cool":0},"BmoXGsUBY8MktK9pHIVnlw":{"text":"I became a member as soon as the flyers came out. I expected growing pains etc. I think th","useful":0,"cool":0},"2_gawOt93XNJrUzjgmd6fA":{"text":"As I'm temporarily disabled I ordered some groceries to be delivered through Waitr. They w","useful":3,"cool":1},"BzUKsCVTBs1cZMd0rLDqiw":{"text":"If I lived in NOLA, not only would I always come down here for my grocery shopping, but I ","useful":2,"cool":0},"lGx2ca8VLbF3iTUFIRcraA":{"text":"Quality & safer food cost more to produce. Educate yourself about the \"cheap\" food you hav","useful":2,"cool":0},"pJOgtyaHV2H5nz7ulerRgQ":{"text":"Despite the neighborhood, I totally expected this to be one of those snobby expensive for ","useful":5,"cool":1},"RCNvdmTwKPZV_wsGjNaStw":{"text":"Went back to Robert's with picture of a spoiled Sumo orange and the manage refunded my mon","useful":0,"cool":0},"LQaAzd2DzZUG_advxMbVLw":{"text":"UPDATE: I'm dropping 2 stars. I didn't pay $100 membership to shop at a small Rouses. Inst","useful":9,"cool":3},"UM9QeyV2BZXhyxrwgYgDZA":{"text":"I was looking to buy some pumpkins today.   The ladies at the Vixen suggested the food co ","useful":8,"cool":4},"t0SvlfxXZXidTuSNRleaFw":{"text":"I was so happy when this was announced.  Not so happy anymore.  The neighborhood needs a r","useful":10,"cool":7}}