{"Gnq_YCSLtfl68GTof9QWRg":{"text":"I LOVE this place. It is now run by Antoinette's daughter, as Miss Antoinette passed away ","useful":1,"cool":1},"aMxSe_bxiAri2pOaetej_g":{"text":"Kermit's place has the best music and people in New Orleans. You'll be glad you went.   He","useful":0,"cool":0},"LCdZAbtdm-RwIyToOI_ZaQ":{"text":"K-doe, RIP, was a god of guitar.  he could play any song he heard, even if it was only thr","useful":1,"cool":1},"qPIAy0NhQHsn2G6LJnD47g":{"text":"along with the Treme 7th Ward Festival going on next door under the overpass...the highlig","useful":0,"cool":0},"qhpkk32faYy-pXD11JS64w":{"text":"This place is now Kermit's Treme Mother In Law Lounge. We went there on a friend's recomme","useful":0,"cool":0},"JK7P2lsnKDsffQcgnpyekw":{"text":"I wanted to love this place and considered it a bucket list item.  Love Kermit and love th","useful":1,"cool":0},"Wv5wdIh80_cn8VRXNL9rSw":{"text":"Mother-in-Law Lounge is officially closed. It was great when Ms Antoinet was alive to keep","useful":1,"cool":0},"CvIu3gpVa0vOjYroKm6hVQ":{"text":"We made a point to come here on our visit to N.O. because we heard the Treme Brass Band wa","useful":1,"cool":0},"JE30TyQDYC1lh33xullF1Q":{"text":"Most fun you can have with your clothes on!\nGreat bar. Great drinks. Great people.  And yo","useful":0,"cool":0},"ejTm_6fwxfeqTYR3A_S-WA":{"text":"Great local spot.  I've lived here for 4 years and finally made it here.  As a Caucasian I","useful":1,"cool":0},"m_QoriChtqrpKQ0ZYJuibA":{"text":"I've been wanting to go here for years. Regret not making it before Ernie and Antoinette p","useful":3,"cool":3},"7nzC9EJg6p_s1V7yP0JRIg":{"text":"Kermit changed the place from a dive to a small center of all things Kermit. Its still a g","useful":4,"cool":4},"o_AT6pniFvLHQPRGUZC8Dw":{"text":"A self proclaimed \"Emperors of the Universe\" just is not going to open up a half-assed bar","useful":3,"cool":3},"Kwna-TYXw4kwuQpJaadNow":{"text":"First of all the bars new name is Kermit Ruffins Treme Mother In Law Lounge. Kermit purcha","useful":7,"cool":0},"Ma0U0mBLT8gsGh7lte0MWQ":{"text":"It's kinda fun to say you've been here. \nThere is so much interesting history and eclectic","useful":3,"cool":0},"MghrBChl96eYT8OZzwUXPQ":{"text":"We all know, well most people know that the lounge is closed and hopefuly will reopen soon","useful":1,"cool":2},"fX5QvITNJO_bqPmCEHhDKw":{"text":"Caught The Treme Brass Band at their first Sunday residency here and was blown away. Frien","useful":1,"cool":0},"8-9T-uqgXrztxpsMzS3wVw":{"text":"The Emperor of the World, Ernie K-Doe along with his lovely wife, Antoinette, also known a","useful":3,"cool":0},"4QGK-TO7xVLVP77uVzzCeA":{"text":"Not to beat a dead horse...but this is a unique place to hang out.\n\nI've always thought th","useful":1,"cool":2},"iJ3zuR0wWUX2uTUes0Ntag":{"text":"Dear Antoinette, I love and miss you!\nOur last names sound the same, so it was fun introdu","useful":1,"cool":1},"RqXV_zGF46z6oArm_F8Sbg":{"text":"There's no way that you can come to this place and have a bad time. Especially when owner ","useful":1,"cool":0},"hC0kxviXT3wXrD2HJKHPPQ":{"text":"Cool New Orleans neighborhood bar ran by Kermit Ruffins. This place always has a food spec","useful":2,"cool":3},"TA6S_6vm-7lBbUEZNKSmjw":{"text":"I still miss Ms. Antoinette. What a gal she was.\nYou just never knew who would stop by. I ","useful":0,"cool":2},"CA9pUMv_yAbKIwFfvNetTg":{"text":"Misleading, the food given was cold and it seemed like a snack,  I was charged 20 dollars ","useful":0,"cool":0},"2QHcjrIcu8o1w2eI_2j_Ng":{"text":"Went in summer of 2010..had cheap priced beers served by k does daughter..had a good band ","useful":1,"cool":1},"jCH9apTQiLZVcnuBTY0aRg":{"text":"I attended a very dear friend's wedding here once, but make no mistake, this is not what t","useful":1,"cool":1},"eEr_lM5uYLriPbWgMVp6lA":{"text":"So we're in town for a few days on our honeymoon roadtrip from South Florida. A friend fro","useful":3,"cool":1},"2A0iVilqtkdPALaJO4t3LA":{"text":"The location on Claiborne is a useful filter against the slack hurricane guzzling idiot wh","useful":8,"cool":6},"dUlvhobXMZBb5HsZMQfcPA":{"text":"This place is the real New Orleans! We were visiting from out of town and my friend sugges","useful":6,"cool":2},"Ez1B8w_p8NXEhlHEZufahA":{"text":"It was my first time in New Orleans so I knew I had to check out a Kermit Ruffins show. Wh","useful":9,"cool":3},"jHi-Q2ODrgAWtboZ8mkudg":{"text":"Amazing spot for some real New Orleans music. Beautiful vibes all around. Kermit is so awe","useful":0,"cool":0},"Whj0ryX5YVBrGsE_5KWLhg":{"text":"If you are a Kermit Ruffins' fan, this is the place to be and one of our favorite intimate","useful":4,"cool":2},"rYrkFBowJIHToieI-aPsbQ":{"text":"Yes. Yes. Yes! If you are looking to experience true New Orleans culture come here on a Su","useful":2,"cool":2},"DgDYHOK5rQG6axVeZe85RQ":{"text":"This was probably my best memory of New Orleans. I wasn't sure what to make of the $20 cov","useful":1,"cool":0},"-bBvHV4sC2veRh3tPKuI0A":{"text":"I saw this on Andrew Zimmern. Sunday is the day to go. They have their live band, that goe","useful":0,"cool":0},"gCBrX3v2Mt6T-svxidz6WA":{"text":"We were fortunate enough to find out about the Mother In Law Lounge while visiting NOLA. T","useful":2,"cool":2},"WItjlqE6euRUMHNkXpcZWw":{"text":"This is a true juke joint!!!! Went on a Sunday. They had a band come out on the patio and ","useful":1,"cool":1},"kkn9Y5GTa7BYjMoXOdu2TA":{"text":"I have never felt so welcome in a restaurant. The people inside made jokes with us, the wo","useful":0,"cool":0},"VnlLzPvlCQPGFO-Cwv0tqw":{"text":"Just happened to be walking by and stumbled upon a second line here June 2019. A prominent","useful":1,"cool":0},"SWe-hiPqXJbwB7uObcJ_NQ":{"text":"Tuesday Feb 4, 2020... not open at 2pm. I read about Mr. Kermit & the lounge at the Lower ","useful":0,"cool":0},"XODOgTRDpv-wkrKYho9HYw":{"text":"I have mixed feelings about Kermit's and it may have just been an off night. If you come o","useful":4,"cool":0},"BU9KySQdYEkSRK2icxqnRQ":{"text":"Seriously by far my favorite bar in NOLA. We love that they pretty much always have a live","useful":5,"cool":7},"e2IDyjopJPxDFwoZuFQGuQ":{"text":"Trap Money Benny could step into this spot, and be welcomed. Funky. Loud. Lively. And the ","useful":1,"cool":1},"AiQT7p4nA7_5ithzG72dXA":{"text":"It was a long walk to get there, but worth it. Food is serve outside where a friendly BBQ ","useful":2,"cool":0},"UhRGE_IzSFPHjqL44TOZPg":{"text":"What an experience! The staff was very welcoming to tourists. The beans and rice was the b","useful":1,"cool":1},"N1OGpxEyfj6ZgXloH5mX_w":{"text":"Love this place they always treat us like family. We call it the black cheers. We've been ","useful":2,"cool":0},"M0ik6fs2cJ1WUQzx80kRTQ":{"text":"I fell in Love with NOLA after visiting Kermit's. So much culture and love within the envi","useful":4,"cool":3},"6JzfybkQmI2JtBo8SpF1kg":{"text":"I'll preface this by saying I'd never been to the place when it was Ernie K-Doe's, so I ca","useful":1,"cool":0},"71GKLIq9zUju6ZHFlA75Lg":{"text":"So many of my \"it could only happen in NOLA\" stories start out with \"I was just sitting in","useful":4,"cool":2},"hmVHCQkdV2HNHPCt5y_CZw":{"text":"Best Night in New Orleans: Hanging at Kermit's Mother-in-Law Lounge! \n\nDown in the Treme, ","useful":20,"cool":23},"FPvEtrJ-mNA9xzp7x5mjiw":{"text":"I stayed in the Treme on my visit in July. I came here on a Sunday with a live DJ. The dri","useful":0,"cool":0},"rWxZ8MW2by4cLf0mC29ecw":{"text":"Went back for another go round... I must say that a lot has changed. I went in, took a sea","useful":2,"cool":0},"a8wgvdUtNjx77FYNHwkXoA":{"text":"Kermit is AWESOME! It was an honor to say hello and get a fist bump from him. I couldn't h","useful":1,"cool":0},"i473nXYCyesbRwVrTLPlQg":{"text":"Went in to have a drink and no one was behind the bar. After about waiting ten minutes and","useful":0,"cool":0}}