{"vkZMd27oFNY4qhOms60cmQ":{"text":"I stopped into this place after one of my Sunday brunch favorites was closed. I came in no","useful":2,"cool":0},"Ok_m3NCGB1LOW_2Chlxghg":{"text":"I ordered a cheeseburger to go. There were some potatoes with bacon and cheese sitting beh","useful":0,"cool":0},"R1hr4vLJpufCq-LXm_8pfQ":{"text":"From burgers to waffles to onion rings to the service everything is good. Another gem in t","useful":0,"cool":0},"dfi2lf1eGtYePJvrTPSVQQ":{"text":"Oh my GOODNESS, you have to come here for the char grilled oysters. I am seriously still t","useful":0,"cool":0},"Q-CSnQ-AF_ZsWwBAPBG_QQ":{"text":"Smiley's wins with the good vibes, great cooking, and best prices! I can say from my exper","useful":0,"cool":0},"8i-rzTfwslNXnK40bYN5LA":{"text":"Visted this little hidden gem and lets just saying was impressed with the taste and amount","useful":1,"cool":1},"Soo-QYUJoOgChyNSKd5LHw":{"text":"Yummy shrimp omelette. Prices right , nice people.\nCool friendly spot to stop for breakfas","useful":0,"cool":0},"xn2Emi74MTmNaJI0HmjqRA":{"text":"This place did not have very good service. There was only one waitress and it took 45 minu","useful":0,"cool":0},"QTMz0Y6HP_nGXc6SpS43pA":{"text":"Overall this food will give you \"itis\" . :) It was sooo good. My only complaint was the st","useful":0,"cool":0},"Q3TSPAqtJDQl7sBTJYaV0g":{"text":"Service was excellent! Wife and I had the shrimp platter. Comes with fresh green salad, se","useful":0,"cool":0},"Ouxa-a-tnc5_iDWzVXc72Q":{"text":"This is a delicious place to eat.  We are in town on a business trip and happened to come ","useful":0,"cool":0},"_4j3JwzTWtveZNQpQUhiUA":{"text":"this will be very short.\nhorrible service but great great food ,which is what keeps me com","useful":0,"cool":0},"wEiFa5KJA4l8tE9iKBXjYw":{"text":"Woke up a little later than usual on the off day so we looked for lunch places nearby the ","useful":2,"cool":0},"bUHjYWF2_DF4IU_J_1kUvw":{"text":"Very quaint little restaurant with a flair of New Orleans. This is comfort food at its bes","useful":0,"cool":0},"Jon2lqZuYqbjVe2E96KHOA":{"text":"The food was superb!  I got shrimp PO-boy, my daughter got fried shrimp platter, & my othe","useful":4,"cool":3},"rFf6Bo2RzTRkPryc1wyxlg":{"text":"What a great Yelp find! The atmosphere was very accommodating and staff just delightful! M","useful":0,"cool":0},"i6uPIg6mREhP4C1PlnsbWA":{"text":"Great service, great prices and awesome breakfast!! If you want to get off the tourist pat","useful":1,"cool":0},"tINCy9klPenjlZWoFnqkIw":{"text":"This place is GREAT!  Forget about all those other places, this place is a little hard to ","useful":1,"cool":0},"EckoNMmgyKJT6jc3k5T7TA":{"text":"Good people good food excellent service......this is my go to spot when I'm patrolling the","useful":0,"cool":0},"JXhDc1yMVvDX-wFZ8Tc5WQ":{"text":"Came in on a whim. Wait time was long, but I don't mind if I'm getting food fresh. I order","useful":0,"cool":0},"Jpvci8iAG0WbRHU5PLX1dw":{"text":"Wow!  We had been to visit the PT 305 exhibit nearby and found Smiley's nearby on Yelp.  G","useful":1,"cool":0},"vVcg0QYt-aeuU1heUPKY7A":{"text":"Best kept secret in New Orleans East.  Quaint, small and friendly atmosphere.  The food is","useful":1,"cool":1},"Im4ZK3N_MbilKRO8Tpd8ng":{"text":"Food was great. Service was great. Food took longer than expected to come out. Other than ","useful":0,"cool":0},"7TqhV5sJVbHl1iB1nVVLug":{"text":"We're only in New Orleans for a few days but went today as it was not far to go and I was ","useful":1,"cool":0},"uknPyphYu3N9QFf1Ri3kyQ":{"text":"I spent 3 weeks in New Orleans; I finally found a Po boy worth writing about.  It was fant","useful":0,"cool":0},"J04FfKYM9qEkKpkbKfrqTg":{"text":"I've traveled this road 1000 times & this time we stopped. I must say the food was great &","useful":0,"cool":0},"Xz25Ns-XUbvY-MdnWEO9Sw":{"text":"Even industrial neighborhoods need a lunch spot. Great food, great service, great prices. ","useful":0,"cool":0},"Q9ZT-J0WN9ttZjjioefbOA":{"text":"It took over an hour to get our food and when it came it was not cooked to order.  The wai","useful":0,"cool":0},"Xh4eHkPEmQtYPzjedXNN6A":{"text":"The food here is freaking delicious. My friend had the ribs with macaroni and cheese. Anot","useful":0,"cool":0},"PnuRuUrBJKI6Ftxk3wYvOQ":{"text":"Good steak!!! Like you can't beat their steak plate prices! $10 comes with potatoes and ga","useful":0,"cool":0},"61tlz1ncRlDREn913wT3ZA":{"text":"Regular food. Good service. Decent pricing. Nice spot for drinks and watching sports.","useful":1,"cool":0},"3m01LqmZQWdvbGtCKKRUig":{"text":"So this is a real and utterly true post. First off we arrived here at 7:15pm there was onl","useful":0,"cool":0},"rajBKxlKTh1u7YD8Ebf-cw":{"text":"Probably one of the best places I've ever been to. Everything is so nice. Friendly staff, ","useful":3,"cool":2},"oBGzp3SqcwmSjzWQmcykiA":{"text":"This is the perfect place to go and relax if you want to eat and enjoy a football game. Fo","useful":0,"cool":0},"pE1UN2yLeHveqOqYeOcwjQ":{"text":"I've been here before but today's experience was horrible.  People that came way after us ","useful":0,"cool":0},"arSK9R7YqFc2tK3ljagDFQ":{"text":"The place is in a great location \nHowever it's hot and the service is super duper slow , d","useful":0,"cool":0},"VOVfvsjGeIcanFuntmT6_g":{"text":"My husband and I are from Houston traveling through and found Smiley's with high reviews. ","useful":2,"cool":1},"rEFa8xukoK7pOdhCsxaVxw":{"text":"Delicious is all you need to know . Friendly staff as well. Told me classmates and they lo","useful":1,"cool":0},"cMUArELUuAEQ-y6JpJOGbQ":{"text":"Awesome homemade Cheeseburger and Onion Rings! Great wait staff, and hands down, best meal","useful":1,"cool":0},"SHH87-Xw2XYCNfj8fFA6Lg":{"text":"Service is the worst! Takes a long time if you dine in no matter how many people are in th","useful":0,"cool":0},"d7xTLUHIgtXMcuZuBXutlA":{"text":"The food was absolutely delicious. So far one of my favorite spots to eat in NOLA. As a to","useful":0,"cool":0},"imbLrVBfybsnNuIftM7aGA":{"text":"Terrible experience last visit. Took nearly an hour to get our order and it wasn't right o","useful":2,"cool":0},"9-zL50fanG_c_vDLbM69gw":{"text":"Good food, good service, good prices.  Just go and see for yourself.  We are only in New O","useful":0,"cool":0},"4MgCoDPVncN0bQFZ72ajRQ":{"text":"We came in from out of state for the weekend and needed a quick, affordable place to get s","useful":1,"cool":1},"chkarFmIz2dXQWelum6sXw":{"text":"This place trash ... waited 40 mins for a breakfast order then given a BS excuse as to why","useful":0,"cool":0},"AqEykhrxrbKR0tbXsypQxg":{"text":"I would like to give it more stars because the food, once we all finally recieved our food","useful":1,"cool":0},"uaVr_ZeonD2kSrKOZjIqIg":{"text":"Today was my first day coming here for their loaded fries. I'm highly disappointed because","useful":0,"cool":0},"p-bPTlEg3gBCh_HkxWKdPw":{"text":"Three people eating full breakfast w coffees for 20 dollars? And great food on top of that","useful":1,"cool":0},"IEgOXOHGi2XHSnwvB-gpIA":{"text":"Highly recommend. Calm and laid back atmosphere. You can see into the kitchen, which I alw","useful":1,"cool":1},"wMmCDSVwuIUpIEnj9l8Ssg":{"text":"I've been living 5 min away and never knew about this place until I saw someone raving abo","useful":0,"cool":0},"ffdrgjAbsVKwyDwOGez4cg":{"text":"This is probably one of the worst experiences I've had ever and the worst while here in Ne","useful":0,"cool":0},"7YlyOtNSQqSCXDRExAdEfg":{"text":"I guess they were having a tough night when we visited.  My husband ordered a fried fish a","useful":1,"cool":1},"-4HRh0Y6UdM8dKV7hKWhMg":{"text":"My favorite breakfast spot! Delicious food, clean friendly environment. the prices are ama","useful":0,"cool":0},"zFUap7qlQt8MPOBFgB1teg":{"text":"Average diner food with a lot of seasoning. The restaurant was very busy so the service wa","useful":0,"cool":0},"y1gtsyHYweJGTFxQmhDSyQ":{"text":"On vacation in New Orleans. Went for breakfast.. the food was very very good.. only proble","useful":0,"cool":0},"7CSDwxhJCExbZtwDJLEpnQ":{"text":"Been coming to this place for years, but I stopped coming due to the customer service. The","useful":0,"cool":0},"i20DqGU9k1L4GCPMhtpdgA":{"text":"Wow what a great place. My wife and I are in town for a cruise and wanted to get brunch be","useful":0,"cool":0},"Vz0jk--tYdK_aREUSDedXQ":{"text":"If you order for pickup and is told your order will be 20 minutes, double the time frame. ","useful":1,"cool":0},"7RnoIQjSG4yg8QvPrGH_vA":{"text":"We went there for breakfast on a recent trip to New Orleans. The stickers on the table sai","useful":0,"cool":0},"Oc3p0Bhtzm9M2wWJUeMe3w":{"text":"It was highly recommended to try Smiley's because I wanted Chargrilled oysters. Once I arr","useful":0,"cool":0},"ja8sSCfWucMTmH0ahK8kAg":{"text":"Great place for a bite to eat or a daquiri  on Downman! Service is great and the owners ar","useful":4,"cool":4},"jeZFQKV2sqrnrG9sHoEBrw":{"text":"Would rate 0 stars if possible. From being served a steak with plastic cutlery to waiting ","useful":1,"cool":0},"xz89H-uyLvkeKePPFqM_Pw":{"text":"The food is really BOMB!!! U guys gotta try it; the service was great and the food was gre","useful":5,"cool":5},"pc-jycBp_KHHEQFnk-kprQ":{"text":"The food was very tasty  but not worth the over an hour wait to eat they seemed way more f","useful":0,"cool":0},"3NCbIKvC0_y-2Oh48eJdCg":{"text":"The waiter was wonderful and we could tell she was frustrated but the service was horrible","useful":1,"cool":0},"QWGDktddyoWXepYkwrBfbA":{"text":"This is my go to spot on the regular. I have yet to be let down. From the steak and loaded","useful":0,"cool":0},"Fw7xcRmBAQJmNMduLdCewQ":{"text":"The food was AMAZING, and the staff was ALL incredibly friendly. The cooks were proud of t","useful":0,"cool":0},"4PQm6zo6E6UAthsmXliEHA":{"text":"I love the convenience of the location. There isn't many eateries in New Orleans East. The","useful":0,"cool":0},"Odr4SU5V1Zy-bAmpzbPbEA":{"text":"What a great spot for good food. The place isn't very welcoming but the food is good, fast","useful":0,"cool":0},"JWzIXzhUa01rq7T0kl4PEg":{"text":"Great Breakfast and Brunch place, the food was amazing and the service was wonderful. I hi","useful":0,"cool":0},"Hk8bFQZG_bNbNghr15s-GA":{"text":"I stopped in to meet someone ,however after seeing their food I decided to try some for my","useful":0,"cool":0},"UmtAqAz10_uS-EThAQ5_iA":{"text":"Hidden gym of New Orleans East, came here for the first time for a fish and shrimp plate, ","useful":1,"cool":0},"HQmmJtKudzg8K6ybQROkaw":{"text":"Hidden gym of New Orleans East, came here for the first time for a fish and shrimp plate, ","useful":0,"cool":0},"vGcG51r8Thd0vIY7sRDqtw":{"text":"Those wings though. Like daaaaaamn. Them some good wings. Like some cheap delicious ass wi","useful":0,"cool":1},"Qd4xbFmGIAwBf3umbFnATA":{"text":"Amazing prices. The quality of the food is top notch. Everything tasted fresh and all food","useful":4,"cool":1},"Sc46qjLJvgtKFbAw-cRbQw":{"text":"I don't believe I can say anything different than the other reviewers. The food tastes gre","useful":0,"cool":0},"k8pTRnmICWtUlYRS-CAuVQ":{"text":"Roast beef poboy was messy and tasty, as it should be.  Staff was attentive, but our drink","useful":3,"cool":0},"xVImMsUI3lQC2ZmiOjrjIg":{"text":"This \"Boomer\" is starting to really dig this Yelp thing. So we in NOLA and I search Yelp..","useful":2,"cool":0},"GZ184GXa_NjddzKfnSUvgg":{"text":"Great food and service. Fair prices and good portion sizes. Everything is cooked to order ","useful":1,"cool":1},"k--FTFO3Kl_pJoYvXTuMWg":{"text":"Good food, great prices... service is a little slow during peak hours but worth the wait","useful":0,"cool":1},"VyJWG-hrqp_YAghSCmP_Tw":{"text":"I'm so happy we stopped here.. the staff 110% represented their name well. The staff had t","useful":0,"cool":0},"j90KrAuXpGhT7VdY3DbcrQ":{"text":"Poor quality service.We had to wait a good 60 minutes before someone noticed us and the re","useful":0,"cool":0},"SY_Iez9tS--YLYcFx5rvsw":{"text":"Smileys is located in between two automotive service companies one that does oil changes a","useful":5,"cool":3},"lvR72JZHHJ2anmmJT9EX2g":{"text":"WORST CUSTOMER SERVICE EVER! Waited an hour for food that never came. Servers are slow and","useful":0,"cool":0},"ccWwkdWEs6yAlBMoe1ShHA":{"text":"Really good food. Loved the white beans. So much flavor. My sons burger was great! Very cl","useful":0,"cool":0},"8wnBB7TXLFMNgztHeynE1w":{"text":"The place was very clean. There were also plenty of TVs which made it a great place to go ","useful":1,"cool":1},"A4hR1a0-2ZjEbG7tFmq33w":{"text":"Staff had a wonderful attitude. The place is very clean, food is inexpensive and DELICIOUS","useful":0,"cool":0},"uYwgjkCwfLxdrI3wnY2kqg":{"text":"Hidden gem of New Orleans East, came here for the first time for a fish and shrimp plate, ","useful":1,"cool":0},"Rgj7KlufOM4pOENbaCbS-A":{"text":"The shrimp and fish platter is a must.   Chili and cheese fries is also the way to go.   A","useful":2,"cool":1},"3UGNB2zE2x5vpqWNGOQG-w":{"text":"Walked into this restaurant today I was greeted with smiles from all the staff now that's ","useful":0,"cool":0},"eFUBOwU53t4tZCRJUevn7g":{"text":"Horrible customer service! My first time ordering today through DoorDash! I cut into my st","useful":0,"cool":0},"JvRu0veYhClVs9Nd47uw5A":{"text":"This is the lowest rating I've ever given food I enjoyed.  Also, when posting this I reali","useful":2,"cool":0},"FmtgmghWphgoCf5nSCjjZw":{"text":"Great food and great service!  Had a wonderful breakfast of an omelet, biscuit and bacon -","useful":2,"cool":2},"aKVtU9s9O84ebqxGiWq7Vg":{"text":"Cool vibe, love coming in for their chargrilled oysters","useful":0,"cool":0}}