{"EJpwjPMdq0HSHAm8dfXp4A":{"text":"Love playing craps and at this Harrah's, it is even better. Dealers are extremely helpful ","useful":0,"cool":0},"x8U96iJsoCApEgccR8S02w":{"text":"Horrible service, rude customer service and the place is a joke. I suggest you don't come ","useful":0,"cool":0},"hKW8noqkkGO8XGV4uqn3mg":{"text":"This place charged me full price even though I cancelled within their stated timeframe. I ","useful":0,"cool":0},"BJt3Dw3O9ezA_4FgxcJ6DQ":{"text":"The Casino is okay, but travelers BEWARE. I was mugged and taken to the ER. There are cree","useful":0,"cool":0},"6oXrYkw7XmgLGEn6MP7eDQ":{"text":"Kind of cool place. Went here during Mardi GRAS weekend. Kinda dead but hey, it was a Mond","useful":0,"cool":0},"vNIZV1Xt_Z3MYqn9LbUS2A":{"text":"worst casino ever! was soo excited to come here. there was like a security thing u had to ","useful":0,"cool":1},"awYaIZD08hjh1m0ifilEaA":{"text":"Great fun times at this casino! The staff is marvelous and it's a smoke free establishment","useful":0,"cool":0},"y7O7tZgzeIDlJFd_wi3RkA":{"text":"There was no housekeeping done in our room. Coming back at 8:30 pm still no sign of a hous","useful":2,"cool":0},"Lj71wNOWwUIa9sJqXtL2WA":{"text":"Our organization chartered a bus from Kenner, as an offsite convention activity.  I was th","useful":2,"cool":1},"_HulQGfuqDgBJXG_bB3GpQ":{"text":"Great for insomina, bad if you are broke! Know your limits!","useful":0,"cool":0},"sb9idXD4BKkTq3-uKbq7xA":{"text":"Beware this hotel if you're expecting housekeeping service. We got no housekeeping after t","useful":0,"cool":0},"un4iPcQqihXIGfV3KYt0lA":{"text":"2nd time here. First, the employees across the board are amazing. Everyone was so friendly","useful":0,"cool":0},"iuHcYiSNchHCm1ARfQAf8g":{"text":"Wow an American casino that is completely smoke free!  Way to take the lead.  What a relie","useful":3,"cool":2},"d76aTB0Y2-IQ-L896UJFqg":{"text":"The room is nice and the hotel itself is well located. However, this wifi service is unacc","useful":0,"cool":0},"o9GX74hOX5VwUiHOgBGDyA":{"text":"Look, it is a casino. In the middle of a city (not at least an hour away as seems to be th","useful":2,"cool":1},"9x1Jt5d4hNaAuyVYGAp0EQ":{"text":"1st time visit to New Orleans for me :o) \n\nI booked the room thru Orbitz for $124 a night ","useful":1,"cool":2},"7Ekqw-gQLZuR1zKP2kvJRg":{"text":"I'm not a casino fan, I stink at gambling and generally the \"adult beverages\" are just wat","useful":0,"cool":0},"MSOanAF0J2AO5AQrmB6NLQ":{"text":"omg drinks on penny slots is where it's at.  You can get a hurricane and a long island ice","useful":1,"cool":0},"11CRCc9LINaZoJ_J4EMHYw":{"text":"While wandering the streets looking for something to do, my group spotted Harrah's and dec","useful":1,"cool":0},"Rc9Sd_WeJmRp0YYo4JxuIQ":{"text":"Had a great time at the casino! Very clean and fun!  Can't wait to go back!  Staff was so ","useful":0,"cool":0},"3yhX0Wx4pQOlAatcH7cmGw":{"text":"Our first room of the night had dried vomit on the headboard and dried blood on the sheets","useful":1,"cool":0},"jH7uVOl-Jd1WgdKvWl5Y4w":{"text":"First time in New Orleans. This hotel is close to the French Quarter. The staff is very ac","useful":0,"cool":0},"DkzfMgaagrjZEzTvIjMA4g":{"text":"This place is HUGE!  Other than that, unremarkable.  That's probably because I'm not much ","useful":0,"cool":0},"-RUjXOSM33lgbcAJ1Ymcmw":{"text":"What a place! Right on the Mississippi river, a block away from the fresh quarter, you'll ","useful":0,"cool":0},"gsorsKRRTta-oX8IilBGsA":{"text":"I am a local that loves both the casino and Ruth's Chris. I have been enjoying both since ","useful":4,"cool":0},"INKNVjZ_I095i62DaUgVTg":{"text":"Wow.    \nWhere was the manager on 1/19/14 at 3:00- 4:00 for the Masquerade bar?   Terrible","useful":4,"cool":0},"O6JCOqbWs1gYd0ksAAMc1g":{"text":"i enjoyed the casino and all but I had some issues with a few of the slot machines, needed","useful":0,"cool":0},"4LZUFZpAEjYbyBVgmGcvUQ":{"text":"I would have had a better time if I took my $100, tore it into confetti, placed it into a ","useful":3,"cool":2},"03g5trNFZbRyGLM-Esy2kw":{"text":"Clean. Close to all the action next to bourbon and canal street. Slot options are reasonab","useful":1,"cool":0},"FQe-9FIhGEBmyuuoh2rkEg":{"text":"Definitely very vegas-like casino, I almost forgot where I was. Awesome slot machines with","useful":1,"cool":0},"dGApsetTuVloYnzSZuPOmA":{"text":"Buffet is better than average, very friendly staff.  Rooms are nice and clean.  Hotel staf","useful":2,"cool":1},"-a5Okj63ou30dJqLgrbtCw":{"text":"This is a great location and not too far from the French Quarter. Came here for Mardis Gra","useful":0,"cool":0},"LAIc8TP-98GrjGaaR-3NJQ":{"text":"Overall a great stay here at Harrah's Hotel. The rooms were all very nice, staff very frie","useful":3,"cool":1},"QnCmhPRyfdDghGLhItqguQ":{"text":"Do not go to Harrah's. Went last night and a man tried to get in my purse at the craps tab","useful":2,"cool":0},"_zwEF8JmkmF7OPKnV98asQ":{"text":"My first time here I love it cheapest meal I have eaten since I've been in New Orleans","useful":0,"cool":0},"_hPy8nvDZs0t7pezbrDO3A":{"text":"if i had epilepsy, this place would have triggered 3.725 seizures in the one hour that i s","useful":0,"cool":0},"l4XatUK02feuVItRFOr1Tg":{"text":"Great casino...got $50 free vouchers for my birthday. Not big on gambling but it was a thr","useful":0,"cool":0},"5eJEvwjM7ivReKMqA5qIYw":{"text":"As with everything else here- \"it's under construction\". So that makes it a huge, empty pl","useful":1,"cool":1},"UWmrg630asW035WYZVbtcw":{"text":"nice and very big casino. the only bad thing i've to say is that it's a smoking facility. ","useful":0,"cool":1},"f-1hvN8VkMs4j_6iO1TB0A":{"text":"There is a Starbucks and McCalisters which is why we kept going back. Otherwise, it's noth","useful":0,"cool":0},"d0nA52Id00Jw83vrnvN3Mg":{"text":"Place was clean got a casino and free drinks with digital ordering at the machine... Could","useful":0,"cool":0},"Z9jM3Auu_OzW_za1mlt_bw":{"text":"Friendly staff clean rooms and a great view! The location is great you have the river walk","useful":1,"cool":1},"H9DKmZdsBaDN7RbBjpf7Cw":{"text":"Had a good experience there, comp rooms made it really good.\n\nRooms were clean, Casino was","useful":0,"cool":0},"KDEsV1FYynSf4zAAXEcEFg":{"text":"Pretty big buffet dinner with snow crab legs or dungeness crabs during the weekends.  \n\nMi","useful":0,"cool":0},"KCSE9V3U3IUoC_IyZlajww":{"text":"Forgot to review this casino while I was in town last month. My friends and I were walking","useful":0,"cool":0},"en0JYM8VnzqeCebGTS-k0A":{"text":"5 stars! Why?!? I was in town for Mardi Gras and won the most $$$ ever and so did everyone","useful":0,"cool":0},"FD2GntiCyvgT2drjpOkYEw":{"text":"Not a fan of this location. **BEWARE** of the night parking fees and/or gaming requirement","useful":1,"cool":0},"FnTRoEp_dHtr3Ks4TY7u5w":{"text":"Very disappointed with Harrah's New Orleans. I was going to drive down there and stay and ","useful":0,"cool":0},"E8dQti9gUQ4EUnlWevbI3w":{"text":"look, it's a casino. right downtown, no need for a flight to vegas. is it vegas?  of cours","useful":1,"cool":0},"eP1x_EHKeM25ffHQ4d1AIg":{"text":"I am not a big fan of Casinos. Never has and never will. Though there is something special","useful":8,"cool":5},"u0b6JqhsTWI4KEX63GUFzA":{"text":"I gambled with a confused asian man in Roulette for 2 hours and walked away up $350. If yo","useful":0,"cool":0},"OAeyhRUK0iW8Mhzz7_KcEQ":{"text":"Thank God for AC. The place is nice. Reminds me of AC I'm Jersey just not as nice. It's pr","useful":0,"cool":0},"7R75MA7FbaXBlmwdUam9_g":{"text":"Pretty decent size casino with a club/bar in the middle.. Don't expect Vegas and you'll be","useful":0,"cool":0},"tu98G3B9JAJVV9y3Wny_bw":{"text":"About the casino only:\n\nSmokey Smokey!\n\nPrepare yourself if you aren't used to being aroun","useful":3,"cool":1},"-lkNiccxWXDYT6-ut-adtQ":{"text":"I played 5 slots and all of them broke down as I was playing them I hit 3 7s and it gave m","useful":0,"cool":0},"t8uglBHgJ4bvr4S_1wxF4w":{"text":"Not bad -- I ended up spending a fair amount of time here on my last trip because my compa","useful":2,"cool":1},"1NLAnSInOzGfdqbkUSqSVg":{"text":"Nice way to start off the afternoon/night with a good buzz - Just get a reward card, park ","useful":0,"cool":0},"_0WeK6bhD5GwYElMgTwisQ":{"text":"You can tell this place has a monopoly on casinos in the city by the fact that there are n","useful":0,"cool":1},"LxwLCd1SZCfM4tFCC4c8rQ":{"text":"So glad they are having a smoking ban in the casino because seriously this place is a trai","useful":1,"cool":1},"SgZpzDAyrHu7uA15vg5DUw":{"text":"Since I'm a diamond member, I came here for a stay when I visited NOLA.  My only complaint","useful":1,"cool":1},"j1WXDX6HGXlRKO7IhRiPwA":{"text":"Absolute garbage stick-man called a valid roll on dice (7-out) that didn't even pass the 5","useful":1,"cool":0},"TuBWuIDqXW2N2I4zre68qA":{"text":"If you are from a big city (I'm from Chicago) this place will ring as a pathetic wannabe e","useful":0,"cool":0},"lhzRu_By8xvRFYf7iGtcsg":{"text":"Have you been to Harrah's in Vegas? If so, this is nothing like it at all!\n\nFirst, a compl","useful":10,"cool":3},"vV-BopQCvBqB6ezjVYkDBA":{"text":"I'm in no way a casino/gambling type person, but I had a damn good time here! I even left ","useful":0,"cool":0},"GnUg4CqWZg9y0ohzwz3IIw":{"text":"As far as casinos go in New Orleans, Harrah's is the best game in town. Or maybe it's just","useful":4,"cool":1},"j9q4B3PV3p9kRuD9_sswAw":{"text":"I don't understand why everyone is bitching about losing money here.  Seriously?   What di","useful":1,"cool":1},"wlWdT_wpcWAIxAM7FxvbDA":{"text":"plusses - they have a lot of games and the payouts seem fair.  there are a ton of options ","useful":1,"cool":0},"iMwJmcnPtlCT8zAfTb1rBg":{"text":"OMG I have never been in a non-smoking casino until NOLA. It was so amazing to walk into a","useful":1,"cool":0},"H16oQsDuk55pgF_DzctKxg":{"text":"Why did Terra at the video slot bar charger $3 a beer when I'm playing video slots? He sai","useful":0,"cool":0},"SxyhnDcqSTHGF5ew0IFPiw":{"text":"Love the rooms here, clean, and spacious! I had a great city view, and the location is gre","useful":0,"cool":0},"MqqvQTtWhgNwhjcLHYLdEg":{"text":"This is the worst excuse for a customer focused business possible. \n\nI went in after 11 PM","useful":2,"cool":0},"FLZtn4USmdjxv8yAfPf7hQ":{"text":"Just recently got back from a summer road trip I took with my partner of six years. My pla","useful":0,"cool":0},"F1Ufgztk-gwWepBWwsRxqg":{"text":"I lost $70 on Thursday evening in just a few rolls at the craps table. The following night","useful":4,"cool":1},"ixAttt9zQPDpibekkz_CFA":{"text":"I'm not much of a gambler, but the husband is, so we wandered in to Harrahs to escape a ra","useful":1,"cool":0},"CUlspKy2BjfesyouyHaE0A":{"text":"Excellent hotel and service! On my recent visit to New Orleans, I decided to stay at the H","useful":2,"cool":1},"NDEOQF9fGJSRdoheXnKEXA":{"text":"My good friends live in New Orleans, and we always take a trip into Harrah's when I am in ","useful":0,"cool":0},"ctPSjYjEw9v3OHb6WCo4Fw":{"text":"This review is primarily about the poker room at Harrah's New Orleans\n\nHarrah's is about w","useful":2,"cool":1},"ly7GA5uZ3WhCtdCtfS2YIw":{"text":"Horrible experience at Harrahs Nola. No free parking for 7 star and diamond members. Deale","useful":4,"cool":0},"FX--QL8d-GeCLM6mZUdEdw":{"text":"Pretty big and fun casino! Lots of slots and black jack tables. The roulette is always fun","useful":1,"cool":0},"mDeCH9_u19hKqDnJx7OIKQ":{"text":"Wow my first time in New Orleans and this is a convenient location. This hotel is near the","useful":0,"cool":0},"Ot-LfR2If-Zph4ePzNU1Cg":{"text":"My 5 stars are all for the buffet inside of this casino. 1. I am not a buffet person at al","useful":0,"cool":0},"oLLpzrdP3SNoZ6tgk-nhcg":{"text":"In a word: Underwhelming!\n\nThough I'm not a huge gambler, I love casinos. I'll play a few ","useful":2,"cool":1},"9oUqPsfdxlocE-MOS5tV7A":{"text":"Nice facility, but the machines and tables are very tight. I also don't like that a corona","useful":4,"cool":1},"wzG_JfYE1WTrFMnWe6UQSw":{"text":"Usually when you are the only game in town, that is not a good sign.  However, Harrah's se","useful":2,"cool":0},"pUH_R0ZDcte3fdYbtNuK5A":{"text":"It's pretty smoke-filled inside of Harrah's, but I guess it's a good place to go if you're","useful":2,"cool":1},"sBsM-LDa9Dcnv410zDeQHw":{"text":"Excellent hotel rooms with nice views of the river. Close to everything.  Extremely clean ","useful":0,"cool":0},"eq0GghkYRBZ8ufg81hqhvA":{"text":"I stay at Harrah's Reno often and have found little to complain about. Unfortunately, I ca","useful":3,"cool":0},"5IFuZDKJKlyst7vNT3omQQ":{"text":"Every time we go through or to New Orleans we stay here and I can't say enough good things","useful":0,"cool":0},"naYU2jW3btCDGG3qCfzlUQ":{"text":"My husband and I had a lot of fun playing the various games and winning some money! It was","useful":0,"cool":0},"SBzRKCn1J7zq03Hh-KVb8A":{"text":"Special thanks to Harrah's New Orleans management and staff for making our 17th Wedding An","useful":0,"cool":0},"XjNzoyabUxky09jnJFZ-hw":{"text":"I hate to give this place 5 stars. It's not a 5 star casino. (Maybe 3 stars. It's no Vegas","useful":0,"cool":0},"dt_tWZv_CZSeK3pIPL689Q":{"text":"Harrah's Casino in New Orleans was actually a lot better than I had expected.  For whateve","useful":0,"cool":0},"180TsNx80Wn_ujlYmAUh0A":{"text":"I would go again.  Good music, but weird that they constantly change the song to another s","useful":1,"cool":0},"93xwFfgI2C-snDFyfA-nyg":{"text":"Love the No Smoking policies inside the casino. Very clean and professional staff every wh","useful":0,"cool":0},"r02vn2u4xmUWv-HVcmCnlg":{"text":"Smoke free!!!!!! Count me in :) Soft drinks are free as long as your playing so if you are","useful":1,"cool":1},"6WD6bW3MBD8mCWhu4933VA":{"text":"Always a good time here! Great drinks, And if you get a chance to try out the buffet it's ","useful":0,"cool":0},"rxLDbVtLFzl5JHlyRfvmsg":{"text":"Pleasantly surprised by the quality of this hotel! Our room was spacious and laid out comf","useful":0,"cool":0},"Xtwn7br-e29cwFlZyPsbWQ":{"text":"I always stop in wherever I (or the wife and I) are in town. Just can't help myself. They ","useful":5,"cool":2},"-k3mU-xprgV2M4KTfFs3Ag":{"text":"Good luck finding any poker tournaments at this casino, despite what it says on their webs","useful":0,"cool":0},"D4fHvEfjPs6yT-AfwHiS9Q":{"text":"Been to every casino in Las Vegas and others around the world, this Harrahs was a pretty g","useful":1,"cool":0},"GTApAPgZ58zp0DfOp43SWg":{"text":"For all its stale smoky nastiness...I left with more money than I walked in with!  So they","useful":0,"cool":0},"1pUP2fMBmloJOvx1RKLskA":{"text":"As close to Vegas as you're gonna get in the SouthEast and I was pleasantly surprised. Var","useful":1,"cool":0},"wKEeZxjvU_pxb7hMZSqpww":{"text":"I have been to a lot of money eating casinos and NEVER written a bad review but this place","useful":3,"cool":3},"8qjVKGdpwjij5hcula5P2A":{"text":"Not a gambler, but I do like the atmosphere.. Free drinks at any machine!! Whoot whoot!! P","useful":1,"cool":0},"ZgdPdH6nF8XoCEX-x1DSJw":{"text":"So, I've never actually gambled at this Harrah's. However, it is an EXCELLENT location for","useful":2,"cool":0},"qtf05PpDigHdbwV0l_8tpg":{"text":"Slots were hitting and drinks flowing freely this Saturday! Harrah's in New Orleans is a g","useful":0,"cool":0},"CbvLXEDKV0N-7cHbMzd_NQ":{"text":"This place will keep you happy if you like to gamble.  It feels like you are in Las Vegas.","useful":2,"cool":1},"vxW3l9QNpg27lcK7FEqHiA":{"text":"Casinos suck! This was the first time i've gambled legally. I was down the entire night, b","useful":0,"cool":0},"9fKc2aZaWEaX9NQ1F9o5AQ":{"text":"Super nice associates! Didn't stay long but enjoyed every minute of it! McAlister's deli h","useful":2,"cool":1},"4x-MY2tPFCI0wVWo6HLI2w":{"text":"Tons of slots, poker machines, poker tables, blackjack tables, roulette, everything you wa","useful":1,"cool":1},"Krxnner8b6G3PZl4zXggFg":{"text":"Since we were attending a conference in Biloxi, we decided to stop by a couple of casinos ","useful":5,"cool":1},"8SC2Nil9g5V_qKB_KRe7GQ":{"text":"Room was very clean and updated. View of the river. Close to everything. Service was great","useful":0,"cool":0},"SyNfvPSpevBmuNLIUogkxw":{"text":"Most people spend their 21st birthday at a bar, getting incoherently, embarrassingly drunk","useful":7,"cool":10},"EUJxPwXfbdLk4-kDV2ZYlA":{"text":"Lots of cigar smoke fills the air, too much for my liking. If you can get over the grape f","useful":0,"cool":0},"Cvak2Xz4JulkxTfXEsAm5Q":{"text":"It had a Vegas feel to it; however, since it is the only casino within the New Orleans dow","useful":0,"cool":1},"eyOkTJZ2xDssI6RUULtNNA":{"text":"This Harrah's (part of the chain of Caesar's casinos) is one of the most famous ones. The ","useful":4,"cool":3},"nfgeVRkH9ZWssrgWEUxtzQ":{"text":"It's a casino.  It wasn't too smoky so I liked it.  I didn't walk out smelling like an ash","useful":0,"cool":0},"7Bsp1QY48bSL9pb4Ey0i-Q":{"text":"DISAPPOINTED. So we had a reservation for 5 people for two rooms... when we got there, the","useful":1,"cool":0},"aYXLITpVQM9_RLi3kYMIZQ":{"text":"To be fair I only played in the poker room, mostly because I think if you play anything wi","useful":0,"cool":0},"mHEs7Ywp3CMfd8kY2s3epg":{"text":"Even though I lost all of my money - well not all of it, but enough to matter - it's a fun","useful":2,"cool":1},"2aHiPNxdgql6-MUuVyOp6w":{"text":"Harrah's is not as glitzy as a Vegas Casino, but it is very nice, none the less. A big plu","useful":4,"cool":0},"ud9RbM-rWoYCj42oClG1pw":{"text":"Harrah's hotel is one of my favorite places to stay. I am not a gambler at all. In fact, i","useful":1,"cool":0},"hRahZ4GKKrBp1bMXkMLG5g":{"text":"Review of the casino, not the hotel. Not sure when it was built but everything seemed very","useful":2,"cool":0},"plPvo5_VqqS0nfBX7_j7fw":{"text":"Front counter staff was awesome. Room was a \"Monet\"-- beautiful from afar, but when you ge","useful":1,"cool":0},"qIljdsylukDXLsRhbxgMxg":{"text":"This review may be skewed because our stay at Harrah's was comped through their VIP progra","useful":2,"cool":4},"KMLPPALHkVD4ZisHtpTg7w":{"text":"Haters gonna hate.\nI love Harrah's because I love to sit at the penny slots and repeatedly","useful":6,"cool":4},"8UxslqAR2QhPZH_4AKOVrQ":{"text":"For its location and gaming purposes, Harrah's in New Orleans is fun, convenient, and easy","useful":2,"cool":0},"0QxhyjCzkEIz1F1taQSENw":{"text":"Fun enough for a casino, but who wants to spend all day or night in a casino when you're i","useful":0,"cool":0},"TFT0TL60j-Swvyg9_cQ0QA":{"text":"When I think Harrah's casino, I think the heart of Las Vegas and a somewhat out-of-place, ","useful":5,"cool":4},"Mnywgt_g8dGRAov1G-YGqQ":{"text":"I really like this casino. It's very easy to access in the French Quarter, it's always cle","useful":1,"cool":0},"wqsWnGdZ0OcF-W-skeUGhA":{"text":"If you've been to Harrah's Las Vegas, expect the same on a smaller scale. The one upside f","useful":0,"cool":0},"GT3XeEUF-AJa5m85sRH6pg":{"text":"This casino was surprisingly beautiful!  I am a frequent visitor to Las Vegas, so I figure","useful":6,"cool":0},"MqEkG-7vmeMFd3ywjEh6Zg":{"text":"Here for the Sugar Bowl and the set up outside of Harrah's was very welcoming. I sat outsi","useful":0,"cool":0},"WBhRnyQMu1DXOXuO_Y-m1A":{"text":"Poor service from their vendor Fuddruckers. It's not them but it's managed by Harrahs. I'm","useful":0,"cool":0},"4eXamvv4xGRxIx9YwHKPkg":{"text":"We haven't been to a casino in 15 years.  The slot machines made us feel like we were in a","useful":0,"cool":0},"3I8OG3ehduW_y_3RLoPwOw":{"text":"I was only able to make it to Harrah's one night during my trip but I had a good time. I d","useful":7,"cool":1},"GX0tOEQfwY5l6YpOSNNqfw":{"text":"Here for the seven star event and wanted to give this place a 5 star but for the heavy man","useful":1,"cool":0},"gIvvBOIq61qjrcddExTJfA":{"text":"If I can deter even one person from coming here, I'm happy. Last night, my husband was pic","useful":16,"cool":2},"2jlOJ_sFAkN2tF6du7bDkA":{"text":"Kind of a mess. There are ticket cash-out machines all over the casino yet NONE of them wo","useful":2,"cool":0},"8VloCnFMi9SO5W09F14Ynw":{"text":"E-yuck!\n\nBland City.","useful":0,"cool":0},"2kZ_zYT6S8vmr-10H0gxhA":{"text":"Clean, friendly people, good food choices.  And with the smoking laws in New Orleans, this","useful":1,"cool":0},"4KGea5vVR-SHmnp8Op2QOQ":{"text":"Decent.  Gambling.  Machines are very tight.  Club was cool, DJ had great songs but only p","useful":1,"cool":0},"t_eQ1cYy9z-KpcwtQNMdag":{"text":"When we arrived the valet guy came off very rude and asked us if we were lost and then rec","useful":0,"cool":0},"x85eKxYARw8pT7GCLWOX4g":{"text":"This casino not only was a great place to spend any amount of time in the casino environme","useful":0,"cool":0},"eUPPruuL7AMPaTp3THrHjA":{"text":"Harrah's: A Haiku\n\nStrong drinks if you tip\nVirtual Blackjack's the bomb\nWhere did the nig","useful":6,"cool":8},"fIazyhKryDCnmJo4hK2r-w":{"text":"So I planned a special getaway for me and my husband. And it started off horribly wrong. I","useful":0,"cool":0},"Gr3vtzkqkVw8af5vvmm8lg":{"text":"I think I realized I'm a degenerate when the security staff started recognizing me.\n\nLet m","useful":0,"cool":0},"kKd3oH5OgXYxkxBTVPVcJQ":{"text":"Ground-floor rest rooms with no hassles. No further comment, as that's the only reason I k","useful":0,"cool":0},"MjikYszaxW7lHU_NyWKo1w":{"text":"Played here for a couple of nights during my visit to NOLA.  It's nice that it's smoke fre","useful":0,"cool":0},"YeUDTq2fpNlpYn3SNXrdSg":{"text":"Smoking area was very small and limited. Staff was courteous. There are a lot of games and","useful":0,"cool":0},"V08xcc1-34V8eFZ5tyKSEQ":{"text":"I don't gamble, and this was my first experience even setting foot inside of a casino. It'","useful":2,"cool":2},"tDlioUqyiwUEfO5W-x1YQQ":{"text":"1.  If you eschew the buffet (either because you're bankrupt from the tables or because yo","useful":6,"cool":2},"EkSULyhVkuasWpX8ASsHRA":{"text":"Loved my stay here, the regular suites as well as the penthouse exceeded my expectations! ","useful":0,"cool":0},"hsjj5asrN99Ko7GPtzXMLw":{"text":"If you like casinos I'm sure this place would meet your needs. I just went in here for a f","useful":4,"cool":3},"mMKiboq6hFTNMufs4HCJXw":{"text":"Rooms were clean with decent size. Didn't see any mold or torn sheets like other reviewers","useful":0,"cool":0},"_xzcoo2CtKXWLpRtTS8Phw":{"text":"I would rate it a 3.5 the shower needs some bleach looks like it's gonna start to mold in ","useful":0,"cool":0},"cRHJZ9yVapCpQXEuFMgdzw":{"text":"Walked in and went straight for the bar. Bar tender turned her back for quiet a while befo","useful":2,"cool":0},"hbgaMC0dMo1WJRIEgRTlgA":{"text":"I am a Chinese, I got bedbugs beaten twice in the Harrahs hotel room ,after I did report, ","useful":3,"cool":0},"ZsRHaTSkrMxMF6LoiUXfSw":{"text":"Saturday night here is mayham!!!  It seems like everybody is here from bachelor parties to","useful":0,"cool":0},"Kg9fbIPCoZFrQVIt-1Dkvg":{"text":"Great casual casino with a fancier feel. The atmosphere really makes it, though it could u","useful":1,"cool":0},"UnyG0LFP2gjaGFETMEhv7A":{"text":"Close to French Quarter (5 minute walk) and nice sized casino.  Also, very close to Riverw","useful":1,"cool":1},"lx-eA7sjV4JfbKL_UFgDug":{"text":"The seating in this place is horrible, unless you are sitting very front row or in the tab","useful":0,"cool":0},"18WIvhoCL0CgIGcgLmKWUg":{"text":"My husband is a Seven Star rewards member and I am a Diamond Elite. Covid protocol is obsc","useful":0,"cool":1},"ZeyELEscOB7QZt9WOTFLCA":{"text":"DISCLAIMER:  I DONT GAMBLE!  So, I'm writing about everything else.\n\nI have a love hate re","useful":2,"cool":3},"VYVbPmMp9Dy08GpvoAkqhg":{"text":"New Orleans has drunken debauchery, gratuitous nudity, and gluttony down to perfection.  W","useful":3,"cool":2},"YqByvpVJmekLLRRaF-gypg":{"text":"Harrah's is a grand casino in the middle of New Orleans.  When you're indoors, it's hard t","useful":2,"cool":1},"63eCQOBFZK4F0PrdY9ueGg":{"text":"It was seafood night. 32 plus tax and tip. Most of the food had been resting and  was not ","useful":0,"cool":0},"5gyEVLGSKPFyYHQso5JDWQ":{"text":"Parking was super easy and surprisingly convenient to the hotel. The check in was almost t","useful":0,"cool":0},"CF0_mrZZV2fwx7oMmRtWZA":{"text":"Don't bother with the buffet. \n\n Had a coupon for $20 for use at the buffet.  Decided to g","useful":1,"cool":1},"AYuYtBKkaeZkFXz0B__T5A":{"text":"Very nice stay before the fest. Staff is very accommodating and the accommodations immacul","useful":0,"cool":0},"nzzW3v_nUC8kpykWj46YHg":{"text":"There is no pool for starters , even the bummy French quarter hotels have pools. The check","useful":3,"cool":0},"rMuENiQYnklnE0BxXyQVVw":{"text":"POKER ROOM REVIEW:\n\nThey Rake 6$ from every player every 30 min. 120$/hour per table and p","useful":1,"cool":0},"quagYpEqr1A92r55hG2kbw":{"text":"Huge hotel! Table limits where high and not very loose. Very smokey inside but clean. We m","useful":0,"cool":0},"woagx8CM2QElrN9_LNYK-w":{"text":"We had a fun time visiting the casino. \n\nAlmost everything is NOLA themed. \n\nThey even hav","useful":1,"cool":1},"kJy_xyz2rmpclY8FViELEA":{"text":"Casino is nice and cool and has some really fun slots. If you like slots play dragon spin.","useful":0,"cool":0},"koA07jFIubKuVsRa6YMq4Q":{"text":"Walked in here only to enjoy the breakfast buffet. \n\nEnded up spending $5 to get change, a","useful":0,"cool":1},"ikcB-3OOnRrPmZEuQ7fMAg":{"text":"This review is for the casino.  (I will review the buffet in a separate post).\n\nWOW!  This","useful":4,"cool":1},"PH1_GRzLCI_5B5YLWf9qQQ":{"text":"Me and my friends came in to take advantage of their free parking with the deal of playing","useful":1,"cool":1},"zzq3M90YLIQ4JAQz1IQn2Q":{"text":"I have not been to many casinos, but Harrah's truly has an impressive number of slot machi","useful":0,"cool":0},"sul9vJL2Q_z9OZfs2zWaNQ":{"text":"Stayed for a total of 6 days.  3 on the River side and 3 on the city side.  Both had good ","useful":1,"cool":0},"p7BbLieaxDakixmCZFO6Og":{"text":"I am not a gambler.  I went here for Sunday brunch.  I left about five minutes after payin","useful":1,"cool":1},"hjHgK0K7NuktKszrGQjZfg":{"text":"I had the worst customer service experience I have ever had in any casino.  I was in the c","useful":0,"cool":0},"mp312aG5qzKJw0wLxP0laQ":{"text":"I'm not really into gambling, the most I'll do is play the slot machines (with a $5 limit ","useful":2,"cool":0},"3QYBPi4L_V-3i9ut-x7lEw":{"text":"Whoo hoo... you are about to get two reviews for the price of ONE. You're welcome!\n\nHotel-","useful":1,"cool":1},"7kka7nAhky8GlOysgtuolQ":{"text":"Woah! First casino that I've ever walked away with more money than I had before? You win H","useful":2,"cool":0},"v8Qz3MC_SZSM8i2tabosYQ":{"text":"I enjoyed a four-night stay at Harrah's while attending a conference. I used Priceline's e","useful":0,"cool":1},"jbjl6XhSEMn36YxNuVkdrA":{"text":"We ate at the bar to watch the game at the \nin-house Ruth Chris steak house. The crab appe","useful":0,"cool":0},"32S3t94VnW2WluurbvaaTA":{"text":"A fine but very smokey place to lose your money. Also a good place to use the bathrooms if","useful":0,"cool":0},"HVuz6RvKGZbhIu9TJrJz2A":{"text":"Casino was ok. Didn't have what we were looking for but overall it was nice. Played some p","useful":0,"cool":1},"vzWBCHVIFpAGeTdjLRlhdg":{"text":"I am not going to be a \"sore\" loser.   I didn't win anything.  I had fun though.   I love ","useful":3,"cool":2},"HT3R7-eePi3wo3h8876l6w":{"text":"I didn't win any money, but when $20 is your limit that's not surprising.\n\nAs Casino buffe","useful":1,"cool":2},"hFIzZXuDShBiYyaeYGbKDw":{"text":"This casino give free drinks now before while back they didn't, that was an A for me lol f","useful":1,"cool":0},"oHkrCT8Zz-vxbzqRAoiN_g":{"text":"I am definitely not one to gamble. It's just not enjoyable to me at all. But I was brought","useful":1,"cool":0},"z6KxmqD0Pb5NrEvMvXT54g":{"text":"OK I realize that two trips to Harrah's in a New Orleans trip that only contained two full","useful":2,"cool":2},"ed8eCv15-PRp19nLCgIfTw":{"text":"We had a wonderful stay here. Everyone was so nice from the moment we walked out the taxi ","useful":1,"cool":1},"PZcskuUxYZtx7kxkpF4chw":{"text":"Free trip + beautiful hotel + winning at the blackjack tables = WIN!!  \n\nWhen Harrah's off","useful":1,"cool":1},"BdH87wzrGtz2Bu2ULbFk9g":{"text":"When you compare the quality of Harrah's to any of the Biloxi casinos, it is so much nicer","useful":2,"cool":0},"1HsTk0GdTPG1zz8NyoRs6g":{"text":"Not a gambler, but we were drunk and in town for Mardi Gras so we ended up here after eati","useful":1,"cool":0},"ZkSoj6kpzCwF1B0QyBN0mw":{"text":"Beautiful property. \nBeautiful rooms.\nSUGGESTION TO MANAGEMENT-a nice touch would be to ha","useful":1,"cool":0},"GuT85k8LGDH-6Xi4iK-nLw":{"text":"A typical casino with slots that never produce a winner.  Perhaps it was a bad day for me.","useful":1,"cool":0},"Q8VqSg2F8F638flQHx67Aw":{"text":"Free roulette payday plus Diamond Lounge! Amazing drinks and friendly staff. Can't beat th","useful":1,"cool":0},"cDLHLPIuUGFmVXfQgQayLA":{"text":"May have lost $120 at the casino, but I'm also sure I made up for that with all the alcoho","useful":2,"cool":2},"KNFi9VXJC7QbUFlRFuoCLw":{"text":"Harrahs is the high end and most expensive and elegant casino in the NOLA region. Table ga","useful":0,"cool":0},"Um06-sMKRjY43R9QIiZurQ":{"text":"can't stand this place.\nstaff is rude, like they're doing you a favor.\nI understand that y","useful":6,"cool":1},"gaiB70BQLF8e44dcZyNVow":{"text":"If you're looking for a place with stains all over the furniture, dirty linens, wet carpet","useful":0,"cool":0},"RSiN9YXUSC3E9lOwbUbWlA":{"text":"I wish you could review separate for the hotel and for the casino on here. The hotel beds ","useful":0,"cool":0},"O_RnvgXKvDBrjDvZMXkGig":{"text":"get cash before you go... they dont except cards at the tables, and there is a $5 fee on t","useful":0,"cool":0},"t4f0E8VgViJGuzoLjV6qJA":{"text":"This review is of the hotel. My husband and I stayed at Harrah's New Orleans May 2013. We ","useful":0,"cool":0},"jrqFKKagGYVRn-FTAzOfLQ":{"text":"Nice little casino. Definitely a great spot to kill time if it's raining or just need to r","useful":0,"cool":0},"Mb9v94emvVCuniqXSEV4Uw":{"text":"We got to New Orleans and wanted to get some food with our kids and went to this location ","useful":1,"cool":0},"sxXTGfj2eBmBxemJPILDfQ":{"text":"This review is strictly for the hotel. Had a great stay there during the Kiwanis conventio","useful":0,"cool":1},"S0bBl_c6IW7ty79daR42qA":{"text":"This casino is tucked into a wonderful part of the city. It's located at the end of Canal ","useful":1,"cool":1},"frj2DhfHCHlysX1U9_8W9g":{"text":"I love this casino! I visited during my stay in New Orleans, easy walking from Canal stree","useful":0,"cool":0},"gNrM2WSGMmBfrN5qDCEV5w":{"text":"Nice clean casino just like I expected.  Not as big as Harrah's in Atlantic City but that'","useful":0,"cool":0},"290tF-S7xiuODXVQnUVNCQ":{"text":"Ah, smell that? Or maybe it's what you don't smell. This is my first time back to Harrahs ","useful":3,"cool":2},"r3ZPjnsKFTPLBzg7bIKXCg":{"text":"Hotel is excellent. Very clean, with super comfortable beds and decent staff. Down side wa","useful":0,"cool":0},"bPBjYK5tP-JDsvbip9Z5ng":{"text":"Their buffet is reasonably decent with a selection of New Orleans style food. Not a bad st","useful":0,"cool":0},"B5FWex-ImaVIZ_c6QT6zqQ":{"text":"Harrah's is cool, it was a nice break from the shopping, eating, touring.. i feel like we ","useful":6,"cool":4},"Rl3u5chIEMmeHWdCo0XO4g":{"text":"I don't like this place, it's not a traditional gaming spot that caters to the gamer! Only","useful":1,"cool":0},"N1Er6vsehQw7OtBq09avsw":{"text":"Doors are only open on Canal Street- waking around the entire block really sucked- and it ","useful":0,"cool":0},"g2ZgbJg1bsPcelqNFgfVBQ":{"text":"We visited Harrahs NO several months ago and I forgot to write a review. Everything was gr","useful":0,"cool":0},"Z1SdgE27Aupr3_1n7AKHJA":{"text":"The Shrimp at the buffet was great and plenty good selection","useful":0,"cool":0},"p033VsKtjFyHOs67b2vPrw":{"text":"Harrah's is a beautiful casino. The gaming is not as varied as other casinos and don't go ","useful":0,"cool":0},"BMHlDNAS2zQhjW0eT3Pqug":{"text":"Not an enjoyable experience. It started out bad immediately. The guy working the door hara","useful":9,"cool":0},"0GSVmP0XxnlM9Pc22LYcRQ":{"text":"Harrah's New Orleans is an a-okay place to play poker.  They don't judge you if you stumbl","useful":1,"cool":0},"DlMoqV9j54_5TulbzFC3JQ":{"text":"Know that I'm definitely not a casino-lovin' gal. \n\n-I hate gambling (I prefer to spend my","useful":17,"cool":16},"BsSJTKCtubqYm6vNuywE6Q":{"text":"I think this is the only casino in the city.  I didn't win anything but I did get $10 wort","useful":6,"cool":7},"6o07Qzvycoo3a2fpc-9i5g":{"text":"I became diamond last year after playing a lot of video poker. I wanted to spend one night","useful":0,"cool":0},"zFIiZF-xnAMgfiRgatGJhw":{"text":"It's like they found a bunch of swamp idiots if they'd like to run a hotel. This place is ","useful":0,"cool":0},"-0da_baL2YyioV_o21SvnA":{"text":"Never again. Housekeeping was awful. We couldn't get towels or bathroom supplies. When I a","useful":3,"cool":0},"ZldFnp40xvyrOMi2iYgn8g":{"text":"Only visited to gamble. The only machine I wanted to play wasn't there (Wheel of Fortune).","useful":1,"cool":0},"HKTkho22cz8kpqNL2bIuvQ":{"text":"Hotel is in a great spot with comfy bedding but that's as far as my praise can go. I've st","useful":1,"cool":0},"6pq4NrFFvKSiWMRc3poEJA":{"text":"It is a nice size casino that is in full circle. The masquerade bar in the center is a nic","useful":0,"cool":0},"bUTQWo-wKygzF8ESEhpriA":{"text":"Hotel room was nice and clean but you can hear every little noise that woke me up several ","useful":0,"cool":0},"_MgtkSjzIsf1XZGuMJJuZg":{"text":"First off let me say that I am not writing this review based on any gambling experience, g","useful":0,"cool":0},"C-1NtpffHeVr3Y2IBIXTAQ":{"text":"Hate this place it's a trap! Every time I go here I lose all my money! Even tho I get free","useful":3,"cool":0},"PQzyAmrj1HgSiFr_shrxKg":{"text":"**There will be a reference to Osam Bin Laden in this review. If this bothers you...um...w","useful":0,"cool":0},"N99Ap-aotnvWeVfo781h-w":{"text":"The first night my boyfriend and I went to Harrah's, we had a blast. I was actually questi","useful":3,"cool":0},"FGn6IFJB4VVsazT0z2eibQ":{"text":"Beautiful property. \nBeautiful rooms.\nSUGGESTION TO MANAGEMENT-a nice touch would be to ha","useful":4,"cool":3},"EJUToobEdBa8mMqgD4l7Rw":{"text":"I still hate the fact that kids aren't allowed into the restaurants. Oh well. Harrah's is ","useful":3,"cool":2},"m5ya7jvAlaH8uJ2EwTQ2ww":{"text":"I've been to this Harrah's quite a few times. I've even stayed at the hotel there despite ","useful":0,"cool":1},"JU8sYrxr1qVrMXjC4_lxuw":{"text":"Super friendly staff! Had my niece, 10, and daughter, 15, with us.. it got a bit confusing","useful":0,"cool":0},"sq1OjnqukiO1wKtvvRYTJw":{"text":"No complains here. I walked out with $600 more than I came with. See future reviews for wh","useful":0,"cool":0},"-OTxozMWUsnDEGLxvoNM3Q":{"text":"Great room, fantastic bed and pillows. And, unlike my previous hotel stay at La Quinta, th","useful":0,"cool":0},"2tJLSLvsG6CYFO2-r_nEig":{"text":"I'm not a gambling junkie, so I dare to say that this casino has every game there is to of","useful":0,"cool":0},"18g1qHaXgxV3PWVEx9tXYg":{"text":"Harrahs New Orleans is a good choice. Very nicely appointed with clean rooms and excellent","useful":0,"cool":0},"7hQBXoMSd1rTSFwxcCi2cg":{"text":"If I were to be REALLY subjective, I would give this place 1 star since it took all my mon","useful":3,"cool":4},"E6P-jv9fJK1zMdychC3oWQ":{"text":"The good - The drinks are strong \n\nThe bad - The homeless vagrants that not only harass yo","useful":4,"cool":0},"50qqRyIGDDPqsRTyHSxKhQ":{"text":"Guy walks into a Casino and knows the kind of gambler he is. So he hands BOTH his wallets ","useful":2,"cool":2},"2t4f7GjkQ4P6GcYsQsqr5Q":{"text":"Nice atmosphere. Smoke free. Lost $100 but hey, I wasn't even expecting to stop there so n","useful":0,"cool":0},"lrn1QN_I6XP9zlqAJHsSKw":{"text":"Casino seems a little run down\nLack of tables other than blackjack\nCocktail service is spo","useful":0,"cool":0},"m6hkBKIVwZqxc0SGBBHjDg":{"text":"Harrah's Casino located in downtown. Parking is free if you sign up for their loyalty card","useful":5,"cool":2},"ViKdNUTXUW3bVP_1caBS9Q":{"text":"Definitely the nicest Harrah's I've been to.  The service is above and beyond that of Las ","useful":1,"cool":0},"MbpDWlEMNxOeQvvi-2ruWQ":{"text":"The staff was very friendly and helpful. The room was clean and spacious. There are a lot ","useful":0,"cool":0},"ol636hlBMz0jsSEfmOtWTA":{"text":"One of my favorite casinos in all the land. I played poker professionally so I've had my f","useful":0,"cool":0},"q1_ebDZUcpmfIbMQMGv_IA":{"text":"Great casino, nice and spacious. Clean, had plenty of tables to choose from. Good experien","useful":0,"cool":0},"goUzKdUeLF-STNOhw6cabg":{"text":"Typical casino... The cocktail waitresses in the poker room are beyond friendly and talent","useful":0,"cool":0},"Zt1jnODdr5rGxXJ6nTNUGw":{"text":"Nice casino with all my favorite video slots! The casinos in Louisiana are very strict, no","useful":0,"cool":0},"6IFWbXYowt1mTnCC88fbtA":{"text":"Amazing room! This tub for two was the perfect way to end our vacation in NOLA. \n\nThe only","useful":0,"cool":0},"0knesQaGvPqRK3UfbcfLSg":{"text":"Fun casino with table games and the usual electronic ones. Staff is very friendly.","useful":0,"cool":0},"gTZIy5vQd5TaVLM4JLzzHw":{"text":"Nice layout festive and lively , stepping inside made me want to start drinking as the hot","useful":0,"cool":0},"iGOHgMGPGU-fWqVco1PKbw":{"text":"Forget what you might think when you think Harrah's. Coming from Vegas, I had some serious","useful":4,"cool":2},"ezGvX8fAJC5EQtqCFYt3NQ":{"text":"Harrah's is a pretty good casino if you want to gamble, look good, and dance =) People act","useful":1,"cool":1},"ThAFTMEGiLY39ucCe3_GaA":{"text":"The Theatre at Harrah's leaves a lot to be desired.  The venue is small so no seat is real","useful":1,"cool":1},"qVzDYcLfmL-pbp2D3NI4ZQ":{"text":"The lunch buffet stinks. They recently remodeled the buffet, and upon reopening, jacked th","useful":3,"cool":0},"CDrwbT685r2KOK53RKausA":{"text":"Saturday, January 4th, 2020 - Wednesday, January 8the, 2020\n\nI normally don't post a low r","useful":1,"cool":1},"_Fp-pHQlBkObxd-GI4a3CA":{"text":"Sucks. People are of no help when being assaulted. No good security. Only people worth a s","useful":1,"cool":0},"itYmf_x7dG7-QGwAXGSlow":{"text":"A great place to stop by if you're trying to watch a game on TV at the bar.  The bar has a","useful":0,"cool":0},"ZIlYn6VjEe4W4zDuV55wJg":{"text":"Large Vegas style casino with a good mix of tables and slots.  Definately will be back.","useful":0,"cool":0},"md8-kgMYeueiBJCFCyql7Q":{"text":"Great Casino! Great card games! One of the best guy ass kickin' card game I had ever! So f","useful":0,"cool":0},"8plp7am81GvP7C3A09-cIw":{"text":"I always enjoy eating at Harrahs buffet in New Orleans. We had dinner on Thursday and it w","useful":0,"cool":0},"uzY-rkUkum3uyoN9Kxltdg":{"text":"Had one of the worst experiences here at Harrah's. I'm in town on a Bachelor party and we ","useful":2,"cool":0},"5VOxcrnnlQcD60v7fb7sSQ":{"text":"The go-to place for clean bathrooms if you're on the edge of the French Quarter. But serio","useful":0,"cool":0},"68IS9JC6vtvKwcvuw_V53Q":{"text":"Harrah's wouldn't let me and my friend in because our North Carolina licenses were vertica","useful":2,"cool":0},"rqjLD6GzSTZsy8bxXUr5oQ":{"text":"The customer service us horrible. See photos for the condition of our room. Covid or not t","useful":2,"cool":0},"-vB0Lv_CRhmNmqFgRkorOQ":{"text":"There was no housekeeping done in our room. Coming back at 8:30 pm still no sign of a hous","useful":1,"cool":0},"cavQvRYOvHIAfczW2A35Yg":{"text":"Have an hour or two to burn?\n\nHarrah's is great for burning some time on the slots, playin","useful":2,"cool":0},"a381-8svvuscFEv5BdixYw":{"text":"I'm not a gambler, but I went here with a group of friends who wanted to play craps. They ","useful":2,"cool":2},"760XjkRZTcKQbHsNA4Oksw":{"text":"We recently stayed at Harrah's for a week. We didn't stay for the casino but for the locat","useful":1,"cool":0},"SPLLARXH2wWyFpL7zliunw":{"text":"Stayed here for one night while in NOLA and it ended up being a pretty legit expierience. ","useful":0,"cool":0},"7eM7Jvip-vjC8HsAZTvhcg":{"text":"We had a lot of fun. We would definitely go back.","useful":0,"cool":0},"c6nhDyk2WH1ntTkhVFBv5g":{"text":"This is getting one more star than it deserves because they flew us out there and put us u","useful":1,"cool":0},"iAlZQtXk8obtSnDEbCglpg":{"text":"Ive been to many different casinos around the US and ive never seen so many people losing ","useful":0,"cool":0},"IM65xVjnXLOiLmA73hWJAQ":{"text":"Clean bathrooms, great air conditioning, big bar in the center.  Took all my money fast an","useful":0,"cool":0},"J-hP0LkQ1mXiUvp0hi5Ytw":{"text":"Tonight we enjoyed a great buffet with featured seafood. There was chargrilled oysters, co","useful":3,"cool":1},"q47Ugjr_gbPDqQZJhkGMsg":{"text":"Love to play... They provide the rooms for our trips, but they also take our money. It's w","useful":1,"cool":1},"G5D9FPQfKtpJO_bDgGzK_w":{"text":"I used to work for a company that sold products to casinos. I recall doing work on where t","useful":3,"cool":3},"K5RL1kPbH34zleLYbkJWEg":{"text":"Excellent place love being in the heart of New Orleans  great hotel rooms with Covid going","useful":0,"cool":0},"lAxVGmsPLs8ahOSaVjfh9A":{"text":"This was the best caesar's owned property i have been too.  Hotel/casino are beautiful, st","useful":0,"cool":0},"Y9YrfTp3vCSNG3CdpBTs0g":{"text":"I lost all my money here and I now need some money to get home. Jk had a blast here it was","useful":0,"cool":0},"PLHB-KtD-BYSt-w-K8bNKw":{"text":"Went to Harrah's because I was in town for a conference. My Machine Was on the bonus round","useful":3,"cool":0},"3Tz_J9Asox3GESB9x7zzKA":{"text":"Nice stay rooms were clean and staff is friendly. After the first day we had to ask for ro","useful":0,"cool":0},"xB4wkudkAVDvVKNzU-Nweg":{"text":"As casinos go, I'd say this one is small but pretty good. The drinks come fast, there is a","useful":2,"cool":0},"F9jrFV1851UrS00DRGA_gA":{"text":"Went on a Saturday for the buffet.  Was disappointed that there was not more seafood espec","useful":0,"cool":0},"ErfEj9ckeQmLmVI58squzQ":{"text":"Had a wonderful experience here! Tables were hot and the drinks were complimentary if you ","useful":0,"cool":0},"9tteku3noT2C8pnJWCKSQA":{"text":"We stayed at Harrahs hotel before and after a recent cruise we took \n\nCheck in was super e","useful":0,"cool":0},"OkmqMhNumetMBvg5-stFjA":{"text":"Most disappointing buffet ever!! save ur money & go to golden corral if u must have a buff","useful":2,"cool":0},"8FYg_sLwlYJBW2ELaPwfGg":{"text":"Hotel is an absolute disaster. Covid protocol includes; zero house cleaning, diminished st","useful":0,"cool":0},"N0zPoY50kS8yOlRenRzJ1A":{"text":"We stopped by Harrah's Casino twice during our stay, on our first and last day in New Orle","useful":1,"cool":0},"QwSCzGGLWcaUCviLg4zjxQ":{"text":"Whenever I am in New Orleans, I stop by Harrah's to gamble a little and take a break from ","useful":1,"cool":0},"uYqZ0pV0LfVmfvgU4uow0Q":{"text":"I usually stop through here when I'm trying to get from the Quarter to the Warehouse Distr","useful":0,"cool":0},"vj6WtOMcekQ_LeKOgYxniA":{"text":"With all other casinos confined to their river-boat setups, Harrah's Casino New Orleans re","useful":0,"cool":0},"LYl3y0eusiWYjmDKJG9rnQ":{"text":"The rooms were beautiful! I loveddddd the tub! Staff was friendly and very helpful and eve","useful":0,"cool":0},"Gdb-Nrc8i11-ThZUGfFJIg":{"text":"Let's me start off by reviewing the Hotel at check-in. Arrived around 2:00pm to check in e","useful":1,"cool":0},"QDnvgWYyQqqwPamU_z4L3Q":{"text":"In New Orleans for Mardi Gras.  Came to Harrahs today\n 10th in line for 4 PM dinner buffet","useful":2,"cool":0},"fAwhPPzb3E9NTe5gQ-nRzw":{"text":"Harrah's New Orleans Casino, in my opinion has a serious crime problem. Just Google Harrah","useful":0,"cool":0},"7-kd7v0rroR_9H6FwHGoUw":{"text":"Been to many casinos.\n\nGreat heavy pours while playing bartop VP.\n\nAll the games desired a","useful":0,"cool":0},"57nOUhVhns_sl_FkMMSJjw":{"text":"I'm just not a gambler, so I don't get the appeal, and I don't know what to compare it to,","useful":1,"cool":1},"Idr_r1aK-qRhOk170VvYsA":{"text":"Checked in Thursday late. After reserving our room 9 months ago, upon checking in we were ","useful":1,"cool":0},"C4shSYMad7Fg9c4YhrUAMA":{"text":"I was here end of December and as a local from Vegas, nothing is comparable to my hometown","useful":0,"cool":0},"qAckVNkxFI7UUyJ_uFBp6w":{"text":"Ok, obviously I was bitter when writing my first review of this place.  Subsequent trips h","useful":3,"cool":2},"mg4R8zy6iSHHq4HW8dl1-A":{"text":"I love going to harrahs whenever I visit New Orleans. The slots are my thing lol.  I alway","useful":0,"cool":0},"6r-JFZs9oTI5ofwxKsTbsw":{"text":"If there was a negative rating, I would start with that. We really had our hearts set on h","useful":2,"cool":1},"SsYJwGV17yK1fQq1Fh3lFg":{"text":"This is the best casino in Louisiana. I'm not a drinker, but the center bar is a really co","useful":1,"cool":0},"G2mQ8GLkJhlkfRhi28lRiw":{"text":"Great little casino downtown but the parking fee is ridiculous... $30. On the other hand, ","useful":0,"cool":0},"zl6aHUMrdVd65laE31uw5w":{"text":"I'm not a gambler. I hate smokers. Only went in because they have a Starbucks and my husba","useful":1,"cool":0},"gyCTt7p7bVrmxrbVM3mM8g":{"text":"It's Vegas away from Vegas. There's a line for the buffet and every table has at least 1 p","useful":5,"cool":2},"91MTiXBe92-cByicz-PCEQ":{"text":"Its the best casino in the NOLA area... they also really need to step up and upgrade this ","useful":4,"cool":1},"AjFdZ-MGDIDU0W_w1Tzy2A":{"text":"This is one of the nicest Harrah's I've been to a few Harrahs & other casinos. This was ni","useful":0,"cool":0},"C0W6xVURrNdUNqcgv2TZBA":{"text":"I have been wanting a night out in New Orleans for a while. The Steak House at Harrahs was","useful":0,"cool":0},"HJ-NkE1UghcdEE2FkizHqw":{"text":"Had a great time....the hotel is across the street  from the casino..won big$$$ can't wait","useful":1,"cool":0},"9jfYLhXUm6B2bLT9XVil6w":{"text":"Just when you thought that there wasn't enough places to burn your money ... Well, here's ","useful":0,"cool":0},"oBs1IUtAD8RIcFidBsHpQQ":{"text":"Bathrooms are nice, place is cold & atmosphere is fun. I played blackjack for several hour","useful":0,"cool":0},"pLMNe1qqT1JBhJce06UkLg":{"text":"A couple of weeks ago when we vacationed in New Orleans,  we spent sufficient time in Harr","useful":2,"cool":0},"lsU8emTnRC18ZGXCF7995A":{"text":"Average sort of casino. The hotel is not attached, which means the casino structure stands","useful":0,"cool":0},"I1b2lj6mXRhnTRRy-SrACQ":{"text":"Most God awful experience I have ever had at a casino hotel/resort.  People trying to  rob","useful":1,"cool":0},"EFs5UxRk5qws31w-JnV2TA":{"text":"I'm not a big gambler, but I enjoy having Harrah's in the city on occasion. Most of my fam","useful":2,"cool":0},"KJGEYpAHG1Pk7nS9nPdM0Q":{"text":"It's like the only casino in the area.  They'd get 4 stars even if they were one of those ","useful":1,"cool":1},"WgVtGhqCBqDm9j3nmgDZLw":{"text":"HOW CAN THIS PLACE HAVE THREE AND A HALF STARS??!?!?!!?!?!\n\nTake it from a local that has ","useful":2,"cool":0},"9T5QIV3fn4InANOkNQJsQg":{"text":"Decent casino centrally located in New Orleans. We wanted to play some table games, but di","useful":0,"cool":0},"vVWczy3VdBY8622aXE-Uww":{"text":"Not a big gambler here. I've prob been to only one other casino in my lifetime. The casino","useful":1,"cool":1},"kCppGf4iqVioonAc5jQ-Cg":{"text":"6/29/14 and here at 8:50pm waiting for the car drawing that was supposed to start at 8:00.","useful":1,"cool":0},"FcNa4Ha6YBFbmDB8HefhzA":{"text":"Sick of the \"sorry that was unacceptable\" lip service of this place. I've stayed here many","useful":1,"cool":0},"TVshsFekABlDBQlMie1nhg":{"text":"Booked and prepaid  two king rooms in NOLA while we were in town for a work seminar.  Look","useful":2,"cool":0},"Ci1ipdOZfh_89gXDfrCMaQ":{"text":"It's a casino, albeit not Vegas fancy, but suitable if you need to kill an hour before you","useful":2,"cool":0},"wsikIVvCLZ4Zzu7vmMMteg":{"text":"Won money on the slot machines. At night he gets really packed about midnight. Watch out f","useful":0,"cool":0},"60FtuoaBc9Kxl_0avps0NA":{"text":"These racists hate the US Military personnel.  Never go to Harrah's, they are garbage and ","useful":2,"cool":0},"14SzS0Uv9_JY90kDvewlFA":{"text":"Racist place of business. Please take your money elsewhere.\nhttps://www.nola.com/opinions/","useful":5,"cool":0},"iXKO3z45ngL78A8eDPcvyQ":{"text":"This was the worse Buffet I would never eat here again food is horrible.  Everything was c","useful":1,"cool":0},"KVFG3xmzz8PfqHhm3jgw7A":{"text":"Haven't been to a casino since '98 and had a fun time.  I'm not hip to the rules of casino","useful":0,"cool":0},"5doSqpldrEApJI7moxTw1A":{"text":"This is by far the best casino I've ever been in. The food was great there was just too ma","useful":0,"cool":0},"mQe3lqbBUqb2v7L6KNTb3A":{"text":"I really liked this casino. As a smoker i prefer the vegas way of allowing smoking inside ","useful":0,"cool":0},"HtW4HKVZPCuh1nt5vvUQbw":{"text":"Wow am I lucky will be in town in March and my wife and I will again enjoy Harrahs.  We we","useful":0,"cool":0},"eRq7MMJNlF1Rz_foKx06BA":{"text":"Low incoming housing hotel. The clientele represents section 8. A drastic change pre Covid","useful":2,"cool":0},"xzeFFYYLmGEGxTZpRfqiDQ":{"text":"Very nice casino.  Dealers were nice and not as stuffed shirt as in some places. We spent ","useful":0,"cool":0},"seOQMwpoePfWI83-X6zX9A":{"text":"Awesome casino atmosphere alot of gaming space and machines. Come here somewhat often neve","useful":1,"cool":0},"CTLSVEHcBd7Pj75wYHxKuA":{"text":"We walked up the steps and smelled the disgusting stench of smoke coming from the inside a","useful":1,"cool":1},"tt4A87F6Rci-ustbNVQgkQ":{"text":"so nola is where they invented craps.  fun to watch, pass the dice, and bet no come.  walk","useful":0,"cool":0},"p37Htb6kCUUl2AyIrxqaDQ":{"text":"nice front desk service entrance is gorgeous. Hotels clean best hotel I've seen I NOLA","useful":1,"cool":1},"jHcf73tMrLioQGJTbHD-7w":{"text":"The first casino that doesn't smell like cancer. Hooray! This casino was nice but what was","useful":3,"cool":1},"Tl4gZA_3Ps7mZibImgMo9A":{"text":"I am so done with Harrah's!!! I got very sick from the buffet in AC and my boyfriend, who ","useful":1,"cool":0},"oGQzKQWZcpCaEHPhJv0-MA":{"text":"Oh, how times have changed. Back in 2000-2001, during my senior year at Tulane, I had many","useful":2,"cool":0},"9Tt1vjMJvxld1iAe-JaeIA":{"text":"Only giving it 4 stars because I lost tonight;) love all of the dealers, they're always fr","useful":1,"cool":1},"wnrFOCB5n58qSz2cm0g0cw":{"text":"I love Casinos, & I love Bars. I do not love being told to leave because I am in make-up. ","useful":2,"cool":0},"OihJ8QC-o6LF4f_yPCRH_A":{"text":"The must go to stop to stroll ppl\nWatch and gamble not to mention eat shop and kill time w","useful":1,"cool":0},"QC_Io5dqh4HXFZg23Oy13A":{"text":"I love New Orleans. This hotel is very nice. I like that the casino is a bit separate from","useful":0,"cool":0},"i80Z6h2u4Kx9c9-vhYiVnw":{"text":"This is already going to be a very biased review. I'm not a fan of casinos generally unles","useful":0,"cool":0},"pKvtw057RsiEk7YZoGSKIQ":{"text":"Very upset after spending super bowl weekend here and thousands of dollars they could not ","useful":0,"cool":0},"WczI-33e5hgn-PuaaW_K5w":{"text":"We always enjoying staying here at the Harrah's hotel. Very nice rooms and the staff is fr","useful":3,"cool":1},"faBzXM2Y8TwGS02ICCV3pw":{"text":"I only stopped here for the buffet so this is a limited review. Decent sized buffet and de","useful":2,"cool":2},"SWY-Sb5xGqI1OFUqP3lF3Q":{"text":"Lol so the buffet was awesome and what else can you expect from the casino its a casino. S","useful":0,"cool":0},"FhnZGjmxYRgC7PXWgtamKQ":{"text":"Over the years, I have stayed in many Harrah's establishments.  I have never been a big fa","useful":11,"cool":0},"ntBOu8YACKkwHni-pOFY2A":{"text":"Lots of machines! Boyfriend came away with +$60 and my Dad came away with +$350 which made","useful":1,"cool":1},"77n07x-Eh0ibEzf9yjzQCg":{"text":"Sooo smokey in there!! Got a huge headache :(\nYou can order your drinks of the slot machin","useful":2,"cool":0},"AtCeUcmpgu2WnrGPH5Crsw":{"text":"Answer 08/25/2016 10:17 PM\nDear David,\nThank you for choosing Harrahâ€™s Casino & Hotel as","useful":0,"cool":0},"pQAWn9Cih3DK67wcCQOIzA":{"text":"Harrah's is just like the casinos in Vegas, I am a Roulette player so that is the only thi","useful":1,"cool":0},"yv4HZVnm37w0qRGqk97brw":{"text":"I stayed at Harrahs for a long weekend.  It's nice bc the rooms are in a boutiquish type o","useful":1,"cool":0},"4J3RvLSDfEpenOIBg10xxw":{"text":"Place is a dive...but there wasnt any casino near my hotel...this was across the street fr","useful":1,"cool":1},"rmiTI4eZmQwWm6MHd-d7nA":{"text":"Stayed here Memorial Day weekend 2021. This review is for hotel room only. Hotel rooms are","useful":1,"cool":0},"AO3UKg9FZA7gO5zdZ1673w":{"text":"Super clean, hospitable staff and non-smoking. I love it! Sit down and play while you get ","useful":0,"cool":0},"V09Md5Gm1gDvd0vI4U98MQ":{"text":"I guess it's about time I reviewed harrah's, considering how common a stop it is for me if","useful":1,"cool":0},"HIixY5MY80OYSgI0_SkxLA":{"text":"It's not Vegas, but it sure is a fun place to gamble. It's right in the middle of it all, ","useful":0,"cool":0},"j5yElx1VvDxaD0N_Fe6e-g":{"text":"The housekeeping is poor. The floor has not been vacuumed in forever. It is disgusting. Th","useful":0,"cool":0},"qZQck6GJWpSGvTk6it2hTA":{"text":"Paradise for the gamblers. Everyone else not so much unless you like to people watch, game","useful":1,"cool":0},"8sVuLB56pKYDZQo34FGfCA":{"text":"This hotel location is super convenient. To all the shopping and dining. Room service food","useful":2,"cool":0},"LqbuxAhaVvwKHZTDx8Yv7Q":{"text":"Really neat decor. there are replications of the french quarter all around the casino. The","useful":0,"cool":0},"nJCJJz8x1G7Mo5xSkmIdFQ":{"text":"This review outlines the casino portion of Harrah's only. \n\nComing from Texas, of course I","useful":0,"cool":0},"Jq49nswoBTZX7vetDCT6oA":{"text":"Beautiful hotel rooms, fast and friendly service although pretty slow valet (took us almos","useful":0,"cool":0},"txMM0kpcmybr7jBwbeVHUw":{"text":"We went to Harrah's for a short time to play a few slot machines. The casino looked clean ","useful":1,"cool":0},"mrJS6Ppz4OGD-BXDsWoN4w":{"text":"Satisfy your gambling craving (or addiction depending on who you ask) with this casino con","useful":0,"cool":1},"K5ZsRIy9PGClmrjv6qFwyA":{"text":"Harrah's is definitely a Vegas style casino that some how managed to find its way to New O","useful":1,"cool":1},"q-3ROPa_ana76Tb2q-r13w":{"text":"Not the biggest fan of casinos but I had time to kill and it was the only game in town. No","useful":0,"cool":0},"6KOa_xaYCrzzTuWiMvtG2Q":{"text":"I'm not a huge gambler, but on the occasional trip to Harrahs I enjoy myself. They have a ","useful":1,"cool":0},"tmlOZUEC0E9p-a5-0hOePQ":{"text":"Our vacation in New Orleans was perfect... EXCEPT for the hotel!!!\n\nWe expected Harrah's q","useful":16,"cool":2},"tXzq05f1mpuSY1lftlPgeA":{"text":"So they have a casino area outdoors for the smokers and the indoors although smoke free st","useful":0,"cool":0},"bG7uoDN_0ZkYm6FqJAcoJg":{"text":"Went here as part of my Diamond trip with Total Rewards, even though I am a Seven Star pla","useful":0,"cool":0},"aaZkSU34YQLZQPRYzvbNrw":{"text":"Nice for table games.\nThey have $15 Black Jack.","useful":1,"cool":1},"tWVqwjyDn9JlmaDMQ2uNWQ":{"text":"Holy Hell! I've never been to Atlantic City but I have been to Vegas nearly 100x in my lif","useful":5,"cool":4},"EvpXcqrklFgAOk5uCMyEvw":{"text":"Nothing like the one in Tahoe, but still pretty cool. It was pretty quiet when we came her","useful":1,"cool":0},"GytpELC_jtZvbVADV5gIdA":{"text":"Nice hotel. Friendly customer service. The rooms are very nice and updated. We enjoyed our","useful":0,"cool":0},"pjeUbYngW4GVTN2jOGq5fg":{"text":"Andrea, the overnight bike security was great. After a VERY trying night he was the most h","useful":0,"cool":0},"R4EGFcqV4ZjiFBzp-2Xl7Q":{"text":"Nothing over-the-top, but our room was really nice. We got a decent price being a Total Re","useful":0,"cool":0},"67BBnFy-mysHY010uiE6LA":{"text":"Normally a casino like this would get 3 stars however it is your only option in New Orlean","useful":3,"cool":0},"t_lNERB62-mgZ-ZwsAmBkA":{"text":"I love Las Vgegas and the gambling ambiance. However once stepping into this place the vib","useful":3,"cool":0},"KErRiFWphHP1L-mPHUyz8A":{"text":"This review is only about the buffet.  I ate like a PIG!!  It was awesome, crab claws, shr","useful":1,"cool":0},"pwjX4Xk5xWMW-DgaW_e6VQ":{"text":"Harrah's is beautiful.  The staff are very friendly and welcoming.  The rooms are very com","useful":1,"cool":0},"7zCHkhmuadWZ_DVhdICr8Q":{"text":"I came here to eat at the buffet and expected to eat at the seafood buffet. It was regular","useful":0,"cool":0},"8LdRruSOWXIBL-P7GzpHwA":{"text":"This place is aweful!  You have to pay for parking!  Not only that, the restrooms are nast","useful":1,"cool":0},"FA3NkK3Bkhgw1Z-lgNR8HQ":{"text":"It was our first time to go to a casino and to gamble and we had a pretty good time! There","useful":0,"cool":0},"6U_jskF3BsX3J2qs2g6HbQ":{"text":"I'm not sure if you guys have been to the Harrah's in Vegas, but this place is a PALACE co","useful":2,"cool":2},"GDy5U39sM9ozR1kgn4Lo_g":{"text":"They don't check everyone's id's. i was the only one thar was carded. Flattering and annoy","useful":1,"cool":0},"UVZvzoUducSrjsxoxxSz1g":{"text":"Positives first - most of the desk help is great. So are the bellmen. However Joanne the C","useful":1,"cool":0},"0djAd_YG1EVbbvVsv7vJjA":{"text":"Dude, I made like 8 dollars in profit at harrah's.  I beat the system man!","useful":0,"cool":0},"poVM6MqjhO63XQt1o4anMQ":{"text":"I love Harrah's the environment is so chill and the whole facility is always really, reall","useful":1,"cool":1},"XLlxw4s3xX-fYevP0liHJQ":{"text":"The DJ is awful! No soul no rhythm no music.  Everyone is literally standing around the da","useful":0,"cool":0},"K3PBr0X2Ls403O1gyJT6hA":{"text":"It's a casino.  If you've been to one, you know what to expect.  If you have never been to","useful":0,"cool":1},"ogh7x8sTkqCnKPrKuSWpCg":{"text":"The is the nicest Harrah's property we have been to - better than Las Vegas, Tahoe or Reno","useful":0,"cool":0},"jP0zXjmkpmGDCEp1KAJvYg":{"text":"No cigarette smell noticed at any time of day. Other than what was coming the bodies of pe","useful":0,"cool":0},"A2aKQbWoNR1KeXTIfqDv1w":{"text":"Spent WAY too much time here during my New Orleans trip! And lost too much money!!! Very l","useful":1,"cool":1},"RCgSuVptnuoMMc9sDRwqDA":{"text":"I wanted to give my daughter a nice  experience for her first stay in New Orleans. Unfortu","useful":0,"cool":0},"2lFyZ6VrWZps96wzOQ6oNg":{"text":"I only spent a couple of hours at Harrah's New Orleans, but I walked away pretty impressed","useful":1,"cool":0},"sfz80Q5XDhaI3idnS2iZNw":{"text":"Meh, indeed. It's fine for gambling. Nothing special really. Buffett is awful. You should ","useful":0,"cool":0},"YH2KFUAr7bcWaeG9CZ4ppQ":{"text":"They are not familiar with all state IDs...including Hawaii's. Wouldn't let us in!","useful":0,"cool":0},"BmVVnvdCjmvhfF9fNX6f5Q":{"text":"This review is primarily for the buffet - specifically the Seafood Extravaganza on Thursda","useful":5,"cool":1},"0582l3IgDBCvXbx7KOqT8w":{"text":"The Slots are incredibly tight. Most don't even attempt to entertain you. They simply suck","useful":1,"cool":0},"CyT9FeHhL34qlFu7gViotA":{"text":"Harrah's gave me the worst casino experience of my life! The casino staff treat you like t","useful":5,"cool":1},"EDxwUrJLQSY63-Bubea8pw":{"text":"Ok its a casino..seen one seen them all!  But I did enjoy that they had a lot of penny slo","useful":1,"cool":0},"9eNFCwC9iWKVObT1gUC49Q":{"text":"Always crowded and table minimums usually never dip below $10. The only land based gaming ","useful":0,"cool":0},"ABouWs8C-4LYBlS5XwSmXA":{"text":"Stayed at Harrah's with a group of five on a trip to New Orleans in May. We we were hesita","useful":0,"cool":0},"Z4sL0nOG9cCO-pnc8Onpkg":{"text":"I can't say anything in particular about the games and such because I was only here to eat","useful":0,"cool":0},"-rjDRGvof9C6MWFncFWooQ":{"text":"Great options for any gambler as for as game choices although the tables have been high re","useful":1,"cool":0},"Jk2K0EYnHF62PaY9nofZ0Q":{"text":"Pretty casino. Was very surprised that you can call for a drink girl from your slot machin","useful":0,"cool":0},"Dv1l2AhH0uLG_YSzRLS64w":{"text":"So I was in town on a business trip, and I decide to come gamble a little bit one night. T","useful":6,"cool":4},"nEpS26utBig14JZ2j1C7xA":{"text":"As you open the front door, the first thing that hits you is the wave of ashtray odor. Sec","useful":0,"cool":0},"Pf18Fo5zyH50vEgAan96Wg":{"text":"Worst casino ever. The dealers beg and hound you for tips. Very aggressive! !! Dealer argu","useful":1,"cool":0},"FLNDfOTF6hqffLNRoawjuQ":{"text":"Very nice staff, loss my money though all $2.00 to be exact. Felt just like Vegas to me! T","useful":1,"cool":1},"qed0lONafbTJAQqOp2OUJg":{"text":"The drinks are super strong and not too expensive. We didn't stay here or gamble but would","useful":0,"cool":0},"NVFPsWG-o5NZr13ioDlm1g":{"text":"I don't understand why Yelp won't split Harrahs Casino and Harrahs Hotel cause they're two","useful":8,"cool":5},"q7m9CdCXSdEMEO6Cup1_nw":{"text":"The Harrah's is a totally decent casino by all means.  The dealers are friendly and the cr","useful":1,"cool":0},"BZJ62mrO3z1WZrhnclFlpw":{"text":"Positives:\n1. The casino valet parking is pretty cheap 2-4 hours is $10.\n2. Bathrooms are ","useful":2,"cool":0},"kDRIUpzKs3dRTZNSUJDe0A":{"text":"The VIP staff is the worst in the Casear Entertainment system.  There needs to be serious ","useful":0,"cool":0},"taqkOrH4GDogvRXt8rPYaw":{"text":"Not necessary the best casino visit in my opinion! Harrah's is obviously a staple for gamb","useful":2,"cool":1},"pkuRzzEuRaX2v3_JAmsB0g":{"text":"Great hotel staff is great casino is very nice as well. Its also not in the same building ","useful":0,"cool":0},"OX10bGMF9ghB-Zv_BpZWOg":{"text":"I guess I should have checked the reviews before I went.  It had been a number of years si","useful":3,"cool":0},"uohyuewhsCmHANv6IU_nhQ":{"text":"Very nice stay at Harrah's New Orleans.  The people at the front desk are very pleasant an","useful":0,"cool":0},"Fk5AIsAFnJRE29YgpjDKSg":{"text":"This was a change up compared to the nitelife you will find on the Mardi Gras street downt","useful":0,"cool":0},"yNMsTwBBPYLsg5pI-xnksA":{"text":"Beautiful hotel and casino. Outstanding customer toner service. The rooms are a nice size ","useful":0,"cool":0},"ClTvjy1tWuHdHhOvpDJJtg":{"text":"they don't allow smoking! That's probably the best quality of this place! It's also very c","useful":0,"cool":0},"SqMbSb_rGh4HoT4e8KMRIQ":{"text":"Hotel is new and well built.  Hotel services are horrible, operator just transfers you som","useful":0,"cool":0},"jeLAZlS24P-2e-S5tCgTjA":{"text":"Parking is hard to find so hopefully your staying there or at a close hotel the nice thing","useful":4,"cool":1},"WWLYVbaIMQIL-2GKcfMBSg":{"text":"Great casino, not too far from the heart of the French Quarter. I'm not much of a gambler ","useful":1,"cool":1},"SGfPnb9am9k9XNupnjgoMg":{"text":"Just came by to check it out since we were in the area.  They were carding people to get i","useful":0,"cool":0},"e1Mc-8_CHXcs0016jnWSHQ":{"text":"Great place to stay if you're on a Business trip, Vacation, or just in town to catch a Sai","useful":2,"cool":1},"uxPHznJjAQ8Am0YqNAuB4A":{"text":"The service and room at the hotel was excellent. I was double billed for parking which is ","useful":0,"cool":0},"ynE8x3rN56gypNDIIhULHA":{"text":"Best brand name casino amongst boomtown and treasure chest. The bar service is phenomenal,","useful":2,"cool":0},"YyRk3_K55ae7cP1irVjJgQ":{"text":"We enjoyed every minute. Greatly located to lots of things to do. Service was great. Let u","useful":0,"cool":0},"Af_1c75RhxtIid3Qi6LHUg":{"text":"Average casino, pretty large for outside of Vegas. long wait to get to the cashier seemed ","useful":0,"cool":0},"uPDgq5ArabJhK5F0BOYRwA":{"text":"Stayed here for the first time and wanted a good location. This hotel told us upon check i","useful":1,"cool":0},"Y2aA7M3oSt0lym2c4YZiCw":{"text":"I didn't win any money however I enjoyed the atmosphere . There was a drawing every hour f","useful":1,"cool":1},"OgPq8nFHQOclqa0RcEvkWQ":{"text":"Vaccine status checked upon entering.  Good selection of games.  Air wasn't smoky because ","useful":0,"cool":0},"lMHgttaiPt-ra8_h5o8grw":{"text":"I went in here to find my husband who was playing cards in the poker room.  I've been in c","useful":0,"cool":0},"MvmP_6SM91RxTbQd3i_eWg":{"text":"A tourist trap to end all tourist traps. The security guards are way too big for their bri","useful":14,"cool":8},"jb36Hwh086FmxPm6r0Xb_Q":{"text":"I'm not into the casino thing, so this is more about Masquerade.  I've been in several tim","useful":1,"cool":0},"m4n2H9vWKYoJMBxxCjdarA":{"text":"Only reviewing the casino: the free drinks that come with playing at the machines is a nic","useful":0,"cool":0},"FQ6XXh3POyYxgdKLZS0mzw":{"text":"Never go here unless you like rude, arrogant, lazy workers who act like they dont want to ","useful":0,"cool":0},"kmAB2DRJRbpfxfYVTykadg":{"text":"If I could give NEGATIVE 5 I WOULD. This is the worst casino on the planet. They have the ","useful":1,"cool":0},"fQR7Virynw-F7q40msj2Nw":{"text":"Played poker for the last two weeks at Harrahs New Orleans while visiting family.  The pro","useful":0,"cool":0},"UiZR69eKewfKlQToSl9eoQ":{"text":"Well this will be short. I am from vegas so I was optimistic at the very least. But in a n","useful":3,"cool":0},"2O9Jxjq4g7mRP2zERLUA_A":{"text":"This place needs an overhaul. Carpet is nasty, furniture has stains all over it. The comfo","useful":0,"cool":0},"c9kzz4aMFW2Gf1USUnATHA":{"text":"My wife and I just spent August 9th to 12th at Harrahs. It was EXCELLENT!! Kelsie checked ","useful":0,"cool":0},"uFsreMeSviQPOaLoKyZBEQ":{"text":"We came here for the buffet hoping they would have snow crab legs, but instead they had wh","useful":4,"cool":0},"8r3vsQNKweN9ChgmtqvLbw":{"text":"There's something super cool about a large casino right in downtown New Orleans. I came he","useful":5,"cool":3},"tzaM4ICfH1K1YSLp3evNEA":{"text":"This casino is really beautiful inside and out. It's clean and not crowded. It's great to ","useful":1,"cool":1},"syJ4dpn1H_DKK5_j0tWXGw":{"text":"F You Harrah's. I hate you. Your slots are far from loose and you took my $60. Some of the","useful":1,"cool":1},"hJD0MEyTG4EnRGDPLBkqTg":{"text":"I always do good @ Harrah's casino in NOLA.  The only drawback is that the gaming floor is","useful":3,"cool":0},"MueMbMtUFnWdXcbG_u3BGw":{"text":"I'm not a gambler but my wife really enjoys the casino so in we went during our stay in NO","useful":5,"cool":5},"7hWNmUqFnIg3oTZ9nIm_ng":{"text":"I was here for a conference, and didn't spend time in the casino.  The hotel is pretty nic","useful":1,"cool":0},"AeuYVzgvwtvJHx8DM4HZUg":{"text":"Dropped about $120 here in about 10 minutes.  Very average feeling casino and nothing to g","useful":1,"cool":0},"ErFXpsm2uQ7iksk8DTgD1A":{"text":"Harrah's won't replace Vegas but it will take care of your gambling urges. We visited on a","useful":5,"cool":6},"Hi3dGKHPddBwirx7cEC9Yw":{"text":"I've stayed in the hotel several times, so I'll keep it brief. \n\nPros: \nCard key access fo","useful":1,"cool":0},"0xH8wVRIiXqAgR6BGgy7XA":{"text":"First the good. The hotel at first looks very classy, but there were a few issues. The roo","useful":4,"cool":0},"8d9wQUHor7oEOqnQFO-GLA":{"text":"Who knew right outside the French Quarter, right off of Canal St would be a casino?  Heari","useful":1,"cool":0},"9VnNBYDMmMp2Ql_Bbt6oNw":{"text":"It looks good very good but I didn't notice hardly anyone winning and those that did it wa","useful":0,"cool":0},"0ntlMC_0grhRJkUEXwuNgQ":{"text":"Harrah's became part of our daily walk from our convention hotel to Bourbon St. mainly due","useful":5,"cool":2},"O6alWbeXTN8bzBd0LmwGGg":{"text":"Three night group package.  The hotel is beautiful.  Hotel service the 1st two nights were","useful":0,"cool":0},"vdXu1VZuAJmTfV5fieeQpw":{"text":"Very nice casino. I won...So I am biased. hahaha!\n\nWe had a great time here. Randomly went","useful":1,"cool":0},"bPWK_VJd4a6wfQuzn09nFQ":{"text":"This is a decent casino for the area.  It's definitely the nicest one.  They have a bunch ","useful":2,"cool":0},"FbnBSTesdo_7aNoVYMW-LQ":{"text":"FRAUD ALERT BE CAREFUL. My name is Grace and I live in Florida.  First off I am new at thi","useful":1,"cool":0},"QQUiS44-LkJQW4pR1756pA":{"text":"Clean casino! Smoke free! Great buffet. Check-in on Yelp for a free glass of wine or champ","useful":0,"cool":0},"1eeKuLkj4Z3X3KPq_W64hg":{"text":"Nice hotel with friendly service and clean rooms.   I enjoyed the stay here.  But boy, doe","useful":0,"cool":0},"UGeLWziPFwGwoLjNl48cmQ":{"text":"On our trip to New Orleans we had to stop at this iconic casino. Such a historic place wit","useful":2,"cool":1},"A3jtOyIMAqX1x3UQl6023Q":{"text":"Boring casino, we were there just to kill time. They have free drinks and buffet is $28.","useful":1,"cool":0},"NBg9crDNzVAXZmcsVvR60A":{"text":"A little ways away from the French Quarter but still walkable if you want to stray from th","useful":0,"cool":1},"H5OLP8qjv28MaYmjB9z0iA":{"text":"Lovely hotel, clean, great staff. Central location, conscientious! We felt very safe, and ","useful":1,"cool":0},"xParOy6Rlz7IcENkAwUV-A":{"text":"Stay at your own risk.  This hotel looks nice on the outside, but is a bedbug-infested dum","useful":3,"cool":0},"jdlUCMiWQ9YitBGUGpDUwQ":{"text":"HOTEL REVIEW ONLY\n\nFirst world problems aplenty at this place. We'd arrived on a friends p","useful":7,"cool":1},"yDvlBFlMZsle6lvw9F_oCA":{"text":"Pretty solid for a casino in one of the nastiest city's in America.","useful":0,"cool":0},"BuGTF6PQkkFlLeXHKV2z0g":{"text":"Any place that has air-conditioning in the New Orleans summer is A-okay with me.\nI'd rate ","useful":0,"cool":0},"qbORcROghKTuQx9Y4fACnA":{"text":"I really like this place. It's high energy and fun. Great location. The buffet has yummy N","useful":0,"cool":0},"yV4h3vO4JjTxhhz0coKiTg":{"text":"Something for everyone here and enjoy the \"good luck\" greeters with smiling faces. There's","useful":1,"cool":1},"64Xew6f1_eAffG4cn5Zffg":{"text":"Beautiful place!   The people are very friendly who work here!  I would visit it again!!  ","useful":0,"cool":0},"8Ekd_V7kzNR9Xb7bVM04wQ":{"text":"Just checked in,  wanted a \"resort hotel\". And there is really no resort anything here -  ","useful":4,"cool":0},"xrU9FaCeT7X9uVkKbFmBBg":{"text":"No one else seems to appreciate the subtle oddities that occur here. It's really quite rem","useful":6,"cool":5},"FORansJoZgD6Mn8tx8wMxw":{"text":"The location is great it's right downtown and walking distance to most of the sights the v","useful":1,"cool":3},"j4sXvYCL0viW94F31xTt1A":{"text":"Coming from South Florida where there are Indian Reservations with over 5 casinos in close","useful":3,"cool":2},"FjaZG0ysuyqDj-dNP9nvCw":{"text":"This hotel and the staff are first class and offer the best service!! They made our trip a","useful":0,"cool":0},"9Rs2hAofLAGAg07ZMy7u1g":{"text":"Thank you for separating me from my husband and not letting me into the casino even though","useful":2,"cool":0},"SaaxuElGWHEQZXyKhn7UoQ":{"text":"I had so much fun here! There is a Starbuck's and McCalister's inside. The rice crispies t","useful":1,"cool":0},"oh-kvpZpw4h_b_m6tb1sQg":{"text":"Maybe I was just in that French Quarter kind of New Orleans mood, but I really liked this ","useful":6,"cool":5},"EEde97NY_YkrGOcW-Cbcjw":{"text":"I've stayed at their hotel over 15 times. The rooms need to be updated. The front desk peo","useful":0,"cool":0},"a8a5j_jeFF6xUuTie1d-Pw":{"text":"The hotel was great and everyone was so very nice. Eat in the steak house in the casino, w","useful":0,"cool":0},"XZVIxL_br_DWenZart5Y4Q":{"text":"I simply forgot my vaccination card in my car while doing door dash. Generally,  if we're ","useful":0,"cool":0},"2lDu-n-FCbsCE33RHc103Q":{"text":"Was surprised to see how much Harrah's has cleaned up on the casino floor area here in New","useful":0,"cool":1},"Bd-tGgb3Vr66ENrt3LaNIw":{"text":"I don't know If I have the right to fully review this place.  I only went to gamble.  I sa","useful":1,"cool":0},"LqjIHmB-j7_sWi_mXgfhDA":{"text":"Recently visited this casino/hotel in June of 2010.  As soon as you walk in the door of th","useful":0,"cool":0},"4xCY833Nb4MiZbvpKAIOAA":{"text":"Had a great experience here! Won a ton o money and was lucky as heck! All i can say is mor","useful":0,"cool":0},"1icshOy3CPlv0umyCyYsGA":{"text":"My husband and I ate at the buffet today. Our server Woodrow was the best server I have ev","useful":0,"cool":0},"Q_J6OfuueQ4m6a1L6-4z1Q":{"text":"Hotel was nice but nothing fancy. Casino now is a differant story, yes its nice but beware","useful":1,"cool":0},"9lm5mbSbuuznPwdi212Baw":{"text":"Wow what can I say? The suite here is absolutely amazing!!  Definitely one of the best Har","useful":0,"cool":0},"40Oq8FKqPaKDZr-_CYcqzA":{"text":"Very friendly and accommodating staff.\n\nNice room. Could hear the train whistle a couple o","useful":0,"cool":0},"tp4J9xrk13jpceltb4iIBg":{"text":"If only I could have given a zero or less! Although a very pretty location, this place lac","useful":2,"cool":0},"pLQBHTuyaSQtAKxmq6YbGg":{"text":"What a beautiful Harrah's. This is the nicest Harrah's that I have ever been to. It's in t","useful":0,"cool":0},"1wXYMTczP9FtAVyDUYcnZQ":{"text":"SERVICE: 4/5\n\nThis review is primarily for their table games. \n\nThe dealers were nice and ","useful":2,"cool":0},"98gcTZtOeaOKyCvZQfJGug":{"text":"Yeah, money! I won it! Then my husband spent it. And then we left. But while we were there","useful":0,"cool":0},"a4yBA39MSAtNEUsKKCbcDQ":{"text":"I'll start by saying the hotel smelled fresh and clean- the bathrooms as well. I have been","useful":0,"cool":0},"XzbMCUYdmBWeSQK_H6ld6w":{"text":"I hope u brought ur own towels and soap because they do not make up the room.... this is o","useful":2,"cool":0},"5TEpWM1cqVg_r9LltphhXA":{"text":"Pretty typical casino.  Pretty much if you've been to one you've been to them all.  Plenty","useful":0,"cool":0},"L45wV2C8GRq9e5xsLNKVyg":{"text":"My opinion on this place is one-sided, like every good casino review should be. I've been ","useful":1,"cool":0},"arTCej_H0wGvIE6nTCbEyA":{"text":"We have not stayed here (yet). But we have visited New Orleans every October for the last ","useful":0,"cool":0},"xeUSfcyWV-fk0GX_paSE5g":{"text":"First time in New Orleans, Hotel was very nice, but if you're expecting good customer serv","useful":0,"cool":0},"Jkxqll640zSl5GcJ7qNgJA":{"text":"The casino was great. The hotel was also. Both are extremely nice and beautiful. The rooms","useful":0,"cool":0},"phTdLy8_Bhvd_J5TorL4JA":{"text":"Thank god for the ultra-cold air conditioning they pipe in here. I think that keeps people","useful":1,"cool":0},"uEzS00CkHv4s_xSX7VO1Ew":{"text":"3.5\n\n\nGathered from my short visit to this place, what's great about it is that they check","useful":2,"cool":0},"hY-vutTkLyiJWEYikcUrfw":{"text":"Pretty nice casino for one located outside of Las Vegas. They have an acme oyster house wh","useful":0,"cool":0},"fds_MU3AdAIGb0SsUI0K6g":{"text":"On Friday, we moseyed on down to the roulette table and placed a split bet on 28 and 29.  ","useful":1,"cool":5},"Y9FDJtP45ZBBxdcATQarnw":{"text":"Karen is a fantastic blackjack dealer. Great attitude and accent. They a little slow on br","useful":0,"cool":0},"2yx6RyxzEtkZyBDntMWmUQ":{"text":"Update: Stayed at the actual hotel during a convention using a promo on the website and pr","useful":2,"cool":1},"inN7xiOtl4dWR9YlLtq6Qg":{"text":"I was stunned to find out that Harrah's has a huge casino here in NOLA.  It's got all the ","useful":0,"cool":0},"PARHYtq8tEASLXsdWjqizQ":{"text":"Best poker room In the city. Buffet needs lots of work. Don't eat there. There are dancers","useful":1,"cool":1},"7e117iNU0wSIQ0DQyJrTsA":{"text":"Disclaimer: this review only pertains to the ballroom in the hotel. \n\nPre-COVID 19, I atte","useful":1,"cool":1},"XDP3EvlPsBby1ci5awE4zA":{"text":"What to do on Christmas morning in New Orleans?  Go to Harrah's casino!  I had expected it","useful":1,"cool":0},"2zePIsTFLwen4pDL1HtAdA":{"text":"Love all Harrah's hotel/casinos.  We are looking forward to 3 days in December.  Does the ","useful":0,"cool":0},"frprbUoZjm78gpwNEtO0EQ":{"text":"As if NOLA's party scene wasn't better than Vegas already, NOLA also has a fantastic casin","useful":0,"cool":0},"MkX5utXawHx34HvSwwBxmQ":{"text":"This was my first time actually gambling in a casino, so when my Mom and I walked into Har","useful":1,"cool":0},"9Nj7L8tnIeNu-NTWdgiaaA":{"text":"Great location in downtown NOLA when you want to get out of the heat and find a comfortabl","useful":0,"cool":0},"foo34rhf3IugVzfDlAhnpA":{"text":"I am extremely disappointed in this Harrah. While on a 15 year high school class reunion, ","useful":2,"cool":0},"pcGhZfjCLO5XEeWaO-fC3g":{"text":"Very unprofessional and trashy casino. Would not recommend wasting your money here. The st","useful":0,"cool":0},"KTP3bIzWrfFPL75YbmUFHQ":{"text":"Hotel is an absolute disaster. Covid protocol includes; zero house cleaning, diminished st","useful":1,"cool":0},"oUA1HJTwcnI-QoE2EfH5ng":{"text":"We wanted to give zero stars. We were there for a conference and got 2 rooms. Long line to","useful":0,"cool":0},"-ue9lo5xI2l_FKX6v85yVQ":{"text":"I've stayed all over NOLA and this by far has been my favorite stay to date. Brandon, the ","useful":1,"cool":1},"E6oj0bUqo56Ls7kGGSP6Rg":{"text":"Ok, so I like to gamble. This casino just doesn't seem to have any specials or any pay off","useful":5,"cool":2},"GQxYtMBM2JS1FMLyjzkNCQ":{"text":"It was a while since I been to Harrahs, but the first thing that was amazing to me was tha","useful":3,"cool":0},"ZXQsl4vfcDO3XRnpz2iMsw":{"text":"\"New Orleans isn't all that\" but this hotel was very nice. The staff made every part of my","useful":15,"cool":15},"NxgGlmHilS-9CzYXNEL4vQ":{"text":"I am not one to gamble, but I did enjoy their pralines! Three for $4 is a deal in this are","useful":1,"cool":1},"O-p7XGV74lhXJtQO-XPq9w":{"text":"I expected more out of this hotel based on the price. We had to hang out in the lobby for ","useful":0,"cool":0},"FO1Ss3atU8F-SNGuv_xaDQ":{"text":"Naomi the cocktail waitress who was workin last night made our trip memorable and totally ","useful":0,"cool":0},"XFugIWgNitEsxN7z_hERiQ":{"text":"We dined in on a Friday night which is their Seafood Extravaganza night and let me tell yo","useful":0,"cool":0},"RISQIijbLbLws89bAx8IZQ":{"text":"Stars for its location since it's right there on the Riverfront and surprisingly the food ","useful":1,"cool":3},"ogw0LJtcWeF0rB_PYNa7YQ":{"text":"In a very inebriated state, I decided to stumble in here and try my hand at the slot machi","useful":0,"cool":0},"R-PRnZ5Uv4t2qp55e9wa6w":{"text":"This review is specifically regarding the buffet. I feel like I shouldn't complain since I","useful":0,"cool":0},"HTKZ5Hkzon6RqLpW0QMkHA":{"text":"dingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdingdi","useful":0,"cool":0},"TqN9fBt7Em4OfHODNSDInA":{"text":"srsly, WHERE ARE THE LO-ROLLER TABLES? the cheapest blackjack tables are $15, which is abo","useful":1,"cool":0},"9w7qWTKVCJ3ljN3aS-HcwQ":{"text":"Full disclosure, I do not gamble. I may play bingo every now and then, but I do not normal","useful":66,"cool":63},"OySv9T5QzIwMrSqqT4NwEw":{"text":"I was happy to see that our hotel was literally steps away from this Casino.  I was expect","useful":7,"cool":4},"nGuIA5AxKvkprZ3wJ8NP1g":{"text":"Money money money! We walked to harrahs which fortunately was across the street from our s","useful":0,"cool":1},"LjaK1dilIdK2-IBWbGmtuQ":{"text":"Harrah's New Orleans is unfair to Caucasian customers. If you are white you will be treate","useful":0,"cool":0},"Rc2BWQrXs2OPfgIILpkmAA":{"text":"I have zero experience with casinos.  I don't gamble and I've only been to two casinos in ","useful":3,"cool":2},"FHslL0pWHKIJBAcusNDBRw":{"text":"Attention to detail is everything................................this is where Harrah's fa","useful":0,"cool":0},"vTumyua2vHR_VFL9t9zoKQ":{"text":"Buffet was horrible! Expected more out of this place, and it was a total letdown for Chris","useful":2,"cool":0},"tvbA0_m6kQj0vMfMj6ExzA":{"text":"I guess the reason for my review is because I'm not a gambler. I can go and gamble $5 for ","useful":1,"cool":1},"BQjbsh7RIhrbAHT4Eh0I6Q":{"text":"Stayed at Harrah's Hotel for three nights on a recent visit to NOLA.  The purpose of my vi","useful":0,"cool":0},"eIcTqMXp-vZlcMLBR-Ec3A":{"text":"This review is about the hotel.\n\nI LOVE THIS HOTEL.\n\nI love the staff, I love the location","useful":1,"cool":1},"cqUG8WC6VLcCu7ApvMov0A":{"text":"This was my first casino every visiting during a bachelorette weekend. The place is very c","useful":0,"cool":0},"A-w0PB1KuGMTlL4O1Zwa6w":{"text":"Had an excellent stay here at this hotel. The service is top notch and the property is ext","useful":0,"cool":0},"KyKhxX50o13WBSTIwy6K8w":{"text":"This is an average casino. I like that it is smoke free and its pretty big. The drinks I o","useful":2,"cool":1},"E1QgiJ-NpFBfyfNulnhRnQ":{"text":"It's walking distance from Bourbon St or the French Quarter in general. It's a good time, ","useful":0,"cool":0},"lFnGzjaFiLfUtnkEun-GQg":{"text":"First time here and it was great! They have a good amount of Machine and table options. Gr","useful":1,"cool":0},"izHy5nDYbl0jRIAX_G2NjA":{"text":"I really enjoyed this casino. I was surprised that it had such a verity of games to play. ","useful":0,"cool":0},"gznM-kkZmc9ReraKwREYaw":{"text":"The valet manager at 9:34pm was absolutely the most unprofessional individual I have encou","useful":4,"cool":0},"240qytauQFTfgPLwVlt5og":{"text":"This place was awesome for a CHEAP first time gambler.  Free parking after 30 min. of play","useful":0,"cool":1},"UjizaXH_i_n-Dvuq8p7raA":{"text":"Go to another Casino if you are looking for any kind of comps. If you are looking for rude","useful":0,"cool":0},"Ytz9snxH-fDP0DPefEmJhQ":{"text":"Eh....I've been to better casinos. It was a quick visit for me, cause my cash went FAST in","useful":1,"cool":1},"UQ48pQKa6iIM0_3shCUe7Q":{"text":"The casino was very average, didn't impress nor did it irritate.\nGot a starbucks inside an","useful":3,"cool":1},"8iQz2-4ntCb8oOZXMGePMA":{"text":"I'm not much of a gambler. I've been to Harrah's a few times and it was only because it wa","useful":0,"cool":0},"fgrGERz1NLtqC-JvMtk8jQ":{"text":"I came here to stroll around, gamble at the casino, and visit the Nightclub called Masquer","useful":0,"cool":0},"F6V0HC-HWVzkkbWG3wAimw":{"text":"I've gambled at Harrah's New Orleans since they opened in 1999. The casino has always attr","useful":23,"cool":18},"EdEWGELuKf5j0XrfJppXiA":{"text":"Not as nice as the casinos in Vegas, but it will suffice if you have the urge to gamble. N","useful":0,"cool":0},"pPqWDffs-f6GZQUPfT4hyw":{"text":"What a classy casino in the city of New Orleans.  Nice and clean. It was busy when we were","useful":0,"cool":0},"WXdZy8dABHMsAYOrwVVRaA":{"text":"This is a great place to find a restroom with clean facilities since those are rare in Nol","useful":3,"cool":4},"0jO1rAx42X29GYfiEluuMg":{"text":"Not much of a gambler anymore, but this is a great downtown hotel with plenty of parking a","useful":1,"cool":0},"4pYWQ9fr3whXAtwyIu9J_w":{"text":"We usually visit New Orleans yearly ( with the exception of 2020), each time we try our be","useful":0,"cool":0},"0FCwTGIGS-TiF3gkmUr_yQ":{"text":"Wendy Wendy Wendy!!! Oh how I love thee. She is extremely full of energy and will serve yo","useful":2,"cool":1},"a65VVgVDbtWkh9I_H5Pt_A":{"text":"Great place for dinner! Carolyn was wonderful and made our second Mardi Gras in New Orlean","useful":0,"cool":0},"-E7xDOlX2EgN8nDPSDLz0Q":{"text":"Love visiting Harrah's. The buffet was \"okay\", on their website they advertise a \"Seafood ","useful":0,"cool":0},"bB7_4bX0ZXY0Q8N_MMZQKA":{"text":"The Hotel was really nice, our room was clean and spacious. Service was excellent. \n\nIt's ","useful":0,"cool":0},"A9mMzyhgOqh-ayhrYxXQ3A":{"text":"My trip to Harrah's was the first time I have ever gambled in my life. I am not experience","useful":0,"cool":0},"VooALI0YRlSv2PAPgwfHAg":{"text":"Everything that could have gone wrong...DID. Harrah's offered a comp room, so I booked a k","useful":7,"cool":0},"-PIhINU2no_9WxiIYNTzBw":{"text":"Harrah's Casino is one of the cleanest casinos that I have been to. I loved the fact that ","useful":48,"cool":55},"ulU4V8oDSsv2DtJtcCCduw":{"text":"went to casino april 16th had my ticket stolen security said it was a known person thats d","useful":2,"cool":1},"7Kip8Gu14bi4rjjrjNBiyw":{"text":"Here for a conference!  My first time in NOLA! And very excited to be here. First thing it","useful":0,"cool":0},"FbzmdyZII6Yrb9uKYDSJKg":{"text":"I'm not a huge fan of casinos, but Harrah's is actually pretty nice. I hate that you can s","useful":3,"cool":1},"NpJZuRc181IJRG1YqGU11w":{"text":"It was my first time at a casino and it was a fun twenty minutes I spent. I'm not a big ga","useful":0,"cool":0},"z6t9uMYilKAOtXHdB4BSCw":{"text":"Like a little baby Vegas in the heart of NOLA, it's nice to take a break from Bourbon Stre","useful":2,"cool":2},"sxq1sc3I_bSDF3W8oZKR3g":{"text":"ZERO stars. Did NOTHING when my friend went to them for help concerning someone who sexual","useful":1,"cool":0},"kes5fJYBg0b66LFzYakq9A":{"text":"Make sure you get a members card especially if you're gambling otherwise you're scheming y","useful":1,"cool":0},"8KXCbY_b66RuqeRCtc0u4g":{"text":"This was the nicest casino that I have ever been to, but that is definitely not saying ver","useful":2,"cool":0},"sbQjdAsKz3Nb-ejxe0O0Sg":{"text":"Uh, I tried this casino a couple of times while in town and it's as tight as my high schoo","useful":0,"cool":0},"aEl-9-b1vb7_QSnOlGl8DQ":{"text":"I came here after dinner for drinks and gambling. We went to a blackjack table and had the","useful":0,"cool":0},"jvn_1cEqFx0YtZaEI7ayIw":{"text":"First of all, my wife and I come here several times a year to EAT - DRINK - GAMBLE.  We we","useful":0,"cool":0},"tb3qbrNeH9TtE2HXYBb6jA":{"text":"Loved the corner suite. Very friendly and helpful staff.","useful":0,"cool":0},"-bDkxI3HJkYV2ix4o3y4Lw":{"text":"I noticed Harrah's while commuting from the airport to downtown New Orleans. I decided to ","useful":2,"cool":1},"Joz4lm5HDT3K-5ZfXuMQig":{"text":"The Harrah's New Orleans is smoke-free. Yippee!!! I love that it was walking distance from","useful":2,"cool":0},"l5QCewzIc1oky9jmc-x5JA":{"text":"It's been awhile since I've been here and I can honestly say they're better than ever","useful":0,"cool":0},"0xRsuk6jOpWUI5Eq7_AZJg":{"text":"Much belated review.\n\nBeautiful and nice casino. Lost 40 bucks playing roulette here a whi","useful":2,"cool":0},"Y3LajJBNmw5HBDFtk6gF5w":{"text":"This review is for the hotel not the casino.  I wish I could give negative stars.\n\nI have ","useful":0,"cool":0},"XvPfzTCq7hljedehaUlkNw":{"text":"It would have been 5 stars but now Harrah's charges for beverages unless you're a certain ","useful":0,"cool":0},"MH01qE99BIDLIuUxYEI9Bg":{"text":"This review is for the hotel only. \n\nAs a hotel, it's average. The rooms are nice and typi","useful":1,"cool":0},"KqQu7t5PaXoRMyD0gMb9cA":{"text":"They have a nice club area in the center of the casino, \"Masquerade\" with some go-go dance","useful":2,"cool":0},"n_JeeUZQrAlQEV_MdSIO8A":{"text":"This Casino is located in the center of New Orleans right next to the river. A great place","useful":0,"cool":0},"dwgGBli90A4a76TxBpXJZQ":{"text":"The riverboat casino!!  I guess that's how they get around the laws of the bayou with the ","useful":0,"cool":0},"VZyqmrOnTMRrrJJnxv2l1g":{"text":"We stayed for two nights, Thursday to Saturday. The first night we end up parking in the e","useful":0,"cool":0},"Olcx7ibmrPoYIcaxbRTZBA":{"text":"Almost all casinos feel the exact same to me. I like them, so it's not like that's a probl","useful":1,"cool":0},"G8-bEkeWtz1NHjPExRLUZw":{"text":"Great place to go out a night on the town and be anything you want to be in this place.  D","useful":1,"cool":1},"oVOztDudpCq1MXUL8o4XIw":{"text":"The woman at the front who checks IDs as you enter the casino should look like she actuall","useful":4,"cool":0},"RGhKClE7kDcDPkRtOlADjg":{"text":"Suuper clean place. I'd set an empty cup down to juggle my bags of souvenirs and the trash","useful":0,"cool":0},"kAaT2ygwqm2YefQvYcLAkw":{"text":"Decided to pass some time while in NOLA for spring break.  Was shocked to see that we coul","useful":5,"cool":1},"epB8RLCUqw3bEbGtUz_N_Q":{"text":"Usually love this place; however, came here to see the winner of the new car and were held","useful":1,"cool":0},"8_DYa-PsG8JngCCOeOI6uA":{"text":"Blackjack steals my money and I hate it...  but I still love it... hence 3 stars.  Big cas","useful":4,"cool":4},"Yt22S8tR0aDKRJNiA5NERA":{"text":"I didnt stay here during my quick weekend trip but this Harrah's was waaay nicer than the ","useful":0,"cool":0},"HO4Ytvl0EYP33L9DszXcmg":{"text":"Decent casino near the end of the Quarter. Lots of slots and the free booze is always a pl","useful":0,"cool":2},"8_CNR7UBkulx7CIi2G7d_A":{"text":"Went new years eve.   Terribly managed entrance.  Everyone was carded whether they were lo","useful":1,"cool":0},"CXAPBRDPm5V9yy-2erPsNg":{"text":"The place to gamble as you stumble out of Bourbon street and head back to the Hilton. Huge","useful":6,"cool":3},"auInpuaAO15Q1S5BqV3Pag":{"text":"Yuck! Stay here is you are a cheesy gambler who wants a small room and bad service. It's n","useful":2,"cool":0},"FnEapS5RUrUgswP_bIMRmw":{"text":"Have to like a casino that you leave with more money than you come in with. Hard to get a ","useful":2,"cool":6},"VphCadVtP76PAuQYEu1S6w":{"text":"Fun place to lose some money while you're in New Orleans.  Play some games get free Miller","useful":0,"cool":0},"EqrfwjRj3QmtIpe7SsT0Gw":{"text":"I'm kind of late on doing this review but I went down there last weekend I had a blast peo","useful":0,"cool":0},"uCsUj0M32XDIs6ezPVpCjg":{"text":"Casinos are ugly to keep you looking at the tables or machines and not at your watch.  Har","useful":0,"cool":0},"XQ9kDTsTsaIUG1I74nIDiw":{"text":"Two stars because the room was ok (clean) bed was hard so are the pillows, got a neck and ","useful":0,"cool":0},"sOPXyR4UxdNbnGer410yFQ":{"text":"It's the only casino worth going to. They have it all. Buffet, a night club, poker tables,","useful":1,"cool":0},"KYozCwddvFSu6R-JeUAPuw":{"text":"Nice hotel but I feel ripped off when they charge you extra for basic internet which at be","useful":0,"cool":0},"1FK9RpHnb6jzg1BUHqdvFg":{"text":"This hotel gone downhill.  The room was not clean. There was a half eaten sandwich and a c","useful":0,"cool":0},"EWVCzJ9caGc9ZDERsfuwQA":{"text":"It's a nice hotel! It's kind of a walk from the quarter, but it's very close to the water,","useful":1,"cool":0},"hEnkqrtKt7llqUyyxAGg3g":{"text":"The Harrah's New Orleans Hotel experience was top notch. The service from beginning to end","useful":1,"cool":0},"8psPjOphrPKODutXnDT-VQ":{"text":"Terrible altogether. No help with lazy workers. No restaurants even open. No point in even","useful":1,"cool":0},"5LIP9oaX4VGHDqmFPYCSfg":{"text":"Recently visited New Orleans and decided to go into Harrah's for some fun & gambling. \n\nTh","useful":2,"cool":1},"kHI3ejQ2MMJLZHiMI4Qisg":{"text":"Theres a club inside this casino and its kind of a weird set up, and the music can get rea","useful":1,"cool":0},"ERfaSJ6zqRKXs5qWh-J5og":{"text":"I've gotta say, I love casinos. \n\nWhy is that you ask? \n\nWell it's pretty simple really. C","useful":1,"cool":0},"gnkxLU8pmQha65MhH5-yQA":{"text":"Shout out to Jacorias and Christina D for their assistance in signing me up for the player","useful":1,"cool":0},"cxNy-7tdhCWgYkvcQ_rOAA":{"text":"My family and I went to Harrah's on for Christmas weekend (don't judge)! There were plenty","useful":0,"cool":0},"dqdh5j0DNvjbIYJsBedUBg":{"text":"First off, the good about this partiular place-- it is huge, it is clean and there are a l","useful":3,"cool":0},"g03WRUIOaUgf7m4sHS9ytA":{"text":"I stopped in here on New Years, and thought it was pretty good.  The best part is definite","useful":0,"cool":0},"Rdd5bxJ3MWutp4RBT4NHHQ":{"text":"Why do I have to inhale stink ass smoke. I'm spending money just as they do also. In Atlan","useful":1,"cool":0},"yxSaQO0n-mSbJ5QMiQMyKA":{"text":"Of course I'm gonna write a good review because I actually won money when I went lol. Turn","useful":4,"cool":4},"NUo77TgV3Qwy0oBJ7daldw":{"text":"I spent one night at Harrah's and would rate it five star.   Large upscale room, extremely","useful":0,"cool":0},"QbHKm63kp5tIrBglSZtxow":{"text":"Nice casino and loved the location as we could walk to both Bourbon St/French Quarter area","useful":3,"cool":0},"esJ6lG5WQLPgI5KKK8ktHA":{"text":"Very nice, it's smack dead in the middle of downtown and only a few blocks from Bourbon St","useful":1,"cool":0},"-37nR0D8cTIy_TUr7qgQRg":{"text":"It's a small casino and a step up from playing video poker in the back of a dive bar.\n\nTab","useful":2,"cool":1},"GJPNifT6tmxOWwk0St1yyg":{"text":"Just stepped in here for a minute on a Friday night. Everything looked nice and clean. I w","useful":3,"cool":1},"PNPZ9BQfEsdX2hZVDHac2g":{"text":"The Harrah's hotel was neat and clean people were friendly. We first pulled in and the Val","useful":0,"cool":0},"Pfp3sz2FbQ6HRGsaivEYuQ":{"text":"Ate at the buffet--a wide selection of food.  The casino was pretty smokey.  Quite busy fo","useful":1,"cool":0},"uZnwJDJ1511UAEf2cK6EdQ":{"text":"Big, beautiful casino definitely worth the visit.  They have an amazing bar right as you w","useful":1,"cool":0},"e9v8NMm4aWWyD0JslxAf2A":{"text":"Nothing much negitive to say about harrahs they do a great job, there is some good food in","useful":0,"cool":0},"tyLb4sn-qHyTRZia1bLTjA":{"text":"Con: Their slot machines are extremely tight. There was only 1 game that actually paid out","useful":3,"cool":0},"IDAutOZBzNh_X-24Zxlalg":{"text":"Coming from Philly (and having been to Vegas and Atlantic City, along with mini-casinos ar","useful":1,"cool":1},"jDewDemsYvTWEFv3kSQRXA":{"text":"Christmas morning in New Orleans.  Yeah, life sucks... We got out of bed late, starving, a","useful":2,"cool":3},"UCO9ixSLEI0F8JrLZ8BsoA":{"text":"Update 3/9/15. Thanks Harrahs for acknowledging my brief review. You are the real deal tha","useful":1,"cool":1},"kOzbne5fmHecD-fAmO9sAw":{"text":"Great casino with so much to do both in and around. Love that the casino itself wasn't stu","useful":0,"cool":0},"rcgKf-6-Yq-mu4YbLJqIbg":{"text":"Casino buffet with a Cajun flair. Had all your basic casino brunch buffet fare, plus all t","useful":2,"cool":1},"BK0QG0BgTFakppS_zzAaUA":{"text":"Great news! The Harrah's poker room has officially gone smoke free! So for those of you th","useful":1,"cool":1},"1E_i1w6CslLYEStydkyftw":{"text":"Beautiful property. \nBeautiful rooms.\nSUGGESTION TO MANAGEMENT-a nice touch would be to ha","useful":3,"cool":1},"mvxinF-YoxCNiCtbmdWPmg":{"text":"1st of all I love Caesars properties ... this location has been the Worst of them all!  I ","useful":2,"cool":0},"_8ehSl9gc65vDqauVVqeZQ":{"text":"I have a love hate relationship with this place. \nIts convenient if your staying in the fr","useful":0,"cool":0},"jLmCLBSldNfZAzhP1K--lw":{"text":"My iPhone was stolen while I was playing slots, security was useless and refused to do any","useful":0,"cool":0},"mGsUZL0ACW9hPeYnpX8ebw":{"text":"Meh. As far as casino's go.  But its BIG though, really big.  I wish we could smoke cigars","useful":0,"cool":0},"7XZ9nJkPHNv3Z4kE_VtKAw":{"text":"Updated review: We came here about 2 years ago and hated this place! The people were rude,","useful":1,"cool":0},"sack6NMot5vDKaOZgGOqFA":{"text":"Staffs are friendly and accommodating. Nice view of Mississippi River from our room. Spaci","useful":0,"cool":0},"ohwA1Gxz0GwxbNW8khd27g":{"text":"Stopped by Harrah's twice on this visit to NOLA. First time we were looking for good and f","useful":0,"cool":0},"s0FN9vwIK-_rnD_JmU5CNA":{"text":"Games and slots are ok and cocktail service is fine  but I am disappointed in the other st","useful":0,"cool":0},"P5rO_OBvEu0hZzQ5T3kJrg":{"text":"I enjoy gambling I mainly played Blackjack andRoulette.  Watched some poker and craps.  My","useful":0,"cool":0},"0nfExEai-fonp8VLqkZHZg":{"text":"Buffet:  Good luck!  Staff here are stupider than Detroit's MGM.  Food not cooked right ei","useful":1,"cool":0},"QxnnkvcmrR-4bJIQexA04A":{"text":"Perfect location to have accessibility to everything in downtown NOLA! Friendly staff, gre","useful":0,"cool":0},"yGvn7Uk5qTuH_RpItQ8ulQ":{"text":"My first casino experience, so you shouldn't take this review too seriously, but Harrah's ","useful":0,"cool":0},"MKa-dyraevbb64mf8Ez3aw":{"text":"I want to point out, I am a huge Vegas snob. I went to this Harrah's and was very disappoi","useful":2,"cool":1},"PXHUVe-TqHhezyraEWk1Fg":{"text":"Found a bed bug in our room my boyfriend was bitten several times. They offered a $40 cred","useful":1,"cool":0},"WKUPk8t1iOKzEGPX4vDA7A":{"text":"This is my favorite casino.  They have a good selection of slots and VP to play.  They hav","useful":1,"cool":0},"ZMXKZWdD62yPFBe7wMI9NQ":{"text":"I don't come here often, because I lived in Vegas for years and this is a far cry from the","useful":0,"cool":0},"sHmaElb1fwbecxBB-wWCIw":{"text":"Not much if a casino and I miss the old bar with the ice bar top. Nice to have near Bourbo","useful":0,"cool":0},"qFW28u0ee0_4j-30qpT1cg":{"text":"The table min for craps is $10 or more. Not too bad, but I'm a big fan of lower mins. So m","useful":0,"cool":0},"QCPq6j7AaHXbVR3bc-unTg":{"text":"Yelp, why would you ask if this is \"Good for Kids\"?!\n\nAnyways.\n\nThis is the only casino in","useful":0,"cool":0},"I1f4WMvq8P--2Y7pBsiJRQ":{"text":"I've only been here once, and I actually won money, so I have kind of a biased opinion.  N","useful":0,"cool":0},"V0VqAJxY65YfHE8lOUBaXA":{"text":"Friends of mine had a hotel room where we all met up before going to a concert downtown. C","useful":1,"cool":0},"P9Jtb4EkBhRMJfqxaNhd8A":{"text":"Harrah's nickel poker machines are fun for awhile, but I'm not a big gambler and I'm not t","useful":1,"cool":0},"u0n_MPDdFraFlD621rgJZA":{"text":"*Mobile Review*\n\nCame here because I've never been to a casino\n\nDecor: 3.5/5\n-Endless with","useful":2,"cool":1},"LD9FLxYdWu2Rx5MJneJvHQ":{"text":"My my My! The casino covers 6 blocks!  The hotel was up to date and clean. There was a \"in","useful":2,"cool":1},"FwG_ogZ4QrTIrAT2hdozqw":{"text":"Nice clean rooms - CHECK\nCasino next door - CHECK\nWalk-able distance to Bourbon Street and","useful":2,"cool":1},"O3tKZ2t0VRhlExIE_ScGJw":{"text":"Nice casino in NOLA to pass time, seems to be my Nieces spot when she is bored.... I have ","useful":4,"cool":1},"PmFRwkGU-tawjYZlVO_9lA":{"text":"One of worst hotels that we've ever stay. Huge red stains in our room on the carpet. No in","useful":1,"cool":0},"1obViW_8dOAH2SQLFo1khg":{"text":"I also stayed at the hotel and had a great experience. The staff is very nice and accommod","useful":2,"cool":1},"TH4OxUbPvpHLwUBNxv_u-Q":{"text":"FREE DRINKS.\nVALIDATED PARKING.\nGREAT STAFF. \n****SEX AND THE CITY SLOT MACHINES***\nCLOSE ","useful":3,"cool":4},"2sFiP-7JKU-Wa_ljnylT6A":{"text":"Just checked in and they placed me in a room that is filthy and just disgusting. So dirty ","useful":0,"cool":0},"OjUeHbAqRARJSeZDfSDlzg":{"text":"Most friendly staff I've ever encountered!! My wife and I decided to take a couple days an","useful":0,"cool":0},"7fFBLnDkBI87vo19xXfaKQ":{"text":"Had the dinner buffet for $35. Great selection. Huge selection. Many items good, many item","useful":1,"cool":1},"0w5UtDMwI3f4zBdDDuD2XA":{"text":"I really, really like that it's smoke free. It's one of the huge drawbacks to casinos in g","useful":1,"cool":1},"k1tVcWfSr_ajjrIUeL69wQ":{"text":"These are the 3 toilets I had to choose from at 10:30 in the morning on a Sunday outside t","useful":1,"cool":0},"m1xKzhkrkFXs-8tmWMtVtA":{"text":"I love the idea that it's a smoke-free Casino those are really hard to find. This is the o","useful":43,"cool":35},"hfEMbxQ4ykpR9U6WaypqjA":{"text":"Alright, so this place blows for sure. Machine ate $20 and took over 45 minutes to prove i","useful":1,"cool":0},"ovlI8iGj2kuOZWLFqiQy4g":{"text":"I am not much of a gambler but it was a really hot day and we needed some relief so we dec","useful":2,"cool":1},"-07A6kzNAumUY9TVLOpJ3w":{"text":"Found voodoo lounge daiquiris!! This is a huge casino with so many things to do. The buffe","useful":2,"cool":0},"geMet9ICt5G_5pVJCEYUyQ":{"text":"Normal Casino.   Except..no service.   Seven Star and unable to find a drink at the slots.","useful":0,"cool":0},"LWkbllIq06SQCIfAKQcw9g":{"text":"i like this place. right on canal street, right on the cable car line. anywhere you need t","useful":1,"cool":0},"jjEKXMkOYmsCKMY8ts-kcg":{"text":"Very crowded and line to get in was ridiculous. None of the machines were hitting. Minimum","useful":1,"cool":0},"rTypuSK-PbYK0Qdvc9Iw3Q":{"text":"Take your money somewhere else. https://www.yahoo.com/news/black-army-officer-says-she-234","useful":2,"cool":0},"nc5c4sbtUD72I7-k3seTIw":{"text":"We travel to New Orleans a lot to visit family. And while we're there, we visit Harrah's C","useful":8,"cool":4},"x3bNP03KCeKUvy6_hSpLlg":{"text":"First, let me say that I loathe casinos, so skip this review if that is your thing. The ca","useful":3,"cool":1},"ysIzIz0g-fX88TJQoaiOSQ":{"text":"Didn't do any gambling, just was in the area and did a walk through to compare to other ca","useful":1,"cool":1},"m-ykcVG3_7ayOA1Zy1Zyug":{"text":"Just so you know the casino and the hotel are not in the same place as it suggests on the ","useful":2,"cool":0},"QrB0D2VllrFi5ikwSP6bYQ":{"text":"I was excited to come stay at Harrahs thinking it would be a great hotel but it didn't del","useful":2,"cool":0},"9_Cv0ORqMu-8jgsShJaipQ":{"text":"Harrah's is one of the BEST casinos I've ever been to!!! Super fun and compact. The hotel ","useful":5,"cool":5},"ftZo1VddrL2r020nYg1BqA":{"text":"News reports show racist management, denying a black, female, lt. colonel from entering, c","useful":1,"cool":0},"28KR3gpfel8-vE1FhLlHcQ":{"text":"This casino is actually quite small for casinos I frequent in the Northeast. This casino o","useful":2,"cool":0},"hMeCY-TeVO6ZJ_AlOuPigw":{"text":"Gambling time!  Winning!!\n\nWell it wasnt for me on this trip but its all goooooood!  I com","useful":2,"cool":2},"zxmJItxQpkl3OKHMemcJwQ":{"text":"Nice casino in walking distance to the French Quarter. Decent buffet serving Southern favo","useful":2,"cool":1},"x96iDy71CwB5AqNLQp2Upw":{"text":"It's a casino. Idk how to actually review it, since I don't gamble. Yet everytime I'm in N","useful":2,"cool":1},"DNAbfsaeIi23Fgv8B-YaiA":{"text":"Spent a few hours at Harrahs, how many?  Well, THAT REALLY ISN'T ANY OF YOUR BUSINESS, NOW","useful":2,"cool":2}}