{"WSYWPZBsdjdar7fhMts8Bg":{"text":"Best wax I've ever had. Was kept distracted and entertained the whole time, which was actu","useful":1,"cool":0},"AC1VzMY2PKK-DQcmVnez-Q":{"text":"I found Luxury Studio on Yelp and I am so glad that I booked an appointment. Angelique is ","useful":4,"cool":0},"a48xeKh4dfUB1s8bc_ZZzw":{"text":"OMG !!! I'm so excited to find a professional eyelash extension salon in New Orleans . The","useful":0,"cool":0},"gUnPBegsa514ghtZJZtp1A":{"text":"Angelique is AMAZING! I came in to get lash extensions today and her work was amazing and ","useful":2,"cool":0},"Svpx2DjOx8VcuqQhRG_Rvw":{"text":"So what can I say but Angelique is amazing. I'm a Breast cancer survivor and after Chemo s","useful":5,"cool":1},"xiEfIs1xHC0vHS6nunVQFQ":{"text":"Terrible place.  My lashes were put on incorrectly and caused a horrible reaction.  I had ","useful":0,"cool":0},"ZvGtYTVIIH-QEfCZtDNQaQ":{"text":"It has only taken me a year to find a Lash Studio I like!! I'm hard to impress, so if I am","useful":1,"cool":1},"fndgHeT6nxfcc0eNNgG6mw":{"text":"The first time I went for microblading here I was extremely nervous, set up a time and tal","useful":1,"cool":0},"AfsZrgiRHIswZL_dZ2QUoQ":{"text":"I came in with a disastrous lash job that I had had done at a salon at home (at substantia","useful":0,"cool":0},"uZJRma4yfMFMfQkXPXwdcw":{"text":"I have had lash extensions before - but never as well applied, and affordably priced. Ange","useful":2,"cool":0},"WxDO5N0_k3r9k6RT1mohkA":{"text":"If I can give a zero I would. I have an appointment today with Taylor at 4:00 pm, I arrive","useful":1,"cool":0},"cV4-TxG_R_jnzjJD6qleeA":{"text":"Post holiday drearies set in so I decided to give myself some me time and splurge ! LASH E","useful":0,"cool":0},"Z0T43Pa3tuG3DvWwqZNncA":{"text":"Failed to let me know that they cancelled my appointment so I wasted $20 on an uber for no","useful":4,"cool":0},"xuEtY3mfh8Y7XNGRPxCo-g":{"text":"The worst experience ever - I waited 50 minutes for Angelic to arrive to my appointment - ","useful":4,"cool":1},"iPxvfm32pC5mZpTYmVMYNw":{"text":"AWESOME, 5 Stars! A girlfriend of mine who's a regular recommended this studio to me. \n\nTh","useful":6,"cool":1},"8CqZmTmjmzczXi29FF2jsw":{"text":"I have been a LOYAL customer for over a year now. I should have known this would happen af","useful":0,"cool":0},"GYolq_d_Q027oJo4f1l_4w":{"text":"You really can't beat the quality for the price here. Lash extensions are usually crazy ex","useful":0,"cool":0},"w-ukUMAXGitbYD19NnwMmw":{"text":"Oh my gosh...  FINALLY a locally owned place where I can get SILK lashes!!!!   Angelique i","useful":1,"cool":1},"5cm-vIl1WM4YRtTwCx_y4w":{"text":"Also, did i mention no deposit is required, in which i love. I personally tend to not supp","useful":0,"cool":0},"3HBIpCQ3XpiEBT7DHRmZiw":{"text":"LOVE my lashes!\n\nThis was my first time getting extensions so I didn't know what to ask fo","useful":1,"cool":0},"_bP931vWiQucNvBNQF86cQ":{"text":"My lashes look phenomenal everytime I come here to get them done. The staff is very friend","useful":0,"cool":0},"pcy-r9pzGOKWCbUPU3fgUQ":{"text":"I was in New Orleans for a Bachelorette party and prior to coming, had my lashes done loca","useful":0,"cool":0},"IAF9e5K3qsVVBPGes3KzTQ":{"text":"Angelique it's just perfection all I can say is that I'm very happy with the results of my","useful":0,"cool":0},"oSgtzIc-sVHQwH869bUFxw":{"text":"My eyelashes were rushed. Beautiful for the first 3 ish days, but after that they were a n","useful":4,"cool":1},"PThQ9irJ-osSFF66LC3e_g":{"text":"Angelique is very professional and sweet. She is the owner of the spa. While there, I was ","useful":3,"cool":1},"kKG_ZGCblXPROY7RogAnSw":{"text":"TERRIBLE SERVICE!!! I waited for 45 minutes for an appointment that I made earlier in the ","useful":0,"cool":0},"Rg7yqAi0hmd7FawLeLZsdA":{"text":"I am getting the run around . I took the class and never received my certification. I've g","useful":0,"cool":0},"SH7ryyqOBuKw7ddhAWUFEw":{"text":"Just to follow up -  have just gone in for my first fill, and I have to say, I didn't even","useful":2,"cool":1},"J6ejE06P06pfmUL2-HWMIA":{"text":"I am extremely satisfied with my new eyelash extensions! I was very concerned about wantin","useful":1,"cool":0},"kG8RNJH1sE0Nh5egGZa6lA":{"text":"Was looking for a reliable place to get my lashes done here in NOLA. I think the prices ar","useful":1,"cool":0},"Btvqz7dsI_ePCtrL2XBb4A":{"text":"Where do I start with this horrific experience. Silly me purchased a Groupon for a micro b","useful":9,"cool":1},"0iV19tqt0JF2-DFVzauKFw":{"text":"Made an appointment for 2pm on a Sunday. I received I believe 2 text messages confirming m","useful":1,"cool":0},"61CyQbe1H8XolGFxXIgeKQ":{"text":"Poor service and quality. When I opened my eyes the burned for a while. I got them done Fr","useful":3,"cool":0},"PgqHDGa8Dm_9u6p_EVhlxw":{"text":"I have been getting lashes for three years as I've moved between GA TX and now LA, so I ha","useful":1,"cool":0},"nlCqveeQtw4HSaWXUZkkiA":{"text":"Love, love, LOVE this salon! After trying out quite a few lash spots (and giving up after ","useful":0,"cool":0},"PXvxRYBxrwi7Wbj34r6CYg":{"text":"I was so pleased and happy when I went for my first appointment on July 13th hat I decided","useful":0,"cool":0},"UUUVf7nqf-U9zbztjB3Jkw":{"text":"I walked in today, in a bind needed my lashes done for a photo shoot! Not only did the own","useful":0,"cool":0},"e_x0CjgEsQDbk3xg9HiS7A":{"text":"I scheduled my appointment on a Friday for the upcoming Monday. My appointment was for 11A","useful":0,"cool":0}}