{"Siioj-cabx6rJYD126lcDw":{"text":"Ok. THE 5 dollar box is still being advertised but the have none. Lol. THE BOX IS AMAZING.","useful":0,"cool":0},"xmFuj6dbvxH3etgCa1KGFA":{"text":"Terrible and rude service. Employees spraying chemicals directly into the air instead on t","useful":2,"cool":0},"M24ZeNpSJtbSVnXjyfOxBg":{"text":"Yes the service was slow and my biscuit tasted like it was marinated in salty grease overn","useful":1,"cool":0},"LaZiLm95T7mxfGvnqWNxlQ":{"text":"Like any Popeyes, the food was fabulous. They had really great biscuits at this location s","useful":1,"cool":0},"D-liXtj_NY8WcltaQME__A":{"text":"Sign on door says they are open until midnight on Friday Saturday but they lock the doors ","useful":1,"cool":0},"E-PGlhkMnpChslz-MmgHBA":{"text":"Home of Louisiana style spicy fried chicken which they were out of. Specifically spicy thi","useful":2,"cool":1},"GaRStHRt2BYNQj2xXl9bhA":{"text":"I think this was the best Popeye's I've been to in a very long time. The chicken was so fr","useful":0,"cool":0},"aMack9Nig-qEIqco7h6ABg":{"text":"There's always something for 5 bucks, so can the hungry (who aren't vegan/vegetarian) ever","useful":1,"cool":0},"hy0H5ZMPjN-KbA52LyEE5Q":{"text":"I talked to the manager and ordered 50 pc of chicken for the next day...at noon. She said ","useful":3,"cool":1},"zMbzB4CKOl3PHSKACeeQMQ":{"text":"I heard Popeyes was better in Louisana, and since this place was next to our hotel we got ","useful":1,"cool":1},"8STwL5ZbuI8chb0Dj_KeYQ":{"text":"Who owns this restaurant? Does he/she not come a check they rude ass employees? Because th","useful":0,"cool":0},"ehhp7o2rwkCoJn_GyZDNww":{"text":"Went after LSU-Alabama game to try the\nChicken sandwich.  Long line as expected.  I ordere","useful":0,"cool":0},"5bfSnJN5BnccOZgtQadFAA":{"text":"This is nearest Popeyes to my house and living in NOLA you always need access to some Pope","useful":2,"cool":3},"P0RJvDWaYFIOkzf1BH8BFw":{"text":"Normally this is my \"neighborhood\" locations...my stop of yummy fried spicy goodness! Disa","useful":4,"cool":0},"6A_dkTgF7vHowMknZdbDqg":{"text":"the fries we cold and stale. the chicken sandwich was ok. nothing special","useful":0,"cool":0},"ZTMvAi30hvQzqx6K7BLmnQ":{"text":"Fifteen stars to this Popeyes for Mardi Gras. Yeah, they're really shitty during the rest ","useful":0,"cool":0},"Tm67uoSwA4tO5L23zoXjcg":{"text":"We came here 20 minutes before they closed. Not only was the dining room and bathroom alre","useful":1,"cool":0},"mS4JEULymujtm2zZeh6H5Q":{"text":"Totally not satisfied with my experience at this location. The cashier was not Pleasant at","useful":1,"cool":1},"_DheFmZO57WbsIcuG-Ej9w":{"text":"Food was not hot and and fresh out of the grease, you can tell the food was sitting for a ","useful":0,"cool":0},"xVFEX7_3w_K2vIF-9DbRkA":{"text":"Worst customer service of any Popeyes I have ever been to. I get in there every employee a","useful":1,"cool":0},"B37N_1VtZjeFUQyWzyc6Kg":{"text":"Worst service ever. Can't understand the woman taking your order. She is American but is t","useful":5,"cool":1},"01bKAt9Chdmgl-OLJLVtKw":{"text":"This is a Popeyes. It is not a 5 star restaurant. I come in here whenever I crave a chicke","useful":0,"cool":0},"vbGRDMSlANkGrHQtoCS0Sg":{"text":"This is probably the most disgusting Popeyes I have ever been in. The cashier was rude. I ","useful":4,"cool":1},"VXIzI0Aq74Ar7xeo9BoVjw":{"text":"Definitely the worst place to get some grub... discussing setting, nasty smell as you walk","useful":1,"cool":0},"DFYxUQwh__5QkLaMbw_odg":{"text":"This is by far the worst Popeyes I've ever had the displeasure of visiting. There was a ca","useful":5,"cool":0},"xZx8AUs_9oWqqNlcKXp15A":{"text":"Not friendly team members. Not a safe location. The parking lot had discarded food from Po","useful":0,"cool":0},"hbE0DJqD-aKKjsjgdeTZ8Q":{"text":"I went here at 07:42pm on 4/20/17 there was No mild breast. This chicken is old, just ate ","useful":4,"cool":0},"pBVUKmb3hClWl_iAckWGYQ":{"text":"Usually when I'm out of town u couldn't pay me to eat at a chain restaurant...well actuall","useful":6,"cool":2},"Xb5w7A2Eo7eunoUS9QqhGA":{"text":"Just left this location 5 minutes ago (Tuesday 6/4/19 7:50 pm). Sorry ordering a gallon of","useful":1,"cool":0},"AyeXgHtNyAVWMULIh7XpgQ":{"text":"This is a terrible location with terrible service.  I came here with my husband for a quic","useful":4,"cool":1},"LV-K6B4ZRtZBPDVfrOPUyQ":{"text":"The $4 popcorn chicken box is undefeated. Service was fast & the food was hott! If u choos","useful":0,"cool":0},"Piy0O4Mlf5-b3CRjghOqjQ":{"text":"LOVE that chicken from Popeyes! This isn't the best location but it does the job for me.","useful":0,"cool":0},"9YGikwIWTGiHQC3266KKAg":{"text":"Can I not put a star? Don't go here. Go to Popeyes but not this location. The cook came ou","useful":1,"cool":0},"kFk07wQHiWNB3HEZz1i25Q":{"text":"I love Popeye's chicken, so I stopped in here after my walking tour of the Garden District","useful":1,"cool":0},"dhVbTRkykdvqz3iJSfPVlA":{"text":"There is a Popeye's all over the United States. Seeing as though Popeye's started in Louis","useful":0,"cool":0},"lUh3dgYEU7Q06J39s_F6Vg":{"text":"I only went because of the chicken sandwich and even though it was ok at best, the service","useful":0,"cool":0},"oMjQuR8GQv5BHTgSvvu7AQ":{"text":"Dirty. Rude staff. Unpleasant experience. \nThe fried chicken smelled like it was stale. Wi","useful":4,"cool":1},"gcZhbXeeF3ew01ca98q3WQ":{"text":"Worst experience ever! I ordered through the app from this location. I was missing over ha","useful":0,"cool":0},"yBGUepK7aTLuX6Vy320IZA":{"text":"I just landed from out of town. Wanted popeyes so badly in Nola. So, there we stepped into","useful":0,"cool":0},"uZV_nD4svkpPc58VOCOhjQ":{"text":"Was aware of the comments that whatever you order will not be delivered. I ordered 4 piece","useful":0,"cool":0},"ynDIkVunZV3l2h-BKFpW1A":{"text":"Ordered online at 5:18 pm on January 13 to get something to pick up before NCAA football c","useful":0,"cool":0},"veiPun5YOeHQltzKTjv1-w":{"text":"Horrifying!\nI dined-in at this popeyes location at approx 1400 so its basically between lu","useful":1,"cool":0},"Inmw1pqbhCT_cA3tvW4IfA":{"text":"Im a visitor on work business and after a long day on the ship, they were one of the few o","useful":0,"cool":0},"Z_tp3NugKT5P_GoKoAuKZw":{"text":"Known affectionately as the \"Parade Route Popeyes\" to many. (O.K., I may have just made th","useful":2,"cool":0},"mvuyHGSAgAEq2_p5FdxhbA":{"text":"Surprisingly, the wait wasn't long. I think I waited about 10mins. \nAs for the sandwich, t","useful":2,"cool":1},"Hk8m4wROxpva18_fdlFImg":{"text":"You know what?\nI don't care what you say (or think).\n\nI. Love. Me. Some. Popeyes. \n\nFor br","useful":8,"cool":6},"SiTMvW7ZBc0uvQ0zLM2qww":{"text":"Man this is the most Ghetto place ever even for New Orleans. They had this red skin black ","useful":0,"cool":0},"RG8nJefuOhqCcBLlDnsTAg":{"text":"It was a rainy night and we decided to have fried chicken.\nWent on their app it was down f","useful":0,"cool":0},"16ubrBtmpG3QvqUWBEpFaw":{"text":"Had a family order and one of my orders were Cajun rice. The Cajun rice only had rice neve","useful":3,"cool":1},"CiOM3PB3zfV-2daDWuKMBg":{"text":"Edit: GUESS WHAT. THEY GOT THE ORDER WRONG AS WELL! Even though i entered everything metic","useful":0,"cool":0}}