{"VsVgY9EmYUdt6SZJNGTcuA":{"text":"I love their food, eat there regularly. My family loves it too! I have tried almost everyt","useful":1,"cool":0},"P4muPaP8H5ZIQ3jgvdqFxw":{"text":"Amazing food, not extravagant but literally like going to someone's home to eat! Excellent","useful":0,"cool":0},"Nu0QPj-g1OtTg260c12LyA":{"text":"Saw this place on yelp. Quick walk behind UMC or the VAMC. Friendly and among to please. T","useful":0,"cool":0},"wDLfrwvxWK0MC5TgADSuQA":{"text":"Ordered through Uber eats which said the gyro plate came with rice salad and hummus, and w","useful":0,"cool":0},"atJUcEeT5BhjH_MEe1nBfg":{"text":"One of the best shawarma places I have been to, I've been looking for some authentic shawa","useful":1,"cool":0},"UwggdOYdMNR1nZ3SR0-5_Q":{"text":"Went back to Shawarma King and I must admit a marked improvement from when they first open","useful":2,"cool":2},"KTylO_RrTBDdMSYpUZsJ8A":{"text":"A colleague and I went to try Shawarma King on a whim for lunch after he got a Groupon. We","useful":0,"cool":0},"W9wWI6Z0llPZw2Yn1GVCdQ":{"text":"Great place\nGreat people\n\nAnd super amazing great chicken shawarma with no tomato.  Yum!!!","useful":0,"cool":0},"5D3uCofxd9oUg0Zv0s_u2A":{"text":"Came here with a friend on a Thursday night before heading to the hospital since it was cl","useful":2,"cool":2},"AZ53tf-ZpHKBE9rEZNc8ZQ":{"text":"Tried Shawarma King for the first time since they opened. It was very new and there were s","useful":4,"cool":2},"RONbfwQf6IibK3LIndVaWA":{"text":"Place has great food and amazing service, there's a guy there that's name is Ahmad he is t","useful":1,"cool":0},"r7K-l3zmcj_wGCoS787B1w":{"text":"Why does it always take so long to make the shawarma plates? Kind of confusing to be hones","useful":1,"cool":0},"Bn7QMrfQoerMyG8L9nFISQ":{"text":"2 Star experience but going with 3 in hopes that it gets better next time.\n\nFood was extre","useful":2,"cool":1},"74fLU55riN4HHEm7tnv4xA":{"text":"After a long day of parades we stopped into Shawarma for a quick bite to eat and rest a bi","useful":4,"cool":3},"GpcSvnfqs2ObduCkKSSgvA":{"text":"It was fine to eat  I wouldn't say it was the best middle eastern fast food ...... The com","useful":0,"cool":0},"cDWI7XkLy3NJ2gOl5Rkhdw":{"text":"I'm not used to this type of cuisine, so my review is probably not the most knowledgeable ","useful":1,"cool":1},"xZ6awRmdwENEYe60SRxq8g":{"text":"This place is not too bad. It's a casual place near work for me, so I'll go with my collea","useful":2,"cool":0}}