{"7JAFpIht58ZyfeeDFhc6iA":{"text":"Just tried this place last night for the first time. In one word... AMAZING! Cool family f","useful":1,"cool":0},"x2MU0KeaubjSlm5RkMwHkg":{"text":"Love this place.Came in for the first time on Saturday afternoon for lunch with my hubby.W","useful":0,"cool":0},"el1PuRpm5Mr6-iSLhtkzOg":{"text":"Really good vibes and a cute atmosphere. Employees are so helpful and nice. Food was amazi","useful":0,"cool":0},"RI5eQxxV4CO4-Vfb3W7IxQ":{"text":"We are visiting from California.  My 93 year old grandma thinks I'm amazing because I can ","useful":0,"cool":0},"26dwQkSPfRuSnMaGDjhZUQ":{"text":"I am sorry! I wish I could have taken pictures but I was just too busy eating my fantastic","useful":3,"cool":2},"FbpThH5DndYOidmVAmP2Fw":{"text":"We stopped here for our first meal in New Orleans, and we were amazed at how delicious the","useful":1,"cool":0},"o3V-bsgMFOjrfOwHGIEvsw":{"text":"The perfect place to satisfy that burger craving. Great atmosphere, delicious burger! Love","useful":2,"cool":1},"zZaHsjKlO0XM1Ct96Meo_w":{"text":"Came here for a Sunday lunch. They were busy, but not overly crowded. My fiancé and I got ","useful":1,"cool":0},"7Q28G9xd_jVuaNQ62oqf3g":{"text":"I just want to say thank you! Our school had an event on a Wednesday night and a bunch of ","useful":1,"cool":0},"btlHBvKI9iZpQdjCTLR00g":{"text":"Great Food and Great Folks! We've always had a very pleasant experience. Good burgers and ","useful":0,"cool":0},"d-sqqYiA4NtVlstGgsOdvA":{"text":"They have a great lunch special but oddly enough, don't have baked beans or macaroni and c","useful":0,"cool":0},"lUaAEdHChgLtp_pYxnQEBg":{"text":"I stopped in based on reviews and I must say they were very good... Seasalt on the fries r","useful":0,"cool":0},"quykk-c_4U8ojeH9WYVY2Q":{"text":"I've been eyeing this place up for a while now. Being in the neighborhood the other day, m","useful":0,"cool":0},"eFf2r9CbtNSmoDNCCkPmBQ":{"text":"I work nearby and this is one of the places we make sure to visit on a regular basis. The ","useful":1,"cool":0},"3TlKrsBzEGEsCLfKucZZWw":{"text":"It was really fresh but honestly just tasted like eating a straight up salt block. Like I ","useful":0,"cool":0},"0gJH6jcx4tP4XWidgFU4eA":{"text":"Perfect place for great burgers, chicken sandwiches, salads, and drinks! Very cool atmosph","useful":0,"cool":0},"--Ne3aKpiOtKb694M-IHig":{"text":"Cool concept, kid friendly neighborhood restaurant where you can have an adult beverage wh","useful":2,"cool":1},"MtvE_Y77BO0MWLgHZdzoXw":{"text":"Great neighborhood burger place! The sides are all hand cut, burgers are delicious, and wi","useful":1,"cool":1},"Xr5w6vFwR1DOUA8rnmFNWQ":{"text":"Great hangover food. I created my own burger and couldn't have been happier with the resul","useful":1,"cool":0},"UiCABTwXSwxOin9Bnpog9Q":{"text":"This is a great new family dining option in lakeview. They are still in their soft opening","useful":1,"cool":2},"SyblEFUx9y1tN0ULHwSc2g":{"text":"*Note: This review is about the pet friendly policy and pet accommodations.\n\nThey fully em","useful":0,"cool":0},"vhpDtjXxmxR3t7xI-T1wxw":{"text":"I ordered from The Backyard via UberEATS a while back and was very impressed with the flav","useful":0,"cool":0},"0lpPfY8nhjJE3zMLgpDXwg":{"text":"I really want this place to succeed. Everyone here was super nice, and concerned about my ","useful":4,"cool":0},"XhQKNeOUMj9r9r-SiEILyg":{"text":"Rudest wait staff I have come across in the city of late. Fist time going so a group of us","useful":2,"cool":0},"nJRAW69kAJocWlYfQ6oNWg":{"text":"This is a pretty cool looking venue with a nice patio area (AKA \"Backyard\" area).  After s","useful":3,"cool":1},"h9JISHcTSRNSYjO9c9O9qg":{"text":"Went to The Backyard on a fluke today...forgot my lunch, then went on Yelp to see what is ","useful":0,"cool":0},"UQ4LGKaj6ViSPxmLluJ3wQ":{"text":"After waiting at the DMV for hours... we drove around looking for a place to eat and have ","useful":0,"cool":0},"gnd4q9rPX5Gbg0VlWOSWcA":{"text":"Wanted to love this place as its so close to home base ... But \nIt's too expensive for ave","useful":0,"cool":0},"vfOofqP0I7uuEGOskFLNbQ":{"text":"LOVED this place! Took my daughter for dinner and she had a blast playing with other child","useful":1,"cool":1},"Kq8nqQYFZOMWhDWVKs2pBQ":{"text":"Went on Sunday with the kids.  Great burgers, very kid friendly (outdoor jungle gym, picni","useful":0,"cool":0},"fVGQqG2V6uF1nBCu7KHA-w":{"text":"Not crazy about the burgers they're using.. and they stopped using the eggs to put on thei","useful":0,"cool":0},"_FFfI5IgsHrGis0Ly8riMQ":{"text":"First time here - limited menu for now but their burgers look great.  I ordered a special ","useful":2,"cool":1},"IUCzek2G77lat8aPiNR6ag":{"text":"5 stars for the concept and the owner. Very family oriented in the literal backyard, an ur","useful":1,"cool":0},"Mpw_fwi8qzy3_ntz-OkGZQ":{"text":"Great burger and a good menu selection for a lunch spot!  Location location location it's ","useful":1,"cool":1},"kXRcuOhaflyBFk59TAITNg":{"text":"Stopped in for a late lunch. Atmosphere seems good but it was late afternoon so not many p","useful":0,"cool":0},"PCuIeQGvZhgZpfnJxLDe2A":{"text":"Friendly service with a nice selection of local beers. Currently, on tap was beer from Cov","useful":1,"cool":0},"3uqDxVY8rQTOXaRWXB9h5Q":{"text":"Came here with my brother and one of my friends to eat and have a few drinks. The burgers ","useful":0,"cool":0},"mSYxS2Hz96HGpmJ7E3xUZw":{"text":"A great place for parents to take the kids and have some good food...Also a few good local","useful":0,"cool":0},"bCx9-_i8VqVIqRtBEBxTIA":{"text":"The food is amazing. Pimento cheese dip and smoked tuna dip, I definitely recommend.\n\nDani","useful":0,"cool":0},"7iE1pz-_oZKkVe63dV6-mw":{"text":"Went here with the family yesterday.  I ordered a cheeseburger and sweet potato fries.  Th","useful":5,"cool":1},"QNvd_KVnCb_84H5TeBsuRQ":{"text":"When the best I can say about this business is that I ate here and didn't get sick, that's","useful":14,"cool":3},"QywL1VaACqHVQaJWawJJ0w":{"text":"The concept is great and totally unique to New Orleans.  My son is out of the toddler phas","useful":1,"cool":0},"KYyFdo0fiRgyDTvFiUyC3Q":{"text":"The overall cost for my tiny sandwich, a side of cole slaw and a soda, was $15.97. What a ","useful":0,"cool":0},"QwRSEwBKeVu5I7Ex1VX0Zw":{"text":"In-house smoker produced nice pulled pork, brisket and smoked tuna dip, the kid's hotdog w","useful":1,"cool":0},"4bIYJ1u2Y1Dox8uMip3o3g":{"text":"We stopped in on a whim. I think the playground in the backyard will be great as it gets c","useful":0,"cool":0},"Rd1blRT7NZ0XvRXNSnxg7g":{"text":"Very good, tasty burger. Beers are too expensive though, $6 for a pint of Parish Envie.","useful":0,"cool":0},"BUmyDCHEmWVUfZGa0MTc2A":{"text":"Burned 'charbroiled' burgers with soggy buns.  Third visit to this lake view venue will be","useful":0,"cool":0},"yV4S0VHhsV76G3GyODfOBg":{"text":"The beef brisket is AMAZING.  Great ambience.  Perfect if you have kids.  Drinking a beer ","useful":0,"cool":0},"_tjUUdCv6uKZE1j4KqkOuA":{"text":"5 stars for their burgers, prices, and inviting atmosphere! \n\nThe ground beef is high qual","useful":0,"cool":0},"Sv1Ok6QGjVvvu6npqEhHQg":{"text":"Smoked tuna dip ($8), smoked chicken wings(4 for $12) and the boom burger($12 but no fries","useful":1,"cool":0},"_LR0dxd_h2g57nIibSn4LQ":{"text":"Pimento cheese app with homemade chips is off the charts. The Boom Burger is absolutely de","useful":0,"cool":0},"6E12mDm1EnCKVXpWV55t8w":{"text":"The food and atmosphere here are great! Great for families and friends to hang out, grab s","useful":1,"cool":1},"dD68WSxJsDBZFbTwAH_j7A":{"text":"These might be the best wings in the city. And I'm a dude who tries to eat wings wherever ","useful":1,"cool":0},"sxQLNZON05bqwJlcdmSd-A":{"text":"Unbelievably great wings (huge and flavorful)!  Also has a nice selection of local draft b","useful":0,"cool":1},"VjITUXzPiqhi7dsXhngB5w":{"text":"I read a piece about this place right when it opened, and I was intrigued about the concep","useful":4,"cool":2},"c5-_wrjDz2fuqNSyYdm6bw":{"text":"this place is a good restaurant. the burgers, dogs and fries are very good and are worth t","useful":5,"cool":1},"QzNWaddbifdG9l_AGzMQyw":{"text":"I love this place! The bartenders are awesome and the pulled pork is REALLY good! Make sur","useful":0,"cool":0},"13V0BtWotgKjGOr8i_sCNQ":{"text":"Its like you're in your backyard but more expensive. \n\nGreat char on the hotdog.  Relish n","useful":3,"cool":0},"FwVGPvDTxRbHKI2MogMoxA":{"text":"I love their grilled chicken sandwich! Awesome fries too. Great spot to bring the kids to ","useful":0,"cool":0},"8y4RSnOMP2XojiA7T6bXbw":{"text":"The food is way overpriced for what it is. It's decent food,  but the prices are very infl","useful":1,"cool":0},"XUHGcvkUkjyx241GwjTsWg":{"text":"Just noticed it's been a year since I posted my first review here - Time to update - many ","useful":2,"cool":0},"DEDXs9OfNUaMHclEC2iIBw":{"text":"Went looking for something new to try out and we found this place. We review tons of place","useful":0,"cool":0},"dWaTSFxtNznI1yrRBZUjPA":{"text":"I stopped here for an impromptu lunch with someone I was meeting with in the area. The spa","useful":2,"cool":1},"Amj1-u6DvA2MV4paea-wng":{"text":"I checked in between lunch and dinner on a week day, and found the place nice and quiet, w","useful":0,"cool":0},"1ksCTwNdO2PWqXB0cSVPcQ":{"text":"One of the best burger joints in NOLA!! Great burgers and a nice selection of local beers ","useful":0,"cool":0},"0yCfIFqHYryIgNzMTmxADw":{"text":"I cannot throw enough high fives...this place and the folks who run things are the best! D","useful":3,"cool":1},"Z7cVe9xUGj8mEtc_jVmMHA":{"text":"It was awesome for my son!! It was his birthday and so I wanted to go somewhere i have nev","useful":2,"cool":0},"FJAKV575Vvi7N-aqkwwOcg":{"text":"Went in for lunch and we had smoked pimiento dip with bacon for appetizer, the Zeus burger","useful":0,"cool":0},"Fy2G0kmN9XC3vfxYfBmvRA":{"text":"The Backyard has a great casual ambiance, like being at home but not having to do the dish","useful":0,"cool":0},"gZwRU5gBaD_ikN81n4iGCA":{"text":"This place is a gem. I went with a group of girls after the Harrison Ave. Stroll. The food","useful":1,"cool":1},"2tmBbc7sEzg6B4Bs8pdYYA":{"text":"Pretty disapointing. Expensive for what you get. The burned my daughters grilled cheese an","useful":0,"cool":0},"R4hc0T0U_lunJpoO4DJUEw":{"text":"The food was great, the service was prompt and friendly. A little pricey but the food was ","useful":0,"cool":0},"qRQJFVT-9pR-Po9e7h570g":{"text":"Very friendly staff, quick service and very large servings. Great charbroiled burger with ","useful":1,"cool":1},"dUsxRGxZleQ067cgULYUJA":{"text":"Can not compliment the staff enough. Very mic and accommodating.  Plus the beer selection ","useful":3,"cool":0},"3FwMP1aKZzOsAOMjkE8GWw":{"text":"We love this place! The food is delicious, the atmosphere is great, and the playground is ","useful":0,"cool":0},"e9P_DPzrRZaUtSoBetkeFA":{"text":"Delicious food, great service, and the staff were very helpful. I had the sloppy joe and t","useful":0,"cool":0},"Ku8MNLVBlmbG0xUPDqsLIg":{"text":"Love this place! I got the burger with fries. I added cheese and grilled onions. It was de","useful":1,"cool":0},"9ZbuzfWDNIAzsKjFA_2mOg":{"text":"I finally got to try The Backyard today for lunch and was very impressed. The food was gre","useful":1,"cool":1},"Xy4716u_iFLdu2XU8fL24A":{"text":"So now I know where everyone is hiding!!! This place has some really awesome specials and ","useful":0,"cool":0},"L3v7nSVKU_gL-P6izeHUtQ":{"text":"Great food and very kid friendly!!! The chicken sandwich was awesome and the homemade chip","useful":0,"cool":0},"gr1GbuNsSMlLrvLSfaMPAw":{"text":"I just experienced take out, so I cannot comment on the atmosphere, but will say that I wi","useful":1,"cool":0},"68Z8AQT5Rei3kG4L1rxOeg":{"text":"I should have trusted my instincts.\n\nI get it, there's something that feels \"authentic\" ab","useful":2,"cool":0},"G16IMSShOFesL0XfyTRlEw":{"text":"I come here pretty regularly for lunch and have never been disappointed. The burger is alw","useful":0,"cool":0},"SMMrJRFg8-kXzbzJRhQ7fg":{"text":"This place is KID FRIENDLY! The place was full of families. The staff was friendly, and th","useful":1,"cool":1},"JDybjU0gmNFHaGy0AEp2Rg":{"text":"The food and atmosphere are great.  A small playground for children 2-5.  Come for lunch a","useful":2,"cool":1},"8rcXclxK8BeQwzFFS2B4LQ":{"text":"Terrible I only give it two stars because prior to my last visit I had a decent hamburger.","useful":0,"cool":0},"hg9mPAXo8GwS7ALIY5idbA":{"text":"Great place to eat if you have kids. There is a playground out back for 2-5 year olds. So ","useful":0,"cool":0},"IopRHg7YA3gEsOypPSR5Fw":{"text":"Tried two other well known bbq places that had waits for a table that were too long so we ","useful":0,"cool":0},"A7HKir9n60dUFKk5T_Hf8w":{"text":"Good & interesting burger choices. Everything tasted fresh and good quality! Fries were gr","useful":0,"cool":0},"lVGQ5JpJDynzwEHtDISI7Q":{"text":"I've been waiting months for this place to open, and while they appear to still be in a so","useful":1,"cool":0},"bb5_J_ZUrOhZqJV7kinqfg":{"text":"The pimento cheese dip was quite tasty. Burgers and chicken sandwich were very filling and","useful":1,"cool":0},"GhkphMJ0GzwXOTQvsfXJFA":{"text":"On the far east end of Harrison Avenue, almost to the line between Metairie and New Orlean","useful":13,"cool":10},"r8mKCQu-TApK37_r66LF2A":{"text":"The food was good. We had the brisket sandwich. Great flavor, BBQ sauce was unique. The on","useful":0,"cool":0},"aWEbfRjpb1CVYH048LdgfQ":{"text":"Great food, delicious drinks and a relaxed atmosphere. The playground is definitely for li","useful":1,"cool":0},"ABWEDGQnyNatpZ_-rrKDQg":{"text":"This place is awesome. Food is great. The owner takes time to talk with you. Cold beer - g","useful":1,"cool":1},"jxHBxDcCy4DwPoz37yfXsw":{"text":"From the minute you walk in the door, the \"neighborhood friends\" greet you with so much ho","useful":0,"cool":0},"QOKzSAFZmN1PoAuY8dNeKA":{"text":"Great food, great customer service and a nice neighborhood spot to bring the little ones s","useful":0,"cool":0},"ZNd-_hbfi51q892mTPA97w":{"text":"Went in for lunch at 1:30, no one around but it was chilly outside so that didn't surprise","useful":0,"cool":0},"yBt4Il4zRYd0V6D8rKE9Uw":{"text":"Were always happy to see great new spots in lakeview! Backyard NOLA is a great neighborhoo","useful":6,"cool":5},"6_SrbNikkw75jsCRCsuw-w":{"text":"It's nice to have a good, quality burger joint in the neighborhood. The environment is ver","useful":0,"cool":1},"QkTP33zAGkCYOGFppfY80Q":{"text":"UPDATE: They DO have complimentary wifi! Customers just have to ask for the password! \n\nVE","useful":0,"cool":0},"oOx4JKti6oXFcokmWyzvrA":{"text":"Went there while visiting my son based on yelp reviews. I don't know what I was expecting ","useful":1,"cool":1},"5HCSxlWh41LtkceK6_M2mw":{"text":"Great food. I tried the Burgers, chicken wings, fries, tater tots! All delicious. Great ic","useful":0,"cool":0},"djMlaFy1l_GsN9XMd4goHA":{"text":"A friend and I stopped there for lunch. First time. Not good. I ordered a burger and it ha","useful":1,"cool":0},"9HWzyrOx_U-cHrGngit-GA":{"text":"I really wanted to like this place and I do have some positive things to say about the bac","useful":0,"cool":0},"4bRRCQV983Y3AZu7CC0DJg":{"text":"I had high expectations for this place, but it was just okay. The tater tots were really g","useful":0,"cool":0},"LIhv20UKpE1WRt7Vcu6XZw":{"text":"So, the Backyard is this little awesome watering hole in the most convenient spot on Harri","useful":1,"cool":0},"mdQS6Afqd7Grf-UB2MtJjA":{"text":"Great place to hang out with the family or friends.  The food is delish and I love the pla","useful":0,"cool":0},"PhZg16NQTUeDizxn4Nz-UA":{"text":"Cute little spot to have lunch/dinner with indoor and outdoor seating areas. There's even ","useful":1,"cool":1},"3AN5NT5ODKDbR6-BLkoXMQ":{"text":"How you gonna charge $9 for a subpar kids cheeseburger? I tried a bite. Overdone, thin and","useful":0,"cool":0},"C9C1sLmCIMveXMT8p1G0kw":{"text":"this place; i'm don't typically drink beer, but  what they have to offer; all the staff ar","useful":0,"cool":0},"AG1NOLhK1_ZT7l71g2Beng":{"text":"The food is amazing here, but the price tag does add up if you're getting a whole combo (b","useful":0,"cool":0},"hAjHVZYWMwjC1kEdE87J_g":{"text":"First time coming here, won't be back. The big oaf who brought us our food was rude when I","useful":0,"cool":0},"PNMwCxxCpMsm34SGnJeK8A":{"text":"The specialty burgers are deeeelicious!!!!\nI've been here twice and got different specialt","useful":0,"cool":0},"shF_deoFYpryoStTgeSfxA":{"text":"Got the pulled pork and the sloppy joe, with sweet fries! All was delicious and i love tha","useful":0,"cool":0},"RH--D-t2rFyRawN1-Agp7Q":{"text":"The brisket sandwich here is awesome!! It's super kid friendly as well and a great place t","useful":0,"cool":0},"dgulv1qtHEUKlYOm8Um5Lg":{"text":"The food was great and so was the atmosphere. The service... not so much. The guy taking o","useful":0,"cool":0},"F2gxYkAqhBUrc9DaR7zxVw":{"text":"Perfect for young kids! We had burgers and grilled cheese. Price was right and the kids ha","useful":5,"cool":1},"YQ-USnGs88HjvG8jpJau0A":{"text":"I ordered one burger and fries 40 minutes ago, on a Monday night, and still no food. They ","useful":0,"cool":0},"QI1t2sbJK-id5tJtgLMhCg":{"text":"We had the lunch specials which were the Chicken sandwich combo and the burger combo. It n","useful":0,"cool":0},"ixBEloVY53frEIjlG6O-Pw":{"text":"I've never been to a restaurant that made me feel like I was sitting outside when I actual","useful":1,"cool":1},"3ur4P91pAQqyZ80kBSRy8g":{"text":"First time coming here, won't be back. The big oaf who brought us our food was rude when I","useful":1,"cool":0},"LV4uCoLNt4CC8Y78oIhE8w":{"text":"Food was awesome. Great service. Environment was relaxing warm and inviting. Has great out","useful":0,"cool":0},"2N88hrbPmjKaSYQTFYp0Aw":{"text":"Excellent veggie burger! I ordered takeout, and was a little worried because the menu said","useful":0,"cool":0},"sHeG162et6L0KTefEfMJsg":{"text":"The burgers and sandwiches in this place are so good! I love the outdoorsy atmosphere here","useful":0,"cool":0},"m-JFk8pvSi3YZLRZsBQMvw":{"text":"Quick review: Go here fo sho. Get the boom burger and a beer on tap. Also get double fries","useful":0,"cool":0},"Kb5wXWz7UmHLLkzA3WEjMg":{"text":"Amazing food cooked to order, delicious sides and friendly staff. I keep getting the same ","useful":1,"cool":2},"mqG3ySsDARm88LzFO1zIkw":{"text":"The boyfriend and I finally stopped here for some late afternoon lunch and drinks. The pho","useful":5,"cool":0},"2dSRvpVcSnPAMaFE1P8kkg":{"text":"Not too bad, good local place with a limited menu. Most of the time the burgers and chicke","useful":0,"cool":0},"lxhOyQoJCFXCQ-uLNOZBmA":{"text":"Really good but kinda pricey! Tuna dip is SPOT on and the grilled chicken sandwich was soo","useful":0,"cool":0},"PimhhMbsUTp4DnxBOadzlQ":{"text":"Their sloppy joe is pretty good. It has a smoke flavor to it. The sandwich bread is tasty.","useful":0,"cool":1},"TC0F1aB-5PLQlFh-siwpKg":{"text":"Great food! BBQ sauce was phenomenal and portions are large. Try the tuna dip too! Homemad","useful":0,"cool":0},"9NuFA931R4Pe6yTwv_U3SA":{"text":"The food is average, but the prices are pretty inflated. Being in Lakeview probably attrib","useful":2,"cool":0},"t_nqzTrSA7fi4bDK6-AIUw":{"text":"Great spot for local brews and burgers! I embarked on this little gem driving down West Ha","useful":2,"cool":1},"5EzeMiTGJf-ttjDabEvNlA":{"text":"If you like greasy food prepared by disinterested stoners for whom bathing and clean cloth","useful":0,"cool":0},"pNYIBwOdrhiGFJxGIhKyMA":{"text":"This place was amazing. Had our granddaughter unexpected and had to change plans. We where","useful":0,"cool":0},"DNOggYYvUPHC_XmLS3I4Vw":{"text":"Super chill place. Great burger and sloppy joe! Service is friendly and tvs inside and out","useful":0,"cool":0},"vVRo2v5jWgpZoGpZCZpWIw":{"text":"Came here for dinner with a small group and it was pretty good.  I got the brisket sandwic","useful":1,"cool":0},"uwZSEbbFMu6YIV0INTjzow":{"text":"The Zeus chicken sandwich is my favorite and they always have new specials on deck.\nGreat ","useful":0,"cool":0},"8QCmgsdReJmJov9zRtuoWg":{"text":"We were looking for a place to gather with moms and kids and started here. Great inside an","useful":6,"cool":5},"8BIOl2kloZC9aHnnD6SFLg":{"text":"I was excited to try this place because it has an outdoor playground for kiddos. However, ","useful":2,"cool":0},"gKltlln0o0k7BzjWaTQazQ":{"text":"Kind of small and out of the way, but I am a devoted fan of well-cooked brisket.  There ar","useful":0,"cool":1},"XDbKcPal_3BV8nXhNzeFRg":{"text":"Food here is A+ and the service is really good! Only negative thing I would say is that it","useful":0,"cool":0},"6z-Mufrf3q58GNfsttEdVA":{"text":"Will never order food from this place. It was really nasty. Also a bottle of water for $3.","useful":0,"cool":0},"l1XhGlnN1uJBieq0yrMQuA":{"text":"Backyard never fails to please.  It's my go to spot for a flat grilled chicken sandwich wi","useful":0,"cool":0},"HrylCJUR9wObG6BiXnYhrg":{"text":"I ordered a chicken sandwich, it was amazing. Love the food. I love how they are on the or","useful":0,"cool":0},"JA_6teC_1QmM-PmeDidaPw":{"text":"I really enjoy this place. Perfect place for lunch on a beautiful day. I got The Zeus, whi","useful":2,"cool":2},"DJVfnSs14EKEUCSFFEwDkw":{"text":"We were New Orleans for vacation and were looking for somewhere good to eat. Burgers sound","useful":0,"cool":0},"PL8adylfP6F3FeAfAL4rNw":{"text":"Shhh our little secret. Not really!! The posts are out. \n\nReally had a blast here drinking","useful":3,"cool":2},"8TRPMsstD896N9SDc6iXQg":{"text":"Pretty good place. Good service. The day I went the soda machine was out so they gave me a","useful":0,"cool":0},"s2uteX0iOy2cmQavsX9qvw":{"text":"It's good but no napkins on the table at a bbq place? Brisket sandwich was tender and mois","useful":0,"cool":0},"QlYOrwYht9o0eG0vjCKLlg":{"text":"Everything is terrific, including the small details. Buns are noticeably delicious, the co","useful":0,"cool":0},"Xo5P0Iu7PlOgaK7r85aiuw":{"text":"Good neighborhood place. Quality food, comfortable ambiance. Get the tots. Pulled  pork is","useful":0,"cool":0},"pW6SPGNHeCS8OLoxjrQGOg":{"text":"Consistently delicious! I'm never not been satisfied or disappointed. \nTheir deviled eggs ","useful":6,"cool":3},"dgZ9SG7MaKy-BAcZgtGWpQ":{"text":"The food is good but this restaurant does not adhere to any COVID or sanitation guidelines","useful":1,"cool":0},"ZGLYgEcVPjWCImJ55kbvew":{"text":"I went here yesterday for a late lunch, and I really enjoyed it! It was such a pretty day,","useful":3,"cool":2},"y6m7xIeB5Onf0KFnoBXL7w":{"text":"I'm a cry baby when it comes to fat on my meat! I gotta say, my brisket sandwich was soooo","useful":1,"cool":1},"XZE6JIdzHJaA2KkMaIog1Q":{"text":"Amazing service and even crazier food! This place is the one to stop at if you're needing ","useful":0,"cool":0},"AdHKDUqfIkv5DrwKrH672A":{"text":"Pulled pork sandwich was delicious.  Both BBq sauces  had some great flavor.  Staff was at","useful":0,"cool":0},"UTiPuC3yGX6eaBewJW0fTA":{"text":"We've been to the place twice. Both times they have had a line and only one register. The ","useful":1,"cool":1},"9caYdLy2lm3FJOCua-jZUA":{"text":"First time trying the Backyard and it was very good! They take social distancing seriously","useful":0,"cool":0},"uBMUqMIiU6sabEahHUpnGg":{"text":"Came to Backyard on one of my bike rides. Large outdoor seating area is great. Problem I h","useful":0,"cool":0},"rkd6eRLbM0WOnrxzaWhdWA":{"text":"I was hungry and really wanted to like this place. But its basic. Hot sausage was good. Fr","useful":0,"cool":0},"qZXbIrxS8B4cXywP16EeIQ":{"text":"Take-out order: This burger left a lot to be desired.  I've been to The Backyard in the pa","useful":0,"cool":0},"8hP5AoN0Ldal5vwy3RH-OQ":{"text":"Normally I get great food from The Backyard. Bit today getting my purchase to go was a mis","useful":0,"cool":0},"4axRf-RdnodJdpfSfdGTpA":{"text":"Decided to try a different BBQ place in Nola and wound up at The Backyard Nola. The girl t","useful":1,"cool":1},"SHU1fyyKu_nCNqX5ykeQaQ":{"text":"For me, these are my favorite wings in the city!!! $12 for 8 pieces may seem pricy for \"wi","useful":0,"cool":0},"1MeXqPKLei7AGffUqDGBRw":{"text":"Excellent food, great service, great vibe. We went here today with our 4 kids and everyone","useful":1,"cool":1},"a1cPI7kkl-UuE8QlFMKjkw":{"text":"This was a nice place. It's in a pretty cool location too. Plenty of social distancing bet","useful":0,"cool":0},"hcMwOjnC_dKK-85ZRE97gQ":{"text":"The food is delicious - pure and simple. Our first day in New Orleans and we had already m","useful":0,"cool":0},"4bTKpgkUDrDIAWo_Lz3qvA":{"text":"The backyard is great for parents who want to get out. They have great drinks and literall","useful":1,"cool":0},"rspUWk1H_gliKsYQdYod6A":{"text":"This is a cool place! There is a yard with play structures for kids and big wooden tables ","useful":3,"cool":0},"zqnrK-0fF79opOOkVq_WsQ":{"text":"Man, talk about good..Had a party of 6 and 4 got burgers and 2 got brisket sandwiches.  Th","useful":0,"cool":0},"nR2XjNnWn4UtgTocG4D5iA":{"text":"This place was delicious the burgers are super flavorful and they're following COVID guide","useful":0,"cool":0},"OP5J_L-MUy5teYTRWD7vaA":{"text":"Delicious! The food is so good we didn't even take pictures. \nThe tater tots and sweet pot","useful":0,"cool":0},"qw-Z1ex9qRmR_uWgttcyKQ":{"text":"There was a slug in my fries. At least I got a full refund, but only after asking. Their f","useful":1,"cool":0},"sG0_hlFdwpgiYR_6pTgPwg":{"text":"I came here for the first time today and the girl taking orders at the counter highly reco","useful":0,"cool":0},"zO9k2A5n4FmsL2UdVasRqw":{"text":"After not being back fir a few years this place pays off. The food is just as excellent as","useful":0,"cool":0},"jk2KL7rHfzz_ty-VF-JeoA":{"text":"The food wasn't the best, but it wasn't the worst. I kinda only stopped her because I was ","useful":3,"cool":0},"VSjcHhir9JCm2GlE6rysfA":{"text":"Stopped by for a quick bite and selected the burger. Two patties of ground beef with lettu","useful":0,"cool":0},"BToo00Fi5pfJFA5MI2HM5g":{"text":"So I'll preface by saying we did have an overall nice experience eating outside In the bea","useful":2,"cool":0},"WLMi4zRFxGPwc2HGng3hDQ":{"text":"Do yourself a favor and order the smoked chicken wings. Crispy and savory with a light buf","useful":2,"cool":2},"QmKKPtLD5VFn8rVi6QpLGg":{"text":"Thought i had found a great place.  Looks great but the Food is disgusting.  When my famil","useful":1,"cool":1},"hsZ75j-YFJ07wz9NwfhWQw":{"text":"Came to kill time while the DMV was on their lunch break. It was only one waitress and wha","useful":0,"cool":0},"43f03wB_9gbgRM5vqqJkIQ":{"text":"This is a great place for families.   I felt the staff went above and beyond to accommodat","useful":0,"cool":0},"W3kF5jbWzeylF12FTYiUcA":{"text":"Doubt these guys will make it long term. Food is super basic and the atmosphere is as well","useful":0,"cool":0},"Hn9iYTCuKZ_7q5RpfODvHA":{"text":"Growing up in Tennessee and spending 25+ years during my career in Dallas, BBQ has always ","useful":2,"cool":0},"vmq7qejtw4tKe-roHwLfRw":{"text":"Interesting spot serving great burgers, crispy tots, tender succulent brisket, and good mu","useful":0,"cool":0},"-6tuLAVTtrAx2nuD9if_Qw":{"text":"Owner Jason Tournillon has created a perfect spot at The Backyard, a place that truly does","useful":0,"cool":0},"9POdBDIVPAT8XIm8A6FOLg":{"text":"Amazing barbecue place so yummy and reasonably priced! The atmosphere is really cute! I wi","useful":0,"cool":0},"YNjjcguwAK3uKhSdUKDqWw":{"text":"An interesting little spot in Lakeview, which looks like one of our new breweries at first","useful":2,"cool":0},"P8DmsKcfSDeWP7qqA9-fOA":{"text":"I was on the hunt for a good burger in the city, Yelp'd this place and man I'm happy I sto","useful":1,"cool":0},"0bIhOxor3AJMKa8lZ6GdSA":{"text":"I used to eat here once a week when I lived around the corner. It was great then and is st","useful":0,"cool":0},"pw3WFpZXJBgxsN9nbCPW4w":{"text":"FASTEST BURGER I'VE EATEN IN YEARS\nAnd it was HUGE! The double patty, pimento cheese burge","useful":4,"cool":3},"UYzHZcTjoaVpv-3hMNyP6w":{"text":"This place was yummy and family friendly. We stopped on our way out of town. It's far from","useful":0,"cool":0},"h2nmiguG7ikfZtK4nIa7Qw":{"text":"Everything is terrific, including the small details. Buns are noticeably delicious, the co","useful":0,"cool":0},"1-3u2XhmW22gVXSLt0BkuA":{"text":"The lady who took my order was very rude . Then to top it all off it was a rat just sittin","useful":1,"cool":0},"MYZRJ747srbpGXWCx15smQ":{"text":"We went to the Backyard , on Harrison last night. There was 6 in our party. We all got bur","useful":1,"cool":0},"3QfrSGp2HmjFhHPGDHELKg":{"text":"I love this place! The staff is always so friendly and they always remember our order! My ","useful":1,"cool":1},"RZTNhkKXXCWvaaWhp198og":{"text":"Fast service. Friendly employees. Great place to watch football or any other sports game. ","useful":2,"cool":1},"XiiIhb4lot28B9fLr0VO2A":{"text":"UPDATE: they used to be SO, SO delicious. That is not really true anymore. The food is med","useful":0,"cool":0},"HVYBDXsLNmDXJJ9odkDSvA":{"text":"service was pretty good but the food was not so well. we got a sloppy joe which was dry no","useful":0,"cool":0},"flI4ZEqtArmQWjdDk190aQ":{"text":"Great little spot with a nice outdoor area (dog friendly as a bonus). There is limited par","useful":3,"cool":3},"ZFrSIsUmu4VxwDR4AmMRNA":{"text":"Interesting place; it has an outdoor play area. Obviously, they have a kids menu and boost","useful":1,"cool":1},"9SFf4RK2flYfi8_Qj8n6QA":{"text":"Interesting place; it has an outdoor play area. Obviously, they have a kids menu and boost","useful":1,"cool":1},"cydr2cok2_GhBAYqvOt3Cg":{"text":"This place is great for kids! When the weather is good, the kids can play on the very nice","useful":12,"cool":2},"dFM2PNt_oT4VPO91Yz7twQ":{"text":"Excellent ! Great outside space with picnic tables, TVs counter seating  and dog friendly.","useful":1,"cool":0},"2LCZUcNdwwkNkFAo9tLHTg":{"text":"I have given this place numerous tries. I can no longer waste my money here. On their best","useful":0,"cool":0},"obL1qnEeRVRW-NoNYvkDzA":{"text":"My boyfriend and I just moved to the neighborhood and had to give this place a try when we","useful":0,"cool":0}}